{"patent_id": "10-2022-0066325", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0166394", "출원번호": "10-2022-0066325", "발명의 명칭": "NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템", "출원인": "주식회사 펜타브리드", "발명자": "박태희"}}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "통합 멤버십 플랫폼 서비스 장치(100)로서,멤버십 NFT를 보유한 사용자의 인증을 수행하도록 구성되는 인증 모듈(130); 및상기 인증이 수행된 사용자의 NFT 거래를 수행하도록 구성되는 거래 모듈(140)을 포함하는,통합 멤버십 플랫폼 서비스 장치(100)."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 인증 모듈(130)은, 사용자 단말(300)로부터 수신된 인증 요청에 따라 사용자가 상기 멤버십 NFT를 보유하는지 여부를 확인하고 상기 멤버십 NFT를 보유한 사용자에 대해서만 인증을 수행하도록 추가로 구성되는,통합 멤버십 플랫폼 서비스 장치(100)."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 거래 모듈(140)은, 사용자 또는 멤버십 입점 업체의 NFT 판매를 수행하도록 구성되는 판매부(141); 및상기 사용자 또는 상기 멤버십 입점 업체의 NFT 교환을 수행하도록 구성되는 교환부(142)를 포함하는,통합 멤버십 플랫폼 서비스 장치(100)."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 멤버십 NFT를 사용자에게 제공하도록 구성되는 NFT 관리 모듈(120)을 더 포함하는,통합 멤버십 플랫폼 서비스 장치(100)."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "통합 멤버십 플랫폼 서비스 시스템(1000)으로서,제 1항에 따른 통합 멤버십 플랫폼 서비스 장치(100);상기 통합 멤버십 플랫폼 서비스 장치(100)와 통신 가능하게 결합되는 멤버십 입점 업체 서버(200); 및상기 통합 멤버십 플랫폼 서비스 장치(100)와 통신 가능하게 결합되는 사용자 단말(300)을 포함하는,통합 멤버십 플랫폼 서비스 시스템(1000)."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "통합 멤버십 플랫폼 서비스 방법으로서,멤버십 NFT를 보유한 사용자의 인증을 수행하는 단계; 및상기 인증이 수행된 사용자의 NFT 거래를 수행하는 단계를 포함하는,통합 멤버십 플랫폼 서비스 방법.공개특허 10-2023-0166394-3-청구항 7 제 6항에 있어서,상기 멤버십 NFT를 보유한 사용자의 인증을 수행하는 단계는,사용자 단말로부터 수신된 인증 요청에 따라 사용자가 상기 멤버십 NFT를 보유하는지 여부를 확인하고 상기 멤버십 NFT를 보유한 사용자에 대해서만 인증을 수행하는 것을 특징으로 하는,통합 멤버십 플랫폼 서비스 방법."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 인증이 수행된 사용자의 NFT 거래를 수행하는 단계는,사용자 또는 멤버십 입점 업체의 NFT 판매를 수행하는 단계; 및상기 사용자 또는 상기 멤버십 입점 업체의 NFT 교환을 수행하는 단계를 포함하는,통합 멤버십 플랫폼 서비스 방법."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서,상기 멤버십 NFT를 사용자에게 제공하는 단계를 더 포함하는,통합 멤버십 플랫폼 서비스 방법."}
{"patent_id": "10-2022-0066325", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어인 컴퓨터와 결합되어, 제 6항 내지 제 9항 중 어느 한 항에 따른 방법을 수행할 수 있도록 컴퓨터 판독 가능한 기록 매체에 저장되는,컴퓨터 프로그램."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "통합 멤버십 플랫폼 서비스 장치가 제공된다. 상기 통합 멤버십 플랫폼 서비스 장치는, 멤버십 NFT를 보유한 사 용자의 인증을 수행하도록 구성되는 인증 모듈; 및 상기 인증이 수행된 사용자의 NFT 거래를 수행하도록 구성되 는 거래 모듈을 포함할 수 있다."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템에 관한 발명으로서, 보다 구 체적으로는 적어도 하나의 업체 및 해당 업체의 사용자에게 메타버스 생태계 내에서 NFT 인증 기반의 통합 멤버 십 플랫폼 서비스를 제공할 수 있는 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템에 관한 발명이다."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "메타버스(Metaverse)란 현실 세계를 의미하는 '유니버스(Universe)'와 '가공, 추상'을 의미하는 '메타(Meta)'의 합성어로서 주로 3차원 가상세계를 의미할 수 있으나, 메타버스는 단순히 3차원 가상세계를 의미하는 것만이 아 닌 3차원 가상세계와 관련된 VR(Virtual Reality, 가상현실), AR(Augmented Reality, 증강현실), XR(eXtended Reality, 확장현실) 등과 빅데이터, 인공지능, 블록체인, 전자상거래, IoT 등의 기술을 포괄하고, 이러한 다양 한 기술 등을 이용하여 세상과 소통하는 새로운 방법론이자 변화를 인식하기 위한 틀에 가깝다. 최근 메타버스의 개념에 대한 인식이 확장됨에 따라 NFT(Non-Fungible Token, 대체 불가능한 토큰)에 대한 관심 도 매우 높아지는 추세이다. NFT는 블록체인 기술을 기반으로 만들어진 희소성을 갖는 디지털 자산으로서 기존 의 가상자산(예를 들어, 비트코인 등)과는 달리 별도의 고유한 인식 값이 부여되어 복제가 불가능한 고유성을 가지므로 디지털 자산 자체가 원본임을 증명해주는 수단으로 활용될 수 있다. 또한, NFT는 블록체인을 기반으로 하고 있어 소유권과 판매 이력 등의 관련 정보가 모두 블록체인에 저장되고 이에 따라 최초 발행자를 언제든지확인할 수 있어 위조 등이 불가능하다는 특성을 갖는다. 한편, 일반적으로 기존의 통합 멤버십 서비스는 복수 개의 업체들 간에 고객 정보 공유, 범용적인 고객 서비스 제공, 고객 확장 등을 용이하게 위해 각 하위 업체 간 제휴를 맺고 각 하위 업체의 사용자인 회원들에게 각각 멤버십의 지위를 부여하여 마일리지 적립, 할인 혜택 등의 다양한 혜택을 제공하는 방식으로 이루어진다. 그러 나, 이러한 기존의 통합 멤버십 서비스는 각 업체들 간의 신규 제휴 또는 제휴 종료 등의 변수 이벤트 발생으로 인해 회원의 주민등록번호, 전화번호 등의 회원 정보가 유출되기 쉬운 문제점이 있다. 또한, 기존의 통합 멤버십 서비스는 새로운 업체와 제휴를 위해 사람이 직접 제휴 계약을 맺어야 하고, 제휴 계 약 이후에도 새로운 업체의 사용자에게 멤버십 지위를 부여하기 위해 새롭게 통합 멤버십 회원 계정 가입을 유 도하거나 회원 정보 이전 및 공유 등에 동의를 요구해야 하는 등의 번거로운 절차를 거쳐야 하는 문제점이 있다. 또한, 기존의 통합 멤버십 서비스는 제휴를 맺은 업체가 업체의 사용자 즉, 회원에게 다양한 혜택, 서비스 등을 제공하는 방식의 일방향적 형태로 이루어지는 것일 뿐, 정작 멤버십 지위를 부여받은 회원들 간에 서로 어떠한 혜택, 서비스 등을 공유, 거래, 교환하거나 또는 회원이 업체에게 서비스를 제공하는 방식의 쌍방향적 형태로는 이루어지지 않으므로, 멤버십이라는 커뮤니티를 다양하게 적극 활용하기 어려운 문제점이 있다. 그러므로, 본 발명자는 이러한 문제점을 해결하기 위해서 제휴 절차를 간소화하여 새로운 업체의 제휴 접근성을 높이고 제휴 업체의 회원인 사용자에게도 번거로운 절차 없이 멤버십 지위를 부여할 수 있을 뿐만 아니라, 업체 의 회원 정보 유출 문제도 해결할 수 있으며, 이와 동시에 멤버십 커뮤니티를 적극 활용할 수 있도록 하는 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템을 제안한다."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 문제점을 해결하기 위해서 안출된 것으로, 본 발명은 제휴 절차를 간소화하여 새로운 업체의 제휴 접근성을 높이고 제휴 업체의 회원인 사용자에게도 번거로운 절차 없이 멤버십 지위를 부여할 수 있는 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템을 제공하는 것을 목적으로 한다. 또한, 본 발명은 NFT의 대체 불가능한 특성을 활용하여 제휴한 업체의 회원 정보 유출 문제도 해결할 수 있을 뿐만 아니라 일방향적 형태가 아닌 쌍방향적 형태의 자유로운 멤버십 커뮤니티를 적극 활용할 수 있는 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는, 멤버십 NFT를 보유한 사용자의 인증을 수행하도록 구성되는 인증 모듈; 및 상기 인증이 수행된 사용자의 NFT 거래를 수 행하도록 구성되는 거래 모듈을 포함할 수 있다. 또한, 상기 인증 모듈은, 사용자 단말로부터 수신된 인증 요청에 따라 사용자가 상기 멤버십 NFT를 보유하는지 여부를 확인하고 상기 멤버십 NFT를 보유한 사용자에 대해서만 인증을 수행하도록 추가로 구성될 수 있다. 또한, 상기 거래 모듈은, 사용자 또는 멤버십 입점 업체의 NFT 판매를 수행하도록 구성되는 판매부; 및 상기 사 용자 또는 상기 멤버십 입점 업체의 NFT 교환을 수행하도록 구성되는 교환부를 포함할 수 있다. 또한, 상기 통합 멤버십 플랫폼 서비스 장치는, 상기 멤버십 NFT를 사용자에게 제공하도록 구성되는 NFT 관리 모듈을 더 포함할 수 있다. 상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 시스템은, 상기 통합 멤버십 플랫폼 서비스 장치; 상기 통합 멤버십 플랫폼 서비스 장치와 통신 가능하게 결합되는 멤버십 입점 업체 서버; 및 상기 통합 멤버십 플랫폼 서비스 장치와 통신 가능하게 결합되는 사용자 단말을 포함할 수 있다. 상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법은, 멤버십 NFT를 보유한 사용자의 인증을 수행하는 단계; 및 상기 인증이 수행된 사용자의 NFT 거래를 수행하는 단계를 포 함할 수 있다. 또한, 상기 멤버십 NFT를 보유한 사용자의 인증을 수행하는 단계는, 사용자 단말로부터 수신된 인증 요청에 따 라 사용자가 상기 멤버십 NFT를 보유하는지 여부를 확인하고 상기 멤버십 NFT를 보유한 사용자에 대해서만 인증 을 수행하는 것을 특징으로 할 수 있다. 또한, 상기 인증이 수행된 사용자의 NFT 거래를 수행하는 단계는, 사용자 또는 멤버십 입점 업체의 NFT 판매를 수행하는 단계; 및 상기 사용자 또는 상기 멤버십 입점 업체의 NFT 교환을 수행하는 단계를 포함할 수 있다. 또한, 상기 통합 멤버십 플랫폼 서비스 방법은, 상기 멤버십 NFT를 사용자에게 제공하는 단계를 더 포함할 수 있다. 상기의 기술적 과제를 해결하기 위한 본 발명의 일 실시예에 따른 컴퓨터 프로그램은, 하드웨어인 컴퓨터와 결 합되어, 상기 통합 멤버십 플랫폼 서비스 방법을 수행할 수 있도록 컴퓨터 판독 가능한 기록 매체에 저장될 수 있다."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템에 의하면, 제휴 절차를 간소화하여 새로운 업체의 제휴 접근성을 높이고 제휴 업체의 회원인 사용자에게도 번거로운 절차 없이 멤버십 지위를 부여할 수 있다. 또한, 본 발명의 일 실시예에 따른 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템에 의 하면, NFT의 대체 불가능한 특성을 활용하여 제휴한 업체의 회원 정보 유출 문제도 해결할 수 있을 뿐만 아니라 일방향적 형태가 아닌 쌍방향적 형태의 자유로운 멤버십 커뮤니티를 적극 활용할 수 있다."}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 실시예들은 첨부된 도면들을 참조하여 설명한다. 각 도면의 구성요소들에 참조 부호를 부 가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가 지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한 다. 또한, 이하에서 본 발명의 실시예들을 설명할 것이나, 본 발명의 기술적 사상은 이에 한정되거나 제한되지 않고 당업자에 의해 변형되어 다양하게 실시될 수 있다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외 하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 본 발명의 실시예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한 정되지 않는다. 도 1은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 시스템을 설명하기 위한 개략적인 블록도 이다. 도 1에 도시되는 바와 같이, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 시스템은 통합 멤버 십 플랫폼 서비스 장치, 멤버십 입점 업체 서버, 사용자 단말 등을 포함할 수 있다. 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 NFT 인증 기반의 통합 멤버십 플랫폼 서비 스를 제공하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장 치는 멤버십 NFT를 멤버십 입점 업체 서버 및/또는 사용자 단말에게 제공하고, 멤버십 NFT를 보 유한 사용자의 인증을 수행할 수 있으며, 인증이 사용된 사용자의 NFT 거래를 수행하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 가상공간 및/또는 가상커뮤니티를 구현할 수 있고, 마케팅 서비스를 제공하도록 구성될 수도 있다. 본 발명의 일 실시예에 따른 통합 멤버십 플랫 폼 서비스 장치의 세부적인 구성에 대해서는 멤버십 입점 업체 서버 및 사용자 단말을 먼저 기 술한 후 상세히 설명하기로 한다. 이어서, 본 발명의 일 실시예에 따른 멤버십 입점 업체 서버는 통합 멤버십 플랫폼 서비스 장치와 통 신 가능하게 결합될 수 있다. 본 발명의 일 실시예에 따른 멤버십 입점 업체 서버는 통합 멤버십 플랫폼 서비스 장치가 제공하는 통합 멤버십 플랫폼 서비스에 가입 또는 제휴한 업체가 운영하는 서버로서 업체를 이용하는 적어도 하나의 사용자에 관한 정보를 보유할 수 있다. 또한, 도 1에 도시되는 바와 같이, 본 발명의 일 실시예에 따른 멤버십 입점 업체 서버는 복수 개로 구비될 수 있고, 복수 개로 구비되는 멤버십 입점 업체 서버(200-1, 200-2, 200-3, … ,200-N; 여기서 N은 자연수)는 각각 통합 멤버십 플랫폼 서비스 장치(10 0)와 통신 가능하게 결합될 수 있다. 또한, 본 발명의 일 실시예에 따른 사용자 단말은 통합 멤버십 플랫폼 서비스 장치와 통신 가능하게 결합될 수 있다. 본 발명의 일 실시예에 따른 사용자 단말은 멤버십 입점 업체 서버를 운영하는 업체 를 이용하는 사용자의 사용자 단말로서 통합 멤버십 플랫폼 서비스 장치를 통해 멤버십 입점 업체 서 버와 통신하거나 또는 멤버십 입점 업체 서버와 직접 통신하도록 구성될 수도 있다. 마찬가지로, 도 1에 도시되는 바와 같이, 본 발명의 일 실시예에 따른 사용자 단말은 복수 개로 구비될 수 있고, 복수 개 로 구비되는 사용자 단말(300-1, 300-2, 300-3, …,300-M; 여기서 M은 자연수)은 각각 통합 멤버십 플랫폼 서비 스 장치와 통신 가능하게 결합될 수 있다. 참고로, 사용자 단말은 가입자 유닛, 가입자국, 이동국, 모바일 단말, 원격국, 원격 단말, 모바일 디바이 스, 액세스 단말, 단말, 무선 통신 디바이스, 사용자 에이전트, 사용자 디바이스 또는 사용자 장비(UE)라고 지 칭될 수도 있다. 액세스 단말은 셀룰러 전화, 코드리스 전화, 세션 개시 프로토콜(SIP) 전화, 무선 로컬 루프 (WLL) 스테이션, 개인용 디지털 보조기(PDA), 무선 접속 능력을 구비한 핸드헬드 디바이스, 컴퓨팅 디바이스 또 는 무선 모뎀에 접속되는 다른 프로세싱 디바이스일수 있다. 도 1에 도시되는 바와 같이, 본 발명의 일 실시예에 따르면, 통합 멤버십 플랫폼 서비스 장치는 제어 모듈 , NFT 관리 모듈, 인증 모듈, 거래 모듈, 가상 모듈, 마케팅 모듈, 저장 모듈 , 통신 모듈 등을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장 치는 적어도 하나의 멤버십 입점 업체 서버 및 적어도 하나의 사용자 단말과 통신 가능하게 결 합될 수 있다. 또한, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 개인 또는 사설 기업에 의해 제작되"}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "어 운영되는 자체 컴퓨터 프로그램 기반의 장치에 해당하며, 관련 기술분야에서의 다양한 표현 방식에 따라 디 바이스(device), 장비(equipment), 서버(server), 플랫폼(platform) 등의 용어로 지칭될 수도 있다. 또한, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 DApp(Decentralized Application)으로 구현 되어 탈중앙화된 형태로 데이터를 분산 저장하도록 구성될 수 있다. 참고로, 도 1에 도시되는 통합 멤버십 플랫폼 서비스 장치의 구성요소들(110, 120, 130, 140, 150, 160, 170, 180)은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치의 동작, 기능 등을 설명하기 위 한 예시적인 구성요소들에 불과하다. 즉, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치가 도시된 구성요소들(110, 120, 130, 140, 150, 160, 170, 180) 이외의 다른 구성요소(예를 들어, 전원부 등)를 추가로 포함할 수 있음은 명백하다.먼저, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 통합 멤버십 플랫폼 서비스 장치 의 다른 구성요소들(120, 130, 140, 150, 160, 170, 180)을 제어하도록 구성되는 제어 모듈을 포함 할 수 있다. 참고로, 제어 모듈은 프로세서(processor), 마이크로프로세서(micro-processor), 컨트롤러 (controller), 마이크로컨트롤러(micro-controller) 등으로 구현될 수 있다. 본 발명에 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 멤버십 NFT를 사용자에게 제공하도록 구성 되는 NFT 관리 모듈을 포함할 수 있다. 본 발명의 일 실시예에 따른 NFT 관리 모듈은 블록체인 기반 으로서 탈중앙화 방식으로 NFT에 관한 기록을 분산 저장할 수 있다. 또한, 도 2를 참고하면, 본 발명의 일 실시 예에 따른 NFT 관리 모듈은 멤버십 NFT 생성부, 멤버십 NFT 변환부, 멤버십 NFT 부여부 등을 포함할 수 있다. 참고로, NFT(Non-Fungible Token)는 블록체인 기술을 기반으로 만들어진 희소성을 갖는 디지털 자산으로서 기존 의 가상자산(예를 들어, 비트코인 등)과는 달리 별도의 고유한 인식 값이 부여되어 복제가 불가능한 고유성을 가질 수 있고 디지털 자산 자체가 원본임을 증명해주는 수단으로 활용될 수 있다. 또한, NFT는 블록체인을 기반 으로 하고 있어 소유권과 판매 이력 등의 관련 정보가 모두 블록체인에 저장되고 이에 따라 최초 발행자를 언제 든지 확인할 수 있어 위조 등이 불가능하다는 특성을 가질 수 있다. 본 발명의 일 실시예에 따른 멤버십 NFT 생성부는 멤버십 NFT를 생성하도록 구성될 수 있다. 보다 구체적 으로, 본 발명의 일 실시예에 따른 멤버십 NFT 생성부는 멤버십 입점 업체 서버를 이용하는 사용자의 수에 대응하는 수만큼 멤버십 NFT를 생성하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 멤버십 NFT 생성부는 임의의 이미지 또는 문자 등을 조합하여 임의의 코드를 생성하고, 생성된 코드를 스마트 컨트랙트에 기록하여 블록체인 상에 등록함으로써 멤버십 NFT를 생성하도록 구 성될 수 있다. 또한, 본 발명의 일 실시예에 따른 멤버십 NFT 생성부는 NFT를 생성할 수 있는 별도의 서버 와 연계되어 멤버십 입점 업체 서버를 이용하는 사용자의 수에 대응하는 수만큼 멤버십 NFT를 생성할 수도 있다. 참고로, 멤버십 NFT는 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치가 제공하는 통합 멤버 십 플랫폼 서비스를 이용할 수 있는 입장권 역할을 수행하는 NFT로서 그 형태에 제한됨이 없이 특정 이미지, 문 자, 영상 또는 이들의 조합 등으로 구성되는 다양한 형태의 코드로 구현될 수 있다. 본 발명의 일 실시예에 따른 멤버십 NFT 생성부는 통신 모듈을 통해 멤버십 입점 업체 서버로부 터 멤버십 입점 요청을 수신하고, 수신된 멤버십 입점 요청에 따라 멤버십 NFT를 생성하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 멤버십 NFT 생성부는 수신된 멤버십 입점 요청에 따라 멤버 십 입점 요청을 송신한 멤버십 입점 업체 서버에 해당 멤버십 입점 업체 서버를 운영하는 업체의 사 용자의 수에 관한 정보를 요청하고 이를 수신함으로써 해당 멤버십 입점 업체 서버를 운영하는 업체의 사 용자의 수를 확인할 수 있고, 확인된 사용자의 수에 대응하는 수만큼 멤버십 NFT를 생성하도록 구성될 수 있다. 이와 같이, 본 발명의 일 실시예에 따른 멤버십 NFT 생성부가 자동으로 멤버십 입점 업체 서버의 사 용자의 수를 판단하여 사용자의 수에 대응하는 수만큼의 멤버십 NFT를 생성함으로써 멤버십 입점 업체 서버 를 운영하는 업체가 용이하게 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치를 사용할 수 있도록 유도할 수 있고, 또한 멤버십 입점 업체 서버를 운영하는 업체를 이용하는 사용자를 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치의 사용자로 용이하게 전환시킬 수 있다. 본 발명의 일 실시예에 따른 멤버십 NFT 변환부는 멤버십 입점 업체 서버의 각 사용자에게 할당된 수 치를 멤버십 NFT로 변환시키도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 멤버십 NFT 변 환부는 멤버십 입점 업체 서버를 운영하는 업체를 이용하는 각 사용자에게 할당된 수치에 대응하는 금전적 가치만큼의 FT(Fungible Token, 예를 들어, 비트코인 등)를 각 사용자에게 할당하고, 할당된 FT가 갖는 금전적 가치에 대응하는 멤버십 NFT를 생성함으로써 각 사용자에게 할당된 수치를 멤버십 NFT로 변환시키도록 구성될 수 있다. 참고로, FT는 NFT와 마찬가지로 블록체인 상에 분산 저장되어 발행, 거래 내역이 모두 공개되는 특성이 있으나, NFT와 달리 고유의 인식 값이 부여되지는 않아 교환 가능하고 다른 FT로 교환 가능한 특성이 있어 가상화폐로서 기능할 수 있다. 또한, 멤버십 입점 업체 서버의 각 사용자에게 할당된 수치는 멤버십 입점 업체 서버를 운영하는 업 체에서 해당 업체를 이용하는 각 사용자에게 부여하거나 또는 적립된 포인트, 마일리지 등 해당 업체에서 할인, 상품 교환 등으로 활용될 수 있는 금전적 가치를 갖는 수치를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 멤버십 NFT 변환부는 멤버십 입점 업체 서버의 각 사용자에게 할 당된 수치에 대응하는 금전적 가치를 갖는 멤버십 NFT를 생성함으로써 각 사용자에게 할당된 수치를 멤버십 NFT 로 변환하도록 구성될 수 있다. 이 경우, 본 발명의 일 실시예에 따른 멤버십 NFT 변환부는 생성된 NFT에 멤버십 입점 업체 서버의 각 사용자에게 할당된 수치에 대응하는 금전적 가치를 해당 멤버십 NFT의 최소 거래 가치로 보장함으로써 할당된 수치에 대응하는 금전적 가치를 갖는 멤버십 NFT를 생성하도록 구성될 수 있 다. 즉, 본 발명의 일 실시예에 따른 멤버십 NFT 변환부는 각 사용자에게 생성된 멤버십 NFT를 각 사용자 에게 할당된 수치에 대응하는 금전적 가치를 갖는 FT의 수량으로 구매함으로써 해당 멤버십 NFT의 최소 거래 가 치를 보장하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 멤버십 NFT 부여부는 생성되거나 또는 변환된 멤버십 NFT를 사용자에게 부여 하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 멤버십 NFT 부여부는 멤버십 입점 업체 서버로 각 사용자에 대응하는 수만큼의 멤버십 NFT를 제공하고, 제공된 멤버십 NFT를 멤버십 입점 업 체 서버의 사용자에게 각각 할당시키고, 할당된 멤버십 NFT를 멤버십 입점 업체 서버를 통해 사용자 에게 제공함으로써 멤버십 NFT를 사용자에게 부여하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 멤버십 NFT 부여부는 멤버십 입점 업체 서버의 각 사용자에게 할 당된 수치가 변환된 멤버십 NFT를 멤버십 입점 업체 서버로 제공하고, 제공된 멤버십 NFT를 수치가 할당된 동일한 사용자에게 각각 할당시키고, 할당된 멤버십 NFT를 멤버십 입점 업체 서버를 통해 사용자에게 제공 함으로써 멤버십 NFT를 사용자에게 부여하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 멤버십 NFT 부여부가 멤버십 입점 업체 서버를 통해 사용자에게 제공하 는 방식의 일 예로서, 본 발명의 일 실시예에 따른 멤버십 NFT 부여부는 멤버십 입점 업체 서버에 의 해 운영되는 웹 홈페이지를 통해 생성 또는 변환된 멤버십 NFT를 사용자가 제공받을 수 있는 링크를 노출시키고, 사용자는 NFT 전자 지갑 어플리케이션이 설치된 사용자 단말을 이용하여 노출된 링크를 통해 멤버십 NFT를 다운로드함으로써 멤버십 NFT를 제공받을 수 있다. 본 발명의 추가 실시예에 따르면, NFT 관리 모듈은 멤버십 입점 업체 서버를 이용하지 않는 사용자의 요청에 따라 멤버십 NFT 생성부를 통해 멤버십 NFT를 생성하고, 멤버십 NFT 부여부를 통해 요청한 사 용자에게 멤버십 NFT를 부여하도록 구성될 수도 있다. 이에 따라, 멤버십 입점 업체 서버의 사용자뿐만 아 니라 일반적인 다른 사용자도 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치가 제공하는 통 합 멤버십 플랫폼 서비스를 이용할 수 있도록 한다. 이어서, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 멤버십 NFT를 보유한 사용자의 인 증을 수행하도록 구성되는 인증 모듈을 포함할 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 인 증 모듈은 통신 모듈을 통해 사용자의 사용자 단말로부터 수신된 인증 요청에 따라 사용자가 멤 버십 NFT를 보유하는지 여부를 확인하고 멤버십 NFT를 보유한 사용자에 대해서만 인증을 수행하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 인증 모듈은 사용자 단말로부터 수신된 인증 요청에 따라 사용자 가 멤버십 NFT를 보유하는지 여부를 확인하고 사용자가 멤버십 NFT를 보유하지 않는 것으로 확인되면 사용자 단 말로부터의 인증 요청에 대해 인증을 거절하도록 구성될 수 있다. 즉, 본 발명의 일 실시예에 따른 인증 모듈은 사용자가 멤버십 NFT를 보유하지 않는 것으로 확인되면 인증 요청에 대해 인증 거절 신호를 사용자 단말로 송신하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 인증 모듈은 멤버십 NFT가 아닌 NFT를 보유하는지 여부를 확인하고 멤 버십 NFT가 아닌 NFT를 보유한 사용자에 대해서도 인증을 수행하도록 추가로 구성될 수 있다. 이에 따라, 본 발 명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치에 의해 부여된 멤버십 NFT뿐만 아니라 동일한 블 록체인 상의 다른 NFT를 보유한 사용자도 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치에 의해 제공되는 통합 멤버십 플랫폼 서비스를 이용할 수 있도록 한다. 또한, 본 발명의 일 실시예에 따른 인증 모듈은 NFT 전자 지갑을 구현하는 어플리케이션이 설치된 사용자 단말과 호환 가능하도록 구성될 수 있고, 통신 모듈을 통해 사용자 단말과 통신하며 사용자의 멤버십 NFT 보유 여부를 확인하고 멤버십 NFT 보유자에 대해서만 인증을 수행하도록 구성될 수 있다. 본 발명의일 실시예에 따른 인증 모듈이 멤버십 NFT를 보유한 사용자에 대해서만 인증을 수행함으로써 단순히 멤버 십 NFT를 보유하는지 여부에 대해서만 확인하므로 사용자의 개인정보 유출을 방지할 수 있고, 사용자가 본 발명 의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치가 제공하는 통합 멤버십 플랫폼 서비스를 용이하게 제공받도록 할 수 있다. 본 발명의 추가 실시예에 따르면, 인증 모듈은 인증이 거절된 사용자에 대해 인증이 수행될 수 있는 절차 를 안내하도록 구성될 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 인증 모듈은 멤버십 입점 업체 서버에 접속하는 링크를 인증 거절된 사용자의 사용자 단말로 송신하고, 멤버십 입점 업체 서버(20 0)의 사용자로서 멤버십 NFT를 부여받는 절차를 안내하도록 구성될 수 있다. 이어서, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 인증이 수행된 사용자의 NFT 거래 를 수행하도록 구성되는 거래 모듈을 포함할 수 있다. 도 3을 참고하면, 본 발명의 일 실시예에 따른 거래 모듈은 판매부, 교환부 등을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 거래 모듈 은 블록체인 기반으로 거래 내역에 관한 기록 정보, 멤버십 NFT를 포함하는 NFT의 소유권 정보 등을 포함 하는 스마트 컨트랙트를 블록체인 상에 분산하여 기록 저장하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 판매부는 NFT에 대한 구매 요청 또는 판매 요청에 따라 NFT를 판매하도록 구 성될 수 있다. 또한, 본 발명의 일 실시예에 따른 판매부는 사용자 또는 멤버십 입점 업체의 NFT 판매를 수행하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 판매부는 NFT에 관한 기록이 저장된 블록체인 상에서 통용되는 TF와 NFT를 교환함으로써 NFT를 판매하도록 구성될 수 있다. 본 발명의 일 실 시예에 따른 판매부는 사용자 단말로부터 수신된 NFT 구매 요청에 따라 저장 모듈에 수신된 NFT 구매 요청에 관한 기록을 저장하고, 멤버십 입점 업체 서버로 NFT 구매 요청을 전달하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 판매부는 멤버십 입점 업체 서버로부터 수신된 NFT 판매 요 청(즉, NFT 구매 요청 승인)에 따라 저장 모듈에 수신된 NFT 판매 요청에 관한 기록을 저장하고, NFT의 블 록체인 상에 스마트 컨트랙트 형태로 저장된 소유권 정보를 구매 요청한 사용자로 변경함으로써 NFT 거래를 완 료하도록 구성될 수 있다. 참고로, 판매 요청 또는 구매 요청에는 판매 가격 또는 구매 가격에 관한 정보가 포 함될 수 있다. 또한, 본 발명의 일 실시예에 따른 판매부는 경매 방식으로 NFT를 판매하도록 구성될 수도 있다. 상술한 바와 같이, 본 발명의 일 실시예에 따른 판매부는 멤버십 입점 업체 서버가 보유한 NFT를 사 용자에게 사용자 단말을 통해 판매하도록 구성될 수 있을 뿐만 아니라, 본 발명의 일 실시예에 따른 판매 부는 사용자가 보유한 NFT를 멤버십 입점 업체 서버에게 판매하도록 구성될 수도 있음은 물론이다. 이에 더하여, 본 발명의 일 실시예에 따른 판매부는 사용자 간에 NFT를 판매하도록 구성될 수 있고, 이에 따라 NFT를 보유한 사용자 및 멤버십 입점 업체 서버 간 자유로운 NFT 거래 시장이 활성화될 수 있다. 본 발명의 일 실시예에 따른 판매부는 멤버십 NFT뿐만 아니라 멤버십 NFT와 동일한 블록체인 상에 분산 저장 된 멤버십 NFT가 아닌 NFT에 대해서도 판매를 수행할 수도 있음은 물론이다. 이어서, 본 발명의 일 실시예에 따른 교환부는 NFT에 대한 교환 요청에 따라 NFT를 교환하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 교환부는 사용자 또는 멤버십 입점 업체의 NFT 교환을 수행하도 록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 교환부는 사용자 또는 멤버십 입점 업 체의 NFT를 해당 NFT에 관한 기록이 저장된 동일한 블록체인 상의 다른 NFT를 교환함으로써 NFT를 교환하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 교환부는 사용자 단말로부터 수신된 NFT 교환 요청에 따라 저장 모듈에 수신된 NFT 교환 요청에 관한 기록을 저장하고, 멤버십 입점 업체 서버로 NFT 교환 요청을 전달하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 교환부는 멤버십 입점 업체 서버 로부터 수신된 NFT 교환 요청(즉, NFT 교환 요청 승인)에 따라 저장 모듈에 수신된 NFT 교환 요청에 관한 기록을 저장하고, 멤버십 NFT의 블록체인 상에 스마트 컨트랙트 형태로 저장된 소유권 정보를 교환 요청한 사용자로 상호 변경함으로써 NFT 교환을 완료하도록 구성될 수 있다. 상술한 바와 같이, 본 발명의 일 실시예에 따른 교환부는 멤버십 입점 업체 서버가 보유한 NFT와 사 용자가 보유한 NFT를 교환하도록 구성될 수 있을 뿐만 아니라, 사용자 간 또는 업체 간에도 보유한 NFT를 교환 하도록 구성될 수 있음은 물론이다. 참고로, NFT는 멤버십 NFT를 포함하는 동일한 블록체인 상의 NFT를 의미하 는 것일 수 있고, 멤버십 NFT는 인증을 위해 보유가 요구되는 NFT를 의미할 수 있다. 또한, 본 발명의 일 실시예에 따른 교환부는 각 멤버십 입점 업체의 멤버십 NFT에 대해 가치 평가를 수행 하고, 수행된 가치 평가를 기반으로 멤버십 NFT 간 교환 가치를 산출하여 교환하도록 구성될 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 교환부는 각 멤버십 입점 업체의 멤버십 NFT마다 구매 예정자들을 모집하 고 모집된 구매 예정자들의 구매 예정 가격을 분석함으로써 가치 평가를 수행할 수 있고, 수행된 가치 평가를 기반으로 각 멤버십 입점 업체의 멤버십 NFT의 교환 가치를 산출함으로써 용이하게 멤버십 NFT 간 거래를 수행 하도록 구성될 수 있다. 본 발명의 추가 실시예에 따르면, 거래 모듈은 동일한 블록체인 상에 분산 저장된 NFT뿐만 아니라 상이한 블록체인 상에 각각 분산 저장된 NFT의 판매 또는 교환을 수행할 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 거래 모듈은 제1 블록체인 상에 분산 저장된 NFT의 거래 내역 및 구매의사를 갖는 구매 예정자의 구 매 예정 가격을 분석하고, 마찬가지로 제2 블록체인 상에 분산 저장된 NFT의 거래 내역 및 구매의사를 갖는 구 매 예정 가격을 분석하며, 제1 및 제2 블록체인 상에서 분석된 구매 예정 가격을 상호 비교하여 제1 및 제2 블 록체인 상에 분산 저장된 각각의 NFT의 금전적 가치를 조율함으로써 상이한 블록체인 상에 각각 분산 저장된 NFT의 판매 또는 교환을 수행할 수 있다. 본 발명의 일 실시예에 따르면, 통합 멤버십 플랫폼 서비스 장치는 가상 서비스를 구현하도록 구성되는 가 상 모듈을 포함할 수 있다. 도 4를 참고하면, 본 발명의 일 실시예에 따른 가상 모듈은 가상공간 구 현부, 가상커뮤니티 구현부 등을 포함할 수 있다. 본 발명의 일 실시예에 따른 가상공간 구현부는 멤버십 NFT를 보유하여 인증이 완료된 사용자가 활동할 수 있는 가상공간을 구현하도록 구성될 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 가상공간 구현부 는 인증을 수행한 사용자가 VR(Virtual Reality) 기기를 통해 입장 가능한 가상공간을 구현할 수 있고 또 한, 각 사용자가 커스터마이징 가능한 아바타를 제작하고 제작한 아바타를 통해 구현된 가상공간에 입장하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상공간 구현부는 멤버십 입점 업체 서버 또는 사용자 단말로부터 통신 모듈을 통해 수신된 가상공간 참가 요청에 따라 멤버십 입점 업체 서버(20 0)를 운영하는 멤버십 입점 업체 또는 사용자를 가상공간에 참가시키도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상커뮤니티 구현부는 가상공간 구현부를 통해 구현된 가상공간 에서 인증을 수행한 사용자 간에 소통할 수 있는 가상커뮤니티를 구현하도록 구성될 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 가상커뮤니티 구현부는 각 멤버십 입점 업체 서버를 이용하는 사용자 간에 소통할 수 있는 가상커뮤니티 또는 인증을 수행한 모든 사용자 간에 소통할 수 있는 가상커뮤니티 등을 구현하 도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상커뮤니티 구현부는 각 멤버십 입점 업체 서 버로부터 입력된 정보를 기반으로 사용자와 대화 가능한 AI 봇을 구현하도록 구성될 수 있고, 구현된 가상 커뮤니티에서 구현된 AI 봇과 사용자가 소통하도록 구성될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상커뮤니티 구현부에 의해 구현되는 가상커뮤니티는 3D 형식의 대화 공간으로 구현될 수 있거나 또는 2D 형식의 채팅창 형태로 구현될 수 있다. 또한, 본 발명의 일 실시예에 따른 가상커뮤니티 구현부는 사용자 단말에 설치된 SNS, 대화용 어플리케이션과 연동되어 외부의 해당 어 플리케이션을 통해 사용자가 소통하도록 구성될 수도 있다. 또한, 본 발명의 일 실시예에 따른 가상커뮤니티 구 현부는 멤버십 입점 업체 서버 또는 사용자 단말로부터 통신 모듈을 통해 수신된 가상커뮤 니티 참가 요청에 따라 멤버십 입점 업체 서버를 운영하는 멤버십 입점 업체 또는 사용자를 가상커뮤니티 에 참가시키도록 구성될 수 있다. 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 멤버십 입점 업체 또는 사용자에게 마케팅 서비스를 제공하도록 구성되는 마케팅 모듈을 포함할 수 있다. 도 5를 참고하면, 본 발명의 일 실시예에 따른 마케팅 모듈은 가상매장 구현부, 가상캐릭터 구현부, 컨텐츠 제작 배포부 등을 포함 할 수 있다. 본 발명의 일 실시예에 따른 가상매장 구현부는 멤버십 입점 업체의 가상매장을 구현하도록 구성될 수 있 다. 예시적으로, 본 발명의 일 실시예에 따른 가상매장 구현부는 멤버십 입점 업체 서버를 운영하는 업체의 오프라인 매장에 관한 정보를 기반으로 가상공간 구현부에 의해 구현된 가상공간 내에 가상매장을 구현하도록 구성될 수 있다. 참고로, 오프라인 매장에 관한 정보는 판매물품, 매장구조, 인테리어 등을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 가상매장 구현부는 가상매장에서 사용자에게 가상의 상품을 판매하도록 구성될 수 있고, 사용자가 가상매장에서 상품을 구매 시 오프라인 상의 실제 상품을 사용자에게 배 송하도록 구성될 수도 있다. 또한, 본 발명의 일 실시예에 따른 가상매장 구현부는 가상공간 내에 브랜드 홍보관을 구축하여 멤버십 입점 업체 서버를 홍보하도록 구성될 수도 있다. 본 발명의 일 실시예에 따른 가상매 장 구현부가 오프라인 매장에 관한 정보를 기반으로 가상매장을 구현함으로써 온·오프 시너지를 발굴할수 있다. 본 발명의 일 실시예에 따른 가상캐릭터 구현부는 멤버십 입점 업체를 홍보하기 위한 가상캐릭터를 구현하 도록 구성될 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 가상캐릭터 구현부는 멤버십 입점 업체를 상징하는 가상캐릭터를 구현 시 다양한 버전의 가상캐릭터를 멤버십 입점 업체에 제시하고, 제시된 가상캐릭터 중 멤버십 입점 업체 서버로부터 선택된 가상캐릭터를 구현하도록 구성될 수 있다. 또한, 본 발명의 일 실 시예에 따른 가상캐릭터 구현부는 구현된 가상캐릭터를 활용하여 멤버십 입점 업체를 홍보하도록 구성될 수 있고, 예를 들어 SNS 등을 통해 가상캐릭터가 멤버십 입점 업체를 오프라인 공간 또는 온라인 가상공간에서 홍보하고, 가상캐릭터를 인플루언서(influencer)로 성장시키고 멤버십 입점 업체의 마케팅 활동을 수행하도록 구성될 수 있다. 이어서, 본 발명의 일 실시예에 따른 컨텐츠 제작 배포부는 홍보 컨텐츠를 제작하고 배포하도록 구성될 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 컨텐츠 제작 배포부는 구현된 가상매장, 가상캐릭터 등이 등장하는 홍보 영상을 제작하도록 구성될 수 있고, 제작된 홍보 영상을 SNS 및 각종 커뮤니티에 노출시킴으로써 마케팅 서비스를 제공하도록 구성될 수 있다. 본 발명의 일 실시예에 따른 컨텐츠 제작 배포부는 숏폼 동 영상을 제작하여 홍보하도록 구성될 수도 있다. 한편, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 통합 멤버십 플랫폼 서비스 장치 의 구성요소들(110, 120, 130, 140, 150, 160, 180)의 동작에 관한 데이터를 저장하도록 구성되는 저장 모듈을 포함할 수 있다. 예시적으로, 본 발명의 일 실시예에 따른 저장 모듈에는 멤버십 NFT 생성, 변환, 부여 등에 관한 데이터, 멤버십 NFT 보유 인증에 관한 데이터 등이 저장될 수 있고, 저장 모듈은 블 록체인으로 구현되어 저장된 데이터들을 분산하여 기록 저장하도록 구성될 수 있다. 참고로, 저장 모듈은, 블록체인 상에 분산 저장되지 않는 데이터들(예를 들어, 가상 서비스 또는 마케팅 서비스 구현을 위한 데이터 등)에 대해서는, HDD(Hard Disk Drive), ROM(Read Only Memory), RAM(Random Access Memory), EEPROM(Electrically Erasable and Programmable Read Only Memory), 플래시 메모리(flash memory), CF(Compact Flash) 카드, SD(Secure Digital) 카드, SM(Smart Media) 카드, MMC(Multimedia) 카드 또는 메모리 스틱(Memory Stick) 등 정보의 입출력이 가능한 다양한 형태의 저장 장치로 구현될 수 있으며, 도 1에 도시된 바와 같이 통합 멤버십 플랫폼 서비스 장치의 내부에 구비되거나 별도의 외부 장치에 구비될 수 있다. 또는, 저장 모듈이 인터넷 상에서 저장 기능을 수행하는 웹 스토리지(web storage)로 대체될 수 도 있다. 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는 적어도 하나의 멤버십 입점 업체 서버 및/또는 적어도 하나의 사용자 단말과 통신 가능하게 결합되는 통신 모듈을 포함할 수 있다. 참고로, 통신 모듈은 외부와의 직접 연결 또는 네트워크를 통한 연결을 위해 제공되는 것으로서, 유선 및/ 또는 무선 통신 모듈일 수 있다. 구체적으로, 통신 모듈은 제어 모듈, NFT 관리 모듈, 인 증 모듈, 거래 모듈, 가상 모듈, 마케팅 모듈, 저장 모듈 등으로부터의 데이터를 유 선 또는 무선으로 전송하거나, 외부로부터 데이터를 유선 또는 무선 수신하여 제어 모듈, NFT 관리 모듈 , 인증 모듈, 거래 모듈, 가상 모듈 또는 마케팅 모듈로 전달하거나 저장 모듈(17 0)에 저장할 수 있다. 상기 데이터에는 텍스트, 이미지, 동화상 등의 컨텐츠 등이 포함될 수 있다. 통신 모듈은 랜(LAN), WCDMA(Wideband Code Division Multiple Access), LTE(Long Term Evolution), WiBro(Wireless Broadband Internet), RF(Radio Frequency)통신, 무선랜(Wireless LAN), 와이파이(Wireless Fidelity), NFC(Near Field Communication), 블루투스, 적외선 통신 등을 통해 통신할 수 있다. 다만, 이는 예"}
{"patent_id": "10-2022-0066325", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "시적인 것으로서, 본 발명이 적용되는 실시예에 따라 당해 기술분야에서 적용 가능한 다양한 유, 무선 통신 기 술이 이용될 수 있다. 본 발명의 추가 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는, 통합 멤버십 플랫폼 서비스 장치 로부터 통합 멤버십 플랫폼 서비스를 제공받지 않고 있는 업체를 검색하고, 검색된 업체에게 멤버십 NFT를 생성 하여 제공함으로써 통합 멤버십 플랫폼 서비스를 제공받는 멤버십 입점 업체로 제안하도록 구성될 수 있다. 또한, 본 발명의 추가 실시예에 따른 통합 멤버십 플랫폼 서비스 장치는, 멤버십 NFT를 보유하여 인증을 수행한 사용자의 동의 하에 다른 멤버십 입점 업체에 대한 이용을 제안하도록 구성될 수 있고, 제안에 따라 사 용자가 다른 멤버십 입점 업체를 이용 시 추가적인 멤버십 NFT를 부여하도록 구성될 수 있다. 이에 따라, 사용 자는 다양한 멤버십 입점 업체를 이용할 수 있고, 멤버십 입점 업체도 많은 사용자를 확보할 수 있다. 도 6은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의해 사용자의 인증 및 NFT 거래가 수행 되는 단계(S100)를 설명하기 위한 순서도이다. 먼저, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의한 사용자의 인증과 관련하여, 멤버십 입점 업체 서버가 통합 멤버십 플랫폼 서비스 장치에 멤버십 입점 요청을 송신하면(S102), 통합 멤버 십 플랫폼 서비스 장치는 통신 모듈을 통해 멤버십 입점 요청을 수신하고, 수신된 멤버십 입점 요청 에 따라 멤버십 NFT 생성부가 멤버십 NFT를 생성하거나 또는 멤버십 NFT 변환부가 멤버십 입점 업체 서버의 각 사용자에게 할당된 수치를 멤버십 NFT로 변환시킬 수 있다(S104). 이어서, 멤버십 NFT 부여부는 멤버십 입점 업체 서버로 각 사용자에 대응하는 수만큼의 멤버십 NFT를 제공하고(S106), 제공된 멤버십 NFT를 멤버십 입점 업체 서버의 각 사용자에게 할당시키고 사용자의 사용 자 단말로 할당된 멤버십 NFT를 제공할 수 있다(S108). 이후, 사용자가 NFT 지갑 어플리케이션이 설치된 사용자 단말을 통해 통합 멤버십 플랫폼 서비스 장치에 인증 요청을 송신하고(S110), 통합 멤버십 플 랫폼 서비스 장치는 수신된 인증 요청에 따라 사용자가 멤버십 NFT를 보유하는지 여부를 확인하고(S112), 사용자의 멤버십 NFT 보유 여부에 따라 인증을 수행하거나 또는 인증을 거절할 수 있다(S114). 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의한 NFT 거래와 관련하여, 사용자가 사용자 단 말을 통해 NFT 구매 또는 교환 요청을 송신하면(S116), 통합 멤버십 플랫폼 서비스 장치는 저장 모듈 에 NFT 구매 또는 교환 요청에 관한 기록을 저장하고(S118), 멤버십 입점 업체 서버가 NFT 구매 또는 교환 요청에 대응하여 NFT 판매 또는 교환 요청을 승인하고 이를 통합 멤버십 플랫폼 서비스 장치에 송신 하면, 통합 멤버십 플랫폼 서비스 장치는 저장 모듈에 NFT 판매 또는 교환 요청 승인에 관한 기록을 저장하고(S122), NFT의 블록체인 상에 스마트 컨트랙트 형태로 저장된 소유권 정보를 구매 요청한 사용자로 변 경함으로써 NFT 거래 또는 교환을 완료할 수 있다(S124). 또한, 이러한 NFT 거래 또는 교환에 관한 기록은 블록 체인 상에 분산 저장될 수 있다(S126). 도 7은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의해 가상 서비스 및 마케팅 서비스가 제공되는 단계(S200)를 설명하기 위한 순서도이다. 먼저, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의한 가상 서비스와 관련하여, 통합 멤버 십 플랫폼 서비스 장치는 가상공간 구현부를 통해 멤버십 NFT를 보유하여 인증이 완료된 사용자가 활 동할 수 잇는 가상공간을 구현하고, 가상커뮤니티 구현부를 통해 인증이 완료된 사용자가 소통할 수 있는 가상커뮤니티를 구현할 수 있다(S202). 이어서, 사용자가 인증 모듈을 통한 NFT 보유 인증을 완료한 후 사용자 단말을 통해 통합 멤버십 플 랫폼 서비스 장치에 가상공간 또는 가상커뮤니티 참가 요청을 송신할 수 있고(S204), 멤버십 입점 업체 서 버도 가상공간 또는 가상커뮤니티 참가 요청을 통합 멤버십 플랫폼 서비스 장치에 송신할 수 있다 (S206). 이에, 통합 멤버십 플랫폼 서비스 장치는 멤버십 입점 업체 서버 및/또는 사용자 단말 로부터의 참가 요청에 따라 멤버십 입점 업체 및/또는 사용자를 가상공간 또는 가상커뮤니티에 참가시킴으로써 가상공간 또는 가상커뮤니티 서비스를 제공할 수 있다(S208). 또한, 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의한 마케팅 서비스와 관련하여, 통합 멤 버십 플랫폼 서비스 장치는 마케팅 모듈을 통해 멤버십 입점 업체 서버에 마케팅 서비스를 제안 할 수 있고(S210), 이에 대응하여 멤버십 입점 업체 서버가 통합 멤버십 플랫폼 서비스 장치에 마케 팅 서비스를 요청할 수 있다(S212). 물론, 통합 멤버십 플랫폼 서비스 장치가 먼저 마케팅 서비스를 제안 하지 않더라도 멤버십 입점 업체 서버가 통합 멤버십 플랫폼 서비스 장치에 마케팅 서비스를 요청할 수 있음은 물론이다. 통합 멤버십 플랫폼 서비스 장치는, 수신된 마케팅 서비스 요청에 따라 가상매장 구현부를 통해 멤버 십 입점 업체의 가상매장을 구현하고, 가상캐릭터 구현부를 통해 멤버십 입점 업체를 홍보하기 위한 가상 캐릭터를 구현하며, 컨텐츠 제작 배포부를 통해 구현된 가상매장 및/또는 가상캐릭터를 활용하여 홍보 컨 텐츠를 제작할 수 있다(S214). 이후, 통합 멤버십 플랫폼 서비스 장치는 가상매장을 활용한 브랜드 홍보관 구축, 가상캐릭터를 인플루언서로 성장시키고 홍보에 활용하거나 또는 제작된 홍보 컨텐츠를 배포하는 등으로 멤버십 입점 업체 서버에 마케팅 서비스를 제공할 수 있고(S216), 또한 사용자 단말로 멤버십 입점 업체에 관한 홍보 컨텐츠 등을 노출시킴으로써 멤버십 입점 업체에 관한 광고, 홍보 등을 수행할 수 있다 (S218).상술한 바와 같이, 본 발명의 일 실시예에 따른 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템에 의하면, 제휴 절차를 간소화하여 새로운 업체의 제휴 접근성을 높이고 제휴 업체의 회원인 사용자에게 도 번거로운 절차 없이 멤버십 지위를 부여할 수 있다. 또한, 본 발명의 일 실시예에 따른 NFT 인증 기반의 통합 멤버십 플랫폼 서비스 방법 및 그 장치와 시스템에 의 하면, NFT의 대체 불가능한 특성을 활용하여 제휴한 업체의 회원 정보 유출 문제도 해결할 수 있을 뿐만 아니라 일방향적 형태가 아닌 쌍방향적 형태의 자유로운 멤버십 커뮤니티를 적극 활용할 수 있다. 한편, 본 명세서에 기재된 다양한 실시예들은 하드웨어, 미들웨어, 마이크로코드, 소프트웨어 및/또는 이들의 조합에 의해 구현될 수 있다. 예를 들어, 다양한 실시예들은 하나 이상의 주문형 반도체(ASIC)들, 디지털 신호 프로세서(DSP)들, 디지털 신호 프로세싱 디바이스(DSPD)들, 프로그램어블 논리 디바이스(PLD)들, 필드 프로그램 어블 게이트 어레이(FPGA)들, 프로세서들, 컨트롤러들, 마이크로컨트롤러들, 마이크로프로세서들, 여기서 제시 되는 기능들을 수행하도록 설계되는 다른 전자 유닛들 또는 이들의 조합 내에서 구현될 수 있다. 또한, 예를 들어, 다양한 실시예들은 명령들을 포함하는 컴퓨터-판독가능한 매체에 수록되거나 인코딩될 수 있 다. 컴퓨터-판독가능한 매체에 수록 또는 인코딩된 명령들은 프로그램 가능한 프로세서 또는 다른 프로세서로 하여금 예컨대, 명령들이 실행될 때 방법을 수행하게끔 할 수 있다. 컴퓨터-판독가능한 매체는 컴퓨터 저장 매 체를 포함하며, 컴퓨터 저장 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수도 있다. 예를 들어, 이러한 컴퓨터-판독가능한 매체는 RAM, ROM, EEPROM, CD-ROM 또는 기타 광학 디스크 저장 매체, 자기 디 스크 저장 매체 또는 기타 자기 저장 디바이스를 포함할 수 있다. 이러한 하드웨어, 소프트웨어, 펌웨어 등은 본 명세서에 기술된 다양한 동작들 및 기능들을 지원하도록 동일한 디바이스 내에서 또는 개별 디바이스들 내에서 구현될 수 있다. 추가적으로, 본 발명에서 \"~부\"로 기재된 구성 요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지만 상호 운용 가능한 로직 디바이스들로서 개별 적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특징들의 묘사는 서로 다른 기능적 실시예들을 강 조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 실현되어야만 함을 필수 적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유닛들과 관련된 기능은 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합 될 수 있다. 특정한 순서로 동작들이 도면에 도시되어 있지만, 이러한 동작들이 원하는 결과를 달성하기 위해 도시된 특정한 순서, 또는 순차적인 순서로 수행되거나, 또는 모든 도시된 동작이 수행되어야 할 필요가 있는 것으로 이해되지 말아야 한다. 임의의 환경에서는, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 더욱이, 상술한 실시예에서 다양한 구성요소들의 구분은 모든 실시예에서 이러한 구분을 필요로 하는 것으로 이해되어서는 안되며, 기술된 구성요소들이 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패키징될 수 있다는 것이 이해되어야 한다. 이상에서와 같이 도면과 명세서에서 최적 실시예가 개시되었다. 여기서 특정한 용어들이 사용되었으나, 이는 단 지 본 발명을 설명하기 위한 목적에서 사용된 것이지 의미한정이나 특허청구범위에 기재된 본 발명의 범위를 제 한하기 위하여 사용된 것은 아니다. 그러므로 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호범위는 첨부된 특 허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0066325", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 시스템을 설명하기 위한 개략적인 블록도 이다. 도 2는 본 발명의 일 실시예에 따른 NFT 관리 모듈을 설명하기 위한 개략적인 블록도이다. 도 3은 본 발명의 일 실시예에 따른 거래 모듈을 설명하기 위한 개략적인 블록도이다. 도 4는 본 발명의 일 실시예에 따른 가상 모듈을 설명하기 위한 개략적인 블록도이다. 도 5는 본 발명의 일 실시예에 따른 마케팅 모듈을 설명하기 위한 개략적인 블록도이다. 도 6은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의해 사용자의 인증 및 NFT 거래가 수행 되는 단계(S100)를 설명하기 위한 순서도이다. 도 7은 본 발명의 일 실시예에 따른 통합 멤버십 플랫폼 서비스 방법에 의해 가상 서비스 및 마케팅 서비스가 제공되는 단계(S200)를 설명하기 위한 순서도이다."}
