{"patent_id": "10-2022-0043525", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0131052", "출원번호": "10-2022-0043525", "발명의 명칭": "무선 통신 시스템에서 복호 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "임현택"}}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부호를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 장치에 있어서,복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR값을 생성하는 MIMO 검출기;상기 MIMO 검출기의 LLR 값을 이용하여 채널 복호 및 제2연산을 통해 채널 복호된 LLR 값을 출력하는 채널 복호기; 및상기 채널 복호된 LLR 값을 상기 수신 장치에서 사용하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 상한임계값과 하한 임계값의 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 피드백 보상부;를 포함하는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 MIMO 검출기는,상기 복수의 안테나로부터 수신된 신호와 상기 피드백 LLR 값를 이용하여 제1 LLR 값을 생성하는 MIMO 검출기코어; 및상기 제1 LLR 값과 상기 피드백 LLR 값 간의 차를 계산하여 상기 출력 LLR 값을 생성하는 제1가산기;를 포함하는 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 채널 복호기는,상기 출력 LLR 값을 이용하여 채널 복호하여 제2 LLR 값을 출력하는 채널 복호기 코어; 및상기 제2 LLR 값을 상기 제2연산하여 상기 복호된 LLR 값을 생성하는 제2가산기;를 포함하는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 피드백 보상부는,상기 수신 장치에서 사용하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 임계값을 이용하여 상기 상한 임계값 및 상기 하한 임계값을 결정하는 외부 LLR 범위 계산기; 및상기 복호된 LLR 값이 상기 외부 LLR 범위 계산기로부터 수신된 상기 상한 임계값 및 상기 하한 임계값 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 외부 LLR 생성기;를 포함하는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 채널 복호기는,상기 출력 LLR 값을 이용하여 채널 복호하여 제2 LLR 값을 출력하는 채널 복호기 코어로 구성되는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 피드백 보상부는,상기 제2 LLR 값을 상기 제2연산하여 상기 복호된 LLR 값을 생성하는 초기 외부 LLR 계산기;상기 수신 장치에서 사용하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 임계값을 이용하여 상기 상한 임계값 및 상기 하한 임계값을 결정하는 외부 LLR 범위 계산기; 및공개특허 10-2023-0131052-3-상기 복호된 LLR 값이 상기 외부 LLR 범위 계산기로부터 수신된 상기 상한 임계값 및 상기 하한 임계값 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 외부 LLR 생성기;를 포함하는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 제2연산은,상기 제2 LLR 값과 상기 출력 LLR 값 간의 차를 계산하는 연산인, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 외부 LLR 생성기는,상기 복호된 LLR 값이 상기 상한 임계값 보다 큰 경우 상기 복호된 LLR 값을 상기 상한 임계값으로 설정하여 상기 피드백 LLR 값을 생성하고,상기 복호된 LLR 값이 상기 하한 임계값보다 작은 경우 상기 복호된 LLR 값이 하한 임계값으로 설정하여 상기피드백 LLR 값을 생성하는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부호를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 장치에 있어서,복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR값을 생성하는 MIMO 검출기;채널 복호기를 포함하며, 상기 채널 복호기는:상기 출력 LLR 값을 이용하여 채널 복호하여 제2 LLR 값을 출력하는 채널 복호기 코어;상기 제2 LLR 값을 제2연산하여 상기 복호된 LLR 값을 생성하는 초기 외부 LLR 계산기;상기 수신 장치에서 사용하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 임계값을 이용하여 상기 상한 임계값 및 상기 하한 임계값을 결정하는 외부 LLR 범위 계산기; 및상기 복호된 LLR 값이 상기 외부 LLR 범위 계산기로부터 수신된 상기 상한 임계값 및 상기 하한 임계값 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 외부 LLR 생성기;를 포함하는, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 MIMO 검출기는,상기 복수의 안테나로부터 수신된 신호와 상기 피드백 LLR 값을 이용하여 제1 LLR 값을 생성하는 MIMO 검출기코어; 및상기 제1 LLR 값과 상기 피드백 LLR 값 간의 차를 계산하여 상기 출력 LLR 값을 생성하는 제1가산기;를 포함하는 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 제2연산은,상기 제2 LLR 값과 상기 출력 LLR 값 간의 차를 계산하는 연산인, 복호 장치."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 외부 LLR 생성기는,상기 복호된 LLR 값이 상기 상한 임계값 보다 큰 경우 상기 복호된 LLR 값을 상기 상한 임계값으로 설정하여 상기 피드백 LLR 값을 생성하고,상기 복호된 LLR 값이 상기 하한 임계값보다 작은 경우 상기 복호된 LLR 값이 하한 임계값으로 설정하여 상기피드백 LLR 값을 생성하는, 복호 장치.공개특허 10-2023-0131052-4-청구항 13 다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부호를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 방법에 있어서,복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR값을 생성하는 단계;상기 출력 LLR 값을 이용하여 채널 복호하여 제2 LLR 값을 출력하는 단계;상기 제2 LLR 값을 제2연산하여 상기 복호된 LLR 값을 생성하는 단계;상기 수신 장치에서 사용하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 임계값을 이용하여 상기 상한 임계값 및 상기 하한 임계값을 결정하는 단계; 및상기 복호된 LLR 값이 상기 상한 임계값 및 상기 하한 임계값 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 단계;를 포함하는, 복호 방법."}
{"patent_id": "10-2022-0043525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서 상기 피드백 LLR 값은,상기 복호된 LLR 값이 상기 상한 임계값 보다 큰 경우 상기 복호된 LLR 값을 상기 상한 임계값으로 설정하여 상기 피드백 LLR 값을 생성하고,상기 복호된 LLR 값이 상기 하한 임계값보다 작은 경우 상기 복호된 LLR 값이 하한 임계값으로 설정하여 상기피드백 LLR 값을 생성하는, 복호 방법."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 장치는, 다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부호 를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 장치로서, 복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR 값을 생성하는 MIMO 검출기; 상기 MIMO 검출기의 LLR 값을 이용하여 채널 복호 및 제2연 산을 통해 채널 복호된 LLR 값을 출력하는 채널 복호기; 및 상기 채널 복호된 LLR 값을 상기 수신 장치에서 사용 하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 상한 임계값과 하한 임계값의 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 피드백 보상부;를 포함할 수 있다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템에서 전송된 데이터의 오류를 정정하기 위한 복호 장치 및 방법에 관한 것으로, 특 히 다중 입출력(Multiple-Input Multiple-Output, MIMO) 시스템과 채널 부호화 코드를 연접하여 사용하는 무선 통신 시스템에서 채널 복호를 위한 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 무선 통신 시스템에서는 통신 채널에 존재하는 잡음으로 인해 수신기에서 데이터 오류가 발생할 수 있다. 이처럼 통신 채널에 의해 발생된 오류를 수신기에서 정정할 수 있도록 설계된 부호화 방식을 오류 정정 부호(error correcting codes, ECC)라고 한다. 또한 송신기와 수신기 사이의 통신 경로 즉, 통신 채널 상에서 발생하는 오류를 정정하기 위한 부호화를 채널 부호화(channel coding)라고도 한다. 오류 정정 부호 기법은 전송하고자 하는 데이터 비트에 추가 비트를 추가하여 송신하고, 수신기에서는 이러한 추가 비트를 활용하여 전송된 데이터 비트에 포함된 오류를 정정하는 복호(decoding) 동작을 수행한다. 이와 같 은 오류 정정 부호에는 컨볼루션 부호(convolutional coding), 터보 부호(turbo coding), 저밀도 패리티 검사 부호(low-density parity-check coding, LDPC coding), 및 극부호(polar coding) 방식 등이 존재하는데, 특히 터보 부호와 LDPC 부호는 이론적인 채널 용량(channel capacity)에 근접하는 성능을 갖는 우수한 부호로 LTE 및 5G와 같은 무선 통신 표준의 핵심 기술로 채택되었다. 한편, MIMO는 송신 장치와 수신 장치 간에 다수의 안테나를 사용하여, 대역폭과 전력의 증가 없이 안테나 수에 비례하여 무선 통신 시스템의 용량을 높이는 기술이다. 이에, LTE나 5G와 같은 무선 통신 시스템에서는 MIMO를 핵심 기술로 채택하였으며, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO), 전차원 다중입출력 (full dimensional MIMO: FD-MIMO) 등으로 발전이 되어 왔다. 또한 무선 통신 시스템은 계속 발전하고 있으며, LTE나 5G 보다 더 높은 데이터 전송률을 필요로 하는 6G 무선 토신 방식에서도 MIMO는 핵심 기술로 논의되고 있다. 이상에서 설명한 채널 부호화 방식에 따라 전송된 신호를 수신하는 수신기는 수신된 신호를 복호하여 오류를 검 출하는 절차를 거치게 된다. LTE에 사용되는 터보 부호와 5G에 사용되는 LDPC 부호는 데이터 비트(information bit)에 추가 비트인 패리티 비트(parity bit)를 부가하여 전송 비트를 구성한다. 이때 송신기와 수신기 간에 MIMO 방식을 사용하는 경우 MIMO 검출기에서는 전송 비트들에 대한 채널 로그 우도비(Log Likelihood Ratio, LLR)를 계산하여 채널 복호기로 제공한다. 채널 복호기는 입력된 채널 LLR을 이용하여 채널 복호를 수행한다. 이러한 채널 복호 기법 중 반복 검출 및 복호(iterative detection and decoding, IDD) 기법이 대표적인 채널 복호 기법으로 널리 사용되고 있다. IDD 기법을 사용하는 경우 채널 복호기는 복호된 정보를 MIMO 검출기로 제 공하고, 다시 MIMO 검출기에서 제공된 정보를 이용하여 복호를 수행한다. 채널 복호기와 MIMO 검출기 간에 제공되는 정보는 LLR이기 때문에 매우 큰 데이터가 될 수 있다. 따라서 실제 구현에서는 복잡도의 증가와 처리 속도 및 메모리의 용량 제한으로 인하여 고정 소수점(fixed-point) 방식으로 구현하게 된다. 따라서 고정 소수점 방식에서는 정보들을 양자화(quantization)하는 양에 따라 범위의 제약이 발생한다. 만일 양자화 레벨(quantization level)을 높이는 경우 성능의 손실이 감소하게 되지만, 복잡도는 증 가하게 된다. 반대로 양자화 레벨(quantization level)을 낮추는 경우 복잡도는 감소하지만 성능의 손실이 증가 하게 된다. 즉, 이는 상호간 트레이드-오프(trade-off) 관계에 있다. 따라서 양자화 레벨에 따라 일정 크기 이 상의 고정 소수점에서 최적의 양자화 레벨을 결정하는 것이 매우 중요한 요소가 될 수 있다. 한편, 정보를 양자화함에 따라 필연적으로 오류 또는 정보의 왜곡이 발생한다. 특히 양자화 범위를 벗어나는 값 을 갖는 경우 고정 소수점 방식에서 설정한 최대 크기로 포화(saturation)되어 표현된다. 이는 결과적으로 채널 복호기의 성능을 저하하는 문제를 야기하게 된다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 개시에서는 무선 통신 시스템에 복호 성능 열화를 방지하기 위한 채널 복호기 장치 및 방법을 제공한 다. 또한 본 개시에서는 무선 통신 시스템에서 채널 복호기의 복잡도를 증가시키지 않으면서 보다 높은 복호 성능을 유지할 수 있는 채널 복호기 장치 및 방법을 제공한다. 또한 본 개시에서는 MIMO 방식을 사용하는 통신 시스템에서 순차 간섭 제거(Successive Interference Cancelling, SIC)를 사용하는 수신기를 사용할 때, 채널 복호기의 연출력(Soft-Output)의 성능을 높이기 위한 장치 및 방법을 제공한다. 또한 본 개시에서는 MIMO 방식을 사용하는 통신 시스템에서 순차 간섭 제거(Successive Interference Cancelling, SIC)를 사용하는 수신기를 사용할 때, 복잡도를 낮추기 위한 채널 복호 장치 및 방법을 제공한다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 장치는, 다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부 호를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 장치로서, 복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR 값을 생성하는 MIMO 검출기; 상기 MIMO 검출기의 LLR 값을 이용하여 채널 복호 및 제2연산을 통해 채널 복호된 LLR 값을 출력하는 채널 복호기; 및 상기 채널 복호된 LLR 값을 상기 수신 장치에 서 사용하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 상한 임계값과 하한 임계값의 범위 내의 값이 되도 록 상기 피드백 LLR 값을 생성하는 피드백 보상부;를 포함할 수 있다. 본 개시의 다른 실시예에 따른 장치는, 다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부호를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 장치로서, 복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR 값을 생성하는 MIMO 검출기; 채널 복호기를 포함하며, 상기 채널 복호기는: 상기 출력 LLR 값을 이용하여 채널 복호하여 제2 LLR 값을 출력하는 채널 복호기 코어; 상 기 제2 LLR 값을 제2연산하여 상기 복호된 LLR 값을 생성하는 초기 외부 LLR 계산기; 상기 수신 장치에서 사용 하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 임계값을 이용하여 상기 상한 임계값 및 상기 하한 임계값 을 결정하는 외부 LLR 범위 계산기; 및 상기 복호된 LLR 값이 상기 외부 LLR 범위 계산기로부터 수신된 상기 상한 임계값 및 상기 하한 임계값 범위 내의 값이 되도록 상기 피드백 LLR 값을 생성하는 외부 LLR 생성기;를 포 함할 수 있다. 본 개시의 일 실시예에 따른 방법은, 다중 입력 다중 출력(multiple-input multiple-output, MIMO)과 채널 부 호를 연접하여 사용하는 무선 통신 시스템의 수신 장치에서 반복 검출 및 복호(iterative detection and decoding, IDD) 방법으로, 복수의 안테나로부터 수신된 신호와 피드백 로그 우도비(log likelihood ratio, LLR) 값을 이용하여 출력 LLR 값을 생성하는 단계; 상기 출력 LLR 값을 이용하여 채널 복호하여 제2 LLR 값을 출력하는 단계; 상기 제2 LLR 값을 제2연산하여 상기 복호된 LLR 값을 생성하는 단계; 상기 수신 장치에서 사용 하는 LLR의 비트 폭(bit width)에 의거하여 결정되는 임계값을 이용하여 상기 상한 임계값 및 상기 하한 임계값 을 결정하는 단계; 및 상기 복호된 LLR 값이 상기 상한 임계값 및 상기 하한 임계값 범위 내의 값이 되도록 상 기 피드백 LLR 값을 생성하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 복호 장치를 사용하는 경우 채널 복호기의 복잡도를 크게 증가시키지 않으면서도 부호화된 MIMO 시스템의 순차 간섭 수신기의 성능을 개선할 수 있는 연출력 생성이 가능하다. 또한, 본 개시에서 제시하는 방 법은 기존의 채널 복호기와 독립적으로 구성하여 적용할 수 있으므로, 구현이 복잡한 채널 복호기를 재설계 및 구현하지 않고도 기존 수신기의 성능을 개선할 수 있다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 다양한 실시 예들을 상세히 설명한다. 이때, 첨부된 도면들에서 동일한 구성 요소는 가능한 동일한 부호로 나타내고 있음에 유의해야 한다. 또한 이하에 첨부된 본 발명의 도면은 본 발명의 이해를 돕기 위해 제공되는 것으로, 본 발명의 도면에 예시된 형태 또는 배치 등에 본 발명이 제한되지 않음에 유의해야 한다. 또한 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것 이다. 하기의 설명에서는 본 발명의 다양한 실시 예들에 따른 동작을 이해하는데 필요한 부분만이 설명되며, 그 이외 부분의 설명은 본 발명의 요지를 흩트리지 않도록 생략될 것이라는 것을 유의하여야 한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다.디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다.도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 다중 입력 다중 출력(Multiple-Input Multiple-Output, MIMO) 시스템의 송신기 및 수신기의 간략화한 구성을 예시한 도면이다. 본 개시에 따른 복호기를 설명하기 앞서 도 2를 참조하여 MIMO 시스템의 송신기 및 수신기 구성을 살펴보기로 하자. 도 2를 참조하면, 송신기와 수신기를 예시하고 있다. 이하의 설명에서 송신기를 무선 통신 시스 템 중 LTE, 5G 및/또는 6G 시스템의 기지국으로 가정하여 설명하기로 하며, 수신기는 도 1에서 설명한 전 자장치가 될 수 있다. 또한 도 1에서 설명한 전자장치가 송신기가 되는 경우 기지국은 수신기가 될수 있다. 하지만, 본 개시의 송신기와 수신기가 LTE, 5G 및/또는 6G 시스템의 송신기와 수신기로 한정되는 것은 아니다. 가령, D2D 방식을 사용하는 경우 및/또는 그 외의 다른 통신 방식 예컨대, WiFi 방식에서 AP와 단말 등 의 경우 다양한 경우 등에서 송신기와 수신기로 대체될 수 있다. 도 2의 송신기는 송신할 정보를 부호화 하기 위한 채널 부호기, 및 부호화된 송신할 신호를 복수의 안테나들(Tx ant#1, Tx ant#M)에 매핑하기 위한 MIMO 맵퍼(mapper) 및 복수의 송신 안테나들(Tx ant#1, Tx ant#Mn)을 포함할 수 있다. 여기서 복수의 송신 안테나들(Tx ant#1, Tx ant#M)은 수신 안테나로도 사용될 수 있다. 다만, 설명의 편의를 위해 송신기 관점에서 설명하고 있기 때문에 송신 안테나들(Tx ant#1, Tx ant#M)로 예시하였음에 유의해야 한다. 송신기는 도 2에 예시한 구성 외에 신호를 전송 대역으로 송신하기 위한 대역 상승 변환기, 전력 증폭기 등의 구성을 더 가질 수 있다. 또한 그 외에도 송신기는 기지국에 포함되는 경우 기지국 제어기, 스케줄러 등의 다양한 구성 요소들을 더 포함할 수 있다. 다만, 도 2에서는 본 개시를 설명하기 위해 필요한 구성만을 예 시하여 설명하고 있음에 유의해야 한다. 송신기의 채널 부호기는 송신할 정보를 수신기와 약속된 방식으로 부호화를 수행할 수 있다. 이 때, 부호화 방식은 앞서 설명한 컨볼루션 부호(convolutional coding), 터보 부호(turbo coding), 저밀도 패리 티 검사 부호(low-density parity-check coding, LDPC coding), 및 극부호(polar coding) 방식 과 같은 부호화 방식들 중 어느 하나 또는 둘 이상의 방식이 사용될 수 있다. 채널 부호기에서 부호화된 신호는 MIMO 맵퍼에서 복수의 안테나들로 전송하기 위해 매핑될 수 있다. MIMO 맵퍼에서 매핑 방식은 각 시스템에서 요구하는 방식에 따라 서로 다른 형태로 매핑될 수 있으며, 본 개시에서는 이에 대한 제약을 두지 않기로 한다. MIMO 맵퍼에서 출력된 신호들은 복수의 송신 안테나들(Tx ant#1, Tx ant#M)을 통해 전송될 수 있다. MIMO 와 채널 부호를 연접하여 신호를 송신하는 구조를 채택한 시스템에서는 MIMO 맵퍼에서 채널 부호화된 신호 를 수의 송신 안테나들(Tx ant#1, Tx ant#M)을 통해 전송하기 위한 처리를 수행할 수 있다. MIMO와 채널 부호를 연접하여 물리계층으로 전송하는 방식은 LTE 및 5G 시스템에서 널리 사용되고 있기 때문에 추가적인 설명은 생 략하기로 한다. 또한 수신기는 복수의 수신 안테나들(Rx ant#1, Rx ant#N)와 복수의 안테나들로부터 수신된 신호를 검출하 기 위한 MIMO 검출기 및 채널 복호기를 포함할 수 있다. 여기서 복수의 수신 안테나들(Rx ant#1, Rx ant#N) 또한 앞서 송신기에서 설명한 바와 같이 신호를 송신하는 경우에 송신 안테나들로 사용될 수 있다. 수신기는 도 2에 예시한 구성 외에 저잡음 증폭기, 대역 하강 변환기 등의 구성을 더 가질 수 있다. 또한 수신기가 전자장치로 구현되는 경우 도 1에서 설명한 바와 같은 구성들 중 적어도 일부를 포함할 수 있다. 본 개시에서는 수신된 신호의 복호 관점에서 설명하기 때문에 이러한 구성들에 대해서는 추가적인 설명은 생략 하기로 한다. 도 2의 수신기는 복수의 수신 안테나들(Rx ant#1, Rx ant#N)를 통해 송신기로부터 전송된 신호를 수 신할 수 있다. 이때, 복수의 수신 안테나들(Rx ant#1, Rx ant#N)을 통해 수신된 신호는 송신기에서 전송한 신호는 물론 송신기에서 전송된 채널에 의해 왜곡이 발생한 신호를 수신하게 된다. 먼저 수신기의 MIMO 검출기는 복수의 수신 안테나들(Rx ant#1, Rx ant#N)로부터 수신된 신호에 대하 여 MIMO와 채널 부호가 연접된 상태의 신호를 MIMO 송신기의 MIMO 매퍼에서의 역 과정을 통해 분리하여 출 력할 수 있다. MIMO 검출기에서 출력된 신호는 채널 복호기로 입력될 수 있다. 채널 복호기는 전송된 채널에서 왜곡된 신호를 이용하여 실제 송신기가 송신하고자 하는 송신 정보로 복호할 수 있다. 이때, 복호 방식은, 앞서 설명한 바와 같이 송신기와 수신기 간에 약속된 부호화 방식에 기반하여 복호를 수행하고, 복호 된 결과를 출력할 수 있다. 한편, MIMO와 채널 부호가 연접된 시스템(coded MIMO system)에서 수신된 신호를 효율적으로 수신하여 복호하기 위한 기법이 필요하다. 그러면, MIMO와 채널 부호가 연접된 시스템(coded MIMO system)에서 수신 신호를 복호하 기 위한 방법에 대하여 살펴보기로 한다. 부호화된 MIMO 시스템에서 최적의 수신 기법을 적용하면, 최적의 성능을 얻을 수 있다. 하지만, 최적의 수신 기 법을 적용하면 복잡도가 안테나 수에 지수적으로 증가하는 문제가 있다. 즉, 송신기와 수신기 간에공통으로 사용되는 안테나의 수에 따라 복잡도가 지수적으로 증가하게 된다. 따라서 최적 수신 기법은 높은 복 잡도로 인해 안테나 수가 적은 환경에서만 제한적으로 적용이 가능할 수 있다. 왜냐하면, 수신기의 복잡도가 증 가하는 경우 제작 비용의 증가는 물론 배터리로 구동되는 전자장치의 경우 사용 시간의 단축되기 때문이다. 따라서 현재 널리 쓰이고 있는 massive MIMO와 같은 안테나 수가 많은 경우에는 적용하기 어려운 단점이 있다. 이에 다양한 준-최적 수신 기법들이 제안되었다. 대표적인 준-최적 수신 기법으로 반복 검출 및 복호(iterative detection and decoding, IDD) 수신기가 있다. 도 3a는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 일반적으로 널리 사용되고 있는 반복 검 출 및 복호(IDD) 수신기의 예시적 구성도이다. 도 3a에서는 도 2에서 사용된 참조부호와 다른 참조부호들을 사용한다. 즉, 도 3a에서 MIMO 검출기는 도 2 에서 설명한 MIMO 검출기의 구성이 될 수 있다. 또한 도 3a에서 예시한 채널 복호기는 도 2에서 설명 한 채널 복호기에 대응할 수 있다. 그러면 도 3a를 참조하여 반복 검출 및 복호 수신기의 구성에 대하여 먼저 살펴보기로 한다. 반복 검출 및 복호 수신기의 MIMO 검출기는 간략하게 MIMO 검출기 코어와 제1가산기를 포함할 수 있다. 또한 반복 검출 및 복호 수신기의 채널 복호기는 채널 복호기 코어와 제2가산기를 포 함할 수 있다. 그러면 도 3a에 예시한 반복 검출 및 복호 수신기의 동작을 간략히 살펴보기로 한다. 복수의 수신 안테나들로부터 수신된 신호 y는 MIMO 검출기 코어로 입력된다. 또한 채널 복호기로부터 출력된 신호는 피드백되어 MIMO 검출기 코어로 입력된다. 이에 MIMO 검출기 코어는 두 신호를 이용하 여 수신된 신호를 검출하고, 이를 제1가산기로 출력한다. 제1가산기는 또한 채널 복호기로부터 피드백된 신호를 수신하고, MIMO 검출기 코어의 신호에서 채널 복호기로부터 수신된 신호의 차를 계 산하여 채널 복호기로 출력한다. /// 채널 복호기 코어는 MIMO 검출기의 제1가산기로부터 수신된 신호를 이용하여 복호를 수행하고, 이를 출력하며, 동시에 제2가산기로 입력될 수 있다. 제2가산기는 또한 MIMO 검출기으로부터 수 신된 신호를 다른 하나의 입력으로 할 수 있다. 제2가산기는 복호된 신호에서 MIMO 검출기의 입에서 출력된 신호와의 차를 계산하여 MIMO 검출기로 피드백할 수 있다. 한편, 상기 MIMO 검출기와 채널 복호기 간에 반복 복호가 완료되기 전에는 실제 복호된 신호가 출력 되지 않는다. 즉, MIMO 검출기와 채널 복호기 간에 미리 정의된 반복 횟수만큼 복호가 이루어지거나 및/또는 복호 성공이 발생해야만 복호된 신호가 출력될 수 있다. 반복 검출 및 복호 수신기는 일반적으로 MIMO 검출기와 채널 복호기 간에 정보 교환이 반복적으로 수 행되는 특징을 가진다. 또한 반복 검출 및 복호 수신기는 MIMO 검출기와 채널 복호기 간에 정보 교환 의 반복 횟수가 증가할수록 최적의 성능에 근접한 성능을 보인다. 뿐만 아니라 도 3a에 예시한 바와 같이 최적 의 수신 기법 대비 낮은 복잡도를 갖는다는 장점이 있어, 널리 사용되고 있다. 이상에서 설명한 방식을 수학식으로 다시 살펴보면 아래와 같이 설명할 수 있다. 도 3a에 예시한 MIMO 검출기 코어는 입력 신호 y를 이용하여 사전(priori) 로그 우도 비(Log Likelihood Ratio, LLR) 값으로 계산하여 출력할 수 있다. 수신된 신호는 MIMO 검출기 코어의 출력은 하기 <수학식 1>과 같이 정의할 수 있다. 수학식 1 상기 <수학식 1>에서 c는 LLR이 계산되는 부호화된 정보 비트를 의미하며, LAPP는 사후(a posteriori probability, APP) LLR 값을 의미한다. 또한 P(●)는 ●에 대한 확률 값을 의미한다. 위에 예시한 <수학식 1>은 베이즈 정리(Bayes' theorem) 에 따라, 하기 <수학식 2>와 같이 정리할 수 있다. 수학식 2"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한 로그 함수의 덧셈 법칙에 따라, <수학식 2>는 다시 하기 <수학식 3>과 같이 표현할 수 있다. 수학식 3"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "<수학식 3>에서 LAPP(b)에 대응한 첫 번째 항을 c에 대한 외적(extrinsic) LLR이라고 하며, 두 번째 항은 c에 대 한 사전(priori) LLR을 의미한다. 따라서 결과적으로 LAPP(c)는 LEXT(c)와 LPRI(c)를 합한 결과가 될 수 있다. 도 3a의 제1가산기에서 생성된 extrinsic LLR은 채널 복호기의 입장에서는 priori LLR로 인식될 수 있다. 따라서 채널 복호기 코어는 MIMO 검출기에서의 출력을 priori LLR로 하고, 앞서 설명한 <수학 식 1>과 동일한 계산을 수행할 수 있다. 채널 복호기 코어에서의 출력 값은 다시 priori LLR로 제2가산기로 입력되고, 앞서 설명한 바와 같이 MIMO 검출기의 출력을 다른 하나의 입력으로 하여 채널 복호기 코어과 MIMO 검출기의 출력의 차 를 계산하여 extrinsic LLR로 출력할 수 있다. 채널 복호기에서 출력된 extrinsic LLR은 다시 MIMO 검출 기의 입장에서는 priori LLR이 될 수 있다. 이처럼, MIMO 검출기가 채널 복호기에서 생성된 APP LLR을 priori LLR로 입력 받는다면, 해당 APP LLR에는 이전 MIMO 검출기의 동작에서 생성된 extrinsic LLR이 포함되어 있기 때문에 MIMO 검출기 내부에서 동일한 정보가 계속하여 중첩되게 된다. 이에 따라 만일, 생성된 APP LLR에 오류가 있다면, IDD의 반복 회수가 증가함에 따라 오류가 계속 누적되기 때 문에 IDD에서 MIMO 검출기와 채널 복호기는 APP LLR이 아닌 extrinsic LLR을 서로 주고 받는다. 이상에서 설명한 바와 같이 IDD 방식은 일반적으로 반복이 많아질수록 정확도가 증가하지만, 오류가 존재할 경 우 누적 오류도 증가할 수 있는 문제가 있다. 따라서 본 개시에서는 IDD 방식을 사용하는 채널 복호기에서 생성 된 전송 비트에 대한 사후 확률과 사전 확률을 이용하여 전송 비트에 대한 연판정 정보를 효율적으로 생성하는 방법, 절차, 및 장치를 제공한다. 본 개시에 따른 실시예를 설명하기에 앞서 다시 무선 통신 시스템에서 수신기 동작에 대하여 간략히 정리하면 아래와 같다. LTE에 사용되는 터보 부호와 5G에 사용되는 LDPC 부호는 데이터 비트(information bit)에 추가 비트(parity bit)를 추가하여 전송 비트를 구성하게 된다. 수신기의 MIMO 검출기에서는 전송 비트들에 대한 채널 LLR을 계산 하여 채널 복호기로 입력해 주며, 채널 복호기는 입력된 채널 LLR 을 이용하여 채널 복호를 수행한다. 이때, 데 이터 비트에 대한 LLR은 채널 복호기 관점에서 데이터 비트에 대한 사전 정보가 되며 priori LLR 이라고 한다. 채널 복호가 완료되면 데이터 비트에 대한 사후 정보(APP LLR)를 얻게 되는데, APP LLR 값에 경판정(hard-decision)하여 대응하는 데이터 비트 추정 값을 획득하면 전체 수신기 동작이 완료된다. 또한 앞선 도 3a에서 설명한 바와 같이 부호화된 MIMO 시스템의 대표적인 수신 기법으로 IDD가 있다. IDD는 MIMO 수신기와 채널 복호기 간에 전송 비트에 대한 정보 교환을 반복적으로 수행하는 특징을 가진다. 이때, 채 널 복호기는 MIMO 수신기로 전달할 정보를 생성하기 위해 전송 비트에 대한 연판정 정보를 생성해야 하는 데, 이 정보는 APP LLR과 priori LLR로 계산이 된다. 이와 같은 채널 복호기는 복잡도가 매우 높기 때문에, 속도나 메모리 사용 측면에서 유리한 고정-소수점(fixed- point) 구현이 필요하다. 고정-소수점 구현에서는 모든 정보들이 양자화(quantization)되기 때문에 표현할 수 있는 값의 범위에 제약이 생기게 된다. 양자화로 인하여 부동-소수점(floating-point) 구현 대비 성능 열화의 주원인이 된다. 고정-소수점 구현에서 양자화 정도(quantization level)를 완화할수록 성능 손실은 줄어들지만, 복잡도는 증가하게 된다. 따라서, 고정-소수점 구현에서는 성능과 복잡도 간 trade-off를 통해 양자화 정도를 결정하게 된다. 실제 구현에서는 양자화 정도에 따라 값의 표현 범위가 제한이 되므로, 일정 크기 이상의 값은 고정-소수점의 최대 크기로 포화(saturation)되어 표현이 된다. 터보 부호나 LDPC 부호에 대한 채널 복호기는 APP LLR 계산을 목적으로 하는데, 성능과 복잡도 간 trade-off로 인해 APP LLR의 표현 범위에 맞추어 양자화 정도가 결정되는 것이 일반적이다. 따라서, 고정-소수점 구현에서는 extrinsic LLR에 왜곡이 발생하게 된다. 이러한 왜곡은 extrinsic LLR 기반 수신 기법의 이론과 구현 간에 성능 차이를 발생시키게 된다. 이를 막기 위해서는 APP LLR 의 양자화 정도를 완화해야 하지만, 이는 채널 복호기의 복잡도를 증가시키게 된다. 따라서, extrinsic LLR을 사용하는 수신 기법의 고정-소수점 구현을 위해서는 extrinsic LLR의 왜곡을 완화할 수 있는 적절한 후처리 기 능이 중요하다. 도 3b는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 본 개시의 일 실시예에 따른 반복 검출 및 복호(IDD) 수신기의 블록 구성도이다. 이하에서의 설명은 앞서 도 3a에서 설명한 바와 같이 채널 복호기에서 전송 비트에 대한 확률 대신 LLR을 이용 하여 복호를 수행하므로, 여기서부터는 확률 대신 LLR로 설명하기로 한다. 또한 도 3a에서 동일한 구성에 대해 서는 동일한 참조부호를 사용하기로 한다. 본 개시에 따른 수신기는 도 2에서 설명한 바와 같이 MIMO 검출기와 채널 복호기(320A)를 포함할 수 있다. 본 개시에 따른 MIMO 검출기는 앞서 도 3a에서 설명한 MIMO 검출기와 동일한 구성을 가질 수 있다. 본 개시에서는 채널 복호기(320A)의 구성을 변경한 형태가 될 수 있다. 본 개시에 따른 채널 복호기(320A)는 채널 복호기 코어와 초기 외부 LLR 계산기, 외부 LLR 범위 계산 기 및 외부 LLR 생성기를 포함할 수 있다. 먼저 전체적인 동작 관점에서 살펴보기로 한다. 앞서 도 2에서 예시한 수신기는 복수의 수신 안테나들 각 각으로부터 수신 신호 y를 출력할 수 있다. 각 안테나로부터 수신된 신호 y는 MIMO 검출기로 입력된다. 도 2에 예시된 MIMO 검출기는 도 3b의 MIMO 검출기과 동일한 구성을 가질 수 있다. 또한 앞서 설명한 바 와 같이 본 개시에서 따른 수신기 내에 저잡음 증폭, 대역 하강 변환, 채널 등화 등의 동작은 이미 처리된 것으 로 가정하므로, 이에 대한 설명은 생략하기로 한다. MIMO 검출기는 도 3a에서 설명한 바와 같이 MIMO 검출기 코어와 제1가산기를 포함할 수 있다. MIMO 검출기 코어는 복수의 각 수신 안테나들로부터 출력된 신호 y와 채널 복호기(320A)에서 복호되어 피 드백된 신호를 이용하여 APP LLR 값을 계산할 수 있다. 이에 대한 설명은 앞선 도 3a에서 설명하였기 때문에 부 가적인 설명은 생략하기로 한다. MIMO 검출기 코어에서 계산된 APP LLR 값은 제1가산기로 출력된다. 제1가산기는 MIMO 검출기 코 어에서 계산된 APP LLR 값과 채널 복호기에서 복호된 값을 각각 하나의 입력으로 할 수 있다. 제1가 산기는 MIMO 검출기 코어에서 계산된 APP LLR 값과 채널 복호기에서 복호된 값 간의 차를 계산 하여 채널 복호기로 출력할 수 있다. MIMO 검출기에서 출력되는 값은 앞서 설명한 바와 같이 EXT LLR 값이 된다. 본 개시의 일 실시예인 도 3b에 따른 채널 복호기(320A)는 채널 복호기 코어와 초기 외부 LLR 계산기 (initial extrinsic LLR calculator), 외부 LLR 범위 계산기 및 외부 LLR 생성기(extrinsic LLR generator)를 포함할 수 있다. 도 3b에서 채널 복호기 코어는 도 3a에서의 채널 복호기 코어와 동일한 동작을 수행할 수 있으므로, 동일한 참조부호를 사용하여 설명하기로 한다. 채널 복호기 코어는 MIMO 검출기의 제1가산기로부터 수신된 EXT LLR 값을 사전(priori, PRI) LLR로 간주할 수 있다. 따라서 채널 복호기 코어는 PRI LLR을 이용하여 APP LLR을 계산할 수 있다. 채널 복호기 코어에서 계산된 APP LLR 값은 아래의 2가지 경우 중 하나의 방식에 따라 출력 경로가 달라질 수 있다. 본 개시에서는 이하에서 방식들에 대하여 제약을 두지 않기로 한다. 첫째, IDD 방식에서 반복 복호가 미리 결정된 횟수만큼 반복이 이루어진 경우 채널 복호기 코어의 출력은 외부로 출력되고, 만일 미리 결정된 횟수만큼 반복이 이루어지지 않은 경우 피드백(feedback)되도록 할 수 있다. 이는 IDD 방식은 앞서 설명한 바와 같이 반복 횟수가 증가할수록 복호 성능이 향상되기 때문이다. 둘째, 미리 결정된 횟수만큼 반복이 이루어지지 않은 경우라도 항상 외부로 출력됨과 동시에 피드백이 이루어지 도록 경로를 설정할 수 있다. 이런 경우는 복호 동작의 조기 종료(early termination)를 위해 채널 복호기 코어 의 LLR 값을 이용하여 판정을 수행하는 경우에 이용될 수 있다. 채널 복호기 코어에서 복호된 APP LLR 값은 본 개시에 따른 초기 외부 LLR 계산기와 외부 LLR 범위 계산기로 입력될 수 있다. 먼저 초기 외부 LLR 계산기는 MIMO 검출기의 출력 즉, MIMO 검출기의 제1가산기로부터 출 력되는 EXT LLR 값을 PRI LLR 값으로 하여 수신할 수 있다. 또한 초기 외부 LLR 계산기는 채널 복호기 코 어에서 계산된 APP LLR 값을 수신할 수 있다. 초기 외부 LLR 계산기는 채널 복호기 코어에서 계 산된 APP LLR 값에서 MIMO 검출기의 제1가산기로부터 입력된 PRI LLR 값을 제거할 수 있다. 이를 수 학식으로 예시하면 아래의 <수학식 4>와 같이 예시할 수 있다. 수학식 4"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "<수학식 4>에서 LEXT,init는 초기 외부 LLR 계산기의 출력 값인 LLR 값이 될 수 있다. 또한 LAPP는 채널 복호 기 코어에서 출력된 LLR 값이며, Lprior은 MIMO 검출기의 출력 즉, MIMO 검출기의 제1가산기 로부터 출력된 LLR 값이 될 수 있다. 결과적으로, 초기 외부 LLR 계산기는 채널 복호기 코어에서 계산된 APP LLR 값에서 MIMO 검출기(31 0)의 제1가산기로부터 입력된 PRI LLR 값과의 차를 계산하는 형태가 될 수 있다. 그러므로, 초기 외부 LLR 계산기는 도 3a에서 설명한 제2가산기로 구현할 수도 있다. 이처럼 초기 외부 LLR 계산기에서 계산된 값은 외부 LLR 생성기로 입력될 수 있다. 또한 채널 복호기 코어에서 계산된 APP LLR 값은 외부 LLR 범위 계산기로 입력될 수 있다. 외부 LLR 범위 계산기는 외부 LLR 상한 경계(extrinsic LLR upper boundary)와 외부 LLR 하한 경계(extrinsic LLR lower boundary)를 계산하여 출력할 수 있다. 외부 LLR 범위 계산기는 앞서 고정-소수점 방식에서 발생하 는 포화를 방지하기 위해 외부 LLR 상한 값과 외부 LLR 하한 값에 대한 임계값(threshold)을 수신할 수 있다. 도 3b에서는 EXT LLR 상한 값과 EXT LLR 하한 값이 이용됨을 명확히 하기 위해 외부로부터 입력되는 형태로 예 시하였으나, EXT LLR 상한 값과 EXT LLR 하한 값은 외부 LLR 범위 계산기 내에 자체적으로 저장되어 있을 수도 있다. 외부 LLR 범위 계산기는 아래의 <수학식 5> 및 <수학식 6>과 같이 각각 상한 임계값과 하한 임계값을 계산 할 수 있다.수학식 5"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 6"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "<수학식 5> 및 <수학식 6>에서 THupper는 상한 임계값이며, THlower는 하한 임계값이고, LAPP는 채널 복호기 코어 에서 출력된 LLR 값이고, TH는 미리 설정된 값을 의미한다. 또한 “M”은 고정-소수점 방식을 구현함에 있 어 LLR을 양자화하기 위한 비트 폭(bit width)에 의해 결정되는 최대 LLR 값을 의미하며, “-M”은 고정-소수점 방식을 구현함에 있어 LLR을 양자화하기 위한 비트 폭(bit width)에 의해 결정되는 최소 LLR 값을 의미한다. 위 와 같이 extrinsic(EXT) LLR은 사후(APP) LLR을 기준으로 일정한 범위 내에서 생성된다. 이 특성을 반영하기 위 해 APP LLR에서 미리 설정된 임계값(TH)을 더하거나 빼는 과정을 통해 EXT LLR의 범위를 제한할 수 있다. 예컨대, TH를 “0(zero)”으로 가정하면, THupper와 THlower는 같은 값이 되고, EXT LLR은 초기 EXT LLR과 관계없 이 APP LLR과 동일한 값이 된다. 결과적으로 THupper와 THlower의 범위 내에 있는 초기 EXT LLR은 정상 LLR로 간주 할 수 있다. 즉, 초기 EXT LLR을 그대로 MIMO 검출기에서 사용하기 위해 LAPP에서 TH를 더하거나 차의 값을 계산 함으로써, THupper와 THlower를 결정할 수 있다. 따라서 외부 LLR 범위 계산기는 채널 복호기 코어로부터 수신된 값이 외부 LLR 범위 내에 있는지 여 부를 식별하고, 만일 외부 LLR 범위를 초과하는 경우 미리 설정된 임계값이 되도록 설정하여 외부 LLR 생성기 로 출력할 수 있다. 외부 LLR 생성기는 초기 외부 LLR 계산기로부터의 출력과 외부 LLR 범위 계산기로부터의 출력을 수신하여, 반복 복호를 위해 MIMO 검출기로 출력할 EXT LLR 값을 생성하여 출력할 수 있다. 예컨대, 외부 LLR 범위 계산기로부터 수신된 정보가 EXT LLR 상한 값 또는 EXT LLR 하한 값을 벗어남을 지시하는 경우 외부 LLR 생성기는 미리 설정된 EXT LLR 상한 값 또는 미리 설정된 EXT LLR 하한 값을 출력할 수 있다. 반 면에 외부 LLR 범위 계산기로부터 수신된 정보가 EXT LLR 상한 값 또는 EXT LLR 하한 값 범위 내에 존재함 을 지시하는 경우 외부 LLR 생성기는 초기 외부 LLR 계산기로부터 수신된 값을 EXT LLR 값으로 출력 할 수 있다. 외부 LLR 생성기에 대한 동작은 후술되는 도 5에서 다시 살펴보기로 한다. 이처럼 본 개시에 따른 궤환 보상부는 채널 복호기 코어에서 계산된 값이 양자화 범위를 넘어서는 경 우 최대 값과 최소 값으로 미리 설정된 LLR 값을 출력하도록 함으로써 오류를 감쇄시킬 수 있다. 따라서 반복 복호가 이루어짐에 따라 복호의 성능이 향상될 수 있다. 도 3c는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 본 개시의 다른 실시예에 따른 반복 검출 및 복호(IDD) 수신기의 블록 구성도이다. 도 3b와 도 3c를 대비하여 살펴보기로 한다. 도 3c에서는 채널 복호기(320B)와 피드백 보상부(330A)로 구현하는 형태를 예시하고 있다. 채널 복호기는 도 3a 및 도 3b에서 설명한 채널 복호기 코어만으로 구현할 수 있다. 또한 도 3b에서 설명한 초기 외부 LLR 계산기, 외부 LLR 범위 계산기 및 외부 LLR 생성기의 구 성은 피드백 보상부(330A)를 구성하는 형태가 될 수 있다. 도 3c에 예시한 각각의 블록 구성들과 각 블록들 간의 연결 관계는 도 3b에서 설명한 바와 동일하다. 다만, 도 3b와 도 3c에서 서로 다른 구성처럼 예시한 것은 실제 제품의 구현 시에 모듈의 구현 방식에 따른 구분이 될 수 있다. 가령 도 3a에 예시한 채널 복호기의 형태에서 도 3b와 같이 채널 복호기를 구현하는 경우 채널 복호기 자체를 새롭게 설계해야 하는 경우가 발생할 수 있다. 이런 경우 도 3c와 같이 채널 복호기(320B)를 구현하 면, 설계의 부담을 줄일 수 있다. 그리고 피드백 보상부(330A)를 부가함으로써 수신기를 구현함에 있어 변경을 줄일 수 있게 되는 이점이 있다. 또한 도 3c의 방식을 채택하더라도 도 3b와 동일한 구성을 갖기 때문에 도 3b 에서와 동일한 효과를 발생시킬 수 있다. 도 3d는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 본 개시의 또 다른 실시예에 따른 반복 검출 및 복호(IDD) 수신기의 블록 구성도이다. 도 3b, 도 3c 및 도 3d를 대비하여 살펴보기로 한다. 도 3d에서는 채널 복호기와 피드백 보상부(330B)로 구현하는 형태를 예시하고 있다. 채널 복호기는 도 3a와 동일한 형태를 취하고 있음에 유의해야 한다. 앞 서 도 3b의 설명에서 초기 외부 LLR 계산기의 동작은 앞서 설명한 제2가산기와 동일한 동작을 수행하는 형 태가 될 수 있음을 설명하였다. 따라서 채널 복호기이 다른 설계 변경 없이 그대로 이용할 수도 있다. 채널 복호기의 구성을 변경하지 않는 경우 피드백 보상부(330B)는 외부 LLR 범위 계산기와 외부 LLR 생성기만으로 구현할 수 있다. 또한 이들의 연결 구성은 도 3b와 대비할 때, 초기 외부 LLR 계산기를 제2가산기9322)로 대체한 경우에 해당하게 된다. 그러므로 다른 구성들의 동작은 앞서 도 3b에서 설명한 방식을 그대로 적용할 수 있다. 도 3d와 같이 구현하는 경우 도 3c와 대비하여 실제 제품의 구현 시에 기존의 채널 복호기 자체를 그대로 사용 할 수 있다는 장점이 있다. 따라서 피드백 보상부(330B)만을 새롭게 부가함으로써 수신기를 구현함에 있어 변경 을 줄일 수 있게 되는 이점이 있다. 또한 도 3d의 방식을 채택하더라도 도 3b와 동일한 구성을 갖기 때문에 도 3b에서와 동일한 효과를 발생시킬 수 있다. 도 4는 채널 검출기에서의 사후 LLR 값과 외부 LLR 값 간의 상관성을 확인하기 위한 통계적 특성 그래프이다. 도 4를 참조하면, y축은 EXT LLR 값을 예시하고 있으며, x축은 채널 검출기의 APP LLR 값을 예시하고 있다. 도 4에 예시한 참조부호 401의 추세선은 APP LLR 값과 EXT LLR 값은 비례 관계에 있음을 확인할 수 있다. 따라서 본 개시에서는 extrinsic LLR과 APP LLR 간의 통계적 특성을 이용하여 효율적으로 extrinsic LLR을 계산할 수 있다. 도 4의 그래프를 참조하면, x축과 y축은 각각 APP LLR과 EXT LLR을 예시하고 있으며, 8비트(bit) 고정 소수점으 로 표현한 LLR 값들 간의 그래프이다. 8비트(bit) 고정 소수점을 가정하였으므로, M은 127롷 표현되었다. 여기 서 8비트 중 하나의 비트는 음수/양수를 표현하기 위해 할당된 비트가 될 수 있다. 따라서 8비트로 표현 가능한 범위는 -128부터 127까지가 된다. 그러나 -128은 사용되지 않도록 구성할 수 있다. 왜냐하면, 음수와 양수의 최 대값이 서로 다른 경우 복호기 내부에서 바이어스(bias)가 발생할 수 있기 때문이다. 고정 소수점(fixed point) 방식의 구현에서 부동 소수점(floating point) 방식으로 값을 표현하는 경우 소수 부 분(fractional part)을 표현하기 위해 고정된 스케일링 펙터(fixed_scaling factor)의 값을 곱하여 정수부를 취함으로써 소수 부분을 표현할 수 있다. 이를 간략히 표현하면, 아래와 같이 계산될 수 있다. 수학식 7"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "위의 <수학식 7>을 이용하여 도 4에서는 fixed_scaling factor로 3.5를 사용한 경우를 예시하였다. 따라서, P(c=0), LLR_float, LLR_fixed 간의 관계는 하기 <표 1>과 같다.표 1"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "상기 <표 1>에서 부호는 해당 LLR 이 나타내는 bit 가 0인지 1인지를 나타낸다. LLR의 절대값은 정의상 신뢰도 를 의미하는데, 절대값이 클수록 신뢰도가 높음을 의미한다. 예를 들어, LLR=0은 해당 비트가 0일 확률과 1일 확률이 1/2로 같다는 것을 의미하고, LLR=128은 해당 비트가 0일 확률이 거의 100% 임을 의미한다. 고정 소수점 구현에서 부동 소수점 구현과 동일한 extrinsic LLR을 생성하려면 코어(core)의 입력(input) LLR 과 APP LLR 의 비트(bit) 수를 늘려야만 한다. 이는 코어에서 처리하는 LLR들의 bit width가 증가해야 한다는 것을 의미하며, 코어의 크기(size)가 bit width에 비례해서 늘어나야 하는 문제를 가진다. 본 개시에서 제안하 는 방식은 코어의 크기를 늘리지 않으면서 EXT LLR처럼 반복 복호의 성능을 개선할 수 있게 된다. 도 5는 본 개시에 따른 외부 LLR 생성기의 출력 LLR 값을 결정하는 동작에 대한 제어 흐름도이다. 도 5를 참조하여 설명하기에 앞서 본 개시의 동작은 도 3b의 구성을 이용하여 설명하기로 한다. 이는 설명의 편 의를 위해 하나의 도면을 이용하는 것일 뿐이며, 도 3c 및/또는 도 3d의 구성을 이용하는 경우에도 동일하게 동 작할 수 있음에 유의해야 한다. 도 5를 참조하면, 500동작에서 외부 LLR 생성기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init와 외부 LLR 범위 계산기로부터 수신되는 상한 임계값인 THupper 및/또는 하한 임계값인 THlower를 수신할 수 있 다. 502동작에서 외부 LLR 생성기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 상한 임계값인 THupper 값 보다 큰가를 검사(또는 식별)할 수 있다. 502동작의 검사 결과 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 상한 임계값인 THupper 값 보다 큰 경우 외부 LLR 생성기는 504동작으로 진행할 수 있다. 반 면에 502동작의 검사 결과 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 상한 임계값인 THupper 값과 같 거나 작은 경우 외부 LLR 생성기는 506동작으로 진행할 수 있다. 504동작으로 진행하면, 외부 LLR 생성기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 상한 임 계값인 THupper 값보다 큰 상태이므로, 채널 복호기(320A)의 출력인 EXT LLR 값을 상한 임계값인 THupper로 결정하 여 출력할 수 있다. 506동작으로 진행하는 경우 외부 LLR 생성기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 상한 임계값인 THupper 값과 같거나 또는 상한 임계값인 THupper 값보다 작은 상태이기 때문에 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init와 하한 임계값인 THlower를 대비할 수 있다. 즉, 506동작에서 경우 외부 LLR 생성 기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 하한 임계값인 THlower보다 작은가를 검사(또는 식별)할 수 있다. 506동작의 검사 결과 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 하한 임계값인 THlower 값 보다 작은 경우 외부 LLR 생성기는 508동작으로 진행할 수 있다. 반면에 506동작의 검사 결과 초기 외부 LLR 계산기 의 출력 LLR 값인 LEXT,init가 하한 임계값인 THlower 값과 같거나 작은 경우 외부 LLR 생성기는 510동작 으로 진행할 수 있다. 508동작으로 진행하면, 외부 LLR 생성기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 하한 임 계값인 THlower 값보다 작은 상태이므로, 채널 복호기(320A)의 출력인 EXT LLR 값을 하한 임계값인 THlower로 결정 하여 출력할 수 있다. 510동작으로 진행하는 경우 외부 LLR 생성기는 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 하한 임계값인 THlower 값과 같거나 또는 하한 임계값인 THlower 값보다 큰 상태이기 때문에 초기 외부 LLR 계산기 의 출력 LLR 값인 LEXT,init로 외부 LLR 생성기의 출력 값을 결정할 수 있다. 이는 앞서 502동작을 수행한 상 태이기 때문에 가능한 것이다. 즉, 초기 외부 LLR 계산기의 출력 LLR 값인 LEXT,init가 하한 임계값인 THlower 과 상한 임계값인 THupper 값 사이에 존재하는 경우이기 때문이다. 도 5에서는 상한 임계값을 먼저 검사하였으나, 하한 임계값을 먼저 검사하도록 하여도 무방하다. 또한 도 5에서 는 초기 외부 LLR 계산기의 출력 LLR 값을 상한 임계값과 하한 임계값을 각각 한 번씩 비교하는 형태를 취 하였으나, 초기 외부 LLR 계산기의 출력 LLR 값이 상한 임계값과 하한 임계값 내의 범위에 있는지 한 번에 검사하도록 구현할 수도 있다. 도 6은 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 채널 복호기가 8비트로 구현되었을 때, 종 래기술과 본 개시에 따른 시뮬레이션 비교 그래프이다. 도 6에서 a priori LLR이 -127인 경우이고, TH는 31로 설정한 경우 종래기술에 따른 시뮬레이션 그래브과 본 개시에 따른 시뮬레이션 그래프을 예시하고 있다. 수신 환경이 좋아서 A priori LLR 이 -127 값을 가진다고 하면, 도 6에서 알 수 있는 바와 같이 extrinsic LLR 도 -127로 계산이 될 확률이 크다. extrinsic LLR 이 -127이라고 한다면 APP LLR은 -254로 계산이 되어야 하나, 고정소수점 구현으로 인해 APP LLR은 -127로 포화되어 계산이 된다. 앞서 설명한 도 4의 분포를 보면, EXT LLR은 APP LLR의 근처에서 계산된다. 하지만, 고정 소수점 구현에 따른 영향이 발생하면 도 6의 참조부호 610과 같이 정상적이지 않은(통계적 범위를 벗어나는) EXT LLR이 생성될 수 있다. 본 개시에서 제안하는 방식을 사용하게 되면, 참조부호 610과 같은 EXT LLR을 참조부호 620과 같이 APP LLR 근처에 있는(통계적 범위 내에 있도록) EXT LLR로 만들 수 있다. 예를 들어, APP LLR=0인 경우, 참조부호 610의 origin의 그래프는 130 정도의 EXT LLR을 생성하게 된다. 하지만, APP LLR = 0 이라는 것은 해당 비트가 0인지 1인지 알 수 없다는 것이기 때문에 EXT LLR도 0에 가까운 값이 생성되어야만 한다. 하지만, 참조부호 610 의 origin은 고정 소수점에 따른 영향으로 EXT LLR이 130에 가까운 값으로 생성되어 해당 비트가 0일 확률이 거 의 100% 라는 잘못된 정보를 가지게 된다. 반면에 본 개시에 따른 방식을 사용하는 경우 참조부호 620과 같이 보정이 이루어지기 때문에 APP LLR이 0인 경우 EXT LLR은 약 40의 값을 가지게 된다. 또한 본 개시에 따른 방식 을 적용하여 반복 복호가 이루어짐에 따라 점차로 정확한 값을 획득할 수 있게 된다. 결과적으로, 종래기술에 따른 extrinsic LLR은 포화된 APP LLR 값으로 인해 APP LLR - PRI LLR = -127 -(-127) = 0으로 출력된다. 하지만, 본 개시에서 제안하는 방식은 extrinsic LLR을 APP LLR의 크기에 따라 크기를 제한 해주기 때문에, 실제 extrinsic LLR 값인 -127을 출력해 주는 것을 확인할 수 있다. 또한 본 개시에서 제안하는 방식에 따른 부호화된 MIMO 시스템의 IDD 성능의 개선을 하기 <표 2>를 참조하여 확 인할 수 있다.표 2"}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "상기 <표 2>는 본 개시에서 제안하는 방식에 따른 부호화된 MIMO 시스템의 IDD 성능을 설명하기 위한 테이블이 다. <표 2>에 사용된 수신 안테나의 개수가 4인 MIMO 시스템을 가정하였고, IDD 반복 회수는 4, QPSK, 10 반복 (iteration)을 가지는 LDPC code와 208 정보 비트, code rate = 1/3을 가정하였다. <표 2>에 있는 값은 주어진 SNR에서 IDD를 하지 않는 수신기 대비 TPUT 이득을 나타낸다. 8bit LLR을 사용하는 LDPC code를 사용하였으므로, TH가 127이면 기존의 extrinsic LLR 생성 방식에 따른 성능을 나타낸다. <표 2>에 서 보듯이 기존 extrinsic LLR 생성 방식 대비 제안하는 방식에 따른 extrinsic LLR 생성 방식을 사용하는 경우, 적절한 TH를 사용하면 약 8%의 성능 이득을 얻을 수 있다. 따라서 본 개시에 따른 방법 및 장치를 적용하는 경우 복호 성능을 향상시킬 수 있는 이점이 있다."}
{"patent_id": "10-2022-0043525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "또한 본 명세서와 도면에 개시된 실시 예들은 본 발명의 내용을 쉽게 설명하고, 이해를 돕기 위해 특정 예를 제 시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 범위는 여기에 개시된 실 시 예들 이외에도 본 발명의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0043525", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다중 입력 다중 출력(Multiple-Input Multiple-Output, MIMO) 시스템의 송신기 및 수신기의 간략화한 구성을 예시한 도면이다. 도 3a는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 일반적으로 널리 사용되고 있는 반복 검 출 및 복호(IDD) 수신기의 예시적 구성도이다. 도 3b는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 본 개시의 일 실시예에 따른 반복 검출 및 복호(IDD) 수신기의 블록 구성도이다. 도 3c는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 본 개시의 다른 실시예에 따른 반복 검출 및 복호(IDD) 수신기의 블록 구성도이다. 도 3d는 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 본 개시의 또 다른 실시예에 따른 반복 검출 및 복호(IDD) 수신기의 블록 구성도이다. 도 4는 채널 검출기에서의 사후 LLR 값과 외부 LLR 값 간의 상관성을 확인하기 위한 통계적 특성 그래프이다. 도 5는 본 개시에 따른 외부 LLR 생성기의 출력 LLR 값을 결정하는 동작에 대한 제어 흐름도이다. 도 6은 MIMO와 채널 부호를 연접하여 사용하는 무선 통신 시스템에서 채널 복호기가 8비트로 구현되었을 때, 종 래기술과 본 개시에 따른 시뮬레이션 비교 그래프이다."}
