{"patent_id": "10-2022-0094645", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0016640", "출원번호": "10-2022-0094645", "발명의 명칭": "고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공", "출원인": "주식회사 그린리본", "발명자": "김규리"}}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "보험금 청구가 접수되는 경우, 상기 보험금 청구에 대한 고지의무위반 및 역선택 적발을 위한 사후현장심사가필요한지의 여부에 대한 판단 보조 솔루션을 요청하는 적어도 하나의 보험사 서버; 및상기 적어도 하나의 보험사 서버로부터 상기 판단 보조 솔루션을 요청받는 접수부, 상기 보험금 청구를 한 적어도 하나의 사용자 단말을 추출하는 추출부, 상기 적어도 하나의 사용자 단말로 본인인증을 수행하도록 하는 인증부, 상기 적어도 하나의 사용자 단말에서 본인인증을 수행하는 경우 적어도 하나의 공공기관 서버로부터 의료데이터를 스크래핑(Scraping)하는 수집부, 상기 의료 데이터 내 상호, 사업자등록번호 및 지출금액으로 진단코드를 예측하는 진단코드예측부, 예측된 진단코드가 보험상품 내 고지의무위반 및 역선택 적발에 대응하는 진단코드인지의 여부를 판단하여 상기 적어도 하나의 보험사 서버로 전달하는 적발부를 포함하는 솔루션 서비스 제공 서버;를 포함하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 의료 데이터 내 건강검진결과 데이터를 추출하고, 상기 건강검진결과 데이터 내 기 설정된 만성질환의 여부를 분석하며, 상기 건강검진결과 데이터로 만성질환이라고 분석되었으나 상기 적어도 하나의 사용자 단말에서만성질환을 고지하지 않은 경우, 고지의무위반 및 역선택 적발로 상기 보험사 서버로 보고하는 만성질환보고부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 의료 데이터는,5 년 이내 입원, 7 일 이상 동일 병의원에 내원 및 30 일 이상 투약을 포함하는 5 년간 의료비 지출내역;1 년 이내 치료목적의 병의원에 내원 및 투약을 포함하는 1 년치 진료내역 및 투약정보;5 년치 건강검진결과 데이터;를 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 의료 데이터 내 사업자번호, 상호 및 지출금액을 추출한 후, 기 구축된 빅데이터 기반 인공지능 알고리즘공개특허 10-2024-0016640-3-에 질의로 입력하여 진단코드를 출력하는 AI예측부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 사용자 단말의 위임장으로 확보된 의료기록사본으로 진단코드를 검증하는 검증부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 적어도 하나의 보험사 서버에서 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부에 대한 결과보고서를 조회하도록 접수번호를 기준으로 상기 결과 보고서에 대한 엑세스권을 상기 적어도 하나의 보험사 서버로 제공하는 조회제공부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 고지의무위반 및 역선택 적발에 대응하는 진단코드가 포함된 적어도 하나의 병의원의 상호, 사업자등록번호 및 위치를 상기 적어도 하나의 보험사 서버로 제공하거나, 적어도 하나의 직원 단말로 사후현장심사 업무를할당하여 의료기록사본을 업로드하도록 하는 할당부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 적어도 하나의 직원 단말로 사후현장심사 업무를 할당하기 이전에, 상기 사용자 단말로부터 위임장에 전자서명을 수신하여 위임장을 받은 후, 상기 위임장을 상기 적어도 하나의 직원 단말로 전달하는 위임장서명부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2024-0016640-4-제 7 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 직원 단말로 배분된 사후현장심사 업무를 수행하기 위한 적어도 하나의 병의원 주소, 운영시간 및 점심시간을 추출하고, 상기 적어도 하나의 병의원 주소, 운영시간 및 점심시간에 기초하여 상기 직원 단말의 이동경로를 생성한 후 상기 직원 단말로 전달하는 이동경로최적화부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 솔루션 서비스 제공 서버는,상기 적어도 하나의 직원 단말에서 의료기록사본을 업로드하는 경우, 상기 적어도 하나의 직원 단말을 가상머신(Virtual Machine)으로 만드는 가상화(Virtualization)를 진행하는 의료기록보안부;를 더 포함하는 것을 특징으로 하는 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템이 제공되며, 보험금 청구가 접수되는 경우, 보험금 청구에 대한 고지의무위반 및 역선택 적발을 위한 사후현장심사가 필요한 지의 여부에 대한 판단 보조 솔루션을 요청하는 적어도 하나의 보험사 서버 및 적어도 하나의 보험사 서버로부터 (뒷면에 계속)"}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템에 관한 것으로, 보험금 청구를 받을 때 고지의무위반 및 역선택 적발을 위한 사후현장심사가 필요한지의 여부를 의료 데이터로부터 추출 및 예측하여 사후현장심사의 적격성을 판단해주는 보조 솔루션을 제공한다."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "실손의료보험은 건강보험이 보장하지 않는 영역을 보완하며 의료보장성강화에 크게 기여하며 급속한 성장을 해 왔지만, 손해율 상승으로 보험료 인상이 지속되자 제도의 지속성에 대한 문제의식 또한 점증되어 왔다. 손해율 상승의 주요 원인은 역선택 유인이 높은 실손의료보험의 상품적 특성에 기인한다. 의료보장 분야는 공급자와 수요자 사이의 정보비대칭성이 크고 가입자별 위험특성 편차가 커 역선택 유인이 높다. 역선택은 위험집단이 이질적일 경우 더욱 악화되며 역선택 하에서 단일보험료를 유지할 경우 구조적 보험료 인상과 보험시장 축소를 야기할 수 있다는 점에서 문제점을 지닌다. 역선택을 완화하기 위해서는 정보비대칭성을 완화하고 위험평가를 보완하는 것이 필요하지만, 현재 감독규정은 나이와 성별 등 제한적 요율변수만을 허용하고 있다. 정보의 제한 성과 위험평가의 정교함은 양립되기 어렵지만, 위험편차가 큰 위험집단에 대해 계속해서 제한적 정보만을 반영 한 단일보험료를 부과한다면, 시간이 지속될수록 손해율 상승과 이로 인한 계약자 간 이동으로 제도의 지속성은 위협받게 된다. 이때, 인수심사규칙을 설정하여 보험심사를 일괄처리하거나 빅데이터를 이용하여 인수심사를 자동화하는 방법이 연구 및 개발되었는데, 이와 관련하여 선행기술인 한국등록특허 제10-2013768호(2019년08월26일 공고) 및 한국 등록특허 제10-2165157호(2020년10월13일 공고)에는, 보험대상정보를 기초로 보험인수 가능여부를 결정하도록 인수심사규칙을 저장하고, 인수심사규칙에 따라 거절된 보험대상정보를 조정대상정보로 설정하는 구성과, 건물 정보 및 보험 언더라이팅 정보를 매핑하여 저장하여 빅데이터를 구축한 후, 새로운 질의로 건물정보가 입력되면 인수 여부를 출력하도록 인공지능 알고리즘을 이용하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 상술한 바와 같이 여전히 제한된 정보로 심사를 해야하므로 역선택이 발생하고 사용자가 고 지의무를 위반한 경우에는 사용자도 보험금을 받지 못하지만 보험사 또한 심사에 인력 및 자본을 투입하기 때문 에 손해가 발생할 수 밖에 없고 그 적발률도 현저히 낮아 효용성 문제가 제기되고 있다. 후자의 경우에는 건물 의 정보는 개인정보와 다르게 제한되지 않고 오픈된 정보여서 빅데이터를 구축하는데 문제가 없지만, 사람의 경우에는 개인정보보호법으로 제한된 정보만이 심사에 이용되어 정보비대칭으로 인한 역선택의 문제가 발생할 수 밖에 없다. 이에, 개인정보보호법을 준수하면서 사용자의 고의 또는 과실로 인한 고지의무위반을 방지하고, 보 험사의 인수심사 및 역선택을 방지할 수 있는 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 사용자 단말에서 적어도 하나의 공공기관 서버로 본인인증을 수행하는 경우 적어도 하 나의 공공기관 서버로부터 의료 데이터를 수집하고, 의료 데이터에 포함된 상호, 사업자등록번호 및 지출금액을 이용하여 진단코드를 예측하며, 예측된 진단코드가 보험인수심사에 필요한 진단코드인지를 확인함으로써 사용자 의 고의 또는 과실로 인한 고지의무 위반을 없애면서도 개인정보보호법을 준수하면서 인수심사에 필요한 절차, 인력 및 시간을 줄여줄 수 있도록 하고, 과거력 조건을 입원, 내원, 투약, 건강검진 결과를 통하여 리스크를 분 석함으로써 보험사의 인수심사 및 역선택을 방지할 수 있는, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 보험금 청구가 접수되는 경우, 보험금 청구에 대한 고지의무위반 및 역선택 적발을 위한 사후현장심사가 필요한지의 여부에 대한 판단 보조 솔루션을 요청하는 적어도 하나의 보험사 서버 및 적어도 하나의 보험사 서버로부터 판단 보조 솔루션을 요청받는 접수부, 보험금 청구를 한 적어도 하나의 사용자 단말을 추출하는 추출부, 적어도 하나의 사용자 단말 로 본인인증을 수행하도록 하는 인증부, 적어도 하나의 사용자 단말에서 본인인증을 수행하는 경우 적어도 하나 의 공공기관 서버로부터 의료 데이터를 스크래핑(Scraping)하는 수집부, 의료 데이터 내 상호, 사업자등록번호 및 지출금액으로 진단코드를 예측하는 진단코드예측부, 예측된 진단코드가 보험상품 내 고지의무위반 및 역선택 적발에 대응하는 진단코드인지의 여부를 판단하여 적어도 하나의 보험사 서버로 전달하는 적발부를 포함하는 솔 루션 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 사용자 단말에서 적어도 하나의 공공기관 서버로 본 인인증을 수행하는 경우 적어도 하나의 공공기관 서버로부터 의료 데이터를 수집하고, 의료 데이터에 포함된 상 호, 사업자등록번호 및 지출금액을 이용하여 진단코드를 예측하며, 예측된 진단코드가 보험인수심사에 필요한 진단코드인지를 확인함으로써 사용자의 고의 또는 과실로 인한 고지의무 위반을 없애면서도 개인정보보호법을 준수하면서 인수심사에 필요한 절차, 인력 및 시간을 줄여줄 수 있도록 하고, 과거력 조건을 입원, 내원, 투약, 건강검진 결과를 통하여 리스크를 분석함으로써 보험사의 인수심사 및 역선택을 방지할 수 있다."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔 루션 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템은, 적어도 하나의 사용자 단말, 솔루션 서비스 제공 서버, 적어도 하나의 직원 단말, 적어도 하나의 보험사 서버을 포함할 수 있다. 다만, 이러한 도 1의 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제 공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 솔루션 서비스 제공 서버와 연 결될 수 있다. 그리고, 솔루션 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말 , 적어도 하나의 직원 단말, 적어도 하나의 보험사 서버와 연결될 수 있다. 또한, 적어도 하나 의 직원 단말은, 네트워크를 통하여 솔루션 서비스 제공 서버와 연결될 수 있다. 그리고, 적어 도 하나의 보험사 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말, 솔루션 서비스 제공 서버 및 적어도 하나의 직원 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project),5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔 루션 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 본인인증을 하거나 사후현장 심사에 동의를 위한 전자서명 또는 위임장에 전자서명을 하는 사용자의 단말일 수 있다. 이때, 사용자 단말 의 사용자는 보험사 서버의 보험사에 보험가입을 한 후, 보험료를 내던 중 보험금 청구를 하는 사용 자를 의미한다. 본 발명의 사후현장심사란, 보험금을 청구하는 사용자가 고지의무를 위반했는지 등을 파악하기 위한 심사로, 보험가입심사를 통과한 후 보험사에서 위험인수를 했고, 그 이후 사용자가 보험사에 보험료를 내 면서 보험금을 청구한 상황을 전제한다. 물론, 보험가입심사, 즉 사용자가 보험에 가입하기 이전에 보험사에서 위험인수를 할 것인지를 판단하는 언더라이팅에서도 사용할 수도 있지만, 본 발명의 일 실시예에서는 보험금 청 구가 정당한 것인지, 이에 따라 사후현장심사를 할 것인지, 즉 인력을 투입해서 조사해볼 만한 상황인 것인지를 인간이 판단하기 앞서 인공지능 알고리즘이 자동으로 판단해주도록 함으로써, 인간은 그 결과를 재검토하거나 컨펌만 하도록 하고, 인력 및 시간의 낭비를 줄이고 효율은 높이면서 적발률도 높일 수 있도록 하는 상황을 전 제하기로 한다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 솔루션 서비스 제공 서버는, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루 션 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 제공하는 서버일 수 있다. 그리고, 솔루션 서 비스 제공 서버는, 적어도 하나의 보험사 서버로부터 고지의무위반 및 역선택 적발을 위한 사후현장 심사 필요여부 판단 보조 솔루션을 요청받고, 보험사 서버에서 제공한 사용자 단말의 사용자 정보에 기초하여 의료 데이터를 수집하고, 의료 데이터로부터 진단코드를 인공지능 알고리즘을 이용하여 예측하며, 예 측된 진단코드가 고지의무위반 또는 역선택 적발에 대응하는 진단코드인 경우, 사용자 단말로부터 위임장 에 서명을 받아 의료기록사본을 직원 단말로 업로드하도록 지시하고, 직원 단말에서 업로드한 의료기 록사본 내 진단코드와 일치하는 경우, 적발 사례로 보험사 서버에 보험급 지급 검토 이벤트를 전송하는 서 버일 수 있다. 이때, 솔루션 서비스 제공 서버는, 직원 단말에서 업로드한 의료기록사본 내 진단코 드와, 인공지능 알고리즘이 예측한 진단코드가 불일치하는 경우, 검증 실패로 인공지능 알고리즘을 재학습시키 는 데이터로 데이터셋을 구축한 후 인공지능 알고리즘을 재학습시키는 서버일 수 있다. 여기서, 솔루션 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 직원 단말은, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루 션 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 위임장을 솔루션 서비스 제공 서버로부터 전달받고, 솔루션 서비스 제공 서버에서 지정한 병의원 또는 약국에서 사용자의 의료기록사본을 수집하여 솔루션 서비스 제공 서버로 업로드하는 단말일 수 있다. 여기서, 적어도 하나의 직원 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 직원 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 직원 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 적어도 하나의 보험사 서버는, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔 루션 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 솔루션 서비스 제공 서버 로 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션을 요청하고, 솔루션 서 비스 제공 서버에서 적발 사례로 보고한 사용자에 대한 보험금 지급을 거절할 수 있는 서버일 수 있다. 여기서, 적어도 하나의 보험사 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 보험사 서버는, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 보험사 서버는, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 솔루션 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 솔루션 서비스 제공 서버는, 추출부, 인증부, 수집부, 진단코드예측부 , 적발부, 만성질환보고부, AI예측부, 검증부, 조회제공부, 할당부, 위임 장서명부, 이동경로최적화부 및 의료기록보안부를 포함할 수 있다. 본 발명의 일 실시예에 따른 솔루션 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 사용자 단말, 적어도 하나의 직원 단말 및 적어도 하나의 보험사 서버로 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 사용자 단말, 적어도 하나의 직원 단말 및 적어도 하 나의 보험사 서버는, 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비 스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행 되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나의 사용자 단말, 적어도 하나의 직원 단말 및 적어도 하나의 보험사 서버에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받 아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러(Explorer), 크롬(Chrome) 등 을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의미하며, 예를 들어, 모바일 단 말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 접수부는, 적어도 하나의 보험사 서버로부터 판단 보조 솔루션을 요청받을 수 있다. 적어도 하나의 보험사 서버는, 보험금 청구가 접수되는 경우, 보험금 청구에 대한 고지의무위반 및 역선택 적발을 위한 사후현장심사가 필요한지의 여부에 대한 판단 보조 솔루션을 요청할 수 있다. 보험사는 매 년 급증하는 보험사기를 예방하기 위해 이상 금융거래탐지시스템(Fraud Detection System, FDS)을 도입하여 보 험사기에 대해 선제 대응을 하고 있지만, 제출된 서류만으로 사기를 판단하기 쉽지 않으면, 손해사정사에 의뢰하여 현장에 직접 나가 사기 여부를 조사하는 경우가 있다. 현장조사(사후현장심사)를 나갔을 때 보험 사기의 가능성이 있다고 판단되는 경우, 보험금 지급액을 삭감하거나, 면책 또는 계약 변경 등이 이루어진다. 이는 단 기적으로는 회사의 손해를 줄이고, 장기적으로는 손해율을 낮춰 보험료 인상으로부터 고객을 보호할 수 있으며 기업 이익 증대에 영향을 미친다. 이러한 이유로 부정 청구가 의심되는 건을 현장조사 의뢰 하는 것은 굉장히 중요하다. 현장조사는 ① 청구금액이 많거나 ② 다발적으로 청구가 이루어진 경우, ③ 고위험군 질병에 속하는 경우 등 보 험사에서 사전에 정한 규칙(Rule)에 의해 자동으로 의뢰가 이루어지기도 하고, ④ 보상담당자의 주관적 판단으 로 의뢰되기도 한다. 규칙에 의해 자동으로 의뢰된 건이라 하더라도 보상담당자의 판단으로 의뢰가 취소되는 경우도 많이 발생한다. 정형화된 규칙의 판단에 서 벗어나 실제 현장조사 의뢰의 추세를 반영하고, 보상담당자 의 주관적 해석으로 발생할 수 있는 조사 필요 건 누락 가능성을 감소시킬 필요가 있다. 또, 현장조사에는 조 사 비용이 발생하므로 모델의 효용을 극대화하기 위해 조사 의뢰 여부를 예측하되, 그 중에서도 조사의 효용이 있을 만한 건을 최대한 많이 포함 시켜야 한다. 현장조사를 나갔을 때 최종 지급액이 감소하거나(감액) 계약 변경이 있는 경우(계약 변경 요청)를 현장조사 효용이 발생한 것으로 정의할 수 있다. 현장조사 건의 경우 보험사에서 인력을 배치하는 비용과 시간을 부담하며, 지급 처리 시 지연된 기간의 지연이 자까지 해결해야 하기 때문에 아무런 이유 없이 진행하지 않는데, 이러한 현장조사를 나가야 하는 것인지를 보 험사는 본 발명의 플랫폼에 먼저 의뢰하여 보조 판단 역할을 수행할 수 있도록 한다. 더 나아가, 본 발명의 플 랫폼에서는 현장조사를 나간다면 사용자를 중심으로 어느 반경까지 병의원 및 약국을 조사해야 하는 것인지, 어 떠한 병의원 및 약국에 가야 하는 것인지, 몇 년치의 의료기록사본을 뽑아야 하는 것인지 또는 특정 개월이나 날짜의 의료기록사본만으로 충분한 것인지 등의 가이드라인을 제공할 수 있다. 추출부는, 보험금 청구를 한 적어도 하나의 사용자 단말을 추출할 수 있고, 인증부는, 적어도 하나의 사용자 단말로 본인인증을 수행하도록 할 수 있다. 적어도 하나의 공공기관 서버에 본인인증으로 간편인증을 하는 경우, 의료 데이터를 수집할 수 있다. 적어도 하나의 공공기관 서버는, 공공기관포털 및 건 강보험심사평가원의 서버일 수 있다. 국세청 홈택스 또는 건강보험공단에서는 최근 5 년간의 의료 데이터를 제 공해주고 있는데, 이때 제공되는 의료 데이터에는 홈택스의 경우 도 4q와 같이 진단코드가 빠져있고, 상호(병원 명 또는 약국명), 사업자등록번호, 종류 및 지출금액계와 총합계 금액만 출력된다. 또 도 4q의 하단을 보면 실 손의료보험금 수령 테이블이 존재한다. 이때, 고지의무위반 또는 역선택 적발을 위해서는 고지의무위반에 해당하는 진단이 있었거나, 이에 따라 투약처 방을 받았거나, 고지의무에 필수적인 만성질환이 건강진단에서 진단을 받은 적이 있는지 등을 체크해야 하는데, 도 4q와 같은 의료 데이터에는 상술한 바와 같이 진단코드가 빠져있다. 고지의무위반이나 역선택 적발을 위해 서는, 고지의무위반이나 역선택 적발에 대응하는 진단코드와, 사용자가 다녀간 병원 및 약국에서 이용한 진단코 드가 일치해야 찾을 수 있다. 본 발명의 일 실시예에서는 사후현장조사를 나가기 전, 사후현장조사를 해야 할 것인지를 보조적으로 판단해야 하므로, EMR이나 의료기록사본을 볼 수 없다는 것을 전제하고, 진단코드를 유추 또는 예측해야 한다. 이를 위하여 [병원명(상호)-지출금액계-진단코드]를 빅데이터로 구축하게 된다. 이때 병 원명은 한 구역 내에서 1 개만 사용할 수 있고 겹치지는 않으므로 병원명을 사용할 수도 있으나 사업자등록번호 를 고유식별코드로 사용하는 것이 바람직하다. 물론, 병원명 뿐만 아니라, 약국, 즉 투약내역을 판단하기 위하 여 [약국명(상호)-지출금액계-진단코드]로 빅데이터를 구축할 수도 있다. 투약기간과 내역을 확인하기 위해서 이다. 다만, 다양한 빅데이터를 구축하여 다양한 진단, 처방, 치료 등의 진단코드를 예측하지만, 이하에서는 병원의 진단코드를 예를 들어 설명하기로 한다. 예를 들어, 역삼동에 위치한 A 내과에서 3750원이 지출된 경우는 고혈압약을 처방받는 경우이고, 진단코드는 [I10-I15-고혈압성 질환]으로, [A내과-3750원-I10-I15]가 학습 및 검증이 된 경우를 가정하자. 이때, 사용자 B 가 A 내과에서 3750원을 지출했다면 고혈압약을 타러갔을 수도 있고, 당뇨병약을 타러갔을 수도 있으며, 식중독 이나 장염으로 갔을 수도 있지만, 일단 진단코드는 [I10-I15]로 추정한다. 사용자 B의 인구통계학적 데이터나 건강 데이터를 더 입력받는 것이 추정의 정확도를 높일 수 있지만 이는 개인정보보호법 규정 위반 및 조사 제한 사항에 해당하므로 여기서 논외로 하기로 한다. 이렇게 추정된 진단코드가 있고 사용자 B가 진단코드 [I10- I15], 즉 만성질환인 고혈압을 고지하지 않은 경우라고 가정하면, 이 사용자 B의 보험금 청구는 부당하므로 거 절해야 할 사례로 분류하고 보험사 서버로 사후현장조사를 할 것을 권고할 수 있다. 이때, 사후현장조사는 대부분 사용자가 갔던 모든 병의원 및 약국을 대상으로 행해지지만 상술한 데이터를 이용 하는 경우, 손해사정사나 보험사 또는 본 발명의 플랫폼 직원 등은 역삼동에 위치한 A 내과만 가면 되고, 그 날짜도 도 4q와 같이 국세청 홈택스에 기록되어 있으므로 역삼동에 위치한 A 내과(사업자등록번호로 주소 추출)에 서 해당 날짜의 의료기록사본만 제증명서류로 떼면 되기 때문에, 조사범위, 반경, 제증명서류 비용, 시간, 인력 등을 획기적으로 줄여 훨씬 효율적으로 이용할 수 있게 된다. 이때, 진단코드 예측에 대한 상세한 설명은 본 출원인의 한국등록특허 제10-2416618호(2022년07월05일 공고)에 개시되어 있으므로, 더 이상의 상세한 설명은 생략한다. 본 발명의 일 실시예는 본 출원인의 한국등록특허 제10-2416618호(2022년07월05일 공고)의 개량특허 로, 한국등록특허 제10-2416618호(2022년07월05일 공고)를 기반으로 빅데이터를 구축하고 상호, 사업자등록번호 및 지출금액을 인공지능 알고리즘에 질의로 입력한 후, 상호, 사업자등록번호 및 지출금액에 대응하는 진단코드 를 예측하도록 하며, 예측된 진단코드가 고지의무위반 또는 역선택 적발에 대응하는 진단코드와 일치하는 경우, 사후조사대상으로 포함하도록 할 수 있다. 수집부는, 적어도 하나의 사용자 단말에서 본인인증을 수행하는 경우 적어도 하나의 공공기관 서버로 부터 의료 데이터를 스크래핑(Scraping)할 수 있다. 예를 들어, 언어는 Python 3.8.5를 이용할 수 있고, 웹 스 크래핑 패키지는 Beautiful Soup 4.9.0을 이용할 수 있다. 스크래핑 된 데이터는 전부 .txt 형식으로 저장할 수 있다. 그 다음 전처리 작업과 추출을 해야 하는데, 수집된 의료 데이터로부터 ① 5 년 이내 입원, 7 일 이 상 동일 병의원에 내원 및 30 일 이상 투약을 포함하는 5 년간 의료비 지출내역, ② 1 년 이내 치료목적의 병의 원에 내원 및 투약을 포함하는 1 년치 진료내역 및 투약정보, ③ 5 년치 건강검진결과 데이터를 추출할 수 있다. 또, 의료 데이터 중 국세청 홈택스에서 추출한 상호, 사업자등록번호, 지출금액 및 날짜를 추출할 수 있 다. 진단코드예측부는, 의료 데이터 내 상호, 사업자등록번호 및 지출금액으로 진단코드를 예측할 수 있다. 적발부는, 예측된 진단코드가 보험상품 내 고지의무위반 및 역선택 적발에 대응하는 진단코드인지의 여부 를 판단하여 적어도 하나의 보험사 서버로 전달할 수 있다. 즉, ① 청구금액이 많거나 ② 다발적으로 청 구가 이루어진 경우, ③ 고위험군 질병에 속하는 경우 등 보험사에서 사전에 정한 규칙(Rule)에 의해 자동으로 의뢰가 이루어지기도 하는데, 이러한 규칙에 추출되지 못하는 사례가 존재할 수 있으므로, 예를 들어, 고지의무 위반 및 역선택 적발에 대응하는 진단코드가 [A-Z]이고, 예측된 진단코드가 [X-Z]라면, [X-Z]에 대하여 사후현 장조사를 해야 할 건으로 보험사 서버로 전달할 수 있다. 이때, 보험사에서 직접 조사를 하거나 본 발명의 플랫폼의 직원 단말로 업무가 할당되는 경우, X, Y, Z의 진단코드가 예측된 [병원명(상호)-지출금액계-진단코드]가 존재하고, 또 기 구축된 빅데이터에 상호 또는 사업 자등록번호를 통하여 위치, 영업시간, 주소, 전화번호 등의 자료가 존재하며, 지출금액이 나온 날짜도 존재하므 로, 어느 병의원에 직원이나 손해사정사를 보내어 어떤 날짜의 의료기록사본을 떼와야 하는지를 정확히 안내해 줄 수 있다. 예측된 진단코드 [X-Z]는 인공지능 알고리즘에서 지출금액, 상호 등을 보고 예측한 사항이므로 진 단코드 [X-Z]가 맞는 확률이 100%일 수가 없으나, 모래 속에서 바늘을 찾는 격이나 장님이 코끼리 다리를 더듬 듯 찾지 않고, 어떠한 곳을 찾아야 하는지를 안내해주고 가이드를 줄 수 있으므로 사후조사에 효율성을 줄 수 있다. 이때, 의료기록사본으로 진단코드 [X-Z]가 확인되는 경우, 이는 적발 사례로 보험사 서버에서 보험 급 지급 거절을 할 수 있고, 만약 진단코드 [X-Z]가 확인되지 않는다고 할지라도 본 발명의 일 실시예에 따른 인공지능 알고리즘을 재학습시킬 수 있는 데이터셋으로 피드백될 수 있으므로 어느 쪽이든 사후보험조사에 도움 을 주게 된다. 만성질환보고부는, 의료 데이터 내 건강검진결과 데이터를 추출하고, 건강검진결과 데이터 내 기 설정된 만성질환의 여부를 분석하며, 건강검진결과 데이터로 만성질환이라고 분석되었으나 적어도 하나의 사용자 단말 에서 만성질환을 고지하지 않은 경우, 고지의무위반 및 역선택 적발로 보험사 서버로 보고할 수 있다. AI예측부는, 의료 데이터 내 사업자번호, 상호 및 지출금액을 추출한 후, 기 구축된 빅데이터 기반 인공지 능 알고리즘에 질의로 입력하여 진단코드를 출력할 수 있다. 검증부는, 사용자 단말의 위임장으로 확보된 의료기록사본으로 진단코드를 검증할 수 있다. 조회제공부는, 적어도 하나의 보험사 서버에서 고지의무위반 및 역선택 적발을 위한 사후현장심사 필 요여부에 대한 결과 보고서를 조회하도록 접수번호를 기준으로 결과 보고서에 대한 엑세스권을 적어도 하나의 보험사 서버로 제공할 수 있다. 할당부는, 고지의무위반 및 역선택 적발에 대응하는 진단코드가 포함된 적어도 하나의 병의원의 상호, 사 업자등록번호 및 위치를 적어도 하나의 보험사 서버로 제공하거나, 적어도 하나의 직원 단말로 사후현장심사 업무를 할당하여 의료기록사본을 업로드하도록 할 수 있다. 위임장서명부는, 적어도 하나의 직원 단말로 사후현장심사 업무를 할당하기 이전에, 사용자 단말 로부터 위임장에 전자서명을 수신하여 위임장을 받은 후, 위임장을 적어도 하나의 직원 단말로 전달 할 수 있다. 즉, 직접 사용자 단말의 사용자가 구청이나 주민센터에 들러 용도를 지정하여 인감 증명서를 떼고, 위임장 서류에 사인을 해주지 않아도, 전자서명을 수신하여 위임장을 보관할 수 있다. 이동경로최적화부는, 직원 단말로 배분된 사후현장심사 업무를 수행하기 위한 적어도 하나의 병의원 주소, 운영시간 및 점심시간을 추출하고, 적어도 하나의 병의원 주소, 운영시간 및 점심시간에 기초하여 직원 단말의 이동경로를 생성한 후 직원 단말로 전달할 수 있다. 상술한 바와 같이 사후현장심사가 결정 된 경우, 보험사에서 사후현장심사의 자료를 얻기 위해 의료기록사본을 각 병의원이나 약국을 돌아다니면서 제 증명서류를 떼게 된다. 이렇게 보험사가 의료기록사본의 서류발급대행을 요청하면, 사용자의 의료 데이터에 나 와 있는 모든 병의원을 가지 않더라도, 한 명의 직원이 떼야 할 서류는 산더미일 수 있다. 이에 최대한 최적의 이동경로를 제공해주어야 직원이 의료기록사본을 빠르게 또 많이 떼올 수 있는데, 한 명의 직원이 다녀와야 할 병의원의 권역을 설정하는 것이 우선이다. <권역 설정 최적화> 권역 설정에 대한 최적화 방법론은 기본 공간 단위를 어떤 형태의 공간 자료로 재현하느냐에 따라 다양한 기법 이 적용가능하며 결과 또한 달라질 수 있다. 본 발명의 일 실시예에서는 직원에게 배분될 발급대행 서비스의 의료 데이터로부터 상호 및 사업자등록증을 추출하고, 이에 따라 주소를 추출한 후 각 병의원의 위치를 점 데이 터(Point Data)로 취급하여 공간 모델링을 진행할 수 있다. 각 지역에 흩어져있는 병의원을 할당하기 위하여 입지 할당 모델(Location Allocation Problem)을 이용할 수 있다. 입지 할당 모델은 점 데이터로 분포하는 재 화, 서비스, 장소 등을 다수의 시설에 할당하는 문제로, 의료 시설의 입지 문제에도 많이 활용되고 있다. 입지 할당 모델에 사용한 각종 상수값은 인터뷰 및 관련 문헌을 통해 선정할 수 있다. <방문 경로 최적화> 서비스 권역을 토대로 권역별 방문 경로를 최적화할 수 있다. 현행 각 병의원 방문 횟수를 고려하여 방문 병의 원에 대한 최적화된 방문 경로 스케줄을 생성할 수 있다. 직원에게 배분되는 발급대행 서비스에 따라 방문해야 할 병의원이 다르고, 병의원을 방문하는 이동경로는 각 방문지인 병의원이 이산되어 분포하고 있고, 이동경로가 도로나 지하철 등이므로 차량 경로 문제(Vehicle Routing Problem: VRP)로 접근할 수 있다. VRP는 차량이 차 고지에서 출발하여 방문지(수요지)를 순차적으로 모두 방문하고 다시 차고지로 돌아올 때 차량의 총 이동거리를 최소화하는 경로를 찾는 문제로, 직원이 근무지에서 출발하여 의료기록사본을 떼야 할 병의원을 순차적으로 모 두 방문하고 다시 근무지로 돌아오고자 할 때 가장 최단 거리(또는 시간)로 이동하는 문제와 구조적으로 같다고 볼 수 있다. 따라서, 본 발명의 일 실시예에서는 VRP에 기반하여 방문 경로 모델을 공식화할 수 있다. 일반적으로, VRP는 대표적인 조합최적화 문제로 문제에서 다루는 데이터의 양이 많을수록 최적해를 도출하기 어 려워진다. 따라서, 조합최적화 문제는 모델의 정확한 답을 찾기보다 최적값에 준하는 값을 찾는 경우가 많다. 방문 경로 문제는 대량이웃탐색(Large Neighbourhood Search, LNS)이라는 메타휴리스틱 알고리즘을 적용한 VRP Spreadsheet Solver V2.2를 이용해 최적해를 도출할 수 있다. LNS 알고리즘의 핵심은 초기해(Initial Solution)로부터 최적해를 찾아가는 과정에서 적은 수의 이웃을 탐색하는 것보다 많은 수의 이웃을 탐색하는 것 이 보다 좋은 국지적 해를 도출할 수 있다는데 있다. 특히, 교통이나 스케줄 문제 등을 푸는데 매우 효율적인 알고리즘으로 본 발명의 알고리즘으로 이용할 수 있다. 물론, 이 외에 다양한 방법을 이용할 수도 있음은 자명 하다 할 것이다. 의료기록보안부는, 적어도 하나의 직원 단말에서 의료기록사본을 업로드하는 경우, 적어도 하나의 직 원 단말을 가상머신(Virtual Machine)으로 만드는 가상화(Virtualization)를 진행할 수 있다. 이때, 도 커 컨테이너 기반 적어도 하나의 직원 단말을 위한 GPU 가상화 시스템 및 웹 서비스를 이용할 수 있다. 오픈 소스 프로젝트인 도커를 이용할 수 있으며, GPU를 가상화하고, 도커 컨테이너를 이용하여 각 직원이 할당 받은 청구대행업무에 따른 의료사본기록을 보관할 수 있는 환경을 제공해주며, 스토리지를 이용하여 의료사본기 록을 보존할 수 있는 환경을 제공해주고, 직원 단말에서 쉽게 접근하고, 자원을 할당받을 수 있도록 웹 기 반 인터페이스를 이용할 수 있다. <도커> 도커(Docker)는 리눅스 기반의 Container Runtime 오픈소스로, 가상머신과 유사한 기능을 가지면서, 훨씬 가벼 운 형태로 배포가 가능하다. 가상머신은 호스트 운영체제가 설치되고, 그 위에 하이퍼바이저(VMWare, Hyper-V, Xen 등)가 설치된 후, 그 위에 가상머신이 만들어지게 된다. 그래서, 가상머신 위에는 다양한 종류의 OS(Linux, Window)를 설치해서 사용할 수 있게 된다. Docker의 Container는 컨셉은 비슷하지만, 가상머신과 약간 다르다. 도커 컨테이너도 가상머신처럼 호스트 OS 위에 도커 엔진이 설치되고 그 위에 컨테이너가 올라가 게 되는데 이때, 컨테이너는 리눅스 기반의 OS만 수행이 가능하다. 도커는 가상머신처럼 하드웨어를 가상화해주는 것이 아니라 Guest OS를 격리(Isolation)해준다. 컨테이너는 기 본적으로 리눅스 OS만 지원하는데 컨테이너 자체에는 커널 등의 OS 이미지가 들어가 있지 않다. 리눅스 커널은 Host OS를 그대로 사용하며, Host OS와 컨테이너 OS의 다른 부분만 컨테이너 내에 같이 Packing이 되게 된다. 따라서, Host OS가 Ubuntu이고 컨테이너 OS가 CentOS라고 했을 때 컨테이너에는 CentOS의 이미지 전체가 들어가 는 것이 아니라, Ubuntu 와 CentOS의 차이가 되는 부분만 들어가 있게 된다. 컨테이너 내에서 명령을 수행하게 되면 실제로는 Host OS에서 명령어가 수행되는 방식으로 컨테이너는 Host OS의 프로세스 공간을 공유하게 된다. <GPU 가상화> GPU 자원을 가상화하게 되면 필요한 만큼만 자원을 최적화하여 활용할 수 있기 때문에 자원의 비효율적인 낭비 또는 부족 현상을 최소화할 수 있게 된다. GPU 가상화는 제품 제조업체의 하드웨어 및 소프트웨어 지원이 없어 서 어려운 문제로 야기되고 있었다. 가상화는 소프트웨어적으로 구현되고 동작하는 경우가 대부분인데, 하드웨 어 차원의 호환이 없다면 구현이 어렵기 때문이다. 하지만, 현재는 AI의 수요가 증가하고 있어 GPU 제조업체들 은 가상화를 지원하기 시작했다. GPU 가상화 기술은 가상화를 어느 관점에서 구현하느냐에 따라 ① Direct Pass-Through, ② Para & Full Virtualization 그리고 ③ API 리모팅으로 구분되게 된다. ① Direct Pass-Through 방식은 가상머신이 하이퍼바이저 중재 없이 직접 GPU 자원을 사용할 수 있도록 하는 방 식이다. NVIDIA에서 클라우드 서비스를 위해 하드웨어 단계에서 가상화를 진행한 NVIDIA GRID를 공개하였다. 하지만, 특정 하드웨어 제품군에서만 사용할 수 있으며, 여러 개의 가상머신이 하나의 GPU 하드웨어에 접근할 수 없는 문제가 있다. ② Para & Full Virtualization 방식은 하이퍼바이저를 통해 가상머신 별로 GPU 자원을 할당할 수 있지만, 하이퍼바이저 통신으로 인한 오버헤드가 발생할 수 있고, GPU 하드웨어에 대한 정보와 드라 이버 레벨의 소스 코드를 기반으로 구현해야 한다. 하드웨어 드라이버가 업데이트될 때마다 수정이 필요한 문 제가 있다. ③ API 리모팅은, GPU 벤더가 가상화를 지원하지 않을 때 가상화를 구현하는 방법으로 Guest OS에 Host OS에서 쓰이는 GPU 라이브러리와 동일한 API를 가진 래퍼 라이브러리를 제공하는 것을 의미한다. 래퍼 라이브러리는 GPU 응용프로그램이 GPU에 대한 연산 함수를 호출할 때, 그 호출이 직접 GPU 드라이버에 도달하기 전에 가로채 게 되는데, 이렇게 가로채어진 호출은 공유 메모리를 통해서 같은 시스템 내의 Host OS로 전달되게 된다. Host OS로 전달된 호출은 원격으로 처리되므로 API 리모팅 이름이라는 이름이 붙여졌다. 원격에서 GPU호출이 처리된 후 호출의 결괏값만 다시 래퍼 라이브러리로 전달되게 되게 된다. 다만 이러한 방식은 기존의 가상화 환경에서 Guest OS의 프로그램들을 수행하는 데 있어 성능 저하를 유발시키게 된다. Guest OS의 응용프로그램은 하드웨 어를 활용할 때, 반드시 Host OS를 거쳐서 접근 및 실행할 수 있도록 되어 있는데, 가상화가 없는 상태의 GPU를 활용하는 것에 비해 백엔드-프론트엔드(Backend-Frontend) 통신이 추가되게 되므로, 성능 저하로 이어지기 때문 이다. API 리모팅 기법을 사용한 방식으로는 GViM, vCUDA, rCUDA, GVirtuS가 있다 <도커 컨테이너 기반 GPU 가상화> 다수의 직원이 각 사용자의 의료기록사본을 솔루션 서비스 제공 서버에 업로드할 때 사용해야 하는 서비스 이므로 간단한 사용 방법을 통하여 쉽게 사용할 수 있는 서비스가 제공되어야 한다. 본 발명의 일 실시예에서 는 도커 컨테이너 기반 GPU 가상화 시스템을 제공하기 위해서 웹 인터페이스를 이용하여 서비스를 제공할 수 있 다. 우선, 도커 컨테이너를 생성하기 위해서는 컨테이너 이름, 포트 정보, 도커 이미지 정보, 데이터 마운트 경로 위치, 할당 요청할 GPU ID 리스트가 필요하다. 현재 포트가 할당되어 있는지, 도커 이미지가 솔루션 서비 스 제공 서버에 다운로드 되어 있는지, GPU가 이미 할당되어 있는지 등을 파악한 후에 컨테이너를 생성해 주고 컨테이너에 접속할 수 있는 패스워드를 반환값으로 리턴 해준다. 도커 컨테이너를 삭제하기 위해서는 서 버 아이디, 컨테이너 아이디가 필요하다. 현재 솔루션 서비스 제공 서버의 접속 상태를 확인하고, 솔루션 서비스 제공 서버가 연결되어 있으면 컨테이너를 삭제 요청한다. 성공적으로 삭제가 완료되면 데이터베이 스에 할당된 GPU를 할당할 수 있는 상태로 변경해준다. 솔루션 서비스 제공 서버의 자원이 낭비되지 않고 최적의 효율을 달성기 위해 서버의 활용률을 알아야 자 원 배분을 효율적으로 할 수 있게 된다. 솔루션 서비스 제공 서버의 활용률은 이하 수학식 1을 통하여 계 산될 수 있다. 수학식 1"}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 CU는 CPU의 사용률을 나타내며, NC는 서버의 코어 개수를 나타낸다. GU는 GPU의 사용률을 나타내며, NG 는 연결된 GPU의 개수를 나타낸다. UCU는 서버 코어의 개수가 반영된 최종 CPU 사용률을 나타내며, UGU는 GPU 의 개수가 반영된 최종 GPU 사용률을 나타낸다. 여기서 i는 각 서버의 번호를 의미한다. 서버 코어의 개수와 GPU의 개수는 연결된 서버별로 CPU가 다를 수 있고, 연결된 GPU의 개수가 다를 수 있기 때문에 활용률에 반영할 수 있다. 이렇게 수집된 의료기록사본은 상술한 바와 같이 인공지능 알고리즘의 진단코드 예측을 검증하는데 사용되게 되고, 인공지능 학습 특성상 CPU 사용보다는 GPU 사용을 더 많이 하므로 GPU 사용률에 0.7의 가중치를 두어서 자원 배분을 효율적으로 할 수도 있다. 최종 서버의 사용률은 이하 수학식 2를 통하여 계산할 수 있다. 수학식 2"}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 ANC는 전체 서버 코어의 개수를 나타내고, ANG는 전체 서버의 GPU 개수를 나타낸다. SU는 서버의 사용 률을 나타낸다. 이하, 상술한 도 2의 솔루션 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설 명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 솔루션 서비스 제공 서버는 적어도 하나의 보험사 서버로부터 사후현장심사 필 요 여부를 판단하기 위한 솔루션을 요청받고, 사용자 정보를 사용자 단말과 매핑하여 저장하고, (b)와 같 이 본인인증 및 위임장에 서명을 받고 각종 공공기관 서버로부터 의료 데이터를 스크래핑하며, (c)와 같이 의료 데이터를 질의로 인공지능 알고리즘에 입력한 후, 진단코드를 예측하고, 예측된 진단코드가 고지의무위반 또는 역선택 적발의 진단코드와 일치하는지를 파악하며, 일치하는 경우에는 사후현장심사 업무로 배정하도록 보험사 서버로 보고하고, 직원 단말로 의료기록사본 수집 업무를 할당하며, 수지보딘 의료기록사본 내 진단 코드와 예측된 진단코드가 일치하는 경우, 적발 사례로 보험사 서버로 보고하고, 일치하지 않는 경우에는 인공지능 알고리즘을 재학습할 데이터셋으로 구축하여 피드백할 수 있다. 본 발명의 일 실시예에 따른 플랫폼(라이프캐치, 그린리본)은, 도 4a와 같이 제척기간(3 년) 내에 보험금을 청 구하는 경우, 현장심사 진행여부를 판단하고, 심사가 필요하다고 결정되면, 현장심사를 안내하고, 고객과 면담 을 하며 내원병원을 확인하고 거주지 및 활동지 주변을 탐문하고 과거 병력을 검토한 후 계약적부심사 및 보험 금 지급을 진행하는 과정에서, 도 4b와 같이 과거력이 있음에도 보험금을 지급한다거나, 현장심사를 안보내도 되는 건을 조사를 보내서 심사비용을 과다하게 발생(1 명 기준 평균 30 만원)시키거나 민원을 발생시키는 등의 문제점을 해결하고자, 도 4c와 같은 솔루션을 제안한다. 도 4d와 같이 현재 심사 리스크는 2 가지, 즉 지급지 연이자가 발생하는 점과, 고지의무위반을 적발하는 퍼센테이지가 10%도 안된다는 점에 있다. 지급지연이자는 상술한 과정을 진행하면서 보험금의 지급이 지연되면 이에 대한 법정이자를 배상해야 하는 문제가 있고, 또 조 사비 또한 108 억으로 과다하게 지출되고 있음에도 적발률은 8.3%에 그치고 있다. 이에 본 발명의 플랫폼은 도 4e와 같이 보험사 서버로부터 사후현장조사가 필요할 것인지, 즉 과거력을 조 사하여 사용자가 고지의무를 위반한 것은 아닌지, 보험사기를 치려는 것은 아닌지 등을 조사할 필요가 있는지에대한 선제 조건으로, 사후현장조사가 필요한 것인지를 판단하기 위한 솔루션을 제공하고자 한다. 즉, 손해사정 사를 고용하여 내보내야 할 건인지 아닌지를 인공지능으로 파악하고, 각 직원에게 의료기록사본을 어떤 병의원 이나 약국에서, 어떤 날짜의 의료기록사본을 떼야 하는지까지 안내해주는 것이다. 본 발명의 플랫폼은 도 4f와 같이 과거력 조건에 대응하는 의료 데이터를 수집한 후 인공지능 알고리즘으로 사후현장조사가 필요한 것인지를 판단하게 되고 이를 보험사 서버로 제공한다. 도 4g와 같은 화면으로 과거 병력을 제공할 수 있으나 이에 한정되는 것은 아니다. 본 발명의 플랫폼은 기 등록된 본 출원인의 선등록특허인 도 4h 내지 도 4p와 같은 애플리케이션에 기반하는데, 본 발명의 일 실시예는 도 4h 내지 도 4p의 애플리케이션과 연계하여 각 보험사의 리스크를 줄여주고, 각 사용 자가 정당 청구인인 경우에는 사후현장심사로 보험금 지급이 지연되는 일 없이 빠르게 지급을 받을 수 있도록 도와줄 수 있고, 정당하지 못한 청구인인 경우 빠르게 심사를 종결하여 역선택으로 인해 보험료가 모든 보험계 약자에게 상승하는 일이 없도록 함으로써, 우량한 가입자 집단의 실손의료보험시장 이탈을 막고, 이로 인해 보 험의 재무건전성이 높아져 시간이 흐름에 따라 보장 확대와 보험료 인하로 이어질 수 있다. 장기적 관점에서 실손의료보험의 시장확대로 소비자의 위험전가와 보험회사의 위험인수가 증가될 것이며 이로 인한 결과인 소비 자의 효용증가와 보험회사의 잠재적 이익확대는 실손의료보험의 시장 참가자들이 덜게 될 사회적 비용에 해당한 다. 실손의료보험 제도가 보완되고 개선됨으로써 국민복지향상에 지속적으로 순기능을 제공할 수 있도록 도와 줄 수 있다. 이와 같은 도 2 내지 도 4의 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서 비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 고지의무위반 및 역선택 적발을 위한 사후 현장심사 필요여부 판단 보조 솔루션 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부 터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되는 과정의 일 예를 설명할 것이나, 이와 같은 실시예 로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한 실시예들에 따라 도 5에 도시된 데이터가 송수신되"}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 솔루션 서비스 제공 서버는, 적어도 하나의 보험사 서버로부터 판단 보조 솔루션을 요청받는 다(S5100). 그리고, 솔루션 서비스 제공 서버는, 보험금 청구를 한 적어도 하나의 사용자 단말을 추출하고(S5200), 적어도 하나의 사용자 단말로 본인인증을 수행하도록 한다(S5300). 또, 솔루션 서비스 제공 서버는, 적어도 하나의 사 용자 단말에서 본인인증을 수행하는 경우 적어도 하나의 공공기관 서버로부터 의료 데이터를 스크래핑 (Scraping)하고(S5400), 의료 데이터 내 상호, 사업자등록번호 및 지출금액으로 진단코드를 예측한다(S5500). 그리고, 솔루션 서비스 제공 서버는, 예측된 진단코드가 보험상품 내 고지의무위반 및 역선택 적발에 대응하는 진단코드인지의 여부를 판단하여 적어도 하나의 보험사 서버로 전달한다(S5600). 상술한 단계들(S5100~S5600)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5600)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 고지의무위반 및 역선택 적발을 위한 사후 현장심사 필요여부 판단 보조 솔루션 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부 터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실 행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포 함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔 루션 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼 이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실 시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스 제공 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기 에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2022-0094645", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2022-0094645", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔 루션 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 솔루션 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔루션 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 고지의무위반 및 역선택 적발을 위한 사후현장심사 필요여부 판단 보조 솔 루션 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
