{"patent_id": "10-2022-0144247", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0062575", "출원번호": "10-2022-0144247", "발명의 명칭": "실물 경제 연계형 메타버스 플랫폼 제공 시스템", "출원인": "메타브릿지 주식회사", "발명자": "한소영"}}
{"patent_id": "10-2022-0144247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실물 경제 연계형 메타버스 플랫폼 제공 시스템으로서,현실세계의 지리적 정보와 대응되도록 메타버스를 생성하고, 상기 메타버스에 접속하는 복수의 사용자 단말이상기 메타버스 내 제공되는 복수의 콘텐츠를 이용하도록 관리하고, 상기 복수의 사용자 단말 중 제1그룹의 사용자 단말이 상기 메타버스 상 복수의 계약 영역 각각에 메타버스 공간을 구축 및 운영하도록 관리하는 플랫폼 서버를 포함하며,상기 플랫폼 서버는,상기 복수의 계약 영역 중 제1계약 영역에 구축된 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 상기 제1메타버스 공간에 대응하는 실공간의 지분에 대해 생성된 블록체인 기반의 NFT(Non FungibleToken)를 상기 제1계약 영역에 대해 운영 권한을 가지는 제1사용자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리하는 서버 프로세서를 포함하는 메타버스 플랫폼 제공 시스템."}
{"patent_id": "10-2022-0144247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 NFT는 제1NFT이고,상기 서버 프로세서는,상기 제1메타버스 공간의 지분에 대해 생성된 블록체인 기반의 제2NFT를 상기 제1사용자 단말과 상기 적어도 하나의 사용자 단말 간 거래하도록 관리하는 메타버스 플랫폼 제공 시스템."}
{"patent_id": "10-2022-0144247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 서버 프로세서는,제1사용자 단말과 상기 적어도 하나의 사용자 단말 간 제1NFT 및 제2NFT를 거래할 수 있는 제1사용자 인터페이스(User Interface)를 제공하는 메타버스 플랫폼 제공 시스템."}
{"patent_id": "10-2022-0144247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 적어도 하나의 사용자 단말은 상기 제1메타버스 공간에 제공되는 컨텐츠를 이용하는 사용자 단말 및 상기실공간 구현에 대한 참여자의 단말을 포함하는 것을 특징으로 하는 메타버스 플랫폼 제공 시스템."}
{"patent_id": "10-2022-0144247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 서버 프로세서는,상기 복수의 사용자 단말이 공모 대상 영역에 구축가능한 메타버스 공간을 공모할 수 있는 제2사용자 인터페이스를 제공하고,상기 제2사용자 인터페이스를 통해 소정 기간 동안 공모된 복수의 메타버스 공간에 대해 평가할 수 있는 제3사용자 인터페이스를 제공하고,상기 제3사용자 인터페이스를 통해 평가된 평가 결과에 기초하여 선정된 메타버스 공간을 구축한 사용자 단말에리워드를 제공하는 메타버스 플랫폼 제공 시스템.공개특허 10-2024-0062575-3-청구항 6 제1항에 있어서,상기 플랫폼 서버는,상기 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 실공간 구현에 관한 정보를 상기메타버스 상에 표시하는 메타버스 플랫폼 제공 시스템."}
{"patent_id": "10-2022-0144247", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "실물 경제 연계형 메타버스 플랫폼 제공 시스템으로서,현실세계의 지리적 정보와 대응되도록 메타버스를 생성하고, 상기 메타버스에 접속하는 복수의 사용자 단말이상기 메타버스 내 제공되는 복수의 콘텐츠를 이용하도록 관리하고, 상기 메타버스 상에서 관리자 단말에 의해제어되는 관리 영역을 설정하여 상기 관리자 단말이 상기 메타버스 상 상기 관리 영역에 메타버스 공간을 구축및 운영하도록 하는 플랫폼 서버를 포함하며,상기 플랫폼 서버는,상기 관리 영역에 구축된 상기 메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 상기 메타버스 공간에 대응하는 실공간의 지분에 대해 생성된 블록체인 기반의 NFT(Non Fungible Token)를 상기 관리자단말과 적어도 하나의 사용자 단말 간 거래하도록 관리하는 서버 프로세서를 포함하는 메타버스 플랫폼 제공 시스템."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 실물 경제 연계형 메타버스 플랫폼 제공 시스템으로서, 복수의 계약 영역 중 제1계 약 영역에 구축된 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 상기 제1메타버스 공 간에 대응하는 실공간의 지분에 대해 생성된 블록체인 기반의 NFT(Non Fungible Token)를 상기 제1계약 영역에 대해 운영 권한을 가지는 제1사용자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리하는 플랫폼 서버를 제공한다."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 현실세계의 실공간 구현에 앞서 메타버스 공간을 가상세계인 메타버스에 먼저 구현한 후에 해당 메타 버스 공간에 대한 실공간을 구현하는 경우, 실공간 구현에 대한 투자, 창업, 참여자 및 아이디어를 효과적으로 유치할 수 있는 메타버스 플랫폼을 제공하는 시스템에 관한 것이다."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "메타버스(metaverse)는 가상, 초월을 의미하는 '메타'(meta)와 우주를 의미하는 '유니버스'(universe)를 합성한 신조어로, 사회, 경제, 문화적 활동이 가능한 가상 세계를 지칭하는 개념이다. 미국의 세컨드 라이프(second life)를 기점으로 포트나이트(Fortnite), 마인크래프트(Minecraft), 제페토 (ZEPETO) 등 메타버스를 구현한 플랫폼의 출시에 따라 메타버스에 대한 관심이 폭발적으로 증가하고, 코로나 19 로 인한 비대면 추세 확산 및 이로 인한 비대면 생활 환경에 익숙한 문화 형성으로 인해 메타버스는 비대면으로 타인과 교류하고 소통할 수 있는 공간으로 급부상하였다. 이러한 상황에서 가상세계 오픈소스 소프트웨어 개발로 구체화된 메타버스의 구현이 가능해졌다. 한편, 메타버스의 확산 양상에 따라 현실세계에 없는 공간들을 구축한 메타버스 공간들도 생겨나고, 가상화폐, NFT(Non-Fungible Token)를 이용한 사용자 간 거래가 활성화되면서 메타버스 상의 가상 경제 규모가 커지고 있 다. 또한, 사용자들이 메타버스 공간 상에서 가상의 경제적, 문화적 활동을 영위하게 됨에 따라 메타버스에서 큰 인 기를 얻는 콘텐츠들은 현실세계에서도 제공하고자 하는 욕구가 있다. 따라서, 메타버스에서 현실세계로의 사업 확장 시, 메타버스나 현실세계 상 거래, 투자, 창업, 참여자 및 아이 디어 등을 유치할 수 있는 플랫폼에 대한 제안이 필요한 실정이다."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 메타버스 공간에 기반한 메타버스의 가상 경제를 실공간에 기반한 실물 경제로 확장시에 실질 적인 투자, 창업, 참여자 및 아이디어 등을 메타버스를 통해 효과적으로 유치 가능하게 하는 메타버스 플랫폼 제공 시스템을 제공하는 것이다. 본 발명의 목적은 메타버스 공간에 대응되는 고도화된 실공간 구현 시 이익창출 효과를 극대화할 수 있는 메타 버스 플랫폼 제공 시스템을 제공하는 것이다. 본 발명의 목적은 메타버스 공간이나 실공간에 대한 참신한 아이디어를 공모할 수 있는 메타버스 플랫폼 제공 시스템을 제공하는 것이다. 본 발명의 목적은 메타버스 공간의 실공간 구현에 필요한 투자를 유치할 수 있는 메타버스 플랫폼 제공 시스템 을 제공하는 것이다."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 실물 경제 연계형 메타버스 플랫폼 제공 시스템으로서, 현실세계의 지리적 정보와 대응되도록 메타버스를 생성하고, 상기 메타버스에 접속하는 복수의 사용자 단말이 상기 메타버스 내 제공되는 복수의 콘텐츠를 이용하도록 관리하고, 상기 복수의 사용자 단말 중 제1그룹의 사용자 단말이 상기 메타버스 상 복수의 계약 영역 각각에 메타버스 공간을 구축 및 운영하도록 관리하는 플랫폼 서버를 포함하며, 상기 플랫폼 서버는, 상기 복수의 계약 영역 중 제1계약 영역에 구축된 제1메타버스 공간에 대해 현실세계의 실공간으로 구 현이 진행되는 경우, 상기 제1메타버스 공간에 대응하는 실공간의 지분에 대해 생성된 블록체인 기반의 NFT(Non Fungible Token)를 상기 제1계약 영역에 대해 운영 권한을 가지는 제1사용자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리하는 서버 프로세서를 포함한다. 상기 NFT는 제1NFT이고, 상기 서버 프로세서는, 상기 제1메타버스 공간의 지분에 대해 생성된 블록체인 기반의 제2NFT를 상기 제1사용자 단말과 상기 적어도 하나의 사용자 단말 간 거래하도록 관리할 수 있다. 상기 서버 프로세서는, 제1사용자 단말과 상기 적어도 하나의 사용자 단말 간 제1NFT 및 제2NFT를 거래할 수 있 는 제1사용자 인터페이스(User Interface)를 제공할 수 있다. 상기 적어도 하나의 사용자 단말은 상기 제1메타버스 공간에 제공되는 컨텐츠를 이용하는 사용자 단말 및 상기 실공간 구현에 대한 참여자의 단말을 포함할 수 있다. 상기 서버 프로세서는, 상기 복수의 사용자 단말이 공모 대상 영역에 구축가능한 메타버스 공간을 공모할 수 있 는 제2사용자 인터페이스를 제공하고, 상기 제2사용자 인터페이스를 통해 소정 기간 동안 공모된 복수의 메타버 스 공간에 대해 평가할 수 있는 제3사용자 인터페이스를 제공하고, 상기 제3사용자 인터페이스를 통해 평가된 평가 결과에 기초하여 선정된 메타버스 공간을 구축한 사용자 단말에 리워드를 제공할 수 있다. 상기 플랫폼 서버는, 상기 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 실공간 구현 에 관한 정보를 상기 메타버스 상에 표시할 수 있다. 본 발명의 다른 실시예에 따른 실물 경제 연계형 메타버스 플랫폼 제공 시스템으로서, 현실세계의 지리적 정보 와 대응되도록 메타버스를 생성하고, 상기 메타버스에 접속하는 복수의 사용자 단말이 상기 메타버스 내 제공되 는 복수의 콘텐츠를 이용하도록 관리하고, 상기 메타버스 상에서 관리자 단말에 의해 제어되는 관리 영역을 설 정하여 상기 관리자 단말이 상기 메타버스 상 상기 관리 영역에 메타버스 공간을 구축 및 운영하도록 하는 플랫 폼 서버를 포함하며, 상기 플랫폼 서버는, 상기 관리 영역에 구축된 상기 메타버스 공간에 대해 현실세계의 실 공간으로 구현이 진행되는 경우, 상기 메타버스 공간에 대응하는 실공간의 지분에 대해 생성된 블록체인 기반의 NFT(Non Fungible Token)를 상기 관리자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리하는 서버 프로 세서를 포함한다."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명을 통해, 메타버스 공간에 기반한 메타버스의 가상 경제를 실공간 기반의 실물 경제로 확장하는 경우에 있어서, 효과적으로 투자와 참여자를 유치할 수 있을 뿐 아니라, 메타버스 공간이나 실공간에 대한 참신한 아이 디어를 공모할 수 있어, 창업과 투자 구조의 선순환을 유도할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스를 통해 메타버스 공간의 실공간 구현이 진행됨을 공지하고, 실공간에 대한 지분 확보가 가능하게 함으로써, 실공간 구현에 필요한 투자와 참여자를 적극적으로 유치할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스 상에서 수익성 및 사업 확장성을 검증받은 메타버스 공간을 실공간으 로 구현하는 바, 가시적으로 투자 대상을 보여줄 수 있고 해당 메타버스 공간에 대한 실공간 구현의 성공 가능 성을 효과적으로 가늠할 수 있으므로 투자와 참여자 유치에 설득력이 있고, 효율적이다. 본 발명의 일 실시예에 따르면, 메타버스 상에서 NFT를 이용한 거래를 통해 실공간에 대한 투자를 할 수 있는 바, NFT의 무결성과 안전성에 기반한 투자와 참여의 안전을 담보할 수 있다."}
{"patent_id": "10-2022-0144247", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략할 수 있고, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 대해서는 동일한 참조 부 호를 사용할 수 있다. 또한, 본 발명의 실시예에서, 제1, 제2 등과 같이 서수를 포함하는 용어는 하나의 구성요 소를 다른 구성요소로부터 구별하는 목적으로만 사용되며, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 도 1은 본 발명의 일 실시예에 따른 메타버스 플랫폼 제공 시스템을 도시한 개략도이다. 본 발명의 일 실시예에 따르면, 메타버스 플랫폼 제공 시스템(이하 시스템이라 한다.)은 메타버스 (Metaverse) 및 메타버스 상의 다양한 콘텐츠를 제공하는 시스템으로, 플랫폼 서버, 복수의 사용자 단말 , 관리자 단말을 포함한다. 본 발명의 일 실시예에 따른 플랫폼 서버는 현실세계의 지리적 정보와 대응되도록 메타버스를 생성하고, 메타버스에 접속하는 복수의 사용자 단말이 메타버스 내 제공되는 복수의 콘텐츠를 이용하도록 관리하는 서버 장치이다. 플랫폼 서버는 지리 정보 시스템(GIS, Geographic Information System)을 이용하여 현실세계의 지리적 정 보를 그대로 반영한 메타버스를 형성할 수 있다. 메타버스가 실제 지적 정보를 기초로 형성되는 바, 추후 메타 버스 공간을 실공간으로 구현하는 경우 현실세계의 지리적 정보에 기초하여 구현할 수 있어 메타버스에서의 메 타버스 공간과 현실세계의 실공간의 위치가 지리적으로 대응될 수 있으므로, 메타버스 공간과 실공간의 양자 권 리 관계를 연동시킬 수도 있다. 이와 같이 메타버스가 현실세계의 지리적 정보를 기초하여 형성된 후, 현실세계의 실공간 구현에 앞서 메타버스 에서 메타버스 공간이 먼저 구현되는데, 메타버스의 모든 메타버스 공간이 실공간 구현에 앞서 구현될 필요는 없으며, 일부 메타버스 공간은 현실세계에 이미 실공간으로 구현되어 있는 것을 미러링하여 메타버스에 구현한 것일 수도 있다. 본 발명의 일 실시예에 따른 복수의 사용자 단말은 사용자가 메타버스에 접속하여 메타버스 내 제공되는 다양한 콘텐츠를 이용하고, 가상의 경제적, 문화적 활동 등을 영위할 수 있는 전자장치로써, 컴퓨터, 노트북, 휴대폰 등으로 구현될 수 있다. 본 발명의 일 실시예에 따른 사용자는 개인일 수 있으나, 이에 한정되지 않고 기업이 될 수 있다. 여기서 메타버스 내 제공되는 다양한 콘텐츠는, 사용자 고유의 아바타를 이용한 다양한 메타버스 공간 체험과 이동, 아바타 간의 정보 교환과 커뮤니케이션, 메타버스를 통한 아이템 거래와 결제, 메타버스를 통해 즐길 수 있는 게임, 음악, 영상, 영화, 연극, 콘서트, 가상현실과 증강현실 같은 실감형 체험, 메타버스 공간에 대한 소 유권, 지분에 대한 거래와 결제 및 메타버스를 통한 공모, 투자, 창업, 펀딩, 기부, 교육, 전시 등 매우 다양할 수 있으며, 앞서 열거된 바에 한정되지 않음을 밝혀둔다.복수의 사용자 단말 중에서도 일부 사용자 단말(이하, 제1그룹의 사용자 단말이라 한다.)은 메타버스 내 제공되는 콘텐츠들을 이용할 뿐 아니라, 메타버스 상 복수의 영역 중 할당 받은 영역(이하, 계약 영역이라 한다.)에 건축물, 실내공간, 정원과 같은 실외 공간, 도로와 같은 인프라 중 적어도 하나를 포함하는 메타버스 공간을 구축하고, 운영할 수 있는 운영 권한을 가진다. 제1그룹의 사용자 단말은 각자 계약 영역에 구축한 메타 버스 공간에서 콘텐츠를 제공하여 수익을 창출할 수 있다. 제1그룹의 사용자 단말의 사용자들은 현재 자신이 계 획하고 있는 사업을 메타버스 상에서 시도해보면서 현실 가능성이나 개선점들을 모색할 수 있다. 여기서, 제1그룹의 사용자 단말의 사용자들이 계약 영역을 할당 받고, 이를 운영할 수 있는 운영 권한을 갖기 위한 권리 근거인 계약 행위는 관리자 단말이나 플랫폼 서버에 대해 메타버스에서 이루어질 수도 있 고, 별도의 오프라인, 온라인 상에서 관리자와 해당 사용자 간에 이루어질 수도 있다. 본 발명의 일 실시예에 따른 관리자 단말은 플랫폼 서버가 메타버스를 생성, 관리하고, 복수의 사용 자 단말이 메타버스 내 다양한 콘텐츠를 이용, 운영하는 전반적인 동작들을 관장하는 전자장치로써, 컴퓨 터, 노트북, 휴대폰 등으로 구현될 수 있다. 본 발명의 일 실시예에 따르면, 관리자는 관리자 단말을 이용 하여 메타버스 서비스 시스템을 관리, 감독하는 운영자로써, 기업, 기관 또는 개인이 될 수 있다. 이와 같이, 복수의 사용자 단말, 관리자 단말은 메타버스 내에서 다양한 콘텐츠를 제작, 제공하거나 경험하고, 그에 기반한 경제 활동을 통해 메타버스 내 가상 경제를 활성화시킬 수 있다. 가상 경제(virtual economy)는 실물 경제에서의 노동과 생산물이라는 주요 생산 요소 대신, 전자적 바이트들의 조합으로 구성되는 재조합 상품에 기반한 가상세계에서의 실질 경제를 의미한다. 메타버스 내 가상 경제가 활성화 되는 상황에서 제1그룹의 사용자 단말은 각자의 계약 영역에서의 콘텐츠 인기, 수익성 등에 따라 자연스럽게 메타버스 공간을 실공간으로 구현하는 방안을 검토하게 된다. 본 발명에서는 계약 영역에 구축된 건축물, 실내공간, 실외 공간, 인프라 등과 같은 메타버스 공간에 대해 현실 세계의 실공간으로 구현이 진행되는 경우, 필요한 투자, 참여자, 창업, 아이디어를 유치할 수 있는 시스템에 대 해 제안한다. 본 발명을 통해, 메타버스 공간에 기반한 메타버스의 가상 경제를 실공간에 기반한 실물 경제로 확장시에 효과 적인 투자와 참여를 유치할 뿐 아니라, 메타버스 공간이나 실공간에 대한 참신한 아이디어를 공모할 수 있어, 창업과 투자 구조의 선순환을 유도할 수 있고, 메타버스 상의 가상 경제와 실물 경제 간의 연동 효용성을 높일 수 있다. 이하, 도면들을 참조하여 본 발명의 일 실시예에 따른 플랫폼 서버의 구성 및 동작에 대해 보다 구체적으 로 설명한다. 도 2는 본 발명의 일 실시예에 따른 플랫폼 서버의 구성을 도시한 블럭도이다. 본 발명의 일 실시예에 따른 플랫폼 서버는 입력부, 통신부, 표시부, 메모리 및 서버 프로세서를 포함한다. 입력부는 플랫폼 서버의 사용자 입력에 대응하여 입력데이터를 발생시킨다. 예를 들어, 사용자 입력 은 플랫폼 서버가 메타버스를 생성하기 위한 사용자 입력, 메타버스 내 생성되는 모든 메타버스 공간을 관 리하기 위한 사용자 입력, 제1그룹의 사용자 단말에 계약 영역을 할당하기 위한 사용자 입력, 관리 영역을 설정 하기 위한 사용자 입력, 실공간 구현에 관한 정보를 표시하기 위한 사용자 입력 등 메타버스 생성 및 관리를 수 행하기 위한 사용자 입력인 경우 제한하지 않고 적용 가능하다. 입력부는 적어도 하나의 입력수단을 포함한다. 입력부는 키보드(key board), 키패드(key pad), 돔 스 위치(dome switch), 터치패널(touch panel), 터치 키(touch key), 마우스(mouse), 메뉴 버튼(menu button) 등 을 포함할 수 있다. 이때, 사용자 입력은 플랫폼 서버에 구비되는 입력부 자체로부터 수신할 수 있으나, 이에 한정되지 않고 복수의 사용자 단말, 관리자 단말에 각각 구비되는 입력부로부터 수신하는 입력 신호일 수 있다. 입 력 신호는 후술되는 통신부를 통해 수신할 수 있다. 통신부는 네트워크를 통해 필요한 정보나 신호를 수신하기 위해 복수의 사용자 단말, 관리자 단 말, 외부 서버 등 외부장치와의 통신을 수행한다. 이를 위해, 통신부는 5G(5th generation communication), LTE-A(long term evolution-advanced), LTE(long term evolution), Wi-Fi(wirelessfidelity) 등의 무선 통신 혹은 LAN(local area network), WAN(Wide Area Network), 전력선 통신 등의 유선 통 신을 수행할 수 있다. 표시부는 플랫폼 서버의 동작에 따른 표시 데이터를 표시한다. 표시부는 서비스를 제공하기 위 해 필요한 표시 데이터, 예를 들면 메타버스를 생성하는 화면, 제1그룹의 사용자 단말이나 관리자 단말에 영역을 할당하는 화면, 실공간 구현에 관한 정보를 표시하는 화면 등을 표시할 수 있다. 표시부는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디 스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함한다. 표시부 는 입력부와 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 메모리는 플랫폼 서버의 동작 프로그램들을 저장한다. 메모리는 전원의 제공 유무와 무관하게 데이터(정보)를 보존할 수 있는 비휘발성 속성의 스토리지(storage)와, 서버 프로세서에 의해 처리되기 위 한 데이터가 로딩되며 전원이 제공되지 않으면 데이터를 보존할 수 없는 휘발성 속성의 메모리(memory)를 포함 한다. 스토리지에는 플래시메모리(flash-memory), HDD(hard-disc drive), SSD(solid-state drive) ROM(Read Only Memory) 등이 있으며, 메모리에는 버퍼(buffer), 램(RAM; Random Access Memory) 등이 있다. 메모리는 메타버스를 생성, 복수의 사용자 단말이 콘텐츠를 제작, 이용하는데 필요한 GIS 정보, 영상 정보, 그래픽 정보 등을 저장하거나, 운영 권한을 부여, 블록체인 기반의 NFT를 생성, 거래 등의 과정에서 필요 한 연산 프로그램 등을 저장할 수 있다. 서버 프로세서는 프로그램 등 소프트웨어를 실행하여 플랫폼 서버의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 서버 프로세서는 중앙 처리 장치(CPU) 또는 어플리케이션 프로세서 역할을 수행하는 메인 프로세서와 이와는 독립적으로 또는 함께 운영 가능한 그래픽 처리 장치(GPU)를 포함할 수 있다. 서버 프로세서는 현실세계의 지리적 정보와 대응되도록 메타버스를 생성하고, 메타버스에 접속하는 복수의 사용자 단말이 메타버스 내 제공되는 복수의 콘텐츠를 이용하도록 관리하고, 복수의 사용자 단말 중 제1그룹의 사용자 단말이 상기 메타버스 상 복수의 계약 영역 각각에 메타버스 공간을 구축 및 운영하도록 관리 하며, 복수의 계약 영역 중 제1계약 영역에 구축된 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진 행되는 경우, 실공간 구현에 관한 정보를 메타버스 상에 표시하고, 제1메타버스 공간에 대응하는 실공간의 지분 에 대해 생성된 블록체인 기반의 NFT를 제1계약 영역에 대해 운영 권한을 가지는 제1사용자 단말과 적어도 하나 의 사용자 단말 간 거래하도록 관리한다. 본 발명의 일 실시예에 따르면, 복수의 계약 영역 중 제1계약 영역에 구축된 제1 메타버스 공간에 대해 현실세 계의 실공간으로 구현이 진행되는 경우, 실공간 구현에 관한 정보를 메타버스 상에 표시하는 것으로 기재하였으 나 실공간 구현에 관한 정보 제공 방식이 이에 한정되는 것은 아니며, 웹사이트나 공시 게시판 등의 별도의 온 라인, 오프라인 상에 게시되는 형태로 제공될 수도 있다. 한편, 서버 프로세서는 상기 동작들을 수행하기 위한 데이터 분석, 처리, 및 결과 정보 생성 중 적어도 일 부를 규칙 기반 또는 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network)과 같은 모델 을 포함할 수 있다. 도 3은 본 발명의 일 실시예에 따른 플랫폼 서버의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 복수의 사용자 단말 중 제1그룹의 사용자 단말이 메 타버스 상 각 계약 영역에 대해 메타버스 공간을 구축 및 운영하도록 관리한다(S10). 본 발명의 일 실시예에 따르면, 메타버스는 복수의 영역으로 이루어진다. 이때 메타버스는 현실세계의 지리적 정보에 대응하도록 생성된 바, 각 영역은 GIS 상 필지에 대응할 수 있다. 복수의 영역은 다시 관리 영역과 계약 영역으로 나뉠 수 있는데, 관리 영역은 관리자가 일반 사용자 외에 별도로 관리하기 위한 영역으로써, 관리자 단말에 의해 제어되는 영역이다. 계약 영역은 운영 권한을 부여받은 제1그룹의 사용자들이 개별적으로 메 타버스 공간을 구축 및 운영할 수 있는 영역으로, 제1그룹의 사용자 단말에 의해 제어되는 영역이다. 운영 권한은 다양한 방식으로 부여될 수 있으며, 예를 들어, 제1그룹의 사용자는 현실세계에서의 토지 거래와 같이 관리자와의 계약 체결을 통해 얻을 수 있다. 계약은 제1그룹의 사용자 단말과 플랫폼 서버 또는 제1 그룹의 사용자 단말과 관리자 단말 간의 전자 계약으로 체결이 가능하지만, 계약 체결의 방식이나 체결 형 태는 어느 하나에 한정되지 않는다. 서버 프로세서는 계약 영역, 계약 당사자(사용자), 비용 등의 정보를 포함하는 계약 체결에 대한 정보에 따라 제1그룹의 사용자 단말 중 대응하는 사용자 단말에 운영 권한을 부여하는 동작을 수행할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스 공간은 메타버스에 구축되는 디지털 구조물과 디지털 인프라이고, 건 축물, 실내 공간, 실외 공간 및 인프라 중 적어도 하나를 포함한다. 건축물은 계약 영역에 구축되는 건물 그 자 체를 의미하고, 실내 공간은 건축물 내부의 인테리어, 방, 엘리베이터, 계단, 가구, 장식품 등을 총칭한다. 실 외 공간은 건축물에 부속된 공간으로 나무, 잔디밭, 정원 등 조경 시설, 조각상, 조명장치 등을 총칭하고, 인프 라는 계약 영역 내 포함되는 차도, 인도, 자전거 도로, 고가, 교량, 가로등, 신호등 등을 총칭한다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 제1그룹의 사용자 단말이 메타버스 상에서 메타버스 공간 을 구축할 수 있도록 사용자 인터페이스(User Interface)를 제공한다. 사용자 인터페이스는 그래픽 사용자 인터 페이스(Graphic User Interface), 웹기반 인터페이스(Web-based User Interface) 등을 포함한다. 제1그룹의 사용자 단말은 메타버스 상에서 서버 프로세서가 제공하는 사용자 인터페이스를 이용하여 메타 버스 공간을 구축할 수 있다. 즉, 건축물을 세우고, 실내 공간, 실외 공간, 인프라 등을 꾸밀 수 있다. 다만, 이에 한정되지 않고, 제1그룹의 사용자 단말은 사용자 인터페이스를 통해 기 구축된 메타버스 공간을 메타버스 상으로 로딩시킬 수 있다. 본 발명의 일 실시예에 따르면, 제1그룹의 사용자 단말은 구축된 메타버스 공간을 운영할 수 있다. 메타버스 공 간을 운영하는 것이란, 메타버스 공간 내에서 제공되는 콘텐츠를 제작하고, 제작된 콘텐츠를 통한 수익을 창출 하는 것 등을 의미한다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 복수의 계약 영역 중 제1계약 영역에 구축된 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 실공간 구현에 관한 정보를 메타버스 상에 표시한다 (S20). 제1그룹의 사용자 단말은 각 메타버스 공간을 운영하면서 사용자들의 반응을 확인하고, 메타버스 공간에 대한 수익성, 사업성을 검토할 수 있다. 그 중 사용자의 수요가 높거나 수익성이 높은 사업에 대해서는 현실세계로 사업 확장을 고려해볼 수 있다. 본 발명의 일 실시예에 따르면, 실공간 구현에 관한 정보는 메타버스 공간의 위치, 메타버스 공간이 구현되는 실공간 위치, 메타버스 공간에서의 수익, 실공간 구현 시 예상되는 수익, 실공간 구현 비용, 투자 규모, 투자 방식 등을 포함할 수 있다. 서버 프로세서는 제1계약 영역에 대해 운영 권한을 가지는 제1사용자 단말로부터 실공간 구현에 관한 정보 를 수신할 수 있다. 실공간 구현에 관한 정보를 메타버스 상에 표시하는 방법은 다양하게 존재할 수 있으며, 예를 들어, 서버 프로 세서는 메타버스 내 공지사항을 표시하는 영역에 제1계약 영역을 비롯한 실공간으로 구현예정인 메타버스 공간들의 실공간 구현에 관한 정보를 표시할 수 있으며, 각 메타버스 공간을 방문하는 사용자들이 확인할 수 있 도록 각 메타버스 공간에 접속 시 팝업창 등을 이용하여 실공간 구현에 관한 정보를 표시할 수 있다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 제1메타버스 공간에 대응하는 실공간의 지분에 대해 생성 된 블록체인 기반의 NFT를 제1계약 영역에 대해 운영 권한을 가지는 제1사용자 단말과 적어도 하나의 사용자 단 말 간 거래하도록 관리한다(S30). 제1사용자는 메타버스 상 제1계약 영역의 소유자이며, 나아가 제1계약 영역의 지리적 위치에 대응하는 현실세계 의 지리적 위치 상 소유자일 수 있다. 편의상, 계약 영역에 대응하는 현실세계의 영역을 구현 영역이라 한다. 이때, 제1사용자는 현실세계의 제1구현 영역에 구축될 실공간의 지분을 NFT화 할 수 있다. 실공간의 지분을 NFT 화하는 것은, 실공간 구현을 위한 투자금에 대한 대가로 향후 실공간으로부터 창출되는 수익에 대한 분배를 약 속하기 위해 지분 별로 NFT를 생성하는 것을 의미한다. 본 발명에서는, NFT의 무결성 및 거래 안전성을 위해 블 록체인 기반으로 NFT를 생성하는 것으로 본다. 따라서, 제1사용자 단말은 제1구현 영역에 대해 지분 별로 생성된 NFT(이하, 제1NFT라 한다.)를 실공간 구현을 위한 투자금 조성을 목적으로 적어도 하나의 사용자 단말과 거래할 수 있다. 이때, 적어도 하나의 사용자 단말 은 제1메타버스 공간에 제공되는 컨텐츠를 이용하는 사용자 단말 및 실공간 구현에 대한 참여자의 단말을 포함 한다. 본 발명의 일 실시예에 따르면, 참여자는 실제 현금을 투자하는 개인, 기업뿐 아니라, 건설, 시공, 인테리어 같 이 급부를 제공하는 개인, 기업일 수 있으며, 이외에도 엔터테인먼트 기업, 게임 기업 등이 될 수 있으며, 그 업종이나 투자 형태는 어느 하나에 한정되지 않는다. 서버 프로세서는 제1사용자 단말과 적어도 하나의 사용자 단말 간 제1NFT 를 거래할 수 있는 사용자 인터 페이스(이하, 제1사용자 인터페이스라 한다.)를 제공할 수 있다. 즉, 서버 프로세서는 메타버스 상에서 제 1사용자 단말과 적어도 하나의 사용자 단말이 실공간의 지분에 대해 생성된 제1NFT를 거래할 수 있도록 제1사용 자 인터페이스를 제공한다. NFT를 거래할 수 있는 사용자 인터페이스는 다양한 방식으로 존재할 수 있으며, 예를 들어, 지분을 구매하고자 하는 적어도 하나의 사용자 단말이 구매하고자 하는 지분의 양을 설정하고, 지분 양에 대응하는 거래 대금을 결 제할 수 있도록 제공될 수 있다. 혹은 시공 기업, 인테리어 기업과 같이 급부를 제공하는 경우, 사용자 인터페이스는 참여자와 구현 영역의 소유 자 간의 계약서 형식으로 제공될 수 있다. 다만, 사용자 인터페이스의 형태는 다양하게 존재할 수 있으며, 사용 자 인터페이스를 통한 거래 이외에도 NFT를 거래하는 방법은 다양하게 구현될 수 있다. 본 발명의 일 실시예에 따르면, 제1사용자 단말과 적어도 하나의 사용자 단말은 실공간 뿐 아니라, 실공간을 구 현하게 된 메타버스 공간의 지분에 대해서도 거래할 수 있다. 이는, 실공간으로 구현하게 된 계기가 메타버스 공간에서의 수익성을 토대로 이루어지게 되는 경우가 많은 바, 메타버스 공간 자체에 대한 투자도 고려될 수 있 다. 따라서, 서버 프로세서는 제1메타버스 공간의 지분에 대해 생성된 블록체인 기반의 NFT(이하, 제2NFT라 한 다.)를 제1사용자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리할 수 있다. 제2NFT를 거래하는 방법은 앞서 제1NFT에 관해 서술한 바와 동일하게 적용될 수 있다. 본 발명의 일 실시예에 따르면, 메타버스를 통해 메타버스 공간의 실공간 구현이 진행됨을 공지함으로써, 실공 간 구현에 필요한 참여자들의 투자와 참여를 적극적으로 유치할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스 상에서 수익성 및 사업 확장성을 검증받은 메타버스 공간을 실공간으 로 구현하는 바, 가시적으로 투자 대상을 보여줄 수 있고 해당 메타버스 공간에 대한 실공간 구현의 성공 가능 성을 효과적으로 가늠할 수 있으므로 투자와 참여자 유치에 설득력이 있고, 효율적이다. 본 발명의 일 실시예에 따르면, 메타버스 상에서 NFT를 이용한 거래를 통해 실공간에 대한 투자를 할 수 있는 바, NFT의 무결성과 안전성에 기반한 투자와 참여의 안전을 담보할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스를 통해 실물 경제에서의 효과적인 투자, 창업이 구현 가능하다. 도 4는 본 발명의 다른 실시예에 따른 플랫폼 서버의 동작 흐름도를 도시한 도면이다. 후술할 본 발명의 다른 실시예를 앞서 설명한 일 실시예와 비교하면, 본 발명의 일 실시예는 메타버스 상 제1계 약 영역에 구축된 제1메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우에 있어 플랫폼 서버 가 제1메타버스 공간에 대응하는 실공간의 지분에 대해 생성된 NFT를 제1계약 영역에 대해 운영 권한을 가 지는 제1사용자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리하는 반면, 본 발명의 다른 실시예는 메 타버스 상 관리 영역에 구축된 메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우에 있어 플랫 폼 서버가 메타버스 공간에 대응하는 실공간의 지분에 대해 생성된 NFT를 관리자 단말과 적어도 하나 의 사용자 단말 간 거래하도록 관리하는 부분이 상이하고, 다른 부분은 대동소이하다. 이하, 도 4에 도시된 본 발명의 다른 실시예를 설명함에 있어서, 도 3에 도시된 본 발명의 일 실시예와 대동소 이한 부분 및 본 앞서 이미 설명한 부분에 대한 기재는 생략하고, 그 차이점을 중심으로 설명한다. 본 발명의 다른 실시예에 따르면, 서버 프로세서는 관리자 단말이 메타버스 상 관리 영역에 대해 메 타버스 공간을 구축 및 운영하도록 관리한다(S410). 관리자 단말은 메타버스 상에서 서버 프로세서가 제공하는 사용자 인터페이스를 이용하여 건축물을 세우고, 실내 공간, 실외 공간, 인프라 등을 구축하는 등 메타버스 공간을 구축하고, 메타버스 공간을 운영할 수 있다. 본 발명의 다른 실시예에 따르면, 서버 프로세서는 관리 영역에 구축된 메타버스 공간에 대해 현실세계의 실공간으로 구현이 진행되는 경우, 실공간 구현에 관한 정보를 메타버스 상에 표시한다(S420). 서버 프로세서는 관리자 단말로부터 실공간 구현에 관한 정보를 수신할 수 있다. 본 발명의 다른 실시예에 따르면, 서버 프로세서는 메타버스 공간에 대응하는 실공간의 지분에 대해 생성 된 블록체인 기반의 NFT를 관리자 단말과 적어도 하나의 사용자 단말 간 거래하도록 관리한다(S430). 관리자 단말은 관리 영역에 대응하는 현실세계의 영역인 구현 영역에 대해 지분 별로 생성된 NFT를 실공간 구현을 위한 투자금 조성을 목적으로 적어도 하나의 사용자 단말과 거래할 수 있다. 이때, 적어도 하나의 사용 자 단말은 메타버스 공간에 제공되는 컨텐츠를 이용하는 사용자 단말 및 실공간 구현에 대한 참여자의 단말을 포함한다. 도 5는 본 발명의 일 실시예에 따른 메타버스 공간 공모에 관한 플랫폼 서버의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 복수의 사용자 단말이 공모 대상 영역에 구축가능한 메타버스 공간을 공모할 수 있는 사용자 인터페이스(이하, 제2사용자 인터페이스라 한다.)를 제공할 수 있다 (S510). 공모 대상 영역은 관리 영역이나 복수의 계약 영역 중 어느 하나의 영역일 수 있으며, 관리자 단말에 의해 설정될 수 있다. 관리 영역은 관리자가 메타버스가 구현하는 지역의 자치단체나 기업과 진행하는 사업에 기초하 여 지정하는 영역, 예를 들어, 정부나 지방자치단체(이하, 행정부라 한다.)에서 보유하고 있는 영역, 행정부나 기업과 진행하는 호텔, 전시, 공연 등과 같은 사업에 필요한 영역 등을 포함한다. 본 발명의 일 실시예에 따르면, 제2사용자 인터페이스는 복수의 사용자 단말이 메타버스 상에서 메타버스 공간을 구축할 수 있도록 제공되는 사용자 인터페이스일 수 있다. 다만, 이에 한정되지 않고 제2사용자 인터페 이스는 다른 프로그램을 이용하여 기 구축된 메타버스 공간을 업로드할 수 있는 형태로 제공될 수 있다. 또한, 메타버스 공간에 대한 공모는 구축되는 공간 자체의 공모도 존재할 수 있으나, 구축할 공간에 대한 아이 디어, 계획 등을 포함하는 문서, 영상 등의 형태도 가능하다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 제2사용자 인터페이스를 통해 소정 기간 동안 공모된 복 수의 메타버스 공간에 대해 평가할 수 있는 제3사용자 인터페이스를 제공할 수 있다(S520). 제3사용자 인터페이스는 다양한 방식으로 제공될 수 있으며, 예를 들어, 평가 항목별 점수를 매길 수 있도록 구 현될 수 있다. 이때, 관리자 단말은 메타버스 공간에 대해 평가할 수 있는 적어도 하나의 사용자 단말을 지정할 수 있다. 이때, 서버 프로세서는 지정된 적어도 하나의 사용자 단말만이 제3사용자 인터페이스를 제어할 수 있도록 설정할 수 있다. 본 발명의 일 실시예에 따르면, 서버 프로세서는 평가 결과에 기초하여 선정된 메타버스 공간을 구축한 사 용자 단말에 리워드를 제공할 수 있다(S530). 본 발명의 일 실시예에 따른 리워드는 다양하게 제공될 수 있으며, 예를 들어, 상금 형태로 제공되거나, 공모 대상 영역에 공모한 메타버스 공간을 구현할 수 있는 권리를 부여하는 형식으로 제공될 수 있다. 상금 형태로 제공되는 경우, 현실세계에서 사용가능한 현금뿐 아니라, 메타버스 상에서 이용 가능한 캐시나 포인트, 쿠폰, 프로모션 코드, 향후 구현될 실공간에 대한 지분 등 다양하게 제공될 수 있다. 공간을 구현할 수 있는 권리의 경우, 공모 대상 영역에 대한 소유권이나 사용권을 부여하거나, 나아가 향후 실 공간 구현 시 공모 대상 영역에 대응되는 구현 영역에 대한 소유권이나 사용권을 부여할 수 있다. 이때, 소유권 이나 사용권을 무상으로 부여할 수도 있으나, 경우에 따라 공모 대상 영역 혹은 구현 영역을 합리적인 비용으로 구매 또는 사용하는 권리를 부여할 수 있다. 이후, 공모에서 선정된 사용자 단말은 메타버스 공간을 관리, 운영할 운영 권한을 가지며, 도 3과 관련하여 서 술한 제1그룹의 사용자 단말과 같이 공모 대상 영역 및/또는 구현 영역에 대한 지분을 NFT화하여 적어도 하나의 사용자 단말 간 거래할 수 있다. 투자 유치 및 지분 거래에 관한 내용은 도 3과 관련하여 서술한 내용을 참조할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스 공간이나 실공간에 대한 참신한 아이디어를 공모하여 다채로운 메타버 스 공간, 실공간 및 콘텐츠를 제공할 수 있다. 본 발명의 일 실시예에 따르면, 메타버스 공간 다양화 및 그에 따른 투자, 창업, 참여자, 아이디어 유치를 지원 하는 메타버스 플랫폼을 제공하여 창업과 투자 구조의 선순환을 유도할 수 있고, 메타버스 상의 가상 경제와 실 물 경제 간의 연동 효용성을 높일 수 있다."}
{"patent_id": "10-2022-0144247", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 메타버스 플랫폼 제공 시스템을 도시한 개략도이다. 도 2는 본 발명의 일 실시예에 따른 플랫폼 서버의 구성을 도시한 블럭도이다. 도 3은 본 발명의 일 실시예에 따른 플랫폼 서버의 동작 흐름도를 도시한 도면이다. 도 4는 본 발명의 다른 실시예에 따른 플랫폼 서버의 동작 흐름도를 도시한 도면이다. 도 5는 본 발명의 일 실시예에 따른 메타버스 공간 공모에 관한 플랫폼 서버의 동작 흐름도를 도시한 도면이다."}
