{"patent_id": "10-2022-0053530", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0139269", "출원번호": "10-2022-0053530", "발명의 명칭": "하우징을 구동하기 위한 구동부를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "조성건"}}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 하우징; 상기 제1 하우징에 대하여 이동 가능하도록(movably) 상기 제1 하우징에 결합되는 제2 하우징; 상기 제2 하우징의 일 면에 배치되고, 상기 제2 하우징의 이동에 따라 확장되거나 축소되는 디스플레이; 상기 제1 하우징 내에 배치되고, 상기 제2 하우징에 구동력을 제공하는 모터; 상기 모터에 대하여 회전 가능하도록 상기 모터에 결합되는 구동 기어(driving gear); 상기 구동 기어의 회전에 따라 상기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록, 상기구동 기어에 맞물리는(engaged with) 적어도 하나의 전달 기어(transmitting gear); 상기 제2 하우징에 배치되고, 상기 적어도 하나의 전달 기어에 맞물리는 복수의 이들(teeth)을 포함하고, 상기제2 하우징의 상기 일 면이 향하는 방향에 수직인 방향을 향하는 기어 면을 포함하고, 상기 적어도 하나의 전달기어의 회전에 따라 이동하는 랙 기어; 상기 제2 하우징의 이동 방향에 수직인 방향으로 연장되고, 상기 디스플레이의 적어도 일부에 배치되는 지지 부재; 및 상기 제1 하우징 내에 배치되고, 상기 지지 부재의 이동을 안내하는 가이드 레일; 을 포함하고, 상기 가이드 레일은, 상기 랙 기어의 적어도 일부를 수용하는 작동 공간을 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 랙 기어는, 상기 제1 하우징을 위에서 바라볼 때, 상기 구동 기어로부터 이격되는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 적어도 하나의 전달 기어는, 상기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록 상기 구동 기어에 맞물리는 제1 기어;및 상기 제1 기어와 동축을 형성하여 상기 제1 기어의 회전에 따라 회전 가능한 제2 기어; 를 포함하고, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0139269-3-제3항에 있어서, 상기 제2 기어는, 상기 제1 기어 상에 배치되고, 상기 기어 면의 상기 복수의 이들 중 적어도 일부에 맞물리는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 적어도 하나의 전달 기어는, 상기 제2 기어의 회전 축에 평행인 회전 축을 기준으로 회전 가능하고, 상기 제2 기어 및 상기 기어 면의 상기복수의 이들 중 적어도 일부에 맞물리는 제3 기어; 를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 모터의 구동 축은, 상기 기어 면에 수직인, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 모터의 구동 축은, 상기 기어 면에 평행인, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 랙 기어인 제1 랙 기어와 구별되고, 상기 제1 랙 기어가 배치되는 상기 제2 하우징의 제1 가장 자리를 마주하는 상기 제2 하우징의 제2 가장 자리에 배치되는 제2 랙 기어; 를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 제2 랙 기어와 맞물리고, 상기 전달 기어인 제1 전달 기어와 구별되고, 상기 제1 전달 기어의 회전 축에평행인 회전 축을 기준으로 회전 가능한 제2 전달 기어; 상기 제2 전달 기어에 맞물리고, 상기 구동 기어인 제1 구동 기어와 구별되고, 상기 제2 전달 기어의 회전 축에수직인 회전 축을 기준으로 회전 가능한 제2 구동 기어; 및 공개특허 10-2023-0139269-4-상기 제2 구동 기어와 결합되고, 상기 모터인 제1 모터와 구별되고, 상기 제2 구동 기어를 회전시키는 제2모터; 를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면에 배치되고, 상기 랙 기어의 상기 측면을 따라 연장되는 기어레일; 을 포함하고, 상기 제1 하우징에 배치되고, 적어도 일부가 상기 기어 레일에 수용되는 복수의 베어링들을 포함하고, 상기 랙기어 및 상기 제2 하우징의 이동을 안내하는 제1 가이드 부재; 를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 복수의 베어링들은, 상기 제1 가이드 부재 내에서 서로 접하고, 상기 랙 기어의 이동에 따라 상기 제1 가이드 부재 내에서 이동 가능한, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 랙 기어는, 상기 제2 하우징의 이동에 따라 상기 작동 공간 내로 인입 가능하거나, 상기 작동 공간으로부터 인출 가능한, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 상기 제1 하우징은, 상기 모터, 및 상기 적어도 하나의 전달 기어가 결합되고, 상기 제1 하우징 내에 배치되는 프레임 커버; 를 더포함하고, 상기 가이드 레일은, 상기 제2 하우징의 이동 방향에 수직인 방향을 향하는 상기 프레임 커버의 가장 자리(periphery)에 배치되는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2023-0139269-5-제1 항에 있어서, 상기 가이드 레일은, 상기 작동 공간의 적어도 일부를 둘러싸고, 상기 지지 부재의 이동을 안내하는 가이드 홈; 을 더 포함하고, 상기 복수의 바들 각각은, 상기 제2 하우징의 이동에 따라 상기 가이드 홈 내에서 이동 가능한 가이드 돌기; 를 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1 항에 있어서, 상기 작동 공간 내에 배치되고, 상기 작동 공간 내에서 이동 가능한 제2 가이드 부재; 를 더 포함하고, 상기 제2 가이드 부재는, 상기 랙 기어의 이동을 안내하고, 서로 이격되는 복수의 베어링들을 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 가이드 레일은, 상기 복수의 베어링들 각각의 일부를 수용하도록 상기 작동 공간을 따라 연장되는 제1 가이드 슬릿; 을 더 포함하고, 상기 복수의 베어링들 각각의 다른 일부는, 상기 복수의 베어링들 각각의 상기 일부를 마주하고, 상기 기어 면에 수직인 상기 랙 기어의 측면에 접하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면에 배치되는 제3 가이드 부재; 를 더 포함하고, 상기 가이드 레일은, 상기 작동 공간과 연결되고, 상기 제3 가이드 부재의 이동을 안내하는 제2 가이드 슬릿; 을 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1 하우징; 상기 제1 하우징에 대하여 이동 가능하도록(movably) 상기 제1 하우징에 결합되는 제2 하우징; 상기 제2 하우징의 일 면에 배치되는 제1 영역 및 상기 제2 하우징의 이동에 따라 변형 가능한(deformable) 제2공개특허 10-2023-0139269-6-영역을 포함하는 디스플레이; 상기 제2 하우징의 이동 방향에 수직인 방향으로 연장되는 적어도 하나의 바(bar)를 포함하고, 상기 디스플레이의 상기 제2 영역에 배치되는 지지 부재; 상기 제1 하우징 내에 배치되고, 상기 지지 부재의 운동을 가이드 하는 가이드 레일; 상기 제1 하우징 내에 배치되고, 상기 제2 하우징에 구동력을 제공하는 모터; 상기 모터에 대하여 회전 가능하도록 상기 모터에 결합되는 구동 기어(gear portion); 상기 구동 기어의 회전에 따라 상기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록, 상기구동 기어에 맞물리는(engaged with) 적어도 하나의 전달 기어; 및 상기 제2 하우징에 배치되고, 상기 적어도 하나의 전달 기어에 맞물리는 복수의 이들(teeth)을 포함하고, 상기제2 하우징의 상기 일 면이 향하는 방향에 수직인 방향을 향하는 기어 면을 포함하고, 상기 적어도 하나의 전달기어의 회전에 따라 이동하는 랙 기어; 를 포함하고, 상기 가이드 레일은, 상기 랙 기어의 이동을 안내하도록 상기 랙 기어의 적어도 일부를 수용하는 작동 공간을 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면에 배치되고, 상기 랙 기어의 상기 측면을 따라 연장되는 기어레일; 을 포함하고, 상기 제1 하우징에 배치되고, 적어도 일부가 상기 기어 레일에 수용되는 복수의 베어링들을 포함하고, 상기 랙기어 및 상기 제2 하우징의 이동을 안내하는 제1 가이드 부재; 를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서, 상기 랙 기어는, 상기 제2 하우징의 이동에 따라 상기 작동 공간 내로 인입 가능하거나, 상기 작동 공간으로부터 인출 가능한, 전자 장치."}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 이동 가능하도록(movably) 상기 제1 하우 징에 결합되는 제2 하우징, 상기 제2 하우징의 일 면에 배치되고, 상기 제2 하우징의 이동에 따라 확장되거나 축 소되는 디스플레이, 상기 제1 하우징 내에 배치되고, 상기 제2 하우징에 구동력을 제공하는 모터, 상기 모터에 (뒷면에 계속)"}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은, 하우징을 구동하기 위한 구동부를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자가 전자 장치를 용이하게 휴대하기 위하여, 전자 장치는 소형화될 수 있다. 전자 장치가 소형화됨에도 불 구하고, 사용자가 전자 장치를 통해 다양한 콘텐츠(contents)를 제공받을 수 있도록, 콘텐츠를 표시하기 위한디스플레이의 크기가 변경될 수 있는 전자 장치에 대한 필요성이 증가하고 있다. 예를 들어, 전자 장치는, 전자 장치의 외부에 노출되는 디스플레이의 크기가 변경 가능한 플렉서블 디스플레이를 포함할 수 있다."}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치의 플렉서블 디스플레이는, 예를 들어, 하우징의 이동에 따라 디스플레이의 면적이 확장되거나 축소될 수 있다. 하우징을 이동시키기 위하여, 전자 장치는, 하우징에 구동력(driving force)을 제공하기 위한 모터 및 모터의 구동력을 하우징에 전달하는 기어를 포함하는 구동부를 포함할 수 있다. 하우징을 원활하게 구동하기 위 해 구동부의 크기가 커질 경우, 전자 장치의 두께가 불필요하게 증가할 수 있다. 전자 장치는, 전자 장치 내의 구동부의 배치 구조를 최적화하는 것이 필요할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 이동 가능하도록(movably) 상기 제1 하 우징에 결합되는 제2 하우징, 상기 제2 하우징의 일 면에 배치되고, 상기 제2 하우징의 이동에 따라 확장되거나 축소되는 디스플레이를 포함할 수 있다. 일 실시예에 따른 전자 장치는, 제1 하우징 내에 배치되고, 상기 제2 하우징에 구동력을 제공하는 모터, 상기 모터에 대하여 회전 가능하도록 상기 모터에 결합되는 구동 기어 (driving gear)를 포함할 수 있다. 일 실시예에 따른 전자 장치는, 상기 구동 기어의 회전에 따라 상기 구동 기 어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록, 상기 구동 기어에 맞물리는(engaged with) 적어도 하나의 전달 기어(transmitting gear), 및 상기 제2 하우징에 배치되고, 상기 적어도 하나의 전달 기어의 회전 에 따라 이동하는 랙 기어를 포함할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 적어도 하나의 전달 기어에 맞물리는 복수의 이들(teeth)을 포함하고, 상기 제2 하우징의 상기 일 면이 향하는 방향에 수직인 방향 을 향하는 기어 면을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 제1 하우징, 상기 제1 하우징에 대하여 이동 가능하도록(movably) 상기 제1 하우징에 결합되는 제2 하우징, 및 상기 제2 하우징의 일 면에 배치되는 제1 영역 및 상기 제2 하우징의 이동에 따라 변형 가능한(deformable) 제2 영역을 포함하는 디스플레이를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 상기 제2 하우징의 이동 방향에 수직인 방향으로 연장되는 적어도 하나의 바(bar)를 포함하고, 상기 디 스플레이의 상기 제2 영역에 배치되는 지지 부재를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 상기 제 1 하우징 내에 배치되고, 상기 지지 부재의 운동을 가이드 하는 가이드 레일을 포함할 수 있다. 일 실시예에 따 르면, 전자 장치는, 상기 제1 하우징 내에 배치되고, 상기 제2 하우징에 구동력을 제공하는 모터, 상기 모터에 대하여 회전 가능하도록 상기 모터에 결합되는 구동 기어(gear portion), 및 상기 구동 기어의 회전에 따라 상 기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록, 상기 구동 기어에 맞물리는(engaged with) 적어도 하나의 전달 기어를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 상기 제2 하우징에 배치 되고, 상기 적어도 하나의 전달 기어에 맞물리는 복수의 이들(teeth)을 포함하고, 상기 제2 하우징의 상기 일 면이 향하는 방향에 수직인 방향을 향하는 기어 면을 포함하고, 상기 적어도 하나의 전달 기어의 회전에 따라 이동하는 랙 기어를 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 랙 기어의 이동을 안내하 도록 상기 랙 기어의 적어도 일부를 수용하는 작동 공간을 포함할 수 있다."}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예에 따른 전자 장치는, 복수의 이들(teeth)이 형성된 기어 면이 디스플레이의 적어도 일부에 수직으로 배치되는 랙 기어에 의해, 전자 장치 내에 다른 부품들을 위한 공간을 제공하면서도, 하우징을 이동시키기 위한 구동력을 확보할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0053530", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신 할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모 듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhancedmobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a는, 일 실시예에 따른 전자 장치의 제1 상태의 전면도(front view)이고, 도 2b는, 일 실시예에 따른 전자 장치의 제1 상태의 후면도(rear view)이고, 도 2c는, 일 실시예에 따른 전자 장치의 제2 상태의 전면도(front view)이고, 도 2d는, 일 실시예에 따른 전자 장치의 제2 상태의 후면도(rear view)이다. 도 2a, 도 2b, 도 2c, 및 도 2d를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치)는, 제1 하우징, 제2 하우징, 디스플레이(예: 도 1의 디스플레이 모듈), 및 카메라(예: 도 1의 카메라 모듈)를 포함할 수 있다. 일 실시예에 따르면, 제2 하우징은, 제1 하우징에 대하 여 슬라이딩 가능(slidable)할 수 있다. 예를 들어, 제2 하우징은, 제1 하우징에 대하여 제1 방향(예: +y 방향)을 따라 지정된 거리 이내의 범위에서 이동할 수 있다. 제2 하우징이 제1 방향을 따라 이동하면, 제1 방향을 향하는 제2 하우징의 측면(220a)과 제1 하우징 사이의 거리는 증가할 수 있다. 다른 예를 들어, 제2 하우징(22 0)은, 제1 하우징에 대하여 제1 방향에 반대인 제2 방향(예: -y 방향)을 따라 지정된 거리 이내의 범위에 서 이동할 수 있다. 제2 하우징이 제2 방향을 따라 이동하면, 제1 방향을 향하는 제2 하우징의 측면 (220a)과 제1 하우징 사이의 거리는 감소할 수 있다. 일 실시예에 따르면, 제2 하우징은, 제1 하우징 에 대하여 상대적으로 슬라이딩함으로써, 제1 하우징에 대하여 직선 왕복 운동할 수 있다. 예를 들어, 제2 하우징의 적어도 일부는, 제1 하우징 내로 인입 가능하거나, 제1 하우징으로부터 인 출 가능할 수 있다. 일 실시예에 따르면, 전자 장치는, 제2 하우징이 제1 하우징에 대하여 슬라이딩 가능하도록 설 계됨에 따라 \"슬라이더블(slidable) 전자 장치\"로 명명될 수 있다. 일 실시예에 따르면, 전자 장치는, 디 스플레이의 적어도 일부분이 제2 하우징의 슬라이드 이동에 기반하여 제2 하우징(또는 제1 하우 징)의 내부에서 감기도록 설계됨에 따라 \"롤러블 전자 장치\"로 명명될 수 있다. 일 실시예에 따르면, 전자 장치의 제1 상태는, 제2 하우징이 제2 방향으로 이동한 상태(예: 수축 상 태, 또는 슬라이드 인 상태(slide-in state))로 정의될 수 있다. 예를 들어, 전자 장치의 제1 상태에서, 제2 하우징은, 제1 방향으로 이동 가능하지만, 제2 방향으로 이동 가능하지 않을 수 있다. 전자 장치(20 0)의 제1 상태에서, 제2 하우징의 측면(220a)과 제1 하우징 사이의 거리는, 제2 하우징의 이동 에 따라 증가할 수 있으나, 감소되지 않을 수 있다. 다른 예를 들어, 전자 장치의 제1 상태에서, 제2 하우 징의 일부는 제1 하우징 내로부터 인출 가능할 수 있으나, 인입 가능하지 않을 수 있다. 일 실시예에 따르면, 전자 장치의 제1 상태는, 디스플레이의 제2 영역(230b)이 전자 장치의 외부에서 시각적 으로 노출되지 않는 상태로 정의될 수 있다. 예를 들어, 전자 장치의 제1 상태에서, 디스플레이의 제 2 영역(230b)은, 제1 하우징 및/또는 제2 하우징이 형성하는 전자 장치의 내부 공간(미도시)의 내부에 위치하여, 전자 장치의 외부에서 시인되지 않을(not be visible) 수 있다. 일 실시예에 따르면, 전자 장치의 제2 상태는, 제2 하우징이 제1 방향으로 이동한 상태(예: 확장 상 태, 또는 슬라이드 아웃 상태(slide-out state))로 정의될 수 있다. 예를 들어, 전자 장치의 제2 상태에서, 제2 하우징은, 제2 방향으로 이동 가능하지만, 제1 방향으로 이동 가능하지 않을 수 있다. 전자 장치의 제2 상태에서, 제2 하우징의 측면(220a)과 제1 하우징 사이의 거리는, 제2 하우징 의 이동에 따라 감소할 수 있으나, 증가하지 않을 수 있다. 다른 예를 들어, 전자 장치의 제2 상태에서, 제2 하우징의 일부는 제1 하우징 내로 인입 가능할 수 있으나, 제1 하우징으로부터 인출 가능하 지 않을 수 있다. 일 실시예에 따르면, 전자 장치의 제2 상태는, 디스플레이의 제2 영역(230b)이 전 자 장치의 외부에서 시각적으로 노출된 상태로 정의될 수 있다. 예를 들어, 전자 장치의 제2 상태에 서, 디스플레이의 제2 영역(230b)은, 전자 장치의 내부 공간으로부터 인출되어, 전자 장치의 외 부에서 시인될(visible) 수 있다. 일 실시예에 따르면, 제2 하우징이 제1 하우징으로부터 제1 방향으로 이동할 경우, 제2 하우징 의 적어도 일부 및/또는 디스플레이의 제2 영역(230b)은, 제2 하우징의 이동 거리에 대응되는 인출 길이(d1)만큼 제1 하우징으로부터 인출될 수 있다. 일 실시 예에 따르면, 제2 하우징은 지정된 거리 (d2) 이내로 왕복이동 할 수 있다. 일 실시예에 따르면, 인출 길이(d1)는 대략 0 내지 지정된 거리(d2)의 크기 를 가질 수 있다. 일 실시예에 따르면, 전자 장치의 상태는, 사용자에 의한 수동 조작(manual operation)으로, 또는 제1 하 우징 또는 제2 하우징의 내부에 배치된 구동 모듈(미도시)에 의한 자동 조작(automatic operation)으 로, 제2 상태 및/또는 제1 상태의 사이에서 전환 가능할(convertible) 수 있다. 일 실시 예에 따르면, 상기 구 동 모듈은, 사용자 입력에 기반하여 동작이 트리거될 수 있다. 일 실시 예에 따르면, 구동 모듈의 동작을 트리 거하기 위한 사용자 입력은, 디스플레이를 통한 터치 입력, 포스 터치 입력, 및/또는 제스처 입력을 포함 할 수 있다. 다른 실시예에 따르면, 구동 모듈의 동작을 트리거하기 위한 사용자 입력은, 음성 입력(보이스 입력), 또는 제1 하우징 또는 제2 하우징의 외부로 노출된 물리 버튼의 입력을 포함할 수 있다. 일 실 시 예에 따르면, 구동 모듈은 사용자의 외력에 의한 수동 조작을 감지하면 동작이 트리거 되는, 반자동 방식으 로 구동될 수 있다. 일 실시예에 따르면, 전자 장치의 제1 상태는 제1 형상으로 참조될 수 있고, 전자 장치의 제2 상태는 제2 형상으로 참조될 수 있다. 예를 들면, 제1 형상은 기본(normal) 상태, 축소 상태, 또는 닫힌 상태를 포함할 수 있고, 제2 형상은, 열린 상태를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 제1 상태와 제2 상 태의 사이의 상태인 제3 상태(예: 중간 상태)를 형성할 수 있다. 예를 들면, 제3 상태는 제3 형상으로 참조될 수 있으며, 제3 형상은, 프리 스탑(free stop) 상태를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이는, 사용자에게 시각적 정보를 표시할 수 있도록, 전자 장치의 전면 방향(예: -z 방향)을 통해 외부에서 시인 가능할(visible 또는 viewable) 수 있다. 예를 들어, 디스플레이(23 0)는, 플렉서블 디스플레이를 포함할 수 있다. 일 실시예에 따르면, 디스플레이는, 제2 하우징에 배 치되고, 제2 하우징의 이동에 따라 전자 장치의 내부 공간(미도시)으로부터 인출되거나, 전자 장치 의 내부 공간으로 인입될 수 있다. 전자 장치의 내부 공간은, 제1 하우징과 제2 하우징의 결합에 의해 형성되는 제1 하우징 및 제2 하우징의 내의 공간을 의미할 수 있다. 예를 들어, 전자 장 치의 제1 상태에서, 디스플레이의 적어도 일부는 전자 장치의 내부 공간으로 말려 들어가, 인입 될 수 있다. 디스플레이의 적어도 일부가 전자 장치의 내부 공간에 인입된 상태에서, 제2 하우징 이 제1 방향으로 이동하면, 디스플레이의 적어도 일부는, 전자 장치의 내부 공간으로부터 인출 될 수 있다. 다른 예를 들어, 제2 하우징이 제2 방향으로 이동하면, 디스플레이의 적어도 일부는, 전 자 장치의 내부로 말려 들어감으로써, 전자 장치의 내부 공간으로 인입될 수 있다. 디스플레이 의 적어도 일부가 인출되거나 인입됨에 따라, 전자 장치의 외부에서 시인 가능한 디스플레이의 면적 은, 확장 또는 축소될 수 있다. 일 실시예에 따르면, 디스플레이는, 제1 영역(230a) 및 제2 영역(230b)을 포함할 수 있다. 일 실시 예에 따르면, 디스플레이의 제1 영역(230a)은, 전자 장치가 제2 상태인지 또는 제1 상태인지 여부에 무관하게, 고정적으로 전자 장치의 외부에서 시인 가능한 디스플레이의 영역을 의미할 수 있 다. 예를 들어, 제1 영역(230a)은, 전자 장치의 내부 공간 내로 말려들어 가지 않은 디스플레이의 일 부 영역을 의미할 수 있다. 일 실시예에 따르면, 제1 영역(230a)은, 제2 하우징이 이동하면, 제2 하우징 과 함께 이동할 수 있다. 예를 들어, 제1 영역(230a)은, 제2 하우징이 제1 방향 또는 제2 방향을 따 라 이동하면, 제2 하우징과 함께 전자 장치의 전면 상에서, 제1 방향 또는 제2 방향을 따라 이동할 수 있다. 일 실시 예에 따르면, 디스플레이의 제2 영역(230b)은, 제1 영역(230a)에 연결되고, 제2 하우징의 이 동에 따라, 전자 장치의 내부 공간으로 인입되거나, 또는 전자 장치의 내부 공간으로부터 외부로 인 출될 수 있다. 예를 들어, 디스플레이의 제2 영역(230b)은, 전자 장치의 제1 상태에서, 말려진 상태 로 전자 장치의 내부 공간 내에 인입된 상태일 수 있다. 디스플레이의 제2 영역(230b)은, 전자 장치 의 제1 상태에서, 전자 장치의 내부 공간으로 인입되어 외부에서 시인 가능하지 않을 수 있다. 다른 예를 들어, 디스플레이의 제2 영역(230b)은, 전자 장치의 제2 상태에서, 전자 장치의 내부 공간 으로부터 인출된 상태일 수 있다. 디스플레이의 제2 영역(230b)은, 제2 상태에서, 전자 장치의 외부 에서 시인 가능할 수 있다. 일 실시 예에 따르면, 전자 장치의 제1 상태에서, 전자 장치의 외부에서 시인 가능한 디스플레이 의 면적은, 디스플레이의 제1 영역(230a)만을 포함할 수 있다. 전자 장치의 제2 상태에서 전자 장치의 외부에서 시인 가능한 디스플레이의 면적은, 디스플레이의 제1 영역(230a) 및 제2 영역 (230b)의 적어도 일부를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치의 제1 하우징은, 제1 하우징의 내부 공간을 둘러싸는 북 커버 및 북 커버의 후면을 감싸는 후면 플레이트를 포함할 수 있다. 전자 장치의 제2 하우징 은, 전자 장치의 내부 공간을 감싸는 프런트 커버를 포함할 수 있다. 일 실시 예에 따르면, 프런트 커버는, 제1 하우징의 내부로 인입되지 않는 프런트 커버의 제1 커버 영역(221a) 및, 제1 하우징의 내부로 인입 또는 인출되는 제2 커버 영역(221b)을 포함할 수 있다. 프 런트 커버의 제1 커버 영역(221a)은, 전자 장치가 제2 상태 및 제1 상태인지 여부에 무관하게, 항상 시인 가능할 수 있다. 일 실시예에 따르면, 프런트 커버의 제1 커버 영역(221a)의 적어도 일부는, 제2 하우징의 측면(220a)을 형성할 수 있다. 일 실시 예에 따르면, 제2 하우징의 제2 커버 영역(221b)은, 제1 상태에서 시인 가능하지 않고, 제2 상태에서 시인 가능할 수 있다. 카메라는, 전자 장치의 외부로부터 빛을 수신하는 것에 기반하여, 피사체(a subject)에 대한 이미지 를 획득할 수 있다. 일 실시 예에 따르면, 카메라는, 하나 또는 복수의 렌즈들, 이미지 센서 및/또는 이미 지 시그널 프로세서를 포함할 수 있다. 일 실시예에 따르면, 카메라는, 디스플레이의 제1 영역(230 a)이 배치되는 전자 장치의 전면에 반대인 전자 장치의 후면을 향하도록, 제2 하우징에 배치될 수 있다. 예를 들어, 카메라는, 제2 하우징의 프런트 커버에 배치되고, 전자 장치가 제1 상태일 때, 북 커버에 형성된 개구(211a)를 통해, 전자 장치의 외부에서 시인 가능할 수 있다. 다른 예를 들어, 카메라는, 제2 하우징의 프런트 커버에 배치되고, 전자 장치가 제1 상태일 때, 북 커버 및/또는 후면 플레이트에 의해 가려져, 전자 장치의 외부에서 시인 가능하지 않을 수 있다. 일 실시예에 따르면, 카메라는, 복수개의 카메라들을 포함할 수 있다. 예를 들면, 카메라는, 광각 카 메라, 초 광각 카메라, 망원 카메라, 근접 카메라 및/또는 뎁스 카메라를 포함할 수 있다. 다만, 카메라가 반드시 복수의 카메라들을 포함하는 것으로 한정되는 것은 아니며, 하나의 카메라를 포함할 수 있다. 일 실시예에 따르면, 카메라는, 디스플레이의 제1 영역(230a)이 배치되는 전자 장치의 전면을 지향하는 카메라(미도시)를 더 포함할 수 있다. 카메라가 전자 장치의 전면을 지향할 경우, 카메라 는, 디스플레이의 아래(예: 디스플레이로부터 +z 방향)에 배치되는 언더 디스플레이 카메라 (UDC, under display camera)일 수 있으나, 이에 제한되지 않는다. 일 실시 예에 따르면, 전자 장치는 디스플레이 아래에 배치되는 센서 모듈(미도시) 및/또는 카메라 모듈(미도시)을 포함할 수 있다. 센서 모듈은 디스플레이를 관통하여 수신되는 정보(예: 빛)를 기반으로 외부 환경을 검출할 수 있다. 일 실시 예에 따르면, 상기 센서 모듈은, 리시버, 근접 센서, 초음파 센서, 제스 처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생 체 센서, 온도 센서, 습도 센서, 모터 엔코더(motor encoder) 또는 인디케이터 중 적어도 하나를 포함할 수 있 다. 일 실시 예에 따르면, 전자 장치의 적어도 일부 센서 모듈은, 디스플레이의 일부 영역을 통해 외 부에서 시각적으로 노출될 수 있다. 일 실시 예에 따르면, 전자 장치는 센서 모듈을 이용하여 인출 길이 (예: 길이 A)를 감지할 수 있다. 일 실시 예에 따르면, 전자 장치는 센서가 감지한 인출된 정도에 관한 대 한 인출 정보를 생성할 수 있다. 예를 들면, 전자 장치는 인출 정보를 이용하여 제2 하우징의 인출된 정도를 감지 및/또는 확인할 수 있다. 일 실시 예에 따르면, 인출 정보는 제2 하우징의 인출 길이에 관한 정보를 포함할 수 있다. 일 실시 예에 따르면, 제1 하우징과 제2 하우징의 결합 형태는, 도 2a, 도 2b, 도 2c 및 도 2d에 도 시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수도 있다. 도 3a는, 일 실시예에 따른 전자 장치의 분해 사시도(exploded perspective view)이고, 도 3b는, 일 실시예에 따른 전자 장치를 도 2a의 A-A'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 3a 및 도 3b를 참조하면, 일 실시예에 따른, 전자 장치는, 제1 하우징, 제2 하우징, 디스플 레이, 카메라, 배터리(예: 도 1의 배터리) 및 구동부를 포함할 수 있다. 일 실시예에 따르면, 제1 하우징 및 제2 하우징은, 서로 결합되어 전자 장치의 내부 공간을 형성할 수 있다. 예를 들어, 전자 장치의 제1 상태에서, 디스플레이의 제2 영역(230b)은, 내부 공간에 수 용될 수 있다. 일 실시예에 따르면, 제1 하우징은, 북 커버, 후면 플레이트, 및 프레임 커버를 포함할 수 있다. 일 실시예에 따르면, 제1 하우징에 포함된 북 커버, 후면 플레이트, 및 프레임 커버(21 3)는, 서로 결합되어, 제2 하우징이 제1 하우징에 대하여 이동할 때, 제2 하우징과 함께 이동하 지 않을 수 있다. 일 실시예에 따르면, 북 커버는, 전자 장치의 외면의 적어도 일부를 형성할 수 있다. 예를 들어, 북 커버는, 전자 장치의 측면의 적어도 일부 및 전자 장치의 후면의 적어도 일부를 형성할 수 있다. 일 실시예에 따르면, 북 커버는, 후면 플레이트가 안착되는 면을 제공할 수 있다. 후면 플레이트는, 북 커버의 일 면(211b)에 안착될 수 있다. 일 실시예에 따르면, 프레임 커버는, 전자 장치의 내부 구성 요소들을 지지할 수 있다. 예를 들어, 프레임 커버는, 배터리 및 구동부의 적어도 일부를 수용할 수 있다. 배터리 및 구동부 는, 프레임 커버에 포함된 리세스 또는 홀 중 적어도 하나에 수용될 수 있다. 일 실시예에 따르면, 프레임 커버는, 북 커버에 의해 둘러싸일(surrounded) 수 있다. 예를 들어, 전자 장치의 제1 상 태에서, 배터리가 배치되는 프레임 커버의 일 면(213a)은, 북 커버 및/또는 디스플레이의 제2 영역(230b)을 마주할 수 있다. 다른 예를 들어, 전자 장치의 제1 상태에서, 프레임 커버의 일 면 (213a)을 마주하는 프레임 커버의 타 면(213b)은, 디스플레이의 제1 영역(230a), 또는 프런트 커버 를 마주할 수 있다. 예를 들어, 프레임 커버는, 소재로 알루미늄을 포함할 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 제2 하우징은, 프런트 커버, 리어 커버, 및 슬라이드 커버를 포함할 수 있다. 일 실시예에 따르면, 프런트 커버, 리어 커버, 및 슬라이드 커버는, 서로 결합되어, 제2 하우징이 제1 하우징에 대하여 상대적으로 이동하면, 제2 하우징과 함께 이동할 수 있다. 프런트 커버는, 전자 장치의 내부 구성 요소들을 지지할 수 있다. 예를 들어, 카메라는, 내부 공간을 향하는 프런트 커버의 일 면(221c)에 배치될 수 있다. 프런트 커버의 일 면(221c)을 마 주하는 프런트 커버의 타 면(221d)은, 전자 장치가 제1 상태일 때, 디스플레이의 제1 영역 (230a)과 마주할 수 있다. 일 실시예에 따르면, 리어 커버는, 프런트 커버에 결합되어, 프런트 커버 에 배치된 전자 장치의 구성 요소들을 보호할 수 있다. 예를 들어, 리어 커버는, 프런트 커버 의 일 면(221c)의 일부를 덮을 수 있다. 일 실시예에 따르면, 슬라이드 커버는, 리어 커버 상에 배치되어, 후면 플레이트, 및 북 커버와 함께 전자 장치의 외면을 형성할 수 있다. 슬라이드 커 버는, 리어 커버의 일 면에 결합되어, 리어 커버 및/또는 프런트 커버를 보호할 수 있다. 일 실시예에 따르면, 전자 장치가 제1 상태일 때, 디스플레이는, 적어도 일부가 내부 공간으로 말려 들어감으로써(rolled into), 굽어질 수 있다. 일 실시예에 따르면, 디스플레이는, 프레임 커버 의 적어도 일부, 및 프런트 커버의 적어도 일부를 감쌀(covering) 수 있다. 예를 들어, 전자 장치가 제1 상태일 때, 디스플레이는, 프런트 커버의 타 면(221d)을 덮고, 프런트 커버와 북 커버(21 1)의 사이를 통과하여, 내부 공간을 향해 연장될 수 있다. 디스플레이는, 전자 장치가 제1 상태 일 때, 프런트 커버와 북 커버의 사이를 통과하여, 내부 공간에 배치된 프레임 커버를 둘 러쌀 수 있다. 디스플레이는, 내부 공간 내에서, 프레임 커버의 일 면(213a)을 덮을 수 있다. 일 실시예에 따르면, 제2 하우징이 제1 방향으로 이동하면, 디스플레이의 제2 영역(230b)은, 내부 공 간으로부터 인출될 수 있다. 예를 들어, 제2 하우징이 제1 방향으로 이동함에 따라, 디스플레이(23 0)는, 프런트 커버와 북 커버 사이를 통과하여 내부 공간으로부터 인출될 수 있다. 일 실시예에 따르면, 디스플레이의 제1 영역(230a)은, 프런트 커버의 타 면(221d)에 접할 수 있다. 예를 들어, 제1 영역(230a)은, 프런트 커버의 타 면(221d)에 접하면서, 프런트 커버의 타 면(221d)에 평행하게 연장될 수 있다. 프런트 커버의 타 면(221d)에 평행하게 연장됨으로써, 제1 영역(230a)은, 실질 적으로 평면의 형태를 가질 수 있다. 일 실시예에 따르면, 디스플레이의 제1 영역(230a)은, 제2 하우징 의 이동에 따라 변형되지 않을 수 있다. 예를 들어, 제1 영역(230a)은, 평면의 형태를 유지하면서 제2 하 우징이 이동함에 따라 이동할 수 있다. 일 실시예에 따르면, 디스플레이의 제2 영역(230b)은, 제2 하우징의 이동에 따라 변형 가능할 수 있 다. 예를 들어, 제2 영역(230b)은 전자 장치가 제1 상태일 때, 전자 장치의 내부 공간 내에서 곡률을 가지며 굽어질 수 있다. 제2 하우징이 제1 방향(예: +y 방향)으로 이동하면, 제2 영역(230b)의 적 어도 일부는, 전자 장치의 내부 공간으로부터 인출되어, 프런트 커버의 타 면(221d)에 평행할 수 있다. 제2 영역(230b)의 적어도 일부가 프런트 커버의 타 면(221d)에 평행할 경우, 제2 영역(230b)의 적어도 일부는, 곡률을 가지지 않으며 평면의 형태를 가질 수 있다. 다른 예를 들어, 제2 하우징이 제2 방 향(예: -y 방향)으로 이동하면, 제2 영역(230b)의 적어도 일부는, 전자 장치의 내부 공간 내로 인입 될 수 있다. 제2 영역(230b)의 적어도 일부는, 전자 장치의 내부 공간 내로 인입되면서, 곡률을 가지 도록 굽어질 수 있다. 일 실시예에 따르면, 전자 장치는, 디스플레이를 지지하는 지지 부재 및 가이드 레일을 포 함할 수 있다. 지지 부재는, 서로 결합된 복수의 바들을 포함하고, 디스플레이의 제2 영역(230b)의형상에 대응되는 형상으로 제작될 수 있다. 예를 들어, 지지 부재는, 제1 방향(예: +y 방향)에 수직인 제3 방향(예: +x 방향)으로 연장되는 복수의 바들을 포함할 수 있다. 지지 부재는, 디스플레이의 제2 영 역(230b)에 배치될 수 있다. 일 실시예에 따르면, 지지 부재는, 디스플레이가 이동함에 따라, 디스플 레이와 함께 이동할 수 있다. 일 실시예에 따르면, 디스플레이의 제2 영역(230b)이 내부 공간 내에 감겨진 상태인 제1 상태에서, 지지 부재는, 디스플레이의 제2 영역(230b)과 함께 내부 공간 내에서 감겨져 있을 수 있다. 일 실시예에 따르면, 가이드 레일은, 지지 부재의 운동을 가이드할 수 있다. 예를 들어, 디스플레이 가 이동함에 따라, 지지 부재는, 프레임 커버에 결합된 가이드 레일을 따라 이동할 수 있 다. 일 실시예에 따르면, 가이드 레일은, 제1 방향에 수직인 제3 방향(예: +x 방향)을 따라 서로 이격되는 프레임 커버의 양 가장 자리들에 서로 이격되어 배치되는 복수의 가이드 레일들을 포함할 수 있다. 일 실시예에 따르면, 구동부는, 제2 하우징이 제1 하우징에 대하여 상대적으로 이동할 수 있도 록, 제2 하우징에 구동력을 제공할 수 있다. 일 실시예에 따르면, 구동부는, 모터, 피니언 기어 , 랙 기어, 및 브라켓을 포함할 수 있다. 모터는, 배터리로부터 전력을 공급받아, 제 2 하우징에 구동력을 제공할 수 있다. 일 실시예에 따르면, 모터는, 제1 하우징에 배치되어, 제 2 하우징이 제1 하우징에 대하여 이동할 때, 제2 하우징과 함께 이동하지 않을 수 있다. 예를 들어, 모터는, 프레임 커버에 형성된 리세스에 배치될 수 있다. 일 실시예에 따르면, 피니언 기어 는, 모터에 결합되고, 모터로부터 제공된 구동력에 의해 회전할 수 있다. 예를 들어, 피니언 기 어는, 모터의 구동 축인 샤프트(261a)에 회전 가능하게 결합되어, 모터에 대하여 회전 가능할 수 있다. 일 실시예에 따르면, 랙 기어는, 피니언 기어와 맞물리고, 피니언 기어의 회전에 따라 이동할 수 있다. 예를 들어, 랙 기어는, 피니언 기어의 회전에 따라, 제1 방향 또는 제2 방향으로, 직선 왕복 운동할 수 있다. 일 실시예에 따르면, 랙 기어는, 제2 하우징에 배치될 수 있다. 예를 들 어, 랙 기어는, 제2 하우징에 포함된 프런트 커버에 결합될 수 있다. 일 실시예에 따르면, 랙 기어는, 프레임 커버에 형성된 작동 공간(213p)의 내부에서 이동 가능할 수 있다. 일 실시예에 따르 면, 브라켓은, 모터의 구동력이 랙 기어에 원활하게 전달되도록, 피니언 기어의 위치를 유 지할 수 있다. 일 실시예에 따르면, 피니언 기어가 제1 회전 방향(예: 도 4b에서 시계 방향)을 따라 회전하면, 랙 기어 는, 제1 방향(예: +y 방향)으로 이동할 수 있다. 랙 기어가 제1 방향을 따라 이동하면, 랙 기어(26 3)와 결합된 제2 하우징은, 제1 방향을 따라 이동할 수 있다. 제2 하우징이 제1 방향을 따라 이동함 에 따라, 전자 장치의 외부에서 시인 가능한 디스플레이의 면적은 확장될 수 있다. 피니언 기어(26 2)가 제2 회전 방향(예: 도 4b에서 반시계 방향)을 따라 회전하면, 랙 기어는, 제2 방향(예: -y 방향)으로 이동할 수 있다. 랙 기어가 제2 방향을 따라 이동하면, 랙 기어와 결합된 제2 하우징은, 제2 방 향을 따라 이동할 수 있다. 제2 하우징이 제2 방향을 따라 이동함에 따라, 전자 장치의 외부에서 시 인 가능한 디스플레이의 면적은 축소될 수 있다. 상술한 설명에서, 모터 및 피니언 기어가 제1 하우징에 배치되고, 랙 기어가 제2 하우징 이 배치되는 것으로 설명하였으나, 실시예들은 이에 제한되지 않을 수 있다. 실시예들에 따라, 모터 및 피니언 기어는 제2 하우징에 배치되고, 랙 기어는 제1 하우징에 배치될 수 있다. 예를 들어, 피니언 기어가 랙 기어 상에서 랙 기어에 맞물릴 경우, 구동부에 인접한 전자 장치의 두께(예: z축 방향으로의 길이)에 랙 기어의 두께 및 피니언 기어의 지름이 포함될 수 있다. 제2 하우징에 전달되는 구동력의 크기를 증가시키기 위해, 피니언 기어의 크기가 증가할 경우, 구동부에 인접한 전자 장치의 두께가 증가할 수 있다. 피니언 기어의 크기가 증가하면, 피니언 기어와 랙 기어의 맞물림(engagement)을 유지하기 위한 브라켓의 두께(t1) 역시 증가하여, 구동 부에 인접한 전자 장치의 두께가 증가할 수 있다. 상술한 바와 같이, 구동력 증가를 위해 피니언 기 어의 크기가 증가할 경우, 전자 장치의 두께가 증가할 수 있기 때문에, 전자 장치는, 구동부 의 배치를 최적화하기 위한 구조가 필요할 수 있다. 이하에서는, 제2 하우징을 구동하기 위한 구동부 의 배치를 최적화하기 위한 구조를 포함하는 전자 장치에 관하여 상세하게 설명하도록 한다. 도 4a는, 일 실시예에 따른 전자 장치의 제1 상태의 사시도(perspective view)이고, 도 4b는, 일 실시예에 따른 전자 장치의 제2 상태의 사시도(perspective view)이고, 도 4c는, 일 실시예에 따른 전자 장치를 도 4b의 B-B'를 따라 절단한 예를 도시한 단면도이다. 도 4a, 도 4b, 및 도 4c를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치 및/또는 도 3a 및 도 3b의 전자 장치)는, 제1 하우징, 제2 하우징, 디스플레이, 지지 부재, 가 이드 레일, 구동부, 및 적어도 하나의 제1 가이드 부재을 포함할 수 있다. 도 4a 및 도 4b의 제 1 하우징, 제2 하우징, 디스플레이, 지지 부재, 및 가이드 레일은, 각각 도 3a 및 도 3b의 제1 하우징, 제2 하우징, 디스플레이, 지지 부재, 및 가이드 레일과 실질적 으로 동일할 수 있으므로, 중복되는 설명은 생략하도록 한다. 일 실시예에 따르면, 제2 하우징은, 제1 하우징에 대하여 이동 가능하도록 제1 하우징에 결합될 수 있다. 예를 들어, 제2 하우징은, 제1 하우징에 대하여 제1 방향(예: +y 방향), 또는 제1 방향에 반대인 제2 방향(예: -y 방향)으로 이동 가능할 수 있다. 제1 방향은, 제2 하우징의 이동에 따라, 전자 장 치의 외부에서 시인 가능한(viewable) 디스플레이의 면적이 확장되는 방향일 수 있다. 제2 방향은, 제2 하우징의 이동에 따라 전자 장치의 외부에서 시인 가능한 디스플레이의 면적이 축소되는 방 향일 수 있다. 일 실시예에 따르면, 전자 장치의 상태는, 제1 방향 및 제2 방향 중, 제1 방향으로 제2 하우징이 이 동 가능한 제1 상태, 및 제1 방향 및 제2 방향 중, 제2 방향으로 제2 하우징이 이동 가능한 제2 상태를 포 함할 수 있다. 예를 들어, 전자 장치가 제1 상태일 때, 제2 하우징은 제1 방향으로만(only) 이동 가 능하고, 제2 방향으로 이동 가능하지 않을 수 있다. 다른 예를 들어, 전자 장치가 제2 상태일 때, 제2 하 우징은, 제2 방향으로만(only) 이동 가능하고, 제1 방향으로 이동 가능하지 않을 수 있다. 일 실시예에 따르면, 제1 하우징은, 북 커버 및 프레임 커버를 포함할 수 있다. 북 커버는, 전자 장치의 외면의 적어도 일부를 형성할 수 있다. 도 4c의 북 커버는, 도 3a 및/또는 도 3b의 북 커버와 실질적으로 동일할 수 있으므로, 중복되는 설명은 생략하도록 한다. 프레임 커버는, 구동부의 적어도 일부를 지지할 수 있다. 일 실시예에 따르면, 프레임 커버는, 제1 방향을 향하는 제1 가장 자리(413c), 제1 가장 자리(413c)를 마주하며 제1 방향에 반대인 제2 방향을 향하 는 제2 가장 자리(413d)를 포함할 수 있다. 일 실시예에 따르면, 프레임 커버는, 제1 가장 자리(413c)에 실질적으로 수직인 제3 가장 자리(413e), 및 제3 가장 자리(413e)에 실질적으로 수직이며, 제3 가장 자리(413 e)를 마주하는 제4 가장 자리(413f)를 포함할 수 있다. 가장 자리(periphery)는, 일 구성 요소에 포함된 영역들 중, 상기 일 구성 요소와 다른 구성 요소들을 구별하는 경계(boundary)를 포함하는 일 영역을 의미할 수 있으며, 해당 표현은 이하에서도 별도의 언급이 없는 한 동일하게 사용될 수 있다. 예를 들어, 제1 가장 자리 (413c)는, 제1 방향을 향하는 프레임 커버의 경계를 포함할 수 있다. 제2 가장 자리(413d)는, 제1 가장 자 리(413c)로부터 제2 방향으로 이격되며, 제2 방향을 향하는 프레임 커버의 경계를 포함할 수 있다. 제3 가 장 자리(413e)는, 제2 가장 자리(413d)의 일 단으로부터 제1 방향을 따라 제1 가장 자리(413c)의 일 단까지 연 장될 수 있다. 제4 가장 자리(413f)는, 제2 가장 자리(413d)의 타 단으로부터 제1 방향을 따라 제1 가장 자리 (413c)의 타 단까지 연장될 수 있다. 제4 가장 자리(413f)는, 제3 가장 자리(413e)를 마주하며 제3 가장 자리 (413e)로부터 이격될 수 있다. 일 실시예에 따르면, 제2 하우징은, 구동부로부터 구동력을 제공받아, 프레임 커버에 대하여 이 동 가능할 수 있다. 일 실시예에 따르면, 전자 장치의 다양한 기능을 구현하기 위한 하나 이상의 전자 부 품들(예: 도 1의 프로세서)은, 제2 하우징의 일 면(420a)에 배치될 수 있다. 디스플레이의 적어 도 일부는, 제2 하우징의 일 면(420a)을 마주하는 제2 하우징의 타 면(420b)에 배치될 수 있다. 일 실시예에 따르면, 디스플레이는, 제2 하우징의 이동에 따라 확장 또는 축소될 수 있다. 예를 들어, 제2 하우징이 제1 방향으로 이동하면, 전자 장치의 외부에서 시인 가능한 디스플레이의 면적은 확장될 수 있다. 다른 예를 들어, 제2 하우징이 제1 방향에 반대인 제2 방향으로 이동하면, 전자 장치의 외부에서 시인 가능한 디스플레이의 면적은 축소될 수 있다. 일 실시예에 따르면, 지지 부재(예: 도 3a 및 도 3b의 지지 부재)는 디스플레이의 일부에 배치 될 수 있다. 예를 들어, 지지 부재는, 제1 방향에 수직인 제3 방향(예: +x 방향)으로 연장되는 복수의 바 들(bars)을 포함할 수 있다. 지지 부재의 복수의 바들은, 서로 연결될 수 있다. 복수의 바들이 서로 연결 됨에 따라, 지지 부재의 형상은, 디스플레이의 일부의 형상에 대응할 수 있다. 일 실시예에 따르면, 제2 하우징이 제1 하우징에 대하여 이동하면, 지지 부재는, 제2 하우징의 이동에 따라 프레임 커버 상에서 이동 가능할 수 있다. 일 실시예에 따르면, 가이드 레일(예: 도 3a 및 도 3b의 가이드 레일)은, 지지 부재의 운동을 안내할 수 있다. 일 실시예에 따르면, 가이드 레일은, 제1 방향에 수직인 제3 방향(예: +x 방향)을 따라 서로 이격되는 프레임 커버의 양 가장 자리들에 배치될 수 있다. 예를 들어, 가이드 레일은, 제3 가 장 자리(413e) 및 제4 가장 자리(413f)에 각각 배치되는 복수의 가이드 레일들을 포함할 수 있다. 일 실시 예에 따르면, 가이드 레일은, 구동부의 적어도 일부를 수용하기 위한 작동 공간(432a)을 포함할 수 있다. 작동 공간(432a)은, 제1 가장 자리(413c)를 향하는 가이드 레일의 일 단으로부터, 제2 가장 자리 (413d)를 향하여 연장될 수 있다. 예를 들어, 작동 공간(432a)은, 제2 가장 자리(413d)를 향하는 가이드 레일 의 일부로부터 제1 방향을 따라 제1 가장 자리(413c)를 향하는 가이드 레일의 다른 일부까지 연장될 수 있다. 가이드 레일의 일 단은, 제1 방향을 향하는 면이 개방되어, 작동 공간(432a)과 연결될 수 있다. 가이드 레일의 개방된 면을 통해, 랙 기어의 적어도 일부는, 작동 공간(432a) 내에서 이동할 수 있다. 일 실시예에 따르면, 구동부는, 모터, 구동 기어, 적어도 하나의 전달 기어, 및 랙 기어 를 포함할 수 있다. 모터는, 제1 하우징 내에 배치되고, 제2 하우징에 구동력을 제공할 수 있다. 예를 들어, 모터는, 배터리(예: 도 1의 배터리)로부터 전력을 수신하는 것에 기반하여, 제2 하 우징에 구동력을 제공할 수 있다. 일 실시예에 따르면, 모터는, 프레임 커버의 제1 가장 자리 (413c)에 배치될 수 있다. 예를 들어, 모터는, 프레임 커버의 제1 가장 자리(413c)에 형성된 리세스 또는 홀에 배치될 수 있다. 일 실시예에 따르면, 모터의 구동 축(a0)은, 제1 방향에 수직인 방향(예: +x 방향 및/또는 -x 방향)에 평행일 수 있다. 예를 들어, 모터의 구동 축(a0)은, 디스플레이가 배치되는 제2 하우징의 타 면(420b)이 향하는 방향(예: -z 방향)에 수직일 수 있다. 구동 기어는, 모터의 구동력을 전달 기어에 전달할 수 있다. 일 실시예에 따르면, 구동 기어 는, 모터에 회전 가능하도록 모터에 결합될 수 있다. 예를 들어, 구동 기어의 제1 회전 축 (a1)은, 모터의 구동 축(a0)의 방향과 실질적으로 동일할 수 있다. 구동 기어의 제1 회전 축(a1)은, 모터의 구동 축(a0)과 동축(coaxial)을 형성할 수 있다. 예를 들어, 구동 기어는, 웜 기어(worm gear), 베벨 기어(bevel gear), 및 스크류 기어(screw gear) 중 적어도 하나를 포함할 수 있으나, 이에 제한되 지 않는다. 웜 기어는 예를 들어, 원통형 웜 기어(cylindrical worm gear) 또는 장구형 웜 기어(globoid worm gear)일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 구동부는, 구동 기어를 지지하기 위한 브라켓을 포함할 수 있다. 브라켓 은, 구동 기어와 전달 기어의 맞물림을 유지할 수 있다. 일 실시예에 따르면, 브라켓은, 프레임 커버의 제1 가장 자리(413c)에 결합될 수 있다. 예를 들어, 브라켓은, 결합 부재(예: 스크류 (screw))를 통해 프레임 커버에 결합될 수 있으나, 이에 제한되지 않는다. 적어도 하나의 전달 기어는, 구동 기어로부터 전달받은 구동력을 랙 기어에 전달할 수 있다. 일 실시예에 따르면, 적어도 하나의 전달 기어는, 구동 기어의 회전에 따라 회전 가능하도록 구동 기어 에 맞물릴(engaged with) 수 있다. 예를 들어, 전달 기어는, 구동 기어가 회전함에 따라, 구동 기어의 제1 회전 축(a1)에 수직인(예: +z 방향 및/또는 -z 방향) 제2 회전 축(a2)을 기준으로 회전할 수 있다. 제2 회전 축(a2)은, 디스플레이가 배치되는 제2 하우징의 타 면(420b)이 향하는 방향에 평행일 수 있다. 일 실시예에 따르면, 전달 기어는, 프레임 커버에 대하여 회전 가능하도록, 프레임 커버 의 제1 가장 자리(413c)에 배치될 수 있다. 전달 기어가 프레임 커버에 결합됨에 따라, 전달 기 어는, 제2 하우징이 제1 하우징에 대하여 이동할 때, 제2 하우징과 함께 이동하지 않고 프 레임 커버에 대하여 회전 가능할 수 있다. 예를 들어, 전달 기어는, 브라켓을 프레임 커버(41 3)에 결합하는 결합 부재에 의해 프레임 커버에 결합될 수 있으나, 이에 제한되지 않는다. 일 실시예에 따 르면, 전달 기어의 개수는, 구동 기어의 개수와 상이할 수 있다. 예를 들어, 전달 기어는, 웜 휠 기어, 베벨 기어, 스크류 기어, 및 피니언 기어 중 적어도 하나를 포함할 수 있으나, 이에 제한되지 않는다. 랙 기어는, 전달 기어로부터 구동력을 전달받아, 제2 하우징을 이동시킬 수 있다. 일 실시예에 따르면, 랙 기어는, 적어도 일부가 전달 기어에 맞물려, 적어도 하나의 전달 기어의 회전에 따 라 이동할 수 있다. 랙 기어는, 제2 하우징에 배치될 수 있다. 랙 기어가 제2 하우징에 배 치됨에 따라, 전달 기어가 회전하면, 랙 기어는, 제1 하우징에 대하여 제1 방향 또는 제1 방향 에 반대인 제2 방향을 따라 제2 하우징과 함께 이동할 수 있다. 일 실시예에 따르면, 랙 기어는, 제2하우징의 일 면(420a)으로부터 제2 방향을 따라 연장된 형상을 가질 수 있다. 일 실시예에 따르면, 랙 기어는, 기어 면(540a)을 포함할 수 있다. 기어 면(540a)은, 적어도 하나의 전달 기어에 맞물리는 복수의 이들을 포함할 수 있다. 일 실시예에 따르면, 기어 면(540a)은, 디스플레이 가 배치되는 제2 하우징의 타 면(420b)이 향하는 방향(예: -z 방향)에 수직인 방향(예: -x 방향)을 향할 수 있다. 예를 들어, 기어 면(540a)이 향하는 방향은, 구동 기어의 제1 회전 축(a1)에 평행이고, 전달 기 어의 제2 회전 축(a2)에 수직일 수 있다. 일 실시예에 따르면, 랙 기어는, 제1 하우징을 위(예: +z 방향)에서 바라볼 때, 구동 기어로부터 이격될 수 있다. 랙 기어는, 제1 하우징을 위에서 바 라볼 때, 구동 기어와 중첩되지 않을 수 있다. 예를 들어, 전달 기어가 생략될 경우, 랙 기어는, 랙 기어의 기어 면(540a)이 제2 하우징의 일 면(420a)이 향하는 방향에 평행하도록 배 치되고, 구동 기어는, 랙 기어 상에 배치되어 랙 기어에 맞물릴 수 있다. 구동 기어가 랙 기어 상에 배치되는 경우, 구동 기어가 랙 기어에 중첩되지 않은 경우보다, 구동부에 인접 한 전자 장치의 두께(예: z축 방향으로의 길이)가 두꺼워질 수 있다. 일 실시예에 따른, 전자 장치는, 기어 면(540a)이 제2 하우징의 타 면(420b)이 향하는 방향에 수직인 방향을 향하도록 배치되 는 랙 기어에 의해, 랙 기어와 구동 기어가 중첩되지 않는 구조를 제공할 수 있다. 전자 장치 는, 랙 기어와 구동 기어가 중첩되지 않음에 따라, 전자 장치의 두께를 감소시킬 수 있는 구조를 제공할 수 있다. 랙 기어와 구동 기어가 서로 중첩되지 않음에 따라, 구동 기어의 위치 를 유지하는 브라켓 및 랙 기어 역시 서로 중첩되지 않기 때문에, 일 실시예에 따른 전자 장치 는, 전자 장치의 두께를 감소시키는 구조를 제공할 수 있다. 일 실시예에 따른 전자 장치는, 구동 기 어에 중첩되지 않는 랙 기어에 의해, 구동 기어의 크기를 확대하기 위한 배치 공간을 확보하여, 제2 하우징을 원활하게 이동시키기 위한 구동력을 확보하는 구조를 제공할 수 있다. 일 실시예에 따르면, 랙 기어는, 서로 다른 제2 하우징의 가장 자리들(420c, 420d)에 배치되는 제1 랙 기어 및 제2 랙 기어를 포함할 수 있다. 제1 랙 기어 및 제2 랙 기어가 배치되는 제2 하우징의 가장 자리들(420c, 420d)은, 제2 하우징의 이동 방향인 제1 방향에 수직인 방향(예: +x 방 향)으로 서로 이격될 수 있다. 예를 들어, 제2 하우징의 제1 가장 자리(420c)는, 전자 장치가 제1 상 태일 때, 프레임 커버의 제3 가장 자리(413e)를 마주할 수 있다. 제2 하우징의 제1 가장 자리(420c) 는, 제1 방향에 수직인 방향(예: +x 방향)을 향하고, 전자 장치가 제1 상태일 때, 구동 기어를 마주 할 수 있다. 제2 하우징의 제2 가장 자리(420d)는, 제1 방향에 수직이며, 제1 가장 자리(420c)가 향하는 방향에 반대인 방향(예: -x 방향)을 향할 수 있다. 일 실시예에 따르면, 제1 랙 기어는 제2 하우징의 제1 가장 자리(420c)에 배치될 수 있다. 제2 랙 기어는, 제2 하우징의 제2 가장 자리(420d)에 배치될 수 있다. 도 4a 및 도 4b에는 전자 장치가 제1 랙 기어 및 제2 랙 기어를 모두 포함하는 것으로 도시되었 으나, 이는 설명의 편의를 위한 것이다. 실시예들에 따라, 제1 랙 기어 및 제2 랙 기어와 관련된 전 자 장치의 구조는 다양하게 변경될 수 있다. 예를 들어, 전자 장치는, 제1 랙 기어 만을 포함할 수 있다. 다른 예를 들어, 전자 장치는, 제1 랙 기어 및 제2 랙 기어를 포함하고, 제1 랙 기어 및 제2 랙 기어는 모두 기어 면(540a)을 포함할 수 있다. 또 다른 예를 들어, 전자 장치는, 제 1 랙 기어 및 제2 랙 기어를 모두 포함하고, 제2 랙 기어는 기어 면(540a)을 포함하지 않을 수 있다. 일 실시예에 따르면, 구동 기어는, 모터로부터 구동력을 제공받아, 제1 회전 축(a1)을 기준으로 회전 할 수 있다. 구동 기어가 회전함에 따라, 구동 기어에 맞물린 전달 기어는, 제1 회전 축(a1)에 수직인 제2 회전 축(a2)을 기준으로 회전할 수 있다. 전달 기어가 회전함에 따라, 전달 기어에 맞물 린 랙 기어는, 제1 방향 또는 제1 방향에 반대인 제2 방향으로, 제2 하우징과 함께 이동할 수 있다. 랙 기어에 의해 제2 하우징이 제1 방향으로 이동하면, 전자 장치의 외부에서 시인 가능한 디스 플레이의 면적이 확대될 수 있다. 랙 기어에 의해 제2 하우징이 제2 방향으로 이동하면, 전자 장치의 외부에서 시인 가능한 디스플레이의 면적이 축소될 수 있다. 일 실시예에 따르면, 가이드 레 일의 작동 공간(432a)은, 랙 기어이 이동하는 공간을 제공할 수 있다. 랙 기어는, 제2 하우징 의 이동에 따라 가이드 레일의 작동 공간(432a) 내로 인입 가능하거나, 작동 공간(432a)으로부터 인 출 가능할 수 있다. 일 실시예에 따르면, 적어도 하나의 제1 가이드 부재는, 제2 하우징 및/또는 랙 기어의 이동을 안내할 수 있다. 제1 가이드 부재는, 제2 하우징 및/또는 랙 기어가 이동함에 따라 발생하는 마찰을 감소시킬 수 있다. 예를 들어, 제1 가이드 부재는, 랙 기어의 이동을 안내하는 복수의 베어링들 을 포함할 수 있다. 일 실시예에 따르면, 제1 가이드 부재는, 전달 기어를 향하는 프레임 커버의 일부에 결합될 수 있다. 예를 들어, 제1 가이드 부재는, 전달 기어를 향하는 프레임 커버의 제3 가장 자리(413e) 의 일부에 배치될 수 있다. 일 실시예에 따르면, 제1 가이드 부재는, 제2 하우징의 이동 방향에 대하 여 수직인 방향(예: +x 방향)으로 이격되는 프레임 커버의 양 가장 자리들(413e, 413f)에 배치될 수 있다. 예를 들어, 제1 가이드 부재들은, 각각 프레임 커버의 제3 가장 자리(413e) 및 제4 가장 자리(413f) 에 배치되고, 서로 마주할 수 있다. 일 실시예에 따르면, 제1 가이드 부재는, 제1 방향을 향하는 가이드 레일의 일부에 접하도록, 프레임 커버에 배치될 수 있다. 일 실시예에 따르면, 랙 기어는, 기어 면(540a)에 수직인 랙 기어의 측면(540b)에 배치되는 기어 레 일을 포함할 수 있다. 기어 레일은, 랙 기어 및 제2 하우징의 이동을 안내할 수 있다. 예 를 들어, 기어 레일은, 랙 기어의 측면(540b)의 일부가 랙 기어의 내측으로 함몰(dented)됨으로 써 형성될 수 있다. 기어 레일은, 랙 기어의 측면(540b)의 적어도 일부를 따라 연장될 수 있다. 일 실시예에 따르면, 기어 레일은, 제1 가이드 부재과 함께 제2 하우징이 제1 하우징에 대하 여 기울어(tilting)지는 것을 방지할 수 있다. 예를 들어, 기어 레일 및 제1 가이드 부재는, 랙 기어 가 제1 방향 또는 제2 방향에 대하여 기울어진 방향으로 이동하는 것을 방지할 수 있다. 기어 레일 및 제1 가이드 부재에 의해, 랙 기어에 연결된 제2 하우징은, 제1 하우징에 대하여 이동할 때, 제1 하우징에 대하여 기울어지지 않을 수 있다. 예를 들어, 모터가 제1 랙 기어만을 마주하 도록 배치되는 경우, 모터로부터 제공된 구동력은, 제2 하우징에 불균일하게(unevenly) 전달될 수 있 다. 구동력이 제2 하우징에 불균일하게 전달됨에 따라, 제2 하우징이 제1 하우징에 대하여 기울 어질 수 있다. 다른 예를 들어, 제2 하우징이 제1 하우징에 대하여 이동하면, 제2 하우징은, 자 중(self-load)에 의해 제1 하우징에 대하여 기울어질 수 있다. 제2 하우징이 제1 하우징에 대하 여 기울어지면, 디스플레이가 파손될 가능성이 증가하고, 모터의 구동력이 낭비될 수 있다. 일 실시 예에 따른, 전자 장치는, 제2 하우징을 이동시키면서 제2 하우징의 이동을 안내하는 랙 기어 에 의해, 제2 하우징이 제1 하우징에 대하여 기울어지는 것을 방지할 수 있다. 일 실시예에 따 른 전자 장치는, 제2 하우징을 가이드하기 위한 별도의 가이드 부품을 포함할 필요가 없기 때문에, 전자 장치 내에 다른 부품들을 위한 공간을 제공할 수 있다. 도 4a 및 도 4b에는 제1 랙 기어만이 기어 레일을 포함하는 것으로 도시되었으나, 이는 설명의 편의 를 위한 것이다. 예를 들어, 제1 랙 기어를 마주하는 제2 랙 기어는, 제1 랙 기어와 실질적으로 동일하게 기어 레일을 포함할 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치는, 기어 면(540a)이 제2 하우징의 일 면이 향하는 방 향에 수직으로 배치되는 랙 기어에 의해, 전자 장치의 두께를 감소시킬 수 있는 구조를 제공할 수 있 다. 일 실시예에 따른 전자 장치는, 디스플레이에 접하는 지지 부재의 운동을 안내하면서 랙 기 어의 이동 공간을 제공하는 가이드 레일에 의해, 전자 장치 내에 다른 부품들을 위한 공간을 제 공할 수 있다. 일 실시예에 따른 전자 장치는, 제2 하우징 및 랙 기어의 운동을 안내할 수 있는 제1 가이드 부재에 의해, 제2 하우징이 제1 하우징에 대하여 기울어지는 것을 방지하면서, 모터 의 구동력을 효율적으로 활용할 수 있는 구조를 제공할 수 있다. 도 5는, 일 실시예에 따른 전자 장치를 도 4b의 C-C'를 따라 절단한 예를 도시한 부분 단면도(partial cross- sectional view)이다. 도 5를 참조하면, 일 실시예에 따르면, 가이드 레일은, 지지 부재의 이동을 안내하기 위한 가이드 홈 (432b)을 더 포함할 수 있다. 예를 들어, 가이드 홈(432b)은, 제2 하우징의 이동 방향인 제1 방향(예: +y 방향)을 따라 가이드 레일 내에서 연장될 수 있다. 일 실시예에 따르면, 가이드 홈(432b)은, 가이드 레일 의 작동 공간(432a)의 적어도 일부를 둘러쌀 수 있다. 제2 하우징(예: 도 4a 및 도 4b의 제2 하우징(42 0))이 이동함에 따라, 지지 부재는, 가이드 홈(432b) 내에서 이동할 수 있다. 예를 들어, 제2 하우징(42 0)이 제1 방향을 따라 이동하면, 지지 부재의 적어도 일부는, 가이드 레일의 일 면(432c)에서 가이드 레일의 일 면(432c)을 마주하는 가이드 레일의 타 면(432d) 상으로, 가이드 홈(432b)을 따라 이동할 수 있다. 다른 예를 들어, 제2 하우징이 제1 방향에 반대인 제2 방향(예: -y 방향)으로 이동하면, 지지 부재의 적어도 일부는, 가이드 레일의 타 면(432d)에서 가이드 레일의 일 면(432c) 상으로, 가이 드 홈(432b)을 따라 이동할 수 있다. 일 실시예에 따르면, 지지 부재의 복수의 바들 각각은, 제2 하우징의 이동에 따라 가이드 홈(432b) 내에서 이동 가능한 가이드 돌기(431a)를 포함할 수 있다. 예를 들어, 가이드 돌기(431a)의 적어도 일부는, 가 이드 홈(431b)에 삽입되어, 제2 하우징의 이동에 따라 가이드 홈(431b) 내에서 이동 가능할 수 있다. 상술한 바와 같이, 일 실시예에 따른, 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 디스플레이(도 4a 및 도 4b의 디스플레이)에 접하는 지지 부재의 운동을 안내하면서, 랙 기어의 이동 공간을 제공 하는 가이드 레일에 의해, 전자 장치 내의 다른 부품들을 위한 공간을 제공할 수 있다. 도 6은, 일 실시예에 따른 전자 장치의 구동부의 일 예를 도시한 도면이다. 도 6을 참조하면, 일 실시예에 따른 구동부의 적어도 하나의 전달 기어는, 구동 기어에 맞물리 는 제1 기어 및 제1 기어 상에 배치되는 제2 기어를 포함할 수 있다. 제1 기어는, 적어도 일부가 구동 기어에 맞물리고, 구동 기어의 회전에 따라 회전할 수 있다. 예를 들어, 제1 기어 는, 구동 기어의 제1 회전 축(a1)에 수직인 제2 회전 축(a2)을 기준으로 회전 가능하도록 구동 기어 에 맞물릴 수 있다. 일 실시예에 따르면, 제2 기어는, 제1 기어와 동축을 형성할 수 있다. 예를 들어, 제2 기어는, 제1 기어의 제2 회전 축(a2)을 공유할 수 있다. 일 실시예에 따르면, 구동부는, 제1 기어 및 제 2 기어를 관통하는 샤프트를 포함할 수 있다. 예를 들어, 샤프트는 제2 회전 축(a2)에 평행인 방향을 따라 연장될 수 있다. 제2 기어는, 샤프트를 통해 제1 기어에 결합됨으로써, 구동 기어 에 의해 제1 기어가 회전하면, 제1 기어와 함께 회전할 수 있다. 일 실시예에 따르면, 제2 기어는, 랙 기어의 기어 면(540a)의 복수의 이들 중 적어도 일부에 맞물려, 랙 기어를 이동시킬 수 있다. 예를 들어, 구동 기어에 의해 제1 기어가 회전하면, 제2 기어 는, 제1 기어에 의해 회전할 수 있다. 제2 기어가 제1 기어에 의해 회전함에 따라, 랙 기 어는, 제1 방향(예: +y 방향) 또는 제2 방향(예: -y 방향)을 따라 이동할 수 있다. 예를 들어, 제2 기어 는, 피니언 기어(pinion gear)일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 구동 기어가 웜 기어일 경우, 제1 기어는 웜 휠 기어일 수 있으나, 이에 제한되 지 않고, 구동 기어 및 전달 기어의 종류는 실시예들에 따라 다양하게 변경될 수 있다. 예를 들어, 구동 기어 및 제1 기어는, 서로 수직으로 맞물리는 베벨 기어일 수 있다. 다른 예를 들어, 구동 기어 및 제1 기어는, 서로 수직으로 맞물리는 스크류 기어일 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 구동 기어에 맞 물리는 제1 기어 및 제2 기어를 통해, 제2 하우징((예: 도 4a 및 도 4b의 제2 하우징)을 이동시 키기 위한 랙 기어에 구동력을 효율적으로 전달하는 구조를 제공할 수 있다. 도 7은, 일 실시예에 따른 전자 장치의 구동부의 다른 예를 도시한 도면이다. 도 7을 참조하면, 일 실시예에 따른 구동부의 적어도 하나의 전달 기어는, 구동 기어에 맞물리 는 제1 기어 및 제1 기어 상에 배치되는 제2 기어, 및 제2 기어 및 랙 기어에 맞물 리는 제3 기어를 포함할 수 있다. 일 실시예에 따르면, 제1 기어는, 적어도 일부가 구동 기어에 맞물리고, 구동 기어의 회전에 따 라 회전할 수 있다. 예를 들어, 제1 기어는, 구동 기어의 제1 회전 축(a1)에 수직인 제2 회전 축(a 2)을 기준으로 회전 가능하도록 구동 기어에 맞물릴 수 있다. 일 실시예에 따르면, 제2 기어는, 제1 기어와 동축을 형성할 수 있다. 예를 들어, 제2 기어는, 제1 기어의 제2 회전 축(a2)을 공유할 수 있다. 일 실시예에 따르면, 구동부는, 제1 기어 및 제 2 기어를 관통하는 샤프트를 포함할 수 있다. 예를 들어, 샤프트는 제2 회전 축(a2)에 평행인 방향을 따라 연장될 수 있다. 제2 기어는, 샤프트를 통해 제1 기어에 결합됨으로써, 구동 기어 에 의해 제1 기어가 회전하면, 제1 기어와 함께 회전할 수 있다. 예를 들어, 제2 기어는,피니언 기어일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 제3 기어는, 제2 기어 및 랙 기어의 기어 면(540a)의 복수의 이들 중 적어 도 일부에 맞물릴 수 있다. 제3 기어는, 제2 기어의 회전에 의해 회전함으로써, 랙 기어를 이동 시킬 수 있다. 일 실시예에 따르면, 제3 기어는, 제2 기어의 제2 회전 축(a2)에 평행인 제3 회전 축(a3)을 기준으로 회전할 수 있다. 예를 들어, 구동 기어에 의해 제1 기어가 회전하면, 제2 기어는, 제2 회전 축(a2)을 기준으로 회전할 수 있다. 제2 기어가 회전함에 따라, 제3 기어는, 제3 회전 축(a3)을 기준으로 회전하여, 랙 기어를 제1 방향(예: +y 방향) 또는 제2 방향(예: -y 방향)으로 이동시킬 수 있다. 예를 들어 제3 기어는 피니언 기어일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 구동 기어가 웜 기어일 경우, 제1 기어는 웜 휠 기어일 수 있으나, 이에 제한되 지 않고, 구동 기어 및 전달 기어의 종류는 실시예들에 따라 다양하게 변경될 수 있다. 예를 들어, 구동 기어 및 제1 기어는, 서로 수직으로 맞물리는 베벨 기어일 수 있다. 다른 예를 들어, 구동 기어 및 제1 기어는, 서로 수직으로 맞물리는 스크류 기어일 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 구동 기어에 맞 물리는 제1 기어, 제2 기어 및 제3 기어를 통해, 제2 하우징((예: 도 4a 및 도 4b의 제2 하우 징)을 이동시키기 위한 랙 기어에 구동력을 효율적으로 전달하는 구조를 제공할 수 있다. 도 8a는, 일 실시예에 따른 전자 장치의 제2 하우징 및 구동부의 일 예를 도시한 후면도(rear view)이고, 도 8b 는, 일 실시예에 따른 전자 장치의 제2 하우징 및 구동부의 다른 예를 도시한 후면도(rear view)이다. 도 8a 및 도 8b를 참조하면, 일 실시예에 따르면, 전자 장치는, 배터리(예: 도 3a 및 도 3b의 배터리 )를 더 포함할 수 있다. 예를 들어, 배터리는, 프레임 커버에 배치될 수 있다. 일 실시예에 따르면, 랙 기어는, 프레임 커버의 외부에 배치될 수 있다. 가이드 레일이 작동 공 간(예: 도 4a 및 도 4b의 작동 공간(432a))을 통해 랙 기어의 이동 공간을 제공함에 따라, 랙 기어는, 프레임 커버의 외부에서 이동 가능할 수 있다. 예를 들어, 제1 하우징을 위(예: -z 방 향)에서 바라볼 때, 작동 공간(432a)이 프레임 커버의 내부에 형성된 경우, 프레임 커버내에 배터리 를 배치할 공간이 부족해질 수 있다. 일 실시예에 따른 전자 장치는, 프레임 커버의 외부에 형 성되는 작동 공간(432a)에 의해, 프레임 커버 내에 다른 부품들을 위한 공간을 제공할 수 있다. 일 실시예에 따르면, 구동부의 모터의 구동 축(a0)은, 기어 면(540a)에 수직일 수 있다. 예를 들어, 모터는, 모터의 구동 축(a0)이 기어 면(540a)에 수직임에 따라, 프레임 커버의 제1 가장 자리 (413c)에 배치될 수 있다. 모터가 프레임 커버의 제1 가장 자리(413c)에 배치되면, 제1 가장 자리 (413c)를 제외한 프레임 커버의 일부에 배터리를 배치하기 위한 공간이 확보될 수 있다. 예를 들어, 모터의 구동 축(a0)이 기어 면(540a)에 수직일 경우, 배터리의 크기는, 프레임 커버의 제3 가장 자리(413e) 또는 제4 가장 자리(413f)를 향하는 방향으로 확장될 수 있다. 일 실시예에 따르면, 모터의 구동 축(a0)은, 기어 면(540a)에 평행일 수 있다. 예를 들어, 모터의 구 동 축(a0)이 기어 면(540a)에 수직임에 따라, 모터는, 프레임 커버의 제3 가장 자리(413e)에 배치될 수 있다. 모터가 프레임 커버의 제3 가장 자리(413e)에 배치되면, 제3 가장 자리(413e)를 제외한 프 레임 커버의 다른 일부에 배터리를 배치하기 위한 공간이 확보될 수 있다. 예를 들어, 모터의 구동 축(a0)이 기어 면(540a)에 평행일 경우, 배터리의 크기는, 프레임 커버의 제1 가장 자리(413c) 또는 제2 가장 자리(413d)를 향하는 방향으로 확장될 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치는, 구동 축(a0)이 기어 면(540a)에 수직 또는 평행하도록 배치되는 모터에 의해, 증가된 크기를 가지는 배터리를 배치하기 위한 구조를 제공할 수 있다. 배터 리의 크기가 증가할수록, 배터리의 용량 및 에너지 밀도가 증가하기 때문에, 전자 장치는, 사용 자에게 다양한 기능을 원활하게 제공할 수 있다. 도 9a는, 일 실시예에 따른 전자 장치의 제2 하우징의 일부 및 구동부의 일부를 확대한 확대 사시도(enlarged perspective view)이고, 도 9b는, 일 실시예에 따른 전자 장치를 도 9a의 D-D'를 따라 절단한 예를 도시한 단면 도(cross-sectional view)이고, 도 9c는, 일 실시예에 따른 전자 장치를 도 9a의 E-E'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 9a, 도 9b, 및 도 9c를 참조하면, 일 실시예에 따르면, 제1 가이드 부재는, 제1 방향(예: +y 방향)을 향하는 프레임 커버의 일부에 배치될 수 있다. 예를 들어, 제1 가이드 부재는, 전달 기어를 향 하는 프레임 커버의 일부에 배치될 수 있다. 일 실시예에 따르면, 제1 가이드 부재는, 랙 기어 의 이동을 안내하는 복수의 베어링들을 포함할 수 있다. 복수의 베어링들은, 서로 접하며, 랙 기어 의 이동에 따라 제1 가이드 부재 내에서 이동 가능할 수 있다. 예를 들어, 복수의 베어링들은, 볼 베어링일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 제1 가이드 부재는, 랙 기어가 이동 가능한 제1 공간, 및 제1 공간을 둘러싸며, 제1 공간과 연결되는 제2 공간을 포함할 수 있다. 제1 공간은, 제1 가이드 부재(60 0)의 외부를 향해 개방되어(opened) 있어, 랙 기어의 적어도 일부를 수용할 수 있다. 랙 기어는, 전 달 기어가 회전하면, 제1 공간 내에서 제1 방향 또는 제1 방향에 반대인 제2 방향(예: -y 방향)으로 이동 가능할 수 있다. 제2 공간은, 제1 가이드 부재 내에 형성될 수 있다. 제1 공간 및 제2 공 간은 서로 연결될 수 있다. 제1 공간 및 제2 공간은, 서로 연결되어, 폐곡선(closed curve)형 태의 복수의 베어링들의 이동 경로를 형성할 수 있다. 일 실시예에 따르면, 복수의 베어링들은, 랙 기어가 제1 공간에 삽입되면, 기어 면(540a)에 수 직인 랙 기어의 측면(540b)에 접할 수 있다. 예를 들어, 랙 기어의 측면(540b)에 접한 복수의 베어링 들 중 적어도 일부는, 기어 레일에 수용될 수 있다. 일 실시예에 따르면, 복수의 베어링들 각각은, 서로 접촉함으로써, 랙 기어의 이동에 따라 제1 가이 드 부재 내에서 순환할(circulate) 수 있다. 예를 들어, 랙 기어가 전달 기어에 의해 이동하면, 제1 공간에 배치된 복수의 베어링들 중 일부는, 랙 기어의 측면(540b)에 접하면서 랙 기어(54 0)의 이동 방향을 따라 이동할 수 있다. 복수의 베어링들 중 일부는, 복수의 베어링들 중 다른 일부 에 의해 밀려(pushed) 제2 공간에 도달할 수 있다. 제2 공간에 도달한 복수의 베어링들 중 일부 는, 랙 기어의 이동 방향에 반대인 방향을 따라 제1 가이드 부재 내에서 이동할 수 있다. 랙 기어 의 이동 방향에 반대인 방향으로 이동하던 복수의 베어링들 중 일부는, 복수의 베어링들 중 다 른 일부에 의해 밀려, 제2 공간에서 다시 제1 공간으로 이동할 수 있다. 복수의 베어링들이 제1 가이드 부재 내에서 순환함에 따라, 복수의 베어링들 각각의 운동 경로는, 폐곡선을 형성할 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 랙 기어의 이동 을 안내하는 복수의 베어링들을 포함하는 제1 가이드 부재에 의해, 랙 기어의 이동에 따라 발생하는 마찰을 감소시키는 구조를 제공할 수 있다. 일 실시예에 따른 전자 장치는, 랙 기어의 이동에 따라 발생하는 마찰이 감소됨에 따라, 제2 하우징(예: 도 4a 및 도 4b의 제2 하우징)이 제1 하우징(예: 도 4a 및 도 4b의 제1 하우징)에 대하여 원활하게(smoothly) 움직일 수 있는 구조를 제공할 수 있다. 도 10a는, 일 실시예에 따른 전자 장치의 사시도(perspective view)이고, 도 10b는, 일 실시예에 따른 전자 장 치를 도 10a의 F-F'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 10a 및 도 10b를 참조하면, 일 실시예에 따른 전자 장치는, 제2 가이드 부재를 더 포함할 수 있다. 제2 가이드 부재는, 랙 기어 및 제2 하우징의 이동을 안내할 수 있다. 일 실시예에 따르 면, 제2 가이드 부재는, 가이드 레일의 작동 공간(432a) 내에 배치될 수 있다. 예를 들어, 제2 가이 드 부재는, 작동 공간(432a) 내에서 제1 방향(예: +y 방향) 또는 제1 방향에 반대인 제2 방향(예: -y 방향)을 따라 이동 가능할 수 있다. 일 실시예에 따르면, 제2 가이드 부재는, 랙 기어의 이동을 안내하는 복수의 베어링들을 포함할 수 있다. 복수의 베어링들은, 랙 기어가 작동 공간(432a) 내에서 원활하게 이동하도록, 랙 기어(54 0)의 이동에 따라 발생하는 마찰을 감소시킬 수 있다. 복수의 베어링들은, 랙 기어의 기어 면(540a) 에 수직인 랙 기어의 측면들(540b, 540c)에 접할 수 있다. 일 실시예에 따르면, 복수의 베어링들은, 서로 이격될 수 있다. 예를 들어, 복수의 베어링들은, 제1 방향을 따라 서로 이격되어, 제2 가이드 부재 에 배치될 수 있다. 예를 들어, 복수의 베어링들은, 볼 베어링일 수 있으나, 이에 제한되지 않는다. 일 실시예에 따르면, 가이드 레일은, 지지 부재의 이동을 안내하기 위한 가이드 홈(432b)을 포함할 수 있다. 가이드 홈(432b)은, 작동 공간(432a)의 적어도 일부를 둘러쌀 수 있다. 일 실시예에 따르면, 가이드 레일은, 제2 가이드 부재의 이동을 안내하는 제1 가이드 슬릿(432e)을 포함할 수 있다. 제1 가이드 슬릿(432e)은, 복수의 베어링들 각각의 일부(710a)를 수용할 수 있다. 제1 가 이드 슬릿(432e)은, 작동 공간(432a)의 적어도 일부를 따라 연장될 수 있다. 제1 가이드 슬릿(432e)은, 제2 가 이드 부재를 둘러쌀 수 있다. 예를 들어, 제1 가이드 슬릿(432e)은, 작동 공간(432a)을 마주하는 가이드 레일의 내면이 작동 공간(432a)으로부터 멀어지는 방향(예: +z 방향 또는 -z 방향)으로 함몰됨으로써 형성 될 수 있다. 일 실시예에 따르면, 랙 기어의 기어 레일은, 복수의 베어링들 각각의 다른 일부 (710b)를 수용할 수 있다. 일 실시예에 따르면, 전달 기어에 의해 랙 기어가 작동 공간(432a) 내에 삽입되면, 제2 가이드 부재 는, 작동 공간(432a)을 향하는 가이드 레일의 내면과 랙 기어의 측면들(540b, 540c) 사이에 개 재될(interposed) 수 있다. 제2 가이드 부재가 가이드 레일의 내면과 랙 기어의 측면들(540b, 540c)을 마주하면, 복수의 베어링들 각각의 일부(710a)는, 제1 가이드 슬릿(432e)에 수용될 수 있다. 복수 의 베어링들 각각의 일부(710a)를 마주하는 복수의 베어링들 각각의 다른 일부(710b)는, 랙 기어 의 기어 레일에 수용될 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 랙 기어의 이동 을 안내하는 복수의 베어링들을 포함하는 제2 가이드 부재에 의해, 랙 기어의 이동에 따라 발생 하는 마찰을 감소시키는 구조를 제공할 수 있다. 일 실시예에 따른 전자 장치는, 랙 기어의 이동에 따라 발생하는 마찰이 감소됨에 따라, 제2 하우징이 제1 하우징에 대하여 원활하게(smoothly) 움직일 수 있는 구조를 제공할 수 있다. 도 11a는, 일 실시예에 따른 전자 장치의 사시도(perspective view)이고, 도 11b는, 일 실시예에 따른 전자 장 치를 도 11a의 G-G'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 11a 및 도 11b를 참조하면, 일 실시예에 따른 전자 장치는, 적어도 하나의 제3 가이드 부재를 더 포함할 수 있다. 제3 가이드 부재는, 랙 기어에 배치되어, 랙 기어의 이동에 따라 랙 기어(54 0)와 함께 이동할 수 있다. 일 실시예에 따르면, 제3 가이드 부재들은, 랙 기어의 기어 면(540a)에 수직인 랙 기어의 측면들(540b, 540c)에 배치될 수 있다. 일 실시예에 따르면, 가이드 레일은, 제3 가이드 부재 및 랙 기어의 이동을 안내하는 제2 가이 드 슬릿(432f)(slit)을 포함할 수 있다. 제2 가이드 슬릿(432f)은, 가이드 레일의 작동 공간(432a)에 연결 될 수 있다. 예를 들어, 제2 가이드 슬릿(432f)은, 작동 공간(432a)을 마주하는 가이드 레일의 내면이, 작 동 공간(432a)으로부터 멀어지는 방향(예: +z 방향 또는 -z 방향)으로 함몰되어 형성될 수 있다. 일 실시예에 따르면, 제3 가이드 부재들 각각은, 랙 기어의 기어 면(540a)의 측면들(540b, 540c)을 따라 연장되는 제1 부분 및 랙 기어의 기어 면(540a)의 측면들(540b, 540c)이 향하는 방향을 따라 연 장되는 제2 부분을 포함할 수 있다. 제1 부분은, 랙 기어의 측면들(540b, 540c)에 접하고, 가이 드 레일의 작동 공간(432a) 내에 배치될 수 있다. 제2 부분은, 제2 가이드 슬릿(432f) 내에 배치될 수 있다. 일 실시예에 따르면, 랙 기어가 이동함에 따라, 제3 가이드 부재는, 랙 기어와 함께 작동 공간 (432a) 내에서 이동할 수 있다. 제3 가이드 부재의 제2 부분과 접하는 제2 가이드 슬릿(432f)의 내벽 은, 랙 기어가 제1 방향(예: +y 방향) 및/또는 제2 방향(예: -y 방향)에 대하여 기울어지지 않도록, 랙 기 어를 지지할 수 있다. 랙 기어가 지지됨에 따라, 제2 하우징은, 제1 하우징에 대하여 기울 어지지 않을 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치는, 랙 기어에 결합되는 제3 가이드 부재에 의해, 랙 기어 및 제2 하우징이 기울어지는 것을 방지하면서, 전자 장치 내에 다른 부품들을 위 한 제공할 수 있다. 도 12는, 일 실시예에 따른 전자 장치의 후면도(rear view)이다. 도 12를 참조하면, 일 실시예에 따르면, 모터는, 서로 이격되는 제1 모터 및 제2 모터를 포함할 수 있다. 제1 모터 및 제2 모터는 서로 마주하고, 제2 하우징의 이동 방향에 수직인 방향(예: +x 방향)으로 이격될 수 있다. 예를 들어, 제1 모터는, 제2 하우징의 제1 가장 자리(420c)를 마주하 고, 제2 모터는, 제2 하우징의 제2 가장 자리(420d)를 마주할 수 있다. 일 실시예에 따르면, 구동 기어는, 제1 구동 기어 및 제2 구동 기어를 포함할 수 있다. 제1 구 동 기어 및 제2 구동 기어는, 각각 제1 모터 및 제2 모터에 회전 가능하도록 결합될 수 있 다. 일 실시예에 따르면, 적어도 하나의 전달 기어는, 제1 전달 기어 및 제2 전달 기어를 포함할 수 있다. 제1 전달 기어는, 제1 구동 기어에 맞물리고, 제2 전달 기어는 제2 구동 기어에 맞 물릴 수 있다. 제1 전달 기어는 제1 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능할 수 있다. 제2 전달 기어는 제2 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능할 수 있 다. 일 실시예에 따르면, 제1 랙 기어는 제1 전달 기어에 맞물리고, 제2 랙 기어는, 제2 전달 기어 에 맞물릴 수 있다. 예를 들어, 제1 랙 기어는, 제2 하우징의 제1 가장 자리(420c)를 따라 연장 될 수 있다. 다른 예를 들어, 제2 랙 기어는, 제2 하우징의 제2 가장 자리(420d)를 따라 연장될 수 있다. 일 실시예에 따르면, 제1 모터 및 제2 모터가 동작하면, 제1 구동 기어 및 제2 구동 기어 는, 각각 회전할 수 있다. 제1 구동 기어 및 제2 구동 기어의 회전에 의해, 제1 전달 기어 및 제2 전달 기어 각각이 회전하고, 제1 랙 기어 및 제2 랙 기어가 제1 방향(예: +y 방향) 또는 제 2 방향(예: -y 방향)으로 이동할 수 있다. 예를 들어, 모터들(511, 512)이 제2 하우징의 제1 가장 자리 (420c)만을 마주할 경우, 제2 하우징의 제2 가장 자리(420d)와 제1 가장 자리(420c) 사이에서 구동력 차이 가 발생될 수 있다. 구동력 차이가 발생하면, 제2 하우징이 제1 하우징에 대하여 기울어져, 디스플레 이가 파손될 수 있다. 일 실시예에 따른 전자 장치는, 제2 하우징의 양 가장 자리들(420c, 420d) 각각을 마주하는 모터들(511, 512)에 의해, 제2 하우징이 제1 하우징에 대하여 기울어지는 것 을 방지하여, 디스플레이의 파손을 감소시킬 수 있다. 상술한 바와 같이, 일 실시예에 따른 전자 장치는, 제2 하우징의 양 가장 자리들(420c, 420d) 각각을 마주하는 모터들(511,512)에 의해, 전자 장치의 내부 구성 요소의 파손을 감소시키는 구조를 제공할 수 있 다. 일 실시예에 따른 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 제1 하우징(예: 도 4a 및 도 4b의 제1 하우징), 상기 제1 하우징에 대하여 슬라이딩 가능하도록(slidable) 상기 제1 하우징에 결합되는 제2 하우 징(예: 도 4a 및 도 4b의 제2 하우징), 상기 제2 하우징의 일 면(예: 도 4a 및 도 4b의 제2 하우징 의 타 면(420b))에 접하고, 상기 제2 하우징의 이동에 따라 상기 제1 하우징 내로 인입 가능하거나 상기 제1 하 우징으로부터 인출 가능한(예: 도 4a 및 도 4b의 디스플레이)를 포함할 수 있다. 일 실시예에 따른 전자 장치는, 제1 하우징 내에 배치되고, 상기 제2 하우징을 이동시키기 위한 구동력을 제공하는 모터(예: 도 4a 및 도 4b의 모터), 상기 모터로부터 인가된 구동력에 의해 회전하는 구동 기어(driving gear) (예: 도 4a 및 도 4b의 구동 기어)를 포함할 수 있다. 일 실시예에 따른 전자 장치는, 상기 구동 기어의 회전에 따라 상 기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록, 상기 구동 기어에 맞물리는(engaged with) 적어도 하나의 전달 기어(transmitting gear) (예: 도 4a 및 도 4b의 전달 기어), 및 상기 제2 하 우징에 배치되고, 상기 적어도 하나의 전달 기어의 회전에 따라 직선 왕복 가능한 랙 기어(예: 도 4a 및 도 4b 의 랙 기어)를 포함할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 적어도 하나의 전달 기어에 맞 물리는 복수의 이들(teeth)을 포함하고, 상기 제2 하우징의 상기 일 면이 향하는 방향에 구별되는 방향을 향하 는 기어 면(예: 도 4a 및 도 4b의 기어 면(540a))을 포함할 수 있다. 일 실시예에 따르면, 랙 기어(예: 도 3b의 랙 기어)에 포함된 상기 적어도 하나의 전달 기어에 맞물리는 복수의 이들(teeth)은, 상기 제2 하우 징에 배치된 디스플레이와 평행한 방향으로 형성될 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제2 하우징의 이동 방향에 수직인 방향으로 연장되는 복수의 바들 (bars)을 포함하고, 상기 디스플레이의 적어도 일부에 접하는 지지 부재(예: 도 4a 및 도 4b의 지지 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제1 하우징 내에 배치되고, 상기 지지 부재의 이동을 안내하는 가이드 레일(예: 도 4a 및 도 4b의 가이드 레일)을 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 랙 기어의 적어도 일부를 둘러싸는 작동 공간(예: 도 4a 및 도 4b의 작동 공 간(432a))을 포함할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 구동 기어로부터 이격될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 전달 기어는, 상기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록 상기 구동 기어에 맞물리는 제1 기어(예: 도 6의 제1 기어)를 포함할 수 있다. 일 실시예 에 따르면, 상기 적어도 하나의 전달 기어는, 상기 제1 기어와 회전축을 공유하고, 상기 제1 기어의 회전에 따 라 회전 가능한 제2 기어(예: 도 6의 제2 기어)를 포함할 수 있다. 일 실시예에 따르면, 상기 제2 기어는, 상기 제1 기어 상에 배치되고, 상기 제1 기어에 의해 회전함에 따라 상 기 랙 기어를 이동시킬 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제1 기어 및 상기 제2 기어의 상기 회전축을 따라 연장되는 샤프 트(예: 도 6의 샤프트)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 전달 기어는, 상기 제2 기어의 회전 축에 평행인 회전 축을 기준으로 회전 가능하고, 상기 제2 기어 및 상기 랙 기어에 맞물리는 제3 기어(예: 도 7의 제3 기어)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 구동 기어는, 웜 기어, 베벨 기어, 스크류 기어, 및 이들의 조합 중에서 선택되는 적 어도 하나를 포함하고, 상기 적어도 하나의 전달 기어는, 웜 휠 기어, 베벨 기어, 스크류 기어, 피니언 기어, 및 이들의 조합 중에서 선택되는 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 모터의 구동 축은, 상기 기어 면이 향하는 방향에 평행일 수 있다. 일 실시예에 따르면, 상기 모터의 구동 축은, 상기 기어 면이 향하는 방향에 수직일 수 있다. 일 실시예에 따르면, 상기 랙 기어인 제1 랙 기어와 구별되고, 상기 제1 랙 기어를 마주하고 상기 제1 랙 기어 로부터 이격된 제2 랙 기어(예: 도 4a 및 도 4b의 제2 랙 기어)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제2 랙 기어와 맞물리고, 상기 전달 기어인 제1 전달 기어(예: 도 12의 제1 전달 기어)와 구별되고, 상기 제1 전달 기어의 회전 축에 평행인 회전 축을 기준으로 회전 가능 한 제2 전달 기어(예: 도 12의 제2 전달 기어)를 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제2 전달 기어에 맞물리고, 상기 구동 기어인 제1 구동 기어(예: 도 12의 제1 구동 기어)와 구별되고, 상기 제2 전달 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능한 제2 구동 기어(예: 도 12의 제1 구동 기어)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제2 구동 기어와 결합 되고, 상기 모터인 제1 모터와 구별되고, 상기 제2 구동 기어를 회전시키는 제2 모터(예: 도 12의 제2 모터 )를 더 포함할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면(예: 도 4a 및 도 4b의 측면 (540b))에 배치되고, 상기 랙 기어의 이동 방향을 따라 연장되는 기어 레일(예: 도 4a 및 도 4b의 기어 레일 )을 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 제1 하우징에 배치되고, 적어도 일부가 상기 기어 레일에 접하는 복수의 베어링들(예: 도 9a, 도 9b, 및 도 9c의 베어링들)을 포함하고, 상기 랙 기어 및 상기 제2 하우징의 이동을 안내하는 제1 가이드 부재(예: 도 4a 및 도 4b의 제1 가이드 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 복수의 베어링들 중 일부는 상기 랙 기어의 이동에 따라 상기 복 수의 베어링들 중 다른 일부에 의해 상기 제1 가이드 부재 내에서 이동 가능할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 제2 하우징의 이동에 따라 상기 작동 공간 내에서 직선 왕복 운동 가능할 수 있다. 일 실시예에 따르면, 상기 제1 하우징은, 상기 모터, 및 상기 적어도 하나의 전달 기어가 배치되고, 상기 제1 하우징 내에 배치되는 프레임 커버(예: 도 4a 및 도 4b의 프레임 커버)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 제2 하우징의 이동 방향에 수직인 방향을 향하는 상기 프레임 커버의 가장 자리(예: 도 4a 및 도 4b의 프레임 커버의 제3 가장 자리(413e))에 배치될 수 있다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 작동 공간의 적어도 일부와 분리되고, 상기 지지 부재의 이동을 안내하는 가이드 홈(예: 도 5의 가이드 홈(432b))을 더 포함할 수 있다. 일 실시예에 따르면, 상기 복수의 바들 각각은, 상기 제2 하우징의 이동에 따라 상기 가이드 홈 내에서 이동 가능한 가이드 돌기(예: 도 5의 가이드 돌 기(431a))를 포함할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 작동 공간 내에 배치되고, 상기 작동 공간 내에서 이동 가능한 제 2 가이드 부재(예: 도 10a 및 도 10b의 제2 가이드 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 제2 가이드 부재는, 상기 랙 기어의 이동을 안내하고, 서로 이격되는 복수의 베어링들(예: 도 10a 및 도 10b의 복수의 베어링들)을 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 복수의 베어링들 각각의 일부와 접하고, 상기 작동 공간을 따라 연장되는 제1 가이드 슬릿(예: 도 10a 및 도 10b의 제1 가이드 슬릿(432e))을 더 포함할 수 있다. 일 실시예에 따르면, 상기 복수의 베어링들 각각의 다른 일부는, 상기 복수의 베어링들 각각의 상기 일부를 마주하고, 상기 기어 면에 수직인 상기 랙 기어의 측면에 접할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면에 배치되는 제3 가이드 부재 (예: 도 11a 및 도 11b의 제3 가이드 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일 은, 상기 작동 공간에 연결되고, 상기 제3 가이드 부재의 일부를 수용하는 제2 가이드 슬릿(예: 도 11a 및 도 11b의 제2 가이드 슬릿(432f))을 더 포함할 수 있다. 일 실시예에 따르면, 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는, 제1 하우징(예: 도 4a 및 도 4b의 제 1 하우징), 상기 제1 하우징에 대하여 이동 가능하도록(movably) 상기 제1 하우징에 결합되는 제2 하우징 (예: 도 4a 및 도 4b의 제2 하우징), 및 상기 제2 하우징의 일 면에 배치되는 제1 영역(예: 도 3a 및 도 3b의 제1 영역(230a)) 및 상기 제2 하우징의 이동에 따라 변형 가능한(deformable) 제2 영역(예: 도 3a 및 도 3b의 제2 영역(230b))을 포함하는 디스플레이(예: 도 4a 및 도 4b의 디스플레이)를 포함할 수 있다. 일 실 시예에 따르면, 전자 장치는, 상기 제2 하우징의 이동 방향에 수직인 방향으로 연장되는 적어도 하나의 바(ba r)를 포함하고, 상기 디스플레이의 상기 제2 영역에 배치되는 지지 부재(예: 도 4a 및 도 4b의 지지 부재(43 1))를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 상기 제1 하우징 내에 배치되고, 상기 지지 부재의 운동을 가이드 하는 가이드 레일(예: 도 4a 및 도 4b의 가이드 레일)을 포함할 수 있다. 일 실시예에 따르 면, 전자 장치는, 상기 제1 하우징 내에 배치되고, 상기 제2 하우징에 구동력을 제공하는 모터(예: 도 4a 및 도 4b의 모터), 상기 모터에 대하여 회전 가능하도록 상기 모터에 결합되는 구동 기어(gear portion) (예: 도 4a 및 도 4b의 구동 기어), 및 상기 구동 기어의 회전에 따라 상기 구동 기어의 회전 축에 수직인 회전 축 을 기준으로 회전 가능하도록, 상기 구동 기어에 맞물리는(engaged with) 적어도 하나의 전달 기어 (예: 도 4a 및 도 4b의 전달 기어)를 포함할 수 있다. 일 실시예에 따르면, 전자 장치는, 상기 제2 하우징에 배치되고, 상기 적어도 하나의 전달 기어에 맞물리는 복수의 이들(teeth)을 포함하고, 상기 제2 하우징의 상기 일 면이 향하는 방향에 수직인 방향을 향하는 기어 면(예: 도 4a 및 도 4b의 기어 면(540a))을 포함하고, 상기 적어도 하나의 전달 기어의 회전에 따라 이동하는 랙 기어(예: 도 4a 및 도 4b의 랙 기어)를 포함할 수 있 다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 랙 기어의 이동을 안내하도록 상기 랙 기어의 적어도 일부 를 수용하는 작동 공간을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 하우징은, 상기 모터, 및 상기 적어도 하나의 전달 기어를 수용하는 프레임 커버 (예: 도 4a 및 도 4b의 프레임 커버)를 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일은, 상기 제2 하우징의 이동 방향에 수직인 방향을 향하는 상기 프레임 커버의 가장 자리에 배치될 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면(예: 도 4a 및 도 4b의 측면 (540b))에 배치되고, 상기 랙 기어의 상기 측면을 따라 연장되는 기어 레일(예: 도 4a 및 도 4b의 기어 레일 )을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 하우징에 배치되고, 적어도 일부가 상기 기어 레일에 수용되는 복수의 베어링들(예: 도 9a, 도 9b, 및 도 9c의 베어링들)을 포함하고, 상기 랙 기어 및 상기 제 2 하우징의 이동을 안내하는 제1 가이드 부재(예: 도 4a 및 도 4b의 제1 가이드 부재)를 더 포함할 수 있 다. 일 실시예에 따르면, 상기 적어도 하나의 전달 기어는, 상기 구동 기어의 회전 축에 수직인 회전 축을 기준으로 회전 가능하도록 상기 구동 기어에 맞물리는 제1 기어(예: 도 6의 제1 기어)를 더 포함할 수 있다. 일 실 시예에 따르면, 상기 적어도 하나의 전달 기어는, 상기 제1 기어와 동축을 형성하여 상기 제1 기어의 회전에 따라 회전 가능한 제2 기어(예: 도 6의 제2 기어)를 포함할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 제2 하우징의 이동에 따라 상기 작동 공간 내로 인입 가능하거나, 상기 작동 공간으로부터 인출 가능할 수 있다. 일 실시예에 따르면, 상기 전자 장치는, 상기 작동 공간 내에 배치되고, 상기 작동 공간 내에서 이동 가능한 제 2 가이드 부재(예: 도 10a 및 도 10b의 제2 가이드 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 제2 가이드 부재는, 상기 랙 기어의 이동을 안내하고, 서로 이격되는 복수의 베어링들(예: 도 10a 및 도 10b의 복수의 베어링들)을 포함할 수 있다. 일 실시예에 따르면, 상기 랙 기어는, 상기 기어 면에 수직인 상기 랙 기어의 측면에 배치되는 제3 가이드 부재 (예: 도 11a 및 도 11b의 제3 가이드 부재)를 더 포함할 수 있다. 일 실시예에 따르면, 상기 가이드 레일 은, 상기 작동 공간과 연결되고, 상기 제3 가이드 부재의 이동을 안내하는 제2 가이드 슬릿(예: 도 11a 및 도 11b의 제2 가이드 슬릿(432f))을 더 포함할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 전 자 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예:스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2022-0053530", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는, 일 실시예에 따른 전자 장치의 제1 상태의 전면도(front view)이다. 도 2b는, 일 실시예에 따른 전자 장치의 제1 상태의 후면도(rear view)이다. 도 2c는, 일 실시예에 따른 전자 장치의 제2 상태의 전면도(front view)이다. 도 2d는, 일 실시예에 따른 전자 장치의 제2 상태의 후면도(rear view)이다. 도 3a는, 일 실시예에 따른 전자 장치의 분해 사시도(exploded perspective view)이다. 도 3b는, 일 실시예에 따른 전자 장치를 도 2a의 A-A'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 4a는, 일 실시예에 따른 전자 장치의 제1 상태의 사시도(perspective view)이다. 도 4b는, 일 실시예에 따른 전자 장치의 제2 상태의 사시도(perspective view)이다. 도 4c는, 일 실시예에 따른 전자 장치를 도 4b의 B-B'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 5는, 일 실시예에 따른 전자 장치를 도 4b의 C-C'를 따라 절단한 예를 도시한 부분 단면도(partial cross- sectional view)이다. 도 6은, 일 실시예에 따른 전자 장치의 구동부의 일 예를 도시한 도면이다. 도 7은, 일 실시예에 따른 전자 장치의 구동부의 다른 예를 도시한 도면이다. 도 8a는, 일 실시예에 따른 전자 장치의 제2 하우징 및 구동부의 일 예를 도시한 후면도(rear view)이다. 도 8b는, 일 실시예에 따른 전자 장치의 제2 하우징 및 구동부의 다른 예를 도시한 후면도(rear view)이다. 도 9a는, 일 실시예에 따른 전자 장치의 제2 하우징의 일부 및 구동부의 일부를 확대한 확대 사시도(enlarged perspective view)이다. 도 9b는, 일 실시예에 따른 전자 장치를 도 9a의 D-D'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 9c는, 일 실시예에 따른 전자 장치를 도 9a의 E-E'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 10a는, 일 실시예에 따른 전자 장치의 사시도(perspective view)이다. 도 10b는, 일 실시예에 따른 전자 장치를 도 10a의 F-F'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 11a는, 일 실시예에 따른 전자 장치의 사시도(perspective view)이다. 도 11b는, 일 실시예에 따른 전자 장치를 도 11a의 G-G'를 따라 절단한 예를 도시한 단면도(cross-sectional view)이다. 도 12는, 일 실시예에 따른 전자 장치의 후면도(rear view)이다."}
