{"patent_id": "10-2023-0061893", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0164708", "출원번호": "10-2023-0061893", "발명의 명칭": "인공지능을 이용한 무인비행 장치, 이를 포함하는 등검은말벌집 탐지 시스템 및 방법", "출원인": "대한민국", "발명자": "최인찬"}}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비행 환경정보를 수집하고, 무인으로 비행하는 드론모듈; 및촬영장치로 항공영상을 수집하고, 인공지능 학습을 이용하여 상기 항공영상에서 등검은말벌집을 검출하는 검출모듈;을 포함하되,상기 검출모듈은,소정 범위의 해상도를 가지는 상기 항공영상을 수집하기 위하여 상기 드론모듈의 비행 고도를 제어하고, 상기촬영장치의 각도, 밝기 및 초점거리를 제어하는, 무인 비행장치."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 드론모듈은,비행 경로를 생성하기 위한 상기 비행 환경정보를 수집하는 수집부;실시간 위치정보를 수집하는 GPS부; 및상기 위치정보를 송신하고, 비행 경로를 수신하는 제1 통신부;를 포함하는 무인 비행장치."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 검출모듈은,상기 촬영장치를 이용하여 등검은말벌집의 검출을 위한 지형정보를 포함하는 항공영상을 수집하는 영상부;객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출하는 검출부;등검은말벌집 검출 유무에 따라 상기 드론모듈의 비행 경로를 생성하고, 상기 영상부의 동작을 제어하는제어부; 및상기 드론모듈의 실시간 위치정보를 수신하고, 상기 비행 경로를 송신하는 제2 통신부;를 포함하는 무인 비행장치."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 검출부는,상기 항공영상에서 등검은말벌집을 검출하는 경우에, 검출된 위치정보를 상기 제어부로 송신하고,상기 제어부는,검출된 위치정보로 비행 경로를 생성하고, 등검은말벌집이 검출된 위치 중심의 다각도 항공영상을 수집하도록상기 영상부를 제어하는, 무인 비행장치.공개특허 10-2024-0164708-3-청구항 5 제3항에 있어서,상기 촬영장치는,가시광 카메라, 열화상 카메라, 초분광 카메라 근적외선 카메라 및 라이다(LiDAR) 중 적어도 하나 이상을 포함하는, 무인 비행장치."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 영상부는,상기 제어부의 제어 신호에 의해 상기 항공영상의 해상도가 3840x2160 픽셀을 유지하도록 상기 촬영장치의 동작을 제어하는, 무인 비행장치."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서,상기 검출부에서,상기 객체 탐지 학습 알고리즘은 기계학습 알고리즘, YOLO(You Only Look Once) 학습 알고리즘 중에서 적어도하나 이상을 포함하는, 무인 비행장치."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "비행 환경정보 및 항공영상을 수집하고, 인공지능 기반으로 등검은말벌집을 검출하는 하나 이상의 무인 비행장치; 상기 무인 비행장치의 비행 경로를 설정하고, 실시간으로 비행 동작을 제어하는 비행 제어부;상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보를 수신하여 저장하는 관리서버; 및상기 등검은말벌집의 위치정보 및 영상정보를 수신하여 알림을 출력하는 사용자 단말; 을 포함하되,상기 무인 비행장치는,객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출하고, 검출된 위치로 비행 경로를생성하며, 검출된 위치 중심의 다각도 항공영상을 수집하는, 등검은말벌집 탐지 시스템."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,검출된 등검은말벌집의 위치로 향하는 비행 경로를 수신하여 비행하고, 무인으로 방제를 수행하는 방제 비행장치;를 더 포함하는 등검은말벌집 탐지 시스템."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,공개특허 10-2024-0164708-4-상기 비행 제어부는,상기 무인 비행장치의 자동 비행을 설정하거나 수동 비행을 설정하는 비행 설정부;상기 무인 비행장치의 고도정보를 기반으로 상기 항공영상의 해상도를 제어하는 영상 제어부;상기 비행 환경정보 및 상기 무인 비행장치의 GPS 위치정보를 기반으로 상기 비행 경로를 생성하는 경로생성부; 및실시간으로 상기 무인 비행장치의 위치정보 및 상기 비행 환경정보를 출력하는 출력부;를 포함하는 등검은말벌집 탐지 시스템."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 비행 설정부는,상기 무인 비행장치가 군집 비행하는 경우에, 기설정된 비행 경로로 이동하는 자동 비행으로 설정하는, 등검은말벌집 탐지 시스템."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 관리 서버는,상기 방제 비행장치가 등검은말벌집의 방제를 완료하는 경우에, 방제가 완료된 위치정보를 수신하고, 상기 위치정보에 대응하는 등검은말벌집의 영상정보를 삭제하는, 등검은발벌집 탐지 시스템."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "자동 비행의 설정 유무에 따라 군집 비행을 설정하는 단계;비행의 실시간 고도정보를 기반으로 비행 환경정보 및 항공영상을 수집하는 단계;객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출하는 단계;상기 비행 환경정보 및 상기 항공영상을 기반으로 비행 경로를 설정하는 단계;상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보를 저장하는 단계; 및검출된 등검은말벌집의 상기 위치정보 및 상기 영상정보의 알림을 출력하는 단계;를 포함하는 등검은말벌집 탐지 방법."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,검출된 등검은말벌집의 상기 위치정보를 기반으로 방제를 수행하는 단계;를 더 포함하는 등검은말벌집 탐지 방법."}
{"patent_id": "10-2023-0061893", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 객체 탐지 학습 알고리즘은 기계학습 알고리즘, YOLO(You Only Look Once) 학습 알고리즘 중에서 적어도공개특허 10-2024-0164708-5-하나 이상을 포함하는, 등검은말벌집 탐지 방법."}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무인 비행장치 및 이를 포함하는 등검은말벌집 탐지 시스템 및 방법에 관한 것으로, 본 발명에 따르면 비행 환경정보 및 항공영상을 수집하고, 등검은말벌집을 검출하는 하나 이상의 무인 비행장치, 상기 무인 비행장 치의 비행 경로를 설정하고, 실시간으로 비행 동작을 제어하는 비행 제어부, 상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보를 수신하여 저장하는 관리 서버 및 상기 등검은말벌집의 위치정보 및 영상정보를 수신하여 알림을 출력하는 사용자 단말을 포함한다."}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 적용한 무인비행 장치를 이용하여 실시간으로 등검은말벌집을 탐지하는 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "드론(무인 비행체)은 항공 영상 데이터 취득과 관련되어 많은 분야에서 사용되고 있다. 그리고 객체 탐지에 뛰 어난 성능을 가지는 인공지능은 CCTV 감시, 자율주행 자동차에 사용되는 장애물 판단 등 많은 분야에 사용되고 있다. 따라서 이러한 인공지능을 접목한 드론은 방제, 탐지 등의 다양한 기술에 이용되고 있으며, 이는 미래 사업으로 서 주목받는 분야이다. 그러나 드론이 촬영한 항공영상은 지상에서 촬영되는 영상들과는 다르게 고도가 올라갈수록 탐지 객체들이 매우 작아지는 특성을 가진다. 따라서 종래의 드론 비행 방법 및 촬영 방법은 인공지능의 객체 탐지에 대한 성능을 저하시킨다. 또한, 항공에는 경로의 지표가 되는 도로, 인도, 건물 등이 없으므로, 객체 탐지를 위한 경로 선정 이 어려우며, 이를 해결할 효율적인 방법이 필요하다. 따라서 드론과 인공지능을 이용한 실시간 등검은말벌집 탐지 시스템 및 방법을 제안한다. 외래 유입종인 등검은말벌(Asian Hornet, 학명 Vespa velutina nigrithorax)은 2003년 부산항으로 국내 유입되 어 2016년 전국으로 확산되었다. 특히 국내 남부지역의 양봉장에 피해가 증가하고 있어, 등검은말벌은 2019년 국내 생태계 교란 야생생물로 지정되었다. 통계에 따르면, 등검은발벌로 인한 국내 연간 피해액은 말벌류 방제 비용 및 꿀벌 봉군피해(약 30%) 등을 포함하여 약 1,750억 원 이상의 손실액인 것으로 알려져 있다. 따라서 등 검은말벌의 국내 확산에 의한 양봉농가의 피해를 최소화하기 위해 등검은말벌집을 탐색하는 시스템이 필요한 실 정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개 특허 제10-2021-0114647호"}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 인공지능을 적용한 무인 비행 장치를 이용하여 국내 생태계 교란종인 등검은말벌을 실시간으 로 탐지하는 시스템 및 방법을 제공함에 있다."}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예로, 비행 환경정보를 수집하고, 무인으로 비행하는 드론모듈 및 항공영상을 수집하고, 인공 지능 학습을 이용하여 상기 항공영상에서 등검은말벌집을 검출하는 검출모듈을 포함하는 무인비행 장치를 제공 한다. 그리고 본 발명의 다른 실시예로, 비행 환경정보 및 항공영상을 수집하고, 등검은말벌집을 검출하는 하나 이상 의 무인비행 장치, 상기 무인비행 장치의 비행 경로를 설정하고, 실시간으로 비행 동작을 제어하는 비행 제어부, 상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보를 수신하여 저장하 는 관리 서버 및 상기 등검은말벌집의 위치정보 및 영상정보를 수신하여 알림을 출력하는 사용자 단말을 포함하 는 등검은말벌집 탐지 시스템을 제공한다.또한, 본 발명의 다른 실시예로, 군집 비행 유무에 따라 자동 비행을 설정하거나 수동 비행을 설정하는 단계, 비행의 실시간 고도정보를 기반으로 비행 환경정보 및 항공영상을 수집하는 단계, 객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출하는 단계, 상기 비행 환경정보 및 상기 항공영상을 기반으로 비행 경로를 설정하는 단계, 상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보 를 저장하는 단계 및 검출된 등검은말벌집의 상기 위치정보 및 상기 영상정보의 알림을 출력하는 단계를 포함하 는 등검은말벌집 탐지 방법을 제공한다."}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 인공지능을 이용한 무인비행 장치는 등검은말벌집을 제거할 수 있도록 실시간으로 정확한 정보를 제공할 수 있다. 상기 무인비행 장치를 포함하는 등검은말벌집 탐지 시스템 및 방법은 등검은말벌집을 정확하게 탐색하여 제거할 수 있다."}
{"patent_id": "10-2023-0061893", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 기술사상을 본 발명의 기술분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있을 정도로 상세히 설명하기 위하여, 본 발명의 실시 예들이 첨부된 도면을 참조하여 설명될 것이다. 도 1은 본 발명의 일 실시예에 따른 무인 비행장치의 블럭구성도이다. 도 1을 참조하면, 본 발명의 무인 비행장치는 드론모듈 및 검출모듈을 포함할 수 있다. 드론모듈은 비행 환경정보를 수집할 수 있고, 무인으로 비행할 수 있다. 드론모듈은 수집부, GPS부, 제1 통신부 및 제1 전원부를 포함할 수 있다. 여기에서, 드론모듈은 4방향의 모터 및 날개를 구비하여 이동 방향을 제어할 수 있다. 드론모듈의 수집부는 비행 경로를 생성하기 위한 상기 비행 환경정보를 수집할 수 있다. 여기에서, 상기 비행환경 정보는 무인 비행장치가 비행하는 주변의 환경을 알 수 있는 정보로, 비행 전후방 및 주변 영상, 날씨 정보, 장애물 정보 등을 포함할 수 있다. 예를 들어, 수집부는 비행 전후방 시야를 확인할 수 있는 카메라 장치 및 카메라의 흔들림을 최소화하는 짐벌(Gimbal)을 포함할 수 있다. 여기에서 짐벌은 카메라의 촬영각도를 제어할 수 있다. 드론모듈의 GPS부는 무인 비행장치의 실시간 위치정보를 수집할 수 있다. 여기에서 GPS(Global Positioning System)는 위성에서 보내는 신호를 수신해 사용자의 현재 위치를 계산하는 위성항법시스템이고, 상 기 위치정보는 GPS 좌표일 수 있다. 그리고 GPS부는 드론모듈의 상단부에 장찰될 수 있고 정밀한 위 치정보를 송신하는 RTK GPS의 안테나를 사용할 수 있다. 드론모듈의 제1 통신부는 검출모듈과 지상 관제부(Ground Control System, GCS), 서버 등을 포 함하는 여러 장비와 현재 위치정보를 송신할 수 있고, 비행 경로를 수신할 수 있다. 즉, GPS부에서 무인비행장치의 실시간 위치정보를 제1 통신부로 전달하고, 제1 통신부는 실시간으로 상기 위치정보 를 검출모듈을 포함한 여러 장비로 송신할 수 있다. 여기에서, 제1 통신부는 원격 제어가 가능한 텔 레메트리(telemetry) 안테나를 적용하는 것이 바람직하다. 드론모듈의 제1 전원부는 탈부착이 가능하며, 비행을 위한 배터리가 장착되어 드론모듈에 전원 을 공급할 수 있다. 제1 전원부의 배터리는 드론용 배터리로 가장 많이 사용되는 리튬폴리머 6셀(6S1P) 배 터리(22.2 V 및 22,000 mAh)인 것이 바람직할 수 있다. 다시 도 1을 참조하면, 검출모듈은 항공영상을 수집할 수 있고, 인공지능 학습을 이용하여 상기 항공영상 에서 등검은말벌집을 검출할 수 있다. 그리고 검출모듈은 소정 범위의 해상도를 가지는 상기 항공영상을 수집하기 위하여 상기 드론모듈의 비행 고도를 제어하고, 상기 촬영장치의 각도, 밝기 및 초점거리를 제어할 수 있다. 또한, 검출모듈은 드론모듈에 탈부착하여 비행할 수 있다. 여기에서, 상기 항공영상은 공중에서 지표를 촬영한 사진으로, 등검을말벌집을 탐지하기 위한 사진일 수 있다. 검출모듈은 영상부, 검출부, 제어부, 제2 통신부 및 제2 전원부를 포함할 수 있다. 검출모듈의 영상부는 상기 촬영장치를 이용하여 등검은말벌집의 검출을 위한 지형정보를 포함하는 항 공영상을 수집할 수 있다. 예를 들어, 영상부의 상기 촬영장치는 가시광 카메라, 열화상 카메라, 초분광 카메라 근적외선 카메라 및 라이다(LiDAR) 중 적어도 하나 이상으로부터 상기 항공영상을 수집할 수 있으나 이 에 한정하지 않는다. 예를 들어, 영상부는 검출모듈의 정확도를 향상시키기 위하여 가시광 카메라와 라이다로 동시에 수집한 데이터를 조합하여 상기 항공영상을 수집할 수 있다. 검출모듈의 검출부는 객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출할 수 있다. 여기에서, 상기 객체 탐지 학습 알고리즘은 기계학습 알고리즘, YOLO(You Only Look Once) 학습 알고 리즘 중에서 적어도 하나 이상을 포함할 수 있으나, 이에 한정하지 않는다. 상기 객체 탐지 학습 알고리즘은 등 검은말벌집을 탐지하여 학습이 가능한 알고리즘이면 모두 가능하다. 검출부는 인공지능 연산을 수행하므로, 인공지능 플랫폼인 NVIDIA Jetson AGX Xavier를 사용하는 것이 바 람직하나 이에 한정하지 않는다. 검출부는 인공지능 학습이 가능한 산업용 컴퓨팅일 수 있다. 구체적으로, 본 발명에 따른 검출모듈의 등검은말벌집 탐색 성능을 확인하기 위하여 실험을 진행하였다. 실험에서는 YOLO-v5 기반의 인공지능 모델을 사용하였으며, 중앙처리장치(CPU)는 Intel i7-11700k 3.6GHz, 메모 리(RAM) 128.0GB, 그래픽 NVIDIA GeForce RTX 3080Ti 12GB을 사용하였다. YOLO-v5는 입력 영상 크기(input image size)에 따라 검출 상자(Anchor box) 크기가 달라지며 이에 따라서 검 출할 수 있는 객체의 최대, 최소 크기가 다르다. 따라서 입력 영상 크기 변경, 검출 상자 크기 변환, 입력 영상 크기 50% 범위에서 무작위 조정(Multi scale), 학습에서 사용하는 영상의 최소 개수(batch size), 파라미터를 변경하여, 검출할 수 있는 객체의 크기 조정을 통해 항공 영상에서의 검출 성능 향상을 목적으로 학습하였다. 또한, 날씨에 따른 다양한 영상 변화와 위치에 따른 변화된 데이터를 얻기 위해 사각 무늬 형태(Image Mosaic), 밝기 대비(Brightness Contrast) 등의 영상처리 기법을 활용하여 학습에 적용하였다. 등검은말벌집 탐색을 위해 YOLO-v5에 영상 크기가 다른 4종류의 데이터를 사용하여 학습과 검증하였다. YOLO- v5s-default는 YOLO-v5의 정형화된 파라미터 설정을 그대로 사용하며 입력 영상 크기는 640×384이다. 또한 YOLO-v5s-1280의 영상 크기는 1,280×736, YOLO-v5s-1920은 1,920×1,088, YOLO-v5s-3840은 3,840×2,176 영상 크기일 수 있다. 여기에서, 정형화된 파라미터 설정값이 아닌 입력 영상 크기에 따라 4개로 학습하였다. 검증은 전라북도 완주군에서 획득한 초당 30프레임으로 3분 58초 동안 촬영한 영상을 프레임 단위로 나누어 총 7,158 프레임 데이터를 사용하였다. 검증 데이터 영상 크기는 학습에 사용된 영상 크기와 동일한 640×384, 1,280×736, 1,920×1,088, 3,840×2,176를 사용하였다. 분석 결과는 하기의 표 1과 같다. 표 1 Model Confusion Matrix PrecisionRecall F1 Score TP FP FN TN (a) 7 332 222 6,597 2.0% 3.0% 2.4% (b) 214 726 15 6,203 22.7% 93.4% 36.5% (c) 213 220 16 6,709 49.1% 93.0% 64.2% (d) 212 0 17 6,929 100% 92.5% 96.1% (a) YOLO-v5s-default, (b) YOLO-v5s-1280, (c) YOLO-v5s-1920, (d) YOLO-v5s-3840 여기에서, 인공지능 학습 성능은 정밀도(Precision), 재현율(Recall) 및 F1 수치(F1 Score)를 계산하여 분석한 다. 정밀도는 신경망이 정답이라고 분류한 것 중에서 실제 정답의 비율을 의미하고, 재현율은 실제 정답 중에 신경망이 정답이라고 한 비율, F1 수치는 정밀도와 재현율의 조화평균을 이용한 수치다. 혼동 행렬은 True Positive(TP), False Positive(FP), True Negative(TN), False Negative(FN)로 4가지 수치가 있다. TP는 실제 말벌집을 말벌집이라 판단한 수치이며, FP는 말벌집이 아닌 것을 말벌집이라 판단한 수치, FN 는 말벌집을 말벌집이 아니라고 판단한 수치, TN는 말벌집이 아닌 것을 말벌집이 아니라고 판단한 수치를 의미 한다. 도 2는 본 발명에 따른 검출모듈이 객체 탐지 학습 알고리즘 YOLO-v5을 이용하여 등검은말벌집을 검출한 실험결과에 대한 사진이다. 도 2를 참조하면, 검증 영상 7,158 프레임 중에서 등검은말벌집은 1개가 존재하며 총 229 프레임에 등장한다. YOLO-v5s-default는 7프레임, YOLO-v5s-1280은 214프레임, YOLO-v5s-1920은 213프레임, YOLO-v5s-3840은 212프 레임에서 등검은말벌집을 검출했다. 따라서 검증 영상에서 등장하는 등검은말벌집 229 프레임 중에서 1 프레임 이라도 등검은말벌집을 검출한다면 위치를 추정할 수 있는 데이터를 도출할 수 있다. 하지만 FP의 수치가 높을수록 위치 추정에 혼란이 생기기 때문에 FP 수치가 낮을수록 더 정확한 등검은말벌집 위치를 추정할 수 있다고 판단하였다. 표 1에 나타난 바와 같이 YOLO-v5s-3840이 정밀도, 재현율 및 F1 수치가 100%, 92.5%, 96.1%로, 다른 학습 신경망들과 비교하여 좋은 성능을 나타내었다. 학습 및 검증 영상 크기가 원 본 크기에 근접할수록 등검은말벌집 검출 성능증가 효과를 얻었다. 학습 영상 크기와 무관하게 검증 영상의 크기에 따라 검출 성능이 좋아질 수 있다는 가설을 검증하기 위하여, 검증 영상 크기를 3,840×2,176으로 고정한 후 학습시켜 성능을 비교 분석하였다. 분석 결과는 하기의 표 2와 같다. 표 2를 참조하면, YOLO-v5s-3840을 제외한 3개의 학습 모델은 등검은말벌집 TP가 상승한 수치를 얻을 수 있었다. 하지만 오검출율도 같이 상승하여 정밀도와 F1 수치가 낮아졌다. 표 2 Model Confusion Matrix PrecisionRecall F1 Score TP FP FN TN (a) 192 8094 37 3,002 2.3% 83.8% 4.4% (b) 222 5756 7 3,661 3.7% 96.9% 7.1% (c) 223 2247 6 5,087 9.0% 97.3% 16.4% (d) 212 0 17 6,929 100% 92.5% 96.1% (a) YOLO-v5s-default, (b) YOLO-v5s-1280, (c) YOLO-v5s-1920, (d) YOLO-v5s-3840 검증 영상의 크기가 커질수록 더 높은 검출 성능을 얻을 수 있지만, 학습 영상 크기와의 차이에 따라 오검출 또 한 증가한다는 지표를 얻었다. 검증 영상 크기에 따른 성능 증가는 없었다. 기존 인공지능 학습에서 보편적으로 사용되는 영상 크기인 640((a) YOLO-v5s-default)은 지상을 기준으로 객체 탐지를 위해 설정된 크기이므로 항공 영상에서 작은 객체를 탐지하기엔 부족한 점이 있다. 따라서 종래의 문제점을 극복하기 위해 후술하는 기능을 가지는 무인 비행장치를 발명하였다. 검출모듈의 제어부는 등검은말벌집 검출 유무에 따라 상기 드론모듈의 비행 경로를 생성할 수 있고, 영상부의 동작을 제어할 수 있다. 구체적으로, 검출부가 상기 항공영상에서 등검은말벌집을 검출하는 경우에, 검출된 위치정보를 제어부 로 송신할 수 있고, 제어부는 검출된 위치정보로 무인 비행장치의 비행 경로를 생성할 수 있다. 제어부는 상기 비행 경로를 드론모듈의 제1 통신부로 송신하여 무인 비행장치가 검출된 등 검은말벌집 위치로 이동하도록 제어할 수 있다. 또한, 제어부의 제어 신호는 제1 통신부 및 제2 통신부를 통하여 영상부로 전달되고, 영상 부에 포함된 상기 촬영장치의 각도, 밝기 및 초점거리를 제어할 수 있다. 즉, 무인 비행장치가 등검 은말벌집이 검출된 위치로 비행하여 이동하면, 검출된 등검은말벌집 위치 중심의 다각도 항공영상을 추가로 수 집하도록 영상부의 촬영 각도, 밝기 및 초점거리를 제어할 수 있다. 그리고 영상부는 드론모듈의 수집부와 함께 짐벌에 장착될 수 있다. 여기에서 짐벌은 카메라의 촬영각도를 제어할 수 있으므로 제어부로부터 영상부의 동작 제어 신호를 실시간으로 수신하여 초점 거리, 촬영각도, 밝기 등을 제어할 수 있다. 여기에서, 상술한 실험데이터 표 1 및 표 2의 결과를 활용하여 검출모듈의 제어부는 무인 비행장치 의 비행 임계고도에 대한 상기 촬영장치의 각도, 밝기 및 초점거리 등을 설정할 수 있다. 그러면 무인 비 행장치는 제어부의 설정에 따라 영상부를 통해 상기 객체 탐지 학습 알고리즘에 적합한 상기 항 공영상을 수집할 수 있다. 예를 들어, 상기 비행 임계고도는 지표면으로부터 40 내지 60 m인 것이 바람직하며, 상기 항공영상의 크기가 해상도 3840×2160 픽셀을 가지도록 상기 촬영장치의 초점거리뿐만 아니라 각도, 밝기 등을 설정할 수 있다. 여기에서, 상 기 촬영장치의 종류에 따라 각도, 밝기 및 초점거리 등의 설정이 변경될 수 있다. 따라서 본 발명의 실시예에 무인 비행장치는 비행을 수행하면서 검출모듈을 통해 실시간으로 등검은 말벌집을 검출하므로, 실시간으로 정확한 정보를 제공하여 등검은말벌집을 제거할 수 있다. 검출모듈의 제2 통신부는 드론모듈의 실시간 위치정보를 수신할 수 있고, 상기 비행 경로를 송 신할 수 있다. 또한 제2 통신부는 드론모듈과 지상 관제부(Ground Control System, GCS), 서버 등을 포함하는 여러 장비와 각종 정보를 송수신할 수 있다. 예를 들어, 제2 통신부는 영상부에서 수집한 상기 항공영상과 이에 대응하는 위치정보와 함께 여러 장비로 송신할 수 있다. 그리고 제2 통신부는 검출부에서 검출된 등검은말벌집의 정보 및 제어부 에서 생성된 상기 비행 경로 등을 여러 장비로 실시간으로 송신할 수 있다. 여기에서, 제2 통신부는 무선 통신이 가능한 텔레메트리 기술 및 LTE 라우터(Router)를 사용하는 것이 바 람직하다. 검출모듈의 제2 전원부는 탈부착이 가능하며, PC용 리튬폴리머 3셀(3S1P) 배터리(12 V, 5 A)일 수 있 고, 검출모듈에 전원을 공급할 수 있다. 도 3은 본 발명의 일 실시예에 따른 등검은말벌집 탐지 시스템의 구성도이다. 도 3을 참조하면, 본 발명의 등검은말벌집 탐지 시스템은 무인 비행장치, 비행 제어부, 관리 서 버, 사용자 단말 및 방제 비행장치를 포함할 수 있다. 무인 비행장치는 도 1 및 도 2의 설명을 포함하는 장치로, 비행 환경정보 및 항공영상을 수집하고, 등검은 말벌집을 검출할 수 있다. 또한, 무인 비행장치는 하나 이상으로 구성되어 군집 비행이 가능하다. 무인 비 행장치가 군집 비행을 하는 경우에는 넓은 범위의 지역에서 등검은말벌집을 검출할 수 있다. 예를 들어, 상기 군집 비행 중에 무인 비행장치가 등검은말벌집을 발견하는 경우에, 발견한 등검은말벌집 을 정밀하게 확인하는 부수적 작업이 필요하다. 그러면 군집 비행을 하고 있지 않는 새로운 무인 비행장치(10 0)를 군집 비행하고 있는 지역으로 개별 비행을 지원할 수 있으며, 상기 개별 비행하는 무인 비행장치는 정밀한 탐색 동작을 수행하거나 또는 방제 작업을 수행할 있다. 여기에서, 상기 개별 비행하는 무인 비행장치 가 상기 군집 비행의 이동 경로를 방해하지 않도록 비행 제어부 또는 관리 서버는 독립적인 비 행 경로를 설정할 수 있다. 또한, 관리 서버는 무인 비행장치에 대한 비행 정보들을 실시간으로 저장할 수 있고, 무인 비행장치 의 군집 비행 중이거나 수동 비행을 하고 있는 도중에, 관리 서버는 개별 비행하는 하나 이상의 무인 비행장치를 추가적으로 투입하여 작업을 지원하므로, 효율성 높은 작업을 수행할 수 있다. 또한, 무인 비행장치는 객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출할 수 있고, 검출된 위치로 비행 경로를 생성할 수 있다. 그리고 무인 비행장치는 상기 비행 경로로 이동하여 검 출된 위치 중심의 다각도 항공영상을 수집할 수 있다. 도 2의 설명과 같이, 상기 객체 탐지 학습 알고리즘은 기계학습 알고리즘, YOLO(You Only Look Once) 학습 알고 리즘 중 적어도 하나 이상을 포함할 수 있으나, 이에 한정 하지 않는다. 즉, 상기 객체 탐지 학습 알고리즘은 등검은말벌집을 탐지하여 학습이 가능한 알고리즘이면 모두 가능하다. 비행 제어부는 무인 비행장치의 비행 경로를 설정하고, 실시간으로 비행 동작을 제어할 수 있다. 도 4는 본 발명의 일 실시예에 따른 등검은말벌집 탐지 시스템의 비행 제어부에 대한 블럭구성도이다. 도 4를 참조하면, 비행 제어부는 비행 설정부, 영상 제어부, 경로 생성부, 출력부 및 통신부를 포함할 수 있다. 비행 제어부의 비행 설정부는 무인 비행장치의 자동 비행을 설정하거나 수동 비행을 설정할 수 있다. 여기에서 비행 제어부는 무인 비행체의 비행 명령을 입력하는 무선 조종기 및 지상 관제부(GCS)를 포함할 수 있고, 비행 제어 프로그램 QGroundControl을 사용할 수 있다. 구체적으로, 비행 설정부는 무인 비행장치가 군집 비행하는 경우에, 기설정된 비행 경로로 이동하는 자동 비행으로 설정할 수 있다. 그러나 이에 한정하지 않고, 상황에 따라 사용자가 수동 비행 또는 자동 비행을 설정할 수 있다. 여기에서, 자동 비행은 GPS 기반의 비행 경로로 무인 비행장치가 비행을 수행하는 것이다. 예를 들어, 군 집 비행을 하는 경우에 자동 비행으로 설정하면, 무인 비행장치들은 지상과 일정한 높이를 유지하도록 일 정한 고도로 비행이 가능하고 장애물 충돌로 위한 위험도를 낮출 수 있다. 여기에서, 일정한 고도는 지표면으로 부터 40 내지 60 m인 것이 바람직하나 이에 한정하지 않는다. 따라서 무인 비행장치는 일정한 고도에서 등 검은말벌집의 검출에 적합한 항공영상을 촬영할 수 있고, 비행 경로에 대한 안정성과 신속성을 확보할 수 있다. 반면에 비행 설정부의 수동 비행 동작은 사용자가 무선 조종기를 사용하여 무인 비행장치를 수동으로 조종하는 것이다. 도 5는 본 발명의 일 실시예에 따른 비행 제어부의 자동 비행 설정에 대한 예시이다. 도 5를 참조하면, 비행 설정부가 자동 비행 동작을 설정하면, 디스플레이에 표시된 경로로 무인 비행장치 를 이동시킬 수 있다. 비행 제어부의 영상 제어부는 무인 비행장치의 고도정보를 기반으로 무인 비행장치의 카메 라 각도, 밝기 및 초점거리 등을 제어할 수 있다. 구체적으로, 무인 비행장치의 고도가 높은 경우에는 항 공영상에서 등검은말벌집 검출이 용이하도록 영상부 카메라의 초점거리를 증가시키거나 밝기, 각도 등을 조절하여 상기 항공영상의 해상도를 제어할 수 있다. 반면에 무인 비행장치의 고도가 낮으면, 영상부 카메라의 초점거리를 감소시키거나 밝기, 각도 등을 조절하여 상기 항공영상의 해상도를 제어할 수 있다. 그러 면 상기 항공영상은 상기 객체 탐지 학습 알고리즘 적용에 적합한 이미지 크기가 될 수 있고, 등검은말벌집 검 출의 정확도가 향상될 수 있다. 여기에서, 상기 객체 탐지 학습 알고리즘 적용에 적합한 이미지 크기는 상술한 실험데이터 표 1 및 표 2의 결과 를 활용하여 설정할 수 있고, 상기 이미지 크기를 기반으로 무인 비행장치의 비행 임계고도에 대응하는 카 메라의 각도, 밝기 및 초점거리 등을 영상 제어부가 설정할 수 있다. 예를 들어, 상기 비행 임계고도는 지 표면으로부터 40 내지 60 m인 것이 바람직하며, 상기 항공영상의 크기가 해상도 3840×2160 픽셀을 가지도록 영 상부 카메라의 각도, 밝기 및 초점거리를 설정하는 것이 바람직하나, 이에 한정하지 않는다. 비행 제어부의 경로 생성부는 비행 환경정보 및 무인 비행장치의 GPS 위치정보를 기반으로 상기 비행 경로를 생성할 수 있다. 상기 비행 임계고도는 지표면으로부터 40 내지 60 m인 것이 바람직하나, 이에 한 정하지 않는다. 예를 들어, 경로 생성부는 수동 비행 동작인 경우에는 사용자가 입력하는 비행 경로를 생성하여 통신부 를 통해 실시간으로 무인 비행장치에 송신할 수 있다. 반면에 자동 비행 동작인 경우에는 경로 생성 부가 상기 비행 환경정보 및 상기 GPS 위치정보를 기반으로 장애물을 피할 수 있는 최적의 비행 경로를 생 성할 수 있다. 비행 제어부의 출력부는 실시간으로 상기 무인 비행장치의 위치정보 및 상기 비행 환경정보를 출력할 수 있다. 또한, 출력부는 경로 생성부에서 생성된 실시간 비행 경로, 무인 비행장치로부 터 수신된 검출된 등검은말벌집의 정보 등도 출력할 수 있다. 예를 들어, 사용자가 출력부로 검출된 등검 은말벌집의 정보를 확인하여 수동 비행 동작으로 설정함으로써, 무인 비행장치가 등검은말벌집으로 비행하 도록 제어할 수 있다. 비행 제어부의 통신부는 무선 통신이 가능한 텔레메트리 기술을 사용하여 무인 비행장치 및 관 리 서버와 각종 정보를 송수신할 수 있다. 예를 들어, 통신부는 상기 비행 경로를 실시간으로 송신하여 무인 비행장치를 이동시킬 수 있고, 무 인 비행장치의 고도정보를 송신하여 무인 비행장치에 부착된 영상부 카메라의 각도, 밝기 및 초 점거리를 제어할 수 있다. 또한, 통신부는 무인 비행장치가 수집한 각종 영상 및 위치 정보들(비행환 경 정보, 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보 등)을 수신할 수 있다. 비행 제어부는 무인 비행장치가 현재 촬영하고 있는 특정 장소의 GPS 위치정보 및 고도정보를 통신부 를 통해 관리 서버로 송신하고, 상기 특정 장소의 지형 정보 또는 과거에 기저장된 상기 특정 장소의 항공영상 정보를 관리 서버로부터 수신할 수 있다. 그러면, 수신한 상기 특정 장소의 지형 정보 및 상기 고도정보 또는 상기 특정 장소의 기저장된 과거 항공영상 정보 및 상기 고도정보를 기반으로 영상 제어부는 무인 비행장치의 카메라 각도, 밝기 및 초점거리를 제어할 수 있다. 예를 들어, 영상 제어부는 상기 특정 장소가 어둡고, 경사진 지형이라는 지형 정보 또는 기저장된 과거 항공영상 정보를 수신하는 경우에 상기 카메라의 촬영 밝기를 높일 수 있고, 상기 특정 장소의 경사에 따라 상기 고도정보에 따른 초점거리 및 각도를 촬영에 적합하도록 제어할 수 있다. 상술한 제어를 통해 무인 비행장치는 해상도 3840×2160 픽셀을 가지는 상기 항공영상이 수집할 수 있고, 등검은말벌집의 검출 이 용이할 수 있다. 일 실시예에서, 제어부는 기저장된 과거 특정 장소의 항공 영상 정보 및 고도정보뿐만 아니라 특정 장소에 서 과거에 검출된 등검은말벌집의 검출 이력에 기초하여, 해당 특정 장소의 고도정보를 추가적으로 조절하고, 이에 따라 초첨거리 및 각도를 제어할 수 있다. 예를 들어, 제어부는 과거에 등검은말벌집 검출 이력이 많 은 경우 고도를 낮추어 비행하도록 고도정보를 생성하고, 초첨거리 및 각도를 이와 함께 조절할 수 있다. 상술한 바와 같이 본 발명인 등검은말벌집 탐지 시스템은 무인 비행장치가 비행하는 특정 장소의 특성 에 맞춰 무인 비행장치의 카메라 각도, 밝기 및 초점거리를 제어하므로, 등검은말벌집의 검출 정확도를 향 상시킬 수 있다. 또한, 또는 관리 서버로부터 과거에 등검은말벌집이 검출된 장소들을 수신하고, 경로 생성부는 과거 에 등검은말벌집이 검출된 장소로 무인 비행장치의 비행 경로를 생성할 수 있다. 즉, 경로 생성부는 등검은말벌 서식지의 특성을 고려하여 상기 비행 경로를 설정할 수 있고, 상기 비행 경로에 따른 항공영상을 수 집하여 등검은말벌집을 정확히 검출할 수 있다. 관리 서버는 상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보를 수신하 여 저장할 수 있다. 예를 들어, 상술한 무인 비행장치의 제1 통신부 및 제2 통신부를 통하여 상기 정보들을 수신할 수 있고, 이를 데이터베이스에 저장할 수 있다. 여기에서, 관리 서버의 통신 장치는 근거리 통신망인 이더 넷(ethernet)일 수 있고, 데이터베이스 관리 시스템은 마이에스큐엘(MySQL)일 수 있으나 이에 한정하지 않는다. 또한, 관리 서버는 통신 장치를 통하여 사용자 단말에 검출된 등검은말벌집의 위치정보 및 영상정보 에 대한 알림을 송신할 수 있다. 또는 웹 서버에 상기 알림을 업로드하여 사용자에게 공유할 수 있다. 여기에서 상기 웹 서버는 애플리케이션 개발에 사용되는 소프트웨어 플랫폼 Node.js를 사용할 수 있으나 이에 한정하지 않는다. 관리 서버는 방제 비행장치가 등검은말벌집의 방제를 완료하는 경우에, 방제가 완료된 위치정보를 수 신할 수 있다. 그 다음 관리 서버는 데이터베이스에 저장된 상기 위치정보에 대응하는 등검은말벌집의 영상정보를 삭제할 수 있다. 즉, 관리 서버는 등검은말벌집의 상태를 업데이트하여 효율적으로 관리할 수 있다. 그리고 관리 서버(30 0)의 데이터베이스를 활용하여 등검은말벌의 연구에 이용할 수 있다. 사용자 단말은 상기 등검은말벌집의 위치정보 및 영상정보를 수신하여 알림을 출력할 수 있다. 예를 들어, 사용자 단말은 PC 또는 스마트폰, 태블릿 등 무선통신이 가능한 모바일 기기를 포함할 수 있다. 그리고 사 용자 단말의 디스플레이에 상기 등검은말벌집의 위치정보 및 영상정보를 출력할 수 있다. 도 6은 본 발명의 일 실시예에 따른 사용자 단말의 등검은말벌집 검출 알림에 대한 예시이다. 도 6을 참조 하면, 사용자 단말은 디스플레이에 검출된 등검은말벌집의 위치 지도 및 이에 대한 항공영상을 출력하여 사용자에게 실시간으로 알려줄 수 있다. 따라서 사용자 단말은 등검은말벌집을 제거할 수 있도록 사용자에게 실시간으로 정확한 정보를 제공할 수 있다. 방제 비행장치는 검출된 등검은말벌집의 위치로 향하는 비행 경로를 수신하여 비행할 수 있고, 무인으로 방제를 수행할 수 있다. 또한, 방제 비행장치는 무인 비행장치가 수행할 수 있다. 예를 들어, 방제 비행장치가 등검은말벌집의 방제를 완료하는 경우에, 관리 서버로 방제가 완료된 위 치정보를 송신할 수 있다. 상술한 바와 같이, 상기 무인 비행장치를 포함하는 등검은말벌집 탐지 시스템은 등검은말벌집을 정확하게 탐색하여 제거할 수 있다. 또한, 본 발명의 실시예인 등검은말벌집 탐지 시스템은 등검은말벌집 뿐만 아니라 다양한 객체 검출에 활용 될 수 있다. 도 7은 본 발명의 일 실시예에 따른 등검은말벌집 탐지 방법의 순서도이다. 도 7을 참조하면, 등검은말벌집 탐지 방법은 S701 내지 S713 단계를 포함할 수 있다. S701 내지 S703 단계에서, 복수 개의 무인 비행장치가 자동 비행 유무에 따라 군집 비행을 설정하거나 개 별 비행을 설정할 수 있다. 군집 비행의 경우에는 복수 개의 무인 비행장치가 광범위한 지역을 탐색할 수 있다. 그리고 상기 군집 비행 중에 무인 비행장치가 등검은말벌집을 발견하는 경우에, 발견한 등검은말벌집을 정 밀하게 확인하는 부수적 작업이 필요하다. 그러면 군집 비행을 하고 있지 않는 새로운 무인 비행장치를 군 집 비행하고 있는 지역으로 개별 비행을 지원할 수 있으며, 상기 개별 비행하는 무인 비행장치는 정밀한 탐색 동작을 수행하거나 또는 방제 작업을 수행할 있다. 여기에서, 상기 개별 비행하는 무인 비행장치가 상기 군집 비행의 이동 경로를 방해하지 않도록 비행 제어부 또는 관리 서버는 독립적인 비행 경로를 설정할 수 있다. 또한, 관리 서버는 무인 비행장치에 대한 비행 정보들을 실시간으로 저장할 수 있고, 무인 비행장치 의 군집 비행 중이거나 수동 비행을 하고 있는 도중에, 관리 서버는 개별 비행하는 하나 이상의 무인 비행장치를 추가적으로 투입하여 작업을 지원하므로, 효율성 높은 작업을 수행할 수 있다. 구체적으로, S701 단계에서, 무인 비행장치가 수동 비행 또는 자동 비행인지 판단할 수 있다. 무인 비행장 치가 수동 비행이면, S706 단계에서, 비행 환경정보 및 항공영상을 수집할 수 있다. 반면에 무인 비행장치가 자동 비행인 경우, S702단계에서 군집 비행인지 판단할 수 있다. S702단계에서, 무인 비행장치가 군집 비행이 아닌 경우에는 S703 단계에 개별 비행 동작을 선택할 수 있고, 그 다음 S704 단계에서, 각각의 무인 비행장치의 비행 고도 수치가 몇 m인지 판단할 수 있다. 무인 비행장치가 군집 비행인 경우에는 바로 S704 단계에서, 군집의 무인 비행장치가 비행 고도 수치 가 몇 m인지 판단할 수 있다. S704 단계에서, 비행 고도 수치를 판단할 수 있다. 그러면 S705 단계에서, 비행 고도 수치에 대응하는 카메라 각도, 밝기 및 초점거리를 조절할 수 있다. 예를 들어, 무인 비행장치의 고도가 높은 경우에는 항공영상에서 등검은말벌집 검출이 용이하도록 영상부 카메라의 초점거리를 증가시키거나 밝기, 각도 등을 조절하여 상기 항공영상의 해상도를 제어할 수 있다. 반면에 무인 비행장치의 고도가 낮으면, 영상부 카메라의 초점거리를 감소시키거나 밝기, 각도 등을 조절하여 상기 항공영상의 해상도를 제어할 수 있다. 그러면 상기 항공영상은 상기 객체 탐지 학습 알고리즘 적 용에 적합한 이미지 크기가 될 수 있고, 등검은말벌집 검출의 정확도가 향상될 수 있다. 여기에서, 상기 객체 탐지 학습 알고리즘 적용에 적합한 이미지 크기는 상술한 실험데이터 표 1 및 표 2의 결과 를 활용하여 설정할 수 있으며, 상기 이미지 크기가 해상도 3840×2160 픽셀인 것이 바람직하나 이에 한정하지 않는다. 상기 이미지 크기를 기반으로 무인 비행장치의 비행 임계고도에 대응하여 각도, 밝기 및 초점거리 를 설정할 수 있다. 예를 들어, 상기 비행 임계고도는 지표면으로부터 40 내지 60 m이고, 상기 이미지 크기가 해상도 3840×2160 픽셀을 가지도록 카메라의 각도, 밝기 및 초점거리를 설정하는 것이 바람직하나 이제 한정하 지 않는다. 그 다음 S706 단계에서, 무인 비행장치가 비행 환경정보 및 항공영상을 수집할 수 있다. S707 내지 S708 단계에서, 객체 탐지 학습 알고리즘을 이용하여 상기 항공영상에서 등검은말벌집을 검출할 수 있다. S707 단계에서, 수집한 상기 항공영상을 객체 탐지 학습 알고리즘에 적용할 수 있다. 상기 객체 탐지 학습 알고 리즘은 기계학습 알고리즘, YOLO(You Only Look Once) 학습 알고리즘 중 적어도 하나 이상을 포함할 수 있다. 그리고 S708 단계에서, 학습된 상기 항공영상에서 등검은말벌집이 검출되는지 판단할 수 있다. 등검은말벌집이 검출되지 않은 경우에는 S713 단계에서, 무인 비행장치가 자동 또는 수동으로 설정된 비행을 완료했는지 판단될 수 있다. 반면에 등검은말벌집이 검출되는 경우에는, S709 단계에서, 상기 비행 환경정보 및 상기 항공영상을 기반으로 비행 경로를 설정할 수 있다. 상기 비행 경로는 검출된 등검은말벌집의 위치로 이동하는 경로일 수 있고, 상기 비행 환경정보를 기반으로 장 애물 충돌없이 무인 비행장치가 등검은말벌집으로 이동할 수 있다. S710 단계에서, 무인 비행장치가 상기 비행 환경정보, 상기 항공영상, 검출된 등검은말벌집의 위치정보 및 영상정보를 저장할 수 있다. 상기 저장된 정보들을 활용하여 등검은말벌의 연구에 이용할 수 있다. S711 단계에서, 검출된 등검은말벌집의 상기 위치정보 및 상기 영상정보의 알림이 사용자에게 출력될 수 있다. 즉, 무선 통신을 통해 사용자 단말, 관리 서버 등으로 정보가 출력될 수 있다. S712 단계에서, 방제 비행장치가 검출된 등검은말벌집의 상기 위치정보를 기반으로 방제를 수행할 수 있다. 방제가 완료되면, S713 단계에서, 무인 비행장치 또는 방제 비행장치가 자동 또는 수동으로 설정된 비행을 완료했는지 판단될 수 있다. 무인 비행장치가 설정에 따른 비행을 완료한 경우에는 등검은말벌집 탐지를 종료할 수 있다. 반면에 무인 비행장치 또는 방제 비행장치가 설정에 따른 비행을 완료하지 않은 경우에는 S706 단계부터 반복 수행할 수 있다. 따라서 상술한 바와 같이, 등검은말벌집 탐지 방법은 등검은말벌집을 정확하게 탐색하여 제거할 수 있다. 상술한 내용은 본 발명을 실시하기 위한 구체적인 실시 예들이다. 본 발명은 상술한 실시 예들 이외에도, 단순 하게 설계 변경되거나 용이하게 변경할 수 있는 실시 예들도 포함될 것이다. 또한, 본 발명은 실시 예들을 이용 하여 용이하게 변형하여 실시할 수 있는 기술들도 포함될 것이다. 따라서, 본 발명의 범위는 상술한 실시 예들 에 국한되어 정해져서는 안되며, 후술하는 특허청구범위뿐만 아니라 이 발명의 특허청구범위와 균등한 것들에 의해 정해져야 할 것이다."}
{"patent_id": "10-2023-0061893", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 무인비행 장치의 블럭구성도이다. 도 2는 본 발명의 일 실시예에 따른 검출모듈이 객체 탐지 학습 알고리즘을 이용하여 등검은말벌집을 검 출한 실험결과에 대한 사진이다. 도 3은 본 발명의 일 실시예에 따른 등검은말벌집 탐지 시스템의 구성도이다. 도 4는 본 발명의 일 실시예에 따른 등검은말벌집 탐지 시스템의 비행 제어부에 대한 블럭구성도이다. 도 5는 본 발명의 일 실시예에 따른 비행 제어부의 자동 비행 설정에 대한 예시이다. 도 6은 본 발명의 일 실시예에 따른 사용자 단말의 등검은말벌집 검출 알림에 대한 예시이다. 도 7은 본 발명의 일 실시예에 따른 등검은말벌집 탐지 방법의 순서도이다."}
