{"patent_id": "10-2022-0130538", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0050759", "출원번호": "10-2022-0130538", "발명의 명칭": "인공지능 모델을 이용한 교통사고 모니터링 방법", "출원인": "호남대학교 산학협력단", "발명자": "이상현"}}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "CCTV 영상을 수집하는 단계;상기 CCTV 영상에서 도로의 경계선 및 이동체를 각각 식별하는 단계; 및상기 이동체와 상기 경계선 사이의 거리에 따라 상기 CCTV 영상을 가공하여 모니터링 영상을 생성하는 단계를포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 도로의 경계선을 식별하는 단계는상기 CCTV 영상 내 엣지(edge)를 검출하여 상기 경계선을 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 도로의 경계선을 식별하는 단계는상기 CCTV 영상에 엣지 검출 알고리즘을 적용하여 상기 CCTV 영상 내 복수의 엣지를 검출하는 단계와,상기 검출된 복수의 엣지에 허프 변환(Hough transform)을 적용하여 상기 경계선을 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 경계선을 식별하는 단계는상기 검출된 복수의 엣지에 허프 변환을 적용하여 복수의 직선을 식별하는 단계와,상기 복수의 직선 중 상기 도로의 방향에 대응하는 적어도 하나의 직선을 상기 경계선으로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 경계선을 식별하는 단계는상기 복수의 직선의 수직 및 수평 성분 중 상기 도로의 방향에 대응하는 어느 한 성분이 타 성분보다 기준값 이공개특허 10-2024-0050759-3-상으로 큰 직선을 상기 경계선으로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 경계선을 식별하는 단계는상기 복수의 직선 전체의 수직 및 수평 성분 중 더 큰 성분을 식별하고, 상기 복수의 직선 중에서 상기 식별된어느 한 성분이 타 성분보다 기준값 이상으로 큰 직선을 상기 경계선으로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 경계선을 식별하는 단계는상기 복수의 직선 중 도로의 방향에 대응하는 각도와의 유사도가 기준값 이상인 각도를 갖는 직선을 상기 경계선으로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 경계선을 식별하는 단계는상기 복수의 직선 중 가장 긴 직선 및 상기 가장 긴 직선의 각도와의 유사도가 기준값 이상인 각도를 갖는 다른직선을 상기 경계선으로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 이동체를 식별하는 단계는상기 CCTV 영상을 객체 탐지(object detection) 신경망 모델에 입력하여 상기 이동체를 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 이동체를 식별하는 단계는상기 CCTV 영상을 신경망 모델에 입력하여 복수 객체를 식별하는 단계와,상기 식별된 복수 객체 중 프레임 변화에 따른 이동거리가 기준값 이상인 객체를 상기 이동체로 식별하는 단계공개특허 10-2024-0050759-4-를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 이동체를 식별하는 단계는상기 CCTV 영상을 신경망 모델에 입력하여 복수 객체를 식별하는 단계와,상기 식별된 복수 객체 중 상기 경계선 밖에 위치한 적어도 하나의 객체를 식별하는 단계와,상기 식별된 적어도 하나의 객체 중 프레임 변화에 따른 이동거리가 기준값 이상인 객체를 상기 이동체로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 이동체를 식별하는 단계는상기 CCTV 영상을 신경망 모델에 입력하여 복수 객체를 식별하는 단계와,상기 식별된 복수 객체 중 이동방향이 상기 경계선을 향하는 적어도 하나의 객체를 상기 이동체로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 이동체를 식별하는 단계는상기 식별된 복수의 객체 중 이동벡터의 방향이 상기 경계선과 수직인 방향과 기준값 이상으로 유사한 적어도하나의 객체를 상기 이동체로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 이동체를 식별하는 단계는상기 식별된 복수의 객체에서 이동벡터의 수직 및 수평 성분 중 더 적은 어느 한 성분이 타 성분보다 큰 객체를상기 이동체로 식별하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,공개특허 10-2024-0050759-5-상기 모니터링 영상을 생성하는 단계는상기 이동체와 상기 경계선 간 거리의 부호가 바뀌는 시점을 포함하는 CCTV 영상을 분할하여 상기 모니터링 영상을 생성하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,상기 모니터링 영상을 생성하는 단계는상기 이동체와 상기 경계선 사이의 거리가 기준 프레임 내 기준 거리 이상으로 가까워지는 시점을 포함하는CCTV 영상을 분할하여 상기 모니터링 영상을 생성하는 단계를 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 모니터링 영상을 상기 CCTV 영상과 분리 저장하는 단계를 더 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,상기 모니터링 영상을 관제 서버에 송신하는 단계를 더 포함하는교통사고 모니터링 방법."}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 CCTV 영상을 인공지능 모델로 분석하여 사고 위험 상황을 탐지하고, 위험 상황에 대한 모니터링 영상 을 별도로 저장 및 관리하여 사고 예방 및 사고 조치를 용이하게 하는 방법에 관한 것이다. 본 발명의 일 실시예 에 따른 교통사고 모니터링 방법은 CCTV 영상을 수집하는 단계, 상기 CCTV 영상에서 도로의 경계선 및 이동체를 각각 식별하는 단계 및 상기 이동체와 상기 경계선 사이의 거리에 따라 상기 CCTV 영상을 가공하여 모니터링 영 상을 생성하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 CCTV 영상을 인공지능 모델로 분석하여 사고 위험 상황을 탐지하고, 위험 상황에 대한 모니터링 영상 을 별도로 저장 및 관리하여 사고 예방 및 사고 조치를 용이하게 하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "한국 도로교통공단의 2021년도 TAAS(Traffic Accident Analysis System) 교통자료에 따르면 2020년 교통사고 21만건 중 사망자 수는 3,081명, 부상자 수는 약 30만명이며, 이중 무단횡단 교통사고에 의한 사망자 수는 336 명으로 전체 사망자의 10.9%에 달한다. 이와 같이 무단횡단 교통사고는 가장 많은 사망자가 발생하는 사고 유형인데, 무단횡단 교통사고는 운전자가 아 무리 주위를 기울인다고 하더라도 보행자가 신호를 무시하거나 횡단보도를 이용하지 않고 길을 건너는 경우 불 가피하게 발생하는 경우가 많다. 그럼에도 불구하고, 현재 국내 무단횡단 교통사고 예방을 위한 인프라는 매우 부족하며 국내 대표적인 지능형 교통시스템인 ITS(Interlligent Transport System) 역시 V2I(Vehicle to Infra)에 기반하므로, 보행자 중심의 지능적인 위험 탐지가 이루어지지 않고 있다는 문제가 있다. 이에 따라, 도로 주변의 보행자의 움직임을 모니터링하여 교통사고를 방지하고, 사고가 발생하더라도 사고 전후 의 보행자의 움직임을 파악하여 사고 원인을 규명하고 빠른 조치를 가능케하는 기술이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-2322831호(2021.11.01.)"}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 CCTV 영상을 인공지능 모델로 분석하여 보행자 및 차량의 이동을 분석하고 위험도가 높은 상황의 CCTV 영상을 모니터링 영상으로 별도 관리하는 것을 목적으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 교통사고 모니터링 방법은 CCTV 영상을 수집하는 단계, 상기 CCTV 영상에서 도로의 경계선 및 이동체를 각각 식별하는 단계 및 상기 이동 체와 상기 경계선 사이의 거리에 따라 상기 CCTV 영상을 가공하여 모니터링 영상을 생성하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 도로의 경계선을 식별하는 단계는 상기 CCTV 영상 내 엣지(edge)를 검출하여 상기 경계선 을 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 도로의 경계선을 식별하는 단계는, 상기 CCTV 영상에 엣지 검출 알고리즘을 적용하여 상기 CCTV 영상 내 복수의 엣지를 검출하는 단계와, 상기 검출된 복수의 엣지에 허프 변환(Hough transform)을 적용 하여 상기 경계선을 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 경계선을 식별하는 단계는, 상기 검출된 복수의 엣지에 허프 변환을 적용하여 복수의 직선 을 식별하는 단계와, 상기 복수의 직선 중 상기 도로의 방향에 대응하는 적어도 하나의 직선을 상기 경계선으로 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 경계선을 식별하는 단계는, 상기 복수의 직선의 수직 및 수평 성분 중 상기 도로의 방향에 대응하는 어느 한 성분이 타 성분보다 기준값 이상으로 큰 직선을 상기 경계선으로 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 경계선을 식별하는 단계는, 상기 복수의 직선 전체의 수직 및 수평 성분 중 더 큰 성분을 식별하고, 상기 복수의 직선 중에서 상기 식별된 어느 한 성분이 타 성분보다 기준값 이상으로 큰 직선을 상기 경계선으로 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 경계선을 식별하는 단계는, 상기 복수의 직선 중 도로의 방향에 대응하는 각도와의 유사도 가 기준값 이상인 각도를 갖는 직선을 상기 경계선으로 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 경계선을 식별하는 단계는, 상기 복수의 직선 중 가장 긴 직선 및 상기 가장 긴 직선의 각 도와의 유사도가 기준값 이상인 각도를 갖는 다른 직선을 상기 경계선으로 식별하는 단계를 포함하는 것을 특징 으로 한다. 일 실시예에서, 상기 이동체를 식별하는 단계는, 상기 CCTV 영상을 객체 탐지(object detection) 신경망 모델에 입력하여 상기 이동체를 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 이동체를 식별하는 단계는, 상기 CCTV 영상을 신경망 모델에 입력하여 복수 객체를 식별하 는 단계와, 상기 식별된 복수 객체 중 프레임 변화에 따른 이동거리가 기준값 이상인 객체를 상기 이동체로 식 별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 이동체를 식별하는 단계는, 상기 CCTV 영상을 신경망 모델에 입력하여 복수 객체를 식별하 는 단계와, 상기 식별된 복수 객체 중 상기 경계선 밖에 위치한 적어도 하나의 객체를 식별하는 단계와, 상기 식별된 적어도 하나의 객체 중 프레임 변화에 따른 이동거리가 기준값 이상인 객체를 상기 이동체로 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 이동체를 식별하는 단계는, 상기 CCTV 영상을 신경망 모델에 입력하여 복수 객체를 식별하 는 단계와, 상기 식별된 복수 객체 중 이동방향이 상기 경계선을 향하는 적어도 하나의 객체를 상기 이동체로 식별하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 이동체를 식별하는 단계는, 상기 식별된 복수의 객체 중 이동벡터의 방향이 상기 경계선과 수직인 방향과 기준값 이상으로 유사한 적어도 하나의 객체를 상기 이동체로 식별하는 단계를 포함하는 것을 특 징으로 한다. 일 실시예에서, 상기 이동체를 식별하는 단계는, 상기 식별된 복수의 객체에서 이동벡터의 수직 및 수평 성분 중 더 적은 어느 한 성분이 타 성분보다 큰 객체를 상기 이동체로 식별하는 단계를 포함하는 것을 특징으로 한 다. 일 실시예에서, 상기 모니터링 영상을 생성하는 단계는, 상기 이동체와 상기 경계선 간 거리의 부호가 바뀌는 시점을 포함하는 CCTV 영상을 분할하여 상기 모니터링 영상을 생성하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 모니터링 영상을 생성하는 단계는, 상기 이동체와 상기 경계선 사이의 거리가 기준 프레임 내 기준 거리 이상으로 가까워지는 시점을 포함하는 CCTV 영상을 분할하여 상기 모니터링 영상을 생성하는 단계 를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 모니터링 영상을 상기 CCTV 영상과 분리 저장하는 단계를 더 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 모니터링 영상을 관제 서버에 송신하는 단계를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 CCTV 영상 내 보행자와 차량의 이동을 인공지능 모델로 분석함으로써 별도의 모니터링 인력 없이도 교통사고가 발생할 수 있는 다양한 위험 상황을 자동으로 감지할 수 있다. 또한, 본 발명은 위험도가 높은 상황의 CCTV 영상을 모니터링 영상으로 별도 관리함으로써 교통사고 예방 및 사 고 조치를 용이하게 하는 장점이 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용 하는 것으로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 또한, 본 명세서에서 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한, 본 명세서에서 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개 재\"되거나, 각 구성요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 본 명세서에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B를 의미하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 본 발명은 CCTV 영상을 인공지능 모델로 분석하여 보행자의 무단횡단을 탐지하고, 사고 발생 시 모니터링 영상 을 별도로 저장 및 관리하여 사고 조치를 용이하게 하는 방법에 관한 것이다. 이하, 도 1 내지 도 15를 참조하 여, 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 교통사고 모니터링 방법을 구체적으로 설명하도록 한 다. 도 1은 본 발명의 일 실시예에 따른 교통사고 모니터링 시스템을 도시한 도면이고, 도 2는 본 발명의 일 실시예 에 따른 인공지능 모델을 이용한 교통사고 모니터링 방법을 도시한 순서도이다. 도 3은 CCTV 영상의 일 예시를 도시한 도면, 도 4는 도 3에 도시된 CCTV 영상에서 검출된 엣지를 도시한 도면, 도 5는 도 4에 도시된 엣지에서 검출된 직선을 도시한 도면이고, 도 6은 도 5에 도시된 직선 중에서 식별된 경 계선을 도시한 도면이다. 도 7은 CCTV 영상의 다른 예시를 도시한 도면, 도 8은 도 7에 도시된 CCTV 영상을 통해 식별된 경계선을 도시한 도면이고, 도 9는 도 7에 도시된 CCTV 영상에서 식별된 경계선을 도시한 도면이다. 도 10는 본 발명에 적용되는 객체 검출 알고리즘을 도시한 도면이다. 도 11은 도 3에 도시된 CCTV 영상에서 검출된 객체를 도시한 도면이고, 도 12 내지 도 15는 CCTV 영상에서 이동 체를 식별하는 과정을 설명하기 위한 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 교통사고 모니터링 시스템은 프로세서, CCTV 및 관제 서버를 포함할 수 있다. 다만, 도 1에 도시된 교통사고 모니터링 시스템은 일 실시예에 따른 것이고, 발 명의 구성요소들이 도 1에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 구성요소가 부가, 변경 또 는 삭제될 수 있다 본 발명의 CCTV는 교통 정보를 수집하기 위해 도로 주변에 설치되어 도로 및 그 주변의 영상을 촬영할 수 있다. 한편, 관제 서버는 교통, 안전, 소방 등 도로에서 발생할 수 있는 다양한 이벤트를 관제하는 서버로 서, 예컨대 국토교통부, 소방청, 경찰청 등의 행정기관 서버이거나 이와 연동된 외부 서버일 수 있다. 프로세서는 본 발명의 교통사고 모니터링 방법을 수행하는 주체로서, 인공지능 모델을 이용하여 보행자의 거동을 파악하고 이에 기초하여 교통사고 예방 및 후속 조치를 위한 모니터링 영상을 생성할 수 있다. 이러한 동작을 위해 프로세서는 CPU(central processing unit), GPU(graphics processing unit) 등으로 구 현될 수 있으며, ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기(controller), 마이크로 컨트롤러(micro-controllers) 중 적어도 하나의 물리적인 요소를 포함할 수 있다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 교통사고 모니터링 방법(이하, 교통사고 모니터링 방법)은 CCTV 영상을 수집하는 단계(S10), CCTV 영상에서 도로 경계선 및 이동체를 각각 식별하는 단 계(S20), 이동체와 경계선 간의 거리에 따라 모니터링 영상을 생성하는 단계(S30), 모니터링 영상을 분리 저장 하는 단계(S40) 및 모니터링 영상을 관제 서버로 송신하는 단계(S50)를 포함할 수 있다. 다만, 도 2에 도시된 교통사고 모니터링 방법은 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 2에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 단계가 부가, 변경 또는 삭제될 수 있다. 이하, 도 2에 도시된 각 단계들을 구체적으로 설명하도록 한다. 프로세서는 CCTV로부터 CCTV 영상을 수집할 수 있다(S10). CCTV 영상은 CCTV에서 촬영 된 영상을 의미하며 도로 및 도로 주변이 촬영된 영상일 수 있다. 도 3을 참조하면, 일 예시에서 CCTV 영상에는 도로, 주행중인 차량, 인도, 가로수, 건물, 보행자 등이 촬 영될 수 있다. 프로세서는 CCTV 영상에서 도로의 경계선(B) 및 이동체를 각각 식별할 수 있는데(S20), 먼저 경계선 (B) 식별 동작에 대해 구체적으로 설명하도록 한다. 본 발명에서 경계선(B)은 CCTV 영상 내에서 도로를 구 획하는 선으로서, 예컨대 도로와 인도의 경계선(B)일 수 있다. 프로세서는 컴퓨터 비전 기술을 이용하여 CCTV 영상 내 엣지(edge)를 검출하여 경계선(B)을 식별할 수"}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "있다. 이를 위해 프로세서는 당해 기술분야에서 이용되는 다양한 엣지 검출(edge detection) 알고리즘을 이 용할 수 있고, 예컨대 캐니(canny) 엣지 검출 알고리즘을 적용하여 CCTV 영상 내 복수의 엣지를 검출할 수 있다. 도 4를 참조하면, CCTV 영상에 캐니 엣지 검출 알고리즘이 적용되면 CCTV 영상 내 모든 엣지(E), 예 컨대 도로, 주행중인 차량, 인도, 가로수, 건물, 보행자 등의 윤곽선이 검출될 수 있다. 다음으로, 프로세서는 검출된 복수의 엣지(E) 중에서 경계선(B)만을 검출하기 위해, 허프 변환(Hough transform)을 추가 적용할 수 있다. 구체적으로, 프로세서는 앞서 검출된 복수의 엣지(E)에 허프 선 변환을 적용하여 직선의 관계를 갖는 픽셀들, 즉 직선 상에 위치한 픽셀들을 식별할 수 있다. 허프 변환에서 검출 문턱값(threshold)은 CCTV 영상 내 크기가 작은 객체(예컨대, 차량, 보행자 등)를 구 성하는 직선은 검출하지 않고, 도로를 구획하는 경계선(B)만을 검출할 수 있도록 적절히 설정될 수 있다. 한편, 도 5를 참조하면 앞서 검출된 엣지(E)에 허프 변환을 적용하더라도 도로의 경계선(B)에 더하여 다른 직선 (L)들도 다수 검출될 수 있다. 이 직선(L)들 중에서 도로의 경계선(B)이 무엇인지 식별하기 위해 프로세서 는 아래와 같은 동작을 수행할 수 있다. 프로세서는 허프 변환을 적용하여 식별된 복수의 직선(L) 중, 도로의 방향에 대응하는 적어도 하나의 직선 (L)을 경계선(B)으로 식별할 수 있다. 도로의 방향에 대한 정보는 메모리에 미리 저장됨으로써 프로세서가 메모리를 참조하여 파악할 수도 있고, 프로세서가 CCTV 영상을 통해 추정할 수도 있다. 일 실시예에서, 도 3 및 도 5를 함께 참조하면, 프로세서는 도로의 방향이 수직 방향임을 메모리를 참조하 여 파악할 수 있다. 프로세서는 허프 변환을 통해 식별된 복수의 직선(L) 중 도로의 방향, 즉 수직 방향에 대응하는 적어도 하나의 직선(L)을 경계선(B)으로 식별할 수 있다. 이에 따라, CCTV 영상에서 식별된 복수 의 직선(L) 중에서 도로의 방향에 대응하는 직선(L)만이 경계선(B)으로 식별될 수 있다. 한편, 원근법에 따라 촬영된 CCTV 영상의 특징을 반영하여 프로세서는 허프 변환을 통해 식별된 복수 직선(L)의 수직 및 수평 성분 중 도로의 방향에 대응하는 어느 한 성분이 타 성분보다 기준값 이상으로 큰 직선 (L)을 경계선(B)으로 식별할 수 있다. 다시 도 3 및 도 5를 참조하면, 허프 변환을 통해 식별된 각각의 직선(L)들은 수직 및 수평 성분을 가질 수 있 다. 구체적으로, 특정 직선(L)의 위치 벡터(position vector)가 (x, y)인 경우 해당 직선(L)의 수평 성분은 x이 고 수직 성분은 y일 수 있다. 프로세서는 복수의 직선(L) 각각에 대한 수직 및 수평 성분을 식별할 수 있고, 도 3과 같이 도로의 방향이 수직 방향인 경우, 복수의 직선(L) 중 수직 방향의 성분이 수평 방향의 성분보다 기준값 이상으로 큰 직선(L)을 경계선(B)으로 식별할 수 있다. 반면에, 도 3과 달리 도로의 방향이 수평 방향인 경우, 프로세서는 복수의 직선(L) 중 수평 방향의 성분이 수직 방향의 성분보다 기준값 이상으로 큰 직선(L)을 경계선(B)으로 식별할 수 있다. 이에 따라, CCTV 영상에서 식별된 복수의 직선(L) 중에서 도로의 방향에 대응하는 직선(L)만이 경계 선(B)으로 식별될 수 있다. 도로는 CCTV 영상 내 촬영된 다른 객체들보다 길이가 긴 것이 일반적이므로, 원근법을 고려하더라도 도로 의 경계선(B)은 도로의 방향에 따른 경향성을 크게 가질 수 있다. 이에 따라, 본 발명에서 프로세서는 수직 및 수평 방향의 성분을 비교할 때 기준값의 마진을 둠으로써, 도로의 방향이 수직 방향일 때 수직 성분이 수평 성분보다 근소하게 큰(기준값 미만으로 큰) 직선(L)은 경계선(B)이 아니라고 판단할 수 있다. 다른 실시예에서, 도 3 및 도 5를 함께 참조하면, 프로세서는 CCTV 영상을 통해 도로의 방향을 추정하 고, 이에 기초하여 경계선(B)을 식별할 수 있다. 구체적으로, 프로세서는 복수의 직선(L) 전체의 수직 및 수평 성분 중 더 큰 어느 한 성분을 식별하고, 복수의 직선(L) 중에서 앞서 식별된 어느 한 성분이 타 성분보다 기준값 이상으로 큰 직선(L)을 경계선(B)으로 식별할 수 있다. 프로세서는 도 5에 도시된 각 직선(L)의 수직 및 수평 성분을 식별할 수 있다. 예컨대, 프로세서는 각 직선(L)의 위치 벡터((xn, yn), 여기서 n은 각 직선(L))를 특정함으로써 수직 성분(yn) 및 수평 성분(xn)을 식별 할 수 있다. 이어서, 프로세서는 각 직선(L)의 수직 성분을 모두 더하여 전체 수직 성분(y1+y2+…+yn)을 산 출할 수 있고, 각 직선(L)의 수평 성분을 모두 더하여 전체 수평 성분(x1+x2+…+xn)을 산출할 수 있다. 앞서 설명한 것과 같이 도로는 CCTV 영상 내 촬영된 다른 객체들보다 길이가 기므로, 도로의 방향의 수직 방향이 경우 전체 수직 성분(y1+y2+…+yn)은 전체 수평 성분(x1+x2+…+xn)보다 클 수 있고, 도로의 방향의 수평 방향인 경우 전체 수평 성분(x1+x2+…+xn)은 전체 수직 성분(y1+y2+…+yn)보다 클 수 있다. 이에 따라, 프로세서 는 전체 수직 성분(y1+y2+…+yn)과 전체 수평 성분(x1+x2+…+xn)을 비교하여 더 큰 어느 한 성분을 도로의 방 향으로 추정할 수 있다. 이어서, 프로세서는 복수의 직선(L) 중에서, 앞서 식별된 어느 한 성분이 타 성분보다 기준값 이상으로 큰 직선(L)을 경계선(B)으로 식별할 수 있고, 이에 따라, CCTV 영상에서 식별된 복수의 직선(L) 중에서 도로 의 방향에 대응하는 직선(L)만이 경계선(B)으로 식별될 수 있다. 한편, 수직 및 수평 성분의 비교를 통해 경계 선(B)을 식별하는 방법에 대해서는 전술한 바 있으므로 여기서는 자세한 설명을 생략하도록 한다. 도 6을 참조하면, 전술한 경계선(B) 식별 방법에 따라 도로와 인도를 구분하는 두 경계선(B)이 특정될 수 있고, 프로세서는 경계선(B)과 후술하는 이동체 간의 거리를 산출하기 위해 경계선(B)의 위치에 대한 정보를 메모 리에 저장할 수 있다. 한편, 도 3 내지 도 6에 도시된 CCTV 영상은 도로가 수직 방향으로 촬영된 것이므로 전술한 방법만으로도 정확한 경계선(B) 식별이 가능할 수 있다. 그러나, 도로가 대각선 방향을 따라 뻗어진 CCTV 영상의 경우추가적인 방법이 적용될 수 있다. 일 예에서 프로세서는 앞서 설명한 방식에 따라 식별된 복수의 직선(L) 중 도로의 방향에 대응하는 각도와 의 유사도가 기준값 이상인 각도를 갖는 직선(L)을 경계선(B)으로 식별할 수 있다. 도로의 방향에 대응하는 각 도 정보는 메모리에 미리 저장될 수도 있고, 프로세서가 CCTV 영상을 통해 직접 추정할 수도 있다. 일 실시예에서, 도 7을 참조하면, 프로세서는 메모리를 참조하여 도로의 방향에 대응하는 각도(이하, 도로 각도, θr)를 파악할 수 있다. 프로세서는 앞서 식별된 복수 직선(L)의 위치 벡터를 참조하여 각 직선(L)의 각도를 파악할 수 있고, 도로 각도(θr)와의 유사도가 기준값 이상인 각도를 갖는 직선(L)을 경계선(B)으로 식 별할 수 있다. 이에 따라, CCTV 영상에서 식별된 복수의 직선(L) 중에서 도로의 방향에 대응하는 직선(L) 만이 경계선(B)으로 식별될 수 있다. 도로는 CCTV 영상 내 촬영된 다른 객체들보다 길이가 긴 것이 일반적이므로, 도로의 경계선(B)은 도로 각 도(θr)에 따른 경향성을 크게 가질 수 있다. 이에 따라, 본 발명에서 프로세서는 각 직선(L)의 각도와 도 로 각도(θr)를 비교할 때 기준값의 마진을 둠으로써 도로 각도와 유사성이 높은 직선(L)만을 경계선(B)으로 판 단할 수 있다. 추가적으로 노이즈를 제거하기 위해, 프로세서는 도로 각도(θr)와 유사성이 높은 직선(L) 중에서도 그 길이가 기준값 이상인 직선(L)만을 경계선(B)으로 판단할 수 있다. 이에 따라, 그 길이가 짧아 도로의 경계선(B)이 아 닌 것으로 예상할 수 있는 직선(L)들은 제외될 수 있다. 다른 실시예에서, 프로세서는 CCTV 영상을 통해 도로 각도를 추정하고, 이에 기초하여 경계선(B)을 식 별할 수 있다. 구체적으로, 프로세서는 복수의 직선(L) 중 가장 긴 직선(L)을 식별하고, 식별된 직선(L)의 각도와 유사도가 기준값 이상인 각도를 갖는 다른 직선(L)을 경계선(B)으로 식별할 수 있다. 도 8을 참조하면, 프로세서는 예컨대 위치 벡터의 크기에 기초하여 복수의 직선 중 가장 긴 직선(이하 최장 직선, LL)을 식별할 수 있고, 최장 직선(LL)의 위치 벡터에 기초하여 최장 직선(LL)의 각도(θl)를 산출할 수 있다. 앞서 설명한 것과 같이 도로는 CCTV 영상 내 촬영된 다른 객체들보다 길이가 기므로, CCTV 영상 에서 식별된 최장 직선(LL)은 도로의 경계선(B)일 수 있고, 프로세서는 최장 직선(LL)의 각도(θl)를 도로의 각도로 추정할 수 있다. 이어서, 프로세서는 최장 직선(LL)의 각도(θl)와의 유사도가 기준값 이상인 각도를 갖는 직선(L)을 경계선 (B)으로 식별할 수 있고, 이에 따라, CCTV 영상에서 식별된 복수의 직선(L) 중에서 도로의 방향에 대응하 는 직선(L)만이 경계선(B)으로 식별될 수 있다. 한편, 이 때에도 노이즈 제거를 위해 프로세서는 최장 직선(LL)의 각도(θl)와 유사성이 높은 직선(L) 중에서도 그 길이가 기준값 이상인 직선(L)만을 경계선(B)으로 파악할 수 있다. 도 9를 참조하면, 전술한 경계선(B) 식별 방법에 따라 도로와 도로 밖을 구분하는 두 경계선(B)이 특정될 수 있 고, 프로세서는 후술하는 이동체와 경계선(B) 간의 거리를 산출하기 위해 경계선(B)의 위치에 대한 정보를 메모리에 저장할 수 있다. 이하, 프로세서의 이동체 식별 동작에 대해 구체적으로 설명하도록 한다. 본 발명에서 이동체는 CCTV 영상 내에서 프레임 변화에 따라 움직이는 객체를 의미하며, 예컨대 차량, 보행자, 자전거, 오토바이 등을 포 함할 수 있다. 프로세서는 신경망 모델을 이용하여 CCTV 영상 내 이동체를 식별할 수 있다. 구체적으로, 프로세 서는 컨볼루션 신경망(Convolutional Neural Network; CNN) 기반의 객체 탐지(object detection) 신경망 모델에 CCTV 영상을 입력하여 이동체를 식별할 수 있다."}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이를 위해, 프로세서는 당해 기술분야에서 이용되는 다양한 객체 검출 신경망 모델을 이용할 수 있으 나, 프로세서는 실시간으로 촬영되는 CCTV 영상에 대한 이동체 식별 동작을 수행해야 하므로, 본 발명 에서의 신경망 모델은 신경망의 아키텍처가 단순하여 빠른 처리시간을 갖는 YOLO(You Only Look Once) 기 반의 신경망 모델인 것이 바람직하다. 구체적으로, 도 10을 참조하면 신경망 모델은 YOLOv5 신경망 모델일 수 있으며, 그 중에서도 중간 (medium) 크기의 객체를 검출하는 모델일 수 있다. YOLOv5 신경망 모델은 CCTV 영상이 입력되면 Backbone 파트에서 영상의 특징 맵(feature map)을 추출하고, Head 파트에서 앞서 추출된 특징 맵에 기초하여 객체의 위치를 특정하여 이미지 크기가 다른 3가지의 결과값을 출력할 수 있다. 도 11을 참조하면, CCTV 영상이 신경망 모델에 입력되면 CCTV 영상 내 모든 객체, 예컨대 자가 용(car), 트럭(truck), 보행자(pedestrian) 등이 검출될 수 있고, 이러한 객체 분류(classification) 및 검출 을 위해 신경망 모델이 사전에 지도학습(supervised learning) 될 수 있음은 당연하다. 다음으로, 프로세서는 검출된 객체들 중에서 이동체만을 검출할 수 있고, 이를 위해 프로세서는 복수 객체 중 프레임 변화에 따른 이동거리가 기준값 이상인 객체를 이동체로 식별할 수 있다. 구체적으로, 프로세서는 CCTV 영상의 인접한 프레임에서 촬영된 각 객체의 위치를 비교하여 객체의 이"}
{"patent_id": "10-2022-0130538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "동거리를 산출할 수 있다. 이를 위해, 프로세서는 당해 기술분야에서 알려진 객체 추적(object tracking) 알고리즘을 이용할 수 있고, 예컨대 Sort(Simple Online and Realtime Tracking) 알고리즘을 이용할 수 있다. 프로세서는 산출된 이동거리가 기준값 이상인 객체를 이동체로 식별할 수 있다. 한편, 무단횡단의 경우 보행자나 자전거 등의 과실에 의해 발생할 수 있고, 이들을 선택적으로 모니터링하기 위 해 프로세서는 도로 밖에 위치한 이동체만을 식별할 수 있다. 구체적으로, 프로세서는 신경망 모델을 통해 식별된 복수 객체 중에서 앞서 식별된 경계선(B) 밖에 위 치한 적어도 하나의 객체를 식별할 수 있고, 적어도 하나의 객체 중에서 프레임 변화에 따른 이동거리가 기준값 이상인 객체를 이동체로 식별할 수 있다. 도 12를 참조하면, 프로세서는 신경망 모델을 통해 사람인 m1, m2, m3와 차량인 c1, c2의 객체를 식별 할 수 있다. 프로세서는 각 객체의 위치와 경계선(B)의 위치를 비교하여 경계선(B) 밖에 위치한 객체를 m1, m2, m3로 식별할 수 있다. 구체적으로, 프로세서는 앞서 식별된 두 경계선(B) 사이의 객체(c1, c2)를 경계 선(B) 안에 위치하는 것으로 판단할 수 있고, 그 외의 객체(m1, m2, m3)를 경계선(B) 밖에 위치하는 것으로 판 단할 수 있다. 이어서, 프로세서는 경계선(B) 밖의 객체 중 프레임 변화에 따른 이동거리가 기준값 이상인 객체만을 이동체로 식별할 수 있다. 한편, 도 13 내지 도 15에서는 설명의 편의를 위해 경계선(B)과 객체만을 개략적으로 도시하였으며, 객체는 점 으로 객체의 이동은 화살표로 나타내었다. 도 13을 참조하면, 프로세서는 경계선(B) 밖에 위치한 m1, m2, m3 객체에 대해 프레임별 위치 변화를 통해 이동거리(d1, d2, d3)를 산출할 수 있다. 이 때, 이동거리가 기준값 이상인 m1 및 m2만을 이동체로 식별할 수 있다. 무단횡단을 시도하는 보행자는 일반적인 보행 속도로 이동하는 대신 빠르게 이동하는 것이 일반적이므로, 모니 터링 대상인 이동체를 식별함에 있어서 기준값의 마진을 두어 위험성을 내재한 보행자만을 이동체로 식별할 수 있다. 한편, 교통사고의 경우 보행자가 도로로 진입하거나 차량이 보행로로 진입함으로써 발생할 수 있고, 이를 모니 터링하기 위해 프로세서는 경계선(B)을 향해 이동하는 이동체만을 식별할 수 있다. 구체적으로, 프로세서는 신경망 모델을 통해 식별된 복수 객체 중에서 그 이동방향이 도로의 경계선 (B)을 향하는 적어도 하나의 객체를 이동체로 식별할 수 있다. 이 때, 경계선(B)의 위치 정보는 앞서 프로세서 에 의해 식별되어 메모리에 저장될 수도 있고, 도로의 방향과 객체의 움직임을 통해 프로세서가 직접 추정할 수도 있다. 일 실시예에서, 도 14를 참조하면, 프로세서는 메모리를 참조하여 경계선(B)의 위치를 파악할 수 있다. 프 로세서는 프레임의 변화에 따른 객체의 움직임에 기초하여 각 객체(m1, m2, m3, c1)의 이동방향을 식별할 수 있다. 이어서, 프로세서는 네 객체(m1, m2, m3, c1) 중 이동방향이 경계선(B)을 향하는 두 객체(m1, m 2)만을 이동체로 식별할 수 있다. 구체적으로, 프로세서는 각 객체의 이동벡터를 산출하고, 이동벡터의 방향이 경계선(B)과 수직인 방향(z)과 기준값 이상으로 유사한 적어도 하나의 객체를 이동체로 식별할 수 있다. 여기서 이동벡터는 프레임 변화에 따 라 이동한 객체 위치의 시작점에서 끝점을 잇는 벡터일 수 있다. 다시 도 14를 참조하면, 프로세서는 프레임 변화에 따른 객체(m1, m2, m3, c1)의 위치 변화에 기초하여 이 동벡터(v1, v2, v3, v4)를 산출할 수 있다. 프로세서는 각 이동벡터(v1, v2, v3, v4)의 방향과 경계선(B) 과 수직인 방향(z) 간의 유사도를 산출할 수 있고, 산출된 유사도가 기준값 이상인 객체(m1, m2)를 이동체로 식 별할 수 있다. 다른 실시예에서, 프로세서는 각 객체의 이동벡터를 통해 도로 또는 경계선(B)의 방향을 추정하고, 이에 기 초하여 경계선(B)을 향하는 객체를 특정하여 이동체로 식별할 수 있다. 구체적으로, 프로세서는 복수의 객 체에서 이동벡터의 수직 및 수평 성분 중 더 적은 어느 한 성분이 타 성분보다 큰 객체를 이동체로 식별할 수 있다. 도 15를 참조하면, 프로세서는 프레임 변화에 따른 객체(m1, m2, m3, m4, c1)의 위치 변화에 기초하여 이동 벡터(v1, v2, v3, v4, v5)를 산출할 수 있다. 각 이동벡터(vn=(vnx, vny), 여기서 n은 각 객체)는 수직 성분(vn y)과 수평 성분(vnx)을 가질 수 있고, 프로세서는 각 이동벡터의 수직 성분을 모두 더하여 전체 수직 성분 (v1y+v2y+…+vny)을 산출할 수 있고, 각 이동벡터의 수평 성분을 모두 더하여 전체 수평 성분(v1x+v2x+…+vnx)을 산 출할 수 있다. 도로 주변의 모든 객체는 도로의 방향, 즉 경계선(B)의 연장 방향에 따라 이동하는 것이 일반적이므로, 도로가 수직 방향일 때 전체 수직 성분(v1y+v2y+…+vny)이 전체 수평 성분(v1x+v2x+…+vnx)보다 클 수 있고, 도로가 수평 방향일 때 전체 수평 성분(v1x+v2x+…+vnx)이 전체 수직 성분(v1y+v2y+…+vny)보다 클 수 있다. 이에 따라, 프로세서는 전체 수직 성분(v1y+v2y+…+vny)과 전체 수평 성분(v1x+v2x+…+vnx)을 비교하여 더 적은 어느 한 성분을 도로의 방향과 수직인 성분, 즉 경계선(B)을 항하는 성분으로 추정할 수 있다. 다시 도 15를 참조하면, 각 객체(m1, m2, m3, m4, c1)의 이동벡터(v1, v2, v3, v4, v5)에 대한 전체 수직 성분 (v1y+v2y+…+v5y)이 전체 수평 성분(v1x+v2x+…+v5x)보다 크므로 프로세서는 도로가 수직 방향인 것으로 추정할 수 있고, 이에 따라 수평 성분(vnx)이 수직 성분(vny)보다 큰, 바람직하게는 기준값 이상으로 큰 객체(m1)만을 이동체로 식별할 수 있다. 이상에서 설명한 방법에 따라 경계선(B) 및 이동체가 각각 식별되면, 프로세서는 이동체와 경계선(B) 사이 의 거리에 따라 CCTV 영상을 가공하여 모니터링 영상을 생성할 수 있다(S30). 다시 말해, 프로세서는 경계선(B)과 이동체 사이의 거리에 기초하여 위험도를 판단할 수 있고, 위험도가 높은 경우에만 모니터링 영상 을 생성할 수 있다. 일 실시예에서, 프로세서는 이동체와 경계선(B) 간 거리의 부호가 바뀌는 시점을 포함하는 CCTV 영상 을 분할하여 모니터링 영상을 생성할 수 있다. 도 14를 예로 들어 설명하면, 프로세서는 경계선(B)에 대해 수직 방향(z)으로 경계선(B)과 이동체 간의 거 리를 프레임별로 산출할 수 있다. 경계선(B) 외부의 이동체가 경계선(B) 내부로 진입한 경우 또는 경계선(B) 내 부의 이동체가 경계선(B) 외부로 진입한 경우, 인접한 두 프레임에서 산출된 각 거리값의 부호가 달라질 수 있 다. 프로세서는 부호가 달라진 시점, 즉 부호가 달라진 프레임을 포함하는 미리 설정된 시간(예컨대 5분)의 CCTV 영상을 잘라내어 모니터링 영상을 생성할 수 있다. 이에 따라, 프로세서는 보행자가 도로로 진입 하였거나 차량이 보행로로 진입한 시점이 포함된 일정 시간의 CCTV 영상을 모니터링 영상으로 확보할 수 있다. 일 실시예에서, 프로세서는 이동체와 경계선(B) 사이의 거리가 기준 프레임 내 기준 거리 이상으로 가까워 지는 시점을 포함하는 CCTV 영상을 분할하여 모니터링 영상을 생성할 수 있다. 프로세서는 경계선(B)에 대해 수직 방향(z)으로 경계선(B)과 이동체 간의 거리를 프레임별로 산출할 수 있 다. 경계선(B) 내부 또는 외부의 이동체가 빠르게 경계선(B)을 향해 이동하는 경우, 경계선(B)과 이동체 간 거 리는 기준 프레임 내 기준 거리 이상으로 가까워질 수 있다. 이에 따라, 도 14를 참조하면 앞서 설명한 방법에 따라 m1과 m2가 이동체로 식별된 경우에도 프로세서는, m1은 기준 프레임 내 기준 거리 이상 경계선과 가까워진 것으로 판단할 수 있고, m2는 기준 프레임 내 기준 거 리 미만으로 경계선과 가까워진 것으로 판단할 수 있다.이에 따라, 프로세서는 m1에 대한 모니터링 영상만을 생성할 수 있고, 구체적으로 경계선(B)과 m1 간의 거리가 기준 프레임내 기준 거리 이상으로 산출된 시점을 포함하는 미리 설정된 시간의 CCTV 영상을 잘라내어 모 니터링 영상을 생성할 수 있다. 이에 따라, 프로세서는 보행자가 도로로 빠르게 진입하려고 하거나 차량이 보행로로 빠르게 진입하려고 하는 시점이 포함된 일정 시간의 CCTV 영상을 모니터링 영상으로 확보할 수 있다. 프로세서는 전술한 방법에 따라 생성된 모니터링 영상을 CCTV 영상과 분리 저장할 수 있다(S40). 일반 적인 교통 정보 수집용 CCTV는 내부 용량의 한계로 인해 길어도 최근 30일의 영상만을 저장할 수 있다. 이 에 따라, 과거의 교통사고를 분석함에 있어서 사고 현장에 CCTV가 설치되어 있더라도 일정 시간이 지나버리 면 사고 당시의 영상이 삭제되어 사고 원인 규명이 어렵다는 문제가 있다. 이러한 한계를 극복하기 위해, 본 발명의 프로세서는 위험도가 높은 상황의 CCTV 영상을 모니터링 영 상으로 생성하고 이를 별도 데이터베이스에 분리 저장할 수 있다. 여기서 데이터베이스는 임의의 저장장치, 클 라우드 서버 등을 포함할 수 있다. 추가적으로, 프로세서는 모니터링 영상을 관제 서버에 송신할 수 있다(S50). 도 1을 참조하여 설명한 바와 같이 관제 서버는 교통, 안전, 소방 등 도로에서 발생 가능한 이벤트를 관제하는 서버일 수 있다. 이에 따라, 관제 서버에서는 위험도가 높은 상황의 모니터링 영상을 실시간으로 확인할 수 있고, 교통사고 가 발생하더라도 이를 즉각적으로 파악하여 빠르게 조치할 수 있다. 전술한 바와 같이 본 발명은 CCTV 영상 내 보행자와 차량의 이동을 인공지능 모델로 분석함으로써 별도의 모니 터링 인력 없이도 교통사고가 발생할 수 있는 다양한 위험 상황을 자동으로 감지할 수 있고, 위험도가 높은 상 황의 CCTV 영상을 모니터링 영상으로 별도 관리함으로써 교통사고 예방 및 사고 조치를 용이하게 하는 장점이 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다."}
{"patent_id": "10-2022-0130538", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 교통사고 모니터링 시스템을 도시한 도면. 도 2는 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 교통사고 모니터링 방법을 도시한 순서도. 도 3은 CCTV 영상의 일 예시를 도시한 도면. 도 4는 도 3에 도시된 CCTV 영상에서 검출된 엣지를 도시한 도면. 도 5는 도 4에 도시된 엣지에서 검출된 직선을 도시한 도면. 도 6은 도 5에 도시된 직선 중에서 식별된 경계선을 도시한 도면.도 7은 CCTV 영상의 다른 예시를 도시한 도면. 도 8은 도 7에 도시된 CCTV 영상을 통해 식별된 경계선을 도시한 도면. 도 9는 도 7에 도시된 CCTV 영상에서 식별된 경계선을 도시한 도면. 도 10는 본 발명에 적용되는 객체 검출 알고리즘을 도시한 도면. 도 11은 도 3에 도시된 CCTV 영상에서 검출된 객체를 도시한 도면. 도 12 내지 도 15는 CCTV 영상에서 이동체를 식별하는 과정을 설명하기 위한 도면."}
