{"patent_id": "10-2015-0139587", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0040512", "출원번호": "10-2015-0139587", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "박성철"}}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 복수의 대역들에 대응하는 복수의 안테나들을 포함하는 안테나 모듈과;복수의 대역들의 신호들을 처리하는 RF 신호 처리부와;상기 RF 신호 처리부와 일단이 연결되며, 상기 RF 신호 처리부와 상기 안테나 모듈 간의 복수의 대역들의 신호들을 전달하기 위한 하나의 전송 선로와;상기 하나의 전송 선로의 타단과 연결되며 상기 안테나 모듈의 복수의 안테나들과 대응되는 신호 경로를 형성하는 신호 분배 결합부를 포함하며,상기 RF 신호 처리부는,RF 회로 및제1 포트 및 제2 포트에 상기 RF 회로가 연결되며, 공통 포트에 상기 단일 전송 선로의 타단과 연결되는 다이플렉서를 포함하며,상기 신호 분배 결합부는,일단이 상기 안테나 모듈의 제1 안테나에 연결되고 타단이 상기 하나의 전송 선로의 타단과 연결되고, 상기 하나의 전송 선로의 타단에 연결되며 제2 안테나에 대응하는 제2 대역의 신호를 필터링하는 상기 제 1안테나에 대응하는 제1 대역 패스 필터를 포함하며,상기 제1 대역의 주파수는 상기 제2 대역의 주파수와 주파수가 다른 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제2안테나는,입사되는 제1대역의 신호를 절반 이상 반사시키는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서하우징 주위에서 연결되는 주변 전도성 부재를 더 포함하며,상기 제1안테나 또는 상기 제2안테나 중 적어도 하나는,상기 주변 도전성 부재의 적어도 일부분을 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 제어 신호에 따라, 상기 제1 안테나와 상기 제2 안테나가 서로 연결 또는 분리되도록 하는 스위치를 더 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "전자 장치에 있어서,제1 대역의 제1 안테나, 상기 제1 대역과 일부 중첩되는 제2 대역의 제2 안테나, 상기 제1 대역의 제3 안테나,및 상기 제2 대역의 제4 안테나와,공개특허 10-2017-0040512-3-하우징 주위에서 연결되는 주변 전도성 부재와,복수의 대역들 각각에 대응하는 송수신 경로,상기 복수의 대역들 각각에 대응하는 수신 경로,상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상기 송수신 경로에 연결하고 다른 하나를 상기 수신 경로에 연결하며, 상기 제2 안테나 및 상기 제4 안테나를 중 어느 하나를 상기 송수신 경로에 연결하고 다른 하나를상기 수신 경로에 연결하도록 경로를 형성하는 경로 형성부를 포함하며,상기 제1안테나, 상기 제2안테나, 상기 제3안테나 또는 상기 제4안테나 중 적어도 하나는 상기 주변 도전성 부재의 적어도 일부분을 포함하는 전자 장치"}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나를 포함하는 안테나 모듈로부터 수신한 신호의 수신 전계 강도 또는 수신 신호 품질 중 적어도 하나를 기초로, 상기 경로 형성부가 제어하여 상기경로를 형성하는 제어 신호를 생성하는 제어부를 더 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서, 상기 경로 형성부는,상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상기 송수신 경로의 제1 전단부, 제2 전단부, 또는 제3 전단부에 연결되도록 하고 다른 하나를 상기 수신 경로의 제1 전단부 또는 제2 전단부로 연결되도록 하는 제1 스위치와;상기 제2 안테나 및 상기 제4 안테나를 중 어느 하나를 상기 송수신 경로의 제2 전단부 또는 제3 전단부와 연결되도록 하고 다른 하나를 상기 수신 경로의 제3 전단부에 연결되도록 하는 제3 스위치를 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서, 상기 경로 형성부는,제1 포트 및 제2 포트가 각각 제2 스위치 및 상기 송수신 경로의 제1 전단부와 연결되고, 공통 포트가 상기 제1스위치와 연결되는 제1 다이플렉서와,상기 제3 스위치 및 상기 제1 포트 중 어느 하나를 상기 송수신 경로의 제3 전단부와 연결되도록 하고 다른 하나를 상기 송수신 경로의 제2 전단부와 연결되도록 하는 상기 제2 스위치를 더 포함하고 제1 포트 및 제2 포트가 각각 상기 수신 경로의 제1 전단부 및 상기 수신 경로의 제2 전단부와 연결되고, 공통포트가 상기 제1 스위치와 연결되는 제2 다이플렉서를 더 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서, 상기 제어 신호는,상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제3 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며,상기 제3 스위치를 상기 송수신 경로의 제3 전단부와 연결되도록 하고 상기 제1 다이플렉서의 제1 포트를 상기송수신 경로의 제2 전단부와 연결되도록 상기 제2 스위치를 스위칭하며,상기 제3 안테나를 상기 송수신 경로의 제3 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 수신 경로의 제3 전단부와 연결되도록 상기 제3 스위치를 스위칭하도록 하는 것을 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8항에 있어서, 상기 제어 신호는,공개특허 10-2017-0040512-4-상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제3 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며,상기 제1 다이플렉서의 제1 포트를 상기 송수신 경로의 제1 전단부와 연결되도록 하고, 상기 제3 스위치를 상기송수신 경로의 제2 전단부와 연결되도록 상기 제2 스위치를 스위칭하며,상기 제3 안테나를 상기 송수신 경로의 제2 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 다이버시티 리시버의 제3 전단부와 연결되도록 상기 제3 스위치를 스위칭하도록 하는 것을 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8항에 있어서, 상기 제어 신호는,상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제2 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며,상기 제1 다이플렉서의 제1 포트를 상기 송수신 경로의 제3 전단부와 연결되도록 하고, 상기 제3 스위치를 상기송수신 경로의 제2 전단부와 연결되도록 상기 제2 스위치를 스위칭하며,상기 제4 안테나를 상기 송수신 경로의 제2 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제3 안테나를 상기 수신경로의 제3 전단부와 연결되도록 상기 제3 스위치를 스위칭하도록 하는 것을포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8항에 있어서, 상기 제어 신호는,상기 제3 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제1 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며,상기 제3 스위치를 상기송수신 경로의 제3 전단부와 연결되도록 하고, 상기 제1 다이플렉서의 제1 포트를 상기송수신 경로의 제2 전단부와 연결되도록 상기 제2 스위치를 스위칭하며,상기 제3 안테나를 상기 송수신 경로의 제3 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 수신 경로의 제3 전단부와 연결되도록 상기 제3 스위치를 스위칭하는 것을 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 8항에 있어서,상기 제어 신호는, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나가 상기 중첩 대역에 대응하는 신호의수신이 가능하고, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나 중 하나의 안테나가 상기 중첩 대역에 대응하는 신호의 송신이 가능하도록 제어하는 신호를 포함하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 8항에 있어서상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나 중 적어도 하나의 안테나로 송수신하고 다른 적어도 하나의 안테나로 수신 하는 중에송신 전력이 제1 임계치 이상이거나 또는 수신 전계가 제2 임계치 이하 일 때하나의 안테나로 송신만하고 적어도 다른 하나의 안테나로 수신을 하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 장치에 있어서,공개특허 10-2017-0040512-5-제1 내지 8 안테나들을 포함하는 안테나 모듈과;하우징 주위에서 연결되는 주변 전도성 부재와;제1 대역에 대응하는 제1 전단부 및 제2 대역에 대응하는 제2 전단부를 포함하는 송수신 경로와;상기 제1 대역에 대응하는 제3 전단부 및 상기 제4 대역에 대응하는 제4 전단부를 포함하는 수신 경로와;상기 제1 전단부, 상기 제2 전단부, 상기 제3 전단부, 및 상기 제4 전단부 중 선택된 하나를 제1, 제2, 제3, 및제4 서브 스위치와 각각 연결되도록 하는 메인 스위치를 포함하며,상기 제1내지 제8안테나 중 적어도 하나는 주변 도전성 부재의 적어도 일부분을 포함하며;상기 안테나 모듈에서 동일한 대역의 2개의 안테나들에 각각 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가 연결되어, 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기제3 서브 스위치, 및 상기 제4 서브 스위치가 각각 연결된 2개의 안테나들 중 하나의 안테나를 상기 메인 스위치와 선택적으로 연결되도록 하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 송수신 경로 또는 상기 수신 경로에 대응하는 무선 통신 방식과 다른 무선 통신 방식의 통신 모듈을 상기안테나 모듈의 안테나 중 하나와 연결하는 익스트랙터(extractor),또는상기 안테나 모듈의 제1 안테나 와 제2 안테나를 상기 송수신 경로 또는 상기 수신 경로와 상기 통신 모듈과 선택적으로 연결하는 스위치를 포함하는 전자 장치"}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15항에 있어서, 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가 각각 연결된2개의 안테나들 중 상기 메인 스위치와 연결되지 않은 안테나를 로드(load)와 연결되도록 하거나 또는 개방되도록 하는 전자 장치."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "하우징 주위에서 연결되는 주변 전도성 부재와, 복수의 안테나들을 포함하며, 상기 복수의 안테나들 중 적어도하나는 상기 주변 도전성 부재의 적어도 일부분을 포함하는 전자 장치의 제어 방법에 있어서,상기 복수의 안테나들 중 하나 이상의 안테나로 수신된 신호를 수신하는 동작과;상기 복수의 안테나들 중 두 개 이상의 안테나들로 상기 신호를 수신할 때 다이버시티 동작을 수행하고;상기 수신된 신호의 전계 강도를 측정하는 동작과;상기 전계 강도를 임계값과 비교하는 동작;상기 비교 동작에 따라 수신 안테나를 추가하거나 또는 수신 안테나 수를 유지하도록 하는 동작을 하며,상기 복수의 안테나들 중 하나 이상의 안테나로 수신된 신호는,상기 복수의 안테나들이 공통으로 지원하는 주파수 대역의 신호인 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서, 상기 하나 이상의 안테나는,신호의 송신 동작을 수행하며,상기 전계 강도가 상기 제1 기준 전계 강도보다 작으면, 상기 전계 강도를 제2 기준 전계 강도와 비교하는 동작과;공개특허 10-2017-0040512-6-상기 전계 강도가 상기 제2 기준 전계 강도보다 작으면, 상기 전계 강도를 제3 기준 전계 강도와 비교하는 동작과;상기 전계 강도가 상기 제3 기준 전계 강도보다 작으면, 상기 전자 장치를 4차 다이버시티 수신 동작을 하도록제어하며,상기 전계 강도가 상기 제1 기준 전계 강도 이상이면, 지정된 안테나가 신호의 수신 동작을 하도록 제어하는 동작과;상기 전계 강도가 상기 제2 기준 전계 강도 이상이면, 상기 전자 장치를 2차 다이버시티 수신 동작을 하도록 제어하는 동작과;상기 전계 강도가 상기 제3 기준 전계 강도 이상이면, 상기 전자 장치를 3차 다이버시티 수신 동작을 하도록 제어하는 동작을 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2015-0139587", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 제어 방법에 있어서,상기 전자 장치의 송신 전력을 확인하는 동작과;상기 송신 전력이 지정된 기준 값에 도달하거나, 또는 상기 송신 전력이 지정된 기준 값에 도달한 상태에서 상기 송신 전력의 상향 명령을 확인하면, 복수의 안테나들 각각의 수신 전계 및 기 측정된 오프셋을 이용하여, 복수의 안테나들간의 성능을 비교하는 동작과;상기 비교 결과에 따라, 신호의 송신을 수행하는 하나의 안테나를 결정하는 동작을 수행하는 전자 장치의 제어방법."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시 예에 따르면 전자 장치에 있어서, 제1 대역의 제1 안테나, 상기 제1 대역과 일부 중첩되는 제2 대역 의 제2 안테나, 상기 제1 대역의 제3 안테나, 및 상기 제2 대역의 제4 안테나, 복수의 대역들 각각에 대응하는 송수신 경로, 상기 복수의 대역들 각각에 대응하는 수신 경로, 상기 제1 안테나 및 상기 제3 안테나 중 어느 하 나를 상기 송수신 경로에 연결하고 다른 하나를 상기 수신 경로에 연결하며, 상기 제2 안테나 및 상기 제4 안테 나를 중 어느 하나를 상기 송수신 경로에 연결하고 다른 하나를 상기 수신 경로에 연결하도록 경로를 형성하는 경로 형성부를 포함할 수 있다. 다른 실시 예가 가능하다."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시 예는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 스마트폰, 태블릿(tablet) PC 등과 같은 무선 통신이 가능한 다양한 전자 장치들이 개발되고 있다. 이러한 전자 장치들에는 LTE(800MHz, 1.8GHz, 2.1GHz, 2.6GHz), 3G(1.8GHz, 2.1GHz), WiMAX(2.3GHz, 3.3GHz, 5.7GHz), 무선랜(2.4GHz), 블루투스(2.4GHz), UWB(3.1~10.6GHz) 등이 탑재되고 있으며, 각 주파수 대역별 복수 의 안테나들이 포함된다. 복수의 안테나들을 탑재한 종래의 전자 장치는 안테나들마다 전송 선로가 연결되어 있다. 통신 신호의 신뢰도를 높이기 위해서 전자 장치 내에 2개 이상의 다중 대역 안테나가 설치되고 있으며, 또한 이 동 통신 시스템의 다중 경로 페이딩 완화를 위해 전자 장치 내에 다이버시티(diversity) 안테나가 구현되고 있 다. 한편, 전자 장치 내에 탑재된 안테나들의 통신 신호 품질을 높이기 위해 안테나들 사이의 상호간섭을 줄여야 한 다."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래에는 안테나 개수의 증가에 따라, 전자 장치 내에 많은 전송 선로가 배선 되었다. 또한, 종래에는 복수의 안테나들의 스위칭을 위해, 복수의 스위치들이 필요했으며, 이에 따라 전자 장치 내의 배선 및 부품 배치의 제 약을 야기하는 문제점이 있었다. 또한, 안테나의 통신 신호는 노이즈에 취약하기 때문에, 전자 장치에 복수의 안테나들의 탑재 시, PCB 상의 안 테나 신호 선로들을 타 신호 선로들과 격리되도록 설계 하거나, 동축선의 사용을 고려해야 한다. 상기 PCB 상의 안테나 신호 선로들을 타 신호 선로들과 격리시키기 위한 설계 시, 종래에는 복수의 안테나 신호 선로들이 PCB 상의 많은 공간을 차지하는 문제점이 있었다. 이에 따라, PCB 상의 배선 및 부품 배치의 많은 제약이 있었다. 또한, 상기 동축선을 사용하는 경우 종래에는 복수의 동축선들이 전자 장치 내에 많은 공간을 차지하여, 부품 실장의 제약 및 제품 단가를 상승시키는 문제점이 있었다. 또한, 전자 장치 내에 탑재된 안테나들의 통신 신호 품질을 높이기 위해 안테나들 사이 또는 송수신 신호의 상 호간섭을 줄여야 한다 이에 따라, 다양한 실시 예들은 적은 개수의 전송 선로로 복수의 안테나들을 적용 할 수 있는 전자 장치 및 그 제어 방법을 제공 하는 것이다. 또한, 다양한 실시 예들은 안테나 장치의 복수의 안테나들의 스위칭 시, 스위치의 개수를 줄일 수 있는 전자 장 치 및 그 제어 방법을 제공하는 것이다. 또한, 다양한 실시 예들은 전자 장치의 복수의 안테나을 스위치를 통해 선택적으로 연결하여 안테나들 사이 또 는 송수신 신호의 상호간섭을 줄일 수 있는 전자 장치 및 그 제어 방법을 제공하는 것이다."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시 예에 따른 전자 장치에 있어서, 복수의 대역들에 대응하는 복수의 안테나들을 포함하는 안테나 모듈과; 복 수의 대역들의 신호들을 처리하는 RF 신호 처리부와; 상기 RF 신호 처리부와 일단이 연결되며, 상기 RF 신호 처 리부와 상기 안테나 모듈 간의 복수의 대역들의 신호들을 전달하기 위한 하나의 전송 선로와; 상기 하나의 전송 선로의 타단과 연결되며 상기 안테나 모듈의 복수의 안테나들과 대응되는 신호 경로를 형성하는 신호 분배 결합 부를 포함할 수 있다. 실시 예에 따른 전자 장치에 있어서, 제1 대역의 제1 안테나, 상기 제1 대역과 일부 중첩되는 제2 대역의 제2 안테나, 상기 제1 대역의 제3 안테나, 및 상기 제2 대역의 제4 안테나; 복수의 대역들 각각에 대응하는 송수신 경로; 상기 복수의 대역들 각각에 대응하는 수신 경로; 상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상 기 송수신 경로에 연결하고 다른 하나를 상기 수신 경로에 연결하며, 상기 제2 안테나 및 상기 제4 안테나를 중 어느 하나를 상기 송수신 경로에 연결하고 다른 하나를 상기 수신 경로에 연결하도록 경로를 형성하는 경로 형 성부를 포함할 수 있다. 실시 예에 따른 전자 장치에 있어서, 제1 내지 8 안테나들을 포함하는 안테나 모듈과; 제1 대역에 대응하는 제1 전단부 및 제2 대역에 대응하는 제2 전단부를 포함하는 송수신 경로와; 상기 제1 대역에 대응하는 제3 전단부 및 상기 제4 대역에 대응하는 제4 전단부를 포함하는 수신 경로와; 상기 제1 전단부, 상기 제2 전단부, 상기 제 3 전단부, 및 상기 제4 전단부 중 선택된 하나를 제1, 제2, 제3, 및 제4 서브 스위치와 각각 연결되도록 하는 메인 스위치와; 상기 안테나 모듈에서 동일한 대역의 2개의 안테나들에 각각 상기 제1 서브 스위치, 제2 서브 스위치, 제3 서브 스위치, 및 제4 서브 스위치가 연결되어, 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가 각각 연결된 2개의 안테나들 중 하나의 안테나를 상기 메인 스위 치와 선택적으로 연결되도록 할 수 있다. 실시 예에 따른 전자 장치의 제어 방법에 있어서, 복수의 안테나들 중 하나 이상의 안테나로 수신된 신호를 수 신하는 동작과; 상기 복수의 안테나로 상기 신호를 수신할 때 다이버시티 동작을 수행하고; 상기 수신된 신호의 전계 강도를 측정하는 동작과; 상기 전계 강도를 임계값과 비교하는 동작; 상기 비교 동작에 따라 수신 안테나 를 추가하거나 또는 수신 안테나 수를 유지하도록 하는 동작을 포함할 수 있다. 실시 예에 따른 전자 장치의 제어 방법에 있어서, 상기 전자 장치의 송신 전력을 확인하는 동작과; 상기 송신 전력이 지정된 기준 값에 도달하거나, 또는 상기 송신 전력이 지정된 기준 값에 도달한 상태에서 상기 송신 전 력의 상향 명령을 확인하면, 복수의 안테나들 각각의 수신 전계 및 기 측정된 오프셋을 이용하여, 복수의 안테 나들간의 성능을 비교하는 동작과; 상기 비교 결과에 따라, 신호의 송신을 수행하는 하나의 안테나를 결정하는 동작을 수행할 수 있다."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따른 전자 장치 및 그 제어 방법은 적은 개수의 전송 선로로 복수의 안테나들을 적용 할 수 있다. 또한, 복수의 안테나들의 스위칭 시, 스위치의 개수를 줄일 수 있다. 또한, 안테나를 스위치를 통해 선택적으로 연결하여 안테나간 간섭 또는 송수신 신호간 간섭을 줄일 수 있다. 이에 따라, 전자 장치의 제조 시, 효 율적인 부품 실장을 할 수 있으며, 또한 전자 장치의 제품 단가를 줄일 수 있는 효과를 가진다. 또한 전자 장치 의 통신 성능을 향상시킬 수 있다."}
{"patent_id": "10-2015-0139587", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다.본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상 의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있 다. 어떤 실시예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전 자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스 를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또 는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(application programming interface(API)), 및/또는 어플 리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API(14 5)의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로 그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따 라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치(10 1)의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 부여 할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요 청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위 한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이 미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제 2 외부 전 자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또 는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 근거리 통신을 포 함할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(Bluetooth), NFC(near field communication), 중 적어도 하나를 포함할 수 있다. 또한, 무선 통신은, 예를 들면, 위성 통신을 포함할 수 있다. 위성 통신은, 예를 들면 GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System (이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system 중 적어도 하나를 포 함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS- 232(recommended standard232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치 (102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어떤 기능이나 서비스 를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(102, 104), 또는 서버 )에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버)는 요청된 기능 또는 추 가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또 는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP(application processor)), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터 를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨 어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서(21 0)는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시예에 따르면, 프로세서는 GPU(graphicprocessing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서 는 도 2에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서 는 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 1의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈를 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀 룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈 을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따르면, 셀룰러 모듈 , WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜시 버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포 함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하 여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), 컬러(color) 센 서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K), 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로(additionally or alternatively), 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서(electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시예에서는, 전자 장치는 프로세서의 일부로 서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel),(디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전 식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널은제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마 이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이 터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있 다. 패널은, 도 1의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예 를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 디스플레이는 패널 , 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인 터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적 으로(additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인 터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈 은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터 리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무 선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터 리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리 는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시 지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진 동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치는 모바 일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(mediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 도 3은 다양한 실시예에 따른 프로그램 모듈의 블록도이다. 한 실시예에 따르면, 프로그램 모듈(예: 프로 그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(operating system(OS)) 및/ 또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램)을 포함할 수 있다. 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적 어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치(102, 104), 서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포 함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이 버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능들 을 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 미들웨어(예: 미들웨어)는 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀 티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매 니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하 여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어플리케 이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있 다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니 저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제 공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일 , 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리(health care)(예: 운동량 또 는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 (102, 104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의 상, \"정보 교환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전 달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치(102, 104))로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102, 104))의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비 스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치(102, 104))의 속성(에 따라 지정된 어 플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시예에 따르면, 어플 리케이션은 외부 전자 장치(예: 서버 또는 전자 장치(102, 104))로부터 수신된 어플리케이션을 포함 할 수 있다. 한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서 버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적 어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로 세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상의 기 능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등 을 포함할 수 있다. 도 4는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 블록 구성도이다. 도 4를 참조하면, 전자 장치(400; 예: 전자 장치)는 안테나 모듈, RF 신호 처리부, 하나의 전송 선로, 및 신호 분배 결합부를 포함할 수 있다. 안테나 모듈은 복수의 대역들에 대응하는 복수의 안테나들을 포함할 수 있다. 예를 들어, 안테나 모듈 은 제1 대역에 대응하는 제1 안테나(미도시) 및 제2 대역에 대응하는 제2 안테나(미도시)를 포함할 수 있 다. RF 신호 처리부는 복수의 대역들의 신호들을 처리할 수 있다. 하나의 전송 선로는 RF 신호 처리부와 일단이 연결되며, RF 신호 처리부와 안테나 모듈 간 의 복수의 대역들의 신호들을 전달할 수 있다. 또한, 하나의 전송 선로는 동축선일 수 있다. 신호 분배 결합부는 하나의 전송 선로의 타단과 연결되며 안테나 모듈의 복수의 안테나들과 대 응되는 신호 경로를 형성할 수 있다. 예를 들어, 신호 분배 결합부는 적어도 하나의 수동 소자(미도시)를 포함할 수 있다. 또한, 추가로 신호 분배 결합부는 전송 선로(미도시)를 더 포함할 수 있다. 다양한 실시 예에 따르면, RF 신호 처리부는 RF 회로(미도시)를 포함할 수 있다. 또한, RF 신호 처리부 는 제1 포트 및 제2 포트에 상기 RF 회로가 연결되며, 공통 포트에 상기 하나의 전송 선로의 타단과 연결되는 다이플렉서를 더 포함할 수 있다.예를 들어, 신호 분배 결합부는 일단이 상기 안테나 모듈의 제1 안테나에 연결되고 타단이 하나의 전 송 선로의 타단과 연결되어, 상기 제1 안테나에 대응하는 제1 대역의 신호 이외의 신호를 필터링하는 제1 대역 패스 필터(미도시)를 포함할 수 있다. 또한, 추가로, 신호 분배 결합부는 일단이 상기 안테나 모듈 의 제2 안테나에 연결되고 타단이 하나의 전송 선로의 타단과 연결되어, 상기 제2 안테나에 대응하는 제2 대역의 신호 이외의 신호를 필터링하는 제2 대역 패스 필터(미도시)를 더 포함할 수 있다. 예를 들어, 신호 분배 결합부는는 공통 포트가 하나의 전송 선로의 타단과 연결되고 제1 포트가 안테 나 모듈의 제1 안테나에 연결되고 제2 포트가 안테나 모듈의 제2 안테나에 연결되는 다이플렉서를 포 함할 수 있다. 다양한 실시 예에 따르면, 상기 RF 신호 처리부는 RF 회로와, 제1 포트, 제2 포트, 및 제3 포트에 상기 RF 회로가 연결되며, 공통 포트에 하나의 전송 선로의 타단과 연결되는 트리플렉서(미도시)를 포함할 수 있다. 예를 들어, 신호 분배 결합부는 제1, 제2, 제3, 및 제4 대역 패스 필터(미도시)를 포함할 수 있다. 상기 제1 대역 패스 필터는, 제1 대역의 신호를 필터링 하며, 일단이 상기 안테나 모듈에서 상기 제1 대역의 제 1 안테나와 연결되고 타단이 상기 제2 대역 패스 필터의 타단과 연결되도록 할 수 있다. 상기 제2 대역 패스 필 터는 제2 대역의 신호를 필터링 하며, 일단이 제3 대역 패스 필터로 연결된다. 상기 제3 대역 패스 필터는 제3 대역의 신호를 필터링 하며, 일단이 상기 안테나 모듈에서 상기 제3 대역의 제2 안테나와 연결되고 타단이 상기 제4 대역 패스 필터의 타단에 연결된다. 제4 대역 패스 필터의 일단은 상기 안테나 모듈에서 상기 제 4대역의 제3안테나와 연결 되도록 할 수 있다. 상기 제4 대역 패스 필터는 제4 대역의 신호를 필터링할 수 있다. 제1, 제2, 제3 및 제 4 대역은 상호 중첩되는 주파수 대역을 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치는 추가로, 제어 신호에 따라, 상기 복수의 대역들 중 제1 대역의 안 테나 및 제2 대역의 안테나가 서로 연결 또는 분리되도록 하는 스위치를 더 포함할 수 있다. 도 5는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 5를 참조하면, 전자 장치(500; 예: 전자 장치)는 2개의 안테나들인 제1 안테나 및 제2 안테나 를 신호 분배 결합부와 함께 연결할 수 있으며, 하나의 전송 선로를 통해 제1 안테나 및 제2 안테나 각각의 신호를 RF 회로에 입력(또는 출력)되도록 할 수 있다. 전자 장치는 제1 안테나, 제2 안테나, RF 신호 처리부, 하나의 전송 선로, 및 신호 분배 결합부를 포함할 수 있다. 제1 안테나 및 제2 안테나는 각각 제1 대역 및 제2 대역에서 동작하도록 구성된 안테나일 수 있다. 또한, 제1 안테나 및 제2 안테나는 금속으로 된 금속 배젤(bezel)(금속 하우징(housing))의 일부일 수 있다. 예를 들어, 전자 장치는 금속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분절부 를 포함할 수 있으며, 분절부에 의해 분절된 단위 배젤부들은 각각 제1 안테나 및 제2 안테나로 활용 될 수 있다. 또한, 예를 들어, 상기 제1 대역은 고 대역(high band), 상기 제2 대역은 저 대역(low band)일 수 있다. 또한, RF 신호 처리부는 RF 회로 및 다이플렉서를 포함할 수 있다. 또한, 하나의 전송 선 로는 동축선일 수 있다. 또한, 신호 분배 결합부는 로우 패스 필터(LPF; low pass filter; 571)를 포함할 수 있다. 하나의 전송 선로를 통해 제1 안테나 및 제2 안테나와 RF 회로가 신호를 통신하기 위해, 하나의 전송 선로의 일단을 다이플렉서의 공통 포트에 연결되도록 하고, 다이플렉서의 각 포트 에 RF 회로를 연결되도록 할 수 있다. 또한, 하나의 전송 선로의 타단은 제1 안테나와 연결되도 록 할 수 있다. 예를 들어, 하나의 전송 선로와 연결된 선로와 제1 안테나의 급전부를 연결할 수 있 다. 또한, 상기 하나의 전송 선로의 타단은 제2 안테나와 연결된 LPF와 연결되도록 하여, LPF가 안테나의 고 대역 신호가 저 대역의 안테나와 연결된 선로로 전송되지 못하도록 할 수 있다. 또한, 제2 안테나와 LPF는 예를 들어, 동축선을 통해 서로 연결되도록 할 수 있다. 상술한 구성에 따라, RF 회로는 하나의 전송 선로를 이용하여, 제1 안테나에 제1 대역에 대응하 는 신호를 송신하거나, 또는 제2 안테나에 제2 대역에 대응하는 신호의 송신할 수 있다. 또한, RF 회로 는 제1 안테나로부터 제1 대역에 대응하는 신호를 수신하거나, 또는 제2 안테나로부터 제2 대역 에 대응하는 안테나 신호를 수신할 수 있다. 또한, 다이플렉서의 공통포트에 입력(또는 출력)되는 신호는제1 대역에 대응하는 신호 및 제2 대역에 대응하는 신호를 포함할 수 있으며, 다이플렉서의 공통포트에 연 결된 하나의 전송 선로는 상기 2개의 신호를 전송할 수 있다. 도 6은 고 대역 안테나의 반사손실(S11)을 나타낸 그래프이다. 도 6에 도시된 공진 특성에 따라, 고 대역 안테 나의 신호는 고 대역의 안테나로부터 방사된다. 또한, 저 대역의 S11 특성은 하이 패스 필터(HPF; high pass filter)의 저지 대역(STOP) 대역의 특성과 유사하여, 저 대역 안테나의 신호는 고 대역 안테나로부터 방사되지 않고 선로를 따라 저 대역 안테나로 전송된다. 도 7은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 7의 (a)를 참조하면, 전자 장치(700; 예: 전자 장치)의 안정적인 성능 확보를 위해, 도 5의 전자 장치 에서 추가로 HPF를 제1 안테나의 급전부 전단에 배치시켜, 전자 장치를 구성할 수 있다. 도 7의 (a)를 참조하면, 전자 장치는 제1 안테나, 제2 안테나, RF 신호 처리부, 하나의 전송 선로, 및 신호 분배 결합부를 포함할 수 있다. 제1 안테나 및 제2 안테나는 각각 제1 대역(예: 고 대역) 및 제2 대역(예: 저 대역)에서 동작하도록 구성된 안테나일 수 있다. 또한, 제1 안테나 및 제2 안테나는 금속으로 된 금속 배젤(금속 하우징)의 일부일 수 있다. 예를 들어, 전자 장치는 금 속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분절부를 포함할 수 있으며, 분절부에 의해 분절 된 단위 배젤부들은 각각 제1 안테나 및 제2 안테나로 활용될 수 있다. 또한, RF 신호 처리부는 RF 회로 및 다이플렉서를 포함할 수 있다. 신호 분배 결합부는 LPF 및 HPF를 포함할 수 있다. 도 7의 (a)를 참조하면, 하나의 전송 선로의 일단이 LPF의 일단 및 HPF의 일단과 연결되며, 하 나의 전송 선로의 타단이 다이플렉서의 공통 포트에 연결되도록 구성할 수 있다. 또한, RF 회로(73 1)가 다이플렉서의 제1 포트 및 제2 포트에 연결되도록 할 수 있다. LPF의 타단은 제2 안테나와 연결되고, HPF의 타단은 제1 안테나와 연결되도록 할 수 있다. 또한, LPF9771)의 타단 및 제2 안테나 는 예를 들어, 동축선을 통해 서로 연결되도록 할 수 있다. 한편, 도 7의 (a)의 전자 장치의 LPF 및 HPF 대신, 도 7의 (b)와 같이 다이플렉서를 적용 하여 전자 장치를 구성할 수 있다. 예를 들어, 도 7의 (b)와 같이, 다이플렉서를 적용한 전자 장치 는 하나의 전송 선로의 일단이 다이플렉서의 공통 포트와 연결되도록 하고, 다이플렉서의 제1 포트 및 제2 포트 각각이 제1 안테나 및 제2 안테나에 연결되도록 할 수 있다. 또한, 다이플렉서 의 제2 포트 및 제2 안테나는 예를 들어, 동축선을 통해 서로 연결되도록 할 수 있다. 한편, 도 7의 (b)의 전자 장치의 다른 구성들의 연결 관계에 대한 설명은 도 7의 (a)의 전자 장치와 동일하므로 생 략한다. 도 8은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 8을 참조하면, 전자 장 치는 하나의 전송 선로를 통해 3 개의 안테나에 급전할 수 있다. 예를 들어, 전자 장치는 3개의 서로 다른 대역에 대응하는 신호를 트리플렉서(triplexer)를 이용하여 하나의 동축선에 인가할 수 있다. 안테나 장치는 제1 안테나, 제2 안테나, 제3 안테나, RF 신호 처리부, 하나의 전송 선로, 및 신호 분배 결합부를 포함할 수 있다. 제1 안테나, 제2 안테나, 및 제3 안테나는 각각 제1 대역, 제2 대역, 및 제3 대역에서 동작하도 록 구성된 안테나일 수 있다. 또한, 제1 안테나, 제2 안테나 및 제3 안테나는 금속으로 된 금속 배젤(금속 하우징)의 일부일 수 있다. 예를 들어, 전자 장치는 금속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분절부를 포함할 수 있으며, 분절부에 의해 분절된 단위 배젤부들은 각각 제1 안테나 , 제2 안테나 및 제3 안테나로 활용될 수 있다. 또한, RF 신호 처리부는 RF 회로 및 다이플렉서를 포함할 수 있다. 신호 분배 결합부는 제1 LPF, 제1 HPF, 제2 LPF 및 제2 HPF를 포함할 수 있다. 하나의 전송 선로의 일단이 제1 LPF의 일단 및 제1 HPF의 일단과 연결되며, 하나의 전송 선로 의 타단이 트리플렉서의 공통 포트에 연결되도록 구성할 수 있다. 또한, RF 회로가 트리플렉서 의 제1 포트, 제2 포트, 및 제3 포트에 연결되도록 할 수 있다. 제1 LPF의 타단은 제2 LPF의 일단 및 제2 HPF의 일단과 연결되며, 제1 HPF의 타단은 제1 안테나와 연결되도록 할 수 있다. 또한, 제2 LPF의 타단 및 제2 HPF의 타단 각각은 제3 안테나 및 제2 안테나와 연결되도록 할 수 있다. 또한, 제1 LPF 및 제2 LPF는 예를 들어, 동축선을 통해 서로 연결되도록 할 수 있다. 또한, 제2 LPF 및 제3 안테나는 예를 들어, 동축선을 통해 서로 연결되도록 할 수 있다. 상기 제1 대역, 상기 제2 대역, 상기 제3 대역은 예를 들어, 저 대역, 중간 대역, 및 고 대역일 수 있으며, 이 에 따라, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나는 각각 저 대역 안테나, 중간 대역 안테나, 고 대역 안테나일 수 있다. 상술한 구성에 따라, 제1 안테나의 급전부 전단에 있는 제1 HPF는 지정된 제1 대역의 신호를 통과시 킬 수 있다. 또한, 제1 안테나의 급전부 전단에 있는 제1 LPF는 상기 제1 대역보다 낮은 대역의 신호 만을 통과시킬 수 있다. 이에 따라, 제1 대역의 신호는 제2 안테나 및 제3 안테나로 전송되지 않도록 할 수 있 다. 제2 LPF 및 제2 HPF도 지정된 각각의 주파수 대역에 맞추어 여파 동작을 수행할 수 있다. 한편, 각 안테나의 S11 상태에 따라, 제1 HPF 및/또는 제2 HPF는 생략될 수 있다. 도 9는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 9를 참조하면, 전자 장 치(900; 예: 전자 장치)는 RF 회로와 각 안테나 간을 선택적으로 연결할 수 있다. 예를 들어, 전자 장치가 동일 대역을 지원하는 안테나들(예: 제1 안테나, 제2 안테나)을 포함할 때, 안테나들이 동일 대역을 지원하지만, 전자 장치의 사용 상태에 따라, 예를 들어, 사용자의 파지 동작에 따라, 안테나 들의 성능이 상이할 수 있다. 이와 같은 상황일 때, 전자 장치가 안테나들의 성능에 따라, 안테나들을 선 택적으로 연결하여 좋은 성능의 안테나가 동작하도록 할 수 있다. 전자 장치는 제1 안테나, 제2 안테나, RF 신호 처리부, 하나의 전송 선로, 신호 분 배 결합부, 및 스위치를 포함할 수 있다. 제1 안테나 및 제2 안테나는 동일하게 제1 주파수 대역(예를 들어, 고 대역)에서 동작하도록 구성된 안테나들일 수 있다. 또한, 제1 안테나 및 제2 안테나는 금속으로 된 금속 배젤(금속 하우징)의 일부 일 수 있다. 예를 들어, 전자 장치는 금속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분 절부를 포함할 수 있으며, 분절부에 의해 분절된 단위 배젤부들은 각각 제1 안테나 및 제2 안테나로 활용될 수 있다. 또한, RF 신호 처리부는 RF 회로를 포함할 수 있다. 신호 분배 결합부는 제1 스위치를 포함할 수 있다. 하나의 전송 선로의 일단이 제1 스위치와 연결되며, 하나의 전송 선로의 타단이 RF 회로에 연결되도록 구성할 수 있다. 또한, 제1 스위치는 제1 안테나 및 제2 안테나와 연결되며, 제어 신호에 따라, RF 회로가 제1 안테나 또는 제2 안테나와 연결되도록 할 수 있다. 또한, 제1 스위 치 및 제1 안테나는 예를 들어, 동축선을 통해 서로 연결되도록 할 수 있다. 또한, 스위치는 제 1 안테나 및 제2 안테나 사이에 연결되며, 제어 신호에 따라, 제1 안테나 및 제2 안테나를 선택적으로 연결 할 수 있다. 예를 들어, 스위치가 제1 안테나의 급전부에 위치하고, 제어 신호에 따라, 제1 안테나 및 제2 안테나를 선택적으로 연결되도록 할 수 있다. 예를 들어, 스위치는 제어 신 호에 따라, 도 9의 (a)와 같이 제1 안테나 및 제2 안테나가 서로 분리되도록 하거나, 도 9의 (b)와 같이 제1 안테나 및 제2 안테나가 서로 연결되도록 할 수 있다. 제1 안테나 및 제2 안테나(91 5)가 분리되면, 안테나 장치는 동일한 대역을 갖는 2개의 안테나가 동작할 수 있다. 또한, 제1 안테나 및 제2 안테나가 서로 연결되면, 제1 대역 보다 낮은 대역의 안테나로 동작될 수 있다. 이때, 제1 스위치의 동작에 따라, RF 회로와 연결되는 급전부를 변경할 수 있다. 예를 들어, 제1 스위치의 동작에 따라, RF 회로와 연결되는 급전부를 제1 안테나 측 급전부 또는 제2 안테나측 급전부로 변경할 수 있다. 상기 스위치는 예를 들어, MEMS(micro electro mechanical system) 스위치일 수 있다. 또한, 상기 제어 신호는 전자 장치의 제어부(미도시)에 의해 생성될 수 있다. 도 10은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 흐름도이다. 도 10을 참조하면, 전자 장치(1000; 예: 전자 장치)가 다이플렉서(제2 다이플렉서)를 이용하여, 하 나의 전송 선로와 2개의 안테나들인 제1 안테나 및 제2 안테나)가 연결되도록 할 수 있다. 예를 들어, 하나의 전선 선로는 동축선일 수 있다. 예를 들어, 또한, 제1 안테나 및 제2 안테나 는 금속으로 된 금속 배젤(금속 하우징)의 일부일 수 있다. 예를 들어, 전자 장치는 금속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분절부를 포함할 수 있으며, 분절부에 의해 분절된 단위 배 젤부들은 각각 제1 안테나 및 제2 안테나로 활용될 수 있다.동축선의 신호부와 GND를 각각 PCB 상의 대응하는 각 패드에 연결하여, 동축선의 신호부가 제2 다이플렉 서의 공통 포트에 연결되도록 할 수 있다. 또한, 제2 다이플렉서의 제1 포트에 제1 안 테나의 Feed가 연결되도록 할 수 있다. 또한, 제2 다이플렉서의 제2 포트에는 제2 안테나 와 연결된 동축선과 연결되도록 할 수 있다. 동축선 외측에 포함하는 접지 선로는 제1 안테나의 접 지부(GND) 와 연결 될 수 있도록 한다. 제1안테나는 동축선 외측의 접지 선로와 연결되고 제1포트과 연결 되어 Inverted F-Antenna 형태가 될 수 있다. 한편, 상기 연결은 예를 들어, 클립이나 납땜을 이용할 수 있다. 다양한 실시 예에 따르면, 전자 장치(예: 전자 장치에 있어서, 복수의 대역들에 대응하는 복수의 안테나들 을 포함하는 안테나 모듈과; 복수의 대역들의 신호들을 처리하는 RF 신호 처리부와; 상기 RF 신호 처리부와 일 단이 연결되며, 상기 RF 신호 처리부와 상기 안테나 모듈 간의 복수의 대역들의 신호들을 전달하기 위한 하나의 전송 선로와; 상기 하나의 전송 선로의 타단과 연결되며 상기 안테나 모듈의 복수의 안테나들과 대응되는 신호 경로를 형성하는 신호 분배 결합부를 포함할 수 있다. 상기 RF 신호 처리부는, RF 회로 및 제1 포트 및 제2 포트에 상기 RF 회로가 연결되며, 공통 포트에 상기 단일 전송 선로의 타단과 연결되는 다이플렉서를 포함할 수 있다. 상기 신호 분배 결합부는, 일단이 상기 안테나 모듈의 제1 안테나에 연결되고 타단이 상기 하나의 전송 선로의 타단과 연결되고, 상기 하나의 전송 선로의 타단에 연결되며 제2 안테나에 대응하는 제2 대역의 신호를 필터링 하는 상기 제 1안테나에 대응하는 제1 대역 패스 필터를 포함할 수 있다. 상기 제1 대역의 주파수는, 상기 제2 대역의 주파수와 주파수가 다를 수 있다. 상기 제2안테나는, 입사되는 제1대역의 신호를 절반 이상 반사시키는 안테나일 수 있다. 상기 전자 장치는, 하우징 주위에서 연결되는 주변 전도성 부재를 더 포함하며, 상기 제1안테나 또는 상기 제2 안테나 중 적어도 하나는, 상기 주변 도전성 부재의 적어도 일부분을 포함할 수 있다. 상기 전자 장치는, 제어 신호에 따라, 상기 제1 안테나와 상기 제2 안테나가 서로 연결 또는 분리되도록 하는 스위치를 더 포함할 수 있다. 도 11은 2개의 안테나의 주파수 대역을 나타내는 도면이다. 도 11을 참조하면, 제1 안테나(Ant 0)가 지원하는 대역 및 제2 안테나(Ant 1)가 지원하는 대역은 중첩되는 일부 영역을 가질 수 있다. 예를 들어, 제1 안테나가 저 대역 및 중간 대역의 안테나이고, 제2 안테나가 고 대역의 안테나일 경우, 제1 안테나 및 제2 안테나는 1930~1980MHz의 중첩되는 영역의 중첩 대역(B1 및 B2)을 가질 수 있다. 또한, 생략되었지만, 제3 안테나가 상기 제1 안테나와 같이 저 대역 및 중간 대역의 안테나이고, 제4 안테나가 제2 안테나와 같이 고대역의 안테나일 경 우, 제1 안테나, 제2 안테나, 제3 안테나 및 제4 안테나는 1930~1980MHz의 중첩되는 영역의 중첩 대역(B1 및 B2)을 가질 수 있다. 다양한 실시 예에 따르면, 복수의 안테나들을 포함하는 전자 장치는 상술한 중첩 대역을 통해 제4 차 다이버시티(4th order diversity)를 지원하도록 할 수 있다. 다양한 다른 실시예에 따르면 제1안 테나와 제3안테나가 지원하는 주파수 대역은 600MHz에서 2.2GHz 일 수 있다. 제2안테나와 제4안테나가 지원하는 주파수 대역은 1.6GHz에서 3GHz 일 수 있다. 다양한 실시예에 따르면 제1안테나와 제3안테나가 지원하는 주파수 대역은 600MHz에서 3GHz 일 수 있다. 제2안테나와 제4안테나가 지원하는 주파수 대역은 1.6GHz에서 3GHz 일 수 있다.예를 들어, 제1 안테나가 메인 트랜시버(예를 들어, 송수신 경로라고도 함)의 저 대역에 대응하는 전단부 (LB FEM) 또는 중간 대역에 대응하는 전단부(MB FEM)와 연결되고, 제2 안테나가 메인 트랜시버의 고 대역 및 중 간 대역에 대응하는 전단부(HMB FEM)와 연결되고, 제3 안테나가 다이버시티 리시버(수신 경로라고도 함)의 저 대역에 대응하는 전단부(LB FEM) 또는 중간 대역에 대응하는 전단부(MB FEM)와 연결되고, 제4 안테나가 다이버 시티 리시버의 고 대역 및 중간 대역에 대응하는 전단부(HMB FEM)에 연결되도록 하면, 상기 중첩 대역의 신호의 송신 및 수신은 제1 안테나로, 나머지 안테나들이 상기 중첩 대역의 신호의 수신을 수행하여, 안테나 장치가 제 4 차 다이버시티 동작을 수행할 수 있다. 한편, 상술한 메인 트랜시버 및 다이버시티 리시버는 제어부(예: 프로세서)에 접속될 수 있다. 또한, 메인 트랜시버 는 상기 제어부로부터 입력되는 송신할 베이스밴드 신호를 RF 신호로 변환하여 출력할 수 있다. 또한, 메인 트랜시버 및 다이버시티 리시버는 복수의 안테나들 중 어느 하나의 안테나를 통해 수신되는 RF 신호를 베 이스밴드 신호로 변환하여 상기 제어부로 출력할 수 있다. 또한, 상술한 연결 상태에서 후술하는 스위칭 동작에 따르면, 상기 중첩 대역의 신호의 송신을 수행하는 안테나 를 변경할 수 있다. 상술한 중첩 대역을 통해 제 4차 다이버시티 안테나를 지원하는 전자 장치의 스위칭 동작을 도 12a 내지 도 12e 를 참조하여 설명하면 다음과 같다. 도 12a를 참조하면, 전자 장치는 제1 안테나(1201; Ant0 Main), 제2 안테나(1203; Ant1 Main), 제3 안테 나(1205; Ant0 Sub), 및 제4 안테나(1207; Ant 1 Sub)를 포함할 수 있다. 예를 들어, 제1 안테나 및 제3 안테나는 제1 대역을 지원하며, 제2 안테나 및 제4 안테나 는 상기 제1 대역과 일부 중첩되는 제2 대역을 지원할 수 있다. 예를 들어, 제1 안테나 및 제3 안 테나의 제1 대역은 도 11의 제1 안테나(Ant 0)가 지원하는 대역일 수 있으며, 제2 안테나 및 제4 안테나의 제2 대역은 도 11의 제2 안테나(Ant 1)가 지원하는 대역일 수 있다. 또한, 전자 장치는 복수의 대역들 각각에 대응하는 전단부들을 포함하는 메인 트랜시버를 포함할 수 있다. 예를 들어, 메인 트랜시버은 제 3 대역에 대응하는 제1 전단부, 제4 대역에 대응하는 제2 전단부, 및 제5 대역에 대응하는 제3 전단부를 포함할 수 있다. 또한, 전자 장치는 상기 복수의 대역들 각각에 대응하는 전단부들을 포함하는 다이버시티 리시버를 포함할 수 있다. 예를 들어, 다이버시티 리시버는 상기 제3 대역에 대응하는 제1 전단부, 상기 제4 대역에 대응하는 제2 전단부, 및 상기 제5 대역에 대응하는 제3 전단부를 포함할 수 있다. 예를 들어, 상기 제3 대역은 저 대역(LB; low band)일 수 있고, 제4 대역은 중간 대역(MB; mid band)일 수 있 고, 제5 대역은 고 대역 및 중간 대역(HMB; high and mid band)일 수 있다. 또한, 전자 장치는 제1 스위치, 제2 스위치, 및 제3 스위치를 포함할 수 있으며, 제1 다이플렉서 및 제2 다이플렉서를 포함할 수 있다. 제1 스위치는 제1 안테나 및 제3 안테나 중 어느 하나를 메인 트랜시버에 연결되도록 하고, 다른 하나를 다이버시티 리시버에 연결되도록 스위칭 할 수 있다. 제3 스위치는 제2 안테나 및 제4 안테나 중 어느 하나를 메인 트랜시버에 연결되도록 하고, 다른 하나를 다이버시티 리시버에 연결되도록 스위칭 할 수 있다. 제1 다이플렉서의 제1 포트 및 제2 포트가 각각 제2 스위치 및 메인 트랜시버의 제1 전단부 와 연결되고, 제1 다이플렉서의 공통 포트가 제1 스위치와 연결되도록 할 수 있다. 제2 스위치는 제3 스위치 및 제1 다이플렉서의 제1 포트 중 어느 하나를 메인 트랜시버 의 제3 전단부와 연결되도록 하고, 다른 하나를 메인 트랜시버의 제2 전단부와 연결되 도록 스위칭 할 수 있다. 제2 다이플렉서의 제1 포트 및 제2 포트가 각각 다이버시티 리시버의 제1 전단부 및 제2 전 단부와 연결되고, 공통 포트가 제1 스위치와 연결되도록 할 수 있다. 상기 제1 내지 제3 스위치(1231, 1233, 1235)는 제어 신호에 따라, 스위칭 동작이 제어될 수 있다. 상기 제어 신호는 전자 장치의 제어부에 의해 생성될 수 있다. 또한, 상기 제1 내지 제3 스위치(1231, 1233, 1235) 는 2P2T 스위치일 수 있다. 도 12b를 참조하면, 제어 신호에 따라, 제1 스위치가 스위칭되어, 제1 안테나를 제1 다이플렉서 의 공통 포트와 연결되도록 하고, 제3 안테나를 제2 다이플렉서의 공통 포트와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제2 스위치가 스위칭되어, 제3 스위치를 메인 트랜시버의 제3 전단부와 연결되도록 하고 제1 다이플렉서의 제1 포트를 메인 트랜시버의 제2 전단부 와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제3 스위치가 스위칭되어, 제2 안테나를 제2 스위치를 통해 메인 트랜시버의 제3 전단부에 연결되도록 하고, 상기 제4 안테나를 다이버시티 리시버 )의 제3 전단부와 연결되도록 할 수 있다. 상술한 바와 같이, 메인 트랜시버의 제1 전단부는 저 대역의 전단부이고, 제2 전단부는 중간 대역의 전단부이고, 제3 전단부는 고 대역 및 중간 대역의 전단부라고 하면, 제1 내지 제4 안테나(1201,1203, 1205, 1207)의 대역들이 모두 중첩 대역을 포함할 때, 도 12b의 구성에 따르면, 제1 안테나가 중첩 대역의 신호의 송신 및 수신을 수행하고, 나머지 안테나들(1203, 1205, 1207)이 중첩 대역의 신호의 수신을 담 당함을 알 수 있다. 일 실시 예에 따르면 제1안테나와 제 3안테나가 상기 제1 대역과 상기 제2 대역 모두 지원하면 상 기 제 5대역, 고 대역 및 중간대역(HBM)이 중첩 대역에 포함될 수 있다. 고 대역 및 중간대역이 중첩대역에 포 함되었을 때 제2 전단부와 제3 전단부에 고 대역 수신단을 추가하면 도12b의 제1 내지 제3 스위치 (1231, 1233, 1235)의 스위칭 상태에서 중간 대역 또는 고 대역에서 제2 안테나가 수신 및 송신을 수행하 고 나머지 안테나들(1203, 1205, 1207)이 중첩 대역의 신호의 수신을 담당할 수 있다. 도 12c를 참조하면, 제어 신호에 따라, 제1 스위치가 스위칭되어, 제1 안테나를 제1 다이플렉서 의 공통 포트와 연결되도록 하고, 제3 안테나를 제2 다이플렉서의 공통 포트와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제2 스위치가 스위칭되어, 제1 다이플렉서의 제1 포트를 메인 트랜 시버의 제3 전단부와 연결되도록 하고, 제3 스위치를 메인 트랜시버의 제2 전단부 와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제3 스위치가 스위칭되어, 제3 안테나를 제2스위치를 통해 메 인 트랜시버의 제2 전단부에 연결되도록 하고, 제4 안테나를 다이버시티 리시버의 제3 전단부와 연결되도록 할 수 있다. 상술한 바와 같이, 메인 트랜시버의 제1 전단부는 저 대역의 전단부이고, 제2 전단부는 중간 대역의 전단부이고, 제3 전단부는 고 대역 및 중간 대역의 전단부라고 하면, 제1 내지 제4 안테나(1201, 1203, 1205, 1207)의 대역들이 모두 중첩 대역을 포함할 때, 도 12c의 구성에 따르면, 제2 안테나가 중첩 대역의 신호의 송신 및 수신을 수행하고, 나머지 안테나들(1201, 1205, 1207)이 중첩 대역의 신호의 수신을 담 당함을 알 수 있다. 일 실시 예에 따르면 제1안테나와 제 3안테나가 상기 제1 대역과 상기 제2 대역 모두 지원하면 상 기 제 5대역, 고 대역 및 중간 대역(HBM)이 중첩 대역에 포함될 수 있다. 고 대역 및 중간대역이 중첩 대역에 포함되었을 때 제2전단부와 제3전단부에 고 대역 수신단을 추가하면 도12c의 제1 내지 제3 스위치 (1231, 1233, 1235)의 스위칭 상태에서 중간 대역 또는 고 대역에서 제2안테나가 수신 및 송신을 수행하 고 나머지 안테나들(1201, 1205, 1207)이 중첩 대역의 신호의 수신을 담당할 수 있다. 도 12d를 참조하면, 제어 신호에 따라, 제1 스위치가 스위칭되어, 제1 안테나를 상기 제1 다이플렉 서의 공통 포트와 연결되도록 하고, 제2 안테나를 제2 다이플렉서의 공통 포트와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제2 스위치가 스위칭되어, 제1 다이플렉서의 제1 포트를 메인 트랜 시버의 제3 전단부와 연결되도록 하고, 제3 스위치를 메인 트랜시버의 제2 전단부 와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제3 스위치가 스위칭되어, 제4 안테나를 제2 스위치를 통해 메인 트랜시버의 제2 전단부에 연결되도록 하고, 제3 안테나를 다이버시티 리시버의 제3 전단부와 연결되도록 할 수 있다. 상술한 바와 같이, 메인 트랜시버의 제1 전단부는 저 대역의 전단부이고, 제2 전단부는 중간 대역의 전단부이고, 제3 전단부는 고 대역 및 중간 대역의 전단부라고 하면, 제1 내지 제4 안테나(1201, 1203, 1205, 1207)의 대역들이 모두 중첩 대역을 포함할 때, 도 15의 구성에 따르면, 제4 안테나가 중첩 대역의 신호의 송신 및 수신을 수행하고, 나머지 안테나들(1201, 1203, 1205)이 중첩 대역의 신호의 수신을 담 당함을 알 수 있다. 일 실시예에 따르면, 제1안테나와 제 3안테나가 상기 제1 대역과 상기 제2 대역 모두 지원하면 상 기 제 5대역, 고 대역 및 중간대역(HBM)이 중첩 대역에 포함될 수 있다. 고 대역 및 중간대역이 중첩 대역에 포 함되었을 때 제2전단부와 제3전단부에 고 대역 수신단을 추가하면 도12d의 제1 내지 제3 스위치 (1231, 1233, 1235)의 스위칭 상태에서 중간 대역 또는 고 대역에서 제4안테나가 수신 및 송신을 수행하 고 나머지 안테나들(1201, 1203, 1205)이 중첩 대역의 신호의 수신을 담당할 수 있다.도 12e를 참조하면, 제어 신호에 따라, 제1 스위치가 스위칭되어, 제3 안테나를 제1 다이플렉서 의 공통 포트와 연결되도록 하고, 제1 안테나를 제2 다이플렉서의 공통 포트와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제2 스위치가 스위칭되어, 제3 스위치를 메인 트랜시버의 제3 전단부와 연결되도록 하고, 제1 다이플렉서의 제1 포트를 메인 트랜시버의 제2 전단부(121 3)와 연결되도록 할 수 있다. 또한, 상기 제어 신호에 따라, 제3 스위치가 스위칭되어, 제3 안테나를 메인 트랜시버의 제3 전단부 및 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 제4 안테나를 다이버시티 리시버의 제3 전단부와 연결되도록 할 수 있다. 상술한 바와 같이, 메인 트랜시버의 제1 전단부는 저 대역의 전단부이고, 제2 전단부는 중간 대역의 전단부이고, 제3 전단부는 고 대역 및 중간 대역의 전단부라고 하면, 제1 내지 제4 안테나(1201, 1203, 1205, 1207)의 대역들이 모두 중첩 대역을 포함할 때, 도 12e의 구성에 따르면, 제3 안테나가 중첩 대역의 신호의 송신 및 수신을 수행하고, 나머지 안테나들(1201, 1203, 1207)이 중첩 대역의 신호의 수신을 담 당함을 알 수 있다. 일 실시예에 따르면, 제1안테나와 제 3안테나가 제1 대역과 제2 대역 모두 지원하면 제 5대역, 고 대역 및 중간 대역(HBM)이 중첩 대역에 포함될 수 있다. 고 대역 및 중간 대역이 중첩 대역에 포함되었을 때 제 2전단부와 제3전단부에 고 대역 수신단을 추가하면 도12e의 제1 내지 제3 스위치(1231, 1233, 1235)의 스위칭 상태에서 중간 대역 또는 고 대역에서 제3안테나가 수신 및 송신을 수행하고 나머지 안테 나들(1201, 1203, 1207)이 중첩 대역의 신호의 수신을 담당할 수 있다. 한편, 미 중첩 대역의 신호들은 2차 다이버시티가 가능하며, 예를 들어, 제1 스위치를 이용하여, 신호의 송신 및 수신을 담당하는 안테나를 제1 안테나 또는 제3 안테나로 선택적으로 설정할 수도 있다. 또한, 제3 스위치를 이용하여, 신호의 송신 및 수신을 담당하는 안테나를 제2 안테나 또는 제4 안 테나로 선택적으로 설정할 수도 있다 한편, 신호의 송신 및 수신을 하나의 안테나로 동시에 수행하는 경우, 송신 및 수신 신호 간의 격리(isolatio n)가 낮아져서, 송신 신호에 의해 수신 신호에 간섭이 발생할 수 있다. 이에 따라, 송신 신호의 출력의 제약을 초래할 수 있다. 또한, 상황에 따라, 수신 다이버시티 이득을 얻는 것 보다 높은 송신 출력이 더 중요한 경우가 있다. 이와 같은 경우, 도 13과 같이, 복수의 안테나들을 포함하는 전자 장치에서 적어도 하나의 안테나가 신호 의 송신을 전담하고, 나머지 안테나들이 신호의 수신을 하도록 할 수 있다. 예를 들어, 상술한 도 12b 내지 도 12e의 회로에서 4개의 안테나들 중 중첩 대역의 신호의 송신 및 수신을 수행하는 안테나를 신호의 송신을 전담 하도록 하고, 나머지 안테나들을 신호의 수신을 전담하도록 할 수 있다. 이를 통하여, 해당 전자 장치는 3차 다 이버시티 이득 및 높은 송신 출력의 효과를 가질 수 있다. 수신 전계 강도 또는 수신 품질이 좋으면 전자 장치의 다이버시티가 동작하지 않더라도 원활한 통신을 수행할 수 있다. 또한, 풀 다이버시티 차수(full diversity order)로 동작하면, 전자 장치의 전류 소모 문제가 발생한 다. 이에 따라, 안테나의 수신 전계 강도 및/또는 품질의 상황에 따라, 다이버시티 차수를 결정하여 사용하면, 보다 효율적으로 전자 장치를 구동할 수 있다. 상술한 전자 장치는 제1 내지 제3 스위치(1231, 1233, 1235)의 스위칭 동작에 따라, 복수의 안테나들 중 어느 하나의 안테나가 송신 동작을 하도록 결정할 수 있다. 상기 스위칭 동작은 안테나 장치가 안테나들 각각의 수신 전계 강도(또는 수신 신호 품질)을 확인하여 가장 상황이 좋은 안테나를 선택하여 이루어지도록 제 어할 수 있다. 한편, 안테나의 수신 성능에 대비하여 안테나의 송신 성능이 수신 성능과 같거나, 수신측 성능보다 좋거나, 또 는 수신 성능보다 나쁠 수 있다. 이에 따라, 사전 측정된 송신 및 수신 안테나 간의 오프셋(offset)을 수신 전 계 강도(또는 수신 신호의 품질)에 적용하여 하나의 안테나가 송신 동작을 하도록 선택할 수 있다.표 1 Ant RSSI or RSRP or RSRQ (dBm)T/Rx Ant Offset (송/수신 안테나 오프셋)Corrected (송신 성능) 제2 안테나 -102 -4 -106 제1 안테나 -99 -5 -104 제4 안테나 -102 -1 -103 제3 안테나 -102 -2 -104 예를 들어, 안테나들 별 송신 성능은 RSSI(received signal strength indicator), RSRP(reference signal received power), 또는 RSRQ(reference signal received quality) 값과, 사전에 측정된 송신 및 수신 안테나 오프셋 값을 결합하여 결정할 수 있다. 상기 표 1을 참조하면, 제4 안테나가 송신 동작을 하도록 선택할 수 있 다. 도 14는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 동작의 흐름도이다. 도 14를 참조하면, 현재 전자 장치(예: 전자 장치의 송신 성능이 일정한 값 이하가 아닌 경우 안테나 스위칭에 필 요한 전계의 측정 및 비교 동작을 수행하지 않을 수 있다. 예를 들어, 송신 전력이 임계값에 도달했거나, 송신 전력이 임계값에 도달했는데도 전력을 더 증가시키라는 명령(TPC+)이 확인되면, 전자 장치는 각 안테나 별 성능 을 비교하여 가장 성능이 좋은 안테나를 선택하도록 할 수 있다. 1401 동작에서 전자 장치는 전자 장치의 송신 전력을 확인할 수 있다. 1403 동작에서 전자 장치는 상기 송신 전력이 지정된 임계 값에 도달했는지를 판단할 수 있다. 1403 동작에서 전자 장치가 상기 송신 전력이 지정된 임계 값에 도달한 것으로 판단하면 1405 동작을 실행하고, 그렇지 않으면 1401 동작을 다시 실행하도록 할 수 있다. 1405 동작에서 전자 장치는 전자 장치의 안테나들 간의 성능을 비교할 수 있다. 상기 성능은 상술한 표 1의 송 신 성능일 수 있다. 1407 동작에서 전자 장치는 상기 비교의 결과에 따라 동작시킬 안테나를 결정할 수 있다. 예를 들어, 상기 성능 이 상술한 표 1의 송신 성능일 경우, 상기 비교의 결과에 따라, 송신 기능을 수행할 안테나를 결정할 수 있다. 다양한 실시 예에 따르면, 안테나의 수신 전계 강도를 고려하여 전자 장치를 구동하기 위해, 전자 장치가 도 15 와 같이 동작할 수 있다. 도 15는 다양한 실시 예에 따른 4개의 안테나들을 포함하는 전자 장치(예: 전자 장치)의 안테나 다이버시 티 차수(order of diversity)를 결정하는 동작의 흐름도이다. 도 15를 참조하면, 1501 동작에서 전자 장치는 지정된 하나의 안테나의 전계 강도를 측정할 수 있다. 1503 동작에서 전자 장치는 상기 하나의 안테나의 전계 강도가 제1 기준 전계 강도 이하인지를 판단할 수 있다. 상기 하나의 안테나의 전계 강도가 제1 기준 전계 강도 이하면 1505 동작을 실행하고, 그렇지 않으면 1515 동작 에서 상기 하나의 안테나가 신호의 수신 동작(no diversity 수신 동작)을 하도록 제어할 수 있다. 1505 동작에서 전자 장치가 2차 다이버시티(2nd order diversity)로 동작하여 전계 강도를 측정할 수 있다. 1507 동작에서 전자 장치는 전자 장치가 2차 다이버시티로 동작하여 측정한 전계 강도가 제2 기준 전계 강도 이 하인지를 판단할 수 있다. 전자 장치가 2차 다이버시티로 동작하여 측정한 전계 강도가 제2 기준 전계 강도 이 하면 1509 동작을 실행하고, 그렇지 않으면 1517 동작에서 안테나 장치가 2차 다이버시티 동작을 유지하도록 할 수 있다. 1509 동작에서 전자 장치는 전자 장치가 3차 다이버시티(3nd order diversity)로 동작하여 전계 강도를 측정할 수 있다. 1511 동작에서 전자 장치는 전자 장치가 3차 다이버시티로 동작하여 측정한 전계 강도가 제3 기준 전계 강도 이 하인지를 판단한다. 3차 다이버시티로 동작하여 측정한 전계 강도가 제3 기준 전계 강도 이하면 1531 동작을 실 행하고, 그렇지 않으면 1519 동작에서 전자 장치가 3차 다이버시티 동작을 유지 하도록 할 수 있다.1513 동작에서 전자 장치는 전자 장치가 4차 다이버시티(4th order diversity)로 동작하도록 제어할 수 있다. 상술한 동작은 주기적으로 이루어질 수 있으며, 상술한 동작들에 따라, 수신 상황에 적절한 안테나 다이버시티 차수를 선택하여 동작할 수 있다. 도 16은 다양한 실시 예에 따른 전자 장치의 안테나 다이버시티 차수를 결정하는 동작의 흐름도이다. 도 16을 참조하면, 1601 동작에서 전자 장치(예: 전자 장치)는 선택된 하나의 안테나의 전계 강도를 측정 할 수 있다. 예를 들어, 상기 선택된 하나의 안테나는, 신호의 송신 및 수신을 모두 수행하는 안테나일 수 있다. 1603 동작에서 전자 장치는 상기 전계 강도가 제1 기준 전계 강도 이하인지를 판단할 수 있다. 1603 동작에서 전자 장치가 상기 전계 강도가 제1 기준 전계 강도 이하이면 1605 동작을 실행하고, 그렇지 않으면 1611 동작에 서 상기 하나의 안테나가 신호의 수신 동작을 하도록 제어할 수 있다. 1605 동작에서 전자 장치는 상기 전계 강도가 제2 기준 전계 강도 이하인지를 판단할 수 있다. 1605 동작에서 전자 장치는 상기 전계 강도가 제2 기준 전계 강도 이하이면 1607 동작을 실행하도록 할 수 있다. 그렇지 않으 면 전자 장치는 1613 동작에서 2차 다이버시티로 동작하도록 제어할 수 있다. 1607 동작에서 전자 장치는 상기 전계 강도가 제3 기준 전계 강도 이하인지를 판단할 수 있다. 1607 동작에서 전자 장치는 상기 전계 강도가 제3 기준 전계 강도 이하이면 1609 동작을 실행하도록 할 수 있다. 그렇지 않으 면 전자 장치는 1615 동작에서 3차 다이버시티로 동작하도록 제어할 수 있다. 1609 동작에서 전자 장치는 4차 다이버시티로 동작하도록 제어할 수 있다. 한편, 상기 제1 기준 전계 강도는 상기 제2 기준 전계 강도보다 크며, 상기 제2 기준 전계 강도는 상기 제3 기 준 전계 강도보다 큰 값으로 미리 지정될 수 있다. 도 17은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 17을 참조하면, 상술 한 방법들을 이용하여 복수의 안테나들의 소수의 전송 선로를 통해 연결하고, 각 안테나를 선택적 연결이 가능 하도록 구성한 것이다. 전자 장치는 제1 안테나(1711; DIV LMB1), 제2 안테나(1712; DIV LMB2), 제3 안테나(1713; DIV HMB1), 제4 안테나(1714; DIV HMB2), 제5 안테나(1715; Main LMB1), 제6 안테나(1716; Main LMB2), 제7 안테나(1717; Main HMB1), 및 제8 안테나(1718; Main HMB2)를 포함할 수 있다. 제1 안테나 및 제2 안테나는 저 대역 및 중간 대역의 다이버시티 안테나이며, 제3 안테나 및 제4 안테나는 중간 대역 및 고 대역의 다이버시티 안테나이며, 제5 안테나 및 제6 안테나는 저 대역 및 중간 대역의 메인 안테나이며, 제7 안테나 및 제8 안테나는 중간 대역 및 고 대역의 메 인 안테나 일 수 있다. 또한, 제2 안테나, 제4 안테나, 제6 안테나, 및 제8 안테나는 금속으로 된 금속 배젤(금속 하우징)의 일부일 수 있다. 예를 들어, 전자 장치는 금속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분절부를 포함할 수 있으며, 분절부에 의해 분절된 단위 배젤부들은 각각 제2 안테나, 제4 안테나, 제6 안테나, 및 제8 안테나로 활용될 수 있다. 전자 장치에서 대역이 동일한 2개의 안테나들을 구성은 예를 들어, 전자 장치의 사용 상태에 따라, 예를 들어, 사용자의 파지 동작에 따라, 2개의 안테나들 중 더 좋은 성능의 안테나가 동작되도록 하기 위한 것일 수 있다. 또한, 전자 장치는 메인 트랜시버 및 다이버시티 리시버를 포함할 수 있다. 메인 트랜시버 및 다이버시티 리시버는 각각 스위치와 연결되도록 할 수 있다. 예를 들어, 메인 트랜시버는 제1 전단부(1721; MAIN TR LMB) 및 제2 전단부(1723; MAIN TR HMB)를 포함할 수 있으며, 제1 전단부는 스위치의 제1 포트와, 제2 전단부는 스위치의 제2 포트와 연결되도록 할 수 있다. 또한, 다이버시티 리시버는 제1 전단부(1731; DIV TR LMB) 및 제2 전단부(1733; DIV TR HMB)를 포함할 수 있으며, 제1 전단부는 스위치의 제3 포트와, 제2 전단부는 스위치의 제4 포트와 연결되도록 할 수 있다. 스위치의 제 5 내지 제 8 포트는 제1 서브 스위치, 제2 서브 스위치, 제3 서브 스위치 , 및 제4 서브 스위치와 각각 연결되도록 할 수 있다.제1 서브 스위치는 제1 안테나 및 제2 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제5 포트가 제1 안테나 또는 제2 안테나와 연결되도록 할 수 있다. 제2 서브 스위치는 제3 안테나 및 제4 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제6 포트가 제3 안테나 또는 제4 안테나와 연결되도록 할 수 있다. 제3 서브 스위치는 제5 안테나 및 제6 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제7 포트가 제5 안테나 또는 제6 안테나와 연결되도록 할 수 있다. 제4 서브 스위치는 제7 안테나 및 제8 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제8 포트가 제7 안테나 또는 제8 안테나와 연결되도록 할 수 있다. 한편, 상기 스위치는 예를 들어, 4P4T 스위치일 수 있으며, 4P4T 스위치는 도 18과 같은 형태의 포트를 가질 수 있다. 4P4T 스위치는 4개의 전단 포트와 4개의 후단 포트간 일 대 일 연결의 모든 조합이 가능하도록 구성될 스위치일 수 있다. 예를 들어, 4P4T 스위치의 전단 1번 포트(RFin 1)는 후단 1번부터 4번 포트(RFout1, RFout2, RFout3, RFout4)까지 모두 연결 할 수 있다. 2 내지 4 전단 포트들(RFin 1, RFin 2, RFin 3, RFin 4) 도 상술한 전단 1번 포트와 동일하게 후단 포트들과 연결될 수 있다. 이를 통하여, 4P4T 스위치는 각 전단 및 후단 포트에 연결된 구성들(예를 들어, 회로, 안테나 등)의 연결을 임의로 스와핑(swapping) 할 수 있다. 상기 스위치와 제1 서브 스위치, 제2 서브 스위치, 제3 서브 스위치, 및 제4 서브 스 위치는 제어 신호를 통해 상술한 8개의 안테나들을 서로 스와핑할 수 있다. 상기 제어 신호는, 안테나 장치는 제1 안테나, 제2 안테나, 제3 안테나, 제4 안테나 , 제5 안테나, 제6 안테나, 제7 안테나, 및 제8 안테나 각각의 수신 전계 강도 및/또는 수신 신호 품질 적어도 하나를 기초로 생성될 수 있다. 예를 들어, 전자 장치가 수신 전계 강도 및/또는 수신 신호는 한 번에 안테나 4개씩 측정하여, 2차례의 측정 동작을 통해 확인될 수 있다. 전자 장치 가 한 번에 안테나 4개의 수신 전계 강도 및/또는 수신 신호를 동시에 측정할 때, 상호 영향이 발생될 수 있는 인접한 안테나를 포함하지 않고 측정하도록 할 수 있다. 전자 장치는 제1 엑스트랙터(extractor), 제2 엑스트랙터, 및 제3 엑스트랙터를 포함 할 수 있다. 예를 들어, 제2 서브 스위치와 제4 안테나 사이의 어느 한 지점에 와이파이(wifi) 모듈과 연결된 제1 엑스트랙터를 연결시킬 수 있다. 이 때, 제2 안테나의 대역과 와이파이 대역이 대응할 수 있으며, 제 1 엑스트랙터는 송신 및 수신되는 신호 중 와이파이 모듈에 대응하는 신호를 추출하여, 와이파이 모듈에 전달되도록 할 수 있다. 또한, 제2 서브 스위치와 제3 안테나 사이의 어느 한 지점에 WIFI 모듈과 연결된 제2 엑스트랙터 를 연결시킬 수 있다. 제3 안테나의 대역과 WIFI 대역이 대응할 수 있으며, 제2 엑스트랙터 는 송신 및 수신되는 신호 중 WIFI 모듈에 대응하는 신호를 추출하여, 와이파이 모듈에 전달되도록 할 수 있다. 또한, 제1 서브 스위치와 제1 안테나 사이의 어느 한 지점에 GPS 모듈과 연결된 제2 엑스트랙터 를 연결시킬 수 있다. 제1 안테나의 대역과 GPS 대역이 대응할 수 있으며, 제2 엑스트랙터는 송신 및 수신되는 신호 중 GPS 모듈에 대응하는 신호를 추출하여, GPS 모듈에 전달되도록 할 수 있다. 한편, 상기 와이파이 모듈 및 GPS 모듈의 경우 상술한 스위칭 동작들에 의해 발생되는 연결 경로 변경에 영향을 받지 않을 수 있다. 다시 말해서, 고정된 안테나 위치에서의 역할을 수행할 수 있다. 예를 들어 제1 서브 175 1)스위치가 제2안테나에 연결되더라도 GPS 모듈은 제1안테나에 제2 엑스트랙터를 통해 연결 된 상태를 유지할 수 있어 GPS 수신 동작을 수행할 수 있다. 일 실시 예 따르면 제1서브스위치에 2P2T 스 위치를 사용하여 스위치와 연결되지 않는 안테나 단을 로드(load)에 연결시켜 Termination 시킬 수 있다. 도 19는 와이파이 모듈과 LTE의 대역을 도시한다. LTE BAND 40의 경우 와이파이 밴드(WIFI 2.4GHZ BAND)와 주 파수적으로 매우 인접하여, 엑스트랙터 또는 다른 수동 소자를 이용하여 신호를 분리하는 것이 어렵다. 이에 따 라, LTE BAND 40과 와이파이의 안테나를 공유하는 것은 어렵다. 다만, LTE BAND 40은 현재 중국에 할당되어 있 고, 실제로 2,32GHz까지만 사용하므로, 상술한 구조의 사용이 가능하다. 만약 LTE BAND 40의 대역을 완전히 사용할 경우, 와이파이 및 LTE BAND 40 안테나의 선택적 연결이 필요하다. 이 경우, 도 17의 구성에서 엑스트랙터들 제외하고 스위치를 이용하여 스위치 또는 모듈(GPS 모듈 또는 와이파이 모듈) 이 서로 다른 안테나로 선택적 연결을 수행하도록 할 수 있다. 도 20은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 20을 참조하면, 전자 장치는 제1 안테나, 제2 안테나, 제3 안테나, 제4 안테나, 제5 안테나, 제6 안테나, 제7 안테나, 및 제8 안테나를 포함할 수 있다. 또한, 제2 안테나, 제4 안테나, 제6 안테나, 및 제8 안테나는 금속으로 된 금속 배젤(금속 하우징)의 일부일 수 있 다. 예를 들어, 전자 장치는 금속 베젤을 포함할 수 있으며, 상기 금속 배젤은 적어도 하나의 분절부를 포함할 수 있으며, 분절부에 의해 분절된 단위 배젤부들은 각각 제2 안테나, 제4 안테나, 제6 안테 나, 및 제8 안테나로 활용될 수 있다. 또한, 안테나 장치는 메인 트랜시버 및 다이버시티 리시버를 포함할 수 있다. 메인 트랜시버 및 다이버시티 리시버는 각각 스위치(2040; 예: 4P4T 스위치)와 연결되도록 할 수 있다. 예를 들어, 메인 트랜시버는 제1 전단부 및 제2 전단부를 포함할 수 있으며, 제1 전단 부는 스위치의 제1 포트와, 제2 전단부는 스위치의 제2 포트와 연결되도록 할 수 있다. 또한, 다이버시티 리시버는 제1 전단부 및 제2 전단부를 포함할 수 있으며, 제1 전단부 는 스위치의 제3 포트와, 제2 전단부는 스위치의 제4 포트와 연결되도록 할 수 있다. 스위치의 제 5 내지 제 8 포트는 제1 서브 스위치, 제2 서브 스위치, 제3 서브 스위치 , 및 제4 서브 스위치와 각각 연결되도록 할 수 있다. 제1 서브 스위치는 제1 안테나 및 제2 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제5 포트가 제1 안테나 또는 제2 안테나와 연결되도록 할 수 있다. 제2 서브 스위치는 제3 안테나 및 제4 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제6 포트 또는 WIFI 모듈이 제3 안테나 또는 제4 안테나와 연결되도록 할 수 있다. 제2 서브 스 위치는 스왑(swap) 스위치일 수 있다. 예를 들어 스위치의 제 6포트가 제 3안테나와 연결되 면 WIFI 모듈은 제4안테나와 연결 되거나, 제 6포트가 제 4안테나와 연결되면 WIFI 모듈은 제3안테 나와 연결될 수 있다. 제3 서브 스위치는 제5 안테나 및 제6 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제7 포트가 제5 안테나 또는 제6 안테나와 연결되도록 할 수 있다. 제4 서브 스위치는 제7 안테나 및 제8 안테나와 연결되어, 제어 신호에 따라, 스위치 의 제8 포트가 제7 안테나 또는 제8 안테나와 연결되도록 할 수 있다. 안테나 장치는 엑스트랙터를 포함할 수 있다. 제1 서브 스위치와 제1 안테나 사이의 어느 한 지점에 GPS 모듈과 연결된 엑스트랙터연결되도록 할 수 있다. 한편, 전자 장치에서 선택되지 않은 안테나의 경우에는, 플로팅(floating) 상태 또는 접지(ground)에 연결된 상 태가 되어, 인접 안테나의 영향이 적을 수 있다. 하지만, 설계에 따라, 선택되지 않은 안테나는 기생소자(또는 기생 공진)으로 작용하여 인접 안테나 성능에 영향을 줄 수 있다. 이와 같은 문제점을 해결하기 위해, 전자 장 치를 도 21과 같이 설계할 수도 있다. 도 21을 참조하면, 전자 장치는 서브 스위치들(2191, 및 2193) 각각에 연결된 2개의 안테나들(2115 및 2116, 또는 2117 및 2118)중 스위치와 연결되지 않은 안테나들(2115 또는 2116, 및 2117 또는 2118)을 로드(load; R/L/C 또는 이들을 조합한 회로)와 연결되도록 할 수 있다. 이를 통하여, 선택되지 않은 안테나가 인접 안테나의 성능에 영향을 주지 않는 상태로 변경할 수 있다. 예를 들어, 도 22의 (a)와 같이 사용하지 않는 안테나의 기생 공진이 인접한 경우, 사용하지 않는 안테나를 로드와 연결하여, 도22의 (b)와 같이 기생 공진을 안테나가 지원하지 않는 주파수 대역으로 이동시키거나 변형 시킬 수 있다. 상기 서브 스위치들(2191, 2193)은 스왑(swap) 스위치들일 수 있다. 한편, 전자 장치가 인접 안테나들을 사용할 경우, 격리(isolation) 간격이 적어서, 사용하는 안테나들의 성능 저하 문제가 발생할 수 있다. 예를 들어, 전자 장치가 제4 안테나와 제8 안테나 또는 제4 안테나와 제7 안테나를 선택할 경우, 선택된 안테나들은 서로 인접하여 커플링이 발생될 수 있 으며, 성능 저하 문제를 발생시킬 수 있다. 또한, 전자 장치가 안테나들의 성능을 측정할 때, 상술한 설 명에 의해 인접한 안테나를 배제하여 동시에 측정하면, 인접한 안테나가 동시에 선택되었을 때의 안테나의 성능은 확인할 수 없다. 이에 따라, 안테나 장치가 안테나들의 선택 시, 인접 안테나 조합을 선택에서 배제하 도록 할 수 있다. 또한, 상기 서브 스위치들은 스위치와 연결되고, 스위치는 메인 트랜시버와 연결될 수 있다. 예를 들어, 메인 트랜시버의 제1 전단부 및 제2 전단부는 스위치의 제3 포트 및 제4 포트와 각각 연결될 수 있다. 도 23은 다양한 실시 예에 따른 전자 장치(2300; 예: 전자 장치)의 사시도이다. 도 23을 참고하면, 전자 장치의 전면에는 디스플레이가 설치될 수 있다. 디스플레이의 상측으로는 상대방의 음성을 수신하기 위한 스피커 장치가 설치될 수 있다. 디스플레이의 하측으로 는 상대방에게 전자 장치 사용자의 음성을 송신하기 위한 마이크로폰 장치가 설치될 수 있다. 한 실시 예에 따르면, 스피커 장치가 설치되는 주변에는 전자 장치의 다양한 기능을 수행하기 위한 부품(component)들이 배치될 수 있다. 부품들은 적어도 하나의 센서 모듈을 포함할 수 있다. 이러한 센서 모듈은, 예컨대, 조도 센서(예: 광센서), 근접 센서, 적외선 센서, 초음파 센서 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 부품은 카메라 장치를 포함할 수도 있다. 한 실시 예에 따르면, 부품은 전자 장치의 상태 정보를 사용자에게 인지시켜주기 위한 LED 인디케이터를 포함할 수도 있다. 다양한 실시 예에 따르면, 전자 장치는 금속 배젤(예: 금속 하우징의 적어도 일부 영역으로 기여될 수 있음)을 포함할 수 있다. 한 실시 예에 따르면, 금속 배젤은 전자 장치의 테두리를 따라 배치될 수 있으며, 테두리와 연장되는 전자 장치의 후면의 적어도 일부 영역까지 확장되어 배치될 수도 있다. 한 실시 예에 따르면, 금속 배젤은 전자 장치의 테두리를 따라 전자 장치의 두께로 정의되며, 루프 형 태로 형성될 수 있다. 그러나 이에 국한되지 않으며, 금속 배젤은 전자 장치의 두께 중 적어도 일 부에 기여하는 방식으로 형성될 수도 있다. 한 실시 예에 따르면, 금속 배젤은 전자 장치의 테두리 중 적어도 일부 영역에만 배치될 수도 있다. 한 실시 예에 따르면, 금속 배젤은 적어도 하나의 분절부 (2315, 2316)를 포함할 수 있다. 한 실시 예에 따르면, 각각의 분절부(2315, 2316)에 의해 분절된 단위 배젤부 들은 적어도 하나의 주파수 대역에서 동작하는 안테나 방사체로 활용될 수 있다. 다양한 실시 예에 따르면, 금속 배젤은 테두리를 따라 루프 형상을 가지며, 전자 장치의 두께의 전 부 또는 일부로 기여되는 방식으로 배치될 수 있다. 한 실시 예에 따르면, 전자 장치를 정면에서 보았을 경우, 금속 배젤은 우측 배젤부, 좌측 배젤부, 상측 배젤부 및 하측 배젤부가 형성될 수 있다. 여기서, 상술한 하측 배젤부는 한 쌍의 분절부에 의해 형성된 단위 배젤부로써 기 여될 수 있다. 다양한 실시 예에 따르면, 메인 안테나는 전자 장치의 하부 영역(Main부 안테나 영역)에 배치될 수 있다. 한 실시 예에 따르면, 한 쌍의 분절부에 의해 하측 배젤부는 메인 안테나 방사체로 사용될 수 있다. 한 실시 예에 따르면, 하측 배젤부는 급전 위치에 따라 적어도 두 개의 작동 주파수 대역에서 동작 하는 안테나 방사체로 기여될 수 있다. 예를 들어 하측 배젤부는 저 대역(LB)과 고 대역 및 중간 대역 (H/MB), 또는 고 대역 및 중간 대역(H/MB)을 지원하는 안테나의 일부 일 수 있다. 다양한 실시 예에 따르면, 본 발명의 전자 장치는 단순히 예시적인 구성일 뿐, 하측 배젤부의 상술 한 기능들이 또 다른 분절부에 의해 분절된 상측 배젤부에서 대체하여 수행되거나 함께 수행될 수 도 있다. 이러한 경우, 상측 배젤부의 다이버시티 안테나 영역이 다이버시티(Diversity)/MIMO(multiple- input multiple-output) 용 안테나로 활용 될 수 있다. 예를 들어 상측 배젤부는는 저 대역(LB), 고 대 역 및 중간 대역(H/MB), 또는 고 대역 및 중간 대역(H/MB)을 지원하는 다이버시티 안테나의 일부 일 수 있다. 한 실시 예에 따르면, 우측 배젤부 또는 좌측 배젤부 역시 급전되어 안테나로서 동작 할 수 있다. 예를 들어 우측 배젤부 또는 좌측 배젤부 는 고 대역 및 중간 대역(H/MB) 또는 저 대역(LB), 고 대 역 및 중간 대역(H/MB)을 지원하는 안테나의 일부 일 수 있다. 메인부의 안테나 영역에 포함된 우측 배젤부 또는 좌측 배젤부를 포함하는 안테나는 메인 안테나로 동작할 수 있다. 다이버시티부의 안테나 영 역에 포함된 우측 배젤부또는 좌측 배젤부를 포함하는 안테나는 다이버시티 안테나로 동작할 수 있 다. 도 24는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치(2401; 예: 전자 장치)를 나타낸 도 면이다.도 24를 참조하면, 전자 장치의 제1 안테나는 저 대역(LB)과 고 대역 및 중간 대역(H/MB)을 지원하 고, 제2 안테나는 고 대역 및 중간 대역(H/MB)을 지원할 수 있다. 여기서 하나의 안테나만 저대역을 지원 하는 이유는 저대역이 비교적 파장이 길어 안테나 크기도 커서 복수의 저대역을 지원하는 안테나를 전자 장치의 메인부(메인 안테나 부분에)에 추가로 포함 시키기 어렵기 때문이다. 만약 포함시킨다고 하더라도 거리가 근접 하여 연관성(correlation)/아이솔레이션(isolation) 문제가 발생할 수 있다. 파장이 길면 다이버시티 또는 MIMO 동작에 필요한 안테나 이격 거리(antenna separation distance)도 길어지기 때문이다. 도 24를 참조하면, 전자 장치는 다이버시티부(다이버시티 안테나 부분)를 추가적으로 포함할 수 있으며, 이와 같은 경우 제3안테나, 제4안테나를 포함할 수 있다. 상기의 연관성(correlation)/아이솔레이션 (isolation) 특성을 높이기 위해 일반적으로 도 24와 같이 메인부의 안테나는 전자 장치의 하단부에 포함 되며 다이버시티 부의 안테나는 전자 장치의 상단에 포함 된다. 이를 통해 복수의 저대역 안테나들을 포 함하더라도 전자 장치 내에서 가능한 안테나 이격 거리(antenna separation distance)를 확보 할 수 있다. 상기와 같은 구조로 고 대역 및 중간 대역(H/MB) 에서는 4개의 안테나로 수신이 가능하고 저 대역에서는 2개의 안테나로 수신이 가능하다. 즉 고 대역 및 중간 대역(H/MB)에서는 4차 다이버시티(4th order diversity)/MIMO 수행이 가능하고 저 대역(LB)에서는 2차 다이버시티(2nd Order diversity)/MIMO 가 가능하다. 도 25는 본 발명의 다양한 실시 예에 따른 전자 장치의 구성도이다. 다양한 실시 예에 따르면, 도 25의 금속 배 젤은 도 23의 금속 배젤과 유사하거나 다른 금속 배젤의 한 실시 예이다. 도 25를 참고하면, 금속 배젤은 전면에서 보았을 때, 우측 배젤부, 좌측 배젤부, 하측 배젤부 , 상측 배젤부를 포함할 수 있다. 한 실시 예에 따르면, 하측 배젤부는 일정 간격으로 형성 된 한 쌍의 분절부에 의해 우측 배젤부 및 좌측 배젤부와 분리된 상태를 유지할 수 있다. 상 측 배젤부는 일정 간격으로 형성된 한 쌍의 분절부에 의해 우측 배젤부 및 좌측 배젤부와 분리된 상태를 유지할 수 있다. 한 실시 예에 따르면, 한 쌍의 분절부(2515, 2516)는 유전체 재질로 형성될 수 있다. 한 실시 예에 따르면, 한 쌍의 분절부(2515, 2516)는 금속 재질의 금속 배젤에 합성 수지 재질의 소재가 이중 사출되거나 인서트 몰딩되는 방식으로 형성될 수 있다. 그러나 이에 국한되지 않으며, 한 쌍의 분절부는 절연성 을 갖는 다양한 재질의 소재가 적용될 수도 있다. 다양한 실시 예에 따르면, 하측 배젤부는 소정의 제1급전편이 하측 배젤부와 일체로 형성될 수 있 으며, 제1급전편은 기판(PCB)의 제1급전부에 의해 급전될 수 있다. 한 실시 예에 따르면, 하측 배젤부의 제1급전편은 기판이 전자 장치에 설치되는 동작만으로 기판의 제1급전부에 연결되거나, 별도의 전기적 연결 부 재(예: C 클립 등)에 의해 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 기판에는 제1급전 패드가 배치될 수 있으며, 제1급전 패드는 하측 배젤부의 제 1급전편과 전기적으로 연결될 수 있다. 한 실시 예에 따르면, 제1 급전 패드에서 제1급전부까지 제1전기적 경로 (예: 배선 라인)가 형성될 수 있다. 하측 배젤부는 저대역(LB)과 고 대역 및 중간 대역(H/MB) 또는 고 대 역 및 중간 대역(H/MB)을 지원하는 메인부의 제1 안테나의 일부 일 수 있다. 좌측 배젤부 과 우측 배젤부도 동일한 방법으로 급전 될 수 있다. 좌측 배젤부과 우측 배젤부는 저대역 (LB)과 고 대역 및 중간 대역(H/MB) 또는 고 대역 및 중간 대역(H/MB)을 지원하는 메인부의 제2 안테나의 일부 일 수 있다. 다양한 실시 예에 따르면, 하측 배젤부는 급전편과 일정 간격으로 이격된 위치에 제1접지편이 하측 배젤 부와 일체로 형성될 수 있으며, 제1접지편은 기판(PCB)의 제1접지부에 접지될 수 있다. 한 실시 예에 따 르면, 하측 배젤부의 제1접지편은 기판이 전자 장치에 설치되는 동작만으로 기판의 제1접지부에 접지되거 나, 별도의 전기적 연결 부재(예: C 클립 등)에 의해 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 기판에는 제1접지 패드가 배치될 수 있으며, 제1접지 패드는 하측 배젤부의 제 1접지편과 전기적으로 연결될 수 있다. 한 실시 예에 따르면, 제1접지 패드에서 제1접지부까지 제2전기적 경로 (예: 배선 라인)가 형성될 수 있다. 다양한 실시 예에 따르면, 우측 배젤부는 소정의 제2급전편이 하측 배젤부와 일체로 형성될 수 있으며, 제2급전편은 기판(PCB)의 제2급전부에 의해 급전될 수 있다. 한 실시 예에 따르면, 우측 배젤부의 제2급 전편은 기판이 전자 장치에 설치되는 동작만으로 기판의 제2급전부에 연결되거나, 별도의 전기적 연결 부재(예: C 클립 등)에 의해 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 기판에는 제2급전 패드가 배치될 수 있으며, 제2급전 패드는 우측 배젤부의 제 2급전편과 전기적으로 연결될 수 있다. 한 실시 예에 따르면, 제2 급전 패드에서 제2급전부까지 제3전기적 경로 (예: 배선 라인)가 형성될 수 있다. 우측 배젤부는 저 대역(LB)과 고 대역 및 중간 대역(H/MB) 또는 고 대역 및 중간 대역(H/MB)을 지원하는 메인부의 제2 안테나의 일부 일 수 있다. 다양한 실시 예에 따르면, 우측 배젤부는 분절부와 일정 간격으로 이격된 위치에 제2접지편이 우측 배젤 부와 일체로 형성될 수 있으며, 제2접지편은 기판(PCB)의 제2접지부에 접지될 수 있다. 한 실시 예에 따르면, 우측 배젤부의 제2접지편은 기판이 전자 장치에 설치되는 동작만으로 기판의 제2접지부에 접지되거나, 별도의 전기적 연결 부재(예: C 클립 등)에 의해 전기적으로 연결될 수 있다. 다양한 실시 예에 따르면, 기판에는 제2접지 패드가 배치될 수 있으며, 제2접지 패드는 우측 배젤부의 제 2접지편과 전기적으로 연결될 수 있다. 한 실시 예에 따르면, 제2접지 패드에서 제2접지부까지 제4전기적 경로 (예: 배선 라인)가 형성될 수 있다. 메인부의 급전부와 급전 패드, 접지부와 접지패드는 서브 PCB 상에 배치 될 수 있다. 메인부와 다 이버시티부의 RF회로(2531, 2535)는 메인 PCB 상에 배치 될 수 있다. 메인 PCB 와 서브 PCB 는 FPCB로 연결 될 수 있다. 서브 PCB 와 FPCB 는 일체형 일 수 있다. 서브 PCB는 수직 선상에서 메인 PCB 보다 낮게 단말에 배치 될 수 있다. 이를 통하여 서브 PCB 에 포함된 부품 이 안테나와 더 이격될 수 있다. 그리고 USB Connector, Speaker 부와 같은 비교적 두꺼운 부품들도 서브 PCB 상에 배치가 가능하다. 메인부의 RF 회로의 송수신 신호 또는 수신 신호는 동축선들에 의해 서브 PCB의 제1, 제2급전부에 전달 될 수 있다. 다양한 실시 예에 따르면 메인부의 RF 회로의 송수신 신호 또는 수신 신호는 FPCB로 서브 PCB의 제 1, 제2 급전부에 전달 될 수 있다. 다이버시티부는 제3안테나와 제4안테나를 포함할 수 있다. 제3안테나는 상측 배젤부 를 일부 포함할 수 있으며 제4안테나는 좌측 배젤부 또는 우측 배젤부를 포함할 수 있 다. 제3안테나는 저대역(LB)과, 고 대역 및 중간 대역(H/MB) 또는 고 대역 및 중간 대역(H/MB)을 지원하고 제 4안테나는 고 대역 및 중간 대역(H/MB)을 또는 저대역(LB)과, 고 대역 및 중간 대역(H/MB)을 지원할 수 있다. 다이버시티부의 급전부와 급전패드, 접지부와 접지패드들은 메인 PCB 상에 배치 될 수 있다. 다이 버시티부에서 급전부와 급전패드를 연결하는 전기적 경로들과 접지부와 접지패드를 연결하는 전기적 경로 들은 메인 PCB 상에 배치 될 수 있다. 다양한 실시 예에 따르면, 안테나간 신호의 분리를 위해 메인부에서 우측 배젤부를 제2안테나 로 사용하면 다이버시티부)는 반대 방향인 좌측 배젤부를 제4안테나로 사용할 수 있다. 또는 메인부에서 좌측 배젤부를 제2안테나로 사용하면 다이버시티부는 반대 방 향인 우측 배젤부를 제4안테나로 사용할 수 있다. 다양한 실시 예에 따르면, 전자 장치에 있어서, 제1 대역의 제1 안테나, 상기 제1 대역과 일부 중첩되는 제2 대 역의 제2 안테나, 상기 제1 대역의 제3 안테나, 및 상기 제2 대역의 제4 안테나를 포함하는 안테나 모듈과; 복 수의 대역들 각각에 대응하는 전단부들을 포함하는 메인 트랜시버와; 상기 복수의 대역들 각각에 대응하는 전단 부들을 포함하는 다이버시티 리시버와; 제어 신호에 따라, 상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상기 메인 트랜시버에 연결하고 다른 하나를 상기 다이버시티 리시버에 연결하며, 상기 제2 안테나 및 상기 제4 안테나를 중 어느 하나를 상기 메인 트랜시버에 연결하고 다른 하나를 상기 다이버시티 리시버에 연결하도록 경 로를 형성하는 경로 형성부를 포함할 수 있다. 상기 안테나 모듈의 수신 전계 강도 또는 수신 신호 품질 중 적어도 하나를 기초로, 상기 제어 신호를 생성하는 제어부를 더 포함할 수 있다. 상기 경로 형성부는, 상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상기 메인 트랜시버에 연결되도록 하 고 다른 하나를 상기 다이버시티 리시버에 연결되도록 하는 제1 스위치와; 상기 제2 안테나 및 상기 제4 안테나 를 중 어느 하나를 상기 메인 트랜시버에 연결되도록 하고 다른 하나를 상기 다이버시티 리시버에 연결되도록하는 제3 스위치를 포함할 수 있다. 상기 경로 형성부는, 제1 포트 및 제2 포트가 각각 제2 스위치 및 상기 메인 트랜시버의 제1 전단부와 연결되고, 공통 포트가 제1 스위치와 연결되는 제1 다이플렉서와, 상기 제3 스위치 및 상기 제1 포트 중 어느 하나를 상기 메인 트랜시버의 제3 전단부와 연결되도록 하고 다른 하나를 상기 메인 트랜시버의 제2 전단부와 연결되도록 하는 상기 제2 스위치를 더 포함할 수 있다. 상기 전자 장치는, 제1 포트 및 제2 포트가 각각 상기 다이버시티 리시버의 제1 전단부 및 상기 다이버시티 리 시버의 제2 전단부와 연결되고, 공통 포트가 상기 제1 스위치와 연결되는 제2 다이플렉서를 더 포함할 수 있다. 상기 제어 신호는, 상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제3 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제3 스위치를 상기 메인 트랜시버의 제3 전단부와 연결되도록 하고 상기 제1 다이플렉서의 제1 포트를 상기 메인 트랜시버의 제2 전단부 와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제3 안테나를 상기 메인 트랜시버의 제3 전단부 및 상기 제 3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 다이버시티 리시버의 제3 전단부 와 연결되도록 상기 제3 스위치를 스위칭하도록 하는 것을 포함할 수 있다. 상기 제어 신호는, 상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제3 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제1 다이플렉서의 제1 포 트를 상기 메인 트랜시버의 제1 전단부와 연결되도록 하고, 상기 제3 스위치를 상기 메인 트랜시버의 제2 전단 부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제3 안테나를 상기 메인 트랜시버의 제2 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 다이버시티 리시버의 제3 전단 부와 연결되도록 상기 제3 스위치를 스위칭하도록 하는 것을 포함할 수 있다. 상기 제어 신호는, 상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제2 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제1 다이플렉서의 제1 포 트를 상기 메인 트랜시버의 제3 전단부와 연결되도록 하고, 상기 제3 스위치를 상기 메인 트랜시버의 제2 전단 부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제4 안테나를 상기 메인 트랜시버의 제2 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제3 안테나를 상기 다이버시티 리시버의 제3 전단 부와 연결되도록 상기 제3 스위치를 스위칭하도록 하는 것을 포함할 수 있다. 상기 제어 신호는, 상기 제3 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제1 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제3 스위치를 상기 메인 트랜시버의 제3 전단부와 연결되도록 하고, 상기 제1 다이플렉서의 제1 포트를 상기 메인 트랜시버의 제2 전단 부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제3 안테나를 상기 메인 트랜시버의 제3 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 다이버시티 리시버의 제3 전단 부와 연결되도록 상기 제3 스위치를 스위칭하는 것을 포함할 수 있다. 상기 제어 신호는, 상기 제1 안테나, 제2 안테나, 제3 안테나, 및 제4 안테나가 상기 중첩 대역에 대응하는 신 호의 수신이 가능하고, 상기 제1 안테나, 제2 안테나, 제3 안테나, 및 제4 안테나 중 하나의 안테나가 상기 중 첩 대역에 대응하는 신호의 송신이 가능하도록 제어하는 신호를 포함할 수 있다. 상기 제어 신호는, 상기 제1 안테나, 제2 안테나, 제3 안테나, 및 제4 안테나 중 하나의 안테나가 상기 중첩 대 역에 대응하는 신호의 송신이 가능하고, 상기 제1 안테나, 제2 안테나, 제3 안테나, 및 제4 안테나가 상기 중첩 대역에 대응하는 신호의 송신이 가능한 안테나 이외의 안테나들을 상기 중첩 대역에 대응하는 신호의 수신이 가 능하도록 제어하는 신호를 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치에 있어서, 제1 내지 8 안테나들을 포함하는 안테나 모듈과; 제1 대역에 대 응하는 제1 전단부 및 제2 대역에 대응하는 제2 전단부를 포함하는 메인 트랜시버와; 상기 제1 대역에 대응하는 제3 전단부 및 상기 제4 대역에 대응하는 제4 전단부를 포함하는 다이버시티 리시버와; 상기 제1 전단부, 상기 제2 전단부, 상기 제3 전단부, 및 상기 제4 전단부 중 선택된 하나를 제1, 제2, 제3, 및 제4 서브 스위치와 각 각 연결되도록 하는 메인 스위치와; 상기 안테나 모듈에서 동일한 대역의 2개의 안테나들에 각각 상기 제1 서브 스위치, 제2 서브 스위치, 제3 서브 스위치, 및 제4 서브 스위치가 연결되어, 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가 각각 연결된 2개의 안테나들 중 하나의 안테나 를 상기 메인 스위치와 선택적으로 연결되도록 하는 전자 장치. 상기 전자 장치는 와이파이 모듈과 상기 안테나 모듈의 제1 안테나를 연결하는 제1 엑스트랙터(extractor), 및 GPS 모듈과 상기 안테나 모듈의 제2 안테나를 연결하는 제2 엑스트랙터를 더 포함할 수 있다. 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가 각각 연결된 2개의 안테나들 중 상기 메인 스위치와 연결되지 않은 안테나를 로드(load)와 연결되도록 할 수 있다. 다양한 실시 예에 따르면, 전자 장치의 제어 방법에 있어서, 복수의 안테나들 중 하나의 안테나의 전계 강도를 측정하는 동작과; 상기 전계 강도를 제1 기준 전계 강도와 비교하는 동작과; 상기 비교 결과에 따라, 상기 전자 장치가 다이버시티 수신 동작을 하도록 제어하는 동작을 포함할 수 있다. 상기 하나의 안테나는, 미리 지정된 안테나이며, 상기 전자 장치는 상기 전계 강도가 상기 제1 기준 전계 강도 보다 작으면, 상기 전자 장치를 2차 다이버시티 수신 동작을 하도록 하여, 전계 강도를 확인하는 동작과; 상기 2차 다이버시티 수신 동작을 하도록 하여 확인된 전계 강도가 상기 제2 기준 전계 강도보다 작으면, 상기 전자 장치를3차 다이버시티 수신 동작을 하도록 하여, 전계 강도를 확인하는 동작과; 상기 3차 다이버시티 수신 동작 을 하도록 하여 확인된 전계 강도가 제3 기준 전계 강도보다 작으면, 상기 상기 전자 장치를 4차 다이버시티 수 신 동작을 하도록 제어하는 동작을 포함할 수 있다. 상기 하나의 안테나는, 신호의 송신 동작을 수행하는 안테나이며, 상기 전자 장치는 상기 전계 강도가 상기 제1 기준 전계 강도보다 작으면, 상기 전계 강도를 제2 기준 전계 강도와 비교하는 동작과; 상기 전계 강도가 상기 제2 기준 전계 강도보다 작으면, 상기 전계 강도를 제3 기준 전계 강도와 비교하는 동작과; 상기 전계 강도가 상기 제3 기준 전계 강도보다 작으면, 상기 전자 장치를 4차 다이버시티 수신 동작을 하도록 제어하는 동작을 포함할 수 있다. 상기 전자 장치는 상기 전계 강도가 상기 제1 기준 전계 강도 이상이면, 상기 지정된 안테나가 신호의 수신 동 작을 하도록 제어하는 동작과, 상기 전계 강도가 상기 제2 기준 전계 강도 이상이면, 상기 전자 장치를 2차 다 이버시티 수신 동작을 하도록 제어하는 동작과; 상기 전계 강도가 상기 제3 기준 전계 강도 이상이면, 상기 전 자 장치를 3차 다이버시티 수신 동작을 하도록 제어하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치의 제어 방법에 있어서, 복수의 안테나들 각각의 수신 전계 및 기 측정된 오프셋을 이용하여, 복수의 안테나들간의 성능을 비교하는 동작과; 상기 비교 결과에 따라, 신호의 송신을 수행 하는 하나의 안테나를 결정하는 동작을 포함할 수 있다. 상기 전자 장치는 상기 전자 장치의 송신 전력을 확인하는 동작을 더 포함하며, 상기 송신 전력이 지정된 기준 값에 도달하거나, 또는 상기 송신 전력이 지정된 기준 값에 도달한 상태에서 상기 송신 전력의 상향 명령을 확 인하면, 상기 복수의 안테나들간의 성능을 비교하는 동작을 수행할 수 있다. 상기 수신 전계 정보는, RSSI(received signal strength indicator)), RSRP(referebce sugbak received oiwer), 또는 RSRQ(reference signal received quality) 를 포함할 수 있다. 상기 결정된 안테나는, 신호의 수신 동작을 더 수행할 수 있다. 다양한 실시 예에 따르면, 전자 장치에 있어서, 제1 대역의 제1 안테나, 상기 제1 대역과 일부 중첩되는 제2 대 역의 제2 안테나, 상기 제1 대역의 제3 안테나, 및 상기 제2 대역의 제4 안테나와; 하우징 주위에서 연결되는 주변 전도성 부재와, 복수의 대역들 각각에 대응하는 송수신 경로와; 상기 복수의 대역들 각각에 대응하는 수신 경로와; 상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상기 송수신 경로에 연결하고 다른 하나를 상기 수신 경로에 연결하며, 상기 제2 안테나 및 상기 제4 안테나를 중 어느 하나를 상기 송수신 경로에 연결하고 다 른 하나를 상기 수신 경로에 연결하도록 경로를 형성하는 경로 형성부를 포함할 수 있다. 상기 제1안테나, 상기 제2안테나, 상기 제3안테나 또는 상기 제4안테나 중 적어도 하나는 상기 주변 도전성 부재의 적어도 일부분을 포함할 수 있다. 예를 들어, 상기 전자 장치는, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나를 포 함하는 안테나 모듈로부터 수신한 신호의 수신 전계 강도 또는 수신 신호 품질 중 적어도 하나를 기초로, 상기 경로 형성부가 제어하여 상기 경로를 형성하는 제어 신호를 생성하는 제어부를 더 포함할 수 있다. 예를 들어, 상기 경로 형성부는, 상기 제1 안테나 및 상기 제3 안테나 중 어느 하나를 상기 송수신 경로의 제1 전단부, 제2 전단부, 또는 제3 전단부에 연결되도록 하고 다른 하나를 상기 수신 경로의 제1 전단부 또는 제2 전단부로 연결되도록 하는 제1 스위치와, 상기 제2 안테나 및 상기 제4 안테나를 중 어느 하나를 상기 송수신 경로의 제2 전단부 또는 제3 전단부와 연결되도록 하고 다른 하나를 상기 수신 경로의 제3 전단부에 연결되도록하는 제3 스위치를 포함할 수 있다. 예를 들어, 상기 경로 형성부는, 제1 포트 및 제2 포트가 각각 제2 스위치 및 상기 송수신 경로의 제1 전단부와 연결되고, 공통 포트가 상기 제1 스위치와 연결되는 제1 다이플렉서와, 상기 제3 스위치 및 상기 제1 포트 중 어느 하나를 상기 송수신 경로의 제3 전단부와 연결되도록 하고 다른 하나를 상기 송수신 경로의 제2 전단부와 연결되도록 하는 상기 제2 스위치를 더 포함하고, 제1 포트 및 제2 포트가 각각 상기 수신 경로의 제1 전단부 및 상기 수신 경로의 제2 전단부와 연결되고, 공통 포트가 상기 제1 스위치와 연결되는 제2 다이플렉서를 더 포 함할 수 있다. 예를 들어, 상기 제어 신호는, 상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제3 안테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제3 스위치 를 상기 송수신 경로의 제3 전단부와 연결되도록 하고 상기 제1 다이플렉서의 제1 포트를 상기 송수신 경로의 제2 전단부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제3 안테나를 상기 송수신 경로의 제3 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 수신 경로의 제3 전단부와 연결 되도록 상기 제3 스위치를 스위칭할 수 있다. 또는, 상기 제어 신호는, 상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제3 안 테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제1 다이플렉서의 제1 포트를 상기 송수신 경로의 제1 전단부와 연결되도록 하고, 상기 제3 스위치를 상기 송수신 경로의 제2 전 단부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제3 안테나를 상기 송수신 경로의 제2 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 다이버시티 리시버의 제3 전단 부와 연결되도록 상기 제3 스위치를 스위칭 할 수 있다. 또는, 상기 제어 신호는, 상기 제1 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제2 안 테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제1 다이플렉서의 제1 포트를 상기 송수신 경로의 제3 전단부와 연결되도록 하고, 상기 제3 스위치를 상기 송수신 경로의 제2 전 단부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제4 안테나를 상기 송수신 경로의 제2 전단부 및 상기 제3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제3 안테나를 상기 수신경로의 제3 전단부와 연결 되도록 상기 제3 스위치를 스위칭할 수 있다. 또는, 상기 제어 신호는, 상기 제3 안테나를 상기 제1 다이플렉서의 공통 포트와 연결되도록 하고, 상기 제1 안 테나를 상기 제2 다이플렉서의 공통 포트와 연결되도록 상기 제1 스위치를 스위칭하며, 상기 제3 스위치를 상기 송수신 경로의 제3 전단부와 연결되도록 하고, 상기 제1 다이플렉서의 제1 포트를 상기 송수신 경로의 제2 전단 부와 연결되도록 상기 제2 스위치를 스위칭하며, 상기 제3 안테나를 상기 송수신 경로의 제3 전단부 및 상기 제 3 스위치가 연결된 어느 한 지점에 연결되도록 하고, 상기 제4 안테나를 상기 수신 경로의 제3 전단부와 연결되 도록 상기 제3 스위치를 스위칭할 수 있다. 예를 들어, 상기 제어 신호는, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나가 상 기 중첩 대역에 대응하는 신호의 수신이 가능하고, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상 기 제4 안테나 중 하나의 안테나가 상기 중첩 대역에 대응하는 신호의 송신이 가능하도록 제어하는 신호를 포함 할 수 있다. 예를 들어, 상기 전자 장치는, 상기 제1 안테나, 상기 제2 안테나, 상기 제3 안테나, 및 상기 제4 안테나 중 적 어도 하나의 안테나로 송수신 하고 다른 적어도 하나의 안테나로 수신 하는 중에 송신 전력이 제1 임계치 이상 이거나 또는 수신 전계가 제2 임계치 이하 일 때 하나의 안테나로 송신만하고 적어도 다른 하나의 안테나로 수 신을 할 수 있다. 다양한 실시 예에 따르면, 전자 장치에 있어서, 제1 내지 8 안테나들을 포함하는 안테나 모듈과; 하우징 주위에 서 연결되는 주변 전도성 부재와; 제1 대역에 대응하는 제1 전단부 및 제2 대역에 대응하는 제2 전단부를 포함 하는 송수신 경로와; 상기 제1 대역에 대응하는 제3 전단부 및 상기 제4 대역에 대응하는 제4 전단부를 포함하 는 수신 경로와; 상기 제1 전단부, 상기 제2 전단부, 상기 제3 전단부, 및 상기 제4 전단부 중 선택된 하나를 제1, 제2, 제3, 및 제4 서브 스위치와 각각 연결되도록 하는 메인 스위치를 포함할 수 있다. 상기 제1 내지 제8 안테나 중 적어도 하나는 주변 도전성 부재의 적어도 일부분을 포함할 수 있다. 상기 안테나 모듈에서 동일한 대역의 2개의 안테나들에 각각 상기 제1 서브 스위치, 제2 서브 스위치, 제3 서브 스위치, 및 제4 서브 스위치 가 연결되어, 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가각각 연결된 2개의 안테나들 중 하나의 안테나를 상기 메인 스위치와 선택적으로 연결되도록 할 수 있다. 예를 들어, 상기 전자 장치는, 상기 송수신 경로 또는 상기 수신 경로에 대응하는 무선 통신 방식과 다른 무선 통신 방식의 통신 모듈을 상기 안테나 모듈의 안테나 중 하나와 연결하는 익스트랙터(extractor), 또는 상기 안 테나 모듈의 제1 안테나 와 제2 안테나를 상기 송수신 경로 또는 상기 수신 경로와 상기 통신 모듈과 선택적으 로 연결하는 스위치를 포함할 수 있다. 예를 들어, 상기 전자 장치는, 상기 제1 서브 스위치, 상기 제2 서브 스위치, 상기 제3 서브 스위치, 및 상기 제4 서브 스위치가 각각 연결된 2개의 안테나들 중 상기 메인 스위치와 연결되지 않은 안테나를 로드(load)와 연결되도록 하거나 또는 개방되도록 할 수 있다. 다양한 실시 예에 따르면, 하우징 주위에서 연결되는 주변 전도성 부재와, 복수의 안테나들을 포함하며, 상기 복수의 안테나들 중 적어도 하나는 상기 주변 도전성 부재의 적어도 일부분을 포함하는 전자 장치의 제어 방법 에 있어서, 상기 복수의 안테나들 중 하나 이상의 안테나로 수신된 신호를 수신하는 동작과; 상기 복수의 안테 나들 중 두 개 이상의 안테나들로 상기 신호를 수신할 때 다이버시티 동작을 수행하고; 상기 수신된 신호의 전 계 강도를 측정하는 동작과; 상기 전계 강도를 임계값과 비교하는 동작; 상기 비교 동작에 따라 수신 안테나를 추가하거나 또는 수신 안테나 수를 유지하도록 하는 동작을 포함할 수 있다. 상기 복수의 안테나들 중 하나 이 상의 안테나로 수신된 신호는, 상기 복수의 안테나들이 공통으로 지원하는 주파수 대역의 신호일 수 있다. 예를 들어, 상기 하나 이상의 안테나는, 신호의 송신 동작을 수행하며, 상기 전계 강도가 상기 제1 기준 전계 강도보다 작으면, 상기 전계 강도를 제2 기준 전계 강도와 비교하는 동작과; 상기 전계 강도가 상기 제2 기준 전계 강도보다 작으면, 상기 전계 강도를 제3 기준 전계 강도와 비교하는 동작과; 상기 전계 강도가 상기 제3 기준 전계 강도보다 작으면, 상기 전자 장치를 4차 다이버시티 수신 동작을 하도록 제어하며, 상기 전계 강도가 상기 제1 기준 전계 강도 이상이면, 지정된 안테나가 신호의 수신 동작을 하도록 제어하는 동작과; 상기 전계 강도가 상기 제2 기준 전계 강도 이상이면, 상기 전자 장치를 2차 다이버시티 수신 동작을 하도록 제어하는 동 작과; 상기 전계 강도가 상기 제3 기준 전계 강도 이상이면, 상기 전자 장치를 3차 다이버시티 수신 동작을 하 도록 제어하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치의 제어 방법에 있어서, 상기 전자 장치의 송신 전력을 확인하는 동작과; 상기 송신 전력이 지정된 기준 값에 도달하거나, 또는 상기 송신 전력이 지정된 기준 값에 도달한 상태에서 상 기 송신 전력의 상향 명령을 확인하면, 복수의 안테나들 각각의 수신 전계 및 기 측정된 오프셋을 이용하여, 복 수의 안테나들간의 성능을 비교하는 동작과; 상기 비교 결과에 따라, 신호의 송신을 수행하는 하나의 안테나를 결정하는 동작을 포함할 수 있다.본 문서에서 사용된 용어 \"연결\"은, 전기적으로 연결되는 것을 의미할 수 있다. 또한, 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또 는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구 현될 수 있다. 예를 들면,\"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application- specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로 그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구 현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에서 기재 된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변 경 또는 다양한 다른 실시예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2015-0139587", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 네트워크 환경을 도시한다. 도 2는 다양한 실시 예에 따른 전자 장치의 블록도를 도시한다. 도 3은 다양한 실시 예에 따른 프로그램 모듈의 블록도를 도시한다. 도 4는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 블록 구성도이다. 도 5는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 6은 고 대역 안테나의 반사손실(S11)을 나타낸 그래프이다. 도 7은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 8은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 9는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 10은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 11은 2개의 안테나의 주파수 대역을 나타내는 도면이다. 도 12a 내지 도 12e는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 13은 다양한 실시 예에 따른 전자 장치의 안테나들을 나타낸 도면이다. 도 14는 다양한 실시 예에 따른 전자 장치의 안테나 다이버시티 차수를 결정하는 동작의 흐름도이다. 도 15는 다양한 실시 예에 따른 전자 장치의 안테나 다이버시티 차수를 결정하는 동작의 흐름도이다. 도 16은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 동작의 흐름도이다. 도 17은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 18은 다양한 실시 예에 따른 전자 장치의 4P4T 스위치를 설명하기 위한 도면이다. 도 19는 와이파이 모듈과 LTE의 대역을 도시한다. 도 20은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 21은 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치의 회로도이다. 도 22는 다양한 실시 예에 따른 인접한 안테나가 지원하지 않는 주파수 영역으로 이동 시키거나 변형시킨 예를 나타낸 그래프이다. 도 23은 다양한 실시 예에 따른 전자 장치의 사시도이다. 도 24는 다양한 실시 예에 따른 복수의 안테나들을 포함하는 전자 장치를 나타낸 도면이다. 도 25는 본 발명의 다양한 실시 예에 따른 전자 장치의 구성도이다."}
