{"patent_id": "10-2022-0130525", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0051364", "출원번호": "10-2022-0130525", "발명의 명칭": "인공지능 모델을 이용한 수하물 내 위험물 탐지 방법", "출원인": "호남대학교 산학협력단", "발명자": "이상현"}}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수하물이 촬영된 엑스레이 영상을 수집하는 단계;상기 엑스레이 영상을 보정하는 단계;상기 엑스레이 영상으로부터 특징을 추출하는 단계;상기 추출된 특징을 RPN(Region Proposal Network) 모델에 입력하여 상기 수하물 내 위험물의 예상 앵커 박스를획득하는 단계; 및상기 예상 앵커 박스를 CNN(Convolutional Neural Network) 모델에 입력하여 상기 예상 앵커 박스를 개선하고,상기 개선된 예상 앵커 박스에 대응하는 특징에 기초하여 상기 위험물을 탐지하는 단계를 포함하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 엑스레이 영상을 보정하는 단계는상기 엑스레이 영상에 감마 보정(Gamma correction)을 적용하는 단계를 포함하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 엑스레이 영상을 보정하는 단계는하기 [수학식 1]에 따라 감마 보정을 적용하는 단계를 포함하는[수학식 1] (여기서 G는 개선된 엑스레이 영상의 그레이 스케일(gray scale)값, 는 상기 엑스레이 영상의 계조(gradation)값, 는 상기 엑스레이 영상의 최대 계조값, 은 감마계수)수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 특징을 추출하는 단계는복수의 컨볼루션 레이어를 포함하는 신경망 모델을 이용하여 상기 특징을 추출하는 단계를 포함하는공개특허 10-2024-0051364-3-수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 CNN 모델은, 상기 엑스레이 영상 중 상기 예상 앵커 박스 내 객체를 분류(classification)하고, 상기 객체를 구획하는 바운딩 박스를 출력함으로써 상기 앵커 박스를 개선하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 CNN 모델은 직렬 연결된 복수의 분류기를 포함하고,각 분류기는 이전 분류기를 통해 개선된 앵커 박스 내 객체에 대한 분류 태스크를 수행하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 각 분류기는 이전 분류기보다 높은 IoU(Intersection over Union)를 갖는 바운딩 박스를 출력하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 위험물을 탐지하는 단계는상기 개선된 앵커 박스에 대응하는 특징에 기초하여 상기 개선된 앵커 박스 내 객체의 클래스를 식별하는 단계와,상기 식별된 클래스에 기초하여 상기 위험물의 종류를 결정하는 단계를 포함하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 위험물을 탐지하는 단계 이전에,상기 학습 영상과 상기 학습 영상에 대응하는 실측값로 이루어진 훈련 데이터셋을 이용하여 상기 CNN 모델을 일차 학습시키는 단계;상기 일차 학습된 CNN 모델에 복수의 엑스레이 영상을 입력하여 상기 CNN 모델의 예측 신뢰도를 각 엑스레이 영상별로 획득하는 단계;상기 예측 신뢰도가 기준값 이상인 엑스레이 영상을 의사 레이블링(pseudo-labeling)하는 단계; 및상기 의사 레이블링된 엑스레이 영상을 이용하여 상기 CNN 모델을 이차 학습시키는 단계를 더 포함하는공개특허 10-2024-0051364-4-수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 CNN 모델을 일차 학습시키는 단계는상기 학습 영상에 플립(flip) 및 회전 중 적어도 하나를 적용하여 상기 훈련 데이터셋을 증강하는 단계와,상기 증강된 훈련 데이터셋을 이용하여 상기 CNN 모델을 일차 학습시키는 단계를 포함하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 예측 신뢰도가 기준값 미만인 엑스레이 영상을 상기 이차 학습된 CNN 모델에 입력하여 예측 신뢰도를 재산출하는 단계;상기 재산출된 예측 신뢰도가 기준값 이상인 엑스레이 영상을 다시 의사 레이블링 하는 단계; 및상기 의사 레이블링된 엑스레이 영상을 이용하여 상기 CNN 모델을 삼차 학습시키는 단계를 더 포함하는수하물 내 위험물 탐지 방법."}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 수하물이 촬영된 엑스레이(X-ray) 영상을 인공지능 모델에 입력하여 수하물 내 위험물을 탐지하는 방 법에 관한 것이다. 본 발명의 일 실시예에 따른 수하물 내 위험물 탐지 방법은 수하물이 촬영된 엑스레이 영상을 수집하는 단계, 상기 엑스레이 영상을 보정하는 단계, 상기 엑스레이 영상으로부터 특징을 추출하는 단계, 상기 추출된 특징을 RPN(Region Proposal Network) 모델에 입력하여 상기 수하물 내 위험물의 예상 앵커 박스를 획득 하는 단계 및 상기 예상 앵커 박스를 CNN(Convolutional Neural Network) 모델에 입력하여 상기 예상 앵커 박스 를 개선하고, 상기 개선된 예상 앵커 박스에 대응하는 특징에 기초하여 상기 위험물을 탐지하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 수하물이 촬영된 엑스레이(X-ray) 영상을 인공지능 모델에 입력하여 수하물 내 위험물을 탐지하는 방 법에 관한 것이다."}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "엑스레이(X-ray)는 전자기파의 일종으로 파장이 짧고 주파수가 높으며 투과력이 강해 보안검사 분야에서 널리 활용되고 있다. 특히, 공항에서는 컨베이어 벨트를 따라 이동하는 수하물에 엑스레이를 조사한 뒤 수하물을 투 과한 엑스레이를 검출하여 영상을 생성하고, 엑스레이 영상을 보안 담당자가 검사하는 방식으로 수하물 내 위험 물을 탐지하고 있다. 컴퓨터 비전 기술이 발달한 현 시점에도 공항의 출국장에는 항상 보안 담당자가 상주해 육안으로 하나하나 엑스 레이 영상을 검사하고 있는데, 이러한 방식은 많은 시간이 소요되므로, 출국 수속을 서둘러야 하는 가장 큰 이 유가 되고 있다. 이에 따라, 보안 담당자의 육안 검사 없이도 수하물 내 위험물을 정확하고 빠르게 탐지하는 기술이 요구되고 있 다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "(특허문헌 0001) 대한민국 등록특허공보 제10-2015391호(2019.08.22.) 발명의 내용"}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 수하물이 촬영된 엑스레이 영상을 인공지능 모델에 입력하여 수하물 내 위험물을 탐지하는 것을 목적 으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 수하물 내 위험물 탐지 방법은 수하물이 촬영된 엑스 레이 영상을 수집하는 단계, 상기 엑스레이 영상을 보정하는 단계, 상기 엑스레이 영상으로부터 특징을 추출하 는 단계, 상기 추출된 특징을 RPN(Region Proposal Network) 모델에 입력하여 상기 수하물 내 위험물의 예상 앵 커 박스를 획득하는 단계 및 상기 예상 앵커 박스를 CNN(Convolutional Neural Network) 모델에 입력하여 상기 예상 앵커 박스를 개선하고, 상기 개선된 예상 앵커 박스에 대응하는 특징에 기초하여 상기 위험물을 탐지하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 엑스레이 영상을 보정하는 단계는, 상기 엑스레이 영상에 감마 보정(Gamma correction)을 적용하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 엑스레이 영상을 보정하는 단계는, 하기 [수학식 1]에 따라 감마 보정을 적용하는 단계를 포함하는 것을 특징으로 한다. [수학식 1]"}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "(여기서 G는 개선된 엑스레이 영상의 그레이 스케일(gray scale)값, 는 상기 엑스레이 영상의 계조(gradatio n)값, 는 상기 엑스레이 영상의 최대 계조값, 은 감마계수) 일 실시예에서, 상기 특징을 추출하는 단계는, 복수의 컨볼루션 레이어를 포함하는 신경망 모델을 이용하여 상 기 특징을 추출하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 CNN 모델은, 상기 엑스레이 영상 중 상기 예상 앵커 박스 내 객체를 분류(classificatio n)하고, 상기 객체를 구획하는 바운딩 박스를 출력함으로써 상기 앵커 박스를 개선하는 것을 특징으로 한다. 일 실시예에서, 상기 CNN 모델은 직렬 연결된 복수의 분류기를 포함하고, 각 분류기는 이전 분류기를 통해 개선 된 앵커 박스 내 객체에 대한 분류 태스크를 수행하는 것을 특징으로 한다. 일 실시예에서, 상기 각 분류기는 이전 분류기보다 높은 IoU(Intersection over Union)를 갖는 바운딩 박스를 출력하는 것을 특징으로 한다. 일 실시예에서, 상기 위험물을 탐지하는 단계는, 상기 개선된 앵커 박스에 대응하는 특징에 기초하여 상기 개선 된 앵커 박스 내 객체의 클래스를 식별하는 단계와, 상기 식별된 클래스에 기초하여 상기 위험물의 종류를 결정 하는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 위험물을 탐지하는 단계 이전에, 상기 학습 영상과 상기 학습 영상에 대응하는 실측값로 이루어진 훈련 데이터셋을 이용하여 상기 CNN 모델을 일차 학습시키는 단계, 상기 일차 학습된 CNN 모델에 복수 의 엑스레이 영상을 입력하여 상기 CNN 모델의 예측 신뢰도를 각 엑스레이 영상별로 획득하는 단계, 상기 예측 신뢰도가 기준값 이상인 엑스레이 영상을 의사 레이블링(pseudo-labeling)하는 단계 및 상기 의사 레이블링된 엑스레이 영상을 이용하여 상기 CNN 모델을 이차 학습시키는 단계를 더 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 CNN 모델을 일차 학습시키는 단계는, 상기 학습 영상에 플립(flip) 및 회전 중 적어도 하 나를 적용하여 상기 훈련 데이터셋을 증강하는 단계와, 상기 증강된 훈련 데이터셋을 이용하여 상기 CNN 모델을 일차 학습시키는 단계를 포함하는 것을 특징으로 한다. 일 실시예에서, 상기 예측 신뢰도가 기준값 미만인 엑스레이 영상을 상기 이차 학습된 CNN 모델에 입력하여 예 측 신뢰도를 재산출하는 단계, 상기 재산출된 예측 신뢰도가 기준값 이상인 엑스레이 영상을 다시 의사 레이블 링 하는 단계 및 상기 의사 레이블링된 엑스레이 영상을 이용하여 상기 CNN 모델을 삼차 학습시키는 단계를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인공지능 모델을 이용하여 수하물 내 위험물을 탐지함으로써 수하물의 육안 검사를 위한 시간과 인력 소모를 없앨 수 있고, 탑승객의 출국 수속 시간을 줄여 공항 혼잡도를 낮출 수 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용 하는 것으로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 또한, 본 명세서에서 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한, 본 명세서에서 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개 재\"되거나, 각 구성요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다.또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 본 명세서에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B를 의미하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 본 발명은 수하물이 촬영된 엑스레이(X-ray) 영상을 인공지능 모델에 입력하여 수하물 내 위험물을 탐지하는 방 법에 관한 것이다. 이하, 도 1 내지 도 10을 참조하여, 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 수 하물 내 위험물 탐지 방법(이하, 수하물 내 위험물 탐지 방법)을 구체적으로 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 수하물 내 위험물 탐지 방법을 도시한 순서도이다. 도 2는 본 발명의 일 실시예에 따른 엑스레이 영상을 도시한 도면이고, 도 3은 엑스레이 영상으로부터 특징을 추출하는 과정을 도시한 도면이며, 도 4는 특징 추출 신경망 모델의 일 예를 도시한 도면이다. 도 5는 RPN(Region Proposal Network) 모델을 이용하여 예상 앵커 박스를 생성하는 과정을 도시한 도면이고, 도 6 및 도 7은 CNN(Convolutional Neural Network) 모델을 이용하여 예상 앵커 박스를 개선하는 과정을 도시한 도면이다. 도 8은 수하물 내 위험물을 탐지하기 위한 전체 아키텍처를 도시한 도면이다. 도 9는 본 발명의 일 실시예에 따른 CNN 모델의 학습 방법을 도시한 순서도이고, 도 10은 학습 데이터의 증강 유형을 도시한 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 수하물 내 위험물 탐지 방법은 엑스레이(X-ray) 영상을 수집하는 단계(S10), 엑스레이 영상을 보정하는 단계(S20), 엑스레이 영상의 특징을 추출하는 단계(S30), 추출된 특징을 RRN(Region Proposal Network) 모델에 입력하여 위험물의 예상 앵커 박스를 획득하는 단계(S40), 예상 앵커 박 스를 CNN(Convolutional Neural Network) 모델에 입력하여 예상 앵커 박스를 개선하는 단계(S50) 및 개선된 앵 커 박스에 대응하는 특징에 기초하여 위험물을 탐지하는 단계(S60)를 포함할 수 있다. 다만, 도 1에 도시된 수하물 내 위험물 탐지 방법은 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 1 에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 단계가 부가, 변경 또는 삭제될 수 있다. 도 1에 도시된 각 단계들은 CPU(central processing unit), GPU(graphics processing unit) 등과 같은 프로세 서에 의해 수행될 수 있으며, 프로세서는 후술하는 발명의 동작을 수행하기 위하여 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기(controller), 마이크로 컨트롤러(micro-controllers) 중 적어도 하나의 물리적인 요소를 더 포함할 수 있다. 이하, 도 1에 도시된 각 단계들을 구체적으로 설명하도록 한다. 프로세서는 수하물이 촬영된 엑스레이 영상을 수집할 수 있다(S10). 본 발명에서 엑스레이 영상은 X선 의 파장을 포함하는 전자기파에 의해 촬영된 영상을 의미할 수 있다. 도 2를 참조하면, 본 발명의 엑스레이 영상에는 수하물이 촬영될 수 있으며, 프로세서는 공항이나 항구 등 에서 수하물 검사를 위해 활용되는 엑스레이 촬영 장치로부터 엑스레이 영상을 수집할 수 있다. 도 2에 도시된 컴파스(compass)와 같은 표족한 도구(sharp tools)는 위험물(Dangerous Material)로 탐지될 필 요가 있다. 기존에는 수하물 검사를 담당하는 보안 담당자가 육안으로 위험물을 탐지하였는데, 본 발명은 인공 지능 모델을 통해 위험물을 자동으로 탐지할 수 있다. 이를 위해, 먼저 프로세서는 앞서 수집된 엑스레이 영상을 보정할 수 있다(S20). 엑스레이 영상의 색상은 촬영 대상체의 밀도에 따라 다르게 표현될 수 있다. 예컨대, 밀도가 낮은 대상체는 밝게, 밀도가 높은 대상체는 어둡게 표현될 수 있다. X선은 투과성이 강하므로 복수의 대상체가 겹쳐지더라도 엑스레이 영상 내에서 각 대상체가 구별될 수 있으나, X선의 흡수도(absorption degree)와 대상체의 밀도차 로 인해 겹쳐진 부분은 흐려질 수 있다. 이를 개선하기 위해, 프로세서는 엑스레이 영상의 콘트라스트(contrast)를 조정할 수 있다. 일 예에서, 프로세서는 엑스레이 영상에 히스토그램 평활화(histogram equalization)를 적용하여 엑스레이 영상을 보정할 수 있다. 히스토그램 평활화를 위해 다양한 기법이 적용될 수 있고, 예컨대 CLAHE 기법이 적 용될 수 있다. 다른 예에서, 프로세서는 엑스레이 영상에 감마 보정(Gamma correction)을 적용하여 엑스레이 영상을 보정할 수 있다. 감마 보정은 엑스레이 영상 내 매우 높거나 낮은 계조의 픽셀값을 보정함으로써 색상 선명 도(sharpness)를 향상시킬 수 있고, 이에 따라 이미지의 밝은 부분과 어두운 부분의 색상 대비가 증가할 수 있 다. 구체적으로, 프로세서는 하기 [수학식 1]에 따라 감마 보정을 적용할 수 있으며, 계조값은 엑스레이 영상의 각 픽셀에 대응하는 값일 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(여기서 G는 개선된 엑스레이 영상의 그레이 스케일(gray scale)값, 는 엑스레이 영상의 계조 (gradation)값, 는 엑스레이 영상의 최대 계조값, 은 감마계수) 영상 보정이 완료되면, 프로세서는 엑스레이 영상으로부터 특징(feature)을 추출할 수 있다(S30). 프로세서는 엑스레이 영상을 컨볼루션(convolution)하여 특징을 추출할 수 있고, 구체적으로는 복수의 컨볼 루션 레이어를 포함하는 신경망 모델(이하, 특징 추출 모델)을 이용하여 특징을 추출할 수 있다. 도 3을 예로 들어 설명하면, 특징 추출 모델은 여러 쌍의 컨볼루션 레이어 및 풀링(pooling) 레이어를 포 함할 수 있고, 한 쌍의 컨볼루션 레이어 및 풀링 레이어의 출력이 다음 쌍의 컨볼루션 레이어 및 풀링 레이어에 입력되는 구조를 가질 수 있다. 한편, 컨볼루션 레이어에는 배치 정규화(Batch Normalization; BN)와 ReLU(Rectified Linear Unit) 함수가 적용될 수 있다. 프로세서는 엑스레이 영상을 특징 추출 모델에 입력할 수 있다. 엑스레이 영상은 특징 추출 모델 의 첫번째 컨볼루션 레이어에 입력될 수 있고, 첫번째 컨볼루션 레이어의 출력은 첫번째 풀링 레이어에 입 력될 수 있다. 첫번째 풀링 레이어의 출력은 두번째 컨볼루션 레이어에 입력될 수 있고, 두번째 컨볼루션 레이 어의 출력은 두번째 풀링 레이어에 입력될 수 있다. 이러한 과정이 수차례 반복됨으로써 엑스레이 영상의 특징(f)이 추출될 수 있다."}
{"patent_id": "10-2022-0130525", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 4를 참조하면, 전술한 특징 추출 모델에는 당해 기술분야에서 이용되는 다양한 아키텍처가 적용될 수 있으나, 엑스레이 영상은 가시광 영상보다 특징이 덜 드러날 수 있으므로, 그 아키텍처가 가볍고 유연하면 서도 특징 손실을 줄일 수 있는 CBNetV2가 적용될 수 있다. 구체적으로, CBNetV2는 복수의 백본(backbone) 네트워크의 연결을 통해 구성될 수 있고, n-1번째 백본 네트워크 를 구성하는 각 레이어의 출력을 n번째 백본 네트워크의 동일한 레이어 및 하위 레이어의 입력으로 사용함으로 써 미세한 특징을 추출할 수 있다. 이 때, 백본 네트워크로는 Res2Net 기반의 네트워크가 적용될 수 있다. 엑스레이 영상의 특징이 추출되면, 프로세서는 추출된 특징을 RPN(Region Proposal Network) 모델에 입력하여 수하물 내 위험물의 예상 앵커 박스(AB)를 획득할 수 있다(S40). RPN 모델은 앞서 추출된 특징, 구체적으로는 특징 맵에 일정 크기의 슬라이딩 윈도우(sliding window)를 적용하여 수하물 내 객체들을 앵커 박스로 구획할 수 있다. 이 때, 어느 한 객체를 중복 구획하는 앵커 박스의 경우 NMS(Non-Maximum Suppression) 알고리즘을 통해 어느 하나만 선택될 수 있다. 도 5를 참조하면, RPN 모델의 동작에 따라 수하물 내 위험물을 구획하는 복수의 예상 앵커 박스(AB)가 획 득될 수 있다. 이 때, RPN 모델은 예상 앵커 박스(AB) 내 객체에 대한 분류(classification) 동작을 수행 하지 않으므로 예상 앵커 박스(AB)에 의해 구획된 객체들은 수하물 내 임의의 객체일 수 있다. 프로세서는 RPN 모델을 통해 획득된 예상 앵커 박스(AB)를 CNN(Convolutional Neural Network) 모델(30 0)에 입력하여 예상 앵커 박스(AB)를 개선할 수 있다(S50). 여기서 예상 앵커 박스(AB)를 개선한다는 것은 예상앵커 박스(AB)가 위험물만을 선택적으로 구획하도록 예상 앵커 박스(AB)를 갱신한다는 것으로 이해될 수 있다. 도 6을 참조하면, CNN 모델은 예상 앵커 박스(AB) 내 객체에 대한 분류 동작을 수행할 수 있다. 구체적으 로, CNN 모델은 복수의 예상 앵커 박스(AB)를 입력받고, 엑스레이 영상 중에서 복수의 예상 앵커 박스 (AB)에 대응하는 특징에 기초하여 각 예상 앵커 박스(AB) 내 객체를 분류할 수 있다. 분류 결과로서, CNN 모델은 각 예상 앵커 박스(AB) 내 객체의 클래스(class#)와 각 객체를 구획하는 바운 딩 박스(Bounding Box; BB)를 출력할 수 있다. 여기서 각 CNN 모델에서 출력되는 바운딩 박스(BB)는 해당 CNN 모델에 입력된 예상 앵커 박스(AB)가 개선된 것, 즉 개선된 예상 앵커 박스(이하, 개선 앵커 박스 (AB'))일 수 있다. 이러한 개선 동작에 의해, CNN 모델에서 출력된 바운딩 박스(BB)와 실측값(Ground Truth; GT) 간의 IoU(Intersection over Union)는 해당 CNN 모델에 입력된 예상 앵커 박스(AB)와 실측값(GT) 간의 IoU보다 높을 수 있다. 이어서, 프로세서는 개선 앵커 박스(AB')에 대응하는 특징에 기초하여 위험물을 탐지할 수 있다(S60). 다시 도 6을 참조하면, CNN 모델은 앞서 설명한 것과 같이 개선 앵커 박스(AB')를 출력할 수 있고, 개선 앵커 박스(AB') 내 객체에 대한 분류 동작을 수행할 수 있다. 구체적으로, CNN 모델은 엑스레이 영상 중에서 개선 앵커 박스(AB')에 대응하는 특징에 기초하여 개선 앵커 박스(AB') 내 객체를 위험물로 분류할 수 있다. 분류 결과로서, CNN 모델은 개선 앵커 박스(AB') 내 객체의 클래스를 식별할 수 있고, 프로세서는 식별된 클래스에 기초하여 위험물의 종류를 결정할 수 있다. 예를 들어, 위험물의 클래스는 아래 [표 1]과 같이 정의될 수 있다. 표 1 No. 클래스(class) 0 Knife 1 Scissors 2 Sharp tools 3 Glass 4 Electronic equipment 5 Battery 6 Umbrella 7 Lighter 도 6에 도시된 예에서, CNN 모델은 개선 앵커 박스(AB') 내 객체를 분류하고 클래스에 대응하는 숫자 '2' 를 출력할 수 있다. 프로세서는 CNN 모델에서 출력된 숫자 '2'에 기초하여 위험물의 종류를 표족한 도구 (sharp tools)로 결정할 수 있다. 한편, 전술한 예상 앵커 박스(AB) 개선 동작과 위험물 분류 동작은 복수의 분류기(classifier)를 통해 수행될 수 있다. 구체적으로, CNN 모델은 직렬 연결된 복수의 분류기를 포함할 수 잇고, 각 분류기는 이전 분류기 를 통해 개선된 앵커 박스 내 객체에 대한 분류 태스크를 수행할 수 있다. 도 7을 예로 들어 설명하면, CNN 모델은 제1 내지 제3 분류기(CF1, CF2, CF3)를 포함할 수 있다. RPN 모 델에서 출력된 예상 앵커 박스(AB)는 제1 분류기(CF1)에 입력될 수 있고, 제1 분류기(CF1)는 예상 앵커 박 스(AB) 내 객체의 클래스와 해당 객체를 구획하는 바운딩 박스(BB)를 출력할 수 있다. 제1 분류기(CF1)에서 출력된 바운딩 박스(BB)는 1차 개선 앵커 박스(AB')로 설정되어 제2 분류기(CF2)에 입력될 수 있고, 제2 분류기(CF2)는 1차 개선 앵커 박스(AB') 내 객체의 클래스와 해당 객체를 구획하는 바운딩 박스 (BB)를 출력할 수 있다. 제2 분류기(CF2)에서 출력된 바운딩 박스(BB)는 2차 개선 앵커 박스(AB'')로 설정되어 제3 분류기(CF3)에 입력 될 수 있고, 제3 분류기(CF3)는 2차 개선 앵커 박스(AB'') 내 객체의 클래스와 해당 객체를 구획하는 바운딩 박 스(BB)를 출력할 수 있다. 이 때, 제3 분류기(CF3)에서 출력되는 클래스는 위험물의 종류에 대응될 수 있다.한편, 이와 같이 복수의 분류기가 직렬 연결된 경우, 각 분류기는 이전 분류기보다 높은 IoU를 갖는 바운딩 박 스(BB)를 출력할 수 있다. 다시 말해, 도 7에서 제1 분류기(CF1)는 예상 앵커 박스(AB)보다 높은 IoU를 갖는 바 운딩 박스(BB)를, 제2 분류기(CF2)는 1차 개선 앵커 박스(AB')보다 높은 IoU를 갖는 바운딩 박스(BB)를, 제3 분 류기(CF3)는 2차 개선 앵커 박스(AB')보다 높은 IoU를 갖는 바운딩 박스(BB)를 출력할 수 있다. 이에 따라, 분 류 동작이 거듭될수록 각 분류기에서 출력되는 바운딩 박스(BB)는 위험물만을 선택적으로 구획할 수 있다. 한편, 이러한 분류기의 동작을 위해, CNN 모델의 학습 시 각 분류기의 IoU 문턱값(threshold)은 이전 분류 기보다 높게 설정될 수 있다. 이하 도 8을 예로 들어 전술한 위험물 탐지 방법을 전체적으로 설명하면, 엑스레이 영상은 CBNetV2 아키텍 처가 적용된 특징 추출 모델에 입력될 수 있다. 특징 추출 모델에 의해 추출된 특징들은 RPN 모델 에 입력될 수 있고, RPN 모델은 수하물 내 위험물에 대한 예상 앵커 박스(AB)를 출력할 수 있다. 예상 앵커 박스(AB)는 제1 내지 제3 분류기(CF1, CF2, CF3)를 포함하는 CNN 모델에 입력될 수 있다. 구체 적으로, 예상 앵커 박스(AB)는 제1 분류기(CF1)에 입력될 수 있고, 제1 분류기(CF1)는 예상 앵커 박스(AB)에 대 한 RoI(Region of Interest) 풀링(RoI1)을 통해 특징을 추출하고, 추출된 특징을 완전 연결(Fully Connected; FC) 레이어(FC1)에 통과시켜 예상 앵커 박스(AB) 내 객체의 클래스(C1)와, 객체를 구획하는 바운딩 박스(B1)를 출력할 수 있다. 제1 분류기(CF1)에서 출력된 바운딩 박스(B1)는 1차 개선 앵커 박스(AB')로서 제2 분류기(CF2)에 입력될 수 있 고, 제2 분류기(CF2)는 입력된 1차 개선 앵커 박스(AB')에 대한 RoI 풀링(RoI2)을 통해 특징을 추출하고, 추출 된 특징을 완전 연결 레이어(FC2)에 통과시켜 1차 개선 앵커 박스(AB') 내 객체의 클래스(C2)와, 객체를 구획하 는 바운딩 박스(B2)를 출력할 수 있다. 제2 분류기(CF2)에서 출력된 바운딩 박스(B2)는 2차 개선 앵커 박스(AB'')로서 제3 분류기(CF3)에 입력될 수 있 고, 제3 분류기(CF3)는 입력된 2차 개선 앵커 박스(AB'')에 대한 RoI 풀링(RoI3)을 통해 특징을 추출하고, 추출 된 특징을 완전 연결 레이어(FC3)에 통과시켜 2차 개선 앵커 박스(AB'') 내 객체의 클래스(C3)와, 객체를 구획하 는 바운딩 박스(B3)를 출력할 수 있다. 프로세서는 제3 분류기(CF3)에서 출력된 객체의 클래스(C3)에 기초하여 수하물 내 위험물의 종류를 결정할 수 있고, 바운딩 박스(B3)에 기초하여 위험물의 위치를 식별할 수 있다. 전술한 바와 같이, 본 발명은 인공지능 모델을 이용하여 수하물 내 위험물을 탐지함으로써 수하물의 육안 검사 를 위한 시간과 인력 소모를 없앨 수 있고, 탑승객의 출국 수속 시간을 줄여 공항 혼잡도를 낮출 수 있다. 이하에서는 전술한 CNN 모델의 학습 방법에 대해 구체적으로 설명하도록 한다. 도 9를 참조하면, CNN 모델 학습 방법은 훈련 데이터셋을 구축하는 단계(S1), 훈련 데이터셋을 증강하는 단계(S2), 훈련 데이터셋을 이용하여 CNN 모델을 학습시키는 단계(S3), CNN 모델에 엑스레이 영상을 입력하는 단계(S4) 및 CNN 모델의 신뢰도를 기준값과 비교하여 의사 레이블링(pseudo-labeling)을 수행하는 단계(S6)를 포함할 수 있다. 다만, 도 9에 도시된 CNN 모델 학습 방법은 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 9에 도시 된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 단계가 부가, 변경 또는 삭제될 수 있다. 도 9에 도시된 각 단계들은 전술한 위험물 탐지 동작 이전에 수행될 수 있으며, CNN 모델의 학습에 이용되 는 라벨링되지 않은(unlabeled) 엑스레이 영상(10')은 위험물 탐지에 이용된 엑스레이 영상과 다른 식별번 호(10')로 표시하도록 한다. 이하 도 9에 도시된 각 단계들을 구체적으로 설명하도록 한다. 프로세서는 학습 영상과 학습 영상에 대응하는 실측값으로 이루어진 훈련 데이터셋을 구축할 수 있다 (S1). 여기서 학습 영상은 CNN 모델의 학습을 위해 미리 준비된 엑스레이 영상일 수 있고, 실측값은 학습 영상 내 위험물을 구획하는 실측 바운딩 박스(BB) 및 해당 위험물의 클래스를 포함하며 사용자에 의해 미리 라벨링될 수 있다. 한편, 수하물이 촬영된 엑스레이 영상의 경우 촬영 장비 및 촬영 장소의 특수성으로 인해 훈련 데이터셋을 확보 하기 어려울 수 있다. 이를 해결하기 위해 본 발명의 프로세서는 훈련 데이터셋을 증강(augmentation)할 수 있다(S2). 구체적으로, 프로세서는 마스킹된 위험물을 라벨링되지 않은 엑스레이 영상에 카피-페이스트(copy-paste)하 여 새로운 학습 영상을 생성할 수도 있다. 또한, 프로세서는 기존의 학습 영상에 플립(flip) 및 회전 중 적어도 하나를 적용하여 훈련 데이터셋을 증강할 수 있다. 도 10을 참조하면, 프로세서는 학습 영상을 플립하거나, 회전시키거나, 플립과 회전을 모두 적용하여 학습 영상을 증강시킬 수 있다. 이 경우, 증강 대상인 학습 영상은 이미 라벨링된 훈련 데이터이므로, 증강 된 데이터는 별도 라벨링 없이도 CNN 모델의 학습에 이용할 수 있다. 프로세서는 학습 영상 및 실측값을 각각 CNN 모델의 입력 및 출력으로 설정하여 CNN 모델을 일차 적으로 지도 학습(supervised learning)시킬 수 있다(S3). 이에 따라, CNN 모델은 학습 영상에서 추 출된 특징과 실측값 간의 상관관계를 학습할 수 있고, CNN 모델을 구성하는 각 레이어의 파라미터(가중치 (weight) 및 바이어스(bias))는 학습에 따라 갱신될 수 있다. CNN 모델의 일차 학습이 완료되면, 프로세서는 CNN 모델에 라벨링되지 않은 복수의 엑스레이 영상 (10')을 입력하여 CNN 모델의 예측 신뢰도(confidence)를 각 엑스레이 영상(10')별로 획득할 수 있다. 일차 학습된 CNN 모델은 라벨링되지 않은 엑스레이 영상(10')을 입력받고, 해당 엑스레이 영상(10') 내 위 험물의 클래스별 예측 신뢰도를 출력할 수 있다. [표 1]을 예로 들어 설명하면, CNN 모델은 8개의 클래스 에 대한 예측 신뢰도를 출력할 수 있다(8개 클래스에 대한 예측 신뢰도의 총 합은 1). 프로세서는 CNN 모델을 추가 학습시키기 위해 예측 신뢰도를 기준값과 비교하고(S5), 기준값 이상의 예측 신뢰도를 갖는 엑스레이 영상(10')을 의사 레이블링(pseudo-labeling)할 수 있다(S6). 구체적으로, 프로세서는 CNN 모델에서 출력된 예측 신뢰도 중 어느 하나가 기준값 이상인 엑스레이 영상 (10')을 식별하고, 식별된 엑스레이 영상(10')을 기준값 이상인 예측 신뢰도에 대응하는 클래스로 의사 레이블 링할 수 있다. 기준값이 0.5로 설정된 경우 [표 1]을 예로 들어 설명하면, 라벨링되지 않은 엑스레이 영상(10')을 입력받은 CNN 모델은 0번 클래스에 대해 0.7의 예측 신뢰도를 출력할 수 있다. 이 때, 프로세서는 0번 클래스에 대 한 예측 신뢰도(0.7)가 0.5 이상이므로 해당 엑스레이 영상(10')에 0번 클래스 및/또는 CNN 모델에서 출력 된 바운딩 박스를 의사 레이블링할 수 있다. 이어서, 프로세서는 의사 레이블링된 엑스레이 영상(10')을 이용하여 CNN 모델을 이차 학습시킬 수 있다. 다시 말해, 프로세서는 일차 학습 시 이용되었던 훈련 데이터셋에 의사 레이블링된 엑스레이 영상(10')을 추가 하고, 데이터량이 증가된 훈련 데이터셋을 이용하여 다시 CNN 모델을 학습시킬 수 있다. 이러한 과정은 라 벨링되지 않았던 엑스레이 영상(10')이 모두 의사 레이블링 될 때까지 반복될 수 있다. 구체적으로, 프로세서는 일차 학습된 CNN 모델에서 출력된 예측 신뢰도가 기준값 미만이었던 엑스레이 영 상(10')을, 이차 학습된 CNN 모델에 입력하여 엑스레이 영상(10')별 예측 신뢰도를 재산출할 수 있다. 이 어서, 프로세서는 재산출된 예측 신뢰도가 기준값 이상인 엑스레이 영상(10')을 다시 의사 레이블링할 수 있고, 의사 레이블링된 엑스레이 영상(10')을 훈련 데이터셋에 추가하여 CNN 모델을 삼차 학습시킬 수 있다. 마찬가지의 방법으로 프로세서는 이차 학습된 CNN 모델에서 출력된 예측 신뢰도가 기준값 미만이었던 엑스 레이 영상(10')을, 삼차 학습된 CNN 모델에 입력하여 엑스레이 영상(10')별 예측 신뢰도를 또 다시 산출할 수 있다. 이어서, 프로세서는 재산출될 예측 신뢰도가 기준값 이상인 엑스레이 영상(10')을 또 다시 의사 레이 블링할 수 있고, 의사 레이블링된 엑스레이 영상(10')을 훈련 데이터셋에 추가하여 CNN 모델을 사차 학습 시킬 수 있다. 이러한 방법을 통해 라벨링되지 않았던 모든 엑스레이 영상(10')은 프로세서에 의해 의사 레이블링될 수 있고, CNN 모델은 의사 레이블링을 통해 증가된 많은 양의 훈련 데이터셋에 의해 학습될 수 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2022-0130525", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 모델을 이용한 수하물 내 위험물 탐지 방법을 도시한 순서도. 도 2는 본 발명의 일 실시예에 따른 엑스레이 영상을 도시한 도면. 도 3은 엑스레이 영상으로부터 특징을 추출하는 과정을 도시한 도면. 도 4는 특징 추출 신경망 모델의 일 예를 도시한 도면. 도 5는 RPN(Region Proposal Network) 모델을 이용하여 예상 앵커 박스를 생성하는 과정을 도시한 도면. 도 6 및 도 7은 CNN(Convolutional Neural Network) 모델을 이용하여 예상 앵커 박스를 개선하는 과정을 도시 한 도면. 도 8은 수하물 내 위험물을 탐지하기 위한 전체 아키텍처를 도시한 도면. 도 9는 본 발명의 일 실시예에 따른 CNN 모델의 학습 방법을 도시한 순서도. 도 10은 학습 데이터의 증강 유형을 도시한 도면."}
