{"patent_id": "10-2014-0145540", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0048589", "출원번호": "10-2014-0145540", "발명의 명칭": "커플링을 이용하는 안테나 및 전자 장치", "출원인": "삼성전자주식회사", "발명자": "신동률"}}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 분절부를 포함하는 상기 전자 장치의 하우징; 및안테나;를 포함하고,상기 안테나의 끝 단은 상기 분절부에 대응하는 위치에 배치된 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,접지부; 및 상기 접지부의 적어도 일부로부터 연장된 연장부를 더 포함하고,상기 안테나의 끝 단은 상기 연장부와 커플링되는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 안테나는 단일 밴드 또는 다중 밴드를 지원하는 역 F 안테나(inverted F antenna)인 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 하우징은 금속 하우징인 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서,상기 연장부는 상기 하우징과 연결되는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 연장부는 상기 접지부의 적어도 일부로부터 직접 연장된 것이거나, 용량성 소자를 통해 연장된 것인, 전자장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 2에 있어서,공개특허 10-2016-0048589-3-상기 연장부는 복수개이고,상기 복수의 연장부 각각은 상기 접지부의 서로 다른 위치로부터 연장된 것이고,상기 안테나의 끝 단 및 상기 안테나의 적어도 일부는 상기 복수의 연장부 각각과 커플링되는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 2에 있어서,상기 안테나는 역 F 안테나이고,상기 안테나는, 상기 역 F 안테나의 'F' 형상의 제1 안테나 패턴;상기 제1 안테나 패턴의 끝 단으로부터 꺽이며 연장된 제2 안테나 패턴; 및상기 제2 안테나 패턴의 끝 단으로부터 꺽이며 연장된 제3 안테나 패턴을 포함하는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 제3 안테나 패턴은 상기 전자 장치의 하우징과 나란히 배치되는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 안테나의 끝 단과 상기 연장부와의 커플링은,상기 제3 안테나 패턴의 끝 단과 상기 연장부와의 점 대 점(point to point) 커플링을 나타내는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8에 있어서,상기 제2 안테나 패턴은 다른 연장부와 나란히 배치되고,상기 제2 안테나 패턴은 상기 다른 연장부와 커플링되는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 안테나는 복수개이고,상기 복수의 안테나 각각은 서로 다른 밴드를 지원하는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,공개특허 10-2016-0048589-4-상기 복수의 안테나 각각은 안테나 패턴의 길이를 달리하는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서,상기 복수의 안테나 각각은 안테나 패턴의 두께를 달리하는 것인, 전자 장치."}
{"patent_id": "10-2014-0145540", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "안테나에 있어서,안테나 패턴;상기 안테나에 전력을 공급하는 급전부; 및전자 장치의 접지 영역에 접지되는 접지부;를 포함하고,상기 안테나 패턴의 끝 단은 상기 전자 장치의 하우징에 포함된 분절부에 대응하는 위치에 배치된 것인,안테나."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치에 관한 것으로, 분절부를 포함하는 상기 전자 장치의 하우징; 및 안테 나;를 포함하고, 상기 안테나의 끝 단은 상기 분절부에 대응하는 위치에 배치된 것을 특징으로 할 수 있다. 이 외에도, 명세서를 통해 파악될 수 있는 다른 실시 예들이 가능하다."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예는, 커플링 현상을 이용하는 안테나 및 상기 안테나를 포함하는 전자 장치에 관한 것 이다."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 정보 통신 기술의 발전으로 기지국 등의 네트워크 장치가 전국 각지에 설치되었고, 전자 장치는 다른 전자 장치와 네트워크를 통해 데이터를 송수신함으로써, 사용자로 하여금 전국 어디에서나 자유롭게 네트워크를 사용 할 수 있게 하였다. 상기 네트워크를 이용하기 위해서 전자 장치는 안테나(또는 인테나)를 구비하게 되었다. 정보 통신 기술의 발 전과 함께 안테나 기술도 발전했으며, 최근 들어, 전자 장치의 금속 케이스를 안테나의 일부로 이용하는 기술이 등장하고 있다."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 다양한 실시 예는, 커플링 현상을 이용하는 안테나 및 상기 안테나를 포함하는 전자 장치를 제공하고 자 한다. 다만, 본 발명의 다양한 실시 예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 다양한 실시 예에 따른 전자 장치는 분절부 를 포함하는 상기 전자 장치의 하우징; 및 안테나;를 포함하고, 상기 안테나의 끝 단은 상기 분절부에 대응하는 위치에 배치된 것을 특징으로 할 수 있다. 본 발명의 다양한 실시 예에 따른 안테나는 안테나 패턴; 상기 안테나에 전력을 공급하는 급전부; 및 전자 장치 의 접지 영역에 접지되는 접지부;를 포함하고, 상기 안테나 패턴의 끝 단은 상기 전자 장치의 하우징에 포함된 분절부에 대응하는 위치에 배치된 것을 특징으로 할 수 있다."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 적어도 어느 하나에 의하면, 본 발명의 다양한 실시 예에 따른 안테나 및 상기 안테나를 포함하는 전자 장치는 안테나 패턴들로부터 발생된 적어도 하나 이상의 커플링 현상에 의한 에너 지를 방사할 수 있다. 상기 안테나의 끝 단은 전자 장치의 하우징의 분절부에 대응하도록 위치하고, 상기 전자 장치의 접지부로부터 연장된 그라운드 성분의 연장부와 커플링 됨으로써, 상기 전자 장치의 금속 프레임과의 커플링에 의해 받는 영 향을 줄일 수 있다."}
{"patent_id": "10-2014-0145540", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 다양한 실시 예에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/ 또는 중요도에 상관없이 수식할 수 있고, 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 발 명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다.어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도 록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통 상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전 에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있 으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우 에 따라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시 예들을 배제하도록 해석될 수 없다. 본 발명의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 도 1 내지 도 7을 통해 후술될 안테나를 포함하는 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상 전화기, 전자 책 리더기(e-book reader), 데스크탑 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라, 또는 웨어러블 장치(wearable device)(예: 스마트 안경, 머리 착용형 장치 (head-mounted-device(HMD)), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 스 마트 미러, 또는 스마트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 후술될 안테나를 포함하는 스마트 가전 제품(smart home appliance)일 수 있 다. 스마트 가전 제품은, 예를 들면, 텔레비전, DVD 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레 인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 후술될 안테나를 포함하는 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 (navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장 치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정 용 로봇, 금융 기관의 ATM(automatic teller’s machine), 상점의 POS(point of sales), 또는 사물 인터넷 장 치(internet of things)(예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절 기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 후술될 안테나를 포함하는 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전 자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터 (projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 후술될 안테나를 포함하는 플렉서블 전자 장치일 수 있다. 또한, 본 발명의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치 (예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1은 다양한 실시 예에 따른 네트워크 환경 100 내의 전자 장치 101를 나타낸다. 도 1을 참조하여, 다양한 실시 예에서의 네트워크 환경 100 내의 전자 장치 101이 기재된다. 전자 장치 101은 버스 110, 프로세서 120, 메모리 130, 입출력 인터페이스 150, 디스플레이 160, 및 통신 인터페이스 170을 포함 할 수 있다. 어떤 실시 예에서는, 전자 장치 101은, 구성요소들 중 적어도 하나를 생략하거나 다른 구성 요소를 추가적으로 구비할 수 있다. 버스 110은, 예를 들면, 구성요소들 110 내지 170을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/ 또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서 120은, 중앙처리장치(CPU), AP(application processor), 또는 CP(communication processor) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서 120은, 예를 들면, 전자 장치 101의 적어도 하나의 다른 구성요소들 의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리 130은, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리 130은, 예를 들면, 전자 장치 101의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시 예에 따르면, 메모리 130 은 소프트웨어 및/또는 프로그램 140을 저장할 수 있다. 프로그램 140은, 예를 들면, 커널 141, 미들웨어 143, API(application programming interface) 145, 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 147 등을 포함할 수 있다. 커널 141, 미들웨어 143, 또는 API 145의 적어도 일부는, 운영 시스템(operating system, O S)이라고 불릴 수 있다. 커널 141은, 예를 들면, 다른 프로그램들(예: 미들웨어 143, API 145, 또는 어플리케이션 프로그램 147)에 구현 된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스 110, 프로세서 120, 또는 메모리 130 등)을 제어 또는 관리할 수 있다. 또한, 커널 141은 미들웨어 143, API 145, 또는 어플리케이션 프로그램 147에 서 전자 장치 101의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어 143은, 예를 들면, API 145 또는 어플리케이션 프로그램 147이 커널 141과 통신하여 데이터를 주고받 을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어 143은 어플리케이션 프로그램 147로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어 143은 어플리케이션 프로그램 147 중 적어도 하나에 전자 장치 101의 시 스템 리소스(예: 버스 110, 프로세서 120, 또는 메모리 130 등)를 사용할 수 있는 우선 순위를 부여할 수 있다. 예컨대, 미들웨어 143은 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요청들을 처리함 으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API 145는, 예를 들면, 어플리케이션 147이 상기 141 또는 미들웨어 143에서 제공되는 기능을 제어하기 위한 인 터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스 150은, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장치 101의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 150은 전자 장치 101의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이 160은, 예를 들면, 액정 디스플레이(LCD), 발광 다이오드(LED) 디스플레이, 유기 발광 다이오드 (OLED) 디스플레이, 또는 마이크로 전자기계 시스템(microelectromechanical systems, MEMS) 디스플레이, 또는 전자 종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이 160은, 예를 들면, 사용자에게 각종 컨텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이 160은, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스처, 근접, 또는 호버링 (hovering) 입력을 수신할 수 있다. 통신 인터페이스 170은, 예를 들면, 전자 장치 101과 외부 장치(예: 제1 외부 전자 장치 102, 제2 외부 전자 장 치 104, 또는 서버 106) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스 170은 무선 통신 또는 유선 통신을 통해서 네트워크 162에 연결되어 상기 외부 장치 (예: 제2 외부 전자 장치 104 또는 서버 106)와 통신할 수 있다. 무선 통신은, 예를 들면 셀룰러 통신 프로토콜로서, 예를 들면 LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro, 또는 GSM 등 중 적어도 하나를 사용할 수 있다. 또한 무선 통신은, 예를 들면, 근거리 통신 164를 포함할 수 있다. 근거리 통신 164는, 예를 들면, Wi-Fi, Bluetooth, NFC(near field communication), 또는 GPS(global positioning system) 등 중 적어도 하나를 포함할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크 162는 통신 네트워크 (telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제1 및 제2 외부 전자 장치 102, 104 각각은 전자 장치 101과 동일한 또는 다른 종류의 장치일 수 있다. 한 실 시 예에 따르면, 서버 106은 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시 예에 따르면, 전자 장치 101에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치 102, 104, 또는 서버 106)에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치 101이 어떤 기능이나 서비스를 자동 으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치 101은 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치 102, 104, 또는 서버 106)에 게 요청할 수 있다. 다른 전자 장치(예: 전자 장치 102, 104, 또는 서버 106)는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치 101로 전달할 수 있다. 전자 장치 101은 수신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시 예에 따른 전자 장치 201의 블록도 200을 나타낸다. 도 2를 참조하면, 전자 장치 201은, 예를 들면, 도 1에 도시된 전자 장치 101의 전체 또는 일부를 포함할 수 있 다. 전자 장치 201은 하나 이상의 프로세서(예: 어플리케이션 프로세서(AP)) 210, 통신 모듈 220, 가입자 식별 모듈 224, 메모리 230, 센서 모듈 240, 입력 장치 250, 디스플레이 260, 인터페이스 270, 오디오 모듈 280, 카 메라 모듈 291, 전력 관리 모듈 295, 배터리 296, 인디케이터 297, 및 모터 298을 포함할 수 있다. 프로세서 210은, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서 210에 연결된 다수의 하드웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 210은, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 프로세서 210은 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서 210 은 도 2에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈 221)를 포함할 수도 있다. 프로세서 210은 다른 구성요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈 220은, 도 1의 상기 통신 인터페이스 170과 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈 220은, 예를 들면, 셀룰러 모듈 221, Wi-Fi 모듈 223, 블루투스 모듈 225, GPS 모듈 227, NFC 모듈 228 및 RF(radio frequency) 모듈 229를 포함할 수 있다. 셀룰러 모듈 221은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈 221은 가입자 식별 모듈(예: SIM 카드) 224을 이용하여 통 신 네트워크 내에서 전자 장치 201의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈 221은 프로세서 210이 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모 듈 221은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. Wi-Fi 모듈 223, 블루투스 모듈 225, GPS 모듈 227 또는 NFC 모듈 228 각각은, 예를 들면, 해당하는 모듈을 통 해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈 221, Wi-Fi 모듈 223, 블루투스 모듈 225, GPS 모듈 227 또는 NFC 모듈 228 중 적어도 일부(예: 두 개 이상)는 하나의 IC(integrated chip) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈 229는, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈 229는, 예를 들면, 트랜시버 (transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또는 안 테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈 221, Wi-Fi 모듈 223, 블루투스 모듈 225, GPS 모듈 227 또는 NFC 모듈 228 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈 224는, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포 함할 수 있으며, 고유한 식별 정보(예: ICCID (integrated circuit card identifier)) 또는 가입자 정보(예: IMSI (international mobile subscriber identity))를 포함할 수 있다. 메모리 230(예: 메모리 130)는, 예를 들면, 내장 메모리 232 또는 외장 메모리 234를 포함할 수 있다. 내장 메 모리 232는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비-휘발성(non-volatile) 메모리 (예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), 마스크(mask) ROM, 플래시(flash) ROM, 플래시 메모리(예: 낸드플래시(NAND flash) 또는 노아플래시(NOR flash) 등), 하드 드라이브, 또는 SSD(solid state drive) 중 적어도 하나를 포함할 수 있다. 외장 메모리 234는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(MultiMediaCard), 또는 메모리 스틱(memory stick) 등을 더 포 함할 수 있다. 외장 메모리 234는 다양한 인터페이스를 통하여 전자 장치 201과 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈 240은, 예를 들면, 물리량을 계측하거나 전자 장치 201의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈 240은, 예를 들면, 제스처 센서 240A, 자이로 센서 240B, 기압 센서 240C, 마그네틱 센서 240D, 가속도 센서 240E, 그립 센서 240F, 근접 센서 240G, 컬러 센서 240H(예: RGB 센서), 생체 센서 240I, 온/습도 센서 240J, 조도 센서 240K, 또는 UV(ultra violet) 센서 240M 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 240은, 예를 들면, 후각 센서(E-nose sensor), EMG(electromyography) 센서, EEG(electroencephalogram) 센서, ECG(electrocardiogram) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈 240은 그 안에 속한 적어도 하나 이상의 센서 들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치 201은 프로세서 210의 일 부로서 또는 별도로, 센서 모듈 240을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서 210이 슬립(sleep) 상태에 있는 동안, 센서 모듈 240을 제어할 수 있다. 입력 장치 250은, 예를 들면, 터치 패널(touch panel) 252, (디지털) 펜 센서(pen sensor) 254, 키(key) 256, 또는 초음파(ultrasonic) 입력 장치 258을 포함할 수 있다. 터치 패널 252는, 예를 들면, 정전식, 감압식, 적외 선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 252는 제어 회로를 더 포함할 수도 있다. 터치 패널 252는 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제 공할 수 있다. (디지털) 펜 센서 254는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 시트(sheet)를 포함할 수 있다. 키 256은, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치 258은 마이 크(예: 마이크 288)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터 를 확인할 수 있다. 디스플레이 260(예: 디스플레이 160)은 패널 262, 홀로그램 장치 264, 또는 프로젝터 266을 포함할 수 있다. 패 널 262는, 도 1의 디스플레이 160과 동일 또는 유사한 구성을 포함할 수 있다. 패널 262는, 예를 들면, 유연하 게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 262는 터치 패널 252와 하나의 모듈로 구성될 수도 있다. 홀로그램 장치 264는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로젝터 266은 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치 201 의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이 260은 상기 패널 262, 상기 홀로그램 장치 264, 또는 프로젝터 266를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스 270은, 예를 들면, HDMI 272, USB 274, 광 인터페이스(optical interface) 276, 또는 D-sub(D- subminiature) 278을 포함할 수 있다. 인터페이스 270은, 예를 들면, 도 1에 도시된 통신 인터페이스 170에 포 함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스 270은, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD 카드/MMC 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있 다. 오디오 모듈 280은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈 280의 적어도 일부 구성요소는, 예를 들면, 도 1에 도시된 입출력 인터페이스 150에 포함될 수 있다. 오디오 모듈 280 은, 예를 들면, 스피커 282, 리시버 284, 이어폰 286, 또는 마이크 288 등을 통해 입력 또는 출력되는 소리 정 보를 처리할 수 있다. 카메라 모듈 291은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 제논 램프(xenon lamp))를 포함할 수 있다. 전력 관리 모듈 295는, 예를 들면, 전자 장치 201의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관리 모듈 295는 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리 296의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리 296은, 예 를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터 297은 전자 장치 201 혹은 그 일부(예: 프로세서 210)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터 298은 전기적 신호를 기계적 진동으로 변환할 수 있고, 진동 (vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 201은 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(MediaFloTM) 등 의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나 의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 3은 다양한 실시 예에 따른 프로그램 모듈 310의 블록도 300을 나타낸다 도 3을 참조하면, 한 실시 예에 따르면, 프로그램 모듈 310(예: 프로그램 140)은 전자 장치(예: 전자 장치 10 1)에 관련된 자원을 제어하는 운영 체제(operating system, OS) 및/또는 운영 체제 상에서 구동되는 다양한 어 플리케이션(예: 어플리케이션 프로그램 147)을 포함할 수 있다. 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈 310은 커널 320, 미들웨어 330, API 360, 및/또는 어플리케이션 370을 포함할 수 있다. 프로그램 모듈 310의 적어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치 102, 104, 서버 106 등)로부터 다운로드 가능하다. 커널 320(예: 커널 141)은, 예를 들면, 시스템 리소스 매니저 321 또는 디바이스 드라이버 323를 포함할 수 있 다. 시스템 리소스 매니저 321은 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저 321은 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포함할 수 있다. 디바이스 드라이버 323은, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공 유 메모리 드라이버, USB 드라이버, 키패드 드라이버, Wi-Fi 드라이버, 오디오 드라이버, 또는 IPC(inter- process communication) 드라이버를 포함할 수 있다. 미들웨어 330은, 예를 들면, 어플리케이션 370이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 370 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API 360을 통해 다양한 기능들을 어플리케이션 370으로 제공할 수 있다. 한 실시 예에 따르면, 미들웨어 330(예: 미들웨어 143)은 런타임 라이브러리 335, 어플리케이션 매니저(application manager) 341, 윈도우 매니저(window manager) 342, 멀티미디어 매니저 (multimedia manager) 343, 리소스 매니저(resource manager) 344, 파워 매니저(power manager) 345, 데이터베 이스 매니저(database manager) 346, 패키지 매니저(package manager) 347, 연결 매니저(connectivity manager) 348, 통지 매니저(notification manager) 349, 위치 매니저(location manager) 350, 그래픽 매니저 (graphic manager) 351, 또는 보안 매니저(security manager) 352 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리 335는, 예를 들면, 어플리케이션 370이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기 능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리 335는 입출력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저 341은, 예를 들면, 어플리케이션 370 중 적어도 하나의 어플리케이션의 생명 주기(life cycle)를 관리할 수 있다. 윈도우 매니저 342는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저 343은 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저 344는 어플리케이션 370 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있다. 파워 매니저 345는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매니저 346은 어플 리케이션 370 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패 키지 매니저 347은 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저 348은, 예를 들면, Wi-Fi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저 349는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저 350은 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저 351은 사용자에게 제공될 그래 픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저 352는 시스템 보안 또는 사용자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시 예에 따르면, 전자 장치(예: 전자 장치 101)가 전 화 기능을 포함한 경우, 미들웨어 330은 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저 (telephony manager)를 더 포함할 수 있다. 미들웨어 330은 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨 어 330은 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어 330은 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API 360(예: API 145)은, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제공 될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이젠 (tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션 370(예: 어플리케이션 프로그램 147)은, 예를 들면, 홈 371, 다이얼러 372, SMS/MMS 373, IM(instant message) 374, 브라우저 375, 카메라 376, 알람 377, 컨택트 378, 음성 다이얼 379, 이메일 380, 달력 381, 미디어 플레이어 382, 앨범 383, 또는 시계 384, 건강 관리(health care)(예: 운동량 또는 혈당 등 을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 제공할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션 370은 전자 장치(예: 전자 장치 101)와 외부 전자 장치(예: 전자 장치 102, 104) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의상, \"정보 교환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달 (notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어 플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치 102, 104)로 전달하는 기능을 포함할 수 있다. 또한, 상기 알림 전달 어플리케이션은, 예를 들 면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치 102, 104)의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시 예에 따르면, 어플리케이션 370은 외부 전자 장치(예: 전자 장치 102, 104)의 속성에 따라 지정된 어플 리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션)을 포함할 수 있다. 한 실시 예에 따르면, 어플리케 이션 370은 외부 전자 장치(예: 서버 106 또는 전자 장치 102, 104)로부터 수신된 어플리케이션을 포함할 수 있 다. 한 실시 예에 따르면, 어플리케이션 370은 프리로드 어플리케이션(preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시 예에 따른 프로 그램 모듈 310의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시 예에 따르면, 프로그램 모듈 310의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적 어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈 310의 적어도 일부는, 예를 들면, 프로세서(예: 프로 세서 210)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈 310의 적어도 일부는 하나 이상의 기능 을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세스 등을 포함할 수 있다. 도 4는 본 발명의 다양한 실시 예에 따른, 전자 장치 400 및 전자 장치 400에 포함된 안테나 410을 나타낸 도면 이다. 도 4에 도시된 도면은, 전자 장치 400의 적어도 일부를 나타낸 것으로, 전자 장치 400의 상단에 대한 단 면도일 수 있다. 다만, 본 발명의 다양한 실시 예에 따르면, 도 4에 도시된 도면은 전자 장치 400의 하단에 대 한 단면도일 수도 있다. 도 4를 참조하면, 전자 장치 400은 적어도 일부의 하우징 401 내지 405, 연장부 406 내지 409, 안테나 410 및 접지부 420을 포함할 수 있다. 하우징 401 내지 405는 전자 장치 400의 측면에 대한 제1 하우징 401, 전자 장치 400의 상단(본 발명의 다른 실 시 예에 따르면, 전자 장치 400의 하단)에 대한 제2 하우징 403, 전자 장치 400의 측면(제1 하우징 401과 마주 보는 면)에 대한 제3 하우징 405를 포함할 수 있고, 제1 하우징 401과 제2 하우징 403 사이에 위치한 제1 분절 부 402와 제2 하우징 403과 제3 하우징 405 사이에 위치한 제2 분절부 404를 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 제1 하우징 401, 제2 하우징 403, 및 제3 하우징 405는 금속 하우징일 수 있다. 또한, 제1 분절부 402 및 제2 분절부 404는 비도전성 소재로서, 제1 하우징 401, 제2 하우징 403, 및 제 3 하우징 405 각각을 전기적으로 분리시키는 역할을 할 수 있다. 본 발명의 다른 실시 예에 따르면, 제1 하우 징 401, 제2 하우징 403, 및 제3 하우징 405는 사출로 이루어질 수 있지만, 이하에서는 금속인 것으로 가정하고 설명하겠다. 전자 장치 400은 접지부 420으로부터 연장된 연장부 406 내지 409를 포함할 수 있다. 연장부 406 내지 409 중 적어도 하나 이상은 제1 하우징 401, 제2 하우징 403, 및 제3 하우징 405와 연결되어, 제1 하우징 401, 제2 하 우징 403, 및 제3 하우징 405을 지지하는 역할을 할 수도 있다. 도 4를 참조하면, 연장부 406 내지 409는 접지 부 420과 물리적으로 연결되어 있는 것으로 도시되어 있지만, 본 발명의 다양한 실시 예에 따르면, 연장부 406 내지 409 중 적어도 하나 이상은 접지부 420과 전기적으로 연결될 수도 있다. (도 5에서 설명하겠다.) 연장부 406 내지 409는 제1 하우징 401, 제2 하우징 403, 및 제3 하우징 405와 일체를 이루는 것일 수도 있고, 연장부 406 내지 409 중 적어도 하나 이상은 제1 하우징 401, 제2 하우징 403, 및 제3 하우징 405로부터 이격된 것일 수도 있다. 연장부 406 내지 409는 전자 장치 400의 브라켓(미도시)의 일부일 수도 있고, 이 경우, 연장부 406 내지 409는, 예를 들어 c-clip 등의 체결부(미도시)를 통해 접지부 420과 연결될 수 있다. 안테나 410은 급전부 412, 접지부 414 및 안테나 패턴 416을 포함할 수 있다. 도 4를 참조하면, 안테나 410은 역 F 안테나(inverted F antenna), 예를 들어 PIFA(planar inverted F antenna)인 것으로 도시되어 있지만, 안 테나 410의 종류는 상기 역 F 안테나로 한정되는 것은 아니고, 모노폴 안테나, 슬롯 안테나, 루프 안테나 등 다 양한 종류의 안테나 중 어느 하나가 될 수 있다. 안테나 패턴 416의 끝 단은 분절부 402에 대응하는 위치에 배치될 수 있다. 안테나 패턴 416은 인접한 도전성 부재와 커플링을 형성할 수 있다. 안테나 동작 원리를 보면, 일반적인 PIFA 안테나의 경우, 급전부 412에 강한 전류가 여기되고, 개방 영역인 안테나 패턴 416의 끝 단에 강한 전압이 여기되는 바, 상기 두 영역은 방사를 결정하는 주요 방사부 역할을 할 수 있다. 따라서, 안테나 패턴 416의 끝 단이 분절부 402에 대응하는 위치가 아 니라, 금속 하우징(예를 들어, 제2 하우징 403)에 대응하는 위치에 배치되는 경우, 안테나 패턴 416의 끝 단은 상기 금속 하우징과 커플링 되어 안테나 성능을 열화시킬 수 있다. 예를 들어, 두께가 매우 얇은 안테나 신호 선(예를 들어, 안테나 패턴 416)에 비해 부피가 큰 금속 하우징(예를 들어, 제2 하우징 403)에 전압이 여기될 경우, 주요 방사는 전압이 여기된 제2 하우징 403에서 강하게 발생하게 되며 안테나 410은 커플링 급전부의 특 성을 가지게 되므로, 설계를 위해 안테나 410을 변경하더라도 방사 특성이 변경되지 않는 문제점을 가질 수 있 다. 안테나 패턴 416의 끝 단은 연장부 407과 영역 430에서 커플링을 형성할 수 있다. 앞서 언급한 바와 같이, 연 장부 407은 접지부 420과 물리적 또는 전기적으로 연결되어 있기 때문에, 그라운드 성분으로서, 안테나 패턴 416의 끝 단과 강한 커플링을 이룰 수 있다. 이 때의 커플링은, 예를 들어, 점 대 점(point to point)의 커플 링일 수 있다. 영역 430에서 형성된 커플링에 기초한 커플링 에너지는 분절부 402를 통해 방사될 수 있다. 만일, 연장부 407이 없다면, 또는 연장부 407이 접지부 420로부터 연결되지 않아 그라운드 성분을 가지지 못한 다면, 제2 하우징 403과 나란한 안테나 패턴 416은 제2 하우징 403과 영역 440에서 커플링을 형성하게 될 수 있 다. 이 경우, 도전성의 제2 하우징 403과의 커플링은 안테나 410의 성능을 열화시킬 수 있어 문제될 수 있다. 따라서, 본 발명의 다양한 실시 예는 안테나 410의 끝 단을 분절부 402에 대응하는 위치에 배치하고, 연장부 407을 안테나 410의 끝 단과 커플링을 이루게끔 함으로써, 안테나 410의 주요 방사 영역이 분절부 402에 고정되 게 되고, 도전성의 제2 하우징 403와의 커플링은 더욱 저감되게 되어, 금속 하우징으로 인한 간섭이 없고 방사 성능이 우수한 안테나를 구현할 수 있다. 접지부 420은 PCB(printed circuit board) 상에 형성된 것일 수 있다. 이하 도 5 내지 도 7을 통해, 저주파 대역 안테나(도 5), 고주파 대역 안테나(도 6) 및 이중 대역 안테나(도 7)를 설명하겠다. 단, 도 4에서 설명된 내용 중, 도 5 내지 도 7에 해당되는 중복 내용에 대한 언급은 생략하 겠다. 도 5a는 본 발명의 다양한 실시 예에 따른, 전자 장치 500 및 전자 장치 500에 포함된 저주파 대역 안테나 510 을 나타낸 도면이다. 도 5a를 참조하면, 전자 장치 500은 적어도 일부의 하우징 501 내지 505, 연장부 506 및 508, 안테나 510 및 접지부 520을 포함할 수 있다. 도 5a에 도시된 연장부 506 및 508은 도 4에 도시된 연장부 406 내지 409와는 달리 전기적으로 접지부 520와 연 결될 수 있다. 예를 들어, 연장부 506과 접지부 520은 물리적으로 분리되어 있을 수 있지만, 연장부 506과 접 지부 520은 용량성 소자 507, 예를 들어 lumped 커패시터로 연결될 수 있다. 이와 유사하게, 연장부 508과 접 지부 520은 용량성 소자 509를 통해 연결될 수 있다. 안테나 510은 급전부 512, 접지부 514, 제1 안테나 패턴 516, 제2 안테나 패턴 517 및 제3 안테나 패턴 518을 포함할 수 있다. 제2 안테나 패턴 517은 제1 안테나 패턴 516의 끝 단으로부터 꺽여 연장되고, 제3 안테나 패 턴은 제2 안테나 패턴 517의 끝 단으로부터 꺽여 연장되는 형상으로 배치될 수 있다. 이 경우, 제2 안테나 패 턴 517은 연장부 506과 나란히 배치되어 있을 수 있고, 제3 안테나 패턴 518은 제2 하우징 503과 나란히 배치되 어 있을 수 있다. 도 5a를 참조하면, 제3 안테나 패턴 518의 끝 단은 그라운드 성분의 연장부 508과 영역 530에서 커플링(예를 들 어, 점 대 점 커플링)을 형성할 수 있다. 또한, 제2 안테나 패턴 517은 그라운드 성분의 연장부 506과 영역 540에서 커플링(예를 들어, 선 대 선 커플 링)을 형성할 수 있다. 다만, 제2 안테나 패턴 517과 연장부 506이 나란히 배치되어야만, 제2 안테나 패턴 517 과 연장부 506이 커플링 되는 것은 아니므로, 제2 안테나 패턴 517과 연장부 506은 상호 경사각을 가질 수 있다. 또는, 제1 안테나 패턴 516의 끝 단이 그라운드 성분의 연장부 506에서 커플링(예를 들어, 점 대 점 커 플링)을 형성할 수 있다. 따라서, 본 발명의 다양한 실시 예에 따르면, 안테나 510은 영역 530에서의 커플링 및 영역 540에서의 커플링을 통해 이중 대역을 커버할 수도 있다. 도 5b는 본 발명의 다양한 실시 예에 따른, 도 5a 안테나 510에 대한 방사 효율을 도시한 그래프이다. 도 5b를 참조하면, 두꺼운 실선으로 표시된 그래프 550은 안테나 510의 방사 효율(radiation efficiency)을 나타내고, 얇은 실선으로 표시된 그래프 560은 안테나 510의 총 방사 효율(total radiation efficiency)을 나타낸 것일 수 있다. 이 경우, 총 방사 효율은 VSWR(voltage standing wave ratio)에 의한 power lost 또는 mismatch loss를 고려한 값일 수 있다. 도 6a는 본 발명의 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 고주파 대역 안테나를 나타 낸 도면이다. 도 6a를 참조하면, 전자 장치 600은 적어도 일부의 하우징 601 내지 605, 연장부 606 및 608, 안 테나 610 및 접지부 620을 포함할 수 있다. 도 4의 제2 하우징 403 및 도 5a의 제2 하우징 503은 분절부를 통해 다른 하우징과 연결되어 있는 것으로만 도 시되어 있지만, 본 발명의 다양한 실시 예에 따르면, 제2 하우징 603은 연장부 606을 통해 접지부 620와 연결될 수 있다. 안테나 610은 급전부 612, 접지부 614, 및 안테나 패턴 616을 포함할 수 있다. 안테나 패턴 616은 영역 630에 서 그라운드 성분의 연장부 608과 커플링될 수 있다. 안테나 610의 안테나 패턴 616은 도 5의 안테나 510과 유사하게 두 번 꺽인 패턴을 형성하고 있지만, 연장부 606과는 소정의 거리를 두고 이격되어 있는바, 커플링은 630에서 형성되는 것으로 가정하겠다. 도 5a의 안테나 510과 도 6a의 안테나 610을 비교하면, 안테나 패턴의 길이가 서로 다른 것을 알 수 있다. 안 테나 패턴의 길이는 주파수 대역과 반비례하므로, 도 5a의 안테나 510은 상대적으로 낮은 대역의 주파수를 이용 하여 통신을 수행할 수 있고, 도 6a의 안테나 610은 상대적으로 높은 대역의 주파수를 이용하여 통신을 수행할 수 있다. 도 6b는 본 발명의 다양한 실시 예에 따른, 도 6a 안테나 610에 대한 방사 효율을 도시한 그래프이다. 도 6b를 참조하면, 두꺼운 실선으로 표시된 그래프 650은 안테나 610의 방사 효율(radiation efficiency)을 나타내고, 얇은 실선으로 표시된 그래프 660은 안테나 610의 총 방사 효율(total radiation efficiency)을 나타낸 것일 수 있다. 도 7a는 본 발명의 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 이중 대역 안테나를 나타낸 도면이다. 도 7a를 참조하면, 전자 장치 700은 적어도 일부의 하우징 701 내지 705, 연장부 706, 안테나 710 및 접지부 720을 포함할 수 있다. 안테나 710을 참조하면, 안테나 패턴 716은 영역 730에서 그라운드 성분의 연장부 706과 커플링을 형성할 수 있 다. 또한, 본 발명의 다양한 실시 예에 따르면, 안테나 패턴 716은 그라운드 성분의 제2 하우징 703과 커플링 을 더 형성할 수도 있다. 안테나 710을 도 5a 및 도 6a의 안테나와 비교하면, 각각의 안테나를 형성하는 안테나 패턴의 두께가 서로 다를 수 있다. 도 7b는 본 발명의 다양한 실시 예에 따른, 도 7a 안테나 710에 대한 방사 효율을 도시한 그래프이다. 도 7b를 참조하면, 실선으로 표시된 그래프 750은 안테나 710의 방사 효율(radiation efficiency)을 나타낸 것일 수 있 다. 본 발명의 다양한 실시 예에 따르면, 도 4 내지 도 7을 통해 설명된 안테나 410, 510, 610 및 710 중 적어도 둘 이상의 안테나가 함께 전자 장치에 구비될 수 있다. 도 8a는 본 발명의 다른 다양한 실시 예에 따른, 전자 장치 800 및 전자 장치 800에 포함된 안테나 810을 나타 낸 도면이다. 도 8a를 참조하면, 전자 장치 800은 적어도 일부의 제1 하우징 802, 제2 하우징 804, 분절부 806, 안테나 810 및 접지부 820을 포함할 수 있다. 다만, 본 발명의 다양한 실시 예에 따르면, 제1 하우징 802 또는 제2 하우징 804는 하우징이 아니고, 전자 장치의 일부를 구성하는 특정 역할을 위한 부재일 수도 있다. 제1 하우징 802 및 제2 하우징 804는 금속 하우징인 것으로 설명하겠다. 분절부 806은 제2 하우징 804를 접지 부 820와 연결시키며, 비도전성 소재로 이루어진 것일 수 있다. 안테나 810은 급전부 812, 접지부 814 및 안테나 패턴 816을 포함할 수 있다. 안테나 패턴 816을 참조하면, 안 테나 패턴 816의 끝 단은 접지부 820을 향해있고, 비도전성의 분절부 806에 대응하는 위치에 배치되어있을 수 있다. 따라서, 도 4의 안테나 410과 유사하게, 안테나 패턴 816의 끝 단은 도전성의 제2 하우징 804에 의한 커 플링을 줄이는 동시에, 영역 830에서 접지부 820과의 커플링을 형성할 수 있다. 따라서, 도전성 부재에 의해 방사 효율이 열화되는 문제를 방지할 수 있다. 도 8b는 본 발명의 다양한 실시 예에 따른, 도 8a의 안테나 810의 방사 영역을 나타낸 도면이다. 도 8b에 도시 된 도면은 도 8a의 안테나 810에 대응하는 도면으로서, 도 8b에 나타난 색상은 전기장의 세기를 나타낸 것이다. 예를 들어, 빨간색에 가까울수록 강한 전기장의 띄고, 파란색에 가까울수록 약한 전기장의 띄는 것을 의미할 수 있다. 도 8b를 참조하면, 다른 영역에 비해 안테나 패턴 816의 끝 단, 즉, 영역 830 위주에 특히 강한 전기장을 띄는 것을 알 수 있다. 이는 분절부 806에 의해 도전성의 제2 하우징 804에 의한 커플링 영향이 저감되고, 안테나 패턴 816의 끝 단과 접지부 820 사이에서 형성된 커플링에 의한 효과라고 볼 수 있다. 도 8c는 본 발명의 다양한 실시 예에 따른, 제2 하우징 804의 유무에 따른 도 8a의 안테나 810의 방사 패턴을 3d로 나타낸 도면이다. 도 8c의 왼쪽에 도시된 방사 패턴은 제2 하우징 804이 없이 안테나 810만 있는 경우이 고, 도 8c의 오른쪽에 도시된 방사 패턴은 도전성의 제2 하우징 804과 안테나 810이 함께 있는 경우의 방사 패 턴을 나타낸 것일 수 있다. 도 8c에 나타난 색상은 이득의 크기(dB)를 나타낸 것으로서, 예를 들어, 빨간색에 가까울수록 강한 이득을 갖고, 파란색에 가까울수록 약한 이득을 갖는 것을 의미할 수 있다. 도 8c의 양쪽에 각각 도시된 방사 패턴의 색을 참조하면, 안테나 810만 있는 경우의 이득은 3.08dB이고, 도전성 의 제2 하우징 804와 안테나 810이 함께 있는 경우의 이득은 3.02dB로서, 큰 차이가 없음을 알 수 있다. 즉, 안테나 810은 도전성의 제2 하우징 804의 존재에 불구하고, 제2 하우징 804로부터 받는 영향이 미미함을 알 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치는 상기 전자 장치의 분절부를 포함하는 상기 전자 장치의 하우징; 및 안테나;를 포함할 수 있다. 이 경우, 상기 안테나의 끝 단은 상기 분절부에 대응하는 위치에 배치된 것일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치는 접지부; 및 상기 접지부의 적어도 일부로부터 연장된 연 장부를 더 포함할 수 있다. 이 경우, 상기 안테나의 끝 단은 상기 연장부와 커플링되는 것일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 안테나는 단일 밴드 또는 다중 밴드를 지원하는 역 F 안테나 (inverted F antenna)인 것일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 하우징은 금속 하우징일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 연장부는 상기 접지부의 적어도 일부로부터 직접 연장된 것이거나, 용량성 소자를 통해 연장된 것일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 연장부는 복수개일 수 있고, 상기 복수의 연장부 각각은 상기 접지부 의 서로 다른 위치로부터 연장된 것일 수 있다. 이 경우, 상기 안테나의 끝 단 및 상기 안테나의 적어도 일부 는 상기 복수의 연장부 각각과 커플링될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 안테나는 역 F 안테나일 수 있다. 이 경우, 상기 안테나는, 상기 'F' 형상의 제1 안테나 패턴; 상기 제1 안테나 패턴의 끝 단으로부터 꺽이며 연장된 제2 안테나 패턴; 및 상기 제2 안테나 패턴의 끝 단으로부터 꺽이며 연장된 제3 안테나 패턴을 포함할 수 있다. 상기 제3 안테나 패턴은 상기 전자 장치의 하우징과 나란히 배치될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 안테나의 끝 단과 상기 연장부와의 커플링은, 상기 제3 안테나 패턴 의 끝 단과 상기 연장부와의 점 대 점(point to point) 커플링을 나타내는 것일 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 제2 안테나 패턴은 다른 연장부와 나란히 배치될 수 있고, 상기 제2 안테나 패턴은 상기 다른 연장부와 커플링될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 안테나는 복수개일 수 있고, 상기 복수의 안테나 각각은 서로 다른 밴드를 지원하는 것일 수 있다. 이 경우, 상기 복수의 안테나 각각은 안테나 패턴의 길이를 달리하는 것일 수도 있고, 상기 복수의 안테나 각각 은 안테나 패턴의 두께를 달리하는 것일 수도 있다. 본 발명의 다양한 실시 예에 따른 안테나는, 안테나 패턴; 상기 안테나에 전력을 공급하는 급전부; 및 전자 장 치의 접지 영역에 접지되는 접지부;를 포함할 수 있다. 이 경우, 상기 안테나 패턴의 끝 단은 상기 전자 장치 의 하우징에 포함된 분절부에 대응하는 위치에 배치될 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서(예: 프로세서 120)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리 130이 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM, DVD, 자기-광 매체(magneto-optical media)(예: 플롭티 컬 디스크(floptical disk)), 하드웨어 장치(예: ROM, RAM, 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용 해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지 다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위 를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0145540", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른, 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도 2는 본 발명의 다양한 실시 예에 따른, 전자 장치의 블록도이다. 도 3은 본 발명의 다양한 실시 예에 따른, 프로그램 모듈의 블록도이다. 도 4는 본 발명의 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 안테나를 나타낸 도면이다. 도 5a는 본 발명의 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 저주파 대역 안테나를 나타 낸 도면이다. 도 5b는 본 발명의 다양한 실시 예에 따른, 도 5a 안테나에 대한 방사 효율을 도시한 그래프이다. 도 6a는 본 발명의 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 고주파 대역 안테나를 나타낸 도면이다. 도 6b는 본 발명의 다양한 실시 예에 따른, 도 6a 안테나에 대한 방사 효율을 도시한 그래프이다. 도 7a는 본 발명의 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 이중 대역 안테나를 나타낸 도면이다. 도 7b는 본 발명의 다양한 실시 예에 따른, 도 7a 안테나에 대한 방사 효율을 도시한 그래프이다. 도 8a는 본 발명의 다른 다양한 실시 예에 따른, 전자 장치 및 상기 전자 장치에 포함된 안테나를 나타낸 도면 이다. 도 8b는 본 발명의 다양한 실시 예에 따른, 도 8a의 안테나의 방사 영역을 나타낸 도면이다. 도 8c는 본 발명의 다양한 실시 예에 따른, 하우징의 유무에 따른 도 8a의 안테나의 방사 패턴을 3d로 나타낸 도면이다."}
