{"patent_id": "10-2017-0029457", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0102823", "출원번호": "10-2017-0029457", "발명의 명칭": "IoT 장치의 무선 라우터 연결을 지원하는 무선 라우터, 전자 장치 및 시스템", "출원인": "삼성전자주식회사", "발명자": "윤예지"}}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 제2 외부 장치로부터 상기 무선 통신 회로 또는 상기 통신 인터페이스 중 적어도 하나를 통해 상기 제1 외부 장치를 검색하기 위한 요청을 수신하고, 상기 검색 요청 수신에 응답하여, 상기 제1 SSID를 포함하는 비콘프레임을 브로드캐스트하도록 하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가상기 무선 통신 회로를 이용하여, 상기 제1 외부 장치로부터 상기 제1 정보를 포함하는 프로브 요청 프레임(probe request frame) 또는 결합 요청 프레임(association request frame) 중 적어도 하나를 수신하도록하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제2 정보는 상기 제2 SSID를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 제1 SSID를 포함하는 비콘 프레임(beacon frame)을 주기적으로 브로드캐스트하도록 하는, 전자 장치.공개특허 10-2018-0102823-3-청구항 5"}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 메모리는 상기 전자 장치와 외부 장치 간의 무선 연결 히스토리를 저장하고,상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 제1 정보 및 상기 무선 연결 히스토리에 기반하여 상기 제1 외부 장치가 상기 전자 장치에 연결된 이력이없는 경우, 상기 제1 정보의 적어도 일부 및 상기 제2 정보를 상기 제2 외부 장치로 전송하도록 하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 무선 통신 프로토콜은 블루투스(bluetooth) 방식, 지그비(zigbee) 통신 방식, 무선 하트(wirelesshighway addressable remote transducer) 통신 방식, 근접장 통신 방식, 와이파이(wifi) 방식, 와이파이 다이렉트(wifi direct) 방식, GSM, HSDPA, LTE, LTE-A, CDMA, CDMA2000 또는 와이브로(wibro) 통신 방식 중 적어도하나를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 제1 정보는 상기 제1 외부 장치의 제조사 정보, 모델명, 기기명, 버전명, 제품군, 시리얼 넘버(serialnumber), 네트워크 접속을 위한 인증 정보, 맥 어드레스(mac address) 또는 IP(internet protocol) 중 적어도하나를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 연결 정보는 상기 제2 SSID에 대응하는 비밀번호, 보안(security) 정보 또는 패스 포인트(passpoint) 연결을 위한 크리덴셜(credential) 정보 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 제2 외부 장치는 설정 장치를 포함하고,상기 전자 장치가 상기 무선 통신 회로를 이용하여 상기 설정 장치에 무선으로 연결된 경우,상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 무선 통신 회로를 이용하여 상기 제1 정보의 적어도 일부 및 상기 제2 정보를 상기 설정 장치로 전송하고,상기 무선 통신 회로를 통한 상기 설정 장치로부터의 상기 연결 정보를 상기 제1 외부 장치로 전달하거나,또는, 상기 무선 통신 회로를 통해 상기 설정 장치로부터 상기 연결 정보의 전송 요청을 수신하고, 상기 전송요청에 응답하여, 상기 메모리에 저장된 상기 연결 정보를 상기 제1 외부 장치로 전송하도록 하는, 전자 장치.공개특허 10-2018-0102823-4-청구항 11 전자 장치에 있어서,하우징;상기 하우징 내에 배치되고, 100미터 내의 커버리지를 갖는 무선 통신 프로토콜을 지원하도록 구성된 무선 통신회로;상기 하우징 내에 배치되고, 상기 무선 통신 회로에 기능적으로 연결되는 프로세서; 및상기 하우징 내에 배치되고 상기 프로세서에 전기적으로 연결되거나 결합된 메모리를 포함하고, 상기 메모리는,실행 시에, 상기 프로세서가,상기 무선 통신 회로를 통하고, 제1 SSID를 이용하여 무선 라우터에 무선으로 연결하고,상기 무선 통신 회로를 이용하여, 상기 무선 라우터로 상기 전자 장치에 관한 제1 정보를 전송하고,상기 무선 통신 회로를 이용하여, 상기 전자 장치와 상기 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 상기 무선 라우터로부터 수신하고,상기 무선 통신 회로를 통하고, 상기 연결 정보를 이용하여 상기 무선 라우터에 무선으로 연결하도록 하는 인스트럭션들을 저장하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 제1 정보는 상기 전자 장치의 제조사 정보, 모델명, 기기명, 버전명, 제품군, 시리얼 넘버, 네트워크 접속을 위한 인증 정보, 맥 어드레스 또는 IP 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가상기 무선 통신 회로를 이용하여, 상기 무선 라우터로 상기 제1 정보를 포함하는 프로브 요청 프레임 또는 결합요청 프레임 중 적어도 하나를 전송하도록 하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가상기 무선 통신 회로를 이용하여, 상기 무선 라우터로부터 상기 제1 SSID를 포함하는 비콘 프레임을 수신하고,상기 비콘 프레임 수신에 응답하여, 상기 제1 정보를 포함하는 결합 요청 프레임을 상기 무선 라우터로 전송하도록 하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 11에 있어서,상기 연결 정보는 상기 제2 SSID에 대응하는 비밀번호, 보안 정보 또는 패스 포인트 연결을 위한 크리덴셜 정보중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "시스템에 있어서,하우징;상기 하우징 내에 배치된 통신 인터페이스;공개특허 10-2018-0102823-5-상기 하우징 내에 배치되고, 상기 통신 인터페이스에 기능적으로 연결되는 프로세서; 및상기 하우징 내에 배치되고, 상기 프로세서에 전기적으로 연결되는 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가,상기 통신 인터페이스를 통해 무선 라우터로부터 제1 외부 장치에 관한 제1 정보 및 상기 무선 라우터에 관한제2 정보를 수신하고,상기 통신 인터페이스를 통해, 상기 제2 정보에 기반하여 결정되는 하나 이상의 제2 외부 장치로 상기 제1 정보중 적어도 일부, 상기 제2 정보 중 적어도 일부 및 상기 제1 외부 장치와 상기 무선 라우터 간의 무선 연결을위한 연결 수락 요청을 전송하고,상기 통신 인터페이스를 통해, 상기 제2 외부 장치로부터의 상기 제1 정보에 기반하고 SSID를 포함하는 연결 정보를 상기 제1 외부 장치로 전달하거나 상기 연결 정보의 전송 요청을 상기 무선 라우터로 전달하도록 하는 인스트럭션들을 저장하는 것을 특징으로 하는, 시스템."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 제2 정보는 상기 무선 라우터의 계정 정보를 포함하고, 상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 계정 정보에 대응하는 상기 하나 이상의 제2 외부 장치로 상기 제1 정보 중 적어도 일부, 상기 제2 정보중 적어도 일부 및 상기 연결 수락 요청을 전송하는, 시스템."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서,상기 제2 정보는 상기 SSID를 포함하는, 시스템."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 통신 인터페이스를 통해, 상기 제2 외부 장치로부터의 상기 제1 외부 장치를 검색하기 위한 요청을 상기무선 라우터로 전달하도록 하는, 시스템."}
{"patent_id": "10-2017-0029457", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서,상기 인스트럭션들은, 실행시, 상기 프로세서가,상기 통신 인터페이스를 통해, 상기 제2 정보에 대응하는 하나 이상의 제2 외부 장치로 상기 제2 외부 장치가사용중인지 여부를 체크하기 위한 쿼리를 전송하고,상기 통신 인터페이스를 통해, 상기 쿼리에 대한 응답을 수신하고,상기 쿼리에 대한 응답에 기반하여, 상기 통신 인터페이스를 통해 상기 하나 이상의 제2 외부 장치 중 사용중인것으로 결정된 제2 외부 장치로 상기 제1 정보 중 적어도 일부, 상기 제2 정보 중 적어도 일부 및 상기 제1 외부 장치와 상기 무선 라우터 간의 무선 연결을 위한 연결 수락 요청을 전송하도록 하는, 시스템."}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 상기 전자 장치는, 하우징; 상기 하우징 내에 배치되는 무선 통신 회로; 상기 하우징 내 에 배치된 통신 인터페이스; 상기 하우징 내에 배치되고, 상기 무선 통신 회로 및 상기 통신 인터페이스에 기능 적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되고 상기 프로세서에 전기적으로 연결되거나 결합된 메모 (뒷면에 계속)"}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은, IoT 장치의 무선 라우터로의 연결을 지원하는 기술과 관련된다."}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 기술이 발전함에 따라 랩탑 또는 스마트폰 등과 같은 단말기들뿐만 아니라, TV, 냉장고 또는 세탁기 등의 가전 제품들도 무선 통신 기술(예: 셀룰러 이동 통신 또는 근거리 무선 통신 등)을 이용하여 인터넷에 접속할 수 있다. 그러나 가전 제품은 스마트폰과 같은 단말기에 비해 사용자 입력이 제한적일 수 있다. 예를 들어, 사용자는 에 어컨을 무선 라우터에 연결시키기 위해, 리모컨과 에어컨의 디스플레이를 이용하여 무선 라우터를 선택해야 한 다. 또 다른 예를 들어, 세탁기를 무선 라우터에 연결시키기 위해, 세탁기 전면의 작은 터치 스크린을 통해 사 용자가 무선 라우터무선 라우터로의 연결을 설정해야 한다. 다른 예로, 사용자 단말이 IoT(internet of things) 장치를 무선 라우터로 인식하고 IoT 장치에 연결하여, IoT 장치가 인터넷으로 접속하기 위해 연결해야 하는 무선 라우터의 정보를 전송하는 방법이 있다."}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같이 입력 수단이 제한적이거나 디스플레이가 작거나 디스플레이를 가지고 있지 않은 IoT 장치를 무선 라우터에 연결시키는 설정 방법은 매우 복잡하다. 본 발명의 실시 예들은 무선 라우터가 새로운 IoT 장치를 발견하고, IoT 장치에 대한 정보를 사용자 단말로 전 송함으로써 보다 쉽게 신규 IoT 장치를 무선 라우터에 연결시키고자 한다."}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 하우징; 상기 하우징 내에 배치되고, 100미터 내의 커버리 지를 갖는 무선 통신 프로토콜을 지원하도록 설정된 무선 통신 회로; 상기 하우징 내에 배치된 통신 인터페이스; 상기 하우징 내에 배치되고, 상기 무선 통신 회로 및 상기 통신 인터페이스에 기능적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되고 상기 프로세서에 전기적으로 연결되거나 결합된 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 무선 통신 회로를 통하고 제1 SSID(service set identifie r)를 이용하여 제1 외부 장치에 무선으로 연결하고, 상기 무선 통신 회로를 이용하여 상기 제1 외부 장치로부터 상기 제1 외부 장치에 관한 제1 정보를 수신하고, 상기 무선 통신 회로 또는 통신 인터페이스 중 적어도 하나를 통해, 상기 제1 정보의 적어도 일부 및 상기 전자 장치에 관한 제2 정보를 제2 외부 장치로 전송하고, 상기 무 선 통신 회로 또는 상기 통신 인터페이스 중 적어도 하나를 통한 상기 제2 외부 장치로부터의 상기 제1 정보 및 상기 제2 정보에 기반한 상기 제1 외부 장치와 상기 전자 장치 간의 무선 연결을 위한 제2 SSID를 포함하는 연 결 정보를 상기 제1 외부 장치로 전달하거나, 또는, 상기 무선 통신 회로 또는 상기 통신 인터페이스 중 적어도 하나를 통해 상기 제2 외부 장치로부터 상기 연결 정보의 전송 요청을 수신하고, 상기 전송 요청에 응답하여, 상기 무선 통신 회로를 이용하여 상기 연결 정보를 상기 제1 외부 장치로 전송하고, 상기 무선 통신 회로를 통 하고, 상기 연결 정보를 이용하여 상기 제1 외부 장치에 무선으로 연결하도록 하는 인스트럭션들을 저장할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 전자 장치는 하우징; 상기 하우징 내에 배치되고, 100미터 내의 커버리지를 갖는 무선 통신 프로토콜을 지원하도록 구성된 무선 통신 회로; 상기 하우징 내에 배치되고, 상기 무선 통신 회로에 기능적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되고 상기 프로세서에 전기적으로 연결되거나 결합된 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 무선 통신 회로를 통 하고, 제1 SSID를 이용하여 무선 라우터에 무선으로 연결하고, 상기 무선 통신 회로를 이용하여, 상기 무선 라 우터로 상기 전자 장치에 관한 제1 정보를 전송하고, 상기 무선 통신 회로를 이용하여, 상기 전자 장치와 상기 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 상기 무선 라우터로부터 수신하고, 상기 무선 통신 회로를 통하고, 상기 연결 정보를 이용하여 상기 무선 라우터에 무선으로 연결하도록 하는 인스트럭 션들을 저장할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 시스템은 하우징; 상기 하우징 내에 배치된 통신 인터페이스; 상 기 하우징 내에 배치되고, 상기 통신 인터페이스에 기능적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되 고, 상기 프로세서에 전기적으로 연결되는 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상 기 통신 인터페이스를 통해 무선 라우터로부터 제1 외부 장치에 관한 제1 정보 및 상기 무선 라우터에 관한 제2정보를 수신하고, 상기 통신 인터페이스를 통해, 상기 제2 정보에 기반하여 결정되는 하나 이상의 제2 외부 장 치로 상기 제1 정보 중 적어도 일부, 상기 제2 정보 중 적어도 일부 및 상기 제1 외부 장치와 상기 무선 라우터 간의 무선 연결을 위한 연결 수락 요청을 전송하고, 상기 통신 인터페이스를 통해, 상기 제2 외부 장치로부터의 상기 제1 정보에 기반하고 SSID를 포함하는 연결 정보를 상기 제1 외부 장치로 전달하거나 상기 연결 정보의 전 송 요청을 상기 무선 라우터로 전달하도록 하는 인스트럭션들을 저장할 수 있다."}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들에 따르면, 다양한 형태의 전자 장치를 무선 라우터에 쉽게 접속하여 인터넷을 사 용할 수 있도록 할 수 있다. 일 실시 예에 따르면, 사용자가 IoT 장치의 네트워크 연결을 간편하게 설정할 수 있게 되어 사용자의 편의성을 개선할 수 있다. 일 실시 예에 따르면, 무선 라우터에 등록된 계정 정보를 이용하여 무선 라우터에 연결된 IoT 장치를 계정 정보 별로 관리할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2017-0029457", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대 해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다\", \"가질 수 있다\", \"포함한다\", 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B\", \"A 또는/및 B 중 적어도 하나\", 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B\", \"A 및 B 중 적어도 하나\", 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제1\", \"제2\", \"첫째\", 또는 \"둘째\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 예를 들면, 제1 사용자 기기와 제2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성 요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요 소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~하도록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성(또는 설정)된\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만 을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성 (또는 설정)된 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장 치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서 (generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은 관련 기술의 문맥 상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시 예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시 예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크톱 PC (desktop PC), 랩탑 PC(laptop PC), 넷북 컴퓨터(netbook computer), 워크스테이션(workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라, 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따르면 웨 어러블 장치는 엑세서리 형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치 (head-mounted-device(HMD)), 직물 또는 의류 일체 형(예: 전자 의복), 신체 부착 형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식 형(예: implantable circuit) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD 플레이어(Digital Video Disk player), 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널(security control panel), TV 박스(예: 삼성 HomeSync™, 애플TV™, 또는 구글 TV™), 게임 콘솔(예: Xbox™, PlayStation™), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 내비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(Global Navigation Satellite System)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시 예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1a는 일 실시 예에 따른 IoT 장치가 연결되는 시스템을 나타낸다. 도 1a를 참조하면, 시스템은 무선 라우터, IoT 장치, 클라우드 시스템 및 설정 장치를 포 함할 수 있다. 다양한 실시 예에서 시스템은 위 구성 요소들 중 일부 구성을 생략할 수 있다. 예를 들어, 시스템은 위 구성 요소들 중 클라우드 시스템을 생략할 수 있다. 다양한 실시 예에서, 시스템은 위 구성 요소 들 중 적어도 일부 구성을 복수 개 포함할 수 있다. 예를 들어, 시스템은 복수 개의 무선 라우터 또는 복 수 개의 설정 장치를 포함할 수 있다. 무선 라우터는 무선 장치들을 유선 장치에 연결하거나, 무선 장치들 간의 통신을 중계할 수 있다. 무선 라 우터는 유선 통신 장치와 무선 통신 장치를 잇는 브릿지 역할을 할 수 있다. 일 실시 예에서, 무선 라우터 는 액세스 포인트(AP, access point)의 기능을 수행할 수 있고, 액세스 포인트로 대체될 수 있다. 일 실시 예에서, 무선 라우터에는 복수 개의 IoT 장치가 연결될 수 있다. 일 실시 예에서, 무선 라우 터는 무선 통신 회로, 통신 인터페이스, 프로세서 및 메모리를 포함할 수 있다. 무선 통신 회로는 무선 라우터의 하우징 내에 배치되고, 무선 통신 프로토콜을 지원하도록 설정될 수 있다. 무선 통신 회로는 무선 라우터가 IoT 장치 또는 설정 장치와 무선으로 통신하도록 할 수 있다. 무선 통신 회로에서 지원하는 무선 통신 프로토콜은 블루투스(bluetooth) 방식, 지그비 (zigbee) 통신 방식, 무선 하트(wireless highway addressable remote transducer) 통신 방식, 근접장 통신 방 식, 와이파이(wifi) 방식, 와이파이 다이렉트(wifi direct) 방식, GSM, HSDPA, LTE, LTE-A, CDMA, CDMA2000 또 는 와이브로(wibro) 통신 방식 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 무선 통신 회로의 커버 리지는 100미터 내일 수 있다. 통신 인터페이스는 무선 라우터의 하우징 내에 배치되고, 무선 라우터가 클라우드 시스템 과 유선 또는 무선으로 통신하도록 할 수 있다. 프로세서는 하우징 내에 배치되고, 무선 통신 회로 및 통신 인터페이스에 기능적으로 연결될 수 있다. 프로세서는 무선 라우터의 전반적인 동작을 제어할 수 있다. 메모리는 하우징 내에 배치되어 프로세서에 전기적으로 연결되거나 집적될 수 있고, 무선 라우터 의 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. IoT 장치는 무선 라우터에 무선으로 연결되는 전자 장치이다. 예를 들어, IoT 장치는 냉장고, 세탁기, 텔레비전 또는 도어락(doorlock) 등일 수 있다. 일 실시 예에서, IoT 장치는 무선 통신 회로 , 프로세서 및 메모리를 포함할 수 있다. 무선 통신 회로는 IoT 장치의 하우징 내에 배치되고, 무선 통신 프로토콜을 지원하도록 설정될 수 있 다. 무선 통신 회로는 IoT 장치가 무선 라우터와 무선으로 통신하도록 할 수 있다. 무선 통신 회로의 무선 통신 프로토콜은 블루투스(bluetooth) 방식, 지그비(zigbee) 통신 방식, 무선 하트(wireless highway addressable remote transducer) 통신 방식, 근접장 통신 방식, 와이파이(wifi) 방식, 와이파이 다이 렉트(wifi direct) 방식, GSM, HSDPA, LTE, LTE-A, CDMA, CDMA2000 또는 와이브로(wibro) 통신 방식 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 무선 통신 회로의 커버리지는 100미터 내일 수 있다. 프로세서는 하우징 내에 배치되고, 무선 통신 회로에 기능적으로 연결될 수 있다. 프로세서는 IoT 장치의 전반적인 동작을 제어할 수 있다. 메모리는 하우징 내에 배치되어 프로세서에 전기적으로 연결되거나 집적될 수 있고, IoT 장치의 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 클라우드 시스템은 무선 라우터와 설정 장치를 잇는 매개체이다. 일 실시 예에서, 클라우드 시 스템은 하나 이상의 서버로 구성될 수 있다. 일 실시 예에서, 클라우드 시스템은 무선 라우터로부터 수신한 IoT장치의 정보 및 무선 라우터 의 정보를 설정 장치로 전송할 수 있다. 일 실시 예에서, 설정 장치로부터의 연결 정보 또는 연 결 정보의 전송 요청을 무선 라우터로 전달할 수 있다. 일 실시 예에서, 클라우드 시스템은 무선 라 우터로부터 수신한 무선 라우터와 관련된 계정 정보를 이용하여 계정 정보에 대응하는 설정 장치 로 IoT장치에 관한 정보 및 무선 라우터에 관한 정보를 전송할 수 있다. 일 실시 예에서, 복수 개의 무선 라우터가 하나의 계정 정보에 등록될 수 있다. 일 실시 예에서, 클라우드 시스템은 복수 개의 무선 라우터에 관한 정보 및 복수 개의 무선 라우터 각각에 연결된 복수 개의 IoT 장치에 관한 정보를 설정 장치로 전송할 수 있다. 일 실시 예에서, 클라우드 시스템은 계정 정보에 등록된 무선 라우터 또는 IoT 장치를 삭제하거나, 새로운 무선 라우터 또는 IoT 장치를 추가 등록 할 수 있다. 일 실시 예에서, 클라우드 시스템은 설정 장치로부터의 IoT 장치를 검색하기 위한요청을 무선 라우터로 전달할 수 있다. 일 실시 예에서, 클라우드 시스템은 통신 인터페이스, 프로세서 및 메모리를 포함할 수 있 다. 통신 인터페이스는 클라우드 시스템의 하우징 내에 배치되고, 클라우드 시스템이 무선 라우터 또는 설정 장치와 통신하도록 할 수 있다. 일 실시 예에서, 통신 인터페이스는 클라우드 시스 템이 무선 라우터 및 설정 장치와 유선 또는 무선으로 통신하도록 할 수 있다. 프로세서는 하우징 내에 배치되고, 통신 인터페이스에 기능적으로 연결될 수 있다. 프로세서는 클라우드 시스템의 전반적인 동작을 제어할 수 있다. 메모리는 하우징 내에 배치되어 프로세서에 전기적으로 연결되거나 집적될 수 있고, 클라우드 시스템 의 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 예를 들어, 메모리는 계정 정보, 계정 정 보와 연관된 무선 라우터에 관한 정보, 계정 정보와 연관된 IoT 장치에 관한 정보 및 계정 정보와 연 관된 설정 장치에 관한 정보 등을 저장할 수 있다. 설정 장치는 클라우드 시스템 또는 무선 라우터로부터 수신한 연결 수락 요청에 응답하여, 연결 수락 요청 화면을 표시하고, 사용자의 입력에 기반하여 연결 정보를 클라우드 시스템 또는 무선 라우터 로 전송할 수 있다. 예를 들어, 설정 장치는 스마트 폰, 텔레비전 또는 태블릿(tablet) 등일 수 있다. 일 실시 예에서, 설정 장치는 어플리케이션을 이용하여 연결 수락 요청 화면을 표시할 수 있고, 어플리케 이션은 설치 형태의 어플리케이션 또는 웹 기반(web-based) 어플리케이션일 수 있다. 설정 장치는 브라우 저를 통해 연결 수락 요청 화면을 표시할 수도 있다. 일 실시 예에서, 설정 장치는 연결 정보의 전송 요청을 무선 라우터로 전송할 수 있다. 일 실시 예에 서, 설정 장치는 무선 통신 회로, 프로세서, 메모리, 입력부 및 디스플레이를 포함할 수 있다. 무선 통신 회로는 설정 장치의 하우징 내에 배치되고, 무선 통신 프로토콜을 지원하도록 설정될 수 있다. 무선 통신 회로는 설정 장치가 클라우드 시스템 또는 무선 라우터와 무선으로 통신 하도록 할 수 있다. 무선 통신 회로의 무선 통신 프로토콜은 블루투스(bluetooth) 방식, 지그비(zigbee) 통신 방식, 무선 하트(wireless highway addressable remote transducer) 통신 방식, 근접장 통신 방식, 와이 파이(wifi) 방식, 와이파이 다이렉트(wifi direct) 방식, GSM, HSDPA, LTE, LTE-A, CDMA, CDMA2000 또는 와이 브로(wibro) 통신 방식 중 적어도 하나를 포함할 수 있다. 프로세서는 하우징 내에 배치되고, 무선 통신 회로에 기능적으로 연결될 수 있다. 프로세서는 설정 장치의 전반적인 동작을 제어할 수 있다. 메모리는 하우징 내에 배치되어 프로세서에 전기적으로 연결되거나 집적될 수 있고, IoT 장치의 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 입력부는 사용자로부터 검색 요청 입력 또는 인증 수락 입력 등의 입력을 획득할 수 있다. 디스플레이는 프로세서에 전기적으로 연결될 수 있고, 어플리케이션의 실행 화면을 출력할 수 있다. 일 실시 예에서, 디스플레이는 터치 패널과 함께 구현(예: 터치 스크린 패널(touch screen panel) 등)될 수 있다. 이 경우, 사용자는 디스플레이를 터치함으로써 사용자 입력을 발생시킬 수 있다. 다시 말해서, 디스플레이가 터치 패널과 함께 구현되는 경우, 디스플레이는 입력 장치와 출력 장치의 기능을 함께 수행하는 것으로 이해될 수 있다. 도 1b는 다른 실시 예에 따른 IoT 장치가 연결되는 시스템을 나타낸다. 다른 실시 예에서, IoT 장치가 연결되는 시스템은 도 1b와 같은 구성을 포함할 수 있다. 도 1b를 참조하면, 시스템은 서브 라우터(sub router)(100a), 루트 라우터(root router)(100b), IoT 장치, 클라우 드 시스템 및 설정 장치를 포함할 수 있다. 서브 라우터(100a)는 IoT 장치와 루트 라우터(100b)를 잇는 브릿지 역할을 할 수 있다. 서브 라우터(100 a)는 무선 통신 회로(110a)를 이용하여 IoT 장치에 연결하고, 무선 통신 회로(110a) 또는 통신 인터페이스(120a)를 통해 루트 라우터(100b)에 연결할 수 있다. 즉, 서브 라우터(100a)는 도 1a의 무선 라우터와 유 사한 역할을 할 수 있다. 일 실시 예에서, 서브 라우터(100a)는 무선 통신 회로(110a), 통신 인터페이스(120a), 프로세서(130a) 및 메모리(140a)를 포함할 수 있다. 각 구성은 전술한 무선 라우터의 무선 통신 회로 , 통신 인터페이스, 프로세서 및 메모리에 대응되므로, 각 구성에 대한 자세한 설명은 생 략된다. 루트 라우터(100b)는 서브 라우터(100a)와 클라우드 시스템을 잇는 브릿지 역할을 할 수 있다. 일 실시 예 에서, 루트 라우터(100b)는 무선 통신 회로(110b), 통신 인터페이스(120b), 프로세서(130b) 및 메모리(140b)를 포함할 수 있다. 루트 라우터(100b)는 무선 통신 회로(110b) 또는 통신 인터페이스(120b)를 통해 서브 라우터 (100a)에 연결하고, 통신 인터페이스(120b)를 통해 클라우드 시스템에 연결할 수 있다. 즉, 루트 라우터 (100b) 또한 도 1a의 무선 라우터와 유사한 역할을 할 수 있다. 각 구성은 전술한 무선 라우터의 무 선 통신 회로, 통신 인터페이스, 프로세서 및 메모리에 대응되므로, 각 구성에 대한 자세 한 설명은 생략된다. 이하에서는 도 2a 내지 도 15를 참조하여, 전술한 구성을 기초로 IoT 장치가 무선 라우터에 연결되는 과정을 설명한다. 이하의 설명에서 무선 라우터, IoT 장치, 클라우드 시스템 및 설정 장치는 도 1a에 도시된 무선 라우터, IoT 장치, 클라우드 시스템 및 설정 장치장치들의 구성 전부 또는 일부를 포 함할 수 있다. 다양한 실시예에 따라, 무선 라우터는 도 1b에 도시된 서브 라우터(100a) 및 루트 라우터 (100b)로 대체될 수 있다. 이하의 설명에서 무선 라우터, IoT 장치, 클라우드 시스템 및 설정 장치 각각의 프로세서 가 각 장치의 메모리에 저장된 명령어(commands or instructions)에 기반하여 동작을 수행하는 것으로 전제한다. 그리고 각 장치는 무선 통신 회로를 이용하거나 통신 인터페이스를 통해 상호간 통신하는 것으로 전 제한다. 이하에서는 도 2a 내지 도 2e를 참조하여 IoT 장치가 수신되는 SSID(service set identifier)를 이용하여 무선 라우터에 무선으로 연결하는 과정을 설명한다. 도 2a는 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결되는 과정을 나타낸 흐름도이다. 동작 201에서, 무선 라우터와 IoT 장치는 제1 SSID를 이용하여 서로 무선으로 연결될 수 있다. 일 실 시 예에서, 제1 SSID는 무선 라우터의 미리 설정된 식별자일 수 있다. 일 실시 예에서, 제1 SSID를 이용하 여 무선 라우터에 연결된 IoT 장치는 무선 라우터를 통해 기 설정된 URL(uniform resource locator)에 접근이 허가되거나 또는 클라우드 시스템과 통신할 수 있다. 구체적인 무선 연결 과정은 아래 에서 도 2b 및 도 2c를 참조하여 설명될 것이다.동작 202에서, IoT 장치는 IoT 장치에 관한 제1 정보 를 무선 라우터로 전송할 수 있다. 일 실시 예에서, IoT 장치는 무선 라우터에 연결되기 전, 제 1 정보를 전송할 수 있고, 이에 대한 구체적인 내용은 도 2b 및 도 2c를 참조하여 설명될 것이다. 일 실시 예에서, 제1 정보는 IoT 장치의 제조사 정보, 모델명, 기기명, 버전명, 제품군, 제조번호와 같은 시리얼 넘버(serial number), 네트워크 접속을 위한 인증 정보, 맥 어드레스(mac address) 또는 IP(internet protocol) 중 적어도 하나를 포함할 수 있다.동작 203에서, 무선 라우터는 수신한 제1 정보의 적어도 일부 및 무선 라우터에 관한 제2 정보를 클라우드 시스템으로 전송할 수 있다. 일 실시 예에서, 제2 정보 는 무선 라우터의 제조사, 모델명, 버전명, 무선 라우터의 시리얼 넘버, 등록번호, 맥 어드레스, 무 선 라우터가 설치된 위치 정보 또는 무선 라우터에 대응하는 하나 이상의 계정 정보 중 적어도 하나 를 포함할 수 있다. 일 실시 예에서, 제2 정보는 제2 SSID를 포함할 수 있다. 제2 SSID는 무선 라우터로의 무선 연결을 위한 식별자이고, 제2 SSID를 이용하여 무선 라우터에 연결된 IoT 장치는 무선 라우터를 통해 외부 망과 통신할 수 있다. 일 실시 예에서, 제2 정보는 상기 제2 SSID에 대응하는 비밀번호, 보안(security) 정보 또는 패스 포인트(passpoint) 연결을 위한 크리덴셜(credential) 정보를 중 적어도 하나를 더 포함할 수 있다. 일 실시 예에서, 무선 라우터는 복수 개의 IoT 장치와의 무선 연결 히스토리를 메모리에 저장할 수 있다. 무선 라우터는 동작 202에서 수신한 제1 정보 및 무선 연결 히스토리에 기반하여 연결된 IoT 장치가 연결된 이력이 없는 경우, 제1 정보의 적어도 일부 및 상기 제2 정보를 클라우드 시스템으로 전 송할 수 있다. 다시 말해, 무선 라우터는 IoT 장치가 새로 연결되는 경우에만 IoT 장치의 연결 절차를 수행할 수 있다. 동작 204에서, 클라우드 시스템은 제2 정보에 기반하여 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 IoT 장치와 무선 라우터 간의 연결 수락을 위한 요청을 적어도 하나 이상의 설정 장치로 전 송할 수 있다. 일 실시 예에서, 클라우드 시스템은 제2 정보에 기반하여 인증 요청을 전송할 설정 장치를 결정할 수 있다. 예를 들어, 클라우드 시스템은 제2 정보에 포함된 무선 라우터의 계정 정보에 대응하는 하나 이상의 설정 장치로 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 연결 수락 요청을 전송할 수 있 다. 일 실시 예에서, 제2 정보가 계정 정보를 포함하지 않은 경우, 클라우드 시스템은 제2 정보에 포함된 정보(예를 들어, 시리얼 넘버, 기기 등록번호 또는 맥 어드레스 등)에 기반하여 무선 라우터의 계정 정보 를 획득하고 계정 정보에 대응하는 하나 이상의 설정 장치로 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 연결 수락 요청을 전송할 수 있다. 일 실시 예에서, 계정 정보에 대응하는 설정 장치가 복수 개인 경우, 클라우드 시스템은 복수 개의 설정 장치 중 사용되는 중인 하나 이상의 설정 장치로 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 연결 수락 요청을 전송할 수 있다. 클라우드 시스템은 계정 정보에 대응하는 복수 개의 설정 장치 로 설정 장치가 사용되는 중인지 여부를 체크하기 위한 쿼리를 전송할 수 있다. 클라우드 시스템 은 쿼리에 대한 응답을 수신하고, 쿼리에 대한 응답에 기반하여 복수 개의 설정 장치 중 사용되는 중 인 것으로 결정된 설정 장치로 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 연결 수락 요청을 전 송할 수 있다. 예를 들어, 텔레비전과 태블릿이 계정 정보에 대응하는 설정 장치인 경우, 클라우드 시스템은 텔레비 전 및 태블릿으로 사용되는 중인지 여부를 체크하기 위한 쿼리를 전송할 수 있다. 클라우드 시스템이 태블 릿으로부터 태블릿이 사용되는 중이라는 응답을 수신하는 경우, 클라우드 시스템은 태블릿으로만 제1 정보 의 적어도 일부, 제2 정보의 적어도 일부 및 연결 수락 요청을 전송할 수 있다. 일 실시 예에서, 계정 정보에 대응하는 설정 장치가 복수 개이고, 복수 개의 설정 장치가 서로 다른 유형의 설정 장치인 경우, 클라우드 시스템은 각각의 설정 장치로 다른 형태의 제1 정보의 적어 도 일부, 제2 정보의 적어도 일부 및 연결 수락 요청을 전송할 수 있다. 예를 들어, 설정 장치가 텔레비 전인 경우, 클라우드 시스템은 리모컨의 푸른 버튼을 눌러 연결을 수락하라는 메시지를 전송할 수 있다. 다른 예로, 설정 장치가 휴대 단말인 경우, 터치 스크린을 통해 연결 수락 입력을 획득할 수 있는 UI 메시 지를 전송할 수 있다. 일 실시 예에서, 클라우드 시스템은 무선 라우터에 연결되었던 IoT 장치의 이력을 저장할 수 있 다. 클라우드 시스템은 수신된 제1 정보에 기반하여 IoT 장치의 이력을 검색할 수 있다. 이를 통해, 클라우드 시스템은 IoT 장치가 정상적인 제품인지 여부를 체크할 수 있으며, 비정상적인 네트워크 접 속 또는 해킹 등을 방지할 수 있다. 일 실시 예에서, 클라우드 시스템은 IoT 장치의 이력을 삭제할 수도 있다. 동작 205에서, 설정 장치는 제1 정보 중 적어도 일부, 제2 정보 중 적어도 일부 및 연결 수락 요청을 디스 플레이에 표시하고, 연결 수락 요청에 대한 입력을 획득할 수 있다. 예를 들어, 설정 장치는 무선 연결을 요청하는 IoT 장치의 정보 및 무선 연결을 요청받는 무선 라우터의 정보를 표시하고, 연결의 수락 여 부를 질의하는 메시지 및 연결 수락 요청에 대한 입력을 획득하는 오브젝트를 포함하는 UI(user interface)를 표시할 수 있다. 또 다른 예를 들어, 설정 장치는 무선 연결을 요청하는 IoT 장치의 정보 및 무선 연 결을 요청받는 무선 라우터의 정보를 설정 장치의 출력 인터페이스(예: 스피커)를 통해 출력하고, 연결 수 락 요청에 대한 입력을 입력 인터페이스(예: 마이크)를 통해 획득할 수 있다. 동작 206에서, 설정 장치는 연결 수락 요청에 대한 입력에 기반하여 IoT 장치와 무선 라우터 간 의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 IoT 장치로 전송할 수 있다. 이 때, 클라우드 시스 템 및 무선 라우터는 설정 장치가 전송한 연결 정보를 IoT 장치로 전달할 수 있다. 일 실시 예에서, 설정 장치는 연결을 수락하는 입력을 획득한 경우, 제2 SSID를 포함하는 연결 정보를 IoT 장치로 전송할 수 있다. 설정 장치는 연결을 거절하는 입력을 획득한 경우, 연결 거절 메시지를 IoT장치, 무선 라우터 또는 클라우드 시스템 중 적어도 하나로 전송할 수 있다. 일 실시 예에서, 동작 204에서 클라우드 시스템이 설정 장치로 전송하는 제2 정보는 제2 SSID를 포함 하지 않을 수 있다. 이 경우, 설정 장치는 메모리에 저장된 무선 라우터의 제2 SSID를 이용하여 연결 정보를 IoT 장치로 전송할 수 있다. 일 실시 예에서, 설정 장치의 메모리는 제2 SSID를 저장하 지 않을 수 있다. 이러한 경우, 설정 장치는 제2 SSID를 포함하는 제2 정보를 요청할 수 있고, 이에 대한 구체적인 내용은 도 2d를 참조하여 설명될 것이다. 일 실시 예에서, 설정 장치가 전송하는 연결 정보는 제2 SSID에 대응하는 비밀번호, 보안 정보 또는 패스 포인트 연결을 위한 크리덴셜 정보 중 적어도 하나를 포함할 수 있다. 예를 들어, 보안 정보는 IoT 장치가 무선 라우터에 연결 할 때 사용할 인증 방식에 대한 정보(예를 들어, Wpa2-psk 또는 802.1x 등)를 포함할 수 있다. 예를 들어, 크리덴셜 정보는 무선 라우터가 신뢰하는 루트 인증 기관 관련 정보, 공개 키 암호 알고리즘을 위한 정보, 공인 인증 기관이 발행하는 공개 키 인증서, 무선 라우터를 위한 온라인 사인업(online sign- up) 및 로밍 컨소시움 정보 중 적어도 하나를 포함할 수 있다. 또 다른 예를 들어 크리덴셜 정보는 무선 라우터가 IoT 장치의 네트워크 접속을 허용하기 위한 정보 일 수 있다. 일 실시 예에서, 크리덴셜 정보는 IoT 장치 별로 다를 수 있다. 예를 들어, 크리덴셜 정보는 IoT 장치의 제품군 별로 다를 수 있다. 일 실시 예에서, 설정 장치가 연결 정보를 전송하기 전, 설정 장치 및 IoT 장치 간 상호 인증 과정 및 보안 채널 형성 동작이 수행될 수 있다. 일 실시 예에서, 설정 장치는 연결을 수락하는 입력을 획득한 경우, 무선 라우터로 연결 정보의 전송 요청을 전송할 수 있다. 이에 대한 구체적인 내용은 도 2e를 참조하여 설명될 것이다. 동작 207에서, 무선 라우터와 IoT 장치는 연결 정보에 포함된 제2 SSID를 이용하여 서로 무선으로 연 결될 수 있다. 일 실시 예에서, 제2 SSID를 이용하여 무선 라우터에 연결된 IoT 장치는 기 설정된 URL 또는 클라우 드 시스템뿐만 아니라 외부 인터넷 등과 통신할 수 있다. 일 실시 예에서, 무선 라우터는 크리덴셜 정보에 기반하여 IoT 장치의 연결 권한을 결정하여 결정된 연결 권한에 따라 IoT 장치의 네트워크 연결을 제어할 수 있다. 예를 들어, 무선 라우터는 제1 크리 덴셜 정보를 제공받은 IoT 장치가 모든 외부 네트워크를 사용할 수 있고, 트래픽에 대한 높은 우선순위를 갖도록 할 수 있다. 또 다른 예를 들어, 무선 라우터는 제2 크리덴셜 정보를 제공받은 IoT 장치가 외 부 인터넷(http)만 사용할 수 있고, 트래픽에 대한 낮은 우선순위를 갖도록 할 수 있다. 일 실시 예에서, 무선 라우터는 IoT 장치가 제2 SSID를 이용하여 연결되었음을 설정 장치에 알 릴 수 있다. 도 2b는 일 실시 예에 따른 IoT 장치와 무선 라우터가 무선 연결을 수립하는 과정을 나타낸 흐름도이 다. 도 2c는 다른 실시 예에 따른 IoT 장치와 무선 라우터가 무선 연결을 수립하는 과정을 나타낸 흐 름도이다. 일 실시 예에 따라, 동작 201에 해당하는 무선 연결은 도 2b 또는 도 2c에 도시된 과정에 따라 수립될 수 있다. 도 2b는 IoT 장치가 무선 연결을 트리거(trigger)하는 경우를 나타낸다. 도 2b를 참조하면, 동작 201a에서, IoT 장치는 프로브 요청 프레임(probe request frame)을 무선 라우터 로 전송할 수 있다. 일 실시 예에서, IoT 장치는 전원이 온(on)된 때 프로브 요청 프레임을 무선 라 우터로 전송하거나 주기적으로 프로브 요청 프레임을 무선 라우터로 전송할 수 있다. 프로브 요청 프 레임을 전송하는 것은 무선 라우터를 검색하는 것이고, 프로브 요청 프레임은 기 설정된 제1 SSID를 포함 할 수 있고, 제1 SSID는 히든(hidden) SSID일 수 있다. 일 실시 예에서, IoT 장치는 IoT 장치에 관 한 제1 정보를 포함하는 프로브 요청 프레임을 전송할 수 있다. 예를 들어, 제1 정보는 프로브 요청 프레임의 VSIE(vendor specific information element) 영역에 포함될 수 있다.동작 201b에서, 무선 라우터는 프로브 응답 프레임(probe response frame)을 IoT 장치로 전송할 수 있다. 일 실시 예에서, 제1 SSID가 히든 SSID인 경우, 무선 라우터는 기 설정된 제1 SSID를 포함하는 프로 브 요청 프레임에만 응답하여, 프로브 응답 프레임을 IoT 장치로 전송할 수 있다. 일 실시 예에서, 무선 라우터는 프로브 요청 프레임의 VSIE 영역으로부터 IoT 장치에 관한 제1 정보를 확인할 수 있고, IoT 장치의 정보에 기반하여 프로브 응답 프레임의 전송 여부를 결정할 수 있다. 동작 201c에서, IoT 장치는 결합 요청 프레임(association request frame)을 무선 라우터로 전송할 수 있다. 일 실시 예에서, IoT 장치는 IoT 장치에 관한 제1 정보를 포함하는 결합 요청 프레임을 전 송할 수 있다. 예를 들어, 제1 정보는 결합 요청 프레임의 VSIE 영역에 포함될 수 있다 일 실시 예에서, 결합 요청 프레임은 네트워크 연결을 위한 프레임으로써, 결합 과정을 통해 무선 라우터 는 IoT 장치를 위한 리소스와 통신에 사용할 자격(capability)을 IoT 장치와 협의할 수 있다. 결합 요청 프레임은 IoT 장치의 Radio NIC(network interface card)에 대한 정보 및 SSID 등을 포함할 수 있다. 동작 201d에서, 무선 라우터는 결합 응답 프레임(association response frame)을 IoT 장치로 전송할 수 있다. 결합 응답 프레임이 전송됨으로써, IoT 장치와 무선 라우터 간의 무선 연결이 수립될 수 있 다. 일 실시 예에서, 무선 라우터는 프로브 요청 프레임 또는 결합 요청 프레임으로부터 제1 정보를 획득할 수 있고, 프로브 요청 프레임 또는 결합 요청 프레임이 제1 정보를 포함하는 경우, 도 2a의 동작 202는 생략될 수 있다. 도 2c는 무선 라우터가 무선 연결을 트리거하는 경우를 나타낸다. 도 2c를 참조하면, 동작 201e에서, 무선 라우터는 제1 SSID를 포함하는 비콘 프레임(beacon frame)을 브로 드캐스트(broadcast)할 수 있다. 동작 201f에서, 비콘 프레임을 수신한 IoT 장치는 결합 요청 프레임을 무선 라우터로 전송할 수 있다. 일 실시 예에서, IoT 장치는 IoT 장치에 관한 제1 정보를 포함하는 결합 요청 프레임을 전송할 수 있다. 예를 들어, 제1 정보는 결합 요청 프레임의 VSIE 영역에 포함될 수 있다. 동작 201g에서, 무선 라우터는 결합 응답 프레임을 IoT 장치로 전송할 수 있다. 결합 응답 프레임이 전송됨으로써, IoT 장치와 무선 라우터 간의 무선 연결이 수립될 수 있다. 일 실시 예에서, 무선 라우터는 IoT 장치로부터 수신되는 결합 요청 프레임으로부터 제1 정보를 획득 할 수 있고, 결합 요청 프레임이 제1 정보를 포함하는 경우, 도 2a의 동작 202는 생략될 수 있다. 도 2d는 일 실시 예에 따른 설정 장치가 제2 정보를 요청하고 제2 정보를 수신하는 과정을 나타낸 흐름도 이다. 일 실시 예에서, 설정 장치는 동작 204에서 제2 SSID를 포함하지 않는 제2 정보를 수신할 수 있다. 이러한 경우, 도 2d를 참조하면, 동작 205a에서 설정 장치는 클라우드 시스템으로 제2 SSID를 포함하 는 제2 정보 요청을 전송할 수 있다. 동작 205b에서, 클라우드 시스템은 무선 라우터로 제2 SSID를 포함하는 제2 정보 요청을 전송할 수 있다. 동작 205c에서, 무선 라우터는 클라우드 시스템으로 제2 SSID를 포함하는 제2 정보를 전송할 수 있다. 동작 205d에서, 클라우드 시스템은 설정 장치로 제2 SSID를 포함하는 제2 정보를 전송할 수 있다. 도 2a의 동작 206에서 설정 장치는 수신한 제2 SSID를 포함하는 제2 정보를 이용하여 연결 정보를 IoT 장 치로 전송할 수 있다. 도 2e는 일 실시 예에 따른 연결 정보의 전송 요청에 따라 무선 라우터가 연결 정보를 IoT 장치로 전 송하는 과정을 나타내는 흐름도이다. 일 실시 예에서, 설정 장치는 연결 정보를 발송하지 않고, 무선 라우터로 연결 정보의 전송 요청을 전송하고, 무선 라우터가 연결 정보를 IoT 장치로 전송할 수 있다. 예를 들어, 연결 정보는, IoT 장 치가 무선 라우터에 접속을 수행하기 위해 전송한, 연결 수락 요청에 대한 결과일 수 있다. 도 2e를 참조하면, 동작 206a에서, 설정 장치는 무선 라우터로 연결 정보의 전송 요청을 전송할 수 있다. 이 때, 클라우드 시스템은 설정 장치가 전송한 연결 정보의 전송 요청을 무선 라우터로 전달할 수 있다. 동작 206b에서, 무선 라우터는 제2 SSID를 포함하는 연결 정보를 전송할 수 있다. 일 실시 예에서, 무선 라우터가 연결 정보를 전송하기 전, 무선 라우터 및 IoT 장치 간 상호 인 증 과정 및 보안 채널 형성 동작이 수행될 수 있다. 이하에서는 도 3 내지 도 5b를 참조하여, 동작 201 내지 동작 207의 실시 예에 따라 설정 장치가 표시하는 화면을 설명한다. 도 3은 일 실시 예에 따른 인증 요청을 수신한 설정 장치가 표시하는 화면을 나타낸다. 도 4는 일 실시 예 에 따른 연결 정보를 전송한 설정 장치가 표시하는 화면을 나타낸다. 도 5a는 일 실시 예에 따른 IoT 장치 가 무선 라우터에 연결된 후 설정 장치가 표시하는 화면을 나타낸다. 도 5b는 일 실시 예에 따 른 설정 장치가 무선 라우터에 연결된 IoT 장치 리스트를 표시하는 화면을 나타낸다. 동작 201 내지 동작 204 후, 동작 205에서, 도 3에 도시된 것과 같이, 설정 장치는 제1 정보(예를 들어, IoT 장치의 종류(냉장고) 또는 시리얼 넘버(RF95K9980S7) 등)의 적어도 일부, 제2 정보(예를 들어, 무선 라우터의 이름(AP A))의 적어도 일부, 연결의 수락 여부를 질의하는 메시지 및 연결 수락 요청에 대한 입 력을 획득하는 오브젝트를 포함하는 UI를 표시할 수 있다. 도면에 나타나지는 않았지만, 설정 장치는 IoT 장치의 제품군 또는 모델명 및 무선 라우터의 위치 정보 등 수신한 제1 정보 및 제2 정보를 더 표시할 수 있다. 동작 205에서 설정 장치는 연결을 수락하는 입력을 획득한 경우, 동작 206에서, 설정 장치는 연결 정 보를 전송한 후, IoT 장치가 제2 SSID를 이용하여 무선 라우터에 연결될 때까지 도 4에 도시된 것과 같이 연결 진행 상태를 나타내는 화면을 표시할 수 있다. 동작 207에서 IoT 장치 및 무선 라우터가 제2 SSID를 이용하여 무선으로 연결된 후, 설정 장치 는 IoT 장치가 제2 서비스 셋 식별자를 이용하여 연결되었다는 정보를 수신할 수 있다. 설정 장치는 설정 장치는 상기 정보의 수신에 응답하여, 도 5a에 도시된 것과 같이 연결 완료 메시지를 표시할 수 있다. 설정 장치는 도 5b에 도시된 것과 같이 무선 라우터에 제2 SSID를 이용하여 연결된 IoT 장치 의 리스트를 무선 라우터의 정보와 함께 표시할 수 있다. 예를 들어, 리스트는 새롭게 추 가된 IoT 장치에 대해 시각적 효과(예: 아이콘, 텍스트 또는 색상 등)를 제공하여 표시할 수 있다. 이하에서는 도 6을 참조하여 설정 장치의 검색 요청에 따라 IoT 장치가 무선 라우터에 연결되는 과정을 설명한다. 도 6은 일 실시 예에 따른 설정 장치의 요청에 따라 IoT 장치가 무선 라우터에 연결되는 과정을 나타낸 흐름도이다. 동작 601에서, 설정 장치는 IoT 장치를 찾기 위한 검색 요청 입력을 획득할 수 있다. 일 실시 예에서, 설정 장치는 복수 개의 무선 라우터 중 어느 하나의 무선 라우터 주변의 IoT 장치(20 0)를 찾기 위한 검색 요청 입력을 획득할 수 있다. 동작 602에서, 검색 요청 입력 획득에 응답하여, 설정 장치는 무선 라우터로 검색 요청을 전송할 수 있다. 이 때, 클라우드 시스템은 설정 장치가 전송한 검색 요청을 무선 라우터로 전달할 수 있 다. 동작 603에서, 검색 요청 수신에 응답하여, 무선 라우터는 IoT 장치를 스캔하기 위한 제1 SSID를 포 함하는 비콘 프레임을 브로드캐스트할 수 있다. 동작 603은 도 2c의 동작 201e에 대응될 수 있다. 동작 604에서, 무선 라우터와 IoT 장치는 제1 SSID를 이용하여 서로 무선으로 연결될 수 있다. 동작 603에서 제1 SSID를 포함하는 비콘 프레임이 브로드캐스트 되었으므로, 동작 604는 도 2c의 동작 201f 및 동작 201g에 대응될 수 있다. 동작 605에서, IoT 장치는 IoT 장치에 관한 제1 정보를 무선 라우터로 전송할 수 있다. 동작 606에서, 무선 라우터는 수신한 제1 정보의 적어도 일부 및 무선 라우터에 관한 제2 정보를 클 라우드 시스템으로 전송할 수 있다. 동작 607에서, 클라우드 시스템은 제2 정보에 기반하여 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 IoT 장치와 무선 라우터 간의 연결 수락을 위한 요청을 전송할 수 있다. 일 실시 예에서, 클라우 드 시스템은 검색 요청을 전송한 설정 장치로 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 IoT 장치와 무선 라우터 간의 연결 수락을 위한 요청을 전송할 수 있다. 동작 608에서, 설정 장치는 제1 정보 중 적어도 일부, 제2 정보 중 적어도 일부 및 연결 수락 요청을 디스 플레이에 표시하고, 연결 수락 요청에 대한 입력을 획득할 수 있다. 동작 609에서, 설정 장치는 연결 수락 요청에 대한 입력에 기반하여 IoT 장치와 무선 라우터 간 의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 IoT 장치로 전송할 수 있다. 일 실시 예에서, 설정 장치의 메모리가 제2 SSID를 저장하지 않고 설정 장치가 클라우드 시스템(30 0)으로부터 제2 SSID를 수신하지 않은 경우, 설정 장치는 도 2d를 참조하여 전술한 바와 같이 제2 SSID를 포함하는 제2 정보를 요청하여 제2 SSID를 획득할 수 있다. 일 실시 예에서, 도 2e를 참조하여 전술한 바와 같이 설정 장치는 무선 라우터로 연결 정보의 전송 요청을 전송하고, 무선 라우터가 IoT 장치로 연결 정보를 전송할 수 있다. 동작 610에서, 무선 라우터와 IoT 장치는 연결 정보에 포함된 제2 SSID를 이용하여 서로 무선으로 연 결될 수 있다. 동작 605 내지 동작 610은 동작 202 내지 207에 대응되는 동작이고, 동작 202 내지 동작 207에 대한 설명에서 언급된 실시 예들은 동작 605 내지 동작 610에도 적용되는 것으로 이해될 수 있다. 이하에서는 도 7a 내지 도 10을 참조하여, 동작 601 내지 동작 610의 실시 예에 따라 설정 장치가 표시하 는 화면을 설명한다. 도 7a는 일 실시 예에 따른 설정 장치가 무선 라우터에 연결된 IoT 장치 리스트를 표시하는 화 면을 나타낸다. 도 7b는 일 실시 예에 따른 신규 IoT 장치를 검색하는 요청 신호를 전송하기 위해 설정 장 치가 표시하는 화면을 나타낸다. 도 8은 일 실시 예에 따른 검색 요청 신호를 전송한 후 설정 장치가 표시하는 화면을 나타낸다. 도 9a는 일 실시 예에 따른 연결 수락 요청을 수신한 사용자 단말이 표시하는 화면 을 나타낸다. 도 9b는 일 실시 예에 따른 IoT 장치가 발견되지 않았다는 메시지를 수신한 사용자 단말이 표시하는 화면을 나타낸다. 도 10은 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결된 후 사용자 단말이 IoT 장치 리스트를 표시하는 화면을 나타낸다. 동작 601에서, 도 7a에 도시된 것과 같이 설정 장치는 설정 장치에 대응하는 계정 정보에 등록된 복 수 개의 무선 라우터의 정보(예를 들어, 각 무선 라우터의 이름(예: 'AP A' 및 'AP B') 및 위치) 및 복수 개의 무선 라우터 각각에 연결된 IoT 장치의 리스트(701a, 701b)(예를 들어, AP A에 연결된 IoT 장치는 에어컨 및 텔레비전, AP B에 연결된 IoT 장치는 냉장고)를 표시할 수 있다. 설정 장치 는 무선 라우터 검색 요청 입력을 획득하기 위한 오브젝트(702a, 702b)를 표시할 수 있고, 상기 오브젝트 를 통해 검색 요청 입력을 획득할 수 있다. 다른 실시 예로, 도 7a에 도시되지는 않았지만, 설정 장치는 계정 정보에 등록된 복수 개의 무선 라우터 전부로 검색 요청을 전송하기 위한 오브젝트를 표시할 수 있고, 상기 오브젝트를 통해 복수 개의 무선 라우터 전부로 검색 요청을 전송하기 위한 입력을 획득할 수 있다. 일 실시 예에서, 설정 장치는 AP A 주변의 신규 IoT 장치를 검색하는 오브젝트(702a)를 통해 검색 요 청 입력을 획득한 후, 도 7b에 도시된 것과 같이 검색 요청 여부를 확인하는 질의 메시지를 포함하는 UI를 더 표시할 수 있다. 설정 장치는 상기 UI를 통해 검색 요청을 확인하는 입력을 획득할 수 있다. 동작 601에서 설정 장치는 AP A 주변의 IoT 장치를 검색하는 오브젝트(702a)를 통해 검색 요청 입력 을 획득한 후, 동작 602에서, AP A로 검색 요청을 전송할 수 있다. 일 실시 예에서, 설정 장치는 검색 요 청을 전송한 후, 연결 수락 요청이 수신될 때까지 도 8에 도시된 것과 같이 검색 진행 상태를 나타내는 화 면을 표시할 수 있다. 동작 603에서 AP A는 제1 SSID를 포함하는 비콘 프레임을 브로드 캐스트하고, 동작 604에서 AP A는 새로운 IoT 기기인 냉장고와 무선으로 연결될 수 있다. 동작 605에서 IoT 장치인 냉장고는 냉장고에 관한 제1 정보(예 를 들어, IoT 장치의 종류(냉장고) 또는 시리얼 넘버(RF95K9980S7))를 AP A로 전송할 수 있다. 동작 606에서, AP A는 클라우드 시스템으로 냉장고의 정보 및 AP A의 정보를 전송할 수 있다. 동작 607에 서, 클라우드 시스템은 AP A의 계정 정보에 대응하는 설정 장치 또는 검색 요청을 전송한 설정 장치 로 검출된 IoT 장치(예: 냉장고)의 정보, 검색을 수행한 무선 라우터의 정보 및 연결 수락 요청 을 전송할 수 있다. 동작 608에서, 도 9a에 도시된 것과 같이, 설정 장치는 냉장고에 관한 정보(예를 들어, IoT 장치의 종류(냉장고) 또는 시리얼 넘버(RF95K9980S7) 등), AP A에 관한 정보(예를 들어, 무선 라우터의 이름(AP A)), 연결의 수락 여부를 질의하는 메시지 및 연결 수락 요청에 대한 입력을 획득하는 오브젝트를 포함하는 UI를 표시할 수 있다. 도면에 나타나지는 않았지만, 설정 장치는 IoT 장치(20 0)의 제품군 또는 모델명 및 무선 라우터의 위치 정보 등 수신한 IoT 장치(예: 냉장고)에 관한 정보 및 무선 라우터(예: AP A)에 관한 정보를 더 표시할 수 있다. 일 실시 예에 따라, 동작 604에서 무선 라우터에 새로운 IoT 장치가 연결되지 않는 경우(예를 들어, 일정 시간 내에 IoT 장치가 발견되지 않는 경우), 무선 라우터는 새로운 IoT 장치가 존재하지 않는다 는 메시지를 클라우드 시스템으로 전송하고, 클라우드 시스템은 수신한 메시지를 설정 장치로 전송할 수 있다. 설정 장치는 도 9b에 도시된 것과 같이 새로운 IoT 장치가 발견되지 않았다는 메시 지 및 재검색 요청 입력을 획득하기 위한 UI를 표시할 수 있다. 일 실시 예에 따라 설정 장치가 동작 608에서 연결 수락 입력을 획득한 경우(예를 들어, 도 9a에서 '예'에 대한 입력을 수신한 경우), 동작 609에서 설정 장치는 제2 SSID를 포함하는 연결 정보를 새로 연결된 IoT 장치인 냉장고로 전송할 수 있다. 동작 610에서, 냉장고와 AP A는 제2 SSID를 이용하여 무선으로 연결될 수 있다. 냉장고 및 AP A가 제2 SSID를 이용하여 무선으로 연결된 후, 설정 장치는 냉장고가 AP A에 제2 SSID를 이 용하여 연결되었다는 정보를 수신할 수 있다. 설정 장치는 도 10에 도시된 것과 같이 연결 완료 메시지 및 무선 라우터(예: AP A)에 연결된 IoT 장치의 리스트를 표시할 수 있다. 무선 라우 터예를 들어 설정 장치는 기존에 연결되어 있던 IoT 장치들(예를 들어, 에어컨, TV)과 새로 연결된 IoT 장치(예를 들어, 냉장고)의 정보를 표시할 수 있다. 일 실시 예에 따르면, 설정 장치는 새롭게 추가된 장치에는 시각적 효과(예를 들어, 아이콘, 텍스트, 또는 색상 등)를 제공하여 표시할 수 있다. 이하에서는 도 3 내지 도 5b 및 도 11을 참조하여 설정 장치가 무선 라우터에 무선으로 직접 연결된 경우, IoT 장치가 무선 라우터에 연결되는 과정을 설명한다. 도 11은 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결되는 과정을 나타낸 흐름도이다. 동작 1101에서, 무선 라우터와 IoT 장치는 제1 SSID를 이용하여 서로 무선으로 연결될 수 있다. 일 실시 예에서, 제1 서비스 셋 식별자를 가지는 무선 네트워크를 통해 무선 라우터에 연결한 IoT 장치 는 무선 라우터를 통해 기 설정된 URL에 접근이 허가되거나 기 설정된 클라우드 시스템과 통신할 수 있다. 동작 1102에서, IoT 장치는 이용하여 IoT 장치에 관한 제1 정보를 무선 라우터로 전송할 수 있 다. 일 실시 예에서, IoT 장치는 무선 라우터에 연결되기 전, 제1 정보를 전송할 수 있고, 이에 대한 구체적인 내용은 도 2b 및 도 2c를 참조하여 설명된 것과 같다.무선 라우터무선 라우터 동작 1103에서, 무선 라우터는 제1 정보의 적어도 일부, 무선 라우터에 관한 제2 정보 및 IoT 장치 와 무선 라우터 간의 연결 수락을 위한 요청을 설정 장치로 전송할 수 있다. 일 실시 예에서,설정 장치는 무선 라우터에 무선으로 직접 연결된 설정 장치일 수 있다. 복수 개의 설정 장치 가 무선 라우터에 연결된 경우, 무선 라우터는 복수 개의 설정 장치 전부 또는 일부로 제1 정보의 적어도 일부, 제2 정보 및 IoT 장치와 무선 라우터 간의 연결 수락을 위한 요청을 전송할 수 있다. 일 실시 예에서, 무선 라우터는 복수 개의 설정 장치 중 사용중인 하나 이상의 설정 장치(40 0)로 제1 정보의 적어도 일부, 제2 정보 및 연결 수락 요청을 전송할 수 있다. 동작 1104에서, 설정 장치는 제1 정보 중 적어도 일부, 제2 정보 중 적어도 일부 및 연결 수락 요청을 디 스플레이에 표시하고, 연결 수락 요청에 대한 입력을 획득할 수 있다. 예를 들어, 도 3과 같이, 설정 장치(40 0)는 제1 정보(예를 들어, IoT 장치의 종류(냉장고) 또는 시리얼 넘버(RF95K9980S7) 등), 제2 정보(예를 들어, 무선 라우터의 이름(AP A)), 연결의 수락 여부를 질의하는 메시지 및 연결 수락 요청에 대한 입력을 획득하는 오브젝트를 포함하는 UI를 표시할 수 있다. 동작 1105에서, 설정 장치는 연결 수락 요청에 대한 입력에 기반하여 IoT 장치와 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 IoT 장치로 전송할 수 있다. 이 때, 무선 라우터 는 설정 장치가 전송한 연결 정보를 IoT 장치로 전달할 수 있다. 일 실시 예에서, 동작 1103에서 무선 라우터가 설정 장치로 전송하는 제2 정보는 제2 SSID를 포함하 지 않을 수 있다. 이 경우, 설정 장치는 메모리에 저장된 무선 라우터의 제2 SSID를 이용하여 연결 정보를 IoT 장치로 전송할 수 있다. 일 실시 예에서, 설정 장치의 메모리는 제2 SSID를 저장하 지 않을 수 있다. 이러한 경우, 설정 장치는 제2 SSID를 포함하는 제2 정보의 요청을 무선 라우터로 전송할 수 있다. 무선 라우터는 상기 요청에 응답하여, 제2 SSID를 포함하는 제2 정보를 설정 장치로 전송할 수 있다. 일 실시 예에서, 설정 장치가 연결 정보를 전송하기 전, 설정 장치 및 IoT 장치 간 상호 인증 과정 및 보안 채널 형성 동작이 수행될 수 있다. 일 실시 예에서, 설정 장치는 연결을 수락하는 입력을 획득한 경우, 무선 라우터로 연결 정보의 전송 요청을 전송할 수 있다. 예를 들어, 설정 장치는 연결 정보를 발송하지 않고, 무선 라우터로 연결 정 보의 전송 요청을 전송하고, 무선 라우터가 연결 정보를 IoT 장치로 전송할 수 있다. 이러한 경우, 무선 라우터가 연결 정보를 전송하기 전, 무선 라우터 및 IoT 장치 간 상호 인증 과정 및 보안 채널 형성 동작이 수행될 수 있다. 일 실시 예에서, 설정 장치는 연결을 수락하는 입력을 획득한 경우, 동작 1105에서, 설정 장치는 연 결 정보를 전송한 후, IoT 장치가 제2 SSID를 이용하여 무선 라우터에 연결될 때까지 도 4에 도시된 것과 같이 연결 진행 상태를 나타내는 화면을 표시할 수 있다. 동작 1106에서, 무선 라우터와 IoT 장치는 연결 정보에 포함된 제2 SSID를 이용하여 서로 무선으로 연결될 수 있다. 일 실시 예에서, IoT 장치 및 무선 라우터가 제2 SSID를 이용하여 무선으로 연결된 후, 설정 장치는 IoT 장치가 제2 서비스 셋 식별자를 이용하여 연결되었다는 정보를 수신할 수 있다. 설정 장치는 상기 정보의 수신에 응답하여, 도 5a에 도시된 것과 같이 연결 완료 메시지를 표시할 수 있다. 설정 장치는 도 5b에 도시된 것과 같이 무선 라우터에 제2 SSID를 이용하여 연결된 IoT 장치 의 리스트를 무선 라우터의 정보와 함께 표시할 수 있다. 동작 1101 내지 동작 1106은 동작 201 내지 동작 203 및 동작 205 내지 동작 207에 대응될 수 있고, 동작 201 내지 동작 203 및 동작 205 내지 동작 207에 대한 설명에서 언급된 실시 예들은 동작 1101 내지 동작 1106에도 적용되는 것으로 이해될 수 있다. 이하에서는 도 7a 내지 도 10 및 도 12를 참조하여 무선 라우터에 설정 장치가 직접 연결된 경우, 설 정 장치의 요청에 따라 IoT 장치가 무선 라우터에 연결되는 과정을 설명한다. 도 12는 일 실시 예에 따른 무선 라우터에 연결된 설정 장치의 요청에 따라 IoT 장치가 무선 라 우터에 연결되는 과정을 나타낸 흐름도이다. 동작 1201에서, 설정 장치는 IoT 장치를 찾기 위한 검색 요청 입력을 획득할 수 있다. 일 실시 예에서, 도 7a에 도시된 것과 같이 설정 장치는 설정 장치에 대응하는 계정 정보에 등록된 복수 개의 무선 라우터의 정보(예를 들어, 무선 라우터의 이름(예: 'AP A' 및 'AP B' )및 위치) 및 복수 개의 무선 라우터 각각에 연결된 IoT 장치의 리스트(701a, 701b)(예를 들어, AP A에 연결된 IoT 장치는 에어컨 및 텔레비전, AP B에 연결된 IoT 장치는 냉장고)를 표시할 수 있다. 설정 장치 는 검색 요청 입력을 획득하기 위한 오브젝트(702a, 702b)를 표시할 수 있고, 상기 오브젝트를 통해 검색 요청 입력을 획득할 수 있다. 일 실시 예에서 설정 장치가 AP A에 직접 연결된 경우, 설정 장치는 AP A와 관련된 IoT 장치의 리스트(701a) 및 오브젝트(702a)와 AP B와 관련된 IoT 장치의 리스트(701b) 및 오브젝트(702b)를 구분하여 표시할 수 있다. 예를 들어, AP A와 관련된 IoT 장치의 리스트(701a) 및 오 브젝트(702a)와 달리 AP B와 관련된 IoT 장치의 리스트(701b) 및 오브젝트(702b)를 불투명하게 표시할 수 있다. 일 실시 예에서, 설정 장치는 AP A 주변의 신규 IoT 장치를 검색하는 오브젝트(702a)를 통해 검색 요 청 입력을 획득한 후, 도 7b에 도시된 것과 같이 검색 요청 여부를 확인하는 질의 메시지를 포함하는 UI를 더 표시할 수 있다. 설정 장치는 상기 UI를 통해 검색 요청을 확인하는 입력을 획득할 수 있다. 동작 1202에서, 검색 요청 입력 획득에 응답하여, 설정 장치는 무선 라우터로 검색 요청을 전송할 수 있다. 실시 예에서, 설정 장치는 검색 요청을 전송한 후, 연결 수락 요청이 수신될 때까지 도 8에 도시된 것과 같이 검색 진행 상태를 나타내는 화면을 표시할 수 있다. 동작 1203에서, 검색 요청 수신에 응답하여, 무선 라우터는 IoT 장치를 스캔하기 위한 제1 SSID를 포 함하는 비콘 프레임을 브로드캐스트할 수 있다. 동작 1203은 도 2c의 동작 201e에 대응될 수 있다. 동작 1204에서, 무선 라우터와 IoT 장치는 제1 SSID를 이용하여 서로 무선으로 연결될 수 있다. 동작 1203에서 제1 SSID를 포함하는 비콘 프레임이 브로드캐스트 되었으므로, 동작 1204는 도 2c의 동작 201f 및 동 작 201g에 대응될 수 있다. 동작 1205에서, IoT 장치는 IoT 장치에 관한 제1 정보를 무선 라우터로 전송할 수 있다. 동작 1206에서, 무선 라우터는 제1 정보의 적어도 일부, 무선 라우터에 관한 제2 정보 및 IoT 장치 와 무선 라우터 간의 연결 수락을 위한 요청을 설정 장치로 전송할 수 있다. 동작 1207에서, 설정 장치는 제1 정보 중 적어도 일부, 제2 정보 중 적어도 일부 및 연결 수락 요청을 디 스플레이에 표시하고, 연결 수락 요청에 대한 입력을 획득할 수 있다. 일 실시 예에서, 도 9a에 도시된 것과 같이, 설정 장치는 냉장고에 관한 정보(예를 들어, IoT 장치의 종류(냉장고) 또는 시리얼 넘버(RF95K9980S7) 등), AP A에 관한 정보(예를 들어, 무선 라우터의 이름(AP A)), 연결의 수락 여부를 질의하는 메시지 및 연결 수락 요청에 대한 입력을 획득하는 오브젝트를 포함하는 UI를 표시할 수 있다. 일 실시 예에 따라, 동작 1204에서 무선 라우터에 새로운 IoT 장치가 연결되지 않는 경우, 무선 라우 터는 새로운 IoT 장치가 존재하지 않는다는 메시지를 설정 장치로 전송할 수 있다. 설정 장치 는 도 9b에 도시된 것과 같이 새로운 IoT 장치가 발견되지 않았다는 메시지 및 재검색 요청 입력을 획득하기 위한 UI를 표시할 수 있다. 동작 1208에서, 설정 장치는 연결 수락 요청에 대한 입력에 기반하여 IoT 장치와 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 IoT 장치로 전송할 수 있다. 이 때, 무선 라우터 는 설정 장치가 전송한 연결 정보를 IoT 장치로 전달할 수 있다. 동작 1209에서, 무선 라우터와 IoT 장치는 연결 정보에 포함된 제2 SSID를 이용하여 서로 무선으로 연결될 수 있다. 일 실시 예에서, IoT 장치(예: 냉장고) 및 무선 라우터(예: AP A)가 제2 SSID를 이용하여 무선으로 연결된 후, 설정 장치는 IoT 장치가 무선 라우터에 제2 SSID를 이용하여 연결되었다는 정보를 수신할 수 있다. 설정 장치는 도 10에 도시된 것과 같이 연결 완료 메시지 및 무선 라우터(예: AP A)에 연결된 IoT 장치의 리스트를 표시할 수 있다. 동작 1201 내지 동작 1204는 동작 601 내지 동작 604에 대응될 수 있고, 동작 1205 내지 동작 1209는 동작 1102 내지 동작 1106에 대응될 수 있다. 동작 601 내지 동작 604에 대한 설명에서 언급된 실시 예들은 동작1201 내지 동작 1204에도 적용되고, 동작 1102 내지 동작 1106에 대한 설명에서 언급된 실시 예들은 동작 1205 내지 동작 1209에도 적용되는 것으로 이해될 수 있다. 이하에서는 도 13 내지 도15를 참조하여 IoT 장치와 무선 라우터가 제2 SSID를 이용하여 무선으로 연 결되기 위한 무선 라우터, IoT 장치 및 클라우드 시스템 각각의 동작을 설명한다. 이하의 설명 에서 무선 라우터, IoT 장치, 클라우드 시스템 및 설정 장치는 도 1a 및 도 1b를 참조하여 설명된 구성 전부 또는 일부를 포함할 수 있다. 도 13은 일 실시 예에 따른 IoT 장치를 무선 라우터에 연결시키기 위한 무선 라우터의 동작을 나타내는 흐름도이다. 도 13을 참조하면, 동작 1301에서, 무선 라우터의 프로세서는 무선 통신 회로를 통해, 제1 SSID 를 이용하여 제1 외부 장치(예를 들어, IoT 장치)에 무선으로 연결할 수 있다. 일 실시 예에서, 무선 라우터의 프로세서는 제1 외부 장치에 무선으로 연결하기 전, 제2 외부 장치 (예를 들어, 클라우드 시스템 또는 설정 장치)로부터 무선 통신 회로 또는 통신 인터페이스 중 적어도 하나를 통해 제1 외부 장치를 검색하기 위한 요청을 수신하고, 검색 요청 수신에 응답하여, 제 1 SSID를 포함하는 비콘 프레임(beacon frame)을 브로드캐스트하도록 제어할 수 있다. 즉, 무선 라우터의 프로세서는 전술한 동작 603을 수행할 수 있다. 동작 1302에서, 무선 라우터의 프로세서는 무선 통신 회로를 이용하여 제1 외부 장치로부터 제1 외부 장치에 관한 제1 정보를 수신할 수 있다. 일 실시 예에서, 무선 라우터의 프로세서는 무선 통신 회로를 이용하여, 동작 1301에서 제1 외 부 장치에 연결하기 위해 제1 외부 장치로부터 제1 정보를 포함하는 프로브 요청 프레임 또는 결합 요청 프레임 중 적어도 하나를 수신할 수 있다. 무선 라우터의 프로세서가 제1 정보를 포함하는 프로브 요청 프레 임 또는 결합 요청 프레임 중 적어도 하나를 제1 외부 장치로부터 수신하는 경우, 동작 1302는 생략될 수 있다. 동작 1303에서, 무선 라우터의 프로세서는 상기 무선 통신 회로 또는 상기 통신 인터페이스 중 적어도 하나를 통해 제1 정보의 적어도 일부 및 무선 라우터에 관한 제2 정보를 제2 외부 장치로 전송할 수 있다. 일 실시 예에서, 제2 정보는 제2 SSID를 포함할 수 있다. 일 실시 예에서, 무선 라우터의 메모리는 무선 라우터와 외부 장치(예를 들어, IoT 장치 등) 간의 무선 연결 히스토리를 저장할 수 있다. 무선 라우터의 프로세서는 제1 정보 및 무선 연결 히스토리에 기반하여 제1 외부 장치가 무선 라우터에 연결된 이력이 없는 경우에만, 제1 정보의 적어도 일 부 및 제2 정보를 제2 외부 장치로 전송할 수 있다. 예를 들어, 무선 라우터의 메모리는 냉장고 A, 공기 청정기 B, 에어컨 C가 무선 라우터에 연결되었었다는 히스토리를 저장할 수 있다. 이 때, 냉장고 A가 무선 라우터에 무선 연결을 시도하는 경우, 무선 라우터의 프로세서는 제1 정보의 적어도 일부 및 제2 정보를 제2 외부 장치로 전송하지 않을 수 있다. 새로운 IoT 장치인 세탁기 D가 무선 라우터에 무 선 연결을 시도하는 경우, 세탁기 D의 제1 정보의 적어도 일부 및 제2 정보를 제2 외부 장치로 전송할 수 있다. 동작 1304에서, 무선 라우터의 프로세서는 무선 통신 회로 또는 통신 인터페이스 중 적어 도 하나를 통해 제2 외부 장치로부터의 제2 SSID를 포함하는 연결 정보를 제1 외부 장치로 전달하거나, 제2 외 부 장치로부터 연결 정보의 전송 요청을 수신하고 연결 정보를 제1 외부 장치로 전송할 수 있다. 일 실시 예에서, 무선 라우터가 통신 인터페이스를 통해 제2 외부 장치인 클라우드 시스템과 연 결되는 경우, 무선 라우터의 프로세서는 클라우드 시스템으로부터의 연결 정보를 제1 외부 장치 로 전달할 수 있다. 다른 실시 예에서, 무선 라우터의 프로세서는 제3 외부 장치(예: 설정 장치 )로부터의 연결 정보의 전송 요청을 수신하고, 전송 요청에 응답하여 무선 통신 회로를 이용하여 연 결 정보를 제1 외부 장치로 전송할 수 있다. 일 실시 예에서, 무선 라우터가 무선 통신 회로를 통해 제2 외부 장치인 설정 장치와 연결되는 경우, 무선 라우터의 프로세서는 설정 장치로부터의 연결 정보를 제1 외부 장치로 전달할 수 있 다. 다른 실시 예에서, 무선 라우터의 프로세서는 설정 장치로부터의 연결 정보의 전송 요청을수신하고, 전송 요청에 응답하여 무선 통신 회로를 이용하여 연결 정보를 제1 외부 장치로 전송할 수 있다. 일 실시 예에서, 무선 라우터의 프로세서가 전송 요청에 응답하여 연결 정보를 전송할 때, 무선 라우 터의 프로세서는 수신한 제2 정보 또는 무선 라우터의 메모리에 저장된 제2 SSID를 이용할 수 있다. 동작 1305에서, 무선 라우터의 프로세서는 제2 SSID를 포함하는 연결 정보를 이용하여 제1 외부 장치 에 무선으로 연결할 수 있다. 도 14는 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결하기 위한 동작을 나타내는 흐름도이다. 도 14를 참조하면, 동작 1401에서, IoT 장치의 프로세서는 무선 통신 회로를 통하고, 제1 SSID 를 이용하여 무선 라우터에 무선으로 연결할 수 있다. 일 실시 예에서, IoT 장치의 프로세서는 무선 통신 회로를 이용하여, 무선 라우터로부터 제1 SSID를 포함하는 비콘 프레임을 수신하고, 비콘 프레임 수신에 응답하여, IoT 장치에 관한 제1 정보를 포함하는 결합 요청 프레임을 무선 라우터로 전송할 수 있다. 즉, 무선 라우터의 프로세서는 전술한 동작 201e 및 동작 201f를 수행할 수 있다. 동작 1402에서, IoT 장치의 프로세서는 무선 통신 회로를 이용하여 무선 라우터로 전자 장 치에 관한 제1 정보를 전송할 수 있다. 일 실시 예에서, IoT 장치의 프로세서는 무선 통신 회로를 이용하여, 동작 1401에서 무선 라우 터에 연결하기 위해 무선 라우터로 제1 정보를 포함하는 프로브 요청 프레임 또는 결합 요청 프레임 중 적어도 하나를 전송할 수 있다. IoT 장치의 프로세서가 제1 정보를 포함하는 프로브 요청 프레임 또는 결합 요청 프레임 중 적어도 하나를 전송하는 경우, 동작 1402는 생략될 수 있다. 동작 1403에서, IoT 장치의 프로세서는 무선 통신 회로를 이용하여 제2 SSID를 포함하는 연결 정보를 수신할 수 있다. 동작 1404에서, IoT 장치의 프로세서는 무선 통신 회로를 통하고, 연결 정보를 이용하여 무선 라우터에 무선으로 연결할 수 있다. 도 15는 일 실시 예에 따른 IoT 장치를 무선 라우터에 연결시키기 위한 클라우드 시스템의 동작 을 나타내는 흐름도이다. 도 15를 참조하면, 동작 1501에서, 클라우드 시스템의 프로세서는 통신 인터페이스를 통해 무선 라우터로부터 제1 외부 장치(예를 들어, IoT 장치)에 관한 제1 정보의 적어도 일부 및 무선 라우터 에 관한 제2 정보를 수신할 수 있다. 일 실시 예에서, 클라우드 시스템의 프로세서는 제1 정보 및 제2 정보를 수신하기 전, 통신 인터페이 스를 통해, 제2 외부 장치로부터의 제1 외부 장치를 검색하기 위한 요청을 무선 라우터로 전달할 수 있다. 상기 요청에 따라 제1 외부 장치와 무선 라우터가 연결된 후, 클라우드 시스템의 프로세서 는 제1 정보 및 제2 정보를 수신할 수 있다. 동작 1502에서, 클라우드 시스템의 프로세서는 제2 정보에 기반하여 결정되는 제2 외부 장치(예를 들 어, 설정 장치)로 제1 정보, 제2 정보 및 연결 수락 요청을 전송할 수 있다. 일 실시 예에서, 제2 정보는 무선 라우터의 계정 정보를 포함하고, 클라우드 시스템의 프로세서(32 0)는 통신 인터페이스를 통해 계정 정보에 대응하는 하나 이상의 제2 외부 장치로 제1 정보, 제2 정보 및 연결 수락 요청을 전송할 수 있다. 일 실시 예에서, 클라우드 시스템의 프로세서는 통신 인터페이스를 통해, 제2 정보에 대응하는 하나 이상의 제2 외부 장치로 제2 외부 장치가 사용중인지 여부를 체크하기 위한 쿼리를 전송할 수 있다. 클라 우드 시스템의 프로세서는 통신 인터페이스를 통해, 쿼리에 대한 응답을 수신할 수 있다. 클라 우드 시스템의 프로세서는 쿼리에 대한 응답에 기반하여, 통신 인터페이스를 통해 하나 이상의 제2 외부 장치 중 사용중인 것으로 결정된 제2 외부 장치로 제1 정보 중 적어도 일부, 제2 정보 중 적어도 일부 및 제1 외부 장치와 무선 라우터 간의 무선 연결을 위한 연결 수락 요청을 전송할 수 있다. 동작 1503에서, 클라우드 시스템의 프로세서는 제2 외부 장치로부터의 제1 정보에 기반하고 제2 SSID 를 포함하는 연결 정보를 제1 외부 장치로 전달하거나 연결 정보의 전송 요청을 무선 라우터로 전달할 수 있다. 일 실시 예에서, 제2 외부 장치는 무선 라우터로 연결 정보 또는 연결 정보의 전송 요청을 전송할 수 있고, 클라우드 시스템은 제2 외부 장치와 무선 라우터를 잇는 매개체일 수 있다. 클라우드 시스템 은 제2 외부 장치가 전송한 연결 정보 또는 연결 정보의 전송 요청 중 적어도 하나를 통신 인터페이스 를 통해 무선 라우터로 전달할 수 있다. 다양한 실시 예에 따라, 무선 라우터 주변의 복수 개의 IoT 장치 중 기 설정된 조건을 만족하는 IoT 장치만이 제2 SSID를 이용하여 무선 라우터에 연결될 수 있다. 이하에서 도 16 내지 도 17e를 참조하 여 복수 개의 IoT 장치 중 기 설정된 조건을 만족하는 IoT 장치만이 제2 SSID를 이용하여 무선 라우 터에 연결되는 실시 예가 설명된다. 이하의 설명에서 무선 라우터, 클라우드 시스템 및 설정 장치는 도 1a에 도시된 무선 라우터 , 클라우드 시스템 및 설정 장치장치들의 구성 전부 또는 일부를 포함할 수 있다. 제1 IoT 장치 (200a) 및 제2 IoT 장치(200b)는 도 1a에 도시된 IoT 장치의 구성 전부 또는 일부를 포함할 수 있다. 도 16은 다양한 실시 예에 따른 복수 개의 IoT 장치 중 조건을 만족하는 IoT 장치가 무선 라우터 에 연결되는 과정을 나타낸 흐름도이다. 도 17a는 일 실시 예에 따른 설정 장치가 연결 설정을 진행 할지 여부를 질의하는 UI를 표시하는 화면을 나타낸다. 도 17b는 일 실시 예에 따른 설정 장치가 지시 메 시지를 표시하는 화면을 나타낸다. 도 17c는 일 실시 예에 따른 연결 설정이 진행 중임을 알리는 메시지가 표시 된 화면을 나타낸다. 도 17d는 일 실시 예에 따른 설정 장치가 계정 정보 입력을 획득하는 화면을 나타낸 다. 도 17e는 일 실시 예에 따른 설정 장치가 IoT 장치의 위치 설정 입력을 획득하는 화면을 나타낸 다. 도 16을 참조하면, 동작 1601에서, 설정 장치는 IoT 장치를 찾기 위한 검색 요청 입력을 획득할 수 있다. 동작 1602에서, 검색 요청 입력 획득에 응답하여, 설정 장치는 무선 라우터로 검색 요청을 전송할 수 있다. 이 때, 클라우드 시스템은 설정 장치가 전송한 검색 요청을 무선 라우터로 전달할 수 있 다. 일 실시 예에서, 설정 장치는 동작 1601의 검색 요청 입력을 수신하지 않고, IoT 장치 연결 어플리케 이션이 실행되거나 실행 된 후 기 설정된 시간이 경과하면 무선 라우터로 검색 요청을 전송할 수 있다. 다 른 실시 예에서, 설정 장치는 주기적으로 무선 라우터로 검색 요청을 전송할 수 있다. 동작 1603에서, 검색 요청 수신에 응답하여, 무선 라우터는 IoT 장치를 스캔하기 위한 제1 SSID를 포 함하는 비콘 프레임을 브로드캐스트할 수 있다. 제1 IoT 장치(200a) 및 제2 IoT 장치(200b)는 무선 라우터(10 0)가 브로드캐스트하는 비콘 프레임을 수신할 수 있다. 동작 1604에서, 무선 라우터와 제1 IoT 장치(200a)는 제1 SSID를 이용하여 서로 무선으로 연결될 수 있고, 무선 라우터와 제2 IoT 장치(200b)는 제1 SSID를 이용하여 서로 무선으로 연결될 수 있다. 일 실시 예에서, 제1 IoT 장치(200a) 및 제2 IoT 장치(200b)는 비콘 프레임을 수신하지 않더라도, 제1 IoT 장치 (200a) 및 제2 IoT 장치(200b)는 제1 SSID를 포함하는 프로브 요청 프레임을 무선 라우터로 전송함으로써 무선 라우터에 제1 SSID를 이용하여 연결할 수 있다. 동작 1605에서, 제1 IoT 장치(200a) 및 제2 IoT 장치(200b)는 각각의 IoT 장치(200a, 200b)에 관한 제1 정보를 무선 라우터로 전송할 수 있다. 동작 1606에서, 무선 라우터는 수신한 제1 정보의 적어도 일부 및 무선 라우터에 관한 제2 정보를 클 라우드 시스템으로 전송할 수 있다. 동작 1607에서, 클라우드 시스템은 기 설정된 조건을 만족하는 IoT 장치로 연결 대기 메시지를 전송 할 수 있다. 도 16의 실시 예에서, 기 설정된 조건을 만족하는 IoT 장치는 제2 IoT 장치(200b)일 수 있고, 클라우드 시스템은 제2 IoT 장치(200b)로만 연결대기 메시지를 전송할 수 있다.일 실시 예에서, 기 설정된 조건이 만족되는지 여부는 IoT 장치의 제1 정보(예를 들어, 시리얼 넘버, 맥 어드레스 또는 인증 정보 등)에 기반하여 판단될 수 있다. 일 실시 예에서, 기 설정된 조건은 IoT 장치가 무선 라우터에 처음으로 연결되는 것, IoT 장치 가 무선 라우터에 처음으로 연결된 후 지정된 기간 내에 연결되는 것 또는 IoT 장치가 리셋된 것일 수 있다 다양한 실시 예에서, 기 설정된 조건이 만족되는지 여부의 판단은 무선 라우터, 클라우드 시스템 또 는 설정 장치 중 적어도 하나에서 수행될 수 있다. 일 실시 예에서, 연결 대기 메시지는 제2 IoT 장치(200b)가 연결 정보를 받기 위해 수행되어야 하는 동작에 대 한 정보를 포함할 수 있다. 예를 들어, 제2 IoT 장치(200b)가 연결 정보를 받기 위해 수행되어야 하는 동작은 제2 IoT 장치(200b)가 꺼진 후 다시 켜지는 동작 또는 제2 IoT 장치(200b)가 제공할 수 있는 신호를 전송하는 동작 등일 수 있다. 다양한 실시 예에서, 제2 IoT 장치(200b)가 제공할 수 있는 신호는 음파, 광파 또는 전자파 등일 수 있다. 예를 들어, 제2 IoT 장치(200b)가 스피커 및 LED를 포함하는 에어컨인 경우, 에어컨은 스피커로 기 설정된 소리를 출 력하거나 LED를 이용하여 기 설정된 색의 빛을 출력할 수 있다. 일 실시 예에서, 클라우드 시스템은 제1 정보에 기반하여 제2 IoT 장치(200b)가 지원하는 인터페이스에 대 응하는 연결 대기 메시지를 전송할 수 있다. 예를 들어, 에어컨이 지원하는 인터페이스가 소리 인터페이스인 경 우, 클라우드 시스템은 기 설정된 소리를 출력하라는 연결 대기 메시지를 전송할 수 있다. 동작 1608에서, 클라우드 시스템은 제2 정보에 기반하여 제1 정보의 적어도 일부, 제2 정보의 적어도 일부 및 지시 메시지를 전송할 수 있다. 예를 들어, 제 2 정보는 무선 라우터가 등록된 계정 정보일 수 있다. 일 실시 예에서, 지시 메시지는 연결 대기 메시지에 포함된 제2 IoT 장치(200b)가 연결 정보를 받기 위해 수행 되어야 하는 동작에 대한 정보를 포함할 수 있다. 예를 들어, 제2 IoT 장치(200b)가 연결 정보를 받기 위해 수 행되어야 하는 동작이 제2 IoT 장치(200b)가 꺼진 후 다시 켜지는 동작인 경우, 지시 메시지는 'IoT 장치를 끈 후, 켜주세요' 일 수 있다. 다양한 실시 예에서, 제2 IoT 장치(200b)가 연결 정보를 받기 위해 수행되어야 하는 동작이 제2 IoT 장치(200 b)가 음파 또는 광파 등의 신호를 출력하는 것인 경우, 지시 메시지는 상기 신호를 수신하면, 연결 정보를 제2 IoT 장치(200b)로 전송하라는 메시지일 수 있다. 예를 들어, 에어컨이 연결 정보를 받기 위해 수행되어야 하는 동작이 특정 소리를 출력하는 동작인 경우, 설정 장치는 상기 특정 소리를 마이크를 통해 수신하고, 연결 정보를 에어컨으로 전송할 수 있다. 동작 1609에서, 설정 장치는 지시 메시지를 표시할 수 있다. 일 실시 예에서, 설정 장치는 제2 IoT 장치(200b)의 연결 설정을 진행할지 여부를 질의하는 UI를 더 표시할 수 있다. 예를 들어, 설정 장치는 도 17a에 도시된 것과 같이 에어컨이 발견되었다는 메시지 및 연결 설정을 진행할지 여부를 질의하는 UI를 표시할 수 있다. 일 실시 예에서, 설정 장치가 'OK'를 선택하는 사용자 입력을 획득하면, 설정 장치는 도 17b에 도시 된 것과 같이 '에어컨을 끈 후 켜주세요'라는 지시 메시지를 표시할 수 있다. 동작 1610에서, 연결 대기 메시지를 수신한 제2 IoT 장치(200b)는 연결 대기 메시지에 기반한 동작을 수행할 수 있다. 일 실시 예에서, 연결 대기 메시지에 기반한 동작은 사용자 입력을 획득하는 동작일 수 있다. 동작 1611에서, 연결 대기 메시지를 수신한 제2 IoT 장치(200b)는 연결 대기 메시지에 기반한 동작을 수행하였 다는 메시지를 클라우드 시스템으로 전송할 수 있다. 일 실시 예에서, 연결 대기 메시지에 기반한 동작은 사용자 입력을 획득하는 동작이고, 제2 IoT 장치(200b)가 사용자 입력을 획득한 경우, 제2 IoT 장치(200b)는 사 용자 입력 획득 메시지를 클라우드 시스템으로 전송할 수 있다. 동작 1612에서, 클라우드 시스템은 설정 장치로 연결 정보 요청을 전송할 수 있다. 일 실시 예에서, 설정 장치는 연결 정보 요청을 수신한 후, 도 17c와 같이 연결 설정이 진행 중임을 알리는 메시지를 표시 할 수 있다. 동작 1613에서, 설정 장치는 연결 수락 요청에 대한 입력에 기반하여 제2 IoT 장치(200b)와 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 제2 IoT 장치(200b)로 전송할 수 있다. 일 실시예에 따르면, 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보는 클라우드 시스템(30 0)과 무선 라우터을 통해 제2 IoT 장치(200b)으로 전송될 수 있다. 동작 1614에서, 무선 라우터와 제2 IoT 장치(200b)는 연결 정보에 포함된 제2 SSID를 이용하여 서로 무선 으로 연결될 수 있다. 다양한 실시 예에 따라, 도 17d와 같이 설정 장치는 제2 SSID를 이용하여 무선 라우터에 연결되는 제 2 IoT 장치(200b)에 대응하는 계정을 등록하기 위한 UI를 표시할 수 있다. 다양한 실시 예에 따라, 도 17e와 같이 설정 장치는 제2 SSID를 이용하여 무선 라우터에 연결되는 제 2 IoT 장치(200b)가 설치된 장소를 등록하기 위한 UI를 표시할 수 있다. 본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 하우징; 상기 하우징 내에 배치되고, 100미터 내의 커버리 지를 갖는 무선 통신 프로토콜을 지원하도록 설정된 무선 통신 회로; 상기 하우징 내에 배치된 통신 인터페이스; 상기 하우징 내에 배치되고, 상기 무선 통신 회로 및 상기 통신 인터페이스에 기능적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되고 상기 프로세서에 전기적으로 연결되거나 결합된 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 무선 통신 회로를 통하고 제1 SSID(service set identifie r)를 이용하여 제1 외부 장치에 무선으로 연결하고, 상기 무선 통신 회로를 이용하여 상기 제1 외부 장치로부터 상기 제1 외부 장치에 관한 제1 정보를 수신하고, 상기 무선 통신 회로 또는 통신 인터페이스 중 적어도 하나를 통해, 상기 제1 정보의 적어도 일부 및 상기 전자 장치에 관한 제2 정보를 제2 외부 장치로 전송하고, 상기 무 선 통신 회로 또는 상기 통신 인터페이스 중 적어도 하나를 통한 상기 제2 외부 장치로부터의 상기 제1 정보 및 상기 제2 정보에 기반한 상기 제1 외부 장치와 상기 전자 장치 간의 무선 연결을 위한 제2 SSID를 포함하는 연 결 정보를 상기 제1 외부 장치로 전달하거나, 또는, 상기 무선 통신 회로 또는 상기 통신 인터페이스 중 적어도 하나를 통해 상기 제2 외부 장치로부터 상기 연결 정보의 전송 요청을 수신하고, 상기 전송 요청에 응답하여, 상기 무선 통신 회로를 이용하여 상기 연결 정보를 상기 제1 외부 장치로 전송하고, 상기 무선 통신 회로를 통 하고, 상기 연결 정보를 이용하여 상기 제1 외부 장치에 무선으로 연결하도록 하는 인스트럭션들을 저장할 수 있다. 일 실시 예에서, 상기 인스트럭션들은, 실행시, 상기 프로세서가 상기 무선 통신 회로를 이용하여, 상기 제1 외 부 장치로부터 상기 제1 정보를 포함하는 프로브 요청 프레임(probe request frame) 또는 결합 요청 프레임 (association request frame) 중 적어도 하나를 수신하도록 할 수 있다. 일 실시 예에서, 상기 제1 정보는 상기 프로브 요청 프레임 또는 상기 연결 요청 프레임 중 적어도 하나의 VSIE(vendor specific information element) 영역 내에 포함될 수 있다. 일 실시 예에서, 상기 제2 정보는 상기 제2 SSID를 포함할 수 있다. 일 실시 예에서,상기 인스트럭션들은, 실행시, 상기 프로세서가, 상기 제1 SSID를 포함하는 비콘 프레임(beacon frame)을 주기적으로 브로드캐스트하도록 할 수 있다. 일 실시 예에서,상기 인스트럭션들은, 실행시, 상기 프로세서가, 상기 제2 외부 장치로부터 상기 무선 통신 회 로 또는 상기 통신 인터페이스 중 적어도 하나를 통해 상기 제1 외부 장치를 검색하기 위한 요청을 수신하고, 상기 검색 요청 수신에 응답하여, 상기 제1 SSID를 포함하는 비콘 프레임(beacon frame)을 브로드캐스트하도록 할 수 있다. 일 실시 예에서,상기 메모리는 상기 전자 장치와 외부 장치 간의 무선 연결 히스토리를 저장하고, 상기 인스트 럭션들은, 실행시, 상기 프로세서가, 상기 제1 정보 및 상기 무선 연결 히스토리에 기반하여 상기 제1 외부 장 치가 상기 전자 장치에 연결된 이력이 없는 경우, 상기 제1 정보의 적어도 일부 및 상기 제2 정보를 상기 제2 외부 장치로 전송하도록 할 수 있다. 일 실시 예에서, 상기 무선 통신 프로토콜은 블루투스(bluetooth) 방식, 지그비(zigbee) 통신 방식, 무선 하트 (wireless highway addressable remote transducer) 통신 방식, 근접장 통신 방식, 와이파이(wifi) 방식, 와이 파이 다이렉트(wifi direct) 방식, GSM, HSDPA, LTE, LTE-A, CDMA, CDMA2000 또는 와이브로(wibro) 통신 방식 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 상기 제1 정보는 상기 제1 외부 장치의 제조사 정보, 모델명, 기기명, 버전명, 제품군, 시리얼 넘버(serial number), 네트워크 접속을 위한 인증 정보, 맥 어드레스(mac address) 또는 IP(internet protocol) 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 상기 연결 정보는 상기 제2 SSID에 대응하는 비밀번호, 보안(security) 정보 또는 패스 포인트 (passpoint) 연결을 위한 크리덴셜(credential) 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 상기 제2 외부 장치는 설정 장치를 포함하고, 상기 전자 장치가 상기 무선 통신 회로를 이용하 여 상기 설정 장치에 무선으로 연결된 경우, 상기 인스트럭션들은, 실행시, 상기 프로세서가, 상기 무선 통신 회로를 이용하여 상기 제1 정보의 적어도 일부 및 상기 제2 정보를 상기 설정 장치로 전송하고, 상기 무선 통신 회로를 통한 상기 설정 장치로부터의 상기 연결 정보를 상기 제1 외부 장치로 전달하거나, 또는, 상기 무선 통 신 회로를 통해 상기 설정 장치로부터 상기 연결 정보의 전송 요청을 수신하고, 상기 전송 요청에 응답하여, 상 기 메모리에 저장된 상기 연결 정보를 상기 제1 외부 장치로 전송하도록 할 수 있다. 일 실시 예에서, 상기 메모리는 실행 시에 프로세서가 상기 무선 통신 회로를 이용하여 제1 SSID를 포함하는 신 호를 브로드캐스트하고, 상기 무선 통신 회로를 이용하여, 제1 외부 장치에 무선으로 연결하고, 상기 무선 통신 회로를 이용하여, 상기 제1 외부 장치로부터 상기 제1 외부 장치에 관한 제1 정보를 수신하고, 상기 제1 정보의 적어도 일부 및 상기 전자 장치에 관한 제 2 정보를 상기 통신 인터페이스를 통해 전송하고, 상기 통신 인터페 이스를 통해 상기 제1 외부 장치에의 무선 연결에 대한 인증 정보를 수신하고, 상기 인증 정보 수신에 응답하여, 상기 무선 통신 회로를 이용하여 제2 SSID를 포함하는 정보를 상기 제1 외부 장치로 전송하고, 상기 무선 통신 회로를 통하여, 상기 제1 외부 장치에 상기 제2 SSID를 이용하여 연결하도록 하는 인스트럭션들을 저 장 할 수 있다. 일 실시 예에서, 상기 인스트럭션들은 실행시에 상기 프로세서로 하여금, 상기 제1 정보의 적어도 일부를 전송 할지 여부를 상기 제1 정보에 기반하여 결정하도록 할 수 있다. 일 실시 예에서, 상기 인스트럭션들은 실행시에 상기 프로세서로 하여금, 상기 크리덴셜 정보에 기반하여 상기 제1 외부 장치의 연결 권한을 결정하도록 할 수 있다. 일 실시 예에서, 상기 무선 통신 회로를 이용하여 설정 장치가 상기 전자 장치에 연결된 경우, 상기 인스트럭션 들은 실행시에 상기 프로세서로 하여금, 상기 무선 통신회로를 이용하여 상기 제1 정보의 적어도 일부를 상기 휴대 단말로 전송하고, 상기 무선 통신회로를 이용하여 상기 휴대 단말로부터 상기 인증 정보를 수신하도록 할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 전자 장치는 하우징; 상기 하우징 내에 배치되고, 100미터 내의 커버리지를 갖는 무선 통신 프로토콜을 지원하도록 구성된 무선 통신 회로; 상기 하우징 내에 배치되고, 상기 무선 통신 회로에 기능적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되고 상기 프로세서에 전기적으로 연결되거나 결합된 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상기 무선 통신 회로를 통 하고, 제1 SSID를 이용하여 무선 라우터에 무선으로 연결하고, 상기 무선 통신 회로를 이용하여, 상기 무선 라 우터로 상기 전자 장치에 관한 제1 정보를 전송하고, 상기 무선 통신 회로를 이용하여, 상기 전자 장치와 상기 무선 라우터 간의 무선 연결을 위한 제2 SSID를 포함하는 연결 정보를 상기 무선 라우터로부터 수신하고, 상기 무선 통신 회로를 통하고, 상기 연결 정보를 이용하여 상기 무선 라우터에 무선으로 연결하도록 하는 인스트럭 션들을 저장할 수 있다. 일 실시 예에서, 상기 제1 정보는 상기 전자 장치의 제조사 정보, 모델명, 기기명, 버전명, 제품군, 시리얼 넘 버, 네트워크 접속을 위한 인증 정보, 맥 어드레스 또는 IP 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 상기 인스트럭션들은, 실행시, 상기 프로세서가 상기 무선 통신 회로를 이용하여, 상기 무선 라우터로 상기 제1 정보를 포함하는 프로브 요청 프레임 또는 결합 요청 프레임 중 적어도 하나를 전송하도록 할 수 있다. 일 실시 예에서, 상기 인스트럭션들은, 실행시, 상기 프로세서가 상기 무선 통신 회로를 이용하여, 상기 무선 라우터로부터 상기 제1 SSID를 포함하는 비콘 프레임을 수신하고, 상기 비콘 프레임 수신에 응답하여, 상기 제1 정보를 포함하는 결합 요청 프레임을 상기 무선 라우터로 전송하도록 할 수 있다. 일 실시 예에서, 상기 연결 정보는 상기 제2 SSID에 대응하는 비밀번호, 보안 정보 또는 패스 포인트 연결을 위 한 크리덴셜 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 상기 인스트럭션들은, 실행시, 상기 프로세서가 상기 제2 SSID에 대응하는 비밀번호, 보안 정 보 또는 패스 포인트 연결을 위한 크리덴셜 정보 중 적어도 하나를 더 이용하여 상기 무선 라우터에 연결하도록 할 수 있다. 일 실시 예에서, 상기 메모리는 실행 시에 프로세서가 상기 무선 통신 회로를 이용하여 무선 라우터로부터 제1 SSID를 포함하는 브로드캐스트된 신호를 수신하고, 상기 무선 통신 회로를 이용하여, 상기 무선 라우터에 무선 으로 연결하고, 상기 무선 통신 회로를 이용하여 상기 무선 라우터로 상기 전자 장치에 관한 제1 정보를 전송하 고, 상기 무선 통신 회로를 이용하여, 상기 무선 라우터와 관련된 제2 SSID를 포함하는 정보를 상기 무선 라우 터로부터 수신하고, 상기 무선 통신 회로를 통하여, 상기 제2 SSID를 이용하여 상기 무선 라우터에 연결하도록 하는 인스트럭션들을 저장 할 수 있다. 또한, 본 문서에 개시되는 일 실시 예에 따른 시스템은 하우징; 상기 하우징 내에 배치된 통신 인터페이스; 상 기 하우징 내에 배치되고, 상기 통신 인터페이스에 기능적으로 연결되는 프로세서; 및 상기 하우징 내에 배치되 고, 상기 프로세서에 전기적으로 연결되는 메모리를 포함하고, 상기 메모리는, 실행 시에, 상기 프로세서가, 상 기 통신 인터페이스를 통해 무선 라우터로부터 제1 외부 장치에 관한 제1 정보 및 상기 무선 라우터에 관한 제2 정보를 수신하고, 상기 통신 인터페이스를 통해, 상기 제2 정보에 기반하여 결정되는 하나 이상의 제2 외부 장 치로 상기 제1 정보 중 적어도 일부, 상기 제2 정보 중 적어도 일부 및 상기 제1 외부 장치와 상기 무선 라우터 간의 무선 연결을 위한 연결 수락 요청을 전송하고, 상기 통신 인터페이스를 통해, 상기 제2 외부 장치로부터의 상기 제1 정보에 기반하고 SSID를 포함하는 연결 정보를 상기 제1 외부 장치로 전달하거나 상기 연결 정보의 전 송 요청을 상기 무선 라우터로 전달하도록 하는 인스트럭션들을 저장할 수 있다. 일 실시 예에서, 상기 제2 정보는 상기 무선 라우터의 계정 정보를 포함하고, 상기 인스트럭션들은, 실행시, 상 기 프로세서가, 상기 계정 정보에 대응하는 상기 하나 이상의 제2 외부 장치로 상기 제1 정보 중 적어도 일부, 상기 제2 정보 중 적어도 일부 및 상기 연결 수락 요청을 전송할 수 있다. 일 실시 예에서, 상기 제2 정보는 상기 SSID를 포함할 수 있다. 일 실시 예에서, 상기 인스트럭션들은, 실행시, 상기 프로세서가, 상기 통신 인터페이스를 통해, 상기 제2 외부 장치로부터의 상기 제1 외부 장치를 검색하기 위한 요청을 상기 무선 라우터로 전달하도록 할 수 있다. 일 실시 예에서, 상기 인스트럭션들은, 실행시, 상기 프로세서가, 상기 통신 인터페이스를 통해, 상기 제2 정보 에 대응하는 하나 이상의 제2 외부 장치로 상기 제2 외부 장치가 사용중인지 여부를 체크하기 위한 쿼리를 전송 하고, 상기 통신 인터페이스를 통해, 상기 쿼리에 대한 응답을 수신하고, 상기 쿼리에 대한 응답에 기반하여, 상기 통신 인터페이스를 통해 상기 하나 이상의 제2 외부 장치 중 사용중인 것으로 결정된 제2 외부 장치로 상 기 제1 정보 중 적어도 일부, 상기 제2 정보 중 적어도 일부 및 상기 제1 외부 장치와 상기 무선 라우터 간의 무선 연결을 위한 연결 수락 요청을 전송하도록 할 수 있다. 일 실시 예에서, 상기 메모리는 실행 시에 프로세서가 통신 인터페이스를 통해, 무선 라우터로부터, 제1 전자 장치에 관한 제1 정보, 상기 무선 라우터에 관한 제2 정보, 및 계정 정보를 수신하고, 상기 통신 인터페이스를 통해, 상기 제2 정보 및 상기 계정 정보에 적어도 일부 기반하여, 상기 무선 라우터 및 상기 제1 전자 장치간의 연결의 인증 요청을 제2 전자 장치로 전송하고, 상기 통신 인터페이스를 통해 상기 제2 전자 장치로부터 인증을 수신하고, 상기 통신 인터페이스를 통해 상기 제1 전자 장치로의 무선 연결에 관한 인증 정보를 상기 무선 라우 터로 전송하도록 하는 인스트럭션들을 저장할 수 있다. 일 실시 예에서, 상기 인스트럭션들은 실행시에 상기 프로세서로 하여금, 상기 제2 정보에 기반하여 상기 인증 요청을 전송할 상기 제2 전자 장치를 결정하도록 할 수 있다. 도 18은 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치를 나타낸다. 도 18을 참조하면, 다양한 실시 예에서의 전자 장치(예: 무선 라우터, 제1 전자 장치(예: IoT 장치), 제2 전자 장치(예: 설정 장치) 또는 서버(예: 클라우드 시스템)가 네트워 크 또는 근거리 통신을 통하여 서로 연결될 수 있다. 전자 장치는 버스, 프로세서 , 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스를 포함할 수 있 다. 어떤 실시 예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다른 구성 요소를 추가 적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(1810-1870)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/ 또는 데이터)을 전달하는 회로를 포함할 수 있다.프로세서 (예: 도 1a의 프로세서, 프로세서, 프로세서, 프로세서, 도 1b의 프로세 서(130a), 프로세서(130b), 프로세서, 프로세서, 프로세서)는, 중앙처리장치(central processing unit, CPU), 어플리케이션 프로세서(application processor, AP), 또는 커뮤니케이션 프로세서 (communication processor, CP) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리 (예: 도 1a의 메모리, 메모리, 메모리, 메모리, 도 1b의 메모리(140a), 메 모리(140b), 메모리, 메모리, 메모리)는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저 장할 수 있다. 한 실시 예에 따르면, 메모리는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프 로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface, API), 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API의 적어도 일부는, 운영 시스템(Operating System (O S))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램 )에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어 플리케이션 프로그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또 는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치 의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위 를 부여할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터 페이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기 로 출력할 수 있다. 디스플레이(예: 도 1a의 디스플레이, 도 1b의 디스플레이)는, 예를 들면, LCD(liquid crystal display), LED(light-emitting diode) 디스플레이, OLED(organic LED) 디스플레이, 또는 MEMS(microelectromechanical systems) 디스플레이, 또는 전자 종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 컨텐츠(예: 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)을 표시할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스처, 근접, 또는 호버링(hovering) 입력을 수신할 수 있다. 통신 인터페이스(예: 도 1a의 통신 인터페이스, 통신 인터페이스, 통신 인터페이스, 도 1b의 통신 인터페이스(120a), 통신 인터페이스(120b), 통신 인터페이스, 통신 인터페이스)는, 예를 들면, 전자 장치와 외부 장치(예: 제1 전자 장치, 제2 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크 에 연결되어 외부 장치(예: 제2 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면 셀룰러 통신 프로토콜로서, 예를 들면 LTE(long-term evolution), LTE-A(LTE- advanced), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobiletelecommunications system), WiBro(wireless broadband), 또는 GSM(global system for mobile communications) 중 적어도 하나를 사용할 수 있다. 또한 무선 통신은, 예를 들면, 근거리 통신을 포함할 수 있다. 근거리 통신는, 예를 들면, Wi-Fi(wireless fidelity), Li-Fi(light fidelity), Bluetooth, NFC(near field communication), MST(magnetic stripe transmission), 또는 GNSS 중 적어도 하나를 포함할 수 있다. MST는 전자기 신호를 이용하여 전송 데이터에 따라 펄스를 생성하고, 상기 펄스는 자기장 신호를 발생시킬 수 있다. 전자 장치는 상기 자기장 신호를 POS(point of sales)에 전송하고, POS는 MST 리더(MST reader)를 이용하여 상기 자기장 신호는 검출하고, 검출된 자기장 신호를 전기 신호로 변환함으로써 상기 데이터를 복원할 수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(global positioning system), Glonass(global navigation satellite system), Beidou Navigation Satellite System(이하 \"Beidou\") 또는 Galileo(the European global satellite-based navigation system) 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard- 232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제1 전자 장치 및 제2 전자 장치 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있 다. 한 실시 예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시 예 에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 제 1 전자 장치, 제2 전자 장치, 또는 서버)에서 실행될 수 있다. 한 실시 예에 따르면, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기 능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 전자 장치(예: 제1 전자 장치, 제2 전자 장치, 또는 서버)에게 요청할 수 있다. 다른 전자 장치는 요청된 기능 또는 추가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수 신된 결과를 그대로 또는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 19는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다. 도 19를 참조하면, 전자 장치는, 예를 들면, 도 18에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 일 실시 예에 따르면, 도 1a의 무선 라우터, IoT 장치, 클라우드 시스템 및 설정 장치 는 전자 장치와 전체 또는 일부 동일한 구성을 가질 수 있다. 전자 장치는 하나 이상의 프로 세서(예: AP), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치 , 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로세서(예: 도 1a의 프로세서, 프로세서, 프로세서, 프로세서, 도 1b의 프로세서 (130a), 프로세서(130b), 프로세서, 프로세서, 프로세서)는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서는, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시 예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서 (image signal processor)를 더 포함할 수 있다. 프로세서는 도 19에 도시된 구성요소들 중 적어도 일부 (예: 셀룰러 모듈)를 포함할 수도 있다. 프로세서는 다른 구성요소들(예: 비휘발성 메모리) 중 적 어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘 발성 메모리에 저장(store)할 수 있다. 통신 모듈(예: 도 1a의 무선 통신 회로, 통신 인터페이스, 무선 통신 회로, 통신 인터페 이스, 무선 통신 회로, 도 1b의 무선 통신 회로(110a), 통신 인터페이스(120a), 무선 통신 회로 (110b), 통신 인터페이스(120b), 무선 통신 회로, 통신 인터페이스, 무선 통신 회로)은, 도 18의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모 듈, Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모 듈, 또는 Galileo 모듈), NFC 모듈, MST 모듈, 및 RF(radio frequency) 모듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)를 이용 하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시 예에 따르면, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시 예에 따 르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, 또는 MST 모듈 각각은, 예 를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시 예에 따르면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈, 또는 MST 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 IC(integrated chip) 또는 IC 패키지 내에 포 함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜 시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또 는 안테나 등을 포함할 수 있다. 다른 실시 예에 따르면, 셀룰러 모듈, Wi-Fi 모듈, 블루투스 모듈 , GNSS 모듈, NFC 모듈, MST 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신 호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID (integrated circuit card identifier)) 또는 가입자 정보(예: IMSI (international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 도 1a의 메모리, 메모리, 메모리, 메모리, 도 1b의 메모리(140a), 메모 리(140b), 메모리, 메모리, 메모리, 도 18의 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비-휘발성(non-volatile) 메모리 (예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), 마스크(mask) ROM, 플래시(flash) ROM, 플래시 메모리 (예: 낸드플래시(NAND flash) 또는 노아플래시(NOR flash) 등), 하드 드라이브, 또는 SSD(solid state drive) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(MultiMediaCard), 또는 메모리 스틱(memory stick) 등을 더 포 함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 전자 장치와 기능적으로 및/또는 물리적 으로 연결될 수 있다. 보안 모듈은 메모리보다 상대적으로 보안 레벨이 높은 저장 공간을 포함하는 모듈로써, 안전한 데 이터 저장 및 보호된 실행 환경을 보장해주는 회로일 수 있다. 보안 모듈은 별도의 회로로 구현될 수 있 으며, 별도의 프로세서를 포함할 수 있다. 보안 모듈은, 예를 들면, 탈착 가능한 스마트 칩, SD(secure digital) 카드 내에 존재하거나, 또는 전자 장치의 고정 칩 내에 내장된 내장형 보안 요소(embedded secure element(eSE))를 포함할 수 있다. 또한, 보안 모듈은 전자 장치의 운영 체제(OS)와 다른 운영 체제로 구동될 수 있다. 예를 들면, 보안 모듈은 JCOP(java card open platform) 운영 체제를 기반 으로 동작할 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(1940A), 자이로 센서 (1940B), 기압 센서(1940C), 마그네틱 센서(1940D), 가속도 센서(1940E), 그립 센서(1940F), 근접 센서 (1940G), 컬러 센서(1940H)(예: RGB 센서), 생체 센서(1940I), 온/습도 센서(1940J), 조도 센서(1940K), 또는 UV(ultra violet) 센서(1940M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 은, 예를 들면, 후각 센서(E-nose sensor), EMG(electromyography) 센서, EEG(electroencephalogram) 센서, ECG(electrocardiogram) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구 성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel), (디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정 전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 시트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(예: 도 1a의 디스플레이, 도 1b의 디스플레이 도 18의 디스플레이)는 패널 , 홀로그램 장치, 또는 프로젝터을 포함할 수 있다. 패널은, 도 18의 디스플레이 과 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게 (transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널은 터치 패널과 하나의 모듈 로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 프로 젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 디스플레이는 패널, 홀로그램 장치, 또 는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터페이스(optical interface), 또는 D- sub(D-subminiature)을 포함할 수 있다. 인터페이스는, 예를 들면, 도 18에 도시된 통신 인터페이 스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스는, 예를 들면, MHL(mobile high- definition link) 인터페이스, SD 카드/MMC 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이 스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈(198 0)의 적어도 일부 구성요소는, 예를 들면, 도 18에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또 는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 제논 램프(xenon lamp))를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리은, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 혹은 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있 고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들 면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로(MediaFLOTM)등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나 의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 20은 다양한 실시 예에 따른 프로그램 모듈의 블록도를 나타낸다. 한 실시 예에 따르면, 프로그램 모듈(예: 프로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(OS) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프 로그램)을 포함할 수 있다. 운영 체제는, 예를 들면, Android, iOS, Windows, Symbian, 또는 Tizen 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, API, 및/또는 어플리케이션을 포함할 수 있 다. 프로그램 모듈의 적어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 제1 전자 장치, 제2 전자 장치, 서버 등)로부터 다운로드 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 또는 디바이스 드라이버를 포함 할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시 예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등을 포함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투 스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, Wi-Fi 드라이버, 오디오 드라이버, 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API을 통해 다양한 기능 들을 어플리케이션으로 제공할 수 있다. 한 실시 예에 따르면, 미들웨어(예: 미들웨어)은 런 타임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파 워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 보안 매니저(security manager), 확장 스크린 매니저, 또는 결제 매니저 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입 출력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기 (life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미 디어 매니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어 플리케이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리 할 수 있다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리의 용량, 온도, 또는 전원을 관리하고, 이 중 해당 정보를 이용하여 전자 장치의 동작에 필요한 전력 정보를 결정 또는 제공할 수 있다. 데이터베이스 매니저은 어플리케이션 중 적어도 하나의 어플리케이션에서 사 용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저은 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, Wi-Fi 또는 Bluetooth 등의 무선 연결을 관리할 수 있다. 통지 매니저 는 도착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할수 있다. 위치 매니저은 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저은 사용자에게 제 공될 그래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또 는 사용자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 확장 스크린 매니저는, 예를 들면, 그래 픽이 표시될 디스플레이의 영역을 결정할 수 있다. 일 실시 예에 따르면, 확장 스크린 매니저는 그래픽이 표시되도록 결정된 디스플레이의 영역을 통하여 제공될 정보, 그래픽 효과, 또는 이와 관련된 사용자 인터페이 스를 관리할 수 있다. 일 실시 예에 따르면, 전자 장치(예: 전자 장치)가 전화 기능을 포함하는 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저(telephony manager)를 더 포함할 수 있다. 미들 웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들웨어 는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미들웨 어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)은, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제공될 수 있다. 예를 들면, Android 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이젠 (Tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일, 달력, 미디어 플레이어, 앨범, 시계, 결제, 건강 관리(health care)(예: 운동량 또는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등 을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 제1 전자 장치, 제2 전자 장치) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의상, \"정보 교 환 어플리케이션\")을 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전 달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리 (device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치의 적어도 하나의 기능(예: 외부 전자 장치 자체(또는 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비 스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치의 속성에 따라 지정된 어플리케이션(예: 모바일 의 료 기기의 건강 관리 어플리케이션)을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 외부 전자 장치(예: 제1 전자 장치, 제2 전자 장치), 및 서버) 로부터 수신된 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서 버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시 예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시 예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이 상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로 세스 등을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프 로그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서 가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리 이 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM, DVD(digital versatile disc), 자기-광 매체(magneto- optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장치(예: ROM, RAM, 또는 플래시 메모리 등) 등을 포함할 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시 예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시 예에 따른 모듈, 프로그램 모 듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으 로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 그리고 본 문서에 개시된 실시 예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 발명의 범위 를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 발명의 기술적 사상에 근거한 모든 변경 또는 다양한 다른 실시 예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2017-0029457", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 일 실시 예에 따른 IoT 장치가 연결되는 시스템을 나타낸다. 도 1b는 다른 실시 예에 따른 IoT 장치가 연결되는 시스템을 나타낸다. 도 2a는 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결되는 과정을 나타낸 흐름도이다. 도 2b는 일 실시 예에 따른 IoT 장치와 무선 라우터가 무선 연결을 수립하는 과정을 나타낸 흐름도이다. 도 2c는 다른 실시 예에 따른 IoT 장치와 무선 라우터가 무선 연결을 수립하는 과정을 나타낸 흐름도이다. 도 2d는 일 실시 예에 따른 설정 장치가 제2 정보를 요청하고 제2 정보를 수신하는 과정을 나타낸 흐름도이다. 도 2e는 일 실시 예에 따른 연결 정보의 전송 요청에 따라 무선 라우터가 연결 정보를 IoT 장치로 전송하는 과 정을 나타내는 흐름도이다. 도 3은 일 실시 예에 따른 인증 요청을 수신한 사용자 단말이 표시하는 화면을 나타낸다. 도 4는 일 실시 예에 따른 인증 정보를 전송한 사용자 단말이 표시하는 화면을 나타낸다. 도 5a는 일 실시 예에 따른 IoT 장치가 연결된 후 사용자 단말이 표시하는 화면을 나타낸다. 도 5b는 일 실시 예에 따른 사용자 단말이 무선 라우터에 연결된 IoT 장치 리스트를 표시하는 화면을 나타낸다. 도 6은 일 실시 예에 따른 사용자 단말의 요청에 따라 IoT 장치가 무선 라우터에 연결되는 과정을 나타낸 흐름 도이다. 도 7a는 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결된 후 사용자 단말이 IoT 장치 리스트를 표시하는 화 면을 나타낸다. 도 7b는 일 실시 예에 따른 신규 IoT 장치를 검색하는 요청 신호를 전송하기 위해 사용자 단말이 표시하는 화면 을 나타낸다. 도 8은 일 실시 예에 따른 검색 요청 신호를 전송한 후 사용자 단말이 표시하는 화면을 나타낸다. 도 9a는 일 실시 예에 따른 연결 수락 요청을 수신한 사용자 단말이 표시하는 화면을 나타낸다. 도 9b는 일 실시 예에 따른 IoT 장치가 발견되지 않았다는 메시지를 수신한 사용자 단말이 표시하는 화면을 나 타낸다. 도 10은 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결된 후 사용자 단말이 IoT 장치 리스트를 표시하는 화 면을 나타낸다. 도 11은 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결되는 과정을 나타낸 흐름도이다.도 12는 일 실시 예에 따른 무선 라우터에 연결된 사용자 단말의 요청에 따라 IoT 장치가 무선 라우터에 연결되 는 과정을 나타낸 흐름도이다. 도 13은 일 실시 예에 따른 IoT 장치를 무선 라우터에 연결시키기 위한 무선 라우터의 동작을 나타내는 흐름도 이다. 도 14는 일 실시 예에 따른 IoT 장치가 무선 라우터에 연결하기 위한 동작을 나타내는 흐름도이다. 도 15는 일 실시 예에 따른 IoT 장치를 무선 라우터에 연결시키기 위한 클라우드 시스템의 동작을 나타내는 흐 름도이다. 도 16은 다양한 실시 예에 따른 복수 개의 IoT 장치 중 조건을 만족하는 IoT 장치가 무선 라우터에 연결되는 과 정을 나타낸 흐름도이다. 도 17a는 일 실시 예에 따른 설정 장치가 연결 설정을 진행할지 여부를 질의하는 UI를 표시하는 화면을 나타낸 다. 도 17b는 일 실시 예에 따른설정 장치가 지시 메시지를 표시하는 화면을 나타낸다. 도 17c는 일 실시 예에 따른 연결 설정이 진행 중임을 알리는 메시지가 표시된 화면을 나타낸다. 도 17d는 일 실시 예에 따른 설정 장치가 계정 정보 입력을 획득하는 화면을 나타낸다. 도 17e는 일 실시 예에 따른 설정 장치가 IoT 장치의 위치 설정 입력을 획득하는 화면을 나타낸다. 도 18은 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치를 나타낸다. 도 19는 다양한 실시 예에 따른 전자 장치의 블록도를 나타낸다. 도 20은 다양한 실시 예에 따른 프로그램 모듈의 블록도를 나타낸다."}
