{"patent_id": "10-2019-0098011", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0019187", "출원번호": "10-2019-0098011", "발명의 명칭": "보증금 계약 기반의 투자 자금 모집 및 배당 시스템", "출원인": "염보석", "발명자": "염보석"}}
{"patent_id": "10-2019-0098011", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고객 서버(100), 캐피탈사 서버(200) 및 운용사 서버(300)를 포함하는 투자 자금 모집 및 배당 시스템으로서,고객 서버(100)는 고객의 신용을 담보로 하여 원리금균등상환방식으로 캐피탈사 서버(200)로 자금의 대출 계약을 신청하고,캐피탈사 서버(200)는 고객의 신용을 심사하여 대출 가능 여부, 이자율 및 원리금을 결정하여 고객 서버(100)로전달하고, 신청된 상기 자금을 고객의 계좌로 송금하며,고객 서버(100)는 운용사 서버(300)로 상기 자금의 일부를 보증금으로 하는 차량의 임대차 계약을 신청하고,운용사 서버(300)는 상기 자금 대비 상기 보증금의 비율을 기초로 상기 원리금 중 운용사가 부담할 비율과 고객이 부담할 비율을 산출하여 고객 서버(100)로 전달하고, 산출된 운용사가 부담할 비율에 따라 상기 원리금의 일부를 매달 캐피탈사의 계좌로 송금하며,고객 서버(100)는 운용사 서버(300)에 의해 산출된 상기 원리금에서 고객이 부담할 비율에 따라 상기 원리금의나머지 일부를 매달 캐피탈사의 계좌로 송금하는 것을 특징으로 하는 보증금 계약 기반의 투자 자금 모집 및 배당 시스템."}
{"patent_id": "10-2019-0098011", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 대출 계약의 기간이 상기 임대차 계약의 기간보다 긴 경우, 고객 서버(100)와 운용사 서버(300) 사이의 상기 임대차 계약이 종료되고 고객이 운용사로 차량을 반납하면, 운용사 서버(300)는 상기 보증금의 일정 비율에해당하는 금액을 고객의 계좌로 환급하고, 운용사 서버(300)는 고객 서버(100)로부터 고객의 대출을 승계하여상기 원리금 전액을 매달 캐피탈사의 계좌로 송금하는 것을 특징으로 하는 보증금 계약 기반의 투자 자금 모집및 배당 시스템."}
{"patent_id": "10-2019-0098011", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 대출 계약의 기간이 상기 임대차 계약의 기간보다 긴 경우, 고객 서버(100)와 운용사 서버(300) 사이의 상기 임대차 계약이 종료되고 고객이 운용사로부터 차량을 인수하면, 운용사 서버(300)는 상기 원리금의 일부를캐피탈사의 계좌로 송금하는 것을 중단하고, 고객 서버(100)는 상기 원리금 전액을 매달 캐피탈사의 계좌로 송금하는 것을 특징으로 하는 보증금 계약 기반의 투자 자금 모집 및 배당 시스템."}
{"patent_id": "10-2019-0098011", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,운용사 서버(300)는 상기 자금 대비 상기 보증금의 비율의 175%를 상기 원리금 중 운용사가 부담할 비율로 산출하고, 상기 자금 대비 상기 보증금의 비율의 75%를 상기 원리금 중 고객이 부담할 비율로 산출하는 것을 특징으로 하는 보증금 계약 기반의 투자 자금 모집 및 배당 시스템."}
{"patent_id": "10-2019-0098011", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,운용사 서버(300)는 인공지능기술을 기반으로 채무불이행 요인을 추출하고, 추출된 채무불이행 요인을 기반으로채무불이행의 가능성이 높은 고객과 대출 계약 및 임대차 계약을 사전에 차단하는 인공지능 분석모듈(310)을 포함하고,공개특허 10-2021-0019187-3-인공지능 분석모듈(310)은 캐피탈사 서버(200)로부터 대출거래 데이터를 수집하는 데이터 수집부(311), 수집된상기 대출거래 데이터 중 현재 상환이 진행 중이거나 연체 중이어서 상환성공과 채무불이행 여부를 알 수 없는데이터를 삭제하고 연체일이 150일을 초과한 대출은 채무불이행으로 분류하여 상기 대출거래 데이터를 전처리하는 데이터 전처리부(312), 상환 완료된 대출과 채무불이행 대출의 특징을 설명하는 변수를 독립변수로 선정하고상환완료와 채무불이행을 종속변수로 선정하는 변수 선정부(313), 신경망 기반의 머신 러닝을 통해 채무불이행을 예측하는데 영향력이 있는 독립 변수를 추출하는 변수 추출부(314) 및 추출된 독립 변수에 대한 값을 기초로고객의 채무불이행 가능성을 예측하는 채무불이행 예측부(315)를 포함하고,운용사 서버(300)는 인공지능 분석모듈(310)의 예측 결과에 따라 채무불이행 가능성이 높은 고객과는 상기 대출계약을 지양하도록 하는 경고 메시지를 캐피탈사 서버(200)로 전송하는 것을 특징으로 하는 보증금 계약 기반의투자 자금 모집 및 배당 시스템."}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 보증금 계약 기반의 투자 자금 모집 및 배당 시스템에 관한 것이다. 본 발명에 따른 보증금 계약 기반 의 투자 자금 모집 및 배당 시스템은 고객 서버, 캐피탈사 서버 및 운용사 서버를 포함하는 투자 자금 모집 및 배당 시스템으로서, 고객 서버는 고객의 신용을 담보로 하여 원리금균등상환방식으로 캐피탈 (뒷면에 계속)"}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보증금 계약 기반의 투자 자금 모집 및 배당 시스템에 관한 것으로서, 보다 상세하게는 고객의 신용 을 담보로 캐피탈사로부터 자금을 대출받고 대출받은 자금의 일부를 보증금으로 하여 차량을 고객에게 임대하는 경우 고객으로부터 받은 보증금을 운용하여 얻은 수익으로 고객이 대출받은 자금의 원리금을 지원하는 보증금 계약 기반의 투자 자금 모집 및 배당 시스템에 관한 것이다."}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신용대출이란 부동산 등의 담보를 사용하지 않고 개인 또는 기업의 신용만으로 금융회사에서 대출을 받는 것을 말한다. 금융기관에서는 대출을 신청하는 이에게 담보가 전혀 없거나 대출금액보다 담보가 부족한 경우의 대출 을 신용대출이라 부른다. 따라서, 대출 신청자의 신용에 따라 대출 가능 여부 및 이자율이 정해진다. 이때, 금 융기관에서는 고객의 신용상태를 점수로 산출하여 대출 여부와 대출금액을 결정하기 위해 신용평점제도를 활용 하기도 한다. 이에 따라, 신용등급이 낮으면 대출 자체가 불가능하며, 신용등급이 높을수록 낮은 금리를 적용받는다. 금융기 관이 신용등급을 평가할 때 가장 중요하게 고려하는 것이 연체 여부이며, 최근 금융기관들이 신용대출을 확대하 면서 신용평점 제도의 활용이 늘어나고 있다. 신용대출은 일반적으로 담보를 바탕으로 한 대출에 비해 그 금액 이 적고 기간이 짧다. 한편, 리스(lease)란 사법상의 임대차(賃貸借)를 말한다. 본래는 어떤 자산(토지, 선박 등)의 소유자가 일정 기간 사용료를 받기로 하고 타인에게 그 자산의 사용, 수익권을 주는 것을 의미하였으나, 오늘날 산업 용어로 서는 각종 동산을 포함해서 임대업을 영업으로 하는 개인 또는 회사가 사용료를 받고 일정기간 어떤 물건을 임대하는 것을 말한다. 이러한 임대업을 영업으로 하는 회사를 리스회사, 이러한 산업을 리스산업이라고 한다. 임대물은 카메라, 타이프라이터, TV, 컴퓨터에서 자전거, 자동차, 선박, 비행기에 이르기까지 종류가 많다. 사용자는 일시에 다액의 구입자금을 요하지 않고 언제나 필요할 때 최신의 기계나 설비를 이용할 수 있는 장점 이 있어서 점차 리스산업이 발전하고 있다. 리스계약에는 리스회사가 수리(修理), 유지(維持) 및 기타의 서비스 를 제공하는 운용리스와 금융기능에 중점을 두는 금융리스가 있다. 이에 대하여 임대기간이 비교적 짧고, 시간, 주 또는 월 단위로 임대하는 방식을 렌털(rental)제도라고 한다. 금융리스는 리스의 가장 기본적인 형태로 리스 이용자가 필요로 하는 기계, 설비, 동산 등을 리스제공자(리스회 사)가 구입하여 이용자에게 리스하여 주고 리스 기간 동안 이용자로부터 리스회사의 구입자금 원금과 금융비용 및 이윤을 전액회수하는 거래형태다. 리스회사의 투입자금이 리스 기간 중 전액 회수된다는 게 특징이다. 우리 나라에선 대부분의 리스가 기능상 금융리스에 속한다. 운용리스는 금융리스 이외의 리스(렌털 포함)를 총칭한다. 최근 이러한 신용대출과 금융리스를 통해 자금을 확보한 뒤, 적절한 투자처에 확보한 자금을 투자하는 투자 방 식에 대한 관심이 증대되고 있다. 그러나, 신용대출의 경우 대부분 원리금균등상환방식으로 매달 원리금을 상환 하는 방식으로 계약이 되는데 이자율도 높을 뿐만 아니라 이자에 원금까지 상환해야 하여 이에 따라 매달 갚아 야 하는 금액에 대한 부담이 클 수 밖에 없는 문제점이 있었다. 또한, 리스계약의 경우에는 최근 상환율을 높이기 위해 일시금으로 보증금을 요구하는 리스사들이 많아졌는데 리스계약에서 차량의 소유권은 리스사에게 있기 때문에 차량을 담보로 돈을 빌릴 수도 없는 상황에서 고객이 이 러한 적지 않은 보증금을 마련하기는 쉽지 않은 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허 제10-2007-0109378호 (특허문헌 0002) 한국 등록특허 제10-1722139호 (특허문헌 0003) 한국 공개특허 제10-2010-0049211호"}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위한 본 발명의 목적은 고객과 캐피탈사 사이의 대출 계약과 고객과 운용사 사이의 임대차(리스) 계약을 융합하여 고객의 부담을 최소화시키면서 투자금을 확보할 수 있는 보증금 계약 기반의 투 자 자금 모집 및 배당 시스템을 제공하는 것이다. 본 발명의 다른 목적은 고객과 캐피탈사 사이의 대출 계약에 따른 원리금을 지원하는 방식으로 투자 수익을 배 당함으로써 고객 입장에서 배당받지 못 할 위험성을 최소화하면서 원리금의 부담을 줄일 수 있는 보증금 계약 기반의 투자 자금 모집 및 배당 시스템을 제공하는 것이다."}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위하여, 본 발명에 따른 보증금 계약 기반의 투자 자금 모집 및 배당 시스템은 고객 서 버, 캐피탈사 서버 및 운용사 서버를 포함하는 투자 자금 모집 및 배당 시스템으로서, 고객 서 버는 고객의 신용을 담보로 하여 원리금균등상환방식으로 캐피탈사 서버로 자금의 대출 계약을 신청 하고, 캐피탈사 서버는 고객의 신용을 심사하여 대출 가능 여부, 이자율 및 원리금을 결정하여 고객 서버 로 전달하고, 신청된 상기 자금을 고객의 계좌로 송금하며, 고객 서버는 운용사 서버로 상기 자 금의 일부를 보증금으로 하는 차량의 임대차 계약을 신청하고, 운용사 서버는 상기 자금 대비 상기 보증금 의 비율을 기초로 상기 원리금 중 운용사가 부담할 비율과 고객이 부담할 비율을 산출하여 고객 서버로 전 달하고, 산출된 운용사가 부담할 비율에 따라 상기 원리금의 일부를 매달 캐피탈사의 계좌로 송금하며, 고객 서 버는 운용사 서버에 의해 산출된 상기 원리금에서 고객이 부담할 비율에 따라 상기 원리금의 나머지 일부를 매달 캐피탈사의 계좌로 송금한다. 바람직하게는, 상기 대출 계약의 기간이 상기 임대차 계약의 기간보다 긴 경우, 고객 서버와 운용사 서버 사이의 상기 임대차 계약이 종료되고 고객이 운용사로 차량을 반납하면, 운용사 서버는 상기 보증금 의 일정 비율에 해당하는 금액을 고객의 계좌로 환급하고, 운용사 서버는 고객 서버로부터 고객의 대 출을 승계하여 상기 원리금 전액을 매달 캐피탈사의 계좌로 송금한다. 바람직하게는, 상기 대출 계약의 기간이 상기 임대차 계약의 기간보다 긴 경우, 고객 서버와 운용사 서버 사이의 상기 임대차 계약이 종료되고 고객이 운용사로부터 차량을 인수하면, 운용사 서버는 상기 원 리금의 일부를 캐피탈사의 계좌로 송금하는 것을 중단하고, 고객 서버는 상기 원리금 전액을 매달 캐피탈 사의 계좌로 송금한다. 바람직하게는, 운용사 서버는 상기 자금 대비 상기 보증금의 비율의 175%를 상기 원리금 중 운용사가 부담 할 비율로 산출하고, 상기 자금 대비 상기 보증금의 비율의 75%를 상기 원리금 중 고객이 부담할 비율로 산출한 다. 바람직하게는, 운용사 서버는 인공지능기술을 기반으로 채무불이행 요인을 추출하고, 추출된 채무불이행 요인을 기반으로 채무불이행의 가능성이 높은 고객과 대출 계약 및 임대차 계약을 사전에 차단하는 인공지능 분 석모듈을 포함하고, 인공지능 분석모듈은 캐피탈사 서버로부터 대출거래 데이터를 수집하는 데 이터 수집부, 수집된 상기 대출거래 데이터 중 현재 상환이 진행 중이거나 연체 중이어서 상환성공과 채무불이행 여부를 알 수 없는 데이터를 삭제하고 연체일이 150일을 초과한 대출은 채무불이행으로 분류하여 상기 대출거래 데이터를 전처리하는 데이터 전처리부, 상환 완료된 대출과 채무불이행 대출의 특징을 설명하는 변수를 독립변수로 선정하고 상환완료와 채무불이행을 종속변수로 선정하는 변수 선정부, 신경망 기반의 머신 러닝을 통해 채무불이행을 예측하는데 영향력이 있는 독립 변수를 추출하는 변수 추출부 및 추출된 독립 변수에 대한 값을 기초로 고객의 채무불이행 가능성을 예측하는 채무불이행 예측부를 포함하고, 운용 사 서버는 인공지능 분석모듈의 예측 결과에 따라 채무불이행 가능성이 높은 고객과는 상기 대출 계 약을 지양하도록 하는 경고 메시지를 캐피탈사 서버로 전송한다."}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 고객과 캐피탈사 사이의 대출 계약과 고객과 운용사 사이의 임대차(리스) 계약을 융합하여 고객의 부 담을 최소화시키면서 투자금을 확보할 수 있는 보증금 계약 기반의 투자 자금 모집 및 배당 시스템을 제공할 수 있다. 본 발명은 고객과 캐피탈사 사이의 대출 계약에 따른 원리금을 지원하는 방식으로 투자 수익을 배당함으로써 고 객 입장에서 배당받지 못 할 위험성을 최소화하면서 원리금의 부담을 줄일 수 있는 보증금 계약 기반의 투자 자 금 모집 및 배당 시스템을 제공할 수 있다."}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부 호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부 호를 가지도록 하고 있음에 유의해야 한다. 그리고 본 발명의 실시예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실 시예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 실시예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소 의 본질이나 차례 또는 순서 등이 한정되지 않는다. 도 1 내지 도 3을 참조하여, 본 발명의 일 실시예에 따른 보증금 계약 기반의 투자 자금 모집 및 배당 시스템의 구성 및 동작에 대하여, 이하 설명한다. 도 1은 본 발명의 일 실시예에 따른 보증금 계약 기반의 투자 자금 모집 및 배당 시스템(이하, “본 투자 자금 모집 및 배당 시스템”이라 한다)의 구성을 나타낸 도면이다. 도 1을 참조하면, 본 투자 자금 모집 및 배당 시스템은 고객 서버, 캐피탈사 서버 및/또는 운용사 서 버를 포함한다. 고객 서버는 고객이 사용하는 스마트폰, 태블릿, PC 등에 해당할 수 있다. 고객 서버는 고객의 신용 을 담보로 하여 원리금균등상환방식으로 캐피탈사 서버로 자금의 대출 계약을 신청한다. 캐피탈사 서버는 고객의 신용을 심사하여 대출 가능 여부, 이자율 및/또는 원리금을 결정하여 고객 서버 로 전달하고, 대출 신청된 자금을 고객의 계좌로 송금한다. 이때, 캐피탈사 서버는 캐피탈사가 사용 하는 스마트폰, 태블릿, PC 등에 해당할 수 있다. 이후, 고객 서버는 대출 신청한 자금의 일부를 보증금으로 하는 차량의 임대차 계약을 운용사 서버로 신청한다. 이때, 운용사 서버는 운용사가 사용하는 스마트폰, 태블릿, PC 등에 해당할 수 있다. 그리고, 이때 임대차 계약은 리스 계약을 의미할 수 있다.운용사 서버는 고객이 대출 신청한 자금 대비 임대차 계약의 보증금의 비율을 먼저 계산한다. 그리고, 운 용사 서버는 계산된 자금 대비 보증금의 비율을 기초로 대출 계약에 따른 원리금 중 운용사가 부담할 비율 과 고객이 부담할 비율을 산출한다. 운용사 서버는 산출된 원리금 중 고객이 부담할 비율을 고객 서버 로 전달하고, 산출된 원리금 중 운용사가 부담할 비율에 따라 원리금의 일부를 매달 캐피탈사의 계좌로 송 금한다. 그리고, 고객 서버는 운용사 서버에 의해 산출된 원리금에서 고객이 부담할 비율을 수신하고 이 비율 에 따라 원리금의 나머지 일부(원리금 전액 중 운용사가 부담하는 금액을 제외한 부분)를 매달 캐피탈사의 계좌 로 송금한다. 예를 들어, 운용사 서버는 대출 신청 자금 대비 보증금의 비율의 175%를 원리금 중 운용사가 부담할 비율 로 산출하고, 대출 신청 자금 대비 보증금의 비율의 75%를 원리금 중 고객이 부담할 비율로 산출할 수 있다. 이 경우, 차량의 금액이자 대출 신청 자금이 5,000만원이고, 보증금이 2,000만원이라면, 대출 신청 자금 대비 보증 금의 비율은 40%이고, 40%의 175%인 70%가 전체 원리금 중 운용사가 부담할 비율로 산출되고 40%의 75%인 30%가 전체 원리금 중 고객이 부담할 비율로 산출될 수 있다. 따라서, 원리금이 100만원이라면, 이 경우 70만원은 운 용사가 지불하고 30만원은 고객이 지불하게 된다. 본 발명의 일 실시예에 따르면, 고객과 캐피탈사 사이의 대출 계약의 기간이 고객과 운용사 사이의 임대차 계약 의 기간보다 긴 경우, 고객 서버와 운용사 서버 사이의 임대차 계약이 종료되면, 고객은 임차한 차량 을 운용사로 반납하거나 운용사로부터 인수할 수 있다. 고객이 운용사로 차량을 반납하면, 운용사 서버는 고객이 운용사에게 지불했던 보증금의 일정 비율에 해당 하는 금액을 고객의 계좌로 환급하고, 운용사 서버는 고객 서버로부터 고객의 대출을 승계한다. 그리 고, 고객이 운용사로 차량을 반납한 날부터 대출 계약이 만료되는 날까지는 캐피탈사로 지불해야 하는 원리금 전액을 운용사 서버가 매달 캐피탈사의 계좌로 송금한다. 일 실시예에 따르면, 이때, 운용사 서버가 고객의 계좌로 환급할 금액은 고객이 운용사에게 지불했던 보증 금의 일정 비율에 해당하는 금액으로 정할 수 있는데, 상기 일정 비율은 대출 신청 자금 대비 보증금의 비율에 서 2를 곱한 값이 고객과 운용사 사이의 임대차 계약에서 원리금 중 운용사가 부담한 비율보다 큰 경우, 대출 신청 자금 대비 보증금의 비율에서 2를 곱한 값을 상기 일정 비율로 결정하고, 대출 신청 자금 대비 보증금의 비율에서 2를 곱한 값이 고객과 운용사 사이의 임대차 계약에서 원리금 중 운용사가 부담한 비율보다 작은 경우, 원리금 중 운용사가 부담할 비율을 상기 일정 비율로 결정할 수 있다. 또는, 상기 일정 비율을 결정할 때, 남은 대출 계약의 기간이 고려될 수 있다. 또는, 고객이 운용사로부터 차량을 인수하면, 운용사 서버는 원리금의 일부를 캐피탈사의 계좌로 송금하는 것을 중단한다. 그리고, 고객이 운용사로부터 차량을 인수한 날부터 대출 계약이 만료되는 날까지는 고객 서버 는 원리금 전액을 매달 캐피탈사의 계좌로 송금한다. 도 2는 본 발명의 일 실시예에 따른 운용사 서버의 구성을 나타낸 도면이고, 도 3은 본 발명의 일 실시예에 따 른 인공지능 분석모듈의 구성을 나타낸 도면이다. 도 2 내지 도 3을 참조하면, 운용사 서버는 인공지능 분석모듈을 포함하고, 인공지능 분석모듈 은 데이터 수집부, 데이터 전처리부, 변수 선정부, 변수 추출부 및/또는 채무불이행 예측 부를 포함한다. 다른 일 실시예에 따르면, 인공지능 분석모듈은 캐피탈사 서버에 포함될 수 있 다. 본 발명이 속하는 투자 금융 시장의 활성화를 위해서는 대출의 연체율과 채무불이행률을 줄이는 것이 무엇보다 중요하다. 이러한 목적을 달성하기 위해, 본 발명의 인공지능 분석 모듈은 인공지능기술을 기반으로 대출 거래 데이터로부터 채무불이행 요인을 추출하고, 추출된 채무불이행 요인을 기반으로 채무불이행의 가능성이 높 은 고객과의 대출 계약 및/또는 임대차 계약을 사전에 차단한다. 구체적으로, 데이터 수집부는 캐피탈사 서버로부터 대출거래 데이터를 수집한다. 이때, 데이터 수집 부에 의해 수집되는 대출거래 데이터는 연체정도와 대출상환만료 여부에 따라 상환 진행 중인 대출, 연체 일 15일 이하인 대출, 연체일 16일 내지 30일 이하인 대출, 연체일 31일 내지 120일 이하인 대출, 상환완료 대 출 및/또는 연체일이 150일 초과한 대출(채무불이행 대출)로 구분되는 대출에 대한 데이터를 포함한다. 인공지능 분석 모듈은 고객의 채무불이행을 예측하는 것이 목적이므로, 데이터 전처리부는 데이터 수 집부에 의해 수집된 대출거래 데이터 중 현재 상환이 진행 중이거나 연체 중이어서 상환성공과 채무불이행 여부를 알 수 없는 대출에 대한 데이터를 삭제한다. 그리고, 데이터 전처리부는 연체일이 150일을 초과한 대출은 채무불이행 대출로 분류한다. 변수 선정부는 상환 완료된 대출과 채무불이행 대출의 특징을 설명하는 변수들 중에서, 채무불이행 예측에 사용할 수 없는 속성을 갖는 변수들을 제외하여, 상환 완료된 대출과 채무불이행 대출의 특징을 설명하는 핵심 적인 변수를 독립변수로 선정한다. 그리고, 상환완료 사실과 채무불이행 사실을 종속변수로 선정한다. 이때, 선 정된 독립변수는 차입자정보 관련 변수로서, 주택소유형태, 차입자의 근무경력, 6개월 평균 잔고액 및/또는 총 부채상환비율을 포함하고, 대출정보 관련 변수로서, 대출신청금액을 로그화한 대출금액, 대출목적 및/또는 대출 이자율을 포함한다. 이때, 대출목적은 생계필수비용(주거비, 생활비, 의료비), 사업용, 부채상환용 등으로 구분 된다. 나아가, 독립변수는 신용정보 관련 변수로서, 차입자의 신용파산기록, 신용조회건수, 신용한도대비 신용 사용금액, 연체계좌수, 모기지론 계좌수 및/또는 차입자의 발급받은 신용카드 계좌수를 포함한다. 이때, 신용파 산기록은 차입자의 파산, 면책, 워크아웃, 회생 등의 기록유무를 의미하고, 신용조회건수는 투자자들이 대출자 에 대해 신용을 조회하는 횟수를 말한다. 변수 추출부는 신경망(인공 신경망) 기반의 머신 러닝을 통해 채무불이행을 예측하는데 영향력이 있는 독 립 변수를 추출한다. 이때, 신경망(neural networks)은 인간의 뇌가 수많은 신경들로부터 입력과 출력의 신호를 전달하는 과정을 착안하여 모델화한 방법이다. 변수 추출부는 다층 전방향 신경망 구조로 구성된 복수의 신경망을 포함한다. 이때, 다층 전방향 신경망 구조는 입력층, 은닉층 및 출력층의 삼층구조를 이루며 각 층마 다 다수의 노드(처리단위)가 구성된다. 이때, 입력층에 구성된 입력노드의 수는 변수 선정부에 의해 선정 된 독립변수의 개수로 설정된다. 그리고, 출력층에 구성된 출력노드의 수는 변수 선정부에 의해 선정된 종 속변수의 개수로 설정된다. 나아가, 변수 추출부는 다층 전방향 신경망의 구조에서 은닉층의 수를 1과 2로 설정(3층과 4층 신경망)하였고, 은닉노드의 수는 3개, 7개(n/2), 10개, 13개(n), 20개, 26개(2n), 39(3n)개로 설정하였다. 다음으로 학습률(learning rate)은 학습초기에 학습률을 '1'로 설정하여 빠른 학습을 유도하고, 그 다음에는 가중치의 조정이 반복(iteration)됨에 따라서 천천히 학습률을 감소시킨다. 예를 들어, 상술한 바와 같이, 변수 선정부에서 선정한 13개의 독립변수와 2개의 종속변수를 다층 전방향 신경망 구조를 통해 머신 러닝한 결과, 신용카드계좌수가 채무불이행을 예측하는데 가장 영향력있는 변수로서 추출되었고, 그 다음으로, 대출목적, 근무경력, 대출금액, 총신용사용금액/신용한도 순으로 그 중요도가 분류되 었다. 채무불이행 예측부는 변수 추출부에 의해 채무불이행을 예측하는데 영향력있는 변수로서 추출된 독립 변수에 대한 데이터(값)을 기초로 고객의 채무불이행 가능성을 예측한다. 채무불이행 예측부는 추출된 독 립변수들 중 중요도가 높은 상위 몇 개의 독립변수들 대한 질의를 생성하여 고객 서버로 전송할 수 있고 고객 서버로부터 전송한 질의에 대한 답변을 수신할 수 있다. 그리고, 채무불이행 예측부은 고객 서 버로부터 수신한 답변들 중 중요도가 높은 독립변수에 대한 질의에 해당하는 답변에 더 큰 가중치를 두어 해당 고객의 채무불이행 가능성을 예측한다. 운용사 서버는 인공지능 분석모듈의 예측 결과에 따라 채무불이행 가능성이 높은 고객과는 대출 계약 을 지양하도록 하는 경고 메시지를 캐피탈사 서버로 전송한다. 본 발명의 다른 일 실시예에 따르면, 변수 선정부는 상환 완료된 대출과 채무불이행 대출의 특징을 설명하 는 핵심적인 변수로서, 차용인의 주관적 정보 또는 행동특성요인과 집단행동이론(herding behavior theory) 관 련 변수인 심리적 행동데이터, 사회관계망 데이터, 대출신청자가 사용한 로그(log) 및 키워드 분석, 그리고 대 출신청자가 명시한 자금사용목적 및 상환계획 등의 주관적이고 비정형적인 데이터를 독립변수로서 선정할 수 있 다. 이로써, 대출신청자의 객관적 신용정보 이외에 주관적 정보까지 반영하여 채무불이행 가능성을 보다 정밀하 게 예측할 수 있다. 본 명세서에서 고객 서버, 캐피탈사 서버, 운용사 서버, 인공지능 분석모듈, 데이터 수집부, 데이터 전처리부, 변수 선정부, 변수 추출부 및/또는 채무불이행 예측부는 메모리에 저장된 연속된 수행과정들을 실행하는 프로세 서들일 수 있다. 또는, 프로세서에 의해 구동되고 제어되는 소프트웨어 모듈들로서 동작할 수 있다. 나아가, 프 로세서는 하드웨어 장치일 수 있다. 본 발명의 보호범위가 이상에서 명시적으로 설명한 실시예의 기재와 표현에 제한되는 것은 아니다. 또한, 본 발"}
{"patent_id": "10-2019-0098011", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 자명한 변경이나 치환으로 말미암아 본 발명이 보호범위가 제한될 수도 없음을 다시한 번 첨언한다."}
{"patent_id": "10-2019-0098011", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 보증금 계약 기반의 투자 자금 모집 및 배당 시스템의 구성을 나타낸 도면 이다. 도 2는 본 발명의 일 실시예에 따른 운용사 서버의 구성을 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 분석모듈의 구성을 나타낸 도면이다."}
