{"patent_id": "10-2023-0014010", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0121413", "출원번호": "10-2023-0014010", "발명의 명칭": "단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치", "출원인": "주식회사 피엠에스", "발명자": "배영만"}}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "피사체의 초분광 영상의 일부를 스캔하여 반사시키는 미소반사기;상기 미소반사기로부터 전달된 상기 영상의 일부를 영상데이터로 변환시키는 단일픽셀 카메라; 및 상기 단일픽셀 카메라로부터 전송된 영상데이터를 압축하여 센싱하는 압축센싱 처리부를 포함하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 미소반사기는 제1 제어부에 의해 제어되며, 상기 제1 제어부는 상기 단일픽셀 카메라에접속된 제2 제어부에 의해 상기 단일픽셀 카메라에서의 측정에 필요한 시간 및 측정여부를 판단하여 다음 포인트로 이동하는 트리거 신호를 전송받는 것을 특징으로 하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 압축센싱 처리부는 인공지능 엔진과 연계되어, 상기 영상데이터의 손실을 줄이는 것을 특징으로 하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 압축센싱 처리부 및 상기 인공지능 엔진은 가속모듈과 연계되는 것을 특징으로 하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 인공지능 엔진은 학습된 데이터 세트를 만드는 데이터 세트부에 연계되는 것을 특징으로하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 미소반사기는 2차원 영상 및 상기 2차원 영상의 무작위 포인트를 상기 단일픽셀 카메라로전송하는 것을 특징으로 하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 초분광은 상기 피사체의 영상을 파장에 따라 획득되는 것을 특징으로 하는 단일픽셀 기반초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서, 상기 압축센싱 처리부는 데이터 사전처리부와 연계되며, 상기 데이터 사전처리부는 상기 제2제어부와 연계되어 상기 영상데이터를 압축센싱을 위한 형태로 변환시키는 것을 특징으로 하는 단일픽셀 기반초분광 영상을 이용한 미세입자 검출장치."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "미세플라스틱과 같은 미세입자 또는 크랙과 같은 결함을 실시간으로 감시하고, 가격이 저렴한 단일픽셀 카메라를 기반으로 하는 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치를 제시한다. 그 장치는 피사체의 초분광 영상의 일부를 스캔하여 반사시키는 미소반사기와, 미소반사기로부터 전달된 영상의 일부를 영상데이터로 변환 시키는 단일픽셀 카메라 및 단일픽셀 카메라로부터 전송된 영상데이터를 압축하여 센싱하는 압축센싱 처리부를 포함한다."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 미세입자 검출장치에 관한 것으로, 보다 상세하게는 단일픽셀을 기반으로 하는 초분광 영상에 의해 획득한 미세입자를 효과적으로 검출하고 감시하는 장치에 관한 것이다."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "미세입자는 미세먼지, 미세플라스틱 등과 같이 다양한 형태가 존재한다. 예컨대, 미세플라스틱(micro plastic s)은 의도적으로 제조되었거나 기존 제품이 조각나서 미세화된 크기 5mm 이하의 합성 고분자화합물이다. 미세플 라스틱은 이동과 축적으로 분포범위와 발생경로가 광범위한 오염물질이다. 미세플라스틱은 생물들의 섭취를 통 한 물리적 영향, 소재 특성으로 인한 화학적 영향, 생체독성, 먹이사슬을 통한 생물농축으로 환경, 생체 등 다 양한 형태의 피해가 우려되고 있다. 세계적으로 미세플라스틱에 대한 규제를 시행하고 있으며, 국내에는 코팅제 품, 방향 및 탈취 제품 등으로 규제가 확대되고 있다. 한편, 하수처리장 방류수 및 도로의 비점오염원은 미세플 라스틱의 주요 배출경로이지만, 공공처리시설 외에는 별다른 대응책이 없어, 지속해서 미세플라스틱이 수계 또 는 토양으로 유입되고 있다. 하수처리장에 대한 미세플라스틱 감시가 필요하지만, 시스템이 갖춰져 있지 않으며, 현재 측정방법은 전처리 과 정을 거쳐야 하므로 실시간 모니터링이 불가능하다. 구체적으로, 미세플라스틱 측정 및 분석의 문제점(국가환경 산업정보시스템, 2020년, 문철환) 등에서 지적되었듯이, 현미경, FT-IR, Raman 분광법 등의 종래의 방법은 여러 단계의 전처리 과정이 필요하여 측정 및 분석 완료까지 상당한 시간이 소요된다. 더불어, 종래의 방법은 장치의 가격이 상대적으로 매우 비싸기 때문에, 가격이 저렴하면서 미세플라스틱을 실시간으로 감시하는 방안이 요구되 고 있다. 미세플라스틱을 감시하는 방법은 비파괴에 의한 이물질 검출, 식품품질, 회로기판 불량, 전자제품의 결함 등에도 확대되어 적용될 수 있다."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 미세플라스틱과 같은 미세입자 또는 크랙과 같은 결함을 실시간으로 감시하 고, 가격이 저렴한 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치를 제공하는 데 있다."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 과제를 해결하기 위한 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치에 의하면, 피사체의 초분광 영상의 일부를 스캔하여 반사시키는 미소반사기와, 상기 미소반사기로부터 전달된 상기 영상의 일부를 영상데이터로 변환시키는 단일픽셀 카메라 및 상기 단일픽셀 카메라로부터 전송된 영상데이터를 압축하여 센싱 하는 압축센싱 처리부를 포함한다. 본 발명의 장치에 있어서, 상기 미소반사기는 제1 제어부에 의해 제어되며, 상기 제1 제어부는 상기 단일픽셀 카메라에 접속된 제2 제어부에 의해 상기 단일픽셀 카메라에서의 측정에 필요한 시간 및 측정여부를 판단하여 다음 포인트로 이동하는 트리거 신호를 전송받는다. 상기 압축센싱 처리부는 인공지능 엔진과 연계되어, 상기 영상데이터의 손실을 줄일 수 있다. 상기 압축센싱 처리부 및 상기 인공지능 엔진은 가속모듈과 연계될 수 있다. 상기 인공지능 엔진은 학습된 데이터 세트를 만드는 데이터 세트부에 연계될 수 있다. 본 발명의 바람직한 장치에 있어서, 상기 미소반사기는 2차원 영상 및 상기 2차원 영상의 무작위 포인트를 상기 단일픽셀 카메라로 전송한다. 상기 초분광은 상기 피사체의 영상을 파장에 따라 획득될 수 있다. 상기 압축센싱 처리부는 데이터 사전처리부와 연계되며, 상기 데이터 사전처리부는 상기 제2 제어부와 연계되어 상기 영상데이 터를 압축센싱을 위한 형태로 변환시킨다."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 단일픽셀 기반 초분광 영상을 이용한 미세입자 검출장치에 의하면, 단일픽셀 카메라 기반 초분광 기 법을 적용함으로써, 미세입자 및 결함을 실시간으로 감시하고, 가격이 저렴하다. 또한, 초분광 기법에 의하여 미세입자 및 결함의 형태, 소재 등을 용이하게 구별할 수 있다."}
{"patent_id": "10-2023-0014010", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하면서 본 발명의 바람직한 실시 예를 상세히 설명한다. 다음에서 설명되는 실시예는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 아래에서 상술되는 실시예에 한정되는 것은 아니다. 본 발명의 실시예는 당 분야에서 통상의 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위하여 제공되는 것이다. 도면에서는 설명의 편의를 위하여 과장되게 표현하였다. 한편, 상부, 하부, 정면 등과 같이 위치를 지적하는 용어들은 도면에 나타낸 것과 관련될 뿐이다. 실제로, 검출장치는 임의의 선택적인 방향으로 사용될 수 있으며, 실제 사용할 때 공간적인 방향은 검출장치의 방향 및 회전에 따라 변한다. 본 발명의 실시예는 단일픽셀 카메라 기반 초분광 기법을 적용함으로써, 미세입자 및 결함을 실시간으로 감시하 고, 가격이 저렴한 미세입자 검출장치를 제시한다. 이를 위해, 단일픽셀 카메라 기반 초분광 기법에 대하여 자 세하게 알아보고, 상기 초분광 기법을 활용하여 미세입자 및 결함을 감시하는 과정을 상세하게 설명하기로 한다. 본 발명의 실시예에 의한 미세입자의 검출은 결함의 검출에도 확장되어 적용될 수 있다. 구체적으로, 미 세입자 및 결함의 감시는 미세플라스틱, 비파괴에 의한 이물질 검출, 식품품질, 회로기판 불량, 전자제품의 결 함 등이 있으며, 여기서는 미세플라스틱을 사례로 들어 설명하기로 한다. 즉, 본 발명의 실시예에서의 미세입자 는 미세먼지, 미세플라스틱, 이물질 등이 있고, 결함은 식품품질 및 회로기판의 불량, 전자제품의 결함 등이 있 다. 도 1은 본 발명의 실시예에 의한 검출장치를 설명하기 위한 도면이다. 다만, 엄밀한 의미의 도면을 표현한 것이 아니며, 설명의 편의를 위하여 도면에 나타나지 않은 구성요소가 있을 수 있다. 도 1에 의하면, 검출장치는 광원 및 단일픽셀 카메라 모듈을 포함한다. 광원은 근적외선을 방 출하며, 광원으로부터 조사된 초분광은, 피사체(OB)에 반사되어 초점을 조절하기 위한 렌즈계를 거쳐 단일픽셀 카메라 모듈에 입사된다. 렌즈계는 공지된 방식이 모두 채택될 수 있으며, 상세한 설명은 생 략하기로 한다. 도면에서는 광원을 피사체(OB)에 조사하여 반사되는 초분광을 활용하는 반사 방식을 제시하 였으나, 피사체(OB)를 투영하거나 피사체(OB)의 자체발광을 활용하는 방식도 적용될 수도 있다. 피사체(OB)는 미세입자 및 결함을 포함하는 물체이며, 예컨대 미세플라스틱이 포함된 생활하수가 있다. 상기 초분광은 다중분광이라고도 하며, 적외선 영역에서 근적외선(NIR) 또는 단파적외선(SWIR) 영역까지 확장되 어, 다양한 파장대역에서 피사체(OB)에 대한 스펙트럼 특성을 분석할 수 있다. 이를 통하여, 미세입자의 조성, 결함의 형태뿐 아니라 상대적으로 넓은 영역에서의 파장대역에 대하여 세밀한 분할측정을 할 수 있다. 적외선 파장대역은 분자지문 대역이라고도 불리며, 대부분의 분자진동이 적외선과 강하게 상호작용하여 높은 적외선 흡 수특성을 보인다. 기존 카메라는 피사체(OB)의 단순한 영상을 얻는 것에 반해, 초분광 영상은 피사체(OB)의 영 상을 파장에 따라 획득함으로써, 피사체(OB)의 다양한 정보를 구별하여 얻을 수 있다. 단일픽셀 카메라 모듈은 케이스에 내장된 미소반사기, 단일픽셀 카메라 및 에지컴퓨팅 모듈 을 포함한다. 렌즈계는 케이스의 외면에 설치된다. 미소반사기는 디지털 미소반사기(DMD; Digital Mirror Device)가 바람직하며, 상기 DMD는 피사체(OB)의 영상을 반사하는 프로젝터로써, 2차원 영상을 단일픽셀 카메라에 전송한다. 또한, 상기 DMD는 에지컴퓨팅 모듈에서의 압축센싱(Compressed Sensing; CS) 과정에서, 프로젝션된 2차원 영상의 무작위 포인트(point)를 단일픽셀 카메라로 반사하여 전송한다. 즉, 미소반사기는 상기 2차원 영상 및 상기 2차원 영상의 무작위 포인트까지 단일픽셀 카메라에 전송한 다. 단일픽셀 카메라에서, 픽셀(pixel)은 영상을 구성하는 최소단위로써, 화소라고 한다. 단일픽셀 카메라 는 단일픽셀 처리기법에 의하여 영상을 검출하는 수단으로써, 단일픽셀 처리기법은 이웃 픽셀과는 독립적으로 입력영상의 각 픽셀 값을 변환한 후에 출력영상의 동일한 위치에 출력하는 연산이다. 종래의 센서는 2차원으로 배열된 광센서를 활용하며, 적외선의 파장이 길어질수록 가격이 급격하게 증가한다. 종래의 센서는 높은 해상도 의 영상을 얻기 위하여 픽셀의 수를 늘리는 과정에서, 실제 현장에 적용하기 어려울 정도로 가격이 비싸다. 이 에 반해, 본 발명의 단일픽셀 카메라는 에지컴퓨팅 모듈에서의 압축센싱(CS) 과정과 조합되어, 상대적 으로 저렴한 가격으로 영상을 얻을 수 있다.미소반사기는 제1 제어부에 의해 제어되어, 미소반사기의 동작, 상기 2차원 영상 및 상기 2차원 영 상의 무작위 포인트까지 단일픽셀 카메라 및 에지컴퓨팅 모듈에 전송한다. 미세입자 및 결함에 관한 영 상은 미소반사기 및 단일픽셀 카메라와 연계된 에지컴퓨팅 모듈에서 획득된다. 단일픽셀 카메라 에 접속된 제2 제어부는 단일픽셀 카메라에서의 측정에 필요한 시간 및 측정여부를 판단하여, 다음 포인트로 이동하는 트리거 신호를 제1 제어부에 전송한다. 또한, 제2 제어부는 하나의 프레임을 구성하 는 영상데이터가 수집되면, 좌표 및 상기 영상데이터를 에지컴퓨팅 모듈에 전송한다. 도 2는 도 1의 에지컴퓨팅 모듈을 설명하기 위한 블록도이다. 이때, 검출장치는 도 1을 참조하기로 한 다. 도 2에 의하면, 에지컴퓨팅 모듈은 가속모듈, 인공지능 엔진 및 압축센싱 처리부를 포함한다. 인공지능 엔진 및 압축센싱 처리부는 가속모듈과 연계되고, 또한 인공지능 엔진은 디스플레이 에 연계된다. 가속모듈은 인공지능 처리를 하기 위한 하드웨어 가속장비 및 내부 유닛이다. 가속모듈 에는 예컨대, NVIDIA사의 병렬처리 API, 하드웨어인 CUDA, Google사의 가속 ASIC인 TPU, 인공신경망 모사 칩셋(Neuromorphic) 등이 있다. 인공지능 엔진 및 압축센싱 처리부는 가속모듈을 이용하여 연산한 다. 데이터 사전처리부는 제2 제어부 및 압축센싱 처리부와 연계되어, 압축센싱(CS)으로 영상획득 을 하기 이전에 영상데이터의 형태를 변환한다. 데이터 세트부는 인공지능 엔진을 동작시키기 위하여 학습된 데이터 세트를 만든다. 데이터 사전처리부에서 처리된 영상데이터는 압축센싱 처리부에서 압축센싱(CS)된 영상이 만들어지고, 압축센싱(CS)된 영상은 인공지능 엔진에서 인공지능을 활용하여 초분광 영상으로 복원되며, 복원된 초분광 영상은 디스플레이에서 출력된다. 이때, 에지컴퓨팅 모듈의 동작은 제3 제어부에서 제어된다. 압축센싱 처리부는 압축센싱(CS) 알고리즘은 나이퀴스트 레이트 이상으로 샘플링하지 않아도 완전하게 영상 을 재생할 수 있다. 통상적으로 다루는 데이터는 특정한 신호 공간으로 변환했을 때, 대부분의 값이 0인 희박한 (sparse) 영상이며, 상기 희박한 영상은 아주 적은 수의 선형측정만으로도 원래의 영상을 거의 완벽하게 복원할 수 있다. 여기서, 선형측정이란 영상데이터를 선형측정 행렬을 곱하여 측정벡터를 얻는다. 이에 따라, 대략 피 사체(OB) 5~35%만 스캔하면 전체 피사체(OB) 영상의 90% 이상을 얻을 수 있다. 이때, 대략 피사체(OB) 5~35% 스 캔은 에지컴퓨팅 모듈에 접속된 제1 제어부의 신호를 받은 미소반사기를 이용하여 이루어진다. 종래에는 하나의 프레임을 추출하는데 모든 영역을 스캔하므로, 많은 시간이 소요되어, 움직이지 않는 피사체 (OB)를 촬영할 수 있었다, 그런데, 본 발명의 실시예와 같이, 압축센싱(CS)을 활용하면 피사체(OB)의 대략 5~32%만을 스캔하여도 전체 이미지를 복원할 수 있다. 이렇게 되면, 하나의 프레임을 촬영하고 영상을 복원하는 시간을 대폭 절약할 수 있어서, 본 발명의 압축센싱(CS)은 연기, 유체, 컨베이어벨트의 물체 등과 같이 움직이 는 피사체(OB)를 실시간으로 측정될 수 있도록 한다. 또한, 기존 방식과 동일한 시간이 주어지면, 더 넓은 영역 을 스캔하여 높은 해상도의 영상을 얻을 수 있다. 그런데, 압축센싱(CS)을 통하여 측정한 포인트들을 복원하는 과정에서 측정속도를 높이려고 하면, 측정 포인트 의 점유율(%)을 감소시키면서 영상데이터의 손실이 발생할 수 있다. 이를 방지하기 위하여, 인공지능 처리를 통 해서 상기 손실을 최소화하고, 더불어 인공지능의 영상 처리기술을 활용하여, 기존에 학습된 데이터를 기반으로 손실된 부분을 유추하여 최종 이미지의 품질을 높일 수 있다. 다시 말해, 압축센싱(CS)으로 영상을 복원하는 시 간을 대폭 줄여 실시간으로 측정이 가능하게 하고, 인공지능 처리로 상대적으로 높은 품질의 영상을 얻을 수 있 다. 이를 위해, 미소반사기 및 단일픽셀 카메라는 압축센싱(CS)을 위한 영상데이터를 제공하는 역할을 한다. 도 3은 본 발명의 실시예에 의한 검출장치를 활용하여 미세플라스틱을 분석하는 사례 중의 하나를 설명하 기 위한 도면들이다. 이때, 검출장치는 도 1을 참조하기로 한다. 도 3에 의하면, 검출장치는 (a)와 같은 영상을 파장정보와 함께 광원 및 렌즈계를 통하여 획득한 다. 도시된 영상의 사례는 폴리비닐클로라이드(PVC), 아크릴(Acrylic), 폴리에틸렌테레프탈레이트(PET), 폴리스 티렌(PS)라는 고분자 화합물 미세플라스틱이다. 상기 고분자 화합물 각각은 (b)의 그래프와 같이 1,000nm~2,500nm 파장대역에서 고유의 분광패턴을 가진다. 투명에 가까운 미세플라스틱들이 물과 같은 유체와 혼합되어 있어도, 상기 고유의 분광패턴에 의해 서로 구별된다. 광원 및 렌즈계를 통하여 획득한 영상 은 앞에서 설명한 미소반사기, 단일픽셀 카메라 및 에지컴퓨팅 모듈을 거쳐, (c)와 같이 각각의 고 분자 화합물에 대한 영상을 획득한다. 본 발명의 초분광 영상은 기존 카메라에 의한 영상과는 달리, 피사체(OB)의 영상을 파장에 따라 획득함으로써, 피사체(OB)의 재질을 구별하여 얻을 수 있다. 도 4은 본 발명의 실시예에 의한 검출장치를 활용하여 오염물질을 분석하는 사례 중의 다른 하나를 설명하 기 위한 도면들이다. 이때, 검출장치는 도 1을 참조하기로 한다. 도 4에 의하면, 검출장치는 오염물질을 형태별로 구별할 수 있다. 이때, 상기 오염물질을 형태별로 구별하 는 과정은 미세플라스틱을 구별하는 데에도 적용할 수 있다. 여기서는 설명의 편의를 위하여 오염물질을 형태별 로 구별하는 과정을 제시한 것이다. 구체적으로, 검출장치를 활용하여, 피사체(OB)의 A영역에서는 병마개, 음료용기, 포장백, 클립, 지우개, 행거, 신선 잎, 낙엽, 마른 가지, 돌 등으로 구별되고, B영역에서는 병마개, 음료용기, 포장백, 클립, 지우개, 행거 등을 확인할 수 있다. 본 발명의 초분광 영상은 기존 카메라에 의한 영 상과는 달리, 피사체(OB)의 영상을 파장에 따라 획득함으로써, 피사체(OB)의 형태를 구별하여 얻을 수 있다. 본 발명의 실시예에 의한 검출장치는 초분광을 적용하여, 피사체(OB)인 미세입자 및 결함의 영상을 파장에 따라 획득함으로써, 피사체(OB)의 다양한 정보를 구별하여 얻을 수 있다. 즉, 본 발명의 실시예에 의한 초분광 영상을 활용하면, 피사체(OB)의 재질, 형태를 구별하여 획득할 수 있다. 또한, 본 발명의 검출장치는 가격 이 상대적으로 저렴한 단일픽셀 카메라를 활용하며, 압축센싱(CS)을 적용하여 피사체(OB)인 미세입자 및 결 함을 실시간으로 감시할 수 있다. 이상, 본 발명은 바람직한 실시예를 들어 상세하게 설명하였으나, 본 발명은 상기 실시예에 한정되지 않으며, 본 발명의 기술적 사상의 범위 내에서 당 분야에서 통상의 지식을 가진 자에 의하여 여러 가지 변형이 가능하다."}
{"patent_id": "10-2023-0014010", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 검출장치를 설명하기 위한 도면이다. 도 2는 도 1의 에지컴퓨팅 모듈을 설명하기 위한 블록도이다. 도 3은 본 발명에 의한 검출장치를 활용하여 미세플라스틱을 분석하는 사례 중의 하나를 설명하기 위한 도면들이다. 도 4은 본 발명에 의한 검출장치를 활용하여 오염물질을 분석하는 사례 중의 다른 하나를 설명하기 위한 도면들 이다."}
