{"patent_id": "10-2022-0017204", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0120515", "출원번호": "10-2022-0017204", "발명의 명칭": "인공지능을 이용한 헤어핀 모터의 용접불량 진단장치", "출원인": "이승준", "발명자": "이승준"}}
{"patent_id": "10-2022-0017204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "코어에 삽입된 복수 개의 헤어핀의 용접 결함을 검사하는 인공지능(AI)을 이용한 헤어핀 모터의 용접불량 진단장치에 있어서,내부가 암실로 이루어진 용접불량 진단장치의 본체(300);헤어핀 모터의 불량 검사의 진행과정 및 결과를 표시하고 진단장치를 제어 및 관리하기 위한 사용자 인터페이스(330);와 상기 본체 외측에 설치되어 사용자 인터페이스를 볼 수 있는 모니터(320); 상기 본체 내에 헤어핀 모터를 회전 구동하는 회전구동부(310); 헤어핀 용접부위의 상면부를 촬영하는 상면카메라(410), 헤어핀 용접부위의 좌, 우 상측면부를 촬영하는 좌, 우측면카메라(420, 430)로 이루어진 카메라부(400); 상기 카메라 촬영을 위한 조명부(500); 상기 카메라 촬영에 의해 획득된 영상이미지 데이터로부터 헤어핀의 용접결함을 판정하는 인공지능(AI)을 활용한 용접불량 진단기(100)로 이루어진 것을 특징으로 하는 인공지능(AI)을 이용한 헤어핀 모터의 용접불량 진단장치."}
{"patent_id": "10-2022-0017204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 인공지능(AI)을 활용한 용접불량 진단기(100)는 용접부검출기(110)와 결함분류기(120)로 이루어지고, 결함분류기(120)는 용접부검출기(110)로부터 정면이미지가 입력되는 정면이미지 결함분류기(121)와 좌, 우측면이미지가 입력되는 측면이미지 결함분류기(122)로 이루어진 것을 특징으로 하는 인공지능(AI)을 이용한 헤어핀 모터의 용접불량 진단장치."}
{"patent_id": "10-2022-0017204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 인공지능(AI)을 활용한 용접불량 진단기(100)는 헤어핀 용접부위를 촬영하는 카메라부로부터 획득되는 이미지 데이터셋(data set)에 대해 의도하지 않은 저품질의 입력 이미지에 대한 추론의 정확성을 높이기 위해 다양한 데이터 증강기법을 통해 증강된 학습 데이터셋(data set)으로 학습한 것을 특징으로 하는 인공지능(AI)을이용한 헤어핀 모터의 용접불량 진단장치."}
{"patent_id": "10-2022-0017204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "에 있어서,상기 정면이미지 결함분류기(121)와 측면이미지 결함분류기(122)는 각각 용접부검출기(110)로부터 전달받은 이미지의 결함 여부와 결함의 유형을 추론하는 것을 특징으로 하는 인공지능(AI)을 이용한 헤어핀 모터의 용접불량 진단장치."}
{"patent_id": "10-2022-0017204", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 인공지능(AI)을 활용한 용접불량 진단기(100)는 상기 결함분류기(120)를 통해 얻은 세 이미지(정면, 좌측면, 우측면이미지)의 추론결과가 취합되어 한 개의 용접부위에 대하여 정상 및 불량을 판정하고, 또한 불량 유형을 분류하는 것을 특징으로 하는 인공지능(AI)을 이용한 헤어핀 모터의 용접불량 진단장치."}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 대용량, 고효율인 헤어핀 모터의 용접부 결함을 탐지하는 진단장치로 용접부위의 정면, 측면을 촬영한 입력이미지를 양질의 이미지데이터로 학습한 용접불량 진단기에서 추론하여 용접 결함의 유무를 판단할 수 있고, 또한 불량을 유형화한 데이터를 구축할 수 있어, 용접 공정의 개선 등 필요한 조치를 취할 수 있으므로, 헤어핀 용접 불량률을 전반적으로 감소시킬 수 있으며, 결함 탐지가 육안검사 등 종전에 비해 신속하고 정확하여 생산성이 높은 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치에 관한 것이다."}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전기자동차 등에 고출력으로 사용되는 헤어핀 모터의 용접 결함을 인공지능을 이용하여 용접부위를 촬영한 영상정보로부터 찾아내는 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치에 관한 것이다. (특허문헌 1) KR 102322361 B1 (특허문헌 1) KR 1020190131663 A"}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "헤어핀 (권선) 모터는 모터의 출력 및 효율을 높이기 위해 고정자에 코일을 권선하는 방식이 아닌 고정자에 두 꺼운 평각동선(rectangular copper wire)을 삽입하여 끝단을 용접 결합하는 방식으로, 기존 구리권선 모터에 비 해 전류밀도가 낮아 자연냉각이 가능하고, 점적률(coil space factor)이 높아 모터의 사이즈를 감소시킬 수 있 으며, 동손(copper loss)이 작아 모터 효율이 높은 장점 때문에 전기 자동차 등의 고성능 모터로 사용되나, 용 접 과정이 추가됨에 따라 용접 시 불량이 발생할 여지가 많고, 이러한 용접 불량은 헤어핀 모터의 성능 저하 및 불량으로 이어져 왔다. 현재는 이러한 용접결함을 찾기 위해 작업자가 육안으로 직접 검사하는 방식으로 작업시간이 많이 소요되는 문 제가 있다. 또한 이러한 문제점을 개선하기 위해 특허 제2,322,361호(헤어핀 권선모터 검사시스템)에 개시된 바와 같 이 헤어핀 용접 결함을 찾기 위해 헤어핀 용접 부위를 상측에 설치된 카메라로 촬영한 영상정보로 용접부의 길 이를 계산하고, 이를 설정된 기준값과 비교하여 기준값 수치를 벗어나면 용접불량이라 판단하는 진단장치를 보 여주고 있으나, 용접 결함의 다양한 형태를 감안할 때 용접부의 길이로만 결함 유무를 판단하는 경우, 다른 용 접결함을 찾지 못해 모터의 수명과 품질에 악영향을 줄 수 있었다. 따라서 헤어핀 모터의 양산 품질 안정화 및 생산성 향상을 위해 자동화된 AI(Artificial Intelligence) 솔 루션을 도입하여 헤어핀 용접불량을 정확하고 빠르게 찾아낼 수 있는 진단장치의 개발이 요구되고 있다."}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 전기자동차 등에 고출력으로 사용되는 헤어핀 모터의 용접부위를 촬영한 영상데이터 정보와 이를 처리한 학습데이터로 학습시킨 모델을 통해 용접 부위의 결함을 신속하고 정확하게 탐지할 수 있도록 인공 지능을 이용한 헤어핀 모터의 용접불량 진단장치에 관한 것이다."}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위하여 본 발명의 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치는 내부가 암실 로 이루어진 용접불량 진단장치의 본체, 헤어핀 모터의 불량 검사의 진행과정 및 결과를 표시하고 진단장 치를 제어 및 관리하기 위한 사용자 인터페이스, 상기 본체 외측에 설치되어 사용자 인터페이스를 볼 수 있는 모니터, 상기 본체 내에 헤어핀 모터를 회전 구동하는 회전구동부, 헤어핀 용접부위의 상면부를 촬영하는 상면카메라, 헤어핀 용접부위의 좌, 우 상측면부를 촬영하는 좌, 우측면카메라(420, 430)로 이루 어진 카메라부, 상기 카메라 촬영을 위한 조명부 및 상기 카메라 촬영에 의해 획득된 영상이미지 데 이터로부터 헤어핀의 용접결함을 판정하는 인공지능(AI)을 활용한 용접불량 진단기로 이루어진 것을 특징 으로 한다. 상기 본 발명의 인공지능(AI)을 활용한 용접불량 진단기는 용접부검출기와 결함분류기로 이루어지고, 결함분류기는 정면이미지가 전송되는 정면이미지 결함분류기와 좌, 우측면이미지가 전송 되는 측면이미지 결함분류기로 구성된 것을 특징으로 한다. 또한 본 발명의 인공지능(AI)을 활용한 용접불량 진단기는 헤어핀 용접부위를 촬영하는 카메라부의 설정으로부터 획득되는 정면 및 측면 이미지데이터셋의 양질의 데이터뿐만 아니라 용접부의 높이 차에 따른 카 메라의 초점변화 및 용접부의 고르지 않은 면과 재질의 특성으로 인한 난반사 등에 의해 의도하지 않은 저품질 의 입력 이미지에 대한 추론의 정확성을 높이기 위해 상기 양질의 데이터셋(data set)에 대해 이진화, 노이즈 추가 등의 데이터 증강기법을 통해 증강된 학습 데이터셋(data set)으로 학습한 것을 특징으로 한다."}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치는 헤어핀의 용접 불량을 신속 하고, 정확하게 찾아냄으로써, 불량모터의 출하를 방지하여 사고 및 반품을 줄이고, 또한 결함 탐지의 효율성으 로 생산성이 향상되는 등 사업성이 확보될 수 있다. 또한 본 발명의 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치는 인공지능(AI)을 활용한 용접불량 진단기에서 불량의 각 유형별로 분류된 데이터를 통해 레이저 용접 공정을 개선할 수 있으므로, 헤어핀 용 접 불량률을 감소시켜 헤어핀 모터의 원자재 및 부자재 투입비용 감소로 제작원가를 절감할 수 있다."}
{"patent_id": "10-2022-0017204", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 바람직한 실시 예를 첨부된 도면에 의하여 상세히 설명하면 다음과 같다. 아울러, 본 발명에서 사용되는 용어는 가능한 한 현재 널리 사용되는 일반적인 용어를 선택하였으나, 특정 한 경우는 출원인이 임의로 선정한 용어도 있으며 이 경우는 해당되는 발명의 설명부분에서 상세히 그 의미를 기재하였으므로, 단순한 용어의 명칭이 아닌 용어가 가지는 의미로서 본 발명을 파악하여야 함을 밝혀두고자 한다. 또한 실시 예를 설명함에 있어서 본 발명 이 속하는 기술 분야에 익히 알려져 있고, 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생 략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. 도 1a는 코어에 삽입된 복수 개의 헤어핀을 보여주는 헤어핀 모터의 사진이고, 도 1b는 도 1a의 “부분 확 대도로 용접 부위인 두 헤어핀의 상면(B)들을 보여주고 있으며, 도 1b에는 헤어핀의 용접부위가 원형으로 2열임 을 보여주고 있으나, 1열 또는 3열 이상일 수도 있다. 도 2는 레이저 용접기로 용접된 헤어핀의 영상으로, 정상인 경우와 불량인 경우를 예시적으로 보여주고 있 다. 도 3에는 조명 및 카메라의 설정에 따라 다르게 표현되는 피사체를 예시로 보여주고 있는데, 도 3의 Setting 1, 2는 조명의 밝기 및 카메라 설정의 차이로, 각각 용접부의 내측(용접면)과 외측(테두리)의 정보를 더 잘 표현한다. 이는 카메라 및 조명 설정의 차이에 따른 피사체에 미치는 영향을 나타낸다. 예시로 든 Setting 1, 2외에도 다양한 조명 및 카메라의 설정에서 촬영한 이미지 수백 내지 수천 장을 수집하고, 위와 같 이 수집된 데이터를 정상 및 불량의 유형에 대해 구분하여 데이터셋(data set)으로 구성한다. 이러한 데이터셋(data set)은 양질의 데이터만으로 구성되어 있는데, 실제 상황의 입력이미지는 용접부의 높이 차에 따른 카메라의 초점변화 및 용접부의 고르지 않은 면과 재질의 특성으로 인한 난반사 등에 의한 의도 하지 않은 저품질의 입력 이미지가 들어올 수 있기 때문에 정제된 데이터로만 구성되어있는 데이터셋(data se t)으로 학습한 경우 추론 정확도가 떨어질 수 있다. 이를 해결하기 위해 기존 데이터셋(data set)에 대해 이진화, 노이즈 추가 등의 데이터 증강기법을 통해 증강된 데이터셋(data set)을 만들 수 있고, 증강된 데이터셋(data set)으로 학습한 모델은 일반 데이터셋(data set)으로 학습시킨 모델보다 실제 상황에서 발생할 수 있는 의도하지 않은 저품질의 이미지를 포함한 다양한 입 력이미지에 대해 보다 높은 추론정확도를 가진 추론모델을 개발할 수 있다. 본 발명의 용접불량 진단기는 공지의 머신러닝 기술로 시각 지능에 특화된 합성곱신경망(CNN)에 기반 한 최적의 딥러닝(Deep Learning) 모델로 개발되어, 헤어핀 모터 용접시 발생하는 용접불량을 실시간으로 진단 하여 헤어핀 모터의 생산성 및 사업성을 향상시킬 수 있다. 도 5는 본 발명의 헤어핀 모터의 용접불량 진단장치의 인공지능(AI)을 활용한 용접불량 진단기의 구 조를 보여주고 있다. 먼저 용접부검출기는 본 발명 진단 장치의 카메라에서 촬영된 이미지에서 찾고자하는 객체 즉, 검측 대상인 용접 부위를 검출하는 것을 목적으로 한다. 자세하게는 입력받은 이미지에서 찾고자하는 객체에 대한 바운딩 박스를 추론한다. 바운딩 박스는 객체의 위치 정보와 용접 여부와 상관없이 정면과 측면(좌, 우 측면을 포함)으로 구분되는 클래스 정보를 포함하고, 추 론 결과인 바운딩 박스의 위치 정보를 토대로 입력받은 이미지를 크롭(crop)하여 클래스 정보에 따라 각각 결함 분류기의 정면이미지 결함분류기나 측면이미지 결함분류기로 전송하는 역할을 한다. 앞서 언급한 결함분류기는 용접부위를 진단하여 정상 혹은 불량의 유형으로 분류하는 것을 목적으로 하며, 정면이미지 결함분류기와 측면이미지 결함분류기로 구분된다. 정면이미지 결함분류기와 측면이미지 결함분류기는 각각 용접부검출기로부터 전달받은 이미 지의 결함 여부와 결함의 유형을 추론하는 것을 목적으로 한다. 앞서 언급한 인공지능(AI)을 활용한 용접불량 진단기는 상기 결함분류기의 과정을 통해 얻은 세 이미지(정면, 좌측면, 우측면이미지)의 추론결과가 취합되어 한 개의 용접부위에 대하여 정상 및 불량의 유형으 로 최종 판단하고, 나아가 용접부 불량을 유형별로 구축하고, 또한 이러한 진단 작업결과를 실시간 사용자 인터 페이스로 모니터에 불량 여부 등 작업사항을 보여줄 수 있다. 따라서 인공지능(AI)을 활용한 용접불량 진단기에서는 불량을 유형화한 데이터를 구축할 수 있어, 이 러한 불량을 야기한 원인을 탐색하여 레이저 용접 공정의 개선 등 필요한 조치를 취할 수 있으므로, 헤어핀 용 접 불량률을 전반적으로 감소시킬 수 있다. 도 6의 좌측은 본 발명의 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치의 외관을 보여주는 사진이 고, 도 6의 우측은 진단장치의 내부 모습을 보여주는 사진으로, 용접 후 결함 검사를 받는 헤어핀 모터가 조명 장치와 암실로 된 본체 내부의 회전구동부에 장착되어 시계 방향으로 천천히 회전하면 상면 및 좌, 우측면 카메라(410, 420, 430)는 각 열의 용접부위를 촬영하여 회전구동부가 1회전 하면 모든 용접부위들을 촬영할 수 있게 된다. 도 7은 본 발명의 터치스크린 방식의 사용자 인터페이스를 보여주고 있다. 사용자 인터페이스의 좌측에는 상측, 좌측, 우측 카메라의 실시간 영상을 보여주고, “작업내역”을 누를 경우 검사받은 헤어핀 모터 의 과거 검사내역을 볼 수 있다. 또한 사용자 인터페이스의 중앙부분에는 검사받는 헤어핀 모터의 진단 결 과를 실시간으로 표시하거나, 최근에 종료된 검사 혹은 선택한 검사의 결과에 대한 진단 결과를 표시한다. 사용 자 인터페이스의 중앙 하단에는 진단 결과에 대한 로그가 나오는 부분이며, 사용자 인터페이스의 기 능들은 모니터를 통해 헤어핀 모터 불량검사의 진행과정 및 결과를 작업자가 볼 수 있도록 한다. 이상과 같은 예로 본 발명을 설명하였으나, 본 발명은 반드시 이러한 예들에 국한되는 것이 아니고, 본 발 명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형 실시될 수 있다. 따라서 본 발명에 개시된 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 예들에 의하여 본 발명의 기 술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며,그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0017204", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 헤어핀 모터를 보여주는 개략적인 사진이다. 도 1b는 도 1a의 “부분 확대사진으로 헤어핀의 용접부위를 보여주는 사진이다. 도 2는 본 발명의 헤어핀 용접 부위(B)의 정상과 불량의 각 유형을 보여주는 예시 사진이다. 도 3은 본 발명의 용접부위에 대한 카메라 설정 및 조명에 따라 다르게 표현되는 피사체의 예시 사진으로, 데이 터셋은 이와 같이 다양한 설정으로 촬영된 이미지로 구성된다.도 4는 본 발명의 용접부 검출기의 학습에 필요한 라벨링을 보여주는 사진이다. 도 5는 본 발명의 헤어핀 모터의 용접불량 진단장치의 AI시스템의 구조를 보여주는 개략도이다. 도 6은 본 발명의 인공지능을 이용한 헤어핀 모터의 용접불량 진단장치의 외관 및 내부를 보여주는 사진이다. 도 7은 본 발명의 용접불량 진단장치에 부착된 모니터의 화면을 보여주는 사진이다."}
