{"patent_id": "10-2021-0170169", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0082344", "출원번호": "10-2021-0170169", "발명의 명칭": "기계학습 기반의 광학위성영상 자동 운량분석시스템 및 자동 운량분석방법", "출원인": "한국항공우주연구원", "발명자": "김민아"}}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위성으로부터 수집된 영상정보를 입력받아 목록을 생성하고 저장하며 영상정보 수집시 신규의 영상정보 여부를판단하는 영상관리부;상기 영상관리부로부터 신규의 영상정보를 전달받아 기계학습 기반의 운량산출을 수행하는 운량산출부; 및상기 운량산출부로부터 운량산출이 수행된 운량 영상정보를 전달받아 저장하는 운량정보저장부를 포함하고, 상기 운량산출부는 상기 영상관리부로부터 전달받는 신규의 영상정보를 입력패턴으로 입력하여 출력패턴으로 운량산출이 수행된 영상정보를 출력하는 기계학습 기반의 운량산출모델을 포함하며, 상기 운량산출모델은 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터 셋을 입력하여 기계학습이 수행되어 생성되는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석시스템."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 운량산출모델은 상기 객체 클래스로 짙은 구름, 옅은 구름, 구름 그림자 및 배경을 포함하고, 상기 객체 클래스별로 각각 가중치를 부여하여 학습된 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동운량분석시스템."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 운량산출모델은 생성 후에 지표 특성에 따라 지표 비율이 반영된 테스트 데이터를 입력하여 평가가 수행된 것을 특징으로 하는기계학습 기반의 광학위성영상 자동 운량분석시스템."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 지표 특성은 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지표 및 기타 지표를 포함하는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석시스템."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 공개특허 10-2023-0082344-3-상기 운량산출모델은 영상정보 내 객체 클래스별로 객체를 검출하되 영상정보 내 픽셀 단위로 객체 검출을 수행하는 시멘틱 분할(Semantic Segmentation) 방식을 이용하는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석시스템."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "위성으로부터 수집된 영상정보 내 운량산출을 수행하는 기계학습 기반의 광학위성영상 자동 운량분석방법에 있어서, a) 위성으로부터 수집된 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터셋이 입력되어 기계학습이 수행됨에 따라 운량산출모델이 생성되는 단계;b) 위성으로부터 수집된 영상정보가 신규의 영상정보인지 판단하는 단계;c) 신규의 영상정보인 것으로 판단된 영상정보가 상기 운량산출모델로 입력되어 운량산출을 수행하는 단계; 및 d) 운량산출이 수행된 운량 영상정보가 운량산출모델로부터 출력되는 단계;를 포함하는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석방법."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 운량산출모델은 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터 셋을 입력하여 기계학습이 수행되어 생성되는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석방법."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 운량산출모델은 상기 객체 클래스로 짙은 구름, 옅은 구름, 구름 그림자 및 배경을 포함하고, 상기 객체 클래스별로 각각 가중치를 부여하여 학습된 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동운량분석방법."}
{"patent_id": "10-2021-0170169", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 단계 a)와 단계 b) 사이에, 생성된 상기 운량산출모델은, 지표 특성에 따라 지표 비율이 반영된 테스트 데이터를 입력하여 평가되되, 상기 지표 특성은 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지표 및 기타 지표를 포함하는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석시스템. 공개특허 10-2023-0082344-4-청구항 10 제7항에 있어서, 상기 운량산출모델은 영상정보 내 객체 클래스별로 객체를 검출하되 영상정보 내 픽셀 단위로 객체 검출을 수행하는 시멘틱 분할(Semantic Segmentation) 방식을 이용하는 것을 특징으로 하는 기계학습 기반의 광학위성영상 자동 운량분석방법."}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 기계학습 기반의 광학위성영상 자동운량 분석시스템에 관한 것으로 더욱 상세하게는 기존 자동운량분 석 방법의 정확도 저하를 개선하기 위해 위성영상의 객체 클래스를 재정의하고 반사특성이 유사한 눈이나 얼음 등 흰색으로 이루어진 지상 표면 및 물체 등의 지표 특성을 분류하며 픽셀단위로 운량을 검출하는 기계학습 모델 (뒷면에 계속)"}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기계학습 기반의 광학위성영상 자동 운량분석시스템 및 자동 운량분석방법에 관한 것으로 더욱 상세 하게는 기존 자동운량분석 방법의 정확도 저하를 개선하기 위해 위성영상의 객체 클래스를 재정의하고 반사특성 이 유사한 눈이나 얼음 등 흰색으로 이루어진 지상 표면 및 물체 등의 지표 특성을 분류하며 픽셀단위로 운량을 검출하는 기계학습 모델을 통해 광학위성영상 자동 운량분석이 가능해지는 기계학습 기반의 광학위성영상 자동 운량분석시스템 및 자동 운량분석방법에 관한 것이다."}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다목적 실용 위성은 위성에서 촬영된 기하학적 왜곡 및 영상의 신호값에 포함된 오차와 잡음을 제거 또는 최소 화 하여 표준영상을 생성한다. 광학위성의 표준영상은 전처리 단계에서 표준영상의 목록을 생성하여 카탈로그 검색시스템을 통해 사용자가 쉽게 광학영상을 판독할 수 있도록 서비스를 제공한다. 이때, 검색시스템에 등록된 표준영상의 목록은 구름을 포함하고 있기 때문에 영상 내에 포함된 구름의 비율에 따라 구름 점유율을 분석하여 검색조건에 따라 유효한 영상을 식별하여 표준영상 생성을 요청하도록 검색서비스 를 제공하고 있다. 여기서 상기 구름의 비율은 하기 [표 1]과 같이 정의된 운량 등급으로 구분하여 검색시스템을 통해 카탈로그 정 보를 제공하는데, 사용자는 해당 등급 구분에 따라 유효한 검색 조건을 부여하여 검색을 수행하고 그 결과 검색 된 유효 영상에서 특정 영상을 선택하여 표준영상 생성 요청을 하게 된다. 표 1"}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이와 같은 운량 등급이 보다 세분화되지 않고, 카탈로그가 16 X 16 격자 형태로 분류됨에 따라 구름이 일정 크 기 이상이고 진한 경우에는 검출 성능이 좋지만 구름이 작고 연한 경우에는 검출 성능이 낮게 분석된다. 또한 눈과 같은 영역이 크고 텍스쳐 정보가 적은 경우에는 눈 영역을 구름으로 오검출 하는 오류가 발생하고 있 다. 따라서 격자방식의 자동운량분석 기술은 격자 일부분만 보고 객체를 판단하기 때문에 성능 및 위치정확도의 한계가 존재한다. 구체적으로 구름의 크기가 작고 연한 경우에는 검출이 잘 되지 않고, 눈 영역이 크고 텍스처 정보가 적은 경우 에는 구름으로 오검출하며, 구름으로 인한 그림자 영역은 검출하지 문제가 있다. 따라서 구름의 강도를 고려하고, 다양한 지표 특성을 고려함과 동시에 구름에 의한 그림자가 고려된 운량 검출 을 수행함에 따라 보다 정확하고 신뢰도 높은 운량분석시스템의 개발이 절실히 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2021-0032075호(공개일자: 2021.03.24)"}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 문제점을 해결하기 위해 안출된 것으로서 표준영상의 목록에 포함된 구름의 점유율을 기계학 습 기반으로 분석하기 위한 객체 클래스를 재정의하고 반사특성이 유사한 눈이나 얼음 등 지표 특성을 분류하며 격자단위로 분할하여 구름 검출이 이루어지는 기존 방식에 대해 픽셀단위로 구름 검출을 수행함으로써 운량분석 결과의 정확도 및 신뢰도를 향상시킴과 동시에 운량분석을 위한 인적 리소스를 최소화하고 분석된 결과 값을 이 용하여 연무를 제거하거나 구름영역에 대한 마스크 레이어를 생성하는 등의 위성영상 활용성을 증대시킬 수 있 는 기계학습 기반의 광학위성영상 자동 운량분석시스템 및 자동 운량분석방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 상기의 과제를 해결하기 위해 아래와 같은 특징을 갖는다. 본 발명은 위성으로부터 수집된 영상정보를 입력받아 목록을 생성하고 저장하며 영상정보 수집시 신규의 영상정 보 여부를 판단하는 영상관리부; 상기 영상관리부로부터 신규의 영상정보를 전달받아 기계학습 기반의 운량산출 을 수행하는 운량산출부; 및 상기 운량산출부로부터 운량산출이 수행된 운량 영상정보를 전달받아 저장하는 운 량정보저장부를 포함하고, 상기 운량산출부는 상기 영상관리부로부터 전달받는 신규의 영상정보를 입력패턴으로 입력하여 출력패턴으로 운량산출이 수행된 영상정보를 출력하는 기계학습 기반의 운량산출모델을 포함하며, 상 기 운량산출모델은 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터 셋을 입력하여 기계학습이 수행되어 생성된다. 여기서 상기 운량산출모델은 상기 객체 클래스로 짙은 구름, 옅은 구름, 구름 그림자 및 배경을 포함하고, 상기 객체 클래스별로 각각 가중치를 부여하여 학습된다. 또한 상기 운량산출모델은 생성 후에 지표 특성에 따라 지표 비율이 반영된 테스트 데이터를 입력하여 평가가 수행되며, 상기 지표 특성은 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지표 및 기타 지표를 포함 한다. 아울러 상기 운량산출모델은 영상정보 내 객체 클래스별로 객체를 검출하되 영상정보 내 픽셀 단위로 객체 검출 을 수행하는 시멘틱 분할(Semantic Segmentation) 방식을 이용한다. 한편 본 발명은 위성으로부터 수집된 영상정보 내 운량산출을 수행하는 기계학습 기반의 광학위성영상 자동 운 량분석방법에 있어서, a) 위성으로부터 수집된 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터 셋이 입력되어 기계학습이 수행됨에 따라 운량산출모델이 생성되는 단계; b) 위성으로부 터 수집된 영상정보가 신규의 영상정보인지 판단하는 단계; c) 신규의 영상정보인 것으로 판단된 영상정보가 상 기 운량산출모델로 입력되어 운량산출을 수행하는 단계; 및 d) 운량산출이 수행된 운량 영상정보가 운량산출모 델로부터 출력되는 단계;를 포함한다. 여기서 상기 운량산출모델은 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데 이터 셋을 입력하여 기계학습이 수행되어 생성된다. 또한 상기 운량산출모델은 상기 객체 클래스로 짙은 구름, 옅은 구름, 구름 그림자 및 배경을 포함하고, 상기 객체 클래스별로 각각 가중치를 부여하여 학습된다. 아울러 상기 단계 a)와 단계 b) 사이에, 생성된 상기 운량산출모델은, 지표 특성에 따라 지표 비율이 반영된 테 스트 데이터를 입력하여 평가되되, 상기 지표 특성은 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지표 및 기타 지표를 포함한다. 또한 상기 운량산출모델은 영상정보 내 객체 클래스별로 객체를 검출하되 영상정보 내 픽셀 단위로 객체 검출을 수행하는 시멘틱 분할(Semantic Segmentation) 방식을 이용한다."}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 운량분석 결과의 정확도 및 신뢰도를 향상시킴과 동시에 운량분석을 위한 인적 리소스를 최소 화하고 분석된 결과 값을 이용하여 연무를 제거하거나 구름영역에 대한 마스크 레이어를 생성하는 등의 위성영 상 활용성을 증대시킬 수 있는 효과가 있다. 아울러 위성영상 서비스를 위해 카탈로그의 운량에 따른 유효성 평가 수행이 가능해지고 자동 운량분석시스템을 통해 생성된 운량 마스크를 적용하여 유효성 평가 시 영상획득 여부를 자동으로 판별함에 따라 영상서비스 속도 가 개선되는 효과가 있다."}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명과 본 발명의 동작상의 이점 및 본 발명의 실시에 의하여 달성되는 목적을 설명하기 위하여 이하에서는 본 발명의 바람직한 실시예를 예시하고 이를 참조하여 살펴본다. 먼저, 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로서, 본 발명을 한정하려는 의도가 아니며, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 또한 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 발명을 설명함에 있어서, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있 다고 판단되는 경우에는 그 상세한 설명은 생략한다. 도 1은 본 발명의 일실시예에 따른 자동 운량분석시스템의 구성을 나타내는 블럭도이며, 도 2는 본 발명의 일실 시예에 따라 정의된 객체 클래스 및 레이블과 해당 영상정보를 나타내는 도면이고, 도 3은 본 발명의 일실시예 에 따라 격자단위 검출 방식과 픽셀단위의 검출 방식을 비교한 영상정보를 나타내는 도면이다. 또한 도 4는 본 발명의 일실시예에 따른 지표 특성을 나타내는 도면이며, 도 5는 본 발명의 학습데이터와 테스 트데이터의 특성을 나타내는 도면이고, 도 6은 본 발명의 일실시예에 따라 다양한 지표 특성에 따른 영상정보에 대해 격자단위 검출 방식과 픽셀단위의 검출 방식을 비교한 영상정보를 나타내는 도면이다. 도면을 참조하면, 본 발명의 일실시예에 따른 자동 운량분석시스템은 크게 위성으로부터 수집된 영상정보 를 입력받아 목록을 생성하고 저장하며 영상정보 수집시 신규의 영상정보 여부를 판단하는 영상관리부와, 상기 영상관리부로부터 신규의 영상정보를 전달받아 기계학습 기반의 운량산출을 수행하는 운량산출부 및 상기 운량산출부로부터 운량산출이 수행된 운량 영상정보를 전달받아 저장하는 운량정보저장부 를 포함한다. 여기서 영상관리부는 위성으로부터 촬영된 원시형태의 영상정보를 수신받아 해당 영상정보에 대한 목록을 생성하고 관리하며 계속하여 영상정보를 수신받을 때 해당 영상정보가 기존에 수신받은 영상정보인지 신규의 영 상정보인지를 판단하여 신규의 영상정보로 판단되는 경우 상기 운량산출부로 이를 전달하는 역할을 수행한 다. 필요에 따라 도 1에 도시된 바와 같이 별도의 위성영상 수신시스템이 구비되어 위성으로부터 원시형태의 영상정보를 수신받아 저장하며, 요청에 따라 해당 영상정보를 본 발명의 자동 운량분석시스템으로 전달하 도록 구성할 수 있다. 한편 상기 운량산출부는 상기 영상관리부로부터 신규의 영상정보를 전달받아 기계학습 기반의 운량산 출을 수행하도록 구비되는데, 이러한 운량산출부는 상기 영상관리부로부터 전달받는 신규의 영상정보 를 입력패턴으로 입력하여 출력패턴으로 운량산출이 수행된 영상정보를 출력하는 기계학습 기반의 운량산출모델 이 포함될 수 있다. 여기서 상기 운량산출모델은 사전에 복수의 위상 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함 하는 입력 데이터 셋을 입력받아 기계학습을 통해 생성된 인공지능 학습모델로서, 본 발명에 따른 운량산출모델 은 객체 클래스를 보다 세분화하고 결과값 레이블은 물론 가중치 레이블을 부여하여 보다 정확한 객체 검출이 가능하도록 구성된다. 본 발명의 일실시예에 따르면, 본 발명의 운량산출모델은 도 2에 도시된 바와 같이 기계학습 시에 상기 객체 클 래스를 짙은 구름, 옅은 구름, 구름 그림자 및 배경으로 정의하여, 기존 구름의 강도에 따른 민감성 저하와 구 름 그림자의 별도로 검출하지 않아 발생되는 문제를 해결할 수 있게 된다. 아울러 상기 객체 클래스 중 옅은 구름은 설정에 따라 안개 또는 연무가 더 포함될 수 있는데, 여기서 연무는 수증기가 아닌 고체 입자가 가시거리를 감소시키는 현상을 말한다. 본 발명에서는 이와 같은 객체 클래스별로 가중치를 두어 학습시킬 수 있는데, 일예로 도 2에 도시된 바와 같이 짙은 구름은 1, 옅은 구름은 0.7, 구름 그림자는 0.7 및 배경은 0으로 설정할 수 있다. 여기서 상기 옅은 구름의 경우 영상정보 내 포함되는 비율을 산출하여 해당 비율이 기설정된 비율(일예로 80%) 과 비교하여 가중치를 달리 설정할 수 있다. 한편 본 발명에 따른 상기 운량산출모델은 생성 후 지표 특성에 따라 테스트데이터로 평가가 수행될 수 있는데, 여기서 상기 지표 특성은 도 4에 도시된 바와 같이 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지 표 및 기타 지표를 포함한다. 이와 같이 지표 특성별 기계 학습을 수행함으로써 같은 흰색일 경우에도 지표 특성에 따라 반사율 등을 고려하 여 운량 검출을 수행할 수 있게 된다. 도 4에 테스트데이터에서 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지표 및 기타 지표의 비중이 각각 10.20%, 17.90%, 17.10%, 34,50%, 9,45% 및 10.85%인데, 이들의 비중이 각각 다른 것은 수집되는 위성 영 상정보에서 상대적으로 숲 지표와 도시 지표 및 강/바다 지표가 많기 때문이다. 도 5에 도시된 바와 같이 본 발명의 일실시예에서는 전술한 학습데이터와 테스트데이터의 비중을 8:2로 하여 학 습 및 평가를 수행하였으며, 해당 데이터는 총 10등급의 운량등급으로 분류된 데이터를 기반으로 한다. 이와 같은 테스트데이터를 통한 평가는 성과 지표로 2가지 메트릭스(Jaccard Index, averall accuracy)를 적용 하였으며, 이를 기초로 목표치는 짙은 구름(Thick Cloud)이 Jaccard Index = 90%, Overall Accuracy = 95%이며, 옅은 구름(Thin Cloud)이 Jaccard Index = 70%, Overall Accuracy = 80%으로 설정하여 평가하였다. 이와 같은 테스트데이터의 평가를 통해 정확도 개선을 도출할 수 있게 된다. 한편 본 발명의 또 다른 특징으로 상기 운량산출모델은 영상정보 내 객체 클래스별로 객체를 검출하되 영상정보 내 픽셀 단위로 객체 검출을 수행하는 시멘틱 분할(Semantic Segmentation) 방식이 적용된다. 여기서 시멘틱 분할(semantic segmentation) 방식은 영상정보 내에 있는 객체들을 의미있는 단위로 분할하는 것으로 영상정보의 각 픽셀이 어느 객체 클래스에 속하는지 예측한다. 이와 같이 영상정보 내 모든 픽셀에 대해서 예측을 진행하기 때문에 이 방식을 dense prediction이라고 부르기 도 한다. 따라서 위성으로부터 수신받은 영상정보 내에는 구름, 강, 바다, 산, 건물 등의 여러 종류의 객체가 포함되어 있을 수 있다. 이렇게 서로 다른 종류의 객체들을 픽셀 단위로 객체 검출을 수행함에 따라 보다 명확하게 분할해낼 수 있게 된 다. 따라서 본 발명이 일실시예에 따른 운량산출부의 운량산출모델을 통해 도 6에 도시된 바와 같이 영상정보 내 구름의 강도(짙은 구름, 옅은 구름)는 물론 구름에 의한 그림자의 존재 여부 등이 명확하게 검출될 수 있게 된다. 한편 상기 운량정보저장부는 운량산출부로부터 운량산출이 수행된 운량 영상정보를 전달받아 이를 저 장하도록 구비되는데, 이러한 운량정보저장부는 도 1에 도시된 바와 같이 카달로그 검색시스템으로 설정 또는 요청에 따라 운량산출이 수행된 운량 영상정보를 전송하도록 구성될 수 있다. 도 7은 본 발명의 일실시예에 따른 기계학습 기반의 광학위성영상 자동 운량분석방법을 나타내는 순서도이다. 도면을 참조하면, 본 발명의 일실시예에 따른 자동 운량분석방법은 크게 위성으로부터 수집된 복수의 영상정보 와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터 셋이 입력되어 기계학습이 수행됨에 따라 운량산출모델이 생성되는 단계(S100)와, 위성으로부터 수집된 영상정보가 신규의 영상정보인지 판단하는 단계 (S200)와, 신규의 영상정보인 것으로 판단된 영상정보가 상기 운량산출모델로 입력되어 운량산출을 수행하는 단 계(S300) 및 운량산출이 수행된 운량 영상정보가 운량산출모델로부터 출력되는 단계(S400)를 포함한다. 본 발명의 자동 운량분석방법은 전술한 자동 운량분석시스템에서 설명한 바와 같이 우선 위성으로부터 수 집된 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데이터 셋이 입력되어 기계 학습이 수행됨에 따라 운량산출모델이 생성되는 단계(S100)가 수행된다. 여기서 상기 운량산출모델은 복수의 영상정보와 각 영상정보의 객체 클래스에 따른 레이블을 포함하는 입력 데 이터 셋을 입력하여 기계학습이 수행되어 생성되며, 상기 운량산출모델은 상기 객체 클래스로 짙은 구름, 옅은 구름, 구름 그림자 및 배경을 포함하고, 상기 객체 클래스별로 각각 가중치를 부여하여 학습된다. 아울러 여기서 객체 클래스로 옅은 구름은 안개 또는 연무 등이 설정에 따라 더 포함될 수 있으며, 영상정보 내 포함되는 비율과 기설정된 비율을 비교하여 가중치를 달리 부여하고, 해당 가중치에 따라 학습될 수 있다. 아울러 본 발명의 다른 실시예로 상기 운량산출모델은 S100 단계를 통해 생성된 후 지표 특성에 따라 테스트데 이터로 평가가 수행될 수 있는데, 여기서 상기 지표 특성은 도 4에 도시된 바와 같이 눈/얼음 지표, 도시 지표, 강/바다 지표, 숲 지표, 사막 지표 및 기타 지표를 포함한다. 이와 같이 지표 특성별로 테스트데이터를 통해 기계 학습을 추가적으로 수행함으로써 같은 흰색일 경우에도 지 표 특성에 따라 반사율 등을 고려하여 운량 검출을 수행할 수 있게 된다. 아울러 전술한 바와 같이 상기 운량산출모델은 영상정보 내 객체 클래스별로 객체를 검출하되 영상정보 내 픽셀 단위로 객체 검출을 수행하는 시멘틱 분할 방식으로 이루어진다. 한편 상기 S100 단계가 수행되어 운량산출모델이 생성되면, 전술한 영상관리부를 통해 위성으로부터 수집 된 영상정보가 신규의 영상정보인지 판단하는 단계(S200)를 수행하고, 만일 신규의 영상정보인 것으로 판단되면, 해당 영상정보를 상기 운량산출모델로 입력하여 운량산출을 수행하게 된다(S300). 아울러 운량산출이 수행되면, 운량산출모델로부터 운량 영상정보가 출력되고(S400), 이는 운량정보저장부 로 전달되어 저장되게 된다. 이상에서 본 발명의 바람직한 실시 예에 대하여 설명하였으나, 본 발명은 상술한 특정의 실시 예에 한정되지 아"}
{"patent_id": "10-2021-0170169", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "니한다. 즉, 본 발명이 속하는 기술분야에서 통상의 지식을 가지는 자라면 첨부된 특허청구범위의 사상 및 범주를 일탈함이 없이 본 발명에 대한 다수의 변경 및 수정이 가능하며, 그러한 모든 적절한 변경 및 수정은 균등물 들로 본 발명의 범위에 속하는 것으로 간주 되어야 할 것이다."}
{"patent_id": "10-2021-0170169", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 자동 운량분석시스템의 구성을 나타내는 블럭도이다. 도 2는 본 발명의 일실시예에 따라 정의된 객체 클래스 및 레이블과 해당 영상정보를 나타내는 도면이다. 도 3은 본 발명의 일실시예에 따라 격자단위 검출 방식과 픽셀단위의 검출 방식을 비교한 영상정보를 나타내는 도면이다. 도 4는 본 발명의 일실시예에 따른 지표 특성을 나타내는 도면이다. 도 5는 본 발명의 학습데이터와 테스트데이터의 특성을 나타내는 도면이다. 도 6은 본 발명의 일실시예에 따라 다양한 지표 특성에 따른 영상정보에 대해 격자단위 검출 방식과 픽셀단위의 검출 방식을 비교한 영상정보를 나타내는 도면이다. 도 7은 본 발명의 일실시예에 따른 기계학습 기반의 광학위성영상 자동 운량분석방법을 나타내는 순서도이다."}
