{"patent_id": "10-2022-0036758", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0113104", "출원번호": "10-2022-0036758", "발명의 명칭": "안테나를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "정문진"}}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,적어도 일부가 도전성 부분으로 형성되는 하우징;상기 전자 장치의 내부에 배치되는 PCB(printed circuit board);접촉 영역을 포함하며 상기 접촉 영역의 적어도 일부를 통하여 상기 하우징의 도전성 부분과 접촉하는 도전성부재(conductive member), 상기 접촉 영역은 적어도 하나의 제1 접촉 부분, 및 상기 제1 접촉 부분으로부터 굴곡지게 연장되어 상기 도전성 부분과 접촉하는 적어도 하나의 제2 접촉 부분을 포함함; 및상기 PCB와 상기 도전성 부재를 전기적으로 연결하는 도전성 연결 부재(conductive connect member)를포함하고,상기 도전성 부재는 상기 하우징의 상기 도전성 부분에 고정되고, 상기 도전성 부재가 상기 하우징의 상기 도전성 부분에 고정될 때, 굴곡지게 연장된 상기 제2 접촉 부분과 상기도전성 부분의 접촉이 유지됨으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결되는,전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 PCB 상에 배치되는 무선 통신 회로를 더 포함하고,상기 무선 통신 회로는 상기 도전성 연결 부재를 통하여 상기 도전성 부재와 전기적으로 연결되고,상기 무선 통신 회로는, 상기 도전성 연결 부재를 통하여 상기 도전성 부재의 일부에 급전함으로써, 상기 도전성 연결 부재, 상기 도전성 부재, 및 상기 도전성 부재와 전기적으로 연결된 상기 하우징의 상기 도전성 부분을포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신하는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,굴곡지며 형성된 상기 접촉 영역의 상기 제2 접촉 부분의 적어도 일부는 상기 접촉 영역에서 발생하는 탄성력에의해, 상기 도전성 부분과의 접촉을 유지함으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 도전성 부재의 접촉 영역은 두개의 제1 접촉 부분, 및 두개의 제2 접촉 부분을 포함하고,상기 두개의 제1 접촉 부분은 상기 도전성 부재와 접촉하는 상기 도전성 부분의 일면을 기준으로 제1 높이를 가지고, 상기 두개의 제2 접촉 부분은 상기 제1 높이보다 낮은 제2 높이를 가지고 상기 제1 접촉 부분에서 굴곡지며 연장되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 도전성 부재의 접촉 영역은 상기 제1 접촉 부분 및 상기 제2 접촉 부분에 의해 형성된 굴곡진 테두리를 가공개특허 10-2023-0113104-3-지는 제1 홀을 포함하고,상기 두개의 제1 접촉 부분은 상기 제1 홀의 임의의 점을 기준으로 서로 대향하도록 형성되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 도전성 부재와 상기 하우징의 상기 도전성 부분을 고정시키는 체결 부재를 더 포함하고,상기 제1 접촉 부분의 상부면은 상기 체결 부재와 대면하고,상기 제2 접촉 부분의 제2 높이는 크기가 점진적으로 감소함으로써 상기 제2 접촉 부분의 하부면의 적어도 일부가 상기 하우징의 상기 도전성 부분과 접촉하는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 도전성 부재는 평평한(flat) 형태의 제3 접촉 부분을 더 포함하고,상기 제1 접촉 부분은 상기 제3 접촉 부분의 일단에서 연장되고, 상기 제2 접촉 부분은 상기 제3 접촉 부분의타단에서 연장되며,상기 제1 접촉 부분과 상기 제2 접촉 부분은 물리적으로 단절되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 제1 접촉 부분과 상기 제2 접촉 부분이 물리적으로 단절됨으로써, 상기 접촉 영역은 상기 제1 접촉 부분, 상기 제2 접촉 부분, 및 상기 제3 접촉 부분에 의해 형성된 굴곡진 테두리를 가지며, 일부가 개구 영역인 오픈 루프 형상(open-loop shape)으로 형성된 제1 홀을 포함하는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 도전성 부재와 상기 하우징의 상기 도전성 부분을 고정시키는 체결 부재를 더 포함하고,상기 도전성 부재는 상기 접촉 영역에 부착되는 도전성 지지 부재(support member)를 더 포함하고,상기 체결 부재가 상기 도전성 부재를 상기 하우징의 상기 도전성 부분에 고정시킬 때, 상기 도전성 지지 부재는 상기 도전성 부재의 접촉 영역과 상기 도전성 부분 사이에 배치되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "에 있어서,상기 도전성 부재는 제1 도전성 부재이며 상기 제1 도전성 부재와 이격되어 배치되는 제2 도전성 부재를 더 포함하고,상기 PCB 상에 배치된 무선 통신 회로는 상기 도전성 연결 부재를 통하여 상기 제1 도전성 부재에급전함으로써, 상기 도전성 연결 부재, 상기 하우징의 일부와 연결된 상기 제1 도전성 부재, 상기 하우징의 상기 도전성 부분, 및 상기 하우징의 다른 일부와 연결된 상기 제2 도전성 부재를 포함하는 전기적 경로에 기반하여, 지정된 주파수 대역의 신호를 송신 및/또는 수신하는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1에 있어서,상기 접촉 영역의 상기 제2 접촉 부분 상에 상기 도전성 부분과의 접촉을 위한 돌기가 형성되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 적어도 하나의 제1 접촉 부분은 복수의 제1 접촉 부분으로 형성되고,상기 적어도 하나의 제2 접촉 부분은 복수의 제2 접촉 부분으로 형성되는, 전자 장치. 공개특허 10-2023-0113104-4-청구항 13"}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 1에 있어서,상기 도전성 부재는 상기 접촉 영역에 형성되는 제1 홀을 포함하고,상기 하우징의 도전성 부분은 상기 전자 장치의 전면을 향하는 방향으로 상기 제1 홀에 대응하여 일렬로 정렬된제2 홀을 포함하고,일렬로 정렬된 상기 제1 홀과 상기 제2 홀에 배치됨으로써, 상기 도전성 부재를 상기 하우징의 상기 도전성 부분에 고정시키는 체결 부재를 더 포함하는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 1에 있어서,상기 도전성 연결 부재는 FRC(flexible radio frequency cable)로 형성되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,적어도 일부가 도전성 부분으로 형성되는 하우징;상기 전자 장치의 내부에 배치되는 PCB(printed circuit board); 및상기 PCB 및 상기 하우징의 상기 도전성 부분과 전기적으로 연결되는 안테나 조립체;상기 안테나 조립체는:상기 안테나 조립체의 일부를 상기 하우징의 상기 도전성 부분에 고정시키는 체결 부재(fastening member);접촉 영역을 포함하며 상기 접촉 영역의 적어도 일부를 통하여 상기 하우징의 도전성 부분과 접촉하는 도전성부재(conductive member), 상기 접촉 영역은 상기 체결 부재와 접촉하는 적어도 하나의 제1 접촉 부분, 상기 도전성 부분과 접촉하는 적어도 하나의 제2 접촉 부분, 및 상기 제1 접촉 부분과 상기 제2 접촉 부분에 의해 형성된 굴곡진 테두리를 가지는 제1 홀을 포함함; 및상기 PCB와 상기 도전성 부재를 전기적으로 연결하는 도전성 연결 부재(conductive connect member)를포함하고,상기 체결 부재는 상기 제1 홀과 상기 하우징의 상기 도전성 부분에 형성된 제2 홀에 배치됨으로써, 상기 도전성 부재를 상기 도전성 부분에 고정시키고, 상기 체결 부재에 의해 상기 도전성 부재가 상기 하우징의 상기 도전성 부분에 고정될 때, 굴곡지게 연장된 상기 제2 접촉 부분과 상기 도전성 부분의 접촉이 유지됨으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,공개특허 10-2023-0113104-5-상기 PCB 상에 배치되는 무선 통신 회로를 더 포함하고,상기 무선 통신 회로는 상기 도전성 연결 부재를 통하여 상기 도전성 부재와 전기적으로 연결되고,상기 무선 통신 회로는, 상기 도전성 연결 부재를 통하여 상기 도전성 부재의 일부에 급전함으로써, 상기 도전성 연결 부재, 상기 도전성 부재, 및 상기 도전성 부재와 전기적으로 연결된 상기 하우징의 상기 도전성 부분을포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신하는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서,굴곡지며 형성된 상기 접촉 영역의 상기 제2 접촉 부분의 적어도 일부는 상기 접촉 영역에서 발생하는 탄성력에의해, 상기 도전성 부분과의 접촉을 유지함으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서,상기 도전성 부재의 접촉 영역은 두개의 제1 접촉 부분, 및 두개의 제2 접촉 부분을 포함하고,상기 두개의 제1 접촉 부분은 상기 도전성 부재와 접촉하는 상기 도전성 부분의 일면을 기준으로 제1 높이를 가지고, 상기 두개의 제2 접촉 부분은 상기 제1 높이보다 낮은 제2 높이를 가지고 상기 제1 접촉 부분에서 굴곡지며 연장되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서,상기 적어도 하나의 제1 접촉 부분은 복수의 제1 접촉 부분으로 형성되고,상기 적어도 하나의 제2 접촉 부분은 복수의 제2 접촉 부분으로 형성되는, 전자 장치."}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따른 전자 장치는 전자 장치에 있어서, 적어도 일부가 도전성 부분으로 형성되는 하우징, 상기 전 자 장치의 내부에 배치되는 PCB(printed circuit board), 접촉 영역을 포함하며 상기 접촉 영역의 적어도 일부를 통하여 상기 하우징의 도전성 부분과 접촉하는 도전성 부재(conductive member), 상기 접촉 영역은 상기 체결 부 (뒷면에 계속)"}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에서 개시되는 다양한 실시 예들은, 안테나를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 다양한 주파수 대역의 무선 통신 서비스, 예를 들면 3G, 4G, 또는 5G 서비스 등을 지원하는 안테나 모듈들을 포함하고 있다. 한편, 전자 장치의 프로세서(예: CP, communication processor)는 기지국과 통신을 수 행하고, 전자 장치에서 이용할 통신 방식을 결정한다. 예를 들어, 전자 장치의 무선 통신 회로는 3G/4G 통신 방 식, 또는 5G 통신 방식 중 하나 이상을 사용하여 기지국과 통신을 수행할 수 있다. 또한, 통신 회로 및 안테나를 포함하는 안테나 모듈들을 전자 장치 내부에 고정하기 위하여, 나사를 포함하는 체결 부재를 활용함으로써 안테나 모듈들은 전자 장치 내부에 고정될 수 있다."}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "안테나 방사체로 이용되는 하우징의 도전성 부분은 다양한 연결 구조에 의해 무선 통신 회로와 전기적으로 연결 될 수 있다. 예를 들어, 상기 다양한 연결 구조는 c-clip 연결 구조 또는 도전성 부재에 의한 직접 연결 구조를 포함할 수 있다.다만, c-clip 연결 구조의 경우, 전자 장치의 낙하 또는 외부의 충격에 의해 c-clip이 이탈되거나 변형이 될 수 있다. 그로 인해, 안테나의 성능이 저하될 수 있다. 또한, 도전성 부재에 의한 직접 연결 구조의 경우, 도전성 부재는 스크류(screw)와 같은 체결 부재에 의하여 하 우징의 도전성 부분과 직접 전기적으로 연결될 수 있다. 다만, 체결 부재가 불량으로 체결되는 경우, 하우징의 도전성 부분과 도전성 부재가 일부 접촉되지 않을 수 있다. 하우징의 도전성 부분과 도전성 부재가 접촉되지 않 음으로써, 안테나 성능이 저하될 수 있다. 본 문서에서 개시되는 다양한 실시 예들은, 불량 체결된 경우에도 안테나 성능이 저하되지 않는 전자 장치를 제 공할 수 있다."}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예에 따르면, 전자 장치는 전자 장치에 있어서, 적어도 일부가 도전성 부분으 로 형성되는 하우징, 상기 전자 장치의 내부에 배치되는 PCB(printed circuit board), 접촉 영역을 포함하며 상 기 접촉 영역의 적어도 일부를 통하여 상기 하우징의 도전성 부분과 접촉하는 도전성 부재(conductive member), 상기 접촉 영역은 상기 체결 부재와 접촉하는 적어도 하나의 제1 접촉 부분, 및 상기 제1 접촉 부분으로부터 굴 곡지게 연장되어 상기 도전성 부분과 접촉하는 적어도 하나의 제2 접촉 부분을 포함함; 및 상기 PCB와 상기 도 전성 부재를 전기적으로 연결하는 도전성 연결 부재(conductive connect member)를 포함하고, 상기 도전성 부재 는 상기 하우징의 상기 도전성 부분에 고정되고, 상기 도전성 부재가 상기 하우징의 상기 도전성 부분에 고정될 때, 굴곡지게 연장된 상기 제2 접촉 부분과 상기 도전성 부분의 접촉이 유지됨으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결될 수 있다. 본 문서에 개시되는 다양한 실시 예에 따른 전자 장치는, 적어도 일부가 도전성 부분으로 형성되는 하우징, 상 기 전자 장치의 내부에 배치되는 PCB(printed circuit board), 및 상기 무선 통신 회로 및 상기 하우징의 상기 도전성 부분과 전기적으로 연결되는 안테나 조립체, 상기 안테나 조립체는, 상기 안테나 조립체의 일부를 상기 하우징의 상기 도전성 부분에 고정시키는 체결 부재(fastening member), 접촉 영역을 포함하며 상기 접촉 영역 의 적어도 일부를 통하여 상기 하우징의 도전성 부분과 접촉하는 도전성 부재(conductive member), 상기 접촉 영역은 상기 체결 부재와 접촉하는 적어도 하나의 제1 접촉 부분, 상기 도전성 부분과 접촉하는 적어도 하나의 제2 접촉 부분, 및 상기 제1 접촉 부분과 상기 제2 접촉 부분에 의해 형성된 굴곡진 테두리를 가지는 제1 홀을 포함하고, 및 상기 무선 통신 회로와 상기 도전성 부재를 전기적으로 연결하는 도전성 연결 부재(conductive connect member)를 포함하고, 상기 체결 부재는 상기 제1 홀과 상기 하우징의 상기 도전성 부분에 형성된 제2 홀에 배치됨으로써, 상기 도전성 부재를 상기 도전성 부분에 고정시키고, 상기 체결 부재에 의해 상기 도전성 부재가 상기 하우징의 상기 도전성 부분에 고정될 때, 굴곡지게 연장된 상기 제2 접촉 부분과 상기 도전성 부분 의 접촉이 유지됨으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결될 수 있다."}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예에 따르면, 전자 장치는 불량 체결된 경우에도 안테나 성능이 저하되지 않는 도전성 구조를 제공할 수 있다. 또한 다양한 실시 예에 따르면, 전자 장치는 체결 부재를 이용한 체결 과정에서도 연결 구조가 파손되지 않는 안테나 구조를 제공할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0036758", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 본 발명의 실시 예에 따른 전자 장치는 바(bar) 타입의 전자 장치를 예로 들어 설명하나, 후술하는 실시 예는 슬라이더블(slidable), 롤러블(rollable), 및 폴더블(foldable) 타입과 같은 전자 장치에도 적용할 수 있 고, 이에 한정하지 않는다. 도 1은 일 실시 예에 따른, 전자 장치의 전면 사시도이다. 도 1을 참조하면, 일 실시 예에 따른 전자 장치는, 제1 면(또는 “전면”)(110A), 제2 면(또는 “후면 ”)(110B), 및 제1 면(110A)과 제2 면(110B) 사이의 공간을 둘러싸는 측면(또는 “측벽”)(110C)을 포함하는 하 우징을 포함할 수 있다. 다른 실시 예(미도시)에서는, 하우징은 도 1의 제1 면(110A), 제2 면(110B) 및 측면(110C)들 중 일부를 형성하는 구조를 지칭할 수도 있다. 일 실시 예에 따른 도 1을 참조하면, 제1 면(110A)은 적어도 일부분이 실질적으로 투명한 전면 플레이트 (예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트)에 의하여 형성될 수 있다. 일 실시 예에 따르면, 전면 플레이트의 적어도 일측 단부(side edge portion)는 제1 면(110A)으로부터 후면 플레이트 쪽으로 휘어져 심리스하게(seamless) 연장된 곡면 부분을 포함할 수 있다. 일 실시 예에 따르면, 측면(110C)은, 전면 플레이트 및 후면 플레이트와 결합하며, 금속 및/또는 폴 리머를 포함하는 측면 부재에 의하여 형성될 수 있다. 어떤 실시 예에서는, 후면 플레이트 및 측면 부재는 일체로 형성되고 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는, 디스플레이, 오디오 모듈, 센서 모듈(미도시), 카메라 모듈 (115, 112, 113, 106), 키 입력 장치 및 커넥터 홀 중 적어도 하나를 포함할 수 있다. 어떤 실시 예 에서는, 전자 장치는 구성요소들 중 적어도 하나(예: 키 입력 장치)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 일 예시에서, 전자 장치는 도시되지 않은 센서 모듈을 포함할 수 있다. 예컨대, 센서 모듈은 전면 플레이 트를 통해 전자 장치의 외부에 보여지는 디스플레이의 화면 표시 영역의 배면에 배치될 수 있다. 예를 들어, 디스플레이의 화면 표시 영역의 배면에는 광학 센서, 초음파 센서 또는 정전 용량형 센서 (capacitive sensor) 중 적어도 하나가 배치될 수 있으나, 이에 한정되는 것은 아니다. 어떤 실시 예에서, 전자 장치는 발광 소자를 더 포함할 수 있으며, 발광 소자는 전면 플레이트가 제 공하는 영역 내에서 디스플레이와 인접한 위치에 배치될 수 있다. 발광 소자는, 예를 들어, 전자 장치 의 상태 정보를 광 형태로 제공할 수 있다. 다른 실시 예에서는, 발광 소자는, 예를 들어, 카메라 모듈 의 동작과 연동되는 광원을 제공할 수 있다. 발광 소자는, 예를 들어, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이는 전면 플레이트의 상당 부분을 통하여 전자 장치의 외부로 보일 수 있다. 어떤 실시 예에서는, 디스플레이의 가장자리는 전면 플레이트의 인접한 외곽 형상(예:곡면)과 대체로 동일하게 형성될 수 있다. 다른 실시 예(미도시)에 따르면, 전자 장치는 디스플레이의 화면 표시 영역의 일부에 리세스 (recess), 노치(notch), 또는 개구부(opening)를 형성할 수 있고, 상기 리세스, 노치 또는 개구부에는 다양한 전자 부품, 예를 들어, 카메라 모듈 또는 도시되지 않은 센서 모듈이 배치될 수 있다. 일 실시 예에 따르면, 오디오 모듈은 마이크 홀 및 스피커 홀을 포함할 수 있다. 마이크 홀은 외부의 소리 를 획득하기 위한 마이크가 내부에 배치될 수 있고, 어떤 실시 예에서는 소리의 방향을 감지할 수 있도록 복수 개의 마이크가 배치될 수 있다. 다른 실시 예에 따르면, 스피커 홀과 마이크 홀이 하나의 홀로 구현되거나, 스 피커 홀 없이 스피커가 포함될 수도 있다(예: 피에조 스피커). 스피커 홀은, 예를 들면, 외부 스피커 홀 및 통 화용 리시버 홀을 포함할 수 있다. 전자 장치는 도시되지 않은 센서 모듈을 포함함으로써, 내부의 작동 상태, 또는 외부의 환경 상태에 대응 하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈은, 하우징의 제1 면(110A)에 배치된 근접 센 서, 디스플레이의 배면에 배치되는 지문 센서, 및/또는 상기 하우징의 제2 면(110B)에 배치된 생체 센서(예: HRM 센서)를 포함할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 및 조도 센서 중 적어도 하나를 더 포함할 수 있 다. 도 2는 일 실시 예에 따른, 전자 장치의 후면 사시도이다. 일 실시 예에 따른 도 2를 참조하면, 제2 면(110B)은 실질적으로 불투명한 후면 플레이트에 의하여 형성될 수 있다. 후면 플레이트는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테 인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시 예에 따르면, 후면 플레이트의 적어도 일측 단부는 제2 면(110B)으로부터 전면 플레이트 쪽으로 휘어 져 심리스하게 연장된 곡면 부분을 포함할 수 있다. 일부 실시 예에 따르면, 제2 면(110B)에는 카메라 모듈(예: 112, 113, 114, 115), 지문 센서, 및 플래시(예: 106) 중 적어도 하나가 배치될 수 있다. 다른 실시 예(미도시)에 따르면, 디스플레이는 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저 와 결합되거나 인접하여 배치될 수 있다. 일 실시 예에 따르면, 카메라 모듈(105, 112, 113, 114, 115, 106)은, 전자 장치의 제1 면(110A)에 배치 된 제1 카메라 모듈, 및 제2 면(110B)에 배치된 제2 카메라 모듈(112, 113, 114, 115), 및/또는 플래시 를 포함할 수 있다. 예를 들어, 상술한 카메라 모듈들(105, 112, 113, 114, 115)은, 하나 또는 복수의 렌 즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 플래시는, 예를 들어, 발광 다이 오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시 예에서는, 2개 이상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시 예에 따르면, 키 입력 장치는, 하우징의 측면(110C)에 배치될 수 있다. 다른 실시 예에서는, 전자 장치는 상기 언급된 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입력 장치는 디스플레이 상에 소프트 키 등 다른 형태로 구현될 수 있다. 어떤 실시 예에서, 키 입력 장치는 하우징의 제2 면(110B)에 배치된 지문 센서의 적어도 일부를 포함할 수 있다. 일 실시 예에 따르면, 커넥터 홀은, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터, 및 /또는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있다. 예를 들어, 커넥터 홀 은 USB 커넥터 또는 이어폰 잭을 포함할 수 있다. 일 실시 예에서는, USB 커넥터와 이어폰 잭은 하나의 홀(예: 도 1, 도 2의 108)로 구현될 수도 있으며, 다른 실시 예(미도시)에 따르면, 전자 장치는 별도의 커넥터 홀 없이 외부 전자 장치와 전력 및/또는 데이터를 송수신하거나, 오디오 신호를 송수신할 수도 있다. 도 3은 일 실시 예에 따른, 전자 장치의 분해도이다. 일 실시 예에 따르면, 도 3은 전자 장치의 내부를 도시한다. 일 실시 예에 따르면, 전자 장치는 하우징, 디스플레이, 후면 플레이트, 안테나 조립체 , PCB, 및 배터리를 포함할 수 있다.일 실시 예에 따르면, 디스플레이는 전자 장치의 전면(도 1의 110A)에 배치될 수 있다. 일 실시 예에 따르면, 디스플레이의 전면(예: 도 3의 +z 방향의 일면)은 전자 장치의 전면에 배치되 어 시각적으로 외부에 노출될 수 있다. 일 실시 예에 따르면, 디스플레이의 전면에 반대되는 배면(예: 도 3의 -z 방향의 일면)은 전자 장치 의 내부를 향하여 배치됨으로써 시각적으로 외부에 노출되지 않을 수 있다. 예를 들어, 디스플레이의 배면 은 전자 장치의 내부에 배치되는 복수의 부품(예: 배터리)를 향하여 배치될 수 있다. 일 실시 예에 따르면, 하우징은 전자 장치의 내부 구성 요소들을 외부의 충격 또는 이물질의 유입으 로부터 보호할 수 있다. 일 실시 예에 따르면, 하우징은 전자 장치의 전면(110A)의 일부 및 측면(110C)을 형성할 수 있다. 일 예에서, 하우징은 전자 장치 내부에 배치된 PCB 및/또는 PCB에 배치된 복수의 전자 부품들 (예: 배터리)이 외부 충격에 의해 손상되는 것을 감소시킬 수 있다. 일 실시 예에 따르면, 하우징의 일부는 안테나 방사체로 이용될 수 있다. 일 실시 예에 따르면, 하우징 은 도전성 부분 및 비도전성 부분으로 형성될 수 있다. 예를 들어, 하우징의 가장자리의 일부는 금속 부재로 형성될 수 있다. 예를 들어, 하우징의 가장 자리의 다른 일부는 사출 부재로 형성될 수 있다. 일 실시 예에 따르면, 도전성 부분으로 형성된 하우징의 일부는 PCB와 전기적으로 연 결되어 안테나 방사체로 이용될 수 있다. 일 실시 예에 따르면, 하우징, 디스플레이, 및 후면 플레이트에 의해 형성된 전자 장치의 내부 공간에는 안테나 조립체, PCB, 및 배터리가 배치될 수 있다. 일 실시 예에 따르면, 안테나 조립체는 PCB와 인접한 전자 장치의 내부 영역에 배치될 수 있다. 일 예에서, 안테나 조립체는 PCB가 배치된 영역을 기준으로 배터리와 반대되는 영역에 배치될 수 있다. 일 예에서, 안테나 조립체는 PCB와 하우징의 측면(110C) 가장자리 사이의 전자 장치 의 내부 영역에 배치될 수 있다. 예를 들어, 안테나 조립체는 도전성 부분으로 형성된 하우징 의 측면(110C) 가장자리의 일부와 인접한 전자 장치의 내부 영역에 배치될 수 있다. 일 실시 예에 따르면, 적어도 하나의 PCB에는 복수의 전자 부품들이 배치될 수 있다. 일 예시에서, 적어도 하나의 PCB에는 무선 통신 회로(미도시), 프로세서(미도시), 메모리(미도시), 및/또는 인터페이스(미도 시)가 배치될 수 있다. 일 실시 예에 따르면, 배터리는 하우징과 후면 플레이트 사이에 배치될 수 있다. 일 실시 예에 따르면, 배터리는 하우징의 내부에 형성된 공간에 수용되어 PCB와 전기적으로 연결될 수 있다. 예를 들어, 하우징의 내부에는 금속 부재 또는 사출 부재에 의해 일정한 공간이 형성될 수 있으며, 상기 일정한 공간에 배터리가 수용될 수 있다. 도 4는 일 실시 예에 따른, 전자 장치의 내부를 도시한다. 일 실시 예에 따르면, 도 4는 전자 장치의 내부에 배치된 안테나 조립체, 및 PCB을 도시한다. 일 실시 예에 따르면, 안테나 조립체는 전자 장치의 내부에 배치되어 PCB, 및 하우징과 연 결될 수 있다. 일 예에서, 안테나 조립체는 전자 장치의 내부에 배치되어 PCB, 및 하우징 과 전기적으로 연결될 수 있다. 예를 들어, 안테나 조립체의 일단은 PCB와 전기적으로 연결되고, 안 테나 조립체의 타단은 하우징의 도전성 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 안테나 조립체는 도전성 부재(conductive member, 410), 도전성 연결 부재 (conductive connect member, 430), 및 체결 부재(fastening member, 420)를 포함할 수 있다. 일 실시 예에 따르면, 도전성 부재는 안테나 방사를 위한 전기적 경로 또는 안테나 방사체로 이용될 수 있 다. 예를 들어, 무선 통신 회로는 도전성 부재를 이용하여 하우징의 일부를 안테나 방사체로 이용할 수 있다. 또 다른 예를 들어, 무선 통신 회로는 도전성 부재를 안테나 방사체로 이용할 수 있다. 일 실시 예에 따르면, 도전성 부재는 하우징의 측면(110C) 가장자리와 인접한 영역에 배치될 수 있다. 일 예에서, 도전성 부재의 일부는 측면(110C) 가장자리의 도전성 부분과 인접한 영역에 배치되 어, 도전성 부재의 상기 일부는 도전성 부분과 물리적으로 연결될 수 있다. 예를 들어, 도전성 부재의 일부는 하우징의 측면(110C) 가장자리의 도전성 부분과 체결 부재에 의해 결합됨으로써 물리적으로 연결될 수 있으나 이에 한정하지 않는다. 다른 예를 들어, 도전성 부재의 다른 일부는 하우징 의 측면(110C) 가장자리와 이격되며 도전성 부분과 물리적으로 연결되지 않을 수 있다. 일 실시 예에 따르면, 도전성 연결 부재에 의해 도전성 부재는 무선 통신 회로와 연결될 수 있다. 일 예에서, 도전성 연결 부재가 PCB와 도전성 부재를 연결시킴으로써, 도전성 부재는 PCB 상에 배치된 무선 통신 회로와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 연결 부재는 하우징의 측면(110C) 가장자리와 인접한 전자 장치의 내부에 배치될 수 있다. 일 예에서, 도전성 연결 부재는 하우징의 측면(110C) 가장자리를 따라 배치 될 수 있다. 예를 들어, 도전성 연결 부재는 PCB에서부터 하우징의 측면(110C) 가장자리를 따라 제1 방향(예: +(y)방향)으로 연장되다가, 하우징의 측면(110C) 가장자리에 형성된 곡면을 따라 제1 방향에 수직한 제2 방향(예: +(x)방향)으로 굽어져 연장될 수 있다. 일 실시 예에 따르면, 도전성 연결 부재는 FRC(flexible radio frequency cable)로 형성될 수 있으나, 이 에 한정하지 않는다. 예를 들어, 도전성 연결 부재는 FPCB(flexible printed circuit board)로 형성될 수 있다. 일 실시 예에 따르면, 체결 부재는 도전성 부재와 하우징의 도전성 부분을 연결시킬 수 있 다. 예를 들어, 체결 부재는 도전성 부재의 일부, 및 도전성 부분의 일부에 배치됨으로써 도전 성 부재와 도전성 부분의 일부를 연결시킬 수 있다. 일 실시 예에 따르면, 무선 통신 회로는, 안테나 조립체의 도전성 연결 부재를 통하여, 도전성 부재 의 일부에 급전할 수 있다. 일 예에서, 무선 통신 회로는, 도전성 연결 부재를 통하여 도전성 부재 의 일부에 급전함으로써, 도전성 연결 부재, 도전성 연결 부재와 전기적으로 연결된 도전성 부 재, 및 도전성 부재와 전기적으로 연결된 하우징의 도전성 부분을 포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 도전성 부재는 제1 도전성 부재, 및 제1 도전성 부재와 인접한 제2 도전 성 부재를 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로는, 제1 도전성 부재 및 제2 도전성 부재를 지정된 신호를 송신 및/또는 수신 위한 전기적 경로로 이용할 수 있다. 예를 들어, 무선 통신 회로는, 도전성 연결 부재를 통 하여 제2 도전성 부재에 급전함으로써, 도전성 연결 부재, 제1 도전성 부재, 하우징의 도 전성 부분, 및 제1 도전성 부재를 포함하는 제1 전기적 경로에 기반하여, 지정된 제1 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 상기 지정된 제1 주파수는 600 MHz 내지 900MHz 이내의 범위의 주파수 대역을 포함할 수 있으나, 이에 한정하지 않는다. 다른 예를 들어, 상기 지정된 제1 주파수는 1,800 MHz 내지 2,300MHz 이내의 범 위의 주파수 대역을 포함할 수 있다. 또 다른 일 실시 예에 따르면, 도전성 부재는 제2 도전성 부재와 이격되어 배치되는 제3 도전성 부재 를 더 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제3 도전성 부재를 안테나 방사체로 이용할 수 있다. 예를 들어, 무선 통신 회로는, 도전성 연결 부재를 통하여 제3 도전성 부재에 급전함으로써, 도전성 연결 부재 , 및 제3 도전성 부재를 포함하는 제2 전기적 경로에 기반하여, 지정된 제2 주파수 대역의 신호를 송 신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 상기 지정된 제2 주파수는 2,300 MHz 내지 2,700MHz 이내의 범위의 주파수 대역을 포함할 수 있으나, 이에 한정하지 않는다. 일 예에서, 제1 전기적 경로 및 제2 전기적 경로는 루프 안테나에 해당될 수 있으나, 이에 한정하지 않는다. 도 5는 일 실시 예에 따른, 안테나 조립체를 도시한다. 일 실시 예에 따르면, 도 5는 도 4의 안테나 조립체만을 도시한다. 일 실시 예에 따르면, 안테나 조립체의 도전성 부재는 체결 부재에 의해 하우징의 도전성 부분과 연결될 수 있다. 예를 들어, 안테나 조립체의 도전성 부재는 체결 부재에 의해 하 우징의 도전성 부분과 전기적으로 연결될 수 있다. 도전성 부재가 도전성 부분과 전기적으 로 연결됨으로써, 전자 장치는 하우징의 도전성 부분을 안테나 방사체로 이용할 수 있다. 일 실시 예에 따르면, 안테나 조립체는 도전성 부재, 도전성 부재와 연결된 도전성 연결 부재 , 및 체결 부재를 포함할 수 있다. 일 실시 예에 따르면, 도전성 부재는 하우징의 도전성 부분과 접촉되는 접촉 영역(contact area, 510), 및 연결 영역을 포함할 수 있다. 일 실시 예에 따르면, 접촉 영역은 굴곡진 영역으로 형성될 수 있다. 일 예에서, 접촉 영역에는 상기 굴곡진 영역이 테두리를 형성하는 제1 홀을 포함할 수 있다. 예를 들어, 접촉 영역의 굴곡진 영역은 서로 다른 높이 차이를 가지는 부분들로 형성되고, 상기 높이 차이를 가지는 부분들에 의해 제1 홀이 형성 될 수 있다. 일 실시 예에 따르면, 서로 다른 높이 차이를 가지는 접촉 영역의 형상은 도 6 내지 도 11에서 상세히 후 술하기로 한다. 일 실시 예에 따르면, 연결 영역은 접촉 영역에서 연장된 영역으로 형성될 수 있다. 일 예에서, 연결 영역은 접촉 영역의 일부에서 연장되어 도전성 연결 부재와 연결되는 영역으로 형성될 수 있다. 예를 들어, 연결 영역은 접촉 영역의 일부에서 연장되고, 연결 영역의 일부가 구부러지며 도전 성 연결 부재의 일면과 대면할 수 있다. 연결 영역의 일부가 도전성 연결 부재의 일면과 대면함 으로써 연결 영역을 포함하는 도전성 부재는 도전성 연결 부재와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 하우징의 도전성 부분은 제2 홀(미도시)을 포함할 수 있다. 일 예에서, 제2 홀 은 접촉 영역의 제1 홀과 대응되는 홀(hole)로 형성될 수 있다. 일 예에서, 상기 제2 홀은 제1 홀 과 일렬로 정렬될 수 있다. 예를 들어, 제1 홀 및 상기 제2 홀은 전자 장치의 전면을 향하는 제 1 방향(예: +(z)방향)으로 일렬로 정렬될 수 있다. 일 실시 예에 따르면, 체결 부재는 전자 장치의 내부에 배치된 부재들을 고정하는 부재로 형성될 수 있다. 예를 들어, 체결 부재는 전자 장치의 내부에 배치된 부재들을 하우징의 도전성 부분(30 1)에 고정시키는 체결 부재로 형성될 수 있다. 일 실시 예에 따르면, 체결 부재는 도전성 부재의 제1 홀 및 도전성 부분의 제2 홀에 배치 될 수 있다. 체결 부재가 각각의 홀에 배치됨으로써, 체결 부재는 도전성 부재를 하우징의 도전성 부분에 고정시킬 수 있다. 예를 들어, 제1 홀 및 상기 제2 홀이 상기 제1 방향(예: +(z)방 향)으로 일렬로 정렬됨에 따라, 체결 부재는 제1 홀 및 상기 제2 홀을 제1 방향(예: +(z)방향)으로 관통할 수 있다. 일 실시 예에 따르면, 상기 체결 부재가 상기 제1 방향으로 관통함으로써, 체결 부재 는 도전성 부재를 하우징의 도전성 부분에 고정시킬 수 있다. 일 실시 예에 따르면, 체결 부재는 나사 구조로 형성될 수 있다. 예를 들어, 적어도 일부가 나사산으로 형 성된 스크류(screw)로 형성될 수 있으나, 이에 한정하지 않는다. 일 실시 예에 따르면, 체결 부재가 도전성 부재를 하우징의 도전성 부분에 고정시킴으로써, 도전성 부재는 하우징의 도전성 부분과 연결될 수 있다. 예를 들어, 도전성 부 재의 접촉 영역이 하우징의 도전성 부분과 접촉됨으로써, 도전성 부재는 하우징(11 0)의 도전성 부분과 전기적으로 연결될 수 있다. 예를 들어, 접촉 영역의 굴곡진 일부만이 하우징 의 도전성 부분과 접촉된 경우에도, 도전성 부재는 도전성 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 연결 부재는 도전성 부재와 PCB를 연결시킬 수 있다. 예를 들어, 도전성 연결 부재의 일단의 일부 영역은 PCB와 연결되고, 타단의 일부 영역은 도전성 부재 와 연결될 수 있다. 일 실시 예에 따르면, 도전성 연결 부재가 PCB와 도전성 부재를 연결시킴으로써, 도전성 부재 는 PCB와 전기적으로 연결될 수 있다. 예를 들어, 도전성 부재는 PCB상에 배치된 무선 통 신 회로와 전기적으로 연결될 수 있다.일 예에서, 도전성 부재가 무선 통신 회로와 전기적으로 연결됨으로써, 도전성 부재는 하우징의 도전성 부분을 안테나 방사체로 이용하는 구조의 전기적 경로로 이용될 수 있다. 다른 일 예에서, 도전성 부재가 무선 통신 회로와 전기적으로 연결됨으로써, 도전성 부재 자체가 안테나 방사체로 이용될 수 있다. 도 6은 일 실시 예에 따른, 도전성 부재를 도시한다. 일 실시 예에 따르면, 도 6은 도 5의 안테나 조립체의 도전성 부재 중 하나의 도전성 부재를 도 시한다. 예를 들어, 도 6은 도 5의 안테나 조립체를 A방향으로 바라보았을 때의 안테나 조립체의 단 면을 도시한다. 일 실시 예에 따르면, 체결 부재가 하우징의 도전성 부분에 완전 체결되지 않은 경우에도, 도전 성 부재는 굴곡진 접촉 영역에 의하여 하우징의 도전성 부분과 접촉될 수 있다. 예를 들어, 체결 부재가 도전성 부분의 제2 홀에 기울어져 삽입됨으로써 체결 부재가 하우징 의 도전성 부분에 불완전 안착된 경우에도, 도전성 부재의 접촉 영역의 굴곡진 일부가 하 우징의 일부와 접촉될 수 있다. 일 실시 예에 따르면, 접촉 영역의 상기 굴곡진 일부가 하우징의 도전성 부분과 접촉됨으로써, 도전성 부재는 하우징의 도전성 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 부재의 접촉 영역은 제1 접촉 부분, 및 제2 접촉 부분을 포 함할 수 있다. 일 실시 예에 따르면, 제1 접촉 부분은 상부면(예: -(z)방향을 향하는 면)이 체결 부재의 일부와 접 촉되는 면으로 형성될 수 있다. 일 실시 예에 따르면, 제2 접촉 부분은 하부면(예: +(z)방향을 향하는 면)이 하우징의 도전성 부분의 일부와 접촉되는 면으로 형성될 수 있다. 일 실시 예에 따르면, 제1 접촉 부분, 및 제2 접촉 부분은 서로 다른 높이를 가지고 형성될 수 있다. 일 예에서, 제1 접촉 부분은 A축을 기준으로 제1 높이(H1)를 가질 수 있다. 다른 일 예에서, 제1 접촉 부 분은 접촉 영역과 대면하는 도전성 부분의 일면을 기준으로 제1 높이(H1)를 가질 수 있다. 일 실시 예에 따르면, 제1 높이(H1)는 0.25mm일 수 있으나, 이에 한정하지 않는다. 다른 예를 들어, 제1 높이 (H1)는 0.25mm보다 높을 수 있다. 또 다른 예를 들어, 제1 높이(H1)는 0.25mm보다 낮을 수 있다. 일 예에서, 제2 접촉 부분은 A축을 기준으로 제1 높이(H1)보다 작은 제2 높이(H2)를 가질 수 있다. 다른 일 예에서, 제1 접촉 부분은 대면하는 도전성 부분의 일면을 기준으로 제1 높이(H1)보다 낮은 제2 높 이(H2)를 가질 수 있다. 일 실시 예에 따르면, 적어도 하나의 제1 접촉 부분과 적어도 하나의 제2 접촉 부분이 굴곡 지며 연 결되어 접촉 영역은 굴곡진 면으로 형성될 수 있다. 예를 들어, 제1 높이(H1)를 가지는 적어도 하나의 제1 접촉 부분은 굴곡 지며 연장되어 제2 높이(H2)를 가지는 적어도 하나의 제2 접촉 부분과 물리적으로 연결될 수 있다. 예를 들어, 접촉 영역은 적어도 하나의 제1 접촉 부분 및 적어도 하나의 제2 접촉 부분에 의해 트위스트 구조(twist-structure)로 형성될 수 있다. 또 다른 예를 들어, 접촉 영역은 적 어도 하나의 제1 접촉 부분, 및 적어도 하나의 제2 접촉 부분에 의해 굴곡진 구조(curved- structure)로 형성될 수 있다. 일 실시 예에 따르면, 적어도 하나의 제1 접촉 부분은 두개의 제1 접촉 부분(641, 643)으로 형성되고, 적 어도 하나의 제2 접촉 부분은 두개의 제2 접촉 부분(642, 644)으로 형성될 수 있다. 도 6을 참고하면 일 실시 예에 따른 제1 접촉 부분은 제1 부분, 제3 부분을 포함하고, 제2 접촉 부분은 제2 부분, 및 제4 부분을 포함할 수 있다. 일 예에서, 제1 부분 및 제3 부분(64 3)은 제1 높이(H1)를 가질 수 있다. 일 예에서, 제2 부분 및 제4 부분은 제2 높이(H2)를 가질 수 있다. 일 실시 예에 따르면, 제2 부분 은 제1 부분 및 제3 부분에서 제1 방향(예: +(z)방향)으로 굴곡 지며 연장되어 형성될 수 있다. 일 실시 예에 따르면, 제2 부분과 반대되는 영역에 형성된 제4 부분 은 제1 부분 및 제3 부분에서 제1 방향(예: +(z)방향)으로 굴곡지며 연장되어 형성될 수 있다. 일 실시 예에 따르면, 제1 부분과 제3 부분은 상기 제1 홀의 임의의 점을 기준으로 서로 대향하 도록 형성될 수 있다. 일 예에서, 제1 부분과 제3 부분은 제1 홀의 임의의 점을 기준으로대칭으로 형성될 수 있으나 이에 한정하지 않는다. 다른 예를 들어, 제1 부분과 제3 부분은 제1 홀 의 임의의 점을 기준으로 비대칭으로 형성될 수 있다. 대칭 또는 비대칭으로 형성되는 부분은 제1 부분 및 제3 부분을 예시로 들었으나, 이에 한정하지 않 는다. 예를 들어, 제2 부분과 제4 부분은 제1 홀의 임의의 점을 지나가는 축으로부터 대칭 으로 형성될 수 있다. 일 실시 예에 따르면, 접촉 영역은 제1 홀을 포함할 수 있다. 일 예에서, 제1 홀은 제1 접촉 부 분, 제2 접촉 부분에 의해 형성된 굴곡진 테두리를 가지며 형성될 수 있다. 예를 들어, 제1 부분 , 제2 부분, 제3 부분, 및 제4 부분에 의해 둘러싸여 빈공간이 형성되고, 상기 형성된 빈 공간에 제1 홀이 형성될 수 있다. 일 실시 예에 따르면, 체결 부재가 제1 홀을 통과하여 도전성 부분에 삽입됨으로써, 도전성 부 재는 도전성 부분상에 고정될 수 있다. 일 실시 예에 따르면, 도전성 부재의 접촉 영역이 서로 다른 높이를 가지는 부분으로 형성됨으로써 체결 부재가 도전성 부분에 일부만 삽입된 경우에도, 도전성 부재는 도전성 부분과 접촉될 수 있다. 예를 들어, 체결 부재가 하우징의 도전성 부분에 형성된 제2 홀에 기울어져 삽입 된 경우에도, 도전성 부재는 굴곡진 접촉 영역에 의해 도전성 부분과 접촉될 수 있다. 예를 들 어, 체결 부재는 도전성 부분의 제2 홀에 불완전 삽입된 경우에도 경우, 제2 높이(H2)를 가지는 제2 접촉 부분의 제2 부분 및 제4 부분의 하부면(예: + (z)방향을 향하는 면)은 하우징의 도전성 부분에 접촉될 수 있다. 일 실시 예에 따르면, 도전성 부재의 제2 접촉 부분의 일부가 도전성 부분과 접촉됨으로써, 도 전성 부재는 도전성 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 부재가 도전성 부분과 전기적으로 연결됨으로써, 도전성 부재는 지정된 주파수 대역의 신호를 송신 및/또는 수신하기 위한 전기적 경로로 이용될 수 있다. 예를 들어, 무선 통 신 회로는, 도전성 연결 부재와 연결된 도전성 부재에 급전함으로써, 도전성 연결 부재, 도전성 부재, 및 도전성 부분을 포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또 는 수신할 수 있다. [표 1]은 A축을 기준으로 체결 부재가 도전성 부분의 제2 홀에 미 삽입된 높이에 따른 도전성 부재의 저항 값을 나타낸다. 표 1 상태 기준값평평한 구조 0.2mm평평한 구조 0.25mm높이 차 구조 0.15mm높이 차 구 조 0.2mm높이 차 구 조 0.25mm Band 1TRP15.24 13.75 5.55 15.27 15.17 15.02 Band 2TRP15.59 14.26 5.34 15.6 15.54 15.37 Band 3TRP17.01 16.86 16.94 16.91 16.93 16.86 Band 4TRP17.74 17.42 15.45 17.71 17.73 17.64 저항값 [Ω]0.1 3.2 Open 0.1 0.2 0.3 [표 1]의 세로축 범례는 주파수 대역(band)별 안테나의 최대 출력 값(TRP, total radiation power), 및 측정된 저항 값을 의미하는 범례이다. 또한, 가로축 범례는 접촉 영역의 구조 별 체결 부재의 불완전 안착된 높이를 의미한 범례이다. 도전성 부재의 저항 값이 기준 값의 저항 값과 차이가 증가하는 경우, 안테나 성 능이 저하될 수 있다. 일 실시 예에 따르면, 기준 값은, 체결 부재가 완전히 삽입되어 도전성 부재와 도전성 부분이 완전히 대면한 상태일 때, 측정된 도전성 부재의 저항 값을 나타낸다. 일 실시 예에 따르면, 평평한(flat) 구조로 형성된 접촉 영역을 포함하는 도전성 부재의 경우, 체결 부재 의 불완전 안착된 높이가 증가함에 따라 상기 도전성 부재에 측정되는 저항 값이 증가할 수 있다. 예를 들어,체결 부재의 불완전 안착된 높이가 0.25mm인 경우, 측정된 저항 값이 개방(open) 상태로서, 상기 도전성 부재 및 도전성 부분에 전기적 신호가 흐르지 않을 수 있다. 일 실시 예에 따르면, 서로 다른 높이를 가지는 구조로 형성된 접촉 영역을 포함하는 도전성 부재의 경우, 체결 부재의 불완전 안착된 높이가 0.25mm이하인 경우, 도전성 부재에 측정되는 저항 값은 기 준 값과 실질적으로 큰 차이를 가지지 않을 수 있다. 일 예에서, 체결 부재의 불완전 안착된 높이가 0.25mm이하인 경우의 도전성 부재에 측정되는 저항 값은 체결 부재가 완전 삽입된 경우의 도전성 부 재에 측정되는 저항 값과 실질적으로 동일할 수 있다. 예를 들어, 서로 다른 높이를 가지는 구조로 형성된 접촉 영역을 포함하는 도전성 부재의 경우, 체결 부재와 도전성 부분의 불완전 안착된 높 이가 0.25mm인 경우에, 측정된 저항 값이 0.3 Ω으로서 기준 저항 값인 0.1 Ω과 실질적으로 큰 차이를 가지지 않을 수 있다. 일 실시 예에 따른 [표 1]을 참고하면, 체결 부재가 도전성 부분의 제2 홀에 불완전 안착되더라 도, 굴곡진 접촉 영역이 형성된 도전성 부재는 체결 부재가 완전 삽입된 경우와 실질적으로 동 일한 안테나 성능을 가질 수 있다. 예를 들어, 체결 부재가 도전성 부분의 제2 홀에 불완전 안 착되더라도 접촉 영역의 적어도 하나의 제2 접촉 부분이 도전성 부분의 일면과 대면함으로써 도 전성 부재는 도전성 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 부재의 적어도 일부는 탄성이 있는 물질(material)로 형성될 수 있다. 예를 들어, 도전성 부재의 접촉 영역은 SUS(stainless use steel)로 형성될 수 있으나, 이에 한정하지 않 는다. 다른 예를 들어, 도전성 부재는 구리(copper)로 형성될 수 있다. 일 실시 예에 따르면, 도전성 부재가 탄성이 있는 물질로 형성됨으로써 체결 부재가 도전성 부분 의 제2 홀에 완전 삽입된 경우에 도전성 부재는 평평하게 펴질 수 있다. 예를 들어, 체결 부재 가 완전히 삽입된 경우, 접촉 영역의 탄성력에 의해 접촉 영역은 평평한 형태로 펼쳐질 수 있다. 다른 일 실시 예에 따르면, 체결 부재가 불완전 체결되거나 일부만 삽입된 경우, 접촉 영역은 굴곡진 형태로 형성됨에 따라 도전성 부재의 접촉 영역의 일부는 도전성 부분과의 접촉을 유지할 수 있 다. 예를 들어, 도 6을 참고하면, 체결 부재가 일부만 삽입된 경우에도 접촉 영역의 제2 접촉 부분 이 도전성 부분과 접촉될 수 있다. 일 실시 예에 따르면, 접촉 영역의 제2 접촉 부분의 적어도 일부가 도전성 부분과 접촉됨으로써 도전성 부재와 도전성 부분은 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 탄성이 있는 부재로 형성됨으로써, 도전성 부재가 평평하게 펴지는 경우에도 도전성 부재는 파손되지 않을 수 있다. 일 실시 예에 따르면, 도전성 부재가 접촉 영역에 의해 도전성 부분과 전기적으로 연결됨으로써, 도전성 부재는 지정된 주파수 대역의 신호를 송신 및/또는 수신하기 위한 전기적 경로로 이 용될 수 있다. 일 실시 예에 따르면, 하우징의 도전성 부분은 오목부(recess, 630)를 포함할 수 있다. 예를 들어, 하우징의 도전성 부분의 오목부에 도전성 부재의 일부 및/또는 체결 부재가 적어도 일부 배치될 수 있다. 하우징의 도전성 부분에 오목부가 포함되고, 도전성 부재의 적어도 일부 및/또는 체결 부재가 배치되는 경우, 오목부에 도전성 부재의 적어도 일부 및/또는 체결 부재가 배치되지 않는 구조에 비해 하우징의 두께가 감소될 수 있다. 도 7은 일부 실시 예에 따른, 도전성 부재를 도시한다. 일 실시 예에 따르면, 도 7의 도전성 부재는 도 6의 도전성 부재와 달리 접촉 영역의 일부가 경 사지며 형성될 수 있다. 일 실시 예에 따르면, 체결 부재가 도전성 부분에 불완전 안착된 경우에도 경사지며 형성된 접촉 영 역의 일부에 의해, 도전성 부재는 도전성 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 부재의 접촉 영역은 제1 접촉 부분 및 제2 접촉 부분을 포함 할 수 있다. 일 예에서, 제1 접촉 부분은 A축을 기준으로 제1 높이(H1)를 가질 수 있다. 일 예에서, 제1 접촉 부분 은 도전성 부분의 일면을 기준으로 일정한 제1 높이(H1)를 가지는 평평한 영역으로 형성될 수 있다. 예를 들어, 제1 접촉 부분의 일면은 체결 부재와 접촉할 수 있다. 예를 들어, 제1 접촉 부분의 상부면은 체결 부재와 대면할 수 있다 일 예에서, 제2 접촉 부분은 가변 하는 높이를 가지는 접촉 부분으로 형성될 수 있다. 예를 들어, 제2 접 촉 부분은 제1 접촉 부분에서부터 기울어져 연장되는 영역으로 형성될 수 있다. 예를 들어, 제2 접촉 부분은 제1 접촉 부분에서부터 도전성 부분의 일면을 기준으로 제1 방향(예: P방향)을 향하여 제2 높이(H2)가 점진적으로 감소하는 영역으로 형성될 수 있다. 예를 들어, 제2 접촉 부분은 제1 접촉 부 분에서부터 A축을 향하여 연장될수록 제2 높이(H2)가 점진적으로 감소하는 영역으로 형성될 수 있다. 일 실시 예에 따르면, 체결 부재가 도전성 부재 및 도전성 부분에 삽입될 때, 제2 접촉 부분 의 하부면의 적어도 일부가 도전성 부분에 접촉될 수 있다. 일 실시 예에 따르면, 체결 부재가 도전성 부분의 제2 홀(미도시)에 불완전 체결된 경우에도, 제2 높 이(H2)를 가지는 제2 접촉 부분의 일단은 하우징의 도전성 부분에 접촉될 수 있다. 일 실시 예 에 따르면, 제2 높이(H2)를 가지는 제2 접촉 부분의 일단은 하우징의 도전성 부분에 접촉됨으로 써, 도전성 부재는 도전성 부분과 전기적 연결될 수 있다. 일 실시 예에 따르면, 도전성 부재는 도전성 부분과 전기적으로 연결됨으로써, 도전성 부재는 지정된 주파수 대역의 신호를 송신 및/또는 수신하기 위한 전기적 경로로 이용될 수 있다. 예를 들어, 무선 통 신 회로는, 도전성 연결 부재와 연결된 도전성 부재에 급전함으로써, 도전성 연결 부재, 도전성 부재, 및 도전성 부분을 포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또 는 수신할 수 있다. 도 8은 일부 실시 예에 따른, 도전성 부재를 도시한다. 도 8의 도전성 부재는, 도 6의 도전성 부재 및 도 7의 도전성 부재와 달리, 완전한 홀이 형성되 지 않는 접촉 영역을 포함할 수 있다. 일 실시 예에 따르면, 도전성 부재의 접촉 영역이 완전한 홀로 형성되지 않음으로써, 도전성 부재 는 체결 부재를 이용한 체결에 의한 반발력을 조절할 수 있는 구조로 형성될 수 있다. 일 실시 예에 따르면, 도전성 부재의 접촉 영역은 하나의 제1 접촉 부분, 및 하나의 제2 접촉 부분을 포함할 수 있다. 일 실시 예에 따르면, 접촉 영역은 제3 접촉 부분을 더 포함할 수 있다. 일 예에서, 제3 접촉 부분 은 평평한(flat) 형태로 형성될 수 있다. 예를 들어, 제3 접촉 부분은 A축을 기준으로 제3 높이(H3) 를 가질 수 있다. 예를 들어, 제3 접촉 부분은 도전성 부분의 일면을 기준으로 일정한 제3 높이(H3) 를 가지고 형성될 수 있다. 일 실시 예에 따르면, 제1 접촉 부분은 제3 접촉 부분의 일단에서 연장될 수 있다. 일 예에서, 제1 접촉 부분은 제3 접촉 부분의 일단에서 기울기가 점진적으로 증가하며 기울어져 연장될 수 있다. 예 를 들어, 제1 접촉 부분은, 제3 접촉 부분의 일단에서부터, 도전성 부분의 일면을 기준으로 점 진적으로 높이가 증가하는 제1 높이(H1)를 가지고 형성될 수 있다. 예를 들어, 제1 접촉 부분은, 제3 접촉 부분의 일단에서부터, A축을 기준으로 점진적으로 높이가 증가하는 제1 높이(H1)를 가지고 형성될 수 있다. 일 실시 예에 따르면, 제2 접촉 부분은 제3 접촉 부분의 타단에서 연장될 수 있다. 일 예에서, 제2 접촉 부분은 제3 접촉 부분의 타단에서 기울기가 점진적으로 감소하며 기울어져 연장될 수 있다. 예 를 들어, 제2 접촉 부분은, 제3 접촉 부분의 타단에서부터, 도전성 부분의 일면을 기준으로 점 진적으로 높이가 감소하는 제2 높이(H2)를 가지고 형성될 수 있다. 예를 들어, 제2 접촉 부분은, 제3 접촉 부분의 타단에서부터, A축을 기준으로 점진적으로 높이가 감소하는 제2 높이(H2)를 가지고 형성될 수 있다. 일 실시 예에 따르면, 도 6의 접촉 영역 및 도 7의 접촉 영역과 달리, 도 8의 접촉 영역의 제1 접촉 부분과 제2 접촉 부분은 물리적으로 단절될 수 있다. 일 예에서, 제1 접촉 부분과 제2 접 촉 부분이 물리적으로 단절됨으로써, 제1 홀은 완전한 원으로 형성되지 않을 수 있다. 예를 들어, 접촉 영역은 일부가 개구 영역을 포함하는 오픈 루프(open-loop) 형상으로 형성될 수 있다. 일 실시 예에 따르면, 체결 부재에 의해 도전성 부재가 도전성 부분에 체결될 때, 접촉 영역 이 오픈 루프(open-loop)형상은 도전성 부재의 접촉 영역에 내부 응력이 집중되는 것을 감소시 킬 수 있다. 예를 들어, 체결 부재가 회전될 때, 오픈 루프(open-loop)형상으로 된 접촉 영역이 체결 부재에 걸리지 않음으로써 접촉 영역의 내부에는 응력이 집중되지 않을 수 있다. 일 실시 예에 따르면, 오픈 루프(open-loop)형상으로 된 접촉 영역의 내부에 응력이 집중되는 것을 감소시 킴으로써, 도전성 부재의 내구성을 확보할 수 있다. 일 실시 예에 따르면, 도전성 부재의 내구성이 확보됨으로써 안테나 성능의 품질이 향상될 수 있다. 도 9는 일부 실시 예에 따른, 도전성 부재를 도시한다. 일 실시 예에 따르면, 도 9의 전자 장치는 도 8의 도전성 부재를 포함하는 전자 장치와 달리 도 전성 지지 부재(support member, 930)를 더 포함할 수 있다. 일 실시 예에 따르면, 전자 장치가 도전성 지지 부재를 더 포함함으로써, 도전성 부재는 도전성 지지 부재를 포함하지 않는 경우보다 하우징의 도전성 부분과 전기적으로 더 안정적인 체결이 될 수 있다. 일 실시 예에 따르면, 전자 장치가 도전성 지지 부재를 더 포함함으로써, 도전성 부재는 도전성 지지 부재를 포함하지 않는 경우보다 하우징의 도전성 부분과 물리적으로 강하게 체결될 수 있 다. 일 실시 예에 따르면, 도전성 부재는 도전성 지지 부재를 더 포함할 수 있다. 일 예에서, 도전성 지 지 부재는 도전성 부재의 접촉 영역의 일면에 배치될 수 있다. 예를 들어, 도전성 지지 부재 는 도전성 부재의 접촉 영역의 제1 방향(예: +(z)방향)을 향하는 일면에 배치될 수 있다. 예를 들어, 도전성 지지 부재는, 도전성 부재가 체결 부재에 의해 하우징의 도전성 부분에 체결될 때, 도전성 부재와 도전성 부분사이에 배치될 수 있다. 일 실시 예에 따르면, 도전성 지지 부재는 도전성 부재에 부착될 수 있다. 일 예에서, 도전성 지지 부재는 도전성 부재의 접촉 영역의 일면에 부착될 수 있다. 예를 들어, 도전성 부재의 접 촉 영역은 제1 접촉 부분, 및 제1 접촉 부분에서 굴곡지며 연장되는 제2 접촉 부분을 포함 할 수 있으며, 도전성 지지 부재는 도전성 접착 부재에 의해 제2 접촉 부분에 부착될 수 있다. 일 실시 예에 따르면, 도전성 접착 부재는 용접 부재를 포함할 수 있다. 일 예에서, 도전성 지지 부재 와 도전성 부재는 용접 부재에 의하여 전기적으로 연결될 수 있다. 예를 들어, 제2 접촉 부분의 일 영역을 용접 부재를 이용하여 도전성 지지 부재의 일 영역과 용접함으로써, 도전성 부재는 도전성 지지 부재와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 접착 부재는 도전성 파우더를 포함할 수 있다. 예를 들어, 제2 접촉 부분 의 일 영역과 도전성 지지 부재 사이에 도전성 파우더를 배치시킴으로써, 도전성 부재는 도전성 지지 부재와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 도전성 부재와 도전성 지지 부재가 전기적으로 연결됨으로써, 도전성 부재 는 도전성 지지 부재를 포함하지 않는 경우보다 하우징의 도전성 부분과 전기적으로 더 안 정적인 체결이 될 수 있다. 예를 들어, 도전성 지지 부재와 형성되지 않아 접촉 영역의 제2 접촉 부분만이 도전성 부분과 전기적으로 연결되는 것과 달리, 도전성 지지 부재의 일면 전체가 도전성 부분과 대면함으로써, 도전성 부재는 도전성 부분과 전기적으로 안정적인 체결이 될 수 있다. 일 실시 예에 따르면, 도전성 지지 부재는 일정한 두께를 가지는 플레이트로 형성될 수 있다. 일 예에서, 도전성 지지 부재는 평평한(flat) 형태의 플레이트로 형성될 수 있다. 일 실시 예에 따르면, 도전성 지지 부재는 평평한(flat) 형태의 플레이트로 형성됨으로써, 도전성 지지 부 재와 도전성 부분의 접촉 면이 증가할 수 있다. 일 실시 예에 따르면, 도전성 지지 부재와 도전 성 부분의 접촉 면이 증가함으로써, 도전성 부재는 도전성 부분과 전기적으로 안정적인 체결이 될 수 있다. 일 실시 예에 따르면, 도전성 부재와 도전성 부분의 전기적 연결 관계가 증가함으로써, 도전성 부재 와 도전성 부분사이에 형성되는 저항 값이 증가하지 않아 안테나 성능의 열화가 발생하지 않을 수 있 다. 또한, 도전성 지지 부재가 도전성 부재와 용접됨으로써, 도전성 지지 부재를 포함하는 도전성 부재는 도전성 지지 부재가 제외된 도전성 부재에 보다 변형 또는 파손에 대한 내구성이 강할 수 있 다. 도 10은 일부 실시 예에 따른, 도전성 부재를 도시한다. 일 실시 예에 따르면, 도 10의 도전성 부재는 도 9의 도전성 부재와 달리 돌기(protrusion,1030)를 더 포함할 수 있다. 일 실시 예에 따르면, 도전성 부재가 돌기를 더 포함함으로써, 도전성 부재와 하우징의 도전성 부분의 전기적 연결관계는 돌기가 형성되지 않는 경우보다 더 안정적인 체결이 될 수 있다. 일 실시 예에 따르면, 도전성 부재의 접촉 영역은 제1 접촉 부분 및 제2 접촉 부분을 포함할 수 있다. 예를 들어, 제1 접촉 부분은 상부면(예: -(z)방향을 향하는 면)이 체결 부재의 일 부와 접촉되는 면으로 형성될 수 있다. 예를 들어, 제2 접촉 부분은 하부면(예: +(z)방향을 향하는 면)이 하우징의 도전성 부분의 일부와 접촉되는 면으로 형성될 수 있다. 일 실시 예에 따르면, 돌기는 도전성 부재의 일면에 형성될 수 있다. 일 예에서, 돌기는 도 전성 부재의 접촉 영역의 일면에 형성될 수 있다. 예를 들어, 돌기는 접촉 영역의 제2 접촉 부분의 상기 전자 장치의 전면을 향하는 일면에 형성될 수 있다. 예를 들어, 돌기는 제2 접촉 부분의 일면에서 제1 방향(예: +(z)방향)으로 돌출되어 형성될 수 있다. 일 실시 예에 따르면, 돌기가 형성됨으로써, 체결 부재가 불완전 안착된 경우에도, 도전성 부재 는 도전성 부분과 접촉될 수 있다. 예를 들어, 체결 부재가 도전성 부재의 제1 홀(예: 도 5의 511), 및 도전성 부분의 제2 홀(예: 도 6의 690)에 기울어져 삽입된 경우에도, 돌기에 의해 도전성 부재는 도전성 부분과 물리적으로 접촉될 수 있다. 일 실시 예에 따르면, 돌기에 의해 도전성 부재는 도전성 부분과 물리적으로 접촉됨으로써, 도전성 부재는 도전성 부분과 전기적으로 연결될 수 있다. 도전성 부재는 도전성 부분과 물리적으로 접촉됨으로써, 도전성 부재와 도전성 부분사이 에 형성되는 저항 값이 증가하지 않아 안테나 성능의 열화가 발생하지 않을 수 있다. 도 11은 일부 실시 예에 따른, 도전성 부재를 도시한다. 일 실시 예에 따르면, 도 11의 도전성 부재는 도 6의 도전성 부재와 달리 복수의 제1 접촉 부분 및 복수의 제2 접촉 부분 을 포함할 수 있다. 일 실시 예에 따르면, 복수의 제1 접촉 부분, 및 복수의 제2 접촉 부분이 형성됨으로써, 도전성 부 재는 도전성 부분과 전기적으로 더 강하게 형성될 수 있다. 일 실시 예에 따르면, 복수의 제1 접촉 부분은 체결 부재와 접촉되는 4개의 접촉 부분으로 형성될 수 있다. 일 실시 예에 따르면, 복수의 제2 접촉 부분은 도전성 부분과 접촉되는 4개의 접촉 부분으 로 형성될 수 있다. 일 실시 예에 따르면, 복수의 제2 접촉 부분이 4개의 제2 접촉 부분으로 형성됨으로써, 도전성 부재 는, 2개의 접촉 부분으로 형성된 도 6의 도전성 부재보다, 도전성 부분과 전기적으로 더 안정 적인 체결이 될 수 있다. 일 예에서, 체결 부재가 불완전 안착된 경우, 도전성 부재와 도전성 부분 의 접촉 부분이 증가함으로써 도전성 부재와 도전성 부분은 전기적으로 안전적인 체결이 될 수 있다. 예를 들어, 체결 부재와 홀이 형성된 방향에 기울어져 삽입된 경우에도, 도전성 부재의 4개의 제2 접촉 부분은 2개의 제2 접촉 부분으로 형성된 도전성 부재 보다 도전성 부분과 전기적으로 더 안정적인 체결이 될 수 있다. 일 실시 예에 따르면, 접촉 부분은 4개의 제1 접촉 부분 및 4개의 제2 접촉 부분이 포함하는 것을 예시로 들었으나, 이에 한정하지 않는다. 예를 들어, 접촉 부분은 6개의 제1 접촉 부분 및 6 개의 제2 접촉 부분을 포함할 수 있다.도 12는 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 12를 참조하면, 네트워크 환경에서 전자 장치(1201, 도 1의 100)는 제1 네트워크(예: 근거리 무 선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네 트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서 , 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈 , 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈 , 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로 세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘 발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비 휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서 (예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거 나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관 련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예 에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포 함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted Boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피 커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커 넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들 면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배 터리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있 다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예 에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블루투스, WiFi 다이렉트(wireless fidelity direct) 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워 크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈 은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중 입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍, 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 피크 데이터 레이트(peak data rate)(예: 20Gbps 이상), mMTC 실현을 위한 손실 커버리지(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 기판(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트 워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복 수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양 한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수 의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치(120 1)와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1202, 또는 1204) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(1202, 1204, 또는 1208) 중 하나 이상의 외부의 전자 장치들에 서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치 로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답 의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴 퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예 에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학 습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반 으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구 들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 추가적으로 또는 대체적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 다양한 실시 예에 따르면, 전자 장치는 전자 장치에 있어서, 적어도 일부가 도전성 부분으로 형성되는 하우징, 상기 전자 장치의 내부에 배치되는 PCB(printed circuit board), 접촉 영역을 포함하며 상기 접촉 영역의 적어 도 일부를 통하여 상기 하우징의 도전성 부분과 접촉하는 도전성 부재(conductive member), 상기 접촉 영역은 상기 체결 부재와 접촉하는 적어도 하나의 제1 접촉 부분, 및 상기 제1 접촉 부분으로부터 굴곡지게 연장되어 상기 도전성 부분과 접촉하는 적어도 하나의 제2 접촉 부분을 포함함; 및 상기 PCB와 상기 도전성 부재를 전기 적으로 연결하는 도전성 연결 부재(conductive connect member)를 포함하고, 상기 도전성 부재는 상기 하우징의 상기 도전성 부분에 고정되고, 상기 도전성 부재가 상기 하우징의 상기 도전성 부분에 고정될 때, 굴곡지게 연 장된 상기 제2 접촉 부분과 상기 도전성 부분의 접촉이 유지됨으로써, 상기 도전성 부재와 상기 하우징의 도전 성 부분은 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 상기 PCB 상에 배치되는 무선 통신 회로를 더 포함하고, 상기 무선 통신 회로는 상기 도 전성 연결 부재를 통하여 상기 도전성 부재와 전기적으로 연결되고, 상기 무선 통신 회로는, 상기 도전성 연결 부재를 통하여 상기 도전성 부재의 일부에 급전함으로써, 상기 도전성 연결 부재, 상기 도전성 부재, 및 상기 도전성 부재와 전기적으로 연결된 상기 하우징의 상기 도전성 부분을 포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 굴곡지며 형성된 상기 접촉 영역의 상기 제2 접촉 부분의 적어도 일부는 상기 접촉 영역 에서 발생하는 탄성력에 의해, 상기 도전성 부분과의 접촉을 유지함으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 상기 도전성 부재의 접촉 영역은 두개의 제1 접촉 부분, 및 두개의 제2 접촉 부분을 포함 하고, 상기 두개의 제1 접촉 부분은 상기 도전성 부재와 접촉하는 상기 도전성 부분의 일면을 기준으로 제1 높 이를 가지고, 상기 두개의 제2 접촉 부분은 상기 제1 높이보다 낮은 제2 높이를 가지고 상기 제1 접촉 부분에서 굴곡지며 연장될 수 있다. 일 실시 예에 따르면, 상기 도전성 부재의 접촉 영역은 상기 제1 접촉 부분 및 상기 제2 접촉 부분에 의해 형성 된 굴곡진 테두리를 가지는 제1 홀을 포함하고, 상기 두개의 제1 접촉 부분은 상기 제1 홀의 임의의 점을 기준 으로 서로 대향하도록 형성될 수 있다. 일 실시 예에 따르면, 상기 도전성 부재와 상기 하우징의 상기 도전성 부분을 고정시키는 체결 부재를 더 포함 하고, 상기 제1 접촉 부분의 상부면은 상기 체결 부재와 대면하고, 상기 제2 접촉 부분의 제2 높이는 크기가 점 진적으로 감소함으로써 상기 제2 접촉 부분의 하부면의 적어도 일부가 상기 하우징의 상기 도전성 부분과 접촉 할 수 있다. 일 실시 예에 따르면, 상기 도전성 부재는 평평한(flat) 형태의 제3 접촉 부분을 더 포함하고, 상기 제1 접촉 부분은 상기 제3 접촉 부분의 일단에서 연장되고, 상기 제2 접촉 부분은 상기 제3 접촉 부분의 타단에서 연장되 며, 상기 제1 접촉 부분과 상기 제2 접촉 부분은 물리적으로 단절될 수 있다. 일 실시 예에 따르면, 상기 제1 접촉 부분과 상기 제2 접촉 부분이 물리적으로 단절됨으로써, 상기 접촉 영역은 상기 제1 접촉 부분, 상기 제2 접촉 부분, 및 상기 제3 접촉 부분에 의해 형성된 굴곡진 테두리를 가지며, 일부 가 개구 영역인 오픈 루프 형상(open-loop shape)으로 형성된 제1 홀을 포함할 수 있다. 일 실시 예에 따르면, 상기 도전성 부재와 상기 하우징의 상기 도전성 부분을 고정시키는 체결 부재를 더 포함 하고, 상기 도전성 부재는 상기 접촉 영역에 부착되는 도전성 지지 부재(support member)를 더 포함하고, 상기 체결 부재가 상기 도전성 부재를 상기 하우징의 상기 도전성 부분에 고정시킬 때, 상기 도전성 지지 부재는 상 기 도전성 부재의 접촉 영역과 상기 도전성 부분 사이에 배치될 수 있다. 일 실시 예에 따르면, 상기 도전성 지지 부재의 일면은 도전성 접착 부재에 의해 상기 도전성 부재의 상기 접촉 영역의 상기 제2 접촉 부분과 접착될 수 있다. 일 실시 예에 따르면, 상기 접촉 영역의 상기 제2 접촉 부분 상에 상기 도전성 부분과의 접촉을 위한 돌기가 형 성될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 제1 접촉 부분은 복수의 제1 접촉 부분으로 형성되고, 상기 적어도 하나의 제2 접촉 부분은 복수의 제2 접촉 부분으로 형성될 수 있다. 일 실시 예에 따르면, 상기 도전성 부재는 제1 도전성 부재이며, 상기 제1 도전성 부재와 이격되어 배치되는 제 2 도전성 부재를 더 포함하고, 상기 PCB 상에 배치된 무선 통신 회로는 상기 도전성 연결 부재를 통하여 상기 제1 도전성 부재에 급전함으로써, 상기 도전성 연결 부재, 상기 하우징의 일부와 연결된 상기 제1 도전성 부재, 상기 하우징의 상기 도전성 부분, 및 상기 하우징의 다른 일부와 연결된 상기 제2 도전성 부재를 포함하는 전기 적 경로에 기반하여, 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 상기 도전성 부재는 상기 접촉 영역에 형성되는 제1 홀을 포함하고, 상기 하우징의 도전 성 부분은 상기 전자 장치의 전면을 향하는 방향으로 상기 제1 홀에 대응하여 일렬로 정렬된 제2 홀을 포함하고, 일렬로 정렬된 상기 제1 홀과 상기 제2 홀에 배치됨으로써, 상기 도전성 부재를 상기 하우징의 상기 도전성 부분에 고정시키는 체결 부재를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 도전성 연결 부재는 FRC(flexible radio frequency cable)로 형성될 수 있다.다양 한 실시 예에 따르면, 전자 장치는 적어도 일부가 도전성 부분으로 형성되는 하우징, 상기 전자 장치의 내부에 배치되는 PCB(printed circuit board), 및 상기 무선 통신 회로 및 상기 하우징의 상기 도전성 부분과 전기적으 로 연결되는 안테나 조립체, 상기 안테나 조립체는, 상기 안테나 조립체의 일부를 상기 하우징의 상기 도전성 부분에 고정시키는 체결 부재(fastening member), 접촉 영역을 포함하며 상기 접촉 영역의 적어도 일부를 통하 여 상기 하우징의 도전성 부분과 접촉하는 도전성 부재(conductive member), 상기 접촉 영역은 상기 체결 부재 와 접촉하는 적어도 하나의 제1 접촉 부분, 상기 도전성 부분과 접촉하는 적어도 하나의 제2 접촉 부분, 및 상 기 제1 접촉 부분과 상기 제2 접촉 부분에 의해 형성된 굴곡진 테두리를 가지는 제1 홀을 포함하고, 및 상기 무 선 통신 회로와 상기 도전성 부재를 전기적으로 연결하는 도전성 연결 부재(conductive connect member)를 포함 하고, 상기 체결 부재는 상기 제1 홀과 상기 하우징의 상기 도전성 부분에 형성된 제2 홀에 배치됨으로써, 상기 도전성 부재를 상기 도전성 부분에 고정시키고, 상기 체결 부재에 의해 상기 도전성 부재가 상기 하우징의 상기 도전성 부분에 고정될 때, 굴곡지게 연장된 상기 제2 접촉 부분과 상기 도전성 부분의 접촉이 유지됨으로써, 상 기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 상기 PCB 상에 배치되는 무선 통신 회로를 더 포함하고, 상기 무선 통신 회로는 상기 도 전성 연결 부재를 통하여 상기 도전성 부재와 전기적으로 연결되고, 상기 무선 통신 회로는, 상기 도전성 연결 부재를 통하여 상기 도전성 부재의 일부에 급전함으로써, 상기 도전성 연결 부재, 상기 도전성 부재, 및 상기 도전성 부재와 전기적으로 연결된 상기 하우징의 상기 도전성 부분을 포함하는 전기적 경로에 기반하여 지정된 주파수 대역의 신호를 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 굴곡지며 형성된 상기 접촉 영역의 상기 제2 접촉 부분의 적어도 일부는 상기 접촉 영역 에서 발생하는 탄성력에 의해, 상기 도전성 부분과의 접촉을 유지함으로써, 상기 도전성 부재와 상기 하우징의 도전성 부분은 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 상기 도전성 부재의 접촉 영역은 두개의 제1 접촉 부분, 및 두개의 제2 접촉 부분을 포함 하고, 상기 두개의 제1 접촉 부분은 상기 도전성 부재와 접촉하는 상기 도전성 부분의 일면을 기준으로 제1 높 이를 가지고, 상기 두개의 제2 접촉 부분은 상기 제1 높이보다 낮은 제2 높이를 가지고 상기 제1 접촉 부분에서 굴곡지며 연장될 수 있다. 일 실시 예에 따르면, 상기 적어도 하나의 제1 접촉 부분은 복수의 제1 접촉 부분으로 형성되고, 상기 적어도 하나의 제2 접촉 부분은 복수의 제2 접촉 부분으로 형성될 수 있다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2022-0036758", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른, 전자 장치의 전면 사시도이다. 도 2는 일 실시 예에 따른, 전자 장치의 후면 사시도이다. 도 3은 일 실시 예에 따른, 전자 장치의 분해도이다. 도 4는 일 실시 예에 따른, 전자 장치의 내부를 도시한다. 도 5는 일 실시 예에 따른, 안테나 조립체를 도시한다. 도 6은 일 실시 예에 따른, 도전성 부재를 도시한다.도 7은 일부 실시 예에 따른, 도전성 부재를 도시한다. 도 8은 일부 실시 예에 따른, 도전성 부재를 도시한다. 도 9는 일부 실시 예에 따른, 도전성 부재를 도시한다. 도 10은 일부 실시 예에 따른, 도전성 부재를 도시한다. 도 11은 일부 실시 예에 따른, 도전성 부재를 도시한다. 도 12는 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
