{"patent_id": "10-2021-7021855", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0096284", "출원번호": "10-2021-7021855", "발명의 명칭": "인공지능 학습에 기반하여 온수기를 제어하는 방법 및 서버", "출원인": "엘지전자 주식회사", "발명자": "이응신"}}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "온수기로부터 온수기의 동작 정보를 수신하고, 단말장치 또는 상기 단말장치에 연동한 일정 서버 중 어느 하나로부터 상기 온수기를 제어하는 사용자의 일정 정보를 수신하는 통신부;상기 동작 정보와 상기 일정 정보를 저장하는 데이터베이스;상기 통신부가 수신한 동작 정보와 일정 정보에 기반하여 상기 온수기를 제어하는 제어 정보를 생성하는 서버제어부를 포함하며, 상기 데이터베이스는 상기 온수기를 제어하는 다수의 사용자의 다수의 일정 정보를 저장하며, 상기 서버제어부는 다수의 일정 정보에서 하나 이상의 일정 정보를 선택하여 상기 동작 정보에 결합시켜 상기데이터베이스에 저장하며, 상기 선택된 일정 정보는 상기 동작 정보의 시간과 상기 일정 정보의 상주 시간이 중첩된 것을 특징으로 하는,온수기를 제어하는 서버."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 동작 정보는 상기 온수기가 사용된 시간 정보와 온도 정보를 포함하며,상기 서버제어부는 상기 시간 정보와 상기 온도 정보를 기계학습하여 후속할 온수기의 제어 정보를 생성하는,온수기를 제어하는 서버."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 서버제어부는 상기 일정 정보가 변경될 경우 상기 제어정보를 변경하는, 온수기를 제어하는 서버."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 통신부는 상기 온수기의 제어 정보를 단말 장치로 전송한 후, 상기 통신부는 상기 단말 장치로부터 상기온수기의 제어 정보를 적용할 것을 요청하는 메시지를 수신하며상기 통신부는 상기 제어 정보를 상기 온수기에게 전송하는, 온수기를 제어하는 서버."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 서버제어부는 상기 동작 정보를 요일 별로 누적하여 저장한 후, N주 이상 저장된 동작 정보 중 반복된 시간 정보에 기반하여 상기 온수기의 예열 시간을 산출하며, 상기 서버제어부는 상기 요일 별로 상기 예열 시간을 포함하는 제어 정보를 생성하는, 온수기를 제어하는 서버."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "서버의 통신부가 온수기로부터 온수기의 동작 정보를 수신하는 단계;상기 통신부가 단말장치 또는 상기 단말장치에 연동한 일정 서버 중 어느 하나로부터 상기 온수기를 제어하는사용자의 일정 정보를 수신하는 단계; 상기 서버의 데이터베이스부가 상기 동작 정보와 상기 일정 정보를 저장하는 단계; 및공개특허 10-2021-0096284-3-상기 서버의 서버제어부가 상기 동작 정보와 일정 정보에 기반하여 상기 온수기를 제어하는 제어 정보를 생성하는 단계를 포함하며, 상기 저장하는 단계는 상기 데이터베이스가 상기 온수기를 제어하는 다수의 사용자의 다수의 일정 정보를 저장하는 단계; 및 상기 서버제어부가 다수의 일정 정보에서 하나 이상의 일정 정보를 선택하여 상기 동작 정보에 결합시켜 상기데이터베이스에 저장하는 단계를 포함하며, 상기 선택된 일정 정보는 상기 동작 정보의 시간과 상기 일정 정보의 상주 시간이 중첩된 것을 특징으로 하는,서버가 온수기를 제어하는 방법."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 동작 정보는 상기 온수기가 사용된 시간 정보와 온도 정보를 포함하며,상기 서버제어부가 상기 시간 정보와 상기 온도 정보를 기계학습하여 후속할 온수기의 제어 정보를 생성하는 단계를 더 포함하는, 서버가 온수기를 제어하는 방법."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 일정 정보가 변경될 경우 상기 서버제어부가 상기 제어정보를 변경하는 단계를 더 포함하는, 서버가 온수기를 제어하는 방법."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 통신부가 상기 온수기의 제어 정보를 단말 장치로 전송한 후, 상기 통신부가 상기 단말 장치로부터 상기온수기의 제어 정보를 적용할 것을 요청하는 메시지를 수신하는 단계; 및상기 통신부는 상기 제어 정보를 상기 온수기에게 전송하는 단계를 더 포함하는, 서버가 온수기를 제어하는 방법."}
{"patent_id": "10-2021-7021855", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 서버제어부가 상기 동작 정보를 요일 별로 누적하여 저장한 후, N주 이상 저장한 동작 정보 중 반복된 시간 정보에 기반하여 상기 온수기의 예열 시간을 산출하는 단계; 및상기 서버제어부가 상기 요일 별로 상기 예열 시간을 포함하는 제어 정보를 생성하는 단계를 더 포함하는, 서버가 온수기를 제어하는 방법."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능 학습에 기반하여 온수기를 제어하는 방법 및 서버에 관한 기술로, 본 발명의 일 실시예에 의 한 온수기를 제어하는 서버는 온수기로부터 온수기의 동작 정보를 수신하고, 단말장치 또는 단말장치에 연동한 일정 서버 중 어느 하나로부터 온수기를 제어하는 사용자의 일정 정보를 수신하고 이를 이용하여 온수기를 제어 하는 제어 정보를 생성한다. 공개특허10-2021-0096284 CPC특허분류 H04L 12/2834 (2013.01)명 세 서 청구범위 청구항 1 온수기로부터 온수기의 동작 정보를 수신하고, 단말장치 또는 상기 단말장치에 연동한 일정 서버 중 어느 하나 로부터 상기 온수기를 제어하는 사용자의 일정 정보를 수신하는 통신부; 상기 동작 정보와 상기 일정 정보를 저장하는 데이터베이스; 상기 통신부가 수신한 동작 정보와 일정 정보에 기반하여 상기 온수기를 제어하는 제어 정보를 생성하는 서버제 어부를 포함하며, 상기 데이터베이스는 상기 온수기를 제어하는 다수의 사용자의 다수의 일정 정보를 저장하며, 상기 서버제어부는 다수의 일정 정보에서 하나 이상의 일정 정보를 선택하여 상기 동작 정보에 결합시켜 상기 데이터베이스에 저장하며, 상기 선택된 일정 정보는 상기 동작 정보의 시간과 상기 일정 정보의 상주 시간이 중첩된 것을 특징으로 하는, 온수기를 제어하는 서버. 청구항 2 제1항에 있어서, 상기 동작 정보는 상기 온수기가 사용된 시간 정보와 온도 정보를 포함하며, 상기 서버제어부는 상기 시간 정보와 상기 온도 정보를 기계학습하여 후속할 온수기의 제어 정보를 생성하는, 온수기를 제어하는 서버. 청구항 3 제1항에 있어서, 상기 서버제어부는 상기 일정 정보가 변경될 경우 상기 제어정보를 변경하는, 온수기를 제어하는 서버. 청구항 4 제1항에 있어서, 상기 통신부는 상기 온수기의 제어 정보를 단말 장치로 전송한 후, 상기 통신부는 상기 단말 장치로부터 상기 온수기의 제어 정보를 적용할 것을 요청하는 메시지를 수신하며 상기 통신부는 상기 제어 정보를 상기 온수기에게 전송하는, 온수기를 제어하는 서버. 청구항 5 제1항에 있어서, 상기 서버제어부는 상기 동작 정보를 요일 별로 누적하여 저장한 후, N주 이상 저장된 동작 정보 중 반복된 시 간 정보에 기반하여 상기 온수기의 예열 시간을 산출하며, 상기 서버제어부는 상기 요일 별로 상기 예열 시간을 포함하는 제어 정보를 생성하는, 온수기를 제어하는 서버. 청구항 6 서버의 통신부가 온수기로부터 온수기의 동작 정보를 수신하는 단계; 상기 통신부가 단말장치 또는 상기 단말장치에 연동한 일정 서버 중 어느 하나로부터 상기 온수기를 제어하는 사용자의 일정 정보를 수신하는 단계; 상기 서버의 데이터베이스부가 상기 동작 정보와 상기 일정 정보를 저장하는 단계; 및상기 서버의 서버제어부가 상기 동작 정보와 일정 정보에 기반하여 상기 온수기를 제어하는 제어 정보를 생성하 는 단계를 포함하며, 상기 저장하는 단계는 상기 데이터베이스가 상기 온수기를 제어하는 다수의 사용자의 다수의 일정 정보를 저장하는 단계; 및 상기 서버제어부가 다수의 일정 정보에서 하나 이상의 일정 정보를 선택하여 상기 동작 정보에 결합시켜 상기 데이터베이스에 저장하는 단계를 포함하며, 상기 선택된 일정 정보는 상기 동작 정보의 시간과 상기 일정 정보의 상주 시간이 중첩된 것을 특징으로 하는, 서버가 온수기를 제어하는 방법. 청구항 7 제6항에 있어서, 상기 동작 정보는 상기 온수기가 사용된 시간 정보와 온도 정보를 포함하며, 상기 서버제어부가 상기 시간 정보와 상기 온도 정보를 기계학습하여 후속할 온수기의 제어 정보를 생성하는 단 계를 더 포함하는, 서버가 온수기를 제어하는 방법. 청구항 8 제6항에 있어서, 상기 일정 정보가 변경될 경우 상기 서버제어부가 상기 제어정보를 변경하는 단계를 더 포함하는, 서버가 온수 기를 제어하는 방법. 청구항 9 제6항에 있어서, 상기 통신부가 상기 온수기의 제어 정보를 단말 장치로 전송한 후, 상기 통신부가 상기 단말 장치로부터 상기 온수기의 제어 정보를 적용할 것을 요청하는 메시지를 수신하는 단계; 및 상기 통신부는 상기 제어 정보를 상기 온수기에게 전송하는 단계를 더 포함하는, 서버가 온수기를 제어하는 방 법. 청구항 10 제6항에 있어서, 상기 서버제어부가 상기 동작 정보를 요일 별로 누적하여 저장한 후, N주 이상 저장한 동작 정보 중 반복된 시 간 정보에 기반하여 상기 온수기의 예열 시간을 산출하는 단계; 및 상기 서버제어부가 상기 요일 별로 상기 예열 시간을 포함하는 제어 정보를 생성하는 단계를 더 포함하는, 서버 가 온수기를 제어하는 방법. 발명의 설명"}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능 학습에 기반하여 온수기를 제어하는 방법 및 서버에 관한 기술이다."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온수기는 생활 공간의 온도를 높이거나 욕실이나 싱크대에서 온수를 제공한다. 온수기는 가스, 전기, 연탄 등 다양한 에너지원을 이용하여 온수를 생성하고, 이를 이용하여 공간의 온도를 높인다. 종래에 온수기는 사용자가 미리 동작 시간을 설정하는 방식, 온도를 조절하기 위해 매번 온수의 온도를 설정하 는 방식 등 매뉴얼적인 방시에 따라 동작하였다. 그러나, 미리 동작 시간을 설정하는 경우, 사용자가 부재할 경우에 온수기가 동작하여 에너지 효율을 낮추는 문 제가 있다. 또한, 사용자가 설정한 동작 시간과 외부의 온도 변화가 일치하지 않을 경우에도 사용의 불편을 초 래할 수 있다. 이에, 사용자가 매번 온수기의 동작을 제어하지 않는 경우에도 온수기가 사용자의 과거 사용 패턴에 기반하여 학습을 수행하고, 학습에 기반하여 온수기의 동작이 제어되는 기술이 필요해졌다. 특히, 1인가구의 증가, 가족 구성원의 경제 활동 증가 등으로 집안 내에 구성원이 부재하는 상황이 증가하면서, 온수기가 이러한 가구 내 변화 상황에 맞추어 동작하는 것이 필요하다. 이하, 본 명세서에서는 전술한 요구 사항을 충족하는 온수기의 제어 방식을 제시하고자 한다."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위한 것으로, 본 명세서에서는 온수기가 사용자의 사용 시간에 맞추어 자동으로 온수 를 제공할 수 있도록 온수기를 예열시키는 방법과 이를 제어하는 서버를 제시한다. 또한, 본 명세서에서는 온수기를 사용하는 사용자들의 부재 여부를 반영하여 온수기를 동작시키는 방법과 이를 제어하는 서버를 제시한다. 또한, 본 명세서에서는 온수기가 배치된 지역의 특성을 반영하여 온수기를 동직시키는 방법과 이를 제어하는 서 버를 제시한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 온수기를 제어하는 서버는 온수기로부터 온수기의 동작 정보를 수신하고, 단말장치 또는 단말장치에 연동한 일정 서버 중 어느 하나로부터 온수기를 제어하는 사용자의 일정 정보를 수신하고 이를 이용하여 온수기를 제어하는 제어 정보를 생성한다. 본 발명의 일 실시예에 의한 온수기를 제어하는 서버는 동작 정보에 포함된 온수기의 사용 시간 정보와 온도 정 보를 기계학습하여 후속할 온수기의 제어 정보를 생성한다. 본 발명의 일 실시예에 의한 온수기를 제어하는 서버는 일정 정보가 변경될 경우 제어정보를 변경한다. 본 발명의 일 실시예에 의한 온수기를 제어하는 방법은 서버의 통신부가 온수기로부터 온수기의 동작 정보를 수 신하는 단계와, 통신부가 단말장치 또는 단말장치에 연동한 일정 서버 중 어느 하나로부터 온수기를 제어하는 사용자의 일정 정보를 수신하는 단계와, 서버의 서버제어부가 동작 정보와 일정 정보에 기반하여 온수기를 제어 하는 제어 정보를 생성하는 단계를 포함한다."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들을 적용할 경우, 온수기를 사용하는 사용자의 생활 패턴을 반영하여 서버가 온수기를 자동으 로 예열시키므로, 에너지 효율을 높일 수 있다. 본 발명의 실시예들을 적용할 경우, 온수기를 사용하는 사용자의 부재 상황을 반영하여 서버가 온수기를 제어하 므로, 온수기는 사용자의 생활 패턴을 정확하게 반영하여 동작할 수 있다. 본 발명의 실시예를 적용할 경우, 온수기가 배치된 지역의 온도나 지역적 사용 특성을 반영하여 서버가 온수기 를 제어하므로, 온수기는 사용자의 지리적 특성이나 외부 온도의 상태를 정확하게 반영하여 동작할 수 있다."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 전술한 효과에 한정되지 않으며, 본 발명의 당업자들은 본 발명의 구성에서 본 발명의 다양한 효과를 쉽게 도출할 수 있다."}
{"patent_id": "10-2021-7021855", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조 부호를 붙이도록 한다. 또한, 본 발명의 일부 실시예들을 예시적인 도 면을 참조하여 상세하게 설명한다. 각 도면의 구성요소들에 참조부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가질 수 있다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에 는 그 상세한 설명은 생략할 수 있다. 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질, 차례, 순서 또는 개수 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된 다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성 요소 사이에 다른 구성 요소가 \"개재\"되거나, 각 구성 요소가 다른 구성 요소를 통해 \"연결\", \"결합\" 또는 \"접 속\"될 수도 있다고 이해되어야 할 것이다. 또한, 본 발명을 구현함에 있어서 설명의 편의를 위하여 구성요소를 세분화하여 설명할 수 있으나, 이들 구성요 소가 하나의 장치 또는 모듈 내에 구현될 수도 있고, 혹은 하나의 구성요소가 다수의 장치 또는 모듈들에 나뉘 어져서 구현될 수도 있다. 이하, 본 명세서는 다양한 물질을 이용하여 공간 내의 온도를 높이는 장치, 또는 온수를 제공하는 장치를 온수 기라고 지칭한다. 도 1은 본 발명의 일 실시예에 의한 온수기 및 유관 장치들의 구성을 보여준다. 온수기는 사용자가 설정한 온도를 유지하며 온수를 제공한다. 온수기는 온수공급부, 저장부 , 통신부, 제어부, 인터페이스부를 포함한다. 온수기의 통신부는 온수기의 동작 상태에 대한 정보를 서버로 전송하고, 서버는 이에 기반하여 온수기의 동작에 대한 세부적인 정보들을 데이터베이스에 저장한다. 단말장치는 온수기가 설치된 공간의 사용자가 소지하는 단말장치로 휴대폰, 스마트폰, 노트북, 태블 릿 등의 통신 가능한 장치를 포함한다. 또는 단말장치는 온수기를 제어하는 기능을 전담하는 통신 장 치를 일 실시예로 한다. 온수기는 사용자의 제어, 사용자의 설정 등에 대한 정보를 저장부에 저장하고 동작한다. 온수기(10 0)는 동작 과정에서 발생한 정보(동작 정보)들을 서버로 전송하고, 서버는 전송된 정보에서 사용 패 턴을 산출한다. 특히, 이 과정에서 서버는 사용자의 위치나 이동 패턴, 또는 사용자의 일정 등을 사용 패 턴에 반영할 수 있다. 서버는 사용 패턴에 기반하여 제어 정보를 생성하여 온수기로 전송하고, 온수기는 제어 정보에 기반하여 동작한다. 서버는 통신부, 데이터베이스 및 서버제어부를 포함한다. 통신부가 온수기로부 터 수신한 온수기의 동작 정보를 수신하면, 서버제어부는 동작 정보를 데이터베이스에 저장한다. 또 한, 통신부가 단말장치로부터, 또는 단말장치와 연동된 일정서버로부터 사용자의 일정 정보를 수신한다. 서버제어부는 일정 정보를 데이터베이스에 저장한다. 데이터베이스가 동작 정보와 일 정 정보를 저장하기 때문에, 서버제어부는 빅데이터에 기반한 제어 정보를 생성할 수 있다. 통신부는 온수기로부터 온수기의 동작 정보를 수신하고, 단말장치 또는 단말장치에 연동한 일정 서버(도 9의 400) 중 어느 하나로부터 온수기를 제어하는 사용자의 일정 정보를 수신한다. 서버제어부는 통신부가 수신한 일정 정보와 동작 정보에 기반하여 온수기를 제어하는 제어 정보 를 생성한다. 이 제어 정보는 온수기에게 전달되어 온수기를 동작시킨다. 일 실시예로, 제어 정보는 온수기가 동작을 시작할 시작 시간 및 이에 대응하는 예열 시작 시간을 포함한다. 또한 제어 정보는 온수 기의 온도에 대한 설정값, 온수기 동작 모드의 설정값 등을 포함한다. 도 1의 온수기, 서버 및 단말 장치의 구성을 이용하면, 온수기가 사용자의 사용 시간에 맞추어 자동으로 온수를 제공할 수 있도록 온수기를 예열시킬 수 있다. 또한, 도 1의 구성을 이용하면, 서버는 온수기를 사용하는 사용자들의 부재 여부를 반영하여 온수기를 동작시킬 수 있다. 그리고, 서버는 온수기가 배치된 지역의 특성을 반영하여 온수기를 동직시킬 수 있다. 도 2는 본 발명의 일 실시예에 의한 서버가 동작하는 과정을 보여준다. 서버는 온수기로부터 동작 정 보를 수신한다(S1). 온수기는 이동통신 모듈 또는 Wi-Fi 통신 모듈 등을 이용하여 온수기가 사용된 요일, 시간과 이때 온수기의 운전 모드, 또는 운전 모드의 변경 상태, 온도 상태 등의 정보를 서버에게 주기적으 로 전송한다. 특히, 동작 정보는 온수기가 동작한 시간 정보, 온도 정보, 그리고 온수기의 동작이 어떤 모드인지를 알려 주는 모드 정보를 포함한다. 또한, 동작 정보는 온수기가 얼마의 온수를 사용했는지에 대한 온수량 정보를 포함 한다. 이외에도 동작 정보는 온수기에서 사용자가 설정할 수 있는 다양한 정보를 포함한다. 동작 정보는 온수기가 온수나 난방을 공급하는 공간에 대한 정보를 포함한다. 사용자가 예약으로 설정한 정보 역시 동 작 정보에 포함된다. 서버는 동작 정보를 데이터베이스에 누적하여 저장한 후, 일정 기간 동안의 동작 정보가 누적되면, 서버는 온수기의 제어 정보를 생성한다(S2). 서버의 서버 제어부는 인공 지능, 기계학습, 딥러 닝 등의 기술을 이용하여 실제 사용자가 앞으로 온수기를 사용할 시간과 온도, 모드 등에 대한 제어 정보를 산 출한다. 또한, 서버의 서버제어부는 사용자의 일정 정보를 반영하여 생성된 제어 정보를 변경할 수 있다(S3). 또는 S2/S3 단계는 동시에 또는 역순으로 진행될 수 있다. 그리고 서버는 제어 정보를 온수기로 전송한다 (S4). S2 또는 S3에서 서버 제어부는 온수기의 에너지사용을 반영하여 제어 정보를 생성할 수 있다. 예를 들어, 사용자가 금요일 저녁 7시부터 2시간동안 온수기를 켜서 25도 온도로 사용한 후, 1시간 동안 아예 끈 후, 다시 3시간 동안 온수기를 켜서 다시 25도 온도로 사용한 경우에 서버 제어부는 에너지 효율이 높게 제어 정보 를 생성할 수 있다. 예를 들어, 서버 제어부가 생성하는 제어 정보는 다음과 같이 온수기의 동작을 제어한다. 온수기는 금요일 7시부터 2시간 동안 온수기를 켜서 25도 온도로 동작시키되, 이후 1시간 동안은 매우 낮은 온도(19도)로 동작하도록 제어된다. 그리고 온수기는 후속하는 1시간 동안은 23도로 동작한 뒤 2시간 동안 25도로 동작 하도록 제어될 수 있다. 도 2와 같이 서버가 온수기의 동작에서 가장 적절한 제어 정보를 생성하여 온수기에게 제어 정보를 전송하 면, 온수기의 절전을 극대화할 수 있다. 특히, 사용자의 잘못된 사용 패턴으로 온수기가 에너지를 과도하 게 사용할 경우, 서버는 온수기를 제어한 결과, 사용자에게 적합한 온도의 난방을 제공하며 에너지 사용을 줄일 수 있다. 서버의 서버 제어부는 인공 지능이나 딥러닝, 기계학습 등을 이용하여 학습 네트워크를 유지할 수 있 다. 그리고 서버 제어부는 수신한 온수기의 동작 정보를 미리 학습된 학습 네트워크에 입력한 후, 서 버의 통신부는 출력된 온수기의 제어 정보를 온수기에게 제공한다. 이 과정에서 사용자의 사용 패턴과 제어 정보의 일치를 위해 서버제어부는 구글 캘린더 혹은 다른 인터넷 사이트를 이용하는 캘린더 서비스와 연동하여 사용자의 일정 정보를 이용할 수 있다. 즉, 서버는 구글 캘 린더 서비스, 외부 인터넷 사이트의 캘린더 서비스를 제공하는 일정 서버와 연동하여 일정 정보를 제공받을 수 있다. 또는 서버는 사용자의 단말장치로부터 일정 정보를 제공받는다. 서버 제어부는 일정 정보 를 이용하여 사용자의 상주 시간과 부재 시간, 그리고 제어 정보를 비교하여 제어 정보를 변경하여 사용자의 개 별 일정에 부합하여 온수기가 동작할 수 있도록 한다. 그 결과, 온수기는 사용자의 사용 패턴과 일정 정보가 반영된 제어 정보에 기반하여 동작 온도나 동작 시간, 동 작 모드를 자동으로 조절할 수 있다. 도 3은 본 발명의 일 실시예에 의한 서버가 사용자 사용 패턴을 감지하여 제어 정보를 생성하는 과정을 보여준 다. 서버는 사용자의 일정 정보를 통하여 공간 내에 사용자의 부재 시간과 상주 시간을 확인할 수 있다. 서버 는 해당 온수기가 배치된 공간의 사용자들의 다수의 일정 정보를 데이터베이스에 저장한다(S11). 만약, 사 용자가 1인인 경우 서버는 한 사람의 일정 정보를 데이터베이스에 저장한다. 이때, 한 사람의 일정 정보가 다수개가 될 수 있다. 일정 정보는 사용자를 식별하는 식별 정보를 포함한다. 그리고, 서버는 저장된 다수의 일정 정보에서 선택된 일정 정보를 온수기의 동작 정보에 결합시켜 데이터 베이스에 저장한다(S12). 여기서 선택된 일정 정보는 동작 정보의 시간과 일정 정보의 상주 시간이 중첩된 것을 의미한다. 일정 정보의 상주 시간이란 일정 정보에서 사용자가 부재하지 않는 시간을 의미한다. 예를 들어 사용자의 제1일정 정보가 \"13:00~14:00 마트\"이며, 제2일정 정보가 \"19:00~22:00 영화관\" 인 경우에 서버는 그 사이 \"14:00~19:00\"을 상주 시간으로 하는 일정 정보를 저장할 수 있다. 동작 정보에 일정 정보를 결합시키는 것은 동작 정보에 사용자 식별 정보를 포함시키는 것을 일 실시예로 한다. 그리고 서버는 저장된 동작 정보를 이용하여 제어 정보를 생성한다(S13). 이때, 서버는 서버 제어부 에 포함된 학습 모듈에 전술한 동작 정보와 메타 정보를 입력하여 실제 사용자의 사용 패턴에 부합하는 제 어 정보를 생성한다(S13). 서버는 제어 정보를 온수기로 전송한다(S14). 서버가 온수기의 제어 정보를 생성함에 있어 서 이용하는 학습 모듈의 일 실시예는 딥러닝 학습모듈이다. 따라서, 서버는 사용자의 생활 패턴을 인식하도록 미리 학습된 학습 모듈을 이용하여 재실자가 존재하여 온수기를 사용하는 요일과 시간에 대한 정보, 온수를 사용한 패턴(양, 횟수 등), 일정 정보에 기반한 온수기 제 어 정보를 생성한다. 학습모듈은 사용자가 생활 과정에서 온수기를 사용하는 패턴을 인식하여 학습한다. 학습모듈은 기계학습 알고리 즘을 사용하여 학습할 수 있다. 예를 들어, 학습 모듈은 기계학습 기술 중 하나인 딥러닝(Deep Learning) 기반 인공신경망(Neural Network)을 사용할 수 있다. 서버의 데이터베이스는 온수기를 제어하는 다수의 사용자의 다수의 일정 정보를 저장할 수 있다. 그 리고 서버제어부는 다수의 일정 정보에서 하나 이상의 일정 정보를 선택하여 동작 정보에 결합시켜 데이터 베이스에 저장한다. 여기서 선택된 일정 정보는 동작 정보의 시간과 일정 정보의 상주 시간이 중첩된 것을 의미 한다. 예를 들어 3명의 사용자가 있으며, 이 중에서 두 명은 모두 오후 5시~9시에 외부 약속이 있으나 한명의 사용자 (A)만 별도 일정이 없는 상황을 서버가 확인할 수 있도록 이들의 일정 정보는 모두 데이터베이스에저장된다. 그리고 서버는 오후 6시에 온수기가 수동 제어로 동작하면, 별도 일정이 없었던 사용자(A)가 온수기 를 동작시킨 것으로 확인한다. 그리고 서버는 해당 사용자(A) 정보와 온수기의 동작 정보를 데 이터베이스에 저장하여 사용자 맞춤형 제어 정보를 생성할 수 있다. 하기 표 1은 사용자 A 및 B의 온수 사용에 대한 동작 정보를 나열한 것이다. 표 1과 같은 동작 정보가 누적될 경우, 서버는 사용자 별로 제어 정보를 생성할 수 있다. 표 1 StartTime EndTime Temp User 18:32 19:03 45 A 10:05 12:23 55 B 도 2 및 도 3의 실시예에서 서버제어부는 동작 정보를 요일 별로 누적하여 저장할 수 있다. 그리고 서버제 어부는 N주(예를 들어 2주, 3주, 4주 등 N은 2보다 큰 수)이상 저장된 동작 정보 중 반복된 시간 정보에 기반하여 온수기의 예열 시간을 산출한다. 예열 시간은 서버제어부가 예측한 온수기의 사용 시작 시 간과 온도를 기준으로 역산할 수 있다. 또한, 서버제어부는 온수기가 설치된 지역의 온도를 반영하여 예열 시간을 산출할 수 있다. 일 실시예로 여름에 온도가 30도 이상인 지역의 온수기는 이미 온수기 내의 물의 온도가 높아졌을 가능성이 있 으며, 사용자가 낮은 온도의 온수를 사용할 가능성이 높다. 따라서 서버제어부는 예열 시간을 짧게 설정한 다. 반대로, 겨울에 온도가 -10도 이하인 지역의 온수기는 이미 온수기 내의 물의 온도가 매우 낮아졌을 가능성이 있으며, 사용자가 높은 온도의 온수를 사용할 가능성이 높다. 따라서 서버제어부는 예열 시간을 길게 설정 한다. 예열 시간이 산출되면 서버제어부는 요일 별로 예열 시간을 포함하는 제어 정보를 생성한다. 도 4는 본 발명의 일 실시예에 의한 서버에 구축된 학습 모듈의 구성을 보여준다. 도 4는 딥러닝 구조의 학습 모듈을 보여준다. 딥러닝 구조는 인공신경망(ANN)를 포함할 수 있으며, 예를 들어 딥러닝 구조는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경 망(DNN)으로 구성될 수 있다. 학습 모듈은 입력 레이어(Input Layer), 히든 레이어(Hiddent Layer), 및 출력 레이어(Output Layer)를 포함할 수 있다. 각 레이어는 복수의 노드들을 포함하고, 각 레이어는 다음 레이어와 연결된다. 인접한 레이어 사이의 노드들은 웨이트(weight)를 가지고 서로 연결될 수 있다. 최초에 학습 모듈은 입력 레이어와 출력 레이어에 미리 산출된 값을 입력하여 히든 레이어의 에지와 노드 의 배열 혹은 설정을 조절하는 학습 과정을 반복한다. 그리고 학습이 완료되면 학습 모듈은 입력 레이어에 소정 의 입력 인자를 입력하여 출력 레이어에서 온수기의 제어 정보를 출력한다. 예를 들어, 입력 레이어는 온수기의 동작이나 일정 정보와 관련한 정보들이 입력될 수 있다. 일 실시예로, 학습 모듈은 온수기가 사용된 시간 정보, 온도 정보 등을 입력 레이어에 입력한다. 또는 학습 모듈은 일정 정보를 입력 레이어에 입력한다. 보다 세부적으로 학습 모듈은 \"운전 모드 변경\", \"10분 단위 코스/사용이력\", \"일정 정보\", \"최종 모드/온 도 설정 상태\", \"지역별/계절별 설정 온도\" 등을 입력 레이어에 입력한다. 그리고 출력 레이어에서 출력되는 인자는 해당 온수기를 제어하는데 필요한 제어 정보를 포함한다. 중간의 히든 레이어의 에지와 노드들의 배열 혹은 설정을 조절하는 학습 과정을 거쳐 학습모듈의 학습이 완료되면, 학 습모듈은 입력된 정보를 히든 레이어의 노드/에지의 구성 및 설정에 반영하여 온수기의 제어 정보를 산출 한다. 예를 들어 \"온수기 가열 시간 자동 설정/변경\", \"온수 온도 자동 설정/변경\"이 출력 모듈에서 출력되어 제어 정 보를 구성할 수 있다. 또는 가열 시간에 대응하는 예열 시간이 출력 모듈에서 출력될 수 있다. 학습 모듈은 다음 순서의 레이어로 갈수록 더욱 상위레벨의 특징으로 추상화될 수 있다. 학습 모듈을 구성하는 각 노드들은 활성화 모델에 기초하여 동작할 수 있고, 활성화 모델에 따라 입력값에 대응하는 출력값 이 결정될 수 있다. 도 4에서 입력 레이어를 가장 낮은 하위 레벨로, 출력 레이어를 가장 높은 상위 레벨로 정 의한다. 임의의 노드, 예를 들어, 하위레벨 특징(입력 레이어에 가까운 레벨)의 출력값은 해당 노드와 연결된 다음 레이 어, 예를 들어, 중간레벨 특징의 노드로 입력될 수 있다. 다음 레이어의 노드, 예를 들어, 중간레벨 특징의 노 드는 하위레벨 특징의 복수의 노드로부터 출력되는 값들을 입력받을 수 있다. 이 때, 각 노드의 입력값은 이전 레이어의 노드의 출력값에 웨이트(weight)가 적용된 값일 수 있다. 웨이트 (weight)는 노드간의 연결 강도를 의미할 수 있다. 또한, 딥러닝 과정은 적절한 웨이트(weight)를 찾아내는 과 정으로도 볼 수 있다. 뿐만 아니라, 딥러닝 과정은 적절한 바이어스(bias)를 찾는 과정이기도 한다. 바이어스는 노드 간의 값을 특정한 방향으로 치우치도록 제공되는 것을 의미한다. 한편, 임의의 노드, 예를 들어, 중간레벨 특징의 출력값은 해당 노드와 연결된 다음 레이어, 예를 들어, 상위레 벨 특징(출력 레이어에 가까운 레벨)의 노드로 입력될 수 있다. 다음 레이어의 노드, 예를 들어, 상위레벨 특징 의 노드는 중간레벨 특징의 복수의 노드로부터 출력되는 값들을 입력받을 수 있다. 학습 모듈은 각 레벨에 대응하는 학습된 레이어(layer)를 이용하여, 각 레벨에 대응하는 특징 정보를 추출 할 수 있다. 인공신경망은 순차적으로 추상화하여, 가장 상위 레벨의 특징 정보를 활용하여 온수기를 제어하는 정보를 출력할 수 있다. 도 4의 학습 모듈의 딥러닝 구조는 다양한 구조를 이용할 수 있다. 예를 들어, CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등일 수 있다. RNN(Recurrent Neural Network)은, 자연어 처리 등에 많이 이용되고 있으며, 시간의 흐름에 따라 변하는 시계열 데이터(Time-series data) 처리에 효과적인 구조로 매 순간마다 레이어를 쌓아올려 인공신경망 구조를 구성할 수 있다. DBN(Deep Belief Network)은 딥러닝 기법인 RBM(Restricted Boltzman Machine)을 다층으로 쌓아 구성되는 딥러 닝 구조이다. RBM(Restricted Boltzman Machine) 학습을 반복하여, 일정 수의 레이어가 되면 해당 개수의 레이 어를 가지는 DBN(Deep Belief Network)를 구성할 수 있다. CNN(Convolutional Neural Network)은, 특히 객체 인식 분야에서 많이 사용되는 구조이다. CNN(Convolutional Neural Network)은 사람이 물체를 인식할 때 물체의 기본적인 특징들을 추출한 다음 뇌 속에서 복잡한 계산을 거쳐 그 결과를 기반으로 물체를 인식한다는 가정을 기반으로 만들어진 사람의 뇌 기능을 모사한 모델이다. 도 4와 같은 학습 모듈은 소프트웨어 모듈을 일 실시예로 하며 학습 모듈은 충분히 학습된 후 서버 제어부내에 설치될 수 있다. 도 5는 본 발명의 일 실시예에 의한 딥러닝 학습 모듈의 동작 과정을 보여준다. 학습 모듈은 5 종류의 정 보를 입력받은 후, 두 종류의 정보를 출력한다. 입력되는 정보는 다양하게 결정될 수 있다. 학습 모듈은 온수기의 운전 모드가 변경된 정보, 10분 단위 코 스나 사용 이력에 대한 정보, 일정 정보, 온수기의 최종 모드나 최종 온도 설정된 상태에 대한 정보, 온수기가 설치된 지역 또는 계절에 따른 설정 온도를 입력받는다. 그리고 학습 모듈은 기 학습된 결과에 따라 온수 기 가열 시간을 자동으로 설정하거나 변경하는 정보와 온수 온도를 자동으로 설정하거나 변경하는 정보를 출력 한다. 학습 모듈은 과거 일정 정보를 이용하여 사용자의 과거 온수 사용에 대한 특성을 확인하고 이에 대응하여 온수기 제어 정보를 생성할 수 있다. 또한, 학습 모듈는 앞으로의 사용자의 일정 정보를 이용하여 사용자 의 부재 여부를 확인하고, 온수의 제어 정보를 생성할 수 있다. 예를 들어, 학습 모듈은 사용자가 부재시 사용자의 귀가 시간을 반영하여 온수 가열 시간을 조정한다. 학습 모듈을 이용할 경우, 서버는 사용자의 사용시간 및 온수기 온도 설정 이력, 그리고 일정 정보 (캘린더 스케줄)를 입력받는다. 그 결과 서버는 온수기가 배치된 공간에서 발생한 특수한 사용 환경을 반 영하여 온수기의 동작 시간과 온도를 자동으로 설정하는 제어 정보를 온수기에게 제공한다. 그리고 온수기 는 학습 기반으로 산출된 제어정보를 이용하여 사용자 맞춤형으로 자동으로 온수와 난방을 제공할 수 있다. 특히, 서버는 사용자의 향후 일정 정보를 활용할 수 있으므로, 온수기의 동작 시간과 온도를 최적으로 조 정하여 최적 온도를 추천할 수 있다. 물론, 도 5에 도시된 바와 같이 서버는 온수기가 배치된 지역이나 계 절에 따른 온도 정보를 학습 모듈에 입력할 경우 제어 정보의 정확도를 높일 수 있다. 본 발명의 실시예들을 적용할 경우, 서버는 이전의 온수기의 동작 정보와, 과거/현재/미래의 사용자의 일 정 정보를 이용하여 온수기의 제어 정보를 생성한다. 특히, 동작 정보는 사용자가 온수기를 사용한 시간과 온도에 대한 정보를 포함하며 이 정보는 서버의 데이 터베이스에 누적하여 저장된다. 그리고 저장된 정보들은 학습모듈에 입력된다. 학습모듈은 사용 자가 주로 온수기를 사용하는 시간과 온도를 추정한 결과가 반영된 온수기의 제어 정보를 생성한다. 제어 정보 는 온수기를 동작시키는 기간에 대한 정보, 온도를 자동으로 조절하는 정보 등을 포함한다. 일정 정보 역시 캘린더 서비스를 제공하는 다양한 일정 서버들로부터 수신될 수 있다. 또는 사용자의 단말 장치 가 일정 정보를 서버로 전송할 수 있다. 서버는 도 4 및 도 5의 입력값들 중 일부만 선택적으로 학습 모듈에 입력할 수 있다. 도 6은 본 발명의 일 실시예에 의한 사용자의 과거 온수기 사용 패턴에 기반한 제어 정보의 생성 과정을 보여준 다. 서버는 온수기로부터 온수 동작 정보를 수신한다(S21). 그리고 서버는 일정한 기간동안 요 일 별로 온수의 동작 정보를 데이터베이스에 저장한다(S22). 서버는 N주(N은 2 이상인 자연수) 동안 누적 저장된 동작 정보를 이용하여 제어 정보를 생성한다(S23). 특 정 요일(월~금요일)의 오후 7시-9시에 온수기가 N주 동안 (2*N/3)회 이상 반복 사용된 경우, 서버는 해당 요일(월~금요일)의 오후 7시-9시 온수기 사용에 최적화된 제어 정보를 생성한다(S23). 그리고 서버는 제어 정보를 온수기에게 전송한다. 일 실시예로, 서버는 월~금요일의 온수기 사용(오후 7시~9시) 3시간 전(오후 4시)에 예열을 시작하도록 온 수기의 예열을 제어하는 제어 정보를 생성한다. 제어정보에 따라 온수기는 사용자가 사용할 시간(7시)에 최적 온도로 동작한다. 서버가 생성한 제어정보는 온수를 사용하지 않는 시간에 온수기를 예열하는 문제를 방지하고, 사용이 예측 된 시점(오후 7시)를 기준으로 온수기의 동작을 지시한다. 마찬가지로, 서버는 토요일에 3주 연속으로 사용자가 부재한 것으로 확인할 수 있다. 서버는 토요일 에 온수기의 모드가 외출 모드로 바뀌는 것을 포함한 동작 정보를 온수기로부터 수신한다. 그리고 서 버는 3주간 토요일에 온수기가 온수를 제공하지 않음을 확인한다. 서버는 누적된 동작 정보(토요일-외출모드)를 이용하여 \"토요일-온수 미사용\"이라는 제어 정보를 생성한다. 그리고 서버는 제어 정보를 온수기에게 전송하면, 온수기의 인터페이스부는 제 어 정보를 알림 메시지로 출력한다. 예를 들어 인터페이스부는 \"토요일에는 온수를 사용하지 않으시네 요.\"라고 음성 또는 텍스트로 출력한다. 사용자는 출력된 메시지를 확인하고 제어정보의 적용을 변경 또는 취소 시킬 수 있다. 온수기는 과거 사용자가 온수기를 사용한 패턴이나 설정 온도, 사용 시간 등의 선호도를 반영하여 동작할 수 있다. 서버는 시간대별 사용 패턴 이력을 동작 정보로 저장한다. 그리고 서버는 사용 패턴에 적합 한 제어 정보를 생성하여 온수기에게 제어 정보를 전송한다. 도 7은 본 발명의 일 실시예에 의한 사용자의 일정 정보에 기반한 제어 정보의 생성 과정을 보여준다. 도 6에서 살펴본 바와 같이, 서버는 매주 월-금요일에 4시부터 온수기를 예열하는 제어정보를 생성하여 온수기(10 0)에게 전송한 후이다. 서버는 사용자의 일정 정보를 수신한다(S31). 서버는 이전에 생성한 제어 정보와 수신한 일정 정보의 불일치를 확인한다(S32). 불일치란 제어정보에서 온수기가 동작할 시간과 일정 정보에서 사용자가 부재하 는 시간이 겹치는 것을 의미한다. 이러한 불일치는 온수기가 동작할 때, 사용자가 외부에 있음으로 인해 불필요한 온수기 동작이 발생할 수 있는 상황을 일 실시예로 한다. 예를 들어 포털 사이트나 구글 등의 캘린더/스케줄 서비스에서 제공하는 일정 정보는 목요일 오후 6시~10시에 외부 일정(온수기가 설치된 공간의 부재 일정)을 포함한다. 서버는 일정 정보를 반영하도록 새로운 제어 정보를 생성한다(S33). 일 실시예로, 서버는 예외적인 제어 정보를 생성한다. 예외적인 제어 정보는 목요일 오후의 온수기 예열을 취소시키는 제어 정보이다. 그리고 서버는 새로운 제어정보(예외적인 제어정보)를 온수기로 전송한다(S34). 온수기는 수신한 새로운 제어정보를 인터페이스부에 음성 또는 텍스트로 \"금일 출장으로 부재로, 온 수기 최적온도 예열을 내일로 할까요?\"를 출력한다. 사용자는 출력된 메시지를 확인하고 제어정보의 적용을 변 경 또는 취소시킬 수 있다. 적용할 경우, 그 다음날(금요일) 오후 4시에 온수기는 예열을 시작한다. 도 7은 사용자의 일정 정보와 연동하여 제어 정보가 변경 또는 새로 생성되는 과정을 보여준다. 서버는 항 시적으로 반복되는 제어 정보와, 일시적/예외적 제어 정보를 데이터베이스에 저장하고, 사용자의 일정 정 보가 변경될 경우 서버는 변경된 일정 정보를 반영하여 새로운 제어 정보를 생성할 수 있다. 서버는 제어 정보의 온수기 동작이 예정된 시간과 부재 일정 정보를 비교하여 온수기의 동작 시간(가열 시 간 또는 예열 시간)을 조정하는 제어 정보를 생성한다. 또는 서버는 새로운 시간을 추천하는 제어 정보를 생성한다. 또는 서버는 새로운 시간을 설정하는 제어 정보를 생성한다. 도 6과 같이 서버는 사용자의 사용 패턴에 적합하게 온수기의 동작을 제어하는 제어 정보를 생성한 후에도 사용 패턴과 다른 돌발적인 일정 정보를 수신할 수 있다. 서버는 수신된 일정 정보를 반영하여 온 수기의 동작 시간이나 동작 모드를 지시하는 제어 정보를 변경할 수 있다. 도 8은 본 발명의 일 실시예에 의한 빅데이터에 기반하여 온수기가 설치된 지역별 또는 계절별로 제어 정보를 생성하는 과정을 보여준다. 서버는 온수기가 설치된 지역에 대한 빅데이터를 데이터베이스에 저장한다. 예를 들어 서버 는 해당 지역의 온수 사용 패턴에 대한 빅데이터를 데이터베이스에 저장한다. 서버는 사용자의 성별/나이 등에 따른 최적 코스나 옵션을 빅데이터로 저장할 수 있다. 또는 서버는 온수기가 설치된 지역이나 국가를 포함한 영역의 온도 변화나 계절별 온도 변화에 대한 빅데이터를 데이터베이스에 저장한다(S41). 서버는 지역이나 국가, 또는 계절이나 외부 온도, 사용자 의 특성을 포함하는 빅데이터를 이용하여 제어 정보를 생성한다(S42). 생성된 제어 정보의 예시로, 온수기가 미국 텍사스에 설치되었으며, 현재 계절이 여름인 경우, 제어정보는 \"온 수기 여름 온수 온도(30도)로 설정할까요?(옵션)\"이라는 메시지와 \"온수기 온도: 30도\"를 포함한다. 또는 온수기가 미국 뉴욕에 설치되었으며, 현재 계절이 겨울로 한파를 지시하는 빅데이터가 저장된 경우, 제어 정보는 \"해당 지역 한파예보입니다. 온수 온도를 45도로 설정할까요?(옵션)\"이라는 메시지와 \" 온수기 온도: 45 도\"를 포함한다. 서버는 온수기에게 새로운 제어 정보를 전송한다(S43). 사용자는 표시된 메시지를 확인하고 옵션을 선택할 수 있다. 도 8의 과정에서 사용자는 온수기를 통해서 메시지를 확인할 수 있다. 또는 사용자는 단말 장치를 통 해서 메시지를 확인할 수 있다. 즉, 서버의 통신부가 온수기에게 새로운 제어 정보를 전송하기에 앞서, 서버는 온수기의 제어 정보를 단말 장치에게 먼저 전송한다. 여기서 제어 정보는 전술한 메시지를 포함한다. 그리고 사용자 가 단말 장치에 표시된 메시지를 확인하고 \"OK\" 버튼을 누르거나 \"Confirm\" 버튼을 누르는 등 온수기의 제 어 정보를 적용할 것을 요청할 수 있다. 서버의 통신부는 단말 장치로부터 온수기의 제어 정보를 적용할 것을 요청하는 메시지를 수신한 후, 제어 정보를 온수기에게 전송한다. 그 결과 사용자는 단말 장치를 통해 어디서나 온수기의 제어 정보 가 변경되거나 새로이 적용됨을 확인할 수 있다. 도 9는 본 발명의 일 실시예에 의한 온수기 시스템의 예시적 구성을 보여준다. 도 9는 온수기 내의 제어부(15 0)와 통신부가 온수기의 동작 정보를 서버에 전송하고, 서버로부터 제어 정보를 수신하는 과정 에서 다양한 통신 매개 장치와 단말 장치, 일정 서버 등이 상호작용하는 과정을 보여준다. 온수기의 제어 부는 서버가 제공하는 제어 정보를 이용하여 온수기를 제어한다. 통신부는 공유기를 경유하여 서버에게 동작 정보를 전송하고 서버로부터 제어 정보를 수신 한다. 단말 장치(300a)는 서버로부터 현재 온수기의 동작 정보, 향후 온수기가 동작할 경우 적용되는 제어 정보를 확인할 수 있다. 동작 정보는 현재 온수기의 온도 상태나 동작 모드를 포함한다. 또한, 서버는 지속적으로 데이터베이스에 온수기의 동작 정보를 누적하여 저장한다. 그리고 서 버의 제어부는 동작 정보에 기반하여 사용자의 패턴에 적합한 제어 정보를 생성한다. 특히, 이 과정 에서 서버는 일정 서버에 저장된 일정 정보를 이용하여 제어 정보를 생성할 수 있다. 그리고 일정 서버는 단말 장치(300b)와 통신하여 일정 정보를 업데이트하거나 추가할 수 있다. 서버 는 일정 서버의 일정 정보를 이용하여 사용자의 부재 시간을 확인할 수 있으며, 이에 기반하여 제어 정보 를 생성할 수 있다. 서버의 서버 제어부는 일정 정보가 변경될 경우, 제어 정보를 다시 변경할 수 있 다. 두 개의 단말 장치(300a, 300b)는 하나의 장치의 동작 예시를 보여준다. 따라서, 하나의 단말 장치가 300a와 같 이 온수기의 동작 정보를 확인하며 또한 300b와 같이 일정 정보를 추가/변경할 수 있다. 300a에서 동작하 는 애플리케이션은 온수기를 직접 제어하거나 모니터링할 수 있다. 300b에서 동작하는 애플리케이션은 일 정 정보를 추가하거나 변경할 수 있다. 따라서, 서버는 사용자의 출퇴근 시간, 부재시간, 혹은 상주 시간을 미리 예측하여 이에 따라 온수기(10 0)를 제어하는 제어 정보를 생성한다. 생성된 제어 정보는 온수기의 자동 예열 기능을 지시할 수 있다. 서 버는 단말 장치에게 예열 시간을 제안하는 메시지를 송신하고, 사용자가 이를 확인하면 서버는 제안된 예열 시간으로 온수기를 동작시키는 제어 정보를 온수기에게 전송한다. 그 결과, 온수기는 사용자가 온수기를 사용한 패턴 이력, 온수기가 배치된 공간/지역의 환경 인 자를 기반으로 최적의 자동 온수 온도를 설정할 수 있으며, 자동으로 예열 운전을 수행할 수 있다. 또한, 온수기는 사용자의 일정에 맞추어 온수기 온도를 조절할 수 있다. 또는 온수기/단말장치 는 추천한 온수 온도에 대한 정보를 출력하여 사용자가 확인할 수 있다. 그 결과 사용자의 패턴에 적합하게 서 버는 온수기를 절전 운전으로 동작하도록 온수기를 제어할 수 있다. 종래의 온수기의 온도를 제어 방식은 동일한 온도로만 유지하도록 제어하는 방식이었다. 반면, 본 발명의 실시 예에서는 서버가 온수기의 동작 정보 및 일정 정보를 데이터베이스에 저장한다. 그리고 서버 는 저장한 정보를 이용하여 사용자별 온수 온도 및 온수 사용 패턴에 따라 요일별, 시간별 온수 온도를 자 동 조절하는 제어 정보를 생성한다. 특히, 별도의 인체 감지 장치 없이도 서버는 사용자의 일정 정보를 이용하여 사용자의 부재 시간과 상황, 생활 영역 등을 확인하여 제어 정보를 생성할 수 있다. 따라서, 서버가 생성한 제어 정보로 온수기가 동작할 경우, 온수기는 실제 사용자가 거주하는 시간에 맞추어 온수기 운전시간 및 온도를 조절한다. 따라서, 온수기는 온수 최적온도 자동 설정 및 에너 지 절감 효과를 제공할 수 있다. 또한, 온수기는 지속적으로 동작 정보를 서버에 전송하므로, 사용자 의 변경된 생활 패턴 영역 정보 역시 서버에 동작 정보로 전송되어 서버는 새로운 제어 정보를 생성 할 수 있다. 온수기가 서버에게 전송하는 동작 정보는 온수기의 사용 시간, 온수 온도, 온수량 등을 포함한다. 서 버는 단말장치 또는 일정 서버로부터 회식/출장/휴가 등 일정의 상세 설명과 시간을 포함하는 일정 정보를 수신한다. 특히, 주간 단위, 요일별로 누적된 동작 정보는 사용자가 온수기를 사용하는 패턴을 반영하므로, 서버 는 다수의 온수기로부터 취합된 빅데이터에 기반하여 최적의 온수 코스를 제시하는 제어정보를 생성 할 수 있다. 그리고 생성된 제어 정보는 온수기의 자동 운전을 가능하게 한다. 즉, 본 발명의 실시예들을 적용할 경우, 온수기를 사용하는 사용자의 생활 패턴을 반영하여 서버가 온수기를 자 동으로 예열시키므로, 에너지 효율을 높일 수 있다. 또한, 본 발명의 실시예들을 적용할 경우, 온수기를 사용하 는 사용자의 부재 상황을 반영하여 서버가 온수기를 제어하므로, 온수기는 사용자의 생활 패턴을 정확하게 반영 하여 동작할 수 있다. 그리고, 본 발명의 실시예를 적용할 경우, 온수기가 배치된 지역의 온도나 지역적 사용 특성을 반영하여 서버가 온수기를 제어하므로, 온수기는 사용자의 지리적 특성이나 외부 온도의 상태를 정확하 게 반영하여 동작할 수 있다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니며, 본 발명의 목적 범위 내에서 모든 구성 요소들 이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개 의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램으로서 구현 될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시예를 구현할 수 있다. 컴 퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 반도체 기록소자를 포함하는 저장매체를 포함한 다. 또한 본 발명의 실시예를 구현하는 컴퓨터 프로그램은 외부의 장치를 통하여 실시간으로 전송되는 프로그램 모듈을 포함한다. 이상에서는 본 발명의 실시예를 중심으로 설명하였지만, 통상의 기술자의 수준에서 다양한 변경이나 변형을 가 할 수 있다. 따라서, 이러한 변경과 변형이 본 발명의 범위를 벗어나지 않는 한 본 발명의 범주 내에 포함되는 것으로 이해할 수 있을 것이다."}
{"patent_id": "10-2021-7021855", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 온수기 및 유관 장치들의 구성을 보여준다. 도 2는 본 발명의 일 실시예에 의한 서버가 동작하는 과정을 보여준다. 도 3은 본 발명의 일 실시예에 의한 서버가 사용자 사용 패턴을 감지하여 제어 정보를 생성하는 과정을 보여준 다. 도 4는 본 발명의 일 실시예에 의한 서버에 구축된 학습 모듈의 구성을 보여준다. 도 5는 본 발명의 일 실시예에 의한 딥러닝 학습 모듈의 동작 과정을 보여준다. 도 6은 본 발명의 일 실시예에 의한 사용자의 과거 온수기 사용 패턴에 기반한 제어 정보의 생성 과정을 보여준 다. 도 7은 본 발명의 일 실시예에 의한 사용자의 일정 정보에 기반한 제어 정보의 생성 과정을 보여준다. 도 8은 본 발명의 일 실시예에 의한 빅데이터에 기반하여 온수기가 설치된 지역별 또는 계절별로 제어 정보를 생성하는 과정을 보여준다. 도 9는 본 발명의 일 실시예에 의한 온수기 시스템의 예시적 구성을 보여준다."}
