{"patent_id": "10-2023-0032009", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0139148", "출원번호": "10-2023-0032009", "발명의 명칭": "3차원 구조를 갖는 뉴로모픽 소자 및 그 제조 방법", "출원인": "서울대학교산학협력단", "발명자": "김상범"}}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 3차원 구조를 갖는 뉴로모픽 소자(neuromorphicdevice)로서, 각각이 복수의 수직형 상변화 메모리 유닛을 포함하는 3차원 구조를 갖고, 상기 수직형 상변화 메모리 유닛은제 1 수직 전극과 상기 제 1 수직 전극의 적어도 일부를 둘러싸는 상변화 물질층을 포함하는 제 1 수직 구조체와 상기 제 1 수직 구조체의 외주면에 접하면서 수직 방향으로 상호 이격된 복수의 제 1 전극층을 포함하는 복수의 시냅스 블록; 상기 복수의 시냅스 블록을 상호 전기적으로 연결하기 위한 복수의 연결 부재; 및 상기 복수의 시냅스 블록 사이에 연결된 것으로, OTS(Ovonic threshold switching) 소자를 포함하는 뉴런 회로부를 구비하는, 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 복수의 시냅스 블록 각각에서 상기 복수의 수직형 상변화 메모리 유닛은 복수의 행 및 복수의 열을 이루도록 배열된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 뉴런 회로부는 수직형 뉴런 소자 유닛을 포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 수직형 뉴런 소자 유닛은 제 2 수직 전극과 상기 제 2 수직 전극의 적어도 일부를 둘러싸는 OTS(Ovonicthreshold switching) 물질층을 포함하는 제 2 수직 구조체와 상기 제 2 수직 구조체의 외주면에 접하면서 수직방향으로 상호 이격된 복수의 제 2 전극층을 포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 수직형 상변화 메모리 유닛의 상기 복수의 제 1 전극층 각각은 그에 대응되는 상기 수직형 뉴런 소자 유닛의 상기 복수의 제 2 전극층 각각과 전기적으로 연결된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서, 상기 수직형 상변화 메모리 유닛의 상기 복수의 제 1 전극층 각각은 그에 대응되는 상기 수직형 뉴런 소자 유닛의 상기 복수의 제 2 전극층 각각과 연결되어 일체를 이루도록 구성된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항에 있어서, 상기 복수의 시냅스 블록은 제 1 시냅스 블록 및 이와 인접한 제 2 시냅스 블록을 포함하고, 상기 수직형 뉴런 소자 유닛은 상기 제 1 시냅스 블록과 상기 제 2 시냅스 블록 사이에 이들과 동일한 레벨로공개특허 10-2024-0139148-3-형성된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서, 상기 복수의 시냅스 블록은 제 1 시냅스 블록 및 이와 인접한 제 2 시냅스 블록을 포함하고, 상기 복수의 연결 부재는 상기 제 1 시냅스 블록의 복수의 제 1 전극층과 상기 제 2 시냅스 블록의 복수의 제 1전극층을 일대일 방식으로 연결하는 복수의 제 1 연결 부재를 포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 복수의 제 1 연결 부재 각각에 상기 OTS 소자가 연결되어 배치된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서, 상기 복수의 시냅스 블록은 상기 제 2 시냅스 블록에 인접한 제 3 시냅스 블록을 더 포함하고, 상기 복수의 연결 부재는 상기 제 2 시냅스 블록의 복수의 제 1 수직 전극과 상기 제 3 시냅스 블록의 복수의제 1 수직 전극을 일대일 방식으로 연결하는 복수의 제 2 연결 부재를 포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서, 상기 복수의 제 2 연결 부재 각각에 상기 OTS 소자가 연결되어 배치된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서, 상기 뉴런 회로부는 신호 증폭기(signal amplifier)를 더 포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서, 상기 상변화 물질층은 제 1 칼코게나이드계 물질을 포함하고, 상기 OTS 소자는 OTS 물질로서 제 2 칼코게나이드계 물질을 포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서, 상기 3차원 구조를 갖는 뉴로모픽 소자의 입력부에 이미지 센서로부터 얻어진 이미지 데이터가 입력되도록 구성된 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서, 상기 3차원 구조를 갖는 뉴로모픽 소자는 아날로그적인 입력값을 입력받고 아날로그적인 출력값을 출력하도록구성되고, DAC(digital-to-analog converter) 및 ADC(analog-to-digital converter)를 미포함하는 3차원 구조를 갖는 뉴로모픽 소자."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "3차원 구조를 갖는 뉴로모픽 소자 및 그 제조 방법에 관해 개시되어 있다. 개시된 3차원 구조를 갖는 뉴로모픽 소자는 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 3차원 구조를 갖는 소자일 수 있다. 상기 뉴로모픽 소자는 복수의 시냅스 블록, 상기 복수의 시냅스 블록을 상호 전기적으로 연결하기 위한 복수의 연결 부재 및 상기 복수의 시냅스 블록 사이에 연결된 뉴런 회로부를 포함할 수 있다. 상기 복수의 시냅스 블록은 각 각이 복수의 수직형 상변화 메모리 유닛을 포함하는 3차원 구조를 가질 수 있고, 상기 수직형 상변화 메모리 유 닛은 제 1 수직 전극과 상기 제 1 수직 전극의 적어도 일부를 둘러싸는 상변화 물질층을 포함하는 제 1 수직 구 조체와 상기 제 1 수직 구조체의 외주면에 접하면서 수직 방향으로 상호 이격된 복수의 제 1 전극층을 포함할 수 있다. 상기 뉴런 회로부는 OTS(Ovonic threshold switching) 소자를 포함할 수 있다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전자 소자와 그 제조 방법 및 활용에 관한 것으로서, 더욱 상세하게는 뉴로모픽 소자와 그 제조 방법 및 활용에 관한 것이다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "트랜지스터의 스케일링 축소가 한계에 다다르면서, 기존의 폰 노이만(von Neumann) 방식의 컴퓨터 시스템 체계 의 한계를 극복할 수 있는 새로운 개념으로 뉴로모픽 컴퓨팅(neuromorphic computing) 시스템이 많은 관심을 받 고 있다. 뉴로모픽 컴퓨팅은 인간의 뇌를 하드웨어적으로 모방하여 인공지능 동작을 구현하는 것이다. 인간의 뇌가 매우 복잡한 기능을 수행하지만 소비하는 에너지는 20W 정도 밖에 되지 않는 것에 착안해, 뉴로모픽 컴퓨 팅은 인간의 뇌 구조 자체를 모방하여 기존 폰 노이만 방식 컴퓨팅보다 월등한 연상, 추론, 인식의 인공지능 동 작을 초 저전력으로 수행할 수 있다. 이러한 뉴로모픽 컴퓨팅을 동작하게 하는 뉴로모픽 시스템은 인간의 뇌와 마찬가지로 수많은 뉴런(뉴런 소자)과 시냅스(시냅스 소자)로 구성되며, 신호 처리와 전달을 위한 부가 회로를 포함한다. 시냅스는 뉴런들이 발현하는 스파이크(spike)의 상관 관계에 따라 그 연결 강도(weight)를 기억하고, 경우에 따라, 상기 연결 강도를 강화/ 증가(potentiation)와 억압/감소(depression) 과정을 통해 조정한다. 이때, 상기 연결 강도는 시냅스의 전기전 도도(conductance)로 표현될 수 있다. 시냅스 소자로는 RRAM(resistive random access memory) 또는 멤리스터 (memristor) 기반의 소자가 많이 연구되어 왔고, 최근에는 MOSFET(metal-oxide-semiconductor field-effect transistor) 기반의 시냅스 소자도 연구되고 있다. 뉴로모픽 시스템을 구성하는 수많은 시냅스들은, 또 다른 구성 요소인 뉴런 및 부가 회로와 병렬적 연산을 위해 복잡하게 연결될 수 있다. 또한, 메모리 어레이를 인공지능 연산에 사용하기 위해서, 디지털 신호를 아날로그 신호로 변화하기 위한 DAC(digital-to-analog converter) 및 아날로그 신호를 디지털 신호로 변환하기 위한 ADC(analog-to-digital converter)가 메모리 어레이들 사이에 공유될 수 있다. 따라서, DAC와 ADC의 사용 및 반복적인 데이터와 시그널의 이동에 따라, 데이터 처리 시간 및 에너지/전력의 소모가 증가하는 문제가 발생한 다. 한편, 뉴로모픽 학습 알고리즘인 평형 전파(equilibrium propagation)는 아날로그적 특성을 갖는 알고리즘으로 서, 뉴로모픽 연산 과정에서 데이터를 변환하기 위한 ADC 및 DAC 회로를 필요로 하지 않는 이점이 있다. 그러나, 평형 전파(equilibrium propagation) 알고리즘을 수행할 수 있는 하드웨어를 구현하기 위해서는, 시냅 스 용도의 프로그램 가능한 저항 소자와 네트워크에 비선형성(nonlinearity)을 추가하기 위한 역평행 다이오드 (antiparallel diodes) 등이 요구된다. 그러나, 상기한 프로그램 가능한 저항 소자와 역평행 다이오드 등을 포 함하는 복잡한 연결 구조의 네트워크 장치를 제작하는데는 다양한 기술적 문제와 어려움이 존재한다. 그 밖에도, 뉴로모픽 시스템을 3차원적 구조로 제작함에 있어서, 시냅스 소자들과 뉴런 소자들을 연결한 네트워크 구조를 제작하는데는 여러 가지 한계와 문제점이 있다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 3차원 구 조를 갖는 뉴로모픽 소자(neuromorphic device)를 제공하는데 있다. 또한, 본 발명이 이루고자 하는 기술적 과제는 고집적화가 가능하고 뉴런 회로부의 구성을 단순화시킬 수 있으 며 시냅스 소자들과 뉴런 회로부를 용이하게 연결하여 제작할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 제공 하는데 있다. 또한, 본 발명이 이루고자 하는 기술적 과제는 이미지 데이터와 같은 소정의 입력 데이터에 대하여 효율적인 데 이터 처리를 수행할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 제공하는데 있다. 또한, 본 발명이 이루고자 하는 기술적 과제는 상기한 뉴로모픽 소자의 제조 방법을 제공하는데 있다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제에 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로부터 당업자에게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 3차원 구조를 갖 는 뉴로모픽 소자(neuromorphic device)로서, 각각이 복수의 수직형 상변화 메모리 유닛을 포함하는 3차원 구조 를 갖고, 상기 수직형 상변화 메모리 유닛은 제 1 수직 전극과 상기 제 1 수직 전극의 적어도 일부를 둘러싸는 상변화 물질층을 포함하는 제 1 수직 구조체와 상기 제 1 수직 구조체의 외주면에 접하면서 수직 방향으로 상호 이격된 복수의 제 1 전극층을 포함하는 복수의 시냅스 블록; 상기 복수의 시냅스 블록을 상호 전기적으로 연결 하기 위한 복수의 연결 부재; 및 상기 복수의 시냅스 블록 사이에 연결된 것으로, OTS(Ovonic threshold switching) 소자를 포함하는 뉴런 회로부를 구비하는 3차원 구조를 갖는 뉴로모픽 소자가 제공된다. 상기 복수의 시냅스 블록 각각에서 상기 복수의 수직형 상변화 메모리 유닛은 복수의 행 및 복수의 열을 이루도 록 배열될 수 있다. 상기 뉴런 회로부는 수직형 뉴런 소자 유닛을 포함할 수 있다. 상기 수직형 뉴런 소자 유닛은 제 2 수직 전극과 상기 제 2 수직 전극의 적어도 일부를 둘러싸는 OTS(Ovonic threshold switching) 물질층을 포함하는 제 2 수직 구조체와 상기 제 2 수직 구조체의 외주면에 접하면서 수직 방향으로 상호 이격된 복수의 제 2 전극층을 포함할 수 있다. 상기 수직형 상변화 메모리 유닛의 상기 복수의 제 1 전극층 각각은 그에 대응되는 상기 수직형 뉴런 소자 유닛 의 상기 복수의 제 2 전극층 각각과 전기적으로 연결될 수 있다. 상기 수직형 상변화 메모리 유닛의 상기 복수의 제 1 전극층 각각은 그에 대응되는 상기 수직형 뉴런 소자 유닛 의 상기 복수의 제 2 전극층 각각과 연결되어 일체를 이루도록 구성될 수 있다. 상기 복수의 시냅스 블록은 제 1 시냅스 블록 및 이와 인접한 제 2 시냅스 블록을 포함할 수 있고, 상기 수직형 뉴런 소자 유닛은 상기 제 1 시냅스 블록과 상기 제 2 시냅스 블록 사이에 이들과 동일한 레벨로 형성될 수 있 다. 상기 복수의 시냅스 블록은 제 1 시냅스 블록 및 이와 인접한 제 2 시냅스 블록을 포함할 수 있고, 상기 복수의 연결 부재는 상기 제 1 시냅스 블록의 복수의 제 1 전극층과 상기 제 2 시냅스 블록의 복수의 제 1 전극층을 일 대일 방식으로 연결하는 복수의 제 1 연결 부재를 포함할 수 있다. 상기 복수의 제 1 연결 부재 각각에 상기 OTS 소자가 연결되어 배치될 수 있다. 상기 복수의 시냅스 블록은 상기 제 2 시냅스 블록에 인접한 제 3 시냅스 블록을 더 포함할 수 있고, 상기 복수 의 연결 부재는 상기 제 2 시냅스 블록의 복수의 제 1 수직 전극과 상기 제 3 시냅스 블록의 복수의 제 1 수직 전극을 일대일 방식으로 연결하는 복수의 제 2 연결 부재를 포함할 수 있다. 상기 복수의 제 2 연결 부재 각각에 상기 OTS 소자가 연결되어 배치될 수 있다. 상기 뉴런 회로부는 신호 증폭기(signal amplifier)를 더 포함할 수 있다. 상기 상변화 물질층은 제 1 칼코게나이드계 물질을 포함할 수 있고, 상기 OTS 소자는 OTS 물질로서 제 2 칼코게 나이드계 물질을 포함할 수 있다. 상기 3차원 구조를 갖는 뉴로모픽 소자의 입력부에 이미지 센서로부터 얻어진 이미지 데이터가 입력되도록 구성 될 수 있다. 상기 3차원 구조를 갖는 뉴로모픽 소자는 아날로그적인 입력값을 입력받고 아날로그적인 출력값을 출력하도록 구성될 수 있고, DAC(digital-to-analog converter) 및 ADC(analog-to-digital converter)를 미포함할 수 있다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 3차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 따라서, 실시예들에 따른 뉴로모픽 소자는 DAC(digital-to-analog converter) 및 ADC(analog-to-digital converter)를 사용하지 않을 수 있고, 데이터 처리 시간 및 에너지/전력 소모 측면 에서 상당한 이점을 가질 수 있다. 실시예들에 따른 뉴로모픽 소자는 DAC 및 ADC 등의 부가 회로를 필요로 하지않을 수 있으므로, 이와 관련해서 제조 공정 및 면적 측면에서도 장점을 가질 수 있다. 또한, 본 발명의 실시예들에 따르면, 고집적화가 가능하고 뉴런 회로부의 구성을 단순화시킬 수 있으며 시냅스 소자들과 뉴런 회로부를 용이하게 연결하여 제작할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 특히, 복수의 수직형 상변화 메모리 유닛을 포함하는 시냅스 블록과 OTS(Ovonic threshold switching) 소 자를 포함하는 뉴런 회로부를 사용함으로써, 뉴런 회로부의 구성을 단순화함과 동시에 시냅스 블록과 뉴런 회로 부를 집적 방식으로 용이하게 제조할 수 있다. 또한, 본 발명의 실시예들에 따르면, 이미지 데이터와 같은 소정의 입력 데이터에 대하여 효율적인 데이터 처리 를 수행할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 예컨대, 이미지 센서로부터 획득된 이 미지 데이터의 경우, 2차원 어레이 형태를 가질 수 있고, 이러한 이미지 데이터는 본 발명의 실시예에 따른 뉴 로모픽 소자의 입력부에 용이하게 입력 가능하기 때문에, 이미지 데이터 처리에 상당한 장점을 가질 수 있다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "그러나, 본 발명의 효과는 상기 효과들로 한정되는 것은 아니며, 본 발명의 기술적 사상 및 영역으로부터 벗어 나지 않는 범위에서 다양하게 확장될 수 있다."}
{"patent_id": "10-2023-0032009", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여 본 발명의 실시예들을 상세히 설명하기로 한다. 이하에서 설명할 본 발명의 실시예들은 당해 기술 분야에서 통상의 지식을 가진 자에게 본 발명을 더욱 명확하 게 설명하기 위하여 제공되는 것이고, 본 발명의 범위가 하기 실시예에 의해 한정되는 것은 아니며, 하기 실시 예는 여러 가지 다른 형태로 변형될 수 있다. 본 명세서에서 사용된 용어는 특정 실시예를 설명하기 위하여 사용되며, 본 발명을 제한하기 위한 것이 아니다. 본 명세서에서 사용되는 단수 형태의 용어는 문맥상 다른 경우를 분명히 지적하는 것이 아니라면, 복수의 형태 를 포함할 수 있다. 또한, 본 명세서에서 사용되는 \"포함한다(comprise)\" 및/또는 \"포함하는(comprising)\"이라 는 용어는 언급한 형상, 단계, 숫자, 동작, 부재, 요소 및/또는 이들 그룹의 존재를 특정하는 것이며, 하나 이 상의 다른 형상, 단계, 숫자, 동작, 부재, 요소 및/또는 이들 그룹의 존재 또는 부가를 배제하는 것이 아니다.또한, 본 명세서에서 사용된 \"연결\"이라는 용어는 어떤 부재들이 직접적으로 연결된 것을 의미할 뿐만 아니라, 부재들 사이에 다른 부재가 더 개재되어 간접적으로 연결된 것까지 포함하는 개념이다. 아울러, 본원 명세서에서 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 본 명세서에서 사용된 용 어 \"및/또는\"은 해당 열거된 항목 중 어느 하나 및 하나 이상의 모든 조합을 포함한다. 또한, 본원 명세서에서 사용되는 \"약\", \"실질적으로\" 등의 정도의 용어는 고유한 제조 및 물질 허용 오차를 감안하여, 그 수치나 정도 의 범주 또는 이에 근접한 의미로 사용되고, 본원의 이해를 돕기 위해 제공된 정확하거나 절대적인 수치가 언급 된 개시 내용을 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 이하 첨부된 도면들을 참조하여 본 발명의 실시예들에 대해 상세히 설명한다. 첨부된 도면에 도시된 영역이나 파트들의 사이즈나 두께는 명세서의 명확성 및 설명의 편의성을 위해 다소 과장되어 있을 수 있다. 상세한 설명 전체에 걸쳐 동일한 참조번호는 동일한 구성요소를 나타낸다. 도 1은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자(neuromorphic device)에 적용될 수 있는 시냅스 블록(synapse block)(SB1)을 예시적으로 보여주는 사시도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자는 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 소자일 수 있다. 상기 뉴로모픽 소자는 복수의 시냅스 블록(synapse block), 상기 복수의 시냅스 블록을 상호 전기적으로 연결하기 위한 복수의 연결 부재 및 상기 복수의 시냅스 블록 사이에 연결된 뉴런 회로부를 포함할 수 있다. 여기서, 상기 뉴런 회로부는 OTS(Ovonic threshold switching) 소자를 포함할 수 있다. 도 1은 상기 시냅스 블록(SB1) 하나의 구조를 예시적으로 보여준다. 시냅스 블록(SB1)은 수직형(vertical) PRAM(phase-change random access memory) 구조, 즉, VPRAM 구조를 포함할 수 있다. 시냅스 블록(SB1)은 복수 의 수직형 상변화 메모리 유닛(PU10)을 포함하는 3차원 구조를 가질 수 있다. 수직형 상변화 메모리 유닛(PU1 0)은 제 1 수직 전극(VE1)과 제 1 수직 전극(VE1)의 적어도 일부를 둘러싸는 상변화 물질층(PL1)을 포함하는 제 1 수직 구조체(VS1)와 상기 제 1 수직 구조체(VS1)의 외주면에 접하면서 수직 방향(즉, Z축 방향)으로 상호 이 격된 복수의 제 1 전극층(EL10)을 포함할 수 있다. 복수의 제 1 전극층(EL10) 사이에는 제 1 절연층(NL10)이 배 치될 수 있다. 제 1 절연층(NL10)과 제 1 전극층(EL10)이 제 1 수직 구조체(VS1)의 외주면에 접하면서 수직 방 향으로 교대로 반복해서 적층될 수 있다. 제 1 절연층(NL10)과 제 1 전극층(EL10)은 제 1 수직 구조체(VS1)의 외주면의 적어도 일부를 둘러싸면서 교대로 적층될 수 있다. 수직 방향으로 이격된 복수의 제 1 전극층(EL10)은 동일한 물질로 형성될 수 있지만, 그렇지 않을 수도 있다. 또한, 수직 방향으로 이격된 복수의 제 1 절연층 (NL10)은 동일한 물질로 형성될 수 있지만, 그렇지 않을 수도 있다. 복수의 제 1 전극층(EL10)은 제 1 그룹의 전극층이라고 할 수 있고, 복수의 제 1 절연층(NL10)은 제 1 그룹의 절연층이라고 할 수 있다. 일 실시예에 따르면, 하나의 시냅스 블록(SB1) 내에서 복수의 제 1 전극층(EL10) 각각은 복수의 수직형 상변화 메모리 유닛(PU10)에 공통적으로 적용되도록 확장된 구조를 가질 수 있다. 다시 말해, 복수의 수직형 상변화 메 모리 유닛(PU10)에서 동일 높이(레벨)에 존재하는 제 1 전극층들(EL10)은 서로 연결되어 일체화된 하나의 층 구 조를 이룰 수 있다. 이와 유사하게, 하나의 시냅스 블록(SB1) 내에서 복수의 제 1 절연층(NL10) 각각은 복수의 수직형 상변화 메모리 유닛(PU10)에 공통적으로 적용되도록 확장된 구조를 가질 수 있다. 다시 말해, 복수의 수 직형 상변화 메모리 유닛(PU10)에서 동일 높이(레벨)에 존재하는 제 1 절연층들(NL10)은 서로 연결되어 일체화 된 하나의 층 구조를 이룰 수 있다. 따라서, 시냅스 블록(SB1)은 복수의 제 1 수직 구조체(VS1)의 외주면을 둘 러싸면서 수직 방향으로 교대로 적층된 제 1 절연층(NL10) 및 제 1 전극층(EL10)을 포함한다고 할 수 있다. 하나의 수직형 상변화 메모리 유닛(PU10)에서 하나의 제 1 전극층(EL10)과 제 1 수직 전극(VE1) 사이의 교차점 영역에 하나의 셀(시냅스 셀)이 정의될 수 있다. 따라서, 하나의 수직형 상변화 메모리 유닛(PU10)에는 수직 방 향으로 이격된 복수의 셀(시냅스 셀)이 정의될 수 있다. 상기 셀(시냅스 셀)은 하나의 제 1 전극층(EL10)과 이 와 교차하는 하나의 제 1 수직 전극(VE1) 및 이들 사이에 배치된 상변화 물질층(PL1) 영역에 의해 정의될 수 있 다. 시냅스 블록(SB1)은 수직 배선(즉, VE1)과 수평 배선(즉, EL10)이 교차하는 크로스바 어레이(crossbar array) 구조를 갖는다고 할 수 있다. 상기 셀(시냅스 셀)은 일종의 메모리 셀일 수 있고, 복수의 저항 상태를 가질 수 있다. 일례에 따르면, 상기 셀 (시냅스 셀)은 3개 이상의 저항 상태를 가질 수 있다. 상기 셀(시냅스 셀)은, 예를 들어, 아날로그적으로 변화 되는 복수의 저항 상태를 가질 수 있다. 상기 셀에 대응하는 상변화 물질층(PL1) 영역의 상변화 정도에 따라서저항 상태가 결정될 수 있다. 필요에 따라, 복수의 셀(시냅스 셀)에 대한 프로그래밍을 수행할 수 있다. 예를 들어, 복수의 제 1 전극층(EL10) 중 어느 하나를 선택하고 복수의 제 1 수직 전극(VE1) 중 어느 하나를 선택하 여, 선택된 제 1 전극층(EL10)과 선택된 제 1 수직 전극(VE1) 사이에 전기적 신호(전압 신호)를 인가함으로써, 선택된 셀에 대한 프로그래밍을 수행할 수 있다. 일 실시예에 따르면, 복수의 수직형 상변화 메모리 유닛(PU10)은 복수의 행 및 복수의 열을 이루도록 배열될 수 있다. 예를 들어, 복수의 수직형 상변화 메모리 유닛(PU10)은 X축 방향과 평행한 방향으로 M개의 행을 이룰 수 있고, Y축 방향과 평행한 방향으로 N개의 열을 이룰 수 있다. 다시 말해, X축 방향으로 하나의 라인에 N개의 수 직형 상변화 메모리 유닛(PU10)이 배열될 수 있고, Y축 방향으로 하나의 라인에 M개의 수직형 상변화 메모리 유 닛(PU10)이 배열될 수 있다. 한편, Z축 방향으로는 L개의 제 1 전극층(EL10)이 배열될 수 있다. 따라서, 이 경 우, 시냅스 블록(SB1)은 N×M×L개의 셀(시냅스 셀)을 가질 수 있다. 그러나, 도 1을 참조하여 설명한 복수의 수직형 상변화 메모리 유닛(PU10)의 배열 형태, 제 1 전극층(EL10)의 구조, 제 1 절연층(NL10)의 구조 등은 다양하게 변화될 수 있다. 도 2는 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자에 적용될 수 있는 뉴런 회로부의 구성을 설명하기 위한 사시도이다. 도 2를 참조하면, 본 발명의 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자는 복수의 시냅스 블록 사이에 연 결된 뉴런 회로부를 포함할 수 있다. 상기 뉴런 회로부는 OTS(Ovonic threshold switching) 소자를 포함할 수 있다. 상기 뉴런 회로부는 수직형 뉴런 소자 유닛(NU10)을 포함할 수 있다. 도 2는 하나의 수직형 뉴런 소자 유닛(NU10)을 예시적으로 보여준다. 수직형 뉴런 소자 유닛(NU10)은 제 2 수직 전극(VE2)과 제 2 수직 전극(VE2)의 적어도 일부를 둘러싸는 OTS(Ovonic threshold switching) 물질층(SL2)을 포함하는 제 2 수직 구조체(VS2)와 상기 제 2 수직 구조체(VS2)의 외주면에 접하면서 수직 방향으로 상호 이격 된 복수의 제 2 전극층(EL20)을 포함할 수 있다. 복수의 제 2 전극층(EL20) 사이에는 제 2 절연층(NL20)이 배치 될 수 있다. 제 2 절연층(NL20)과 제 2 전극층(EL20)이 제 2 수직 구조체(VS2)의 외주면에 접하면서 수직 방향 으로 교대로 반복해서 적층될 수 있다. 제 2 절연층(NL20)과 제 2 전극층(EL20)은 제 2 수직 구조체(VS2)의 외 주면의 적어도 일부를 둘러싸면서 교대로 적층될 수 있다. 수직 방향으로 이격된 복수의 제 2 전극층(EL20)은 동일한 물질로 형성될 수 있지만, 그렇지 않을 수도 있다. 또한, 수직 방향으로 이격된 복수의 제 2 절연층 (NL20)은 동일한 물질로 형성될 수 있지만, 그렇지 않을 수도 있다. 복수의 제 2 전극층(EL20)은 제 2 그룹의 전극층이라고 할 수 있고, 복수의 제 2 절연층(NL20)은 제 2 그룹의 절연층이라고 할 수 있다. 하나의 수직형 뉴런 소자 유닛(NU10)에서 하나의 제 2 전극층(EL20)과 제 2 수직 전극(VE2) 사이의 교차점 영역 에 하나의 OTS 소자가 정의될 수 있다. 따라서, 하나의 수직형 뉴런 소자 유닛(NU10)에는 수직 방향으로 이격된 복수의 OTS 소자가 정의될 수 있다. 상기 OTS 소자는 하나의 제 2 전극층(EL20)과 이와 교차하는 하나의 제 2 수직 전극(VE2) 및 이들 사이에 배치된 OTS 물질층(SL2) 영역에 의해 정의될 수 있다. 상기 하나의 OTS 소자는 하나의 뉴런 소자(단위 뉴런 소자)에 해당할 수 있다. 수직형 뉴런 소자 유닛(NU10)의 복수의 제 2 전극층(EL20) 각각은 그에 대응되는 상기 수직형 상변화 메모리 유 닛(도 1의 PU10)의 상기 복수의 제 1 전극층(도 1의 EL10) 각각과 전기적으로 연결될 수 있다. 일 실시예에 따 르면, 수직형 뉴런 소자 유닛(NU10)의 복수의 제 2 전극층(EL20) 각각은 그에 대응되는 상기 수직형 상변화 메 모리 유닛(도 1의 PU10)의 상기 복수의 제 1 전극층(도 1의 EL10) 각각과 연결되어 일체를 이루도록 구성될 수 있다. 이에 대해서는, 추후에 도 7 등을 참조하여 보다 상세히 설명한다. 도 3은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자에 적용될 수 있는 OTS 소자의 스위칭 특 성을 보여주는 그래프이다. 도 3을 참조하면, 본 발명의 실시예에 따른 뉴로모픽 소자에 적용될 수 있는 OTS 소자는 양(+)의 방향과 음(- )의 방향 모두에서 스위칭이 발생하는 특성을 가질 수 있다. OTS 소자는 문턱 전압 이상의 전압이 인가될 때 스 위칭될 수 있다. 그래프의 좌우 양단부에서 나타나는 일정한 전류는 측정 장비에서의 컴플라이언스(compliance) 전류값으로, 측정 장비에서 그 이상으로는 측정이 불가할 수 있다. 이러한 OTS 소자는 역평행 다이오드(antiparallel diodes), 즉, 역평행 다이오드 쌍(antiparallel diode pai r)과 유사한 특성을 가질 수 있다. 평형 전파(equilibrium propagation) 알고리즘을 수행할 수 있는 하드웨어를 구현하기 위해서는, 시냅스 용도의 프로그램 가능한 저항 소자와 네트워크에 비선형성(nonlinearity)을 추가하 기 위한 역평행 다이오드(antiparallel diodes) 등이 요구되었다. 여기서, 상기 역평행 다이오드(antiparalleldiodes)는 뉴런 회로에 적용된다. 뉴런 회로는 뉴로모픽 소자에서 시냅스 그룹들 사이에 배치되는 노드들을 의 미한다. 상기한 프로그램 가능한 저항 소자와 역평행 다이오드 등을 포함하는 복잡한 연결 구조의 네트워크 장 치를 제작하는데는 다양한 기술적 문제와 어려움이 존재한다. 그러나, 본 발명의 실시예에서는 역평행 다이오드 (antiparallel diodes)를 상기 OTS 소자로 대체함으로써, 상기한 기술적 문제와 어려움을 해결할 수 있다. VPRAM 구성을 갖는 시냅스 블록과 OTS 소자를 함께 적용함으로써, 3차원 구조를 갖는 뉴로모픽 소자의 제조 시, 집적 상의 어려움 등을 해결할 수 있다. 뉴런 회로에서 역평행 다이오드(antiparallel diodes)는 뉴런 노드(neuron node)의 전압의 상한/하한을 클리핑 (clipping)하는 역할을 하는데, 상기한 OTS 소자의 스위칭 특성은 역평행 다이오드(antiparallel diodes)와 유 사하기 때문에, 상기 OTS 소자는 역평행 다이오드와 동일하거나 유사한 역할을 수행할 수 있다. 하나의 OTS 소 자가 두 개의 다이오드의 역할을 대체할 수 있고, 또한 OTS 소자는 VPRAM 구성을 갖는 시냅스 블록과 함께 수직 형태로 용이하게 집적될 수 있다. 따라서, 상기 OTS 소자를 적용함으로써, 3차원 구조를 갖는 시냅스 블록에 적 합한 뉴런 회로부를 용이하게 구현할 수 있다. 도 4는 비교예에 따른 것으로, 역평행 다이오드(antiparallel diodes)를 포함하는 단위 뉴런 소자를 보여주는 회로도이다. 도 4를 참조하면, 비교예에 따른 단위 뉴런 소자는 역평행 방향으로 배치된 두 개의 다이오드(D1, D2), 즉, 제 1 다이오드(D1) 및 제 2 다이오드(D2)를 포함할 수 있다. 여기서, 제 1 다이오드(D1)에 제 1 전압 소스(V1)가 연결될 수 있고, 제 2 다이오드(D2)에 제 2 전압 소스(V2)가 연결될 수 있다. 제 1 및 제 2 전압 소스(V1, V2) 는 접지(GND)에 연결될 수 있다. 이러한 역평행 다이오드(antiparallel diodes)를 포함하는 단위 뉴런 소자는 3 차원 구조를 갖는 뉴로모픽 소자에 적용하여 제조하기가 용이하지 않을 수 있다. 도 5는 본 발명의 다른 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자에 적용될 수 있는 뉴런 회로부의 구성 을 설명하기 위한 사시도이다. 도 5를 참조하면, 본 발명의 다른 실시예의 경우, 상기 뉴런 회로부는 OTS 소자(SD1) 및 OTS 소자(SD1)에 연결 된 신호 증폭기(signal amplifier)(AF1)를 포함할 수 있다. OTS 소자(SD1)와 신호 증폭기(AF1)는 두 개의 시냅 스 블록 사이에 직렬적으로 연결될 수 있다. 신호 증폭기(AF1)는 신호를 증폭하는 역할을 하는 것으로서, 일반 적인 신호 증폭용 회로 구성을 가질 수 있다. 신호 증폭기(AF1)는 증폭기 회로(amplifier circuit)라고 할 수 있다. 신호 증폭기(AF1)의 사용은 선택적인(optional) 것일 수 있다. 도 6은 도 5의 신호 증폭기(AF1)가 가질 수 있는 회로 구성을 예시적으로 보여주는 회로도이다. 도 6을 참조하면, 신호 증폭기(AF1)는 도시된 바와 같은 회로 구성을 가질 수 있다. 신호 증폭기(AF1)는 전류 소스(CS1) 및 이와 연결된 전압 소스(VS1)를 포함할 수 있다. 전류 소스(CS1)는 CCCS(current controlled current source)일 수 있고, 전압 소스(VS1)는 VCVS(voltage controlled voltage source)일 수 있다. 전류 소 스(CS1)와 전압 소스(VS1)는 각각 접지(GND)에 연결될 수 있다. 그러나, 도 6에 도시된 신호 증폭기(AF1)의 회 로 구성은 예시적인 것에 불과하고, 이는 다양하게 변화될 수 있다. 도 7은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자를 보여주는 사시도이다. 도 7을 참조하면, 본 발명의 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자는 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 소자일 수 있다. 상기 뉴로모픽 소자는 복수의 시냅스 블록(SB10), 복수 의 시냅스 블록(SB10)을 상호 전기적으로 연결하기 위한 복수의 연결 부재(CM10) 및 복수의 시냅스 블록(SB1) 사이에 연결된 뉴런 회로부(NC10)를 포함할 수 있다. 복수의 시냅스 블록(SB10) 각각은 도 1을 참조하여 설명한 바와 같은 구성 또는 그와 유사한 구성을 가질 수 있 다. 복수의 시냅스 블록(SB10) 각각은 복수의 수직형 상변화 메모리 유닛(PU10)을 포함하는 3차원 구조를 가질 수 있다. 수직형 상변화 메모리 유닛(PU10)은 제 1 수직 전극(VE1)과 제 1 수직 전극(VE1)의 적어도 일부를 둘 러싸는 상변화 물질층(PL1)을 포함하는 제 1 수직 구조체(VS1)와 상기 제 1 수직 구조체(VS1)의 외주면에 접하 면서 수직 방향으로 상호 이격된 복수의 제 1 전극층(EL10)을 포함할 수 있다. 복수의 제 1 전극층(EL10) 사이 에는 제 1 절연층(NL10)이 배치될 수 있다. 제 1 절연층(NL10)과 제 1 전극층(EL10)이 제 1 수직 구조체(VS1)의 외주면에 접하면서 수직 방향으로 교대로 반복해서 적층될 수 있다. 일 실시예에 따르면, 하나의 시냅스 블록 (SB1, SB2, SB3) 내에서 복수의 제 1 전극층(EL10) 각각은 복수의 수직형 상변화 메모리 유닛(PU10)에 공통적으 로 적용되도록 확장된 구조를 가질 수 있다. 복수의 시냅스 블록(SB10) 각각에서 복수의 수직형 상변화 메모리 유닛(PU10)은 복수의 행 및 복수의 열을 이루 도록 배열될 수 있다. 예를 들어, 복수의 수직형 상변화 메모리 유닛(PU10)은 X축 방향과 평행한 방향으로 M개 의 행을 이룰 수 있고, Y축 방향과 평행한 방향으로 N개의 열을 이룰 수 있다. 다시 말해, X축 방향으로 하나의 라인에 N개의 수직형 상변화 메모리 유닛(PU10)이 배열될 수 있고, Y축 방향으로 하나의 라인에 M개의 수직형 상변화 메모리 유닛(PU10)이 배열될 수 있다. 한편, Z축 방향으로는 L개의 제 1 전극층(EL10)이 배열될 수 있다. 따라서, 이 경우, 복수의 시냅스 블록(SB10) 각각은 N×M×L개의 셀(시냅스 셀)을 가질 수 있다. 복수의 시냅스 블록(SB10)은, 예컨대, 3개 이상의 시냅스 블록을 포함할 수 있다. 복수의 시냅스 블록(SB10)은 제 1 시냅스 블록(SB1) 및 이와 인접한 제 2 시냅스 블록(SB2)을 포함할 수 있다. 또한, 복수의 시냅스 블록 (SB10)은 하고, 제 2 시냅스 블록(SB2)에 인접한 제 3 시냅스 블록(SB3)을 포함할 수 있다. 제 2 시냅스 블록 (SB2)은 제 1 시냅스 블록(SB1)에 대하여 X축에 평행한 방향으로 이격하여 배치될 수 있고, 제 3 시냅스 블록 (SB3)은 제 2 시냅스 블록(SB2)에 대하여 Y축에 평행한 방향으로 이격하여 배치될 수 있다. 그러나, 제 1 내지 제 3 시냅스 블록(SB1, SB2, SB3)의 위치 관계는 다양하게 변화될 수 있다. 복수의 연결 부재(CM10)는 제 1 시냅스 블록(SB1)과 제 2 시냅스 블록(SB2)을 연결하는 복수의 제 1 연결 부재 (CM11)를 포함할 수 있다. 예를 들어, 복수의 제 1 연결 부재(CM11)는 제 1 시냅스 블록(SB1)의 복수의 제 1 전 극층(EL10)과 제 2 시냅스 블록(SB2)의 복수의 제 1 전극층(EL10)을 일대일(1:1) 방식으로 연결하도록 구성될 수 있다. 일 실시예에 따르면, 복수의 제 1 연결 부재(CM11)는 전극층 형태를 가질 수 있다. 또한, 복수의 제 1 연결 부 재(CM11) 각각은 그에 대응하는 제 1 시냅스 블록(SB1)의 복수의 제 1 전극층(EL10) 각각과 일체를 이루도록 구 성될 수 있다. 또한, 복수의 제 1 연결 부재(CM11) 각각은 그에 대응하는 제 2 시냅스 블록(SB2)의 복수의 제 1 전극층(EL10) 각각과 일체를 이루도록 구성될 수 있다. 또한, 복수의 연결 부재(CM10)는 제 2 시냅스 블록(SB2)과 제 3 시냅스 블록(SB3)을 연결하는 복수의 제 2 연결 부재(CM12)를 포함할 수 있다. 예를 들어, 복수의 제 2 연결 부재(CM12)는 제 2 시냅스 블록(SB2)의 복수의 제 1 수직 전극(VE1)과 제 3 시냅스 블록(SB3)의 복수의 제 1 수직 전극(VE1)을 일대일(1:1) 방식으로 연결하도록 구성될 수 있다. 일 실시예에 따르면, 복수의 제 2 연결 부재(CM12) 각각은 배선 형태를 가질 수 있다. 또한, 복수의 제 2 연결 부재(CM12)는 제 2 시냅스 블록(SB2) 및 제 3 시냅스 블록(SB3) 상에서 제 2 시냅스 블록(SB2)의 복수의 제 1 수직 전극(VE1)과 제 3 시냅스 블록(SB3)의 복수의 제 1 수직 전극(VE1)을 연결하도록 구성될 수 있다. 뉴런 회로부(NC10)는 OTS(Ovonic threshold switching) 소자(SD1)를 포함할 수 있다. 뉴런 회로부(NC10)는 복 수의 OTS 소자(SD1)를 포함할 수 있다. 뉴런 회로부(NC10)는 제 1 시냅스 블록(SB1)과 제 2 시냅스 블록(SB2) 사이를 연결하는 제 1 뉴런 회로부(NC11)를 포함할 수 있다. 또한, 뉴런 회로부(NC10)는 제 2 시냅스 블록(SB 2)과 제 3 시냅스 블록(SB3) 사이를 연결하는 제 2 뉴런 회로부(NC12)를 포함할 수 있다. 뉴런 회로부(NC10)는 수직형 뉴런 소자 유닛(NU10)을 포함할 수 있다. 예를 들어, 제 1 시냅스 블록(SB1)과 제 2 시냅스 블록(SB2) 사이에 배치된 제 1 뉴런 회로부(NC11)가 수직형 뉴런 소자 유닛(NU10)을 포함할 수 있다. 수직형 뉴런 소자 유닛(NU10)은 도 2를 참조하여 설명한 바와 같은 구성을 가질 수 있다. 수직형 뉴런 소자 유 닛(NU10)은 제 2 수직 전극(VE2)과 제 2 수직 전극(VE2)의 적어도 일부를 둘러싸는 OTS 물질층(SL2)을 포함하는 제 2 수직 구조체(VS2)와 상기 제 2 수직 구조체(VS2)의 외주면에 접하면서 수직 방향으로 상호 이격된 복수의 제 2 전극층(EL20)을 포함할 수 있다. 복수의 제 2 전극층(EL20) 사이에는 제 2 절연층(NL20)이 배치될 수 있다. 제 2 절연층(NL20)과 제 2 전극층(EL20)이 제 2 수직 구조체(VS2)의 외주면에 접하면서 수직 방향으로 교 대로 반복해서 적층될 수 있다. 수직형 뉴런 소자 유닛(NU10)의 복수의 제 2 전극층(EL20) 각각은 그에 대응되는 수직형 상변화 메모리 유닛 (NU10)의 복수의 제 1 전극층(EL20) 각각과 전기적으로 연결될 수 있다. 본 실시예에서, 수직형 뉴런 소자 유닛 (NU10)의 복수의 제 2 전극층(EL20) 각각은 제 1 및 제 2 시냅스 블록(SB1, SB2)의 복수의 제 1 전극층(EL20) 각각과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 수직형 뉴런 소자 유닛(NU10)의 복수의 제 2 전극층(EL20) 각각은 그에 대응되는 수직형 상변화 메모리 유닛(NU10)의 복수의 제 1 전극층(EL20) 각각과 연결되어 일체를 이룰 수 있다. 본 실시예에서, 수직형 뉴런 소자 유닛(NU10)의 복수의 제 2 전극층(EL20) 각각은 제 1 및 제 2 시냅스 블록(SB1, SB2)의 복수 의 제 1 전극층(EL20) 각각과 연결되어 일체를 이룰 수 있다. 이 경우, 수직형 뉴런 소자 유닛(NU10)의 복수의제 2 전극층(EL20) 각각은 그에 대응하는 복수의 제 1 연결 부재(CM11) 각각과 일체를 이룰 수 있다. 또한, 일 실시예에 따르면, 수직형 뉴런 소자 유닛(NU10)은 제 1 시냅스 블록(SB1)과 제 2 시냅스 블록(SB2) 사 이에 이들과 동일한 레벨로 형성될 수 있다. 또한, 복수의 제 1 연결 부재(CM11) 각각에 하나의 OTS 소자(SD1) 가 연결되어 배치될 수 있다. 그러나, 경우에 따라서는, 수직형 뉴런 소자 유닛(NU10)은 제 1 시냅스 블록(SB1) 및 제 2 시냅스 블록(SB2)과 다른 레벨로 형성될 수도 있다. 본 발명의 실시예에 따르면, VPRAM 구성을 갖는 두 개의 시냅스 블록(SB1, SB2) 사이에 복수의 OTS 소자(SD1)를 포함하는 수직형 뉴런 소자 유닛(NU10)을 적용하기 때문에, 3차원 구조를 갖는 복수의 시냅스 블록(SB10)과 3차 원 구조를 갖는 수직형 뉴런 소자 유닛(NU10)을 함께 제조하기가 용이할 수 있다. 특히, 시냅스 블록(SB10)에 적용된 상변화 물질층(PL1)과 수직형 뉴런 소자 유닛(NU10)에 적용된 OTS 물질층(SL2)은 유사한 물질로 구성될 수 있기 때문에, 시냅스 블록(SB10)과 수직형 뉴런 소자 유닛(NU10)을 함께 제조하기가 용이할 수 있다. 또한, 시냅스 블록(SB10)과 수직형 뉴런 소자 유닛(NU10)의 구조적 유사성으로 인해 시냅스 블록(SB10)과 수직형 뉴런 소자 유닛(NU10)을 함께 제조하기가 용이할 수 있다. 아울러, 하나의 OTS 소자(SD1)가 역평행 다이오드 (antiparallel diodes)를 포함하는 단위 뉴런 소자를 대체할 수 있기 때문에, 뉴런 회로부(NC10)의 구성이 단순 화될 수 있다. 제 2 시냅스 블록(SB2)과 제 3 시냅스 블록(SB3) 사이를 연결하는 제 2 뉴런 회로부(NC12)에도 OTS 소자(SD1)가 적용될 수 있다. 예를 들어, 복수의 제 2 연결 부재(CM12) 각각에 OTS 소자(SD1)가 연결되어 배치될 수 있다. 복수의 제 2 연결 부재(CM12) 각각의 중간 영역에 OTS 소자(SD1)가 연결되어 배치될 수 있다. 제 2 뉴런 회로부 (NC12)에 적용된 OTS 소자(SD1)는 제 1 뉴런 회로부(NC11)에 적용된 OTS 소자(SD1)와 등가할 수 있다. 그러나, 적층 구조나 구체적인 형태에 있어서, 제 2 뉴런 회로부(NC12)에 적용된 OTS 소자(SD1)의 구조/형태는 제 1 뉴 런 회로부(NC11)에 적용된 OTS 소자(SD1)의 구조/형태와 다를 수 있다. 일 실시예에 따르면, 시냅스 블록(SB10)에 적용된 상변화 물질층(PL1)은 제 1 칼코게나이드계 물질을 포함할 수 있고, OTS 소자(SD1)에 적용된 OTS 물질층(SL2)은 제 2 칼코게나이드계 물질을 포함할 수 있다. 상기 제 1 칼코 게나이드계 물질은, 예를 들어, GeSeTe계 물질 또는 GeSbTe계 물질이거나 이를 포함할 수 있다. 상기 제 1 칼코 게나이드계 물질은, 예를 들어, Ge-Se-Te 화합물 또는 Ge-Sb-Te 화합물을 포함할 수 있다. 상기 제 2 칼코게나 이드계 물질은, 예를 들어, GeSe계 물질이거나 이를 포함할 수 있다. 상기 제 2 칼코게나이드계 물질은, 예를 들어, Ge-Se 화합물을 포함할 수 있다. 제 1 시냅스 블록(SB1)의 복수의 제 1 수직 전극(VE1)은 입력층(input layer)를 구성할 수 있다. 제 1 시냅스 블록(SB1)의 복수의 제 1 수직 전극(VE1)으로 소정의 입력 데이터가 입력될 수 있다. 제 1 시냅스 블록 (SB1)의 복수의 제 1 전극층(EL10), 복수의 제 1 연결 부재(CM11) 및 제 2 시냅스 블록(SB2)의 복수의 제 1 전 극층(EL10)은 하나의 제 1 히든층(hidden layer)을 구성할 수 있다. 상기 제 1 히든층은 복수의 제 1 히든 노드 (h11, h12, ..., h1n)를 포함한다고 할 수 있다. 제 2 시냅스 블록(SB2)의 복수의 제 1 수직 전극(VE1), 복수의 제 2 연결 부재(CM12) 및 제 3 시냅스 블록(SB3)의 복수의 제 1 수직 전극(VE1)은 하나의 제 2 히든층(hidden layer)을 구성할 수 있다. 상기 제 2 히든층은 복수의 제 2 히든 노드(h21, h22, ..., h2n)를 포함한다고 할 수 있다. 도 7에서는 3개의 시냅스 블록(SB1, SB2, SB3)을 도시하였지만, 3개 이상의 시냅스 블록이 연결되어 배열될 수 있다. 인접한 2개의 시냅스 블록 사이의 제 1 전극층들 간의 전기적 연결 및 인접한 2개의 시냅스 블록 사이의 제 1 수직 전극들 간의 전기적 연결이 교대로 반복되면서 다수의 시냅스 블록이 연결될 수 있다. 또한, 인접한 2개의 시냅스 블록 사이 마다 뉴런 회로부의 구성이 적용될 수 있다. 일 실시예에 따르면, 입력 데이터는 이미지 센서로부터 얻어진 이미지 데이터일 수 있다. 다시 말해, 상기 3차원 구조를 갖는 뉴로모픽 소자의 입력부에 이미지 센서로부터 얻어진 이미지 데이터가 입력될 수 있다. 이 경우, 제 1 시냅스 블록(SB1)의 복수의 제 1 수직 전극(VE1) 각각에 데이터가 개별적으로 입력될 수 있다. 본 발명의 실시예에 따르면, 이미지 데이터와 같은 소정의 입력 데이터에 대하여 효율적인 데이터 처리를 수행 할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 이미지 센서로부터 획득된 이미지 데이터의 경 우, 2차원 어레이 형태를 가질 수 있고, 이러한 이미지 데이터는 본 발명의 실시예에 따른 뉴로모픽 소자의 입 력부에 용이하게 입력 가능하기 때문에, 상기 뉴로모픽 소자는 이미지 데이터 처리에 상당한 장점을 가질 수 있 다. 그러나, 입력 데이터의 종류는 이미지 데이터에 한정되지 않고, 달라질 수 있다. 또한, 일 실시예에 따르면, 상기 3차원 구조를 갖는 뉴로모픽 소자는 아날로그적인 입력값을 입력받고 아날로그 적인 출력값을 출력하도록 구성될 수 있고, DAC(digital-to-analog converter) 및 ADC(analog-to-digital converter)를 미포함할 수 있다. 상기 뉴로모픽 소자의 입력 노드에 상기 입력값으로서 전압 신호가 입력될 수 있고, 상기 뉴로모픽 소자의 출력 노드로부터 상기 출력값으로서 전압 신호가 출력될 수 있다. 이러한 과정은 입력 전압에 의해 시스템이 평형(평형점)에 도달하는 메커니즘에 의해 이루어질 수 있다. 따라서, 상기 뉴로모 픽 소자는 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능할 수 있고, DAC 및 ADC를 포함하지 않을 수 있다. 상기 뉴로모픽 소자는 DAC 및 ADC를 사용하지 않음에 따라, 데이터 처리 시간 및 에너지/전력 소모 측 면에서 상당한 이점을 가질 수 있다. 도 7에서 설명한 실시예에 따른 뉴로모픽 소자는 3차원 구조를 갖는 다층화된 'fully connected neural network' 구조로 구현될 수 있다. 도 8은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자를 적용한 인공 신경망을 개략적으로 보여 주는 도면이다. 도 8을 참조하면, 본 발명의 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자가 적용된 인공 신경망은 입력층 (input layer), 출력층(output layer) 및 이들 사이에 배치된 히든층(hidden layer)을 포함할 수 있다. 상기 히든층은 복수 개가 배치될 수 있다. 참조번호 h1은 제 1 히든층을, h2는 제 2 히든층을, hn은 n번째 히든층을 나타낸다. 앞서 설명한 도 7에서 제 1 시냅스 블록(SB1)의 복수의 제 1 수직 전극(VE1)은 상기 입력층(input layer)를 구 성할 수 있다. 제 1 시냅스 블록(SB1)의 복수의 제 1 전극층(EL10), 복수의 제 1 연결 부재(CM11) 및 제 2 시냅 스 블록(SB2)의 복수의 제 1 전극층(EL10)은 제 1 히든층(h1)을 구성할 수 있다. 제 2 시냅스 블록(SB2)의 복수 의 제 1 수직 전극(VE1), 복수의 제 2 연결 부재(CM12) 및 제 3 시냅스 블록(SB3)의 복수의 제 1 수직 전극 (VE1)은 제 2 히든층(h2)을 구성할 수 있다. 본 발명의 일 실시예에 따르면, 3D 메모리 블록, 즉, 시냅스 블록에서 각 층의 상변화 메모리(PCM) 셀들은 전극 층을 통해 전기적으로 연결될 수 있고, 수직 방향으로는 수직 전극을 형성하여 상변화 메모리 셀들 간에 연결이 될 수 있다. 따라서, 수직 전극을 통해 시냅스 블록에 입력값이 들어오는 경우, 각 전극층의 전압은 히든층 (hidden layer)의 전압이 될 수 있다. 반대로, 각 전극층에 전압이 인가되는 경우, 수직 전극으로 나오는 전압 이 다음 레이어(layer)(예컨대, 다음 히든층)에 전달되는 전압이 될 수 있다. 따라서, 시냅스 블록들은 수직 전 극-수평 전극(전극층)의 연결이 반복되는 형태로 연결될 수 있고, 임의의 크기의 뉴럴 네트워크(neural network)로 구현될 수 있다. 또한, 시냅스 블록들 사이에 뉴런 회로부는 OTS 소자를 포함할 수 있고, 필요에 따라서, 뉴런 회로부에 신호 증 폭기를 추가하여 시스템을 구성할 수 있다. 이렇게 연결된 시냅스 시스템은 평형 전파(equilibrium propagation)의 추론(inference) 연산을 수행할 수 있는 아날로그 회로의 역할을 할 수 있다. 입력 데이터로서 이미지 데이터를 넣어주면, 최종 레이어(layer)의 출력 전압(output voltage) 측정을 통해 추론(inference)을 구현할 수 있다. 이 과정에서 추가적인 동작은 필요하지 않을 수 있고, 입력 전압에 의해 시스템이 평형에 도달 하는 과정이 추론(inference)의 과정이 될 수 있다. 도 9는 본 발명의 다른 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자를 보여주는 사시도이다. 도 9를 참조하면, 본 실시예에 따른 뉴로모픽 소자는 도 7에서 설명한 뉴로모픽 소자에서 일부 변형된 구성을 가질 수 있다. 본 실시예에서 뉴런 회로부(NC10')는 제 1 뉴런 회로부(NC11') 및 제 2 뉴런 회로부(NC12)를 포 함할 수 있다. 제 1 뉴런 회로부(NC11')는 복수의 OTS 소자(SD1) 각각에 연결된 신호 증폭기(AF1)를 더 포함할 수 있다. 제 1 시냅스 블록(SB1)과 제 2 시냅스 블록(SB2) 사이에 각각의 제 1 전극층(EL10)에 대응하여 OTS 소 자(SD1)와 신호 증폭기(AF1)가 직렬적으로 연결될 수 있다. 제 1 시냅스 블록(SB1)의 각각의 제 1 전극층(EL1 0)과 그에 대응하는 제 2 시냅스 블록(SB2)의 각각의 제 1 전극층(EL10) 사이에 OTS 소자(SD1)와 신호 증폭기 (AF1)가 직렬적으로 연결될 수 있다. 수직 방향으로 상호 이격된 복수의 신호 증폭기(AF1)가 하나의 신호 증폭 기 유닛(AU10)을 구성한다고 할 수도 있다. 신호 증폭기(AF1)는 OTS 소자(SD1)와 전기적으로 연결된 별도의 회 로 구성을 가질 수 있다. 그러나, 신호 증폭기(AF1)의 사용은 선택적인(optional) 것일 수 있다. 도 9에서 제 2 뉴런 회로부(NC12)에는 신호 증폭기를 적용하지 않을 수 있지만, 경우에 따라서는, 적용할 수도 있다. 제 2 뉴런 회로부(NC12)에 신호 증폭기를 적용하지 않는 경우, 제 2 뉴런 회로부(NC12)는 단순 뉴런 회로 구성(즉, 단순 OTS 소자 구성)을 갖는다고 할 수 있다. 도 9에서 뉴런 회로부(NC10')의 일부 구성을 제외한 나머지 구성은 도 7에서 설명한 바와 동일하거나 유사할 수 있다. 도 10a 내지 도 10f는 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자의 제조 방법을 설명하기 위한 사시도이다. 도 10a를 참조하면, 소정의 기판(미도시) 상에 절연층(제 1 절연층)과 전극층(제 1 전극층)을 교대로 반복해서 적층할 수 있다. 여기서, 절연층은 다양한 절연 물질 중 적어도 어느 하나를 포함할 수 있다. 일 례로, 절연층은 실리콘 산화물(e.g., SiO2)로 형성될 수 있다. 전극층은 다양한 도전성 물질 중 적어 도 어느 하나를 포함할 수 있다. 일례로, 전극층은 TiN으로 형성될 수 있다. 그러나, 절연층 및 전극 층의 구체적인 물질은 예시적인 것에 불과하고, 각 물질은 다양하게 변화될 수 있다. 도 10b를 참조하면, 절연층과 전극층이 교대로 반복 적층된 적층체의 일부 영역을 식각하여 수직홀 (H10)을 형성할 수 있다. 복수의 수직홀(H10)을 형성할 수 있다. 복수의 수직홀(H10)은, 예를 들어, 복수의 행 및 복수의 열을 이루도록 배열될 수 있다. 도 10c를 참조하면, 수직홀(H10)이 형성된 상기 적층체 상에 상변화 물질층 및 전극 물질층을 순차로 증착할 수 있다. 상변화 물질층은 수직홀(H10)의 내측면과 상기 적층체의 상면을 컨포멀하게(conformally) 덮도록 형성될 수 있다. 상변화 물질층은 얇은 두께로 형성될 수 있고, 예를 들어, ALD(atomic layer deposition) 공정 등으로 형성될 수 있다. 전극 물질층은 상변화 물질층 상에 형성될 수 있고, 수직 홀(H10)을 메우도록 형성될 수 있다. 전극 물질층은 다양한 도전성 물질 중 적어도 어느 하나를 포함하도 록 형성될 수 있다. 일례로, 전극 물질층은 TiN을 포함할 수 있지만, 그 물질은 다양하게 변화될 수 있다. 도 10d를 참조하면, 전극 물질층 및 상변화 물질층을 패터닝할 수 있다. 각각의 수직홀(H10) 주위에 서 전극 물질층 및 상변화 물질층을 식각하여 제거할 수 있다. 수직홀(H10) 내부 및 그 위쪽에 상변 화 물질층 및 전극 물질층이 잔류될 수 있다. 수직홀(H10) 내부 및 그 위쪽에 잔류된 전극 물질층 은 수직 전극(제 1 수직 전극)이라 할 수 있다. 이하에서는, 참조번호 140을 수직 전극이라 한다. 상변화 물질층은 수직 전극을 둘러싸도록 구비될 수 있다. 각각의 수직 전극과 이를 둘러싸는 상변화 물질층은 수직 구조체(제 1 수직 구조체)를 구성한다고 할 수 있다. 도 10e를 참조하면, 절연층과 전극층이 교대로 반복 적층된 적층체의 일부를 계단형으로 식각하여 각 각의 전극층의 상면을 노출시킬 수 있다. 여기서, 아래쪽에 노출된 전극층은 제 1-1 전극층(120a)이 라 할 수 있고, 제 1-1 전극층(120a) 보다 위쪽에 노출된 전극층은 제 1-2 전극층(120b)이라 할 수 있다. 도 10f를 참조하면, 수직 전극에 콘택된 제 1 콘택 플러그 및 전극층(120a, 120b)에 콘택된 제 2 콘 택 플러그를 형성할 수 있다. 복수의 수직 전극에 콘택된 복수의 제 1 콘택 플러그가 형성될 수 있고, 복수의 전극층(120a, 120b)에 콘택된 복수의 제 2 콘택 플러그가 형성될 수 있다. 도시하지는 않았 지만, 복수의 제 1 콘택 플러그에 연결된 복수의 제 1 배선이 더 구비될 수 있고, 복수의 제 2 콘택 플러 그에 연결된 복수의 제 2 배선이 더 구비될 수 있다. 복수의 제 1 콘택 플러그 및 복수의 제 2 콘택 플러그를 통해서 복수의 셀(시냅스 셀)에 전기적 신호 를 인가하여 상기 복수의 셀(시냅스 셀)에 대한 프로그래밍 동작을 수행할 수 있다. 예를 들어, 복수의 제 1 콘 택 플러그 중 어느 하나를 선택하고 복수의 제 2 콘택 플러그 중 어느 하나를 선택하여, 선택된 수직 전극과 선택된 전극층 사이에 전기적 신호(전압 신호)를 인가함으로써, 선택된 셀에 대한 프로그래밍 을 수행할 수 있다. 따라서, 여기서, 복수의 제 2 콘택 플러그는 적어도 프로그래밍 동작을 위한 콘택 요 소일 수 있다. 아울러, 복수의 제 1 콘택 플러그는 입력 데이터를 입력하기 위한 입력 노드로 사용될 수 있다. 도 10a 내지 도 10f를 참조하여 설명한 시냅스 블록의 제조 방법은 예시적인 것에 불과하고, 이 방법은 다양하 게 변형 가능할 수 있다. 또한, 기판 상에 복수의 시냅스 블록을 형성하면서, 이와 연결된 뉴런 소자부를 형성 할 수 있다. 적어도 두 개의 시냅스 블록과 적어도 하나의 제 1 뉴런 소자부의 형성 시, 마스킹 공정이 적용될 수 있다. 또한, 적어도 두 개의 시냅스 블록의 위쪽 또는 아래쪽에 제 2 뉴런 소자부를 형성할 수 있다. 그 밖 에도, 상기한 뉴로모픽 소자의 제조 방법은 다양하게 변화될 수 있다. 도 11은 본 발명의 일 실시예에 따른 뉴로모픽 소자를 이용한 뉴로모픽 연산 시스템(뉴로모픽 연산 가속 시스템)을 개략적으로 보여주는 도면이다. 도 11을 참조하면, 본 발명의 실시예에 따른 뉴로모픽 소자는 오프라인 학습(off-line learning) 용도일 수 있고, 학습된 시냅스 정보를 메모리로 전달하여 작동할 수 있다. 외부의 호스트 소자(host device)에서 시뮬레이션을 통해서 알아낸 시냅스 값들을 뉴로모픽 소자의 메모리, 즉, 시냅스 블록에 기록(writing), 즉, 프로그래밍할 수 있다. 회로 시뮬레이션을 통해 학습된 시냅스 값들을 뉴로모픽 소자에 트랜스퍼 (transfer)한 후에, 뉴로모픽 소자를 뉴로모픽 연산에 적용할 수 있다. 여기서, 호스트 소자는, 예컨 대, FPGA(field programmable gate array)를 포함할 수 있지만, 이에 한정되지 않는다. 호스트 소자의 종 류는 다양하게 변화될 수 있다. 뉴로모픽 소자는, 예를 들어, 추론(inference) 연산을 수행하도록 작동할 수 있다. 본 발명의 실시예에 따른 뉴로모픽 소자의 실제 성능을 확인하기 위해 SPICE(Simulation Program with Integrated Circuit Emphasis) 기반의 회로 시뮬레이션을 통해 MNIST(Modified National Institute of Standards and Technology) 학습 정확도를 구해본 결과, 95% 이상의 높은 성능을 나타냈다. 본 발명의 실시예에 따른 3D VPRAM을 적용한 뉴로모픽 소자는 저전력, 고집적의 장점을 가지며, 다양한 분야에 유용하게 활용될 수 있다. 이상에서 설명한 본 발명의 실시예들에 따르면, 평형 전파(equilibrium propagation) 뉴로모픽 연산이 가능한 3 차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 따라서, 실시예들에 따른 뉴로모픽 소자는 DAC(digital-to- analog converter) 및 ADC(analog-to-digital converter)를 사용하지 않을 수 있고, 데이터 처리 시간 및 에너 지/전력 소모 측면에서 상당한 이점을 가질 수 있다. 실시예들에 따른 뉴로모픽 소자는 DAC 및 ADC 등의 부가 회로를 필요로 하지 않을 수 있으므로, 이와 관련해서 제조 공정 및 면적 측면에서도 장점을 가질 수 있다. 또 한, 본 발명의 실시예들에 따르면, 고집적화가 가능하고 뉴런 회로부의 구성을 단순화시킬 수 있으며 시냅스 소 자들과 뉴런 회로부를 용이하게 연결하여 제작할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 특히, 복수의 수직형 상변화 메모리 유닛을 포함하는 시냅스 블록과 OTS(Ovonic threshold switching) 소자를 포함하는 뉴런 회로부를 사용함으로써, 뉴런 회로부의 구성을 단순화함과 동시에 시냅스 블록과 뉴런 회로부를 집적 방식으로 용이하게 제조할 수 있다. 또한, 본 발명의 실시예들에 따르면, 이미지 데이터와 같은 소정의 입력 데이터에 대하여 효율적인 데이터 처리를 수행할 수 있는 3차원 구조를 갖는 뉴로모픽 소자를 구현할 수 있다. 예컨대, 이미지 센서로부터 획득된 이미지 데이터의 경우, 2차원 어레이 형태를 가질 수 있고, 이러한 이 미지 데이터는 본 발명의 실시예에 따른 뉴로모픽 소자의 입력부에 용이하게 입력 가능하기 때문에, 이미지 데 이터 처리에 상당한 장점을 가질 수 있다. 본 명세서에서는 본 발명의 바람직한 실시예에 대하여 개시하였으며, 비록 특정 용어들이 사용되었으나, 이는 단지 본 발명의 기술 내용을 쉽게 설명하고 발명의 이해를 돕기 위한 일반적인 의미에서 사용된 것이지, 본 발 명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시예 외에도 본 발명의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것 이다. 해당 기술 분야에서 통상의 지식을 가진 자라면, 도 1 내지 도 11을 참조하여 설명한 실시예들에 따른 3 차원 구조를 갖는 뉴로모픽 소자 및 그 제조 방법이, 본 발명의 기술적 사상이 벗어나지 않는 범위 내에서, 다 양하게 치환, 변경 및 변형될 수 있음을 알 수 있을 것이다. 때문에 발명의 범위는 설명된 실시예에 의하여 정 하여 질 것이 아니고 특허 청구범위에 기재된 기술적 사상에 의해 정하여져야 한다."}
{"patent_id": "10-2023-0032009", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자(neuromorphic device)에 적용될 수 있는 시냅스 블록(synapse block)을 예시적으로 보여주는 사시도이다. 도 2는 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자에 적용될 수 있는 뉴런 회로부의 구성을 설명하기 위한 사시도이다. 도 3은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자에 적용될 수 있는 OTS(Ovonic threshold switching) 소자의 스위칭 특성을 보여주는 그래프이다. 도 4는 비교예에 따른 것으로, 역평행 다이오드(antiparallel diodes)를 포함하는 단위 뉴런 소자를 보여주는 회로도이다. 도 5는 본 발명의 다른 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자에 적용될 수 있는 뉴런 회로부의 구성 을 설명하기 위한 사시도이다. 도 6은 도 5의 신호 증폭기가 가질 수 있는 회로 구성을 예시적으로 보여주는 회로도이다. 도 7은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자를 보여주는 사시도이다. 도 8은 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자를 적용한 인공 신경망을 개략적으로 보여 주는 도면이다. 도 9는 본 발명의 다른 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자를 보여주는 사시도이다. 도 10a 내지 도 10f는 본 발명의 일 실시예에 따른 3차원 구조를 갖는 뉴로모픽 소자의 제조 방법을 설명하기 위한 사시도이다. 도 11은 본 발명의 일 실시예에 따른 뉴로모픽 소자를 이용한 뉴로모픽 연산 시스템(뉴로모픽 연산 가속 시스템)을 개략적으로 보여주는 도면이다."}
