{"patent_id": "10-2022-0049434", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0148734", "출원번호": "10-2022-0049434", "발명의 명칭": "메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 및 방법", "출원인": "주식회사 에이아이트릭스", "발명자": "황성주"}}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수 개의 데이터셋(dataset), 상기 데이터셋을 사전 학습한 신경망(network)으로 구성된 학습모델 풀(pool)을포함하는 데이터베이스 및 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하기 위한 프로그램이 저장되는메모리; 및상기 프로그램을 실행함으로써 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 제어부를 포함하고,상기 제어부는,상기 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포함된 제약조건(constraint)을 고려하여 데이터셋(dataset)과 상기 데이터셋에 대해 학습된 신경망(network) 사이의 유사도를 계산함으로써 상기 데이터셋(dataset)과 상기 데이터셋에 대해 학습된 신경망(network)에 대한 크로스 모달 잠재 공간(cross modal latentspace)을 학습하여 최적의 신경망을 검색하는 것을 특징으로 하는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치."}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제어부는, 아래의 수학식 1을 사용하여 태스크의 분포(task distribution)에 대해 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 구성하는 것을 특징으로 하는 메타 대조 학습 기반의 태스크 적응형신경망을 검색하는 장치.<수학식 1>여기서, 는 쿼리 인코더(Query Encoder), 는 모델 인코더(Model Encoder), 는 쿼리-모델 쌍에 대한 점수 함수임."}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제어부는,상기 미리 선택된 어느 하나의 태스크에 대한 신경망의 양의 임베딩(positive embedding) 쌍 간의 유사성을 최대화하고, 음의 임베딩(negative embedding) 쌍 간의 유사성을 최소화하는 상각 메타 학습(Amortized Meta-Learning)을 이용하여 상기 크로스 모달 잠재 공간을 학습함으로써 신경망을 검색하는 것을 특징으로 하는 메타대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치.공개특허 10-2022-0148734-3-청구항 4 제 3 항에 있어서,상기 제어부는,아래의 수학식 2를 사용하여 메타 대조 학습 손실(Meta Contrastive learning Loss)을 계산함으로써 데이터셋과상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산하는 것을 특징으로 하는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치.<수학식 2>"}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치가 수행하는 태스크 적응형 신경망을 검색하는 방법에 있어서, 메모리에 저장된 복수 개의 데이터셋, 상기 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베이스에서, 어느 하나의 태스크(task)를 미리 선택하는 단계; 및상기 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포함된 제약조건(constraint)을 고려하여 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써 상기 데이터셋과 상기 데이터셋에대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검색하는 단계;를 포함하는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법."}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 신경망을 검색하는 단계는, 아래의 수학식 1을 사용하여 태스크의 분포(task distribution)에 대해 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 구성하는 단계를 포함하는 것을 특징으로 하는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법. <수학식 1>여기서, 는 쿼리 인코더(Query Encoder), 는 모델 인코더(Model Encoder), 는 쿼리-모델 쌍에 대한 점수 함수임."}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 신경망을 검색하는 단계는, 공개특허 10-2022-0148734-4-상기 미리 선택된 어느 하나의 태스크에 대한 신경망의 양의 임베딩 쌍 간의 유사성을 최대화하고, 음의 임베딩쌍 간의 유사성을 최소화하는 상각 메타 학습(Amortized Meta-Learning)을 이용하여 상기 크로스 모달 잠재 공간을 학습하는 단계를 포함하는 것을 특징으로 하는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는방법."}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 신경망을 검색하는 단계는, 아래의 수학식 2를 사용하여 메타 대조 학습 손실(Loss)을 계산함으로써 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산하는 단계를 포함하는 것을 특징으로 하는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법. <수학식 2>"}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항에 기재된 방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록 매체."}
{"patent_id": "10-2022-0049434", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법에 의해 수행되며, 제 5 항에 기재된 방법을 수행하기 위해 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 및 방법을 개시한다. 메타 대조 학습 기반의 태스 크 적응형 신경망을 검색하는 장치는, 복수 개의 데이터셋, 상기 데이터셋을 사전 학습한 신경망으로 구성된 학 습모델 풀(pool)을 포함하는 데이터베이스 및 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하기 위한 프 로그램이 저장되는 메모리; 및 상기 프로그램을 실행함으로써 메타 대조 학습 기반의 태스크 적응형 신경망을 검 색하는 제어부를 포함하고, 상기 제어부는, 상기 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포 함된 제약조건(constraint)을 고려하여 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함 으로써 상기 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검색하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 및 방법에 관한 것으로, 더욱 상세하게는, 신경망 구조뿐만 아니라 파라미터까지 탐색하고, 대조 손실이 있는 크로스 모달 잠재 공간(cross modal latent space)을 데이터셋과 데이터셋을 사전 학습한 신경망 사이의 유사도를 계산함으 로써 최적의 신경망을 검색할 수 있는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어, IT 및 테크 기업뿐만 아니라 산업 전체에 걸쳐 인공지능 기술을 도입하고자 하는 수요가 증가하고 있다. 그러나, 인공지능 기술을 사용할 수 있는 전문가를 고용하기 위해서는 고비용이 필요하고, 인공지능 기술에 대 한 연구 개발을 위해서는 고투자 비용이 필요하다는 문제점이 발생한다. 이러한 문제점을 해결하고자, 유전 알고리즘을 통한 탐색, 그래디언트(Gradient) 최적화 기반 탐색, 상위 네트 워크로부터 하위 네트워크 샘플링을 통한 탐색 및 메타(Meta) 탐색 등의 기법들을 활용한 신경망 구조 검색 (Neural Architecture Search, 이하 NAS)이 연구되었다. 이때, 신경망 구조 검색은 데이터가 주어졌을 때 자동 으로 최선의 신경망 모델을 설계해주는 기술이다. 하지만, 상술된 기법들을 포함하는 신경망 구조 검색은 주어진 데이터에 대해 최적의 신경망 구조를 설계할 수 는 있으나, 파라미터(parameter)를 생성할 수 없다는 문제점이 있어 생성된 신경망 구조를 실제로 이용하기 위 해서는 주어진 데이터셋(dataset)에 대해 처음부터 학습하여야 한다는 문제점이 있다. 또한, 목표 데이터셋이"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "변경될 경우, 신경망 구조 탐색부터 파라미터 생성까지 모든 과정을 다시 실행해야 한다는 문제점이 있다.한편, 전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2232138호(2021.03.25 공고)"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은, 신경망 구조뿐만 아니라 파라미터까지 탐색하고, 대조 손실이 있는 크로스 모달 잠재 공간을 데이터셋과 데이터셋을 사전 학습한 신경망 사이의 유사도를 계산함으로써 최적의 신경망을 검색할 수 있는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 및 방법을 제공하는데 그 목적이 있다. 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있으며, 일 실시예에 의해 보다 분명하게 알 게 될 것이다. 또한, 본 발명의 목적 및 장점들은 특허청구범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있 음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 메타 대조 학습 기반의 태스크 적응형 신경망을 검색 하는 장치는, 복수 개의 데이터셋, 상기 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함 하는 데이터베이스 및 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하기 위한 프로그램이 저장되는 메모 리; 및 상기 프로그램을 실행함으로써 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 제어부를 포함 하고, 상기 제어부는, 상기 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포함된 제약조건 (constraint)을 고려하여 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써 상기 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검 색하는 것을 특징으로 한다. 다른 실시예에 따르면, 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치가 수행하는 태스크 적응 형 신경망을 검색하는 방법은, 메모리에 저장된 복수 개의 데이터셋, 상기 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베이스에서, 어느 하나의 태스크(task)를 미리 선택하는 단계; 및 상기 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포함된 제약조건(constraint)을 고려하여 데이 터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써 상기 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검색하는 단계;를 포함한다. 또 다른 실시예에 따르면, 기록매체는, 태스크 적응형 신경망을 검색하는 방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록 매체이다. 상기 태스크 적응형 신경망을 검색하는 방법은, 메모리에 저장된 복수 개의 데이터셋, 상기 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베이스에서, 어느 하나의 태스크(task)를 미리 선택하는 단계; 및 상기 데이터베이스에서 미리 선택된 어느 하나의 태스크 (task)에 포함된 제약조건(constraint)을 고려하여 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유 사도를 계산함으로써 상기 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학 습하여 최적의 신경망을 검색하는 단계;를 포함한다. 또 다른 실시예에 따르면, 컴퓨터 프로그램은, 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치에 의해 수행되며, 태스크 적응형 신경망을 검색하는 방법을 수행하기 위해 기록 매체에 저장된 컴퓨터 프로그램이 다. 상기 태스크 적응형 신경망을 검색하는 방법은, 메모리에 저장된 복수 개의 데이터셋, 상기 데이터셋을 사 전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베이스에서, 어느 하나의 태스크(task)를 미리 선택하는 단계; 및 상기 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포함된 제약조건 (constraint)을 고려하여 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써 상기 데이터셋과 상기 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검 색하는 단계;를 포함한다."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 과제 해결 수단 중 어느 하나에 의하면, 신경망 구조뿐만 아니라 파라미터까지 탐색하고, 대조 손실이 있는 크로스 모달 잠재 공간을 데이터셋과 데이터셋을 사전 학습한 신경망 사이의 유사도를 계산함으로써 신속 하게 최적의 신경망을 검색할 수 있으며, 그 과정에서 발생하는 오버헤드를 감소시킬 수 있는 효과가 있다. 개시되는 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "른 효과들은 아래의 기재로부터 개시되는 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 다양한 실시예들을 상세히 설명한다. 아래에서 설명되는 실시예들은 여러 가지 상이한 형태로 변형되어 실시될 수도 있다. 실시예들의 특징을 보다 명확히 설명하기 위하여, 이하의 실시"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 널리 알려져 있는 사항들에 관해서 자세한 설명은 생략 하였다. 그리고, 도면에서 실시예들의 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부 분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 구성이 다른 구성과 \"연결\"되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경우뿐 아니라, '그 중간에 다른 구성을 사이에 두고 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성이 어떤 구성을 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 그 외 다른 구성을 제외하는 것이 아니라 다른 구 성들을 더 포함할 수도 있음을 의미한다. 이하 첨부된 도면을 참고하여 실시예들을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치의 기능 블록도, 도 2 내지 도 3은 일 실시예에 따른 타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치를 설명하기 위한 예 시도이다. 본 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치는 사용자와 인터랙션할 수 있는 애플리케이션이 설치된 전자단말기로 구현되거나 서버로 구현되거나 또는 서버-클라이언트 시스템으로 구현될 수 있으며, 서버-클라이언트 시스템으로 구현되는 경우 사용자와의 인터랙션을 위한 온라인 서비스용 애 플리케이션이 설치된 전자단말기를 포함할 수 있다. 이때 전자단말기는 네트워크를 통해 원격지의 서버에 접속하거나, 타 디바이스 및 서버와 연결 가능한 컴퓨터나 휴대용 단말기, 텔레비전, 웨어러블 디바이스(Wearable Device) 등으로 구현될 수 있다. 여기서, 컴퓨터는 예를들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop)등을 포함하고, 휴대용 단 말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), GSM(Global System for Mobile communications), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet), 스마트폰(Smart Phone), 모바일 WiMAX(Mobile Worldwide Interoperability for Microwave Access) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 또한, 텔레비전은 IPTV(Internet Protocol Television), 인터넷 TV(Internet Television), 지상파 TV, 케이블 TV 등 을 포함할 수 있다. 나아가 웨어러블 디바이스는 예를 들어, 시계, 안경, 액세서리, 의복, 신발 등 인체에 직접 착용 가능한 타입의 정보처리장치로서, 직접 또는 다른 정보처리장치를 통해 네트워크를 경유하여 원격지의 서 버에 접속하거나 타 디바이스와 연결될 수 있다. 그리고 서버는 메타 대조 학습 기반의 태스크 적응형 신경망(TASK ADAPTIVE NEURAL NETWORK BASED ON META CONTRASTIVE LEARNING)을 검색하는 장치의 사용자와의 인터랙션을 위한 애플리케이션이나 웹브라우저가 설 치된 전자단말기와 네트워크를 통해 통신이 가능한 컴퓨터로 구현되거나 클라우드 컴퓨팅 서버로 구현될 수 있 다. 또한, 서버는 데이터를 저장할 수 있는 저장장치를 포함하거나 제 3의 서버를 통해 데이터를 저장할 수 있 다. 상술된 바와 같이 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치는 전자단말기, 서버 또는 서버-클라이언트 시스템 중 어느 하나의 형태로 구현될 수 있으며, 서버로 구현될 경우, 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치를 구성하는 구성부는 물리적으로 분리된 복수의 서버에서 수행되거 나 하나의 서버에서 수행될 수 있다. 도 1을 참조하면, 본 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치는 입출 력부, 통신부, 메모리 및 제어부를 포함한다. 입출력부는 사용자로부터 입력을 수신하기 위한 입력부와 작업의 수행결과 또는 메타 대조 학습 기반의 태 스크 적응형 신경망을 검색하는 장치의 상태 등의 정보를 표시하기 위한 출력부를 포함할 수 있다. 예를 들어, 입출력부는 사용자 입력을 수신하는 조작 패널(operation panel) 및 화면을 표시하는 디스플레이 패 널(display panel) 등을 포함할 수 있다. 구체적으로 입력부는 키보드, 물리 버튼, 터치 스크린, 카메라 또는 마이크 등과 같이 다양한 형태의 입력을 수 신할 수 있는 장치들을 포함할 수 있다. 또한, 출력부는 디스플레이 패널 또는 스피커 등을 포함할 수 있다. 다 만, 이에 한정되지 않고 입출력부는 다양한 입출력을 지원하는 구성을 포함할 수 있다. 통신부는 다른 디바이스(장치) 및/또는 네트워크와 유무선 통신을 수행할 수 있다. 이를 위해, 통신부 는 다양한 유무선 통신 방법 중 적어도 하나를 지원하는 통신 모듈을 포함할 수 있다. 예컨대, 통신 모듈 은 칩셋(chipset)의 형태로 구현될 수 있다. 한편, 통신부가 지원하는 무선 통신은, 예를 들어 Wi-Fi(Wireless Fidelity), Wi-Fi Direct, 블루투스 (Bluetooth), 저전력블루투스(BLE; Bluetooth Low Energy), UWB(Ultra Wide Band), NFC(Near Field Communication), LTE, LTE-Advanced 등의 무선 이동통신 등일 수 있다. 또한, 통신부가 지원하는 유선 통 신은, 예를 들어 USB 또는 HDMI(High Definition Multimedia Interface) 등일 수 있다. 메모리는 파일, 어플리케이션 및 프로그램 등과 같은 다양한 종류의 데이터를 설치 및 저장할 수 있으며, RAM, HDD 및 SSD 등과 같이 다양한 종류의 메모리 중 적어도 하나를 포함하도록 구성될 수 있다. 후술하는 제어 부는 메모리에 저장된 데이터에 접근하여 이를 이용하거나, 또는 새로운 데이터를 메모리에 저 장할 수도 있다. 또한, 제어부는 메모리에 설치된 프로그램을 실행할 수도 있다. 한편, 메모리 에는 복수 개의 데이터셋 및 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터 베이스가 저장될 수 있으며, 일 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법을 수행하기 위한 프로그램이 설치될 수 있다. 제어부는 CPU, GPU, 아두이노 등과 같은 적어도 하나의 프로세서를 포함하는 구성으로, 메타 대조 학습 기 반의 태스크 적응형 신경망을 검색하는 장치의 전체적인 동작을 제어할 수 있다. 즉, 제어부는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치에 포함된 다른 구성들을 제어할 수 있다. 또한, 제어부는 메모리에 저장된 프로그램을 실행하거나, 메모리에 저장된 파일을 읽어오거나 또는 새로운 파일을 메모리에 저장할 수도 있다. 실시예에 따르면, 제어부는 메타 대조 학습 기반의 태스크 적응형 신경망을 검색할 수 있다. 예컨대, 제어 부는 도 2에 도시된 바와 같이, 다양한 데이터셋(dataset)과 데이터셋을 사전 학습한 많은 수의 신경 망(network)으로 구성된 학습모델 풀(pool)인 모델 주(model ZOO)가 포함된 데이터베이스를 검색하여 태스 크 적응 방식(task adaptive manner)으로 지정된 데이터셋에 가장 적합한 신경망(network)을 검색할 수 있다. 이때, 제어부는 크로스 모달 잠재 공간(cross modal latent space)의 상각 메타 학습(amortized meta learning)을 통해 학습모델을 학습할 수 있다. 즉, 제어부는 데이터셋과 데이터셋을 사전 학습한 많 은 수의 신경망으로 구성된 학습모델 풀인 모델 주(model ZOO)가 포함된 데이터베이스에서 데이터셋에 대 해 학습된 신경망에서 망(network)의 구조를 표현하는 토폴로지(embedding topology)와 학습지식(learned parameter)을 출력하여 크로스 모달 잠재 공간을 구성한다. 이때, 제어부는 크로스 모달 잠재 공간을 구성 함에 있어서 정확성(accuracy), 지연시간(latency), 연산속도(FLOPs) 등을 포함하는 제약조건(constraint)을 고려하여 데이터셋과 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써 크로스 모달 잠재 공간을 학습할 수 있다. 이때, 제어부는 신경망 구조뿐만 아니라 파라미터까지 탐색하였기 때문에 추가적인 비용 없이 학습된 신경망을 즉시 검색(instant retrieval)하여 최적의 학습된 신경망(best-fitted trained networks)을 검색할 수 있고, 빠른 미세 조정(rapid fine tuning)을 통해 최종적으로 신경망(final network)을 찾아낼 수 있다. 한편, 이와 관련한 보다 상세한 내용은 후술하기로 한다. 관련하여, 제어부의 메타 대조 학습 기반의 태스크 적응형 신경망을 검색을 위한 정보가 필요할 수 있는데, 이러한 정보들은 메모리에 저 장될 수 있다. 제어부는 데이터베이스에서 미리 선택된 어느 하나의 태스크(task)에 포함된 제약조건(constraint)을 고려 하여 데이터셋과 상기 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써, 데이터셋과 상기 데이터 셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검색할 수 있다. 이때, 최 적의 신경망은 데이터베이스에 포함된 학습된 신경망들 중에서 주어진 태스크 및 제약조건을 가장 만족시킬 수 있는 신경망을 의미할 수 있다. 일 실시예에 따르면 제어부는 데이터셋과 데이터셋에 대해 학습된 신경망 쌍(network pair)에 대한 크로스 모달 잠재 공간을 학습하여 데이터셋 및 제약조건에 대한 최적의 신경망을 검색할 수 있다. 이때, 검색된 신경 망에는 토폴로지(topology) 및 파라미터(parameter)가 포함될 수 있다. 한편, 상각 메타 대조 학습(amortized meta contrastive learning)을 이용한 태스크 적응형 신경망 검색에 대 해 설명하면 다음과 같다. 메타 학습(Meta Training) 각 태스크(task) 와 함께 태스크의 분포 에 대해 사전 훈련된 신경망으로 구성된 학습 모델 풀(pool)을 포함하는 데이터베이스가 있다. 여기서, 는 데이터셋, 는 데이터셋에 대해 학습된 신 경망, 는 신경망에 대한 파라미터(parameter)의 수, 데이터셋의 정확도, 계산 대기 시간으로 구성된 주어진 태스크에 대한 일련의 정보 집합을 나타낼 수 있다. 다시 말해, 는 제약조건(constraint)일 수 있다. 이후, 태스크의 분포(task distribution) 에 대한 제약조건 를 고려하면서, 데이터셋과 데이터셋에 대해 학 습된 신경망의 쌍 에 대한 크로스 모달 잠재 공간(cross modal latent space)을 학습할 수 있다. 이러한 방식으로 다양한 데이터셋과 데이터셋에 대해 학습된 신경망의 쌍 에서 메타 학습된 모델 은 조건이 인 보이지 않는 데이터셋에 대해 잘 맞는 신경망을 검색하여 보이지 않는 데이터셋 에 대해 빠르게 일반화할 수 있다. 태스크 적응형 신경망 검색(Task-Adaptive Neural Network Retrieval) 태스크 적응 검색의 목표는 주어진 태스크 에 대해 주어진 쿼리 데이터셋 에 대해 적절한 신경망 를 찾는 것이다. 이를 위해, 데이터셋과 데이터셋에 대해 학습된 신경망의 쌍 사이의유사도를 계산해야 하며, 점수함수 는 다음과 같이 유사도를 출력할 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, 는 쿼리 인코더(Query Encoder), 는 모델 인코더 (Model Encoder), 는 쿼리-모델 쌍에 대한 점수 함수일 수 있다. 이처럼, 제어부 는 수학식 1을 사용하여 태스크의 분포를 통해 데이터셋과 데이터셋에 대해 학습된 신경망의 쌍에 대한 크 로스 모달 잠재 공간을 구성한 다음, 이 공간을 사용하여 보이지 않는 쿼리 데이터셋에 대한 응답으로 최적의 신경망을 빠르게 검색할 수 있다. 이때, 쿼리 인코더(Query Encoder) 및 모델 인코더(Model Encoder) 가 존재할 수 있으며, 상술된 목적을 해결하여 신속한 검색을 위한 데이터셋과 데이터셋에 대해 학습된 신경망 의 쌍에 대한 크로스 모달 잠재 공간을 학습할 수 있다. 메타 대조 학습을 통한 검색(Retrieval with Meta-Contrastive Learning) 데이터셋과 데이터셋에 대해 학습된 신경망의 쌍 로 구성된 각 태스크 에 대한 메타 대조 학습의 목표는 양의 쌍 간의 유사성을 최대화하고, 음의 쌍 사이의 유사성을 최소화하는 것이다. 여기서, 는 샘플링된 대상 태스크 에 서 얻고, 는 다른 태스크 에서 얻을 수 있다. 이때, 메타 대조 학습 손실(meta contrastive learning loss)은 아래의 수학식 2와 같이 나타낼 수 있다. [수학식 2]"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "한편, 메타 대조 학습을 위한 대조 손실(contrastive loss) 는 아래의 수학식 3과 같이 나타낼 수 있다. [수학식 3]"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서, 는 마진 하이퍼 파라미터(margin hyper-parameter)이고, 점수함수(score function) 는 코사 인 유사도(cosine similarity)이다. 대조 손실(contrastive loss)은 학습된 크로스 모달 잠재 공간에서 최대 마진(at most margin) 가 음의 임베딩(negative embedding) 쌍 보다 양의 임베딩(positiveembedding) 쌍 이 서로 더 가깝게 되도록 만들 수 있다. 이와 유사하게, 쿼리(query)를 와 대조할 수 있다. 상술된 구성요소를 사용하여 모델 대조 손실 및 쿼리 대조 손실 로 정의된 태스크의 분포 에 대한 메타 대조 학습 손실을 아 래의 수학식 4와 같이 최소화할 수 있다. [수학식 4]"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "한편, 크로스 모달 검색(cross modal retrieval)을 위한 메타 대조 학습의 일 예는 도 3에 도시된 바와 같다. 도 3을 참조하면, 모델 인코더(Model Encoder)와 셋 인코더(Set Encoder) 및 쿼리 인코더(Query Encoder)가 메 타 대조 학습을 위해 사용될 수 있다. 이때, 모델 인코더는 데이터셋에 대해 학습된 신경망을 입력받아 모델 임베딩(model embedding)을 출력하는 암 호기일 수 있으며, 입력받는 데이터셋에 대해 학습된 신경망은 망(network)의 구조를 표현하는 토폴로지 (topology) 정보와 망(network)의 학습지식(parameter)을 표현하는 기능 임베딩(functional embedding)으로 구 성될 수 있다. 한편, 토폴로지 정보는 커널 사이즈, 채널 확장 정보 및 레이어의 깊이 등을 표현한 OFA(Once- for-All) 토폴로지 정보를 참조할 수 있다. 그리고, 기능 임베딩은 가우시안 랜덤 노이즈(Gaussian random noise)로 생성한 비편향적 임의 노이즈 입력(unbiased random noise input)을 통해 얻어지는 출력을 모델의 학 습지식(parameter)을 반영하는 임베딩으로 활용할 수 있다. 모델 인코더는 멀티 레이어 퍼셉트론(multi-layer perceptron)으로 설계될 수 있다. 실시예에 따르면, 모델 인코더는 신경망 를 인코딩하기 위해 각 태스크 에 대해 데이터셋 에서 학습된 모델 파라미터(parameter)와 구조(architectures)를 모두 고려한다. 모델 인코더는 토폴로지 인코딩(network topology)과 기능적 인코딩(function embedding)의 사용하여 모델 임베딩을 생성할 수 있다. 논문(Cai, H., Gan, C., Wang, T., Zhang, Z., and Han, S. Once for all: Train one network and specialize it for efficient deployment. In International Conference on Learning Representations, 2020.)을 참조하면, 본 실시예에 따른 모델 인코더는 먼저 레이어의 수, 채널 확장 비율 및 커널 크기와 같은 구조 토폴로지에 대한 보 조 정보가 포함된 토폴로지 임베딩 을 얻을 수 있다. 이후, 주어진 태스크에 대해 학습된 모델 파라미터를 인코딩하여 신경망 구조의 파라미터를 추가로 고려할 수 있다. 이때, 수백만 개의 파라미터를 벡터로 직접 인코 딩하는 것은 매우 어렵고 비효율적이기 때문에, 기능적 임베딩을 사용하여 이를 해결할 수 있다. 한편, 이러한 연산은 고정 가우스 랜덤 노이즈(fixed Gaussian random noise)를 각 신경망 에 공급하고 그 출력 를 얻음으로써 학습된 신경망의 임베딩을 생성할 수 있다. 구조와 파라미터가 서로 다른 신경망은 서로 다른 기능 을 구성하므로 동일한 입력에 대해 서로 다른 출력을 생성할 수 있으므로, 기능 임베딩 이면(behind)의 직관 (intuition)은 간단할 수 있다. 상술된 두 가지 인코딩 기능을 사용하여, 모델 인코더는 토폴로지(network topology)와 기능 임베딩(function embedding) 를 연결한 후, 와 같이 표시된 비선형 함수 로 연결된 벡터를 변환함으로써 모델 표현을 생성할 수 있다. 여기서, 은 모 델 임베딩(model embedding)이고, 는 모델 인코더의 학습 가능한 파라미터이다. 셋 인코더는 각 데이터셋을 입력으로 받아 쿼리 데이터셋을 생성하여 쿼리 인코더로 출력할 수 있다. 쿼리 인코더는 쿼리 데이터셋을 입력받아 질의 임베딩(Query Embedding)을 출력하는 암호기일 수 있다. 쿼리 인 코더는 인코더는 멀티 레이어 퍼셉트론(multi-layer perceptron)으로 설계된 평균 풀링(average pooling) 기반 의 셋 인코더 암호기일 수 있다. 실시예에 따르면, 쿼리 인코더 는 데이터셋 를 단일 쿼리 벡터 로 크로스 모달 잠 재 공간에 포함시킬 수 있다. 각 데이터셋 는 데이터 인스턴스 로 구성되어 있기 때문에, 인스턴스의 순서에 관계없이 일관된 표현을 출력하기 위해 데이터 인스턴스 에 대한 치환 불변성 조 건(permutation-invariance condition)을 충족하는 것이 바람직하다. 이를 달성하기 위해, 본 실시예에 따르면 연속 학습 가능한 함수 를 사용하여 데이터셋 에 대해 무작위로 샘플링된 인스턴스를 개별적으로 변 환한 다음 논문(Zaheer, M., Kottur, S., Ravanbakhsh, S., Poczos, B., Salakhutdinov, R. R., and Smola, A. J. Deep sets. In Advances in Neural Information Processing Systems (NIPS), 2017.)을 참조하여 쿼리 벡터 를 얻기 위해 풀링 연산을 적용한다. 메타 성능 대리 모델(Meta-Performance Surrogate Model) 복수 개의 데이터셋, 상기 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베 이스에서 태스크의 분포 를 통해 성능 대리 모델 를 메타 훈련할 수 있다. 여기서, 는 메타 성 능 대리 모델의 학습 가능한 파라미터이다. 이러한 메타 성능 대리 모델은 보이지 않는 데이터셋의 성능을 사전 에 정확하게 예측할 뿐만 아니라, 데이터셋과 데이터셋에 대해 학습된 신경망의 쌍에 대한 성능에 대해 교차 모 달 잠재 공간을 구별하도록 안내하여 주어진 데이터셋의 후보 중에서 고성능 신경망을 선택하도록 유도할 수 있 다. 구체적으로, 메타 성능 대리 모델 는 주어진 태스크 에 대한 입력으로 쿼리 임베딩 와 모델 임베 딩 를 취하여 쿼리에 대한 모델의 정확도를 예측하기 위해 전달할 수 있다. 태스크의 분포 에서 샘플 링된 각 태스크 의 모델에 대한 예측 정확도 와 실제 정확도 사이의 평균 제곱 오류 손실 (mean-square error loss) 을 최소화하기 위해 성능 예측기(performance predictor) 를 학습할 수 있다. 이후, 상술된 수학식 4와 결합하여 나타내어진 아래의 수학식 5에 따 라 학습을 진행할 수 있다. [수학식 5]"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, 는 가중치 손실(weighting losses)에 대한 하이퍼 파라미터(hyper-parameter)일 수 있다. 실시예에 따르면, 제어부는 메타 학습된 크로스 모달 잠재 공간을 활용하여 메타 훈련 데이터셋"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "에서 분리된 보이지 않는 쿼리 데이터셋 에 대한 응답으로 파라미터(parameter)와 함께 최적의 신경망 를 즉시 검색할 수 있다. 상각 추론(Amortized Inference) 종래 기술에 따른 신경망 구조 검색(NAS) 방법은 보이지 않는 데이터셋 에 대한 구조(architectures)를 검색 하기 위해 학습에 최소 GPU 시간이 필요하다. 반면, 일 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신 경망을 검색하는 장치는 태스크의 분포 에 대해 상각된 메타 학습으로 모델을 학습하기 때문에 메타 학습 파라미터 와 함께 쿼리 인코더 를 사용하여 보이지 않는 데이터셋에 대한 쿼리 임베딩 를 얻 기 위해 데이터셋 당 단일 전진 패스(single forward pass per dataset)만 필요하다. 쿼리 임베딩을 얻은 후, 유사성을 기반으로 쿼리에 가장 정합한 신경망 을 검색한다(아래의 수학식 6 참조). [수학식 6]"}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서, 모델 임베딩의 셋(set) 는 메타 학습된 모델 인코더 에 의해 미리 계 산된다. 성능 예측기(Performance Prediction) 일 실시예에 따르면, 메타 학습된 성능 예측기 를 사용하여 예측된 성능을 바탕으로 상위 후보 신경망 중 가장 우수한 성능의 어느 하나를 선택할 수 있다. 데이터셋을 고려하는 모듈을 포함하는 성능 예 측기는 태스크의 분포 에 대해 메타 학습되었기 때문에 학습없이 보이지 않는 데이터셋 에 대한 성능을 예측할 수 있다. 태스크 적응형 초기화(Task-adaptive Initialization) 일 실시예에 따르면, 보이지 않는 데이터셋이 주어지면, 보이지 않는 쿼리 데이터셋과 매우 유사한 특정 학습 데이터셋에 대해 학습된 신경망을 검색할 수 있다. 따라서, 검색된 신경망 가 복수 개의 데이터셋, 상기 데이 터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베이스에 포함된 유사한 데이터셋 에 대해 이미 학습된 태스크 관련 초기 파라미터를 가지고 있기 때문에 보이지 않는 대상 데이터셋 에 대해 학습된 신경망의 미세 조정 시간이 효과적으로 감소될 수 있다. 만약, 파라미터(parameters) 및 플롭(flops)과 같은 제약조건 을 추가로 고려할 필요가 있는 경우, 검색된 모델이 점수의 내림차순으로 정렬한 다음 제약조건 에 맞는 최상의 정확도 모델을 선택하여 태스크에 대한 특정 제약조건을 충족하는지 쉽게 확인할 수 있다. 도 4는 일 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법의 순서도이다. 도 4에 도시된 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법은 도 1 내지 도 3 에 도시된 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치에서 시계열적으로 처리되는 단계 들을 포함한다. 따라서, 이하에서 생략된 내용이라고 하더라도, 도 1 내지 도 3에 도시된 메타 대조 학습 기반 의 태스크 적응형 신경망을 검색하는 장치에 관하여 이상에서 기술한 내용은 도 4에 도시된 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법에도 적용될 수 있다. 도 4에 도시된 바와 같이, 본 실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 는 메모리에 저장된 복수 개의 데이터셋, 데이터셋을 사전 학습한 신경망으로 구성된 학습모델 풀(pool)을 포함하는 데이터베이스에서, 어느 하나의 태스크(task)를 미리 선택한다(S410). 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치는 데이터베이스에서 미리 선택된 어느 하나 의 태스크(task)에 포함된 제약조건(constraint)을 고려하여 데이터셋과 데이터셋에 대해 학습된 신경망 사이의 유사도를 계산함으로써, 데이터셋과 데이터셋에 대해 학습된 신경망에 대한 크로스 모달 잠재 공간을 학습하여 최적의 신경망을 검색한다(S420). 이상의 실시예들에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field programmable gate array) 또는 ASIC 와 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구 성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프 로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램특허 코드의 세그먼트들, 드라이버들, 펌웨어, 마 이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구 성요소들과 '~부'들로부터 분리될 수 있다.뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU 들을 재생시키도록 구현될 수도 있다. 한편, 본 명세서를 통해 설명된 일실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법 은 컴퓨터에 의해 실행 가능한 명령어 및 데이터를 저장하는, 컴퓨터로 판독 가능한 매체의 형태로도 구현될 수 있다. 이때, 명령어 및 데이터는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 소정의 프로그램 모듈을 생성하여 소정의 동작을 수행할 수 있다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모 두 포함한다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터 기록 매체일 수 있는데, 컴퓨터 기록 매체는 컴퓨터 판독 가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함할 수 있다. 예를 들어, 컴퓨터 기록 매체는 HDD 및 SSD 등과 같은 마그네틱 저장 매체, CD, DVD 및 블루레이 디스크 등과 같은 광학적 기록 매체, 또는 네트워크를 통해 접근 가능한 서버에 포함되는 메모리일 수 있다. 또한, 본 명세서를 통해 설명된 일실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방법 은 컴퓨터에 의해 실행 가능한 명령어를 포함하는 컴퓨터 프로그램(또는 컴퓨터 프로그램 제품)으로 구현될 수 도 있다. 컴퓨터 프로그램은 프로세서에 의해 처리되는 프로그래밍 가능한 기계 명령어를 포함하고, 고레벨 프 로그래밍 언어(High-level Programming Language), 객체 지향 프로그래밍 언어(Object-oriented Programming Language), 어셈블리 언어 또는 기계 언어 등으로 구현될 수 있다. 또한 컴퓨터 프로그램은 유형의 컴퓨터 판독 가능 기록매체(예를 들어, 메모리, 하드디스크, 자기/광학 매체 또는 SSD(Solid-State Drive) 등)에 기록될 수 있다. 따라서, 본 명세서를 통해 설명된 일실시예에 따른 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 방 법은 상술한 바와 같은 컴퓨터 프로그램이 컴퓨팅 장치에 의해 실행됨으로써 구현될 수 있다. 컴퓨팅 장치는 프 로세서와, 메모리와, 저장 장치와, 메모리 및 고속 확장포트에 접속하고 있는 고속 인터페이스와, 저속 버스와 저장 장치에 접속하고 있는 저속 인터페이스 중 적어도 일부를 포함할 수 있다. 이러한 성분들 각각은 다양한 버스를 이용하여 서로 접속되어 있으며, 공통 마더보드에 탑재되거나 다른 적절한 방식으로 장착될 수 있다. 여기서 프로세서는 컴퓨팅 장치 내에서 명령어를 처리할 수 있는데, 이런 명령어로는, 예컨대 고속 인터페이스 에 접속된 디스플레이처럼 외부 입력, 출력 장치상에 GUI(Graphic User Interface)를 제공하기 위한 그래픽 정 보를 표시하기 위해 메모리나 저장 장치에 저장된 명령어를 들 수 있다. 다른 실시예로서, 다수의 프로세서 및 (또는) 다수의 버스가 적절히 다수의 메모리 및 메모리 형태와 함께 이용될 수 있다. 또한 프로세서는 독립적인 다수의 아날로그 및(또는) 디지털 프로세서를 포함하는 칩들이 이루는 칩셋으로 구현될 수 있다. 또한, 메모리는 컴퓨팅 장치 내에서 정보를 저장한다. 일례로, 메모리는 휘발성 메모리 유닛 또는 그들의 집합 으로 구성될 수 있다. 다른 예로, 메모리는 비휘발성 메모리 유닛 또는 그들의 집합으로 구성될 수 있다. 또한 메모리는 예컨대, 자기 혹은 광 디스크와 같이 다른 형태의 컴퓨터 판독 가능한 매체일 수도 있다. 그리고, 저장장치는 컴퓨팅 장치에게 대용량의 저장공간을 제공할 수 있다. 저장 장치는 컴퓨터 판독 가능한 매 체이거나 이런 매체를 포함하는 구성일 수 있으며, 예를 들어 SAN(Storage Area Network) 내의 장치들이나 다른 구성도 포함할 수 있고, 플로피 디스크 장치, 하드 디스크 장치, 광 디스크 장치, 혹은 테이프 장치, 플래시 메 모리, 그와 유사한 다른 반도체 메모리 장치 혹은 장치 어레이일 수 있다."}
{"patent_id": "10-2022-0049434", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "상술한 실시예들은 예시를 위한 것이며, 상술한 실시예들이 속하는 기술분야의 통상의 지식을 가진 자는 상술한 실시예들이 갖는 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하 다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적 이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 명세서를 통해 보호받고자 하는 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지 며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발 명의 범위에 포함되는 것으로 해석되어야 한다. 부호의 설명100 : 메타 대조 학습 기반의 태스크 적응형 신경망을 검색하는 장치 110 : 입출력부 120 : 통신부 130 : 메모리 140 : 제어부"}
{"patent_id": "10-2022-0049434", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하, 첨부되는 도면들은 본 명세서에 개시되는 바람직한 실시예를 예시하는 것이며,"}
