{"patent_id": "10-2019-0037709", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0116231", "출원번호": "10-2019-0037709", "발명의 명칭": "사례기반추론기술 및 블록체인방식을 적용한 인공지능형 보안키 정보 보안 시스템 및 그것의", "출원인": "김훈", "발명자": "김훈"}}
{"patent_id": "10-2019-0037709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "보안키 기본 정보를 이용하여 암호화 데이터를 생성하고, 상기 보안키 기본 정보에 대한 구분 암호를 생성하고,상기 구분 암호를 소수를 이용하여 해시 처리함으로 암호화된 신규 구분 암호를 생성하고, 보안키 주요 정보를암호화하는 과정에서 상기 보안키 기본 정보를 해시 처리하는 도중에 사용된 소수를 이용하여 상기 보안키 주요정보에 대한 연결 암호를 생성하는 단말기; 및상기 보안키 기본 정보를 저장하기 위한 기본 정보 DB와 상기 연결 암호를 통해 암호화된 보안키 주요 정보를저장하기 위한 주요 정보 DB를 포함하는 서버를 포함하는 보안 시스템."}
{"patent_id": "10-2019-0037709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 단말기는 상기 암호화된 보안키 기본 정보와 상기 암호화된 신규 구분 암호를 왜곡 처리함으로, CBR 시스템을 통해 상기 보안키 기본 정보를 검색 가능하도록 하는 보안 시스템."}
{"patent_id": "10-2019-0037709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "보안키 기본 정보를 이용하여 암호화 데이터를 생성하고, 상기 보안키 기본 정보에 대한 구분 암호를 생성하고,상기 구분 암호를 소수를 이용하여 해시 처리함으로 암호화된 신규 구분 암호를 생성하고, 상기 보안키 기본 정보의 암호화 데이터 및 상기 암호화된 신규 구분 암호를 기본 정보 DB에 저장하는 기본 정보 관리자; 및상기 보안키 기본 정보를 암호화하는 과정에서 상기 보안키 기본 정보를 해시 처리하는 도중에 사용된 소수를이용하여 보안키 주요 정보에 대한 연결 암호를 생성하고, 상기 연결 암호를 통해 암호화된 주요 보안키 정보를주요 정보 DB에 저장하는 주요 정보 관리자를 포함하는 보안 시스템의 서버."}
{"patent_id": "10-2019-0037709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 보안키 기본 정보를 기술정보 활용을 위한 게이트웨이로 활용하기 위해 보안키 기본 정보를 무작위로 일정부분 왜곡하고, 이를 사례기반추론 엔진이 포함된 본 시스템에서 유사도 검색을 통해서만 보안키 기본정보를 선택되게 함으로서 보안키 데이터를 포함한 주요 정보로 연결하기 전에 보안 처리를 강화하도록 하는 보안 시스템의 서버."}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 보안 시스템은, 보안키 기본 정보를 이용하여 암호화 데이터를 생성하고, 상기 보안키 기본 정보에 대한 구분 암호를 생성하고, 상기 구분 암호를 소수를 이용하여 해시 처리함으로 암호화된 신규 구 분 암호를 생성하고, 보안키 주요 정보를 암호화하는 과정에서 상기 보안키 기본 정보를 해시 처리하는 도중에 사용된 소수를 이용하여 연결 암호를 생성하는 단말기 및 필요 시 보안키 Data를 활용하기 위해 보안키 기본 정 보를 먼저 검색하기 위해서 왜곡시킨 보안키 기본정보를 사례기반추론 엔진을 활용 유사도 검색을 통해서만 보안 키 기본 정보를 검색할 수 있도록 하며, 상기 보안키 기본 정보를 저장하기 위한 기본 정보 DB의 암호를 해시 처 리하여 상기 연결 암호를 통해 연결된 암호화된 보안키 주요 정보를 저장하기 위한 주요 정보 DB를 포함하는 서 버를 포함한다."}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보안 시스템에 관한 것으로, 좀 더 상세하게는 사례기반추론기술 및 블록체인방식을 적용한 인공지능 형 보안키 정보 보안 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "보안 시스템에서 암호화 후 복호화를 위해 꼭 필요한 보안키 정보 보안방식은 보안키를 서버의 별도 DB에 보관 하여 필요 시 이를 활용하고 있다. 날이 갈수록 지능적 범죄가 발달하고 있는 상황에서 통상적인 보안키 보관 방식은 해킹에 상대적으로 취약하여 보안키 정보의 외부 유출로 이어질 수 있다. 따라서 보다 철저하고 확실한 보안키 보관 방법이 요망된다. 본 발명에서는 보안키 Data를 적절히 나누어 특정 DB에 분산 저장하고 Hash 함수를 적용 서로 연결하도록 하고 있다. 또한, 인공지능 방식인 사례기반추론(Case Based Reasoning)방식을 적용 허가 받지 않고서는 보안키 정보"}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "를 해킹할 수 없도록 하고 있다. 발명의 내용"}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 기술적 과제를 해결하기 위한 것으로, 본 발명의 목적은 개인정보 보안이나 주요문서 보안 시 정보내용을 암호화 시 별도로 보관하는 보안키 Data의 해킹을 원천적으로 방지하기 위해 별도의 블록체인 방식 인 Hash 함수를 적용하고, 또한, 인공지능 방식인 사례기반추론 기술을 적용한 보안키 보안 시스템 및 방법을 제공하는 데 있다."}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 보안 시스템은, 보안키 기본 정보를 이용하여 암호화 데이터를 생성하고, 상기 보안 키 기본 정보에 대한 구분 암호를 생성하고, 상기 구분 암호를 소수를 이용하여 해시 처리함으로 암호화된 신규 구분 암호를 생성하고, 보안키 내용정보를 보관하는 과정에서 상기 보안키 기본 정보를 해시 처리하는 도중에 사용된 소수를 이용하여 연결 암호를 생성하는 단말기; 및 상기 보안키 기본 정보를 저장하기 위한 기본 정보 DB와 상기 연결 암호를 통해 암호화된 보안키 내용 정보를 저장하기 위한 보안키 내용 정보 DB를 포함하는 서버 를 포함한다. 실시 예로서, 상기 단말기는 상기 암호화된 보안키 기본 정보와 상기 암호화된 구분암호를 왜곡 처리할 수 있다. 상기 단말기는 상기 암호화된 보안키 기본 정보와 상기 암호화된 구분암호를 왜곡 처리할 수 있다. 즉 필 요 시 보안키 Data 내용을 활용하기 위해 보안키 기본 정보를 먼저 검색하기 위해서 왜곡시킨 보안키 기본정보 사례베이스에서 사례기반추론 엔진을 활용 유사도 검색을 통해서만 보안키 기본 정보를 검색할 수 있다. 본 발명의 실시 예에 따른 보안 시스템의 서버는, 보안키 기본 정보를 이용하여 암호화 데이터를 생성하고, 상 기 보안키 기본 정보에 대한 구분 암호를 생성하고, 상기 구분 암호를 소수를 이용하여 해시 처리함으로 암호화 된 신규구분 암호를 생성하고, 상기 보안키 기본 정보의 암호화 데이터 및 상기 암호화된 구분 암호를 기본 정 보 DB에 저장하는 기본 정보 관리자, 상기 보안키 주요 정보를 암호화 하는 과정에서 상기 보안키 기본 정보를 해시 처리하는 도중에 사용된 소수를 이용하여 연결 암호를 생성하고, 상기 연결 암호를 통해 암호화된 보안키 내용을 내용 정보 DB에 저장하는 보안키 내용 정보 관리자를 포함한다."}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 보안키의 유출 방지 등 보안 처리를 더욱 강화하기 위하여, 인공지능 보안키와 사 례 기반 추론(CBR: Case Based Reasoning) 기술을 적용한다. 보다 구체적으로 해싱(Hashing) 처리 방식과 CBR 기술을 적용하여 본 발명의 경우에는 보안키 Data 정보를 입력하면, 해커가 일부 데이터에 침범해도 보안키 기 본 정보를 파악할 수 없도록 한다. 따라서, 본 발명에 따르면 보안키의 내용정보가 외부로 유출되는 것이 철저 히 방지될 수 있다. 본 발명의 실시 예에 따르면, 기존의 보안시스템에서는 암호화를 통한 보안으로 보안키를 통한 복호화가 필수적 인 기능이나 보안키가 해킹이 되면 쉽게 주요내용이 유출될 수 있었으나 이 보안키 내용이 해킹되지 않는 관계 로 보안이 철저히 유지된다."}
{"patent_id": "10-2019-0037709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있을 정도로, 본 발명의 실시 예들이 명확하고 상세하게 기재될 것이다. 본 발명에서는 보안키 Data를 적절히 나누어 특정 DB에 분산 저장하고 Hash 함수를 적용 서로 연결하도록 하고 있다. 또한 인공지능 방식인 사례기반추론(Case Based Reasoning)방식을 적용 허가 받지 않고서는 보안키 정보 를 해킹할 수 없도록 하고 있다. 도 1은 본 발명의 실시 예에 따른 보안 시스템을 개략적으로 보여주는 블록도이다. 도 1을 참조하면, 보안키정 보 보안 시스템은 단말기와 서버를 포함한다. 보안키 담당자(이하, 담당자라 함)는 단말기 를 이용하여 보안키 No. 구분암호와 같은 보안키 기본 정보와 Sender 명, 보안대상 File, 및 보안 키 세부내용 같은 보안키 주요 정보를 입력할 수 있다. 보안키 기본 정보와 보안키 주요 정보는 서버의 저장부에 저장될 수 있다. 서버(120 0)의 저장부는 기본 정보 DB와 주요 정보 DB를 포함할 수 있다. 기본 정보 DB에는 보안키 기본 정보 가 저장될 수 있다. 서버의 제어부는 저장부의 기본 정보 DB와 주요 정보 DB를 이용하 여 다양한 정보를 도출하거나 보안 관리를 할 수 있다. 예를 들면, 제어부는 블록 체인 시스템(KCS)을 이 용하여 보안 관리를 수행할 수 있다. 한편, 보안 시스템은 도 1에 도시된 바와 같은 해커의 공격을 막을 수 있다. 해커 1은 보안키 정보를 단 말기에 입력할 수 있는 담당자(이하, 담당자라 함)일 수 있다. 담당자는 보안키의 기본 정보뿐 아니라, 주요 정보에도 쉽게 접근할 수 있다. 따라서 담당자는 특별한 보안 관리나 개인 인증 관리를 필요로 한다. 해커 2는 단말기로부터 보안키 정보를 빼낼 수 있다. 해커 2는 유선 또는 무선 통신하는 도중에 보안키 정보를 빼내거나, 단말기에 해킹 수단을 설치하여 보안키 정보를 빼낼 수 있다. 따라서 해커 2를 막기 위 해서는 보안키No, 구분암호 등 모든 정보를 나누어서 입력하고 Hash 함수로 연결할 필요가 있다. 해커 3은 서버 내의 저장부에서 보안키 정보를 빼낼 수 있다. 따라서 해커 3에 대응하기 위해서는 Hash 함수를 통해서 기본 정보와 주요 정보를 연결하여 보안키 No 와 구분암호를 함께 얻게 하지 못하게 함으로, 저장부의 주요정보 DB로 부터 보안키 기본 정보 확보를 차단할 필요가 있다. 저장부 내 별 도로 보관되는 왜곡이 안된 보안키 기본 정보는 전산 작업 시 보안키 Data 환원 처리 후 보안키 기본 정보 재 왜곡 시 활용될 수 있다. 해커 4는 서버 내의 제어부에서 보안키 정보를 빼낼 수 있다. 해커 4에 대해서는 제어부 내 에 침입하여 보안키 주요 정보를 탈취한다고 해도 기본 정보와 주요 정보를 Hash 함수로 연동되게 함으로, 보안 키 No. 등 기본정보 확보가 불가능하게 할 필요가 있다. 이하에서는 해커 1 내지 4의 공격에 대한 방어 방법이 좀 더 구체적으로 설명될 것이다. 도 2는 도 1에 도시된 단말기를 예시적으로 보여주는 블록도이다. 도 2를 참조하면, 단말기는 입력부 , 제어부, 출력부, 그리고 전원부를 포함할 수 있다. 전원부는 제어부의 제어에 따라 동작 전원을 입력부, 제어부, 그리고 출력부에 제공할 수 있다. 담당자는 단말기에 접근할 수 있는 보안 허가자이다. 그러나 담당자를 통해 자료(예를 들면, 보안키의 주 요 정보)가 유출될 수도 있다. 이를 방지하기 위해 입력부는 허가자 보안 등급 리스트 확인 또는 개인 인 증 후에 접근할 수 있도록 할 수 있다. 입력부는 담당자 로그 파일(Log-File)을 관리할 수 있다. 로그 파 일은 보안 시스템을 통해서만 확인 가능하고, 담당자는 내용을 수정할 수 없도록 할 수 있다. 제어부는 단말기의 전반적인 동작을 제어할 수 있다. 제어부는 입력부, 출력부, 그리고 전원부 사이의 동작을 제어할 수 있다. 예를 들면, 제어부는 입력부를 통해 입력된 보안키 No를 암호화할 수 있다. 제어부는 암호화된 보안키 No를 구분하기 위해 구분 암호를 생성하고, 구 분 암호를 암호화할 수 있다. 또한, 제어부는 암호화된 보안키 No.나 구분 암호를 왜곡 처리함으로, 해 커 2의 공격으로부터 보안키 정보를 보호할 수 있다. 출력부는 제어부로부터 암호화 또는 왜곡 처리된 보안키 정보를 수신하고, 수신한 보안키 정보를 서버(도 1 참조, 1200)로 제공할 수 있다. 출력부는 암호화된 보안키 No.와 구분 암호, 또는 보안키 주요정보의 암호화 데이터를 각각 별도로 서버로 전송할 수 있다. 여기에서, 암호화된 보안키 No.와 구분 암 호는 연결 암호를 연결되어, 서버의 기본 정보 DB에 저장될 수 있다. 그리고 암호화된 보안키 주요 정보 는 주요 정보 DB에 저장될 수 있다. 출력부는 유선 또는 무선 통신을 이용하여 서버로 데이터를 제공할 수 있다. 출력부가 무선 통신을 이용하는 경우에는, WWAN(wireless wide area network) 통신(예를 들어, RF 무선 통신, IEEE 802.20), WMAN(wireless metropolitan area network) 통신(예를 들어, IEEE 802.16, WiMAX), WLAN(wireless local area network) 통신(예를 들어, NFC, BLE, WiFi, Ad-Hoc 등), 및 WPAN(wireless personal area network) 통신(예를 들어, IEEE 802.15, Zigbee, Bluetooth, UWB, RFID, Wireless USB, Z-Wave, Body Area Network) 중 적어도 하 나의 방식으로 무선 통신을 수행하도록 구현될 수 있다. 도 3은 도 2에 도시된 제어부의 보안키 기본 정보를 관리하는 동작을 예시적으로 설명하기 위한 개념도이다. 제 어부는 입력부를 통해 입력된 보안키 기본 정보(도 1 참조, 1101)를 암호화할 수 있다. 예를 들면, 보안키 기본 정보는 도 1에 도시된 바와 같이 보안키 No.일 수 있다. 도 3의 예를 참조하면, 보안키 A 은 253138로 암호화될 수 있다. 제어부는 암호화 데이터를 왜곡 처 리할 수 있다. 예를 들면, 제어부는 암호화 데이터 253138에서 첫째와 세째 자리 숫자를 왜곡 처리하여, 752138로 왜곡 처리된 데이터를 생성할 수 있다. 즉, 제어부는 입력된 보안키 A 으로부터 암호화 및 왜곡 처리된 데이터를 생성할 수 있다. 한편, 제어부는 암호화 또는 왜곡 처리된 보안키 번호를 구별하기 위해 구분 암호를 생성할 수 있다. 도 3을 참조하면, 제어부는 보안키 A 으로부터 구분 암호를 생성하고, 구분 암호를 암호화할 수 있다. 제어부는 구분 암호를 암호화하기 위해 해시 처리(hash process)를 할 수 있다. 제어부는 암호화 데이터를 소수를 이용하여 해시 처리함으로 연결 암호를 얻을 수 있다. 여기에서, 소수는 1과 자신만으 로 나누어지는 수를 의미한다. 1단계에서는 구분 암호 341256을 소수 173으로 나누어 1972.57을 얻는다. 2단계에서는 1단계의 결과값 중에서 정수만을 취해 1972를 얻고 소수 149를 곱하여 293828을 얻는다. 도 3에서는 암호화 데이터의 길이는 6자리이지 만, 실제 적용 시에는 20자리이고, 소수 길이는 14자리이고, 계산 결과로 얻는 정수는 6자리일 수 있다. 또한, 해시 처리를 위한 소수(위의 예에서, 173 또는 149)는 보안키의 활용 시마다 변경될 수 있다. 제어부는 활용 시마다 소수를 변경하기 때문에, 해커가 보안키의 거래 내역을 추적하더라도 보안키 번호(No.)를 확인할 수 없다. 또한, 제어부는 암호화된 구분 암호를 왜곡 처리할 수 있다. 제어부는 일정한 규칙(rule) 범위 내 에서 적정 비율로 랜덤 넘버 생성 알고리즘을 이용하여 변경 위치를 정하고 숫자를 변경할 수 있다. 예를 들면, 제어부는 암호화된 구분 암호 데이터 293828의 첫째와 넷째 자리 숫자를 왜곡 처리함으로, 암호화 및 왜 곡 처리된 데이터를 생성할 수 있다. 도 3의 예에서는 암호화 및 왜곡 처리된 보안키 기본 정보의 데이터의 길이가 6자리이지만, 실제로는 그 보다 더 긴 데이터(예를 들면, 32~56)를 사용함으로 보안성을 더욱 높일 수 있다. 한편, 본 발명의 실시 예에 따라서 왜곡처리 동작은 단말기의 제어부에서 수행되지 않고, 서버의 제어부에서 수행 될 수도 있다. 본 발명의 실시 예에 따른 보안 시스템은 단말기에 입력된 보안키 기본 정보 를 암호화하고 왜곡 처리함으로, 해커의 공격으로부터 보안키 정보를 보호할 수 있다. 도 4는 도 2에 도시된 제어부의 보안키 주요 정보를 관리하는 동작을 예시적으로 설명하기 위한 개념도이다. 제 어부는 입력부를 통해 입력된 보안키 주요 정보(도 1 참조, 1102)를 암호화할 수 있다. 예를 들면, 보안키 Data 정보는 , Sender명, 보안File명, 보안키 세부 내용1, 2.....n 등일 수 있다. Sender명은 23518로 암호화되고, 보안File명은 93174로 암호화되고, 보안키 세부내용은 세분화되어 48289, 36518, 42346... 등으로 암호화될 수 있다. 제어부는 보안키 기본 정보의 구분암호 내 각각의 Data정보(Sender명, 보안File명, 보안키 세부 내 용)의 연결암호를 해시 처리함으로 주요정보 내 각각의 연결 암호를 생성할 수 있다. 제어부는 해시 처리 를 위해 소수를 사용할 수 있다. “Sender명”의 암호화 데이터 23518을 소수 173으로 나누고 정수를 선택함으로, “Sender명”의 주요정보 연결 암호 135를 얻을 수 있다. 마찬가지로, 등록번호의 주요정보 연결 암호 538과 코인 수의 주요정보 연결 암호279도 각각의 암호화 데이터 93174와 48289를 소수 173으로 나누고 정수를 선택함으로 얻을 수 있다. 제어부는 보안키 주요 정보도 보안키 기본 정보와 마찬가지로, 보안성을 높이기 위해 암호화 데이터를 더 길게 할 수 있다. 한편, 보안키 주요 정보를 관리하는 동작은 서버의 제어부에서 수행 될 수도 있다. 본 발명의 실시 예에 따른 보안 시스템은 단말기에 입력된 보안키 주요 데이터를 암 호화함으로, 해커의 공격으로부터 보안키 정보를 보호할 수 있다. 도 5는 도 1에 도시된 서버를 예시적으로 보여주는 블록도이다. 도 5를 참조하면, 서버는 통신부, 저장부, 그리고 제어부를 포함할 수 있다. 서버는 단말기로 관리 프로그램을 제공함으 로, 보안키 정보를 관리하거나 보안키가 프로그램을 실행하도록 할 수 있다. 또한, 서버는 단말기 로부터 보안키 정보를 입력 받고 보안키 기본 정보나 보안키 주요 정보 등을 관리할 수 있다. 통신부는 단말기와 유선 또는 무선으로 통신을 수행할 수 있도록 한다. 통신부는 CDMA(code division multiple access), GSM(global system for mobile communication), WCDMA(wideband CDMA), CDMA- 2000, TDMA(time division multiple access), LTE(long term evolution), Wimax(worldwide interoperability for microwave access), WLAN(wireless LAN), UWB(ultrawide band), 블루투스(bluetooth), WI-DI(wireless display), 인터넷, LAN 등과 같은 유무선 통신을 지원할 수 있다. 통신부는 입력부와 출력부를 포함할 수 있다. 입력부는 단말기로부터 보안키 정 보를 입력받을 수 있다. 또는 입력부는 단말기로부터 보안키 기본 정보나 보안키 주요 정보를 입력 받을 수 있다. 입력부는 보안키 정보 즉 보안키 기본 정보나 보안키 주요 정보 등을 저장부 또는 제어부로 제공할 수 있다. 출력부는 단말기로 관리 프로그램을 제공하고, 보안키 정보 또는 사례 정보 등을 제공할 수 있다. 저장부는 통신부를 통해 수신하는 보안키 정보들을 저장할 수 있다. 저장부는 기본 정보 DB, 주요 정보 DB, 그리고 사례 정보 DB를 포함할 수 있다. 보안키 기본 정보(도 1 참조, 1101)와 보안키 주요 정보(도 1 참조, 1102)는 서버의 저장부에 저장될 수 있다. 서버의 저 장부는 기본 정보 DB와 주요 정보 DB를 포함할 수 있다. 기본 정보 DB에는 암호화 또는 왜곡 처리된 보안키 기본 정보가 저장될 수 있다. 또한, 기본 정보 DB에는 별도로 보관되는 왜곡이 안된 보안키 기본 정보도 저장될 수 있다. 왜곡 처리가 되지 않은 보안키 기본 정보는 전산 작업 시 특정 보안키 주요정보 환원 처리 후 보안키 기본 정보 재 왜곡 시 활용될 수 있다. 서버의 제어부는 저장부의 기본 정보 DB와 주요 정보 DB를 이용하여 다양한 정 보를 도출하거나 보안 관리를 할 수 있다. 예를 들면, 제어부는 블록체인 시스템(TCS)을 이용하여 보안 관리를 수행할 수 있다. 기본 정보 DB에는 단말기로부터 입력된 보안키 정보가 저장되며, 보안키 No., 단말기 ID, 연락처 등과 같은 보안키의 기본적인 정보가 저장될 수 있다. 주요 정보 DB에는 보안키의 기본 정보와 연관되고 보안키의 보안과 관련되는 주요 정보가 저장될 수 있다. 제어부는 프로세서, 프로그램 관리자, 기본 정보 관리자, 주요 정보 관리자를 포함할 수 있다. 제어부는 하드웨어나 소프트웨어로 구현될 수 있다. 예를 들면, 프로세서는 하드 웨어로 구현되고, 프로그램 관리자, 기본 정보 관리자, 주요 정보 관리자는 알고리즘이나 소 프트웨어로 구현될 수 있다. 프로세서는 서버의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서는 저장부의 기본 정보 DB, 주요 정보 DB에 접근(access)하고, 기본 정보 관리자, 주요 정보 관리자 를 구성하는 알고리즘이나 프로그램 명령을 실행함으로, 제어부를 구동할 수 있다. 또한, 프로세서 는 서버의 여러 구성 요소들을 제어하는 컨트롤러들, 인터페이스들, 그래픽 엔진 등을 포함할 수 있다. 프로세서는 SoC(system-on-chip), ASIC(application specific integrated circuit), FPGA(field programmable gate array) 등의 형태로 제공될 수 있다. 프로그램 관리자는 단말기에 관리 프로그램을 제공하거나 설치하도록 지원할 수 있다. 프로그램 관 리자는 관리 프로그램을 설치한 단말기를 통해 필요 시 별도 보안 프로그램을 실행하도록 할 수 있 다. 기본 정보 관리자는 저장부의 기본 정보 DB에 접근하여 보안키의 기본정보를 관리할 수 있다. 기본 정보 관리자는 단말기를 통해 신규 보안키가 생성되는 경우에, 신규 보안키의 No.를 부여하고 기본 정보 DB에 신규 보안키 No. 및 구분암호 등을 저장할 수 있다. 기본 정보 관리자는 기 존 보안키의 기본 정보가 변경되는 경우에, 기본 정보 DB에 저장된 기본 정보를 업데이트 할 수 있다. 주요 정보 관리자는 저장부의 주요 정보 DB에 접근하여 보안키의 주요 정보를 관리할 수 있 다. 주요 정보 관리자는 기존 주요 정보가 변경되는 경우에, 주요 정보 DB에 저장된 주요 정보를 업데이트할 수 있다. 도 6은 도 5에 도시된 주요 정보 관리자의 동작 방법을 예시적으로 설명하기 위한 개념도이다. 도 6을 참조하면, 예를 들면 보안키 A 와 보안키 B의 보안키 기본 정보는 보안키 No., 구분암호 등이고, 보안키 주요 정보 (보안키 Sender명, 보안File명, 보안키 세부내용) 등이다. 보안키 기본 정보는 기본 정보 DB에 저장 될 수 있다. 보안키 주요 정보는 도 6에서 보는 바와 같이 연결 암호를 통해 주요 정보 DB에 저장될 수 있다. 보안키 A의 Sender명과 보안키 내용1은 각각 연결 암호 135와 279를 통해 주요 정보 DB에 저장될 수 있다. 다음으로, 보안키 B의 보안키 내용1과 Sender명은 각각 연결 암호 307과 570을 통해 주요 정보 DB 에 저장될 수 있다. 그리고 보안키 A의 보안File명과 보안키 B의 Sender명은 각각 연결 암호 538과 570을 통해 주요정보 DB에 저장될 수 있다. 해커 3이 주요 정보 DB를 해킹하려고 하는 경우에, 주요 정보의 각 속성 앞의 연결 암호는 기본 정보 구 분 암호 뒤에 있는 연결 암호의 Hash 처리 결과 번호로 처리할 수 있다. 보안키 기본 정보 내의 구분 암호 뒤의 연결 암호를 Hash function으로 처리할 수 있다. 처리 결과치를 주요 정 보 앞에 기록하여 기본정보에서 주요 정보 속성으로 연결되게 한다. 그러나 주요 정보를 해킹을 해도 기본 정보 로 연결이 안 되어 보안키 보안키 No.을 유추할 수 없게 된다. 여러 보안키 들의 주요 정보 속성들을 뒤섞어 놓아 해킹을 해도 관계성이 없어 보안이 유지될 수 있다. 도 7은 도 5에 도시된 주요 정보 관리자의 주요 정보 환원 동작을 예시적으로 보여주는 블록도이다. 도 7을 참 조하면, 서버의 제어부는 전산 처리가 필요 시 KCS 시스템을 통해서 보안키 기본 정보를 검색할 수 있다. 이 KCS 시스템은 CBR(사례기반추론) 시스템으로서 등록 시 왜곡 보관한 보안키 기본 정보 DB를 유사도 검 색을 하여 정확히 보안키를 찾아 해당 주요정보를 환원하고, 단말기로 제공할 수 있다. 서버의 제 어부는 최단 시간 내에 서버 내에서 BCS를 활용한 검색 작업을 수행한 후에는 환원 데이터를 삭제할 수 있다. 단말기는 환원 데이터 삭제 후에 작업 결과만을 담당자에게 전달할 수 있다. CBR 시스템에 관해서는 본 출원인이 출원한 2017년 5월 15일에 출원(출원번호: 10-2015-0155339)한 \"사례기반 추론엔진을 이용한 보안 서버 및 보안 기능의 설치를 위한 저장 매체\"에 기재되어 있으며, 본 출원의 CBR 시스 템에 적용될 수 있다. CBR 시스템은 검색을 위한 보안키 정보를 입력받고, 사례 데이터베이스 검색을 한다. CBR 시스템은 검색된 보안 키 정보의 사례에서 속성들 각각에 대해서 유사도를 계산하고, 유사도 계산이 완료된 보안키 정보의 속성들 각 각에 대한 유사도에 가중치를 적용 및 가중치가 적용된 사례별로 최종 유사도 값을 계산한다. CBR시스템은 계산 된 최종 유사도 값에 근거하여 일치된 보안키 정보, 즉 보안키 기본 정보를 검출하였는지 판단한다. 이때, CBR 시스템은 계산된 최종 유사도 값이 가장 높은 사례의 보안키 정보를 일치된 보안키 정보로 판단할 수 있다. 예를 들면, CBR 시스템은 최종 유사도 값이 가장 높은 사례의 보안키 정보, 즉 보안키 기본 정보를 검출하면, 검출된 보안키 기본 정보에 대응하여 매핑된 보안키 주요 정보를 함께 추출하여 사용자에게 제공할 수 있다. 하 지만, CBR 시스템이 미리 설정된 기준값 미만이거나 검색 요청된 보안키 정보에 대응되는 보안키 정보가존재하 지 않으면 종료할 수 있다. 한편, CBR 시스템은 최종 유사도 값이 높은 두개 이상의 사례에 대한 보안키 정보들 을 추출하고, 해당 보안키 정보들 중에서 미리 결정된 기준을 판단을 통해 검색 요청된 보안키 정보를 검출할 수도 있다. CBR 시스템은 일치된 보안키 기본 정보를 복구하고, 복구된 보안키 기본 정보에 매칭된 암호화된 보 안키 주요 정보를 복호화할 수 있다. 도 8은 도 7에 도시된 기본 정보 관리자의 신규 구분 암호 변경에 따른 보안키 기본 정보를 관리하는 동작을 예 시적으로 설명하기 위한 개념도이다. 여기에서, 신규 구분 암호 변경에 따른 보안키 기본 정보 관리 동작은 단 말기의 제어부에서 수행될 수도 있다. 제어부는 보안키 No.의 암호화 데이터 253138에서 둘째와 여섯 자리 숫자를 왜곡 처리하여, 243139로 왜 곡 처리된 데이터를 생성할 수 있다. 즉, 제어부의 기본 정보 관리자는 기본 정보 DB에 저장된 보안키 명으로부터 신규 왜곡 처리된 데이터 243139를 생성할 수 있다. 한편, 제어부는 기본 정보 DB에 저장된 구분 암호를 2회 별도의 해시 처리를 통해 신규 구 분 암호를 생성할 수 있다. 1단계에서는 구분 암호 341256을 소수 113으로 나누어 3019.90을 얻는다. 2단계에서 는 1단계의 결과값 중에서 정수만을 취해 3019를 얻고 소수 179를 곱하여 540573을 얻는다. 제어부는 거래(transaction) 시마다 신규 구분 암호를 변경하고, 서버 내의 구분 암호는 그대로 사 용한다. 보안키 기본 정보 내 구분 암호와 연동되는 주요 정보 속성 별 연결 부분은 신규로 해시 처리를 하지 않는다. 또한, 제어부는 충분히 긴 해시 처리 번호를 사용함으로 보안성을 높일 수 있다. 기본 정보를 재 왜곡 처리 후 기본 정보 DB에 저장할 수 있다. 본 발명은 보안키의 주요 정보 유출 방지 등 보안 처리를 더욱 강화하기 위하여, 인공지능 기수의 하나인 사례 기반 추론(CBR: Case Based Reasoning) 기술을 적용한다. 보다 구체적으로 해싱(Hashing) 처리 방식을 적용하 여 본 발명의 경우에, 보안키 정보를 입력하고 등록 시부터 시스템 내 외부 출력 시까지, 해커가 일부 데이터에 침범해도 보안키 No.를 파악할 수 없도록 한다. 따라서, 본 발명의 보안정책에 따르면 보안키의 주요정보가 외 부로 유출되는 것이 철저히 방지된다. 특히 보안키 정보의 철저한 보안을 통해 개인의 의료 정보 등을 포함하는 특정 비밀 정보도 외부 유출을 방지할 수 있다. 이를 위해 본 발명에서는 주요 정보의 접근을 상당한 수준으로 제한한다. 예를 들어, 접근은 사례 기 반 추론 엔진을 이용하여 유사도 검색을 통해서 이루어질 수 있다. 본 발명의 보안은 블록체인 방식의 해시 함수를 기본적으로 적용한다. 나아가서, 본 발명의 보안은 정보의 등록 과정에서 생길 수 있는 보안키 주요 정보의 외부 유출을 막는다. 이를 위해, 인공 지능 방식의 사례 기반 추론 엔진을 활용하고, 보안키 정보 속성들 연결에 Hashing 처리한 블록체인 기술도 적용한다. 따라서, 초기 보안키 생성 시부터 보안키 주요 정보 보안이 철저히 유지되도록 한다. 본 발명은 초기 생성 시 보안키 기본 정보 속성들 (보안키 No., 보안키 구분암호 등)을 Hashing 처리하여 서로 다른 주소에 저장한다. 또한, 보안키 기본 정보인 암호화된 보안키 No., Hashing 처리된 보안키 구분 암호 등 을 왜곡시켜 기본 정보 DB에저장한다. 또한, 보안키 구분 암호와 보안키 주요 정보 속성들을 블록체인 보안키를 적용하여 또한 Hashing 처리 연결한다. 그리고 보안키 주요 정보 검색 시 보안키들 기본 정보 사례 데이터를 본 KCS(Security Key Case Search) 보안 시스템의 유사도 사례 검색을 통해서만 보안키 주요 정보로 연결되도록 한 다. 결국, 주요 정보 데이터를 해커가 침입하여도, 모든 연결이 Hashing 처리되어 역 검색이 안 된다. 즉, 보안키 No. 노출이 불가능하므로, 보안키의 민감한 주요정보 내용이 외부로 유출되지 않는다. 본 발명의 실시 예에 따른 보안 시스템의 서버는 암호화된 정보들을 단말기로부터 입력받는 통신부, 암호화된 정보를 서버 내 사례 기반 추론 엔진으로 출력하는 제어부, 및 사례 데이터베이스화 된 암호화된 정보들을 저장 하는 저장부를 포함할 수 있다. 본 발명의 보안 시스템은 인공지능형 사례 기반 추론 엔진을 포함할 수 있다. 제어부로부터 수신된 암호화된 정보는 기본 정보와 주요 정보로 구분될 수 있다. 특히 기본 정보 내 속성 정보 의 하나인 구분 암호는 별도 Hashing 처리함으로써 보안성을 높인다. 기본 정보 속성 정보들은 랜덤 넘버를 활용 왜곡되며, 암호화된 주요 정보는 속성 별로 각각 구분된다. 또한, 주요 정보 내 하나의 속성도 필요 시 세분화된다. 기본 정보의 구분 암호 속성 연결 암호의 Hashing 처리 결과 를 활용함에 의해, 주요 정보 사례베이스 내의 연결 암호 주소 위치에 주요 정보 내용이 저장된다. 보안 시스템에서 작업 시 검색 대상 정보가 서버의 저장부를 통해 확인된 후 암호화 입력된다. 암호화 입력 후 에, 사례 정보 DB로부터 왜곡된 기본 정보 사례들 중에서, 사례 기반 추론 기술을 활용 유사도 검색이 이루어질 수 있다. 유사도 검색을 통해 기본 정보 사례가 검색 선택되며, 이와 Hashing 처리 연결된 개인 주요 정보는 확 인을 위해 복호화된다. 이에 따라 필요한 정보가 추출되어 시스템에서 출력된다. 출력된 정보는 시스템의 전산처리 작업에 적용된다. 서버 내 DB에 보관된 암호화된 해당 기본 정보 내 보안키 구분 암호는 별도로 다른 소수(素數)들을 활용하여 Hashing 처리된다. 기본 정보 속성들을 다시 왜곡시켜 저장 부에 저장될 수 있다. 따라서, 기존 암호화만을 통한 데이터 보안 방식과 달리 본 발명에서는 암호화되고 왜곡 된 기본 정보의 사례 검색을 통해서만 주요 정보를 추출할 수 있다. 그러므로 조직 내외에서의 해킹을 근본적으 로 막을 수 있다. 본 발명은 왜곡시킨 사례데이터 검색을 통해서 보안키 보안 시스템에 적용될 수 있다. 상술한 내용은 본 발명을 실시하기 위한 구체적인 실시 예들이다. 본 발명은 상술한 실시 예들 이외에도, 단순 하게 설계 변경되거나 용이하게 변경할 수 있는 실시 예들도 포함할 것이다. 또한, 본 발명은 실시 예들을 이용 하여 용이하게 변형하여 실시할 수 있는 기술들도 포함될 것이다. 따라서, 본 발명의 범위는 상술한 실시 예들 에 국한되어 정해져서는 안되며, 후술하는 특허청구범위뿐만 아니라 이 발명의 특허청구범위와 균등한 것들에 의해 정해져야 할 것이다."}
{"patent_id": "10-2019-0037709", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 보안키 보안 시스템을 개략적으로 보여주는 블록도이다. 도 2는 도 1에 도시된 단말기를 예시적으로 보여주는 블록도이다. 도 3은 도 2에 도시된 제어부의 보안키 기본 정보를 관리하는 동작을 예시적으로 설명하기 위한 개념도이다. 도 4는 도 2에 도시된 제어부의 보안키 내용 정보를 관리하는 동작을 예시적으로 설명하기 위한 개념도이다. 도 5는 도 1에 도시된 서버를 예시적으로 보여주는 블록도이다. 도 6은 도 5에 도시된 보안키 내용정보 관리자의 동작 방법을 예시적으로 설명하기 위한 개념도이다. 도 7은 도 5에 도시된 내용정보 관리자의 주요 정보 환원 동작을 예시적으로 보여주는 블록도이다. 도 8은 도 7에 도시된 기본 정보 관리자의 신규 구분 암호 변경에 따른 보안키 내용 정보를 관리하는 동작을 예시적으로 설명하기 위한 개념도이다."}
