{"patent_id": "10-2021-0106993", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0024808", "출원번호": "10-2021-0106993", "발명의 명칭": "파이썬 딥러닝 기반 인공지능", "출원인": "조국환", "발명자": "조국환"}}
{"patent_id": "10-2021-0106993", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부동산 중개업자가 매물관리.접수.상담을 위해 매물장에 입력한 내용을 내장된 파이썬 딥러닝 인공지능이 물건을 분석하고, 관리자가 지정하는 형태로 보고서를 가공해 문서와 음성으로 부동산 물건 컨설팅 내용을 작성,출력,기록해 주는 기능과 방식"}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 광범위하게 활용되는 인터넷기반 부동산 정보를 때와 장소를 불문하고 기록하는데, 기록된 부동산정보 를 파이썬 딥러닝기반의 인공지능이 부동산 상담과 컨설팅에 유용한 팁과 보고서를 자동으로 작성해 부동산 물건 관리자에게 보고함으로 부동산 계약 성사를 높여 중개업자의 수익과 고객 만족을 극대화 한다."}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "부동산 중개를 업으로 하는 중개업자에게 필수적으로 사용되는 부동산매물을 쉽게 편리하게 정리하고 중개에 도 움을 주는 발명으로 본 발명은 파이썬의 딥러닝 기술을 활용하여 부동산중개업무에 인공지능 기술로 특화 시킨 다."}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 기술과 통신기술의 발전으로 모바일 및 인터넷기반 사용은 이미 보편화되었고, 이에 다양한 부가서비 스가 행해지고 있으며, 이러한 부가서비스 중에서 광범위하게 이용되고 있는 파이썬 딥러닝 기술을 부동산분야 에 인공지능기술로 활성화 시킨다."}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "인공지능과 인터넷을 활용한 다양한 플랫폼서비스가 있으나, 부동산중개를 업으로 하는 중개인을 위한 플랫폼이 부족한 상태에서 부동산 중개인에게 필수품인 부동산온라인매물장에 인공지능 기술을 제공하여 중개의 수익을 극대화 하는데 도움 준다."}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "부동산중개인은 대부분 매물장을 온라인으로 보다는, 매물장 전용 책자를 이용해 수기로 기록하는 형테를, 인터 넷과 모바일을 활용하여 온라인으로 쉽고 간편하게 관리해 주어 언제 어디서든 부동산매물관리를 할 수 있게 하 여 기존 수기로 작성 관리하던 업무의 불편함을 해결하고, 이에 파이썬 딥러닝의 인공지능 기술을 탑재해 부동 산중개업무를 극대화 시킨다."}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명으로 부동산중개를 업으로 하는 중개업자의 업무 효율이 극대화 되며, 인공지능 컨설팅 상담 기능을 이 용함으로 고객 응대에 더욱 자신감있고 신속하게 대처 할 수 있어, 부동산중개업자의 수익을 극대화 시키는 효 과가 있다."}
{"patent_id": "10-2021-0106993", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "[실시예] 1. 부동산 매물을 접수하고 관리하는데 기록하는 메모지나, 노트와 필기구를 지참하고 다녀야 하는 불편함이 있 는데, 본 발명은 핸드폰이나 테블릿, 사무실에서는 PC로 바로 물건 접수를 받을 수도 있고, 접수된 물건은 인공 지능를 통해 정리되여, 파이썬 딥러닝 기방의 인공지능이 제공하는 자료를 이용해 부동산 상담시 논리적으로 순차적인 상담을 해주며, 부동산거래의 계약확률을 눞여 준다. 2. 모바일.인터넷 기반의 매물장은 물건 접수를 때와 장소 불문하고 접수받고, 물건상담도 때와 장소 불문하고 설명 상담해 줄 수있다. 본 발명은 파이썬을 기반으로 하는 딥러닝 기술이 탑재되여 매물장에 입력되여진 정보를 기반으로 부동산컨설팅 에 최적화 시켜 물건의 정보를 문서나 음성 자료로 가공해 중개업자에게 제공한다. 본 발명의 핵심은 물건별 상담내용을 기록하면, 입력된 내용을 기반으로 인공지능이 자연스럽게 상담할 수 있는 멘트 및 설명, 컨설팅 자료를 글로, 음성으로 중개업자에게 알려주고, 이 기능은 중개물건이 입력되면 될수록 파이썬의 딥러닝 기술이 더욱 활성화 되어, 각 물건을 더욱 세세하게 조합 분석하고 진화 되면서 중개업자에게 상담할 수 있는 기술을 더욱 업그레이드 하여 전달해 준다. 본 발명의 인공지능 컨설팅 기술이 탑재된 인공지능매물장을 이용하는 부동산 중개업자는, 본 발명을 사용하면 할 수록 상담능력과 브리핑 능력 늘어나 수익이 극대화 된다. 본 발명을 기반으로 상담받은 부동산 고객은 섬세하고 세분화되고, 체계적인 부동산 컨설팅을 받아 서비스 만족 도가 극대화 된다."}
{"patent_id": "10-2021-0106993", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 부동산 매물입력과 파이썬 딥러닝 인공지능 부동산 컨설팅 매물장의 피드백 기능 흐름과 구성도."}
