{"patent_id": "10-2023-0009340", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0114225", "출원번호": "10-2023-0009340", "발명의 명칭": "인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법, 제어 장치, 및 시스", "출원인": "주식회사 마케시안씨앤이", "발명자": "고상원"}}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "(a) 디스플레이부를 통해 사용자에게 운동 동작을 포함한 운동 컨텐츠를 제공하는 단계;(b) 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 상기 사용자가 수행하는 운동 동작이 촬영된 동작별 영상프레임을 각각 수신하는 단계;(c) 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각으로부터 제1 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표를 획득하는 단계;(d) 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표로부터 제2 인공지능모델을 통해 상기 사용자의복수의 관절에 대한 복수의 각도를 획득하는 단계; 및(e) 상기 획득된 복수의 각도를 기초로 상기 사용자의 운동 동작 수행과 관련된 피드백 정보를 상기 디스플레이부를 통해 제공하는 단계;를 포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 (a) 이전에,학습용 영상프레임에 기초해 학습된 상기 제1 인공지능모델을 생성하는 단계; 및상기 복수의 관절에 대한 복수의 학습용 키포인트의 좌표값에 기초해 학습된 상기 제2 인공지능모델을 생성하는단계;를 더 포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 제1 인공지능모델은 CNN 기반의 모델이고, 상기 제2 인공지능모델은 DNN 기반의 모델인, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서, 상기 복수의 카메라는, 상기 사용자의 정면을 촬영하는 전면 카메라, 상기 사용자의 후면을 촬영하는 후면 카메라, 및 상기 사용자의좌측면 또는 우측면을 촬영하는 측면 카메라를 포함하는,인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법.공개특허 10-2023-0114225-3-청구항 5 제 1항에 있어서, 상기 사용자의 복수의 관절에 대한 복수의 각도는,좌측 어깨 관절 각도, 우측 어깨 관절 각도, 좌측 무릎 관절 각도, 우측 무릎 관절 각도, 좌측 팔꿈치 관절 각도, 우측 팔꿈치 관절 각도, 좌측 발목 관절 각도, 우측 발목 관절 각도, 좌측 옆구리 관절 각도, 우측 옆구리관절 각도, 좌측 손목 관절 각도, 우측 손목 관절 각도, 및 목 관절 각도를 포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서, 상기 피드백 정보는,상기 획득된 복수의 각도와 표준 각도와의 차이에 기초한 보정 각도 정보를 포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서, 상기 피드백 정보는,상기 획득된 복수의 각도에 기초한 사용자의 운동 동작 수행의 횟수 정보를 포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자에게 운동 동작을 포함한 운동 컨텐츠를 제공하는 디스플레이부; 및서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 상기 사용자가 수행하는 운동 동작이 촬영된동작별 영상프레임을 각각 수신하고, 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각으로부터제1 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표를 획득하며, 상기 획득된사용자의 복수의 관절에 대한 복수의 키포인트의 좌표로부터 제2 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 각도를 획득하고, 상기 획득된 복수의 각도를 기초로 상기 사용자의 운동 동작 수행과 관련된피드백 정보를 상기 디스플레이를 통해 제공하는 제어부;를 포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 장치."}
{"patent_id": "10-2023-0009340", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "서로 다른 위치 또는 각도로 설치된 복수의 카메라; 및사용자에게 운동 동작을 포함한 운동 컨텐츠를 디스플레이부를 통해 제공하고, 상기 복수의 카메라 각각으로부터 상기 사용자가 수행하는 운동 동작이 촬영된 동작별 영상프레임을 각각 수신하고, 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각으로부터 제1 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표를 획득하며, 상기 획득된 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표로부터 제2 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 각도를 획득하고, 상기 획득된 복수의 각도를기초로 상기 사용자의 운동 동작 수행과 관련된 피드백 정보를 상기 디스플레이를 통해 제공하는 제어 장치;를공개특허 10-2023-0114225-4-포함하는, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 시스템."}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법은 (a) 디스플레이부를 통 해 사용자에게 운동 동작을 포함한 운동 컨텐츠를 제공하는 단계; (b) 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 상기 사용자가 수행하는 운동 동작이 촬영 (뒷면에 계속)"}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법, 제어 장치, 및 시스템에 관 한 것으로, 보다 구체적으로 다중 카메라를 이용해 획득한 사용자의 운동 동작 정보를 인공지능기반의 모델들을 이용해 보다 정확한 분석 결과를 획득하고, 이를 기초로 사용자의 동작 교정이 보다 정밀하게 이루어질 수 있도 록 하기 위한, 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법, 제어 장치, 및 시스템 에 관한 것이다."}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래의 동작 감지 시스템의 경우, 마커를 이용하는 것이 일반적이었다. 즉, 마커를 사용자가 신체 관절에 장착 하고 동작을 감지하도록 함으로써, 사용자의 불편이 초래되었다. 또한, 다중 카메라 이용시 TOF 센서, RGB-D(깊 이 센서), 적외선 센서 등의 추가적인 고가의 센서 장비를 이용하여 복잡한 산술식을 통한 계산이나 처리 과정 을 통해서만 키포인트로부터 각도를 산출할 수 있어 보다 불편하고 처리 속도가 지연되는 문제가 있어 왔다. 선행기술문헌 특허문헌 (특허문헌 0001) 10-2016-0133240"}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 도출된 것으로, 다중 카메라만을 이용하여 다각도에서 촬영된 영상프 레임만을 기초로 사용자의 동작을 분석하도록 하면서도, TOF 센서, RGB-D(깊이 센서), 적외선 센서 등의 추가적 인 별도의 고가 장비를 이용하지 않도록 하고, 또한 종래의 키포인트 사이의 사이각을 계산하는 복잡한 산술식 을 별도로 고안하거나 이를 기초로 동작하도록 하지 않도록 하여 보다 간단한 플랫폼을 제공하면서도, 플랫폼 상에서 인공지능 기반의 모델들을 이용하도록 하여 보다 빠르고 정밀한 동작 분석 결과를 획득하고자 하는 데에 그 목적이 있다."}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 방법은 (a) 디스플레이부를 통해 사용자에게 운동 동작을 포함한 운동 컨텐츠를 제공하는 단계; (b) 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 상기 사용자가 수행하는 운동 동작이 촬영 된 동작별 영상프레임을 각각 수신하는 단계; (c) 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각으로부터 제1 인공지능모델을 통해 상기 사 용자의 복수의 관절에 대한 복수의 키포인트의 좌표를 획득하는 단계; (d) 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표로부터 제2 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 각도를 획득하는 단계; 및 (e) 상기 획득된 복수의 각도를 기초로 상기 사용자의 운동 동작 수행과 관련된 피드백 정보를 상기 디스플레이 부를 통해 제공하는 단계;를 포함할 수 있다. 상기 (a) 이전에, 학습용 영상프레임에 기초해 학습된 상기 제1 인공지능모델을 생성하는 단계; 및 상기 복수의 관절에 대한 복수의 학습용 키포인트의 좌표값에 기초해 학습된 상기 제2 인공지능모델을 생성하는 단계;를 더 포함할 수 있다. 상기 제1 인공지능모델은 CNN 기반의 모델이고, 상기 제2 인공지능모델은 DNN 기반의 모델일 수 있다. 상기 복수의 카메라는, 상기 사용자의 정면을 촬영하는 전면 카메라, 상기 사용자의 후면을 촬영하는 후면 카메라, 및 상기 사용자의 좌측면 또는 우측면을 촬영하는 측면 카메라를 포함할 수 있다. 상기 사용자의 복수의 관절에 대한 복수의 각도는, 좌측 어깨 관절 각도, 우측 어깨 관절 각도, 좌측 무릎 관절 각도, 우측 무릎 관절 각도, 좌측 팔꿈치 관절 각 도, 우측 팔꿈치 관절 각도, 좌측 발목 관절 각도, 우측 발목 관절 각도, 좌측 옆구리 관절 각도, 우측 옆구리 관절 각도, 좌측 손목 관절 각도, 우측 손목 관절 각도, 및 목 관절 각도를 포함할 수 있다. 상기 피드백 정보는, 상기 획득된 복수의 각도와 표준 각도와의 차이에 기초한 보정 각도 정보를 포함할 수 있다. 상기 피드백 정보는, 상기 획득된 복수의 각도에 기초한 사용자의 운동 동작 수행의 횟수 정보를 포함할 수 있다. 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 장치는, 사용자에게 운 동 동작을 포함한 운동 컨텐츠를 제공하는 디스플레이부; 및 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 상기 사용자가 수행하는 운동 동작이 촬영된 동작별 영상프레임을 각각 수신하고, 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각으로부터 제1 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표를 획득하며, 상기 획득된 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표로부터 제2 인공지능모델을 통해 상기 사용자의 복수의 관 절에 대한 복수의 각도를 획득하고, 상기 획득된 복수의 각도를 기초로 상기 사용자의 운동 동작 수행과 관련된 피드백 정보를 상기 디스플레이를 통해 제공하는 제어부;를 포함할 수 있다. 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 시스템은 서로 다른 위 치 또는 각도로 설치된 복수의 카메라; 및 사용자에게 운동 동작을 포함한 운동 컨텐츠를 디스플레이부를 통해 제공하고, 상기 복수의 카메라 각각으로부 터 상기 사용자가 수행하는 운동 동작이 촬영된 동작별 영상프레임을 각각 수신하고, 상기 복수의 카메라 각각 으로부터 수신한 상기 영상프레임 각각으로부터 제1 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복 수의 키포인트의 좌표를 획득하며, 상기 획득된 사용자의 복수의 관절에 대한 복수의 키포인트의 좌표로부터 제 2 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 각도를 획득하고, 상기 획득된 복수의 각도를 기초로 상기 사용자의 운동 동작 수행과 관련된 피드백 정보를 상기 디스플레이를 통해 제공하는 제어 장치;를 포함할 수 있다."}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 별도의 인공지능모델을 통해 복수의 키포인트의 3D 좌표값만 입력을 해도 사용자의 복수의 관절에 대한 각도, 즉 사용자의 신체를 구성하는 전체 관절에 대한 모든 각도값을 한번에 동시에 산출하도록 함으로써, 종래와 같은 복잡한 계산이나 처리 과정이 없어도 모든 각도값을 용이하게 산출할 수 있다. 또한, 본 발명에 따르면, 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 수신한 영상프레임으 로부터 복수의 키포인트의 3D좌표를 획득하고, 이를 기초로 각도를 산출하도록 함으로써, 보다 높은 정확도의 각도값을 산출할 수 있게 된다."}
{"patent_id": "10-2023-0009340", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이들 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조 및 특성은 일 실시예에 관련하여 본 발명의 정신 및 범위를 벗어나지 않으면서 다른 실시 예로 구현될 수 있다. 또한, 각각의 개시된 실시예 내의 개별 구성요소의 위치 또는 배치는 본 발명의 정신 및 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미 로서 취하려는 것이 아니며, 본 발명의 범위는, 적절하게 설명된다면, 그 청구항들이 주장하는 것과 균등한 모 든 범위와 더불어 첨부된 청구항에 의해서만 한정된다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하 거나 유사한 기능을 지칭한다. 참고로, 본 발명의 각 순서도에 있어서, 각 단계는 일예이며, 각 순서를 다르게 변경 및/또는 조합한 경우에도 본 발명이 동일/유사하게 적용될 수 있다. 도 1은 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 시스템의 시 스템도이다. 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 시스템은 인공지능에 기반한 사용자 의 운동 수행과 관련된 피드백 정보 제공 제어 장치(10, 이하 제어 장치로 약칭한다) 및 카메라와의 데이터 송수신으로 구성될 수 있다. 실시예에 따른 제어 장치는 제어부, 디스플레이부, 및 저장부를 포함할 수 있다. 제어부는 제어 장치의 전반적인 동작을 제어할 수 있다. 제어부는 카메라로부터 수신한 운동 동작이 촬영된 동작별 영상데이터를 기초로 이를 분석하여 분석 결 과를 디스플레이부를 통해 출력할 수 있다. 디스플레이부는 제어부의 처리 결과를 출력하여 사용자에게 제공할 수 있고, 특히, 사용자에게 운동 동 작을 포함한 운동 컨텐츠를 디스플레이부의 화면을 통해 제공할 수 있다. 실시예에 따라, 디스플레이부는 사용자 인터페이스부의 기능을 포함하여, 디스플레이부의 화면을 통해 사용자 입력을 수신할 수 있다. 저장부는 제어 장치의 동작에 필요한 각종 프로그램 및 데이터 등을 저장할 수 있다. 저장부는 제1 인공지능모델, 제2 인공지능모델, 및 운동동작DB를 포함할 수 있다. 제1 인공지능모델 및 제2 인공지능모델은 신경망(Neural Network)모델에 대한 학습을 통해 획득된, 인공지능에 기반한 모델일 수 있다. 구체적으로, 제1 인공지능모델 및 제2 인공지능모델 은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 가지는 복수의 네트워크 노드들을 포함할 수 있다. 복수의 네트워크 노드들은 뉴런이 시냅스(synapse)를 통하여 신호를 주고 받는 뉴런의 시냅팁 (synaptic) 활동을 모의하도록 각각 연결 관계를 형성할 수 있다. 또한, 제1 인공지능모델 및 제2 인공지능모델 은 일 예로, 신경망 모델, 또는 신경망 모델에서 발전 한 딥러닝(deep-learning) 모델에 대한 학습에 기초해 획득된 모델일 수 있다. 딥러닝 모델에서 복수의 네트워 크 노드들은 서로 다른 깊이(또는, 레이어)에 위치하면서 컨볼루션(convolution) 연결 관계에 따라 데이터를 주 고 받을 수 있다. 신경망 모델은 복수의 신경망 레이어들을 포함할 수도 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행할 수 있다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 신경망 모 델의 학습 결과에 의해 최적화될 수 있다. 예를 들어, 학습 과정 동안 신경망 모델 모델에서 획득한 로스(los s)값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 학습된 신경망 모델 의 예에는 DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network), CNN(Convolution Neural Network)등이 있을 수 있으나 본 발명은 이에 한정되지 않는다. 실시예에 따라, 제어부는 학습용 영상프레임에 기초해 학습된 상기 제1 인공지능모델을 생성하여 저장 부에 저장할 수 있다. 실시예에 따라, 제1 인공지능모델은 사용자가 수행하는 운동 동작에 대한 학습용 영상프레임을 CNN과 같은 신경망 모델에 입력시키는 학습을 통해 획득된, 인공지능에 기반한 모델일 수 있다. 실시예에 따라, 상기 제1 인공지능모델은 CNN(Convolutional Neural Network) 기반의 모델일 수 있으나, 이에 한정되는 것은 아니며 영상에서 특징을 추출하기 위한 다양한 인공 신경망 모델이 사용될 수 있다. 실시예에 따라, 제1 인공지능모델은 입력 RGB이미지를 컨볼루션 뉴럴 네트워크를 통해 공급하여 키포인트 의 3D 좌표값을 획득하도록 학습된 모델일 수 있다. 실시예에 따라, 제1 인공지능모델은 하나 이상의 합성곱 층(Convolutional Layer) 및 하나 이상의 풀링 층 (Pooling Layer)를 포함할 수 있다. 합성곱 층은 입력되는 영상프레임에서 기 설정된 크기(예를 들어, 3×3 픽 셀 크기)의 필터를 일정 간격으로 이동시키면서 해당 필터에 대응되는 픽셀들의 특징값을 추출할 수 있다. 풀링 층은 합성곱 층의 출력을 입력으로 받아 다운 샘플링(Down Sampling)을 수행할 수 있다. 실시예에 따라, 제어부는 복수의 관절에 대한 복수의 학습용 키포인트의 3D좌표값에 기초해 학습된 상기 제 2 인공지능모델을 생성해 저장부에 저장할 수 있다. 실시예에 따라, 상기 제2 인공지능모델은 입력층(input layer)과 출력층(output layer) 사이에 여러 개의 은닉층(hidden layer)들로 이뤄진 DNN(Deep Neural Network) 기반의 모델일 수 있다. 실시예에 따라, 제어부는 복수의 관절에 대한 복수의 학습용 키포인트의 3D좌표값을 DNN과 같은 신경망 모 델에 입력하여, DNN을 통해 복수의 관절에 대한 복수의 학습용 각도를 출력하도록 반복 학습함으로써, 상기 제2 인공지능모델을 생성할 수 있다 예를 들어, 도 6(실험용 데이터셋임)을 참조하면, 전면영상프레임에 대응되는 복수의 관절에 대한 복수의 학습 용 키포인트의 3D좌표값 (33*3=99개), 후면영상프레임에 대응되는 복수의 관절에 대한 복수의 학습용 키포인트 의 3D좌표값 (33*3=99개), 및 측면영상프레임에 대응되는 복수의 관절에 대한 복수의 학습용 키포인트의 3D좌표 값 (33*3=99개)이 연결된 297개의 좌표값이 학습을 위한 데이터셋으로 준비되고, 상기 데이터셋에 13개의 관절 각도값이 레이블링된 것을 알 수 있다. 즉, 297개의 좌표값 데이터셋 전체가 함께 입력값으로 신경망 모델에 입 력되어, 13개의 관절 각도값 전체가 함께 출력값으로 출력되는 구조이다. 또한, 도 5를 참조하면, 상기 데이터셋이 DNN을 이용한 학습을 통해 획득된 제2 인공지능모델로부터 추론 을 통해 13개 관절의 각도값이 출력되는 것을 예시한다. 운동동작DB에는 운동 동작들을 포함한 운동 컨텐츠, 및 동작별 관절 종류와 각도가 미리 프로그래밍되어 저장될 수 있다. 그리고, 시간의 흐름에 따라 운동 컨텐츠가 디스플레이부를 통해 재생되어 사용자가 해당 운동 컨텐츠를 따라함으로써, 사용자의 운동 동작이 제어부에 의해 인식되어 획득된 관절의 각도 정보와 운 동동작DB에 있는 동작별 관절의 종류와 각도가 비교되어 피드백 정보가 생성 및 제공될 수 있다. 카메라부는 디스플레이부에 출력된 특정 운동 동작을 따라서 수행하는 사용자를 촬영한 영상을 획득할 수 있다.실시예에 따른 카메라는 서로 다른 위치 또는 각도로 설치되고, 복수 개로 구현될 수 있다. 예를 들어, 사 용자의 정면을 촬영하는 전면 카메라, 사용자의 후면을 촬영하는 후면 카메라, 및 사용자의 좌측면 또 는 우측면을 촬영하는 측면 카메라를 포함할 수 있다. 실시예에 따라, 후면 카메라는 사용자의 후면을 촬영하여 피사체(P)의 관상면(Coronal plane)의 방향에 대한 자세를 캡쳐할 수 있다. 그리고, 측면 카메라 는 사용자의 좌측면 또는 우측면을 촬영하여 시상면(Sagittal plane)의 방향에 대한 자세를 캡쳐할 수 있다. 본 발명에 따르면, 관상면, 시상면 등의 다방향으로 카메라를 장착하여 사용자의 전, 후, 좌, 우 등 각 방향의 자세를 캡쳐할 수 있고, 이를 기초로 사용자의 자세를 정밀하게 분석할 수 있다. 다만, 이는 실시예이며, 보다 많은 종류의 다양한 각도에서 촬영된 카메라를 이용하는 경우에도 본 발명이 동일 /유사하게 적용될 수 있다. 도 2 및 도 3은 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 장치 의 동작을 설명하기 위한 순서도이고, 도 4 내지 도 6은 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 장치의 동작을 설명하기 위해 참조되는 도면이다. 도 2 및 도 3을 참조하면, 실시예에 따라, 제어부는 디스플레이부를 통해 사용자에게 운동 동작을 포함 한 운동 컨텐츠를 제공할 수 있다(s21). 실시예에 따라, 앱이 구동되거나, 웹프로그램이 구동되어 사용자가 웹페이지에 접속하면, 제어부는 운동 컨 텐츠를 영상 및/또는 텍스트로 디스플레이부의 화면을 통해 출력할 수 있다. 실시예에 따라, 제어부는 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 상기 사용자 가 수행하는 운동 동작이 촬영된 동작별 영상프레임을 각각 수신할 수 있다(s22). 실시예에 따라, 제어부는 전면 카메라로부터 사용자의 운동 동작의 정면이 촬영된 전면영상프레임을 수 신하고, 후면 카메라로부터 사용자의 운동 동작의 후면이 촬영된 후면영상프레임을 수신하며, 측면 카메라 로부터 사용자의 운동 동작의 측면이 촬영된 측면영상프레임을 수신할 수 있다. 실시예에 따라, 제어부는 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각으로부터 제1 인공지능모델을 통해 상기 사용자의 복수의 관절에 대한 복수의 키포인트의 3D좌표를 획득할 수 있다 (s23). 실시예에 따라, 제어부는 학습용 영상프레임을 기초로 한 학습을 통해 제1 인공지능모델을 생성하여, 해당 제1 인공지능모델을 통해 사용자의 복수의 키포인트의 3D좌표를 획득할 수 있다. 실시예에 따라, 제어부는 전면영상프레임으로부터 상기 제1 인공지능모델을 통해 상기 복수의 관절에 대한 복수의 키포인트의 3D 좌표를 획득하고, 후면영상프레임으로부터 상기 제1 인공지능모델을 통해 상기 복수의 관절에 대한 복수의 키포인트의 3D 좌표를 획득하며, 측면영상프레임으로부터 상기 제1 인공지능모델 을 통해 복수의 관절에 대한 복수의 키포인트의 3D 좌표를 획득할 수 있다. 예를 들어, 도 4와 같이, 제어부는 각 영상프레임으로부터 사용자의 관절에 대한 33개의 키포인트의 3D 좌 표(xyz 3개의 좌표)를 각각 획득할 수 있다. 실시예에 따라, 키포인트는 코, 좌측 눈(중앙/내측/외측), 우측 눈 (중앙/내측/외측), 좌측 귀, 우측 귀, 좌측 입, 우측 입, 좌측 어깨, 우측 어깨, 좌측 팔꿈치, 우측 팔꿈치, 좌 측 손목, 우측 손목, 좌측 새끼 손가락, 우측 새끼 손가락, 좌측 검지 손가락, 우측 검지 손가락, 좌측 엄지 손 가락, 우측 엄지 손가락, 좌측 둔부, 우측 둔부, 좌측 무릎, 우측 무릎, 좌측 발목, 우측 발목, 좌측 뒤꿈치, 우측 뒤꿈치, 좌측 발가락, 및 우측 발가락을 포함할 수 있다. 실시예에 따라, 제어부는 상기 복수의 카메라 각각으로부터 수신한 상기 영상프레임 각각의 타임스탬프 의 차이값이 소정의 범위 내(예> 0.05ms 미만) 에서 서로 유사한 것으로 판단한 경우, 상기 영상프레임 각각이 서로 동기화된 것으로 간주하여 함께 상기 제1 인공지능모델에 입력시킬 수 있다. 본 발명의 경우, 이에 따라, 복수의 카메라를 사용하는 경우에 각각의 카메라의 내부 프로세서 혹은 카메라를 연결시키는 호스트 프로세스(예> 제어부)에 의해 프레임이 균등하게 발생되지 못하는 상황을 막을 수 있게 된다. 즉, 각 카메라별로 생성된 시간의 오차가 클 경우에, 제1 인공지능모델에 입력으로 넣게 되면 정확 하지 않은 관절 각도가 예측될 수 있으나, 본 발명에 따르면 상기와 같은 동기화 과정에 따라 프레임간 균등성 을 유지할 수 있게 된다. 실시예에 따라, 제어부는 상기 획득된 복수의 관절에 대한 복수의 키포인트의 3D좌표로부터 제2 인공지능모 델을 통해 상기 사용자의 복수의 관절에 대한 각도를 획득할 수 있다(s24). 실시예에 따라, 제어부는 복수의 학습용 키포인트의 3D좌표값을 기초로 한 학습을 통해 제2 인공지능모델 을 생성하여, 해당 제2 인공지능모델을 통해 사용자의 복수의 관절에 대한 각도를 획득할 수 있다. 실시예에 따라, 제어부는 전면영상프레임으로부터 획득한 복수의 관절에 대한 복수의 키포인트의 3D 좌표값, 후면영상프레임으로부터 획득한 상기 복수의 관절에 대한 복수의 키포인트의 3D 좌표값, 및 측면영상프 레임으로부터 획득한 상기 복수의 관절에 대한 복수의 키포인트의 3D 좌표값이 각각 서로 결합(또는 연결)된 키 포인트 집합을 제2 인공지능모델을 통해 입력하고, 제2 인공지능모델을 통해 사용자의 복수의 관절에 대한 각도를 획득할 수 있다. 실시예에 따라, 상기 사용자의 복수의 관절에 대한 복수의 각도는, 좌측 어깨 관절 각도, 우측 어깨 관절 각도, 좌측 무릎 관절 각도, 우측 무릎 관절 각도, 좌측 팔꿈치 관절 각도, 우측 팔꿈치 관절 각도, 좌측 발목 관절 각도, 우측 발목 관절 각도, 좌측 옆구리 관절 각도, 우측 옆구리 관절 각도, 좌측 손목 관절 각도, 우측 손목 관절 각도, 및 목 관절 각도를 포함할 수 있다. 본 발명에 따르면, 이와 같이 별도의 인공지능모델을 통해 복수의 키포인트의 3D 좌표값만 입력을 해도 사용자 의 복수의 관절에 대한 각도, 즉 사용자의 신체를 구성하는 전체 관절에 대한 모든 각도값을 한번에 동시에 산 출하도록 함으로써, 종래와 같은 복잡한 계산이나 처리 과정이 없어도 모든 각도값을 용이하게 산출할 수 있다. 즉, 종래의 경우, 다중 카메라 이용시 TOF 센서, RGB-D(깊이 센서), 적외선 센서 등의 추가적인 고가의 센서 장 비를 이용하여 복잡한 산술식을 통한 계산이나 처리 과정을 통해서만 키포인트로부터 각도를 산출할 수 있었으 나, 본 발명에 따르면, 별도의 추가 센서 없이도, 딥러닝에 기반한 인공지능모델을 통해 복수의 키포인트의 3D 좌표값을 입력만 해도 사용자의 신체를 구성하는 전체 관절에 대한 모든 각도값을 한번에 산출할 수 있게 되어 보다 빠르고 간단하며, 더 높은 정확도의 각도값을 산출할 수 있게 된다. 즉, 종래의 관절에 대한 각도값 산출 은 키포인트들이 서로 이루는 사이각에 기초한 반면, 본 발명의 경우, 키포인트들 사이의 사이각을 별도로 계산 하지 않고 키포인트 자체 만으로 관절의 각도를 바로 추출할 수 있게 되어 처리가 간단하면서도 보다 빨라질 수 있게 된다. 또한, 본 발명에 따르면, 서로 다른 위치 또는 각도로 설치된 복수의 카메라 각각으로부터 수신한 영상프레임으 로부터 복수의 키포인트의 3D좌표를 획득하고, 이를 기초로 각도를 산출하도록 함으로써, 보다 높은 정확도의 각도값을 산출할 수 있게 된다. 즉, 다양한 각도에서 촬영된 영상프레임으로부터 획득된 동일 측정 위치의 3D좌 표값이 반영되어 동일 측정 위치에 대한 각도를 산출하게 되므로, 보다 높은 정확도의 각도값을 산출할 수 있게 되는 것이다. 실시예에 따라, 제어부는 상기 획득된 복수의 각도를 기초로 상기 사용자의 운동 동작 수행과 관련된 피드 백 정보를 상기 디스플레이부를 통해 제공할 수 있다(s25). 실시예에 따른 상기 피드백 정보는 텍스트, 음성, 및/또는 이미지의 형태로 제공될 수 있다. 실시예에 따라, 제어부는 획득된 복수의 각도와 운동동작DB에 있는 동작별 표준 각도와의 차이에 기초 한 보정 각도 정보를 제공할 수 있다. 예를 들어, 제어부는 랫 풀 다운 운동 중에 대해 운동동작DB에 저장된 최대 수축 지점에서의 올바른 자세의 각도가 90도인데, 사용자가 취한 자세의 각도가 110도인 경우,\" 20도의 차이가 발생하므로 20도만큼 더 내려주세요\"의 정보를 출력할 수 있다. 본 발명에 따르면, 단순히 표준정보와 차이가 난다는 것 이외에도, 보다 정밀한 각도 정보까지 제공하도록 함으 로써, 사용자가 이를 참고해 보다 정밀하게 동작 교정을 할 수 있게 된다. 특히, 신체 관절의 모든 각도 각각의 차이값을 제공하도록 함으로써, 사용자가 차이값을 기초로 신체 관절 마다 상이하게 동작 교정을 할 수 있게 되 어 보다 정밀도가 높아지게 된다. 예를 들어, \"우측 어깨 관절은 20도만큼 더 내려주시되, 좌측 어깨 관절은 20 도만큼 더 올려주세요\" 라는 정보로 동작 교정의 정밀도가 보다 높아질 수 있게 되는 것이다. 더불어, 운동 동작이 복수 개인 경우, 상이한 운동 동작마다 신체 관절별 상이한 동작 교정이 이루어질 수 있게 되어 또한 모든 운동 동작에 대한 교정의 정밀도가 높아질 수 있게 된다. 실시예에 따라, 제어부는 획득된 복수의 각도를 기초로 한 사용자의 운동 동작 수행의 횟수 정보를 제공할 수 있다.실시예에 따라, 제어부는 운동동작DB에 있는 동작별 표준 관절의 종류 및 표준 각도를 참조해, 획득된 복수의 각도 중, 해당 동작에서 요구되는 관절의 종류 및 관절의 각도와, 동작별 표준 각도와의 차이가 소정의 임계치 내인 경우 해당 동작을 정상 동작으로 판별하여 횟수로 카운트하지만, 소정의 임계치를 벗어난 것으로 판단한 경우 해당 동작을 비정상 동작으로 판별하여 횟수로 카운트하지 않을 수 있으며, 정상 동작으로 판별한 동작 횟수를 합산하여 운동 동작 수행의 횟수 정보로 제공할 수 있다. 실시예에 따라, 제어부는 사용자의 운동 동작 수행의 횟수 정보를 참조해 보정 횟수 정보를 제공할 수 있다. 즉, 비정상 동작으로 판별하여 횟수로 카운트되지 않은 동작의 횟수를 보정 횟수 정보로 산출해 제공할 수 있다. 본 발명에 따르면, 단순히 표준정보와 차이가 난다는 것 이외에도, 보다 정밀한 운동 동작 수행의 횟수 정보 및 보정 횟수 정보까지 제공하도록 함으로써, 사용자가 이를 참고해 추후 운동 동작을 교정하는데 참고할 수 있도 록 함으로써, 보다 정밀한 운동 동작의 교정이 이루어질 수 있게 된다. 이상 설명된 실시 형태는 다양한 컴퓨터 구성요소를 통하여 실행될 수 있는 프로그램 명령어의 형태로 구현되어 컴퓨터로 판독가능한 기록매체에 기록될 수 있다. 상기 컴퓨터로 판독가능한 기록매체는 프로그램 명령어, 데이 터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터로 판독가능한 기록매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터로 판독가능한 기록매체의 예에는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD- ROM, DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 ROM, RAM, 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨 어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니 라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 상기 하드웨어 장치 는 본 발명에 따른 처리를 실행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 본 명세서의 양상들은 전체적으로 하드웨어, 전체적으로 소프트웨어 (펌웨어, 상주 소프트웨어, 마이크로 코드 등을 포함 함) 또는 컴퓨터 판독 가능 프로그램 코드가 구현 된 하나 이상의 컴퓨터 판독 가능 매체에 구현 된 컴퓨터 프로그램 제품의 형태를 취할 수 있다. 이상에서 실시예들에 설명된 특징, 구조, 효과 등은 본 발명의 하나의 실시예에 포함되며, 반드시 하나의 실시 예에만 한정되는 것은 아니다. 나아가, 각 실시예에서 예시된 특징, 구조, 효과 등은 실시예들이 속하는 분야의 통상의 지식을 가지는 자에 의해 다른 실시예들에 대해서도 조합 또는 변형되어 실시 가능하다. 따라서 이러한 조합과 변형에 관계된 내용들은 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다. 또한, 이상에서 실시예를 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발 명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성을 벗어나지 않는 범위에서 이상에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 예를 들어, 실시예에 구체적으로 나타 난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부된 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0009340", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 시스템의 시 스템도이다, 도 2 및 도 3은 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 장치 의 동작을 설명하기 위한 순서도이고, 도 4 내지 도 6은 실시예에 따른 인공지능에 기반한 사용자의 운동 수행과 관련된 피드백 정보 제공 제어 장치의 동작을 설명하기 위해 참조되는 도면이다."}
