{"patent_id": "10-2017-0080644", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0001132", "출원번호": "10-2017-0080644", "발명의 명칭": "인공지능 공기조화기 및 그 제어방법", "출원인": "엘지전자 주식회사", "발명자": "신영주"}}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "냉매사이클을 형성하는 압축기;사용자에 의해 입력설정온도가 입력되는 입력부;사용자에 따른 감성레벨이 저장되는 메모리부; 및실내온도가 상기 입력설정온도에 상기 감성레벨을 더한 감성설정온도에 도달되도록 상기 압축기를 구동시키는제어부;가 포함되고,상기 입력설정온도는 소정의 단위를 갖는 온도수치이고,상기 감성레벨은 소정의 단위를 갖는 온도가감수치이며,상기 감성레벨의 단위는 상기 입력설정온도의 단위보다 적은 단위로 마련되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 감성레벨은 서로 다른 온도가감수치를 갖는 복수의 단계로 마련되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 온도가감수치의 절대값은 상기 입력설정온도의 단위보다 작은 값으로 마련되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 감성레벨에는, (+) 온도가감수치를 갖는 복수의 단계와 0의 온도가감수치를 갖는 단계 및 (-) 온도가감수치를 갖는 복수의 단계가 포함되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 입력설정온도의 단위는 1도이고,상기 감성레벨의 단위는 0.2도인 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 감성레벨에는,+0.8의 온도가감수치를 갖는 4단계;+0.6의 온도가감수치를 갖는 3단계;+0.4의 온도가감수치를 갖는 2단계;+0.2의 온도가감수치를 갖는 1단계;0의 온도가감수치를 갖는 0단계; 공개특허 10-2019-0001132-3--0.2의 온도가감수치를 갖는 -1단계;-0.4의 온도가감수치를 갖는 -2단계;-0.6의 온도가감수치를 갖는 -3단계; 및 -0.8의 온도가감수치를 갖는 -4단계;가 포함되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 감성레벨은, 실내온도가 상기 감성설정온도에 도달된 후 상기 입력설정온도가 변경된 경우, 변경된 수치에따라 다르게 설정되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "입력부에서 입력설정온도가 입력되고,상기 입력설정온도에 메모리부에 저장된 감성레벨을 더하여 감성설정온도를 계산하고,실내온도가 상기 감성설정온도에 도달되도록 구동하고,실내온도가 상기 감성설정온도에 도달된 후 상기 입력설정온도가 변경된 경우, 상기 메모리부에 변경된 수치를반영하여 상기 감성레벨을 다시 저장하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 감성레벨은 소정의 단위를 갖는 온도가감수치로 구비되며,실내온도가 상기 감성설정온도에 도달된 후 상기 입력설정온도가 높아진 경우, 상기 감성레벨은 더 큰 값을 갖도록 재설정되고,실내온도가 상기 감성설정온도에 도달된 후 상기 입력설정온도가 낮아진 경우, 상기 감성레벨은 더 작은 값을갖도록 재설정되는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 입력설정온도는 소정의 단위를 갖는 온도수치로 구비되며,상기 감성레벨의 단위는 상기 입력설정온도의 단위보다 적은 단위로 마련되는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서,초기상태에서 상기 감성레벨은 0으로 설정되는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 감성레벨은, 실내온도가 상기 감성설정온도에 도달된 후, 상기 입력설정온도가 변경된 경우에만 변화되는것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0080644", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 8 항에 있어서,상기 메모리부에는 사용자에 따라 서로 다른 감성레벨이 저장되는 것을 특징으로 하는 공기조화기.공개특허 10-2019-0001132-4-"}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 공기조화기 및 그 제어방법에 관한 것이다. 본 발명의 사상에 따른 공기조화기에는 냉매사이클을 형성 하는 압축기, 사용자에 의해 입력설정온도가 입력되는 입력부, 사용자에 따른 감성레벨이 저장되는 메모리부 및 실내온도가 상기 입력설정온도에 상기 감성레벨을 더한 감성설정온도에 도달되도록 상기 압축기를 구동시키는 제 어부가 포함되고, 상기 입력설정온도는 소정의 단위를 갖는 온도수치이고, 상기 감성레벨은 소정의 단위를 갖는 온도가감수치이며, 상기 감성레벨의 단위는 상기 입력설정온도의 단위보다 적은 단위로 마련된다."}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공기조화기 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "공기조화기는 소정공간의 공기를 용도, 목적에 따라 가장 적합한 상태로 유지하기 위한 기기이다. 일반적으로, 상기 공기조화기에는, 압축기, 응축기, 팽창장치 및 증발기가 포함되며, 냉매의 압축, 응축, 팽창 및 증발과정 을 수행하는 냉매사이클이 구동되어, 상기 소정공간을 냉방 또는 난방할 수 있다. 이때, 상기 소정공간은 상기 공기조화기가 사용되는 장소에 따라, 다양하게 제안될 수 있다. 예를 들어, 상기 공기조화기가 가정이나 사무실에 배치되는 경우, 상기 소정공간은 집 또는 건물의 실내 공간일 수 있다. 또한, 상기 공기조화기가 자동차에 배치되는 경우, 상기 소정공간은 사람이 탑승하는 탑승 공간일 수 있다. 상기 공기조화기에는, 상기 응축기 또는 상기 증발기로 기능하는 실내 열교환기와 실외 열교환기가 포함된다. 상기 실내 열교환기는 상기 소정공간에 배치되는 실내기에 설치되며, 상기 실외 열교환기는 상기 소정공간의 외 부에 배치되는 실외기에 설치된다. 상기 공기조화기는 사용자로부터 입력된 설정온도까지 상기 소정공간을 냉방또는 난방하도록 운전된다. 그에 따 라, 공기조화기는 상기 소정공간의 공기를 사용자가 필요로 하는 온도로 조화시킬 수 있다. 그러나, 사용자에 따라 상기 소정공간의 공기가 입력된 설정온도로 조화되었음에도 불구하고 불쾌함을 느끼는 경우가 있다. 이는 사용자마다 느끼는 온도가 상이하기 때문으로 하나의 수치인 설정온도로는 이러한 차이를 구 분할 수 없다는 문제점이 있다."}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 이러한 문제점을 해결하기 위하여 제안된 것으로서, 입력된 설정온도에 사용자에 따른 감성레 벨을 더하여 감성설정온도로 구동되는 공기조화기 및 그 제어방법을 제공하는 것에 있다. 또한, 본 발명은 설정온도의 기본단위보다 세분화된 단위로 구동되는 공기조화기 및 그 제어방법을 제공하는 것 에 있다."}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 사상에 따른 공기조화기에는 냉매사이클을 형성하는 압축기, 사용자에 의해 입력설정온도가 입력되는 입력부, 사용자에 따른 감성레벨이 저장되는 메모리부 및 실내온도가 상기 입력설정온도에 상기 감성레벨을 더 한 감성설정온도에 도달되도록 상기 압축기를 구동시키는 제어부가 포함되고, 상기 입력설정온도는 소정의 단위 를 갖는 온도수치이고, 상기 감성레벨은 소정의 단위를 갖는 온도가감수치이며, 상기 감성레벨의 단위는 상기 입력설정온도의 단위보다 적은 단위로 마련된다. 상기 감성레벨은 서로 다른 온도가감수치를 갖는 복수의 단계로 마련될 수 있다. 상기 온도가감수치의 절대값은 상기 입력설정온도의 단위보다 작은 값으로 마련될 수 있다. 상기 감성레벨에는, (+) 온도가감수치를 갖는 적어도 하나의 단계와 0의 온도가감수치를 갖는 단계 및 (-) 온도 가감수치를 갖는 적어도 하나의 단계가 포함될 수 있다. 상기 입력설정온도의 단위는 1도이고, 상기 감성레벨의 단위는 0.2도일 수 있다. 상기 감성레벨에는, +0.8의 온도가감수치를 갖는 4단계, +0.6의 온도가감수치를 갖는 3단계, +0.4의 온도가감수 치를 갖는 2단계, +0.2의 온도가감수치를 갖는 1단계, 0의 온도가감수치를 갖는 0단계, -0.2의 온도가감수치를 갖는 -1단계, -0.4의 온도가감수치를 갖는 -2단계, -0.6의 온도가감수치를 갖는 -3단계 및 -0.8의 온도가감수치 를 갖는 -4단계가 포함될 수 있다. 상기 감성레벨은, 실내온도가 상기 감성설정온도에 도달된 후 상기 입력설정온도가 변경된 경우, 변경된 수치에 따라 다르게 설정될 수 있다. 또한, 본 발명의 사상에 따른 공기조화기의 제어방법에는, 입력부에서 입력설정온도가 입력되고, 상기 입력설정 온도에 메모리부에 저장된 감성레벨을 더하여 감성설정온도를 계산하고, 실내온도가 상기 감성설정온도에 도달 되도록 구동하고, 실내온도가 상기 감성설정온도에 도달된 후 상기 입력설정온도가 변경된 경우, 상기 메모리부 에 변경된 수치를 반영하여 상기 감성레벨을 다시 저장한다. 상기 감성레벨은 소정의 단위를 갖는 온도가감수치로 구비되며, 실내온도가 상기 감성설정온도에 도달된 후 상 기 입력설정온도가 높아진 경우, 상기 감성레벨은 더 큰 값을 갖도록 재설정되고, 실내온도가 상기 감성설정온 도에 도달된 후 상기 입력설정온도가 낮아진 경우, 상기 감성레벨은 더 작은 값을 갖도록 재설정될 수 있다. 상기 입력설정온도는 소정의 단위를 갖는 온도수치로 구비되며, 상기 감성레벨의 단위는 상기 입력설정온도의 단위보다 적은 단위로 마련될 수 있다. 초기상태에서 상기 감성레벨은 0으로 설정될 수 있다. 상기 감성레벨은, 실내온도가 상기 감성설정온도에 도달된 후, 상기 입력설정온도가 변경된 경우에만 변화될 수 있다. 상기 메모리부에는 사용자에 따라 서로 다른 감성레벨이 저장될 수 있다."}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 의한 공기조화기에서는 아래와 같은 효과를 기대할 수 있다. 사용자에 의해 입력되는 입력설정온도와 사용자에 따라 다르게 저장된 감성레벨을 더한 감성설정온도로 구동되 어 사용자에게 보다 쾌적함을 줄 수 있다는 장점이 있다. 또한, 상기 감성레벨의 단위는 상기 입력설정온도의 단위보다 적게 마련되어, 보다 세분화된 감성설정온도로 구 동된다는 장점이 있다. 또한, 상기 감성레벨은 사용자의 입력에 따라 계속하여 재설정되기 때문에 보다 정확하게 설정될 수 있다는 장 점이 있다. 또한, 사용자의 성향을 미리 파악하여 구동됨에 따라, 부가적인 구동이 줄어 효율적으로 운전될 수 있다는 장점 이 있다. 또한, 사용자에 따라 맞춤설정온도로 구동되기 때문에, 사용자에게 신뢰감 및 편안함을 줄 수 있다는 장점이 있 다."}
{"patent_id": "10-2017-0080644", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여, 본 발명의 구체적인 실시 예를 설명한다. 다만, 본 발명의 사상은 제시되는 실시 예에 제한되지 아니하며, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 실시 예를 용이 하게 제안할 수 있을 것이다. 도 1은 본 발명의 실시 예에 따른 공기조화기를 도시한 사시도이고, 도 2는 도 1의 I-I'를 따라 절개한 단면도 이다. 도 1 및 도 2에 도시된 바와 같이, 본 발명의 실시 예에 따른 공기조화기에는, 실내공간에 설치되는 실내기(1 0)가 포함된다. 또한, 상기 공기조화기에는, 압축기 및 실외 열교환기 등이 구비되며 실외공간에 설치되는 실외기가 구비된다. 도 1 및 도 2에서는, 설명의 편의상 실내공간에 구비되는 실내기만 도시하였다. 상기 실내기에는, 외관을 형성하며 내부에 실내 열교환기 및 송풍팬이 배치되는 케이스 및 상 기 케이스의 전방에 결합되어 상기 실내기의 전면 외관을 형성하는 전면 패널이 포함된다. 상기 케이스는, 분리형 공기조화기의 경우, 실내에 배치되는 실내기 케이스일 수 있으며, 일체형 공기조화 기의 경우, 공기조화기 자체의 케이스일 수 있다. 그리고, 넓은 의미에서, 상기 전면 패널은 상기 케이스 의 일 구성으로서 이해될 수 있다. 상기 케이스에는, 실내공기가 유입되는 흡입구 및 상기 흡입구를 통하여 유입된 공기가 열교환된 후 실내 공간으로 토출되도록 하는 토출구가 포함된다. 상기 흡입구는 상기 케이스의 상부에 적어도 일부분이 개구되어 형성된다. 또한, 상기 흡입구에는 이물의 유입을 방지하기 위한 흡입그릴이 형성될 수 있다. 상기 토출구는 상기 케이스의 하부에서 적어도 일부분이 개구되어 형성될 수 있다. 상기 토출구의 일측에는, 상기 토출구를 개방 또는 폐쇄하기 위하여 이동가능하게 제공되는 토출 베인이 포함된다. 상기 토출 베인이 개방되면, 상기 케이스 내에서 조화된 공기가 실내 공간으로 배출될 수 있다. 예를 들어, 상기 토출 베인은, 상기 토출 베인의 하부가 상방으로 회전하여 개방될 수 있다. 또한, 상기 토 출구에는 토출그릴(미도시)이 구비될 수 있다. 상기 케이스의 내부에는, 상기 흡입구에서 흡입된 공기와 열교환 되는 실내 열교환기가 설치된다. 상기 실내 열교환기는 송풍팬의 흡입 측을 둘러싸도록 배치된다. 상기 송풍팬에는, 원주 방향으로 흡입된 공기를 원주 방향으로 토출시키는 횡류팬이 포함된다. 또한, 상기 송풍팬에는, 고정부재로서의 팬 본체 및 상기 팬 본체의 일 측에 고정되며 원주 방향으로 이격되어 배치되는 복수의 블레이드가 포함된다. 즉, 상기 복수의 블레이드는 원주 방향을 따라 배열된 형태를 갖는다. 상기 케이스의 내부에는, 상기 송풍팬의 외주면 근처에 배치되어 공기의 흐름을 안내하는 유로 가이드 (18, 19)가 설치된다. 상기 유로 가이드(18, 19)에는, 리어 가이드 및 스테빌라이저가 포함된다. 상기 리어 가이드는, 상기 케이스의 후측에서 상기 송풍팬의 흡입 측으로 연장된다. 이러한 상기 리어 가이드는, 상기 송풍팬이 회전될 때 상기 송풍팬 측으로 흡입 공기가 원활하게 안내되도록 한 다. 또한, 상기 리어 가이드는, 상기 송풍팬에 의해 유동하는 공기가 상기 송풍팬에서 박리되는 현 상을 방지할 수 있다. 상기 스테빌라이저는, 상기 송풍팬의 토출 측에 배치된다. 상기 스테빌라이저는, 상기 송풍팬 의 외주면과 이격되도록 설치되어 상기 송풍팬에서 토출된 공기가 상기 실내 열교환기 측으로 역류하는 것을 방지한다. 상기 리어 가이드와 스테빌라이저는, 상기 송풍팬의 길이방향을 따라 연장된다. 상기 실내 열교환기의 하측에는, 공기와 냉매의 열교환 과정에서 발생되는 응축수가 저장될 수 있는 드레인 부가 제공된다. 상기 케이스의 내부에는, 상기 흡입부를 통하여 흡입된 공기 중 이물을 필터링 하기 위한 필터가 제공된다. 상기 필터는 상기 흡입구의 내측에 상기 실내 열교환기를 둘러싸도록 배치된다. 상기 필 터에서 필터링된 공기는 상기 실내 열교환기측으로 유동할 수 있다. 이때, 상기 공기조화기에는, 압축기-응축기-팽창기기-증발기로 구성된 하나의 냉매사이클을 형성한다. 냉매사이클에 관하여 간략하게 설명하자면, 상기 압축기는 저온저압 기체상태의 냉매를 압축하여 고온고압 기체 상태로 토출하고, 상기 응축기는 상기 압축기에서 토출된 고온고압 기체상태의 냉매를 상온고압 액체상태로 응 축시킨다. 또한, 상기 응축기에서 토출된 상온고압 액체상태의 냉매를 저온저압 액체상태의 냉매로 팽창시킨다. 또한, 상기 증발기는 상기 팽창밸브에서 팽창된 저온저압 액체상태의 냉매를 기체상태로 증발시키고, 이러한 저 온저압 기체상태의 냉매가 상기 압축기로 다시 제공됨에 따라 순환된다. 이때, 상기 실내 열교환기는 증발기 또는 응축기로 기능하여, 실내공기와 열교환된다. 자세하게는, 상기 실 내 열교환기가 증발기로 기능하는 경우, 실내공기의 열을 빼앗아 실내공간을 냉방시킨다. 또한, 상기 실내 열교환기가 응축기로 기능하는 경우, 실내공기로 열을 방출하여 실내공간을 난방시킨다.이하에서는 상기 공기조화기가 냉방운전을 하는 경우, 즉, 상기 실내 열교환기가 증발기로 기능하여 실내공 간을 냉방시키는 경우에 대해서만 설명한다. 이는 예시적인 것으로 상기 공기조화기가 난방운전을 하는 경우에 도 동일하게 적용될 수 있다. 도 3은 본 발명의 일 실시 예에 따른 공기조화기의 제어구성을 도시한 도면이다. 도 3에 도시된 바와 같이, 본 발명의 사상에 따른 공기조화기에는, 각 구성을 제어하는 제어부가 포함된다. 상기 제어부는 컨트롤박스의 형태로 상기 케이스의 내부에 배치될 수 있다. 또한, 상기 제 어부는 상기 실외기에 배치되거나, 상기 실외기 및 상기 실내기에 각각 배치될 수 있다. 또한, 상기 공기조화기에는, 전원부, 입력부 및 실내온도센서가 구비된다. 상기 전원부 및 상기 입력부는 사용자가 입력가능한 형태로 마련될 수 있다. 예를 들어, 상기 전원부 및 상기 입력부는 리모컨의 버튼 등으로 구비될 수 있다. 이때, 상기 입력부에는 설정온도를 입력할 수 있도록 구비된다. 즉, 사용자는 원하는 실내공간의 온도를 상기 입력부를 통해 입력할 수 있다. 이하, 사용자가 상기 입력부를 통해 입력한 설정온도를 '입력설 정온도(Ti)'라 한다. 상기 실내온도센서는 상기 케이스의 일 측에 부착되어 설치될 수 있다. 예를 들어, 상기 실내온도센서 는 상기 흡입그릴에 설치되어, 상기 흡입구로 흡입되는 공기의 온도를 감지할 수 있다. 이하, 상 기 실내온도센서를 통해 감지된 온도를 '실내온도(Tp)'라 한다. 공기조화기의 작동에 대하여 설명하면, 사용자가 상기 전원부를 통해 공기조화기의 전원을 ON한다. 상기 제어부는 상기 송풍팬을 가동시켜 실내공기를 순환시킨다. 또한, 사용자는 상기 입력부를 통해 소정의 입력설정온도(Ti)를 입력하고, 상기 실내온도센서에 의해 소정의 실내온도(Tp)가 감지된다. 상기 제어부는 상기 실내온도(Tp)가 상기 입력설정온도(Ti)에 도달되도록 상기 압축기를 구동시킨다. 그에 따라, 냉매가 순환하고, 실내공기와 상기 실내 열교환기가 열교환된다. 따라서, 상기 실내온도센서 에 의해 감지되는 실내온도(Tp)는 변화되며, 어느 시점에서 상기 입력설정온도(Ti)에 도달된다. 이때, 상기 제어부는 상기 압축기를 정지시키고, 상기 송풍팬을 구동시키며 실내온도(Tp)를 상기 입력설정온 도(Ti)로 유지시킬 수 있다. 한편, 실내온도(Tp)가 상기 입력설정온도(Ti)에 도달되었음에도 사용자가 여전히 불쾌함을 느끼는 경우가 있다. 그리고, 사용자는 새로운 입력설정온도(Ti)를 설정하고, 상기 제어부는 실내온도(Tp)가 새로운 입력설정온 도(Ti)에 도달되도록 상기 압축기를 다시 가동시킨다. 이와 같은 과정을 반복하는 경우, 상기 압축기의 ON 또는 OFF가 반복될 수 있다. 이는 상기 압축기의 오작동을 유발할 수 있으며, 불필요한 에너지가 소모될 수 있다. 이를 방지하기 위해, 본 발명의 사상에 따른 공기조화기는 입력설정온도(Ti)에 메모리부에 저장된 감성레벨 (Ts)을 더하여 계산된 감성설정온도(Ti,s)로 제어된다. 즉, 상기 제어부는 실내온도(Tp)가 감성설정온도 (Ti,s)에 도달되도록 상기 압축기를 가동시킨다. 이하, 감성설정온도(Ti,s)에 대하여 자세하게 설명한다. 도 4는 본 발명의 일 실시 예에 따른 공기조화기의 감성설정온도를 도시한 도면이다. 도 4에 도시된 바와 같이, 감성설정온도(Ti,s)는 입력설정온도(Ti)에 감성레벨(Ts)을 더한 값으로 계산된다.(Ti,s = Ti + Ts) 상기 입력설정온도(Ti)은 소정의 단위를 갖는 온도수치로 이해된다. 일반적으로 소정의 단위는 1도에 해당된다. 예를 들어, 상기 입력설정온도(Ti)은 18도일 수 있다. 이는 사용자에 의해 임의로 입력되는 값으로 상황에 따라변화될 수 있다. 상기 감성레벨(Ts)은 소정의 단위를 갖는 온도가감수치로 이해된다. 이때, 상기 감성레벨(Ts)의 단위는 상기 입 력설정온도(Ti)의 단위보다 적은 단위로 마련된다. 예를 들어, 상기 입력설정온도(Ti)의 단위가 1도인 경우, 상 기 감성레벨(Ts)의 단위는 0.1도 또는 0.2도 등 1도보다 적은 수치로 마련된다. 도 4에서는 상기 입력설정온도(Ti)은 1도의 단위를 갖고, 상기 감성레벨(Ts)은 0.2도의 단위를 갖는 것으로 도시 하였다. 이는 예시적인 것으로, 상기 감성레벨(Ts)의 단위가 상기 입력설정온도(Ti)의 단위보다 적은 다양한 경 우가 모두 포함된다. 상기 감성레벨(Ts)은 복수의 단계로 마련될 수 있다. 특히, 상기 감성레벨(Ts)에는, (+) 온도가감수치를 갖는 적 어도 하나의 단계와 0의 온도가감수치를 갖는 단계 및 (-) 온도가감수치를 갖는 적어도 하나의 단계가 포함된다. 예를 들어, 도 4에서는, -4, -3, -2, -1, 0, 1, 2, 3, 4 단계로 구분된 9단계로 마련된 감성레벨(Ts)을 도시하 였다. 각 단계는 서로 다른 온도가감수치를 갖는다. 예를 들어, 1단계는 +0.2도, -2단계는 -0.4도의 수치를 갖 는다. 이와 같은 온도가감수치의 절대값은 상기 입력설정온도(Ti)의 단위보다 작은 값으로 마련된다. 즉, 상기 입력설 정온도(Ti)의 단위가 1도인 경우, 온도가감수치의 절대값은 1보다 작다. 또한, 앞서 설명한 바와 같이, 온도가감수치는 상기 입력설정온도(Ti)의 단위보다 작은 소정의 단위로 마련된다. 그에 따라, 상기 입력설정온도(Ti)은 1도 및 상기 감성레벨(Ts)은 0.2도의 단위를 갖는 경우, 상기 온도가감수치 는 -0.8, -0.6, -0.4, -0.2, 0, +0.2, +0.4, +0.6, +0.8로 마련된다. 도 4에 도시된 바와 같이, 이러한 온도가감수치는 각 단계와 매칭될 수 있다. 따라서, 상기 감성레벨(Ts)에는, +0.8의 온도가감수치를 갖는 4단계, +0.6의 온도가감수치를 갖는 3단계, +0.4의 온도가감수치를 갖는 2단계, +0.2의 온도가감수치를 갖는 1단계, 0의 온도가감수치를 갖는 0단계, -0.2의 온도가감수치를 갖는 -1단계, -0.4 의 온도가감수치를 갖는 -2단계, -0.6의 온도가감수치를 갖는 -3단계 및 -0.8의 온도가감수치를 갖는 -4단계가 포함된다. 도 4를 참고하여, 예를 들어, 사용자가 상기 입력부를 통해 18도를 입력하고 상기 메모리부에 저장된 감성레벨이 2단계일 수 있다. 상기 제어부는 입력설정온도(Ti) 18도에 감성레벨(Ts) +0.4도를 더하여 18.4 도를 감성설정온도(Ti,s)로 판단한다. 또한, 상기 제어부는 실내온도(Tp)가 감성설정온도(Ti,s)인 18.4도에 도달되도록 상기 압축기를 가동시킨다. 이때, 상기 감성레벨(Ts)은 사용자의 성향에 따라 각각 다르게 설정된다. 이하, 이에 관하여 자세하게 설명한다. 도 5는 본 발명의 일 실시 예에 따른 공기조화기의 감성레벨의 설정을 위한 흐름도를 도시한 도면이다. 도 5에 도시된 바와 같이, 공기조화기가 작동되고 사용자에 의해 입력설정온도(Ti)가 입력된다(S200). 앞서 설명한 바와 같이, 상기 제어부는 상기 입력설정온도(Ti)에 감성레벨(Ts)를 더하여 감성설정온도(Ti, s)를 계산한다(S210). 초기상태에서 상기 감성레벨(Ts)은 0단계로 설정되기 때문에, 초기상태에서 상기 감성설정 온도(Ti,s)는 상기 입력설정온도(Ti)와 동일한 온도값에 해당된다. 상기 제어부는 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달되도록 상기 압축기를 가동시키고, 어느 순간 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달된다(S220). 이때, 상기 제어부는 상기 압축기의 가동을 정지시킨다. 한편, 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달된 후, 사용자에 의해 입력설정온도(Ti)가 변경될 수 있다 (S230). 특히, 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달되고 입력설정온도(Ti)가 변경되는 경우만을 의미한다. 다른 경우 입력설정온도(Ti)의 변경은 상기 감성레벨(Ts)에 영향을 주지 않는다. 사용자에 의해 변화된 수치가 상기 메모리부에 저장되고(S240), 그에 따라 감성레벨(Ts)이 재설정된다 (S250). 예를 들어, 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달된 후, 사용자가 입력설정온도(Ti)를 높인 경 우에는 감성레벨(Ts)의 단계가 한 단계 높게 재설정될 수 있다. 자세하게는, 초기상태에서 사용자가 입력설정온도(Ti)를 높인 경우, 상기 감성레벨(Ts)은 0단계에서 1단계로 재 설정될 수 있다. 이와 같이, 상기 감성레벨(Ts)은 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달되고 입력설정 온도(Ti)가 변경된 경우의 데이터가 축적되어 계속하여 재설정될 수 있다. 예를 들어, 사용자 A는 한번 상기 입력부를 통해 입력설정온도(Ti)를 입력하면 바꾸지 않는 경향이 있다. 따라서, 사용자 A의 감성레벨(Ts)은 0단계에서 변화되지 않고, 공기조화기는 입력설정온도(Ti)와 동일한 감성설 정온도(Ti,s)로 구동된다. 사용자 B는 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달된 후, 입력설정온도(Ti)을 높이는 경향이 있다. 따라 서, 사용자 B의 감성레벨(Ts)은 1 내지 4단계에 해당되며, 입력설정온도(Ti)의 변화수치에 따라 감성레벨(Ts)의 단계가 변화될 수 있다. 사용자 C는 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달된 후, 입력설정온도(Ti)을 낮추는 경향이 있다. 따라 서, 사용자 B의 감성레벨(Ts)은 -1 내지 -4단계에 해당되며, 입력설정온도(Ti)의 변화수치에 따라 감성레벨(Ts) 의 단계가 변화될 수 있다. 사용자 D는 실내온도(Tp)가 상기 감성설정온도(Ti,s)에 도달된 후, 입력설정온도(Ti)을 매우 낮추는 경향이 있다. 특히, 사용자 D는 사용자 C에 비하여 입력설정온도(Ti)를 더 변화시키는 경향이 있다. 그에 따라, 사용자 D의 감성레벨(Ts)은 -3, -4단계에 해당될 수 있다. 이와 같이, 본 발명의 사상에 따른 공기조화기는 사용자의 성향에 따라 구동된다. 특히, 도 1 및 도 2에 도시된 바와 같이, 비교적 좁은 공간에 설치되는 공기조화기의 경우 한 명의 사용자를 위해 공기조화기가 맞춤설정온도 로 구동될 수 있다. 또한, 복수의 사용자가 사용하는 공기조화기의 경우, 사용자를 입력하도록 구비될 수 있다. 그에 따라, 같은 입 력설정온도를 입력하여도 공기조화기를 구동시키는 사용자에 따라 서로 다른 감성설정온도로 구동될 수 있다. 또한, 사용자의 경향을 파악하여 그에 맞는 맞춤온도로 구동되기 때문에 부가적인 압축기의 구동이 적어질 수 있다. 그에 따라, 공기조화기가 효율적으로 구동될 수 있다."}
{"patent_id": "10-2017-0080644", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 공기조화기를 도시한 사시도이다. 도 2는 도 1의 I-I'를 따라 절개한 단면도이다. 도 3은 본 발명의 일 실시 예에 따른 공기조화기의 제어구성을 도시한 도면이다. 도 4는 본 발명의 일 실시 예에 따른 공기조화기의 감성설정온도를 도시한 도면이다. 도 5는 본 발명의 일 실시 예에 따른 공기조화기의 감성레벨의 설정을 위한 흐름도를 도시한 도면이다."}
