{"patent_id": "10-2022-0066836", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0166627", "출원번호": "10-2022-0066836", "발명의 명칭": "인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템", "출원인": "정성태", "발명자": "정성태"}}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지문의 난이도에 따라 산출되는 점수구간(31)과, 각각의 지문마다 문학교훈, 고사성어, 인물역사, 시사상식으로구분되는 테마영역(32)으로 구분되는 각각의 지문중에 사전테스트 결과에 따라 지문을 선정하도록 하는 지문선정 관리수단(3)과;상기 지문선정 관리수단(3)을 통해 선정된 선정지문을 상기 학습레벨 설정수단(2)을 통해 만들어진 사전테스트결과에 따라 듣기배속을 결정하는 배속선정 관리수단(4)과;상기 지문선정 관리수단(3)과 배속선정 관린수단(4)으로 부터 선정된 듣기지문을 통해 듣기학습관리수단(51)과, 학습목표 확인수단(52), 관련어휘 확인수단(53), 지문듣기 진행수단(54), 문제풀이 진행수단(55), 정보처리 진행수단(56), 훈련결과 확인수단(57)을 통해 듣기훈련을 진행하도록 구성하는 듣기학습 진행수단(5)을 포함하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서:학습회원의 듣기훈련 설정레벨을 초등4학년 이하인 초저영역과 초증학교 5,6학년인 초고영역 및 중고등학교 전체를 중고영역으로 구분한 학년별레벨세트로 구분하여 총3세트로 구성한 다음 각각의 세트당 3개의 지문과 각지문당 10문항으로 구분하여 사전테스트하도록 하는 학습레벨 설정수단(2)을 포함하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서:듣기능력 향상을 원하는 학습회원과, 학습회원의 교육진행을 후원하는 후원회원과, 학습회원의 교육진행을 책임지는 지도강사 및 학습회원의 교육진행과 지도상황을 확인하고 코치하는 관리강사로 각각 구분하여 등록할 수있도록 하는 학습회원 등록수단(1)을 포함하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서:진행중인 강좌별 듣기지문에 대한 결과를 종합분석결과 안내블록(51i)을 통해 확인하는 수단으로, 상단부에서부터 회원신상과 최근학습방법이 나타나도록 하는 회원관련자료영역(61)과;1강에서 16강 까지로 구성된 전체강좌의 평균듣기지수 표기와 결과지분석 가이드블록(62b)으로 구성된 결과지평균 듣기지수영역(62a)과, 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간을 표시한 평균학습시간표기영역(62c)과, 총획득 포인트를 표기하는 총포인트표기영역(62d)과,상부에 문학교훈과 고사성어,인물역사, 시사상식으로 구분하여 그래크표 표기한 표기하는 태마진행표기영역(62f)로 구분하여 구성한 평균누적학습영역(62)과;문학교훈과 고사성어, 인물역사, 시사상식으로 구분되는 원형의 비율표로 구성하고 그 일측에 문학교훈과 고사성어, 인물역사, 시사상식으로 구분구분하여 나의점수와 읽쓰 평균 점수를 표기하여 구성한 테마별 성취도 분석영역(63)과;공개특허 10-2023-0166627-3-1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 문제풀이결과를 그래프로 나타낸 문재풀이 이해도 표기영역(64)과;1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 듣기배속의 진행결과를 그래프로 나타낸 듣기지수 표기영역(65)과;1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 듣기훈련결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별 누적학습시간 표기영역으로 구분하여 표기한 듣기평가 진행표기영역(66)과;문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 선택적으로 설정할 수 있도록 하고, 완료한강의와 요악노트완료 및 포인트를 각각 선택적으로 설정할 수 있도록하는 확인선택영역(67a)과, 진행완료한 듣기훈련을 진행한 기간을 설정하는 기간설정영영(67b)과 듣기지문의 제목을 입력하도록 하는 제목입력영역(67c) 및 상기 영역의 입력완료후 확인하는 확인버튼(67d)으로 구성한 개인훈련 결과설정영역(67)과;상기 결과설정영역(67)을 통해 설정된 범위내에서의 듣기학습이 완료된 강의의 제목과 만족도, 듣기재생버튼,학습완료날짜, 이해도를 나열한 결과인지영역(68a)과, 노트쓰기확인버튼(68b)과 정보처리확인버튼(68c) 및 학습결과확인버튼(68d)을 구비한결과 확인버튼영역(68e)으로 구분하여 구성한 개인훈련 결과확인영역(68)으로 각각구분하되 모두 하나의 화면에 구성되도록 하는 종합분석 관리수단(6)을 포함하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서:상기 듣기학습 관리수단(51)은 상단부 좌측에 학습회원이 진행환료한 훈련내용을 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 나타낸 회원별 진행완료표시영역(51c)과, 상단부 우측에 학습회원이 진행환료한 훈련내용중 선택하여 재도전 할 수 있도록 하는 지난학습 재도전진행창을 소환하는 재도전진행블록(51d)과, 진행회원이 인터넷을 통해 가입하여 로그인한 상태의 진행사이트 홈페이지 전체화면으로 이동하도록 하는 홈페이지복귀블록(51e)과, 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)으로 구성한 훈련진행기본영역(5a)과,중심부에 인공지능이 선정한 지문의 제목을 나열시킨 진행확인블록(51b) 하단부에 태마, 학습목적, 원작국가,지문글자수 등으로 태그로 구분한 상식문제의 주제를 나열시킨 훈련진행 확인영역(51a)과, 하단부 일측에 진행확인영역에 나열된 상식문제를 풀이할 수 있도록 안내하는 모의고사진행블록(51h)과, 상기종합분석 관리수단(6)으로 안내하는 종합분석결과 안내블록(51i)으로 구성하는 것을 특징으로 하는 인공지능을이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서:상기 학습목표 확인수단(52)은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을구비한 진행구간 확인영역(5b)과, 중심부에 인공지능이 선정한 지문의 제목과 그 제목의 이미지 사진과 진행목표를 문장으로 나열시킨 진행목표 확인영역(52a)과, 하단부에 관련어휘 확인수단(53)으로 이동하는 관련어휘 이동블록(52b)으로 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서:상기 관련어휘 확인수단(53)은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하공개특허 10-2023-0166627-4-여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 상하로 나열된 4~9개의 어휘블록(53b)을 클릭하는 순서대로 하단부에 어휘의 뜻을 나열하는 풀이문장이 나타나도록 하는 어휘뜻 풀이영역(53c)으로 구성하는 어휘확인 진행영역(53a)과, 하단부에 지문듣기 진행수단(54)으로 이동하는 지문듣기 이동블록(53d)으로 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서:상기 지문듣기 진행수단(54)은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 일차배속과 이차배속으로 구분하여 순차적으로 들을 수 있도록 지문듣기를 진행하는 지문듣기 재생블록(54b) 구비하고 지문듣기 진행방법을 문장으로 나열시킨 지문듣기 진행영역(54a)과, 하단부에 문제풀이진행수단(55)으로 이동하는 문제풀이 이동블록(54c)으로 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서:상기 문제풀이 진행수단(55)은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 문제풀이의 진행방법을 문장으로 나열시킨 문제풀이 안내영역(55d)과, 하단부에 문제풀이를 진행하도록 하는문제풀이 시작블록(55e)으로 구성한 문제풀이 시작구간(55a)과;상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목 아래에 전체문항중 정답을 제출한 문항비율을막대그래프로 표기한 문제풀이 수행그래프(55h)를 나열시키고, 중심부에 듣기 완료한 지문에 포함하는 내용의질문내용과 사지선택으로 선택할 수 있는 답안선택블록(55i)을 구비한 다수의 답안선택내용으로 구성한 문제풀이 진행영역(55f)과, 하단부에 문제풀이 진행시간의 남은시간을 실시간으로 도출하면서 답안선택 완료후 다음문제풀이 완료구간(55c)으로 넘어가도록 클릭할 수 있도록 하는 문제풀이 진행블록(55g)으로 구성한 문제풀이진행구간(55b)과;상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 문제풀이 진행구간(55b)에서 진행한 결과를 문장으로 나열시킨 풀이결과 지문영역(55j)과, 하단부에 정보처리 진행수단(56)으로이동하는 정보처리 이동블록(55k)으로 구성한 문제풀이 완료구간(55c)으로 각각 구분하여 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서:상기 정보처리 진행수단(56)은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부공개특허 10-2023-0166627-5-에 정보처리의 진행시작을 나열시킨 문장과 정보처리 진행진행하도록 하는 정보처리 진행블록(56e)으로 구성한정보처리 시작구간(56a)과;상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 지문듣기와 문제풀이를완료한 강좌의 제목과 전체지문을 나열하고 나열된 전체지문을 음성으로 들려주는 정보처리 진행영역(56f)과 그상단에 전체문제풀이 수량과 정보처리 진행영역(56f)의 전체지문중 선정문장의 수량을 나열시킨 정보처리 안내영역(56g)을 그 하단에 선정문장의 선택결과를 확인하는 정보처리 확인구간(56c)으로 이동하도록 하는 정보처리정답블록(56h)으로 구성한 정보처리 진행구간(56b)과;상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 정보처리 진행구간(56b)을 통해 선택한 선정문장과 정답문장를 동시에 나타나도록 하는 강좌의 제목과 전체지문을 나열시킨 정보처리 정답영역(56i)과 그 상단에 전체문제풀이 수량과 정보처리 진행구간(56b)을 통해 선택한 선정문장과 정답문장이 일치하는 수량을 나열시킨 정보처리 확인영역(56j)을 그 하단에 정보처리 확인내용을 마무리하고 선정문장의 선택결과를 확인하는 정보처리 완료구간(56d)으로 이동하도록 하는 정보처리 마감블록(56k)으로 구성한 정보처리 확인구간(56c)과;중심부에 정보처리 확인구간(56c)을 통해 마감한 정보처리결과에 대한 마감안내 문구와 정보처리결과의 만족도를 스스로 선책할수 있도록 구성한 다수의 별표로 구성한 별점선택블록(56l)과, 하단부 일측에 훈련결과 확인수단(57)으로 이동하도록 하는 결과지 보기블록(56m)과 상기 각각의 수단을 통해 진행한 강의별 듣기학습 진행수단을 마무리하고 다음 강의로 이동하도록 하는 훈련종료블록(56n)으로 구성한 정보처리 완료구간(56d)으로 각각구분하여 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서:상기 훈련결과 확인수단(57)은 상단부 일측에 개별강좌의 듣기훈련을 진행한 지문의 강의제목과 그 강의의 진행회차를 나열시키고 타측에 가입회원의 회원신상과 학습진행 일자 및 학습방법을 나열한 개별강좌 기본자료자료영역(57a)과;개별강좌의 진행테마와 듣기지수 표기와 개별결과지 가이드블록(57f)으로 구성된 개별결과지 듣기지수영역(57e)과, 듣기지수를 진행태마별로 구분하여 진행한 테마별 듣기지수 표기영역(57g)과 획득 포인트를 표기하는 포인트표기영역(57h)으로 구분하여 구성한 누적듣기지수 확인영역(57b)과;개별강좌에서 진행한 듣기훈련결과를 듣기학습 진행시간을 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별학습시간 표기영역(57i)과, 이를 강좌지문의제목과, 테마, 듣기지수, 지문의 총글자수, 소요시간, 문제풀이 이해도, 정보처리 이해도 및 총학습소요시간을문장으로 나타낸 누적학습내용 표기영역(57j)과, 문제풀이결과와 정보처리결과를 진행회원의 직전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 막대그래프로 표기한 풀이결과 그래프비교공간(57k)과 문제풀이결과와 정보처리결과를 진행회원의 직전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 %의 수치로 표기한풀이결과 수치비교공간(57l)으로 구분하여 표기한 풀이결과 표기영역(57c)과;문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 각각 구분된 구간에 따흔 문제풀이에 해한 학생의 답과정답을 비교하고 그 결과에 대한 정답률과 결과를 나열시킨 문제풀이결과 표기영역(57m)과, 문제풀이결과를 서론, 본론, 결론으로 구분한 구간의 결과의 점수를 그래프로 표기한 구간별결과 그래프표기영역(57n)과, 정보처리결과를 별도의 정보처리결과지를 화면으로 불러오는 정보처리 결과보기블록(57p)으로 나누어 나열하는 문제처리결과 상세보기영역(57d)으로 구분하여 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템.공개특허 10-2023-0166627-6-청구항 12 제 1항에 있어서:지문선정 관리수단(3)은 상기 학습레벨 설정수단(2)을 통해 선정된 학습회원의 사전테스트 결과를, 지문의 난이도에 따라 산출되는 점수구간(31)과, 각각의 지문마다 문학교훈, 고사성어, 인물역사, 시사상식으로 구분되는테마영역(32)으로 구분되는 각각의 지문중에 사전테스트 결과에 따라 지문을 선정하는 지문선정 진행단계(T2)를진행하도록 구성하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1항에 있어서:배속선정 관리수단(4)은 상기 지문선정 관리수단(3)을 통해 선정된 선정지문을 상기 학습레벨 설정수단(2)을 통해 만들어진 사전테스트 결과에 따라 듣기배속을 결정하는 배속레벨 설정단계(T3)를 진행하도록 구성하는 것을특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 시스템."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "지문듣기 진행수단(54)의 지문듣기 진행영역(54a) 중심부에 구성된 지문듣기 재생블록(54b)을 클릭하여 일차배속과 이차배속으로 구분하여 순차적으로 두번의 지문듣기를 재생시켜서 듣기훈련을 진행하도록 한다음 지문듣기가 완료된 후 문제풀이 이동블록(54c)를 클릭하여 마무리하는 지문듣기 훈련단계(S3)와;상기 지문듣기 훈련단계(S3)를 완료한 다음 나타나는 문제풀이 시작구간(55a)의 문제풀이 안내영역(55d)을 통해문제풀이 진행방법을 숙지한 다음 문제풀이 시작블록(55e)를 클릭하여 나타나는 문제풀이 진행구간(55b)의 질문내용을 읽고 난다음 그 하단에 나열된 보기답안중 정답답안의 답안선택블록(55i)를 클릭한 다음 하단에 구성된 문제풀이 진행블록(55g)를 클릭하는 문제풀이 훈련을 각각의 강좌별로 구성된 다수의 답안선택내용을 순차적으로 풀이하는 문제풀이 훈련과정을 진행하되 답안선택블록(55i)에 제시된 3분의 시간내에 완료도록 하며, 모든답안선택을 완료하거나 3분이 지나면 나타나는 풀이결과 지문영역(55j)에 나열된 풀이결과 지문을 통해 전체 문항중 틀린문항수를 확인한 다음 정보처리 이동블록(55k)을 클릭하여 마무리하는 문제풀이 훈련단계(S4)와;상기 문제풀이 훈련단계(S4)를 완료한 다음 나타나는 정보처리 진행수단(56)의 정보처리 시작구간(56a)에 표기된 정보처리 진행블록(56e)를 클릭하여 나타나는 정보처리 진행구간(56b)의 정보처리 진행영역(56f)을 통해 나타나는 문제풀이를 완료한 강좌의 나열된 전체지문을 들려주는 읽기음성을 청취하면서 전체지문의 문장 중 상기문제풀이 훈련단계(S4)에서 진행한 모든 문제풀이 문장을 순차적으로 찾아서 클릭하여 선정하는 정보처리 과정을 완료한 다음 정보처리 정답블록(56h)을 클릭하여 상기 정보처리 진행구간(56b)에서 클릭한 문장과 상기 문제풀이 훈련단계(S4)에서 진행한 실질적은 문제풀이 문장을 나타타도록 하여 정보치리 진행영역에서 진행한 정보처리의 결과를 확인할 수 있도록 한후 정보처리 마감블록(56k)을 클릭하여 정보처리 완료구간(56d)으로 이동하도록 한 다음 결과지 보기블록(56m)을 틀릭하여 훈련결과 확인수단(57)으로 이동하도록 하거나 훈련종료블록(56n)를 클릭하여 각의 강좌의 듣기훈련 종료하도록 하는 정보처리 훈련단계(S5)를 순차적으로 진행하는 것을특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서:학습회원 등록수단(1)을 통해 가입한 신입 학습회원의 레벨을 초저학년, 초고학년, 중고학년으로 구분한 학년별3단계의 분류레벨 중 자기의 학년에 해당하는 단계를 선택하여 총3개의 지문을 듣고 총10 문항의 문제풀이를 진행하는 사전테스트의 결과에 대한 점수를 인공지능을 통해 미리설정한 분류점수에 대입하여 사전테스트를 진행한 신입 학습회원의 합습레벨를 테스트하는 학습레벨 테스트단계(T1)와;상기 학습레벨 테스트단계(T1)를 통해 설정된 신입 학습회원의 학습레벨의 점수와 동일한 점수의 지문을 인공지능을 통해 각 지문마다 난이도에 따라 점수구간이 산출되어 분류되어 있는 전체지문 중에 4개의 테마 중 하나로공개특허 10-2023-0166627-7-선정하여 가장 첫 지문으로 선정해주고 그 다음부터 학습레벨에 맞는 모든 지문을 순서대로 진행하도록하는 지문선정 진행단계(T2)와;상기 지문선정 진행단계(T2)를 통해 선정된 첫번째 지문의 읽기진행 속도를 1.3배속으로 진행하도록 설정한 다음 차후 진행하는 각각의 강의마다 도출되는 학습회원의 수행능력에 따라 인공지능을 통해 미리설정한 수식에대입하여 산출한 대입값에 맞는 속도의 일기진행 배속속도를 각각의 강의가 진행완료된 시점마다 적용하여 다음강의진행시 바로 적용할 수 있도록 하는 배속레벨 설정단계(T3)를 순차적으로 진행하는 학습레벨 설정단계(S0)를 포함하여 진행하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 또는 제 15항에 있어서:진행강좌의 어휘확인 진행영역(53a)에 관련된 관련어휘를 상하로 나열한 네개 내지 아홉개의 어휘블록(53b)중풀이문장이 필요한 숙지되지 않은 관련어휘의 어휘블록(53b)을 클릭하여 하단에 나타나는 풀이문장을 통해 관련어휘를 숙지하는 과정을 통해 각각의 훈련영역에 해당하는 관련어휘를 선제적으로 숙지하도록 한 다음 하단에나타나는 지문듣기 이동블록(53d)을 클릭하여 마무리하는 관련어휘 숙지단계(S2)를 포함하여 진행하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 14항에 있어서:상기의 정보처리 훈련단계(S5)에서 결과지 보기블록(56m)을 클릭하여 나타나는 훈련결과 확인수단(57)을 통해상기 문제풀이 훈련단계(S4)와 정보처리 훈련단계(S5)를 통해 진행한 비대면 듣기훈련 결과를 학인하도록 하는것으로서, 누적듣기지수 확인영역(57b)을 통해 개별강좌에서 진행한 듣기훈련결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간을 확인함은 물론, 문제풀이결과와 정보처리결과를 진행회원의 직전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 막대그래프와 퍼센트의 수치로 구분하며, 풀이결과 표기영역(57c)을 통해, 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 도표와 그래프로 구분하여 확인할 수 있도록 하고 문제처리결과 상세보기영역(57d)을 통해 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 각각 구분된 구간에 따흔 문제풀이에 해한 학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 확인하고, 문제풀이결과를 서론, 본론, 결론으로 구분한 구간의 결과의 점수를 그래프로 확인하도록 하여 상기에서 실시한 비대면 듣기훈련 결과를 다양하게 확인하도록 하는 훈련결과 확인단계(S6)를 포함하여 진행하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 14항에 있어서:지문듣기 훈련단계(S3)와, 문제풀이 훈련단계(S4) 및 정보처리 훈련단계(S5)를 순차적으로 진행하는 비대면 듣기훈련 방법을 통해 진행완료한 모든강좌의 듣기훈련 결과를 상기 듣기학습 진행수단(5)의 종합분석결과 안내블록(51i)을 클릭하여 나타나는 종합분석 관리수단(6)을 통해 1강에서 16강 까지로 구성된 전체강좌의 평균듣기지수와 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간 및 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 나의점수와 읽쓰 평균 점수는 물론, 강좌마다 진행한 듣기훈련결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 구간별 누적학습시간 표기영역으로 구분하는 테마별 성취도를 분석하며, 개인훈련 결과설정영역(67)을 토해 완료한 강좌와 요악노트완료 및 포인트를 각각 선택적으로 설정하거나 검색할 기간이나 제목을 직접 기제한 다름 한 다음 확인버튼(67d)을 클릭 개인훈련결과확인영역(68)을 개인훈련 결과설정영역(67) 하단에 나타나도록하여 필요시 노트쓰기확인버튼(68b)과 정보처리확인버튼(68c) 및 학습결과확인버튼(68d)을 클릭하여 확인하도록 하는 종합분석 확인단계(S7)를 포함하여 진행하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법. 공개특허 10-2023-0166627-8-청구항 19 제 15항에 있어서:상기 학습레벨 테스트단계(T1)는 상기 학습회원 등록수단(1)을 통해 가입한 신입 학습회원의 레벨을 초저학년,초고학년, 중고학년으로 구분한 학년별 3단계의 분류레벨 중 자기의 학년에 해당하는 단계를 선택하여 총3개의지문을 듣고 총10 문항의 문제풀이를 진행하는 사전테스트의 결과에 대한 점수를 인공지능을 통해 미리설정한분류점수에 대입하여 사전테스트를 진행한 신입 학습회원의 합습레벨를 테스트하여 인공지능을 통해 전체회원의테스트결과와 비교 분석하여 학습회원의 듣기훈련 진입시점의 학습레벨을 설정하도록 진행하는 것을 특징으로하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 15항에 있어서:지문선정 진행단계(T2)는 상기 학습레벨 테스트단계(T1)를 통해 설정된 신입 학습회원의 학습레벨의 점수와 동일한 점수의 지문을 인공지능을 통해 각 지문마다 난이도에 따라 점수구간이 산출되어 분류되어 있는 전체지문중에 4개의 테마 중 하나로 선정하여 가장 첫 지문으로 선정해주고 그 다음부터 학습레벨에 맞는 모든 지문을순서대로 진행하도록하는 학습레벨을 설정하도록 진행하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 15항에 있어서:배속레벨 설정단계(T3)은 상기 지문선정 진행단계(T2)를 통해 선정된 첫번째 지문의 읽기진행 속도를 1.3배속으로 진행하도록 설정한 다음 차후 진행하는 각각의 강의마다 도출되는 학습회원의 수행능력에 따라 인공지능을통해 미리설정한 수식에 대입하여 산출한 대입값에 맞는 속도의 일기진행 배속속도를 각각의 강의가 진행완료된시점마다 적용하여 다음 강의진행시 바로 적용할 수 있도록 진행하는 것을 특징으로 하는 인공지능을 이용한 실시간 비대면 듣기훈련 방법."}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 온라인을 기반으로 제공하는 인공지능을 이용한 듣기훈련 시스템을 제공하여 비대면 상태에서 음성으 로 들은 소리를 종합, 분석, 비판하는 과정을 진행하는 훈련을통해 이해하고 판단하는 듣기를 훈련하여 청취집중 력을 향상하도록 하는 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템에 관한 것으로서 더욱 상세하게는 온라인을 기반으로 제공하는 인공지능을 이용한 듣기훈련 시스템을 제공하여 비대면 상태에서 음성으로 들은 소 리를 종합, 분석, 비판하는 과정을 진행하는 훈련을통해 이해하고 판단하는 듣기를 훈련하여 청취집중력을 향상 하도록 하는 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템에 관한 것이다."}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "책은 인류가 문자를 만들면서부터 인간의 습득수단으로 사용하고 있으며, 특히 종이의 발명으로 인간이 알고 있 는 모든 생각과 지식을 표현하고 기록하며, 이를 이해하고 교육하는 수단으로 사용하면서 과거와 현재는 물론 미래의 문명 발전을 주도하는 역할을 하는 대표적인 수단으로 성공한 인생을 살아가는 사람들 모두가 강조하는 책은 삶을 윤택하게 만들어주는 마음의 양식으로, 책을 통해 자신이 알지 못했던 새로운 세상을 간접체험 하기 도 하고, 새로운 가치관과 인생관을 갖게 하는 인생의 전환점이 되기도 하며, 이렇게 좋은 독서는 어릴 때부터 많이 체험하는 것이 좋다고 하는데, 어린 시절 많은 독서가 중요한 이유가 다양함을 알 수 있습니다. 특히, 언어에 대한 학습은 크게 읽기, 쓰기, 말하기 및 듣기로 구분될 수 있는데, 모든 의사 소통의 중심이 언 어에 대한 듣기, 즉, 그 언어를 잘 들을 수 있는지 여부에서부터 시작되기 때문에 해당 언어에 관한 고유한 소리를 제대로 듣고 제대로 이해할 수 있도록 하기 위한 듣기 학습 지원 방법에 대하여 많은 연구가 진행되고 있 다. 또한, 현대문명이 인터넷을 통해 시간과 공간에 관계없이 언제 어디서나 접근할 수 있는 편리성을 제공하기 때 문에 정보의 개방화를 촉진하며, 인터넷 사용자들은 인터넷에 접속하여 강의 중심의 교육 및 교사 중심의 교육 을 기반으로 하는 수동적인 지식습득의 패러다임에서 학습자 중심의 교육을 기반으로 하는 능동적인 지식습득의 패러다임으로의 변화를 요구하고 있다. 이와 같이, 정보화 사회에서는 기존의 교육환경과 다르게 변모함으로써 온라인 언어 교육의 일환으로 읽기, 쓰 기, 말하기 및 듣기로 구분하여 언어향상 교육환경에 관심을 두고 오프라인상에서 이루어지던 읽기, 쓰기, 말 하기 및 듣기 훈련을 결합한 교육방식을 온라인 교육 서비스로 구현하면서 올바른 언어 교육을 장려하고 학습효 과를 증진시키기 위한 다양한 방법들을 개발하여 적용하고 있는 추세이다. 이중 최근에는 본원 출원인이 선 등록한 등록특허공보 제10-1609417호의 \"독서신장을 위한 독서지도시스템 및 그 방법\"을 통해 확인할 수 있는 바와 같이 \" PRS 지문영역과, PRS 진단영역과, PRS 결과영역을 구 비한 도서레벨 선정수단과; 대상도서 선정영역과, 독서능력 진단영역과, 독서능력 확인영역을 통해 학습회원의 개인별 독서능력을 단계별로 진단할 수 있도록 하는 독서능력 진단수단과; 기간별 비교영 역과, 전체분석 비교영역과, 레벨별 비교영역과, 장르별 비교영역과, 독후활동 내역영역으 로 각각 구성하는 독서능력 분석수단과; 독서노트 선정영역과, 독서노트 정보영역과, 독서노트 등 록영역으로 구성하는 독서노트 작성수단과; 토론도서 목록영역과, 독서토론 참여영역으로 구성 하는 독서토론 참여수단을 각각 포함하는 것을 특징으로 하는 독서능력을 위한 독서지도시스템\"을 제공함으 로써, 지역 도서관 효율 극대화하며, 저비용으로 독서매니저를 통한 밀착 교육서비스로 스스로 학습습관 형성에 도움을 받아 학업성적을 향상할 수 있도록 함으로서 독서능*읽기능력 향상을 통한 사교육을 최소화하는 사회적 인프라를 구축하여 사회적 배려계층 청소년의 기초학습능력을 향상하도록 하는 자기주도형 독서지도를 구현할 수 있도록 하거나; 또는 등록된 등록특허공보 제10-1923561호의 \" 듣기 학습을 지원하는 방법, 시스템 및 비일시성의 컴퓨터 판독 가능 기록 매체\"를 통해 확인할 수 있는 바와 같이 \" 듣기 학습을 지원하는 방법으로서, 평가 학습 문장을 음성 으로 제공받은 사용자로부터의 피드백을 참조하여 상기 사용자가 알아듣지 못하는 복수의 취약 학습 문장을 결 정하는 단계, 상기 복수의 취약 학습 문장에 공통적으로 포함되는 발음 또는 발음 조합 중 적어도 일부를 상기 사용자가 알아듣지 못하는 취약 발음 또는 취약 발음 조합으로서 결정하는 단계, 및 상기 결정되는 취약 발음 또는 상기 취약 발음 조합을 참조하여 상기 사용자에게 제공될 보충 학습 경로를 결정하는 단계를 포함하는 방 법과 시스템\"을 제공함으로써, 사용자의 취약 학습 문장을 참조하여 그 취약 학습 문장에 공통적으로 포함되는 사용자의 취약 발음 또는 취약 발음의 조합을 추출할 수 있게 하는 효과와 사용자의 취약 발음 또는 취약 발음 조합에 연관되는 학습 자료를 통해 사용자가 자신의 취약 부분을 집중적으로 보충 학습할 수 있도록 지원할 수 있게 하고 있다. 하지만, 상기에 기술한 인용발명의 독서학습 교육 시스템들은 한권의 독서 책을 정독한 이후 독서능력을 평가하 도록 하고 있어 독서진행 과정에서 듣기훈련이 이루어지지 않아 듣기능력의 향상이 어려울 뿐만 아니라 문제점 해결을 하기 위해 학원 등 별도의 장소에서 대면한 상태에서 개인별 능력 및 환경에 맞춘 진단 및 검사를 통하 여 독서지수 향상을 통한 학습 동기를 부여하고 자기주도 학습능력을 향상시킬 수 있도록 하는 자기주도형 독서 지도 시스템이고; 상기의 듣기 학습을 지원하는 방법 및 시스템은 사용자의 취약 학습 문장을 참조하여 그 취약 학습 문장에 공통 적으로 포함되는 사용자의 취약 발음 또는 취약 발음의 조합을 추출하고, 취약 발음 또는 취약 발음 조합에 연 관되는 학습 자료를 통해 사용자가 자신의 취약 부분을 집중적으로 보충 학습할 수 있도록 지원하는 듣기학습 지원 시스템으로써, 코르나-19로 인해 사회적 거리를 유지해야 하는 사회적 환경이나 도서지역과 같은 지역적인 물리적 환경으로 인해 온라인을 통해서만 독서지도가 진행 가능한 상황에서의 듣기능력을 향상시키거나 평가하 기 위한 진단기준이나 평가기준 마련되어 있지 않아 이용자의 듣기능력을 실시간으로 향상시키지 못하여 실질적 인 실시간 온라인 듣시능력 향상 서비스지원 서비스를 해결하지 못하는 등의 문제점이 발생하고 있음에도 온라 인 독서지도 사이트를 개발하고 운영하는 업체에서는 이에 대한 근본적인 문제점들에 대한 해결방안을 제시하지못하고 있는 실정에 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 등록특허 10-1609417호 (특허문헌 0002) KR 등록특허 10-1983772호 (특허문헌 0003) KR 등록특허 10-1923561호"}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명에서는 상기와 같은 제반 문제점들을 일소하기 위하여 안출한 것으로서, 학습목표 확인수단, 관련 어휘 확인수단, 지문듣기 진행수단, 문제풀이 진행수단, 정보처리 진행수단, 훈련결과 확인수단으로 구성된 듣 기훈련 시스템을 제공함으로써, 학습목표 숙지단계와, 관련어휘 숙지단계, 지문듣기 훈련단계, 문제풀이 훈련단 계, 정보처리 훈련단계, 훈련결과 확인단계를 순차적으로 진행하는 듣기훈련방법을 통해 학습회원의 듣기훈련의 종합적인 진행결과를 인공지능을 통해 종합분석한 내용을 기준으로 학습회원의 듣기훈련레벨을 설정하도록 함으 로써, 듣기훈련의 진행과정을 통해 이해하고 판단하는 영역의 두뇌 집중 훈련을 진행하도록 하여 듣기, 말하기, 쓰기, 읽기와 같은 언어발단단계에서 가장 기본이 되는 듣기를 훈련하여 청취집중력을 향상시키고 읽기, 쓰기를 능력의 향상과 자기주도 학습을 완성할 수 있도록 하는 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템을 제공하기 의하여 위 과제를 해결하고자하는 것이다. 특히, 순차적으로 진행하는 본격적인 듣기훈련을 진행하기에 앞서 읽쓰 듣기지수테스트를 통해 학생의 듣기능력 을 측정하고 인공지능이 평가하여 처음 시작할 지문의 난이도를 선정해 줌으로써, 학습회원 개개인의 듣기 능력 에 적합한 듣기훈련을 진행할 수 있도록 하는 개인 맞춤형 듣기훈련 프로그램 수 있도록 하여 듣기훈련의 결과 가 효율적으로 나타나도록 하는 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템을 제공하는 구체적인 목적이 있다. 또한, 4가지의 테마(문학교훈, 인물역사, 고사성어, 시사상식)에 따라 학습회원의 이해도(문제풀이 이해도, 정 보처리 이해도)와 문제풀이 시간을 측정하여 듣기 능력(이해도와 집중도)를 파악하여 인공지능응 통해 각각의 테마별로 학생에게 올바른 듣기의 지수를 선정할 수있도록 하는 또 다른 목적이 있다."}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "인터넷을 매개체로 하여 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템에 있어서; 듣기능력 향상을 원하는 학습회원과, 학습회원의 교육진행을 후원하는 후원회원과, 학습회원의 교육진행을 책임 지는 지도강사 및 학습회원의 교육진행과 지도상황을 확인하고 코치하는 관리강사로 각각 구분하여 등록할 수 있도록 하는 학습회원 등록수단과; 학습회원 등록수단을 통해 가입한 학습회원의 듣기훈련 설정레벨을 초등4학년 이하인 초저영역과 초증학교 5,6학년인 초고영역 및 중고등학교 전체를 중고영역으로 구분한 학년별레벨세트로 구분하여 총3세트로 구성한 다음 각각의 세트당 3개의 지문과 각지문당 10문항으로 구분하여 사전테스트하도록 하는 학습레벨 설정수단 과; 상기 학습레벨 설정수단을 통해 선정된 학습회원의 사전테스트 결과를, 지문의 난이도에 따라 산출되는 점수 구간과, 각각의 지문마다 문학교훈, 고사성어, 인물역사, 시사상식으로 구분되는 테마영역으로 구분되는 각각의 지문중에 사전테스트 결과에 따라 지문을 선정하도록 하는 지문선정 관리수단과; 상기 지문선정 관리수단을 통해 선정된 선정지문을 상기 학습레벨 설정수단을 통해 만들어진 사전테스트 결과에 따라 듣기배속을 결정하는 배속선정 관리수단과; 상기 지문선정 관리수단과 배속선정 관린수단으로 부터 선정된 듣기지문을 통해 듣기학습 관리수단과, 학습목표 확인수단, 관련어휘 확인수단, 지문듣기 진행수단, 문제풀이 진행수단 , 정보처리 진행수단, 훈련결과 확인수단을 통해 듣기훈련을 진행하도록 구성하는 듣기학습 진행수 단을 포함하는 듣기훈련 시스템을 구성한다. 또한, 상기 듣기학습 진행수단를 통해 진행중인 강좌별 듣기지문에 대한 결과를 종합분석결과 안내블록(51 i)을 통해 확인하는 수단으로, 상단부에서 부터 회원신상과 최근학습방법이 나타나도록 하는 회원관련자료영역 과; 1강에서 16강 까지로 구성된 전체강좌의 평균듣기지수 표기와 결과지분석 가이드블록(62b)으로 구성된 결과지평 균 듣기지수영역(62a)과, 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간을 표시한 평 균학습시간표기영역(62c)과, 총획득 포인트를 표기하는 총포인트표기영역(62d)과,상부에 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 그래크표 표기한 표기하는 태마진행표기영역(62f)로 구분하여 구성한 평균누 적학습영역과; 문학교훈과 고사성어, 인물역사, 시사상식으로 구분되는 원형의 비율표로 구성하고 그 일측에 문학교훈과 고사 성어, 인물역사, 시사상식으로 구분구분하여 나의점수와 읽쓰 평균 점수를 표기하여 구성한 테마별 성취도 분석 영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 문제풀이결과를 그래 프로 나타낸 문재풀이 이해도 표기영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 듣기배속의 진행결과 를 그래프로 나타낸 듣기지수 표기영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 듣기훈련결과를 학습목표, 관 련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별 누적학 습시간 표기영역으로 구분하여 표기한 듣기평가 진행표기영역과; 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 선택적으로 설정할 수 있도록 하고, 완료한강의와 요악 노트완료 및 포인트를 각각 선택적으로 설정할 수 있도록하는 확인선택영역(67a)과, 진행완료한 듣기훈련을 진 행한 기간을 설정하는 기간설정영영(67b)과 듣기지문의 제목을 입력하도록 하는 제목입력영역(67c) 및 상기 영 역의 입력완료후 확인하는 확인버튼(67d)으로 구성한 개인훈련 결과설정영역과; 상기 결과설정영역을 통해 설정된 범위내에서의 듣기학습이 완료된 강의의 제목과 만족도, 듣기재생버튼, 학습완료날짜, 이해도를 나열한 결과인지영역(68a)과, 노트쓰기확인버튼(68b)과 정보처리확인버튼(68c) 및 학습 결과확인버튼(68d)을 구비한결과 확인버튼영역(68e)으로 구분하여 구성한 개인훈련 결과확인영역으로 각각 구분하되 모두 하나의 화면에 구성되도록 하는 종합분석 관리수단을 별도로 구성하여 포함하는 것을 특징으 로 한다. 특히, 상기 듣기학습 진행수단은 듣기학습 관리수단과 학습목표 확인수단, 관련어휘 확인수단, 지문듣기 진행수단, 문제풀이 진행수단, 정보처리 진행수단, 훈련결과 확인수단을 통해 듣기훈 련을 순차적으로 진행하도록 구성하는 듣기훈련 시스템으로써; 우선, 상단부 좌측에 학습회원이 진행환료한 훈련내용을 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하 여 나타낸 회원별 진행완료표시영역(51c)과, 상단부 우측에 학습회원이 진행환료한 훈련내용중 선택하여 재도전 할 수 있도록 하는 지난학습 재도전진행창()을 소환하는 재도전진행블록(51d)과, 진행회원이 인터넷을 통해 가 입하여 로그인한 상태의 진행사이트 홈페이지 전체화면으로 이동하도록 하는 홈페이지복귀블록(51e)과, 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)으로 구성한 훈련진행 기본영역(5a)과,중심부에 인공지능이 선정한 지문의 제목을 나열시킨 진행확인블록(51b) 하단부에 태마, 학습목적, 원작국가, 지문글자수 등으로 태그로 구분한 상식문제의 주제를 나열시킨 훈련진행 확인영역(51a)과, 하단부 일측에 진행확인영역()에 나열된 상식문제를 풀이할 수 있도록 안내하는 모의고사진행블록(51h)과, 상기 종합분석 관리수단으로 안내하는 종합분석결과 안내블록(51i)으로 구분하여 구성한 듣기학습 관리수단과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부에 인공지능이 선정한 지문의 제목과 그 제목의 이미지 사진과 진행목표를 문장으로 나열시킨 진 행목표 확인영역(52a)과, 하단부에 관련어휘 확인수단으로 이동하는 관련어휘 이동블록(52b)으로 구성한 학 습목표 확인수단과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 상하로 나열된 4~9개의 어휘블록(53b)을 클릭하는 순서대로 하단부에 어휘의 뜻을 나열하는 풀이문장이 나타나도록 하는 어휘뜻 풀이영 역(53c)으로 구성하는 어휘확인 진행영역(53a)과, 하단부에 지문듣기 진행수단으로 이동하는 지문듣기 이동 블록(53d)으로 구성한 관련어휘 확인수단과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 상태를 나 타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인 영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 일차배속과 이차배 속으로 구분하여 순차적으로 들을 수 있도록 지문듣기를 진행하는 지문듣기 재생블록(54b) 구비하고 지문듣기 진행방법을 문장으로 나열시킨 지문듣기 진행영역(54a)과, 하단부에 문제풀이 진행수단으로 이동하는 문제 풀이 이동블록(54c)으로 구성한 지문듣기 진행수단과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 문제풀이의 진행방법을 문장으로 나열시킨 문제풀이 안내영역(55d)과, 하단부에 문제풀이를 진행하도록 하는 문제풀이 시작블록(55e) 으로 구성한 문제풀이 시작구간(55a)과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목 아래에 전체문항중 정답을 제출한 문항비율을 막대그래프로 표기한 문제풀이 수행그래프(55h)를 나열시키고, 중심부에 듣기 완료한 지문에 포함하는 내용의 질문내용과 사지선택으로 선택할 수 있는 답안선택블록(55i)을 구비한 다수의 답안선택내용으로 구성한 문제풀 이 진행영역(55f)과, 하단부에 문제풀이 진행시간의 남은시간을 실시간으로 도출하면서 답안선택 완료후 다음 문제풀이 완료구간(55c)으로 넘어가도록 클릭할 수 있도록 하는 문제풀이 진행블록(55g)으로 구성한 문제풀이 진행구간(55b)과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 문제풀이 진행구간 (55b)에서 진행한 결과를 문장으로 나열시킨 풀이결과 지문영역(55j)과, 하단부에 정보처리 진행수단으로 이동하는 정보처리 이동블록(55k)으로 구성한 문제풀이 완료구간(55c)으로 구분하여 구성하는 문제풀이 진행수 단과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 정보처리의 진행시작을 나열시킨 문장과 정보처리 진행진행하도록 하는 정보처리 진행블록(56e)으로 구성한 정보처리 시작구간(56a)과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 지문듣기와 문제풀이를 완료한 강좌의 제목과 전체지문을 나열하고 나열된 전체지문을 음성으로 들려주는 정보처리 진행영역(56f)과 그 상단에 전체문제풀이 수량과 정보처리 진행영역(56f)의 전체지문중 선정문장의 수량을 나열시킨 정보처리 안내 영역(56g)을 그 하단에 선정문장의 선택결과를 확인하는 정보처리 확인구간(56c)으로 이동하도록 하는 정보처리 정답블록(56h)으로 구성한 정보처리 진행구간(56b)과; 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 정보처리 진행구간(56b)을 통해 선택한 선정문장과 정답문장를 동시에 나타나도록 하는 강좌의 제목과 전체지문을 나열시킨 정보처리 정답영역(56i)과 그 상단에 전체문제풀이 수량과 정보처리 진행구간(56b)을 통 해 선택한 선정문장과 정답문장이 일치하는 수량을 나열시킨 정보처리 확인영역(56j)을 그 하단에 정보처리 확 인내용을 마무리하고 선정문장의 선택결과를 확인하는 정보처리 완료구간(56d)으로 이동하도록 하는 정보처리 마감블록(56k)으로 구성한 정보처리 확인구간(56c)과; 중심부에 정보처리 확인구간(56c)을 통해 마감한 정보처리결과에 대한 마감안내 문구와 정보처리결과의 만족도 를 스스로 선책할수 있도록 구성한 다수의 별표로 구성한 별점선택블록(56l)과, 하단부 일측에 훈련결과 확인수 단으로 이동하도록 하는 결과지 보기블록(56m)과 상기 각각의 수단을 통해 진행한 강의별 듣기학습 진행수 단을 마무리하고 다음 강의로 이동하도록 하는 훈련종료블록(56n)으로 구성한 정보처리 완료구간(56d)으로 구분 하여 구성하는 정보처리 진행수단과; 또한, 상기 듣기학습 진행수단를 통해 진행완료한 개별강좌에 대한 결과를 결과지 보기블록(56m)를 통해 확 인하는 수단으로, 상단부 일측에 개별강좌의 듣기훈련을 진행한 지문의 강의제목과 그 강의의 진행회차를 나열 시키고 타측에 가입회원의 회원신상과 학습진행 일자 및 학습방법을 나열한 개별강좌 기본자료자료영역(57a)과; 개별강좌의 진행테마와 듣기지수 표기와 개별결과지 가이드블록(57f)으로 구성된 개별결과지 듣기지수영역(57 e)과, 듣기지수를 진행태마별로 구분하여 진행한 테마별 듣기지수 표기영역(57g)과 획득 포인트를 표기하는 포 인트표기영역(57h)으로 구분하여 구성한 누적듣기지수 확인영역(57b)과; 개별강좌에서 진행한 듣기훈련결과를 듣기학습 진행시간을 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리 에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별학습시간 표기영역(57i)과, 이를 강좌지문의 제목과, 테마, 듣기지수, 지문의 총글자수, 소요시간, 문제풀이 이해도, 정보처리 이해도 및 총학습소요시간을 문장으로 나타낸 누적학습내용 표기영역(57j)과, 문제풀이결과와 정보처리결과를 진행회원의 직전결과와 평균결 과를 학년평균결과로 구분하여 비교하도록 막대그래프로 표기한 풀이결과 그래프비교공간(57k)과 문제풀이결과 와 정보처리결과를 진행회원의 직전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 %의 수치로 표기한 풀이결과 수치비교공간(57l)으로 구분하여 표기한 풀이결과 표기영역(57c)과; 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 각각 구분된 구간에 따흔 문제풀이에 해한 학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 나열시킨 문제풀이결과 표기영역(57m)과, 문제풀이결과를 서 론, 본론, 결론으로 구분한 구간의 결과의 점수를 그래프로 표기한 구간별결과 그래프표기영역(57n)과, 정보처 리결과를 별도의 정보처리결과지를 화면으로 불러오는 정보처리 결과보기블록(57p)으로 나누어 나열하는 문제처 리결과 상세보기영역(57d)으로 구분하여 구성하는 훈련결과 확인수단으로 각각 구성하는 것을 특징으로 한 다. 뿐만 아니라 듣기훈련 방법은 학습회원 등록수단을 통해 독해능력 향상을 원하는 학습회원과, 학습회원을 후원하는 학부모회원 및 학습회원을 지도하는 강사회원으로 각각 구분하여 가입하는 학습회원 등록단계(SS)와; 학습회원 등록수단을 통해 가입한 신입 학습회원의 레벨을 초저학년, 초고학년, 중고학년으로 구분한 학년별 3단계의 분류레벨 중 자기의 학년에 해당하는 단계를 선택하여 총3개의 지문을 듣고 총10 문항의 문제풀이를 진 행하는 사전테스트의 결과에 대한 점수를 인공지능을 통해 미리설정한 분류점수에 대입하여 사전테스트를 진행 한 신입 학습회원의 합습레벨를 테스트하는 학습레벨 테스트단계(T1)와; 상기 학습레벨 테스트단계(T1)를 통해 설정된 신입 학습회원의 학습레벨의 점수와 동일한 점수의 지문을 인공지 능을 통해 각 지문마다 난이도에 따라 점수구간이 산출되어 분류되어 있는 전체지문 중에 4개의 테마 중 하나로 선정하여 가장 첫 지문으로 선정해주고 그 다음부터 학습레벨에 맞는 모든 지문을 순서대로 진행하도록하는 지 문선정 진행단계(T2)와; 상기 지문선정 진행단계(T2)를 통해 선정된 첫번째 지문의 읽기진행 속도를 1.3배속으로 진행하도록 설정한 다 음 차후 진행하는 각각의 강의마다 도출되는 학습회원의 수행능력에 따라 인공지능을 통해 미리설정한 수식에 대입하여 산출한 대입값에 맞는 속도의 일기진행 배속속도를 각각의 강의가 진행완료된 시점마다 적용하여 다음 강의진행시 바로 적용할 수 있도록 하는 배속레벨 설정단계(T3)를 순차적으로 진행하는 학습레벨 설정단계(S0) 와; 학습레벨 설정단계(S0)가 완료된 이후에 실질적으로 진행되는 듣기훈련 방법은 우선 로그인 후 듣기학습 관리수 단의 진행확인블록(51b)을 통해 진입한 학습목표 확인수단의 진행목표 확인영역(52a)에 나타나는 지문 의 제목과 그 제목의 이미지 사진과 진행목표를 숙지한 다음 관련어휘 이동블록(52b)을 클릭하여 마무리하는 학 습목표 숙지단계(S1)와; 상기 학습목표 숙지단계(S1)의 관련어휘 이동블록(52b)을 클릭하여 진입하는 진행강좌의 어휘확인 진행영역 (53a)에 관련된 관련어휘를 상하로 나열한 네개 내지 아홉개의 어휘블록(53b)중 풀이문장이 필요한 숙지되지 않 은 관련어휘의 어휘블록(53b)을 클릭하여 하단에 나타나는 풀이문장을 통해 관련어휘를 숙지하는 과정을 통해 각각의 훈련영역에 해당하는 관련어휘를 선제적으로 숙지하도록 한 다음 하단에 나타나는 지문듣기 이동블록 (53d)을 클릭하여 마무리하는 관련어휘 숙지단계(S2)와; 상기 관련어휘 숙지단계(S2)를 통해 화면상에 나타나는 지문듣기 진행수단의 지문듣기 진행영역(54a) 중심 부에 구성된 지문듣기 재생블록(54b)을 클릭하여 일차배속과 이차배속으로 구분하여 순차적으로 두번의 지문듣 기를 재생시켜서 듣기훈련을 진행하도록 한다음 지문듣기가 완료된 후 문제풀이 이동블록(54c)를 클릭하여 마무 리하는 지문듣기 훈련단계(S3)와; 상기 지문듣기 훈련단계(S3)를 완료한 다음 나타나는 문제풀이 시작구간(55a)의 문제풀이 안내영역(55d)을 통해 문제풀이 진행방법을 숙지한 다음 문제풀이 시작블록(55e)를 클릭하여 나타나는 문제풀이 진행구간(55b)의 질 문내용을 읽고 난다음 그 하단에 나열된 보기답안중 정답답안의 답안선택블록(55i)를 클릭한 다음 하단에 구성 된 문제풀이 진행블록(55g)를 클릭하는 문제풀이 훈련을 각각의 강좌별로 구성된 다수의 답안선택내용을 순차적 으로 풀이하는 문제풀이 훈련과정을 진행하되 답안선택블록(55i)에 제시된 3분의 시간내에 완료도록 하며, 모든 답안선택을 완료하거나 3분이 지나면 나타나는 풀이결과 지문영역(55j)에 나열된 풀이결과 지문을 통해 전체 문 항중 틀린문항수를 확인한 다음 정보처리 이동블록(55k)을 클릭하여 마무리하는 문제풀이 훈련단계(S4)와; 상기 문제풀이 훈련단계(S4)를 완료한 다음 나타나는 정보처리 진행수단의 정보처리 시작구간(56a)에 표기 된 정보처리 진행블록(56e)를 클릭하여 나타나는 정보처리 진행구간(56b)의 정보처리 진행영역(56f)을 통해 나 타나는 문제풀이를 완료한 강좌의 나열된 전체지문을 들려주는 읽기음성을 청취하면서 전체지문의 문장 중 상기 문제풀이 훈련단계(S4)에서 진행한 모든 문제풀이 문장을 순차적으로 찾아서 클릭하여 선정하는 정보처리 과정 을 완료한 다음 정보처리 정답블록(56h)을 클릭하여 상기 정보처리 진행구간(56b)에서 클릭한 문장과 상기 문 제풀이 훈련단계(S4)에서 진행한 실질적은 문제풀이 문장을 나타타도록 하여 정보치리 진행영역에서 진행한 정 보처리의 결과를 확인할 수 있도록 한후 정보처리 마감블록(56k)을 클릭하여 정보처리 완료구간(56d)으로 이동 하도록 한 다음 결과지 보기블록(56m)을 틀릭하여 훈련결과 확인수단으로 이동하도록 하거나 훈련종료블록 (56n)를 클릭하여 각의 강좌의 듣기훈련 종료하도록 하는 정보처리 훈련단계(S5)를 순차적으로 진행하는 것을 특징으로 한다. 또한, 상기의 정보처리 훈련단계(S5)에서 결과지 보기블록(56m)을 클릭하여 나타나는 훈련결과 확인수단을 통해 상기 문제풀이 훈련단계(S4)와 정보처리 훈련단계(S5)를 통해 진행한 비대면 듣기훈련 결과를 학인하도록 하는 것으로서, 누적듣기지수 확인영역(57b)을 통해 개별강좌에서 진행한 듣기훈련결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간을 확인함은 물론, 문제풀이결과와 정보처리결과를 진행회원의 직 전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 막대그래프와 퍼센트의 수치로 구분하며, 풀이결과 표기영역(57c)을 통해, 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 도표와 그래프로 구분하여 확인할 수 있도록 하고 문제처리결과 상세보기영역 (57d)을 통해 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 각각 구분된 구간에 따흔 문제풀이에 해한학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 확인하고, 문제풀이결과를 서론, 본론, 결론으로 구분한 구간의 결과의 점수를 그래프로 확인하도록 하여 상기에서 실시한 비대면 듣기훈련 결과를 다양하게 확 인하도록 하는 훈련결과 확인단계(S6)를 포함하는 것을 특징으로 한다. 뿐만 아니라 상기의 지문듣기 훈련단계(S3)와, 문제풀이 훈련단계(S4) 및 정보처리 훈련단계(S5)를 순차적으로 진행하는 비대면 듣기훈련 방법을 통해 진행완료한 모든강좌의 듣기훈련 결과를 상기 듣기학습 진행수단의 종합분석결과 안내블록(51i)을 클릭하여 나타나는 종합분석 관리수단을 통해 1강에서 16강 까지로 구성된 전 체강좌의 평균듣기지수와 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간 및 문학교훈 과 고사성어, 인물역사, 시사상식으로 구분하여 나의점수와 읽쓰 평균 점수는 물론, 강좌마다 진행한 듣기훈련 결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 구간별 누적학습시간 표기영역으로 구분하는 테마별 성취도를 분석하며, 개인훈련 결과설정영역을 토해 완료한 강좌와 요악노트 완료 및 포인트를 각각 선택적으로 설정하거나 검색할 기간이나 제목을 직접 기제한 다름 한 다음 확인버튼 (67d)을 클릭 개인훈련 결과확인영역을 개인훈련 결과설정영역 하단에 나타나도록하여 필요시 노트쓰기 확인버튼(68b)과 정보처리확인버튼(68c) 및 학습결과확인버튼(68d)을 클릭하여 확인하도록 하는 종합분석 확인 단계(S7)를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 살펴본 바와 같이 본 발명의 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템은 듣 기훈련 시스템을 이용하여 듣기훈련의 진행과정을 통해 이해하고 판단하는 영역의 두뇌 집중 훈련을 진행하도록 하여 듣기, 말하기, 쓰기, 읽기와 같은 언어발단단계에서 가장 기본이 되는 듣기를 훈련하여 청취집중력을 향상 시키고 읽기, 쓰기를 능력의 향상과 자기주도 학습을 완성할 수 있도록 하는 비대면 시대에 인공지능을 효율적 으로 활용한 효과를 극대화한 발명이다. 특히, 순차적으로 진행하는 본격적인 듣기훈련을 진행하기에 앞서 읽쓰 듣기지수테스트를 통해 학생의 듣기능력 을 측정하고 인공지능이 평가하여 처음 시작할 지문의 난이도를 선정해 줌으로써, 학습회원 개개인의 듣기 능력 에 적합한 듣기훈련을 진행할 수 있도록 하는 개인 맞춤형 듣기훈련 프로그램 수 있도록 하여 듣기훈련의 결과 가 효율적으로 나타나도록 하는 그 기대되는 바가 매우 큰 발명이다. 또한, 4가지의 테마(문학교훈, 인물역사, 고사성어, 시사상식)에 따라 학습회원의 이해도(문제풀이 이해도, 정 보처리 이해도)와 문제풀이 시간을 측정하여 듣기 능력(이해도와 집중도)를 파악하여 인공지능응 통해 각각의 테마별로 학생에게 올바른 듣기의 지수를 선정할 수있도록 하는 등의 다양한 효과가 있어, 사교육을 최소화하는 사회적 인프라를 구축하여 사회적 배려계층의 청소년의 기초학습능력을 향상하도록 하는 효과와 코르나-19로 인 해 사회적 거리를 유지해야 하는 사회적 환경이나 도서지역과 같은 지역적으로 물리적 환경으로 인한 온라인을 통해서만 듣기훈련이 진행 가능한 상황에서의 듣시능력을 향상시킬 수 있도록 하는 그 기대되는 바가 매우 큰 발명이다."}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술 되어 있는 상세한 설명을 통하여 더욱 명"}
{"patent_id": "10-2022-0066836", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "확해질 것이며, 그에 따라 본 발명이 속하는 기술분야에서 통상의 지식을 가진자가 본 발명의 기술적 사상을 용 이하게 실시할 수 있을 것이다. 또한, 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필 요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 하며, 이하 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를 상세히 설명하기로 한다. 도 1a는 본 발명의 바람직한 일실시 예를 보인 듣기훈련 시스템의 구성 상태 블록도이다. 도 1a에 도시된 바와 같이 본 발명에 따른 인터넷을 매개체로 하여 실시간 비대면 듣기훈련 진행방법 및 그 시 스템은 각각의 단말기를 유선 또는 무선으로 연결하는 인터넷을 매개체로 하여 듣기훈련 인공지능 시 스템에 접속하여 듣기훈련 인공지능 시스템에서 제공하는 각각의 수단을 이용하여 데이터를 교환하는 과정을 통해 듣기훈련을 도모할 수 있도록 하는 것으로서; 인터넷을 매개체로 하여 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템에 있어서; 듣기능력 향상을 원하는 학습회원과, 학습회원의 교육진행을 후원하는 후원회원과, 학습회원의 교육진행을 책임 지는 지도강사 및 학습회원의 교육진행과 지도상황을 확인하고 코치하는 관리강사로 각각 구분하여 등록할 수 있도록 하는 학습회원 등록수단과; 학습회원 등록수단을 통해 가입한 학습회원의 듣기훈련 설정레벨을 초등4학년 이하인 초저영역과 초증학교 5,6학년인 초고영역 및 중고등학교 전체를 중고영역으로 구분한 학년별레벨세트로 구분하여 총3세트로 구성한 다음 각각의 세트당 3개의 지문과 각지문당 10문항으로 구분하여 사전테스트하도록 하는 학습레벨 설정수단 과; 상기 학습레벨 설정수단을 통해 선정된 학습회원의 사전테스트 결과를, 지문의 난이도에 따라 산출되는 점수 구간과, 각각의 지문마다 문학교훈, 고사성어, 인물역사, 시사상식으로 구분되는 테마영역으로 구분되 는 각각의 지문중에 사전테스트 결과에 따라 지문을 선정하도록 하는 지문선정 관리수단과;상기 지문선정 관리수단을 통해 선정된 선정지문을 상기 학습레벨 설정수단을 통해 만들어진 사전테스트 결과에 따라 듣기배속을 결정하는 배속선정 관리수단과; 상기 지문선정 관리수단과 배속선정 관린수단으로 부터 선정된 듣기지문을 통해 듣기학습 관리수단과, 학습목표 확인수단, 관련어휘 확인수단, 지문듣기 진행수단, 문제풀이 진행수단 , 정보처리 진행수단, 훈련결과 확인수단을 통해 듣기훈련을 진행하도록 구성하는 듣기학습 진행수 단을 별도로 구성하여 포함하는 것을 특징으로 한다. 또한, 상기 듣기학습 진행수단를 통해 진행중인 강좌별 듣기지문에 대한 결과를 종합분석결과 안내블록(51 i)을 통해 확인하는 수단으로, 상단부에서 부터 회원신상과 최근학습방법이 나타나도록 하는 회원관련자료영역 과; 1강에서 16강 까지로 구성된 전체강좌의 평균듣기지수 표기와 결과지분석 가이드블록(62b)으로 구성된 결과지평 균 듣기지수영역(62a)과, 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간을 표시한 평 균학습시간표기영역(62c)과, 총획득 포인트를 표기하는 총포인트표기영역(62d)과,상부에 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 그래크표 표기한 표기하는 태마진행표기영역(62f)로 구분하여 구성한 평균누 적학습영역과; 문학교훈과 고사성어, 인물역사, 시사상식으로 구분되는 원형의 비율표로 구성하고 그 일측에 문학교훈과 고사 성어, 인물역사, 시사상식으로 구분구분하여 나의점수와 읽쓰 평균 점수를 표기하여 구성한 테마별 성취도 분석 영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 문제풀이결과를 그래 프로 나타낸 문재풀이 이해도 표기영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 듣기배속의 진행결과 를 그래프로 나타낸 듣기지수 표기영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 듣기훈련결과를 학습목표, 관 련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별 누적학 습시간 표기영역으로 구분하여 표기한 듣기평가 진행표기영역과; 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 선택적으로 설정할 수 있도록 하고, 완료한강의와 요악 노트완료 및 포인트를 각각 선택적으로 설정할 수 있도록하는 확인선택영역(67a)과, 진행완료한 듣기훈련을 진 행한 기간을 설정하는 기간설정영영(67b)과 듣기지문의 제목을 입력하도록 하는 제목입력영역(67c) 및 상기 영 역의 입력완료후 확인하는 확인버튼(67d)으로 구성한 개인훈련 결과설정영역과; 상기 결과설정영역을 통해 설정된 범위내에서의 듣기학습이 완료된 강의의 제목과 만족도, 듣기재생버튼, 학습완료날짜, 이해도를 나열한 결과인지영역(68a)과, 노트쓰기확인버튼(68b)과 정보처리확인버튼(68c) 및 학습 결과확인버튼(68d)을 구비한결과 확인버튼영역(68e)으로 구분하여 구성한 개인훈련 결과확인영역으로 각각 구분하되 모두 하나의 화면에 구성되도록 하는 종합분석 관리수단을 별도로 구성하여 포함하는 것을 특징으 로 한다. 이때, 학습회원 등록수단을 통해 가입하여 등록한 등록회원의 신상명세를 모두 저장하고 있는 등록회원 D/B와, 듣기훈련 시스템에 축적시킨 도서의 지문을 듣기훈련 레벨별로 구분하여 저장하고 있는 지문저장 D/B와, 학습회원이 진행해야 할 듣기훈련 진행수단의 진행순서와 과정을 기록저장하고 순차적으로 안내하도 록 하는 훈련안내 D/B와, 훈련안내 D/B의 안내를 받으면서 듣기훈련을 진행할 듣기학습 진행수단을 저장하고 듣기훈련 방법을 진행하도록 하는 훈련진행D/B와, 듣기학습 진행수단을 통해 진단된 개개인 학 습회원의 듣기훈련 결과에 따른 기록들을 저장하고 있는 결과저장 D/B와, 결과저장 D/B에 저장된 모든 저장 D/B와 학습회원 개개인의 결과저장 D/B 내용을 인공지능으로 구분하고 취합시킨 결과를 통합하여 분석한 결과내용을 훈련결과 분석하는 결과분석AI와, 결과분석 AI를 통해 저장된 개개인의 듣기훈련결과를 전 체 듣기훈련결과내용에 취합하여 개개인으로 구분되는 각자의 학습회원의 학습레벨을 선정하고 이를 토해도 듣 기훈련을 진행할 수 있도록 하는 학습레벨선정 AI로 구분하여 각각 저장하고 있는 듣기훈련 서버를 포 함하는 것을 특징으로 하는 듣기능력 신장을 위한 듣기훈련 인공지능 시스템을 제공함으로써, 하기에 기술하는 실시간 비대면 듣기훈련을 진행할 수 있는 것이다. (도 1a 참조) 도 1c는 본 발명의 바람직한 일실시 예를 보인 듣기훈련 방법을 도시한 블록도이다. 도 1c에 도시된 바와 같이 상기 듣기훈련 인공지능 시스템을 이용하여 학습회원의 듣기훈련을 지도하는 방 법으로 우선 학습회원 등록수단을 통해 듣기능력 향상을 원하는 학습회원과, 학습회원을 후원하는 학부모회 원 및 학습회원을 지도하는 강사회원으로 각각 구분하여 가입하는 학습회원 등록단계(SS)와; 학습회원 등록수단을 통해 가입한 신입 학습회원의 레벨을 초저학년, 초고학년, 중고학년으로 구분한 학년별 3단계의 분류레벨 중 자기의 학년에 해당하는 단계를 선택하여 총3개의 지문을 듣고 총10 문항의 문제풀이를 진 행하는 사전테스트의 결과에 대한 점수를 인공지능을 통해 미리설정한 분류점수에 대입하여 사전테스트를 진행 한 신입 학습회원의 합습레벨를 테스트하는 학습레벨 테스트단계(T1)와; 상기 학습레벨 테스트단계(T1)를 통해 설정된 신입 학습회원의 학습레벨의 점수와 동일한 점수의 지문을 인공지 능을 통해 각 지문마다 난이도에 따라 점수구간이 산출되어 분류되어 있는 전체지문 중에 4개의 테마 중 하나로 선정하여 가장 첫 지문으로 선정해주고 그 다음부터 학습레벨에 맞는 모든 지문을 순서대로 진행하도록하는 지 문선정 진행단계(T2)와; 상기 지문선정 진행단계(T2)를 통해 선정된 첫번째 지문의 읽기진행 속도를 1.3배속으로 진행하도록 설정한 다 음 차후 진행하는 각각의 강의마다 도출되는 학습회원의 수행능력에 따라 인공지능을 통해 미리설정한 수식에 대입하여 산출한 대입값에 맞는 속도의 일기진행 배속속도를 각각의 강의가 진행완료된 시점마다 적용하여 다음 강의진행시 바로 적용할 수 있도록 하는 배속레벨 설정단계(T3)를 순차적으로 진행하는 학습레벨 설정단계(S0) 와; 학습레벨 설정단계(S0)가 완료된 이후에 실질적으로 진행되는 듣기훈련 방법은 우선 로그인 후 듣기학습 관리수 단의 진행확인블록(51b)을 통해 진입한 학습목표 확인수단의 진행목표 확인영역(52a)에 나타나는 지문 의 제목과 그 제목의 이미지 사진과 진행목표를 숙지한 다음 관련어휘 이동블록(52b)을 클릭하여 마무리하는 학 습목표 숙지단계(S1)와; 상기 학습목표 숙지단계(S1)의 관련어휘 이동블록(52b)을 클릭하여 진입하는 진행강좌의 어휘확인 진행영역 (53a)에 관련된 관련어휘를 상하로 나열한 네개 내지 아홉개의 어휘블록(53b)중 풀이문장이 필요한 숙지되지 않 은 관련어휘의 어휘블록(53b)을 클릭하여 하단에 나타나는 풀이문장을 통해 관련어휘를 숙지하는 과정을 통해 각각의 훈련영역에 해당하는 관련어휘를 선제적으로 숙지하도록 한 다음 하단에 나타나는 지문듣기 이동블록 (53d)을 클릭하여 마무리하는 관련어휘 숙지단계(S2)와; 상기 관련어휘 숙지단계(S2)를 통해 화면상에 나타나는 지문듣기 진행수단의 지문듣기 진행영역(54a) 중심 부에 구성된 지문듣기 재생블록(54b)을 클릭하여 일차배속과 이차배속으로 구분하여 순차적으로 두번의 지문듣 기를 재생시켜서 듣기훈련을 진행하도록 한다음 지문듣기가 완료된 후 문제풀이 이동블록(54c)를 클릭하여 마무 리하는 지문듣기 훈련단계(S3)와; 상기 지문듣기 훈련단계(S3)를 완료한 다음 나타나는 문제풀이 시작구간(55a)의 문제풀이 안내영역(55d)을 통해 문제풀이 진행방법을 숙지한 다음 문제풀이 시작블록(55e)를 클릭하여 나타나는 문제풀이 진행구간(55b)의 질 문내용을 읽고 난다음 그 하단에 나열된 보기답안중 정답답안의 답안선택블록(55i)를 클릭한 다음 하단에 구성 된 문제풀이 진행블록(55g)를 클릭하는 문제풀이 훈련을 각각의 강좌별로 구성된 다수의 답안선택내용을 순차적 으로 풀이하는 문제풀이 훈련과정을 진행하되 답안선택블록(55i)에 제시된 3분의 시간내에 완료도록 하며, 모든 답안선택을 완료하거나 3분이 지나면 나타나는 풀이결과 지문영역(55j)에 나열된 풀이결과 지문을 통해 전체 문 항중 틀린문항수를 확인한 다음 정보처리 이동블록(55k)을 클릭하여 마무리하는 문제풀이 훈련단계(S4)와; 상기 문제풀이 훈련단계(S4)를 완료한 다음 나타나는 정보처리 진행수단의 정보처리 시작구간(56a)에 표기 된 정보처리 진행블록(56e)를 클릭하여 나타나는 정보처리 진행구간(56b)의 정보처리 진행영역(56f)을 통해 나 타나는 문제풀이를 완료한 강좌의 나열된 전체지문을 들려주는 읽기음성을 청취하면서 전체지문의 문장 중 상기 문제풀이 훈련단계(S4)에서 진행한 모든 문제풀이 문장을 순차적으로 찾아서 클릭하여 선정하는 정보처리 과정 을 완료한 다음 정보처리 정답블록(56h)을 클릭하여 상기 정보처리 진행구간(56b)에서 클릭한 문장과 상기 문 제풀이 훈련단계(S4)에서 진행한 실질적은 문제풀이 문장을 나타타도록 하여 정보치리 진행영역에서 진행한 정 보처리의 결과를 확인할 수 있도록 한후 정보처리 마감블록(56k)을 클릭하여 정보처리 완료구간(56d)으로 이동하도록 한 다음 결과지 보기블록(56m)을 틀릭하여 훈련결과 확인수단으로 이동하도록 하거나 훈련종료블록 (56n)를 클릭하여 각의 강좌의 듣기훈련 종료하도록 하는 정보처리 훈련단계(S5)를 순차적으로 진행하는 것을 특징으로 한다. 즉 본 발명의 듣기훈련 인공지능 시스템을 활용하기 위해서는 우선적으로 본인인증을 통해 온라인으로 회 원등록을 필수적으로 진행하여야 하는 것으로 상기 학습회원 등록수단은 독해능력 향상을 원하는 학습회원으 로 가입하여 본 발명에서 진행하는 독해능력을 향상하기위한 시스템을 체험하도록 하는 학습회원과, 학습회원의 등록비용을 결재하거나 교육활동의 내용과 결과 등을 확인하고 후원하면서도 강사회원과 교류가 이루어질 수 있 도록 하는 후원회원과, 학습회원의 독해훈련을 지도하고 독해훈련 과정을 관리 감독하고 점검하는 지도강사와, 학습회원의 독해훈련 교육진행과정 전체를 점검함은 학습회원의 현재 읽기능력 레벨을 파악하여 지도강사와 후 원회원과의 교류를 통해 지도방향을 안내하고 진행하도록 하는 관리강사로 각각 구분하여 가입할 수 있도록 구 성함으로써, 학습회원 등록수단을 통해 각각 가입하는 학습회원 등록단계(SS)가 이루어지도록 하는 가입절차 와 가입방법은 본인인증을 통한 통상적인 온라인 가입방법을 이용하는 것이다. 이와 같이 각각 세분화하여 가입한 회원의 신상은 본 발명의 듣기훈련 서버의 등록회원 D/B에 자동 저 장되어 차후 본 발명의 듣기훈련 인공지능 시스템을 활용할 수 있는 것으로 이는 독해능력 향상을 원하는 학습회원과, 학습회원을 후원하는 학부모회원 및 학습회원을 지도하는 강사회원으로 각각 구분하여 가입하는 학 습회원 등록단계(SS)를 진행할 수 있도록 하는 온라인으로 가입하는 회원등록의 통상적인 방법이므로 더 이상의 설명은 생략하기로 한다. 또한, 학습레벨 설정수단은 학습회원 등록수단을 통해 가입한 학습회원의 듣기훈련 설정레벨을 초등4학년 이하인 초저영역과 초증학교 5,6학년인 초고영역 및 중고등학교 전체를 중고영역으로 구분한 학년별레벨세트로 구분하여 총3세트로 구성한 다음 각각의 세트당 3개의 지문과 각지문당 10문항으로 구분하여 사전테스트하도록 하는 학습레벨 테스트단계(T1)를 진행하도록 하는 수단임을 알 수 있다. 즉, 학습레벨 테스트단계(T1)는 상기 학습회원 등록수단을 통해 가입한 신입 학습회원의 레벨을 초저학년, 초고학년, 중고학년으로 구분한 학년별 3단계의 분류레벨 중 자기의 학년에 해당하는 단계를 선택하여 총3개의 지문을 듣고 총10 문항의 문제풀이를 진행하는 사전테스트의 결과에 대한 점수를 인공지능을 통해 미리설정한 분류점수에 대입하여 사전테스트를 진행한 신입 학습회원의 합습레벨를 테스트하여 인공지능을 통해 전체회원의 테스트결과와 비교 분석하여 학습회원의 듣기훈련 진입시점의 학습레벨을 설정하도록 하는 단계이다. 이때, 테스트 지문을 총 3개 세트로 하고 각 세트당 10개의 질문문항을 설정하고 기본점수를 150점에서 시작하 여 1문할 맞힐 때 마다 10점을 가산하고 고난도 문항은 20점으로 배점하여 초저학년의 산정기준점을 최저 150점 에서 최고 280점으로 설절하고, 초고학년의 산정기준점을 최저 250점에서 최고 380으로 설정하며. 중고학연의 산정기준점을 최저 350에서 최고 480점으로 설정하여 학년에 맞는 레벨을 설정할 수 있도록 하는 단계임을 알 수 있다. 뿐만 아니라 상기 지문선정 관리수단은 상기 학습레벨 설정수단을 통해 선정된 학습회원의 사전테스트 결과를, 지문의 난이도에 따라 산출되는 점수구간과, 각각의 지문마다 문학교훈, 고사성어, 인물역사, 시사 상식으로 구분되는 테마영역으로 구분되는 각각의 지문중에 사전테스트 결과에 따라 지문을 선정하는 지문 선정 진행단계(T2)를 진행하도록 하는 수단임을 알 수 있다. 즉, 지문선정 진행단계(T2)는 상기 학습레벨 테스트단계(T1)를 통해 설정된 신입 학습회원의 학습레벨의 점수와 동일한 점수의 지문을 인공지능을 통해 각 지문마다 난이도에 따라 점수구간이 산출되어 분류되어 있는 전체지 문 중에 4개의 테마 중 하나로 선정하여 가장 첫 지문으로 선정해주고 그 다음부터 학습레벨에 맞는 모든 지문 을 순서대로 진행하도록하는 학습레벨을 설정하도록 하는 단계이다. 이때, 각 지문마다 난이도에 따라 점수구간이 20점으로 산정하고, 각 지문마다 4개의 테마 중 하나로 선정하도 록 하며, 사전테스트를 통해 자신의 점수에 맞는 가장 첫 지문을 선정해주고 그 다음은 순서대로 모든 지문이 다 보이도록 하는 것이 바람직할 것이다.그리고, 상기 배속선정 관리수단은 상기 지문선정 관리수단을 통해 선정된 선정지문을 상기 학습레벨 설 정수단을 통해 만들어진 사전테스트 결과에 따라 듣기배속을 결정하는 배속레벨 설정단계(T3)를 진행하도록 하는 수단임을 알 수 있다. 즉, 배속레벨 설정단계(T3)은 상기 지문선정 진행단계(T2)를 통해 선정된 첫번째 지문의 읽기진행 속도를 1.3배 속으로 진행하도록 설정한 다음 차후 진행하는 각각의 강의마다 도출되는 학습회원의 수행능력에 따라 인공지능 을 통해 미리설정한 수식에 대입하여 산출한 대입값에 맞는 속도의 일기진행 배속속도를 각각의 강의가 진행완 료된 시점마다 적용하여 다음 강의진행시 바로 적용할 수 있도록 하는 단계이다. 이때, 듣기배속을 듣기지수로 하여 산출하는 산출식으로 듣기지수를 조절하는 기준으로 하기에 기술되는 듣기지 문에서 진행되는 두번의 듣기의 기준을 학습레벨에 따라 레벨이 낮은 하위레벨에서부터 1.3배속과 1배속, 1.4배 속과 1.1배속, 1.5배속과 1.2배속, 1.6배속과 1.3배속, 1.7배속과 1.4배속, 1.8배속과 1.5배속으로 점점 듣기지 수를 높여가는 것이 바람직할 것이다. 상기 듣기학습 진행수단은 본원발명이 핵심구성이자 수단으로 상기 지문선정 관리수단과 배속선정 관린수 단으로 부터 선정된 학습회원에 맞도록 설정된 학습레벨 맞는 듣기지문을 통해 듣기학습 관리수단과, 학 습목표 확인수단, 관련어휘 확인수단, 지문듣기 진행수단, 문제풀이 진행수단, 정보처리 진행 수단, 훈련결과 확인수단으로 구분하여 순차적으로 듣기훈련이 진행하도록 하는 수단이다. 우선, 상기 듣기학습 관리수단은 상단부 좌측에 학습회원이 진행환료한 훈련내용을 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 나타낸 회원별 진행완료표시영역(51c)과, 상단부 우측에 학습회원이 진행환료 한 훈련내용중 선택하여 재도전 할 수 있도록 하는 지난학습 재도전진행창을 소환하는 재도전진행블록(51d)과, 진행회원이 인터넷을 통해 가입하여 로그인한 상태의 진행사이트 홈페이지 전체화면으로 이동하도록 하는 홈페 이지복귀블록(51e)과, 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)으로 구성한 훈련 진행 기본영역(5a)과, 중심부에 인공지능이 선정한 지문의 제목을 나열시킨 진행확인블록(51b) 하단부에 태마, 학습목적, 원작국가, 지문글자수 등으로 태그로 구분한 상식문제의 주제를 나열시킨 훈련진행 확인영역(51a)과, 하단부 일측에 진행확인영역()에 나열된 상식문제를 풀이할 수 있도록 안내하는 모의고사진행블록(51h)과, 상기 종합분석 관리수단으로 안내하는 종합분석결과 안내블록(51i)으로 이루어 진다. (도 2 참조) 상기 듣기학습 관리수단의 훈련진행 확인영역(51a)을 클릭하여 관련어휘 숙지단계(S2)를 진행하는 학습목표 확인수단으로 진입하도록 하고, 재도전진행블록(51d)을 클릭하여 지난학습 재도전진행창()을 소환하여 지금 까지 진행한 듣기훈련중 필요로하는 듣기훈련을 다시한번 진행할 수 있도록 하며, 종합분석결과 안내블록(51i) 을 클릭하여 소환된 종합분석 관리수단을 통해 학습회원의 확습결과와 그에따른 훈련진행방향을 설정할 수 있도록 하는 듣기학습 진행순단의 시작과 끝을 관리하는 수단임을 알 수 있다. 또한, 학습목표 확인수단은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분 하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5 c)을 구비한 진행구간 확인영역(5b)과, 중심부에 인공지능이 선정한 지문의 제목과 그 제목의 이미지 사진과 진 행목표를 문장으로 나열시킨 진행목표 확인영역(52a)과, 하단부에 관련어휘 확인수단으로 이동하는 관련어 휘 이동블록(52b)으로 구성된다.(도3 참조) 상기와 같이 구성되는 학습목표 확인수단을 이용하여 학습목표 숙지단계(S1)를 진행하는 것으로써, 학습레 벨 설정단계(S0)가 완료된 이후에 실질적으로 진행되는 듣기훈련 방법은 우선 로그인 후 듣기학습 관리수단(5 1)의 진행확인블록(51b)을 통해 진입한 학습목표 확인수단의 진행목표 확인영역(52a)에 나타나는 지문의 제 목과 그 제목의 이미지 사진과 진행목표를 숙지한 다음 관련어휘 이동블록(52b)을 클릭하는 본격적인 듣기훈련 을 진행하기전에 듣기훈련을 진행할 학습목표를 숙지하는 수단임과 동시에 훈련단계임을 알 수 있다.관련어휘 확인수단은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진 행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비 한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 상하로 나열된 4~9개의 어휘블록(53b)을 클릭하는 순서대로 하단부에 어휘의 뜻을 나열하는 풀이문장이 나타나 도록 하는 어휘뜻 풀이영역(53c)으로 구성하는 어휘확인 진행영역(53a)과, 하단부에 지문듣기 진행수단으로 이동하는 지문듣기 이동블록(53d)으로 구성한된다. (도 4 참조) 상기와 같이 구성되는 관련어휘 확인수단을 이용하여 관련어휘 숙지단계(S2)를 진행하는 것으로써, 우선 관련어휘 숙지단계(S2)의 관련어휘 이동블록(52b)을 클릭하여 진입하는 진행강좌의 어휘확인 진행영역(53a)에 관련된 관련어휘를 상하로 나열한 네개 내지 아홉개의 어휘블록(53b)중 풀이문장이 필요한 숙지되지 않은 관련 어휘의 어휘블록(53b)을 클릭하여 하단에 나타나는 풀이문장을 통해 관련어휘를 숙지하는 과정을 통해 각각의 훈련영역에 해당하는 관련어휘를 선제적으로 숙지하도록 한 다음 하단에 나타나는 지문듣기 이동블록(53d)을 클 릭하여 마무리하는 단계이다. 이러한 관련어휘 숙지단계(S2)를 진행하는 과정을 통해 각각의 훈련영역에 해당하는 관련어휘를 선제적으로 숙 지하도록 하여 차후 진행될 듣기훈련을 진행할 듣기강좌의 듣기문장의 단어와 뜻을 선재적로 숙지하는 듣기훈련 준비단계로 듣기훈련시 어휘의 뜻을 정확히 파악하여 듣기훈련이 용이하게 진행되도록 하는 수단임과 동시에 훈 련단계임을 알 수 있다. 또한, 지문듣기 진행수단은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분 하여 진행중인 상태를 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃 블록(5c)을 구비한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시 키고, 중심부에 일차배속과 이차배속으로 구분하여 순차적으로 들을 수 있도록 지문듣기를 진행하는 지문듣기 재생블록(54b) 구비하고 지문듣기 진행방법을 문장으로 나열시킨 지문듣기 진행영역(54a)과, 하단부에 문제풀이 진행수단으로 이동하는 문제풀이 이동블록(54c)으로 구성한다.(도 5 참조) 상기와 같이 구성되는 지문듣기 진행수단을 이용하여 지문듣기 훈련단계(S3)를 진행하는 것으로써, 우선 상 기 관련어휘 숙지단계(S2)를 통해 화면상에 나타나는 지문듣기 진행수단의 지문듣기 진행영역(54a) 중심부 에 구성된 지문듣기 재생블록(54b)을 클릭하여 일차배속과 이차배속으로 구분하여 순차적으로 두번의 지문듣기 를 재생시켜서 듣기훈련을 진행하도록 한다음 지문듣기가 완료된 후 문제풀이 이동블록(54c)를 클릭하여 마무리 하는 단계이다. 즉, 듣기 재생블록(54b)을 클릭하여 진행하는 일차배속의 속도를 낮은 하위레벨의 배속을 1.3배속으로 하여 0.1 배속씩 빠르게 진행하고 이차배속 또한 최하위 레벨의 배속을 1배속에서 부터 0.1배속씩 빠르게 진행하는 조건 으로 듣기지수를 진행하도록 하는 걱이 바람직할 것이다. 문제풀이 진행수단은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진 행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비 한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 문제풀이의 진행방법을 문장으로 나열시킨 문제풀이 안내영역(55d)과, 하단부에 문제풀이를 진행하도록 하는 문제풀이 시작블록(55e)으로 구성한 문제풀이 시작구간(55a)과;(도 6a 참조) 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목 아래에 전체문항중 정답을 제출한 문항비율을 막대그래프로 표기한 문제풀이 수행그래프(55h)를 나열시키고, 중심부에 듣기 완료한 지문에 포함하는 내용의 질문내용과 사지선택으로 선택할 수 있는 답안선택블록(55i)을 구비한 다수의 답안선택내용으로 구성한 문제풀 이 진행영역(55f)과, 하단부에 문제풀이 진행시간의 남은시간을 실시간으로 도출하면서 답안선택 완료후 다음 문제풀이 완료구간(55c)으로 넘어가도록 클릭할 수 있도록 하는 문제풀이 진행블록(55g)으로 구성한 문제풀이 진행구간(55b)과;(도 6b 참조)상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 문제풀이 진행구간 (55b)에서 진행한 결과를 문장으로 나열시킨 풀이결과 지문영역(55j)과, 하단부에 정보처리 진행수단으로 이동하는 정보처리 이동블록(55k)으로 구성한 문제풀이 완료구간(55c)으로 구분하여 구성하는 수단이다.(도 6c 참조) 상기와 같이 구성되는 문제풀이 진행수단을 이용하여 진행하는 문제풀이 훈련단계(S4)는 우선 상기 지문듣 기 훈련단계(S3)를 완료한 다음 나타나는 문제풀이 시작구간(55a)의 문제풀이 안내영역(55d)을 통해 문제풀이 진행방법을 숙지한 다음 문제풀이 시작블록(55e)를 클릭하여 나타나는 문제풀이 진행구간(55b)의 질문내용을 읽고 난다음 그 하단에 나열된 보기답안중 정답답안의 답안선택블록(55i)를 클릭한 다음 하단에 구성된 문제풀 이 진행블록(55g)를 클릭하는 문제풀이 훈련을 각각의 강좌별로 구성된 다수의 답안선택내용을 순차적으로 풀이 하는 문제풀이 훈련과정을 진행하되 답안선택블록(55i)에 제시된 3분의 시간내에 완료도록 하며, 모든 답안선택 을 완료하거나 3분이 지나면 나타나는 풀이결과 지문영역(55j)에 나열된 풀이결과 지문을 통해 전체 문항중 틀 린문항수를 확인한 다음 정보처리 이동블록(55k)을 클릭하여 마무리하는 진행단계임을 알 수 있다. 이때, 상기 문제풀이 훈련단계(S4)를 진행하는 문제풀이 진행수단의 문제풀이 진행구간(55b)의 전체 문항수 는 점수의 난이도가 기본인 5문항을 기본으로하여 지문점수에 따라 300에서 500점 사이에는 고난이도의 1문항을 추가한 전체 6문항을 500점 이상인 경우 고난이도 2문항을 추가한 전체 7문항으로 구성하여 진행하는 단계이다. 정보처리 진행수단은 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진 행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비 한 진행구간 확인영역(5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 정보처리의 진행시작을 나열시킨 문장과 정보처리 진행진행하도록 하는 정보처리 진행블록(56e)으로 구성한 정 보처리 시작구간(56a)과;(도 7a 참조) 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 지문듣기와 문제풀이를 완료한 강좌의 제목과 전체지문을 나열하고 나열된 전체지문을 음성으로 들려주는 정보처리 진행영역(56f)과 그 상단에 전체문제풀이 수량과 정보처리 진행영역(56f)의 전체지문중 선정문장의 수량을 나열시킨 정보처리 안내 영역(56g)을 그 하단에 선정문장의 선택결과를 확인하는 정보처리 확인구간(56c)으로 이동하도록 하는 정보처리 정답블록(56h)으로 구성한 정보처리 진행구간(56b)과;(도 7b 참조) 상단부 좌측에부터 학습목표, 어휘학습, 지문듣기, 문제풀이, 정보처리로 구분하여 진행중인 상태를 나타내고 우측에 본원의 로그인 이전 홈페이지로 이동하도록 하는 홈페이지아웃블록(5c)을 구비한 진행구간 확인영역 (5b)과, 중심부 상단좌측에 듣기훈련을 진행할 지문의 강의제목을 나열시키고, 중심부에 정보처리 진행구간 (56b)을 통해 선택한 선정문장과 정답문장를 동시에 나타나도록 하는 강좌의 제목과 전체지문을 나열시킨 정보 처리 정답영역(56i)과 그 상단에 전체문제풀이 수량과 정보처리 진행구간(56b)을 통해 선택한 선정문장과 정답 문장이 일치하는 수량을 나열시킨 정보처리 확인영역(56j)을 그 하단에 정보처리 확인내용을 마무리하고 선정문 장의 선택결과를 확인하는 정보처리 완료구간(56d)으로 이동하도록 하는 정보처리 마감블록(56k)으로 구성한 정 보처리 확인구간(56c)과;(도 7c 참조) 중심부에 정보처리 확인구간(56c)을 통해 마감한 정보처리결과에 대한 마감안내 문구와 정보처리결과의 만족도 를 스스로 선책할수 있도록 구성한 다수의 별표로 구성한 별점선택블록(56l)과, 하단부 일측에 훈련결과 확인수 단으로 이동하도록 하는 결과지 보기블록(56m)과 상기 각각의 수단을 통해 진행한 강의별 듣기학습 진행수 단을 마무리하고 다음 강의로 이동하도록 하는 훈련종료블록(56n)으로 구성한 정보처리 완료구간(56d)으로 구분 하여 구성하는 수단이다.(도 7d 참조) 상기와 같이 구성되는 정보처리 진행수단을 이용하여 정보처리 훈련단계(S5)를 진행하는 것으로써, 상기 문 제풀이 훈련단계(S4)를 완료한 다음 나타나는 정보처리 진행수단의 정보처리 시작구간(56a)에 표기된 정보 처리 진행블록(56e)를 클릭하여 나타나는 정보처리 진행구간(56b)의 정보처리 진행영역(56f)을 통해 나타나는 문제풀이를 완료한 강좌의 나열된 전체지문을 들려주는 읽기음성을 청취하면서 전체지문의 문장 중 상기 문제풀이 훈련단계(S4)에서 진행한 모든 문제풀이 문장을 순차적으로 찾아서 클릭하여 선정하는 정보처리 과정을 완료 한 다음 정보처리 정답블록(56h)을 클릭하여 상기 정보처리 진행구간(56b)에서 클릭한 문장과 상기 문제풀이 훈련단계(S4)에서 진행한 실질적은 문제풀이 문장을 나타타도록 하여 정보치리 진행영역에서 진행한 정보처리의 결과를 확인할 수 있도록 한후 정보처리 마감블록(56k)을 클릭하여 정보처리 완료구간(56d)으로 이동하도록 한 다음 결과지 보기블록(56m)을 틀릭하여 훈련결과 확인수단으로 이동하도록 하거나 훈련종료블록(56n)를 클 릭하여 각의 강좌의 듣기훈련 종료하도록 하는 단계임을 알 수 있다. 상기와 같이 구성되는 듣기학습 관리수단과, 학습목표 확인수단, 관련어휘 확인수단, 지문듣기 진 행수단, 문제풀이 진행수단, 정보처리 진행수단을 통해 학습목표 숙지단계(S1)와, 관련어휘 숙지단 계(S2), 지문듣기 훈련단계(S3), 문제풀이 훈련단계(S4), 정보처리 훈련단계(S5)를 순차적으로 진행하는 듣기 훈련 진행방법을 통해 본원에서 이루고자하는 듣기훈련을 완성하는 진행수단과 진행단계임을 알 수 있다. 그리고, 훈련결과 확인수단은 상기 정보처리 진행수단을 통해 진행완료한 개별강좌에 대한 결과를 결과 지 보기블록(56m)를 통해 확인하는 수단으로, 상단부 일측에 개별강좌의 듣기훈련을 진행한 지문의 강의제목과 그 강의의 진행회차를 나열시키고 타측에 가입회원의 회원신상과 학습진행 일자 및 학습방법을 나열한 개별강좌 기본자료자료영역(57a)과; 개별강좌의 진행테마와 듣기지수 표기와 개별결과지 가이드블록(57f)으로 구성된 개별결과지 듣기지수영역(57 e)과, 듣기지수를 진행태마별로 구분하여 진행한 테마별 듣기지수 표기영역(57g)과 획득 포인트를 표기하는 포 인트표기영역(57h)으로 구분하여 구성한 누적듣기지수 확인영역(57b)과; 개별강좌에서 진행한 듣기훈련결과를 듣기학습 진행시간을 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리 에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별학습시간 표기영역(57i)과, 이를 강좌지문의 제목과, 테마, 듣기지수, 지문의 총글자수, 소요시간, 문제풀이 이해도, 정보처리 이해도 및 총학습소요시간을 문장으로 나타낸 누적학습내용 표기영역(57j)과, 문제풀이결과와 정보처리결과를 진행회원의 직전결과와 평균결 과를 학년평균결과로 구분하여 비교하도록 막대그래프로 표기한 풀이결과 그래프비교공간(57k)과 문제풀이결과 와 정보처리결과를 진행회원의 직전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 %의 수치로 표기한 풀이결과 수치비교공간(57l)으로 구분하여 표기한 풀이결과 표기영역(57c)과; 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 각각 구분된 구간에 따흔 문제풀이에 해한 학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 나열시킨 문제풀이결과 표기영역(57m)과, 문제풀이결과를 서 론, 본론, 결론으로 구분한 구간의 결과의 점수를 그래프로 표기한 구간별결과 그래프표기영역(57n)과, 정보처 리결과를 별도의 정보처리결과지를 화면으로 불러오는 정보처리 결과보기블록(57p)으로 나누어 나열하는 문제처 리결과 상세보기영역(57d)으로 구분하여 구성하는 훈련결과 확인수단으로 각각 구성되어 하나의 화면에 나 타난다.(도 8 참조) 상기와 같이 구성되는 훈련결과 확인수단을 이용하여 훈련결과 확인단계(S6)를 진행하는 것으로써, 우선 상 기의 정보처리 훈련단계(S5)에서 결과지 보기블록(56m)을 클릭하여, 모니터 화면에 나타나는 훈련결과 확인수단을 통해 상기 문제풀이 훈련단계(S4)와 정보처리 훈련단계(S5)를 통해 진행한 비대면 듣기훈련 결과를 학인하도록 하는 것으로서, 누적듣기지수 확인영역(57b)을 통해 개별강좌 에서 진행한 듣기훈련결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간을 확인함은 물 론, 문제풀이결과와 정보처리결과를 진행회원의 직전결과와 평균결과를 학년평균결과로 구분하여 비교하도록 막 대그래프와 퍼센트의 수치로 구분하며, 풀이결과 표기영역(57c)을 통해, 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 학생의 답과 정답을 비 교하고 그 결과에 대한 정답률과 결과를 도표와 그래프로 구분하여 확인할 수 있도록 하고 문제처리결과 상세보 기영역(57d)을 통해 문제풀이결과를 서론, 본론, 결론의 구간으로 구분하여 각각 구분된 구간에 따흔 문제풀이 에 해한 학생의 답과 정답을 비교하고 그 결과에 대한 정답률과 결과를 확인하고, 문제풀이결과를 서론, 본론, 결론으로 구분한 구간의 결과의 점수를 그래프로 확인하도록 하여 상기에서 실시한 비대면 듣기훈련 결과를 다양하게 확인하도록 하는 훈련결과 확인단계(S6)를 진행한다. 뿐만 아니라 종합분석 관리수단은 상기 듣기학습 진행수단를 통해 진행중인 강좌별 듣기지문에 대한 결과 를 종합분석결과 안내블록(51i)을 통해 확인하는 수단으로, 상단부에서 부터 회원신상과 최근학습방법이 나타나 도록 하는 회원관련자료영역과; 1강에서 16강 까지로 구성된 전체강좌의 평균듣기지수 표기와 결과지분석 가이드블록(62b)으로 구성된 결과지평 균 듣기지수영역(62a)과, 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간을 표시한 평 균학습시간표기영역(62c)과, 총획득 포인트를 표기하는 총포인트표기영역(62d)과,상부에 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 그래크표 표기한 표기하는 태마진행표기영역(62f)로 구분하여 구성한 평균누 적학습영역과; 문학교훈과 고사성어, 인물역사, 시사상식으로 구분되는 원형의 비율표로 구성하고 그 일측에 문학교훈과 고사 성어, 인물역사, 시사상식으로 구분구분하여 나의점수와 읽쓰 평균 점수를 표기하여 구성한 테마별 성취도 분석 영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 문제풀이결과를 그래 프로 나타낸 문재풀이 이해도 표기영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 테마별 듣기배속의 진행결과 를 그래프로 나타낸 듣기지수 표기영역과; 1강에서 16강 까지로 구성된 전체강좌를 나열하여 각각의 강의에 강좌마다 진행한 듣기훈련결과를 학습목표, 관 련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용을 그래프로 구분하여 나타내는 구간별 누적학 습시간 표기영역으로 구분하여 표기한 듣기평가 진행표기영역과; 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 선택적으로 설정할 수 있도록 하고, 완료한강의와 요악 노트완료 및 포인트를 각각 선택적으로 설정할 수 있도록하는 확인선택영역(67a)과, 진행완료한 듣기훈련을 진 행한 기간을 설정하는 기간설정영영(67b)과 듣기지문의 제목을 입력하도록 하는 제목입력영역(67c) 및 상기 영 역의 입력완료후 확인하는 확인버튼(67d)으로 구성한 개인훈련 결과설정영역과; 상기 결과설정영역을 통해 설정된 범위내에서의 듣기학습이 완료된 강의의 제목과 만족도, 듣기재생버튼, 학습완료날짜, 이해도를 나열한 결과인지영역(68a)과, 노트쓰기확인버튼(68b)과 정보처리확인버튼(68c) 및 학습 결과확인버튼(68d)을 구비한결과 확인버튼영역(68e)으로 구분하여 구성한 개인훈련 결과확인영역으로 각각 구분하되 모두 하나의 화면에 구성되도록 하는 별도의 수단임을 알 수 있다.(도 9 참조) 상기와 같이 구성되는 종합분석 관리수단을 이용하여 진행하는 종합분석 확인단계(S7)를 진행하는 것으로써, 모든강좌의 듣기훈련 결과를 상기 듣기학습 진행수단의 종합분석결과 안내블록(51i)을 클릭하여 나타나는 1 강에서 16강 까지로 구성된 전체강좌의 평균듣기지수와 학습목표, 어휘확인, 지문듣기, 문제풀이, 정보처리의 평균누적학습시간 및 문학교훈과 고사성어, 인물역사, 시사상식으로 구분하여 나의점수와 읽쓰 평균 점수는 물 론, 강좌마다 진행한 듣기훈련결과를 학습목표, 관련어휘, 지문듣기, 문제풀이, 정보처리에 소요된 시간의 결과내용 을 구간별 누적학습시간 표기영역으로 구분하는 테마별 성취도를 분석하며, 개인훈련 결과설정영역을 토해 완료한 강좌와 요악노트완료 및 포인트를 각각 선택적으로 설정하거나 검색 할 기간이나 제목을 직접 기제한 다름 한 다음 확인버튼(67d)을 클릭 개인훈련 결과확인영역을 개인훈련 결 과설정영역 하단에 나타나도록하여 필요시 노트쓰기확인버튼(68b)과 정보처리확인버튼(68c) 및 학습결과확 인버튼(68d)을 클릭하여 확인하도록 하는 확인단계임을 알 수 있다. 이상 상기와 구성되어 진행하는 학습목표 확인수단, 관련어휘 확인수단, 지문듣기 진행수단, 문제 풀이 진행수단, 정보처리 진행수단, 훈련결과 확인수단으로 구성된 듣기훈련 시스템을 제공함으로 써, 학습목표 숙지단계(S1)와, 관련어휘 숙지단계(S2), 지문듣기 훈련단계(S3), 문제풀이 훈련단계(S4), 정보처 리 훈련단계(S5)를 순차적으로 진행하는 듣기훈련방법을 통해 학습회원의 듣기훈련의 종합적인 진행결과를 인공 지능을 통해 종합분석한 내용을 기준으로 학습회원의 듣기훈련레벨을 설정하도록 함으로써, 듣기훈련의 진행과 정을 통해 이해하고 판단하는 영역의 두뇌 집중 훈련을 진행하도록 하여 듣기, 말하기, 쓰기, 읽기와 같은 언어 발단단계에서 가장 기본이 되는 듣기를 훈련하여 청취집중력을 향상시키고 읽기, 쓰기를 능력의 향상과 자기주 도 학습을 완성할 수 있도록 하는 인공지능을 이용한 실시간 비대면 듣기훈련 진행방법 및 그 시스템을 제공하 기 함으로써, 학생의 듣기능력을 측정하고 인공지능이 평가하여 처음 시작할 지문의 난이도를 선정해 줌으로써,학습회원 개개인의 듣기 능력에 적합한 듣기훈련을 진행할 수 있도록 하는 개인 맞춤형 듣기훈련 프로그램 수 있도록 하여 듣기훈련의 결과가 효율적으로 나타나도록 하며, 4가지의 테마(문학교훈, 인물역사, 고사성어, 시 사상식)에 따라 학습회원의 이해도(문제풀이 이해도, 정보처리 이해도)와 문제풀이 시간을 측정하여 듣기 능력 (이해도와 집중도)를 파악하여 인공지능응 통해 각각의 테마별로 학생에게 올바른 듣기의 지수를 선정할 수있도 록 하는 등의 다양한 효과가 있어, 사교육을 최소화하는 사회적 인프라를 구축하여 사회적 배려계층의 청소년의 기초학습능력을 향상하도록 하는 효과와 코르나-19로 인해 사회적 거리를 유지해야 하는 사회적 환경이나 도서 지역과 같은 지역적으로 물리적 환경으로 인한 온라인을 통해서만 듣기훈련이 진행 가능한 상황에서의 듣시능력 을 향상시킬 수 있도록 하는 그 기대되는 바가 매우 큰 발명이다."}
{"patent_id": "10-2022-0066836", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 발명의 바람직한 일실시 예를 보인 듣기훈련 시스템의 구성 상태 블록도. 도 1b는 본 발명의 바람직한 일실시 예를 보인 듣기훈련 시스템의 듣기학습 진행수단의 상세구성 블록도. 도 1c는 본 발명의 바람직한 일실시 예를 보인 듣기훈련 방법을 도시한 블록도. 도 1d는 본 발명의 바람직한 일실시 예를 보인 듣기훈련 방법의 진행 순서를 도시한 듣기훈련 진행 흐름도. 도 2는 본 발명의 바람직한 일실시 예를 보인 듣기학습 훈련수단에서 제공하는 구조 창. 도 3은 본 발명의 바람직한 일실시 예를 보인 학습목표 확인수단에서 제공하는 구조 창. 도 4는 본 발명의 바람직한 일실시 예를 보인 관련어휘 확인수단에서 제공하는 구조 창.도 5는 본 발명의 바람직한 일실시 예를 보인 지문듣기 진행수단에서 제공하는 구조 창. 도 6a는 본 발명의 바람직한 일실시 예를 보인 문제풀이 진행수단에서 제공하는 문제풀이 시작구간을 도시한 구 조 창. 도 6b는 본 발명의 바람직한 일실시 예를 보인 문제풀이 진행수단에서 제공하는 문제풀이 진행구간을 도시한 구 조 창. 도 6c는 본 발명의 바람직한 일실시 예를 보인 문제풀이 진행수단에서 제공하는 문제풀이 완료구간을 도시한 구 조 창. 도 7a는 본 발명의 바람직한 일실시 예를 보인 정보처리 진행수단에서 제공하는 정보처리 시작구간을 도시한 구 조 창. 도 7b는 본 발명의 바람직한 일실시 예를 보인 정보처리 진행수단에서 제공하는 정보처리 진행구간을 도시한 구 조 창. 도 7c는 본 발명의 바람직한 일실시 예를 보인 정보처리 진행수단에서 제공하는 정보처리 확인구간을 도시한 구 조 창. 도 7d는 본 발명의 바람직한 일실시 예를 보인 정보처리 진행수단에서 제공하는 정보처리 완료구간을 도시한 구 조 창. 도 8은 본 발명의 바람직한 일실시 예를 보인 훈련결과 확인수에서 제공하는 구조 창. 도 9는 본 발명의 바람직한 일실시 예를 보인 종합분석 관리수단에서 제공하는 구조 창."}
