{"patent_id": "10-2020-0081395", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0003773", "출원번호": "10-2020-0081395", "발명의 명칭": "음성통신 서비스의 상호 인증 방법 및 장치", "출원인": "(주)이스톰", "발명자": "우종현"}}
{"patent_id": "10-2020-0081395", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "음성통신 서비스 상호 인증 방법으로서,사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소프트웨어 또는 단말기의 고유값과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등록해 놓는 단계; 해당 음성통신 서비스를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통신 서비스로 접속을 시도하면, 해당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또는 단말기의 고유값을 자동으로인식하는 단계;해당 고유값과 관련하여 인증코드값을 생성한 후 사용자가 접속한 음성통신 서비스 채널로 들려주면서, 해당 고유값과 관련된 인증기로 음성통신 확인용 인증코드값을 전송하거나 생성하도록 명령을 전달하는 단계;를 포함하되,사용자가 음성통신 채널로 들은 인증코드값과 인증기가 표시하는 인증코드값이 같은 경우, 상기 사용자는 현재통화중인 상대방과의 통화가 보이스 피싱이 아닌 통화임을 확인하게 되는 것을 특징으로 하는, 음성통신 서비스상호 인증 방법."}
{"patent_id": "10-2020-0081395", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "음성통신 서비스 상호 인증 방법으로서,사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소프트웨어 또는 단말기의 고유값과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등록해 놓는 단계; 해당 음성통신 서비스를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통신 서비스로 접속을 시도하면, 해당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또는 단말기의 고유값을 자동으로인식하는 단계;해당 고유값과 관련하여 서비스 인증값을 생성한 후, 해당 고유값과 관련된 인증기로 상기 인증코드값을 푸시전송하도록 명령을 전달하는 단계;상기 사용자가 인증기에 푸시 전송된 인증코드값에 대한 확인 버튼 또는 동의 버튼을 눌러, 현재 통화중인 상대방과의 통화가 보이스 피싱이 아닌 통화임을 확인하게 되는 것을 특징으로 하는, 음성통신 서비스 상호 인증 방법."}
{"patent_id": "10-2020-0081395", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 인증기에서 확인 버튼 또는 동의 버튼을 누를 때, 인증기가 그 시점에 생성한 사용자 인증값을 서버로 재차 전송하여 서버 역시 사용자를 인증한 후 음성통신 서비스를 계속 하는 진행하는 단계;를 더 포함하는 음성통신 서비스 상호 인증 방법."}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 의할 때, 사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소 프트웨어 또는 단말기의 고유값과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등록해 놓는 단계; 해당 음성통신 서비스를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통신 서 (뒷면에 계속)"}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 인증 기술에 관한 것으로서, 보다 구체적으로는 음성통신 서비스의 상호 인증 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전화, 인터넷 전화, AI 스피커와 같이 음성통신 서비스가 많이 도입되고 있으나 현재 연결된 음성통신 서비스가 진짜 통신서비스인지 인증하는 기술이 필요하다. 또한 음성통신 서비스에서 사용자로 하여금 정당한 사용자인지를 확인하는 방법으로 사용자에게 인증 코드값을 입력하도록 요구하는데(도 1 참조), 인증 코드값을 사용자가 직접 입력하지 않고도 사용자를 인증할 수 있는 새 로운 개선할 방법이 필요하다."}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 현재 연결된 음성통신 서비스가 보이스 피싱 등에 의한 허위 서비스가 아닌 진짜 통신서비스인지를 인증하기 위한, 음성통신 서비스의 상호 인증 방법 및 장치를 제공하기 위한 것이다. 또한 본 발명은 음성통신 서비스에서 정당한 사용자인지를 확인하는데 사용되는 인증 코드값을 사용자가 직접 입력하지 않고도 사용자를 인증할 수 있는, 음성통신 서비스의 상호 인증 방법 및 장치를 제공하기 위한 것이다."}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 음성통신 서비스 상호 인증 방법으로서, 사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소프트웨어 또는 단말기의 고유값 과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등록해 놓는 단계; 해당 음성통신 서비스 를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통신 서비스로 접속을 시도하면, 해 당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또는 단말기의 고유값을 자동으로 인식하는 단계; 해당 고유값과 관련하여 인증코드값을 생성한 후 사용자가 접속한 음성통신 서비스 채널로 들려주면서, 해당 고유값 과 관련된 인증기로 음성통신 확인용 인증코드값을 전송하거나 생성하도록 명령을 전달하는 단계;를 포함하는 음성통신 서비스 상호 인증 방법이 제공된다. 이때, 상기 사용자는, 음성통신 채널로 들은 인증코드값과 인증기가 표시하는 인증코드값이 같은 경우, 상기 사 용자는 현재 통화중인 상대방과의 통화가 보이스 피싱이 아닌 통화임을 확인할 수 있다. 본 발명의 다른 측면에 따르면, 음성통신 서비스 상호 인증 방법으로서, 사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소프트웨어 또는 단말기의 고유값 과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등록해 놓는 단계; 해당 음성통신 서비스 를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통신 서비스로 접속을 시도하면, 해 당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또는 단말기의 고유값을 자동으로 인식하는 단계; 해당 고유값과 관련하여 서비스 인증값을 생성한 후, 해당 고유값과 관련된 인증기로 상기 인증코드값을 푸시 전송하 도록 명령을 전달하는 단계; 상기 사용자가 인증기에 푸시 전송된 인증코드값에 대한 확인 버튼 또는 동의 버튼 을 눌러, 현재 통화중인 상대방과의 통화가 보이스 피싱이 아닌 통화임을 확인하게 되는 것을 특징으로 하는, 음성통신 서비스 상호 인증 방법이 제공된다. 일 실시예에서, 상기 인증기에서 확인 버튼 또는 동의 버튼을 누를 때, 인증기가 그 시점에 생성한 사용자 인증 값을 서버로 재차 전송하여 서버 역시 사용자를 인증한 후 음성통신 서비스를 계속 하는 진행하는 단계;를 더 포함할 수 있다."}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 음성통신 서비스의 상호 인증 방법 및 장치에 의하면, 현재 연결된 음성통신 서비스가 보이스 피싱 등에 의한 허위 서비스가 아닌 진짜 통신서비스인지를 인증할 수 있고, 음성통신 서비스에서 정당 한 사용자인지를 확인하는데 사용되는 인증 코드값을 사용자가 직접 입력하지 않고도 사용자를 인증할 수 있는 효과가 있다."}
{"patent_id": "10-2020-0081395", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 본 명세서의 설명 과정에서 이용되는 숫자(예를 들어, 제1, 제2 등)는 하나의 구성요소를 다른 구성요소와 구분하기 위한 식별기호에 불과하다. 또한, 명세서 전체에서, 일 구성요소가 다른 구성요소와 \"연결된다\" 거나 \"접속된다\" 등으로 언급된 때에는, 상 기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재 가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또 한, 명세서에 기재된 \"부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이 는 하나 이상의 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 조합으로 구현될 수 있음을 의미한다. 본 발명의 일 실시예에 의할 때, 사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소프트웨어 또는 단말기의 고유값과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등록해 놓는 단계; 해당 음성통신 서비스를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통 신 서비스로 접속을 시도하면, 해당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또는 단말기의 고유값을 자동으로 인식하는 단계; 해당 고유값과 관련하여 인증코드값을 생성한 후 사용자가 접속한 음성통신 서비스 채 널로 들려주면서, 해당 고유값과 관련된 인증기로 음성통신 확인용 인증코드값을 전송하거나 생성하도록 명령을 전달하는 단계;를 포함하는 음성통신 서비스 상호 인증 방법이 제공된다. 이때, 상기 사용자는, 음성통신 채널 로 들은 인증코드값과 인증기가 표시하는 인증코드값이 같은 경우, 상기 사용자는 현재 통화중인 상대방과의 통 화가 보이스 피싱이 아닌 통화임을 확인할 수 있다. 또한 본 발명의 다른 실시예에 의할 때, 사전에 사용자가 음성통신 서비스를 사용할 소프트웨어 또는 단말기와, 해당 소프트웨어 또는 단말기의 고유값과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기관에 미리 등 록해 놓는 단계; 해당 음성통신 서비스를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어 또는 단말기로 음성통신 서비스로 접속을 시도하면, 해당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또는 단말기의 고 유값을 자동으로 인식하는 단계; 해당 고유값과 관련하여 서비스 인증값을 생성한 후, 해당 고유값과 관련된 인 증기로 상기 인증코드값을 푸시 전송하도록 명령을 전달하는 단계; 상기 사용자가 인증기에 푸시 전송된 인증코 드값에 대한 확인 버튼 또는 동의 버튼을 눌러, 현재 통화중인 상대방과의 통화가 보이스 피싱이 아닌 통화임을 확인하게 되는 것을 특징으로 하는, 음성통신 서비스 상호 인증 방법이 제공된다. 여기서, 상기 인증기에서 확인 버튼 또는 동의 버튼을 누를 때, 인증기가 그 시점에 생성한 사용자 인증값을 서 버로 재차 전송하여 서버 역시 사용자를 인증한 후 음성통신 서비스를 계속 하는 진행하는 단계;를 더 포함할 수 있다. 이하, 첨부된 도면을 참조하여, 본 발명의 전반적 기술 특징을 상세히 설명한다. 도 2는 본 발명의 실시예에 따른 음성통신 서비스 상호 인증 방식을 도시한 도면이다. 이하, 첨부된 도면을 참 조하여 본 발명의 실시예를 상세히 설명한다. 본 발명의 실시예에 따른 음성통신 서비스 상호 인증 방법은, 사전에 사용자가 음성통신 서비스를 사용할 소프 트웨어 또는 단말기(특정 전화번호를 갖고 있는 사용자 전화기, 특정 스마트폰에 설치된 앱, 인공지능 스피커에 설치된 앱)와 해당 소프트웨어 또는 단말기의 고유값과 연관된 통신이 가능한 인증단말기를 음성통신 서비스 기 관에 미리 등록해 놓은 상태에서, 해당 음성통신 서비스를 받기 위해서 음성통신 서비스를 이용하는 소프트웨어또는 단말기로 음성통신 서비스로 접속을 시도하면, 해당 음성통신 서비스 서버가 접속을 시도한 소프트웨어 또 는 단말기의 고유값을 자동으로 인식하고, 해당 고유값과 관련하여 서비스 인증값을 생성한 후 사용자가 접속한 음성통신 서비스 채널로 들려주면서, 해당 고유값과 관련된 인증기로 음성통신 확인용 인증코드값을 전송하거나 생성하도록 명령을 전달하고, 사용자가 음성통신 채널로 들은 인증값과 인증기가 표시하는 인증값이 같은 경우 사용자가 음성통신 서비스를 먼저 확인하고, 인증기에서 확인 버튼을 누를때 인증기가 그 시점에 생성한 사용자 인증값을 서버로 재차 전송하여 서버 역시 사용자를 인증한 후 음성통신 서비스를 계속 하는 진행하는 음성통신 서비스 상호 인증기술을 제공한다. 일 예로, ARS 기기가 발신자의 전화번호를 자동으로 인식하고 해당 전화번호가 사전에 음성통신 상호인증서비스 에 등록된 전화번호라면 해당 음성통화 채널에 그 당시 생성한 일회용 임시번호를 음성통화채널로 알려주면서, 해당 음성통화 채널 이외에 다른 인증기기를 통해 음성통신 인증값을 표시하고 사용자가 음성통화 채널로 들은 인증번호와 인증기에 표시된 인증값이 일치하는 경우 이를 확인하도록 하고 확인시 사용자 인증값(OTP, 안면인 식, 지문인식, 음성인식)을 인증기를 통해서 서버에 전송하게 하여 서버 역시 사용자가 정당한 사용자 인지 확 인 한후 서비스를 계속 이어갈 수 있도록 허락하는 음성통신 서비스를 구현할 수 있다. 상술한 바와 같은 본 발명의 실시예에 의하면, 해커가 사용자 휴대폰에 멀웨어를 설치함으로써 사용자가 정당한 공공기관 전화번호로 전화를 하더라도 상기 멀웨어에 의해 해커에게 연결되도록 처리되는 경우에도, 전화로 연 결된 해당 서비스가 실제로 정당한 공공기관에 의한 음성통신 서비스인지를 음성으로 직접 확인할 수 있기 때문 에, 해당 사용자가 보이스 피싱 위험에 노출되게 되는 위험성을 감소시킬 수 있다. 또한 상술한 본 발명의 실시예에 의하면, 음성을 기반으로 하는 다양한 서비스들(예를 들어, 폰뱅킹, AI 스피커 뱅킹 서비스 등)에서 사용자에게 인증 코드값(예를 들어, 일회용 비밀번호 또는 비밀번호)의 입력을 요구하는 게 아니라 음성통신 서비스가 사용자에게 해당 서비스에 관한 서비스 비밀번호를 음성으로 알려주고 사용자에게 확인하게 함으로서 비밀번호 또는 인증값 관리를 개선할 수 있다. 이상에서는 본 발명의 실시예를 참조하여 설명하였지만, 해당 기술 분야에서 통상의 지식을 가진 자라면 하기의 특허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수 정 및 변경시킬 수 있음을 쉽게 이해할 수 있을 것이다."}
{"patent_id": "10-2020-0081395", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술에 따른 사용자 입력 인증 방식을 도시한 도면. 도 2는 본 발명의 실시예에 따른 음성통신 서비스 상호 인증 방식을 도시한 도면."}
