{"patent_id": "10-2020-0162698", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0074328", "출원번호": "10-2020-0162698", "발명의 명칭": "인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템", "출원인": "주식회사 국민은행", "발명자": "유현식"}}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대출시스템과, 상기 기업대출 사기/사기의심시스템이 수행하는 기업대출 사기/사기의심거래에 대해서 주기적인감사 외에 유무선 인터넷을 매개로 사기 또는 사기의심 거래 위험률과 그 근거항목을 고려하여 상시감사를 실시하며, 고위험군에 대하여 효율적인 영업감사를 수행할 수 있도록 지원하는 감사정보시스템과, 상기 기업대출 사기/사기의심시스템의 제 1 데이터베이스로부터 유무선 인터넷을 거쳐 데이터를 수집, 학습을 위한 전처리를 수행하며, 데이터를 분석 및 학습, 모델링하여 감사단말의 도움을 받아 이상거래 예측 모델을 생성, 저장하고, 이상거래 예측모델을 이용하여 상기 기업대출 사기/사기의심시스템의 기업대출 사기/사기의심거래 데이터에 대해이상거래인지 여부를 예측하여 상기 감사정보시스템에 제공하여 상기 감사단말이 상기 감사정보시스템의 사기/사기의심 기업대출 사기/사기의심탐지 모니터링을 이용하여 기업대출 사기/사기의심에 대하여 상시 감사를 효율적으로 수행할 수 있게 해주는 인공지능감사분석시스템을 포함하며,상기 데이터는 재무정보로서 누적재무정보, 추정재무정보, 제조업 재무정보를 포함하며, 비재무정보로서 평가및 등급정보와 기업현황 정보를 포함하며,상기 데이터의 모델링은 사기를 정상으로 예측하는 오류를 보인 2종오류와 정상을 사기로 예측하는 1종오류를최소화하도록 모델 성능 최적화가 이루어지는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 인공지능감사분석시스템은 하둡 파일 시스템(hadoop file system)으로 상기 제 1 데이터베이스로부터 인공지능감사분석작업을 위해서 변경된 데이터를 저장하는 학습용 데이터저장부와, 상기 학습용 데이터를 이용하여머닝러닝학습을 하기 위한 예측모델 저장부와, 예측모델을 이용하여 사기기업대출 사기/사기의심여부 등 예측결과를 저장하는 예측결과 저장부를 더 포함하는 제 2 데이터베이스를 포함하는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 감사정보시스템은 상기 기업대출 사기/사기의심시스템을 통한 기업대출 사기/사기의심거래에 대하여 상기인공지능 감사분석시스템의 사기/사기의심 예측 모델 결과값이 높게 나온 경우에 상시 감사를 수행하여 사기 및부정기업대출 사기/사기의심을 예방하기 위한 상시감사모듈과 사기기업대출 사기/사기의심에 의한 업무 손실의현황 파악 및 관리를 위한 조직에 대한 정기적인 영업 감사모듈을 포함하는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 상시감사모듈은 상기 기업대출 사기/사기의심시스템을 통한 기업대출 사기/사기의심거래에 대하여 사기 확률를 표시하는 사기확률 표시부와, 상기 기업대출 사기/사기의심거래의 확률에 대한 근거를 제시하는 근거제시부를 더 포함하며,상기 근거제시부는 근거항목을 SHAP 라이브러리를 활용하여 변수의 영향도를 방향과 크기로 표시하며, 사기스코어를 점수로 표시하는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템.공개특허 10-2022-0074328-3-청구항 5 제 3 항에 있어서상기 인공지능감사분석시스템은 이상거래를 정의하고, 이상거래 데이터 수집 및 전처리하며, 사고사례 데이터식별 및 머신러닝 솔루션 타겟 데이터를 정의하고, 이상거래 데이터를 탐지 분석하는 이상거래탐지서버와, 머신러닝 기반의 이상거래 탐지모델을 개발하고 기업대출 사기/사기의심거래 요건을 분석하여 비즈니스룰을 개발하는 모델/비지니스룰개발서버와, 머신러닝학습을 통하여 이상거래 정의, 탐지, 분석, 새로운 룰 모델 개발 학습을 자동하는 하는 자동학습서버와, 상기 자동학습서버에서 개발된 머신러닝 모델과 학습데이터를 이용하여 이상거래를 인공지능으로 예측하는 AI 예측서버와, 상기 AI 예측서버와 상기 감사정보제공시스템을 연동시키는 연동서버를 포함하며,상기 모델/비지니스룰개발서버는 기업대출 사기/사기의심을 위하여 점검해야 하는 점검항목 변수를 추가하면서모델을 검증하는 단계와, 변수 타입을 변경하여 유의미한 변수를 생성하여 후보변수를 도출하고, 후보변수가 많을 경우 모델링 전에 다변량 변수를 피처로 선택하여 최종후보변수를 결정하는 단계와, 모델링 변수 세트를 비지니스 모델 및 룰로서 선택하여 모델링 적용 변수를 생성하는 모델링 변수 설정단계를 수행하며,학습데이터를 활용하여 모델을 개발하고 개발된 모델을 통해 대출 신청건별 사기확률 계산 후 모델의 성능을평가하여 최적의 모델을 선정하는 단계와, 상기 선정모델을 이용하여 대출신청건별 사기대출확률을 인구통계,재직/소득, 은행거래 후보변수 및 타겟 등 학습데이터를 활용하여 기업대출 사기/사기의심신청건별 사기확률을계산하는 사기대출확률을 도출하는 단계와, 모델예측 스코어별 내림차순 정렬을 하여 예측확률과 실제로 해당신청이 정상인지 사기인지여부를 판별하여 모델을 평가하는 단계 및 모델에 대한 성능지표계산 및 비교단계를수행하는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서상기 모델/비지니스룰 개발서버는 머신러닝 기반의 이상거래 탐지모델을 개발하는 이상거래 탐지모델개발부와,제공되는 업무요건을 분석하여 사기의심기업대출 사기/사기의심거래 또는 사기거래 기업대출 사기/사기의심을방지할 수 있는 비지스니룰을 최적화하거나 신규개발하는 비지니스룰 개발부와, 상기 감사정보시스템의 상시감사모듈에서 점검할 상시감사점검항목을 개발하는 상시감사점검항목 개발부와, 기존 규칙에서 발견되지 않은 새로운 유형의 사기패턴을 탐지하고 새로운 이상거래 유형을 지속적으로 자기 개발하여 상기 자동학습서버를 통해서 예측모델을 생성하고, 사기 또는 사기의심 기업대출 사기/사기의심에 대한 예측정보를 제공하도록 하기 위한New 사기패턴 탐지부를 더 포함하는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서상기 자동 학습 서버는 머신러닝 알고리즘을 이용하여 상기 학습데이터 가공부에서 가공된 학습데이터를 이용하여 상기 이상거래 탐지모델개발부에서 개발된 이상거래 모델을 이용하여 지도학습을 진행하여 사기가능성을 확률적으로 판단하는 지도학습부와, 상기 모델/비지니스룰 개발서버에서 개발된 이상거래탐지모델 또는 비즈니스룰 또는 상시 점검항목이나 새로운 사기패턴을 적용하여 자동으로 비지도학습을 수행하는 비지도학습부와, 상기사기/사기의심 기업대출 사기/사기의심 모델에 대하여 비교분석하여 정확도가 높은 모델을 적용하는 모델비교분석부와, 상기 기업대출 사기/사기의심거래에 대하여 적용할 예측모델을 상기 모델비교분석부의 분석결과를 이용하여 최종선정하는 예측모델생성부를 포함하는 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서상기 AI 예측서버는 상기 예측모델생성부에서 생성한 예측모델을 이용하여 상기 지도학습부 또는 상기 비지도학습부를 이용하여 머신러닝 학습에 의하여 사기 또는 사기의심 기업대출 사기/사기의심거래의 확률을 예측하는AI 예측부를 포함하며,상기 AI 예측서버는 기업사기 대출 예측 모델의 안정성, 예측력 및 설명력을 고려하여 isolation forest, KCOD,공개특허 10-2022-0074328-4-Autoencoder, GAN 알고리즘중 하나를 이용하여 모델적합결과를 비교하여 최적 모델을 선정하며,상기 isolation forest, KCOD, Autoencoder, GAN 알고리즘 중 isolation forest가 사기를 정상으로 예측하는 2종오류를 제거할 수 있으며, 사기 예측 성능 평가 성능지표도 우수한 알고리즘으로 사용되는 인공지능을 이용한기업대출 사기/사기의심 상시감사지원시스템."}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템은, 사용자가 소정의 서류를 제출하여 기업대출 사기/사기의심 신청을 한 경우 신용등급 및 기업대출 사기/사기의심가능금액 등을 조 사하여 기업대출 사기/사기의심거래를 시행하는 기업대출 사기/사기의심시스템과, 상기 기업대출 사기/사기의심 (뒷면에 계속)"}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템에 관한 것으로, 보다상세하게는 이상 거래 예측 정교화를 위한 머신러닝 예측 모형을 개발하고, 머신러닝 기술을 활용하여 비즈니스 룰 최적화 신규 개발하고 머신러닝 예측모형 및 비즈니스 룰 자동학습 시스템 구축 기존의 규칙에서 발견되지 않는 새로운 유형 의 이상거래를 R&D할 수 있으며 머신러닝 탑재된 분석서버와 감사시스템간 연계개발을 목적으로 하는 인공지능 을 이용한 기업대출 사기/사기의심 상시감사지원시스템에 관한 것이다."}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 감사는 영업점 등과 같은 피감사조직의 횡령이나 유용 또는 과실 등의 각종 사고를 적발 및 예방하 는 것으로써, 피감사조직 각각에 대한 일대일 방식으로 수행되었다. 그러나, 일대일 감사 방식은 조직이 거대화되어 피감사조직이 증가함에 따라, 좀 더 체계적이고 효율적으로 개 선될 필요성이 제기되었고, 그 결과 각 조직별로 다양한 감사 시스템이 도입되었다. 그러나, 종래의 감사 시스템은 피감사조직에 대한 정보를 수집 및 취합하여 감사자에게 단순히 제공하는 것에 그치고 있는 실정이다. 게다가, 각 감사자는 장기간 미수감한 피감사조작을 2~3년 간격의 정기적인 감사를 수행 하였다. 그러나 종래의 감사 방식은 모든 사안별로 감사자가 피감사대상을 직접적으로 검토 및 감사하여야 하므로, 시간 적 지리적으로 한계에 다다르고 있는 실정이다. 더욱이, 조직 구조 개편 또는 자산규모 증가로 인해 조직의 사업구조가 개편됨에 따라, 종래와 다른 새로운 유 형의 사고가 발생하고 그 사고 금액이 거액화되고 있어 새로운 감사 시스템 구축에 대한 필요성이 제기되었다."}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 특허공개번호 10-2006-0086619호(2006.08.01))의 'ERP 시스템 기반의 감사정보 시스템 및 이를 이용한 감사정보 운영 방법, 그 프로그램이 기록된 기록매체'에 개시되어 있다. 기업, 회사, 기관, 단체 등(이하 기업으로 통칭)에 있어서 그 조직의 자산을 보호하고 업무의 능률을 높이기 위 해 업무 손실(Risk)을 억제하는 것이 주요한 업무가 되고 있으며, 이러한 업무 손실의 현황 파악 및 관리를 위 한 경영 기법으로서 감사 제도를 예로 들 수 있다. 하지만, 종래의 감사 제도는 주로 과거 감사 경험이나 감사 실적 위주로 수행됨으로써 감사 자원의 낭비 또는 불합리한 감사가 수행되는 문제점이 상존해 왔다. 이에 따라 감사 활동의 질적 하락과 반복적인 업무 손실이 초 래되고 이로 인해 불필요한 감사 자원이 다시 낭비되는 악순환이 반복되는 단점이 있다. 더욱이, 감사 활동의 관리에 있어서 감사 보고, 감사 결과 및 이에 따른 시정/개선 방안 등이 모두 분실 및 소 멸의 우려가 높은 종이 형태의 문서로만 관리됨으로써 이전 감사 데이터에 대한 축적된 자료를 얻기 어렵다는 문제점도 있다. 뿐만 아니라, 종이 형태의 감사 데이터는 분석, 검색, 가공이 어려워 감사 활동에 제대로 활용되지 못하고 있으 며, 정보 제공 흐름이 문서의 유통 속도에 크게 영향 받음에 따라 업무 처리와 의사 결정이 지연되는 등 업무 생산성 향상을 저하시키는 요인으로 작용하고 있다. 따라서, 감사 활동에 있어 업무 생산성과 신속성을 향상하고 감사 관련 자료를 체계적으로 저장, 검색 및 통계 처리할 수 있는 기능을 구현할 수 있는 새로운 개념의 감사 관리 시스템 감사 관리 방법의 출현이 요구되어 왔 다. 한편, 기업대출 사기의 경우 1년내 기업신용평가 신청건에 비하여 비율도 크고 규모도 클뿐만 아니라, 정상인데 사기로 예측되는 오류가 발생한 경우에도 문제가 되지만 정상임에도 사기로 예측하는 경우에 제대로 기업대출이 이루어지지 못하여 기업에 큰 피해를 줄 수 있으므로 정밀도가 높아야 함에도 불구하고 데이터 건수가 기업대출사기예측모델을 개발하기에는 제한적인 문제점이 있다. 또한, 전술한 바와 같이 기업 신용 대출 신청건을 토대로 정상 사기건으로 구분하여 검토한 결과 사기를 정상으 로 예측하는 오류를 보인 2종오류와 정상을 사기로 예측하는 1종오류가 발생함에도 불구하고 지금까지는 이를 명확히 구분하지 못하는 문제점이 있다."}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이러한 문제점을 해결하고자 안출된 것으로, 본 발명의 목적은 사기기업대출 사기/사기의심로 인한 손실규모가 커짐에 따라서 사기기업대출 사기/사기의심 관련 이상징후의 적기 탐지할 수 있으며, 사후적발 중심 및 인력 중심에서 벗어나 사기 및 부정기업대출 사기/사기의심 예방할 수 있고, 점검대상 여신의 위험도 평가 및 자동재학습 기능으로 감사 효율성 증대 및 통합점검 관리 체계 구축이 가능하며, 상시 모니터링의 고도화를 통한 리스크 관리 체계 구축이 가능한 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템을 제공하 는 것이다."}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템은, 사용자가 소정 의 서류를 제출하여 기업대출 사기/사기의심 신청을 한 경우 신용등급 및 기업대출 사기/사기의심가능금액 등을 조사하여 기업대출 사기/사기의심거래를 시행하는 기업대출 사기/사기의심시스템과, 상기 기업대출 사기/사기의 심시스템이 수행하는 기업대출 사기/사기의심거래에 대해서 주기적인 감사 외에 유무선 인터넷을 매개로 사기 또는 사기의심 거래 위험률과 그 근거항목을 고려하여 상시감사를 실시하며, 고위험군에 대하여 효율적인 영업 감사를 수행할 수 있도록 지원하는 감사정보시스템과, 상기 기업대출 사기/사기의심시스템의 제 1 데이터베이스 로부터 유무선 인터넷을 거쳐 데이터를 수집, 학습을 위한 전처리를 수행하며, 데이터를 분석 및 학습, 모델링 하여 감사단말의 도움을 받아 이상거래 예측 모델을 생성, 저장하고, 이상거래 예측모델을 이용하여 상기 기업 대출 사기/사기의심시스템의 기업대출 사기/사기의심거래 데이터에 대해 이상거래인지 여부를 예측하여 상기 감 사정보시스템에 제공하여 상기 감사단말이 상기 감사정보시스템의 사기/사기의심 기업대출 사기/사기의심탐지 모니터링을 이용하여 기업대출 사기/사기의심에 대하여 상시 감사를 효율적으로 수행할 수 있게 해주는 인공지 능감사분석시스템을 포함하며, 상기 데이터는 재무정보로서 누적재무정보, 추정재무정보, 제조업 재무정보를 포함하며, 비재무정보로서 평가 및 등급정보와 기업현황 정보를 포함하며, 상기 데이터의 모델링은 사기를 정상으로 예측하는 오류를 보인 2종오류와 정상을 사기로 예측하는 1종오류를 최소화하도록 모델 성능 최적화가 이루어지는 것을 특징으로 한다"}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템에 의하면, 허위/사 기기업대출 사기/사기의심 취급에 따른 금융기관의 손실 예방 및 사고금액 대형화에 대비할 수 있으며, 대내외 환경변화에 따른 신종 사기(기획 기업대출 사기/사기의심) 기업대출 사기/사기의심 대응으로 금융기관의 손실예 방 및 평판 리스크 관리가 가능하며, 사기 고위험 분류 여신 계좌에 대한 선별 및 집중 점검으로 감사역 점검 업무의 효율성 증대로 점검 범위 확대할 수 있다. 특히, 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템에 의하면, 사기/사기의심 데이터가 불충분 또는 불균일한 경우 뿐만 아니라 사기를 정상으로 예측하는 오류를 보인 2종오 류와 정상을 사기로 예측하는 1종오류를 최소화하도록 모델 성능 최적화가 이루어질 수 있다."}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 일 실시예에 따른 상시형 감사 장치를 첨부된 도면을 참조하여 상세하게 설명한다. 이 과 정에서, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또 는 관례에 따라 달라질 수 있다. 그러므로, 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 본 발명의 일시스템에 따른 인공지능을 이용한 상시감사지원시스템의 전체 구성도를 나타내며, 도 2는 도 1의 감사정보시스템의 내부 구성을 설명하는 블록도이고, 도 3은 도 1의 감사정보시스템이 감사단말에 제공 하는 화면예시도이며, 도 4는 도 1의 본 발명의 일 실시예에 따른 인공지능감사 분석시스템의 내부 구성을 설명 하는 블록도이다. 도 1 내지 도 4에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원시스템은, 사용자가 소정의 서류를 제출하여 기업대출 사기/사기의심 신청을 한 경우 신용등급 및 기업대출 사기/사기의심가능금액 등을 조사하여 기업대출 사기/사기의심거래를 시행하는 기업대출 사기/사기 의심시스템과, 상기 기업대출 사기/사기의심시스템이 수행하는 기업대출 사기/사기의심거래에 대해서 주기적인 감사 외에 유무선 인터넷을 매개로 사기 또는 사기의심 거래 위험률과 그 근거항목을 고려하여 상시감사를 실시하며, 고위험군에 대하여 효율적인 영업감사를 수행할 수 있도록 지원하는 감사정보시스템(30 0)과, 상기 기업대출 사기/사기의심시스템의 제 1 데이터베이스로부터 유무선 인터넷을 거쳐 데 이터를 수집, 학습을 위한 전처리를 수행하며, 데이터를 분석 및 학습, 모델링하여 감사단말의 도움을 받아 이상거래 예측 모델을 생성, 저장하고, 이상거래 예측모델을 이용하여 상기 기업대출 사기/사기의심시스템(10 0)의 기업대출 사기/사기의심거래 데이터에 대해 이상거래인지 여부를 예측하여 상기 감사정보시스템(30 0)에 제공하여 상기 감사단말이 상기 감사정보시스템의 사기/사기의심 기업대출 사기/사기의심탐지 모 니터링을 이용하여 기업대출 사기/사기의심에 대하여 상시 감사를 효율적으로 수행할 수 있게 해주는 인공지능 감사분석시스템을 포함한다. 상기 인공지능감사분석시스템의 제 2 데이터베이스는 하둡 파일 시스템(hadoop file system)으로 원 천데이터와, 상기 제 1 데이터베이스로부터 인공지능감사분석작업을 위해서 변경된(staging) 데이터를 저 장하는 학습용 데이터저장부(501a)와, 상기 학습용 데이터를 이용하여 머닝러닝학습을 하기 위한 예측모델 저장 부(501b)와, 예측모델을 이용하여 사기기업대출 사기/사기의심여부 등 예측결과를 저장하는 예측결과 저장부 (501c)를 더 포함할 수 있다.상기 감사정보시스템은 상기 기업대출 사기/사기의심시스템을 통한 기업대출 사기/사기의심거래에 대 하여 상기 인공지능 감사분석시스템의 사기/사기의심 예측 모델 결과값이 높게 나온 경우에 상시 감사를 수행하여 사기 및 부정기업대출 사기/사기의심을 예방하기 위한 상시감사모듈과 사기기업대출 사기/사기의 심에 의한 업무 손실의 현황 파악 및 관리를 위한 조직에 대한 정기적인 영업 감사모듈을 포함한다. 상기 상시감사모듈은 상기 기업대출 사기/사기의심시스템을 통한 기업대출 사기/사기의심거래에 대하 여 사기 확률를 표시하는 사기확률 표시부와, 상기 기업대출 사기/사기의심시스템을 통한 기업대출 사기/사기의심거래에 대하여 사기의심확률을 표시하는 사기의심확률 표시부와, 상기 사기확률 표시부 또는 상기 사기의심확률 표시부를 통해 표시하는 사기확률 또는 사기의심확률에 대하여 상기 기업대출 사 기/사기의심거래의 확률에 대한 근거를 제시하는 근거제시부를 더 포함할 수 있다. 상기 근거제시부는 일반적으로 데이터기반의 머신러닝 모델의 경우에 높은 정밀도와 연속적인 위험도 추정 으로 정교한 위험도를 제공하지만 결과에 대한 명확한 설명이 어려운 문제점을 해결하기 위하여, 상기 감사단말 또는 상기 인공지능감사분석시스템의 지원을 받아 우선적으로 검토할 비즈니스 룰 또는 모델 및 근거 를 제시함으로써 사기 고위험 분류 여신 계좌에 대한 선별 및 집중 점검으로 상기 감사단말의 점검 업무의 효율성을 증대시킬 수 있으며, 상기 감시단말이 고려할 수 있는 종래의 비지니스 룰 또는 모델 이외의 새로 운 비지니스룰 또는 모델을 제시하여 점검 범위를 확대할 수 있다. 상기 상시감사모듈과 상기 영업감사모듈은 상호 연동되어 고위험군에 대해서 뿐만 아니라 전체 기업 대출 사기/사기의심거래에 대하여 통계분석과 머신러닝을 진행하여 상시 모니터링의 고도화를 통한 리스크 관리 체계 구축이 가능하다. 상기 인공지능감사분석시스템은 이상거래탐지서버와, 모델/비지니스룰개발서버와, 자동학습서버 와, AI 예측서버와, 연동서버를 포함한다. 상기 이상거래탐지서버는 기업대출 사기/사기의심거래에 대해 이상거래를 정의하고 태깅 등 관리 체계를 수립하는 이상거래 관리부와, 상기 이상거래 관리부에 의해 정의된 이상거래 데이터를 분류 수집하는 이상거래 데이터 수집부와, 이상거래 데이터가 전체 기업대출 사기/사기의심거래 데이터 대비 1% 이내로 매우 적은 데이터여서 머신러닝모델로 이용하는 경우에 정확도가 떨어지는 문제가 발생하므로, 이상거래 데이터 중 노이즈를 제거하며, 학습데이터로 가공하기 전에 처리하는 데이터 전처리부와, 이후 자세히 설명하는 모델/비지니스룰 개발서버 또는 자동 학습 서버에서 이용할 수 있는 학습데이터로 처리하기 위한 학 습데이터 가공부를 포함한다. 상기 학습데이터 가공부는 이상거래 데이터를 식별하고, 머신러닝 솔루션을 위한 타켓 데이터로 정의한다. 상기 모델/비지니스룰 개발서버는 이상거래 예측 정교화를 위한 머신러닝 예측모형을 개발하고, 사기의심 기업대출 사기/사기의심거래 또는 사기거래 기업대출 사기/사기의심을 방지할 수 있는 비지스니룰을 최적화하거 나 신규개발하는 것을 특징으로 한다. 상기 모델/비지니스룰 개발서버는 머신러닝 기반의 이상거래 탐지모델을 개발하는 이상거래 탐지모델개발 부와, 제공되는 업무요건을 분석하여 사기의심기업대출 사기/사기의심거래 또는 사기거래 기업대출 사기/ 사기의심을 방지할 수 있는 비지스니룰을 최적화하거나 신규개발하는 비지니스룰 개발부와, 상기 감사정보 시스템의 상시감사모듈에서 점검할 상시감사점검항목을 개발하는 상시감사점검항목 개발부와, 기존 규칙에서 발견되지 않은 새로운 유형의 사기패턴을 탐지하고 새로운 이상거래 유형을 지속적으로 자기 개 발하여 자동학습서버를 통해서 예측모델을 생성하고, 사기 또는 사기의심 기업대출 사기/사기의심에 대한 예측정보를 제공하도록 하기 위한 New 사기패턴 탐지부를 더 포함한다. 상기 상시감사점검항목 개발부는 가계기업대출 사기/사기의심인 경우 허위/사기 확률이 높은 신청 건의 탐 지를 위해 룰 적용 및 머신러닝학습(지도학습)하여 결과값 등을 상기 감사단말에 제공하여 상시감사할 수 있도록 할 수 있다. 상기 상시감사점검항목 개발부는 기업여신인 경우, 신규 신용평가 대상 기업의 재무/비재무 정보를 머신러 닝 학습(비지도학습) 통한 룰을 적용하여 사기/고위험 군에 대한 예측 정보를 상기 감사단말에 제공하여 상 시감사할 수 있도록 할 수 있다. 이와 같이 가계기업대출 사기/사기의심과 기업여신에 대하여 머신러닝 학습을 차별화하여 상기 감사단말의 업무부하를 줄일 수 있다.상기 자동 학습 서버는 머신러닝 알고리즘을 이용하여 상기 학습데이터 가공부에서 가공된 학습데이 터를 이용하여 상기 이상거래 탐지모델개발부에서 개발된 이상거래 모델을 이용하여 지도학습을 진행하여 사기가능성을 확률적으로 판단하는 지도학습부와, 사기기업대출 사기/사기의심건수가 불충분하여 노이즈가 발생할 수 있으므로 이상거래데이터의 특성을 고려하여 상기 모델/비지니스룰 개발서버에서 개발된 이상거 래탐지모델 또는 비즈니스룰 또는 상시 점검항목이나 새로운 사기패턴을 적용하여 자동으로 비지도학습을 수행 하는 비지도학습부와, 상기 사기/사기의심 기업대출 사기/사기의심 모델에 대하여 비교분석하여 정확도가 높은 모델을 적용하는 모델비교분석부와, 상기 기업대출 사기/사기의심거래에 대하여 적용할 예측모델을 상기 모델비교분석부의 분석결과를 이용하여 최종선정하는 예측모델생성부를 포함할 수 있다. 상기 AI 예측서버는 상기 예측모델생성부에서 생성한 예측모델을 이용하여 상기 지도학습부와 상기 비지도학습부를 이용하여 머신러닝 학습에 의하여 사기 또는 사기의심 기업대출 사기/사기의심거래의 확률을 예측하는 AI 예측부와, 상기 AI 예측부에서 예측된 정보를 예측정보 DB에 저장하는 예측 정보저장부와, 상기 AI 예측서버와 상기 감사정보시스템을 연결하기 위한 인터페이스부를 포함할 수 있다. 상기 연동서버는 상기 인터넷망을 통해서 상기 기업대출 사기/사기의심시스템, 감사단말, 감사정보시스템과 송수신할 수 있도록 연결하기 위한 송수신 인터페이스와, 상기 감사정보시스템 의 상시감사모듈과 영업감사모듈에서 상기 감사단말의 니즈에 따라 제공할 정보를 예를들어 사기 또는 사기의심 확률을 % 또는 막대그래프로 표시하거나 근거항목을 순위로 제공하거나 강조표시하는 등 감 사 정보를 커스터마이징할 수 있는 커스터마이징부를 포함할 수 있다. 이제 도 5를 참조하여 도 4의 인공지능감사분석시스템과 도 2의 감사정보시스템 사이의 인터페이스를 상세히 설 명한다. 도 5는 도 4의 인공지능감사분석시스템과 도 2의 감사정보시스템 사이의 인터페이스 구성도를 나타낸다. 도 5에 도시된 바와 같이, 상기 자동학습서버는 상기 기업대출 사기/사기의심시스템의 제 1 데이터베 이스로부터 과거 기업대출 사기/사기의심거래 데이터를 일정 주기로 추출, 변환 적재하여 상기 하둡 시스 템인 제 2 데이터베이스에 저장할 수 있으며, 상기 학습데이터 가공부에 의해서 가공된 학습데이터를 상기 지도학습부 또는 비지도학습부에서 학습을 진행하고 상기 모델비교분석부에서 산출된 모델 을 비교분석하여 예측모델저장영역(501b)에 저장하고 상기 지도학습부 또는 비지도학습부에서 연속하 여 재학습하며, 상기 모델비교분석부는 정확도 등 배포기준을 만족하지 못하면 데이터나 파라미터를 변경 하여 재학습하고, 상기 예측모델생성부에서 정확도 등 모델의 성능 기준을 만족한 모델을 최종적으로 예 측모델로 선정하면, 상기 AI 예측서버에서 상기 기업대출 사기/사기의심시스템의 제 1 데이터베이스 로부터 유입된 일배치로 적재되는 기업대출 사기/사기의심거래 데이터에 대하여 추출, 변환, 적재하고 상 기 AI 예측부에서 상기 예측모델을 이용하여 예측하고자 하는 일배치로 적재되는 기업대출 사기/사기의심 거래 데이터에 대하여 사기확률 또는 사기의심확률값을 예측하며, 예측결과를 예측결과저장영역(501c)에 저장하 고 상기 인터페이스부를 통하여 상기 감사정보시스템의 상시감사모듈를 통해 제공하여 상시 감 사 모니터링함으로써 허위/사기기업대출 사기/사기의심 취급에 따른 은행 손실 예방 및 사고금액 대형화에 대비 할 수 있다. 따라서, 대내외 환경변화에 따른 신종 사기(기획 기업대출 사기/사기의심) 기업대출 사기/사기의심 대응으로 은 행의 손실예방 및 평판 리스크 관리가 가능하며, 사기 고위험 분류 여신 계좌에 대한 선별 및 집중 점검으로 상 기 감사단말의 점검 업무의 효율성 증대로 점검 범위 확대할 수 있다. 이제 도 6 및 도 7을 참조하여 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감 사지원방법에 대하여 상세히 설명한다. 도 6은 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법의 플로우챠트 이며, 도 7은 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법에 사용 된 사기/사기의심 기업대출 사기/사기의심에 대한 지도학습과 비지도학습의 연동관계를 설명하는 개념도이다. 먼저 도 6 및 도 7에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의 심 상시감사지원방법에 있어서, 상기 인공지능감사분석시스템은 이상거래탐지서버의 이상거래 관리부 에서 기업대출 사기/사기의심거래의 비즈니스 요구사항을 정리하고, 인공지능감사분석할 이상거래를 선정 하여 요건을 정의한다(S10)상기 이상거래 관리부는 이상거래 예측 타켓을 정의하고, 분석대상, 관찰기간, 모델 세그먼트 정의, 분석 방법을 선정할 수 있다. 상기 이상거래 관리부에 의해 정의된 이상거래 데이터를 상기 이상거래 데이터 수집부에서 분류 수집 하면, 상기 데이터 전처리부에서 이상거래 데이터 중 노이즈 제거를 하고 속도나 정확도를 높이기 위한 데 이터 전처리를 수행하고, 상기 학습테이터 가공부에서 상기 모델/비지니스룰 개발서버 또는 자동 학 습 서버에서 이용할 수 있는 학습데이터로 처리하여 준비한다(S20). 상기 학습데이터 가공부는 단기내 부도 데이터, 과거 사기(사고)관련 여신 데이터, 허위기업대출 사기/사 기의심 의심 등록 차주 데이터 등을 분석 데이터 범위로 하여 데이터를 탐색 분석하여(S30) 학습데이터로 가공 할 수 있다. 특히, 기업대출 사기/사기의심과 관련하여 사기예측모델분석 데이터는 사기대출의 징후를 나타내는 항목을 중심 으로 사기대출 가능성을 고려하여 5개의 카테고리 하에서 후보변수를 정의하였다. 표 1 카테고리의 의미 주요후보변수 재무 정보누적재무정보 평가일 전 3개년도의 주요 재무 지표에 대한 동종업계 평균과의 차이 *매출액 증가율 *총자본 순이익률 *총CF 대 차입금 비율 *차입금 의존도 추정재무정보 평가일 기준 당기 추정 재무 비 율*추정 금융비용 부담율 *추정 매출액 증가율 *추정 차입금 대 매출액 비율 제조업재무정보제조업 여부 및 제조원가 명세 서상 감가상각비, 전력비 등 제 조업 기업의 회계 정보 기록 여부*제조업 여부 *감가상각비 불량 여부 *전력비, 연료비 불량 여부 비재무 정보평가및등급정보내외부 기업 신용 평가 등급 및 기타 평가 가능 요소의 결과 정 보 *크레탑 신용 등급 구분 *신용 등급 세분류 구분 *비재무 평가등급 *대표자 모델 평점 기업현황정보 기업 대표자 및 구매처 / 판매 처 현황 정보*대표자 변경 개수 *주요 판매처 수 *주요 구매처 수 상기 학습데이터 가공부는 상기 모델/비지니스룰 개발서버에 의해 개발 또는 최적화된 머신러닝 예측 모형, 사기의심기업대출 사기/사기의심거래 또는 사기거래 기업대출 사기/사기의심을 방지할 수 있는 비지스니 룰을 이용하여 학습데이터를 탐색분석할 수 있으며, 기존 규칙에서 발견되지 않은 새로운 유형의 사기패턴을 탐 지하고 새로운 이상거래 유형을 자동학습서버를 통해서 생성된 예측모델과, New 사기패턴 탐지부에서 제공하는 새로운 유형의 사기패턴을 이용할 수도 있으며, 모델비교분석부에 의해서 비교분석하여 정확도가 높은 모델을 적용하여 학습데이터를 가공할 수 있다(S35). 상기 자동 학습 서버는 상기 지도학습부를 통해서 머신러닝 알고리즘을 이용하여 상기 학습데이터 가 공부에서 가공된 학습데이터와, 상기 이상거래 탐지모델개발부에서 개발된 이상거래 모델을 이용하여 지도학습을 진행하여 사기가능성을 확률적으로 판단할 수 있으며, 상기 비지도학습부를 이용하여 상기 모 델/비지니스룰 개발서버에서 개발된 이상거래탐지모델 또는 비즈니스룰 또는 상시 점검항목이나 새로운 사 기패턴을 적용하여 자동으로 비지도학습을 수행할 수 있다(S50). 상기 데이터 학습/모델링 단계(S40)는 상기 예측모델생성부를 이용하여 상기 기업대출 사기/사기의심거래 에 대하여 적용할 예측모델을 상기 모델비교분석부의 분석결과를 이용하여 최종선정하는 모델/비지니스룰 개발/비교분석단계(S35)를 반복할 수 있다.상기 AI 예측서버는 상기 예측모델생성부에서 생성한 예측모델을 이용하여 상기 지도학습부와 상기 비지도학습부를 이용하여 머신러닝 학습에 의하여 사기 또는 사기의심 기업대출 사기/사기의심거래의 확률을 예측할 수 있다(S50) 상기 AI 예측서버와 상기 감사정보시스템을 인터페이스부가 연결하여 상기 감사정보시스템(30 0)의 상시감사모듈에서 사기 또는 사기의심 확률을 % 또는 막대그래프로 표시하며, 근거항목을 순위로 제 공하여 이와 연동하는 상기 감사단말이 감사 모니터링함으로써 허위/사기기업대출 사기/사기의심 취급에 따 른 은행 손실 예방 및 사고금액 대형화에 대비할 수 있다. 이제 도 8a 및 도 9를 참조하여 분석 데이터 중 모델링에 사용될 후보 변수를 도출하는 방법과, 학습데이터를 가공하는 방법에 대해서 설명한다. 도 8a 및 도 8b는 도 6의 단계 S30 및 S35의 분석 데이터 중 모델링에 사용될 후보 변수를 도출하는 방법과, 학 습데이터를 가공하는 방법을 나타내는 플로우챠트이고, 도 9는 기업대출 사기/사기의심 상시감사 모델개발 및 모델평가에 대한 개념을 나타내는 개념도이다. 도 8a에 도시된 바와 같이, 최적의 모델 탐색 분석단계(S30)는 분석 데이터 중 모델링에 사용될 후보 변수를 도 출하하기 위하여 기초분석을 수행하며, 이를 통해 오류나 이상치를 찾고 모델 성능을 올리기 위한 데이터 가공 을 수행한다. 이를 위하여, 상기 최적의 모델 탐색 분석단계(S30)는 퍼센티지 분석을 수행하여 분석 데이터중 모델링에 사용 될 후보변수가 동일값 비율이 90% 이상인 경우에 제외하는 분포분석단계(S301)를 수행하고, 후보변수와 타겟간 의 평균 차이가 유의미한지 통계적 검증을 수행하는 연속형 변수 유의성 검증을 수행하고, 범주(Class)별 관측 값과 기대값의 통계적 차이를 검증하는 범주형 변수 유의성 검증을 수행하는 단변량유의성분석단계(S302)를 수 행하고, 기업대출 사기/사기의심을 위하여 점검해야 하는 점검항목 변수, 예를들어 필수점검대상인지, 과거담보 대출보유수, 최근 3개월타행소액신용대출발생횟수, 과거타행여신계좌보유수, 과거 당행여신계좌보유수, 2년이내 요구불사고신고이력수, 퇴지견금보유 여부 등 가계점검 항목변수를 추가하면서 모델을 검증하는 단계(S303)를 수행하고, 유의성 검증후 남은 변수를 사용하되, 필요시 변수 타입을 변경하여 유의한 변수를 생성하여 후보변 수를 도출하고, 후보변수가 많을 경우 모델링 전에 다변량 변수를 피처로 선택하여 최종후보변수를 결정하는최 종후보변수 도출(후보변수 도출, 피쳐선택) 단계(S304)를 수행하고, 모델링 변수 세트를 비지니스 모델 및 룰로 서 선택하여 모델링 적용 변수를 생성하는 모델링 변수 설정단계(S305)를 포함할 수 있다. 도 9a 및 도 9b는 각각 최종후보변수를 도출하는 개념을 나타내는 도면이다. 도 9a에 도시된 바와 같이, 기업대출의 사기/사기의심을 모델링하기 위해서는 변수 선정을 위해 모델을 20회 시 행하며 각 시행 별 컬럼 샘플링을 1000회 수행하여 PRAUC를 최적화 하는 상위 50개의 변수들을 선정하였다. 또한, 도 9b에 도시된 바와 같이, 전체 데이터에 대해 최종 변수 선정을 위해 Bayesian 법칙에 기반한 Hyperparameter 최적화 알고리즘인 Bayesian Optimization을 응용, 각 변수를 Hyperparameter로 지정하고 모델 을 시행하여 PRAUC를 최적화하는 변수를 선정하였다. 베이지안법칙을 통해서 이전에 사용한 변수 및 평가결과 반응을 이용하여 변수를 선정하는 것으로, 모델의 성능 을 최대로 만들어주는 최적의 하이퍼파라미터값을 탐색할 수 있다. [표 2]에 도시된 바와 같이, 모델의 성능을 최대로 만들어주는 최적의 하이퍼파라미터값은 총 34개로 아래와 같 다.[표 2]"}
{"patent_id": "10-2020-0162698", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기업사기 대출 예측 모델의 안정성, 예측력 및 설명력을 고려하여 고공간분할기반 이상탐지 알고리즘인 isolation forest, 코사인 유도활용 K-means 기반의 이상탐지 알고리즘인 KCOD, 자기지도학습기반의 이상탐지 신경망 알고리즘인 Autoencoder, 두시스템이 상호경쟁하는 방식으로 학습을 진행하는 생성적 적대 신경망 알고 리즘인 GAN을 대상으로 모델적합결과를 비교하여 최적 모델을 선정하였다. 도 8b 및 도 10에 도시된 바와 같이, 기업대출 사기/사기의심에 대한 상시감사 모델개발/비교분석단계(S35)는 후보변수와 타겟으로 이루어진 학습데이터를 활용하여 모델을 개발하고 이 모델을 통해 대출 신청건별 사기확률 계산 후 모델의 성능을 평가하여 최적의 모델을 선정하기 위하여, 선정모델을 개발하는 단계(S351)와 상기 선 정모델을 이용하여 대출신청건별 사기대출확률을 인구통계, 재직/소득, 은행거래 등 후보변수 및 타겟 등 학습 데이터를 활용하여 기업대출 사기/사기의심신청건별 사기확률을 계산하는 사기대출확률을 도출하는 단계(S352) 와, 모델예측 스코어별 내림차순 청렬을 하여 예측확률과 실제로 해당 신청이 정상인지 사기인지여부를 판별하 여 모델을 평가하는 단계(S353) 및 모델에 대한 성능지표계산 및 비교단계(S354)를 포함할 수 있다. 상기 모델에 대한 성능지표계산 및 비교단계(S354)는 각각의 신청건별로 위아래건을 정상과 사기로 구분하여 건 별 정밀도와 재현율을 구해서 커브를 생성할 수 있다. 정밀도는 실제사기건수와 모델사기예측건수의 비를 나타내며, 재현율을 모델사기예측건수와 실제사기건수의 비 를 나타내는 것으로, PRAUC(Area under curve precision recall) 분석, 예컨대 정밀도, 재현율 곡선 아래의 영 역의 면적을 분석하여, 1에 가까울수록 모델이 우수하다고 판단하는데, 정상대비 사기비율이 1.099%와 같이 데 이터 불균형이 발생하는 경우에 사용할 수 있다. 도 11a는 4개의 알고리즘의 분석결과의 산포도 그래프이고 도 11b는 4개의 알고리즘의 2종오류 제거정도를 나타 내는 표이고, 도 11c는 기업사기예측모델 성능결과를 나타내는 그래프이다. 도 11a에 도시된 바와 같이, 4개의 알고리즘의 분석결과의 산포도 그래프에 있어서, 2종 오류(사기를 정상으로 예측하는 오류)를 제거할 수 있는 임계값을 cut-off로 설정하면, isolation Forest 알고리즘에 대해서 2종 오류 가 완전히 제거되는 것을 확인하였다. 도 11b에 도시된 바와 같이, 비지도학습을 전체 정상건 3,463건, 사기 43건 중 정상 1092건, 사기 43건에 대해 테스트 수행하여 4개 알고리즘의 2종오류 제거 정도를 비교해 본 결과 Isolation Forest 모델이 2종 오류를 완 전히 제거한 것을 확인하였다. 도 11c에 도시된 바와 같이, 4개 알고리즘의 성능을 비교해본 결과 AUC, PRAUC 값이 1에 가까워 성능면에서도 Isolation Forest 모델이 타 모델과 비교시 가장 우수한 것으로 판단된다. 도 12a 및 도 12b는 각각 도 3의 감사단말에 제공하는 화면예시도의 변형예를 나타내는 도면이다. 도 12a에 도시된 바와 같이, 감사단말에 사기예측결과의 설명력을 높이기 위하여 근거 항목을 산출 표시하 는데 머신러닝 모델해석 라이브러리 SHAP(SHapely additive exPlanation)을 활용하여 예측건별 변수의 영향도를 방향과 크기로 표시할 수도 있으며, 도 12b에 도시된 바와 같이, 머신러닝 예측결과를 사기스코어로 표시하며,근거항목을 표시할 수 있다. 도 13a 및 도 13b는 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법 을 이용할 경우 가계사기의심예측결과를 사후적으로 검증한 결과를 나타내며, 도 13b의 사기 및 사기의심 기준 을 나타내는 그래프이다. 도 13a 및 도 13b에 도시된 바와 같이, 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법을 이용할 경우 모델이 실제 정상을 사기 또는 사기의심으로 예측한 건에 대해 사후적인 검증 을 수행한 결과 실제 정상에 대해서 사기의심이 검증될 수 있었다. 이는 도 13b에 도시된 바와 같이, 정상, 사기의심 및 사기의 스코어가 서로 중첩되는 부분이 발생하기 때문으로 사기의심 스코어를 두어 검증할 수 있어서 바람직하다."}
{"patent_id": "10-2020-0162698", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일시스템에 따른 인공지능을 이용한 상시감사지원시스템의 전체 구성도를 나타낸다. 도 2는 도 1의 감사정보시스템의 내부 구성을 설명하는 블록도이다.도 3은 도 1의 감사정보시스템이 감사단말에 제공하는 화면예시도이다. 도 4는 도 1의 본 발명의 일 실시예에 따른 인공지능감사 분석시스템의 내부 구성을 설명하는 블록도이다. 도 5는 도 4의 인공지능감사분석시스템과 도 2의 감사정보시스템 사이의 인터페이스 구성도를 나타낸다. 도 6은 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법의 플로우챠트 이다. 도 7은 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법에 사용된 사 기/사기의심 기업대출 사기/사기의심에 대한 지도학습과 비지도학습의 연동관계를 설명하는 개념도이다. 도 8a 및 도 8b는 도 6의 단계 S30 및 S35의 분석 데이터 중 모델링에 사용될 후보 변수를 도출하는 방법과, 학 습데이터를 가공하는 방법을 나타내는 플로우챠트이다. 도 9a 및 도 9b는 각각 최종후보변수를 도출하는 개념을 나타내는 도면이다. 도 10은 기업대출 사기/사기의심 상시감사 모델개발 및 모델평가에 대한 개념을 나타내는 개념도이다. 도 11a는 4개의 알고리즘의 분석결과의 산포도 그래프이고 도 11b는 4개의 알고리즘의 2종오류 제거정도를 나타 내는 표이고, 도 11c는 기업사기예측모델 성능결과를 나타내는 그래프이다. 도 12a 및 도 12b는 각각 도 3의 감사단말에 제공하는 화면예시도의 변형예를 나타내는 도면이다. 도 13a 및 도 13b는 본 발명의 일 실시예에 따른 인공지능을 이용한 기업대출 사기/사기의심 상시감사지원방법 을 이용할 경우 가계사기의심예측결과를 사후적으로 검증한 결과를 나타내며, 도 13b의 사기 및 사기의심 기준 을 나타내는 그래프이다."}
