{"patent_id": "10-2019-0093474", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0015123", "출원번호": "10-2019-0093474", "발명의 명칭": "인공지능 로봇청소기 및 그를 포함하는 로봇 시스템", "출원인": "엘지전자 주식회사", "발명자": "김강은"}}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외형을 형성하는 본체;물을 저장하는 물탱크;바닥에 접촉하여 회전하면서 상기 본체를 이동시키는 한 쌍의 회전맙;상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 물탱크와 연결되어 있으며, 상기 회전맙에 물을 방사하는 노즐을 구동하는 펌프; 및상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 읽어 상기 회전맙의 함수율을 판단하여 상기물탱크의 물 부족 여부를 판단하는 제어부를 포함하는 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제어부는,상기 구동모터의 출력 전류를 주기적으로 읽어 들여 상기 출력 전류가 임계 값보다 작을 때, 상기 물탱크의 물이 부족한 것으로 판단하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 임계값은 습식청소가능한 함수율의 최소값에 대응하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,제 1 항에 있어서,상기 제어부는, 상기 임계값과 상기 구동모터의 출력 전류를 비교하여 상기 물 부족 여부를 판단할 때, 상기 펌프의 동작 상태를 융합하여 판단하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 구동모터의 출력 전류가 임계값보다 작을 때, 상기 펌프가 정상 동작하는 경우, 상기 물탱크에 물이 부족한 것으로 판단하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2항에 있어서,상기 구동모터의 출력 전류가 임계값보다 작을 때, 상기 제어부는 외부로부터의 선택 정보에 따라 상기 펌프의동작을 중지하고, 마른 걸레 상태로 청소를 진행하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2021-0015123-3-제 1 항에 있어서,상기 제어부는 상기 구동모터의 출력 전류를 읽어 현재 바닥 상태에 대하여 판단하는 것을 더 포함하는 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 제어부는 상기 구동모터의 출력 전류와 상기 바닥 상태를 대응하는 룩업테이블에 따라 상기 현재 바닥 상태를 판단하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 제어부는 상기 구동모터의 출력 전류가 임계 범위 내를 충족하면 상기 바닥 상태가 습식 청소를 수행할 수있는 것으로 판단하고 청소를 수행하고, 상기 임계 범위를 벗어나면 상기 로봇청소기가 구속된 것으로 판단하는것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서, 상기 구동모터의 출력 전류의 임계 범위는 상기 모터의 청소 초기의 출력 전류에 기초하여 소정 범위를 충족하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서, 상기 구동모터의 출력 전류에 따라 상기 제어부는 충전대로의 복귀 또는 현재 위치에서 정지를 결정하는 것을특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 로봇청소기는 청소구역 내 바닥 상태를 판단하기 위해, 하나 이상의 발광소자와 하나 이상의 수광소자를구비하는 클리프센서를 더 포함하며, 상기 제어부는 상기 모터의 출력 전류 및 상기 클리프센서의 수광량에 따라 상기 바닥 상태를 판단하는 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청소구역 내에 습식 청소를 수행하기 위한 로봇청소기;상기 로봇청소기와 송수신하며 상기 로봇청소기의 제어를 수행하는 서버; 및상기 로봇청소기 및 상기 서버와 연동하며 상기 로봇청소기의 제어에 대한 어플리케이션이 활성화되어 상기 로봇청소기에 대한 제어를 수행하는 사용자 단말을 포함하며,상기 로봇청소기는 바닥에 접촉하여 회전하면서 본체를 이동시키는 한 쌍의 회전맙;상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 물탱크와 연결되어 있으며, 상기 회전맙에 물을 방사하는 노즐을 구동하는 펌프; 및상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 읽어들여 상기 회전맙의 함수율을 판단하여 상공개특허 10-2021-0015123-4-기 물탱크의 물 부족 여부를 판단하는 제어부를 포함하는 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제어부는,상기 구동모터의 출력 전류를 주기적으로 읽어 상기 출력 전류가 상기 회전맙의 함수율의 임계 값보다 작을 때,상기 물탱크의 물이 부족한 것으로 판단하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 임계값과 상기 구동모터의 출력 전류를 비교하여 상기 물 부족 여부를 판단할 때, 상기 펌프의 동작 상태를 융합하여 판단하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 구동모터의 출력 전류가 임계값보다 작은 때, 상기 펌프가 정상 동작하는 경우, 상기 물탱크에 물이 부족한 것으로 판단하고, 상기 사용자 단말로 상기 물부족 정보를 알람하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 13 항에 있어서,상기 구동모터의 출력 전류가 임계값보다 작은 때, 상기 사용자 단말은 마른걸레청소 또는 청소 중지에 해당하는 아이콘을 표시하고, 선택되는 정보를 상기 로봇청소기에 전송하여 상기 로봇청소기의 동작을 제어하는 것을특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13 항에 있어서,상기 제어부는 상기 구동모터의 출력 전류를 읽어 들여 현재 바닥 상태에 대하여 판단하는 것을 더 포함하는,로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 13 항에 있어서,상기 제어부는 상기 구동모터의 출력 전류와 바닥 상태를 대응하는 룩업테이블에 따라 상기 현재 바닥 상태를판단하여 동작을 수행하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 13 항에 있어서,상기 제어부는 상기 구동모터의 출력 전류가 임계 범위 내를 충족하면 바닥상태가 습식 청소를 수행할 수 있는것으로 판단하고 청소를 수행하고, 상기 임계 범위를 벗어나면 상기 사용자 단말로 상기 로봇청소기가 구속된것으로 알람하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 외형을 형성하는 본체; 물을 저장하는 물탱크; 바닥에 접촉하여 회전하면서 상기 본체를 이동시키는 한 쌍의 회전맙; 상기 한 쌍의 회전맙을 회전시키는 구동모터; 및 상기 한 쌍의 회전맙이 회전할 때, 상기 구동 모터의 출력 전류를 읽어 상기 회전맙의 함수율을 판단하여 상기 물탱크의 물 부족 여부를 판단하는 제어부를 포 함하는 로봇청소기를 제공한다. 따라서, 별도의 함수율 감지센서를 구비하지 않고, 로봇청소기의 회전맙의 함수 율을 측정할 수 있어 비용 및 공간 활용에 효과적인 로봇청소기를 제공할 수 있다."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇청소기의 제어방법에 관한 것으로, 보다 상세하게는 회전맙을 사용하는 인공지능 로봇청소기의 제어방법에 관한 것이다."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 가정 내에서의 로봇 사용이 점차 확대되고 있는 추세이다. 이러한 가정용 로봇의 대표적인 예는 청소 로봇 이다. 청소 로봇은 이동형 로봇으로서 일정 영역을 스스로 주행하며 바닥에 쌓인 먼지 등의 이물질을 흡입함으 로써 청소 공간을 자동으로 청소하는 하거나, 회전맙을 이용하여 이동함과 동시에 회전맙으로 바닥을 닦는 방식 으로 청소할 수 있다. 또한, 회전맙에 물을 공급하여 바닥을 물걸레질하는 방식의 청소도 가능하다. 다만, 회전맙에 공급되는 물을 적절하게 조절하지 않으면, 피청소면인 바닥에 물이 과하게 남거나, 바닥을 마른 걸레질 한 것과 같이, 바닥을 정상적으로 청소할 수 없는 문제점이 있다. 한국 공개 특허 번호 1020040052094호 의 경우, 바닥에 뿌려진 증기를 먼지와 함께 닦아내도록 그 외주면에 걸레용 천을 구비하는 걸레롤러를 포함한 물청소가 가능한 청소용 로봇이 개시되어 있다. 이와 같은 청소용 로봇은 습식청소를 위한 청소바닥 표면에 증 기를 분사하고, 분사된 증기와 먼지를 닦아내도록 걸레용 천을 구비한다. 또한, 한국 공개 특허 번호 20140146702호에는 습식 청소가 가능한 로봇청소기 내측에 물이 수용될 수 있는지를 판단하는 로봇청소기 및 제 어방법이 개시되어 있다. 그러나, 현재 회전맙에 물이 어느 정도 포함되어 있는지 감지하는 기술에 대하여는 침묵하고 있다. 한편, 한국 공개 특허 KR20090019480A 호의 경우, 청소 구역을 주행하면서 바닥, 절벽뿐만 아니라 발판과 문턱 동시 감지 기능을 위한 적외선 센서 구비하는 로봇청소기가 개시되어 있으며, 한국 등록특허 10-1412581B1호 는 광량을 이용하여 바닥, 언덕, 절벽을 감지하는 로봇 청소기에 대하여 기술하고 있다. 그러나, 이와 같은 종래 기술에서도 습식 청소를 수행하는 로봇 청소기에서 현재 바닥의 상태에 대한 감지를 위 해 별도의 센서를 구비하고 있어 비용 및 장비에 대한 문제가 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 특허 공개 번호 1020040052094 (공개일 2004.06.19) (특허문헌 0002) 한국 공개 특허 번호 20140146702호(공개일 2014.12.29) (특허문헌 0003) 한국 등록특허 10-1412581B1호 (공개일 2009.06.16)"}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 별도의 함수율 감지센서를 구비하지 않고, 로봇청소기의 회전맙의 함수율을 측정하는 로봇청소기의 제어방법을 제공하는 것이다. 본 발명의 다른 과제는 로봇청소기의 회전맙의 모터의 출력 전류의 변화를 감지하여 이와 같은 전류 값의 변화 에 따라 함수율을 판단할 수 있는 로봇청소기의 제어방법을 제공하는 것이다. 본 발명의 또 다른 과제는 회전맙 모터의 출력 전류 값을 읽어들여 이에 따라 현재 바닥의 상태를 판단할 수 있 는 로봇청소기의 제어방법을 제공하는 것이다. 본 발명의 또 다른 과제는 로봇청소기의 함수율을 판단하여 이에 대한 알람을 사용자 단말의 어플리케이션을 통 해 제공함으로써 사용자의 문제 해결을 유도할 수 있는 로봇청소기의 제어방법을 제공하는 것이다. 본 발명은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로부터 당 업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 외형을 형성하는 메인바디; 물을 저장하는 물탱크; 바닥에 접촉하여 회전하면서 상기 메인바디를 이 동시키는 한 쌍의 회전맙; 상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 물탱크와 연결되어 있으며, 상기 회전맙에 물을 방사하는 노즐을 구동하는 펌프; 및 상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 읽어 상기 회전맙의 함수율을 판단하여 상기 물탱크의 물 부족 여부를 판단하는 제어부를 포함하는 로봇청 소기를 제공한다. 본 발명은 구동 모터의 출력 전류와 함수율 사이의 상관 관계에 의해 주기에 따라 구동 모터의 출력 전류를 읽 어들여 현재 회전맙의 함수율을 판단할 수 있다. 상기 제어부는, 상기 구동모터의 출력 전류를 주기적으로 읽어들여 상기 출력 전류가 임계 값보다 작을 때, 상 기 물탱크의 물이 부족한 것으로 판단할 수 있다. 상기 임계값은 습식청소가능한 최소 함수율 값에 대응할 수 있다. 따라서, 제어부는 현재 주기의 함수율이 임계 값보다 작은 경우, 습식 청소 가능한 상태가 아닌 것으로 판단할 수 있다. 상기 제어부는, 상기 임계값과 상기 구동모터의 출력 전류를 비교하여 상기 물 부족 여부를 판단할 때, 상기 펌 프의 동작 상태를 융합하여 판단할 수 있다. 상기 구동모터의 출력 전류가 임계값보다 작을 때, 상기 펌프가 정상 동작하는 경우, 상기 물탱크에 물이 부족 한 것으로 판단할 수 있다. 상기 구동모터의 출력 전류가 임계값보다 작을 때, 상기 제어부는 외부로부터의 선택 정보에 따라 상기 펌프의 동작을 중지하고, 마른 걸레 상태로 청소를 진행할 수 있다. 사용자 단말 또는 입력부에 의한 직접 입력에 따른 외부로부터의 선택 정보에 따라 함수율이 임계값보다 작은 상태로 마른 걸레 청소를 진행할 수 있다. 상기 제어부는 상기 구동모터의 출력 전류를 읽어 현재 바닥 상태에 대하여 판단할 수 있다. 상기 제어부는 상기 구동모터의 출력 전류와 상기 바닥 상태를 대응하는 룩업테이블에 따라 상기 현재 바닥 상 태를 판단할 수 있다. 즉, 구동 모터의 출력 전류에 따라 슬립률이 결정될 수 있으며, 그에 따른 바닥상태가 레 벨 별로 정의되어 있을 수 있다. 이와 같은 상관관계에 따라 해당 주기의 출력 전류를 감지하는 것만으로 바닥 상태에 대하여 판단할 수 있다. 상기 제어부는 상기 구동모터의 출력 전류가 임계 범위 내를 충족하면 상기 바닥 상태가 습식 청소를 수행할 수 있는 것으로 판단하고 청소를 수행하고, 상기 임계 범위를 벗어나면 상기 로봇청소기가 구속된 것으로 판단할 수 있다. 상기 구동모터의 출력 전류의 임계 범위는 상기 모터의 청소 초기의 출력 전류에 기초하여 소정 범위를 충족할 수 있다. 이와 같이, 초기 출력 전류에 기초하여 임계 범위를 설정함으로써 해당 청소 구역의 특성을 반영하여 급변하는 바닥 상태에 대하여 감지할 수 있다. 상기 구동모터의 출력 전류에 따라 상기 제어부는 충전대로의 복귀 또는 현재 위치에서 정지를 결정할 수 있다. 상기 로봇청소기는 청소구역 내 바닥 상태를 판단하기 위해, 하나 이상의 발광소자와 하나 이상의 수광소자를 구비하는 클리프센서를 더 포함하며, 상기 제어부는 상기 모터의 출력 전류 및 상기 클리프센서의 수광량에 따 라 상기 바닥 상태를 판단할 수 있다. 한편, 본 발명은 청소구역 내에 습식 청소를 수행하기 위한 로봇청소기; 상기 로봇청소기와 송수신하며 상기 로 봇청소기의 제어를 수행하는 서버; 및 상기 로봇청소기 및 상기 서버와 연동하며 상기 로봇청소기의 제어에 대 한 어플리케이션이 활성화되어 상기 로봇청소기에 대한 제어를 수행하는 사용자 단말을 포함하며, 상기 로봇청 소기는 바닥에 접촉하여 회전하면서 메인바디를 이동시키는 한 쌍의 회전맙; 상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 물탱크와 연결되어 있으며, 상기 회전맙에 물을 방사하는 노즐을 구동하는 펌프; 및 상기 한 쌍 의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 읽어들여 상기 회전맙의 함수율을 판단하여 상기 물탱크 의 물 부족 여부를 판단하는 제어부를 포함하는 로봇 시스템을 제공한다. 상기 제어부는, 상기 구동모터의 출력 전류를 주기적으로 읽어 상기 출력 전류가 상기 회전맙의 함수율의 최소 값에 대응하는 임계 값보다 작을 때, 상기 물탱크의 물이 부족한 것으로 판단할 수 있다. 상기 임계값과 상기 구동모터의 출력 전류를 비교하여 상기 물 부족 여부를 판단할 때, 상기 펌프의 동작 상태 를 융합하여 판단할 수 있다.상기 구동모터의 출력 전류가 임계값보다 작은 때, 상기 펌프가 정상 동작하는 경우, 상기 물탱크에 물이 부족 한 것으로 판단하고, 상기 사용자 단말로 상기 물부족 정보를 알람할 수 있다. 따라서, 로봇청소기의 함수율을 판단하여 이에 대한 알람을 사용자 단말의 어플리케이션을 통해 제공함으로써 사용자의 문제 해결을 유도할 수 있는 로봇청소기의 제어방법을 제공할 수 있다. 상기 구동모터의 출력 전류가 임계값보다 작은 때, 상기 사용자 단말은 마른걸레청소 또는 청소 중지에 해당하 는 아이콘을 표시하고, 선택되는 정보를 상기 로봇청소기에 전송하여 상기 로봇청소기의 동작을 제어할 수 있다. 상기 제어부는 상기 구동모터의 출력 전류를 읽어 들여 현재 바닥 상태에 대하여 판단하는 것을 더 포함할 수 있다. 상기 제어부는 상기 구동모터의 출력 전류와 상기 바닥 상태를 대응하는 룩업테이블에 따라 상기 현재 바닥 상 태를 판단하여 동작을 수행할 수 있다. 상기 제어부는 상기 구동모터의 출력 전류가 임계 범위 내를 충족하면 상기 바닥상태가 습식 청소를 수행할 수 있는 것으로 판단하고 청소를 수행하고, 상기 임계 범위를 벗어나면 상기 사용자 단말로 상기 로봇청소기가 구 속된 것으로 알람할 수 있다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 로봇청소기에 따르면 다음과 같은 효과가 하나 혹은 그 이상 있다. 본 발명은 별도의 함수율감지센서를 구비하지 않고, 로봇청소기의 회전맙의 함수율을 측정할 수 있어 비용 및 공간 활용에 효과적인 로봇청소기를 제공할 수 있다. 또한, 로봇청소기의 회전맙의 모터의 출력 전류의 변화를 감지하여 이와 같은 전류 값의 변화에 따라 함수율을 판단할 수 있으며, 현재 바닥의 상태를 판단할 수 있다. 그리고, 로봇청소기의 함수율을 판단하여 이에 대한 알람을 사용자 단말의 어플리케이션을 통해 제공함으로써 사용자의 문제 해결을 유도할 수 있다."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 언급되는 “전(F)/후(R)/좌(Le)/우(Ri)/상(U)/하(D)” 등의 방향을 지칭하는 표현은 도면에 표시된 바 에 따라 정의하나, 이는 어디까지나 본 발명이 명확하게 이해될 수 있도록 설명하기 위한 것이며, 기준을 어디 에 두느냐에 따라 각 방향들을 다르게 정의할 수도 있음은 물론이다. 이하에서 언급되는 구성요소 앞에 ‘제1, 제2' 등의 표현이 붙는 용어 사용은, 지칭하는 구성요소의 혼동을 피 하기 위한 것일 뿐, 구성요소 들 사이의 순서, 중요도 또는 주종관계 등과는 무관하다. 예를 들면, 제1 구성요 소 없이 제2 구성요소 만을 포함하는 발명도 구현 가능하다. 도면에서 각 구성의 두께나 크기는 설명의 편의 및 명확성을 위하여 과장되거나 생략되거나 또는 개략적으로 도 시되었다. 또한 각 구성요소의 크기와 면적은 실제크기나 면적을 전적으로 반영하는 것은 아니다. 또한, 본 발명의 구조를 설명하는 과정에서 언급하는 각도와 방향은 도면에 기재된 것을 기준으로 한다. 명세 서에서 구조에 대한 설명에서, 각도에 대한 기준점과 위치관계를 명확히 언급하지 않은 경우, 관련 도면을 참조 하도록 한다. 도 1은 본 발명의 일 실시예에 따른 로봇 시스템의 구성도이다. 도 1은 본 발명의 일 실시예에 따른 인공지능 로봇 시스템의 구성도이다. 도 1을 참고하면, 본 발명의 실시예에 따른 로봇 시스템은, 하나 이상의 로봇청소기를 구비하여 집 등의 규정된 장소에서 서비스를 제공할 수 있다. 예를 들어, 로봇 시스템은 가정 등에서 지정된 장소의 청소 서비스 를 제공하는 로봇청소기를 포함할 수 있다. 특히 이러한 로봇청소기는 포함하는 기능 블럭에 따라 건 식, 습식 또는 건/습식의 청소 서비스를 제공할 수 있다. 바람직하게는, 본 발명의 일 실시예에 따른 로봇 시스템은, 복수의 인공지능 로봇청소기 및 복수의 인공지 능 로봇청소기를 관리하고 제어할 수 있는 서버를 포함할 수 있다. 서버는 원격에서 복수의 로봇청소기의 상태를 모니터링하고, 제어할 수 있고, 로봇 시스템은 복수의 로 봇청소기를 이용하여 더 효과적인 서비스 제공이 가능하다. 복수의 로봇 청소기 및 서버는 하나 이상의 통신 규격을 지원하는 통신 수단(미도시)을 구비하여, 상호 통신할 수 있다. 또한, 복수의 로봇청소기 및 서버는 PC, 이동 단말기, 외부의 다른 서버와 통신할 수 있다. 예를 들어, 복수의 로봇청소기 및 서버는 IEEE 802.11 WLAN, IEEE 802.15 WPAN, UWB, Wi-Fi, Zigbee, Z-wave, Blue-Tooth 등과 같은 무선 통신 기술로 무선 통신하게 구현될 수 있다. 로봇청소기는 통신하고자 하는 다른 장치 또는 서버의 통신 방식이 무엇인지에 따라 달라질 수 있다. 특히, 복수의 로봇청소기는 5G 네트워크를 통해 다른 로봇 및/또는 서버와 무선통신을 구현할 수 있다. 로봇청소기가 5G 네트워크를 통해 무선 통신하는 경우, 실시간 응답 및 실시간 제어가 가능하다. 사용자는 PC, 이동 단말기 등의 사용자 단말을 통하여 로봇 시스템 내의 로봇들에 관한 정보를 확인할 수 있다. 서버는 클라우드(cloud) 서버로 구현되어, 로봇에 클라우드 서버가 연동되어 로봇청소기를 모니터링, 제어하고 다양한 솔루션과 콘텐츠를 원격으로 제공할 수 있다. 서버는, 로봇청소기, 기타 기기로부터 수신되는 정보를 저장 및 관리할 수 있다. 상기 서버는 로봇 청소기의 제조사 또는 제조사가 서비스를 위탁한 회사가 제공하는 서버일 수 있다. 상기 서버는 로 봇청소기를 관리하고 제어하는 관제 서버일 수 있다. 상기 서버는 로봇청소기를 일괄적으로 동일하게 제어하거나, 개별 로봇청소기 별로 제어할 수 있 다. 한편, 상기 서버는, 복수의 서버로 정보, 기능이 분산되어 구성될 수도 있고, 하나의 통합 서버로 구성 될 수도 있을 것이다. 로봇청소기 및 서버는 하나 이상의 통신 규격을 지원하는 통신 수단(미도시)을 구비하여, 상호 통신할 수 있다. 로봇청소기는 공간(space), 사물(Object), 사용(Usage) 관련 데이터(Data)를 서버로 전송할 수 있다. 여기서, 데이터는 공간(space), 사물(Object) 관련 데이터는 로봇청소기가 인식한 공간(space)과 사물 (Object)의 인식 관련 데이터이거나, 영상획득부가 획득한 공간(space)과 사물(Object)에 대한 이미지 데이터일 수 있다. 실시예에 따라서, 로봇청소기 및 서버는 사용자, 음성, 공간의 속성, 장애물 등 사물의 속성 중 적어도 하나를 인식하도록 학습된 소프트웨어 또는 하드웨어 형태의 인공신경망(Artificial Neural Networks: ANN)을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 로봇청소기 및 서버는 딥러닝(Deep Learning)으로 학습된 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경 망(Deep Neural Network: DNN)을 포함할 수 있다. 예를 들어, 로봇청소기의 제어부에는 CNN(Convolutional Neural Network) 등 심층신경망 구조(DNN)가 탑재될 수 있다. 서버는 로봇청소기으로부터 수신한 데이터, 사용자에 의해 입력되는 데이터 등에 기초하여, 심층신경망 (DNN)을 학습시킨 후, 업데이트된 심층신경망(DNN) 구조 데이터를 로봇으로 전송할 수 있다. 이에 따라, 로 봇이 구비하는 인공지능(artificial intelligence)의 심층신경망(DNN) 구조를 업데이트할 수 있다. 또한, 사용(Usage) 관련 데이터(Data)는 로봇청소기의 사용에 따라 획득되는 데이터로, 사용 이력 데이터, 센서부에서 획득된 감지 신호 등이 해당될 수 있다. 학습된 심층신경망 구조(DNN)는 인식용 입력 데이터를 입력받고, 입력 데이터에 포함된 사람, 사물, 공간의 속 성을 인식하여, 그 결과를 출력할 수 있다. 또한, 상기 학습된 심층신경망 구조(DNN)는 인식용 입력 데이터를 입력받고, 로봇청소기의 사용(Usage) 관 련 데이터(Data)를 분석하고 학습하여 사용 패턴, 사용 환경 등을 인식할 수 있다. 한편, 공간(space), 사물(Object), 사용(Usage) 관련 데이터(Data)는 통신부를 통하여 서버로 전송될 수 있 다. 서버는 수신한 데이터에 기초하여, 심층신경망(DNN)을 학습시킨 후, 업데이트된 심층신경망(DNN) 구조 데이 터를 인공지능 로봇청소기로 전송하여 업데이트하게 할 수 있다. 이에 따라, 로봇이 점점 스마트하게 되며, 사용할수록 진화되는 사용자 경험(UX)을 제공할 수 있다. 한편, 서버는 로봇청소기의 제어 및 현재 상태 등에 대한 정보를 사용자 단말에 제공할 수 있으며, 이 와 같은 로봇청소기의 제어를 위한 어플리케이션을 생성하여 배포가능하다. 이러한 어플리케이션은 사용자 단말로서 적용되는 PC용 어플리케이션일 수 있으며, 또는 스마트폰용 어플리 케이션일 수 있다. 일 예로, 본 출원인의 다양한 전자제품을 동시에 제어하고 관리 감독가능한 어플리케이션인 SmartThinQ 어플리 케이션과 같은 스마트 가전 제어를 위한 어플리케이션일 수 있다. 도 2는 본 발명의 일 실시예에 따른 로봇청소기의 사시도이고, 도 3은 본 발명의 일 실시예에 따른 로봇청소기 의 저면도이며, 도 4는 본 발명의 일 실시예에 따른 로봇청소기의 저면도의 다른 상태도이다. 도 2 내지 도 4를 참조하여, 본 실시예에 따른 회전맙의 회전으로 모션하는 로봇청소기의 구성을 간단히 설명한다. 본 발명의 일 실시예에 따른 로봇청소기는 영역 내에서 이동하며, 주행 중에 바닥면의 이물질을 제거한다. 또한, 로봇청소기은 충전대로부터 공급되는 충전전원을 배터리(미도시)에 저장하여 영역을 주행한다. 로봇청소기는 지정된 동작을 수행하는 본체와, 본체의 전면에 배치되어 장애물을 감지하는 장애물 감지부(미도시), 360도의 영상을 촬영하는 영상획득부를 포함한다. 본체는 외관을 형성하며 내측으로 본체를 구성하는 부품들이 수납되는 공간을 형성하는 케이싱(미도시)과, 회전 가능하게 구비되는 회전맙 , 본체의 이동 및 청소를 보조하는 롤러, 충전대로부터 충전전원이 공급되는 충전단자를 포 함한다. 회전맙은 케이싱에 배치되고 바닥면을 향해 형성되어 걸레포가 탈부착되도록 구성된다. 회전맙는 제 1 회전판과 제 2 회전판을 포함하여, 회전을 통해 본체가 영역의 바닥을 따라 이동되도록 한다. 본 실시예에 따른 로봇청소기는 본체 내측에 배치되어 물을 저장하는 물탱크와, 물탱크에 저 장된 물을 회전맙으로 공급하는 펌프와, 상기 펌프와 물탱크 또는 펌프와 회전맙을 연 결하는 연결유로를 형성하는 연결호스를 더 포함할 수 있다. 본 실시예에 따른 로봇청소기는 한 쌍의 회전맙을 포함하고, 한 쌍의 회전맙을 회전하여 이동한다. 본체는 회전맙의 제 1 회전판 및 제 2 회전판이 회전축을 중심으로 회전 동작함에 따라 전, 후, 좌, 우로 주행한다. 또한, 본체는 제 1 회전판과 제 2 회전판(81, 82)이 회전 동작함에 따라, 부착된 걸레포에 의해 바닥면의 이물질이 제거되어 습식 청소를 수행한다. 본체는 제 1 회전판 및 제 2 회전판을 구동시키는 구동부(미도시)를 포함할 수 있다. 구동부는 적 어도 하나의 구동모터를 포함할 수 있다. 본체의 상면에는 사용자로부터 로봇청소기의 제어를 위한 각종 명령을 입력받는 조작부(미도시)를 포 함하는 컨트롤 패널이 구비될 수 있다. 또한, 본체의 전면 또는 상면에는 영상획득부가 배치된다. 영상획득부는 실내 영역에 대한 영상을 촬영한다. 영상획득부를 통해 촬영된 영상을 바탕으로 실내 영역에 대한 감시뿐 아니라, 본체 주변의 장애물을 감지할 수 있다. 영상획득부는 소정 각도로 전상방향을 향해 배치되어 이동 로봇의 전방과 상방을 촬영할 수 있다. 영상획 득부는 전방을 촬영하는 별도의 카메라가 더 포함될 수 있다. 영상획득부는 본체의 상부에 배치 되어 천장을 향하도록 구비될 수 있으며, 경우에 따라 복수의 카메라가 각각 구비될 수 있다. 또한, 영상획득부 는 바닥면을 촬영하는 카메라가 별도로 구비될 수 있다. 로봇청소기는 현재의 위치정보를 획득하기 위한 위치획득수단(미도시)을 더 포함할 수 있다. 로봇청소기 은, GPS, UWB를 포함하여 현재 위치를 판단할 수 있다. 또한 로봇청소기은 영상을 이용하여 현재위치 를 판단할 수 있다. 본체에는 재충전이 가능한 배터리(미도시)가 구비되며, 배터리의 충전단자가 상용 전원(예를 들어, 가 정 내의 전원 콘센트)과 연결되거나, 상용 전원과 연결된 충전대에 본체가 도킹되어, 충전 단자가 충 전대의 단자와의 접촉을 통해 상용 전원과 전기적으로 연결되어 본체로 공급되는 충전전원에 의해 배터 리의 충전이 이루어질 수 있다. 로봇청소기를 구성하는 전장 부품들은 배터리로부터 전원을 공급받을 수 있으며, 따라서, 배터리가 충전된 상태에서 로봇청소기는 상용 전원과 전기적으로 분리된 상태에서 자력 주행이 가능하다. 이하, 로봇청소기는 습식 청소용 이동 로봇인 것을 예로 하여 설명하나, 이에 한정되지 아니하며, 영역을 자율 주행하며 소리를 감지하는 로봇이라면 적용 가능함을 명시한다. 본 실시예의 로봇청소기에 사용되는 회전맙은 극세사 또는 패브릭 형태의 맙패드를 장착한다. 따라서, 회전맙의 회전 시, 로봇청소기이 실제 회전맙의 회전에 비해 이동하지 못하는 슬립이 발생한다. 회전맙은 바닥에 평행한 회전축으로 구동하는 롤링맙이나, 바닥에 거의 수직한 회전축으로 구동하는 스핀맙 을 포함할 수 있으며, 이하에서는 본 발명의 회전맙의 하나의 형태인 스핀맙을 기준으로 회전맙의 함수 율을 측정하는 내용을 설명한다. 이하에서 슬립률이란, 회전맙이 바닥면을 회전함에 따라 발생하는 슬립의 정도를 말하며, 슬립률이 '0'인 상태에서, 로봇청소기는 이상적인 회전속도로 이동할 수 있다. 또한, 함수율이란, 회전맙이 물을 포함하는 정도를 말하며, 함수율이 '0'인 상태는 회전맙에 물이 전혀 포함되지 않은 상태를 의미한다. 본 실시예에 따른 함수율은 맙패드의 무게에 따른 물을 포함하는 비율로 설정 할 수 있다. 회전맙은 맙패드의 무게와 동일한 무게의 물을 포함하거나, 맙패드의 무게를 초과하여 물을 포 함하는 것도 가능하다. 슬립률은 회전맙이 물을 포함하는 정도인 함수율에 따라 다르게 나타날 수 있다. 물을 많이 포함하는 회전 맙일수록 함수율이 높아지면, 물의 영향으로 바닥면과의 마찰력이 많이 발생하여 회전 속도가 감소한다. 모터의 회전 속도의 감소는 모터의 토크가 커짐을 의미하며, 이에 따라 회전맙을 회전시키는 구동 모터 의 출력 전류가 커진다.즉, 함수율이 커지면 증가하는 마찰력에 의해 회전맙을 회전시키는 구동 모터의 출력 전류가 커지는 관 계가 성립한다. 따라서, 구동 모터의 출력 전류를 측정함에 따라 현재 회전맙의 함수율의 상태에 대하여 판단할 수 있 다. 이러한 구동 모터의 출력 전류와 함수율의 관계는 실험적으로 파악할 수 있으며, 이하에서 설명하는 저장부 에 데이터로 저장될 수 있다. 또한, 슬립률과 구동 모터의 출력 전류는 바닥의 재질에 따라 다르게 나 타날 수 있으며, 이 또한, 실험적으로 파악하여 저장부에 데이터로 저장될 수 있다. 본 실시예에 따른 로봇청소기는 본체 내측에 배치되어 물을 저장하는 물탱크와, 물탱크에 저 장된 물을 회전맙으로 공급하는 펌프와, 상기 펌프와 물탱크 또는 펌프와 회전맙을 연 결하는 연결유로를 형성하는 연결호스를 더 포함할 수 있다. 본 실시예에 따른 로봇청소기는 물탱크에 저장된 물을 별도의 펌프 없이, 급수밸브(미도시)를 이용하여 회전맙으로 공급하는 것도 가능하다. 본 실시예에 따른 로봇청소기는 회전맙이 바닥면을 기준으로 일정각도만큼 기울어져 배치될 수 있다. 로봇청소기의 이동이 원활하도록, 회전맙의 전체면에서 고르게 바닥면과 맞닿지 않고, 일정각도(θ)만 큼 기울어져 회전맙의 일정부분에서 주로 맞닿도록 배치될 수 있다. 또한, 회전맙의 전체면에서 바닥면 과 맞닿더라도, 일정부분에서 가장 많은 마찰력이 발생하도록 배치하는 것도 가능하다. 도 4는 도 2의 이동 로봇에 걸레포가 부착된 실시예가 도시된 도이다. 도 4에 도시된 바와 같이, 회전맙은 제 1 회전판 및 제 2 회전판을 포함한다. 제 1 회전판 및 제 2 회전판은 각각 걸레포(91, 92)가 부착될 수 있다. 회전맙은 걸레포가 탈부착 가능하게 구성된다. 회전맙는 걸레포의 부착을 위한 장착부재가 제 1 회전판 및 제 2 회전판에 각각 구비될 수 있다. 예를 들어 회전맙는 걸레포가 부착 및 고정 되도록 벨크로, 끼움부재 등이 구비될 수 있다. 또한, 회전맙는 걸레포가 제 1 회전판 및 제 2 회 전판에 고정시키기 위한 별도의 보조수단으로 걸레포틀(미도시)을 더 포함할 수 있다. 걸레포는 물을 흡수하여 바닥면과의 마찰을 통해 이물질을 제거한다. 걸레포는 면직물 또는 면혼방 등 의 재질이 사용되는 것이 바람직하나, 일정 비율 이상으로 수분을 함유하며 소정 밀도를 갖는 재질이라면 어느 것이나 사용가능 하며, 그 재질은 한정되지 않음을 명시한다. 걸레포는 원형으로 형성된다. 걸레포의 형태는 도면에 한정되지 않으며 사각형, 다각형 등으로 형성될 수 있으나, 제1 및 제 2 회전판 (81, 82)의 회전동작을 고려하여, 제 1 및 제 2 회전판(81, 82)의 회전동작에 방해가 되지 않는 형상으로 구성 되는 것이 바람직하다. 또한, 걸레포는 별도로 구비되는 걸레포틀에 의해 원형으로 그 형상이 변경될 수 있 다. 회전맙는 걸레포가 장착되면, 걸레포가 바닥면에 접하도록 구성된다. 회전맙는 걸레포의 두께를 고려하며, 걸레포의 두께에 따라 케이싱과 제 1 회전판과 제 2 회전판(81, 82)의 이격거리가 변경되 도록 구성된다. 회전맙는 걸레포와 바닥면이 접하도록 케이싱과 회전판(81, 82)의 이격거리를 조정하며, 회전판(81, 82)은 걸레포를 고정시키는 걸레 고정부(미도시)를 포함한다. 상기 걸레 고정부는 걸레포를 탈부착 가 능하게 고정시킬 수 있다. 상기 걸레 고정부는 회전판(81, 82)의 하측에 배치된 밸크로 등이 될 수 있다. 상기 걸레 고정부는 회전판(81, 82)의 가장자리에 배치된 후크 등이 될 수 있다. 도 5는 본 발명의 일 실시예에 따른 로봇청소기의 제어부 및 제어부와 관련된 구성을 도시한 블록도이다. 본 실시예에 따른 로봇청소기는 스핀맙이 회전할 때, 본체의 기준모션에 따른 로봇청소기의 모션 을 감지하는 모션감지유닛을 더 포함한다. 모션감지유닛은 로봇의 회전속도를 검출하는 자이로센서 또는 로봇청소기의 가속도값을 감지하는 가속도센서를 더 포함할 수 있다. 또한, 모션감지유닛 은 로봇청소기의 이동거리를 감지하는 엔코더(미도시)를 사용할 수 있다.본 실시예에 따른 로봇청소기는 회전맙을 회전하는 구동 모터에 동력을 제공하고, 구동 모터 의 출력 전류를 읽어들여 제어부로 전송하는 모터 제어부를 포함한다. 모터 제어부는 단순한 로직이 구현되어 있는 별도의 칩으로 형성될 수 있으며, 제어부와 일체화되고, 기능적으로 분리되어 있을 수 있다. 이와 같은 모터 제어부는 제어부의 시작 신호에 따라 구동 모터를 회전하기 위한 전류를 전송하 고, 설정되어 있는 주기에 따라 상기 구동 모터의 출력 전류를 읽어 들여 제어부에 전달한다. 제어부는 모터 제어부로부터의 출력 전류를 수신하고, 이를 분석하여 현재 스핀맙의 함수율, 스핀맙 의 슬립률 및 그에 따른 바닥의 상태를 판단한다. 즉, 제어부는 구동 모터의 출력 전류에 대한 정보에 따라 로봇청소기가 이동하는 바닥면의 재질 의 종류를 하드플로워(Hard Floor), 대리석 또는 카펫 등으로 구분할 수 있다. 구체적으로, 제어부는 바닥과 마찰되어 있는 스핀맙을 회전시키는 구동 모터의 출력 전류에 대한 정보 를 분석하여 현재 바닥면의 재질을 파악할 수 있다. 이때, 제어부는 별도의 광원과 이미지센서를 구비하는 카메라센서를 이용하여, 복수의 광원에 따른 복수의 영상정보를 획득하고, 획득한 영상정보를 비교하여 바닥의 재질을 파악하는 것도 가능하나 이에 한정되지는 않 는다. 로봇 청소기는 청소 구역 내 바닥에 낭떠러지의 존재 여부를 감지하는 클리프센서를 더 포함할 수 있다. 본 실시예에 따른 클리프센서는 로봇청소기의 전방부분에 배치될 수 있다. 또한, 본 실시예에 따른 클리프 센서는 범퍼의 일측에 배치될 수 있다. 제어부는, 클리프센서를 포함하는 경우, 상기 발광 소자에서 출력된 광이 바닥에서 반사되어 상기 수광 소 자에서 수광되는 반사광의 광량에 기초하여 바닥의 재질을 판별할 수 있으나 이에 한정되는 것은 아니다. 제어부는, 상기 구동 모터의 출력 전류의 값에 따라 회전맙의 스핀맙의 함수율 및 소정 바닥 상태 를 판단한다. 구체적으로, 제어부는 저장부에 저장되어 있는 데이터, 일 예로 룩업테이블로 정리되어 있는 함수율, 바닥 상태 및 출력 전류에 대한 관계에 따라 해당 데이터를 읽어들여 구체적인 함수율 및 바닥 상태를 판단한다. 일 예로, 제어부는 구동 모터의 출력 전류 값과 함수율에 대하여, 해당 출력 전류 값에 대한 임계값을 데이터로 저장하여, 수득된 출력 전류 값과 임계값의 데이터를 비교하여 현재 주기에서의 출력 전류 값이 임계 값보다 작은지 여부를 판단할 수 있다. 이때, 제어부는 노즐로 물을 제공하는 펌프의 동작이 정상적으로 이루어지고 있는지를 함께 읽어들여 현재 물 공급의 이상 여부를 판단할 수 있다. 즉, 펌프의 동작이 정상적으로 진행된 경우에도 출력 전류의 값이 임계값보다 적은 경우에는 물탱크에 함유되어 있는 물의 양이 부족한 것으로 판단하고 그에 따라 알림 및 동작을 제어할 수 있다. 또는, 펌프의 동작이 정상적으로 진행되어 있지 않은 경우에는 펌프 오동작에 따른 알림 및 동작을 제 어할 수 있다. 또는 펌프의 동작이 정상적으로 진행되고, 출력 전류의 값이 임계값 이상인 경우에는 물탱크에 함유되 어 있는 물이 현재까지는 소정 레벨을 유지하고 있는 것으로 판단하여 청소를 연속적으로 진행할 수 있다. 제어부는 소정의 주기에 따라 상기 구동 모터의 출력 전류의 값과 펌프의 동작을 함께 수신하고 분석 하여 로봇 청소기의 동작을 제어할 수 있다. 한편, 제어부는 소정의 주기에 따라 상기 구동 모터의 출력 전류의 값을 읽어 들여 슬립률을 판단하고, 슬립률에 따라 바닥의 상태를 판단한다. 일 예로, 제어부는 저장부에 출력 전류의 값과 슬립률에 대한 대응하는 룩업테이블을 포함하며, 해당 룩업테이블에 더하여 슬립률과 바닥 상태가 대응되어 있는 룩업테이블도 포함할 수 있다.이와 같은 룩업테이블에 저장되어 있는 대응관계는 다음과 같이 형성될 수 있다. 표 1 NO. 1 2 3 4 5 6 7 전류값(mA)200~300301~400401~600601~800 801~900 901~10001,000초과 슬립률 S1 S2 S3 S4 S5 S6 S7 또한, 각 슬립률과 바닥 상태에 대한 대응관계는 다음과 같을 수 있다. S7: 로봇 청소기가 구속되어 있음. S6: 카펫 S5: 하드 플로어 3 S4: 하드 플로어 2 S3: 하드 플로어 1 S2: 웻(WET) 플로어 S1: 초기상태 이때, 제어부는 각 바닥 상태에 따라 로봇 청소기의 동작을 제어함으로써 바닥 상태에 따른 선택적 구동이 가능하다. 또한, 제어부는 부가적으로 포함할 수 있는 클리프 센서에 의해 수광되는 광 정보에 따라 하드 플로어의 상태가 구분될 수 있으며, 수광되는 광이 많을수록 바닥의 슬립률이 높은 것으로 판단할 수 있다. 제어부는, 상기 구동 모터의 출력 전류 값에 따라 바닥 상태가 어떤 상태인지를 판단하고, 그에 따라 동작을 제어한다. 본 실시예에 따른 로봇청소기는 간단한 로직만을 추가함으로써 구동 모터의 출력 전류값을 읽어 현재 주기의 물탱크의 잔여 물 레벨 정도를 판단할 수 있으며, 스핀맙의 슬립률을 읽어 바닥 상태에 대하여 판단할 수 있다. 이러한 출력 전류 값에 대한 각 데이터 값은 실험적으로 설정될 수 있으며, 인공지능을 통한 학습을 수행하여 학습하여 업데이트될 수 있다. 제어부는 바닥감지유닛으로 파악되는 바닥면의 재질과, 기준모션으로 측정된 로봇청소기의 슬립 률을 바탕으로 로봇청소기의 함수율을 파악할 수 있다. 제어부는 저장부에 저장된 바닥감지유닛 으로 파악되는 바닥면의 재질에 따른 슬립률과 함수율의 상관관계에 따른 데이터를 바탕으로, 함수율을 파 악할 수 있다. 함수율이 높을수록 슬립이 발생하지 않는 이상적인 로봇청소기의 이동속도에 가깝게 형성된다. 구체적인 함수율과 슬립률의 관계는 바닥재질에 따라 달라질 수 있으며, 이는 실험적으로 파악할 수 있다. 본 실시예에 따른 로봇청소기는 사용자의 명령을 입력하는 입력부를 더 포함할 수 있다. 사용자는 입 력부를 통해, 로봇청소기의 주행방법이나, 스핀맙의 함수율의 임계값 등을 설정할 수 있다. 또한, 로봇청소기는 통신부를 더 포함할 수 있으며, 통신부를 통하여 서버 또는 사용자 단말로 제어 부의 판단 결과에 따른 알람 또는 정보를 제공할 수 있다. 도 6은 본 발명의 일 실시예에 따른 로봇청소기가 모션을 설명하기 위한 도면으로서, 도 6을 참고하여, 스 핀맙의 회전에 따른 로봇청소기의 주행과 로봇청소기의 이동을 설명한다. 본 실시예에 따른 로봇청소기은 한 쌍의 스핀맙을 포함하고, 한 쌍의 스핀맙을 회전하여 이동한다. 로봇청 소기은 한 쌍의 스핀맙 각각의 회전방향 또는 회전속도를 달리하여 로봇청소기의 주행을 제어할 수 있다. 도 6a를 참조하면, 로봇청소기의 직진이동은 한 쌍의 스핀맙 각각이 서로 반대방향으로 회전하여 이동할 수 있다. 이경우, 한 쌍의 스핀맙 각각의 회전속도는 같으나 회전방향을 달리한다. 로봇청소기는 양 스핀 맙의 회전방향을 변경하여 전진이동 또는 후진이동을 할 수 있다. 또한, 도 6b와 6c를 참조하면, 로봇청소기는 한 쌍의 스핀맙 각각이 서로 같은 방향으로 회전하여 회전이 동을 할 수 있다. 로봇청소기는 한 쌍의 스핀맙 각각의 회전속도를 달리하여 제자리 회전하거나, 곡선으로 이동하는 라운드 회전을 할 수 있다. 로봇청소기의 한 쌍의 스핀맙 각각의 회전속도 비율을 달리하여, 라 운드 회전의 반경을 조정할 수 있다. 이하에서는 도 7 내지 도 9를 참조하여, 본 실시예에 따른 로봇청소기의 함수율을 제어하는 방법을 설명한 다. 도 7은 본 발명의 일 실시예에 따른 로봇청소기의 제어 방법을 나타내는 순서도이고, 도 8은 도 1에 따른 본 발명의 로봇청소기 시스템의 전체 동작을 나타내는 순서도이며, 도 9a 및 도 9b는 도 8의 순서도의 설 명을 위한 사용자 단말의 상태도이다. 본 실시예에 따른 로봇청소기는 서버 또는 사용자 단말의 어플리케이션으로부터 청소 시작 명령을 수신할 수 있다. 또한 로봇청소기는 사용자로부터 직접 입력부를 통해 청소 시작 명령을 수신할 수 있다 (S10). 로봇청소기의 제어부는 수신된 청소 시작명령에 따라 청소를 시작하기 위해 모터 제어부를 통한 구동 모터 및 펌프를 제어한다. 이때, 제어부는 스핀맙을 회전시키는 구동 모터의 초기 전류값을 읽어들여 초기값을 설정할 수 있다 (S11). 제어부는 모터 제어부로 제어 신호를 전송함으로써 스핀맙을 회전시키면서 주행 및 청소를 진행한다. 스핀맙은 또한 펌프 구동에 따른 노즐로부터의 물 분사에 따라 소정의 함수율을 포함한 상태에서 습식 청소 를 수행한다. 이때, 제어부는 스핀맙의 회전 방향 및 회전 속도를 제어함으로써 청소 강도 및 주행을 진행할 수 있으며, 청소 영역에 따라 소정의 모드로 주행하면서 청소를 수행한다. 제어부는 소정의 주기마다 스핀맙의 구동 모터의 출력전류를 읽어들이도록 모터 제어부를 제어한 다(S12). 모터 제어부는 구동 모터의 출력 전류를 읽어들여 주기적으로 제어부에 전송할 수 있으며, 구동 모터에 전력을 공급하여 구동 모터를 구동시킨다. 제어부는 각 주기에 따라 수신되는 구동 모터의 출력 전류를 수신하고, 이를 분석하여 현재 스핀맙의 함수율, 스핀맙의 슬립률 및 그에 따른 바닥의 상태를 판단한다. 이하에서는 제어부가 출력 전류에 따라 스핀맙의 함수율을 판단하고 그에 따라 물 부족 여부를 판단하는 동작을 설명한다. 즉, 제어부는 현재 주기의 모터의 출력 전류 값을 수신하고, 출력 전류 값이 임계값보다 작은지 여부를 판 단한다(S13). 이때, 임계 값은 스핀맙의 함수율이 최소값에 다다랐음을 나타내는 것이며, 임계 값보다 작은 출력 전류를 가지 는 경우, 습식 청소를 진행할 수 없는 상태인 것으로 판단할 수 있다. 이때, 제어부는 노즐로 물을 제공하는 펌프의 동작이 정상적으로 이루어지고 있는지를 함께 읽어들여 현재 물 공급의 이상 여부를 판단할 수 있다. 즉, 펌프의 동작이 정상적으로 진행된 경우, 출력 전류의 값이 임계값보다 작은 경우에는 물탱크에 함 유되어 있는 물의 양이 부족한 것으로 판단하고 그에 따라 사용자 단말에 어플리케이션으로 해당 로봇 청소 기의 물이 부족함을 알림한다(S15). 알람은 소리 및 영상 정보를 모두 포함할 수 있으며, 주기적으로 알람 가능하다. 제어부는 이때, 펌프의 동작을 정지시킴으로써 노즐의 물 분사를 정지시키고, 주행 정지 또는 충전대 로 복귀를 수행할 수 있다(S16).한편, 제어부는 해당 주기에 펌프의 동작이 정상적으로 진행되어 있지 않은 경우에는 펌프 오동작 에 따른 알림 및 동작을 제어할 수 있다. 또는 펌프의 동작이 정상적으로 진행되고, 출력 전류의 값이 임계값 이상인 경우에는 물탱크에 함유되어 있 는 물이 현재까지는 소정 레벨을 유지하고 있는 것으로 판단하여 청소를 연속적으로 진행할 수 있다(S14). 제어부는 소정의 주기에 따라 상기 구동 모터의 출력 전류의 값과 펌프의 동작을 함께 수신하고 분석하여 로봇 청소기의 동작을 제어할 수 있다. 이와 같이, 구동 모터를 제어하는 모터제어부로부터 주기적으로 구동 모터의 출력 전류 값을 수신 하고 이를 분석함으로써 현재 물 탱크의 물 부족 여부에 대하여 판단할 수 있다. 본 실시예에 따른 로봇 시스템은 도 1과 같은 구성을 가질 수 있으며, 도 7과 같은 동작을 수행하는 로봇청소기 가 상기 로봇 시스템 내에 존재할 때, 서버 및 사용자 단말과 연동하여 상기 구동 모터의 출력 전류값을 이용하여 사용자에게 물부족 여부에 대한 알람을 제공할 수 있다. 이하에서는 도 8을 참고하여, 로봇 시스템 내의 제어 방법을 설명한다. 도 8을 참고하면, 본 발명의 일 실시예에 따른 로봇청소기가 포함되어 있는 로봇 시스템 내에서 로봇청소 기, 서버 및 사용자 단말이 서로 무선 통신을 수행하여 로봇청소기에 대한 제어를 수행할 수 있다. 먼저, 로봇 시스템의 서버는 상기 로봇 청소기를 제어할 수 있는 사용자용 어플리케이션을 생산하여, 온라인 상으로 배포가능한 상태로 보유한다. 사용자 단말은 사용자용 어플리케이션을 온라인 상에서 다운로드하여 설치한다(S100). 사용자 단말은 사용자용 어플리케이션을 실행하여 회원가입 및 사용자가 소유하고 있는 로봇청소기를 해당 어플리케이션에 등록하고, 해당 로봇청소기와 어플리케이션을 연동한다. 사용자 단말은 해당 로봇청소기에 대하여 다양한 기능을 설정할 수 있으며, 구체적으로 도 9a와 같이 청소 주기, 물 양을 확인하기 위한 주기 설정 및 이와 같은 주기에 따라 물 양을 확인한 결과를 알람하는 방법 등을 설정할 수 있다(S110). 물 양을 확인하기 위한 주기는 바람직하게는 1 내지 10분일 수 있으며, 더욱 바람직하게는 1 내지 6분일 수 있 다. 알람 방법으로는 소리 알람 및 표시 알람을 선택할 수 있으며, 알람 주기 또한 설정가능하다. 또한, 알람 방법으로 사용자 단말의 어플리케이션 상에서 알람을 표시하는 것 이외에도 로봇 청소기 자체가 알람을 제공함으로써 사용자의 주의를 환기시키는 방법 또한 선택할 수 있다. 사용자 단말은 이와 같은 설정 정보에 대하여 어플리케이션을 통해 서버로 데이터를 전송하고 서버에 저장하고(S111), 로봇 청소기로도 물 양 확인 주기 및 알람 설정 정보에 대하여 무선통신을 통해 데이터를 전송한다. 다음으로, 로봇청소기는 사용자 단말의 어플리케이션으로부터 청소 시작 명령을 수신할 수 있다(S112). 이때, 사용자 단말의 어플리케이션으로부터의 시작 정보에 대하여는 서버로 전송하여 서버에서 저장 가능하다(S113). 로봇청소기는 수신된 청소 시작명령에 따라 청소를 시작하기 위해 모터 제어부를 통한 구동 모터 및 펌프를 제어한다(S114). 이때, 로봇청소기의 제어부는 스핀맙을 회전시키는 구동 모터의 초기 전류값을 읽어들여 초기값 을 설정할 수 있다(S115). 로봇청소기는 통신부를 통해 서버로 측정된 초기 전류값에 대한 정보를 전송 할 수 있으며(S116), 서버는 이에 대하여 저장 가능하다. 제어부는 모터 제어부로 제어 신호를 전송함으로써 스핀맙을 회전시키면서 주행 및 청소를 진행한다. 스핀맙은 또한 펌프 구동에 따른 노즐로부터의 물 분사에 따라 소정의 함수율을 포함한 상태에서 습식 청소 를 수행한다. 이때, 제어부는 스핀맙의 회전 방향 및 회전 속도를 제어함으로써 청소 강도 및 주행을 진행할 수 있으며, 청소 영역에 따라 소정의 모드로 주행하면서 청소를 수행한다. 제어부는 소정의 주기마다 스핀맙의 구동 모터의 출력전류를 읽어들이도록 모터 제어부를 제어한 다(S117). 모터 제어부는 구동 모터의 출력 전류를 읽어들여 주기적으로 제어부에 전송할 수 있 으며, 구동 모터에 전력을 공급하여 구동 모터를 구동시킨다. 제어부는 각 주기에 따라 수신되는 구동 모터의 출력 전류를 수신하고, 이를 분석하여 현재 스핀맙의 함수율을 판단하여 물 부족 여부를 판단한다. 구체적으로, 로봇 청소기는 해당 주기에서의 스핀맙을 회전시키는 구동 모터의 전류 값을 측정한다. 로봇청소기는 통신부를 통해 서버로 측정된 해당 주기의 전류값에 대한 정보를 전송할 수 있으며, 서버 는 이에 대하여 저장 가능하다(S118). 제어부는 제어부가 출력 전류에 따라 스핀맙의 함수율을 판단하고 그에 따라 물 부족 여부를 판단한 다(S119). 즉, 제어부는 현재 주기의 모터의 출력 전류 값을 수신하고, 출력 전류 값이 임계값보다 작은지 여부 를 판단한다. 이때, 임계값은 스핀맙의 함수율이 최소값에 다다랐음을 나타내는 것이며, 임계값보다 작은 출력 전류를 가지는 경우, 습식 청소를 진행할 수 없는 상태로 판단할 수 있다. 이때, 로봇청소기는 노즐로 물을 제공하는 펌프의 동작이 정상적으로 이루어지고 있는지를 함께 읽어 들여 현재 물 공급의 이상 여부를 판단할 수 있다. 즉, 펌프의 동작이 정상적으로 진행된 경우, 출력 전류의 값이 임계 값보다 적은 경우에는 물탱크에 함 유되어 있는 물의 양이 부족한 것으로 판단하고 그에 따라 사용자 단말에 어플리케이션으로 해당 로봇 청소 기의 물이 부족함을 알림한다(S120). 사용자 단말은 도 9b와 같이 해당 어플리케이션에서 상기 로봇청소기에 대한 정보창이 표시될 수 있으 며, 이와 같은 정보창에서 물부족 알람이 표시될 수 있다. 이때, 물부족 알람은 주기적으로 깜박임으로써 사용자의 주의를 환기시킬 수 있다. 사용자 단말의 어플리케이션은 물부족 알람과 함께 사용자에게 해당 로봇 청소기의 다음 동작에 대한 명령을 유도할 수 있다. 일 예로, 도 9b와 같이, 물부족 알람 하단 또는 주변으로 다양한 동작에 대한 선택가능한 아이콘이 활성화될 수 있다. 구체적으로, 다음 동작으로는 마른걸레 청소 또는 청소 중지가 아이콘화되어 활성화될 수 있다. 사용자 단말은 아이콘 중 하나를 선택하여 선택 정보를 로봇청소기에 전송할 수 있다(S122). 로봇 청소기는 선택 정보를 분석하여 마른 걸레 청소 모드가 선택된 경우는(S124) 로봇 청소기의 펌 프의 동작이 중지되어 노즐로부터의 물 분사를 중지한다(S126). 또한, 마른 걸레 청소 모드에서는 스핀맙의 회 전을 그대로 유지하면서 마른 걸레의 상태로 먼지 등을 부착할 수 있는 마른 걸레 청소를 수행할 수 있다. 한편, 사용자 단말의 청소 중지 아이콘이 선택되는 경우에는 로봇청소기는 펌프의 동작 및 구동 모 터의 동작이 모두 중지되어 로봇 청소기의 물 분사 및 스핀맙의 회전이 중지된다). 이는 로봇 청소기 가 동작을 중지한 상태로 현재 위치에서 정지하게 된다(S125). 이때, 설정에 따라 청소 중지의 아이콘을 선택할 때, 물분사는 중지된 상태로 스핀맙을 회전하면서 충전대(20 0)로 복귀가능하도록 설정할 수 있다. 사용자는 도 9b에 도시된 바와 같이, 물부족 알람이 표시되면, 동작을 선택하고 선택 정보를 로봇 청소기 에 전송한다. 이와 같은 선택 정보를 수신한 로봇 청소기는 수신된 선택 정보를 판독하고, 판독한 정보에 따라 동작을 수행한다. 즉, 앞서 설명한 바와 같이 마른 걸레 청소 모드가 선택된 경우에는 스핀맙은 회전을 유지하나 노즐의 물 분사 는 중지한 상태로 마른 걸레 청소를 진행할 수 있다. 한편, 제어부는 해당 주기에 펌프의 동작이 정상적으로 진행되어 있지 않은 경우에는 펌프 오동작 에 따른 알림 및 동작을 제어할 수 있다. 또는 펌프의 동작이 정상적으로 진행되고, 출력 전류의 값이 임계값 이상인 경우에는 물탱크에 함유되 어 있는 물이 현재까지는 소정 레벨을 유지하고 있는 것으로 판단하여 청소를 연속적으로 진행할 수 있다. 이와 같이, 제어부는 소정의 주기에 따라 상기 구동 모터의 출력 전류의 값과 펌프의 동작을 함께 수신하고 분석하여 로봇 청소기의 동작을 제어할 수 있다. 또한, 청소 중지가 선택된 경우에는 로봇청소기는 펌프의 동작 및 구동 모터의 동작이 모두 중지 할 수 있으며, 이때, 펌프만이 중지되어 충전대로로의 복귀가 이루어질 수 있다. 청소 중지에 의해 충전대로 복귀 또는 현재 위치에서 정지된 로봇 청소기는 사용자가 직접 물탱크 에 물을 보충가능하고 다시 청소 동작이 가능하다. 이와 같이, 구동 모터를 제어하는 모터제어부로부터 주기적으로 구동 모터의 출력 전류 값을 수신 하고 이를 분석함으로써 현재 물 탱크의 물 부족 여부에 대하여 판단하여 물 보충을 유도할 수 있다. 이러한 로봇 시스템은 도 1과 같은 구성을 가질 수 있으며, 도 7과 같은 동작을 수행하는 로봇청소기가 상 기 로봇 시스템 내에 존재할 때, 서버 및 사용자 단말과 연동하여 상기 구동 모터의 출력 전류값을 이용하여 사용자에게 물부족 여부에 대한 알람을 제공할 수 있다. 이하에서는 도 10 및 도 11을 참고하여, 본 발명의 다른 실시예에 따른 로봇 시스템 내의 제어 방법을 설명한다. 도 10은 본 발명의 다른 실시예에 따른 로봇청소기 시스템의 전체 동작을 나타내는 순서도이고, 도 11은 도 10에 따라 로봇청소기의 제어 방법을 나타내는 순서도이다. 먼저, 도 10을 참고하면, 본 발명의 다른 실시예에 따른 로봇청소기가 포함되어 있는 로봇 시스템 내에서 로봇청소기, 서버 및 사용자 단말이 서로 무선 통신을 수행하여 로봇청소기에 대한 제어를 수 행할 수 있다. 먼저, 로봇 시스템의 서버는 상기 로봇 청소기를 제어할 수 있는 사용자용 어플리케이션을 생산하여, 온라인 상으로 배포가능한 상태로 보유한다. 사용자 단말은 사용자용 어플리케이션을 온라인 상에서 다운로드하여 설치한다(S200). 이와 같은 사용자용 어플리케이션을 실행하여 회원가입 및 사용자가 소유하고 있는 로봇청소기를 해당 어 플리케이션에 등록하고, 해당 로봇청소기와 어플리케이션을 연동한다. 사용자 단말은 해당 로봇청소기에 대하여 다양한 기능을 설정할 수 있으며, 구체적으로 청소 주기, 모 터의 출력 전류를 확인하기 위한 주기 설정 및 이와 같은 주기에 따라 바닥 상태를 확인한 결과를 알람하는 방 법 등에 대한 설정일 수 있다(S210). 청소 주기는 사용자의 생활 패턴에 따라 다양하게 설정 가능하나, 일 예로 5시간 또는 6시간 내의 주기로 설정 가능하다. 또한 일정한 시각을 설정하여 해당 시각에 청소를 진행하도록 설정가능하다. 스핀맙을 회전시키는 구동 모터의 출력 전류를 읽어들이기 위한 주기는 바람직하게는 1 내지 10분일 수 있 으며, 더욱 바람직하게는 1 내지 6분일 수 있다. 알람 방법으로는 소리 알람 및 표시 알람을 선택할 수 있으며, 알람 주기 또한 설정가능하다. 또한, 알람 방법으로 사용자 단말의 어플리케이션 상에서 알람을 표시하는 것 이외에도 로봇 청소기 자 체가 알람을 제공함으로써 사용자의 주의를 환기시키는 방법 또한 선택할 수 있다. 사용자 단말은 이와 같은 설정 정보에 대하여 어플리케이션을 통해 서버로 데이터를 전송하고, 로봇 청소 기로도 모터의 출력 전류 확인주기 및 알람 설정 정보에 대하여 무선통신을 통해 데이터를 전송한다 (S211). 다음으로, 로봇청소기는 사용자 단말의 어플리케이션으로부터 청소 시작 명령을 수신할 수 있다(S212). 이때, 사용자 단말의 어플리케이션으로부터의 시작 정보에 대하여는 서버로 전송하여 서버에서 저장 가능하다(S213). 로봇청소기는 수신된 청소 시작명령에 따라 청소를 시작하기 위해 모터 제어부를 통한 구동 모터 및 펌프를 제어한다(S214). 이때, 로봇청소기의 제어부는 스핀맙을 회전시키는 구동 모터의 초기 전류값을 읽어들여 초기값 을 설정할 수 있다(S215). 로봇청소기는 통신부를 통해 서버로 측정된 초기 전류값에 대한 정보를 전송 할 수 있으며, 서버는 이에 대하여 저장 가능하다(S216). 제어부는 모터 제어부로 제어 신호를 전송함으로써 스핀맙을 회전시키면서 주행 및 청소를 진행한다. 스핀맙은 또한 펌프 구동에 따른 노즐로부터의 물 분사에 따라 소정의 함수율을 포함한 상태에서 습식 청소를 수행한다. 이때, 제어부는 스핀맙의 회전 방향 및 회전 속도를 제어함으로써 청소 강도 및 주행을 진행할 수 있으며, 청소 영역에 따라 소정의 모드로 주행하면서 청소를 수행한다. 제어부는 소정의 주기마다 스핀맙의 구동 모터의 출력전류를 읽어들이도록 모터 제어부를 제어한 다(S217). 모터 제어부는 구동 모터의 출력 전류를 읽어들여 주기적으로 제어부에 전송할 수 있 으며, 구동 모터에 전력을 공급하여 구동 모터를 구동시킨다. 제어부는 각 주기에 따라 수신되는 구동 모터의 출력 전류를 수신하고, 이를 분석하여 현재 스핀맙과 맞닿는 바닥 상태를 정의한다. 구체적으로, 로봇 청소기는 해당 주기에서의 스핀맙을 회전시키는 구동 모터의 전류 값을 측정한다. 로봇청소기는 통신부를 통해 서버로 측정된 해당 주기의 전류값에 대한 정보를 전송할 수 있으며, 서버 는 이에 대하여 저장 가능하다(S218). 제어부는 제어부가 출력 전류에 따라 스핀맙의 슬립률을 선택하고, 해당 선택된 슬립률에 따라 바닥 상태에 대한 판단을 수행할 수 있다(S219). 이때, 제어부는 앞서 설명한 바와 표 1의 데이터에 따라 바닥 상태에 대한 평가를 수행할 수 있다. 또한, 각 슬립률과 바닥 상태에 대한 대응관계도 앞서 설명한 바와 동일할 수 있다. 이때, 로봇 청소기는 바닥 상태에 대하여 하드 플로어 1 내지 하드 플로어 3의 상태에서만 청소를 연속적 으로 진행하는 것으로 설정할 수 있다. 즉, 하드 플로어 1 내지 하드 플로어 3에 해당하는 출력 전류값을 임계 범위로 설정할 수 있으며, 로봇 청소기 는 해당 주기에 읽어들인 스핀맙 모터의 출력 전류값이 상기 임계 범위 내에 포함되는지 여부를 판단할 수 있다. 이때, 제어부는 임계 범위를 벗어나는 경우에 바닥 상태가 카펫과 같은 로봇청소기가 이동할 수 없는 상태의 바닥인 것으로 판단할 수 있다. 로봇청소기는 이와 같이 구동 모터의 출력 전류의 값이 임계 범위를 벗어나는 경우에 로봇 청소기가 구속되어 있는 것으로 판단하고, 그에 따른 정보를 사용자 단말의 어플리케이션을 통해 전송한다(S220). 사용자 단말은 이와 같은 로봇청소기의 구속 정보를 수신하고, 해당 어플리케이션에서 아이콘을 선택함 으로써 스테이션 복귀 명령을 전송할 수 있다(S221). 이때, 사용자 단말은 어플리케이션에서 로봇청소기 의 동작 중지를 명령할 수 있다. 로봇청소기는 사용자 단말로부터 이와 같은 명령을 수신하고, 그에 따라 동작을 수행한다. 즉, 스테이션 복귀 명령을 수신하면, 노즐의 물 분사를 중지하고, 스테이션으로 복귀하여 주행을 정지한다 (S222). 또는 구속을 나타내는 전류의 값에 따라 이동이 가능한 경우와 이동이 불가능한 경우로 분리 판단이 가능하며, 짧은 털을 가지는 카펫과 같이 높은 마찰력에 의해 이동이 어려우나 이동이 가능하기는 한 경우와 장애물에 가 로 막혀 이동이 전혀 불가능한 경우로 분리되어 제어할 수 있다. 즉, 이동이 전혀 불가능한 구속 상태인 경우에는 스테이션으로의 복귀가 아닌 현재 위치에서의 동작 중지를 명 령할 수 있다. 이와 같이, 로봇청소기는 구동 모터의 출력 전류 값을 주기적으로 읽어 들여 현재 바닥의 상태에 대한 정보를 확인하고, 그에 따라 동작을 제어할 수 있다. 이때, 로봇청소기의 제어부는 부가적으로 포함할 수 있는 클리프 센서에 의해 수광되는 광 정보에 따 라 바닥 상태가 구분될 수 있으며, 그에 따른 영상 정보를 융합하여 현재 바닥 상태를 판단할 수 있다. 한편, 본 발명의 다른 실시예에 따른 로봇청소기는 구동 모터의 출력 전류를 읽어들여 바닥 상태를 판 단하는 동작을 수행할 때, 도 11과 같은 동작을 수행할 수 있다. 도 11을 참고하면, 로봇청소기는 수신된 청소 시작명령에 따라 청소를 시작하기 위해 모터 제어부를 통한 구동 모터 및 펌프를 제어한다(S20). 이때, 로봇청소기의 제어부는 스핀맙을 회전시키는 구동 모터의 초기 전류값을 읽어들여 초기값 을 설정할 수 있다(S21). 로봇청소기는 통신부를 통해 서버로 측정된 초기 전류값에 대한 정보를 전송 할 수 있으며, 서버는 이에 대하여 저장 가능하다. 제어부는 모터 제어부로 제어 신호를 전송함으로써 스핀맙을 회전시키면서 주행 및 청소를 진행한다. 스핀맙은 또한 펌프 구동에 따른 노즐로부터의 물 분사에 따라 소정의 함수율을 포함한 상태에서 습식 청소를 수행한다. 이때, 제어부는 스핀맙의 회전 방향 및 회전 속도를 제어함으로써 청소 강도 및 주행을 진행할 수 있으며, 청소 영역에 따라 소정의 모드로 주행하면서 청소를 수행한다. 제어부는 소정의 주기마다 스핀맙의 구동 모터의 출력전류를 읽어들이도록 모터 제어부를 제어한 다(S22). 모터 제어부는 구동 모터의 출력 전류를 읽어들여 주기적으로 제어부에 전송할 수 있으 며, 구동 모터에 전력을 공급하여 구동 모터를 구동시킨다. 제어부는 각 주기에 따라 수신되는 구동 모터의 출력 전류를 수신하고, 이를 분석하여 현재 스핀맙과 맞닿는 바닥 상태를 정의한다. 구체적으로, 로봇 청소기는 해당 주기에서의 스핀맙을 회전시키는 구동 모터의 전류 값을 측정한다. 로봇청소기는 통신부를 통해 서버로 측정된 해당 주기의 전류값에 대한 정보를 전송할 수 있으며, 서버 는 이에 대하여 저장 가능하다. 제어부는 로봇청소기의 초기 전류값을 기준으로 임계 범위를 설정할 수 있으며 해당 주기의 전류값이 임계 범위를 충족하는지 판단한다(S23). 구체적으로, 제어부는 초기 전류값을 Iin로 할 때, 임계 범위 Ith 는 하기의 수학식 1을 충족할 수 있다. 수학식 1"}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "m은 1보다 작은 양의 실수일 수 있으며, 바람직하게는 0.3 내지 0.6일 수 있다. 또한, n은 1보다 큰 양의 실수일 수 있으며, 바람직하게는 3 내지 5일 수 있다. 이와 같이, 임계 범위를 초기 전류값에 기초하여 설정한 경우, 해당 청소의 시작점에서 적용되는 상황에 대하여 급격한 변경 사항이 있는 경우를 구체적으로 판단할 수 있다. 즉, 초기 값으로부터 변화량이 큰 상황일 때를 사용자 단말로 현재 주기에서의 바닥 상태가 급변한 것을 알 림할 수 있다. 이와 같은 알림은 도 11과 같이 수학식 1의 범위를 벗어나는 경우에 발생할 수 있으며, 해당 범위를 벗어나는 경우에는 사용자 단말로부터의 어플리케이션을 통한 명령에 따라 이동을 수행하여 스테이션으로 복귀 가능하 다(S24).한편, 현재 주기의 모터의 출력 전류의 값이 수학식 1의 임계 범위 내를 충족하는 경우에는 표 1의 데이터에 따 라 바닥 상태에 대한 평가를 수행할 수 있다. 이때, 로봇 청소기는 바닥 상태가 하드 플로어 1 내지 하드 플로어 3의 상태중 어느 하나에 해당하는지를 판단 하고, 그에 따라 데이터를 업데이트할 수 있다(S25). 또한, 해당 바닥 상태에 따라 모터의 회전 속도를 제어하면서 습식 청소를 수행할 수 있다. 로봇 청소기는 바닥 상태에 따라 모터의 회전 속도를 제어하면서 청소 구역의 습식 청소를 진행하고 청소 가 종료되면 충전대로 복귀할 수 있으며, 종료에 대한 정보를 업데이트 하고 서버에 전송할 수 있다 (S27). 이와 같이, 별도의 센서 또는 제어 모듈을 포함하지 않고, 스핀맙을 회전시키는 구동 모터의 출력 전류만으 로 물 탱크의 물 부족 여부 및 바닥 상태에 대한 판단을 수행함으로써 습식 청소 시의 장애를 해소할 수 있 다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2019-0093474", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "정되지 아니하며, 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에 서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2019-0093474", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 홈 로봇을 포함하는 스마트 홈 시스템 구성도이다. 도 2는 본 발명의 일 실시예에 따른 로봇청소기의 사시도이다. 도 3은 도 2의 로봇청소기의 하면도이다. 도 4는 도 3의 로봇청소기의 하면도의 다른 상태도이다. 도 5는 본 발명의 일 실시예에 따른 로봇청소기의 제어부 및 제어부와 관련된 구성을 도시한 블록도이다. 도 6a 내지 도 6c는 본 발명의 일 실시예에 따른 로봇청소기의 이동 시의 스핀맙의 회전을 설명하기 위한 도면 이다. 도 7은 본 발명의 일 실시예에 따른 로봇청소기의 제어 방법을 나타내는 순서도이다. 도 8은 도 1에 따른 본 발명의 로봇청소기 시스템의 전체 동작을 나타내는 순서도이다. 도 9a 및 도 9b는 도 8의 순서도의 설명을 위한 사용자 단말의 상태도이다. 도 10은 본 발명의 다른 실시예에 따른 로봇청소기 시스템의 전체 동작을 나타내는 순서도이다. 도 11는 도 10에 따라 로봇청소기의 제어 방법을 나타내는 순서도이다."}
