{"patent_id": "10-2017-0113548", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0026520", "출원번호": "10-2017-0113548", "발명의 명칭": "인공지능 공기조화기 및 그 제어방법", "출원인": "엘지전자 주식회사", "발명자": "최우현"}}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 마이크(MIC)를 통하여 사용자의 음성 신호를 수신하는 단계;상기 복수의 마이크를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서버 시스템으로 전송하는단계; 상기 복수의 마이크를 통하여 수신된 음성 신호에 기초하여 상기 사용자의 위치 정보를 판별하는 단계;상기 음성 인식 서버 시스템으로부터 상기 음성 신호에 기초한 제어 신호를 수신하는 단계; 및,상기 제어 신호에 대응하는 동작을 수행하는 단계;를 포함하고,상기 제어 신호에 대응하는 동작을 수행하는 단계는, 상기 제어 신호가 온도 또는 바람을 제어하는 신호인 경우에, 상기 판별된 위치 정보에 기초하여 기류를 제어하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어 신호에 대응하는 동작을 수행하는 단계는, 상기 판별된 위치 정보에 기초하여 바람의 방향과 세기 중적어도 하나를 제어하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제어 신호에 대응하는 동작을 수행하는 단계는, 복수의 토출유닛 중 바람을 토출하는 토출유닛을 상기 판별된 위치 정보에 기초하여 선택하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어 신호에 대응하는 동작을 수행하는 단계는, 상기 판별된 위치 정보에 기초하여 상기 복수의 토출유닛의 토출구를 개폐하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어 신호에 대응하는 동작을 수행하는 단계는, 상기 판별된 위치 정보에 대응하는 영역에서 토출되는 바람의 세기를 다른 나머지 영역에서 토출되는 바람의 세기와 상이하도록 제어하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제어 신호에 대응하는 동작을 수행하는 단계는, 상기 판별된 위치 정보에 대응하는 영역에만 바람을 토출하거나 상기 판별된 위치 정보에 대응하는 영역에만 바람이 토출되지 않도록 제어하는 것을 특징으로 하는 공기조화기의 제어방법."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "한 쌍의 토출유닛;공개특허 10-2019-0026520-3-상기 한 쌍의 토출유닛의 하측에 위치되고, 복수의 마이크 홀이 형성되는 센터 패널 어셈블리;상기 마이크 홀을 통하여 음성 신호를 수신하는 복수의 마이크;상기 복수의 마이크를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서버 시스템으로전송하고, 상기 음성 인식 서버 시스템으로부터 상기 음성 신호에 기초한 제어 신호를 수신하는 통신부; 및,상기 복수의 마이크를 통하여 수신된 음성 신호에 기초하여 상기 사용자의 위치 정보를 판별하고, 상기 제어 신호에 대응하는 동작을 수행하도록 제어하는 제어부;를 포함하고,상기 제어부는, 상기 제어 신호가 온도 또는 바람을 제어하는 신호인 경우에, 상기 판별된 위치 정보에 기초하여 기류를 제어하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제어부는, 상기 판별된 위치 정보에 기초하여 바람의 방향과 세기 중 적어도 하나를 제어하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 제어부는, 상기 한쌍의 토출유닛 중 바람을 토출하는 토출유닛을 상기 판별된 위치 정보에 기초하여 선택하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제어부는, 상기 판별된 위치 정보에 기초하여 상기 한쌍의 토출유닛의 토출구를 개폐하는 것을 특징으로하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 제어부는, 상기 판별된 위치 정보에 대응하는 영역에서 토출되는 바람의 세기를 다른 나머지 영역에서 토출되는 바람의 세기와 상이하도록 제어하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 제어부는, 상기 판별된 위치 정보에 대응하는 영역에만 바람을 토출하거나 상기 판별된 위치 정보에 대응하는 영역에만 바람이 토출되지 않도록 제어하는 것을 특징으로 하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제7항에 있어서,상기 한 쌍의 토출유닛 사이에 위치되고, 일측면이 상기 한 쌍의 토출유닛 중 어느 하나의 외둘레면을마주보며, 타측면이 상기 한 쌍의 토출유닛 중 다른 하나의 외둘레면을 마주보는 디스플레이 어셈블리;를 더 포함하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제7항에 있어서,상기 마이크 홀은, 상기 센터 패널 어셈블리의 최하단으로부터 소정 거리 이격되어 형성되는 것을 특징으로 하공개특허 10-2019-0026520-4-는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 마이크 홀은, 상기 센터 패널 어셈블리의 길이 방향의 중앙 지점과 최하단 사이에 형성되는 것을 특징으로하는 공기조화기."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 측면에 따른 공기조화기의 제어방법은, 복수의 마이크(MIC)를 통하여 사용자의 음성 신호를 수신하 는 단계, 복수의 마이크를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서버 시스템으로 전송 하는 단계, 복수의 마이크를 통하여 수신된 음성 신호에 기초하여 사용자의 위치 정보를 판별하는 단계, 음성 인 식 서버 시스템으로부터 음성 신호에 기초한 제어 신호를 수신하는 단계, 및, 제어 신호에 대응하는 동작을 수행 하는 단계를 포함하고, 제어 신호에 대응하는 동작을 수행하는 단계는, 제어 신호가 온도 또는 바람을 제어하는 신호인 경우에, 판별된 위치 정보에 기초하여 기류를 제어함으로써, 사용자의 위치 정보에 따른 최적화된 기류 제어가 가능하다."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공기조화기 및 그 제어방법에 관한 것으로, 사용자의 음성에 기초하여 기류를 제어하는 공기조화기 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "공기조화기는 쾌적한 실내 환경을 조성하기 위해 실내로 냉온의 공기를 토출하여, 실내 온도를 조절하고, 실내 공기를 정화하도록 함으로서 인간에게 보다 쾌적한 실내 환경을 제공하기 위해 설치된다. 일반적으로 공기조화기는 열교환기로 구성되어 실내에 설치되는 실내기와, 압축기 및 열교환기 등으로 구성되어 실내기로 냉매를 공급하는 실외기를 포함한다. 공기조화기는 열교환기로 구성된 실내기와, 압축기 및 열교환기 등으로 구성된 실외기로 분리되어 제어되며, 압 축기 또는 열교환기로 공급되는 전원을 제어함으로써 동작된다. 또한, 공기조화기는 실외기에 적어도 하나의 실 내기가 연결될 수 있으며, 요청되는 운전 상태에 따라, 실내기로 냉매를 공급하여, 냉방 또는 난방모드로 운전 된다. 이러한 공기조화기는, 실내로 토출되는 풍향을 조절할 수 있도록 토출구에 풍향조절수단이 구비되는 데, 리모컨 등에 구비된 풍향 설정 버튼을 조작함에 따라 풍향을 변경할 수 있다. 종래의 공기조화기는, 수동 조작을 통하여 풍향을 조절하였으나, 정확히 풍향을 조절하는 것이 쉽지 않으므로 사용자가 쾌적감을 느끼기 어려운 문제점이 있다. 또한, 최근에는, 음성 인식 기술을 이용하여 공기조화기를 제어하는 방안에 대한 연구가 증가하고 있다."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 사용자의 위치 정보에 따른 최적화된 기류 제어가 가능한 공기조화기 및 그 제어방법을 제공 함에 있다. 본 발명의 목적은, 전용 센서의 추가 없이 사용자의 위치 정보를 판별할 수 있는 공기조화기 및 그 제어방법을 제공함에 있다. 본 발명의 목적은, 효율적으로 자연어를 인식, 처리할 수 있는 공기조화기 및 그 제어방법을 제공함에 있다. 본 발명의 목적은, 사용자의 음성 명령을 인식하여 공기조화기를 제어할 수 있는 음성 인식 방법 및 시스템을 제공함에 있다."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따른 공기조화기의 제어방법은, 복수의 마이크(MI C)를 통하여 사용자의 음성 신호를 수신하는 단계, 복수의 마이크를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서버 시스템으로 전송하는 단계, 복수의 마이크를 통하여 수신된 음성 신호에 기초하여 사 용자의 위치 정보를 판별하는 단계, 음성 인식 서버 시스템으로부터 음성 신호에 기초한 제어 신호를 수신하는단계, 및, 제어 신호에 대응하는 동작을 수행하는 단계를 포함하고, 제어 신호에 대응하는 동작을 수행하는 단 계는, 제어 신호가 온도 또는 바람을 제어하는 신호인 경우에, 판별된 위치 정보에 기초하여 기류를 제어함으로 써, 사용자의 위치 정보에 따른 최적화된 기류 제어가 가능하다. 상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따른 공기조화기의 제어방법은, 복수의 토출유닛 중 바람을 토출하는 토출유닛을 판별된 위치 정보에 기초하여 선택함으로써, 더욱 정밀한 기류 제어가 가능하다. 상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따른 공기조화기는, 한 쌍의 토출유닛, 한 쌍의 토 출유닛의 하측에 위치되고, 복수의 마이크 홀이 형성되는 센터 패널 어셈블리, 마이크 홀을 통하여 음성 신호를 수신하는 복수의 마이크, 복수의 마이크를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서버 시스템으로 전송하고, 음성 인식 서버 시스템으로부터 음성 신호에 기초한 제어 신호를 수신하는 통신부, 및, 복수의 마이크를 통하여 수신된 음성 신호에 기초하여 사용자의 위치 정보를 판별하고, 제어 신호에 대응하는 동작을 수행하도록 제어하는 제어부를 포함하고, 제어부는, 제어 신호가 온도 또는 바람을 제어하는 신호인 경 우에, 판별된 위치 정보에 기초하여 기류를 제어함으로써, 사용자의 위치 정보에 따른 최적화된 기류 제어가 가 능하다."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들 중 적어도 하나에 의하면, 용자의 위치 정보에 따른 최적화된 기류 제어가 가능하고, 냉방 효율 및 에너지 효율이 향상된 공기조화기 및 그 제어방법을 제공할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 복수의 토출유닛을 이용함으로써, 더욱 정밀한 기류 제어 가 가능하다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 사용자의 음성 신호에 기초하여 사용자의 위치 정보를 판 별함으로써, 전용 센서의 추가 없이 사용자의 위치 정보를 판별할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 음성 입력에 따라 공기조화기가 동작함으로써, 사용자가 리모콘을 조작할 필요가 없어, 사용자 편의성을 증대시킬 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 공기조화기를 통하여 수신되는 음성 입력을 음성 인식 서 버 시스템에서 인식함으로써, 효율적으로 자연어를 인식, 처리할 수 있다. 한편, 그 외의 다양한 효과는 후술될 본 발명의 실시예에 따른 상세한 설명에서 직접적 또는 암시적으로 개시될 것이다."}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 그러나 본 발명이 이러한 실시예에 한정되는 것은 아니며 다양한 형태로 변형될 수 있음은 물론이다. 도면에서는 본 발명을 명확하고 간략하게 설명하기 위하여 설명과 관계없는 부분의 도시를 생략하였으며, 명세 서 전체를 통하여 동일 또는 극히 유사한 부분에 대해서는 동일한 도면 참조부호를 사용한다. 한편, 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 단순히 본 명세서 작성의 용이함만 이 고려되어 부여되는 것으로서, 그 자체로 특별히 중요한 의미 또는 역할을 부여하는 것은 아니다. 따라서, 상 기 \"모듈\" 및 \"부\"는 서로 혼용되어 사용될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 공기조화기의 정면도이고, 도 2는 본 발명의 일 실시예에 따른 토출 어셈블 리와 송풍기가 분리된 사시도이다. 도 3은 도 1에 도시된 A-A 선 단면도이고, 도 4는 도 1에 도시된 B-B 선 단면도이며, 도 5는 도 1에 도시된 C-C 선 단면도이고, 도 6은 본 발명의 일 실시예에 따른 공기조화기의 토출유닛 및 토출유닛 홀더의 분해 사시도이 다. 공기조화기는 한 쌍의 토출유닛(2,3), 한 쌍의 토출유닛(2,3) 사이에 위치된 디스플레이 어셈블리(10A), 상 기 디스플레이 어셈블리(10A)의 하측에 위치되고, 하나 이상의 마이크 홀이 형성되는 센터 패널 어셈블리 (10B)를 포함할 수 있다. 본 발명의 일 실시예에 따른 공기조화기는, 디스플레이 어셈블리(10A)의 하측에 배치되는 센터 패널 어셈블 리(10B)를 포함할 수 있다. 상기 센터 패널 어셈블리(10B)는, 좌/우측 프론트 커버 사이에 위치하고, 상기 디스플레이 어셈블리(10A)와 동일한 폭을 가짐으로써, 상기 디스플레이 어셈블리(10A)와 일관된 심미감을 형성할 수 있다. 상기 센터 패널 어셈블리(10B)에는 하나 이상의 마이크 홀이 형성될 수 있다. 한편, 본 발명의 일 실시예에 따른 공기조화기는, 상기 마이크 홀을 통하여 음성 입력을 수신하는 하나 이상의 마이크(도 9의 221, 222 참조)를 포함할 수 있다. 상기 마이크(221, 222)는 상기 센터 패널 어셈블리(10B)의 내측면에 부착되어 상기 마이크 홀에 접촉하거나 인접하게 배치될 수 있다. 한편, 음성 인식의 정확도를 높이기 위해서는, 소음이 저감된 음성 데이터를 확보하는 것이 중요하다. 또한, 소음이 저감된 음성 데이터를 확보하기 위하여, 마이크 홀이 최적의 위치에 배치될 필요가 있다. 상기 마이크 홀은, 상기 센터 패널 어셈블리(10B)의 최하단으로부터 소정 거리 이격되어 형성될 수 있다. 바람직하게는, 상기 마이크 홀은, 상기 센터 패널 어셈블리(10B)의 길이 방향의 중앙 지점과 최하단 사이에 형성될 수 있다. 또한, 한 쌍의 토출유닛(2,3)에 하측에 위치되고, 상기 한 쌍의 토출유닛(2,3)으로 공기를 송풍하는 송풍기 가 케이싱 내부에 배치될 수 있다. 상기 송풍기는 상기 센터 패널 어셈블리(10B)의 후방에 배치될 수 있다, 상기 송풍기는 상기 센터 패널 어셈블리(10B)의 상단 후방에 배치되고, 베이스 어셈블리는 상기 센터 패널 어셈블리(10B)의 하단 후방에 배치될 수 있다. 이 경우에, 상기 마이크 홀은, 상기 송풍기의 최하단으로부터 하측으로 소정 거리 이격 되어 형성될 수 있다. 또한, 공기조화기는 한 쌍의 토출유닛(2,3)을 서로 이격되게 지지하는 토출유닛 홀더를 더 포함할 수 있 다. 한 쌍의 토출유닛(2,3)은 토출유닛 홀더에 의해 수평 방향으로 이격되게 배치될 수 있고, 디스플레이 어셈블 리(10A)는 한 쌍의 토출유닛(2,3) 사이에 상하 방향으로 길게 배치될 수 있다. 디스플레이 어셈블리(10A)는 한 쌍의 토출유닛(2,3) 사이의 틈을 공기조화기 전방에서 보이지 않게 가릴 수 있다. 한 쌍의 토출유닛(2,3)과 토출유닛 홀더 및 디스플레이 어셈블리(10A)는 공기조화기에서 공조된 공기를 외부 로 토출하는 토출 어셈블리(D)를 구성할 수 있다. 토출 어셈블리(D)는 송풍기와 정화유닛을 갖는 공기청정기에 설치될 수 있고, 정화유닛에 의해 정화 된 공기는 한 쌍의 토출유닛(2,3)을 통해 외부로 분산 토출될 수 있다. 이 경우, 공기조화기는 실내 공기를 청정시키는 공기청정기일 수 있다. 여기서, 정화유닛은 공기 중의 이물질이 걸러지는 필터와, 전기를 이용 하여 먼지 등의 이물질을 대전시켜 집진하는 전기집진기와, 공기가 통과하면서 이물질이 흡착되고 수분을 흡수 하는 가습필터와, 공기 중으로 이온을 발생시키는 이온발생기 등일 수 있다. 토출 어셈블리(D)는 송풍기와 열교환기를 갖는 냉방기나 난방기나 제습기에 설치될 수 있고, 열교환기 와 열교환된 공기는 한 쌍의 토출유닛(2,3)을 통해 외부로 분산 토출될 수 있다. 이 경우, 공기조화기는 실내의 온도나 습도를 변화시키는 냉방기나 난방기나 제습기일 수 있다. 공기조화기는 본체유닛과, 토출 어셈블리(D)와, 본체유닛과 토출 어셈블리(D)를 연결하는 연결덕트를 포함 하고, 본체유닛에는 열교환기와 정화유닛 중 적어도 하나와 송풍기가 설치되는 것이 가능하다. 이 경우, 토출 어셈블리(D)는 본체유닛과 이격되게 설치될 수 있고, 본체유닛에서 연결덕트로 공급된 공기는 연결 덕트에서 한 쌍의 토출유닛(2,3)으로 유동되어 한 쌍의 토출유닛(2,3) 외부로 분산 토출될 수 있다. 한 쌍의 토출유닛(2,3)은 송풍기에서 송풍된 공기를 외부로 토출 안내하는 것으로서, 토출유닛 홀더에 의 해 서로 평행하게 배치된 상태에서 송풍기에서 송풍된 공기를 외부로 분산 토출할 수 있다. 한 쌍의 토출유닛(2,3)은 동일구조로 형성될 수 있고, 그 위치가 상이할 수 있다. 한 쌍의 토출유닛(2,3) 각각 은 공기가 유입되는 흡입구가 형성될 수 있다. 한 쌍의 토출유닛(2,3) 각각은 공기가 토출되는 공기토출구가 형 성될 수 있다. 한 쌍의 토출유닛(2,3) 각각의 내부에는 흡입구로 유입된 공기를 공기토출구로 안내하는 내부유 로가 형성될 수 있다. 한 쌍의 토출유닛(2,3) 각각은 상부와 하부와 둘레부 중 둘레부의 일부에 공기토출구가 형성될 수 있다. 한 쌍 의 토출유닛(2,3) 각각은 상부와 하부와 둘레부 중 어느 하나에 공기가 유입되는 흡입구가 형성될 수 있다. 흡입구가 한 쌍의 토출유닛(2,3) 각각의 하부에 형성될 경우, 송풍기에서 송풍된 공기는 한 쌍의 토출유닛 (2,3) 각각의 하부를 통해 내부유로로 유입될 수 있고, 한 쌍의 토출유닛(2,3) 각각의 둘레부 일부에 형성된 공 기토출구를 통해 외부로 토출될 수 있다. 흡입구가 한 쌍의 토출유닛(2,3) 각각의 상부에 형성될 경우, 송풍기에서 송풍된 공기는 한 쌍의 토출유닛 (2,3) 각각의 상부를 통해 내부유로로 유입될 수 있고, 한 쌍의 토출유닛(2,3) 각각의 둘레부 일부에 형성된 공 기토출구를 통해 외부로 토출될 수 있다. 흡입구가 한 쌍의 토출유닛(2,3) 각각의 둘레부에 형성될 경우, 흡입구는 둘레부 중 공기토출구와 이격된 부분 에 형성될 수 있다. 이 경우, 한 쌍의 토출유닛(2,3)은 상면과 하면이 각각 막힌 형상일 수 있다. 송풍기에 서 송풍된 공기는 한 쌍의 토출유닛(2,3) 각각의 둘레부에 형성된 흡입구를 통해 내부유로로 유입될 수 있고, 한 쌍의 토출유닛(2,3) 각각의 둘레부에 형성된 공기토출구를 통해 외부로 토출될 수 있다. 한 쌍의 토출유닛(2,3) 중 어느 하나는 공기조화기의 중앙선(F)을 기준으로 좌측에 위치하는 좌측 토출유닛일 수 있고, 한 쌍의 토출유닛(2,3) 중 다른 하나는 공기조화기의 중앙선(F)을 기준으로 우측에 위치하는 우측 토 출유닛일 수 있다. 좌측토출유닛은 공기조화기의 좌측 방향부터 공기조화기의 전방 방향까지 공기를 토출할 수 있고, 우측토출유닛 은 공기조화기의 우측 방향부터 공기조화기의 전방 방향까지 공기를 토출할 수 있다. 좌측토출유닛과 우측토출유닛은 서로 반대 방향으로 공기를 토출할 수 있다. 좌측 토출유닛은 공기조화기의 좌 측 방향으로 공기를 토출할 수 있고, 우측 토출유닛은 공기조화기의 우측 방향으로 공기를 토출할 수 있다. 좌측 토출유닛은 공기조화기 좌측 전방의 제1경사방향으로 공기를 토출할 수 있고, 우측 토출유닛은 공기조화기 의 우측 전방의 제2경사방향으로 공기를 토출할 수 있다. 또한, 좌측 토출유닛은 공기조화기의 전방 방향으로 공기를 토출할 수 있고, 우측 토출유닛은 공기조화기의 전 방 방향으로 공기를 토출할 수 있다. 이 경우, 좌측 토출유닛과 우측 토출유닛은 평행한 방향으로 공기를 토출 할 수 있고, 공기조화기의 전방에는 2개의 전방기류가 형성될 수 있다. 공기조화기는 외관을 형성하는 케이싱을 더 포함할 수 있다. 공기조화기는 한 쌍의 토출유닛(2,3)으로 공기를 송풍하는 송풍기를 더 포함할 수 있다. 공기조화기는 실내의 바닥에 설치되는 스탠드형 공기조화기로 구성되는 것이 가능하고, 벽에 걸어서 설치되 는 벽걸이형 공기조화기로 구성되는 것이 가능하다. 이하, 스탠드형 공기조화기를 예로 들어 설명한다. 케이싱은 베이스 어셈블리를 포함할 수 있다. 베이스 어셈블리는 전면 및 상면이 개방된 입체적 형 상일 수 있다. 베이스 어셈블리는 로어 프레임과, 로어 프레임에 형성된 후판부(13A)를 포함할 수 있다. 후판부(13A)는 로어 프레임의 후방부에 수직하게 형성될 수 있다. 또한, 베이스 어셈블리는 로어 프레임에 형성된 내부판(13B)을 더 포함할 수 있다. 내부판(13B)은, 상 기 베이스 어셈블리의 강성을 보강할 수 있다. 또한, 내부판(13B)은, 내부 부품이 수용되는 수용 공간을 형성할 수 있다. 예를 들어, 내부판(13B)에 의해 생성 되는 수용 공간에는 음성 인식 모듈이 장착될 수 있다. 케이싱은 프론트 커버를 더 포함할 수 있다. 프론트 커버는 송풍기의 전방을 덮게 설치될 수 있 다. 프론트 커버는 하단이 베이스 어셈블리의 로어 프레임에 올려질 수 있다. 프론트 커버는 로어 프레임의 일부를 차폐하게 로어 프레임에 설치될 수 있다. 케이싱은 공기가 공기조화기 내부로 흡입되기 위해 통과하는 흡입바디를 포함할 수 있다. 흡입바디 는 베이스 어셈블리의 상측에 설치될 수 있다. 흡입바디는 베이스 어셈블리의 후판부(13A) 상 측에 설치될 수 있다. 흡입바디는 베이스 어셈블리의 후판부(13A) 상측에 상하 방향으로 길게 배치될 수 있다. 흡입바디에는 공기조화기 외부의 공기가 공기조화기 내부로 흡입되기 위해 통과하는 공기흡입구 (16A)가 형성될 수 있다. 공기조화기는 공기를 정화시키는 정화유닛을 포함할 수 있다. 정화유닛은 흡입바디에 설치될 수 있고, 공기조화기로 흡입된 공기는 정화유닛에 의해 정화될 수 있다. 정화유닛은 공기가 통과하면서 이 물질이 걸러지는 필터와, 공기 중의 먼지를 대전시켜 포집하는 전기집진기와, 공기 중에 이온을 발생시키는 이 온발생기 중 적어도 하나를 포함할 수 있다. 공기조화기는 케이싱의 내부에 설치되어 공기를 냉매와 열교환시키는 열교환기를 포함할 수 있다. 열 교환기는 공기유동방향으로 흡입바디와 송풍기의 사이에 위치될 수 있다. 송풍기는 케이싱 내부에 설치될 수 있다. 송풍기는 열교환기의 일부와 마주보게 설치될 수 있다. 송풍기는 열교환기의 전방에 위치되게 설치될 수 있다. 송풍기는 후방의 공기를 흡인하여 상측 방향 과 하측 방향 중 어느 한 방향으로 송풍할 수 있다. 송풍기는 복수개 토출유닛(2,3) 중 어느 하나의 내부로 공기를 송풍하는 제1 토출부와, 복수개 토출 유닛(2,3) 중 다른 하나의 내부로 공기를 송풍하는 제2 토출부를 포함한다. 송풍기는 하나의 흡입부 로 흡입된 공기를 제1 토출부와 제2 토출부로 분산 토출할 수 있다. 송풍기는 복수개의 흡입부 (21,23)를 포함할 수 있고, 복수개의 흡입부(21,23) 중 제1 흡입부로 공기를 흡입한 후 제1 토출부로 송풍할 수 있으며, 복수개의 흡입부(21,23) 중 제2 흡입부로 공기를 흡입한 후 제2 토출부로 송풍할 수 있다. 송풍기는 복수개의 흡입부(21,23)를 포함할 경우, 공기가 제1 흡입부로 흡입된 후 제2 토출부(2 2)로 토출되는 제1 송풍유로와, 공기가 제2 흡입부로 흡입된 후 제2 토출부로 토출되는 제2 송풍유로를 포함할 수 있다. 송풍기는 복수개의 흡입부(21,23)를 포함할 경우, 제1 송풍유로에서 회전되는 제1 블로워 와, 제1 블로워를 회전시키는 제1 팬모터를 포함할 수 있고, 제2 송풍유로에서 회전되는 제2 블로 워와, 제2 블로워를 회전시키는 제2 팬모터를 더 포함할 수 있다. 송풍기는 제1 팬모터가 장착되고 제1 블로워를 둘러싸는 제1 팬하우징과, 제1 팬하우징과 결합되고 제1 블로워로 공기를 안내하는 제1 흡입부가 형성된 제1 오리피스를 포함할 수 있다. 송풍기는 제2 팬모터가 장착되고 제2 블로워를 둘러싸는 제2 팬하우징과, 제2 팬하우징과 결합되고 제2 블로워로 공기를 안내하는 제2 흡입부가 형성된 제2 오리피스를 포함할 수 있다. 제2 팬하우징은 제1 오리피스의 상부에 일체로 형성될 수 있다. 제2 오리피스는 제2 팬하우징 의 후방에 결합될 수 있고, 제1 팬하우징은 제1 오리피스의 전방에 결합될 수 있다. 송풍기는 토출 어셈블리(D)의 아래에 위치되어 토출 어셈블리(D)로 공기를 송풍하는 것이 가능하다. 송풍기 는 토출 어셈블리(D)의 위에 위치되어 토출 어셈블리(D)로 공기를 송풍하는 것이 가능하다. 송풍기는 토 출 어셈블리(D)의 후방에 위치되어 토출 어셈블리(D)로 공기를 송풍하는 것이 가능하다. 송풍기는 토출 어셈블리(D)의 아래에 위치될 경우 제1 토출부와, 제2 토출부 각각은 송풍기의 상 부에 위치될 수 있고, 그 각각은 상측 방향으로 공기를 토출 안내할 수 있다. 제1 토출부는 도 3에 도시된 바와 같이, 제1 팬하우징과 제2 팬하우징에 의해 형성될 수 있다. 제1 팬하우징은 배면 및 상면이 개방된 제1 프런트 덕트부가 상방향으로 돌출되어 제2 팬하우징의 일부 전방에 배치될 수 있고, 제2 팬하우징은 제1 프런트 덕트부의 후방에 위치된 제1 리어 덕트부를 포 함할 수 있다. 제1 리어 덕트부는 전면 및 상면이 개방되고 제2 팬하우징에 후방으로 함몰된 형상으로 형성될 수 있다. 제1 프런트 덕트부와 제1 리어 덕트부는 제1 블로워에서 송풍된 공기를 좌측 토출 유닛으로 안내할 수 있다. 제1 프런트 덕트부가 제1 리어 덕트부 전방에 위치되게 제1 팬하우징과 제2 팬하우징이 결합되면, 제1 프런트 덕트부와 제1 리어 덕트부는 중공 원통 형상의 덕트부를 구 성할 수 있다. 제2 토출부는 도 4에 도시된 바와 같이, 제2 팬하우징과 제2 오리피스에 의해 형성될 수 있다. 제2 팬하우징은 배면 및 상면이 개방된 제2 프런트 덕트부가 전방 방향으로 돌출되어 제2 오리피스의 일부 전방에 배치될 수 있다. 그리고, 제2 오리피스는 제2 프런트 덕트부의 후방에 위치하는 제2 리어 덕트부를 포함할 수 있다. 제2 리어 덕트부는 전면 및 상면이 개방될 수 있다. 제2 프런트 덕트부 와 제2 리어 덕트부는 제2 블로워에서 송풍된 공기를 우측 토출유닛으로 공기를 안내할 수 있다. 제2 프런트 덕트부가 제2 리어 덕트부 전방에 위치되게 제2 팬하우징과 제2 오리피스가 결합되면, 제2 프런트 덕트부와 제2 리어 덕트부는 중공 원통 형상의 덕트부를 포함할 수 있다. 이하, 한 쌍의 토출유닛(2,3) 각각의 하부에 흡입구가 형성되고, 둘레부의 일부에 공기토출구가 형성된 예를 설 명한다. 한 쌍의 토출유닛(2,3) 중 어느 하나는 송풍기에서 송풍된 공기가 유입되는 제1 흡입구와, 제1 흡입 구를 통과한 공기가 안내되는 제1 내부유로와, 제1 내부유로에 안내된 공기가 외부로 토출되는 제1 공기토출구를 포함할 수 있고, 제1 흡입구와, 제1 내부유로와, 제1 공기토출구는 한 쌍의 토출 유닛(2,3) 중 어느 하나의 제1 토출유로를 구성할 수 있다. 한 쌍의 토출유닛(2,3) 중 어느 하나에는 제1 토출유로를 통과하는 공기의 풍향을 조절하는 제1 풍향조 절베인이 배치될 수 있다. 제1 풍향조절베인은 한 쌍의 토출유닛(2,3) 중 어느 하나의 내부에 회전 가능하게 배치될 수 있다. 제1 풍향조절베인은 제1 내부유로에 위치되게 설치될 수 있고, 그 선단이 제 1 공기토출구를 마주보게 설치될 수 있다. 제1 흡입구는 한 쌍의 토출유닛(2,3) 중 어느 하나의 하부에 상하 방향으로 관통되게 형성될 수 있다. 제1 내부유로는 한 쌍의 토출유닛(2,3) 중 어느 하나의 내부에 상하 방향으로 길게 형성될 수 있다. 제1 공기토출구는 한 쌍의 토출유닛(2,3) 중 어느 하나의 둘레부에 형성될 수 있다. 한 쌍의 토출유닛(2,3) 중 어느 하나는 상면이 막힌 형상일 수 있고, 제1 공기토출구는 한 쌍의 토출유닛(2,3) 중 어느 하나 의 상판부와 둘레부 중 둘레부에 형성될 수 있다. 제1 공기토출구는 한 쌍의 토출유닛(2,3) 중 어느 하 나의 둘레부에 수평 방향으로 관통되게 형성될 수 있다. 제1 공기토출구는 한 쌍의 토출유닛(2,3) 중 어 느 하나의 둘레부에 상하 방향으로 길게 형성될 수 있다. 제1 흡입구의 개방 방향과 제1 공기토출구(4 3)의 개방 방향이 직교할 수 있다. 공기는 제1 흡입구를 통해 한 쌍의 토출유닛(2,3) 중 어느 하나 내부 로 흡입된 후 내부에서 유동 방향이 변환되고, 제1 공기토출구를 통해 수평 방향으로 토출될 수 있다. 한 쌍의 토출유닛(2,3) 중 어느 하나는 복수개 부재의 결합체로 구성될 수 있다. 한 쌍의 토출유닛(2,3) 중 어느 하나는 제1 토출유로가 형성된 제1 토출바디와, 제1 토출바디의 상부에 설치된 제1 탑 바 디와, 제1 토출바디의 하부에 결합된 제1 로어 링을 포함할 수 있다. 제1 토출바디는 상면이 막히고, 하면이 개방되며, 원통 형상으로 형성될 수 있다. 도 3에 도시된 제1 흡입 구와, 제1 내부유로와, 제1 공기토출구는 제1 토출바디에 형성될 수 있고, 제1 공기토출구(4 3)는 제1 토출바디의 둘레부 일부에 형성될 수 있다. 한편, 도 3에 도시된 제1 풍향조절베인은 제1 토출바디에 회전 가능하게 배치될 수 있다. 제1 토출바디 에는 제1 풍향조절베인을 회전시키기 위한 구동력을 발생하는 제1 풍향조절모터(미도시)가 설치될 수 있다. 제1 풍향조절모터는 제1 풍향조절베인과 직접 연결되거나 링크 등의 동력전달부재를 통해 제1 풍향조 절베인과 연결될 수 있다. 제1 토출바디는 복수개 부재의 결합체로 구성될 수 있고, 제1 토출바디의 외관을 형성하는 제1 아우터 바디(46A)와, 제1 아우터 바디(46A)의 내부에 설치된 제1 이너 가이드(46B)를 포함할 수 있다. 제1 토출바디 는 한 쌍의 토출유닛(2,3) 중 어느 하나의 회전중심축을 구성하는 제1 회전돌기(46C)가 돌출될 수 있다. 제1 아우터 바디(46A)는 중공 원통 형상으로 형성될 수 있다. 제1 아우터 바디(46A)는 상면과 하면이 각각 개 방될 수 있고, 그 내부에는 제1 이너 가이드(46B)가 수용되는 공간이 형성될 수 있다. 제1 아우터 바디(46A)는 단면형상이 호 형상인 아우터 바디의 복수개가 중공 원통 형상으로 결합될 수 있고, 복수개의 아우터 바디 중 어느 하나에 제1 공기토출구가 형성될 수 있으며, 제1 공기토출구에 제1 토출그릴이 위치되게 형성될 수 있다. 제1 이너 가이드(46B)는 하면이 개방되고 상면이 막힌 중공 통체 형상일 수 있고, 그 하부에 제1 흡입구가 형성될 수 있고, 그 내부에 제1 토출유로가 형성될 수 있다. 제1 풍향조절베인은 제1 이너 가이드(46 B)에 회전 가능하게 연결될 수 있다. 제1 탑 바디는 제1 풍향조절모터에 연결된 제1 전선(미도시)을 안내하는 전선 가이드일 수 있고, 제1 전선 이 통과하는 전선 통공(47A)이 형성될 수 있다. 제1 탑 바디는 제1 토출바디의 상부에 끼움되어 장착되거나 스크류 등의 체결부재로 장착될 수 있다. 제1 탑 바디는 제1 회전돌기(46C)를 둘러싸는 제1 보스부(47B)가 상방향으로 돌출 형성될 수 있다. 제1 보 스부(47B)는 제1 회전돌기(46C)와 함께 한 쌍의 토출유닛(2,3) 중 어느 하나의 회전중심축을 구성할 수 있다. 제1 보스부(47B)는 탑 커버의 제1 지지부와 제1 회전돌기(46C) 사이에 위치될 수 있고, 제1 지 지부에 의해 지지될 수 있다. 즉, 한 쌍의 토출유닛(2,3) 중 어느 하나는 제1 회전돌기(46C) 및 제1 보 스부(47B)에 의해 탑 커버에 회전 가능하게 유지될 수 있다. 제1 로어 링은 제1 토출 바디의 하부에 결합될 수 있고, 제1 토출바디와 함께 회전될 수 있다. 제1 로어 링은 제1 토출바디와 스크류 등의 체결부재로 결합될 수 있다. 제1 로어 링에는 스크류 등의 체결부재가 관통되는 체결부재 관통공이 형성될 수 있다. 제1 로어 링은 로어 바디에 안착될 수 있고, 로어 바디와 마찰될 수 있다. 제1 로어 링은 금 속재로 구성될 수 있고, 제1 토출바디의 강도를 보강할 뿐만 아니라 제1 토출바디의 마모를 방지할 수 있다. 한 쌍의 토출유닛(2,3) 중 다른 하나에는 송풍기에서 송풍된 공기가 유입되는 제2 흡입구와, 제2 흡 입구를 통과한 공기가 안내되는 제2 내부유로와, 제2 내부유로에 안내된 공기가 외부로 토출되는 제2 공기토출구를 포함할 수 있고, 제2 흡입구와, 제2 내부유로와, 제2 공기토출구는 한 쌍의 토출유닛(2,3) 중 다른 하나의 제2 토출유로를 구성할 수 있다. 한 쌍의 토출유닛(2,3) 중 다른 하나에는 제2 토출유로를 통과하는 공기의 풍향을 조절하는 제2 풍향조 절베인이 배치될 수 있다. 제2 풍향조절베인은 한 쌍의 토출유닛(2,3) 중 다른 하나의 내부에 회전 가능하게 배치될 수 있다. 제2 풍향조절베인은 제2 내부유로에 위치되게 설치될 수 있고, 그 선단이 제 2 공기토출구를 마주보게 설치될 수 있다. 제2 흡입구는 한 쌍의 토출유닛(2,3) 중 다른 하나의 하부에 상하 방향으로 관통되게 형성될 수 있다. 제2 내부유로는 한 쌍의 토출유닛(2,3) 중 다른 하나의 내부에 상하 방향으로 길게 형성될 수 있다. 제2 공기토출구는 한 쌍의 토출유닛(2,3) 중 다른 하나의 둘레부에 형성될 수 있다. 한 쌍의 토출유닛(2,3) 중 다른 하나은 상면이 막힌 형상일 수 있고, 제2 공기토출구는 한 쌍의 토출유닛(2,3) 중 다른 하나 의 상판부와 둘레부 중 둘레부에 형성될 수 있다. 제2 공기토출구는 한 쌍의 토출유닛(2,3) 중 다른 하 나의 둘레부에 수평 방향으로 관통되게 형성될 수 있다. 제2 공기토출구는 한 쌍의 토출유닛(2,3) 중 다 른 하나의 둘레부에 상하 방향으로 길게 형성될 수 있다. 제2 흡입구의 개방 방향과 제2 공기토출구(5 3)의 개방 방향이 직교할 수 있다. 공기는 제2 흡입구를 통해 한 쌍의 토출유닛(2,3) 중 다른 하나 내부 로 흡입된 후 내부에서 유동 방향이 변환되고, 제2 공기토출구를 통해 수평 방향으로 토출될 수 있다. 한 쌍의 토출유닛(2,3) 중 다른 하나는 복수개 부재의 결합체로 구성될 수 있다. 한 쌍의 토출유닛(2,3) 중 다른 하나는 제2 토출유로가 형성된 제2 토출바디와, 제2 토출바디의 상부에 설치된 제2 탑 바 디와, 제2 토출바디의 하부에 결합된 제2 로어 링을 포함할 수 있다. 제2 토출바디는 제1 토출바디과 같이, 상면이 막히고, 하면이 개방되며, 원통 형상으로 형성될 수 있다. 도 4에 도시된 제2 흡입구와, 제2 내부유로와, 제2 공기토출구는 제2 토출바디에 형성될 수 있고, 제2 공기토출구는 제2 토출바디의 둘레부 일부에 형성될 수 있다. 한편, 제2 풍향조절베인은 제2 토출바디에 회전 가능하게 배치될 수 있다. 제2 토출바디에는 제2 풍향조절베인을 회전시키기 위한 구동력을 발생하는 제2 풍향조절모터(미도시)가 설치될 수 있다. 제2 풍향 조절모터는 제2 풍향조절베인과 직접 연결되거나 링크 등의 동력전달부재를 통해 제2 풍향조절베인과 연결될 수 있다. 제2 토출바디는 복수개 부재의 결합체로 구성될 수 있고, 제2 토출바디의 외관을 형성하는 제2 아우터 바디(56A)와, 제1 아우터 바디(56A)의 내부에 설치된 제2 이너 가이드(56B)를 포함할 수 있다. 제2 토출바디 는 한 쌍의 토출유닛(2,3) 중 다른 하나의 회전중심축을 구성하는 제2 회전돌기(56C)가 돌출될 수 있다. 제2 아우터 바디(56A)는 전체적으로 중공 원통 형상으로 형성될 수 있다. 제2 아우터 바디(56A)는 상면과 하 면이 각각 개방될 수 있고, 그 내부에는 제2 이너 가이드(56B)가 수용되는 공간이 형성될 수 있다. 제2 아우터 바디(56A)는 단면형상이 호 형상인 아우터 바디의 복수개가 중공 원통 형상으로 결합될 수 있고, 복수개의 아우 터 바디 중 어느 하나에 제2 공기토출구가 형성될 수 있으며, 제2 공기토출구에 제2 토출그릴이 위치되 게 형성될 수 있다. 제2 이너 가이드(26B)는 하면이 개방되고 상면이 막힌 중공 통체 형상일 수 있고, 그 하부에 제2 흡입구가 형성될 수 있고, 그 내부에 제2 토출유로가 형성될 수 있다. 제2 풍향조절베인은 제2 이너 가이드(56 B)에 회전 가능하게 연결될 수 있다. 제2 탑 바디는 제2 풍향조절모터에 연결된 제2 전선(미도시)을 안내하는 전선 가이드일 수 있고, 제2 전선 이 통과하는 전선 통공(57A)이 형성될 수 있다. 제2 탑 바디는 제2 토출바디의 상부에 끼움되어 장착되거나 스크류 등의 체결부재로 장착될 수 있다. 제2 탑 바디는 제2 회전돌기(56C)를 둘러싸는 제2 보스부(57B)가 상방향으로 돌출 형성될 수 있다. 제2 보 스부(57B)는 제2 회전돌기(56C)와 함께 한 쌍의 토출유닛(2,3) 중 다른 하나의 회전중심축을 구성할 수 있다. 제2 보스부(57B)는 탑 커버의 제2 지지부와 제2 회전돌기(56C) 사이에 위치될 수 있고, 제2 지 지부에 의해 지지될 수 있다. 즉, 제2 토출유닛은 제2 회전돌기(56C) 및 제2 보스부(57B)에 의해 탑 커 버에 회전 가능하게 유지될 수 있다. 제2 로어 링은 제2 토출 바디의 하부에 결합될 수 있고, 제2 토출바디와 함께 회전될 수 있다. 제2 로어 링은 제2 토출바디와 스크류 등의 체결부재로 결합될 수 있다. 제2 로어 링에는 스크류 등의 체결부재가 관통되는 체결부재 관통공이 형성될 수 있다. 제2 로어 링은 로어 바디에 안착될 수 있고, 로어 바디와 마찰될 수 있다. 제2 로어 링은 금 속재로 구성될 수 있고, 제2 토출바디의 강도를 보강할 뿐만 아니라 제2 토출바디의 마모를 방지할 수 있다. 토출유닛 홀더는 한 쌍의 토출유닛(2,3)이 올려진 로어 바디를 포함할 수 있다. 토출유닛 홀더는 적어도 일부가 한 쌍의 토출유닛(2,3) 후방에 위치되는 리어 바디를 포함할 수 있다. 토출유닛 홀더는 한 쌍의 토출유닛(2,3) 상측에 위치되는 탑 커버를 포함할 수 있다. 토출유닛 홀더는 탑 커버의 하부에 리어 바디가 배치되어, 전체적으로 '┏' 형상으로 구성되는 것이 가능하다. 토출유닛 홀더는 로어 바디의 상부에 리어 바디가 배치되어, 전체적으로 'ㄴ'형상으로 구성되는 것이 가능하다. 토출유닛 홀더는 탑 커버와 로어 바디가 상하 방향으로 이격되고 탑 커버와 로어 바디 의 사이에 리어 바디가 배치되어, 전체적으로 'ㄷ' 형상으로 구성되는 것이 가능하다.로어 바디는 한 쌍의 토출유닛(2,3) 각각의 하부를 회전 가능하게 지지할 수 있다. 한 쌍의 토출유닛(2, 3)은 로어 바디에 이격되게 안착될 수 있고, 한 쌍의 토출유닛(2,3)의 하중은 로어 바디에 분산되어 작용될 수 있다. 로어 바디는 토출유닛 홀더의 하부를 구성할 수 있다. 로어 바디는 링 형상의 제1 안착부와, 링 형상의 제2 안착부와, 제 1안착부와 제2 안착 부를 잇는 로어 플레이트부를 포함한다. 한 쌍의 토출유닛(2,3) 중 어느 하나는 제1 안착부에 회전 가능하게 안착되는 것이 가능하고, 후술하는 제1 고정 링에 회전 가능하게 안착되는 것이 가능하다. 그리고, 한 쌍의 토출유닛(2,3) 중 다른 하나는 제2 안착부에 회전 가능하게 안착되는 것이 가능하고, 후술하는 제2 고정 링에 회전 가능하게 안착되 는 것이 가능하다. 로어 플레이트부는 제1 안착부 및 제2 안착부와 일체로 형성될 수 있다. 로어 플레이트부 는 제1 안착부와 제2 안착부의 사이와, 제1 안착부의 후방부 및 제2 안착부의 후방부 에 위치될 수 있다. 로어 바디는 복수개 부재의 결합체로 구성될 수 있고, 제 1안착부에 설치되고 한 쌍의 토출유닛 (2,3) 중 어느 하나가 회전 가능하게 안착된 제 1 고정링과, 제 2안착부에 설치되고 한 쌍의 토출 유닛(2,3) 중 다른 하나가 회전 가능하게 안착된 제 2 고정 링을 더 포함할 수 있다. 제1 고정 링과 제1 로어 링은 금속재로 구성될 수 있고, 제1 로어 링은 제1 고정 링에 안착 될 수 있다. 제2 고정 링과 제2 로어 링은 금속재로 구성될 수 있고, 제2 로어 링은 제2 고정 링에 안착 될 수 있다. 토출유닛 홀더는 로어 바디에 설치된 로어 커버를 더 포함할 수 있다. 로어 커버는 로어 바 디의 하부에 체결될 수 있다. 로어 커버는 송풍기의 상부에 체결될 수 있다. 로어 커버는 토 출유닛 홀더를 송풍기에 장착시키는 토출유닛 홀더 마운터로 기능할 수 있다. 공기조화기는 한 쌍의 토출유닛(2,3)을 회전시키는 토출유닛 회전기구를 포함할 수 있다. 토출유닛 회전기구 는 한 쌍의 토출유닛(2,3) 중 어느 하나를 회전시키는 제1 토출유닛 회전기구와, 한 쌍의 토출유닛(2,3) 중 다른 하나를 회전시키는 제2 토출유닛 회전기구를 포함할 수 있다. 제1 토출유닛 회전기구는 한 쌍의 토출유닛(2,3) 중 어느 하나에 배치된 제1 기어와 제1 기어에 치합되어 제1 기어를 회전시키는 제1 구동기어와, 체1구동기어를 회전시키는 제1 모터를 포함 할 수 있다. 제1 기어는 제1 구동기어에 의해 회전되는 제1 종동기어일 수 있다. 제1 기어는 링 형상으로 형성 된 링형 바디로 구성될 수 있다. 링형 바디는 외둘레 일부에 제1 구동기어와 치합되는 기어치가 형성될 수 있다. 링형 바디는 한 쌍의 토출유닛(2,3) 중 어느 하나의 제1 로어 링과 제1 토출바디 중 적어도 하나와 스크류 등의 체결부재로 체결될 수 있다. 링형 바디에는 스크류 등의 체결부재가 관통되는 체결부재 관 통공이 형성될 수 있다. 제1 구동기어는 제1 기어 보다 크기가 작게 형성될 수 있다. 제1 구동기어는 제1 기어 주변에 위치될 수 있고, 제1 기어의 주변에서 제1 기어를 회전시킬 수 있다. 제1 모터는 로어 커버에 설치될 수 있다. 제 2 토출유닛 회전기구는 한 쌍의 토출유닛(2,3) 중 다른 하나에 배치된 제2 기어와 제2 기어에 치 합되어 제2 기어를 회전시키는 제2 구동기어와, 제2 구동기어를 회전시키는 제2 모터를 포함할 수 있다. 제2 기어는 제2 구동기어에 의해 회전되는 제2 종동기어일 수 있다. 제2 기어는 링 형상으로 형성 된 링형 바디로 구성될 수 있다. 링형 바디는 외둘레 일부에 제2 구동기어와 치합되는 기어치가 형성될 수 있다. 링형 바디는 제2 토출유닛의 제2 로어 링과 제2 토출바디 중 적어도 하나와 스크류 등의 체결 부재로 체결될 수 있다. 링형 바디에는 스크류 등의 체결부재가 관통되는 체결부재 관통공이 형성될 수 있다. 제2 구동기어는 제2 기어 보다 크기가 작게 형성될 수 있다. 제2 구동기어는 제2 기어 주변에 위치될 수 있고, 제2 기어의 주변에서 제2 기어를 회전시킬 수 있다. 제2 모터는 로어 커버에 설치될 수 있다. 로어 커버에는 제1 모터가 삽입되어 수용되는 제1 모터 수용부와, 제2 모터가 삽입되어 수용 되는 제2 모터 수용부가 형성될 수 있다. 로어 커버는 송풍기와 스크류 등의 체결부재로 체결되는 결합되는 복수개의 결합부(115,116)를 포함할 수 있다. 로어 커버는 로어 바디에 스크류 등의 체결부 재로 체결되는 로어 바디 체결부가 적어도 하나 형성될 수 있다. 리어 바디는 로어 바디에 수직하게 형성되고 한 쌍의 토출유닛(2,3) 각각의 적어도 일부를 수용할 수 있다. 리어 바디는 한 쌍의 토출유닛(2,3)을 회전 가능하게 수용할 수 있다. 리어 바디는 로어 바디 의 후방부에 로어 바디와 일체로 형성되는 것이 가능하다. 리어 바디는 로어 바디와 별도 로 성형된 후 스크류 등의 체결부재나 후크 등의 체결부로 로어 바디의 후방부와 결합되는 것도 가능함은 물론이다. 리어 바디는 한 쌍의 토출유닛(2,3) 사이의 틈 보다 크게 형성될 수 있고, 한 쌍의 토출유닛 (2,3)의 후방 위치에서 한 쌍의 토출유닛(2,3) 사이의 틈을 차폐할 수 있다. 리어 바디는 한 쌍의 토출유닛(2,3) 사이의 틈을 향해 돌출되는 돌출부를 갖을 수 있다. 돌출부 는 한 쌍의 토출유닛(2,3) 중 어느 하나를 마주보는 일측부(126A)와, 한 쌍의 토출유닛(2,3) 중 다른 하나를 마주보는 타측부(126B)를 포함할 수 있다. 돌출부는 일측부(126A)의 선단과 타측부(126B)의 선 단을 잇는 전판부(126C)를 더 포함할 수 있다. 돌출부는 전면과 좌측면과 우측면 각각이 막힌 형상이고, 배면이 개방된 형상일 수 있다. 공기조화기는 리어 바디에 결합되는 백 커버를 더 포함할 수 있다. 백 커버는 리어 바디 의 배면을 덮어 리어 바디를 보호할 수 있다. 백 커버는 흡입 바디의 상측에 배치되어 흡입 바디 상측을 덮을 수 있다. 탑 커버는 한 쌍의 토출유닛(2,3) 상측에서 한 쌍의 토출유닛(2,3) 사이를 덮을 수 있다. 탑 커버는 디스플레이 어셈블리(10A) 상부와 돌출부 상부 사이의 틈을 덮을 수 있다. 탑 커버는 리어 바디에 결합될 수 있다. 탑 커버는 한 쌍의 토출유닛(2,3)의 상부를 유지시킬 수 있다. 탑 커버는 한 쌍의 토출유닛(2,3) 중 어느 하나의 상부를 회전 가능하게 지지하는 제1 지지부과, 한 쌍의 토출유닛(2,3) 중 다른 하나의 상부를 회전 가능하게 지지하는 제2 지지부가 형성될 수 있다. 제1 지지부는 한 쌍의 토출유닛(2,3) 중 어느 하나의 회전 중심축을 회전 가능하게 지지 하는 지지홀일 수 있다. 제2 지지부는 한 쌍의 토출유닛(2,3) 중 다른 하나의 회전 중심축을 회전 가능하 게 지지하는 지지홀일 수 있다. 탑 커버는 리어 바디의 상부에 스크류 등의 체결부재나 후크 등의 걸 이부로 체결될 수 있다. 디스플레이 어셈블리(10A)는 일측면이 한 쌍의 토출유닛(2,3) 중 어느 하나의 외둘레면을 마주볼 수 있고, 타측면이 한 쌍의 토출유닛(2,3) 중 다른 하나의 외둘레면을 마주볼 수 있다. 디스플레이 어셈블 리(10A)는 전면이 외부로 토출될 수 있다. 디스플레이 어셈블리(10A)는 복수개 부재의 결합체로 구성될 수 있다. 디스플레이 어셈블리(10A)는 공기조화기 를 조작하는 컨트롤 패널로 기능하고, 공기조화기의 정보를 표시하는 디스플레이로 기능할 수 있다. 디스플레이 어셈블리(10A)는 디스플레이 겸용 컨트롤 패널로 기능할 수 있다. 디스플레이 어셈블리(10A)는 한 쌍의 토출유닛(2,3) 각각 보다 크기가 작을 수 있다. 디스플레이 어셈블리 (10A)는 전방으로 갈수록 좌우 방향 폭이 증대될 수 있다. 디스플레이 어셈블리(10A) 선단의 좌우 방향 폭(L1)은 돌출부 선단의 좌우 방향 폭(L2) 보다 클 수 있다. 디스플레이 어셈블리(10A)는 로어 바디의 상측에 배치될 수 있다. 디스플레이 어셈블리(10A)는 로어 바디 의 로어 플레이트부 상측에 위치할 수 있다. 디스플레이 어셈블리(10A)는 일부가 탑 커버 하측 에 위치될 수 있고, 디스플레이 어셈블리(10A)는 로어 바디와 탑 커버 사이에서 한 쌍의 토출유닛 (2,3) 사이의 틈을 차폐할 수 있다. 디스플레이 어셈블리(10A)는 로어 바디와 탑 커버 사이를 좌,우 구획할 수 있다.토출유닛 홀더는 그 좌측면과 우측면과 전면 각각이 개방된 형상일 수 있다. 토출유닛 홀더는 한 쌍의 토출유닛(2,3)을 평행하게 유지시키는 프레임일 수 있고, 한 쌍의 토출유닛(2,3)은 이러한 토출유닛 홀더에 좌,우 이격되게 배치될 수 있다. 디스플레이 어셈블리(10A)는 토출유닛 홀더에 설치되어, 토출유닛 홀더를 좌,우 구획할 수 있다. 공기조 화기는 디스플레이 어셈블리(10A)의 좌측과 리어 바디의 좌측단 사이가 개방될 수 있고, 디스플레이 어 셈블리(10A)의 우측와 리어 바디의 우측단 사이가 개방될 수 있다. 한 쌍의 토출유닛(2,3) 중 어느 하나 는 일부가 디스플레이 어셈블리(10A)의 좌측과 리어 바디의 좌측단 사이에 위치되게 설치될 수 있다. 한 쌍의 토출유닛(2,3) 중 다른 하나는 일부가 디스플레이 어셈블리(10A)의 우측과 리어 바디의 우측단 사이에 위치되게 설치될 수 있다. 한 쌍의 토출유닛(2,3)은 디스플레이 어셈블리(10A)와 토출유닛 홀더에 의 해 보호될 수 있다. 한 쌍의 토출유닛(2,3) 각각은 원통 형상일 수 있고, 중간을 기준으로 전방 방향으로 갈수록 그 사이의 틈은 점 차 커질 수 있고, 후방 방향으로 갈수록 그 사이의 틈이 점차 커질 수 있다. 디스플레이 어셈블리(10A)는 토출유닛 홀더의 후방부와 전방부 중 전방부에 위치될 수 있다. 디스플레이 어 셈블리(10A)는 토출유닛 홀더의 전방부 좌측과, 전방부 중앙과, 전방부 우측 중 전방부 중앙에 위치될 수 있 다. 토출유닛 홀더는 좌측면과, 우측면과, 전면 좌측과, 전면 우측이 개방될 수 있다. 토출유닛 홀더는 디스플레이 어셈블리(10A)에 의해 전면 중앙이 차폐될 수 있다. 도 7은 본 발명의 일 실시예에 따른 공기조화기의 디스플레이 어셈블리의 확대 단면도이고, 도 8은 본 발명의 일 실시예에 따른 공기조화기의 디스플레이 어셈블리의 분해 사시도이다. 디스플레이 어셈블리(10A)는 한 쌍의 토출유닛(2,3) 사이에 위치되고 전면이 개방된 디스플레이 케이스 와 디스플레이 케이스 전방에 배치된 디스플레이 커버와 디스플레이 커버를 향해 광을 조사하는 피시비(PCB) 어셈블리를 포함할 수 있다. 그리고, 디스플레이 어셈블리(10A)에는 돌출부에 결합하는 리어 결합부가 형성될 수 있다. 디스플레이 케이스는 배면이 막힌 형상일 수 있고, 좌측면이 한 쌍의 토출유닛(2,3) 중 어느 하나 의 외둘레면을 마주볼 수 있고, 우측면이 한 쌍의 토출유닛(2,3) 중 다른 하나의 외둘레면을 마주볼 수 있으며, 전면이 개방될 수 있다. 디스플레이 케이스는 돌출부에 결합되고, 전방으로 갈수록 좌우 방향 폭이 증대될 수 있다. 리어 결 합부는 디스플레이 케이스에 형성될 수 있다. 리어 결합부는 디스플레이 케이스에 형성되 어 돌출부에 끼워지는 한 쌍의 리브를 포함할 수 있다. 한 쌍의 리브 각각은 디스플레이 케이스 후판 부에서 후방 방향으로 돌출될 수 있고, 돌출부는 일부가 한 쌍의 리브 사이로 삽입되어 한 쌍의 리브에 끼 워질 수 있다. 디스플레이 케이스는 후판부와, 후판부의 좌측에 형성된 좌측판부과, 후판부의 우측에 형성된 우측판부과, 후판부의 상부에 형성된 상판부와, 후판부의 하부에 형성된 하판부을 포함할 수 있고, 좌측판부와 우측판부는 전방 방향으로 갈수록 서로간의 거리가 점차 멀어지게 형성될 수 있다. 디스플레이 케이스는 투명 또는 반투명하게 형성될 수 있다. 디스플레이 케이스는 광이 확산될 수 있 는 광확산부를 더 포함할 수 있다. 디스플레이 커버는 디스플레이 케이스보다 크기가 크게 형성될 수 있다. 디스플레이 커버는 디 스플레이 케이스의 개방된 전면을 덮을 수 있다. 디스플레이 커버는 디스플레이 케이스에 체결 되는 프런트 바디와, 프런트 커버 전면에 배치된 프론트 커버를 포함할 수 있다. 프런트 바디는 피시비 어셈블리의 광이 통과하는 광투과 홀이 형성될 수 있다. 프론트 커버는 공기조화기의 정보가 표시되는 표시창이 될 수 있고, 디스플레이 어셈블리는 디스플레 이로 기능할 수 있다. 프론트 커버는 사용자가 공기조화기를 조작하기 위해 터치하는 터치 입력부가 될 수 있고, 디스플레이 어셈블리는 컨트롤 패널로 기능할 수 있다. 디스플레이 커버의 좌우 방향 폭(L1)은 돌출부 선단의 좌우 방향 폭(L2) 보다 클 수 있다. 피시비 어셈블리는 디스플레이 커버를 향해 광을 조사할 수 있다. 피시비 어셈블리는 디스플레 이 케이스에 스크류 등의 체결부재로 체결되는 디스플레이 피시비와, 디스플레이 피시비에 설치 된 표시부품을 포함할 수 있다. 표시부품은 디스플레이 피시비에 설치되고 피시비 커버의 배면을 향해 광을 조사하는 디스플레 이 엘이디를 포함할 수 있다. 표시부품은 디스플레이 엘이디에서 조사된 광을 피시비 커버(17 0)로 안내하는 광 가이드를 더 포함할 수 있다. 광 가이드는 디스플레이 커버와 디스플레이 피 시비 사이에 위치되게 디스플레이 피시비에 설치될 수 있다. 피시비 어셈블리는 프론트 커버의 접촉시 스위칭되는 터치 스위치를 포함할 수 있다. 터치 스 위치는 선단이 디스플레이 커버에 접촉되게 디스플레이 피시비에 설치될 수 있다. 피시비 어셈블리는 터치 스위치를 보호하는 스위치 가이드을 더 포함할 수 있다. 스위치 가이드(18 8)는 디스플레이 커버와 디스플레이 피시비 사이에 위치되게 디스플레이 피시비에 설치될 수 있 다. 디스플레이 어셈블리(10A)는 디스플레이 케이스로 광을 조사하는 조명기구를 더 포함할 수 있다. 조명기구는 디스플레이 케이스 내부에 설치된 피시비와, 피시비에 한 쌍의 토출유닛 (2,3) 중 어느 하나에 더 가깝게 설치된 좌측 광원과, 피시비에 한 쌍의 토출유닛(2,3) 중 다른 하나에 더 가깝게 설치된 우측 광원을 포함할 수 있다. 좌측 광원과 우측 광원 각각은 적어 도 하나의 엘이디를 포함할 수 있다. 좌측 광원을 구성하는 엘이디는 피시비에 상하 방향으로 이격되게 복수개 설치될 수 있다. 우측 광원 을 구성하는 엘이디는 피시비에 상하 방향으로 이격되게 복수개 설치될 수 있다. 이하, 상기와 같이 구성된 본 발명의 작용을 설명하면 다음과 같다. 먼저, 공기조화기의 운전시, 한 쌍의 토출유닛(2,3)은 서로 이격되게 배치된 상태에서 공기를 외부로 토출할 수 있다. 공기조화기의 운전시, 송풍기는 구동될 수 있고, 공기조화기 외부의 공기는 흡입바디를 통과해 공기조화 기 내부로 흡입되고, 정화유닛 및 열교환기를 통과할 수 있다. 열교환기를 통과한 공기는 송풍기 로 흡입될 수 있고, 송풍기에 의해 한 쌍의 토출유닛(2,3)으로 송풍될 수 있다. 송풍기에서 송풍된 공기 중 일부는 한 쌍의 토출유닛(2,3) 중 어느 하나로 송풍될 수 있고, 송풍기에 서 송풍된 공기 중 나머지는 한 쌍의 토출유닛(2,3) 중 다른 하나로 송풍될 수 있다. 공기는 송풍기에 의 해 한 쌍의 토출유닛(2,3)으로 분산될 수 있고, 한 쌍의 토출유닛(2,3)으로 분산된 공기는 한 쌍의 토출유닛 (2,3)을 통해 실내로 분산 토출될 수 있다. 디스플레이 어셈블리(10A)은 한 쌍의 토출유닛(2,3) 사이에서 그 사이의 틈을 차폐하는 상태에서, 공기조화기의 운전 정보를 표시할 수 있다. 디스플레이 어셈블리(10A)는 공기조화기의 전방에서 한 쌍의 토출유닛(2,3) 사이로 사용자의 손이나 기구가 유 입되는 것을 막을 수 있고, 한 쌍의 토출유닛(2,3) 사이로 사용자의 손이나 기구가 유입될 때 발생되는 안전사 고는 사전에 예방될 수 있다. 또한, 본 발명의 일 실시예에 따른 공기조화기는 사용자의 음성 명령을 수신하여 처리할 수 있다. 이를 위해, 본 발명의 일 실시예에 따른 공기조화기는 사용자의 음성 입력을 수신하는 마이크, 사용자의 음성 입 력을 처리하는 음성 인식 모듈 등을 포함할 수 있다. 예를 들어, 음성 인식 모듈은 베이스 어셈블리에 형성되는 수용 공간에 장착될 수 있다. 도 9는 본 발명의 일 실시예에 따른 공기조화기의 내부 블록도의 일예를 도시한 도면이다. 도 9를 참조하면, 본 발명의 일 실시예에 따른 공기조화기는, 각종 데이터를 센싱하는 하나 이상의 센서를 포함하는 센서부, 사용자의 음성 명령을 수신하는 오디오 입력부, 각종 데이터를 저장하는 메모리 , 다른 전자기기와 무선 통신하는 통신부, 소정 정보를 영상으로 표시하는 디스플레이, 소정 정 보를 오디오로 출력하는 오디오 출력부, 및, 전반적인 동작을 제어하는 제어부, 및, 상기 제어부 의 제어에 따라 본체 내부에 구비되는 실내팬, 열교환기, 밸브, 풍향 조절 수단 등의 동작을 제어하는 구 동부를 포함할 수 있다.본 발명의 일 실시예에 따른 공기조화기는, 마이크 홀을 통하여 음성 신호를 수신하는 복수의 마이크 (221, 222), 상기 복수의 마이크(221, 222)를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서 버 시스템으로 전송하고, 상기 음성 인식 서버 시스템으로부터 상기 음성 신호에 기초한 제어 신호를 수신하는 통신부 및, 상기 복수의 마이크(221, 222)를 통하여 수신된 음성 신호에 기초하여 상기 사용자의 위치 정 보를 판별하고, 상기 제어 신호에 대응하는 동작을 수행하도록 제어하는 제어부를 포함할 수 있다. 본 발명에 따르면, 음성 인식 기능을 제공하는 공기조화기을 제어할 때 사용자의 방향 정보를 추가적으로 이 용하여 보다 능동적이고 효과적인 제어할 수 있다. 공기조화기가 구비하는 2이상의 마이크(221, 222)로 사용자가 음성 명령을 내렸을 때, 사용자의 명령 종류 에 따라 사용자의 발화 방향 정보를 추가적으로 활용하여 기류를 제어할 수 있다. 상기 제어부는, 상기 제어 신호가 온도 또는 바람을 제어하는 신호인 경우에, 상기 판별된 위치 정보에 기 초하여 기류를 제어할 수 있다. 상기 제어부는, 상기 판별된 위치 정보에 기초하여 바람의 방향과 세기 중 적어도 하나를 제어할 수 있다. 상기 제어부는, 상기 한쌍의 토출유닛(2, 3) 중 바람을 토출하는 토출유닛을 상기 판별된 위치 정보에 기 초하여 선택할 수 있다. 이 경우에, 상기 제어부는, 상기 판별된 위치 정보에 기초하여 상기 한쌍의 토출유닛의 토출구(43, 53)를 개폐하도록 제어할 수 있다. 또한, 상기 제어부는, 상기 판별된 위치 정보에 대응하는 영역에서 토출되는 바람의 세기를 다른 나머지 영역에서 토출되는 바람의 세기와 상이하도록 제할 수 있다. 또한, 상기 제어부는, 상기 판별된 위치 정보에 대응하는 영역에만 바람을 토출하거나 상기 판별된 위치 정보에 대응하는 영역에만 바람이 토출되지 않도록 제어할 수 있다. 기류 제어에 대해서는 도 13 내지 도 20을 참조하여 상세히 후술한다. 오디오 입력부는, 외부의 오디오 신호, 사용자 음성 명령을 입력받을 수 있다. 이를 위해, 오디오 입력부 는, 하나 이상의 마이크(MIC)를 구비할 수 있다. 또한, 사용자의 음성 명령을 더 정확히 수신하기 위하여 오디오 입력부는 복수의 마이크(221, 222)를 구비할 수 있다. 복수의 마이크(221, 222)는, 서로 다른 위치 에 이격되어 배치될 수 있고, 외부의 오디오 신호를 획득하여 전기적인 신호로 처리할 수 있다. 도 9 등에서는 오디오 입력부가 제1 마이크와 제2 마이크의 2개의 마이크를 구비하는 예를 도시 하였으나, 본 발명은 이에 한정되지 않는다. 오디오 입력부는 아날로그 소리를 디지털 데이터로 변환하는 처리부를 포함하거나 처리부에 연결되어 사용 자 입력 음성 명령을 제어부 또는 소정 서버에서 인식할 수 있도록 데이터화할 수 있다. 한편, 오디오 입력부는 사용자의 음성 명령을 입력받는 과정에서 발생하는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알고리즘이 사용될 수 있다. 또한, 오디오 입력부는 각 마이크(221, 222)에서 수신되는 오디오 신호에서 노이즈를 제거하는 필터, 필터 에서 출력되는 신호를 증폭하여 출력하는 증폭기 등 오디오 신호 처리를 위한 구성들을 포함할 수 있다. 메모리는 공기조화기의 동작에 필요한 각종 정보들을 기록하는 것으로, 휘발성 또는 비휘발성 기록 매 체를 포함할 수 있다. 기록 매체는 마이크로 프로세서(micro processor)에 의해 읽힐 수 있는 데이터를 저장한 것으로, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등을 포함할 수 있다. 실시예에 따라서는, 메모리에는 사용자가 입력한 음성 명령의 음원 파일이 저장될 수 있고, 저장된 음원 파일은 통신부을 통하여 음성 인식 서버 시스템으로 전송될 수 있다. 또한, 상기 저장된 음원 파일은 기설 정된 시간 경과 또는 기설정된 동작 수행 후에 삭제될 수 있다. 한편, 메모리에는 음성 인식을 위한 데이터가 저장될 수 있고, 제어부는 오디오 입력부를 통하 여 수신되는 사용자의 음성 입력 신호를 처리하고 음성 인식 과정을 수행할 수 있다. 또는, 실시예에 따라서는, 공기조화기는 음성 인식 모듈(미도시)을 포함하고, 음성 인식 모듈이 호출어 인식 등 간단한 음성 인식을 수행할 수 있다. 음성 인식 모듈을 포함하는 실시예에 대해서는 도 10을 참조하여 상세 히 후술한다. 또한, 음성 신호의 호출어 포함 여부를 판별하기 위한 호출어 판단 알고리즘이 메모리에 저장될 수 있다. 상기 제어부 및 음성 인식 모듈은 상기 호출어 판단 알고리즘에 기초하여 상기 음성 신호의 상기 호출어 포함 여부를 판별할 수 있다. 한편, 간단한 음성 인식은 공기조화기가 수행하고, 자연어 처리 등 고차원의 음성 인식은 음성 인식 서버 시 스템에서 수행될 수 있다. 예를 들어, 기설정된 호출어를 포함하는 웨이크 업(wake up) 음성 신호가 수신되는 경우에, 공기조화기는 음 성 명령어를 수신하기 위한 상태로 전환될 수 있다. 이 경우에, 공기조화기는 호출어 음성 입력 여부까지의 음성 인식 과정만 수행하고, 이후의 사용자 음성 입력에 대한 음성 인식은 음성 인식 서버 시스템을 통하여 수 행할 수 있다. 공기조화기의 시스템 자원에는 한계가 있으므로, 복잡한 자연어 인식 및 처리는 음성 인식 서버 시스템을 통 하여 수행될 수 있다. 또는, 호출어 음성 입력 여부의 판단은 공기조화기와 음성 인식 서버 시스템에서 이중으로 수행될 수 있다. 이에 따라, 호출어 음성 입력 판단의 오인식을 줄이고, 인식률을 높일 수 있다. 메모리에는 제한적인 데이터가 저장될 수 있다. 예를 들어, 메모리에는 기설정된 호출어를 포함하는 웨이크 업(wake up) 음성 신호를 인식하기 위한 데이터가 저장될 수 있다. 이 경우에, 제어부는 오디오 입 력부를 통하여 수신되는 사용자의 음성 입력 신호로부터 기설정된 호출어를 포함하는 웨이크 업(wake up) 음성 신호를 인식할 수 있다. 한편, 호출어는 제조사에 의해 설정될 수 있다. 예를 들어, \"LG 휘센\"이 호출어로 설정될 수 있다. 또한, 호출 어는 사용자에 의해 설정 변경이 가능하다. 제어부는, 웨이크 업(wake up) 음성 신호의 인식 이후에 입력되는 사용자의 음성 명령을, 통신부를 통하여, 음성 인식 서버 시스템에 송신하도록 제어할 수 있다. 통신부는, 하나 이상의 통신 모듈을 구비하여, 다른 전자기기와, 소정 통신 방식에 따라 무선 통신을 수행 하여, 각종 신호를 주고 받을 수 있다. 여기서, 소정 통신 방식은, 와이파이(Wi-Fi) 통신 방식일 수 있다. 이에 대응하여, 공기조화기가 구비하는 통신 모듈은 와이파이 통신 모듈일 수 있으나, 본 발명은 통신 방식에 한정되지 않는다. 또는, 공기조화기는 다른 종류의 통신 모듈을 구비하거나 복수의 통신 모듈을 구비할 수 있다. 예를 들어, 공기조화기는 NFC 모듈, 지그비(zigbee) 통신 모듈, 블루투스(Bluetooth™) 통신 모듈 등을 포함할 수 있다. 공기조화기는 와이파이(wi-fi) 통신 모듈 등을 통해 음성 인식 서버 시스템에 포함되는 서버 또는 외부의 소 정 서버, 사용자의 휴대 단말기 등과 연결 가능하고, 원격 모니터링, 원격 제어 등 스마트 기능을 지원할 수 있 다. 사용자는 휴대 단말기를 통하여 공기조화기에 관한 정보를 확인하거나 공기조화기를 제어할 수 있다. 또한, 통신부는 액세스 포인트(access point: AP) 장치와 통신하고, 액세스 포인트 장치를 통하여 무선 인 터넷 네트워크에 접속하여 다른 기기들과 통신할 수 있다. 또한, 제어부는 통신부를 통해 공기조화기의 상태 정보, 사용자의 음성 명령 등을 음성 인식 서버 시스템 등으로 전송할 수 있다. 한편, 통신부를 통하여 제어 신호가 수신되면, 제어부는 수신되는 제어 신호에 따라 동작하도록 공기 조화기를 제어할 수 있다. 디스플레이는 사용자의 명령 입력에 대응하는 정보, 사용자의 명령 입력에 대응하는 처리 결과, 동작모드, 동작상태, 에러상태 등을 영상으로 표시할 수 있다. 실시예에 따라서는, 디스플레이는, 터치패드와 상호 레이어 구조를 이루어 터치스크린으로 구성될 수 있다. 이 경우에, 디스플레이는 출력 장치 이외에 사용자의 터치에 의한 정보의 입력이 가능한 입력 장치로도 사용될 수 있다. 또한, 오디오 출력부는, 제어부의 제어에 따라 경고음, 동작모드, 동작상태, 에러상태 등의 알림 메 시지, 사용자의 명령 입력에 대응하는 정보, 사용자의 명령 입력에 대응하는 처리 결과 등을 오디오로 출력할 수 있다. 한편, 오디오 출력부는, 제어부로부터의 전기 신호를 오디오 신호로 변환하여 출력할 수 있다. 이를 위해, 스피커 등을 구비할 수 있다. 제어부는 음성 인식 과정 및 공기조화기 제어 과정의 각 단계에 대응하여 소정 정보를 시각적/청각적 수단으로 사용자에게 제공하도록 오디오 출력부 및 디스플레이를 제어할 수 있다. 구동부는 실내팬에 연결된 모터의 회전을 제어함으로써, 실내로 토출되는 공기의 양을 제어한다. 또한, 구 동부는 열교환기가 공급되는 냉매를 증발 또는 응축시켜 주변의 공기를 열 교환하도록 그 구동을 제어한다. 구동부는 제어부의 제어명령에 대응하여, 실내로 토출되는 공기의 방향을 조절하는 장치로, 토출구 개방 시 토출되는 공기가 상하좌우로 변경되도록 한다. 상기 구동부는, 상기 제어부의 제어에 따라 베인을 구동하는 베인 구동부, 팬을 구동하는 팬 구동부 등을 포함할 수 있다. 한편, 구동부는, 모터 구동부를 포함할 수 있고, 모터를 구동하기 위해, 인버터 등을 포함할 수 있다. 한편, 공기조화기는 사용자 입력을 위한 조작부, 공기조화기 주변 소정 범위를 촬영할 수 있는 카메 라를 더 포함할 수 있다. 조작부는, 복수의 조작 버튼을 구비하여, 입력되는 버튼에 대응하는 신호를 제어부로 전달할 수 있다. 카메라는 공기조화기 주변, 외부 환경 등을 촬영하는 것으로, 이러한 카메라는 촬영 효율을 위해 각 부 위별로 여러 개가 설치될 수도 있다. 예를 들어, 카메라는 적어도 하나의 광학렌즈와, 광학렌즈를 통과한 광에 의해 상이 맺히는 다수개의 광 다이오드(photodiode, 예를 들어, pixel)를 포함하여 구성된 이미지 센서(예를 들어, CMOS image sensor)와, 광 다이오드들로부터 출력된 신호를 바탕으로 영상을 구성하는 디지털 신호 처리기(DSP: Digital Signal Processor)를 포함할 수 있다. 디지털 신호 처리기는 정지영상은 물론이고, 정지영상으로 구성된 프레임들로 이 루어진 동영상을 생성하는 것도 가능하다. 한편, 카메라가 촬영하여 획득된 영상은 메모리에 저장될 수 있다. 본 발명의 일 실시예에 따른 공기조화기는, 하나 이상의 센서를 구비하는 센서부를 포함할 수 있다. 예를 들어, 센서부는, 실내외의 온도를 센싱하는 하나 이상의 온도 센서와 습도를 센싱하는 습도 센서, 공 기질을 센싱하는 먼지 센서 등을 구비할 수 있다. 또한, 제어부는, 센서부에서 감지되는 데이터에 기초하여, 공기조화기의 동작을 제어할 수 있다. 도 10은 본 발명의 일 실시예에 따른 공기조화기의 내부 블록도의 다른 예를 도시한 도면이다. 도 10을 참조하면, 공기조화기는, 카메라, 각종 데이터를 센싱하는 센서부, 사용자의 음성 명령을 수신하는 오디오 입력부, 조작부, 각종 데이터를 저장하는 메모리, 다른 전자기기와 무선 통신 하는 통신부, 공기조화기에 구현된 동작을 수행하는 구동부, 소정 정보를 영상으로 표시하는 디스 플레이, 소정 정보를 오디오로 출력하는 오디오 출력부, 및, 전반적인 동작을 제어하는 제어부, 프로세서를 포함할 수 있다. 도 10의 공기조화기의 내부 블록도는, 도 9와 유사하나, 프로세서가 더 구비되며, 오디오 입력부, 오디오 출력부, 통신부, 카메라, 및 프로세서가 하나의 단일 모듈인 음성 인식 모듈 내에 구비되는 것에 그 차이가 있다. 또한, 상기 음성 인식 모듈은, 도 9를 참조하여 설명한 음성 인식 모듈일 수 있다. 실시예에 따라서는, 상기 음성 인식 모듈은, 통신부와 프로세서를 포함할 수 있고, 상기 오디오 입력부와 상기 오디오 출력부는 별도의 일체형 모듈로 구성될 수 있다. 예를 들어, 상기 음성 인식 모듈은, 상기 오디오 입력부와 상기 오디오 출력부를 포함하는 일체 형 모듈일 수 있다. 이 경우에, 상기 오디오 입력부는 마이크를 포함할 수 있고, 상기 오디오 출력부(29 1)는 스피커를 포함할 수 있다. 한편, 프로세서는, 오디오 입력부, 오디오 출력부, 통신부, 카메라 등을 제어할 수 있다. 이하에서는, 도 9와의 차이를 중심으로 기술한다. 프로세서는 오디오 입력부를 통하여 수신되는 사용자의 음성 입력 신호를 처리하고 음성 인식 과정을 수행할 수 있다. 예를 들어, 기설정된 호출어를 포함하는 웨이크 업(wake up) 음성 신호가 수신되는 경우에, 프로세서는 음 성 명령어를 수신하기 위한 상태로 전환될 수 있다. 이 경우에, 프로세서는 호출어 음성 입력 여부까지의 음성 인식 과정만 수행하고, 이후의 사용자 음성 입력에 대한 음성 인식은 음성 인식 서버 시스템을 통하여 수 행할 수 있다. 프로세서는, 웨이크 업(wake up) 음성 신호의 인식 이후에 입력되는 사용자의 음성 명령을, 통신부를 통하여, 음성 인식 서버 시스템에 송신하도록 제어할 수 있다. 또한, 프로세서는 통신부를 통해 공기조화기의 상태 정보, 사용자의 음성 명령 등을 음성 인식 서 버 시스템 등으로 전송할 수 있다. 한편, 통신부를 통하여 제어 신호가 수신되면, 프로세서는 제어 신호를 제어부로 전송하고, 제 어부는 수신되는 제어 신호에 따라 동작하도록 공기조화기를 제어할 수 있다. 결국, 음성 인식 모듈을 통해, 음성 데이터 획득, 음성 인식 서버 시스템과의 통신, 및 대응하는 사운드 출력을 수행할 수 있게 된다. 한편, 음성 인식 모듈은, 공기조화기 외에, 다양한 전자 기기에 부착될 수 있다. 또는 다른 전자 기기 에 부착되는 것 없이, 별도의 장치로서, 사용될 수도 있다. 본 발명의 일 실시예에 따른 공기조화기는 사용자의 음성 입력을 수신할 수 있고, 음성 인식 서버 시스템은 사용자의 음성 입력을 인식, 분석하여 공기조화기를 제어할 수 있다. 이에 따라, 사용자는 휴대 단말기, 원격제어장치를 조작하지 않고서도 공기조화기를 제어할 수 있다. 한편, 상기 음성 인식 서버 시스템에 포함되는 서버들 중 적어도 일부는 홈 어플라이언스의 제조 회사, 판매 회 사가 운영하는 서버이거나 제조 회사 또는 판매 회사가 서비스를 위탁한 회사가 운영하는 서버일 수 있다. 도 11은 본 발명의 일 실시예에 따른 음성 인식 서버 시스템의 일예이다. 도 11을 참조하면, 본 발명의 일 실시예에 따른 음성 인식 서버 시스템은, 공기조화기로부터 음성 데이터를 수신하고, 수신한 음성 데이터를 분석하여 음성 명령을 판별하는 음성 서버를 포함할 수 있다. 음성 서버는, 공기조화기로부터 음성 데이터를 수신하고, 상기 수신한 음성 데이터를 텍스트(text) 데 이터로 변환하며, 텍스트 데이터를 분석하여 음성 명령을 판별할 수 있다. 또한, 음성 서버는, 판별한 음성 명령에 대응하는 신호를 소정 서버로 송신할 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 음성 인식 서버 시스템은 상기 음성 서버로부터 상기 판별한 음 성 명령에 대응하는 신호를 수신하고, 상기 판별한 음성 명령에 대응하는 요청 신호를 생성하는 연계 서비스 서 버와 상기 연계 서비스 서버로부터 수신되는 요청 신호에 기초하는 제어 신호를 상기 공기조화기 로 송신하는 가전 제어 서버를 포함할 수 있다. 상기 공기조화기는 사용자가 발화한 음성 명령 입력을 수신하여 수신한 음성 명령 입력에 기초한 음성 데이 터를 상기 음성 서버로 송신할 수 있다. 상기 음성 서버는, 공기조화기로부터 음성 데이터를 수신하고, 수신한 음성 데이터를 텍스트(text) 데 이터로 변환하는 자동 음성 인식(Automatic Speech Recognition: ASR) 서버, 상기 자동 음성 인식 서버 로부터 상기 텍스트 데이터를 수신하고, 수신한 텍스트 데이터를 분석하여 음성 명령을 판별하며, 상기 판별한 음성 명령에 기초하는 응답 신호를 상기 공기조화기로 송신하는 자연어 처리(Natural Language Processing: NLP) 서버, 및, 상기 공기조화기로부터 상기 응답 신호에 대응하는 텍스트를 포함하는 신 호를 수신하고, 수신한 신호에 포함되는 텍스트를 음성 데이터로 변환하여 상기 공기조화기로 송신하는 텍스 트 음성 변환(Text to Speech: TTS) 서버를 포함할 수 있다. 상기 자동 음성 인식 서버는 공기조화기로부터 수신한 음성 데이터에 대하여 음성 인식을 수행하여 텍 스트 데이터를 생성하여 상기 자연어 처리 서버로 송신할 수 있다. 상기 자연어 처리 서버는 상기 자동 음성 인식 서버로부터 수신한 텍스트 데이터를 자연어 처리 알 고리즘에 따라 분석하여 음성 명령을 판별할 수 있다. 상기 자연어 처리 서버는 자연어 처리 알고리즘에 따라 사람이 일상적으로 사용하고 있는 언어인 자연어 를 처리할 수 있고, 사용자의 의도(intent)를 분석할 수 있다. 상기 자연어 처리 서버는 상기 자동 음성 인식 서버로부터 수신한 텍스트 데이터에 대하여 자연어 처리를 수행하여 사용자의 의도에 부합하는 음성 명령을 판별할 수 있다. 이에 따라, 상기 자연어 처리 서버는 사용자가 일상적인 사용 언어로 음성 명령을 입력하더라도 사용자의 의도에 부합하는 음성 명령을 판별할 수 있다. 상기 자연어 처리 서버는 자연어 처리 결과에 대응하는 신호, 즉, 판별한 음성 명령에 대응하는 신호를 상기 연계 서비스 서버로 송신할 수 있다. 상기 연계 서비스 서버는, 상기 자연어 처리 서버로부터 상기 판별한 음성 명령에 대응하는 신호를 수신할 수 있다. 상기 연계 서비스 서버는 판별한 음성 명령이 공기조화기에 관한 것이면, 상기 가전 제어 서버 와 통신하여 대응하는 동작을 수행할 수 있다. 또는, 상기 연계 서비스 서버는 판별한 음성 명령이 공기조화기에 관한 것이 아니면, 외부의 외부 서 비스와 통신하여 대응하는 동작을 수행할 수 있다. 예를 들어, 상기 연계 서비스 서버는 판별한 음성 명령이 날씨, 주식, 뉴스 등의 정보를 요청하는 명령이 면, 요청된 정보에 대응하는 서비스를 제공하는 서버로 해당 정보를 요청하고 수신할 수 있다. 또한, 상기 연계 서비스 서버는 수신한 정보를 음성 서버로 송신할 수 있고, 상기 자연어 처리 서 버는 수신한 정보를 공기조화기로 전달할 수 있다. 상기 연계 서비스 서버는 판별한 음성 명령이 공기조화기에 관한 것이면, 상기 판별한 음성 명령에 대 응하는 요청 신호를 생성하여 상기 가전 제어 서버로 송신할 수 있다. 상기 가전 제어 서버는, 상기 연계 서비스 서버로부터 수신되는 요청 신호에 기초하는 제어 신호를 상기 공기조화기로 송신할 수 있다. 예를 들어, 공기조화기의 설정 온도를 변경하는 요청이 수신되면, 상기 가전 제어 서버는 상기 공기조 화기로 설정 온도를 변경하는 제어 신호를 송신할 수 있다. 한편, 공기조화기는 상기 가전 제어 서버로부터 수신한 제어 신호에 따라 대응하는 동작을 수행할 수 있다. 또한, 공기조화기는 요청받은 동작을 수행한 후 동작을 수행하였음을 알리는 신호를 상기 가전 제어 서버 로 송신할 수 있다. 또한, 상기 가전 제어 서버는, 상기 공기조화기로부터 상기 제어 신호에 대한 응답 신호를 수신하고, 상기 응답 신호에 대응하는 처리 결과 정보를 상기 연계 서비스 서버로 송신할 수 있다. 상기 음성 서버는, 상기 처리 결과 정보를 포함하는 응답 신호를 상기 공기조화기로 송신할 수 있다. 또한, 상기 음성 서버는, 상기 공기조화기로부터 상기 처리 결과 정보에 대응하는 출력 문구 텍스트를 포함하는 신호를 수신하고, 상기 수신한 출력 문구 텍스트를 음성 데이터로 변환하여 상기 공기조화기로 전 송할 수 있다. 이 경우에, 상기 자연어 처리 서버가 상기 공기조화기로 송신하는 상기 판별한 음성 명령에 기초하는 응답 신호는, 상기 처리 결과 정보를 포함할 수 있다. 한편, 공기조화기는 상기 자연어 처리 서버로부터 상기 판별한 음성 명령에 기초하는 응답 신호를 수 신할 수 있다. 여기서, 응답 신호를 상기 판별한 음성 명령에 대응하는 응답의 텍스트 데이터를 포함할 수 있다. 예를 들어, 사용자가 공기조화기의 설정 온도를 변경하는 음성 명령을 입력한 경우에, 상기 응답 신호는 설정 온도를 변경하였음을 나타내는 텍스트 데이터를 포함할 수 있다. 한편, 공기조화기는 수신한 응답 신호에 대응하는 텍스트를 포함하는 신호를 상기 텍스트 음성 변환 서버 로 송신할 수 있다. 여기서, 상기 응답 신호에 대응하는 텍스트를 포함하는 신호는 상기 처리 결과 정보 에 대응하는 출력 문구 텍스트를 포함할 수 있다. 한편, 상기 텍스트 음성 변환 서버는 수신한 신호에 포함되는 텍스트를 음성 데이터로 변환하여 상기 공 기조화기로 송신할 수 있다. 여기서 변환된 음성 데이터는 음원 파일을 포함할 수 있다. 상기 공기조화기는 스피커를 통하여 수신한 음성 데이터에 기초한 음성 안내 메시지를 출력할 수 있다. 한편, 상기 연계 서비스 서버는, 상기 판별한 음성 명령에 대응하는 신호에 기초하여 상기 공기조화기 의 상태 정보를 상기 가전 제어 서버로 요청하고, 상기 가전 제어 서버는, 상기 공기조화기 의 상태 정보를 상기 연계 서비스 서버로 송신할 수 있다. 상기 가전 제어 서버는, 상기 공기조화 기의 상태 정보가 확보되어 있는 상태가 아닌 경우에는, 상기 공기조화기로 상태 정보를 요청하여 수신할 수 있다. 한편, 상기 연계 서비스 서버는, 상기 공기조화기의 상태 정보에 기초하여 상기 판별한 음성 명령의 지원이 가능한 경우에, 상기 가전 제어 서버로 상기 판별한 음성 명령에 대응하는 요청 신호를 송신할 수 있다. 또는, 상기 연계 서비스 서버는, 상기 공기조화기의 상태 정보에 기초하여 상기 판별한 음성 명령의 지원이 불가능한 경우에, 상기 자연어 처리 서버로 현재 상태에서 지원되지 않는 기능임을 알리는 신호를 송신할 수 있다. 이 경우에도, 공기조화기는 상기 텍스트 음성 변환 서버로 음성 데이터를 요청, 수신하여, 현재 상태 에서 지원되지 않는 기능임을 알리는 음성 안내 메시지를 출력할 수 있다. 실시예에 따라서는, 상기 음성 서버가, 상기 판별한 음성 명령의 지원 가능 유무를 판별할 수 있다. 예를 들어, 사용자의 음성 명령의 의도를 분석한 상기 자연어 처리 서버가, 상기 판별한 음성 명령의 지원 가 능 유무를 판별할 수 있다. 이 경우에, 상기 판별한 음성 명령이 지원 불가능한 명령을 포함하고 있는 경우, 상기 자연어 처리 서버 가 송신하는 상기 판별한 음성 명령에 기초하는 응답 신호는 상기 판별한 음성 명령이 상기 공기조화기가 지 원하지 않는 기능임을 알리는 신호일 수 있다. 본 발명의 일 실시예에 따른 음성 서버 및 이를 포함하는 음성 인식 서버 시스템은, 자연어 음성처리를 위해 여러 역할을 하는 서버를 유기적으로 연결하여 이용할 수 있다. 공기조화기는 음성 명령의 수신 및 전처리, 서버 전송까지의 동작을 수행하고, 음성 서버는, 음성/텍 스트 변환, 의도분석, 명령 식별 등 자연어 처리 과정을 수행할 수 있다. 음성 서버가 자연어 처리를 수행함으로써, 홈 어플라이언스 내부 임베디드 모듈의 CPU, 메모리 등의 부담 을 감소시킬 수 있다. 한편, 연계 서비스 서버는 외부 서비스 및 가전 제어 서버와 통신하여 사용자의 음성 명령에 기초 한 동작을 수행할 수 있다.한편, 공기조화기는 음성 서버로부터 음원 파일을 포함하는 음성 데이터를 수신하여, 음성 안내 메시 지를 오디오로 출력함으로써, 청각적 피드백으로 사용자의 음성 입력에 화답할 수 있다. 공기조화기는 음성 서버로부터 음성 파일을 스트리밍으로 전달 받아 사용자에게 음성 안내 메시지를 재생, 출력할 수 있다. 이에 따라 공기조화기는 다양한 음원 파일을 저장하고 있을 필요가 없다. 한편, 연계 서비스 서버를 통하여 다른 서버와 충돌하지 않으면서도 다양한 외부 서비스들과의 연계가 가 능하다. 또한, 외부 서비스 연동 서버를 통해 의도분석 시 외부 정보를 반영하여 의도분석 성공률을 높일 수 있 다. 본 발명의 일 실시예에 따른 음성 인식 서버 시스템은, 복수의 서버를 통해, 호환성 및 연결성을 확보하고, 최 종 제어 명령은 가전 제어 서버를 활용함으로써, 음성 인식 과정과 가전 제어 서버를 통해 와이파 이 통신을 이용한 가전 제어 사이의 충돌 및 휴대 단말기를 통한 가전 제어와 공기조화기를 통한 음성 입력 에 의한 가전 제어 간 충돌을 막을 수 있다. 본 발명의 일 실시예에 따른 음성 인식 서버 시스템은, 서버 간 유기적인 연결을 통해 어느 한 서버에 의존하여 특정 서버에 부하가 몰리는 것을 줄일 수 있고, 각각의 서버 별 역할이 달라, 특정 서버에서 문제가 생길 경우 동일한 역할을 하는 타 서버와의 연계를 통해 쉽게 대응이 가능하다. 또한, 복수의 서버들을 독립적으로 수시로 업데이트할 수 있어, 성능 개선에 유리하다. 도 12는 본 발명의 일 실시예에 따른 음성 인식 서버 시스템의 일예이다. 도 12에서 예시된 음성 인식 서버 시스템은, 도 11에서 예시된 음성 인식 서버 시스템이 음성 안내 메시지 출력 을 위한 음성 데이터가 공기조화기로 전송되는 과정을 개선하여 음성 제어 응답 시간을 향상한 것이다. 따라서, 도 11과 도 12에서 예시된 음성 인식 서버 시스템은 상기 차이점 이외의 동작은 실질적으로 동일하게 수행할 수 있고, 이하에서는 동일한 부분에 대해서는 간략히 기술한다. 도 12를 참조하면, 본 발명의 일 실시예에 따른 음성 인식 서버 시스템은, 공기조화기로부터 음성 데이터를 수신하고, 수신한 음성 데이터를 분석하여 음성 명령을 판별하는 음성 서버를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 음성 인식 서버 시스템은, 상기 음성 서버로부터 상기 판별한 음성 명 령에 대응하는 신호를 수신하고, 상기 판별한 음성 명령에 대응하는 요청 신호를 생성하는 연계 서비스 서버 와 상기 연계 서비스 서버로부터 수신되는 요청 신호에 기초하는 제어 신호를 상기 공기조화기 로 송신하는 가전 제어 서버를 더 포함할 수 있다. 도 12에서 예시된 음성 인식 서버 시스템은, 공기조화기의 요청 없이도, 상기 음성 서버가 상기 음성 명령에 기초하는 처리 결과 정보를 포함하는 음성 데이터를 상기 공기조화기로 송신할 수 있다. 상기 음성 서버는, 공기조화기로부터 음성 데이터를 수신하고, 수신한 음성 데이터를 텍스트(text) 데 이터로 변환하는 자동 음성 인식 서버, 상기 자동 음성 인식 서버로부터 상기 텍스트 데이터를 수 신하고, 수신한 텍스트 데이터를 분석하여 음성 명령을 판별하는 자연어 처리 서버, 및, 상기 음성 명령 에 기초하는 응답 신호를 음성 데이터로 변환하여 상기 공기조화기로 송신하는 텍스트 음성 변환 서버(111 3)를 포함할 수 있다. 본 실시예에서도, 상기 가전 제어 서버는, 상기 공기조화기로부터 상기 제어 신호에 대한 응답 신호를 수신하고, 상기 응답 신호에 대응하는 처리 결과 정보를 상기 연계 서비스 서버로 송신할 수 있다. 상기 연계 서비스 서버는 음성 서버, 더욱 상세하게는 자연어 처리 서버로 상기 처리 결과 정보를 전달할 수 있다. 이 경우에, 상기 텍스트 음성 변환 서버가 상기 공기조화기로 송신하는 음성 데이터는, 상기 처리 결 과 정보를 포함할 수 있다. 또한, 상기 연계 서비스 서버는, 상기 판별한 음성 명령에 대응하는 신호에 기초하여 상기 공기조화기 의 상태 정보를 상기 가전 제어 서버로 요청하고, 상기 가전 제어 서버는, 상기 공기조화기의 상태 정보 를 상기 연계 서비스 서버로 송신할 수 있다. 또한, 상기 연계 서비스 서버는, 상기 공기조화기의 상태 정보에 기초하여 상기 판별한 음성 명령의 지원이 가능한 경우에, 상기 가전 제어 서버로 상기 판별한 음성 명령에 대응하는 요청 신호를 송신할 수 있다. 또는, 상기 연계 서비스 서버는, 상기 공기조화기의 상태 정보에 기초하여 상기 판별한 음성 명령의 지원이 불가능한 경우에, 상기 음성 서버로 현재 상태에서 지원되지 않는 기능임을 알리는 신호를 송신할 수 있다. 예를 들어, 상기 연계 서비스 서버는 상기 자연어 처리 서버로 현재 상태에서 지원되지 않는 기능 임을 알리는 신호를 송신할 수 있다. 또한, 상기 자연어 처리 서버는 상기 텍스트 음성 변환 서버로 현재 상태에서 지원되지 않는 기능 임을 알리는 신호를 전달하고, 상기 텍스트 음성 변환 서버는 대응하는 음성 데이터를 생성하여 공기조화 기로 송신할 수 있다. 공기조화기는 상기 텍스트 음성 변환 서버로부터 음성 데이터를 수신하여, 현재 상태에서 지원되지 않 는 기능임을 알리는 음성 안내 메시지를 출력할 수 있다. 실시예에 따라서는, 상기 음성 서버가, 상기 판별한 음성 명령의 지원 가능 유무를 판별할 수 있다. 예를 들어, 사용자의 음성 명령의 의도를 분석한 상기 자연어 처리 서버가, 상기 판별한 음성 명령의 지원 가 능 유무를 판별할 수 있다. 이 경우에, 상기 판별한 음성 명령이 지원 불가능한 명령을 포함하고 있는 경우, 상기 자연어 처리 서버 가 송신하는 상기 판별한 음성 명령에 기초하는 응답 신호는 상기 판별한 음성 명령이 상기 공기조화기가 지 원하지 않는 기능임을 알리는 신호일 수 있다. 공기조화기가 동작한 후 제일 마지막으로 음성 안내를 위한 텍스트 음성 변환 서버에 해당 동작에 대 한 안내 멘트를 요청할 경우 동작과 안내 멘트 사이에 시간 차가 발생할 수 있다. 하지만, 본 발명의 일 실시예에 따르면, 의도분석이 완료되어 동작 요청이 자연어 처리 서버에서 송신될 때, 이와 동시에 텍스트 음성 변환 서버로 정보를 제공해줄 수 있다. 또한, 가전 제어 서버에서 공기조화기에 제어 명령을 내리는 시점에 준하여 텍스트 음성 변환 서버 에서 공기조화기로 안내멘트를 제공할 수 있다. 이에 따라, 공기조화기 동작과 동시 또는 바로 후 안내멘트가 발화될 수 있다. 본 실시예에 따르면, 자연어 처리 서버와 텍스트 음성 변환 서버를 바로 연결함으로써, 가전 제어 서버를 통한 제어명령과 안내멘트 사이의 시간 차를 최소화할 수 있다. 한편, 본 발명의 일 측에 따르면, 도 11과 도 12와 달리, 음성 인식 및 처리를 위한 자동 음성 인식 서버 , 자연어 처리 서버, 텍스트 음성 변환 서버는 하나의 통합 서버로 구성될 수 있다. 또한, 실시예에 따라서는, 연계 서비스 서버와 가전 제어 서버는 하나의 통합 서버로 구성될 수 있 다. 본 발명에 따르면, 음성 입력에 따라 공기조화기가 동작함으로써, 사용자가 리모콘 등 원격제어장치, 휴대 단말기 등을 조작할 필요가 없어, 사용자 편의성을 증대시킬 수 있다. 또한, 도 11과 도 12를 참조하여 설명한 것과 같이, 본 발명은 복수의 서버를 이용하여, 사용자의 자연어 음성 명령을 인식하고, 대응하는 제어 동작을 수행함으로써, 홈 어플라이언스, 각 서버의 시스템 자원에 제한되지 않 고 효율적으로 자연어를 인식, 처리할 수 있다. 도 13은 본 발명의 일 실시예에 따른 공기조화기의 제어방법을 도시한 순서도이고, 도 14 내지 도 20은 본 발명 의 실시예에 따른 공기조화기의 제어방법에 관한 설명에 참조되는 도면이다. 도 13을 참조하면, 공기조화기는, 복수의 마이크(221, 222)를 통하여 사용자의 음성 신호를 수신할 수 있다 (S1310). 공기조화기의 통신부는, 음성 인식을 위해, 상기 복수의 마이크(221, 222)를 통하여 수신된 음성 신호 에 대응하는 음성 데이터를 음성 인식 서버 시스템으로 전송할 수 있다(S1320). 제어부는, 상기 복수의 마이크(221, 222)를 통하여 수신된 음성 신호에 대응하는 음성 데이터를 음성 인식 서버 시스템의 음성 서버로 전송하도록 제어할 수 있다(S1320). 한편, 제어부는, 상기 복수의 마이크(221, 222)를 통하여 수신된 음성 신호에 기초하여 상기 사용자의 위 치 정보를 판별할 수 있다(S1330). 또는, 공기조화기는, 사용자의 발화 방향을 추정하는 연산부를 별도로 더 포함할 수 있다. 복수의 마이크(221, 222)는, 서로 다른 위치에 이격되어 배치될 수 있고, 외부의 오디오 신호를 획득하여 전기 적인 신호로 처리할 수 있다. 한편, 입력 장치인 마이크(221, 222)는 음향을 발생시킨 음원의 방향 추정을 위하여 최소 2개가 필요하며, 마이 크(221, 222) 사이의 간격은 물리적으로 멀리 떨어져 있을수록 방향 검출의 해상도(각도)가 높다. 도 14를 참조하면, 센터 패널 어셈블리(10B)에는 하나 이상의 마이크 홀이 형성될 수 있고, 상기 마이크 (221, 222)는 상기 센터 패널 어셈블리(10B)의 내측면에 부착되어 상기 마이크 홀에 접촉하거나 인접하게 배치될 수 있다.. 상기 마이크(221, 222)는 토출구(43, 53)에서 적절히 떨어진 전면부에 탑재되어야 한다. 또한, 마이크가 바닥과 가까이 설치될 경우 공기조화기 앞의 가구, 쇼파 등 장애물에 의해 정확한 방향 추정이 어려울 수 있다. 또한, 스탠드형 공기조화기가, 가정집에 설치될 경우, 대부분 모서리나 벽면에 설치되기 때문에 최대 180도까지 사용자의 방향을 추정할 수 있도록 마이크를 설치해야 한다. 이를 위해, 상기 마이크 홀은, 상기 센터 패널 어셈블리(10B)의 최하단으로부터 소정 거리 이격되어 형성될 수 있고, 상기 마이크 홀은, 상기 센터 패널 어셈블리(10B)의 길이 방향의 중앙 지점과 최하단 사이에 형성 될 수 있다. 예를 들어, 마이크 홀은 상기 센터 패널 어셈블리(10B)에 최하단 바닥에서부터 50~80cm 높이에 배치될 수 있다. 한편, 도 14를 참조하면, 본 명세서에서는 사용자의 발화 방향은 20도 단위로 나누어 총 9가지 방향(A1 내지 A9) 해상도를 가지도록 설정되는 경우를 예로 들어 설명한다. 한편, 오디오 입력부가 제1 마이크와 제2 마이크의 2개의 마이크를 구비하는 예를 도시하였으나, 본 발명은 이에 한정되지 않는다. 예를 들어, 오디오 입력부는 음원 방향 검출의 성능을 높 이기 위하여 2개보다 많은 마이크들을 구비할 수 있다. 탐지된 음향을 발생시키는 음원의 방향을 추정하기 위해서 2개 이상의 마이크 입력의 시간 차이(Time-Delay Of Arrival: TDOA)를 계산하고 이를 기반으로 방향을 추정할 수 있다. 한편, 본 발명은 상기 도착 지연 시간을 이용한 방법(TDOA) 외에 공지된 다른 음원 위치 추정 기술을 이용할 수 도 있다. 상기 복수의 마이크(221, 222)를 통하여 사용자의 음성 신호가 수신되면, 제어부는, 복수의 마이크(221, 222)가 음성 신호를 수신한 시간 차이에 기초하여, 사용자의 위치 정보를 판별할 수 있다. 따라서, 음성 제어를 위한 음성 입력을 이용하여, 사용자의 위치 정보를 판별할 수 있고, 사용자 위치 판별을 위한 별도의 전용 센서가 불필요하다. 한편, 도 13에서는 음성 데이터의 전송(S1320) 후에, 사용자의 위치 판별(S1330)이 수행되는 경우를 예시하였으 나, 본 발명은 이에 한정되지 않는다. 예를 들어, 사용자의 위치 판별(S1330)이 음성 데이터의 전송(S1320) 이전에 수행되거나, 음성 데이터의 전송 (S1320)과 사용자의 위치 판별(S1330)은 독립적으로 병행 수행될 수 있다. 도 11과 도 12를 참조하여 설명한 것과 같이, 음성 인식 서버 시스템은 수신된 음성 데이터를 자연어 처리 알고 리즘에 따라 인식하여, 사용자의 의도를 판별할 수 있다. 음성 인식 서버 시스템은, 음성 인식 결과 정보를 포함하는 응답 신호를 공기조화기로 전송할 수 있다. 여기 서, 응답 신호는 공기조화기가 출력할 음성 안내 메시지의 음원 파일을 포함할 수도 있다.또한, 음성 인식 결과가 공기조화기를 제어하는 명령인 경우에, 음성 인식 서버 시스템은, 음성 인식 결과에 대응하는 제어 신호를 전송할 수 있다. 통신부가 상기 음성 인식 서버 시스템으로부터 상기 음성 신호에 기초한 제어 신호를 수신하면(S1350), 제 어부는, 상기 제어 신호에 대응하는 동작을 수행하도록 제어할 수 있다(S1370). 한편, 제어부는, 상기 제어 신호가 온도, 바람 중 적어도 하나를 제어하는 신호인 경우에(S1350), 상기 판 별된 위치 정보에 기초하여 기류를 제어할 수 있다(S1370). 만약 음성 인식 결과가 온도/바람 제어관련 명령이 아닌 경우, 방향 정보를 이용하지 않은 채 명령을 수행한다 (S1370). 예를 들어, 날씨 정보, 상태 정보 등 소정 정보의 요청, 공기청정 시작과 관련된 명령어들은 방향 정 보 없이 음성 명령만 수행하게 된다. 기존의 공기조화기에서 음성 인식은 해당 명령만 단순히 실행하는 정도의 제어 기능만을 제공하였다. 하지만, 본 발명에 따른 공기조화기는, 사용자가 음성을 이용하여 명령을 내릴 때, 사용자의 방향 정보를 판 별하고, 판별된 방향 정보를 추가적으로 이용하여 보다 능동적으로 기류를 제어할 수 있다. 사용자가 명령을 발화하고, 공기조화기가 음성 인식을 통해 해당 명령을 수행할 수 있다. 사용자는 덥거나 추울 경우에 공기조화기로 온도나 바람을 조작하는 명령을 입력하게 된다. 공기조화기는 사용자의 음성 명령에 대응하여 동작하려고 할 때, 명령의 종류가 온도나 바람을 조작하는 것 이면, 단순하게 사용자의 명령만 수행하는 것이 아니라, 사용자 방향 정보를 추가적으로 이용하여 보다 능동적 으로 기류를 제어할 수 있다. 제어부는, 상기 판별된 위치 정보에 기초하여 바람의 방향과 세기 중 적어도 하나를 제어할 수 있고, 구동 부는, 제어부의 제어에 따라 바람의 방향과 세기 중 적어도 하나를 조절할 수 있다. 또한, 공기조화기가 복수의 토출유닛(2, 3)을 구비하는 경우에, 제어부는, 복수의 토출유닛(2, 3) 중 바람을 토출하는 토출유닛(2, 3)을 상기 판별된 위치 정보에 기초하여 선택할 수 있고(S1360), 제어신호에 대응 하여 복수의 토출유닛(2, 3) 중 선택된 하나 이상의 토출유닛을 구동할 수 있다(S1370). 또한, 제어부는, 상기 판별된 위치 정보에 기초하여 상기 복수의 토출유닛(2, 3)의 토출구(43, 53)를 개폐 할 수 있다. 본 발명에 따르면, 사용자의 음성 명령 발화시 사용자가 위치한 방향 정보를 활용하여 기류를 제어할 수 있다. 예를 들어, 사용자가, 덥거나 추운 상태에서 온도/바람과 관련된 제어를 위해 음성으로 명령했을 때, 공기조화 기는 사용자의 위치 정보를 이용하여 해당 방향 토출구(43, 53)를 제어할 수 있다. 한편, 제어부는, 상기 판별된 위치 정보에 대응하는 영역에서 토출되는 바람의 세기를 다른 나머지 영역에 서 토출되는 바람의 세기와 상이하도록 제어할 수 있다. 또한, 제어부는, 상기 판별된 위치 정보에 대응하는 영역에만 바람을 토출하거나 상기 판별된 위치 정보에 대응하는 영역에만 바람이 토출되지 않도록 제어할 수 있다. 예를 들어, 사용자가 음성으로“에어컨 너무 더워, 온도 최저로”라고 명령한 경우, 제어부는, 사용자의 방향 정보를 추출하여 해당 방향으로만 집중적으로 바람이 토출되도록 제어하거나, 해당 방향의 바람 세기가 더 강하게 제어할 수 있다. 또한, 사용자가 음성으로“에어컨 너무 추워, 온도 27도로 변경해줘”라고 명령한 경우, 제어부는, 사용자 가 위치하지 않는 방향으로만 바람을 내보낼 수 있도록 한쪽 토출구를 차폐하거나, 사용자의 설정 온도에 따라 사용자가 위치한 방향에서는 바람의 세기를 약하게 조절할 수 있다. 제어부는, 사용자가 명령한 음성 인식 결과의 의도에 따라 공기조화기를 제어할 수 있다. 예를 들어, 사용자가 “에어컨, 너무 더워”라고 발화한 경우, 음성 의도로 더워라는 결과와, 강도를 나타내는 “너무”라는 부사를 고려하여, 사용자가 발화한 방향에 대해서만 바람을 보내며, 바람 세기 또한 가장 강하게 설정하여 사용자에게 냉방을 집중할 수 있도록 제어할 수 있다. 도 15를 참조하면, 사용자가 공기조화기의 왼쪽 45도 부근에 위치할 경우 왼쪽 토출구 및 토출유닛(L)을 제3 영역(A3)으로 고정시킨 후 바람 세기를 강하게 설정하여 사용자 방향으로 바람을 보내줄 수 있다. 도 15를 참조하면, 제어 전에는, 좌측 토출유닛(L)은, 제1 영역 내지 제5 영역(A1 내지 A5)에 대해서 모두 바람 세기를 '강'으로 토출하고, 우측 토출유닛(R)은, 제5 영역 내지 제9 영역(A5 내지 A9)에 대해서 모두 바람 세기 를 '강'으로 토출할 수 있다. 사용자가 “에어컨, 너무 더워”라고 발화하면, 제어부는 제3 영역(A3)에 위치하고 있는 사용자의 방향 정 보를 판별할 수 있다. 이에 따라, 제어부는, 좌측 토출유닛(L)이, 제3 영역(A3)에만 바람 세기를 '강'으로 토출하고, 제1,2,4,5 영역 (A1,A2,A4,A5)에는 바람을 토출하지 않도록 제어할 수 있다. 다른 예로, 공기조화기를 기준으로 사용자가 정면에서 발화한 경우에는 양쪽 토출유닛을 집중시켜 더 시원하 게 만들 수 있다. 도 16을 참조하면, 본 발명에 따른 제어 전에는 좌측 토출유닛(L)은, 제1 영역 내지 제5 영역(A1 내지 A5)에 대 해서 모두 바람 세기를 '강'으로 토출하고, 우측 토출유닛(R)은, 제5 영역 내지 제9 영역(A5 내지 A9)에 대해서 모두 바람 세기를 '강'으로 토출할 수 있다. 사용자가 “에어컨, 너무 더워”라고 발화하면, 제어부는 제5 영역(A5)에 위치하고 있는 사용자의 방향 정 보를 판별할 수 있다. 이에 따라, 제어부는, 좌측 토출유닛(L)과 우측 토출유닛(R) 모두 제 4 영역 내지 제6 영역(A4 내지 A6)에 만 바람 세기를 '강'으로 토출하도록 제어할 수 있다. 또 다른 예로, 사용자가 “에어컨 바람 다른곳으로”라고 명령할 경우, 제어부는, 사용자의 방향을 제외한 방향으로 바람을 토출하도록 제어함으로써 사용자에게 직접 바람이 전달되지 않도록 조절할 수 있다. 도 15, 도 16을 참조하여 설명한 것과 동일한 방식으로, 추위를 느끼는 사용자에게 토출되는 바람을 약하게 조 절하거나 사용자를 향하여 바람이 토출되지 않도록 제어할 수 있다. 도 17을 참조하면, 제2 영역(A2)에 위치하는 사용자가 \"에어컨, 춥다\"라고 발화하면, 제어부는, 좌측 토출 유닛(L)이, 제2 영역(A3)에만 바람 세기를 '강'으로 토출하고, 제1,3,4,5 영역 (A1,A3,A4,A5)에는 바람 세기를 '약'으로 토출하도록 제어할 수 있다. 도 18을 참조하면, 제8 영역(A8)에 위치하는 사용자가 \"에어컨, 매우 추워\"라고 발화하면, 제어부는, 사용 자가 '매우'라는 강조어를 사용한 점을 감안하여, 우측 토출유닛(R)의 동작을 정지하고, 우측 토출유닛(R)의 토 출구가 닫히도록 제어할 수 있다. 이에 따라, 제8 영역(A8)에 위치하는 사용자에게는 바람이 가지 않고, 사용자 의 체감 온도를 급격히 낮출 수 있다. 도 19는 사용자가 자신의 방향(A4)으로 바람이 토출하는 경우를 예시하고, 도 20은, 사용자가 자신의 방향(A5) 에는 바람을 피하고 싶을 때, 해당 방향을 제외한 모든 방향으로 바람이 퍼지도록 제어하는 경우를 예시한다. 본 발명의 실시예들 중 적어도 하나에 의하면, 용자의 위치 정보에 따른 최적화된 기류 제어가 가능하고, 냉방 효율 및 에너지 효율이 향상된 공기조화기 및 그 제어방법을 제공할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 복수의 토출유닛을 이용함으로써, 더욱 정밀한 기류 제어 가 가능하다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 사용자의 음성 신호에 기초하여 사용자의 위치 정보를 판 별함으로써, 전용 센서의 추가 없이 사용자의 위치 정보를 판별할 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 음성 입력에 따라 공기조화기가 동작함으로써, 사용자가 리모콘을 조작할 필요가 없어, 사용자 편의성을 증대시킬 수 있다. 또한, 본 발명의 실시예들 중 적어도 하나에 의하면, 공기조화기를 통하여 수신되는 음성 입력을 음성 인식 서 버 시스템에서 인식함으로써, 효율적으로 자연어를 인식, 처리할 수 있다. 본 발명에 따른 음성 서버, 음성 인식 서버 시스템 및 공기조화기는 상기한 바와 같이 설명된 실시예들의 구성 과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시 예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다. 한편, 본 발명의 실시예에 따른 음성 인식 방법, 음성 서버, 음성 인식 서버 시스템 및 공기조화기의 제어방법 은, 프로세서가 읽을 수 있는 기록매체에 프로세서가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 프로세서 가 읽을 수 있는 기록매체는 프로세서에 의해 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함 한다. 프로세서가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있으며, 또한, 인터넷을 통한 전송 등과 같은 캐리어 웨이브의 형태로 구현되는 것도 포함한다. 또한, 프로세서가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 프로세 서가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 또한, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2017-0113548", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2017-0113548", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 공기조화기 일 실시예의 정면도이다. 도 2는 본 발명의 일 실시예에 따른 공기조화기 일 실시예의 토출 어셈블리와 송풍기가 분리된 사시도이다. 도 3은 도 1에 도시된 A-A 선 단면도이다. 도 4는 도 1에 도시된 B-B 선 단면도이다. 도 5는 도 1에 도시된 C-C 선 단면도이다. 도 6은 본 발명의 일 실시예에 따른 공기조화기의 토출유닛 및 토출유닛 홀더의 분해 사시도이다. 도 7은 본 발명의 일 실시예에 따른 공기조화기의 디스플레이 어셈블리의 확대 단면도이다. 도 8은 본 발명의 일 실시예에 따른 공기조화기의 디스플레이 어셈블리의 분해 사시도이다. 도 9는 본 발명의 일 실시예에 따른 공기조화기의 내부 블록도의 일예를 도시한 도면이다. 도 10은 본 발명의 일 실시예에 따른 공기조화기의 내부 블록도의 다른 예를 도시한 도면이다. 도 11은 본 발명의 일 실시예에 따른 음성 인식 서버 시스템의 일예이다. 도 12는 본 발명의 일 실시예에 따른 음성 인식 서버 시스템의 일예이다. 도 13은 본 발명의 일 실시예에 따른 공기조화기의 제어방법을 도시한 순서도이다.도 14 내지 도 20은 본 발명의 실시예에 따른 공기조화기의 제어방법에 관한 설명에 참조되는 도면이다."}
