{"patent_id": "10-2022-0077208", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0000710", "출원번호": "10-2022-0077208", "발명의 명칭": "센서 주소 매핑 장치 및 그 장치의 구동방법", "출원인": "주식회사 썬에이치에스티", "발명자": "이진용"}}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "산업용 장비의 동작이나 주변 상태를 감시하는 무선센서와 상기 무선센서를 제어하는 무선제어장치의 매핑을 위한 설정 화면을 표시하는 디스플레이부; 및상기 표시한 설정 화면에서 각 무선제어장치마다 설정되는 상기 무선센서의 시작 주소 정보를 수신하며, 상기수신한 시작 주소 정보에 무선센서의 식별정보를 매칭할 때 상기 무선센서의 코드를 스캔하는 방식으로 상기 시작 주소 정보와 상기 무선센서를 자동 매핑하는 제어부;를포함하는 센서 주소 매핑 장치."}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 상기 디스플레이부에 상기 무선제어장치를 설정하는 제1 설정창을 표시하고, 상기 제1 설정창에서 선택된 무선제어장치에 매칭되는 무선센서의 시작 주소를 설정하기 위한 제2 설정창을 표시하는 센서 주소매핑 장치."}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는, 상기 제2 설정창을 상기 디스플레이부에 표시할 때 시작 주소의 번호가 기설정되는 제1 항목과,사용자가 원하는 정보로 주소가 시작되도록 하는 제2 항목을 표시하는 센서 주소 매핑 장치."}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는, 상기 제2 항목에서의 시작 주소를 사용자가 번호나 문자를 직접 입력하도록 동작시키는 센서 주소 매핑 장치."}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어부는, 상기 무선센서를 원격에서 모니터링하는 외부장치로 상기 자동 매핑된 매핑 데이터를 제공하여상기 제공한 매핑 데이터에 근거해 모니터링이 수행되도록 하는 센서 주소 매핑 장치."}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 센서 주소 매핑 장치는, 스마트폰 또는 태블릿PC를 포함하는 모바일 기반의 단말장치를 포함하는 센서 주소 매핑 장치."}
{"patent_id": "10-2022-0077208", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "디스플레이부가, 산업용 장비의 동작이나 주변 상태를 감시하는 무선센서와 상기 무선센서를 제어하는 무선제어장치의 매핑을 위한 설정 화면을 표시하는 단계; 및제어부가, 상기 표시한 설정 화면에서 각 무선제어장치마다 설정되는 상기 무선센서의 시작 주소 정보를 수신하며, 상기 수신한 시작 주소 정보에 무선센서의 식별정보를 매칭할 때 상기 무선센서의 코드를 스캔하는 방식으로 상기 시작 주소 정보와 상기 무선센서를 자동 매핑하는 단계;를공개특허 10-2024-0000710-3-포함하는 센서 주소 매핑 장치의 구동방법."}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 센서 주소 매핑 장치 및 그 장치의 구동방법에 관한 것으로서, 본 발명의 실시예에 따른 센서 주소 매 핑 장치는, 산업용 장비의 동작이나 주변 상태를 감시하는 무선센서와, 무선센서를 제어하는 무선제어장치의 매 핑을 위한 설정 화면을 표시하는 디스플레이부, 및 표시한 설정 화면에서 각 무선제어장치마다 설정되는 무선센 서의 시작 주소 정보를 수신하며, 수신한 시작 주소 정보에 무선센서의 식별정보를 매칭할 때 무선센서의 코드를 스캔하는 방식으로 시작 주소 정보와 무선센서를 자동 매핑하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 센서 주소 매핑 장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게는 가령 PLC 등의 센서모 니터링장치를 사용하는 산업현장에서 모바일 단말기를 이용한 사용자 주소 설정에 따라 PLC가 원격제어 및 모니 터링을 수행하는 센서 주소 매핑 장치 및 그 장치의 구동방법에 관한 것이다."}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "열, 빛, 온도, 압력, 소리 등의 물리적인 양이나 그 변화를 감지하거나 구분 및 계측하여 일정한 신호로 알려주 는 부품이나 기구, 또는 계측기를 센서(sensor)라고 한다. 센서는 동작을 감지하거나 소리에 따라 반응하거나 누르는 힘에 따라 반응하는 등 그 활용 범위가 매우 넓다. 센서의 종류에는 온도 센서, 압력 센서, 유량 센서, 자기 센서, 광 센서, 음향 센서, 미각 센서, 후각 센서 등이 있다. 고속도로에 차량이 진입하면 통행 카드가 나 오거나, 교실의 화재 감지기, 현관의 자동 점멸등, 어두워지면 켜지는 가로등 등이 간단한 센서의 예이다. 그런데, 종래의 유선 센서 계측 시스템은 케이블 설치가 불가한 부분에서 진동 측정이 필요할 경우 측정이 불가 능하거나 다른 여러 가지 방법을 구상함에 있어 크고 작은 문제가 발생한다. 또한, 유선 진동 센서의 케이블 설 치가 불가능하면 무선 계측 시스템을 이용하는 방법이 적용될 수 있으나 무선 진동 센서는 가격이 비싸기 때문 에 초기 구매 비용의 문제가 있다. 여러 이유로 기존의 산업현장에서는 유선 방식으로 선을 이용하여 센서를 연결하여 사용하는 사례가 많지만, 해 당 방식은 환경이 복잡하여 안전 사고를 유발할 수 있기에 이러한 문제점을 해결하기 위한 효율적인 무선 방식 이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-1783132호(2017.09.22) (특허문헌 0002) 한국등록특허공보 제10-1143343호(2012.04.30) (특허문헌 0003) 한국등록특허공보 제10-1652461호(2016.08.24) (특허문헌 0004) 한국등록특허공보 제10-1098042호(2011.12.16) (특허문헌 0005) 한국공개특허공보 제10-2019-0111359호(2019.10.02) (특허문헌 0006) 한국공개특허공보 제10-2021-0084094호(2021.07.07) (특허문헌 0007) 한국공개특허공보 제10-2022-0007939호(2022.01.20)"}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 가령 PLC 등의 센서모니터링장치를 사용하는 산업현장에서 모바일 단말기를 이용한 사용자 주소 설정에 따라 PLC가 원격제어 및 모니터링을 수행하는 센서 주소 매핑 장치 및 그 장치의 구동방법을 제공 함에 그 목적이 있다."}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 센서 주소 매핑 장치는, 산업용 장비의 동작이나 주변 상태를 감시하는 무선센서와 상 기 무선센서를 제어하는 무선제어장치의 매핑을 위한 설정 화면을 표시하는 디스플레이부, 및 상기 표시한 설정 화면에서 각 무선제어장치마다 설정되는 상기 무선센서의 시작 주소 정보를 수신하며, 상기 수신한 시작 주소정보에 무선센서의 식별정보를 매칭할 때 상기 무선센서의 코드를 스캔하는 방식으로 상기 시작 주소 정보와 상 기 무선센서를 자동 매핑하는 제어부를 포함한다. 상기 제어부는, 상기 디스플레이부에 상기 무선제어장치를 설정하는 제1 설정창을 표시하고, 상기 제1 설정창에 서 선택된 무선제어장치에 매칭되는 무선센서의 시작 주소를 설정하기 위한 제2 설정창을 표시할 수 있다. 상기 제어부는, 상기 제2 설정창을 상기 디스플레이부에 표시할 때 시작 주소의 번호가 기설정되는 제1 항목과, 사용자가 원하는 정보로 주소가 시작되도록 하는 제2 항목을 표시할 수 있다. 상기 제어부는, 상기 제2 항목에서의 시작 주소를 사용자가 번호나 문자를 직접 입력하도록 동작시킬 수 있다. 상기 제어부는, 상기 무선센서를 원격에서 모니터링하는 외부장치로 상기 자동 매핑된 매핑 데이터를 제공하여 상기 제공한 매핑 데이터에 근거해 모니터링이 수행되도록 할 수 있다. 상기 센서 주소 매핑 장치는, 스마트폰 또는 태블릿PC를 포함하는 모바일 기반의 단말장치를 포함할 수 있다. 또한, 본 발명의 실시예에 따른 센서 주소 매핑 장치의 구동방법은, 디스플레이부가, 산업용 장비의 동작이나 주변 상태를 감시하는 무선센서와 상기 무선센서를 제어하는 무선제어장치의 매핑을 위한 설정 화면을 표시하는 단계, 및 제어부가, 상기 표시한 설정 화면에서 각 무선제어장치마다 설정되는 상기 무선센서의 시작 주소 정보 를 수신하며, 상기 수신한 시작 주소 정보에 무선센서의 식별정보를 매칭할 때 상기 무선센서의 코드를 스캔하 는 방식으로 상기 시작 주소 정보와 상기 무선센서를 자동 매핑하는 단계를 포함한다."}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 산업 자동화 장비 등을 관리하는 관리자가 산업 자동화 장비의 동작을 감시하는 센 서의 센서 큐알(QR) 코드를 스캔하여 원하는 주소에 원하는 센서를 쉽게 연결할 수 있을 것이다. 또한, 본 발명의 실시예는 연결된 센서를 통해 무선 통신에서의 센서를 PLC 등의 센서모니터링장치에 연결하여 근거리 무선 통신을 통해 산업 자동화 장비를 실시간으로 제어하고 모니터링할 수 있을 것이다."}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 센서 주소 매핑 시스템을 나타내는 도면이다. 도 1에 도시된 바와 같이 본 발명의 실시예에 따른 센서 주소 매핑 시스템은 무선센서, 무선제어장치 , 관리자 단말장치, 통신망 및 센서모니터링장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 통신망과 같은 일부 구성요소가 생략되어 무선제어장치(11 0)와 센서모니터링장치가 다이렉트 통신(예: P2P 통신 등)을 수행하거나, 센서모니터링장치를 구성하 는 구성요소의 일부 또는 전부가 통신망을 구성하는 네트워크장치(예: 무선교환장치 등)에 통합되어 구성 될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 무선센서는 히터, 쿨러, 모터, 팬, 컴프레셔, 펌프 등 임의의 장치 또는 산업용 자동화 장비에 구비되거나 연계되어 해당 장치의 동작 상태(예: 열, 진동, 소음, 온도 등) 등과 관련한 다양한 유형의 센싱 데이터를 제공 하거나, 임의 공간에 설치되어 습도는 물론, 오존 농도 측정, 코로나 발생 여부 등을 감지하여 그에 따른 센싱 데이터를 제공할 수 있다. 물론 전기 방전에 의한 코로나 발생은 사고를 유발하기 때문에 감시되어야 할 필요가있다. 이외에도 본 발명의 실시예에 따른 무선센서는 자계감지센서, 리미트 센서 및 근접센서 등의 산업용 무선센서를 포함할 수 있다. 시중에서 사용되는 무선센서는 수십 ~ 수만개에 이르고 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 무선센서는 무선센서모듈의 형태로 구성된다. 모듈(module)은 부품의 집합을 의미할 수 있으며, 예를 들어 인쇄회로기판(PCB)상에 센서, CPU나 MPU, 배터리부, 무선통신부 등을 포함하도록 구성될 수 있다. 물론 센서는 외부의 물리적 상태 등을 센싱하고 센싱 신호를 출력한다. CPU나 MPU의 센서 제어부는 센서로부터 센싱 신호 혹 은 센싱 데이터를 입력받고 디지털 신호로 변환하는 등의 동작을 수행할 수 있다. 배터리부는 CPU나 MPU, 센서 및 무선통신부의 동작을 위한 전원전압(Vcc)을 제공한다. 전원전압은 직류전압이 사용될 수 있다. 무선통신부는 센서 제어부의 제어하에 센서의 센싱 데이터 또는 센서의 아날로그 신호를 디지털 신호로 변환한 센싱 신호를 복수의 무선센서를 관할하는 무선제어장치로 전송한다. 무선센서는 무선통신부로서 근거리통신모듈을 포함할 수 있으며, 해당 통신모듈은 근거리 통신을 위한 블 루투스, 지그비, 와이파이, 적외선 통신 등 다양한 통신 방식이 적용될 수 있다. 근거리 통신은 단방향 또는 양 방향 통신이 가능한 블루투스 통신이 바람직할 수 있다. 비콘(beacon)은 BLE(Bluetooth Low Energy)의 원리가 적용된다. BLE는 저전력 블루투스를 뜻하며 블루투스 4.0 이상의 기술을 말한다. 무선통신부로서 비콘 송신기는 주기적으로 신호를 전송한다. 본 발명의 실시예에 따른 비콘 송신기는 양방향 통신이 아닌 일방향 통신도 가능 하므로, 본 발명의 실시예에서는 어느 하나의 방식에 특별히 한정하지는 않을 것이다. 무선센서는 내부적으로 배터리 상태를 측정할 수 있고, 가령 측정값이 기준값 이하가 될 때 무선제어장치 로 배터리 상태와 관련한 상태값을 제공한다. CPU나 MPU의 센서 제어부는 센서 배터리 양을 측정하여 예를 들어 일정 전압 이하로 내려가는지를 판단한다. 즉 센서 배터리 측정은 센서에 부착된 또는 탑재된 MPU 등을 통 해 해당 MCU에 공급되고 있는 전압을 측정하여 해당 센서의 현재 배터리 상태를 확인한다. 센서 제어부는 배터 리측정부를 포함할 수 있지만, 센서 제어부와 별도로 주변회로로서 구성되는 배터리측정부와 연계하여 동작할 수 있다. 전압이 증가하면 전류가 증가하며, 전류가 증가한다는 것은 단위시간 당 단면적을 지나간 전하의 수가 증가하는 것을 의미하므로, 이에 근거하여 전압의 측정을 통해 센서 배터리 양의 측정이 가능하다. 즉 배터리의 양이라는 것은 전하의 양이기 때문이다. 예를 들어, 무선센서는 더 정확하게는 센서 제어부는 배터리부와 연결되는 연결선로와 가령 접지(GND)와의 사이에 지정된 값을 갖는 저항을 구성하고, 해당 저항의 양단 전압을 센싱함으로써 이를 통해 배터리의 양을 측정할 수 있다. 무선제어장치는 복수의 무선센서와 통신하고 또 임의 영역의 복수의 무선센서들을 관할하는 통 신 수신기로서 동작한다. 무선제어장치는 본 발명의 실시예에 따라 복수의 무선제어장치 즉 N개의 무 선제어기가 구축되어 사용될 수 있으며, 이의 경우 각 무선제어장치는 서로 다른 그룹의 무선센서들 로부터 센싱 데이터를 수신하여 도 1의 센서모니터링장치로 전송한다. 각 무선제어장치가 관할하는 무선센서의 개수는 원활한 통신을 위하여 128개 정도로 제한될 수 있다. 물론 이는 무선제어장치의 성능에 관계되므로 그러한 개수에 특별히 한정하지는 않을 것이다. 무선제어장치는 본 발명의 실시예에 따른 도 1의 무선센서 배터리 알람 시스템의 구축시 하드웨어 형 태의 램(RAM)과 같은 메모리나 소프트웨어 형태의 레지스트리 등에 통신 가능한 무선센서의 목록을 기저장 할 수 있다. 따라서, 이를 근거로 무선제어장치는 자신의 관할영역에 해당하는 무선센서와 통신을 수 행하여 센싱 데이터를 제공한다. 예를 들어, 무선센서는 배터리 상태가 기준값 이하일 때 자신의 배터리 상태와 관련한 상태값을 전송하며 이때 장치식별정보(ID)를 함께 전송한다. 따라서, 무선제어장치는 해당 식별정보가 기저장한 목록의 식별정보와 일치하면 수신된 센싱 데이터를 처리할 수 있다. 본 발명의 실시예에 따른 무선제어장치는 시스템 구축시 또는 관리자 단말장치에서 설정하는 센서의 주소 정보가 변경될 때 제공되는 데이터를 기저장하고 이를 근거로 동작한다. 예를 들어, 무선제어장치는 센서모니터링장치에서 수신한 데이터, 물론 이는 각각의 무선제어장치와 복수의 무선센서를 매 칭한 매칭 데이터 또는 매핑 데이터에 관련된다. 예를 들어, 제1 무선제어기는 1번 무선센서 ~ 128번 무선센서 를 관할하도록 서로의 식별정보를 매칭한 것이 대표적이다. 따라서, 무선제어장치는 센서모니터링장치 에서 수신한 데이터와 무선센서에서 수신한 데이터를 매핑처리한 후 그 결과를 센서모니터링장치 로 제공한다. 여기서, 매핑한다는 것은 기존의 매칭 데이터에 현재 수신한 무선센서의 데이터를 적용 하는 것을 의미할 수 있다. 예를 들어, 무선제어장치는 자신이 관할하지 않는 무선센서들로부터도 센싱 데이터나 배터리 상태 등 과 관련한 동작 데이터를 수신할 수 있다. 물론 무선센서는 앞서 언급한 대로 비콘 신호 등의 일방향 통신을 수행할 수 있고, 자신의 식별정보와 함께 센싱 데이터를 주기적으로 방사할 수 있다. 따라서, 무선제어장치 는 해당 신호를 수신하는 경우 기저장한 목록과 대조하여 자신이 관할하는 무선센서인지를 판단하기 위해 매핑 동작을 수행할 수 있다. 즉 기저장된 데이터를 현재 수신한 데이터와 비교하는 것이다. 가령, 무선제 어장치는 메모리의 일 영역에 저장되어 있는 무선센서들의 식별정보를 불러내어 대조하는 동작을 수 행할 수 있으며, 또 다른 영역에 저장되어 있는 무선센서들의 식별정보와 대조하는 동작을 수행할 수 있다. 이러한 동작은 매핑이 될 수 있다. 관리자 단말장치는 본 발명의 실시예에 따라 센서 주소 매핑 장치로서 동작한다. 관리자 단말장치는 도 1의 센서 주소 매핑 시스템의 시스템 구축시 무선센서들과 이를 제어하는 무선제어장치들을 매칭 혹은 매핑하기 위한 동작을 수행한다. 물론 관리자 단말장치는 무선센서와 무선제어장치가 사용자 주소 설정에 따라 동작하도록 데이터를 설정하는 것이다. 관리자 관말장치의 사용자는 무선 통신에 서의 센서를 PLC 즉 도 1의 센서모니터링장치에 연결하는 프로그램을 실행한 후 이를 통해 무선제어기마다 복수의 무선센서들을 매칭 혹은 매핑시킨다. 이는 각각의 무선제어기와 복수의 무선센서의 연결 지도 를 만든다는 의미에서 매핑이라 명명될 수도 있다. 관리자는 관리자 모드(mode)에서 센서 매핑 설정 페이지에 접근해 제어기별로 시작 주소 설정이 가능하며 이의 과정에서 무선센서의 센서 데이터를 추가한다. 그리고 무선센서의 센서 ID값이 담긴 큐알(QR) 코드를 스캔해 센서 ID값이 들어간 센서 매핑 데이터를 생성한다. 그리고 그 생성한 매핑 데이터를 도 1의 센서모니터링장치로 전송하여, 해당 데이터가 센서모니터링장치 에서 각각의 무선제어장치로 전송되도록 한다. 관리자 단말장치는 스마트폰이나 태블릿PC, 나아가 관리자의 손목 등에 착용하는 웨어러블장치를 포함할 수 있다. 물론 관리자 단말장치는 위의 모바일 기반의 단말장치 이외에도 데스크탑PC나 랩탑컴퓨터 등의 웹 기반의 단말장치를 더 포함할 수 있다. 물론 관리자 단말장치에서 이루어지는 센서 주소 설정 동작은 도 1의 센서모니터링장치의 서비스 동작을 관리하는 관리자의 컴퓨터 등에서도 이루어질 수 있으므로, 본 발명의 실시예에서는 센서 주소 설정 동작을 위한 어느 하나의 장치에 특별히 한정하지는 않을 것이다. 따라서, 도 1의 센서모니터링장치도 주소 설정 매핑 장치로서 동작할 수 있다. 본 발명의 실시예에 따른 관리자 단말장치는 센서 주소 매핑 동작 이외에도 무선센서의 배터리 잔존 량 등의 동작 상태를 확인하기 위한 단말기로도 동작할 수 있다. 예를 들어, 위에서와 같이 무선센서들은 자신의 배터리 상태를 측정하여 배터리 잔존량이 기준값 이하일 때, 또는 기존전압이 사용전압보다 낮을 때 배 터리 잔존량 등의 동작 상태와 관련한 센싱 데이터를 무선제어장치로 전송하고 해당 센싱 데이터는 센서모 니터링장치로 제공된다. 이에 따라 센서모니터링장치는 무선센서를 관리하는 관리자의 관리자 단말장치로 이의 사실을 통지함으로써 관리가 이루어지도록 한다. 이에 따라 무선센서의 고장 수리나 교체가 이루어질 수 있다. 통신망은 유무선 통신망을 모두 포함한다. 가령 통신망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가 령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데이터를 처리하거나, BTS(Base Transceiver Station), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수도 있다. 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함한다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분류상 무 선제어장치나 관리자 단말장치 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분된다. 물론 액세스 포인트는 무선제어장치나 관리자 단말장치와 지그비 및 와이파이(Wi-Fi) 등의 근거리 통신을 수행하 기 위한 근거리 통신 모듈을 포함한다. 액세스포인트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선 (IrDA), UHF(Ultra High Frequency) 및 VHF(Very High Frequency)와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로를 따라 데이터 패킷을 다음 장치, 예컨대 센서모니터링장치로 전달할 수 있다. 액세스포인트는 일반적인 네트워크 환경에서 여러 회선을 공유할 수있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포함된다. 센서모니터링장치는 가령 서버를 포함할 수 있으며, 본 발명의 실시예에 따른 센서 주소 맵핑 장치로서 동 작할 수 있다. 예를 들어, 도 1의 관리자 단말장치는 관리자가 소지하는 모바일 기반의 단말장치라면, 센 서모니터링장치는 서버와, 해당 서버에 연결되어 관리자가 무선센서의 동작을 모니터링하는 전광판, 또는 관리자의 컴퓨터 등을 포함할 수 있다. 이러한 장치들은 앞서 모바일 기반의 단말장치 이외에도 센서 주소 매핑 장치로서 동작할 수 있다. 센서모니터링장치는 데이터 구축이 완료된 후, 임의 공간이나 임의 장비에 설치되는 무선센서들의 동 작 상태를 관리한다. 이를 위하여 센서모니터링장치는 무선제어장치의 식별정보를 기반으로 각 무선 제어장치가 관할하는 복수의 무선센서들을 관리한다. 즉 1번 제어기인 제1 무선제어장치는 1번 센서 부터 128번 센서를 관할할 수 있으며, 2번 제어기인 제2 무선제어장치는 129번 센서에서 257번 센서의 동작 상 태를 관리할 수 있다. 물론 각각의 무선센서는 장치식별정보가 존재하지만 본 발명의 실시예에서는 관리자 단말장치나 센서모니터링장치에서 별도로 각 무선센서에 번호를 부여하는 형태로 관리하는 것도 얼마든지 가능하므로 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 센서모니터링장치는 1번 제어기에서 가령 50번으로 부여되는 무선센서의 배터리 잔여량이 부족한 것으로 상태값이 전송되면, 이를 도 1의 DB(140a)에 상태값을 분류하여 저장시킬 수 있다. 그리고, 센서모니터링 장치는 관리자 단말장치로 이의 사실을 통지할 수 있다. 이의 과정에서 센서모니터링장치는 관 리자 단말장치로 에러 알람을 띄우고, 에러 알람 내역에 추가하며, 관리자가 에러 알람 내역에서 배터리 알람 클릭시 센서 모니터 페이지를 제공한다. 여기서 알람의 통지 과정은 다양한 형태의 통지가 가능하다. 각 무선센서에서 에러가 발생할 때 즉 배터리가 부족할 때마다 에러를 통지하는 것이 아니라, 주기적으로 일 정 시간 간격마다 알람을 통지함으로써 관리자에게 알람이 통지되는 횟수를 줄임으로써 감시에 따른 감시 효율 을 증가시킬 수 있다. 무엇보다 센서모니터링장치는 무선센서들의 감시 효율을 더 증대시키기 위하여 무선센서의 에러 발생 빈도나 동작 상태 등 추가적인 상태를 더 판단하여 배터리 부족에 미치는 영향을 더 판단할 수 있다. 예를 들어 에러 발생 빈도가 높은 경우에는 해당 무선센서의 교체를 요청할 수 있다. 또한, 무선센서의 발 열이 심하거나 제조연식이 오래된 경우에는 제품 열화에 의해 배터리 방전이 빠를 수 있다. 따라서, 센서모니터 링장치는 인공지능 프로그램을 적용하고, 무선센서의 동작이나 배터리 부족과 관련한 데이터를 수집 하여 빅데이터를 생성하며, 해당 빅데이터를 인공지능 프로그램의 딥러닝 동작을 적용하여 무선센서의 배 터리 부족이나 고장과 관련해 선제적으로 대응함으로써 무선센서를 사용하는 환경에서 배터리 방전으로 오 작동 및 작업자의 안전사고 발생을 예방할 수 있다. 예를 들어, 특정 제조사의 무선센서에서 발열이 있는 경우 센서모니터링장치는 지금까지의 데이터 학습 결과에 따라 제조사명을 확인해 볼 수 있다. 해당 제조 사의 무선센서에서 고장 이력이 있는 경우 이의 사실을 관리자 단말장치로 제공하여 신속한 교체가 이루어지도록 할 수 있다. 한편, 센서모니터링장치는 무선제어장치의 비정상 동작시에도 적절히 대응할 수 있다. 예를 들어, 센 서모니터링장치는 지정된 무선제어장치로부터 무선센서의 데이터가 수신되는지를 판단한다. 물 론 센서모니터링장치는 특정 무선제어장치가 관할하는 무선센서 중 배터리가 부족한 센서가 없 는 경우에는 지정 시간동안 데이터를 수신하지 않을 수도 있다. 따라서 센서모니터링장치는 이러한 동작 상태를 학습하고 해당 학습 결과를 근거로 특정 무선제어장치가 관할하는 무선센서의 동작 패턴을 통 해 무선제어장치의 비정상 여부를 판단할 수 있다. 뿐만 아니라, 센서모니터링장치는 인공지능 프로 그램을 적용한 학습이 아니라 하더라도 일정 시간동안 수신되는 센싱 데이터가 없을 때 무선제어장치로 비 정상 동작 여부를 확인하기 위한 시험(test) 신호를 전송하고 그에 대한 응답(response) 신호가 없는 경우 비정 상 동작이라 판단하여 관리자 단말장치로 해당 무선제어장치의 고장 수리나 교체가 이루어지도록 조 치할 수 있다. 도 2 내지 도 6은 센서 주소 매핑 과정을 설명하기 위한 도면이다. 설명의 편의상 도 2 내지 도 6을 도 1과 함께 참조하면, 관리자 단말장치는 본 발명의 실시예에 따른 센서 주소 매핑 장치로서 동작하며, 먼저 도 2에서와 같이 관리자 모드에서 센서 매핑 설정 페이지에 접속하기 위한 화면을 표시할 수 있다. 해당 설정 페이지를 통해 제어기별로 시작 주소 설정이 가능할 수 있으며, 이의 과정에서 센서 데이터를 추가한 다. 예를 들어, 도 3 및 도 4에서와 같이 2개의 설정창을 각각 표시할 수 있다. 제1 설정창은 제어기 설정창 화 면에 해당한다. 제2 설정창은 시작 주소 설정창 화면에 해당한다. 어떤 무선제어기인지 어떤 무선센서들인지를 결정한다고 볼 수 있다. 가령 제1 무선제어기에는 총 128개의 무선센서들을 매핑시킬 수 있다. 따라서 이 의 경우에는 제2 설정창에 제1 항목과 같이 센서의 다음 주소정보를 디폴트로 즉 기설정한 번호가 표시될 수 있 다. 이는 자동 설정되는 것이므로 관리자는 이를 단순히 선택하여 각 제어기마다 연결되는 무선센서들의 시작 주소를 설정할 수 있다. 즉 큐알 코드 스캔이 이루어질 수 있다. 그러나, 만약 관리자가 자신이 원하는 주 소 정보를 사용하고자 하는 경우에는 제2 설정창에서 번호 등의 해당 주소 정보를 직접 입력하기 위한 제2 항목 을 선택하여 사용자 설정 기반으로 무선센서들을 매핑시킬 수 있다. 또한, 관리자 단말장치는 제2 설정창에서 제1 항목 또는 제2 항목을 선택하여 시작 주소 정보를 설정한 후 각 주소 정보의 무선센서에 대한 식별정보를 저장시키기 위하여 무선센서에 부착되는 큐알코드나 태 그(예: RFID) 등을 스캔할 수 있다. 해당 큐알코드는 도 5에 보여주고 있다. 해당 큐알코드에는 센서 ID값이 포 함되어 있으므로, 관리자 단말장치의 카메라를 통해 해당 큐알코드를 인식시킴으로써 각 무선센서의 식별정보가 자동으로 매핑된다. 물론 관리자 단말장치에서 관리자의 요청에 따라 센서 ID는 삭제될 수 있으며, 매핑 동작이 완료되는 경우 해당 매핑 데이터는 즉 센서 ID 내역은 PLC와 같은 도 1의 센서모니터링장치로 전송되어 DB(140a)에 체계 적으로 분류되어 저장된다. 물론, 관리자 단말장치는 수정이 있는 경우 해당 기저장된 매핑 데이터를 불러 내어 수정한 후 도 1의 DB(140a)에 기저장된 데이터를 갱신할 수 있다. 이외에도 관리자 단말장치는 도 6 에서와 같이 센서 ID 값이 들어간 센서 매핑 데이터를 조회하여 등록에 오류가 없는지를 확인할 수 있다. 물론 이러한 오류는 도 6에서 볼 때 우측 상단에서 제어기를 선택하는 항목에서 각각의 제어기를 선택함으로써 제어 기별로 확인하는 것이 얼마든지 가능하다. 예를 들어, 관리자 단말장치는 각 제어기마다 하나의 화면을 생 성하므로 데이터의 입력시 중복되는 정보가 있는지를 자동으로 확인해 주어 중복 여부를 사전에 판단해 줄 수 있다. 도 7은 본 발명의 실시예에 따른 센서 주소 매핑 과정을 나타내는 흐름도이다. 설명의 편의상 도 7을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 관리자 단말장치 즉 모바일 단말기 는 사용자가 매핑한 센서 데이터 정보를 센서모니터링장치 즉 PLC로 전송한다(S700). 센서 데이터의 매핑 동작은 앞서 도 2 내지 도 6을 통해 살펴본 바 있으므로 그 내용들로 대신하고자 한다. 또한, 무선제어장치는 무선제어기로서 센서 데이터 정보를 PLC로부터 수신한다(S710). 더 정확하게는 각각 의 무선제어기는 자신의 관할 영역에 관계되는 무선센서들에 대한 센서 데이터 정보를 수신할 수 있다. 그 러나, 각각의 무선제어장치는 모든 무선제어기에 대한 센서 데이터 정보를 제공받아 자신의 무선제어기에 해당하는 센서 데이터 정보만을 추출하여 이용할 수도 있으므로 본 발명의 실시예에서는 어느 하나의 형태에 특 별히 한정하지는 않을 것이다. 본 발명의 실시예에서는 연산처리 부담을 줄일 수 있다는 점에서 전자의 방식이 바람직하다. 이와 같이, 시스템 세팅 또는 데이터 구축 동작이 완료되면, 무선제어장치는 무선센서들과 무선 통신 을 통해 무선제어기가 상태 정보를 수신한다(S720). 여기서, 상태 정보는 산업 자동화 장비 등의 동작 상태나 해당 장비의 주변 환경에 대한 환경 상태(예: 온도, 습도, 충격 등)의 정보를 포함한다. 그러면, 무선제어장치 즉 무선제어기는 센서모니터링장치에서 수신한 데이터와 무선센서들에서 수신한 데이터를 매핑처리한 후 즉 데이터 처리한 후 센서모니터링장치 즉 PLC로 전송한다(S730). 무선제 어기는 각 제어기별로 무선센서들의 동작 상태와 관련한 센싱 데이터를 매칭하여 센서모니터링장치로 전송한다고 볼 수 있다. 이후 모바일 단말기인 관리자 단말장치는 센서모니터링장치인 PLC에서 센서 데이터 처리를 완료한 센 서값을 수신한다(S740). 예를 들어, 관리자 단말장치는 센서들의 동작 상태를 화면상에서 확인할 수 있지 만, 배터리 잔존량과 같이 안전 사고를 유발할 수 있는 상황을 판단하여 알림을 제공할 수 있다. 도 8은 본 발명의 실시예에 따른 주소 정보 매핑 장치의 동작 과정을 나타내는 흐름도이다. 설명의 편의상 도 8을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 주소 정보 매핑 장치는 도 1의 관리자 단말장치로서 어플리케이션(이하, 앱)을 실행하여 도 2에서와 같은 센서 매핑 설정 페이지를 화면에 표시 한다(S800 ~ S850). 이를 위하여 관리자 단말장치는 관리자 모드로 접속할 수 있다. 물론 이러한 페이지 화면은 관리자 단말장치에서 앱을 실행하여 관리자 모드 즉 웹 주소로 센서모니터링장치에 접속하여제공되는 화면일 수 있으므로, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 관리자 모드로 접속하는 경우 관리자 단말장치는 패스워드를 입력하도록 요청할 수 있으며, 패스워드가 기 설정된 패스워드와 일치할 때 설정 페이지를 제공할 수 있다. 또한 관리자 단말장치는 센서 매핑 내역 리스트 화면을 화면상에 표시하고, 관리자로부터 센서 매핑 내역 전송 요청이 있을 때 센서 ID를 PLC의 센서모니터링장치로 전송한다(S860, S865, S867). 이의 과정에서 관리자 단말장치는 관리자로부터 센서 매핑 내역 데이터 생성을 위한 요청이 있는 경우 센 서 데이터 시작 주소 설정을 위한 동작을 수행할 수 있으며, 설정된 시작 주소부터 센서 데이터를 가령 최대 128개까지 생성할 수 있다(S870, S875, S877). 또한 관리자 단말장치는 설정된 시작 주소부터 센서 데이터를 생성할 수 있도록 센서 ID를 입력(혹은 등록)시키며 이의 과정에서 센서에 부착되는 큐알코드를 스캔할 수 있다(S880, S890). 이에 따라 관리자 단말장치는 선택한 주소에 센서 ID를 입력한다(S895). 예를 들어, 관리자가 제2 무선제 어기에 무선센서들을 매칭시키기 위하여 사용자 기반으로 센서 주소 정보를 입력하는 경우 번호의 경우에 는 순차적으로 증가하는 형태로 센서 주소 정보가 생성되어 이에 큐알코드를 스캔하여 특정 센서의 센서 ID를 입력할 수 있지만, 문자 형태로 주소 정보를 사용하는 경우에는 매번 센서 주소 정보를 등록한 후 큐알코드를 스캔하여 센서 ID를 입력하는 형태로 관리자 단말장치가 동작할 수 있다. 다양한 방법이 가능하므로 본 발 명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 도 9는 본 발명의 실시예에 따른 주소 정보 매핑 장치의 세부 구조를 예시한 블록다이어그램이다. 도 9에 도시된 바와 같이, 본 발명의 실시예에 따른 주소 정보 매핑 장치는 도 1의 관리자 단말장치 및 센 서모니터링장치 중 적어도 하나의 장치로서, 통신 인터페이스부, 제어부, 디스플레이부, 센서주소매핑부 및 저장부의 일부 또는 전부를 포함한다. 여기서 \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 주소 정보 매핑 장 치가 구성되거나, 센서주소매핑부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 또한 설명의 편의상 이하에서는 주소 정보 매핑 장치를 관리자 단말장치로 설명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 센서모니터링장치와 통신한다. 통신을 수행하는 과정에서 통신 인터페이스부는 주소 정보 매핑 동작을 위한 앱을 다운로드받아 저장할 수 있다. 해당 앱은 본 발명의 실시예에 따라 '사용자 주소 설정에 따른 제어기 센서 주소 매핑 프로그램'이라 명명될 수도 있다. 또한, 통신 인터페이스부는 가령 도 2 내지 도 6에서와 같은 과정에 따라 무선제어기와 무선센서간 주소 자동 매핑 동작이 완료되면 매핑 센서 데이터를 제어부의 요청에 따라 도 1의 센서모니터링장치(14 0)로 전송한다. 이에 따라 센서모니터링장치는 해당 데이터 정보를 DB(140a)에 체계적으로 분류하여 저장 시킬 수 있으며, 기저장된 데이터 정보가 있는 경우 갱신 동작을 수행한다. 이외에도 통신 인터페이스부는 사용자 주소 설정에 따라 도 1의 센서모니터링장치에서 제공하는 센서 값을 수신한다. 물론 여기서의 센서값은 무선센서들의 동작 상태 등에 관계된다. 해당 센서값은 제어부 의 제어하에 도 1의 디스플레이부에 표시될 수 있다. 제어부는 도 9의 통신 인터페이스부, 디스플레이부, 센서주소매칭부 및 저장부의 전 반적인 제어 동작을 담당한다. 제어부는 관리자의 요청에 따라 센서주소매핑부를 제어하여 내부에 탑 재된 프로그램을 실행시킬 수 있으며, 이에 따라 도 2 내지 도 6의 화면을 디스플레이부에 구현할 수 있다. 또한, 제어부는 디스플레이부를 통해 사용자 설정 동작이 완료되면 그 완료시 생성되는 센서 데이터 정보를 도 1의 센서모니터링장치로 전송되도록 통신 인터페이스부를 제어한다. 디스플레이부는 제어부의 제어하에 다양한 유형의 설정 화면이나 데이터를 화면에 표시한다. 대표적 으로 디스플레이부는 제어부의 제어하에 도 2 내지 도 6에서와 같은 화면들을 표시할 수 있으며, 해 당 화면들을 통해 설정된 센서 데이터 정보에 따라 임의 무선센서에서 센서값이 제공될 때 이를 디스플레 이부에 표시해 줄 수 있다. 센서주소매핑부는 사용자의 요청에 따라 무선센서들을 제어(혹은 통신)하는 무선제어기인 무선제어장 치와의 설정 동작을 수행한다. 이를 위하여 다양한 형태의 UX/UI 화면을 생성해 제공할 수 있으며, 물론이러한 화면은 사전에 기생성될 수 있다. 대표적으로 센서주소매핑부는 무선제어기를 설정하는 제1 설정창 을 제공한 후 그 제1 설정창에서 설정한 무선제어기에 무선센서들을 매칭시키기 위한 제2 설정창을 제공할 수 있다. 물론 해당 설정창들은 디스플레이부에 표시된다. 센서주소매핑부는 제2 설정창을 통해 관리자가 설정하는 주소 정보를 기반으로 무선센서들의 센서 ID 값을 또한 매칭시킨다. 이에 따라, 무선제어기 - 무선센서 주소정보 - 센서 ID값의 형태로 매핑이 이루어진다. 물론 여기서의 무선센서 주소정보는 번호의 형태로 설정되거나 문자의 형태로 설정될 수 있다. 사용자가 직접 해당 번호나 문자를 입력하는 형태로 동작이 이루어진다. 또한, 센서 ID값의 매칭은 센서의 주소정보를 입력한 후 센서의 큐알코드를 스캔함으로써 자동 매칭이 이루어진다. 여기서, '매칭'은 무선제어기에 하나하나의 무선 센서를 연결시키는 과정이라면, '매핑'은 그 연결에 의해 형성된 전체의 연결 상태를 의미할 수 있다. 일 종의 지도와 같은 형태를 의미한다고 볼 수 있으며, 따라서 본 발명의 실시예에서는 센서 매핑 데이터라 명명할 수 있다. 따라서 센서주소매핑부는 각각의 무선제어기에 매칭되는 복수의 무선센서의 센서값들을 매 칭하여 센서주소 매핑 데이터를 생성한다. 따라서, 본 발명의 실시예에서는 그러한 용어의 사용에 특별히 한정 하지는 않을 것이다. 저장부는 제어부의 제어하에 처리되는 다양한 유형의 데이터를 임시 저장한 후 출력한다. 저장부 는 디스플레이부에서 다양한 설정창을 통해 입력되는 정보를 임시 저장한 후, 해당 정보가 센서주소 매핑부로 제공되도록 동작할 수 있다. 상기한 내용 이외에도 도 9의 통신 인터페이스부, 제어부, 디스플레이부, 센서주소매핑부 및 저장부는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들 로 대신하고자 한다. 본 발명의 실시예에 따른 도 9의 통신 인터페이스부, 제어부, 센서주소매핑부 및 저장부는 서로 물리적으로 분리된 하드웨어 모듈로 구성되지만, 각 모듈은 내부에 상기의 동작을 수행하기 위한 소프트웨 어를 저장하고 이를 실행할 수 있을 것이다. 다만, 해당 소프트웨어는 소프트웨어 모듈의 집합이고, 각 모듈은 하드웨어로 형성되는 것이 얼마든지 가능하므로 소프트웨어니 하드웨어니 하는 구성에 특별히 한정하지 않을 것 이다. 예를 들어 저장부는 하드웨어인 스토리지(storage) 또는 메모리(memory)일 수 있다. 하지만, 소프트 웨어적으로 정보를 저장(repository)하는 것도 얼마든지 가능하므로 위의 내용에 특별히 한정하지는 않을 것이다. 한편, 본 발명의 다른 실시예로서 제어부는 CPU 및 메모리를 포함할 수 있으며, 원칩화하여 형성될 수 있 다. CPU는 제어회로, 연산부(ALU), 명령어해석부 및 레지스트리 등을 포함하며, 메모리는 램을 포함할 수 있다. 제어회로는 제어동작을, 그리고 연산부는 2진비트 정보의 연산동작을, 그리고 명령어해석부는 인터프리터나 컴 파일러 등을 포함하여 고급언어를 기계어로, 또 기계어를 고급언어로 변환하는 동작을 수행할 수 있으며, 레지 스트리는 소프트웨어적인 데이터 저장에 관여할 수 있다. 상기의 구성에 따라, 가령 관리자 단말장치의 동 작 초기에 센서주소매핑부에 저장되어 있는 프로그램을 복사하여 메모리 즉 램(RAM)에 로딩한 후 이를 실 행시킴으로써 데이터 연산 처리 속도를 빠르게 증가시킬 수 있다. 딥러닝 모델 같은 경우 램(RAM)이 아닌 GPU 메모리에 올라가 GPU를 이용하여 수행 속도를 가속화하여 실행될 수도 있다. 도 10은 도 9의 센서 주소 매핑 장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 10을 도 1과 함께 참조하면, 본 발명의 실시예에 관리자 단말장치는 센서 주소 매핑 장 치로서 산업 자동화 장비 즉 산업용 장비의 동작이나 주변 상태를 감시하는 무선센서와 그 무선센서 를 제어하는 무선제어장치를 매핑하기 위한 설정 화면을 표시한다(S1000). 예를 들어, 제1 무선제어기에는 1번 무선센서에서 128번 무선센서까지 매칭되어 데이터가 생성될 수 있다. 또한, 제2 무선제어기에는 129번부터 257번까지의 무선센서가 매칭되어 데이터가 생성될 수 있다. 물론 여기서 는 번호를 예시하였지만 해당 번호는 관리자 단말장치의 관리자가 직접 지정하는 것도 얼마든지 가능하므 로, 본 발명의 실시예에서는 어느 하나의 형태에 특별히 한정하지는 않을 것이다. 또한, 관리자 단말장치는 표시한 설정 화면에서 각 무선제어장치마다 설정되는 무선센서의 시작 주소 정보를 수신하며, 수신한 시작 주소 정보에 무선센서의 식별정보를 매칭할 때 무선센서의 코드 를 스캔하는 방식으로 시작 주소 정보와 무선센서를 자동 매핑한다(S1010). 이의 과정에 따라 예를 들어 무선제어기 - 무선센서의 주소정보 - 무선센서의 식별정보의 형태로 데이터가 연결되어 생성될 수 있으며, 주소 정보가 관리자에 의해 입력되면 이후 큐알코드를 스캔함으로써 복수의 무선센서들에 대하여 자동 등록이가능하다. 이를 통해 결국 무선센서의 구축 동작을 빠르게 진행할 수 있다. 상기한 내용 이외에도 도 10의 관리자 단말장치는 다양한 동작을 수행할 수 있으며, 기타 자세한 내용은 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모 든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하 나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램 으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일시적 저 장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발 명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2022-0077208", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2022-0077208", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 센서 주소 매핑 시스템을 나타내는 도면, 도 2 내지 도 6은 센서 주소 매핑 과정을 설명하기 위한 도면, 도 7은 본 발명의 실시예에 따른 센서 주소 매핑 과정을 나타내는 흐름도, 도 8은 도 1의 관리자 단말장치의 동작 과정을 나타내는 흐름도, 도 9는 본 발명의 실시예에 따른 센서 주소 매핑 장치의 세부구조를 예시한 블록다이어그램, 그리고 도 10은 도 9의 센서 주소 매핑 장치의 구동과정을 나타내는 흐름도이다."}
