{"patent_id": "10-2018-0165134", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0076235", "출원번호": "10-2018-0165134", "발명의 명칭": "인공지능형 상업용 주방 소화 시스템", "출원인": "유재경", "발명자": "유재경"}}
{"patent_id": "10-2018-0165134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "연료가스 감지 모듈, 화재감지 모듈 및 온도 감지 모듈을 포함하여 감시 대상 영역에서 발생되는 연료가스누출, 화재 발생 및 온도 변화를 포함하는 상황 정보를 생성하여 통신망을 통해 전송하는 정보 수집부;상기 정보 수집부에서 수집한 상황 정보를 이용하여 감시 대상 영역을 모니터링하고, 상기 정보 수집부를 제어하기 위한 제어 신호를 생성하여 전송하며, 연료가스 누출 및 화재 발생에 대한 알림 정보를 생성하여 전송하는관리서버부; 및 상기 관리서버부에서 생성한 알림 정보를 수신받는 개별 단말부;를 포함하되, 상기 관리서버부는, 상기 연료가스 감지 모듈에서 수집한 상황 정보를 이용하여 감시 대상 영역에서 발생하는 연료가스 누출을 모니터링하고, 상기 연료가스 감지 모듈에서 감지된 연료가스 감지값이 미리 설정된 범위를 초과하는 경우 연료가스누출이 발생한 것으로 평가하며, 연료가스 누출이 발생한 것으로 평가한 경우 연료가스의 공급을 차단하는 제어신호를 생성하여 전송하고, 상기 화재감지 모듈 및 온도 감지 모듈에서 수집한 상황 정보를 이용하여 감시 대상 영역에서 발생하는 화재를모니터링하고, 상기 화재감지 모듈에서 감지한 화재 감지값과 온도 감지 모듈에서 감지한 온도 감지값이 미리설정된 범위를 초과하는 경우 화재가 발생한 것으로 평가하며, 화재가 발생한 것으로 평가한 경우 발생한 화재를 진압하도록 소화 설비를 제어하는 제어 신호를 생성하여 전송하는 것을 특징으로 하는 인공지능형 상업용 주방 소화 시스템."}
{"patent_id": "10-2018-0165134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 온도 감지 모듈은, 감시 대상 영역에 구획별로 설치되는 복수 개의 온도 센서 및 온도 센서의 오작동을 감지하는 오작동 감지수단을 포함하는 것을 특징으로 하는 인공지능형 상업용 주방 소화 시스템."}
{"patent_id": "10-2018-0165134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 정보 수집부는, 지진감지 모듈, 영상촬영 모듈 및 음향감지 모듈로 이루어진 군으로부터 선택되는 1종 이상을 추가로 포함하는것을 특징으로 하는 인공지능형 상업용 주방 소화 시스템."}
{"patent_id": "10-2018-0165134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 정보 수집부는, 음성인식 모듈을 추가로 포함하는 것을 특징으로 하는 인공지능형 상업용 주방 소화 시스템."}
{"patent_id": "10-2018-0165134", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 인공지능형 상업용 주방 소화 시스템은, 연료가스 공급배관에 표지가스를 공급하는 표지가스 공급부 및 공개특허 10-2020-0076235-3-상기 표지가스를 감지하는 표지가스 감지 모듈을 추가로 포함하는 것을 특징으로 하는 인공지능형 상업용 주방소화 시스템."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 정보 수집부; 관리서버부; 및 개별 단말부;를 포함하며, 상업용 주방 시설에서 발생되는 가스누출 및 화재 발생에 대한 정확한 진단이 가능하고, 연료가스의 공급 제어와 화재를 진압하는 소화 설비의 동작을 제어할 수 있어 안전사고에 대한 즉각적인 대응과 예방이 관리하다. 또한, 표지가스를 공급하는 수단과 검출하는 수단이 추가로 구비되어, 연료가스 감지센서의 오작동으로 인해 발 생되는 오류를 보정할 수 있어 연료가스의 누출 여부를 정확히 평가할 수 있다. 또한, 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 가스누출 및 화재 발생 이외에도 지진 등의 위험 요소에 대한 상황 정보를 실시간으로 모니터링할 수 있을 뿐만 아니라, 가스 공급 설비의 교체 시기 또는 보수시 기를 파악할 수 있어 상업용 주방 시설을 통합관리할 수 있다."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 음식점, 공공기관 또는 기업체의 구내식당, 군부대 식당, 단체급식 시설 등과 같은 상업용 주방 시설 에서 발생되는 가스누출 및 화재 발생에 대한 정확한 진단이 가능하고, 연료가스의 공급 차단과 화재를 진압하 는 소화 설비의 제어가 가능하여 안전사고에 대한 즉각적인 대응과 예방이 가능한 인공지능형 상업용 주방 소화 시스템에 관한 것이다."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 음식점, 공공기관 또는 기업체의 구내식당, 군부대 식당, 단체급식 시설 등의 상업용 주방 시설은 단시간에 대량의 음식을 조리하여야 하므로, 일반 가정에서 사용되는 조리 도구와 달리 고화력 또는 대형 상업 용 주방 시설용 가스레인지를 사용하고 있다. 상업용 주방 시설에서 통상적으로 사용하고 있는 가스레인지는 복수 개의 노즐, 노즐에 가스를 공급하는 가스 공급배관, 가스 공급배관에 가스 공급을 조절하는 조절밸브, 가스 공급배관을 연결하는 배관 연결구 및 가스 점 화 장치를 포함하고, 조리시 강한 화력을 제공하기 위해서 복수 개의 가스레인지가 구비된 구조를 갖거나, 고화 력의 가스레인지가 구비되는 구조를 갖는다. 상업용 주방 시설에서 사용하는 가스레인지는 LPG 또는 LNG 등의 가연성 연료가스를 공급하여 사용하고 있으며, 외부로 누출될 경우 화재가 발생되는 문제가 있어 연료가스가 누설되는 것을 원천적으로 차단하는 것이 무엇보 다 중요하다. 하지만, 가스 공급배관과 조절밸브가 노후화된 상업용 주방 시설의 경우 연료가스가 누출될 가능성이 있으며, 연료가스는 밀폐된 환경에서 적재되어 폭발될 위험성이 있다. 최근에는 가스누출에 대비하기 위한 방안으로 가스누출 시 이를 감지하여 밸브를 차단하도록 가스누출 감지센서 를 설치하거나, 가스누출감지 경보기와, 밸브차단기 등을 구비한 시스템 등을 설치하여 가스가 누출된 후 경보 기가 울림과 동시에 가스레인지의 동작과 가스밸브를 차단하는 시스템이 도입되고 있다. 하지만, 기존의 시스템은 가스 감지센서가 오작동하여 가스누출 여부를 정확히 감지하지 못하는 경우가 빈번히 발생하고, 노후화된 가스 공급 설비의 보수 또는 교체시기를 정확히 파악하기 힘든 문제가 있어 이를 보완할 수 있는 방법에 대한 연구가 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1824030호 (공고일 : 2018.01.31) (특허문헌 0002) 한국공개특허 제10-2017-0127923호 (공개일 : 2017.11.22) (특허문헌 0003) 한국공개특허 제10-2009-0039368호 (공개일 : 2009.04.22)"}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 종래기술의 문제점을 해결하기 위해 안출된 것으로, 상업용 주방 시설에서 발생되 는 가스누출 및 화재 발생에 대한 정확한 진단이 가능하고, 연료가스의 공급 차단과 화재를 진압하는 소화 설비 를 제어하여 안전사고에 대한 즉각적인 대응과 예방이 가능한 인공지능형 상업용 주방 소화 시스템에 관한 기술 내용을 제공하고자 하는 것이다. 또한, 본 발명은 지진 등의 위험 요소에 대해 즉각적인 대응이 가능하고, 가스 공급 설비의 교체 시기 또는 보 수시기를 파악할 수 있도록 상황 정보를 제공하여 상업용 주방 시설을 통합적으로 관리할 수 있는 인공지능형 상업용 주방 소화 시스템에 관한 기술 내용을 제공하고자 하는 것이다."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 기술적 과제를 달성하기 위해서 본 발명은, 연료가스 감지 모듈, 화재감지 모듈 및 온도 감지 모듈을 포함하여 감시 대상 영역에서 발생되는 연료가스 누출, 화재 발생 및 온도 변화를 포함하는 상황 정보를 생성하여 통신망을 통해 전송하는 정보 수집부; 상기 정보 수집부에서 수집한 상황 정보를 이용하여 감시 대상 영역을 모니터링하고, 상기 정보 수집부를 제어하기 위한 제어 신호를 생성하여 전송하며, 연료가스 누출 및 화 재 발생에 대한 알림 정보를 생성하여 전송하는 관리서버부; 및 상기 관리서버부에서 생성한 알림 정보를 수신 받는 개별 단말부;를 포함하되, 상기 관리서버부는, 상기 연료가스 감지 모듈에서 수집한 상황 정보를 이용하여 감시 대상 영역에서 발생하는 연료가스 누출을 모니터링하고, 상기 연료가스 감지 모듈에서 감지된 연료가스 감 지값이 미리 설정된 범위를 초과하는 경우 연료가스 누출이 발생한 것으로 평가하며, 연료가스 누출이 발생한 것으로 평가한 경우 연료가스의 공급을 차단하는 제어 신호를 생성하여 전송하고, 상기 화재감지 모듈 및 온도 감지 모듈에서 수집한 상황 정보를 이용하여 감시 대상 영역에서 발생하는 화재를 모니터링하고, 상기 화재감지 모듈에서 감지한 화재 감지값과 온도 감지 모듈에서 감지한 온도 감지값이 미리 설정된 범위를 초과하는 경우 화재가 발생한 것으로 평가하며, 화재가 발생한 것으로 평가한 경우 발생한 화재를 진압하도록 소화 설비를 제 어하는 제어 신호를 생성하여 전송하는 것을 특징으로 하는 인공지능형 상업용 주방 소화 시스템을 제공한다. 본 발명의 바람직한 일실시예에 따라, 상기 온도 감지 모듈은, 감시 대상 영역에 구획별로 설치되는 복수 개의 온도 센서 및 온도 센서의 오작동을 감지하는 오작동 감지수단을 포함할 수 있다. 또한, 본 발명의 바람직한 일실시예에 따라, 상기 정보 수집부는, 화재감지 모듈, 지진감지 모듈, 영상촬영 모 듈 및 음향감지 모듈로 이루어진 군으로부터 선택되는 1종 이상을 추가로 포함할 수 있다. 또한, 본 발명의 바람직한 일실시예에 따라, 상기 정보 수집부는, 음성인식 모듈을 추가로 포함할 수 있다. 또한, 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 연료가스 공급배관에 표지가스를 공급하는 표지 가스 공급부 및 상기 표지가스를 감지하는 표지가스 감지 모듈을 추가로 포함할 수 있다."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 상업용 주방 시설에서 발생되는 가스누출 및 화재 발생 에 대한 정확한 진단이 가능하고, 연료가스의 공급 제어와 화재를 진압하는 소화 설비의 동작을 단시간에 제어 할 수 있어 안전사고에 대한 즉각적인 대응과 예방이 관리하다. 또한, 표지가스를 공급하는 수단과 검출하는 수단이 추가로 구비되어, 연료가스 감지센서의 오작동으로 인해 발 생되는 오류를 보정할 수 있어 연료가스의 누출 여부를 정확히 평가할 수 있다. 또한, 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 가스누출 및 화재 발생 이외에도 지진 등의 위험 요소에 대한 상황 정보를 실시간으로 모니터링할 수 있을 뿐만 아니라, 가스 공급 설비의 교체 시기 또는 보수 시기를 파악할 수 있어 상업용 주방 시설을 통합관리할 수 있다."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 '상업용 주방 시설'은 일반적으로 음식점, 공공기관 또는 기업체의 구내식당, 군부대 식당, 단체 급식 시설 등에서는 단시간에 대량의 음식을 조리하기 위해서 실내에 가스레인지 등의 가열 장치가 설치된 장소 를 의미하는 것이다. 이하, 본 발명을 상세히 설명하도록 한다. 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은 정보 수집부; 관리서버부; 및 개별 단말 부;를 포함한다. 정보 수집부는 상업용 주방 시설의 감시 대상 영역에 설치되어 연료가스 누출, 화재 발생 및 온도 변화 여 부를 확인할 수 있도록 상황 정보를 수집하여 통신망을 통해 관리서버부로 전송하는 역할을 하며, 연료가 스 감지 모듈, 화재감지 모듈 및 온도 감지 모듈을 포함한다. 연료가스 감지 모듈은 연료가스를 감지하기 위해서 복수 개의 연료가스 감지센서를 포함하며, 연료가스 감 지센서는 가스 공급배관, 조절밸브, 배관 연결구 등에서 누출되는 연료가스를 감지하여 누출되는 연료가스의 농 도 등을 포함하는 연료가스 측정값을 생성하고, 후술할 관리서버부에 연료가스 측정값을 전송하는 역할을 한다. 연료가스 감지센서는 감시 대상 영역에서 누출되는 연료가스를 감지하기 위해서 통상적으로 사용되는 다양한 형 태의 연료가스 감지센서를 도입하여 사용할 수 있다. 일례로, 연료가스 감지센서는 가스의 흡착이나 반응에 의한 고체 물성의 변화를 이용하는 반도체 센서, 세라믹 온습 센서, 압전 센서 등을 사용하거나, 연소열을 이용하는 접촉 연소식 센서를 이용하거나, 전기화학 반응을 이용하는 고체 전해질 센서, 전기화학 센서를 이용하거나, 또는, 물리적인 특성값을 사용하는 적외선 흡수식 센 서 등을 이용할 수 있으며, 설치되는 지점 및 위치에 적합한 종류의 센서를 선택적으로 도입하여 사용할 수 있 다. 특히, 연료가스 감지센서는 메탄(CH4), 프로판(C3H8), 부탄(C4H10), 산소(O2), 수소(H2), 이산화탄소(CO2) 또는 이 들의 혼합 가스를 검출할 수 있으며, 이에 의해, LPG(액화 석유 가스), LNG(액화 천연 가스), CNG(압축 천연 가 스) 등과 같은 연료가스를 정확히 검출할 수 있다. 또한, 연료가스 감지 모듈은 가스누출을 정확히 검출하기 위해 1종 이상의 연료가스 감지센서를 도입하여 사용할 수도 있다. 화재감지 모듈은 상업용 주방 시설에서 화재가 발생한 경우 화재 감지값을 포함하는 상황 정보를 생성해 후술할 관리서버부에 전송하도록 하여 위험 상황에 대응하도록 구성할 수 있다. 화재감지 모듈은 감시 대상 영역에서 발생되는 화재를 감지하기 위해서, 감시 대상 영역에 설치되는 복수 개의 화재 감지센서를 포함하며, 통상적으로 사용되는 다양한 형태의 화재 감지센서를 도입하여 사용할 수 있다. 구체적으로, 화재감지 모듈은 연기 감지센서, 불꽃 감지센서 또는 이들 센서를 모두 포함하는 화재 감지센 서를 사용할 수 있으며, 화재 감지값은 연기 발생량, 연기 농도, 불꽃의 강도 및 불꽃의 크기를 포함하는 감시 대상 영역의 상황 정보를 의미한다. 연기 감지센서는 감시 대상 영역에서 화재 발생시 생성되는 연기를 감지하며, 연기 발생량 또는 농도를 측정해 관리서버부에 전송하는 역할을 하며, 관리서버부는 감시 대상 영역에서 연기 발생량 또는 연기의 농 도를 포함하는 화재 감지값이 미리 설정된 수치를 초과할 경우 화재가 발생한 것으로 평가할 수 있다. 불꽃 감지센서는 감시 대상 영역에서 화재 발생시 생성되는 불꽃을 감지하며, 감지된 불꽃의 강도 및 크기를 감 지해 관리서버부에 전송하는 역할을 하고, 관리서버부는 감시 대상 영역에서 발생한 불꽃의 강도 및 크기를 포함하는 화재 감지값이 미리 설정된 범위를 초과할 경우 화재가 발생한 것으로 평가할 수 있다. 온도 감지 모듈은 감시 대상 영역에 설치되는 복수 개의 온도 센서를 포함하여 온도를 감지하고, 감지한 온도 감지값을 관리서버부로 전송하는 역할을 한다. 온도 감지 모듈은 감시 대상 영역에서 발생한 화재로 인해 온도 감지 모듈에서 감지한 온도 감지값이 미리 설정된 온도 범위를 초과할 경우 관리서버부에서는 화재가 발생한 것으로 평가할 수 있다. 특히, 온도 감지 모듈은 전술한 화재감지 모듈과 같이 동작하여 화재감지 모듈의 오작동을 감지 하여 정확한 화재 관련 상황 정보를 확인할 수 있도록 한다. 일례로, 화재감지 모듈에서 측정한 화재 감지값이 미리 설정된 범위를 초과할 경우, 관리서버부는 온 도 감지 모듈의 온도 감지값을 동시에 확인하며, 감시 대상 영역의 온도가 급격히 상승한 것으로 확인되는 경우 화재가 발생한 것으로 평가하며, 이와 같은 방법을 통해서 정확한 화재 감지가 가능한 구조를 형성하도록 한다. 역으로, 화재감지 모듈에서 측정한 화재 감지값이 미리 설정된 범위를 초과할 경우, 온도 감지 모듈 의 온도 감지값을 확인하여 감시 대상 영역의 온도가 변화되지 않은 것으로 확인되는 경우 화재감지 모듈의 오작동으로 인해 발생된 것인지 정확하게 판별하기 위해, 관리서버부는 관리자 단말기에 해당 정보를 전송하도록 한다. 또한, 온도 감지 모듈은 감시 대상 영역에 설치되는 복수 개의 온도 센서 및 오작동 감지수단을 포함하여 온도 센서의 오작동으로 인해 발생하는 부정확한 정보의 생성을 방지하는 구조를 갖는 것을 사용하여 오류 정보 의 발생을 최소화할 수 있다. 일례로, 온도 감지 모듈은 감시 대상 영역에서 순차적으로 설치되는 복수 개의 온도 센서 및 감시 대상 영 역에 설치된 온도 센서를 특정 구획별로 나누어 관리하고 동일 구획에 속하거나, 인접하는 각각의 온도 센서에 서 감지되는 온도 감지값들을 비교하여 온도 감지값이 미리 설정된 오차범위를 초과하는 것으로 확인되는 경우 이를 관리서버부로 전송하여 관리자가 감시 대상 영역에 설치되는 온도 센서의 오작동 발생 여부를 확인할 수 있도록 한다. 또는, 온도 감지 모듈은 감시 대상 영역에서 순차적으로 설치되는 복수 개의 온도 센서, 복수 개의 온도 센서와 선택적으로 연결되는 스위치가 구비된 제어보드, 온도 센서에서 발생하는 저항을 측정하는 저항 측정기, 상기 스위치 및 저항 측정기의 동작을 제어하는 제어 유닛을 포함하는 구조를 갖는 것을 사용할 수 있다. 상기와 같은 구조를 갖는 온도 감지 모듈은 복수 개의 온도 센서와 연결된 스위치가 제어 유닛에 의해 제 어되어 순차적으로 연결되도록 개폐동작하고, 저항 측정기는 스위치에 의해 연결된 온도 센서에서 감지되는 저 항을 각각 측정하며, 저항이 상이하게 측정되는 온도 센서를 제어 유닛이 확인하도록 하며, 저항이 상이한 온도 센서가 확인되는 경우 이를 관리서버부로 전송하여 관리자가 감시 대상 영역에 설치되는 온도 센서의 오작 동 발생 여부를 확인할 수 있도록 한다."}
{"patent_id": "10-2018-0165134", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 정보 수집부는 음향감지 모듈을 추가로 포함하도록 구성할 수 있다. 음향감지 모듈은 가스 공급배관, 조절밸브 또는 배관 연결구의 누출부위에서 발생하는 누출음을 검출하기 위한 구성 요소로서, 가스 공급배관, 조절밸브 또는 배관 연결구의 수명을 산출하여 정확한 보수 또는 교체시기 를 확인할 수 있도록 한다. 구체적으로, 가스 공급배관, 조절밸브, 배관 연결구 상에 누출부위가 발생한 경우, 연료가스가 누출되어 누출음 이 발생되며, 음향감지 모듈은 누출부위에서 발생하는 누출음을 감지하여 음향 정보를 수집하는 역할을 한 다. 이를 위해, 음향감지 모듈은 누출음을 감지하는 음향 센서를 포함하며, 음향 센서는 가스 공급배관, 조절 밸브, 배관 연결구 상에 설치하여 누출음을 검출할 수 있으며, 검출한 누출음에 대한 음향 감지값을 생성하여 후술할 관리서버부로 전송할 수 있고, 음향 센서는 필요에 따라 복수 개 설치할 수 있다. 또한, 정보 수집부는 지진감지 모듈을 추가로 포함하도록 구성할 수 있다. 지진감지 모듈은 업소의 감시 대상 영역에서 발생되는 지진을 감지하여 지진 감지값을 전송할 수 있으며, 지진을 감지하기 위해 통상적으로 사용되는 다양한 형태의 지진 감지센서를 복수 개 도입하여 사용할 수 있다. 바람직하게는, 지진감지 모듈은 지진의 진동 감지를 위해서, X축, Y축 및 Z축을 포함하는 3축의 진동을 감 지하는 3축 진동 감지센서 또는 0.1 내지 50 Hz 영역의 저주파에 의한 미세한 세기의 진동을 계측할 수 있는 MEMS 센서(micro electro mechanical systems sensor)를 포함할 수 있으며, 바람직하게는, 3축 진동 감지센서 를 도입하여 사용할 수 있다. 상기와 같은 지진감지 모듈은 감시 대상 영역에서 감지한 진동 감지값을 후술할 관리서버부에서 전송 하며, 관리서버부에서는 감지한 진동 감지값이 미리 설정된 범위를 초과하는 경우 지진 발생이 발생한 것으로 평가하고, 연료가스의 공급을 중단하는 제어 신호를 전송하도록 하여 연료가스의 누출을 방지하도록 구성 할 수 있으며, 개별 단말부에 해당 이벤트 정보를 전송하여 위기 상황에 대응하도록 구성할 수 있다. 또한, 정보 수집부는 영상촬영 모듈을 추가로 포함하도록 구성할 수 있다. 영상촬영 모듈은 감시 대상 영역에 복수 개 설치되어 감시 대상 영역을 촬영하고, 배관, 배관 연결구, 조 절 밸브, 저장 탱크 등에 대한 영상 이미지를 생성하여 전송하는 역할을 하며, 감시 대상 영역에서 발생하는 가 스누출, 화재 발생 여부의 평가를 보조하는 역할을 한다.이를 위해, 영상촬영 모듈은 감시 대상 영역에 대한 영상 이미지를 생성하는 디지털 카메라, 열화상 카메 라 또는 이들을 모두 포함할 수 있다. 구체적으로, 디지털 카메라는 가스 공급배관, 조절밸브, 배관 연결구의 외형을 촬영하여 연료가스가 누출되는 경우, 연료가스가 누출되는 지점을 탐색하고, 해당 지점을 촬영하는 역할을 한다. 디지털 카메라는 고해상도 화 소로 이루어진 CMOS 또는 CCD 이미지 센서를 구비하는 CCTV용 디지털 카메라를 도입하여 사용할 수 있고, 해당 CCTV용 디지털 카메라는 사용자의 조작 또는 외부 신호에 의한 줌인/줌아웃(zoom in/zoom out) 등과 같은 렌즈 구동이 가능한 형태일 수 있고, 이외에도 디지털 카메라의 몸체를 소정 모터와 결합하여 외부 모터 제어 신호에 의해 상, 하, 좌, 우 방향으로 구동하는 구조를 갖는 것을 사용할 수 있다. 특히, CCTV용 디지털 카메라는 수신되는 영상 정보는 RGB 모델, HSV 모델, YCbCr 모델 등과 같은 다양한 영상 신호 포맷을 가질 수 있으며, 휘도, 색차 등을 이용해 해상도를 높이도록 하여 연료가스의 누출로 인해 발생되 는 기류, 온도차, 또는, 화재 발생으로 인한 화염, 불꽃, 연소 상황 등을 촬영하여 감시 대상 영역에 대해 보다 정확한 영상 이미지 정보를 관리서버부로 전송할 수 있도록 한다. 열화상 카메라는 적외선 감지 방식으로 감시 대상 영역에서 가스누출시 가스가 누출되는 지점에 대한 열화상 데 이터를 생성하여 수집하는 역할을 하며, 이와 같은 열화상 데이터는 가스가 배관 또는 저장 탱크 등에서 누출될 때 급격한 온도 차이가 발생하게 되어 증기가 급속히 누출되는 고정 영상 또는 동영상 이미지를 수집할 수 있으 며, 화염이나 불꽃이 발생된 경우 급격한 온도 차이가 발생하게 되어 이를 나타내는 열화상 이미지를 획득할 수 있도록 한다. 이를 위해, 열화상 카메라는 감시 대상 영역의 영상을 촬영하며, 적외선 광원을 포함하여 특정 파장 별로 분할 하는 역할을 수행할 수 있고, 획득한 영상을 분석하여 화재 발생, 가스누출 여부를 감지하도록 구성할 수 있으 며, 촬영된 영상 내에 특정 가스의 분포를 표시하는 가스 분포 이미지를 생성할 수도 있다. 또한, 영상촬영 모듈에 구비되는 디지털 카메라 또는 열화상 카메라는 상, 하, 좌, 우 방향으로 회전이 가 능하도록 마련되며, 연료가스 감지 모듈의 연료가스 감지센서에서 가스누출, 화재 발생 등과 같이 이상 상 황이 감지될 경우, 관리서버부가 상기 카메라의 방향을 해당 연료가스 감지센서가 위치하는 지점을 촬영할 수 있도록 회전시키도록 구성하여 감시 대상 영역을 촬영하도록 제어할 수 있다. 또한, 정보 수집부는 표지가스 감지 모듈을 추가로 포함하도록 구성할 수 있다. 표지가스 감지 모듈은 연료가스의 누출 여부를 정확히 평가하기 위해 구비되는 구성요소로써, 감시 대상 영역에서 연료가스의 누출 여부를 정확히 확인할 수 있도록 연료가스 감지 모듈을 보조하는 역할을 한다. 표지가스 감지 모듈은 표지가스를 감지하는 복수 개의 표지가스 감지센서를 포함할 수 있으며, 바람직하게 는, 상기 표지가스 감지 모듈은 질소 감지센서를 포함하여 가스 공급배관 상에서 누출되는 질소 가스를 감 지할 수 있고, 표지가스에 대한 상세한 설명은 후술할 표지가스 공급부 부분에서 상세히 설명하도록 한다. 또한, 정보 수집부는 음성인식 모듈을 추가로 포함하도록 구성할 수 있다. 음성인식 모듈은 상업용 주방 시설 내에서 음성을 인식하여 화재 발생 여부를 정확하게 평가할 수 있도록 보조하는 구성 요소로서, 상업용 주방 시설을 이용하고 있는 작업자의 음성을 입력받아 음성 신호로 변환하고, 음성 신호에 미리 저장된 이벤트 용어가 포함되어 있는지 여부를 판단하며, 작업자의 음성에 이벤트 용어가 포 함되어 있는 것으로 판단되는 경우 관리서버부로 음성 신호를 전송하여 상업용 주방 시설에서 발생한 화재 를 정확하게 평가할 수 있도록 하고, 평가 모듈은 음성인식 모듈을 음성 신호를 수신 받아 상업용 주 방 시설에서 화재가 발생한 것으로 평가할 수 있다. 이를 위해, 음성인식 모듈은 마이크 유닛, 음성신호 처리 유닛 및 음성 저장 유닛을 포함하는 구조를 갖는 다. 구체적으로, 마이크 유닛은 상업용 주방 시설의 감시 대상 영역에 설치되어 상업용 주방 시설을 이용하고 있는 작업자의 음성을 수신하여 증폭시키고, 음성 신호를 생성하는 역할을 한다. 음성신호 처리 유닛은 마이크 유닛을 통해 입력된 음성을 음성신호로 변환하고, 음성 저장 유닛에 저장된 데이 터에 기초하여 작업자의 음성 신호에서 화재에 관련한 이벤트 용어가 포함되어 있는지 여부를 판단한다. 음성 저장 유닛은 이벤트 용어를 저장하여 화재 발생에 관련된 음성을 식별하기 위한 정보를 포함하며, 화재에 관련된 이벤트 용어는 단어 또는 문장일 수 있고, 이벤트 용어는 음성 설정 내용에 관한 정보를 저장할 수도 있으며, 상업용 주방 시설을 비상 제어하기 위한 제어 음성에 관련된 정보를 포함할 수도 있다. 보다 구체적으로, 음성신호 처리 유닛은 마이크 유닛에서 생성한 음성 신호와 음성 저장 유닛에 저장된 이벤트 용어를 비교하고, 음성 신호와 이벤트 용어가 대응되거나, 일치하는 것으로 판단되는 경우 화재 발생 신호를 생 성하여 통신망을 통해 관리서버부로 생성한 화재 발생 신호를 전송할 수 있다. 본 발명의 바람직한 일실시예에 따라, 음성신호 처리 유닛은 상업용 주방 시설에서 이벤트 용어와 대응되는 음 성이 2회 이상 발생되었는지 여부를 확인하고, 이벤트 용어와 대응되는 음성이 2회 이상 수신되는 경우에만 관 리서버부로 전송하도록 제어할 수 있다. 또는, 이벤트 용어와 대응되는 음성이 미리 설정된 시간(예를들면, 2 내지 10초) 이내에 2회 이상 반복하여 수 신되는지 여부를 판단하고, 미리 설정된 시간 이내에 2회 이상 반복 수신되는 경우에만, 화재 발생 신호를 생성 하여 관리서버부로 전송하도록 하여 화재 발생을 정확히 평가하기 위한 보조 기능을 수행할 수 있으며, 이 와 같은 구성을 통해서, 음성신호 처리 유닛은 상기와 같은 구성을 통해서 작업자의 실수나 장난, 작업자의 음 성이 아닌 TV, 라디오 등에서 나오는 음성으로 인한 오작동을 방지할 수 있다. 본 발명의 바람직한 일실시예에 따라, 음성신호 처리 유닛은 이벤트 용어와 대응되는 음성이 2회 이상 입력되었 는지 여부와 함께 음성 신호의 크기를 고려하여 화재 발생 신호의 생성을 제어할 수도 있다. 일례로, 음성신호 처리 유닛은 이벤트 용어와 대응되는 음성 신호가 미리 설정된 시간(예를들면, 2 내지 10초) 이내에 2회 이상 반복 수신되는지 여부를 확인하고, 반복 수신된 음성 신호 중에서 한개 이상이 미리 설정된 음 성 크기 이상인 것으로 판단되는 경우에만 화재 발생 신호를 관리서버부로 전송하도록 제어할 수 있다. 작 업자의 음성은 음파를 생성하게 됨에 따라, 음파의 특징은 소리의 세기(소리의 진폭), 소리의 높낮이(소리의 주 파수), 소리의 맵시(음파의 모양)의 3 요소로 정의되며, 입력된 음성의 세기를 측정하면 음성의 크기를 산출할 수 있다. 따라서, 상기와 같은 구성을 통해서, 작업자가 비상상황에서 소리치는 큰 음성이 아니라 일상 대화 중의 작은 음성으로 의도하지 않게 이벤트 용어에 해당하는 단어나 문장을 발성하는 경우에 의도하지 않은 음성 신호의 전 달을 더욱 정확하게 방지할 수 있다. 상기 이벤트 용어는, '불이야!', '불났어요!', '화재요!', '사람 살려', 등과 같은 화재 관련 음성 언어를 포함 할 수 있다. 상기한 바와 같은 연료가스 감지 모듈, 화재감지 모듈, 온도 감지 모듈, 음향감지 모듈, 지진감지 모듈, 영상촬영 모듈 및 표지가스 감지 모듈은 각각 센서에서 수집한 아날로그 데이터 를 증폭하는 증폭 유닛, 증폭 유닛을 통해 증폭한 아날로그 데이터에서 노이즈 등과 같이 신호와 관련 없는 데 이터를 제거하기 위한 저역 필터(low pass filter) 유닛과, 저역 필터 유닛을 통해 필터링한 아날로그 데이터를 디지털 데이터로 변환하기 위한 아날로그-디지털 변환 유닛(A/D converter) 등을 추가로 포함할 수 있다. 그리고, 연연료가스 감지 모듈, 표지가스 감지 모듈, 음향감지 모듈, 화재감지 모듈, 지진 감지 모듈, 영상촬영 모듈, 표지가스 감지 모듈 및 음성인식 모듈 은 각각 구동을 제어하 는 동작 제어 유닛을 포함할 수 있다. 전술한 동작 제어 유닛은 후술할 관리서버부에서 통신망을 통해 송신되는 제어 신호를 수신 받아 연료가스 감지 모듈, 표지가스 감지 모듈, 음향감지 모듈, 화재감지 모듈, 지진감지 모듈, 영 상촬영 모듈, 표지가스 감지 모듈 및 음성인식 모듈 각각의 동작을 제어할 수 있다. 또한, 동작 제어 유닛은 미리 설정된 시간 간격별로 연료가스 감지 모듈, 표지가스 감지 모듈, 음향 감지 모듈, 화재감지 모듈, 지진감지 모듈, 영상촬영 모듈, 표지가스 감지 모듈 및 음성인식 모듈에서 생성한 상황 정보를 관리서버부로 전송할 수 있도록 전송 패턴을 조절하는 역할 또한 수행할 수 있다. 구체적으로, 동작 제어 유닛은 정보 수집부에서 수집한 상황 정보를 관리서버부로 전송하기 위한 조 건을 설정하는 역할을 하며, 실시간 스트리밍 방식, 주기적인 전송 시간, 년·월·일·시 별로 지정된 시간 단 위 별로 수집한 상황 정보를 전송할 수 있으며, 관리서버부에서 동작 제어 유닛의 구동을 제어할 수 있도 록 구성되어 이벤트 정보를 전송하기 위한 조건을 변경할 수도 있다. 나아가, 연료가스 감지 모듈, 화재감지 모듈, 온도 감지 모듈, 음향감지 모듈, 지진감지 모듈, 영상촬영 모듈, 표지가스 감지 모듈 및 음성인식 모듈은 각각 감시 대상 영역에 복 수 개 설치되는 고정형 센서를 포함하며, 설치되는 센서는 각각을 식별할 수 있는 식별 정보, 설치 위치 등을 포함하는 고유 정보를 포함할 수 있으며, 각각 개별적으로 구비되는 통신유닛을 포함하여 통신망을 통해 생성한 상황 정보를 관리서버부로 전송할 수 있다. 또한, 정보 수집부는 연료가스 감지 모듈, 화재감지 모듈, 온도 감지 모듈, 음향감지 모듈 , 지진감지 모듈, 영상촬영 모듈, 표지가스 감지 모듈 및 음성인식 모듈 각각에 전원 을 공급하는 전원 공급 모듈을 포함하며, 전원 공급 모듈은 유선으로 연결되어 각각의 모듈에 전원을 공급하도록 구성할 수 있다. 또는, 전원 공급 모듈은 태양에너지, 진동에너지, 풍력에너지 또는 이들을 혼 합 도입한 에너지를 이용한 자가발전 방식을 통해 전원을 공급하는 자가 발전식 전원 공급 모듈일 수 있으 며, 자가 발전식 전원 공급 모듈은 태양광, 진동에너지, 풍력에너지 등에서 수집하여 저장한 에너지를 저 장하는 축전지를 구비할 수 있다. 또한, 본 발명에 따른 인공지능형 상업용 주방 소화 시스템에서 통신망(communication section)은 유선 통 신망과 무선 통신망을 모두 포함할 수 있으나, 무선 통신망을 통한 송수신 방법을 채용하는 것이 바람직하다. 한편, 관리서버부는, 정보 수집부에서 수집한 상황 정보를 이용하여 감시 대상 영역을 모니터링하고, 제어 신호를 생성하여 전송하며, 위기 상황에 대응할 수 있도록 연료가스 누출 및 화재 발생에 대한 알림 정보 를 생성하여 후술할 개별 단말부로 전송하는 역할을 한다. 이를 위해, 관리서버부는 평가모듈을 포함하며, 평가모듈은 연료가스 감지 모듈에서 연료 가스 감지값을 수신 받아, 연료가스 감지값이 미리 설정된 범위를 초과할 경우 연료가스 누출에 대한 알림 정보 를 생성하여 개별 단말부로 생성한 알림 정보를 전송하도록 한다. 또한, 관리서버부는, 정보 수집부에서 전송한 상황 정보를 수신 받아 화재가 발생되었는지 여부를 평 가하고, 화재가 발생된 것으로 평가되는 경우 제어 신호를 생성하여 가스 공급배관에서 연료가스의 공급을 차단 하도록 제어하고, 화재 발생에 대한 알림 정보를 생성하며, 위기 상황에 대응할 수 있도록 후술할 개별 단말부 로 생성한 알림 정보를 전송할 수 있다. 이를 위해, 평가모듈은 화재감지 모듈에 구비된 연기 감지센서 및 불꽃 감지센서와 온도 감지 모듈의 온도 센서에서, 연기, 불꽃, 온도에 대한 감지값을 각각 수신 받아, 수신된 화재 감지값이 미리 설정된 범위를 초과할 경우 감시 대상 영역에 화재 발생에 대한 알림 정보를 생성하여 개별 단말부로 생성한 알림 정보를 전송하도록 하고, 이와 동시에, 가스 공급배관을 통한 가스 공급을 차단하는 제어 신호를 전송하여 가스 공급을 차단할 수 있도록 하며, 소방서를 포함하는 관련 기관에도 알림 정보를 송신하여 위기 상황에 빠른 대처가 가능 하도록 한다. 아울러, 평가모듈은 화재감지 모듈의 오작동에 의한 오류 정보를 보정하기 위해서, 온도 감지 모듈 에서 감지한 온도 감지값을 동시에 확인하여 감시 대상 영역에서 온도가 급격히 변화한 것으로 확인되는 경우 화재가 발생한 것으로 평가하고, 온도가 변화하지 않은 것으로 확인되는 경우 화재감지 모듈의 오작동으로 인해 발생된 것으로 평가하고, 이를 정확히 판별할 수 있도록 영상촬영 모듈의 구동을 제어하여 확인할 수 있도 록 하며, 관리자 단말기에 해당 정보를 전송하도록 한다. 또한, 관리서버부는, 정보 수집부에서 전송한 상황 정보를 수신 받아 연료가스의 누출 여부를 평가하 고, 가스 공급배관, 조절밸브, 배관 연결구의 수명을 산출하여 정확한 보수 또는 교체시기를 산정하여 개별 단 말부로 생성한 정보를 전송하도록 구성할 수 있다. 이를 위해, 평가모듈은 음향감지 모듈에서 음향 감지값을 수신 받아, 음향 감지값이 미리 설정된 임 계값 이상일 경우 가스 공급배관, 조절밸브, 배관 연결구의 특정 지점에 가스가 누출되는 것으로 평가하고, 연 료가스 감지 모듈의 역할을 보조하여 연료가스 누출에 대한 알림 정보를 생성하며, 개별 단말부에 생 성한 알림 정보를 전송하도록 하고, 이와 동시에, 제어 신호를 생성하여 조절밸브를 제어하여 연료가스의 공급 을 차단시킬 수 있다. 또한, 평가모듈은 음향감지 모듈에서 전송한 음향 신호를 수신받아 누출음에 대한 신호를 검출하고, 음향 신호를 변환하여 주파수 영역의 파형으로 변환시킬 수 있으며, 미리 설정된 수치 이상의 진폭을 갖는 주파 수 성분을 검출하고, 주파수간의 진폭을 누출음에 대한 주파수 정보로 생성하여 제공할 수 있으며, 주파수 정보 는 복수의 주파수에 대한 진폭을 포함할 수 있다.구체적으로, 주파수 정보는 연료가스가 누출되는 정도 또는 양에 따라 음향이 상이하게 발생되고, 연료가스가 누출되는 정도 또는 양에 따라 주파수 성분과 진폭이 상이하게 나타난다. 일례로, 연료가스의 누출부위의 크기 가 작을수록 고주파 성분이 나타나고, 누출부위의 크기가 클 경우에는 저주파 성분이 나타난다. 또한, 누출음은 누출부위의 크기 또는 갯수에 따라 진폭 또한 상이한 특성을 보이며, 누출부위의 크기 및 개수 에 따라 공명하는 누출음 또한 상이한 값을 나타내며 이를 주파수 성분과 진폭을 통해 평가하여 누출정도를 평 가할 수 있다. 상기와 같은 원리를 이용하여, 평가모듈은 발생한 음향의 주파수 정보에 포함된 주파수 성분을 후술할 저 장모듈에 저장된 상관관계 그래프를 기준으로 대비하여 주파수 성분에 대응되는 수명을 산출하고, 이를 잔 여수명으로 제공할 수 있다. 또는, 저장모듈은 주파수 진폭과 수명과의 상관관계에 따라 미리 설정된 패턴의 상관관계 그래프를 저장할 수 있으며, 평가모듈은 주파수 정보에 포함된 주파수 성분의 진폭을 저장모듈에 미리 저장된 진폭과 수명 의 상관관계에 따른 상관관계 그래프를 기준으로 대비하여 주파수 성분의 진폭에 대응되는 수명을 산출하여, 이 를 잔여수명으로 제공할 수도 있다. 그리고, 평가모듈은 주파수 정보에 포함된 주파수 성분 중 최대 주파수(peak frequency) 및 최대 주파수의 진폭을 이용하여 상관관계 그래프와 대비하여 잔여수명을 산출할 수도 있다. 이에 따라, 평가모듈은 배관 또는 조절밸브에서 검출되는 누출음을 포함하는 음향 정보를 이용해 배관 또 는 조절밸브의 잔여 수명을 제공함으로써, 교체 또는 보수가 임박하였는지 여부를 평가할 수 있다. 나아가, 저장모듈에 저장된 상관관계 그래프는 배관, 배관 연결구 또는 조절밸브의 구조, 환경적인 조건 등에 따라 상이한 패턴을 가지도록 구성될 수 있으며, 음향 센서는 고유식별정보를 포함하여 정확한 위치를 표 시할 수 있다. 잔여수명은 전체수명과 경과시간의 차이로 정의될 수 있으므로, 평가모듈은 상관관계 그래 프에 따른 전체수명에서 경과시간과의 차이를 연산하여 배관, 배관연결구, 조절 밸브의 경과시간과 잔여수명을 상호 대응시킬 수 있다. 이때, 전체수명은 상관관계 그래프에 따라 상이하게 미리 설정될 수 있다. 또한, 관리서버부는, 정보 수집부에서 전송한 상황 정보를 수신 받아 지진이 발생되었는지 여부를 평 가하고, 지진이 발생된 것으로 확인되는 경우 제어 신호를 생성하여 가스 공급배관에서 연료가스의 공급을 차단 하도록 제어하고, 위기 상황에 대응할 수 있도록 후술할 개별 단말부로 생성한 알림 정보를 전송할 수 있 다. 이를 위해, 평가모듈은 지진감지 모듈에서 감지된 진동 감지값을 수신받아, 수신된 진동 감지값이 미 리 설정된 범위를 초과하고, 미리 설정된 시간 이상 지속될 경우 감시 대상 영역에 지진이 발생한 것으로 평가 하고, 감시 대상 영역에 지진 발생에 대한 알림 정보를 생성하여 개별 단말부로 생성한 알림 정보를 전송 하도록 하고, 이와 동시에, 가스 공급배관을 통한 가스 공급을 차단하는 제어 신호를 전송하여 가스 공급을 차 단할 수 있도록 하며, 위기 상황에 대응할 수 있도록 한다. 또한, 관리서버부는, 감시 대상 영역에 연료가스 누출, 화재, 지진 발생을 포함하는 이벤트가 발생된 것으 로 평가되는 경우, 연료가스 감지 모듈, 화재감지 모듈, 온도 감지 모듈, 음향감지 모듈, 지진감지 모듈의 오작동 또는 동작 이상으로 인해 발생되는 오차를 보정하고 체크할 수 있다. 구체적으로, 관리서버부에 구비되는 평가모듈은 연료가스 누출, 화재, 지진이 발생한 것으로 평가한 경우 영상촬영 모듈을 제어하는 제어 신호를 생성하고, 생성한 제어 신호를 통신망을 통해 영상촬영 모듈 의 동작 제어 유닛에 전송하여 영상촬영 모듈의 동작을 턴온 또는 턴오프하도록 제어할 수 있으며, 영상촬영 모듈을 통해 영상 정보를 수신 받아 화재 발생 여부를 정확하게 평가할 수도 있다. 구체적으로, 평가모듈은 영상촬영 모듈의 동작을 제어하여 디지털 카메라 또는 열화상 카메라가 감시 대상 영역을 촬영할 수 있도록 디지털 카메라 또는 열화상 카메라를 상, 하, 좌, 우 방향으로 구동시켜 감시 대 상 영역을 촬영하도록 제어할 수 있으며, 연료가스 누출, 화재 발생, 지진 발생 여부를 영상촬영 모듈을 통해 재확인할 수 있도록 하여 모듈 각각의 오작동 여부를 정확하게 판별할 수 있도록 한다. 또한, 평가모듈은 음성인식 모듈에서 전송한 화재 발생 신호를 수신하여 화재 발생을 더욱 정확하게 평가할 수 있으며, 음성인식 모듈에서 화재 발생 신호가 수신되는 경우에도 영상촬영 모듈의 동작을 제어할 수 있도록 하여 화재 발생 여부를 더욱 정확하게 평가할 수 있도록 구성할 수 있다.나아가, 관리서버부는 연료가스 감지센서의 오작동으로 인한 오류를 단시간에 확인할 수 있도록 하여 연료가스 누출 여부를 정확하게 판별하고, 오류 정보의 전달을 예방할 수 있도록 한다. 이를 위해, 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은 표지가스 공급부를 추가로 포함할 수 있으며, 표지가스 공급부는 가스 공급배관의 일측에 연결되어 연료가스 공급배관 내부에 표지가스를 공 급하도록 하는 구성요소이다. 구체적으로, 표지가스 공급부는 표지가스를 저장하는 표지가스 저장탱크를 포함하며, 표지가스 저장탱크는 연료가스 공급배관과 연결되어, 연료가스 공급배관을 통해 연료가스가 공급되는 과정 중에 표지가스를 주입할 수 있다. 또한, 표지가스 공급부는 관리서버부의 평가모듈로부터 제어 신호를 전달받아 표지가스 저장탱 크의 구동을 턴온(TURN ON) 또는 턴오프(TURN OFF)하여 연료가스 공급배관을 통해 표지가스를 공급하도록 하는 제어 모듈을 포함하여 표지가스와 연료가스의 혼합 가스가 가스 공급배관을 통해 이송되도록 할 수 있다. 이때, 정보 수집부에 구비되는 표지가스 감지 모듈은 표지가스 공급부에서 공급되는 표지가스를 감지하는 역할을 하며, 표지가스 감지 모듈이 연료가스 감지 모듈과 같이 연료가스 공급배관, 조절밸 브, 배관 연결구 상에 설치되어, 설치된 지점에서 표지가스가 검출되는지 여부를 확인하여 연료가스의 누출여부 를 정확하게 확인할 수 있도록 보조하는 역할을 한다. 보다 구체적으로, 관리서버부는 연료가스 감지 모듈에서 전송받은 연료가스 감지값을 이용해 연료가 스가 누출되고 있는 것으로 평가한 경우, 평가모듈은 표지가스 공급부의 구동을 턴온시키는 제어 신 호를 발생하여 표지가스 공급부에 전송하도록 하고, 제어 신호를 전송 받은 표지가스 공급부는 가스 공급배관에 표지가스를 공급하여 연료가스 공급배관에 표지가스 및 연료 가스의 혼합 가스가 이송되도록 한다. 연료가스 공급배관을 통해 이송되는 혼합 가스는 연료가스 공급배관 상에서 누출되는 지점에서 표지가스가 연료 가스와 함께 누출되며, 표지가스 감지 모듈을 통해 표지가스가 검출되는 경우 평가모듈은 가스누출이 발생되었음을 정확히 감지하고, 알림 정보를 생성하여 개별 단말부로 전송하며, 이와 동시에, 제어 신호를 생성하여 제어벨브를 제어하여 연료가스의 공급을 차단시킬 수 있다. 이로 인해, 관리서버부는 연료가스가 누출되고 있는지 여부를 정확하게 평가할 수 있어 가스누출을 보다 정확히 감지할 수 있게 된다. 또는, 표지가스 감지 모듈을 통해 표지가스가 검출되지 않는 것으로 확인된 경우에는 관리서버부는 연료가스 감지 모듈이 오작동한 것으로 평가하고 연료가스가 누출되고 있지 않은 것으로 평가하며, 오작동 정보 신호를 생성하여 후술할 관리자 단말기로 해당 신호를 전송하여 연료가스 감지 모듈을 보수하도록 하 는 알림 정보를 전송하도록 한다. 표지가스 공급부를 통해 공급되는 표지가스는 LPG, LNG와 같은 연료가스와 혼합되는 경우에도 안정한 가스 를 도입하여 사용할 수 있으며, 질소 가스, 헬륨가스, 네온가스, 아르곤가스 등과 같은 불활성 가스를 표지가스 로 사용할 수 있고, 바람직하게는, 아르곤 가스 또는 질소 가스를 공급하도록 하여 감지의 정확도를 확보하도록 구성할 수 있다. 또한, 상기 표지가스는 안정원소 및 방사선 동위원소를 모두 포함하는 혼합 표지가스를 사용할 수 있도록 하여 보다 정확한 가스누출 여부를 확인하도록 구성할 수도 있으며, 15N2 동위원소 및 14N2를 포함하는 질소 가스 또는 40Ar, 36Ar을 포함하는 아르곤 가스를 공급하도록 구성할 수도 있다. 표지가스 공급부는 연료가스 공급배관에 표지가스를 0.01 내지 100,000 ppm의 농도로 공급할 수 있으며, 연료가스의 연소에 영향을 크게 미치지 않는 범위로 공급하는 것이 바람직하고, 연료가스가 과량 공급되는 경우 일시적으로 연소 화력이 다소 낮아지는 문제가 발생할 수 있다. 보다 바람직하게는, 상기 표지가스 공급부(40 0)는 표지가스를 100 내지 10,000 ppm의 농도로 공급할 수 있다. 한편, 관리서버부는 저장 모듈을 포함할 수 있으며, 저장 모듈은 정보 수집부에서 수집한 상황 정보와 연료가스 누출, 화재, 지진, 오작동 발생과 같은 이벤트 정보를 저장하고, 개별 단말기에 저장한 이벤트 정보를 제공할 수 있으며, 미리 설정된 연료가스 감지값, 화재 감지값, 온도 감지값, 진동 감지값, 상관 관계 그래프 등의 정보를 저장하고, 평가모듈에서 필요 정보를 요청시 제공하는 역할을 수행할 수 있다. 한편, 개별 단말부는 관리서버부에서 생성한 알림 정보를 수신받아 업소의 상황을 모니터링할 수 있 도록 하는 구성요소로서, 감시 대상 영역을 포함하는 상업용 주방 시설, 특히, 연료가스를 사용하는 가스레인지등의 가열 수단이 설치된 장소의 공용 단말기, 사용자 단말기 및 관리자 단말기를 포함한다. 상기 개별 단말부는 개인용 PC, 노트북, PDA(personal digital assistant), 스마트 폰(smart phone), 스 마트 와치(smart watch), 태블릿(tablet) PC, 아이패드(Ipad)를 포함할 수 있으며, 또는, IMT- 2000(international mobile telecommunication 2000), WCDMA(wideband code division multiple access), GSM/GPRS(global system for mobile communication packet radio service) 및 UMTS(universal mobile telecommunication service) 등과 같은 단말기 타입의 정보통신기기 또는 멀티미디어 기기 등을 포함하며, 데이 터를 다운로드 받아서 사용하거나 내장된 애플리케이션을 구동시켜 사용할 수도 있다. 개별 단말부에서, 공용 단말기, 사용자 단말기 및 관리자 단말기는 각각 업소의 가스 공급 설비에 대한 모니터링 서비스를 제공받을 수 있도록 어플리케이션(application)이 설치될 수 있으며, 어플리케 이션을 통해 상업용 주방 시설을 원격으로 모니터링할 수 있다. 또한, 개별 단말부는 안전사고에 대해 즉각적인 대응과 예방이 가능하도록 소화 설비와 가스 공급 설비를 별도로 제어할 수 있는 제어 수단을 추가로 포함하여 원격으로 상업용 주방 시설을 관리할 수 있다. 그리고, 개별 단말부는 관련 기관 단말기를 추가로 포함할 수 있으며, 관련 기관 단말기는 소방서, 경찰서 등에 상시 비치되는 PC 등을 대표적인 예로 들 수 있고, 상업용 주방 시설에서 가스누출, 화재 발생 등의 이벤 트가 발생된 것으로 판단될 경우 즉각적인 조치가 가능하도록 구성할 수도 있다. 상기와 같은 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 상업용 주방 시설에서 발생되는 가스 누출 및 화재 발생에 대한 정확한 진단이 가능하고, 인공지능 타입으로 연료가스의 공급 제어와 화재를 진압하 는 소화 설비의 동작을 제어할 수 있어 안전사고에 대한 즉각적인 대응과 예방이 관리하다. 또한, 표지가스를 공급하는 수단과 검출하는 수단이 추가로 구비되어, 연료가스 감지센서의 오작동으로 인해 발 생되는 오류를 보정할 수 있어 연료가스의 누출 여부를 정확히 평가할 수 있다. 또한, 본 발명에 따른 인공지능형 상업용 주방 소화 시스템은, 가스누출 및 화재 발생 이외에도 지진 등의 위험 요소에 대한 상황 정보를 실시간으로 모니터링할 수 있을 뿐만 아니라, 가스 공급 설비의 교체 시기 또는 보수시기를 파악할 수 있어 상업용 주방 시설을 통합관리할 수 있다. 상기한 바와 같은 인공지능형 상업용 주방 소화 시스템의 세부 구성(예를 들면, 연료가스 및 질소가스누출 감지, 화재 발생 감지, 진동 감지, 감지 정보 분석, 통신, 정보의 수집 및 평가 역할을 수행하는 구성)에는, 시 스템을 구성하는 타 구성과의 통신, 정보 저장, 인증, 제어, 처리, 등의 역할 및 장치 작동을 제어하는 다양한 구성이 포함되지만, 본 발명의 명확한 설명을 위해 본 발명의 기술적 사상이 포함된 핵심 구성을 제외하고는 세 부 구성의 설명을 생략하도록 한다."}
{"patent_id": "10-2018-0165134", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 인공지능형 상업용 주방 소화 시스템의 전체적인 구성을 개략적으로 나타낸 구성도이다."}
