{"patent_id": "10-2023-0094453", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0014441", "출원번호": "10-2023-0094453", "발명의 명칭": "인공지능 모델을 이용한 광학 현미경 이미지 개선 방법 및 이를 이용한 입자 정량화 방법", "출원인": "광주과학기술원", "발명자": "송영민"}}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "광학 현미경(optical microscopy; OM) 이미지와 이에 대응하는 주사 전자 현미경(scanning electronmicroscope; SEM) 이미지를 수집하는 단계;상기 SEM 이미지로부터 입자를 식별하는 단계;상기 식별된 입자의 위치에 기초하여 상기 OM 이미지에 대한 GT(Ground Truth) 이미지를 생성하는 단계;상기 OM 이미지와 상기 GT 이미지를 훈련 데이터셋으로 설정하여 컨볼루션 신경망을 학습시키는 단계; 및상기 컨볼루션 신경망에 타겟 OM 이미지를 입력하여 상기 타겟 OM 이미지를 개선하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 OM 이미지와 SEM 이미지를 수집하는 단계는상기 입자에 반응한 감지체를 동일한 FoV(Field of View)에서 촬영한 OM 이미지와 SEM 이미지를 수집하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 감지체는 상기 입자와 접촉하면 화학적 반응을 통해 색상이 변하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 감지체는 상기 입자와의 항원-항체 반응을 통해 색상이 변하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 감지체는금속을 포함하는 반사층과,상기 반사층에 형성되는 공진층과,상기 공진층의 상부에 위치하며 항체를 고정시키는 항체고정층과,공개특허 10-2025-0014441-3-상기 항체고정층 상에 형성되는 항체층을 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 입자를 식별하는 단계는상기 SEM 이미지를 사용자 단말로 송신하는 단계와,상기 사용자 단말에서 수신된 명령에 기초하여 상기 입자를 어노테이션(annotation)하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 입자를 식별하는 단계는상기 SEM 이미지에 원 허프 변환(circle Hough Transform)을 적용하여 상기 입자를 식별하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 입자를 식별하는 단계는기준 범위의 반지름에 대한 원 허프 변환을 적용하여 상기 입자를 식별하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 입자를 식별하는 단계는상기 SEM 이미지를 객체 검출(object detection) 신경망에 입력하여 상기 입자를 식별하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 객체 검출 신경망은 기준 범위의 반지름을 갖는 입자가 촬영된 SEM 이미지를 통해 미리 학습된광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2025-0014441-4-제1항에 있어서,상기 GT 이미지를 생성하는 단계는상기 식별된 입자의 중심 위치에 대응하는 임펄스 신호에 포인트 스프레드 함수(point spread function; PSF)를적용하여 상기 GT 이미지를 생성하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 GT 이미지를 생성하는 단계는상기 식별된 입자의 중심 위치에 대응하는 임펄스 신호 가우시안 필터(Gaussian filter)를 적용하여 상기 GT 이미지를 생성하는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 컨볼루션 신경망을 학습시키는 단계는상기 OM 이미지를 상기 컨볼루션 신경망의 입력 데이터로 설정하고, 상기 GT 이미지를 상기 컨볼루션 신경망의출력 데이터로 설정하여 상기 컨볼루션 신경망을 지도 학습(supervised learning)시키는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 컨볼루션 신경망을 학습시키는 단계는상기 컨볼루션 신경망의 출력 이미지와 상기 GT 이미지의 차이가 최소가 되도록 상기 컨볼루션 신경망을 지도학습시키는 단계를 포함하는광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 타겟 OM 이미지는, 타겟 입자에 반응한 감지체를 촬영한 이미지인광학 현미경 이미지 개선 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제15항 중 어느 한 항에 의해 개선된 타겟 OM 이미지에 기초하여 상기 타겟 OM 이미지 내 입자를 정량화하는 단계를 포함하는공개특허 10-2025-0014441-5-입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 입자를 정량화하는 단계는상기 타겟 OM 이미지의 채도값에 따라 상기 타겟 OM 이미지 내 입자의 배열과 밀도 중 적어도 하나를 결정하는단계를 포함하는입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 입자를 정량화하는 단계는상기 타겟 OM 이미지의 RGB 색상값을 채도값으로 변환하는 단계와,상기 채도값에 따라 상기 입자의 배열과 밀도 중 적어도 하나를 결정하는 단계를 포함하는입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서,상기 입자를 정량화하는 단계는상기 타겟 OM 이미지를 구성하는 픽셀 중 색상값 또는 채도값이 기준 범위 이내인 픽셀을 클러스터링(clustering)하는 단계와,상기 클러스터링된 픽셀의 채도값에 따라 상기 입자의 다층 배열 여부와 밀도를 결정하는 단계를 포함하는입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 입자를 정량화하는 단계는상기 타겟 OM 이미지의 채도값이 서로 중복되지 않는 복수의 기준 범위에 포함되는지에 따라 상기 입자의 다층배열 여부를 결정하는 단계를 포함하는입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제16항에 있어서,상기 입자를 정량화하는 단계는상기 타겟 OM 이미지의 채도값에 대응하는 상기 입자의 밀도를 결정하는 단계를 포함하는공개특허 10-2025-0014441-6-입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제16항에 있어서,상기 입자를 정량화하는 단계는상기 타겟 OM 이미지를 회귀(regression) 신경망에 입력하고, 상기 회귀 신경망의 출력값을 상기 입자의 개수로결정하는 단계를 포함하는입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서,상기 회귀 신경망은 상기 타겟 OM 이미지와 상기 타겟 OM 이미지에 포함된 입자의 수로 이루어진 훈련 데이터셋에 의해 미리 학습된입자 정량화 방법."}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 컨볼루션 신경망을 통해 광학 현미경 이미지를 개선하고 이를 이용하여 이미지 내 입자를 정량화하는 방법에 관한 것이다. 본 발명의 일 실시예에 따른 광학 현미경 이미지 개선 방법은, 광학 현미경(optical microscopy; OM) 이미지와 (뒷면에 계속)"}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컨볼루션 신경망을 통해 광학 현미경 이미지를 개선하고 이를 이용하여 이미지 내 입자를 정량화하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 바이러스 감지를 위해 대표적으로 중합효소연쇄반응(quantitative Polymerase Chain Reaction; qPCR)을 이용한 방법과 측방유동면역센서(Lateral Flow Immunoassay; LFIA)를 이용한 방법이 이용되고 있다. qPCR의 경우 매우 높은 정확도를 가진다는 장점에도 불구하고 유전자 증폭을 위한 고가의 장비와 전문 인력의 필요성으로 인해 개발도상국 등에서 활용이 제약된다는 문제가 있다. 한편, LFIA의 경우 저비용으로 직관적인 바이러스 검출 결과를 보여준다는 장점이 있으나, 비교적 낮은 민감도 로 인해 잦은 검출 오류를 보인다는 문제가 있다. 이에 따라, 향후 발생할 수 있는 팬데믹(pandemic)에 대비하기 위해 나노 크기의 바이러스나 입자를 신속하고 정확하게 검출할 수 있는 센서의 필요성이 대두되고 있다."}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 광학 현미경에서 촬영된 OM 이미지와 실제 입자의 위치에 기반한 생성 이미지 간의 관계를 컨볼루션 신경망에 학습시키고, 이를 이용하여 광학 현미경 이미지를 개선하는 것을 목적으로 한다. 또한, 본 발명은 OM 이미지의 색상 변화를 이용하여 OM 이미지 내 입자를 정량화하는 것을 목적으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 광학 현미경 이미지 개선 방법은, 광학 현미경 (optical microscopy; OM) 이미지와 이에 대응하는 주사 전자 현미경(scanning electron microscope; SEM) 이 미지를 수집하는 단계, 상기 SEM 이미지로부터 입자를 식별하는 단계, 상기 식별된 입자의 위치에 기초하여 상 기 OM 이미지에 대한 GT(Ground Truth) 이미지를 생성하는 단계, 상기 OM 이미지와 상기 GT 이미지를 훈련 데이 터셋으로 설정하여 컨볼루션 신경망을 학습시키는 단계 및 상기 컨볼루션 신경망에 타겟 OM 이미지를 입력하여 상기 타겟 OM 이미지를 개선하는 단계를 포함하는 것을 특징으로 한다. 또한, 전술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 입자 정량화 방법은 앞서 개선된 타겟 OM 이미 지에 기초하여 상기 타겟 OM 이미지 내 입자를 정량화하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 광학 현미경에서 촬영된 OM 이미지와 실제 입자의 위치에 기반한 생성 이미지 간의 관계를 컨볼루션 신경망에 학습시키고, 이를 이용하여 광학 현미경 이미지를 개선함으로써, OM 이미지에 포함된 시각적 아티펙트 (visual artifact)를 효과적으로 제거할 수 있고, 낮은 농도에서 색 변화를 검출하기 어려웠던 비색 센서의 한 계를 극복할 수 있다. 또한, 본 발명은 OM 이미지의 색상 변화를 이용하여 OM 이미지 내 입자를 정량화함으로써, 신속하게 입자의 존 재 여부, 개수, 배열 상태, 밀도 등의 정량 정보를 직관적으로 파악할 수 있다는 장점이 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2023-0094453", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용 하는 것으로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 또한, 본 명세서에서 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한, 본 명세서에서 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개 재\"되거나, 각 구성요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 본 명세서에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B를 의미하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 본 발명은 컨볼루션 신경망을 통해 광학 현미경 이미지를 개선하고 이를 이용하여 이미지 내 입자를 정량화하는 방법에 관한 것이다. 먼저, 도 1 내지 도 12를 참조하여 본 발명의 일 실시예에 따른 광학 현미경 이미지 개선 방법을 구체적으로 설 명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 입자 정량화 시스템을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 광학 현미경 이미지 개선 방법을 도시한 순서도이다. 도 3은 광학 현미경과 주사 전자 현미경에서 각각 촬영된 OM 이미지 및 SEM 이미지를 도시한 도면이다. 도 4는 본 발명의 일 실시예에 따른 감지체의 구조를 도시한 도면이고, 도 5는 도 4에 도시된 감지체에 바이러 스가 흡착된 모습을 도시한 도면이다. 도 6은 SEM 이미지에 원 허프 변환을 적용하여 입자를 식별하는 모습을 도시한 도면이고, 도 7은 SEM 이미지를 객체 검출 신경망에 입력하여 입자를 식별하는 모습을 도시한 도면이다. 도 8은 입자 식별 동작에서 SEM 이미지의 아티펙트가 제거된 모습을 도시한 도면이다. 도 9는 OM 이미지와 이에 대응하는 SEM 이미지 및 SEM 이미지로부터 식별된 입자들을 각각 도시한 도면이다. 도 10은 입자의 위치에 포인트 스프레드 함수를 적용하여 GT 이미지를 생성하는 모습을 도시한 도면이다. 도 11은 컨볼루션 신경망의 지도 학습 방법을 설명하기 위한 도면이고, 도 12는 컨볼루션 신경망의 검증 방법을 설명하기 위한 도면이다.도 1을 참조하면, 본 발명의 광학 현미경 이미지 개선 방법과 입자 정량화 방법에 각각 적용될 수 있는 입자 정 량화 시스템은, 프로세서, 감지체, 광학 현미경(optical microscopy; OM, 200) 및 주사 전자 현미 경(scanning electron microscope; SEM, 300)을 포함할 수 있다. 다만, 도 1에 도시된 입자 정량화 시스템은 일 실시예에 따른 것이고, 그 구성요소들이 도 1에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 구성요소가 부가, 변경 또는 삭제될 수 있다. 한편 도 2를 참조하면, 본 발명의 일 실시예에 따른 광학 현미경 이미지 개선 방법은 광학 현미경(OM) 이미지 (이하, OM 이미지) 및 주사 전자 현미경(SEM) 이미지(이하, SEM 이미지)를 수집하는 단계(S110), SEM 이미지로 부터 입자를 식별하는 단계(S120), 입자 위치에 기초하여 GT(Ground Truth) 이미지를 생성하는 단계(S130), OM 이미지와 GT 이미지를 이용하여 컨볼루션 신경망을 학습시키는 단계(S140) 및 컨볼루션 신경망에 타겟 OM 이미 지를 입력하는 단계(S150)를 포함할 수 있다. 다만, 도 2에 도시된 광학 현미경 이미지 개선 방법은 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 2에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 일부 단계들이 부가, 변경 또는 삭제될 수 있다. 도 2에 도시된 각 단계들은 도 1에 도시된 프로세서에 의해 수행될 수 있고, 이를 위해 프로세서는 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기 (controller), 마이크로 컨트롤러(micro-controllers) 중 적어도 하나의 물리적인 요소를 포함할 수 있다. 이하, 도 2에 도시된 각 단계들을 구체적으로 설명하도록 한다. 프로세서는 OM 이미지와 SEM 이미지를 수집할 수 있다(S110). 여기서 OM 이미지와 SEM 이미지는 서로 대응 될 수 있다. 구체적으로, OM 이미지와 SEM 이미지는 동일한 대상을 동일한 FoV(Field of View)에서 촬영한 이미 지일 수 있다. 일 예에서, 도 1에 도시된 것과 같이 프로세서는 광학 현미경 및 주사 전자 현미경으로부터 동일 한 픽셀을 촬영한 OM 이미지 및 SEM 이미지를 각각 획득할 수 있다. 이를 위해 광학 현미경 및 주사 전자 현미경과 프로세서는 물리적으로 연결되어 데이터를 주고받을 수도 있고, 분리된 위치에서 무선통신을 통해 데이터를 주고받을 수도 있다. 다른 예에서, 프로세서는 동일 대상이 촬영된 OM 이미지와 SEM 이미지가 다수 저장된 데이터베이스 또는 서 버로부터 OM 이미지 및 SEM 이미지를 수집할 수도 있다. 도 3을 참조하면, OM 이미지와 SEM 이미지에는 적어도 하나의 입자가 촬영될 수 있다. 구체적으로, 각 이미지에 는 소수의 입자(two/three-particle)만이 표현될 수 있고, 입자의 단일 및 복수 클러스터(mono/multi- cluster)가 표현될 수도 있으며, 단층 및 다층의 입자(mono/bi/multi-layer)가 촬영될 수 있다. 이 때, OM 이미지에서 입자는 다른 부분과는 다른 색상으로 표현될 수 있다. 이를 위해 광학 현미경의 촬 영 대상인 감지체는 입자와 반응하여 특정 색을 발현하도록 설계될 수 있고, 구체적으로 입자와 화학적으 로 반응하여 색상이 변하도록 설계될 수 있다. 예컨대, 감지체는 바이러스(입자와 대응)를 감지하는 비색 센서(colorimetric sensor)로 활용될 수 있고, 이 경우 감지체는 입자와의 항원-항체 반응을 통해 색상이 변하도록 설계될 수 있다. 도 4를 참조하면, 일 예에서 감지체는 금속을 포함하는 반사층과, 반사층 상에 형성되는 공진층 , 공진층의 상부에 위치하며 항체를 고정시키는(immobilize) 항체고정층 및 항체고정층 상 에 형성되는 항체층을 포함할 수 있다. 추가적으로, 감지체는 공진층과 항체고정층 사이에 형성되는 버퍼층을 더 포함할 수 있다. 반사층은 광을 반사하는 소재로 이루어질 수 있으며, 구체적으로 반사율이 높은 금속을 포함할 수 있다. 예컨대, 반사층은 금(Au), 은(Ag), 알루미늄(Al), 티타늄(Ti), 백금(Pt), 크롬(Cr) 및 구리(Cu) 중 적어 도 하나로 이루어질 수 있다. 반사층은 초박막 형태로 구현될 수 있고, 예컨대 200nm 이하의 두께를 가질 수 있다. 공진층은 흡광계수를 갖는 다공성의 반도체 물질로서, 광흡수성을 갖는 유전물질로 이루어질 수 있다. 예 컨대, 공진층은 게르마늄(Ge) 및 비정질 실리콘(a-Si) 중 적어도 하나로 이루어질 수 있다. 공진층 역시 초박막 형태로 구현될 수 있고, 구체적으로는 반사층보다 더 얇게 형성될 수 있다.공진층은 반사층 상에 증착될 수 있고, 구체적으로 반사층 상에 빗각(oblique) 증착될 수 있다. 증착 공정에서 증착 각도에 따라 공진층의 다공성이 조절될 수 있으며, 증착 시간에 따라 공진층의 두께가 조절될 수 있다. 공진층의 다공성 및 두께 변화에 따라 감지체 표면 자체의 색이 변화할 수 있다. 구체적으로, 공진층 의 다공성 및 두께 변화는 공진층의 굴절률 변화를 발생시키고, 굴절률의 변화는 색 변화를 야기할 수 있다. 즉, 본 발명에서 감지체 표면의 기본 색(basic color)은 공진층의 다공성과 두께에 따라 결 정될 수 있다. 한편, 공진층 상에 선택적으로 증착되는 버퍼층은, 공진층을 보호하는 구성요소로서 산화물, 예 컨대 이산화규소(SiO2)로 이루어질 수 있고, 외부의 수분이나 습기로부터 공진층을 보호할 수 있다. 공진층(또는 버퍼층) 상에는 항체를 고정시키는 항체고정층이 형성될 수 있다. 항체고정층(14 0)은 공진층(또는 버퍼층) 상에 코팅될 수 있고 항체와 결합될 수 있다. 이러한 항체 고정층은 폴리 에틸렌글리콜(PEG)로 이루어질 수도 있고, 항체의 아미노기와 결합할 수 있는 작용기를 갖는 고분자 물질(예컨 대, 글루타르알데하이드(glutaraldehyde))로 이루어질 수도 있다. 항체고정층 상에는 항체층이 형성될 수 있다. 항체층은 복수의 항체들로 구성될 수 있으며, 각 항체들은 항체고정층에 부착 형성될 수 있다. 구체적으로, 항체고정층 상에 항체 수용액이 도포됨으 로써 각 항체들은 항체고정층의 표면에 부착될 수 있다. 전술한 버퍼층, 항체고정층 및 항체층은 수십 나노미터 이하의 두께를 가질 수 있다. 이에 따라, 감지체는 유연한 초박막 구조를 가질 수 있고 대면적으로 제작될 수 있다. 이러한 구조적 특징으로 인해 감지체는 마스크, 의류, 웨어러블(wearable) 패치 등의 제품에 적용될 수 있다. 도 5를 참조하면, 전술한 구조의 감지체는 외부에서 유래된 입자, 예컨대 바이러스를 감지할 수 있다. 도 5에 대한 설명에서는 입자가 코로나 바이러스(SARS-CoV-2, 400)인 것으로 가정하나 입자의 종류는 이 에 한정되는 것은 아니며, 전술한 항체층과 결합할 수 있는 임의의 입자가 감지 대상일 수 있다. 바이러스의 표면에는 막 단백질이 돌기 형태로 형성될 수 있고, 막 단백질은 스파이크 단백질 (spike protein)일 수 있다. 막 단백질은 항체층과 항원-항체 반응을 일으킬 수 있다. 막 단백질 은 항체층과 결합되며, 감지체의 표면 중에서 막 단백질과 항체층이 결합된 부분은 유효 굴 절률의 변화로 인해 색 변화가 나타날 수 있다. 이상에서는 감지체의 구조를 도 4 및 도 5를 예시로 설명하였으나, 이 외에도 감지체는 비색 센서로 활용될 수 있는 다양한 구조로 구현될 수 있다. OM 이미지와 SEM 이미지가 수집되면, 프로세서는 SEM 이미지로부터 입자를 식별할 수 있다(S120). OM 이미 지의 경우 광학적 아티펙트(artifact)를 포함하며, 낮은 농도의 입자에 대해서는 색 변화가 뚜렷하지 않은 반면, SEM 이미지는 OM 이미지에 비해 높은 분해능을 가져 입자의 형태를 명확히 표현할 수 있으므로 프로세서 는 입자 식별을 위해 SEM 이미지를 이용할 수 있다. 일 예에서, 프로세서는 SEM 이미지를 사용자 단말(미도시)로 송신할 수 있다. 사용자는 사용자 단말을 통해 SEM 이미지 내의 입자들을 확인할 수 있고, 해당 입자들의 위치를 지시하는 명령을 사용자 단말에 입력할 수 있 다. 프로세서는 사용자 단말로부터 명령을 수신하고, 해당 명령에 기초하여 입자를 어노테이션(annotatio n)할 수 있다. 다른 예에서, 도 6을 참조하면, 프로세서는 입자의 모양이 기본적으로 원형이라는 것을 전제하여 SEM 이미 지에 원 허프 변환(circle Hough Transform)을 적용할 수 있다. 원 허프 변환이 적용되면 SEM 이미지 내 원형인 입자들의 중심 위치가 어노테이션될 수 있다. 보다 정확한 원 허프 변환을 위해, 변환 적용에 앞서 프로세서는 SEM 이미지에 전처리를 수행할 수 있다. 예컨대, 프로세서는 SEM 이미지를 그레이스케일(grayscale)로 변환할 수 있고, 중앙값 필터(median filter) 등을 통해 이미지를 스무딩(smoothing)할 수 있으며, 이미지에 대조 강조(contrast enhancement) 처리를 수행할 수 있다. 한편, SEM 이미지에서 입자와 유사한 모양이지만 크기가 다른 아티펙트를 제거하기 위해 프로세서는 기준 범위의 반지름, 예컨대 타겟 입자의 예상되는 반지름 범위(SARS-CoV-2의 경우 약 50nm 내지 60nm)에 대한 원 허프 변환을 적용하여 입자를 식별할 수 있다. 이에 따라, 기준 범위 외의 반지름을 갖는 객체에 대해서는 입자 식별 동작이 이루어지지 않을 수 있다. 또 다른 예에서, 도 7을 참조하면, 프로세서는 SEM 이미지를 객체 검출(object detection) 신경망에 입력하여 입자를 식별할 수 있다. 이를 위해, 객체 검출 신경망은 SEM 이미지와 해당 이미지에 포함된 입 자의 위치로 구성된 훈련 데이터셋에 의해 미리 지도 학습(supervised learning)될 수 있다. 이에 따라, 객체 검출 신경망은 도 7에 도시된 것과 같이 SEM 이미지를 입력받고, 해당 이미지 내 입자의 위치를 출력할 수 있다. 구체적으로, 객체 검출 신경망은 이미지 내 각 입자를 구획하는 바운딩 박스 (bounding box), 더 상세하게는 각 바운딩 박스의 중심점과 너비 및 높이를 출력할 수 있다. 프로세서는 객 체 검출 신경망에서 출력된 바운딩 박스의 중심점으로 각 입자를 어노테이션할 수 있다. 한편, SEM 이미지에서 입자와 유사한 모양이지만 크기가 다른 아티펙트를 제거하기 위해 전술한 객체 검출 신경 망은 기준 범위의 반지름, 예컨대 예상되는 반지름 범위(SARS-CoV-2의 경우 약 50nm 내지 60nm)의 입자가 촬영된 SEM 이미지를 통해 미리 학습될 수 있다. 이에 따라, 기준 범위 외의 반지름을 갖는 객체에 대해서는 검 출 동작이 이루어지지 않을 수 있다. 즉, 도 8을 참조하면 전술한 바와 같이 원 허프 변환에 기준 범위의 반지름을 적용하거나 객체 검출 신경망 을 기준 범위의 반지름을 갖는 입자의 SEM 이미지만을 통해 학습시킴으로써, 입자와 유사하게 원(또는 타 원)의 형상을 갖지만 실제로는 입자가 아닌 아티펙트는 어노테이션되지 않는 것을 확인할 수 있다. 도 9를 참조하면, 전술한 방법에 따라 각각의 SEM 이미지에 포함된 소수의 입자(two/three-particle), 단일 및 복수 클러스터(mono/multi-cluster)의 입자, 단층 및 다층의(mono/bi/multi-layer) 입자는 프로세서에 의 해 식별 및 어노테이션 될 수 있다. 프로세서는 앞서 식별된 입자의 위치에 기초하여 OM 이미지에 대한 GT 이미지를 생성할 수 있다(S130). 즉 프로세서는 OM 이미지에 대응하는 SEM 이미지를 통해 입자의 위치를 정확하게 식별한 뒤, 해당 위치에 기초 하여 OM 이미지와 대응하는 GT 이미지를 생성할 수 있다. 이 때, 프로세서는 입자의 중심에서 가장자리로 갈수록 OM 이미지 내 입자의 선명도가 낮아지는, 즉 이미지 내 신호(예컨대, 픽셀 값)가 약해지는 광학적 특성을 반영하여 GT 이미지를 생성할 수 있다. 일 예에서, 프로세서는 입자의 중심 위치에 대응하는 임펄스(impulse) 신호에 포인트 스프레드 함수(point spread function, PSF)를 적용하여 GT 이미지를 생성할 수 있다. 앞서 어노테이션된 입자의 위치는 특정 좌표에 대한 임펄스 신호로 표현될 수 있다. 프로세서는 해당 임펄스 신호에 포인트 스프레딩을 적용하여 입자의 중심 위치가 가장 밝고(픽셀 값이 가장 크고), 가장자리로 갈수록 어두어지도록(픽셀 값이 낮아지도록) GT 이미 지를 생성할 수 있다. 구체적으로, 프로세서는 포인트 스프레드 함수(PSF)로 가우시안 필터(Gaussian filter)를 이용함으로써 입 자의 중심 위치에서 신호의 세기가 가장 세고 중심으로부터 멀어질수록 가우시안 분포에 따라 신호 세기가 낮아 지도록 GT 이미지를 생성할 수 있다. 이 때, 가우시안 필터의 하이퍼파라미터(hyperparameter)인 시그마( )는 사용자에 의해 설정될 수 있다. 이 외에도, 프로세서는 포인트 스프레드 함수(PSF)로 중앙값(median) 필터, 유니폼(uniform) 필터, 바이레 터럴(bilateral) 필터, 랭크(rank) 필터, 가우시안 라플라스(Gaussian Laplace) 필터 등을 이용할 수 있으며, 이 외에도 임펄스 신호를 스프레딩할 수 있는 다양한 함수 또는 필터가 본 발명에 적용될 수 있다. 도 10을 참조하면, 전술한 방법에 의해 입자의 개수, 클러스터 형성 여부, 다층 배열 여부 등에 따라 각각 어노 테이션된 입자들에 대한 GT 이미지가 생성될 수 있다. 이와 같이 생성된 GT 이미지는 실측 데이터는 아니지만 입자의 실제 위치와 광학 현미경이 갖는 광학적 한계를 고려하여 생성된 이미지로서, OM 이미지 개선을 위 한 레퍼런스 이미지로 이용될 수 있다. 프로세서는 OM 이미지와 GT 이미지를 훈련 데이터셋(training dataset)으로 설정하여 컨볼루션 신경망 (Convolutional Neural Network; CNN, 600)을 학습시킬 수 있다(S140). 본 발명에서 컨볼루션 신경망은 여러 쌍의 컨볼루션 레이어 및 풀링(pooling) 레이어를 통해 OM 이미지의 특징을 추출할 수 있는 임의의 신경망 으로 구현될 수 있다. 구체적으로, 프로세서는 단계(S110)에서 수집된 OM 이미지와 단계(S130)에서 생성된 GT 이미지를 데이터셋 으로 설정하고, 데이터셋 중 일부(약 80%)를 훈련 데이터셋으로 나머지(약 20%)를 검증 데이터셋(validation dataset)으로 분류할 수 있다. 검증 데이터셋의 활용에 대해서는 후술하도록 한다. 이어서, 프로세서는 컨볼루션 신경망이 훈련 데이터셋에 포함된 OM 이미지를 입력받아 GT 이미지를 출 력하도록 컨볼루션 신경망을 학습시킬 수 있다. 도 11을 참조하여 구체적으로 설명하면, 프로세서는 OM 이미지를 컨볼루션 신경망의 입력 데이터로 설 정하고, GT 이미지를 컨볼루션 신경망의 출력 데이터로 설정하여 컨볼루션 신경망을 지도 학습시킬 수 있다. 이를 위해, 프로세서는 OM 이미지를 입력받은 컨볼루션 신경망의 출력 이미지와 GT 이미지 간의 차이, 즉 |출력 이미지 - GT 이미지|에 비례하는 손실함수(loss function)를 설정할 수 있고, 손실함수가 최소가 되도록 컨볼루션 신경망을 학습시킬 수 있다. 이러한 학습은 검증 단계에서 컨볼루션 신경망의 정확도가 기준값 이상일 때까지 반복될 수 있다. 도 12를 참조하면, 프로세서는 앞서 분류된 검증 데이터셋을 이용하여, 반복 학습되는 컨볼루션 신경망 의 성능을 검증할 수 있다. 구체적으로, 프로세서는 검증 데이터셋에 포함된 OM 이미지를 컨볼루션 신 경망에 입력하고, 컨볼루션 신경망의 출력 이미지와 GT 이미지 간의 차이에 기초하여 컨볼루션 신경 망의 예측 정확도를 산출할 수 있다. 즉, 프로세서는 학습에 이용되지 않았던 검증 데이터를 이용하여 컨볼루션 신경망이 얼마나 GT 이미지 에 가까운 이미지를 출력하는지(예측 정확도)를 산출할 수 있고, 정확도가 기준값 이상이 될 때까지 컨볼루션 신경망의 학습을 반복할 수 있다. 컨볼루션 신경망의 학습이 완료되면, 프로세서는 타겟 OM 이미지를 컨볼루션 신경망에 입력함으 로써 타겟 OM 이미지를 개선할 수 있다(S150). 한편, 지도 학습된 컨볼루션 신경망의 입력 데이터의 규격 을 일치시키기 위해, 타겟 OM 이미지는 타겟 입자에 반응한 감지체를 촬영한 이미지일 수 있고, 단계 (S110)에서 설명한 OM 이미지 및 SEM 이미지와 동일한 FoV에서 촬영된 이미지일 수 있다. 단계(S140)의 학습에 의해 컨볼루션 신경망은 OM 이미지와 GT 이미지 간의 관계성에 대한 지식을 가질 수 있다. 이에 따라, 컨볼루션 신경망은 학습에 이용되지 않았던 OM 이미지를 입력받더라도, 해당 이미지 내 입자의 예측 위치에 기반한 개선된 OM 이미지를 출력할 수 있다. 전술한 바와 같이, 본 발명은 광학 현미경에서 촬영된 OM 이미지와 실제 입자의 위치에 기반한 생성 이미 지 간의 관계를 컨볼루션 신경망에 학습시키고, 이를 이용하여 광학 현미경 이미지를 개선함으로써, OM 이미지에 포함된 시각적 아티펙트(visual artifact)를 효과적으로 제거할 수 있고, 낮은 농도에서 색 변화를 검출하기 어려웠던 비색 센서의 한계를 극복할 수 있다. 다음으로, 도 13 내지 도 18을 참조하여 본 발명의 일 실시예에 따른 입자 정량화 방법을 구체적으로 설명하도 록 한다. 도 13은 본 발명의 일 실시예에 따른 입자 정량화 방법을 도시한 순서도이다. 도 14는 감지체가 입자의 다층 배열 여부 및 밀도에 따라 서로 다른 색을 나타내는 모습을 도시한 도면이다. 도 15는 감지체 상에 입자가 단층 또는 다층 배열된 경우 감지체의 파장별 반사율을 도시한 도면이다. 도 16은 개선된 OM 이미지에 따라 입자의 밀도를 결정하는 방법을 설명하기 위한 도면이고, 도 17은 개선된 OM 이미지에 따라 입자의 다층 배열 여부를 결정하는 방법을 설명하기 위한 도면이다. 도 18은 개선된 OM 이미지를 회귀 신경망에 입력하여 입자의 개수를 식별하는 모습을 도시한 도면이다. 도 13을 참조하면, 본 발명의 일 실시예에 따른 입자 정량화 방법은 개선된 타겟 OM 이미지를 획득하는 단계 (S210) 및 타겟 OM 이미지 내 입자를 정량화하는 단계(S220)을 포함할 수 있다. 다만, 도 13에 도시된 입자 정 량화 방법은 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 13에 도시된 실시예에 한정되는 것은 아 니며, 필요에 따라 일부 단계들이 부가, 변경 또는 삭제될 수 있다. 도 13에 도시된 각 단계들 역시 도 1에 도시된 프로세서에 의해 수행될 수 있고, 이하에서는 전술한 컨볼루 션 신경망 모델을 통해 '개선된 타겟 OM 이미지'를 '타겟 OM 이미지'와 혼용하도록 한다. 이에 따라 후술 되는 타겟 OM 이미지는 전술한 단계(S110) 내지 단계(S150)을 통해 개선된 OM 이미지로 이해되어야 한다. 프로세서는 전술한 광학 현미경 이미지 개선 방법에 따라 개선된 타겟 OM 이미지를 획득할 수 있다(S210). 타겟 OM 이미지의 개선 방법에 대해서는 전술한 바 있으므로 여기서는 자세한 설명을 생략하도록 한다. 이어서, 프로세서는 개선된 타겟 OM 이미지에 기초하여 타겟 OM 이미지 내 입자를 정량화할 수 있다(S220). 본 발명의 프로세서는 입자를 정량화하기 위해 타겟 OM 이미지의 채도값을 이용한 규칙 기반(rule-based)의 방법과, 딥 러닝을 이용한 방법을 이용할 수 있고, 이하 각 방법에 대해 설명하도록 한다. 먼저, 규칙 기반의 입자 정량화 방법 대해 설명하도록 한다. 프로세서는 타겟 OM 이미지의 채도값에 따라 타겟 OM 이미지 내 입자의 배열과 밀도 중 적어도 하나를 결정 할 수 있다. 도 14를 참조하면, 감지체의 색은 감지체에 접촉된 입자 간의 거리에 따라 다른 색으로 변화할 수 있다. 구체적으로, 입자 간의 거리에 따라 감지체의 반사 스펙트럼은 달라질 수 있고, 이에 따라 입자 간 거리에 따라 감지체의 색이 달리 변화할 수 있다. 이에 더하여, 감지체의 색은 감지체에 접촉된 입자의 배열 층수에 따라서도 다른 색으로 변화할 수 있다. 예컨대, 도 14에 도시된 것과 같이 감지체에 접촉된 입자가 단일(Mono) 층으로 배열된 경우 와, 이중(Bi) 층으로 배열된 경우 감지체의 반사 스펙트럼은 달라질 수 있다. 도 15를 참조하면, 그래프 G1에 도시된 바와 같이 입자가 단일 층으로 배열된 경우 입자의 충진률 (filling fraction) 및 파장에 따른 감지체의 반사율은 어느 한 지점에서 최소값을 가질 수 있다. 반면에, 그래프 G2에 도시된 바와 같이 입자가 이중층으로 배열된 경우 입자의 충진률 및 파장에 따른 감지체 의 반사율은 두 지점에서 최소값을 가질 수 있다. 이러한 반사 스펙트럼의 차이로 인해 감지체의 색은 감지체에 접촉된 입자 간의 거리뿐만 아니 라 배열 층수에 따라 다른 색으로 변화할 수 있다. 도 14 및 도 15에서는 입자가 단일층 또는 이중층으로 배열된 경우만을 예시적으로 설명하였으나, 입자가 삼중층 이상으로 배열된 경우에도 감지체의 색은 입자의 배열 층수에 따라 다른 색으로 변화할 수 있다. 전술한 입자 밀도 및 배열 상태에 대응하는 RGB 색 상은 입자의 종류별로 미리 결정되어 메모리에 저장될 수 있다. 다시 도 1을 참조하면, 감지체는 예컨대 가로, 세로 1mm의 규격을 가질 수 있고, 격자 형태로 배열된 복수 의 픽셀을 포함할 수 있다. 감지체 상에는 타겟 입자가 위치할 수 있고, 광학 현미경은 감지체 를 픽셀별로 스캐닝하여 타겟 OM 이미지를 촬영하고 이를 프로세서에 제공할 수 있다. 프로세서는 도 2 를 참조하여 설명한 방법에 따라 타겟 OM 이미지를 개선하고, 그 채도값을 식별할 수 있다. 도 16을 참조하면, 타겟 OM 이미지는 RGB 색상으로 표현될 수 있다. 프로세서는 타겟 OM 이미지를 구성하는 각 픽셀별 RGB 색상을 채도로 변환함으로써 이미지의 채도값을 식별할 수 있다. 구체적으로, 프로세서는 각 픽셀의 RGB 색상값을 HSV(Hue, Saturation, Value) 값으로 변환함으로써 채도(Saturation)값을 식별할 수 있다. 한편, 처리 속도 향상을 위해 프로세서는 감지체 중에서 색상 변화가 발생한 부분에 대해서만 채도값 을 식별할 수 있다. 구체적으로, 프로세서는 타겟 OM 이미지를 구성하는 픽셀 중 색상값 또는 채도값이 미 리 설정된 범위 이내인 픽셀을 클러스터링(clustering)할 수 있고, 클러스티렁된 픽셀의 채도값만을 식별할 수 있다. 도 17을 참조하면, 앞서 설명한 바와 같이 감지체는 공진층의 구조에 따라 그 자체로 RGB 색상을 가 질 수 있다. 감지체 고유 RGB 색상은 입자와 반응한 부분에서만 변경되며, 변화된 RGB 색상값과 이에 기초 하여 변환된 채도값은 타겟 입자의 종류에 따라 미리 설정된 범위 내의 값을 가질 수 있다. 이에 따라, 프로세서는 먼저 각 픽셀의 색상값 또는 채도값이 미리 설정된 범위 이내인 픽셀만을 클러스터 링하여 클러스터링 영역과 기판(substrate) 영역을 구분할 수 있고, 클러스터링 영역 내 픽셀의 채도값만을 선 택적으로 식별할 수 있다. 앞선 방법에 따라 채도값이 식별되면, 프로세서는 채도값에 기초하여 입자의 다층 배열 여부 및 밀도를 결 정할 수 있다. 먼저, 프로세서가 입자의 다층 배열 여부를 결정하는 방법을 설명하도록 한다. 앞서 도 15에서 설명한 바와 같이 감지체 상에 입자의 배열 층수에 따라 감지체의 반사 스펙트 럼은 다를 수 있다. 이 때, 감지체의 색상은 입자의 다층 배열 여부에 관계없이 선형적으로 나타나는 반면에, 감지체의 채도는 입자의 다층 배열 여부에 따라 구분되어 나타날 수 있다.구체적으로, 도 16에 도시된 바와 같이, 입자의 다층 배열 여부에 관계없이 감지체의 색상, 예컨대 RGB 색상값 또는 Hue 값은 선형적으로 연속되는 범위에 포함될 수 있다. 반면에, 입자의 다층 배열 여부에 따라 감지체의 채도값은 서로 분리된 구간에 속할 수 있다. 구체적으로, 입자가 단일층으로 배열된 경우의 채도값 범위는, 입자가 이중층으로 배열된 경우의 채도값 범위와 완전히 구분되어 서로 중복되지 않을 수 있다. 이에 따라, 프로세서는 픽셀별로 식별된 채도값이 서로 중복되지 않는 복수의 기준범위에 포함되는지에 따 라 입자의 다층 배열 여부를 결정할 수 있다. 도 16을 예로 들면, 프로세서는 픽셀별 채도값이 제1 기준범 위에 포함되면 입자를 단층(Mono) 배열로 결정하고, 채도값이 제1 기준범위보다 낮은 제2 기준범위에 포함 되면 입자를 이중층(Bi) 배열로 결정할 수 있다. 이 때, 제1 및 제2 기준범위는 서로 중복되지 않을 수 있 다. 다음으로, 프로세서가 입자의 밀도를 결정하는 방법을 설명하도록 한다. 도 14를 참조하여 설명한 것과 같이, 입자의 밀도, 즉 단위 공간 상의 입자의 개수(Nparticle, 이하 N p)는 입자 간의 거리와 입자의 다층 배열 여부에 따라 결정될 수 있고, 입자의 밀도에 따른 감 지체의 RGB 색상 데이터셋은 메모리에 미리 저장될 수 있다. 프로세서는 메모리에 저장된 밀도별 RGB 색상 데이터셋을 밀도별 채도 데이터셋으로 변환하고, 입자와 반응 한 감지체의 채도값을 식별할 수 있다. 이어서, 프로세서는 해당 채도값에 대응하는 밀도값을 입자의 밀도로 결정할 수 있다. 도 16에 도시된 바와 같이, 입자의 밀도는 입자의 다층 배열 상태에 관계없이 채도값에 반비례할 수 있고, 프로세서는 채도값이 낮을수록 입자의 밀도를 높게 결정할 수 있다. 이하, 딥러닝 기반의 입자 정량화 방법에 대해 설명하도록 한다. 프로세서는 타겟 OM 이미지를 회귀(regression) 신경망에 입력하고, 회귀 신경망의 출력값(Np)을 입자의 개수로 결정할 수 있다. 본 발명에서 회귀 신경망은 연속적인 값을 예측하는 회귀 태스크(task)를 수행할 수 있는 임의의 신경망으로 구현될 수 있다. 도 18을 참조하면, 프로세서는 회귀 신경망이 타겟 OM 이미지를 입력받아 타겟 OM 이미지에 촬영된 입 자의 개수(Np)를 출력하도록 회귀 신경망을 학습시킬 수 있다. 구체적으로, 프로세서는 앞선 단계 (S150)을 통해 생성된 타겟 OM 이미지를 회귀 신경망의 입력 데이터로 설정하고, 단계(S120)에서 어노테이 션된 입자의 수를 회귀 신경망의 출력 데이터로 설정하여 회귀 신경망을 지도 학습시킬 수 있다. 이를 위해, 프로세서는 타겟 OM 이미지를 입력받은 회귀 신경망의 예측값(Np)과 실측된 입자의 수 간 의 차이, 즉 |예측값 - 실측 입자 수|에 비례하는 손실함수를 설정할 수 있고, 손실함수가 최소가 되도록 회귀 신경망을 지도 학습시킬 수 있다. 학습이 완료된 회귀 신경망은 타겟 OM 이미지와 이미지 내 입자의 수 간의 관계성에 대한 지식을 가질 수 있다. 이에 따라, 회귀 신경망은 학습에 이용되지 않았던 타겟 OM 이미지를 입력받더라도, 해당 이미지 내 입자의 수에 대한 예측값(Np)을 출력할 수 있다. 전술한 바와 같이, 본 발명은 OM 이미지의 색상 변화를 이용하여 OM 이미지 내 입자를 정량화함으로써, 신속하 게 입자의 존재 여부, 개수, 배열 상태, 밀도 등의 정량 정보를 직관적으로 파악할 수 있다는 장점이 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2023-0094453", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 입자 정량화 시스템을 도시한 도면. 도 2는 본 발명의 일 실시예에 따른 광학 현미경 이미지 개선 방법을 도시한 순서도. 도 3은 광학 현미경과 주사 전자 현미경에서 각각 촬영된 OM 이미지 및 SEM 이미지를 도시한 도면. 도 4는 본 발명의 일 실시예에 따른 감지체의 구조를 도시한 도면. 도 5는 도 4에 도시된 감지체에 바이러스가 흡착된 모습을 도시한 도면. 도 6은 SEM 이미지에 원 허프 변환을 적용하여 입자를 식별하는 모습을 도시한 도면. 도 7은 SEM 이미지를 객체 검출 신경망에 입력하여 입자를 식별하는 모습을 도시한 도면. 도 8은는 입자 식별 동작에서 SEM 이미지의 아티펙트가 제거된 모습을 도시한 도면. 도 9는 OM 이미지와 이에 대응하는 SEM 이미지 및 SEM 이미지로부터 식별된 입자들을 각각 도시한 도면. 도 10은 입자의 위치에 포인트 스프레드 함수를 적용하여 GT 이미지를 생성하는 모습을 도시한 도면. 도 11은 컨볼루션 신경망의 지도 학습 방법을 설명하기 위한 도면. 도 12는 컨볼루션 신경망의 검증 방법을 설명하기 위한 도면. 도 13은 본 발명의 일 실시예에 따른 입자 정량화 방법을 도시한 순서도. 도 14는 감지체가 입자의 다층 배열 여부 및 밀도에 따라 서로 다른 색을 나타내는 모습을 도시한 도면. 도 15는 감지체 상에 입자가 단층 또는 다층 배열된 경우 감지체의 파장별 반사율을 도시한 도면.도 16은 개선된 OM 이미지에 따라 입자의 밀도를 결정하는 방법을 설명하기 위한 도면. 도 17은 개선된 OM 이미지에 따라 입자의 다층 배열 여부를 결정하는 방법을 설명하기 위한 도면. 도 18은 개선된 OM 이미지를 회귀 신경망에 입력하여 입자의 개수를 식별하는 모습을 도시한 도면."}
