{"patent_id": "10-2023-0112992", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0031469", "출원번호": "10-2023-0112992", "발명의 명칭": "궤적 데이터를 이용하여 생활 패턴을 분류하는 방법 및 장치", "출원인": "이화여자대학교 산학협력단", "발명자": "강영옥"}}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 움직임을 나타내는 궤적 데이터로부터 적어도 하나의 체류 지점 추출하는 단계;상기 적어도 하나의 체류 지점에 대응하는 맥락정보를 벡터 데이터로 임베딩하는 단계; 및상기 벡터 데이터로부터 추출된 적어도 하나의 군집을 이용하여 상기 사용자의 생활 패턴을 분류하는 단계;를 포함하는, 궤적 데이터를 이용하여 생활 패턴을 분류하는 방법."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 추출하는 단계는,상기 궤적 데이터로부터 소정의 거리 이내에 기 설정된 시간 이상으로 머무른 지점을 상기 적어도 하나의 체류지점으로 지정하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 체류 지점은,상기 머무른 지점의 위치, 상기 머무른 지점에 체류를 시작한 시간, 체류를 종료한 시간 및 체류한 시간 중 어느 하나 이상에 대한 정보를 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 임베딩하는 단계는,상기 체류 지점에 대한 관심지점(Point of interest; POI) 정보를 활용하여, 상기 체류 지점의 카테고리 및 키워드 중 어느 하나에 대한 정보를 포함하는 상기 맥락정보를 생성하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 분류하는 단계는,상기 벡터 데이터 간의 거리 관계를 유지하면서 상기 벡터 데이터의 차원을 축소하는 단계;를 더 포함하는, 방법."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분류하는 단계는,상기 차원이 축소된 벡터 데이터에 계층적 밀도 기반의 클러스터링을 수행하여 상기 군집을 추출하는 단계;를 포함하는 방법.공개특허 10-2025-0031469-3-청구항 7 적어도 하나의 메모리; 및적어도 하나의 프로세서;를 포함하고,상기 적어도 하나의 프로세서는,사용자의 움직임을 나타내는 궤적 데이터로부터 적어도 하나의 체류 지점 추출하고,상기 적어도 하나의 체류 지점에 대응하는 맥락정보를 벡터 데이터로 임베딩하고,상기 벡터 데이터로부터 추출된 적어도 하나의 군집을 이용하여 상기 사용자의 생활 패턴을 분류하는, 궤적 데이터터를 이용하여 생활 패턴을 분류하는 장치."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 적어도 하나의 프로세서는,상기 궤적 데이터로부터 소정의 거리 이내에 기 설정된 시간 이상으로 머무른 지점을 상기 적어도 하나의 체류지점으로 지정하는, 장치."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 적어도 하나의 프로세서는,상기 머무른 지점의 위치, 상기 머무른 지점에 체류를 시작한 시간, 체류를 종료한 시간 및 체류한 시간 중 어느 하나 이상에 대한 정보를 포함하는 것을 특징으로 하는, 장치."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 적어도 하나의 프로세서는,상기 체류 지점에 대한 관심지점(Point of interest; POI) 정보를 활용하여, 상기 체류 지점의 카테고리 및 키워드 중 어느 하나에 대한 정보를 포함하는 상기 맥락정보를 생성하는, 장치."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 적어도 하나의 프로세서는,상기 벡터 데이터 간의 거리 관계를 유지하면서 상기 벡터 데이터의 차원을 축소하는, 장치."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 적어도 하나의 프로세서는,상기 차원이 축소된 벡터 데이터에 계층적 밀도 기반의 클러스터링을 수행하여 상기 군집을 추출하는, 장치."}
{"patent_id": "10-2023-0112992", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 따른 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 측면에 따른 궤적 데이터를 이용하여 생활 패턴을 분류하는 방법은, 사용자의 움직임을 나타내는 궤적 데이터 로부터 적어도 하나의 체류 지점 추출하는 단계; 상기 적어도 하나의 체류 지점에 대응하는 맥락정보를 벡터 데 이터로 임베딩하는 단계; 및 상기 벡터 데이터로부터 추출된 적어도 하나의 군집을 이용하여 상기 사용자의 생활 패턴을 분류하는 단계;를 포함한다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 궤적 데이터를 이용하여 생활 패턴을 분류하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에 GPS(Global Positioning System) 기술의 발전과 스마트폰의 확산으로 위치 획득 기술이 발전하고 있다. 이러한 기술이 사람들의 일상생활에 포함되면서 무선 네트워크 인프라를 통해 객체의 위치가 수집되고, 이는 새 로운 유형의 공간-시간 데이터를 생성하고 있다. 최근 위치 데이터의 사용 가능성이 증가함에 따라 궤적 데이터로부터 개인의 일상생활과 관련된 다양한 정보들 을 추출하려는 연구들이 다양한 분야에서 진행되고 있다. 종래의 궤적 데이터 분석은 전체 데이터에서 체류 지 점을 찾고, 체류 지점의 특성을 분석하는 방법이 주를 이루었다. 즉, 종래의 기술은 체류 지점의 공간적 위치와 위치의 맥락을 찾는 것에 초점을 두었다. 그러나 사용자의 스마트폰에서 발생하는 GPS 데이터는 사용자의 개별적 특성을 나타내기 때문에 사용자별 체류 지점의 위치 정보, 체류지점의 맥락 정보, 체류지점의 시간 정보를 도출하여 주요하게 다룰 필요가 있다. 하지만 이동 빈도를 분석하여 생활패턴을 분류하는 종래의 기술은 체류지점에 도착한 시간, 체류지점에 머무른 시간, 체류지점에서 떠난 시간 등 시간 정보는 포함하고 있지 않다. 따라서, 동일한 장소에 방문했다 하더라도 오전에 방문한 사람과 오후에 방문한 사람의 생활패턴은 달리 해석되어야 하지만 이를 반영하지 못한다는 문제 가 있다. 한편, 그래프나 마르코프체인과 같이 체류 지점을 기준으로 궤적을 변환하는 기존의 연구들과는 달리 POI(Point of Interest) 정보와 주요 발생 시간대를 함께 반영하려는 연구도 진행되고 있다. 그러나 주요 발생 시간대를 기준으로 개인의 생활패턴을 표현하다 보니 이동 순서와 체류 시간에 대한 정보를 잃게 된다는 문제가 있다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 개인의 생활패턴을 분석함에 있어서, 궤적 데이터로부터 체류 지점을 추출하고, 해당 체류지점이 어떠한 장소인지 맥락 정보를 생성한 후 공간적 맥락정보와 함께 체류 시작시간, 종 료시간, 체류 시간과 같은 시간적 맥락정보를 함께 사용하여 개인의 생활패턴을 분류하는 방법 및 장치를 제공 하는 것이다. 본 발명이 해결하고자 하는 또 다른 기술적 과제는 사용자의 시공간적 맥락정보를 분석하는 방법에 있어서, 최 근 주목을 받고 있는 표현학습 기반의 벡터 임베딩 방식을 활용하여 공간적 맥락과 함께 시간적 맥락정보를 보 다 세밀하게 파악하는 데 도움을 줄 수 있는 생활 패턴을 분류하는 방법 및 장치를 제공하는 것이다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 본 발명의 과제를 해결하기 위해, 본 발명의 일 실시예에 따른 궤적 데이터를 이용하여 생활 패턴을 분 류하는 방법은, 사용자의 움직임을 나타내는 궤적 데이터로부터 적어도 하나의 체류 지점 추출하는 단계; 상기 적어도 하나의 체류 지점에 대응하는 맥락정보를 벡터 데이터로 임베딩하는 단계; 및 상기 벡터 데이터로부터 추출된 적어도 하나의 군집을 이용하여 상기 사용자의 생활 패턴을 분류하는 단계;를 포함할 수 있다. 다른 측면에 따른 궤적 데이터를 이용하여 생활 패턴을 분류하는 장치는, 적어도 하나의 메모리; 및 적어도 하 나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는, 사용자의 움직임을 나타내는 궤적 데이터로부터 적어도 하나의 체류 지점 추출하고, 상기 적어도 하나의 체류 지점에 대한 대응하는 맥락정보를 생성하고 벡터 데이터로 임베딩하고, 상기 벡터 데이터로부터 추출된 적어도 하나의 군집을 추출하여 이용하여 상기 사용자의 생활 패턴을 분류할 수 있다. 또 다른 측면에 따른 컴퓨터로 읽을 수 있는 기록매체는 상술한 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 기록매체를 포함할 수 있다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 각 시간대에 해당하는 POI(Point of Interest) 정보를 입력하는 방식을 통해 시 공간적 특성을 나타낼 수 있다는 효과가 있다. 또한, 사용자의 시공간 맥락정보를 분석하는 방법에 있어서 표현학습 기반의 벡터 임베딩 방식을 활용하여 공간 적 맥락과 함께 시간적 맥락정보를 보다 세밀하게 파악할 수 있다는 효과가 있다. 또한, 차원 축소를 활용하여 최종목표인 클러스터링을 보다 효율적으로 수행할 수 있다는 효과가 있다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 발명의 개시가 완전하도록 하며, 본 발"}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 본 명세서에서 다양한 곳에 등장하는 \"일부 실시예에서\" 또는 \"일 실시예에서\" 등의 어구는 반드시 모 두 동일한 실시예를 가리키는 것은 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표 현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동 작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이 나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 본 실시예들은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 일부 실시예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 실시예들을 특정한 개시형태에 대해 한정하려는 것이 아니며, 본 실시예들의 사상 및 기술범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한 다. 본 명세서에서 사용한 용어들은 단지 실시예들의 설명을 위해 사용된 것으로, 본 실시예들을 한정하려는 의 도가 아니다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 실시예들에 사용되는 용어들은 다르게 정의되지 않는 한, 본 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으로 사용되는 사전에 정의되어 있는 것 과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 실시 예들에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않아야 한다. 후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기재되 어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실시예 로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미 로서 행하여지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모 든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유 사한 구성요소를 나타낸다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이하에서는 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있도록 하 기 위하여, 본 발명의 여러 실시예에 관하여 첨부된 도면을 참조하여 상세히 설명하기로 한다. 도 1은 궤적 데이터를 이용하여 생활 패턴을 분류하는 장치의 일 예를 설명하기 위한 예시적인 도면이다. 도 1을 참조하면, 궤적 데이터를 이용하여 생활 패턴을 분류하는 장치(이하, '장치'라 함)은 메모리 와 프로세서를 포함할 수 있다. 도 1에 도시된 장치는 본 실시예들과 관련된 구성요소들만이 도시되어 있어, 도 1에 도시된 구성요소들 외"}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "에 다른 범용적인 요소들이 더 포함될 수 있음은 당해 기술분야의 기술자에게 자명하다. 예를 들어, 장치는 노트북(notebook) PC, 데스크탑(desktop) PC, 랩탑(laptop), 태블릿 컴퓨터(tablet computer), 스마트 폰(Smart Phone)을 포함한 모바일 디바이스(Mobile Device), 서버 디바이스(Server Device), 임베디드 디바이스(Embedded Device) 등의 다양한 종류의 디바이스들로 구현될 수 있다. 구체적인 예 로서, 장치는 인공지능을 이용한 음성 인식, 영상 인식, 영상 분류 등을 수행하는 스마트폰, 태블릿 디바 이스, AR(Augmented Reality) 디바이스, IoT(Internet of Things) 디바이스, 자율주행 자동차 등에 해당될 수 있으나, 이에 제한되지 않는다. 나아가서, 장치는 위와 같은 디바이스에 탑재되는 전용 하드웨어 가속기 (HW accelerator)를 포함할 수 있고, 장치는 인공지능 구동을 위한 전용 모듈인 NPU(neural processing unit), TPU(Tensor Processing Unit), Neural Engine 등과 같은 하드웨어 가속기를 포함할 수 있으나, 이에 제 한되지 않는다. 메모리는 장치내에서 처리되는 각종 데이터들을 저장하는 하드웨어로서, 컴퓨터로 판독이 가능한 기 록매체를 포함할 수 있다. 예를 들어, 메모리는 장치에서 처리된 데이터들 및 처리될 데이터들을 저 장할 수 있다. 또한, 메모리는 장치에 의해 구동될 애플리케이션(application)들, 드라이버(driver) 들 등을 저장할 수 있다. 메모리는 휘발성 메모리(volatile memory) 또는 비휘발성 메모리(nonvolatile memory) 중 적어도 하나를 포함할 수 있다. 휘발성 메모리는 DRAM(dynamic random access memory), SRAM(static random access memory), SDRAM(synchronous dynamic random access memory), PRAM(phase-change random access memory), MRAM(magnetic random access memory), RRAM(resistive random access memory), FeRAM(ferroelectric random access memory)등을 포함할 수 있다. 비휘발성 메모리는 ROM(read-only memory), PROM(programmable read-only memory), EPROM(electrically programmable read-only memory), EEPROM(electrically erasable programmable read-only memory)등을 포함할 수 있다. 실시예에 있어서, 메모리는 자기 메모리, CD-ROM, 블루레이 또는 다른 광학 디스크 스토리지, HDD(hard disk drive), SSD(solid state drive), CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), 또는 Memory Stick을 포함할 수 있으나, 이에 제한되지 않는다. 또한, 메모리는 운영체제(Operating System)와 적어도 하나의 프로그램 코드(도 2 내지 도 7을 참조하여 동작하는 프로세서가 수행하기 위한 코드)가 저장될 수 있다. 프로세서는 도 2 내지 도 7을 참조하여, 장치를 실행하기 위한 전반적인 기능을 제어하는 역할을 할 수 있다. 예를 들어 프로세서는 장치내의 메모리에 저장된 소프트웨어(예: 프로그램)를 실행함 으로써, 프로세서에 연결된 전자 장치의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성 요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행하여 장치를 전반적으로 제어할 수 있다. 예를 들어 프로세서는 사용자의 움직임을 나타내는 궤적 데이터로부터 적어도 하나의 체류 지점을 추출할 수 있다. 보다 구체적으로, 프로세서는 궤적 데이터로부터 소정의 거리 이내에 기 설정된 시간 이상으로 머무른 지 점을 적어도 하나의 체류 지점으로 지정할 수 있다. 이때, 체류 지점은 머무른 지점의 위치, 머무른 지점에 체류를 시작한 시간, 체류를 종료한 시간 및 체류한 시 간 중 어느 하나 이상에 대한 정보를 포함하는 것을 특징으로 할 수 있다. 예를 들어 프로세서는 적어도 하나의 체류 지점에 대응하는 맥락정보를 벡터 데이터로 임베딩할 수 있다. 보다 구체적으로, 프로세서는 체류 지점에 대한 관심지점(Point of interest; POI) 정보를 활용하여, 체류 지점의 카테고리 및 키워드 중 어느 하나에 대한 정보를 포함하는 맥락정보를 생성할 수 있다. 예를 들어 프로세서는 벡터 데이터로부터 추출된 적어도 하나의 군집을 이용하여 사용자의 생활 패턴을 분 류할 수 있다. 보다 구체적으로, 프로세서는 벡터 데이터 간의 거리 관계를 유지하면서 벡터 데이터의 차원을 축소할 수 있다. 또한, 프로세서는 차원이 축소된 벡터 데이터에 계층적 밀도 기반의 클러스터링을 수행하여 군집을 추출할 수 있다. 일 실시예에 따르면, 프로세서는 장치 내에 구비된 중앙 처리 장치(central processing unit; CPU), 그래픽 처리 장치(graphics processing unit; GPU), 어플리케이션 프로세서(application processor; AP), 신경 망 처리 장치(neural processing unit; NPU), 이미지 시그널 프로세서(image signal processor; ISP), 센서 허 브 프로세서(sensor hub processor) 또는 커뮤니케이션 프로세서(communication processor; CP) 등으로 구현될 수 있으나, 이에 제한되지 않는다. 도 2는 궤적 데이터를 이용하여 생활 패턴을 분류하는 방법을 도시하기 위한 예시적인 도면이다. 도 2에 도시된 방법은 도 1에 도시된 장치 또는 프로세서에서 시계열적으로 처리되는 단계들로 구성 된다. 따라서, 이하에서 생략된 내용이라고 하더라도 도 1에 도시된 장치 또는 프로세서에 관하여 이 상에서 기술된 내용은 도 2에 도시된 방법에도 적용될 수 있다. 단계 201에서, 프로세서는 사용자의 움직임을 나타내는 궤적 데이터로부터 적어도 하나의 체류 지점을 추 출할 수 있다. 예를 들어, 궤적 데이터는 스마트폰, 웨어러블 워치, 태블릿 디바이스 등 GPS(Global Positioning System)가 내 장된 기기가 위성에 연결되면 기록되는 로그 데이터 및 타임스탬프를 포함하는 정보일 수 있다. 이때 로그 데이 터는 기기의 위치를 나타내는 위경도 값을 의미할 수 있고, 타임스탬프는 로그 데이터가 기록된 시간 정보를 의 미할 수 있다. 프로세서는 수집한 궤적 데이터를 10분, 30분, 60분 등 다양하게 기 설정된 시간 단위로 나눌 수 있지만, 이하에서는 설명의 편의를 위해 궤적 데이터가 10분 단위로 나뉘어진 일 예에 대해 설명하기로 한다. 또한, 프로세서는 복수의 사용자에 대한 개인별 궤적 데이터를 수집할 수 있고, 궤적 데이터에 이상이 있 는 경우 이를 제외한 궤적 데이터만을 수집할 수 있다. 예를 들어, 궤적 데이터에 이상이 있는 경우는 궤적 데이터 중 타임스탬프에 오류가 있거나, 기 설정된 시간 이 상 연속적으로 로그 데이터가 수집되지 않은 경우일 수 있다. 예를 들어, 체류 지점은 궤적 데이터로부터 소정의 거리 이내에 기 설정된 시간 이상으로 머무른 지점을 의미할 수 있고, 프로세서는 궤적 데이터로부터 반경 100미터 이내에 30분 이상 머무른 지점을 체류 지점으로 지 정할 수 있다. 다만, 프로세서가 궤적 데이터로부터 체류 지점을 지정하는 예는 상술한 바에 한정되지 않 는다. 또한, 프로세서는 머무른 지점의 위치, 머무른 지점에 체류를 시작한 시간(start time), 체류를 종료한 시 간(end time) 및 체류한 시간(duration) 중 어느 하나 이상에 대한 정보를 포함하여 체류 지점을 추출할 수 있 다. 단계 201에 대한 자세한 설명은 도 3을 참조하여 후술한다. 단계 202에서, 프로세서는 적어도 하나의 체류 지점에 대응하는 맥락정보를 벡터 데이터로 임베딩 (Embedding)할 수 있다.단계 201에서 추출된 체류 지점이 의미론적으로 해석되기 위해서는 체류 지점이 어떤 성격을 갖는 지점인지에 대한 정보를 포함하는 맥락 정보를 부여해야 한다. 따라서, 프로세서는 체류 지점에 대응하는 맥락 정보를 관심지점(Point of interest; POI) 정보와 연계하여 획득할 수 있다. 관심지점(POI)은 특정 지역 또는 공간에서 사용자가 관심을 가지는 특정 장소, 지점, 또는 개체를 의미할 수 있 다. 예를 들어, 관심지점 정보에는 사용자가 관심을 가질 수 있는 레스토랑, 상점, 관광명소, 주요 시설물, 터 미널 등이 포함될 수 있으나, 이에 한정되지 않는다. 예를 들어, 프로세서는, 한국의 관심지점 정보를, 국토지리정보원의 POI, 지리 정보를 제공하는 민간 기업 (예를 들어, 네이버(Naver) 사, 카카오(Kakao) 사)의 POI 등으로부터 획득할 수 있으나, 이에 한정되지 않는다. 본 발명의 일 실시예에 따르면, 민간 기업에서 제공하는 관심지점 정보가 상대적으로 정보 업데이트 주기가 빠 르고 다양한 정보를 포함하고 있어, 프로세서는 민간 기업에서 제공하는 관심지점 정보 중 정보 갱신 주기 가 빠른 대상(예를 들어, 카카오 사의 POI)를 활용하여 관심지점 정보를 획득할 수 있지만, 이에 제한되는 것은 아니다. 관심지점의 구체적인 명칭보다는 해당 관심지점이 어떤 유형의 장소인지에 대한 정보가 더 중요하기 때문에 프 로세서는 관심지점 정보를 활용하여 체류 지점에 대응하는 카테고리(Category) 및 키워드(Keyword) 중 어 느 하나에 대한 정보를 포함하는 맥락 정보를 생성할 수 있다. 임베딩(Embedding)은 특정 객체나 개념을 고차원 벡터 공간에 매핑(mapping)하는 기법으로, 프로세서는 체 류 지점과 이에 대응하는 맥락정보를 벡터 데이터로 변환하는 임베딩을 수행할 수 있다. 이를 통해 체류 지점과 맥락정보는 서로 연관성을 가지게 된다. 맥락정보를 생성하는 방법에 대한 자세한 설명은 도 4 및 도 5를 참조하여, 체류 지점과 맥락정보를 임베딩하는 과정은 도 6를 참조하여 후술한다. 단계 203에서, 프로세서는 벡터 데이터로부터 추출된 적어도 하나의 군집을 이용하여 사용자의 생활 패턴 을 분류할 수 있다. 생활 패턴(life pattern)은 사용자의 일상적인 활동과 행동을 의미할 수 있다. 이러한 활동과 행동은 사용자의 이동 패턴, 일상 생활에서의 습관, 소비 패턴 등을 포함할 수 있다. 예를 들어, 생활 패턴에는 '카페공부족', '거주지 중심형', '활동형', '이동형', '학생형', '직장인형'등이 있을 수 있으나, 이에 제한되는 것은 아니다. 생활 패턴이 유사한 사용자들끼리는 벡터 공간 상에서 서로 가까이에 위치하며 군집을 형성할 수 있다. 프로세 서는 단계 202에서 생성한 고차원 벡터 데이터를 저차원으로 축소하면서도 원래의 차원에서 가지고 있던 데이터의 특성을 잃지 않도록 매핑할 수 있다. 이후 프로세서는 벡터 데이터 간의 거리 관계를 유지하면서 벡터 데이터의 차원을 2차원으로 축소할 수 있다. 프로세서는 2차원의 벡터 데이터로부터 군집을 추출할 수 있고, 군집별 특성을 분석하여 사용자의 생활 패 턴을 분류할 수 있다. 따라서, 프로세서는 일 예에 따라 사용자의 생활 패턴을 '카페공부족', '거주지 중 심형', '활동형', '이동형', '학생형', '직장인형' 중 어느 하나로 분류할 수 있으나, 이에 제한되는 것은 아니 다. 단계 203에 대한 자세한 설명은 도 7을 참조하여 후술한다. 도 3은 일 실시예에 따른 궤적 데이터로부터 체류 지점을 추출하는 방법을 설명하기 위한 예시적인 도면이다. 도 3을 참조하면, 프로세서는 사람의 움직임을 나타내는 궤적 데이터로부터 하나 이상의 체류 지점 (301, 302)을 추출할 수 있다. 프로세서는 궤적 데이터를 이루는 점을 사용자가 이동하는 과정에 속하는 점과 특정 지점에 체류하여 머무르는 점으로 구분할 수 있다. 사용자의 생활 패턴을 추출하기 위해서는 각 궤적 데이터에서 의미 있는 지점을 찾아야 하고 이는 체류 지 점 탐지를 통해 가능하다. 본 발명의 일 실시예에 따르면, 프로세서는 무빙 판다스(MovingPandas) 라이브 러리의 궤적 체류지점 탐지(TrajectoryStopDetector) 클래스를 활용하여 궤적 데이터로부터 체류 지점(301, 302)을 추출할 수 있다. 무빙 판다스(MovingPandas)는 파이썬(Python) 기반의 라이브러리로, 궤적 데이터와 관련하여 데이터를 시 각화 하거나 분석하기 위한 기능을 제공하는 도구를 의미할 수 있다. 궤적 체류지점 탐지(TrajectoryStopDetector) 클래스는 무빙 판다스(MovingPandas) 라이브러리의 일부로서, 궤 적 데이터에서 일정 기간 동안 정지한 지점을 탐지하는 기능을 제공할 수 있다. 프로세서는 궤적 체 류지점 탐지(TrajectoryStopDetector) 클래스를 활용하여 궤적 데이터에서 사용자가 정지한 위치를 찾아내 고, 이러한 위치들을 체류 지점(301, 302)으로 추출할 수 있다. 이때 사용자의 설정이 필요한 파라미터로는 최대 이동 반경(max_diameter)과 최소 체류 시간(min_duration)이 있을 수 있다. 본 발명의 일 실시예에 따르면 프로세서는 궤적 데이터로부터 반경 100미터 이내에 30 분 이상 머무른 지점을 체류 지점(301, 302)으로 지정할 수 있으므로, 최대 이동 반경(max_diameter)을 100미터, 최소 체류 시간(min_duration)을 30분으로 설정할 수 있다. 따라서, 프로세서는 궤적 데이터에서 일정 지역에서 높은 밀도로 다수의 점들이 몰려 있는 지점을 체 류 지점(301, 302)으로 추출할 수 있다. 또한, 프로세서는 체류 지점과 관련하여, 각 체류 지점에 체류를 시작한 시간(start time), 체류를 종료한 시간(end time), 체류한 시간(duration) 및 체류 지점의 위치 중 어느 하나 이상에 대한 정보를 획득할 수 있다. 도 4는 일 실시예에 따른 체류 지점에 대응하는 맥락정보를 생성하는 방법을 설명하기 위한 예시적인 도면이다. 도 4를 참조하면, 프로세서는 체류지점에 맥락정보를 부여하여 체류지점이 어떤 성격을 갖는 지점인지에 대한 정보를 획득할 수 있다. 구체적으로, 프로세서는 REST API(Representational State Transfer Application Program Interface) 방 식으로 지도 콘텐츠 및 로컬 API를 활용하여 체류 지점과 가장 가까운 관심지점(POI) 정보를 찾을 수 있다. 일 실시예에 따라, 프로세서는 카카오(Kakao) API가 제공하는 기능 중 '카테고리(Category) 검색'과 '키워 드(Keyword) 검색'을 활용하여 관심지점 정보를 획득할 수 있다. 카카오(Kakao) API의 카테고리 검색은 관심지점을 다수의 유형으로 구분하여 정리하고 있다. 예를 들어, 카테고 리 검색은 관심지점의 유형을 대형마트, 편의점, 어린이집 또는 유치원, 학교, 학원, 주차장, 주유소 또는 충전 소, 지하철역, 은행, 문화시설, 중개업소, 공공기관, 관광명소, 숙박, 음식점, 카페, 병원, 약국 등으로 구분할 수 있으나, 이에 제한되는 것은 아니다. 생활 패턴을 분석함에 있어 체류 지점이 주거지인지 여부를 파악하는 것이 중요하다. 하지만 카테고리 검색으로 분류한 관심지점의 유형에는 아파트 혹은 거주지에 대한 정보가 포함되어 있지 않을 수 있다. 따라서, 프로세서 는 키워드 검색을 사용자의 주거지 추정에 활용할 수 있다. 예를 들어, 체류 지점으로 추출된 지점이 주거지 유형이 포함되지 않은 카테고리 검색을 활용하여 분류한 관심 지점보다 키워드 검색에서 아파트를 검색한 결과로 나온 관심지점과의 거리와 더 가까울 경우, 프로세서는 체류 지점을 주거지로 분류할 수 있다. 그러나 민간 기업에서 제공하는 관심지점 정보를 활용하여 주거지를 추정할 경우 아파트는 단지별로 폴리곤 으로 처리되어 아파트 단지의 중심점에 정보가 할당될 수 있다. 따라서, 아파트 단지의 가장자리에 체류 지점이 생성되는 경우 아파트 단지의 중심점과의 거리보다 다른 관심지점과의 거리가 더 가까울 수 있어 프로세서가 체류 지점의 맥락정보를 잘못 생성할 가능성이 있다. 이를 해결하기 위해, 프로세서는 단지별로 폴리곤으로 처리된 아파트의 경우 국가공간정보포털에서 제공하는 건물통합정보 마스터 데이터를 활용할 수 있다. 국가공간정보포털에서 제공하는 건물통합정보 마스터 데이터에는 아파트 동별로 폴리곤 데이터가 구축되어 있어, 프로세서는 아파트 동별로 구축된 폴리곤의 중 심점을 추출하여 사용자의 주거지 추정에 활용할 수 있다. 도 5는 일 실시예에 따른 궤적 데이터로부터 추출한 체류 지점에 대응하는 맥락정보를 생성하는 방법을 설명하 기 위한 예시적인 도면이다. 도 3 및 도 5를 참조하면, 프로세서는 궤적 데이터에서 추출한 체류지점(301, 302)에 관심지점 정보 를 활용하여 맥락정보(501, 502)를 생성할 수 있다. 일 예에 따라 프로세서는 국토지리정보원의 POI, 네이버(Naver) 사의 POI, 카카오(Kakao) 사의 POI 및 국 가공간정보포털에서 제공하는 건물통합정보 마스터 데이터를 활용하여 맥락정보를 생성할 수 있다. 또한, 프로세서는 관심지점의 유형을 대형마트, 편의점, 어린이집 또는 유치원, 학교, 학원, 주차장, 주유 소 또는 충전소, 지하철역, 은행, 문화시설, 중개업소, 공공기관, 관광명소, 숙박, 음식점, 카페, 병원, 약국 등으로 구분할 수 있고, 이 중 몇 가지 유형은 체류지점의 맥락정보를 생성하는 데에 사용하지 않을 수 있다. 예를 들어, 특정 체류 지점들의 경우 밤 시간대에 오랜 시간 머무는 시간적 특성을 고려했을 때 주거지로 추정 되는 것이 맞으나, '어린이집 또는 유치원' 및 '중개업소' 유형은 주로 아파트 단지 내에 위치하고 있어 프로세 서가 체류 지점의 맥락정보를 잘못 생성할 가능성이 있다. 따라서, 프로세서는 '어린이집 또는 유치원' 및 '중개업소' 유형이 주거지와 혼동을 줄 수 있어 두 유형을 제외한 관심지점 정보를 활용하여 맥락정보를 생성할 수 있다. 또한, 체류를 시작한 시간 및 종료한 시간을 고 려했을 때 사용자가 어린이집, 유치원 또는 중개업소의 종사자일 가능성이 낮은 경우에도 프로세서는 두 유형을 제외할 수 있다. 또한, 프로세서는 '주차장', '주유소 또는 충전소', '지하철역' 유형의 경우 본 발명의 일 실시예에서 최 소 체류 시간(min_duration)을 30분으로 설정한 것에 기초할 때 프로세서는 사용자의 생활패턴과 관련성이 높지 않다고 판단할 수 있다. 따라서 프로세서는 '주차장', '주유소 또는 충전소', '지하철역' 유형을 제 외한 관심지점 정보를 활용하여 맥락정보를 생성할 수 있다. 일 예에 따라, 프로세서는 맥락정보 생성에 카카오(Kakao) API가 제공하는 카테고리 중 어린이집 또는 유 치원, 중개업소, 주차장, 주유소 또는 충전소, 지하철역을 제외한 유형과 키워드 중 주거지 및 건물통합정보 마 스터 데이터의 아파트 건물 정보를 활용할 수 있다. 표 1 체류 지점 유형 맥락정보 POI 코드 대형마트(Large supermarket) MT1 1 편의점(Supermarket) CS2 2 학교(School) SC4 3 학원(Private educational institute) AC5 4 은행(Bank) BK9 5 문화 시설(Cultural facilities) CT1 6 공공기관(Public Institution) P03 7 관광명소(Tourist attractions) AT4 8 숙박(Accommodations) AD5 9 음식점(Restaurant) FD6 10 카페(Cafe) CE7 11 병원(Hospitals) HP8 12 약국(Pharmacy) PM9 13 주거지(APT) APT 14 표 1은 체류 지점의 유형에 따라 맥락정보와 POI 코드를 부여한 예시이다. 체류 지점의 유형은 추가되거나 제외 될 수 있고, 맥락정보 및 POI 코드를 부여하는 형식 또한 달라질 수 있음은 본 명세서의 내용이 속하는 기술분 야의 통상의 지식을 가진 자에게 자명하다. 프로세서는 제1 체류 지점의 유형을 학원과 카페로 분류할 수 있고, 표 1에 기초하여 제1 체류 지점 에 AC5와 CE7를 부여하여 맥락정보를 생성할 수 있다. 또한, 프로세서는 제2 체류 지점의 유형을 학교로 분류할 수 있고, 표 1에 기초하여 제2 체류 지점 에 SC4를 부여하여 맥락정보를 생성할 수 있다.도 6은 일 실시예에 따른 맥락정보를 벡터 데이터로 임베딩하는 과정을 설명하기 위한 예시적인 도면이다. 도 6을 참조하면, 프로세서는 체류 지점과 시공간적 맥락 정보를 이용하여 사용자의 생활 패턴을 나타내는 벡터 데이터를 생성할 수 있다. 구체적으로, 프로세서는 사용자마다 수집된 궤적의 길이가 상이하기 때문에 시간적 맥락정보를 정확하게 반영하기 위해 벡터 데이터를 생성할 때 시간 단위로 생성할 수 있다. 프로세서는 수집 기간 동안의 궤적을 분석하여 대표적인 하나 또는 두 개의 궤적만을 활용하여 벡터 데이 터를 생성할 수도 있고, 수집된 모든 궤적을 활용하여 벡터 데이터를 생성할 수도 있지만, 설명의 편의를 위해 이하에서는 수집된 모든 궤적을 활용하는 일 예에 대해 설명하기로 한다. 프로세서는 일 예에 따라 수집 기간을 10분 단위로 나누고, 체류를 시작한 시간(start time), 체류를 종료 한 시간(end time), 체류한 시간(duration) 및 맥락정보를 표 형식으로 데이터를 생성할 수 있다. 따라서, 프로세서가 생성한 데이터는 사용자 차원*수집 기간 차원*10분 단위의 차원을 가질 수 있다. 또한, 프로세서는 데이터에 임베딩 과정을 거쳐 벡터 데이터를 생성할 수 있다. 예를 들어, 0번의 사용자가 10월 26일(수집기간 1일차) 오전 9시 40분부터 오전 11시까지 학교에 머물렀다면, 프로세서는 54번 내지 70번을 표 1을 참조하여 학교에 해당하는 POI 코드인 3번으로 채울 수 있다. 이때, 체류 지점에 속하지 않는 경우 프로세서는 0번으로 채울 수 있다. 체류 지점에 속하지 않는 경우는 이동 과정에 해당하는 경우 또는 어느 지점에 체류하였으나 기 설정된 이동 반 경 및 최소 체류시간을 만족하지 못한 경우를 의미할 수 있다. 수집 기간이 일주일인 경우, 벡터 데이터는 사용자마다 7*144 차원, 즉 1008 차원을 가질 수 있다. 이와 같은 고차원의 벡터 데이터를 저차원으로 축소하면서도 원래 차원에서 가지고 있던 데이터의 특성을 잃지 않고 매핑하기 위해 프로세서는 오토인코더(Auto-encoder)를 사용할 수 있다. 오토인코더(Auto-encoder)는 차원 축소, 데이터 압축, 노이즈 제거, 특성 추출 등 다양한 머신러닝 및 딥러닝 응용분야에서 사용되는 신경망 아키텍처를 의미할 수 있다. 또한, 오토인코더는 비지도 학습 기법으로서, 입력 데이터를 저차원의 표현으로 인코딩하고, 다시 그 표현을 디코딩하여 입력 데이터데 대한 근사 복원을 시도할 수 있다. 오토인코더는 인코더(Encoder)와 디코더(Decoder)를 포함할 수 있고, 본 발명의 일 실시예에 따르면 1개의 은닉 레이어를 추가로 포함할 수 있다. 인코더는 고차원의 벡터 데이터로부터 중요한 특징을 추출하여 저차원의 벡터 데이터로 압축할 수 있고, 디코더는 인코더를 통과하여 저차원으로 압축된 데이터를 고차원의 벡터 데이터와 유사하도록 원본 차원으 로 복원할 수 있다. 프로세서는 오토인코더가 고차원의 벡터 데이터의 특징을 캡처하여 데이터를 재구성할 수 있도록 인 코더 및 디코더의 가중치를 조정할 수 있다. 이때 사용되는 비용 함수는 오토인코더가 고차원의 벡터 데이터 와 디코딩된 데이터 사이의 차이를 최소화하는 방향으로 학습할 수 있도록 정의될 수 있다. 사용자별 궤적 데이터에서 체류 지점으로 추출하고 이를 기반으로 사용자를 군집화하기 위해서 프로세서는 오토인코더로 복원된 벡터 데이터를 2차원 또는 3차원으로 축소할 수 있다. 프로세서는 벡터 데이터를 오토인코더를 이용하여 축소한 후 t-분포 확률적 임베딩(t-distributed stochastic neighbor embedding; t-SEN)을 이용하여 축소할 수 있다. 예를 들어, 프로세서는 일 실시예에 따라 생성된 1008 차원의 벡터 데이터를 오토인코더를 이용하여 40 차원으로 축소한 후 t-분포 확률적 임 베딩을 이용하여 2차원으로 축소할 수 있다. t-분포 확률적 임베딩은 비선형 차원 축소 알고리즘으로, 데이터를 저차원으로 변환하여 데이터 간의 유사성을 보존하면서 시각화하거나 군집을 감지할 수 있다. 프로세서는 고차원 공간에서 서로 가까운 이웃 데이터에는 높은 확률을 부여하고 먼 이웃 데이터에는 낮은 확률을 부여할 수 있도록 데이터 사이의 유사성을 확률 분포로 표현할 수 있다.수학식 1"}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 1은 고차원에 존재하는 데이터 와 가 서로 인접할 확률 를 의미할 수 있다. 수학식 2"}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 2는 고차원에 존재하는 데이터 와 에 각각 대응되는 저차원에 존재하는 데이터 와 가 서로 인 접할 확률 를 의미할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 3은 고차원과 저차원의 확률 분포 사이의 차이를 계산하는 함수로, 쿨백-라이블러 발산(Kullback- Leibler divergence)에 의해 산출되는 비용함수를 의미할 수 있다. 프로세서는 수학식 1 내지 3을 이용하여 고차원 공간에서 가까운 이웃 데이터는 저차원에서 더 가까울 수 있도록, 고차원 공간에서 먼 데이터는 저차원에서 상대적으로 더 멀리 떨어져 있을 수 있도록 매핑할 수 있고, 고차원과 저차원의 확률 분포 사이의 유사성을 최적화할 수 있다. 도 7은 일 실시예에 따른 군집을 이용하여 생활 패턴을 분류하는 방법을 설명하기 위한 예시적인 도면이다. 도 7을 참조하면, 프로세서는 벡터 공간상에서 가까이에 위치한 사용자들을 동일한 생활 패턴으로 분 류할 수 있다. 구체적으로, 프로세서는 저차원으로 축소된 벡터 데이터에 계층적 밀도 기반의 클러스터링(Hierarchical Density-Based Spatial Clustering of Applications with Noise; HDBSCAN) 알고리즘을 사용하여 군집을 추출할 수 있다. 계층적 밀도 기반의 클러스터링은 밀도 기반의 클러스터링 알고리즘인 DBSCAN(Density-Based Spatial Clustering of Application with Noise)에 계층적 클러스터링 개념을 추가한 알고리즘을 의미할 수 있다. 밀도 기반의 클러스터링은 데이터의 밀도를 기반으로 군집화(clustering)하는 알고리즘으로, 데이터 공간 내에 서 특정 밀도 이상으로 밀집한 지역을 군집으로 식별하고 이상치를 탐지할 수 있다. 이때, 특정 밀도는 핵심 포인트 주변에 있는 거리를 나타내는 매개변수인 엡실론(ε) 및 핵심 포인트 주변에 필 요한 최소 이웃 개수를 나타내는 매개변수인 최소 이웃 개수(MinPts)로 정의될 수 있다. 밀도 기반의 클러스터링은 매개변수에 민감하고 밀도에 대한 임계값을 설정하기 때문에 밀도가 다른 군집을 찾 을 수 없어, 프로세서는 계층적 밀도 기반의 클러스터링을 활용하여 엡실론(ε) 값을 고정하지 않고 최소 이웃 개수(MinPts)만을 정의하여 밀도 값이 다른 다양한 군집을 찾을 수 있다.일 예에 따라 프로세서는 벡터 데이터에 계층적 밀도 기반의 클러스터링을 활용하여 6개의 군집과 노이즈 를 추출할 수 있다. 예를 들어, 프로세서는 군집 0에 해당하는 사용자의 생활 패턴이 낮 시간대(예를 들어, 14시~18시)에는 카 페에서 체류하고 저녁 시간대(예를 들어, 20시~22시)에는 주로 학원에서 체류하는 것에 대응하여 군집 0의 사용 자의 생활 패턴을 '카페공부족'으로 분류할 수 있다. 또한, 프로세서는 군집 1에 해당하는 사용자의 생활 패턴이 시간대 구분 없이 하루 중 대부분을 주거지에 체류하는 것에 대응하여 군집 1의 사용자의 생활 패턴을 '거주지 중심형'으로 분류할 수 있다. 또한, 프로세서는 군집 2에 해당하는 사용자의 생활 패턴이 낮(예를 들어, 14시~18시)에는 학교, 학원, 음 식점, 은행, 문화시설 등 다양한 곳에 체류하고 체류 시간대나 순서가 다양한 것에 대응하여 군집 2의 사용자의 생활 패턴을 '활동형'으로 분류할 수 있다. 또한, 프로세서는 군집 3에 해당하는 사용자의 생활 패턴이 낮 시간대에 체류한 지점이 적은 것에 대응하 여 군집 3의 사용자의 생활 패턴을 '제1 이동형'으로 분류할 수 있다. 또한, 프로세서는 군집 4에 해당하는 사용자의 생활 패턴이 낮 시간 대에 거주지에 머물거나 이동하는 것 에 대응하여 군집 4의 사용자의 생활 패턴을 '제2 이동형'으로 분류할 수 있다. 또한, 프로세서는 군집 5에 해당하는 사용자의 생활 패턴이 오전과 낮(예를 들어, 10시~15시)에는 주로 학 교에 체류하고 낮 시간대(예를 들어, 12시~14시)에는 음식점을 방문하며 저녁 시간대(예를 들어, 18시~22시)에 는 거주지로 귀가하는 것에 대응하여 군집 5의 사용자의 생활 패턴을 '학생형'으로 분류할 수 있다."}
{"patent_id": "10-2023-0112992", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "전술한 본 명세서의 설명은 예시를 위한 것이며, 본 명세서의 내용이 속하는 기술분야의 통상의 지식을 가진 자 는 본 발명의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아 닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으 며, 마찬가지로 분산된 것으로 설명되어 있는 구성요소들도 결합된 형태로 실시될 수 있다. 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 발명이 한정되는 것은 아니 다. 본 발명에서 모든 예들 또는 예시적인 용어(예를 들어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2023-0112992", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 궤적 데이터를 이용하여 생활 패턴을 분류하는 장치의 일 예를 설명하기 위한 예시적인 도면이다. 도 2는 궤적 데이터를 이용하여 생활 패턴을 분류하는 방법을 도시하기 위한 예시적인 도면이다. 도 3은 일 실시예에 따른 궤적 데이터로부터 체류 지점을 추출하는 방법을 설명하기 위한 예시적인 도면이다. 도 4는 일 실시예에 따른 체류 지점에 대응하는 맥락정보를 생성하는 방법을 설명하기 위한 예시적인 도면이다. 도 5는 일 실시예에 따른 궤적 데이터로부터 추출한 체류 지점에 대응하는 맥락정보를 생성하는 방법을 설명하 기 위한 예시적인 도면이다. 도 6은 일 실시예에 따른 맥락정보를 벡터 데이터로 임베딩하는 과정을 설명하기 위한 예시적인 도면이다. 도 7은 일 실시예에 따른 군집을 이용하여 생활 패턴을 분류하는 방법을 설명하기 위한 예시적인 도면이다."}
