{"patent_id": "10-2023-0005629", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0113270", "출원번호": "10-2023-0005629", "발명의 명칭": "인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법", "출원인": "동의과학대학교산학협력단", "발명자": "김태훈"}}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 지역에 각각 설치되어 교통 신호 제어 알고리즘을 탑재하고, 차량 대기 및 주행 상태 검출을 하고 보행자 대기 및 횡단 상태 검출을 하여 보행자 유무 및 보행자 수에 따라 보행자 횡단 안전시간 내에서 보행자 신호등의 녹색 보행자 신호등과 적색 보행자 신호등의 점소등을 유동적으로 제어하는 교통 신호 제어 장치들;복수 개의 교통 신호 제어 장치들을 관리하고, 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후정보, 교통량 및 유동 인구 정보를 분석하여 교통 신호 제어 장치의 교통 신호 제어 알고리즘을 업데이트하는스마트 교통 신호 제어 관리 서버;를 포함하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 교통 신호 제어 장치는,교차로에서의 차량 대기 상태를 기준으로 신호 변경 및 유지 시간을 최적화하여 차량 및 보행자의 대기 시간을줄이는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 교차로의 좌회전 차량의 대기 상태를 기준으로 좌회전 신호를 주지 않거나, 대기 상태의 차량 대수에 따라 신호 주기 및 유지 시간을 유동적으로 제어하는 것을 특징으로 하는 인공지능을 이용한 스마트교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 교통 신호 제어 장치는,현장에서의 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과에 더하여, 스마트 교통 신호 제어 관리 서버로부터 제공받은 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및유동 인구 정보의 분석 결과에 따라 신호 변경 및 유지 시간을 최적화하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 교통 신호 제어 장치는,스마트 교통 신호 제어 관리 서버로부터 업데이트 정보를 받는 교통 신호 제어 알고리즘을 관리하고, 현장에서의 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과를 기준으로 신호 변경 및 유지 시간을 최적화하는 교통 신호 제어 알고리즘 관리부와,차량 대기 및 주행 차량의 통과 대수 등의 상태 검출을 하는 차량 대기 및 주행 상태 검출부와,보행자 대기 및 횡단 상태 검출을 하는 보행자 대기 및 횡단 상태 검출부와, 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과를 기준으로 차량 신호등을 제어하는차량 신호등 제어부 및 보행자 신호등을 제어하는 보행자 신호등 제어부를 포함하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 스마트 교통 신호 제어 관리 서버는,외부의 서버들로부터 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 정보를 포함하는 빅데이터를 수집하는 빅데이터 수집부와,공개특허 10-2024-0113270-3-지역 연계 교통 정보 분석, 시간 및 위치 정보 분석, 해당 지역 및 국가 행사 정보 분석, 기후 정보 분석, 교통량 및 유동 인구 분석을 수행하는 인공지능 분석부와,인공지능 분석부의 분석 결과를 반영하여 교통 신호 제어 알고리즘을 업데이트하여 교통 신호 제어 장치로 제공하는 교통 신호 제어 장치 관리부를 포함하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 인공지능 분석부는,교통 신호 제어 장치가 설치된 지역의 지역 연계 교통 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수있도록 하는 지역 연계 교통 정보 분석 반영부와. 교통 신호 제어 장치가 설치된 지역의 시간대별 위치별 교통 흐름 정보를 분석하여 교통 신호 제어 알고리즘에반영할 수 있도록 하는 시간 및 위치 정보 분석 반영부와,해당 지역 및 국가 행사 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 행사 정보 분석 반영부와,해당 일시의 기후 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 기후 정보 분석반영부와,교통 신호 제어 장치가 설치된 지역의 교통량 및 유동 인구 분석을 하여 교통 신호 제어 알고리즘에 반영할 수있도록 하는 교통량 및 유동 인구 분석 반영부를 포함하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 행사 정보 분석 반영부는,행사 성격에 따른 교통 통제 정보를 반영하여 차량 및 보행자 신호등을 제어하여 신호 변경 및 유지 시간을 최적화하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서, 기후 정보 분석 반영부는,비,눈,안개를 포함하는 기후 정보 및 낮과 밤 상태 정보를 반영하여 차량 및 보행자 신호등을 제어하여 신호 변경 및 유지 시간을 최적화하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 장치."}
{"patent_id": "10-2023-0005629", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "스마트 교통 신호 제어 관리 서버에서 외부 서버들을 통하여 빅데이터 수집하는 단계;수집된 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 분석을 하여 교통 신호 제어 알고리즘을 업데이트하는 단계;업데이트된 교통 신호 제어 알고리즘을 기반으로 차량 대기 및 주행 상태 검출을 하고, 보행자 대기 및 횡단 상태 검출을 하여 차량 신호등 및 보행자 신호등 제어하는 단계;를 포함하는 것을 특징으로 하는 인공지능을 이용한 스마트 교통 신호 제어 방법."}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 도로의 보행자 및 차량의 유무를 확인하여 교통 신호 체계를 주기적으로 변경하여 효율적인 교통 흐름 제어가 가능하도록 한 인공지능을 이용한 스마트 교통 신호 장치 및 이의 제어 방법에 관한 것으로, 복수의 지역 에 각각 설치되어 교통 신호 제어 알고리즘을 탑재하고, 차량 대기 및 주행 상태 검출을 하고 보행자 대기 및 횡 단 상태 검출을 하여 보행자 유무 및 보행자 수에 따라 보행자 횡단 안전시간 내에서 보행자 신호등의 녹색 보행 자 신호등과 적색 보행자 신호등의 점소등을 유동적으로 제어하는 교통 신호 제어 장치들;복수 개의 교통 신호 제어 장치들을 관리하고, 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 정보를 분석하여 교통 신호 제어 장치의 교통 신호 제어 알고리즘을 업데이트하는 스마트 교통 신호 제어 관리 서버;를 포함하는 것이다."}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 도로 교통 신호 시스템에 관한 것으로, 구체적으로 도로의 보행자 및 차량 유무를 확인하여 교통 신 호 체계를 주기적으로 변경하여 효율적인 교통 흐름 제어가 가능하도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 도로에는 차량 운전자 및 보행자의 안전 보행을 위하여 차량 및 보행자 신호등이 포함되는 교통 신 호등이 설치되는데, 종래 기술의 교통 신호등은 차량이나 보행자의 유무에 관계없이 주기적으로 녹색 또는 적색 신호등이 반복적으로 점등된다. 따라서, 횡단보도를 횡단하는 보행자가 없는 경우에도 차량은 신호 대기를 위해 정지하여야 하므로, 차량의 신 호 대기중에 불필요한 연료의 손실이 발생하고 신호 대기에 따른 차량의 지체로 인하여 교통 소통이 원활하지 못하고 운전 시간이 많이 소요되는 문제점이 있었다. 이와 같이 교통을 제어하기 위한 신호등은 안전한 교통 흐름 제어를 위하여 반드시 필요한 장치이나, 현재의 교 통 상황이 실시간 반영되지 않고 미리 설정된 방식에 의해 제어된다. 즉, 시간별 통계에 따라서 확인된 정보를 바탕으로 시간별 흐름 제어를 수행한다. 이러한 종래 기술의 경우에는 실시간 교통 상황에 맞는 제어가 어렵다. 예를 들면, 보행자가 없는 경우에도 보행 신호가 들어오고 좌회건 차량이 없는 경우에도 좌회전 신호가 배정되 어 필요 없는 교통 신호로 인하여 교통 흐름 제어의 효율이 낮아지는 문제가 있다. 따라서, 교통 신호 체계를 개선하여 효율적인 교통 흐름 제어가 가능하도록 하는 새로운 기술의 개발이 요구되 고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-2345465호 (특허문헌 0002) 대한민국 공개특허 제10-2022-0112607호 (특허문헌 0003) 대한민국 공개특허 제10-2009-0110130호"}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 종래 기술의 도로 교통 신호 시스템의 문제점을 해결하기 위한 것으로, 도로의 보행자 및 차량 유무 를 확인하여 교통 신호 체계를 교통 상황에 맞게 주기적으로 변경하여 효율적인 교통 흐름 제어가 가능하도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법을 제공하는데 그 목적이 있다. 본 발명은 교통량이 많은 출퇴근 시간에 인공 지능을 이용하여 교통 상황을 실시간으로 인식하여 불필요한 신호 가 주어지는 것을 차단하여 차량 및 보행자의 대기 시간을 줄여 교통 흐름을 개선할 수 있도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법을 제공하는데 그 목적이 있다. 본 발명은 도로를 건너려는 보행자의 대기 상태 인식 및 횡단중의 보행자 인식에 의한 신호 유지 및 변경을 제 어하여 보행자의 안전한 도로 횡단이 가능하도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법을 제공하는데 그 목적이 있다. 본 발명은 교차로에서의 차량 대기 상태를 기준으로 신호 변경 및 유지 시간을 최적화하여 차량 및 보행자의 대 기 시간을 줄여 교통 흐름을 개선할 수 있도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법을 제 공하는데 그 목적이 있다. 본 발명은 인공 지능을 이용한 빅데이터 분석으로 시간대, 위치, 지역 및 국가 행사 정보, 출퇴근 인원 정보, 주변 지하철 역의 운행 시간 정보, 유동 인구수 정보를 반영하여 학습하여 최적의 교통 흐름 제어가 가능하도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법을 제공하는데 그 목적이 있다. 본 발명은 인공지능을 이용한 영상 분석 기술을 이용하여 횡단보도가 있는 교차로에서의 보행자 인식 및 검출과 차량 인식 및 검출이 외부 요인에 강인하고 정확하게 이루어지도록 한 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법을 제공하는데 그 목적이 있다. 본 발명의 다른 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치는 복수의 지 역에 각각 설치되어 교통 신호 제어 알고리즘을 탑재하고, 차량 대기 및 주행 상태 검출을 하고 보행자 대기 및 횡단 상태 검출을 하여 보행자 유무 및 보행자 수에 따라 보행자 횡단 안전시간 내에서 보행자 신호등의 녹색 보행자 신호등과 적색 보행자 신호등의 점소등을 유동적으로 제어하는 교통 신호 제어 장치들;복수 개의 교통 신호 제어 장치들을 관리하고, 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유 동 인구 정보를 분석하여 교통 신호 제어 장치의 교통 신호 제어 알고리즘을 업데이트하는 스마트 교통 신호 제 어 관리 서버;를 포함하는 것을 특징으로 한다. 여기서, 교통 신호 제어 장치는, 교차로에서의 차량 대기 상태를 기준으로 신호 변경 및 유지 시간을 최적화하 여 차량 및 보행자의 대기 시간을 줄이는 것을 특징으로 한다. 그리고 교차로의 좌회전 차량의 대기 상태를 기준으로 좌회전 신호를 주지 않거나, 대기 상태의 차량 대수에 따 라 신호 주기 및 유지 시간을 유동적으로 제어하는 것을 특징으로 한다. 그리고 교통 신호 제어 장치는, 현장에서의 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과에 더하여, 스마트 교통 신호 제어 관리 서버로부터 제공받은 지역 연계 교통 정보, 시간 및 위치 정보, 행 사 정보, 기후 정보, 교통량 및 유동 인구 정보의 분석 결과에 따라 신호 변경 및 유지 시간을 최적화하는 것을 특징으로 한다. 그리고 교통 신호 제어 장치는, 스마트 교통 신호 제어 관리 서버로부터 업데이트 정보를 받는 교통 신호 제어 알고리즘을 관리하고, 현장에서의 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과를 기준으로 신호 변경 및 유지 시간을 최적화하는 교통 신호 제어 알고리즘 관리부와, 차량 대기 및 주행 차량의 통과 대수 등의 상태 검출을 하는 차량 대기 및 주행 상태 검출부와, 보행자 대기 및 횡단 상태 검출을 하는 보 행자 대기 및 횡단 상태 검출부와, 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과를 기준으로 차량 신호등을 제어하는 차량 신호등 제어부 및 보행자 신호등을 제어하는 보행자 신호등 제어부를 포 함하는 것을 특징으로 한다. 그리고 스마트 교통 신호 제어 관리 서버는, 외부의 서버들로부터 지역 연계 교통 정보, 시간 및 위치 정보, 행 사 정보, 기후 정보, 교통량 및 유동 인구 정보를 포함하는 빅데이터를 수집하는 빅데이터 수집부와, 지역 연계 교통 정보 분석, 시간 및 위치 정보 분석, 해당 지역 및 국가 행사 정보 분석, 기후 정보 분석, 교통량 및 유동 인구 분석을 수행하는 인공지능 분석부와, 인공지능 분석부의 분석 결과를 반영하여 교통 신호 제어 알고리즘을 업데이트하여 교통 신호 제어 장치로 제공하는 교통 신호 제어 장치 관리부를 포함하는 것을 특징으로 한다. 그리고 인공지능 분석부는, 교통 신호 제어 장치가 설치된 지역의 지역 연계 교통 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 지역 연계 교통 정보 분석 반영부와. 교통 신호 제어 장치가 설치된 지 역의 시간대별 위치별 교통 흐름 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 시간 및 위치 정보 분석 반영부와, 해당 지역 및 국가 행사 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도 록 하는 행사 정보 분석 반영부와, 해당 일시의 기후 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있 도록 하는 기후 정보 분석 반영부와, 교통 신호 제어 장치가 설치된 지역의 교통량 및 유동 인구 분석을 하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 교통량 및 유동 인구 분석 반영부를 포함하는 것을 특징으로 한다. 그리고 행사 정보 분석 반영부는, 행사 성격에 따른 교통 통제 정보를 반영하여 차량 및 보행자 신호등을 제어 하여 신호 변경 및 유지 시간을 최적화하는 것을 특징으로 한다. 그리고 기후 정보 분석 반영부는, 비,눈,안개를 포함하는 기후 정보 및 낮과 밤 상태 정보를 반영하여 차량 및 보행자 신호등을 제어하여 신호 변경 및 유지 시간을 최적화하는 것을 특징으로 한다. 다른 목적을 달성하기 위한 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 방법은 스마트 교통 신호 제어 관리 서버에서 외부 서버들을 통하여 빅데이터 수집하는 단계;수집된 지역 연계 교통 정보, 시간 및 위치정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 분석을 하여 교통 신호 제어 알고리즘을 업데이트하는 단 계;업데이트된 교통 신호 제어 알고리즘을 기반으로 차량 대기 및 주행 상태 검출을 하고, 보행자 대기 및 횡단 상태 검출을 하여 차량 신호등 및 보행자 신호등 제어하는 단계;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같은 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법은 다음과 같은 효과가 있다. 첫째, 도로의 보행자 및 차량 유무를 확인하여 교통 신호 체계를 교통 상황에 맞게 주기적으로 변경하여 효율적 인 교통 흐름 제어가 가능하도록 한다. 둘째, 교통량이 많은 출퇴근 시간에 인공 지능을 이용하여 교통 상황을 실시간으로 인식하여 불필요한 신호가 주어지는 것을 차단하여 차량 및 보행자의 대기 시간을 줄여 교통 흐름을 개선할 수 있도록 한다. 셋째, 도로를 건너려는 보행자의 대기 상태 인식 및 횡단중의 보행자 인식에 의한 신호 유지 및 변경을 제어하 여 보행자의 안전한 도로 횡단이 가능하도록 한다. 넷째, 교차로에서의 차량 대기 상태를 기준으로 신호 변경 및 유지 시간을 최적화하여 차량 및 보행자의 대기 시간을 줄여 교통 흐름을 개선할 수 있도록 한다. 다섯째, 인공 지능을 이용한 빅데이터 분석으로 시간대, 위치, 지역 및 국가 행사 정보, 출퇴근 인원 정보, 주 변 지하철 역의 운행 시간 정보, 유동 인구수 정보를 반영하여 학습하여 최적의 교통 흐름 제어가 가능하도록 한다. 여섯째, 인공지능을 이용한 영상 분석 기술을 이용하여 횡단보도가 있는 교차로에서의 보행자 인식 및 검출과, 차량 인식 및 검출이 외부 요인에 강인하고 정확하게 이루어지도록 한다."}
{"patent_id": "10-2023-0005629", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법의 바람직한 실시 예에 관하여 상 세히 설명하면 다음과 같다. 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법의 특징 및 이점들은 이하에서의 각 실 시 예에 대한 상세한 설명을 통해 명백해질 것이다. 도 1은 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치의 구성도이다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 특히, 적어도 하나의 기능이나 동작을 처리하는 단위들은 적어도 하나의 프로세서를 포함하는 전자 장치로 구현 될 수 있고, 기능이나 동작을 처리하는 방식에 따라 전자 장치에 적어도 하나의 주변 장치가 연결될 수 있다. 주변 장치들은 데이터 입력 장치, 데이터 출력 장치, 데이터 저장 장치를 포함할 수 있다. 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법은 도로의 보행자 및 차량 유무를 확인 하여 교통 신호 체계를 교통 상황에 맞게 주기적으로 변경하여 효율적인 교통 흐름 제어가 가능하도록 한 것이다. 이를 위하여, 본 발명은 교통량이 많은 출퇴근 시간에 인공 지능을 이용하여 교통 상황을 실시간으로 인식하여 불필요한 신호가 주어지는 것을 차단하여 차량 및 보행자의 대기 시간을 줄여 교통 흐름을 개선할 수 있도록 하 는 구성을 포함할 수 있다. 본 발명은 도로를 건너려는 보행자의 대기 상태 인식 및 횡단중의 보행자 인식에 의한 신호 유지 및 변경을 제 어하여 보행자의 안전한 도로 횡단이 가능하도록 하는 구성을 포함할 수 있다. 본 발명은 교차로에서의 차량 대기 상태를 기준으로 신호 변경 및 유지 시간을 최적화하여 차량 및 보행자의 대 기 시간을 줄여 교통 흐름을 개선할 수 있도록 하는 구성을 포함할 수 있다. 본 발명은 인공 지능을 이용한 빅데이터 분석으로 시간대, 위치, 지역 및 국가 행사 정보, 출퇴근 인원 정보, 주변 지하철 역의 운행 시간 정보, 유동 인구수 정보, 기후 정보를 반영하여 학습하여 최적의 교통 흐름 제어가 가능하도록 하는 구성을 포함할 수 있다. 본 발명은 인공지능을 이용한 영상 분석 기술을 이용하여 횡단보도가 있는 교차로에서의 보행자 인식 및 검출과 차량 인식 및 검출이 외부 요인에 강인하고 정확하게 이루어지도록 하는 구성을 포함할 수 있다. 특히, 본 발명은 횡단 보도를 횡단하기 위해 대기하는 대기 보행자의 유무 및 보행자 수를 파악하여 보행자 유 무 및 보행자 수에 따라 보행자 횡단 안전시간 내에서 보행자 신호등의 녹색 보행자 신호등과 적색 보행자 신호 등의 점소등을 유동적으로 제어하는 구성을 포함할 수 있다. 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치는 도 1에서와 같이, 복수의 지역에 각각 설치되 어 교통 신호 제어 알고리즘을 탑재하고, 차량 대기 및 주행 상태 검출을 하고 보행자 대기 및 횡단 상태 검출 을 하여 보행자 유무 및 보행자 수에 따라 보행자 횡단 안전시간 내에서 보행자 신호등의 녹색 보행자 신호등과 적색 보행자 신호등의 점소등을 유동적으로 제어하는 교통 신호 제어 장치와, 복수 개의 교통 신호 제어 장치들을 관리하고, 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인 구 정보를 분석하여 교통 신호 제어 장치의 교통 신호 제어 알고리즘을 업데이트하는 스마트 교통 신호 제 어 관리 서버를 포함한다. 여기서, 교통 신호 제어 장치는 현장에서의 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡단 상태 검출 결과에 더하여 스마트 교통 신호 제어 관리 서버로부터 제공받은 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 정보의 분석 결과에 따라 신호 변경 및 유지 시간을 최적화 한다. 그리고 교통 신호 제어 장치는 교차로에서의 차량 대기 상태를 기준으로 신호 변경 및 유지 시간을 최적화 하여 차량 및 보행자의 대기 시간을 줄일 수 있도록 한다. 일 예로, 교차로의 좌회전 차량의 대기 상태를 기준으로 좌회전 신호를 주지 않거나, 대기 상태의 차량 대수에 따라 신호 주기 및 유지 시간을 유동적으로 제어할 수 있다. 교통 신호 제어 장치의 상세 구성은 다음과 같다. 도 2는 교통 신호 제어 장치의 상세 구성도이다. 교통 신호 제어 장치는 도 2에서와 같이, 스마트 교통 신호 제어 관리 서버로부터 업데이트 정보를 받는 교통 신호 제어 알고리즘을 관리하고, 현장에서의 차량 대기 및 주행 상태 검출 결과, 보행자 대기 및 횡 단 상태 검출 결과를 기준으로 신호 변경 및 유지 시간을 최적화하는 교통 신호 제어 알고리즘 관리부와, 차량 대기 및 주행 차량의 통과 대수 등의 상태 검출을 하는 차량 대기 및 주행 상태 검출부와, 보행자 대 기 및 횡단 상태 검출을 하는 보행자 대기 및 횡단 상태 검출부와, 차량 대기 및 주행 상태 검출 결과, 보 행자 대기 및 횡단 상태 검출 결과를 기준으로 차량 신호등을 제어하는 차량 신호등 제어부 및 보행자 신호 등을 제어하는 보행자 신호등 제어부를 포함한다.여기서, 차량 대기 및 주행 상태 검출부, 보행자 대기 및 횡단 상태 검출부는 영상 획득 수단 및 인공 지능 기반 객체 인식 및 분석 수단을 포함할 수 있다. 일 예로, 차량 대기 및 주행 상태 검출부, 보행자 대기 및 횡단 상태 검출부는 신호등이 위치한 횡단보 도 및 차량 정지선과 관련해서 미리 설정된 관심 영역에 대한 영상 정보를 획득하고, 획득된 영상 정보 내에서 딥 러닝 방식에 의해 객체의 존재 유무를 판단하고, 영상 정보 내의 객체에 대한 고유 식별자를 설정하여 추적 하고, 객체의 보행 의사 또는 진입 의사를 확인하여 객체와 관련한 신호등의 동작 상태를 제어할 수 있도록 한 다. 구체적으로, 보행자 대기 및 횡단 상태 검출부는 횡단보도의 진입측에서 보행자의 이동 상태를 촬영하는 촬 영부와, 촬영부를 통해 촬영된 영상을 기반으로 보행자인식 알고리즘을 통하여 보행자를 인식 및 검출하는 영상 처리 수단을 포함할 수 있다. 촬영부는 횡단보도의 진입측에 인접하여 설치되거나, 횡단보도에 인접한 차량용 신호장치에 인접하여 설치되거 나, 보행자 신호등의 설치기둥에 설치될 수 있고, 이로 제한되지 않는다. 촬영부는 별도 구성으로 횡단보도의 진입측에서 보행자의 이동 상태를 촬영할 수 있다. 또한, 촬영부는 도로 상 에서 횡단보도를 촬영하는 CCTV를 포함하여 CCTV를 통해 횡단보도의 진입측에서 보행자의 이동 상태를 촬영할 수도 있다. 그리고 차량 대기 및 주행 상태 검출부는 횡단보도에서의 차량 접근 및 대기상태를 촬영하는 촬영부와, 촬 영부를 통해 촬영된 영상을 기반으로 차량인식 알고리즘을 통하여 차량을 인식 및 검출하는 영상처리 수단을 포 함할 수 있다. 차량 인식 수단으로 레이더센서, 레이저센서, 라이다(Lidar)센서 중 적어도 어느 하나를 통해 횡단보도에서의 차량 접근 및 대기상태를 인식할 수도 있다. 이와 같은 촬영부 또는 차량 인식 수단은 횡단보도의 진입측에 인접하여 설치되거나, 횡단보도에 인접한 차량용 신호장치에 인접하여 설치되거나, 보행자 신호등의 설치기둥에 설치될 수도 있다. 그리고 차량 대기 및 주행 상태 검출부, 보행자 대기 및 횡단 상태 검출부는 인공지능 기반 객체 인식 및 분석을 위한 알고리즘으로 R-CNN, Fast R-CNN, Faster R-CNN, R-FCN, YOLO, SSD들 중의 어느 하나를 사용할 수 있고, 이로 제한되지 않는다. 스마트 교통 신호 제어 관리 서버의 상세 구성은 다음과 같다. 도 3은 스마트 교통 신호 제어 관리 서버의 상세 구성도이다. 스마트 교통 신호 제어 관리 서버는 도 3에서와 같이, 외부의 서버들로부터 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 정보를 포함하는 빅데이터를 수집하는 빅데이터 수집부 와, 지역 연계 교통 정보 분석, 시간 및 위치 정보 분석, 해당 지역 및 국가 행사 정보 분석, 기후 정보 분 석, 교통량 및 유동 인구 분석을 수행하는 인공지능 분석부와, 인공지능 분석부의 분석 결과를 반영하 여 교통 신호 제어 알고리즘을 업데이트하여 교통 신호 제어 장치로 제공하는 교통 신호 제어 장치 관리부 를 포함한다. 인공지능 분석부의 상세 구성은 다음과 같다. 도 4는 인공지능 분석부의 상세 구성도이다. 인공지능 분석부는 도 4에서와 같이, 교통 신호 제어 장치가 설치된 지역의 지역 연계 교통 정보를 분 석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 지역 연계 교통 정보 분석 반영부와. 교통 신호 제어 장치가 설치된 지역의 시간대별 위치별 교통 흐름 정보를 분석하여 교통 신호 제어 알고리즘에 반영 할 수 있도록 하는 시간 및 위치 정보 분석 반영부와, 해당 지역 및 국가 행사 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 행사 정보 분석 반영부와, 해당 일시의 기후 정보를 분석하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 기후 정보 분석 반영부와, 교통 신호 제어 장치가 설치 된 지역의 교통량 및 유동 인구 분석을 하여 교통 신호 제어 알고리즘에 반영할 수 있도록 하는 교통량 및 유동 인구 분석 반영부를 포함한다. 여기서, 행사 정보 분석 반영부는 행사 성격에 따라 교통 통제가 있는 경우에는 교통 통제 정보를 반영하여 차량 및 보행자 신호등을 제어하여 신호 변경 및 유지 시간을 최적화한다. 그리고 기후 정보 분석 반영부는 비,눈,안개 등의 기후 정보 및 낮과 밤 상태 정보를 반영하여 차량 및 보 행자 신호등을 제어하여 신호 변경 및 유지 시간을 최적화한다. 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 방법을 구체적으로 설명하면 다음과 같다. 도 5는 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 방법을 나타낸 플로우 차트이다. 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 방법은 스마트 교통 신호 제어 관리 서버에서 외부 서버들을 통하여 빅데이터 수집하는 단계(S501)와, 수집된 지역 연계 교통 정보, 시간 및 위치 정보, 행사 정보, 기후 정보, 교통량 및 유동 인구 분석을 하여 교통 신호 제어 알고리즘을 업데이트하는 단계(S502)와, 업 데이트된 교통 신호 제어 알고리즘을 기반으로 차량 대기 및 주행 상태 검출을 하고, 보행자 대기 및 횡단 상태 검출을 하여 차량 신호등 및 보행자 신호등 제어하는 단계(S503)를 포함한다. 이상에서 설명한 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치 및 방법은 도로의 보행자 및 차량 유무를 확인하여 교통 신호 체계를 교통 상황에 맞게 주기적으로 변경하여 효율적인 교통 흐름 제어가 가 능하도록 한 것이다. 본 발명은 도로를 건너려는 보행자의 대기 상태 인식 및 횡단중의 보행자 인식에 의한 신호 유지 및 변경을 제 어하여 보행자의 안전한 도로 횡단이 가능하도록 한 것이다. 이상에서의 설명에서와 같이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 본 발명이 구 현되어 있음을 이해할 수 있을 것이다. 그러므로 명시된 실시 예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 하고, 본 발명의 범위는 전술한 설명이 아니라 특허청구 범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0005629", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 장치의 구성도 도 2는 교통 신호 제어 장치의 상세 구성도 도 3은 스마트 교통 신호 제어 관리 서버의 상세 구성도 도 4는 인공지능 분석부의 상세 구성도 도 5는 본 발명에 따른 인공지능을 이용한 스마트 교통 신호 제어 방법을 나타낸 플로우 차트"}
