{"patent_id": "10-2022-0025570", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0127810", "출원번호": "10-2022-0025570", "발명의 명칭": "수소연료전지를 이용한 스마트팜 에너지공급 시스템", "출원인": "주식회사 플랜티", "발명자": "장영철"}}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "독립적이고 안정적인 전력 에너지 및 냉난방 부하를 필요로 하는 농축산물을 자동화하여 생육시키는 스마트팜에 대해서, 수소 연료전지에서 발생하는 직류를 교류로 변환하여 전력을 공급하고, 수소 연료전지에서 발생하는섭씨 60도 이상의 온수를 스마트팜 내 냉난방기와 연결된 열교환기로 공급하는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 대해서, 수소 연료전지에서 발생하는 섭씨 60도 이상의 온수 또는 수증기가 열교환기로 공급되어 열전달을 통해 온도가 상승한 열매(thermal medium)가 스마트팜 내 난방열원으로 사용되고 폐순환루프를 통해 연속적으로 열에너지를 공급하는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 대해서, 수소 연료전지에서 발생하는 섭씨 60도 이상의 온수 또는 수증기가 열교환기로 공급되어열전달을 통해 온도가 상승한 열매(thermal medium)가 스마트팜내 설치된 냉방기를 작동시키는 흡수식 냉동기의열원으로 사용되는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 대해서, 수소 연료전지에서 발생하는 섭씨 60도 이상의 온수 또는 수증기가 열교환기로 공급되고나서 열전달을 통해 냉각된 이후 온도가 낮아진 초순수 상태로 필요한 성분의 영양분이 용해되어 스마트팜내 농축산물 생육에 필요한 배양액 또는 수자원 공급원으로 활용하는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 대해서, 수소 연료전지에서 발생하는 섭씨 60도 이상의 온수 또는 수증기가 열교환기로 공급되고나서 열전달을 통해 냉각된 이후 스마트팜 내 수자원 공급원으로 필요한 시기에 적절히 활용하기 위해 저장탱크로 공급되어 저장되었다가 가압되어 스마트팜 내에서 사용되는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 대해서 스마트팜의 대상으로 하는 농축산물의 정밀농업 방식에 따라 물부하, 전기부하, 냉난방 부하를 스캐쥴링하여, 이를 프로그램화하여 계획적으로 운용하는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 대해서 독립적이고 안정적인 전력 에너지 및 냉난방 부하를 필요로 하는 농축산물을 자동화하여 생육시키는 스마트팜에 대해서, 스마트팜에 필요한 전력 및 냉난방 부하, 그리고 수자원들을 고려하여 단위용량별로 모듈화되어 최종 필요 용량으로 구성되는 수소연료전지 시스템을 통해 수소 연료전지에서 발생하는 직류를공개특허 10-2023-0127810-3-교류로 변환하여 전력을 공급하고, 수소 연료전지에서 발생하는 섭씨 60도 이상의 온수를 스마트팜 내 냉난방기와 연결된 열교환기로 공급하는 것을 특징으로 하는 스마트팜 에너지 공급 시스템"}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 농축산물 생산을 정밀화/자동화하는 스마트팜에서 필요한 무정전 전력공급원 및 냉난방 부하에 대한 수요를 수소연료전지의 발전전력 및 부생온수를 활용하여 공급하는 수소연료전지를 이용한 스마트팜 에너지공급 시스템에 대한 내용이다."}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농축산물 생산을 정밀화/자동화하는 스마트팜에서 필요한 무정전 전력공급원 및 냉난방 부하에 대한 수요를 수소연료전지의 발전전력 및 부생온수를 활용하여 공급하는 수소연료전지를 이용한 스마트팜 에너지공급 시스템에 대한 내용이다."}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "연료전지는 수소를 연료로 공급하여 대기중의 산소와 전기화학 반응에 의해 직접 변환 발전하는 장치를 의미하 며, 온실가스 배출이 없고 전기와 열을 동시에 생산할수 있는 장점을 갖고 있다. 이때 필요한 수소 연료는 개질 기를 통해 액화천연가스(LNG)를 개질하여 사용하는 방식이 일반적인 소규모 발전용 수소연료전지에서 많이 사용 되고 있다. 스마트팜은 도시농장 등 최근 ICT 기술을 접목하여 작물이나 가축의 최적의 생육환경을 적정하게 유지함으로써 생산성을 높이는 차세대 농업방식이다. ICT 기술을 통한 각종 센서와 에너지관리 시스템은 생산물의 품질과 경 제성을 획기적으로 향상시켜서 제4차산업혁명의 실질적인 성과분야로써의 농업을 탈바꿈시키고 있다. 스마트팜 에 대한 노력은 무인 자동화, 로봇기술, 딥러닝을 이용한 인공지능 식별 기술 등으로 자동화/무인화 방향으로 진행되고 이러한 정밀농업을 뒷받침하는 에너지 공급을 포함한 각종 인프라기술들이 활발히 뒷받침되고 있다. 열교환기란 온도가 높은 물체에서 낮은 물체에 효율적으로 열을 이동시키는 장치이며, 일반적으로 액체 또는 기 체 등의 유체를 취급한다. 열교환기는 가열 및 냉각 용도로 사용된다. 온도차가 나는 유체에 대해서 섞이지 않 고, 열량만을 교환하는 방식으로 판형, 핀형, 등 다양한 형태가 있으며, 자동차의 라디에이터, 냉방기의 라디에 이터 등이 대표적인 열교환기의 예라고 할 수 있다. 흡수식 냉동기는 증발잠열과 리튬브로마이드(LiBr)과 같은 매질의 흡수성을 이용하여 물이 증발할 때 온도가 내 려가는 성질로 냉방을 하는 장치이며, 증발기와 흡수기, 응축기, 재생기로 구성된다. 흡수식 냉동기는 열원을 가지고 냉동을 할 수 있다는 특성 때문에 수소 연료전지의 발전에서 부생되는 60도 이상의 열수를 흡수식 냉동 기를 구동하는 냉방 에너지원으로 활용할 수 있는 장점을 가지고 있다."}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "수소연료전지의 보급확산에 있어서 bottleneck은 전력생산 이외에 파생되는 부생 온수의 효과적인 활용을 통한 경제성의 확보이다. 수 MW의 대규모 열병합 발전에서는 부생온수의 활용이 규모의 경제를 통해 상대적으로 용이 하지만, 소규모(100kWp 이하)에서는 수소경제 분산전원 개념에 부합하는 발전형태임에도 불구하고 부생온수를 활용할 수 있는 연계 기술 및 후방시장의 수요가 많이 부족한 상황이다. 연료전지와 연계될 수 있는 후방 수요 산업을 적극적으로 발굴하고 밸류체인을 다양화하여 연료전지의 자생력을 확보하는 기술이 시급하고 절실하게 요구되고 있다. 스마트팜의 경우, 각종 무인자동화 및 정밀농업은 전력망의 불안정한 정전 등의 사고가 발생하지 않는 독립적 으로 안정적인 전력 에너지 공급이 필요하다. 또한 스마트팜의 운영비용중 상당부분을 차지하는 에너지비용에 대해서 이를 경제적으로 처리할 수 있는 에너지 공급원이 요구되고 있다. 기존에는 각종 세제혜택을 통해 유류 나 전기의 공급을 통해 열원 에너지를 처리해왔으나, 자생적인 경쟁력을 갖추기 위해서는 경쟁력있고 친환경적 인 열원 에너지의 공급이 필요하다. 일례로 태양에너지에 의한 전력 및 열원의 공급시, 일기와 낮밤에 따른 간 헐적인 공급이 문제가 되므로, 이를 보완, 대체할 수 있는 친환경 에너지 공급원이 요구된다."}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "독립적이고 안정적인 전력 에너지 및 냉난방 부하를 필요로 하는 스마트팜에 대해서, 수소 연료전지로부터 발 생하는 직류가 인버터에 의해 교류로 변환된 전력 및 섭씨 60도 이상의 온수를 스마트팜에 연계하여 공급한다. 이때 발생하는 온수는 열교환기를 통해 난방을 위한 송풍 또는 난방수로 공급할 수 있으며, 열교환기를 통해 스 마트팜 내 냉방을 위한 흡수식 냉방기의 열원으로 공급할 수 있다. 수소 연료전지의 발생온수는 열교환기를 통 해 온도가 충분히 내려간 후, 초순수 상태로써, 특별한 필터링 없이 초순수 상태로 또는 정밀농업에 필요한 영 양분을 특정 성분비로 초순수에 용해하여, 스마트팜 내에서 농축산물 생육을 위한 배양액 내지는 수자원 공급원 으로 활용이 가능하다."}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "소규모 발전용(100kWp이하) 중저온 연료전지의 경제성 확보를 통한 분산전원으로써의 보급확산을 위해서는 현실 적으로 2가지 조건을 필요로 하는데, 연료가스(LNG)의 안정적인 공급과 열부하(냉난방) 및 전력을 동시 에 필요로 하는 후방 밸류체인의 확보이다. 이러한 관점에서 스마트팜은 단위면적당 생산량이 높고, 도시농장 등 기후나 일조량의 제약조건으로부터 벗어나서 정밀농업을 가능케하는 시스템을 구현하므로 연료가스(LNG)의 공급망을 연결할 수 있는 입지조건을 갖고 있으며, 중앙 그리드의 정전사고 등으로 인한 농산물 피해를 막고, 각종 전자장비, 로봇 등의 구동을 위한 안정적인 전원공급이 필수적이며, 막대한 열원을 소비하는 난방부하 또 는 냉방부하를 필요로 하는 경제성있는 연료전지의 후방 밸류체인으로써 매우 적합하다. 따라서 본 특허에서 해 결하고자 하는 소규모 발전용 중저온 연료전지와 연계한 스마트팜의 에너지공급을 통한 전력 및 냉방/난방 부하 대응은 상호 필요를 충족시키는 기술이라고 할 수 있다. 중저온 연료전지의 전력생산에 파생되어 발생하는 60~80℃전후의 부생 온수는 산소와 수소의 결합으로 발생하는 초순수로써 그것의 다양한 활용방안 중에서 열교 환기를 통한 난방 또는 흡수식 냉동기의 열원으로 활용함으로써, 스마트팜의 24시간 안정적인 전력공급은 물론 냉난방 부하를 처리하여 사업의 경제성을 획기적으로 향상시키는 breakthrough 기술이다."}
{"patent_id": "10-2022-0025570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시예를 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 그리고 본 발명을 설 명함에 있어서, 관련된 공지기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다 고 판단되는 경우 그 상세한 설명을 생략한다. 본 발명의 수소연료전지를 활용한 스마트팜 에너지관리시스템은 도1에서 도시한 바와 같이, 농작물 및 축산물 을 정밀농업방식으로 자동화하여 생육관리하기 위하여 독립적이고 안정적인 전력공급 및 냉난방 부하공급을 필 요로 하는 스마트팜에 대해서, 수소를 직접 또는 LNG 등으로부터 개질하여 공급받아 전기와 열을 발생시키 는 연료전지 시스템이 연계된다. 연료전지시스템으로부터 발생하는 직류를 인버터를 통해 교류로 변환하여 스마트팜에 안정적으로 공급 하고, 남는 잉여전력은 전력망(그리드)에 공급한다. 또한 연료전지로부터 부생적으로 발생하는 섭씨 60도 이상의 온수를 스마트팜과 연계하여 저온영역대는 난방열원으로 사용하기 위해서 스마트팜 연계 열 교환기로 공급한다. 스마트팜내 냉방이 필요한 경우에는 부생온수를 흡수식 냉동기의 열원으로 공급하여 냉동장치를 가동하여, 스마트팜내 냉방기를 가동할 수 있다. 열교환이 이뤄지고난 이후의 열량을 뺏았은 저온수는 저장탱크로 이동하여, 스마트팜내의 정밀농업에 필요한 수자원으로 활용가능하다. 상기 저온수는 초순수 상태로 필요한 성분의 영양분을 배합, 용해하는 주입기을 통해서 스마트팜내 배 양액이나 필요 수자원으로 활용한다. 도 2에 도시한 바와 같이, 수소연료전지은 일반적으로 도시가스관을 통해 공급되는 가압된 액화천연가스 (LNG)를 수소공급원으로 한다. 개질기를 통해 LNG는 수소로 변환(transforming)하게 되며, 공기중 산소 와 수소가 연료전지 스택의 양극(anode)과 음극(cathode)에서 촉매와 반응하여 양극에서는 물 이 발생하고, 전극을 통해서 기전력이 발생한다. 이 때 발생한 직류는 인버터로 전달되어 활용이 가능한 교 류로 변환되며, 교류로 변환된 발생전력은 전력망(grid)로 연계되어 공급되거나, 또는 물류창고내의 소 요전력으로 활용한다. 수소연료전지에서 전력과 동시에 발생하게 되는 부생온수은 PAFC(인산염 연료전지), PEFC(고분자 연료 전지)의 경우 섭씨 60도, SOFC나 MCFC의 경우는 더 높은 온도범위를 갖게 된다. 이러한 부생온수는 상당한 열에너지를 가지고 있으며 이의 활용은 수소연료전지의 경제성에 매우 결정적인 요인이 된다. 부생온수(2 8)은 배관을 통하여 열원을 필요로 하는 흡수식 냉동기로 공급된다. 도 3에서 도시한 바와 같이 흡수식 냉동기는 흡수기에서 다량의 냉매 증기를 흡수한 흡수재(LiBr) 수용액은 고온재생기로 보내져서 수소연료전지 부생온수에 의해 가열되면서, 물과 흡수재(3 8)가 다시 분리되고, 분리된 냉매와 흡수액은 저온재생기와 열교환기, 응축기 등을 거쳐 각각 증발기와 흡수기로 다시 되돌아가 계속해서 냉동 사이클을 순환하게 된다. 이때 흡수기에서의 흡수 작용은 용액과 냉매의 포화증기 압력차에 의해 이뤄지는데 평상시 이 압력차는 1mmHg 정도가 된다. 적정 한 진공도를 유지하는 것이 중요하며 진공도의 저하는 냉매의 증발온도를 높일 수 있어서 냉각 능력에 현저한 영향을 줄 수 있다. 도4에 도시한 바와 같이, 독립적이고 안정적인 전력 에너지 및 냉난방 부하를 필요로 하는 농축산물을 자동화하 여 생육시키는 스마트팜에 대해서, 스마트팜에 필요한 전력 및 냉난방 부하, 그리고 수자원들을 고려하 여 연료전지의 용량이 단위용량별로 모듈화되어 최종 필요 용량으로 여러 개의 단위용량별 모듈이 조합되어 연계되는 수소연료전지 시스템을 통해 수소 연료전지에서 발생하는 직류를 교류로 변환하여 전력을 공급하 고, 수소 연료전지에서 발생하는 섭씨 60도 이상의 온수를 스마트팜 내 냉난방기와 연결된 열교환기 로 공급할 수 있다. 이상에서 본 발명은 상기 실시예를 참고하여 설명하였지만 본 발명의 기술범위 내에서 다양한 변형실시가 가능 함은 물론이다."}
{"patent_id": "10-2022-0025570", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 스마트팜, 수소연료전지, 흡수식 냉동기 , 열교환기 , 초순수 저장탱크 , 배양액 주입/혼합기 의 구성을 나타내는 대표도이다. 도 2는 본 발명에 따른 수소연료전지의 개략적인 구성을 나타내는 개념도이다. 수소연료전지의 일반적인 작동 프로세스는 수소공급원, 개질기, 음극, 양극, 연료전지 스택, 인버터, 발생전력, 산소, 부생온수로 구성되어진다. 도3은 본 발명에 따른 흡수식 냉동장치의 구성을 나타내는 구성도이다. 흡수식 냉동장기는 수소연료전지 부 생온수, 고온재생기, 저온재생기, 응축기, 냉매, 열교환기, 증발기, 흡수기 , 흡수재 LiBr , H2O로 구성된다. 도 4는 본 발명에 따른 단위용량별로 모듈화되어 최종 필요 용량으로 조합되는 수소연료전지시스템을 나타 내는 구성도이다."}
