{"patent_id": "10-2023-0127425", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0044006", "출원번호": "10-2023-0127425", "발명의 명칭": "전자 장치 및 이의 제어 방법", "출원인": "삼성전자주식회사", "발명자": "은창기"}}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,디스플레이;적어도 하나의 인스트럭션을 저장하는 메모리; 및상기 디스플레이 및 상기 메모리와 연결되어 상기 전자 장치를 제어하기 위한 프로세서;를 포함하며,상기 프로세서는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 전자 장치에 대한 정보에 기초하여 상기 전자 장치에 대응되는 복수의 UI 컴포넌트를 식별하고,상기 식별된 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시하도록 상기 디스플레이를 제어하며,상기 복수의 UI 컴포넌트는 복수의 유형의 UI 컴포넌트를 포함하고,상기 복수의 유형 중 제1 유형의 UI 컴포넌트들은 겹쳐져 쌓여진 형태로 표시되는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 유형의 UI 컴포넌트는,상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 수신된 알림 메시지를 포함하는 UI 컴포넌트인전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 제1 유형의 UI 컴포넌트의 개수가 임계값 이하인 경우, 상기 제1 유형의 UI 컴포넌트들이 펼쳐진 형태로표시하고, 상기 제1 유형의 UI 컴포넌트의 개수가 상기 임계값을 초과하는 경우, 상기 제1 유형의 UI 컴포넌트를 겹쳐져 쌓여진 형태로 표시하도록 상기 디스플레이를 제어하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,상기 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 경우, 상기 겹쳐져 쌓여진 형태로 표시된 제1유형의 UI 컴포넌트들이 표시되는 영역 중 제1 영역 상에 상기 겹쳐져 쌓여진 제1 유형의 컴포넌트들의 개수에대한 정보를 나타내는 인디케이터를 표시하도록 상기 디스플레이를 제어하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,상기 복수의 유형의 UI 컴포넌트를 상기 복수의 유형 각각에 대응되는 우선 순위에 따라 배열하여 표시하도록상기 디스플레이를 제어하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2025-0044006-3-제5항에 있어서,상기 복수의 유형은,상기 전자 장치의 현재 상태에 대한 정보 및 상기 전자 장치의 제어와 관련된 정보를 포함하는 제2 유형, 상기전자 장치와 관련된 컨텐츠를 제공하기 위한 서비스에 대한 정보를 포함하는 제3 유형, 상기 전자 장치를 관리하는 서비스에 대한 정보를 포함하는 제4 유형 및 상기 전자 장치의 에너지에 대한 정보를 포함하는 제5 유형을포함하며,상기 제2 유형은 제1 우선 순위이며, 상기 제3 유형은 제2 우선 순위이며, 상기 제4 유형은 제3 우선 순위이며,상기 제5 유형은 제4 우선 순위인 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 제1 우선 순위의 상기 제2 유형의 UI 컴포넌트는 고정된 위치에서 가장 먼저 표시되며,상기 프로세서는,상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 알림 메시지가 수신되면, 상기 알림 메시지에대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성하며,상기 생성된 제1 유형의 UI 컴포넌트를 상기 제2 유형의 UI 컴포넌트 다음에 표시하도록 상기 디스플레이를 제어하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 제1 유형의 UI 컴포넌트가 표시된 후 상기 제1 유형의 UI 컴포넌트에 포함된 기설정된 버튼이 선택되면,상기 제1 유형의 UI 컴포넌트를 상기 홈 화면 UI에서 제거하도록 상기 디스플레이를 제어하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 메모리는, 상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 저장하며,상기 프로세서는,상기 전자 장치와 연결된 제1 외부 장치로부터 알림 메시지가 수신되면, 상기 맵에 기초하여 상기 제1 외부 장치가 상기 전자 장치와 동일한 공간에 위치하는지 여부를 식별하며,상기 제1 외부 장치가 상기 전자 장치와 동일한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림메시지를 무시하고, 상기 제1 외부 장치가 상기 전자 장치와 상이한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림 메시지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 복수의 UI 컴포넌트는,상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 표시하는 UI 컴포넌트를 포함하며,상기 맵을 표시하는 UI 컴포넌트는,상기 맵 중 상기 전자 장치와 연결된 외부 장치가 배치된 위치에 상기 외부 장치에 대응되는 인디케이터를 포함하며,상기 프로세서는,공개특허 10-2025-0044006-4-상기 인디케이터가 선택되면, 상기 외부 장치를 제어하기 위한 제어화면을 표시하도록 상기 디스플레이를 제어하는 전자 장치."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 제어 방법에 있어서,상기 전자 장치에 대한 정보에 기초하여 상기 전자 장치에 대응되는 복수의 UI 컴포넌트를 식별하는 단계; 및상기 식별된 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시하는 단계;를 포함하며,상기 복수의 UI 컴포넌트는 복수의 유형의 UI 컴포넌트를 포함하고,상기 복수의 유형 중 제1 유형의 UI 컴포넌트들은 겹쳐져 쌓여진 형태로 표시되는 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제1 유형의 UI 컴포넌트는,상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 수신된 알림 메시지를 포함하는 UI 컴포넌트인제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 표시하는 단계는,상기 제1 유형의 UI 컴포넌트의 개수가 임계값 이하인 경우, 상기 제1 유형의 UI 컴포넌트들이 펼쳐진 형태로표시하고, 상기 제1 유형의 UI 컴포넌트의 개수가 상기 임계값을 초과하는 경우, 상기 제1 유형의 UI 컴포넌트를 겹쳐져 쌓여진 형태로 표시하는 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 표시하는 단계는,상기 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 경우, 상기 겹쳐져 쌓여진 형태로 표시된 제1유형의 UI 컴포넌트들이 표시되는 영역 중 제1 영역 상에 상기 겹쳐져 쌓여진 제1 유형의 컴포넌트들의 개수에대한 정보를 나타내는 인디케이터를 표시하는 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 표시하는 단계는,상기 복수의 유형의 UI 컴포넌트를 상기 복수의 유형 각각에 대응되는 우선 순위에 따라 배열하여 표시하는 제어 방법,"}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 복수의 유형은,상기 전자 장치의 현재 상태에 대한 정보 및 상기 전자 장치의 제어와 관련된 정보를 포함하는 제2 유형, 상기전자 장치와 관련된 컨텐츠를 제공하기 위한 서비스에 대한 정보를 포함하는 제3 유형, 상기 전자 장치를 관리하는 서비스에 대한 정보를 포함하는 제4 유형 및 상기 전자 장치의 에너지에 대한 정보를 포함하는 제5 유형을포함하며,상기 제2 유형은 제1 우선 순위이며, 상기 제3 유형은 제2 우선 순위이며, 상기 제4 유형은 제3 우선 순위이며,공개특허 10-2025-0044006-5-상기 제5 유형은 제4 우선 순위인 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 제1 우선 순위의 상기 제2 유형의 UI 컴포넌트는 고정된 위치에서 가장 먼저 표시되며,상기 제어 방법은,상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 알림 메시지가 수신되면, 상기 알림 메시지에대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성하는 단계;상기 생성된 제1 유형의 UI 컴포넌트를 상기 제2 유형의 UI 컴포넌트 다음에 표시하는 단계;를 포함하는 제어방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제어 방법은,상기 제1 유형의 UI 컴포넌트가 표시된 후 상기 제1 유형의 UI 컴포넌트에 포함된 기설정된 버튼이 선택되면,상기 제1 유형의 UI 컴포넌트를 상기 홈 화면 UI에서 제거하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12항에 있어서,상기 전자 장치는, 상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 저장하며,상기 제어 방법은,상기 전자 장치와 연결된 제1 외부 장치로부터 알림 메시지가 수신되면, 상기 맵에 기초하여 상기 제1 외부 장치가 상기 전자 장치와 동일한 공간에 위치하는지 여부를 식별하는 단계; 및상기 제1 외부 장치가 상기 전자 장치와 동일한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림메시지를 무시하고, 상기 제1 외부 장치가 상기 전자 장치와 상이한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림 메시지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 복수의 UI 컴포넌트는,상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 표시하는 UI 컴포넌트를 포함하며,상기 맵을 표시하는 UI 컴포넌트는,상기 맵 중 상기 전자 장치와 연결된 외부 장치가 배치된 위치에 상기 외부 장치에 대응되는 인디케이터를 포함하며,상기 제어 방법은,상기 인디케이터가 선택되면, 상기 외부 장치를 제어하기 위한 제어화면을 표시하는 단계;를 포함하는 제어 방법."}
{"patent_id": "10-2023-0127425", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치 및 이의 제어 방법이 제공된다. 본 전자 장치는, 디스플레이, 적어도 하나의 인스트럭션을 저장하는 메모리 및, 디스플레이 및 메모리와 연결되어 전자 장치를 제어하기 위한 프로세서를 포함한다. 프로세서는, 적 어도 하나의 인스트럭션을 실행함으로써, 전자 장치에 대한 정보에 기초하여 전자 장치에 대응되는 복수의 UI 컴 포넌트를 식별하고, 식별된 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시하도록 디스플레이를 제어한다. 이 때, 복수의 UI 컴포넌트는 복수의 유형의 UI 컴포넌트를 포함하고, 복수의 유형 중 제1 유형의 UI 컴포넌트들은 겹쳐져 쌓여진 형태로 표시된다."}
{"patent_id": "10-2023-0127425", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 이의 제어 방법에 관한 것으로, 더욱 상세하게는 전자 장치에 대응되는 복수의 UI 컴포 넌트를 포함하는 홈 화면 UI를 제공하기 위한 전자 장치 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0127425", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래의 전자 장치(예로, 냉장고, 세탁기, 오븐과 같은 가전제품 등)는 디스플레이를 구비하고 있으며, 디스플레 이를 통해 다양한 UI를 제공하고 있다. 그러나, 기존에는 전자 장치마다 UI를 구성하는 모든 UI 컴포넌트를 별 도로 개발하여 개발 용이성이 떨어지는 문제점이 존재하였다. 뿐만 아니라, 기존의 전자 장치는 UI 컴포넌트의 유형에 상관없이 동일한 방식으로 UI 컴포넌트들을 제공함으로 써, UI 컴포넌트의 특성을 반영하지 못한 한계가 존재하였다."}
{"patent_id": "10-2023-0127425", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른, 전자 장치는, 디스플레이; 적어도 하나의 인스트럭션을 저장하는 메모리; 및 상기 디스플레이 및 상기 메모리와 연결되어 상기 전자 장치를 제어하기 위한 프로세서;를 포함하며, 상기 프로세서 는, 상기 적어도 하나의 인스트럭션을 실행함으로써, 상기 전자 장치에 대한 정보에 기초하여 상기 전자 장치에 대응되는 복수의 UI 컴포넌트를 식별하고, 상기 식별된 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시하도 록 상기 디스플레이를 제어하며, 상기 복수의 UI 컴포넌트는 복수의 유형의 UI 컴포넌트를 포함하고, 상기 복수 의 유형 중 제1 유형의 UI 컴포넌트들은 겹쳐져 쌓여진 형태로 표시된다. 상기 제1 유형의 UI 컴포넌트는, 상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 수신된 알림 메시지를 포함하는 UI 컴포넌트일 수 있다. 상기 프로세서는, 상기 제1 유형의 UI 컴포넌트의 개수가 임계값 이하인 경우, 상기 제1 유형의 UI 컴포넌트들 이 펼쳐진 형태로 표시하고, 상기 제1 유형의 UI 컴포넌트의 개수가 상기 임계값을 초과하는 경우, 상기 제1 유 형의 UI 컴포넌트를 겹쳐져 쌓여진 형태로 표시하도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 경우, 상기 겹쳐져 쌓여진 형태로 표시된 제1 유형의 UI 컴포넌트들이 표시되는 영역 중 제1 영역 상에 상기 겹쳐져 쌓여진 제1 유형의 컴 포넌트들의 개수에 대한 정보를 나타내는 인디케이터를 표시하도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 복수의 유형의 UI 컴포넌트를 상기 복수의 유형 각각에 대응되는 우선 순위에 따라 배열 하여 표시하도록 상기 디스플레이를 제어할 수 있다. 상기 복수의 유형은, 상기 전자 장치의 현재 상태에 대한 정보 및 상기 전자 장치의 제어와 관련된 정보를 포함 하는 제2 유형, 상기 전자 장치와 관련된 컨텐츠를 제공하기 위한 서비스에 대한 정보를 포함하는 제3 유형, 상 기 전자 장치를 관리하는 서비스에 대한 정보를 포함하는 제4 유형 및 상기 전자 장치의 에너지에 대한 정보를 포함하는 제5 유형을 포함하며, 상기 제2 유형은 제1 우선 순위이며, 상기 제3 유형은 제2 우선 순위이며, 상기 제4 유형은 제3 우선 순위이며, 상기 제5 유형은 제4 우선 순위일 수 있다. 상기 제1 우선 순위의 상기 제2 유형의 UI 컴포넌트는 고정된 위치에서 가장 먼저 표시되며, 상기 프로세서는, 상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 알림 메시지가 수신되면, 상기 알림 메시지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성하며, 상기 생성된 제1 유형의 UI 컴포넌트를 상기 제2 유 형의 UI 컴포넌트 다음에 표시하도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 제1 유형의 UI 컴포넌트가 표시된 후 상기 제1 유형의 UI 컴포넌트에 포함된 기설정된 버튼이 선택되면, 상기 제1 유형의 UI 컴포넌트를 상기 홈 화면 UI에서 제거하도록 상기 디스플레이를 제어할 수 있다. 상기 메모리는, 상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 저장하며, 상기 프로세서는, 상기 전자 장치와 연결된 제1 외부 장치로부터 알림 메시지가 수신되면, 상기 맵에 기초하여 상기 제1 외부 장치가 상기 전자 장치와 동일한 공간에 위치하는지 여부를 식별하며, 상기 제1 외부 장치가 상기 전자 장치와 동일한 공간 에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림 메시지를 무시하고, 상기 제1 외부 장치가 상기 전자 장치와 상이한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림 메시지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성할 수 있다.상기 복수의 UI 컴포넌트는, 상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 표시하는 UI 컴포넌트를 포 함하며, 상기 맵을 표시하는 UI 컴포넌트는, 상기 맵 중 상기 전자 장치와 연결된 외부 장치가 배치된 위치에 상기 외부 장치에 대응되는 인디케이터를 포함하며, 상기 프로세서는, 상기 인디케이터가 선택되면, 상기 외부 장치를 제어하기 위한 제어화면을 표시하도록 상기 디스플레이를 제어할 수 있다. 한편, 본 개시의 일 실시예에 따른, 전자 장치의 제어 방법은, 상기 전자 장치에 대한 정보에 기초하여 상기 전 자 장치에 대응되는 복수의 UI 컴포넌트를 식별하는 단계; 및 상기 식별된 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시하는 단계;를 포함하며, 상기 복수의 UI 컴포넌트는 복수의 유형의 UI 컴포넌트를 포함하고, 상 기 복수의 유형 중 제1 유형의 UI 컴포넌트들은 겹쳐져 쌓여진 형태로 표시된다. 상기 제1 유형의 UI 컴포넌트는, 상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 수신된 알림 메시지를 포함하는 UI 컴포넌트일 수 있다. 상기 표시하는 단계는, 상기 제1 유형의 UI 컴포넌트의 개수가 임계값 이하인 경우, 상기 제1 유형의 UI 컴포넌 트들이 펼쳐진 형태로 표시하고, 상기 제1 유형의 UI 컴포넌트의 개수가 상기 임계값을 초과하는 경우, 상기 제 1 유형의 UI 컴포넌트를 겹쳐져 쌓여진 형태로 표시할 수 있다. 상기 표시하는 단계는, 상기 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 경우, 상기 겹쳐져 쌓 여진 형태로 표시된 제1 유형의 UI 컴포넌트들이 표시되는 영역 중 제1 영역 상에 상기 겹쳐져 쌓여진 제1 유형 의 컴포넌트들의 개수에 대한 정보를 나타내는 인디케이터를 표시할 수 있다. 상기 표시하는 단계는, 상기 복수의 유형의 UI 컴포넌트를 상기 복수의 유형 각각에 대응되는 우선 순위에 따라 배열하여 표시할 수 있다. 상기 복수의 유형은, 상기 전자 장치의 현재 상태에 대한 정보 및 상기 전자 장치의 제어와 관련된 정보를 포함 하는 제2 유형, 상기 전자 장치와 관련된 컨텐츠를 제공하기 위한 서비스에 대한 정보를 포함하는 제3 유형, 상 기 전자 장치를 관리하는 서비스에 대한 정보를 포함하는 제4 유형 및 상기 전자 장치의 에너지에 대한 정보를 포함하는 제5 유형을 포함하며, 상기 제2 유형은 제1 우선 순위이며, 상기 제3 유형은 제2 우선 순위이며, 상기 제4 유형은 제3 우선 순위이며, 상기 제5 유형은 제4 우선 순위일 수 있다. 상기 제1 우선 순위의 상기 제2 유형의 UI 컴포넌트는 고정된 위치에서 가장 먼저 표시되며, 상기 제어 방법은, 상기 전자 장치 또는 상기 전자 장치와 연결된 외부 장치로부터 알림 메시지가 수신되면, 상기 알림 메시지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성하는 단계; 상기 생성된 제1 유형의 UI 컴포넌트를 상기 제2 유형의 UI 컴포넌트 다음에 표시하는 단계;를 포함할 수 있다. 상기 제어 방법은, 상기 제1 유형의 UI 컴포넌트가 표시된 후 상기 제1 유형의 UI 컴포넌트에 포함된 기설정된 버튼이 선택되면, 상기 제1 유형의 UI 컴포넌트를 상기 홈 화면 UI에서 제거하는 단계;를 포함할 수 있다. 상기 전자 장치는, 상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 저장하며, 상기 제어 방법은, 상기 전 자 장치와 연결된 제1 외부 장치로부터 알림 메시지가 수신되면, 상기 맵에 기초하여 상기 제1 외부 장치가 상 기 전자 장치와 동일한 공간에 위치하는지 여부를 식별하는 단계; 및 상기 제1 외부 장치가 상기 전자 장치와 동일한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림 메시지를 무시하고, 상기 제1 외부 장치 가 상기 전자 장치와 상이한 공간에 위치하면, 상기 제1 외부 장치로부터 수신된 상기 알림 메시지에 대한 정보 를 포함하는 제1 유형의 UI 컴포넌트를 생성하는 단계;를 포함할 수 있다. 상기 복수의 UI 컴포넌트는, 상기 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 표시하는 UI 컴포넌트를 포 함하며, 상기 맵을 표시하는 UI 컴포넌트는, 상기 맵 중 상기 전자 장치와 연결된 외부 장치가 배치된 위치에 상기 외부 장치에 대응되는 인디케이터를 포함하며, 상기 제어 방법은, 상기 인디케이터가 선택되면, 상기 외부 장치를 제어하기 위한 제어화면을 표시하는 단계;를 포함할 수 있다."}
{"patent_id": "10-2023-0127425", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 아이템 한 개 또는 복 수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 어떤 구성요소가 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. “포함하다” 또는 \"가지다\"등의 용어는 본 문서에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는다. 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\", \"지지\" 또는 \"접촉\"되어 있다고 할 때, 이는 구성요소들이 직접적으로 연결, 결합, 지지 또는 접촉되는 경우뿐 아니라, 제3 구성요소를 통하여 간접적으로 연결, 결합, 지 지 또는 접촉되는 경우를 포함한다. 어떤 구성요소가 다른 구성요소 \"상에\" 위치하고 있다고 할 때, 이는 어떤 구성요소가 다른 구성요소에 접해 있 는 경우뿐 아니라 두 구성요소 사이에 또 다른 구성요소가 존재하는 경우도 포함한다.“및/또는\"이라는 용어는 복수의 관련된 기재된 구성요소들의 조합 또는 복수의 관련된 기재된 구성요소들 중의 어느 구성요소를 포함한다. 이하 첨부된 도면들을 참고하여 본 발명의 작용 원리 및 실시예에 대해 설명한다. 도 1은 본 개시의 일 실시예에 따른, 댁 내의 전자 장치를 제어하기 위한 시스템을 도시한 도면이다. 도 1에 도 시된 바와 같이, 시스템은 복수의 전자 장치, 사용자 기기 및 서버를 포함할 수 있다. 이때, 복수의 전자 장치, 사용자 기기 및 서버는 인터넷을 통해 연결될 수 있다. 전자 장치는 다른 전자 장치, 사용자 기기 또는 서버와 통신할 수 있는 통신 모듈, 사용자 입력을 수신하거나 사용자에게 정보를 출력하는 사용자 인터페이스, 전자 장치의 동작을 제어하는 적어도 하나의 프로세서 및 전자 장치의 동작을 제어하기 위한 프로그램이 저장된 적어도 하나의 메모리를 포함할 수 있 다. 전자 장치는 다양한 종류의 가전 기기들 중 적어도 하나일 수 있다. 예를 들어, 전자 장치는 도시된 바와 같이 냉장고, 식기세척기, 전기레인지, 전기오븐, 공기조화기, 의류 관리기, 세 탁기, 건조기, 마이크로파 오븐 중 적어도 하나를 포함할 수 있으나 이에 한정되는 것은 아니며, 예를 들어, 도면에 도시되지 않은 청소 로봇, 진공 청소기, 텔레비전 등의 다양한 타입의 가전제품을 포함할 수 있다. 또한, 앞서 언급된 가전제품들은 예시에 불과하며, 앞서 언급된 가전제품들 외에도, 다른 전자 장치, 사 용자 기기 또는 서버와 연결되어 후술하는 동작을 수행할 수 있는 기기는 일 실시예에 따른 전자 장치 에 포함될 수 있다. 특히, 본 개시의 일 실시예에 따른, 전자 장치는 디스플레이를 구비할 수 있으며, UI 컴포넌트를 포함하는 홈 화면 UI를 디스플레이를 통해 표시할 수 있다. 이때, UI 컴포넌트는 통합 개발된 UI 컴포넌트로서, 기기별로 유사한 디자인으로 구성될 수 있으나, 전자 장치의 제품 정보에 따라 상이하게 구성될 수 있다. 이에 대해서는 추후 도면을 참조하여 상세히 설명하기로 한다. 서버는 다른 서버, 전자 장치 또는 사용자 기기와 통신할 수 있는 통신 모듈, 다른 서버, 전자 장치 또는 사용자 기기로부터 수신된 데이터를 처리할 수 있는 적어도 하나의 프로세서 및 데이터를 처리하 기 위한 프로그램 또는 처리된 데이터를 저장할 수 있는 적어도 하나의 메모리를 포함할 수 있다. 이러한 서버 는 워크스테이션(workstation), 클라우드(cloud), 데이터 드라이브(data drive), 데이터 스테이션(data station) 등 다양한 컴퓨팅 디바이스로 구현될 수 있다. 서버는 기능, 기능의 세부 구성 또는 데이터 등을 기준으로 물리적 또는 논리적으로 구분된 하나 이상의 서버로 구현될 수 있으며, 각 서버 간의 통신을 통해 데 이터를 송수신하고 송수신된 데이터를 처리할 수 있다. 서버는 사용자 계정을 관리하고, 사용자 계정에 결부시켜 전자 장치를 등록하고, 등록된 전자 장치 를 관리하거나 제어하는 등의 기능을 수행할 수 있다. 예를 들어, 사용자는 사용자 기기를 통해 서버 에 접속하여, 사용자 계정을 생성할 수 있다. 사용자 계정은 사용자에 의해 설정된 아이디와 비밀번호에 의 해 식별될 수 있다. 서버는 정해진 절차에 따라 전자 장치를 사용자 계정에 등록할 수 있다. 예를 들어, 서버는 전자 장치의 식별 정보(예: 시리얼 넘버 또는 맥 주소(MAC address) 등)를 사용자 계정에 연결하여, 전자 장치를 등록, 관리, 제어할 수 있다. 사용자 기기는 전자 장치 또는 서버와 통 신할 수 있는 통신 모듈, 사용자 입력을 수신하거나 사용자에게 정보를 출력하는 사용자 인터페이스, 사용자 기 기의 동작을 제어하는 적어도 하나의 프로세서 및 사용자 기기의 동작을 제어하기 위한 프로그램이 저장 된 적어도 하나의 메모리를 포함할 수 있다. 사용자 기기는 사용자가 휴대하거나, 사용자의 가정 또는 사무실 등에 배치될 수 있다. 사용자 기기는 퍼 스널 컴퓨터(personal computer), 단말기(terminal), 휴대폰(portable telephone), 스마트 폰(smart phone), 휴대 장치(handheld device), 착용 장치(wearable device) 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 사용자 기기의 메모리에는 전자 장치를 제어하기 위한 프로그램, 즉 어플리케이션이 저장될 수 있다. 어플리케이션은 사용자 기기에 설치된 상태로 판매되거나, 외부 서버로부터 다운로드 받아 설치될 수 있다. 사용자가 사용자 기기에 설치된 어플리케이션을 실행함으로써 서버에 접속하여 사용자 계정을 생성하고, 로그인된 사용자 계정을 기반으로 서버와 통신을 수행하여 전자 장치를 등록할 수 있다. 예를 들어, 사용자 기기에 설치된 어플리케이션에서 안내하는 절차에 따라 전자 장치가 서버에 접속 될 수 있도록 전자 장치를 조작하면, 서버에서 해당 사용자 계정에 전자 장치의 식별 정보(예: 시 리얼 넘버 또는 맥 주소(MAC address) 등)를 등재함으로써, 사용자 계정에 전자 장치를 등록할 수 있다. 사용자는 사용자 기기에 설치된 어플리케이션을 이용하여 전자 장치를 제어할 수 있다. 예를 들어, 사 용자가 사용자 기기에 설치된 어플리케이션으로 사용자 계정에 로그인하면, 사용자 계정에 등록된 전자 장치 가 나타나고, 전자 장치에 대한 제어 명령을 입력하면 서버를 통해 전자 장치에 제어 명령을 전달할 수 있다. 네트워크는 유선 네트워크와 무선 네트워크를 모두 포함할 수 있다. 유선 네트워크는 케이블 네트워크 또는 전 화 네트워크 등을 포함하며, 무선 네트워크는 전파를 통하여 신호를 송수신하는 모든 네트워크를 포함할 수 있 다. 유선 네트워크와 무선 네트워크는 서로 연결될 수 있다. 네트워크는 인터넷 등의 광역 네트워크(wide area network, WAN)와 접속 중계기(Access Point, AP)를 중심으로 형성된 지역 네트워크(local area network, LAN), 접속 중계기(AP)를 통하지 않는 근거리 무선 네트워크를 포함 할 수 있다. 근거리 무선 네트워크는 블루투스(Bluetooth, IEEE 802.15.1), 지그비(Zigbee, IEEE 802.15.4), 와이파이 다이렉트(Wi-Fi Direct), NFC(Near Field Communication), 지-웨이브(Z-Wave) 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 접속 중계기(AP)는 전자 장치 또는 사용자 기기를 서버가 연결된 광역 네트워크(WAN)에 연결시킬 수 있다. 전자 장치 또는 사용자 기기는 광역 네트워크(WAN)를 통해 서버에 연결될 수 있다. 접속 중계기(AP)는 와이파이(Wi-Fi, IEEE 802.11), 블루투스(Bluetooth, IEEE 802.15.1), 지그비(Zigbee, IEEE 802.15.4) 등의 무선 통신을 이용하여 전자 장치 또는 사용자 기기와 통신하고 유선 통신을 이용하여 광역 네트워크(WAN)에 접속할 수 있으나, 이에 한정되는 것은 아니다. 다양한 실시예에 따라, 전자 장치는 접속 중계기(AP)를 통하지 않고 사용자 기기 또는 서버와 직접 연결될 수도 있다. 전자 장치는 원거리 무선 네트워크 또는 근거리 무선 네트워크를 통해 사용자 기기 또는 서버와 연 결될 수 있다. 예를 들어, 전자 장치는 근거리 무선 네트워크(예: 와이파이 다이렉트)를 통해 사용자 기기와 연결될 수 있다. 또 다른 예로, 전자 장치는 원거리 무선 네트워크(예: 셀룰러 통신 모듈)를 이용하여 광역 네트워크(WAN) 를 통해 사용자 기기 또는 서버와 연결될 수 있다. 또 다른 예로, 전자 장치는 유선 통신을 이용하여 광역 네트워크(WAN)에 접속하고, 광역 네트워크(WAN)를 통해 사용자 기기 또는 서버와 연결될 수 있다. 전자 장치가 유선 통신을 이용하여 광역 네트워크(WAN)에 접속할 수 있는 경우, 접속 중계기로서 동작할 수도 있다. 이에 따라, 전자 장치는 다른 전자 장치를 서버가 연결된 광역 네트워크(WAN)에 연결시킬 수 있다. 또한, 다른 전자 장치는 전자 장치를 서버가 연결된 광역 네트워크(WAN)에 연결시킬 수 있다. 전자 장치는 네트워크를 통하여 동작 또는 상태에 관한 정보를 다른 전자 장치, 사용자 기기 또는 서버 에 전송할 수 있다. 예를 들어, 전자 장치는 서버로부터 요청이 수신되는 경우, 전자 장치에서 특정 이벤트가 발생한 경우, 또는 주기적으로 또는 실시간으로 동작 또는 상태에 관한 정보를 다른 전자 장치, 사용자 기기 또는 서버로 전송할 수 있다. 서버는 전자 장치로부터 동작 또는 상태에 관한 정보 가 수신되면 저장되어 있던 전자 장치의 동작 또는 상태에 관한 정보를 업데이트하고, 네트워크를 통하여 사용자 기기에 전자 장치의 동작 및 상태에 관한 업데이트된 정보(예로, 알림 메시지 등)를 전송할 수 있다. 여기서, 정보의 업데이트란 기존 정보에 새로운 정보를 추가하는 동작, 기존 정보를 새로운 정보로 대체 하는 동작 등 기존 정보가 변경되는 다양한 동작을 포함할 수 있다. 전자 장치는 다른 전자 장치, 사용자 기기 또는 서버로부터 다양한 정보를 획득하고, 획득된 정보를 사용자에게 제공할 수 있다. 예를 들어, 전자 장치는 서버로부터 전자 장치의 기능과 관련된 정보 (예를 들어, 조리법, 세탁법 등), 다양한 환경 정보(예를 들어, 날씨, 온도, 습도 등)의 정보를 획득하고, 사용 자 인터페이스를 통해 획득된 정보를 출력할 수 있다.전자 장치는 다른 전자 장치, 사용자 기기 또는 서버로부터 수신되는 제어 명령에 따라 동작할 수 있다. 예를 들어, 전자 장치는 사용자 입력이 없더라도 서버의 제어 명령에 따라 동작할 수 있도록 사 용자의 사전 승인을 획득한 경우, 전자 장치는 서버로부터 수신되는 제어 명령에 따라 동작할 수 있다. 여기서, 서버로부터 수신되는 제어 명령은 사용자가 사용자 기기를 통해 입력한 제어 명령 또는 기 설정 된 조건에 기초한 제어 명령 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 사용자 기기는 통신 모듈을 통해 사용자에 관한 정보를 전자 장치 또는 서버에 전송할 수 있다. 예 를 들어, 사용자 기기는 사용자의 위치, 사용자의 건강 상태, 사용자의 취향, 사용자의 일정 등에 관한 정보 를 서버에 전송할 수 있다. 사용자 기기는 사용자의 사전 승인에 따라 사용자에 관한 정보를 서버에 전송할 수 있다. 전자 장치, 사용자 기기 또는 서버는 인공 지능 등의 기술을 이용하여 제어 명령을 결정할 수 있다. 예를 들어, 서버는 전자 장치의 동작 또는 상태에 관한 정보를 수신하거나 사용자 기기의 사용자에 관한 정보를 수신하여 인공 지능 등의 기술을 이용하여 처리하고, 처리 결과에 기초하여 전자 장치 또는 사용자 기기에 처리 결과 또는 제어 명령을 전송할 수 있다. 도 2는 본 개시의 일 실시예에 따른, 전자 장치의 구성을 나타내는 블록도이다. 도 2에 도시된 바와 같이, 전자 장치는 통신 인터페이스, 디스플레이, 메모리, 사용자 입력부 및 프로세서를 포 함할 수 있다. 그러나, 이는 일 실시예에 불과할 뿐, 전자 장치의 유형에 따라, 일부 구성이 제거되거나 추가될 수 있음은 물론이다. 통신 인터페이스는 적어도 하나의 회로를 포함하며 다양한 유형의 외부 기기나 서버와 통신을 수행할 수 있다. 통신 인터페이스는 BLE(Bluetooth Low Energy) 모듈, 와이파이 통신 모듈, 셀룰러 통신모듈, 3G(3 세대) 이동통신 모듈, 4G(4세대) 이동통신 모듈, 4세대 LTE(Long Term Evolution) 통신 모듈, 5G(5세대) 이동 통신 모듈 중 적어도 하나를 포함할 수 있다. 특히, 통신 인터페이스는 외부 장치, 사용자 기기 또는 서버로부터 알림 메시지를 획득할 수 있다. 이때, 알림(notification) 메시지라 함은, 외부 장치 혹은 사용자 기기에서 이벤트가 발생한 경우, 이벤트에 대한 정보를 사용자에게 알려주기 위한 메시지일 수 있다. 이때, 알림 메시지는 알람(Alarm) 메시지라고 할 수 있다. 또한, 통신 인터페이스는 외부 장치로 제어 명령을 전송할 수 있다. 하나 이상의 실시예에서, 통신 인터페이스는 외부 장치와 통신하기 위한 모듈과 서버와 통신하기 위한 모듈이 서로 상이할 수 있다. 예를 들어, 전자 장치는 외부 장치와 근거리 무선 통신 인터페이스(예로, BLE 모듈, 와이파이 다이렉트 통신 모듈 등)을 통해 통신을 수행할 수 있으며, 서버와 원거리 무선 통신 인 터페이스(예로, 와이파이 통신 모듈, LTE 통신 모듈, 5G 통신 모듈 등)을 통해 통신을 수행할 수 있다. 디스플레이는 LCD(Liquid Crystal Display) 패널, OLED(Organic Light Emitting Diodes) 패널, AM- OLED(Active-Matrix Organic Light-Emitting Diode), LcoS(Liquid Crystal on Silicon), QLED(Quantum dot Light-Emitting Diode) 및 DLP(Digital Light Processing), PDP(Plasma Display Panel) 패널, 무기 LED 패널, 마이크로 LED 패널 등 다양한 종류의 디스플레이 패널을 포함할 수 있으나, 이에 한정되는 것은 아니다. 한편, 디스플레이는 터치 패널과 함께 터치스크린을 구성할 수도 있으며, 플렉서블(flexible) 패널로 이루어질 수도 있다. 특히, 디스플레이는 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시할 수 있다. 이때, 홈 화면 UI는 전 자 장치가 온된 경우, 디스플레이 상에 표시되는 화면으로서, 전자 장치는 제어하거나 전자 장 치와 관련된 정보를 제공하기 위한 UI 컴포넌트를 포함할 수 있다. 또한, 홈 화면 UI는 전자 장치에 대한 정보를 제공하기 위한 UI 컴포넌트 뿐만 아니라 외부 장치와 관련된 정보를 제공하기 위한 UI 컴포넌트를 포함할 수 있다. 한편, 홈 화면 UI는 UI, 기본 UI 등과 같은 다양한 용어로 불릴 수 있다. 메모리는 전자 장치의 구성요소들의 전반적인 동작을 제어하기 위한 운영체제(OS: Operating System) 및 전자 장치의 구성요소와 관련된 인스트럭션 또는 데이터를 저장할 수 있다. 특히, 메모리는 복수 의 UI 컴포넌트를 포함하는 홈 화면 UI를 제공하기 위한 복수의 모듈을 포함할 수 있다. 특히, 복수의 UI 컴포 넌트를 포함하는 홈 화면 UI를 제공하기 위한 기능이 실행되면, 전자 장치는 비휘발성 메모리에 저장되어 있는 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 제공하기 위한 다양한 모듈이 각종 동작을 수행하기 위한 데이터를 휘발성 메모리로 로딩(loading)할 수 있다. 여기서, 로딩이란 프로세서가 액세스할 수 있도록 비휘 발성 메모리에 저장된 데이터를 휘발성 메모리에 불러들여 저장하는 동작을 의미한다. 또한, 메모리는 전자 장치가 위치하는 댁 내에 정보를 포함하는 맵을 저장할 수 있다. 이때, 맵에는 댁 내의 공간에 대한 정보 뿐만 아니라 댁 내에 위치하는 복수의 전자 장치에 대한 정보를 저장할 수 있다. 또한, 메모리는 공통 어플리케이션에 포함된 복수의 UI 컴포넌트를 저장할 수 있다. 공통 어플리케이션에 포함된 복수의 UI 컴포넌트는 제품 출하시에 메모리에 저장될 수 있으나, 이는 일 실시예에 불과할 뿐, 추 후 외부 서버를 통해 다운로드되어 메모리에 저장될 수 있다. 한편, 메모리는 비휘발성 메모리(ex: 하드 디스크, SSD(Solid state drive), 플래시 메모리), 휘발성 메 모리(프로세서) 내의 메모리도 포함할 수 있음.) 등으로 구현될 수 있다. 사용자 입력부는 버튼(button), 레버(lever), 스위치(switch), 터치(Touch)형 인터페이스 등을 포함할 수 있다. 이때, 터치형 인터페이스는 전자 장치의 디스플레이 화면 상에서 사용자의 터치로 입력을 받는 방식으로 구현될 수 있다. 특히, 사용자 입력부는 홈 화면 UI를 제어하기 위한 다양한 사용자 입력을 수신할 수 있다. 또한, 사용자 입력부는 홈 화면 UI에 포함된 맵을 표시하는 UI 컴포넌트를 통해 외부 장치를 제어하기 위한 사용자 입력 을 수신할 수 있다. 프로세서는 메모리에 저장된 적어도 하나의 인스트럭션에 따라 전자 장치를 제어할 수 있다. 특히, 프로세서는 하나 이상의 프로세서를 포함할 수 있다. 구체적으로, 하나 이상의 프로세서는 CPU (Central Processing Unit), GPU (Graphics Processing Unit), APU (Accelerated Processing Unit), MIC (Many Integrated Core), DSP (Digital Signal Processor), NPU (Neural Processing Unit), 하드웨어 가속기 또는 머신 러닝 가속기 중 하나 이상을 포함할 수 있다. 하나 이상의 프로세서는 전자 장치의 다른 구성요소 중 하나 또는 임의의 조합을 제어할 수 있으며, 통신에 관한 동작 또는 데이터 처리를 수행할 수 있다. 하나 이상 의 프로세서는 메모리에 저장된 하나 이상의 프로그램 또는 명령어(instruction)를 실행할 수 있다. 예를 들어, 하나 이상의 프로세서는 메모리에 저장된 하나 이상의 명령어를 실행함으로써, 본 개시의 일 실시 예에 따른 방 법을 수행할 수 있다. 본 개시의 일 실시예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 하나의 프로세서에 의해 수행 될 수도 있고, 복수의 프로세서에 의해 수행될 수도 있다. 즉, 일 실시예에 따른 방법에 의해 제 1 동작, 제 2 동작, 제 3 동작이 수행될 때, 제 1 동작, 제 2 동작, 및 제 3 동작 모두 제 1 프로세서에 의해 수행될 수도 있 고, 제 1 동작 및 제 2 동작은 제 1 프로세서(예를 들어, 범용 프로세서)에 의해 수행되고 제 3 동작은 제 2 프 로세서(예를 들어, 인공지능 전용 프로세서)에 의해 수행될 수도 있다. 하나 이상의 프로세서는 하나의 코어를 포함하는 단일 코어 프로세서(single core processor)로 구현될 수도 있 고, 복수의 코어(예를 들어, 동종 멀티 코어 또는 이종 멀티 코어)를 포함하는 하나 이상의 멀티 코어 프로세서 (multicore processor)로 구현될 수도 있다. 하나 이상의 프로세서가 멀티 코어 프로세서로 구현되는 경우, 멀 티 코어 프로세서에 포함된 복수의 코어 각각은 캐시 메모리, 온 칩(On-chip) 메모리와 같은 프로세서 내부 메 모리를 포함할 수 있으며, 복수의 코어에 의해 공유되는 공통 캐시가 멀티 코어 프로세서에 포함될 수 있다. 또 한, 멀티 코어 프로세서에 포함된 복수의 코어 각각(또는 복수의 코어 중 일부)은 독립적으로 본 개시의 일 실 시예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있고, 복수의 코어 전체(또는 일부) 가 연계되어 본 개시의 일 실시예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있다. 본 개시의 일 실시예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 멀티 코어 프로세서에 포함된 복수의 코어 중 하나의 코어에 의해 수행될 수도 있고, 복수의 코어에 의해 수행될 수도 있다. 예를 들어, 일 실시예에 따른 방법에 의해 제 1 동작, 제 2 동작, 및 제 3 동작이 수행될 때, 제 1 동작, 제2 동작, 및 제3 동 작 모두 멀티 코어 프로세서에 포함된 제 1 코어에 의해 수행될 수도 있고, 제 1 동작 및 제 2 동작은 멀티 코 어 프로세서에 포함된 제 1 코어에 의해 수행되고 제 3 동작은 멀티 코어 프로세서에 포함된 제 2 코어에 의해 수행될 수도 있다. 본 개시의 실시예들에서, 프로세서는 하나 이상의 프로세서 및 기타 전자 부품들이 집적된 시스템 온 칩 (SoC), 단일 코어 프로세서, 멀티 코어 프로세서, 또는 단일 코어 프로세서 또는 멀티 코어 프로세서에 포함된 코어를 의미할 수 있으며, 여기서 코어는 CPU, GPU, APU, MIC, DSP, NPU, 하드웨어 가속기 또는 기계 학습 가속기 등으로 구현될 수 있으나, 본 개시의 실시예들이 이에 한정되는 것은 아니다. 특히, 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 전자 장치에 대한 정보에 기초하여 전 자 장치에 대응되는 복수의 UI 컴포넌트를 식별하고, 식별된 복수의 UI 컴포넌트를 포함하는 홈 화면 UI를 표시하도록 디스플레이를 제어한다. 이때, 복수의 UI 컴포넌트는 복수의 유형의 UI 컴포넌트를 포함하고, 복수의 유형 중 제1 유형의 UI 컴포넌트들은 겹쳐져 쌓여진 형태로 표시될 수 있다. 일 실시예에서, 제1 유형의 UI 컴포넌트는 전자 장치 또는 전자 장치와 연결된 외부 장치로부터 수신 된 알림 메시지를 포함하는 UI 컴포넌트일 수 있다. 일 실시예에서, 제1 유형의 UI 컴포넌트의 개수가 임계값 이하인 경우, 프로세서는 제1 유형의 UI 컴포넌 트들이 펼쳐진 형태로 디스플레이 상에 표시할 수 있다. 제1 유형의 UI 컴포넌트의 개수가 임계값을 초과 하는 경우, 프로세서는 제1 유형의 UI 컴포넌트를 겹쳐져 쌓여진 형태로 표시하도록 디스플레이를 제 어할 수 있다. 일 실시예에서, 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 경우, 프로세서는 겹쳐져 쌓 여진 형태로 표시된 제1 유형의 UI 컴포넌트들이 표시되는 영역 중 제1 영역 상에 겹쳐져 쌓여진 제1 유형의 컴 포넌트들의 개수에 대한 정보를 나타내는 인디케이터를 표시하도록 디스플레이를 제어할 수 있다. 일 실시예에서, 프로세서는 복수의 유형의 UI 컴포넌트를 복수의 유형 각각에 대응되는 우선 순위에 따라 배열하여 표시하도록 디스플레이를 제어할 수 있다. 이때, 복수의 유형은 전자 장치의 현재 상태에 대한 정보 및 전자 장치의 제어와 관련된 정보를 포함하는 제2 유형, 전자 장치와 관련된 컨텐츠를 제공하기 위한 서비스에 대한 정보를 포함하는 제3 유형, 전자 장치를 관리하는 서비스에 대한 정보를 포 함하는 제4 유형 및 전자 장치의 에너지에 대한 정보를 포함하는 제5 유형을 포함할 수 있다. 그리고, 제2 유형은 제1 우선 순위이며, 제3 유형은 제2 우선 순위이며, 제4 유형은 제3 우선 순위이며, 제5 유형은 제4 우 선 순위일 수 있다. 일 실시예에서, 제1 우선 순위의 제2 유형의 UI 컴포넌트는 고정된 위치에서 가장 먼저 표시될 수 있다. 전자 장치 또는 전자 장치와 연결된 외부 장치로부터 알림 메시지가 수신되면, 프로세서는 알림 메시 지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성할 수 있다. 프로세서는 생성된 제1 유형의 UI 컴포넌트를 제2 유형의 UI 컴포넌트 다음에 표시하도록 디스플레이를 제어할 수 있다. 일 실시예에서, 제1 유형의 UI 컴포넌트가 표시된 후 제1 유형의 UI 컴포넌트에 포함된 기설정된 버튼이 선택되 면, 프로세서 제1 유형의 UI 컴포넌트를 홈 화면 UI에서 제거하도록 디스플레이를 제어할 수 있다. 일 실시예에서, 전자 장치와 연결된 제1 외부 장치로부터 알림 메시지가 수신되면, 프로세서는 맵에 기초하여 제1 외부 장치가 전자 장치와 동일한 공간에 위치하는지 여부를 식별할 수 있다. 제1 외부 장치 가 전자 장치와 동일한 공간에 위치하면, 프로세서는 제1 외부 장치로부터 수신된 상기 알림 메시지 를 무시할 수 있다. 제1 외부 장치가 전자 장치와 상이한 공간에 위치하면, 프로세서는 제1 외부 장 치로부터 수신된 알림 메시지에 대한 정보를 포함하는 제1 유형의 UI 컴포넌트를 생성할 수 있다. 일 실시예에서, 복수의 UI 컴포넌트는 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 표시하는 UI 컴포 넌트를 포함할 수 있다. 이때, 맵을 표시하는 UI 컴포넌트는 맵 중 전자 장치와 연결된 외부 장치가 배치 된 위치에 외부 장치에 대응되는 인디케이터를 포함할 수 있다. 인디케이터가 선택되면, 프로세서는 외부 장치를 제어하기 위한 제어화면을 표시하도록 디스플레이를 제어할 수 있다. 이하에서는 도면을 참조하여 본 개시에 대해 더욱 상세히 설명하기로 한다. 도 3은 본 개시의 일 실시예에 따른, 전자 장치에 설치된 소프트웨어 구성을 포함하는 블록도이다. 도 3에 도시된 바와 같이, 전자 장치 는 시스템, 미들웨어, 공통 UI 프레임워크 및 어플리케이션을 포함한다. 이때, 시스템은 커널(Kernel) 및 하드웨어 추상화 계층(HAL, Hardware Abstraction Layer)을 포함할 수 있다. 커널은 는 전자 장치에 포함된 다양한 하드웨어를 구동하기 위한 다양한 드라이버를 포함할 수 있다. 하드웨어 추상화 계층은 하드웨어 추상화를 제공하기 위한 구성이다. 미들웨어는 전자 장치의 하나 이상의 리소스들로부터 제공되는 기능 또는 정보가 어플리케이션 에 의해 사용될 수 있도록 다양한 기능들을 어플리케이션으로 제공할 수 있다. 이때, 미들웨어는 도3에 도시된 바와 같이, NUI(Natural User Interface), Native F/W EFL, APP F/W, Security, Dotnet F/W, SES(smart enterprise suite), MM F/W, Connectivity를 포함할 수 있다. 공통 UI 프레임워크는 디스플레이에 표시할 각종 공통 UI를 제공하기 위한 모듈이다. 이때, 공통 UI 프레임워크는 DA FLUX 및 DA Component를 포함할 수 있다. 한편, 공통 UI 프레임워크는 미들웨어 에 포함될 수 있다. 어플리케이션은 전자 장치에 다양한 기능을 지원하기 위한 어플리케이션들을 포함한다. 특히, 본 개 시의 일 실시예에 따른, 어플리케이션은 공통 홈 화면, 공통 어플리케이션 및 제품 특화 어플리 케이션을 포함할 수 있다. 이때, 공통 홈 화면에는 전자 장치의 유형과 상관없는 UI 컴포넌트 (또는 UI 엘리먼트)를 포함할 수 있으나, 전자 장치의 제품 정보에 대응되는 복수의 UI 컴포넌트(341- 1,341-2...)를 저장할 수 있다. 또한, 공통 어플리케이션은 전자 장치의 제품 정보와 상관없이 모든 유형의 전자 장치에 설치될 수 있으나, 공통 어플리케이션에는 전자 장치의 제품 정보에 대응되 는 복수의 UI 컴포넌트(342-1,342-2,,,,)를 저장할 수 있다. 특히, 전자 장치의 제품 정보에 따른 홈 화면 UI는 공통 어플리케이션의 일부 UI 컴포넌트로 구성될 수 있다. 즉, 공통 홈 화면에 포함된 복수의 UI 컴포넌트(341-1,341-2,...), 공통 어플리케이션에 포함된 복수 의 UI 컴포넌트(342-1,342-2,..) 및 제품 특화 어플리케이션은 전자 장치의 제품 정보에 따라 상이할 수 있다. 도 4는 본 개시의 일 실시예에 따른, 전자 장치가 홈 화면 UI를 제공하기 위한 방법을 설명하기 위한 흐름도이 다. 우선, 전자 장치는 공통 어플리케이션을 가동할 수 있다(S410). 이때, 전자 장치에 최초 전원이 공급 되거나, 공통 어플리케이션을 실행하기 위한 사용자 입력 또는 공통 어플리케이션을 다운로드하기 위한 사용자 입력이 입력되면, 전자 장치는 공통 어플리케이션을 가동할 수 있다. 전자 장치는 전자 장치에 대한 정보를 획득할 수 있다(S420). 구체적으로, 전자 장치는 공통 어 플리케이션이 가동되면, 메모리에 저장된 시스템 정보를 확인하여 전자 장치에 대한 정보를 획득할 수 있다. 이때, 전자 장치에 대한 정보는 전자 장치의 제품 정보로서, 제품 타입, 모델명, 일련 번호 등을 포함할 수 있다. 전자 장치는 전자 장치의 타입을 식별하였는지 여부를 판단할 수 있다(S430). 즉, 전자 장치는 전자 장치에 대한 정보에 기초하여 전자 장치의 타입을 식별하였는지 여부를 판단할 수 있다. 전자 장치의 타입이 식별된 것으로 판단되면(S430-Y), 전자 장치는 전자 장치에 대한 정보에 대 응되는 복수의 UI 컴포넌트를 식별할 수 있다(S440). 예를 들어, 전자 장치의 타입이 냉장고인 경우, 전자 장치는 전자 장치에 대한 정보에 기초하여 냉장고에 대응되는 복수의 UI 컴포넌트를 식별할 수 있으 며, 전자 장치의 타입이 세탁기인 경우, 전자 장치는 전자 장치에 대한 정보에 기초하여 세탁기 에 대응되는 복수의 UI 컴포넌트를 식별할 수 있다. 전자 장치의 타입이 식별되지 못한 것으로 판단되면(S430-Y), 전자 장치는 디폴트 UI 컴포넌트를 식 별할 수 있다(S450). 이때, 디폴트 UI 컴포넌트는 전자 장치의 유형과 관계없이 제공되는 UI 컴포넌트일 수 있다. 전자 장치는 식별된 UI 컴포넌트들을 포함하는 홈 화면 UI를 표시할 수 있다(S460). 이때, 홈 화면 UI는 식별된 UI 컴포넌트들 뿐만 아니라 공통 홈 화면을 이용하여 홈 화면 UI를 생성할 수 있다. 공통 홈 화면은 전 자 장치의 유형과 상관없는 UI 엘리먼트(예로, 전원 버튼, 설정 버튼 등)를 포함하는 공통 UI 컴포넌트일 수 있다. 그리고, 전자 장치는 식별된 UI 컴포넌트와 공통 홈 화면을 이용하여 생성된 홈 화면 UI를 표시 할 수 있다. 한편, 상술한 실시예에서는 전자 장치의 타입이 식별되지 못한 것으로 판단되면, 전자 장치가 디폴트 UI 컴포넌트를 식별하고, 디폴트 UI 컴포넌트와 공통 홈 화면을 이용하여 홈 화면 UI를 생성하는 것으로 설명하 였으나, 이는 일 실시예에 불과할 뿐, 전자 장치의 타입이 식별되지 못한 것으로 판단되면, 전자 장치 공통 홈 화면만을 이용하여 홈 화면 UI를 생성할 수 있다. 도 5는 본 개시의 일 실시예에 따른, 홈 화면 UI를 도시한 도면이다. 도 5에 도시된 바와 같이, 홈 화면 UI는 공통 UI 컴포넌트와 복수의 UI 컴포넌트(520,530,540,..)를 포함할 수 있다. 공통 홈 화면은 전자 장치의 유형과 상관없이 전자 장치의 동작에 필요한 UI 엘리먼트를 포함하 는 공통 UI 컴포넌트일 수 있다. 이때, 전자 장치의 유형과 상관없이 전자 장치의 동작에 필요한 UI 엘리먼트는 도 5의 우측 상단에 도시된 바와 같은 전원 버튼, 설정 버튼 등을 포함할 수 있으나, 이 에 한정되는 것은 아니다. 복수의 UI 컴포넌트(520,530,540)는 전자 장치의 유형에 대응되며, 전자 장치에 특화된 UI 컴포넌트 일 수 있다. 이때, 복수의 UI 컴포넌트(520,530,540)는 도 5에 도시된 바와 같이, 카드 형태일 수 있으나, 이에 한정되는 것은 아니다. 또한, 복수의 UI 컴포넌트(520,530,540)는 공통 UI 컴포넌트인 공통 홈 화면 상에 표시될 수 있다. 또한, 복수의 UI 컴포넌트(520,530,540) 중 적어도 일부(520,530)만이 공통 홈 화면 상에 표시될 수 있으며, 스크롤 동작을 통해 나머지 UI 컴포넌트이 공통 홈 화면 상에 표시될 수 있다. 또한, 복수의 UI 컴포넌트(520,530,540)는 UI 컴포넌트가 제공하는 기능이나 정보에 따라 복수의 유형으로 구분 될 수 있다. 이에 대해서는 추후 도면을 참조하여 상세히 설명하기로 한다. 도 6은 본 개시의 일 실시예에 따른, UI 컴포넌트와 공통 홈 화면을 이용하여 생성된 홈 화면 UI를 도시한 도면 이다. 전자 장치는 도 4에서 설명한 바와 같이, 전자 장치의 정보에 기초하여 전자 장치에 대응되는 복수의 UI 컴포넌트를 식별할 수 있다. 예를 들어, 전자 장치가 세탁기인 경우, 전자 장치는 도 6에 도시된 바와 같이, 세탁기에 대응되는 복수의 UI 컴포넌트(610-1,610-2)를 식별할 수 있다. 이때, 복수의 UI 컴 포넌트(610-1,610-2)는 전자 장치의 제품 제작시 메모리에 저장될 수 있으나, 이는 일 실시예에 불과 할 뿐, 전자 장치 설치 후 공통 어플리케이션이 설치되면 외부 서버로부터 다운로드되어 메모리에 저 장될 수 있다. 또한, 공통 어플리케이션이 업데이트될 경우, 외부 서버로부터 업데이트된 복수의 UI 컴포넌트가 다운로드되어 메모리에 저장될 수 있다. 또한, 전자 장치는 공통 홈 화면을 식별할 수 있다. 이때, 공통 홈 화면에는 도 6에 도시된 바 와 같이, 복수의 UI 컴포넌트(610-1,610-2)가 표시되는 영역을 포함할 수 있으며, 전자 장치의 유형 에 상관없이 전자 장치의 동작에 필요한 복수의 버튼(622,623)을 포함할 수 있다. 전자 장치는 공통 홈 화면과 복수의 UI 컴포넌트(610-1,610-2)를 중첩하여 표시함으로써, 도 6에 도 시된 바와 같은 홈 화면 UI를 제공할 수 있다. 이때, 도 6에 도시된 바와 같이, 복수의 UI 컴포넌트(610- 1,610-2)가 좌우 방향으로 나란히 표시될 수 있으나, 이는 일 실시예에 불과할 뿐, 복수의 UI 컴포넌트(610- 1,610-2)가 상하 방향으로 표시될 수 있다. 도 7은 본 개시의 일 실시예에 따른, UI 컴포넌트를 구성하는 UI 엘리먼트를 도시한 도면이다. 구체적으로, UI 컴포넌트는 복수의 UI 엘리먼트로 구성될 수 있다. 이때, 복수의 UI 엘리먼트는 아이콘, 버튼, 프로그레스 바 등과 같이 UI 컴포넌트를 구성하는 구성요소일 수 있다. 특히, UI 컴포넌트에 포함된 복수의 UI 엘리먼트는 전자 장치의 유형과 무관하게 통합하여 개발될 수 있다. 일 실시예로, 도 7의 상단에 도시된 바와 같이, UI 컴포넌트에 포함된 복수의 UI 엘리먼트는 온/오프를 선택하기 위한 복수의 제1 아이콘, 재 생 동작/멈춤 동작을 선택하기 위한 복수의 제2 아이콘, 노말(normal) 모드/ 사용 금지(disable) 모드를 선택하기 위한 복수의 버튼 등을 포함할 수 있다. 이때, 복수의 제1 아이콘, 복수의 제2 아이콘 및 복수의 버튼 각각은 서로 동일한 형태를 가질 수 있으나, 색이나 밝기 등이 서로 상이할 수 있다. 즉, 종래에는 전자 장치의 유형에 따라 개별적으로 UI 컴포넌트를 개발하였으나, 본 일 실시예에 따르면, UI 컴포넌트는 전자 장치의 유형과 관련없이 공통으로 개발되어 공통 어플리케이션을 통해 제공될 수 있다. 따라서, 공통 어플리케이션을 설치한 복수의 전자 장치는 통일된 형태의 홈 화면 UI를 제공할 수 있게 된 다. 따라서, 사용자는 통일감 있는 홈 화면 UI를 통해 다양한 복수의 전자 장치를 더욱 손쉽게 제어할 수 있게 된다. 다만, 서로 다른 유형의 복수의 전자 장치가 통일된 형태의 홈 화면 UI를 제공하더라도, 전자 장치의 유형 이나 사용자가 선택한 테마에 따라 UI 컴포넌트를 구성하는 UI 엘리먼트의 색이 변경될 수 있다. 도 7의 하단에 도시된 바와 같이, 세탁기에 대응되는 UI 컴포넌트(740-1)와 건조기에 대응되는 UI 컴포넌트(740-2)가 동일한 형태의 UI 엘리먼트를 포함할 수 있으나, 두 UI 컴포넌트(740-1,740-2)에 포함된 UI 엘리먼트의 색이 서로 상이할 수 있다. 도 8은 본 개시의 일 실시예에 따른, 복수의 UI 컴포넌트를 포함하는 홈 화면 UI의 표시를 제어하는 방법을 설 명하기 위한 흐름도이다. 전자 장치는 전자 장치의 유형에 대응되는 복수의 UI 컴포넌트(810-1,810-2,810-3,810-4)를 식별할 수 있다. 이때, 복수의 UI 컴포넌트(810-1,810-2,810-3,810-4)는 우선 순위에 따라 배열될 수 있다. 다만, 디스 플레이의 크기 한계로, 복수의 UI 컴포넌트가 임계 개수 이상 초과하면, 복수의 UI 컴포넌트(810-1,810- 2,810-3,810-4) 모두가 동시에 디스플레이를 통해 표시될 수 없다. 예를 들어, 전자 장치는 도 8의 상단에 도시된 바와 같이, 복수의 UI 컴포넌트(810-1,810-2,810-3,810-4) 중 제1 및 제2 UI 컴포넌트(810-1,810-2)만이 디스플레이를 통해 제공될 수 있다. 이때, 전자 장치는 스와이프 입력을 통해 복수의 UI 컴포넌트(810-1,810-2,810-3,810-4)을 스크롤하여 현재 디스플레이에 표 시되지 않은 UI 컴포넌트를 표시할 수 있다. 예를 들어, 도 8의 상단에 도시된 바와 같이, 복수의 UI 컴포넌트(810-1,810-2,810-3,810-4) 중 제1 및 제2 UI 컴포넌트(810-1,810-2)가 디스플레이를 통해 제공되는 동안 화면을 오른쪽으로 이동하는 제1 스와이프 동 작이 감지되면, 전자 장치는 화면을 스크롤하여 도 8의 하단에 도시된 바와 같이, 현재 디스플레이에 제2 내지 제4 UI 컴포넌트(810-2,810-3,810-4)를 표시할 수 있다. 이와 반대로, 도 8의 하단에 도시된 바와 같 이, 복수의 UI 컴포넌트(810-1,810-2,810-3,810-4) 중 제2 내지 제4 UI 컴포넌트(810-2,810-3,810-4)가 디스플 레이를 통해 제공되는 동안 화면을 왼쪽으로 이동하는 제2 스와이프 동작이 감지되면, 전자 장치는 화면을 스크롤하여 도 8의 상단에 도시된 바와 같이, 현재 디스플레이에 제1 및 제2 UI 컴포넌트(810- 1,810-2)를 표시할 수 있다. 도 9는 본 개시의 일 실시예에 따른, UI 컴포넌트의 유형에 대응되는 우선 순위에 따라 복수의 UI 컴포넌트를 배열하는 방법을 설명하기 위한 도면이다. 복수의 UI 컴포넌트는 UI 컴포넌트가 제공하는 기능 또는 정보에 따라 복수의 유형으로 구분될 수 있다. 그리고, 전자 장치는 복수의 유형의 UI 컴포넌트를 복수의 유형 각각에 대응되는 우선 순위에 따라 배열하 여 표시하도록 디스플레이를 제어할 수 있다. 일 실시예로, 복수의 유형의 UI 컴포넌트는 전자 장치 또는 전자 장치와 연결된 외부 장치로부터 수 신된 알림 메시지를 포함하는 제1 유형의 UI 컴포넌트를 포함할 수 있다. 또한, 복수의 유형의 UI 컴포넌트는 전자 장치의 현재 상태에 대한 정보 및 전자 장치의 제어와 관련 된 정보를 포함하는 제2 유형의 UI 컴포넌트를 포함할 수 있다. 이때, 제2 유형의 UI 컴포넌트는 현재 전자 장 치의 동작 모드, 동작 상태에 대한 정보를 포함할 수 있으며, 전자 장치를 제어할 수 있는 다양한 아 이콘을 포함할 수 있다. 또한, 복수의 유형의 UI 컴포넌트는 전자 장치와 관련된 컨텐츠를 제공하기 위한 서비스에 대한 정보를 포 함하는 제3 유형의 UI 컴포넌트를 포함할 수 있다. 이때, 제3 유형의 컴포넌트는 전자 장치와 관련되며 우선 순 위가 높은 컨텐츠 서비스(세제 리스트 제공 서비스/푸드 리스트 제공 서비스 등)에 대한 정보가 포함될 수 있다. 또한, 복수의 유형의 UI 컴포넌트는 전자 장치를 관리하는 서비스에 대한 정보를 포함하는 제4 유형의 UI 컴포넌트를 포함할 수 있다. 이때, 제4 유형의 UI 컴포넌트는 전자 장치의 소모품 관리 등과 같이, 전자 장치를 관리하는 서비스에 대한 정보를 포함할 수 있다. 또한, 복수의 유형의 UI 컴포넌트는 전자 장치의 에너지에 대한 정보를 포함하는 제5 유형의 UI 컴포넌트 를 포함할 수 있다. 이때, 제5 유형의 UI 컴포넌트는 현재 에너지 사용량에 대한 정보, 절약된 에너지 사용량에 대한 정보 등과 같이, 전자 장치의 에너지에 대한 정보가 포함될 수 있다. 또한, 복수의 유형의 UI 컴포넌트는 전자 장치가 애플리케이션 기능을 제공하는 서버와 연결되어 있지 않 는 경우, 서버와 연결을 추천하기 위한 제6 유형의 UI 컴포넌트를 포함할 수 있다. 이때, 제2 유형의 UI 컴포넌트는 제1 우선 순위이며, 제3 유형의 UI 컴포넌트는 제2 우선 순위이며, 제4 유형의 UI 컴포넌트는 제3 우선 순위이며, 제5 유형의 UI 컴포넌트는 제4 우선 순위일 수 있다. 다만, 전자 장치 가 애플리케이션 기능을 제공하는 서버와 연결되어 있지 않는 경우, 제3 유형의 UI 컴포넌트 대신 제6 유형의컴포넌트가 제2 우선 순위일 수 있다. 일 실시예로, 도 9에 도시된 바와 같이, 제2 유형의 UI 컴포넌트는 전자 장치의 현재 상태에 대한 정 보 및 전자 장치의 제어와 관련된 정보를 포함하는 UI 컴포넌트로서, 가장 좌측에 먼저 표시될 수 있다. 또한, 전자 장치가 애플리케이션 기능을 제공하는 서버와 연결되어 있지 않는 경우, 제6 유형의 UI 컴포넌 트는 도 9에 도시된 바와 같이, 제2 유형의 UI 컴포넌트 다음에 표시될 수 있다. 전자 장치에 애플리케이션이 설치되고, 전자 장치가 애플리케이션 기능을 제공하는 서버와 연결된 경우, 제6 유형의 UI 컴포넌트는 홈 화면 UI에서 제거될 수 있다. 또한, 전자 장치에 애플리케이션이 설치되고, 전자 장치가 애플리케이션 기능을 제공하는 서버와 연 결된 경우, 도 9에 도시된 바와 같이, 제3 유형의 UI 컴포넌트(930, 940)가 제2 유형의 UI 컴포넌트 다음 에 표시될 수 있다. 그리고, 도 9에 도시된 바와 같이, 제4 유형의 UI 컴포넌트 및 제5 유형의 UI 컴포넌 트가 제3 유형의 UI 컴포넌트(930, 940) 다음에 표시될 수 있다. 이때, 도 9에서 설명한 우선 순위는 일 실시예에 불과할 뿐, 다른 방법으로 우선 순위가 결정될 수 있음은 물론 이다. 뿐만 아니라, 복수의 유형에 대한 우선 순위는 제조시에 결정될 수 있으나, 이는 일 실시예에 불과할 뿐, 사용자 설정에 의해 우선 순위가 결정될 수 있다. 도 10은 본 개시의 일 실시예에 따른, 알림 메시지에 대응되는 UI 컴포넌트를 생성하여 홈 화면 UI에 추가하여 표시하는 방법을 설명하기 위한 흐름도이다. 우선, 전자 장치는 홈 화면 UI를 표시한다(S1010). 이때, 홈 화면 UI에는 복수의 유형의 UI 컴포넌트가 포 함될 수 있다. 전자 장치는 서버로부터 알림(Notification) 메시지가 수신되었는지 여부를 식별할 수 있다(S1020). 예로, 전자 장치는 서버로부터 새로운 업데이트 사항에 대한 정보가 포함된 알림 메시지, 전자 장치와 관련 된 뉴스가 포함된 알림 메시지, 서버로부터 긴급 사항 정보가 포함된 알림 메시지 등이 수신되었는지 여부를 식 별할 수 있다. 또는, 전자 장치는 전자 장치에서 알림 메시지가 발생하였는지 여부를 식별할 수 있다(S1030). 예로, 전자 장치는 전자 장치에서 사용자가 설정한 시간, 모드, 동작 등이 종료되었는지에 대한 알림 메시 지, 전자 장치에서 발생한 오작동 이벤트에 대한 알림 메시지 등이 발생하였는지 여부를 식별할 수 있다. 또는, 전자 장치는 전자 장치와 연결된 외부 장치로부터 알림 메시지가 수신되었는지 여부를 식별할 수 있다(S1040). 예로, 전자 장치는 외부 장치의 동작 종료, 현재 상태 등에 대한 정보 및 외부 장치에서 발생한 이벤트에 대한 정보가 포함된 알림 메시지가 수신되었는지 여부를 식별할 수 있다. 이때, 전자 장치 는 외부 장치로부터 직접 알림 메시지를 수신할 수 있으나, 이는 일 실시예에 불과할 뿐, 외부 애플리케이 션 서버를 통해 외부 장치로부터 알림 메시지를 수신할 수 있다. 서버로부터 알림 메시지가 수신되거나(S1020-Y), 전자 장치에서 알림 메시지가 발생하거나(S1030-Y), 외부 장치 로부터 알림 메시지가 수신되면(S1040-Y), 전자 장치는 알림 메시지에 대응되는 UI 컴포넌트를 생성할 수 있다(S1050). 즉, 전자 장치는 알림 메시지를 포함하는 제2 유형의 UI 컴포넌트를 생성할 수 있다. 전자 장치는 생성된 UI 컴포넌트를 홈 화면 UI에 추가하여 표시할 수 있다(S1060). 이때, 생성된 UI 컴포 넌트는 제1 유형의 UI 컴포넌트로서, 제2 유형의 UI 컴포넌트 다음에 표시될 수 있다. 일 실시예로, 제2 유형의 UI 컴포넌트가 포함되는 홈 화면 UI가 표시되는 동안 외부 장치로부터 알 림 메시지가 수신되면, 전자 장치는 도 11에 도시된 바와 같이, 제2 유형의 UI 컴포넌트 다음에 알 림 메시지를 포함하는 UI 컴포넌트를 추가하여 홈 화면 UI를 표시할 수 있다. 이때, 추가된 제1 유 형의 UI 컴포넌트는 외부 장치에 대응되는 UI 컴포넌트일 수 있다. 예로, 외부 장치가 오븐인 경우, 추가 된 제1 유형의 UI 컴포넌트는 오븐에 대응되는 UI 컴포넌트일 수 있다. 또한, 전자 장치는 알림 메시지를 포함하는 제1 유형의 UI 컴포넌트의 개수에 따라 상이한 방법으로 제1 유형의 UI 컴포넌트를 표시할 수 있다. 구체적으로, 제1 유형의 UI 컴포넌트의 개수가 임계값 이하인 경우, 전 자 장치는 제1 유형의 UI 컴포넌트들이 펼쳐진 형태로 표시하고, 제1 유형의 UI 컴포넌트의 개수가 임계값 을 초과하는 경우, 전자 장치는 제1 유형의 UI 컴포넌트를 겹쳐져 쌓여진 형태로 표시할 수 있다. 일 실시예로, 제1 유형의 UI 컴포넌트의 개수가 임계값(예로, 4개) 이하인 2개인 경우, 전자 장치는 도 12a에 도시된 바와 같이, 제2 유형의 UI 컴포넌트와 제3 유형의 UI 컴포넌트 사이에 제1 유형의 UI 컴포넌트들(1220-1,1220-2)을 펼쳐진 형태로 표시할 수 있다. 이때, 제1 유형의 UI 컴포넌트들(1220- 1,1220-2)은 알림 메시지 발생 시간순으로 표시될 수 있다. 즉, UI 컴포넌트(1220-1)에 대응되는 알림 메시지의 발생 시간이 UI 컴포넌트(1220-2)에 대응되는 알림 메시지의 발생 시간보다 최근일 수 있다. 일 실시예로, 제1 유형의 UI 컴포넌트 개수가 임계값(예로, 4개) 초과인 6개인 경우, 전자 장치는 도 12b 에 도시된 바와 같이, 제2 유형의 UI 컴포넌트와 제3 유형의 UI 컴포넌트 사이의 영역에 제1 유형의 UI 컴포넌트들을 겹쳐져 쌓여진 형태로 표시할 수 있다. 이때, 겹쳐져 쌓여진 형태의 제1 유형의 UI 컴 포넌트들은 알림 메시지 발생 시간순으로 겹쳐져 쌓여질 수 있다. 즉, 가장 최근에 발생한 알림 메시지를 포함 하는 UI 컴포넌트가 가장 먼저 표시될 수 있다. 일 실시예로, 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 경우, 전자 장치는 겹쳐져 쌓여 진 형태로 표시된 제1 유형의 UI 컴포넌트들이 표시되는 영역 중 제1 영역 상에 겹쳐져 쌓여진 제1 유형 의 컴포넌트들의 개수에 대한 정보를 나타내는 인디케이터(1240-1)를 표시할 수 있다. 이때, 인디케이터는 숫자 로 표시될 수 있으나, 이는 일 실시예에 불과할 뿐, 다양한 표시 방법(예로, 프로그레스 바, 아이콘 등)으로 표 현될 수 있다. 일 실시예로, 제1 유형의 UI 컴포넌트가 표시된 후 제1 유형의 UI 컴포넌트에 포함된 기설정된 버튼이 선택되면, 전자 장치는 제1 유형의 UI 컴포넌트를 홈 화면 UI에서 제거할 수 있다. 예를 들어, 도 11에 도 시된 바와 같이, 제1 유형의 UI 컴포넌트에 포함된 \"조리 종료\" 버튼이 선택되면, 전자 장치 는 제1 유형의 UI 컴포넌트를 홈 화면 UI에서 제거할 수 있다. 특히, 제1 유형의 UI 컴포넌트들이 겹쳐져 쌓여진 형태로 표시되는 동안 UI 컴포넌트에 포함된 기설정된 버튼을 선택하는 사용자 입력이 감지되면, 전자 장치는 겹쳐져 쌓여진 형태의 UI 컴포넌트들 중 맨 위에 표시되는 UI 컴포넌트를 제거하고 다음 순위의 UI 컴포넌트를 표시할 수 있다. 일 실시예에서, 제1 유형의 UI 컴포넌트가 표시된 후 기 설정된 시간(예로, 1일)이 경과되면, 전자 장치는 제1 유형의 UI 컴포넌트를 홈 화면 UI에서 제거할 수 있다. 상술한 바와 같이, 알림 메시지를 포함하는 UI 컴포넌트를 개수에 따라 상이한 방법으로 표시함으로써, 많은 알 림 메시지를 효율적으로 인식하여 처리할 수 있게 된다. 도 13a는 본 개시의 일 실시예에 따른, 맵을 표시하는 UI 컴포넌트를 도시한 도면이다. 구체적으로, 메모리는 댁 내의 공간에 대한 맵을 저장할 수 있다. 이때, 메모리에 저장된 맵은 전자 장치 또는 외부 장치에 포함된 복수의 센서로부터 획득된 센싱 정보에 의해 생성되거나 외부 서버로부터 수신될 수 있다. 뿐만 아니라, 메모리에 저장된 맵에는 댁 내에 위치하는 다양한 전자 장치들에 대한 정보 가 포함될 수 있다. 전자 장치들에 대한 정보는 전자 장치에 포함된 카메라나 로봇 청소기 등과 같은 외부 장치에 포함된 카메라를 통해 촬영된 이미지에 기초하여 획득되거나 사용자 입력을 통해 획득될 수 있다. 이때, 전자 장치들에 대한 정보는 전자 장치들의 위치 정보, 전자 장치들의 식별 정보 등이 포함될 수 있다. 한편, 홈 화면 UI에 포함된 복수의 UI 컴포넌트는 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 표시하 는 UI 컴포넌트를 포함할 수 있다. 예를 들어, 홈 화면 UI는 도 13a에 도시된 바와 같이, 댁 내의 공간에 대한 맵을 포함하는 UI 컴포넌트를 포함할 수 있다. 이때, 맵을 표시하는 UI 컴포넌트는 맵 중 전자 장치(10 0)와 연결된 외부 장치가 배치된 위치에 외부 장치에 대응되는 인디케이터를 포함할 수 있다. 예를 들어, 맵을 표시하는 UI 컴포넌트는 도 13a에 도시된 바와 같이, 복수의 외부 장치 각각에 대응되는 복수의 인디케이 터(1310-1 내지 1310-4)를 포함할 수 있다. 이때, 인디케이터에는 대응되는 외부 장치에 대한 정보 및 대응되는 외부 장치에서 발생한 알림 메시지를 나타내는 아이콘 등이 포함될 수 있다. 또한, 복수의 인디케이터 중 하나가 선택되면, 전자 장치는 선택된 인디케이터에 대응되는 외부 장치를 제 어하기 위한 제어화면을 표시할 수 있다. 예를 들어, 도 13a에 도시된 복수의 인디케이터(1310-1 내지 1310-4) 중 제1 인터케이터(1310-1)가 선택되면, 전자 장치는 도 13b에 도시된 바와 같이, 제1 인디케이터(1310- 1)에 대응되는 에어컨을 제어하기 위한 제어 화면을 표시할 수 있다. 한편, 도 13b에서는 제1 인디케이터(1310-1)에 대응되는 에어컨을 제어하기 위한 제어 화면이 UI 컴포넌 트 내에 표시되는 것으로 도시되었으나, 이는 일 실시예에 불과할 뿐, 제1 인디케이터(1310-1)에 대응되는 에어컨을 제어하기 위한 제어 화면을 포함하는 별도의 UI 컴포넌트를 생성하여 홈 화면 UI 내에 추가 할 수 있다. 도 14는 본 개시의 일 실시예에 따른, 외부 장치가 전자 장치와 동일한 공간에 위치하는지 여부에 따라 알림 메 시지에 대응되는 UI 컴포넌트를 제공할지 여부를 식별하는 실시예를 설명하기 위한 흐름도이다. 우선, 전자 장치는 전자 장치가 위치하는 댁 내의 공간에 대한 맵을 저장할 수 있다(S1410). 구체적 으로, 전자 장치는 전자 장치, 외부 장치 또는 서버를 통해 생성된 맵을 저장할 수 있다. 전자 장치는 홈 화면 UI를 표시할 수 있다(S1420). 이때, 홈 화면 UI에는 복수의 유형의 UI 컴포넌트가 포 함될 수 있다. 전자 장치는 외부 장치로부터 알림 메시지가 수신되었는지 여부를 식별할 수 있다(S1430). 예로, 전자 장 치는 외부 장치의 동작 종료, 현재 상태 등에 대한 정보 및 외부 장치에서 발생한 이벤트에 대한 정보가 포함된 알림 메시지가 수신되었는지 여부를 식별할 수 있다. 이때, 전자 장치는 외부 장치로부터 직접 알 림 메시지를 수신할 수 있으나, 이는 일 실시예에 불과할 뿐, 외부 애플리케이션 서버로를 통해 외부 장치로부 터 알림 메시지를 수신할 수 있다. 외부 장치로부터 알림 메시지가 수신되면(S1430-Y), 전자 장치는 전자 장치가 외부 장치와 상이한 공 간에 위치하는지 여부를 식별할 수 있다(S1440). 구체적으로, 전자 장치는 저장된 맵을 이용하여 댁 내의 복수의 공간 중 전자 장치와 외부 장치가 동일한 공간에 위치하는지 여부를 식별할 수 있다. 전자 장치가 외부 장치와 상이한 공간에 위치하는 것으로 식별되면(S1440-Y), 전자 장치는 알림 메시 지에 기초하여 새로운 UI 컴포넌트를 생성할 수 있다(S1450). 그리고, 전자 장치는 새로운 UI 컴포넌트가 추가된 홈 UI 화면을 표시할 수 있다(S1470). 이때, 새롭게 추가된 UI 컴포넌트는 앞서 설명한 바와 같이, 제2 유형의 UI 컴포넌트(즉, 전자 장치의 현재 상태에 대한 정보 및 전자 장치의 제어와 관련된 정보를 포함하는 UI 컴포넌트) 다음 순서에 추가될 수 있다. 뿐만 아니라, 전자 장치는 맵을 표시하는 UI 엘리먼 트에 포함된 복수의 인디케이터 중 알림 메시지를 전송한 외부 장치에 대응되는 인디케이터에 알림 메시지에 대 한 정보를 제공할 수 있다. 다만, 전자 장치가 외부 장치와 동일한 공간에 위치하는 것으로 식별되면(S1440-N), 전자 장치는 알 림 메시지를 무시할 수 있다(S1460). 즉, 전자 장치는 별도의 UI 컴포넌트를 생성하지 않을 수 있다. 이때, 알림 메시지를 포함하는 UI 컴포넌트는 외부 장치에 표시되는 홈 화면 UI에 추가되어 표시될 수 있다. 동일한 공간에 위치한 외부 장치로부터 발생된 알림 메시지를 전자 장치를 통해 제공할 경우, 사용자에게 효용이 감소하는 효과가 존재할 수 있다. 상술한 바와 같이, 상이한 공간에 위치한 외부 장치로부터 발생된 알 림 메시지를 전자 장치를 통해 제공함으로써, 전자 장치의 통신 리소스 및 제어 리소스를 효율적으로 사용할 수 있으며, 사용자 편의성도 증가할 수 있게 된다. 한편, 본 개시의 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또 는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 개시의 다양한 실시 예에 따른 방법은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine- readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는 저장 매체로부터 저 장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시 예들에 따른 전자 장치를 포함할 수 있다. 한편, 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 상기 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접 또는 상기 프로세서의 제어 하에 다른 구성요소들 을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0127425", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2023-0127425", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 댁 내의 전자 장치를 제어하기 위한 시스템을 도시한 도면, 도 2는 본 개시의 일 실시예에 따른, 전자 장치의 구성을 나타내는 블록도, 도 3은 본 개시의 일 실시예에 따른, 전자 장치에 설치된 소프트웨어 구성을 포함하는 블록도, 도 4는 본 개시의 일 실시예에 따른, 전자 장치가 홈 화면 UI를 제공하기 위한 방법을 설명하기 위한 흐름도,도 5는 본 개시의 일 실시예에 따른, 홈 화면 UI를 도시한 도면, 도 6은 본 개시의 일 실시예에 따른, UI 컴포넌트와 공통 홈 화면을 이용하여 생성된 홈 화면 UI를 도시한 도면, 도 7은 본 개시의 일 실시예에 따른, UI 컴포넌트를 구성하는 UI 엘리먼트를 도시한 도면, 도 8은 본 개시의 일 실시예에 따른, 복수의 UI 컴포넌트를 포함하는 홈 화면 UI의 표시를 제어하는 방법을 설 명하기 위한 흐름도, 도 9는 본 개시의 일 실시예에 따른, UI 컴포넌트의 유형에 대응되는 우선 순위에 따라 복수의 UI 컴포넌트를 배열하는 방법을 설명하기 위한 도면, 도 10은 본 개시의 일 실시예에 따른, 알림 메시지에 대응되는 UI 컴포넌트를 생성하여 홈 화면 UI에 추가하여 표시하는 방법을 설명하기 위한 흐름도, 도 11은 본 개시의 일 실시예에 따른, 알림 메시지에 대응되는 UI 컴포넌트가 추가된 홈 화면 UI를 도시한 도면, 도 12a 및 도 12b는 본 개시의 일 실시예에 따른, 제1 유형의 UI 컴포넌트의 개수에 따라 상이한 방법으로 적어 도 하나의 UI 컴포넌트를 표시하는 실시예를 설명하기 위한 도면, 도 13a는 본 개시의 일 실시예에 따른, 맵을 표시하는 UI 컴포넌트를 도시한 도면, 도 13b는 본 개시의 일 실시예에 따른, 맵을 표시하는 UI 컴포넌트 내에 제어화면을 추가하여 표시하는 실시예 를 설명하기 위한 도면, 도 14는 본 개시의 일 실시예에 따른, 외부 장치가 전자 장치와 동일한 공간에 위치하는지 여부에 따라 알림 메 시지에 대응되는 UI 컴포넌트를 제공할지 여부를 식별하는 실시예를 설명하기 위한 흐름도이다."}
