{"patent_id": "10-2019-0023751", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0134975", "출원번호": "10-2019-0023751", "발명의 명칭": "인공지능 시스템의 앱들 또는 스킬들의 리스트를 표시하는 증강 현실 장치 및 동작 방법", "출원인": "삼성전자주식회사", "발명자": "박지윤"}}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 디스플레이; 카메라; 무선 통신 회로;상기 디스플레이, 상기 카메라, 및 상기 무선 통신 회로와 작동적으로 연결되는 프로세서; 및상기 프로세서와 작동적으로 연결된 메모리를 포함하고, 상기 메모리는 실행 시에, 상기 프로세서가, 상기 카메라를 통해, 상기 전자 장치의 사용자의 계정(account)과 연관된, 외부의 음성 인식 기반 인공 지능 장치를 포함하는 이미지를 획득하고, 상기 무선 통신 회로를 통해, 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치로 전송하고, 상기 무선 통신 회로를 통해, 상기 외부 전자 장치로부터 상기 인공 지능 장치를 포함하는 인공 지능 시스템에설치된 어플리케이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하고, 및 상기 제2 데이터에 기반하여, 상기 디스플레이를 통해, 상기 목록을 포함하는 그래픽 유저 인터페이스를 상기음성 인식 장치에 인접하거나 중첩되도록 표시하도록 하는, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 컨텍스트 정보는, 상기 전자 장치의 사용자 계정 정보, 위치 정보, 또는 시간 정보 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 제2 데이터는, 어플리케이션들의 우선순위를 나타내는 정보를 포함하고, 상기 프로세서는, 상기 목록을 상기 우선순위에 따라서 상기 디스플레이 상에 표시하도록 구성된, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 어플리케이션들의 우선순위를 나타내는 정보는, 상기 전자 장치의 상기 사용자 계정 정보, 상기 위치 정보, 상기 시간 정보, 어플리케이션들의 명칭들의 알파벳순서, 또는 사용 이력 중 적어도 하나에 기반하는, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서, 공개특허 10-2019-0134975-3-상기 위치 정보는, 상기 전자 장치가 접속된 망의 망(network) 정보를 포함하고, 상기 어플리케이션들의 목록은, 상기 망 정보에 기반하여 결정된, 사용자 전용 어플리케이션 그룹 또는 공용 어플리케이션 그룹을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 망 정보는, 상기 전자 장치가 접속된 망의 종류, 속도, 연결성(connectivity), 능력(capability), 서비스 이용가능성(service availability), 또는 엣지 서버의 종류 중 적어도 하나를 나타내는, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서, 상기 인스트럭션들은 상기 프로세서가, 상기 음성 인식 장치로 수신되는 사용자 발화에 기반하여, 상기 디스플레이를 통해, 상기 어플리케이션들의 목록에 포함되는 어플리케이션의 실행 화면을 표시하도록하는, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 전자 장치의 움직임을 감지하도록 구성된 센서를 더 포함하고, 상기 프로세서는, 상기 카메라가 상기 음성 인식 장치를 응시하는 동안에, 지정된 임계 시간 동안에 상기 전자 장치의 움직임이감지되지 않거나, 또는 사용자 입력이 수신되면, 상기 이미지를 획득하도록 구성된, 전자 장치."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "에 있어서, 상기 인스트럭션들은, 상기 프로세서가, 상기 컨텍스트 정보에 포함되는 위치 정보에 기반하여 상기 음성 인식 장치가 상기 사용자 계정과 관련되어 있는지 결정하고,상기 음성 인식 장치가 상기 사용자 계정과 관련된 경우, 상기 메모리에 저장된 상기 음성 인식 장치에 대한 정보에 기반하여, 상기 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정하도록 하는 시스템."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 인스트럭션들은 상기 프로세서가, 상기 컨텍스트 정보에 포함되는 상기 전자 장치의 사용자 계정 정보, 시간 정보, 또는 상기 위치 정보 중 적어도 하나에 기반하여, 상기 어플리케이션들의 우선순위를 결정하고, 상기 제2 데이터에 상기 어플리케이션들의 우선순위를 더 삽입하도록 하는 시스템."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서, 상기 인스트럭션들은 상기 프로세서가,상기 컨텍스트 정보에 포함되는 망 정보에 기반하여, 상기 음성 인식 장치의 접속 환경을 식별하고, 상기 접속 환경에 기반하여, 상기 어플리케이션들의 우선순위를 결정하고, 및상기 제2 데이터에 상기 어플리케이션들의 우선순위를 더 삽입하도록 하는 시스템."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서, 상기 인스트럭션들은 상기 프로세서가,상기 망 정보에 포함되는, 상기 전자 장치가 접속된 망의 종류, 속도, 연결성(connectivity), 능력(capability), 또는 서비스 이용가능성(service availability) 중 적어도 하나에 기반하여 상기 음성 인식 장치의 접속 환경을 식별하도록 하는 시스템."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 10에 있어서, 상기 인스트럭션들은 상기 프로세서가,상기 컨텍스트 정보에 포함되는, 상기 전자 장치가 접속된 엣지 서버의 정보에 기반하여 상기 음성 인식 장치의종류를 결정하고, 상기 음성 인식 장치의 종류 및 상기 메모리에 저장된 상기 음성 인식 장치에 대한 정보에 기반하여, 상기 음성인식 장치가 지원하는 어플리케이션들의 목록을 결정하도록 하는 시스템."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 9에 있어서, 상기 인스트럭션들은 상기 프로세서가,상기 어플리케이션들의 목록을 나타내는 콘텐츠의 렌더링 정보를 생성하고, 공개특허 10-2019-0134975-5-상기 제2 데이터에 상기 렌더링 정보를 더 삽입하도록 하는 시스템."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "증강 현실(augmented reality, AR) 환경에서 전자 장치를 동작하는 방법에 있어서, 상기 전자 장치의 사용자 계정과 연관된, 외부의 음성 인식 기반 인공 지능 장치를 포함하는 이미지를 획득하는동작; 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치로 전송하는 동작; 상기 외부 전자 장치로부터 상기 인공 지능 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하는 동작; 및 상기 제2 데이터에 기반하여, 상기 목록을 포함하는 그래픽 유저 인터페이스를 상기 음성 인식 장치에 인접하거나 중첩되도록 표시하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 이미지를 획득하는 동작은, 상기 전자 장치가 사용자의 신체의 일부에 착용된 상태에서, AR 모드를 실행하는 사용하는 제1 사용자 입력을수신하는 동작; 상기 AR 모드에서, 상기 음성 인식 장치가 지원하는 적어도 하나의 어플리케이션을 실행하는 제2 사용자 입력을수신하는 동작; 및상기 제2 사용자 입력에 응답하여 상기 이미지를 획득하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 16에 있어서, 상기 제2 데이터는 상기 어플리케이션들의 우선순위를 나타내고, 상기 그래픽 유저 인터페이스를 표시하는 동작은, 상기 어플리케이션들의 명칭들을 상기 우선순위에 따라서 순서대로 표시하는 동작을 포함하는, 방법."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서, 상기 표시된 상기 그래픽 유저 인터페이스에 기반하는 사용자 발화 입력을 수신하는 동작; 상기 수신된 사용자 발화 입력을 상기 외부 전자 장치로 전송하는 동작; 상기 외부 전자 장치로부터 상기 사용자 발화 입력에 기반하는 어플리케이션 실행 화면을 수신하는 동작; 및상기 수신된 어플리케이션 실행 화면을 표시하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2019-0023751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 16에 있어서, 상기 그래픽 유저 인터페이스를 표시하는 동작은, 상기 음성 인식 장치를 호출하는 사용자 발화 입력에 응답하여 상기 어플리케이션들의 콘텐츠를 표시하는 동작공개특허 10-2019-0134975-6-을 포함하는, 방법."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는, 디스플레이, 카메라, 무선 통신 회로, 상기 디스플레이, 상기 카메라, 및 상기 무선 통신 회로와 작동적으로 연결되는 프로세서, 및 상기 프로세서와 작동적으로 연결된 메모리를 포함하고, 상기 메모리는 실행 시에, 상기 프로세서가, 상기 카메라를 통해, 상기 전자 장치의 사용자의 계정과 연관된, 외부의 음성 인식 기반 인공 지능 장치를 포함하는 이미지를 획득하고, 상기 무선 통신 회로를 통해, 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치로 전송하고, 상기 무선 통신 회로를 통해, 상기 외부 전자 장치로부터 상 기 인공 지능 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하고, 및 상기 제2 데이터에 기반하여, 상기 디스플레이를 통해, 상기 목록을 포함하는 그래픽 유저 인터페이스를 상기 음성 인식 장치에 인접하거나 중첩되도록 표시하도록 할 수 있다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는, 전자 장치에 관한 것이며, 특히 인공지능 시스템(artificial intelligence system, AI system)의 앱들 또는 스킬들의 리스트를 표시하는 증강 현실 장치 및 그 동작 방법과 관련된다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "음성 인식 기술의 발달로, 사용자는 음성을 통해 AI 스피커의 기능을 실행할 수 있다. AI 스피커는 사용자의 음 성을 분석함으로써 사용자의 의도(intent)를 결정하고, 결정된 의도에 대응하는 어플리케이션을 결정할 수 있다. AI 스피커는 결정된 어플리케이션을 실행함으로써 사용자의 의도에 따른 서비스를 음성으로 제공할 수 있 다. 예를 들어, 사용자가 “오늘 날씨 어때?”라고 말하면, AI 스피커는 사용자의 의도가 날씨 정보를 요청하는 것임을 결정할 수 있다. AI 스피커는 날씨 어플리케이션을 실행하고, 오늘 날씨를 나타내는 음성(예: “오늘 날 씨는 최고 기온 19도 입니다”)을 출력할 수 있다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "AI 스피커를, 유저 인터페이스 또는 스탠드 얼론(stand-alone)장치로서 포함하는 AI 시스템은 복수의 어플리케 이션들(또는 앱들) 또는 스킬들(skills)을 통해 사용자에게 다양한 기능들을 제공할 수 있다. AI 스피커가 디스 플레이와 같은 표시 장치를 포함하지 않거나, 디스플레이의 적은 해상도로 인해 제한된 정보만 표시하는 경우, 사용자는 AI 시스템에 프리로드되거나 사용자에 의하여 설치된 어플리케이션들의 목록 또는 기능을 식별하고 선 택하는데 어려움을 겪을 수 있다. 또한, AI 시스템이 지원하는 어플리케이션들 중 사용자가 자주 사용하거나 기 억하는 어플리케이션들만 이용될 가능성이 높으므로, 다른 어플리케이션들에 대한 활용성이 떨어질 수 있다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 디스플레이, 카메라, 무선 통신 회로, 상기 디스플레이, 상기 카메라, 및 상기 무선 통신 회로와 작동적으로 연결되는 프로세서, 및 상기 프로세서와 작동적으로 연결된 메모리를 포함하고, 상기 메모리는 실행 시에, 상기 프로세서가, 상기 카메라를 통해, 상기 전자 장치의 사용자 의 계정과 연관된, 외부의 음성 인식 기반 인공 지능 장치를 포함하는 이미지를 획득하고, 상기 무선 통신 회로 를 통해, 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치로 전송하고, 상기 무선 통신 회로를 통해, 상기 외부 전자 장치로부터 상기 인공 지능 장치를 포함하는 인공 지능 시스템에 설치된 어플리케 이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하고, 및 상기 제2 데이터에 기반하여, 상기 디 스플레이를 통해, 상기 목록을 포함하는 그래픽 유저 인터페이스를 상기 음성 인식 장치에 인접하거나 중첩되도 록 표시하도록 할 수 있다. 본 문서에 개시되는 일 실시 예에 따른 시스템은, 적어도 하나의 통신 인터페이스, 상기 통신 인터페이스와 작 동적으로 연결된 적어도 하나의 프로세서, 및 상기 프로세서와 작동적으로 연결된 적어도 하나의 메모리를 포함 하며, 상기 메모리는, 외부 음성 인식 장치에 대한 정보를 저장하며, 실행시에, 상기 프로세서가, 상기 통신 인 터페이스를 통해, 상기 외부 음성 인식 장치의 사용자 계정과 연관된 증강 현실 전자 장치로부터 이미지 및 컨 텍스트 정보를 포함하는 제1 데이터를 수신하고, 상기 이미지에 포함되는 상기 음성 인식 장치를 인식 (recognize)하고, 상기 컨텍스트 정보 및 상기 메모리에 저장된 상기 음성 인식 장치에 대한 정보에 기반하여, 상기 음성 인식 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 목록을 결정하고, 상기 통신 인 터페이스를 통해, 상기 어플리케이션들의 목록을 포함하는 제2 데이터를 상기 AR 전자 장치에게 전송하도록 할 수 있다. 본 문서에 개시되는 일 실시 예에 따른 증강 현실 환경에서 전자 장치를 동작하는 방법은, 상기 전자 장치의 사 용자 계정과 연관된, 외부의 음성 인식 기반 인공 지능 장치를 포함하는 이미지를 획득하는 동작, 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치로 전송하는 동작, 상기 외부 전자 장치로부터 상기 인공 지능 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하는 동작, 및 상기 제2 데이터에 기반하여, 상기 목록을 포함하는 그래픽 유저 인터페이스를상기 음성 인식 장치에 인접하거나 중첩되도록 표시하는 동작을 포함할 수 있다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 실시 예들에 따르면, 증강 현실 전자 장치는 AI 시스템의 어플리케이션들(또는 콘텐츠)의 목록 또는 리스트를 시각적으로 표시함으로써 사용자가 다양한 기능들을 활용할 수 있는 환경을 제공할 수 있다. 본 문서에 개시되는 실시 예들에 따르면, 전자 장치는 사용자가 음성 명령을 이용하지 않고도 AI 시스템이 지원 하는 어플리케이션 또는 기능에 관한 정보에 접근할 수 있는 환경을 제공할 수 있다. 본 문서에 개시되는 실시 예들에 따르면, 전자 장치는 사용자가 AI 시스템에 추가된 3rd 파티 어플리케이션(또는, 스킬)을 전부 기억하지 않고 쉽게 검색(look up)할 수 있는 환경을 제공함으로써, 사용성 (usability)을 향상시킬 수 있다. 본 문서에 개시되는 실시 예들에 따르면, 전자 장치는 사용자의 상황(Context)(예: 사용자의 프로파일, 위치, 시간, 애플리케이션 사용 빈도, 등록된 일정, 타 사용자의 존재 중 하나 이상)에 기반하여, AI 스피커 사용을 위해 추천되는 하나 이상의 어플리케이션을 쉽게 식별할 수 있도록 표시하고, 이를 선택할 수 있는 환경을 제공 함으로써, 사용성(usability)을 향상시킬 수 있다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은 다양한 실시 예들에 따른 네트워크 환경을 도시한다. 도 1을 참조하면, 네트워크 환경은 웨어러블 장치(101-1), 사용자 단말(101-2), 음성 인식 장치, 및 서버를 포함할 수 있다. 일 실시 예에 따르면, 음성 인식 장치는 사용자 발화(user utterance)를 수신하고, 사용자 발화에 따른 동 작(actions)을 수행하는 장치를 의미할 수 있다. 음성 인식 장치는 예를 들어 AI 스피커를 포함할 수 있다. 다른 예를 들어, 음성 인식 장치는 사용자 발화에 따라 동작을 수행할 수 있는 IoT(internet of things) 장치 또는 가전 장치 중 적어도 하나를 포함할 수 있다. 다른 예를 들어, 음성 인식 장치는 온도 조절 장치(thermostat)를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2) 중 하나 이상은 웨어러블 장치(101-1) 또 는 사용자 단말(101-2)이 이미지 센서를 통해 음성 인식 장치에 대한 이미지를 수신하는 동안에 AR 모드에 서 음성 인식 장치가 지원하는 어플리케이션들 또는 스킬들(skills)(이하, 포괄적으로 (collectively) “ 어플리케이션들” 또는 “앱들”)의 리스트를 사용자에게 시각적으로 제공하도록 구성될 수 있다. 상기 리스트 는, 예를 들어, 상기 어플리케이션들에 관련된 텍스트(text), 이미지(image), 비디오(video), 아이콘(icon), 또 는 심볼(symbol) 중 적어도 하나를 포함할 수 있되, 상기 앱들을 음성 명령으로 호출하는데 사용되는 명칭들을 포함하는 텍스트를 제공할 수 있다. 웨어러블 장치(101-1)는 헤드 마운트 디스플레이(head mounted display, HMD) 장치 또는 AR 장치를 포함할 수 있다. 사용자 단말(101-2)은 스마트폰 또는 태블릿을 포함할 수 있으며, 어떤 실시예에서는 AR 장치를 대체하여 사용될 수 있다. 일 실시 예에 따르면, 사용자 단말(101-2)은 웨어러블 장치(101-1)와 무선(BT, WiFi, 셀룰러 망)이나 유선 (USB Type-C) 통신을 이용하여 기능적으로 결합될 수 있다. 예를 들어, 사용자 단말(101-2)은 웨 어러블 장치(101-1)로부터 수신한 음성 인식 장치의 이미지를 분석하고, 음성 인식 장치와 연관된 콘 텐츠(예: 상기 리스트, 그래픽 유저 인터페이스, 알림 정보, 앱 화면 중 하나 이상)를 원거리 무선 통신 네트워 크(예: 도 4의 제2 네트워크)를 통해 서버로부터 수신하고, 수신한 콘텐츠를 음성 인식 장치의 이미지의 위치와 연관시키고, 연관된 위치 정보와 콘텐츠를 웨어러블 장치(101-1)에 전송함으로써, 웨어러블 장 치(101-1)가 콘텐츠를 디스플레이하도록 유도할 수 있다. 다른 예를 들어, 웨어러블 장치(101-1)는 사용자 단말 (101-2)로부터 수신한 음성 인식 장치의 이미지를 분석하고, 음성 인식 장치와 연관된 콘텐츠를 원거 리 무선 통신 네트워크를 통해 서버로부터 수신하고, 수신한 콘텐츠를 음성 인식 장치의 이미지의 위 치와 연관시키고, 연관된 위치 정보와 콘텐츠를 사용자 단말(101-2)에 전송함으로써, 사용자 단말(101-2)이 콘 텐츠를 디스플레이하도록 유도할 수 있다. 일 실시 예에 따르면, 사용자 단말(101-2)은 웨어러블 장치(101-1)와 물리적으로 또는 동작적으로(operatively) 결합될 수 있다. 예를 들어, 사용자 단말(101-2)이 웨어러블 장치(101-1)에 결합된 상태에서 사용자가 웨어러블 장치(101-1)를 착용하면, 사용자 단말(101-2)은 디스플레이를 통해 AR 모드에서 어플리케이션들의 콘텐츠를 사 용자에게 제공할 수 있다. 예를 들어, 사용자 단말(101-2)은 AR 모드에서 디스플레이를 통해 비디오형 증강 현 실 혹은 투과형(See-through) 증강 현실 중 하나 이상을 제공할 수 있다. 비디오형 증강 현실은 전자 장치가 카 메라를 통해 수신된 영상을 배경으로 가상 정보(예: 콘텐츠)와 합성하여 디스플레이를 통해 표시하는 방식이다.투과형 증강 현실은 디스플레이의 최소 일부가 외부의 광선을 수신하도록 투명 혹은 반투명한 재질로 구성됨으 로써, 사용자가 눈을 통해 외부를 볼 수 있으며, 전자 장치가 디스플레이에 가상 정보를 표시함으로써 사용자는 외부와 가상 정보를 모두 볼 수 있는 방식이다. 일 실시 예에 따르면, 서버는 음성 인식 장치가 지원하는 어플리케이션들의 정보를 전자 장치 (예: 웨어러블 장치(101-1) 또는 사용자 단말(101-2))에게 제공할 수 있다. 전자 장치는 서버로부터 수신된 정보에 기반하여 AR 모드에서 음성 인식 장치의 어플리케이션들의 콘텐츠를 표시할 수 있다. 일 실 시 예에 따르면, 전자 장치는 전자 장치의 메모리에 기 저장된 어플리케이션 정보 및 서버로부 터 수신된 정보에 기반하여, AR 모드에서 음성 인식 장치의 어플리케이션들의 콘텐츠들을 표시할 수 있다. 예를 들어, 전자 장치는 전자 장치에 상기 기 저장된 정보에 대응하는 콘텐츠와, 상기 수신된 정보에 대응하는 콘텐츠들을 우선순위에 따라 정렬하여 표시할 수 있다. 예를 들어, 전자 장치는 전자 장치 에 상기 기저장된 정보에 대응하는 콘텐츠들이 포함된 그룹과, 상기 수신된 정보에 대응하는 콘텐츠들이 포함된 그룹을 각각 다른 위치에 구분하여 표시하거나, 색상으로 구분하여 표시할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(101-1) 및 사용자 단말(101-2)은 원거리 무선 통신 네트워크(예: 도 4의 제2 네트워크)를 통해 서버와 통신할 수 있다. 이 경우, 웨어러블 장치(101-1) 및 사용자 단말(101- 2)와 서버 사이에 기지국(미도시) 또는 AP(access point)(미도시)가 배치될 수 있다. 다른 실시 예에 따르 면, 웨어러블 장치(101-1)가 원거리 무선 통신 네트워크를 지원하는 통신 인터페이스를 포함하지 않는 경우, 웨 어러블 장치(101-1)는 사용자 단말(101-2)을 통해 서버와 무선 통신을 수행할 수 있다. 일 실시 예에 따르면, 전자 장치는 음성 인식 장치가 포함된 이미지를 획득할 수 있다. 전자 장치 는, 상기 이미지 및 상기 전자 장치에 관련된 컨텍스트(context) 정보를 서버에게 전송할 수 있다. 컨텍스트 정보는 예를 들어, 전자 장치의 위치 정보, 상기 이미지가 획득된 시간 정보, 또는 전자 장치 의 사용자 계정 정보 중 적어도 하나를 포함할 수 있다. 서버는 수신된 이미지를 분석함으로써 음성 인식 장치를 인식(recognize)할 수 있다. 서버는 컨텍스트 정보에 기반하여 인식된 음성 인식 장치 가 지원하는 어플리케이션들의 목록을 결정하고, 결정된 어플리케이션들의 목록을 전자 장치로 전송 할 수 있다. 일 실시 예에 따르면, 외부 전자 장치(예: 음성 인식 장치, PC, TV, 타인의 스마트폰)는 전자 장치로 부터 음성 인식 장치가 포함된 이미지를 획득할 수 있다. 상기 외부 전자 장치, 상기 이미지 및 상기 전자 장치에 관련된 컨텍스트 정보를 서버에게 전송할 수 있다. 서버는 수신된 이미지를 분석함으로써 음 성 인식 장치를 인식(recognize)할 수 있다. 서버는 컨텍스트 정보에 기반하여 인식된 음성 인식 장 치가 지원하는 어플리케이션들의 목록을 결정하고, 결정된 어플리케이션들의 목록을 상기 외부 전자 장치 로 전송할 수 있다. 상기 외부 전자 장치는 상기 결정된 어플리케이션들의 목록을 전자 장치에 전송할 수 있다. 도 2는 AR 환경에서 음성 인식 장치가 지원하는 어플리케이션들의 리스트를 표시하는 동작을 나타낸 다. 도 2를 참조하면, 웨어러블 장치(101-1) 및/또는 사용자 단말(101-2)은 디스플레이(160-1, 160-2)를 포함 할 수 있다. 상기 디스플레이(160-1, 160-2)는 AR 모드를 지원할 수 있다. 예를 들어, 전자 장치의 센서 (예: 영상 센서, 근접 감지 센서, 무선 신호 감지 센서, 전자기장 센서)에 의해 음성 인식 장치 관련 정보 (예: 이미지, 위치 정보, 장치 식별자(장치명, 모델명, 무선 식별자), 또는 동작 상태)가 수신되거나, 디스플레 이(160-1, 160-2)를 통해 음성 인식 장치가 표시되는 동안에, 웨어러블 장치(101-1) 또는 사용자 단말 (101-2)은 음성 인식 장치가 지원하는 어플리케이션들(예: 1, 2,..., 16)에 관한 정보(특히, 음성으로 호 출하는데 사용되는 명칭)를 디스플레이(160-1, 160-2)의 일부 영역 상에 표시할 수 있다. 도시된 실시 예에 따르면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 디스플레이(160-1, 160-2) 상에서 음성 인식 장치의 주변 영역 상에 어플리케이션들의 리스트를 표시할 수 있다. 다른 실시 예에 따르면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 음성 인식 장치와 적어도 일부가 중첩되는 영역 상에 어 플리케이션들의 리스트를 표시할 수도 있다. 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 디스플레이(160- 1, 160-2)를 통해 어플리케이션들의 리스트를 시각적으로 표시함으로써 사용자가 음성 인식 장치를 통해 활용할 수 있는 앱들을 확인(check)하고, 용이하게 음성 명령 수행할 수 있는 환경을 제공할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 음성 인식 장치를 호출하는 사용 자 발화(예: “Hi, Bixby”)에 응답하여 어플리케이션들의 리스트를 표시할 수 있다. 일 실시 예에 따르면, 음성 명령 수행을 준비하는 시동어는 음성 인식 장치마다 다를 수 있다. 예를 들어, 음성 인식 장치의 제조사, 제품 모델, 혹은 사용자 지정에 의해 서로 다를 수 있다. 시동어(wake-up utterance)가 사 용자에 의해 발화되면, 전자 장치은 상기 시동어를 수신하고, 상기 시동어에 대응하는 음성 인식 장치 를 결정하고, 결정된 음성 인식 장치 에 대응하는 어플리케이션들의 콘텐츠를 선택하고, 선택된 콘텐 츠들을 전자 장치의 디스플레이에 표시할 수 있다. 일 실시 예에 따르면, 상기 선택된 콘텐츠의 표시 동작은, 상기 결정된 음성 인식 장치의 이미지가 전자 장치에 제1 시간(예: 0.5초) 이상 수신될 때, 수신된 음성 인식 장치의 이미지의 위치를 기반으로 선 택된 콘텐츠를 디스플레이에 표시하는 동작을 포함할 수 있다. 추가하여, 상기 선택된 콘텐츠의 표시 동작의 종 료를 위해, 상기 결정된 음성 인식 장치의 이미지가 전자 장치에 제2 시간(예: 10초) 이상 수신되거 나, 상기 결정된 음성 인식 장치의 이미지가 전자 장치에 제3 시간(예: 1초) 이상 수신되지 않을 때, 선택된 콘텐츠의 표시 동작을 종료할 수도 있다. 일 실시 예에 따르면, 상기 선택된 콘텐츠의 표시 동작에서, 상기 결정된 음성 인식 장치의 이미지가 전자 장치에 수신되지 않는 경우, 전자 장치는 선택된 콘텐츠를 디스플레이에 표시하기 위한 제1 파라미터 를 설정할 수 있다. 상기 결정된 음성 인식 장치의 이미지가 전자 장치에 수신되는 경우, 전자 장치 는 상기 선별된 콘텐츠를 상기 결정된 음성 인식 장치의 이미지와 연관지어 제2 파라미터를 설정할 수도 있다. 제1 파라미터와 제2 파라미터는 선택된 콘텐츠를 표시하기 위한 디스플레이상의 위치, 크기, 색상, 투명도, 오브젝트 매칭 여부, 투영(projection) 중 적어도 하나 이상의 속성들을 포함할 수 있다. 제1 파라미터 와 제2 파라미터의 속성들은 적어도 하나 이상 서로 다르게 지정될 수 있다. 예를 들어, 제1 파라미터 설정에 의해, 선택된 콘텐츠는 디스플레이 제1 영역(예: 하단)에 제1 크기, 제1 반투명도가 적용되어, 물체에 매칭하지 않고 고정되어 표시될 수 있다. 예를 들어, 제2 파라미터 설정에 의해, 선택된 콘텐츠는 상기 결정된 음성 인식 장치의 위치와 관련되어 디스플레이에 표시되며, 디스플레이상의 위치나 크기, 반투명도 중 하나 이상이 제1 파라미터의 속성과 다르게 설정될 수도 있다. 다른 예로, 제1 파라미터와 제2 파라미터에 포함되는 세부 속 성들 중 최소 2개 이상 복수 개가 다르게 설정될 수 있다. 이에 따르면, 상기 선택된 콘텐츠의 표시 동작에서, 상기 결정된 음성 인식 장치의 이미지가 전자 장치에 수신되지 않는 경우에서 수신되는 경우로 변화 하거나, 그 반대로 변화하는 경우, 상기 선별된 콘텐츠의 표시 방법이 변화하게 될 수 있다. 상기 변화 과정에 서 선별된 콘텐츠를 표시하는 속성들이 달라지므로, 각 속성들의 변화량을 점차적으로 변화(예: 움직임, 크기, 색상, 투명도 변화량을 인터폴레이션 기법으로 계산하여 적용) 시킴으로써 애니메이션 효과를 부가하여, 급격한 변화에 따른 사용자의 인지적 혼란을 줄이거나 최소화할 수 있다.일 실시 예에서는, 어플리케이션을 추천하는 메뉴(예: 111-1, 111-2)를 선택하는 사용자 입력이 수신되면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 사용자에게 어플리케이션을 추천할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(101-1) 또는 사용자 단말 (101-2)의 프로세서는 어플리케이션들의 우선순위를 나타내는 데이터를 계산하거나, 서버로부터 수신 하고, 계산하거나 수신된 데이터, 혹은 상기 두 가지 데이터에 기반하여 어플리케이션을 사용자에게 추천할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 다른 어플리케이션들의 목록을 확인하 기 위한 메뉴(예: 112-1, 112-2) 또는 사용 방법을 사용자에게 설명하기 위한 메뉴(예: 113-1, 113-2)를 더 표 시할 수 있다."}
{"patent_id": "10-2019-0023751", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 3은 일 실시예에 따른 웨어러블 장치(101-1)의 블록도를 도시한다. 도 3을 참조하면, 웨어러블 장치(101- 1)는 버스(bus)를 통해 작동적으로 연결되는 카메라, 프로세서, 메모리, 센서, 디스 플레이(예: 도 2의 디스플레이(160-1)), 및 무선 통신 회로를 포함할 수 있다. 일 실시 예에 따르면, 웨어 러블 장치(101-1)는 도 3에 도시된 구성들 중 적어도 일부를 생략할 수도 있고, 도 3에 도시되지 않은 구성요소 (예: 도 4의 전자 장치의 구성요소)를 적어도 하나 더 포함할 수 있다. 일 실시 예에 따르면, 카메라는 웨어러블 장치(101-1)의 전면에 배치될 수 있다. 웨어러블 장치(101-1)가 사용자에 의하여 착용된 상태에서, 카메라는 사용자가 응시하거나 사용자 머리가 지향하는 방향과 유사하 거나 근접한 방향에 위치하는 객체의 이미지를 획득할 수 있다. 예를 들어, 카메라는 디스플레이가 정보를 표시하는 반대 방향에 위치하거나, 사용자가 착용한 HMD의 머리 지향 방향에 위치하거나, 혹은 사용자의 시선 추적 센서 정보에 기반하여, 시선 방향에 대응하는 영상을 촬영할 수 있다. 일 실시 예에 따르면, 센서는 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이는 AR 기능을 지원하기 위하여 씨스루(see-through) 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 도 4의 전자 장치의 무선 통신 모듈과 동일하거나 적어 도 일부가 유사한 기능을 수행할 수 있다. 무선 통신 회로는 근거리 무선 통신 네트워크 또는 원거리 무선 통신 네트워크를 지원할 수 있다. 일 실시 예에 따르면, 웨어러블 장치(101-1)의 무게를 줄이기 위하여, 무선 통신 회로는 근거리 무선 통신 네트워크만을 지원할 수도 있다. 일 실시 예에 따르면, 프로세서는 어플리케이션들의 콘텐츠를 표시하기 위한 웨어러블 장치(101-1)의 전반 적인 기능들을 수행할 수 있다. 프로세서는 메모리에 저장된 인스트럭션들(instructions)을 실행함으 로써 기능들을 수행할 수 있다. 도 4는 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 4를 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 장치, 음향 출력 장치, 표시 장치, 오디오 모듈, 센서 모듈, 인터페이스, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 표시 장치 또는 카메라 모듈)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들은 하나의 통합된 회로로 구현될 수 있다. 예를 들면, 센서 모듈(예: 지문 센서, 홍채 센서, 또는 조도 센서)은 표시 장치(예: 디스플레이)에 임베디드된 채 구 현될 수 있다 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)을 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 로드하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서), 및 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 추가적으 로 또는 대체적으로, 보조 프로세서은 메인 프로세서보다 저전력을 사용하거나, 또는 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 표시 장치, 센서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성 요 소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서모듈)에 의해 사용 되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발 성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 장치는, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 장치은, 예를 들면, 마이크, 마우스, 키보드, 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 장치는 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 장치는, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있고, 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 표시 장치는 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 표시 장치은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 표시 장치는 터치를 감지하도록 설정된 터치 회로(touch circuitry), 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 센서 회로(예: 압력 센서)를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 장치를 통해 소리를 획득하거나, 음향 출력 장치, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치) (예: 스피커 또는 헤드폰))를 통 해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치이 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자은, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있 다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모 듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력 선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi direct 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)으로 통합되거 나, 또는 서로 별도의 복수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식 별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또 는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 및 인증할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 하나의 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되 는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로 부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부 전 자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC)이 추가로 안테나 모듈의 일부로 형성될 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 전자 장치(402, 404) 각각은 전자 장치와 동일한 또 는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부 전자 장치들(402, 404, or 408) 중 하나 이상의 외부 장치들에서 실행될 수 있다. 예를 들면, 전자 장치 가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외 부 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예 를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 일 실시 예에 따르면, 전자 장치는 도 2의 사용자 단말(101-2) 또는 도 1의 전자 장치에 대응하고, 서버는 도 1의 서버에 대응할 수 있다. 일 실시 예에 따르면, 프로세서는 어플리케이션들의 콘텐츠를 표시하기 위한 전자 장치의 전반적인 기능들을 수행할 수 있다. 프로세서는 메모리에 저장된 인스트럭션들(instructions)을 실행함으로써 기능들을 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 무선 통신 모듈을 통해 전자 장치의 위치 정보를 획득할 수 있다. 예를 들어, 프로세서는 GPS(global positioning system), A-GPS(advanced GPS), GNSS(global navigation satellite system), 셀 식별자(cell identifier, cell ID), UWB(ultra wide band), LiFi(light fidelity), 블루투스, 뎁스(depth) 센서, 초음파(ultrasound) 센서, 지오-펜스(geo-fence), 셀룰러(cellular), 또는 Wi-Fi 중 적어도 하나에 기반하여 웨어러블 장치(101-2)의 위치 정보를 획득할 수 있다. 다른 예를 들어, 프로세서는 전자 장치가 접속된 망의 망 정보에 기반하여 전자 장치의 위치 정보를 획득할 수 있다. 망 정보는 예를 들어, 망의 종류, 속도, 연결성(connectivity), 능력(capability), 서비스 이용가능성 (service availability), 또는 전자 장치가 접속된 엣지 서버의 정보 중 적어도 하나를 포함할 수 있다. 엣지 서버는 MEC(Multi-access Edge Computing 또는 Mobile Edge Computing), 포그(Fog) 컴퓨팅 기능을 지원하 는 서버일 수 있다. 일 실시 예에 따르면, 프로세서는 카메라 모듈을 통해 음성 인식 장치가 포함되는 이미지를 획 득할 수 있다. 프로세서는 무선 통신 모듈을 통해 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치(예: 서버)로 전송할 수 있다. 일 실시 예에 따르면, 프로세서는 무선 통신 모듈을 통해 어플리케이션들의 목록을 포함하는 제2 데 이터를 수신할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 데이터에 기반하여, 표시 장치를 통해 음성 인식 장치가 지원할 수 있는 어플리케이션들의 콘텐츠를 표시할 수 있다. 도 5는 다양한 실시 예들에 따른 서버의 블록도를 도시한다. 도 5를 참조하면, 서버는 프로세서, 무선 통신 회로 및 메모리를 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 전자 장치(예: 웨어러블 장치(101-1) 또는 사용자 단말(101- 2))과 무선 통신을 수행하도록 구성될 수 있다. 일 실시 예에 따르면, 프로세서는 무선 통신 회로 및 메모리와 작동적으로 연결될 수 있다. 프 로세서는 메모리에 저장된 서비스 모듈을 실행함으로써, 음성 인식 장치가 지원하는 어플 리케이션들의 목록을 결정하는 서버의 전반적인 기능을 수행할 수 있다. 일 실시 예에 따르면, 메모리는 서비스 모듈을 포함할 수 있다. 서비스 모듈은 프로세서에 의하여 실행되는 인스트럭션들(instructions)의 집합(set)일 수 있다. 서비스 모듈은 이미지 처리 모듈 , 머신 러닝 라이브러리(machine learning library), AR 어플리케이션, 렌더링(rendering) 모 듈, 컨텍스트(context) 데이터 베이스(database, DB), 및 사용자 계정 DB를 포함할 수 있다. 일 실시 예에 따르면, 이미지 처리 모듈은 이미지에 포함되는 피사체(예: 음성 인식 장치)를 인식하 기 위한 구성요소들을 포함할 수 있다. 이미지 처리 모듈은 특징점 추출(feature point extraction) 모듈 , 스케일 추정(scale estimation) 모듈, 세그먼테이션(segmentation) 모듈, 및 표면 감지 (surface detection) 모듈을 포함할 수 있다. 특징점 추출 모듈은 이미지에 포함되는 피사체의 특징 점을 추출할 수 있다. 스케일 추정 모듈은 깊이(depth) 정보 또는 길이(length) 정보를 분석함으로써 피사 체의 양 또는 부피를 결정할 수 있다. 세그먼테이션 모듈은 이미지로부터 피사체를 배경과 분리할 수 있다. 표면 감지 모듈은 평면, 곡면, 거리, 또는 질감 중 적어도 하나를 분석함으로써 피사체를 인식하거 나 표면 위에 표시하기 정보를 산출할 수 있다. 일 실시 예에 따르면, 이미지 처리 모듈은 이미지 처리와 관련된 정보를 외부 서버로부터 수신하기 위한 AIR(advanced image recognition) 프레임워크(framework)를 포함할 수 있다. AIR 프레임워크는 객체 감지(object detection) 모듈, 객체 트래킹(object tracking) 모듈, 및 객체 인식(object recognition) 모듈을 포함할 수 있다. 객체 감지 모듈은 세그먼테이션 모듈을 통해 분리된 피사 체를 식별(identify)하고, 관심 영역(region of interest, ROI)를 추출할 수 있다. 객체 트래킹 모듈은 카메라(예: 320)의 프리뷰(preview)를 통해 계속적으로 들어오는 이미지의 특징점, 피사체, 또는 ROI 중 적어도 하나를 트래킹 하거나, 지정된 표식(marker)을 트래킹 할 수 있다. 객체 인식 모듈은 피사체의 1차 카테고 리(category)를 식별할 수 있다. 1차 카테고리는 예를 들어, 피사체의 종류(예: 음식, 책, 전자 장치, 꽃, 자동 차, 사람)를 포함할 수 있다. 객체 인식 모듈은 외부 서버로부터 피사체의 2차 카테고리(예: 음식의 종류, 전자 장치의 종류) 또는 피사체와 관련된 정보(예: 음식의 칼로리, 영양 성분, 또는 모델 명칭)를 수신할 수 있다. 예를 들어, 음성 인식 장치의 1차 카테고리는 전자 장치이고, 2차 카테고리는 AI 스피커이며, 관 련된 정보는 AI 스피커의 모델 명칭을 포함할 수 있다. 일 실시 예에 따르면, 서버(또는 전자 장치)는 머신 러닝을 통해 이미지 처리를 수행하기 위하여 머 신 러닝 라이브러리를 포함할 수 있다. 일 실시 예에 따르면, AR 어플리케이션은 음성 인식 장치가 지원하는 어플리케이션들을 실행하고, 웨 어러블 장치(101-1) 또는 사용자 단말(101-2)을 통해 AR 모드에서 콘텐츠를 시각적으로 표시하기 위한 기능을 수행할 수 있다. AR 어플리케이션은 서비스 실행(executor service) 모듈, 고유 모드 에이전트 (native mode agent), 플러그드인(plugged-in) 에이전트, 및 모드 매니저, APP 매니저, 및 APP DB를 포함할 수 있다. 서비스 실행 모듈은 어플리케이션을 실행할 수 있다. 고유 모드 에이전 트는 음성 인식 장치에 기 설치된 어플리케이션들을 관리할 수 있다. 플러그드인 에이전트는 별 도로 사용자나 시스템에 의해 추가 설치되는 어플리케이션(예: 3rd 파티(party) 어플리케이션)의 설치, 삭제, 실 행의 제어 및 상태 정보, 어플리케이션 식별자 정보 중 하나 이상을 관리할 수 있다. 모드 매니저는 플러 그드인 에이전트에서 이용 가능한 기능들의 권한을 관리할 수 있다. APP DB는 어플리케이션들에 관한 정보를 저장할 수 있다. APP 매니저는 고유 모드 혹은 플러그드인 모드 중 실행 가능한 어플리케이션을 관 리할 수 있다. APP 매니저는 지능형(status intelligent) 에이전트 및 계정 에이전트를 포함할수 있다. 지능형 에이전트는 센서, 메모리, 또는 사용자 프로파일(profile)에 저장된 데이터에 기반하여 어플리케이션의 시작 시점 및 상태 값을 설정할 수 있다. 계정 에이전트는 사용자 사용 이력 또는 사용자 스케줄을 관리할 수 있다. 일 실시 예에 따르면, 렌더링 모듈은 어플리케이션의 실행 화면 또는 어플리케이션들의 콘텐츠를 렌더링 하기 위한 정보를 생성 및 저장할 수 있다. 일 실시 예에 따르면, 사용자 계정 DB는 전자 장치 또는 음성 인식 장치에 등록된 사용자 계정 정보를 하나 이상 저장할 수 있다. 사용자 계정 정보는 예를 들어, 식별 정보(사용자, 사용자의 전자 장치, 음 성 인식 장치, 또는 애플리케이션 중 하나 이상), 사용 이력, 사용자 선택에 의하여 설정된 선호도 (preference), 또는 사용자 스케줄 중 적어도 하나를 포함할 수 있다. 사용자 계정 정보 DB에 저장된 정보 는 어플리케이션들의 카테고리, 개수, 또는 우선순위 중 적어도 하나를 결정하기 위하여 이용될 수 있다. 예를 들어, 사용자 계정은, 음성 인식 장치와 기능적으로 연결된 외부 서버(예: 음성 인식 장치 제조사의 서 버)와 연관될 수 있다. 이러한 경우, 전자 장치은 상기 사용자 계정을 이용하여 상기 외부 서버에 접속함 으로써, 상기 음성 인식 장치에서 제공하는 스킬이나 어플리케이션을 사용자가 조회하거나, 사용할 수 있 도록 선택하고, 관리하는 기능을 이용할 수 있게 할 수 있다. 예를 들어, 사용자 계정은, 전자 장치와 기 능적으로 연결된 외부 서버(미도시)에 포함된 서비스 모듈을 사용하기 위하여 연관된 사용자 계정일 수도 있다. 또 다른 예로, 전자 장치의 사용자 계정 DB에 포함된 복수 개의 사용자 계정은, 전자 장치 가 각각 다른 외부 서버들에 포함된 음성 인식 장치 관리 기능 및 서비스 모듈을 사용하기 위하여 연 관된 정보일 수 있다. 이러한 경우, 전자 장치는 서비스 모듈이 포함된 서버 전용 제1 사용자 계정을 통해 서버에 접속 허가를 받고, 서버를 이용하여 음성 인식 장치를 식별하여 전자 장치 에 식별된 음성 인식 장치 정보를 수신하고, 수신된 음성 인식 장치에 대응하는 제2 사용자 계정을 이용하여, 음성 인식 장치 관리 기능을 제공하는 외부 서버에 접속하여, 수신된 음성 인식 장치의 기능을 제어할 수 있다. 일 실시 예에 따르면, 어플리케이션의 카테고리는 스킬이나 어플리케이션의 종류(예: 음악 스트리밍, 결제 서비 스, 음식 추천 서비스, 네비게이션 서비스, 날씨/교통 정보 서비스 등), 어플리케이션의 상태(예: 사용 가능토 록 활성화되었는지 여부, 사용자별 선호도, 사용자별로 표시될 수 있는 어플리케이션 리스트, 어플리케이션의 사용을 위한 인증의 필요 여부, 어플리케이션의 개인정보 활용 여부, 어플리케이션의 사용 장소 등) 중 하나 이 상에 기반하여 어플리케이션들을 분류하거나 그룹핑하기 위한 정보일 수 있다. 예를 들어, 복수 개의 음악 재생 어플리케이션은 음악 재생 어플리케이션 카테고리에 포함되며, 상기 음악 재생 어플리케이션 카테고리에 속하는 어플리케이션들은 사용자의 선호도에 따라 우선순위가 정해질 수도 있다. 예를 들어, 하나의 어플리케이션의 카 테고리에 속하는 어플리케이션들은 하위 카테고리별로 분류되거나 그룹핑될 수도 있다. 일 실시 예에 따르면, 컨텍스트 DB는 어플리케이션들의 목록에 포함되는 어플리케이션들의 카테고리, 개수, 또는 우선순위 중 적어도 하나를 결정하기 위하여 이용되는 정보를 저장할 수 있다. 예를 들어, 컨텍스트 DB는 전자 장치로부터 수신된 컨텍스트 정보를 저장할 수 있다. 다른 예를 들어, 컨텍스트 DB는 음성 인식 장치에 관한 정보를 저장할 수 있다. 음성 인식 장치에 관한 정보는 예를 들어, 음성 인식 장치의 1차 카테고리, 2차 카테고리, 모델 명칭, 능력(capability), 사용 이력, 음성 인식 장치가 접 속된 망의 망 정보, 또는 음성 인식 장치가 접속된 엣지 서버의 정보 중 적어도 하나를 포함할 수 있다. 도 5는 서버가 서비스 모듈을 포함하는 실시 예를 예시하지만, 다른 실시 예에 따르면, 서비스 모듈 은 사용자 단말(101-2)에 포함될 수 있다. 이 경우, 도 2에서 사용자 단말(101-2)은 서버의 기능을 대체할 수 있다. 또 다른 실시 예에 따르면, 서비스 모듈은 사용자 단말(101-2)과 서버에 모두 포함 될 수 있다. 이 경우, 두 장치의 서비스 모듈들은 서로 정보를 분산 처리하거나, 상호 보완할 수도 있다. 도 6은 다양한 실시 예들에 따라 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표시하기 위한 모 듈의 동작 흐름도를 도시한다. 도 6을 참조하면, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 카메라(320, 480)를 이용하여 음성 인식 장 치에 대한 이미지를 획득할 수 있다. 웨어러블 장치(101-1) 또는 사용자 단말(101-2)은 획득된 이미지와 컨텍스트 정보를 포함하는 제1 데이터를 서버에 포함된 서비스 모듈로 전송할 수 있다. 다른 예를 들 어, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)이 서비스 모듈을 포함하는 경우, 전자 장치 은서비스 모듈을 이용하여 이미지를 직접 처리할 수 있다. 또 다른 예를 들어, 전자 장치은 제1 서비스 모듈(510-1)을 포함하고, 서버는 제2 서비스 모듈(510-2)를 포함하는 경우, 전자 장치는 서버와 유무선 통신회로를 통해 정보를 교환함으로써, 제1 서비스 모듈(510-1)에서 처리한 결과와, 제2 서비스 모듈 (510-2)에서 처리한 결과을 기반으로 이미지를 처리할 수 있다. 예를 들어, 제1 서비스 모듈(510-1)에서 상기 처리를 실패한 경우, 제2 서비스 모듈(510-2)에서 처리할 수 있다. 예를 들어, 제1 서비스 모듈(510-1)과 제2 서비스 모듈(510-2)에서 분산 처리할 수도 있다. 일 실시 예에 따르면, 서버는 이미지 처리 모듈을 이용하여 이미지를 분석할 수 있다. 특징점 추출 모듈 및 객체 인식 모듈이 외부 서버에 포함되는 경우, 서버는 외부 서버와 이미지 데이터(예: 이미지 파일, 이미지 비트 스트림, 카메라 센서가 수신한 로우(raw) 데이터)을 공유함으로써 이미지 를 분석할 수 있다. 이미지 분석에 기반하여, 서버는 이미지에 포함된 피사체(또는 객체)가 AI 스피커임을 인식할 수 있다. 예를 들어, 서버는 이미지에 포함된 피사체의 1차 카테고리가 전자 장치이고, 2차 카테고 리가 AI 스피커이고, 모델 명칭이 “xxxx”임을 인식할 수 있다. 일 실시 예에 따르면, 서버는 컨텍스트 정보에 기반하여 음성 인식 장치가 지원하는 어플리케이션들 을 APP DB로부터 선택할 수 있다. 예를 들어, 서버는 위치 정보에 기반하여 음성 인식 장치의 종류를 결정하고, 결정된 종류에 대응하는 어플리케이션들을 APP DB로부터 선택할 수 있다. 다른 예를 들 어, 서버는 컨텍스트 정보에 포함된 웨어러블 장치(101-1) 또는 사용자 단말(101-2)의 사용자 계정 정보를 기반으로 음성 인식 장치의 사용자 계정 정보를 식별하고, 식별된 사용자 계정 정보에 대응하는 어플리케 이션들을 선택할 수 있다. 일 실시 예에 따르면, 서버는 컨텍스트 DB 또는 사용자 계정 DB에 저장된 정보를 이용하여 어플 리케이션들의 종류, 개수, 또는 우선순위 중 적어도 하나를 결정할 수 있다. 예를 들어, 음성 인식 장치가 배치된 위치가 사용자의 집이고, 시간이 저녁 식사 시간이면, 서버는 음식 배달 어플리케이션들을 우선적 으로 선택하고, 사용 빈도에 따라 배열 순서를 결정할 수 있다. 다른 예를 들어, 음성 인식 장치가 배치된 위치가 사용자의 집이고, 시간이 오전 시간이면, 서버는 사용자의 프로파일에 따라 해당 조건에서 자주 사 용하는 날씨 어플리케이션 또는 뉴스 어플리케이션을 우선적으로 선택할 수 있다. 다른 예를 들어, 음성 인식 장치가 배치된 위치가 사무실이면, 서버는 사용자가 사무실에서 자주 사용하는 회의(meeting) 어플리 케이션을 우선적으로 선택할 수 있다. 다른 예를 들어, 음성 인식 장치가 오프라인 매장에 전시된 제품이 면, 서버는 공공장소라는 위치의 속성에 기반하여 개인정보와 관련없이, 기지정된 어플리케이션들(예: 데 모 버전 어플리케이션)만을 선택할 수 있다. 다른 예를 들어, 음성 인식 장치가 배치된 장소의 위치, 사용 자 식별자, 혹은 전자 장치의 종류에 기반하여, 각각 다른 개수의 애플리케이션을 디스플레이에 표시하기 위해 우선적으로 선택할 수 있다. 일 실시 예에 따르면, 서버는 AR 어플리케이션을 이용하여 음성 인식 장치가 지원하는 어플리케 이션들을 실행하고, 웨어러블 장치(101-1) 또는 사용자 단말(101-2)을 통해 AR 모드에서 콘텐츠를 시각적으로 표시하기 위한 기능을 수행할 수 있다. 도 7a는 다양한 실시 예들에 따라 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표시하기 위한 동작 흐름도를 도시한다. 도 7a를 참조하면, 전자 장치는 웨어러블 장치(101-1) 또는 웨어러블 장치(101-1)에 결합된 사용자 단말 (101-2)을 의미할 수 있다. 동작 705에서, 전자 장치는 이미지를 획득할 수 있다. 일 실시 예에 따르면, 이미지는 스틸 이미지(still image) 또는 동영상 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 전자 장치는 지정된 조건에 기반하 여 이미지를 획득할 수 있다. 예를 들어, 전자 장치(예: 웨어러블 장치(101-1))가 사용자의 신체의 일부에 착용된 상태에서 사용자 가 음성 인식 장치를 응시하면, 전자 장치는 전자 장치의 움직임이 감지되지 않음을 결정 할 수 있다. 전자 장치는 지정된 임계 시간 동안에 움직임이 감지되지 않으면 카메라(예: 도 3의 320)를 통해 사용자가 응시하는 방향의 이미지를 획득할 수 있다. 다른 예를 들어, 카메라를 통해 획득되는 프리뷰(preview) 이미지들의 변화량 또는 움직임이 지정된 임계 값 미 만이면, 전자 장치는 이미지를 획득할 수 있다. 다른 예를 들어, 전자 장치가 눈 감지(eye detection) 모듈을 포함하는 경우, 전자 장치는 사용자가 응시하고 있는 방향을 감지하고, 감지된 방향의 이미지를 획득할 수 있다. 다른 예를 들어, 전자 장치는 이미지 획득을 위한 별도의 사용자 발화 또는 사용자 입력 중 적어도 하나에 기반하여 이미지를 획득할 수 있다. 사용자 입력은 예를 들어, 카메라 또는 센서에 의하여 감지되는 제스처나 손가락 포인팅 중 적어도 하나를 포함할 수 있다. 다른 예를 들어, 사용자 단말(101-2)이 웨어러블 장치(101-1)에 결합된 채로 웨어러블 장치(101-1)가 사용자의 신체의 일부에 착용된 경우, 사용자 단말(101-2)은 AR 모드를 트리거링(triggering)하고, AR 모드에서 음성 인 식 장치에 저장된 어플리케이션의 실행과 연관된 이벤트를 감지할 수 있다. 어플리케이션의 실행과 연관된 이벤트는, 어플리케이션을 실행하는 사용자 입력의 수신, 전화 수신, 메시지 수신, 알람 이벤트 발생, 스케줄 이벤트 발생, 무선 통신(예: Wi-Fi)의 연결이나 끊김, 배터리 잔량이 임계 값 미만인 경우, 데이터 사용 권한 (permission) 또는 제한(restriction) 발생, 어플리케이션 응답이 없는 경우, 또는 비정상적인 어플리케이션 종 료 중 적어도 하나에 기반하여 이미지를 획득할 수 있다. 동작 710에서, 전자 장치는 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 서버로 전송할 수 있 다. 컨텍스트 정보는 예를 들어, 전자 장치의 위치 정보, 이미지가 획득된 시간 정보, 또는 전자 장치 의 사용자 계정 정보 중 적어도 하나를 포함할 수 있다. 동작 715에서, 서버는 제1 데이터에 기반하여 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정할 수 있다. 예를 들어, 서버는 제1 데이터에 포함된 이미지를 분석함으로써 이미지에 포함된 피사체 가 음성 인식 장치임을 인식할 수 있다. 서버는 제1 데이터에 포함된 컨텍스트 정보에 기반하여 인식 된 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정할 수 있다. 동작 720에서, 서버는 어플리케이션들의 목록을 포함하는 제2 데이터를 전자 장치에게 전송할 수 있 다. 동작 725에서, 전자 장치는 수신된 제2 데이터에 기반하여, 음성 인식 장치가 지원하는 어플리케이션 들의 콘텐츠를 디스플레이(예: 도 2의 160-1, 160-2)를 통해 AR 모드에서 표시할 수 있다. 예를 들어, 전자 장 치는 어플리케이션들의 콘텐츠를 2차원(2-dimension, 2D) 콘텐츠에서 사용자의 왼쪽 눈과 오른쪽 눈에 대 응하는 3차원(3D) 콘텐츠로 변환하고, 변환된 콘텐츠를 AR 모드에서 표시할 수 있다. 일 실시 예에 따르면, 전 자 장치는 사용자 발화 없이 어플리케이션들의 콘텐츠를 표시할 수도 있고, 음성 인식 장치를 호출하 는 사용자 발화(예: “Hi, Bixby”)에 응답하여 어플리케이션들의 콘텐츠를 표시할 수도 있다. 도 7b는 다양한 실시 예들에 따라 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표시하기 위한 다른 동작 흐름도를 도시한다. 도 7b는 웨어러블 장치(101-1)와 서버 간 데이터를 전송하는 동작 흐 름도를 도시하지만, 다른 실시 예에 따르면, 동작 흐름도은 웨어러블 장치(101-1)와 사용자 단말(101-2) 간, 또는 사용자 단말(101-2)과 서버 간 데이터 전송에 적용될 수 있다. 도 7b를 참조하면, 동작 762에서, 전자 장치는 이미지 또는 비디오를 획득할 수 있다. 이미지 또는 비디오 는 예를 들어, 음성 인식 장치에 대한 이미지를 포함할 수 있다. 전자 장치는 이미지 또는 비디오와 함께 전자 장치의 위치 정보를 획득할 수 있다. 위치 정보는 예를 들어, GPS, A-GPS, GNSS, cell ID, UWB, LiFi, 블루투스, 뎁스(depth) 센서, 초음파 센서, 지오-펜스, 셀룰러, 또는 Wi-Fi 중 적어도 하나에 기반 하여 획득될 수 있다. 동작 764에서, 전자 장치는 이미지 데이터(또는 비디오 데이터) 및 위치 정보를 포함하는 제1 데이터를 서 버로 전송할 수 있다. 동작 766에서, 서버는 이미지 데이터를 이용하여 이미지를 분석하고, 분석 결과에 기반하여 이미지에 포함 된 객체를 인식(recognize)할 수 있다. 예를 들어, 서버는 도 5의 이미지 처리 모듈을 통해 이미지를 분석할 수 있다. 동작 768에서, 서버는 인식된 객체가 사용자(예: 도 7a의 사용자)의 음성 인식 장치임을 결정할 수 있다. 동작 770에서, 서버는 인식된 음성 인식 장치에 대한 사용자 계정 DB(예: 도 5의 560)를 이용하여 음 성 인식 장치에 대한 제1 어플리케이션을 선택할 수 있다. 예를 들어, 음성 인식 장치가 특정 제조사 의 인공지능 스피커(AI Speaker)인 경우, 해당 인공지능 스피커의 서비스를 사용하기 위한 사용자 계정(예: 해 당 제품 혹은 제조사의 서비스를 제공받기 위한 가입자 계정)을 결정하고, 결정된 사용자 계정에 연관된 제1 어 플리케이션을 선택할 수 있다. 예를 들어, 제1 어플리케이션은 하나 이상의 스킬이나 제2 어플리케이션(예: 두 7b 102에 인접한 App1,2,…, 16과 관련)을 관리, 또는 전자 장치의 디스플레이에 표시와 관련한 기능 중 하나 이상을 제공할 수 있다. 이를 위해, 제1 어플리케이션은 상기 스킬이나 제2 어플리케이션의 사용 가능 여 부 결정, 추천, 등록, 업데이트, 사용자 선호도, 목록 관리, 선호도, 또는 우선 순위 처리 중 하나 이상과 관련 한 기능을 제공할 수 있다. 동작 772에서, 서버는 선택된 제1 어플리케이션과 연관된스킬(skill) 목록 또는 제2 어플리케이션들의 목 록을 결정(look up)할 수 있다. 스킬은 제2 어플리케이션에 대응하는 기능을 수행하기 위한 최소 일부를 포함하 는 소프트웨어 모듈이나 특정 정보(예: 사용자나 장치 식별자, 위치 정보, 가격, 매뉴얼, 가이드, 광고, 데모 콘텐츠)를 포함할 수 있다. 한 실시 예에 따르면, 서버가 스킬 목록이나 제2 어플리케이션의 목록을 결정 할 때, 서버는 각각의 스킬이나 제2 어플리케이션들의 사용 가능 여부, 추천 여부, 사용자 선택 여부, 혹 은 이들의 조합에 기반하여 결정할 수 있다. 예를 들어, 제1 어플리케이션에 연관된 복수 개의 스킬이나, 제2 어플리케이션들 중에서 사용자가 사용 가능토록 선택(혹은 설정)된 하나 이상의 스킬이나, 또는 제2 어플리케이 션만 목록에 포함될 수 있다. 예를 들어, 상기 제조사에서 기본(default)로 사용토록 지정한 기본 스킬이나 제2 어플리케이션은 목록에 포함될 수 있다. 예를 들어, 상기 제조사나 사용자가 사용 가능토록 지정한 하나 이상의 스킬이나 제2 어플리케이션은 제1 목록에 포함되고, 사용 가능토록 지정되지 않은 스킬이나 제2 어플리케이션들 은 제2 목록에 포함될 수 있다. 이러한 경우, 제1 목록은 전자 장치에 우선적으로 표시되고, 제2 목록은 전자 장치를 통해 사용자 입력에 의해 표시되어, 이중에서 선택된 스킬이나 제2 어플리케이션은 제1 목록 으로 옮겨질 수도 있다.동작 774에서, 서버는 결정된 목록에 대한 콘텐츠를 생성할 수 있다. 콘텐츠는 예 를 들어, 스킬 또는 제2 어플리케이션들의 목록을 표시하기 위한 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 중 적어도 하나를 포함할 수 있다. 일 실시예에서는, 사용자가 상기 음성 인식 장치를 통하여 음성 명령을 제공하는 경우, 앱 또는 스킬의 명 칭이 필요할 수 있다. 이러한 경우, 사용자가 용이하게 그러한 음성 명령을 제공할 수 있도록, 상기 웨어러블 장치(101-1)에는 상기 앱들 또는 스킬들의 명칭들이 표시될 수 있다. 일 실시 예에 따르면, 서버는 스킬 또는 제2 어플리케이션들의 카테고리, 개수, 우선순위, 또는 사용이력 중 적어도 하나에 기반하여 콘텐츠를 생성할 수 있다. 동작 776에서, 서버는 스킬, 제2 어플리케이션의 기능(functions) 또는 어플리케이션들의 목록이 AR 환경 에서 표시될 수 있도록 생성된 콘텐츠를 렌더링(rendering) 할 수 있다. 동작 778에서, 서버는 렌더링 된 콘텐츠를 포함하는 제2 데이터를 전자 장치로 전송할 수 있다. 동작 780에서, 전자 장치는 디스플레이를 통해 AR 환경에서 렌더링 된 콘텐츠를 표시할 수 있다. 도 8은 다양한 실시 예들에 따라 음성 인식 장치의 종류에 기반하여 어플리케이션 목록을 결정하는 동작 흐름도를 도시한다. 도 8을 참조하면, 서버는 이미지 데이터에 기반하여 음성 인식 장치를 인식하고, 위치 정보에 기반하 여 음성 인식 장치의 종류를 결정할 수 있다. 음성 인식 장치의 종류는 예를 들어, 개인 장치 및 공 용 장치를 포함할 수 있다. 개인 장치는 개인 사용자 계정이 등록된 장치를 의미할 수 있다. 공용 장치는 복수 의 사용자 계정들이 등록되거나, 공용 계정이 등록된 장치를 의미할 수 있다. 동작 805에서, 전자 장치(예: 웨어러블 장치(101-1) 또는 사용자 단말(101-2))는 이미지 및 전자 장치 의 위치 정보를 획득할 수 있다. 일 실시 예에 따르면, 전자 장치는 GPS, A-GPS, GNSS, cell ID, UWB, LiFi, 블루투스, 뎁스 센서, 초음파 센서, 지오-펜스, 셀룰러, 또는 Wi-Fi 중 적어도 하나에 기반하여 위 치를 측정할 수 있다. 다른 실시 예에 따르면, 전자 장치는 전자 장치가 접속된 망의 망 정보에 기반 하여 전자 장치의 위치 정보를 획득할 수 있다. 다른 실시 예에 따르면, 동작 805에서, 전자 장치는 이미지 및 전자 장치에 내장된 타이머, 혹은 접속된 망의 망 정보를 이용하여 시간 정보를 획득할 수있다. 다른 실시 예에 따르면, 동작 805에서, 전자 장치는 이미지와 함께, 전자 장치의 위치 정보, 시간 정보, 사용자 발화 정보 중 하나 이상을 획득할 수 있다. 동작 810에서, 전자 장치는 제1 데이터를 전송할 수 있다. 일 실시 예에 따르면, 제1 데이터는 이미지 데 이터 및 전자 장치의 위치 정보 포함할 수 있다. 일 실시 예에 따라 전자 장치가 사용자 발화를 수신 한 경우, 제1 데이터는 사용자 발화 정보를 더 포함할 수 있다. 다른 실시 예에 따르면, 제1 데이터는 위치 정 보 또는 사용자 발화 정보 중 적어도 하나를 포함할 수 있다. 다른 실시 예에 따르면, 제1 데이터는 이미지, 전자 장치의 위치 정보, 및 시간 정보를 포함할 수 있다. 다른 실시 예에 따르면, 제1 데이터는 이미지와 함께, 전자 장치의 위치 정보, 시간 정보, 사용자 발화 정 보 중 하나 이상을 포함할 수 있다. 동작 815에서, 서버는 제1 데이터에 포함된 이미지를 처리하고, 이미지에 포함된 객체가 음성 인식 장치 임을 인식할 수 있다. 동작 820에서, 서버는 위치 정보(또는, 위치 데이터) 또는 사용자 발화 정보 중 적어도 하나에 기반하여 인식된 음성 인식 장치의 종류를 결정할 수 있다. 예를 들어, 전자 장치의 위치가 사용자 개인의 집 이면, 서버는 음성 인식 장치가 개인 장치(user-specific or user action required object)인 것으 로 식별할 수 있다. 개인 장치는 예를 들어, 전자 장치의 사용자에 의하여 소유되거나 연관된 장치일 수 있다.. 다른 예를 들어, 전자 장치의 위치가 사무실 또는 오프라인 상점과 같은 공용 공간이면, 서버(20 1)는 음성 인식 장치가 공용 장치(generic device)인 것으로 식별할 수 있다. 공용 장치는 예를 들어 전자 장치 의 사용자에 의하여 소유되거나 연관되지 않은 장치이거나, 불특정 사용자에게 공통적으로 제공하는 하나 이상의 서비스를 제공하는 장치일 수 있다. 다른 예를 들어, 서버는 제1 데이터에 포함된 사용자 발 화 정보가 기 등록된 사용자 발화 정보(예: 개인이 기지정한 시동어나 인증관련 정보)에 대응하면, 음성 인식 장치를 개인 장치로 결정할 수도 있다. 다른 실시 예에 따르면, 서버는 위치 정보 이외에도 사용 이 력에 기반하여 음성 인식 장치의 종류를 결정할 수 있다. 다른 실시 예에 따르면, 서버는 위치 정보, 시간, 사용자 발화 정보 중 하나 이상에 기반하여 음성 인식 장치의 종류를 결정할 수 있다.음성 인식 장 치가 공용 장치이면, 동작 825에서, 서버는 공용(generic) 지식(knowledgement), 공용 어플리케이션, 공용 장치에 대한 정보, 및 공용 장치 전용 콘텐츠를 포함하는 제1 DB를 검색할 수 있다. 일 실 시 예에 따르면, 제1 DB는 지정된 장소(예: 사무실 또는 오프라인 상점)에 대응하는 제1 어플리케이션 그룹을 포함할 수 있다. 예를 들어, 제1 어플리케이션 그룹은 지정된 장소와 연관된 기능(예: 회의 진행, 일정 관리, 가격 정보, 사용방법, 프로모션 정보, 또는 데모 콘텐츠 조회)을 제공하는 어플리케이션이나 스킬을 포함할 수 있다. 일 실시 예에 따르면, 제1 DB는 사용자 인증이 필요없는 기능(예: 날씨, 교통, 라디오 방송, 시간 알림) 이나, 공용 장치에 대한 정보, 혹은 공용 콘텐츠(예: 광고 이미지, 광고 비디오, 무료 오디오 스트리밍)를 제공 할 수 있다. 예를 들어, 제1 DB는 음성 인식 장치의 기본(default) 어플리케이션 또는 기본 콘텐츠를 포함 하거나, 기본 어플리케이션과 기본 콘텐츠를 포함할 수 있다. 일 실시 예에 따르면, 서버는 공용 장치에 대한 정보 및 콘텐츠를 포함하는 제1 DB를 검색하기 위해 제1 데이터의 시간 정보를 이용할 수 있다. 예를 들어, 서버는 제1 DB는 음성 인식 장치의 기본(default) 어플리케이션 또는 기본 콘텐츠 중 상기 수신한 시간 정보에 기반하여 기본 어플리케이션과 기본 콘텐츠를 검색 하거나 우선 순위를 결정할 수 있다. 다른 실시 예에 따르면, 서버는 공용 장치에 대한 정보 및 콘텐츠를 포함하는 제1 DB를 검색하기 위해 제1 데이터의 시간 및 장소 정보를 이용할 수 있다. 다른 실시 예에 따르면, 서버는 공용 장치에 대한 정보 및 콘텐츠를 포함하는 제1 DB를 검색하기 위해 제1 데이터의 시간 정보, 장소 정보, 또는 사용자 발화 정보 중 하나 이상을 이용할 수 있다. 동작 827에서, 서버는 공용 장치에 대한 콘텐츠(예: 이미지 및/또는 텍스트)를 생성할 수 있다. 예를 들어, 서버는 제1 DB로부터 스킬들, 어플리케이션들, 또는 콘텐츠들의 목록을 검색하고, 검색된 목록을 나 타내기 위한 표시 후보 콘텐츠(예: 텍스트, 이미지)를 생성할 수 있다. 예를 들어, 상기 표시 후보 콘텐츠는 검 색된 목록에서 표시하기 위한 어플리케이션, 스킬, 콘텐츠와 관련한 표시 순서, 표시 내용 등과 관련한 텍스트 나 이미지를 포함할 수 있다. 음성 인식 장치가 개인 장치이면, 동작 830에서, 서버는 사용자 계정과 연관된 콘텐츠를 포함하는 제 2 DB를 검색할 수 있다. 제2 DB는 음성 인식 장치과 연관한 사용자 계정에 대응하는 제2 어플리케이션 그룹을 포함할 수 있다. 제2 어플리케이션 그룹은 사용자에 의하여 선택되거나 등록(또는 인스톨)된 스킬들이나 어플리케이션들을 포함할 수 있다. 이를 위해, 서버는 음성 인식 장치와 연관된 사용자 계정이 있는지를 식별할 수 있다. 예를 들어, 서 버는 인식된 음성 인식 장치의 사용자 계정이 사용자 계정 DB에 저장되었는지를 식별할 수 있다. 이 경우, 서버는 제1 데이터에 포함된 전자 장치의 사용자 계정 정보를 이용하여 음성 인식 장 치에 연관된 사용자 계정이 사용자 계정 DB에 있는지를 식별할 수 있다. 서버는 음성 인식 장치 에 연관된 사용자 계정이 있다면, 제2 DB를 기반으로 어플리케이션, 스킬, 또는 콘텐츠 중 하나 이상의 목 록을 작성할 수 있다. 동작 835에서, 서버는 제1 데이터 수신, 동작 830에서 수신한 사용자 입력, 혹은 사용 이력 중 하나 이상이, 특정한 어플리케이션이나 스킬과 연관되었는지 여부를 결정할 수 있다. 예를 들어, 제1 데이터 수신 이나 동작 835의 사용자 입력에서 음성 신호나 사용자 제스처에 의해 기능을 지정하거나 선택할 수 있다. 예를 들어, 일 실시 예에 따르면, 서버은 사용 이력에 기반하여 기능을 지정하거나 선택할 수 있다. 예를 들어, 서버는 음성 명령이나 사용자 제스처 입력과 함께 사용 이력에 기반하여, 기능을 지정하거나 선택할 수 있다. 상기 지정되거나 선택된 기능을 기반으로, 상기 기능을 지원하기 위한 어플리케이션이나 스킬이 필요 한지 여부를 결정할 수 있다. 동작 840에서, 서버는 상기 특정 어플리케이션이나 스킬과 연관된 것으로 판단되면, 사용자 계정과 연관된 어플리케이션들의 목록으로부터 어플리케이션을 선택할 수 있다. 예를 들어, 사용자 계정과 연관된 어플리케이 션들의 목록으로부터, 제1 데이터 수신, 동작 830에서 수신한 사용자 입력, 혹은 사용 이력과 연관된 어플 리케이션이나 스킬을 하나 이상 결정할 수 있다. 예를 들어, 서버는 사용 이력, 사용자에 의하여 설정된 선호도, 또는 사용자 스케줄 중 적어도 하나에 기반하여 전자 장치의 디스플레이에 표시할 어플리케이션들 의 목록을 결정할 수 있다. 동작 842에서, 서버는 사용자 이력으로부터 어플리케이션의 기능을 결정할 수 있다. 일 실시 예에 따르면, 서버는 상기 결정된 어플리케이션이나 스킬이 제공할 기능을 사용자 이력으로부터 결정할 수 있다. 상기 기능은 상기 어플리케이션에서 제공하는 하나 이상의 기능일 수 있으며, 사용자 이력에 의해 기능이 결정되거나, 기능의 수행 상태가 결정될 수 있다. 예를 들어 결정된 어플리케이션이 음악 재생기이면, 사용 이 력에 기반하여 재생 상태, 연속 재생 설정 여부, 연속 재생할 콘텐츠 목록, 선정된 음악의 상세 설명(예: 작곡 자, 앨범명, 트랙명, 가수명) 등의 정보를 결정할 수 있으며, 정보의 선택, 조회, 재생과 관련한 기능들을 결정 할 수 있다. 이러한 경우, 상기 어플리케이션과 연관한 사용자 인터페이스를 통해 제어할 기능들이 결정될 수 있다. 예를 들어 결정된 어플리케이션이 음악 재생기이면, 사용 이력에 기반하여 가장 최근에 재생되었던 재생 상태를 이용하여, 음악 재생이 멈추었던 시점부터 자동으로 음악 재생 기능이 수행될 수도 있다. 서버가 제1 데이터 수신, 동작 830에서 수신한 사용자 입력, 혹은 사용 이력 중 하나 이상이, 특정한 어플리케이션이나 스킬과 연관되지 않았다면, 동작 845에서, 서버는 음성 인식 장치의 사용 이력에 기반하여 전자 장치의 디스플레이에 표시하기 위한 어플리케이션이나 스킬, 콘텐츠와 관련한 표시 후보 콘 텐츠를 생성할 수 있다. 예를 들어, 상기 표시 후보 콘텐츠는 검색된 목록에서 표시하기 위한 어플리케이션, 스킬, 콘텐츠와 관련한 표 시 순서, 표시 내용, 사용자 인터페이스 등과 관련한 텍스트나 이미지를 사용 이력(예: 최종 사용 이력, 기능의 사용 빈도)을 기반으로 결정하여 포함할 수 있다. 예를 들어, 상기 표시 후보 콘텐츠는 특정한 기능과 관련한 어플리케이션의 이미지나 콘텐츠 재생 화면일 수 있다. 동작 847에서, 서버는 스킬, 어플리케이션의 기능 또는 어플리케이션들의 목록이 AR 환경에서 표시될 수 있도록 생성된 AR 콘텐츠를 렌더링(rendering) 할 수 있다. AR 콘텐츠는 전자 장치의 디스플레이에서 표시 후보 콘텐츠를 표시하기 위하여, 객체 생성, 모양, 위치, 크기, 이동, 회전, 색상, 투명도 중 하나 이상의 연산 이 적용되어 생성된 이미지, 비디오, 3D 오브젝트 중 하나일 수 있다. 동작 850에서, 서버는 렌더링 된 콘텐츠를 포함하는 제2 데이터를 전자 장치로 전송할 수 있다. 동작 855에서, 전자 장치는 제2 데이터에 기반하여 디스플레이를 통해 AR 환경에서 어플리케이션들의 콘텐 츠를 표시할 수 있다. 일 실시 예에 따르면, 상기 제2 데이터의 AR 콘텐츠는 상기 제1 데이터에 포함된 음성 인 식 장치의 이미지에 연관되어 표시될 수 있다. 예를 들어, 상기 제2 데이터의 AR 콘텐츠는 동작 847에서 서버에 의해 제1 데이터의 이미지 변화에 따라 지속적으로 업데이트되어 생성될 수도 있다. 이런 경우, 서버은 음성 인식 장치의 이미지의 크기, 거리 정보 등에 기반하여, 표시할 AR 콘텐츠의 크기, 위치, 회전 각도, 찌그러짐(sheering), 밝기, 투명도 등을 미리 결정하여 생성할 수 있다. 따라서, 제1 데이터의 이미 지에서 음성 인식 장치 이미지의 위치나 크기가 연관되어 지속적으로 AR 콘텐츠를 생성하여 제2 데이터에 포함하여 전송할 수 있다. 예를 들어, 상기 제2 데이터의 AR 콘텐츠는 동작 847에서 서버에 의해 생성된 참고 AR 콘텐츠일 수 있다. 이런 경우, 서버는 일정한 규격(정규화된 크기, 색상, 회전 각도)의 3D 모델 정보를 AR 콘텐츠로서 제2 데이터에 포함하여 전송하고, 전자 장치에서는 수신한 음성 인식 장치의 이미지의 크기, 거리 정보 등에 기반하여, 표시할 AR 콘텐츠의 크기, 위치, 회전 각도, 찌그러짐(sheering), 밝 기, 투명도 등을 미리 결정하여 변경할 수 있다. 따라서, 전자 장치에서 음성 인식 장치 이미지의 위 치나 크기가 연관되어 지속적으로 AR 콘텐츠를 변경할 수도 있다. 따라서 음성 명령, 제스처 인식, 기능 변경 등과 같은 상황이 발생하는 경우에 서버에서 AR 콘텐츠를 변경하거나 새로 생성할 수 있다. 일 실시 예에 따르면, 전자 장치는 표시된 어플리케이션들의 콘텐츠에 기반하여 어플리케이션을 선택하는 사용자 입력을 수신할 수 있다. 예를 들어, 전자 장치는 음성 인식 장치를 통해 사용자 발화 입력을 수신하거나, 전자 장치에 포함된 입력 장치(예: 도 4의 입력 장치)를 선택하는 사용자 입력을 수신할 수 있다. 전자 장치는 수신된 사용자 입력을 서버로 전달할 수 있다. 서버는 수신된 사용자 입 력에 기반하여 동작 825 내지 동작 850을 수행할 수 있다. 일 실시 예에 따르면, 제1 데이터 수신이나 동작 835의 사용자 입력에서 음성 신호나 사용자 제스처에 의 해 기능을 지정하거나 선택할 수 있다. 이런 경우, 동작 840에서, 상기 기능과 관련한 어플리케이션이나 스킬이 선택될 수 있으며, 동작 842에서 선택된 어플리케이션이나 스킬이 지원하는 기능과 관련한 사용자 인터페이스가 하나 이상 결정될 수 있다. 예를 들어, 사용자가 음악 재생과 관련한 음성 명령이나 사용자 제스처를 입력시, 서버는 음악 재생과 관련한 어플리케이션이나 스킬을 목록에서 선택할 수 있으며, 전자 장치, 서버 , 외부 전자 장치의 메모리로부터 재생 가능한 음악 콘텐츠들을 결정하여 목록을 생성할 수 있다. 일 실시 예에 따르면, 서버은 사용 이력에 기반하여 기능을 지정하거나 선택할 수 있다. 예를 들어, 서버 는 동작 835에서, 사용 이력에 기반하여, 최근 사용 기능이 오디오 재생 어플리케이션과 연관되었음을 감 지하고, 동작 840에서, 사용자가 가장 최근 사용했던 오디오 재생과 관련한 어플리케이션이나 스킬을 목록에서 선택할 수 있으며, 동작 842에서, 선택된 어플리케이션이나 스킬과 관련하여 저장된 재생 상태(예: 콘텐츠명, 플레이 상태, 볼륨 상태, 채널명, URL, 콘텐츠 설명 중 하나 이상)와 관련한 기능을 제어할 수 있는 사용자 인 터페이스가 결정될 수 있다. 일 실시 예에 따르면, 서버는 음성 명령이나 사용자 제스처 입력과 함께 사용 이력에 기반하여, 기능을 지 정하거나 선택할 수 있다. 예를 들어, 사용자가 음식 주문과 관련하여 음성 명령이나 제스처 인식을 입력하는 경우, 동작 835에서 음식 주문 어플리케이션과 관련 있음을 판별하고, 동작 840에서, 상기 목록으로부터 음식 주문 어플리케이션들이나 스킬들을 선택하고, 동작 842에서, 사용 이력(예: 가장 최근 사용했던 시간, 주문 빈 도 중 하나 이상)을 이용하여 음식 주문 어플리케이션들이나 스킬들의 우선 순위를 결정하고, 우선 순위에 따라 목록을 생성할 수 있다. 이러한 경우, 연속된 음성 명령이나 제스처 인식에 따라, 어플리케이션이나 스킬을 선 택하고, 선택된 어플리케이션이나 스킬과 관련하여 사용 이력을 기반으로 최근 주문했던 이력이나 선호도를 이 용하여 음식을 하나 이상 결정할 수 있다. 서버는 편의상 하나의 서버로 설명하였으나, 복수 개의 서버나 외부 장치가 기능적으로 연동되어 구성될 수도 있다. 예를 들어, 음성 인식 장치의 사용자 계정 DB, 제1 DB, 제2 DB는 하나 이상의 서버에 포함되고, 영상 처리를 위한 서버과 유선 혹은 무선 통신을 통해 필요한 콘텐츠를 교환할 수도 있다. 예를 들어, 서버의 일부 기능은 전자 장치에서 처리할 수도 있고, 다른 기능은 서로 유선 혹은 무선 통신을 통해 분산 처리할 수도 있다. 도 9a는 다양한 실시 예들에 따라 어플리케이션들의 콘텐츠를 표시하는 전자 장치의 동작 흐름도를 도시한다. 동작 흐름도에 도시된 동작들은 전자 장치에 의하여 수행되거나, 전자 장치의 구성요 소(예: 도 3의 프로세서 또는 도 4의 프로세서)에 의하여 수행될 수 있다. 도 9a를 참조하면, 전자 장치는 웨어러블 장치(101-1) 또는 사용자 단말(101-2)일 수 있다. 전자 장치 가 사용자 단말(101-2)인 경우, 사용자 단말(101-2)은 웨어러블 장치(101-1)에 결합된 채로 동작 흐름도 의 동작들을 수행하거나, 웨어러블 장치(101-1)와 독립적으로 동작들을 수행할 수 있다. 동작 905에서, 전자 장치는 음성 인식 장치를 포함하는 이미지를 획득할 수 있다. 일 실시 예에 따르 면, 전자 장치는 지정된 조건이 감지되면, 카메라를 통해 이미지를 획득할 수 있다. 동작 910에서, 전자 장치는 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치(예: 도 1의 서버로 전송할 수 있다. 전자 장치가 웨어러블 장치(101-1)에 해당하는 경우, 웨어러블 장치(101- 1)는 사용자 단말(101-2)로 제1 데이터를 전송할 수 있다. 동작 915에서, 전자 장치는 음성 인식 장치가 지원하는 어플리케이션들의 목록을 포함하는 제2 데이 터를 외부 전자 장치로부터 수신할 수 있다. 동작 920에서, 전자 장치는 제2 데이터에 기반하여, 음성 인식 장치가 지원하는 어플리케이션들의 콘 텐츠를 표시할 수 있다. 도 9b는 다양한 실시 예들에 따라 어플리케이션 목록을 결정하는 서버의 동작 흐름도를 도시한다. 동 작 흐름도에 도시된 동작들은 서버에 의하여 수행되거나, 서버의 구성요소(예: 도 5의 프로세서 )에 의하여 수행될 수 있다. 도 9b를 참조하면, 동작 955에서, 서버는 전자 장치로부터 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 수신할 수 있다. 컨텍스트 정보는 예를 들어, 위치 정보, 시간 정보, 또는 사용자 계정 정보 중 적어 도 하나를 포함할 수 있다. 동작 960에서, 서버는 제1 데이터에 포함된 이미지를 분석하고, 분석 결과에 기반하여 이미지에 포함된 음 성 인식 장치를 인식할 수 있다. 서버는 이미지 처리 모듈 및 외부 서버를 통해 이미지를 분석할 수 있다. 예를 들어, 서버는 이미지에 포함된 피사체의 1차 카테고리가 전자 장치이고, 2차 카테고 리가 AI 스피커이며, 모델 명칭이 “xxxx”임을 결정할 수 있다. 동작 965에서, 서버는 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정할 수 있다. 어플리 케이션들의 목록에 포함되는 어플리케이션은 예를 들어, 고유 모드 또는 플러그드인 모드 중 적어도 하나를 지 원하는 어플리케이션을 포함할 수 있다. 일 실시 예에 따르면, 서버는 컨텍스트 DB에 저장된 정보에 기반하여 어플리케이션들의 카테고리, 개수, 또는 우선순위 중 적어도 하나를 결정할 수 있다. 동작 970에서, 서버는 어플리케이션들의 목록을 포함하는 제2 데이터를 전자 장치에게 전송할 수 있 다. 도 9b에는 도시되지 않았지만, 서버는 AR 모드에서 어플리케이션들의 콘텐츠를 렌더링 하기 위한 정보를 생성할 수 있다. 다른 예를 들어, 서버는 어플리케이션들의 목록만을 전송하고, 전자 장치가 수신된 어플리케이션들의 목록에 기반하여 AR 모드에서 어플리케이션들의 콘텐츠를 렌더링 할 수 있다. 렌더링된 AR 콘 텐츠는 전자 장치의 디스플레이에 표시될 수 있다. 예를 들어, 렌더링된 AR 콘텐츠는 전자 장치의 디 스플레이에서 음성 인식 장치의 위치에 연관하여 표시될 수 있다. 도 10은 다양한 실시 예들에 따라 음성 인식 장치가 포함되는 접속 환경을 도시한다. 일 실시 예에 따르면, 서버는 음성 인식 장치가 포함되는 접속 환경에 기반하여 사용자에게 추 천되는 어플리케이션들을 결정할 수 있다. 전자 장치는 서버에 의하여 결정된 어플리케이션들의 콘텐 츠를 표시할 수 있다. 도 10을 참조하면, 동작 1010에서, 서버는 전자 장치 위치 정보에 기반하여 음성 인식 장치의 접속 환경의 종류를 결정할 수 있다. 위치 정보는 전자 장치에 의하여 측정된 위치 정보 또는 전자 장치가 접속된 망의 망 정보 중 적어도 하나를 포함할 수 있다. 망 정보는 예를 들어, 망의 종류, 속도, 연결성, 능력, 서비스 이용가능성, 또는 엣지 서버의 정보 중 적어도 하나를 포함할 수 있다. 접속 환경 은 개인 접속 환경, 차량 접속 환경, 및 사내 접속 환경을 포함할 수 있다. 일 실시 예에 따르면, 개인 접속 환경은 음성 인식 장치가 개인 사용자의 집에 배치되거나, 개인 인 터넷 망에 접속된 환경을 의미할 수 있다. 개인 접속 환경에서, 서버는 사용자 계정 정보에 기반하 는 사용자 중심의 어플리케이션(예: 개인 스케줄 어플리케이션, 개인 메시지 어플리케이션)을 추천할 수 있다. 다시 말해, 서버는 사용자 중심의 어플리케이션의 우선순위를 높게 설정할 수 있다. 일 실시 예에 따르면, 차량 접속 환경은 음성 인식 장치가 차량 내부에 배치되거나, 접속된 망의 핸 드오버(handover)가 빈번하게 발생하는 환경을 의미할 수 있다. 차량 접속 환경에서, 서버는 망의 상태의 변화에 따른 어플리케이션(예: 네비게이션, 지도 어플리케이션)을 추천할 수 있다. 일 실시 예에 따르면, 서버는 차량 접속 환경에서 끊김이 자주 발생할 수 있는 어플리케이션(예: 비디오 스트리밍 서비스 어플리케이션)의 우선순위를 낮게 설정할 수 있다. 일 실시 예에 따르면, 공용 접속 환경은 복수의 사용자가 음성 인식 장치를 이용하는 환경을 의미할 수 있다. 예를 들어, 음성 인식 장치는 사무실 내부 또는 오프라인 상점 내부에 배치될 수 있다. 공용 접 속 환경에서, 서버는 업무와 관련된 어플리케이션(예: 회의 어플리케이션, 스케줄 어플리케이션) 또 는 제품 시연을 위한 어플리케이션의 우선 순위를 높게 설정할 수 있다. 다른 예를 들어, 음성 인식 장치 가 사무실 내부에 배치되면, 서버는 사무실에서 이용이 제한되는 어플리케이션(예: 게임 어플리케이션)의 우선순위를 낮게 설정할 수 있다. 다른 예를 들어, 음성 인식 장치가 오프라인 상점 내부에 배치되면, 서 버는 광고, 쿠폰, 또는 쇼핑과 관련된 어플리케이션의 우선순위를 높게 설정할 수 있다. 도 11은 다양한 실시 예들에 따라 음성 인식 장치를 실행하기 위한 인공지능 시스템의 블록도를 도 시한다. 도 11을 참조하면, 사용자는 전자 장치에 의하여 표시된 어플리케이션들의 콘텐츠를 참조하여 사용 자 발화를 통해 음성 인식 장치를 실행할 수 있다. 음성 인식 장치는 인공지능 시스템을 통해 사용자 발화에 대응하는 서비스를 제공할 수 있다. 도 11의 지능형 서버는 도 1의 서버와 별도의 개 체일 수도 있고, 통합된 서버일 수도 있다. 일 실시 예에 따르면, 지능형 서버는 통신 망을 통해 음성 인식 장치로부터 사용자 음성(user utterance) 입력(또는 사용자 발화)과 관련된 정보를 수신할 수 있다. 일 실시 예에 따르면, 지능형 서버(110 1)는 수신된 음성 입력과 관련된 데이터를 텍스트 데이터(text data)로 변경할 수 있다. 일 실시 예에 따르면, 지능형 서버는 텍스트 데이터에 기초하여 사용자 음성 입력과 대응되는 태스크(task)를 수행하기 위한 플 랜(plan)을 생성할 수 있다 일 실시 예에 따르면, 플랜은 인공 지능(artificial intelligence)(AI) 시스템에 의해 생성될 수 있다. 인공 지 능 시스템은 룰 베이스 시스템(rule-based system) 일 수도 있고, 신경망 베이스 시스템(neural network-based system)(예: 피드포워드 신경망(feedforward neural network)(FNN)), 순환 신경망(recurrent neural network)(RNN))일 수도 있다. 또는, 전술한 것의 조합 또는 이와 상이한 인공지능 시스템일 수도 있다. 일 실 시 예에 따르면, 플랜은 미리 정의된 플랜의 집합에서 선택될 수 있거나, 사용자 요청에 응답하여 실시간으로 생성될 수 있다. 예를 들어, 인공지능 시스템은 미리 정의 된 복수의 플랜 중 적어도 플랜을 선택할 수 있다. 일 실시 예에 따르면, 지능형 서버는 생성된 플랜에 따라 산출된 결과를 음성 인식 장치로 송신하거 나, 생성된 플랜을 음성 인식 장치로 송신할 수 있다. 일 실시 예에 따르면, 음성 인식 장치는 플랜 에 따라 산출된 결과를 음성을 통해 출력할 수 있다. 일 실시 예의 지능형 서버는 프론트 엔드(front end), 자연어 플랫폼(natural language platform), 캡슐 데이터베이스(capsule DB), 실행 엔진(execution engine), 엔드 유저 인터 페이스(end user interface), 매니지먼트 플랫폼(management platform), 빅 데이터 플랫폼(big data platform), 및 분석 플랫폼(analytic platform)을 포함할 수 있다. 일 실시 예에 따르면, 프론트 엔드는 음성 인식 장치로부터 수신된 음성 입력을 수신할 수 있다. 프 론트 엔드는 음성 입력에 대응되는 응답을 송신할 수 있다. 일 실시 예에 따르면, 자연어 플랫폼은 자동 음성 인식 모듈(automatic speech recognition module)(ASR module), 자연어 이해 모듈(natural language understanding module)(NLU module), 플래너 모듈 (planner module), 자연어 생성 모듈(natural language generator module)(NLG module), 및 텍스 트 음성 변환 모듈(text to speech module)(TTS module)를 포함할 수 있다. 일 실시 예에 따르면, 자동 음성 인식 모듈은 음성 인식 장치로부터 수신된 음성 입력을 텍스트 데 이터로 변환할 수 있다. 일 실시 예에 따르면, 자연어 이해 모듈은 음성 입력의 텍스트 데이터를 이용하 여 사용자의 의도를 파악할 수 있다. 예를 들어, 자연어 이해 모듈은 문법적 분석(syntactic analyze) 또는 의미적 분석(semantic analyze)을 수행하여 사용자의 의도를 파악할 수 있다. 일 실시 예에 따르면, 자연어 이해 모듈은 형태소 또는 구의 언어적 특징(예: 문법적 요소)을 이용하여 음성 입력으로부터 추출된 단어 의 의미를 파악하고, 상기 파악된 단어의 의미를 의도에 매칭시켜 사용자의 의도를 결정할 수 있다. 일 실시 예에 따르면, 플래너 모듈은 자연어 이해 모듈에서 결정된 의도 및 파라미터를 이용하여 플랜을 생성할 수 있다. 일 실시 예에 따르면, 플래너 모듈은 결정된 의도에 기초하여 태스크를 수행하기 위해 필요한 복수의 도메인을 결정할 수 있다. 플래너 모듈은 의도에 기초하여 결정된 복수의 도메인 각 각에 포함된 복수의 동작을 결정할 수 있다. 일 실시 예에 따르면, 플래너 모듈은 결정된 복수의 동작을 실행하는데 필요한 파라미터나, 복수의 동작의 실행에 의해 출력되는 결과 값을 결정할 수 있다. 파라미터 및 결과 값은 지정된 형식(또는, 클래스)과 관련된 컨셉으로 정의될 수 있다. 이에 따라, 플랜은 사용자의 의도에 의해 결정된 복수의 동작, 및 복수의 컨셉을 포함할 수 있다. 플래너 모듈은 복수의 동작, 및 복수의 컨 셉 사이의 관계를 단계적(또는, 계층적)으로 결정할 수 있다. 예를 들어, 플래너 모듈은 복수의 컨셉에 기초하여 사용자의 의도에 기초하여 결정된 복수의 동작의 실행 순서를 결정할 수 있다. 다시 말해, 플래너 모 듈은 복수의 동작의 실행에 필요한 파라미터, 및 복수의 동작의 실행에 의해 출력되는 결과에 기초하여, 복수의 동작의 실행 순서를 결정할 수 있다. 이에 따라, 플래너 모듈는 복수의 동작, 및 복수의 컨셉 사 이의 연관 정보(예: 온톨로지(ontology))가 포함된 플랜를 생성할 수 있다. 상기 플래너 모듈은 컨셉과 동작의 관계들의 집합이 저장된 캡슐 데이터베이스에 저장된 정보를 이용하여 플랜을 생성할 수 있다. 일 실시 예에 따르면, 자연어 생성 모듈은 지정된 정보를 텍스트 형태로 변경할 수 있다. 상기 텍스트 형 태로 변경된 정보는 자연어 발화의 형태일 수 있다. 일 실시 예의 텍스트 음성 변환 모듈은 텍스트 형태 의 정보를 음성 형태의 정보로 변경할 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 복수의 도메인에 대응되는 복수의 컨셉과 동작들의 관계에 대 한 정보를 저장할 수 있다. 예를 들어, 캡슐 데이터베이스는 플랜의 복수의 동작 오브젝트(action object 또는, 동작 정보) 및 컨셉 오브젝트(concept object 또는 컨셉 정보)를 포함하는 복수의 캡슐을 저장할 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 CAN(concept action network)의 형태로 상기 복수의 캡슐을 저장할 수 있다. 일 실시 예에 따르면, 복수의 캡슐은 캡슐 데이터베이스에 포함된 기능 저장소 (function registry)에 저장될 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 음성 입력에 대응되는 플랜을 결정할 때 필요한 전략 정보가 저장된 전략 레지스트리(strategy registry)를 포함할 수 있다. 전략 정보는 음성 입력에 대응되는 복수의 플랜 이 있는 경우, 하나의 플랜을 결정하기 위한 기준 정보를 포함할 수 있다. 일 실시 예에 따르면, 캡슐 데이터베 이스는 지정된 상황에서 사용자에게 후속 동작을 제안하기 위한 후속 동작의 정보가 저장된 후속 동작 레 지스트리(follow up registry)를 포함할 수 있다. 상기 후속 동작은, 예를 들어, 후속 발화를 포함할 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 음성 인식 장치을 통해 출력되는 정보의 레이아웃 (layout) 정보를 저장하는 레이아웃 레지스트리(layout registry)를 포함할 수 있다. 일 실시 예에 따르면, 캡 슐 데이터베이스는 캡슐 정보에 포함된 어휘(vocabulary) 정보가 저장된 어휘 레지스트리(vocabulary registry)를 포함할 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 사용자와의 대화(dialog)(또는, 인터렉션(interaction)) 정보가 저장된 대화 레지스트리(dialog registry)를 포함할 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 개발자 툴(developer tool)을 통해 저장된 오브젝트를 업데이 트(update)할 수 있다. 개발자 툴은, 예를 들어, 동작 오브젝트 또는 컨셉 오브젝트를 업데이트하기 위한 기능 에디터(function editor)를 포함할 수 있다. 상기 개발자 툴은 어휘를 업데이트하기 위한 어휘 에디터 (vocabulary editor)를 포함할 수 있다. 상기 개발자 툴은 플랜을 결정하는 전략을 생성 및 등록 하는 전략 에 디터(strategy editor)를 포함할 수 있다. 개발자 툴은 사용자와의 대화를 생성하는 대화 에디터(dialog editor)를 포함할 수 있다. 개발자 툴은 후속 목표를 활성화하고, 힌트를 제공하는 후속 발화를 편집할 수 있는 후속 동작 에디터(follow up editor)를 포함할 수 있다. 후속 목표는 현재 설정된 목표, 사용자의 선호도 또는 환경 조건에 기초하여 결정될 수 있다. 일 실시 예에 따르면, 캡슐 데이터베이스는 음성 인식 장치 내에도 구현될 수 있다. 다시 말해, 음 성 인식 장치은 음성 입력에 대응되는 동작을 결정하기 위한 정보를 저장하는 캡슐 데이터베이스를 포함할 수 있다. 일 실시 예에 따르면, 실행 엔진은 생성된 플랜을 이용하여 결과를 산출할 수 있다. 일 실시 예에 따르면, 엔드 유저 인터페이스는 산출된 결과를 음성 인식 장치로 송신할 수 있다. 이에 따라, 음성인식 장치는 결과를 수신하고, 수신된 결과를 사용자에게 제공할 수 있다. 일 실시 예에 따르면, 매 니지먼트 플랫폼은 지능형 서버에서 이용되는 정보를 관리할 수 있다. 일 실시 예에 따르면, 빅 데 이터 플랫폼은 사용자의 데이터를 수집할 수 있다. 일 실시 예에 따르면, 분석 플랫폼을 지능형 서 버의 QoS(quality of service)를 관리할 수 있다. 예를 들어, 분석 플랫폼은 지능형 서버의 구성 요소 및 처리 속도(또는, 효율성)를 관리할 수 있다. 일 실시 예에 따르면, 서비스 서버는 음성 인식 장치에 지정된 서비스(예: 음식 주문 또는 호텔 예 약)를 제공할 수 있다. 일 실시 예에 따르면, 서비스 서버는 제3 자에 의해 운영되는 서버일 수 있다. 예 를 들어, 서비스 서버는 서로 다른 제3 자에 의해 운영되는 제1 서비스 서버, 제2 서비스 서버 , 및 제3 서비스 서버를 포함할 수 있다. 일 실시 예에 따르면, 서비스 서버는 수신된 음성 입력에 대응되는 플랜을 생성하기 위한 정보를 지능형 서버에 제공할 수 있다. 제공된 정보는, 예를 들어, 캡슐 데이터베이스에 저장될 수 있다. 또한, 서비스 서버는 플랜에 따른 결과 정보를 지능형 서버에 제공할 수 있다. 도 12는 다양한 실시 예들에 따라 사용자에게 추천되는 어플리케이션을 표시하는 사용자 인터페이스(user interface, UI)를 도시한다. 도 12에 도시된 전자 장치는 웨어러블 장치(101-1) 또는 사용자 단말(101- 2)을 포함하고, 디스플레이는 도 2의 디스플레이(160-1, 160-2)를 포함할 수 있다. 도 12를 참조하면, 동작 1201에서, 전자 장치는 음성 인식 장치에 대한 이미지를 획득할 수 있다. 예 를 들어, 전자 장치는 움직임이 지정된 임계 시간(예: 1초) 동안에 감지되지 않으면 이미지를 획득할 수 있다. 다른 예를 들어, 전자 장치는 음성 인식 장치를 호출하는 사용자 발화(예: 시동어 혹은 음성인 식 예약어 발화)에 응답하여 이미지를 획득할 수 있다. 동작 1202에서, 전자 장치는 디스플레이를 통해 음성 인식 장치가 지원하는 어플리케이션들의 목록을 AR 모드에서 표시할 수 있다. 일 실시 예에 따르면, 서버는 컨텍스트 정보(예: 도 5의 550에 저장 된 정보)에 기반하여 지정된 카테고리 또는 소정 개수의 어플리케이션을 사용자에게 추천할 수 있다. 예를 들어, 음성 인식 장치가 배치된 위치가 사용자의 집이고, 시간이 저녁 식사 시간이면, 전자 장치는 음성 인식 장치가 지원하는 어플리케이션들 중에서 음식 어플리케이션들(1, 2, 3)의 콘텐츠를 표시할 수 있다. 다른 예를 들어, 사용자의 상태를 나타내는 사용자 발화(예: “나 배고파”)가 수신되면, 전자 장치(10 1)는 음식 어플리케이션들(1, 2, 3)의 콘텐츠를 표시할 수 있다. 일 실시 예에 따라 다른 어플리케이션들을 표시하는 메뉴(예: 1210-2)에 대한 사용자 입력(또는 사용자 발화)가 수신되면 전자 장치는 표시된 어플리케이션들 이외에 다른 어플리케이션들을 표시할 수 있다. 일 실시 예에 따라 동작 1202에 추천된 어플리케이션들(예: 1, 2, 3)을 선택하는 메뉴(예: 1210-1)에 대한 사용 자 입력(또는 사용자 발화)가 수신되면, 동작 1203에서, 전자 장치는 표시된 어플리케이션들(1, 2, 3) 중 하나의 어플리케이션(예: 음식 APP)을 표시할 수 있다. 일 실시 예에 따르면, 서버는 사용자의 사용 이 력에 기반하여 음식 APP을 선택할 수 있다. 일 실시 예에 따라, 추천된 음식 APP을 선택하는 사용자 발화나 사용자 제스처가 수신되면, 동작 1204에서, 전자 장치는 사용자의 사용 이력에 기반하여 음식 APP이 제공하는 음식들 중 어플리케이션에서 지정하 거나 혹은 사용 이력에 기반하여 지정된 음식(예: 피자, 콜라)을 추천할 수 있다. 전자 장치는 추천된 음 식에 관한 이미지를 디스플레이 상에 표시할 수 있다. 이러한 경우, 사용자 제스처에 의해 추천 음식 중 하나가 선택되었을 때, 전자 장치의 디스플레이에 상기 선택된 추천 음식을 주문할 수 있는 음성 명령어의 텍스트를 표시하거나, 상기 추천 음식을 주문하는 음성 명령을 생성하여 전자 장치의 스피커를 통해 출력 하거나, 혹은 전자 장치는 유선 혹은 무선 통신(WiFi, Bluetooth)을 통해 음성 인식 장치에 상기 추 천 음식을 주문하는 신호를 전달할 수도 있다. 음성 인식 장치에서 주문 처리된 결과는 전자 장치나 서버에 음성 출력, 유무선 통신을 통해 전달될 수 있고, 전달된 주문 처리 결과는 사용자 계정 혹은 사용 이력 정보로 기록될 수 있다. 일 실시 예에 따르면, 전자 장치는 추천된 어플리케이션(예: 음식 APP) 또는 추천된 음식에 관한 이미 지 이외에 다른 이미지(또는 아이콘)에 대하여 흐림 효과 또는 그림자 효과를 적용하거나, 음성 인식 장치(10 2)의 위에 표시되도록 제어함으로써 AR 환경에서 시각적 효과를 제공할 수 있다. 도 13은 다양한 실시 예들에 따라 엣지 서버(1320-1, 1320-2)를 포함하는 네트워크 환경을 도시한다. 도 13을 참조하면, 네트워크 환경(예: 도 1의 100)은 전자 장치(예: 웨어러블 장치(101-1) 또는 사 용자 단말(101-2))와 서버 사이에 엣지 서버들(1320-1, 1320-2)을 더 포함할 수 있다. 일 실시 예에 따르 면, 엣지 서버들(1320-1, 1320-2)은 클라우드렛(cloudlet), 애드-혹 클라우드(ad-hoc cloud), 포그 컴퓨팅(fog computing), C-RAN(cloud radio access network), 모바일 엣지 컴퓨팅, 또는 ETSI(European telecommunications standards institute)에서 정의되는 MEC(Multi-access Edge computing) 중 적어도 하나를 포함할 수 있다. 도 13에 도시된 엣지 서버들의 개수는 예시에 지나지 않으며, 엣지 서버들의 개수가 도 13에 도시된 예로 제한되는 것은 아니다. 일 실시 예에 따르면, 서버는 전자 장치가 접속된 엣지 서버의 정보에 따라서 전자 장치의 위치 를 식별할 수 있다. 예를 들어, 제1 엣지 서버(1320-1)가 제1 셀(1315-1)을 포함하는 제1 기지국(1310-1)에 연 결되고, 제2 엣지 서버(1320-2)가 제2 셀(1315-2)을 포함하는 제2 기지국(1310-2)에 연결될 수 있다. 제1 셀 (1315-1)의 사용자의 집을 포함하고, 제2 셀(1315-1)은 사용자의 사무실을 포함할 수 있다. 전자 장치가 제1 셀(1315-1)에 위치하면, 전자 장치는 제1 기지국(1310-1)을 통해 제1 엣지 서버(1320-1)에 접속될 수 있다. 서버는 제1 엣지 서버(1320-1)의 정보(예: 식별 정보)에 기반하여 전자 장치가 제1 셀(1315- 1)에 위치함을 식별할 수 있다. 일 실시 예에 따르면, 서버는 전자 장치가 접속된 엣지 서버(예: 제1 엣지 서버(1320-1))의 정보를 전자 장치 또는 기지국(예: 제1 기지국(1310-1))으로부터 수신할 수 있다. 일 실시 예에 따르면, 서버는 전자 장치가 접속된 엣지 서버(예: 제1 엣지 서버(1320-1))에 저장된 전자 장치나 음성 인식 장치의 사용 이력 정보를 전자 장치 또는 전자 장치가 접속된 엣지 서버로부터 수신할 수 있다. 따라서, 전자 장치가 접속한 엣지 서버마다 음성 인식 장치에 대응하는 서로 다른 사용 이력 정보를 저장할 수도 있다. 혹은 전자 장치가 접속한 엣지 서버에 대응하여 전자 장치 이나 서버은 엣지 서버마다 서로 다른 사용 이력 정보를 저장할 수도 있다. 도 14는 다양한 실시 예들에 따라 엣지 서버에 기반하여 어플리케이션 목록을 결정하는 동작 흐름도 를 도시한다. 도 14를 참조하면, 엣지 서버(예: 도 13의 제1 엣지 서버(1320-1))는 서버보다 전자 장치와 지리적으로 가까운 위치에 배치될 수 있다. 예를 들어, 엣지 서버는 기지국(예: 도 13의 제1 기지국 (1310-1))의 내부 또는 기지국의 근처에 배치될 수 있다. 전자 장치가 낮은 지연 시간(latency)을 요구하 는 경우, 전자 장치는 서버와 데이터를 송신 또는 수신하지 않고, 지리적으로 가까운 위치에 배치된 엣지 서버와 데이터를 송신 또는 수신할 수 있다. 엣지 서버는 전자 장치에게 낮은 지연 시간, 대용량 대역폭, 및 실시간 데이터 전송을 제공할 수 있다. 일 실시 예에 따르면, 엣지 서버는 서버와 동일하거나 유사한 구성요소를 포함하고, 서버와 동 일하거나 유사한 기능을 수행할 수 있다. 엣지 서버는 도 5의 서비스 모듈의 적어도 일부 구성을 포 함할 수 있다. 예를 들어, 엣지 서버가 이미지 처리 모듈을 포함하는 경우, 엣지 서버는 이미 지 분석을 수행할 수 있다. 엣지 서버가 이미지 분석을 수행하면, 사용자 단말(101-2)의 이미지 처리 부 담을 줄여주고, 서버에 비하여 데이터 전송 시간을 줄일 수 있다. 일 실시 예에 따르면, 물리적 제한으로 인하여 엣지 서버에 포함된 서비스 모듈의 성능은 서버에 포 함된 서비스 모듈의 성능에 비하여 떨어질 수 있다. 이 경우, 엣지 서버는 전자 장치의 요청 (즉, 이미지 처리, 어플리케이션 결정) 중 처리가 어려운 요청은 서버에게 전달할 수 있다. 동작 1405에서, 전자 장치(예: 웨어러블 장치(101-1) 또는 사용자 단말(101-2))는 음성 인식 장치를 포함하는 이미지를 획득할 수 있다. 동작 1410에서, 전자 장치는 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 서버보다 가까운 위 치에 배치된 엣지 서버로 전송할 수 있다. 이 경우, 데이터 전송 시간이 감소할 수 있다. 일 실시 예에 따르면, 전자 장치는 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 엣지 서버에 전송하기 위해, 전자 장치에 인접한 엣지 서버를 검색(discovery)할 수도 있다. 이러한 경우, 전자 장치 는 제1 네트워크 주소 정보(예: 도메인 네임 주소, 가상사설망 게이트웨이 주소)를 이용하여 엣지 서버에접속을 요청하게 되는데, 엣지 서버로 접속을 관리하는 서버(201 혹은 별도의 서버)가 이를 수신하고, 전자 장 치에 인접한 엣지 서버로 접속할 수 있는 제2 네트워크 주소 정보를 결정할 수 있다. 전자 장치는 결 정된 제2 네트워크 주소 정보를 이용하여 이에 대응하는 엣지 서버와 통신을 할 수 있다. 예를 들어, 전자 장치 는 결정된 제2 네트워크 주소 정보를 이용하여 대응하는 엣지 서버에 직접 접속하여 데이터를 교환하거나, 엣지 서버 접속 관리 서버가 전자 장치과 엣지 서버간 교환하는 데이터를 중계할 수도 있다. 따라서, 전자 장치이 음성 인식 장치를 사용하는 장소에 따라 동일한 제1 네트워크 주소 정보를 이용하더라도, 접 속하는 엣지 서버가 달라질 수 있으며, 그 결과 장소에 따라 엣지 서버에 저장되거나 연관되는 사용 이력이나 사용자 프로파일도 달라질 수 있다. 동작 1415에서, 엣지 서버는 제1 데이터에 기반하여 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정할 수 있다. 예를 들어, 엣지 서버는 이미지 데이터를 분석함으로써 음성 인식 장치를 인식하고, 전자 장치의 위치 정보에 기반하여 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정할 수 있다. 동작 1420에서, 엣지 서버는 어플리케이션들의 목록을 포함하는 제2 데이터를 전자 장치에게 전송할 수 있다. 동작 1425에서, 전자 장치는 수신된 제2 데이터에 기반하여, 음성 인식 장치가 지원하는 어플리케이 션들의 콘텐츠를 디스플레이(예: 도 2의 160-1, 160-2)를 통해 AR 모드에서 표시할 수 있다. 도 15 내지 도 17은 다양한 실시 예들에 따라 AR 환경에서 콘텐츠를 포함하는 사용자 인터페이스(user interface, UI)를 도시한다. 도 15를 참조하면, AR 환경에서, 전자 장치(예: 웨어러블 장치(101-1) 또는 사용자 단말(101-2))는 음성 인식 장치가 지원하는 복수의 어플리케이션들(또는 스킬들)의 목록을 나타내는 UI를 표시할 수 있다. 예를 들어, 음성 인식 장치는 전자 장치의 카메라 또는 씨스루 디스플레이를 통해 보여지고, 어플리 케이션들의 목록(예: App 1, App 2,..., App 16)은 디스플레이에 의하여 표시될 수 있다. 일 실시예에서는, 상 기 목록은 상기 어플리케이션들의 명칭을 포함하고, 부가적으로 상기 어플리케이션들을 나타내는 아이콘이나 추 가적인 정보를 포함할 수 있다. 도 16을 참조하면, AR 환경에서, 전자 장치는 어플리케이션들의 목록 이외에도 추가적인 버튼들(예: 1, 2, 3, 4)을 더 표시할 수 있다. 버튼들은 예를 들어, 상기 어플리케이션들의 목록을, 예를 들면, 사용 히스 토리를 기준으로 또는 어플리케이션들을 알파벳순으로 표시하는 입력 수단을 제공할 수 있다. 다른 실시예에서, 상기 버튼 중의 하나는 상기 어플리케이션들을 카테고리별로 표시하는데 사용될 수 있다. 또다른 실시예에서는, 어플리케이션들의 목록이 복수의 페이지들을 포함할 수 있으며, 상기 버튼들 중의 하나는 복수의 페이지들 중 하나를 선택(예를 들어, 홈 화면)하는데 이용될 수 있다. 도 17을 참조하면, AR 환경에서, 전자 장치는 어플리케이션들의 목록들을 포함하는 복수의 페이지들 을 제공할 수 있으며, 이 경우, 사용자가 상기 페이지들을, 예를 들어 스와이프 제스처를 이용하여 스크롤 할 수 있다. 이 경우, 상기 전자 장치는 , 현재 보여지는 페이지를 표시하기 위하여 GUI(graphic user interface)를 더 포함할 수 있다. 이 경우, 홈 페이지가 존재하는 경우, GUI는 이를 표시하는 심볼 을 포함할 수 있다. 도시된 실시예에서는, 총 6개의 페이지가 존재하며, 홈 페이지는 좌측에서 두번째에 위치 한다. 또한 현재 보여지는 페이지는 상기 GUI에서 하이라이트되어 표시될 수 있다. 도 18은 다양한 실시 예들에 따라 AR 환경에서 사용자 계정에 기반하여 AR 콘텐츠를 표시하는 UI의 다른 예를 도시한다. 도 18을 참조하면, AR 환경에서, 전자 장치(예: 웨어러블 장치(101-1) 또는 사용자 단말(101-2))는 음성 인식 장치가 지원하는 복수의 어플리케이션들의 목록을 나타내는 UI를 표시할 수 있다. 이러한 경우, 사용자의 음성입력 혹은 제스처 인식에 의해 어플리케이션 1이 선택될 수 있다. 예를 들어, 어플리케이션 들 중에서 음악 재생을 위해 시동어(“bixby”)와 음성 명령(“play the music”)이 음성 입력되면, 전자 장치 이나 음성 인식 장치 혹은 서버에 의해 인식된 음성 인식 명령에 대응하는 어플리케이션 1이 선 택될 수 있다. 이때, 인식된 음성 명령에 대응하는 텍스트 정보 혹은 선택된 어플리케이션 1을 지정하는그래픽 인디케이터이 함께 표시될 수 있다. 예를 들어, 어플리케이션들 중에서 음악 재생을 위해 어플리 케이션 1이 사용자 제스처(예: 핸드 제스처, 디스플레이 터치 등)에 의해 선택될 수 있다. 이때, 선택된 어플리 케이션 1을 지정하는 그래픽 인디케이터이 함께 표시될 수 있다. 어플리케이션이 선택되면, 사용 이력 정보 혹은 사용자 계정에 기반하여 어플리케이션의 기능에 대응하는 사용 자 인터페이스가 AR 모드에서 표시될 수 있다. 예를 들어, 음악 재생과 관련한 어플리케이션 1이 선택되면, 음 성 인식 장치에 대응하여 사용 이력 정보 혹은 사용자 계정에 기반하여 이전에 재생했던 음악 정보 및 어플리케이션 1의 기능에 대응하는 제어용 사용자 인터페이스(예: 프로그레스바, 정보 표시 호출 버튼, 이전 곡 선택 버튼, 다음 재생할 곡 선택 버튼, 오디오 볼륨 조정 버튼)를 AR용으로 렌더링하여 표시할 수 있다. 상술한 바와 같이, 일 실시 예에 따른 전자 장치(예: 도 1의 101-1 또는 101-2)는, 디스플레이(예: 도 3의 360 또는 도 4의 460), 카메라(예: 도 3의 320 또는 도 4의 480), 무선 통신 회로(예: 도 3의 370 또는 도 4의 490), 상기 디스플레이, 상기 카메라, 및 상기 무선 통신 회로와 작동적으로 연결되는 프로세서(예: 도 3의 330 또는 도 4의 420), 및 상기 프로세서와 작동적으로 연결된 메모리(예: 도 3의 340 또는 도 4의 430)를 포함하고, 상기 메모리는 실행 시에, 상기 프로세서가, 상기 카메라를 통해, 상기 전자 장치의 사용자의 계정과 연관된, 외부의 음성 인식 기반 인공 지능 장치(예: 도 1의 102)를 포함하는 이미지를 획득하고, 상기 무선 통 신 회로를 통해, 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치(예: 도 1의 101-2 또 는 201)로 전송하고, 상기 무선 통신 회로를 통해, 상기 외부 전자 장치로부터 상기 인공 지능 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하고, 및 상기 제2 데이터에 기반하여, 상기 디스플레이를 통해, 상기 목록을 포함하는 그래픽 유저 인터페이스를 상기 음성 인식 장치에 인접하거나 중첩되도록 표시하도록 할 수 있다. 일 실시 예에 따르면, 상기 컨텍스트 정보는, 상기 전자 장치의 사용자 계정 정보, 위치 정보, 또는 시간 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 상기 제2 데이터는, 어플리케이션들의 우선순위를 나타내는 정보를 포함하고, 상기 프로 세서는, 상기 목록을 상기 우선순위에 따라서 상기 디스플레이 상에 표시하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 어플리케이션들의 우선순위를 나타내는 정보는, 상기 전자 장치의 상기 사용자 계정 정보, 상기 위치 정보, 상기 시간 정보, 어플리케이션들의 명칭들의 알파벳 순서, 또는 사용 이력 중 적어도 하 나에 기반할 수 있다. 일 실시 예에 따르면, 상기 위치 정보는, 상기 전자 장치가 접속된 망의 망(network) 정보를 포함하고, 상기 어 플리케이션들의 목록은, 상기 망 정보에 기반하여 결정된, 사용자 전용 어플리케이션 그룹 또는 공용 어플리케 이션 그룹을 포함할 수 있다. 일 실시 예에 따르면, 상기 망 정보는, 상기 전자 장치가 접속된 망의 종류, 속도, 연결성(connectivity), 능력 (capability), 서비스 이용가능성(service availability), 또는 엣지 서버의 종류 중 적어도 하나를 나타낼 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은 상기 프로세서가, 상기 음성 인식 장치로 수신되는 사용자 발화에 기반하여, 상기 디스플레이를 통해, 상기 어플리케이션들의 목록에 포함되는 어플리케이션의 실행 화면을 표시 하도록 할 수 있다. 일 실시 예에 따르면, 상기 전자 장치는 상기 전자 장치의 움직임을 감지하도록 구성된 센서를 더 포함하고, 상 기 프로세서는, 상기 카메라가 상기 음성 인식 장치를 응시하는 동안에, 지정된 임계 시간 동안에 상기 전자 장 치의 움직임이 감지되지 않거나, 또는 사용자 입력이 수신되면, 상기 이미지를 획득하도록 구성될 수 있다. 상술한 바와 같이, 일 실시 예에 따른 시스템(예: 도 1의 100)은, 적어도 하나의 통신 인터페이스, 상기 통신 인터페이스와 작동적으로 연결된 적어도 하나의 프로세서, 및 상기 프로세서와 작동적으로 연결된 적어도 하나 의 메모리를 포함하며, 상기 메모리는, 외부 음성 인식 장치에 대한 정보를 저장하며, 실행시에, 상기 프로세서 가, 상기 통신 인터페이스를 통해, 상기 외부 음성 인식 장치의 사용자 계정과 연관된 증강 현실 전자 장치로부 터 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 수신하고, 상기 이미지에 포함되는 상기 음성 인식 장치 를 인식(recognize)하고, 상기 컨텍스트 정보 및 상기 메모리에 저장된 상기 음성 인식 장치에 대한 정보에 기반하여, 상기 음성 인식 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 목록을 결정하고, 상기 통신 인터페이스를 통해, 상기 어플리케이션들의 목록을 포함하는 제2 데이터를 상기 AR 전자 장치에게 전송하 도록 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 프로세서가, 상기 컨텍스트 정보에 포함되는 위치 정보에 기 반하여 상기 음성 인식 장치가 상기 사용자 계정과 관련되어 있는지 결정하고, 상기 음성 인식 장치가 상기 사 용자 계정과 관련된 경우, 상기 메모리에 저장된 상기 음성 인식 장치에 대한 정보에 기반하여, 상기 음성 인식 장치가 지원하는 어플리케이션들의 목록을 결정하도록 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은 상기 프로세서가, 상기 컨텍스트 정보에 포함되는 상기 전자 장치의 사용자 계정 정보, 시간 정보, 또는 상기 위치 정보 중 적어도 하나에 기반하여, 상기 어플리케이션들의 우선순 위를 결정하고, 상기 제2 데이터에 상기 어플리케이션들의 우선순위를 더 삽입하도록 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은 상기 프로세서가, 상기 컨텍스트 정보에 포함되는 망 정보에 기반하 여, 상기 음성 인식 장치의 접속 환경을 식별하고, 상기 접속 환경에 기반하여, 상기 어플리케이션들의 우선순 위를 결정하고, 및 상기 제2 데이터에 상기 어플리케이션들의 우선순위를 더 삽입하도록 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은 상기 프로세서가, 상기 망 정보에 포함되는, 상기 전자 장치가 접 속된 망의 종류, 속도, 연결성(connectivity), 능력(capability), 또는 서비스 이용가능성(service availability) 중 적어도 하나에 기반하여 상기 음성 인식 장치의 접속 환경을 식별하도록 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은 상기 프로세서가, 상기 컨텍스트 정보에 포함되는, 상기 전자 장치 가 접속된 엣지 서버의 정보에 기반하여 상기 음성 인식 장치의 종류를 결정하고, 상기 음성 인식 장치의 종류 및 상기 메모리에 저장된 상기 음성 인식 장치에 대한 정보에 기반하여, 상기 음성 인식 장치가 지원하는 어플 리케이션들의 목록을 결정하도록 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은 상기 프로세서가, 상기 어플리케이션들의 목록을 나타내는 콘텐츠의 렌더링 정보를 생성하고, 상기 제2 데이터에 상기 렌더링 정보를 더 삽입하도록 할 수 있다. 상술한 바와 같이, 일 실시 예에 따른 증강 현실 환경에서 전자 장치를 동작하는 방법은, 상기 전자 장치의 사 용자 계정과 연관된, 외부의 음성 인식 기반 인공 지능 장치를 포함하는 이미지를 획득하는 동작, 상기 이미지 및 컨텍스트 정보를 포함하는 제1 데이터를 외부 전자 장치로 전송하는 동작, 상기 외부 전자 장치로부터 상기 인공 지능 장치를 포함하는 인공 지능 시스템에 설치된 어플리케이션들의 명칭들을 포함하는 목록을 포함하는 제2 데이터를 수신하는 동작, 및 상기 제2 데이터에 기반하여, 상기 목록을 포함하는 그래픽 유저 인터페이스를 상기 음성 인식 장치에 인접하거나 중첩되도록 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 이미지를 획득하는 동작은, 상기 전자 장치가 사용자의 신체의 일부에 착용된 상태 에서, AR 모드를 실행하는 사용하는 제1 사용자 입력을 수신하는 동작, 상기 AR 모드에서, 상기 음성 인식 장치 가 지원하는 적어도 하나의 어플리케이션을 실행하는 제2 사용자 입력을 수신하는 동작, 및 상기 제2 사용자 입 력에 응답하여 상기 이미지를 획득하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 제2 데이터는 상기 어플리케이션들의 우선순위를 나타내고, 상기 그래픽 유저 인터 페이스를 표시하는 동작은, 상기 어플리케이션들의 명칭들을 상기 우선순위에 따라서 순서대로 표시하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은 상기 표시된 상기 그래픽 유저 인터페이스에 기반하는 사용자 발화 입력을 수신하는 동작, 상기 수신된 사용자 발화 입력을 상기 외부 전자 장치로 전송하는 동작, 상기 외부 전자 장치로 부터 상기 사용자 발화 입력에 기반하는 어플리케이션 실행 화면을 수신하는 동작, 및 상기 수신된 어플리케이 션 실행 화면을 표시하는 동작을 더 포함할 수 있다. 일 실시 예에 따르면, 상기 그래픽 유저 인터페이스를 표시하는 동작은, 상기 음성 인식 장치를 호출하는 사용 자 발화 입력에 응답하여 상기 어플리케이션들의 콘텐츠를 표시하는 동작을 포함할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치 (예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“A 또는 B 중 적어도 하나,”\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,”및 “A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용 어 없이, “커플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체 는, 비일시적(non-transitory) 저장매체의 형태 로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기 파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있다. 다양한 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9a 도면9b 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2019-0023751", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예들에 따른 네트워크 환경을 도시한다. 도 2는 증강 현실(augmented reality, AR) 환경에서 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표 시하는 동작을 나타낸다. 도 3은 다양한 실시 예들에 따른 웨어러블 장치의 블록도를 도시한다. 도 4는 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 5는 다양한 실시 예들에 따른 서버의 블록도를 도시한다. 도 6은 다양한 실시 예들에 따라 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표시하기 위한 모듈의 동작 흐름도를 도시한다. 도 7a는 다양한 실시 예들에 따라 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표시하기 위한 동작 흐름도를 도시한다. 도 7b는 다양한 실시 예들에 따라 음성 인식 장치가 지원하는 어플리케이션들의 콘텐츠를 표시하기 위한 다른 동작 흐름도를 도시한다. 도 8은 다양한 실시 예들에 따라 음성 인식 장치의 종류에 기반하여 어플리케이션 목록을 결정하는 동작 흐름도 를 도시한다. 도 9a는 다양한 실시 예들에 따라 어플리케이션들의 콘텐츠를 표시하는 전자 장치의 동작 흐름도를 도시한다. 도 9b는 다양한 실시 예들에 따라 어플리케이션 목록을 결정하는 서버의 동작 흐름도를 도시한다. 도 10은 다양한 실시 예들에 따라 음성 인식 장치가 포함되는 접속 환경을 도시한다. 도 11은 다양한 실시 예들에 따라 음성 인식 장치를 실행하기 위한 인공지능 시스템의 블록도를 도시한다. 도 12는 다양한 실시 예들에 따라 사용자에게 추천되는 어플리케이션을 표시하는 사용자 인터페이스(user interface, UI)를 도시한다. 도 13은 다양한 실시 예들에 따라 엣지 서버(edge server)를 포함하는 네트워크 환경을 도시한다. 도 14는 다양한 실시 예들에 따라 엣지 서버에 기반하여 어플리케이션 목록을 결정하는 동작 흐름도를 도시한다. 도 15는 다양한 실시 예들에 따라 AR 환경에서 콘텐츠를 포함하는 사용자 인터페이스(user interface, UI)를 도 시한다. 도 16은 다양한 실시 예들에 따라 AR 환경에서 콘텐츠를 포함하는 UI의 다른 예를 도시한다. 도 17은 다양한 실시 예들에 따라 AR 환경에서 콘텐츠를 포함하는 UI의 다른 예를 도시한다. 도 18은 다양한 실시 예들에 따라 AR 환경에서 사용자 계정에 기반하여 AR 콘텐츠를 표시하는 UI의 다른 예를 도시한다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
