{"patent_id": "10-2018-0136333", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0053125", "출원번호": "10-2018-0136333", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "이태희"}}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 이미지 센서 및 제2 이미지 센서; 및상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 상이하게 제어하여 복수의 촬영 이미지를획득하는 제1 촬영 모드 및 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교번적으로 수행하고, 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 상기 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 상기 식별된 객체의 거리 정보를 획득하는 프로세서;를 포함하는 전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 제1 촬영 모드에서 상기 제1 이미지 센서의 노출 시간을 제1 노출 시간으로, 상기 제2 이미지 센서의 노출시간을 제2 노출 시간으로 제어하고, 상기 제2 촬영 모드에서 상기 제1 및 제2 이미지 센서의 노출 시간을 상기 제1 노출 시간으로 제어하는, 전자장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제2 노출 시간은, 상기 제1 노출 시간을 초과하는, 전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 프로세서는,상기 제1 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 상기 객체의 위치 정보중 적어도 하나에 기초하여 상기 제1 노출 시간을 갱신하고,상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및상기 객체의 위치 정보 중 적어도 하나에 기초하여 상기 제2 노출 시간을 갱신하는, 전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,기 설정된 프레임 간격으로, 상기 제1 촬영 모드 및 상기 제2 촬영 모드를 교번적으로 수행하는, 전자 장치.공개특허 10-2020-0053125-3-청구항 6 제1항에 있어서,상기 프로세서는,상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 이미지에 포함된 픽셀 값이 기설정된 값미만이면, 상기 제2 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초과하도록 제어하는,전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 전자 장치는,차량에 탑재되는 주행 보조 장치인, 전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,상기 객체의 타입 정보 및 거리 정보 중 적어도 하나에 기초하여 상기 차량을 제어하는, 전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 HDR(High Dynamic Range) 영상을 생성하고, 상기 HDR 영상을 이용하여 상기 객체를 식별하는, 전자 장치."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치의 제어 방법에 있어서,제1 이미지 센서 및 제2 이미지 센서 각각의 노출 시간을 상이하게 제어하여 복수의 촬영 이미지를 획득하는 제1 촬영 모드 및 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 동일하게 제어하여 복수의촬영 이미지를 획득하는 제2 촬영 모드를 교번적으로 수행하는 단계; 및, 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 상기 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 상기 식별된 객체의 거리 정보를 획득하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 교번적으로 수행하는 단계는,상기 제1 촬영 모드에서 상기 제1 이미지 센서의 노출 시간을 제1 노출 시간으로, 상기 제2 이미지 센서의 노출시간을 제2 노출 시간으로 제어하고, 상기 제2 촬영 모드에서 상기 제1 및 제2 이미지 센서의 노출 시간을 상기 제1 노출 시간으로 제어하는, 제어공개특허 10-2020-0053125-4-방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제2 노출 시간은, 상기 제1 노출 시간을 초과하는, 제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 제1 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 상기 객체의 위치 정보중 적어도 하나에 기초하여 상기 제1 노출 시간을 갱신하는 단계; 및상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및상기 객체의 위치 정보 중 적어도 하나에 기초하여 상기 제2 노출 시간을 갱신하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 교번적으로 수행하는 단계는,기 설정된 프레임 간격으로, 상기 제1 촬영 모드 및 상기 제2 촬영 모드를 교번적으로 수행하는, 제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,상기 교번적으로 수행하는 단계는,상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 이미지에 포함된 픽셀 값이 기설정된 값미만이면, 상기 제2 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초과하도록 제어하는,제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서,상기 전자 장치는,차량에 탑재되는 주행 보조 장치인, 제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 객체의 타입 정보 및 거리 정보 중 적어도 하나에 기초하여 상기 차량을 제어하는 단계;를 더 포함하는,제어 방법.공개특허 10-2020-0053125-5-청구항 18 제10항에 있어서,거리 정보를 획득하는 단계는,상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 HDR 영상을 생성하고, 상기 HDR 영상을 이용하여 상기 객체를 식별하는, 제어 방법."}
{"patent_id": "10-2018-0136333", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치의 프로세서에 의해 실행되는 경우 상기 전자 장치가 동작을 수행하도록 하는 컴퓨터 명령을 저장하는비일시적 컴퓨터 판독 가능 매체에 있어서, 상기 동작은,제1 이미지 센서 및 제2 이미지 센서 각각의 노출 시간을 상이하게 제어하여 복수의 촬영 이미지를 획득하는 제1 촬영 모드 및 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 동일하게 제어하여 복수의촬영 이미지를 획득하는 제2 촬영 모드를 교번적으로 수행하는 단계; 및, 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 상기 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 상기 식별된 객체의 거리 정보를 획득하는 단계;를 포함하는, 비일시적 컴퓨터 판독 가능 매체."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 전자 장치는, 제1 이미지 센서 및 제2 이미지 센서, 및 제1 이미지 센서 및 제2 이미지 센서 각각의 노출 시간을 상이하게 제어하여 복수의 촬영 이미지를 획득하는 제1 촬영 모드 및 제1 이미지 센서 및 제2 이미지 센서 각각의 노출 시간을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교 번적으로 수행하고, 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 제2 촬영 모드 에서 획득된 복수의 촬영 이미지에 기초하여 식별된 객체의 거리 정보를 획득하는 프로세서를 포함한다."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 그 제어 방법에 관한 것으로, 더욱 상세하게는 멀티 카메라를 이용하여 시인성 확보 및 거리 정보를 획득하는 전자 장치 및 그 제어 방법에 관한 것이다."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "디지털 영상에서 밝은 곳은 더 밝게, 어두운 곳은 더 어둡게 만들어 사람이 실제 눈으로 보는 것에 가깝게 밝기 의 범위를 확장시키는 HDR(High Dynamic Range) 기술이 각광받고 있다. 다만, HDR 기술에 기초하여 객체를 식별하고, 식별된 객체의 거리 정보를 획득하기 위해서는 최소 3대의 카메라 가 요구되었다. 예를 들어, HDR 기술을 구현하기 위해 2대의 카메라가 필요하고, 스테레오 카메라를 이용하여 객체의 거리 정보를 산출하기 위해 2대의 카메라가 필요하다. 이 중 한대의 카메라가 HDR 기술을 구현하는데 이 용됨과 동시에 스테레오 카메라로 이용된다고 하더라도 상술한 바와 같이 3대의 카메라가 필요한 실정이다."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 필요성에 따른 것으로, 본 개시의 목적은, 멀티 카메라를 이용한 HDR 기술을 통해 획득된 이 미지에서 객체를 식별하고, 식별된 객체의 거리 정보를 획득하는 전자 장치 및 그 제어 방법을 제공함에 있다."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 개시의 일 실시 예에 따른 전자 장치는, 제1 이미지 센서 및 제2 이미지 센서, 및 프로세서를 포함할 수 있다. 상기 프로세서는, 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 상이하게 제어하여 복수 의 촬영 이미지를 획득하는 제1 촬영 모드 및 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간 을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교번적으로 수행할 수 있다. 상기 프로세서는, 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 상기 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 상기 식별된 객체의 거리 정보를 획득할 수 있다. 상기 프로세서는, 상기 제1 촬영 모드에서 상기 제1 이미지 센서의 노출 시간을 제1 노출 시간으로, 상기 제2 이미지 센서의 노출 시간을 제2 노출 시간으로 제어할 수 있다. 상기 프로세서는, 상기 제2 촬영 모드에서 상기 제1 및 제2 이미지 센서의 노출 시간을 상기 제1 노출 시간으로 제어할 수 있다. 여기서, 상기 제2 노출 시간은, 상기 제1 노출 시간을 초과할 수 있다. 상기 프로세서는, 상기 제1 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 상기 객체의 위치 정보 중 적어도 하나에 기초하여 상기 제1 노출 시간을 갱신할 수 있다. 상기 프로세서는, 상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 상기 객체의 위치 정보 중 적어도 하나에 기초하여 상기 제2 노출 시간을 갱신할 수 있다. 상기 프로세서는, 기 설정된 프레임 간격으로, 상기 제1 촬영 모드 및 상기 제2 촬영 모드를 교번적으로 수행할 수 있다. 상기 프로세서는, 상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 이미지에 포함된 픽셀 값이 기 설정된 값 미만이면, 상기 제2 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초과하도록 제어할 수 있다. 상기 전자 장치는, 차량에 탑재되는 주행 보조 장치일 수 있다. 상기 프로세서는, 상기 객체의 타입 정보 및 거리 정보 중 적어도 하나에 기초하여 상기 차량을 제어할 수 있다. 상기 프로세서는, 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 HDR(High Dynamic Range) 영 상을 생성하고, 상기 HDR 영상을 이용하여 상기 객체를 식별할 수 있다. 또한, 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법은, 제1 이미지 센서 및 제2 이미지 센서 각각의 노 출 시간을 상이하게 제어하여 복수의 촬영 이미지를 획득하는 제1 촬영 모드 및 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교번 적으로 수행하는 단계 및 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 상 기 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 상기 식별된 객체의 거리 정보를 획득하는 단계를 포함할 수 있다. 상기 교번적으로 수행하는 단계는, 상기 제1 촬영 모드에서 상기 제1 이미지 센서의 노출 시간을 제1 노출 시간 으로, 상기 제2 이미지 센서의 노출 시간을 제2 노출 시간으로 제어할 수 있다. 상기 교번적으로 수행하는 단계는, 상기 제2 촬영 모드에서 상기 제1 및 제2 이미지 센서의 노출 시간을 상기 제1 노출 시간으로 제어할 수 있다. 여기서, 상기 제2 노출 시간은, 상기 제1 노출 시간을 초과할 수 있다. 상기 제어 방법은, 상기 제1 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 상기 객체의 위치 정보 중 적어도 하나에 기초하여 상기 제1 노출 시간을 갱신하는 단계 및 상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 상기 객체의 위치 정보 중 적어도 하나에 기초하여 상기 제2 노출 시간을 갱신하는 단계를 더 포함할 수 있다. 상기 교번적으로 수행하는 단계는, 기 설정된 프레임 간격으로, 상기 제1 촬영 모드 및 상기 제2 촬영 모드를 교번적으로 수행할 수 있다. 상기 교번적으로 수행하는 단계는, 상기 제1 촬영 모드에서 상기 제2 이미지 센서에 의해 획득된 이미지에 포함 된 픽셀 값이 기설정된 값 미만이면, 상기 제2 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간 을 초과하도록 제어할 수 있다. 상기 전자 장치는, 차량에 탑재되는 주행 보조 장치일 수 있다. 상기 제어 방법은, 상기 객체의 타입 정보 및 거리 정보 중 적어도 하나에 기초하여 상기 차량을 제어하는 단계 를 더 포함할 수 있다. 거리 정보를 획득하는 단계는, 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 HDR 영상을 생성 하고, 상기 HDR 영상을 이용하여 상기 객체를 식별할 수 있다.전자 장치의 프로세서에 의해 실행되는 경우 상기 전자 장치가 동작을 수행하도록 하는 컴퓨터 명령을 저장하는 비일시적 컴퓨터 판독 가능 매체에 있어서, 상기 동작은, 제1 이미지 센서 및 제2 이미지 센서 각각의 노출 시 간을 상이하게 제어하여 복수의 촬영 이미지를 획득하는 제1 촬영 모드 및 상기 제1 이미지 센서 및 상기 제2 이미지 센서 각각의 노출 시간을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교번적으 로 수행하는 단계 및 상기 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 상기 제 2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 상기 식별된 객체의 거리 정보를 획득하는 단계를 포함 할 수 있다."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같이 본 개시의 다양한 실시 예에 따르면 전자 장치는 노출 시간이상이한 멀티 카메라를 통해 이미 지를 촬영하여 객체를 식별하는 정확도를 높일 수 있다. 또한, 전자 장치는 멀티 카메라의 시차를 통해 이미지를 촬영하여 식별된 객체의 정확한 거리 정보를 획득할 수 있다. 또한, 전자 장치는 2개의 카메라 만으로 상술한 객체 식별 및 객체의 거리 정보를 획득할 수 있다."}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시의 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도 면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하 려는 것이 아니며, 개시된 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이 해되어야 한다. 실시 예들을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되 어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. A 및/또는 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 어떤 구성요소와 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 이해를 돕기 위해 다양한 객체를 포함하는 주변 이미지를 획득하는 전자 장치를 나타내는 도 면이다. 도 1에 따르면, 본 개시의 일 실시 예에 따른 전자 장치는 복수의 이미지 센서(110-1, 110-2)를 이용하여 주변 환경을 모니터링할 수 있다. 여기서, 전자 장치는 차량에 탑재되는 주행 보조 장치로서, ADAS(Advanced Driver Assistance Systems)를 구현하는 장치일 수 있다. 구체적으로, 전자 장치는 차량의 전장 시스템으로 구현될 수도 있고, 차량 내부에 설치되는 카메라 모듈로 구현될 수도 있다. 또는, 전자 장치 는 룸 미러 일체형 모듈로 구현될 수도 있으며, 차량에 탈부착 가능한 블랙박스, 휴대폰, PDA 등과 같은 휴대 장치 형태로 구현될 수도 있다. 전자 장치는 복수의 이미지 센서(110-1, 110-2)를 이용하여 주변 환경, 전방 도로 상황 등을 촬영한 이미 지를 획득할 수 있다. 여기서, 이미지 센서는 주변 환경을 촬영하는 구성으로서 카메라, 센서, 촬영 센서 등으로 불릴 수 있으나 이하에서는 설명의 편의를 위해 이미지 센서로 통칭하도록 한다. 본 개시의 일 실시 예에 따른 전자 장치는 복수의 이미지 센서(110-1, 110-2) 각각을 통해 획득된 이미지 에 포함된 객체를 식별하고, 식별된 객체의 거리 정보를 획득할 수 있는데, 이하에서는 도면을 참조하여 본 개 시의 다양한 실시 예에 대해 자세히 설명하도록 한다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블럭도이다. 도 2에 따르면, 전자 장치는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)를 포함하는 이미지 센서 , 및 프로세서를 포함한다. 이미지 센서는 이미지를 획득하는 구성이다. 구체적으로, 이미지 센서는 렌즈를 통해 입사되는 빛을 전기적인 영상 신호로 변환하여 촬영 이미지를 획득할 수 있다. 이미지 센서는 CCD(Charge Coupled Device) 센서 또는 CMOS (Complementary Metal Oxide Semiconductor) 센서로 구현될 수 있으나, 이에 한정되는 것은 아니다. 한편, 이미지 센서의 노출 시간에 따라 상이한 밝기의 영상이 획득될 수 있다. 예를 들어, 노출 시간이 짧 은 경우 상대적으로 어두운 이미지가 획득되고, 노출 시간이 긴 경우 상대적으로 밝은 이미지가 획득될 수 있다. 여기서, 노출 시간은 이미지 센서에 연결된 셔터(미도시)가 빛을 수용하기 위해 개방된 시간을 의미 한다. 예를 들어, 주변 환경에 기초하여 이미지 센서의 노출 시간이 상이하게 조정될 수 있다. 일 예로, 주변 환 경이 어두운 경우 밝은 이미지를 획득하기 위하여 노출 시간을 상대적으로 길게 조정할 수 있다. 이 경우, 렌즈 를 통해 입사되는 빛의 세기를 센싱하거나, 기 촬영된 이미지의 픽셀 정보에 기초하여 주변 조도가 식별될 수 있다. 한편, 본 개시의 일 실시 예에 따른 이미지 센서는 차량에 탑재될 수 있다. 예를 들어, 제1 이미지 센서 (110-1) 및 제2 이미지 센서(110-2)는 서로 다른 촬영 시차를 가지도록 서로 이격 배치될 수 있다. 예를 들어, 룸 미러의 양 단에서 전방을 촬영하도록 배치될 수 있다. 다만, 제1 이미지 센서(110-1) 및 제2 이미지 센서 (110-2)는 룸 미러 뿐 아니라 기 설정된 간격으로 이격되어 다양한 위치에 배치될 수 있음은 물론이다. 일 예로, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)는 양 사이드 미러 중 어느 하나의 양단에 전방을 촬 영하도록 배치될 수 있다. 다른 예로, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)는 양 사이드 미러 각 각에서 전방을 촬영하도록 배치될 수 있다. 프로세서는 전자 장치의 전반적인 동작을 제어한다. 일 실시 예에 따라 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케 이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프로세서는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노출 시간을 상이하게 제어하여 복 수의 촬영 이미지를 획득하는 제1 촬영 모드 및 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노 출 시간을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교번적으로 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 기 설정된 프레임 간격으로, 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행할 수 있다. 예를 들어, 1 프레임 또는 2 프레임 이상의 간격으로 제1 촬영 모드 및 제2 촬영 모드를 교번 적으로 수행할 수 있다. 프로세서는 제1 촬영 모드에서 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)를 통해 획득된 복수의 촬영 이미지를 이용하여 객체를 식별할 수 있다. 구체적으로, 제1 촬영 모드에서 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)의 노출 시간은 상이하게 제 어되므로 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각으로부터 획득되는 이미지의 밝기는 상이할 수 있다. 프로세서가 하나의 밝기로 촬영된 이미지로부터 객체를 식별하는 경우보다, 다양한 밝기로 촬영 된 이미지에서 객체를 식별하는 경우 객체의 식별력이 높아질 수 있다. 따라서, 제1 촬영 모드에서, 프로세서 는 노출 시간이 서로 다르게 제어되는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각으로부터 획득된 복수의 촬영 이미지에서 다양한 객체를 정확하게 식별할 수 있다. 또는, 프로세서는 제1 이미지 센 서(110-1) 및 제2 이미지 센서(110-2) 각각으로부터 획득된 복수의 촬영 이미지를 하나의 이미지로 합성하고 합 성된 이미지에서 다양한 객체를 식별할 수도 있다. 여기서, 합성 이미지는 밝은 영역은 더 밝게 조정되고, 어두 운 영역은 더 어둡게 조정되어 명암비가 높은 이미지일 수 있다. 즉, 프로세서는 다이나믹 레인지(Dynamic Range)가 증가된 이미지에서 객체를 획득할 수 있다. 다시 말해, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각으로부터 획득된 복수의 촬영 이미지가 하 나의 이미지로 합성된 합성 이미지는 HDR(High Dynamic Range) 영상일 수 있다. 즉, 프로세서는 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 HDR 영상을 생성하고, HDR 영상을 이용하여 객체를 식별할 수있다. 여기서, HDR 영상이란 이미지에서 밝은 영역은 더 밝고, 어두운 영역은 더 어둡게 표시되어 이미지 상의 밝기의 범위가 확장된 영상을 의미할 수 있다. 여기서, 객체는 관심 객체(또는 관심 영역)일 수 있다. 즉, 프로세서는 획득된 복수의 촬영 이미지로부터 관심 객체를 식별할 수 있다. 예를 들어, 관심 객체는, 횡단 보도, 신호등, 교통 표지판, 사람, 차량 등과 같은 주행 시 주의할 필요가 있는 객체일 수 있으나, 이는 일 예에 불과하다. 저장부(미도시)는 관심 객체에 관한 정 보를 저장하고, 프로세서는 저장부로부터 이러한 정보를 획득하여 촬영 이미지에서 객체를 식별할 수 있다. 예를 들어, 촬영 이미지에 탐색 윈도우를 적용하여 저장부에 저장된 관심 객체 이미지의 픽셀 값과 유사 한 픽셀 값을 탐색하여 객체를 식별할 수 있다. 또는, 전자 장치는 객체 정보가 학습된 별도의 트레이닝 모델을 구비하고, 프로세서는 촬영 이미지를 트레이닝 모델에 적용하여 객체를 식별할 수도 있다. 이 경우, 트레이닝 모델은, 인공 신경망이나 뉴로모픽 (neuromorphic) 프로세서와 같은 인지 시스템으로 구현될 수 있다. 예를 들어, 제1 이미지 센서(110-1)에서 촬 영된 제1 이미지 및 제2 이미지 센서(110-2)에서 촬영된 제2 이미지에 동일한 트레이닝 모델이 적용될 수 있으 나, 제1 및 제2 이미지에 상이한 트레이닝 모델이 적용될 수도 있다. 예를 들어, 제1 및 제2 이미지의 픽셀 값 이 상이하므로 포함된 각 객체의 픽셀 값 또한 상이할 수 있다. 이에 따라 제1 이미지 센서(110-1)에서 촬영된 이미지와 유사한 픽셀 값을 가지는 샘플들로 트레이닝된 제1 트레이닝 모델을 제1 이미지에 적용하고, 제2 이미 지 센서(110-2)에서 촬영된 이미지와 유사한 픽셀 값을 가지는 샘플들로 트레이닝된 제2 트레이닝 모델을 제2 이미지에 적용하여 객체를 식별할 수 있다. 또한, 프로세서는 제1 이미지에서 식별된 객체 정보 및 제2 이미지에서 식별된 객체 정보를 취합하여 최종 적으로 객체를 식별할 수 있다. 예를 들어, 제1 이미지에서 제1 객체 및 제2 객체가 식별되고, 제2 이미지에서 제2 객체 및 제3 객체가 식별되면, 제1 내지 제3 객체가 최종적으로 식별된 객체가 될 수 있다. 한편, 프로세서는 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 식별된 객체의 거리 정보를 획득할 수 있다. 구체적으로, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)는 서로 이격되어 배치되므로 제1 이미지 센서 (110-1)를 통해 획득되는 이미지와 제2 이미지 센서(110-2)를 통해 획득되는 이미지 간 시차가 존재한다. 프로 세서는 이러한 시차를 이용하여 복수의 이미지에 포함된 객체의 거리 정보를 획득할 수 있다. 여기서, 객 체는 제1 촬영 모드에서 식별된 객체이다. 한편, 복수의 이미지 센서 간 시차를 이용하여 객체의 거리 정보를 산출하는 기술은 Stereo Disparity 기술에 해당하며, 이는 종래에 공지된 기술이므로 구체적인 설명은 생략하도 록 한다. 여기서, 제2 촬영 모드는, Stereo Disparity 기술을 통해 제1 촬영 모드에서 식별된 객체의 거리 정보를 획득하 기 위한 모드이므로, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)의 노출 시간을 상이하게 제어할 필요 는 없다. 한편, 프로세서는 제1 촬영 모드에서 제1 이미지 센서(110-1)의 노출 시간을 제1 노출 시간으로 제어하고, 제2 이미지 센서 (110-2)의 노출 시간을 제2 노출 시간으로 제어할 수 있다. 또한, 프로세서는 제2 촬영 모드에서 제1 이미지 센서(110-1)및 제2 이미지 센서(110-2)의 노출 시간을 제1 노출 시간으로 제어할 수 있다. 여기서, 제1 노출 시간은 제1 이미지 센서(110-1)로부터 획득되는 영상 정보에 기초하여 산출되는 시간이고, 제 2 노출 시간은 제2 이미지 센서(110-2)로부터 획득되는 영상 정보에 기초하여 산출되는 시간일 수 있다. 여기서, 영상 정보는 촬영 이미지의 픽셀 값, 촬영 이미지에 포함된 객체의 위치 정보, 감마 값, ISO(International Standards Organization) 게인 등을 포함할 수 있다. 제1 노출 시간 및 제2 노출 시간은 교 번적으로 수행되는 모드 마다 갱신될 수 있으며, 이에 관하여는 후술하도록 한다. 즉, 프로세서는 제2 촬영 모드에서 제2 이미지 센서(110-2)의 노출 시간을 제1 이미지 센서(110-1)의 노출 시간과 동일하게 제어할 수 있다. 구체적으로, 제2 촬영 모드에서, 프로세서는 제1 이미지 센서(110-1)로 부터 획득된 영상 정보에 기초하여 산출된 제1 노출 시간을 제2 이미지 센서(110-2)에도 적용할 수 있다. 이에 따라, 프로세서는 제2 촬영 모드에서 제2 이미지 센서(110-2)로부터 획득된 영상 정보에 기초한 노출 시간을 별도로 획득하지 않으므로 프로세서의 연산 량이 감소되는 효과가 있다. 한편, 제2 노출 시간은, 제1 노출 시간을 초과할 수 있다. 구체적으로, 제1 촬영 모드에서 제2 이미지 센서 (110-2)는 제1 이미지 센서(110-1) 보다 긴 노출 시간을 갖도록 설정되어 있으므로, 프로세서는 제1 이미지 센서(110-1)로부터 획득되는 이미지보다 제2 이미지 센서(110-2)로부터 밝은 이미지를 획득할 수 있다. 예를 들어, 제2 이미지 센서(110-2)의 타겟 픽셀 값이 제1 이미지 센서(110-1)의 타겟 픽셀 값보다 높게 설정되어 있 으므로, 제1 촬영 모드의 동일한 조도 환경에서 제2 이미지 센서(110-2)는 제1 이미지 센서(110-1)보다 상대적 으로 밝은 이미지를 획득할 수 있다. 여기서, 타겟 픽셀 값은 각 이미지 센서로부터 획득되는 촬영 이미지에 포 함되는 픽셀 값이 목표하는 픽셀 값일 수 있다. 이러한 타겟 픽셀 값에 도달하기 위해 프로세서는 각 이미 지 센서의 노출 시간을 갱신하며, 이에 관하여는 후술하도록 한다. 이에 따라, 동일한 조도 환경에서 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)가 촬영 이미지를 획득하 더라도 제2 이미지 센서(110-2)는 상대적으로 밝은 이미지를 획득할 수 있다. 프로세서는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)에 의해 획득된 촬영 이미지의 이전 영상 정보에 기초하여 제1 노출 시간 및 제2 노출 시간을 갱신할 수 있다. 구체적으로, 프로세서는 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 객체의 위치 정보 중 적어도 하나에 기초하여 제1 노출 시간을 갱신할 수 있다. 예를 들어, 프로세서는 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값의 평균 값(이하, 평균 픽셀 값)을 산출하고 산출된 평균 픽셀 값이 타겟 픽셀 값에 도달하도록 노출 시간을 제어할 수 있다. 여기서, 평균 픽셀 값은 Mean Value Algorithm을 이용하여 산출될 수 있다. Mean Value Algorithm은 공지된 기술이므로 자세한 설명은 생략하도록 한다. 타겟 픽셀 값은 기 저장되어 있거나 조도 환경 에 따라 변경될 수 있다. 일 예로, 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이미지의 평균 픽셀 값이 타겟 픽셀 값에 근접 한 경우, 제1 이미지 센서(110-1)의 노출 시간이 15ms인 경우를 상정한다. 제1 이미지 센서(110-1)에 의해 획득 된 적어도 하나의 이미지의 평균 픽셀 값이 상술한 예시보다 타겟 픽셀 값과 차이가 큰 경우, 프로세서는 제1 이미지 센서(110-1)의 노출 시간을 33ms로 갱신할 수 있다. 즉, 프로세서는 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이미지의 평균 픽셀 값 및 제1 이미지 센서(110-1)의 타겟 픽셀 값을 비교하여 제1 노출 시간을 갱신할 수 있다. 또는, 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이미지의 평균 픽셀 값에 대응되는 노출 시간 정보 가 저장부(미도시)에 저장되고, 프로세서는 산출된 평균 픽셀 값에 기초하여 저장부로부터 노출 시간 정보 를 획득하여 제1 노출 시간을 갱신할 수도 있다. 한편, 프로세서는 이미지에 포함된 객체의 위치 정보에 기초하여 노출 시간을 갱신할 수도 있다. 이미지의 평균 픽셀 값만을 이용하는 경우 특정 객체가 식별되지 않을 수도 있다. 예를 들어, 제1 이미지 센서(110-1)의 타겟 픽셀 값이 127이고 제1 이미지 센서(110-1)가 주변 환경을 촬영하는 상황이 역광 상황인 경우를 상정한다. 역광 상황에서 특정 객체는 어둡고 특정 객체의 주변은 밝은 상태의 이미지가 획득될 수 있다. 이 경우, 획득된 이미지의 평균 픽셀 값이 127에 근접하게 산출되어 프로세서는 제1 노출 시간을 짧게 갱신할 수 있다. 이 후, 프로세서는 갱신된 노출 시간에 따라 획득된 이미지에 포함된 특정 객체의 타입 등을 정확하게 식별하 지 못할 수도 있다. 따라서, 프로세서는 이미지에 포함된 객체의 위치 정보를 고려하여 노출 시간을 갱신 할 수 있다. 구체적으로, 프로세서는 이미지에 포함된 객체의 위치 정보에 기초하여 객체가 배치된 영역의 픽셀 값에 가중치를 부여할 수 있다. 예를 들어, 이미지에 포함된 객체가 이미지의 중앙 영역에 배치된 경우, 프로세서 는 중앙 영역의 픽셀 값에 가중치를 부여할 수 있다. 이에 따라, 프로세서는 중앙 영역에 위치한 객 체를 명확하게 식별할 수 있도록 제1 이미지 센서(110-1)의 노출 시간을 갱신할 수 있다. 한편, 프로세서는 제1 촬영 모드에서 제2 이미지 센서(110-2)에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 객체의 위치 정보 중 적어도 하나에 기초하여 제2 노출 시간을 갱신할 수 있다. 제2 이미지 센서(110-2)에 적용되는 제2 노출 시간 또한 제1 노출 시간과 동일한 방법으로 갱신될 수 있다. 다 만, 프로세서는 제1 촬영 모드에서 제2 이미지 센서(110-2)에 의해 촬영된 이미지의 영상 정보에 기초하여 제2 노출 시간을 갱신하는 점에서 상이하다. 즉, 프로세서는 제1 및 제2 촬영 모드에서 제1 이미지 센서 (110-1)로부터 촬영된 적어도 하나의 이전 이미지의 픽셀 값 및 객체의 위치 정보 중 적어도 하나에 기초하여 제1 노출 시간을 갱신하였으나, 제2 이미지 센서(110-1)로부터 촬영된 적어도 하나의 이전 이미지 중 제1 촬영 모드에서 획득된 이미지의 픽셀 값 및 객체의 위치 정보에 기초하여 제2 노출 시간을 갱신할 수 있다. 제2 이미 지 센서(110-2)는 촬영 모드에 따라 제1 이미지 센서(110-1)로부터 획득된 영상 정보에 기초하여 산출된 제1 노출 시간 및 제2 이미지 센서(110-2)로부터 획득된 영상 정보에 기초하여 산출된 제2 노출 시간을 교번적으로 이 용하여 이미지를 획득하기 때문이다. 프로세서는 상술한 실시 예와 같이, 제1 노출 시간 및 제2 노출 시간 은 독립적으로 산출하여 갱신할 수 있다. 한편, 프로세서는 기 설정된 프레임 간격으로, 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행할 수 있다. 구체적으로, 기 설정된 이벤트가 발생되지 않는 경우, 프로세서는 하나의 프레임 간격으로 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행할 수 있다. 예를 들어, 30fps(frame per second)를 기준으로 상정하 는 경우, 하나의 프레임 당 이미지 센서의 노출 시간은 33ms를 초과할 수 없다. 따라서, 프로세서는 이미지 센서에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 객체의 위치 정보 중 적어도 하나에 기초하여 33ms 내에서 노출 시간을 갱신할 수 있다. 한편, 기 설정된 이벤트가 발생되는 경우, 프로세서는 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초과하도록 제어할 수 있다. 여기서, 기 설정된 이벤트는, 제1 촬영 모드에서 제2 이미지 센서(110-2)에 의해 획득된 이미지에 포함된 픽셀 값이 기 설정된 값 미만인 이벤트 일 수 있다. 즉, 제2 이미 지 센서(110-2)에 의해 획득된 적어도 하나의 이전 이미지의 평균 픽셀 값이 기 설정된 값 미만인 경우, 프로세 서는 제2 이미지 센서(110-2)의 노출 시간을 하나의 프레임에 대응되는 시간 구간을 초과하도록 제어할 수 있다. 예를 들어, 주변 환경이 매우 어두운 조도 환경에서, 제2 이미지 센서(110-2)가 하나의 프레임 당 최대 노출 시 간으로 촬영 이미지를 획득하더라도 이미지에 포함된 객체를 식별하지 못할 수도 있다. 이 경우, 프로세서(12 0)는 프레임 당 최대 노출 시간을 초과하더라도 노출 시간을 길게 설정하여 노출 시간이 타겟 픽셀 값에 도달하 도록 제어할 수 있다. 이에 따라, 복수의 프레임 동안 제1 촬영 모드가 수행되고, 제1 이미지 센서(110-1)가 복 수의 촬영 이미지를 획득하는 동안 제2 이미지 센서(110-2)는 하나의 촬영 이미지를 획득할 수 있다. 이 경우 제2 이미지 센서(110-2)의 fps는 제1 이미지 센서(110-1)의 fps 보다 낮아질 수 있다. 이에 프로세서는 제 1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)로부터 서로 명암비가 높은 이미지를 획득할 수 있다. 한편, 프로세서는 상술한 실시 예와 같이, 제1 촬영 모드 및 제2 촬영 모드를 교대로 반복하여 2개의 이미 지 센서 만으로도 객체를 식별하고, 식별된 객체의 거리 정보를 획득할 수 있다. 한편, 프로세서는 객체의 타입 정보 및 거리 정보 중 적어도 하나에 기초하여 전자 장치가 탑재된 차 량을 제어할 수 있다. 예를 들어, 촬영 이미지에 포함된 객체가 최고 속도를 제한하는 교통 표지판으로 식별된 경우, 프로세서는 최고 속도를 초과하지 않도록 차량의 속도를 제어하거나, 촬영 이미지에 포함된 객체가 신호등인 경우, 신호등의 신호를 식별하여 차량을 제어할 수도 있다. 또는, 촬영 이미지에 포함된 객체의 거리 정보에 기초하여 객체의 거리 기 설정된 거리 미만인 경우, 차량을 제동시킬 수 있다. 전자 장치는 차량에 탑재되는 장치로 설명하였으나, 차량과 관계없이 객체를 식별하고 식별된 객체의 거리 정보를 산출하는데 이용되는 장치일 수도 있다. 한편, 도 2에서는 이미지 센서 및 프로세서를 포함하는 전자 장치를 기준으로 설명하였으나, 구 현 예에 따라서는 이미지 센서를 제외한 형태로 구현될 수도 있다. 이 경우, 전자 장치는 메모리 및/또는 프로세서로 구성되며, 촬영 이미지는 외부 이미지 센서와 연결된 인터페이스를 통해 획득할 수도 있다. 도 3은 본 개시의 일 실시 예에 따른 전자 장치의 세부 구성의 일 예를 나타내는 블럭도이다. 도 3a에 따르면, 전자 장치는 이미지 센서, 프로세서, 통신부, 저장부 및 센서(15 0)를 포함한다. 도 3a에 도시된 구성 중 도 2에 도시된 구성과 중복되는 부분에 대해서는 자세한 설명을 생략하 도록 한다. 프로세서는 저장부에 저장된 각종 프로그램을 이용하여 전자 장치의 동작을 전반적으로 제어한 다. 구체적으로, 프로세서는 RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스(124-1 ~ 124-n), 버 스를 포함한다. RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스(124-1 ~ 124-n) 등은 버스를 통해 서로 연결 될 수 있다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 저장부에 저장된 O/S를 RAM에 복사하고, O/S를 실행시 켜 시스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 저장부에 저장된 각종 어플리케이션 프로그램 을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 메인 CPU는 저장부에 액세스하여, 저장부에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고, 저장부에 저장된 각종 프로그램, 컨텐츠 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스(124-1 내지 124-n)는 상술한 각종 구성 요소들과 연결된다. 인터페이스들 중 하나는 네 트워크를 통해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 통신부는 외부 전자 장치(미도시) 또는 외부 서버(미도시)와 통신을 수행할 수 있다. 일 예로, 통신부 는 유/무선 통신 방식에 따라 외부 서버와 통신을 수행할 수 있는데, BT(BlueTooth), WI-FI(Wireless Fidelity), Zigbee, IR(Infrared), Serial Interface, USB(Universal Serial Bus), NFC(Near Field Communication), V2X(Vehicle to Everything), 이동통신(Cellular) 등과 같은 통신 방식을 이용할 수 있다. 통신부는 객체 정보를 외부 서버로부터 수신할 수도 있다. 또한, 통신부는 프로세서의 제어에 따라 차량 제어부(미도시)로 제어 명령을 전송할 수도 있다. 예를 들어, 촬영 이미지에 포함된 객체의 타입 정 보 및 거리 정보 중 적어도 하나에 기초하여 프로세서의 제어에 따라 통신부는 차량 속도에 관한 명 령, 차량 제동에 관한 명령 등을 차량 제어부로 전송할 수 있다. 한편, 전자 장치에 이미지 센서가 구비되지 않은 경우, 통신부는 외부 이미지 센서로부터 획득된 촬 영 이미지를 수신할 수도 있다. 저장부는 전자 장치를 구동/제어하기 위한 다양한 데이터, 프로그램 또는 어플리케이션을 저장할 수 있다. 저장부는 전자 장치 및 프로세서의 제어를 위한 제어 프로그램, 제조사에서 최초 제공되 거나 외부에서부터 다운로드 받은 어플리케이션, 데이터베이스들 또는 관련 데이터들을 저장할 수 있다. 특히, 저장부는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)로부터 획득된 복수의 촬영 이미지를 저장할 수 있다. 저장부에 저장된 복수의 촬영 이미지는 프로세서가 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)의 노출 시간을 갱신하는 과정에서 이용될 수 있다. 또한, 저장부는 이미지 센서에 의해 획득된 이미지의 평균 픽셀 값에 대응되는 노출 시간 정보를 룩 업 테이블의 형태로 저장할 수 있다. 또한, 저장부는 관심 영역 및 관심 객체 중 적어도 하나에 관한 정보를 저장할 수 있다. 예를 들어, 저장 부는 교통 표지판의 형태 정보, 신호등의 형태 정보 등을 저장할 수 있다. 저장부에 저장된 형태 정 보는 프로세서가 촬영 이미지에 포함된 객체를 식별하는데 이용될 수 있다. 다만, 전자 장치는 형태 정보가 학습된 별도의 트레이닝 모델을 구비하고, 촬영 이미지를 트레이닝 모델에 적용하여 객체를 식별할 수도 있다. 이 경우, 트레이닝 모델은, 인공 신경망이나 뉴로모픽(neuromorphic) 프로세서와 같은 인지 시스템으로 구현될 수 있다. 저장부는 프로세서에 포함된 롬(ROM), 램(RAM) 등의 내부 메모리로 구현되거나, 프로세서와 별 도의 메모리로 구현될 수도 있다. 저장부는 비휘발성 메모리, 휘발성 메모리, 하드 디스크 드라이브(HDD) 또는 솔리드 스테이트 드라이브(SSD) 등과 같은 형태로 구현될 수 있다. 센서는 다양한 형태의 입력을 감지할 수 있다. 구체적으로, 센서는 사용자의 터치를 감지하는 터치 센서일 수도 있으며, 그 밖에도 본 개시에 따른 센서는 조도 센서, 모션 센서 등과 같은 다양한 센서를 포 함할 수 있다. 상술한 전자 장치는 독자적으로 이용될 수 있으나, RADAR(RAadio Detection And Ranging) 유닛, LIDAR(LIght Detection And Ranging) 유닛과 함께 특정 객체를 식별하고 식별된 객체의 거리 정보를 산출하는데 이용될 수도 있다. 여기서, RADAR 유닛은 무선 신호를 이용하여 차량이 위치해 있는 환경 내의 물체들을 감지하 도록 구성되는 센서일 수 있다. 또한, RADAR 유닛은, 물체들의 속도 및/또는 방향을 감지하도록 구성될 수 있다. LIDAR 유닛은 레이저를 이용하여 차량이 위치해 있는 환경 내의 물체들을 감지하도록 구성되는 센서일 수 있다. 전자 장치는 추가적으로 디스플레이(미도시)를 포함할 수도 있다. 디스플레이는 이미지 센서로부터 획득된 촬영 이미지를 디스플레이할 수 있다. 또한, 디스플레이는 차량 운행 정보 등을 포함하는 다양한 컨텐츠를 디스플레이 한다. 여기서, 차량 운행 정보는, 차량의 현재 속도, 차 량이 현재 주행 중인 도로의 제한 속도, 교통 표지판 정보 등을 포함할 수 있다. 디스플레이는 LCD(liquid crystal display), OLED(organic light-emitting diode), LCoS(Liquid Crystal on Silicon), DLP(Digital Light Processing), QD(quantum dot), 마이크로 LED(Micro light-emitting diode) 디 스플레이 등과 같은 다양한 형태로 구현될 수 있다. 특히, 디스플레이는 터치패드와 상호 레이어 구조를 이루는 터치 스크린 형태로 구현될 수 있다. 이 경우, 디스플레이는 출력 장치 이외에 사용자 인터페이스(미도시)로 사 용될 수 있게 된다. 여기서, 터치스크린은 터치 입력 위치 및 면적뿐만 아니라 터치 입력 압력까지도 검출할 수 있도록 구성될 수 있다. 다만, 전자 장치는 디스플레이를 별도로 포함하지 않을 수 있으며, 인터페이스(미도시)를 통해 외부 디스 플레이 장치와 연결되어 다양한 컨텐츠에 대응되는 신호를 외부 디스플레이 장치로 전송할 수도 있다. 도 3b는 본 개시의 일 실시 예에 따른 이미지 센서의 일 예를 나타내기 위한 도면이다. 본 개시의 일 실시 예에 따라, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각은 별도의 프로세서와 연결된 경우를 상정하고, 프로세서는 어플리케이션 프로세서(Application Processor, AP)로 구현되는 경우를 상 정하여 설명한다. 제1 이미지 센서(110-1)에 연결된 어플리케이션 프로세서는 제1 어플리케이션 프로세서(120-1)로, 제2 이미지 센서(110-2)에 연결된 어플리케이션 프로세서는 제2 어플리케이션 프로세서(120-2)로 명명한다. 여기서, 어플리 케이션 프로세서(120-1, 120-2)는, 각 이미지 센서(110-1, 110-2)의 영상 정보에 기초하여 노출 시간을 갱신하 고, 갱신된 노출 시간을 각 이미지 센서(110-1, 110-2)에 적용하여 촬영 이미지를 획득할 수 있다. 구체적으로, 제1 어플리케이션 프로세서(120-1)는 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이전 이미지의 영상 정보에 기초하여 제1 노출 시간을 갱신하고, 갱신된 제1 노출 시간 정보를 내부 인터페이스(미도 시)를 통해 제2 어플리케이션 프로세서(120-2)로 전송할 수 있다. 여기서, 내부 인터페이스는 유선 케이블로 구 현될 수 있다. 다만, 이에 한정되는 것은 아니며 내부 인터페이스는, BT(BlueTooth), WI-FI(Wireless Fidelity) 등과 같은 무선 통신 모듈로 구현될 수도 있다. 제2 어플리케이션 프로세서(120-2)는 수신된 제1 노 출 시간 정보에 기초하여 제1 촬영 모드에서 제2 이미지 센서(110-2)의 노출 시간을 제어하여 촬영 이미지를 획 득할 수 있다. 다른 실시 예에 따르면, 제1 어플리케이션 프로세서(120-1)는 제1 노출 시간 정보를 외부 인터페이스를 통해서 제2 어플리케이션 프로세서(120-2)로 전송할 수도 있다. 도 4는 본 개시의 일 실시 예에 따른 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행하는 동작을 설명하기 위한 도면이다. 도 4에 따르면, 전자 장치는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노출 시간을 상이 하게 제어하여 복수의 촬영 이미지(405, 410)를 획득하는 제1 촬영 모드를 수행할 수 있다. 제1 촬영 모드에서 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)의 노출 시간은 상이하게 제어되므로, 도 4와 같이, 제1 이미지 센서(110-1)로부터 획득되는 이미지 및 제2 이미지 센서(110-2)로부터 획득되는 이 미지의 밝기는 상이할 수 있다. 구체적으로, 전자 장치는 제1 촬영 모드에서 제1 이미지 센서(110- 1)의 노출 시간을 제1 노출 시간(예를 들어, 5ms)으로 제어하고, 제2 이미지 센서(110-2)의 노출 시간을 제2 노 출 시간(예를 들어, 30ms)으로 제어할 수 있다. 여기서, 제2 노출 시간은 제1 노출 시간을 초과하므로 제2 이미 지 센서(110-2)로부터 획득되는 이미지는 제1 이미지 센서(110-1)로부터 획득되는 이미지보다 밝은 이미지일 수 있다. 전자 장치는 제1 촬영 모드에서 획득된 복수의 촬영 이미지(405, 410)에서 객체를 식별할 수 있다. 전자 장치는 하나의 밝기로 촬영된 이미지로부터 객체를 식별하는 경우보다, 다양한 밝기로 촬영된 이미지에서 객체를 식별하는 경우 객체의 식별력이 높아질 수 있다. 전자 장치는 제1 이미지 센서(110-1)로부터 획득되는 이미지 및 제2 이미지 센서(110-2)로부터 획득 되는 이미지에서 서로 다른 객체를 식별할 수 있다. 도 4에서와 같이, 전자 장치는, 제1 이미지 센서(110- 1)로부터 획득되는 이미지에서 신호등 영역을 식별할 수 있으나, 제2 이미지 센서(110-2)로부터 획득되는 이미지에서는 이를 식별할 수 없다. 반면, 전자 장치는, 제2 이미지 센서(110-2)로부터 획득되는 이미지 에서 복수의 차량을 식별할 수 있으나, 제1 이미지 센서(110-1)로부터 획득되는 이미지에서는 하나의차량만을 식별할 수 있다. 이는, 하나의 밝기로 촬영된 이미지로부터 객체를 식별하는 경우보다, 다양한 밝기로 촬영된 이미지에서 객체를 식별하는 경우 객체의 식별력이 높아질 수 있기 때문이다. 전자 장치는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노출 시간을 동일하게 제어하여 복수의 촬영 이미지(415, 420)를 획득하는 제2 촬영 모드를 수행할 수 있다. 여기서, 전자 장치는 제2 이 미지 센서(110-2)의 노출 시간을 제1 이미지 센서(110-1)의 노출 시간과 동일하게 제어할 수 있다. 따라서, 도 4와 같이, 제1 이미지 센서(110-1)로부터 획득되는 이미지 및 제2 이미지 센서(110-2)로부터 획득되는 이 미지는 동일한 밝기일 수 있다. 이에 따라, 전자 장치는 제2 촬영 모드에서 제2 이미지 센서(110-2)로부터 획득된 영상 정보에 기초한 노 출 시간을 별도로 획득하지 않으므로 전자 장치의 연산 량이 감소되는 효과가 있다. 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)는 서로 이격되어 배치되므로 제1 이미지 센서(110-1)를 통 해 획득되는 이미지와 제2 이미지 센서(110-2)를 통해 획득되는 이미지 간 시차가 존재한다. 전자 장 치는 이러한 시차를 이용하여 복수의 촬영 이미지(405, 410)에 포함된 객체의 거리 정보를 획득할 수 있다. 여기서, 객체는 제1 촬영 모드의 복수의 이미지(405, 410)에서 식별된 모든 객체를 의미한다. 한편, 전자 장치는 프레임 별로 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 제2 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초 과하는 동작을 설명하기 위한 도면이다. 일반적으로, 전자 장치는 도 4와 같이, 하나의 프레임 간격으로 제1 촬영 모드 및 제2 촬영 모드를 교번적 으로 수행할 수 있다. 다만, 제2 이미지 센서(110-2)에 의해 획득된 적어도 하나의 이전 이미지의 평균 픽셀 값이 기 설정된 값 미만 인 경우, 전자 장치는 제2 이미지 센서(110-2)의 노출 시간을 하나의 프레임에 대응되는 시간 구간을 초과 하도록 제어할 수 있다. 예를 들어, 주변 환경이 매우 어두운 조도 환경에서, 제2 이미지 센서(110-2)가 하나의 프레임 당 최대 노출 시 간으로 촬영 이미지를 획득하더라도 이미지에 포함된 객체를 식별하지 못할 수도 있다. 이 경우, 전자 장치 는 도 5와 같이, 프레임 당 최대 노출 시간을 초과하도록 노출 시간을 길게 설정하여 타겟 픽셀 값을 갖는 이미지를 획득할 수 있다. 이에 따라, 복수의 프레임 동안 제1 촬영 모드가 수행되어 제1 이미지 센서(110-1)가 복수의 촬영 이미지(505, 510)를 획득하는 동안 제2 이미지 센서(110-2)는 하나의 촬영 이미지를 획득할 수 있다. 즉, 제1 이미지 센서(110-1)가 촬영 이미지를 획득하는 동안 제2 이미지 센서(110-2)에 연결된 셔터의 노출이 계속되어 제2 이미지 센서(110-2)는 노출 시간이 상대적으로 길게 조정된 상태에서 하나의 촬영 이미지를 획득할 수 있다. 이 경우 제2 이미지 센서(110-2)의 fps는 제1 이미지 센서(110-1)의 fps 보다 낮아질 수 있다. 이후, 전자 장치는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노출 시간을 동일하게 제어 하여 복수의 촬영 이미지(520, 525)를 획득하는 제2 촬영 모드를 수행하고, 이에 따라 복수의 촬영 이미지(520, 525)에 포함된 객체의 거리 정보를 획득할 수 있다. 도 5에서는 제1 이미지 센서(110-1)의 노출 시간을 2개의 프레임에 대응되는 시간 구간으로 설명하였으나, 조도 상황에 따라 노출 시간은 3개 이상의 프레임에 대응되는 시간 구간이 될 수도 있다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 전자 장치는, 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노출 시간을 상이하게 제어하여 복수 의 촬영 이미지를 획득하는 제1 촬영 모드 및 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각의 노출 시간을 동일하게 제어하여 복수의 촬영 이미지를 획득하는 제2 촬영 모드를 교번적으로 수행할 수 있다(S610). 구체적으로, 전자 장치는, 제1 촬영 모드에서 제1 이미지 센서(110-1)의 노출 시간을 제1 노출 시간으로 제어하 고, 제2 이미지 센서(110-2)의 노출 시간을 제2 노출 시간으로 제어할 수 있다. 또한, 전자 장치는, 제2 촬영 모드에서 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)의 노출 시간을 제1 노출 시간으로 제어할 수 있다. 즉, 전자 장치는 제2 촬영 모드에서 제2 이미지 센서(110-2)의 노출 시간을 제1이미지 센서(110-1)의 노출 시간과 동일하게 제어할 수 있다. 이에 따라, 전자 장치는 제2 촬영 모드에서 제2 이미지 센서(110-2)로부터 획득된 영상 정보에 기초한 노출 시간을 별도로 획득하지 않으므로 전자 장치의 연산 량이 감소되는 효과가 있다. 여기서, 제2 노출 시간은, 제1 노출 시간을 초과할 수 있다. 구체적으로, 제1 촬영 모드에서 제2 이미지 센서 (110-2)는 제1 이미지 센서(110-1) 보다 긴 노출 시간을 갖도록 설정되어 전자 장치는, 제1 이미지 센서(110- 1)로부터 획득되는 이미지보다 밝은 이미지를 획득할 수 있다. 한편, 전자 장치는, 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이전 이미지에 포함된 픽셀 값 및 객 체의 위치 정보 중 적어도 하나에 기초하여 제1 노출 시간을 갱신할 수 있다. 예를 들어, 전자 장치는 제1 이미지 센서(110-1)에 의해 획득된 적어도 하나의 이전 이미지에 포함된 평균 픽셀 값을 산출하고 산출된 평균 픽셀 값이 타겟 픽셀 값에 도달하도록 노출 시간을 제어할 수 있다. 또는, 제1 이미지 센서(110-1)에 의해 획득 된 적어도 하나의 이미지의 평균 픽셀 값에 대응되는 노출 시간 정보가 저장되고, 전자 장치는 산출된 평균 픽 셀 값에 기초하여, 저장된 노출 시간 정보를 획득하여 제1 노출 시간을 갱신할 수도 있다. 또한, 전자 장치는, 제1 촬영 모드에서 제2 이미지 센서(110-2)에 의해 획득된 적어도 하나의 이전 이미지에 포 함된 픽셀 값 및 객체의 위치 정보 중 적어도 하나에 기초하여 제2 노출 시간을 갱신할 수 있다. 제2 이미지 센서(110-2)에 적용되는 제2 노출 시간 또한 제1 노출 시간과 동일한 방법으로 갱신될 수 있다. 다 만, 전자 장치는 제1 촬영 모드에서 제2 이미지 센서(110-2)에 의해 촬영된 이미지의 영상 정보에 기초하 여 제2 노출 시간을 갱신할 수 있다. 한편, 전자 장치는, 기 설정된 프레임 간격으로, 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행할 수 있다. 여기서, 기 설정된 프레임 간격은 하나의 프레임 간격일 수 있다. 다만, 제1 촬영 모드에서 제2 이미지 센서(110-2)에 의해 획득된 이미지에 포함된 픽셀 값이 기설정된 값 미만 이면, 제2 이미지 센서(110-2)의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초과하도록 제어할 수 있 다. 전자 장치는, 제1 촬영 모드에서 획득된 복수의 촬영 이미지를 이용하여 객체를 식별하고, 제2 촬영 모드에서 획득된 복수의 촬영 이미지에 기초하여 식별된 객체의 거리 정보를 획득할 수 있다(S620). 전자 장치는 하나의 밝기로 촬영된 이미지로부터 객체를 식별하는 경우보다, 다양한 밝기로 촬영된 이미지 에서 객체를 식별하는 경우 객체의 식별력이 높아질 수 있다. 따라서, 제1 촬영 모드에서, 전자 장치는 노 출 시간이 서로 다르게 제어되는 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2) 각각으로부터 획득된 복수 의 촬영 이미지에서 다양한 객체를 정확하게 식별할 수 있다. 제1 이미지 센서(110-1) 및 제2 이미지 센서(110-2)는 서로 이격되어 배치되므로 제1 이미지 센서(110-1)를 통 해 획득되는 이미지와 제2 이미지 센서(110-2)를 통해 획득되는 이미지 간 시차가 존재한다. 전자 장치는 이러한 시차를 이용하여 복수의 이미지에 포함된 객체의 거리 정보를 획득할 수 있다. 한편, S620 단계는, S610 단계 이후에 수행되거나 S610 단계와 동시에 수행될 수도 있다. 한편, 상술한 전자 장치는, 차량에 탑재되는 주행 보조 장치일 수 있다. 구체적으로, 전자 장치는, ADAS(Advanced Driver Assistance Systems)를 구현하는 장치일 수 있다. 예를 들어, 전자 장치는 차량의 전장 시스템으로서, 차량 내부에 설치되는 카메라 모듈, 룸 미러 일체형 모듈 또는 차량에 탈부착 가능한 블랙박스 등으로 구현될 수도 있다. 전자 장치는, 객체의 타입 정보 및 거리 정보 중 적어도 하나에 기초하여 차량을 제어할 수 있다. 한편, 전자 장치는 이미지 센서 및 프로세서를 포함하는 장치를 기준으로 설명하였으나, 구현 예에 따라서는 이미지 센서를 제외한 형태로 구현될 수도 있다. 이 경우, 전자 장치는 메모리 및/또는 프로세서 로 구성되며, 촬영 이미지는 외부 이미지 센서와 연결된 인터페이스를 통해 획득할 수도 있다. 각 단계의 상세 동작에 대해서는 상술한 바 있으므로 자세한 설명은 생략하도록 한다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법들 중 적어도 일부 구성은 기존 전자 장치에 설치 가능하 며, OS 상에서 사용자가 직접 사용하게 되는 소프트웨어인 어플리케이션 형태로 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들에 따른 방법들 중 적어도 일부 구성은, 기존 전자 장치에 대한 소프 트웨어 업그레이드, 또는 하드웨어 업그레이드 만으로도 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들은 전자 장치에 구비된 임베디드 서버, 또는 전자 장치 및 디스플레이 장치 중 적어도 하나의 외부 서버를 통해 수행되는 것도 가능하다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기 기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시 예들에 따른 전자 장치(예: 전자 장치(A))를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임 시적으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어 (hardware) 또는 이들의 조합을 이용하여 컴퓨터(computer) 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 일부 경우에 있어 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있 다. 소프트웨어적인 구현에 의하면, 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨 어 모듈들로 구현될 수 있다. 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 동작을 수행할 수 있다. 한편, 상술한 다양한 실시 예들에 따른 기기의 프로세싱 동작을 수행하기 위한 컴퓨터 명령어(computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium) 에 저장될 수 있 다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었 을 때 상술한 다양한 실시 예에 따른 기기에서의 처리 동작을 특정 기기가 수행하도록 한다. 비일시적 컴퓨터 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반영구 적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 비일시적 컴퓨터 판독 가능 매체의 구체적인 예로는, CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등이 있을 수 있다. 일 실시 예에 따르면, 본 개시의 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM, 앱스토어TM)를 통해 온라인으로 배포될 수 있다. 온라 인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작 들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생 략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2018-0136333", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2018-0136333", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 이해를 돕기 위해 다양한 객체를 포함하는 주변 이미지를 획득하는 전자 장치를 나타내는 도 면이다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블럭도이다. 도 3은 본 개시의 일 실시 예에 따른 전자 장치의 세부 구성의 일 예를 나타내는 블럭도이다. 도 4는 본 개시의 일 실시 예에 따른 제1 촬영 모드 및 제2 촬영 모드를 교번적으로 수행하는 동작을 설명하기 위한 도면이다. 도 5는 본 개시의 일 실시 예에 따른 제2 이미지 센서의 노출 시간이 하나의 프레임에 대응되는 시간 구간을 초 과하는 동작을 설명하기 위한 도면이다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다."}
