{"patent_id": "10-2023-0127738", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057992", "출원번호": "10-2023-0127738", "발명의 명칭": "광고를 출력하는 디스플레이 장치를 휴대한 사용자의 사용자 단말과 통신을 수행하는 서버의", "출원인": "아크로 주식회사", "발명자": "권인영"}}
{"patent_id": "10-2023-0127738", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "광고를 출력하는 디스플레이 장치를 휴대한 사용자의 사용자 단말과 통신을 수행하는 서버의 제어 방법에 있어서,상기 서버가, 상기 사용자 단말의 위치 및 구역 별 유동 인구와 관련된 실시간 데이터를 바탕으로, 적어도 하나의 후보 경로를 획득하는 단계;상기 서버가, 상기 후보 경로에 대한 정보를 상기 사용자 단말로 전송하는 단계; 및상기 후보 경로를 대상 경로로 선택하는 사용자 입력이 수신되면, 상기 서버가, 상기 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 적어도 하나의 광고 및 상기 대상 경로를 바탕으로 상기 사용자의 미션을 생성하는 단계; 및상기 사용자의 미션이 생성되면, 상기 서버가, 상기 디스플레이 장치를 통해 상기 광고를 출력하는 단계;를 포함하는, 서버의 제어 방법."}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디스플레이 장치를 휴대한 사용자의 사용자 단말과 통신을 수행하는 서버의 제어 방법이 개시된다. 본 제어 방법 은, 서버가, 사용자 단말의 위치 및 구역 별 유동 인구와 관련된 실시간 데이터를 바탕으로, 적어도 하나의 후보 경로를 획득하는 단계, 서버가, 후보 경로에 대한 정보를 사용자 단말로 전송하는 단계, 후보 경로를 대상 경로 로 선택하는 사용자 입력이 수신되면, 서버가, 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 적어도 하 나의 광고 및 대상 경로를 바탕으로 사용자의 미션을 생성하는 단계를 포함한다."}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 광고 플랫폼을 제공하는 서버의 제어 방법에 관한 것으로, 보다 상세하게는, 광고를 출력하는 디스플 레이 장치를 휴대한 상태로 이동하는 사용자를 지원하고 모니터링하는 서버의 제어 방법에 관한 것이다."}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인쇄광고 산업의 하향세가 뚜렷하게 나타나고 있는 상태에서, 광고 시장은 디지털 중심으로 재편되고 있다. 다만, 온전히 디지털 콘텐츠로만 제공되는 광고의 경우 그 채널의 종류에 한계가 있으며 이미 진입장벽이 매우 높은 상태이다. 따라서, 비대면이 강조되는 추세, 디지털 콘텐츠의 채널의 한계 등을 극복할 수 있는 전혀 새로운 유형의 광고 패러다임이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1539774호"}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 디지털 콘텐츠의 출력과 오프라인 광고가 결합된 새로운 광고 플랫폼을 제공하는 서버의 제어 방법을 제공한다. 본 개시의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 개시의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 개시의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예에 따라 광고를 출력하는 디스플레이 장치를 휴대한 사용자의 사용자 단말과 통신을 수행 하는 서버의 제어 방법은, 상기 서버가, 상기 사용자 단말의 위치 및 구역 별 유동 인구와 관련된 실시간 데이 터를 바탕으로, 적어도 하나의 후보 경로를 획득하는 단계, 상기 서버가, 상기 후보 경로에 대한 정보를 상기 사용자 단말로 전송하는 단계, 상기 후보 경로를 대상 경로로 선택하는 사용자 입력이 수신되면, 상기 서버가, 상기 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 적어도 하나의 광고 및 상기 대상 경로를 바탕으로 상기 사용자의 미션을 생성하는 단계, 상기 사용자의 미션이 생성되면, 상기 서버가, 상기 디스플레이 장치를 통해 상기 광고를 출력하는 단계를 포함한다. 상기 서버의 제어 방법은, 상기 광고가 출력되는 동안, 상기 사용자 단말이 상기 대상 경로의 목적지에 도달한 경우, 상기 미션이 완료된 것으로 식별하는 단계, 상기 미션이 완료된 것으로 식별되면, 상기 사용자에 대하여 상기 미션에 매칭되는 보상을 등록하는 단계를 포함할 수 있다. 상기 서버의 제어 방법은, 상기 생성된 미션이 완료되지 않은 상태에서, 상기 디스플레이 장치의 위치와 상기 사용자 단말 간의 위치가 일정 거리 이상 멀어지는 경우, 상기 사용자에 대하여 페널티를 등록하는 단계를 포함 할 수 있다. 상기 서버의 제어 방법은, 상기 페널티를 바탕으로 상기 사용자에 대한 신뢰도를 업데이트하는 단계, 상기 신뢰 도를 바탕으로 상기 사용자의 미션 수행과 관련된 최대 이동 거리를 설정하는 단계, 상기 최대 이동 거리보다 짧은 적어도 하나의 후보 경로에 대한 정보를 상기 사용자 단말로 전송하는 단계를 포함할 수 있다. 상기 서버의 제어 방법은, 상기 서버가, 상기 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 복수의 광 고에 대한 정보를 상기 사용자 단말로 제공하는 단계를 포함할 수 있다. 그리고, 상기 미션을 생성하는 단계는, 상기 복수의 광고 중 적어도 하나의 광고를 선택하는 사용자 입력에 따라, 상기 선택된 광고 및 상기 대상 경로 를 바탕으로 상기 미션을 생성할 수 있다. 상기 후보 경로를 획득하는 단계는, 상기 사용자 단말의 현재 위치, 현재 시각, 및 각 구역의 시간대 별 유동 인구를 바탕으로, 적어도 하나의 후보 경로를 획득할 수 있다. 상기 서버의 제어 방법은, 상기 서버가, 미션을 수행 중인 복수의 사용자 각각의 위치를 실시간으로 식별하는 단계를 포함할 수 있다. 그리고, 상기 후보 경로를 획득하는 단계는, 구역 별 유동 인구 및 상기 복수의 사용자 각각의 위치를 바탕으로, 상기 사용자를 위한 후보 경로를 획득할 수 있다. 상기 서버의 제어 방법은, 상기 서버가, 각 구역에 포함된 복수의 점포 각각의 점포 단말로부터 유동 인구에 대 한 데이터를 실시간으로 수신하는 단계를 포함할 수도 있다. 본 개시의 일 실시 예에 따른 사용자 단말의 제어 방법은, 상기 사용자 단말이, 상기 사용자 단말의 위치 및 구 역 별 유동 인구와 관련된 실시간 데이터를 바탕으로, 적어도 하나의 후보 경로를 획득하는 단계, 상기 사용자 단말이, 상기 후보 경로에 대한 정보를 제공하는 단계, 상기 후보 경로를 대상 경로로 선택하는 사용자 입력이 수신되면, 상기 사용자 단말이, 상기 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 적어도 하나의 광 고 및 상기 대상 경로를 바탕으로 상기 사용자의 미션을 생성하는 단계를 포함한다. 본 개시의 일 실시 예에 따라 광고 플랫폼을 제공하는 시스템은, 광고를 출력하는 디스플레이 장치, 상기 디스 플레이 장치와 통신을 수행하고, 상기 디스플레이 장치를 휴대한 사용자의 사용자 단말과 통신을 수행하는 서버 를 포함한다. 상기 서버는, 상기 사용자 단말의 위치 및 구역 별 유동 인구와 관련된 실시간 데이터를 바탕으로, 적어도 하나의 후보 경로를 획득하고, 상기 후보 경로에 대한 정보를 상기 사용자 단말로 전송하고, 상기 사용자 단말을 통해 상기 후보 경로를 대상 경로로 선택하는 사용자 입력이 수신되면, 상기 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 적어도 하나의 광고 및 상기 대상 경로를 바탕으로 상기 사용자의 미 션을 생성하고, 상기 사용자의 미션이 생성되면, 상기 디스플레이 장치를 통해 상기 광고를 출력한다."}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 서버의 제어 방법은, 디스플레이 장치의 휴대성과 사용자 단말 조작의 편의성이 접목된 광고 플 랫폼을 지원하는 것으로, 광고를 제공하는 사용자는 원하는 시간에 디스플레이 장치를 대여하여 도보 등으로 이 동하면서 미션을 수행할 수 있어, 광고주 및 사용자에게 모두 이익이 되는 새로운 광고 패러다임을 제시한다."}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에 대하여 구체적으로 설명하기에 앞서, 본 명세서 및 도면의 기재 방법에 대하여 설명한다. 먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 개시의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당해 기술 분야에 종사하는 기술자의 의도나 법률적 또는 기 술적 해석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어 도 있다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으 면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성요소를 모두 도시되어 있다 고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 \"제1\", \"제2\" 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성요소들을 서로 구별하기 위하여 사용하는 것이며 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안 된다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한되어서는 안 된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 실시 예에서 \"모듈\", \"유닛\", \"부(part)\" 등과 같은 용어는 적어도 하나의 기능이나 동작을 수행하는 구성요소를 지칭하기 위한 용어이며, 이러한 구성요소는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\", \"유닛\", \"부(part)\" 등은 각각이 개별적인 특정 한 하드웨어로 구현될 필요가 있는 경우를 제외하고는, 적어도 하나의 모듈이나 칩으로 일체화되어 적어도 하나 의 프로세서로 구현될 수 있다. 또한, 본 개시의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것 을 의미한다.이하에서, 첨부된 도면을 이용하여 본 발명의 다양한 실시 예들에 대하여 구체적으로 설명한다. 도 1은 본 개시의 일 실시 예에 따라 사용자의 디스플레이 장치, 사용자 단말과 통신을 수행하는 서버의 동작을 설명하기 위한 도면이다. 도 1을 참조하면, 서버는 적어도 한 명의 사용자의 디스플레이 장치 및 사용자 단말과 통신 을 수행할 수 있다. 서버는 본 개시에 따른 광고 플랫폼을 운영하는 서비스 제공자의 장치로, 적어도 하나의 애플리케이션 및/ 또는 웹 페이지를 통해 디스플레이 장치, 사용자 단말과 통신을 수행할 수 있다. 서버는 적어도 하나의 컴퓨터 내지는 시스템으로 구성될 수 있다. 서버는 메모리, 통신부, 프로세서 등을 포함할 수 있다. 메모리는 서버 내 구성요소들의 전반적인 동작을 제어하기 위한 운영체제(OS: Operating System), 적어도 하나 의 인스트럭션 및 데이터를 저장하기 위한 구성이다. 메모리는 ROM, 플래시 메모리 등의 비휘발성 메모리를 포 함할 수 있으며, DRAM 등으로 구성된 휘발성 메모리를 포함할 수 있다. 또한, 메모리는 하드 디스크, SSD(Solid state drive) 등을 포함할 수도 있다. 통신부는 다양한 외부 장치와 통신을 수행하기 위한 적어도 하나의 회로 또는 모듈을 포함할 수 있다. 통신부는 유선 통신 및/또는 무선 통신을 통해 구현된 네트워크를 기반으로, 외부 장치와 연결될 수 있다. 이때, 통신부 는 외부 장치와 직접적으로 연결될 수도 있지만, 네트워크를 제공하는 하나 이상의 외부 서버(ex. ISP(Internet Service Provider))를 통해서 외부 전자 장치와 연결될 수도 있다. 네트워크는 영역 또는 규모에 따라 개인 통 신망(PAN; Personal Area Network), 근거리 통신망(LAN; Local Area Network), 광역 통신망(WAN; Wide Area Network) 등일 수 있으며, 네트워크의 개방성에 따라 인트라넷(Intranet), 엑스트라넷(Extranet), 또는 인터넷 (Internet) 등일 수 있다. 무선 통신은 LTE(long-term evolution), LTE-A(LTE Advance), 5G(5th Generation) 이동통신, CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), GSM(Global System for Mobile Communications), DMA(Time Division Multiple Access), WiFi(Wi-Fi), WiFi Direct, Bluetooth, NFC(near field communication), Zigbee 등의 통신 방식 중 적어도 하나를 포함할 수 있다. 유선 통신은 이더넷(Ethernet), 광 네트워크(optical network), USB(Universal Serial Bus), 선더볼트(ThunderBolt) 등의 통신 방식 중 적어도 하 나를 포함할 수 있다. 통신부는 상술한 유무선 통신 방식에 따른 네트워크 인터페이스(Network Interface) 또는 네트워크 칩을 포함할 수 있다. 한편, 통신 방식은 상술한 예에 한정되지 아니하고, 기술의 발전에 따라 새롭게 등장하는 통신 방식을 포함할 수 있다. 프로세서는 서버에 포함된 각 구성을 전반적으로 제어하기 위한 구성으로, 후술할 다양한 실시 예에 따른 서버 의 동작을 제어할 수 있다. 프로세서는 CPU(Central Processing Unit), AP(Application Processor), GPU(Graphic Processing Unit), VPU(Visual Processing Unit), NPU(Neural Processing Unit) 등 다양한 유닛 으로 구성될 수 있다. 프로세서는 메모리에 저장된 인스트럭션을 실행함으로써 서버를 제어할 수도 있다. 디스플레이 장치는 본 개시에 따른 광고 플랫폼 내에서 광고 정보를 출력하기 위한 구성이다. 디스플레이 장치는 도보로 이동하는 사용자가 휴대할 수 있도록 하는 적어도 하나의 걸림 부재(ex. 어깨 끈, 허리 끈, 손잡이 등)를 포함할 수 있으며, 디스플레이 장치를 휴대한 사용자가 이동하는 동안 디스플레이 장치는 광고에 해당하는 이미지를 디스플레이 할 수 있다. 구체적으로, 사용자가 디스플레이 장치의 어깨 끈을 메는 경우, 디스플레이 장치의 뒷면은 사용 자의 등과 맞대어질 수 있으며, 디스플레이 장치의 앞면에는 디스플레이가 구비되어 광고가 표시될 수 있다. 그 결과, 이동하는 사용자의 주변에 위치하는 사람들은 디스플레이 장치가 출력하는 광고를 볼 수 있게 된다. 디스플레이 장치는 사용자가 서비스 제공자로부터 대여하는 방식으로 운영될 수 있으나, 사용자가 디스플레이 장치를 직접 소유하는 경우(ex. 사용자가 원래 보유하던 디스플레이 장치가 플랫폼 상에 등록되어 이용되거나, 또는 사용자가가 서비스 제공자가 제공하는 디스플레이 장치를 완전히 구 매한 경우)도 물론 가능하다. 디스플레이 장치는, 메모리, 통신부, 프로세서 외에 디스플레이를 포함할 수 있으며, 스피커 등 오디오 출 력 수단을 추가로 구비할 수도 있다. 디스플레이는 LCD(Lizuid Crystal Display), LED(Light EmittingDiodes), OLED(Organic Light Emitting Diodes), TOLED(Transparent OLED), Micro LED 등으로 구현될 수 있다. 또한, 디스플레이는 평면 디스플레이 외에 곡면 디스플레이, 플렉서블 디스플레이, 폴더블 디스플레 이 등으로 구현될 수도 있다. 또한, 디스플레이는 3D Holographic Display로 구현될 수도 있는 바, 이 경 우 디스플레이 장치는 적어도 하나의 백라이트를 포함할 수 있으며, 디스플레이는 빛의 회절을 위한 적어도 하나의 슬릿을 포함할 수 있다. 사용자 단말은 사용자의 단말 장치에 해당하며, 스마트폰, 태블릿 PC, 웨어러블 장치 등 휴대 가능한 다양 한 단말 기기에 해당할 수 있다. 사용자 단말은 메모리, 통신부, 프로세서, 디스플레이, 사용자 입력부 (ex. 버튼, 터치패드, 마이크, 카메라 등) 등을 포함할 수 있다. 한편, 후술할 실시 예들에 따라 사용자가 휴대한 디스플레이 장치를 통해 광고가 제공되기 전에, 서버 는 사용자의 사용자 단말과 디스플레이 장치가 서로 연동되도록 등록할 필요가 있다. 먼저, 서버는 사용자 단말을 통해 수신되는 사용자 입력에 따라 사용자에 대한 정보 및 사용자 단말 에 대한 정보를 획득할 수 있다. 여기서, 서버는 사용자의 이름, 아이디, 비밀번호, 기타 개인 정보 를 바탕으로 사용자의 회원가입 및 로그인 등의 기능을 지원할 수 있다. 또한, 서버는 사용자의 사용자 단 말의 식별 정보 내지는 전화번호 등을 함께 등록하여 사용자를 등록할 수 있다. 등록된 사용자는, 일 예로, 서비스 제공자가 직접적/간접적으로 운영하는 적어도 하나의 오프라인 대여지점으로 부터 적어도 하나의 디스플레이 장치를 대여할 수 있게 된다. 이렇듯 사용자가 적어도 하나의 디스플레이 장치를 대여한 상태에서, 서버는 사용자 단말을 통 해 수신되는 사용자 입력에 따라 디스플레이 장치에 대한 식별 정보를 사용자에 대하여 등록할 수 있다. 구체적으로, 사용자의 로그인이 수행된 상태에서, 사용자는 본인이 대여한 디스플레이 장치의 식별 정보 (ex. 기기 번호, 지역, 대여 지점 등)를 입력할 수 있으며, 일련의 인증 과정이 수행될 수 있다. 인증 과정의 예로, 디스플레이 장치의 대여가 수행되면, 대여 지점(관리자의 단말/컴퓨터)의 요청에 따라 서버가 해당 디스플레이 장치로 인증번호를 전송할 수 있으며, 이후 사용자 단말을 통해 수신된 사용자 입력에 따라 특정 번호가 획득되면, 서버는 상술한 특정 번호가 인증번호와 매칭되는지 확인할 수 있다. 상술한 인증 과정이 수행됨에 따라 디스플레이 장치가 사용자에 대하여 등록될 수 있으며, 이때 등록은 일 정 기간에 대한 것일 수 있다. 즉, 반납 기간이 자동으로 설정될 수 있다. 이때, 반납 기간은 대여 시점으로부 터 일정 기간 이후에 해당할 수 있으며, 여기서 일정 기간은 기설정된 기간일 수 있고, 대여 옵션에 따라 달라 질 수 있다. 디스플레이 장치가 사용자 단말에 대하여 등록되면, 서버는 하나 이상의 미션에 대한 정보를 사 용자 단말로 전송할 수 있다. 미션은, 광고가 출력되는 디스플레이 장치를 휴대한 상태로 대상 경로를 이동하는 일련의 타겟 행위를 의미한다. 일 예로, 사용자가 하나의 미션을 완수하면, 해당 미션에 매칭되는 보상이 사용자에게 주어 지는 방식으로 플랫폼이 운영될 수 있다. 미션에 대한 정보는, 출력의 대상인 광고 및 대상 경로 각각에 대한 정보를 포함할 수 있다. 구체적으로, 미션 에 대한 정보는 광고주의 이름/명칭, 광고 대상 상품/서비스, 광고 콘텐츠 등을 포함할 수 있다. 또한, 미션에 대한 정보는, 해당 광고가 등록된 구역 또는 지역에 대하 정보를 포함할 수도 있다. 또한, 미션에 대한 정보는, 해당 광고가 출력되는 대상 경로의 출발지, 목적지, 세부 경로, 거리, 예상 소요 시간 등을 포함할 수 있다. 또한, 미션에 대한 정보는, 미션이 수행되어야 하는 타겟 시간대(ex. 오전 11시부터 오후 2시 사이), 미션 수행 의 만료 기간(ex. 10/15 오후 6시까지 완료) 등에 대한 정보를 포함할 수 있다. 일 예로, 서버는 복수의 미션에 대한 정보를 사용자 단말로 전송할 수 있으며, 사용자 단말을 통해 수신된 사용자 입력에 따라 선택된 미션이 사용자에 대하여 할당/생성될 수 있다. 한편, 본 개시의 일 실시 예에 따른 서버는 사용자의 위치를 바탕으로 적어도 하나의 미션을 실시간으로 생성할 수 있다. 예를 들어, 서버는 사용자의 위치에 적합한 적어도 하나의 후보 경로를 추천하고, 추천된 후보 경로에 대 한 사용자의 선택에 따라 미션을 생성 및 할당할 수 있는 바, 이하 도면을 통해 보다 상세하게 설명한다. 도 2는 본 개시의 일 실시 예에 따른 서버가 사용자의 위치 및 유동 인구를 바탕으로 미션을 생성하는 동작을 설명하기 위한 흐름도이다. 도 2를 참조하면, 서버는, 사용자 단말의 위치 및 구역 별 유동 인구와 관련된 실시간 데이터를 바탕으로, 적어도 하나의 후보 경로를 획득할 수 있다(S210). 구체적으로, 서버는 사용자 단말의 현재 위치, 현재 시각, 및 각 구역의 시간대 별(또는 실시간) 유 동 인구를 바탕으로, 적어도 하나의 후보 경로를 획득할 수 있다. 서버는 사용자 단말로부터 수신되는 위치 정보(ex. GPS 정보)를 바탕으로 사용자의 위치를 식별할 수 있다. 또는, 서버는 사용자 단말과 연결된 적어도 하나의 중계 장치(ex. 와이파이 공유기)의 식별 정 보를 사용자 단말로부터 수신하고, 중계 장치의 식별 정보에 따라 중계 장치의 위치를 파악하여, 해당 위 치를 사용자의 실시간 위치로 식별할 수도 있다. 또는, 서버는 사용자 단말이 아닌 디스플레이 장치 의 위치 정보(ex. GPS 정보)를 바탕으로 사용자의 위치를 식별할 수도 있다. 시간대 별 유동 인구는 사용자가 위치한 지점을 포함하는 적어도 하나의 구역 내지는 인접 구역들 각각에 대하여 서버 상에 기등록되어 있을 수 있다. 이를 위해, 서버는 시간대 별 유동 인구와 관련된 빅데 이터를 관리/모니터링 하는 적어도 하나의 외부 서버(ex. 통신사 서버)로부터 각 구역에 대한 시간대 별 유동 인구에 대한 데이터를 수신할 수 있다. 또는, 서버는 각 구역에 포함된 복수의 점포 각각의 점포 단말로부터 유동 인구에 대한 데이터를 실시간으 로 수신할 수도 있다. 예를 들어, 서버는 각 점포의 점포 단말로부터 실시간으로 점포를 이용하는 이용객 의 수와 관련된 데이터(ex. 입장/퇴장하는 인원 수, 결제를 수행하는 인원 수, 점포 입장을 위해 (스마트폰 앱 등을 통해) 대기 요청을 전송한 인원 수 등)를 수신할 수 있다. 이때, 서버는 해당 구역에 포함된 복수의 점포 각각과 관련된 데이터를 바탕으로 해당 구역 전체의 유동 인구를 실시간으로 예측할 수 있다. 이를 위해, 서버는 과거 해당 구역 전체의 시간대 별 유동 인구와 각 점포의 시간대 별 이용객의 수를 바탕으로 훈련 된 적어도 하나의 인공지능 모델(ex. RNN(Recurrent Neural Network) 모델)을 활용할 수도 있다. 서버는 사용자의 현재 위치로부터 일정한 거리 내이면서도 현재 시각 기준 유동 인구가 일정치 이상인 적어도 하나의 구역을 선택할 수 있다. 이때, 서버는 선택된 구역을 통과하면서도 사용자의 현 위치를 출발지로 하는 적어도 하나의 후보 경 로를 자동으로 생성할 수 있다. 여기서, 서버는 미션을 수행 중인 다른 사용자의 위치와 최대한 중복되지 않는 구역을 통과하는 후보 경로 를 선택할 수도 있다. 구체적으로, 서버는 미션을 수행 중인 복수의 사용자 각각의 위치를 실시간으로 식 별할 수 있으며, 구역 별 유동 인구 및 복수의 사용자 각각의 위치를 바탕으로, 사용자를 위한 후보 경로를 획 득할 수 있다. 이때, 후보 경로는, 가급적 유동 인구가 많은 구역을 지나면서도 다른 사용자의 위치(또는 다른 사용자가 수행 중인 미션의 대상 경로)와 최대한 중복되지 않는 경로에 해당한다. 관련하여, 서버는 후보 경로 생성을 위한 적어도 하나의 인공지능 모델을 이용할 수도 있다. 구체적으로, 서버는 사용자의 현재 위치, 현 시점의 구역 별 유동 인구, 미션을 수행 중인 다른 사용자들 각각의 현 위 치를 인공지능 모델에 입력할 수 있으며, 이때 인공지능 모델은 후보 경로를 자동으로 생성 및 출력할 수 있다. 후보 경로 생성을 위한 인공지능 모델은, 결정 트리, SVM(Support Vector Machine), RF(Random Forest) 등 다 양한 머신러닝 알고리즘을 바탕으로 훈련된 것일 수 있다. 또는, 본 인공지능 모델은 서로 다른 레이어의 노드 간 가중치를 바탕으로 훈련/업데이트되는 신경망 모델일 수도 있다. 후보 경로 생성을 위한 인공지능 모델은, 각 항목(사용자의 현재 위치, 현 시점의 구역 별 유동 인구, 미션을 수행 중인 다른 사용자들 각각의 현 위치)의 값에 따라 실제로 인간이 선택한 결과를 바탕으로 훈련된 것일 수 있다. 또는, 후보 경로 생성을 위한 인공지능 모델은, 인공지능 모델이 생성한 후보 경로가 적용되어 도출된 결 과 값(ex. 후보 경로 상에서 마주치는 유동 인구, 미션 수행 중인 다른 사용자와의 거리)이 커지는 방향으로 피 드백을 받으면서 다수의 판단 과정을 거쳐 훈련된 것일 수도 있다. 상술한 실시 예들 중 적어도 하나에 따라 후보 경로가 생성되면, 서버는 후보 경로에 대한 정보를 사용자 단말로 전송할 수 있다(S220. 경로 추천).관련하여, 도 3은 본 개시의 일 실시 예에 따른 서버가 사용자 단말을 통해 사용자를 위한 후보 경로를 추천하 는 동작을 설명하기 위한 도면이다. 도 3을 참조하면, 서버는 사용자 단말을 통해, 사용자를 나타내는 가상의 캐릭터(10')와 함께, 후보 경로(ex. AI 추천 경로)를 포함하는 지도를 출력할 수 있다. 이때, 후보 경로의 거리 및 예상 소요 시간 등이 함께 제공될 수 있다. 그리고, 후보 경로를 대상 경로로 선택하는 사용자 입력이 수신되면, 서버는 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 적어도 하나의 광고 및 대상 경로를 바탕으로 사용자의 미션을 생성할 수 있다 (S230). 구체적으로, 서버는 대상 경로의 적어도 일부가 포함된 구역에 대해 등록된 복수의 광고에 대한 정보를 사 용자 단말로 제공할 수 있으며, 사용자 입력에 따라 선택된 광고 및 대상 경로를 바탕으로 사용자에 대한 미션을 생성/할당할 수 있다. 사용자에 대한 미션이 생성되면, 서버는 디스플레이 장치를 통해 해당 광고를 출력할 수 있다(S240). 구체적으로, 서버는 광고를 구성하는 이미지 데이터 및/또는 오디오 데이터를 포함하는 출력 요청을 디스 플레이 장치로 전송할 수 있다. 한편, 후보 경로를 획득하고 사용자의 미션을 생성하는 등 상술한 일련의 과정들 중 적어도 일부는, 사용자 단 말을 통해 직접 수행될 수도 있다. 구체적으로, 사용자 단말은, 사용자 단말의 위치 및 구역 별 유동 인구를 바탕으로 후보 경로를 획득할 수 있으며(ex. AI 이용 가능), 후보 경로를 사용자에게 제공할 수 있 다. 그리고, 사용자 단말은 후보 경로를 선택하는 사용자 입력에 따라 사용자의 미션을 직접 생성하여 서 버 상에 등록할 수도 있다. 그 결과, 디스플레이 장치를 통해 광고가 출력될 수 있다. 한편, 미션에 포함되는 광고는 다양한 광고주로부터 의뢰된 광고일 수 있으며, 각 광고는 적어도 하나의 구역을 지정하여 의뢰될 수도 있다. 관련하여, 도 4는 본 개시의 일 실시 예에 따른 서버가 광고주의 광고 등록부터 디스플레이 장치의 광고 출력까 지 이어지는 일련의 과정을 수행하는 동작을 설명하기 위한 도면이다. 도 4를 참조하면, 서버는 광고주의 광고주 단말로부터 수신되는 광고 정보를 등록할 수 있다(S410). 광고 정보는, 광고의 콘텐츠(이미지 데이터, 오디오 데이터), 광고 대상 상품 등을 포함할 수 있다. 또한, 서버 는 광고주 단말을 통해 수신되는 광고주의 입력에 따라 광고의 대상이 되는 구역/지역, 광고 기간, 광고 횟수, 광고 시간대 등을 설정할 수도 있다. 이때, 광고의 대상인 구역/지역의 수가 많거나 면적이 넓을수 록, 유동 인구가 더 많은 구역/지역을 선택할수록, 광고 기간이 길수록, 광고 횟수가 많을수록 광고 비용은 더 높게 산정될 수 있다. 광고주가 지출하는 광고 비용을 토대로, 해당 광고에 대한 미션을 수행하는 사용자에게 지급되는 보상이 충당될 수 있다. 광고가 등록되면, 서버는 적어도 한 명의 사용자에 대하여 미션을 생성/할당할 수 있다. 구체적으로, 서버는 등록된 광고의 대상이 되는 구역/지역에 위치한 적어도 한 명의 사용자(ex. 10) 또는 등록된 광고의 대상이 되는 구역/지역에 근접한 적어도 한 명의 사용자(ex. 10)를 선택할 수 있다. 이때, 서버는 사용자의 위치 및 구역 별 유동 인구를 바탕으로 후보 경로를 생성하여 사용자 단말로 전송할 수 있다(S420). 이렇듯 서버에 의해 추천된 후보 경로를 선택하는 사용자의 수락 정보가 수신되면 (S430), 서버는 등록된 광고 및 대상 경로(: 선택된 후보 경로)로 구성된 미션을 사용자에 대하여 할 당/생성할 수 있다. 미션이 생성되면, 서버는 사용자에 대해 등록된 디스플레이 장치로 광고 정보, 구체적으로는 광 고 콘텐츠를 전송할 수 있다(S450). 그 결과, 디스플레이 장치는 광고의 이미지를 디스플레이 할 수 있으 며(S460), 오디오 데이터가 있는 경우 사운드를 출력할 수도 있다. 디스플레이 장치를 통해 광고가 출력되는 동안 사용자 단말이 대상 경로의 목적지에 도달한 경우, 서 버는 해당 미션이 완료된 것으로 식별할 수 있다. 이 경우, 서버는 사용자에 대하여 미션에 매칭되는 보상을 등록할 수 있으며, 디스플레이 장치의 광고 출력을 중단하는 요청을 디스플레이 장치로 전송 할 수 있다. 한편, 미션 수행 중, 서버는 사용자의 위치와 관련된 다양한 데이터를 바탕으로 미션 수행을 모니터링하고 보상/페널티를 등록할 수 있다. 관련하여, 도 5는 본 개시의 일 실시 예에 따른 서버가 미션을 수행 중인 사용자의 위치와 관련된 다양한 데이 터를 바탕으로 페널티 및/또는 보상을 생성하는 동작을 설명하기 위한 알고리즘이다. 도 5는 사용자에게 미션이 할당되어 시작된 상황을 가정한 것이다. 도 5를 참조하면, 미션 수행 중 서버는 사용자 단말과 디스플레이 장치 간의 거리가 일정 거리 미만인지 여부를 모니터링할 수 있다(S410). 또한, 서버는 사용자 단말의 실시간 위치를 바탕으로 사용자 단말이 이동 중인지 여부를 모니터 링할 수 있다(S420). 이때, 서버는 사용자 단말의 실시간 GPS 정보를 바탕으로 이동 여부를 판단할 수도 있고, 사용자 단말의 가속도 센서 등을 통해 측정된 센싱 데이터 등을 수신하여 이동 여부를 판단할 수도 있다. 만약, 사용자 단말과 디스플레이 장치 간의 거리가 일정 거리 이상이 되는 경우(S410 - N), 서버 는 사용자에 대해 경고를 제공하거나 또는 사용자에 대한 페널티를 등록할 수 있다. 사용자의 이동이 광고 출력(: 디스플레이 장치)와 무관한 경우, 미션이 정상적으로 수행된다고 볼 수 없다는 점이 반영된 것이다. 일 예로, 일정 횟수의 경고가 쌓이면 페널티가 제공되는 방식으로 운영될 수도 있다. 또한, 이동을 멈춘 사용자 단말의 위치 이동이 일정 시간 이상 동안 없는 경우에도(S420 - N, S430 - Y), 서버는 사용자에 대해 경고를 제공하거나 또는 사용자에 대한 페널티를 등록할 수 있다. 경고 및/또는 페널티가 등록되면(S440), 이후 일정한 대기 시간이 주어질 수 있으며, 다시 S410 과정으로 넘어 갈 수 있다. 다만, 사용자 단말이 디스플레이 장치로부터 일정 거리 내의 간격을 유지하면서 이동을 수행함에 따 라, 목표 지점에 도착한 경우(S450 - Y), 서버는 사용자 단말에 대하여 보상을 생성/등록할 수 있다 (S460). 한편, 상술한 페널티는, 사용자의 신뢰도를 업데이트하는 데에 이용될 수 있다. 구체적으로, 서버는 각 사용자에 대하여 주어진 페널티를 바탕으로 각 사용자의 신뢰도를 감소 업데이트할 수 있다. 다만, 각 사용 자의 신뢰도는 미션 완료 횟수, 등록된 보상 등에 따라 증가 업데이트될 수도 있다. 신뢰도는, 사용자가 미션을 성공적으로 수행할 수 있을지에 기대 정도를 의미하며, 각 사용자에 대해 주어지는 혜택을 더하거나 줄이기 위한 판단 척도가 될 수 있다. 일 실시 예로, 서버는 신뢰도를 바탕으로 사용자의 미션 수행과 관련된 최대 이동 거리를 설정할 수 있다. 즉, 서버는 신뢰도가 높은 사용자일수록 더 긴 대상 경로로 구성된 미션을 할당할 수 있으며, 신뢰도가 일 정치 미만인 사용자는 일정 거리 이상의 대상 경로에 매칭되는 미션을 수행할 수 없게 된다. 그 결과, 서버는 해당 사용자(ex. 10)에 대하여 후보 경로를 생성하는 경우에도, 사용자에 대하여 설 정된 최대 이동 거리보다 짧은 적어도 하나의 후보 경로를 생성하여 사용자 단말로 전송할 수 있다. 예를 들어, 후보 경로 생성을 위한 인공지능 모델이 비교적 긴 경로를 1차적으로 생성하더라도, 서버는 1차적으 로 생성된 경로 중 최대 이동 거리에 해당하는 일부 경로만을 추출하여 후보 경로로 선택할 수 있다. 일 실시 예로, 서버는 신뢰도를 바탕으로 사용자에게 광고에 대한 선택권을 부여할 수도 있다. 예를 들어, 신뢰도가 일정치 미만인 사용자에 대해서는, 서버가 사용자의 위치에 매칭되는 광고를 임의로 선택하여 미 션을 생성할 수 있다. 반면, 신뢰도가 일정치 이상인 사용자에 대해서는 서버가 사용자의 위치에 매칭되는 복수의 광고에 대한 정보를 사용자 단말로 제공할 수 있으며, 여기서 선택된 광고를 바탕으로 미션이 생성될 수 있다. 또한, 일 실시 예로, 서버는 신뢰도가 높은 사용자일수록 상술한 도 5의 S430 단계의 “일정 시간”을 더 높게 설정할 수 있다. 또한, 일 실시 예로, 서버는 신뢰도가 높은 사용자일수록 상술한 도 5의 S410 단계 의 “일정 거리”를 더 크게 설정할 수 있다. 즉, 신뢰도가 높은 사용자일수록 이동 중 대기 가능한 시간이 길 어지며, 디스플레이 장치의 위치를 기준으로 이동 반경 역시 더욱 유연하게 설정될 수 있다. 이렇듯, 사용자의 신뢰도에 따라 사용자에 대한 다양한 혜택 내지는 제약이 주어지는 바, 본 플랫폼에 등록된 사용자에 대하여 객관적인 지표를 근거로 하는 관리가 수행될 수 있으며, 각 사용자의 성실성이 모니터링되고 동기가 부여될 수 있다. 한편, 도보로 이동하는 사용자(ex. 10) 외에도 다양한 이동 수단에 탑승하여 이동하는 사용자를 통해서도 본 개 시의 플랫폼이 운영될 수 있다. 관련하여, 도 6을 참조하면, 서버는 자동차, 전동 자전거, 버스 등 다양한 이동 수단을 운영 하는 사용자들 각각을 등록할 수 있으며, 각 사용자에 대해 할당된 미션에 대한 정보를 바탕으로 각 사용자의 이동 수단에 부착된 디스플레이 장치(200-a, b, c)를 통해 광고를 출력할 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 서로 저촉되지 않는 한 둘 이상의 실시 예가 함께 구현될 수 있다. 한편, 이상에서 설명된 다양한 실시 예들은 소프트웨어(software), 하드웨어(hardware) 또는 이들의 조합된 것 을 이용하여 컴퓨터 또는 이와 유사한 장치로 읽을 수 있는 기록 매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 본 개시에서 설명되는 실시 예들은 ASICs(Application Specific Integrated Circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(Programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processor), 제어기 (controller), 마이크로 컨트롤러(micro-controllers), 마이크로 프로세서(microprocessor), 기타 기능 수행을 위한 전기적인 유닛(unit) 중 적어도 하나를 이용하여 구현될 수 있다. 일부의 경우에 본 명세서에서 설명되는 실시 예들이 프로세서 자체로 구현될 수 있다. 소프트웨어적인 구현에 의하면 본 명세서에서 설명되는 절차 및 기능과 같은 실시 예들은 별도의 소프트웨어 모듈들로 구현될 수 있다. 상술한 소프트웨어 모듈들 각각은 본 명세서에서 설명되는 하나 이상의 기능 및 작동을 수행할 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 서버 또는 단말의 처리동작을 수행하기 위한 컴퓨터 명령어 (computer instructions)는 비일시적 컴퓨터 판독 가능 매체(non-transitory computer-readable medium)에 저 장될 수 있다. 이러한 비일시적 컴퓨터 판독 가능 매체에 저장된 컴퓨터 명령어는 특정 기기의 프로세서에 의해 실행되었을 때 상술한 다양한 실시 예에 따른 서버 등의 처리 동작을 상술한 기기가 수행하도록 한다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 또한, 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시"}
{"patent_id": "10-2023-0127738", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야 에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해돼서는 안 될 것이다."}
{"patent_id": "10-2023-0127738", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따라 사용자의 디스플레이 장치, 사용자 단말과 통신을 수행하는 서버의 동작을 설명하기 위한 도면, 도 2는 본 개시의 일 실시 예에 따른 서버가 사용자의 위치 및 유동 인구를 바탕으로 미션을 생성하는 동작을 설명하기 위한 흐름도, 도 3은 본 개시의 일 실시 예에 따른 서버가 사용자 단말을 통해 사용자를 위한 후보 경로를 추천하는 동작을 설명하기 위한 도면, 도 4는 본 개시의 일 실시 예에 따른 서버가 광고주의 광고 등록부터 디스플레이 장치의 광고 출력까지 이어지 는 일련의 과정을 수행하는 동작을 설명하기 위한 도면, 도 5는 본 개시의 일 실시 예에 따른 서버가 미션을 수행 중인 사용자의 위치와 관련된 다양한 데이터를 바탕으 로 페널티 및/또는 보상을 생성하는 동작을 설명하기 위한 알고리즘, 그리고 도 6은, 사용자가 도보로 이동하는 상술한 도면들의 실시 예들과 달리, 다양한 이동 수단에 탑승하여 이동하는 사용자를 등록하여 이동 수단에 구비된 디스플레이 장치를 통해 광고를 출력하는 응용 실시 예를 설명하기 위한 도면이다."}
