{"patent_id": "10-2022-0169466", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0084788", "출원번호": "10-2022-0169466", "발명의 명칭": "어류 양식장 모니터링 시스템", "출원인": "주식회사 타이드풀", "발명자": "이준호"}}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "어류 양식장의 수중 동영상을 촬영하는 카메라부; 및상기 카메라부에서 촬영된 동영상에서 어류 각 객체를 인식하고 움직임을 추적하여 어류 군집의 상태를 파악하는 분석부;를 포함하는 어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 카메라부는,부표;상기 부표의 하부를 향하도록 배치되는 카메라; 및상기 부표의 하부를 향하도록 배치되는 조명;을 포함하는 것을 특징으로 하는 어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 카메라는,360도 카메라인 것을 특징으로 하는 어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 분석부는,어류 각 객체 움직임의 엔트로피를 평균하여 어류 군집의 상태를 파악하는 것을 특징으로 하는 어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 분석부는,상기 카메라의 동영상에서 프레임에 따라 정지영상을 추출하는 정지영상 추출부;상기 정지영상 추출부에서 추출된 각 정지영상에서 어류 각 객체를 구분하여 인식하는 객체 인식부;상기 객체 인식부에서 인식한 어류 각 객체의 좌표를 추출하는 좌표 추출부;연속된 프레임에서 추출된 어류 각 객체 좌표의 차분값을 산출하는 차분값 산출부;상기 차분값 도출부에서 도출된 차분값의 확률 분포를 산출하는 확률 분포 산출부;상기 확률 분포 도출부에서 산출된 확률 분포를 이용해 어류 각 객체 움직임의 엔트로피를 산출하는 엔트로피공개특허 10-2024-0084788-3-산출부; 및상기 엔트로피 산출부에서 산출된 엔트로피들의 평균값을 산출하는 평균값 산출부;를 포함하는 것을 특징으로하는 어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분석부는,상기 정지영상 추출부에서 추출된 각 정지영상을 보정하는 정지영상 보정부를 더 포함하는 것을 특징으로 하는어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,어류 양식장에 사료를 공급하는 사료 공급부;어류 양식장의 수질을 조절하는 수질 조절부; 및상기 분석부에서 도출된 어류 군집의 상태에 따라 상기 사료 공급부 및/또는 상기 수질 조절부를 제어하는 제어부;를 더 포함하는 것을 특징으로 하는 어류 양식장 모니터링 시스템."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 어류 양식장 모니터링 시스템에 관한 것으로서, 어류 양식장의 수중 동영상을 촬영하는 카메라부; 및 상기 카메라부에서 촬영된 동영상에서 어류 각 객체를 인식하고 움직임을 추적하여 어류 군집의 상태를 파악하는 분석부;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 어류 양식장 모니터링 시스템에 관한 것으로서, 보다 상세하게는 물고기 각각의 활동성을 파악하여 양식장의 상황을 정확하게 모니터링 하는 것이 가능한 어류 양식장 모니터링 시스템에 관한 것이다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 양식장을 원격에서 모니터링하기 위해 수중 카메라와 통신 모듈을 이용한 모니터링 시스템이 도입되고 있 다. 이와 같은 양식장 모니터링 시스템을 통해 어류의 건강상태 확인, 사료 투입 시기 조절, 출하시기 조정 등 이 효과적으로 이루어질 수 있으며, 양식장의 생산성이 증대될 수 있다. 카메라 영상을 이용한 어류의 상태 확인은 영상을 인공지능 알고리즘을 이용항 분석함으로써 가능한데, 어류의 상태를 보다 정확하게 확인하기 위하여 새로운 모니터링 방법이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2022-0079115 A"}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은 이와 같은 종래의 문제점을 해결하기 위한 것으로서, 어류 각각을 관찰하여 어류의 상태를 보다 정확하게 확인하는 것이 가능한 어류 양식장 모니터링 시스템을 제공함에 있다. 본 발명이 해결하고자 하는 과제는 위에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아 래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적은, 본 발명에 따라, 어류 양식장의 수중 동영상을 촬영하는 카메라부; 및 상기 카메라부에서 촬영된 동영상에서 어류 각 객체를 인식하고 움직임을 추적하여 어류 군집의 상태를 파악하는 분석부;를 포함하는 어류 양식장 모니터링 시스템에 의해 달성된다. 상기 카메라부는, 부표; 상기 부표의 하부를 향하도록 배치되는 카메라; 및 상기 부표의 하부를 향하도록 배치되는 조명;을 포함할 수 있다. 상기 카메라는, 360도 카메라일 수 있다. 상기 분석부는, 어류 각 객체 움직임의 엔트로피를 평균하여 어류 군집의 상태를 파악할 수 있다. 상기 분석부는, 상기 카메라의 동영상에서 프레임에 따라 정지영상을 추출하는 정지영상 추출부; 상기 정지영상 추출부에서 추출된 각 정지영상에서 어류 각 객체를 구분하여 인식하는 객체 인식부; 상기 객체 인식부에서 인 식한 어류 각 객체의 좌표를 추출하는 좌표 추출부; 연속된 프레임에서 추출된 어류 각 객체 좌표의 차분값을 산출하는 차분값 산출부; 상기 차분값 도출부에서 도출된 차분값의 확률 분포를 산출하는 확률 분포 산출부; 상 기 확률 분포 도출부에서 산출된 확률 분포를 이용해 어류 각 객체 움직임의 엔트로피를 산출하는 엔트로피 산 출부; 및 상기 엔트로피 산출부에서 산출된 엔트로피들의 평균값을 산출하는 평균값 산출부;를 포함할 수 있다. 상기 분석부는, 상기 정지영상 추출부에서 추출된 각 정지영상을 보정하는 정지영상 보정부를 더 포함할 수 있 다. 본 발명에 의한 어류 양식장 모니터링 시스템은, 어류 양식장에 사료를 공급하는 사료 공급부; 어류 양식장의 수질을 조절하는 수질 조절부; 및 상기 분석부에서 도출된 어류 군집의 상태에 따라 상기 사료 공급부 및/또는 상기 수질 조절부를 제어하는 제어부;를 더 포함할 수 있다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 어류 양식장 모니터링 시스템에 의하면, 어류 각 객체의 움직임에 따라 어류 군집의 상태를 파악하므 로 어류 군집의 상태를 정확하게 파악할 수 있다. 그리고 정확한 어류 군집의 상태를 기반으로 양식장 관련 장치들을 제어할 수 있으므로, 양식장의 관리를 효율 적으로 할 수 있다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 과제 해결 수단의 특징 및 이점을 보다 명확히 하기 위하여, 첨부된 도면에 도시된 본 발명의 특정 실시 예를 참조하여 본 발명을 더 상세하게 설명한다. 다만, 하기의 설명 및 첨부된 도면에서 본 발명의 요지를 흐릴 수 있는 공지 기능 또는 구성에 대한 상세한 설 명은 생략한다. 또한, 도면 전체에 걸쳐 동일한 구성 요소들은 가능한 한 동일한 도면 부호로 나타내고 있음에 유의하여야 한다. 이하의 설명 및 도면에서 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니 되 며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위한 용어의 개념으로 적절하게 정의할 수 있다 는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서 에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 가장 바람직한 일 실시 예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변 형 예들이 있을 수 있음을 이해하여야 한다. 또한, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하기 위해 사용하는 것으로, 하나 의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용될 뿐, 상기 구성요소들을 한정하기 위해 사용되 지 않는다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제2 구성요소는 제1 구성요소로 명명될 수 있 고, 유사하게 제1 구성요소도 제2 구성요소로 명명될 수 있다. 또한, 본 명세서에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한, 본 명세서에서 기술되는 \"포함 한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 명세서에 기재된 \"부\", \"기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미 하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, \"일(a 또는 an)\", \"하나(one)\", \"그(the)\" 및 유사 관련어는 본 발명을 기술하는 문맥에 있어서(특히, 이하의 청구항의 문 맥에서) 본 명세서에 달리 지시되거나 문맥에 의해 분명하게 반박되지 않는 한, 단수 및 복수 모두를 포함하는 의미로 사용될 수 있다. 상술한 용어들 이외에, 이하의 설명에서 사용되는 특정 용어들은 본 발명의 이해를 돕기 위해서 제공된 것이며, 이러한 특정 용어의 사용은 본 발명의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 아울러, 본 발명의 범위 내의 실시 예들은 컴퓨터 실행가능 명령어 또는 컴퓨터 판독가능 매체에 저장된 데이터 구조를 가지거나 전달하는 컴퓨터 판독가능 매체를 포함한다. 이러한 컴퓨터 판독가능 매체는, 범용 또는 특수 목적의 컴퓨터 시스템에 의해 액세스 가능한 임의의 이용 가능한 매체일 수 있다. 예로서, 이러한 컴퓨터 판독 가능 매체는 RAM, ROM, EPROM, CD-ROM 또는 기타 광 디스크 저장장치, 자기 디스크 저장장치 또는 기타 자기 저 장장치, 또는 컴퓨터 실행가능 명령어, 컴퓨터 판독가능 명령어 또는 데이터 구조의 형태로 된 소정의 프로그램 코드 수단을 저장하거나 전달하는 데에 이용될 수 있고, 범용 또는 특수 목적 컴퓨터 시스템에 의해 액세스 될 수 있는 임의의 기타 매체와 같은 물리적 저장 매체를 포함할 수 있지만, 이에 한정되지 않는다. 도 1에는 본 발명에 의한 어류 양식장 모니터링 시스템의 개략적인 구성도가 도시되어 있다. 본 발명에 의한 어류 양식장 모니터링 시스템은 크게, 카메라부와 분석부를 포함하여 이루어진다. 카메라부는 동영상 카메라를 포함하여 어류 양식장의 수중 동영상을 촬영하는 역할을 한다. 카메라부 는 예를 들어, 수면에서 부유하도록 형성될 수 있다. 카메라는 방수가 가능하거나 별도의 투명하고 수 밀한 구조체 내에 위치할 수 있다. 분석부는 카메라부에서 촬영한 동영상에서 어류 각 객체를 인식하고 움직임을 추적하여 어류 군집의 상 태를 파악할 수 있다. 동영상 내에서 어류 각 객체를 인식하는 것, 각 객체의 움직임을 추적하는 것은 인공지능 알고리즘을 이용하여 가능하다. 예를 들어, 어류 각 객체의 인식은 YOLO 등과 같은 객체 탐지 알고리즘을 이용 하여 가능하고, 어류 각 객체의 움직임 추적은 Sort, DeepSort, ByteTrack 등과 같은 추적 알고리즘을 이용하여 가능하다. 카메라부는 유선 또는 무선 통신을 통해 분석부에 촬영한 동영상을 전송할 수 있다. 이러한 본 발명의 어류 양식장 모니터링 시스템에 의하면, 어류 각 객체의 움직임에 따라 어류 군집의 상태 를 파악하므로 어류 군집의 상태를 정확하게 파악할 수 있다. 카메라부는 보다 구체적으로, 부표, 카메라 및 조명을 포함할 수 있다. 도 2에는 이러한 카메 라부에 대한 설명도가 도시되어 있다. 부표는 카메라부를 수면에 부유하게 하는 역할을 하는 것으로서, 발포 플라스틱 등과 같은 비중이 낮은 재질로 이루어지거나 내부에 빈 공간을 가지도록 형성될 수 있다. 부표의 중앙부에는 카메라를 배치하 기 위한 투명한 재질의 수밀 챔버가 구비될 수 있다. 수밀 챔버는 부표의 하면에 형성되거나 부표 구조체를 관통하여 일부분이 부표의 하면 아래로 형성될 수 있다. 카메라는 부표의 하부를 향하도록 배치되어 부표 하부, 즉 수중을 촬영한다. 카메라는 수밀 챔 버 내에 하부를 향하도록 설치될 수 있다. 조명은 부표의 하부를 향하도록 배치되어 카메라가 촬영하는 수중을 밝게 한다. 조명은 예를 들어 부표의 하면에 형성되며, 수밀하고 투명한 구조체 내에 위치할 수 있다. 이러한 카메라부는 수면에서 수중 동영상을 촬영하므로 수중을 전체적으로 촬영하는 것이 가능하다. 카메라는 360도 카메라로 이루어질 수 있다. 이 경우, 하나의 카메라를 이용하여 수중을 전체적으로 촬영하는 것이 가능하고, 어류 각 객체의 움직임을 연속적으로 촬영할 수 있으므로, 어류 각 객체의 움직임을 정확하게 파악하는 것이 가능하다. 분석부는 어류 각 객체 움직임의 엔트로피를 평균하여 어류 군집의 상태를 파악할 수 있다. 엔트로피는 어류 각 객체 움직임의 불규칙성을 나타내므로, 이를 통해서는 어류의 움직임의 활발함 정도를 알 수 있다. 즉, 엔트로피가 높다는 것는 어류가 활동성이 높은 것을 의미하고, 엔트로피가 낮다는 것은 어류의 활 동성이 낮은 것을 의미한다. 분석부는 보다 구체적으로, 정지영상 추출부, 객체 인식부, 좌표 추출부, 차분값 산출부, 확률 분포 산출부, 엔트로피 산출부 및 평균값 산출부를 포함하여 이루어질 수 있다. 그리고 정지 영상 보정부를 더 포함할 수 있다. 정지영상 추출부는 카메라가 촬영한 동영상에서 프레임에 따라 정지영상을 추출한다. 예를 들어, 동영 상이 30프레임으로 촬영된 경우 정지영상은 1초당 30개가 추출될 수 있다. 객체 인식부는 도 3에 도시되어 있는 바와 같이, 정지영상 추출부에서 추출된 각 정지영상에서 어류 각 객체를 구분하여 인식한다. 상기한 바와 같이 객체 인식부는 객체 탐지 알고리즘을 이용하여 어류 각 객체 를 구분하여 인식할 수 있으며, 어류 각 객체의 위치는 객체 탐지 알고리즘을 통해 나오는 바운딩 박스 중심점 또는 물고기 눈의 중심점과 같은 특징점이 될 수 있다. 어류 각 객체에는 서로 다른 번호가 부여될 수 있으며, 추적 알고리즘을 통해 어류 각 객체의 움직임을 추적할 수 있으므로 서로 정지영상에서 동일한 객체에는 동일한 번호가 부여될 수 있다. 좌표 추출부는 객체 인식부에서 인식한 어류 각 객체의 좌표를 추출한다. 정지영상에서 어류 각 객체가 위치하는 부분이 좌표값이 된다. 이를 위해 정지영상은 예를 들어 하나의 2차원 공간이 될 수 있으며, 이 경우 각 객체의 좌표는 x축 값과 y축 값을 가질 수 있다. 예를 들어, 한 객체의 좌표는 연속된 프레임(f1, f2, f3 … …)에서 아래와 같이 변화할 수 있다. f1(543, 470), f2(520, 459), f3(501, 460), f4(479, 430), f5(431, 421), f6(415, 455) …… 차분값 산출부는 연속된 프레임에서 추출된 여러 각 객체 좌표의 차분값을 산출한다. 예를 들어, 어류 각 객체의 좌표가 위와 같이 2차원 좌표값으로 표현된 경우 한 프레임(fn)의 x축 값에서 이전 프레임(fn-1)의 x축 값을 빼고, 한 프레임(fn)의 y축 값에서 이전 프레임(fn-1)의 y축 값을 뺀다. 차분값 산출부에서 산출되는차분값은 아래와 같이 산출될 수 있다. f2-1(-23,-11), f3-2(-19,1), f4-3(-21,-30), f5-4(-48,-9), f6-5(-16,34) …… 확률 분포 산출부에서는 차분값 도출부에서 도출된 각 차분값의 확률 분포를 산출한다. 이를 위해 먼저 차 분값들 분포를 나타내는 히스토그램을 만든 후, 히스토그램 각 구간의 확률값을 구한다. 예를 들어 도 4에 도시 되어 있는 바와 같이 5×5의 2차원 히스토그램을 만들 수 있다. 위의 차분값의 절대값 중 최대값이 48이므로, 히스토그램 한 구간의 폭은 48÷2.5를 하여 19.2가 된다. 히스토그램 각 구간의 높이를 차분값의 개수로 나누면 각 구간의 확률이 산출된다. 엔트로피 산출부에서는 확률 분포 도출부에서 산출된 확률 분포를 이용해 어류 각 객체 움직임의 엔트로피 를 산출한다. 엔트로피(H)는 아래와 같은 식을 이용해 산출할 수 있다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기에서, P(binij)는 히스토그램의 i열, j행의 확률이다. 그리고 엡실론()은 예를 들어 10-9와 같은 매우 작 은 수로, P(binij)가 0이 되는 경우 엔트로피가 산출되지 않는 문제를 해결하기 위한 것이다. 평균값 산출부는 엔트로피 산출부에서 산출된 엔트로피들의 평균값을 산출한다. 즉, 아래와 같이 어류 각 객체 움직임의 엔트로피 합을 객체의 수로 나눈다. 평균값은 활동성 지표(F)로서, 어류 군집의 상태를 나타 내는 지표가 된다."}
{"patent_id": "10-2022-0169466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기에서 N은 어류 객체의 수, Hi는 i번째 어류 움직임의 엔트로피이다. 분석부는 정지영상 보정부를 더 포함할 수 있다. 정지영상 보정부는 정지영상 추출부에서 추출된 각 정지영상을 보정하는 역할을 한다. 카메라가 360도 카메라인 경우, 카메라에서 촬영한 영상은 왜곡이 있게 되어, 이러한 영상을 그대로 사 용하는 경우에는 어류 군집 상태 파악의 정확성이 떨어질 수 있다. 따라서, 360도 카메라에서 촬영한 영상을 일반적인 카메라가 촬영하거나 사람의 시각으로 본 것과 같이 보 정해준다. 정지영상 보정부는 또한, 각 정지영상에서 객체 인식부가 어류 객체를 명확하게 인식할 수 있도록 명도 나 콘트라스트(contrast) 등을 조정해줄 수 있다. 본 발명에 의한 어류 양식장 모니터링 시스템은 사료 공급부, 수질 조절부 및 제어부를 더 포함 할 수 있다. 사료 공급부는 어류 양식장에 사료를 공급하는 역할을 한다. 예를 들어, 사료 공급부는 사료가 저장되 는 저장탱크(미도시)와 이 저장탱크의 개폐를 조절하는 개폐부(미도시)를 구비하여, 개폐부의 상태에 따라 저장 탱크 내의 사료가 양식장 내로 공급되거나 공급 중단될 수 있다. 수질 조절부는 어류 양식장의 수질을 조절하는 역할을 한다. 수질 조절부는 예를 들어, 양식장 내에 산 소를 공급하는 산소 공급부(미도시), 양식장 내의 물의 순환시키면서 필터링하는 필터링부(미도시) 등을 구비하 여 양식장 내 수질을 조절할 수 있다. 제어부는 분석부에서 도출된 어류 군집의 상태에 따라 사료 공급부 및/또는 수질 조절부를 제 어하는 역할을 한다. 예를 들어, 분석부에서 어류 군집의 활동성이 떨어진 것으로 판단하면 제어부는 사료 공급부가 양식장 내에 사료를 공급하고 수질 조절부가 양식장의 수질을 정화하도록 제어할 수 있 다. 본 발명의 권리범위는 상술한 실시예에 한정되는 것이 아니라 첨부된 특허청구범위 내에서 다양한 형태의 실시 예로 구현될 수 있다. 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술 분 야에서 통상의 지식을 가진 자라면 누구든지 변형 가능한 다양한 범위까지 본 발명의 청구범위 기재의 범위 내 에 있는 것으로 본다."}
{"patent_id": "10-2022-0169466", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 어류 양식장 모니터링 시스템의 개략적인 구성도, 도 2는 본 발명에 의한 어류 양식장 모니터링 시스템을 구성하는 카메라부에 대한 설명도, 도 3은 본 발명에 의한 어류 양식장 모니터링 시스템을 구성하는 객체 인식부의 동작에 대한 설명도, 도 4는 본 발명에 의한 어류 양식장 모니터링 시스템을 구성하는 확률 분포 산출부의 동작에 대한 설명도이다."}
