{"patent_id": "10-2025-7006666", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0043524", "출원번호": "10-2025-7006666", "발명의 명칭": "다중 송수신 지점 통신을 위한 제어 메커니즘", "출원인": "노키아 테크놀로지스 오와이", "발명자": "라두 키스 살리야 자야싱헤"}}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기능부에 의해 사용되는 장치로서, 적어도 하나의 처리 회로부와,명령어를 저장하는 적어도 하나의 메모리를 포함하되,상기 명령어는, 상기 적어도 하나의 프로세서에 의해 실행될 때, 상기 장치로 하여금 적어도,예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채널 상태 정보 보고 구성 정보를 획득하게 하고,측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트를 포함하는 복수의 빔을 수신하게하며,통신 네트워크의 각각의 TRP에 대한 상기 수신된 복수의 빔의 연관을 결정하게 하고,동시 수신을 위한 빔 그룹을 식별하기 위해 상기 측정을 위한 적어도 하나의 빔 세트로부터 자원을 측정하게 하며,예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하게 하고, 상기 추가 빔 그룹은 상기측정을 위한 적어도 하나의 빔 세트 및 상기 예측을 위한 적어도 하나의 빔 세트의 빔을 포함하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,상기 예측 모델에 기초한 예측이 적어도 하나의 추가 빔 그룹의 출력을 초래하는 경우, 상기 통신 네트워크의TRP에 결과적인 추가 빔 그룹의 적어도 일부를 사전 정의된 순서대로 보고하게 하고, 상기 사전 정의된 순서는상기 보고된 추가 빔 그룹의 동시 수신을 위한 적합성 레벨을 반영하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,상기 결과적인 추가 빔 그룹의 적어도 일부를 보고할 때, 상기 적어도 하나의 추가 빔 그룹의 빔의 통신 속성을나타내는 추가 파라미터를 포함하게 하며, 상기 통신 속성은 참조 신호 수신 전력 표시, 신호 대 간섭 플러스잡음 비, 사용된 상기 예측 모델에 연관된 신뢰성 메트릭 및 기능 값 세트의 표시 중 적어도 하나를 포함하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,공개특허 10-2025-0043524-3-예측에 기초한 그룹 기반 빔 보고를 지원하는 기능을 상기 통신 네트워크의 TRP에 보고하게 하며, 상기 채널 상태 정보 보고 구성 정보는 상기 기능의 보고에 응답하여 수신되는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,통신 네트워크의 각각의 TRP에 대한 상기 수신된 복수의 빔의 연관을 결정하기 위해, 상기 통신 네트워크의 적어도 2개의 송신 지점과 수신된 참조 신호의 연관을 나타내는 사전 정의되거나 수신된 구성을 사용하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,빔은 채널 상태 정보 참조 신호와 동기화 신호 블록 자원 중 적어도 하나를 포함하는 다운링크 참조 신호 자원으로 표현되고, 상기 다운링크 참조 신호 자원은 그룹으로 그룹화되며, 각각의 그룹은 각각의 TRP에 대응하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 측정을 위한 적어도 하나의 빔 세트는 대응하는 TRP에 의해 전송되는 다운링크 참조 신호를 포함하고,상기 예측을 위한 적어도 하나의 빔 세트는 대응하는 TRP에 의해 전송되지 않는 다운링크 참조 신호를포함하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 식별된 빔 그룹 또는 상기 추가 빔 그룹을 형성하는 빔 그룹은,a) 2개의 TRP 또는 공간 필터에 대응하는 빔 - 적어도 하나의 빔은 하나의 TRP 또는 공간 필터에 대응하고 다른빔은 다른 TRP 또는 공간 필터에 대응함 - , 또는b) 단 하나의 TRP 또는 공간 필터에 대응하는 빔 - 상기 빔 그룹의 빔의 하나의 서브세트는 상기 측정을 위한빔 세트로부터 결정되고, 상기 빔 그룹의 빔의 다른 서브세트는 상기 예측을 위한 빔 세트로부터 결정됨 - 중 하나를 포함하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,공개특허 10-2025-0043524-4-상기 명령어는 또한 상기 장치로 하여금 적어도,동시 수신을 위한 빔 그룹을 식별하기 위해 상기 측정을 위한 적어도 하나의 빔 세트로부터의 상기 자원으로서,상기 통신 네트워크로부터의 신호 전송을 기초로 하여 참조 신호 수신 전력 또는 채널 상태 정보량 중 적어도하나를 측정하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,동시 수신에 사용할 수 있는 상기 추가 빔 그룹을 결정하는 데 사용되는 상기 예측 모델은, 완전 연결 신경망블록(fully connected neuronal network block), 활성화 함수 계층(activation function layer) 및 배치 정규화 계층(batch normalization layer) 중 적어도 하나를 포함하는 복수의 신경망 블록을 갖는 신경망 구성을 사용하는 머신 러닝 예측 모델인,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,동시 수신에 사용할 수 있는 상기 추가 빔 그룹을 결정하는 데 사용되는 상기 예측 모델은 비머신 러닝 예측 모델인,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항 내지 제11항 중 어느 한 항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,상기 예측 모델의 입력 데이터로서, 동시 수신을 위해 빔 측정치와 식별된 빔 그룹을 사용하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,상기 획득된 채널 상태 정보 보고 구성 정보에 의해 제공된 정보에 기초하여 적용될 예측 모델을 결정하게하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 내지 제13항 중 어느 한 항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,동시 수신에 사용할 수 있는 상기 결정된 추가 빔 그룹의 적어도 일부를 업링크 제어 정보로서 상기 통신 네트공개특허 10-2025-0043524-5-워크에 보고하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제14항 중 어느 한 항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,동시 수신에 사용 가능한 것으로 식별되거나 결정된 빔을 수신하도록 조정된 공간 필터를 적용하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항 내지 제15항 중 어느 한 항에 있어서,상기 통신 요소 또는 통신 기능부는 상기 통신 네트워크의 복수의 TRP로부터의 빔을 동시에 수신하기 위한 복수의 수신 패널을 갖는 사용자 장비에 포함되는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기능부에서 사용하기 위한 방법으로서,예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채널 상태 정보 보고 구성 정보를 획득하는 단계와,측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트를 포함하는 복수의 빔을 수신하는단계와,통신 네트워크의 각각의 TRP에 대한 상기 수신된 복수의 빔의 연관을 결정하는 단계와,동시 수신을 위한 빔 그룹을 식별하기 위해 상기 측정을 위한 적어도 하나의 빔 세트로부터 자원을 측정하는 단계와,예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 단계를 포함하고, 상기 추가 빔 그룹은 상기 측정을 위한 적어도 하나의 빔 세트 및 상기 예측을 위한 적어도 하나의 빔 세트의 빔을 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 예측 모델에 기초한 예측이 적어도 하나의 추가 빔 그룹의 출력을 초래하는 경우, 상기 통신 네트워크의TRP에 결과적인 추가 빔 그룹의 적어도 일부를 사전 정의된 순서대로 보고하는 단계를 더 포함하고, 상기 사전정의된 순서는 상기 보고된 추가 빔 그룹의 동시 수신을 위한 적합성 레벨을 반영하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 결과적인 추가 빔 그룹의 적어도 일부를 보고할 때, 상기 적어도 하나의 추가 빔 그룹의 빔의 통신 속성을공개특허 10-2025-0043524-6-나타내는 추가 파라미터를 포함하는 단계를 더 포함하며, 상기 통신 속성은 참조 신호 수신 전력 표시, 신호 대간섭 플러스 잡음 비, 사용된 상기 예측 모델에 연관된 신뢰성 메트릭 및 기능 값 세트의 표시 중 적어도 하나를 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17항 내지 제19항 중 어느 한 항에 있어서,예측에 기초한 그룹 기반 빔 보고를 지원하는 기능을 상기 통신 네트워크의 TRP에 보고하는 단계를 더포함하며, 상기 채널 상태 정보 보고 구성 정보는 상기 기능의 보고에 응답하여 수신되는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제17항 내지 제20항 중 어느 한 항에 있어서,통신 네트워크의 각각의 TRP에 대한 상기 수신된 복수의 빔의 연관을 결정하기 위해, 상기 통신 네트워크의 적어도 2개의 송신 지점과 수신된 참조 신호의 연관을 나타내는 사전 정의되거나 수신된 구성을 사용하는 단계를더 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제17항 내지 제21항 중 어느 한 항에 있어서,빔은 채널 상태 정보 참조 신호와 동기화 신호 블록 자원 중 적어도 하나를 포함하는 다운링크 참조 신호 자원으로 표현되고, 상기 다운링크 참조 신호 자원은 그룹으로 그룹화되며, 각각의 그룹은 각각의 TRP에 대응하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제17항 내지 제22항 중 어느 한 항에 있어서,상기 측정을 위한 적어도 하나의 빔 세트는 대응하는 TRP에 의해 전송되는 다운링크 참조 신호를 포함하고,상기 예측을 위한 적어도 하나의 빔 세트는 대응하는 TRP에 의해 전송되지 않는 다운링크 참조 신호를포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제17항 내지 제23항 중 어느 한 항에 있어서,상기 식별된 빔 그룹 또는 상기 추가 빔 그룹을 형성하는 빔 그룹은,a) 2개의 TRP 또는 공간 필터에 대응하는 빔 - 적어도 하나의 빔은 하나의 TRP 또는 공간 필터에 대응하고 다른빔은 다른 TRP 또는 공간 필터에 대응함 - , 또는b) 단 하나의 TRP 또는 공간 필터에 대응하는 빔 - 상기 빔 그룹의 빔의 하나의 서브세트는 상기 측정을 위한공개특허 10-2025-0043524-7-빔 세트로부터 결정되고, 상기 빔 그룹의 빔의 다른 서브세트는 상기 예측을 위한 빔 세트로부터 결정됨 - 중 하나를 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제17항 내지 제24항 중 어느 한 항에 있어서,동시 수신을 위한 빔 그룹을 식별하기 위해 상기 측정을 위한 적어도 하나의 빔 세트로부터의 상기 자원으로서,상기 통신 네트워크로부터의 신호 전송을 기초로 하여 참조 신호 수신 전력 또는 채널 상태 정보량 중 적어도하나를 측정하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제17항 내지 제25항 중 어느 한 항에 있어서,동시 수신에 사용할 수 있는 상기 추가 빔 그룹을 결정하는 데 사용되는 상기 예측 모델은 완전 연결 신경망 블록, 활성화 함수 계층 및 배치 정규화 계층 중 적어도 하나를 포함하는 복수의 신경망 블록을 갖는 신경망 구성을 사용하는 머신 러닝 예측 모델인,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제17항 내지 제25항 중 어느 한 항에 있어서,동시 수신에 사용할 수 있는 상기 추가 빔 그룹을 결정하는 데 사용되는 상기 예측 모델은 비머신 러닝 예측 모델인,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제17항 내지 제27항 중 어느 한 항에 있어서,상기 예측 모델의 입력 데이터로서, 동시 수신을 위한 빔 측정치와 식별된 빔 그룹을 사용하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제17항 내지 제28항 중 어느 한 항에 있어서,상기 획득된 채널 상태 정보 보고 구성 정보에 의해 제공된 정보에 기초하여 적용될 예측 모델을 결정하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "공개특허 10-2025-0043524-8-제17항 내지 제29항 중 어느 한 항에 있어서,동시 수신에 사용할 수 있는 상기 결정된 추가 빔 그룹의 적어도 일부를 업링크 제어 정보로서 상기 통신 네트워크에 보고하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제17항 내지 제30항 중 어느 한 항에 있어서,동시 수신에 사용 가능한 것으로 식별되거나 결정된 빔을 수신하도록 조정된 공간 필터를 적용하는 단계를 더포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제17항 내지 제31항 중 어느 한 항에 있어서,상기 통신 요소 또는 통신 기능부는 상기 통신 네트워크의 복수의 TRP로부터의 빔을 동시에 수신하기 위한 복수의 수신 패널을 갖는 사용자 장비에 포함되는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "통신 요소 또는 통신 기능부와 통신하기 위한 송수신 지점(TRP)으로서 작동하는 통신 네트워크 제어 요소 또는통신 네트워크 제어 기능부에 의해 사용되는 장치로서,적어도 하나의 처리 회로부와,명령어를 저장하는 적어도 하나의 메모리를 포함하되,상기 명령어는, 상기 적어도 하나의 프로세서에 의해 실행될 때, 상기 장치로 하여금 적어도,예측에 기초한 그룹 기반 빔 보고를 지원하기 위한 통신 요소 또는 통신 기능부의 기능의 표시를 수신하게하고,예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 채널 상태 정보 보고 구성 정보를 상기 통신 요소 또는통신 기능부에 송신하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제33항에 있어서,상기 명령어는 또한 상기 장치로 하여금 적어도,상기 채널 상태 정보 보고 구성 정보에 대응하는 비주기적 채널 상태 정보 보고를 상기 통신 요소 또는 통신 기능부에 트리거함으로써 예측에 기초한 그룹 기반 빔 보고를 트리거하게 하는,장치."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "공개특허 10-2025-0043524-9-통신 요소 또는 통신 기능부와 통신하기 위한 송수신 지점(TRP)으로서 작동하는 통신 네트워크 제어 요소 또는통신 네트워크 제어 기능부에서 사용하기 위한 방법으로서,예측에 기초한 그룹 기반 빔 보고를 지원하기 위한 통신 요소 또는 통신 기능부의 기능의 표시를 수신하는 단계와,예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 채널 상태 정보 보고 구성 정보를 상기 통신 요소 또는통신 기능부에 송신하는 단계를 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제35항에 있어서,상기 채널 상태 정보 보고 구성 정보에 대응하는 비주기적 채널 상태 정보 보고를 상기 통신 요소 또는 통신 기능부에 트리거함으로써 예측에 기초한 그룹 기반 빔 보고를 트리거하는 단계를 더 포함하는,방법."}
{"patent_id": "10-2025-7006666", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "컴퓨터용 컴퓨터 프로그램 제품으로서,상기 제품이 상기 컴퓨터에서 실행될 때, 제17항 내지 제32항 또는 제35항 및 제36항 중 어느 한 항의 단계를수행하기 위한 소프트웨어 코드 부분을 포함하는,컴퓨터 프로그램 제품."}
{"patent_id": "10-2025-7006666", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기능부에 의해 사용되는 장치로서, 장치는 적어도 하나의 처리 회로부와, 명령어를 저장하는 적어도 하나의 메모리를 포함하되, 명령어는, 적어도 하나의 프로세서에 의해 실행될 때, 장치로 하여금 적어도, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채 널 상태 정보 보고 구성 정보를 획득하게 하고, 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나 의 빔 세트를 포함하는 복수의 빔을 수신하게 하며, 통신 네트워크의 각각의 TRP에 대한 수신된 복수의 빔의 연 관을 결정하게 하고, 동시 수신을 위한 빔 그룹을 식별하기 위해 측정을 위한 적어도 하나의 빔 세트로부터 자원 을 측정하게 하며, 예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하게 하고, 추가 빔 그룹은 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트의 빔을 포함한다."}
{"patent_id": "10-2025-7006666", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 예는 빔 관리를 사용하여 다중 송신 지점을 제어하는 데 사용할 수 있는 장치, 방법, 시스템, 컴퓨터 프로그램, 컴퓨터 프로그램 제품 및 (비일시적) 컴퓨터 판독가능 매체에 관한 것이다. 구체적으로, 본 개시의 예는 사용자 장비와 같은 통신 요소 또는 통신 기능부가 통신 네트워크의 복수의 송수신 지점과 통신할 수 있게 하는 개선된 빔 관리를 가능하게 하는 데 사용할 수 있는 장치, 방법, 시스템, 컴퓨터 프로그램, 컴퓨터 프로그 램 제품 및 (비일시적) 컴퓨터 판독가능 매체에 관한 것이다."}
{"patent_id": "10-2025-7006666", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배경 기술에 대한 다음 설명은 관련 선행 기술에 알려지지 않은 개시와 함께 본 개시에 의해 제공되지만 본 개 시의 실시예의 적어도 일부 예에 대한 통찰력, 발견, 이해 또는 개시 또는 연관성을 포함할 수 있다. 이러한 개 시의 기여 중 일부는 아래에 구체적으로 지적될 수 있지만, 이러한 개시의 기여 중 다른 기여는 관련 맥락에서 분명해질 것이다. 본 명세서에 사용된 약어에 대한 다음의 의미가 적용된다: 3GPP 3세대 파트너십 프로젝트 4G 4세대 5G 5세대 AI 인공지능 CPU 중앙 처리 유닛 CIR 구성 정보 요청 CRI CSI-RS 자원 표시기 CSI 채널 상태 정보 DL 다운링크 DCI 다운링크 제어 정보 eNB E-UTRAN 노드 B FNN 완전 연결 신경망 FR 주파수 범위 gNB 차세대 노드 B ID 식별 L1 레벨 1 LTE 롱 텀 에볼루션 LTE-A LTE 어드밴스 ML 머신 러닝 MU MIMO 다중 사용자 다중 입력 다중 출력 NN 신경망 NW 네트워크, 네트워크 측 PDCCH 물리적 다운링크 제어 채널 PDSCH 물리적 다운링크 공유 채널 RS 참조 신호 RSRP 참조 신호 수신 전력 RRC 무선 자원 제어 Rx 수신기 SINR 신호 대 간섭 플러스 잡음 비 SGD 확률적 기울기 하강 SSB 동기화 신호 블록 TRP 송수신 지점 Tx 송신기 UE 사용자 장비 UL 업링크 실시예의 예에 따르면, 예를 들어, 다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기능부 에 의해 사용되는 장치가 제공되며, 장치는 적어도 하나의 처리 회로부와, 명령어를 저장하는 적어도 하나의 메 모리를 포함하되, 명령어는, 적어도 하나의 프로세서에 의해 실행될 때, 장치로 하여금 적어도, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채널 상태 정보 보고 구성 정보를 획득하게 하고, 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트를 포함하는 복수의 빔을 수신하게 하며, 통신 네트워크 의 각각의 TRP에 대한 수신된 복수의 빔의 연관을 결정하게 하고, 동시 수신을 위한 빔 그룹을 식별하기 위해 측정을 위한 적어도 하나의 빔 세트로부터 자원을 측정하게 하며, 예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하게 하고, 추가 빔 그룹은 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트의 빔을 포함한다. 또한, 실시예의 예에 따르면, 예를 들어, 다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기능부에서 사용하기 위한 방법이 제공되며, 방법은 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채 널 상태 정보 보고 구성 정보를 획득하는 단계와, 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트를 포함하는 복수의 빔을 수신하는 단계와, 통신 네트워크의 각각의 TRP에 대한 수신된 복수의 빔의 연관을 결정하는 단계와, 동시 수신을 위한 빔 그룹을 식별하기 위해 측정을 위한 적어도 하나의 빔 세트 로부터 자원을 측정하는 단계와, 예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 단계를 포함하고, 추가 빔 그룹은 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트의 빔을 포함한다. 추가 개선에 따라, 이들 예는 다음 특징 중 하나 이상을 포함할 수 있다: - 예측 모델에 기초한 예측이 적어도 하나의 추가 빔 그룹의 출력을 초래하는 경우, 결과적인 추가 빔 그룹의 적어도 일부가 통신 네트워크의 TRP에 사전 정의된 순서대로 보고될 수 있고, 사전 정의된 순서는 보고된 추가 빔 그룹의 동시 수신을 위한 적합성 레벨을 반영한다. - 결과적인 추가 빔 그룹의 적어도 일부를 보고할 때, 적어도 하나의 추가 빔 그룹의 빔의 통신 속성을 나타내 는 추가 파라미터가 포함될 수 있으며, 통신 속성은 참조 신호 수신 전력 표시, 신호 대 간섭 플러스 잡음 비, 사용된 예측 모델에 연관된 신뢰성 메트릭 및 기능 값 세트의 표시 중 적어도 하나를 포함할 수 있다. - 예측에 기초한 그룹 기반 빔 보고를 지원하는 기능이 통신 네트워크의 TRP에 보고될 수 있으며, 채널 상태 정 보 보고 구성 정보는 기능의 보고에 응답하여 수신될 수 있다. - 통신 네트워크의 각각의 TRP에 대한 수신된 복수의 빔의 연관을 결정하기 위해, 통신 네트워크의 적어도 2개 의 송신 지점과 수신된 참조 신호의 연관을 나타내는 사전 정의되거나 수신된 구성이 사용될 수 있다. - 빔은 채널 상태 정보 참조 신호와 동기화 신호 블록 자원 중 적어도 하나를 포함하는 다운링크 참조 신호 자 원으로 표현될 수 있고, 다운링크 참조 신호 자원은 그룹으로 그룹화될 수 있으며, 각각의 그룹은 각각의 TRP에 대응한다. - 측정을 위한 적어도 하나의 빔 세트는 대응하는 TRP에 의해 전송되는 다운링크 참조 신호를 포함하고, 예측을 위한 적어도 하나의 빔 세트는 대응하는 TRP에 의해 전송되지 않는 다운링크 참조 신호를 포함할 수 있다. - 식별된 빔 그룹 또는 추가 빔 그룹을 형성하는 빔 그룹은, a) 2개의 TRP 또는 공간 필터에 대응하는 빔 - 적 어도 하나의 빔은 하나의 TRP 또는 공간 필터에 대응하고 다른 빔은 다른 TRP 또는 공간 필터에 대응함 - , 또 는 b) 단 하나의 TRP 또는 공간 필터에 대응하는 빔 - 빔 그룹의 빔의 하나의 서브세트는 측정을 위한 빔 세트 로부터 결정되고, 빔 그룹의 빔의 다른 서브세트는 예측을 위한 빔 세트로부터 결정됨 - 중 하나를 포함할 수 있다. - 동시 수신을 위한 빔 그룹을 식별하기 위해 측정을 위한 적어도 하나의 빔 세트로부터의 자원으로서, 통신 네 트워크로부터의 신호 전송을 기초로 하여 참조 신호 수신 전력 또는 채널 상태 정보량 중 적어도 하나가 측정될 수 있다. - 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 데 사용되는 예측 모델은 완전 연결 신경망 블록(fully connected neuronal network block), 활성화 함수 계층(activation function layer) 및 배치 정규화 계층 (batch normalization layer) 중 적어도 하나를 포함하는 복수의 신경망 블록을 갖는 신경망 구성을 사용하는 머신 러닝 예측 모델일 수 있다. - 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 데 사용되는 예측 모델은 비머신 러닝 예측 모델일 수 있다. - 예측 모델의 입력 데이터로서, 동시 수신을 위한 빔 측정치와 식별된 빔 그룹이 사용될 수 있다. - 획득된 채널 상태 정보 보고 구성 정보에 의해 제공된 정보에 기초하여 적용될 예측 모델이 결정될 수 있다. - 동시 수신에 사용할 수 있는 결정된 추가 빔 그룹의 적어도 일부가 업링크 제어 정보로서 통신 네트워크에 보 고될 수 있다. - 동시 수신에 사용 가능한 것으로 식별되거나 결정된 빔을 수신하도록 조정된 공간 필터가 적용될 수 있다. - 통신 요소 또는 통신 기능부는 통신 네트워크의 복수의 TRP로부터의 빔을 동시에 수신하기 위한 복수의 수신 패널을 갖는 사용자 장비에 포함될 수 있다. 실시예의 예에 따르면, 예컨대, 통신 요소 또는 통신 기능부와 통신하기 위한 송수신 지점(TRP)으로서 작동하는 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에 의해 사용되는 장치가 제공되고, 장치는 적어도 하 나의 처리 회로부와, 명령어를 저장하는 적어도 하나의 메모리를 포함하되, 명령어는, 적어도 하나의 프로세서 에 의해 실행될 때, 장치로 하여금 적어도, 예측에 기초한 그룹 기반 빔 보고를 지원하기 위한 통신 요소 또는 통신 기능부의 기능의 표시를 수신하게 하고, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 채널 상 태 정보 보고 구성 정보를 통신 요소 또는 통신 기능부에 송신하게 한다. 또한, 실시예의 예에 따르면, 예컨대, 통신 요소 또는 통신 기능부와 통신하기 위한 송수신 지점(TRP)으로서 작 동하는 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에서 사용하기 위한 방법이 제공되며, 방법은 예측에 기초한 그룹 기반 빔 보고를 지원하기 위한 통신 요소 또는 통신 기능부의 기능의 표시를 수신하는 단계 와, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 채널 상태 정보 보고 구성 정보를 통신 요소 또는 통신 기능부에 송신하는 단계를 포함한다. 추가 개선에 따라, 이들 예는 다음을 포함할 수 있다: - 예측에 기초한 그룹 기반 빔 보고는 채널 상태 정보 보고 구성 정보에 대응하는 비주기적 채널 상태 정보 보 고를 통신 요소 또는 통신 기능부에 트리거함으로써 트리거될 수 있다. 또한, 실시예에 따르면, 예를 들어, 컴퓨터용 컴퓨터 프로그램 제품이 제공되며, 컴퓨터 프로그램 제품이 컴퓨 터에서 실행될 때, 위 정의된 방법의 단계를 수행하기 위한 소프트웨어 코드 부분을 포함한다. 컴퓨터 프로그램 제품은 소프트웨어 코드 부분이 저장되는 컴퓨터 판독가능 매체를 포함할 수 있다. 또한, 컴퓨터 프로그램 제품 은 컴퓨터의 내부 메모리에 직접 로딩되고/되거나, 업로드, 다운로드, 푸시 절차 중 적어도 하나에 의해 네트워 크를 통해 전송될 수 있다."}
{"patent_id": "10-2025-7006666", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "최근 몇 년 동안, 예를 들어, 통합 서비스 디지털 네트워크(ISDN), 디지털 가입자 회선(DSL)과 같은 유선 기반 통신 네트워크 또는 cdma2000(code division multiple access) 시스템, UMTS(Universal Mobile Telecommunications System)와 같은 3세대 셀룰러, 에컨대, 롱 텀 에볼루션(LTE) 또는 롱 텀 에볼루션 어드밴 스(LTE-A)에 기반한 4세대(4G) 통신 네트워크 또는 향상된 통신 네트워크, 5세대(5G) 통신 네트워크, GSM(Global System for Mobile communications), GPRS(General Packet Radio System), EDGE(Enhanced Data Rates for Global Evolution)와 같은 셀룰러 2세대(2G) 통신 네트워크와 같은 무선 통신 네트워크, 또는 WLAN(Wireless Local Area Network), 블루투스 또는 WiMAX(Worldwide Interoperability for Microwave Access)와 같은 기타 무선 통신 시스템의 통신 네트워크의 확장이 전 세계적으로 확대되었다. 유럽 전기통신 표 준 협회(ETSI), 3세대 파트너십 프로젝트(3GPP), TISPAN(Telecoms & Internet converged Services & Protocolsfor Advanced Networks), ITU(International Telecommunication Union), 3GPP2(3rd Generation Partnership Project 2), IETF(Internet Engineering Task Force), IEEE(Institute of Electrical and Electronics Engineers), WiMAX 포럼과 같은 다양한 조직에서 원격통신 네트워크 및 액세스 환경에 대한 표준이나 사양을 연 구하고 있다. 처리량, 견고성, 정확성, 신뢰성 등 통신 네트워크의 성능을 향상시키기 위해, 여러 가지 개발이 이루어지고 있 다. 예를 들어, 5G 네트워크에서는 빔포밍(또는 빔 관리)과 MU MIMO가 결합되어 예컨대, 처리량 및 연결 밀도와 관하여 성능을 증가시킨다. 대용량 MIMO는 다중 안테나 어레이와 공간 다중화를 사용하여 \"스트림\"이라고 하는 독립적이고 개별적으로 인코딩된 데이터 신호를 전송한다. 이를 통해 동일한 시구간 및 주파수 자원을 통해 다 중 사용자 장비(UE)와 동시에 통신할 수 있다. 반면에, 빔포밍은 MIMO와 함께 사용되어 개별 UE에 더 밀접하게 통신 빔을 집중시킴으로써 더 높은 연결 밀도를 가능하게 하고 개별 빔 간의 간섭을 최소화한다. 성능을 더욱 향상시키기 위해, 일례로서, 예컨대, 릴리스 18 3GPP 사양에서 NR 무선 인터페이스에 대한 인공지 능(AI)/머신 러닝(ML)에 대한 연구가 진행되고 있다. 목표는 성능 향상 및/또는 복잡성/오버헤드 감소를 위해 AI/ML 기반 알고리즘의 지원을 개선할 수 있는 특징으로 무선 인터페이스를 강화하는 것의 이점을 탐구하는 것 이다. 하나의 목표로서, 다양한 프로젝트에서 사용할 수 있는 AI/ML 아키텍처의 기능적 요구 사항을 포함하여 공통 AI/ML 프레임워크를 식별할 수 있도록 충분한 사용 사례를 고려해야 한다. 또한 AI/ML이 무선 인터페이스 기능의 성능을 향상시킬 수 있는 영역을 식별하려고 한다. 하나의 초기 사용 사례는 빔 관리이다. 예를 들어, 공간 영역에서의 빔 예측(BM-Case1)과 오버헤드 및 지연 감 소를 위한 시간 영역에서의 빔 예측(BM-Case2)과 관련된 방안이 고려된다. 위에서 언급한 사용 사례인 BM-Case1과 BM-Case2와 관련하여, 예를 들어, AI/ML 기반 빔 관리의 경우, BM- Case1은 빔 세트 B의 측정 결과를 기반으로 빔 세트 A에 대한 공간 영역 DL 빔 예측과 관련하여 고려되어야 하 며, BM-Case2는 빔 세트 B의 이력적 측정 결과를 기반으로 빔 세트 A에 대한 시간적 DL 빔 예측과 관련하여 고 려되어야 한다. 세트 A와 세트 B의 빔이 동일한 주파수 범위(FR)에 있을 수 있다는 점에 유의해야 한다. 예를 들어, 사용 사례 BM-Case1의 경우, 세트 B가 세트 A의 서브세트이거나, 세트 A와 세트 B의 빔이 다를 수 있다. 일반적으로, 세트 B는 DL 빔 측정을 위한 것이고, 세트 A는 DL 예측을 위한 것이다. AI/ML 입력의 경우, 세트 B를 기반으로 L1-RSRP 측정만 수행되거나, 또는 이와 달리 세트 B와 지원 정보를 기반 으로 L1-RSRP 측정이 수행되는 것으로 간주된다. 예를 들어, 사용 가능한 지원 정보는 다음 중 하나 이상을 포 함할 수 있다: Tx 및/또는 Rx 빔 모양 정보(예컨대, Tx 및/또는 Rx 빔 패턴, Tx 및/또는 Rx 빔 조준 방향(방위 각 및 고도), 3dB 빔폭 등), 예측을 위한 예상 Tx 및/또는 Rx 빔(예컨대, 예측을 위한 예상 Tx 및/또는 Rx 각도, Tx 및/또는 Rx 빔 ID), UE 위치 정보, UE 방향 정보, Tx 빔 사용 정보, UE 배향 정보 등. 5G NR(New Radio) 시스템과 같은 통신 네트워크에서, 빔 포밍은 gNB와 같은 네트워크 측 송수신 지점(TRP)과 사 용자 장비(UE) 측 양쪽에서 사용된다. 빔 관리는 통신을 위해 TRP와 UE 빔을 획득하고 유지하는 데 사용된다. 예를 들어, 빔 관리 절차는 TRP가 사용할 적절한 Tx 빔과 UE가 사용할 적절한 Rx 빔을 결정하는 데 사용된다. 그런 다음 선택된 TRP Tx 빔과 UE Rx 빔이 통신에 사용된다. 빔 관리를 위한 참조 신호는 예를 들어, 채널 상태 정보 참조 신호(CSI-RS) 또는 동기화 신호 블록(SSB)이다. 예를 들어, TRP는 UE에 특정 참조 신호를 보내고, UE는 참조 신호를 사용하여 무선 링크 품질을 측정한다. 측정 후에, UE는 통신에 더 적합한 Tx 빔을 TRP에 보고할 수 있으며, 보고 내용에는 Tx 빔 인덱스 또는 빔 페어 링크 인덱스 및 참조 신호 수신 전력(RSRP)이 포함될 수 있다. 빔의 수가 많다는 점을 고려하면, 빔 상태를 보고하기 위한 오버헤드가 높을 수 있다. 이 오버헤드를 줄이기 위해, 그룹 기반 빔 보고가 제안되었다. UE는 동시에 수 신될 수 있는 여러 개, 예컨대, 2개의 Tx 빔을 보고할 수 있다. 보다 구체적으로, 3GPP에서는 다음과 같은 그룹 기반 빔 보고 메커니즘이 제공된다. 릴리스 15에서, 그룹 기반 빔 보고(groupBasedBeamReporting)는 UE가 UE에 의해 동시에 수신될 수 있는 2개의 빔을 보고할 수 있게 한다. UE는 2개의 빔이 동일한 TRP 또는 다른 TRP에서 오는 것인지 알지 못한다. 예를 들 어, 릴리스 15 보고는 L1-RSRP 또는 L1-SINR 보고(reportQuantity가 'cri-RSRP', 'ssb-Index-RSRP', 'cri- RSRP-CapabilitySetIndex', 'ssb-Index-RSRP-CapabilitySetIndex', 'cri-SINR', 'ssb-Index-SINR', 'cri- SINR-CapabilitySetIndex' 또는 'ssb-Index-SINR-CapabilitySetIndex'로 설정된 CSI-ReportConfig)에 유효하다. 반면, 릴리스 17에서 그룹 기반 빔 보고는 UE가 보고 설정에 대해 두 개의 CSI 자원 세트 각각에서 하나의 CSI- RS 또는 SSB를 선택하여 두 개의 CRI 또는 SSBRI 그룹(들)을 보고할 수 있게 하며, 각 그룹의 CSI-RS 및/또는 SSB 자원은 UE에 의해 동시에 수신될 수 있다. 여기서, UE는 TRP 연관에 대한 빔을 인식하고 있으며, 빔 그룹에 서 보고된 빔은 다른 TRP에서 온 것이다. 릴리스 17 그룹 기반 빔 보고(groupBasedBeamReporting-r17)는 두 개 의 CSI 자원 세트에 대해 UE를 구성함으로써 지원된다. 이와 달리, 구성되는 CSI-RS 자원 세트의 수가 하나로 제한된다. 릴리스 17 보고는 L1-RSRP 보고(reportQuantity가 'cri-RSRP', 'ssb-Index-RSRP', 'cri-RSRP- CapabilitySetIndex', 또는 'ssb-Index-RSRP-CapabilitySetIndex'로 설정된 CSI-ReportConfig)에 유효하다. 다음에서는, AI/ML을 이용한 그룹 기반 보고가 사용되는 복수의 TRP와 UE의 동시 통신을 개선하기 위한 처리를 설명하기 위해 개시의 다양한 예가 설명될 것이다. 이를 위해, 개시의 예가 적용될 수 있는 통신 네트워크의 예 로서, 5G와 같은 통신 네트워크에 대한 3GPP 표준을 기반으로 하는 통신 네트워크 아키텍처가 사용되지만, 개시 를 그러한 아키텍처로 제한하지는 않는다. 당업자에게는 개시의 예가 다른 종류의 통신 네트워크, 예를 들어 Wi-Fi, WiMAX(worldwide interoperability for microwave access), Bluetooth®, PCS(personal communications service), ZigBee®, WCDMA(wideband code division multiple access), UWB(ultra-wideband) 기술을 사용하는 시스템, 모바일 애드혹 네트워크(MANET), 유선 액세스 등에도 적용될 수 있다는 것이 분명하다. 또한, 일반성을 잃지 않고, 개시의 몇 가지 예에 대한 설명은 이동 통신 네트워크와 관련이 있지만, 개시의 원칙은 유선 통신 네트워크와 같은 임의의 다른 유형의 통신 네트워크에도 확장되고 적용될 수 있다. 다음의 예와 실시예는 단지 예시적인 것으로 이해되어야 한다. 명세서는 여러 위치에서 \"하나의\" 또는 \"몇몇\" 예(들) 또는 실시예(들)를 언급할 수 있지만, 이것이 반드시 각각의 그러한 언급이 동일한 예(들) 또는 실시예 (들)와 관련이 있거나, 특징이 하나의 예시 또는 실시예에만 적용된다는 것을 의미하지는 않는다. 상이한 실시 예의 단일 특징들을 결합하여 다른 실시예를 제공할 수도 있다. 또한, \"포함하는\"과 같은 용어는 설명된 실시예 가 언급된 특징들로만 구성되도록 제한하지 않는 것으로 이해되어야 하며, 이러한 예와 실시예는 구체적으로 언 급되지 않은 특징, 구조, 유닛, 모듈 등을 포함할 수도 있다. 개시의 일부 예가 적용 가능한 이동 통신 시스템을 포함하는 (원격)통신 네트워크의 기본 시스템 아키텍처는 무 선 액세스 네트워크 서브시스템(들) 및 코어 네트워크(들)를 포함하는 하나 이상의 통신 네트워크의 아키텍처를 포함할 수 있다. 이러한 아키텍처는 하나 이상의 통신 네트워크 제어 요소 또는 기능부, 액세스 네트워크 요소, 무선 액세스 네트워크 요소, 액세스 서비스 네트워크 게이트웨이 또는 베이스 트랜시버 스테이션(base transceiver stations), 예컨대, 기지국(BS), 액세스 포인트(AP), 노드B(NB), eNB 또는 gNB, 분산형 또는 중앙 집중형 유닛을 포함할 수 있으며, 이는 각각의 커버리지 영역 또는 셀(들)을 제어하고, 통신 요소, UE와 같은 사용자 디바이스 또는 단말 디바이스와 같은 하나 이상의 통신 스테이션, 또는 UE와 같은 통신을 수행할 수 있 는 스테이션, 요소, 기능부 또는 애플리케이션, 머신 간 통신 아키텍처에서 사용 가능한 요소 또는 기능부의 일 부일 수 있거나, 또는 통신을 수행할 수 있는 요소, 기능부 또는 애플리케이션에 별개의 요소로서 부착된 모뎀 칩셋, 칩, 모듈 등과 같은 유사한 기능을 가진 다른 디바이스는 복수의 액세스 도메인에서 여러 유형의 데이터 를 송신하기 위한 하나 이상의 통신 빔을 통해 하나 이상의 채널을 통해 통신할 수 있다. 또한, 게이트웨이 네 트워크 요소/기능부, 이동성 관리 엔티티, 모바일 스위칭 센터, 서버, 데이터베이스 등과 같은 코어 네트워크 요소 또는 네트워크 기능부가 포함될 수 있다. 실제 네트워크 유형에도 의존하는 설명된 요소와 기능부의 일반적인 기능과 상호 연결은 당업자에게 알려져 있 으며 해당 사양에 설명되므로, 이에 대한 상세한 설명은 본 명세서에서 생략된다. 그러나, 통신 종단점, 통신 네트워크 제어 요소, 예컨대, 서버, 게이트웨이, 무선 네트워크 제어기 및 본 명세서에 상세히 후술되는 것 외 에 동일하거나 다른 통신 네트워크의 다른 요소와 같이 요소, 기능 또는 애플리케이션과의 통신을 위해 몇 가지 추가적인 네트워크 요소와 시그널링 링크가 사용될 수 있다는 점에 유의해야 한다. 개시의 예에서 고려되는 통신 네트워크 아키텍처는 공중 전화망이나 인터넷과 같은 다른 네트워크와도 통신할 수 있을 뿐만 아니라, 네트워크의 일부로 간주되지 않는 개별 디바이스나 디바이스 그룹, 예컨대, 카메라, 센서, 센서 어레이 등과 같은 모니터링 디바이스와도 통신할 수 있다. 통신 네트워크는 가상 네트워크 요소 또 는 그 기능에 대한 클라우드 서비스의 사용도 지원할 수 있으며, 원격통신 네트워크의 가상 네트워크 부분은 내 부 네트워크 등과 같은 비클라우드 자원에 의해서도 제공될 수 있다는 점에 유의해야 한다. 액세스 시스템, 코 어 네트워크 등의 네트워크 요소 및/또는 각각의 기능은 그러한 용도에 적합한 임의의 노드, 호스트, 서버, 액 세스 노드 또는 엔티티 등을 사용하여 구현될 수 있다는 점을 알아야 한다. 일반적으로, 네트워크 기능은 전용 하드웨어의 네트워크 요소, 전용 하드웨어에서 실행되는 소프트웨어 인스턴스 또는 적절한 플랫폼, 예컨대, 클 라우드 인프라에서 인스턴스화된 가상화 기능으로서 구현될 수 있다.또한, 본 명세서에 기술된 UE와 같은 네트워크 요소 또는 네트워크 기능부, gNB와 같은 TRP 또는 다른 네트워 크 요소 또는 네트워크 기능부 및 임의의 다른 요소, 기능부 또는 애플리케이션은 컴퓨터용 컴퓨터 프로그램 제 품과 같은 소프트웨어 및/또는 하드웨어에 의해 구현될 수 있다. 각 처리의 실행을 위해, 그에 따라 사용되는 디바이스, 노드, 기능부 또는 네트워크 요소는 여러 가지 수단, 모듈, 유닛, 구성요소 등(표시되지 않음)을 포 함할 수 있으며 이들은 제어, 처리 및/또는 통신/시그널링 기능에 필요하다. 이러한 수단, 모듈, 유닛 및 구성 요소는 예를 들어, 명령어 및/또는 프로그램을 실행하고/하거나 데이터를 처리하기 위한 하나 이상의 처리부를 포함하는 하나 이상의 프로세서 또는 프로세서 유닛, 프로세서 또는 처리부 등의 작업 영역으로서 역할을 하기 위한, 명령어, 프로그램 및/또는 데이터를 저장하기 위한 저장 또는 메모리 유닛 또는 수단(예컨대, ROM, RAM, EEPROM 등), 소프트웨어에 의한 데이터와 명령어 입력을 위한 입력 또는 인터페이스 수단(예컨대, 플로피 디스 크, CD-ROM, EEPROM 등), 사용자에게 모니터와 조작 가능성을 제공하는 사용자 인터페이스(예컨대, 스크린, 키 보드 등), 프로세서 유닛 또는 부분의 제어 하에 링크 및/또는 연결을 수립하기 위한 기타 인터페이스 또는 수 단(예컨대, 유선 및 무선 인터페이스 수단, 예컨대, 안테나 유닛 등을 포함하는 라디오 인터페이스 수단, 라디 오 통신 부분을 형성하는 수단 등) 등을 포함할 수 있으며, 무선 통신 부분과 같은 인터페이스를 형성하는 각각 의 수단은 원격 사이트(예컨대, 무선 헤드 또는 무선 스테이션 등)에 위치할 수도 있다. 현재의 사양에서 처리 부분은 하나 이상의 프로세서의 물리적 부분을 나타내는 것으로 간주될 뿐만 아니라 하나 이상의 프로세서가 수 행하는 참조된 처리 작업의 논리적 구분으로 간주될 수도 있다는 점에 유의해야 한다. 일부 예에 따르면, 네트워크 요소, 네트워크 기능부 또는 네트워크의 다른 엔티티의 운영과 기능부가 노드, 호 스트 또는 서버와 같은 상이한 엔티티나 기능부에서 유연한 방식으로 수행될 수 있는 이른바 \"유동적\" 또는 유 연한 네트워크 개념이 사용될 수 있다는 점을 알아야 한다. 다시 말해, 관련된 네트워크 요소, 기능부 또는 엔 티티 간의 \"분업\"은 사례별로 다를 수 있다. 본 출원에서 사용되는 용어 \"회로부\"는 다음 중 하나 또는 전부를 지칭할 수 있다: (a) 하드웨어 전용 회로 구현(예컨대, 아날로그 및/또는 디지털 회로부에만 구현) 및 (b) 하드웨어 회로와 소프트웨어의 조합(해당되는 경우): (i) 아날로그 및/또는 디지털 하드웨어 회로(들)과 소프트웨어/펌웨어의 조합 및 (ii) 소프트웨어(함께 작동하여 휴대폰이나 서버와 같은 장치가 다양한 기능을 수행하게 하는 디지털 신호 프로 세서(들), 소프트웨어 및 메모리(들) 포함) 및 하드웨어 회로(들) 및/또는 프로세서(들), 예를 들어 마이크로프 로세서(들) 또는 마이크로프로세서(들)의 일부, 작동을 위해 소프트웨어(예컨대, 펌웨어)가 필요하지만, 작동에 필요하지 않은 경우에는 소프트웨어가 없을 수 있다. 이 회로부의 정의는 임의의 청구항을 포함하여 본 출원에 서 이 용어의 모든 용도에 적용된다. 또 다른 예로서, 본 출원에서 사용되는 회로부라는 용어는 하드웨어 회로 또는 프로세서(또는 복수의 프로세서) 또는 하드웨어 회로 또는 프로세서의 일부와 그(또는 그들)에 수반되는 소프트웨어 및/또는 펌웨어의 구현도 포함한다. 회로부라는 용어는 또한, 예를 들어 특정 청구항 요소에 적용되 는 경우, 모바일 디바이스용 베이스밴드 집적 회로 또는 프로세서 집적 회로, 또는 서버, 셀룰러 네트워크 디바 이스, 기타 컴퓨팅 또는 네트워크 디바이스의 유사한 집적 회로도 포함한다. 도 1은 본 개시의 예가 구현 가능한 통신 네트워크 환경의 예를 예시하는 도면을 나타낸다. 구체적으로, 도 1에 서는 통신 요소 또는 통신 기능부의 예로서 UE가 예를 들어, gNB와 같은 통신 네트워크 제어 요소 또는 통 신 네트워크 제어 기능부인 두 개의 TRP, 즉, TRP#1과 TRP#2로 표시된 통신 네트워크에 위치하는 것이 도시된다. UE는 복수의 TRP와 동시 통신을 수행할 수 있다. 예를 들어, UE에는 복수의 안테나 패널(10-1, 10-2 및 10-3)이 장착되어 있다. UE는 다중 TRP 작동을 지원하기 위해 패널(10-1, 10-2 및 10-3)을 사용하며, 복수 의 패널은 빔을 통해 하나 이상의 TRP와 통신하는 데 사용되어 동시 수신이 용이해진다. 도 1에 표시된 TRP, 즉 TRP#1과 TRP#2는 각각 복수의 빔, 즉, TRP#2의 경우 빔(P1 내지 P4), TRP#1의 경우 빔(Q1 내지 Q4)을 제공한다. 도 1에 도시된 구성은 설명을 위한 예시일 뿐이라는 점에 유의해야 한다. 다중 TRP 통신이 UE에 의해 실행되는 환경에서는 더 많은 UE, 더 많은 TRP, 그리고 TRP당 더 많거나 적은 빔이 제공될 수 있다. 또한, UE당 패널의 수도 달라질 수 있다. 모든 빔이 (단일 TRP 전송을 통해) UE에 의해 개별적으로 수신될 수 있더라도, 이들 빔이 UE로 공동 전송하는 데 적합하지 않은 상황이 있다. 예를 들어, 도 1에 도시된 구성에서, UE는 빔 Q1과 P3(또는 P4)가 동일한 패널(10-2)에서 수신되기 때문에 동시에 수신할 수 없다고 가정할 수 있다. 다시 말해, 예컨대, FR2에서 작동하는 UE가 서로 다른 패널을 가지고 있지 않는 한, 두 개의 TRP로부터 동시에 수신하는 것은 어렵다. 따라서, UE가 두 개 (이상)의 빔으로 전송을 스케줄링하는 네트워크의 이점은 UE가 이를 수신할 수 있다는 것을 미리 알 수 있는 경우가 아니라면 의문이다. 이 점을 고려하여, 전술한 바와 같이, 빔이 두 세트로 나뉘고 빔 그룹에 대한 보고가 수행될 수 있는 그룹 기반 빔 보고를 사용할 수 있다. 그러나, 이와 관련하여, 각 TRP에 의해 사용되는 빔은 개별적으로 빔 정제를 따를 수 있으며, 빔 쌍(빔 그룹)은 TRP당 이러한 빔 정제 단계 후에 보고될 수 있다는 점을 고려해야 한다. 일반적으 로, 각 TRP는 SSB 및 CSI-RS와 같은 많은 참조 신호를 전송해야 하는데, 이로 인해 각 빔이 상이한 SSB 또는 CSI-RS 자원에 연관되어 오버헤드 문제가 발생한다. 또한, 그룹 기반 빔 보고를 위한 전체 빔 보고는 TRP와 UE 가 빔 스위핑/정제 및 동시 전송을 지원하는 빔 그룹 선택을 완료하는 데 필요한 시간이 보통 여러 번의 측정을 기반으로 수행되기 때문에 지연이 길 수 있다. 개시의 예에 따르면, UE와 같은 통신 요소 또는 통신 기능부가 통신 네트워크의 복수의 TRP와 통신할 때 통신 네트워크 성능을 향상시킬 수 있도록 개선된 빔 관리를 가능하게 하는 절차가 제공된다. 즉, 개시의 예에 따르 면, 예를 들어 위에서 설명한 BM-Case1(공간 영역 빔 예측)을 고려할 때, 도 1의 UE와 같은, 다중 TRP 작동 (단일 DCI 또는 다중 DCI)을 지원하는 UE는 UE가 동시에 수신할 수 있는 빔 쌍을 보고한다. 개시의 예에서 제안된 방안에 의해, UE는 동시 수신을 위한 빔 쌍을 예측할 수 있다. 따라서, RS 오버헤드 감소와 빔 측정 및 보고의 지연 감소가 달성될 수 있다. 구체적으로, 본 개시의 예에 따르면, 다음의 절차가 제안된다. 본 개시의 예에 기초한 원리는 도 1을 참조하여 본 개시의 예에 따른 방안을 사용하는 예로서 설명된다. UE는 예를 들어, 예측에 기초한 그룹 기반 빔 보고에 사용할 수 있는 통신 네트워크로부터 구성 정보를 획 득한다. 예를 들어, UE가 그러한 예측에 기초한 그룹 기반 빔 보고를 지원할 수 있는 능력을 통신 네트워크 에 보고할 때, 해당 구성 정보가 획득된다. 예측에 기초한 그룹 기반 빔 보고는 동시 통신(즉, UE 측에서의 수 신)을 지원하는 하나 이상의 빔 쌍(들)(또는 하나 이상의 빔 그룹(들))이 예컨대 UE 측에서 사용되는 알고리즘, 지정된 방법 또는 구현에 기반한 빔 예측을 기반으로 보고될 수 있다는 것을 네트워크에 알리는 것과 관련이 있 다. 이와 달리, UE가 구성 정보를 얻게 하는 다른 예도 있으며, 예를 들어, 네트워크로부터의 해당 문의에 응답할 때, 또는 예컨대, 네트워크에 연결된 UE가 예측에 기초한 그룹 기반 빔 보고를 지원할 수 있다고 가정하 는 사전 설정 구성을 기반으로 할 때이다. 예를 들어, UE는 해당 보고에 대한 응답으로 예측에 기초한 그룹 기반 빔 보고를 가능하게 하는 CSI 보고 구성을 수신한다. 또한, UE는 복수의 빔 세트, 예를 들어, 측정을 위한 적어도 2개의 빔 세트(세트 B1 및 세트 B2라고 함)와 예측을 위한 적어도 2개의 빔 세트(세트 A1 및 세트 A2라고 함)를 수신한다. 세트 A1과 B1은 하나의 TRP(예컨대, TRP#1)로부터 수신되는 반면, 세트 A2와 B2는 다른 TRP(예컨대, TRP#2)로부터 수 신된다. 예를 들어, 개시의 일부 예에 따르면, 빔의 전체 측정 세트(세트 B)는 세트 B1과 세트 B2의 빔의 조합을 포함하 는 상위 세트일 수 있다. 또한, 빔의 전체 예측 세트(세트 A)는 세트 A1과 세트 A2의 빔의 조합을 포함하는 상 위 세트일 수 있다. 본 발명의 일부 추가적인 예에 따르면, 세트 B1은 세트 A1의 서브세트일 수 있고, 세트 B2 는 세트 A2의 서브세트일 수 있다. 또 다른 변형에서, 세트 B1과 세트 A1은 서로 다를 수 있고, 세트 B2와 세트 A2는 서로 다를 수 있다. 개시의 일부 예에 따르면, UE는 측정/예측 빔 세트(세트 A1/A2와 세트 B1/B2)와 TRP, 예컨대, TRP ID, 물 리적 셀 ID 또는 CORESETPoolIndex 간의 연관을 나타내는 사전 정의되거나 수신된 구성을 사용하도록 구성된다 (CORESET는 물리적 자원 세트(예컨대, NR 다운링크 자원 그리드의 특정 영역) 및 PDCCH/DCI를 전달하는 데 사용 되는 파라미터 세트를 나타냄). 이와 달리, PDCCH/PDSCH 수신을 위해 적용된 참조 인덱스도 사용할 수 있다. 개시의 일부 예에 따르면, 빔 세트가 서로 연관될 수 있다는 점에 유의해야 한다. 예를 들어, 빔 세트와 TRP/PCI/CORESETPoolindex(또는 PDCCH/PDSCH 수신을 위해 적용된 참조 인덱스) 사이에 정의된 연관에 기초하여 세트 A1과 세트 B1(또는 세트 A2와 세트 B2)이 서로 연관될 수도 있다. 또한, 개시의 일부 예에 따르면, UE는 측정 세트, 즉 세트 B1과 세트 B2로부터 자원을 측정하고, 빔 측정치 (예컨대, L1-RSRP 및 빔 인덱스)를 사용하여 세트 B1과 세트 B2로부터 동시 수신에 적합한 빔 쌍을 식별한다. 그런 다음, UE는 동시 수신에 적합하거나 사용 가능한 추가 빔 그룹 또는 빔 쌍을 결정한다. 이 결정은 예 측 모델을 사용하여 수행된다. 예측 모델은 적어도 빔 측정치(L1-RSRP 및 빔 인덱스)와 세트 B1 및 세트 B2에서 식별된 빔 그룹/쌍을 예측 모델의 입력으로서 사용한다. 추가 빔 그룹/쌍은 예컨대 다음을 포함할 수 있다: - 하나의 TRP/PCI/CORESETPoolindex에 해당하는 예측 세트(예: A1 세트)의 빔과 다른 TRP/PCI/CORESETPoolindex에 해당하는 다른 예측 세트(예: A2 세트)의 빔을 포함하는 빔 쌍, - 하나의 TRP/PCI/CORESETPoolindex에 해당하는 측정 세트(세트 B1 또는 세트 B2)의 빔과 다른 TRP/PCI/CORESETPoolindex에 해당하는 예측 세트(세트 A2 또는 세트 A1)의 빔을 포함하는 빔 쌍, 및 - 하나의 TRP/PCI/CORESETPoolindex에 해당하는 측정 세트(예: 세트 B1)의 빔과 다른 TRP/PCI/CORESETPoolindex에 해당하는 다른 측정 세트(예: 세트 B2)의 빔을 포함하는 빔 쌍. 결정 후, UE는 결정된 빔 쌍의 사전 정의된 부분을 네트워크, 예컨대, TRP#1에 보고한다. 사전 정의된 부분은 사전설정된 순서로, 예컨대, 최고에서 최저로 또는 최저에서 최고로 결정된 빔 쌍 중 가장 좋은 빔 쌍 또는 가장 적합한 빔 쌍을 포함한다. 또한, 네트워크로 전송된 정보는 추가적인 파라미터와 같은 다른 정보도 포함할 수 있다. 이러한 파라미터는 예를 들어, 다음 중 하나 이상을 포함한다: 해당 L1-RSRP/L1-SINR 값, 예측 과 연관된 신뢰도 메트릭, 기능 값 세트 표시. 해당 파라미터는 생략될 수도 있다는 점에 유의해야 한다. 개시의 추가 예에 따르면, UE는 (세트 B1과 B2로부터) 식별된 빔 그룹/쌍 및 (세트 A1/B1과 A2/B2로부터) 결정된 빔 그룹/쌍에 해당하는 빔 쌍/그룹도 보고할 수 있다. 또한, 개시의 추가 예에 따르면, UE는 제한된 수의 빔 그룹/쌍을 보고하도록 구성되어 있으며, 각 그룹/쌍 은 적어도 두 개의 빔을 가질 수 있다. 결정된 빔 쌍/그룹에 대한 보고가 완료되면, UE는 보고된 빔 그룹/쌍을 수신하기 위해 다른 공간 필터를 적 용할 수 있다. 또한, 개시의 예에 따르면, 보고된 빔 그룹/쌍에 기초하여, UE는 동시에 복수의 TRP로부터 동시 데이터 전송을 수신하도록 스케줄링될 수 있으며, 해당 보고된 빔 쌍이 데이터를 수신하는 것으로 가정된 다. 도 2는 개시의 예에 따른 빔 보고 절차의 예를 예시하는 시그널링 도면을 도시한다. 구체적으로, 도 2는 위에서 설명한 절차를 구현하는 한 가지 가능한 방법을 제공한다. 도 2에 표시된 예에서, 주기적인 CSI-RS 전송 및 CSI 보고 구성이 비주기적인 CSI 트리거링과 연관되어 있다고 가정한다. 이를 통해 측정과 예측을 고려하여 동적인 방식으로 빔 예측 보고를 할 수 있다. 도 2에 표시된 것처럼, UE(예컨대, 도 1의 UE)와 2개의 TRP(예컨대, 도 1의 TRP#1과 TRP#2) 사이 의 시그널링이 도시된다. UE 측에서는 시그널링 인스턴스로서 UL 및 DL 통신 요소, 빔을 통해 수신된 신호를 측 정하기 위한 측정 모듈, 및 예측 모델 엔티티가 제공된다. S200에서, UE는 예측에 기초한 그룹 기반 빔 보고를 지원한다는 것을 나타내는 기능 표시를 네트워크(예컨 대, TRP#1)로 보낸다. S210에서, UE는 예를 들어, RRC를 통해 예컨대, 그룹 기반 빔 보고를 가능하게 하는 CSI-ReportConfig 형식의 구성 정보를 수신한다. 이와 관련하여, UE가 측정용 빔 세트와 예측용 빔 세트, 예를 들어, 최대 4개의 RS (참조 신호) 세트를 추가로 정의할 수 있도록 하는 정보가 제공되며, CSI-ReportConfig는 RS 세트를 CMR1 내지 CMR4(즉, 위에서 설명한 대로 세트 A1/A2/B1/B2)로서 나타낼 수 있다. S230에서, UE는 수신된 CSI-reportConfig 정보를 바탕으로, 예측 모델이 그룹 기반 빔 보고뿐만 아니라 측 정 및 예측을 위한 관련 RS 세트에도 적용될 수 있다고 결정한다. S235에서, UE는 추가로 RS 세트가 적어도 두 개의 TRP(예컨대, mDCI 시나리오의 경우 두 개의 CORESETPoolIndex)와 연관되어 있다고 결정한다. 이 연관 결정은 예를 들어, 사전 정의된 구성이나 통신 네트워 크로부터 수신된 구성을 통해 실행될 수 있다. 예를 들어, S235에서, 세트 A1/B1은 CORESETPoolIndex 0(TRP#1)과 관련이 있고, 세트 A2/B2는 CORESETPoolIndex 1(TRP#2)과 관련이 있다고 결정된다. S240에서, 네트워크(즉, TRP#1)가 CSI-ReportConfig에 해당하는 DCI에서의 비주기적 CSI 보고를 트리거하 는 것을 통해 예측에 기초한 그룹 기반 빔 보고를 트리거한다. 또한, S250 및 S255에서, TRP#1과 TRP#2가 해당 RS 세트를 전송한다. RS는 예컨대, 주기적, 반지속적 또는 비주기적 방식으로 전송될 수 있다. 예를 들어, UE는 TRP#1로부터 세트 B1 및 TRP#2로부터 세트 B2와 연관된 CSI-RS(또는 SSB) 전송을 수신 한다. S260에서, UE의 측정 모듈은 예를 들어, 수신된 CSI-RS(또는 SSB)를 기반으로 L1-RSRP 또는 기타 적합한 CSI 양을 측정한다. UE는 동시 수신(즉, 다중 TRP 수신)을 위한 빔 쌍(또는 빔 그룹)을 더 결정한다. S270에서, 빔 측정치(예컨대, 측정된 L1-RSRP와 같은 추가 파라미터와 함께 빔 인덱스) 및 식별된 빔 쌍이 예측 모델을 위한 입력으로서 사용된다. S280에서, UE는 S230에서 결정된 예측 모델(예컨대, AI/ML 모델)을 사용하여 그룹 기반 빔 예측을 실행한다. 예측 모델을 위한 입력으로서, 세트 B1과 세트 B2에 해당하는 S260의 빔 측정을 기반으로 제공된 데 이터가 사용된다. 예측의 결과로서, 예를 들어, 세트 A1/B1과 세트 A2/B2를 고려한 동시 수신에 대한 최상의 빔 쌍(그룹)이 결정된다. 이러한 AI/ML 예측 모델의 예는 예컨대, 도 4와 관련하여 아래에 설명된다. S290에서, 결정된 최상의 빔 쌍과 해당 L1-RSRP를 포함한 예측 모델의 출력이, 예를 들어, 사전 설정된 순서대 로 제공된다. 출력은 S295에서 UE에 의해 통신 네트워크(예컨대, TRP#1)에 CSI 양을 보고하는 데 사용되는 CSI-ReportConfig에 구성된 보고량에 따라 보고 CSI 피드백(UL 제어 정보로서)을 구성하는 데 사용된다. 도 3은 개시의 예에 따른 빔 측정 절차에 관한 추가적인 세부 사항을 도시한다. 구체적으로, 도 3은 각 TRP로부 터 제한된 수의 빔 측정을 통해 다중 TRP 작동이 지원되는 절차를 도시한다. 도 3에서, TRP#1과 TRP#2의 빔이 도시되며, 빔 세트 A1은 TRP#1으로부터의 6개의 빔(CRI_x1, RSRP_x1 내지 CRI_x6, RSRP_x6로 표시됨)을 포함하고 빔 세트 A2는 TRP#2로부터의 6개의 빔(CRI_y1, RSRP_y1 내지 CRI_y6, RSRP_y6로 표시됨)을 포함한다. 도 3의 예에서, 세트 B1과 세트 B2는 각각 세트 A1과 세 트 A2의 서브세트라고 가정한다. RSRP가 없는 빔 측정은 세트 B1(예컨대, CRI_x4, CRI_x3) 및 세트 B2(예컨대, CRI_y3, CRI_y5)가 각각 TRP#1 및 TRP#2에 대응하는 것을 의미한다. 괄호 안에 표시된 숫자는 측정된 각 빔마다 가정된 L1-RSRP 의 상대 강도를 나타낸다(즉, 에서 까지이며, 은 RSRP가 없는 경우를 나타내고, 은 RSRP가 높은 경 우를 나타냄). 도 3에 도시된 것처럼, UE는 빔 측정(예컨대, CRI_x5, CRI_y4, 및 CRI_x6, CRI_y1)을 기반으로 두 개의 빔 쌍을 식별한다. 이 빔 쌍은 식별된 빔 쌍을 나타낸다. 도 3의 참조 부호 30은 예측 모델을 나타낸다. 예측 모델의 입력은 빔 측정치(즉, 식별된 빔 쌍, 빔 인덱스 및 L1-RSRP 값)에 의해 제공된다. 입력에 기초하여, 예측 모델은 세트 A1과 A2에 대해 더 많은 빔 쌍과 해당 L1-RSRP를 예측하며, 이는 예측에 기초하여 동시 수신에 사용할 수 있는 결정된 빔 쌍(즉, 예를 들어, 식별된 빔 쌍 CRI_x5, CRI_y4 및 CRI_x6 외에, 빔 쌍 CRI_x1, CRI_y3 및 CRI_x4, CRI_y1도)으로 표시된다. 다음으로, 도 4는, 개시의 예와 관련하여 사용할 수 있는 예측 모델의 예로서, 개시의 예에 따른 공간 빔 예측 을 위한 NN 설계의 도면을 도시한다. 도 4는 사용할 수 있는 예측 모델의 한 가지 예만을 도시한다는 점에 유의 해야 한다. 일반적으로, 사용 가능한 예측 모델은 예를 들어, 구현 결정에 기초하여 UE에 의해 선택될 수 있으 며, UE에 의해 머신 러닝(ML) 또는 비머신 러닝(non-ML) 기반 모델과 같은 예측 모델에 대해 상이한 접근 방식 이 사용될 수 있고, 예측의 정확도가 다양하게 설정될 수 있다. 도 4에 표시된 바와 같이, 예측 모델에 대한 입력으로서, 세트 B1의 빔 측정치와 세트 B2의 빔 측정치 가 사용된다. 또한, (세트 B1과 세트 B2로부터의) 빔 측정치에 대해 식별된 빔 쌍이 사용된다. 예측 모델은 복수의 NN 블록(도 4의 NN 블록 1 내지 NN 블록 L)으로 구성된다. NN 블록 1은 xi(i=1,…, N) 및 yi(i=1,…, N) CSI-RS 자원 및 식별된 최상의 빔 쌍(xi, yj)(i, j는 (i=1,…, N) 내에서 선택됨)에 대한 각 빔 세트(세트 B1과 세트 B2)에 대한 CRI 및 RSRP 측정을 고려하여, 빔 측정치를 입력으로 사용한다. 그러면, 각 내 부 NN 블록(2,...,L-1)에는 nh 뉴런(즉, 뉴런의 수)이 있고, 마지막으로 NN 블록 L에는 CRI 쌍(즉, 세트 A1 및 세트 A2 자원, 즉 xi, yj(i,j = 1,…, N) 쌍에 해당하는 자원/빔 쌍)에 해당하는 M개의 출력 뉴런이 있다. 도 4에 도시된 바와 같이, 각 NN 블록은 완전 연결 층(FNN), 활성화 함수 층 및 배치 정규화 층을 포함할 수 있 다는 점에 유의해야 한다. 이 경우, 정보는 입력 블록에서 출력 블록으로만 순방향으로 이동한다.번째 NN 블록에서, 출력 벡터 은 비선형 활성화 함수 σ로 계산되며, 로 표현될 수 있고, 은 이전 NN 블록에서의 출력이고, 는 번째 NN 블록의 가중치이며, 는 번째 NN 블록의 바이어스 이다. 가중치 와 바이어스 는 번째 NN 블록의 훈련 가능한 파라미터 을 형성한다. 마지막 출력 은 ML 모델의 마지막 NN 블록의 출력에 해당하며, =1, …, 에 대해 비선형 함수 ,…, 를 사용하여 상이한 NN 블록의 ML 모델 입력 및 훈련 가능한 파라미터의 조합으로서 표현될 수 있다: . 네트워크의 출력 은 그 다음에 SoftMax 함수, 즉, 로 전달되어, ML 모델의 출력 세트에 대한 확률 분포 을 구한다. 따라서, 이들 확률을 예를 들어, 내림차순으로 순위화하고 다음과 같이 최상의 K 개의 빔 쌍을 선택하는 것을 고려한다:"}
{"patent_id": "10-2025-7006666", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 세트 은 최상의 K개의 CRI/빔 쌍을 포함한다. 개시의 예에 따르면, ML 모델(도 4에 예시되는 예)은 확률적 기울기 하강(SGD) 알고리즘으로 훈련될 수 있는데, 이는 ML 모델 가중치 에 대한 기울기 방향으로 손실 함수의 최소값을 계산한다. 입력 데이터 및 해당 라벨 에 의해 형성된 훈련 세트에서 개의 데이터 샘플이 주어진다. SGD는 먼 저 기울기 추정"}
{"patent_id": "10-2025-7006666", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "을 계산한 다음, 가중치 (여기서 는 학습률)를 업데이트한다. SGD는 정지 기준이 충족될 때까지 이 두 단계를 반복한다. 도 5는 개시의 일부 예에 따라 UE와 같은 통신 요소 또는 통신 기능부에서 수행되는 처리의 흐름도를 도시하며, 통신 요소 또는 통신 기능부는 다중 TRP 작동을 수행할 수 있다. 즉, 도 5는 도 1 내지 도 4와 관련하여 설명된 바와 같이 UE와 같은 통신 요소 또는 통신 기능부에 의해 수행되는 처리와 관련된 흐름도를 도시한다. 개시 의 일부 예에 따르면, UE는 통신 네트워크의 복수의 TRP로부터 빔을 동시에 수신하기 위한 복수의 수신 패널을 가지고 있다. S510에서, UE는 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 CSI 보고 구성 정보를 획득한다. 개시 의 일부 예에 따르면, CSI 보고 구성 정보를 획득하기 위해, UE는 예측에 기초한 그룹 기반 빔 보고를 지원하는 기능을 통신 네트워크의 TRP에 미리 보고하며, 기능 보고에 대한 응답으로 CSI 보고 구성 정보기 수신된다. S520에서, UE는 측정을 위한 적어도 하나의 빔 세트(위에서 세트 B라고 지칭함)와 적어도 하나의 예측 빔 세트 (위에서 세트 A라고 지칭함)를 포함하는 복수의 빔을 수신한다. S530에서, UE는 통신 네트워크의 각 TRP에 대한 수신된 복수의 빔의 연관을 결정한다. 개시의 일부 예에 따르면, 통신 네트워크의 각 TRP에 대한 수신된 복수의 빔의 연관을 결정하기 위해, UE는 수 신된 참조 신호와 통신 네트워크의 적어도 두 개의 송신 지점과의 연관을 나타내는 사전 정의되거나 수신된 구 성을 사용한다. S540에서, UE는 동시 수신을 위한 빔 그룹을 식별하기 위한 측정을 위해 적어도 하나의 빔 세트로부터 자원을 측정한다. 개시의 일부 예에 따르면, 빔은 CSI RS 및 SSB 자원 중 적어도 하나를 포함하는 DL 참조 신호 자원에 의해 표현 되며, DL 신호 자원은 각각의 TRP(예컨대, 전술한 바와 같이 TRP#1 또는 TRP#2)에 해당하는 그룹으로 그룹화된다. 또한, 개시의 일부 예에 따르면, 측정을 위한 적어도 하나의 빔 세트는 해당 TRP에 의해 전송된 다운링크 참조 신호를 포함하고, 예측을 위한 적어도 하나의 빔 세트는 해당 TRP에 의해 전송되지 않은 다운링크 참조 신호를포함한다. 개시의 일부 예에 따르면, 식별된 빔 그룹 또는 추가 빔 그룹을 형성하는 빔 그룹은 2개의 TRP 또는 공간 필터 에 해당하는 빔을 포함하며, 적어도 하나의 빔은 하나의 TRP 또는 공간 필터에 해당하고 다른 빔은 다른 TRP 또 는 공간 필터에 해당한다. 이와 달리, 식별된 빔 그룹 또는 추가 빔 그룹을 형성하는 빔 그룹은 각각 하나의 TRP 또는 공간 필터에만 해당하는 빔을 포함하며, 각 빔 그룹의 빔의 하나의 서브세트는 측정을 위한 빔 세트로 부터 결정되고, 빔 그룹의 빔의 다른 서브세트는 예측을 위한 빔 세트로부터 결정된다. 개시의 일부 예에 따르면, 동시 수신을 위한 빔 그룹을 식별하는 측정을 위한 적어도 하나의 빔 세트로부터의 자원으로서, 통신 네트워크로부터의 신호 전송(예컨대, 각 TRP로부터의 RS 전송)을 기초로 하여 RSRP 또는 CSI 양 중 적어도 하나가 측정된다. S550에서, UE는 예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정한다. 추가 빔 그룹은 측정을 위한 적어도 하나의 빔 세트와 예측을 위한 적어도 하나의 빔 세트를 포함한다. 개시의 일부 예에 따르면, 예측 모델에 기반한 예측이 적어도 하나의 추가 빔 그룹의 출력을 초래하는 경우, UE 는 통신 네트워크의 TRP에 결과적인 추가 빔 그룹의 적어도 일부를 사전 정의된 순서대로 보고한다. 사전 정의 된 순서는 (예컨대, 적합성의 오름차순 또는 내림차순으로) 보고된 추가 빔 그룹의 동시 수신 적합성 레벨을 반 영한다. 개시의 일부 예에 따르면, 결과적인 추가 빔 그룹의 적어도 일부를 보고할 때, UE는 적어도 하나의 추가 빔 그 룹의 빔의 통신 속성을 나타내는 추가 파라미터를 포함할 수 있다. 통신 속성은 예를 들어, RSRP 표시, SINR, 사용된 예측 모델과 연관된 신뢰성 메트릭 및 기능 값 세트의 표시 중 적어도 하나를 포함한다. 개시의 일부 예에 따르면, 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 데 사용되는 예측 모델은 완전 연결 신경망 블록, 활성화 함수 계층 및 배치 정규화 계층을 포함하는 복수의 NN 블록을 갖는 신경망 구성을 사 용하는 머신 러닝 예측 모델이다. 이와 달리, 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 데 사용되 는 예측 모델은 비머신 러닝 예측 모델이다. 개시의 일부 예에 따르면, UE는 예측 모델의 입력 데이터로서 동시 수신을 위한 빔 측정치와 식별된 빔 그룹을 사용한다. 또한, 개시의 일부 예에 따르면, UE는 획득된 채널 상태 정보 보고 구성 정보에 의해 제공되는 정보를 기반으로 적용될 예측 모델을 결정하도록 구성된다. 예를 들어, 네트워크로부터 RS의 시그널링 속성을 기반으로 사용될 예측 모델이 결정된다. 또한, 개시의 일부 예에 따르면, UE는 동시 수신에 사용할 수 있는 결정된 추가 빔 그룹의 적어도 일부를 통신 네트워크에 업링크 제어 정보로서 보고한다. 개시의 일부 예에 따르면, UE는 동시 수신에 사용할 수 있는 것으로 식별되거나 결정된 빔을 수신하도록 조정된 공간 필터를 적용한다. 도 6은 본 개시의 일부 예에 따른 TRP(예컨대, TRP#1)로서 사용되는 gNB와 같은 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에서 수행되는 처리의 흐름도를 도시한다. 즉, 도 6은 도 1 내지 도 4와 관련하 여 또한 설명된 바와 같이 TRP#1과 같은 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에 의해 수행되는 처리와 관련된 흐름도를 도시한다. S610에서, TRP는 UE로부터의 예측에 기초한 그룹 기반 빔 보고를 지원하는 통신 요소 또는 통신 기능부의 기능 에 대한 표시를 수신한다. S620에서, TRP는 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 CSI 보고 구성 정보를 UE에 전송한다. 또한, 개시의 일부 예에 따르면, TRP는 CSI 보고 구성 정보에 해당하는 비주기적 CSI 보고를 UE에 트리거함으로 써 예측에 기초한 그룹 기반 빔 보고를 트리거하도록 구성된다. 도 7은 도 1 내지 도 4와 관련하여 설명된 바와 같이, 개시의 일부 예에 따라 처리를 수행하는 UE과 같은 통신 요소 또는 통신 기능부의 도면을 도시한다. UE와 같은 네트워크 요소 또는 기능부는 본 명세서에서 아래에 설명된 것 외에 추가적인 요소 또는 기능부를 포함할 수 있다. 또한, 네트워크 요소 또는 기능부에 대한 언급이 있더라도, 그 요소 또는 기능부는 네트워크 요소의 일부이거나 네트워크 요소에 별개의 요소로 부착될수도 있는 칩셋, 칩, 모듈, 애플리케이션 등과 같이 유사한 작업을 갖는 다른 디바이스 또는 기능부일 수도 있 다. 각 블록과 이의 임의의 조합은 하드웨어, 소프트웨어, 펌웨어, 하나 이상의 프로세서 및/또는 회로부와 같 은 다양한 수단 또는 이들의 조합으로 구현될 수 있음을 이해해야 한다. 도 7에 도시된 UE는 제어 절차와 관련된 프로그램 등에 의해 주어진 명령어를 실행하는 데 적합한 처리 회 로부, 처리 기능부, 제어 유닛 또는 프로세서, 예컨대, CPU 등을 포함할 수 있다. 프로세서는 아래에 설명된 바와 같이 특정 처리에 전용인 하나 이상의 처리 부분 또는 기능부를 포함할 수 있거나, 또는 처리가 단 일 프로세서 또는 처리 기능부에서 실행될 수 있다. 이러한 특정 처리를 실행하기 위한 부분은 또한 별개의 요 소로서 제공되거나 예컨대 CPU와 같은 하나의 물리적 프로세서 또는 하나 이상의 물리적 또는 가상 엔티티와 같 은 하나 이상의 추가 프로세서, 처리 기능부 또는 처리 부분 내에서 제공될 수 있다. 참조 부호 102는 프로세서 또는 처리 기능부에 연결된 입력/출력(I/O) 유닛 또는 기능부(인터페이스)를 나타낸다. I/O 유닛은 TRP(20 및 25)와 같은 통신 네트워크와 통신하는 데 사용될 수 있다. I/O 유닛은 여러 엔티티를 향한 통신 장비를 포함하는 조합된 유닛일 수도 있거나, 상이한 엔티티에 대해 복수의 상이한 인터페이스를 갖는 분산 구 조를 포함할 수도 있다. 참조 부호 104는 예를 들어, 프로세서 또는 처리 기능부에 의해 실행될 데이터와 프로그램을 저장하고/하거나 프로세서 또는 처리 기능부의 작업 저장소로 사용될 수 있는 메모리를 나타낸 다. 메모리는 동일하거나 다른 유형의 메모리의 하나 이상의 메모리 부분을 사용하여 구현될 수 있다는 점 에 유의해야 한다. 프로세서 또는 처리 기능부는 위에서 설명한 제어 절차와 관련된 처리를 실행하도록 구성된다. 특히, 프로 세서 또는 처리 회로부 또는 기능부는 다음의 하위 부분 중 하나 이상을 포함한다. 하위 부분은 CSI 보고 구성을 얻기 위한 부분으로서 사용할 수 있는 처리 부분이다. 부분은 도 5의 S510에 따라 처리를 수 행하도록 구성될 수 있다. 또한, 프로세서 또는 처리 회로부 또는 기능부는 빔을 수신하는 부분으로서 사 용될 수 있는 하위 부분을 포함할 수 있다. 부분은 도 5의 S520에 따라 처리를 수행하도록 구성될 수 있다. 또한, 프로세서 또는 처리 회로부 또는 기능부는 연관성을 결정하는 부분으로서 사용될 수 있는 하위 부분을 포함할 수 있다. 부분은 도 5의 S530에 따라 처리를 수행하도록 구성될 수 있다. 또한, 프로세서 또는 처리 회로부 또는 기능부는 측정을 위한 부분으로서 사용될 수 있는 하위 부분(101 4)을 포함할 수 있다. 부분은 도 5의 S540에 따라 처리를 수행하도록 구성될 수 있다. 또한, 프로세서 또 는 처리 회로부 또는 기능부는 빔 그룹을 결정하는 부분으로 사용될 수 있는 하위 부분을 포함할 수 있다. 부분은 도 5의 S550에 따라 처리를 수행하도록 구성될 수 있다. 도 8은 도 1 내지 4와 관련하여 설명된 바와 같이, 본 개시의 일부 예에 따라 통신 제어를 수행하는 TRP(예컨대, TRP#1)인 gNB와 같은 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부의 도면을 도시 한다. TRP와 같은 네트워크 요소 또는 기능부는 본 명세서에서 아래에 설명된 것 외에 추가적인 요소 또는 기능부를 포함할 수 있다는 점에 유의해야 한다. 또한, 네트워크 요소 또는 기능부에 대한 언급이 있더라도, 그 요소 또는 기능부는 네트워크 요소의 일부이거나 네트워크 요소에 별개의 요소로서 부착될 수도 있는 칩셋, 칩, 모듈, 애플리케이션 등과 같이 유사한 작업을 갖는 다른 디바이스 또는 기능부일 수도 있다. 각 블록과 이의 임 의의 조합은 하드웨어, 소프트웨어, 펌웨어, 하나 이상의 프로세서 및/또는 회로부와 같은 다양한 수단 또는 그 조합으로 구현될 수 있음을 이해해야 한다. 도 8에 도시된 TRP는 제어 절차와 관련된 프로그램 등에 의해 주어진 명령어를 실행하는 데 적합한 처리 회 로부, 처리 기능부, 제어 유닛 또는 프로세서, 예컨대, CPU 등을 포함할 수 있다. 프로세서는 아래에 설명된 바와 같이 특정 처리에 전용인 하나 이상의 처리 부분 또는 기능부를 포함할 수 있거나, 또는 처리가 단 일 프로세서 또는 처리 기능부에서 실행될 수 있다. 이러한 특정 처리를 실행하기 위한 부분은 또한 별개의 요 소로서 제공되거나 예컨대 CPU와 같은 하나의 물리적 프로세서 또는 하나 이상의 물리적 또는 가상 엔티티와 같 은 하나 이상의 추가 프로세서, 처리 기능부 또는 처리 부분 내에서 제공될 수 있다. 참조 부호 202와 203은 프 로세서 또는 처리 기능부에 연결된 입력/출력(I/O) 유닛 또는 기능부(인터페이스)를 나타낸다. I/O 유닛 은 도 1에 도시된 것처럼 UE와 같은 통신 요소 또는 통신 기능부와 통신하는 데 사용될 수 있다. I/O 유닛 은 다른 네트워크 기능부와 통신하는 데 사용될 수 있다. I/O 유닛(202 및 203)은 여러 엔티티를 향한 통 신 장비를 포함하는 조합된 유닛일 수도 있거나, 상이한 엔티티에 대해 복수의 상이한 인터페이스를 갖는 분산 구조를 포함할 수도 있다. 참조 부호 204는 예를 들어, 프로세서 또는 처리 기능부에 의해 실행될 데이터 와 프로그램을 저장하고/하거나 프로세서 또는 처리 기능부의 작업 저장소로 사용될 수 있는 메모리를 나 타낸다. 메모리는 동일하거나 다른 유형의 메모리의 하나 이상의 메모리 부분을 사용하여 구현될 수 있다 는 점에 유의해야 한다.프로세서 또는 처리 기능부는 위에서 설명한 제어 절차와 관련된 처리를 실행하도록 구성된다. 특히, 프로 세서 또는 처리 회로부 또는 기능부는 다음의 하위 부분 중 하나 이상을 포함한다. 하위 부분은 기 능 표시를 수신하는 부분으로서 사용할 수 있는 처리 부분이다. 부분은 도 6의 S610에 따라 처리를 수행 하도록 구성될 수 있다. 또한, 프로세서 또는 처리 회로부 또는 기능부는 CSI 보고 구성을 전송하기 위한 부분으로서 사용될 수 있는 하위 부분을 포함할 수 있다. 부분은 도 6의 S620에 따라 처리를 수행 하도록 구성될 수 있다. 본 개시의 실시예의 예는 여러 상이한 네트워크 구성에 적용될 수 있다는 점에 유의해야 한다. 다시 말해, 앞에 서 논의된 예에 대한 기초로서 사용된, 전술한 도면에 도시된 예는 단지 예시적이며, 본 개시를 어떤 식으로든 제한하지 않는다. 즉, 해당 운영 환경에서 이용 가능한 기존의 추가 기능과 제안된 새로운 기능은 정의된 원칙 에 기초한 본 개시의 실시예의 예와 관련하여 사용될 수 있다. 또한, 앞의 실시예의 예서 주로 UE가 제안된 제어 절차가 적용되는 통신 요소 또는 통신 기능부로서 설명되지만, 실시예의 예는 해당 처리가 적용되는 다른 통신 요소 또는 통신 기능부와도 관련될 수 있다. 실시예의 추가 예에 따르면, 예를 들어, 다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기 능부에 의해 사용되는 장치가 제공되며, 장치는 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채널 상태 정보 보고 구성 정보를 획득하도록 구성된 수단과, 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적 어도 하나의 빔 세트를 포함하는 복수의 빔을 수신하도록 구성된 수단과, 통신 네트워크의 각각의 TRP에 대한 수신된 복수의 빔의 연관을 결정하도록 구성된 수단과, 동시 수신을 위한 빔 그룹을 식별하기 위해 측정을 위한 적어도 하나의 빔 세트로부터 자원을 측정하도록 구성된 수단과, 예측 모델을 사용하여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하도록 구성된 수단을 포함하되, 추가 빔 그룹은 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트의 빔을 포함한다. 또한, 실시예의 일부 다른 예에 따르면, 앞에서 정의된 장치는 전술한 방법, 예를 들어, 도 5와 관련하여 설명 된 것에 따른 방법에서 정의된 처리 중 적어도 하나를 수행하기 위한 수단을 더 포함할 수 있다. 실시예의 추가 예에 따르면, 예를 들어, 통신 요소 또는 통신 기능부와 통신하기 위한 송수신 지점(TRP)으로서 작동하는 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에 의해 사용되는 장치가 제공되며, 장치는 예측에 기초한 그룹 기반 빔 보고를 지원하기 위한 통신 요소 또는 통신 기능부의 기능의 표시를 수신하도록 구 성된 수단과, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 채널 상태 정보 보고 구성 정보를 통신 요소 또는 통신 기능부에 송신하도록 구성된 수단을 포함한다. 또한, 실시예의 일부 다른 예에 따르면, 앞에서 정의된 장치는 전술한 방법, 예를 들어, 도 5와 관련하여 설명 된 것에 따른 방법에서 정의된 처리 중 적어도 하나를 수행하기 위한 수단을 더 포함할 수 있다. 실시예의 추가 예에 따르면, 예를 들어, 프로그램 명령어를 포함하는 비일시적 컴퓨터 판독가능 매체가 제공되 며, 명령어는 장치로 하여금, 다중 송수신 지점(TRP) 동작을 수행할 수 있는 통신 요소 또는 통신 기능부에서 사용될 때, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위해 채널 상태 정보 보고 구성 정보를 획득하는 것과, 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트를 포함하는 복수의 빔을 수신 하는 것과, 통신 네트워크의 각각의 TRP에 대한 수신된 복수의 빔의 연관을 결정하는 것과, 동시 수신을 위한 빔 그룹을 식별하기 위해 측정을 위한 적어도 하나의 빔 세트로부터 자원을 측정하는 것과, 예측 모델을 사용하 여 동시 수신에 사용할 수 있는 추가 빔 그룹을 결정하는 것을 포함하는 처리를 수행하게 하되, 추가 빔 그룹은 측정을 위한 적어도 하나의 빔 세트 및 예측을 위한 적어도 하나의 빔 세트의 빔을 포함한다. 실시예의 추가 예에 따르면, 예를 들어, 프로그램 명령어를 포함하는 비일시적 컴퓨터 판독가능 매체가 제공되 며, 명령어는 장치로 하여금, 통신 요소 또는 통신 기능부와 통신하기 위한 송수신 지점(TRP)으로서 작동하는 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에 사용될 때, 예측에 기초한 그룹 기반 빔 보고를 지 원하기 위한 통신 요소 또는 통신 기능부의 기능의 표시를 수신하는 것과, 예측에 기초한 그룹 기반 빔 보고를 가능하게 하기 위한 채널 상태 정보 보고 구성 정보를 통신 요소 또는 통신 기능부에 송신하는 것을 포함하는 처리를 수행하게 한다. 위에서 설명한 구성에 의해, 빔 측정 및 보고 시 RS 오버헤드와 지연을 줄일 수 있다. 다음을 알아야 한다: - 통신 네트워크의 엔티티와 트래픽을 주고받는 액세스 기술은 WLAN(Wireless Local Access Network), WiMAX(Worldwide Interoperability for Microwave Access), LTE, LTE-A, 5G, 블루투스, 적외선 등과 같은 임의 의 적합한 현재 또는 미래의 기술이 사용될 수 있으며, 또한 유선 기술, 예컨대, 케이블 네트워크 또는 고정 회 선과 같은 IP 기반 액세스 기술도 적용될 수 있다. - 소프트웨어 코드 또는 그 일부로서 구현하기에 적합하고 프로세서 또는 처리 기능부를 사용하여 실행되는 실 시예는 소프트웨어 코드 독립적이며, Objective-C, C, C++, C#, Java, Python, Javascript, 기타 스크립팅 언 어 등과 같은 고급 프로그래밍 언어 또는 기계어 또는 어셈블러와 같은 저급 프로그래밍 언어와 같은 임의의 알 려진 또는 향후 개발되는 프로그래밍 언어를 사용하여 지정될 수 있다. - 실시예의 구현은 하드웨어에 독립적이며, 마이크로프로세서 또는 CPU(Central Processing Unit), MOS(Metal Oxide Semiconductor), CMOS(Complementary MOS), BiMOS((Bipolar MOS), BiCMOS(Bipolar CMOS), ECL(Emitter Coupled Logic) 및/또는 TTL(Transistor-Transistor Logic)과 같은 임의의 알려진 또는 향후 개발되는 하드웨 어 기술 또는 이들의 임의의 하이브리드를 사용하여 구현될 수 있다. - 실시예는 개별 디바이스, 장치, 유닛, 수단 또는 기능부로서 구현되거나 분산된 방식으로 구현될 수 있으며, 예를 들어, 하나 이상의 프로세서 또는 처리 기능부가 처리 시에 사용되거나 공유될 수 있거나, 하나 이상의 처 리 섹션 또는 처리 부분이 처리 시에 사용되고 공유될 수 있으며, 하나의 물리적 프로세서 또는 하나 초과의 물 리적 프로세서가 설명된 대로 특정 처리에 전용인 하나 이상의 처리 부분을 구현하는 데 사용될 수 있다. - 장치는 반도체 칩, 칩셋 또는 그러한 칩 또는 칩셋을 포함하는 (하드웨어) 모듈에 의해 구현될 수 있다. - 실시예는 또한 ASIC(Application Specific IC(Integrated Circuit)) 구성 요소, FPGA(Field-programmable Gate Arrays) 또는 CPLD(Complex Programmable Logic Device) 구성 요소 또는 DSP(Digital Signal Processor) 구성 요소와 같은 하드웨어와 소프트웨어의 임의의 조합으로서 구현될 수 있다. - 실시예는 또한 컴퓨터 판독가능 프로그램 코드가 구현된 컴퓨터 사용가능 매체를 포함하는 컴퓨터 프로그램 제품으로서 구현될 수도 있으며, 컴퓨터 판독가능 프로그램 코드는 실시예에서 설명한 대로 프로세스를 실행하 도록 적응되고, 컴퓨터 사용가능 매체는 비일시적 매체일 수 있다. 본 개시는 특정 실시예를 참조하여 이전에 설명되었지만, 본 개시는 이에 제한되지 않으며 다양한 수정이 이루 어질 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2025-7006666", "section": "도면", "subsection": "도면설명", "item": 1, "content": "실시예와 관련된 개시의 몇 가지 예가 첨부 도면을 참조하여 아래에 예시로서만 설명된다. 도 1은 본 개시의 예가 구현될 수 있는 통신 네트워크 환경의 예를 나타내는 도면이다. 도 2는 본 개시의 예에 따른 빔 보고 절차의 예를 나타내는 시그널링 도면이다. 도 3은 본 개시의 예에 따른 빔 측정 절차의 도면이다. 도 4는 본 개시의 예에 따른 빔 예측을 위한 NN 설계의 도면이다. 도 5는 본 개시의 일부 예에 따른 통신 요소 또는 통신 기능부에서 수행되는 처리의 흐름도를 도시한다. 도 6은 본 개시의 일부 예에 따른 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부에서 수행되는 처리 의 흐름도를 도시한다. 도 7은 본 개시의 일부 예에 따른 통신 요소 또는 통신 기능부의 도면을 도시한다. 도 8은 본 개시의 일부 예에 따른 통신 네트워크 제어 요소 또는 통신 네트워크 제어 기능부의 도면을 도시한다."}
