{"patent_id": "10-2025-7002046", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0043403", "출원번호": "10-2025-7002046", "발명의 명칭": "도광 광학 요소의 검사를 위한 신규한 기술", "출원인": "루머스 리미티드", "발명자": "로넨, 이탄"}}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "도광 광학 요소(lightguide optical element; LOE)의 패싯들의 평행도(parallelism) 및 굴절률의 균질도(homogeneity)를 측정하기 위한 시스템으로서,상기 LOE는, 광-투과성 기판 내로 커플링된 광이 내부 전반사에 의하여 제 1 및 제 2 주면 사이에 포획되도록서로 평행한 상기 제 1 및 제 2 주면 및 광을 기판 밖으로 커플링하도록 구성된 패싯들을 포함하고,상기 시스템은,그 위에 형성된 제 1 슬릿 및 제 2 슬릿을 가지는 하나 이상의 디바이스; 및상기 제 1 슬릿이 이미지에 대응하는 광을 방출하도록 구성된 프로젝터와 상기 제 1 주면 사이에 광학적으로 배치되도록, 그리고 상기 제 2 슬릿이 상기 제 2 주면과 검출기 사이에 광학적으로 배치되도록, 상기 제 1 슬릿및 제 2 슬릿 중 적어도 하나를 제어하기 위해 구성된 처리 유닛 - 상기 제 1 슬릿은 상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 패싯들 중 제 1 패싯으로 진행하도록 배치되고,상기 제 2 슬릿은 상기 제 1 패싯에 의하여 투과된 광을 차단하기 위하여 그리고 상기 패싯들 중 상기 제 1 패싯 및 제 2 패싯에 의하여 반사된 광이 상기 제 2 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을통하여 상기 검출기로 진행하도록 배치됨 -을 포함하며,상기 처리 유닛은,상기 제 1 패싯과 상기 제 2 패싯 사이의 평행도를, 상기 패싯들 중의 하나의 패싯을 포함하지 않는 기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대한 상기 검출기에 의해 검출된 이미지의 천이에기반하여 추론하도록 구성되고,상기 처리 유닛은,상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 제 1 패싯으로진행하고, 상기 제 1 패싯을 통하여 투과된 광이 상기 제 1 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2슬릿을 통하여 상기 검출기로 진행하고, 상기 제 2 슬릿이 상기 제 2 주면과 상기 검출기 사이에 광학적으로 배치되게 하기 위해 상기 제 1 슬릿 및 제 2 슬릿 중 적어도 하나를 제어하도록 구성되며,상기 처리 유닛은,상기 제 1 패싯의 표면들 사이의 굴절률의 균질도 또는 편향(deviation)을, 상기 패싯들 중의 하나의 패싯을 포함하지 않는 기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대하여 상기 검출기에 의해검출된, 상기 제 1 패싯을 통하여 투과된 광에 기반하여 결정하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 처리 유닛은,상기 LOE의 추가 패싯들의 평행도 및 굴절률의 균질도를 측정하기 위하여, 상기 제 1 및 제 2 슬릿에 대한 상기LOE의 측방향 이동 또는 상기 LOE에 대한 상기 제 1 및 제 2 슬릿의 측방향 이동을 제어하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 처리 유닛은, 패싯을 포함하지 않는 기판의 부분을 통하여 진행하는, 상기 프로젝터에 의하여 방출된 이미공개특허 10-2025-0043403-3-지를 상기 검출기에서 캡쳐함으로써 교정하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 시스템은 미러를 포함하고,상기 제 2 슬릿은,상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 제 1 패싯으로진행하고, 상기 제 1 패싯 및 제 2 패싯에 의하여 반사된 광이 상기 제 2 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을 통하여 상기 미러로 진행하고, 상기 미러에 의하여 반사된 광이 상기 제 2 슬릿을 통하여 상기 제 2 주면으로 그리고 상기 제 2 패싯으로 진행하고, 상기 제 2 패싯 및 제 1 패싯에 의하여 반사된 광이 상기 제 1 패싯으로부터 상기 제 1 주면으로 그리고 상기 제 1 슬릿을 통하여 상기 검출기로 진행하도록, 상기 제 2 주면과 상기 미러 사이에 광학적으로 배치된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 프로젝터가 콜리메이터를 포함하고 상기 검출기가 카메라를 포함하거나,상기 프로젝터 및 상기 검출기가 오토콜리메이터(autocollimator)의 일부인, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "도광 광학 요소(LOE)의 패싯들의 평행도를 측정하기 위한 시스템으로서,상기 LOE는, 광-투과성 기판 내로 커플링된 광이 내부 전반사에 의하여 제 1 및 제 2 주면 사이에 포획되도록서로 평행한 상기 제 1 및 제 2 주면 및 광을 기판 밖으로 커플링하도록 구성된 패싯들을 포함하고,상기 시스템은,그 위에 형성된 제 1 슬릿 및 제 2 슬릿을 가지는 하나 이상의 디바이스; 및상기 제 1 슬릿이 이미지에 대응하는 광을 방출하도록 구성된 프로젝터와 상기 제 1 주면 사이에 광학적으로 배치되도록, 그리고 상기 제 2 슬릿이 상기 제 2 주면과 검출기 사이에 광학적으로 배치되도록, 상기 제 1 슬릿및 제 2 슬릿 중 적어도 하나를 제어하기 위해 구성된 처리 유닛 - 상기 제 1 슬릿은 상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 패싯들 중 제 1 패싯으로 진행하도록 배치되고,상기 제 2 슬릿은 상기 제 1 패싯에 의하여 투과된 광을 차단하기 위하여 그리고 상기 패싯들 중 상기 제 1 패싯 및 제 2 패싯에 의하여 반사된 광이 상기 제 2 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을통하여 상기 검출기로 진행하도록 배치됨 -을 포함하며,상기 처리 유닛은,상기 제 1 패싯과 상기 제 2 패싯 사이의 평행도를, 상기 패싯들 중의 하나의 패싯을 포함하지 않는 기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대한 상기 검출기에 의해 검출된 이미지의 천이에기반하여 추론하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 처리 유닛은,상기 LOE의 추가 패싯들의 평행도를 측정하기 위하여, 상기 LOE를 상기 제 1 및 제 2 슬릿에 대하여 측방향으로이동시키거나, 상기 제 1 및 제 2 슬릿을 상기 LOE에 대하여 측방향으로 이동시키도록 구성된, 측정하기 위한시스템.공개특허 10-2025-0043403-4-청구항 8 제 6 항에 있어서,상기 처리 유닛은, 패싯을 포함하지 않는 기판의 부분을 통하여 진행하는, 상기 프로젝터에 의하여 방출된 이미지를 상기 검출기에서 캡쳐함으로써 교정하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "도광 광학 요소(LOE)의 패싯들의 굴절률의 균질도를 측정하기 위한 시스템으로서,상기 LOE는, 광-투과성 기판 내로 커플링된 광이 내부 전반사에 의하여 제 1 및 제 2 주면 사이에 포획되도록서로 평행한 상기 제 1 및 제 2 주면 및 광을 기판 밖으로 커플링하도록 구성된 패싯들을 포함하고,상기 시스템은,그 위에 형성된 제 1 슬릿 및 제 2 슬릿을 가지는 하나 이상의 디바이스; 및프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 제 1 패싯으로 진행하고, 상기 제 1 패싯을 통하여 투과된 광이 상기 제 1 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을 통하여 검출기로 진행하도록, 상기 제 2 슬릿이 상기 제 2 주면과 상기 검출기 사이에 광학적으로 배치되게 하기 위해 상기 제 1 슬릿 및 제 2 슬릿 중 적어도 하나를 제어하기 위해 구성된 처리 유닛을 포함하며,상기 처리 유닛은,상기 제 1 패싯의 표면들 사이의 굴절률의 균질도 또는 편향을, 상기 패싯들 중의 하나의 패싯을 포함하지 않는기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대하여 검출기에 의해 검출된, 상기 제1 패싯을 통하여 투과된 광에 기반하여 결정하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 처리 유닛은,상기 LOE의 추가 패싯들의 굴절률의 균질도를 측정하기 위하여, 상기 LOE를 상기 제 1 및 제 2 슬릿에 대하여측방향으로 이동시키거나, 상기 제 1 및 제 2 슬릿을 상기 LOE에 대하여 측방향으로 이동시키도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 시스템은 미러를 포함하고,상기 처리 유닛은,상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 제 1 패싯으로진행하고, 상기 제 1 패싯 및 제 2 패싯에 의하여 반사된 광이 상기 제 2 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을 통하여 상기 미러로 진행하고, 상기 미러에 의하여 반사된 광이 상기 제 2 슬릿을 통하여 상기 제 2 주면으로 그리고 상기 제 2 패싯으로 진행하고, 상기 제 2 패싯 및 제 1 패싯에 의하여 반사된 광이 상기 제 1 패싯으로부터 상기 제 1 주면으로 그리고 상기 제 1 슬릿을 통하여 상기 검출기로 진행하도록, 제2 슬릿이 상기 제 2 주면과 상기 미러 사이에 광학적으로 배치되게 하도록 구성된, 측정하기 위한 시스템."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "도광 광학 요소(LOE)의 패싯들의 평행도 및 굴절률의 균질도를 측정하기 위한 방법으로서,상기 LOE는, 광-투과성 기판 내로 커플링된 광이 내부 전반사에 의하여 제 1 및 제 2 주면 사이에 포획되도록서로 평행한 상기 제 1 및 제 2 주면 및 광을 기판 밖으로 커플링하도록 구성된 패싯들을 포함하고,공개특허 10-2025-0043403-5-상기 방법은,제 1 슬릿을 이미지에 대응하는 광을 방출하도록 구성된 프로젝터와 상기 제 1 주면 사이에 광학적으로 배치하는 단계 - 상기 제 1 슬릿은 상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고상기 패싯들 중 제 1 패싯으로 진행하도록 배치됨 -;상기 제 2 슬릿을 상기 제 2 주면과 검출기 사이에 광학적으로 배치하는 단계 - 상기 제 2 슬릿은 상기 제 1 패싯에 의하여 투과된 광을 차단하기 위하여 그리고 상기 패싯들 중 상기 제 1 패싯 및 제 2 패싯에 의하여 반사된 광이 상기 제 2 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을 통하여 상기 검출기로 진행하도록 배치됨 -;상기 제 1 패싯과 상기 제 2 패싯 사이의 평행도를, 상기 패싯들 중의 하나의 패싯을 포함하지 않는 기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대한 상기 검출기에 의해 검출된 이미지의 천이에기반하여 추론하는 단계;상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 제 1 패싯으로진행하고, 상기 제 1 패싯을 통하여 투과된 광이 상기 제 1 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2슬릿을 통하여 상기 검출기로 진행하고, 상기 제 2 슬릿을 상기 제 2 주면과 상기 검출기 사이에 광학적으로 배치하는 단계; 및상기 제 1 패싯의 표면들 사이의 굴절률의 균질도 또는 편향을, 상기 패싯들 중의 하나의 패싯을 포함하지 않는기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대하여 상기 검출기에 의해 검출된, 상기 제 1 패싯을 통하여 투과된 광에 기반하여 결정하는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 방법은,상기 LOE의 추가 패싯들의 평행도 및 굴절률의 균질도를 측정하기 위하여, 상기 LOE를 상기 제 1 및 제 2 슬릿에 대하여 측방향으로 이동시키거나, 상기 제 1 및 제 2 슬릿을 상기 LOE에 대하여 측방향으로 이동시키는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서,상기 방법은,패싯을 포함하지 않는 기판의 부분을 통하여 진행하는, 상기 프로젝터에 의하여 방출된 이미지를 상기 검출기에서 캡쳐함으로써 교정하는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "도광 광학 요소(LOE)의 패싯들의 평행도를 측정하기 위한 방법으로서,상기 LOE는, 광-투과성 기판 내로 커플링된 광이 내부 전반사에 의하여 제 1 및 제 2 주면 사이에 포획되도록서로 평행한 상기 제 1 및 제 2 주면 및 광을 기판 밖으로 커플링하도록 구성된 패싯들을 포함하고,상기 방법은,상기 제 1 슬릿을 이미지에 대응하는 광을 방출하도록 구성된 프로젝터와 상기 제 1 주면 사이에 광학적으로 배치하는 단계 - 상기 제 1 슬릿은 상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 패싯들 중 제 1 패싯으로 진행하도록 배치됨 -;상기 제 2 슬릿을 상기 제 2 주면과 검출기 사이에 광학적으로 배치하는 단계 - 상기 제 2 슬릿은 상기 제 1 패싯에 의하여 투과된 광을 차단하기 위하여 그리고 상기 패싯들 중 상기 제 1 패싯 및 제 2 패싯에 의하여 반사공개특허 10-2025-0043403-6-된 광이 상기 제 2 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2 슬릿을 통하여 상기 검출기로 진행하도록 배치됨 -; 및상기 제 1 패싯과 상기 제 2 패싯 사이의 평행도를, 상기 패싯들 중의 하나의 패싯을 포함하지 않는 기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대한 상기 검출기에 의해 검출된 이미지의 천이에기반하여 추론하는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 방법은,상기 LOE의 추가 패싯들의 평행도를 측정하기 위하여, 상기 LOE를 상기 제 1 및 제 2 슬릿에 대하여 측방향으로이동시키거나, 상기 제 1 및 제 2 슬릿을 상기 LOE에 대하여 측방향으로 이동시키는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15 항에 있어서,상기 방법은,패싯을 포함하지 않는 기판의 부분을 통하여 진행하는, 상기 프로젝터에 의하여 방출된 이미지를 상기 검출기에서 캡쳐함으로써 교정하는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "도광 광학 요소(LOE)의 패싯들의 굴절률의 균질도를 측정하기 위한 방법으로서,상기 LOE는, 광-투과성 기판 내로 커플링된 광이 내부 전반사에 의하여 제 1 및 제 2 주면 사이에 포획되도록서로 평행한 상기 제 1 및 제 2 주면 및 광을 기판 밖으로 커플링하도록 구성된 패싯들을 포함하고,상기 방법은,제 1 슬릿을 이미지에 대응하는 광을 방출하도록 구성된 프로젝터와 상기 제 1 주면 사이에 배치하는 단계 - 상기 제 1 슬릿은 상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 패싯들중 제 1 패싯으로 진행하도록 배치됨 -;상기 프로젝터로부터의 광이 상기 제 1 슬릿을 통하여 상기 제 1 주면으로 그리고 상기 제 1 패싯으로진행하고, 상기 제 1 패싯을 통하여 투과된 광이 상기 제 1 패싯으로부터 상기 제 2 주면으로 그리고 상기 제 2슬릿을 통하여 검출기로 진행하도록, 상기 제 2 슬릿을 상기 제 2 주면과 상기 검출기 사이에 배치하는 단계;및상기 제 1 패싯의 표면들 사이의 굴절률의 균질도 또는 편향을, 상기 패싯들 중의 하나의 패싯을 포함하지 않는기판의 부분을 통하여 상기 제 1 및 제 2 주면에 수직으로 투과된 광에 대하여 상기 검출기에 의해 검출된, 상기 제 1 패싯을 통하여 투과된 광에 기반하여 결정하는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 방법은,상기 LOE의 추가 패싯들의 굴절률의 균질도를 측정하기 위하여, 상기 LOE를 상기 제 1 및 제 2 슬릿에 대하여측방향으로 이동시키거나, 상기 제 1 및 제 2 슬릿을 상기 LOE에 대하여 측방향으로 이동시키는 단계공개특허 10-2025-0043403-7-를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,상기 방법은,패싯을 포함하지 않는 기판의 부분을 통하여 진행하는, 상기 프로젝터에 의하여 방출된 이미지를 상기 검출기에서 캡쳐함으로써 교정하는 단계를 포함하는, 측정하기 위한 방법."}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "도광 광학 요소(LOE)를 검사하는 것은 제 1 슬릿을 광을 방출하도록 구성된 프로젝터와 LOE의 제 1 주면 사이에 광학적으로 배치하는 단계와 제 2 슬릿을 LOE의 제 2 주면과 검출기 사이에 광학적으로 단계를 포함할 수 있다. 두 개의 패싯들 사이의 패싯 평행도는, 패싯을 포함하지 않는 기판의 부분을 통하여 제 1 및 제 2 주면에 수직으 로 투과된 광에 대한, 제 1 패싯으로부터 제 2 패싯으로 반사된 이미지의 천이에 기반하여 추론될 수 있다. 패 싯 굴절률 균질도 또는 편향은, 패싯을 포함하지 않는 기판의 부분을 통하여 제 1 및 제 2 주면에 수직으로 투과 된 광에 대한, 패싯을 통하여 투과된 광에 기반하여 추론될 수 있다."}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 헤드-마운트 디스플레이와 같은 근안 디스플레이(near eye display) 시스템의 분야에 관한 것이다. 특히, 본 발명은 근안 디스플레이 시스템의 도광 광학 요소(lightguide optical element; LOE)의 패싯(facet) 을 검사하기 위한 기술에 관한 것이다."}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자와 컴퓨터 간의 인터페이스를 개선하려는 소비자의 요구는 일반적으로 스마트 글래스로 알려져 있는 고품 질 이미지의 헤드 마운트 디스플레이(HMD) 또는 근안 디스플레이(near-eye display; NED)에 대한 관심의 증가를 초래했다. 이러한 디바이스는 가상 현실(VR) 또는 증강 현실(AR) 경험을 제공할 수 있고, 사용자가 디지털 콘 텐츠 및 그 주변 환경과 상호작용하는 방식을 향상시킨다. 소비자들은 HMD를 사용할 때에 더 나은 이미지 품질, 몰입형 경험 및 더 큰 편안함을 추구하고 있다. 소비자들 은 현실적이고 즐거운 시청 경험을 생성하기 위하여 고해상도, 생생한 색상 및 최소의 왜곡을 가지는 디스플레 이를 기대한다. NED 시스템에서의 중요한 구성 요소는 도파로(waveguide)이고, 이것은 광을 시스템 이미지 프로젝터로부터 사용 자의 눈으로 유도한다. 도파로는 주면(major surface)을 따라 광을 투과시키기 위하여 내부 전반사에 기반하여 동작하고, 도파로를 따라 배치된 패싯 밖으로의 반사를 사용하여 광을 사용자의 눈으로 지향시킨다. 최적의 도 파로 성능을 달성하려면 사용자의 시각적 경험을 저하시킬 수 있는 결함을 방지하기 위하여 정밀한 설계 및 제 조가 요구된다. NED 시스템에 통합하기 이전에 도파로의 광학 성능을 평가하면 생산 비용을 줄이는 데 도움이 될 수 있다. 최 적의 도파로 성능을 달성하기 위한 주요 요인은 패싯들이 평행하다는 것과 균질한 굴절률을 가진다는 것을 보장 하는 것을 포함한다. 종래에는, 이러한 특성을 테스트하는 것이 시간이 많이 걸리고 비용이 많이 드는 작업이 었고, 이것이 NED 시스템의 가용성과 채택을 제한했다."}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러므로, 도파로를 효율적으로 검사할 수 있는 혁신적인 기술에 대한 수요가 존재한다."}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 LOE의 광학 성능을 측정하기 위한 혁신적인 기술을 소개한다. LOE에서의 패싯 평행도를 측정하기 위 한 이전의 방법은, 예를 들어 미국 특허 제 11,226,261호 및 PCT 국제 특허 공개 WO2023/007491호에 개시된 바 와 같이 커플링 프리즘(coupling prism)을 사용하였다. 대조적으로, 본원에서 개시된 기술은 커플링 프리즘을 요구하지 않는다. 일 실시형태에서, LOE는 주면 중 하나 이상을 통하여 도파로 내로 광을 커플링하여, 패싯 중 하나 이상 밖으로 반사하거나 이를 통하여 투과시킴으로써 측정된다. 그러면 커플링 프리즘에 대한 필요성이 제거되어, 측정 시스템의 기계적 복잡성을 줄이고 테스트 효율성을 향상시킨다.명세서에 통합되고 그 일부를 구성하는 첨부 도면은 본 발명의 양태들의 다양한 예시적 실시형태를 예시하는 다 양한 예시적인 시스템, 방법 등을 예시한다. 도면에서 예시된 구성 요소의 경계(예를 들어, 상자, 상자들의 그 룹 또는 기타 형상)가 경계의 하나의 예를 나타낸다는 것이 이해될 것이다. 당업자는 하나의 구성 요소가 다수 의 구성 요소로서 설계될 수 있다는 것 또는 다수의 구성 요소들이 하나의 구성 요소로서 설계할 수 있다는 것 을 이해할 것이다. 다른 구성 요소의 내부의 구성 요소로서 표시된 어떤 구성 요소는 외부의 구성 요소로서 구 현될 수 있으며 그 반대도 가능하다. 더 나아가, 구성 요소들은 반드시 비율에 맞게 그려진 것은 아니다."}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 특정 실시형태는, 예를 들어 가상 현실 또는 증강 현실 디스플레이일 수 있는, 일반적으로 스마트 글 래스로 알려져 있는 헤드 마운트 디스플레이(HMD) 또는 근안 디스플레이를 위하여 광학 개구 확장을 달성하기 위한 광 투영 시스템 및 광학 시스템을 제공한다. 더 양호하고 더 편안한 인간-컴퓨터 인터페이스에 대한 소비 자의 수요는 더 양호한 이미지 품질과 더 작은 디바이스에 대한 수요를 자극시켜 왔다. 도 1은 근안 디스플레이 디바이스의 예시적인 구현형태를 도시한다. 근안 디스플레이 디바이스는 도면에 서 단지 하나의 예로서 개시되고, 본원에서 개시된 진보적인 기술은 이와 같은 디바이스로 한정되지 않는다. 도 1의 도시된 실시형태에서, 근안 디스플레이는 이미지를 도광 광학 요소(LOE)로 주입하기 위하여 광학 적으로 커플링된 콤팩트한 이미지 프로젝터 또는 프로젝션 유닛을 채용한다. 프로젝션 유닛으로부터의 광의 광학 개구 확장(optical aperture expansion)은 이상적으로 서로 평행하고, 이미지 광의 전파의 방향에 대 하여 비스듬히 배치된 부분 반사 표면(패싯(facet)과 상호교환가능하도록 지칭됨)을 채용하는, 이미지 조명을 점진적으로 재지향시키기 위한 하나 이상의 배열체에 의하여 LOE 내에서 이루어질 수 있고, 각각의 연속적 인 패싯은 이미지 광의 일부를 굴절된 방향으로 편향시킨다. 부분 반사 패싯은 \"눈 움직임 박스(eye-motion box, EMB)\"라고 규정된 구역 내에 위치된 관찰자의 눈을 향하는 이미지 조명의 비율을 점진적으로 커플링 아웃 하는 커플링 아웃 배열체로서 작동할 수도 있다. 전체 디바이스는 사용자의 대응하는 눈에 작용하는 각각의 프로젝션 유닛과 LOE를 이용하여 사용자의 머리에 대하여 지지되는 것이 바람직하다. 도면에 예시된 바와 같은 하나의 특히 바람직한 옵션에서는, 지지 배열체가, 프로젝션 유닛 및 LOE가 광학적으로 연결된 렌즈와 사용자 귀에 대하여 디바이스를 지지하 기 위한 측면이 있는 프레임을 가지는 렌즈들의 얼굴 장착형 세트(예를 들어, 본 명세서에서는 \"아이 글래스 (eye glass)\" 또는 \"스마트 글래스\"라고 불리는 Rx 렌즈, 선글라스 등)로서 구현된다. 머리띠, 바이저 또는 헬 멧에서 매달려 있는 디바이스를 비한정적으로 포함하는, 지지 배열체의 다른 형태들도 사용될 수 있다. 근안 디스플레이는, 통상적으로는 소형 온보드 배터리(미도시) 또는 그 외의 일부 적합한 전원으로부터 전력 을 활용하는, 프로젝션 유닛을 작동시키기 위한 제어기를 통상적으로 포함하는 다양한 추가적인 구성 요 소를 포함할 수 있다. 제어기는 이미지 프로젝터를 구동하기 위한 처리 유닛 또는 처리 회로와 같은 모 든 필요한 전자 구성 요소를 포함할 수 있다. 도 2는 LOE의 부분 반사 패싯(101-104)의 평행도를 측정하기 위한 시스템의 개략도를 도시한다. 시스 템은 이미징 콜리메이터와 콜리메이팅 렌즈를 포함하는 디스플레이-콜리메이터(display- collimator) 섹션, 그 위에 형성된 개별 슬릿을 가지는 두 개의 디바이스(131, 132), 및 렌즈와 검출기 를 포함하는 콜리메이팅 이미지 획득 섹션을 포함할 수 있다. 시스템은 디스플레이-콜리메이터 섹 션, 이미지 획득 섹션, 및 디바이스(131, 132) 중 하나 이상을 제어할 수 있는 처리 유닛을 더 포 함할 수 있다. 처리 유닛은 시스템의 다른 요소들에 대하여 검사 대상 LOE를 이동시키기 위한(즉, 측방향 위치설정을 제어함) 제어 기계(control machinery; 40)를 더 제어할 수 있다. 처리 유닛은 본 명세서에서 개시된 시스템의 다양한 요소를 제어하도록 프로그래밍되고(예를 들어, 소프트 웨어 또는 펌웨어 등), LOE의 패싯들의 평행도 및 굴절률의 균질도를 계산/추론하기 위한 하나 이상의 프로세서 (예를 들어, 마이크로프로세서, 마이크로컨트롤러 등과 같음), 메모리 등을 포함할 수 있다. 도 2에 도시된 바와 같이, 디바이스(131, 132)는 그들의 개별 슬릿들이 LOE를 사이에 두고 서로 마주보도록 배치되게끔 배치될 수 있어서, 디스플레이-콜리메이터 섹션에 의하여 투영된 이미지는 LOE 패싯(101-104)에 의해 초래된 임의의 각도 천이가 없이 이미지 획득 섹션, 특히 검출기에 도달한다. 이러한 구성은 시 스템을 평행 패싯들의 이상적인 쌍에 대한 이미지의 위치를 위한 레퍼런스로서 교정하기 위하여 사용될 수 있다. 도 3은 디바이스와 LOE 양자 모두가 도 2에 도시된 그들의 위치로부터 천이된 시스템의 개략도를 도시한다. 디바이스(131 및 132)의 슬릿들은 디스플레이-콜리메이터 섹션에 의하여 투영된 직접 이미지가 패싯에 도달하도록 배치된다. 패싯에 의하여 투과된 임의의 광은 이미지 획득 섹션에 도달하는 것이 차단된다. 패싯에 의하여 반사된 광은 패싯에 도달하고, 이것은 광 중 일부를 이미지 획득 섹 션으로 반사한다. 검출기에 도달하는 광은 두 번 반사된 광에 해당하고, 처음에는 패싯에 의하여 그리고 두 번째에는 패싯에 의하여 반사된 것이다. 도 2에 도시된 배열체에서 캡쳐된 이미지에 대한 도 3 의 배열체 내의 검출기에서 캡쳐된 검출된 이미지의 천이를 측정함으로써, 시스템은 패싯들(101 및 102) 사이의 평행도를 추론할 수 있다. 도 4는 이러한 구성에서 패싯들(102 및 103) 사이의 평행도를 측정하기 위하여 LOE가 도 3에 도시된 그 위 치로부터 천이된 시스템의 개략도를 도시한다. 디바이스(131 및 132)의 슬릿은 디스플레이-콜리메이터 섹 션에 의하여 투영된 이미지가 패싯에 도달하도록 배치된다. 패싯에 의하여 투과된 임의의 광은 이미지 획득 섹션에 도달하는 것이 차단된다. 패싯에 의하여 반사된 광은 패싯에 도달하고, 이 것은 광 중 일부를 이미지 획득 섹션으로 반사한다. 검출기에 도달하는 광은 두 번 반사된 광에 해당 하고, 처음에는 패싯에 의하여 그리고 두 번째에는 패싯에 의하여 반사된 것이다. 도 2에 도시된 배 열체에서 캡쳐된 이미지에 대한 도 4의 배열체 내의 검출기에서 캡쳐된 검출된 이미지의 천이를 측정함으로 써, 시스템은 패싯들(102 및 103) 사이의 평행도를 추론할 수 있다. 도 2, 3, 4의 정보를 바탕으로 시스템 은 패싯(101 및 103) 간의 평행도를 단순한 수학적 계산에 의해서도 추론할 수 있다. 예를 들어, 두 슬릿이 서로 마주보는 구성(도 2에서와 같음)에서 검출된 이미지가 영점 위치에 중심을 두고 있 고, 도 3에 도시된 구성의 경우에는 이미지의 중심이 왼쪽으로 20'' 이동하며, 도 4에 제시된 상황의 경우에는 이미지가 오른쪽으로 20''에 위치된다고 가정한다. 그러한 측정들로부터, 시스템은 LOE의 재료가 1.5의 굴 절률을 가진다면 패싯들(101 및 102)이 평행하고 패싯이 시계 방향으로 6.66'' 회전된다는 것을 수학식 a=/2n에 따라서 추론할 수 있는데, a는 두 패싯들 사이의 기계적 편향 각도이고(a=0이면 완벽한 평행도를 의미 함), 는 관찰된 각도 이미지 천이이며, n은 LOE의 굴절률이다. 그 모든 패싯이 디바이스의 슬릿 앞에서 회전하도록 전체 LOE를 계속 천이시킴으로써, 시스템은 전체 패싯 구조체의 평행도를 추론할 수 있다. 유사한 기술이 도 5의 시스템을 사용하여 구현될 수 있다. 시스템에서, 디스플레이-콜리메이터 섹션 은 오토 콜리메이터를 포함하고, 이전 도면들의 이미지징 콜리메이터를 미러로 대체한다. 디바이 스의 슬릿은 프로젝터로부터의 광이 디바이스의 슬릿을 통하여 제 1 주면으로 그리고 제 1 패싯으로 진행하고, 제 1 패싯 및 제 2 패싯에 의하여 반사된 광이 제 2 패싯으로부터 제 2 주면으로 그리고 제 2 디바이스의 슬릿을 통하여 미러로 진행하도록, 제 2 주면과 미러 사이에 광학적으로 배치된다. 미러에 의하여 반사된 광은 디바이스의 제 2 슬릿을 통하여 제 2 주면 으로 그리고 제 2 패싯으로 진행하고, 제 2 패싯과 제 1 패싯에 의하여 반사된 광은 제 1 패싯으로부터 제 1 주면으로 그리고 디바이스의 제 1 슬릿을 통하여 검출기로 진행한다. 검출기에 도달하는 광은 관련된 두 개의 관련된 패싯을 두 번 거치도록 진행하고, 따라서 검출기에서 수 광되는 광의 세기는 원래 투영된 광보다 현저히 감소된다. 어레이 내의 패싯들의 적어도 한 쌍의 패싯에 충돌하는 광의 반사 편향이 측정되는 구조체의 임의의 종류가 고 려될 수 있다. 예를 들어, 제 1 패싯 i와 i+1 대신에 i+2 사이의 광의 반사가 측정될 수 있거나, 심지어 제 1 패싯 i와 i+n 사이의 광의 반사가 측정될 수 있는데, n은 1과 N-1 사이의 천이하는 정수이고, N은 패싯의 총수 이다. 도 6에는 디바이스의 슬릿이 패싯 앞에 위치하며, 패싯으로 천이될 수 있는 예시적인 시 스템이 도시된다. 도 7은 LOE의 패싯들(101-104)의 굴절률의 균질도를 측정하기 위한 시스템을 도시한다. LOE는 서 로 접착된 개별적으로 코팅된 판 또는 슬라이스(1000-1004)로부터 제조될 수 있다. 인접한 판들 사이의 계면은 패싯을 형성한다. 예를 들어, 판과 판 사이의 계면은 패싯을 형성한다. LOE의 품질은 단순히 패싯들(101-104)이 얼마나 평행할 수 있는지 뿐만 아니라, 패싯(101-104)을 형성하는 계면에서의 판 (1000-1004)의 굴절률의 균질도에 의해서도 결정될 것이다. 패싯들(101-104)의 굴절률의 균질도를 측정하기 위하여, 디바이스(131, 132)는 그들의 슬릿이 도 1 및 도 7에서 와 같이 서로 마주보도록 배치될 수 있다. 시스템의 교정은 도 1에 도시된 바와 같은 구성에서 이루어지는데, 여기에서 LOE는 투영된 광이 경로를 따라서 상이한 판들을 넘어가지 않으면서 단일 슬라이스를 통하 여 LOE를 통과하여 전파되도록 디바이스(131, 132)에 대하여 배치된다. 즉, 교정 시에, 이미징 유닛로 부터의 방출된 광은 패싯을 포함하지 않는 LOE의 부분을 통하여 제 1 및 제 2 주면(12, 13)에 수직으 로 투과된다. 패싯의 굴절률의 균질도를 측정하기 위하여, 디바이스(131, 132)는 슬릿들이 서로 마주보도록 배치된 상태 를 유지한다. 그러나, 도 7에 도시된 바와 같이, LOE는 왼쪽으로 이동했고, 따라서 투영된 광이 제 1 주면 을 통하여 슬라이스 또는 판에서 LOE에 진입하고, 그 후에 판과 판 사이의 계면(즉, 패싯)을 지나가게 된다. 판들(1001 및 1000)의 굴절률이 계면에서 동일하지 않으면, 스넬의 법칙에 따라서 광이 두 표면 사이의 계면을 통과할 때 도 7의 배열체를 사용하여 측정될 수 있는 광선의 편향이 존재할 것이다. LOE를 왼쪽으로 더 이동시킴으로써, 패싯들(102, 103 등)의 굴절률에서의 차이가 검출될 수 있도록 판들 (1002 및 1001, 1002 및 1003 등) 사이의 계면이 검사될 수 있다. 광이 LOE의 주면에 수직으로 진입 하고 각도 ß로 출사한다고 가정하면, 다음 수학식이 추론될 수 있고: [수학식 1]"}
{"patent_id": "10-2025-7002046", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기에서 는 패싯의 기울어진 각도이다(=0이면 패싯이 LOE의 주면과 평행하다는 것을 의미하고, 도면에 서 는 38도와 같다). 방법 예시적인 방법들은 도 8 및 도 9에 도시된 흐름도를 참조하여 더 잘 이해될 수 있다. 설명의 편의를 위하여 도 시된 방법론은 일련의 블록들로서 도시되고 설명되지만, 이러한 방법론은 블록들의 순서에 의하여 한정되지 않 는다는 것이 이해되어야 하는데, 그 이유는 일부 블록들은 도시되고 설명된 것과 다른 순서로 또는 다른 블록들 과 동시에 실행될 수 있기 때문이다. 더욱이, 도시된 블록들 모두보다 적은 수의 블록들이 예시적인 방법론을 구현하기 위하여 요구될 수도 있다. 더 나아가, 추가적인 방법론, 대안적인 방법론, 또는 양자 모두는 도시되 지 않은 추가적인 블록이 채용할 수 있다. 흐름도에서 블록은 로직을 사용하여 구현될 수 있는 \"처리 블록\"을 나타낸다. 처리 블록은 방법 단계 또는 방 법 단계를 수행하기 위한 장치 요소를 나타낼 수 있다. 흐름도는 임의의 특정 프로그래밍 언어, 방법론 또는 스타일(예를 들어, 절차적, 객체지향적)을 위한 문법을 나타내지 않는다. 오히려, 흐름도는 당업자가 도시된 처리를 수행하기 위한 로직을 개발하기 위하여 채용할 수 있는 기능성 정보를 나타낸다. 일부 예에서는 임시 변수, 루틴 루프 등과 같은 프로그램 요소들이 도시되지 않는다는 것이 이해될 것이다. 전자 및 소프트웨어 응 용 프로그램은, 도시된 블록들이 도시된 순서와 다른 시퀀스로 수반할 수 있거나 블록들이 조합되거나 여러 구성 요소로 분리될 수 있도록 동적이고 유연한 프로세스를 포함할 수 있다는 것이 역시 이해될 것이다. 프로세 스들이 기계어, 절차적 프로그래밍, 객체 지향 프로그래밍, 또는 인공지능 기술과 같은 다양한 프로그래밍 접근 방식을 사용하여 구현될 수 있다는 것이 이해될 것이다. 도 8은 LOE의 패싯들의 평행도를 측정하기 위한 예시적인 방법에 대한 흐름도를 도시한다. 도 8에 도시된 바와 같이, 방법은, 810에서 LOE의 주면에 수직으로 광을 투영함으로써 이루어지는 교정, 820에서 패싯을 포함하지 않는 LOE의 부분을 가로질러 서로 마주보도록 슬릿 중 하나 이상을 천이시키는 것, 그리고 830에서 투 영된 광을 측정하여 비편향된 평행도를 측정하는 것을 포함할 수 있다. 840에서, 방법은 프로젝터로부터의 광이 제 1 슬릿을 통하여 제 1 주면으로 그리고 제 1 패싯(facet i)으 로 진행하도록, 그리고 제 2 슬릿이 제 1 패싯에 의하여 투과된 광을 차단하도록, 그리고 제 1 패싯에 의하여 제 2 패싯으로 반사된 광이 제 2 패싯으로부터 제 2 주면으로 그리고 제 2 슬릿을 통하여 검출기로 진행하도록, 적어도 하나 슬릿 및/또는 LOE를 천이시키는 것을 포함할 수 있다. 850에서, 방법은 패싯을 포함하지 않 는 기판의 부분을 통하여 제 1 및 제 2 주면에 수직으로 투과된 광에 대한, 검출기에 의해 검출된 이미지로부터 의 편향된 반사를 측정하는 것을 포함할 수 있다. 860에서, 방법은 제 1 패싯과 제 2 패싯 사이의 평행도 를 측정된 편향에 기반하여 추론하는 것을 포함할 수 있다. 그러면, 이러한 방법은 LOE의 하부에 있는 추가적 인 패싯들에 대하여 반복될 수 있다. 도 9는 LOE의 패싯들의 굴절률의 균질도를 측정하기 위한 예시적인 방법에 대한 흐름도를 도시한다. 도 9 에 도시된 바와 같이, 방법은, 910에서 LOE의 주면에 수직으로 광을 투영함으로써 이루어지는 교정, 920에 서 패싯을 포함하지 않는 LOE의 부분을 가로질러 서로 마주보도록 슬릿 중 하나 이상을 천이시키는 것, 그리고 930에서 패싯을 포함하지 않는 LOE의 부분을 지나가는 투영된 광을 측정하는 것을 포함할 수 있다. 940에서, 방법은 프로젝터로부터의 광이 제 1 슬릿을 통하여 제 1 주면으로 그리고 패싯들 중 제 1 패싯으 로 진행하도록, 그리고 제 2 슬릿이 제 1 패싯에 의하여 투과된 광을 차단하도록, 그리고 제 1 패싯을 통하여 투과된 광이 제 1 패싯으로부터 제 2 주면으로 그리고 제 2 슬릿을 통하여 검출기로 진행하도록, 적어도 하나 슬릿 및/또는 LOE를 천이시키는 것을 포함할 수 있다. 950에서, 방법은 제 1 패싯에 의하여 편향된 광 투 과를 측정하는 것을 포함할 수 있다. 960에서, 방법은 패싯을 포함하지 않는 LOE의 부분을 통하여 제 1 및 제 2 주면에 수직으로 투과된 광에 대한 측정된 편향된 광 투과에 기반하여 슬라이스들의 균질도를 추론하는 것을 포함할 수 있다. 도면들은 순차적으로 발생하는 다양한 동작들을 예시하지만, 예시된 다양한 동작들은 실질적으로 병렬적으로 일 어날 수 있다는 것이 이해되어야 하고, 동작들이 병렬적으로 발생하는 것으로 도시될 수 있지만, 이러한 동작들 이 실질적으로 순차적으로 일어날 수 있다는 것이 이해되어야 한다. 예시된 방법에 관련하여 다수의 프로세스 들이 설명되지만, 더 많거나 더 적은 수의 프로세스들이 채용될 수 있다는 것과, 경량 프로세스, 정규 프로세스, 스레드 또는 기타 접근 방식이 채용될 수 있다는 것이 이해되어야 한다. 일부 경우에는, 다른 예시 적인 방법들이 실질적으로 병렬적으로 일어나는 동작들을 포함할 수도 있다는 것이 이해되어야 한다. 도시된 예시적인 방법 및 기타 실시형태는 실시간으로, 소프트웨어 또는 하드웨어 또는 하이브리드 소프트웨어/하드웨 어 구현형태에서 실시간보다 빠르게, 또는 소프트웨어 또는 하드웨어 또는 하이브리드 소프트웨어/하드웨어 구 현형태에서 실시간보다 느리게 동작할 수 있다. 정의 다음은 본 명세서에서 사용된 선택된 용어는 정의를 포함한다. 이러한 정의는 용어의 범위에 포함되고 구현을 위하여 사용될 수 있는 컴포넌트들의 다양한 예 또는 형태를 포함한다. 이러한 예들은 한정하는 것으로 의도되 지 않는다. 용어의 단수형 및 복수형 형태 모두는 이러한 정의에 속할 수 있다. \"작동가능한 연결(Operable connection)\" 또는 엔티티들이 \"작동가능하게 연결되는(Operably connected)\" 연결 은 신호, 물리적 통신, 또는 논리적 통신이 전송 또는 수신될 수 있는 연결이다. 통상적으로, 작동가능한 연결 은 물리적 인터페이스, 전기적 인터페이스, 또는 데이터 인터페이스를 포함하지만, 작동가능한 연결은 작동가능 한 제어를 허용하기에 충분한 연결들의 이러한 타입 또는 그 외의 타입들의 상이한 조합을 포함할 수 있다는 것 에 주의하여야 한다. 예를 들어, 두 엔티티는 직접적으로 또는 프로세서, 운영 체제, 로직, 소프트웨어, 또는 기타 엔티티와 같은 하나 이상의 중간 엔티티를 통하여 신호를 서로 통신할 수 있게 됨으로써 작동가능하게 연 결될 수 있다. 논리적 또는 물리적 통신 채널이 작동가능한 연결을 생성하기 위하여 사용될 수 있다. \"포함한다(include)\" 또는 \"포함하는(including)\"이라는 용어가 상세한 설명 또는 청구항에 사용되든, 이러한 용어는 \"포함하는(comprising)\"이라는 용어가 청구항에서 전이어(transitional word)로서 채용될 때 해석되야 경우와 유사한 방식으로 포괄적인 것으로 의도된다. 더 나아가, \"또는(or)\"이 상세한 설명이나 청구항에서 사 용된 경우(예를 들어, A 또는 B), 이것은 \"A 또는 B 또는 둘 다\"를 의미하도록 의도된다. 출원인이 \"A 또는 B 만, 그러나 둘 다는 아님\"을 의도할 경우, \"A 또는 B만 해당하고 양자 모두는 아님(only A or B but not both)\"이라는 표현이 채용될 것이다. 따라서, 본 명세서에서 용어 \"or\"가 사용되는 것은 포괄적인 것이고 배타 적인 사용이 아니다. Bryan A. Garner, A Dictionary of Modern Legal Usage 624 (2d. Ed. 1995)를 참조한다. 예시적인 시스템, 방법 등은 예들을 설명함으로써 예시되었지만, 그리고 예들은 매우 상세하게 설명되었지만, 발명의 범위를 이러한 세부 사항으로 한정하거나 임의의 방식으로 제한하는 것은 출원인의 의도가 아니다. 물 론, 본원에서 설명된 시스템, 방법, 등을 설명하기 위하여 구성요소들 또는 방법론들의 모든 구상가능한 조합을 설명하는 것은 가능하지 않다. 추가적인 장점과 수정예들이 당업자에게 쉽게 떠오를 것이다. 그러므로, 본 발 명은 도시되고 설명된 특정한 세부 사항, 대표 장치 및 예시적인 예들로 한정되지 않는다. 따라서, 본원은 첨 부된 청구항의 범위에 속하는 변경예, 수정예, 변형예를 포함하도록 의도된다. 더 나아가, 앞선 설명은 본 발 명의 범위를 한정하려는 것이 아니다. 오히려, 본 발명의 범위는 첨부된 청구항 및 그들의 균등물에 의하여 결 정되어야 한다."}
{"patent_id": "10-2025-7002046", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 근안 디스플레이 디바이스의 예시적인 구현형태를 도시한다. 도 2는 LOE의 부분 반사 패싯(partially reflecting facets)의 평행도를 측정하기 위한 예시적인 시스템의 개략 도를 도시한다. 도 3은 LOE의 부분 반사 패싯의 평행도를 측정하기 위한 예시적인 시스템의 개략도를 도시한다. 도 4는 LOE의 부분 반사 패싯의 평행도를 측정하기 위한 예시적인 시스템의 개략도를 도시한다. 도 5는 LOE의 부분 반사 패싯의 평행도를 측정하기 위한 예시적인 시스템의 개략도를 도시한다. 도 6은 LOE의 부분 반사 패싯의 평행도를 측정하기 위한 예시적인 시스템의 개략도를 도시한다. 도 7은 LOE의 패싯의 굴절률의 균질도를 측정하기 위한 예시적인 시스템의 개략도를 도시한다. 도 8은 LOE의 부분 반사 패싯의 평행도를 측정하기 위한 예시적인 프로세스의 흐름도를 도시한다. 도 9는 LOE의 패싯의 굴절률의 균질도를 측정하기 위한 예시적인 프로세스의 흐름도를 도시한다."}
