{"patent_id": "10-2022-0143524", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0062440", "출원번호": "10-2022-0143524", "발명의 명칭": "전자 장치 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "전은상"}}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,통신 인터페이스;인스트럭션들을 저장하는 메모리; 및상기 인스트럭션들을 실행하는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용에 대응하는 정보를 획득하고,상기 증명 비용에 대응하는 정보에 기초하여 획득한 상기 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 상기 트랜잭션에 대응하는정보를 제1 블록체인 네트워크에 기록하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 증명 비용에 대응하는 정보는, 상기 제1 블록체인에서 트랜잭션이 진행된 시간 및 상기 트랜잭션이 진행된시간에서 상기 트랜잭션을 증명하기 위한 증명 비용을 포함하고, 상기 적어도 하나의 프로세서는,제1 주기 간격으로 상기 증명 비용에 대응하는 정보를 획득하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 적어도 하나의 프로세서는,상기 트랜잭션이 진행된 시간 및 상기 트랜잭션이 진행된 시간에서의 상기 증명 비용에 따라 학습된 인공지능모델에 기초하여, 상기 증명 비용의 변화를 획득하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 트랜잭션에 대응하는 정보는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나를 포함하고,상기 적어도 하나의 프로세서는,제2 주기 간격으로 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보를 획득하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 적어도 하나의 프로세서는,상기 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상이면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 전자 장치.공개특허 10-2024-0062440-3-청구항 6 제4항에 있어서,상기 적어도 하나의 프로세서는,상기 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상이고, 상기 획득된 증명 비용의 변화에 기초하여, 상기 증명 비용이 상승할 것으로 판단되면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 적어도 하나의 프로세서는,상기 증명 비용이 하락할 것으로 판단되면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는,상기 트랜잭션에 대응하는 정보를 마지막으로 제1 블록체인 네트워크에 기록한 시점부터 경과된 시간이 기설정된 시간 이상이면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 적어도 하나의 프로세서는,상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록되면, 상기 트랜잭션에 대응하는 정보의 해시(Hash) 값을 생성하고,스마트 컨트랙트(Smart Contract)를 통해 상기 해시 값을 제1 블록체인 네트워크에 기록하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치의 제어 방법에 있어서,제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용에 대응하는 정보를 획득하는 단계;상기 증명 비용에 대응하는 정보에 기초하여 획득한 상기 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 상기 트랜잭션에 대응하는정보를 제1 블록체인 네트워크에 기록하는 단계;를 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 증명 비용에 대응하는 정보는, 상기 제1 블록체인에서 트랜잭션이 진행된 시간 및 상기 트랜잭션이 진행된시간에서 상기 트랜잭션을 증명하기 위한 증명 비용을 포함하고, 상기 기록하는 단계는, 제1 주기 간격으로 상기 증명 비용에 대응하는 정보를 획득하는 전자 장치의 제어 방법."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2024-0062440-4-제11항에 있어서,상기 기록하는 단계는,상기 트랜잭션이 진행된 시간 및 상기 트랜잭션이 진행된 시간에서의 상기 증명 비용에 따라 학습된 인공지능모델에 기초하여, 상기 증명 비용의 변화를 획득하는 단계;를 포함하는 전자 장치의 제어 방법."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 트랜잭션에 대응하는 정보는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나를 포함하고,상기 기록하는 단계는,제2 주기 간격으로 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보를 획득하는 전자 장치의 제어방법."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 기록하는 단계는,상기 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상이면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 전자 장치의 제어 방법."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 기록하는 단계는,상기 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상인지 판단하는 단계; 및상기 획득된 증명 비용의 변화에 기초하여, 상기 증명 비용이 상승할 것으로 판단되면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 단계;를 포함하는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 기록하는 단계는,상기 증명 비용이 하락할 것으로 판단되면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않는 전자 장치."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서,상기 기록하는 단계는,상기 트랜잭션에 대응하는 정보를 마지막으로 제1 블록체인 네트워크에 기록한 시점부터 경과된 시간이 기설정된 시간 이상이면, 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 단계;를 포함하는 전자장치의 제어 방법."}
{"patent_id": "10-2022-0143524", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서,상기 기록하는 단계는,공개특허 10-2024-0062440-5-상기 트랜잭션에 대응하는 정보의 해시(Hash) 값을 생성하는 단계; 및스마트 컨트랙트(Smart Contract)를 통해 상기 해시 값을 제1 블록체인 네트워크에 기록하는 단계;를 포함하는전자 장치의 제어 방법."}
{"patent_id": "10-2022-0143524", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치가 개시된다. 일 실시 예에 따른 전자 장치는, 통신 인터페이스 인스트럭션들을 저장하는 메모리 및 인 스트럭션들을 실행하고, 제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용 에 대응하는 정보를 획득하고, 증명 비용에 대응하는 정보에 기초하여 획득한 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 트랜잭션 에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 적어도 하나의 프로세서를 포함한다."}
{"patent_id": "10-2022-0143524", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시에 따른 실시 예들은, 블록체인을 이용하여 트랜잭션을 수행하는 전자 장치에 관한 것이다. 특히, 사이 드 체인(Sidechain)에서 이루어진 트랜잭션 기록을 메인넷(Mainnet)에 작성하는 경우 트랜잭션을 위한 증명 비 용 외의 수수료 개념으로 추가적인 증명 비용이 발생될 수 있다."}
{"patent_id": "10-2022-0143524", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "블록체인(blockchain)은 데이터를 특정 단위의 블록으로 만들어 유효한 네트워크 상에서 체인 형태로 연결하는 데이터 저장 기술이다. 블록체인 노드(node)는 중앙 서버에 의해 관리되지 않으며, 개별적인 분산 공공 장부를 갖는다. 암호화폐의 거래 내역은 분산 공공 장부에 기재되고, 모든 블록체인 네트워크 상의 노드는 동일한 거래 내역 데이터를 보유할 수 있다. 이에 따라 블록체인 노드에 저장된 데이터에 대한 개별적인 위조 및 변조는 어 렵다. 최근에는 블록체인 기술에 기반하여 다양한 암호화폐(예: 비트코인(bitcoin), 이더리움(ethereum))가 등장하고 있다. 암호화폐를 통해 가상 거래를 수행하는 경우에, 거래 내용이 담긴 신규 블록이 생성될 수 있다. 생성된 블록은 블록체인 네트워크 상에 있는 모든 참여자에게 전송되고, 특정 알고리즘에 기반하여 승인된 블록만이 블 록체인 노드에 저장되어 거래가 완료될 수 있다. 사용자는 가상 거래에서의 자산인 암호화폐를 보호하기 위하여 지갑(wallet)을 보유할 수 있다. 암호화폐 지갑 은 사용자의 키를 저장하고 관리할 수 있다. 가상 거래의 거래 내용에 대한 데이터는 사용자의 키를 이용해 전 자 서명되어 블록체인 노드에 저장될 수 있다. 특히, 블록체인 네트워크에서 거래될 수 있는 초당 거래량이 제한적이라는 점에서, 메인넷(Mainnet)으로서의 블 록체인 네트워크에 대한 사이드 체인(Sidechain)이 이용될 수 있다."}
{"patent_id": "10-2022-0143524", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 전자 장치는, 통신 인터페이스, 인스트럭션들을 저장하는 메모리, 및 상기 인스트 럭션들을 실행하는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 제1 블록체인 네트워 크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용에 대응하는 정보를 획득하고, 상기 증명 비 용에 대응하는 정보에 기초하여 획득한 상기 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션 에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록한다. 본 개시의 일 실시예에 따른 전자 장치의 제어 방법은 제1 블록체인 네트워크에서 진행되는 트랜잭션 (Transaction)을 증명하기 위한 증명 비용에 대응하는 정보를 획득하는 단계 및 상기 증명 비용에 대응하는 정 보에 기초하여 획득한 상기 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워 크에 기록하는 단계를 포함한다. 본 개시의 상술한 목적을 달성하기 위한 일 실시 예에 따르면 전자 장치의 제어 방법을 실행하는 프로그램을 포 함하는 컴퓨터 판독 가능 기록매체에 있어서, 제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용에 대응하는 정보를 획득하는 단계 및 상기 증명 비용에 대응하는 정보에 기초하여 획득 한 상기 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 상기 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 단계를 포함한다."}
{"patent_id": "10-2022-0143524", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도면에 예 시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하려는 것 이 아니며, 본 개시의 실시 예의 다양한 변경(modifications), 균등물(equivalents), 및/또는 대체물 (alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유 사한 참조 부호가 사용될 수 있다. 본 개시를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 덧붙여, 하기 실시 예는 여러 가지 다른 형태로 변형될 수 있으며, 본 개시의 기술적 사상의 범위가 하기 실시 예에 한정되는 것은 아니다. 오히려, 이들 실시 예는 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 개시의 기술적 사상을 완전하게 전달하기 위하여 제공되는 것이다. 본 개시에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 권리범위를 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 개시에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 개시에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직 접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 개시에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 적어도 하나의 소프 트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor) (예: CPU 또는 application processor)를 의미할 수 있다. 실시 예에 있어서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특정 한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하 나의 프로세서로 구현될 수 있다. 한편, 도면에서의 다양한 요소와 영역은 개략적으로 그려진 것이다. 따라서, 본 발명의 기술적 사상은 첨부한 도면에 그려진 상대적인 크기나 간격에 의해 제한되지 않는다. 이하에서는 첨부한 도면을 참고하여 본 개시에 따른 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 도 1은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블록도이다. 도 1을 참조하면, 전자 장치는 통신 인터페이스, 메모리 및 적어도 하나의 프로세서를 포 함할 수 있다. 그러나, 도 1에 도시된 전자 장치의 구성은 일 실시 예에 불과할 뿐, 다른 구성이 추가되거 나 일부 구성이 생략될 수 있음은 물론이다. 본 개시의 일 실시 예에 따른 전자 장치는 TV로 구현될 수 있으나, 이에 한정되는 것은 아니며 비디오 월 (video wall), LFD(large format display), Digital Signage(디지털 간판), DID(Digital Information Display), 프로젝터 디스플레이 등과 같이 디스플레이 기능을 갖춘 디스플레이 장치로 구현될 수도 있음은 물론 이다. 또한, 전자 장치가 디스플레이 장치로 구현되면, 디스플레이 장치는 LCD(liquid crystal display), OLED(organic light-emitting diode), LCoS(Liquid Crystal on Silicon), DLP(Digital Light Processing), QD(quantum dot) 디스플레이 패널, QLED(quantum dot light-emitting diodes) 등과 같은 다양한 형태의 디스플 레이를 포함할 수 있다. 일 실시 예에 따른 전자 장치는 사용자 단말 장치(예를 들어, 스마트폰), 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버(server), PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 가상 현실(virtual reality(VR)) 구현 장치 또는 웨어 러블 장치 중 적어도 하나를 포함할 수 있다. 여기서, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌,발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형 (예: 전자 의복), 신체 부착형(예: 스킨 패드 또는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 일 예로, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박 스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전 자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 일 예로, 전자 장치는 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정 기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따른 통신 인터페이스는 외부 장치와 통신을 수행하여 다양한 유형의 데이터, 정보를 입력받 는다. 예를 들어 통신 인터페이스는 AP 기반의 Wi-Fi(와이파이, Wireless LAN 네트워크), 블루투스 (Bluetooth), 지그비(Zigbee), 유/무선 LAN(Local Area Network), WAN(Wide Area Network), 이더넷 (Ethernet), IEEE 1394, HDMI(High-Definition Multimedia Interface), USB(Universal Serial Bus), MHL(Mobile High-Definition Link), AES/EBU(Audio Engineering Society/ European Broadcasting Union), 옵 티컬(Optical), 코액셜(Coaxial) 등과 같은 통신 방식을 통해 가전 기기(예를 들어, 디스플레이 장치, 에어컨, 공기 청정기 등), 외부 저장 매체(예를 들어, USB 메모리), 외부 서버(예를 들어, 웹 하드) 등으로부터 다양한 유형의 데이터, 정보 등을 입력받을 수 있다. 특히, 일 실시 예에 따른 통신 인터페이스는 적어도 하나의 프로세서의 제어에 따라 블록체인(Block- chain) 네트워크(예를 들어, 비트코인 네트워크, 이더리움 네트워크 등)와 통신을 수행할 수 있다. 여기서, 블록체인 네트워크는, 복수의 노드 및 원장(ledger)을 포함할 수 있다. 일 예로, 블록체인 네트워크에 포함된 복수의 노드 각각은 도 1에 도시된 전자 장치에 대응되며, 복수의 노드 각각은 데이터를 처리하고, 다른 노드와 통신을 수행할 수 있다. 예를 들어, 복수의 노드 각각은 PC(Personal Computer), 서버(Server), 사용자 단말 장치(예를 들어, 모바일 디바이스) 등을 포함할 수 있다. 일 예로, 블록체인 네트워크는 복수의 노드가 P2P(Peer-to-Peer) 방식으로 연결된 네트워크일 수 있다. 일 예로, 블록체인 네트워크에 포함된 복수의 노드 각각은 원장을 저장할 수 있다. 블록체인 네트워크는 탈 중앙화 네트워크로 불릴 수도 있으나, 이하에서는 설명의 편의를 위해 블록체인 네트워크로 통칭하도록 한다. 한편, 블록체인 네트워크에 포함된 복수의 노드는 적어도 하나의 합의 알고리즘(Consensus Algorithm) (예를 들 어, 지분 증명(PoS, proof of stake), 작업 증명(PoW, proof of work), 위임 지분 증명(DPoS, delegated proof of stake) 또는 프랙티컬 비잔틴 장애 허용(PBFT, practical byzantine fault tolerance))을 통해 트랜잭션들 에 대한 트랜잭션 데이터를 포함하는 블록을 생성할 수 있다. 여기에서 합의 알고리즘은 합의 모델, 합의 방식, 합의 메커니즘 또는 합의 프로토콜일 수 있다. 복수의 노드는 블록체인 네트워크에서 이용되는 합의 알고리즘을 위한 연산을 수행할 수 있는 전자 장치일 수 있다. 일 실시 예에서, 블록체인 네트워크에 참여 중인 복수의 노 드 중 일부 노드는 합의 알고리즘에 참여하지 않을 수 있다. 일 실시 예에서, 복수의 노드는 각각의 구성은 전 자 장치의 구성과 동일할 수 있다 여기서, 트랜잭션 데이터는, 외부 장치(예를 들어, 제1 외부 전자 장치, 제2 외부 전자 장치 등), 복수의 노드, 또는 이들의 조합에서 생성된 데이터일 수 있다. 일 예로, 트랜잭션 데이터는, 정상적으로 진행된 트랜잭션의 내용을 원장에 기록하기 위한 데이터이고, 트랜잭 션 데이터는 계정들(예를 들어, 외부 장치, 복수의 노드 또는 이들의 조합) 간의 거래 내역을 나타내는 데이터 를 포함할 수 있다. 여기서, 트랜잭션은, 원장의 내용에 변경시키는 다양한 행위를 포함할 수 있다. 정상적으로 서명이 완료된 트랜 잭션 데이터는 원장에 기록되며, 정상적으로 서명이 완료되지 않은 트랜잭션 데이터는 원장에 기록되지 않을 수있다. 일 예로, 트랜잭션에 의해 트랜잭션 데이터가 블록에 기록되었는지 여부는, 트랜잭션 ID를 통해 추적 가능하며, 트랜잭션 데이터는, 스마트 컨트랙트(Smart contract)를 이용하여 원장에 기록될 수 있다. 일 실시 예에 따라, 블록체인 네트워크에 포함된 복수의 노드는 외부 전자 장치로부터의 요청에 기초하여, 원장 에 포함된 데이터를 외부 전자 장치로 전송할 수 있다. 여기서, 원장은 적어도 하나의 트랜잭션에 대한 트랜잭 션 데이터를 포함하는 블록이 다른 적어도 하나의 트랜잭션에 대한 트랜잭션 데이터를 포함하는 이전 블록을 참 조하는 체인(Chain) 형태의 데이터일 수 있다. 원장의 적어도 일부는 블록체인 네트워크에 포함된 복수의 노드 각각에 저장되어 있을 수 있다. 특히, 블록체인 네트워크를 활용한 서비스를 제공하기 위해 하나의 블록체인 네트워크와 연결된 블록체인 네트 워크가 생성될 수 있다. 여기에서, 하나의 블록체인 네트워크를 메인넷(Mainnet)으로 통칭될 수 있다. 메인넷은, 기존에 존재하는 블록체인 네트워크에 종속되지 않고, 독립적인 네트워크를 구성된 것을 수 있다. 예 를 들어, 메인넷은 비트코인(Bitcoin) 또는 이더리움(Ethereum) 등 독립적인 네트워크를 구성한 블록체인 네트 워크를 포함할 수 있다. 그리고, 메인넷에 연결된 블록체인 네트워크은 사이드체인(Sidechain)일 수 있다. 즉, 사이드체인은 메인넷(또 는 메인체인)의 하위 체인으로, 사이드체인만의 독립된 네트워크를 구성하지 않고 메인넷에 종속된 블록체인 네 트워크일 수 있다. 여기에서 사이드체인은 세컨드 레이어(Second layer) 또는 오프체인(Off-Chain)일 수 있다. 사이드체인은 메인넷이 아닌 외부에서 트랜잭션(Transaction)이 진행되므로, 메인넷에 비해 초당 거래 량(TPS, Transactions per second)이 높고, 거래 수수료가 저렴할 수 있다. 따라서 사이드 체인은 메인넷에 비해 확장성 이 높다는 장점에 의해 다양한 탈중앙화 어플리케이션(DApp, 디앱)이 개발될 수 있다. 다만, 사이드체인에서 진행된 트랜잭션이 기록된 원장의 투명성 내지 공신력을 위해 메인넷의 원장에 이를 기록 될 수 있다. 사이드체인에서 진행된 트랜잭션이 기록된 원장의 내용을 메인넷의 원장에 이를 기록하는 것을 롤 업(Rollup)이라고 통칭할 수 있다. 사이드 체인의 원장 내용을 메인넷의 원장에 기록되는 과정에서, 트랜잭션을 증명하기 위한 증명 비용이 발생할 수 있다. 즉, 복수의 노드에서 합의 알고리즘(예로, 작업 증명(PoW, Proof- of-Work) 알고리즘)을 거쳐 트랜잭션이 진행되었다면, 복수의 노드는 작업 증명 알고리즘을 계산하기 위한 연산 력을 제공하게 된다. 여기에서 작업 증명 알고리즘은 트랜잭션을 증명하기 위한 알고리즘일 수 있다. 따라서, 트랜잭션이 진행되는 과정에서 트랜잭션을 증명하기 위해 연산력을 제공한 복수의 노드에 대해 증명 비 용이 요구될 수 있다. 예컨대, 증명 비용과 관련하여, 비트코인(Bitcoin)에서는 비트코인 트랜잭션 수수료 (Bitcoin Transaction Fees)가 증명 비용이 될 수 있고, 이더리움(Ethereum)에서는 가스 비용(Gas Price)이 증 명 비용이 될 수 있다. 일 실시 예에 따른 메모리는 본 개시의 한 실시 예를 위해 필요한 데이터를 저장할 수 있다. 메모리 는 데이터 저장 용도에 따라 전자 장치에 임베디드된 메모리 형태로 구현되거나, 전자 장치에 탈부착 이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 전자 장치의 구동을 위한 데이터는 전자 장치에 임베디드된 메모리에 저장되고, 전자 장 치의 확장 기능을 위한 데이터는 전자 장치에 탈부착이 가능한 메모리에 저장될 수 있다. 한편, 전자 장치에 임베디드된 메모리의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현될 수 있다. 또 한, 전자 장치에 탈부착이 가능한 메모리의 경우 메모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결가능한 외부 메모리(예를 들어, USB 메모리) 등과 같은 형태로 구 현될 수 있다. 일 예에 따라 메모리는 전자 장치를 제어하기 위한 적어도 하나의 인스트럭션(instruction) 또는 인 스트럭션들을 포함하는 컴퓨터 프로그램을 저장할 수 있다. 특히, 메모리는 블록체인 기능과 관련된 정보 를 저장할 수 있다. 즉, 메모리는 블록체인 기능과 관련된 정보 중 적어도 일부를 보안 영역에 저장할 수 있다. 또한, 블록체인 네트워크의 주소와 관련된 정보(예컨대, 루트 씨드(Root Seed))는 메모리의 보안 영역에 저장될 수 있다. 구체적으로, 메모리는 스마트 컨트랙트를 진행하기 위한 전자 지갑에 관한 정보를 저장할 수 있다. 전자 지갑이 생성되면, 전자 지갑에 대한 공개 키(Public key)와 개인 키(Private key)가 생성 되는데, 메모리는 개인 키를 보안 영역에 저장할 수 있다. 여기에서, 보안 영역은, 물리적 및/또는 논리적 영역으로 구분되어 승인된 프로세스만 접근하도록 설정된 메모리의 일부 영역일 수 있다. 예컨대, 보안 영역은 트러스트존(Trust Zone)을 포함할 수 있다. 또한, 메모리는 메인넷인 블록체인 네트워크의 주소와 사이드 체인인 블록체인 네트워크의 주소를 구별되게 저장할 수 있다. 또한, 적어도 하나의 프로세서가 사이드체인에서 진행된 트랜잭션에 대응하는 정보를 메인넷에 기록하기 위하여, 메모리는 도 2에 도시된 바와 같이 제1 모니터링 모듈, 증명 비용 획득 모듈, 제2 모니 터링 모듈, 트랜잭션 기록 판단 모듈 및 트랜잭션 기록 모듈을 포함할 수 있다. 본 개시의 일 실시 예에 따른 적어도 하나의 프로세서는 전자 장치의 전반적인 동작을 제어한다. 본 개시의 일 실시 예에 따라, 적어도 하나의 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서 (digital signal processor(DSP), 마이크로 프로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서, AI(Artificial Intelligence) 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 적어도 하나 의 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현 될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 적어도 하나의 프로세서 는 메모리에 저장된 컴퓨터 실행가능 명령어(computer executable instructions)를 실행함으로써 다양한 기능을 수행할 수 있다. 적어도 하나의 프로세서는 CPU (Central Processing Unit), GPU (Graphics Processing Unit), APU (Accelerated Processing Unit), MIC (Many Integrated Core), DSP (Digital Signal Processor), NPU (Neural Processing Unit), 하드웨어 가속기 또는 머신 러닝 가속기 중 하나 이상을 포함할 수 있다. 적어도 하나의 프 로세서는 전자 장치의 다른 구성요소 중 하나 또는 임의의 조합을 제어할 수 있으며, 통신에 관한 동작 또 는 데이터 처리를 수행할 수 있다. 적어도 하나의 프로세서는 메모리에 저장된 적어도 하나의 프로그램 또 는 명령어(instruction)을 실행할 수 있다. 예를 들어, 적어도 하나의 프로세서는 메모리에 저장된 적어도 하나의 명령어를 실행함으로써, 본 개시의 일 실시 예에 따른 방법을 수행할 수 있다. 본 개시의 일 실시 예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 하나의 프로세서에 의해 수 행될 수도 있고, 복수의 프로세서에 의해 수행될 수도 있다. 예를 들어, 일 실시 예에 따른 방법에 의해 제 1 동작, 제 2 동작, 제 3 동작이 수행될 때, 제 1 동작, 제 2 동작, 및 제 3 동작 모두 제 1 프로세서에 의해 수 행될 수도 있고, 제 1 동작 및 제 2 동작은 제 1 프로세서(예를 들어, 범용 프로세서)에 의해 수행되고 제 3 동 작은 제 2 프로세서(예를 들어, 인공지능 전용 프로세서)에 의해 수행될 수도 있다. 적어도 하나의 프로세서는 하나의 코어를 포함하는 단일 코어 프로세서(single core processor)로 구현될 수도 있고, 복수의 코어(예를 들어, 동종 멀티 코어 또는 이종 멀티 코어)를 포함하는 적어도 하나의 멀티 코어 프로세서(multicore processor)로 구현될 수도 있다. 적어도 하나의 프로세서가 멀티 코어 프로세서로 구 현되는 경우, 멀티 코어 프로세서에 포함된 복수의 코어 각각은 캐시 메모리, 온 칩(On-chip) 메모리와 같은 프 로세서 내부 메모리를 포함할 수 있으며, 복수의 코어에 의해 공유되는 공통 캐시가 멀티 코어 프로세서에 포함 될 수 있다. 또한, 멀티 코어 프로세서에 포함된 복수의 코어 각각(또는 복수의 코어 중 일부)은 독립적으로 본 개시의 일 실시 예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있고, 복수의 코어 전 체(또는 일부)가 연계되어 본 개시의 일 실시 예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행 할 수도 있다. 본 개시의 일 실시 예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 멀티 코어 프로세서에 포함 된 복수의 코어 중 하나의 코어에 의해 수행될 수도 있고, 복수의 코어에 의해 수행될 수도 있다. 예를 들어, 일 실시 예에 따른 방법에 의해 제 1 동작, 제 2 동작, 및 제 3 동작이 수행될 때, 제 1 동작, 제2 동작, 및 제 3 동작 모두 멀티 코어 프로세서에 포함된 제 1 코어에 의해 수행될 수도 있고, 제 1 동작 및 제 2 동작은 멀티 코어 프로세서에 포함된 제 1 코어에 의해 수행되고 제 3 동작은 멀티 코어 프로세서에 포함된 제 2 코어에 의 해 수행될 수도 있다. 본 개시의 실시 예들에서, 적어도 하나의 프로세서는 적어도 하나의 프로세서 및 기타 전자 부품들이 집적 된 시스템 온 칩(SoC), 단일 코어 프로세서, 멀티 코어 프로세서, 또는 단일 코어 프로세서 또는 멀티 코어 프 로세서에 포함된 코어를 의미할 수 있으며, 여기서 코어는 CPU, GPU, APU, MIC, DSP, NPU, 하드웨어 가속기 또 는 기계 학습 가속기 등으로 구현될 수 있으나, 본 개시의 실시 예들이 이에 한정되는 것은 아니다. 특히, 적어도 하나의 프로세서는 제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용에 대응하는 정보를 획득할 수 있다. 그리고, 적어도 하나의 프로세서는 증명 비용에 대응하는 정보에 기초하여 획득한 증명 비용의 변화 및 제 2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통 해 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다. 한편, 증명 비용에 대응하는 정보는, 제1 블록체인에서 트랜잭션이 진행된 시간 및 트랜잭션이 진행된 시간에서 트랜잭션을 증명하기 위한 증명 비용을 포함할 수 있다. 그리고, 적어도 하나의 프로세서는 제1 주기 간격으로 증명 비용에 대응하는 정보를 획득할 수 있다. 그리고, 적어도 하나의 프로세서는 트랜잭션이 진행된 시간 및 트랜잭션이 진행된 시간에서의 증명 비용에 따라 학습된 인공지능 모델에 기초하여, 증명 비용의 변화를 획득할 수 있다. 한편, 트랜잭션에 대응하는 정보는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토 큰의 수 중 적어도 하나를 포함할 수 있다. 그리고, 적어도 하나의 프로세서는 제2 주기 간격으로 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응 하는 정보를 획득할 수 있다. 한편, 적어도 하나의 프로세서는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상이면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다. 그리고, 적어도 하나의 프로세서는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행 된 토큰의 수 중 적어도 하나가 기설정값 이상이고, 획득된 증명 비용의 변화에 기초하여, 증명 비용이 상승할 것으로 판단되면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다. 한편, 적어도 하나의 프로세서는 증명 비용이 하락할 것으로 판단되면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않을 수 있다. 그리고, 적어도 하나의 프로세서는 트랜잭션에 대응하는 정보를 마지막으로 제1 블록체인 네트워크에 기록 한 시점부터 경과된 시간이 기설정된 시간 이상이면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기 록할 수 있다. 한편, 적어도 하나의 프로세서는 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록되면, 트랜잭 션에 대응하는 정보의 해시(Hash) 값을 생성할 수 있다. 그리고, 적어도 하나의 프로세서는 스마트 컨트랙트(Smart Contract)를 통해 해시 값을 제1 블록체인 네트 워크에 기록할 수 있다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션에 대응하는 정보를 기록하기 위한 구성을 도시한 블 록도이다. 이하, 트랜잭션에 대응하는 정보를 기록하는 과정을 설명하기 위해, 도 3 내지 도 7을 참조하여 설명 하다. 도 2를 참조하면, 전자 장치는 통신 인터페이스를 통해 복수의 노드로 구성된 제1 블록체인 네트워크 및 복수의 노드로 구성된 제2 블록체인 네트워크와 정보를 송수신할 수 있다. 여기에서 제1 블록체인 네 트워크는 메인넷일 수 있고, 제2 블록체인 네트워크는 제1 블록체인 네트워크에 대한 사이드체 인일 수 있다. 예를 들어, 제1 블록체인 네트워크는 비트코인(Bitcoin) 또는 이더리움(Ethereum) 등 독립 적인 네트워크를 구성한 블록체인 네트워크를 포함하는 메인넷일 수 있다. 일 실시예에 따른 제1 모니터링 모듈은 제1 블록체인 네트워크와 관련된 정보를 송수신함으로써 제1 블록체인 네트워크를 모니터링 할 수 있다. 구체적으로, 제1 모니터링 모듈은 제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증 명하기 위한 증명 비용에 대응하는 정보를 획득할 수 있다. 여기에서, 트랜잭션을 증명하기 위한 증명 비용은, 제2 블록체인 네트워크의 원장 내용을 제1 블록체인 네 트워크의 원장에 기록되는 과정에서, 트랜잭션을 증명하기 위한 비용일 수 있다. 여기에서, 제2 블록체인 네트워크의 원장 내용을 제1 블록체인 네트워크의 원장에 기록되는 과정은 제2 블록체인 네트워크 에서 진행된 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하는 과정일 수 있다. 이와 같이 제1 블록체인 네트워크에 트랜잭션에 대응하는 정보를 기록하는 과정 또한 트랜잭션에 의해 발생될 수 있다. 이와 같이 제1 블록체인 네트워크 상에서의 트랜잭션은 합의 알고리즘을 통해 이루어 질 수 있다. 즉, 제1 네트워크를 구성하는 복수의 노드에서 합의 알고리즘(예로, 작업 증명(PoW, Proof-of-Work) 알고리즘) 을 거쳐 트랜잭션이 진행되었다면, 복수의 노드는 작업 증명 알고리즘을 계산하기 위한 연산력을 제공하게 된다. 여기에서 작업 증명 알고리즘은 트랜잭션을 증명하기 위한 알고리즘일 수 있다. 따라서, 트랜잭션이 진행 되는 과정에서 트랜잭션을 증명하기 위해 연산력을 제공한 복수의 노드에 대해 증명 비용이 요구될 수 있다. 이와 같은 증명 비용은 트랜잭션에 따라 변화할 수 있다. 구체적으로, 증명 비용은 블록체인 네트워크의 트래픽 (Traffic), 작업 증명을 수행하는 노드의 수 및 트랜잭션을 위한 작업 증명 알고리즘을 해결하기 위한 난이도 등에 의해 변화할 수 있다. 이와 같은 증명 비용은 시간에 따라 변화하는 것으로 해석될 수 있으므로, 제1 모니터링 모듈은 일정한 시 간 간격으로 제1 블록체인 네트워크에서 진행된 트랜잭션의 증명 비용에 대응하는 정보를 획득할 수 있다. 이하에서 도 3을 참조하여 제1 모니터링 모듈을 설명한다. 도 3은 본 개시의 일 실시 예에 따른 전자 장치의 제1 모니터링 모듈을 설명하기 위한 흐름도이다. 도 3을 참조하면, 증명 비용에 대응하는 정보에는, 제1 블록체인 네트워크에서 트랜잭션이 진행된 시간 및 트랜잭션이 진행된 시간에서 트랜잭션을 증명하기 위한 증명 비용을 포함될 수 있다(S301). 이는, 증명 비용이 시간에 따라 변할 수 있음을 고려하여 증명 비용에 대응하는 정보는 시간 및 증명 비용을 포함할 수 있다는 것 이다. 그리고, 제1 모니터링 모듈은 제1 주기 간격으로 증명 비용에 대응하는 정보를 획득하여, 트랜잭션이 진행 된 시간에 따른 증명 비용을 획득할 수 있다(S302). 일 예로, 제1 모니터링 모듈은 제1 블록체인 네트워크 에서 진행된 트랜잭션에 대하여, 제1 블록체인 네트워크의 원장에 기록된 트랜잭션 기록을 참조하여 해당 트랜잭션이 진행된 시간 및 트랜잭션의 증명 비용 정보를 획득할 수 있다. 이와 같이 제1 모니터링 모듈 은 증명 비용에 대응하는 정보를 제1 주기 간격으로 획득하여, 시간에 따라 변화하는 증명 비용을 메모리 에 저장할 수 있다. 이와 같이 저장된 증명 비용에 대응하는 정보는, 증명 비용 획득 모듈에 의해 증명 비 용의 변화를 획득하는데 이용될 수 있다. 증명 비용 획득 모듈은 증명 비용에 대응하는 정보에 기초하여 증명 비용의 변화를 획득할 수 있다. 이하 에서는 도 4를 참조하여 증명 비용 획득 모듈을 설명한다. 도 4는 본 개시의 일 실시 예에 따른 전자 장치의 전자 장치의 비용 획득 모듈을 설명하기 위한 흐름도이다. 도 4를 참조하면, 증명 비용 획득 모듈은 트랜잭션이 진행된 시간 및 트랜잭션이 진행된 시간에서의 증명 비용에 기초하여, 증명 비용의 변화를 획득할 수 있는 인공지능 모델을 학습할 수 있다(S401). 증명 비용 획득 모듈은 시간에 따라 변화하는 정보에 대한 인공지능 학습 모델(예를 들어, 선형 회귀(Linear Regression), 랜덤 포레스트(Random Forest), XG Boost, GARCH(Generalized Autoregressive Conditional Heteroskedasticity), LSTM(Long Short-Term Memory))을 이용하여 증명 비용의 변화를 학습할 수 있다. 즉, 증 명 비용 획득 모듈은 현재까지 획득한 모든 증명 비용에 관한 정보에 기초하여 향후의 증명 비용이 상승할 것인지 여부 또는 하락할 것인지 여부에 대해 학습할 수 있다. 그리고, 증명 비용 획득 모듈은 학습된 인공지능 모델에 기초하여, 증명 비용의 변화를 획득할 수 있다 (S402). 획득된 증명 비용에 관한 정보에 기초해 인공지능 모델이 학습되었다면, 증명 비용 획득 모듈에서 향후의 증명 비용이 상승할 것이지 여부 또는 하락할 것인지 여부에 대해 획득할 수 있다. 예컨대, 증명 비용 획득 모듈은 학습된 인공지능 모델에 기초하여, 증명 비용에 대한 확률을 획득할 수 있 다. 이와 같이 획득된 확률 중, 증명 비용 획득 모듈은 가장 높은 확률에 해당하는 증명 비용에 기초하여증명 비용의 변화를 획득할 수 있다. 또는, 증명 비용 획득 모듈은 증명 비용 획득 모듈은 증명 비용이 지속적으로 하락 중이고, 학습된 증명 비용의 변화 추세에 기초하여 향후 지속적인 증명 비용의 하락을 획득할 수 있다. 그리고, 증명 비용 획득 모듈은 증명 비용이 지속적으로 하락 중이지만, 학습된 증명 비용의 변화 추세에 기초하여 향후 증명 비용 의 상승을 획득할 수 있다. 그리고, 증명 비용 획득 모듈은 증명 비용이 지속적으로 상승 중이고, 학습된 증명 비용의 변화 추세에 기초하여 향후 지속적인 증명 비용의 상승을 획득할 수 있다. 그리고, 증명 비용 획득 모듈은 증명 비용이 지속적으로 상승 중이지만, 학습된 증명 비용의 변화 추세에 기초하여 향후 지속적인 증명 비용의 하락을 획득할 수 있다. 이와 같이, 인공지능 모델을 통해 증명 비용이 획득될 수 있고, 또는 증명 비용 획득 모듈은 대수적 모델 을 이용하여 증명 비용이 획득될 수 있다. 여기에서 대수적 모델은 시간에 따른 증명 비용의 그래프에서 기울기 를 이용한 것일 수 있다. 구체적으로, t-2 시점의 증명 비용의 그래프 기울기가 음수이고, t-1 시점의 증명 비용의 그래프 기울기가 0이 고, t 시점의 증명 비용의 그래프 기울기가 음수 경우, 증명 비용 획득 모듈은 증명 비용이 지속적으로 하 락 중이었고, 증명 비용이 향후 지속적으로 하락할 것으로 획득할 수 있다. 그리고, t-2 시점의 증명 비용의 그 래프 기울기가 음수이고, t-1 시점의 증명 비용의 그래프 기울기가 0이고, t 시점의 증명 비용의 그래프 기울기 가 양수 경우, 증명 비용 획득 모듈은 증명 비용이 지속적으로 하락 중이었으나, 증명 비용이 향후 상승할 것으로 획득할 수 있다. 그리고, t-2 시점의 증명 비용의 그래프 기울기가 양수이고, t-1 시점의 증명 비용의 그래프 기울기가 0이고, t 시점의 증명 비용의 그래프 기울기가 양수 경우, 증명 비용 획득 모듈은 증명 비용이 지속적으로 상승 중이었고, 증명 비용이 향후 지속적으로 상승할 것으로 획득할 수 있다. 그리고, t-2 시점의 증명 비용의 그래프 기울기가 양수이고, t-1 시점의 증명 비용의 그래프 기울기가 0이고, t 시점의 증명 비용의 그래프 기울기가 음수 경우, 증명 비용 획득 모듈은 증명 비용이 지속적으로 상승 중이었으나, 증 명 비용이 향후 하락할 것으로 획득할 수 있다. 이와 같이 획득된 증명 비용은 트랜잭션 기록 판단 모듈에서 이용될 수 있다. 한편, 전자 장치는 통신 인터페이스를 통해 복수의 노드로 구성된 제2 블록체인 네트워크와 정 보를 송수신할 수 있다. 일 실시예에 따른 제2 모니터링 모듈은 제2 블록체인 네트워크와 관련된 정보를 송수신 함으로써 제2 블록체인 네트워크를 모니터링 할 수 있다. 구체적으로, 제2 모니터링 모듈은 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보를 획 득할 수 있다. 이하에서는, 도 5를 참조하여 제2 모니터링 모듈을 설명한다. 도 5는 본 개시의 일 실시 예에 따른 전자 장치의 제2 모니터링 모듈을 설명하기 위한 흐름도이다. 도 5를 참조하면, 트랜잭션에 대응하는 정보는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나를 포함할 수 있다(S501). 상술한 바와 같이, 제2 블록체인 네트워크 는 제1 블록체인 네트워크에 연결된 사이드체인일 수 있다. 이와 같이 제2 블록체인 네트워크에 서 생성된 블록의 수, 진행된 트랜잭션의 수 및 발행된 토큰의 수는 제1 블록체인 네트워크와 별개로 제2 블록체인 네트워크의 원장에 기록될 수 있다. 그리고 제2 모니터링 모듈은 제2 주기 간격으로 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응 하는 정보를 획득할 수 있다(S502). 즉, 제2 모니터링 모듈은 제2 블록체인 네트워크에서 생성된 블 록의 수, 진행된 트랜잭션의 수 및 발행된 토큰의 수를 획득할 수 있다. 이와 같이 획득된 제2 블록체인 네트워 크에서 생성된 블록의 수, 진행된 트랜잭션의 수 및 발행된 토큰의 수에 기초하여 제2 블록체인 네트워크 에서 기록된 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것인지 판단될 수 있다. 이와 같이, 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할지 여부를 판단하는 과정에 대하여 이하, 도 6을 참조하여 설명한다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션 기록 판단 모듈을 설명하기 위한 흐름도이다. 도 6을 참조하면, 트랜잭션 기록 판단 모듈은 제2 블록체인 네트워크의 트랜잭션에 대응하는 정보를 마지막으로 제1 블록체인 네트워크에 기록한 시점부터 경과된 시간을 획득할 수 있다(S601). 즉, 트랜잭션기록 판단 모듈은 트랜잭션 기록 모듈에 의해 마지막으로 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록한 시점부터 경과된 시간을 획득할 수 있다. 그리고, 트랜잭션 기록 판단 모듈은 경과된 시간이 기설정된 시간 이상인지 판단할 수 있다(S602). 여기에서, 트랜잭션 기록 판단 모듈은 경과된 시간이 기설정된 시간 이상인 경우, 트랜잭션에 대응하는 정 보를 제1 블록체인 네트워크에 기록할 것으로 판단할 수 있다(S605). 시간을 기준으로 트랜잭션에 대응하 는 정보를 제1 블록체인 네트워크에 기록할 수 있다는 것은, 제2 블록체인 네트워크의 투명성 내지 공신력을 입증하기 위한 것으로, 장시간 제2 블록체인 네트워크의 트랜잭션에 대응하는 정보가 제1 블록체 인 네트워크에 기록되지 않는 경우를 방지하기 위한 것이다. 이와 같이, 경과 시간이 기설정된 시간 이상이 아닌 경우에도 일정한 조건이 성취되면, 트랜잭션에 대응하는 정 보를 제1 블록체인 네트워크에 기록할 것으로 판단할 수 있다. 트랜잭션 기록 판단 모듈은 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상인지 여부를 판단할 수 있다(S603). 여기에서, 제2 블록체인 네트워 크에서 생성된 블록의 수, 발행된 토큰의 수는 모두 제2 블록체인 네트워크에서의 트랜잭션의 수와 관련된 것일 수 있다. 그리고, 트랜잭션 기록 판단 모듈은 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적어도 하나가 기설정값 이상이면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크 에 기록할 것으로 판단할 수 있다(S605). 즉, 제2 블록체인 네트워크에서의 트랜잭션이 상당히 진행 된 경우, 제2 블록체인 네트워크의 공신력 내지 신뢰도를 위해, 트랜잭션 기록 판단 모듈은 제2 블록 체인 네트워크의 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단할 수 있 다. 그리고, 트랜잭션 기록 판단 모듈은 증명 비용의 변화를 더 고려하여 제2 블록체인 네트워크의 트랜 잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것인지 여부를 판단할 수 있다. 즉, 트랜잭션 기 록 판단 모듈은 증명 비용 획득 모듈에 의해 획득된 증명 비용의 변화에 기초하여, 증명 비용의 상승 할 것으로 판단되면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단할 수 있다. 예를 들어, 증명 비용 획득 모듈에 의해 증명 가격이 지속적으로 하락 중이지만, 향후 증명 비용의 상승이 획득된 경우, 트랜잭션 기록 판단 모듈은 단기적으로 현재 증명 비용이 가장 낮은 비용으로 판단하여 트랜 잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단할 수 있다. 그리고, 증명 비용 획득 모듈에 의해 증명 가격이 지속적으로 상승 중이고, 향후 증명 비용의 상승이 획득 된 경우, 트랜잭션 기록 판단 모듈은 단기적으로 현재 증명 비용이 가장 낮은 비용으로 판단하여 트랜잭션 에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단할 수 있다. 반면, 트랜잭션 기록 판단 모듈은 증명 비용이 하락할 것으로 판단되면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않는 것으로 판단할 수 있다. 즉, 더 낮은 증명 비용이 발생되는 시점에 트 랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하기 위하여, 트랜잭션 기록 판단 모듈은 트 랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않는다고 판단할 수 있다. 예를 들어, 증명 비용 획득 모듈에 의해 증명 가격이 지속적으로 상승 중이지만, 향후 증명 비용의 하락이 획득된 경우, 트랜잭션 기록 판단 모듈은 단기적으로 현재 증명 비용이 가장 높은 비용으로 판단하여 트랜 잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않을 것으로 판단할 수 있다. 그리고, 증명 비용 획득 모듈에 의해 증명 가격이 지속적으로 하락 중이고, 향후 증명 비용의 하락이 획득 된 경우, 트랜잭션 기록 판단 모듈은 단기적으로 현재 증명 비용이 가장 높은 비용으로 판단하여 트랜잭션 에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않을 것으로 판단할 수 있다. 이와 같이, 트랜잭션 기록 판단 모듈에 의해 트랜잭션에 대응하는 정보를 제1 블록 체인 네트워크에 기록 할 것으로 판단되면, 트랜잭션 기록 모듈에 의해 트랜잭션에 대응하는 정보를 제1 블록 체인 네트워크에 기록할 수 있다. 구체적으로, 트랜잭션 기록 모듈은 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단되면, 스마트 컨트랙트(Smart Contract)를 통해 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크 에 기록할 수 있다. 여기에서, 스마트 컨트랙트는 계약 상의 급부와 반대 급부를 프로토콜화하여(또는, 프 로그래밍하여) 급부가 충족되면, 자동으로 반대 급부를 실행하는 시스템을 의미할 수 있다. 여기서, 급부와 반 대급부는 계약이 성립하기 위한 필수조건을 포함할 수 있다. 이하에서는, 도 7을 참조하여 트랜잭션 기록 모듈 을 설명한다. 도 7은 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션 기록 모듈을 설명하기 위한 흐름도이다. 도 7을 참조하면, 트랜잭션 기록 모듈은 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록 할 것으로 판단되면, 트랜잭션에 대응하는 정보의 해시(Hash) 값을 생성할 수 있다(S701). 여기에서, 해시 값은, 다양한 길이의 데이터를 고정된 길이를 가진 데이터로 매핑(mapping)한 값이다. 즉, 해시 값을 이용하여 특정한 데이터에 접근할 수 있다. 일 실시예에 따른 트랜잭션에 대응하는 정보는 생성된 블록의 수, 진행된 트랜잭션의 수 및 발행된 토큰의 수가 될 수 있다. 즉, 트랜잭션 기록 모듈은 생성된 블록의 수, 진행된 트랜잭션의 수 및 방행된 토큰의 수에 대한 해시 값을 생성할 수 있다. 다른 실시 예에 따른 트랜잭션이 진행된 시간 및 트랜잭션 내용을 포함할 수 있다. 예를 들어, 2024년 12월 25 일 오후 8시17분에 3 이더(Ether)가 전송되는 트랜잭션이 진행되었다면, 트랜잭션 기록 모듈은 트랜잭션이 진행된 시간에 해당하는 2024년 12월 25일 오후 8시17분 및 전송된 이더의 수 3에 대한 해시 값을 생성할 수 있 다. 그리고 트랜잭션 기록 모듈은 스마트 컨트랙트(Smart Contract)를 통해 해시 값을 제1 블록체인 네트워크 에 기록할 수 있다(S702). 여기에서, 해시 값을 제1 블록체인 네트워크에 기록할 수 있다는 것은, 제 1 블록체인 네트워크의 원장에 기록할 수 있다는 것일 수 있다. 즉, 트랜잭션 기록 모듈은 해시 값을 스마트 컨트랙트를 통해 제1 블록체인 네트워크의 원장에 기록할 수 있다. 여기에서, 스마트 컨트랙트는 적어도 하나의 트랜잭션을 포함하므로, 해시 값을 제1 블록체인 네트워크에 기록하기 위해 증명 비용이 요구될 수 있다. 이 때, 트랜잭션 기록 판단 모듈은 증명 비용 획득 모듈(22 0)에 의해 획득된 증명 비용의 변화를 고려하여 단기적으로 낮은 증명 비용에 해당될 때 제1 블록체인 네트워크 에 기록할 것으로 판단하였으므로, 트랜잭션 기록 모듈은 단기적으로 낮은 증명 비용을 지불하고 트 랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다. 따라서, 제2 블록체인 네트워크에 기초한 서비스를 구성할 때, 제1 블록체인 네트워크에 서비스와 관 련하여 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기 록할 때, 낮은 증명 비용을 지불할 수 있어, 제2 블록체인 네트워크에 기초한 서비스를 운용함에 있어 비 용을 절감시킬 수 잇고, 증명 비용의 변동에 따른 리스크를 감소시킬 수 있다. 도 8를 참조하면, 전자 장치은 통신 인터페이스, 메모리, 적어도 하나의 프로세서, 디스플 레이, 적어도 하나의 센서, 입력 인터페이스, 스피커 가 포함될 수 있다. 이하에서는 도 2 에서의 설명과 중복되는 부분에 대한 자세한 설명은 생략하기로 한다. 디스플레이는 LCD(Liquid Crystal Display) 패널, OLED(Organic Light Emitting Diodes) 패널, AM- OLED(Active-Matrix Organic Light-Emitting Diode), LcoS(Liquid Crystal on Silicon), QLED(Quantum dot Light-Emitting Diode) 및 DLP(Digital Light Processing), PDP(Plasma Display Panel) 패널, 무기 LED 패널, 마이크로 LED 패널 등 다양한 종류의 디스플레이 패널을 포함할 수 있으나, 이에 한정되는 것은 아니다. 한편, 디스플레이는 터치 패널과 함께 터치스크린을 구성할 수도 있으며, 플렉서블(flexible) 패널로 이루어질 수도 있다. 구체적으로, 디스플레이는 사용자와 관련된 이벤트와 대응되는 복수의 데이터, 복수의 키워드 및 적어도 하나의 문장을 표시할 수 있다. 특히, 디스플레이는 제1 블록체인 네트워크에서 진행되는 트랜잭션을 증명하기 위한 증명 비용의 변화를 획득한 결과를 표시할 수 있다. 또한, 디스플레이는 제2 블 록체인 네트워크의 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록한 결과를 표시할 수 있다. 적어도 하나의 센서은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용 자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 입력 인터페이스는 회로를 포함하며, 전자 장치에서 지원하는 각종 기능을 설정 또는 선택하기 위한 사용자 명령을 입력받을 수 있다. 이를 위해, 입력 인터페이스는 복수의 버튼을 포함할 수 있고, 디스플레 이의 기능을 동시에 수행할 수 있는 터치 스크린으로 구현될 수도 있다. 이 경우, 적어도 하나의 프로세서(13 0)는 입력 인터페이스를 통해 입력된 사용자 명령에 기초하여 전자 장치의 동작을 제어할 수 있다. 예를 들어, 적어도 하나의 프로세서는 입력 인터페이스를 통해 입력된 전자 장치의 온/오프 명 령, 전자 장치의 기능의 온/오프 명령 등에 기초하여, 전자 장치를 제어할 수 있다. 스피커는 오디오를 출력할 수 있다. 구체적으로, 적어도 하나의 프로세서는 전자 장치 의 동작 과 관련된 다양한 알림음 또는 음성 안내 메시지를 스피커를 통해 출력할 수 있다. 특히, 적어도 하나의 프로세서는 제2 블록체인 네트워크의 트랜잭션에 대응하는 기록을 제1 블록체인 네트워크에 기 록할 경우, 이에 대한 알림을 스피커를 통해 출력할 수 있다. 도 9는 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 9를 참조하면, 제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용 에 대응하는 정보를 획득할 수 있다(S901). 그리고, 증명 비용에 대응하는 정보에 기초하여 획득한 증명 비용의 변화 및 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보에 기초하여, 스마트 컨트랙트(Smart Contract)를 통해 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다(S902). 한편, 증명 비용에 대응하는 정보는, 제1 블록체인에서 트랜잭션이 진행된 시간 및 트랜잭션이 진행된 시간에서 트랜잭션을 증명하기 위한 증명 비용을 포함할 수 있다. S901 단계는 제1 블록체인 네트워크에서 진행되는 트랜잭션(Transaction)을 증명하기 위한 증명 비용에 대 응하는 정보를 획득하는 단계는, 제1 주기 간격으로 증명 비용에 대응하는 정보를 획득할 수 있다. S902 단계는 트랜잭션이 진행된 시간 및 트랜잭션이 진행된 시간에서의 증명 비용에 따라 학습된 인공지능 모델 에 기초하여, 증명 비용의 변화를 획득할 수 있다. 한편, 트랜잭션에 대응하는 정보는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행 된 토큰의 수 중 적어도 하나를 포함할 수 있다. 그리고, S902 단계는 제2 주기 간격으로 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보를 획득할 수 있다. 그리고, S902 단계는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적 어도 하나가 기설정값 이상이면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다. 그리고, S902 단계는 제2 블록체인 네트워크에서 생성된 블록의 수, 트랜잭션의 수 및 발행된 토큰의 수 중 적 어도 하나가 기설정값 이상인지 판단할 수 있다. 그리고, 획득된 증명 비용의 변화에 기초하여, 증명 비용이 상승할 것으로 판단되면, 트랜잭션에 대응하는 정보 를 제1 블록체인 네트워크에 기록할 수 있다. 한편, 증명 비용이 하락할 것으로 판단되면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록하지 않 을 수 있다. 그리고, S902 단계는 트랜잭션에 대응하는 정보를 마지막으로 제1 블록체인 네트워크에 기록한 시점부터 경과된 시간이 기설정된 시간 이상이면, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다. 한편, S902 단계는 트랜잭션에 대응하는 정보의 해시(Hash) 값을 생성할 수 있다. 그리고, 스마트 컨트랙트(Smart Contract)를 통해 해시 값을 제1 블록체인 네트워크에 기록할 수 있다. 도 10은 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션에 대응하는 정보를 기록하기 위한 과정을 설명하기 위한 시퀀스도이다. 도 10을 참조하면, 전자 장치는 제1 블록체인 네트워크에 트랜잭션을 증명하기 위한 증명 비용에 대 응하는 정보 요청할 수 있다(S1001) 그리고 제1 블록체인 네트워크는 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 전송할 수 있다 (S1002).그리고, 전자 장치는 제1 블록체인 네트워크에서 진행되는 트랜잭션을 증명하기 위한 증명 비용에 대응하 는 정보를 획득할 수 있다(S1003). 다음으로, 전자 장치는 증명 비용에 대응하는 정보에 기초하여 증명 비용의 변화를 획득할 수 있다 (S1004). 그리고, 전자 장치는 제2 블록체인 네트워크에 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하 는 정보 요청할 수 있다(S1005). 그리고, 제2 블록체인 네트워크는 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 전송할 수 있다(S1006). 이후, 전자 장치는 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 획득할 수 있다(S1007). 그리고, 전자 장치는 획득된 증명 비용의 변화 및 트랜잭션에 대응하는 정보에 기초하여, 트랜잭션에 대응 하는 정보를 제1 블록체인 네트워크에 기록할지 여부를 판단할 수 있다(S1008). 그리고, 전자 장치는 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단되면, 스마 트 컨트랙트(Smart Contract)를 통해 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다 (S1009) 도 11은 본 개시의 일 실시 예에 따른 서버의 트랜잭션에 대응하는 정보를 기록하기 위한 과정을 설명하기 위한 시퀀스도이다. 도 11을 참조하면, 서버는 제1 블록체인 네트워크에 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 요청할 수 있다(S1101) 그리고 제1 블록체인 네트워크는 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 전송할 수 있다 (S1102). 그리고, 서버는 제1 블록체인 네트워크에서 진행되는 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 를 획득할 수 있다(S1103). 그리고, 서버에서 외부 전자 장치로 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 전송할 수 있다(S1104). 여기에서 외부 전자 장치는 서버에서 처리하는 정보를 수신하여 출력만 수행하는 구성일 수 있다. 다음으로, 서버는 증명 비용에 대응하는 정보에 기초하여 증명 비용의 변화를 획득할 수 있다(S1105). 그리고, 서버는 제2 블록체인 네트워크에 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정 보 요청할 수 있다(S1106). 그리고, 제2 블록체인 네트워크는 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 전송할 수 있다(S1107). 이후, 서버는 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 획득할 수 있다(S1108). 이 때, 서버는 외부 전자 장치에 트랜잭션에 대응하는 정보 전송할 수 있다(S1109). 그리고, 서버는 획득된 증명 비용의 변화 및 트랜잭션에 대응하는 정보에 기초하여, 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할지 여부를 판단할 수 있다(S1110). 그리고, 서버는 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단되면, 스마트 컨 트랙트(Smart Contract)를 통해 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다(S1111) 그리고, 서버는 외부 전자 장치에 제1 블록체인 네트워크에 기록된 정보를 정보할 수 있다(S1112). 도 12는 본 개시의 일 실시 예에 따른 전자 장치 및 서버의 트랜잭션에 대응하는 정보를 기록하기 위한 과정을 설명하기 위한 시퀀스도이다. 도 12를 참조하면, 전자 장치는 제1 블록체인 네트워크에 트랜잭션을 증명하기 위한 증명 비용에 대 응하는 정보 요청할 수 있다(S1201)그리고 제1 블록체인 네트워크는 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 전송할 수 있다 (S1202). 그리고, 전자 장치는 제1 블록체인 네트워크에서 진행되는 트랜잭션을 증명하기 위한 증명 비용에 대 응하는 정보를 획득할 수 있다(S1203). 그리고, 전자 장치에서 서버로 트랜잭션을 증명하기 위한 증명 비용에 대응하는 정보 전송할 수 있다 (S1204). 여기에서 서버는 전자 장치에서 증명 비용에 대응하는 정보를 수신하여 증명 비용의 변화를 획득할 수 있는 인공지능 모델을 학습하고, 증명 비용의 변화를 획득할 수 있다. 다음으로, 서버는 증명 비용에 대응하는 정보에 기초하여 증명 비용의 변화를 획득할 수 있는 인공지능 모 델 학습할 수 있다(S1205). 그리고, 전자 장치는 제2 블록체인 네트워크에 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하 는 정보 요청할 수 있다(S1206). 그리고, 제2 블록체인 네트워크는 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 전송할 수 있다(S1207). 이와 같이, 전자 장치는 제2 블록체인 네트워크에서 진행된 트랜잭션에 대응하는 정보 획득할 수 있다 (S1208). 이 때, 서버는 학습된 인공지능 모델에 기초하여, 증명 비용의 변화를 획득할 수 있다(S1209). 그리고, 서버는 획득된 증명 비용의 변화를 전자 장치에 전송할 수 있다(S1210). 그리고, 전자 장치는 획득된 증명 비용의 변화 및 트랜잭션에 대응하는 정보에 기초하여, 트랜잭션에 대응 하는 정보를 제1 블록체인 네트워크에 기록할지 여부를 판단할 수 있다(S1211). 그리고, 전자 장치는 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 것으로 판단되면, 스마 트 컨트랙트(Smart Contract)를 통해 트랜잭션에 대응하는 정보를 제1 블록체인 네트워크에 기록할 수 있다 (S1212) 본 개시에 따른 인공지능과 관련된 기능은 전자 장치의 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU(Central Processing Unit), GPU(Graphic Processing Unit), NPU(Neural Processing Unit) 중 적어도 하나를 포함할 수 있으나 전술한 프로세서의 예시에 한정되지 않는다. CPU는 일반 연산뿐만 아니라 인공지능 연산을 수행할 수 있는 범용 프로세서로서, 다계층 캐시(Cache) 구조를 통해 복잡한 프로그램을 효율적으로 실행할 수 있다. CPU는 순차적인 계산을 통해 이전 계산 결과와 다음 계산 결과의 유기적인 연계가 가능하도록 하는 직렬 처리 방식에 유리하다. 범용 프로세서는 전술한 CPU로 명시한 경 우를 제외하고 전술한 예에 한정되지 않는다. GPU는 그래픽 처리에 이용되는 부동 소수점 연산 등과 같은 대량 연산을 위한 프로세서로서, 코어를 대량으로 집적하여 대규모 연산을 병렬로 수행할 수 있다. 특히, GPU는 CPU에 비해 컨볼루션(Convolution) 연산 등과 같 은 병렬 처리 방식에 유리할 수 있다. 또한, GPU는 CPU의 기능을 보완하기 위한 보조 프로세서(co-processor)로 이용될 수 있다. 대량 연산을 위한 프로세서는 전술한 GPU로 명시한 경우를 제외하고 전술한 예에 한정되지 않 는다. NPU는 인공 신경망을 이용한 인공지능 연산에 특화된 프로세서로서, 인공 신경망을 구성하는 각 레이어를 하드 웨어(예로, 실리콘)로 구현할 수 있다. 이때, NPU는 업체의 요구 사양에 따라 특화되어 설계되므로, CPU나 GPU 에 비해 자유도가 낮으나, 업체가 요구하기 위한 인공지능 연산을 효율적으로 처리할 수 있다. 한편, 인공지능 연산에 특화된 프로세서로, NPU 는 TPU(Tensor Processing Unit), IPU(Intelligence Processing Unit), VPU(Vision processing unit) 등과 같은 다양한 형태로 구현 될 수 있다. 인공 지능 프로세서는 전술한 NPU로 명시한 경우를 제외하고 전술한 예에 한정되지 않는다. 또한, 하나 또는 복수의 프로세서는 SoC(System on Chip)으로 구현될 수 있다. 이때, SoC에는 하나 또는 복수 의 프로세서 이외에 메모리, 및 프로세서와 메모리 사이의 데이터 통신을 위한 버스(Bus)등과 같은 네트워크 인 터페이스를 더 포함할 수 있다. 전자 장치에 포함된 SoC(System on Chip)에 복수의 프로세서가 포함된 경우, 전자 장치는 복수의 프로세서 중 일부 프로세서를 이용하여 인공지능과 관련된 연산(예를 들어, 인공지능 모델의 학습(learning)이나 추론 (inference)에 관련된 연산)을 수행할 수 있다. 예를 들어, 전자 장치는 복수의 프로세서 중 컨볼루션 연산, 행 렬 곱 연산 등과 같은 인공지능 연산에 특화된 GPU, NPU, VPU, TPU, 하드웨어 가속기 중 적어도 하나를 이용하 여 인공지능과 관련된 연산을 수행할 수 있다. 다만, 이는 일 실시예에 불과할 뿐, CPU 등과 범용 프로세서를 이용하여 인공지능과 관련된 연산을 처리할 수 있음은 물론이다. 또한, 전자 장치는 하나의 프로세서에 포함된 멀티 코어(예를 들어, 듀얼 코어, 쿼드 코어 등)를 이용하여 인공 지능과 관련된 기능에 대한 연산을 수행할 수 있다. 특히, 전자 장치는 프로세서에 포함된 멀티 코어를 이용하 여 병렬적으로 컨볼루션 연산, 행렬 곱 연산 등과 같은 인공 지능 연산을 수행할 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기정의된 동작 규칙 또는 인공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 기정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만들어진다는 것은, 다수의 학습 데이터들에 학습 알고리즘을 적용함으로써, 원하는 특성 의 기정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버/시스템을 통해 이루어 질 수도 있다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 적어도 하나의 레이어는 적어도 하나의 가중치 (weight values)dd을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 적어도 하나의 정의된 연산을 통해 레 이어의 연산을 수행한다. 신경망의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네트워크 (Deep Q-Networks), Transformer가 있으며, 본 개시에서의 신경망은 명시한 경우를 제외하고 전술한 예에 한정되지 않는다. 학습 알고리즘은, 다수의 학습 데이터들을 이용하여 소정의 대상 기기(예컨대, 로봇)을 훈련시켜 소정의 대상 기기 스스로 결정을 내리거나 획득을 할 수 있도록 하는 방법이다. 학습 알고리즘의 예로는, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)이 있으며, 본 개시에서의 학습 알고리즘은 명시한 경우를 제외하고 전술 한 예에 한정되지 않는다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기 기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시 예들에 따른 기기를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프 리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non- transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구 적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두개의 사용자 장치 들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스 토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시 적으로 생성될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2022-0143524", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다.부호의 설명 110 : 통신 인터페이스 120 : 메모리 130 : 프로세서"}
{"patent_id": "10-2022-0143524", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 전자 장치의 구성을 나타내는 블록도이다. 도 2는 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션에 대응하는 정보를 기록하기 위한 구성을 도시한 블 록도이다. 도 3은 본 개시의 일 실시 예에 따른 전자 장치의 제1 모니터링 모듈을 설명하기 위한 흐름도이다. 도 4는 본 개시의 일 실시 예에 따른 전자 장치의 전자 장치의 증명 비용 획득 모듈을 설명하기 위한 흐름도이 다. 도 5는 본 개시의 일 실시 예에 따른 전자 장치의 제2 모니터링 모듈을 설명하기 위한 흐름도이다. 도 6은 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션 기록 판단 모듈을 설명하기 위한 흐름도이다. 도 7은 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션 기록 모듈을 설명하기 위한 흐름도이다. 도 8은 본 개시의 일 실시 예에 따른 전자 장치의 세부 구성을 나타내는 블록도이다. 도 9는 본 개시의 일 실시 예에 따른 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 10은 본 개시의 일 실시 예에 따른 전자 장치의 트랜잭션에 대응하는 정보를 기록하기 위한 과정을 설명하기 위한 시퀀스도이다. 도 11은 본 개시의 일 실시 예에 따른 서버의 트랜잭션에 대응하는 정보를 기록하기 위한 과정을 설명하기 위한 시퀀스도이다. 도 12는 본 개시의 일 실시 예에 따른 전자 장치 및 서버의 트랜잭션에 대응하는 정보를 기록하기 위한 과정을 설명하기 위한 시퀀스도이다."}
