{"patent_id": "10-2022-0191037", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0107940", "출원번호": "10-2022-0191037", "발명의 명칭": "차량용 안테나를 제어하는 차량용 전자 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "설동범"}}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량용 안테나를 제어하는 차량용 전자 장치(300)에 있어서,복수의 안테나들을 포함하는 통신 모듈(320);적어도 하나의 인스트럭션을 저장하는 메모리(310); 및 상기 메모리(310)에 저장된 상기 적어도 하나의 인스트럭션을 실행하는 적어도 하나의 프로세서(330)를 포함하고,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,차량 내부에 대한 제1 이미지를 획득하고,상기 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하고,상기 적어도 하나의 탑승자와 상기 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중인 제1 안테나 사이의 거리를 획득하고,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 상기 제1안테나를 사용하지 않고 상기 복수의 안테나들 중 제2 안테나를 통하여 상기 외부 장치와의 통신을 수행하도록,상기 통신 모듈(320)을 제어하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 이미지는 상기 적어도 하나의 탑승자의 깊이 정보를 포함하는 이미지인, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,객체를 탐지하는 인공지능 모델을 이용하여 상기 제1 이미지에 포함된 상기 적어도 하나의 탑승자를 인식하는,차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 제1 이미지와 다른 방향으로 상기 차량 내부를 촬영한 제2 이미지를 획득하고,상기 제1 이미지 및 상기 제2 이미지에 기초하여, 상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리를획득하는, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기복수의 안테나들 중 상기 제1 안테나를 제외한 나머지 안테나들의 수신 감도를 획득하고,공개특허 10-2024-0107940-3-상기 제2 안테나는 상기 나머지 안테나들 중 수신 감도가 가장 높은 안테나인, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항 내지 제5항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제1 안테나를 제외한 나머지 안테나들 각각에 대응하는, 상기 나머지 안테나들 각각과 상기 적어도 하나의 탑승자 사이의 최단 거리를 획득하고,상기 제2 안테나는 상기 획득한 최단 거리들 중 가장 긴 거리에 대응하는 안테나인, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 제2 안테나의 수신 감도가 기 설정된 수신 감도 미만인 것에 기초하여, 상기 제2 안테나를 사용하지 않고상기 제1 안테나를 통하여 상기 외부 장치와의 통신을 수행하도록, 상기 통신 모듈(320)을 제어하고,상기 제1 안테나의 전력을 기 설정된 전력값으로 낮추는, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제7항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 적어도 하나의 탑승자와 상기 제2 안테나 사이의 거리를 획득하고,상기 적어도 하나의 탑승자와 상기 제2 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제2 안테나를 사용하지 않고 상기 제1 안테나를 통하여 상기 외부 장치와의 통신을 수행하도록, 상기 통신 모듈(320)을 제어하고,상기 제1 안테나의 전력을 기 설정된 전력값으로 낮추는, 차량용 전자 장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항 내지 제8항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 상태가 유지되는 기간을 측정하고,상기 측정된 기간이 기 설정된 기준 기간을 초과하는 것에 기초하여, 상기 제1 안테나를 사용하지 않고 상기 제2 안테나를 통하여 상기 외부 장치와의 통신을 수행하도록, 상기 통신 모듈(320)을 제어하는, 차량용 전자장치."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제9항 중 어느 한 항에 있어서,상기 적어도 하나의 프로세서(330)는 상기 적어도 하나의 인스트럭션을 실행함으로써,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 안테나 전환을 요청하는 알림을 제공하고,안테나 전환 입력을 수신하는 것에 기초하여, 상기 제1 안테나를 사용하지 않고 상기 제2 안테나를 통하여 상기외부 장치와의 통신을 수행하도록, 상기 통신 모듈(320)을 제어하는, 차량용 전자 장치.공개특허 10-2024-0107940-4-청구항 11 차량용 전자 장치가 차량용 안테나를 제어하는 방법에 있어서,차량 내부에 대한 제1 이미지를 획득하는 단계(S210);상기 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하는 단계(S220);상기 적어도 하나의 탑승자와 상기 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중인 제1 안테나 사이의 거리를 획득하는 단계(S230);상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 상기 제1안테나를 사용하지 않고 상기 복수의 안테나들 중 제2 안테나를 통하여 상기 외부 장치와의 통신을 수행하는 단계(S250)를 포함하는, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제1 이미지는 상기 적어도 하나의 탑승자의 깊이 정보를 포함하는 이미지인, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항 또는 제12항에 있어서,상기 제1 이미지에 포함된 상기 적어도 하나의 탑승자를 인식하는 단계는,객체를 탐지하는 인공지능 모델을 이용하여 상기 제1 이미지에 포함된 상기 적어도 하나의 탑승자를 인식하는단계를 포함하는, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항 내지 제13항 중 어느 한 항에 있어서,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리를 획득하는 단계는,상기 제1 이미지와 다른 방향으로 상기 차량 내부를 촬영한 제2 이미지를 획득하는 단계;상기 제1 이미지 및 상기 제2 이미지에 기초하여, 상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리를획득하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항 내지 제14항 중 어느 한 항에 있어서,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제1 안테나를 사용하지 않고 상기 제2 안테나를 통하여 상기 외부 장치와 통신하는 단계는,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기복수의 안테나들 중 상기 제1 안테나를 제외한 나머지 안테나들의 수신 감도를 획득하는 단계를 포함하고,상기 제2 안테나는 상기 나머지 안테나들 중 수신 감도가 가장 높은 안테나인, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항 내지 제15항 중 어느 한 항에 있어서,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제1 안테나를 사용하지 않고 상기 제2 안테나를 통하여 상기 외부 장치와 통신하는 단계는,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제1 안테나를 제외한 나머지 안테나들 각각에 대응하는, 상기 나머지 안테나들 각각과 상기 적어도 하나의 탑승자 사이의 최단 거리를 획득하는 단계를 포함하고,공개특허 10-2024-0107940-5-상기 제2 안테나는 상기 획득한 최단 거리들 중 가장 긴 거리에 대응하는 안테나인, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항 내지 제16항 중 어느 한 항에 있어서,상기 제2 안테나의 수신 감도가 기 설정된 수신 감도 미만인 것에 기초하여, 상기 제2 안테나를 사용하지 않고상기 제1 안테나를 통하여 상기 외부 장치와 통신하는 단계;상기 제1 안테나의 전력을 기 설정된 전력값으로 낮추는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항 내지 제17항 중 어느 한 항에 있어서,상기 적어도 하나의 탑승자와 상기 제2 안테나 사이의 거리를 획득하는 단계;상기 적어도 하나의 탑승자와 상기 제2 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제2 안테나를 사용하지 않고 상기 제1 안테나를 통하여 상기 외부 장치와 통신하는 단계;상기 제1 안테나의 전력을 기 설정된 전력값으로 낮추는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항 내지 제18항 중 어느 한 항에 있어서,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 것에 기초하여, 상기제1 안테나를 사용하지 않고 상기 제2 안테나를 통하여 상기 외부 장치와 통신하는 단계는,상기 적어도 하나의 탑승자와 상기 제1 안테나 사이의 거리가 상기 기 설정된 거리 미만인 상태가 유지되는 기간을 측정하는 단계;상기 측정된 기간이 기 설정된 기준 기간을 초과하는 것에 기초하여, 상기 제1 안테나를 사용하지 않고 상기 제2 안테나를 통하여 상기 외부 장치와 통신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0191037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항 내지 제19항 중 어느 한 항의 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2022-0191037", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "차량용 전자 장치가 차량용 안테나를 제어하는 방법이 제공된다. 차량용 안테나를 제어하는 방법은, 차량 내부에 대한 제1 이미지를 획득하는 단계, 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하는 단계, 적어도 하나의 탑승자와 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중인 제1 안테나 사이의 거리를 획득하는 단계, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하 지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와 통신하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0191037", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예들은, 차량용 안테나를 제어하는 차량용 전자 장치, 차량용 안테나를 제어하는 방법, 및 차량 용 안테나를 제어하는 방법을 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체에 관한 것이다."}
{"patent_id": "10-2022-0191037", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량을 이용하는 사용자의 요구 및 편리성을 더욱 증가시킬 수 있도록 하는 다양한 기능들이 개발 및 적용되고 있다. 예를 들어, 라디오, TV, 컨텐츠, 운전 시 필요한 각종 정보 등을 사용자에게 제공하기 위한 차량용 장치 등이 개발되고 있다. 사용자에게 제공될 수 있는 정보들은 무선 통신을 통하여 차량으로 수신될 수 있다. 따라서, 사 용자에게 다양한 정보를 제공하기 위해서는 차량 내에 무선 통신을 수행하기 위한 안테나가 필수적으로 구비되 어야 한다. 기존에 차량용 안테나는, 차량의 글래스(glass)나 루프(roof) 상에 위치하는 샤크 핀(shark fin) 모듈 내에 설 치되었다. 최근, 차량의 심미성 및 차량용 안테나의 파손 위험 등을 고려하여, 차량용 안테나를 차량의 외부가 아닌, 내부에 설치하는 방식이 연구되고 있다. 또한, 차량용 안테나가 내부에 설치될 경우, 차량용 안테나의 방사 능력을 향상시키기 위해, 복수의 차량용 안테나들을 설치하는 방식이 연구되고 있다."}
{"patent_id": "10-2022-0191037", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면에 따르면, 차량용 안테나를 제어하는 차량용 전자 장치가 제공된다. 차량용 안테나를 제어하 는 차량용 전자 장치는 복수의 안테나들을 포함하는 통신 모듈, 적어도 하나의 인스트럭션을 저장하는 메모리, 및 메모리에 저장된 적어도 하나의 인스트럭션을 실행하는 적어도 하나의 프로세서를 포함할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 차량 내부에 대한 제1 이미지를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 제1 이미지에 포함된 적어도 하나의 탑승 자를 인식할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑 승자와 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중인 제1 안테나 사이의 거리를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 제1 안테나 사이 의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나 를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 본 개시의 일 측면에 따르면, 차량용 전자 장치가 차량용 안테나를 제어하는 방법이 제공된다. 차량용 안테나를 제어하는 방법은, 차량 내부에 대한 제1 이미지를 획득하는 단계를 포함한다. 차량용 안테나를 제어하는 방법은, 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하는 단계를 포함한다. 차량용 안테나를 제어하는 방 법은, 적어도 하나의 탑승자와 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중인 제1 안테나 사이의 거 리를 획득하는 단계를 포함한다. 차량용 안테나를 제어하는 방법은, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와 통신하는 단계를 포함한다. 본 개시의 일 측면에 따르면, 차량용 안테나를 제어하는, 전술 및 후술하는 방법들 중 어느 하나를 컴퓨터에서 수행하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록매체가 제공된다."}
{"patent_id": "10-2022-0191037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서, \"a, b 또는 c 중 적어도 하나\" 표현은 \" a\", \" b\", \" c\", \"a 및 b\", \"a 및 c\", \"b 및 c\", \"a, b 및 c 모두\", 혹은 그 변형들을 지칭할 수 있다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의 미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 명세서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 또한, 본 명세서에서 사용되는 '제1' 또는 '제2' 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용할 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로만 사용된다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소 프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 본 개시의 실시예들에 있어서, 프로세서에서 수행되는 동작들 중 적어도 하나의 동작은 인공지능(AI: Artificial Intelligence) 기술을 이용하여 수행될 수 있다. 인공 지능(AI) 기술을 이용하여 수행되는 적어도 하나의 동작은 이하에서, 도 6 및 도 10을 참조하여 상세히 설명한다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해서 설 명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 또한, 각각의 도면에서 사용된 도면 부호는 각각의 도면을 설명하기 위한 것일 뿐, 상이한 도면들 각각 에서 사용된 상이한 도면 부호가 상이한 요소를 나타내기 위한 것은 아니다. 이하 첨부된 도면을 참고하여 본 개시를 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시예에 따른 차량용 전자 장치가 복수의 안테나들을 제어하는 동작을 나타내는 도면이다. 도 1을 참조하면, 일 실시예에 따른 차량용 전자 장치는 탑승자와 제1 안테나 사이의 거리에 기초하 여, 복수의 안테나들을 제어할 수 있다. 일 실시예에 따르면, 차량에는 적어도 하나의 탑승자가 탑승할 수 있다. 도 1에는 한 명의 탑승자가 차량에 탑승하고 있는 것으로 도시되어 있으나, 이는 예시에 불과 하며 차량에는 복수의 탑승자가 탑승할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 통신 모듈을 포함하고, 통신 모듈은 복수의 안테나들을 포함할 수 있 다. 도 1에는 차량에 두 개의 안테나가 설치되어 있는 것으로 도시되어 있으나, 이는 예시에 불과하며 차 량에는 세 개 이상의 안테나가 설치될 수 있다. 또한, 복수의 안테나들은 차량 외부 또는 내부에 설치될 수 있다. 이하에서는, 설명의 편의를 위해, 복수의 안테나들은 차량 내부에 설치되는 것을 예로 들어 설명하도 록 한다.차량용 전자 장치는 외부 장치와의 통신을 위해 제1 안테나를 사용할 수 있다. 이 때, 차량에 탑승한 탑승자와 제1 안테나 사이의 거리가 기 설정된 기준 거리 미만일 수 있다. 예를 들어, 탑승자의 앉은 키가 큰 경우, 탑승자와 제1 안테나 사이의 거리가 가까울 수 있다. 제1 안테나가 차량 의 내부에 설치되는 경우, 제1 안테나가 차량의 외부에 설치되는 경우와 달리 탑승자와 제 1 안테나 사이에 금속 차폐 구조물이 존재하지 않게 되고, 제1 안테나가 탑승자와 근접하게 설 치되어 전자파의 영향이 커지게 된다. 차량용 전자 장치는 탑승자와 제1 안테나 사이의 거리가 기 설정된 기준 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고, 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 예를 들어, 차량용 전자 장치는 적어도 하나의 탑승자와 복수의 안테나들 사이의 기준 거리를 10 cm로 설정할 수 있다. 이 때, 탑승자와 제1 안테나 사이의 거리가 10cm 미만 인 경우, 차량용 전 자 장치는 제1 안테나를 사용하지 않고, 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통 신 모듈을 제어할 수 있다. 상술한 바와 같이, 차량용 전자 장치가 탑승자와 제1 안테나 사이의 거리에 기초하여, 제1 안테나 를 사용하지 않고, 제2 안테나를 통하여 외부 장치와 통신하는 경우, 탑승자가 제1 안테나(12 0)에 의해 받는 전자파의 영향을 낮출 수 있다. 이하에서는, 차량용 전자 장치가 복수의 안테나들을 제어하는 방법을 구체적으로 설명하도록 한다. 도 2는 본 개시의 일 실시예에 따른 차량용 전자 장치가 복수의 안테나들을 제어하는 방법을 나타내는 흐름도이 다. 단계 S210에서, 차량용 전자 장치는 차량 내부에 대한 제1 이미지를 획득할 수 있다. 일 실시예에 따른 차량용 전자 장치는 카메라를 포함할 수 있다. 차량용 전자 장치는 카메라를 통해 차량 내부에 대한 제1 이미지를 촬영 하여 획득할 수 있다. 또한, 차량용 전자 장치는 차량 내부에 설치된 외부 카메라로부터 차량 내부에 대한 제1 이미지를 획득할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 실시간으로 제1 이미지를 획득할 수 있다. 예를 들어, 차량용 전자 장 치는 카메라를 통해 실시간으로 차량 내부를 촬영하고, 촬영된 이미지를 획득할 수 있다. 단계 S220에서, 차량용 전자 장치는 제1 이미지에 포함된 적어도 하나의 탑승자를 인식할 수 있다. 일 실시예에 서, 탑승자를 인식한다는 것은, 탑승자의 위치 및 크기를 인식한다는 것을 의미한다. 예를 들어, 차량용 전자 장치는 제1 이미지에 포함된 적어도 하나의 탑승자의 머리의 위치를 획득할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 실시간으로 차량 내부에 대한 이미지를 획득할 수 있다. 이 경우, 차 량용 전자 장치는 실시간으로 차량에 탑승한 적어도 하나의 탑승자를 인식할 수 있고, 적어도 하나의 탑승자의 움직임을 실시간으로 파악할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 객체를 탐지하는 인공지능 모델을 이용하여 제1 이미지에 포함된 적어 도 하나의 탑승자를 인식할 수 있다. 객체 탐지 모델을 이용하여 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하는 방법에 대한 자세한 설명은 도 7을 참조하여 설명하도록 한다. 단계 S230에서, 차량용 전자 장치는 적어도 하나의 탑승자와 복수의 안테나들 중 외부 장치와의 통신을 위해 사 용 중인 제1 안테나 사이의 거리를 획득할 수 있다. 차량용 전자 장치는 차량 내부에 대한 이미지에서 복수의 안테나들이 설치된 위치를 획득할 수 있다. 예를 들어, 차량용 전자 장치가 카메라를 포함하는 경우, 카메라는 차량 내부에 고정되게 설치될 수 있다. 이 때, 카메라에 의해 촬영되는 이미지들은 구도가 일정하므로, 차량용 전자 장치는 이미지 내에서 복수의 안테나들이 설치된 위치를 미리 저장할 수 있다. 일 실시예에 따르면, 제1 이미지는 적어도 하나의 탑승자의 깊이(depth) 정보를 포함하는 이미지일 수 있다. 예 를 들어, 차량용 전자 장치는 3D 카메라를 포함할 수 있다. 제1 이미지가 3D 카메라에 의해 촬영된 이미지인 경 우, 제1 이미지는 깊이 정보를 포함하는 3D 이미지일 수 있다. 제1 이미지가 3D 이미지인 경우, 차량용 전자 장 치는 적어도 하나의 탑승자의 깊이(depth) 정보 및 제1 안테나의 위치에 기초하여, 적어도 하나의 탑승자와 제1 안테나 사이의 거리를 획득할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 제1 이미지와 다른 방향으로 차량 내부를 촬영한 제2 이미지를 획득할 수 있다. 차량용 전자 장치는 제1 이미지 및 제2 이미지에 기초하여, 적어도 하나의 탑승자와 제1 안테나 사이 의 거리를 획득할 수 있다. 제2 이미지를 획득하고, 제1 이미지 및 제2 이미지에 기초하여, 적어도 하나의 탑승자와 제1 안테나 사이의 거리를 획득하는 방법에 대한 자세한 설명은 도 7을 참조하여 설명하도록 한다. 단계 S240에서, 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 지 여부를 판단할 수 있다. 예를 들어, 차량용 전자 장치는 기준 거리를 10cm로 설정할 수 있다. 이 때, 차량용 전자 장치는 이미지 내에서 제1 안테나로부터의 거리가 10cm 미만인 영역을 설정하고, 적어도 하나의 탑승자의 머리가 설정된 영역에 포함되는지 여부를 판단할 수 있다. 또한, 차량용 전자 장치는 탑승자의 머리 이외에 다 른 신체 부위를 기준으로, 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인지 여부를 판단할 수도 있 다. 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 단계 S250을 수행할 수 있다. 단계 S250에서, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 차량 용 전자 장치는 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와의 통신을 수 행할 수 있다. 차량용 전자 장치는 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 예를 들어, 기 설정된 거리가 10cm이고, 적어도 하 나의 탑승자의 머리가 제1 안테나로부터의 거리가 10cm 미만인 영역에 포함되는 경우, 차량용 전자 장치는 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와 통신할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미 만인 것에 기초하여, 복수의 안테나들 중 제1 안테나를 제외한 나머지 안테나들의 수신 감도를 획득할 수 있다. 예를 들어, 차량용 전자 장치는 실시간으로 복수의 안테나들의 수신 감도를 획득할 수 있다. 차량용 전자 장치 는 복수의 안테나들 중 제1 안테나를 제외한 나머지 안테나들 중 가장 높은 수신 감도를 가지는 안테나를 통하 여 외부 장치와 통신할 수 있다. 즉, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 경우, 차량용 전자 장치는 제1 안테나를 사용하지 않고, 복수의 안테나들 중 제1 안테나를 제외한 나머지 안테 나들 중 가장 높은 수신 감도를 가지는 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제 어할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미 만인 것에 기초하여, 제1 안테나를 제외한 나머지 안테나들 각각에 대응하는, 나머지 안테나들 각각과 적어도 하나의 탑승자 사이의 최단 거리를 획득할 수 있다. 차량용 전자 장치는 획득한 최단 거리들 중 가장 긴 거리에 대응하는 안테나를 통하여 외부 장치와 통신할 수 있다. 즉, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 경우, 차량용 전자 장치는 제1 안테나를 사용하지 않고, 획득한 최단 거리들 중 가장 긴 거리에 대응하는 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 이를 통 해, 차량용 전자 장치는 적어도 하나의 탑승자들이 복수의 안테나들에 의해 받는 전자파의 영향을 최소화할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미 만인 상태가 유지되는 기간을 측정할 수 있다. 예를 들어, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 이상일 수 있다. 하지만, 적어도 하나의 탑승자가 잠시 몸을 일으키는 경우, 적어도 하나의 탑 승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만일 수 있다. 이러한 경우에 차량용 전자 장치는 적어도 하나의 탑승자에 대한 전자파의 영향이 크지 않다고 판단하고 제1 안테나를 계속 사용할 수 있다. 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 상태가 유지되는 기간이 기 설정된 기준 기간을 초과하는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신할 수 있다. 즉, 차량용 전자 장치는 측정된 기간이 기 설정된 기준 기간을 초과하는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제 어할 수 있다. 예를 들어, 차량용 전자 장치는 기준 기간을 10초로 설정하고, 적어도 하나의 탑승자와 제1 안테 나 사이의 거리가 기 설정된 거리 미만인 상태가 10초를 초과하여 유지되는 경우, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 설정된 거리 미만 인 것에 기초하여, 안테나 전환을 요청하는 알림을 제공할 수 있다. 일 실시예에 따른 차량용 전자 장치는 사용 자 인터페이스를 포함할 수 있다. 이 경우, 차량용 전자 장치는 사용자 인터페이스를 통해 적어도 하나의 탑승 자에게 안테나를 전환할 것을 요청할 수 있다. 예를 들어, 차량용 전자 장치는 사용자 인터페이스를 통해 복수의 안테나들 중 제1 안테나를 제외한 나머지 안테나들의 목록을 표시하고, 나머지 안테나들 각각의 수신 감도 및 나머지 안테나들 각각과 가장 가까운 적어도 하나의 탑승자 중 하나 사이의 거리를 표시할 수 있다. 차량용 전자 장치는 안테나 전환 입력을 수신하는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통 하여 외부 장치와 통신할 수 있다. 예를 들어, 차량용 전자 장치가 사용자 인터페이스를 포함하는 경우, 적어도 하나의 탑승자는 사용자 인터페이스를 통해 복수의 안테나들 중 제1 안테나를 제외한 나머지 안테나들 중 하나 를 선택할 수 있다. 차량용 전자 장치는 사용자 인터페이스를 통해 제1 안테나에서 제2 안테나로 전환하는 안테 나 전환 입력을 수신할 수 있다. 일 실시예에서, 제1 안테나에서 제2 안테나로 전환한다는 것은, 외부 장치와의 통신을 위해 사용되던 제1 안테나를 사용하지 않고, 제2 안테나를 통하여 외부 장치와 통신한다는 것을 의미한 다. 차량용 전자 장치가 제1 안테나에서 제2 안테나로 전환하는 안테나 전환 입력을 수신한 경우, 차량용 전자 장치는 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신할 수 있다. 도 3은 본 개시의 일 실시예에 따른 차량용 전자 장치의 구성을 도시한 블록도이다. 메모리는 적어도 하나의 프로세서가 판독할 수 있는 명령어들, 데이터 구조, 및 프로그램 코드 (program code)를 저장할 수 있다. 적어도 하나의 프로세서가 수행하는 동작들은 메모리에 저장된 프 로그램의 명령어들 또는 코드들을 실행함으로써 구현될 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등)를 포함할 수 있으며, 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나를 포함하는 비 휘 발성 메모리 및 램(RAM, Random Access Memory) 또는 SRAM(Static Random Access Memory)과 같은 휘발성 메모 리를 포함할 수 있다. 일 실시예에 따른 메모리는 차량 내부에 대한 이미지들을 저장할 수 있다. 메모리는 이미지 내에서 복수의 안테나들의 위치를 저장할 수 있다. 메모리는 적어도 하나의 탑승자의 위치 및 크기에 대한 정보를 저장할 수 있다. 통신 모듈은 적어도 하나의 무선 통신 네트워크를 통해서 외부 장치(예를 들어, 서버)와 통신을 수행한다. 여기서, 외부 장치(미도시)는 차량용 전자 장치에서 수행되는 연산 중 적어도 하나를 수행하거나 차량용 전자 장치에 필요한 데이터 등을 송수신 할 수 있는 서버 등이 될 수 있다. 또한, 통신 모듈은, 근거리 통신 모듈, 유선 통신 모듈, 이동 통신 모듈, 방송 수신 모듈 등과 같은 적어 도 하나의 통신 모듈을 포함한다. 여기서, 적어도 하나의 통신 모듈은 방송 수신을 수행하는 튜너, 블루투스, WLAN(Wireless LAN)(Wi-Fi), Wibro(Wireless broadband), Wimax(World Interoperability for Microwave Access), CDMA, WCDMA, 인터넷, 3G, 4G, 및/또는 5G, 밀리미터파(mmWAVE)를 이용하여 통신을 수행하는 방식 등 과 같은 통신 규격을 따르는 네트워크를 통하여 데이터 송수신을 수행할 수 있는 통신 모듈을 뜻한다. 예를 들어, 통신부가 밀리미터파(mmWAVE)를 이용하여 통신을 수행하면, 대용량의 데이터를 빠르게 송수신 할 수 있다. 구체적으로, 차량에서는 대용량의 데이터를 빠르게 수신함으로써, 차량의 안전에 필요한 데이터(예 를 들어, 자율 주행에 필요한 데이터, 네비게이션 서비스를 위해 필요한 데이터 등), 사용자 이용 컨텐츠(예를 들어, 영화, 음악 등)을 빠르게 제공함으로써, 차량의 안전성 및/또는 사용자의 편리성을 증가시킬 수 있다. 구체적으로, 통신 모듈에 포함되는 이동 통신 모듈은 3G, 4G, 및/또는 5G 등의 통신 규격에 따르는 통신 네트워크를 통하여 원거리에 위치하는 다른 장치(예를 들어, 서버(미도시))와 통신을 수행할 수 있다. 여기서, 원거리에 위치하는 서버(미도시)와 통신을 수행하는 통신 모듈을 '원거리 통신 모듈'이라 칭할 수 있다. 일 실시예에 따르면, 통신 모듈은 적어도 하나의 탑승자를 인식하기 위해 외부 서버로 차량 내부에 대한 이미지를 전송할 수 있다. 외부 서버는 객체 탐지 모델에 이미지를 입력하여 적어도 하나의 탑승자에 대한 위치 정보를 출력할 수 있다. 통신 모듈은 외부 서버로부터 적어도 하나의 탑승자에 대한 위치 정보를 수신할 수 있다. 일 실시예에 따르면, 통신 모듈은 복수의 안테나들을 포함할 수 있다. 복수의 안테나들은 차량 과 외부 장치 간의 무선 통신을 위하여 차량에 설치되는 안테나들로, 복수의 안테나들 각각은 적어도 하나의 안 테나 소자를 통하여 전파를 송수신한다. 복수의 안테나들은 소정 주파수 대역에서 무선 통신을 수행할 수 있다. 무선 통신에 이용되는 주파수 대역은 이용하고자 하는 통신 규격 또는 통신 종류에 따라서 달라질 수 있다. 구체적으로, 복수의 안테나들 각각은 밀리미터파(mmWAVE)를 지원하는 지향성 안테나일 수 있다. 여기서, 밀리미터파는 30GHz~300GHz 사이의 주파수 대역을 갖는 전파 신호로 파장이 1~10mm 범위의 값을 갖는다. 복수의 안테나들은 밀리미터파의 전파를 송수신함으로써, 송수신되는 전파 신호의 형태 및 방향을 정밀하게 조절 할 수 있다. 일 실시예에 따르면, 복수의 안테나들은 TCU(Transmission Control Unit)와 통합된 형태로 형성될 수 있 다. TCU는 차량 내에서 무선 통신을 통하여 데이터의 송수신을 제어하는 구성으로, 차량과 외부 전자 장치(예를 들어, 서버, 모바일 기기 등)와의 통신을 담당할 수 있다. TCU는 통신 모듈에 포함되어 외부 전자 장치와 의 통신을 위해 복수의 안테나들을 제어할 수 있다. 적어도 하나의 프로세서는 메모리에 저장된 명령어들이나 프로그램화된 소프트웨어 모듈을 실행함으 로써, 차량용 전자 장치가 수행하는 동작이나 기능을 제어할 수 있다. 적어도 하나의 프로세서는 산 술, 로직 및 입출력 연산과 시그널 프로세싱을 수행하는 하드웨어 구성 요소로 구성될 수 있다. 적어도 하나의 프로세서는 예를 들어, 중앙 처리 장치(Central Processing Unit), 마이크로 프로세서 (microprocessor), 그래픽 처리 장치(Graphic Processing Unit), ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 애플리케이션 프로세서 (Application Processor), 신경망 처리 장치(Neural Processing Unit) 또는 인공지능 모델의 처리에 특화된 하 드웨어 구조로 설계된 인공지능 전용 프로세서 중 적어도 하나로 구성될 수 있으나, 이에 제한되는 것은 아니다. 적어도 하나의 프로세서를 구성하는 각 프로세서는 소정의 기능을 수행하기 위한 전용 프로세서일 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 차량 내부에 대한 제1 이미지를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 제1 이미지에 포함된 적어도 하나의 탑승자를 인식할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중인 제1 안테나 사이의 거리를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함 으로써, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나 를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈 을 제어할 수 있다. 도 4는 본 개시의 일 실시예에 따른 차량용 전자 장치 및 차량용 전자 장치에 포함되는 복수의 안테나들의 위치 를 도시한 예시적인 도면이다. 차량용 전자 장치는 복수의 안테나들을 포함할 수 있다. 일 실시예에 따르면, 차량용 전자 장치에 포 함되는 복수의 안테나들은 차량에 분산 배치될 수 있다. 일 실시예에서, DU(Distributed antenna Unit)는 분산 배치된 안테나를 의미할 수 있다. 차량의 다양한 위치에 복수의 안테나들이 설치되는 경우, 다양한 방향에서 수신되는 신호를 높은 수신 감도로 수신할 수 있다. 도 4를 참조하면, 차량에 차량용 전자 장치 및 4개의 안테나들이 설치되어 있으나, 차량에 설치되는 차량용 전자 장치의 위치, 안테나의 개수, 및 안테나의 위치는 이에 한정되지 않는다. 이하에서는, 설명의 편의를 위해 차량용 전자 장치는 4 개의 안테나, 즉 DU1, DU2, DU3, 및 DU4를 포함하는 것을 예로 들어 설명하도록 한다. 일 실시예에 따르면, 복수의 안테나들은 차량의 몸체를 형성하는 금속 패널의 하부에 설치될 수 있다. 구 체적으로, 금속 패널을 오픈시켜서, 차량의 내부에 복수의 안테나들이 배치되도록 할 수 있다. 또한, 복수 의 안테나들이 설치되는 영역의 상부는 금속 물질로 형성되지 않을 수 있다. 구체적으로, 복수의 안테나들이 설 치되는 영역의 상부는 전파가 차단되지 않는 물질(예를 들어, 비 금속성 물질 등)로 형성될 수 있다. 복수의 안 테나들은 도 4에 도시된 안테나들의 위치에 한정되지 않고, 차량의 보닛(bonnet) 패널, 도어(door) 패널, 휀다(fender) 패널, 휠러(pillar) 패널, 루프(roof) 패널, 범퍼(bumper) 패널 및 트렁크(trunk) 패널 중 적어 도 하나의 하부 영역 또는 내측 영역에 설치될 수 있다. 여기서, 도어 패널은 운전석 측 전방 도어 패널, 운전석 측 후방 도어 패널, 조수석 측 전방 도어 패널, 및 조 수석 측 후방 도어 패널을 포함할 수 있다. 또한, 휀다 패널은 운전석 측 전방 휀다 패널, 운전석 측 후방 휀다 패널, 조수석 측 전방 휀다 패널, 및 조수석 측 후방 휀다 패널을 포함할 수 있다. 또한, 휠러 패널은 운전석측 전방 휠러 패널, 운전석 측 후방 휠러 패널, 조수석 측 전방 휠러 패널, 및 조수석 측 후방 휠러 패널을 포 함할 수 있다. 또한, 범퍼 패널은 전방 범퍼 패널, 및 후방 범퍼 패널을 포함할 수 있다. 도 4를 참조하면, 앞 좌석에 탑승한 탑승자들은 DU1, DU2, DU3에 의해 전자파의 영향을 받을 수 있다. 뒷 좌석에 탑승한 탑승자들은 DU1, DU3, DU4에 의해 전자파의 영향을 받을 수 있다. 안테 나에 의한 전자파의 영향을 감소시키기 위해, 차량용 전자 장치는 외부 장치와의 통신을 수행하기 위해 사 용하는 안테나를 전환할 수 있다. 또한, 차량용 전자 장치는 외부 장치와의 통신을 수행하기 위해 사용하 는 안테나의 전력을 기 설정된 전력값으로 낮추어 사용할 수 있다. 도 5는 본 개시의 일 실시예에 따른 복수의 안테나들의 기 설정된 기준 영역과 적어도 하나의 탑승자들을 나타 내는 도면이다. 일 실시예에 따르면, 차량용 전자 장치는 기 설정된 거리에 기초하여, 이미지내에서 복수의 안테나들 각각으로 부터의 거리가 기 설정된 거리 미만인 영역을 설정할 수 있다. 예를 들어, 기 설정된 거리가 10cm인 경우, 차량 용 전자 장치는 이미지 내에서 복수의 안테나들 각각으로부터의 거리가 10cm 미만인 영역을 설정할 수 있다. 차 량용 전자 장치는 적어도 하나의 탑승자의 머리가 기 설정된 기준 영역에 포함되는지 여부를 판단할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 복수의 안테나들 각각에 대해, 복수의 안테나들 각각 사이의 거리가 기 설정된 거리 미만이 될 수 있는 탑승자 후보를 설정할 수 있다. 예를 들어, 차량용 전자 장치는 차량의 전면에 설치된 DU2에 대해, 차량의 앞 좌석에 탑승한 탑승자들을 탑승자 후보로 설정할 수 있다. 또 한, 차량용 전자 장치는 차량의 후면에 설치된 DU4에 대해, 차량의 뒷 좌석에 탑승한 탑승자들 을 탑승자 후보로 설정할 수 있다. 이 경우, 뒷 좌석에 탑승한 탑승자들이 이미지 내에서 DU2의 기 설정된 기준 영역에 포함되더라도, 차량용 전자 장치는 뒷 좌석에 탑승한 탑승자들과 DU2 사이의 거리가 기 설정 된 거리 미만이라고 판단하지 않을 수 있다. 도 6은 본 개시의 일 실시예에 따른 차량용 전자 장치가 객체를 탐지하는 인공지능 모델을 통해 적어도 하나의 탑승자를 인식하는 동작을 나타내는 도면이다. 일 실시예에 따르면, 차량용 전자 장치는 객체를 탐지하는 인공지능 모델(이하, \"객체 탐지 모델\"이라 한다.)을 통해 적어도 하나의 탑승자를 인식할 수 있다. 일 실시예에서, 객체 탐지란, 이미지 내에서 객체의 종류, 위치 및 크기를 결정하는 것을 의미한다. 일 실시예에서, 적어도 하나의 탑승자를 인식하는 것은, 차량 내부에 대한 이미지 내에서 적어도 하나의 탑승자를 탐지하여 적어도 하나의 탑승자의 위치 및 크기를 결정하는 것을 의미한다. 차량용 전자 장치는 메모리에 저장된 객체 탐지 모델을 이용하여 적어도 하나의 탑승자를 인식할 수도 있고, 외 부 서버에 저장된 객체 탐지 모델을 이용하여, 적어도 하나의 탑승자를 인식할 수 있다. 이하에서는, 설명의 편 의를 위해, 차량용 전자 장치가 외부 서버에 저장된 객체 탐지 모델을 이용하여 적어도 하나의 탑승자를 인식하 는 것을 예로 들어 설명하도록 한다. 차량용 전자 장치는 외부 서버로 획득한 차량 내부에 대한 이미지를 전송할 수 있다. 외부 서버는 차량용 전자 장치로부터 수신한 이미지를 객체 탐지 모델에 입력하여 이미지에 포 함된 적어도 하나의 탑승자에 대한 위치 정보를 출력할 수 있다. 차량용 전자 장치는 외부 서버로부터 적어도 하나의 탑승자에 대한 위치 정보를 수신할 수 있다. 일 실시예에 따르면, 적어도 하나의 탑승자에 대한 위치 정보는 적어도 하나의 탑승자에 대한 경계 상자 (bounding box) 정보 및 세그멘테이션(segmentation) 정보를 포함할 수 있다. 일 실시예에서, 경계 상자란, 객 체의 위치 및 크기를 사각형으로 나타낸 상자를 의미한다. 일 실시예에서, 세그멘테이션 정보란, 객체의 경계에 대한 정보를 의미한다. 차량용 전자 장치는 적어도 하나의 탑승자의 경계 상자 정보 또는 세그멘테이션 정보 중 적어도 하나에 기초하여, 적어도 하나의 탑승자와 복수의 안테나들 각각 사이의 거리를 획득할 수 있다. 또한, 차량용 전자 장치는 적어도 하나의 탑승자의 경계 상자에 기초하여, 복수의 안테나들 각각에 대한 탑승자 후보 를 설정할 수 있다. 도 7은 본 개시의 일 실시예에 따른 제1 이미지와 다른 방향으로 차량 내부를 촬영한 제2 이미지를 도시한 예시적인 도면이다. 도 7을 참조하면, 일 실시예에 따른 차량용 전자 장치는 차량의 뒷 좌석을 촬영한 제2 이미지를 획득할 수 있다. 다만, 이에 한정되지 않고, 차량용 전자 장치는 다양한 방향으로 차량 내부를 촬영한 적어도 하나의 이미지를 획득할 수 있다. 예를 들어, 카메라가 차량 내부의 측면에 설치되는 경우, 제2 이미지는 차량 의 측면에서 촬영한 이미지일 수 있다. 도 7에서, 차량용 전자 장치는 차량의 뒷 좌석을 촬영한 제2이미지에 포함된 적어도 하나의 탑승자들과 DU1, DU3, 및 DU4 각각 사이의 거리를 획득할 수 있 다. 일 실시예에 따르면, 차량용 전자 장치는 제1 이미지에서 적어도 하나의 탑승자와 복수의 안테나들 사이의 정확 한 거리를 획득하지 못할 수 있다. 예를 들어, 제1 이미지에서 앞 좌석에 의해 뒷 좌석의 탑승자의 신체 일부가 가려지는 경우, 뒷 좌석의 탑승자와 복수의 안테나들 사이의 정확한 거리를 획득하지 못할 수 있다. 이 경우, 차량용 전자 장치는 차량의 뒷 좌석을 촬영한 제2 이미지를 획득하여 적어도 하나의 탑승자와 복수의 안테 나들 사이의 정확한 거리를 획득할 수 있다. 예를 들어, DU4는 차량의 전면에서 바라보았을 때, 뒷 좌석보다 뒤에 설치될 수 있다. 이 경우, 차량 용 전자 장치는 차량의 전면에서 촬영된 제1 이미지에서 뒷 좌석의 탑승자와 DU4 사이의 정확한 거리 를 획득하지 못할 수 있다. 차량용 전자 장치는 차량의 측면에서 촬영된 제2 이미지를 획득하여, 뒷 좌석 의 탑승자와 DU4 사이의 정확한 거리를 획득할 수 있다. 도 8은 본 개시의 일 실시예에 따른 차량용 전자 장치가 제2 안테나의 수신 감도에 기초하여 복수의 안테나들을 제어하는 방법을 나타내는 흐름도이다. 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와 통신할 수 있다. 단계 S810에서, 차량용 전자 장치는 제2 안테나의 수신 감도를 획득할 수 있다. 일 실시예에 따르면, 차량용 전 자 장치는 실시간으로 제2 안테나의 수신 감도를 획득할 수 있다. 단계 S820에서, 차량용 전자 장치는 제2 안테나의 수신 감도가 기 설정된 수신 감도 미만인지 여부를 판단할 수 있다. 제2 안테나의 수신 감도가 기 설정된 수신 감도 미만인 경우, 차량용 전자 장치는 단계 S830을 수행할 수 있다. 예를 들어, 차량용 전자 장치는 기준 수신 감도를 -100dB로 설정할 수 있다. 이 경우, 차량용 전자 장치 는 제2 안테나의 수신 감도가 -100dB 미만인 경우, 단계 S830을 수행할 수 있다. 단계 S830에서, 차량용 전자 장치는 제2 안테나를 사용하지 않고 제1 안테나를 통하여 외부 장치와의 통신을 수 행할 수 있다. 차량용 전자 장치는 제2 안테나를 사용하지 않고 제1 안테나를 통하여 외부 장치와의 통신을 수 행하도록, 통신 모듈을 제어할 수 있다. 단계 S840에서, 차량용 전자 장치는 제1 안테나의 전력을 백오프(back-off)할 수 있다. 일 실시예에서, 안테나 의 전력을 백오프한다는 것은, 안테나의 전력을 소정 전력값으로 낮추는 것을 의미한다. 차량용 전자 장치는 안 테나의 성능 및 전자파의 영향을 고려하여, 소정 전력값을 미리 설정할 수 있다. 예를 들어, 적어도 하나의 탑 승자 중 제1 안테나와 가장 가까운 탑승자인 제1 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 경 우, 제1 탑승자는 제1 안테나에 의해 전자파의 영향을 크게 받을 수 있다. 이 때, 차량용 전자 장치는 제1 안테 나의 전력을 기 설정된 전력값으로 낮추어 제1 탑승자의 전자파흡수율(Specific Absorption Rate)을 낮출 수 있 다. 도 9는 본 개시의 일 실시예에 따른 차량용 전자 장치가 적어도 하나의 탑승자와 제2 안테나 사이의 거리에 기 초하여 복수의 안테나들을 제어하는 방법을 나타내는 흐름도이다. 차량용 전자 장치는 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 차량용 전자 장치는 제1 안테나를 사용하지 않고 복수의 안테나들 중 제2 안테나를 통하여 외부 장치와 통신할 수 있다. 단계 S910에서, 차량용 전자 장치는 적어도 하나의 탑승자와 제2 안테나 사이의 거리를 획득할 수 있다. 적어도 하나의 탑승자와 제2 안테나 사이의 거리를 획득하는 방법은 적어도 하나의 탑승자와 제1 안테나 사이의 거리를 획득하는 방법과 안테나만 달리할 뿐 그 방법은 동일하므로, 자세한 설명은 생략한다. 단계 S920에서, 차량용 전자 장치는 적어도 하나의 탑승자와 제2 안테나 사이의 거리가 기 설정된 거리 미만인 지 여부를 판단할 수 있다. 적어도 하나의 탑승자와 제2 안테나 사이의 거리가 기 설정된 거리 미만인 경우, 차 량용 전자 장치는 단계 S930을 수행할 수 있다. 예를 들어, 차량용 전자 장치는 기준 거리를 10cm로 설정할 수 있다. 이 경우, 차량용 전자 장치는 적어도 하나의 탑승자와 제2 안테나 사이의 거리가 10cm 미만인 경우, 단계 S930을 수행할 수 있다. 단계 S930에서, 차량용 전자 장치는 제2 안테나를 사용하지 않고 제1 안테나를 통하여 외부 장치와의 통신을 수 행할 수 있다. 단계 S930에 대한 설명은 단계 S830에 대한 설명과 동일하므로 자세한 설명은 생략한다. 단계 S940에서, 차량용 전자 장치는 제1 안테나의 전력을 백오프할 수 있다. 단계 S940에 대한 설명은 단계 S940에 대한 설명과 동일하므로 자세한 설명은 생략한다. 도 10은 본 개시의 일 실시예에서 인공지능 모델을 이용하여 적어도 하나의 탑승자를 인식하는 동작을 설명하기 위한 도면이다. 적어도 하나의 프로세서에서 수행되는 이미지에 포함된 적어도 하나의 탑승자를 인식하는 동작은, 신경망 (neural network)을 통한 연산을 수행하는 인공지능(AI: Artificial Intelligence) 기술을 이용하여 수행될 수 있다. 이미지에 포함된 적어도 하나의 탑승자를 인식하는 동작은 도 6을 참조하여 상술하였으므로, 자세한 설명 은 생략한다. 인공 지능 기술(이하, 'AI 기술')은 신경망(Neural Network)을 통한 연산을 수행하여 입력된 데이터를 분석 및/ 또는 분류 등과 같은 처리를 하여 목적하는 결과를 획득하는 기술이다. 이러한 AI 기술은 알고리즘을 활용하여 구현될 수 있다. 여기서, AI 기술을 구현하기 위한 알고리즘 또는 알고 리즘의 집합을 신경망(Neural Network)이라 한다. 여기서, 신경망은 입력 데이터를 입력받고, 전술한 분석 및/ 또는 분류를 위한 연산을 수행하여, 결과 데이터를 출력할 수 있다. 이렇게, 신경망이 입력 데이터에 대응되는 결과 데이터를 정확하게 출력하기 위해서는, 신경망을 학습(training) 시킬 필요가 있다. 여기서, '학습 (training)'은 신경망으로 다양한 데이터들을 입력시키고, 입력된 데이터들을 분석하는 방법, 입력된 데이터들 을 분류하는 방법, 및/또는 입력된 데이터들에서 결과 데이터 생성에 필요한 특징을 추출하는 방법 등을 신경망 이 스스로 발견 또는 터득할 수 있도록 신경망을 훈련시키는 것을 의미할 수 있다. 구체적으로, 학습 과정을 통 하여, 신경망은 학습 데이터(예를 들어, 서로 다른 복수의 이미지들)를 학습(training)하여 신경망 내부의 가중 치 값들을 최적화하여 설정할 수 있다. 그리고, 최적화된 가중치 값을 가지는 신경망을 통하여, 입력된 데이터 를 스스로 학습(learning)함으로써, 목적하는 결과를 출력한다. 구체적으로, 신경망은 연산을 수행하는 내부의 레이어(layer)인 은닉 레이어(hidden layer)의 개수가 복수일 경 우, 즉 연산을 수행하는 신경망의 심도(depth)가 증가하는 경우, 심층 신경망으로 분류될 수 있다. 신경망의 예 로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네트워크 (Deep Q-Networks) 등이 있으며, 전술한 예에 한정되지 않는다. 또한, 신 경망은 세분화될 수 있다. 예를 들어, CNN 신경망은 DCNN(Deep Convolution Neural Network) 또는 캡스넷 (Capsnet) 신경망(미도시) 등으로 세분화 될 수 있다. 일 실시예에서, 'AI 모델'은 입력 데이터를 수신하고 목적하는 결과를 출력하도록 동작하는 적어도 하나의 레이 어를 포함하는 신경망을 의미할 수 있다. 또한, 'AI 모델'은 신경망을 통한 연산을 수행하여 목적하는 결과를 출력하는 알고리즘 또는 복수의 알고리즘의 집합, 이러한 알고리즘 또는 그의 집합을 실행하기 위한 프로세서 (processor), 이러한 알고리즘 또는 그의 집합을 실행하기 위한 소프트웨어, 또는 이러한 알고리즘 또는 그의 집합을 실행하기 위한 하드웨어를 의미할 수 있다. 도 10을 참조하면, 신경망은 학습 데이터(training data)를 입력받아 트레이닝(training)될 수 있다. 그 리고, 학습된 신경망은 입력단으로 입력 데이터를 입력받고, 출력단입력 데이터(101 1)를 분석하여 목적하는 결과인 출력 데이터를 출력하기 위한 연산을 수행할 수 있다. 신경망을 통한 연 산은 은닉 레이어(hidden layer)를 통하여 수행될 수 있다. 도 10에서는 편의상 은닉 레이어가 1단 의 계층으로 형성되도록 간략화하여 도시하였으나, 은닉 레이어는 복수개의 계층으로 형성될 수 있다. 구체적으로, 일 실시예에 따르면, 신경망은 차량 내부에 대한 이미지를 포함하는 훈련 이미지 데이터세트 를 통해 훈련 이미지에 포함된 적어도 하나의 탑승자에 대한 경계 상자 정보 및 세그멘테이션 정보를 출력하도 록 학습될 수 있다. 예를 들어, 훈련 이미지 데이터세트에 포함되는 각 훈련 이미지에는 적어도 하나의 탑승자 에 대한 경계 상자 및 세그멘테이션 정보에 대응하는 주석(annotation)이 포함될 수 있다. 학습이 완료된 신경망은, 차량 내부에 대한 이미지를 입력받고, 입력받은 이미지에 포함된 적어도 하나의 탑승자에 대한 경계 상자 정보 및 세그멘테이션 정보를 출력할 수 있다. 구체적으로, 신경망은, 입력단 으로 차량 내부에 대한 이미지를 입력받고, 입력받은 이미지에 포함된 적어도 하나의 탑승자에 대한 경계 상자 정보 및 세그멘테이션 정보를 출력단으로 출력할 수 있다. 일 실시예에서, 이미지에 포함된 적어도 하나의 탑승자에 대한 경계 상자 정보 및 세그멘테이션 정보를 출력하 는 신경망은 적어도 하나의 프로세서(예를 들어, 도 3의 330) 내에 구현될 수 있다. 또한, 이미지에 포함 된 적어도 하나의 탑승자에 대한 경계 상자 정보 및 세그멘테이션 정보를 출력하는 신경망은 차량용 전자 장치(예를 들어, 도 3의 300)와 구별되며 차량(예를 들어, 도 1의 110) 내부에 위치하는 별도의 전자 장치(미도 시) 또는 프로세서(미도시) 내에 구현될 수 있다. 또한, 전술한 신경망을 통한 연산은 일 실시예에 따른 차량용 전자 장치(예를 들어, 도 3의 300)와 무선 통신 네트워크를 통하여 통신할 수 있는 서버(미도시)에서 수행될 수 있다. 차량용 전자 장치와 서버(미도 시) 간의 통신은 이하에서 도 11 및 도 12를 참조하여 상세히 설명하도록 한다. 도 11은 서버와 연동하여 동작하는 본 개시의 일 실시예에 따른 차량용 전자 장치를 나타내는 도면이다. 일 실시예에 따르면, 차량 내부에 대한 이미지에 포함된 적어도 하나의 탑승자에 대한 위치 정보는 서버 에서 계산된 후 차량에 위치하는 차량용 전자 장치로 전송될 수 있다. 적어도 하나의 탑승자에 대한 위치 정보에는 적어도 하나의 탑승자에 대한 경계 상자 정보 및 세그멘테이션 정보가 포함될 수 있다. 또 한, 서버는 통신 네트워크를 통하여 전자 장치, 예를 들어, 차량용 전자 장치와 데이터를 송수신하 며 데이터를 처리하는 서버, 서버 시스템, 서버 기반의 장치 등을 포함할 수 있다. 또는, 차량 내부에 대한 이미지에 포함된 적어도 하나의 탑승자에 대한 위치 정보는 서버에서 계산 된 후 차량 내에 위치하며 차량용 전자 장치와 유무선의 통신을 수행할 수 있는 별도의 전자 장치로 전송될 수 있다. 적어도 하나의 탑승자에 대한 위치 정보가 별도의 전자 장치로 전송되는 경우, 별도의 전자 장치는 서버 로부터 적어도 하나의 탑승자에 대한 위치 정보를 획득하여 차량용 전자 장치로 전송할 수 있다. 차량용 전자 장치는 별도의 전자 장치로부터 수신한 적어도 하나의 탑승자에 대한 위치 정보에 기초하여, 적어도 하나의 탑승자와 복수의 안테나들 각각 사이의 거리를 획득할 수 있다. 일 실시예에서, 서버는 차량의 내부에 설치되는 차량용 전자 장치와 통신하는 통신 모듈, 및 적어도 하나의 인스트럭션을 수행하는 프로세서를 포함한다. 서버의 프로세서는 차량 내부에 대한 이미지를 획득하고, 획득한 이미지에 포함된 적어도 하나의 탑승자에 대한 위치 정보를 획득하고, 획득한 적어도 하나의 탑승자에 대한 위치 정보가 차량용 전자 장치(30 0)로 전송되도록 통신 모듈을 제어할 수 있다. 일 실시예에서, 서버는 도 10을 참조하여 설명한 신경망을 통한 연산을 수행하여 이미지에 포함된 적어도 하나의 탑승자에 대한 위치 정보를 획득할 수 있다. 구체적으로, 서버는 AI 모델을 훈련시키고, 훈련된 AI 모델을 저장하고 있을 수 있다. 그리고, 서버는 훈련된 AI 모델을 이용하여 전술한 적어도 하나의 탑 승자에 대한 위치 정보를 획득할 수 있다. 일반적으로, 차량용 전자 장치는 메모리 저장 용량, 연산의 처리 속도, 학습 데이터 셋의 수집 능력 등이 서버에 비하여 제한적일 수 있다. 따라서, 대용량 데이터의 저장 및 대용량의 연산량이 필요한 동작은 서 버에서 수행한 후, 통신 네트워크를 통하여 필요한 데이터 및/또는 이용되는 AI 모델을 차량용 전자 장치 에 전송할 수 있다. 이를 통해, 차량용 전자 장치는 대용량의 메모리 및 빠른 연산 능력을 갖는 프로 세서 없이도, 서버를 통하여 필요한 데이터 및/또는 AI 모델을 수신하여 이용함으로써, 빠르고 용이하게 필요한 동작을 수행할 수 있다. 일 실시예에서, 서버는 도 10에서 설명한 신경망을 포함할 수 있다. 구체적으로, 서버에 포 함되는 신경망은 전술한 적어도 하나의 탑승자에 대한 정보를 획득하기 위한 연산을 수행할 수 있다. 서버는 신경망을 통한 연산을 수행하여 획득한 적어도 하나의 탑승자에 대한 위치 정보를 무선 네트워크 을 통하여 차량용 전자 장치로 전송할 수 있다. 차량용 전자 장치는 서버로부터 수신된 적어도 하나의 탑승자에 위치 정보에 기초하여, 적어도 하나의 탑승자와 복수의 안테나들 각각 사이의 거리를 획득할 수 있다. 도 12는 도 11을 상세하게 설명하기 위한 도면이다. 도 12에 도시된 차량용 전자 장치에 있어서 도 3에서 설명한 구성과 동일한 구성은 설명을 생략하기로 한 다. 도 12을 참조하면, 차량용 전자 장치는 도 3에 도시된 구성에서 카메라모듈, 및 사용자 인터페이스 를 더 포함할 수 있다. 카메라 모듈은 영상 및/또는 음성 데이터를 획득하기 위한 구성으로, 카메라 및 마이크를 포함할 수 있다. 또한, 카메라 모듈은 카메라의 동작음 등을 출력하기 위해서 스피커를 포함할 수 있다. 또한, 카메라 모듈 이 별도의 스피커를 포함하고 있지 않은 경우, 카메라의 동작음 등은 차량용 전자 장치에 포함된 오 디오 출력 모듈(미도시)을 통하여 출력될 수 있다. 예를 들어, 카메라 모듈은 사용자의 제스쳐 및 음성을 인식하기 위한 감지 센서로 동작할 수 있다. 구체적으로, 카메라는 카메라 인식 범위에서 제스처를 포함하는 사용자의 모션에 대응되는 영상(예를 들어, 연 속되는 프레임)을 수신할 수 있다. 예를 들어, 카메라의 인식 범위는 카메라에서부터 사용자까지 0.1 ~ 5 m 이 내 거리가 될 수 있다. 사용자 모션은 예를 들어, 사용자의 얼굴, 표정, 손, 주먹, 손가락과 같은 사용자의 신 체 일부분 또는 사용자 일부분의 모션 등을 포함할 수 있다. 카메라는 적어도 하나의 프로세서의 제어에 따라 수신된 영상을 전기 신호로 변환하여 인식하고, 사용자의 모션에 대응되는 인식 결과를 이용하여 차량용 전자 장치에서 표시되는 메뉴를 선택하거나 모션 인식 결과에 대응되는 제어를 할 수 있다. 예를 들어, 적 어도 하나의 프로세서는 카메라에서 획득된 인식 결과를 이용하여, FM/DMB에서의 채널 선택, 채널 변경, 볼륨 조정, 이용 가능한 서비스의 실행 등을 제어할 수 있다. 카메라는 차량용 전자 장치와 일체형 또는 분리형으로 구현될 수 있다. 분리된 카메라는 통신 모듈 또는 사용자 인터페이스를 통해 차량용 전자 장치의 적어도 하나의 프로세서와 전기적으로 연결 될 수 있다. 예를 들어, 카메라가 차량용 전자 장치와 분리형으로 구현되는 경우, 카메라는 운전자의 얼굴 및 상체에 대응되는 영상을 촬영할 수 있도록, 운전자의 얼굴 및 상체의 전면에 대응되는 위치에 배치될 수 있 다. 일 실시예에 따르면, 카메라는 차량 내부에 대한 이미지를 촬영할 수 있다. 또한, 카메라 모듈은 복수의 카메라를 포함할 수 있다. 이 경우, 복수의 카메라 각각은 서로 다른 방향에서 차량 내부에 대한 이미지를 촬영 할 수 있다. 마이크는 음성 신호 등과 같은 오디오 신호를 수신할 수 있다. 마이크는 사용자의 음성 신호를 수신하고, 적어 도 하나의 프로세서는 마이크에서 수신된 음성에 대응되는 제어 명령을 인식하여, 그에 대응되는 동작이 실행되도록 제어할 수 있다. 또한, 마이크는 카메라 모듈에 포함되는 형태가 아닌, 별도의 모듈로 차량용 전자 장치 내에 포함될 수도 있다. 사용자 인터페이스는 차량용 전자 장치를 제어하기 위한 사용자 입력을 요청하거나 수신할 수 있다. 사용자 인터페이스는 사용자에게 사용자 입력을 요청하기 위한 디스플레이를 포함할 수 있다. 또한, 사용 자 인터페이스는 사용자의 입력을 수신하기 위한 푸시 버튼, 휠(wheel), 키보드, 조그다이얼, 터치 패널 및 햅 틱(haptic) 센서 등을 포함할 수 있다. 또한, 차량용 전자 장치에 있어서, 포함되는 각 구성들, 예를 들어, 메모리, 통신 모듈, 및 적 어도 하나의 프로세서 상호 간은, 차량 네트워크를 통하여 상호 통신할 수 있다. 또한, 차량용 전자 장치 와 차량 내에 포함되는 다른 구성들 상호간은, 차량 네트워크를 통하여 상호 통신할 수 있다. 여기서, 차 량 네트워크는 CAN(Controller Area Network), 및/또는 MOST(medio Oriented Systems Transport) 등에 따른 네 트워크가 될 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 객체를 탐지하 는 인공지능 모델을 이용하여 제1 이미지에 포함된 적어도 하나의 탑승자를 인식할 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 제1 이미지와 다른 방향으로 차량 내부를 촬영한 제2 이미지를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나 의 인스트럭션을 실행함으로써, 제1 이미지 및 제2 이미지에 기초하여, 적어도 하나의 탑승자와 제1 안테나 사 이의 거리를 획득할 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 복수의 안테나들 중 상기 제1 안테 나를 제외한 나머지 안테나들의 수신 감도를 획득할 수 있다. 상기 제2 안테나는 나머지 안테나들 중 수신 감도 가 가장 높은 안테나일 수 있다.일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 제외한 나머지 안테나 들 각각에 대응하는, 나머지 안테나들 각각과 적어도 하나의 탑승자 사이의 최단 거리를 획득할 수 있다. 상기 제2 안테나는 획득한 최단 거리들 중 가장 긴 거리에 대응하는 안테나일 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 제2 안테나의 수신 감도가 기 설정된 수신 감도 미만인 것에 기초하여, 제2 안테나를 사용하지 않고 제1 안테나를 통하여 외 부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 적어도 하나의 프로세서는 적어도 하 나의 인스트럭션을 실행함으로써, 제1 안테나의 전력을 기 설정된 전력값으로 낮출 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 제2 안테나 사이의 거리를 획득할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션 을 실행함으로써, 적어도 하나의 탑승자와 제2 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제 2 안테나를 사용하지 않고 제1 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 제1 안테나의 전력을 기 설정 된 전력값으로 낮출 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 상태가 유지되는 기간을 측정할 수 있다. 적어도 하 나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 측정된 기간이 기 설정된 기준 기간을 초과하 는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 상기 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 일 실시예에 따르면, 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 안테나 전환을 요청하는 알림을 제 공할 수 있다. 적어도 하나의 프로세서는 적어도 하나의 인스트럭션을 실행함으로써, 안테나 전환 입력을 수신하는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와의 통신을 수행하도록, 통신 모듈을 제어할 수 있다. 도 12를 참조하면, 서버는, 통신 모듈, 및 프로세서를 포함할 수 있다. 또한, 서버는 DB을 더 포함할 수 있다. 통신 모듈은 차량용 전자 장치와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 통신 모듈의 구체적인 구성은, 전술한 통신 모듈의 구성과 동일 대응되므로, 상세한 설명은 생략한다. 예를 들어, 통신 모듈는 인터넷, 3G, 4G, 및/또는 5G 등의 통신 규격에 따르는 통신 네트워크를 통하여 원거리에 위치하는 다른 장치(예를 들어, 차량용 전자 장치)와 통신을 수행하는 적어도 하나의 통신 모듈 을 포함할 수 있다. 프로세서는 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 서버의 적어도 하나의 인스트럭션, 및 프로그램들 중 적어도 하나를 실행함으로써, 요구되는 동작들을 수행할 수 있다. 또한, DB는 메모리(미도시)를 포함할 수 있으며, 메모리(미도시) 내에 서버가 소정 동작을 수행하 기 위해서 필요한 적어도 하나의 인스트럭션, 프로그램, 데이터 중 적어도 하나를 저장할 수 있다. 또한, DB는 서버가 신경망에 따른 연산을 수행하기 위해서 필요한 데이터들을 저장할 수 있다. 구체적으로, 일 실시예에서, 서버는 도 10에서 설명한 신경망을 저장하고 있을 수 있다. 신경망 은 프로세서 및 DB 중 적어도 하나에 저장될 수 있다. 서버가 포함하는 신경망(101 0)은 학습이 완료된 신경망이 될 수 있다. 일 실시예에서, 서버는 내부적으로 포함하는 신경망을 이용하여 이미지에 포함된 적어도 하나의 탑승자에 대한 위치 정보를 획득하고, 획득한 적어도 하나의 탑승자에 대한 위치 정보를 통신 모듈을 통하여 차량 용 전자 기기의 통신 모듈로 전송할 수 있다. 또한, 서버는 학습이 완료된 신경망을 통신 모듈을 통하여 차량용 전자 기기의 통신 모듈 로 전송할 수 있다. 그러면, 차량용 전자 기기는 학습이 완료된 신경망을 획득 및 저장하고, 신경망 을 통하여 목적하는 출력 데이터를 획득할 수 있다.일 실시예에 따르면, 차량용 전자 장치가 차량용 안테나를 제어하는 방법에서, 제1 이미지는 적어도 하나의 탑 승자의 깊이 정보를 포함하는 이미지일 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법에서, 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하 는 단계는, 객체를 탐지하는 인공지능 모델을 이용하여 제1 이미지에 포함된 적어도 하나의 탑승자를 인식하는 단계를 포함할 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법에서, 적어도 하나의 탑승자와 제1 안테나 사이의 거리를 획득하는 단계는, 제1 이미지와 다른 방향으로 차량 내부를 촬영한 제2 이미지를 획득하는 단계를 포함할 수 있 다. 적어도 하나의 탑승자와 제1 안테나 사이의 거리를 획득하는 단계는, 제1 이미지 및 제2 이미지에 기초하여, 적어도 하나의 탑승자와 제1 안테나 사이의 거리를 획득하는 단계를 포함할 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법에서, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신하는 단계는, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 복수의 안테 나들 중 제1 안테나를 제외한 나머지 안테나들의 수신 감도를 획득하는 단계를 포함할 수 있다. 차량용 안테나 를 제어하는 방법에서, 제2 안테나는 나머지 안테나들 중 수신 감도가 가장 높은 안테나일 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법에서, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신하는 단계는, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나 를 제외한 나머지 안테나들 각각에 대응하는, 나머지 안테나들 각각과 적어도 하나의 탑승자 사이의 최단 거리 를 획득하는 단계를 포함할 수 있다. 차량용 안테나를 제어하는 방법에서, 제2 안테나는 획득한 최단 거리들 중 가장 긴 거리에 대응하는 안테나일 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법은, 제2 안테나의 수신 감도가 기 설정된 수신 감도 미만인 것에 기초하여, 제2 안테나를 사용하지 않고 제1 안테나를 통하여 외부 장치와 통신하는 단계를 포함할 수 있다. 차량용 안테나를 제어하는 방법은, 제1 안테나의 전력을 기 설정된 전력값으로 낮추는 단계를 포함할 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법은, 적어도 하나의 탑승자와 제2 안테나 사이의 거리를 획 득하는 단계를 포함할 수 있다. 차량용 안테나를 제어하는 방법은, 적어도 하나의 탑승자와 제2 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제2 안테나를 사용하지 않고 제1 안테나를 통하여 외부 장치와 통신하는 단계를 포함할 수 있다. 차량용 안테나를 제어하는 방법은, 제1 안테나의 전력을 기 설정된 전력값으 로 낮추는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법에서, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신하는 단계는, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 상태가 유지되는 기간을 측 정하는 단계를 포함할 수 있다. 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신하는 단계는, 측정된 기간이 기 설정된 기준 기간을 초과하는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통 신하는 단계를 포함할 수 있다. 일 실시예에 따르면, 차량용 안테나를 제어하는 방법에서, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신하는 단계는, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미만인 것에 기초하여, 안테나 전환 을 요청하는 알림을 제공하는 단계를 포함할 수 있다. 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설 정된 거리 미만인 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치와 통신하는 단계 는, 안테나 전환 입력을 수신하는 것에 기초하여, 제1 안테나를 사용하지 않고 제2 안테나를 통하여 외부 장치 와 통신하는 단계를 포함할 수 있다. 일 실시예에 따르면, 차량용 전자 장치는 차량 내부에 대한 제1 이미지를 획득하고, 제1 이미지에 포함된 적어 도 하나의 탑승자를 인식하고, 적어도 하나의 탑승자와 복수의 안테나들 중 외부 장치와의 통신을 위해 사용 중 인 제1 안테나 사이의 거리를 획득하고, 적어도 하나의 탑승자와 제1 안테나 사이의 거리가 기 설정된 거리 미 만인 것에 기초하여, 제1 안테나를 사용하지 않고, 제2 안테나를 통하여 외부 장치와의 통신을 수행하는 것에기초하여, 적어도 하나의 탑승자가 제1 안테나에 의해 받는 전자파의 영향을 낮출 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2022-0191037", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 차량용 전자 장치가 복수의 안테나들을 제어하는 동작을 나타내는 도면이다. 도 2는 본 개시의 일 실시예에 따른 차량용 전자 장치가 복수의 안테나들을 제어하는 방법을 나타내는 흐름도이 다. 도 3은 본 개시의 일 실시예에 따른 차량용 전자 장치의 구성을 도시한 블록도이다. 도 4는 본 개시의 일 실시예에 따른 차량용 전자 장치 및 차량용 전자 장치에 포함되는 복수의 안테나들의 위치 를 도시한 예시적인 도면이다. 도 5는 본 개시의 일 실시예에 따른 복수의 안테나들의 기 설정된 기준 영역과 적어도 하나의 탑승자들을 나타 내는 도면이다. 도 6은 본 개시의 일 실시예에 따른 차량용 전자 장치가 객체를 탐지하는 인공지능 모델을 통해 적어도 하나의 탑승자를 인식하는 동작을 나타내는 도면이다. 도 7은 본 개시의 일 실시예에 따른 제1 이미지와 다른 방향으로 차량 내부를 촬영한 제2 이미지를 도시한 예시 적인 도면이다. 도 8은 본 개시의 일 실시예에 따른 차량용 전자 장치가 제2 안테나의 수신 감도에 기초하여 복수의 안테나들을 제어하는 방법을 나타내는 흐름도이다. 도 9는 본 개시의 일 실시예에 따른 차량용 전자 장치가 적어도 하나의 탑승자와 제2 안테나 사이의 거리에 기 초하여 복수의 안테나들을 제어하는 방법을 나타내는 흐름도이다.도 10은 본 개시의 일 실시예에서 인공지능 모델을 이용하여 적어도 하나의 탑승자를 인식하는 동작을 설명하기 위한 도면이다. 도 11은 서버와 연동하여 동작하는 본 개시의 일 실시예에 따른 차량용 전자 장치를 나타내는 도면이다. 도 12는 도 11을 상세하게 설명하기 위한 도면이다."}
