{"patent_id": "10-2021-0049392", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0095067", "출원번호": "10-2021-0049392", "발명의 명칭": "인공지능을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 시스템 및 그 방", "출원인": "위정철", "발명자": "위정철"}}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능(AI)을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 시스템에 있어서,보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신하는 수신부; 상기 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 내용 및보험 상담을 검증하는 분석부; 및 분석 결과와 상기 상담 데이터에 포함된 보험소비자 니즈에 따라 보험의 적합성 및 보험의 추가정보를 포함한보장 분석 결과를 제공하는 제공부를 포함하는 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 수신부는보험소비자가 가입한 보험 또는 가입 예정인 보험에 대해, 보험설계사와 상담한 상담 내용, 상담 목적, 보험 가입 과정 및 고지내용과 보험의 보장 내용, 보장 범위, 해지환급금 적립 여부 및 보험의 제한사항을 포함한 상기보험 데이터를 수신하는, 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 분석부는상기 보험 데이터에서 자연어 처리를 통해 키워드를 도출하며, 상기 도출된 키워드와 상기 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 약관 검증, 보험가입 과정의 적합성 검증 및 민원사례 검증을 분석하는, 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제공부는분석 결과를 토대로 보험 가입의 적합성을 확인하며, 민원가능성과 보험 가입에 따른 추가정보를 포함한 상기보장 분석 결과를 제공하는, 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제공부는분석 결과와 상기 상담 데이터에 포함된 보험소비자 니즈를 기반으로, 보험소비자에게 적합한 보장 상품, 보장내용 및 추천 상품을 제공하는 것을 특징으로 하는, 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,금융감독원으로부터 수신된 보험관련 민원사례인 상기 금감원 민원데이터와 보험의 목적, 주계약/특약의 보장및 면책 정보를 포함하는 상기 보험약관 데이터를 저장하여 유지하는 데이터베이스부공개특허 10-2022-0095067-3-를 더 포함하는, 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하며, 선택된 보험설계사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결하는 제어부를 더 포함하는, 보험 분석 시스템."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공지능(AI)을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 방법에 있어서,보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신하는 단계; 상기 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 내용 및보험 상담을 검증하는 단계; 및 분석 결과와 상기 상담 데이터에 포함된 보험소비자 니즈에 따라 보험의 적합성 및 보험의 추가정보를 포함한보장 분석 결과를 제공하는 단계를 포함하는 보험 분석 방법."}
{"patent_id": "10-2021-0049392", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하며, 선택된 보험설계사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결하는 단계를 더 포함하는, 보험 분석 방법."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 시스템 및 그 방법에 관한 것으로서, 보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신하는 수신 부, 상기 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 내용 및 보험 상담을 검증하는 분석부 및 분석 결과와 상기 상담 데이터에 포함된 보험소비자 니즈에 따라 보험의 적 합성 및 보험의 추가정보를 포함한 보장 분석 결과를 제공하는 제공부를 포함하며, 보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하며, 선택된 보험설계사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결 하는 제어부를 더 포함한다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 시스템 및 그 방법에 관 한 것으로서, 보다 상세하게는 보험소비자가 가입한 보험 또는 가입 예정인 보험에 대한 분석 내용을 제공하며, 보험소비자가 선택한 보험설계사와 연결해주는 기술에 관한 것이다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 보험소비자들은 보험 상담 과정에서 다수의 보험설계사를 만나 동시에 진행하는 것이 아니라 한 명 의 보험설계사와 상담을 진행하게 되고, 보험관련 정보획득 또한 의존하게 된다. 이에, 보험소비자는 상담의 내용과 상담을 통해 제안 받은 보험이 자신의 니즈에 적합한지 확인하기 어렵다. 또한, 보험소비자와 보험설계 사의 정보비대칭으로, 보험소비자는 상담 과정에서 보험설계사의 설명이 옳고 적합한지 확인할 수 없으며, 보험 설계사에 의존하게 된다. 보험소비자가 상담 받은 내용이 적합한지, 가입한 보험이 적합한지를 확인할 수 있는 방법은 별도의 시간을 들 여 직접 인터넷 자료들을 검색하거나, 주변의 보험전문가 혹은 다른 보험설계사와의 재상담을 통해야 하였다. 토스, 굿리치, 보닥 및 보맵과 같은 현재 시장에 존재하는 서비스의 경우, 보험소비자가 현재 가입한 보험의 분 석을 중심으로 분석을 진행하는 것으로, 보험소비자가 자신이 가입한 보험에 대해 가지고 있는 인식, 소비자의 니즈에 대해서는 고려하지 않는다. 그러므로, 기존의 서비스들은 자사의 기준에 맞춰 분석 서비스를 제공할 뿐, 실제 보험소비자의 니즈에 맞는 보험 상품을 해지하는 등 소비자 맞춤형 서비스를 제공하지 못한다. 보험소비자가 보험설계사의 정보를 확인할 수 있는 방법은 설계사가 지인인 경우 평소의 인식, 소개받은 경우 주선자의 평가인 경우가 대부분이며, 공식적인 경로로는 보험협회에서 제공하는 이클린보험서비스를 통해 단편적인 정보만을 확인이 가능하다. 또한, 보험소비자가 보험에 대한 상담을 요청할 수 있는 기본 서비스들 예를 들면, 토스, 굿리치, 보맵, 보닥의 경우 보험회사 또는 보험설계사에게 고객의 개인정보를 판매하는 것이 주목적이고, 계약체결이 목적이기 때문에 보험설계사에 대한 정보를 소비자에게 제공하지 않는다. 이에 따라서, 보험소비자는 보험 상담 내용의 신뢰도 를 파악하고, 정상적인 보험 가입을 위해 능력 있는 보험설계사를 만날 수 있는 서비스가 요구된다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 인공지능을 활용하여 보험소비자가 보험상담에 대한 상담내용을 검증하며, 직접 보험설계사의 정보를 확인하여 선택할 수 있도록 한다. 또한, 본 발명의 목적은 보험소비자가 직접 방대한 인터넷 자료를 검색하고, 다른 보험설계사를 찾아 새로운 상 담을 받을 필요 없이 자신이 받은 상담내용이 자신의 니즈에 맞게 진행되었는지 확인할 수 있도록 한다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 인공지능(AI)을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 시스 템에 있어서, 보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신하는 수신부, 상기 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 내용 및 보험 상담을 검증하는 분석부 및 분석 결과와 상기 상담 데이터에 포함된 보험소비자 니즈에 따라 보험 의 적합성 및 보험의 추가정보를 포함한 보장 분석 결과를 제공하는 제공부를 포함한다. 또한, 본 발명의 실시예에 따른 보험 분석 시스템은 금융감독원으로부터 수신된 보험관련 민원사례인 상기 금감 원 민원데이터와 보험의 목적, 주계약/특약의 보장 및 면책 정보를 포함하는 상기 보험약관 데이터를 저장하여 유지하는 데이터베이스부, 및 보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하며, 선택된 보험설계 사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결하는 제어부를 더 포함할 수 있다. 본 발명의 실시예에 따른 인공지능(AI)을 이용하여 보험 내용 분석 및 보험설계사 연계를 위한 보험 분석 방법 에 있어서, 보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신하는 단 계, 상기 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 내용 및 보험 상담을 검증하는 단계 및 분석 결과와 상기 상담 데이터에 포함된 보험소비자 니즈에 따라 보험의 적합 성 및 보험의 추가정보를 포함한 보장 분석 결과를 제공하는 단계를 포함한다. 또한, 본 발명의 실시예에 따른 보험 분석 방법은 보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하 며, 선택된 보험설계사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결하는 단계를 더 포함할 수 있 다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 인공지능을 활용하여 보험소비자가 보험상담에 대한 상담내용을 검증하며, 직접 보 험설계사의 정보를 확인하여 선택할 수 있다. 또한, 본 발명의 실시예에 따르면, 보험소비자가 직접 방대한 인터넷 자료를 검색하고, 다른 보험설계사를 찾아 새로운 상담을 받을 필요 없이 자신이 받은 상담내용이 자신의 니즈에 맞게 진행되었는지 확인할 수 있다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하"}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며, 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적 으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하 게 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예들을 보다 상세하게 설명하고자 한다. 도면 상의 동일한 구성요소에 대해서는 동일한 참조 부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 본 발명의 실시예들은, 오픈 온라인 플랫폼을 통해 인공지능 기술을 활용하여 보험소비자가 보험상담에 대한 상 담내용을 검증하며, 보험소비자와 보험설계사를 연계하는 것을 그 요지로 한다. 본 발명의 오픈 온라인 플랫폼은 모바일 애플리케이션(Application) 또는 인터넷 사이트의 형태이며, 보험소비 자 및 보험설계사는 이를 통해 비대면 서비스를 제공하고, 받을 수 있다. 예를 들면, 본 발명의 실시예들은 오 픈 온라인 플랫폼을 이용하여 보험소비자로부터 보험 데이터를 수신하여 분석하고, 분석 결과와 보험소비자 니 즈에 따라 보험의 적합성 및 추가정보를 포함한 보장 분석 결과를 제공할 수 있다. 또한, 본 발명의 실시예들 은 오픈 온라인 플랫폼을 이용하여 보험소비자에게 보험설계사에 대한 정보를 제공하여 보험설계사를 직접 선택 하도록 서비스를 제공할 수 있다. 이때, 보험소비자는 보험을 가입하거나, 가입 예정인 사용자를 나타내며, 보험설계사는 보험소비자에게 보험 상 품을 설명하며 계약을 도와주는 설계사를 나타낸다. 또한, 보험소비자 및 보험설계사는 소지하고 있는 스마트 폰, 데스크탑 PC, 모바일 단말, PDA, 노트북 및 태블릿 PC 중 적어도 어느 하나의 단말기를 통해 정보를 입력하 고, 본 발명의 실시예에 따른 보험 분석 시스템으로부터 정보를 수신할 수 있다. 이때, 본 발명은 애플리케이 션(Application)을 통해 오픈 온라인 플랫폼을 제공할 수 있으며, 상기 단말기는 터치-감지 영역을 포함하는 스 크린을 통해 소정의 기능 집합의 동작을 수행할 수 있는 터치 스크린 형태의 디스플레이를 포함하는 것일 수 있 고, 하나 이상의 물리적 버튼 또는 가상의 버튼을 포함하는 기기일 수 있으므로 종류 및 형태는 이에 한정되지 않는다. 이하에서는 도 1 내지 도 3을 참조하여 전술한 본 발명의 실시예들에 따른 시스템 및 방법에 대해 상세히 설명 한다. 도 1은 본 발명의 실시예에 따른 보험 분석 시스템의 세부 구성을 블록도로 도시한 것이다. 도 1을 참조하면, 본 발명의 실시예에 따른 보험 분석 시스템은 보험소비자가 가입한 보험 또는 가입 예정인 보 험에 대한 분석 내용을 제공하며, 보험소비자가 선택한 보험설계사와 연결해준다. 이를 위해, 본 발명의 실시예에 따른 보험 분석 시스템은 수신부, 분석부, 제공부 및 제어 부를 포함한다. 수신부는 보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신한다. 수신부는 보험소비자가 가입한 보험 또는 가입 예정인 보험에 대해, 보험설계사와 상담한 상담 내용, 상담 목적, 보험 가입 과정(예를 들면, 자필서명, 녹취서명 여부) 및 고지내용과 보험의 보장 내용, 보장 범위, 해지 환급금 적립 여부 및 보험의 제한사항(예를 들면, 부담보 또는 면책 등)을 포함한 보험 데이터를 수신할 수 있 다. 또한, 수신부는 보험소비자로부터 니즈를 수신할 수 있다. 예를 들면, 보험소비자는 암보험, 연금보 험, 자동차보험과 같은 보험 종류, 갱신형 또는 비갱신형, 해지환급금 여부, 보장일, 보장 범위, 선호하는 보험료 범위와 같은 개인마다 니즈(needs)가 있으며, 수신부는 보험소비자로부터 전술한 니즈를 수신할 수 있 다. 분석부는 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 내용 및 보험 상담을 검증한다. 분석부는 보험 데이터에서 자연어 처리를 통해 키워드를 도출하며, 도출된 키워드와 데이터베이스부 에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 약관 검증, 보험가입 과정의 적합성 검증 및 민원사례 검증을 분석할 수 있다. 예를 들면, 분석부는 인공지능(AI) 기술을 이용하여 자연어 처리를 통 해 도출한 키워드와 보험 약관을 비교하고, 보험가입 과정과 민원사례를 비교하여 상담 과정의 적절성, 불완전 판매여부 등을 확인하여 적정 보험 가입 여부와 함께 보험설계사의 신뢰도를 검증할 수 있다. 데이터베이스부는 금융감독원으로부터 수신된 보험관련 민원사례인 금감원 민원데이터와 보험의 목적, 주 계약/특약의 보장 및 면책 정보를 포함하는 보험약관 데이터를 저장하여 유지한다. 또한, 데이터베이스부(15 0)는 수신부로 수신되는 보험소비자에 관련된 정보를 저장하여 유지할 수 있다. 제공부는 분석 결과와 상담 데이터에 포함된 보험소비자 니즈에 따라 보험의 적합성 및 보험의 추가정보를 포함한 보장 분석 결과를 제공한다. 제공부는 분석 결과를 토대로 보험 가입의 적합성을 확인하며, 민원가능성과 보험 가입에 따른 추가정보를 포함한 보장 분석 결과를 제공할 수 있다. 예를 들면, 분석부는 분석 결과를 토대로 보험가입의 적절성과 함께 민원가능성을 확인하며, 보험소비자가 해당 보험에 대하여 알아야 할 추가정보를 검토할 수 있다. 이에, 제공부는 분석부를 통해 검토된 추가정보와 민원가능성 및 보험 가입의 적합성을 그래프, 이미지, 숫 자 및 코멘트로 보험소비자가 소지하는 단말기 내 애플리케이션 또는 인터넷 사이트에 제공할 수 있다. 또한, 제공부는 분석 결과와 상담 데이터에 포함된 보험소비자 니즈를 기반으로, 보험소비자에게 적합한 보장 상품, 보장 내용 및 추천 상품을 제공할 수 있다. 예를 들면, 분석 결과에서 연금보험, 비갱신형, 2만원 내의 보험료를 선호하는 보험소비자 니즈를 반영하여 보험소비자 맞춤형 보장 상품, 보장 내용의 추천 보험 상 품을 제공할 수 있다. 본 발명의 실시예에 따른 보험 분석 시스템은 금융민원 가능성을 사전에 확인하며, 분석부 및 제공부 를 통한 분석 결과와 보험소비자 니즈를 기반으로 제어부를 통해 보험소비자가 손실을 보기 전에 보 험 계약을 변경 혹은 해지하도록 안내 서비스를 제공함으로써, 금융민원 차단과 보험소비자 보호를 가능하게 할 수 있다. 본 발명의 실시예에 따른 제어부는 보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하며, 선택된 보험설계사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결할 수 있다. 예를 들면, 제어부는 인공지능 기술을 통해 보험설계사의 이전 상담내용을 검증하고, 다른 보험소비자가 직접 작성한 상담 후기를 통하여 보험소비자가 직접 믿을 수 있는 보험설계사를 여러 명 선택하며, 선택한 복수 명의 보험설계사에 대한 이름, 소속, 나이와 보험 경력 및 상담 후기의 정보를 보험소비자에게 제공하여 보험소 비자가 직접 보험설계사를 선택하도록 제공할 수 있다. 이에, 보험소비자는 직접 정보를 확인하여 선택한 보험 설계사를 통해 상담을 진행함으로써, 상담 만족도를 높이고, 금융민원을 방지할 수 있다. 또한, 능력을 갖춘 보험설계사는 본 서비스를 통해 대외적인 신뢰도를 축적하고 신규 고객 창출 가능성을 높일 수 있게 된다. 도 2는 본 발명의 실시예에 따른 보험 분석 시스템과 보험소비자, 보험설계사 및 보험회사 간의 관계를 개념적 으로 설명하기 위해 도시한 것이다. 도 2를 참조하면, 본 발명의 실시예에 따른 보험 분석 시스템은 보험소비자로부터 수신된 보험 데이터 와 데이터베이스에 저장된 보험약관 데이터 및 금감원 데이터를 비교하여 보험 내용 및 보험 상담을 검증하고, 분석 결과와 보험소비자 니즈에 따라 보험의 적합성 및 보험의 추가정보를 포함한 보장 분석 결과를 제공한다. 보험 분석 시스템은 축적된 상담 분석 정보를 바탕으로 인공지능을 통한 비대면 보험 상담 기술을 제공함 으로써, AI 보험 컨설팅 기능을 제공할 수 있다. 또한, 보험 분석 시스템은 보험소비자에게 보험설계사에 관련된 정보를 제공하여 보험소비자 와 보험설계사 간의 연결을 제공하며, 보험소비자에게 보험회사의 상품을 제안함으로써, 광고 효과를 높일 수 있다. 보험소비자는 가입한 보험이나 가입 예정인 보험에 대한 보험 데이터와 함께 상담 및 분석에 따른 일정 금 액을 보험 분석 시스템에 제공하며, 상담에 대한 리뷰 콘텐츠를 등록할 수 있다. 이에, 보험 분석 시스템 은 보험소비자로부터 수신된 보험 데이터를 기반으로 분석 결과를 제공하며, 보험설계사에 대한 정보를 제공한다. 보험설계사는 보험 분석 시스템에 일정 금액의 이용료를 지급하며, 보험 분석 시스템으로부터 보 험소비자를 연계할 수 있다. 보험회사는 보험 분석 시스템에 일정 금액의 광고비를 지급하며, 보험 분석 시스템은 보험회사 의 상품을 보험소비자에게 제안하여 광고 효과를 제공할 수 있다. 도 3은 본 발명의 실시예에 따른 보험 분석 방법의 동작 흐름도를 도시한 것이다. 도 3의 방법은 도 1에 도시된 본 발명의 실시예에 따른 보험 분석 시스템에 의해 수행된다. 도 3을 참조하면, 단계 S310에서, 보험소비자에 의해, 보험설계사를 통한 보험 상담 과정 및 보험 내용의 보험 데이터를 수신한다. 단계 S310은 보험소비자가 가입한 보험 또는 가입 예정인 보험에 대해, 보험설계사와 상담한 상담 내용, 상담 목적, 보험 가입 과정(예를 들면, 자필서명, 논취서명 여부) 및 고지내용과 보험의 보장 내용, 보장 범위, 해지 환급금 적립 여부 및 보험의 제한사항(예를 들면, 부담보 또는 면책 등)을 포함한 보험 데이터를 수신할 수 있 다. 또한, 단계 S310은 보험소비자로부터 니즈를 수신할 수 있다. 예를 들면, 보험소비자는 암보험, 연금보험, 자동차보험과 같은 보험 종류, 갱신형 또는 비갱신형, 해지환급금 여부, 보장일, 보장 범위, 선호하 는 보험료 범위와 같은 개인마다 니즈(needs)가 있으며, 단계 S310은 보험소비자로부터 전술한 니즈를 수신할 수 있다. 단계 S320에서, 보험 데이터와 데이터베이스부에 저장된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보 험 내용 및 보험 상담을 검증한다. 단계 S320은 보험 데이터에서 자연어 처리를 통해 키워드를 도출하며, 도출된 키워드와 데이터베이스부에 저장 된 보험약관 데이터 및 금감원 민원데이터를 비교하여 보험 약관 검증, 보험가입 과정의 적합성 검증 및 민원사 례 검증을 분석할 수 있다. 예를 들면, 단계 S320은 인공지능(AI) 기술을 이용하여 자연어 처리를 통해 도출한 키워드와 보험 약관을 비교하고, 보험가입 과정과 민원사례를 비교하여 상담 과정의 적절성, 불완전판매여부 등 을 확인하여 적정 보험 가입 여부와 함께 보험설계사의 신뢰도를 검증할 수 있다. 이때, 데이터베이스부는 금융감독원으로부터 수신된 보험관련 민원사례인 금감원 민원데이터와 보험의 목적, 주 계약/특약의 보장 및 면책 정보를 포함하는 보험약관 데이터를 저장하여 유지한다. 단계 S330에서, 분석 결과와 상담 데이터에 포함된 보험소비자 니즈에 따라 보험의 적합성 및 보험의 추가정보 를 포함한 보장 분석 결과를 제공한다. 단계 S330은 분석 결과를 토대로 보험 가입의 적합성을 확인하며, 민원가능성과 보험 가입에 따른 추가정보를 포함한 보장 분석 결과를 제공할 수 있다. 예를 들면, 단계 S320은 분석 결과를 토대로 보험가입의 적절성과 함께 민원가능성을 확인하며, 보험소비자가 해당 보험에 대하여 알아야 할 추가정보를 검토할 수 있다. 이에, 단계 S330은 단계 S320을 통해 검토된 추가정보와 민원가능성 및 보험 가입의 적합성을 그래프, 이미지, 숫자 및 코멘트로 보험소비자가 소지하는 단말기 내 애플리케이션 또는 인터넷 사이트에 제공할 수 있다. 또한, 단계 S330은 분석 결과와 상담 데이터에 포함된 보험소비자 니즈를 기반으로, 보험소비자에게 적합한 보 장 상품, 보장 내용 및 추천 상품을 제공할 수 있다. 예를 들면, 분석 결과에서 연금보험, 비갱신형, 2만원 내 의 보험료를 선호하는 보험소비자 니즈를 반영하여 보험소비자 맞춤형 보장 상품, 보장 내용의 추천 보험 상품 을 제공할 수 있다. 본 발명의 실시예에 따른 보험 분석 방법은 보험설계사에 대한 개인 정보 및 보험 경력 데이터를 제공하며, 선 택된 보험설계사로부터 상담이 진행되도록 보험소비자와 보험설계사를 연결하는 단계(미도시)를 더 포함할 수 있다.예를 들면, 상기 연결하는 단계는 인공지능 기술을 통해 보험설계사의 이전 상담내용을 검증하고, 다른 보험소 비자가 직접 작성한 상담 후기를 통하여 보험소비자가 직접 믿을 수 있는 보험설계사를 여러 명 선택하며, 선택 한 복수 명의 보험설계사에 대한 이름, 소속, 나이와 보험 경력 및 상담 후기의 정보를 보험소비자에게 제공하 여 보험소비자가 직접 보험설계사를 선택하도록 제공할 수 있다. 이에, 보험소비자는 직접 정보를 확인하여 선 택한 보험설계사를 통해 상담을 진행함으로써, 상담 만족도를 높이고, 금융민원을 방지할 수 있다. 또한, 능력 을 갖춘 보험설계사는 본 서비스를 통해 대외적인 신뢰도를 축적하고 신규 고객 창출 가능성을 높일 수 있게 된 다. 이상에서 설명된 시스템 또는 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(Field Programmable Gate Array), PLU(programmable logic unit), 마이크로프로세서, 또 는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특 수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는"}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "것으로 설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2021-0049392", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다.그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2021-0049392", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 보험 분석 시스템의 세부 구성을 블록도로 도시한 것이다. 도 2는 본 발명의 실시예에 따른 보험 분석 시스템과 보험소비자, 보험설계사 및 보험회사 간의 관계를 개념적 으로 설명하기 위해 도시한 것이다. 도 3은 본 발명의 실시예에 따른 보험 분석 방법의 동작 흐름도를 도시한 것이다."}
