{"patent_id": "10-2022-0015098", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0118749", "출원번호": "10-2022-0015098", "발명의 명칭": "연료전지 기반의 하이브리드 자율주행 차량", "출원인": "공병진", "발명자": "공병진"}}
{"patent_id": "10-2022-0015098", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수소탱크(110)로부터 공급되는 수소를 이용하여 전기를 생성하는 연료전지(120);상기 연료전지에서 생성된 전기로 충전이 가능한 배터리(210);상기 전기를 공급받아 동력을 발생하는 모터(230);장애물을 감지하는 장애물감지수단(310)과 수소탱크의 온도를 감지하는 온도감지수단(320)이 포함된 센서부(300);상기 센서부로 모터의 동작을 제어하여 자율주행을 수행하는 제어부(410) 및상기 수소탱크의 수소 잔량과 배터리의 전기 잔량을 표시하는 표시부(420)를 포함하고,상기 제어부는 수소탱크의 수소 잔량과 배터리의 전기 잔량을 분석하여 주행가능거리를 연산하고, 표시부를 통하여 주행가능거리를 표시하며,상기 제어부는 수소탱크의 수소 잔량이 설정된 수소기준용량을 초과하면 수소탱크 기반의 수소주행모드로 구동하고, 수소기준용량보다 이하이면 배터리 기반의 전기주행모드로 구동하며, 배터리의 전기 잔량이 설정된 전기기준용량보다 이하이면 표시부를 통하여 충전요청정보를 표시하는 것을 특징으로 하는 연료전지 기반의 하이브리드 자율주행 차량."}
{"patent_id": "10-2022-0015098", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 온도감지수단은,상기 제어부와의 통신을 위한 본체(321);상기 본체에 형성되어 차량외부온도를 감지하는 외부온도감지부(322);상기 수소탱크의 온도를 감지하는 탱크온도감지부(323) 및상기 수소탱크의 열에 의해 본체의 손상을 방지하기 위하여 본체와 소정거리 이격된 탱크온도감지부의 연결을제공하는 안전연결제공부(324)를 포함하고,상기 제어부는 수소주행모드로 주행하는 동안에 본체를 통하여 탱크온도감지부로부터 수소탱크온도값을 수신하고, 수소탱크온도값이 설정된 탱크기준온도를 초과하면 수소주행모드에서 전기주행모드로 변경하며,상기 제어부는 본체를 통하여 외부온도감지부로부터 차량 주변의 외부온도값을 수신하고, 외부온도값이 설정된외부기준온도보다 미만이면 연료전지의 물배출로(121)를 히팅시키는 히팅부(130)를 구동시키는 것을 특징으로하는 연료전지 기반의 하이브리드 자율주행 차량."}
{"patent_id": "10-2022-0015098", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 수소탱크의 수소충전을 위한 수소충전단자부(111) 및 배터리의 전기충전을 위한 전기충전단자부(211)를 더포함하고,상기 수소충전단자부와 전기충전단자부는 소정거리 이격되고, 충전스테이션(20)으로부터 수소 또는 전기를 공급받으며,상기 충전스테이션은 수소를 수소충전단자부에 공급하는 제1 공급부(22), 수소를 이용하여 전기를 발생하는 전기발생부(23) 및 상기 전기발생부의 전기를 전기충전단자부로 공급하는 제2 공급부(24)를 포함하는 것을 특징으공개특허 10-2023-0118749-3-로 하는 연료전지 기반의 하이브리드 자율주행 차량."}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 수소탱크의 수소 잔량이 설정된 수소기준용량을 초과하면 수소탱크 기반의 수소주행모드로 구동하고, 수소기준용량보다 이하이면 배터리 기반의 전기주행모드로 구동하며, 배터리의 전기 잔량이 설정된 전기기준용량 보다 이하이면 표시부를 통하여 충전요청정보를 표시하는 연료전지 기반의 하이브리드 자율주행 차량을 개시한다."}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 연료전지 기반의 하이브리드 자율주행 차량에 관한 것으로서, 더욱 상세하게는 차량의 상태에 대응하 여 수소주행모드와 전기주행모드 중 하나를 선택하고, 선택된 주행모드로 자율주행을 하는 차량에 관한 것이다."}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행은 사람의 조작 없이 교통수단이 인공지능 또는 외부 서버와의 통신에 따라 스스로 운행하는 시스템으 로서, 운전자의 졸음운전 등 부주의를 방지할 수 있고, 운전자의 휴식을 제공할 수 있다. 종래의 자율주행 차량은 전기자동차, 화석연료를 이용한 하이브리드 자동차, 선행기술로 기재된 연료전지를 이 용한 하이브리드 자동차로 구분된다. 하이브리드 자동차는 배터리의 부담을 낮추기 위해 화석연료 또는 수소를 통한 전기를 활용하였다. 최근에는 화석연료의 연소에서 발생하는 이산화탄소가 기후변화 또는 온난화의 주범으로 작용되어 점차적으로 친환경의 연료전지를 이용한 자동차가 발전되고 있는 추세이다. 그러나 종래에는 연료전지를 이용한 하이브리드 자동차에서 차량 상태에 대응하여 주행모드를 자동적으로 변경 하는 기술이 미비한 문제점이 있고, 차량 상태의 이상이 발생하였을 때 자동적으로 이상을 해결하는 기술이 미 비한 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2003-0050139호"}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기 문제점을 해결하기 위하여 본 발명은 수소탱크의 수소 잔량이 설정된 수소기준용량을 초과하면 수소탱크 기반의 수소주행모드로 구동하고, 수소기준용량보다 이하이면 배터리 기반의 전기주행모드로 구동하며, 배터리 의 전기 잔량이 설정된 전기기준용량보다 이하이면 표시부를 통하여 충전요청정보를 표시하는 연료전지 기반의 하이브리드 자율주행 차량을 제공한다."}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 해결하고자 하는 과제를 위한 본 발명의 실시예에 따른 연료전지 기반의 하이브리드 자율주행 차량은, 수소탱크로부터 공급되는 수소를 이용하여 전기를 생성하는 연료전지; 상기 연료전지에서 생성된 전 기로 충전이 가능한 배터리; 상기 전기를 공급받아 동력을 발생하는 모터; 장애물을 감지하는 장애물 감지수단과 수소탱크의 온도를 감지하는 온도감지수단이 포함된 센서부; 상기 센서부로 모터의 동작을 제어하여 자율주행을 수행하는 제어부 및 상기 수소탱크의 수소 잔량과 배터리의 전기 잔량을 표시 하는 표시부를 포함하고, 상기 제어부는 수소탱크의 수소 잔량과 배터리의 전기 잔량을 분석하여 주행가능 거리를 연산하고, 표시부를 통하여 주행가능거리를 표시하며, 상기 제어부는 수소탱크의 수소 잔량이 설정된 수 소기준용량을 초과하면 수소탱크 기반의 수소주행모드로 구동하고, 수소기준용량보다 이하이면 배터리 기반의 전기주행모드로 구동하며, 배터리의 전기 잔량이 설정된 전기기준용량보다 이하이면 표시부를 통하여 충전요청 정보를 표시하는 것을 특징으로 한다. 상기 온도감지수단은, 상기 제어부와의 통신을 위한 본체; 상기 본체에 형성되어 차량외부온도를 감지하는 외부온도감지부; 상기 수소탱크의 온도를 감지하는 탱크온도감지부 및 상기 수소탱크의 열에 의해 본 체의 손상을 방지하기 위하여 본체와 소정거리 이격된 탱크온도감지부의 연결을 제공하는 안전연결제공부를 포함하고, 상기 제어부는 수소주행모드로 주행하는 동안에 본체를 통하여 탱크온도감지부로부터 수소탱크온 도값을 수신하고, 수소탱크온도값이 설정된 탱크기준온도를 초과하면 수소주행모드에서 전기주행모드로 변경하 며, 상기 제어부는 본체를 통하여 외부온도감지부로부터 차량 주변의 외부온도값을 수신하고, 외부온도값이 설 정된 외부기준온도보다 미만이면 연료전지의 물배출로를 히팅시키는 히팅부를 구동시키는 것을 특징 으로 할 수 있다. 상기 수소탱크의 수소충전을 위한 수소충전단자부 및 배터리의 전기충전을 위한 전기충전단자부를 더 포함하고, 상기 수소충전단자부와 전기충전단자부는 소정거리 이격되고, 충전스테이션으로부터 수소 또는 전기를 공급받으며, 상기 충전스테이션은 수소를 수소충전단자부에 공급하는 제1 공급부, 수소를 이용하여 전기를 발생하는 전기발생부 및 상기 전기발생부의 전기를 전기충전단자부로 공급하는 제2 공급부를 포 함하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 수소주행모드와 전기주행모드의 동작 기준을 설정함으로써, 안정적으로 하이브리드 주행 동작을 제공 할 수 있고, 연비효율을 향상시킬 수 있으며, 친환경의 주행 서비스를 제공할 수 있다. 본 발명은 차량의 이상 상태가 발생할 때 능동적으로 주행모드를 변경하는 연료전지 기반의 하이브리드 자율주 행 차량을 제공함으로써, 차량의 이상이 발생하여도 자율주행을 중단하지 않고 자율주행을 수행할 수 있다."}
{"patent_id": "10-2022-0015098", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부 도면들 및 첨부 도면들에 기재된 내용들을 참조하여 본 발명의 실시예를 상세하게 설명하지만, 본 발 명이 실시예에 의해 제한되거나 한정되는 것은 아니다. 도 1은 본 발명의 실시예에 따른 하이브리드 자율주행 차량을 도시한 블록도로서, 하이브리드 자율주행 차량 은 장애물을 감지하고 교통상황을 인식하여 인공지능(artificial intelligence)적으로 자율주행을 수행한다. 인공지능은 인간의 경험과 지식을 바탕으로 문제를 해결하는 능력, 시각 및 음성 인식의 지각 능력, 자연 언어 이해 능력, 자율적으로 움직이는 능력 등을 컴퓨터나 전자 기술로 실현하는 것을 목적으로 하는 기술 영역 등 인간의 생각이나 학습능력을 컴퓨터 프로그램으로 실현한 것이다. 인공 지능의 궁극적인 목표는 사람처럼 생각 하고 행동까지 할 수 있는 기계를 개발하는데 있다. 기계학습(machine learning)은 인공지능의 연구분야 중 하나로, 인간의 학습 능력과 같은 기능을 실현하고자 하 는 기술이다. 기계학습은 지도학습(supervised learning)과 비지도학습(unsupervised learning)으로 구분된다. 지도학습은 학습데이터를 참조하여 학습자의 입력값에 대응하는 출력값을 찾는 방식이고, 비지도학습은 입력값들만 있는 훈 련데이터를 이용하여 입력값들의 규칙성을 찾아 내고, 찾아낸 결과를 출력하여 학습자에게 제공한다. 본 발명은 장애물 감지와 교통상황에 대한 학습데이터를 통한 비지도학습으로 인공지능 기반의 자율주행을 수행 할 수 있다. 하이브리드 주행 차량은 수소탱크, 연료전지, 배터리, 변환기, 모터, 센서부 , 제어부 및 표시부를 포함한다. 도 2는 연료전지의 동작을 도시한 예로서, 수소탱크는 수소를 저장하는 탱크이고, 연료전지는 수소탱 크로부터 공급되는 수소를 이용하여 전기를 생성한다. 수소는 연료전지의 스택(stack)의 음극으로 이동하여 촉매를 통해 산화반응하여 수소이온가 전자로 분해된 다. 분해된 수소이온은 전해질을 통해, 전자는 전선을 통해 양극으로 이동한다. 외부로부터 공급받은 산소와 수 소 및 전자는 양극에서 화학반응을 통해 물과 열을 발생시킨다. 발생된 전기는 모터로 제공되고, 모터 는 전기를 동력에너지로 변환하여 차량이동을 위한 샤프트(미도시)에게 제공한다. 배터리는 연료전지에서 생성된 전기로 충전이 가능하고, 변환기는 전기를 직류-직류 또는 직류-교류 로 변환할 수 있는 수단이다. 센서부는 자율주행에 필요한 센싱값을 생성하고, 제어부는 센싱값을 참조하여 모터의 동작을 제 어하며, 자율주행을 수행한다. 하이브리드 주행 차량은 수소주행모드와 전기주행모드 등 하이브리드 기반의 주행모드를 제공한다. 수소주 행모드는 수소에 의해 발생하는 에너지를 이용하여 주행하는 모드이고, 전기주행모드는 배터리에 충전된 전기를 이용하여 주행하는 모드이다. 수소주행모드는 수소에 의해 발생한 전기를 모터에 공급할 수 있고, 잉여의 전기가 발생하면 배터리 에 충전할 수 있으며, 수소에 의한 전기가 부족하면 배터리의 충전된 전기와 수소에 의한 전기를 함께 모 터로 공급할 수 있다. 도 3은 도 1의 센서부에서 장애물감지수단을 상세하게 도시한 블록도로서, 센서부는 장애물을 감지하는 장 애물감지수단을 포함한다. 장애물감지수단은 카메라, 레이더 및 라이다 중 적어도 하 나를 포함할 수 있다. 카메라는 차량의 전방과 후방에 대하여 시각적인 정보를 생성할 수 있고, 제어부는 카메라에서 생성된 시각적인 정보에서 객체를 추출할 수 있으며, 객체의 분석을 통한 안전운행을 제공할 수 있다. 도 4는 카메라의 동작을 도시한 예로서, 카메라는 초음파 신호를 발생할 수 있고, 제어부는 초음파 신호에 반사되는 신호값을 인식하여 전방에 장애물이 있다고 판단할 수 있고, 장애물을 피하여 우회 주행할 수 있다. 레이더는 전파를 사용하여 근거리 객체를 식별하는데 사용되고, 전파를 쏘아 반사되는 값 등 근거리 정보 를 생성할 수 있다. 제어부는 근거리 정보를 이용하여 객체의 존재 유무와 객체 간 안전거리를 알아낼 수 있다. 라이다는 레이저(빛)을 사용하여 주변의 사물들을 층(채널)별로 나눠서 쏘기 때문에 고해상도로 3차원의 정보를 획득할 수 있다. 라이다는 레이저를 쏴서 주변의 객체에 튕겨서 돌아오는 시간을 계산하여 객체 간 의 거리를 측정할 수 있다. 제어부는 장애물감지수단을 이용하여 안전한 자율주행을 제공할 수 있다. 표시부는 수소탱크의 수소 잔량과 배터리의 전기 잔량을 표시한다. 센서부는 수소탱크 의 수소 잔량과 배터리의 전기 잔량을 감지하는 잔량감지부(미도시)를 더 포함할 수 있다. 제어부는 수소탱크의 수소 잔량과 배터리의 전기 잔량을 분석하여 주행가능거리를 연산하고, 표 시부를 통하여 주행가능거리를 표시한다. 제어부는 수소탱크의 수소 잔량이 설정된 수소기준용량을 초과하면 수소탱크 기반의 수소주행모 드로 구동하고, 수소기준용량보다 이하이면 배터리 기반의 전기주행모드로 구동하며, 배터리의 전기 잔량이 설정된 전기기준용량보다 이하이면 표시부를 통하여 충전요청정보를 표시한다. 수소기준용량과 전 기기준용량은 주행모드를 결정하기 위해 기준이 되는 값이다. 제어부는 GPS를 이용한 현재 위치정보와 전기나 수소 충전을 위한 충전소에 대한 정보를 이용하여 현재 위 치와 가장 가까운 거리 순으로 충전소정보를 생성할 수 있고, 충전소정보를 포함하여 충전요청정보를 표시부 를 통하여 표시할 수 있다.표시부는 터치패트로서 입력 기능을 구비할 수 있고, 사용자의 선택정보를 수신할 수 있다. 예를 들어 목 적지는 전기충전소가 근접하고, 주행모드는 수소주행모드로 주행모드일 때, 사용자는 목적지에서 차량의 전 기충전이 가능하여 수소주행모드에서 전기주행모드로 변경하는 선택정보를 표시부를 통하여 입력한다. 제 어부는 수소주행모드와 전기주행모드의 동작기준보다 선택정보를 우선권으로 하여 수소주행모드에서 전기 주행모드로 변경할 수 있다. 제어부는 수소주행모드와 전기주행모드의 동작기준보다 차량의 이상상태정보를 우선권으로 하여 주행모드 의 변경을 제공할 수 있다. 우선권 순위는 차량의 이상상태정보, 선택정보 및 수소주행모드와 전기주행모드의 동작기준 순이다. 차량의 이상상태정보는 센서부의 온도감지수단으로부터 획득될 수 있다. 도 5는 도 1의 센서부에서 온도감지수단을 상세하게 도시한 블록도로서, 센서부는 수소탱크의 온도를 감지하는 온도감지수단을 포함한다. 온도감지수단은 본체, 외부온도감지부, 탱크온도감지 부 및 안전연결제공부를 포함할 수 있다. 본체는 제어부와의 통신을 제공하고, 외부온도감지부는 본체에 형성되어 차량외부온도를 감지하며, 탱크온도감지부는 수소탱크의 온도를 감지한다. 외부온도감지부는 디지털소자일 수 있고, 탱크온도감지부는 고온에 강인한 열전소자일 수 있다. 안전연결제공부는 수소탱크의 열에 의해 본체의 손상을 방지하기 위하여 본체와 소정거리 이격된 탱크온도감지부의 연결을 제공한다. 안전연결제공부는 내부에 전기적 신호나 전원 신호를 제 공하기 위한 선로가 형성되고, 선로를 하우징하는 보호부재가 형성된다. 보호부재는 열에 강인하거나 방열 효고 가 있는 소재일 수 있다. 제어부는 수소주행모드로 주행하는 동안에 본체를 통하여 탱크온도감지부로부터 수소탱크온도값 을 수신하고, 수소탱크온도값이 설정된 탱크기준온도를 초과하면 수소주행모드에서 전기주행모드로 변경할 수 있다. 탱크기준온도는 주행모드의 변경을 결정하기 위해 사용되는 기준값이고, 차량의 이상상태를 판별하기 위해 사용 되는 기준값이다. 제어부는 수소탱크온도값과 탱크기준온도를 비교하여 차량의 이상상태를 알아낼 수 있고, 차량의 이상상태정보를 표시부를 통하여 표시할 수 있다. 수소탱크은 이상은 예를 들어 수소가 너무 없는 상태에서 수소를 충전받으면 급속도로 온도가 상승된다. 수소탱크는 주행 중에서도 압력변화에 의해 온도가 상승될 수 있다. 연료전지는 물을 배출하기 위한 물배출로를 포함할 수 있고, 하이브리드 자율주행 차량은 히팅부 를 더 포함할 수 있다. 물배출로는 물뿐만 아니라 공기 배출도 가능하다. 히팅부는 물배출로 의 주변에 형성되어 열을 발생한다. 제어부는 본체를 통하여 외부온도감지부로부터 차량 주변의 외부온도값을 수신하고, 외부온도값이 설 정된 외부기준온도보다 미만이면 연료전지의 물배출로를 히팅시키는 히팅부를 구동시킬 수 있다. 외 부기준온도는 배출되는 물의 동결이 될 수 있는 온도이고, 제어부는 동결방지를 위해 히팅부를 구동 시킬 수 있다. 도 6은 도 1의 하이브리드 자율주행 차량에 에너지를 충전시키는 충전스테이션을 도시한 예로서, 하이브리드 자 율주행 차량은 수소탱크의 수소충전을 위한 수소충전단자부 및 배터리의 전기충전을 위한 전기충전단자부를 더 포함할 수 있다. 수소충전단자부와 전기충전단자부는 전기적 안전을 위해 소정거리 이격되고, 충전스테이션으로부 터 수소 또는 전기를 공급받는다. 충전스테이션은 전기와 수소의 충전을 제공하는 충전소이고, 저장부, 제1 공급부, 전기발생부 및 제2 공급부를 포함한다. 저장부는 수소에너지원을 저장하고, 제1 공급부는 수소를 수소충전단자 부에 공급한다. 전기발생부는 수소를 이용하여 전기를 발생하고, 제2 공급부는 전기발생부의 전기를 전기충전단자 부로 공급한다. 본 발명은 전기와 수소의 충전을 제공하는 충전스테이션을 이용하여 하이브리드 자율주행 차량에 전기 와 수소의 충전을 함께 받을 수 있고, 충전 효율을 더욱 향상시킬 수 있다. 도 7은 수소 기반의 전기에너지를 배터리에 제공하는 예로서, 본 발명은 연료전지의 스택 개수가 적어 전 기발생 효율이 낮을 수 있으므로, 수소 기반의 전기에너지를 배터리에 제공할 수 있고, 배터리를 통 하여 모터를 구동시킬 수 있다. 도 8은 수소 기반의 전기에너지를 모터에 제공하는 예로서, 본 발명은 수소탱크는 수소충전기로부터 전기 분해로 생성된 수소를 공급받아 충전할 수 있고, 수소를 연료전지에 공급하여 전기를 발생할 수 있으며, 모터는 연료전지에서 발생한 전기를 공급받아 자율주행에 필요한 동력을 발생할 수 있다. 도 9는 아두이노 제작을 통하여 완성된 연료전지 기반의 하이브리드 자율주행 차량을 도시한 예로서, 본 발명은 연료전지 스택을 1개로 구성하고, 눈을 카메라로 적용하였으며, 아두이노 키트에 자율주행을 위한 코딩을 입력하였다. 본 발명은 연료전지의 스택 개수를 증가하여 주행에 필요한 수소에너지를 획득할 수 있고, 배터리를 센서 부, 제어부 및 표시부 등 전자적 소자에 전기를 공급하는 용도로 사용할 수 있다. 본 발명은 수소주행모드와 전기주행모드의 동작 기준을 설정함으로써, 안정적으로 하이브리드 주행 동작을 제공 할 수 있고, 연비효율을 향상시킬 수 있으며, 친환경의 주행 서비스를 제공할 수 있다. 본 발명은 차량의 이상 상태가 발생할 때 능동적으로 주행모드를 변경하는 연료전지 기반의 하이브리드 자율주 행 차량을 제공함으로써, 차량의 이상이 발생하여도 자율주행을 중단하지 않고 자율주행을 수행할 수 있다. 최근에는 수소충전소를 곳곳에 설치하였으나, 수소충전소의 건설비가 비싸 수소충전소 인프라가 부족한 현실이 고, 상대적으로 전기충전소는 건설비가 수소충전소보다 저렴하여 수소충전소보다 많이 설치되어 있다. 본 발명 은 수소와 전기 충전소의 인프라를 고려하여 연료전지 기반의 하이브리드 자율주행 차량을 제공하는 것이다."}
{"patent_id": "10-2022-0015098", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 하이브리드 자율주행 차량을 도시한 블록도이다. 도 2는 연료전지의 동작을 도시한 예이다. 도 3은 도 1의 센서부에서 장애물감지수단을 상세하게 도시한 블록도이다. 도 4는 카메라의 동작을 도시한 예이다. 도 5는 도 1의 센서부에서 온도감지수단을 상세하게 도시한 블록도이다. 도 6은 도 1의 하이브리드 자율주행 차량에 에너지를 충전시키는 충전스테이션을 도시한 예이다. 도 7은 수소 기반의 전기에너지를 배터리에 제공하는 예이다. 도 8은 수소 기반의 전기에너지를 모터에 제공하는 예이다. 도 9는 아두이노 제작을 통하여 완성된 연료전지 기반의 하이브리드 자율주행 차량을 도시한 예이다."}
