{"patent_id": "10-2020-0070625", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0153822", "출원번호": "10-2020-0070625", "발명의 명칭": "인공지능을 이용한 반응형 게임 서비스 방법 및 시스템", "출원인": "순천대학교 산학협력단", "발명자": "심현"}}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "게임 컨트롤러가 복수개의 센서를 이용하여 사용자의 신체 특징정보 및 동작 패턴을 감지하는 단계;게임 디바이스가 화면에 출력하는 캐릭터를 통해 상기 사용자에게 게임콘텐츠를 제공하고 상기 신체 특징정보및 상기 동작 패턴을 수신하는 단계;상기 게임 디바이스가 상기 동작 패턴을 분석하여 상기 게임콘텐츠에 대한 응답의 정확도를 판단하는 단계; 및상기 게임 디바이스가 인공지능을 통해 상기 신체 특징정보를 학습하여 상기 사용자의 연령을 판단하고 상기 사용자의 연령에 따라 상기 응답의 정확도에 대한 오차범위를 조정하는 단계;를 포함하는 인공지능을 이용한 반응형 게임 서비스 방법."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 신체 특징정보 및 동작 패턴을 감지하는 단계는,상기 게임 컨트롤러가 상기 사용자의 음성을 감지하는 단계를 더 포함하는 인공지능을 이용한 반응형 게임 서비스 방법."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 응답의 정확도를 판단하는 단계는,상기 게임 디바이스가 상기 게임콘텐츠에 매칭된 응답데이터 및 상기 사용자의 동작 패턴을 비교하여 정확도를판단하는 인공지능을 이용한 반응형 게임 서비스 방법."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 오차범위를 보정하는 단계는,상기 게임 디바이스가 상기 신체 특징정보를 토대로 상기 사용자의 연령을 판단하기 위해 복수개의 학습데이터를 수집하여 상기 인공지능을 학습하기 위한 데이터베이스로 구축하는 단계를 포함하는 인공지능을 이용한 반응형 게임 서비스 방법."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 오차범위를 보정하는 단계는,상기 게임 디바이스가 상기 사용자의 연령이 상기 게임콘텐츠에 설정된 연령정보가 낮은 것으로 판단하면 상기오차범위를 증가시키고 상기 사용자의 연령이 상기 게임콘텐츠에 설정된 연령정보보다 높은 것으로 판단하면 상기 오차범위를 감소시키는 인공지능을 이용한 반응형 게임 서비스 방법."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 오차범위를 보정하는 단계는,상기 게임 디바이스가 상기 사용자의 연령이 상기 게임콘텐츠에 설정된 연령정보가 낮은 것으로 판단하면 상기게임콘텐츠의 난이도를 하향하는 단계를 포함하는 인공지능을 이용한 반응형 게임 서비스 방법."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "사용자의 신체 특징정보, 음성 및 게임콘텐츠에 대한 동작 패턴을 감지하는 게임 컨트롤러; 및복수개의 게임콘텐츠 중 특정 게임콘텐츠를 화면에 출력하고 상기 게임 컨트롤러와 무선으로 통신하여 상기 동작 패턴에 대한 정확도를 판단하고, 상기 신체 특징정보 및 음성을 분석하여 상기 정확도에 대한 오차범위를 조공개특허 10-2021-0153822-3-정하는 게임 디바이스;를 포함하는 인공지능을 이용한 반응형 게임 서비스 시스템."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 게임 컨트롤러는 상기 신체 특징정보 및 상기 동작 패턴을 감지하기 위하여 압력센서, 적외선센서 및 가속도센서를 포함하고, 상기 사용자의 음성을 감지하기 위하여 마이크를 포함하는 인공지능을 이용한 반응형 게임서비스 시스템."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 게임 컨트롤러는 상기 사용자가 착용하는 웨어러블 디바이스 또는 상기 사용자가 파지하는 리모컨인 것을특징으로 하는 인공지능을 이용한 반응형 게임 서비스 시스템."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서, 상기 게임 디바이스는 상기 사용자의 연령을 판단하기 위한 인공지능을 포함하고, 상기 신체 특징정보를 토대로상기 사용자의 연령을 판단하기 위해 사전에 복수개의 학습데이터를 이용하여 상기 인공지능을 학습하는 인공지능을 이용한 반응형 게임 서비스 시스템."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,상기 게임 디바이스는 상기 복수개의 게임콘텐츠 및 각 게임콘텐츠에 설정된 연령정보를 저장하는 데이터베이스를 포함하고, 상기 사용자의 연령이 상기 특정 게임콘텐츠에 설정된 연령정보가 낮은 것으로 판단하면 상기 오차범위를 증가시키고 상기 사용자의 연령이 상기 특정 게임콘텐츠에 설정된 연령정보보다 높은 것으로 판단하면상기 오차범위를 감소시키는 인공지능을 이용한 반응형 게임 서비스 시스템."}
{"patent_id": "10-2020-0070625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 7 항에 있어서, 상기 게임 디바이스는 상기 사용자의 연령이 상기 특정 게임콘텐츠에 설정된 연령정보가 낮은 것으로 판단하면상기 특정 게임콘텐츠보다 낮은 연령정보에 매칭된 타 게임콘텐츠를 상기 화면에 출력하는 인공지능을 이용한반응형 게임 서비스 시스템."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 기술은 인공지능을 이용한 반응형 게임 서비스 방법 및 시스템에 관한 것으로, 게임 컨트롤러가 복수개의 센서를 이용하여 사용자의 신체 특징정보 및 동작 패턴을 감지하는 단계; 게임 디바이스가 화면에 출력하는 캐릭 터를 통해 상기 사용자에게 게임콘텐츠를 제공하고 상기 신체 특징정보 및 상기 동작 패턴을 수신하는 단계; 상 기 게임 디바이스가 상기 동작 패턴을 분석하여 상기 게임콘텐츠에 대한 응답의 정확도를 판단하는 단계; 및 상 기 게임 디바이스가 인공지능을 통해 상기 신체 특징정보를 학습하여 상기 사용자의 연령을 판단하고 상기 사용 자의 연령에 따라 상기 응답의 정확도에 대한 오차범위를 조정하는 단계;를 포함한다. 따라서 실시간으로 게임콘 텐츠의 난이도를 조절하여 어린이나 노약자도 게임에 흥미를 가질 수 있도록 하는 효과가 있다."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시된 기술은 인공지능을 이용하여 사용자의 연령 별로 게임콘텐츠를 제공하는 게임 서비스 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "화면에 표시되는 오브젝트에 따라 사용자가 특정한 자세나 제스처를 취하는 형태의 게임 서비스가 이용되고 있 다. 이러한 방식의 게임은 사용자의 자세 또는 제스처를 감지할 수 있는 센서가 장착된 디바이스 및 다양한 게 임콘텐츠를 저장하는 디바이스를 포함한다. 이러한 방식의 게임은 일반적으로 게임을 시작하기 전 사용자가 입력한 값에 따라 게임의 종류나 난이도가 결정 된다. 가령, 리듬게임을 하는 상황을 가정하면 사용자가 게임을 시작하기 전 난이도를 상중하 3개의 단계 중 하 나를 선택하여 게임이 끝날때까지 설정된 난이도로 게임을 진행하게 된다. 이미 해당 게임에 대한 경험이 있거 나 특별히 신체적으로 문제가 없는 일반적인 사용자의 경우에는 이러한 방식이 게임을 이용하는데 큰 문제가 발 생하지는 않는다. 그러나 나이가 어린 아동이나 노약자의 경우에는 게임에 대한 이해도가 낮거나 본인이 선택한난이도대로 끝까지 게임을 하기 어려운 체력조건을 가진 경우가 있다. 따라서, 이러한 문제점을 고려하여 게임 의 난이도를 실시간으로 조절할 필요성이 있다. 한편, 한국등록특허 10-1265051호(발명의 명칭 : 게임 사용자 수준에 따른 NPC AI 제공방법)를 참조하면 사용자 의 게임 능력 수준에 따라 인공지능이 자동으로 게임 내 NPC의 AI를 조절하는 기술이 개시되어 있다. 그러나 이 러한 기술은 실제 사용자의 연령에 대한 정보를 감지하지 않고, 파라미터로 변환된 정보에 따라 NPC의 AI를 조 절하기 때문에 정확도가 다소 떨어지는 문제가 있었다."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 기술은 인공지능을 이용하여 사용자의 연령 별로 게임콘텐츠를 제공하는 게임 서비스 방법 및 시스템을 제공하는데 있다."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 이루기 위하여 개시된 기술의 제 1 측면은 게임 컨트롤러가 복수개의 센서를 이용하여 사 용자의 신체 특징정보 및 동작 패턴을 감지하는 단계, 게임 디바이스가 화면에 출력하는 캐릭터를 통해 상기 사 용자에게 게임콘텐츠를 제공하고 상기 신체 특징정보 및 상기 동작 패턴을 수신하는 단계, 상기 게임 디바이스 가 상기 동작 패턴을 분석하여 상기 게임콘텐츠에 대한 응답의 정확도를 판단하는 단계 및 상기 게임 디바이스 가 인공지능을 통해 상기 신체 특징정보를 학습하여 상기 사용자의 연령을 판단하고 상기 사용자의 연령에 따라 상기 응답의 정확도에 대한 오차범위를 조정하는 단계를 포함하는 인공지능을 이용한 반응형 게임 서비스 방법 을 제공하는데 있다. 상기의 기술적 과제를 이루기 위하여 개시된 기술의 제 2 측면은 사용자의 신체 특징정보, 음성 및 게임콘텐츠 에 대한 동작 패턴을 감지하는 게임 컨트롤러 및 복수개의 게임콘텐츠 중 특정 게임콘텐츠를 화면에 출력하고 상기 게임 컨트롤러와 무선으로 통신하여 상기 동작 패턴에 대한 정확도를 판단하고, 상기 신체 특징정보 및 음 성을 분석하여 상기 정확도에 대한 오차범위를 조정하는 게임 디바이스를 포함하는 인공지능을 이용한 반응형 게임 서비스 시스템을 제공하는데 있다."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 기술의 실시 예들은 다음의 장점들을 포함하는 효과를 가질 수 있다. 다만, 개시된 기술의 실시 예들이 이를 전부 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이해되 어서는 아니 될 것이다. 개시된 기술의 일 실시예에 따르면 인공지능을 이용한 반응형 게임 서비스 방법 및 시스템은 사용자의 연령에 따라 실시간으로 게임콘텐츠의 난이도를 조절하는 효과가 있다. 또한, 사용자의 응답에 대한 오차범위를 조절하여 어린이나 노약자도 게임에 흥미를 가질 수 있도록 하는 효과 가 있다."}
{"patent_id": "10-2020-0070625", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 제 1, 제 2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요소들은 상기 용 어들에 의해 한정되지는 않으며, 단지 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사 하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 한다. 그리고 \"포함한다\" 등의 용어는 설시된 특징, 개수, 단계, 동작, 구성요소, 부분 품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이하에서 설명할 구성부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성 부에 의해 전담되어 수행될 수도 있음은 물론이다. 따라서, 본 명세서를 통해 설명되는 각 구성부들의 존재 여 부는 기능적으로 해석되어야 할 것이다. 도 1은 개시된 기술의 일 실시예에 따른 인공지능을 이용한 반응형 게임 서비스 방법에 대한 순서도이다. 도 1 을 참조하면 인공지능을 이용한 반응형 게임 서비스 방법은 이하의 단계들(S110~S140)을 포함한다. S110 단계에서 게임 컨트롤러는 사용자의 신체 특징정보와 동작 패턴을 감지한다. 사용자의 신체 특징정보는 사 용자의 연령을 감지하기 위해서 사용자의 신체 특정 부위의 크기나 특정 부위에서 감지되는 압력, 힘, 속도 등 을 포함한다. 그리고 동작 패턴은 사용자가 화면을 통해 출력되는 게임콘텐츠에 대한 응답을 표현하기 위한 것으로 예컨대, 화면 내 캐릭터의 동작을 따라하거나 특정 입력을 위한 동작을 의미한다. 게임 컨트롤러는 이러한 정보들을 감지하기 위해서 복수개의 센서를 포함하며, 센서로부터 감지되는 다양한 정보들을 토대로 신체 특징 정보와 동작 패턴을 감지한다. 한편, S110 단계에서 추가적으로 사용자의 음성을 감지할 수도 있다. 음성 또한 사용자의 신체 특징정보를 나타 내는 정보로 감지하는 것이며, 이를 위해 게임 컨트롤러는 사용자의 음성을 감지하기 위한 마이크를 포함할 수 있다. S120 단계에서 게임 디바이스는 게임 컨트롤러에서 감지된 사용자의 신체 특징정보 및 동작 패턴을 수신한다. 게임 컨트롤러와 게임 디바이스는 반응형 게임 시스템을 구성하는 구성요소들로, 서로 유무선 통신 방식을 이용 하여 사전에 페어링된 것일 수 있다. 게임 디바이스는 연결된 방법에 따라 게임 컨트롤러와 통신하여 사용자의 신체 특징정보 및 동작 패턴을 수신한다. 일 실시예로, 게임 컨트롤러 및 게임 디바이스는 블루투스로 페어링되 고 근거리 무선 통신에 따라 사용자의 신체 특징정보 및 동작 패턴을 수신할 수 있다. 한편, 게임 디바이스는 복수개의 게임콘텐츠를 저장하고 있으며, 사용자의 선택에 따라 특정 게임콘텐츠를 화면 을 통해 출력할 수 있다. 게임 디바이스는 기 저장된 복수개의 게임콘텐츠 중 하나를 화면을 통해 출력할 수 있 다. 이때, 화면에 소정의 형상을 가진 캐릭터를 출력하는 것으로 게임콘텐츠를 제공하는 것이 가능하다. 예컨대, 캐릭터의 동작이나 춤을 따라하는 콘텐츠 또는 캐릭터를 통해 제공되는 문제나 퀴즈 등을 콘텐츠로 제 공할 수 있다. 여기에서 캐릭터는 일종의 NPC와 같은 역할을 수행하는 것으로, 사용자의 취향에 따라 다양한 종 류의 캐릭터를 선택할 수 있다. S130 단계에서 게임 디바이스는 게임 컨트롤러에서 수신한 사용자의 동작 패턴을 분석한다. 여기에서 동작 패턴 은 화면을 통해 출력중인 게임콘텐츠에 대한 응답을 의미한다. 사용자는 화면에 출력되는 게임콘텐츠를 눈으로 확인하고 동작을 따라하거나 특정한 입력을 할 수 있다. 일 실시예로, 게임콘텐츠가 O/X 퀴즈라면 사용자는 오 른손을 들어서 O, 왼손을 들어서 X와 같은 동작 패턴을 입력할 수 있다. 이때, 화면이 좌우로 분할되어 오른쪽 에는 O 표시가 출력되고, 왼쪽에는 X 표시가 출력되도록 할 수 있다. 다른 실시예로, 사용자가 캐릭터의 동작을 따라하는 게임이라면, 화면 속 캐릭터가 특정한 동작을 취한 후 일정시간 동안 사용자가 해당 동작을 따라하는 것으로 동작 패턴을 입력할 수 있다. 한편, S130 단계에서 게임 디바이스는 동작 패턴에 따라 게임콘텐츠에 대한 응답의 정확도를 판단한다. 예컨대, O/X 중 정답인 것을 선택하였는지, 캐릭터와 동일한 동작을 취하였는지를 판단할 수 있다. 게임 디바이스는 수 신된 동작 패턴을 분석하여 사용자가 어떤 동작을 취했는지 파악할 수 있으며, 일정 구간 동안 반복되는 동작을하나의 패턴으로 수신하고 이를 분석할 수도 있다. 예컨대, 일정 시간 동안 팔벌려뛰기를 하는 것을 감지하여 정확하게 몇회 수행하였는지는 판단할 수 있다. 여기에서 종래의 체험형 게임에서는 게임을 시작하기 전에 사용자가 직접 게임의 난이도를 결정한다. 가령, 게 임을 처음하는 사용자인 경우에는 캐릭터의 동작을 따라하기 쉽도록 낮은 난이도를 선택하고 게임을 시작할 수 있다. 그러나 신체적으로 덜 발달한 어린이나 게임에 익숙하지 못하거나 어려움을 느끼는 노약자들은 일반 사용 자와 동일한 조건이라면 게임을 제대로 즐길 수 없어서 금방 질리거나 게임에 흥미를 느끼지 못하는 경우가 발 생한다. 개시된 기술에서는 이러한 문제점을 해결하기 위해서 신체 특징정보를 분석하여 사용자의 연령을 판단 하고, 그에 따라 응답의 정확도에 대한 오차범위를 보정하는 것이 가능하다. S140 단계에서 게임 디바이스는 게임 컨트롤러에서 수신한 사용자의 신체 특징정보를 분석하여 사용자의 연령을 판단한다. 일 실시예로, 게임 디바이스는 인공지능을 탑재할 수 있고, 인공지능이 신체 특징정보를 학습하여 사 용자의 연령을 판단하는 것일 수 있다. 게임 디바이스는 사용자의 연령에 따라 응답의 정확도에 대한 오차범위 를 조정한다. 즉, 동작 패턴이 다소 부정확하더라도 사용자의 연령에 따라 오차범위를 조정하여 정답으로 처리 하거나 오답으로 처리할 수 있다. 게임 디바이스는 게임콘텐츠에 매칭된 응답데이터를 저장한다. 복수개의 게임 콘텐츠를 저장하고 있으므로 각 게임콘텐츠에 매칭된 복수개의 응답데이터가 저장되어 있다. 게임 디바이스는 출력중인 특정 게임콘텐츠에 대한 응답데이터와 사용자가 입력한 동작 패턴을 비교한다. 그리고 정답인지 아닌 지를 판단한다. 가령, 움직임에 대한 유사도를 비교하는 알고리즘을 이용하여 정답 여부를 판단할 수 있다. 이 때, 단순히 입력된 동작 패턴만을 분석하는 것이 아니라, 사용자의 신체 특징정보를 고려하여 오차범위를 늘리 거나 좁힘으로써 사용자의 연령대에 알맞은 난이도로 게임콘텐츠를 조절하는 것이 가능하다. 한편, S140 단계에서 게임 디바이스는 사용자의 연령에 따라 응답 정확도에 대한 오차범위를 정정하면 사용자의 동작 패턴이 오차범위 이내인지 판단하여 게임콘텐츠에 대한 응답의 정확도를 판단한다. 일 실시예로, 사용자가 저연령의 어린이라면 응답 정확도에 대한 오차범위를 50%로 늘린 후 다시 사용자의 동작 패턴과 게임콘텐츠에 대한 정답 간의 유사도가 50%를 초과하면 정답으로 간주하고 50% 미만이면 다시 입력하도록 화면을 통해 음성이 나 메시지를 출력할 수 있다. 여기에서 오차범위를 늘리는 것은 사용자가 어린이거나 노약자라서 일반적인 사용 자보다 정확도가 다소 낮은 동작 패턴을 입력하는 경우 게임콘텐츠의 난이도를 너무 어렵게 하지 않도록 일부 부정확하더라도 정답으로 판단할 수 있게끔 범위를 조정하는 것을 의미한다. 반대로, 난이도를 증가시키는 경우 에는 오차범위를 좁게 하여 기 저장된 게임콘텐츠의 정답과 높은 유사도를 갖도록 설정하는 것을 의미한다. 게 임 디바이스에는 각 게임콘텐츠마다 적합한 연령정보가 매칭되어 있다. 게임 디바이스는 인공지능의 학습에 따 라 사용자의 연령이 게임콘텐츠에 설정된 연령정보가 낮은 것으로 판단하면 오차범위를 증가시키고 사용자의 연 령이 게임콘텐츠에 설정된 연령정보보다 높은 것으로 판단하면 오차범위를 감소시킬 수 있다. 한편, 이와 같이 사용자의 연령을 판단하기 위해서 게임 디바이스는 복수개의 학습데이터를 이용한다. S140 단 계에서 게임 디바이스는 인공지능을 학습하기 위하여 복수개의 디바이스를 이용하여 데이터베이스를 구축한다. 게임 디바이스는 사전에 구축된 데이터베이스를 이용하여 인공지능을 훈련시킨다. 그리고 사용자로부터 동작 패 턴이 입력되면 기 훈련된 인공지능을 이용하여 게임콘텐츠에 대한 정답과 동작 패턴 간의 유사도를 판단한다. 도 2는 개시된 기술의 일 실시예에 따른 인공지능을 이용한 반응형 게임 서비스 시스템에 대한 도면이다. 도 2 를 참조하면 시스템은 게임 컨트롤러 및 게임 디바이스를 포함한다. 게임 컨트롤러는 사용자가 손에 쥐거나 신체 일부에 착용한 상태로 게임콘텐츠를 플레이할 수 있는 장치를 의미한다. 예컨대, 사용자가 착용하는 웨어러블 디바이스 또는 손으로 파지할 수 있는 리모컨일 수 있다. 게임 컨트롤러는 사용자의 신체 특정 부위에서 감지되는 정보들을 토대로 사용자의 신체 특징정보 및 동작 패턴 을 감지한다. 이를 위하여 게임 컨트롤러는 신체 특징정보 및 동작 패턴을 감지하기 위한 압력센서, 적외 선센서 및 가속도센서를 포함한다. 게임 컨트롤러는 다른 종류의 센서나 모듈이 탑재될 수도 있다. 가령, 사용자의 음성을 통해 연령을 감지할 수 있도록 마이크를 포함하는 것도 얼마든지 가능하다. 한편, 도 2에 도시된 바와 같이 게임 컨트롤러는 한 쌍으로 구비될 수 있다. 예컨대, 양 손에 파지한 상태로 특 정한 동작이나 제스처를 취하면 왼팔과 오른팔의 움직임을 각각 감지하도록 동작할 수 있다. 물론 하나의 게임 컨트롤러만 이용할 수도 있고 보다 많은 수의 게임 컨트롤러를 신체의 각 부위마다 착용하여 이용하는 것도 가 능하다. 게임 디바이스는 복수개의 게임콘텐츠 중 특정 게임콘텐츠를 화면에 출력한다. 게임 디바이스는 적어 도 하나의 디스플레이를 포함하며 이를 통해 저장된 복수개의 게임콘텐츠 중 특정한 콘텐츠를 출력한다. 일반적으로 사용자의 입력에 따라 선택된 특정한 게임콘텐츠가 출력될 수 있으며 게임 디바이스의 자체적인 기능에 따 라 랜덤하게 출력될 수도 있다. 한편, 게임 디바이스는 복수개의 게임 컨트롤러와 무선으로 통신하여 상기 동작 패턴에 대한 정확도를 판 단한다. 게임 디바이스는 게임 컨트롤러와 다양한 방식의 무선 통신 기술을 이용하여 연결되어 게임 컨트롤러에서 감지된 신체 특징정보와 동작 패턴을 수신한다. 예컨대, 블루투스 페어링을 통해 연결되어 신체 특징정보와 동작 패턴을 수신할 수 있다. 한편, 게임 디바이스는 프로세서, 메모리, 디스플레이 등을 포함하는 컴퓨터 장치일 수 있다. 게임 디바이 스는 프로세서의 제어신호에 따라 메모리에 저장된 복수개의 게임콘텐츠 중 하나를 로딩할 수 있고 이를 디스플레이를 통해 출력할 수 있다. 게임 디바이스는 이러한 프로세서, 메모리 및 디스플레이를 포함하는 일반적인 컴퓨터나 노트북, 태블릿 등의 디바이스를 이용할 수 있고, 필요에 따라 사용자의 스마트폰과 같은 모 바일 디바이스를 이용할 수도 있다. 한편, 게임 디바이스의 프로세서는 사용자의 동작 패턴에 대한 정확도를 판단한다. 그리고 사용자의 신체 특징정보 및 음성을 분석하여 동작 패턴의 정확도에 대한 오차범위를 조정한다. 먼저, 게임 디바이스는 사용자의 신체 특징정보 및 음성을 분석하여 사용자의 연령을 판단할 수 있다. 이를 위 해서 게임 디바이스는 인공지능을 이용할 수 있다. 사전에 훈련된 인공지능을 이용하여 사용자의 신체 특징정보 와 음성을 학습하여 연령을 판단하고 게임콘텐츠를 즐기기에 적합한 연령대인지 판단할 수 있다. 게임 디바이스 는 사용자의 연령을 판단하기 위한 인공지능을 훈련시키기 위해서 사전에 복수개의 학습데이터를 이용하여 데이 터베이스를 구축할 수 있다. 그리고 인공지능의 학습 결과에 따라 사용자의 연령이 게임콘텐츠를 즐기기에 다소 어린 것으로 판단하면 동작 패턴에 대한 정확도를 판단하는데 다소 넓은 오차범위를 적용할 수 있다. 즉, 화면 에 출력하는 게임콘텐츠에 대한 응답으로 다소 부정확한 점이 있어도 어느정도는 정답의 범주로 포함시키는 것 이 가능하다. 가령, 양 팔의 각도가 90도를 이루는 것이 정답인 경우, 연령이 다소 어린 사용자는 70~110도의 범위 안에만 들면 정답으로 판단할 수 있도록 오차범위를 조절할 수 있다. 한편, 게임 디바이스에 구축된 데이터베이스에는 복수개의 게임콘텐츠 및 각 게임콘텐츠에 설정된 연령정보가 저장된다. 이러한 데이터와 학습 결과에 따른 정보를 비교하여 게임 디바이스는 사용자가 게임콘텐츠를 즐기기 적합한 연령인지 아닌지를 판단할 수 있다. 그리고 판단 결과에 따라 동작 패턴의 정확도에 대한 오차범위를 조 절할 수 있다. 한편, 게임 디바이스는 오차범위를 조절하는 것 뿐만 아니라 사용자에게 적합한 게임콘텐츠를 추천하는 것이 가 능하다. 예컨대, 사용자의 연령이 특정 게임콘텐츠에 설정된 연령정보가 낮은 것으로 판단하면 특정 게임콘텐츠 보다 낮은 연령정보에 매칭된 타 게임콘텐츠를 화면에 출력할 수 있다. 이 경우, 게임콘텐츠에 매칭된 연령정보 와 사용자의 연령의 차이가 큰 경우 자동으로 사용자의 연령과 유사한 연령정보에 매칭된 타 게임콘텐츠를 화면 에 출력할 수 있다. 도 3은 사용자가 제어하는 게임 컨트롤러를 나타낸 도면이다. 도 3을 참조하면 게임 컨트롤러는 사용자가 손으 로 파지할 수 있는 형태일 수 있다. 게임 컨트롤러에는 서로 다른 종류의 다수의 센서들이 배치되어 있으며 이 를 이용하여 사용자의 신체 특징정보를 감지할 수 있다. 일 실시예로, 게임 컨트롤러의 손잡이 부분에 배치된 복수개의 압력센서를 이용하여 사용자가 손으로 파지한 부분에서 발생하는 압력을 감지할 수 있다. 이는 사용자 긔 손의 크기를 파악할 수 있는 정보로 활용될 수 있다. 즉, 손의 크기에 따라 매칭된 연령대를 선택함으로써 신체 특징정보를 이용하여 사용자의 연령을 추정하는 것이 가능하다. 이뿐 아니라 압력의 세기를 통해서도 사용 자의 연령을 추정할 수 있으며, 게임 컨트롤러에 구비된 마이크를 이용하여 사용자의 음성을 감지하는 것으로 연령을 추정할 수도 있다. 물론 나이나 성별에 따라 서로 다른 값을 나타내는 다른 종류의 신체 특징정보를 감 지하고 이를 토대로 사용자의 연령을 추정하는 것도 얼마든지 가능하다. 개시된 기술의 일 실시예에 따른 인공지능을 이용한 반응형 게임 서비스 방법 및 시스템은 이해를 돕기 위하여 도면에 도시된 실시 예를 참고로 설명되었으나, 이는 예시적인 것에 불과하며, 당해 분야에서 통상적 지식을 가 진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 개시된 기술 의 진정한 기술적 보호범위는 첨부된 특허청구범위에 의해 정해져야 할 것이다."}
{"patent_id": "10-2020-0070625", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 개시된 기술의 일 실시예에 따른 인공지능을 이용한 반응형 게임 서비스 방법에 대한 순서도이다. 도 2는 개시된 기술의 일 실시예에 따른 인공지능을 이용한 반응형 게임 서비스 시스템에 대한 도면이다. 도 3은 사용자가 제어하는 게임 컨트롤러를 나타낸 도면이다."}
