{"patent_id": "10-2023-0119095", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0036518", "출원번호": "10-2023-0119095", "발명의 명칭": "인테리어 스타일링 서비스 제공 방법 및 장치", "출원인": "주식회사 아키스케치", "발명자": "이주성"}}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인테리어 디자인을 하고자 하는 공간에 대한 도면 데이터를 획득하는 단계;상기 획득된 도면 데이터를 이용하여, 상기 공간에 대한 오버뷰샷(overview shot) 이미지를 생성하는 단계;상기 생성된 오버뷰샷 이미지를 렌더링(rendering) 하여, 상기 공간에 대한 3D 렌더링 이미지를 생성하는 단계;및상기 공간에 적용하고자 하는 인테리어 스타일을 설정받는 단계; 및사전 학습된 스타일 변환 디퓨전(Diffusion) 모델에 상기 생성된 3D 렌더링 이미지와 상기 설정된 인테리어 스타일을 입력하여, 상기 공간에 대한 인테리어 스타일 이미지를 생성하는 단계;를 포함하는 것을 특징으로 하는인테리어 스타일링 서비스 제공 방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 도면 데이터는사용자가 제작한 2차원 또는 3차원 도면 이미지를 나타내는 것을 특징으로 하는 인테리어 스타일링 서비스 제공방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 오버뷰샷 이미지를 생성하는 단계는상기 도면 데이터에 포함된 복수의 공간들 각각에 대해 하나 이상의 카메라 위치 또는 각도가 적용된 오버뷰샷이미지를 생성하여, 복수의 오버뷰샷 이미지들을 구성하는 단계;를 포함하고,상기 복수의 오버뷰샷 이미지들 중에서 상기 렌더링될 오버뷰샷 이미지가 사용자에 의해 선택되는 것을 특징으로 하는 인테리어 스타일링 서비스 제공 방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 복수의 공간들 중 스타일링을 원하는 공간 및 상기 카메라 위치 또는 각도 중 적어도 하나를 사용자로부터선택받는 단계;를 더 포함하는 것을 특징으로 하는 인테리어 스타일링 서비스 제공 방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 3D 렌더링 이미지를 생성하는 단계는3D 렌더링을 위한 클라우드 서버(cloud server)를 통해 수행되는 것을 특징으로 하는 인테리어 스타일링 서비스제공 방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 인테리어 스타일을 설정받는 단계는상기 공간에 대한 룸 타입(room type)과 함께, 복수의 인테리어 스타일들 중 하나를 사용자로부터 선택받는 것을 특징으로 하는 인테리어 스타일링 서비스 제공 방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 인테리어 스타일 이미지를 생성하는 단계는상기 생성된 3D 렌더링 이미지와 상기 사용자로부터 선택된 룸 타입 및 인테리어 스타일을 상기 스타일 변환 디공개특허 10-2025-0036518-3-퓨전 모델에 입력시키는 단계;를 포함하는 것을 특징으로 하는 인테리어 스타일링 서비스 제공 방법."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "하드웨어와 결합되어 제1항 내지 제7항 중 어느 한 항의 방법을 실행시키기 위하여 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "사용자가 제작한 도면 데이터를 획득하는 이미지획득부;상기 획득된 도면 데이터를 이용하여 복수의 공간들 각각에 대한 복수의 오버뷰샷 이미지들을 생성하는 오버뷰샷 이미지 생성부;상기 복수의 오버뷰샷 이미지들 중에서 인테리어 디자인을 하고자 하는 공간에 상응하는 오버뷰샷 이미지를 선택받고, 상기 공간에 적용하고자 하는 인테리어 스타일을 선택받기 위한 사용자 인터페이스부;상기 선택된 오버뷰샷 이미지를 렌더링 하여 해당 공간에 대한 3D 렌더링 이미지를 생성하기 위한 렌더링 처리부; 및사전 학습된 스타일 변환 디퓨전 모델에 상기 생성된 3D 렌더링 이미지와 상기 선택된 인테리어 스타일을 입력하여, 상기 공간에 대한 인테리어 스타일 이미지를 생성하는 스타일 이미지 생성부;를 포함하는 것을 특징으로하는 인테리어 스타일링 서비스 제공 장치."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 오버뷰샷 이미지 생성부는상기 도면 데이터에 포함된 복수의 공간들 각각에 대해 하나 이상의 카메라 위치 또는 각도가 적용된 오버뷰샷이미지를 생성하여 상기 복수의 오버뷰샷 이미지들을 구성하고, 상기 복수의 오버뷰샷 이미지들이 화면에 표시되도록 처리하는 것을 특징으로 하는 인테리어 스타일링 서비스 제공 장치."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 렌더링 처리부는3D 렌더링을 위한 클라우드 서버를 통해 상기 선택된 오버뷰샷 이미지에 대한 렌더링이 수행되도록 하는 것을특징으로 하는 인테리어 스타일링 서비스 제공 장치."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 사용자 인터페이스부는상기 공간에 대한 룸 타입과 함께, 복수의 인테리어 스타일들 중 하나를 사용자로부터 선택받는 것을 특징으로하는 인테리어 스타일링 서비스 제공 장치."}
{"patent_id": "10-2023-0119095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 스타일 이미지 생성부는상기 생성된 3D 렌더링 이미지와 사용자로부터 선택된 상기 룸 타입 및 인테리어 스타일을 상기 스타일 변환 디퓨전 모델에 입력시키는 것을 특징으로 하는 인테리어 스타일링 서비스 제공 장치."}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인테리어 스타일링 서비스 제공 방법 및 장치에 관한 것으로, 그 방법은 인테리어 디자인을 하고자 하 는 공간에 대한 도면 데이터를 획득하는 단계; 도면 데이터를 이용하여 공간에 대한 오버뷰샷 이미지를 생성하는 단계; 오버뷰샷 이미지를 렌더링 하여 공간에 대한 3D 렌더링 이미지를 생성하는 단계; 및 공간에 적용하고자 하 는 인테리어 스타일을 설정받는 단계; 및 사전 학습된 스타일 변환 디퓨전 모델에 3D 렌더링 이미지와 인테리어 스타일을 입력하여 공간에 대한 인테리어 스타일 이미지를 생성하는 단계;를 포함한다."}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인테리어 스타일링 서비스 제공 방법 및 장치에 관한 것으로, 보다 구체적으로는 스타일 변환을 위한 디퓨전(Diffusion) 모델을 이용하여 사용자가 원하는 인테리어 스타일이 적용된 다양한 이미지들을 생성할 수 있도록 하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 건축물의 도면 설계 작업시에는 퍼스널컴퓨터나 노트북 컴퓨터 등에 CAD 프로그램을 설치하고, 마우 스나 타블렛 같은 장치를 이용하여 도면을 작성하고, 결과물을 산출한다. 그러나 사회가 산업 사회에서 정보화 사회로 발전하면서, 도면이 아닌 3차원 모델링 결과물 자체를 사용자 체험 형식으로 보다 쉽게 사용자에게 제공하여 견본주택 등의 기능을 대체할 수 있는 가상현실 기술들이 대두되고 있 다. 예를 들어, 건축물 실내(주택, 아파트, 사무실, 병원, 교회 등등)의 가상 투어(virtual tour), 인테리어 또는 가구배치 시뮬레이션(또는 실내 시뮬레이션)의 목적으로 VR(Virtual Reality) 또는 AR(Augmented Reality)가 생성되고, 사용자에게 이에 기반한 환경 및 상황 등을 모의로 제공하고 상호작용하도록 하는 다양한 방식들이 제안되고 있다. 이를 위해, 미리 수작업이나 3D 스캐너로 건물이나 실내 구조의 3차원 데이터를 생성하고, 이에 기반한 가상 현 실을 제공하는 방식 등이 이용될 수 있다. 그러나 이 방식의 경우에는 스캔 정보 또는 도면 등으로부터의 추정 에 의한 3차원 건축 모델링 과정을 필요로 하여, 제작의 어려움이 있을 뿐만 아니라, 데이터 처리의 한계 및 수 작업의 한계로 인해 그 정확도가 떨어지는 문제점이 있다. 또한, 사용자가 임의로 실내 구조상에 배치되는 가구나 물건들을 통해 인테리어를 설계고자 하는 경우, 3차원 공간상에 이를 정밀하게 설치하고 조화롭게 배치하여야 하나, 이러한 작업은 전문적인 3D 디자이너가 아닌 이상 매우 어려운 실정이다. 따라서, 현재의 기술만으로는 현실적으로 건축물의 실내 정보와 인테리어를 구조화하여 생성하는데 있어서 전문 적 인력이 필요하며, 그 시간과 비용이 과도하게 소요되고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제2021-0083573호 (공개일자: 2021년 07월 07일)"}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 바와 같은 문제점을 해결하고자 안출된 것으로, 인공지능을 기반으로 사용자가 제작한 도면으 로부터 인테리어 디자인을 위한 다양한 스타일이 적용된 이미지들을 생성하기 위한 서비스를 제공하는데 그 목 적이 있다."}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 과제를 해결하기 위한 본 발명의 실시 예에 따른 인테리어 스타일링 서비스 제공 방법은, 인 테리어 디자인을 하고자 하는 공간에 대한 도면 데이터를 획득하는 단계; 상기 획득된 도면 데이터를 이용하여, 상기 공간에 대한 오버뷰샷(overview shot) 이미지를 생성하는 단계; 상기 생성된 오버뷰샷 이미지를 렌더링 (rendering) 하여, 상기 공간에 대한 3D 렌더링 이미지를 생성하는 단계; 및 상기 공간에 적용하고자 하는 인테 리어 스타일을 설정받는 단계; 및 사전 학습된 스타일 변환 디퓨전(Diffusion) 모델에 상기 생성된 3D 렌더링 이미지와 상기 설정된 인테리어 스타일을 입력하여, 상기 공간에 대한 인테리어 스타일 이미지를 생성하는 단계;를 포함한다. 또한, 하드웨어와 결합되어 상기 인테리어 스타일링 서비스 제공 방법을 실행시키기 위하여 컴퓨터 판독 가능한 기록매체에 저장된 컴퓨터 프로그램이 제공될 수 있다. 한편, 상기한 바와 같은 과제를 해결하기 위한 본 발명의 실시 예에 따른 인테리어 스타일링 서비스 제공 장치 는, 사용자가 제작한 도면 데이터를 획득하는 이미지획득부; 상기 획득된 도면 데이터를 이용하여 복수의 공간 들 각각에 대한 복수의 오버뷰샷 이미지들을 생성하는 오버뷰샷 이미지 생성부; 상기 복수의 오버뷰샷 이미지들중에서 인테리어 디자인을 하고자 하는 공간에 상응하는 오버뷰샷 이미지를 선택받고, 상기 공간에 적용하고자 하는 인테리어 스타일을 선택받기 위한 사용자 인터페이스부; 상기 선택된 오버뷰샷 이미지를 렌더링 하여 해당 공간에 대한 3D 렌더링 이미지를 생성하기 위한 렌더링 처리부; 및 사전 학습된 스타일 변환 디퓨전 모델에 상 기 생성된 3D 렌더링 이미지와 상기 선택된 인테리어 스타일을 입력하여, 상기 공간에 대한 인테리어 스타일 이 미지를 생성하는 스타일 이미지 생성부;를 포함한다. 그리고 상기 인테리어 스타일링 서비스 제공 방법 중 적어도 일부 단계는 컴퓨터에서 실행시키기 위한 프로그램 을 기록한 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있으며, 프로그램 그 자체로 제공될 수 있다."}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 사전 학습된 멀티-모달 디퓨전 모델을 이용해 인테리어 디자인을 하고자하는 공간 에 대한 사진 이미지를 기반으로 인테리어 디자인이 적용된 인테리어 스타일 이미지를 자동 생성하여, 사용자가 사진을 촬영하여 업로드하기만 하면 자신의 공간에 적합한 다양한 스타일의 인테리어 디자인을 확인할 수 있도 록 한다. 본 발명의 다른 실시예에 따르면, 고객이 선택한 인테리어 스타일 이미지에서 가구 이미지를 추출하여 그와 유 사하거나 잘 어울리는 가구 제품을 추천함으로써, 사용자의 편의성을 향상시킬 수 있다. 본 발명의 또 다른 실시예에 따르면, 인테리어 디자인을 하고자 하는 공간에 대한 도면 데이터를 이용해 가상의 카메라 위치를 기준으로 하는 해당 공간에 대한 사진 이미지를 생성하고, 이와 같이 생성된 저화질의 렌더링되 지 않은 사진 이미지를 이용해 하나 이상의 가구가 배치된 고화질의 공간 가구 이미지를 생성할 수 있도록 함으 로써, 사용자가 공간을 직접 촬영할 수 없는 상황에서도 자신의 공간에 적합한 다양한 스타일의 인테리어 디자 인을 제공할 수 있다. 본 발명의 또 다른 실시예에 따르면, 사용자가 제작한 도면으로부터 인테리어 스타일링에 적합한 오버뷰샷 이미 지를 기계 학습 모델을 이용해 생성하고, 렌더링된 오버뷰샷 이미지와 사용자가 선택한 인테리어 스타일을 사전 학습된 스타일 변환 디퓨전 모델의 입력으로 사용해 다양한 인테리어 스타일 이미지들을 생성할 수 있도록 함으 로써, 사용자가 제작 중인 인테리어 도면에 다양한 스타일의 인테리어 디자인들을 적용할 수 있도록 한다."}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 내용은 단지 본 발명의 원리를 예시한다. 그러므로 당업자는 비록 본 명세서에 명확히 설명되거나 도시 되지 않았지만 본 발명의 원리를 구현하고 본 발명의 개념과 범위에 포함된 다양한 장치를 발명할 수 있는 것이다. 또한, 본 명세서에 열거된 모든 조건부 용어 및 실시예들은 원칙적으로, 본 발명의 개념이 이해되도록 하기위한 목적으로만 명백히 의도되고, 이와 같이 특별히 열거된 실시예들 및 상태들에 제한적이지 않는 것으로 이 해되어야 한다. 또한, 본 발명의 원리, 관점 및 실시예들 뿐만 아니라 특정 실시예를 열거하는 모든 상세한 설명은 이러한 사항 의 구조적 및 기능적 균등물을 포함하도록 의도되는 것으로 이해되어야 한다. 또한 이러한 균등물들은 현재 공 지된 균등물뿐만 아니라 장래에 개발될 균등물 즉 구조와 무관하게 동일한 기능을 수행하도록 발명된 모든 소자 를 포함하는 것으로 이해되어야 한다. 따라서, 예를 들어, 본 명세서의 블럭도는 본 발명의 원리를 구체화하는 예시적인 회로의 개념적인 관점을 나타 내는 것으로 이해되어야 한다. 이와 유사하게, 모든 흐름도, 상태 변환도, 의사 코드 등은 컴퓨터가 판독 가능 한 매체에 실질적으로 나타낼 수 있고 컴퓨터 또는 프로세서가 명백히 도시되었는지 여부를 불문하고 컴퓨터 또 는 프로세서에 의해 수행되는 다양한 프로세스를 나타내는 것으로 이해되어야 한다. 프로세서 또는 이와 유사한 개념으로 표시된 기능 블럭을 포함하는 도면에 도시된 다양한 소자의 기능은 전용 하드웨어뿐만 아니라 적절한 소프트웨어와 관련하여 소프트웨어를 실행할 능력을 가진 하드웨어의 사용으로 제 공될 수 있다. 프로세서에 의해 제공될 때, 상기 기능은 단일 전용 프로세서, 단일 공유 프로세서 또는 복수의 개별적 프로세서에 의해 제공될 수 있고, 이들 중 일부는 공유될 수 있다. 또한 프로세서, 제어 또는 이와 유사한 개념으로 제시되는 용어의 명확한 사용은 소프트웨어를 실행할 능력을 가진 하드웨어를 배타적으로 인용하여 해석되어서는 아니되고, 제한 없이 디지털 신호 프로세서(DSP) 하드웨어, 소프트웨어를 저장하기 위한 롬(ROM), 램(RAM) 및 비 휘발성 메모리를 암시적으로 포함하는 것으로 이해되어야 한다. 주지관용의 다른 하드웨어도 포함될 수 있다. 본 명세서의 청구범위에서, 상세한 설명에 기재된 기능을 수행하기 위한 수단으로 표현된 구성요소는 예를 들어 상기 기능을 수행하는 회로 소자의 조합 또는 펌웨어/마이크로 코드 등을 포함하는 모든 형식의 소프트웨어를 포함하는 기능을 수행하는 모든 방법을 포함하는 것으로 의도되었으며, 상기 기능을 수행하도록 상기 소프트웨 어를 실행하기 위한 적절한 회로와 결합된다. 이러한 청구범위에 의해 정의되는 본 발명은 다양하게 열거된 수 단에 의해 제공되는 기능들이 결합되고 청구항이 요구하는 방식과 결합되기 때문에 상기 기능을 제공할 수 있는 어떠한 수단도 본 명세서로부터 파악되는 것과 균등한 것으로 이해되어야 한다. 상술한 목적, 특징 및 장점은 첨부된 도면과 관련한 다음의 상세한 설명을 통하여 보다 분명해질 것이며, 그에"}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있 을 것이다. 또한, 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 도 1은 본 발명의 일실시예에 따른 이미지 기반 인테리어 스타일 생성 장치의 구성을 블록도로 도시한 것으로, 도시된 이미지 기반 인테리어 스타일 생성 장치는 이미지획득부, 프롬프트생성부, 타입설정부 , 제1 이미지생성부, 이미지정보추출부 및 제2 이미지생성부를 포함하여 구성될 수 있다. 도 1을 참조하면, 이미지획득부는 인테리어 디자인을 하고자 하는 공간에 대한 사진 이미지를 획득한다. 예를 들어, 본 발명의 일실시예에 따른 이미지 기반 인테리어 스타일 생성 장치가 서버로 구성되는 경우, 사용자는 인테리어 디자인을 하고자 하는 방의 사진을 촬영하여 웹 또는 모바일 애플리케이션 서비스를 이용해 서버로 업로드할 수 있다. 프롬프트생성부는 하나 이상의 가구 카테고리에 대응되는 입력 프롬프트를 생성하며, 타입설정부는 이미지획득부를 통해 획득된 사진 이미지에 대응되는 공간 타입을 설정한다. 예를 들어, 사용자는 자신이 촬영한 방 사진을 업로드한 후, 해당 방의 타입을 선택하거나 입력할 수 있다. 한편, 입력 프롬프트가 생성되는 하나 이상의 가구 카테고리는, 타입설정부를 통해 설정된 공간 타입에 기 반하여 추천되거나, 또는 사용자로부터 입력될 수 있다. 여기서, 입력 프롬프트는 이미지를 생성하기 위해 입력되는 문자(text)를 의미하는 것으로, 입력 프롬프트가 문 자-이미지(text-to-image) 인공지능 모델에 입력되면 해당 문자를 기반으로 이미지가 생성될 수 있다. 제1 이미지생성부는 이미지획득부를 통해 획득된 사진 이미지와 프롬프트생성부를 통해 생성된 입력 프롬프트를 이용하여, 해당 공간에 하나 이상의 가구가 배치된 공간 가구 이미지를 생성한다.본 발명의 일실시예에 따르면, 제1 이미지생성부는 사전 학습된 멀티-모달 디퓨전(Multi-Modal Diffusion) 모델에 사진 이미지와 입력 프롬프트를 입력하여 공간 가구 이미지를 생성할 수 있다. 예를 들어, 멀티-모달 디퓨전 모델로서, Stability AI에서 오픈소스 라이선스로 배포한 이미지 생성형 인공지능 (AI) 모델인 Stable Diffusion이 사용될 수 있으나, 본 발명은 이에 한정되지는 아니한다. Stable Diffusion은, 이미지를 입력하여 해당 이미지를 기반으로 이미지를 생성하는 이미지-이미지(image-to- image) 방식과, 문자를 입력하여 해당 문자를 기반으로 이미지를 생성하는 문자-이미지(text-to-image) 방식을 지원할 수 있다. 문자-이미지(text-to-image) 방식에서 입력되는 문자를 프롬프트(prompt)라고 하며, 프롬프트는 생성할 이미지 에 반영하고자 하는 여러가지 속성들을 짧은 어구로 입력하는데, 프롬프트를 얼마나 잘 입력하느냐에 따라 자신 이 원하는 이미지와 가까운 이미지가 생성될 확률이 높아질 수 있다. 한편, Stable Diffusion은 CLIP, UNet, VAE(Variational Auto Encoder, 자기부호화기)이라는 세 가지 인공신경 망으로 이루어져 있다. 사용자가 문자를 입력하면 텍스트 인코더(CLIP)가 유저의 텍스트를 토큰(Token)이라는 UNet이 알아들을 수 있는 언어로 변환하고, UNet은 토큰을 기반으로 무작위로 생성된 노이즈를 디노이징하는 방 식이다. 디노이징을 반복하다 보면 제대로 된 이미지가 생성되며, 이 이미지를 픽셀로 변환하는 것이 VAE의 역 할이다. 해상도가 높아질수록 자원(resource)을 기하급수적으로 사용하게 되는 종전의 확산 확률 이미지 생성 모델과 달 리, 앞뒤에 오토인코더를 도입하여 이미지 전체가 아닌 훨씬 작은 차원의 잠재 공간(latent space)에서 노이즈 를 삽입 및 제거하므로, 비교적 큰 해상도의 이미지를 생성하는데도 자원 사용량을 대폭 줄여 일반 가정의 그래 픽카드 정도로도 이용이 가능해진 것이 특징이다. 이미지정보추출부는 제1 이미지생성부를 통해 생성된 공간 가구 이미지로부터 해당 공간에 대한 구조 정보를 추출하여 공간 구조 이미지를 생성한다. 예를 들어, 이미지정보추출부는 공간 가구 이미지에서 직선(line)을 추출하는 영상 처리 알고리즘을 이용 해 방의 구조 및 골격에 대한 정보를 추출하여, 방의 구조 및 골격이 나타나 있는 공간 구조 이미지를 생성할 수 있다. 한편, 이미지정보추출부는 제1 이미지생성부를 통해 생성된 공간 가구 이미지 내의 깊이 정보를 추출 하여, 깊이 정보 이미지를 추가로 생성할 수 있다. 제2 이미지생성부는 이미지정보추출부를 통해 생성된 공간 구조 이미지와 프롬프트생성부를 통 해 생성된 입력 프롬프트를 이용하여, 해당 공간에 인테리어 디자인이 적용된 인테리어 스타일 이미지를 생성한 다. 본 발명의 일실시예에 따르면, 제2 이미지생성부는, 렌더링 이미지 데이터 세트를 이용해 사전 학습된 멀 티-모달 디퓨전 모델에 상기 생성된 공간 구조 이미지를 입력하여, 서로 다른 인테리어 디자인 스타일을 가지는 복수의 인테리어 스타일 이미지들을 생성할 수 있다. 한편, 제2 이미지생성부는 공간 가구 이미지로부터 추출된 깊이 정보 이미지를 공간 구조 이미지와 함께 멀티-모달 디퓨전 모델에 입력하여, 보다 다양한 인테리어 스타일 이미지들을 생성할 수도 있다. 상기한 바와 같이 생성된 복수의 인테리어 스타일 이미지들은 사용자 단말기로 제공되며, 사용자는 단말기를 통 해 복수의 인테리어 스타일 이미지들을 확인한 후 자신이 원하는 인테리어 디자인 스타일을 가지는 이미지를 선 택할 수 있다. 상기한 바와 같은 본 발명의 실시예에 따르면, 사전 학습된 멀티-모달 디퓨전 모델을 이용해 인테리어 디자인을 하고자하는 공간에 대한 사진 이미지를 기반으로 인테리어 디자인이 적용된 인테리어 스타일 이미지를 자동 생 성하여, 사용자가 사진을 촬영하여 업로드하기만 하면 자신의 공간에 적합한 다양한 스타일의 인테리어 디자인 을 확인할 수 있도록 한다. 이하, 도 2 내지 도 13을 참조하여, 본 발명에 따른 이미지 기반 인테리어 스타일 생성 방법에 대한 실시예들을 상세히 설명하기로 한다. 도 2는 본 발명의 일실시예에 따른 이미지 기반 인테리어 스타일 생성 방법을 흐름도로 도시한 것으로, 도 1을 참조하여 설명한 바와 같은 이미지 기반 인테리어 스타일 생성 장치에서 수행되는 방법을 나타낸 것이다. 도 2를 참조하면, 이미지 기반 인테리어 스타일 생성 장치는 인테리어 디자인을 하고자 하는 공간에 대한 사진 이미지를 획득한다(S200 단계). S200 단계에서 획득되는 사진 이미지는 인테리어 디자인을 하고자하는 방의 사진을 사용자가 촬영하여 업로드한 이미지일 수 있으며, 도 3은 사용자가 웹 서비스 또는 애플리케이션을 통해 업로드한 사진 이미지에 대한 일예 를 나타낸 것이다. 사용자는 방 사진을 촬영하여 업로드한 후 해당 방의 타입을 선택할 수 있으며, 사용자가 선택된 방 타입에 따 라 사진 이미지에 대응되는 공간 타입이 설정될 수 있다. 예를 들어, 도 4에 도시된 바와 같이, 사용자는 복수의 방 타입들 중에서 자신이 업로드한 사진의 방 타입을 선 택할 수 있다. 그 후, 이미지 기반 인테리어 스타일 생성 장치는 하나 이상의 가구 카테고리에 대응되는 입력 프롬프트 (prompt)를 생성한다(S210 단계). 예를 들어, 도 5에 도시된 바와 같이, 사용자가 프롬프트 자동 생성(auto)을 선택하면, 설정된 공간 타입(방 타 입)에 기반해 그에 적합한 복수의 가구 카테고리들이 추천되어, 해당 가구 카테고리들 각각에 대응되는 프롬프 트가 자동 생성될 수 있다. 한편, 도 6에 도시된 바와 같이, 사용자는 프롬프트 수동 생성(manual)을 선택하고, 복수의 가구 카테고리들을 직접 입력하여 그에 대응되는 프롬프트가 생성되도록 할 수 있다. 이미지 기반 인테리어 스타일 생성 장치는, S200 단계에서 획득된 사진 이미지와 S210 단계에서 생성된 입 력 프롬프트를 이용하여, 인테리어 디자인을 하고자 하는 공간에 하나 이상의 가구가 배치된 공간 가구 이미지 를 생성한다(S220 단계). 상기한 바와 같이, S210 단계에서 생성된 입력 프롬프트를 사전 학습된 멀티-모달 디퓨전 모델에 입력하여 공간 가구 이미지가 생성될 수 있다. 예를 들어, 사전 학습된 멀티-모달 디퓨전 모델에 사용자가 업로드한 방 사진과 함께 가구 카테고리들에 대응되 도록 생성된 프롬프트가 입력되면, 도 7에 도시된 바와 같이, 해당 방의 공간에 적절한 가구들이 추가된 공간 가구 이미지가 생성될 수 있다. 한편, 사전 학습된 멀티-모달 디퓨전 모델에 입력되는 프롬프트에는, 사용자로부터 입력된 방 타입이 추가될 수 있다. 그 후, 이미지 기반 인테리어 스타일 생성 장치는 S220 단계에서 생성된 공간 가구 이미지로부터 해당 공 간에 대한 구조 정보를 추출하여 공간 구조 이미지를 생성한다(S230 단계). 예를 들어, 공간 가구 이미지로부터 직선(line)을 검출함으로써, 도 8에 도시된 바와 같이, 해당 공간의 구조 및 골격을 나타내는 공간 구조 이미지가 생성될 수 있다. 또한, 공간 가구 이미지 내의 깊이 정보가 추출되어 깊이 정보 이미지가 추가로 생성될 수 있으며, 도 9에 도시 된 바와 같이, 깊이 정보 이미지는 공간 가구 이미지에서 해당 공간에 배치된 가구들에 대한 정보를 적어도 일 부 포함할 수 있다. 이미지 기반 인테리어 스타일 생성 장치는 S230 단계에서 생성된 공간 구조 이미지와 S210 단계에서 생성 된 입력 프롬프트를 이용하여, 해당 공간에 인테리어 디자인이 적용된 인테리어 스타일 이미지를 생성한다(S240 단계). 상기한 바와 같이, S230 단계에서 생성된 공간 구조 이미지를 사전 학습된 멀티-모달 디퓨전 모델에 입력하여, 서로 다른 인테리어 디자인 스타일을 가지는 복수의 인테리어 스타일 이미지들이 생성될 수 있다. 여기서, 인테리어 스타일 이미지를 생성하기 위해 사용되는 멀티-모달 디퓨전 모델은 렌더링 이미지 데이터 세 트를 이용해 사전 학습된 것일 수 있으며, 렌더링 이미지 데이터 세트는 서로 다른 인테리어 디자인 스타일을 가지도록 렌더링된 복수의 인테리어 디자인 이미지들을 포함할 수 있다. 즉, 멀티-모달 디퓨전 모델을 렌더링 이미지 데이터 세트를 이용해 사전 학습시킴으로써, 인테리어 스타일 이미 지들이 렌더링 이미지와 유사한 스타일로 생성되도록 의도될 수 있다. S240 단계에서, 공간 구조 이미지와 함께 깊이 정보 이미지가 사전 학습된 멀티-모달 디퓨전 모델에 입력되고, 입력 프롬프트에 기반하여 복수의 인테리어 디자인 이미지들이 생성될 수도 있다. 도 10에 도시된 바와 같은 복수의 인테리어 스타일 이미지들이 생성되어 사용자 단말기로 제공되며, 사용자는 복수의 인테리어 스타일 이미지들 중에서 자신이 원하는 인테리어 스타일 이미지를 선택할 수 있다. 도 11은 사용자가 업로드한 방 사진에 대한 또 다른 예를 나타낸 것이며, 도 12는 사용자가 선택한 방 타입에 필요한 가구들이 방에 추가되어 생성된 공간 가구 이미지에 대한 또 다른 예를 나타낸 것이고, 도 13은 서로 다 른 인테리어 디자인 스타일을 가지도록 생성된 인테리어 스타일 이미지들에 대한 또 다른 예를 나타낸 것이다. 본 발명의 또 다른 실시예에 따르면, 고객이 선택한 인테리어 스타일 이미지에서 가구 이미지를 추출하여 그와 유사하거나 잘 어울리는 가구 제품을 추천함으로써, 사용자의 편의성을 향상시킬 수 있다. 도 14는 본 발명의 또 다른 실시예에 따른 이미지 기반 인테리어 스타일 생성 장치의 구성을 블록도로 도시한 것이고, 도 15는 본 발명의 또 다른 실시예에 따른 이미지 기반 인테리어 스타일 생성 방법을 설명하기 위해 도 시한 흐름도이다. 도시된 이미지 기반 인테리어 스타일 생성 장치 및 방법 중 도 1 내지 도 13을 참조하여 설명 한 것과 동일한 것에 대한 설명은 생략하기로 한다. 도 14 및 도 15를 참조하면, 복수의 인테리어 스타일 이미지들 중 어느 하나가 사용자로부터 선택되면(S250 단 계), 가구추출부는 사용자로부터 선택된 인테리어 스타일 이미지 내의 객체를 검출하여 하나 이상의 가구 이미지를 추출한다(S260 단계). 예를 들어, Google ImageNet 데이터로 사전 학습된 객체 탐지 모델을 가구를 탐지할 수 있도록 전이 학습시키며, 가구추출부 이와 같이 학습된 가구 탐지 모델을 이용해 인테리어 스타일 이미지에 포함된 가 구 이미지 및 가구 카테고리를 추출할 수 있다. 그 후, 가구추천부는 가구추출부를 통해 추출된 가구 이미지와 연관된 가구 제품을 추천한다. 예를 들어, 가구추천부는, 인테리어 스타일 이미지에서 추출된 가구 이미지와 가구 카테고리를 가구 추천 시스템에 입력하여, 해당 가구 이미지와 유사한 가구 제품이나 그와 잘 어울리는 가구 제품을 검색해 사용자 단 말기로 제공하여 추천할 수 있다. 상기에서는 멀티-모달 디퓨전 모델을 이용해 이미지를 생성하는 방법을 예로 들어 본 발명의 실시예를 설명하였 으나, 본 발명은 이에 한정되지 아니하며, 이미지를 생성하기 위한 다양한 인공지능 알고리즘이나 영상 처리 기 법이 사용될 수 있다. 상기한 바와 같은 본 발명의 실시예에 따른 이미지 기반 인테리어 스타일 생성 방법은, 휴대폰, 스마트 폰, 스 마트 패드 또는 PC 등과 같은 사용자 단말기에서 수행되거나 서버에서 수행될 수 있으며, 또는 일부 단계는 사 용자 단말기에서 수행되고 나머지 단계는 서버에서 수행될 수도 있다. 본 발명의 또 다른 실시예에 따르면, 인테리어 디자인을 하고자 하는 공간에 대한 도면 데이터를 이용해 가상의 카메라 위치를 기준으로 하는 해당 공간에 대한 사진 이미지를 생성하고, 이와 같이 생성된 저화질의 렌더링되 지 않은 사진 이미지를 이용해 하나 이상의 가구가 배치된 고화질의 공간 가구 이미지를 생성할 수 있도록 함으 로써, 사용자가 공간을 직접 촬영할 수 없는 상황에서도 자신의 공간에 적합한 다양한 스타일의 인테리어 디자 인을 제공할 수 있다. 그를 위해, 본 발명의 일실시예에 따른 도면 기반 공간 가구 이미지 생성 방법은, 인테리어 디자인을 하고자 하 는 공간에 대한 도면 데이터를 획득하는 단계; 상기 획득된 도면 데이터를 이용하여, 상기 공간 내 가상의 카메 라 위치를 기준으로 하는 상기 공간에 대한 사진 이미지를 생성하는 단계; 하나 이상의 가구 카테고리에 대응되 는 입력 프롬프트(prompt)를 생성하는 단계; 및 상기 생성된 사진 이미지와 상기 입력 프롬프트를 이용하여, 상 기 공간에 하나 이상의 가구가 배치된 공간 가구 이미지를 생성하는 단계;를 포함할 수 있다. 예를 들어, 도 1 내지 도 15를 참조하여 설명한 바와 같은 이미지 기반 인테리어 스타일 생성 방법에 있어서, 사용자가 인테리어 디자인을 하고자하는 방의 사진을 촬영하여 공간 사진 이미지를 업로드하는 대신에, 2차원 도면 이미지와 같은 도면 데이터를 이용하여 렌더링되지 않은 저화질의 공간 사진 이미지를 생성하고, 생성된 저화질의 공간 사진 이미지를 이용해 해당 공간에 하나 이상의 가구가 배치된 고화질의 공간 가구 이미지가 생 성되도록 할 수 있다.한편, 본 발명의 일실시예에 따른 도면 기반 공간 가구 이미지 생성 장치는, 인테리어 디자인을 하고자 하는 공 간에 대한 도면 데이터를 획득하고, 상기 획득된 도면 데이터를 이용하여 상기 공간 내 가상의 카메라 위치를 기준으로 하는 상기 공간에 대한 사진 이미지를 생성하는 이미지획득부; 하나 이상의 가구 카테고리에 대응되는 입력 프롬프트를 생성하는 프롬프트생성부; 및 상기 획득된 사진 이미지와 상기 생성된 입력 프롬프트를 이용하 여, 상기 공간에 하나 이상의 가구가 배치된 공간 가구 이미지를 생성하는 제1 이미지생성부;를 포함할 수 있다. 예를 들어, 도 1 내지 도 15를 참조하여 설명한 바와 같은 이미지 기반 인테리어 스타일 생성 장치에 있어서, 이미지획득부가 사용자가 촬영하여 업로드한 방의 사진을 획득하는 대신에, 2차원 도면 이미지와 같은 도 면 데이터를 이용해 해당 공간에 대한 사진 이미지를 생성함으로써 렌더링되지 않은 저화질의 공간 사진 이미지 를 획득할 수 있다. 이는 사용자가 현재 거주하고 있는 공간에 대한 공간 가구 이미지 또는 인테리어 스타일 이미지를 제공받고자 하는 경우, 가구가 배치되지 않은 빈 공간에 대한 사진 이미지를 획득하기 어려울 수 있으므로, 용이하게 획득 가능한 도면 데이터를 이용해 해당 공간에 대한 사진 이미지가 자동 생성되도록 함으로써, 사용자의 편의성을 향상시킬 수 있다. 도 16은 본 발명의 일실시예에 따른 도면 기반 공간 가구 이미지 생성 방법을 설명하기 위한 흐름도로서, 도시 된 방법 중 도 1 내지 도 15를 참조하여 설명한 것과 동일한 것에 대한 설명은 생략하기로 한다. 도 16을 참조하면, 장치의 이미지획득부는 인테리어 디자인을 하고자 하는 공간에 대한 도면 데이터를 획 득한다(S1600 단계). 예를 들어, 도면 데이터는, 도 17에 도시된 바와 같이, 해당 공간에 대한 2차원 도면 이미지를 나타낼 수 있다. 한편, 도면 이미지는 사용자가 업로드하거나, 사용자가 직접 그리거나, 또는 사용자가 입력한 해당 공간에 대한 정보(예를 들어, 아파트 위치 등)를 이용하여 검색된 것일 수 있으며, 본 발명은 이에 한정되지 아니한다. 그 후, 이미지획득부는, 획득된 도면 데이터를 이용하여, 가상의 카메라 위치를 기준으로 하는 해당 공간 에 대한 사진 이미지를 생성한다(S1610 단계). 여기서, 가상의 카메라 위치는, S1600 단계에서 획득된 도면 데이터를 이용하여 해당 공간내의 특정 위치로 설 정될 수 있다. 예를 들어, 사용자는 도 17에 도시된 바와 같은 도면 이미지 상에서 가상의 카메라 위치를 선택하고, 해당 위치 에서의 카메라 방향을 설정하여, 해당 공간 중 사진 이미지를 생성하고자하는 부분을 설정할 수 있다. 본 발명의 바람직한 실시예에 따르면, S1600 단계에서 획득된 도면 데이터로부터 해당 공간의 구조 및 내부 구 조물의 위치 등에 대한 공간 정보를 추출하는 단계가 수행되고, 추출된 공간 정보를 이용하여 가상의 카메라 위 치를 결정하는 단계가 수행될 수 있다. 상기한 바와 같은 가상의 카메라 위치는 빈 공간에서 가구들을 생성하기 좋은 최적의 위치로서, 기계학습 모델 또는 소정의 알고리즘을 통해 탐색될 수 있다. 예를 들어, 전처리 모듈이 도면 데이터를 전처리하여, 오브젝트의 3차원 위치 정보가 포함된 오브젝트 위치 데 이터를 생성할 수 있다. 전처리 모듈이 입력 받는 도면 데이터는, 2차원 또는 3차원 CAD 파일이거나, 평면도를 포함하는 2차원의 이미지 데이터일 수 있다. 예를 들어 전처리 모듈은 건물의 3차원 CAD 파일을 입력 받고, 이를 2차원으로 표시되는 탑 뷰(top view)인 평면도로 변환한 다음, 평면도에서 표시되는 오브젝트가 차지하는 영역의 정보와 오브젝트의 높 이 정보를 포함하는 오브젝트 위치 데이터를 생성 할 수 있다. 전처리 모듈은 시멘틱 세그멘테이션(sementic segmentation) 또는 인스턴스 세그멘테이션(instance segmentation)을 실행하여, 오브젝트의 영역 정보를 획득 할 수 있다. 예를 들어, 전처리 모듈은, mask R-합성 곱 신경망(mask-R CNN)을 이용하여 인스턴스 세그멘테이션을 실행함으로써, 거실 공간에서 가구 등의 오브젝트 를 분할 할 수 있다. 그리고 전처리 모듈은 분할된 복수의 오브젝트가 위치한 곳과 오브젝트가 차지하는 영역의 정보를 획득하여, 이 들을 포함하는 오브젝트 위치 데이터를 생성 할 수 있다.히트맵 생성 모듈은, 오브젝트 위치 데이터를 머신러닝 모델 또는 알고리즘에 입력하여, 좌표 별 카메라 위치 추천값 정보가 포함된 카메라 위치 히트맵 데이터를 생성할 수 있다. 히트맵 생성 모듈이 머신러닝 모델을 이용하는 경우, 머신러닝 모델은 합성곱 신경망일 수 있다. 머신러닝 학습 모듈은, 사전 학습 단계를 카메라 위치 히트맵 데이터 생성 단계 전에 실행 할 수 있다. 또는 사전 학습 단계를 오브젝트 위치 데이터를 생성하는 단계 전에 실행 할 수도 있다. 그리고 머신러닝 모델의 학습이 완료된 경우, 사전 학습 단계를 실행하지 않고 오브젝트 위치 데이터를 머신러닝 모델에 입력하여, 좌표 별 카메라 위치 추천 값 정보를 산출 할 수 있다. 머신러닝 학습 모듈은, 오브젝트의 영역 정보가 입력 변수이고, 좌표 및 각도 별 카메라 위치 추천값이 표적 변 수인 복수의 학습 데이터를 이용하여, 머신러닝 모델의 파라미터를 갱신함으로써 사전 학습을 실행 할 수 있다. 예를 들어, 입력 변수는, 서로 직교하는 제 1 내지 제 3 축에 대한 좌표계에서 오브젝트가 차지하는 좌표의 정 보일 수 있다. 그리고 표적 변수는 하나의 좌표와, 그 좌표의 제 1 내지 제 3 축 각각을 기준으로 회전한 각도 에서 카메라 위치 추천값 일 수 있다. 머신러닝 모델이 합성곱 신경망인 경우 합성곱 계층은 복수일 수 있고, 필터는 3차원의 형태를 가질 수 있다. 그리고 머신러닝 학습 모듈은 학습을 진행하면서 필터의 가중치를 갱신 할 수 있다. 히트맵 생성 모듈이 알고리즘을 이용하는 경우, 알고리즘은 오브젝트를 클러스터링 하여 중심점을 찾아내고, 그 중심점을 향하여 촬영하는 카메라 위치 별 추천값을 산출한다. 예를 들어, 알고리즘은, 히트맵 생성 모듈이 동 일한 공간에서 하나 이상의 오브젝트를 클러스터링 하는 단계와, 클러스터의 중심점을 검색하는 단계와, 클러스 터의 중심점을 촬영하는 카메라 위치 별로 좌표 별 카메라 위치 추천값 정보를 산출하는 단계를, 공간마다 반복 적으로 실행 할 수 있다. 히트맵 생성 모듈은, 하나의 공간에서 오브젝트의 위치 정보를 KDE(Kernel Density Estimation) 함수에 입력하 여 좌표 별 확률 밀도를 구한 다음, 확률 밀도가 최대인 좌표를 클러스터의 중심점으로 선택한다. 예를 들어, 좌표 별 확률 밀도가 가장 큰 방1의 A1 지점, 방2의 A2 지점, 거실의 A3 지점 등을 각각 클러스터의 중심점으로 선택 할 수 있다. 히트맵 생성 모듈은 오브젝트 위치 데이터에서 임의의 지점을 기준으로 제 1 탐색 영역을 지정하고, 제 1 탐색 영역에서 좌표 별 확률 밀도가 최대인 지점을 중심으로 제 2 탐색 영역을 지정한다. 그리고 제 2 탐색 영역에서 좌표 별 확률 밀도가 최대인 지점을 중심으로 제 3 탐색 영역을 지정한다. 이와 같은 과정을 반복하여 확률 밀 도가 최대인 지점이 하나의 지점으로 수렴할 때까지 탐색한 후, 수렴된 지점을 클러스터의 중심점으로 선택할 수 있다. 이때 제 1 탐색 영역과 제 2 탐색 영역은 원 또는 구의 형태일 수 있다. 대안적으로 히트맵 생성 모듈은, 하나의 공간에서 좌표 별로 복수의 오브젝트 각각과의 거리의 합을 구한 다음, 거리의 합이 최소인 좌표를 클러스터의 중심점으로 선택한다. 예를 들어, 거리의 합이 가장 작은, 방1의 B1 지 점, 방2의 B2 지점, 거실의 B3 지점 등을 각각 클러스터의 중심점으로 선택 할 수 있다. 히트맵 생성 모듈은, 클러스터의 중심점을 촬영하는 위치에서 좌표 별 카메라 위치 추천값 정보를 산출할 수 있 다. 예를 들어, 하나의 공간에서 클러스터의 중심점인 C 지점을 촬영하는 위치 별(P)로 카메라 위치 추천값 정 보를 산출 할 수 있다. 카메라 위치 추천값은, 중심점(C)과 카메라 위치(P) 사이의 거리와, 카메라 위치(P)에서 중심점(C)을 향할 때의 방향과, 중심점(C)과 카메라 위치(P) 사이에 존재하는 오브젝트의 영역 정보를 반영하여 구할 수 있다. 대안적으로 히트맵 생성 모듈은 클러스터의 중심점과 카메라를 잇는 직선 사이에 벽, 기둥, 문 또는 다른 오브 젝트가 없는 카메라 위치에서만 카메라 위치 추천값 정보를 산출 할 수 있다. 예를 들어, 클러스터의 중심점인 C 지점과 카메라가 위치 할 수 있는 P 지점을 잇는 직선 사이에 시야를 가릴 수 있는 벽, 기둥, 문 또는 다른 오브젝트가 없는 위치에 대해서만 카메라 위치 추천값 정보를 산출 할 수 있다. 위치 결정 모듈은, 카메라 위치 히트맵 데이터에서 카메라 위치 추천값이 기준 추천값 이상인 좌표의 정보가 포 함된 가상 카메라 위치 추천 데이터를 생성할 수 있다. 위치 결정 모듈은 사용자로부터 기준 추천값을 설정 받는다. 또는 위치 결정 모듈은 공간 별로 좌표 별 카메라 위치 추천값이 상위 R등 안에 해당하는 좌표 정보를 포함하여, 카가상 메라 위치 추천 데이터를 생성한다. 예를 들어, 가상 카메라 위치 추천 데이터는, 거실의 좌표 별 카메라 위치 추천값이 상위 3등 안에 해당하는 좌표 3개의 정보를 포함 할 수 있다. 선택적으로 렌더링 모듈은, 오브젝트 위치 데이터에서 카메라 위치 추천값이 기준 추천값 이상인 좌표에 해당하 는 지점과 촬영 방향이 도형으로 표시되도록 렌더링 할 수 있다. 예를 들어, 렌더링 모듈은, 위치 결정 모듈이 구한 카메라 위치 추천값이 기준 추천값 이상인 좌표에 해당하는 지점(V1 ~ V5)을 오브젝트 위치 데이터에 도형으로 표시한다. 이때 화살표 등으로 촬영 방향을 같이 표시 할 수 있다. 히트맵 생성 모듈이 머신러닝 모델을 이용하는 경우, 좌표 별 카메라 위치 추천값 정보에 포함된 3차원 상의 좌 표 위치와 함께, 제 1 내지 제 3 축을 기준으로 회전한 각도 정보를 참조하여 촬영 방향을 결정 할 수 있다. 또 는 히트맵 생성 모듈이 알고리즘을 이용하는 경우, 카메라 위치에서 중심점을 향하는 방향으로 촬영 방향 을 결정 할 수 있다. 그리고 렌더링 모듈은 도형이 표시된 오브젝트 위치 데이터를 카메라 위치 렌더링 데이터로 가공한 후 시스템의 외부로 출력할 수 있다. 도 18을 참조하면, 소정의 화각(θ)을 가지는 가상의 카메라의 위치(P)와 방향이 사용자에 의해 선택되거나 상 기한 바와 같은 공간 정보를 이용해 자동으로 결정될 수 있으며, 그에 대응되는 공간 사진 이미지가 생성될 수 있다. 이 경우, 가상의 카메라의 위치(P)와 방향 뿐 아니라, 화각(θ) 또한 사용자에 의해 선택되거나 공간 정보에 기 초하여 결정될 수 있다. 도 19는 도 18에 도시된 바와 같은 도면 이미지 및 가상의 카메라 위치(P)에 따라 자동으로 생성되는 공간 사진 이미지에 대한 일예를 나타낸 것으로, 상기한 바와 같이 생성되는 공간 사진 이미지는 이후 생성되는 공간 가구 이미지보터 저화질의 렌더링되지 않은 이미지일 수 있다. 그 후, 하나 이상의 가구 카테고리에 대응되는 입력 프롬프트(prompt)를 생성하는 단계와, 공간 사진 이미지와 입력 프롬프트를 이용하여 해당 공간에 하나 이상의 가구가 배치된 공간 가구 이미지를 생성하는 단계가 수행될 수 있다. 예를 들어, 공간 가구 이미지를 생성하는 단계는, 사전 학습된 멀티-모달 디퓨전(Multi-Modal Diffusion) 모델 에 입력 프롬프트를 입력하여 공간 가구 이미지를 생성할 수 있다. 또한, 생성된 공간 가구 이미지로부터 공간에 대한 구조 정보를 추출하여 공간 구조 이미지를 생성하는 단계와, 생성된 공간 구조 이미지와 생성된 입력 프롬프트를 이용하여 해당 공간에 인테리어 디자인이 적용된 인테리어 스타일 이미지를 생성하는 단계가 더 수행될 수 있다. 상기한 바와 같은 공간 가구 이미지를 생성하는 단계, 공간 구조 이미지를 생성하는 단계 및 인테리어 스타일 이미지를 생성하는 단계는, 도 1 내지 도 15를 참조하여 설명한 바와 같을 수 있다. 본 발명의 또 다른 실시예에 따르면, 사용자가 제작한 도면으로부터 인테리어 스타일링에 적합한 오버뷰샷 이미 지를 기계 학습 모델을 이용해 생성하고, 렌더링된 오버뷰샷 이미지와 사용자가 선택한 인테리어 스타일을 사전 학습된 스타일 변환 디퓨전 모델의 입력으로 사용해 다양한 인테리어 스타일 이미지들을 생성할 수 있도록 함으 로써, 사용자가 제작 중인 인테리어 도면에 다양한 스타일의 인테리어 디자인들을 적용할 수 있도록 한다. 도 20은 본 발명의 일실시예에 따른 인테리어 스타일링 서비스 제공 장치의 구성을 블록도로 도시한 것으로, 도 시된 서비스 제공 장치는 이미지획득부, 오버뷰샷 이미지 생성부, 사용자 인터페이스부, 렌 더링 처리부 및 스타일 이미지 생성부를 포함하여 구성될 수 있다. 도 20을 참조하면, 이미지획득부는 사용자가 제작한 도면 데이터를 획득한다. 예를 들어, 이미지획득부는 인테리어 디자인 등을 위해 사용자가 제작 중인 2D 또는 3D 도면을 입력받을 수 있으나, 본 발명은 이에 한정되지는 아니한다. 오버뷰샷 이미지 생성부는, 이미지획득부를 통해 획득된 도면 데이터를 이용하여, 복수의 공간들 각각에 대한 복수의 오버뷰샷 이미지들을 생성한다. 예를 들어, 오버뷰샷 이미지 생성부는 도면 데이터에 포함된 복수의 공간들 각각에 대해 하나 이상의 카 메라 위치 또는 각도가 적용된 오버뷰샷 이미지를 생성하여 복수의 오버뷰샷 이미지들을 구성하고, 복수의 오버뷰샷 이미지들이 사용자 단말의 화면에 표시되도록 처리할 수 있다. 사용자 인터페이스부는 오버뷰샷 이미지 생성부에서 생성된 복수의 오버뷰샷 이미지들 중에서 인테 리어 디자인을 하고자 하는 공간에 상응하는 오버뷰샷 이미지를 선택받는다. 렌더링 처리부는 사용자 인터페이스부를 통해 사용자가 선택한 오버뷰샷 이미지를 렌더링 하여, 해 당 공간에 대한 3D 렌더링 이미지를 생성되도록 한다. 예를 들어, 렌더링 처리부는 사용자가 선택한 오버뷰샷 이미지를 3D 렌더링을 위한 클라우드 서버로 전달 하여, 클라우드 서버에서 오버뷰샷 이미지에 대한 렌더링이 수행되도록 할 수 있다. 또한, 사용자 인터페이스부는 해당 공간에 적용하고자 하는 인테리어 스타일을 선택받는다. 스타일 이미지 생성부는, 사전 학습된 스타일 변환 디퓨전 모델에 렌더링 처리부를 통해 생성된 3D 렌더링 이미지와 사용자 인터페이스부를 통해 선택된 인테리어 스타일을 입력하여, 해당 공간에 대한 인 테리어 스타일 이미지를 생성한다. 예를 들어, 사용자 인터페이스부는 해당 공간에 대한 룸 타입과 함께 복수의 인테리어 스타일들 중 하나 를 사용자로부터 선택받을 수 있으며, 이 경우 스타일 이미지 생성부는 생성된 3D 렌더링 이미지와 사용 자로부터 선택된 룸 타입 및 인테리어 스타일을 스타일 변환 디퓨전 모델에 입력시켜 인테리어 스타일 이미지가 생성되도록 할 수 있다. 이하, 도 21 내지 도 27을 참조하여, 본 발명에 따른 인테리어 스타일링 서비스 제공 방법에 대한 실시예들을 보다 상세히 설명하기로 한다. 도 21은 본 발명의 일실시예에 따른 인테리어 스타일링 서비스 제공 방법을 흐름도로 도시한 것으로, 도시된 방 법 중 도 1 내지 도 20을 참조하여 설명한 것과 동일한 것에 대한 설명은 생략하기로 한다. 도 21을 참조하면, 서비스 제공 장치의 이미지획득부는 인테리어 디자인을 하고자 하는 공간에 대한 도면 데이터를 획득한다(S2100 단계). 상기한 바와 같이, S2100 단계에서 획득되는 도면 데이터는 사용자가 제작한 2차원 또는 3차원 도면 이미지를 나타낼 수 있다. 예를 들어, 도 22에 도시된 바와 같이 인테리어 디자인을 위해 사용자가 제작 중인 특정 공간에 대한 2D 도면이 사용될 수 있다. 또는, 인테리어 디자인을 위한 서비스에서 제공되는 ‘도면 직접 그리기’, ‘우리집 검색하기’또는 '도면 활 용하기' 등을 이용하여 사용자가 제작하는 2D 또는 3D 도면이 사용될 수도 있으나, 본 발명은 이에 한정되지는 아니한다. 예를 들어, 사용자는, 도 23에 도시된 바와 같은 사용자가 제작 중인 도면에서 'AI 스타일러' 기능을 선택하여, 사전 학습된 디퓨전 네트워크를 이용한 다양한 스타일의 이미지들을 확인할 수 있다. 그 후, 오버뷰샷 이미지 생성부는 S2100 단계에서 획득된 도면 데이터를 이용하여, 인테리어 디자인을 하 고자하는 공간에 대한 오버뷰샷(overview shot) 이미지를 생성한다(S2110 단계). S2110 단계에서, 도면 데이터에 포함된 복수의 공간들 각각에 대해 하나 이상의 카메라 위치 또는 각도가 적용 된 오버뷰샷 이미지를 생성하여, 복수의 오버뷰샷 이미지들이 구성될 수 있으며, 복수의 오버뷰샷 이미지들 중 에서 렌더링될 오버뷰샷 이미지가 사용자에 의해 선택될 수 있다. 한편, 사용자는, 복수의 공간들 중 스타일링을 원하는 공간과, 카메라 위치 또는 각도 중 적어도 하나를 선택할 수 있다. 예를 들어, 도 24에 도시된 바와 같이, 사용자가 제작 중인 도면에 포함된 주방, 침실, 거실, 부엌 등과 같은 공간들 각각에 대한 오버뷰샷 이미지가 생성되어 사용자 단말의 화면에 복수의 오버뷰샷 이미지들이 표시될 수 있으며, 동일한 공간에 대해 서로 다른 카메라 위치 또는 각도에 대응되는 2 이상의 오버뷰샷 이미지들이 생성 될 수도 있다. 또한, 사용자가 직접 카메라 위치 또는 각도를 지정할 수도 있으나, 바람직하게는 해당 공간의 가구와 벽면 등 이 전체적으로 보이는 카메라 위치 또는 각도에 따라 최적의 뷰(view)가 자동 추천될 수 있다.예를 들어, 방의 구조와 문, 창문 등의 기본 구조물의 위치 등이 파악된 후, 기계 학습 모델을 이용해, 사용자 가 제작한 도면의 구성을 전체적으로 보일 수 있도록 하는 카메라 위치 또는 각도가 자동 설정될 수 있다. 도 24에 도시된 바와 같이 복수의 오버뷰샷 이미지들을 함께 제공함으로써, 사용자는 자신이 제작한 도면의 모 든 방들에 대해 각 방의 가구 및 벽면 색감 등의 분위기를 한눈에 파악할 수 있도록 하며, 사용자는 스타일링 하고자 하는 공간 및 구도를 선택한 후 '렌더링'을 선택할 수 있다. 렌더링 처리부는 S2110 단계에서 생성된 오버뷰샷 이미지를 렌더링(rendering) 하여, 해당 공간에 대한 3D 렌더링 이미지를 생성한다(S2120 단계). S2120 단계에서, 렌더링 처리부는 오버뷰샷 이미지를 클라우드 서버로 전송하여, 클라우드 서버에서 오버 뷰샷 이미지에 대한 3D 렌더링이 수행되도록 할 수 있다. 예를 들어, 도 24에 도시된 바와 같은 화면에서 사용자가 렌더링 하고자 하는 오버뷰샷 이미지를 선택하고 '렌 더링'을 요청하면, 선택된 오버뷰샷 이미지가 3D 렌더링을 위한 클라우드 서버로 전달될 수 있다. 한편, 사용자 인터페이스부는 해당 공간에 적용하고자 하는 인테리어 스타일을 사용자로부터 설정받는다 (S2130 단계). S2130 단계에서, 사용자는 해당 공간에 대한 룸 타입(room type)과 함께, 복수의 인테리어 스타일들 중에서 원 하는 스타일을 선택할 수 있다. 예를 들어, 도 25에 도시된 바와 같은 화면에서, 사용자는 인테리어 디자인을 하고자 하는 공간에 대한 룸 타임 을 선택하고, 적용하고자 하는 스타일을 선택할 수 있다. 사용자가 선택 가능한 복수의 인테리어 스타일들은 모던(Modern), 미니멀(Minimal), 네츄럴(Natural), 스칸디나 비안(Scandinavian), 빈티지(Vintage), 클래식(Classic), 럭셔리(Luxury), 미드-나잇 센츄리(Mid-night Cnetury), 보헤미안(Bohemian), 아시안(Asian) 등을 포함할 수 있으나, 본 발명은 이에 한정되지는 아니한다. 한편, 사용자가 선택한 룸 타임 및 스타일에 따라, 프롬프트 DB에서 특정 프롬프트 리스트가 획득될 수 있다. 이를 위해, 복수의 룸 타임 및 스타일별로 최적의 인테리어 스타일링을 위한 프롬프트 리스트 DB가 미리 구축되 어 있을 수 있으며, 사용자가 선택한 룸 타임 및 스타일에 따라 획득된 프롬프트 리스트는 이후 인테리어 스타 일 이미지 생성에 이용될 수 있다. 그 후, 스타일 이미지 생성부는, 사전 학습된 스타일 변환 디퓨전(Diffusion) 모델에 S2120 단계에서 생 성된 3D 렌더링 이미지와 S2130 단계에서 설정된 인테리어 스타일을 입력하여, 해당 공간에 대한 인테리어 스타 일 이미지를 생성한다(S2140 단계). S2140 단계에서는, 사용자가 선택한 오버뷰샷 이미지에 대한 3D 렌더링 이미지와, 사용자가 선택한 룸 타입 및 인테리어 스타일을 스타일 변환 디퓨전 모델에 입력시킬 수 있다. 여기서, 인테리어 스타일 이미지를 생성하기 위한 AI 생성형 스타일러 엔진은 스타일 변환 디퓨전 컨트롤넷 (Diffusion Controlnet) 모델을 이용할 수 있다. 예를 들어, 도 26에 도시된 바와 같이, 미리 수집된 수백만 개의 룸 타입 및 스타일별 렌더링 이미지로 훈련하 여 파인 튜닝(fine tuning)한 디퓨전 네트워크가 구축될 수 있으며, 구축된 디퓨전 모델이 고품질의 인테리어 스타일 이미지를 생성할 수 있도록 프롬프트 엔지니어링(prompt engineering) 하여 룸 타입 및 스타일별 프롬프 트(prompt) 리스트, 포지티크 프롬프트(positive prompt) 및 네가티브 프롬프트(negative prompt) 데이터베이 스가 구축될 수 있다. 한편, 구축된 AI 디퓨전 모델이 고품질의 인테리어 스타일 이미지를 생성할 수 있도록, 복수의 프롬프트들을 학 습 및 테스트하여, 각각의 룸 타입 및 스타일에 적합한 프롬프트, 포지티크 프롬프트 및 네가티브 프롬프트 리 스트 데이터베이스화 시킬 수 있다. 또한, 전이 학습이 완료된 디퓨전 모델은, 렌더링된 이미지를 입력으로 받아 이미지의 구조와 골격을 추출하며, 모델이 학습한 인테리어 스타일 이미지를 추출된 구조와 골격 위에 생성할 수 있다. 상기한 바와 같은 방법을 통해, 도 27에 도시된 바와 같이, 인테리어 디자인하고자 하는 공간에 대해 사용자가 선택한 룸 타입 및 스타일에 따른 인테리어 스타일 이미지들이 사용자에게 제공될 수 있다.상술한 본 발명에 따른 방법들은 컴퓨터에서 실행되기 위한 프로그램으로 제작되어 컴퓨터가 읽을 수 있는 기록 매체에 저장될 수 있으며, 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장장치 등이 있다. 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 상기 방법을 구현하기 위한 기능적인(function) 프로그램,"}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "코드 및 코드 세그먼트들은 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2023-0119095", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2023-0119095", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 이미지 기반 인테리어 스타일 생성 장치의 구성을 나타내는 블록도이다. 도 2는 본 발명의 일실시예에 따른 이미지 기반 인테리어 스타일 생성 방법을 나타내는 흐름도이다. 도 3 내지 도 13은 이미지 기반 인테리어 스타일 생성 방법에 대한 실시예들을 설명하기 위한 도면들이다. 도 14는 본 발명의 또 다른 실시예에 따른 이미지 기반 인테리어 스타일 생성 장치의 구성을 설명하기 위한 블 록도이다. 도 15는 본 발명의 또 다른 실시예에 따른 이미지 기반 인테리어 스타일 생성 방법을 설명하기 위한 흐름도이다. 도 16은 본 발명의 일실시예에 따른 도면 기반 공간 가구 이미지 생성 방법을 설명하기 위한 흐름도이다. 도 17 내지 도 19는 도면 데이터를 이용하여 공간에 대한 사진 이미지를 생성하는 방법에 대한 일실시예를 설명 하기 위한 도면들이다. 도 20은 본 발명의 일실시예에 따른 인테리어 스타일링 서비스 제공 장치의 구성을 설명하기 위한 블록도이다. 도 21은 본 발명의 일실시예에 따른 인테리어 스타일링 서비스 제공 방법을 설명하기 위한 흐름도이다. 도 22 내지 도 27은 사용자가 작성한 도면을 기반으로 다양한 인테리어 스타일 이미지들을 생성하는 방법에 대 한 실시예들을 설명하기 위한 도면들이다."}
