{"patent_id": "10-2022-0032556", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0135283", "출원번호": "10-2022-0032556", "발명의 명칭": "설명 가능한 인공 지능 모델을 이용한 합금 설계장치 및 그 방법", "출원인": "울산과학기술원", "발명자": "정임두"}}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "합금의 기계적 특성을 예측하는 예측 모델;상기 예측모델에 의해 예측된 기계적 특성의 신뢰성을 증명하기 위한 예측 설명 모델; 및원하는 기계적 특성을 가진 합금을 설계할 수 있도록 적어도 하나의 공정 조건을 추천하는 추천 모델을 포함하는 것을 특징으로 하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 예측 모델은, 케라스(keras) 기반의 DNN 알고리즘이 적용된 DNN 학습모델인, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 예측 모델은,복수의 합금 첨가물 및 제조공정의 입력변수를 입력받아 합금의 기계적 특성을 예측하며,상기 합금은 알루미늄 합금이고,상기 합금 첨가물은 상기 알루미늄 합금의 주요 화학적 조성물인 아연(Zn), 마그네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)이고,상기 제조 공정은 캐스팅 타입(Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리(Solution Treatment), 에이징(Aging)을 포함하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 예측 모델은,상기 합금 첨가물과 제조공정의 입력변수들을 조합하여 합금의 항복강도(Yield strength, YS), 인장강도(tensile strength, TS), 연신율(elongation, EL)를 예측하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 예측 모델은,베이지안 최적화 방법으로 결정된 하이퍼 파라미터 및 K-fold 교차 검증 방법이 사용하여 기계적 특성을 예측하며,상기 하이퍼 파라미터는 learning rate, epoch, number of layers, number of nodes, batch normalization의조합으로 이루어지는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,공개특허 10-2023-0135283-4-상기 예측 설명 모델은 LIME 알고리즘이 적용된 설명가능한 인공지능(eXplainable Artificial Intelligence,XAI)이고,상기 예측 모델이 예측한 기계적 특성에 대한 각 변수의 긍정적 또는 부정적 영향을 설명하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "복수의 합금 첨가물 및 제조공정에 대한 입력변수를 입력받아 알루미늄 합금의 항복강도, 인장강도, 연신율의기계적 특성을 예측하는 DNN 학습모델; 및상기 DNN 학습모델이 예측한 기계적 특성에 대한 각 변수의 긍정적 또는 부정적 영향을 하는 예측 설명 모델을포함하는 것을 특징으로 하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 DNN 학습모델은, 베이지안 최적화 방법 및 K-fold 교차 검증 방법을 사용하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 입력변수는, 아연(Zn), 마그네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)의 합금첨가물과, 캐스팅 타입(Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리(Solution Treatment), 에이징(Aging)의 제조공정인, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 예측 설명 모델은, 설명가능한 인공지능(eXplainable Artificial Intelligence, XAI)을 이용하는, 설명가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,상기 예측 설명 모델에 의해 높은 예측 정확도가 확보된 공정 조건을 기반으로, 원하는 기계적 특성을 가진 알루미늄 합금의 공정조건을 추천하는 추천모델을 더 포함하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계장치."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "예측 모델이 합금 첨가물 및 제조공정에 대한 입력변수를 입력받아 알루미늄 합금의 항복강도, 인장강도, 연신율의 기계적 특성을 예측하는 예측단계; 및예측 설명 모델이 상기 예측된 기계적 특성에 대한 각 변수의 긍정적 또는 부정적 영향을 설명하는 예측 설명단계를 포함하여 수행되는 것을 특징으로 하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계방법."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 예측모델은 베이지안 최적화 방법 및 K-fold 교차 검증 방법을 이용하여 예측하는 DNN 학습모델이고,상기 예측 설명 모델은, LIME 알고리즘을 이용하는 설명 가능한 인공지능(XAI)인, 설명 가능한 인공 지능 모델을 이용한 합금 설계방법."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2023-0135283-5-제 12 항에 있어서,상기 입력변수는, 아연(Zn), 마그네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)의 합금첨가물과, 캐스팅 타입(Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리(Solution Treatment), 에이징(Aging)의 제조공정을 포함하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계방법."}
{"patent_id": "10-2022-0032556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,추천 모델이 상기 예측 설명 모델에 의해 높은 예측 정확도가 확보된 공정 조건을 기반으로, 원하는 기계적 특성을 가진 알루미늄 합금의 공정조건을 추천하는 추천 단계를 더 포함하는, 설명 가능한 인공 지능 모델을 이용한 합금 설계방법."}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 설명 가능한 인공 지능 모델을 이용하여 합금을 설계하는 장치 및 그 방법을 제안한다. 본 발명에 따 른 합금 설계 장치는 합금의 기계적 특성을 예측하는 예측 모델, 상기 예측모델에 의해 예측된 기계적 특성의 신 뢰성을 증명하기 위한 예측 설명 모델, 그리고 원하는 기계적 특성을 가진 합금을 설계할 수 있도록 적어도 하나 의 공정 조건을 추천하는 추천 모델의 3가지 모델을 포함하여 구성된다. 이를 통해 예측 모델이 예측한 기계적 특성의 예측 결과를 신뢰할 수 있고, 또 합금 설계에 필요한 시간과 비용을 줄일 수 있는 이점이 있다."}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 합금 공정 조건에 따른 합금의 기계적 특성을 예측하고, 예측 결과의 타당성을 제시하여 예측 모델의 신뢰성을 향상시키며, 나아가 제작 할 대상 합금의 공정 조건을 추천하도록 하는 설명 가능한 인공 지능 모델을 이용한 합금 설계장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "많은 종류의 합금 중 높은 비강도, 상대적으로 가벼운 무게(강의 약 1/3), 높은 내식성, 저렴한 가격 등과 같은 고유한 특성들의 조합으로 기존 철강을 대체하는 재료로서 알루미늄 합금이 많이 사용된다. 그리고 알루미늄 합 금을 운송산업의 경량 구조 부품에 적용하면 그만큼 CO2 배출량을 최소화할 수 있다. 이러한 이유로 알루미늄 합금은 자동차, 항공, 우주, 건설 분야 등의 각종 산업분야의 금속 재료로 널리 사용된다. 알루미늄 합금은 알루미늄에 구리(Cu), 마그네슘(Mg) 등의 금속을 첨가한 합금으로 사용 목적에 따라 알루미늄 의 성질을 개량한 것이다. 특히, 알루미늄 7XXX계열은 알루미늄(Al)에 아연(Zn)과 마그네슘(Mg)를 첨가한 합금 으로서 알루미늄 합금 중에서 가장 높은 강도를 갖고 있으며 주 합금원소에 따라 Al-Zn-Mg-Cu계 합금과 Cu를 포 함하지 않은 Al-Zn-Mg계로 분류할 수 있다. 그리고 이러한 알루미늄 합금의 강도는 첨가제 조성과 제조 공정의 비율에 따라 기계적 특성(물성)이 많이 달라진다. 따라서 알루미늄 합금의 기계적 특성을 예측하는 것이 중요하다. 알루미늄 합금의 강도를 예측하는 모델들은 종 래에도 제안된 바 있다. 그러나 종래 제시된 모델들은 특정 합금 조성과 열적 조건 및 기계적 조건에 대한 공정 매개변수의 다양한 구조적 변수를 검증하지 않고 예측하기 때문에, 예측 정확도가 낮고 제한적이었다. 근래에는 인공 신경망(ANN)과 심층 신경망(DNN)을 이용하여 구조 재료의 기계적 특성을 예측하고 합금 설계에 응용하는 방안들도 제안되고 있다. 신경망을 이용하면 비선형 관계를 가진 많은 양의 복잡한 데이터에 대한 정 확한 예측이 가능하다는 장점이 있다. 하지만, 상기 신경망을 이용한 방법은 제조 공정 중에서 열처리에 대한 예측만을 수행하고 있다. 그리고 상기 신경망이 적용된 다른 예로 2 개의 인공 신경망(ANN)이 적용된 모델이 있 지만, 상기 모델은 공정 매개변수와 원강(raw steel)의 조성을 기반으로 산업용 강판의 기계적 특성만을 예측하 고 있다. 이처럼 신경망 모델을 이용하는 경우도 예측을 위한 조건이 제한적이기 때문에 예측 결과에 대한 근거 등이 부 족하여 기계적 특성의 예측 결과를 무조건적으로 신뢰하거나 의존하지 못하는 문제점이 존재한다. 이는 신경망 모델의 예측 결과를 논리적으로 설명하고 제시하는 근거와 타당성이 부족하기 때문이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 10-2020-0000699(아연도금강판의 도금량 및 합금화도 중 적어도 하나의"}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "예측방법) 발명의 내용"}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 합금 첨가원소 및 제조공정 간의 상관 관계 를 기반으로 하여 제조될 합금의 기계적 특성을 정확하게 예측함은 물론, 기계적 특성의 예측 결과의 신뢰성을 향상시킬 수 있는 설명 가능한 인공 지능 모델을 이용한 합금 설계장치 및 그 방법을 제공하는데 그 목적이 있 다. 본 발명의 다른 목적은 예측된 기계적 특성을 고려하여 원하는 합금 제조에 필요한 최적의 합금 공정 조건을 추 천하는 설명 가능한 인공 지능 모델을 이용한 합금 설계장치 및 그 방법을 제공하는 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과 제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이와 같은 목적을 달성하기 위한 본 발명의 일 실시 예에 따른 설명 가능한 인공 지능 모델을 이용한 합금 설계 장치는, 합금의 기계적 특성을 예측하는 예측 모델; 상기 예측모델에 의해 예측된 기계적 특성의 신뢰성을 증명 하기 위한 예측 설명 모델; 및 원하는 기계적 특성을 가진 합금을 설계할 수 있도록 적어도 하나의 공정 조건을 추천하는 추천 모델을 포함하는 것을 특징으로 한다. 상기 예측 모델은, 케라스(keras) 기반의 DNN 알고리즘이 적용된 DNN 학습모델이다. 상기 예측 모델은, 복수의 합금 첨가물 및 제조공정의 입력변수를 입력받아 합금의 기계적 특성을 예측하며, 상 기 합금은 알루미늄 합금이고, 상기 합금 첨가물은 상기 알루미늄 합금의 주요 화학적 조성물인 아연(Zn), 마그 네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)이고, 상기 제조 공정은 캐스팅 타입 (Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리(Solution Treatment), 에이징 (Aging)을 포함한다. 상기 예측 모델은, 상기 합금 첨가물과 제조공정의 입력변수들을 조합하여 합금의 항복강도(Yield strength, YS), 인장강도(tensile strength, TS), 연신율(elongation, EL)를 예측한다. 상기 예측 모델은, 베이지안 최적화 방법으로 결정된 하이퍼 파라미터 및 K-fold 교차 검증 방법을 사용하여 기 계적 특성을 예측하며, 상기 하이퍼 파라미터는 learning rate, epoch, number of layers, number of nodes, batch normalization의 조합으로 이루어진다. 상기 예측 설명 모델은 LIME 알고리즘이 사용되고, 상기 예측 모델이 예측한 기계적 특성에 대한 각 변수의 긍 정적 또는 부정적 영향을 설명한다. 본 발명의 다른 특징에 따른 설명 가능한 인공 지능 모델을 이용한 합금 설계장치는, 복수의 합금 첨가물 및 제 조공정에 대한 입력변수를 입력받아 알루미늄 합금의 항복강도, 인장강도, 연신율의 기계적 특성을 예측하는 DNN 학습모델; 및 상기 DNN 학습모델이 예측한 기계적 특성에 대한 각 변수의 긍정적 또는 부정적 영향을 하는 예측 설명 모델을 포함하고, 상기 DNN 학습모델은, 베이지안 최적화 방법 및 K-fold 교차 검증 방법을 사용한다. 상기 입력변수는, 아연(Zn), 마그네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)의 합금 첨가물과, 캐스팅 타입(Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리 (Solution Treatment), 에이징(Aging)의 제조공정이다. 상기 예측 설명 모델은, 설명가능한 인공지능(eXplainable Artificial Intelligence, XAI)을 이용한다. 상기 예측 설명 모델에 의해 높은 예측 정확도가 확보된 공정 조건을 기반으로, 원하는 기계적 특성을 가진 알 루미늄 합금의 공정조건을 추천하는 추천모델을 더 포함한다. 본 발명의 또 다른 특징에 따른 설명 가능한 인공 지능 모델을 이용한 합금 설계방법은, 예측 모델이 합금 첨가 물 및 제조공정에 대한 입력변수를 입력받아 알루미늄 합금의 항복강도, 인장강도, 연신율의 기계적 특성을 예측하는 예측단계; 및 예측 설명 모델이 상기 예측된 기계적 특성에 대한 각 변수의 긍정적 또는 부정적 영향을 설명하는 예측 설명 단계를 포함하여 수행되는 것을 특징으로 한다. 상기 예측모델은 베이지안 최적화 방법 및 K-fold 교차 검증 방법을 이용하여 예측하는 DNN 학습모델이고, 상기 예측 설명 모델은, LIME 알고리즘을 이용하는 설명가능한 인공지능(XAI)이다. 상기 입력변수는, 아연(Zn), 마그네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)의 합금 첨가물과, 캐스팅 타입(Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리 (Solution Treatment), 에이징(Aging)의 제조공정을 포함한다. 본 발명에 따르면, 추천 모델이 상기 예측 설명 모델에 의해 높은 예측 정확도가 확보된 공정 조건을 기반으로, 원하는 기계적 특성을 가진 알루미늄 합금의 공정조건을 추천하는 추천 단계를 더 포함한다."}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명에 따르면, 7가지의 합금 첨가물과 5가지의 제조 공정을 기반으로 알루미늄 합금의 기계적 특 성을 예측하며, 이때 베이지안 최적화 알고리즘을 이용하여 결정된 최적의 하이퍼-파라미터를 사용하며, k-fold 교차 검증 방법을 통해 제한된 개수의 데이터 세트로도 검증 수를 최대화함으로써, 기계적 특성의 예측 정확도 를 향상시키는 효과가 있다. 본 발명에 따르면, 합금의 예측된 기계적 특성을 실제 합금의 이론과 일치하는 기계적 특성과 비교하여 제공하 기 때문에, 학습 모델이 예측한 기계적 특성의 예측 결과를 신뢰할 수 있는 효과가 있다. 본 발명에 따르면 원하는 합금 제작 시 중요한 첨가물과 공정 조건을 효과적으로 판단하여 제시함으로써, 합금 설계에 필요한 시간과 비용을 줄일 수 있고, 비 전문가도 쉽게 합금 제작이 가능한 효과가 있다."}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 고 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 본 발명에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 공간적으로 상대적인 용어인 아래(below, beneath, lower), 위(above, upper) 등은 도면에 도시되어 있는 바와 같이 하나의 소자 또는 구성 요소들과 다른 소자 또는 구성 요소들과의 상관 관계를 용이하게 기술하기 위해 사 용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 소자의 서 로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들면, 도면에 도시되어 있는 소자를 뒤집을 경우, 다른 소자의 아래(below, beneath)로 기술된 소자는 다른 소자의 위(above, upper)에 놓여질 수 있다. 따라서, 예시 적인 용어인 아래는 아래와 위의 방향을 모두 포함할 수 있다. 소자는 다른 방향으로도 배향될 수 있고, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있다. 본 발명에서 사용되는 “부” 또는 “부분” 등의 일부분을 나타내는 표현은 해당 구성요소가 특정 기능을 포함 할 수 있는 장치, 특정 기능을 포함할 수 있는 소프트웨어, 또는 특정 기능을 포함할 수 있는 장치 및 소프트웨 어의 결합을 나타낼 수 있음을 의미하나, 꼭 표현된 기능에 한정된다고 할 수는 없으며, 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것일 뿐, 본 발명이 속하는 분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 또한, 본 발명에서 사용되는 모든 전기 신호들은 일 예시로서, 본 발명의 회로에 반전기 등을 추가적으로 구비 하는 경우 이하 설명될 모든 전기 신호들의 부호가 반대로 바뀔 수 있음을 유의해야 한다. 따라서, 본 발명의 권리범위는 신호의 방향에 한정되지 않는다. 따라서, 본 발명의 사상은 설명된 실시 예에 국한되어 정해져서는 아니되며, 후술하는 특허청구범위뿐 아니라 이 특허청구범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다. 이하에서는 도면에 도시한 실시 예에 기초하면서 본 발명에 대하여 더욱 상세하게 설명하기로 한다. 도 1은 본 발명의 바람직한 실시 예에 따른 합금 설계 시스템을 도시한 전체 구성도이다. 도 1에 도시한 바와 같이 합금 설계 장치는, 공정조건에 따른 합금의 기계적 특성을 예측하는 예측 모델 , 예측 모델이 예측한 기계적 특성이 어떠한 근거로 예측 하였는지 설명하여 상기 예측 모델의 신뢰성을 증명하는 예측 설명 모델, 그리고 최적의 제조공정을 찾아 원하는 기계적 특성의 합금을 설계할 수 있도록 공정조건을 추천하는 추천 모델을 포함하여 구성된다. 이처럼 본 발명 장치는 인공 지능 모델이 단순히 합금의 기계적 특성을 예측하는 것이 아니고, 그 기계적 특성의 예측 결과의 근거를 제시함으로써 예측 결과의 신뢰성을 향상시킬 수 있도록 설계되는 것이다. 나아가 높은 예측 정확도를 지닌 인공 지능 모델이 추천한 공정 조건에 따라 최적의 고강도 알루미늄 합금을 설계할 수 있도록 하는 것이다. 도 2는 도 1의 예측 모델의 내부 구성도이다. 본 발명의 예측 모델은 케라스(keras) 기반의 DNN 알고리즘 이 적용된 DNN 학습모델을 이용하여 합금의 기계적 특성을 예측하였고, DNN 학습모델은, 도시한 바와 같이 입력 레이어(input layer), 히든 레이어(hidden layers) 및 출력 레이어(output layer)를 포함하여 구성된다. 본 실시 예의 DNN 학습모델은 화학 조성(chemical composition, 합금첨가물, 합금 첨가 원소라고 하기도 한다), 제조 공정, 기계적 물성 등의 빅 데이터(big data)를 축적하고, 실험을 통해 생성된 총 227개의 데이터 세트를 이용한다. 그리고 DNN 학습모델은 9:1의 비율로 훈련 세트(training set)와 테스트 세트(test set)를 활용한다. 여기서 인공지능 학습을 위해 제공되는 데이터 양은 매우 적을 수 있기 때문에, 이를 해결하 고자 K-fold 교차 검증 방법을 적용한다. 이를 통해 제한된 개수의 데이터 세트로도 검증 수를 최대화하여 편향 된 예측을 방지할 수 있었다. 실시 예는 k 값을 10을 사용하였다. 본 실시 예의 DNN 학습 모델은 훈련 세트를 이용하여 훈련이 이루어진다. 그리고 앞서 언급한 바와 같이 DNN 학습 모델은 입력 레이어, 히든 레이어, 출력 레이어를 포함하는데, 입력 데이터는 피 드 포워드 전파(feed forward propagation)및 BP(back propagation)를 사용하여 여러 히든 레이어을 통해 처리된다. 그리고 초기 가중치와 편향은 피드 포워드 전파 과정에서 결정되고 훈련은 입력 레이어에서 출 력 레이어로 진행된다. 또 BP 동안 가중치와 편향을 업데이트하여 이전 훈련 결과와 비교하여 예측 정확도 를 높이도록 설계된다.본 실시 예의 DNN 학습모델은 합금의 기계적 특성 예측을 위하여 총 12개의 요소를 입력변수로 선정하여 활용한다. 입력변수를 활용하여 어떠한 요소가 합금의 기계적 특성에 큰 영향을 미치는지를 확인할 수 있다. 상기 입력변수는 합금 첨가물과 제조공정의 2가지 카테고리를 포함한다. 그리고 합금 첨가물(chemical composition)은 7가지, 제조공정은 5가지, 총 12개가 입력변수로 사용된다. 이들 상호조합에 의해 각각 다른 기 계적 특성이 나타난다. 이러한 기계적 특성을 예측하려는 것은, 각 합금 첨가물과 제조공정이 합금의 기계적 특 성에 어떠한 영향을 끼치는지 파악할 수 있고, 이는 합금 설계 시 주요한 지표가 되기 때문이다. 기존에 작업자 가 이러한 조건들을 조합하여 합금을 설계할 경우, 각 조건들을 개별적으로 통제를 하면서 실험을 수행해야 하 기 때문에 경우의 수가 거의 무한대일 수 있다. 그래서 실질적으로 작업자가 이들 조건들을 모두 고려하면서 합 금 설계를 수행하는 것 자체가 어렵다. 또 합금 공정에 사용되는 모든 조건이 12개의 입력 변수로 사용되기 때 문에 종래에 제안되었던 일부 공정 조건에 한정된 여러 예측 모델보다 실제 개발 시 설계 변수 통제에 더욱 용 이하다. 즉 입력 변수들 각각이 상호관련성이 있기 때문에, 이 모든 조건을 모두 고려한 최적의 합금의 기계적 특성을 더 정확하게 예측할 수 있는 것이다. 상기 입력 변수 중 합금 첨가물은 알루미늄 합금의 주요 화학적 조성물인 아연(Zn), 마그네슘(Mg), 구리(Cu), 지르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)이다. 이러한 화학적 조성물은 본 실시 예의 실험이 7XXX계열 의 알루미늄 합금을 예를 들어 수행하였기 때문이다. 그래서 합금의 특성이나 종류 등에 따라 얼마든지 화학적 조성물은 변경할 수도 있다. 나아가 합금의 미세 구조 및 재료 특성은 합금 요소의 중량 백분율을 조정하여 결 정하였다. 상기 입력 변수 중 제조 공정은 캐스팅 타입(Casting type), 균질화(Homogenization), 압출가공(Extrusion), 고용화 열처리(Solution Treatment), 에이징(Aging) 등을 포함한다. 본 실시 예는 상기 DNN 학습모델에 상기한 12가지 입력변수들을 조합하여 학습하고, 그 결과로 항복강도 (Yield strength, YS), 인장강도(tensile strength, TS), 연신율(elongation, EL)를 예측하게 된다. 이와 같은 합금 조성물 및 공정조건의 입력 변수에 따른 예측결과를 살펴본다. 도 3은 본 발명의 입력 변수 중 합금 조성물에 따른 기계적 특성을 예측한 도면이고, 실험 데이터와 예측 데이 터를 도시하고 있다. 이를 보면, 합금 조성물의 중량%(wt%)의 변화에 대하여 YS, TS 및 EL의 3가지 기계적 특성 의 실험값과 예측값이 대부분 일치하고 있음을 알 수 있다. 예측결과는 아연(Zn), 마그네슘(Mg), 구리(Cu), 지 르코늄(Zr), 티타늄(Ti), 철(Fe) 및 실리콘(Si)의 각 합금 첨가물이 추가됨에 따라 변하는 기계적 특성과 일치 하였고, 이를 통해 DNN 학습모델이 알루미늄 합금의 고유특성을 정확하게 예측하고 있음을 확인할 수 있다. 도 4는 본 발명의 입력 변수 중 공정 조건에 따른 기계적 특성을 예측한 도면이다. 도 4에서 제1 열은 캐스팅 타입(Casting type)에 따른 3가지 기계적 특성, 제2 열은 압출가공(Extrusion)에 따른 3가지 기계적 특성, 제3 열은 균질화(Homogenization)에 따른 3가지 기계적 특성을 나타낸 도면이다. 이를 보면, 제1 열에 있는 캐스팅 타입의 경우 YS, TS의 데이터 분포와 평균선이 대부분 일치하고 있다. 특히 제3 열의 YS, TS 및 EL에서 EL은 매우 정확하게 예측되었음을 알 수 있다. 제2 열의 압출가공은 재료 특성에 따 라 가공경화를 통한 YS 및 TS가 향상됨이 예측되고 있다. 도 5는 용체화 처리 및 에이징에 따른 기계적 특성을 예측한 도면이다. 도 5a 내지 도 5c는 용체화 처리 과정에 따른 인자 특성 예측을 비교한 도면, 도 5d 내지 도 5f는 에이징 과정 의 정도에 따른 인장 특성 예측을 비교한 도면이다. 여기서 용체화 처리 및 에이징 과정에 적용되는 공정조건은 도 5의 우측에 함께 표기하고 있다. 예측 결과를 살펴보면, 실험 데이터와 예측 데이터가 약간의 차이가 있지만 이는 학습 데이터가 부족한 조건에 따른 결과로서, 거의 대부분 일치하고 있음을 알 수 있다. 도 6은 본 발명에 따른 기계적 특성의 예측 결과를 나타낸 도면들이다. DNN 학습모델의 예측 결과를 향상시키기 위해 손실을 최소화하는 최적 방안으로 베이지안 최적화 방법이 이용된 다. 상기 베이지안 최적화 방법은 하이퍼 파라미터 튜닝과정을 통해 이루어지며, 베이지안 하이퍼 파라미터는 총 5가지(learning rate, epoch, number of layers, number of nodes, batch normalization)의 조합으로 이루 어진다. 일반적으로 히든 레이어와 노드들이 많은 DNN 구조는 정확도가 더 높으나, 반대로 너무 많으면 오류 역시 증가 할 수 있다. 또 학습률도 예측율에 영향을 미친다. 학습률이 너무 높으면 오버슈팅 문제가 있고, 너무 낮으면 느린 수렴 속도(convergence rate)에 대한 국부 최소 문제가 발생할 수 있다. 또 에포크 수나 배치 정규화 기술 도 학습률에 영향을 미친다. 본 실시 예는 이러한 베이지안 최적화 방법에 의해 결정된 하이퍼 파라미터와 상기 K-fold 교차 검증 방법에 제 안하며, 제안된 최적의 하이퍼 파라미터가 다른 조합보다 가장 낮은 손실을 보여주고 있다. 예를 들면 도 6a는 동일한 학습 에포크 수에서 수행되는 최적 케이스(Opt. Case) 및 이와 대비되는 케이스(Case 1 ~ 4)를 나타내고 있는데, 최적 케이스가 손실이 가장 낮은 것을 알 수 있다. 표 1"}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "표 1에서, 레이어, 노드 개수 배치 정규화가 유사한 최적 케이스와 케이스 2를 비교하면 학습률에 의해 손실 차 이가 크게 나타나고 있음을 알 수 있다. 따라서 적절한 학습률이 제공되는 것이 중요하다는 것을 알 수 있다. 도 6b 내지 도 6d는 MAPE(mean absolute percentage error)와 결정계수(coefficient of determination, R2)에 따른 YS, TS 및 EL의 실험 결과와 예측 결과 간의 선형 비교를 보여준 도면이다. 실험 데이터의 기울기를 보면 1.00에 가까웠고, 이는 DNN 학습모델이 기계적 특성을 정확하게 예측하고 있 음을 나타낸다. 그리고 베이지안 최적화에 기초하여 평균 MAPE는 약 9.93%의 예측 정확도와, 테스트 세트에서 0.9260의 평균 R2값을 획득하였고, 이 역시 DNN 학습 모델의 높은 예측 정확도를 제시하고 있다. 도 1에서 예측 설명 모델은 상기 예측 모델이 예측한 기계적 특성이 어떠한 근거를 가지고 예측 하였 는지 설명하여 상기 예측 모델의 신뢰성을 증명하기 위한 모델일 수 있다. 즉 예측 모델이 단순히 기계적 특성을 예측하는 것에 더하여 예측 근거를 제공하는 모델을 포함한다. 실질적으로 인공 지능 모델인 DNN 학습 모델이 입력변수에 따라 기계적 특성을 어떻게 예측하는지 설명하 기는 어렵다. 일반적으로 학습 모델이 복잡하면 예측 정확도는 높아질 수 있지만, 그 결과를 해석하는 것은 쉽 지 않다. 그래서 DNN 학습 모델의 신뢰성을 검증하는 것이 필요하기 때문이다. 상기 예측 설명 모델은 LIME 알고리즘을 사용하여 예측 설명을 수행한다. 상기 LIME 알고리즘 이용하면 예 측 모델에 적용되었던 합금 첨가물과 제조공정이 기계적 특성에 긍정적 영향 또는 부정적 영향을 미쳤는지, 또 어느 정도 기여를 하였는지 확인할 수 있다. 도 7a 내지 도 7f는 227개의 샘플 중 기계적 특성의 예측 값이 가장 높은 3개의 데이터 세트를 나타낸다. 그 중 도 7a 내지 도 7c는 기계적 특성에 긍정적 또는 부정적 영향을 미친 합금 첨가제를 설명한다. 구체적으로 Zr(0.1 ~ 0.3wt%)를 첨가하면 YS, TS, EL 모두를 향상시키는데 효과적임을 알 수 있다. 그리고 알루미늄 합금에 Zr을 첨가하면 Zr 원자의 작은 확산성과 우수한 결합 특성으로 인해 열 안정성이 향상된다. 반면 Zr은 알루미늄 고용체(solid solution)에 용해되지 않는다. 그러나 소량의 Zr은 알루미늄 합금의 응고 중에 용해될 수 있기 때 문에, 7XXX 계열의 알루미늄 합금의 열 안정성을 개선하기 위해 0.13wt%까지 Zr를 첨가할 수 있다. 도 7b는 Cu와 Mg의 첨가가 EL에 부정적인 영향을 미치는 것을 보여준다. 즉, AL-Zn 합금의 Mg 합금은 강화 침전 물(strengthening precipitates)의 형성에 의해 열처리에 대한 더 큰 경화 반응을 생성하기 때문이다. 또 도 7b 를 보면 Mg의 함량이 높을 수록 강도는 향상되나, 강하 침전물의 부피 율이 크기 때문에 연성에 악영향을 미치게 된다. 유사하게 Al-Zn-Mg 합금에 Cu를 첨가하여 일부 유익한 효과를 기대할 수도 있지만, Cu는 응고 중에 Al7Cu2Fe 및 Al2CuMg와 같은 거친 금속간 입자를 형성하는 경향이 있기 때문에 강도 및 연성에 대한 부정적인 영 향도 관찰되기도 한다. 이러한 거친 입자는 부서지기 쉽고 소성 변형 동안 파괴되는 부위로 작용한다. 도 7a 내지 도 7c는 7xxx Al 합금의 기계적 특성에 대한 Fe 및 Si의 영향을 보여주고 있다. 여기서 Fe와 Si는 상용 Al-Zn-Mg-Cu 합금에서 가장 흔하고 피할 수 없는 불순물이다. Fe는 Al 합금에 대한 용해도가 0.005wt%로 매우 낮아 응고 중에 Al7Cu2Fe, Al3Fe, Al8Fe2Si 등과 같은 금속간 입자를 형성한다. 그리고 Al 합금의 Fe 함량 이 0.12wt% 미만인 경우 기계적 특성에 부정적인 영향 없이 YS와 TS가 모두 증가한다. 반대로, Si 첨가는 Mg 및 Zn 기반 η' 상의 핵 생성 전에 Mg 원자가 쉽게 소비되어 Mg2Si를 형성하는 소량(0.02 ~ 0.03wt%)에도 불구하고 YS 및 TS에 부정적이라 할 수 있다. 도 7d 내지 도 7f는 기계적 특성에 긍정적 또는 부정적 영향을 미치는 제조 공정을 설명하는 데이터이다. 압출 가공(Extrusion)은 결정립 미세화 및 기하학적 필요 전위(GND) 밀도 증가로 인해 YS 및 TS를 증가시키는 가장 효과적인 방법이다. 또한 빌렛 주조(billet casting)는 주조 불량이 적기 때문에 PM 주조보다 우수하다. 자연 에이징과 인공 에이징을 포함한 에이징 과정은 YS에 긍정적이지만 TS에 중립적이며 EL에 부정적이다. 이것은 YS 와 EL 사이의 trade-off 관계 때문이다. 즉 Al 합금의 낮은 변형 경화율(strain hardening rate)로 인해 TS가 유지되기 때문이다. 물론, 공정 조건 중 균질화(Homogenization) 공정은 YS 및 TS에 부정적인 영향을 미치고 있음을 알 수 있다. 이 러한 균질화 공정은 알루미늄 합금 제조에 필요한 공정이긴 하나, 고온에서의 과도한 균질화 과정은 결정립 성 장을 초래하여 매트릭스의 강도를 저하시키기 때문이다. 그리고 주조 합금에서 가장 낮은 EL은 응고 동안 수지상 경계에서 Al2Mg3Zn3 및 Al2CuMg와 같은 이종금속간 상이 형성되는 것이 설명되고 있다. 그러나 이러한 금속간 상은 본질적으로 부서지기 쉽고 매트릭스에서 쉽게 부서져 보이드(void)를 형성하여 합금의 조기 파괴를 유발하는 원인이 된다. 이와 같은 LIME 알고리즘에 의한 결과를 살펴보면, 실험 데이터 세트에서 보고된 Al-Zn-Mg-Cu 합금 처리 중 기 계적 특성 변화와 일치함을 확인할 수 있다. 도 1에서 추천 모델은 원하는 기계적 특성의 합금을 설계할 수 있도록 공정조건을 추천하는 모델일 수 있 다. 추천 모델은 특정 기계적 특성을 가지는 합금 설계를 위해 합금 첨가물 및 제조 공정의 새로운 조합을 추 천하는 것이다. 추천 모델은, 합금 첨가물과 제조공정에 따라 난수를 생성한다. 여기서 상기 난수는 합금 첨가물의 경우 데이터 세트의 각 원소들의 함량 범위에서 유리수(rational number)를 갖는 난수(random numbers)가 생성되는 것이고, 제조 공정의 경우 정수(integers)가 있는 난수가 생성된다. 또 제조 공정에서 빌렛 주조(billet casting)와 압출 가공(Extrusion)은 고정변수로 설정하고, 다른 변수는 훈련 데이터 세트 및 테스트 데이터 세 트에 사용된 값의 범위 내에서 무작위로 생성한다. 추천 모델은 상기 무작위로 생성된 데이터 세트를 상기 DNN 학습 모델에 입력하고 각 데이터 세트에 해당하는 기계적 특성을 예측한다. 추천 모델은 예측된 결과 중 학습 데이터에 비해 기계적 물성이 향상된 데이터를 선정하고, 이 데이터 중 에서 실제 제작 가능한 조합을 선정한다. 이렇게 선정된 데이터들이 추천되는 것이다. 다음 표 2는 추천 모델이 추천한 합금 공정 조건의 예시이다. 표 2 표 2를 보면 기계적 특성이 좋은 6개의 샘플 공정 조건이 추천되었다. 추천 방법은 YS와 EL 값을 기준으로 하였 다. 그 중 YS × EL 값이 가장 높을 것으로 예측된 첫 번째 및 네 번째 공정 조건이 선택될 수 있다. 이를 보면, 공정 조건의 추천 사항은 YS는 704.12MPa 및 668.26MPa, TS는 742.27MPa 및 727.06MPa, EL은 19.66% 및 20.86%이다. 그리고 다음 표 3은 실제 제조한 합금의 기계적 특성을 나타내고 있다. 표 3"}
{"patent_id": "10-2022-0032556", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 3을 보면, 추천 모델이 제시한 공정 조건에 따라 합금을 제조한 결과, 실제 합금의 기계적 특성이 매우 유사하다는 것을 확인할 수 있다. 도 8은 추천된 공정조건에 의해 설계된 7XXX 계열의 알루미늄 합금의 미세 구조 특성화를 수행한 결과 도면으로, (a)는 Microstructure Analysis, (b)는 Grain structure Analysis, (c)는 Precipitation Analysis 를 각각 보여주고 있다. 그리고 이와 같은 7XXX 계열의 알루미늄 합금의 특성은 에이징 공정 후 데이터 세트에서 관찰된 대표적인 미세 구조 특성, 즉 도 9와 유사함을 알 수 있다. 이상과 같이 본 발명의 도시된 실시 예를 참고하여 설명하고 있으나, 이는 예시적인 것들에 불과하며, 본 발명 이 속하는 기술 분야의 통상의 지식을 가진 자라면 본 발명의 요지 및 범위에 벗어나지 않으면서도 다양한 변형, 변경 및 균등한 타 실시 예들이 가능하다는 것을 명백하게 알 수 있을 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 청구범위의 기술적인 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0032556", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시 예에 따른 합금 설계 시스템을 도시한 전체 구성도이다. 도 2는 도 1의 예측 모델의 내부 구성도이다. 도 3은 본 발명의 입력 변수 중 합금 조성물에 따른 기계적 특성을 예측한 도면이다. 도 4는 본 발명의 입력 변수 중 공정 조건에 따른 기계적 특성을 예측한 도면이다. 도 5는 용체화 처리 및 에이징에 따른 기계적 특성을 예측한 도면이다. 도 6은 본 발명에 따른 기계적 특성의 예측 결과를 나타낸 도면들이다. 도 7은 본 발명의 예측 설명 모델이 예측된 기계적 특성의 설명 예시 도면이다. 도 8은 본 발명의 추천 모델이 추천한 공정조건에 의해 설계된 7XXX 계열의 알루미늄 합금의 미세 구조 특성화 를 수행한 결과 도면이다. 도 9은 도 8과 비교되는 도면으로, 에이징 공정 후 데이터 세트에서 관찰된 7XXX 계열의 알루미늄 합금의 특성 은 대표적인 미세 구조 특성도면이다."}
