{"patent_id": "10-2017-0157854", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0082950", "출원번호": "10-2017-0157854", "발명의 명칭": "디스플레이 장치 및 그의 서비스 제공 방법", "출원인": "삼성전자주식회사", "발명자": "김혜원"}}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이 장치에 있어서,컨텐츠 재생 화면을 표시하는 디스플레이부; 및재생중인 컨텐츠를 인식하고, 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식하며, 상기 디스플레이 장치를 사용하는 사용자를 판단하고, 상기 판단된 사용자의 정보를 기초로 상기 인식된 적어도 하나의 오브젝트 중하나를 선택하며, 상기 선택된 오브젝트와 관련된 서비스를 상기 판단된 사용자에게 제공하는 프로세서;를 포함하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,서버와 통신하는 통신부;를 더 포함하고,상기 프로세서는,상기 디스플레이부에 표시된 화면의 특징을 추출하여 핑거프린트를 생성하고, 상기 생성된 핑거프린트에 대응되는 컨텐츠 정보를 서버에 질의하도록 상기 통신부를 제어하며, 상기 서버로부터 수신된 컨텐츠 정보를 이용하여컨텐츠를 인식하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서는,상기 디스플레이부에 표시된 화면에서 상품에 해당하는 오브젝트를 인식하고, 상기 인식된 컨텐츠의 메타데이터를 기초로 상기 표시된 화면에서 인물에 해당하는 오브젝트를 인식하며, 상기 인식된 인물과 상품을 클러스터링하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는,상기 표시된 화면에서의 위치를 기초로, 상기 인물과 상품 사이의 관련성 존부를 판단하고, 관련성이 있으면 상기 인식된 인물과 상품을 클러스터링하며, 관련성이 없으면 상기 상품을 필터링하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,상기 판단된 사용자가 2명 이상이면, 화면이 변경될 때마다 상기 2명 이상의 사용자 중 한 명의 사용자를 상기디스플레이 장치를 사용하는 사용자로 판단하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 프로세서는,상기 적어도 하나의 오브젝트에 대한 선호도 순위를 결정하고, 상기 2명 이상의 사용자 중에서, 최우선 순위로공개특허 10-2018-0082950-3-결정된 오브젝트에 대한 선호도가 가장 높은 사용자를 상기 디스플레이 장치를 사용하는 사용자로 판단하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,사용자의 생체 정보를 입력받는 입력부;를 더 포함하고,상기 프로세서는,상기 입력부를 통해 입력된 생체 정보와 기저장된 생체 정보를 비교하여, 상기 디스플레이 장치를 사용하는 사용자를 판단하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,이미지를 촬영하는 카메라;를 더 포함하고,상기 프로세서는,상기 카메라를 통해 촬영된 상기 디스플레이 장치의 전방에 위치한 기설정된 영역의 이미지에 포함된 사용자를상기 디스플레이 장치를 사용하는 사용자로 판단하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "디스플레이 장치의 서비스 제공 방법에 있어서,재생중인 컨텐츠를 인식하는 단계;상기 컨텐츠의 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식하는 단계;상기 디스플레이 장치를 사용하는 사용자를 판단하는 단계;상기 판단된 사용자의 정보를 기초로, 상기 인식된 적어도 하나의 오브젝트 중 하나를 선택하는 단계; 및상기 선택된 오브젝트와 관련된 서비스를 상기 판단된 사용자에게 제공하는 단계;를 포함하는 서비스 제공방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 컨텐츠를 인식하는 단계는,상기 표시된 화면의 특징을 추출하여 핑거프린트를 생성하는 단계;상기 생성된 핑거프린트에 대응되는 컨텐츠 정보를 서버에 질의하는 단계; 및상기 서버로부터 수신된 컨텐츠 정보를 이용하여, 컨텐츠를 인식하는 단계;를 포함하는 서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 오브젝트를 인식하는 단계는,상기 표시된 화면에서 상품에 해당하는 오브젝트를 인식하는 단계;상기 인식된 컨텐츠의 메타데이터를 기초로 상기 표시된 화면에서 인물에 해당하는 오브젝트를 인식하는 단계;및상기 인식된 인물과 상품을 클러스터링하는 단계;를 포함하는 서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2018-0082950-4-제11항에 있어서,상기 클러스터링하는 단계는,상기 표시된 화면에서의 위치를 기초로, 상기 인물과 상품 사이의 관련성 존부를 판단하는 단계; 및관련성이 있으면 상기 인식된 인물과 상품을 클러스터링하고, 관련성이 없으면 상기 상품을 필터링하는 단계;를포함하는 서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 사용자를 판단하는 단계는,상기 판단된 사용자가 2명 이상이면, 화면이 변경될 때마다 상기 2명 이상의 사용자 중 한 명의 사용자를 상기디스플레이 장치를 사용하는 사용자로 판단하는 서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 사용자를 판단하는 단계는,상기 적어도 하나의 오브젝트에 대한 선호도 순위를 결정하는 단계; 및상기 2명 이상의 사용자 중에서, 최우선 순위로 결정된 오브젝트에 대한 선호도가 가장 높은 사용자를 상기 디스플레이 장치를 사용하는 사용자로 판단하는 단계;를 포함하는 서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,상기 사용자를 판단하는 단계는,상기 사용자의 생체 정보를 입력받는 단계; 및상기 입력된 생체 정보와 기저장된 생체 정보를 비교하여, 상기 디스플레이 장치를 사용하는 사용자를 판단하는단계;를 포함하는 서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서,상기 사용자를 판단하는 단계는,상기 디스플레이 장치의 전방에 위치한 기설정된 영역에 대한 이미지를 촬영하는 단계; 및상기 촬영된 이미지에 포함된 사용자를 상기 디스플레이 장치를 사용하는 사용자로 판단하는 단계;를 포함하는서비스 제공 방법."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "인공지능 신경망(Neural Network) 모델을 이용하는 디스플레이 장치에 있어서,컨텐츠 재생 화면을 표시하는 디스플레이부; 및재생중인 컨텐츠를 인식하고, 상기 인식된 컨텐츠를 인공지능 신경망(Neural Network) 모델에 입력하여 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식하며, 상기 디스플레이 장치를 사용하는 사용자를 판단하고, 상기판단된 사용자의 정보를 기초로 상기 인식된 적어도 하나의 오브젝트 중 하나를 선택하며, 상기 선택된 오브젝트와 관련된 서비스를 상기 판단된 사용자에게 제공하는 프로세서;를 포함하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,공개특허 10-2018-0082950-5-서버와 통신하는 통신부;를 더 포함하고,상기 프로세서는,상기 디스플레이부에 표시된 화면의 특징을 추출하여 핑거프린트를 생성하고, 상기 생성된 핑거프린트에 대응되는 컨텐츠 정보를 서버에 질의하도록 상기 통신부를 제어하며, 상기 서버로부터 수신된 컨텐츠 정보를 이용하여컨텐츠를 인식하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 프로세서는,상기 디스플레이부에 표시된 화면에서 상품에 해당하는 오브젝트를 인식하고, 상기 인식된 컨텐츠의 메타데이터를 기초로 상기 표시된 화면에서 인물에 해당하는 오브젝트를 인식하며, 상기 인식된 인물과 상품을 클러스터링하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 프로세서는,상기 표시된 화면에서의 위치를 기초로, 상기 인물과 상품 사이의 관련성 존부를 판단하고, 관련성이 있으면 상기 인식된 인물과 상품을 클러스터링하며, 관련성이 없으면 상기 상품을 필터링하는 디스플레이 장치."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "디스플레이 장치 및 그의 서비스 제공 방법에 제공된다. 본 개시의 일 실시 예에 따른 디스플레이 장치는, 컨텐 츠 재생 화면을 표시하는 디스플레이부 및 재생중인 컨텐츠를 인식하고, 현재 표시된 화면에서 적어도 하나의 오 브젝트를 인식하며, 디스플레이 장치를 사용하는 사용자를 판단하고, 판단된 사용자의 정보를 기초로 인식된 적 어도 하나의 오브젝트 중 하나를 선택하며, 선택된 오브젝트와 관련된 서비스를 판단된 사용자에게 제공하는 프 로세서를 포함할 수 있다."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 디스플레이 장치 및 그의 서비스 제공 방법에 관한 것으로, 더욱 구체적으로는, 현재 디스플레이 장 치를 사용하는 사용자에게 맞춤 ACR 서비스를 제공할 수 있는 디스플레이 장치 및 그의 서비스 제공 방법에 관 한 것이다. 또한, 본 개시는 딥러닝 등의 기계 학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 인 공지능(AI) 시스템 및 그 응용에 관련된 것이다."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(Artificial Intelligence, AI) 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템이며, 기존 Rule 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공지능 시스템은 사용 할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 Rule 기반 스마트 시스템은 점차 딥러닝 기반 인공지능 시스템으로 대체되고 있다. 인공지능 기술은 기계학습(딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소기술은 딥러닝 등의 기계학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제 어 등의 기술 분야로 구성된다. 인공지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조작 제어(행동 제어) 등을 포함한다. 한편, 근래에는 디스플레이 장치에서 현재 표시되는 컨텐츠를 인식할 수 있는 ACR(Automatic Cotent Recognition) 기술이 개발되었다. 사용자가 현재 어떠한 컨텐츠를 시청하고 있는지를 알 수 있다면, 디스플레이 장치는 타게팅 광고, 컨텐츠 추천, 연관 정보 검색 등의 지능형 서비스를 제공할 수 있다. 하지만, 가정이나 공공장소에서 사용되는 디스플레이 장치는 여러 사람이 공동으로 사용하는 장치이다. 따라서 디스플레이 장치를 사용하는 여러 사람에게 동일한 상품, 서비스에 대한 정보가 제공될 수밖에 없다. 여러 사용자가 선호하는 상품, 서비스 등이 상이할 수 있기 때문에, 종래의 ACR 기반 서비스는 일부 사용자에게 만 적합한 서비스를 제공할 수 있다는 문제점이 존재한다."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위한 것으로, 화면 내에서 인식되는 오브젝트를 클러스터링하고, 현재 디 스플레이 장치의 사용자를 판단하며, 판단된 사용자에게 적합한 클러스터링된 오브젝트를 선정함으로써, 개인화 된 ACR 기반 서비스를 제공할 수 있는 디스플레이 장치 및 그의 서비스 제공 방법을 제공함을 목적으로 한다."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 개시의 일 실시 예에 따른 디스플레이 장치는, 컨텐츠 재생 화면을 표시하는 디 스플레이부 및 재생중인 컨텐츠를 인식하고, 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식하며, 상기 디스플레이 장치를 사용하는 사용자를 판단하고, 상기 판단된 사용자의 정보를 기초로 상기 인식된 적어도 하나 의 오브젝트 중 하나를 선택하며, 상기 선택된 오브젝트와 관련된 서비스를 상기 판단된 사용자에게 제공하는 프로세서를 포함할 수 있다. 그리고, 서버와 통신하는 통신부를 더 포함하고, 상기 프로세서는, 상기 디스플레이부에 표시된 화면의 특징을 추출하여 핑거프린트를 생성하고, 상기 생성된 핑거프린트에 대응되는 컨텐츠 정보를 서버에 질의하도록 상기 통신부를 제어하며, 상기 서버로부터 수신된 컨텐츠 정보를 이용하여 컨텐츠를 인식할 수 있다. 또한, 상기 프로세서는, 상기 디스플레이부에 표시된 화면에서 상품에 해당하는 오브젝트를 인식하고, 상기 인 식된 컨텐츠의 메타데이터를 기초로 상기 표시된 화면에서 인물에 해당하는 오브젝트를 인식하며, 상기 인식된 인물과 상품을 클러스터링할 수 있다. 그리고, 상기 프로세서는, 상기 표시된 화면에서의 위치를 기초로, 상기 인물과 상품 사이의 관련성 존부를 판 단하고, 관련성이 있으면 상기 인식된 인물과 상품을 클러스터링하며, 관련성이 없으면 상기 상품을 필터링할 수 있다. 또한, 상기 프로세서는, 상기 판단된 사용자가 2명 이상이면, 화면이 변경될 때마다 상기 2명 이상의 사용자 중 한 명의 사용자를 상기 디스플레이 장치를 사용하는 사용자로 판단할 수 있다. 그리고, 상기 프로세서는, 상기 적어도 하나의 오브젝트에 대한 선호도 순위를 결정하고, 상기 2명 이상의 사용 자 중에서, 최우선 순위로 결정된 오브젝트에 대한 선호도가 가장 높은 사용자를 상기 디스플레이 장치를 사용 하는 사용자로 판단할 수 있다. 또한, 사용자의 생체 정보를 입력받는 입력부를 더 포함하고, 상기 프로세서는, 상기 입력부를 통해 입력된 생 체 정보와 기저장된 생체 정보를 비교하여, 상기 디스플레이 장치를 사용하는 사용자를 판단할 수 있다. 그리고, 이미지를 촬영하는 카메라를 더 포함하고, 상기 프로세서는, 상기 카메라를 통해 촬영된 상기 디스플레 이 장치의 전방에 위치한 기설정된 영역의 이미지에 포함된 사용자를 상기 디스플레이 장치를 사용하는 사용자 로 판단할 수 있다. 한편, 상기 목적을 달성하기 위한 본 개시의 일 실시 예에 따른 디스플레이 장치의 서비스 제공 방법은, 재생중 인 컨텐츠를 인식하는 단계, 상기 컨텐츠의 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식하는 단계, 상 기 디스플레이 장치를 사용하는 사용자를 판단하는 단계, 상기 판단된 사용자의 정보를 기초로 상기 인식된 적 어도 하나의 오브젝트 중 하나를 선택하는 단계 및 상기 선택된 오브젝트와 관련된 서비스를 상기 판단된 사용 자에게 제공하는 단계를 포함할 수 있다.그리고, 상기 컨텐츠를 인식하는 단계는, 상기 표시된 화면의 특징을 추출하여 핑거프린트를 생성하는 단계, 상 기 생성된 핑거프린트에 대응되는 컨텐츠 정보를 서버에 질의하는 단계 및 상기 서버로부터 수신된 컨텐츠 정보 를 이용하여, 컨텐츠를 인식하는 단계를 포함할 수 있다. 또한, 상기 오브젝트를 인식하는 단계는, 상기 표시된 화면에서 상품에 해당하는 오브젝트를 인식하는 단계, 상 기 인식된 컨텐츠의 메타데이터를 기초로 상기 표시된 화면에서 인물에 해당하는 오브젝트를 인식하는 단계 및 상기 인식된 인물과 상품을 클러스터링하는 단계를 포함할 수 있다. 그리고, 상기 클러스터링하는 단계는, 상기 표시된 화면에서의 위치를 기초로, 상기 인물과 상품 사이의 관련성 존부를 판단하는 단계 및 관련성이 있으면 상기 인식된 인물과 상품을 클러스터링하고, 관련성이 없으면 상기 상품을 필터링하는 단계를 포함할 수 있다. 또한, 상기 사용자를 판단하는 단계는, 상기 판단된 사용자가 2명 이상이면, 화면이 변경될 때마다 상기 2명 이 상의 사용자 중 한 명의 사용자를 상기 디스플레이 장치를 사용하는 사용자로 판단할 수 있다. 그리고, 상기 사용자를 판단하는 단계는, 상기 적어도 하나의 오브젝트에 대한 선호도 순위를 결정하는 단계 및 상기 2명 이상의 사용자 중에서, 최우선 순위로 결정된 오브젝트에 대한 선호도가 가장 높은 사용자를 상기 디 스플레이 장치를 사용하는 사용자로 판단하는 단계를 포함할 수 있다. 또한, 상기 사용자를 판단하는 단계는, 상기 사용자의 생체 정보를 입력받는 단계 및 상기 입력된 생체 정보와 기저장된 생체 정보를 비교하여, 상기 디스플레이 장치를 사용하는 사용자를 판단하는 단계를 포함할 수 있다. 그리고, 상기 사용자를 판단하는 단계는, 상기 디스플레이 장치의 전방에 위치한 기설정된 영역에 대한 이미지 를 촬영하는 단계 및 상기 촬영된 이미지에 포함된 사용자를 상기 디스플레이 장치를 사용하는 사용자로 판단하 는 단계를 포함할 수 있다. 또한, 상기 목적을 달성하기 위한 본 개시의 일 실시 예에 따른 인공지능 신경망(Neural Network) 모델을 이용 하는 디스플레이 장치에 있어서, 컨텐츠 재생 화면을 표시하는 디스플레이부 및 재생중인 컨텐츠를 인식하고, 상기 인식된 컨텐츠를 인공지능 신경망(Neural Network) 모델에 입력하여 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식하며, 상기 디스플레이 장치를 사용하는 사용자를 판단하고, 상기 판단된 사용자의 정보를 기초 로 상기 인식된 적어도 하나의 오브젝트 중 하나를 선택하며, 상기 선택된 오브젝트와 관련된 서비스를 상기 판 단된 사용자에게 제공하는 프로세서를 포함할 수 있다."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 개시의 다양한 실시 예에 따르면, 디스플레이 장치는 각각의 사용자에게 맞춤 ACR 기반 서비스 를 제공할 수 있다."}
{"patent_id": "10-2017-0157854", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 개시의 바람직한 실시 예가 첨부된 도면을 참조하여 상세히 설명한다. 본 개시를 설명함에 있어 서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단된 경우 그 상세한 설명은 생략한다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되지는 않는다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 항목들의 조합 또는 복수의 관련된 항목들 중의 어느 하나의 항목을 포함한다. 본 명세서에서 사용한 용어는 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 제한 및/또는 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, 포함하다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 숫자, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 실시 예에 있어서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 또는 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특 정한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프로세서로 구현될 수 있다. 한편, 본 개시에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지 능 전자 장치)를 지칭할 수 있다. 이하에서는 첨부된 도면을 이용하여 본 개시에 대하여 구체적으로 설명한다. 도 1은 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 설명하기 위한 개략적인 블록도이다. 디스 플레이 장치는 스마트 TV일 수 있으나, 이는 일 실시 예에 불과할 뿐, 프로젝션 TV, 모니터, 키오스크, 노 트북 PC, 타블렛, 스마트폰, PDA, 전자 액자, 테이블 디스플레이 등 다양한 유형의 장치로 구현될 수 있다. 도 1을 참조하면, 디스플레이 장치는 디스플레이부 및 프로세서를 포함할 수 있다. 디스플레이부는 디스플레이 장치에서 제공하는 각종 영상 컨텐츠, 정보, UI 등을 표시할 수 있다. 예 를 들어, 디스플레이부는 live 방송 또는 VOD의 형태로 제공되는 다양한 컨텐츠의 재생 화면을 표시할 수 있다. 프로세서는 현재 재생중인 컨텐츠가 무엇인지 인식할 수 있다. 예를 들어, 프로세서는 표시된 화면의 특징을 추출하여 핑거프린트를 생성할 수 있다. 그리고 프로세서는 생성된 핑거프린트를 서버에 문의 하는 방식으로 ACR(Automatic Cotent Recognition)을 수행할 수 있다. 다른 예로, 프로세서는 생성된 핑 거프린트를 메모리에 저장된 핑거프린트 데이터베이스와 비교하는 방식으로 ACR을 수행할 수도 있다. 핑거프린트는 컨텐츠의 각각의 프레임에 포함된 비디오, 오디오 신호로부터 추출된 특징 데이터이다. 텍스트를 기반으로 한 메타 데이터와는 달리, 핑거프린트는 신호 자체의 고유한 특성을 반영할 수 있다. 본 명세서에서 사용되는 용어 '핑거프린트'는, 특정 영상에 대한 한 개의 핑거프린트를 의미하는 것이거나, 경 우에 따라서는 특정 영상에 대한 복수의 핑거프린트로 구성된 핑거프린트 리스트를 의미하는 것일 수 있다. 프로세서는 디스플레이 장치를 사용하는 사용자를 판단할 수 있다. 예를 들어, 프로세서는 생체 정보를 입력받아 현재 디스플레이 장치를 사용하는 사용자가 누구인지 판단할 수 있다. 다른 예로, 프로세서는 사용자를 촬영하고 얼굴 인식(Face Detection, FD)을 수행하여 현재 디스플레이 장치를 사용하 는 사용자가 누구인지 판단할 수 있다. 프로세서는 판단된 사용자의 선호도, 사용 이력 등을 이용하여 맞춤 서비스를 제공할 수 있다. 만일 여러 사람의 사용자가 판단되면, 프로세서는 컨텐츠의 각각의 프레임(또는 화면)마다 서비스를 제공할 사용자를 결정할 수 있다. 본 명세서에서 사용되는 용어 '프레임'은, 오디오 또는 이미지에 관한 정보를 갖는 일련의 데이터를 말한다. 프 레임은 일정한 시간 동안의 오디오 또는 이미지에 대한 데이터 수 있다. 디지털 영상 컨텐츠의 경우, 초당 30~60개의 이미지 데이터로 구성될 수 있으며, 이런 30~60개 각각의 이미지 데이터를 프레임이라고 할 수 있다. 예를 들어, 영상 컨텐츠의 현재 프레임, 다음 프레임과 같이 사용될 경우, 프레임은 컨텐츠에 포함된 연속적으 로 표시되는 각각의 영상 한 화면을 말할 수 있다. 프로세서는 현재 표시된 화면(또는 프레임)에서 적어도 하나의 오브젝트를 인식할 수 있다. 예를 들어, 오 브젝트는 화면 내의 인물 또는 상품일 수 있다. 프로세서는 인식된 인물과 상품을 클러스터링할 수 있다. 즉, 프로세서는 인물과 관련된 상품으로 인식된 오브젝트를 분류할 수 있다. 판단된 사용자의 인물에 대한 선호도를 기초로, 프로세서는 분류된 오브젝트 중 하나를 선택할 수 있다. 그리고 프로세서는 선택된 오브젝트와 관련된 서비스를 판단된 사용자에게 제공할 수 있다. 상술한 실시 예와 같이 디스플레이 장치는 개인화된 ACR 기반 서비스를 제공할 수 있다. 도 2는 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 상세히 설명하기 위한 블록도이다. 도 2를 참조하면, 디스플레이 장치는 디스플레이부, 프로세서, 통신부, 입력부, 카메라 , 메모리, 영상 수신부 및 영상 처리부를 포함할 수 있다. 도 2의 실시 예에 도시된 구성 요소 이외에도 전자 장치는 오디오 처리부(미도시) 및 오디오 출력부(미도 시), 전원부(미도시) 등 다양한 구성을 포함할 수 있다. 또한, 전자 장치가 반드시 도 2에 도시된 구성을 모두 포함하여 구현되는 것으로 한정되지 않음은 물론이다. 디스플레이부는 디스플레이 장치에서 제공되는 각종 영상 컨텐츠, 정보, UI 등을 표시할 수 있다. 디 스플레이부는 액정 표시 장치(Liquid Crystal Display, LCD), 유기 전기 발광 다이오드(Organic Light Emitting Display, OLED) 또는 플라즈마 표시 패널(Plasma Display Panel, PDP) 등으로 구현되어, 디스플레이 장치를 통해 제공 가능한 다양한 화면을 표시할 수 있다. 통신부는 다양한 유형의 통신 방식에 따라 서버와 통신을 수행하는 기능을 수행한다. 통신부는 유선 또는 무선으로 연결된 서버와 핑거프린트 데이터를 송수신할 수 있다. 또한, 통신부는 서버 에 컨텐츠의 특정 프레임 정보를 전송하고, 해당 프레임에 포함된 오브젝트 인식을 요청할 수도 있다. 그 리고, 통신부는 외부 서버로부터 영상 데이터를 스트리밍할 수도 있다 통신부는 유무선 통신을 지원 하는 다양한 통신 칩을 포함할 수 있다. 예를 들어, 통신부는 유선 LAN, 무선 LAN, WiFi, BT(Bluetooth), NFC(Near Field Communication) 방식으로 동작하는 칩을 포함할 수 있다. 입력부는 디스플레이 장치를 제어하기 위한 다양한 사용자 명령을 수신할 수 있다. 또한, 입력부 는 사용자의 생체 정보를 입력받을 수 있다. 사용자의 생체 정보는 지문 정보, 홍채 정보, 성문 정보 등을 포함할 수 있다. 예를 들어, 입력부는 ACR 기능 실행 버튼에 위치한 지문 인식 센서로 구현되어, ACR 기능 실행 버튼을 누른 사용자의 지문 정보를 수집할 수 있다. 입력부는 버튼, 터치 패드 등으로 구현될 수도 있고, 원격제어장치와 같은 별도의 장치로 구현될 수도 있 다. 입력부가 터치 패드로 구현되는 경우, 디스플레이부와 결합하여 상호 레이어 구조를 이루는 터치 스크린의 형태로 구현될 수도 있다. 터치 스크린은 터치 입력 위치, 면적, 터치 입력의 압력 등을 검출할 수 있 다. 카메라는 스틸 이미지 또는 동영상을 촬영할 수 있다. 예를 들어, 카메라는 특정 촬영 영역을 항상 촬영할 수 있다. 촬영된 영상 프레임 간의 차이를 이용하여, 디스플레이 장치는 촬영 영역에 변화가 발생 하였다는 것을 감지할 수 있다. 예를 들어, 카메라는 디스플레이 장치 전방의 일정 영역을 촬영하고, 프로세서는 촬영된 이미지로부터 사용자가 존재하는지 판단할 수 있다. 그리고, 프로세서는 얼굴 인식 등을 통해 이미지에 포함된 사용자가 누구인지 판단할 수 있다. 카메라는 CCD(Charge Coupled Device), CMOS(Complementary Metal Oxide Semiconductor) 등의 이미지 센 서로 구현될 수 있다. CCD는 각각의 MOS(Metal-Oxide-Silicon) 커패시터가 서로 매우 근접한 위치에 있으면서 전하 캐리어가 커패시터에 저장되고 이송되는 소자이다. CMOS 이미지 센서는 제어회로(control circuit) 및 신 호처리회로(signal processing circuit)를 주변회로로 사용하는 CMOS 기술을 이용하여 화소 수만큼 MOS 트랜지 스터를 만들고 이것을 이용하여 차례차례 출력을 검출하는 스위칭 방식을 채용하는 소자이다. 메모리는 디스플레이 장치를 구동하기 위한 다양한 모듈, 소프트웨어, 데이터를 저장할 수 있다. 예 를 들어, 메모리는 적어도 하나의 사용자에 대한 생체 정보, 시청 이력 정보, 선호도 정보 등을 저장할 수 있다. 메모리는 플래시 메모리, 하드디스크 등의 형태로 구현 가능하다. 예를 들어, 메모리는 디스플레이 장치의 동작 수행을 위한 프로그램을 저장하기 위한 ROM, 디스플레이 장치의 동작 수행에 따른 데이 터를 일시적으로 저장하기 위한 RAM 등을 구비할 수 있다. 또한, 각종 참조 데이터를 저장하기 위한 EEPROM(Electrically Erasable and Programmable ROM) 등을 더 구비할 수 있다. 영상 수신부는 다양한 소스를 통해 영상 컨텐츠 데이터를 수신한다. 예를 들어, 영상 수신부는 외부 의 방송국으로부터 방송 데이터를 수신할 수 있다. 다른 예로, 영상 수신부는 외부 장치(ex. 셋탑박스, DVD 플레이어)로부터 영상 데이터를 수신하거나, 통신부를 통해 외부 서버로부터 스트리밍된 영상 데이터 를 수신할 수 있다. 영상 처리부는 영상 수신부로부터 수신한 영상 데이터에 대한 영상 처리를 수행한다. 영상 처리부 는 영상 데이터에 대한 디코딩, 스케일링, 노이즈 필터링, 프레임 레이트 변환, 해상도 변환과 같은 다양 한 이미지 처리를 수행할 수 있다. 프로세서는 디스플레이 장치의 상술한 구성들을 제어할 수 있다. 예를 들어, 프로세서는 서버 에 생성된 핑거프린트에 대응되는 컨텐츠 정보를 질의하도록 통신부를 제어할 수 있다. 프로세서 는 단일 CPU로 구현될 수도 있고, 복수의 프로세서 및 특정 기능을 수행하는 IP로 구현될 수도 있다. 한편, 프로세서는 기존의 범용 프로세서(예: CPU 또는 application processor)가 상술한 동작들을 수행할 수 있지만, 특정 동작들에 대하여는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩이 동작 을 수행할 수 있다. 이하에서는 도면을 참조하여 프로세서의 동작을 더욱 구체적으로 설명하기로 한다. 도 3은 본 개시의 일부 실시 예에 따른 프로세서의 블록도이다. 도 3을 참조하면, 일부 실시 예에 따른 프 로세서는 데이터 학습부 및 데이터 인식부를 포함할 수 있다. 데이터 학습부는 이미지 분석을 위한 기준을 학습할 수 있다. 프로세서는 학습된 기준에 따라 각 영 상 프레임에서 오브젝트를 인식할 수 있다. 데이터 학습부는 이미지에 포함된 오브젝트를 인식하기 위하여 어떠한 데이터를 이용할 것인지 결정할 수 있다. 또한, 데이터 학습부는 결정된 데이터를 이용하여 오브젝 트를 인식하기 위한 기준을 학습할 수 있다. 데이터 학습부는 학습에 이용될 데이터를 획득하고, 획득된 데이터를 후술할 데이터 인식 모델에 적용함으로써 이미지 분석을 위한 기준을 학습할 수 있다. 데이터 인식부는 학습된 데이터 인식 모델을 이용하여, 소정의 데이터로부터 상황을 인식할 수 있다. 데이 터 인식부는 학습에 의한 기설정된 기준에 따라 소정의 데이터를 획득하고, 획득된 데이터를 입력 값으로 하여 데이터 인식 모델을 이용할 수 있다. 예를 들어, 학습된 특징 추출 모델을 이용하여, 데이터 인식부 는 현재 표시되는 화면에서 오브젝트를 인식할 수 있다. 또한, 데이터 인식 모델 적용의 결과 값으로 획득된 데 이터를 재차 입력 값으로 이용하여, 데이터 인식부는 데이터 인식 모델을 갱신할 수도 있다. 데이터 학습부 및 데이터 인식부 중 적어도 하나는, 하나 또는 복수의 하드웨어 칩 형태로 제작되어 디스플레이 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부 및 데이터 인식부 중 적어도 하 나는 인공 지능(Artifical Intelligence, AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 기존의 범용 프로세서(예를 들어, CPU 또는 application processor) 또는 그래픽 전용 프로세서(예를 들어, GPU, ISP)의 일 부로 제작되어 전술한 각종 디스플레이 장치에 탑재될 수도 있다.도 3의 실시 예에서는 데이터 학습부 및 데이터 인식부가 모두 디스플레이 장치에 탑재된 경우 를 도시하였으나, 이들은 각각 별개의 장치에 탑재될 수도 있다. 예를 들어, 데이터 학습부 및 데이터 인 식부 중 하나는 디스플레이 장치에 포함되고, 나머지 하나는 서버에 포함될 수 있다. 또한 데이 터 학습부 및 데이터 인식부는 서로 유선 또는 무선으로 연결되어, 데이터 학습부가 구축한 모 델 정보가 데이터 인식부로 제공될 수 있고, 데이터 인식부로 입력된 데이터가 추가 학습 데이터로 데이터 학습부로 제공될 수도 있다. 한편, 데이터 학습부 및 데이터 인식부 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 학습부 및 데이터 인식부 중 적어도 하나가 소프트웨어 모듈(또는, 인스트럭션을 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 비일시적 컴퓨터 판독가능 기록매체에 저장될 수 있다. 적어도 하나 의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 어플리케이션에 의해 제공될 수 있다. 또는 적어도 하나의 소프트웨어 모듈 중 일부는 OS에 의해 제공되고, 나머지 일부는 소정의 어플리케이션에 의 해 제공될 수도 있다. 도 4a는 본 개시의 일부 실시 예에 따른 데이터 학습부의 블록도이다. 도 4a를 참조하면, 일부 실시 예에 따른 데이터 학습부는 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학습부 (121-4) 및 모델 평가부(121-5)를 포함할 수 있다. 데이터 획득부(121-1)는 상황 판단에 필요한 데이터를 획득할 수 있다. 예를 들어, 데이터 획득부(121-1)는 디 스플레이부에서 재생되는 화면을 캡쳐하여 이미지 프레임을 획득할 수 있다. 또한, 데이터 획득부(121- 1)는 셋탑박스와 같은 외부 장치로부터 영상 데이터를 수신할 수 있다. 영상 데이터는 복수의 이미지 프레임들 로 구성될 수 있다. 그리고, 데이터 획득부(121-1)는 서버 또는 인터넷과 같은 네트워크에서 학습용 영상 데이터를 수신할 수도 있다. 전처리부(121-2)는 상황 판단을 위한 학습에 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(121-2)는 후술할 모델 학습부(121-4)가 상황 판단을 위한 학습을 위하여 획득된 데이터를 이용 할 수 있도록, 획득된 데이터를 기설정된 포맷으로 가공할 수 있다. 예를 들어, 전처리부(121-2)는 입력된 영상 데이터를 디코딩, 스케일링, 노이즈 필터링, 해상도 변환 등을 수행 하여 동일한 포맷의 이미지 프레임을 만들 수 있다. 그리고 전처리부(121-2)는 입력된 이미지 프레임에서 배경 부분을 제거하여 오브젝트 인식에 적합한 이미지로 변환할 수도 있다. 학습 데이터 선택부(121-3)는 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 선택된 데이터 는 모델 학습부(121-4)에 제공될 수 있다. 학습 데이터 선택부(121-3)는 상황 판단을 위한 기설정된 기준에 따 라, 전처리된 데이터 중에서 학습에 필요한 데이터를 선택할 수 있다. 또한, 학습 데이터 선택부(121-3)는 후술 할 모델 학습부(121-4)에 의한 학습에 의해 기설정된 기준에 따라 데이터를 선택할 수도 있다. 예를 들어, 학습 초기에는 학습 데이터 선택부(121-3)가 전처리된 이미지 프레임들 중 유사도가 높은 이미지 프 레임을 제거할 수 있다. 즉, 초기 학습을 위하여 학습 데이터 선택부(121-3)는 구분하기 쉬운 기준을 학습하도 록 유사도가 낮은 데이터들을 선택할 수 있다. 그리고, 학습 데이터 선택부(121-3)는 학습에 의해 기설정된 기준 중 하나를 공통으로 만족하는 전처리된 이미 지 프레임들을 선택할 수 있다. 이를 통해, 모델 학습부(121-4)는 이미 학습된 기준과는 상이한 다른 기준을 학 습할 수 있다. 모델 학습부(121-4)는 학습 데이터에 기초하여 상황을 어떻게 판단할 지에 관한 기준을 학습할 수 있다. 또한, 모델 학습부(121-4)는 상황 판단을 위하여 어떤 학습 데이터를 이용해야 하는 지에 대한 기준을 학습할 수도 있 다. 예를 들어, 모델 학습부(121-4)는 복수의 이미지 프레임들을 비교하여 이미지를 구분하는 물리적인 특징들을 학 습할 수 있다. 이미지 프레임에서의 foreground와 background의 비율, 오브젝트의 크기, 위치, 배치 형태, 특징 점 추출 등을 통하여 모델 학습부(121-4)는 이미지 분석 기준을 학습할 수 있다. 또한, 모델 학습부(121-4)는 상황 판단에 이용되는 데이터 인식 모델을 학습 데이터를 이용하여 학습시킬 수 있 다. 이 경우, 데이터 인식 모델은 미리 구축된 모델일 수 있다. 예를 들어, 데이터 인식 모델은 기본 학습 데이 터(예를 들어, 샘플 이미지 프레임 등)을 입력 받아 미리 구축된 모델일 수 있다. 데이터 인식 모델은, 인식 모델의 적용 분야, 학습의 목적 또는 장치의 컴퓨터 성능 등을 고려하여 구축될 수 있다. 데이터 인식 모델은, 예를 들어, 신경망(Neural Network)을 기반으로 하는 모델일 수 있다. 예컨대, DNN(Deep Neural Network), RNN(Recurrent Neural Network), BRDNN(Bidirectional Recurrent Deep Neural Network)과 같은 모델이 데이터 인식 모델로서 사용될 수 있으나, 이에 한정되지 않는다. 또한, 전자 장치는 상술한 바와 같은 동작을 수행하기 위하여 인공지능 에이전트(Artificial intelligence agent)를 이용할 수 있다. 이때, 인공지능 에이전트는 AI(Artificial Intelligence) 기반의 서비스(예를 들어, 음성 인식 서비스, 비서 서비스, 번역 서비스, 검색 서비스 등)를 제공하기 위한 전용 프로그램으로서, 기존의 범용 프로세서(예를 들어, CPU) 또는 별도의 AI 전용 프로세서(예를 들어, GPU 등)에 의해 실행될 수 있다. 다양한 실시 예에 따르면, 모델 학습부(121-4)는 미리 구축된 데이터 인식 모델이 복수 개가 존재하는 경우, 입 력된 학습 데이터와 기본 학습 데이터의 관련성이 큰 데이터 인식 모델을 학습할 데이터 인식 모델로 결정할 수 있다. 이 경우, 기본 학습 데이터는 데이터의 타입별로 기분류되어 있을 수 있으며, 데이터 인식 모델은 데이터 의 타입별로 미리 구축되어 있을 수 있다. 예를 들어, 기본 학습 데이터는 학습 데이터가 생성된 지역, 학습 데 이터가 생성된 시간, 학습 데이터의 크기, 학습 데이터의 장르, 학습 데이터의 생성자, 학습 데이터 내의 오브 젝트의 종류 등과 같은 다양한 기준으로 기분류되어 있을 수 있다. 또한, 모델 학습부(121-4)는, 예를 들어, 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient descent)을 포함하는 학습 알고리즘 등을 이용하여 데이터 인식 모델을 학습시킬 수 있다. 예를 들어, 모델 학습부(121-4)는 학습 데이터를 입력 값으로 하는 지도 학습(supervised learning) 을 통하여 데이터 인식 모델을 학습시킬 수 있다. 다른 예로, 모델 학습부(121-4)는 별도의 지도 없이 상황 판단을 위해 필요한 데이터의 종류를 스스로 학습함으로써 상황 판단을 위한 기준을 발견하는 비지도 학습(unsupervised learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또 다른 예로, 모델 학습부(121-4)는 학습에 따른 상황 판단의 결과가 올바른지에 대한 피드백을 이용하는 강화 학습(reinforcement learning)을 통하여, 데이터 인식 모델을 학습시킬 수 있다. 또한, 데이터 인식 모델이 학습되면, 모델 학습부(121-4)는 학습된 데이터 인식 모델을 저장할 수 있다. 이 경 우, 모델 학습부(121-4)는 학습된 데이터 인식 모델을 디스플레이 장치의 메모리에 저장할 수 있다. 또는, 모델 학습부(121-4)는 학습된 데이터 인식 모델을 전자 장치와 유선 또는 무선 네트워크로 연결되는 서버 의 메모리에 저장할 수도 있다. 이 경우, 학습된 데이터 인식 모델이 저장되는 메모리는 디스플레이 장치의 적어도 하나의 다른 구성 요소에 관계된 명령 또는 데이터를 함께 저장할 수도 있다. 또한, 메모리는 소프트웨어 및/또는 프로그램 을 저장할 수도 있다. 예를 들어, 프로그램은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API) 및/또 는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 모델 평가부(121-5)는 데이터 인식 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 인식 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부(121-4)로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 데이터 인식 모델을 평가하기 위한 기설정된 데이터일 수 있다. 초기 인식 모델 구성 단계에서, 평가 데이터는 두 종류의 오브젝트에 대한 이미지 프레임일 수 있다. 이후에 평 가 데이터는 오브젝트의 종류가 증가하는 이미지 프레임의 세트로 대체될 수 있다. 이를 통해 모델 평가부(121- 5)는 데이터 인식 모델의 성능을 점차적으로 검증할 수 있다. 예를 들어, 모델 평가부(121-5)는 평가 데이터에 대한 학습된 데이터 인식 모델의 인식 결과 중에서, 인식 결과 가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정된 임계치를 초과하는 경우 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 예컨대, 소정 기준이 비율 2%로 정의되는 경우, 학습된 데이터 인식 모델이 총 1000개의 평가 데이터 중의 20개를 초과하는 평가 데이터에 대하여 잘못된 인식 결과를 출력하는 경우, 모델 평 가부(121-5)는 학습된 데이터 인식 모델이 적합하지 않은 것으로 평가할 수 있다. 한편, 학습된 데이터 인식 모델이 복수 개가 존재하는 경우, 모델 평가부(121-5)는 각각의 학습된 동영상 인식 모델에 대하여 소정 기준을 만족하는지를 평가하고, 소정 기준을 만족하는 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 이 경우, 소정 기준을 만족하는 모델이 복수 개인 경우, 모델 평가부(121-5)는 평가 점수가 높 은 순으로 미리 설정된 어느 하나 또는 소정 개수의 모델을 최종 데이터 인식 모델로서 결정할 수 있다. 한편, 데이터 학습부 내의 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학 습부(121-4) 및 모델 평가부(121-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치 에 탑재될 수 있다. 예를 들어, 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학 습부(121-4) 및 모델 평가부(121-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예를 들어, CPU 또는 application processor) 또는 그래픽 전용 프로세서(예를 들어, GPU, ISP)의 일부로 제작되어 전술한 각종 디스플레이 장치 에 탑재될 수도 있다. 또한, 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학습부(121-4) 및 모델 평가 부(121-5)는 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학습부(121-4) 및 모델 평가 부(121-5) 중 일부는 디스플레이 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 한편, 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학습부(121-4) 및 모델 평가 부(121-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(121-1), 전처리부(121-2), 학습 데이터 선택부(121-3), 모델 학습부(121-4) 및 모델 평가부(121-5) 중 적어도 하나가 소프트웨어 모듈(또는, 인 스트럭션을 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 비일시적 컴퓨터 판독가능 기록매체 에 저장될 수 있다. 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소정의 어플리 케이션에 의해 제공될 수 있다. 또는 적어도 하나의 소프트웨어 모듈 중 일부는 OS에 의해 제공되고, 나머지 일 부는 소정의 어플리케이션에 의해 제공될 수도 있다. 도 4b는 본 개시의 일부 실시 예에 따른 데이터 인식부의 블록도이다. 도 4b를 참조하면, 일부 실시예에 따른 데이터 인식부는 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결과 제 공부(122-4) 및 모델 갱신부(122-5)를 포함할 수 있다 데이터 획득부(122-1)는 상황 판단에 필요한 데이터를 획득할 수 있으며, 전처리부(122-2)는 상황 판단을 위해 획득된 데이터가 이용될 수 있도록, 획득된 데이터를 전처리할 수 있다. 전처리부(122-2)는 후술할 인식 결과 제공부(122-4)가 상황 판단을 위하여 획득된 데이터를 이용할 수 있도록, 획득된 데이터를 기설정된 포맷으로 가공할 수 있다. 인식 데이터 선택부(122-3)는 전처리된 데이터 중에서 상황 판단에 필요한 데이터를 선택할 수 있다. 선택된 데 이터는 인식 결과 제공부(122-4)에게 제공될 수 있다. 인식 데이터 선택부(122-3)는 상황 판단을 위한 기설정된 기준에 따라, 전처리된 데이터 중에서 일부 또는 전부를 선택할 수 있다. 또한, 인식 데이터 선택부(122-3)는 후술할 모델 학습부(142-4)에 의한 학습에 의해 기설정된 기준에 따라 데이터를 선택할 수도 있다. 인식 결과 제공부(122-4)는 선택된 데이터를 데이터 인식 모델에 적용하여 상황을 판단할 수 있다. 인식 결과 제공부(122-4)는 데이터의 인식 목적에 따른 인식 결과를 제공할 수 있다. 인식 결과 제공부(122-4)는 인식 데 이터 선택부(122-3)에 의해 선택된 데이터를 입력 값으로 이용함으로써, 선택된 데이터를 데이터 인식 모델에 적용할 수 있다. 또한, 인식 결과는 데이터 인식 모델에 의해 결정될 수 있다. 예를 들어, 데이터 인식 모델에 서 결정된 기준에 따라, 인식 결과 제공부(122-4)는 선택된 이미지 프레임을 분석하여 오브젝트를 인식할 수 있 다. 모델 갱신부(122-5)는 인식 결과 제공부(122-4)에 의해 제공되는 인식 결과에 대한 평가에 기초하여, 데이터 인 식 모델이 갱신되도록 할 수 있다. 예를 들어, 모델 갱신부(122-5)는 인식 결과 제공부(122-4)에 의해 제공되는 인식 결과를 모델 학습부(121-4)에게 제공함으로써, 모델 학습부(121-4)가 데이터 인식 모델을 갱신하도록 할 수 있다. 한편, 데이터 인식부 내의 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결 과 제공부(122-4) 및 모델 갱신부(122-5) 중 적어도 하나는, 적어도 하나의 하드웨어 칩 형태로 제작되어 전자 장치에 탑재될 수 있다. 예를 들어, 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결과 제공부(122-4) 및 모델 갱신부(122-5) 중 적어도 하나는 인공 지능(AI; artificial intelligence)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 또는 기존의 범용 프로세서(예를 들어, CPU 또는 application processor) 또는 그래픽 전용 프로세서(예를 들어, GPU, ISP)의 일부로 제작되어 전술한 각종 디스플레이 장치 에 탑재될 수도 있다. 또한, 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결과 제공부(122-4) 및 모델 갱신부(122-5) 하나의 전자 장치에 탑재될 수도 있으며, 또는 별개의 전자 장치들에 각각 탑재될 수도 있다. 예를 들어, 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결과 제공부(122-4) 및 모 델 갱신부(122-5) 중 일부는 디스플레이 장치에 포함되고, 나머지 일부는 서버에 포함될 수 있다. 한편, 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결과 제공부(122-4) 및 모델 갱신부(122-5) 중 적어도 하나는 소프트웨어 모듈로 구현될 수 있다. 데이터 획득부(122-1), 전처리부(122-2), 인식 데이터 선택부(122-3), 인식 결과 제공부(122-4) 및 모델 갱신부(122-5) 중 적어도 하나가 소프트웨어 모 듈(또는, 인스트럭션을 포함하는 프로그램 모듈)로 구현되는 경우, 소프트웨어 모듈은 비일시적 컴퓨터 판독가 능 기록매체에 저장될 수 있다. 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 소 정의 어플리케이션에 의해 제공될 수 있다. 또는 적어도 하나의 소프트웨어 모듈 중 일부는 OS에 의해 제공되고, 나머지 일부는 소정의 어플리케이션에 의해 제공될 수도 있다. 도 5는 본 개시의 일 실시 예에 따른 디스플레이 시스템을 설명하기 위한 도면이다. 도 5를 참조하면, 디 스플레이 시스템은 디스플레이 장치 및 서버로 구성될 수 있다. 이때, 전자 장치는 범용 프로세서를 포함하고, 서버는 인공지능 전용 프로세서를 포함할 수 있다. 또 는, 전자 장치는 적어도 하나의 어플리케이션을 포함할 수 있고, 서버는 운영 체제(operating system)를 포함할 수 있다. 서버는 전자 장치보다 더 집적화되거나, 전용화되거나, 딜레이(delay)가 작거나, 성능이 우수하거나 또는 많은 리소스를 가진 구성 요소로서 인식 모델의 생성, 갱신 또는 적용 시에 요 구되는 많은 연산을 전자 장치보다 신속하고 효과적으로 처리 가능한 구성 요소가 될 수 있다. 이 경우, 전자 장치 및 서버 간에 데이터를 송/수신하기 위한 인터페이스가 정의될 수 있다. 예로, 인식 모델에 적용할 학습 데이터를 인자 값(또는, 매개 값 또는 전달 값)으로 갖는 API(application program interface)가 정의될 수 있다. API는 어느 하나의 프로토콜(예로, 전자 장치에서 정의된 프로토콜)에서 다른 프로토콜(예로, 서버에서 정의된 프로토콜)의 어떤 처리를 위해 호출할 수 있는 서브 루틴 또는 함수의 집합으로 정의될 수 있다. 즉, API를 통하여 어느 하나의 프로토콜에서 다른 프로토콜의 동작 이 수행될 수 있는 환경을 제공될 수 있다. 도 5의 실시 예에서는 디스플레이 장치가 서버에 질의하고, 서버로부터 응답을 수신할 수 있다. 예를 들어, 디스플레이 장치는 서버에 핑거프린트가 포함된 질의를 전송하고, 서버로부터 컨텐 츠 정보를 포함한 응답을 수신할 수 있다. 컨텐츠 정보는 전체 컨텐츠에서 현재 프레임의 위치, 재생 시간, 컨 텐츠 명칭, 컨텐츠 ID, 현재 프레임에 나타나는 출연자, 현재 프레임에 포함된 상품, 컨텐츠 장르, 시리즈 정보 중 적어도 하나를 포함할 수 있다. 다른 예로, 디스플레이 장치는 현재 프레임이 포함된 질의를 서버로 전송하고, 서버로부터 현재 프레임에 포함된 오브젝트 인식 결과를 포함한 응답을 수신할 수도 있다. 디스플레이 장치 자체에서 ACR 및 오브젝트 인식을 모두 수행할 수도 있으나, 서버에서 ACR 및 오브 젝트 인식을 수행할 수도 있다. 이하에서는 서버에서 ACR 및 오브젝트 인식을 수행하는 실시 예를 중심으 로 설명하나, 디스플레이 장치 단독으로 동작할 수도 있음은 물론이다. 도 6은 ACR 과정을 설명하기 위한 도면이다. 도 6의 실시 예에서 디스플레이 장치는 주기적으로 표시된 화 면의 특징을 추출하여 핑거프린트를 생성할 수 있다. 그리고 디스플레이 장치는 생성된 핑거프린트에 대응 되는 컨텐츠 정보를 서버에 질의할 수 있다. 서버는 실시간 방송에 대한 ACR 및 VOD에 대한 ACR을 각 각 수행할 수 있다. 핑거프린트는 프레임에 포함된 비디오, 오디오 신호로부터 추출된 특징 데이터이다. 텍스트를 기반으로 한 메타 데이터와는 달리, 핑거프린트는 신호 자체의 고유한 특성을 반영할 수 있다. 예를 들어, 프레임에 포함된 신호 가 오디오 신호인 경우, 핑거프린트는 오디오 신호의 주파수, 진폭 등의 특징을 표현하는 데이터일 수 있다. 그 리고, 프레임에 포함된 신호가 비디오(또는 스틸 이미지) 신호인 경우, 핑거프린트는 모션 벡터, 색상 등의 특 징을 표현하는 데이터일 수 있다. 도 6에서 서버는 복수의 장치로 구성되도록 도시되었으나, 단일 서버에서 모든 동작을 수행할 수도 있다. 도 6을 참조하면, 서버는 캡쳐 서버, 라이브 인덱싱 서버, 라이브 데이터 서버, 메 타 데이터 서버, VOD 저장부, VOD 인덱서, VOD 데이터 서버, 검색 서버로 구성될 수 있다. 우선 실시간 방송 ACR의 경우, 캡쳐 서버는 방송 신호로부터 각각의 영상 프레임을 추출할 수 있다. 그리 고 캡쳐 서버는 추출된 프레임을 분석하여 핑거프린트를 생성할 수 있다. 실시간 방송의 경우 수 초 정도 의 영상 정보를 캡쳐 서버가 디스플레이 장치보다 먼저 수신할 수 있다. 캡쳐 서버는 메타 데이 터 서버로부터 채널과 방송 시간이 포함된 EPG(Electronic Program Guide) 데이터를 수신할 수 있다. 캡 쳐 서버는 EPG 데이터를 이용하여 현재 수신된 방송 신호의 컨텐츠 및 현재 프레임의 전체 컨텐츠에서의 위치를 판단할 수 있다. 라이브 인덱싱 서버는 캡쳐 서버로부터 수신한 핑거프린트 데이터 및 컨텐츠 정보를 복수의 라이브 데이터 서버에 분산하여 저장할 수 있다. 예를 들어, 라이브 인덱싱 서버는 방송 채널별, 컨텐츠별로 복수의 라이브 데이터 서버 중 하나로 전송할 수 있다. 검색 서버는 실시간 방송에 대한 질의에 대응하여 라이브 데이터 서버에서 질의에 포함된 핑거프린트 와 대응되는 핑거프린트를 검색할 수 있다. 그리고, 검색 서버는 검색된 핑거프린트에 대응되는 컨텐츠 정 보를 디스플레이 장치로 전송할 수 있다. 다음으로 VOD ACR의 경우, 서비스로 제공할 VOD는 VOD 저장부에 저장될 수 있다. VOD의 경우 서버가 미리 모든 영상 프레임에 대한 정보를 가지고 있을 수 있다는 점이 실시간 방송과의 차이점이다. 서버는 VOD 저장부에 저장된 각각의 VOD에 대한 핑거프린트를 생성할 수 있다. 그리고 VOD 인덱서는 메타 데 이터 서버로부터 수신한 해당 VOD의 메타 데이터와 핑거프린트를 매칭하여 복수의 VOD 데이터 서버에 분산하여 저장할 수 있다. VOD의 메타 데이터는 프로그램 또는 컨텐츠의 제목, 장르, 감독, 작가, 등장 인물, 재생 시간 등을 포함할 수 있다. 검색 서버는 VOD에 대한 질의에 대응하여 VOD 데이터 서버에서 대응되는 핑거프린트를 검색할 수 있 다. 그리고, 검색 서버는 검색된 핑거프린트에 대응되는 컨텐츠 정보를 디스플레이 장치로 전송할 수 있다. 이와 같이 디스플레이 장치는 서버에 핑거프린트를 송신하여 대응되는 컨텐츠 정보를 요청할 수 있다. 서버는 요청된 컨텐츠가 실시간 방송인지 VOD인지에 따라 라이브 데이터 서버 또는 VOD 데이터 서버에서 대응되는 핑거프린트를 검색할 수 있다. 그리고, 서버는 검색된 핑거프린트에 대응되는 컨 텐츠 정보를 디스플레이 장치로 전송할 수 있다. 도 7은 오브젝트 인식 과정을 설명하기 위한 도면이다. 디스플레이 장치는 서버로부터 컨텐츠 정보를 수신하여, 현재 프레임이 어느 컨텐츠의 몇번째 프레임인지 알 수 있다. 그리고, 디스플레이 장치는 오브 젝트 인식 서버로 현재 영상 프레임 데이터를 송신할 수 있다. 오브젝트 인식 서버는 수신된 영상 프 레임에서 오브젝트를 인식할 수 있다. 도 7에서는 ACR 기능을 제공하는 서버와 오브젝트 인식 서버가 별도의 장치로 도시되었으나, 동일한 서버 장치에서 ACR 및 오브젝트 인식이 수행될 수도 있다. 또한, 상술한 바와 같이 디스플레이 장치에서 오브젝트 인식이 수행되는 실시 예로 구현될 수도 있다. 도 8a 및 도 8b를 참조하여 오브젝트를 인식하는 방법을 보다 구체적으로 설명하기로 한다. 디스플레이 장치 또는 오브젝트 인식 서버는 표시된 화면에서 상품에 해당하는 오브젝트를 인식할 수 있다. 이하에서 는 설명의 편의를 위하여 디스플레이 장치가 오브젝트 인식 동작을 하는 것으로 설명하기로 한다. 디스플레이 장치는 상품뿐만 아니라 인물에 해당하는 오브젝트를 인식할 수도 있다. 하지만, 컨텐츠 정보 로부터 현재 화면에 등장하는 인물 정보를 알 수 있기 때문에, 디스플레이 장치는 표시된 화면에서 주로 상품에 해당하는 오브젝트를 인식하도록 구현될 수 있다. 도 8a는 특징점을 추출하여 오브젝트를 인식하는 방법을 설명하기 위한 도면이다. 디스플레이 장치는 표시 된 화면에서 특징점을 추출하여 기저장된 상품 이미지들과 매칭할 수 있다. 매칭 결과에 따라 디스플레이 장치 는 오브젝트가 어떤 상품에 해당하지 판단할 수 있다. 예를 들어, 디스플레이 장치는 영상으로부터 크기와 회전에 불변하는 특징점을 추출할 수 있다. 주로 오브 젝트의 외곽 부분, 글자나 형상이 있는 모양 등이 특징점으로 추출될 수 있다. 다른 예로, 디스플레이 장치 는 여러 개의 영상 프레임으로부터 스케일, 조명, 시점 등의 환경 변화에 불변하는 특징점을 추출할 수 있 다. 도 8b는 학습을 통해 오브젝트를 인식하는 방법을 설명하기 위한 도면이다. 디스플레이 장치는 인공지능을 이용한 학습을 통하여 화면에 표시된 상품을 인식할 수 있다. 디스플레이 장치는 지도 학습 또는 비지도 학습 방법을 통해 오브젝트를 구분할 수 있는 기준을 학습할 수 있다.예를 들어, 디스플레이 장치는 복수의 이미지 프레임들을 비교하여 이미지를 구분하는 물리적인 특징들을 학습할 수 있다. 이미지 프레임에서의 foreground와 background의 비율, 오브젝트의 크기, 위치, 배치 형태 등 을 통하여 디스플레이 장치는 이미지 분석 기준을 학습할 수 있다. 그리고, 디스플레이 장치는 학습된 이미지 분석 기준을 기초로 화면에 표시된 오브젝트를 인식할 수 있다. 도 9는 오브젝트 클러스터링을 설명하기 위한 도면이다. 도 8a 및 도 8b에 각각 도시된 방법에 의하여, 디스플 레이 장치는 상품에 해당하는 오브젝트를 인식할 수 있다. 디스플레이 장치는 인식된 상품 1 및 상품 2를 인물과 클러스터링할 수 있다. 그리고, 디스플레이 장치는 클러스터링된 오브젝트를 각각의 영상 프레 임과 매칭하여 저장할 수 있다. 디스플레이 장치는 ACR 과정에서 획득한 컨텐츠의 메타 데이터를 기초로 표시된 화면에서 인물에 해당하는 오브젝트를 인식할 수 있다. 메타 데이터에는 각각의 프레임에 등장하는 인물 정보가 포함될 수 있다. 예를 들 어, 디스플레이 장치는 표시되는 컨텐츠의 주인공 위주로 클러스터링을 진행할 수 있다. 디스플레이 장치 의 사용자들이 주로 관심을 보이는 상품은 주인공들이 사용하는 상품이기 때문이다. 도 9의 상부 도면은 디스플레이 장치가 3명의 인물과 2개의 상품을 인식한 것을 도시한 도면이다. 그리고, 도 9의 하부 도면은 디스플레이 장치가 오브젝트 클러스터링을 수행한 결과를 도시한 도면이다. 우선 디스플레이 장치는 메타 데이터를 이용하여 인식된 3명의 인물 중 주요 인물이 아닌 가운데 인물을 필터링할 수 있다. 그리고, 디스플레이 장치는 표시된 화면에서의 위치를 기초로, 인식된 인물과 상품 사 이의 관련성 존부를 판단할 수 있다. 만일 관련성이 있는 것으로 판단되면, 디스플레이 장치는 인식된 인 물과 상품을 클러스터링할 수 있다. 반대로 관련성이 없는 것으로 판단되면, 디스플레이 장치는 상품을 필 터링할 수 있다. 도 9에서, 디스플레이 장치는 화면에서의 위치를 기초로 인식된 2개의 상품이 각각 좌측, 우측의 인물과 관련되어 있는 것으로 판단할 수 있다. 메타 데이터로부터 좌측 및 우측의 인물이 누구인지 알 수 있기 때문에, 디스플레이 장치는 인물명으로 대표되도록 상품과 인물 오브젝트를 클러스트링할 수 있다. 이를 통해, 디스플레이 장치는 남자 주인공이 착용한 가방, 여자 주인공이 착용한 가방과 같이 사용자가 관심있는 정보를 중심으로 인식된 오브젝트들을 정리할 수 있다. 실시간 방송의 경우에 상술한 오브젝트 인식 및 클러스터링 과정이 실시간으로 이루어지게 된다. VOD의 경우에 는 미리 각각의 프레임에 대한 오브젝트 인식 및 클러스터링 과정이 완료되어, 클러스터링된 오브젝트 정보가 데이터 베이스로 구축될 수 있다. 본 개시의 일 실시 예에 따르면, 디스플레이 장치는 현재 디스플레이 장치를 사용하는 사용자가 누구 인지 판단할 수 있다. 예를 들어, 디스플레이 장치는 사용자의 생체 정보를 수집할 수 있다. 그리고, 디스 플레이 장치는 수집된 생체 정보를 기저장된 생체 정보와 비교하여 사용자가 누구인지 판단할 수 있다. 구 체적으로, 디스플레이 장치는 리모컨을 통해 사용자의 지문을 인식할 수도 있고, 카메라를 이용하여 사용 자의 홍채를 인식할 수도 있다. 다른 예로, 디스플레이 장치는 주로 사용자가 위치하는 디스플레이 장치 전방의 일정 영역을 카메라 로 촬영할 수 있다. 그리고 디스플레이 장치는 촬영된 이미지에 포함된 사용자를 현재 디스플레이 장치의 사용자로 판단할 수도 있다. 디스플레이 장치는 각각의 사용자들의 로그 정보, 연관 정보 클릭 여부, 성별 정보, 연령 정보, 장르 선호 도 정보 등을 수집하여 저장할 수 있다. 예를 들어, 디스플레이 장치는 사용자가 직접 입력한 정보, 디스 플레이 장치의 사용 이력으로부터 수집된 정보를 저장할 수 있다. 다른 예로, 디스플레이 장치는 IoT 장치들과 통신하여 IoT 장치들이 사용자를 추적하며 수집한 정보들을 저장할 수도 있다. 디스플레이 장치는 판단된 사용자의 정보를 이용하여, 클러스터링된 오브젝트들 중 하나의 오브젝트를 선 택할 수 있다. 그리고, 디스플레이 장치는 선택된 오브젝트와 관련된 서비스를 제공할 수 있다. 예를 들어, 디스플레이 장치는 판단된 사용자의 성별 및 연령 정보를 이용하여, 동일한 성별과 비슷한 연 령에 해당하는 등장 인물로 클러스터링된 오브젝트를 선택할 수 있다. 판단된 사용자가 여성일 경우, 디스플레 이 장치는 도 9의 여자 주인공이 착용한 가방을 선택할 수 있다. 그리고 디스플레이 장치는 여자 주인공이 착용한 가방을 구입할 수 있는 쇼핑 어플리케이션 실행 서비스를 제공할 수 있다. 단일 사용자가 판단된 경우에는 판단된 사용자에게 적합한 서비스를 제공하는 것으로 족하나, 복수의 사용자가 판단된 경우에는 그 중 어느 사용자에게 더 적합한 서비스를 제공할 것인지를 결정하여야 한다. 예를 들어, 카 메라를 통해 2명의 사용자가 디스플레이 장치에서 재생되는 컨텐츠를 시청하고 있는 것으로 판단된 경우, 디스플레이 장치는 2명 중 어느 사용자에게 더 적합한 서비스가 제공되어야 할 것인지를 결정하여야 한다. 디스플레이 장치는 복수의 사용자 정보를 저장할 수 있다. 도 10을 참조하면, 디스플레이 장치는 제1 사용자의 정보 및 제2 사용자의 정보를 수집하여 저장할 수 있다. 디스플레이 장치는 현재 화 면에서 인식된 클러스터링된 오브젝트들에 대한 선호도 순위를 결정할 수 있다. 예를 들어, 디스플레이 장치 는 클러스터링된 상품들 중 판매량이 많은 순서대로 선호도 순위를 결정할 수 있다. 그리고, 디스플레이 장치는 가장 선호도 순위가 높은 오브젝트에 대한 복수의 사용자들의 선호도를 판단할 수 있다. 예를 들어, 디스플레이 장치는 선호도가 가장 높은 것으로 판단된 여자 주인공의 가방에 대한 제 1 사용자 및 제2 사용자의 선호도를 판단할 수 있다. 저장된 복수의 사용자 정보를 기초로, 디스플 레이 장치는 여자 주인공의 가방에 대한 제1 사용자의 선호도가 제2 사용자의 선호도보다 높 음을 판단할 수 있다. 디스플레이 장치는 현재 화면(현재 프레임)에 대해 디스플레이 장치의 사용자 를 제1 사용자로 결정할 수 있다. 그리고, 디스플레이 장치는 결정된 제1 사용자에게 여자 주인공의 가방과 관련된 서비스를 제공할 수 있다. 이와 같이 복수의 사용자가 디스플레이 장치를 사용하는 경우에도, 디스플레이 장치는 서비스를 제공 할 더욱 적합한 사용자를 결정할 수 있다. 또한, 디스플레이 장치는 화면이 변경될 때마다 복수의 사용자 중 하나를 선정할 수 있다. 즉, 제1 사용자에게 적합한 서비스를 제공하다가도, 제2 사용자가 선호 하는 상품이 포함된 화면이 표시되면 디스플레이 장치는 제2 사용자에게 적합한 서비스를 제공할 수 있다. 상술한 바와 같은 본 개시의 다양한 실시 예에 따르면, 디스플레이 장치는 디스플레이 장치의 사용자 를 판단하고, 판단된 사용자에게 개인화된 ACR 기반 서비스를 제공할 수 있다. 도 11은 본 개시의 일 실시 예에 따른 디스플레이 장치의 서비스 제공 방법을 설명하기 위한 흐름도이다. 도 11을 참조하면, 디스플레이 장치는 재생중인 컨텐츠를 인식할 수 있다(S1110). 예를 들어, 디스플레이 장치는 현재 표시되는 화면의 특징을 추출한 핑거프린트를 서버로 전송하여 현재 화면의 컨텐츠 정보 를 문의하는 서버 ACR 방식을 통해 컨텐츠를 인식할 수 있다. 그리고 디스플레이 장치는 컨텐츠의 현재 표시된 화면에서 적어도 하나의 오브젝트를 인식할 수 있다 (S1120). 예를 들어, 디스플레이 장치는 특징점 추출 알고리즘을 이용하여 오브젝트를 인식할 수 있다. 다 른 예로, 디스플레이 장치는 인공지능을 이용하여 이미지 분석 기준을 학습할 수 있다. 그리고 학습된 기 준을 이용하여 디스플레이 장치는 표시된 화면에서 오브젝트를 인식할 수 있다. 디스플레이 장치는 현재 디스플레이 장치를 사용하는 사용자를 판단할 수 있다(S1130). 판단된 사용 자의 선호도 정보 등을 이용하여 디스플레이 장치는 개인화된 ACR 기반 서비스를 제공할 수 있다. 예를 들 어, 디스플레이 장치는 지문과 같은 사용자의 생체 정보를 수집하여 사용자가 누구인지 판단할 수 있다. 다른 예로, 디스플레이 장치는 얼굴 인식 알고리즘을 이용하여, 카메라로 촬영된 이미지에서 사용자를 추 출할 수도 있다. 판단된 사용자의 정보를 기초로, 디스플레이 장치는 인식된 오브젝트 중 하나를 선택할 수 있다(S1140). 그리고 디스플레이 장치는 선택된 오브젝트와 관련된 서비스를 제공할 수 있다(S1150). 표시되는 화면에서 인식된 복수의 오브젝트 중 사용자가 선호하는 오브젝트를 선택함으로써, 디스플레이 장치는 개인화된 서 비스를 제공할 수 있다. 도 12는 본 개시의 다른 실시 예에 따른 디스플레이 장치의 서비스 제공 방법을 설명하기 위한 흐름도이다. 도 12를 참조하면, 디스플레이 장치는 시청 중인 컨텐츠를 인식할 수 있다(S1210). 디스플레 이 장치는 현재 표시되는 화면으로부터 생성한 핑거프린트를 서버에 저장된 핑거프린트와 매칭하여 현재 재생되는 컨텐츠가 무엇인지 판단할 수 있다. 그리고, 디스플레이 장치는 화면 내의 인물 또는 상품을 인식할 수 있다(S1220). 현재 재생되는 컨텐츠 화 면에서 특징점을 추출하거나, 인공지능에 의한 학습 방법을 통하여, 디스플레이 장치는 화면에 포함된 오브젝트를 구분할 수 있다. 이어서 디스플레이 장치는 화면 내에서 인식된 인물과 상품을 클러스터링할 수 있다(S1230). 디스플레이 장치는 메타 데이터를 이용하여 컨텐츠의 주요 인물을 판단하고, 주요 인물과 가 까이 위치한 상품을 주요 인물이 사용하는 상품으로 클러스터링할 수 있다. 디스플레이 장치는 현재 디스플레이 장치를 사용하는 사용자가 누구인지 판단할 수 있다(S1240). 예 를 들어, 디스플레이 장치는 지문 인식, 홍채 인식, 성문 인식과 같은 생체 정보를 이용할 수도 있다. 다 른 예로, 디스플레이 장치는 카메라로 컨텐츠를 시청하고 있는 사용자를 인식할 수도 있다. 사용자가 한 명으로 판단될 경우(S1250-Y)에, 디스플레이 장치는 판단된 사용자에 적합한 서비스를 제공할 수 있다. 하지만 사용자가 복수이면(S1250-N), 디스플레이 장치는 서비스를 제공할 사용자를 선정하여야 한다(S1260). 예를 들어, 화면에 등장하는 인물의 정보와 판단된 복수의 사용자의 성별, 연령, 선호도 등을 고 려하여, 디스플레이 장치는 서비스를 제공할 대상을 타게팅할 수 있다. 서비스를 제공할 대상이 판단되면, 디스플레이 장치는 판단된 사용자의 선호도에 따라 상품을 선택할 수 있다(S1270). 디스플레이 장치는 사용자의 프로필 정보, 선호도 정보 등을 수집할 수 있다. 예를 들어, 디 스플레이 장치는 사용자가 입력한 계정 정보, 디스플레이 장치 주변의 IoT 장치들의 사용 정보 등을 수집할 수 있다. 수집된 정보를 이용하여 디스플레이 장치는 인식된 상품들 중 사용자가 가장 선호하는 상 품을 선택할 수 있다. 그리고 디스플레이 장치는 선택된 상품에 관련된 서비스를 제공할 수 있다(S1280). 본 개시에서 사용된 용어 \"~부\"는 하드웨어, 소프트웨어 또는 펌웨어로 구성된 유닛을 포함하며, 예를 들면, 로 직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또 는 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 모듈은 ASIC(application-specific integrated circuit)으로 구성될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기기는, 저장 매체로부터 저장된 명령어를 호 출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시예들에 따른 전자 장치(예: 전자 장치(A)) 를 포함할 수 있다. 상기 명령이 프로세서에 의해 실행될 경우, 프로세서가 직접, 또는 상기 프로세서의 제어하 에 다른 구성요소들을 이용하여 상기 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리 터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non- transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장매체가 신호(signal)를 포함하지 않 으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 일시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다 양한 실시예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차 적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다."}
{"patent_id": "10-2017-0157854", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 설명하기 위한 개략적인 블록도, 도 2는 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 상세히 설명하기 위한 블록도, 도 3은 본 개시의 일부 실시 예에 따른 프로세서의 블록도, 도 4a는 본 개시의 일부 실시 예에 따른 데이터 학습부의 블록도, 도 4b는 본 개시의 일부 실시 예에 따른 데이터 인식부의 블록도, 도 5는 본 개시의 일 실시 예에 따른 디스플레이 시스템을 설명하기 위한 도면, 도 6은 ACR 과정을 설명하기 위한 도면, 도 7은 오브젝트 인식 과정을 설명하기 위한 도면, 도 8a는 특징점을 추출하여 오브젝트를 인식하는 방법을 설명하기 위한 도면, 도 8b는 학습을 통해 오브젝트를 인식하는 방법을 설명하기 위한 도면,도 9는 오브젝트 클러스터링을 설명하기 위한 도면, 도 10은 복수의 사용자 정보가 저장된 경우를 예시하기 위한 도면, 그리고, 도 11 및 도 12는 본 개시의 다양한 실시 예에 따른 디스플레이 장치의 서비스 제공 방법을 설명하기 위한 흐름 도이다."}
