{"patent_id": "10-2023-0032505", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0138794", "출원번호": "10-2023-0032505", "발명의 명칭": "엘리베이터 카 내에서 결정된 가상 대기열에 기반하여 엘리베이터 카에 대해 승차 또는 하차", "출원인": "네이버 주식회사", "발명자": "윤영환"}}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "로봇 제어 시스템에 의해 수행되는, 공간 내를 승강하는 엘리베이터 카에 대해 승차 또는 하차하는 복수의 로봇들을 제어하는 로봇 제어 방법에 있어서,상기 엘리베이터 카의 내부 영역에 대해, 상기 엘리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함하는 적어도 하나의 가상 대기열을 결정하는 단계 - 상기 가상 대기열에 포함된 배치 위치는 순서를 가짐 -; 상기 엘리베이터 카에 탑승할 제1 로봇의 목적지인 제1 타겟 층에 대한 정보를 획득하는 단계;상기 엘리베이터 카에 제1 로봇이 탑승하면, 상기 제1 타겟 층 및 상기 순서에 기반하여, 상기 가상 대기열에포함된 제1 배치 위치에 상기 제1 로봇을 배치하는 단계; 및 상기 엘리베이터 카가 상기 타겟 층에 도착하면, 상기 엘리베이터 카로부터의 상기 제1 로봇의 하차를 제어하는 단계를 포함하고, 상기 가상 대기열은, 상기 엘리베이터 카에 대한 로봇의 탑승 및 상기 엘리베이터 카로부터의 로봇의 하차 시에상기 엘리베이터 카에 탑승하고 있는 다른 로봇의 불필요한 하차를 요구하지 않도록 결정되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 가상 대기열은, 상기 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하고, 상기 배치위치들 중 순서가 앞서는 배치 위치에는, 순서가 더 늦은 배치 위치에 배치된 로봇보다, 더 늦게 하차하지 않는로봇이 배치되도록 결정되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1 로봇을 배치하는 단계는, 상기 가상 대기열 중 제1 가상 대기열에 포함되는 상기 배치 위치들 중 상기 순서가 가장 앞서는 선두 배치 위치에 상기 제2 로봇이 배치되어 있는 경우, 상기 제1 타겟 층과 상기 제2 로봇의 목적지인 제2 타겟 층을 비교하는 단계; 및 상기 제2 타겟 층과 상기 제1 타겟 층이 동일하거나, 상기 엘리베이터 카가 상기 제1 타겟 층으로 먼저 이동하는 경우, 상기 제2 로봇을 상기 배치 위치들 중 상기 선두 배치 위치의 다음의 배치 위치인 제2 배치 위치로 이동시키고, 상기 선두 배치 위치에 상기 제1 로봇을 배치하는 단계 를 포함하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 결정하는 단계에서는, 복수의 가상 대기열들이 결정되고, 상기 제1 로봇을 배치하는 단계는, 상기 비교 결과, 상기 엘리베이터 카가 상기 제1 타겟 층보다 상기 제2 타겟 층으로 먼저 이동하는 경우, 상기복수의 가상 대기열들 중 상기 제1 가상 대기열과는 상이한 제2 가상 대기열이 포함하는 로봇이 배치되는 배치공개특허 10-2024-0138794-3-위치에 상기 제1 로봇을 배치하는 단계를 포함하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 결정하는 단계는, 복수의 가상 대기열들을 결정하고, 상기 배치하는 단계는,상기 가상 대기열들의 각각의 각 선두 배치 위치가 비어있는지 여부, 상기 각 선두 배치 위치에 배치되어 있는로봇의 목적지, 및 상기 가상 대기열들의 각각에 기 배치되어 있는 로봇의 목적지에 기반하여, 상기 가상 대기열들 중에서 상기 제1 로봇이 배치될 수 있는 최적(optimal) 가상 대기열을 결정하는 단계; 및상기 최적 가상 대기열의 선두 배치 위치에 상기 제1 로봇을 배치하는 단계를 포함하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 엘리베이터 카의 내부 영역은 로봇이 탑승 또는 하차하기 위한 적어도 하나의 승하차 위치를 포함하고, 상기 결정하는 단계는, 상기 내부 영역 중 상기 승하차 위치를 제외한 영역에 대해 상기 가상 대기열을 결정하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 승하차 위치는 복수이고, 상기 결정하는 단계에서는, 복수의 가상 대기열들이 결정되고, 복수의 승하차 위치들 중에서 상기 제1 로봇이 상기 엘리베이터 카에 승차할 때 진입하는 승하차 위치에 따라,상기 가상 대기열들 중 상기 제1 로봇이 배치되는 가상 대기열이 결정되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 결정하는 단계는, 상기 로봇들이 제공하는 서비스 또는 이동 패턴에 기반하여, 적어도 하나의 가상 대기열의 길이를 결정함으로써복수의 가상 대기열들을 결정하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 적어도 하나의 가상 대기열의 길이는, 상기 로봇들이 상기 엘리베이터 카를 통해 상대적으로 더 적은 층들 간을 이동하는 이동 패턴을 가질수록 더 짧게 되거나;상기 로봇들이 상기 엘리베이터 카를 통해 임의의 층들 간을 이동하는 이동 패턴을 갖는지 또는 특정한 층을 중심으로 층들 간을 이동하는 이동 패턴을 갖는지 여부에 따라 상이하게 되거나;상기 로봇들이 제공하는 서비스의 종류에 따라 상이하게 되거나; 또는공개특허 10-2024-0138794-4-상기 로봇들이 주행하는 시간대에 따라 상이하게 되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 결정하는 단계는,소정의 기간 동안의 상기 로봇들의 상기 엘리베이터 카를 통한 층들 간의 이동들을 학습함으로써, 상기 로봇들의 이동 패턴을 결정하는 단계; 및 상기 결정된 이동 패턴에 기반하여, 적어도 하나의 가상 대기열의 길이를 결정함으로써 상기 복수의 가상 대기열들을 결정하는 단계를 포함하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 결정하는 단계는, 복수의 가상 대기열들을 결정하고, 상기 가상 대기열들에 기 배치되어 있는 로봇의 목적지와 상기 제1 로봇의 목적지에 기반하여, 상기 복수의 가상 대기열들 중 적어도 하나의 가상 대기열의 길이를 조절하는 단계를 포함하고,상기 배치하는 단계는,상기 길이가 조절된 가상 대기열에 포함된 순서가 가장 앞서는 선두 배치 위치에 상기 제1 로봇을 배치하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 길이를 조절하는 단계는, 상기 복수의 가상 대기열들 중 하나의 가상 대기열의 길이를 줄이거나 상기 하나의 가상 대기열을 삭제하고, 줄어들거나 삭제된 부분만큼 다른 하나의 가상 대기열의 길이를 늘림으로써 상기 복수의 가상 대기열들 중 적어도하나의 가상 대기열의 길이를 조절하고, 상기 배치하는 단계는,상기 길이가 늘어난 가상 대기열의 선두 배치 위치에 상기 제1 로봇을 배치하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 상기 가상 대기열에 기 배치되어 있는 로봇의 목적지와 상기 제1 로봇의 목적지에 기반하여, 새로운 가상 대기열을 생성하는 단계를 더 포함하고,상기 새로운 가상 대기열은, 상기 가상 대기열의 길이를 줄임에 따라 줄어든 부분에 해당하는 길이를 갖고, 상기 배치하는 단계는,상기 새로운 가상 대기열에 포함된 순서가 가장 앞서는 선두 배치 위치에 상기 제1 로봇을 배치하는, 로봇 제어방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2024-0138794-5-제1항에 있어서,상기 엘리베이터 카는 로봇과 사람이 함께 탑승 가능한 것이고, 상기 엘리베이터 카의 내부 영역은 사람이 탑승하기 위한 사람 탑승 영역을 포함하고, 상기 결정하는 단계는, 상기 내부 영역 중 상기 사람 탑승 영역을 제외한 영역에 대해 상기 가상 대기열을 결정하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 엘리베이터 카의 내부 영역에서 상기 사람 탑승 영역과 상기 가상 대기열에 해당하는 영역은 시각적인 가이드에 의해 구분되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 가상 대기열은, 상기 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하고,상기 가상 대기열에 기 배치된 로봇들은 상기 가상 대기열에 해당하는 상기 엘리베이터 카의 내부 영역을 선점하도록 상기 소정의 제1 간격으로 배치되고, 상기 엘리베이터 카에 상기 제1 로봇이 탑승하여, 상기 제1 로봇이 상기 가상 대기열의 선두 배치 위치에 배치되면, 상기 가상 대기열에 배치되는 로봇들은 상기 제1 간격보다 더 작은 제2 간격으로 상기 배치 위치들에서각각 배치되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 공간 내에서는 복수의 엘리베이터 카들이 운용되고,상기 결정하는 단계는, 복수의 엘리베이터 카들과 연관된 통합 가상 대기열을 결정하는 단계; 및 상기 통합 가상 대기열의 일부인 상기 가상 대기열을 결정하는 단계 를 포함하는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,상기 가상 대기열은, 상기 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하고,상기 배치 위치들에서 각각 배치되는 상기 로봇들의 위치는, 상기 로봇들로부터의 센싱 데이터에 기반하여 조정되거나, 상기 로봇들의 각각 또는 상기 내부 영역에 배치된 식별 정보를 상기 로봇들이 인식함에 따라조정되는, 로봇 제어 방법."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제1항 내지 제18항 중 어느 한 항의 방법을 컴퓨터 시스템인 상기 로봇 제어 시스템에서 실행시키기 위해 비-일시적인 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램."}
{"patent_id": "10-2023-0032505", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공간 내를 승강하는 엘리베이터 카에 대해 승차 또는 하차하는 복수의 로봇들을 제어하는 로봇 제어 시스템을구성하는 컴퓨터 시스템에 있어서,컴퓨터에서 판독 가능한 명령을 실행하도록 구현되는 적어도 하나의 프로세서공개특허 10-2024-0138794-6-를 포함하고,상기 적어도 하나의 프로세서는,상기 엘리베이터 카의 내부 영역에 대해, 상기 엘리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함하는 적어도 하나의 가상 대기열을 결정- 상기 가상 대기열에 포함된 배치 위치는 순서를 가짐 -하고,상기 엘리베이터 카에 탑승할 제1 로봇의 목적지인 제1 타겟 층에 대한 정보를 획득하고, 상기 엘리베이터 카에제1 로봇이 탑승하면, 상기 제1 타겟 층 및 상기 순서에 기반하여, 상기 가상 대기열에 포함된 제1 배치 위치에상기 제1 로봇을 배치하고, 상기 엘리베이터 카가 상기 타겟 층에 도착하면, 상기 엘리베이터 카로부터의 상기제1 로봇의 하차를 제어하고, 상기 가상 대기열은, 상기 엘리베이터 카에 대한 상기 로봇의 탑승 및 상기 엘리베이터 카로부터의 상기 로봇의하차 시에 상기 엘리베이터 카에 탑승하고 있는 다른 로봇의 불필요한 하차를 요구하지 않도록 결정되는, 컴퓨터 시스템."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "로봇 제어 시스템에 의해 수행되는, 공간 내를 승강하는 엘리베이터 카에 대해 승차 또는 하차하는 복수의 로봇 들을 제어하는 로봇 제어 방법이 제공된다. 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해, 엘리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함하는 가상 대기열을 결정하고, 엘리베이터 카에 탑승 할 제1 로봇의 목적지인 제1 타겟 층에 대한 정보를 획득하고, 엘리베이터 카에 제1 로봇이 탑승하면, 제1 타겟 층 및 가상 대기열 내 배치 위치의 순서에 기반하여, 가상 대기열에 포함된 제1 배치 위치에 제1 로봇을 배치하 고, 엘리베이터 카가 상기 타겟 층에 도착하면, 엘리베이터 카로부터의 제1 로봇의 하차를 제어한다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명은 엘리베이터 카 내에서 가상 대기열을 결정하고, 결정된 가상 대기열에 기반하여 엘리베이터 카에 대해 승차 또는 하차하는 복수의 로봇들을 제어하는 로봇 제어 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율 주행 로봇은 스스로 주변을 살피고 장애물을 감지하면서 바퀴나 다리를 이용하여 목적지까지 최적 경로를 찾아가는 로봇으로, 자율 주행 차량이나, 물류, 호텔 서비스, 로봇 청소기 등 다양한 분야를 위해 개발 및 활용 되고 있다. 로봇이 서비스를 제공하기 위해 건물과 같은 공간 내에서 운용되는 경우, 로봇은 엘리베이터(엘리베이터 카 또 는 캐빈)를 이용하여 공간 내의 층간을 이동하게 된다. 이러한 엘리베이터는 로봇 만이 이용 가능한 로봇 전용 엘리베이터이거나, 로봇과 사람이 함께 이용 가능한 엘리베이터일 수 있다. 공간 내에서 다수의 로봇들(즉, 멀티 로봇)이 운용되는 경우에 있어서, 각 로봇은 로봇 제어 시스템에 의해 제 어될 수 있고, 엘리베이터 카에 대한 승차 및 하차 역시 제어될 수 있다. 엘리베이터 카에 대한 로봇의 승차 및 하차를 제어함에 있어서는, 각 로봇의 스케줄 및 목적지를 고려하여, 승차 및 하차하는 로봇의 동선이 다른 로 봇에 의해 방해 받지 않도록 하고, 승차 및 하차하는 로봇 외에 다른 로봇의 불필요한 이동을 요구하지 않아야 할 필요가 있다. 한국공개특허 제10-2005-0024840호는 자율이동로봇을 위한 경로계획방법에 관한 기술로, 가정이나 사무실에서 자율적으로 이동하는 이동로봇이 장애물을 회피하면서 목표점까지 안전하고 빠르게 이동할 수 있는 최적경로를 계획하는 방법에 대해 개시하고 있다. 상기에서 설명된 정보는 단지 이해를 돕기 위한 것이며, 종래 기술의 일부를 형성하지 않는 내용을 포함할 수 있으며, 종래 기술이 통상의 기술자에게 제시할 수 있는 것을 포함하지 않을 수 있다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "엘리베이터 카의 내부 영역에 대해 엘리베이터 카에 탑승한 로봇이 배치될 배치 위치를 포함하는 가상 대기열을 결정하고, 엘리베이터 카에 제1 로봇이 탑승하면, 제1 로봇의 목적지인 제1 타겟 층 및 가상 대기열 내 배치 위 치의 순서에 기반하여, 가상 대기열에 포함된 제1 배치 위치에 제1 로봇을 배치하고, 엘리베이터 카가 타겟 층 에 도착하면, 엘리베이터 카로부터의 제1 로봇의 하차를 제어하는 방법을 제공할 수 있다. 엘리베이터 카의 내부 영역에 대해, 엘리베이터 카에 탑승하는 제1 로봇이 배치될 복수의 가상 대기열들 중에서, 제1 로봇의 목적지와 가상 대기열들에 기 배치된 다른 로봇의 목적지에 기반하여, 최적 가상 대기열을 결정하고, 최적 가상 대기열에 제1 로봇을 배치하여 제1 로봇 및 기 배치된 로봇들의 엘리베이터 카에 대한 승 하차를 제어하는 방법을 제공할 수 있다. 엘리베이터 카에 탑승하는 제1 로봇의 목적지와 엘리베이터 카에 탑승한 다른 로봇의 목적지에 기반하여, 엘리 베이터 카의 내부 영역에 대해 결정되는 가상 대기열들을 동적으로 업데이트(예컨대, 길이 조절, 삭제, 추가 등)하는 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 측면에 있어서, 로봇 제어 시스템에 의해 수행되는, 공간 내를 승강하는 엘리베이터 카에 대해 승차 또는 하 차하는 복수의 로봇들을 제어하는 로봇 제어 방법에 있어서, 상기 엘리베이터 카의 내부 영역에 대해, 상기 엘 리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함하는 적어도 하나의 가상 대기열을 결정하 는 단계 - 상기 가상 대기열에 포함된 배치 위치는 순서를 가짐 -; 상기 엘리베이터 카에 탑승할 제1 로봇의 목 적지인 제1 타겟 층에 대한 정보를 획득하는 단계; 상기 엘리베이터 카에 제1 로봇이 탑승하면, 상기 제1 타겟 층 및 상기 순서에 기반하여, 상기 가상 대기열에 포함된 제1 배치 위치에 상기 제1 로봇을 배치하는 단계; 및 상기 엘리베이터 카가 상기 타겟 층에 도착하면, 상기 엘리베이터 카로부터의 상기 제1 로봇의 하차를 제어하는 단계를 포함하고, 상기 가상 대기열은, 상기 엘리베이터 카에 대한 로봇의 탑승 및 상기 엘리베이터 카로부터의 로봇의 하차 시에 상기 엘리베이터 카에 탑승하고 있는 다른 로봇의 불필요한 하차를 요구하지 않도록 결정되는, 로봇 제어 방법이 제공된다. 상기 가상 대기열은, 상기 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하고, 상기 배치 위치들 중 순서가 앞서는 배치 위치에는, 순서가 더 늦은 배치 위치에 배치된 로봇보다, 더 늦게 하차하지 않는 로봇이 배치되도록 결정될 수 있다. 상기 제1 로봇을 배치하는 단계는, 상기 가상 대기열 중 제1 가상 대기열에 포함되는 상기 배치 위치들 중 상기 순서가 가장 앞서는 선두 배치 위치에 상기 제2 로봇이 배치되어 있는 경우, 상기 제1 타겟 층과 상기 제2 로봇 의 목적지인 제2 타겟 층을 비교하는 단계; 및 상기 제2 타겟 층과 상기 제1 타겟 층이 동일하거나, 상기 엘리 베이터 카가 상기 제1 타겟 층으로 먼저 이동하는 경우, 상기 제2 로봇을 상기 배치 위치들 중 상기 선두 배치 위치의 다음의 배치 위치인 제2 배치 위치로 이동시키고, 상기 선두 배치 위치에 상기 제1 로봇을 배치하는 단 계를 포함할 수 있다. 상기 결정하는 단계에서는, 복수의 가상 대기열들이 결정되고, 상기 제1 로봇을 배치하는 단계는, 상기 비교 결 과, 상기 엘리베이터 카가 상기 제1 타겟 층보다 상기 제2 타겟 층으로 먼저 이동하는 경우, 상기 복수의 가상 대기열들 중 상기 제1 가상 대기열과는 상이한 제2 가상 대기열이 포함하는 로봇이 배치되는 배치 위치에 상기 제1 로봇을 배치하는 단계를 포함할 수 있다. 상기 결정하는 단계는, 복수의 가상 대기열들을 결정하고, 상기 배치하는 단계는, 상기 가상 대기열들의 각각의 각 선두 배치 위치가 비어있는지 여부, 상기 각 선두 배치 위치에 배치되어 있는 로봇의 목적지, 및 상기 가상 대기열들의 각각에 기 배치되어 있는 로봇의 목적지에 기반하여, 상기 가상 대기열들 중에서 상기 제1 로봇이 배치될 수 있는 최적(optimal) 가상 대기열을 결정하는 단계; 및 상기 최적 가상 대기열의 선두 배치 위치에 상 기 제1 로봇을 배치하는 단계를 포함할 수 있다. 상기 엘리베이터 카의 내부 영역은 로봇이 탑승 또는 하차하기 위한 적어도 하나의 승하차 위치를 포함하고, 상 기 결정하는 단계는, 상기 내부 영역 중 상기 승하차 위치를 제외한 영역에 대해 상기 가상 대기열을 결정할 수 있다. 상기 승하차 위치는 복수이고, 상기 결정하는 단계에서는, 복수의 가상 대기열들이 결정되고, 복수의 승하차 위 치들 중에서 상기 제1 로봇이 상기 엘리베이터 카에 승차할 때 진입하는 승하차 위치에 따라, 상기 가상 대기열 들 중 상기 제1 로봇이 배치되는 가상 대기열이 결정될 수 있다. 상기 결정하는 단계는, 상기 로봇들이 제공하는 서비스 또는 이동 패턴에 기반하여, 적어도 하나의 가상 대기열 의 길이를 결정함으로써 복수의 가상 대기열들을 결정할 수 있다. 상기 적어도 하나의 가상 대기열의 길이는, 상기 로봇들이 상기 엘리베이터 카를 통해 상대적으로 더 적은 층들 간을 이동하는 이동 패턴을 가질수록 더 짧게 되거나; 상기 로봇들이 상기 엘리베이터 카를 통해 임의의 층들 간을 이동하는 이동 패턴을 갖는지 또는 특정한 층을 중심으로 층들 간을 이동하는 이동 패턴을 갖는지 여부에 따라 상이하게 되거나; 상기 로봇들이 제공하는 서비스의 종류에 따라 상이하게 되거나; 또는 상기 로봇들이 주 행하는 시간대에 따라 상이하게 될 수 있다. 상기 결정하는 단계는, 소정의 기간 동안의 상기 로봇들의 상기 엘리베이터 카를 통한 층들 간의 이동들을 학습 함으로써, 상기 로봇들의 이동 패턴을 결정하는 단계; 및 상기 결정된 이동 패턴에 기반하여, 적어도 하나의 가 상 대기열의 길이를 결정함으로써 상기 복수의 가상 대기열들을 결정하는 단계를 포함할 수 있다. 상기 결정하는 단계는, 복수의 가상 대기열들을 결정하고, 상기 가상 대기열들에 기 배치되어 있는 로봇의 목적 지와 상기 제1 로봇의 목적지에 기반하여, 상기 복수의 가상 대기열들 중 적어도 하나의 가상 대기열의 길이를 조절하는 단계를 포함하고, 상기 배치하는 단계는, 상기 길이가 조절된 가상 대기열에 포함된 순서가 가장 앞서 는 선두 배치 위치에 상기 제1 로봇을 배치할 수 있다. 상기 길이를 조절하는 단계는, 상기 복수의 가상 대기열들 중 하나의 가상 대기열의 길이를 줄이거나 상기 하나 의 가상 대기열을 삭제하고, 줄어들거나 삭제된 부분만큼 다른 하나의 가상 대기열의 길이를 늘림으로써 상기 복수의 가상 대기열들 중 적어도 하나의 가상 대기열의 길이를 조절하고, 상기 배치하는 단계는, 상기 길이가 늘어난 가상 대기열의 선두 배치 위치에 상기 제1 로봇을 배치할 수 있다. 상기 로봇 제어 방법은, 상기 가상 대기열에 기 배치되어 있는 로봇의 목적지와 상기 제1 로봇의 목적지에 기반 하여, 새로운 가상 대기열을 생성하는 단계를 더 포함하고, 상기 새로운 가상 대기열은, 상기 가상 대기열의 길 이를 줄임에 따라 줄어든 부분에 해당하는 길이를 갖고, 상기 배치하는 단계는, 상기 새로운 가상 대기열에 포 함된 순서가 가장 앞서는 선두 배치 위치에 상기 제1 로봇을 배치할 수 있다. 상기 엘리베이터 카는 로봇과 사람이 함께 탑승 가능한 것이고, 상기 엘리베이터 카의 내부 영역은 사람이 탑승 하기 위한 사람 탑승 영역을 포함하고, 상기 결정하는 단계는, 상기 내부 영역 중 상기 사람 탑승 영역을 제외 한 영역에 대해 상기 가상 대기열을 결정할 수 있다. 상기 엘리베이터 카의 내부 영역에서 상기 사람 탑승 영역과 상기 가상 대기열에 해당하는 영역은 시각적인 가 이드에 의해 구분될 수 있다. 상기 가상 대기열은, 상기 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하고, 상기 가상 대기열에 기 배치된 로봇들은 상기 가상 대기열에 해당하는 상기 엘리베이터 카의 내부 영역을 선점하도록 상기 소정의 제1 간격으로 배치되고, 상기 엘리베이터 카에 상기 제1 로봇이 탑승하여, 상기 제1 로봇이 상기 가상 대기열의 선두 배치 위치에 배치되면, 상기 가상 대기열에 배치되는 로봇들은 상기 제1 간격보다 더 작은 제2 간격으로 상기 배치 위치들에서 각각 배치될 수 있다. 상기 공간 내에서는 복수의 엘리베이터 카들이 운용되고, 상기 결정하는 단계는, 복수의 엘리베이터 카들과 연 관된 통합 가상 대기열을 결정하는 단계; 및 상기 통합 가상 대기열의 일부인 상기 가상 대기열을 결정하는 단 계를 포함할 수 있다. 상기 가상 대기열은, 상기 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하고, 상기 배치 위치들에서 각각 배치되는 상기 로봇들의 위치는, 상기 로봇들로부터의 센싱 데이터에 기반하여 조정되거나, 상 기 로봇들의 각각 또는 상기 내부 영역에 배치된 식별 정보를 상기 로봇들이 인식함에 따라 조정될 수 있다. 다른 일 측면에 있어서, 공간 내를 승강하는 엘리베이터 카에 대해 승차 또는 하차하는 복수의 로봇들을 제어하 는 로봇 제어 시스템을 구성하는 컴퓨터 시스템에 있어서, 컴퓨터에서 판독 가능한 명령을 실행하도록 구현되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 상기 엘리베이터 카의 내부 영역에 대해, 상기 엘리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함하는 적어도 하나의 가상 대기열을 결정- 상기 가상 대기열에 포함된 배치 위치는 순서를 가짐 -하고, 상기 엘리베이터 카에 탑승할 제1 로봇의 목 적지인 제1 타겟 층에 대한 정보를 획득하고, 상기 엘리베이터 카에 제1 로봇이 탑승하면, 상기 제1 타겟 층 및 상기 순서에 기반하여, 상기 가상 대기열에 포함된 제1 배치 위치에 상기 제1 로봇을 배치하고, 상기 엘리베이 터 카가 상기 타겟 층에 도착하면, 상기 엘리베이터 카로부터의 상기 제1 로봇의 하차를 제어하고, 상기 가상 대기열은, 상기 엘리베이터 카에 대한 상기 로봇의 탑승 및 상기 엘리베이터 카로부터의 상기 로봇의 하차 시에 상기 엘리베이터 카에 탑승하고 있는 다른 로봇의 불필요한 하차를 요구하지 않도록 결정되는, 컴퓨터 시스템이 제공된다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "엘리베이터 카의 내부 영역에 대해 엘리베이터 카에 탑승한 로봇이 배치될 배치 위치를 포함하는 가상 대기열 (들)을 결정하고, 가상 대기열의 소정의 배치 위치에 로봇을 배치함으로써, 엘리베이터 카에 대한 로봇의 탑승 및 하차를 제어함에 있어서, 엘리베이터 카에 대해 탑승 및 하차하는 로봇의 동선이 다른 로봇에 의해 방해 받 거나, 다른 로봇의 이동을 방해하지 않을 수 있다.엘리베이터 카에 탑승하는 로봇의 목적지와 엘리베이터 카에 탑승한 다른 로봇의 목적지에 기반하여, 엘리베이 터 카의 내부 영역에 대해 결정되는 가상 대기열들을 동적으로 업데이트(예컨대, 길이 조절, 삭제, 추가 등)함 으로써, 공간 내에서 운용되는 로봇들의 스케줄이나 목적지가 변경되는 경우에도 엘리베이터 카에 대한 로봇의 탑승 및 하차를 효율적으로 제어할 수 있고, 엘리베이터 카에 탑승하는 로봇의 목적지를 고려하여 최적화된 가 상 대기열들에 로봇을 배치할 수 있다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예를 첨부한 도면을 참조하여 상세히 설명한다. 도 1은 일 실시예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열을 결정하고, 가상 대 기열을 이용하여 엘리베이터 카에 대한 로봇의 승차 및 하차를 제어하는 방법을 나타낸다. 도 1에서는 공간 내에서 서비스를 제공하도록 구성되는 로봇의 복수의 층들로 구성된 공간을 승강하는 엘 리베이터(즉, 엘리베이터 카)에 대한 승차(탑승) 및 하차를 제어하는 방법이 도시되었다. 공간은 복수의 로봇들(즉, 멀티 로봇)이 주행하고 서비스를 제공하는 환경으로서, 복수의 로봇들 각 각이 자신에 대해 설정된 경로 및 목적지를 주행하는 환경일 수 있다. 공간은 복수의 층들로 구성될 수 있고, 공간 내에는 층들 간을 승강하기 위한 복수의 엘리베이터 카들이 운용되고 있을 수 있다. 일례로, 공간은 복수의 로봇들과 엘리베이터 카들이 운용되는 건물일 수 있고, 또는, 실내 공간 및 실외 공간을 포함 하는 복합 공간일 수 있다. 도시된 것처럼, 로봇들은 로봇 제어 시스템에 의해 제어될 수 있다. 또한, 엘리베이터 카들은 엘 리베이터 제어 시스템에 의해 제어될 수 있다. 로봇 제어 시스템은 로봇을 제어하기 위한 컴퓨터 시스템으로서 서버일 수 있다. 로봇 제어 시스템 은 공간 또는 건물의 외부에 배치되는 서버로서, 클라우드 서버일 수 있다. 또는, 실시예에 따라서는 로봇 제어 시스템은 공간 또는 건물의 내부에 배치될 수도 있다. 한편, 엘리베이터 제어 시스템은 엘리베 이터 카의 승강을 제어하기 위한 컴퓨터 시스템으로서 서버일 수 있다. 엘리베이터 제어 시스템은 공 간 또는 건물의 외부에 배치되는 서버일 수 있다. 또는, 실시예에 따라서는 엘리베이터 제어 시스템은 공 간 또는 건물의 내부에 배치될 수도 있다. 각각의 로봇은 공간 내에서 서비스를 제공하기 위해 사용되는 서비스 로봇일 수 있다. 도 1에서는 두 개의 로봇들 만이 도시되었으나, 공간 내에는 다수의 로봇들이 배치될 수 있고, 엘리베이터 카 내에도 다수의 로봇들이 탑승할 수 있다. 로봇이 제공하는 서비스는 예컨대, 택배 전달 서비스, 주문에 따른 음료(커피 등) 전달 서비스, 청소 서비 스, 및 기타 정보/콘텐츠 제공 서비스 중 적어도 하나를 포함할 수 있다. 로봇은 자율 주행을 통해 공간의 소정의 위치에서 또는 소정의 사용자에게 서비스를 제공하도록 구성될 수 있으며, 로봇의 (각각의) 이동 및 서비스의 제공은 로봇 제어 시스템에 의해 제어될 수 있다. 로봇, 로봇 제어 시스템 및 엘리베이터 제어 시스템의 구조에 대해서는 후술될 도 2 내지 도 5 를 참조하여 더 자세하게 설명된다. 엘리베이터 카는 사람과 로봇이 탑승 가능한 일반적인 엘리베이터일 수 있다. 또는, 엘리베이터 카 는 로봇 만이 탑승 가능하도록 설정된 로봇 전용 엘리베이터일 수 있다. 실시예에 따라서는, (예컨대, 로봇 제어 시스템의 요청을 수신한 엘리베이터 제어 시스템에 의해) 일반적인 엘리베이터는 로봇 전 용 엘리베이터로 설정될 수 있다. 엘리베이터 카는 사람 및/또는 로봇이 승하차 하기 위한 도어를 포 함할 수 있다. 도 1을 비롯한 후술될 일부 도면들에서는 이러한 도어는 설명의 편의상 생략될 수 있다. 실시예에서는, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해, 적어도 하나의 가상 대기열 을 결정할 수 있고, 이러한 가상 대기열에 (엘리베이터 카에 탑승하는) 로봇을 배치시킬 수 있다. 가상 대기열은 엘리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함할 수 있다. 도 1에서, 이러한 배치 위치는 도트(.)로서 표시되었다. 각각의 배치 위치에는 하나의 로봇이 배 치될 수 있고, 가상 대기열은 적어도 하나의 배치 위치를 가질 수 있다. 로봇 제어 시스템은 엘리베이터 카의 내부 영역의 넓이 및 모양을 고려하여 적어도 하나의 가상 대기 열을 결정할 수 있다. 또한, 로봇 제어 시스템은 가상 대기열을 결정함에 있어서 (엘리베이터 카 에 탑승할) 로봇들의 스케줄 정보(또는 현재 위치 및 목적지)와 엘리베이터 카의 현재 위치를 더 고려할 수 있다. 엘리베이터 카의 내부 영역의 넓이 및 모양에 관한 정보는 기지이거나, 엘리베이터 제어 시스템으로부터 획득될 수 있다. 엘리베이터 카의 현재 위치에 관한 정보는 엘리베이터 제어 시스템 으로부터 획득될 수 있다. 로봇 제어 시스템은 엘리베이터 카의 내부 영역에 대해 최적의 가상 대기열(들)을 결정하고, 가상 대기열의 배치 위치에 로봇(들)을 배치함으로써, 엘리베이터 카에 대한 로봇의 승차 및 하차 제어를 효율화할 수 있다. 말하자면, 로봇 제어 시스템이 엘리베이터 카에 대한 로봇의 탑승 및 하차를 제어함에 있어서, 엘리베이터 카에 대해 탑승 및 하차하는 로봇의 동선이 다른 로봇에 의해 방해 받거나, 다른 로봇의 이동을 방해하지 않을 수 있다. 가상 대기열을 결정하고, 가상 대기열을 이용하여 로봇을 제어하는 방법에 대해서는 후술될 도 6 내지 도 30을 참조하여 더 자세하게 설명한다. 도 2 는 일 실시예에 따른, 공간 내에서 서비스를 제공하는 로봇을 나타내는 블록도이다. 전술한 것처럼, 로봇은 공간 내에서 서비스를 제공하기 위해 사용되는 서비스 로봇일 수 있다. 로봇 은 자율 주행을 통해 공간의 소정의 위치에서 또는 소정의 사용자에게 서비스를 제공할 수 있다. 로봇은 물리적인 장치일 수 있으며, 도시된 바와 같이, 제어부, 구동부, 센서부 및 통신부 를 포함할 수 있다. 제어부는 로봇에 내장된 물리적인 프로세서일 수 있으며, 별도로 도시하지는 않았으나, 경로 계획 처 리 모듈, 맵핑 처리 모듈, 구동 제어 모듈, 로컬리제이션 처리 모듈, 데이터 처리 모듈 및 서비스 처리 모듈을 포함할 수 있다. 이 때, 경로 계획 처리 모듈, 맵핑 처리 모듈 및 로컬리제이션 처리 모듈은 로봇 제어 시스템 과 통신이 이루어지지 않는 경우에도 로봇의 실내 자율 주행이 이루어질 수 있도록 하기 위해 실시예 에 따라 선택적으로 제어부에 포함되는 것일 수도 있다. 통신부는 로봇이 다른 장치(다른 로봇 또는 로봇 제어 시스템 등)와 통신하기 위한 구성일 수 있다. 말하자면, 통신부는 다른 장치에 대해 데이터 및/또는 정보를 전송/수신하는, 로봇의 안테나, 데이터 버스, 네트워크 인터페이스 카드, 네트워크 인터페이스 칩 및 네트워킹 인터페이스 포트 등과 같은 하드 웨어 모듈 또는 네트워크 디바이스 드라이버(driver) 또는 네트워킹 프로그램과 같은 소프트웨어 모듈일 수 있 다. 구동부는 로봇의 이동을 제어하며 이동을 가능하게 하는 구성으로서 이를 수행하기 위한 장비를 포함 할 수 있다. 센서부는 로봇의 자율 주행 및 서비스 제공에 있어서 요구되는 데이터를 수집하기 위한 구성일 수 있 다. 센서부는 고가의 센싱 장비를 포함하지 않을 수 있고, 단지 저가형 초음파 센서 및/또는 저가형 카메 라 등과 같은 센서를 포함할 수 있다. 센서부는 전방 및/또는 후방의 다른 로봇이나 사람을 식별하기 위한 센서를 포함할 수 있다. 예컨대, 센서부의 카메라를 통해 다른 로봇, 사람 및 기타 지물들이 장애물로서 식별될 수 있다. 또는, 센서부는 적외선 센서(또는 적외선 카메라)를 포함할 수 있다. 센서부는 카메 라 외에 주변의 사용자나, 다른 로봇 또는 지물을 인식/식별하기 위한 센서를 더 포함할 수도 있다. 이처럼 센 서부는 장애물을 식별하도록 구성될 수 있다. 일례로, 로봇이 로봇 제어 시스템에 의해 제어되는 로봇 제어 시스템 내에서 로봇의 자율 주행을 위한 알고리즘이 실행되는 경우, 제어부의 데이터 처리 모듈은 센서부의 센서들의 출력값을 포함하는 센싱 데이터를 통신부를 통해 로봇 제어 시스템으로 전송할 수 있다. 로봇 제어 시스템 은 공간 내의 실내 맵을 사용하여 생성된 경로 데이터(경로)를 로봇으로 전송할 수 있다. 경로 데이 터는 통신부를 통해 데이터 처리 모듈로 전달될 수 있다. 데이터 처리 모듈은 경로 데이터를 바로 구동 제 어 모듈로 전달할 수 있고, 구동 제어 모듈은 경로 데이터에 따라 구동부를 제어하여 로봇의 실내 자 율 주행을 제어할 수 있다. 이에 따라, 로봇은 전술한 공간 내를 자율 주행하게 될 수 있다. 한편, 로봇 제어 시스템에서 주행 알고리즘이 실행되는 경우, 로봇 제어 시스템은 로봇으로부터 수신한 센 싱 데이터에 기반하여 주행 알고리즘에 따라 로봇을 제어하기 위한 제어 신호(예컨대, 속도 및/또는 방향 제어 신호)를 생성할 수 있고, 생성된 제어 신호에 기반하여 로봇이 제어되도록 할 수 있다. 또는, 로봇과 로봇 제어 시스템이 통신할 수 없는 경우나 로봇 내에서 자율 주행을 위한 알고리 즘이 실행되는 경우라면, 데이터 처리 모듈은 센싱 데이터를 로컬리제이션 처리 모듈로 전송하고, 경로 계획 처 리 모듈과 맵핑 처리 모듈을 통해 경로 데이터를 생성하여 로봇의 실내 자율 주행을 직접 처리할 수도 있 다. 로봇은 공간 내의 실내 맵을 생성하기 위해 사용되는 맵핑 로봇과는 구별되는 것일 수 있다. 로봇은 고가의 센싱 장비를 포함하지 않기 때문에 저가형 초음파 센서 및/또는 저가형 카메라 등과 같은 센서의 출력값 을 이용하여 실내 자율 주행을 처리할 수 있다. 한편, 로봇이 기존에 로봇 제어 시스템과의 통신을 통해 실내 자율 주행을 처리한 적이 있다면, 로봇 제어 시스템으로부터 기존에 수신한 경로 데이터가 포함하는 맵핑 데이터 등을 더 활용함으로써 저가의 센서들을 이용하면서도 보다 정확한 실내 자율 주행이 가능하게 될 수 있다. 다만, 실시예에 따라서는 로봇이 상기 맵핑 로봇을 겸할 수도 있다. 서비스 처리 모듈은 로봇 제어 시스템을 통해 수신되는 명령을 통신부를 통해 또는 통신부와 데 이터 처리 모듈을 통해 전달받을 수 있다. 구동부는 로봇의 이동을 위한 장비뿐만 아니라, 로봇(10 0)이 제공하는 서비스와 관련된 장비를 더 포함할 수 있다. 예컨대, 음식물/택배물 전달 서비스를 수행하기 위 해 로봇의 구동부는 음식물/택배물을 적재하기 위한 구성이나 음식물/택배물을 사용자에게 전달하기 위한 구성(일례로, 로봇 암(arm))을 포함할 수 있다. 또한, 로봇은 정보/콘텐츠의 제공을 위한 스피커 및/ 또는 디스플레이 등을 더 포함할 수도 있다. 서비스 처리 모듈은 제공해야 할 서비스를 위한 구동 명령을 구동 제어 모듈로 전달할 수 있고, 구동 제어 모듈은 구동 명령에 따라 로봇이나 구동부가 포함하는 구성 을 제어하여 서비스가 제공될 수 있도록 할 수 있다. 로봇은 전술한 것처럼, 경로가 나타내는 목적지(예컨대, 타겟 층에 위치하는 목적지)로의 이동을 위해 엘 리베이터 카에 탑승할 수 있고, 타겟 층에 도착한 후 엘리베이터 카로부터 하차하여, 목적지로 이동할 수 있다. 한편, 로봇이 진정한 목적지에 도착하기 위해 이동해야 할 타겟 층을 설명의 편의상 '목적지'라 는 용어를 사용하여 설명할 수 있다. 즉, 후술될 '목적지'라는 용어는 로봇의 엘리베이터 카에 의한 이동의 목적지를 의미할 수 있다. 한편, 전술한 것처럼 로봇이 로봇의 제어를 위한 센싱 데이터를 로봇 제어 시스템으로 제공할 뿐이고, 로봇의 제어를 위한 주행 알고리즘이 로봇 제어 시스템에서 실행되는 경우라면, 로봇은 브레인리스 로봇에 해당할 수 있다. 다만, 실시예에 따라서는, 이러한 주행 알고리즘은 로봇에 대해 탑재 될 수도 있다. 또한, 로봇의 각각은 기종이나 제공하는 서비스 등에 따라, 상이한 크기 및 형태를 가질 수 있다. 로봇을 제어하는 로봇 제어 시스템의 구성 및 동작에 대해서는 후술될 도 3 및 도 4를 참조하여 각각 더 자세하게 설명된다. 이상 도 1을 참조하여 전술된 기술적 특징에 대한 설명은, 도 2에 대해서도 그대로 적용될 수 있으므로 중복되 는 설명은 생략한다. 도 3 및 도 4는 일 실시예에 따른, 로봇을 제어하는 로봇 제어 시스템을 나타내는 블록도이다. 로봇 제어 시스템은 전술된 로봇의 공간 내에서의 이동(즉, 주행) 및 로봇에 의한 공간 내에서 의 서비스의 제공을 제어하는 장치일 수 있다. 로봇 제어 시스템은 복수의 로봇 각각의 이동 및 로봇 각각의 서비스의 제공을 제어할 수 있다. 로봇 제어 시스템은 로봇과의 통신을 통해, 로봇 이 서비스를 제공하기 위한 경로를 설정할 수 있고, 이러한 경로에 관한 정보를 로봇에게 전달할 수 있다. 로봇은 수신된 경로에 관한 정보에 따라 주행할 수 있고, 소정의 위치에서 또는 소정의 사용자에게 서비스를 제공할 수 있다. 로봇 제어 시스템은 상기 설정된 경로에 따라 로봇이 이동(주행)하도록 로봇의 이동을 제어할 수 있다. 로봇 제어 시스템은 적어도 하나의 컴퓨팅 장치를 포함할 수 있다. 로봇 제어 시스템은 전술한 것처럼 로봇의 주행을 위한 경로를 설정하고 로봇의 이동을 제어하 는 장치일 수 있다. 로봇 제어 시스템은 적어도 하나의 컴퓨팅 장치를 포함할 수 있고, 공간 내 또는 공간 외부에 위치하는 서버로 구현될 수 있다. 로봇 제어 시스템은 도시된 것처럼, 메모리, 프로세서, 통신부 및 입출력 인터페이스(34 0)를 포함할 수 있다. 메모리는 컴퓨터에서 판독 가능한 기록매체로서, RAM(random access memory), ROM(read only memory) 및 디스크 드라이브와 같은 비소멸성 대용량 기록장치(permanent mass storage device)를 포함할 수 있다. 여기서 ROM과 비소멸성 대용량 기록장치는 메모리와 분리되어 별도의 영구 저장 장치로서 포함될 수도 있다. 또한, 메모리에는 운영체제와 적어도 하나의 프로그램 코드가 저장될 수 있다. 이러한 소프트웨어 구성요 소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨 터에서 판독 가능한 기록매체를 포함할 수 있다. 다른 실시예에서 소프트웨어 구성요소들은 컴퓨터에서 판독 가 능한 기록매체가 아닌 통신부를 통해 메모리에 로딩될 수도 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신부에 의해 프로세서로 제공될 수 있다. 예를 들어, 프 로세서는 메모리에 로딩된 프로그램 코드에 따라 수신되는 명령을 실행하도록 구성될 수 있다. 이러 한 프로세서는 도 4에서 도시된 것과 같은 구성들(410 내지 440)을 포함할 수 있다. 프로세서의 구성들(410 내지 440) 각각은 프로세서의 일부로서 소프트웨어 및/또는 하드웨어 모듈일 수 있고, 프로세서에 의해 구현되는 기능(기능 블록)을 나타낼 수 있다. 프로세서의 구성들(410 내지 44 0)에 대해서는 도 4를 참조하여 후술한다. 통신부는 로봇 제어 시스템이 다른 장치(로봇 또는 다른 서버 등)와 통신하기 위한 구성일 수 있다. 말하자면, 통신부는 다른 장치에 대해 데이터 및/또는 정보를 전송/수신하는, 로봇 제어 시스템 의 안테나, 데이터 버스, 네트워크 인터페이스 카드, 네트워크 인터페이스 칩 및 네트워킹 인터페이스 포 트 등과 같은 하드웨어 모듈 또는 네트워크 디바이스 드라이버(driver) 또는 네트워킹 프로그램과 같은 소프트 웨어 모듈일 수 있다. 입출력 인터페이스는 키보드 또는 마우스 등과 같은 입력 장치 및 디스플레이나 스피커와 같은 출력 장치 와의 인터페이스를 위한 수단일 수 있다. 또한, 다른 실시예들에서 로봇 제어 시스템은 도시된 구성요소들보다 더 많은 구성요소들을 포함할 수도 있다. 도 4를 참조하여 프로세서의 구성들(410 내지 440)에 대해 더 자세하게 설명한다. 프로세서는 도시된 것처럼, 맵 생성 모듈, 로컬리제이션 처리 모듈, 경로 계획 처리 모듈 및 서비스 운영 모듈 을 포함할 수 있다. 이러한 프로세서가 포함하는 구성요소들은, 운영체제의 코드나 적어도 하나의 컴 퓨터 프로그램의 코드에 따른 제어 명령(instruction)에 따라 프로세서이 포함하는 적어도 하나의 프로세 서가 수행하는 서로 다른 기능들(different functions)의 표현들일 수 있다. 맵 생성 모듈은 공간 내부에서 자율 주행하는 (도시되지 않은) 맵핑 로봇이 목표 시설물(예컨대, 공간의 내부에 대해 생성한 센싱 데이터를 이용하여 목표 시설물의 실내 맵을 생성하기 위한 구성요소일 수 있다. 이 때, 로컬리제이션 처리 모듈은 로봇으로부터 네트워크를 통해 수신되는 센싱 데이터와 맵 생성 모 듈을 통해 생성된 목표 시설물의 실내 맵을 이용하여 목표 시설물 내부에서의 로봇의 위치를 결정할 수 있다. 경로 계획 처리 모듈은 상술한 로봇으로부터 수신된 센싱 데이터와 생성된 실내 맵을 이용하여 로봇 의 실내 자율 주행을 제어하기 위한 제어 신호를 생성할 수 있다. 예컨대, 경로 계획 처리 모듈은 로 봇의 경로(즉, 경로 데이터)를 생성할 수 있다. 생성된 경로(경로 데이터)는 해당 경로를 따르는 로봇 의 주행을 위해 로봇에 대해 설정될 수 있다. 로봇 제어 시스템은 생성된 경로에 관한 정보를 네트워크를 통해 로봇으로 전송할 수 있다. 일례로, 경로에 관한 정보는 로봇의 현재 위치를 나타내 는 정보, 현재 위치와 실내 맵을 맵핑하기 위한 정보, 그리고 경로 계획 정보를 포함할 수 있다. 경로에 관한 정보에는 로봇이 공간 내의 소정의 위치에서 또는 소정의 사용자에게 서비스를 제공하기 위해 주행해야 하 는 경로에 관한 정보가 포함될 수 있다. 경로 계획 처리 모듈은 로봇을 위한 경로(즉, 경로 데이터) 를 로봇에 대해 설정할 수 있다. 로봇 제어 시스템은 이러한 설정된 경로에 따라(즉, 설정된 경로를 따라) 로봇이 이동하도록 로봇의 이동을 제어할 수 있다. 서비스 운영 모듈은 로봇이 공간 내에서 제공하는 서비스를 제어하기 위한 기능을 포함할 수 있다. 예를 들어, 로봇 제어 시스템 또는 공간을 운영하는 서비스 제공자는 로봇의 이용자나 제작자에게 로 봇 제어 시스템이 제공하는 서비스(예컨대, 클라우드 서비스)를 위한 IDE(Integrated Development Environment)를 제공할 수 있다. 이 때, 로봇의 이용자나 제작자는 로봇이 공간 내에서 제공하는 서 비스를 제어하기 위한 소프트웨어를 IDE를 통해 제작하여 로봇 제어 시스템에 등록할 수 있다. 이 경우, 서비스 운영 모듈은 해당 로봇과 연관하여 등록된 소프트웨어를 이용하여 로봇이 제공하는 서비 스를 제어할 수 있다. 구체적인 예로, 로봇이 사용자가 요청한 물건(예컨대, 음식물 또는 택배물)을 해당 사용자의 위치로 전달하는 서비스를 제공한다고 가정하면, 로봇 제어 시스템은 로봇의 실내 자율 주행을 제어하여 로봇이 해당 사용자의 위치로 이동하도록 제어할 뿐만 아니라, 목적 위치에 도착한 경우 사 용자에게 물건을 전달하고, 사용자 응대 음성을 출력하는 일련의 서비스를 로봇이 제공하도록 관련된 명령 을 로봇에게 전달할 수 있다. 로봇 제어 시스템은 로봇을 제어하기 위한 컴퓨터 시스템으로서 서버일 수 있다. 로봇 제어 시스템 은 공간 또는 건물의 외부에 배치되는 서버로서, 클라우드 서버일 수 있다. 또는, 실시예에 따라서는 로봇 제어 시스템은 공간 또는 건물의 내부에 배치될 수도 있다. 로봇 제어 시스템(즉, 프로세서)은, 공간 내에서 운용되는 다수의 로봇들(즉, 멀티 로봇) 각각 을 제어할 수 있으며, 각 로봇의 엘리베이터 카에 대해 승차 또는 하차를 제어할 수 있다. 이를 위해, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해, 엘리베이터 카에 탑승한 로봇이 배 치될 적어도 하나의 배치 위치를 포함하는 가상 대기열을 결정할 수 있다. 로봇 제어 시스템은, 엘리 베이터 카에 탑승할 제1 로봇으로부터 획득되는 제1 로봇의 목적지인 제1 타겟 층에 대한 정보와 가상 대기열 내 배치 위치의 순서에 기반하여, 가상 대기열에 포함되는 소정의 제1 배치 위치에 제1 로 봇을 배치할 수 있다. 로봇 제어 시스템은, 엘리베이터 카가 타겟 층에 도착하면, 엘리베이터 카 로부터의 제1 로봇의 하차를 제어할 수 있다. 이에 따라, 엘리베이터 카에 대해 하차하는 제1 로봇 의 동선은 다른 로봇에 의해 방해 받거나, 다른 로봇의 이동을 방해하지 않을 수 있다. 가상 대기열을 결정하고, 가상 대기열을 이용하여 로봇을 제어하는 방법에 대해서는 후술될 도 6 내지 도 30을 참조하여 더 자세하게 설명한다. 이상 도 1 및 도 2를 참조하여 전술된 기술적 특징에 대한 설명은, 도 3 및 도 4에 대해서도 그대로 적용될 수 있으므로 중복되는 설명은 생략한다. 도 5는 일 실시예에 따른, 공간 내에서 운용되는 엘리베이터 카의 승강을 제어하는 엘리베이터 제어 시스템을 나타내는 블록도이다. 엘리베이터 제어 시스템은 공간 또는 건물 내를 이동(예컨대, 승강)하는 엘리베이터 카에 대한 호출 및 엘리베이터 카의 이동을 제어(또는, 엘리베이터 카의 이동을 제어하기 위한 신호를 생성)하는 장치 일 수 있다. 엘리베이터 제어 시스템은 적어도 하나의 컴퓨팅 장치를 포함할 수 있고, 건물 내 또는 건물 외부에 위치하는 컴퓨터 시스템으로 구현될 수 있다. 엘리베이터 제어 시스템은 엘리베이터 카를 직접 제어하는 제어반과는 구분되는 것일 수 있다. 엘리베 이터 제어 시스템은 엘리베이터 카를 제어하기 위해 요구되는 신호를 제어반으로 전달할 수 있다. 또 는, 엘리베이터 제어 시스템은 제어반을 포함하도록 구성될 수도 있다. 엘리베이터 제어 시스템은 도시된 것처럼, 메모리, 프로세서, 통신부 및 입출력 인터페이 스를 포함할 수 있다. 엘리베이터 제어 시스템의 구성들(510 내지 540)에 대한 일반적인 설명에 대해서는 전술된 로봇 제어 시스 템의 구성들(310 내지 340)의 일반적인 기술적 특징에 대한 설명이 그대로 적용될 수 있으므로 중복되는 설명은 생략한다. 한편, 엘리베이터 제어 시스템은 로봇 제어 시스템과는 별개의 주체에 의해 운영되거나 별개의 시스 템으로 구현되지만, 구현의 방법에 따라서는, 엘리베이터 제어 시스템과 로봇 제어 시스템이 하나의 단일한 시스템으로 구현될 수도 있다. 말하자면, 엘리베이터 제어 시스템과 로봇 제어 시스템은 건물 내에 또는 건물 외부에 존재하는 단일한 서버 또는 컴퓨팅 장치로서 구현될 수도 있다. 엘리베이터 제어 시스템은 로봇 제어 시스템과 연동될 수 있다. 예컨대, 엘리베이터 제어 시스템 은 엘리베이터 카(들)의 현재 위치, 목적지 등을 포함하는 스케줄 정보와 엘리베이터 카(들)의 만 원율, 내부 점유 상태 등을 포함하는 상황 정보를 로봇 제어 시스템에 공유할 수 있고, 로봇 제어 시스템 에 의한 요청에 따라, 엘리베이터 카(들)을 제어할 수 있다. 관련하여, 보다 자세한 예시들에 대해서 는, 후술될 도면들을 참조하여 더 자세하게 설명한다. 이상 도 1 내지 도 4를 참조하여 전술된 기술적 특징에 대한 설명은, 도 5에 대해서도 그대로 적용될 수 있으므 로 중복되는 설명은 생략한다.후술될 상세한 설명에서, 로봇 제어 시스템 또는 엘리베이터 제어 시스템의 구성들(예컨대, 프로세서 (320, 520) 등)에 의해 수행되는 동작은 설명의 편의상 로봇 제어 시스템 또는 엘리베이터 제어 시스템 에 의해 수행되는 동작으로 설명될 수 있다. 도 6은 일 실시예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열을 결정하고, 가상 대 기열을 이용하여 엘리베이터 카에 대한 로봇의 승차 및 하차를 제어하는 방법을 나타내는 흐름도이다. 로봇 제어 시스템(즉, 프로세서)은, 공간 내에서 운용되는 다수의 로봇들(즉, 멀티 로봇) 각각 을 제어할 수 있으며, 각 로봇의 엘리베이터 카에 대한 승차 또는 하차를 제어할 수 있다. 단계에서, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해, 엘리베이터 카에 탑승한 로봇이 배치될 적어도 하나의 배치 위치를 포함하는 적어도 하나의 가상 대기열을 결정할 수 있다. 도 1을 참조하여 전술한 것처럼, 각 배치 위치에는 하나의 로봇이 배치될 수 있고, 가상 대기열은 적어도 하 나의 배치 위치를 가질 수 있다. 배치 위치는 로봇이 배치되는 엘리베이터 카 내부의 일 영역일 수 있 다. 가상 대기열에 포함된 배치 위치는 순서를 가질 수 있다. 상기 순서는 로봇이 배치되는 순서일 수 있다. 배치 위치 중 순서가 가장 앞서는 배치 위치는 선두 배치 위치로 정의될 수 있다. 말하자면, 가상 대기열 에 배치되는 로봇은 선두 배치 위치부터 순차적으로 각 배치 위치에 배치될 수 있다. 단계에서, 로봇 제어 시스템은, 엘리베이터 카에 탑승할 제1 로봇의 목적지인 제1 타겟 층 에 대한 정보를 획득할 수 있다. 후술될 상세한 설명에서, 엘리베이터 카의 외부로부터 엘리베이터 카 에 탑승할 로봇을 제1 로봇으로 명명한다. 로봇 제어 시스템은 제1 로봇에 대해 설정된 경 로 정보로부터 제1 로봇이 이동해야 할 타겟 층에 대한 정보를 획득할 수 있다. 또한, 로봇 제어 시스템 은 제1 로봇의 현재 위치(즉, 현재 위치하고 있는 층)에 대한 정보를 더 획득할 수 있다. 단계에서, 로봇 제어 시스템은, 엘리베이터 카에 제1 로봇이 탑승하면, 제1 타겟 층 및 가 상 대기열의 순서에 기반하여, 가상 대기열에 포함된 제1 배치 위치에 제1 로봇을 배치할 수 있다. 제1 로봇이 배치되는 가상 대기열은, (예컨대, 복수의 가상 대기열들 중에서) 제1 로봇이 배치되 는 것으로 결정된 것일 수 있고, 또한, 제1 배치 위치는 (예컨대, 복수의 대기 위치들 중에서) 제1 로봇이 배치되는 것으로 결정된 것일 수 있다. 상기의 결정 방법에 대해서는 후술될 도면들을 참고하여 더 자세하게 설 명한다. 제1 로봇은 상기 제1 배치 위치에 배치된 상태로, 타겟 층으로 이동(즉, 승강)할 수 있다. 단계에서, 로봇 제어 시스템은, 엘리베이터 카가 제1 로봇이 하차할 타겟 층에 도착하면, 엘리베이터 카로부터의 제1 로봇의 하차를 제어할 수 있다. 말하자면, 로봇 제어 시스템은, 제1 배치 위치로부터 엘리베이터 카 외부로 이동하도록 제1 로봇을 제어하여, 제1 로봇을 엘리베이터 카로부터 하차시킬 수 있다. 실시예의 가상 대기열은, 엘리베이터 카에 대한 로봇의 탑승 및 엘리베이터 카로부터의 로봇 의 하차 시에 엘리베이터 카에 탑승하고 있는 다른 로봇의 불필요한 하차(예컨대, 다른 로봇 의 타겟 층에 도착하기 전에 다른 로봇이 하차하는 것)를 요구하지 않도록 결정될 수 있다. 말하자면, 엘리베이터 카에 대해 하차하는 제1 로봇의 동선은 다른 로봇에 의해 방해 받거나, 다 른 로봇의 이동을 방해하지 않을 수 있다. 이처럼, 실시예에서는, 엘리베이터 카에 대한 로봇의 승하차 동선과 다른 로봇(들)의 동선이 중첩되지 않을 수 있다(즉, 동선 꼬임이 방시됨). 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열과 거기에 포함되는 배치 영역은 다음과 같은 제약 조건을 가질 수 있다. 가상 대기열의 순서가 더 앞서는 배치 위치에 배치되는 로봇은 가상 대기열의 순서가 뒤인 배치 위치에 배치된 로봇보다 더 먼저 하차하거나, 적어도 동일한 층에서 하차하는 것일 수 있다. 즉, 가상 대 기열에서 앞선 순서의 배치 위치에 배치되는 로봇은 뒤의 로봇과 타겟 층이 같거나, 엘리베이터 카가 더 먼저 도착하는 타겟 층을 가질 수 있다. 말하자면, 가상 대기열은, 엘리베이터 카에 탑승한 로봇들이 배치될 복수의 배치 위치들을 포함하 고, 배치 위치들 중 순서가 앞서는 배치 위치에는, 순서가 더 늦은 배치 위치에 배치된 로봇보다, 더 늦게 하차하지 않는 로봇이 배치되도록 결정될 수 있다. 한편, 제1 로봇은 가상 대기열의 선두 배치 위치에 배치되도록 제어될 수 있다. 말하자면, 복수의 가 상 대기열들이 존재하는 경우에 있어서, 제1 로봇은 가상 대기열들 중에서 전술한 제약 조건을 만 족하는 가상 대기열의 선두 배치 위치에 배치될 수 있다. 선두 배치 위치에 다른 로봇이 배치되어 있 는 경우, 로봇 제어 시스템은 해당 다른 로봇이 제1 로봇보다 더 나중에(또는 적어도 같은 층에 서) 하차하는 것이면, 해당 다른 로봇을 선두 배치 위치로부터 다음의 배치 위치로 이동시키고 제1 로봇 을 선두 배치 위치에 배치시킬 수 있다. 관련하여, 도 7은 일 예에 따른, 가상 대기열에 포함된 배치 위치에 엘리베이터 카에 탑승한 로봇을 배치하는 방법을 나타내는 흐름도이다. 단계에서, 로봇 제어 시스템은, 가상 대기열 중 제1 가상 대기열에 포함되는 배치 위치들 중 순 서가 가장 앞서는 선두 배치 위치에 제1 로봇과는 다른 로봇인 제2 로봇이 배치되어 있는지 여부를 확인할 수 있다. 예컨대, 단계에서의 확인은 제1 로봇 및/또는 제2 로봇으로부터 획득되는 센싱 데이터에 기반하여 수행될 수 있다. 제1 가상 대기열은, 엘리베이터 카의 내부 영역에 대해 로봇 제어 시스 템에 의해 결정되는 복수의 가상 대기열들 중 어느 하나일 수 있다. 단계에서, 로봇 제어 시스템은, 상기 제1 가상 대기열의 선두 배치 위치에 제1 로봇과는 다른 로봇인 제2 로봇이 배치되어 있는 경우, 제1 로봇의 목적지인 제1 타겟 층과 제2 로봇의 목적지 인 제2 타겟 층을 비교할 수 있다. 예컨대, 로봇 제어 시스템은 제1 로봇에 대해 설정된 경로 정보와 제2 로봇에 대해 설정된 경로 정보를 비교함으로써, 제1 타겟 층과 제2 타겟 층을 비교할 수 있다. 단계에서, 로봇 제어 시스템은, 제2 타겟 층과 제1 타겟 층이 동일하거나, 엘리베이터 카가 상 기 제1 타겟 층으로 먼저 이동하는 경우(즉, 제1 로봇이 제2 로봇보다 먼저 또는 동일한 층에서 하차 하는 경우), 제2 로봇을 배치 위치들 중 선두 배치 위치의 다음의 배치 위치인 제2 배치 위치로 이동시키 고, 선두 배치 위치에 제1 로봇을 배치할 수 있다. 상기 선두 배치 위치는 제1 로봇이 배치되는 위치 로서 전술한 제1 배치 위치에 대응할 수 있다. 한편, 단계에서, 로봇 제어 시스템, 단계에서의 비교 결과, 엘리베이터 카가 제1 타겟 층보 다 제2 타겟 층으로 먼저 이동하는 경우(즉, 제2 로봇이 제1 로봇보다 먼저 하차하는 경우), 엘리베 이터 카의 내부 영역에 대해 결정된 복수의 가상 대기열들 중 제1 가상 대기열과는 상이한 제2 가상 대기열 이 포함하는 배치 위치에 제1 로봇을 배치할 수 있다. 제1 로봇이 배치되는 배치 위치는 제2 가상 대 기열의 선두 배치 위치일 수 있다. 제2 가상 대기열의 선두 배치 위치에 다른 로봇이 이미 배치되어 있는 경우 에는 전술한 단계들(710 내지 740)이 유사하게 다시 수행될 수 있다. 설명한 바와 같이, 엘리베이터 카에 대해 결정된 가상 대기열(들) 중에서 엘리베이터 카에 탑승하 는 제1 로봇이 배치될 가상 대기열과 그 배치 위치가 결정될 수 있다. 아래에서는, 도 8을 참조하여, 엘리베이터 카에 대해 결정된 복수의 가상 대기열들 중에서 제1 로봇 이 배치될 최적 가상 대기열을 결정하는 방법을 더 자세하게 설명한다. 도 8은 일 예에 따른, 가상 대기열들 중 최적 가상 대기열을 결정하고, 최적 가상 대기열에 포함된 배치 위치에 엘리베이터 카에 탑승한 로봇을 배치하는 방법을 나타내는 흐름도이다. 전술한 것처럼, 카의 내부 영역에 대해서는, 로봇 제어 시스템에 의해, 복수의 가상 대기열들이 결정될 수 있다. 로봇 제어 시스템은 이들 복수의 가상 대기열들 중에서 최적 가상 대기열을 결정하여 제1 로봇을 배치시킬 수 있다. 단계에서, 로봇 제어 시스템은, 복수의 가상 대기열들의 각각의 각 선두 배치 위치가 비어있는지 여부, 각 선두 배치 위치에 배치되어 있는 로봇의 목적지(타겟 층), 및 복수의 가상 대기열들의 각각 에 기 배치되어 있는 로봇(들)의 목적지(타겟 층)에 기반하여, 복수의 가상 대기열들 중에서 상기 제1 로봇이 배치될 수 있는 최적(optimal) 가상 대기열을 결정할 수 있다. 단계에서, 로봇 제어 시스템은, 결정된 최적 가상 대기열의 선두 배치 위치에 제1 로봇을 배치 할 수 있다. 상기 선두 배치 위치는 전술한 제1 배치 위치가 될 수 있다. 예컨대, 로봇 제어 시스템은, 복수의 가상 대기열들 중에서 선두 배치 위치가 비어있거나, 제1 로봇 보다 나중에 하차하거나 제1 로봇과 동일한 층에서 하차하는 제2 로봇이 선두 배치 위치에 배치되고 있는 가상 대기열(들) 중에서 최적 가상 대기열을 결정할 수 있다. 최적 가상 대기열의 결정에는 복수의 가상 대기열들에 이미 배치되어 있는 로봇(들)의 목적지가 더 고려될 수 있고, 또는/추가로, 제1 로봇 이후에 엘리베이터 카에 탑승할 다른 로봇의 목적지가 더 고려될 수 있다. 최적 가상 대기열은 제1 로 봇의 목적지 및 상기 제1 로봇 이후에 엘리베이터 카에 탑승할 다른 로봇의 목적지를 고려 하여, 복수의 가상 대기열들 중에서 엘리베이터 카 내에서의 로봇들의 재배치(재이동)를 최소화하 는 것으로서 결정될 수 있다. 설명한 바와 같이, 엘리베이터 카에 대해 결정된 가상 대기열(들) 중에서 엘리베이터 카에 탑승하 는 제1 로봇이 배치될 최적의 가상 대기열과 그 배치 위치가 결정될 수 있다. 이상 도 1 내지 도 5를 참조하여 전술된 기술적 특징에 대한 설명은, 도 6 내지 도 8에 대해서도 그대로 적용될 수 있으므로 중복되는 설명은 생략한다. 아래에서는, 도 12를 참조하여, 엘리베이터 카에 대해 결정되는 복수의 가상 대기열들에 대해 더 자세 하게 설명한다. 도 12는 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열을 나타낸다. 도 12에서 도시된 것처럼, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해 4개의 가상 대기열 들(1210 내지 1240)을 결정할 수 있다. 각 가상 대기열은 적어도 하나의 배치 위치를 포함할 수 있으며, 각 배 치 위치에는 하나의 로봇이 배치될 수 있다. 한편, 도시된 것처럼, 엘리베이터 카의 내부 영역은 로봇이 탑승 또는 하차하기 위한 적어도 하나의 승하차 위치를 포함할 수 있다. 승하차 위치는 로봇의 엘리베이터 카에 대한 승하차 시에 로봇이 통과하는 영역으로서, 엘리베이터 카의 내부 영역 중 도어 주변의 영역을 나타낼 수 있다. 도시된 것처럼, 승하차 위치는 2대의 로봇들이 통과 가능하도록 설정될 수 있고, 도시된 것과는 달리 1대 의 로봇이 통과 가능하도록 설정될 수도 있다. 로봇 제어 시스템은, 엘리베이터 카의 내부 영역 중에서 승하차 위치를 제외한 영역에 대해 가 상 대기열을 결정할 수 있다. 따라서, 도 12에서 결정된 가상 대기열들(1210 내지 1240)은 승하차 위치 를 포함하지 않을 수 있다. 도시된 예시에서처럼, 일례로, 제1 가상 대기열(1210, 대기열 1)은 대기 위치들(A1, A2)을 포함할 수 있고, 제2 가상 대기열(1220, 대기열 2)은 대기 위치들(B2, B3, A3)을 포함할 수 있고, 제3 가상 대기열(1230, 대기열 3) 은 대기 위치들(C2, C3, D3)을 포함할 수 있고, 제4 가상 대기열(1240, 대기열 4)은 대기 위치들(D1, D2)을 포 함할 수 있다. 승하차 위치는 복수(예컨대, 2곳)이고, 복수의 가상 대기열들(1210 내지 1240)이 결정된 경우에 있어서, 복수의 승하차 위치들 중에서, 제1 로봇이 엘리베이터 카에 승차할 때 진입하는 승하차 위치 에 따라, 가상 대기열들(1210 내지 1240) 중에서 제1 로봇이 배치되는 가상 대기열이 결정될 수 있 다. 말하자면, 제1 로봇이 승하차 위치들 중 B1을 통해 엘리베이터 카에 탑승하게 되면, 제1 로 봇이 배치될 가상 대기열은 가상 대기열들(1210, 1220) 중에서 결정될 수 있고; 제1 로봇이 승하차 위치들 중 C1을 통해 엘리베이터 카에 탑승하게 되면, 제1 로봇이 배치될 가상 대기열은 가상 대기열들(1230, 1240) 중에서 결정될 수 있다. 또는, 제1 로봇이 배치될 가상 대기열이 먼저 결정되는 경우, 제1 로봇은, 승하차 위치들 중에 서, 결정된 가상 대기열에 해당하는 승하차 위치를 통해 엘리베이터 카에 탑승할 수 있다. 제1 로봇이 배치될 가상 대기열이 가상 대기열들(1210, 1220) 중 하나인 경우, 제1 로봇은 B1을 통해 엘리베이터 카 에 탑승할 수 있고; 제1 로봇이 배치될 가상 대기열이 가상 대기열들(1230, 1240) 중 하나인 경우, 제 1 로봇은 C1을 통해 엘리베이터 카에 탑승할 수 있다. 상기와 같은 제1 로봇의 이동 제어 및 제1 로봇이 배치될 가상 대기열의 결정은 로봇 제어 시스템 에 의해 수행될 수 있다. 도 12에서 예시된 가상 대기열들(1210 내지 1240)과 승하차 위치는 단지 예시적인 것으로서, 실시예에 따 라, 그 배치 위치와 형태(예컨대, 가상 대기열들의 개수 및 각각의 길이 및/또는 승하차 위치의 개수 등)는 상이하게 될 수 있다. 이상 도 1 내지 도 8을 참조하여 전술된 기술적 특징에 대한 설명은, 도 12에 대해서도 그대로 적용될 수 있으 므로 중복되는 설명은 생략한다. 후술될 도면들 도 13 내지 도 22의 예시에서는, 가상 대기열들(1210 내지 1240) 중 제3 가상 대기열(1230, 대기 열 3)은 설명의 편의상 로봇들의 제어에 있어서 사용되지 않고 있다. 따라서, 도시된 예시에서의 엘리베이터 카 의 내부 영역의 로봇 배치 위치들은 도시된 것과 같이 4*3의 크기를 갖는 것이 아니라, (제3 가상 대기열 (1230, 대기열 3)이 생략된) 3*3의 크기를 가질 수도 있다. 일례로, 이 때의 제1 가상 대기열은 A1, A2; 제2 가상 대기열은 B2, B3, A3; 제4 가상 대기열은 C2, C3로 구성될 수 있고, 승하차 위치는 B1, C1이 될 수 있다. 도 13 내지 도 22는 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 결정된 복수의 가상 대기열들을 이용하여, 멀티 로봇의 엘리베이터 카에 대한 승차 및 하차를 제어하는 방법을 나타낸다. 도 13 내지 도 22에서는, 도 12를 참조하여 설명한 가상 대기열들(1210 내지 1240; 대기열 1 내지 대기열 4)을 이용하여 다수의 로봇들(100, R1 내지 R8)의 엘리베이터 카에 대한 승하차를 제어하는 방법이 설명되었다. 도 13 내지 도 22에서는 엘리베이터 카는 하행 운행하는 것으로 예시되었다. 도 13의 로봇들(R1 내지 R8)의 스케줄 정보(1310, 1320)에서 도시된 것처럼, 각 로봇은 공간 또는 건물의 층들 (1층 내지 7층) 중에서 특정 층으로부터 다른 층으로 이동하도록 제어될 수 있다. 예컨대, 로봇(R1)은 6층에서 탑승하여 1층에서 하차하도록 제어될 수 있다. 여기서, 로봇(R1)의 타겟 층은 1층이 될 수 있다. 도 14에서 도시된 것처럼, 하행하는 엘리베이터 카는 공간 또는 건물의 층들을 최상층(7층)으로부터 최하층 (1층)까지 스윕(sweep)하도록 제어될 수 있다. 스케줄 정보에서 도시된 것처럼, 7층에서는 로봇(R4)가 엘 리베이터 카에 탑승하도록 제어될 수 있다. 로봇(R4)은 B1을 통해 탑승하여 대기열 1의 선두 배치 위치인 A1에 배치될 수 있다(1420 및 1430 참조). 다음으로, 도 15에서 도시된 것처럼, 엘리베이터 카는 6층으로 이동될 수 있고, 6층에서는, 로봇들(R1, R2, R8)이 탑승할 수 있다(1510 참조). 여기서, 로봇들(R1, R2)은 B1을 통해 탑승할 수 있고, 로봇(R8)은 C1을 통해 탑승할 수 있다. 로봇(R1)은 대기열 2의 선두 배치 위치인 B2에 배치될 수 있다. 한편, 로봇(R2)는 대기열 1의 선두 배치 위치인 A1에 배치될 수 있다. 따라서, A1에 이미 배치되어 있던 로봇(R4)는 그 다음 배치 위치인 A2 로 이동될 수 있다. 로봇(R2)는 타겟 층이 4층인 바 그 타겟 층이 로봇(R4)의 타겟 층인 4층과 동일하고, 따라 서, 전술한 제약 조건을 만족할 수 있다. 이에 비해, 로봇(R1)은 로봇(R4)보다 더 늦게 하차하는 것인 바, 전술 한 제약 조건을 만족하지 못하므로, 대기열 1의 선두 배치 위치인 A1에 배치될 수 없다(1520 및 1530 참조). 다음으로, 도 16에서 도시된 것처럼, 엘리베이터 카는 5층으로 이동될 수 있고, 5층에서는, 로봇들(R3, R 5)이 탑승할 수 있다(1610 참조). 여기서, 로봇들(R3, R5)는 B1을 통해 탑승할 수 있다. 대기열 1은 모두 점유 되어 있으므로, 로봇들(R3, R5)은 대기열 2에 배치되도록 제어될 수 있다. 로봇들(R3, R5)의 타겟 층들과 대기 열 2의 선두 배치 위치 B2 에 기 배치되어 있는 로봇(R1)의 타겟 층을 비교하면, 로봇들(R3, R5, R1)은 로봇 (R3), 로봇(R5), 로봇(R1) 순으로 엘리베이터 카에서 하차하게 되는 것으로 확인될 수 있다. 따라서, 로봇 (R1)은 B2로부터 A3으로 이동될 수 있고, 로봇(R5)이 B3에 배치될 수 있고, 로봇(R3)이 선두 배치 위치 B2 에 배치될 수 있다. 따라서, 로봇들의 배치는 모두 전술한 제약 조건을 만족할 수 있다(1620, 1630 참조). 다음으로, 도 17 및 도 18에서 도시된 것처럼, 엘리베이터 카는 4층으로 이동될 수 있고, 4층에서는, 로봇 (R6)이 탑승할 수 있고, 로봇들(R2, R4)이 하차할 수 있다(1710, 1810 참조). 하차하는 로봇들(R2, R4)은 모두 대기열 1에 배치되어 있고, 로봇(R2)와 로봇(R4)는 순차적으로 하차할 수 있다. 로봇들(R2, R4)은 B1을 통해 하 차할 수 있다(1720, 1730 참조). 한편, 탑승하는 로봇(R6)은 B1을 통해 탑승하여 대기열 1의 선두 배치 위치인 A1에 탑승할 수 있다(1820, 1830 참조). 또는, 실시예에 따라서는, 로봇(R6)은 C1을 통해 탑승하여 (비어 있는) 대기열 3의 선두 배치 위치인 C2에 배치될 수도 있다. 로봇 제어 시스템은, 예컨대, 이후에 엘리베이터 카에 탑승하게 될 다른 로봇들(R7 등)의 이동 계획(타겟 층 등)을 고려하여, 로봇(R6)이 배치될 최적 대기열 을 대기열 1 및 대기열 3 중에서 어느 하나로 결정할 수 있다. 로봇들(R2, R4, R6)의 승하차가 동일한 승하차 위치 B1를 통해 이루어지는 경우, 로봇들(R2, R4, R6)의 동선이 중첩되지 않도록, 로봇들(R2, R4, R6)은 로봇들(R2, R4)이 하차한 후에 로봇(R6)이 엘리베이터 카에 탑승하 도록 제어될 수 있다. 다음으로, 도 19에서 도시된 것처럼, 엘리베이터 카는 3층으로 이동될 수 있고, 3층에서는, 로봇(R8)이 하 차할 수 있다(1910 참조). 로봇(R8)은 C1을 통해 하차할 수 있다(1920, 1930 참조). 다음으로, 도 20 및 도 21에서 도시된 것처럼, 엘리베이터 카는 2층으로 이동될 수 있고, 2층에서는, 로봇 (R7)이 탑승할 수 있고, 로봇들(R3, R6)이 하차할 수 있다(2010, 2110 참조). 하차하는 로봇들(R3, R6) 중 로 봇(R6)은 대기열 1에 배치되어 있고, 로봇(R3)은 대기열 2에 배치되어 있다. 로봇(R6)은 B1을 통해 하차할 수 있고, 로봇(R3)은 C1을 통해 하차할 수 있는 바, 두 로봇들은 동시에 하차할 수 있다(2020, 2030 참조). 한편, 탑승하는 로봇(R7)은 C1을 통해 탑승하여 대기열 4의 선두 배치 위치인 D1에 탑승할 수 있다(2120, 2130 참조). 또는, 실시예에 따라서는, 로봇(R7)은 (비어 있는) 대기열들 1, 2 및 3의 선두 배치 위치에 배치될 수도 있다 (모든 경우에서 제약 조건을 만족함). 다음으로, 도 22에서 도시된 것처럼, 엘리베이터 카는 1층으로 이동될 수 있고, 1층에서는, 로봇들(R1, R5, R7)이 하차할 수 있다(2210 참조). 로봇(R7)은 C1을 통해 하차할 수 있고, 로봇들(R5, R1)은 B1을 통해 순차적 으로 하차할 수 있다(2220, 2230 참조). 도 13 내지 도 22를 참조하여 설명한 것처럼, 실시예에서는 로봇들(R1 내지 R8)이 가상 대기열들(대기열 1 내지 4)을 이용하여 엘리베이터 카에 대해, 동선의 중첩이나 불필요한 승하차 이동 없이, 효율적으로 승차 및 하 차할 수 있다. 이상 도 1 내지 도 8 및 도 12를 참조하여 전술된 기술적 특징에 대한 설명은, 도 13 내지 도 22에 대해서도 그 대로 적용될 수 있으므로 중복되는 설명은 생략한다. 아래에서는, 도 9 및 도 10을 참조하여, 엘리베이터 카의 내부 영역에 대해 가상 대기열을 결정함에 있 어서, 가상 대기열을 동적으로 조정하는 방법에 대해 더 자세하게 설명한다. 도 9는 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열의 길이를 결정하는 방법을 나타내는 흐름도이다. 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해 가상 대기열을 결정함에 있어서, 공간 내 에서 운용되는 로봇들 또는 엘리베이터 카에 탑승 예정인 로봇들이 제공하는 서비스 또는 이동 패턴에 기반하여, 적어도 하나의 가상 대기열의 길이를 결정함으로써 복수의 가상 대기열들을 결정할 수 있 다. 가상 대기열의 길이는 배치 위치의 수를 나타낼 수 있다. 엘리베이터 카에 탑승 예정인 로봇들은 로봇들의 스케줄링 정보 및 (엘리베이터 제어 시스템으로부터의) 엘리베이터 카의 스케줄링 정보 로부터 파악될 수 있다. 일례로, 결정되는 적어도 하나의 가상 대기열의 길이는, i) 로봇들이 엘리베이터 카를 통해 상대적으 로 더 적은 층들 간을 이동하는 이동 패턴을 가질수록 더 짧게 되거나; ii) 로봇들이 엘리베이터 카를 통해 임의의 층들 간을 이동하는 이동 패턴을 갖는지 또는 특정한 층을 중심으로 층들 간을 이동하는 이동 패턴 을 갖는지 여부에 따라 상이하게 되거나; iii) 로봇들이 제공하는 서비스의 종류에 따라 상이하게 되거나; 또는 iv) 로봇들이 주행하는 시간대에 따라 상이하게 될 수 있다. 로봇 제어 시스템은, 로봇들의 이동 스케줄 및 이동 패턴에 따라 다양한 형태의 가상 대기열들을 엘리베이터 카의 내부 영역에 대해 설정(즉, 결정)할 수 있다. i)과 관련하여, 로봇 제어 시스템은 로 봇이 상대적으로 먼 거리를 승강하는 경우(즉, 더 많은 층들 간을 승강하는 경우) 엘리베이터 카에 대 해 더 긴 길이의 가상 대기열을 설정할 수 있다. 또는, 로봇 제어 시스템은 로봇이 상대적으로 짧은 거리를 승강하는 경우(즉, 더 적은 층들 간을 승강하는 경우) 엘리베이터 카에 대해 더 짧은 길이의 가상 대기열을 설정할 수 있고, 짧은 거리를 승강하는 로봇들이 상대적으로 더 많은 경우에는 더 짧은 길이의가상 대기열들의 수를 늘릴 수 있다. 이에 따라, 로봇 제어 시스템은 더 짧은 길이의 가상 대기열들과 더 긴 길이의 가상 대기열(들)의 조합을 엘리베이터 카에 대해 설정할 수 있다. ii)와 관련하여, 로봇들 은 임의의 층들 간을 이동하거나 또는 특정한 베이스 층을 중심으로 층들 간을 이동하는 이동 패턴을 가질 수 있다. 예컨대, 로봇들이 특정한 베이스 층(예컨대, 로봇들의 메인터넌스를 위한 층 또는 물건 또는 화물을 적재하기 위한 층)을 중심으로 층들 간을 이동하는 이동 패턴을 가질 경우 로봇들이 상대적으로 짧 은 거리를 승강하는 것으로 판단될 수 있고, 따라서, 로봇 제어 시스템은 엘리베이터 카에 대해 더 짧 은 길이의 가상 대기열을 설정할 수 있다. iii)과 관련하여, 로봇들이 특정한 베이스 층(예컨대, 로봇들 의 메인터넌스를 위한 층 또는 물건 또는 화물을 적재하기 위한 층)을 중심으로 층들 간을 이동하는 서비 스(예컨대, 특정 층을 중심으로 하는 음식물/화물 배달 서비스 등)를 제공할 경우 로봇들이 상대적으로 짧 은 거리를 승강하는 것으로 판단될 수 있고, 따라서, 로봇 제어 시스템은 엘리베이터 카에 대해 더 짧 은 길이의 가상 대기열을 설정할 수 있다. 또는, 로봇들이 임의의 층들 간을 승강하는 서비스를 제공할 경 우(택배 배달 서비스), 로봇 제어 시스템은 엘리베이터 카에 대해 더 긴 길이의 가상 대기열을 설정할 수 있다. 또는, 로봇들이 제공하는 서비스는 건물 내 층들의 청소 또는 경비와 같이 사전에 계획된 작업 계획을 가질 수 있고, 로봇 제어 시스템은 이러한 작업 계획이 나타내는 로봇들의 이동 패턴을 고려 하여 가상 대기열들의 수와 각 가상 대기열의 길이를 결정할 수 있다. iv)와 관련하여, 로봇들의 이동 패턴은 로봇들이 운용되는 시간대에 따라 상이하게 될 수 있다. 예컨대, 점심시간에 해당하는 시간대에는 각 층으로의 빠른 이동이 요구되는 식사 배달 서비스가 로봇들에 의해 제공될 수 있다. 이러한 경우, 로봇 제어 시스템은 상대적으로 더 짧은 길이를 갖고 많은 수의 가상 대기열들을 엘리베이터 카에 대해 설 정할 수 있다. 말하자면, 로봇 제어 시스템은 시간대별로 로봇들이 제공하는 서비스에 따른 로봇들 의 이동 패턴을 고려하여 가상 대기열들의 수와 각 가상 대기열의 길이를 결정할 수 있다. 아래에서는, 로봇들의 이동 패턴을 결정하는 예시적인 방법에 대해 더 자세하게 설명한다. 단계에서, 로봇 제어 시스템은, 소정의 기간 동안의 로봇들의 엘리베이터 카를 통한 층들 간의 이동들을 학습함으로써, 로봇들의 이동 패턴을 결정할 수 있다. 예컨대, 로봇 제어 시스템은 로 봇들의 이동 패턴을 추정하도록 미리 훈련된 모델을 사용하여, 로봇들의 이동 패턴을 결정할 수 있다. 이러한 모델은, 인공지능(AI) 기반의 모델 또는 인공 신경망 기반의 학습 모델일 수 있다. 단계에서, 로봇 제어 시스템은, 결정된 이동 패턴에 기반하여, 적어도 하나의 가상 대기열의 길이를 결정함으로써, 엘리베이터 카에 대한 복수의 가상 대기열들을 결정할 수 있다. 이처럼, 로봇 제어 시스템은, 로봇들의 이동에 관해 축적된 데이터에 기반하여 로봇들의 이동 패턴을 학습할 수 있고, 이에 기반하여 엘리베이터 카에 대한 복수의 가상 대기열들을 결정할 수 있다. 도 10은 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 결정된 가상 대기열을 동적으로 조정하는 방법을 나 타내는 흐름도이다. 실시예에서, 로봇 제어 시스템은, 엘리베이터 카에 탑승하는 로봇의 목적지(타겟 층)와 엘리베이 터 카에 탑승한 다른 로봇의 목적지(타겟 층)에 기반하여, 엘리베이터 카의 내부 영역에 대해 결 정되는 가상 대기열들을 동적으로 조정(또는 업데이트)(예컨대, 길이 조절, 삭제, 추가 등)함으로써, 공간 내에 서 운용되는 로봇들의 스케줄이나 목적지가 변경되는 경우에도 엘리베이터 카에 대한 로봇의 탑 승 및 하차를 효율적으로 제어할 수 있으며, 또한, 엘리베이터 카에 탑승하는 로봇의 목적지를 고려하여 최적화된 가상 대기열들에 로봇을 배치할 수 있다. 단계에서, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열들(3 0)에 대해, 가상 대기열들 중 적어도 하나의 가상 대기열의 길이를 조정하는 것, 새로운 가상 대기열을 추 가하는 것 및 가상 대기열을 삭제하는 것 중 적어도 하나를 수행함으로써, 가상 대기열들을 동적으로 조정 할 수 있다. 예컨대, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열들에 기 배 치되어 있는 로봇의 목적지와 제1 로봇의 목적지에 기반하여, 가상 대기열들 중 적어도 하나의 가상 대기열의 길이를 조절할 수 있다. 이러한 길이의 조절은, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열들 중 하나의 가상 대 기열의 길이를 줄이거나, 하나의 가상 대기열을 삭제하고, 줄어들거나 삭제된 부분만큼 다른 하나의 가상 대기 열의 길이를 늘림으로써 가상 대기열들 중 적어도 하나의 가상 대기열의 길이를 조절하는 것일 수 있다.이러한 가상 대기열의 길이를 조절하는 것은, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열들 중에서, 제1 로봇을 배치할 (전술한 제약 조건을 만족하는) 가상 대기열이 존재하지 않는 경우에 수 행될 수 있다. 또한, 가상 대기열의 길이를 조절하는 것은, 가상 대기열들에 기 배치되어 있는 적어도 하나의 로봇을 다른 배치 위치로 이동시키는 것을 수반할 수 있다. 기 배치되어 있는 적어도 하나의 로봇을 다른 배치 위 치로 이동시킴으로써, 제1 로봇을 배치하기 위한 (전술한 제약 조건을 만족하는) 가상 대기열의 배치 위치 가 확보될 수 있다. 로봇 제어 시스템은, 전술한 바에 따라 길이가 조절된 가상 대기열에 포함된 순서가 가장 앞서는 선두 배 치 위치에 제1 로봇을 배치할 수 있다. 예컨대, 가상 대기열들 중 하나의 가상 대기열의 길이를 줄이거나, 하나의 가상 대기열이 삭제됨에 따라, 줄어들거나 삭제된 부분만큼 다른 하나의 가상 대기열의 길이를 늘림으로써 가상 대기열들 중 적어도 하나 의 가상 대기열의 길이가 조절된 경우, 로봇 제어 시스템은, 길이가 늘어난 가상 대기열의 선두 배치 위치 에 제1 로봇을 배치할 수 있다. 한편, 로봇 제어 시스템은, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열(들)에 기 배 치되어 있는 로봇(들)의 목적지와 제1 로봇의 목적지에 기반하여, 새로운 가상 대기열을 생성할 수 있다. 새로운 가상 대기열은, (엘리베이터 카의 내부 영역에 대해 결정된) 기존의 가상 대기열의 길이를 줄임에 따라 줄어든 부분에 해당하는 길이를 가질 수 있다. 이러한 새로운 가상 대기열의 생성은, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열(들) 중에서, 제1 로봇을 배치할 (전술한 제약 조건을 만족하 는) 가상 대기열이 존재하지 않는 경우에 수행될 수 있다. 새로운 가상 대기열이 생성된 경우, 로봇 제어 시스템은, 새로운 가상 대기열에 포함된 순서가 가장 앞서 는 선두 배치 위치에 상기 제1 로봇을 배치할 수 있다. 전술한 가상 대기열의 동적 조정(길이 조절, 생성, 삭제 등)은 제1 로봇이 엘리베이터 카에 탑승하기 전에 미리 수행될 수 있다. 따라서, 실시예에서는, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열(들) 중에서, 제1 로봇 을 배치할 전술한 제약 조건을 만족하는 가상 대기열이 존재하지 않는 경우, 상기의 동적 조정에 따라 제1 로봇이 엘리베이터 카의 적절한 배치 위치에 배치될 수 있다. 관련하여, 도 23 내지 도 26은 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 결정된 복수의 가상 대기열들 을 동적으로 조정하는 방법을 나타낸다. 도 23 내지 도 26을 참조하여, 엘리베이터 카에 대해 로봇들(R1, R2, R3)이 승하차 하는 경우에 있어서 가 상 대기열들(대기열 1 내지 4)이 동적으로 조정되는 예시에 대해 설명한다. 도 23 내지 도 26에서, 엘리베이터 카는 4층에 위치하고 하행하는 것으로 가정되었다. 도 23에서는, 엘리베이터 카에는 로봇들(R2, R1, RB, RA)이 탑승되어 있고, 또한, 대기열 3 및 대기열 4도 모두 다른 로봇들에 의해 점유되어 있으며, 로봇(R3)은 엘리베이터 카에 탑승 예정인 것으로 가정되었다 (2310 내지 2330 참조). 대기열 1의 선두 배치 위치인 A1은 비어 있으나, 로봇(R3)은 로봇(R2)보다 늦게 하차하 는 것인 바, 전술한 제약 조건을 만족하지 못하므로, A1에는 배치될 수 없다. 이 경우, 도 24에서처럼, 로봇 제어 시스템은 대기열 1의 배치 위치인 A2를 대기열 2의 4번째 배치 위치로 변경할 수 있다. 이에 따라, 대기열 1의 길이는 1만큼 줄고, 대기열 2는 길이가 1만큼 늘어날 수 있다. 로봇 (R2)는 A2에서 A1으로 이동될 수 있다. 로봇(R3)은 로봇(R1)보다 먼저 하차하는 것인 바, 대기열 2의 선두 배치 위치인 B2에 배치될 수 있다. 로봇(R3)이 B2에 배치됨에 따라 대기열 2의 나머지 로봇들(R1, RA, RB)는 그 뒷 순서의 배치 위치들에서 순차적으로 배치되도록 이동될 수 있다. 도 24에서 도시된 바와 같이 로봇들이 배치됨 에 따라, 배치된 로봇들은 모두 전술한 제약 조건을 만족할 수 있게 된다(2410 내지 2430 참조). 도 25에서는, 엘리베이터 카에는 로봇들(R2, R1, RC, RB, RA)이 탑승되어 있고, 또한, 대기열 2 및 대기열 3도 모두 다른 로봇들에 의해 점유되어 있으며, 엘리베이터 카에 대해, 로봇(R2)는 하차 예정이고, 로봇 (R3)은 탑승 예정인 것으로 가정되었다(2510 내지 2530 참조). 로봇(R2)이 하차하게 되면 대기열 1의 선두 배치위치인 B2은 비게 되지만, 로봇(R3)은 로봇(R1)보다 늦게 하차하는 것인 바, 전술한 제약 조건을 만족하지 못하 므로, B2에는 배치될 수 없다. 이 경우, 도 26에서처럼, 로봇 제어 시스템은 대기열 1의 배치 위치인 A1을 삭제하고(즉, 대기열 1의 길이 를 1만큼 줄이고), 새로운 대기열 4를 생성할 수 있다. 대기열 4는 대기열 1의 줄어든 길이인 1의 길이를 가질 수 있다. 로봇(R3)은 새로운 대기열인 대기열 4의 선두 배치 위치인 A1에 배치될 수 있다. 한편, 대기열 1에 배 치되어 있던 로봇들(RC, RB, RA, R1)은 선두 배치 위치인 B2부터 순차적으로 길이가 조절된 대기열 1에 배치될 수 있다. 도 26에서 도시된 바와 같이 로봇들이 배치됨에 따라, 배치된 로봇들은 모두 전술한 제약 조건을 만족 할 수 있게 된다(2610 내지 2630 참조). 설명한 바와 같이, 대기열들(대기열 1 내지 4)을 로봇들의 스케줄 정보(또는 목적지)에 따라 동적으로 조 정함으로써, 실시예에서는, 로봇들의 불필요한 이동을 최대한 배제하면서 로봇들의 엘리베이터 카 에 대한 승하차를 효율적으로 제어할 수 있다. 이상 도 1 내지 도 8 및 도 12 내지 도 22를 참조하여 전술된 기술적 특징에 대한 설명은, 도 9, 도 10 및 도 23 내지 도 26에 대해서도 그대로 적용될 수 있으므로 중복되는 설명은 생략한다. 도 11은 일 예에 따른, 복수의 엘리베이터 카들과 연관된 통합 가상 대기열을 결정하는 방법을 나타내는 흐름도 이다. 관련하여, 도 29는 일 예에 따른, 통합 가상 대기열을 나타낸다. 전술한 것처럼, 건물 또는 공간 내에서는 복수의 엘리베이터 카들(EV1, EV2 ...)이 운용될 수 있다. 로봇 제어 시스템은, 엘리베이터 카에 대해 가상 대기열을 결정함에 있어서, 단계에서처럼, 복수의 엘리베이터 카들(EV1, EV2 ...)과 연관된 통합 가상 대기열을 먼저 결정할 수 있다. 예컨대, 복수의 엘 리베이터 카들(EV1, EV2 ...)은 건물 또는 공간 내에서 운용되는 전체 엘리베이터 카들 중 일부로서, 상행으로 운용되고 있는 엘리베이터 그룹일 수 있다. 또는, 도시된 것과는 달리 복수의 엘리베이터 카들(EV1, EV2 ...)은 상행으로 운용되고 있는 엘리베이터 그룹일 수도 있다. 로봇 제어 시스템은 이러한 동일한 방향으로 운용 되고 있거나 이동하고 있는 엘리베이터 카들(EV1, EV2 ...)을 식별하여, 이들에 대해 통합 가상 대기열을 결정 할 수 있다. 동일한 방향으로 운용되고 있거나 이동하고 있는 엘리베이터 카들(EV1, EV2 ...)은 엘리베이터 제 어 시스템으로부터의 정보에 의해 식별될 수 있다. 단계에서, 로봇 제어 시스템은, 통합 가상 대기열의 일부에 해당하는 가상 대기열을 특정한 엘리베 이터 카에 대한 가상 대기열로 결정할 수 있다. 예컨대, 도시된 가상 대기열(2910-1)은 통합 가상 대기 열의 일부이면서 엘리베이터 카(EV1)에 대해 결정된 가상 대기열이 될 수 있고, 도시된 가상 대기열(2910-2)은 통합 가상 대기열의 일부이면서 엘리베이터 카(EV2)에 대해 결정된 가상 대기열이 될 수 있다. 말하자면, 실시예에서는, 전술된 한 대의 엘리베이터 카에 대해 내에 적용되었던 가상 대기열을 복수 의 엘리베이터 카들(EV1, EV2 ...)(상행 그룹 또는 하행 그룹의 엘리베이터 카들)에 대해 확장할 수 있다. 로봇 은 복수의 엘리베이터 카들(EV1, EV2 ...)에 걸친 통합 가상 대기열의 일부인 가상 대기열들(2910-1, 2910-2 ...) 중에서 적절한 것으로 결정된 가상 대기열에 배치되도록 제어될 수 있다. 가상 대기열들(2910-1, 2910-2 ...)에 대해서도 도 1 내지 도 28 및 도 30과 관련하여 설명되는 내용이 유사하 게 적용될 수 있는 바, 중복되는 설명은 생략한다. 이상 도 1 내지 도 10 및 도 12 내지 도 26을 참조하여 전술된 기술적 특징에 대한 설명은, 도 11 및 도 29에 대해서도 그대로 적용될 수 있으므로 중복되는 설명은 생략한다. 도 27은 일 예에 따른, 사람이 탑승하는 영역과 로봇이 탑승하는 영역이 정의된 엘리베이터 카의 내부 영역을 나타낸다. 전술한 엘리베이터 카는 로봇과 사람이 함께 탑승 가능한 것일 수 있다. 이 때, 엘리베이터 카의 내부 영역은 사람이 탑승하기 위한 사람 탑승 영역을 포함할 수 있다. 도시된 것처럼, 사람 탑승 영역 과 로봇 탑승 영역은 서로 구분되어 있을 수 있다. 로봇 탑승 영역은 사람의 탑승을 방해하지 않도록, 엘리베이터 카의 내부 영역의 일 측에 위치될 수 있다. 로봇 제어 시스템은 엘리베이터 카의 내부 영역 중 사람 탑승 영역을 제외한 영역에 대해 가상 대기열을 결정할 수 있다. 엘리베이터 카의 내부 영역에서 사람 탑승 영역과 가상 대기열에 해당하는 영역(로봇 탑승 영역 )은 시각적인 가이드에 의해 구분될 수 있다. 한편, 도시된 것처럼, 엘리베이터 카의 로봇 탑승 위치 (즉, 승하차 위치) 또한 시각적인 가이드에 의해 더 구분될 수 있다. 이러한 가이드는 엘리베이터 카(2 0)의 내부 영역의 바닥에 표시될 수 있다. 한편, 엘리베이터 카의 대기 공간(즉, 전실)에도 유사하게 시각 적인 가이드가 더 표시될 수도 있다. 이에 따라, 엘리베이터 카에 탑승한 사람은 로봇의 탑승 및 하차를 방해하지 않게 될 수 있다. 한편, 전술한 가상 대기열(들)을 동적으로 조정함에 있어서, 로봇 제어 시스템은 엘리베이터 카의 상황 정보를 더 고려할 수 있다. 예컨대, 로봇 제어 시스템은 로봇들로부터의 센싱 데이터 또는 엘리 베이터 제어 시스템으로부터 획득된 엘리베이터 카에 대한 점유 상태 정보(예컨대, 무게 센서, 카메라 등의 센싱 값에 기반한 만원율 등에 관한 정보)를 고려하여, 새로운 가상 대기열의 생성이 가능한지 또는 가상 대기열의 길이를 늘릴 수 있는지 여부를 판정할 수 있다. 예컨대, 로봇 제어 시스템은 로봇들로부터의 공간 센싱 정보를 수신할 수 있고, 로봇 제어 시스템 은 수신된 공간 센싱 정보를 융합하여 분석함으로써 엘리베이터 카 내의 공간 점유 상태를 파악할 수 있다. 로봇 제어 시스템은 공간 점유 상태에 기반하여 가상 대기열을 동적으로 조정할 수 있다. 일례로, 로봇 제어 시스템은 엘리베이터 카 내에 사람이 존재하는지 여부를 판정하여, 사람 탑승 영역 에 해당하는 영역이나 로봇 탑승 영역 주변의 영역에서 새로운 가상 대기열의 생성이 가능한지 또 는 가상 대기열의 길이를 늘릴 수 있는지 여부를 판정할 수 있고, 판정 결과에 따라, 새로운 가상 대기열을 생 성하거나 기존의 가상 대기열의 길이를 늘릴 수 있다. 이상 도 1 내지 도 26 및 도 29를 참조하여 전술된 기술적 특징에 대한 설명은, 도 27에 대해서도 그대로 적용 될 수 있으므로 중복되는 설명은 생략한다. 도 28은 일 예에 따른, 엘리베이터 카에 사람 및 로봇이 탑승함에 따라, 엘리베이터 카 내의 로봇들 간의 간격 을 조정하는 방법을 나타낸다. 전술한 것처럼, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열은, 엘리베이터 카에 탑승 한 로봇들이 배치될 복수의 배치 위치들을 포함할 수 있다. 이 때, 가상 대기열에 기 배치된 로봇들은 가상 대기열에 해당하는 엘리베이터 카의 내부 영역을 선점하도록 소정의 제1 간격으로 배치될 수 있다. 말하자면, 제1 로봇인 탑승 예정 로봇이 탑승하기 에 앞서, 탑승 예정 로봇이 배치될 공간을 가상 대기열에 기 배치된 로봇들이 확보해 둘 수 있다. 따 라서, 엘리베이터 카에 탑승한 사람에 의해 탑승 예정 로봇이 배치될 공간이 점유되는 것이 방지될 수 있다. 엘리베이터 카에 제1 로봇(탑승 예정 로봇)이 탑승하여, 제1 로봇이 가상 대기열의 선두 배치 위치에 배치되면, 가상 대기열에 배치되는 로봇들은 제1 간격보다 더 작은 제2 간격으로 배치 위 치들에서 각각 배치될 수 있다. 말하자면, 제2 간격은 가상 대기열의 배치 위치들 간의 간격에 해당할 수 있고, 제1 간격은 이러한 배치 위치들 간의 간격보다 더 큰 간격에 해당할 수 있다. 실시예에서는, 탑승 예정 로봇이 탑승한 후에 다시 로봇들 간의 간격을 좁혀 엘리베이터 카의 내부 영역에 공간 활용성을 높일 수 있다. 한편, 탑승 예정 로봇이 탑승할 영역이나 다른 로봇이 배치되어야 할 영역이 사람에 의해 점유된 경우, 탑승 예정 로봇 또는 엘리베이터 카에 탑승한 로봇은 해당 사람을 향해 사람이 점유하고 있는 위치가 로봇 탑승 영역에 해당함을 나타내는 시각적 및/또는 청각적 인디케이터를 출력할 수 있다. 이상 도 1 내지 도 27 및 도 29를 참조하여 전술된 기술적 특징에 대한 설명은, 도 28에 대해서도 그대로 적용 될 수 있으므로 중복되는 설명은 생략한다. 도 30은 일 예에 따른, 센싱 데이터를 이용하여 로봇에 대한 측위를 개선하고, 로봇들 간의 상대 위치를 조정하 는 방법을 나타낸다. 전술한 것처럼, 엘리베이터 카의 내부 영역에 대해 결정되는 가상 대기열은, 엘리베이터 카에 탑승 한 로봇들(100, 3000)이 배치될 복수의 배치 위치들을 포함할 수 있다. 배치 위치들에서 각각 배치되는 로봇들(100, 3000)의 위치는, i) 로봇들로부터의 센싱 데이터에 기반하여 조정 되거나, ii) 로봇들의 각각 또는 상기 내부 영역에 배치된 식별 정보를 상기 로봇들이 인식함에 따라 조정될 수 있다. i)과 관련하여, 로봇 제어 시스템은 각 로봇으로부터 그 위치와 센싱 데이터를 실시간으로 수집할 수 있고, 이에 기반하여 로봇들 간의 위치를 조정할 수 있다. 예컨대, 로봇 제어 시스템은 수집된 센싱 데이터를 융합 및 분석하여 로봇들 간의 위치를 조정할 수 있다. 즉, 각 로봇은 선행 로봇에 대 한 센싱 데이터로서 장애물 정보를 획득할 수 있고, 로봇 제어 시스템은 여러 로봇들로부터의 센싱 데이터로부터 로봇들 간의 상호 관계를 파악할 수 있고, 기대값(각 로봇의 가상 대기열에서의 배치의 기대 정보)과 실측값(각 로봇의 센싱 데이터에 따라 결정되는 실제 위치)의 차이를 통해 각 로봇 의 위치를 더욱 정밀하게 예측하고 제어할 수 있다. 또한, 로봇 제어 시스템은 각 로봇으로부터 획득되는 각 로봇의 벽으로부터의 거리 정보와 주변 로봇으로부터의 센싱 데이터에 기반하여, 각 로봇의 상대적 위치를 파악하고 각 로봇의 정확한 측위를 가능하게 할 수 있다. 로봇 제어 시스템은 각 로봇의 상대적 위치를 조정하기 위한 미세 제어 (fine control) 명령을 각 로봇에 대해 송신할 수 있다. 로봇 제어 시스템은 로봇들의 기대 배 치에 맞게 로봇들이 배치되도록 로봇들을 제어할 수 있다. ii)과 관련하여, 각 로봇은 각 배치 위치에서 배치되어 있는 식별 정보(예컨대, 가이드)를 인식하거 나, 다른 로봇에 배치되어 있는 식별 정보(예컨대, 에이프릴 태그(April Tag), QR 코드 등의 코드 또는 태 그를 포함하는 로봇 비전용 태그)를 인식함으로써, 위치가 조정될 수 있다. 이러한 식별 정보는 로봇들이 가상 대기열에 더 잘 배치될 수 있도록 하기 위한 추가 측위 수단일 수 있다. 이러한 위치 조정은 로봇이 스스로 수행할 수 있다. 또는, 각 로봇은 카메라를 이용하여 선행 또는 후행하는 로봇에 배치된 식별 정보나 엘리베이터 카 내에 배치된 식별 정보를 촬상할 수 있고, 이를 로봇 제어 시스템으로 전송할 수 있다. 로봇 제어 시 스템은 로봇들이 어떻게 배치되어야 할지를 알고 있으므로(즉, 기대 정보를 알고 있으므로), 각 로봇 의 촬상 결과에 따른 실제 위치를 기대 정보에 일치되도록 각 로봇을 제어할 수 있다. 이상 도 1 내지 도 29를 참조하여 전술된 기술적 특징에 대한 설명은, 도 30에 대해서도 그대로 적용될 수 있으 므로 중복되는 설명은 생략한다. 한편, 전술한 실시예들에서, 엘리베이터 카에 탑승하는 제1 로봇은 반드시 엘리베이터 카 외부의 대기 공간에서 대기하고 있는 로봇이 아니라, 일정 시간 이내에 엘리베이터 카에 탑승이 예정되는 또는 일 정 시간 이내에 대기 공간에 도착할 로봇일 수 있다. 즉, 로봇 제어 시스템은 제1 로봇의 예상 도착 시간 및 엘리베이터 카의 예상 도착 시간을 예측할 수 있으므로, 이러한 예측에 기반하여 제1 로봇의 제어 계획을 수립할 수 있다. 엘리베이터 카는 제1 로봇이 엘리베이터 카에 탑승하면, 즉, 승하차 위치에 도달하면, 출발 (승강을 시작)할 수 있다. 말하자면, 제1 로봇의 소정의 배치 위치에의 배치는 엘리베이터 카가 이동 하는 동안 이루어질 수 있다. 엘리베이터 카 내에 승하차 위치 외에는 빈 공간이 없는 경우 제1 로봇은 승하차 위치에 배치될 수도 있다. 이 경우, 제1 로봇은 다른 로봇의 하차 시 하차해야 할 수도 있다. 한편, 제1 로 봇은 엘리베이터 카 내에 탑승한 모든 로봇들보다 늦게 하차하지 않는 경우에만 승하차 위치 에 배치될 수 도 있다. 이상에서 설명된 시스템 또는 장치는 하드웨어 구성요소, 소프트웨어 구성요소 또는 하드웨어 구성요소 및 소프 트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크 로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명 령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목 적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이 상의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있 다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto- optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드 뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2023-0032505", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24 도면25 도면26 도면27 도면28 도면29 도면30"}
{"patent_id": "10-2023-0032505", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열을 결정하고, 가상 대 기열을 이용하여 엘리베이터 카에 대한 로봇의 승차 및 하차를 제어하는 방법을 나타낸다. 도 2 는 일 실시예에 따른, 공간 내에서 서비스를 제공하는 로봇을 나타내는 블록도이다. 도 3 및 도 4는 일 실시예에 따른, 로봇을 제어하는 로봇 제어 시스템을 나타내는 블록도이다. 도 5는 일 실시예에 따른, 공간 내에서 운용되는 엘리베이터 카의 승강을 제어하는 엘리베이터 제어 시스템을 나타내는 블록도이다. 도 6은 일 실시예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열을 결정하고, 가상 대 기열을 이용하여 엘리베이터 카에 대한 로봇의 승차 및 하차를 제어하는 방법을 나타내는 흐름도이다. 도 7은 일 예에 따른, 가상 대기열에 포함된 배치 위치에 엘리베이터 카에 탑승한 로봇을 배치하는 방법을 나타 내는 흐름도이다. 도 8은 일 예에 따른, 가상 대기열들 중 최적 가상 대기열을 결정하고, 최적 가상 대기열에 포함된 배치 위치에 엘리베이터 카에 탑승한 로봇을 배치하는 방법을 나타내는 흐름도이다. 도 9는 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열의 길이를 결정하는 방법을 나타내는 흐름도이다. 도 10은 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 결정된 가상 대기열을 동적으로 조정하는 방법을 나 타내는 흐름도이다. 도 11은 일 예에 따른, 복수의 엘리베이터 카들과 연관된 통합 가상 대기열을 결정하는 방법을 나타내는 흐름도 이다. 도 12는 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 로봇이 배치될 가상 대기열을 나타낸다. 도 13 내지 도 22는 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 결정된 복수의 가상 대기열들을 이용하여, 멀티 로봇의 엘리베이터 카에 대한 승차 및 하차를 제어하는 방법을 나타낸다. 도 23 내지 도 26은 일 예에 따른, 엘리베이터 카의 내부 영역에 대해 결정된 복수의 가상 대기열들을 동적으로 조정하는 방법을 나타낸다. 도 27은 일 예에 따른, 사람이 탑승하는 영역과 로봇이 탑승하는 영역이 정의된 엘리베이터 카의 내부 영역을 나타낸다. 도 28은 일 예에 따른, 엘리베이터 카에 사람 및 로봇이 탑승함에 따라, 엘리베이터 카 내의 로봇들 간의 간격 을 조정하는 방법을 나타낸다. 도 29는 일 예에 따른, 통합 가상 대기열을 나타낸다. 도 30은 일 예에 따른, 센싱 데이터를 이용하여 로봇에 대한 측위를 개선하고, 로봇들 간의 상대 위치를 조정하 는 방법을 나타낸다."}
