{"patent_id": "10-2023-0146422", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0067003", "출원번호": "10-2023-0146422", "발명의 명칭": "다종 암 조기 진단을 위한 다중 바이오마커 및 이의 용도", "출원인": "주식회사 누리바이오", "발명자": "남영현"}}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대상에서 분리된 생물학적 시료에서 다중 바이오마커를 검출하는 단계; 및상기 단계에서 측정된 다중 바이오마커의 검출 정보를 비교하여 분류하는 단계; 및상기 단계에서 분류된 다중 바이오마커의 검출 정보에 의하여 다종 암의 종을 판정하는 단계;를 포함하는, 다종암의 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법으로,상기 다중 바이오마커를 검출하는 단계는 바이오마커의 존재 여부 확인, 바이오 마커의 수준 측정, 또는 이들모두를 수행하는 단계이며,상기 비교 및 분류는 [표 1]의 정상인의 다중 바이오마커의 검출 정보를 기준으로 시료로부터 검출된 다중 바이오마커의 검출 정보를 비교하여 검출 정보가 2배 이상 증가, 2배 미만 증가, 1/2배 미만 감소, 및 1/2배 이상감소의 4개 그룹으로 구분하는 것이며,상기 정상인의 다중 바이오마커의 검출 정보는 하기 표 1에 기재된 정보이며,상기 다종 암의 종 판정은 (1) 하기 [표 13]의 기준에 따라 다중 바이오마커의 최소 20종 이상이 동일한 검출정보를 가지고, 각 암에 특이적인 바이오마커의 최소 6종 이상이 동일한 검출 정보를 가지는 경우는 그 해당 암의 종으로 판정하거나, (2) 하기 [표 13]의 기준에 따라 다중 바이오마커의 최소 20종 이상이 동일한 검출 정보를 가지되 miR-139-3p, miR-29c-3p, miR-148a-3p, miR-30a-5p, miR-210-5p, miR-150-3p, miR-181b-5p, miR-34a-3p, miR-29a-3p, miR-145-5p, miR-26b-ep, miR-221-3p, 및 miR-431으로 이루어진 군의 바이오마커 중 5개이상에서 검출 정보(예로, 발현 수준)의 증가가 2배 이상인 경우는 다종 암 중 췌장암으로 판정하는 것임을 특징으로 하는 다종 암의 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법.[표 1]공개특허 10-2024-0067003-3-[표 13]상기 표 13에서, ++++는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준의 증가가2배 이상인 경우이며, +++는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준의 증가가 2배 미만인 경우이며, ++는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준의 감소가 1/2배 미만인 경우이며, +는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현수준의 감소가 1/2배 이상인 경우이다."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 다중 바이오마커는 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-15b-5p, miR-26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p,miR-221-3p, miR-26a-5p, miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-18a-5p, miR-181b-5p, miR-223-3p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, miR-431, 및 miR-103-3p인 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 폐암에 특이적인 다중 바이오마커는 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p,miR-146b-5p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-181b-5p, miR-223-3p, miR-26b-3p, miR-6761, 및 miR-339-3P인 것을 특징으로 하는 방법.공개특허 10-2024-0067003-4-청구항 4 제1항에 있어서, 상기 대장암에 특이적인 다중 바이오마커는 miR-1-3p, miR-15b-5p, miR-26b-5p, miR-25-3p,miR-34b-5p, miR-92a-3p, miR-18a-5p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, 및 miR-431인 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 췌장암에 특이적인 다중 바이오마커는 miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-181b-5p, miR-223-3p, miR-483-3p,miR-505-5p, miR-636-5p, miR-6761, 및 miR-339-3P인 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 다중 바이오마커의 검출은 프로머(promer)에 의하여 이루어지는 것을 특징으로 하는방법."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "대상에서 분리된 생물학적 시료에서 다중 바이오마커를 검출하는 단계; 및상기 단계에서 측정된 다중 바이오마커의 검출 정보를 학습된 인공지능 모델에 입력하여 분석하는 단계;를 포함하는, 다종 암의 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법으로,상기 다중 바이오마커를 검출하는 단계는 바이오마커의 존재 여부 확인, 바이오 마커의 수준 측정, 또는 이들모두를 수행하는 단계이며,상기 학습된 인공지능 모델은 시료에서 측정된 다중 바이오마커의 검출 정보를 상기 인공지능 모델에 입력하여출력값으로서 상기 다중 암의 종 판정을 출력하는 모델로서, 기 검출된 정상인 및 환자군의 다중 바이오마커의검출 정보를 훈련 데이터세트학습(Training Dataset), 검증 데이터세트(Validation Dataset), 및 시험 데이터세트(Test Dataset)으로 분류하고 DNN(Deep Neural Network, DNN) 알고리즘을 모델링하고, 모델링된 DNN 알고리즘에 대한 테스트를 진행하여 도출된 모델이며,상기 모델링된 DNN 알고리즘은 하이퍼 파라미터(Hyper-Parameter)를 적용하여 다양한 파라미터들을 학습하고 시도하여 최적화된 파라미터를 찾아내고, 기울기 소실, 학습 수렴 속도 및 오버피팅을 보완하기 위한 활성화 함수로, ReLU(Rectified Linear Unit) 또는 TanH(Hyperbolic Tangent)를 이용하는 것임을 특징으로 하는, 다종 암의 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 다중 바이오마커의 검출 정보는 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-15b-5p, miR-26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a-5p, miR-34a-3p,miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-18a-5p, miR-181b-5p, miR-223-3p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, miR-431, 및 miR-103-3p의 발현 수준인 것을 특징으로 하는, 다종 암의 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법."}
{"patent_id": "10-2023-0146422", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 다중 바이오마커의 검출은 프로머(promer)에 의하여 이루어지는 것을 특징으로 하는방법."}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다종 암 진단을 위한 다중 바이오마커 및 이의 용도에 관한 것이다. 구체적으로, 본 발명은 폐암, 췌 장암, 및 대장암 등의 다종 암 진단 또는 예후를 위한 다중 바이오마커, 상기 다중 바이오마커를 포함하는 다종 암 진단 또는 예후용 조성물 또는 키트, 상기 다중 바이오마커 또는 조성물을 이용하여 다종 암 진단 또는 예후 에 필요한 정보를 제공하는 방법에 관한 것이다. 본 발명에 의하여 다종 암을 비침습적 방법으로 높은 특이도, 민감도 및 정확도에 의하여 단일의 분석으로 다종 암의 진단 및 예후에 관한 정보를 제공할 수 있다."}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 폐암, 췌장암, 및 대장암의 다종 암의 조기 진단 또는 예후 예측을 위한 다중 바이오마커 및 이의 용 도에 관한 것이다. 보다 구체적으로, 본 발명은 폐암, 췌장암, 및 대장암의 다종 암 조기 진단 또는 예후 예측 을 위한 다중 바이오마커, 상기 다중 바이오마커를 포함하는 다종 암 진단 또는 예후 예측용 조성물 또는 키트,상기 다중 바이오마커 또는 조성물을 이용하여 다종 암 조기 진단 또는 예후 예측에 필요한 정보를 제공하는 방 법에 관한 것이다."}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "암은 비정상적인 세포 성장으로 인하여 유발되는 질병으로 양성 종양(benign tumor)과 악성 종양(malignant tumor)으로 구분된다. 양성 종양은 비교적 성장 속도가 느리며 전이되지 않는 반면, 악성 종양은 양성 종양에 비해 성장 속도가 빠르며 신체의 다른 장기로 전이될 수 있다. 흔히 암이라고 부르는 질병은 악성 종양을 말한 다. 폐암은 국내 암 사망률 1위로, 대한민국의 암 사망자 5명 중 1명(22.8%)을 차지하고 있다. 최근 통계청 자료에 따르면 10년 전보다 위암, 간암 등의 사망률은 감소하고 있는 반면, 폐암 사망률은 약 20% 증가하고 있는 추세 에 있는 것으로 확인되었다. 현대 의학이 눈부시게 발전하고 있음에도 불구하고 폐암의 발생 및 사망률은 지속 적으로 증가하고 있으며, 폐암의 경우 초기 자각 증상이 거의 없어 대부분 말기에 발견되는 경우가 많기 때문에 질병의 진단 이후 다양한 치료법을 적용하기 어렵다는 문제가 있다. 따라서 증상이 발생하기 전에, 검진을 통해 치료가 가능한 시기에 폐암을 조기에 발견한다면 생존율 향상 및 사망률 감소를 기대할 수 있다. 현재 폐암을 진단할 수 있는 선별 검사로 주로 사용되는 방법은 X-ray, CT, MRI 등의 방법이 있다. 하지만, 이 러한 방법 모두 조기 진단이 어렵고, 검사 방법이 번거로우며, 정기 검사 시 방사선에 노출될 수 있다는 단점을 가진다. 또한, 상기 검사도 이미 암이 상당히 진행된 후 이루어지는 경우가 대부분이기 때문에 치료 후 예후가 좋지 않은 편이다. 따라서 이를 해결하기 위하여 간편하면서도 진단율이 높은 새로운 폐암 조기 진단 방법의 개 발이 절실한 상황이다. 췌장암은 2015년 국가암등록통계에 의하면 대한민국의 암 발생 8위를 차지하는 중요한 질환이고 현재 그 발생율 이 지속적으로 늘어나고 있다. 아직까지 췌장암에 효과적인 항암제가 개발되어 있지 않아 현재 췌장암의 유일한 근치적 치료 방법은 수술이다. 하지만 췌장암은 특징적인 증상이 없고 조기진단 방법이 없어 실제로 수술이 가 능한 환자는 20% 내외이고, 나머지 80% 이상의 환자가 치료가 불가능한 말기 암 상태에서 진단되고 있다. 또한 초기 췌장암에 해당하는 1기 및 2기에는 수술적 절제가 가장 좋은 치료법이지만, 수술적 절제를 받은 췌장암 환 자의 생존률은 10-20% 정도로 나타난다. 췌장암은 가장 예후가 좋지 않은 암으로, 췌장이 후복막 장기이기 때문 에 조기발견이 어렵고, 2cm 이하의 작은 암이더라도 췌장암 세포의 운동성이 매우 높기 때문에 주위의 혈관, 소 화관, 신경 등에 곧바로 침윤되며, 근처의 림프절이나 간장 등에 전이된다. 따라서, 췌장암의 정기적 진단, 조 기진단 및 질병 정도를 예측하는 것은 매우 중요하다. 췌장암 진단은 종양 표지자를 이용한 검사(CA19-9), 영상학적 검사(복부 초음파, 복부 CT, 자기공명영상 MRI, 내시경 초음파, 내시경역행성담췌관조영술, PET, 진단적 복강경), 조직검사 등으로 이루어진다. 그러나, 상기 진단 방법은 정확도가 떨어지거나, 환자에게 고통이 따르는 등 그 수행 방법이 매우 불편하다. 따라서, 간편하 고 신속하게 췌장암을 진단할 수 있는 검사 방법의 개발이 요구되며, 환자에게 비침습적이고 신속하며 민감도/ 특이도 향상을 위한 새로운 혈액검사기반 진단 마커가 필요하다. 이에 따라 췌장암의 예후를 증대시킬 수 있는 바이오마커가 활발히 연구되고 있다. 대장암은 병리학적으로는 대부분이 선암(adenocarcinoma)이며, 부위별로는 크게 결장암과 직장암으로 구분된다. 부위별 발생 빈도는 하부 대장, 즉 직장에서 발생하는 경우가 약 50%로 가장 많다. 최근의 연구들에 의하면, 식 이습관의 변화로 대장암의 발생률과 그에 따른 사망률이 현저하게 증가하고 있다고 한다. 대장암의 치료는 외과적 절제술을 근간으로 항암화학요법 및 방사선요법이 병행된다. 수술적 요법, 항암화학요 법 및 방사선요법 등의 진보에도 불구하고 일단 발병하고 나면 예후의 극적인 진전은 이루어지고 있지 않은 실 정이다. 5년 평균생존율은 1기의 경우 90% 이상, 2기의 경우 70% 이상, 3기의 경우 50% 이상 및 4기의 5% 이하 이다. 이와 같이 대장암을 조기에 발견 및 치료할수록 생존율이 현저히 증가하는 것을 알 수 있다. 따라서, 대장암의 조기 진단 방법이 절실히 필요한 실정이다. 대장암의 진단은 대장과 관련된 증세를 보이는 환자에게 직장 수지 검사(rectal digital examination), 분변 잠혈검사(stool occult blood examination) 및 대장조영술에 의해 수 행되고 있으며, 필요에 따라 S상 결장경 검사 및 결장경검사를 통한 조직검사가 행해진다. 하지만, 상기와 같은 종래의 방법들은 진단의 정확도가 낮을 뿐만 아니라, 대장암이 발병하기 이전의 환자들에 대한 조기 진단은 불 가능하며, 피검체들에게 불편을 주는 문제점이 있다.바이오마커는 정상적인 생물학적 과정, 발병 과정 혹은 치료에 대한 약리학적 반응의 객관적 지표로 사용하기 위하여 측정하는 물질로서, 특정 질병의 원인 또는 진행 경과와 밀접한 관련을 가진다. 바이오마커를 이용하여 질병을 진단하는 방법은 혈액 등 환자의 시료를 분석하는 것만으로 질병을 조기에 발견할 수 있다는 장점을 가 진다. 따라서, 기존의 진단 방법으로 조기 발견이 어려운 폐암, 췌장암, 대장암 등의 다양한 암의 진단을 위한 바이오마커의 개발은 필연적이며, 개발된 바이오마커는 암 진단과 표적 치료에 중요한 역할을 할 수 있을 것으 로 기대된다. 현재 몇 가지 폐암, 췌장암, 대장암 등의 암 진단 단일 바이오마커가 임상에서 이용되고 있지만, 특이도와 민감 도가 낮아 진단율이 좋지 않은 문제점을 가지고 있다. 바이오마커는 개인의 유전적 요인과 생활 환경에 따라 그 수치가 지속적으로 변하고, 특히 암의 발생 및 암 미세환경의 다양한 요소들과 밀접하게 연관되어 있기 때문에 단일 바이오마커만으로 정확한 진단을 내리는 것은 사실상 불가능하다. 따라서 높은 정확도와 민감도로 폐암을 진단하기 위하여 특이도와 민감도를 향상시킬 수 있는 새로운 다중 바이오마커의 개발이 요구되고 있는 실정이 다. 마이크로 RNA(miRNA)는 19-23nt의 크기를 갖는 비암호화된(non-coding) RNA의 일종으로, 핵과 세포질 내에서 일 련의 효소들에 의해 합성되는 것으로 알려져 있다[비특허문헌 3]. 사람의 경우 약 1400개의 miRNA들이 알려져 있으며, 이들은 mRNA 기능의 60% 이상을 조절할 것으로 예상하고 있다[비특허문헌 4]. 특히, 이들은 mRNA의 5' 또는 3' UTR(untranslated region)과 상호작용하여, 분해나 번역억제(translational repression)를 일으키는 것으로 알려져 있으며, 일부 miRNA들은 암을 포함한 특정 질병들과 밀접한 관련이 있는 것으로 보고되고 있다 [비특허문헌 5]. 이에 본 발명자들은 폐암, 췌장암, 및 대장암의 다종 암을 동시에 조기 진단하기 위한 다중 바이오마커를 개발 하고자 예의 노력하였으며, 그 결과 본 발명을 완성하게 되었다. 선행기술문헌 비특허문헌 (비특허문헌 0001) [1] Simone Donati et al, Human Circulating miRNAs Real-time qRT-PCR -based Analysis: An Overview of Endogenous Reference Genes Used for Data Normalization(Int. J. Mol. Sci. 2019, 20, 4353; doi:10.3390 /ijms 20184353 (비특허문헌 0002) [2] Soheil Madadi et al MicroRNA expression studies: challenge of selecting reliable reference controls for data normalization (Cellular and Molecular Life Sciences volume 76, pages 3497-3514 (비특허문헌 0003) [3] M. Sand, The pathway of miRNA maturation, Methods in molecular biology, 1095 3-10 (비특허문헌 0004) [4] F. Akbari Moqadam, R. Pieters, M.L. den Boer, The hunting of targets: challenge in miRNA research, Leukemia, 27 16-23 (비특허문헌 0005) [5] J.K. Palanichamy, D.S. Rao, miRNA dysregulation in cancer: towards a mechanistic understanding, Frontiers in genetics, 5 54"}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 하나의 목적은 폐암, 췌장암, 및 대장암의 다종 암 조기 진단 또는 예후 예측을 위한 다중 바이오마 커를 제공하는 것이다. 본 발명의 다른 하나의 목적은 상기 다중 바이오마커를 포함하는 다종 암 조기 진단 또는 예후 예측용 조성물 또는 키트를 제공하는 것이다. 본 발명의 또 다른 하나의 목적은 상기 다중 바이오마커 또는 이를 포함하는 조성물을 이용하여 다종 암 조기 진단 또는 예후 예측에 필요한 정보를 제공하는 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "하나의 양태로서, 본 발명은 다종 암 조기 진단 또는 예후 예측을 위한 다중 바이오마커를 제공하는 것이다. 본 명세서에서, 용어 ‘진단’은 병리 상태의 존재 또는 특징을 확인하는 것으로서, 특정 질병 또는 질환 (예를 들면, 폐암, 췌장암, 대장암)에 대한 치료 효과를 확인하는 것, 특정 질병 또는 질환에 대한 대상체의 감수성 (susceptibility)을 판정하는 것, 대상체가 특정 질병 또는 질환을 현재 가지고 있는지 여부를 판정하는 것, 또 는 테라메트릭스(therametrics) (예를 들면, 치료 효능에 대한 정보를 제공하기 위하여 대상체 (개체)의 상태를 모니터링 하는 것) 등을 의미할 수 있다. 본 명세서에서, 용어 '예후'란 폐암, 췌장암, 대장암 등의 암의 재발, 전이성 확산이나 약물 내성을 비롯한 암- 기인성 사망, 및/또는 진행의 가능성 등의 병의 경과 및 완치 여부를 의미할 수 있다. 본 명세서에서, 다종 암의 조기 진단 또는 예후 예측은 대상 (대상체, 개체, subject)에서의 다종 암(바람직하 게는, 폐암, 췌장암, 대장암)의 발병 여부, 발병 가능성 (위험성), 다종 암(바람직하게는, 폐암, 췌장암, 대장 암) 조직 성장 가능성 (또는 조직 성장능, 암 세포 수 증가, 암 조직 크기 증가), 및/또는 다종 암(바람직하게 는, 폐암, 췌장암, 대장암)의 전이 가능성 (또는 전이능)을 확인하는 것을 의미할 수 있다. 본 발명의 다종 암은 하나 또는 2종 이상의 암을 의미하는 것으로, 상기 암은 바람직하게 폐암, 대장암, 및 췌 장암을 말한다. 본 발명의 다중 바이오마커는 2 이상으로 구성된 바이오마커를 의미하는 것으로, 상기 바이오마커는 혈액, 특히 혈장에서 존재하는 miRNA를 의미한다. 하나의 예로서, 상기 바이오마커는 암 종별에 따라 각각 상이하거나 또는 일부 동일할 수 있다. 본 발명의 상기 miRNA는 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-15b-5p, miR- 26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR- 155-3P, miR-16b-5p, miR-18a-5p, miR-181b-5p, miR-223-3p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636- 5p, miR-6761, miR-339-3P, miR-431, 및 miR-103-3p으로 이루어질 수 있다. 또한, 본 발명의 상기 miRNA는 각각 순차적으로 서열번호 1 내지 36으로 이루어질 수 있다. 하나의 예로, 상기 서열번호 1 내지 36의 miRNA의 검출은 각각 순차적으로 서열번호 39 내지 74로 이루어진 프 로머(promer)에 의하여 이루어질 수 있다. 하나의 구체적 예로서, 상기 바이오마커 중 폐암에 특이적인 바이오마커는 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR- 181b-5p, miR-223-3p, miR-26b-3p, miR-6761, 및 miR-339-3P의 miRNA일 수 있다. 또한, 본 발명의 상기 miRNA는 각각 순차적으로 서열번호 1 내지 4, 서열번호 11 내지 16, 서열번호 27 내지 29, 서열번호 33, 및 서열번호 34로 이루어질 수 있다. 하나의 예로, 상기 서열번호 1 내지 4, 서열번호 11 내지 16, 서열번호 27 내지 29, 서열번호 33, 및 서열번호 34로 이루어진 miRNA의 검출은 각각 순차적으로 서열번호 39 내지 42, 서열번호 49 내지 62, 서열번호 65 내지 67, 서열번호 71, 및 서열번호 72로 이루어진 프로머(promer)에 의하여 이루어질 수 있다. 또 하나의 구체적 예로서, 상기 바이오마커 중 췌장암에 특이적인 바이오마커는 miR-29a-3p, miR-29b-3p, miR- 29c-3p, miR-30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-181b-5p, miR-223- 3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, 및 miR-339-3P의 miRNA일 수 있다. 또한, 본 발명의 상기 miRNA는 각각 순차적으로 상기 서열번호 17 내지 25, 서열번호 27, 서열번호 28, 및 서열 번호 30 내지 34로 이루어질 수 있다. 하나의 예로, 상기 서열번호 17 내지 25, 서열번호 27, 서열번호 28, 및 서열번호 30 내지 35로 이루어진 miRNA 의 검출은 각각 순차적으로 55 내지 63, 서열번호 65, 서열번호 66, 서열번호 68 내지 72로 이루어진 프로머 (promer)에 의하여 이루어질 수 있다.또 하나의 구체적 예로서, 상기 바이오마커 중 대장암에 특이적인 바이오마커는 miR-1-3p, miR-15b-5p, miR- 26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-18a-5p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, 및 miR-431의 miRNA일 수 있다. 또한, 본 발명의 상기 miRNA는 각각 순차적으로 상기 서열번호 1, 서열번호 6 내지 10, 서열번호 26, 및 서열번 호 29 내지 35로 이루어질 수 있다. 하나의 예로, 상기 서열번호 1, 서열번호 6 내지 10, 서열번호 26, 및 서열번호 29 내지 35로 이루어진 miRNA의 검출은 각각 순차적으로 39, 서열번호 44 내지 48, 서열번호 64, 및 서열번호 67 내지 73으로 이루어진 프로머 (promer)에 의하여 이루어질 수 있다. 상기 바이오마커는 기준 유전자(reference gene)를 포함할 수 있으며, 상기 기준 유전자(reference gene)는 miR-34b-5p, miR-29c-3p, miR-103-3p, 및 U43일 수 있다. 일 예로, 상기 miR-34b-5p의 기준 유전자 검출은 서열번호 47로 이루어진 프로머(promer)에 의하여 이루어질 수 있으며, 상기 miR-29c-3p의 기준 유전자 검출은 서열번호 57로 이루어진 프로머(promer)에 의하여 이루어질 수 있다. 일 예로, 상기 miR-103-3p의 기준 유전자 검출은 서열번호 74로 이루어진 프로머(promer)에 의하여 이루어질 수 있으며, 상기 U43의 기준 유전자 검출은 서열번호 75로 이루어진 프로머(promer)에 의하여 이루어질 수 있다. 또한, 상기 바이오마커에 포함되는 기준 유전자(reference gene)는 GAPDH를 추가로 포함할 수 있다. 상기 GAPDH 는 폐암, 대장암, 및 췌장암을 동시에 판별하기 위한 기준 유전자로 작용할 수 있으며, 서열번호 38로 표시된다. 일 예로, 상기 GAPDH의 기준 유전자 검출은 서열번호 76로 이루어진 프로머(promer)에 의하여 이루어질 수 있다. 일 실시예에 따른 방법이, 상기 다중 바이오마커가 다종 암(특히, 폐암, 대장암, 췌장암) 조기 진단 또는 예후 예측을 위한 바이오마커로 사용하면, 다종 암(특히, 폐암, 대장암, 췌장암) 진단의 정확도가 높아지고, 다종 암 (특히, 폐암, 대장암, 췌장암)의 전이 가능성 (예를 들면, 폐암, 대장암, 또는 췌장암이 전이될 가능성; 폐암, 대장암, 췌장암 세포 및/또는 조직의 전이능, 침윤능, 또는 침습능), 다종 암(특히, 폐암, 대장암, 췌장암) 조 직 성장 가능성 (예를 들면, 폐, 대장, 또는 췌장에서 발생한 폐암, 대장암, 또는 췌장암 세포의 수 및/또는 종 양 조직의 크기가 증가)에 대한 정보를 제공할 수 있고/있거나 다종 암(특히, 폐암, 대장암, 췌장암) 환자의 예 후 (예를 들면, 생존율)을 예측할 수 있어, 다종 암(특히, 폐암, 대장암, 췌장암) 치료 전략에 중요한 정보를 제공할 수 있다. 다른 하나의 양태로서, 본 발명은 다종 암 조기 진단 또는 예후 예측용 조성물 또는 키트를 제공한다. 상기 조성물 또는 키트는 다종 암 진단 또는 예후를 위한 다중 바이오마커를 포함하는데, 이는 상술한 바와 같 다. 상기 조성물 또는 키트는 상기 다중 바이오마커 이외에 다종 암 조기 진단 또는 예후를 위한 바이오마커 검출을 위한 프로머(promer)를 포함한다. 상기 프로머(promer)는 본 발명자에 의하여 개발된 단일핵산으로, miRNA의 cDNA에 결합하여 프로브(probe) 및 프라이머(primer)로 동시 사용 가능한 단일핵산을 말한다. 상기 프로머는 한국 등록특허 제10-1901749호 및 한 국 등록특허 제10-1991440호 등을 참조할 수 있다. 구체적으로, 상기 프로머(promer)는 X-Y-Z의 구조를 가지며, 상기 프로머의 양 말단 또는 내부에 하나 또는 그 이상의 탐지 가능한 마커가 부착되어 있는 것을 특징으로 한다. 이때 부착되는 탐지 가능한 마커의 위치는 특정 부위에 국한하지 않으며, 특정 효소에 의해 Y 부위 절단 시 탐지 가능한 마커가 분리되는 위치라면 어느 곳이든 가능하다. 상기 X는 1 내지 60개, 바람직하게는 1 내지 30개, 보다 바람직하게는 2 내지 30개, 보다 더 바람직하게는 3 내 지 30개, 보다 더 바람직하게는 4 내지 30개, 보다 더 바람직하게는 5 내지 30개, 보다 더 바람직하게는 6 내지 30개, 보다 더 바람직하게는 7 내지 30개, 보다 더 바람직하게는 8 내지 30개, 보다 더 바람직하게는 10 내지 30개의 염기서열로 구성된 DNA이며, Y가 절단되어 Y 및 Z가 주형으로부터 분리될 경우 프라이머로서 작동하는 구조이다. X가 60개를 초과한 염기서열을 포함하는 경우 핵산 또는 단백질의 실시간 검출시 비특이적 반응이 발생할 수도 있다. 상기 Y는 1 또는 2개의 RNA이며, Y 부위가 주형과 결합된 경우 RNA 가수분해효소(ribonuclease, RNase)에 의하 여 Y 부위가 절단되어 Y 부위가 주형으로부터 분리된다. 상기 RNA 가수분해효소는 예를 들면, RNase Ⅱ, RNase Ⅲ, RNase Ⅳ, RNaseH, 또는 RNase T2 등이 있다. 따라서, 상기 상기 조성물 또는 키트는 상기 프로머의 Y 부위를 절단하기 위한 RNA 가수분해효소(ribonuclease, RNase)을 추가로 포함할 수 있다. 상기 Z는 1 내지 3개, 바람직하게는 2 또는 3개의 DNA이며, Y 부위가 절단될 경우 Y와 함께 주형으로부터 분리 된다. 상기 탐지 가능한 마커는 단일핵산에 공유 결합 또는 비공유 결합에 의해 결합하는 형광물질, 또는 형광물질과 소광물질로 이루어진 형광쌍을 사용할 수 있다. 상기 형광물질은 반드시 이로 제한되는 것은 아니지만, 예를 들어 Cyⓡ3, Cyⓡ5, Cyⓡ 5.5, BodipyTM, AlexaTM 488, AlexaTM 532, AlexaTM 546, AlexaTM 568, AlexaTM 594, AlexaTM 660, rhodamine, TAMRATM, FAMTM, FITC, FluorTM X, ROXTM, Texas RedTM, Orange green 488X, Orange green 514X, HEXTM, TETTM, JOETM, Oysterⓡ 556, Oysterⓡ 645, BodipyTM 630/650, BodipyTM 650/665, CalfluorTM Orange 546, CalfluorTM red 610, Quasarⓡ 670 및 비오틴으로 이루어지는 군으로부터 선택되는 어느 하나일 수 있다. 또한 상기 소광물질은 반드시 이로 제한되는 것은 아니 지만, 예를 들어 DDQ-1, Dabcyl, EclipseTM, 6-TAMRATM, BHQⓡ-1, BHQⓡ-2, BHQⓡ-3, lowa Blackⓡ RQ-Sp, QSYTM-7, QSYTM-2, 및 MGBNFQ로 이루어진 군으로부터 선택되는 어느 하나일 수 있다. 본 발명에서 탐지 가능한 마커로 형광쌍을 사용하는 경우, 형광물질과 소광물질의 위치는 X 또는 Z에 위치한 형 태이거나 Y 부위에 위치할 수 있으며, 그 어느 것에 한정되는 것은 아니다. 하나의 예로서, 형광물질은 X에 위 치하고 소광물질은 Y 또는 Z에 위치할 수 있다. 상기 조성물 또는 키트는 다중 바이오마커의 cDNA 합성반응에 필요한 시약을 추가로 포함할 수 있다. 상기 합성반응에 필요한 시약은 예를 들어, 적당량의 역전사 효소(Reverse transcriptase), oligo(dT) 18 primer 또는 Random primer 등의 RT primer, Nuclease-free water, 4x DN Master Mix 등이 있다. 상기 조성물 또는 키트는 DNA의 증폭반응에 필요한 시약을 추가로 포함할 수 있다. 상기 증폭반응에 필요한 시약은 예를 들어, 적당량의 DNA 중합효소(예를 들어, Thermus aquatiucs(Taq), Thermus thermophilus(Tth), Thermus filiformis, Thermis flavus, Thermococcus literalis 또는 Phyrococcus furiosis(Pfu)로부터 얻은 열 안정성 DNA 중합효소), DNA 중합효소 조인자(Mg2+), 완충용액, dNTPs(dATP, dCTP, dGTP 및 dTTP) 및 물(dH2O)을 들 수 있다. 또한, 상기 완충용액은 이에 제한되지는 않으나 적당량의 트리톤 X- 100(Triton X-100), 디메틸설폭사이드(dimethylsufoxide, DMSO), Tween20, nonidet P40, PEG 6000, 포름아마이 드 및 소혈청 알부민(BSA) 등이 있다. 상기 조성물 또는 키트는 96-웰 플레이트를 추가로 포함할 수 있다. 다른 하나의 양태로서, 본 발명은 다중 바이오마커 또는 이를 포함하는 조성물을 이용하여 다종 암 조기 진단 또는 예후에 필요한 정보를 제공하는 방법을 제공한다. 보다 구체적 양태로서, 본 발명은 대상으로부터 분리된 생물학적 시료에서 다중 바이오마커를 검출하는 단계를 포함하는 다종 암의 조기 진단 또는 예후 예측 방법(또는 진단 또는 예후 예측에 정보를 제공하는 방법)을 제공 한다. 일 예로서, 상기 다종 암의 조기 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 상기 검출 단계에서 측정된 다중 바이오마커의 검출 정보를 비교하고 분류하는 단계; 상기 단계에서 분류된 다중 바이오마커의 검출 정보에 의하여 다종 암을 조기 진단 또는 예후 예측하는 단계를 추가로 포함할 수 있다. 일 예로서, 상기 다종 암의 조기 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 상기 검출 단계에서 검출된 다중 바이오마커의 검출 정보를 학습된 인공지능 모델에 입력하여 분석하는 단계를 추가로 포함할 수 있 다. 상기 방법에 있어서, 상기 바이오마커를 검출하는 단계는 상기 시료 내의 바이오마커의 존재 여부 확인, 바이오 마커의 발현 수준 (예로, Ct 값) 측정, 또는 이들 모두를 수행하는 단계일 수 있다. 일 예에서 상기 바이오마커 를 검출하는 단계는 중합효소연쇄반응(PCR), 역전사 중합효소연쇄반응(RT-PCR), 실시간 중합효소연쇄반응(Real- time PCR), 정량적 역전사 중합효소연쇄반응(RT-qPCR)일 수 있다. 바람직하게는 정량적 역전사 중합효소연쇄반 응(RT-qPCR)이다. 일 예에서 상기 바이오마커를 검출하는 단계는 프로머(promer)를 이용하여 이루어질 수 있으 며, 상기 프로머는 상술한 바와 같다. 본 명세서에서, &quot;생물학적 시료&quot; 또는 &quot;시료&quot;는 혈액 및 생물학적 기원의 액상 시료를 의 미할 수 있고, 개체 (예를 들면, 암 질환이 있는 개체 및/또는 폐암, 대장암, 또는 췌장암 발병 가능성이 있는 개체)로부터 분리된 것일 수 있다. 하나의 예로서, 상기 생물학적 시료는 전혈, 혈장, 혈청 등일 수 있다. 또 하나의 예로서, 상기 생물학적 시료는 동물, 예를 들면, 포유동물, 또는 인간으로부터 수득될 수 있고, 예를 들면 상기 생물학적 시료는 폐암, 대장암, 또는 췌장암 환자로부터 분리된 것 또는 폐암, 대장암, 또는 췌장암 발병 가능성이 있는 인간일 수 있다. 상기 생물학적 시료는 검출하는 단계 전에 전처리될 수 있고, 예를 들면, 균질화 (homogenization), 여과, 증류, 추출, 농축, 방해 성분의 불활성화, 시약의 첨가 등의 전처리 단계를 수 행할 수 있다. 상기 대상(개체, 대상체)은 다종 암, 특히 폐암, 대장암, 또는 췌장암 질환이 의심되는 개체 및/또는 다종 암, 특히 폐암, 대장암, 또는 췌장암 질환을 갖는 개체일 수 있다. 하나의 예로서, 상기 대상 및/또는 상기 대상으로부터 분리된 생물학적 시료는 상술한 다중 바이오마커가 검출 되는 것일 수 있다. 하나의 예에 따른 다종 암(특히 폐암, 대장암, 또는 췌장암) 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 다종 암(특히 폐암, 대장암, 또는 췌장암) 진단 또는 예후 예측을 위한 바이오마커로서 miR-1-3p, miR- 139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-15b-5p, miR-26b-5p, miR-25-3p, miR-34b-5p, miR-92a- 3p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-18a-5p, miR- 181b-5p, miR-223-3p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, miR-431, 및 miR-103-3p으로 이루어진 군에서 20종, 21종, 22종, 23종, 24종, 25종, 26종, 27종, 28종, 29종, 30종, 31종, 32종, 33종, 34종, 35종, 또는 36종을 검출할 수 있다. 또한, 상기 바이오마커는 U43 및 GAPDH을 추가로 포함하고 이를 검출할 수 있다. 하나의 구체적 예에 따른 폐암 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR- 26a-5p, miR-181b-5p, miR-223-3p, miR-26b-3p, miR-6761, 및 miR-339-3P으로 이루어진 군에서 6종, 7종, 8종, 9종, 10종, 11종, 12종, 13종, 14종, 15종, 또는 16종을 검출할 수 있다. 이 경우에 폐암 진단의 정확도가 높아 질 수 있고, 폐암의 전이 가능성 (폐암 (예를 들면, 폐암 세포)이 전이 및/또는 침윤될 가능성), 폐암 조직 성 장 가능성 (폐에서 존재하는 암 세포의 수 및/또는 폐에 존재하는 종양 조직의 크기가 증가), 및/또는 폐암 환 자의 예후 (예를 들면, 생존율)을 예측할 수 있어, 폐암 치료 전략에 중요한 정보를 제공할 수 있다. 또 하나의 구체적 예에 따른 췌장암 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 miR-29a-3p, miR- 29b-3p, miR-29c-3p, miR-30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-181b- 5p, miR-223-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, 및 miR-339-3P으로 이루어진 군에서 6종, 7 종, 8종, 9종, 10종, 11종, 12종, 13종, 14종, 15종, 또는 16종을 검출할 수 있다. 이 경우에 췌장암 진단의 정 확도가 높아질 수 있고, 췌장암의 전이 가능성 (췌장암 (예를 들면, 췌장암 세포)이 전이 및/또는 침윤될 가능 성), 췌장암 조직 성장 가능성 (췌장에서 존재하는 암 세포의 수 및/또는 췌장에 존재하는 종양 조직의 크기가 증가), 및/또는 췌장암 환자의 예후 (예를 들면, 생존율)을 예측할 수 있어, 췌장암 치료 전략에 중요한 정보를 제공할 수 있다. 또 하나의 구체적 예에 따른 대장암 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 miR-1-3p, miR- 15b-5p, miR-26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-18a-5p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, 및 miR-431으로 이루어진 군에서 6종, 7종, 8종, 9종, 10종, 11종, 12종, 13종, 또는 14종을 검출할 수 있다. 이 경우에 췌장암 진단의 정확도가 높아질 수 있고, 대장암의 전이 가능성 (대장암 (예를 들면, 대장암 세포)이 전이 및/또는 침윤될 가능성), 대장암 조직 성장 가능성 (대장에서 존재하 는 암 세포의 수 및/또는 대장에 존재하는 종양 조직의 크기가 증가), 및/또는 대장암 환자의 예후 (예를 들면, 생존율)을 예측할 수 있어, 대장암 치료 전략에 중요한 정보를 제공할 수 있다. 하나의 예에 따른 다종 암(바람직하게는 폐암, 대장암, 또는 췌장암) 조기 진단 또는 예후를 예측하기 위한 정 보를 제공하는 방법은 상기 검출 단계에서 측정된 다중 바이오마커의 검출 정보를 비교하여 분류하는 단계; 및 상기 단계에서 분류된 다중 바이오마커의 검출 정보에 의하여 다종 암의 종을 판정하는 단계;를 추가로 포함할 수 있다. 상기 다중 바이오마커의 검출 정보는 다중 바이오마커 각각에 대한 발현 수준일 수 있다. 또한, 상기 검출 정보 는 다중 바이오마커(예로, 36종의 miRNA)를 동시에 검출할 수 있는 96-웰 플레이트 바이오칩에서 획득된 정보일 수 있다. 상기 발현 수준은 일 예로 정량적 역전사 PCR(RT-qPCR)에 의한 Ct 값(Ct value)일 수 있다. 상기 비교는 시료로부터 측정된 다중 바이오마커의 검출 정보를 기 측정된 정상인의 다중 바이오마커의 검출 정 보를 기준으로 이루어질 수 있다. 상기 기 측정된 정상인의 다중 바이오마커의 검출 정보는 본 발명에 따른 36 종의 miRNA의 발현 수준 및 상기 36종의 miRNA 중 폐암, 대장암, 및 췌장암 각각에 대한 기준 유전자의 발현 수 준일 수 있다. 하나의 예로, 상기 정상인의 다중 바이오마커의 검출 정보는 정상인의 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR-146b-5p, miR-15b-5p, miR-26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-126-3P, miR- 148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a- 5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-18a-5p, miR-181b-5p, miR-223-3p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, miR-431, 및 miR-103-3p의 발현 수 준일 수 있다. 하나의 예로서, 상기 기 측정된 정상인의 검출 정보는 하기 표 1에 기재된 다중 바이오마커의 RT-PCR에 따른 Ct 값일 수 있다. 표 1 miRNA Ct 값 miRNA Ct 값 miRNA Ct 값 miR-34b-5p 35.8 miR-26a-5p 24.8 miR-6761 33.1 miR-124a-3p 32.5 miR-148a-3p 26.9 miR-339-3p 30.9 miR-1-3p 29.7 miR-30a-5p 25.7 miR-126-3p 25.8 miR-146b-5p 30.2 miR-210-5p 32.3 miR-34a-3p 30.0 miR-26b-5p 24.4 miR-150-3p 32.6 miR-29a-3p 25.2 miR-92a-3p 23.6 miR-155-3p 35.6 miR-145-5p 28.3 miR-142-3p 25.1 miR-16b-5p 21.2 miR-18a-5p 26.9 miR-139-3p 31.1 miR-181b-5p 32.3 miR-26b-3p 32.3 miR-25-3p 26.0 miR-223-3p 24.3 miR-21-5p 24.2 miR-15b-5p 25.1 miR-483-3p 28.7 miR-221-3p 25.4 miR-29b-3p 25.1 miR-505-5p 33.6 miR-431 32.3 miR-29c-3p 24.2 miR-636-5p 33.3 miR-103-3p 24.2 상기 분류는 정상인의 다중 바이오마커의 검출 정보를 기준으로 시료로부터 검출된 다중 바이오마커의 검출 정 보를 비교한 결과를 구분하는 것일 수 있다. 일 예로, 상기 검출 정보는 다중 바이오마커의 발현 수준일 수 있 다. 일 예로, 상기 비교한 결과의 구분은 검출 정보(예로, 발현 수준)이 2배 이상 증가, 2배 미만 증가, 1/2배 미만 감소, 및 1/2배 이상 감소의 4개 그룹으로 구분하는 것일 수 있다. 상기 분류된 다중 바이오마커의 검출 정보에 의하여 다종 암의 종 판정은, 하기 [표 12]의 기준에 따라 다중 바 이오마커의 최소 20종 이상이 동일한 검출 정보(예로, 발현 수준)을 가지고, 각 암에 특이적인 바이오마커(기준 유전자)의 최소 6종 이상이 동일한 검출 정보(예로, 발현 수준)을 가지는 경우는 그 해당 암의 종으로 판정하는것일 수 있다. 상기 암에 특이적인 바이오마커의 일 예로, 폐암은 miR-1-3p, miR-139-3p, miR-124a-3p, miR-142-3p, miR- 146b-5p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-181b-5p, miR-223- 3p, miR-26b-3p, miR-6761, 및 miR-339-3P일 수 있다. 상기 암에 특이적인 바이오마커의 일 예로, 대장암은 miR-1-3p, miR-15b-5p, miR-26b-5p, miR-25-3p, miR-34b- 5p, miR-92a-3p, miR-18a-5p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, 및 miR-431일 수 있다. 상기 암에 특이적인 바이오마커의 일 예로, 췌장암은 miR-29a-3p, miR-29b-3p, miR-29c-3p, miR-30a-5p, miR- 34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-181b-5p, miR-223-3p, miR-483-3p, miR-505- 5p, miR-636-5p, miR-6761, 및 miR-339-3P일 수 있다. 상기 분류된 다중 바이오마커의 검출 정보에 의하여 다종 암의 종 판정은 하기 [표 13]의 기준에 따라 다중 바 이오마커의 최소 20종 이상이 동일한 검출 정보(예로, 발현 수준)를 가지되, miR-139-3p, miR-29c-3p, miR- 148a-3p, miR-30a-5p, miR-210-5p, miR-150-3p, miR-181b-5p, miR-34a-3p, miR-29a-3p, miR-145-5p, miR-26b- ep, miR-221-3p, 및 miR-431으로 이루어진 군의 바이오마커 중 5개 이상에서 검출 정보(예로, 발현 수준)의 증 가가 2배 이상인 경우는 다종 암 중 췌장암으로 판정하는 것일 수 있다. [표 13]"}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "상기 표 13에서, ++++는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준의 증가가 2배 이상인 경우이며, +++는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준의 증 가가 2배 미만인 경우이며, ++는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준 의 감소가 1/2배 미만인 경우이며, +는 정상인의 바이오마커 발현 수준을 기준으로 상대적인 바이오마커의 발현 수준의 감소가 1/2배 이상인 경우이다. 한편, 상기 표 13에서 기호 표시가 없는 것은 정상인의 바이오마커 발현 수준과 거의 동일한 발현 수준을 나타내는 경우이다. 하나의 예에 따른 다종 암(바람직하게는 폐암, 대장암, 또는 췌장암) 진단 또는 예후를 예측하기 위한 정보를 제공하는 방법은 상기 측정된 다중 바이오마커의 검출 정보를 학습된 인공지능 모델에 입력하여 분석하는 단계 를 추가로 포함할 수 있다. 상기 다중 바이오마커의 검출 정보는 다중 바이오마커 각각에 대한 발현 수준일 수 있다. 또한, 상기 검출 정보 는 다중 바이오마커(예로, 36종의 miRNA)를 동시에 검출할 수 있는 96-웰 플레이트 바이오칩에서 획득된 정보일 수 있다. 상기 발현 수준은 일 예로 실시간 PCR(Real-Time PCR)에 의한 Ct 값(Ct value)일 수 있다. 상기 학습된 인공지능 모델은 기 검출된 다중 바이오마커의 검출 정보를 훈련 데이터세트학습(Training Dataset), 검증 데이터세트(Validation Dataset), 및 시험 데이터세트(Test Dataset)로 분류하고 DNN(Deep Neural Network, DNN) 알고리즘을 모델링하고, 모델링된 DNN 알고리즘에 대한 테스트를 진행하여 도출된 모델이 다. 또한, 상기 학습된 인공지능 모델은 정상인 및 환자군의 다중 바이오마커의 검출 정보를 입력값으로 설정하여 학습된 것일 수 있다. 상기 정상인 및 환자군의 다중 바이오마커의 검출 정보는 정상인 및 환자군의 miR-1-3p, miR-139-3p, miR-124a- 3p, miR-142-3p, miR-146b-5p, miR-15b-5p, miR-26b-5p, miR-25-3p, miR-34b-5p, miR-92a-3p, miR-126-3P, miR-148a-3p, miR-21-5P, miR-210-5p, miR-221-3p, miR-26a-5p, miR-29a-3p, miR-29b-3p, miR-29c-3p, miR- 30a-5p, miR-34a-3p, miR-145-5p, miR-150-3P, miR-155-3P, miR-16b-5p, miR-18a-5p, miR-181b-5p, miR-223- 3p, miR-26b-3p, miR-483-3p, miR-505-5p, miR-636-5p, miR-6761, miR-339-3P, miR-431, 및 miR-103-3p의 발 현 수준일 수 있다. 상기 다중 바이오마커의 발현 수준은 검출된 다중 바이오마커 각각의 Ct 값일 수 있다. 하나의 예로서, 상기 정상인의 다중 바이오마커의 검출 정보는 상기 표 1에 기재된 다중 바이오마커의의 실시간 PCR에 따른 Ct 값일 수 있다. 상기 다중 바이오마커의 검출 정보는 다중 바이오마커(예로, 36종의 miRNA)를 동시에 검출할 수 있는 96-웰 플 레이트 바이오칩에서 검출된 다중 바이오마커 각각의 Ct 값일 수 있다. 상기 96-웰 플레이트 바이오칩은 36종의 miRNA를 검출하기 위한 시약 등이 96-웰에 분배되어 있으며, 이로부터 발현 수준을 측정할 수 있는 바이오칩이다. 또한, 상기 학습된 인공지능 모델은 시료에서 측정된 다중 바이오마커의 검출 정보를 상기 인공지능 모델에 입 력하여 출력값으로서 상기 시료의 다중 암의 종 판정을 출력하는 것일 수 있다. 상기 출력값은 다종 암 및 정상으로 단일 또는 다중 레이블(label)된 값일 수 있다. 하나의 예로서, 폐암, 대장 암, 췌장암, 및 정상으로 단일 또는 다중 레이블(label)된 출력값일 수 있다. 상기 인공지능 모델에서 사용하는 인공지능 알고리즘은, 적어도 하나의 입력층(Input Layer)과 출력층(Output Layer) 간 복수의 은닉층(Hidden Layer)로 이루어진 인공신경망(Artificial Neural Network)인 DNN(Deep Neural Network) 알고리즘일 수 있다. 또한, RNN(Recurrent Neural Network), RBM(Restricted Boltzmann Machine) 등일 수 있다. 이때, 딥러닝의 단층 퍼셉트론(Single-Layer Perceptron)은, 인공신경망의 가장 기본적인 모형으로, 외부 입력 값을 받아 연결하는 입력층과 이를 처리하여 결과를 출력하는 출력층으로 이루어져 있다. 다층 퍼셉트론(Multi- Layer Perceptron)은, 인공신경망의 이론 중 하나로 역전파신경망(Back Propagation Network)과 다층전방향신 경망(Multi-Layer Feedforward Network)이라고도 불린다. 기본적으로 입력층, 은닉층, 출력층으로 구성되며 각 층은 다수의 뉴런(Node)을 가진다. 여기서, 역전파 알고리즘(Back-Propagation Algorithm)은, 입력층의 각 노 드에 입력 패턴에 따라 임의 가중치를 주면, 이 신호는 은닉층까지 전달되고 출력층에 도달하여 출력값과 목표값을 비교한다. 비교로 도출된 오차를 줄이기 위하여 연결 강도를 조절하며 역진하는데, 이 과정을 반복하며 오 차를 줄이는 것이 역전파 알고리즘이다. 인공신경망 및 딥러닝은 입력층, 은닉층, 출력층을 통하여 출력값을 도출하는 구조를 가지며, 각 층간 연결강도 를 통하여 신경이 전달된다. 적절한 은닉층, 학습률, 소실 함수, 활성화 함수, 모멘텀, 학습과정 최대 횟수, 학 습과정 반복 횟수 등 파라미터를 설정함으로써 기울기 소실, 오버피팅 등의 문제를 예방하고 좋은 성능을 가진 모델을 구축할 수 있다. 본 발명의 일 실시예에서는 적합한 파라미터를 찾기 위하여 하이퍼 파라미터를 이용할 수 있는데, 다른 방법을 이용하는 것을 배제하는 것은 아니다. 하이퍼 파라미터(Hyper-Parameter)는 설정된 다양한 파라미터들을 학습하고 시도하여 최적화된 파라미터를 찾아 내는 것이다. 여기서, 기울기 소실, 학습 수렴 속도, 오버피팅 등을 보완하기 위한 활성화 함수로, ReLU(Rectified Linear Unit), TanH(Hyperbolic Tangent) emd이 존재하는데, ReLU 함수는 가중치가 양수일 경 우, 그대로 나타내고, 가중치가 양수일 때는 은닉층이 다수여도 기울기 소실이 발생하지 않는다. TanH 함수는 Sigmoid와 유사한 형태를 가지지만 확장된 형태라고 할 수 있는데, 0이 아닌 -1까지 확장되었기에 출력범위가 넓어 더 빠르게 수렴할 수 있다. 일 예로, 학습된 인공지능 모델을 이용하여 입력된 다중 바이오마커의 발현 수준으로부터 약 90% 이상의 정확성 으로 다종 암을 조기 진단 또는 예후 예측할 수 있었다."}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따라 다양한 암의 종류를 비침습적 방법에 의하여 동시에 조기 진단 및 예후 예측을 할 수 있으며, 그러한 진단 및 예후 예측은 특이도 및 민감도가 우수하고 정확도가 높은 특징이 있다. 따라서, 암의 조기 진단 에 의하여 암의 치료 및 예방에 도움이 될 것이다. 또한 인공지능 모델을 이용하여 간단하고 빠르면서도 높은 정확도로 다양한 암의 종류를 비침습적 방법에 의하 여 동시에 진단 및 예후 예측을 할 수 있다."}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 이해를 돕기 위하여 실시예 등을 들어 상세하게 설명하기로 한다. 그러나, 본 발명에 따른 실 시예들은 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 하기 실시예들에 한정되는 것으로 해석되 어서는 안 된다. 본 발명의 실시예들은 당업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명 하기 위해 제공되는 것이다. 실시예 1: 폐암, 대장암, 및 췌장암의 진단용 기준 유전자의 특정 폐암, 대장암, 및 췌장암 진단의 정밀도 및 정확도 향상을 위해 기준 유전자(reference gene)를 통한 각 결과값 의 정규화(normalization)를 위하여 논문(비특허문헌 [1] 및 [2])을 참고하여 후보 기준 유전자를 선별하였으며, 그 선별된 유전자를 하기 표 2에 나타내었다. 표 2"}
{"patent_id": "10-2023-0146422", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 표 2의 후보 기준 유전자(reference gene) 중 혈액에서 추출한 RNA에서 검출량이 적은 reference gene인 U48, U44, U6, miR-191, 및 miR-93은 제외하였고, GAPDH, U43, miR-103, miR-25, miR-16 유전자를 1차 선별하 였다. 이후 대장암 환자, 췌장암 환자 혈액에서 추출한 RNA로부터 5종의 reference gene(GAPDH, U43, miR-103, miR-25, miR-16)을 검출하는 실험을 수행하여 reference gene으로서 사용 가능한 target gene을 선별하고자 하 였다. 5종의 reference gene의 검출은 하기 표 3 내지 6에 기술된 프로머(promer), RT primer, 역방향 primer를 이용 하였다. 상기 프로머(promer)는 본 발명자에 의하여 개발된 단일핵산으로 DNA, RNA, 및 DNA로 이루어진 구조를 가지며, 프라이머(primer) 및 프로브(probe)로 동시에 사용가능한 단일핵산이다(한국 등록특허 제10-1901749호 참조). 본 실험은 2회 반복하였으며, 검출 시 각 평균값을 Ct 값으로 나타내었고, 각 Ct 값에 대하여 타겟 (target) 별 평균값을 나타낸 후, 평균값에 대한 적합성을 확인하기 위해 SD 값을 나타내었다. 그 결과, 도 1과 같이, 대장암 환자의 SD값은 miR-25이 0.279, miR-16이 0.367, miR-103이 0.540, U43이 1.022, GAPDH가 2.021을 각각 나타내었다. 따라서, 가장 낮은 SD값을 나타낸 miR-25가 가장 안정적인 reference gene으로 고려되었다. 또한, 도 2와 같이, 췌장암 환자의 SD값은 U43이 0.735, miR-25이 1.392, miR-103가 1.445, miR-16이 1.487, GAPDH가 2.989를 각각 나타내었다. 따라서, 가장 낮은 SD값을 나타낸 U43이 가장 안정적인 reference gene으로 고려되었다. 더욱 정확한 분석을 위하여 RefFinder 프로그램을 사용하여 분석하였다. 그 결과, 도 3에서 볼 수 있는 바와 같 이, 대장암 환자 샘플에서는 miR-103, 췌장암 환자 샘플에서는 miR-25, 대장암과 췌장암 환자 샘플의 모든 결과 값을 함께 분석한 결과에서는 miR-103이 가장 안정적인 reference gene으로 분석되었다. 상기한 실험 결과로부터 대장암 및 췌장암 환자에 대한 가장 안정적인 miRNA 종류가 서로 다름을 확인할 수 있 었다. 즉, miRNA의 경우 검체 종류에 따라 안정적인 target의 종류가 다를 수 있다. 따라서, 다종 암을 동시에 판별하기 위하여는 1개의 reference gene의 사용이 아닌 miR-103과 더불어 miR-25, miR-16, GAPDH 등도 함께 reference gene으로 사용해야 할 것으로 판단하였다. 실시예 2: 혈액에서의 암 종별 miRNA 분석능 확인 및 선정 miRNA는 metabolism, cell proliferation, apoptosis, developmental timing 등에 복합적으로 관여하기 때문에 단일 miRNA로 단일 암종을 진단하기 어렵고, 한 종의 miRNA가 관여하는 암종이 한 가지 이상일 수 있다. 따라서 여러 종의 miRNA 발현 양상의 분석으로 암을 진단해야만 한다. 정상인과 환자 혈액에서 추출한 RNA로부터 폐암, 췌장암, 대장암의 3개 암 종별 miRNA target을 선정하고, 유의 미한 miRNA target을 [표 3 및 4]와 같이 35종의 miRNA target, 2종의 internal control(reference gene)를 선 정하였다. 이들 선정된 miRNA 중 miR-25-3p와 miR-16b-5p는 각각 대장암 및 췌장암 관련 target이지만, 해당하 는 암종이 아닌 각각 대장암 이외의 암 및 췌장암 이외의 암에 대하여 internal control(reference gene)로 사 용할 수 있다. 전체 37종의 target 중 32종의 target은 FAM dye를 사용하여 검출 가능하도록 하였고, miR-34b-5p, miR-124a- 3p, miR-1-3p, miR-146b-5p, miR-26b-5p은 TexasRed dye를 사용하여 multiplex real-time PCR이 가능하도록 하 였다. 이를 통해 96 well plate 바이오칩으로 1회 실험 시 37종의 target 검출이 가능하게 하였다. 32종의 target을 검출하기 위한 프로머(promer), RT primer, 및 reverse primer는 [표 5 및 6]과 같다. [표 5 및 6]의 프로머(promer)에서 RNA는 소문자 및 그 다음의 대문자로 표기하였는데, 예를 들어 프로머 서열에서 rG, rC, rU, rA이다. 표 3 miRNA 폐암췌장암대장암기준 유전자 서열 서열번호 miR-1-3p O O ugg aau gua aag aag uau gua u 1 miR-139-3p O ugg aga cgc ggc ccu guu gga gu 2 miR-124a-3p O uaa ggc acg cgg uga aug cca a 3 miR-142-3p O ugu agu guu ucc uac uuu aug ga 4 miR-146b-5p O uga gaa cug aau ucc aua ggc ug 5 miR-15b-5p O uag cag cac auc aug guu uac a 6 miR-26b-5p O uuc aag uaa uuc agg aua ggu 7 miR-25-3p O cau ugc acu ugu cuc ggu cug a 8 miR-34b-5p O Ouag gca gug uca uua gcu gau ug 9 miR-92a-3p O uau ugc acu ugu ccc ggc cug u 10 miR-126-3P O ucg uac cgu gag uaa uaa ugc g 11 miR-148a-3p O uca gug cac uac aga acu uug u 12 miR-21-5P O uag cuu auc aga cug aug uug a 13 miR-210-5p O agc ccc ugc cca ccg cac acu g 14 miR-221-3p O agc uac auu guc ugc ugg guu uc 15 miR-26a-5p O uuc aag uaa ucc agg aua ggc u 16 miR-29a-3p O uag cac cau cug aaa ucg guu a 17 miR-29b-3p O uag cac cau uug aaa uca gug uu 18 miR-29c-3p O Ouag cac cau uug aaa ucg guu a 19 miR-30a-5p O ugu aaa cau ccu cga cug gaa g 20 miR-34a-3p O ugg cag ugu cuu agc ugg uug u 21 miR-145-5p O guc cag uuu ucc cag gaa ucc cu 22표 4 miRNA 폐암췌장암대장암기준 유전자 서열 서열번호 miR-150-3P O cug gua cag gcc ugg ggg aca g 23 miR-155-3P O cuc cua cau auu agc auu aac a 24 miR-16b-5p O uag cag cac gua aau auu ggc g 25 miR-18a-5p O uaa ggu gca ucu agu gca gau ag 26 miR-181b-5p O O aac auu cau ugc ugu cgg ugg gu 27 miR-223-3p O O ugu cag uuu guc aaa uac ccc a 28 miR-26b-3p O O ccu guu cuc cau uac uug gcu 29 miR-483-3p O O uca cuc cuc ucc ucc cgu cuu 30 miR-505-5p O O ggg agc cag gaa gua uug aug u 31 miR-636-5p O O ugu gcu ugc ucg ucc cgc ccg ca 32 miR-6761 O O O ucu gag aga gcu cga ugg cag 33 miR-339-3P O O O uga gcg ccu cga cga cag agc cg 34 miR-431 O ugu cuu gca ggc cgu cau gca 35 miR-103-3p Oagc agc auu gua cag ggc uau ga 36 U43 Ocacagatgat gaacttattg acgggcggac agaaactgtg tgctgattgt cacgttctga tt37 GAPDH &lt;서열목록의 서열번호 38 참조 &gt;38 표 5 구분 서열 서열번호 miR-1-3p promer 5'-/Texas Red/ GCC ACT GGA ATG TAA AGA AGT ArUG T/3lABkFQ/-3'39 miR-139-3p promer5'-/56-FAM/TTA TTA GAC GCG GCC CTrG TT /3IABkFQ/-3' 40 miR-124a-3p promer5'-/5TexRd-XN/AAT TA AGG CAC GCG GTG ArAT GC/3lABkFQ/-3' 41 miR-142-3p promer5'-/56-FAM/GCC CTG TAG TGT TTC CTA CTT TrAT G/3IABkFQ/-3' 42 miR-146b-5p promer5'-/Texas Red/GCC ACT GAG AAC TGA ATT CCA TrAG G/3lABkFQ/-3' 43 miR-15b-5p promer5'-/56-FAM/GCG TAT AGC AGC ACA TCA TGG rUTT/3IABkFQ/-3' 44 miR-26b-5p promer5'-/Texas Red/CGCT TCA AGT AAT TCA GGA TAGrGTA/3IABkFQ/-3' 45 miR-25-3p promer5'-/56-FAM/ACA TTG CAC TTG TCT CGG rUCT /3IABkFQ/-3' 46 miR-34b-5p promer5'-/5TexRd-XN/ CTAG GCA GTG TCA TTA GCT GrAT T /3lABkFQ/-3' 47 miR-92a-3p promer5'-/56-FAM/GCC TAT ATT GCA CTT GTC rCCG/3IABkFQ/-3' 48 miR-126-3P promer5'-/56-FAM/GG TCG TAC CGT GAG TAA TAA TrGC G /3IABkFQ/-3' 49 miR-148a-3p promer5'-/56-FAM/ ACC TCA GTG CAC TAC AGA ACrU TT/3lABkFQ/-3' 50 miR-21-5P promer5'-/56-FAM/GCC AC T AGC TTA TCA GAC TGA TrGT T/3IABkFQ/-3' 51 miR-210-5p promer5'-/56-FAM/ ATGC CCA CCG CAC rACT/3IABkFQ/-3' 52 miR-221-3p promer5'-/56-FAM/TAG CTA CAT TGT CTG CTG GrGT T/3IABkFQ/-3' 53 miR-26a-5p promer5'-/56-FAM/ CCA CT TCA AGT AAT CCA GGA TAGrGCT/3IABkFQ/-3' 54 miR-29a-3p promer5'-/56-FAM/GAG TAG CAC CAT CTG AAA TCrG GT/3lABkFQ/-3' 55 miR-29b-3p promer5'-/56-FAM/CCC TAG CAC CAT TTG AAA TCrA GT/3lABkFQ/-3' 56 miR-29c-3p promer5'-/56-FAM/GAG TAG CAC CAT TTG AAA TCrG GT/3lABkFQ/-3' 57 miR-30a-5p promer5'-/56-FAM/GAC TGT AAA CAT CCT CGA CTG rGAA/3IABkFQ/-3' 58 miR-34a-3p promer5'-/56-FAM/TTG GCA GTG TCT TAG CTG rGTT/3IABkFQ/-3' 59 miR-145-5p promer5'-/56-FAM/TTG TCC AGT TTT CCC AGG AArU CC/3IABkFQ/-3' 60 표 6 구분 서열 서열번호 miR-150-3P promer5'-/56-FAM/TAT CTG GTA CA(A) GCC TGrG GG/3IABkFQ/-3' 61 miR-155-3P promer5'-/56-FAM/CC ACC TCC TAC ATA TTA GCA TTrA ACA /3IABkFQ/-3' 62 miR-16b-5p promer5'-/56-FAM/GG TAG CAG CAC GTA (G)AT ATT GrGC G/3IABkFQ/-3' 63 miR-18a-5p promer5'-/56-FAM/GG GTG TAA GGT GCA TCT ArGT G/3IABkFQ/-3' 64miR-181b-5p promer5'-/56-FAM/TCA TTG CTG TCG GTG rGGT/3IABkFQ/-3' 65 miR-223-3p promer5'-/56-FAM/TTG TCA GTT TGT CAA ATA CCrC CA/3IABkFQ/-3' 66 miR-26b-3p promer5'-/56-FAM/ C CAC CCC TGT TCT CCA TTA CrUT G/3IABkFQ/-3' 67 miR-483-3p promer5'-/56-FAM/TCA CTC CTC TCC TCC CrGT C/3IABkFQ/-3' 68 miR-505-5p promer5'-/56-FAM/GGG AGC CAG GAA GTA TTG rATG/3IABkFQ/-3' 69 miR-636-5p promer5'-/56-FAM/ATG TGC TTG CTC GTC rCCG /3IABkFQ/-3' 70 miR-6761 promer 5'-/56-FAM/TCT CCT ACG CTG CTC TCT rCAC/3IABkFQ/-3' 71 miR-339-3P promer5'-/56-FAM/TAT AGC GCC TCG ACG ACrA GA/3IABkFQ/-3' 72 miR-431 promer 5'-/56-FAM/TTA TGT CTT GCA GGC CGT rCAT/3IABkFQ/-3' 73 miR-103-3p promer/56-FAM/AGC AGC ATT GTA CAG rGGC /3IABkFQ/ 74 U43 promer 5'-/56-FAM/AAC TGT GTG CTG ATT GTC rACG/3IABkFQ/-3' 75 GAPDH promer /56-FAM/GAG CCG CAC CTT GTrC AT/3IABkFQ/ 76 RT primer 5'- GTT GAT TTT TTC TTT TTC AAC TTT TTT TTT TTT TTT TTT-3' 77 Reverse primer 5'- GTT GAT TTT TTC TTT TTC AAC TTT TTT TTT TTT TTT TTT-3' 78 실시예 2: 혈장의 최저 분석 농도 검증 상기 표 3 및 4에서 발굴한 폐암, 췌장암, 및 대장암과 관련된 miRNA target 35종과 internal control(reference gene)에 대하여 정상인 혈액 샘플에서 분리한 혈장(plasma)에서 추출한 RNA 400ng을 이용하 여 poly A tailing &amp; RT PCR을 통한 cDNA 합성 후 real-time PCR을 통해 각 target 별 분석능을 확인하였 다. 본 실험값은 3 반복에 대한 실험결과로 검출 시 Ct의 평균값을 그래프와 함께 표기하였다(도 4 참조). 도 4에서 볼 수 있듯이, Ct 값은 target 별로 매우 상이한 값을 나타냈으며, miR-16b-5p의 경우 Ct 20.3, miR-34b-5p의 경우 ND(Non Detected)를 나타내었다. 이는 혈액에서 분리한 plasma 내에 존재하는 miRNA의 종류와 그 양이 다 르기 때문이며, 이를 통해 암 종별 miRNA 검출 패턴의 분석이 가능함을 확인할 수 있었다. 실시예 3: 환자 및 대조군 혈장 유래 miRNA 검출 및 분석 3-1. 암 종별 혈액에서 추출한 miRNA의 유의한 차이 비교 분석 먼저, 정상인을 포함하여 3개 암종인 폐암, 췌장암, 대장암 환자의 혈액 샘플로부터 plasma를 분리하고, 이 plasma에서 추출한 RNA의 추출량을 UV 분광광도계(NanoOne-ThermoScientific)로 정량하여 추출량을 비교하였다. 그 결과를 하기 표 7에 나타내었다. 표 7 정상인 N=127폐암 환자 N=102췌장암 환자 N=50대장암 환자 N=57 농도 평균값(ng/ul) 14.03 15.85 14.18 20.82 SD 8.42 4.84 6.57 6.97 CV(%) 60 31 45 33 상기 표 7에서 볼 수 있듯이, 정상인, 폐암 환자, 췌장암 환자, 대장암 환자의 혈액 샘플에서 분리한 plasma에 서 추출한 RNA 추출물의 농도 평균과 SD 값, CV(%) 값을 확인한 결과, 평균값에서 대장암 환자가 가장 높은 농 도를 나타내었으나, 전체 데이터에 대한 CV(%) 값이 31에서 60을 나타내므로 추출된 RNA의 양 차이가 암 종별로 유의미한 차이가 있다고 볼 수 없었다. 3-2. 암 종별 혈액에서 추출한 RNA로부터 암 관련 miRNA 검출 상기 [표 7]과 같은 암 종별 혈액에서 분리한 plasma에서 추출한 RNA를 동일한 양인 10ng을 사용하여 poly A tailing &amp; RT PCR을 통해 cDNA를 합성하고 이 cDNA로 각 암 종별 target miRNA를 이용하여 real-time PCR을 통해 검출하였다. 암 종별 miRNA target은 각각 폐암 miR-29b-3p, 췌장암 miR-223-3p, 대장암 miR-92a-3p, internal control(reference gene) miR-103-3p를 사용하여 각 target의 프로머(promer) ([표 5] 및 [표 6] 참조)를 이용 하여 폐암, 췌장암, 대장암 환자 혈액 또는 정상인 혈액에서 분리한 plasma로부터 추출한 RNA에서 각 miRNA의 발현량을 확인하였다. 그 결과, 폐암 환자, 췌장암 환자, 대장암 환자, 정상인에서 internal control(reference gene)의 Ct 값은 각 각 21.6, 21.7, 21.6, 21.9로 SD 0.12의 유사한 값을 나타내었다. 폐암 관련 miRNA인 miR-29b-3p는 폐암, 췌장암, 대장암, 정상에서 각각 Ct 24.2, 23.7, 23.5, 24.9의 값을 나 타내었다([도 5] 참조). 이 값을 internal control Ct 값으로 normalization 시킨 후, 정상인과 비교했을 때, 암 환자에서 up regulation 되는 것으로 확인되었으며, 그 값이 대장암 &gt;췌장암 &gt;폐암 순으로 증가하였다. 췌장암 관련 miRNA인 miR-223-3p는 폐암, 췌장암, 대장암, 정상에서 각각 Ct 24, 20.9, 24.3, 22.3의 값을 나 타내었다([도 5] 참조). 이 값을 internal control Ct 값으로 normalization 시킨 후, 정상인과 비교 했을 때, 췌장암 환자에서 up regulation, 폐암과 대장암 환자에서는 down regulation 되는 것으로 확인되었다 대장암 관련 miRNA인 miR-92a-3p는 폐암, 췌장암, 대장암, 정상에서 각각 Ct 22.3, 22.8, 22.2, 22.4의 값을 나타내었다([도 5] 참조). 이 값을 internal control Ct 값으로 정상화(normalization) 시킨 후, 정상인과 비 교했을 때, 암 환자에서 down regulation 되는 것으로 확인되었으며, 그 값이 췌장암 &gt;폐암&gt; 대장암 순으 로 컸으나, 값의 차이가 크지 않았다. 이상의 실험 결과, 각 miRNA에 대한 혈액 샘플별 차이는 췌장암 관련 miRNA인 miR-223-3p가 가장 큰 것으로 확 인되었으며, 나머지 target에 대해서는 위 실험 결과에서 큰 차이가 보이지 않았다. 따라서 miRNA는 한 개의 target으로 암종 진단이 쉽지 않음을 확인하였다. 실시예 4: 바이오칩을 이용한 진단 시스템 구축 암 종별 최종 선정된 35종 miRNA와 internal control(reference gene)을 promer가 심겨진 96well plate 바이오 칩을 이용하여 암 종별 관련 miRNA 진단 방법을 구축하였다. 구체적으로, 1개의 혈액 샘플로부터 분리한 plasma 200ul로부터 Maxwell® RSC miRNA Plasma and Serum kit(Promega)를 사용하여 RNA를 추출하였다. 추출된 RNA를 5ng/ul의 동일 농도로 맞춘 후 [표 8]의 poly A tailing &amp; RT PCR 조성 및 [표 9]의 poly A tailing &amp; RT PCR 조건으로 poly A tailing &amp; RT PCR 을 통해 cDNA를 합성하였다. 표 8 No. Component 1 rxn (ul) 1 Poly(A) tailing &amp; RT Master mix (2X) 100 2 RT primer 10 3 Poly(A) tailing Enzyme 5 4 Reverse Transcriptase 1.35 5 Nuclease-free water 63.65 6 miRNA template/NTC 20 Total reaction volume 200 표 9 Step Temperature Time Incubation 40℃ 60 min Inactivation 95℃ 10 min Cooling 10℃ 10 min상기 합성된 cDNA를 이용하여 [표 10]의 real-time PCR 조성에 따라 만든 real-time PCR mixture와 37종의 promer가 5ul(각 promer의 농도는 상이함)씩 심어진 96 well plate 바이오칩([도 6] 참조)을 epMotion 5070(eppendorf)에 장착한 후 96 well plate 바이오칩에 real-time PCR mixture를 10ul 씩 분주하였다. 표 10 No. Component 100 rxn(ul) 1 3X real-time PCR Master mix 500 2 Reverse primer 100 3 Nuclease free water 200 4 RT product (cDNA) 200 Total reaction volume 1000 분주가 완료된 96 well plate 바이오칩을 sealing 하여 mixture를 원심분리한 후, [표 11]과 같은 PCR 조건으 로 real-time PCR을 수행하였다. real-time PCR 결과를 토대로 threshold FAM: 200,000, TexasRed: 150,000, Cut off 35로 설정하여 Ct 값을 분석하였다. 표 11 Step Temperature Time Pre-denaturation 95℃ 5 min Denaturation 95℃ 10 sec Annealing&amp;Extension (Data acquisition)65℃ 1 min 실시예 5: 다종 miRNA 분석에 의한 암 종별 진단 결과 상기 실시예 4의 진단 시스템을 이용하여 임상 검체에 대한 암 종별 진단을 수행하였다. 구체적으로, 폐암 환자 87명, 췌장암 환자 51명, 대장암 환자 51명, 정상인 83명으로부터 채취한 혈액 샘플로부 터 plasma를 분리하고, Maxwell® RSC miRNA Plasma and Serum kit(Promega)를 사용하여 plasma로부터 RNA를 추 출하였다. 추출된 RNA 100ng을 이용하여 poly A tailing &amp; RT PCR을 통해 cDNA 합성 후, 상기 실시예 4의 96 well plate 바이오칩 시스템을 이용하여 real-time PCR을 진행하였다. 실험 결과, Ct 값을 암 종별 37개 target 각각에 대한 평균과 SD 값을 [표 12]에 표기하였고, 이 값을 [그림 7]에 나타내었다. 표 12 폐암 환자 N=87대장암 환자 N=51췌장암 환자 N=51정상인 N=83 Ct Mean SD Ct Mean SDCt Mean SDCt Mean SD miR-34b-5p 36.41.3436.21.2034.61.7835.81.63 miR-124a-3p34.83.2436.71.6933.32.1932.51.15 miR-1-3p 29.81.3630.61.6328.81.7829.71.56 miR-146b-5p29.40.9330.40.9428.61.6530.21.19 miR-26b-5p 22.60.9923.01.1123.11.8524.41.77 miR-92a-3p 22.91.3622.81.5223.41.6723.61.74 miR-142-3p 22.80.9523.41.0324.01.5525.11.97 miR-139-3p 31.71.0532.61.0430.41.4031.11.22 miR-25-3p 25.31.3024.91.4625.61.7026.01.62 miR-15b-5p 23.91.1624.11.2524.61.7925.11.85 miR-29b-3p 23.81.1724.10.9723.81.5425.11.38 miR-29c-3p 24.20.9524.41.0923.11.4124.21.42 miR-26a-5p 23.60.9524.51.0623.71.7424.81.66miR-148a-3p27.11.0127.51.1226.01.8026.91.65 miR-30a-5p 25.80.9326.30.9225.41.4325.71.30 miR-210-5p 32.71.4133.41.6131.61.7832.31.39 miR-150-3p 34.12.0434.91.6631.31.6432.61.83 miR-155-3p 36.12.5335.32.6836.11.4335.63.58 miR-16b-5p 20.41.1320.51.1421.11.8321.21.98 miR-181b-5p32.31.7333.82.1431.71.7632.31.96 miR-223-3p 24.21.2224.01.6322.12.1924.32.10 miR-483-3p 29.91.0830.40.9930.11.5128.71.14 miR-505-5p 32.31.1632.71.2232.71.3633.61.43 miR-636-5p 33.41.3633.21.2733.41.4433.31.22 miR-6761 34.11.4034.81.5832.81.6033.11.96 miR-339-3p 30.61.0131.01.0629.81.4030.91.62 miR-126-3p 25.21.0025.81.2125.31.8725.81.85 miR-34a-3p 30.51.3631.40.8929.51.4130.01.41 miR-29a-3p 26.20.8326.50.8923.81.5725.21.61 miR-145-5p 29.21.3228.81.2227.61.6628.31.75 miR-18a-5p 25.12.6925.11.0925.91.5226.91.66 miR-26b-3p 32.41.3032.81.4531.31.5932.31.72 miR-21-5p 24.10.9225.00.9523.11.4424.21.53 miR-221-3p 25.81.0626.91.0924.11.4725.41.69 miR-431 32.31.2133.71.1031.31.4732.31.69 miR-103-3p 22.71.6622.41.5823.42.0324.22.38 GAPDH 33.31.7435.41.8433.11.6034.31.49 상기 측정된 정상인의 Ct 값을 기준으로 폐암, 대장암, 및 췌장암의 각 Ct 값을 상대적으로 비교하고 miRNA의 발현양을 [도 8]에 나타내었다. 이때, miRNA의 상대적 발현양은 2의 n 제곱승으로, 상기 n은 (정상인 miRNA의 Ct 값 - 샘플의 miRNA Ct 값)인 것을 특징으로 한다. 도 8에서, 정상인 기준으로 폐암, 대장암, 및 췌장암 환자 는 상이한 패턴으로 발현양의 차이를 나타내었다. 이러한 발현양의 차이를 하기 [표 13]에 나타내었다. [표 1 3]에서 ++++는 정상인 기준으로 상대적 발현양이 2배 이상으로 증가한 경우를 의미하며, +++는 상대적 발현양이 2배 미만으로 증가한 경우를 의미한다. 또한, ++는 정상인 기준으로 상대적 발현양이 1/2배 미만으로 감소한 경 우를 의미하며, +는 정상인 기준으로 상대적 발현양이 1/2배 이상으로 감소한 경우를 의미한다. 상기 기호가 기 재되지 않는 경우는 정상인과 거의 동일한 수준으로 발현한 경우를 의미한다. 표 13 폐암 대장암 줴장암 miR-34b-5p + + ++++ miR-124a-3p + + + miR-1-3p ++ + ++++ miR-146b-5p ++++ ++ ++++ miR-26b-5p ++++ ++++ ++++ miR-92a-3p ++++ ++++ ++ miR-142-3p ++++ ++++ ++++ miR-139-3p + + ++++ miR-25-3p ++++ ++++ ++++ miR-15b-5p ++++ ++++ ++++ miR-29b-3p ++++ ++++ ++++ miR-29c-3p ++ ++++ miR-26a-5p ++++ +++ ++++ miR-148a-3p ++ + ++++ miR-30a-5p ++ + ++++ miR-210-5p + + ++++ miR-150-3p + + ++++ miR-155-3p + ++ + miR-16b-5p ++++ ++++ +++ miR-181b-5p + ++++miR-223-3p +++ +++ ++++ miR-483-3p + + + miR-505-5p ++++ ++++ ++++ miR-636-5p ++ +++ ++ miR-6761 + + +++ miR-339-3p +++ ++ ++++ miR-126-3p ++++ ++++ miR-34a-3p + + ++++ miR-29a-3p + + ++++ miR-145-5p + + ++++ miR-18a-5p ++++ ++++ ++++ miR-26b-3p ++ + ++++ miR-21-5p +++ + ++++ miR-221-3p + + ++++ miR-431 + ++++ miR-103-3p ++++ ++++ ++++ GAPDH ++++ + ++++ 폐암 환자, 대장암 환자, 췌장암 환자, 및 정상인 각 20명에 대하여 상술한 방법으로 36종의 miRNA에 대한 Ct 값을 측정하고 정상인을 기준으로 상대적 발현양을 확인하고 이를 상기 표 12에 기재된 상대적 발현양과 대비하 였다. 그 결과, 36종의 miRNA에서 최소 20종 이상의 miRNA의 상대적 발현양이 유사한 것으로 나타났다. 또한, 36종의 miRNA에서 폐암, 대장암, 및 췌장암에 특이적인 miRNA([표 2 및 3]에서 O로 표시한 miRNA 참조)는 6종 이상에서 miRNA의 상대적 발현양이 유사한 것으로 나타났다. 또한, 췌장암의 경우 상기 [표 13]에서 볼 수 있듯 이, miR-139-3p, miR-29c-3p, miR-148a-3p, miR-30a-5p, miR-210-5p, miR-150-3p, miR-181b-5p, miR-34a-3p, miR-29a-3p, miR-145-5p, miR-26b-ep, miR-221-3p, 및 miR-431는 폐암 및 대장암의 발현양 감소에 비하여 발현 양 증가가 2배 이상이었는바, 상기 시험한 췌장암 환자는 상기 13개의 miRNA 중 5개 이상에서 발현양 증가가 2 배 이상 나타났다. 이러한 방법에 따른 폐암 20명 중 2명을 정상으로 오진하고 18명을 폐암으로 정상 판정하였 으며, 췌장암 20명 중 1명을 대장암으로 오진하고 19명을 정확히 판정하였으며, 대장암 20명 중 3명을 정상으로 오진하고 17명을 대장암으로 정상 판정하여, 암종 구분능에 있어서도 90.0%의 높은 정확도를 나타내었다. 따라서, 샘플에 대한 36종의 miRNA의 Ct 값을 측정한 후 정상인의 Ct 값(표 12 참조)과 대비하여 상대적 발현양 을 계산하고 상기 표 12에 기재된 상대적 발현양과 비교하여 최소 20종의 miRNA 발현양이 유사한 경우 및 각 암 종에 특이적인 miRNA 중 6종 이상의 miRNA의 상대적 발현양이 유사한 경우를 해당 암으로 판별할 수 있을 것이다. 또한, miR-139-3p, miR-29c-3p, miR-148a-3p, miR-30a-5p, miR-210-5p, miR-150-3p, miR-181b-5p, miR- 34a-3p, miR-29a-3p, miR-145-5p, miR-26b-ep, miR-221-3p, 및 miR-431과 같은 13종의 miRNA에서 5종 이상이 상대적 발현양이 2배 이상인 경우로 판별한 경우는 췌장암으로 판별할 수 있을 것이다. 실시예 6: 임상 miRNA 유효성 분석 miRNA가 표적하는 종양 유전자 또는 종양 억제 인자의 수에 대해서는 아직까지 명확하게 밝혀지지 않았다. 이는 다중 보상 경로의 표적화를 촉진할 수 있으므로 miRNA가 여러 유전자를 표적으로 할 수 있는 능력 있음을 의미 한다. 그러나 특정 miRNA 표적에는 암과 관련이 없는 다수의 표적뿐만 아니라 암 유전자와 종양 억제 인자가 모 두 포함되어 있다. 또한, miRNA는 특히 비 생리학적 농도에서 정상 세포 항상성 유전자를 표적하여 악영향을 미 칠 수 있는 알려지지 않은 표적을 가질 가능성이 있기 때문에 다면적인 조사가 필요하다. 이에 따라, 여러 가지 miRNA의 발현 양상을 분석하여 암을 유효성 있게 진단하고자 하였다. miRNA를 이용한 진단은 일반적으로 발현양의 차이를 비교하여 판단할 수 있다. 하지만 사람마다 발현되는 정도 가 조금씩 다르고 항상 일정하게 발현되는 micro RNA가 부족하기 때문에 절대값을 이용한 진단은 정확도가 낮을 수 있다. 또한, 상기 실시예 5와 같이 상대적 발현양을 비교하여 판단하는 것은 번거롭고 시간이 많이 소요되는 단점이 있다. 따라서 본 발명자는 상기 실시예 5를 통해 획득한 Ct 값 데이터를 이용하여 기계학습(Machine Learning)을 통해 정확도가 증가되면서 간편하고 빠르게 결과를 도출하고자 하였다. 구체적으로, 암환자 150명(폐암 50명, 대장암 50명, 췌장암 50명), 정상인 50명, 총 200명의 데이터를 이용하여 인공신경망(Artificial Neural Network, ANN) 모델을 활용한 트레이닝(Training)을 진행하여 학습된 인공지능모델을 구축하였다. 먼저, 1차로 200개 데이터 세트(1개의 데이터 세트는 상기 36종의 miRNA에 대한 Ct 값을 가지고 있음) 중 임의 로 추출한 100개의 데이터 세트를 훈련 데이터세트(training Dataset)로, 50개의 데이터 세트를 검증 데이터세 트(validation Dataset)로, 50개의 데이터 세트를 시험 데이터세트(test Dataset)로 하여 진행하였다. Output Class Label은 1: 폐암, 2: 대장암, 3: 췌장암, 4: 정상으로 부여하였다. 상기 인공신경망 모델은 은닉 계층이 1개인 단일 계층 피드포워드 네트워크(single layer feedforward network)로 구성하였으며, 활성화 함수 (activation function)는 ReLU를 이용하였고, 은닉 계층 내의 노드(neuron)는 40개의 hidden neuron이 사용되 었다. 그 다음, 2차로 200개 데이터 세트 중 임의로 추출한 140개 데이터 세트를 훈련 데이터세트(Training Dataset) 로, 30개 데이터 세트를 검증 데이터세트(Validation Dataset)로, 30개 데이터 세트를 시험 데이터세트(Test Dataset)로 진행하였으며, 그 결과 최종 정확도는 97%로 나타났다([도 9] 참조). 상기 학습된 인공지능 모델에 암환자 50명 및 정상인 20명을 대상으로 각각 바이오칩 시스템에 의해 도출된 36 종의 miRNA에 대한 Ct 값을 1개의 데이터세트로 하여 입력하고 출력한 결과 암환자 50명 중 49명, 정상인 20명 중 19명에 대해 암환자 및 정상인으로 정상적으로 진단하여 98% 민감도(Sensitivy)와 95%의 특이도 (Specificity)를 보였다([도 10] 및 [도 11] 참조). 또한, 암종 구분에 있어서도 정상인 20명 중 1명에서 췌장 암으로 오진하고, 19명을 정상으로 판정하고, 폐암 21명 중 1명을 정상으로 오진하고 20명을 폐암으로 정상 판 정하였으며, 췌장암 29명 중에서는 1명을 대장암으로 오진하고 28명을 정확히 판정하여 암종 구분능에 있어서도 95.7%의 높은 정확도를 나타내었다([도 12] 참조). 따라서, 상기 구축한 인공지능 모델을 이용하여 샘플에 대한 36종의 miRNA의 Ct 값으로부터 암종을 정확하게 진 단 및 예후 예측을 할 수 있을 것이다."}
{"patent_id": "10-2023-0146422", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따라 대장암 환자의 혈액에서 추출한 miRNA로서 기준 유전자(reference gene)의 검출 결과를 나타낸 그림이다. 도 2는 본 발명의 일 실시예에 따라 췌장암 환자의 혈액에서 추출한 miRNA로서 기준 유전자(reference gene)의 검출 결과를 나타낸 그림이다. 도 3은 본 발명의 일 실시예에 따라 RefFinder 프로그램을 이용하여 대장암 및 췌장암의 기준 유전자(reference gene)의 스크리닝 결과를 나타낸 그림이다. 도 4는 본 발명의 일 실시예에 따라 혈액에서 분리한 암 종별 miRNA 타겟 37종에 대한 분석 가능성 여부를 확인 한 그림이다. 도 5는 본 발명의 일 실시예에 따라 혈액에서 분리한 암 종별 miRNA 타겟으로 폐암 miR-29b-3p, 췌장암 miR- 223-3p, 대장암 miR-92a-3p, internal control(reference gene) miR-103-3p에 대한 환자 및 정상인과의 발현 양상을 비교한 그림이다. 도 6은 본 발명의 일 실시예에 따라 제조된 96well plate 바이오칩의 구성도를 나타낸 그림이다. 도 7은 본 발명의 일 실시예에 따라 혈액에서 분리한 암 종별 miRNA 타겟 37종에 대한 Ct 값의 평균과 표준편차 를 나타낸 그림이다. 도 8은 본 발명의 일 실시예에 따라 혈액에서 분리한 암 종별 miRNA 타겟 37종에 대한 Ct 값의 평균을 정상인의 Ct 값을 기준으로 하여 miRNA의 발현양을 수치로 나타낸 그림이다. X축은 표 11에 기재된 miRNA의 순서대로 나 열하였으며, Y축은 정상인을 기준으로 한 상대적인 발현양이다. 파란색은 폐암, 주황색은 대장암, 회색은 췌장 암으로 표시하였다. 도 9는 본 발명의 일 실시예에 따라 인공지능 모델을 구축하기 위하여 훈련 세트, 검증 세트, 시험 세트, 및 이 들의 혼합에 대한 매트릭스를 나타낸 그림이다. 도 10은 본 발명의 일 실시예에 따라 바이오칩 시스템에 의해 도출된 정상 20명 및 암 환자 50명의 각 Ct 값을기준으로 학습된 인공지능 모델로부터 도출된 암 진단 결과의 분포도를 나타낸 그림이다. 도 11은 본 발명의 일 실시예에 따라 바이오칩 시스템에 의해 도출된 정상 20명 및 암 환자 50명의 각 Ct 값을 기준으로 학습된 인공지능 모델로부터 도출된 암 진단 결과의 특이도 및 민감도를 나타낸 그림이다. 도 12는 본 발명의 일 실시예에 따라 바이오칩 시스템에 의해 도출된 정상 20명 및 암 환자 50명의 각 Ct 값을 기준으로 학습된 인공지능 모델로부터 도출된 암 진단의 정확도를 나타낸 그림이다."}
