{"patent_id": "10-2019-0140014", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0054191", "출원번호": "10-2019-0140014", "발명의 명칭": "치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템", "출원인": "이권영", "발명자": "이권영"}}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "치매관리 자동화 장치가 수행하는 치매관리 자동화 방법으로서, 표준 정신상태검사에 포함되는 제1 검사항목에 대응하는 문구를 표시되는 캐릭터와 연동하여 음성으로 출력하는단계;상기 제1 검사항목의 문구에 대한 응답을 음성으로 수신하는 단계; 및 상기 응답 음성에 대한 음성 인식으로 상기 제1 검사항목의 응답평가를 수행하는 단계;를 포함하고,상기 문구의 음성은 수검자의 귀에 착용하는 헤드셋 또는 이어셋으로 출력되는,치매관리 자동화 방법."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 표준 정신상태검사는 한국형 간이 정신상태검사(Korean Mini Mental State Examination)인,치매관리 자동화 방법."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 한국형 간이 정신상태검사에 포함되는 제2 검사항목에 대응하는 문구를 표시되는 캐릭터와 연동하여 음성으로 출력하는 단계;상기 제2 검사항목의 문구에 대한 응답을 영상으로 수신하는 단계;상기 응답 영상에 대한 분석을 통해 상기 제2 검사항목의 응답평가를 수행하는 단계; 및 상기 제1 검사항목의 응답평가와 상기 제2 검사항목의 응답평가를 이용하여 수검자의 정신상태를 분류하는단계;를 더 포함하는, 치매관리 자동화 방법."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제2 검사항목의 응답평가를 수행하는 단계는 학습된 인공지능 프로그램을 통해 이루어지고,상기 치매관리 자동화 방법은, 상기 제2 검사항목의 응답평가를 수행하는 단계 이전에, 상기 제2 검사항목에 관련되어 먼저 촬영된 복수 영상과 각 영상에 매칭되는 복수의 평가정보를 이용하여 상기 인공지능 프로그램을 학습시키는 단계;를 더 포함하는,치매관리 자동화 방법."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 캐릭터와 연동하여 음성으로 출력하는 단계 이전에,캐릭터 생성에 이용될 영상 이미지를 상기 수검자의 입력에 따라 수신하는 단계; 및 상기 영상 이미지로부터 상기 캐릭터를 생성하는 단계;를 더 포함하고,공개특허 10-2021-0054191-3-상기 캐릭터의 형상은 상기 수검자의 상기 표준 정신상태검사 진행을 안내하고 검사항목의 문구 음성에 연동하여 변동되는, 치매관리 자동화 방법."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 캐릭터와 연동하여 음성으로 출력하는 단계 이전에,수검자 인증을 위한 복수의 사이트 이미지를 표시하는 단계;상기 복수의 사이트 이미지 중 하나의 이미지에 대해 선택 입력을 수신하고 선택된 사이트로 연결하기 위한 로그인 입력을 수신하는 단계;로그인 인력에 따라 선택된 사이트에 연결하고 상기 수검자의 휴대형 단말에 표시된 인증 데이터의 입력에 따라상기 수검자를 인증하는 단계; 및 상기 선택된 사이트로부터 수검자 정보를 수신하는 단계;를 더 포함하며,상기 수검자 정보는 상기 제1 검사항목의 응답평가와 상기 제2 검사항목의 응답평가에 매칭되는, 치매관리 자동화 방법."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "수검자의 귀에 착용하도록 구성되어 음성을 출력하는 오디오신호 출력부; 상기 수검자의 음성을 수신하는 오디오신호 수신부; 상기 수검자가 인식 가능한 이미지를 출력하는 디스플레이부; 및 상기 수검자에 대해 표준 정신상태검사를 수행하는 제어부;를 포함하고, 상기 제어부는 상기 표준 정신상태검사에 포함되는 제1 검사항목에 대응하는 문구를 나타내는 음성을 상기 오디오신호 출력부를 통해 출력함과 동시에 상기 음성에 연동하여 형상이 변경되는 캐릭터의 이미지신호를 상기 디스플레이부로 출력하며 상기 문구에 대한 응답으로서 상기 오디오신호 수신부를 통해 수신되는 음성에 대한 음성 인식으로 상기 제1 검사항목의 응답평가를 수행하는, 치매관리 자동화 장치."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 표준 정신상태검사는 한국형 간이 정신상태검사(Korean Mini Mental State Examination)인,치매관리 자동화 장치."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 카메라렌즈를 통해 노출되는 영상을 촬영하는 영상 촬영부;를 더 포함하고,상기 제어부는 상기 표준 정신상태검사에 포함되는 제2 검사항목에 대응하는 문구를 나타내는 음성을 상기 오디오신호 출력부를 통해 출력함과 동시에 상기 음성에 연동하여 형상이 변경되는 캐릭터의 이미지신호를 상기 디스플레이부로 출력하며 상기 문구에 대한 응답을 나타내는 영상을 상기 영상 촬영부로부터 수신하고 상기 영상에 대한 분석을 통해 상기 제2 검사항목의 응답평가를 수행하고 제1 검사항목의 응답평가와 상기 제2 검사항목의 응답평가를 이용하여 상기 수검자의 정신상태를 분류하는,치매관리 자동화 장치."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2021-0054191-4-제9항에 있어서, 상기 제2 검사항목의 응답평가를 수행하는 인공지능 프로그램을 저장하는 저장부;를 더 포함하고, 상기 제어부는, 상기 인공지능 프로그램을 이용한 상기 제2 검사항목의 응답평가의 수행 이전에, 상기 제2 검사항목에 관련되어 먼저 촬영된 복수 영상과 각 영상에 매칭되는 복수의 평가정보를 이용하여 상기 인공지능 프로그램을 학습시키는, 치매관리 자동화 장치."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,터치 입력을 포함하여 수검자 입력을 수신하는 입력부;를 더 포함하고, 상기 제어부는, 검사항목의 문구에 대응하는 캐릭터와 음성을 출력하기 전에, 상기 입력부를 통한 선택으로 캐릭터 생성에 이용될 영상 이미지를 결정하고 결정된 영상 이미지로부터 캐릭터를 생성하며,상기 캐릭터의 형상은 상기 수검자의 상기 표준 정신상태검사 진행을 안내하고 검사항목의 문구 음성에 연동하여 변동되는, 치매관리 자동화 장치."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,터치 입력을 포함하여 수검자 입력을 수신하는 입력부; 및 통신망을 통해 데이터를 송수신하는 통신부;를 더 포함하고, 상기 제어부는, 검사항목의 문구에 대응하는 캐릭터와 음성을 출력하기 전에, 수검자 인증을 위한 복수의 사이트 이미지를 상기 디스플레이부를 통해 표시하고 상기 복수의 사이트 이미지 중 하나의 이미지에 대한 선택 입력과 선택된 사이트로 연결하기 위한 로그인 입력을 상기 입력부를 통해 수신하며 로그인 인력에 따라 선택된사이트에 상기 통신부를 통해 연결하고 상기 입력부를 통해 입력되는 인증 데이터에 따라 상기 수검자를 인증하고 상기 선택된 사이트로부터 수검자 정보를 상기 통신부를 통해 수신하며, 상기 수검자 정보는 상기 제1 검사항목의 응답평가와 상기 제2 검사항목의 응답평가에 매칭되는, 치매관리 자동화 장치."}
{"patent_id": "10-2019-0140014", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제7항에 따른 복수의 치매관리 자동화 장치; 및 통신망을 통해 상기 복수의 치매관리 자동화 장치에 연결되어 상기 복수의 치매관리 자동화 장치를 관리하는 중앙관리 서버;를 포함하는, 치매관리 자동화 시스템."}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 양상에 따른 치매관리 자동화 방법은 표준 정신상태검사에 포함되는 제1 검사항목에 대응하는 문구 를 표시되는 캐릭터와 연동하여 음성으로 출력하는 단계, 제1 검사항목의 문구에 대한 응답을 음성으로 수신하는 단계 및 응답 음성에 대한 음성 인식으로 제1 검사항목의 응답평가를 수행하는 단계를 포함하고, 문구의 음성은 수검자의 귀에 착용하는 헤드셋 또는 이어셋으로 출력된다."}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템에 관한 것으로서 수검자의 개인 정보 노출을 방지하면서 표준화된 치매검사를 자동화하여 효율적인 치매검사 서비스를 제공할 수 있는 치 매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템에 관한 것이다."}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지능, 의지, 기억 등 정신적 능력의 현저한 감퇴가 수반되는 치매는 노인 인구의 증가에 따라 중요한 사회적 문 제로 대두하고 있다. 치매를 앓고 있는 본인뿐 아니라 그 가족들에게 많은 부담을 안기고 있다. 이러한 치매 문제를 예방하고 해결하기 위해, 각 시,도,군의 보건소에 치매안심센터가 설립되어 치매 관리를 위 한 다양한 활동을 펼치고 있다. 전국 치매안심센터를 통해 검사되는 수검자 수가 연간 약 100만 명에 이르고 있 고 이에 따라 치매안심센터의 등록관리팀이나 조기검진팀은 막대한 업무와 스트레스를 받고 있는 실정이다. 치매안심센터에서 수검자는 각종 동의서, 개인인적정보, 선별검사지, 기초상담지, 심층상담지 등 각종 서식을 작성해야 하고 대략 1인당 10장 내외의 서류를 작성하며 치매검사를 담당하거나 관리하는 피수검자는 10장 내외 의 서류에 대해 평가, 분류, 분석 작업을 진행한다. 이러한 기존의 방식에 따라, 수검자에 의한 서류 작성의 부정확성, 피수검자의 숙련도에 따른 부정확성으로 인 해 다양한 문제점이 발생한다. 특히, 수검자와 피수검자가 대면하여 치매검사, 간이검사가 이루어지는 것이 일 반적이다. 이와 같이 치매관리에 있어 노출되는 다양한 문제점을 해소할 수 있는 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 10-1634619(B1), 2016년06월29일"}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 상술한 문제점을 해결하기 위해서 안출한 것으로서, 페이퍼와 수작업으로 이루어지던 표준화된 치매 검사를 자동화하고 IT기술을 통해 관리 가능한 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동 화 시스템을 제공하는 데 목적이 있다. 또한, 본 발명은 음성 출력, 터치 입력, 음성 인식 및 학습된 인공지능 기술을 통해 수검자에 대해 표준화된 치 매 검사를 문답형식으로 자동 수행할 수 있는 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템을 제공하는 데 목적이 있다. 또한, 본 발명은 수검자 관련 캐릭터를 이용한 상담 형식으로 치매 검사가 이루어져 수검자 친화적으로 검사가 이루어지고 다른 외부 사이트와 연계하여 수검자 관련 정보를 획득하고 수검자를 검사된 치매정보에 링크시킬 수 있는 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템을 제공하는 데 목적이 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 양상에 따라 치매관리 자동화 장치가 수행하는 치매관리 자동화 방법은 표준 정신상태검사에 포함 되는 제1 검사항목에 대응하는 문구를 표시되는 캐릭터와 연동하여 음성으로 출력하는 단계; 상기 제1 검사항목 의 문구에 대한 응답을 음성으로 수신하는 단계; 및 상기 응답 음성에 대한 음성 인식으로 상기 제1 검사항목의 응답평가를 수행하는 단계;를 포함하고, 상기 문구의 음성은 수검자의 귀에 착용하는 헤드셋 또는 이어셋으로 출력된다. 상기한 치매관리 자동화 방법에 있어서, 상기 표준 정신상태검사는 한국형 간이 정신상태검사(Korean Mini Mental State Examination)이다. 상기한 치매관리 자동화 방법에 있어서, 상기 한국형 간이 정신상태검사에 포함되는 제2 검사항목에 대응하는 문구를 표시되는 캐릭터와 연동하여 음성으로 출력하는 단계; 상기 제2 검사항목의 문구에 대한 응답을 영상으 로 수신하는 단계; 상기 응답 영상에 대한 분석을 통해 상기 제2 검사항목의 응답평가를 수행하는 단계; 및 상 기 제1 검사항목의 응답평가와 상기 제2 검사항목의 응답평가를 이용하여 수검자의 정신상태를 분류하는 단계;를 더 포함한다. 상기한 치매관리 자동화 방법에 있어서, 상기 제2 검사항목의 응답평가를 수행하는 단계는 학습된 인공지능 프 로그램을 통해 이루어지고, 상기 치매관리 자동화 방법은, 상기 제2 검사항목의 응답평가를 수행하는 단계 이전 에, 상기 제2 검사항목에 관련되어 먼저 촬영된 복수 영상과 각 영상에 매칭되는 복수의 평가정보를 이용하여 상기 인공지능 프로그램을 학습시키는 단계;를 더 포함한다. 상기한 치매관리 자동화 방법에 있어서, 상기 캐릭터와 연동하여 음성으로 출력하는 단계 이전에, 캐릭터 생성 에 이용될 영상 이미지를 상기 수검자의 입력에 따라 수신하는 단계; 및 상기 영상 이미지로부터 상기 캐릭터를 생성하는 단계;를 더 포함하고, 상기 캐릭터의 형상은 상기 수검자의 상기 표준 정신상태검사 진행을 안내하고 검사항목의 문구 음성에 연동하여 변동된다. 상기한 치매관리 자동화 방법에 있어서, 상기 캐릭터와 연동하여 음성으로 출력하는 단계 이전에, 수검자 인증 을 위한 복수의 사이트 이미지를 표시하는 단계; 상기 복수의 사이트 이미지 중 하나의 이미지에 대해 선택 입 력을 수신하고 선택된 사이트로 연결하기 위한 로그인 입력을 수신하는 단계; 로그인 인력에 따라 선택된 사이 트에 연결하고 상기 수검자의 휴대형 단말에 표시된 인증 데이터의 입력에 따라 상기 수검자를 인증하는 단계; 및 상기 선택된 사이트로부터 수검자 정보를 수신하는 단계;를 더 포함하며, 상기 수검자 정보는 상기 제1 검사 항목의 응답평가와 상기 제2 검사항목의 응답평가에 매칭된다. 또한, 본 발명의 일 양상에 따른 치매관리 자동화 장치는 수검자의 귀에 착용하도록 구성되어 음성을 출력하는 오디오신호 출력부; 상기 수검자의 음성을 수신하는 오디오신호 수신부; 상기 수검자가 인식 가능한 이미지를 출력하는 디스플레이부; 및 상기 수검자에 대해 표준 정신상태검사를 수행하는 제어부;를 포함하고, 상기 제어 부는 상기 표준 정신상태검사에 포함되는 제1 검사항목에 대응하는 문구를 나타내는 음성을 상기 오디오신호 출 력부를 통해 출력함과 동시에 상기 음성에 연동하여 형상이 변경되는 캐릭터의 이미지신호를 상기 디스플레이부 로 출력하며 상기 문구에 대한 응답으로서 상기 오디오신호 수신부를 통해 수신되는 음성에 대한 음성 인식으로 상기 제1 검사항목의 응답평가를 수행한다. 상기한 치매관리 자동화 장치에 있어서, 상기 표준 정신상태검사는 한국형 간이 정신상태검사(Korean Mini Mental State Examination)이다. 상기한 치매관리 자동화 장치에 있어서, 카메라렌즈를 통해 노출되는 영상을 촬영하는 영상 촬영부;를 더 포함 하고, 상기 제어부는 상기 표준 정신상태검사에 포함되는 제2 검사항목에 대응하는 문구를 나타내는 음성을 상 기 오디오신호 출력부를 통해 출력함과 동시에 상기 음성에 연동하여 형상이 변경되는 캐릭터의 이미지신호를 상기 디스플레이부로 출력하며 상기 문구에 대한 응답을 나타내는 영상을 상기 영상 촬영부로부터 수신하고 상 기 영상에 대한 분석을 통해 상기 제2 검사항목의 응답평가를 수행하고 제1 검사항목의 응답평가와 상기 제2 검 사항목의 응답평가를 이용하여 상기 수검자의 정신상태를 분류한다. 상기한 치매관리 자동화 장치에 있어서, 상기 제2 검사항목의 응답평가를 수행하는 인공지능 프로그램을 저장하 는 저장부;를 더 포함하고, 상기 제어부는, 상기 인공지능 프로그램을 이용한 상기 제2 검사항목의 응답평가의 수행 이전에, 상기 제2 검사항목에 관련되어 먼저 촬영된 복수 영상과 각 영상에 매칭되는 복수의 평가정보를 이용하여 상기 인공지능 프로그램을 학습시킨다. 상기한 치매관리 자동화 장치에 있어서, 터치 입력을 포함하여 수검자 입력을 수신하는 입력부;를 더 포함하고, 상기 제어부는, 검사항목의 문구에 대응하는 캐릭터와 음성을 출력하기 전에, 상기 입력부를 통한 선택으로 캐 릭터 생성에 이용될 영상 이미지를 결정하고 결정된 영상 이미지로부터 캐릭터를 생성하며, 상기 캐릭터의 형상 은 상기 수검자의 상기 표준 정신상태검사 진행을 안내하고 검사항목의 문구 음성에 연동하여 변동된다. 상기한 치매관리 자동화 장치에 있어서, 터치 입력을 포함하여 수검자 입력을 수신하는 입력부; 및 통신망을 통 해 데이터를 송수신하는 통신부;를 더 포함하고, 상기 제어부는, 검사항목의 문구에 대응하는 캐릭터와 음성을 출력하기 전에, 수검자 인증을 위한 복수의 사이트 이미지를 상기 디스플레이부를 통해 표시하고 상기 복수의 사이트 이미지 중 하나의 이미지에 대한 선택 입력과 선택된 사이트로 연결하기 위한 로그인 입력을 상기 입력 부를 통해 수신하며 로그인 인력에 따라 선택된 사이트에 상기 통신부를 통해 연결하고 상기 입력부를 통해 입 력되는 인증 데이터에 따라 상기 수검자를 인증하고 상기 선택된 사이트로부터 수검자 정보를 상기 통신부를 통 해 수신하며, 상기 수검자 정보는 상기 제1 검사항목의 응답평가와 상기 제2 검사항목의 응답평가에 매칭된다. 또한, 본 발명의 일 양상에 따른 치매관리 자동화 시스템은 상기한 복수의 치매관리 자동화 장치; 및 통신망을 통해 상기 복수의 치매관리 자동화 장치에 연결되어 상기 복수의 치매관리 자동화 장치를 관리하는 중앙관리 서버;를 포함한다."}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따른 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템은 페이퍼 와 수작업으로 이루어지던 표준화된 치매검사를 자동화하고 IT기술을 통해 관리 가능한 효과가 있다. 또한, 상기와 같은 본 발명에 따른 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템은 음성 출력, 터치 입력, 음성 인식 및 학습된 인공지능 기술을 통해 수검자에 대해 다양한 유형을 가지고 표준화 된 각종 치매 검사를 문답형식으로 자동 수행할 수 있는 효과가 있다. 또한, 상기와 같은 본 발명에 따른 치매관리 자동화 방법, 치매관리 자동화 장치 및 치매관리 자동화 시스템은 수검자 관련 캐릭터를 이용한 상담 형식으로 치매 검사가 이루어져 수검자 친화적으로 그 검사가 이루어지고 다 른 외부 사이트와 연계하여 수검자 관련 정보를 획득하고 수검자를 검사된 치매정보에 링크시킬 수 있는 효과가 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술 되어 있는 상세한 설명을 통하여 더욱 명"}
{"patent_id": "10-2019-0140014", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "확해 질 것이며, 그에 따라 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 또한, 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적 인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를 상세히 설명하기로 한다. 도 1은 예시적인 치매관리 자동화 시스템을 도시한 도면이다. 도 1에 따르면, 치매관리 자동화 시스템은 중앙관리 서버, 하나 이상의 사이트 서버 및 하나 이상의 치매관리 자동화 장치를 포함한다. 중앙관리 서버, 사이트 서버 및 치매관리 자동화 장치 는 통신망을 통해 서로 연결되어 각종 데이터를 송수신할 수 있다. 치매관리 자동화 시스템은 적어도 기존에 표준화된 하나 이상의 검사를 음성과 영상 출력, 이에 대한 음성(영상) 응답 및 인식과 나아가 인공지능 기술을 활용하여 자동화하고, 자동화된 검사 결과를 수검자의 수검 자 정보에 매칭시켜 저장하고 이후 활용할 수 있도록 구성된다. 설계 예에 따라 다양한 변형 예가 있을 수 있다. 치매관리 자동화 장치는 단일 기기로 구성되거나 통신망 으로 연결되는 복수의 기기로 구성될 수 있다. 예를 들어, 치매관리 자동화 장치는 수검자의 입력에 따라 동작하고 음성이나 영상을 입출력하는 기기와 수검자의 응답에 대한 응답평가 등의 산출을 위해 음성 인식이나 인공지능 기술을 적용한 기기가 동일 장치에, 또는 별도로 구성될 수 있다. 별도로 구성되는 경우, 음성 인식이 나 인공지능 기술 등을 적용한 기기는 중앙관리 서버이거나 중앙관리 서버를 구성하는 하드웨어 플랫 폼이나 장치 내에 내장될 수 있다. 도 1을 통해, 치매관리 자동화 시스템을 간단히 살펴보면, 중앙관리 서버는 통신망을 통해 하나 이상의(바 람직하게는 복수의) 치매관리 자동화 장치에 연결되어 치매관리 자동화 장치를 관리한다. 중앙관리 서버는 수검자 DB를 구비하여 각종 치매관련 정보를 수검자 정보에 매칭시켜 저장하고 치매관리 자동화 장치, 나아가 병원 등에 구축된 서버나 기기와 수검자별 치매관련 정보를 공유할 수 있도록 구성된 다. 수검자 DB의 각각의 수검자 엔트리는 사용자(수검자)를 식별하고 수검자에 관련된 정보를 포함하는 수검자 정보 를 포함한다. 수검자 정보는 예를 들어, 이름, 주민번호, 휴대전화번호, 성별 등을 포함할 수 있다. 수검자 엔 트리는 하나 이상의 검사 서브 엔트리와 정신상태 정보를 포함한다. 각각의 검사 서브 엔트리는 수검자에 의해 이루어진 검사를 특정할 수 있는 검사 식별자, 검사에 따른 상태 분류, 각 검사항목별 응답평가 등을 포함할 수 있다. 정신상태 정보는 검사에 따라 특정된 수검자의 정신 분류 상태를 나타낼 수 있고 예를 들어, 정상, 치매, 치매의심 등을 특정할 수 있도록 구성된다. 하나의 검사 서브 엔트리는 한국형 간이 정신상태검사(Korean Mini Mental State Examination)에 따른 검사 정 보를 저장하고 다른 하나의 검사 서브 엔트리는 전문(심층) 정신진단검사에 따른 검사 정보를 저장하고 또 다른 검사 서브 엔트리는 기초 상담이나 다른 전문 상담에 따른 검사 정보를 저장할 수 있다. 검사 서브 엔트리와 정 신상태 정보는 치매관리 자동화 장치와 연동하여 갱신, 추가, 변경 될 수 있다. 사이트 서버는 수검자가 액세스할 수 있는 서버이다. 사이트 서버는 포털 서버, SNS 서버 등일 수 있 다. 예를 들어, 사이트 서버는 구글 서버, 카카오 서버, 네이버 서버, 페이스북 서버 등일 수 있다. 사이 트 서버는 적어도 ID와 패스워드나 인증 수단을 저장하고 나아가 ID에 연계되어 있는 사용자(수검자) 정보 를 저장한다. 사이트 서버는 수검자(사용자) 인증에 따라 중앙관리 서버로 인증된 수검자의 정보를 전송할 수 있다. 치매관리 자동화 장치는 각종 입출력 수단을 구비하여 기존의 표준화된 검사(정신상태검사)를 자동화할 수 있는 기기이다. 치매관리 자동화 장치는 음성 입출력, 영상 입(출)력, 터치 입력 등을 이용하여 수검자로 부터 각종 입력을 수신하고 입력에 대한 평가를 음성 인식, 인공지능 기술 등을 이용하여 수행하고 평가에 대한 결과를 저장하거나 중앙관리 서버로 전송할 수 있도록 구성된다. 치매관리 자동화 장치에 대해서는 도 4와 도 5 등을 통해 상세히 살펴보도록 한다. 통신망은 기기나 장치 사이에서 각종 데이터를 송수신한다. 통신망은 로컬 통신망과 광대역 통신망(예를 들어, 이동통신망, 기간 통신망)의 하나 이상의 조합으로 구성될 수 있다. 통신망은 인터넷망일 수 있다. 통신망을 통 해, 치매관리 자동화 장치, 중앙관리 서버 및/또는 사이트 서버는 각종 데이터를 서로 송수신할 수 있다. 도 2는 치매관리를 위한 예시적인 흐름을 도시한 도면이다. 도 2의 치매관리 흐름은 각종 기관과의 협업에 따라 이루어진다. 예를 들어, 보건소, 병원 등의 협업에 따라 기 초 조사, 간이 검사, 심층 검사 등이 이루어진다. 도 2의 치매관리 흐름 중 적어도 일부는 자동화되고 일부는 피수검자나 관리자에 의해서 이루어질 수 있다. 먼저, 치매관리 자동화 장치는 수검자를 특정하기 위해 사이트 서버의 계정에 연결(① 참조)한다. 예 를 들어, 치매관리 자동화 장치는 네이버, 카카오, 구글 등이 운영하는 사이트 서버의 계정에 연결하 고 해당 사이트 서버에서 수검자 인증과 그에 따른 수검자 정보를 통신망을 통해 수신할 수 있다. 이후, 피수검자(치매검사 등을 수행하는 간호사, 직원, 의사, 관리자 등)는 1단계 분류를 통해 수검자가 치매환 자인지 조기검진이 필요한지 또는 단순상담자인지를 분류할 수 있다. 피수검자는 기초상담(지)을 통해 수검자를 기초 분류할 수 있다. 또는, 치매관리 자동화 장치는 기초상담지에 대응하는 음성 문구의 출력과 음성 응 답의 수신으로 치매확진환자인지 검진 희망자인지 또는 단순 상담자인지를 분류할 수 있다. 검진 희망에 따라 조기검진이 필요한 경우, 치매관리 자동화 장치는 정신상태 분류를 위한 선별검사를 수 행(② 참조)할 수 있다. 치매관리 자동화 장치는 표준화된 정신상태검사를 수행하여 수검자의 상태를 분류 할 수 있다. 표준화된 정신상태검사란 일반적으로(국내 또는 국제적으로) 널리 활용되는 검사 방법이나 방식을 나타낼 수 있고 예를 들어 한국형 간이 정신상태검사(Korean Mini Mental State Examination : K-MMSE)일 수 있다. 도 3은 K-MMSE의 검사 양식의 일 예를 나타낸다. 기존의 K-MMSE는 페이퍼로 구성되어 피수검자가 안내, 요청 또 는 질문을 하여 검사지에 그 응답을 수기로 기록하고 피수검자는 평가를 해서 수검자가 정상인지, 치매인지 또 는 치매의심인지를 분류한다. 도 3에서 알 수 있는 바와 같이, K-MMSE 검사지는 다수의 검사항목으로 구성되고 각각의 검사항목(예를 들어, 지남력, 기억등록, 주의집중 및 계산, 기억 회상, 언어 및 시공간 구성 등)에 대한 평가를 점수로 계산하고 모 든 검사항목에 대해 획득된 점수의 합산과 합산된 점수의 귀속 분류(확정적 정상, 치매의심, 확정적 치매)로 치 매관련 정신상태를 분류할 수 있다. 기존의 K-MMSE 검사지의 이용과 달리, 본 발명에 따른 치매관리 자동화 장치는 이러한 K-MMSE와 같은 표준 정신상태검사를 자동화하여 평가하고 평가결과에 따라 분류하고 수검자를 분류에 매칭시킬 수 있도록 구성된다. 이에 대해서는 도 3과 연계한 도 5의 설명에서 상세히 살펴보도록 한다. 치매관리 자동화 장치는 선별검사에 따른 분류로 정상인지 인지저하인지 등 수검자의 정신상태를 분류하고 그에 따른 대응 액션을 취할 수 있다. 예를 들어, 치매관리 자동화 장치는 정상으로 판별된 수검자의 정보 와 검사 결과를 매칭시켜 중앙관리 서버의 수검자 DB 등에 저장하고 지정된 년마다(예를 들어, 2년) 선별 검사를 수행 유도할 수 있다. 또는, 치매관리 자동화 장치는 인지저하(치매의심 또는 확정적 치매)로 판정된 수검자를 고위험군의 집중 검진 대상자로 분류할 수 있다. 예를 들어, 치매관리 자동화 장치는 중앙관리 서버와 연동하여 수검 자 DB의 수검자 엔트리 중 수검자의 수검자 정보를 가지는 엔트리에 검사 서브 엔트리를 구성하여 검사에 따른 정신상태 분류, 각 검사항목별 응답평가를 기록하고 심층 검사가 필요함을 기록할 수 있다. 중앙관리 서버는 보건소나 병원 등으로 심층 검사를 요청할 수 있고 보건소 등에서 신경인지검사 등의 표 준화된 검사와 전문의 진료를 수행(④ 참조)하고 협약병원은 혈액검사, 뇌영상 등을 촬영하고 그 진료 결과를 중앙관리 서버의 수검자 DB에 기록(⑤ 참조)할 수 있다. 도 2에서 알 수 있는 바와 같이, 치매관리를 위해서는 여러 기관과의 협업이 필요하고 여러 기관에서 서로 다른 검사가 이루어질 수 있다. 치매관리 자동화 장치는 기존 검사지로 이루어지던 동일한 검사를 자동화할 수 있고 적어도 K-MMSE 검사를 음성 출력, 음성 인식, 터치 입력 등을 통해 자동화할 수 있도록 구성된다. 치매관 리 자동화 장치는 그 외 표준 정신상태검사를 자동화시킬 수 있다. 도 4는 치매관리 자동화 장치의 예시적인 블록도를 도시한 도면이다. 도 4에 따르면, 치매관리 자동화 장치는 영상 촬영부, 오디오신호 수신부, 입력부, 통신부 , 저장부, 오디오신호 출력부, 디스플레이부 및 제어부를 포함한다. 설계 변형에 따 라 도 4의 일부 블록이 생략되거나 치매관리 자동화 장치에 더 포함될 수 있다. 도 4를 통해 치매관리 자동화 장치를 살펴보면, 영상 촬영부는 카메라렌즈, 카메라센서 등을 구비하 여 치매관리 자동화 장치 외부의 카메라렌즈를 통해 노출되는 영상을 촬영하고 촬영된 영상신호를 제어부 로 전송한다. 카메라센서는 CCD 센서나 CMOS 이미지 센서 등일 수 있고 실시간으로 촬영된 영상을 영상 촬 영부가 제어부로 약속된 포맷에 따른 영상신호로 전송할 수 있다. 오디오신호 수신부는 치매관리 자동화 장치 외부의 오디오를 캡쳐링한다. 오디오신호 수신부는 적어도 치매관리 자동화 장치를 이용하는 수검자의 음성을 수신할 수 있도록 구성된다. 오디오신호 수신부 는 마이크와 오디오 ADC 등을 구비하여 수검자의 음성 등을 전기신호로 변환하고 변환된 음성신호에 대응 하는 일련의 음성데이터를 제어부로 출력할 수 있다. 입력부는 사용자 입력을 수신한다. 입력부는 수검자로부터의 입력을 수신할 수 있도록 구성되고 예를 들어 수검자에 의한 터치 입력을 수신할 수 있다. 입력부는 터치 패드, 디스플레이에 결합되는 터치 스크 린, 수검자 선택 가능한 터치 버튼 등과 나아가 다른 각종 입력 수단(예를 들어, 키보드, 버튼, 마우스, 전자펜 등)을 포함하여 수검자로부터의 각종 입력을 수신할 수 있다. 통신부는 통신망을 통해 데이터를 송수신한다. 통신부는 이더넷, 와이파이, 광랜 등과 인터페이스하 기 위한 통신 칩셋 등을 포함하여 로컬 통신망과 광대역 통신망을 통해 중앙관리 서버 및/또는 사이트 서 버와 각종 데이터를 송수신할 수 있다.저장부는 휘발성 메모리, 비휘발성 메모리 및/또는 하드디스크 등의 대용량 저장매체를 포함하여 각종 데 이터, 정보, 프로그램 등을 저장한다. 예를 들어, 저장부는 수검자에 의해 이루어지고 있는 검사 정보, 검 사 결과, 검사를 진행하기 위한 프로그램 (모듈)을 저장한다. 특정 프로그램은 음성 인식 프로그램이거나 인공 지능 프로그램일 수 있다. 임의의 표준 정신상태검사의 검사항목들 중 적어도 하나의 검사항목은 음성 인식을 통해 평가가 이루어지고 다른 적어도 하나의 검사항목은 인공지능 프로그램에 의한 판단으로 그 응답평가가 수 행될 수 있다. 설계 예에 따라 음성 인식 프로그램은 인공지능 프로그램 내에 내장될 수 있다. 그 외, 저장부는 검사를 진행하기 위한 제어 프로그램을 포함한다. 제어 프로그램에 의해 검사과정이 진행 및 제어되고 필요에 따라 음성 인식 프로그램이나 인공지능 프로그램이 구동, 제어 및 평가가 이루어질 수 있다. 오디오신호 출력부는 수검자가 들을 수 있는 오디오를 출력한다. 오디오신호 출력부는 수검자의 귀에 착용할 수 있도록 구성되어 수검자가 귀로 들을 수 있는 음성을 출력한다. 예를 들어, 오디오신호 출력부 는 수검자의 귀에 착용하는 헤드셋이나 이어셋을 포함하고 나아가 제어부로부터 수신되는 일련의 음성데이 터를 전기신호로 변환하기 위한 오디오 DAC를 포함한다. 오디오신호 출력부가 헤드셋이나 이어셋을 포함하여 안내, 질문, 요청 등을 출력하고 입력부의 터치 입력을 통해 수검자 응답을 수신토록 하여, 수검자는 다른 사용자에게 개인 정보, 신상 정보, 검사 입력 정보의 노출 없이 검사를 안전하게 수행할 수 있다. 디스플레이부는 수검자가 인식 가능한 이미지를 출력한다. 디스플레이부는 LCD, LED, TFT-LCD 등의 디스플레이를 포함하여 제어부로부터 수신되는 일련의 이미지신호를 변환하여 디스플레이에 표시한다. 제어부는 치매관리 자동화 장치를 제어한다. 제어부는 프로그램의 명령어 코드를 실행할 수 있 는 실행 유닛(Execution Unit)을 하나 이상 포함하여 저장부에 저장되어 있는 프로그램의 명령어 코드를 실행하여 치매관리 자동화 장치를 제어한다. 제어부는 CPU, MPU, 중앙 처리 장치, 마이컴 등을 나타 내거나 이를 포함할 수 있다. 제어부는 저장부의 제어 프로그램을 로딩하여 지정된 하나 이상의 표준 정신상태검사를 수검자에 대 해 수행한다. 예를 들어, 제어부는 K-MMSE, 표준의 심층 검사 등을 영상 촬영부, 오디오신호 수신부 , 오디오신호 출력부, 디스플레이부 및 입력부 등을 이용한 수검자와의 인터페이스를 통해 수행한다. 제어부에서 이루어지는 주요 제어 흐름은 도 5에서 좀 더 상세히 살펴보도록 한다. 도 5는 치매관리 자동화를 위한 예시적인 제어 흐름을 도시한 도면이다. 도 5의 제어 흐름은 치매관리 자동화 장치에 의해서 수행되고 바람직하게는 제어부에 로딩되는 제어 프로그램, 음성 인식 프로그램 및/또는 인공지능 프로그램 등에 의해서 수행된다. 도 5의 제어 흐름 중 일부의 흐름은 다른 장치나 서버에서 수행될 수 있으나 적어도 제어부에 의한 제어에 따라 해당 기능이 바람직하 게 수행된다. 먼저, 수검자 등이 보건소 등에 방문함에 따라 치매관리 자동화 장치를 이용하여 수검자를 인증하고 그에 따라 수검자 정보를 수신(S101)한다. 구체적으로, 제어부는 로그인을 통해 수검자 인증이 가능한 복수의 사이트 이미지를 구성하여 디스플레이 부를 통해 표시한다. 복수의 사이트는 예를 들어 포털 사이트, SNS 사이트 등을 포함하고 복수의 사이트 중 하나 이상은 수검자가 로그인 가능한 사이트일 수 있다. 복수의 사이트는 예를 들어, 구글 서버, 카카오 서 버, 네이버 서버, 페이스북 서버 등을 포함한다. 제어부는 표시된 복수의 사이트 이미지 중에서 하나의 이미지에 대한 선택 입력과 선택된 사이트로 연결하 기 위한 로그인 입력을 입력부를 통해 수신한다. 예를 들어, 제어부는 임의의 사이트 이미지 선택을 위한 터치 입력과 선택된 사이트에서 로그인하기 위한 ID와 패스워드(또는 인증번호 등)를 터치 입력이나 다른 입력 수단을 통해 수신한다. 제어부는 로그인 입력에 따라 통신부를 통해 선택된 사이트에 연결한다. 예를 들어, 제어부는 선택된 사이트와 세션을 설정하고 ID와 패스워드를 포함하는 로그인 정보를 선택된 사이트의 사이트 서버로 전송하고 그 응답을 통신부를 통해 수신할 수 있다. 수신된 응답이 ID와 패스워드가 존재한다는 응답(예를 들어, 로그인 OK 응답)인 경우에, 제어부는 ID와 패 스워드를 가지는 수검자의 휴대형 단말(예를 들어, 스마트폰)로 인증 데이터를 통신부를 통해 전송한다. 인증 데이터는 램덤하게 생성되는 4자리, 6자리 등의 숫자일 수 있다. 제어부가 직접 인증 데이터를 휴대 형 단말( 응답과 함께 수신된 휴대전화번호로)로 전송하거나 제어부가 선택된 사이트 서버로 인증 데 이터의 전송을 요청할 수 있다. 수검자는 인증 데이터를 휴대형 단말을 통해 확인하고, 입력부를 통해 인증 데이터를 입력하고 제어부 는 입력 인증 데이터를 입력부를 통해 수신한다. 제어부는 입력된 인증 데이터에 따라 수검자를 인증한다. 예를 들어, 제어부는 입력 인증 데이터와 전송 인증 데이터가 동일한지로 수검자를 인증할 수 있다. 또한, 제어부는 통신부를 통해 수검자 정보를 선택된 사이트로부터 수신한다. 제어부는 수신된 응답에서 수검자 정보를 추출하거나 수검자가 인증된 경우 수검자 정보를 선택된 사이트로 요청하여 이를 수신 할 수 있다. 수검자 정보는 예를 들어, 이름, 주민번호, 휴대전화번호, 성별 등을 포함할 수 있다. 수검자 정보 는 검사항목들의 응답평가에 매칭되어 저장부나 중앙관리 서버의 DB에 저장된다. 수검자 정보가 특정됨에 따라, 현재 수검자에 대응하는 캐릭터를 결정(S103)한다. 캐릭터는 디스플레이부 를 통해 이미지로 출력되고 캐릭터의 형상은 문구 음성에 연동하여 변동된다. 그에 따라, 수검자는 캐릭터의 모 양(입 모양 및 제스춰 등)을 보고 문구(질문이나 요청 등)의 파악에 보다 도움이 되며, 가상의 질문자나 안내자 와 대화하는 형식의 자연스러운 상황에서 검사 수행이 가능하다. 좀 더 구체적으로서 살펴보면, 제어부는 입력부, 통신부, 영상 촬영부 또는 외부 인터페이 스(예를 들어, USB 인터페이스 등)를 통해 캐릭터 생성에 이용될 영상 이미지를 입력부를 통한 수검자 또 는 그 보호자의 선택 입력에 따라 수신한다. 수검자등의 선택 입력에 따라, 제어부는 캐릭터 생성에 이용될 영상 이미지를 결정하고 결정된 이미지로부 터 캐릭터를 생성한다. 예를 들어, 제어부는 촬영되거나 선택된 영상 이미지에서 캐릭터(실사 사진의 이미 지를 기반으로 한 유사 실사 이미지이거나 캐리커쳐 형태일 수 있다)를 생성할 수 있다. 제어부는 생성된 캐릭터를 수검자에 매칭시켜 저장부나 중앙관리 서버에 저장할 수 있다. 이와 같은 캐릭터 생성으로 수검자와 친근하거나 의존하는 사람의 캐릭터를 통해 그 검사가 이루어질 수 있도록 한다. 또는, 제어부는 디폴트 캐릭터를 출력될 캐릭터로 결정할 수 있다. 디폴트 캐릭터는 중앙관리 서버 등에 의해서 제공되는 기본 캐릭터일 수 있다. 또는, 제어부는 이미 매칭되어 저장되어 있는 캐릭터를 이 용될 캐릭터로 결정할 수도 있다. 이와 같이 구성되는 캐릭터의 형상(외형, 모양 등)은 수검자의 표준 정신상태검사 진행을 안내하도록 구성되고 검사항목의 문구 음성에 연동하여 변동된다. 예를 들어, 캐릭터의 입 모양은 문구 음성에 대응하는 모양으로 변 경되어 디스플레이부를 통해 이미지로 출력될 수 있다. 수검자의 인증과 캐릭터 결정에 따라, 제어부는 수검 대상 검사를 선택(S105)한다. 예를 들어, 제어부 는 복수의 수검 대상 검사 중 피수검자등에 의한 선택이나 중앙관리 서버와 연동하여 결정되는 수검 대상 검사를 이하 과정(S107 내지 S117 참조)을 통해 이루어질 검사로 결정할 수 있다. 선택되는 검사는 기초 조사, 간이 검사, 심층 검사 등일 수 있고 표준화된 정신상태검사를 나타낸다. 선택된 검 사는 예를 들어, 한국형 간이 정신상태검사(Korean Mini Mental State Examination : K-MMSE)일 수 있다. 또한, 제어부는 내부 변수(예를 들어, 검사항목 특정에 이용되는 i 등)를 초기화한다. 이후, 선택된 검사의 검사항목들이 캐릭터와 음성을 이용하여 출력되고 음성이나 영상 입력을 통해 분석되어 그 검사 평가가 IT 기술을 이용하여 이루어진다. 구체적으로 살펴보면, 제어부는 선택된 표준 정신상태검사에 포함되는 모든 검사항목에 대한 검사 수행이 완료되었는지를 판단(S107)한다. 예를 들어, 제어부는 내부 변수 i가 총 검사항목 개수와 동일한지로 모든 검사항목의 수행 완료 여부를 판단할 수 있다. 모든 검사항목의 검사가 다 이루어지지 못하였으면, 제어부는 i번째 검사항목에 대응하는 문구(질문, 요청 또는 명령 등을 나타내는 하나 이상의 단어, 문장 등)를 표시되는 캐릭터와 연동하여 음성으로 출력(S109)한다.예를 들어, 제어부는 문구의 음성에 연동하여 변동하는 형상(입 모양)을 가지는 캐릭터 이미지를 생성하여 디스플레이부로 출력함과 동시에 i번째 검사항목에 대응하는 문구(i번째 검사항목의 검사를 나타내기 위한 문구)를 나타내는 음성(신호)을 오디오신호 출력부를 통해 출력한다. 문구 음성은 오디오신호 출력부(11 1)의 헤드셋이나 이어셋 등으로 출력된다. 문구의 출력에 후속하여, 제어부는 수검자의 입력에 따라 i번째 검사항목의 문구에 대한 응답을 수신 (S111)한다. i번째 검사항목의 문구의 유형에 따라, 제어부는 오디오신호 수신부를 통한 음성 응답, 영상 촬영부를 통한 영상 응답, 입력부를 통한 터치 응답 등을 수신할 수 있다. 제어부는 i번째 문구 응답의 수신에 따라 해당 검사항목의 응답평가를 수행(S113)한다. 예를 들어, 제어부 는 터치 입력에 대한 문자 인식, 오디오신호 수신부를 통한 음성신호에 대한 음성 인식 또는 영상 촬 영부를 통한 영상 인식 기술을 통해 응답평가를 수행하여 각 검사항목에 대한 평가점수를 부여할 수 있다. 이후, 제어부는 후속 검사항목의 검사가 진행될 수 있도록 내부 변수를 변경(S115)한다. 예를 들어, 제어 부는 변수 i를 1 증가시킬 수 있다. 검사항목에 대한 검사와 그 평가의 과정을 예를 통해 구체적으로 살펴보면, 도 3의 K-MMSE의 예와 같이, 하나의 표준 검사는 다수의 검사항목을 가진다. 지남력/시간/년,월,일,요일,계절의 검사항목에는 각각 점수가 배점되고 수검자가 오늘의 년,월,일,요일,계절에 대한 답변으로 그 평가점수가 결정된다. 지남력/시간/년,월,일의 검사항목들에 대해서, 제어부는 \"오늘은 몇년 몇월 몇일인가요?\"라는 문구를 오디 오신호 출력부 및 디스플레이부를 통해 음성과 캐릭터로 출력(S109 참조)하고, 제어부는 오디오 신호 수신부를 통해 그 응답 음성을 수신(S111 참조)하고 제어부는 응답 음성에 대한 음성 인식과 정 답과의 비교로 해당 검사항목(들)에 대한 응답평가를 수행(S113 참조)한다. 예를 들어, 음성 인식된 결과와 정 답과의 비교로 평가점수를 제어부가 부여할 수 있다. 기억등록/비행기, 연필, 소나무의 검사항목들에 대해서, 제어부는 \"따라해보세요 비행기, 연필, 소나무\"라 는 문구를 오디오신호 출력부 및 디스플레이부를 통해 음성과 캐릭터로 출력(S109 참조)하고, 제어부 는 오디오신호 수신부를 통해 그 응답을 음성으로 수신(S111 참조)하고 제어부는 응답 음성에 대한 음성 인식된 사물과 정답 사물과의 비교로 해당 검사항목(들)에 대한 응답평가를 수행(S113 참조)한다. 예 를 들어, 음성 인식된 사물과 정답 사물들과의 일치 여부로 평가점수를 제어부가 부여할 수 있다. 설계 예 에 따라, 사물 이름(비행기, 연필, 소나무)은 변경될 수 있다. 주의집중 및 계산의 검사항목들에 대해서, 제어부는 \"100-7은 얼마인가요?\"라는 문구를 오디오신호 출력부 및 디스플레이부를 통해 음성과 캐릭터로 출력(S109 참조)하고, 제어부는 오디오신호 수신부 를 통해 그 응답을 음성으로 수신(S111 참조)하고 제어부는 응답 음성에 대한 음성 인식된 숫자와 정 답 숫자의 비교로 해당 검사항목(들)에 대한 응답평가를 수행(S113 참조)한다. 예를 들어, 음성 인식된 숫자와 예상 정답 숫자와 동일한 경우 지정된 평가점수를 제어부가 부여할 수 있다. 주의집중 및 계산의 검사항목 은 수차례 다른 숫자에 대한 질문(문구)으로 반복될 수 있다. 언어 및 시공간 구성/이름대기 검사항목들에 대해서, 제어부는 디스플레이부에 \"시계\" 또는 \"볼펜\"을 이미지로 표시하고 \"디스플레이에 표시되어 있는 사물의 이름은?\"이라는 질문(문구)을 오디오신호 출력부 및 디스플레이부를 통해 음성과 캐릭터로 출력(S109 참조)하고, 제어부는 오디오신호 수신부를 통해 그 응답 음성을 수신(S111 참조)하고 제어부는 응답 음성에 대한 음성 인식된 사물의 이름과 정답 사 물 이름과의 비교로 해당 검사항목(들)에 대한 응답평가를 수행(S113 참조)한다. 언어 및 시공간 구성/명령시행의 검사항목들에 대해서, 제어부는 \"종이를 뒤집고 반으로 접은 다음 저에게 주세요\"라는 문구(요청)를 오디오신호 출력부 및 디스플레이부를 통해 음성과 이 음성에 연동하여 그 형상이 변경되는 캐릭터의 이미지신호로 출력(S109 참조)하고, 제어부는 이 문구에 대한 응답을 나타내는 영상을 영상 촬영부로부터 수신(S111 참조)하고 이 검사항목에 대한 응답평가를 응답 영상의 분석을 통해 수행(S113 참조)한다. 여기서, 제어부는 해당 검사항목에 대한 응답평가를 미리 학습된 인공지능 프로그램을 통해 수행할 수 있 다. 즉, 제어부는 인공지능 프로그램을 통한 해당 검사항목의 응답평가 수행 이전에, 언어 및 시공간 구성 /명령시행의 해당 검사항목(들)에 관련되어 먼저 촬영된 복수 영상과 각각의 영상에 매칭되어 있는 복수의 평가 정보를 이용하여 인공지능 프로그램을 학습시킨다. 인공지능 프로그램의 학습은 치매관리 자동화 장치에서이루어지거나 중앙관리 서버에서 이루어진다. 촬영된 영상은 해당(언어 및 시공간 구성/명령시행의) 검사항목에 대해서 촬영된 영상이고 평가정보는 피수검자 가 해당 영상을 보고 이루어진 평가점수일 수 있다. 인공지능 프로그램은 영상에 노출되는 이미지들에 대한 평 가점수로 학습이 이루어져 이후 실시간으로 입력되는 영상에 대해서 높은 정확도로 평가할 수 있다. 언어 및 시공간 구성/따라말하기 검사항목에 대해서, 제어부는 \"따라말하세요 '백문이 불여일견'\"이라는 문구(요청 음성)를 오디오신호 출력부 및 디스플레이부를 통해 음성과 캐릭터로 출력(S109 참조)하고, 제어부는 오디오신호 수신부를 통해 그 응답을 음성을 수신(S111 참조)하고 제어부 는 응답 음성에 따라 음성 인식된 문구과 정답 문구과의 비교로 해당 검사항목(들)에 대한 응답평가를 수행 (S113 참조)한다. 예를 들어, 음성 인식된 문구과 정답 문구과의 일치 여부로 평가점수를 제어부가 부여할 수 있다. 언어 및 시공간 구성/오각형 검사항목에 대해서, 제어부는 \"오각형을 그려보세요\"라는 문구(요청 음성)를 오디오신호 출력부 및 디스플레이부를 통해 음성과 캐릭터로 출력(S109 참조)하고, 제어부는 입 력부를 통해 터치 입력을 포함하는 응답을 수신(S111 참조)하고 제어부는 응답 입력에 따라 인식되는 도형과 정답 도형과의 비교로 해당 검사항목(들)에 대한 응답평가를 수행(S113 참조)한다. 예를 들어, 인식된 도형이 오각형인지 여부로 평가점수를 제어부가 부여할 수 있다. 이와 같이, 제어부는 각 검사항목을 수행하기 위한 요청, 질문, 안내, 명령 등의 문구 음성을 오디오신호 출력부를 통해 출력하고 출력 음성의 검사 유형에 따라 오디오신호 수신부, 영상 촬영부, 입력 부를 통해 응답을 수신하고 수신된 응답에 대한 평가를 수행할 수 있다. 제어부는 응답평가를 검사항목에 매칭시켜 저장부에 저장할 수 있다. 모든 검사항목에 대한 검사가 완료됨에 따라, 제어부는 선택된 검사에 대한 평가를 수행하고 평과 결과를 저장(S117)한다. 예를 들어, 제어부는 저장되어 있는 각 검사항목에 대응하는 응답평가들을 이용하여 수검자의 정신상태를 분류하고 분류결과를 수검자 정보에 매칭시켜 저장부나 중앙관리 서버에 저장할 수 있다. 제어부 는 각 검사항목에 대한 평가점수를 합산하고 합산된 점수에 대응하는 상태로 분류하고 분류된 정신상태 정 보를 수검자 정보에 매칭시켜 저장부와 나아가 중앙관리 서버에 통신부를 통해 저장할 수 있다. 이상과 같은 제어 흐름을 통해, 수검자는 표준화된 정신상태검사를 대상으로 자동화된 음성 입출력, 터치 입력 등을 통해 정확한 검사를 할 수 있고 수검자가 선호하는 캐릭터와 인터페이스하여 편안한 분위기하에서 그 검사 가 이루어지게 한다. 또한, 수검자는 헤드셋, 이어셋 등을 착용한 상태에서 그 검사가 이루어져 검사와 관련된 개인적 정보의 유출을 방지할 수 있다. 이상에서 설명한 본 발명은, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 있어 본 발명의 기술 적 사상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능하므로 전술한 실시 예 및 첨부된 도면에 의해 한정되는 것이 아니다."}
{"patent_id": "10-2019-0140014", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 치매관리 자동화 시스템을 도시한 도면이다. 도 2는 치매관리를 위한 예시적인 흐름을 도시한 도면이다. 도 3은 한국형 간이 정신상태검사의 서식 예를 도시한 도면이다. 도 4는 치매관리 자동화 장치의 예시적인 블록도를 도시한 도면이다. 도 5는 치매관리 자동화를 위한 예시적인 제어 흐름을 도시한 도면이다."}
