{"patent_id": "10-2022-0018264", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0121660", "출원번호": "10-2022-0018264", "발명의 명칭": "오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방", "출원인": "주식회사 라훔나노테크", "발명자": "이명훈"}}
{"patent_id": "10-2022-0018264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로세서, 통신 인터페이스, 디스플레이부, 음향 출력부, 카메라, 마이크로폰, 및 사용자 입력부를 포함하는 컴퓨팅 장치에 의해 수행되는 방법에 있어서,상기 카메라에 의해, 영상 표시 장치에서 표시되며, 제1 객체에 대한 이미지와 상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미지 및 제1 광고영상에 매핑된 제1 광고 식별코드에 대한 이미지 중 적어도 하나를 포함하는 상기 제1 광고영상을 스캔하는 과정; 상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑된 제1 객체 식별코드 및상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정; 상기 디스플레이부에 의해, 구현된 증강현실 또는 가상세계 상에 3D 아바타를 표시하면서, 상기 음향 출력부에의해, 선택 가능한 복수의 옵션들을 음성으로 안내하는 과정, -상기 선택 가능한 복수의 옵션들은 코인에 대한옵션, 이모티콘에 대한 옵션, 게임에 대한 옵션, 광고영상에 대한 옵션 중 적어도 하나를 포함하며-;상기 마이크로폰에 의해, 선택 옵션에 대한 음성정보를 수신하거나, 상기 사용자 입력부에 의해, 상기 선택 옵션에 대한 입력정보를 수신하는 과정; 및상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정을 포함하는,오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0018264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정은, 상기 광고영상에 대한 옵션을 선택한 경우에,상기 제1 광고영상의 제1 광고 식별정보에 기초해 상기 제1 광고영상에 대한 페이지로 이동하는 과정; 및상기 제1 객체의 제1 객체 식별정보에 기초해 상기 제1 객체에 대한 판매 페이지로 이동하는 과정, 중 하나를포함하는,오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0018264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑된 제1 객체 식별코드, 및상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정은,상기 제1 객체에 대한 이미지를 관리서버에 송신하고, 상기 관리서버에서 인공지능 모델을 이용해 상기 제1 객체에 대한 이미지로부터 인식된 상기 제1 객체의 제1 객체 식별정보를 수신하는 과정을 포함하는, 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0018264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0121660-3-제1항에 있어서,상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑된 제1 객체 식별코드 및상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정은,상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미지 및 제1 광고영상에 매핑된 제1 광고 식별코드에 대한이미지 중 적어도 하나로부터 상기 제1 객체에 매핑된 제1 객체 식별코드 및 상기 제1 광고영상에 매핑된 제1광고 식별코드 중 적어도 하나를 인식하는 과정; 및상기 제1 객체 식별코드 및 상기 제1 광고 식별코드 중 적어도 하나로부터 상기 제1 객체의 제1 객체 식별정보및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정을 포함하는, 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0018264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "프로세서, 통신 인터페이스, 디스플레이부, 카메라, 및 사용자 입력부를 포함하는 영상 표시 장치에 의해 수행되는 방법에 있어서,상기 디스플레이부를 통해 광고영상을 상영하는 과정;상기 카메라를 통해 사용자의 손 동작을 촬영하고 상기 손 동작을 인식하는 과정;상기 손 동작에 기초해 상기 광고영상에 대한 광고 식별정보를 저장하고, 상기 디스플레이부에 의해 구현된 증강현실 또는 가상세계 상에 3D 아바타를 표시하면서, 상기 음향 출력부에 의해 선택 가능한 복수의 옵션들을 음성으로 안내하는 과정;상기 마이크로폰에 의해 선택 옵션에 대한 음성정보를 수신하거나, 상기 사용자 입력부에 의해 상기 선택 옵션에 대한 입력정보를 수신하거나, 상기 카메라를 통해 상기 사용자의 손 동작에 매칭된 선택 정보를 수신하는 과정; 및상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정을 포함하는,오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예는. 프로세서, 통신 인터페이스, 디스플레이부, 음향 출력부, 카메라, 마이크로폰, 및 사용자 입력부를 포함하는 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 상기 카메라에 의해, 영상 표시 장치에서 표시 되며, 제1 객체에 대한 이미지와 상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미지 및 제1 광고영상에 (뒷면에 계속)"}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법, 장치 및 컴퓨터프로그램에 관한 것이다."}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 소상공인이나 대기업을 막론하고 운영하고 있는 사업체의 홍보, 생산 판매하는 상품 등을 소비자들 에게 홍보하기 위하여 다양한 광고방법이 이용되고 있다. 현재 광범위하게 이용되고 있는 광고방법으로는 크게 영상매체를 이용한 광고, 인쇄물을 이용한 광고로 나눌 수 있다. 종래 영상매체를 이용한 광고시스템은 단순히 서버로부터 전송받은 광고 영상을 광고표시장치가 디스플레이 패 널을 통하여 일방적으로 출력하기 때문에 상영되는 광고영상 속 광고에 대한 정보를 실시간으로 얻기 어렵다는 문제점을 가진다. 선행기술문헌특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2021-0120690호 (2021.10.07)"}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 문제점을 해결하기 위해, 본 발명의 일 실시예는, 영상 표시 장치에서 상용되는 오프라인 광고를 통해 사용자 단말을 통해 사용자에게 오프라인 광고에 대응하는 온라인 광고를 제공하는 것을 목적으로 한다. 한편, 본 발명의 일 실시예는, 영상 표시 장치에서 상영되는 광고영상 혹은 광고영상 속 객체에 대한 정보를 사 용자에게 제공하는 것을 목적으로 한다. 한편, 본 발명의 일 실시예에는, 영상 표시 장치에서 상영되는 광고영상을 생성하고 영상 표시 장치에게 송신하 고, 사용자 단말에서 스캔된 광고영상을 통해 영상 표시 장치에 송신된 광고영상을 확인할 수 있는 관리서버를 제공하는 것을 목적으로 한다. 한편, 본 발명의 일 실시예는, 영상 표시 장치에서 상영되는 광고영상 혹은 광고영상 속 식별코드를 이용해 제 공된 아바타가 사용자의 음성을 인식하여 사용자가 원하는 서비스를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위해, 본 발명의 일 실시예는, 프로세서, 통신 인터페이스, 디스플레이부, 음향 출력부, 카메라, 마이크로폰, 및 사용자 입력부를 포함하는 컴퓨팅 장치에 의해 수행되는 방법에 있어서, 상기 카메라에 의해, 영상 표시 장치에서 표시되며, 제1 객체에 대한 이미지와 상기 제1 객체에 매핑된 제1 객체 식 별코드에 대한 이미지 및 제1 광고영상에 매핑된 제1 광고 식별코드에 대한 이미지 중 적어도 하나를 포함하는 상기 제1 광고영상을 스캔하는 과정; 상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑된 제1 객체 식별코드 및 상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함 으로써, 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득 하는 과정; 상기 디스플레이부에 의해, 구현된 증강현실 또는 가상세계 상에 3D 아바타를 표시하면서, 상기 음 향 출력부에 의해, 선택 가능한 복수의 옵션들을 음성으로 안내하는 과정, -상기 선택 가능한 복수의 옵션들은 코인에 대한 옵션, 이모티콘에 대한 옵션, 게임에 대한 옵션, 광고영상에 대한 옵션 중 적어도 하나를 포함하며 -; 상기 마이크로폰에 의해, 선택 옵션에 대한 음성정보를 수신하거나, 상기 사용자 입력부에 의해, 상기 선택 옵션에 대한 입력정보를 수신하는 과정; 및 상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정을 포함하는, 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법을 제공할 수 있다. 본 발명의 일 실시예에서, 상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정은, 상기 광고영상에 대한 옵션을 선택한 경우에, 상기 제1 광고영상의 제1 광고 식별정보에 기초해 상기 제1 광고영상에 대한 페이지로 이동하는 과정; 및 상기 제1 객체의 제1 객체 식별정보에 기초해 상기 제1 객체에 대한 판매 페이지로 이동하는 과정, 중 하나 를 포함할 수 있다. 본 발명의 일 실시예에서, 상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑 된 제1 객체 식별코드, 및 상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상 기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정 은, 상기 제1 객체에 대한 이미지를 관리서버에 송신하고, 상기 관리서버에서 인공지능 모델을 이용해 상기 제1 객체에 대한 이미지로부터 인식된 상기 제1 객체의 제1 객체 식별정보를 수신하는 과정을 포함할 수 있다. 본 발명의 일 실시예에서, 상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑 된 제1 객체 식별코드 및 상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정은,상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미지 및 제1 광고영상에 매핑된 제1 광고 식별코드에 대한 이미지 중 적어도 하나로부터 상기 제1 객체에 매핑된 제1 객체 식별코드 및 상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식하는 과정; 및 상기 제1 객체 식별코드 및 상기 제1 광고 식별코드 중 적 어도 하나로부터 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하 나를 획득하는 과정을 포함할 수 있다. 본 발명의 다른 실시예에서, 프로세서, 통신 인터페이스, 디스플레이부, 카메라, 및 사용자 입력부를 포함하는 영상 표시 장치에 의해 수행되는 방법에 있어서, 상기 디스플레이부를 통해 광고영상을 상영하는 과정; 상기 카 메라를 통해 사용자의 손 동작을 촬영하고 상기 손 동작을 인식하는 과정; 상기 손 동작에 기초해 상기 광고영 상에 대한 광고 식별정보를 저장하고, 상기 디스플레이부에 의해 구현된 증강현실 또는 가상세계 상에 3D 아바 타를 표시하면서, 상기 음향 출력부에 의해 선택 가능한 복수의 옵션들을 음성으로 안내하는 과정; 상기 마이크 로폰에 의해 선택 옵션에 대한 음성정보를 수신하거나, 상기 사용자 입력부에 의해 상기 선택 옵션에 대한 입력 정보를 수신하거나, 상기 카메라를 통해 상기 사용자의 손 동작에 매칭된 선택 정보를 수신하는 과정; 및 상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정을 포함하는, 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이 용한 가상 플랫폼 서비스 제공 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 과제 해결 수단을 통해, 본 발명의 일 실시예는, 영상 표시 장치에서 상용되는 오프라인 광고를 통해 사 용자 단말을 통해 사용자에게 온라인 광고를 제공하는 효과를 가진다. 한편, 본 발명의 일 실시예는, 영상 표시 장치에서 상영되는 광고영상 혹은 광고영상 속 객체에 대한 정보를 사 용자에게 제공하는 효과를 가진다. 한편, 본 발명의 일 실시예에는, 영상 표시 장치에서 상영되는 광고영상을 생성하고 영상 표시 장치에게 송신하 고, 사용자 단말에서 스캔된 광고영상을 통해 영상 표시 장치에 송신된 광고영상을 확인할 수 있는 관리서버를 제공하는 효과를 가진다. 한편, 본 발명의 일 실시예는, 영상 표시 장치에서 상영되는 광고영상 혹은 광고영상 속 식별코드를 이용해 제 공된 아바타가 사용자의 음성을 인식하여 사용자가 원하는 서비스를 제공하는 효과를 가진다."}
{"patent_id": "10-2022-0018264", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예들은 다양한 변경들을 가할 수 있으므로 실시예들을 도면에 예시하고 본 명세서에서 상세하게 설명하고자 한다. 그러나, 이는 본 발명의 실시예들을 특정한 형태들로 한정하려는 것이 아니며, 본 발명의 사 상 및 기술 범위에 포함되는 모든 변경, 균등물, 또는 대체물을 포함한다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 \"모듈\"이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, \"부\" 또는 \"모듈\"은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 \"모듈\"은 소프트웨어 또는 하드웨 어에 한정되는 의미는 아니다. \"부\" 또는 \"모듈\"은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 \"모듈\"은 소 프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성 요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌 웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 \"모듈\"들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 \"모듈\"들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 \"모듈\"들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\" 또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 발명의 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 시스템을 도시한 도면이다. 도 13은 본 발명의 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 시스템의 흐름도를 도시한 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가 상 플랫폼 서비스 제공 시스템은, 사용자 단말기, 영상 표시 장치 및 관리서버를 포함할 수 있 다.도 1의 본 발명의 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 시스템은 일 실시예에 따른 것이고, 그 구성 요소가 도 1에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 부가, 변경 또는 삭제될 수 있다. 일 실시예에서, 사용자 단말는 영상 표시 장치에서 표시되는 광고영상을 카메라를 통해 스캔하 고, 음성인식 반응형 3D 아바타를 디스플레이부를 통해 제공하여 가상 플랫폼 서비스를 사용자에게 제공할 수 있다. 그러나, 이에 한정되지 않는다. 또한, 사용자 단말은 네트워크를 통해 관리서버와 통신상 연결될 수 있으며, 음성인식 반응형 3D 아바타를 통해 제공된 복수의 옵션들 중 어느 하나를 선택한 경우 자체적으로 선택된 옵션에 해당하는 서비 를 제공하거나, 혹은 관리서버로부터 선택된 옵션에 해당하는 서비스를 제공받을 수 있다. 일 실시예에서, 영상 표시 장치는 백화점이나 엘리베이터와 같은 외부 공간에 누구나 볼 수 있도록 설치되 며, 복수의 광고영상을 순차적으로 표시하여 사용자에게 제공하는 장치를 말한다. 그러나, 이에 한정되지 않는 다. 또한, 영상 표시 장치는 네트워크를 통해 관리서버와 통신상 연결될 수 있으며, 관리서버 에서 생성된 복수의 광고영상을 수신하여 사용자에게 제공할 수 있다. 일 실시예에서, 관리서버는 네트워크를 통해 사용자 단말 혹은 영상 표시 장치에 통신상 연결될 수 있고, 복수의 광고영상을 영상 표시 장치에게 송신할 수 있으며, 사용자 단말의 선택 옵션 요청에 따른 서비스를 사용자 단말에게 제공할 수 있다. 이하, 도 2를 참조하여 사용자 단말의 하드웨어 구성에 대해 설명하도록 한다. 또한, 도 3을 참조하며 영 상 표시 장치의 하드웨어 구성에 대해 설명하도록 한다. 도 2는 본 발명의 일 실시예에 따른 사용자 단말의 하드웨어 구성도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 사용자 단말(이하, \"컴퓨팅 장치\")는 하나 이상의 프 로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 통신 인 터페이스 및 컴퓨터 프로그램을 저장하는 스토리지를 포함할 수 있다. 여기서, 도 2에는 본 발명의 실시예와 관련 있는 구성요소들이 도시되어 있다. 따라서, 본 발명이 속한 기술분 야의 통상의 기술자라면 도 2에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있다. 다양한 실시예에서, 본 명세서에서, 컴퓨팅 장치는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄 하는 의미로서 이해될 수 있다. 예를 들어, 컴퓨팅 장치는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 본 명세서에서 설명되는 각 과정들은 컴퓨팅 장치에 의하여 수행되는 것으로 설명 되나, 각 과정의 주체는 이에 제한되는 것은 아니며, 실시 예에 따라 각 과정들의 적어도 일부가 서로 다른 장 치에서 수행될 수도 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 발명의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서는 본 발명의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프 로그램에 대한 연산을 수행할 수 있으며, 컴퓨팅 장치는 하나 이상의 프로세서를 구비할 수 있다. 또한, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저 장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 다양한 실시예에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 컴퓨터 프로그램을 로드할 수 있다. 메모리에 컴퓨 터 프로그램이 로드되면, 프로세서는 컴퓨터 프로그램을 구성하는 하나 이상의 인스트럭션들을실행함으로써 상기 방법/동작을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것 이나, 본 개시의 기술적 범위가 이에 한정되는 것은 아니다. 버스(BUS)는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한다. 버스(BUS)는 주소 버스(address Bus), 데 이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인 터넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 예를 들어, 통신 인터페이스는, 근거리 통신, 이동 통신, 방송 통신 방식 중 적어도 하나를 지원할 수 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수 도 있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모 리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 인스트럭션들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상 의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예에 따른 상기 방법/동작을 수행할 수 있다. 일 실시예에서, 컴퓨터 프로그램은 카메라에 의해, 영상 표시 장치에서 표시되며, 제1 객체에 대한 이미 지와 상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미지 및 제1 광고영상에 매핑된 제1 광고 식별코드에 대한 이미지 중 적어도 하나를 포함하는 상기 제1 광고영상을 스캔하는 인스트럭션(instruction); 상기 프로세 서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑된 제1 객체 식별코드 및 상기 제1 광 고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상기 제1 객체의 제1 객체 식별정보 및 상 기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 인스트럭션; 상기 디스플레이부에 의해, 구현 된 증강현실 또는 가상세계 상에 3D 아바타를 표시하면서, 상기 음향 출력부에 의해, 선택 가능한 복수의 옵션 들을 음성으로 안내하는 인스트럭션, -상기 선택 가능한 복수의 옵션들은 코인에 대한 옵션, 이모티콘에 대한 옵션, 게임에 대한 옵션, 광고영상에 대한 옵션 중 적어도 하나를 포함하며-; 상기 마이크로폰에 의해, 선택 옵 션에 대한 음성정보를 수신하거나, 상기 사용자 입력부에 의해, 상기 선택 옵션에 대한 입력정보를 수신하는 인 스트럭션; 및 상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정 보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 인스트럭션을 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 과정들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 일 실시예에서, 컴퓨터 프로그램은 컴퓨팅 장치와 결합되어, 카메라에 의해, 영상 표시 장치에서 표 시되며, 제1 객체에 대한 이미지와 상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미지 및 제1 광고영상 에 매핑된 제1 광고 식별코드에 대한 이미지 중 적어도 하나를 포함하는 상기 제1 광고영상을 스캔하는 과정; 상기 프로세서에 의해, 상기 제1 광고영상에서 상기 제1 객체, 상기 제1 객체에 매핑된 제1 객체 식별코드 및 상기 제1 광고영상에 매핑된 제1 광고 식별코드 중 적어도 하나를 인식함으로써, 상기 제1 객체의 제1 객체 식 별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득하는 과정; 상기 디스플레이부에 의해, 구현된 증강현실 또는 가상세계 상에 3D 아바타를 표시하면서, 상기 음향 출력부에 의해, 선택 가능한 복 수의 옵션들을 음성으로 안내하는 과정, -상기 선택 가능한 복수의 옵션들은 코인에 대한 옵션, 이모티콘에 대 한 옵션, 게임에 대한 옵션, 광고영상에 대한 옵션 중 적어도 하나를 포함하며-; 상기 마이크로폰에 의해, 선택 옵션에 대한 음성정보를 수신하거나, 상기 사용자 입력부에 의해, 상기 선택 옵션에 대한 입력정보를 수신하는 과정; 및 상기 디스플레이부에 의해, 상기 선택 옵션에 대한 음성정보 또는 상기 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시하는 과정을 실행시키기 위하여 컴퓨터로 판독가능한 기록매체에 저 장된, 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 컴퓨터 프로그 램일 수 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 나아가, 컴퓨팅 장치는 출력부, 이동 센서부, 위치 센서부, A/V입력부, 사용자 입력 부, 배터리 중 적어도 하나를 더 포함할 수 있다. 출력부는 실행되는 프로그램(또는 애플리케이션)에 의해 생성 혹은 실행되는 비디오 신호, 오디오 신호 및 진동 신호 중 적어도 하나를 출력할 수 있다. 출력부는 비디오 신호를 출력하는 디스플레이부, 오디 오 신호를 출력하는 음향 출력부, 진동 신호를 출력하는 진동 출력부 중 적어도 하나를 포함할 수 있 다. 센싱부(미도시)는, 컴퓨팅 장치의 상태 또는 컴퓨팅 장치 주변의 상태를 센싱하고, 센싱된 테이터 및 /또는 정보를 스토리지에 저장하거나 프로세서로 전달할 수 있다. 센싱부(미도시)는, 이동하는 컴퓨팅 장치의 상태를 감지하는 이동 센서부와, 컴퓨팅 장치의 위 치를 센싱하는 위치 센서부를 포함할 수 있다. 이동 센서부는 가속도 센서(Acceleration sensor)(161a), 자이로스코프 센서(161b), 모션 센서(161c), 걸음 센서(161d) 중 적어도 하나를 포함할 수 있 다. 위치 센서부는 GPS를 포함할 수 있다. 나아가, 센서부(미도시)는 자기 센서(Magnetic sensor), 온/습 도 센서, 적외선 센서, 기압 센서, 근접 센서, 및 RGB 센서 중 적어도 하나를 더 포함할 수 있다. 각 센서들의 기능은 그 명칭으로부터 당업자가 직관적으로 추론할 수 있으므로, 구체적인 설명은 생략하기로 한다. A/V(Audio/Video) 입력부는 외부로부터 컴퓨팅 장치로 오디오 신호 또는 비디오 신호의 입력을 위한 것으로, 카메라와 마이크로폰 등을 포함할 수 있다. 카메라는 화상 통화모드 또는 촬영모드에서 이미지 센서를 통해 정지영상 또는 동영상 등의 화상 프레임을 얻을 수 있다. 마이크로폰은 외부의 음성 신호를 입력 받아 전기적인 음성 데이터로 처리하여 저장할 수 있다. 다양한 실시예에서, 카메라은 광고영상을 스캔하여 광고영상 속 식별코드를 인식할 수 있다. 식별코드는 바코드 혹은 QR코드를 포함할 수 있다. 사용자 입력부는, 사용자가 컴퓨팅 장치를 제어하기 위한 사용자 입력 신호 혹은 데이터를 입력하는 수단을 의미한다. 사용자 입력부는 터치 패드(일 예로, 접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등)와, 키 패드(key pad), 전원 버튼, 볼륨 버튼 등과 같은 물리 버튼을 포함할 수 있으나, 이에 한정되는 것은 아니다. 한편, 터치 패드는 디스플레이부와 일체로 형성된 터치스크린일 수 있다. 배터리는 일정한 크기의 용량을 가지며, 유무선을 통해 충전 가능하며, 컴퓨팅 장치의 각 구성 요소 들에 전력을 공급할 수 있다. 이하, 도 3를 참조하여, 광고영상을 디스플레이하는 영상 표시 장치의 하드웨어 구성에 대해 설명하도록 한다. 도 3은 본 발명의 일 실시예에 따른 영상 표시 장치의 하드웨어 구성도이다. 도 4는 본 발명의 일 실시예에 따 른 영상 표시 장치의 사용 상태도를 도시한 것이다. 도 3를 참조하면, 본 발명의 일 실시예에 따른 영상 표시 장치는 하나 이상의 프로세서, 프로세서 에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 통신 인터페이스 및 컴퓨 터 프로그램을 저장하는 스토리지를 포함할 수 있다. 나아가, 영상 표시 장치는 출력부, A/V입력부, 사용자 입력부 중 적어도 하나를 더 포함할 수 있다. 영상 표시 장치의 프로세서, 메모리, 통신 인터페이스, 스토리지 각각은, 컴퓨팅 장 치의 프로세서, 메모리, 통신 인터페이스, 스토리지 각각에 대한 설명을 그대로 적용 할 수 있으며, 중복된 설명은 생략하기로 한다. 또한, 영상 표시 장치의 출력부, A/V 입력부, 사용자 입력부 각각은, 컴퓨팅 장치의 출력부, A/V 입력부, 사용자 입력부 각각에 대한 설명을 그대로 적용할 수 있으며, 중복된 설명은 생략하기로 한다. 도 4를 참조하면, 본 발명의 일 실시예에 따른 영상 표시 장치는 백화점과 같은 외부 공간에 설치되어 사 용자에게 광고영상을 제공할 수 있다(도 13 참조). 다양한 실시예에서, 영상 표시 장치는 상부 베젤과, 상부 베젤의 하부로 연장된 디스플레이부 를 포함할 수 있다. 여기서, 상부 베젤은 영상 표시 장치의 상측에 직육면체 형상을 가질 수 있 다. 상부 베젤의 내측에 프로세서, 메모리, 통신 인터페이스, 스토리지, 음향 출력부 , A/V입력부, 물리버튼 중 적어도 하나가 구비될 수 있다. 또한, 카메라는 영상 표시 장치의 전면 혹은 후면에 설치될 수 있으며, 구체적으로는 상부 베젤(20 2)에 설치될 수 있다. 카메라는 디스플레이부를 전방 혹은 후방을 실시간 혹은 일정한 시간 간격으 로 촬영할 수 있다. 다양한 실시예에서, 영상 표시 장치는 카메라를 통해 촬영된 이미지에서 사용자의 다양한 손 동작을 인식할 수 있다. 도 14에 도시된 바와 같이, 사용자는 영상 표시 장치의 전방 혹은 후방에서 손 동작을 취 할 수 있다. 이 경우, 카메라에 의해 사용자의 손 동작이 촬영될 경우, 영상 표시 장치는 스토리지에 저장된 손 동작 분류 인공지능 모델을 이용하여 사용자의 손 동작의 사진 이미지로부터 손 동작을 인식할 수 있다. 예를 들어, 손 동작 인공지능 모델은 특정 손 동작의 사진 이미지에 다른 숫자들로 각각 라벨링된 데이터를 학습 데 이터로 학습된 인공지능 모델일 수 있다. 즉, 숫자 1~10에 각각 매칭된 손 동작의 사진 이미지를 학습 데이터로 사용할 수 있다. 따라서, 영상 표시 장치는 손 동작 인공지능 모델을 활용하여 사용자가 취한 손 동작의 사진 이미지를 이 용해 손 동작이 의미하는 숫자를 획득할 수 있다. 이를 통해서, 사용자는 영상 표시 장치의 디스플레이부 상이 터치패드을 직접적으로 터치하지 않더라도 손 동작을 이용해 영상 표시 장치에게 숫자 입 력을 제공할 수 있다. 나아가, 영상 표시 장치는 사용자의 손 동작을 통해 수신된 숫자 입력은 화면에 따라 다르게 인식할 수 있 다. 예를 들어, 디스플레이부 상에 문자 입력 커서가 활성화된 경우 영상 표시 장치는 손 동작을 통 해 숫자를 입력하는 것으로 인식할 수 있다. 또는, 디스플레이부 상에 특정 옵션이 실행되고 있다면, 영상 표시 장치는 도 14의 '1'해당하는 손 동작은 'YES'를 의미하고, '2'에 해당하는 손 동작은 'NO'를 의미할 수 있다. 즉, 영상 표시 장치는 화면에 따라서 사용자의 손 동작에 대한 정보를 숫자가 아닌 다른 의미로 인식할 수 있다. 또한, 디스플레이부는 전면 및 후면 중 적어도 하나의 면에서 광고영상을 디스플레이할 수 있다. 디스플레 이부은 투명 디스플레이 패널로 구성되거나, 2개의 불투명 디스플레이 패널을 전후면에 각각 배치하여 구 성될 수 있다. 이하, 도 5를 참조하여, 관리서버의 하드웨어 구성에 대해 설명하도록 한다. 도 5는 본 발명의 일 실시예에 따른 관리서버의 하드웨어 구성도이다. 도 5를 참조하면, 본 발명의 일 실시예에 따른 관리서버는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 통신 인터페이스 및 컴퓨터 프로그 램을 저장하는 스토리지를 포함할 수 있다. 관리서버의 프로세서, 메모리, 통신 인터페이스, 스토리지 각각은, 컴퓨팅 장치(10 0)의 프로세서, 메모리, 통신 인터페이스, 스토리지 각각에 대한 설명을 그대로 적용할 수 있으며, 중복된 설명은 생략하기로 한다. 다양한 실시예에서, 관리서버는 광고영상을 영상 표시 장치에 송출하여 영상 표시 장치에서 광 고영상이 디스플레이 되도록 한다. 다양한 실시예에서, 도 13을 참조하면, 관리서버는 광고영상을 획득하고(S310), 광고영상 속 객체를 인식 하고(S320), 인식된 객체에 매핑된 객체 식별코드를 생성하거나 광고영상에 매칭된 광고 식별코드를 생성할 수 있다(S330). 여기서, 관리서버는 광고영상 속에 객체 식별코드 혹은 광고 식별코드를 삽입한 송출용 광고영상을 생성하 고 영상 표시 장치에게 송출할 수 있다(S331). 객체 식별코드는 광고영상 속 객체에 대한 식별정보를 가질 수 있다. 또한, 광고 식별코드는 해당 광고영상에 대한 식별 정보를 가질 수 있다. 다양한 실시예에서, 관리서버는 광고영상의 각 프레임 이미지를 학습 데이터로 인공지능 모델을 학습시킬 수 있다(S340). 여기서, 광고영상은 객체 식별코드 혹은 광고 식별코드가 포함되지 않을 수도 있으며, 포함된 송출용 광고영상일 수도 있다. 관리서버는 광고영상 혹은 객체의 이미지를 수신할 수 있다(S111). 이 경우, 학습된 인공지능 모델은 광고영상의 각 프레임 이미지의 전체 또는 일부분이 입력된 경우에 광고영상에 대한 정보 혹은 광고영상 속 객체에 대한 정보를 출력할 수 있다(S350). 다양한 실시예에서, 관리서버는 컴퓨팅 장치로부터 수신된 제1 광고영상 속 제1 객체에 대한 이미지 를 인공지능 모델에 입력하여 제1 광고영상에 대한 정보 혹은 제1 객체에 대한 정보를 출력할 수 있으며, 컴퓨 팅 장치에게 제1 광고 식별정보 혹은 제1 객체 식별정보를 송신할 수 있다(S351). 이하, 도 6를 참조하여, 컴퓨팅 장치에 의해 수행되는 오프라인 광고영상을 통해 음성인식 반응형 3D 아바 타를 이용한 가상 플랫폼 서비스 제공 방법에 대해 설명하도록 한다. 도 6는 본 발명의 일 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫 폼 서비스 제공 방법의 순서도이다. 도 7은 영상 표시 장치에 의해 표시된 광고영상이 컴퓨팅 장치에 의해 스캔 되는 모습을 도시한 것이다. 도 8은 영상 표시 장치에 의해 표시된 광고영상에서 광고 식별코드, 객체 식별코드, 객체가 컴퓨팅 장치에 의해 인식되는 모습을 도시한 것이다. 도 9는 음성인식 반응형 3D 아바타가 컴 퓨팅 장치에 의해 화면 상에 표시되는 것이다. 도 6및 도 7을 참조하면, S110 과정에서, 컴퓨팅 장치는 영상 표시 장치에서 표시되는 광고영상을 카 메라를 통해 스캔할 수 있다. 이 경우, 영상 표시 장치는 관리서버로부터 광고영상을 수신하여 디스플레이부를 통해 표시할 수 있다. 여기서, 광고영상은 제1 광고영상, 제1 광고영상 보다 이전에 표시된 제2 광고영상, 제1 광고영상 보 다 이후에 표시된 제3 광고영상을 포함할 수 있다. 또한, 광고영상은 복수의 객체에 대한 이미지와, 각 객체에 매핑된 각 객체 식별코드에 대한 이미지 및 각 광 고영상에 매핑된 각 광고 식별코드에 대한 이미지 중 적어도 하나를 포함할 수 있다. 또한, 객체는 광고영상에서 광고하는 의류나 자동차와 같은 사물, 광고를 위해 등장하는 사람, 풍경 속 생물 등 중 하나일 수 있다. 또한, 객체 식별코드는 각 객체에 일대일로 매칭되어 각 객체 식별정보를 가질 수 있다. 또 한, 광고 식별코드는 각 광고영상에 일대일로 매칭되어 각 광고 식별정보를 가질 수 있다. 또한, 객체 식별코드는 QR 코드 혹은 바코드를 포함할 수 있다. 광고 식별코드는 QR 코드 혹은 바코드를 포함할 수 있다. 예를 들어, 제1 광고영상은 제1 객체에 대한 이미지와, 상기 제1 객체에 매핑된 제1 객체 식별코드에 대한 이미 지 및 제1 광고영상에 매핑된 제1 광고 식별코드에 대한 이미지 중 적어도 하나를 포함할 수 있다. 도 7을 참조하면, 제1 객체(obj1)는 여성이 착용 중인 머플러일 수 있다. 또한, 제1 객체 식별코드(oic1)는 제1 객체인 머플러에 매칭된 QR 코드로서, 디스플레이부에 의해 표시되는 머플러 위에 표시될 수 있다. 또한, 제1 광고 식별코드(aic1)는 제1 객체가 포함된 제1 광고영상에 매칭된 QR코드로서, 디스플레이부에 의해 표시되는 제1 광고영상 위에 표시될 수 있다. S120 과정에서, 컴퓨팅 장치는 광고영상에서 객체, 객체 식별코드 및 광고 식별코드 중 적어도 하나를 인식함으써, 객체 식별정보 및 광고 식별정보 중 적어도 하나를 획득할 수 있다. 도 8을 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 광고영상 중 제1광고영상이 영상 표시 장치에서 표시될 때 제1 광고영상을 스캔함으로써, 제1 광고영상 속 제1 객체 (obj1) 자체를 인식할 수 있다(S3의 경우). 여기서, 컴퓨팅 장치는 제1 객체(obj1)에 대한 이미지를 관리서버에 송신할 수 있으며, 관리서버 에서 인공지능 모델을 이용해 제1 객체(obj1)에 대한 이미지로부터 인식된 제1 객체에 대한 제1 객체 식별 정보를 수신할 수 있다. 또는, 컴퓨팅 장치는 제1 객체에 대한 이미지를 관리서버에 송신하고, 관리 서버에서 인공지능 모델을 이용해 제1 객체에 대한 이미지로부터 인식된 제1 객체가 포함된 제1 광고영상에 대한 제1 광고 식별정보를 수신할 수 있다. 한편, 관리서버는 광고영상의 각 프레임에 해당하는 이미지들을 이용하여 인공지능 모델을 학습시킬 수 있 으며, 학습된 인공지능 모델은 이미지에 포함된 객체들을 인식할 수 있으며, 관리서버는 학습된 인공지능 모델을 이용하여 컴퓨팅 장치에서 송신한 객체에 대한 이미지로부터 객체를 인식하고, 객체에 대한 객체 식별정보를 스토리지(미도시)에서 찾아내어, 컴퓨팅 장치에게 송신할 수 있다. 또한, 인공지능 모델에 학 습되는데 사용된 광고영상은 관리서버에서 영상 표시 장치로 송신되어 영상 표시 장치의 디스플 레이부를 통해 디스플레이 된다(도 13의 S331, S340, S350 참조). 도 8을 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 광고영상 중 제1광고영상이 영상 표시 장치에서 표시될 때 제1 광고영상을 스캔함으로써, 제1 광고영상 속 제1 객체에 매핑된 제1 객체 식별코드를 인식할 수 있다(S2의 경우). 여기서, 컴퓨팅 장치는 인식된 제1 객체 식별코드로부터 상기 제1 객체의 제1 객체 식별 정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득할 수 있다. 도 8을 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 광고영상 중 제1광고영상이 영상 표시 장치에서 표시될 때 제1 광고영상을 스캔함으로써, 제1 광고영상 속 제1 광고영상에 매핑된 제1 광고 식별코드를 인식할 수 있다(S1의 경우). 여기서, 컴퓨팅 장치는 인식된 제1 광고 식별코드로부터 상기 제1 객체의 제1 객체 식별정보 및 상기 제1 광고영상의 제1 광고 식별정보 중 적어도 하나를 획득할 수 있다. 한편, 제1 객체 식별정보는 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공하는 컴퓨터 프로그램 을 설치할 수 있는 링크 주소 정보, 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공하는 웹 링크 주소 정보, 컴퓨팅 장치에 설치된 컴퓨터 프로그램을 통한 음성인식 반응형 3D 아바타를 이용한 가상 플랫 폼 서비스 제공 화면 정보, 제1 객체에 대한 상세 설명 혹은 판매 정보 중 적어도 하나를 포함할 수 있다. 한편, 제1 광고 식별정보는 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공하는 컴퓨터 프로그램 을 설치할 수 있는 링크 주소 정보, 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공하는 웹 링크 주소 정보, 컴퓨팅 장치에 설치된 컴퓨터 프로그램을 통한 음성인식 반응형 3D 아바타를 이용한 가상 플랫 폼 서비스 제공 화면 정보, 제1 객체가 나오는 제1 광고영상에 대한 정보 중 적어도 하나를 포함할 수 있다. 여기서, 컴퓨팅 장치는 제1 객체 식별정보 및 제1 광고 식별정보 중 적어도 하나를 획득한 후에 리다이렉 트 기술을 이용해 제1 객체 식별정보 및 제1 광고 식별정보에 포함된 링크 주소를 로드하여 웹 페이지를 열 수 있다. 즉, 컴퓨팅 장치는 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공하는 컴퓨터 프로 그램의 설치 페이지 혹은 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공하는 웹 페이지로 리다 이렉트할 수 있다. S130 과정에서, 컴퓨팅 장치는 디스플레이부에 의해, 구현된 증강현실 또는 가상세계 상에 3D 아바타 를 표시하면서, 음향 출력부에 의해, 선택 가능한 복수의 옵션들을 음성으로 안내할 수 있다. 다만, 이에 한정될 것은 아니며, 2D 아바타가 디스플레이부 상에 표시될 수도 있다. 도 9을 참조하면, 여기서 컴퓨팅 장치는, 웹 브라우저 혹은 컴퓨팅 장치에 설치된 컴퓨터 프로그램을 통해 음성인식 반응형 3D 아바타를 디스플레이부 상에 표시하고, 복수의 옵션에 대한 정보를 음성으로 안 내할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 카메라를 통해 실시간으로 촬영되면서 디스플레이부 상에 제 공되는 실시간 촬영 영상 위에 3D아바타를 표시할 수 있다. 이 경우, 실시간 촬영 영상 속에 영상 표시 장치 에 표시되는 제1 광고 영상이 포함된 경우, 컴퓨팅 장치는 제1 객체 식별정보 및 제1 광고 식별정보 중 적어도 하나를 이용하여 3D 아바타(혹은 화살표)가 제1 객체를 가르키도록 영상을 표시할 수 있다. 또는, 컴퓨팅 장치는 스토리지에 저장된 가상세계에 관한 영상 위에 3D아바타를 표시할 수 있다. 이 경우, 컴퓨팅 장치는 제1 객체 식별정보 및 제1 광고 식별정보 중 적어도 하나를 이용하여 가상세계 상에 제1 객체 혹은 제1 광고영상을 표시할 수 있으며, 3D아바타(혹은 화살표)가 제1 객체 혹은 제1 광고영상을 가르 키도록 영상을 표시할 수 있다. 또는, 컴퓨팅 장치는 제1 객체 식별정보 및 제1 광고 식별정보 중 적어도 하나를 이용하여 카메라를 통해서 스캔되어 인식된 객체 혹은 광고영상이 제1 객체 혹은 제1 광고영상이 맞는지 확인하는 음성을 안내할 수 있다. 또는, 컴퓨팅 장치는 선택 가능한 복수의 옵션들의 버튼들을 디스플레이부 상에 표시할 수 있다. 혹 은, 컴퓨팅 장치는 3D 아바타가 영상 위에 표시되는 중에 물리버튼이 눌리는 경우에 선택 가능한 복 수의 옵션들의 버튼들을 디스플레이부 상에 나타나도록 표시할 수 있다. 또는, 컴퓨팅 장치는 선택 가능한 복수의 옵션들에 대한 음성(예로, 무엇을 도와드릴까요? 이렇게 말씀해 주세요. “코인 받기”, “이모 티콘 받기“, “간단한 게임“, “광고 보기”)을 음향 출력부를 통해 사용자에게 제공할 수 있다. 선택 가능한 복수의 옵션들은 코인에 대한 옵션, 이모티콘에 대한 옵션, 게임에 대한 옵션, 광고영상에 관한 옵 션, 미세먼지에 대한 옵션, 황사에 관한 옵션, 날씨에 관한 옵션, 코로나 방역에 관한 옵션, 교통정보에 관한 옵션, 지진이나 쓰나미에 관한 옵션, 이벤트(미션)에 관한 옵션 중 적어도 하나를 포함할 수 있다. S140 과정에서, 컴퓨팅 장치는 마이크로폰에 의해 사용자의 선택 옵션에 대한 음성 정보를 수신하거 나, 사용자 입력부에 의해 사용자의 선택 옵션에 대한 입력 정보를 수신할 수 있다. 사용자는 선택하고자 하는 옵션을 음성으로 말하거나, 사용자 입력부를 조작하여 선택할 수 있다. S150 과정에서, 컴퓨팅 장치는 디스플레이부에 의해, 선택 옵션에 대한 음성정보 또는 선택 옵션에 대한 입력정보에 기초해 선택된 옵션 화면으로 전환하여 표시할 수 있다. 즉, 컴퓨팅 장치는 선택된 옵션 을 수행하도록 화면을 구성할 수 있다. 다양한 실시예에서, 컴퓨팅 장치는 사용자의 선택 옵션에 대한 음성 정보를 수신하고, 음성 분류 인공지능 모델을 활용하여 선택 옵션에 대한 음성 정보를 분석하여 사용자가 선택한 옵션을 분류할 수 있다. 예를 들어, 사용자가 \"코인 받기\"라고 말하면, 컴퓨팅 장치는 사용자의 음성을 마이크로폰으로 획득하고, 음성 분류 인공지능 모델에 입력하여 사용자의 음성이 \"코인 받기\" 인 것을 인식할 수 있다. 이후, 컴퓨팅 장치는 사용자의 선택 옵션에 해당하는 옵션의 화면으로 전환하여 디스플레이부 상에 표시할 수 있다. 다시 말해, 컴퓨팅 장치는 사용자가 선택한 옵션을 수행할 수 있다. 여기서, 컴퓨팅 장치 는 선택된 옵션에 해당하는 프로그램을 실행하거나, 선택된 옵션을 수행할 수 있는 웹 페이지로 이동할 수 있다. 도 10(a)는 일 실시예에 따른 코인에 대한 옵션을 실행한 화면을 구성한 것이다. 도 10(b)는 일 실시예에 따른 이모티콘에 대한 옵션을 실행한 화면을 구성한 것이다. 도 11은 일 실시예에 따른 게임에 대한 옵션을 실행한 화면을 구성한 것이다. 도 12(a) 및 도 12(b)는 일 실시예에 따른 광고에 관한 옵션을 실행한 화면을 구성한 것 이다. 도 10(a)를 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 코인에 대한 옵션(예로, 코인 받기)을 실행할 경 우 사용자에게 코인을 지급하기 위한 화면을 디스플레이부 상에 표시할 수 있다. 여기서, 컴퓨팅 장치는 코인을 사용자에게 지급하기 위한 정보를 입력 받아 저장하거나, 관리서버에 게 송신할 수 있다. 예를 들어, 코인 지급을 위한 정보는 코인종류, 지갑주소, 태그정보, 이름, 이메일, 전화번 호 등을 포함할 수 있다. 이 경우, 관리서버는 코인 지급을 위한 정보에 기초하여 일정한 시간 간격으로 혹은 일정한 기한 내로 사용자에게 코인을 지급할 수 있다. 도 10(b)를 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 이모티콘에 대한 옵션(예로, 이모티콘 받기)을 실행할 경우 사용자에게 이모티콘을 지급하기 위한 화면을 디스플레이부 상에 표시할 수 있다. 여기서, 컴 퓨팅 장치는 복수의 이모티콘을 사용자에게 제시하고 사용자가 선택한 이모티콘에 기초해 사용자에게 선택 한 이모티콘을 지급할 수 있다. 도 11을 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 게임에 대한 옵션(예로, 간단한 게임)을 실행할 경 우 사용자에게 게임 선택 화면을 제공하고, 선택된 게임을 수행할 수 있다. 게임 선택 화면은 사다리게임, 오목 게임, 체스게임, 룰렛게임, 연산게임 중 적어도 하나를 포함할 수 있다. 사용자에 의해 하나의 게임이 선택된 경우에 컴퓨팅 장치는 선택된 게임을 실행할 수 있다. 일 예로, 사다리 게임이 실행된 경우에, 컴퓨팅 장치는 총 게임 인원을 선택하는 화면, 내기 내용(예로, 당첨 혹은 꽝)을 입력하는 화면, 사다리 게임이 실행되는 화면으로 구성될 수 있다. 도 12(a) 및 도 12(b)를 참조하면, 다양한 실시예에서, 컴퓨팅 장치는 광고에 대한 옵션(예로, 광고 보 기)을 실행할 경우, 카메라를 통해 스캔되어 획득된 객체 식별정보 및 광고 식별정보 중 어느 하나에 기초 해 사용자에게 광고영상에 대한 페이지를 제공하거나, 객체에 대한 상세 설명 혹은 판매 페이지를 제공할 수 있 다.상세히는, 컴퓨팅 장치가 영상 표시 장치에서 디스플레이되는 제1 광고영상의 제1 광고 식별코드를 (혹은 제1 객체 식별코드) 스캔하여 제1 광고 식별정보(혹은 제1 객체 식별정보)를 획득하고, 이에 기초해서 3D 아바타를 화면에 표시하는 동시에 선택 가능한 옵션 정보를 음성으로 안내하고, 광고에 대한 옵션을 사용자가 선택한 경우 제1 광고 식별정보(혹은 제1 객체 식별정보)에 기초해 제1 광고영상에 대한 페이지를 사용자에게 제공하거나(도 12(a) 참조), 제1 광고영상 속에 포함된 제1 객체에 대한 상세 혹은 판매 정보를 사용자에게 제 공할 수 있다(도 12(b) 참조). 다양한 실시예에서, 컴퓨팅 장치는 광고에 대한 옵션(예로, 광고 보기)을 실행할 경우, 객체 식별정보 및 광고 식별정보 중 어느 하나에 기초해 사용자에게 광고영상에 대한 페이지를 제공할 때 현재 상영되는 광고영상 뿐만 아니라 이전에 상영된 광고영상 혹은 이후에 상영될 광고영상에 대한 정보를 제공할 수 있다. 상세히는, 컴퓨팅 장치는 제1 광고영상에 대한 페이지를 통해 제1 광고영상을 제공하면서, 제1 광고영상 이전에 상영된 제2 광고영상에 대한 정보 혹은 제1 광고영상 이후에 상영될 제3 광고영상에 대한 정보를 함께 제공할 수 있다. 이를 통해, 사용자는 영상 표시 장치에서 상영 중인 제1 광고영상 뿐만 아니라, 제1 광고영상 이전에 상영 된 제2 광고영상을 다시 시청하거나 제2 광고영상에 관한 정보를 획득할 수 있으며, 또한 제1 광고영상 이후에 상영될 제3 광고영상을 새롭게 시청하거나 제3 광고영상에 관한 정보를 획득할 수 있다. 즉, 사용자는 영상 표 시 장치에서 시청 중에 미쳐 스캔을 하지 못해 놓쳐버린 광고영상이 있더라도 재시청 및 광고영상 속 객체 에 대한 정보(예로, 상세 설명 혹은 판매 정보)를 획득할 수 있다. 도시되진 않았지만, 다양한 실시예에서, 사용자가 이벤트(미션)에 관한 옵션을 선택할 경우, 컴퓨팅 장치 는 이벤트(미션)에 관한 옵션을 실행하여 사용자 행동 기반 이벤트(미션)을 진행할 수 있다. 사용자 행동 기반 이벤트(미션)은 보물 찾기 혹은 황금 열쇠 찾기 등과 같이 사용자의 위치 이동 기반 미션을 부여할 수 있다. 일 예로, 컴퓨팅 장치는 디스플레이부를 통해 사용자에게 특정 대상의 위치 혹은 영상 표시 장치의 위치 를 제공할 수 있으며, 사용자는 해당 위치로 이동하여 특정 대상, 영상 표시 장치에 부착된 장치 식별코드 혹은 영상 표시 장치에서 상영되는 광고영상을 카메라로 스캔함으로써, 행동 기반 이벤트(미션)을 수행 완 료할 수 있다. 컴퓨팅 장치는 스캔을 통해서 사용자 행동 기반 이벤트(미션)이 수행 완료됨을 확인한 경우 에 사용자 계정에 코인이나 적립금을 제공할 수 있다. 도 13을 참조하면, S220 과정에서, 영상 표시 장치는 영상 표시 장치에서 상영되는 광고영상을 스캔 하는 컴퓨팅 장치 혹은 컴퓨팅 장치을 파지한 사람을 인식할 수 있다. 혹은 영상 표시 장치는 카메라을 통해 촬영된 사용자의 손 동작을 인식할 수 있다. 여기서, 영상 표시 장치는 실시간 혹은 일정한 시간 간격으로 카메라를 통해서 전방 혹은 후방을 촬 영할 수 있다. 영상 표시 장치는 촬영된 사진 이미지에서 영상 표시 장치를 컴퓨팅 장치를 이용 해 촬영(스캔)하고 있는 컴퓨팅 장치 혹은 사람 혹은 사용자의 손 동작을 분류할 수 있다. 만약, 영상 표 시 장치가 사진 이미지 속에 광고영상을 스캔하는 컴퓨팅 장치 혹은 사람 혹은 사용자의 손 동작을 확인한 경우에 해당 광고영상에 대한 정보를 디스플레이부를 통해 제공할 수 있다. 또는, S230 과정에서, 만약, 영상 표시 장치가 사진 이미지 속에 광고영상을 스캔하는 컴퓨팅 장치 혹은 사람 혹은 사용자의 손 동작을 확인한 경우에, 디스플레이부에 의해, 구현된 증강현실 또는 가상세계 상에 음성인식 반응형3D 아바타를 표시하면서, 음향 출력부에 의해, 선택 가능한 복수의 옵션들을 음성으 로 안내할 수 있다. 다만, 이에 한정될 것은 아니며, 2D 아바타가 디스플레이부 상에 표시될 수도 있다. 이 경우, 영상 표시 장치는 디스플레이부 상에서 상영 중인 광고영상의 광고 식별정보를 획득할 수 있다. 선택 가능한 복수의 옵션들은 코인에 대한 옵션, 이모티콘에 대한 옵션, 게임에 대한 옵션, 광고영상에 관한 옵 션, 미세먼지에 대한 옵션, 황사에 관한 옵션, 날씨에 관한 옵션, 코로나 방역에 관한 옵션, 교통정보에 관한 옵션, 지진이나 쓰나미에 관한 옵션, 이벤트(미션)에 관한 옵션 중 적어도 하나를 포함할 수 있다. S240 과정에서, 영상 표시 장치는 마이크로폰에 의해 사용자의 선택 옵션에 대한 음성 정보를 수신하 거나, 사용자 입력부에 의해 사용자의 선택 옵션에 대한 입력 정보를 수신하거나, 카메라을 통해 각 선택 옵션에 매칭된 사용자의 손 동작을 통해 선택 옵션을 획득할 수 있다. 사용자는 선택하고자 하는 옵션을 음성으로 말하거나, 사용자 입력부를 조작하여 선택하거나, 손 동작을 취함으로써 옵션을 선택할 수 있다. S250 과정에서, 영상 표시 장치는 디스플레이부에 의해, 선택 옵션에 대한 음성정보 또는 선택 옵션 에 대한 입력정보 또는 손 동작을 통한 선택 정보에 기초해 선택된 옵션 화면으로 전환하여 표시할 수 있다. 즉, 영상 표시 장치는 선택된 옵션을 수행하도록 화면을 구성할 수 있다. 한편, 영상 표시 장치에서 수행되는 S230 과정, S240 과정, S250 과정들은 컴퓨팅 장치에서 수행되는 S130 과정, S140 과정, S150 과정들에 대한 설명을 기술적 모순이 되지 않는 한도에서 그대로 적용할 수 있다. 다양한 실시예에서, 영상 표시 장치는 코인에 대한 옵션(예로, 코인 받기)을 실행할 경우 사용자에게 코인 을 지급하기 위한 화면을 디스플레이부 상에 표시할 수 있다. 여기서, 영상 표시 장치는 코인을 사용자에게 지급하기 위한 정보를 입력 받아 저장하거나, 관리서버(30 0)에게 송신할 수 있다. 예를 들어, 코인 지급을 위한 정보는 코인종류, 지갑주소, 태그정보, 이름, 이메일, 전 화번호 등을 포함할 수 있다. 이 경우, 관리서버는 코인 지급을 위한 정보에 기초하여 일정한 시간 간격으 로 혹은 일정한 기한 내로 사용자에게 코인을 지급할 수 있다. 다양한 실시예에서, 영상 표시 장치는 이모티콘에 대한 옵션(예로, 이모티콘 받기)을 실행할 경우 사용자 에게 이모티콘을 지급하기 위한 화면을 디스플레이부 상에 표시할 수 있다. 여기서, 영상 표시 장치 는 복수의 이모티콘을 사용자에게 제시하고 사용자가 선택한 이모티콘에 기초해 사용자에게 선택한 이모티콘을 지급할 수 있다. 다양한 실시예에서, 영상 표시 장치는 게임에 대한 옵션(예로, 간단한 게임)을 실행할 경우 사용자에게 게 임 선택 화면을 제공하고, 선택된 게임을 수행할 수 있다. 게임 선택 화면은 사다리게임, 오목게임, 체스게임, 룰렛게임, 연산게임 중 적어도 하나를 포함할 수 있다. 사용자에 의해 하나의 게임이 선택된 경우에 영상 표시 장치는 선택된 게임을 실행할 수 있다. 일 예로, 사다리 게임이 실행된 경우에, 영상 표시 장치는 총 게임 인원을 선택하는 화면, 내기 내용(예로, 당첨 혹은 꽝)을 입력하는 화면, 사다리 게임이 실행되는 화면으로 구성될 수 있다. 다양한 실시예에서, 영상 표시 장치는 광고에 대한 옵션(예로, 광고 보기)을 실행할 경우, 디스플레이부 을 통해 상영되고 있는 광고영상에 대한 페이지를 제공하거나, 광고영상 속 객체에 대한 상세 설명 혹은 판매 페이지를 제공할 수 있다. 다양한 실시예에서, 영상 표시 장치는 광고에 대한 옵션(예로, 광고 보기)을 실행할 경우, 현재 상영 중인 광고영상에 대한 페이지를 제공할 때 현재 상영되는 광고영상 뿐만 아니라 이전에 상영된 광고영상 혹은 이후에 상영될 광고영상에 대한 정보를 제공할 수 있다. 영상 표시 장치는 상술한 옵션을 실행하는 중에 카메라을 통해 사용자의 손 동작을 인식할 수 있으며, 사용자의 손 동작으로부터 손 동작에 매칭된 숫자 혹은 입력 정보를 획득할 수 있다. 이를 통해, 사용 자는 영상 표시 장치를 터치하지 않고, 사용자의 손 동작만으로 실행 중인 다양한 옵션에서 화면 전환, 방 향키 입력, '예/아니오'와 같은 선택 정보, 숫자 정보 입력 등을 수행할 수 있다. 전술한 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 방법은 도면에 도시된 순서도를 참조하여 설명하였다. 간단한 설명을 위해 오프라인 광고영상을 통해 음성인식 반응형 3D 아바 타를 이용한 가상 플랫폼 서비스 제공 방법은 일련의 블록들로 도시하여 설명하였으나, 본 발명은 상기 블록들 의 순서에 한정되지 않고, 몇몇 블록들은 본 명세서에 도시되고 시술된 것과 상이한 순서로 수행되거나 또는 동 시에 수행될 수 있다. 또한, 본 명세서 및 도면에 기재되지 않은 새로운 블록이 추가되거나, 일부 블록이 삭제 또는 변경된 상태로 수행될 수 있다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 등록청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0018264", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 시스템을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 사용자 단말의 하드웨어 구성도이다. 도 3은 본 발명의 일 실시예에 따른 영상 표시 장치의 하드웨어 구성도이다. 도 4는 본 발명의 일 실시예에 따른 영상 표시 장치의 사용 상태도를 도시한 것이다. 도 5는 본 발명의 일 실시예에 따른 관리서버의 하드웨어 구성도이다. 도 6는 본 발명의 일 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫 폼 서비스 제공 방법의 순서도이다. 도 7은 영상 표시 장치에 의해 표시된 광고영상이 컴퓨팅 장치에 의해 스캔되는 모습을 도시한 것이다. 도 8은 영상 표시 장치에 의해 표시된 광고영상에서 광고 식별코드, 객체 식별코드, 객체가 컴퓨팅 장치에 의해 인식되는 모습을 도시한 것이다. 도 9는 음성인식 반응형 3D 아바타가 컴퓨팅 장치에 의해 화면 상에 표시되는 것이다. 도 10(a)는 일 실시예에 따른 코인에 대한 옵션을 실행한 화면을 구성한 것이다. 도 10(b)는 일 실시예에 따른 이모티콘에 대한 옵션을 실행한 화면을 구성한 것이다. 도 11은 일 실시예에 따른 게임에 대한 옵션을 실행한 화면을 구성한 것이다. 도 12(a) 및 도 12(b)는 일 실시예에 따른 광고에 관한 옵션을 실행한 화면을 구성한 것이다. 도 13은 본 발명의 실시예에 따른 오프라인 광고영상을 통해 음성인식 반응형 3D 아바타를 이용한 가상 플랫폼 서비스 제공 시스템의 흐름도를 도시한 도면이다. 도 14는 사용자의 다양한 손 동작을 도시한 것이다."}
