{"patent_id": "10-2018-0039878", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0116820", "출원번호": "10-2018-0039878", "발명의 명칭": "뉴로모픽 시스템에 적용가능한 멤리스터 및 용액 공정에 기반한 금속산화물을 포함하는 멤리", "출원인": "광운대학교 산학협력단", "발명자": "하태준"}}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1 전극;상기 제1 전극에 연결된 금속산화물을 포함하며, 상기 금속산화물의 산소 공공의 전이 또는 집적에 의해 시냅스가소성 특징을 갖는 시냅스 모사층; 및상기 시냅스 모사층에 연결되며, 펄스 신호를 입력받는 제2 전극을 포함하는 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 펄스 신호에 따라 상기 시냅스 모사층에서 출력 신호의 레벨이 증가하다가 감소하며, 안정된 상태에서 상기 출력 신호의 크기가 상기 출력 신호의 초기 값이거나 상기 초기 상태보다 상승한 값인 것을 특징으로 하는신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 시냅스 모사층은 상기 펄스 신호의 크기가 기 설정된 기준 크기보다 클 때, 상기 출력 신호가 트리거되며,상기 시냅스 모사층은 상기 펄스 신호의 주기에 따라 시냅틱 가중치의 세기가 조절되는 것을 특징으로 신경모방멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제2 전극은 투명 전극으로 구현되는 것을 특징으로 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 시냅스 모사층은 (i) 출력 신호의 레벨을 일정 시간 동안 유지하지 않는 단기 가소성 모드 또는 (ii) 출력신호의 레벨을 일정 시간 동안 유지하는 장기 가소성 모드로 동작하는 것을 특징으로 하는 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 시냅스 모사층은 상기 펄스 신호의 개수에 따라 시간과 시냅틱 가중치의 관계를 나타낸 기억 곡선의 휴식시간이 포화되어 상기 단기 가소성 모드에서 상기 장기 가소성 모드로 전환되는 것을 특징으로 하는 신경모방멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 기억 곡선은 지수 함수로 표현되고, 상기 휴식 시간은 상기 기억 곡선의 독립 변수에 해당하며, 상기 펄스신호의 개수에 증가하면 상기 휴식 시간이 증가하다가 감소하는 것을 특징으로 하는 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2019-0116820-3-제5항에 있어서,상기 시냅스 모사층은 상기 펄스 신호의 폭을 조절하여 형성된 전도성 필라멘트의 위치, 크기, 개수, 또는 이들의 조합의 변화에 따라 상기 단기 가소성 모드에서 상기 장기 가소성 모드로 전환되는 것을 특징으로 하는 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 시냅스 모사층은 상기 제2 전극을 통해 양의 펄스 신호 또는 음의 펄스 신호를 입력받아 다양한 단계에서정보를 기억하는 멀티 레벨 메모리 모드로 동작하는 것을 특징으로 하는 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 시냅스 모사층은 용액 공정에 의해 상기 금속산화물을 형성하는 것을 특징으로 하는 신경모방 멤리스터."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "희생 기판에 제1 전극을 증착하는 단계;상기 제1 전극에 금속산화물을 포함하는 시냅스 모사층을 용액 공정을 이용하여 증착하는 단계; 및상기 시냅스 모사층에 제2 전극을 증착하는 단계를 포함하는 용액 공정에 기반한 신경모방 멤리스터의 제조 방법."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,(i) 금속화합물이 포함된 용액에 대하여 화학반응을 통해 금속을 분리한 후 상기 금속을 산화시키거나 (ii) 파우더 형태의 금속과 산소를 포함하는 용액을 화학반응시켜 상기 금속을 산화시키는 것을 특징으로 하는 용액 공정에 기반한 신경모방 멤리스터의 제조 방법."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 희생 기판과 상기 제1 전극을 분리하는 단계를 추가로 포함하는 것을 특징으로 하는 용액 공정에 기반한신경모방 멤리스터의 제조 방법."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "상호 연결되어 네트워크를 구축하는 복수의 시냅스 모사 소자를 포함하며,상기 시냅스 모사 소자는,제1 전극;상기 제1 전극에 연결된 금속산화물을 포함하며, 상기 금속산화물의 산소 공공의 전이 또는 집적에 의해 시냅스가소성 특징을 갖는 시냅스 모사층; 및상기 시냅스 모사층에 연결되며, 펄스 신호를 입력받는 제2 전극을 포함하는 것을 특징으로 하는 포함하는 뉴로모픽 시스템."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 펄스 신호에 따라 상기 시냅스 모사층에서 출력 신호의 레벨이 증가하다가 감소하며, 안정된 상태에서 상기 출력 신호의 크기가 상기 출력 신호의 초기 값이거나 상기 초기 상태보다 상승한 값이며,공개특허 10-2019-0116820-4-상기 시냅스 모사층은 상기 펄스 신호의 크기가 기 설정된 기준 크기보다 클 때, 상기 출력 신호가 트리거되며,상기 시냅스 모사층은 상기 펄스 신호의 주기에 따라 시냅틱 가중치의 세기가 조절되는 것을 특징으로 뉴로모픽시스템."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 시냅스 모사층은 (i) 출력 신호의 레벨을 일정 시간 동안 유지하지 않는 단기 가소성 모드 또는 (ii) 출력신호의 레벨을 일정 시간 동안 유지하는 장기 가소성 모드로 동작하는 것을 특징으로 하는 뉴로모픽 시스템."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 시냅스 모사층은 상기 펄스 신호의 개수에 따라 시간과 시냅틱 가중치의 관계를 나타낸 기억 곡선의 휴식시간이 포화되어 상기 단기 가소성 모드에서 상기 장기 가소성 모드로 전환되며, 상기 기억 곡선은 지수 함수로 표현되고, 상기 휴식 시간은 상기 기억 곡선의 독립 변수에 해당하며, 상기 펄스신호의 개수에 증가하면 상기 휴식 시간이 증가하다가 감소하는 것을 특징으로 하는 뉴로모픽 시스템."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 시냅스 모사층은 상기 펄스 신호의 폭을 조절하여 형성된 전도성 필라멘트의 위치, 크기, 개수, 또는 이들의 조합의 변화에 따라 상기 단기 가소성 모드에서 상기 장기 가소성 모드로 전환되는 것을 특징으로 하는 뉴로모픽 시스템."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 시냅스 모사층은 상기 제2 전극을 통해 양의 펄스 신호 또는 음의 펄스 신호를 입력받아 다양한 단계에서정보를 기억하는 멀티 레벨 메모리 모드로 동작하는 것을 특징으로 하는 뉴로모픽 시스템."}
{"patent_id": "10-2018-0039878", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14항에 있어서,상기 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하는 펄스 처리기를 추가로 포함하는 것을 특징으로 하는 뉴로모픽 시스템."}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 실시예들은 입력 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하여 금속산화물 기반의 멤리스터로 형성된 시냅스 모사층의 전도 상태를 변환시킴으로써, 정밀한 시냅스 가소성 특성을 구현하고, 시냅스 가소성 특 성을 단기 가소성에서 장기 가소성으로 전환하기 위한 기준을 제시할 수 있는 뉴로모픽 시스템에 적용가능한 멤 리스터 및 용액 공정 기반의 고품질 금속산화물 멤리스터의 제조 방법을 제공한다."}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명이 속하는 기술 분야는 용액 공정에 기반한 멤리스터 제조 방법, 금속산화물을 포함하는 멤리스터, 및 뉴로모픽 시스템에 관한 것이다."}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 뇌에는 수천억 개의 신경 세포(뉴런)가 존재하며, 서로 복잡한 신경망으로 구성되어 있다. 도 1을 참조하면, 뉴 런(Neuron)은 수천 개의 다른 뉴런과 신호를 주고 받는 시냅스를 통해 학습, 기억 등 지적 능력을 발휘한다. 뉴 런은 신경계의 구조적, 기능적 단위이며 정보 전달의 기본 단위이다. 시냅스는 뉴런 사이의 접합부를 가리키며 어느 하나의 뉴런의 축색 돌기와 다른 뉴런의 수상 돌기가 연결된 부위를 말한다. 다시 말해 한 개의 뉴런은 수 천 개의 다른 뉴런과 시냅스로 이루어져 있다.인간의 뇌 구조를 모방한 뉴로모픽 시스템은 폰뉴이만 방식의 컴퓨팅 시스템의 한계, 즉, 가변성, 낮은 출력량, 고장 방지 능력 등을 극복하는 대안으로써 최근 들어 이에 대한 많은 연구들이 행해지고 있다. 뉴로모픽 칩은 불특정한 환경에 스스로 적응할 수 있는 지능화된 시스템을 구현하는 데에 효과적으로 활용될 수 있다. 이 기술이 발전하면 음성인식, 위험 인지, 실시간 고속 신호처리, 인지 및 추정 등을 수행하는 컴퓨터, 로봇, 가전기기, 소형 이동 기기, 보안 및 감시, 지능형 차량 안전, 자율 주행 등으로 발전할 수 있다. 일반적인 반도체 제작 기술은 작은 면적에 대규모의 인공 뉴런을 집적하는 데에 어려움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-1611222호 (2016.04.05.)"}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 입력 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하여 금속산화물 기반 멤리 스터로 형성된 시냅스 모사층의 전도 상태를 변환시킴으로써, 정밀한 시냅스 가소성 특성을 구현하고, 시냅스 가소성 특성을 단기 가소성에서 장기 가소성으로 전환하기 위한 기준을 제시하는 데 발명의 주된 목적이 있다. 본 발명의 실시예들은 금속산화물 기반 멤리스터로 형성된 시냅스 모사층을 용액 공정으로 제작하고, 대면적으 로 균일하게 고품질의금속산화물층을 전극과 결합하여 멤리스터를 제작하는데 발명의 다른 목적이 있다. 본 발명의 명시되지 않은 또 다른 목적들은 하기의 상세한 설명 및 그 효과로부터 용이하게 추론할 수 있는 범 위 내에서 추가적으로 고려될 수 있다."}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 실시예의 일 측면에 의하면 제1 전극, 상기 제1 전극에 연결된 금속산화물을 포함하며, 상기 금속산화물의 산소 공공의 전이 또는 집적에 의해 시냅스 가소성 특징을 갖는 시냅스 모사층, 및 상기 시냅스 모사층에 연결 되며, 펄스 신호를 입력받는 제2 전극을 포함하는 신경모방 멤리스터를 제공한다. 본 실시예의 다른 측면에 의하면, 희생 기판에 제1 전극을 증착하는 단계, 상기 제1 전극에 금속산화물을 포함 하는 시냅스 모사층을 용액 공정을 이용하여 증착하는 단계, 및 상기 시냅스 모사층에 제2 전극을 증착하는 단 계를 포함하는 용액 공정에 기반한 신경모방 멤리스터의 제조 방법을 제공한다. 본 실시예의 또 다른 측면에 의하면, 상호 연결되어 네트워크를 구축하는 복수의 시냅스 모사 소자를 포함하며, 상기 시냅스 모사 소자는, 제1 전극, 상기 제1 전극에 연결된 금속산화물을 포함하며, 상기 금속산화물의 산소 공공의 전이 또는 집적에 의해 시냅스 가소성 특징을 갖는 시냅스 모사층, 및 상기 시냅스 모사층에 연결되며, 펄스 신호를 입력받는 제2 전극을 포함하는 것을 특징으로 하는 포함하는 뉴로모픽 시스템을 제공한다."}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이 본 발명의 실시예들에 의하면, 입력 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어 스를 조절하여 금속산화물로 형성된 시냅스 모사층의 전도 상태를 변환시킴으로써, 정밀한 시냅스 가소성 특성 을 구현하고, 시냅스 가소성 특성을 단기 가소성에서 장기 가소성으로 전환하기 위한 기준을 제시할 수 있기에 뉴로모픽 시스템을 구현하는 효과가 있다. 본 발명의 실시예들에 의하면, 금속산화물로 형성된 시냅스 모사층을 용액 공정으로 제작함으로써, 대면적으로 균일하게 고품질의 금속산화물층을 갖는 멤리스터를 제작하고 단일 소자의 특성을 분석함으로써 뉴로모픽 시스 템을 구현할 수 있는 효과가 있다. 여기에서 명시적으로 언급되지 않은 효과라 하더라도, 본 발명의 기술적 특징에 의해 기대되는 이하의 명세서에 서 기재된 효과 및 그 잠정적인 효과는 본 발명의 명세서에 기재된 것과 같이 취급된다."}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 설명함에 있어서 관련된 공지기능에 대하여 이 분야의 기술자에게 자명한 사항으로서 본 발명 의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하고, 본 발명의 일부 실시예들 을 예시적인 도면을 통해 상세하게 설명한다. 본 명세서에 기재된 실시예들은 프로그래머블 반도체, 머신러닝, 인공지능, 컴퓨터 비전, 자율 주행 등의 분야 에 적용 가능한 뉴로모픽 지능형 반도체에 관한 것이다. 시냅스 가소성(Synaptic Plasticity)은 자극(Stimuli)에 의한 반응을 통해 시간에 따라 시냅스(Synapse)들을 강화하거나 약화할 수 있는 능력을 말한다. 시냅틱 가중치(Synaptic Weight)는 시냅틱 연결(Synaptic Connection)의 세기인데, 포스트-시냅스 포텐셜 레벨 (Post-Synapse Potential Level) 혹은 전류 레벨(Current Level)에 의해 결정된다. 활동전위(action Potentials)가 신경전달물질(Neurotransmitters)의 방출(Release)을 시작시키는 칼슘 인플럭스(Calcium Influx)를 발생시키기 위해 프리시냅틱 멤브레인(Presynaptic Membrane)에 도착하고, 시냅틱 전이(Synaptic Transition)가 일시적으로 강화된다. 단기 가소성(Short-Term Plasticity, STP)은 시냅틱 연결(Synaptic Connections)의 일시적 변화(Temporal Modification)인데, 계속되는 시냅틱 활동(Synaptic Activity) 없이 수백 ~ 수천 ms 이후에 초기 상태로 돌아 오는 것을 말한다. 이러한 단기 가소성(STP)은 일반적으로 인지(Recognition), 연합 학습(Associative Learning) 및 소리 위치화(Sound Localization)와 같은 중요 뇌 기능과 연관된다. 단기 가소성(STP) 중 가장 잘 알려진 것 중 하나는, 하나의 임펄스(Impulse)가 이전 임펄스와 근접할 때 시냅틱 세기(Synaptic Strength)가 일시적으로 강화되는 현상인 쌍펄스 촉진(Paired-Pulse Facilitation, PPF)이다. 신경과학(Neuroscience)에서는 이러한 현상은 프리시냅틱(Presynaptic) Ca2+ 농도(Concentration)의 증가로 인 해 발생하고, 이는 더 많은 신경전달물질(Neurotransmitters)의 방출(Release)을 가져온다고 설명한다. 장기 가소성(Long-Term Plasticity, LTP)은 최근 활동 패턴(Activity Pattern)에 의한 시냅스들의 지속적인 강 화로 설명된다. 즉, 두 뉴런(Neuron) 사이에서의 신호 전달(Signal Transmission)의 장기적 증가(Long-Lasting Increase)를 만드는 시냅틱 활동 패턴(Synaptic Activity Patterns)이다. 많은 프리시냅틱 스파이크 (Presynaptic Spikes)가 오래 지속되는 흥분성 포스트-시냅틱 전류(Excitatory Post-Synaptic Current, EPSC) 를 트리거(Trigger)한다. 본 실시예들은 입력 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하여 단기 가소성에서 장기 가소성 으로 전환할 수 있는 신경모방 멤리스터를 제공한다. 이하에서는 도 2 및 도 3을 참조하여, 대면적으로 균일하게 나노 단위의 금속산화물층을 형성할 수 있는 신경모 방 멤리스터의 제조 방법을 설명하기로 한다. 신경모방 멤리스터의 제조 방법은 용액 공정을 이용하여 멤리스터를 제작한다. 제조 방법은 희생 기판에 제1 전 극을 증착하는 단계(S210), 제1 전극에 금속산화물을 포함하는 시냅스 모사층을 용액 공정을 이용하여 증착하는 단계(S220), 시냅스 모사층에 제2 전극을 증착하는 단계(S230)를 포함한다. 신경모방 멤리스터의 제조 방법은 희생 기판을 초음파 세척하고 자외선 처리하여 희생 기판을 친수화하는 단계 (S310)를 추가로 포함할 수 있다. 희생 기판을 친수화하는 단계(S210)는 아세톤, 메탄올, 이소프로필알콜(IPA) 용액 등으로 10분간 클리닝 한 뒤. UV Ozone 처리를 하여 표면의 -OH기 생성을 통한 친수성 표면을 생성한다. 기판에 붙어 있는 유기 오염물은 화학적으로 C-H, -C=C-, -C-O, -C-Cl 등의 여러 가지 화학 결합을 하고 있다. 이러한 화학 결합은 자신의 결합 에너지보다 강한 에너지 충격을 받으면 CO2, H2O 등으로 분해되거나 -OH, -CHO, -COOH와 같이 친수성기로 전환된다. 제1 전극을 증착하는 단계(S220)는 Al, Cu, Ni, Fe, Cr, Ti, Zn, Pb, Au, Ag 등의 금속 또는 FTO(Fluorine- doped Tin Oxide), ITO(Indium-Tin Oxide) 등의 투명 전극을 증착한다. 제1 전극을 증착하는 단계(S320)는 스 퍼터링(Sputtering), 펄스레이저 증착법(Pulsed Laser Deposition, PLD), 증발법(Thermal Evaporation), 분자 선 에피탁시 증착법(Molecular Beam Epitaxy, MBE), 화학 기상증착법(Chemical Vapor Deposition, CVD)와 같은 다양한 방법으로 증착이 가능하다. 제1 전극을 증착하는 단계(S320)는 인쇄 공정을 이용할 수 있다. 제1 전극에 금속산화물을 포함하는 시냅스 모사층을 용액 공정을 이용하여 증착하는 단계(S220)는 금속산화물을 생성하는 단계를 추가로 포함할 수 있다. 금속산화물을 생성하는 단계는 (i) 금속화합물이 포함된 용 액에 대하여 화학반응을 통해 금속을 분리한 후 금속을 산화시키거나 (ii) 파우더 형태의 금속과 산소를 포함하 는 용액을 화학반응시켜 금속산화물을 생성한다. 제1 전극에 시냅스 모사층을 증착하는 단계(S340)는 스핀 코팅(Spin-Coating), 딥 코팅(Dip-Coating), 드롭 캐 스팅(Drop-Casting), 전기 화학 증착(Electrodeposition), 스크린 프린팅(Screen Printing), 바 프린팅(Bar Printing), 롤투롤(Roll-To-Roll), 롤투플레이트(Roll-To-Plate), 잉크젯 프린팅(Ink-Jet Printing), 마이크로 접촉 프린팅 (Micro-Contact Printing) 등 다양한 방법으로 증착이 가능하다. 금속산화물이 SnO2인 경우를 설명하면, 1 mmol SnCl22H2O 를 10 mmol의 에탄올에 녹인다. 0.4 mmol의 NH4OH를 에 탄올에 첨가한다. 3 시간이상 교반하여 SnO2 용액을 제조한다. 스핀 코팅을 통해 막을 제작한다. 1000 내지 2000 RPM, 1 Ramp Rate, 30 내지 40 sec 시간에서 코팅할 수 있다. 100℃ 내지 120℃의 온도 범위에서 20분 동 안 건조시킨다. 코팅하고 건조하는 과정을 반복한다. 금속산화물이 WO3인 경우를 설명하면, 1g의 텅스텐 파우더를 30%(w/w)의 과산화수소 희석액에 녹인다. 하루동안 충분히 반응시킨 후 과산화수소를 제거하기 위하여 Pt 호일을 첨가하고 하루를 기다린다. 30%의 에탄올과 70%의 용액으로 이루어진 용액을 첨가하여 충분히 교반시켜 텅스텐 농도가 0.05M이 되는 용액을 제조한다. 전기 화학증착 방법을 이용하여 FTO 기판에 증착한다. 이때 Working Electrode는 Pt foil, 전해질은 Saturated Potassium Chloride(KCL), Counter Electrode는 FTO glass를 이용할 수 있다. 제2 전극을 증착하는 단계(S230)는 Al, Cu, Ni, Fe, Cr, Ti, Zn, Pb, Au, Ag 등의 금속을 증착한다. 시냅스 모 사층에 제2 전극을 증착하는 단계(S350)는 스퍼터링(Sputtering), 펄스레이저 증착법(Pulsed Laser Deposition, PLD), 증발법(Thermal Evaporation), 분자선 에피탁시 증착법(Molecular Beam Epitaxy, MBE), 화 학 기상증착법(Chemical Vapor Deposition, CVD)와 같은 다양한 방법으로 증착이 가능하다. 제2 전극을 증착하 는 단계(S350)는 인쇄 공정을 이용할 수 있다. 신경모방 멤리스터의 제조 방법은 멤리스터를 제작한 후에 희생 기판과 제2 전극을 분리하는 단계(S360)를 추가 로 포함할 수 있다. 희생 기판은 용액을 증착하기 위한 일회용 기판으로 제2 전극이 형성되면 제거된다. 희생 기판과 제2 전극을 분리하는 단계(S360)는 습식 전사법(Wet Transfer Method)을 통하여 제2 전극을 희생 기판에 서 분리할 수 있다. 희생 기판은 유리, 실리콘, 그 외 각종 강성 기판으로 구현될 수 있다. 이하에서는 도 4를 참조하여, 신경모방 멤리스터를 설명하기로 한다. 도 4의 (a)를 참조하면, 신경모방 멤리스터는 제1 전극, 시냅스 모사층, 및 제2 전극을 포함한 다. 제1 전극 및 제2 전극은 금속을 포함할 수 있다. 파장에 따른 투명도를 도시한 도 4의 (b)를 참 조하면, 제1 전극은 투명 전극으로 구현될 수 있다. Post Neuron은 하부전극, Pre Neuron은 상부 전극, 뉴 론 사이 이온의 이동에 따른 전위의 변화는 금속산화물로 형성된 시냅스 모사층에 각각 대응한다. 본 실시예에 따른 멤리스터는 단일 소자로 시냅스 동작을 수행하여 신경모방이 가능하다. 시냅스 모사층은 금속산화물을 포함하며, 금속산화물의 산소 공공의 전이 또는 집적에 의해 시냅스 가소성 특징을 갖는다. 시냅스 모사층은 (i) 출력 신호의 레벨을 일정 시간 동안 유지하지 않는 단기 가소성(STP) 모드 또는 (ii) 출력 신호의 레벨을 일정 시간 동안 유지하는 장기 가소성(STP) 모드로 동작한다. 시냅스 모사 층은 용액 공정에 의해 금속산화물을 형성할 수 있다. 도 4의 (c)는 SnO2로 구현한 금속산화물층을 갖는 멤리스터의 평면에 관한 SEM(Scanning Electron Microscopy) 이미지이고, 도 4의 (d)는 SnO2로 구현한 금속산화물층을 갖는 멤리스터의 단면에 관한 SEM 이미지이다. 표면 거칠기는 15nm 정도로 매우 고르게 증착되었고, 두께는 약 100 nm정도를 갖는 것을 쉽게 파악할 수 있다. 도 5의 (a)는 SnO2로 구현한 금속산화물층의 XRD(X-ray Diffraction) 패턴을 예시한 도면이고, 도 5의 (b) 내지 (d)는 SnO2로 구현한 금속산화물층의 XPS(X-ray Photoelectron Spectroscopy) 스펙트럼을 예시한 도면이다. XRD 및 XPS 분석 결과에 따라 SnO2가 성공적으로 형성된 것을 쉽게 파악할 수 있다. 도 6의 (a)는 WO3로 구현한 금속산화물층을 갖는 멤리스터의 단면에 관한 SEM(Scanning Electron Microscopy) 이미지이고, 도 6의 (b)는 WO3로 구현한 금속산화물층의 XRD(X-ray Diffraction) 패턴을 예시한 도면이고, 도 6 의 (c)는 HR-TEM(High Resolution-Transmission Electron Microscope) 이미지이고, 합성 박막과 Ag 전극의 표 면에 관한 SEM 이미지이다. 평균적 두께는 약 200 nm 정도 이며 WO3-H2O 나노 크리스탈 간 간격은 약 0.33nm 정 도이다. XRD 분석 결과에 따라 WO3-H2O가 성공적으로 형성된 것을 쉽게 파악할 수 있다. 진공 공정없이 용액 공정을 통하여 금속산화물층을 성공적으로 형성하였고, 고르며 밀집된 나노 단위의 박막을 형성하였다. 신체모방 멤브레인은 스냅스 가소성 특성을 갖는다. 프리시냅틱 멤브레인(Presynaptic Membrane)을 통해 프리시 냅틱 스파이크(Presynaptic Spikes)가 가해지는 것과 유사하게 전기 펄스(Electrical Pulse)가 상부 전극인 제 2 전극에 인가한다. 입력 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하기 위한 펄스 생성기 및 펄 스 처리기를 이용할 수 있다. 작은 전압 바이어스(voltage bias)가 하부 전극인 제1 전극에 읽기 전압(Reading Voltage)으로서 연속적으로 인가한다. 이는 소자 전도도(Device Conductance)에 미치는 효과를 최소화할 수 있 다. 본 실시예들은 입력 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하여 금속산화물로 형성된 시냅스 모사층의 전도 상태를 변환시킴으로써, 정밀한 시냅스 가소성 특성을 구현하고, 시냅스 가소성 특성을 단기 가 소성에서 장기 가소성으로 전환하기 위한 기준을 제시한다. 도 7은 SnO2로 구현한 금속산화물층의 갖는 멤리스터의 비선형 응답에 관한 그래프이다. 도 7의 (a)는 음의 전 압 스윕에 따른 전류 응답, 도 7의 (b)는 양의 전압 스윕에 따른 전류 응답, 도 7의 (c)는 바이어스 펄스가 적 용된 전류 응답, 도 7의 (d)는 연속하는 음의 전압과 연속하는 양의 전압이 교대로 변동할 때의 전류 응답을 나 타낸다. 도 8은 SnO2로 구현한 금속산화물층의 갖는 멤리스터의 상이한 펄스 입력에 따른 전류 변화를 나타낸 그래프이다. 전류 데이터는 읽기 전압 펄스(-0.5V)를 이용하여 기록되었다. 스냅틱 가소성의 특징 중 하나는 SRDP(Spike-Rate-Dependent Plasticity)이다. 신경모방 멤리스터의 시냅스 모 사층은 펄스 신호의 주기에 따라 시냅틱 가중치의 세기가 조절된다. 도 9의 (a)는 상이한 시간 간격을 갖는 펄 스 주기에 따른 출력 전류를 측정한 값을 도시하고 있다. 입력 펄스(-3 V, 20 ms)를 N=10으로 고정하고, 주기를 2 Hz부터 10 Hz까지 변경한다. 2 Hz에서는 전류 변화가 분명하지 않지만, 6 Hz에서는 상승 경향이 분명하게 나 타난다. 도 9의 (b)는 전도성과 펄스 비의 관계를 도시하고 있다. 스냅틱 가소성의 특징을 확인하기 위해 PPF(Paired-Pulse Facilitation) 및 PTP(Post-Tetanic Potentiation)를 확인한 결과가 도 9의 (c)에 도시되어 있다. 신경모방 멤리스터의 시냅스 모사층에서 PPF(I2-I1)를 살펴보면, 첫 번째 펄스 이후에 두번째 펄스를 즉각적으로(연속적으로) 적용하면, 전류 변화 정도가 상승한다. 펄스 주기가 증가하면 전류 변화 정도도 증가한다. 신경모방 멤리스터의 시냅스 모사층에서 PTP(I10-I1)를 살펴보면, 첫번째 펄스 이후에 다량의 펄스를 적용하면, 전류 변화 정도가 펄스 개수가 증가하면서 점진적으로 증가한다. 도 9의 (d)는 신경모방 멤리스터의 시냅스 모사층에서 EPSC를 예시한 그래프이다. 시냅스 모사층은 펄스 신호의 크기가 기 설정된 기준 크기보다 클 때, 출력 신호가 트리거된다. 예컨대, -2.0V에서는 시냅스 모사층이 자극을 받지 않아서 전류 변화가 거의 없음을 알 수 있다. -2.5V 내지 -3.0V에서 전류 레벨(Current Level)은 펄스 이후에 갑작스럽게 커지고, 시간이 지남에 따라 감소 (Decay)한다. 시냅틱 가중치(Synaptic Weight)의 척도인 흥분성 포스트-시냅틱 전류(Excitatory Post-Synaptic Current, EPSC)와 유사하다. 포스트시냅틱 전류(Postsynaptic Current)의 감소(Decay)는 바이어스(Bias)가 제 거된 이후의 이온(Ion)의 역 확산(Back-Diffusion) 때문에 발생한다. -3.5V에서 시냅스 모사층이 안정된 상태에서 출력 신호의 크기는 출력 신호의 초기 상태보다 상승한 값을 갖는 다. 스냅틱 가소성의 주된 특징은 단기 가소성과 장기 가소성이다. 이하에서는 단기 가소성에서 장기 가소성으로 전 환되는 메커니즘을 설명하기로 한다. 시냅스 모사층은 펄스 신호의 개수에 따라 시간과 시냅틱 가중치의 관계를 나타낸 기억 곡선의 휴식 시간이 포 화되어 단기 가소성 모드에서 장기 가소성 모드로 전환된다. 도 10의 (a) 내지 도 10의 (e)는 펄스 개수에 따른 시냅틱 가중치에 대한 기억 곡선을 도시하고 있다. 펄스 개수 N이 증가하면 시냅스 가중치는 포화되기 전까지 증가한다. 시냅틱 가중치에 대한 기억 곡선은 기억 곡선은 지수 함수로 표현되며 수학식 1과 같이 표현된다. 수학식 1"}
{"patent_id": "10-2018-0039878", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서 It는 시간 t에서 전류 값이고, I0는 안정된 상태에서 전류 값이고, A는 계수이고, τ는 휴식 시간 (Relaxation Time)을 나타낸다. 휴식 시간은 기억 곡선에서 입력에 대한 반응 특성화 매개변수이다. 기억 곡선 의 독립 변수이다. 도 10의 (f)의 펄스 주기에 따른 기억 곡선의 휴식 시간을 예시한 그래프이다. 펄스 신호의 개수에 증가하면 N=50까지 휴식 시간이 증가하다가 N=50이후에 휴식 시간이 감소한다. 펄스 신호의 개수에 증가하면 시냅스 가중 치와 기억 곡선의 휴식 시간은 포화될 때까지 증가하며, 포화되는 펄스 개수에서 멤리스터는 단기 가소성 모드 에서 장기 가소성 모드로 전환된다. 본 실시예에 따른 멤리스터는 입력 펄스 신호의 개수를 기준 펄스 개수의 범위 내로 설정하여 금속산화물로 형 성된 시냅스 모사층의 전도 상태를 변환시킴으로써, 정밀한 시냅스 가소성 특성을 구현하고, 시냅스 가소성 특 성을 단기 가소성에서 장기 가소성으로 전환할 수 있다. 도 11은 Au/SnO2/FTO 멤리스터에서 쇼트키 장벽의 변화를 묘사하는 비선형 전류 전압 곡선을 나타낸다. 도 11에 서 화살표는 스윕 방향을 의미한다. 도 12는 제2 전극와 시냅스 모사층의 밴드갭을 예시한 도면이다. 금속과 반 도체 특성을 지닌 금속산화물이 만나게 되면 페르미 레벨 차에 의해 전위 장벽(Potential Barrier)이 형성된다. 전위장벽은 초기 쇼트키 접촉(Schottky Contact)을 형성하여 높은 저항 값(초기 상태)를 유도한다. 도 12의 (a)는 SnO2와 Au를 접촉하기 전 에너지 밴드이고, 도 12의 (b)는 SnO2와 Au를 접촉한 후 에너지 밴드이 다. 도 12의 (c)에서 SnO2의 경우 n-type 반도체이며 Au 전극에 양의 전기적 펄스를 가하면, SnO2에서 Au로의 전자 전달 장벽(Φbs)이 감소한다. 전자는 SnO2에서 Au로 쉽게 이동하여 증가된 전류를 관찰할 수 있다. 도 12의 (d)에서 음의 전압을 가하면 Φbs가 크게 증가하고 전자는 Au에서 SnO2(Φbm)로 전자를 전달하는 장벽 을 극복해야 하므로 낮고 거의 일정한 전류가 얻어진다. 이러한 형태의 전도성 변화는 축적된 산소 공공이 쉽게 해산될 수 있기 때문에 STP를 관찰할 수 있다. 도 12의 (e)에서 양의 전압을 반복하여 가하고, 도 12의 (f)에서 음의 전압을 반복하여 가한 에너지 밴드이다. 도 9의 (f)에서 산소 공공이 축적되면, 감소된 Φbm가 획득되고, 결국 전류를 점진적으로 증가시킨다. 펄스 주파수가 증가하면, 산소 공공의 역확산이 억제되고 스파이크와 EPSC간의 상호작용이 촉진되며, SRDP를 관 찰할 수 있다. 펄스 개수가 증가하면, Au/SnO2경계에서 산소 공공이 집적되고, 후속된 산소 공공의 역확산 감소 는 점진적으로 전류를 감소시키고, 멤리스터를 STP에서 LTP로 전환한다. 신체모방 멤브레인은 스냅스 가소성 특성을 갖는다. 프리시냅틱 멤브레인(Presynaptic Membrane)을 통해 프리시 냅틱 스파이크(Presynaptic Spikes)가 가해지는 것과 유사하게 전기 펄스(Electrical Pulse)가 상부 전극인 제 2 전극에 인가한다. 도 13의 (a)는 0V부터 0.6V까지의 5번의 양의 전압 스윕(Sweep)에 따른 I-V 그래프이고, 도 13의 (b)는 0.6V부 터 0V까지의 5번의 음의 전압 스윕에 따른 I-V 그래프이다. 멤리스터에 순차적으로 5 회 연속적인 양의 스윕 (0 ~ +0.6V, 1 ~ 5 번)과 음의 전압 스윕 (0 ~ -0.6V, 6 ~ 10 번)을 적용하며, 양의 전압 펄스 수가 증가할수록 전류 값은 점차 증가한다. 연속 전압 펄스를 음의 바이어스로 바꿔서 가해지면 전류가 점차적으로 감소한다. 도 13의 (c)는 20개의 양의 펄스 (0.6 V, 1 ms)의 직후에 20 개의 음의 펄스(-0.6 V, 1 ms)를 인가할 때의 전 류 응답을 도시하고 있다. 20 개의 양의 펄스 (0.6V, 1ms)와 20 개의 음의 펄스 (-0.6V, 1ms)가 반복적으로 5 회 반복 실행한 다음 발생한 전류 값을 기록한 결과, 이러한 일정 전압의 인가로 인해 제어되는 연속적인 전도 성 변화는 연속 스파이크 전송에 의해 변화하는 시냅스의 억제(Depression) 및 여기(Potentialtion) 동작과 매 우 일치하는 것을 파악할 수 있다. 도 13의 (d)는 1ms의 펄스 폭을 인가할 때의 전류 응답, 도 10의 e)는 5ms의 펄스 폭을 인가할 때의 전류 응답, 도 13의 (f)는 10ms의 펄스 폭을 인가할 때의 전류 응답을 도시하고 있다. 도 13의 (d)에 도시된 바와 같이, 펄스 폭을 1 ms 설정하여 인가하면, 전압을 가하자마자 전류가 수직으로 상승 한 후 초기 값으로 바로 하강하는 것을 확인할 수 있다. 도 13의 (e)에 도시된 바와 같이, 펄스 폭을 5 ms로 설정하여 인가하면, 전류가 증가한 다음 바로 감소하였으나 초기 값이 아닌 약간 상승한 상태를 유지하고 있음을 확인할 수 있다. 이후 서서히 감소하여 초기 상태로 복귀 한다. 도 13의 (f)에 도시된 바와 같이, 펄스 폭을 10 ms로 설정하여 인가하면, 초기 상태로 복귀하는데 걸리는 시간 은 더욱 길어진다. 본 실시예에 따른 멤리스터는 입력 펄스 신호의 폭을 기준 펄스 폭보다 크게 설정하여 금속산화물로 형성된 시 냅스 모사층의 전도 상태를 변환시킴으로써, 정밀한 시냅스 가소성 특성을 구현하고, 시냅스 가소성 특성을 단 기 가소성에서 장기 가소성으로 전환할 수 있다.이하에서는 신체모방 멤리스터가 금속산화물의 산소 공공에 의하여 전도성 필라멘트를 형성하는 동작을 설명하 기로 한다. 시냅스 모사층은 펄스 신호의 폭을 조절하여 형성된 전도성 필라멘트의 위치, 크기, 개수, 또는 이 들의 조합의 변화에 따라 단기 가소성 모드에서 장기 가소성 모드로 전환한다. 도 14의 (a)은 전기적 자극을 인가하기 전 멤리스터의 TEM(Transmission Electron Microscope) 이미지이다. FTO층 위에 고르게 금속산화물(SnO2)층이 증착되어 있으며 금속산화물층 위에 Ag층이 증착되어 있는 형태이다. 도 14의 (b)는 전기적 자극을 인가하기 전 멤리스터의 EDX(Energy Dispersive X-Ray Spectroscope) 분석을 통 한 Ag 원자의 분포를 나타낸 도면이다. 금속 Ag 원자가 금속산화물 표면에 집적되어 있는 것을 알 수 있다. 도 14의 (c)는 전기적 자극을 인가한 후 멤리스터의 TEM 이미지이고, 도 14의 (d)는 전기적 자극을 인가한 후 멤리스터의 EDX 분석을 통한 Ag 원자의 분포를 나타낸 도면이다. 바이어스에 따라 Ag 원자가 SnO2의 산소 공공 에 의해 내부로 확산된 것을 확인할 수 있다. 도 15는 EDX 라인 스캔 결과를 예시한 도면이다. 바이어스를 인가한 위치를 Position 2, 인가하기 전 위치를 Position 1이라고 할 때, Ag의 두께 및 분포가 증가한 것을 확인할 수 있다. 이하에서는 멀티 레벨 메모리 모드로 동작하는 멤리스터를 설명하기로 한다. 시냅스 모사층은 제2 전극을 통해 양의 펄스 신호 또는 음의 펄스 신호를 입력받아 다양한 단계에서 정보를 기억하는 멀티 레벨 메모리 모드로 동 작할 수 있다. LTP 특성을 이용하여 MLC(Multi-Level Cell) 메모리를 제작할 수 있다. 도 16의 (a) 및 (b)를 보면 양의 전기 적 펄스(0.8V, 50ms)를 인가할 때 전류가 급격히 상승 및 하락을 보이지만 하락 후 초기 전도성과 비교하여 전 도성이 약간 상승한 것을 알 수 있다. 또한 연속하여 전기적 펄스를 가했을 때 전도성은 계속 상승하고 그 수치 를 유지하여 LTP 특성을 보임과 동시에 MLC 특성을 갖는다. 음의 전기적 펄스를 인가할 때, 순차적으로 전도성이 감소되는 것을 확인할 수 있다. 단일 소자에서 단순히 로 직 하이, 로우를 저장하는 메모리 소자가 아닌 여러 정보를 다량 저장할 수 있는 MLC 메모리로 동작이 가 능하다. 도 17의 (a) 내지 (d)는 각 LTP 상태에 대응하는 C-AFM(Conductive Atomic Force Microscopy) 분석 이미지이다. 도 17의 (a)는 초기 상태이고, 도 17의 (b)는 1차 양의 전기적 펄스가 가해진 LTP 상태이고, 도 17 의 (c)는 2차 전기적 펄스가 가해진 LTP 상태이다. 각 LTP 상태에서 전도성 부분이 점차 커져감을 알 수 있다. 도 17의 (a)는 두 번의 음의 전기적 펄스를 인가하여 초기 상태로 복귀한 상태이다. 즉, 기존의 전도성 모델로 복원할 수 있음을 파악할 수 있다. 도 18은 멤리스터가 갖는 멀티 레벨 특성을 나타내는 그래프이다. 각 5단계의 차등 LTP 상태를 설정하여 100회 의 사이클을 반복 측정하였음에도 각 저항상태 값에서 상승 혹은 하강없이 그 값을 반복적으로 나타내면서 우수 한 MLC 메모리 특성을 갖고 동작하는 것을 쉽게 파악할 수 있다. 도 19는 Ag/WO3H2O/FTO 멤리스터를 시뮬레이션한 결과를 도시하고 있다. 도 19의 (a) 및 (b)는 DFT 기법을 이용 한 WO3H2O의 최적화된 지오메트리이고, 도 19의 (c)는 CEAI 모델이고, 도 19의 (d)는 연속된 전압 주기에서 CEAI 모델에 따른 전류 전압 곡선이고, 도 19의 (e)는 연속된 전압 주기에서 CEAI 모델에 따른 Ag/WO3H2O경계와 WO3H2O에서 은이온의 분포를 나타낸다. 도 20을 참조하면, 뉴로모픽 시스템은 상호 연결되어 네트워크를 구축하는 복수의 시냅스 모사 소자를 포함한다. 뉴로모픽 시스템은 복수의 시냅스 모사 소자 간의 신호 흐름에 의해 다양한 물리적 반응을 수행할 수 있다. 예컨대, 물리적 반응은 광학(Light) 반응, 자기적(Magnetic) 반응, 전기적 반응 등을 포함하는 개념이다. 시냅스 모사 소자는 제1 전극, 시냅스 모사층, 및 제2 전극을 포함한다. 시냅스 모사층 은 제1 전극에 연결된 금속산화물을 포함하며 금속산화물의 산소 공공의 전이 또는 집적에 의해 시냅스 가소성 특징을 갖는다. 제2 전 극은 시냅스 모사층에 연결되며 펄스 신호를 입력받는다. 뉴로모픽 시스템은 펄스를 생성하고 펄스 신호의 크기, 개수, 주기, 폭, 및 바이어스를 조절하는 펄스 처리기를 포함할 수 있다. 펄스 처리기는 펄스 크기 제어기, 펄스 개수 제어기, 펄스 주기 제어기, 펄스 폭 제어기, 바이 어스 제어기 등을 포함할 수 있다. 시냅스 모사 소자에 관하여 본 실시예에 따른 신경모방 멤리스터와 중복되는 설명은 생략하기로 한다. 뉴로모픽 시스템에 포함된 구성요소들은 상호 결합되어 적어도 하나의 모듈로 구현될 수 있다. 구성요소들은 장 치 내부의 소프트웨어적인 모듈 또는 하드웨어적인 모듈을 연결하는 통신 경로에 연결되어 상호 간에 유기적으 로 동작한다. 이러한 구성요소들은 하나 이상의 통신 버스 또는 신호선을 이용하여 통신한다. 도 2 및 도 3에서는 각각의 과정을 순차적으로 실행하는 것으로 기재하고 있으나 이는 예시적으로 설명한 것에 불과하고, 이 분야의 기술자라면 본 발명의 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 도 2 및 도 3 에 기재된 순서를 변경하여 실행하거나 또는 하나 이상의 과정을 병렬적으로 실행하거나 다른 과정을 추가하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이다. 본 실시예들은 본 실시예의 기술 사상을 설명하기 위한 것이고, 이러한 실시예에 의하여 본 실시예의 기술 사상 의 범위가 한정되는 것은 아니다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2018-0039878", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 뉴런을 예시한 도면이다. 도 2 및 도 3은 본 발명의 실시예들에 따른 멤리스터의 제조 방법을 예시한 흐름도이다. 도 4는 본 발명의 다른 실시예에 따른 멤리스터를 예시한 도면이다. 도 5는 SnO2로 구현한 금속산화물층의 XRD와 XPS를 예시한 도면이다. 도 6은 WO3로 구현한 금속산화물층을 갖는 멤리스터를 예시한 도면이다. 도 7은 SnO2로 구현한 금속산화물층의 갖는 멤리스터의 비선형 응답에 관한 그래프이다. 도 8은 SnO2로 구현한 금속산화물층의 갖는 멤리스터의 상이한 펄스 입력에 따른 전류 변화를 나타낸 그래프이다. 도 9의 (a)는 상이한 시간 간격을 갖는 펄스 주기에 따른 출력 전류를 측정한 값이다. 도 9의 (b)는 전도성과 펄스 비의 관계를 예시한 그래프이다. 도 9의 (c)는 PPF 및 PTP를 예시한 그래프이다. 도 9의 (d)는 EPSC를 예 시한 그래프이다. 도 10의 (a) 내지 도 10의 (e)는 펄스 개수에 따른 시냅틱 가중치에 대한 기억 곡선을 예시한 도면이다. 도 10 의 (f)의 펄스 주기에 따른 기억 곡선의 휴식 시간을 예시한 그래프이다. 도 11은 Au/SnO2/FTO 멤리스터에서 쇼트키 장벽의 변화를 묘사하는 비선형 전류 전압 곡선을 나타낸다. 도 12는 제2 전극와 시냅스 모사층의 밴드갭을 예시한 도면이다. 도 13은 입력 펄스에 따른 출력 레벨을 예시한 그래프이다. 도 14는 TEM 이미지와 EDX 분석을 통한 금속 원자의 분포를 예시한 도면이다. 도 15는 EDX 라인 스캔 결과를 예시한 도면이다. 도 16은 입력 펄스에 따른 출력 레벨을 예시한 그래프이다. 도 17는 C-AFM 이미지를 예시한 도면이다. 도 18는 본 발명의 실시예들에 따른 멤리스터가 갖는 멀티 레벨 특성을 나타내는 그래프이다. 도 19는 Ag/WO3H2O/FTO 멤리스터를 시뮬레이션한 결과이다. 도 20은 본 발명의 또 다른 실시예에 따른 뉴로모픽 시스템을 예시한 블록도이다."}
