{"patent_id": "10-2014-0178719", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0071236", "출원번호": "10-2014-0178719", "발명의 명칭": "소형통합제어장치", "출원인": "한화테크윈 주식회사", "발명자": "김동신"}}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 메인프로세서;상기 메인프로세서와 동일한 클럭을 이용하며 상기 대용량 센서데이터 중 레이저 기반 센서데이터를 처리하는보조프로세서;및상기 메인프로세서와 동일한 클럭을 이용하며, 상기 대용량 센서데이터 중 영상 기반 센서데이터를 멀티코어를이용하여 병렬로 처리하는 그래픽처리부;를 포함하며,상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부는 병렬로 상기 대용량 센서데이터를 처리하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 그래픽처리부는 상기 대용량 센서 데이터 중 3차원 거리 데이터를 수신하고, 상기 3차원 거리 데이터를 복셀(voxel) 데이터로변환하며, 각각의 복셀마다 포함되어 있는 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산을 계산하는 연산부;상기 평균 및 공분산 값을 기초로 계산된 아이젠 값 및 아이젠 벡터값을 기초로 각 복셀의 표면 방향각 및 높이를 계산하여 각 복셀을 통과할 수 있는지에 대한 확률값인 통과계수(traversability)를 계산하는 통과계수연산부;각 복셀을 스캔한 횟수값(Occupancy)을 수치화하는 빈도검출부;를 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 그래픽처리부는 각 복셀에 대한 통과계수 및 각 복셀을 스캔한 횟수값을 상기 메인프로세서에 전송하고, 상기 메인 프로세서는 각 복셀에 대한 통과계수 및 각 복셀을 스캔한 횟수값을 누적적으로 이용하여 지도를 생성하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 이동 물체는 이동 물체에 장착된 영상촬영센서에서 촬영한 주행 경로 영상 및 상기 메인프로세서에서 생성한 지도를 이용하여 주행한 경로를 복귀하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 대용량 센서데이터는이동 물체에 장착된 적어도 하나 이상의 센서에서 수신한 데이터인 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 상기 그래픽처리부는 상기 레이저 기반 센서데이터 중 영상처리와 관련된 센서데이터를 더 처리하는 것을 특징으로 하는 소형통합제어장치.공개특허 10-2016-0071236-2-청구항 7 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 메인프로세서;상기 메인프로세서와 동일한 클럭을 이용하며 상기 대용량 센서데이터 중 레이저 기반 센서데이터를 처리하는보조프로세서;및상기 메인프로세서와 동일한 클럭을 이용하며, 멀티코어를 이용하여 상기 대용량 센서데이터의 연산처리를 병렬로 처리하는 그래픽처리부;를 포함하며, 상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부는 병렬로상기 대용량 센서데이터를 처리하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 그래픽처리부는 상기 대용량 센서데이터 중 거리 데이터를 복셀 단위로 분할하고, 각각의 복셀에 포함되된 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산 값을 기초로 각 복셀의 표면 방향각 및 높이를 계산하여 각 복셀을통과할 수 있는지에 대한 확률값인 통과계수를 산출하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서, 상기 메인프로세서는 각 복셀을 스캔한 횟수값(Occupancy) 및 상기 각 복셀에 대해 산출된 상기 통과계수를 누적적으로 이용하여 지도를 생성하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부를 직렬 또는 병렬로 확장하도록 구현하는 입출력인터페이스;를 더 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 메인프로세서;상기 메인프로세서와 동일한 클럭을 이용하며, 상기 대용량 센서데이터를 상기 메인프로세서와 병렬로 처리하는보조프로세서;및상기 메인프로세서와 동일한 클럭을 이용하며, 연산 처리를 수행하는 그래픽처리부;를 포함하고, 상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부는 병렬로 상기 대용량 센서데이터를 처리하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 보조프로세서는 상기 대용량 센서데이터 중 레이저 기반 센서데이터를 처리하고, 상기 레이저 기반 센서데이터는 레이저 스캐너를 통해 획득한 센서데이터를 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서, 상기 그래픽처리부는 상기 대용량 센서데이터 중 영상 기반 센서데이터를 실시간으로 처리하고, 상기 영상 기반센서데이터는 카메라 영상을 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 12 항에 있어서, 상기 메인프로세서는 상기 그래픽처리부에서 상기 레이저 기반 센서데이터 중 영상처리와 관련된 센서데이터 연산을 처리하도록 제어공개특허 10-2016-0071236-3-하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11 항에 있어서,상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부를 직렬 또는 병렬로 확장하도록 구현하는 입출력인터페이스;를 더 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11 항에 있어서,상기 메인프로세서는 이동 로봇 구동시 생성되는 대용량 센서데이터를 수신하고, 상기 대용량 센서데이터는 상기 이동 로봇이 이용하는 센서에서 검출한 센서데이터, 상기 이동 로봇이 이동한 실시간 거리 정보, 상기 이동로봇이 촬영한 영상정보 중 적어도 하나 이상을 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 11 항에 있어서, 상기 그래픽처리부는 상기 대용량 센서 데이터 중 이동 로봇 주행시 검출된 3차원 거리 데이터 및 주행 경로 정보를 수신하고, 상기3차원 거리 데이터를 복셀(voxel) 데이터로 변환하며, 각각의 복셀마다 포함되어 있는 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산을 계산하여 아이젠 값 및 아이젠 벡터값을 추출하는 연산부;를 포함하고, 상기 그래픽처리부는 상기 아이젠 값 및 아이젠벡터값을 기초로, 각 복셀을 통과할 수 있는 가능성을 표시하는통과계수를 계산하며, 각 복셀을 스캔한 횟수값(Occupancy)를 파악하여, 각 복셀에 대한 통과계수 및 스캔한 횟수값을 상기 메인프로세서로 전송하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서, 상기 메인프로세서는 각 복셀에 대한 통과계수 및 스캔한 횟수값을 누적적으로 이용하여 상기 이동 로봇의 주행경로를 표시하는 지도를 생성하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 11항에 있어서, 상기 메인프로세서는 상기 대용량 센서데이터를 이더넷을 통해 수신하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 11항에 있어서, 상기 메인프로세서는 패킷 기반의 점대점(point-to-point) 상호 연결 버스를 이용하여 상기 적어도 하나 이상의멀티코어 CPU를 상호 연결하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 11 항에 있어서, 상기 보조프로세서 및 상기 그래픽처리부는 상기 메인프로세서와 동일한 클럭을 이용하여 처리한 센서데이터의동기화를 수행하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 11 항에 있어서, 상기 메인프로세서는 상기 대용량 센서데이터를 이더넷 스위치를 통해 수신하는 것을 특징으로 하는 소형통합제어장치. 공개특허 10-2016-0071236-4-청구항 23 제 11 항에 있어서, 상기 메인프로세서, 상기 보조프로세서, 상기 그래픽처리부에 전원을 공급하는 전원부;를 더 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 11 항에 있어서, 상기 메인프로세서, 상기 보조프로세서, 상기 그래픽처리부를 제어하는 MCU(Micro Control Unit)를 더 포함하는것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 11 항에 있어서, 상기 메인프로세서는시스템 계층(System Layer), 인터페이스 계층(Interface Layer), 코어 계층(Core Layer) 및 애플리케이션 계층(Application Layer)을 지원하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 11 항에 있어서, 상기 메인프로세서는시스템 계층(System Layer), 인터페이스 계층(Interface Layer), 코어 계층(Core Layer) 및 애플리케이션 계층(Application Layer)을 포함하는 계층화된 스택을 포함하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 17 항에 있어서, 상기 복셀의 높이는 3차원 거리 감지 센서가 검출할 수 있는 최대의 높이로 설정되는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 17 항에 있어서, 상기 복셀은 직사각형의 형태인 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 메인프로세서;상기 메인프로세서와 동일한 클럭을 이용하며 상기 대용량 센서데이터 중 레이저 기반 센서데이터를 처리하는보조프로세서;및상기 메인프로세서와 동일한 클럭을 이용하며, 상기 대용량 센서데이터 중 영상 기반 센서데이터를 멀티코어를이용하여 병렬로 처리하는 그래픽처리부;를 포함하며,상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부는 병렬로 상기 대용량 센서데이터를 처리하고, 상기 그래픽처리부는 상기 대용량 센서데이터 중 3차원 거리데이터를 직사각형의 복셀단위로 분할하여, 각 복셀내의 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산 값을 기초로 각 복셀을 통과할 수 있는 확률값을 계산하고, 각 복셀을 스캔한 횟수값을 이용하여 상기 각 복셀을 통과할 수 있는 확률값의 정확도에 가중치를 계산하는 것을 특징으로 하는 소형통합제어장치."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "소형통합제어장치에서 대용량 센서데이터를 처리하는 방법으로서, 메인프로세서에서 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 단계;공개특허 10-2016-0071236-5-보조프로세서에서 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대용량 센서데이터 중 환경인식과 관련된센서데이터를 처리하는 단계;및그래픽처리부에서 멀티코어를 이용하여 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대용량 센서데이터중 연산처리를 수행하는 단계;를 포함하고상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부는 병렬로 상기 대용량 센서데이터를 처리하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 30 항에 있어서, 상기 그래픽처리부는 연산부에서 상기 대용량 센서 데이터 중 3차원 거리 데이터를 수신하고 상기 3차원 거리 데이터를 복셀(voxel)데이터로 변환하며, 각각의 복셀마다 포함되어 있는 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산을 계산하는 단계;통과계수연산부에서 상기 평균 및 공분산 값을 기초로 계산된 아이젠 값 및 아이젠 벡터값을 기초로 각 복셀의표면 방향각 및 높이를 계산하여 각 복셀을 통과할 수 있는지에 대한 확률값인 통과계수(traversability)를 계산하는 단계; 빈도검출부에서 각 복셀을 스캔한 횟수값(Occupancy)을 수치화하고, 수치화한 각 복셀을 스캔한 횟수값을 이용하여 상기 통과계수의 정확도에 대한 가중치를 부여하는 단계;를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 31 항에 있어서, 상기 그래픽처리부는 각 복셀에 대한 통과계수 및 각 복셀을 스캔한 횟수값을 상기 메인프로세서에 전송하고, 상기 메인 프로세서는 각 복셀에 대한 통과계수 및 각 복셀을 스캔한 횟수값을 누적적으로 이용하여 지도를 생성하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제 31 항에 있어서, 상기 복셀은 직사각형 형태이고, 상기 직사각형의 높이는 3차원 거리 감지 센서가 검출할 수 있는 최대의 높이로 설정되는것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제 30 항에 있어서,상기 메인프로세서는 이동 로봇 구동시 생성되는 대용량 센서데이터를 수신하고, 상기 대용량 센서데이터는 상기 이동 로봇이 이용하는 센서에서 검출한 센서데이터, 상기 이동 로봇이 이동한 실시간 거리 정보, 상기 이동로봇이 촬영한 영상정보 중 적어도 하나 이상을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "소형통합제어장치에서 대용량 센서데이터를 처리하는 방법으로서, 상기 방법은메인프로세서에서 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 단계상기 메인프로세서와 동일한 클럭을 이용하는 보조프로세서에서 상기 대용량 센서데이터 중 레이저 기반 센서데이터를 처리하는 단계;및상기 메인프로세서와 동일한 클럭을 이용하는 그래픽처리부에서, 상기 대용량 센서데이터 중 영상 기반 센서데이터를 멀티코어를 이용하여 병렬로 처리하는 단계;를 포함하고, 상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부는 상기 대용량 센서 데이터를 병렬로 처리하며, 상기 그래픽처리부는 상기 대용량 센서데이터 중 3차원 거리데이터를 직사각형의 복셀단위로 분할하여, 각 복셀내의 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산 값을 기초로 각 복셀을 통과할 수 있는 확공개특허 10-2016-0071236-6-률값을 계산하고, 각 복셀을 스캔한 횟수값을 이용하여 상기 각 복셀을 통과할 수 있는 확률값의 정확도에 가중치를 계산하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제 35 항에 있어서, 상기 메인프로세서는시스템 계층(System Layer), 인터페이스 계층(Interface Layer), 코어 계층(Core Layer) 및 애플리케이션 계층(Application Layer)을 지원하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제 35 항에 있어서, 입출력 인터페이스를 이용하여상기 메인프로세서, 상기 보조프로세서 및 상기 그래픽처리부를 직렬 또는 병렬로 확장하도록 구현하는 단계;를더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제 35항에 있어서, 상기 메인프로세서는 패킷 기반의 점대점(point-to-point) 상호 연결 버스를 이용하여 상기 적어도 하나 이상의멀티코어 CPU를 상호 연결하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제 35항에 있어서, 상기 메인프로세서는 이더넷 스위치를 이용하여 상기 대용량 센서데이터를 수신하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제 35 항에 있어서, 상기 대용량 센서데이터는이동 물체에 장착된 적어도 하나 이상의 센서에서 수신한 데이터인 것을 특징으로 하는 방법."}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 바람직한 일 실시예에서 소형통합제어장치는 멀티코어CPU를 이용하여 대용량 센서데이터를 처리하는 메인 프로세서와, 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대용량 센서데이터를 병렬로 처리하는 보조 프로세서 및 상기 메인프로세서와 동일한 클럭을 이용하며, 상기 대용량 센서데이터 처리시 발생하는 연산을 병 렬로 처리하는 그래픽처리부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 대용량의 센서 데이터를 입력받아 병렬처리하여 신속한 결과를 획득하는 소형 통합 제어기에 관한 것 이다."}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "배경기술", "item": 1, "content": "도 1 은 종래 제어기의 일 예를 도시한다. 기존 제어기 시스템에서는 도 1 에 도시된 바와 같이 대용량 센서 데 이터를 처리하기 위하여 많은 수의 CPU core가 요구되었고, 이를 확보하기 위하여 다수의 PC(110, 111, 112, 113, 114 및 115)를 기가비트 스위치를 통해 연결하여 이용하였다. 또한 다수의 PC 이외에도 시스템을 제어하기 위한 외부 센서와 부가적인 파트들이 각각 개별적 제품으로 연결되 어 제어기 시스템은 상당한 크기와 부피를 지녔다. 선행기술문헌 비특허문헌 (비특허문헌 0001) \"Towards Fully Autonomous Driving: Systems and Algorithms\", 2011 IEEE Intelligent Vehicles Symposium (IV) Baden-Baden, Germany, June 5-9, 2011"}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "해결하려는과제", "item": 1, "content": "도 1에 도시된 대용량 센서데이터가 PC1으로 입력되는 경우, PC1은 PC2, PC3, PC4, PC5 및 PC6(111, 112, 113, 114 및 115) 등과 같은 다른 PC 들에게 수신된 대용량의 센서 데이터를 전송하여 공유하였 다. 그러나, 데이터를 전송하고 공유함에 있어 기가비트 이더넷 스위치의 경우 이론적으로는 1Gb/s 이지만 실 제로는 50MB/s 의 전송속도를 가지게 되므로 PC 간에 대용량의 데이터를 효율적으로 공유하지 못하는 문제점이 있었다. 이러한 문제점을 해결하기 위하여 PC 1 은 수신된 대용량의 센서 데이터 중 중요한 몇 Frame 만 선정하여 공유하게 되므로 PC 1 이외의 다른 PC 들(111, 112, 113, 114 및 115)은 분해능이 저하된 센서 데이터를 기반으로 연산을 수행하게 되어 정밀한 연산결과 값을 얻을 수 없는 문제점이 있다."}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 바람직한 일 실시예에서 소형통합제어장치는 멀티코어CPU를 이용하여 대용량 센서데이터를 처리하는 메인 프로세서와, 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대용량 센서데이터를 병렬로 처리하는 보 조프로세서 및 상기 메인프로세서와 동일한 클럭을 이용하며, 상기 대용량 센서데이터 처리시 발생하는 연산을 병렬로 처리하는 그래픽처리부를 포함하는 것을 특징으로 한다. 바람직하게, 그래픽처리부는 상기 대용량 센서 데이터 중 3차원 거리 데이터를 수신하고, 상기 3차원 거리 데이 터를 복셀(voxel) 데이터로 변환하며, 각각의 복셀마다 포함되어 있는 3차원 포인트 클라우드(point cloud) 데 이터의 평균 및 공분산을 계산하는 연산부; 상기 평균 및 공분산 값을 기초로 계산된 아이젠 값 및 아이젠 벡터 값을 기초로 각 복셀의 표면 방향각 및 높이를 계산하여 각 복셀을 통과할 수 있는지에 대한 확률값인 통과계수 (traversability)를 계산하는 통과계수연산부; 및 각 복셀을 스캔한 횟수값(Occupancy)을 수치화하는 빈도검출 부;를 포함하는 것을 특징으로 한다. 바람직하게, 상기 그래픽처리부는 각 복셀에 대한 통과계수 및 각 복셀을 스캔한 횟수값을 상기 메인프로세서에 전송하고, 상기 메인 프로세서는 각 복셀에 대한 통과계수 및 각 복셀을 스캔한 횟수값을 누적적으로 이용하여 지도를 생성하는 것을 특징으로 한다. 바람직하게, 이동 물체는 이동 물체에 장착된 영상촬영센서에서 촬영한 주행 경로 영상 및 상기 메인프로세서에 서 생성한 지도를 이용하여 주행한 경로를 복귀하는 것을 특징으로 한다. 본 발명의 바람직한 일 실시예로서, 메인프로세서는 시스템 계층(System Layer), 인터페이스 계층(Interface Layer), 코어 계층(Core Layer) 및 애플리케이션 계층(Application Layer)을 포함하는 계층화된 스택을 포함하 는 것을 특징으로 한다. 본 발명의 또 다른 바람직한 일 실시예로서, 소형통합제어장치에서 대용량 센서데이터를 처리하는 방법은 메인 프로세서에서 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 단계; 보조프로세서 에서 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대용량 센서데이터 중 환경인식과 관련된 센서데이터를 처리하는 단계;및 그래픽처리부에서 멀티코어를 이용하여 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대 용량 센서데이터 중 연산처리를 수행하는 단계;를 포함하고, 상기 메인프로세서, 상기 보조프로세서 및 상기 그 래픽처리부는 병렬로 상기 대용량 센서데이터를 처리하는 것을 특징으로 한다. 본 발명의 또 다른 바람직한 일 실시예로서, 소형통합제어장치에서 대용량 센서데이터를 처리하는 방법은 메인 프로세서에서 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 단계; 상기 메인프로 세서와 동일한 클럭을 이용하는 보조프로세서에서 상기 대용량 센서데이터 중 레이저 기반 센서데이터를 처리하 는 단계;및 상기 메인프로세서와 동일한 클럭을 이용하는 그래픽처리부에서, 상기 대용량 센서데이터 중 영상 기반 센서데이터를 멀티코어를 이용하여 병렬로 처리하는 단계;를 포함하고, 상기 메인프로세서, 상기 보조프로 세서 및 상기 그래픽처리부는 상기 대용량 센서 데이터를 병렬로 처리하며, 상기 그래픽처리부는 상기 대용량 센서데이터 중 3차원 거리데이터를 직사각형의 복셀단위로 분할하여, 각 복셀 내의 3차원 포인트 클라우드 (point cloud) 데이터의 평균 및 공분산 값을 기초로 각 복셀을 통과할 수 있는 확률값을 계산하고, 각 복셀을 스캔한 횟수값을 이용하여 상기 각 복셀을 통과할 수 있는 확률값의 정확도에 가중치를 계산하는 것을 특징으로 한다."}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 바람직한 일 실시예로서, 소형 통합 제어장치는 인공지능, 군사장비, 공장 자동화, 이동형 서버장비, 자율주행 로봇 분야에서 활용이 가능한 효과가 있다."}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않은 한 이상적으로 또는 과도하게 해 석되지 않는다. 본 발명의 실시예들은 서버 컴퓨터 시스템, 데스크톱 컴퓨터 시스템들, 랩톱들로 제한되지 않고, 핸드헬드 디바 이스들, 스마트폰들, 태블릿들, 다른 씬 노트북들, SOC(systems on a chip, 시스템 온 칩) 디바이스들, 및 임베 디드 응용 분야들과 같은 다른 디바이스들에서도 사용될 수 있다. 핸드헬드 디바이스는 셀룰러폰들, 인터넷 프 로토콜 디바이스들, 디지털 카메라들, PDA들(personal digital assistants, 개인 휴대 단말기들), 및 핸드헬드 PC들을 포함한다. 또한, 본 명세서에 기술되어 있는 장치들, 방법들, 및 시스템들이 물리 컴퓨팅 디바이스들로 제한되지 않고, 또한 에너지 절감 및 효율을 위한 소프트웨어 최적화를 위해 이용될 수도 있다. 도 2 는 본 발명의 바람직한 일 실시예로서, 소형통합장치의 일 예를 도시한다. 소형통합장치는 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 메인프로세서 , 메인프로세서와 동일한 클럭을 이용하며 대용량 센서데이터를 처리하는 보조프로세서, 메인프 로세서와 동일한 클럭을 이용하며, 대용량 센서데이터의 연산처리를 수행하는 그래픽처리부를 포함한다. 본 발명의 바람직한 일 실시예로서, 메인프로세서, 보조프로세서 및 그래픽처리부는 대용량 센 서데이터를 병렬로 처리가 가능하다. 소형통합장치는 입출력 인터페이스를 이용하여 메인프로세서, 보조프로세서 및 그래픽처리 부를 직렬 또는 병렬로 확장하도록 구현이 가능하다. 본 발명의 바람직한 일 실시예에서, 메인프로세서는 범용 또는 특수 목적 중앙 처리 장치(CPU), 주문형 반 도체(ASIC) 또는 디지털 신호 프로세서(DSP)를 포함하는 임의의 타입의 데이터 프로세서일 수 있다. 예를 들어, 메인프로세서는 Core™ i3, i5, i7, 2 Duo 및 Quad, Xeon™, 또는 Itanium™ 프로세서 등의 범용 프로세서일 수 있다. 메인프로세서는 특수 목적을 위해 제작된 프로세서, 예를 들어, 네트워크 또는통신 프로세서, 압축 엔진, 그래픽 프로세서, 코-프로세서, 내장형 프로세서 등일 수 있다. 메인프로세서 는 하나 이상의 패키지들 내에 포함된 하나 이상의 칩들로 구현될 수 있다. 메인프로세서는, 예를 들어, BiCMOS, CMOS 또는 NMOS 등의 다수의 프로세스 기술들 중 임의의 기술을 이용할 수 있다. 본 발명의 바람직한 일 실시예에서, 메인프로세서는 적어도 하나 이상의 멀티코어CPU(212, 214)를 포함할 수 있다. 적어도 하나 이상의 멀티코어CPU(212, 214) 간에는 QPI(Quick Path Interconnect)프로토콜을 이용하 여 통신이 가능하다. 메인프로세서는 패킷 기반의 점대점(point-to-point) 상호 연결 버스를 이용하여 상 기 적어도 하나 이상의 멀티코어 CPU(210, 212)를 상호 연결할 수 있다. 본 발명의 바람직한 일 실시예에서, 그래픽처리부는 3D 또는 2D 그래픽 커맨드들 등의 그래픽 커맨드들을 실행하기 위한 로직을 포함한다. 그래픽처리부는 Open GL 및/또는 Direct X 응용 프로그래밍 인터페이스들 (API들)(예를 들어, OpenGL 4.1 및 Direct X 11)에 의해 지정된 커맨드들 등의 산업 표준 그래픽 커맨드들을 실 행할 수 있다. 입출력 인터페이스는 근거리 통신망, 광역 통신망 또는 인터넷 등의네트워크 통신, 내부 유닛 또는 외부 장치와의 통신을 지원할 수 있다. 입출력 인터페이스는 내부 유닛 또는 외부 장치와의 액세스 및 네트워크 통신을 제공하기 위해 어댑터, 허브 등을 추가로 더 포함할 수 있다. 입출력 인터페이스는 메인프로세서 와 동일한 칩 또는 동일한 보드에 구현되거나 또는 메인프로세서에 연결된 별개의 칩 및/또는 패키지 에 구현될 수 있다. 도 3 내지 4는 본 발명의 바람직한 일 실시예로서, 소형통합제어장치의 내부 구성도를 도시한다. 소형통합제어장치는 메인프로세서, 보조프로세서 및 그래픽처리부를 포함한다. 바람직하게, 소형통합제어장치는 입출력인터페이스 또는 이더넷 스위치를 더 포함할 수 있다. 바람직하게, 소형통합제어장치는 메인프로세서, 보조프로세서 및 그래픽처리부에 전원을 공급하는 전원부(미 도시)를 더 포함할 수 있다. 바람직하게, 소형통합제어장치는 메인프로세서, 보조프로세서 및 그래픽처리부를 제어하는 MCU(Micro Control Unit)(미 도시)를 더 포함할 수 있다. 이 경우 MCU는 메인프로세서와 이더넷 또는 RS232 등의 통신으을 수행할 수 있고, 전원부와는 CAN 통신으로 연결되어 있어, 전원 상태와 Fault 상황에 대해 주변 장치들의 후속 대책을 제어하도록 구현될 수 있다. 본 발명의 바람직한 일 실시예로서, 소형통합제어장치는 동일한 시스템 클럭을 이용하는 메인프로세서 , 보조프로세서 및 그래픽처리부를 이용하여 대용량 센서데이터를 병렬로 처리할 수 있다. 본 발명의 바람직한 일 실시예로서, 소형통합제어장치가 자율 주행 로봇, 이동 로봇, 이동체 등에 구현될 경우의 예를 가정할 수 있다. 이 경우, 메인프로세서는 자율 주행 로봇, 이동 로봇, 이동체 등에서 스스로 주행 경로를 선택하고 장애물 을 피해 목적지로 이동하기 위해 대용량 센서데이터에서 획득한 자율 주행 로봇, 이동 로봇, 이동체 등의 위치 데이터 및 자율 주행 로봇, 이동 로봇, 이동체 등과 근접한 위치에 있는 장애물에 대한 데이터를 기반으로 자율 주행을 위한 이동 경로를 표시하는 주행 맵 또는 지도를 생성할 수 있다. 이 경우, 보조프로세서는 메인프로세서에서 수신한 대용량 센서데이터 중 환경인식과 관련된 연산을 처리하고, 그래픽처리부는 대용량 센서데이터 중 영상과 관련된 연산을 처리하도록 병렬 처리를 수행할 수 있다. 보조프로세서에서 수행하는 환경인식과 관련된 연산은 레이저 기반 센서데이터를 처리하는 연산을 포함한 다. 레이저 기반 센서데이터는 레이저 스캐너 등에서 검출된 센서데이터를 포함한다. 그래픽처리부에서 수행하는 영상과 관련된 연산은 카메라 영상, 연산처리 등을 포함한다. 또한 레이저 기 반 센서데이터로부터 도출된 연산처리도 그래픽처리부에서 처리할 수 있다. 본 발명의 바람직한 일 실시예에서, 메인프로세서는 자율 주행 로봇, 이동 로봇, 이동체 등에서 위치 데이 터, 거리데이터, 근접한 위치에 있는 장애물에 대한 데이터 등을 나타내는 LADAR 센서정보, 2D, 3D LADAR 거리 정보, CAMERA 영상정보 등을 수신할 수 있다. 이 경우, 메인프로세서는 이더넷 스위치 등을 이용하 여 대용량 센서데이터를 수신하도록 구현될 수 있다. 메인프로세서는 대용량 센서데이터 중 거리데이터 및 근접한 위치에 있는 장애물에 대한 데이터의 연산처 리는 그래픽처리부에서 수행하도록 데이터를 전송하고, 그래픽처리부에서 연산처리가 끝나면, 결과를 수신하여, 그에 기초하여 주행맵 또는 지도를 생성하도록 구현될 수 있다. 그래픽처리부에서 연산을 처리 하는 일 실시예는 도 5 내지 6을 참고한다. 도 8은 본 발명의 바람직한 일 실시예로서, 메인프로세서에서 지원하는 계층화된 스택을 도시한다. 계층화된 스택은 시스템 계층(System Layer), 인터페이스 계층(Interface Layer), 코어 계층 (Core Layer) 및 애플리케이션 계층(Application Layer)을 포함한다. 인터페이스 계층(Interface Layer)은 MCU, 센서 및 통신 인터페이스를 지원한다. 코어 계층(Core Layer)은 동적 환경 실시간 파악, 시각 주행거리 파악, 레이저 스캔 매칭 등과 같은 위치 추정, 동적 장애물 탐지 및 추적, 레이저기반 환경인식 등과 같은 환경인식, RRT 샘플링 기반 전역 경로 계획, costom planning 및 동적 장애물 회피 등과 같은 planning, Basic Waypoint following 및 Fast Waypoint following 과 같은 주행제어, 그 외 수학라이브러리 및 유틸 라이브러리를 지원한다. 보조프로세서는 코어 계층(Core Layer) 중 동적 장애물 탐지 및 추적, 레이저기반 환경인식 등과 같 은 환경인식을 지원하여 처리가 가능하다. 또한, 병렬처리를 최적화 할 수 있는 부분을 처리하도록 구현이 가 능하다. Planning SW에서도 각 격자로 나누어 처리할 수 있어 병렬화가 가능하다면 보조프로세서에서 처 리될 수 있다. 도 5 내지 6 은 본 발명의 바람직한 일 실시예로서, 그래픽처리부에서 연산처리를 수행하는 일 실시예를 도시한 다. 그래픽처리부는 메인프로세서와 동일한 클럭을 이용하며, 멀티코어를 이용하여 대용량 센서데이터의 연산 처리를 병렬로 처리한다. 그래픽처리부는 연산부, 통과계수연산부 및 빈도검출부를 포함한다. 연산부는 메인프로세서로부터 대용량 센서 데이터 중 3차원 거리 데이터, 카메라 영상, 주행 데이터 등을 수신할 수 있다. 본 발명의 바람직한 일 실시예로서, 3차원 거리 데이터는 장애물의 3차원 영상 데이터, 거리 정보, 이동 정보 중 하나 이상을 근거로 하여 형성된다. 연산부는 도 6 의 일 실시예와 같이 3차원 거리데이터를 복셀(voxel) 데이터로 변환한다. 그 후, 각각의 복셀마다 포함되어 있는 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산을 계산한다. 도 6 을 참고하면, 본 발명의 바람직한 일 실시예에서 연산부는 3차원 거리 데이터를 일정한 크기의 직사 각형 크기의 복셀로 분할한다(S610, S620, S630). 이 경우 각각의 복셀(S610, S620, S630)은 서로 독립적인 관 계로, 각 복셀에 대한 계산은 멀티코어로 구현된 그래픽처리부에서 빠르게 처리가 가능하다. 본 발명의 바람직 한 일 실시예로서, 복셀의 높이는 벨로다인 센서 등 3차원 거리 감지 센서가 검출할 수 있는 최대의 높이로 설 정할 수 있다. 본 발명의 바람직한 일 실시예에서, 연산부는 각각의 복셀(S610, S620, S630)마다 포함되어 있는 3차원 포 인트 클라우드(point cloud) 데이터의 평균(mean) 및 공분산(covariance)을 계산한다. 통과계수연산부는 연산부에서 계산된 각 복셀의 평균(mean) 및 공분산(covariance)을 이용하여 아이 젠 값 및 아이젠 벡터값을 계산한다. 본 발명의 바람직한 일 실시예에서는 아이젠값(Eigen value)를 이용하여 각 복셀 내의 3차원 포인트 클라우드(point cloud) 데이터의 높이(도 6, S611)를 구하고, 아이젠 벡터값을 이용 하여 각 복셀 내의 3차원 포인트 클라우드(point cloud) 데이터의 표면 방향각(도 6, S613)을 구한다. 통과계수연산부는 아이젠값 및 아이젠 벡터값을 이용하여 각 복셀 내의 3차원 포인트 클라우드(point cloud) 데이터의 높이 및 표면 방향각을 계산하고, 이를 기초로 각 복셀을 통과할 수 있는지에 대한 확률값을 계산한다. 표면 방향각은 surface Normal 을 통해 계산될 수 있다. 본 발명에서는 이 확률값을 통과계수 (traversability)라 지칭한다. 통과계수는 수학식 1과 같이 구해질 수 있다.수학식 1"}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서 N(x)는 surface Normal을 계산하는 함수이고, x는 각 복셀의 인덱스를 나타낸다. 빈도검출부는 각 복셀이 스캔된 횟수(Occupancy)를 수치화한다. 각 복셀이 스캔된 횟수를 파악하는 것이 그래픽처리부에서만 수행될 수 있는 것으로 제한되는 것이 아니라, 메인프로세서에서도 수행이 가능 하다는 것을 주의하여야 한다. 본 발명의 바람직한 일 실시예로서, 이동 로봇, 이동체, 자율형 로봇 등에 장착된 레이저 센서는 근접한 거리에 있는 물체를 스캔하는 횟수가 원거리에 있는 물체를 스캔하는 횟수보다 높다. 본 발명의 바람직한 일 실시예에 서, 빈도검출부는 레이저 스캐너, 레이저 센서 등의 이러한 특성을 이용하여 각 복셀이 스캔된 횟수 (Occupancy)가 기설정된 횟수 이상 높을수록 가까운 곳에 위치하며 장애물 또는 물체 등으로 인식한 가능성이 정확함을 파악할 수 있다. 또한 센서데이터의 오차와 이동 로봇, 이동체, 자율형 로봇 등에서 위치 인식시 발생 하는 오차를 줄일 수 있다. 본 발명의 바람직한 일 실시예로서, 그래픽처리부는 각 복셀이 스캔된 횟수(Occupancy) 정보 및 각 픽셀의 통과계수를 메인프로세서로 전송한다. 메인프로세서는 각 복셀이 스캔된 횟수(Occupancy) 정보 및 각 픽셀의 통과계수에 대한 정보를 수신하면, 각 복셀이 스캔된 횟수(Occupancy) 정보 및 각 픽셀의 통과계수에 대한 정보를 누적적으로 이용하여 주행맵생성 부를 통해 3차원 주행맵 또는 지도를 작성한다. 메인프로세서는 주행 경로의 전방에 대하여 지속적으 로 얻어지는 3차원 거리 데이터를 히스토그램 매칭 등을 수행하여 시간에 따른 이동 정보 및 주행맵를 구할 수 있다. 이렇게 생성된 3차원 지도는 내부 칩, 내부 보드 또는 원격 장치에 저장이 가능하다. 메인프로세서에서 주행맵을 생성은 수학식 2와 같이 가능하다. 수학식 2"}
{"patent_id": "10-2014-0178719", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이 경우, Weightt=Weightt-1 + Occupancyt 본 발명의 바람직한 일 실시예에서, 이동체, 이동 로봇, 자율형 로봇 등은 메인프로세서에서 생성한 주행 맵을 참고하여, 주행한 경로를 자동으로 복귀가 가능하다. 본 발명의 바람직한 일 실시예에서, 주행맵 생성은 메인프로세서에서 단독으로 진행되지 않고 그래픽처리 부에서의 연산처리 및 보조프로세서에서의 환경인식과 병렬적으로 실시간으로 처리되는 특징이 있다. 도 7 은 본 발명의 바람직한 일 실시예로서, 그래픽처리부에서 3차원 거리데이터를 인식하여 통과계수를 계산하 는 일 예를 도시한다. 그래픽처리부는 3차원 거리데이터를 인식한 후, 인식한 3차원 거리데이터를 복셀데이터로 변환하고, 이 후 각 복셀 내의 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산 값을 기초로 아이젠 값, 아 이젠 벡터값을 계산하여 통과계수를 검출한다. 통과계수의 수치가 커질수록 진하게 표시되어 장애물이 존재함 을 나타낸다. 통과계수의 수치가 큰 부분을 음영이 진하게 표시되고, 통과계수의 수치가 낮을수록 음영이 연하게 표시된다. 예를 들어 통과계수가 0.1 인 경우는 음영이 연하게 표시되고, 나무의 잎사귀 부분을 나타낼 수 있으며, 통과계수가 0.7인 경우는 음영이 진하게 표시되고, 나무의 기둥을 나타낼 수 있다. 도 7c 는 본 발명의 바람직한 일 실시예로서, 소형통합제어장치를 이용하는 이동체, 이동 로봇, 자율형 로봇 에서 통과계수값을 계산하여 경로를 설정한 일 예를 도시한다. 통과계수값이 높을수록 통과할 수 있는 확률이 낮다는 것을 의미하며, 음영이 진하게 표시되고, 통과계수값이 낮을수록 통과할 수 있는 확률이 높다는 것을 의미하며, 음영이 연하게 표시된다. 도 9 는 본 발명의 바람직한 일 실시예로서, 소형통합제어장치가 장착된 또는 소형통합제어장치를 이용하는 이 동체의 일 실시예를 도시한다. 이동체는 3D 센서부, 센서부, GPS 송수신부, 제어부 및 출력부 (내부 구성 미도시)을 포함하도록 구현될 수 있다. 센서부는 스티어링(steering) 감지부, 속도 센서, 가속 센서, 위치 센서 등을 포함할 수 있다. 3D 센서부는 회전체 반사경과 집광 렌즈 및 촬상 소자를 이용하여 전방위, 후방위 및/또는 측방위를 한번에 촬 영하는 카메라 시스템으로서, 보안 시설과 감시 카메라, 로봇 비전 등에 응용된다. 회전체 반사경의 형상으로는 쌍곡면이나 구면, 원추형, 복합형 등 다양하다. 또한, 촬상 소자로는 CCD(Charge Coupled Device) 또는 CMOS(Complementary Metal Oxide Semiconductor)가 사용된다. 이 촬상 소자의 촬상면에 투영되는 화상(즉 전방 위 영상)은 회전체 반사경에 반사된 것이어서 인간이 그대로 관찰하기에는 적합하지 않은 일그러진 화상이다. 따라서 3D 센서부는 화상의 정확한 관찰을 위해 촬상 소자의 출력을 마이크로프로세서 등을 통해 그 좌표를 변 환하여 새로운 파노라마 영상을 만들어낸다. 3D 센서부는 전방위를 3차원적으로 촬영하여 3차원 거리 데이터를 획득하기 위해 스테레오 카메라(stereo camera), 깊이 카메라(depth camera), 이동식 스테레오 카메라(moving stereo camera) 및 라이다(Light Detection and Ranging; LIDAR) 장비 중 하나 이상을 포함하여 구성될 수 있다. 스테레오 카메라는 복수의 카메라로 구성되는 영상 장치이다. 3D 센서부를 통해 얻은 전방위 영상은 3D 센 서부 주변에 대한 2차원적인 정보를 제공한다. 만약 복수의 카메라를 통해 서로 다른 방향에서 촬영한 복수의 영상을 이용하면 3D 센서부 주변에 대한 3차원적인 정보를 얻을 수 있다. 이와 같은 스테레오 카메라를 이동체 또는 이동 로봇의 위치 인식 및 지도 생성에 이용하기도 한다. 깊이 카메라는 장애물을 촬영 또는 측정하여 영상과 거리 데이터를 추출하는 카메라이다. 즉, 깊이 카메라는 일 반적인 카메라와 같이 장애물을 촬상하여 영상 또는 이미지 데이터를 만들고, 각 영상의 픽셀에 해당하는 실제 위치에서 카메라로부터의 거리를 측정하여 거리 데이터를 만든다. 이동식 스테레오 카메라는 스테레오 카메라의 위치가 장애물의 거리에 따라 능동적으로 변하여 관측 장애물에 대한 주시각을 고정시키는 카메라를 말한다. 스테레오 카메라는 일반적으로 두 대의 카메라를 평행하게 배치하 고 영상을 획득하며, 획득 영상의 스테레오 시차에 따라 장애물까지의 거리를 계산할 수 있다. 이러한 스테레오 카메라는 광축이 항상 평행하게 배치되어 고정된 형태의 수동적인 카메라이다. 반면, 이동식 스테레오 카메라는 광축의 기하학적 위치를 능동적으로 변화시켜 주시각을 고정시킨다. 이렇게 스테레오 카메라 의 주시 각도를 장애물의 거리에 따라 제어하는 것을 주시각 제어라 한다. 주시각 제어 스테레오 카메라는 움직이는 장애물에 대한 스테레오 시차를 항상 일정하게 유지하여 입체 영상 관 측자에게 보다 자연스러운 입체 영상을 제공하며 장애물에 대한 거리 측정이나 스테레오 영상 처리에 있어서 유 용한 정보를 제공한다. 라이다(LIDAR) 장비는 이동체의 전면에 위치한 장애물의 존재와 거리를 감지하기 위해 구비된다. 라이다 장비는 레이더(Radar)와 동일한 원리를 이용해 사물에 직접적인 접촉 없이 원하는 정보를 취득하는 능동형 원격 탐사(Remote Sensing)의 한 종류다. 라이다 장비는 정보를 취득하고자 하는 목표물에 레이저(Laser)를 쏘아 목 표물로부터 반사되어 돌아오는 전자파의 시차와 에너지 변화를 감지해 원하는 거리 정보를 취득한다. 라이다 장비는 측정하고자 하는 목적이나 대상물에 따라 DIAL(DIfferentail Absorption LIDAR), 도플러 라이다 (Doppler LIDAR), 거리 측정 라이다(Range finder LIDAR)의 세 종류로 나뉜다. DIAL은 측정하고자 하는 물체에 대한 흡수 정도가 서로 다른 두 개의 레이저를 이용해 대기중의 수증기, 오존, 공해 물질 등의 농도 측정에 활 용되고, 도플러 라이다(Doppler LIDAR)는 도플러 원리를 이용해 물체의 이동 속도 측정에 이용된다. 그러나 일 반적으로 라이다라고 하면 거리 측정 라이다(Range finder LIDAR)를 지칭하며 이것은 위성 측위 시스템(Global Positioning System; 이하 GPS)과 관성 항법 유도 장치(Inertial Navigation System; 이하 INS), 레이저 스캐 너(LASER SCANNER) 시스템을 이용하여 대상물과의 거리 정보를 조합함으로써 3차원 지형 정보를 취득한다.라이다 장비는 이동체의 이동 경로 전면에 위치한 장애물의 존재와 장애물까지의 거리 및 장애물의 이 동을 감지하여 3차원 거리 데이터를 획득하고, 획득된 데이터를 제어부로 전송하여 장애물이 없는 공간으로 이 동체가 이동할 수 있도록 한다. 출력부는 디스플레이부를 포함하며, 제어부 또는 메인프로세서의 주행맵생성부(도 5, 511)에서 생성된 주행맵을 통해 결정된 주행 경로를 UI(User Interface) 또는 GUI(Graphic User Interface)를 이용하여 표시하도록 구현 될 수 있다. 도 10은 본 발명의 바람직한 일 실시예에서, 소형통합제어장치의 그래픽처리부에서 병렬적으로 대용량센서데이 터를 처리하는 흐름도를 도시한다. 소형통합제어장치에서 대용량 센서데이터를 처리하는 방법은 메인프로세서에서 적어도 하나 이상의 멀티코어 CPU를 이용하여 대용량 센서데이터를 처리하는 단계(S1010), 보조프로세서에서 상기 메인프로세서와 동일한 클 럭을 이용하여 상기 대용량 센서데이터 중 환경인식과 관련된 센서데이터를 처리하는 단계(S1020) 및 그래픽처리부에서 멀티코어를 이용하여 상기 메인프로세서와 동일한 클럭을 이용하여 상기 대용량 센서데이터 중 연산처리를 수행하는 단계(S1030)를 병렬적으로 수행하는 특징이 있다. 그래픽처리부 내부에서는 또한 메인프로세서로부터 수신한 대용량 센서데이터에 대한 연산처리를 병렬적으로 수 행한다. 도 11을 참고하면, 소형통합제어장치의 그래픽처리부에서는 메인프로세서로부터 대용량 센서 데이터 중 3차원 거리 데이터를 수신한다(S1110). 이 후, 3차원 거리 데이터를 복셀 데이터로 변환하고(S1120), 각 복셀 마다 포함되어 있는 3차원 포인트 클라우드(point cloud) 데이터의 평균 및 공분산을 계산한다(S1130). 이후, 그래픽처리부는 평균 및 공분산 값을 기초로 아이젠 값 및 아이젠 벡터값을 계산하고(S1140), 아이젠 값 및 아이젠 벡터값을 기초로 각 복셀의 표면 방향각 및 높이를 계산하여 통과계수(traversability)를 계산한다. 이 후, 각 복셀을 스캔한 횟수값(Occupancy)을 수치화하여 계산된 통과계수에 정확도에 대한 가중치를 부여할 수 있다(S1160). 본 발명의 상기 방법은 또한 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로 피 디스크, 광데이터 저장장치 등이 있으며, 또한 캐리어 웨이브(예를 들어 인터넷을 통한 전송)의 형태로 구현 되는 것도 포함한다. 또한 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어 분 산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이상에서는 도면에 도시된 구체적인 실시예를 참고하여 본 발명을 설명하였으나 이는 예시적인 것에 불과하므로, 본 발명이 속하는 기술 분야에서 통상의 기술을 가진 자라면 이로부터 다양한 수정 및 변형이 가능 할 것이다. 따라서, 본 발명의 보호 범위는 후술하는 특허청구범위에 의하여 해석되어야 하고, 그와 동등 및 균 등한 범위 내에 있는 모든 기술적 사상은 본 발명의 보호 범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면7c 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2014-0178719", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 일반적인 제어기의 일 예를 도시한다. 도 2 는 본 발명의 바람직한 일 실시예로서, 소형통합장치의 일 예를 도시한다. 도 3 내지 4는 본 발명의 바람직한 일 실시예로서, 소형통합제어장치의 내부 구성도를 도시한다. 도 5 내지 7 은 본 발명의 바람직한 일 실시예로서, 그래픽처리부에서 연산처리를 수행하는 일 실시예를 도시한 다. 도 8은 본 발명의 바람직한 일 실시예로서, 메인프로세서에서 지원하는 계층화된 스택을 도시한다. 도 9 는 본 발명의 바람직한 일 실시예로서, 소형통합제어장치가 장착된 또는 소형통합제어장치를 이용하는 이 동체의 일 실시예를 도시한다. 도 10은 본 발명의 바람직한 일 실시예에서, 소형통합제어장치의 그래픽처리부에서 병렬적으로 대용량센서데이 터를 처리하는 흐름도를 도시한다. 도 11은 본 발명의 바람직한 일 실시예에서, 소형통합제어장치의 그래픽처리부에서 연산처리를 수행하는 흐름도 를 도시한다."}
