{"patent_id": "10-2023-0034807", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0140423", "출원번호": "10-2023-0034807", "발명의 명칭": "ChatGPT등 생성 인공지능을 활용한 생성AI로봇시스템 및 음성인식-발화-제어 기술", "출원인": "이수희", "발명자": "이수희"}}
{"patent_id": "10-2023-0034807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구동부, 통신부 및 처리부를 구비한 로봇, 상기 통신부를 통해 로봇에 연결된 서버, 및 상기 로봇을 이용하여음성을 인식하는 프로그램이 저장된 기억매체를 포함하고, 상기 로봇의 구동부는 사용자로부터 음성 입력을 수신하도록 구성된 로봇 시스템 음성 입력은 음성-텍스트(STT) 엔진을 사용하고, 처리된 음성 입력은 추가 처리를위해 통신 부분을 통해 서버로 전송됩니다."}
{"patent_id": "10-2023-0034807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "상기 로봇의 처리부는 상기 TTS 출력의 적절한 톤, 볼륨 및 속도를 결정하기 위해 상기 자연어 처리(NLP) 엔진을 이용하여 상기 응답의 텍스트를 더 분석하는 것을 특징으로 하는 로봇 시스템."}
{"patent_id": "10-2023-0034807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 로봇은 다국어 STT 엔진을 사용하여 복수의 언어를 인식하고 응답하도록 구성된 로봇시스템."}
{"patent_id": "10-2023-0034807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 로봇은 사용자의 신원을 판단하고 응답을 개인화하기 위해 스피커 인식 엔진을 이용하여스피커 인식을 수행하는 것을 특징으로 하는 로봇 시스템."}
{"patent_id": "10-2023-0034807", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "상기 로봇은 생성AI엔진 내 데이터를 기반으로 사용자의 신원, 감정, 특징을 판단하고 개인화된 응답을 한 뒤,생성AI의 판단결과와 ROS의 구동부와 연동하여 판단에 맞는 이동을 하는 것을 특징으로 하는 로봇 시스템."}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 특허 출원은 사용자의 음성 명령을 인식하고 응답할 수 있는 로봇 시스템에 관한 것이다. 이 시스템은 음성 인식, 자연어 처리, 텍스트 음성 변환, 생성 AI 기능을 가능하게 하는 로봇, 서버 및 다양한 소프트웨어 구성 요 소를 포함한다. 특허 청구항은 음성 명령을 정확하게 인식하고 응답하기 위해 로봇이 소프트웨어 구성 요소와 인터페이스하도록 설계된 방식을 포함하여 시스템의 기술적 특징 및 기능을 설명한다. 또한, 청구항은 음성 인식, 자연어 처리 및 생성 AI 기능을 가능하게 하는 데 사용되는 알고리즘과 모델을 포함하여 소프트웨어 구성요소 자체를 다룬다. 전 반적으로, 본 발명은 로봇 시스템 및 음성 인식 분야에서 상당한 발전을 나타내며, 사용자에게 향상된 기능 및 사용성을 제공한다"}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "특허 청구는 생성 AI, STT, TTS, NLP와 같은 첨단 기술을 사용하여 로봇이 인간의 음성 명령을 인식하고 응답할 수 있도록 하는 로봇 및 서버 시스템에 관한 것이다. 청구항은 로봇, 서버 및 관련 소프트웨어 및 하드웨어 구 성요소의 설계 및 작동을 포함하여 시스템의 다양한 측면을 설명한다."}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 로봇 및 이에 연결된 서버, 및 상기 로봇을 이용한 음성 인식 방법에 관한 것이다. 최근 몇 년간 음 성 인식 기술은 로봇 공학, 스마트 홈, 개인 비서 등 다양한 분야에서 널리 사용되고 있다. 그러나 기존 음성인 식 기술은 정확성, 속도, 음성의 자연스러움 측면에서 한계가 있다. 또한, 종래의 로봇 및 서버는 컴퓨팅 능력 및 메모리 용량에 제한이 있어 음성 명령을 정확하게 인식하고 처리하는 데 어려움이 있었다. 따라서, 정확하고 빠르고 자연스러운 음성 인식 및 처리를 수행할 수 있는 로봇 및 서버 시스템이 필요한 실정이다. 본 발명은 음 성-텍스트(STT), 텍스트-음성(Text-to-Speech, TTS), 자연어 처리(NLP), 생성 AI 엔진 등 최첨단 기술을 로봇 과 서버 시스템에 통합함으로써 이러한 한계를 극복한다. 결과 시스템은 음성 명령을 자연스럽고 인간적인 방식으로 정확하고 빠르게 인식하고 처리할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허공개 제 10-2021-0001529호 '로봇, 그와 연결되는 서버 및 로봇을 이용한 음성인식방법' 비특허문헌 (비특허문헌 0001) Open AI ChatGPT generative logic"}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기 특허청구범위에 기재된 기술은 로봇의 맥락에서 음성 인식과 관련된 몇 가지 문제점을 해결한다. 주요 과 제 중 하나는 소음이 심한 환경이나 여러 음원이 있는 경우 정확하고 신뢰할 수 있는 음성 인식을 달성하는 것 이다. 또 다른 과제는 음성 인식 시스템이 다양한 억양과 음성 패턴을 이해할 수 있도록 하는 것인데, 이는 지 역과 언어에 따라 크게 다를 수 있다. 또한 사용자가 특정 구문이나 어휘를 사용하지 않고 음성 명령을 통해 로 봇과 상호 작용할 수 있는 원활하고 자연스러운 사용자 경험을 제공하는 것이 중요하다. STT, TTS, NLP 및 생성 AI 엔진의 조합을 포함하는 제안된 기술은 이러한 과제를 해결하고 로봇을 위한 보다 효과적이고 사용자 친화적 인 음성 인식 시스템을 제공하는 것을 목표로 한다."}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 과제 해결책은 로봇과 함께 사용할 수 있는 효율적이고 편리한 음성 인식 시스템을 제공하는 것에 관 한 것이다. 종래, 음성 인식 시스템은 개인용 컴퓨터나 스마트폰과 같은 전용 기기를 이용하여 구현되어 왔다. 그러나 이러한 기기들은 종종 정지 상태이며, 사용자가 기기와 효과적으로 상호작용할 수 있도록 기기에 가까이 있어야 한다. 또한, 이러한 장치들은 종종 키보드 또는 터치 스크린과 같은 입력 방법을 사용하여 사용자가 상 호 작용해야 하므로 특정 상황에서 사용하기 불편하거나 번거로울 수 있다. 본 발명은 로봇에 통합된 음성 인식 시스템을 제공함으로써 이러한 한계를 극복한다. 음성 인식 시스템의 인터 페이스로 로봇을 사용하면 시스템 사용 시 이동성과 유연성이 향상됩니다. 사용자는 특수 입력 장치 없이도 자 연어를 사용하여 음성 인식 시스템과 상호 작용할 수 있다. 또한, 로봇을 음성 인식 시스템의 인터페이스로 사 용하면 로봇이 주변 환경에 대한 지식과 사용자의 행동을 활용하여 사용자의 의도를 더 잘 해석할 수 있기 때문 에 사용자 요청에 대한 상황적 이해를 높일 수 있다. 이에 본 발명은 음성 인식을 위한 보다 자연스럽고 직관적 인 인터페이스를 제공하여 사용자가 보다 인간적인 방식으로 기술과 상호작용할 수 있도록 한다."}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기 청구항들에서 설명된 발명은 몇 가지 중요한 이점들을 제공한다. 첫째, 음성 인식 기능이 있는 로봇은 직 관적이고 자연스러운 사용자 인터페이스를 제공하여 사용자 경험을 크게 향상시킬 수 있다. 음성 인식 기술은 사용자가 자연 언어를 사용하여 로봇과 상호 작용할 수 있도록 하여 상호 작용을 단순화하고 사용자가 더 편안 하게 사용할 수 있도록 한다. 이는 사용자의 만족도를 향상시키고 사용자가 로봇과 더 자주 상호 작용하도록 장 려할 수 있다. 또한, 생성 AI 엔진과 NLP 기술을 사용하면 사용자의 명령과 쿼리를 정확하게 이해하고 응답하는 로봇의 능력을 향상시켜 로봇을 더욱 지능적이고 유능하게 만들 수 있다. 게다가, 로봇의 음성 인식 기술은 홈 오토메이션, 스마트 쇼핑, 개인 비서와 같은 다양한 시나리오에 적용될 수 있어 사람들의 일상 생활에 상당한 편의를 가져다 줄 수 있다. 예를 들어, 로봇은 스마트 홈 장치 제어, 질문에 대한 답변 및 권장 사항 제공과 같은 다양한 작업을 수행하도록 프로그래밍될 수 있습니다. 이 로봇은 또한 전통적인 인터페이스를 사용하는 데 어려움을 겪는 장애인이나 노인들을 도와 삶의 질을 향상시킬 수 있다. 전반 적으로, 그 발명은 인간과 로봇의 상호 작용을 크게 향상시키고 사회에 상당한 이익을 가져다 줄 수 있다."}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음은 첨단 음성 인식, 응답 처리 및 개인화된 통신 기능을 갖춘 새로운 로봇 시스템을 설명하는 특허 요청을"}
{"patent_id": "10-2023-0034807", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약한 것이다. 시스템은 드라이버를 포함하는 로봇, 통신부 및 처리부를 포함하며, 이는 음성 인식 프로그램을 저장하는 서버에 연결된다. 이 프로그램은 AI 엔진을 사용하여 사용자의 음성 입력에 대한 응답을 생성하며, 시 스템은 다국어 음성-텍스트 엔진을 사용하여 여러 언어를 인식하고 응답할 수 있다. 특허 요청은 또한 로봇 시스템에 의해 생성된 응답의 처리를 설명한다. 로봇의 처리 장치는 텍스트 음성 변환 엔진을 사용하여 서버의 응답을 텍스트로 변환하고, 변환된 응답은 스피커를 통해 음성으로 출력된다. 처리부는 자연어 처리 엔진을 이용하여 텍스트를 분석하여 텍스트 대 음성 출력의 적절한 톤, 볼륨 및 속도를 결정한다. 시스템은 또한 사용자의 신원에 대한 응답을 개인화하기 위해 스피커 인식 엔진을 사용하여 스피커 인식을 수행 한다. 또한, 특허 청구는 개인화된 응답을 생성하기 위한 상황 정보 및 감정 인식의 사용을 설명한다. 로봇 시스템은 상황 정보 처리 엔진을 사용하여 사용자의 위치, 선호도 및 이전 상호 작용과 같은 사용자와 관련된 상황 정보 를 처리하여 보다 정확하고 개인화된 응답을 생성한다. 또한, 시스템은 음성 감정 인식 엔진을 이용한 음성 감 정 인식을 특징으로 하여 사용자의 감정 상태를 감지하고 이에 따라 응답의 톤과 내용을 조절한다. 이 시스템은 생성된 AI 엔진의 데이터를 기반으로 사용자의 정체성, 감정, 특성 등을 판단해 개인화된 대응을 하고 생성된 AI와 ROS의 구동장치 판단 결과에 따라 움직이는 것이 특징이다. 전반적으로 특허청구서는 첨단 음성 인식, 응답 처리 및 개인화된 통신 기능을 갖춘 독특한 로봇 시스템을 제시 한다. 이 시스템은 사용자에게 원활한 상호 작용 경험을 제공하여 사용자가 선호하는 언어로 로봇과 소통하고 상황 정보 및 감정 상태에 맞는 맞춤형 응답을 받을 수 있다. 제안된 시스템은 인간이 로봇과 상호 작용하는 방 식을 혁신하여 의료, 교육 및 엔터테인먼트를 포함한 다양한 환경에서 로봇이 더 접근하기 쉽고 인간과 비슷하 며 효율적으로 만들 수 있는 잠재력을 가지고 있다. 생성AI로봇장치은 생성 AI엔진과 음성인식, 사용자인식, 자연어처리, 생성AI엔진과 구동부 연동 등의 기능 전체를 포함하는 생성AI 로봇을 지칭한다. 생성AI로봇장치은 생성AI로봇음성인식 발화를 지칭한다 생성AI로봇장치은 생성AI로봇의 센서디바이스를 통해 입력된 모든 형태의 정보들이 저장, 정제, 딥러닝, 강화된 최종 텍스트 답변을 자연어처리하는 엔진. 생성AI로봇장치은 로봇내 생성AI엔진을 지칭한다. 생성AI로봇장치은 로봇내 생성AI엔진내 딥러닝엔진을 지칭한다. 생성AI로봇장치은 생성AI로봇다국어 STT(Speech to Text)/TTS(Text to Speech)엔진을 지칭한다. 생성AI로봇장치은 생성AI로봇스피커인식엔진으로 사용자의 신원을 판단하고 응답을 개인화하기 위해 스피 커 인식 엔진을 지칭한다.생성AI로봇장치은 보다 정확하고 개인화된 응답을 생성하기 위해, 상황 정보 처리 엔진을 지칭한다. 예를 들어, 사용자의 위치, 목소리의 떨림, 선호도 등을 통해 생성AI로봇은 사용자특징파악할 수 있다. 생성AI로봇장치은 로봇의 센서디바이스들로 사용자의 얼굴표정, 사용자의 안절부절하는 움직임, 목소리 떨 림등을 통해 생성AI로봇이 사용자감정파악할 수 있는 장치이다. 생성AI로봇장치은 생성AI로봇 내 생성AI엔진과 구동부가 연동되어 생성AI엔진의 판단결과에 따른 적정한 이동하는 장치를 지칭한다."}
{"patent_id": "10-2023-0034807", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 도면은 로봇, 서버 및 로봇을 이용한 음성 인식 방법에 관한 것이다. 그 발명은 로봇이 음성-텍스트(STT) 기 술, 자연어 처리(NLP), 텍스트-음성(TTS) 기술을 활용하여 음성 명령을 정확하게 인식할 수 있게 한다. 로봇은 생성 AI 엔진을 탑재해 사용자 요청에 응답하고 대화 맥락에 따라 다양한 작업을 수행할 수 있다. 이 시스템에 는 음성 데이터를 처리하는 서버도 포함되어 있어 로봇이 보다 효율적으로 작동하고 보다 정확한 응답을 제공할 수 있다. 전반적으로, 그 발명은 인간과 로봇 사이의 보다 직관적이고 사용자 친화적인 상호 작용을 가능한 것 을 표현한다."}
