{"patent_id": "10-2022-0121952", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0042990", "출원번호": "10-2022-0121952", "발명의 명칭": "인공지능을 통한 맞춤형 학습 관리 시스템 및 방법", "출원인": "김연준", "발명자": "김연준"}}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능을 통한 맞춤형 학습 관리 시스템에 있어서,학습시간, 웹캠으로 생성된 통한 학습자의 이미지, 학습자 생체정보, 나이, 학년, 평가 결과, 설문답변을 포함하는 학습자 데이터를 수집하는 학습자 단말; 및학습자 데이터를 분석하여 분석 결과에 따른 학습자별 최적 학습 전략을 생성하고, 도서관, 독서실, 회의실을포함하는 메타버스 상의 학습환경을 생성하여, 상기 학습자 단말로 제공하는 서버; 를 포함하는 인공지능을 통한 맞춤형 학습 관리 시스템."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 서버; 는학습자의 이미지, 생체정보, 개인정보, 평가결과, 설문답변을 포함하는 학습자 데이터 및 학습 환경 별 앰비언스 데이터를 수집하는 데이터 수집 모듈;도서관, 독서실, 스터디 카페, 회의실, 강의실을 포함하는 학습 환경을 2차원 또는 3차원 객체로 구현하고, 구현된 학습환경에 해당하는 앰비언스를 출력하는 학습환경 생성 모듈;학습자 데이터를 분석하여, 기간별, 장소 별, 과목별 학습시간, 성적 변화를 포함하는 1차 분석 데이터를 생성하는 학습 데이터 분석 모듈;생성된 1차 분석 데이터를 기반으로 학습자 단말로부터 기간별 목표 정보를 입력 받아, 목표를 해당 기간에 달성하기 위한 학습전략을 생성하는 학습 전략 생성 모듈; 을 포함하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 시스템."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 서버; 는학습자 별 누적 접속시간, 집중도가 일정 수준 이상인 실제 공부 시간, 접속 빈도 및 목표 달성률을 포함하는학습자의 학습과정 지표와 상기 학습자의 테스트 결과 및 시험 결과를 포함하는 학습 성취도 지표에 따라 학습자별 리워드를 산출하고, 학습자에게 제공되는 리워드를 통해 메타버스 공간 내에서 아이템 구매, 아바타 육성을 가능하게 하는 리워드 관리 모듈;스터디 그룹을 설정하여 설정된 그룹 간 리워드 또는 학업 성취도 경쟁을 가능하게 하는 그룹 설정 모듈; 을 더포함하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 시스템."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 서버; 는공부중인 학습자를 모니터링하는 웹캠스터디를 수행하는 경우, 카메라를 통해 수집된 학습자의 이미지를 분석하여, 상기 학습자의 실제 학습 시간 및 집중도를 파악하는 이미지 분석 모듈; 을 더 포함하고, 상기 이미지 분석 모듈; 은 학습자의 얼굴, 신체 움직임 및 척추 측만증 정도를 포함하는 집중도 평가 지표를 측정하여, 측정된 집중도 평공개특허 10-2024-0042990-3-가 지표를 통해 학습자 별 집중도를 산출하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 시스템."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 리워드 관리 모듈; 은 학습 효율 증가율, 목표 달성율, 학습속도를 포함하는 학습 과정 평가 요소를 학습자 별로 파악하여 학습자 간의 랭킹 정보를 생성하고, 인공지능이 제공하는 학습 플랜 성취도에 따라 학습자에게 추가 리워드를 제공하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 시스템."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 학습 전략 생성 모듈; 은 학습자의 학습패턴을 분석하여 성적이 낮은 과목과 학습자가 일정횟수 이상 실수하는 취약 파트를 파악하고, 학습자에게 상기 취약 파트 정보를 제공하고, 상기 취약 파트의 성적을 일정 비율 이상 향상시키기 위한 맞춤형솔루션을 제공하고,메타버스 상에서 전문가가 실시간으로 학습자의 질문에 대한 답변을 제공하는 것을 특징으로 하는 인공지능을통한 맞춤형 학습 관리 시스템."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공지능을 통한 맞춤형 학습 관리 방법에 있어서, (A) 데이터 수집 모듈에서 학습자의 이미지, 생체정보, 개인정보, 평가결과, 설문답변을 포함하는 학습자 데이터 및 학습 환경 별 앰비언스 데이터를 수집하는 데이터 수집하는 단계;(B) 학습환경 생성 모듈에서 도서관, 독서실, 스터디 카페, 회의실, 강의실을 포함하는 학습 환경을 2차원 또는3차원 객체로 구현하고, 구현된 학습환경에 해당하는 앰비언스를 출력하는 단계;(C) 학습 데이터 분석 모듈에서 학습자 데이터를 분석하여, 기간별, 장소 별, 과목별 학습시간, 성적 변화를 포함하는 1차 분석 데이터를 생성하는 단계;(D) 학습 전략 생성 모듈에서 생성된 1차 분석 데이터를 기반으로 학습자 단말로부터 기간별 목표 정보를 입력받아, 목표를 해당 기간에 달성하기 위한 학습전략을 생성하는 단계; 를 포함하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 방법."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 인공지능을 통한 맞춤형 학습 관리 방법은 (E) 리워드 관리 모듈에서 학습자 별 누적 접속시간, 집중도가 일정 수준 이상인 실제 공부 시간, 접속 빈도 및목표 달성률을 포함하는 학습자의 학습과정 지표와 상기 학습자의 테스트 결과 및 시험 결과를 포함하는 학습성취도 지표에 따라 학습자별 리워드를 산출하고, 학습자에게 제공되는 리워드를 통해 메타버스 공간 내에서 아이템 구매, 아바타 육성을 가능하게 하는 단계; 및(F) 그룹 설정 모듈에서 스터디 그룹을 설정하여 설정된 그룹 간 리워드 또는 학업 성취도 경쟁을 가능하게 하는 단계; 를 더 포함하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 방법."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2024-0042990-4-제7항에 있어서, 상기 (A)의 단계; 는(A-1) 이미지 분석 모듈에서 공부중인 학습자를 모니터링하는 웹캠스터디를 수행하는 경우, 카메라를 통해 수집된 학습자의 이미지를 분석하여, 상기 학습자의 실제 학습 시간 및 집중도를 파악하는 단계; 를 포함하고, 상기 (A-1)의 단계; 는 학습자의 얼굴, 신체 움직임 및 척추 측만증 정도를 포함하는 집중도 평가 지표를 측정하여, 측정된 집중도 평가 지표를 통해 학습자 별 집중도를 산출하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 방법."}
{"patent_id": "10-2022-0121952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 (E)의 단계; 는 학습 효율 증가율, 목표 달성율, 학습속도를 포함하는 학습 과정 평가 요소를 학습자 별로 파악하여 학습자 간의 랭킹 정보를 생성하고, 인공지능이 제공하는 학습 플랜 성취도에 따라 학습자에게 추가 리워드를 제공하는 것을 특징으로 하는 인공지능을 통한 맞춤형 학습 관리 방법."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템은 학습시간, 웹캠으로 생성된 통한 학습자의 이미지, 학습자 생체정보, 나이, 학년, 평가 결과, 설문답변을 포함하는 학습자 데이터를 수집하는 학습자 단말; 및 학습 자 데이터를 분석하여 분석 결과에 따른 학습자별 최적 학습 전략을 생성하고, 도서관, 독서실, 회의실을 포함하 는 메타버스 상의 학습환경을 생성하여, 상기 학습자 단말로 제공하는 서버; 를 포함한다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능을 통한 맞춤형 학습 관리 시스템 및 방법에 관한 것으로 구체적으로, 온라인 독서실 서비스 를 제공하고, 또래 수험생과의 웹캠스터디를 진행할 수 있도록 하고, 인공지능을 활용한 영상 및 학습기록 분석 을 통해 나만의 공부패턴을 확인할 수 있도록 함으로써, 개인별 최적화된 학습환경을 구축하고 인공지능 머신러 닝을 이용한 학습 패턴 분석을 통해 사용자 별 학습 솔루션과 전략을 수립하는 인공지능을 통한 맞춤형 학습 관 리 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 인공지능(artificial intelligence)은 사람처럼 학습하고 추론할 수 있는 지능을 가진 컴퓨터 시스템을 구축하 는 기술로서, 대표적으로 머신러닝(machine learning) 기술 분야를 포함한다. 머신러닝은 규칙을 일일이 프로그 래밍하지 않아도 자동으로 데이터에서 규칙을 학습하는 알고리즘을 연구하는 분야이다. 인공지능의 하위 분야 중에서 지능을 구현하기 위한 소프트웨어를 담당하는 핵심 분야로서, 인간이 학습을 통해 정확도를 점진적으로 개선하는 방식을 모방하기 위한 데이터와 알고리즘의 사용에 초점을 맞춘다. 스마트기기가 보편화되고 컴퓨터 사이언스가 급속도로 발전하며 인공지능 머신 러닝을 이용한 다양한 서비스들 이 등장하고 있다. 인공지능 머신 러닝을 통해 사용자의 누적 데이터를 학습하여 사용자 맞춤형 상품, 서비스, 플랫폼 등을 추천하는 서비스도 확대되고 있다. 시간이 지남에 따라 데이터가 누적되면 사용자 맞춤형 서비스 추출을 위한 데이터셋을 업데이트하여 사용자에게 보다 적합한 서비스 및 상품을 추천할 수 있는 시스템으로 발 전하고 있다. 한편, IT 기술에 친숙한 MZ세대는 학습 자체를 노트북 태블릿 모바일 등의 디바이스를 활용하여 진행하는 것이 익숙하므로, 기존의 수험 준비와 학습 방법 자체에 디지털 친화적인 변화가 필요하다. 젊은 수험생들은 유튜브 나 화상회의 플랫폼을 이용한 캠 스터디라는 새로운 방식으로 학습하기 시작했다. 캠스터디 이용자를 조사한 통 계에 의하면 취업준비생과 공무원 시험을 준비하는 수험생들이 가장 많은 비중을 차지하고 전체 이용자의 78프 로가 20대 연령층이라고 한다. 또한, 태블릿용 노트서식 다이어리 스티커 이미지 등을 제공하는 디지털 문구 플 랫폼은 1년 만에 900%가량의 성장세를 보이고 있다. 인공지능 머신 러닝을 이용해 사용자 학습 과정과 결과를 분석하고 학습 전략을 생성하는 시스템이 다수 존재하 지만, 대부분 사용자 만의 개별 데이터 분석 결과에 기반한 일차원적인 솔루션을 제안할 뿐이다 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국공개특허 제10-2021-0061294호 (2021.05.27) (특허문헌 0002) 2. 한국공개특허 제10-2022-0089846호 (2022.06.29)"}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템 및 방법은 메타버스 속 다양한 형태의 학습환경, 스터 디 룸과 인공지능 봇 및 스터디 플래너를 제공한다. 또한, 실시예에서는 사용자 간 효율적인 소통과 학습의욕 고취할 수 있도록 3차원 메타버스 상의 학습 공간을 구현하고, 인공지능을 이용한 컴퓨터 비전 및 추천 기술을 활용하여 자기주도 학습 촉진시킬 수 있도록 한다. 실시예에서는 학습자의 선호도에 따라 홀로 공부할 수 있는 독서실은 물론 친구들과 함께 공부할 수 있는 스터 디룸, 도서관, 스터디 카페 등 다양한 학습환경을 3차원의 다양한 메타버스 형태로 생성한다. 실시예에서는 학 습 환경 별로 백색소음, 카페 앰비언스(Ambience) 사운드, 도서관 앰비언스 사운드 등을 제공하여 학습자가 원 하는 생생한 학습 환경에 몰입할 수 있도록 한다. 실시예에서는 캠스터디를 하는 경우 학습자의 영상 및 이미지 데이터를 프레임 단위로 분석할 수 있도록 데이터 셋을 구축하고, 학습자의 학습 여부를 확인할 수 있는 인공지능 알고리즘을 제공한다. 아울러, 학습자 별 누적 데이터 분석으로 최적 학습 전략을 생성하여 학습자 각각에게 맞춤형 학습전략을 제안 하고, 메타버스 내에서 퀘스트 달성에 따른 리워드 제공(Learn-To-Earn)과 같은 게임요소와 커뮤니티 요소를 제 공한다. 또한, 실시예에서는 입시와 취업 준비를 위한 멘토를 선정하여 메타버스를 이용한 비대면 튜터링 서비스를 제공 한다. 또한, 실시예에서는 학습자 별 맞춤형 학습 전략 파악에 최적화된 맞춤형 트레이닝 데이터 셋(Training Data Set)을 기반으로 딥러닝 뉴럴 네트워크에 기초한 기계학습을 수행하여 최적 학습 전략 산출 모델을 구현한다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템은 학습시간, 웹캠으로 생성된 통한 학습자의 이미지, 학습자 생체정보, 나이, 학년, 평가 결과, 설문답변을 포함하는 학습자 데이터를 수집하는 학습자 단말; 및 학 습자 데이터를 분석하여 분석 결과에 따른 학습자별 최적 학습 전략을 생성하고, 도서관, 독서실, 회의실을 포 함하는 메타버스 상의 학습환경을 생성하여, 상기 학습자 단말로 제공하는 서버; 를 포함한다. 다른 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 방법은 (A) 데이터 수집 모듈에서 학습자의 이미지, 생 체정보, 개인정보, 평가결과, 설문답변을 포함하는 학습자 데이터 및 학습 환경 별 앰비언스 데이터를 수집하는 데이터 수집하는 단계; (B) 학습환경 생성 모듈에서 도서관, 독서실, 스터디 카페, 회의실, 강의실을 포함하는 학습 환경을 2차원 또는 3차원 객체로 구현하고, 구현된 학습환경에 해당하는 앰비언스를 출력하는 단계; (C) 학습 데이터 분석 모듈에서 학습자 데이터를 분석하여, 기간별, 장소 별, 과목별 학습시간, 성적 변화 등을 포 함하는 1차 분석 데이터를 생성하는 단계; (D) 학습 전략 생성 모듈에서 생성된 1차 분석 데이터를 기반으로 학 습자 단말로부터 기간별 목표 정보를 입력 받아, 목표를 해당 기간에 달성하기 위한 학습전략을 생성하는 단계; 를 포함한다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같은 인공지능을 통한 맞춤형 학습 관리 시스템 및 방법은 독서실, 회의실, 스터디 카페, 도서관 등 학습자가 원하는 다양한 학습환경을 메타버스를 통해 생생하게 구현하여, 학습자가 원하는 학습 환경에서 공부 에 더욱 몰입할 수 있도록 한다. 또한, 실시예에서는 인공지능 머신러닝을 통해 누적된 모션, 자세, 학습 누적시간 등을 포함하는 학습자 데이터 를 시간, 환경, 다른 학습자와의 비교 등 다양한 관점으로 분석하고 분석을 통한 결과값을 활용해 학습 효율에 대한 분석을 정교화하고, 보다 세분화된 학습 전략을 제공할 수 있다. 또한, 메타버스 내 게임요소와 커뮤니티 요소를 도입하여 학습의욕을 고취하고, 스터디 그룹을 만들거나 학습기 록 퀘스트를 통해 공부습관을 즐겁게 형성할 수 있도록 한다. 또한, 실시예에서는 학습 리워드를 이용해 아바타를 키울 수 있도록 하고, 스터디 그룹 간의 동맹과 경쟁 또한 가능하게 함으로써, 학습 동기 부여를 향상시킬 수 있다. 또한, 입시와 취업 준비를 위한 멘토를 섭외해 비대면 튜터링 서비스를 제공하여 더욱 정교화된 학습 설계를 제 공하고, 학습자의 동기부여를 극대화하는 효과를 창출할 수 있도록 한다. 실시예를 통해, 핸드폰과 이어폰만 있다면 메타버스 스터디룸 안에서 공부에 집중할 수 있는 환경을 만들어 교 육격차를 줄일 수 있도록 한다. 또한, 코로나의 영향으로 교사의 대면 감독 및 지도가 약화되고 동료들이 없어 지면서 비대면으로 어떻게 더 효율적으로 학습을 가능하게 할 지가 중요한 요소이므로, 세계의 남녀노소에 대한 학력저하와 교육격차 문제를 해결하기 위하여 자기주도 학습능력을 함양할 수 있는 플랫폼을 제공할 수 있도록 한다. 또한, 실시예에서는 학습자별 맞춤형 학습 전략 생성에 최적화된 맞춤형 트레이닝 데이터 셋(Training Data Set)을 기반으로 딥러닝 뉴럴 네트워크에 기초한 기계학습을 수행하여 학습 전략 분석 모델을 구현함으로써, 학 습 전략 분석 모델로부터 산출되는 학습 전략 산출 결과의 품질을 보다 향상시킬 수 있다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 도면부호는 동일 구성 요소를 지칭한다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템 구성을 나타낸 도면이다. 도 1을 참조하면, 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템은 학습자 단말 및 서버를 포함하여 구성될 수 있다. 학습자 단말은 학습시간, 웹캠을 통해 수집한 학습자의 이미지, 학습자 생체정보, 나이, 학년, 평가 결과, 설문답변을 포함하는 학습자 데이터를 수집한다. 서버은 학습자 데이터를 분석하여 분석 결과에 따른 학습 자별 최적 학습 전략을 생성하고, 도서관, 독서실, 회의실을 포함하는 메타버스 상의 학습환경을 생성하여, 학 습자 단말로 제공한다. 실시예에서는 학습자 단말을 통해 백색소음, 카페, 바닷가 등의 ASMR(Autonomous Sensory Meridian Response) 과 같은 청각 에셋(Assets)을 제공하고, 바다, 카페 등 특정 장소의 향과 같은 후 각 에셋을 제공할 수 있다. 실시예에서, 적어도 하나의 학습자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴 퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 구매자 단말은, 네트워크를 통 해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 학습자 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 태블릿 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템 및 방법은 메타버스 속 다양한 형태의 학습환경, 스터 디 룸과 인공지능 봇 및 스터디 플래너를 제공한다. 또한, 실시예에서는 사용자 간 효율적인 소통과 학습의욕 고취할 수 있도록 3차원 메타버스 상의 학습 공간을 구현하고, 인공지능을 이용한 컴퓨터 비전 및 추천 기술을 활용하여 자기주도 학습 촉진시킬 수 있도록 한다. 실시예에서는 학습자의 선호도에 따라 홀로 공부할 수 있는 독서실은 물론 친구들과 함께 공부할 수 있는 스터 디룸, 도서관, 스터디 카페 등 다양한 학습환경을 3차원의 다양한 메타버스 형태로 생성한다. 실시예에서는 학 습 환경 별로 백색소음, 카페 앰비언스(Ambience) 사운드, 도서관 앰비언스 사운드 등을 제공하여 학습자가 원 하는 생생한 학습 환경에 몰입할 수 있도록 한다. 실시예에서는 캠스터디를 하는 경우 학습자의 영상 및 이미지 데이터를 프레임 단위로 분석할 수 있도록 데이터 셋을 구축하고, 학습자의 학습 여부를 확인할 수 있는 인공지능 알고리즘을 제공한다. 아울러, 학습자 별 누적 데이터 분석으로 최적 학습 전략을 생성하여 학습자 각각에게 맞춤형 학습전략을 제안 하고, 메타버스 내에서 퀘스트 달성에 따른 리워드 제공(Learn-To-Earn)과 같은 게임요소와 커뮤니티 요소를 제 공한다. 또한, 실시예에서는 입시와 취업 준비를 위한 멘토를 선정하여 메타버스를 이용한 비대면 튜터링 서비스를 제공 한다. 또한, 실시예에서는 학습자 별 맞춤형 학습 전략 파악에 최적화된 맞춤형 트레이닝 데이터 셋(Training Data Set)을 기반으로 딥러닝 뉴럴 네트워크에 기초한 기계학습을 수행하여 최적 학습 전략 산출 모델을 구현한다. 도 2는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면이다. 도 2를 참조하면, 실시예에 따른 서버는 데이터 수집 모듈, 학습환경 생성 모듈, 이미지 분석 모듈, 학습 데이터 분석 모듈, 학습 전략 생성 모듈, 리워드 관리 모듈 및 그룹 설정 모듈 을 포함하여 구성될 수 있다. 본 명세서에서 사용되는 '모듈' 이라는 용어는 용어가 사용된 문맥에 따라서, 소프트웨어, 하드웨어 또는 그 조합을 포함할 수 있는 것으로 해석되어야 한다. 예를 들어, 소프트웨어 는 기계어, 펌웨어(firmware), 임베디드코드(embedded code), 및 애플리케이션 소프트웨어일 수 있다. 또 다른예로, 하드웨어는 회로, 프로세서, 컴퓨터, 집적 회로, 집적 회로 코어, 센서, 멤스(MEMS; Micro-Electro- Mechanical System), 수동 디바이스, 또는 그 조합일 수 있다. 데이터 수집 모듈은 웹캠을 통해 학습자의 이미지, 생체정보, 개인정보, 평가결과, 설문답변을 포함하는 학습자 데이터 및 학습 환경 별 앰비언스 데이터를 수집한다. 실시예에서 앰비언스 데이터는 학습 환경에 따라 달라지는 주변 소음과 사운드 정보로서, 실시예에서는 앰비언스 데이터를 통해 학습 환경의 분위기를 제공할 수 있다. 실시예에서 학습자의 생체정보는 학습자의 심박수, 체온, 혈압, 동공크기, 움직임 여부 등의 생체정보를 포함할 수 있다. 학습환경 생성 모듈은 도서관, 독서실, 스터디 카페, 회의실, 강의실을 포함하는 학습 환경을 2차원 또는 3차원 객체로 구현하고, 구현된 학습환경에 해당하는 앰비언스를 출력한다. 이미지 분석모듈은 공부중인 학습자를 모니터링하는 웹캠스터디를 수행하는 경우, 카메라를 통해 수집된 학습자의 학습 이미지를 분석하여, 학습자의 실제 학습 시간 및 집중도를 파악한다. 실시예에서 이미지 분석 모 듈은 학습자의 얼굴, 신체 움직임 및 척추 측만증 정도를 포함하는 집중도 평가 지표를 측정하여, 측정된 집중도 평가 지표를 통해 학습자 별 집중도를 산출한다. 학습 데이터 분석 모듈은 학습자 데이터를 분석하여, 기간별, 장소 별, 과목별 학습시간, 성적 변화 등을 포함하는 1차 분석 데이터를 생성한다. 실시예에서 학습 데이터 분석 모듈은 2차 분석 데이터를 생성할 수 있다. 실시예에서 2차 분석 데이터는 수집한 데이터를 인공지능으로 가공한 데이터로서, 취약점 분석, 학습 자 세 및 태도 변화, 집중하여 학습한 시간, 학습 정답률 및 달성률 분석 그래프이 2차 분석 데이터에 포함될 수 있다. 학습 전략 생성 모듈은 생성된 1차 분석 데이터를 기반으로 학습자 단말로부터 기간별 목표 정보를 입력 받아, 학습자가 입력한 학습 목표를 해당 기간에 달성하기 위한 학습전략을 생성한다. 실시예에서 학습 전략 생성 모듈은 학습자의 학습패턴을 분석하여 성적이 낮은 과목, 학습자가 일정횟수 이상 실수하는 취약 파트를 파악하고, 취약 파트 정보를 제공하고, 취약 파트의 성적을 일정 비율 이상 향상시 키기 위한 맞춤형 솔루션을 제공한다. 또한, 메타버스 상에서 전문가가 실시간으로 학습자의 질문에 대한 답변 을 제공할 수 있다. 실시예에서 학습 전략 생성 모듈은 최적 학습 전략 생성을 위해, 자습 진행 상황을 인공지능을 통하여 기 록하고 분석하는 플래너 및 다이어리를 제공한다. 구체적으로, 학습에 따른 데이터를 인공지능 학습분석 코칭 봇이 분석하여 제공하며, 학습자의 데이터를 바탕으로 어떤 과목을 얼마나 공부해야 할 지 중 단기 학습계획을 제공할 수 있다. 또한, 실시예에서는 학습자 본인의 학습 패턴 그리고 다른 학습자의 학습 패턴을 적용하여 더 나은 학습 전략을 제공하고, 한달에 일정횟수(예컨대, 20번) 이상 꾸준하게 학습할 경우 퀘스트를 제공하는 등 학습자의 학습 패턴을 분석하여 학습 의욕을 고취시킬 수 있다. 예컨대, 학습자가 공간에 접속하여 '수학 문제 집을 2시간 동안 5장 풀겠다', '70%의 정답률을 달성하겠다' 등의 학습 목표와 계획을 설정 후 학습을 시작하여 학습을 마치면 해당 학습에 대한 목표 달성률을 입한다. 이후, 인공지능 코칭봇이 해당 데이터들과 그동안의 누 적 데이터, 타 유저의 누적데이터 등을 종합적으로 분석하여 인공지능 최적화 학습 계획을 제공할 수 있다. 실 시예에서 '학습자가 부족한 과목' 은 '정답률이 낮은 과목'을 의미하며, '특히 집중해야 하는 과목'은 '학습자 가 자주 학습하는 과목'을 의미한다. 예컨대, 학습자가 수학 문제집을 2시간 동안 5장 풀겠다는 목표를 5일동안 수행했으며 5일 평균 달성률이 80% 정답률이 60%라면 6일째 학습자가 같은 목표를 수행하고자 했을 때 인공지능이 1.5시간동안 3.5장을 풀고 30분 동안 오답노트와 복습을 하도록 새로운 플랜을 제공하고, 새로운 플랜을 통해 학습자는 더 높은 목표 달성률과 정답률를 성취할 수 있도록 한다. 리워드 관리 모듈은 학습자 별 누적 접속시간, 집중도가 일정 수준 이상인 실제 공부 시간, 접속 빈도 및 목표 달성률을 포함하는 학습자의 과정 지표와 학습자의 테스트 결과 및 시험 결과를 포함하는 학습 성취도 지 표에 따라 학습자별 리워드를 산출하고, 학습자에게 제공되는 리워드를 통해 메타버스 공간 내에서 아이템 구매, 아바타 육성을 가능하게 한다. 또한, 실시예에서는 리워드 관리 모듈을 통해, 스터디 그룹을 설정하 여 설정된 그룹 간 리워드 또는 학업 성취도 경쟁을 가능하게 한다. 실시예에서 리워드 관리 모듈은 학습 효율 증가율, 목표 달성율, 학습속도를 포함하는 학습 과정 평가 요 소를 학습자 별로 파악하여 학습자 간의 랭킹 정보를 생성하고, 인공지능이 제공하는 학습 플랜 성취도에 따라학습자에게 추가 리워드를 제공할 수 있다. 실시예에서는 인공지능이 제공하는 학습 플랜을 잘 따를 수록 더 많은 포인트를 학습자에게 제공하고, 해당 포 인트는 메타버스 공간 내에서 아이템 구매로 이용 가능하다. 아이템은 상점 내에서 제공하는 것으로 새로운 공 간, 아바타 꾸미기, 태블릿용 노트 서식, 다이어리, 스티커 이미지를 포함하는 학습도구 등을 의미한다. 도 3은 실시예에 따른 인공지능을 활용한 학습관리 시스템의 이미지 분석 과정을 설명하기 위한 도면이다. 실시예에서는 웹캠 등의 온라인 학습을 하는 학습자들의 집중도를 평가하는 객관적인 지표를 제시한다. 이를 위 해, 실시예에서는 컴퓨터비전 라이브러리를 이용해 학습자 자세의 위치 데이터를 수집하고, 외부 서버로부터 수 집한 교육학 이론에 따라 정면 얼굴, 신체 움직임, 그리고 척추 측만 가능성의 총 세 가지요소를 측정한다. 일 반적으로 학생들은 수업에 집중할 때 두드러지는 움직임 없이 화면을 바라보며 바르게 앉은 자세를 취한다. 이 를 전제로, 학습자의 얼굴과 척추 위치 데이터를 계산하여 얻은 세 가지 측정 요소는 집중도를 결정하는 요인이 될 수 있다. 실시예에서는 해당 프레임워크를 구현하기 위해 사용자 연구를 진행하였고 총 7.3GB 크기의 테스트 데이터셋을 수집하였다. 각 데이터들은 학습자들의 자가 진단에 따라 집중도가 표시되어 있다. 그 결과 집중도 가 높은 그룹은 낮은 그룹에 비해 정면 얼굴이 더욱 많은 비율로 감지되고, 몸의 움직임이 적으며, 척추 측만증 의 가능성이 낮은 것으로 파악되었다. 제안한 세 가지 측정 요소는 집중도가 높은 그룹과 낮은 두 그룹 간의 분 명한 차이를 보이며, 하나의 메트릭으로 집계하였을 때 서로의 직교성과 보완성을 증명한다. 결과적으로, 실시 예에서는 얼굴, 신체 움직임, 그리고 척추 측만증 가능성을 포함하는 집중도 평가 요소를 측정하여, 온라인 학 습에 참여하는 학습자의 집중도를 자동적으로 평가할 수 있다. 또한, 실시예에서는 인공지능 머신러닝을 통한 이미지 인식(image recognition)과정을 통해 학습자 이미지의 표 준 측면 사진 및 일러스트를 기준으로 이미지를 분석하여 학습자의 집중도를 최종 확정할 수 있다. 인공지능 이 미지 인식은 기계가 마치 사람처럼 사진으로부터 사물을 인식하고 장면을 이해하는 것으로, 컴퓨터 비전 기술 중 하나에 해당한다. 실시예에서는 이미지 인식을 위해, 이미지에 포함된 학습자 개체 분류(classification), 검출(detection) 및 개체를 픽셀 단위로 식별하여 분할(segmentation)하는 데이터 처리 과정을 수행한다. 실시 예에서 이미지 분석 모듈은 노이즈 대응 외 학습하지 못한 패턴 처리를 위해 학습 외 분포 데이터 탐지 (out of distribution detection)과정을 수행한다. 학습 외 분포 데이터 탐지는 인공지능에 입력된 이미지가 학 습된 확률분포 데이터 인지 아닌지 식별하는 것이다. 실시예에서는 학습 외 분포 데이터 탐지를 통해 인공 신경 망이 판단하기 어려운 이미지를 걸러내거나 예외 처리하여 안정성과 신뢰성을 높일 수 있도록 한다. 실시예에서 는 학습 외 분포 데이터 탐지를 위해서 딥러닝 판정에 대해 얼마나 확신(confidence)하는지를 나타내는 확률 값 을 보정(calibration)하거나 학습 외 분포 데이터를 생성적 대립 신경망(GAN, Generative Adversarial Network)으로 생성하고 학습하여 탐지 정확도를 향상시킬 수 있도록 한다. 또한, 실시예에서는 이미지 인식 정확도를 유지하면서 모델의 크기를 줄이기 위해, 연산을 간소화하는 경량 딥 러닝 기술을 이용하여 데이터 분석을 수행하여 학습자 집중도를 확정할 수 있도록 한다. 실시예에서는 이미지 인식을 위해 콘볼루션 신경망(CNN, Convolution Neural Network)에서 콘볼루션 필터를 변형하여 연산 차원을 축 소(Reduction)하거나 큰 영향이 없는 신경망의 가중치(weight)를 삭제하는 가지치기, 가중치 값의 부동 소수점 을 줄여 연산을 간소화하는 양자화 과정을 수행하여 데이터 경량화를 가능하도록 한다. 또한, 실시예에서는 미 리 학습시킨 큰 신경망의 출력을 작은 신경망에서 모방 학습하도록 하여 연산을 간소화하며 정확도를 유지할 수 있도록 한다. 도 4는 실시예에서 제공하는 메타버스 상 학습 환경 인터페이스를 나타낸 도면이다. 도 4를 참조하면, 도서관, 독서실, 스터디 카페, 강의실, 회의실 등 다양한 앰비언스의 메타버스 상 학습환경을 생성할 수 있다. 실시예에서는 메타버스 공간을 기반으로 자기주도적 학습 촉진 및 맞춤형 동기부여 서비스를 제공하고, 전세계 학습자 모두를 위한 자기주도 학습 강화 플랫폼을 제공한다. 실시예에서는 도 4에 도시된 바와 같이, 메타버스 상 다양한 형태의 스터디 룸과 학습환경을 제공하고, 인공지능 봇 스터디 플래너, 다이어리와 같은 학습 보조 기능을 제공한다. 또한, 다양한 인공지능 기술에 기반한 웹캠 스터디 기능을 제공하고, 게이미피케이션을 통해 학습에 대한 동기 부여와 재미 요소를 제공할 수 있다. 또한, 실시예에서는 취업 멘토 및 입시 코디 등의 밀착 코칭을 위한 이용권을 별도로 제공할 할 수 있다. 아울 러, 학습자 별 학습 성취율에 따라 이벤트 상품을 결합한 유료 게임 컨텐츠, 메타버스 공간 내에 광고 기능 등 을 제공할 수 있다. 도 5는 실시예에 따른 인공지능을 통한 학습 관리 시스템의 대시보드 예를 나타낸 도면이다. 도 5를 참조하면, 실시예에서는 학습자 각각의 학습 데이터 분석 결과와, 학습 전략을 대시 보드에서 제공할 수 있다. 실시예에서는 인공지능 대시보드를 통해, 학습자의 학습 총량, 매일 학습량의 변화, 다른 학습자들과의 학습 시간, 평가 비교 결과 등을 그래프, 아이콘 등으로 변환하여, 사용자가 자신의 학습 데이터를 보다 직관적 으로 확인할 수 있도록 한다. 특히, 실시예에서는 학습자의 매일의 학습량과 타 학습자의 평균 학습량을 비교한 그래프를 제공함으로써, 학습자의 학습 시간을 객관적으로 평가하고, 학습자의 학습 동기부여를 향상시킬 수 있 도록 한다. 이하에서는 인공지능을 통한 맞춤형 학습 관리 방법에 대해서 차례로 설명한다. 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 방법의 작용(기능)은 위조품 탐지 시스템의 기능과 본질적으로 같은 것이므로 도 1 내지 도 5 와 중복되는 설명은 생략하도록 한다. 도 6은 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템의 신호 흐름도이다. 도 6을 참조하면, S100 단계에서는 서버에서 앰비언스 데이터와 2차원 또는 3차원 객체 생성 이미지를 수집하여 메타버스 상의 학습 환경을 생성하고 학습자 단말로 전송하여, 학습자 단말에서 학습자가 원하는 학습환경 및 해당 학습환경의 앰비언스가 출력 될 수 있도록 한다. 실시예에서 학습환경은 독서실, 도서관, 스터디 카페, 회 의실, 강의실 등 다양한 학습공간을 포함할 수 있다. S200 단계에서는 학습자 단말에서 다양한 학습자 데이터를 수집한다. 실시예에서 학습자 데이터는, 나이, 성별, 학년 등 학습자의 개인정보, 학습자의 하루 공부시간, 취 약과목, 시험 결과, 현재 성적 등을 포함하는 학습 정보 및 웹캠을 통해 수집한 학습자 이미지 정보 등을 포함 할 수 있다. S300 단계에서는 서버에서 학습 데이터분석을 통해 학습자 별 맞춤형 학습 전략을 생성하고, 생성 된 학습 전략 정보를 학습자 단말로 제공한다. S400 단계에서는 학습자 단말을 통해 학습자가 공부하기 위해 접 속하면, S500 단계에서는 해당 학습자 단말의 접속을 인식하고 접속을 카운팅한다. 또한, 접속 카운팅 및 실제 학습 시간과 집중도에 따라 학습자에게 리워드를 제공한다. 도 7은 실시예에 따른 서버의 데이터 처리 과정을 나타낸 도면이다. 도 7을 참조하면, S110 단계에서는 데이터 수집 모듈에서 학습자의 자세, 생체정보, 개인정보, 평가결과, 설문 답변을 포함하는 학습자 데이터 및 학습 환경 별 앰비언스 데이터를 수집한다. 실시예에서 앰비언스 데이터는 학습 환경에 따라 달라지는 주변 소음과 사운드 정보로서, 실시예에서는 앰비언스 데이터를 통해 학습 환경의 분위기를 제공할 수 있다. S120 단계에서는 학습환경 생성 모듈에서 도서관, 독서실, 스터디 카페, 회의실, 강의실을 포함하는 학습 환경 을 3차원 객체로 구현하고, 구현된 학습환경에 해당하는 앰비언스를 출력한다. S130 단계에서는 이미지 분석 모듈에서 공부중인 학습자를 모니터링하는 웹캠스터디를 수행하는 경우, 카메라를 통해 수집된 학습자의 학습 이미지를 분석하여, 학습자의 실제 학습 시간 및 집중도를 파악한다. 실시예에서는 학습자의 얼굴, 신체 움직임 및 척추 측만증 정도를 포함하는 집중도 평가 지표를 측정하여, 측정된 집중도 평 가 지표를 통해 학습자 별 집중도를 산출한다. 실시예에서는 웹캠 등의 온라인 학습을 하는 학습자들의 집중도 를 평가하는 객관적인 지표를 제시한다. 이를 위해, 실시예에서는 컴퓨터비전 라이브러리를 이용해 학습자 자세 의 위치 데이터를 수집하고, 외부 서버로부터 수집한 교육학 이론에 따라 정면 얼굴, 신체 움직임, 그리고 척추 측만 가능성의 총 세 가지요소를 측정한다. 일반적으로 학생들은 수업에 집중할 때 두드러지는 움직임 없이 화 면을 바라보며 바르게 앉은 자세를 취한다. 이를 전제로, 학습자의 얼굴과 척추 위치 데이터를 계산하여 얻은 세 가지 측정 요소는 집중도를 결정한다. 실시예에서는 얼굴, 신체 움직임, 그리고 척추 측만증 가능성을 포함 하는 집중도 평가 요소를 측정하여, 온라인 학습에 참여하는 학습자의 집중도를 자동적으로 평가할 수 있다. S140 단계에서는 학습 데이터 분석 모듈에서 학습자 데이터를 분석하여, 기간별, 장소 별, 과목별 학습시간, 성 적 변화 등을 포함하는 1차 분석 데이터를 생성한다. 또한, S140 단계에서는 2차 분석 데이터를 생성할 수 있다. 실시예에서 2차 분석 데이터는 수집한 데이터를 인공지능으로 가공한 데이터로서, 취약점 분석, 학습 자 세 및 태도 변화, 집중하여 학습한 시간, 학습 정답률 및 달성률 분석 그래프이 2차 분석 데이터에 포함될 수 있다. S150 단계에서는 학습 전략 생성 모듈에서 생성된 1차 분석 데이터를 기반으로 학습자 단말로부터 기간별 목표 정보를 입력 받아, 목표를 해당 기간에 달성하기 위한 학습전략을 생성한다. 실시예에서는 학습자의 학습패턴을 분석하여 성적이 낮은 과목, 학습자가 일정횟수 이상 실수하는 취약 파트를 파악하고, 취약 파트 정보를 제공하고, 취약 파트의 성적을 일정 비율 이상 향상시키기 위한 맞춤형 솔루션을 제공한다. 또한, 메타버스 상에서 전 문가가 실시간으로 학습자의 질문에 대한 답변을 제공할 수 있다. S160 단계에서는 리워드 관리 모듈에서 학습자 별 누적 접속시간, 집중도가 일정 수준 이상인 실제 공부 시간, 접속 빈도 및 목표 달성률을 포함하는 학습자의 과정 지표와 학습자의 테스트 결과 및 시험 결과를 포함하는 학 습 성취도 지표에 따라 학습자별 리워드를 산출하고, 학습자에게 제공되는 리워드를 통해 메타버스 공간 내에서 아이템 구매, 아바타 육성을 가능하게 한다. 또한, 실시예에서는 학습 효율 증가율, 목표 달성율, 학습속도를 포함하는 학습 과정 평가 요소를 학습자 별로 파악하여 학습자 간의 랭킹 정보를 생성하고, 인공지능이 제공하 는 학습 플랜 성취도에 따라 학습자에게 추가 리워드를 제공할 수 있다. 또한, 실시예에서는 S170 단계에서 스 터디 그룹을 설정하여 설정된 그룹 간 리워드 또는 학업 성취도 경쟁을 가능하게 한다. 실시예에서 S150 단계에서는 최적 학습 전략 생성을 위해, 자습 진행 상황을 인공지능을 통하여 기록하고 분석 하는 플래너 및 다이어리를 제공한다. 구체적으로, 학습에 따른 데이터를 인공지능 학습분석 코칭 봇이 분석하 여 제공하며, 학습자의 데이터를 바탕으로 어떤 과목을 얼마나 공부해야 할 지 중 단기 학습계획을 제공할 수 있다. 또한, 실시예에서는 학습자 본인의 학습 패턴 그리고 다른 학습자의 학습 패턴을 적용하여 더 나은 학습 전략을 제공하고, 한달에 일정횟수(예컨대, 20번) 이상 꾸준하게 학습할 경우 퀘스트를 제공하는 등 학습자의 학습 패턴을 분석하여 학습 의욕을 고취시킬 수 있다. 예컨대, 학습자가 공간에 접속하여 '수학 문제집을 2시간 동안 5장 풀겠다', '70%의 정답률을 달성하겠다' 등의 학습 목표와 계획을 설정 후 학습을 시작하여 학습을 마 치면 해당 학습에 대한 목표 달성률을 입한다. 이후, 인공지능 코칭봇이 해당 데이터들과 그동안의 누적 데이터, 타 유저의 누적데이터 등을 종합적으로 분석하여 인공지능 최적화 학습 계획을 제공할 수 있다. 실시예 에서 '학습자가 부족한 과목' 은 '정답률이 낮은 과목'을 의미하며, '특히 집중해야 하는 과목'은 '학습자가 자 주 학습하는 과목'을 의미한다. 예컨대, 학습자가 수학 문제집을 2시간 동안 5장 풀겠다는 목표를 5일동안 수행했으며 5일 평균 달성률이 80% 정답률이 60%라면 6일째 학습자가 같은 목표를 수행하고자 했을 때 인공지능이 1.5시간동안 3.5장을 풀고 30분 동안 오답노트와 복습을 하도록 새로운 플랜을 제공하고, 새로운 플랜을 통해 학습자는 더 높은 목표 달성률과 정답률를 성취할 수 있도록 한다. 도 8 및 도 9는 실시예에 따른 학습자 단말에서의 학습관리 시스템 실행 과정을 나타낸 도면이다. 도 8및 도 9를 참조하면, S10 단계에서 학습자 단말로 앱을 실행하면 S11 단계에서 학습관리 시스템에 로그인 하게 된다. 학습자는 일회용 로그인(S12), 또는 메타버스 공간 탐색(S13) 중 하나를 선택하여 로그인 할 수 있 다. 로그인 이후 S15 단계에서 학습자는 아바타를 설정하고 S16 단계에서는 학습목표 및 학습계획을 설정여부를 확인한다. 학습목표 및 학습계획을 설정하지 않는 경우 S17 단계로 진입하여 이전 학습목표를 이어가고, 학습목 표와 학습 계획을 설정하는 경우, S18 단계로 진입하여 새로운 학습 목표를 설정한다. S19 단계에서는 새로 입 력한 학습 목표에 대해 인공지능 기반의 최적화 학습 계획을 제공한다. S20 단계에서는 다른 페이지로 이동하여, S21 단계에서 다른 사용자와 접촉 여부를 결정한다. 다른 사용자와 접촉을 차단하는 경우, S25 단계 로 진입하여 공부 공간을 선택하고, 다른 사용자와 접촉을 허용하는 경우, S22 단계에서 대화 기능 등의 세부 기능 설정을 수행한다. S25 단계에서는 공부 공간을 선택하고, S26 단계에서는 휴식공간을 선택한다. 실시예에서 공부 공간은 오픈형 책상, 1인용 독서실 책상, 스터디룸 등을 포함할 수 있고, 휴식공간은 카페, 커뮤니티, 조용한 공간 등을 포함 할 수 있다. S27 단계에서는 공부 공간에 웹캠, 타이머, 오디오 기능을 설정하고 S28 단계에서는 공부를 시작한다. S29 단계 에서는 공부 종료 버튼 터치 여부를 파악한다. 공부 종료 버튼이 터치된 경우, S30 단계로 진입하고, 공부 종료 버튼이 터치 되지 않은 경우 S31 단계로 진입한다. 공부 종료 후에는 S32 단계로 진입하여 학습자 데이터를 인 공지능 백엔드 서버에서 업데이트 한다. 이를 위해 S33 단계에서는 학습 분석 코칭봇 기록 확인 후 S34 단계에서 코칭봇 기록을 저장여부를 확인한다. 저장하는 경우, S35 단계에서는 저장 후 인공지능 모델을 업데이트 하고 저장하지 않는 경우, S36 단계로 진입 해 기록을 삭제한다. 공부 종료 후 S37 단계로 진입하여 학습 데이터를 저장하고 S38 단계에서는 저장된 데이터의 인공지능 학습을 시작한다. S39 단계에서는 학습 후 데이터를 저장하고, S40 단계에서는 저장된 데이터를 인공지능 학습분석 코 칭봇에 적용시킨다.S41 단계에서는 휴식공간의 웹캠, 타이머, 오디오 등을 저장하고 S42 단계에서 휴식을 시작한다. S43 단계에서 는 휴식 종료 버튼 터치 여부를 확인한다. 휴식 종료 버튼이 터치된 경우, S44 단계로 진입하여 공부 장소로 이 동하는 것을 확인하고, 휴식 종료 버튼이 터치 되지 않은 경우, S45 단계로 진입하여 계속 휴식하도록 한다. S44 단계에서는 공부 장소를 확인한다. 기존 공부장소로 이동하는 경우 S46 단계로 진입하고, 메타버스 내 다른 공부 공간을 탐색하는 경우 S47 단계로 진입한다. 이상에서와 같은 인공지능을 통한 맞춤형 학습 관리 시스템 및 방법은 독서실, 회의실, 스터디 카페, 도서관 등 학습자가 원하는 다양한 학습환경을 메타버스를 통해 생생하게 구현하여, 학습자가 원하는 학습 환경에서 공부 에 더욱 몰입할 수 있도록 한다. 또한, 실시예에서는 인공지능 머신러닝을 통해 누적된 모션, 자세, 학습 누적 시간 등을 포함하는 학습자 데이터를 시간, 환경, 다른 학습자와의 비교 등 다양한 관점으로 분석하고 분석을 통한 결과값을 활용해 학습 효율에 대한 분석을 정교화하고, 보다 세분화된 학습 전략을 제공할 수 있다. 또한, 메타버스 내 게임요소와 커뮤니티 요소를 도입하여 학습의욕을 고취하고, 스터디 그룹을 만들거나 학습기 록 퀘스트를 통해 공부습관을 즐겁게 형성할 수 있도록 한다. 또한, 실시예에서는 학습 리워드를 이용해 아바타 를 키울 수 있도록 하고, 스터디 그룹 간의 동맹과 경쟁 또한 가능하게 함으로써, 학습 동기 부여를 향상시킬 수 있다. 또한, 입시와 취업 준비를 위한 멘토를 섭외해 비대면 튜터링 서비스를 제공하여 더욱 정교화된 학습 설계를 제공하고, 학습자의 동기부여를 극대화하는 효과를 창출할 수 있도록 한다. 실시예를 통해, 핸드폰과 이어폰만 있다면 메타버스 스터디룸 안에서 공부에 집중할 수 있는 환경을 만들어 교 육격차를 줄일 수 있도록 한다. 또한, 코로나의 영향으로 교사의 대면 감독 및 지도가 약화되고 동료들이 없어 지면서 비대면으로 어떻게 더 효율적으로 학습을 가능하게 할 지가 중요한 요소이므로, 세계의 남녀노소에 대한 학력저하와 교육격차 문제를 해결하기 위하여 자기주도 학습능력을 함양할 수 있는 플랫폼을 제공할 수 있도록 한다. 또한, 실시예에서는 학습자별 맞춤형 학습 전략 생성에 최적화된 맞춤형 트레이닝 데이터 셋(Training Data Set)을 기반으로 딥러닝 뉴럴 네트워크에 기초한 기계학습을 수행하여 학습 전략 분석 모델을 구현함으로 써, 학습 전략 분석 모델로부터 산출되는 학습 전략 산출 결과의 품질을 보다 향상시킬 수 있다."}
{"patent_id": "10-2022-0121952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "개시된 내용은 예시에 불과하며, 특허청구범위에서 청구하는 청구의 요지를 벗어나지 않고 당해 기술분야에서 통상의 지식을 가진 자에 의하여 다양하게 변경 실시될 수 있으므로, 개시된 내용의 보호범위는 상술한 특정의 실시예에 한정되지 않는다."}
{"patent_id": "10-2022-0121952", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템 구성을 나타낸 도면 도 2는 실시예에 따른 서버의 데이터 처리 구성을 나타낸 도면 도 3은 실시예에 따른 인공지능을 활용한 학습관리 시스템의 이미지 분석 과정을 설명하기 위한 도면 도 4는 실시예에서 제공하는 메타버스 상 학습 환경 인터페이스를 나타낸 도면 도 5는 실시예에 따른 인공지능을 통한 학습 관리 시스템의 대시보드 예를 나타낸 도면 도 6은 실시예에 따른 인공지능을 통한 맞춤형 학습 관리 시스템의 신호 흐름도 도 7은 실시예에 따른 서버의 데이터 처리 과정을 나타낸 도면 도 8 및 도 9는 실시예에 따른 학습자 단말에서의 학습관리 시스템 실행 과정을 나타낸 도면"}
