{"patent_id": "10-2021-0024105", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0120249", "출원번호": "10-2021-0024105", "발명의 명칭": "페르소나 기반의 리뷰 데이터 분석 방법 및 시스템", "출원인": "주식회사 아이디이노랩", "발명자": "안진호"}}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "특정 서비스와 관련된 리뷰 데이터를 수집하는 단계;상기 리뷰 데이터를 구성하는 단위 요소에 근거하여, 평가 인자에 해당하는 정보를 상기 리뷰 데이터로부터 추출하는 단계;상기 평가 인자를 근거로 페르소나 유형들이 분류된 페르소나 DB를 이용하여, 상기 추출된 정보에 대응하는 상기 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중 어느 하나로 특정하는 단계; 및상기 페르소나 DB로부터 상기 어느 하나의 페르소나 유형의 특성 정보를 추출하여, 상기 리뷰 데이터의 고객 유형에 대한 보고서를 생성하는 단계를 포함하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 고객 유형을 특정하는 단계에서는,상기 추출된 정보를 이용하여 상기 리뷰 데이터의 고객 유형이 블랙 컨슈머에 해당하는지 판단하는 것을 특징으로 하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 고객 유형에 대한 보고서는,상기 블랙 컨슈머에 대한 예측 정보를 포함하는 것을 특징으로 하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 페르소나 DB에는,상기 페르소나 유형들에 대한 표준화된 값과 상기 페르소나 유형들의 특성 정보가 저장되는 것을 특징으로 하는페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 리뷰 데이터를 분석하여, 상기 리뷰 데이터에 해당하는 고객의 만족도를 평가하는 단계를 더 포함하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 만족도를 이용하여 상기 리뷰 데이터의 고객 유형에 대한 대응 전략을 제시하는 단계를 더 포함하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 보고서를 생성하는 단계는,공개특허 10-2022-0120249-3-상기 페르소나 유형들에 따라 상기 보고서를 생성하는 시점 기준을 서로 다르게 설정하는 것을 특징으로 하는페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,기계학습에 의하여 생성된 인공지능 모델을 기반으로 상기 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중어느 하나로 특정하는 단계를 더 포함하는 하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 보고서를 생성하는 단계는,상기 리뷰 데이터를 분석하여, 상기 특정 서비스와 관련된 서로 다른 복수의 서비스 요소 중 상기 리뷰 데이터에 대응되는 적어도 하나의 서비스 요소를 특정하는 단계;상기 특정된 적어도 하나의 서비스 요소에 대해 상기 특정 서비스를 설명하는 설명 정보를 추출하는 단계; 및상기 특정된 고객 유형 및 상기 추출된 설명 정보를 이용하여, 상기 특정 서비스에 대한 상기 페르소나에 대응되는 고객 그룹의 평가 보고서를 생성하는 단계를 포함하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "특정 서비스와 관련된 리뷰 데이터를 수집하는 단계;상기 리뷰 데이터를 구성하는 단위 요소에 근거하여, 제1정보 및 제2정보 중 적어도 하나를 상기 리뷰 데이터로부터 추출하는 단계;상기 제1정보를 페르소나 유형들이 분류된 페르소나 DB와 매칭하거나, 상기 제2정보를 고객 유형을 분석하는 인공지능 모델의 입력 데이터로 이용하여 상기 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중 어느 하나로특정하는 단계; 및상기 페르소나 DB로부터 상기 어느 하나의 페르소나 유형의 특성 정보를 추출하여, 상기 리뷰 데이터의 고객 유형에 대한 보고서를 생성하는 단계를 포함하는 페르소나 기반의 리뷰 데이터 분석 방법."}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법은 특정 서비스와 관련된 리뷰 데이터를 수집하는 단계, 상기 리뷰 데이터를 구성하는 단위 요소에 근거하여, 평가 인자에 해당하는 정보를 상기 리뷰 데이터로부터 추출 하는 단계, 상기 평가 인자를 근거로 페르소나 유형들이 분류된 페르소나 DB를 이용하여, 상기 추출된 정보에 대 응하는 상기 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중 어느 하나로 특정하는 단계 및 상기 페르소나 DB로부터 상기 어느 하나의 페르소나 유형의 특성 정보를 추출하여, 상기 리뷰 데이터의 고객 유형에 대한 보고 서를 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 페르소나를 기반으로 리뷰 데이터를 분석하는 방법, 그리고 시스템에 관한 것이다."}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술이 발전함에 따라, 전자기기(예를 들어, 스마트폰, 태블릿 PC, 자동화 기기 등)의 보급이 대중화되었으며, 이에 따라 일상생활의 많은 부분에서 전자기기의 사용이 일반화되었다. 전자기기의 대중화는 자신의 생각이나 경험을 다른 사람들과 자유롭게 공유할 수 있는 서비스의 발전을 촉진시 켰다. 최근에는, 리뷰슈머(reviewsumer)라는 신조어까지 생겨났다. 리뷰슈머는 리뷰(Review)와 컨슈머 (Consumer)의 합성어로 제품을 써보고 온라인 상에 품평을 올리는 고객 집단을 말한다. 이러한 트렌드의 변화에 맞추어, 소비자 리뷰를 이용한 상품 평가 시스템 및 방법(대한민국 공개특허 제10- 2018-0080492호)은, 소비자의 구매 결정에 도움을 주기 위하여, 서비스 이용자가 부여한 평점을 소비자에게 제 공한다. 그러나, 이들은, 고객들끼리 리뷰를 공유하는 방식으로서, 여전히 고객이 작성한 리뷰를 적극적으로 활용하는"}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "방안에 대한 니즈가 존재한다,발명의 내용"}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법 및 시스템은, 고객들이 작성한 리뷰 데이터를 분석하여 사용자에게 제공하고자 한다. 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법 및 시스템은, 고객의 리뷰 데이터를 활용하고자 한다. 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법 및 시스템은, 고객군을 정립하고자 한다."}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위에서 살펴본 과제를 해결하기 위하여, 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법은 특정 서비스 와 관련된 리뷰 데이터를 수집하는 단계, 상기 리뷰 데이터를 구성하는 단위 요소에 근거하여, 평가 인자에 해 당하는 정보를 상기 리뷰 데이터로부터 추출하는 단계, 상기 평가 인자를 근거로 페르소나 유형들이 분류된 페 르소나 DB를 이용하여, 상기 추출된 정보에 대응하는 상기 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중 어느 하나로 특정하는 단계 및 상기 페르소나 DB로부터 상기 어느 하나의 페르소나 유형의 특성 정보를 추출하 여, 상기 리뷰 데이터의 고객 유형에 대한 보고서를 생성하는 단계를 포함할 수 있다. 나아가, 본 발명에 따른 페르소나 기반의 리뷰데이터 분석 방법은, 특정 서비스와 관련된 리뷰 데이터를 수집하 는 단계, 상기 리뷰 데이터를 구성하는 단위 요소에 근거하여, 제1정보 및 제2정보 중 적어도 하나를 상기 리뷰 데이터로부터 추출하는 단계, 상기 제1정보를 페르소나 유형들이 분류된 페르소나 DB와 매칭하거나, 상기 제2정 보를 고객 유형을 분석하는 인공지능 모델의 입력 데이터로 이용하여 상기 리뷰 데이터의 고객 유형을 상기 페 르소나 유형들 중 어느 하나로 특정하는 단계 및 상기 페르소나 DB로부터 상기 어느 하나의 페르소나 유형의 특 성 정보를 추출하여, 상기 리뷰 데이터의 고객 유형에 대한 보고서를 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "위에서 살펴본 것과 같이, 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법 및 시스템은, 수집된 데이터 에 근거하여, 리뷰 데이터의 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 이에 따라, 본 발명 은 특정 서비스에 대해 리뷰 데이터를 작성한 고객의 유형을 구체적으로 파악할 수 있다. 나아가, 본 발명은, 고객의 나이, 직업, 성격과 개성, 특징, 취미, 사는 곳 등 개인 정보에서부터, 실제로 이러한 인물이 서비스를 이용할 때 고려하는 점, 서비스를 이용할 때 불편한 점 등의 구체적인 니즈를 예상할 수 있다. 나아가, 본 발명은, 리뷰 데이터의 고객 유형에 대한 보고서를 생성할 수 있다. 따라서, 사용자는 본 발명으로 부터 제공받은 보고서를 통해, 블랙 컨슈머의 악의적인 리뷰 작성을 사전에 방지하고, 단골 고객을 효율적으로 관리할 수 있으며, 고객 유형에 대응하여 적합한 마케팅을 진행할 수 있다."}
{"patent_id": "10-2021-0024105", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소에는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설 명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼 용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실 시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 시스템은, “분석 시스템”이라고도 명명될 수 있다. 이러한 분석 시스템은, 사용자로부터 서비스를 제공 받은 고객이 작성한 리뷰 데이터를 분석하고, 보고서를 생성하여 사용자에게 제공하는 역할을 수행한다. 이하에서는 첨부된 도면과 함께, 본 발명에 따른 분석 시스템 및 방법에 대하여 보다 구체적으로 살펴본다. 도 1은 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 시스템을 이용한 분석 방법을 설명하기 위한 개념도이고, 도 2는 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 시스템을 설명하기 위한 개념도이고, 도 3은 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법을 설명하기 위한 흐름도이고, 도 4a 및 4b는 본 발 명에 따른 페르소나 기반의 리뷰 데이터 분석 방법을 설명하기 위한 개념도이고, 도 5는 본 발명에 따른 데이터 수집을 설명하기 위한 개념도이고, 도 6a, 도 6b, 도 7, 도 8a, 도 8b, 도 9a, 및 도 9b 는 본 발명에 따른 평 가 인자에 대응되는 정보를 설명하기 위한 개념도들이고, 도 10, 도 11, 도 12, 도 13, 및 도 14는 본 발명에 따른 리뷰 데이터의 고객 유형을 특정하는 방법을 설명하기 위한 개념도들이고, 도 15a, 도 15b, 도 15c, 도 15d 및 도 15e는 본 발명에 따른 보고서를 설명하기 위한 개념도들이다. 한편, 본 발명에서 사용자에 의해 제공되는 “서비스”는 사용자가 물질적 재화의 생산을 위하여, 고객에게 제 공하는 물질 또는 노동을 의미할 수 있다. 즉, 본 발명에서 “서비스”는, 사용자가 영위하는 사업에 따라 다양한 종류가 존재할 수 있다. 예를 들어, “ 음식점”을 운영하는 사용자라면, 서비스의 종류는, “음식”과 관련될 수 있으며, “교습소”를 운영하는 사업 자라면, 서비스의 종류는, “학문, 예술 등을 가르치는 행위”와 관련될 수 있다. 본 발명에서는 설명의 편의를 위하여, 사용자가 영위하는 사업 및 영위하는 사업에 의하여 생산되는 상품(또는 제품)을 구분하지 않고 “서비스” 로 통칭하여 명명하기로 한다. 본 발명에서 사용되는 “서비스를 제공 받다”의 의미는, 사업자가 영위하는 사업의 종류에 따른 물질 또는 노 동을 제공 받는 것을 의미할 수 있다. 예를 들어, “음식점”을 운영하는 사용자라면, “음식”을 제공 받을 수 있으며, “교습소”를 운영하는 사업자라면, “학문, 예술 등을 교습”을 제공 받을 수 있다. 본 명세서에서 “ 서비스를 제공받다”는 “서비스를 구매하다”, “서비스를 이용하다” “상품(제품 또는 물건)을 구매하다”와 혼용되어 사용될 수 있다. 본 발명에서는 이러한 서비스와 관련된 요소들을 “서비스 요소”라고 명명할 수 있다. 서비스 요소는, 사용자 가 고객에게 서비스를 제공함에 있어 고려되어야 할 다양한 사항들을 의미할 수 있다. 예를 들어, 서비스 요소 는 ⅰ)가격조건(또는 가격), ⅱ)이용품질(또는 품질), ⅲ)서비스 절차(또는 절차), ⅳ)직원대응(또는 고객 대응) 및 ⅴ)이용환경 중 적어도 하나를 포함할 수 있다. 다만, 위 나열한 사항들은 서비스 요소의 일 예시이며, 이에 한정되는 것은 아니다. 한편, 본 명세서에서는, 설명의 편의를 위하여, 사용자에게 서비스의 제공을 요청(또는 상품을 구매)하고, 서비 스(상품 또는 제품)의 제공을 받는 자를 “고객”이라고 명명하도록 한다. 고객은 “소비자” 또는 “컨슈머 (consumer)”와 혼용되어 사용될 수 있다. 본 발명에서 사용되는 “고객 유형”은 고객의 성향에 따라 고객을 구분하기 위해 사용되는 개념일 수 있다. 복 수의 고객 유형은 제1 타입 고객 및 제2 타입 고객으로 분류되어 질 수 있다. 제1 타입 고객은 특별한 주의가 필요한 타입으로서, 제공 받은 서비스에 대한 리뷰 데이터를 작성하는 것이 아 닌, 서비스의 하자를 문제 삼아 사용자(사업자 또는 기업)을 상대로 과도한 피해 보상금을 요구하거나 거짓으로 피해를 본 것으로 꾸미는 악의적인 유형을 의미할 수 있다. 본 발명에서는 리뷰 데이터 및 기 설정된 기준에 근 거하여 제1 타입 고객을 특정할 수 있다. 본 발명에서는 제1 타입 고객은 “블랙 컨슈머”와 혼용하여 사용될 수 있다. 제2 타입 고객은 제1 타입 고객을 제외한 리뷰 데이터의 고객 유형을 포함할 수 있다. 제2 타입 고객은 리뷰 데 이터 및 기 설정된 기준에 근거하여, ⅰ)일반 고객, ⅱ)단골 고객, ⅲ)우수 고객, ⅳ)불만족 고객으로 분류될 수 있다. 나아가, 본 발명에서는 제2 고객 타입으로 분류된 리뷰 데이터를, 페르소나 DB와 매칭시키거나 인공 지능 모델 에 입력하여 페르소나 유형들 중 어느 하나로 특정할 수 있다. 본 발명에서 사용되는 “페르소나 유형”은 특정 서비스를 이용할 만한 인구 집단 안에 있는 다양한 사용자를 대표하는 인물로서, 어떤 특정한 상황과 환경속에서 어떤 전형적인 인물이 어떻게 행동할 것인가에 대한 예측을 위해 실제 사용자 자료를 바탕으로 개인의 개성을 부여하여 만들어진 가상의 인물이다. 나아가, 서로 다른 복수의 페르소나 유형의 집합체를 본 발명에서는 “페르소나 DB”라고 명명하도록 한다. 페 르소나 DB에는 페르소나 유형들의 특성 정보 및 표준화된 값이 있을 수 있다. 본 발명에서 사용되는 “특성 정보”는 서로 다른 복수의 특정 페르소나 유형 각각에 매칭된 정보로서, “페르 소나 유형”의 인물을 묘사하고 그 인물의 배경, 환경, 가상의 이름, 목표, 취미, 직업, 거주지, 성격, 평소에 느끼는 생각(불편함, 호감 분야 등), 그 인물이 가지는 니즈 등으로 구성될 수 있다. 본 발명에서 사용되는 “표준화된 값”은 복수의 서로 다른 페르소나 유형들마다 각각 매칭된 값으로서, 리뷰 데이터와 페르소나 DB를 서로 매칭시킬 때 사용되는 정보이다. 예를 들어, “표준화된 값”은 특성 정보에 대한 특정 값을 포함할 수 있다. 한편, 본 발명에서 사용되는 “리뷰 데이터”는 고객의 특정 서비스에 대한 평가가 포함되는 정보를 의미할 수 있다. 리뷰 데이터는 특정 서비스가 제공(또는 구매 요청)되는 인터넷 페이지, 개인 블로그(Blog), SNS(Social Network Site), 댓글 등에 기재되는 시각적, 촉각적, 청각적 방식의 다양한 데이터를 의미할 수 있다. 시각 적 방식의 리뷰 데이터로는 텍스트(text), 이모티콘(emoticon), 이미지(image), 동영상 등이 포함될 수 있으며, 청각적 방식의 리뷰 데이터로는 음성, 동영상 등이 포함될 수 있다. 동영상은 시각적 방식의 리뷰 데이터 및 청 각적 방식의 리뷰 데이터 모두에 해당될 수 있다. 본 발명에서 “리뷰 데이터를 작성한다” 는 온라인 상에 리뷰 데이터를 업로드 한다는 의미로 이해되어 질 수 있다. 본 명세서에서, “리뷰 데이터를 작성한다”는 “리뷰 데이터를 업로드한다”, “리뷰 데이터를 게재한 다”와 혼용되어 사용될 수 있다. 본 발명에서 사용되는 “단위 요소”는 리뷰 데이터를 이루는 구성 요소로 이해되어 질 수 있다. 예를 들어, 단 위 요소는 i)텍스트(text) 데이터, ii)평점 데이터(ex: 5점 만점에 4.5 와 같은 점수, 하트 또는 별의 개수 등), iii)이미지 데이터, iv)영상 데이터 및 v)음성 데이터 중 적어도 하나를 포함할 수 있다. 본 발명에서 사용되는 “평가 인자”는 리뷰 데이터로부터 고객 유형을 특정하는데 사용되는 다양한 요소로 이 해되어 질 수 있다. 예를 들어, 평가 인자는 리뷰 데이터에 포함된, i)고객의 감정, ii)리뷰 데이터의 내용,iii)리뷰 데이터의 중요 사항(중요도), iv)고객의 연령 및 v)고객의 성별 중 적어도 하나 포함할 수 있다. 다만, 위 나열한 평가 인자는 설명의 편의를 위한 일 예시이며, 이에 한정되는 것은 아니다. 본 발명에서 사용되는 “평가 인자에 해당되는 정보”는 평가 인자를 포함하는 데이터로, i)감정 인자에 해당 되는 정보, ii)내용 인자에 해당되는 정보, iii)중요도 인자에 해당되는 정보, iv)연령 인자에 해당되는 정보, v)고객의 성별 인자에 해당되는 정보 중 적어도 하나를 포함할 수 있다. 본 발명에서 사용되는 “만족도”는 고객이, 제공받은 서비스에 어느 정도 만족하고 있는 가를 일컫는 용어로 이해되어 질 수 있다. 본 발명에서는 리뷰 데이터 및 기 설정된 기준에 근거하여 만족도를 산출할 수 있다. 예 를 들어, 리뷰 데이터가 5점 만점의 평점 데이터를 포함한다고 가정하자. 평점 데이터가 제1 기준(ex: 4점) 이 상(또는 초과)이면 만족도는 상(上), 평점 데이터가 제1 기준(ex: 4점) 미만(또는 이하)이면서 제2 기준(ex: 2 점) 이상(또는 초과)이면 만족도는 중(中), 평점 데이터가 제2 기준(ex: 2점) 미만(또는 이하)이면 만족도는 하 (下)로 산출될 수 있다. 한편, 본 발명에서 사용되는 “설명 정보”는 리뷰 데이터에 포함된 정보로서, 서비스 요소에 대해 특정 서비스 를 설명하는 정보로 이해되어 질 수 있다. 예를 들어, 리뷰 데이터가 “음식 가격은 비싸지만, 직원분들이 친절 해요”와 같은 텍스트로 구성되는 경우, “음식 가격은 비싸지만”은 가격 조건에 대해 음식 제공 서비스를 설 명하는 설명 정보이고, “직원분들이 친절해요”는 직원 대응에 대해 음식 제공 서비스를 설명하는 설명 정보일 수 있다. 다만, 이는 일 예시이며, 설명 정보가 이에 한정되는 것은 아니다. 한편, 본 발명에서 사용되는 “보고서”는 리뷰 데이터에 근거하여 생성된 정보로 이해되어 질 수 있다. 예를 들어, 보고서는 도 15a에 도시된 것과 같이, “현재 기준, 서비스 불만으로 고객들의 재방문 의시가 떨어집니다 ”와 같은 정보 포함할 수 있다. 본 발명에서 “보고서”는 “리포트”와 혼용되어 사용될 수 있다. 이하에서는 첨부된 도면과 함께, 본 발명에 따른 분석 시스템 및 방법에 대하여 보다 구체적으로 살펴본다. 도 1에 도시된 것과 같이, 고객은 전자기기를 통해 온라인 상에, 자신이 이용한 서비스에 대한 리뷰 데이 터(300a)를 올릴 수 있다. 고객은, 자신이 이용한 서비스를 제공(또는 판매)하는 홈페이지, 개인 블로그 (blog), SNS(Social Network Service)등에 리뷰 데이터(300a)를 작성할 수 있다. 앞서 설명한 것처럼, 리뷰 데이터는 시각적, 촉각적, 청각적 방식의 다양한 데이터를 의미할 수 있다. 시각적 방식의 리뷰 데이터로는 텍스트, 이미지, 동영상 등이 포함될 수 있으며, 청각적 방식의 리뷰 데이터로는 음성, 동영상 등이 포함될 수 있다. 동영상은 시각적 방식의 리뷰 데이터 및 청각적 방식의 리뷰 데이터 모두에 해당 될 수 있다. 본 발명에 따른 분석 시스템은 인터넷 상에 올라온 리뷰 데이터를 수집하고 분석하여, 보고서를 생성하고 보고서를 사용자(또는 사용자의 전자기기)에게 제공할 수 있다. 이하에서는, 본 발명에 따른 분석 시스템의 구성에 대하여 살펴보도록 한다. 도 1에 도시된 것과 같이, 본 발명에 따른 분석 시스템은, 통신부, 저장부 및 제어부 중 적어도 하나를 포함할 수 있다. 통신부는, 인터넷 프로토콜 스위트(TCP/IP)를 기반으로 하여 전 세계적으로 연결된 컴퓨터 네트워크와 통신하도록 이루어진다. 나아가, 통신부는 고객 전자기기 또는 사용자 전자기기와 통신하도록 이루어질 수 있다. 저장부는, 데이터베이스(Database, DB) 라고도 명명될 수 있으며, 수집된 리뷰 데이터, 페르소나 DB 등이 저장되도록 이루어진다. 예를 들어, 통신부를 통해 리뷰 데이터의 수집이 이루어지는 경우, 저장부에는 상기 리뷰 데이터가, 리뷰 데이터를 작성한 고객과 상호 연계되어 저장될 수 있다. 보다 구체적으로, 저장부는 전처리 전 리뷰 데이터, 전치리 후 리뷰 데이터, 인공 지능 모델의 동작 로직, 리뷰 데이터를 근거로 생성된 보고서 등이 저장 될 수 있다. 이 때, 전처리 전 리뷰 데이터는.pt 파일 형태로 저장부에 저장될 수 있으며, 전처리 후 리뷰 데이터는 RDBMS 형태로 저장부에 저장될 수 있다. 나아가, 페르소나 유형 DB는 HTML과 PDF의 출력가능한 형태로 저 장부에 저장될 수 있다. 나아가, 제어부는, 위에서 살펴본 구성요소들을 전반적으로 제어하도록 이루어질 수 있다. 제어부는 도 2에 도시된 것과 같이, i)데이터 수집부, ii)데이터 전처리부, iii)인공지능 학습부, iv)인공지능 동작부, v)페르소나 사전부 및 vi)보고서 생성부 중 적어도 하나를 포함할 수 있다. 데이터 수집부는, 온라인 상의 댓글, 이용 후기 등의 리뷰 데이터 자동 수집에 관한 역할을 수행할 수 있 다. 이를 위해, 데이터 수집부는 실시간 데이터 수집 모듈과 데이터 수집 모듈 두가지 모듈을 포함할 수 있다. 실시간 데이터 수집 모듈은, 웹 크롤링 방식으로 리뷰 데이터를 수집할 수 있다. 실시간 데이터 수집 모듈은 파 이썬(Python)의 Request, BeautifulSoup, 셀레늄(Selenium) 또는 포스트맨(Postman) 중 적어도 하나의 소프트 웨어(software)를 이용하여 웹 사이트에서 원하는 정보를 추출할 수 있다. 벌크형 데이터 수집 모듈은, API기반으로 리뷰 데이터를 수집할 수 있다. 벌크형 데이터 수집 모듈은 리뷰 데이 터 작성자의 연령 (또는 나이), 성별 등의 정보를 수집할 수 있다. 데이터 전처리부는, 수집된 리뷰 데이터를 다루기 편리하도록 불용어처리 및 토큰화(Tokenization)를 수행 하는 역할을 할 수 있다. 데이터 전처리부는, 수집된 리뷰 데이터를 Topword Rule을 이용한 불용어 처리를 수행하고, 구글(Google)사(社)의 SentencePiece 또는 Huggingface 사(社)의 Tokenizer를 이용하여 준단어 토큰 화를 수행할 수 있다. 인공지능 학습부는, 인공지능 동작부의 동작 로직에 대한 최적의값을 매칭하기 위한 학습을 수행하는 역할 을 한다. 보다 구체적으로, 인공지능 학습부는, 리뷰 데이터로부터 고객의 감정, 내용, 중요도, 나이, 성 별, 및 고객 유형 판정 중 적어도 하나와 관련된 학습을 수행할 수 있다. 인공지능 동작부는, 리뷰 데이터를 토픽모형(Topic Models)의 자연어처리(natural language processing) 알고리즘을 적용하여 텍스트(Text)로 구성된 리뷰 데이터 속에 잠재해 있는 핵심 주제(토픽(Topic))들을 탐색할 수 있다. 나아가, 인공지능 동작부는, Hungginface를 이용하여 BERT등의 트랜스 포머(Transformer) 기반 모델을 주로 사용할 수 있다. 나아가, 인공 지능 학습부는, CLS 토큰(token)을 이용하여 고객을 분류할 수 있는 다양한 지표를 추론하도록 학습할 수 있다. 이 때, 인공지능 학습부는 주어진 목표에 따라 MSE 및 CrossEntropy 중 적어도 하나의 손실함수를 사용할 수 있다. 나아가, 인공지능 동작부는, 데이터 수집부를 통해 수집된 리뷰 데이터의 감정, 내용 및 중요도 중 적어도 하나를 기반으로, 리뷰 데이터의 고객 유형을 페르소나 유형들 중 어느 하나로 분류 또는 추론하는 역할 을 수행할 수 있다. 보다 구체적으로, 인공지능 동작과정은 다음과 같은 첫번째 과정부터 여덟번째 과정에 따라 수행될 수 있다. i)첫번째 과정과 관련하여, 인공지능 동작부는 리뷰 데이터로부터 고객의 감정을 ‘긍정’, ‘중립’ 및 ‘부정’ 중 어느 하나로 분류할 수 있다. 예를 들어, 인공지능 동작부는 리뷰 데이터로부터 고객의 감정 을 1 내지 10 중 어느 하나로 수치화 하고, 1내지 4을 부정, 5를 중립, 6 내지10을 긍정으로 분류할 수 있다. ii)두번째 과정과 관련하여, 인공지능 동작부는 리뷰 데이터를 ‘가격조건’, ‘이용품질’, ‘서비스절차 ’, ‘직원대응’, ‘이용환경’ 중의 적어도 하나와 매칭하여 분류할 수 있다. 나아가, iii)세번째 과정과 관 련하여, 인공지능 동작부는 리뷰 데이터로부터 리뷰 데이터를 구성하는 단위 요소에 포함된 특정 단어의 ‘반복횟수’, ‘반복시간', '어조' 및 '강도’ 중 적어도 하나에 근거하여 중요도를 판단할 수 있다. 나아가, iv)네번째 동작과 관련하여, 인공지능 동작부는 리뷰 데이터로부터 연령 및 성별 중 적어도 하나를 기준으 로 고객의 타입을 구분할 수 있다. v)다섯번째 과정과 관련하여, 인공지능 동작부는 리뷰 데이터에 근거하 여 고객이 블랙 컨슈머에 해당하는지를 판단할 수 있다. vi)여섯번째 과정과 관련하여, 인공지능 동작부는, 블랙 컨슈머와 관련하여, 시그널(ex: 알림, 블랙 컨슈머가 작성한 리뷰 데이터에 마크 등) 및 보고서를 생성할 수 있다. 나아가, vii)일곱번째 단계와 관련하여, 인공지능 동작부는 리뷰 데이터에 근거 하여 고객이 블랙 컨슈머가 아닌 일반 고객으로 판단되면, 고객을 특정 페르소나 유형과와 매칭시키고, 위 첫번 째 단계 내지 세번째 단계를 통해 추출되는 값을 기반으로 고객의 만족도를 산정할 수 있다. 나아가, viii)여덟 번째 과정과 관련하여, 인공지능 동작부는 산정된 만족도 및 특정 페르소나 유형에 따른 대응 전략이 포함 된 보고서를 생성할 수 있다. 한편, 페르소나 사전부는 리뷰 데이터와 페르소나 DB를 서로 매칭하여, 리뷰 데이터에 대해 페르소나 유형 중 어느 하나를 특정할 수 있다. 나아가, 보고서 생성부는, 리포트 생성부로도 명명될 수 있다. 보고서 생성부는 제1 고객 타입(블랙 컨슈머)에 대해서는 실시간 시그널 및 제1 고객 타입(블랙 컨슈머)에 대한 예측 정보가 포함된 보고서를 생성하 고, 제2 고객 타입에 대해서는 제2 타입 고객에 대응되는 페르소나 유형의 특성 정보를 추출하여 보고서를 생성할 수 있다. 보고서 생성부는 보고서를 생성하는 시점의 기준을 서로 다르게 설정할 수 있다. 예를 들어, 제1 고객 타입(블랙 컨슈머)에 대해서는 1일 및 1개월 중 적어도 하나의 단위를 기준으로 보고서를 생성하도록 설정하고, 제2 타입 고객에 대해서는 1주 , 3개월 및 6개월 중 적어도 하나의 단위를 기준으로 보고서를 생성하 도록 설정할 수 있다. 한편, ⅰ)데이터 수집부, ii)데이터 전처리부, iii)인공지능 학습부, iv)인공지능 동작부, v)페르소나 사전부 및 vi)보고서 생성부는 제어부에 일 기능 근거하여 구분된 구성이다. 따라서, 이하에서는 각 구성을 구분하지 않고 제어부로 용어를 통칭하여 설명하도록 한다. 이하에서는, 위에서 살펴본 용어 및 본 발명에 따른 분류 시스템의 각 구성을 기반으로, 리뷰 데이터를 분 석하는 방법 및 시스템에 대하여 첨부된 도면과 함께 보다 구체적으로 살펴본다. 본 발명에서는 특정 서비스와 관련된 리뷰 데이터를 수집하는 과정이 진행될 수 있다(S310). 제어부는 통신부를 통해 온라인(인터넷 플랫폼(platform), 애플리케이션(application), 소셜 네트워 크 서비스(Social network service, SNS) 등) 상에 업로드된 리뷰 데이터를 수집할 수 있다. 제어부는 리 뷰 데이터를, 실시간 수집 방식(웹 크롤링 방식) 또는 벌크형 수집 방식(API 기반의 수집 방식) 중 적어도 하나 의 방식으로 리뷰 데이터를 수집할 수 있다. 본 발명에서 리뷰 데이터를 “수집”하는 것은, 통신부를 통해 리뷰 데이터를 다운르도 하여 저장부 에 저장하는 것으로 이해되어 질 수 있다. 리뷰 데이터는 시각적, 촉각적, 청각적 방식의 다양한 데이터를 의미할 수 있다. 시각적 방식의 리뷰 데이터로 는 텍스트, 이미지, 동영상 등이 포함될 수 있으며, 청각적 방식의 리뷰 데이터로는 음성, 동영상 등이 포함될 수 있다. 동영상은 시각적 방식의 리뷰 데이터 및 청각적 방식의 리뷰 데이터 모두에 해당될 수 있다. 이하에서는 설명의 편의를 위하여, 리뷰 데이터가 시각적 방식의 데이터로 구성된 경우를 예를 들어 설명하도록 한다. 제어부는 도 5에 도시된 것과 같이, 리뷰 데이터 중 텍스트 데이터(이하, 음성 데이터를 텍스트로 변환한 데이터를 포함) 및 평점(ex: 5점 만점에 4.5 와 같은 점수, 하트 또는 별의 개수 등)으로 구성된 평점 데 이터 중 적어도 하나를 수집하여 저장부에 저장할 수 있다. 이 때, 제어부는 텍스트 데이터 크기가 기 설정된 기준을 만족하는 리뷰 데이터만을 수집할 수 있다. 나아 가, 제어부는 텍스트 데이터의 크기를 구분하여 저장부에 저장할 수 있다. 보다 구체적으로, 제어부는 텍스트 데이터의 크기가 제1 기준(ex: 30byte) 이하(또는 미만)인 경우 제1 텍 스트 데이터 그룹(짧은 텍스트 그룹)으로 구분하고, 텍스트 데이터의 크기가 제1 기준(ex: 30byte)을 초과(또는 이상)하면서 제2 기준(ex: 80byte) 이하(또는 미만)인 경우 제2 텍스트 데이터 그룹(적당한 텍스트 그룹)으로 구분하고, 텍스트이 크기가 제2 기준(ex: 80byte)을 초과(또는 이상)인 경우 제3 텍스트 데이터 그룹(긴 텍스트 그룹)으로 구분하여 저장부에 저장할 수 있다. 나아가, 본 발명에서는 리뷰 데이터를 구성하는 단위 요소에 근거하여, 평가 인자에 해당되는 정보를 리뷰 데이 터로부터 추출하는 과정이 진행될 수 있다(S320). 본 발명에서 사용되는 “단위 요소”는 리뷰 데이터를 이루는 구성 요소로 이해되어 질 수 있다. 예를 들어, 단 위 요소는 i)텍스트(text) 데이터, ii)평점 데이터(ex: 5점 만점에 4.5 와 같은 점수, 하트 또는 별의 개수 등), iii)이미지 데이터, iv)영상 데이터 및 v)음성 데이터 중 적어도 하나를 포함할 수 있다. 본 발명에서 사용되는 “평가 인자”는 리뷰 데이터로부터 고객 유형을 특정하는데 사용되는 다양한 요소로 이 해되어 질 수 있다. 예를 들어, 평가 인자는 리뷰 데이터에 포함된, i)고객의 감정, ii)리뷰 데이터의 내용, iii)리뷰 데이터의 중요 사항(중요도), iv)고객의 연령 및 v)고객의 성별 중 적어도 하나 포함할 수 있다. 다만, 위 나열한 평가 인자는 설명의 편의를 위한 일 예시이며, 이에 한정되는 것은 아니다. 본 발명에서 사용되는 “평가 인자에 해당되는 정보”는 평가 인자를 포함하는 데이터로, i)감정 인자에 해당되 는 정보, ii)내용 인자에 해당되는 정보, iii)중요도 인자에 해당되는 정보, iv)연령 인자에 해당되는 정보 및 v)고객의 성별 인자에 해당되는 정보 중 적어도 하나를 포함할 수 있다. 나아가, 본 발명에서는 평가 인자를 근거로 페르소나 유형들이 분류된 페르소나 DB를 이용하여, 추출된 정보에 대응하는 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중 어느 하나로 특정하는 과정이 진행되어 질 수 있 다(S330). 본 발명에서 사용되는 “페르소나 유형”은 특정 서비스를 이용할 만한 인구 집단 안에 있는 다양한 사용자를 대표하는 인물로서, 어떤 특정한 상황과 환경속에서 어떤 전형적인 인물이 어떻게 행동할 것인가에 대한 예측을 위해 실제 사용자 자료를 바탕으로 개인의 개성을 부여하여 만들어진 가상의 인물이다. 나아가, 서로 다른 복수의 페르소나 유형의 집합체를 본 발명에서는 “페르소나 DB”라고 명명 한다. 페르소나 DB는 페르소나 유형들의 특성 정보 및 표준화된 값을 포함할 수 있다. 나아가, 본 발명에서, 페르소나 DB로부터 어느 하나의 페르소나 유형의 특성 정보를 추출하여, 리뷰 데이터의 고객 유형에 대한 보고서를 생성하는 과정이 진행되어 질 수 있다(S340). 여기서, “보고서”는 사용자로부터 제공된 서비스에 대한 고객들의 평가를 정리 및 분석한 정보를 의미할 수 있다. 예를 들어, 보고서는 도 15a에 도시된 것과 같이, ⅰ)특정 기간(ex: 일(日) 단위)리뷰 데이터의 수량, ⅱ)서비스에 대해 호감도 수치가 일정 기준 이하(또는 미만)인 리뷰 데이터(부정 리뷰) 또는 서비스에 대해 호 감도 수치가 일정 기준 초과(또는 이상)인 리뷰 데이터(긍정 리뷰), ⅲ)2회 이상의 리뷰 데이터를 게재한 고객 의 수, ⅳ)고객의 페르소나, ⅴ) 고객에 대한 대응 방안, ⅵ)실시간 리뷰 데이터 등 중 적어도 하나를 포함할 수 있다. 다만, 위 나열된 평가 보고서는 설명의 편의를 위한 일 예시이며, 이에 한정되는 것은 아니다. 제어부는 리뷰 데이터의 고객 유형에 대응되는 페르소나 유형의 특성 정보를 추출하고, 이에 근거하여 보 고서를 생성할 수 있다. 예를 들어, 리뷰 데이터의 고객 유형에 대응되는 페르소나 유형은, 만 26세의 여(女)자 로서, 직업은 피팅 모델이고, 상품 및 서비스가 중요하고, 브랜드는 신경 쓰지 않지만, 고객 응대에는 민감하고, 광고 및 입소문을 적극적으로 하며, 인테리어의 분위기를 중요하게 생각한다는 특성정보를 가지고 있 을 수 있다. 제어부는 이러한 특성 정보가 포함된 보고서를 생성할 수 있다. 한편, 도 4a 및 4b와 함께 본 발명의 전체 프로세스를 설명하도록 한다. 본 발명은 리뷰 데이터를 수집하 고, 리뷰 데이터를 전처리할 수 있다. 제어부는 전처리 된 리뷰 데이터로부터 고객의 1차 경험을 분 류하는 과정을 수행할 수 있다. 이 때, 제어부는 AI 학습 및 적용과정을 동시에 수행할 수 있다. 본 발명에서는 이를 평가 인자에 해당되는 정보를 추출하는 과정이라고 명명한다. 나아가, 제어부는 페르소나 DB 사전을 이용하여 리뷰 데이터의 유형을 제1 타입 고객(블랙 컨슈머) 및 제2 타입 고객 중 어 느 하나로 분류할 수 있다. 나아가, 제어부는 제2 고객 타입에 대해 페르소나 유형 중 어느 하나의 유형을 매칭시킬 수 있다. 나아가, 제어부는 제1 타입 고객 및 제2 타입 고객에 대해 보고서(리포트, 470)를 생성할 수 있다. 이하에서는, 리뷰 데이터로부터 평가 인자에 해당되는 정보를 추출과정에 대해 보다 구체적으로 설명하도록 한 다. 제어부는, 수집된 리뷰 데이터(전처리 전 리뷰 데이터)를 불용어 처리 및 토큰화(Tokenization)의 전처리 과정을 수행할 수 있다. 이하에서, 사용되는 리뷰 데이터는 전처리 된 리뷰 데이터로 이해될 수 있으며, 전처리 된 리뷰 데이터는 1차 경험 데이터와 혼용되어 사용될 수 있다. 앞서 설명한 바와 “평가 인자에 해당되는 정보”는 평가 인자를 포함하는 데이터로, i)감정 인자에 해당되는 정보. ii)내용 인자에 해당되는 정보, iii)중요도 인자에 해당되는 정보, iv) 연령 인자에 해당되는 정보, v)고 객의 성별 인자에 해당되는 정보 중 적어도 하나를 포함할 수 있다. 본 발명에서 평가 인자에 해당되는 정보는 2차 경험 데이터와 혼용되어 사용될 수 있다. 먼저, 제어부는 리뷰 데이터로부터 감정 인자에 해당하는 정보를 추출할 수 있다. 제어부는 기계 학 습에 의하여 생성된 인공 지능 모델을 기반으로, 감정 인자에 해당하는 정보를 ⅰ)리뷰 데이터의 텍스트 데이터 로부터 추출하거나 ⅱ)리뷰 데이터의 평점 데이터로부터 추출할 수 있다. 제어부는 리뷰 데이터의 텍스트 데이터로부터 감정 인자에 해당되는 정보를 추출하기 위하여, 리뷰 데이터 를 구성하는 텍스트 데이터와 저장부에 기 저장된 단어 DB를 비교할 수 있다. 여기서, “단어 DB”에는 감정을 표현하는 단어 및 이에 매칭되는 점수가 서로 연계되어 저장되어 있을 수 있다. 제어부는 텍스트 데이터에 포함된 단어 별로 매칭되는 점수와, 기 설정된 계산 방법을 이용하여 감정 텍스 트 데이터 전체에 대한 감정 점수를 산출할 수 있다. 나아가, 제어부는 평점 데이터의 텍스트 데이터로부터 감정 인자에 해당되는 정보를 추출하기 위하여, 평 점 데이터 및 기 설정된 계산 방법을 이용하여 감정 점수를 산출할 수 있다. 제어부는 산출된 감정 점수를 저장부에 저장된 기 설정된 감정 분류 기준(도 6의 610)과 비교함으로 써, 고객의 감정을 분류할 수 있다. 예를 들어, 제어부는 산출된 감정 점수가 -3이면 고객이 특정 서 비스에 대해 강한 부정적인 감정을 느끼는 것으로 분류할 수 있으며, 산출된 감정 점수가 2이면 고객 이 특정 서비스에 대해 긍정적인 감정을 느끼는 것으로 분류할 수 있다. 감정 인자에 해당되는 정보는, 이처럼 산출된 “감정 점수” 또는 “감정 점수에 따라 분류된 감정” 중 적어도 하나가 포함될 수 있다. 제어부는 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 리뷰 데이터로부터 감정 인자에 해당되는 정보를 추출하고, 이를 리뷰 데이터와 상호 연계하여 저장부에 저장할 수 있다. 나아가, 제어부는 산출된 감정 점수와, 저장부에 기 저장된 고객 유형 분류 DB(도 6의 620)를 비교하 여, 리뷰 데이터의 고객 유형을 분류할 수 있다. 예를 들어, 제어부는 산출된 감정 점수가 -3이면 고객 유 형을 블랙 컨슈머로 분류할 수 있으며, 산출된 감정 점수가 2이면 고객 유형을 일반 고객(또는 예상 충성 고객)으로 분류할 수 있다. 한편, 제어부는 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로, 리뷰 데이터 및 저장부에 기 저장된 “내용 DB”를 비교할 수 있다. 제어부는 비교 과정을 통해, 리뷰 데이터로부터 내용 인자에 해당 되는 정보를 추출할 수 있다. “내용 DB”는, 서로 다른 복수의 서비스 요소에 대해 특정 서비스를 설명하는 설명 정보를 포함할 수 있다. 도 7과 함께 본 발명에서 사용되는 “서비스 요소”를 설명한다. 서비스 요소는, 사용자가 고객에게 서비스를 제공함에 있어 고려되어야 할 다양한 사항들을 의미할 수 있다. 예를 들어, 서비스 요소는 ⅰ)가격조건, ⅱ)이용품질, ⅲ)서비스 절차, ⅳ)직원대응 및 ⅴ)이용환경 중 적어도 하나를 포함할 수 있다. 다만, 위 나열한 사항들은 서비스 요소의 일 예시이며, 이에 한정되는 것은 아니다. 본 발명에서 사용되는 “설명 정보”는 서비스 요소를 설명하는 어휘 또는 단어로 이해되어 질 수 있다. 설명 정보는 내용 DB에 서비스 요소와 매칭되어 저장되어 있을 수 있다. 예를 들어, ⅰ)가격조건과 매칭되는 설명 정보는 가격, 값, 가성비 비용 등을 포함할 수 있다. ⅱ)이용품질과 매칭되는 설명 정보는 맛, 품질, 질, 상품 등이 포함될 수 있다. ⅲ)서비스 절차와 매칭된 설명 정보는 사용 방법, 주문 방법, 주문 순서, 결제 방법, 결제 수단 등이 포함될 수 있다. ⅳ)직원대응과 매칭된 설명 정보는 친절, 불친절, 태도 등이 포함될 수 있다. ⅴ)이용환경과 매칭된 설명 정보는 인테리어, 분위기, 서버, 오류 등이 포함될 수 있다. 내용 인자에 해당되는 정보는, 이처럼 각 서비스 요소를 설명하는 설명 정보를 포함할 수 있다. 제어부는 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 리뷰 데이터로부터 내용 인자에 해당되는 데이터를 추출하고, 이를 리뷰 데이터와 상호 연계하여 저장부에 저장할 수 있다. 한편, 제어부는 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로, 리뷰 데이터로부터 중요도 인자에 해당되는 정보를 추출할 수 있다. 한편, 앞서 설명한 “단어 DB”에 포함된 단어는 부정 식별코드 또는 긍정 식별코드 중 어느 하나의 식별코드가 매칭되어 저장되어 있을 수 있다. 예를 들어, “별로”또는 “맛없다”는 부정 식별코드와 매칭되어 있고, “맛 있다”는 긍정 식별코드와 매칭되어 있을 수 있다. 제어부는 리뷰 데이터와 단어 DB를 비교하여, 리뷰 데이터에 부정 식별코드가 매칭되어 있는 단어의 사용 횟수 또는 긍정 식별 코드가 매칭되어 있는 단어의 사용횟수를 카운팅하여, 카운팅 결과를 생성할 수 있다. 여기서, 카운팅(counting)이란, 숫자를 세는 것을 의미할 수 있다. 예를 들어, 리뷰 데이터가 “짬뽕이 맛이 없 고, 가격도 별로 저렴하지 않았어요”를 포함하는 경우, 제어부는 “맛이없고(맛없다)”에 근거하여 0에서 1로 카운팅하고, “별로”에 근거하여 1에서 2로 카운팅 할 수 있다. 2는 카운팅 결과에 해당된다. 제어부는 카운팅 결과를, 제1 기 설정된 중요도 조건에 근거하여 제1 중요도 측정 점수로 변환할 수 있다. 예를 들어, 도 8a에 도시된 것과 같이, 제어부는 부정 식별 코드의 카운팅 결과 2를, 제1 기 설정된중요도 조건에 근거하여 -1의 제1 중요도 측정 점수으로 변환할 수 있다. 나아가, 제어부는 리뷰 데이터가 음성 데이터로 구성되는 경우, 특정 단어에 대한 어조를 판단하고, 이를 제2 기 설정된 중요도 조건에 근거하여 제2 중요도 측정 점수를 산출할 수 있다. 예를 들어, 제어부 는 음성 데이터에 포함된 특정 단어가 부정 어조로 발화되었다고 판단되면, 제2 기 설정된 중요도 조건에 근거하여 제2 중요도 점수를 -1로 변환할 수 있다. 나아가, 제어부는 제1 중요도 점수와 제2 중요도 점수를 합산하여 최종 중요도 점수를 산출할 수 있다. 예 를 들어, 제1 중요도 점수 -1과, 제2 중요도 점수 -1을 합산하여 최종 중요도 점수 -2를 산출할 수 있다. 중요도 인자에 해당되는 정보는, 이처럼 산출된 “제1 중요도 점수”, “제2 중요도 점수” 및 “최종 중요도 점수” 중 적어도 하나가 포함될 수 있다. 제어부는 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 리뷰 데이터로부터 중요도 인자에 해당되 는 데이터를 추출하고, 이를 리뷰 데이터와 상호 연계하여 저장부에 저장할 수 있다. 나아가, 제어부는 산출된 중요도 점수와, 저장부에 기 저장된 고객 유형 분류 DB(도 8b의 820)를 비 교하여, 리뷰 데이터의 고객 유형을 분류할 수 있다. 예를 들어, 제어부는 산출된 감정 점수가 -2이면 고 객 유형을 부정 고객 으로 분류할 수 있다. 한편, 제어부는 리뷰 데이터로부터 고객의 성별 및 나이를 판단할 수 있다. 제어부는 리뷰 데이터에 고객의 성별 식별코드 및 연령 식별 코드를 포함되어 있으면, 성별 식별코드 및 연령 식별코드에 근거하여 고객의 성별 및 나이를 판단할 수 있다. 제어부는 리뷰 데이터에 성별 식별코드 및 연령 식별 코드 중 적어도 하나가 포함되어 있지 않으면, 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 고객의 연령 및 성별을 판단할 수 있다. 한편, 앞서 설명한 “단어 DB”에 포함된 단어는 연령 식별 코드 및 성별 식별 코드 중 적어도 하나의 식별코드 가 매칭되어 저장되어 있을 수 있다. 제어부는 리뷰 데이터와, 단어 DB를 비교하여 고객의 연령 또는 성별 을 판단할 수 있다. 제어부는 리뷰 데이터와 단어 DB를 비교하여, 리뷰 데이터에 연령 식별코드 또는 성별 식별코드가 매칭되 어 있는 단어에 근거하여, 사용자의 연령 또는 성별을 특정 할 수 있다. 예를 들어, 도 9a에 도시된 것과 같이, 단어 DB에는, 리뷰 데이터에 기재된 “50 평생” 및 “신랑” 단어에 매칭된 식별 코드(50대 연령 식 별 코드 및 “여(女)자 식별 코드”)에 근거하여 고객의 연령 및 성별을 특정할 수 있다. 나아가, 제어부는 기 설정된 연령 기준 또는 기 설정된 성별 기준에 근거하여, 고객의 연령 또는 성별을 특정할 수 있다. 예를 들어, 도 9b에 도시된 것과 같이, 리뷰 데이터에 신조어 또는 줄임말이 다수 사용되었거 나 오타가 많으면, 고객을 10대로 특정할 수 있으며, “읍니다”를 사용하는 경우 고객의 나이를 60대 로 특정할 수 있다. 연령 및 성별 인자에 해당되는 정보는, 이처럼 특정된 고객의 “연령” 및 “성별” 중 적어도 하나가 포함될 수 있다. 제어부는 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 리뷰 데이터로부터 연령 및 성별 인자에 해당되는 데이터를 추출하고, 이를 리뷰 데이터와 상호 연계하여 저장부에 저장할 수 있다. 한편, 제어부는 리뷰 데이터로부터 추출된 평가 인자에 해당되는 데이터를 이용하여 리뷰 데이터의 복수의 고객 유형 중 어느 하나로 특정할 수 있다. 복수의 고객 유형은 제1 타입 고객 및 제2 타입 고객으로 분류되어 질 수 있다. 제1 타입 고객은 특별한 주의가 필요한 타입으로서, 제공 받은 서비스에 대한 리뷰 데이터를 작성하는 것이 아 닌, 서비스의 하자를 문제 삼아 사용자(사업자 또는 기업)을 상대로 과도한 피해 보상금을 요구하거나 거짓으로 피해를 본 것 처럼 꾸미는 악의적인 유형을 의미할 수 있다. 본 발명에서는 제1 타입 고객을 블랙 컨슈머로 명 명할 수 있다. 제2 타입 고객은 제1 타입 고객을 제외한 리뷰 데이터의 고객 유형을 포함할 수 있다. 제2 타입 고객은 ⅰ)일반 고객, ⅱ)단골 고객, ⅲ)우수 고객(또는 충성 고객), ⅳ)불만족 고객을 포함할 수 있다. 한편, 제어부는 리뷰 데이터로부터 추출된 평가 인자에 해당되는 데이터를 이용하여, 리뷰 데이터의 고객 유형이 제1 타입 고객(블랙 컨슈머)에 해당되는지를 판단할 수 있다. 제어부는 산출된 감정 점수와, 저장부에 기 저장된 고객 유형 분류 DB(도 6의 620)를 비교하여, 리뷰 데이터의 고객 유형을 분류할 수 있다. 제어부는 산출된 감정 점수가 -3이면 고객 유형을 제1 타입 고객 (블랙 컨슈머)으로 분류할 수 있다. 나아가, 제어부는 산출된 중요도 점수와, 저장부에 기 저장된 고객 유형 분류 DB(도 8b의 820)를 비 교하여, 리뷰 데이터의 고객 유형을 분류할 수 있다. 제어부는 산출된 감정 점수가 -3이면 고객 유형을 제 1 타입 고객(블랙 컨슈머)으로 분류할 수 있다. 나아가, 제어부는 리뷰 데이터로부터 추출된 평가 인자에 해당되는 데이터에 근거하여, 리뷰 데이터의 고 객 유형을 분류하도록, 인공지능 모델을 기계 학습 시킬 수 있다. 도10과 함께, 제어부가 리뷰 데이터의 고객 유형을 분류하도록, 인공지능 모델을 기계 학습시키는 과정에 대해 설명하도록 한다. 제어부는 리뷰 데이터가 긍정적인 내용인지 여부를 판단할 수 있다. 제어부는 ⅰ)감정 인자에 해당되는 데이터의 감정 점수가 기 설정된 기준을 초과하면 긍정적인 리뷰 데이터로 분류 하고, ⅱ)감정 인자에 해당되는 데이터의 감정 점수가 기 설정된 기준에 해당되면 긍정적이지도 부정적이지도 않은 리뷰 데이터로 분류하고, ⅲ) 감정 인자에 해당되는 데이터의 감정 점수가 기 설정된 기준 미만이면 부정적인 리뷰 데이터으로 분류할 수 있다. 나아가, 제어부는 ⅰ)긍정적인 리뷰 데이터와 관 련하여, 여러번 리뷰 데이터를 작성하지 않은 고객은 일반 고객으로, 여러 번 리뷰 데이터를 작성하였고 가격 또는 기다리는 시간에 예민한 고객은 단골 고객으로, 여러 번 리뷰를 작성하였고 가격 또는 기다리 는 시간에 예민하지 않은 고객은 우수 고객(또는 충성 고객)으로 분류할 수 있다. 나아가, 제어부는 ⅱ)긍정적이지도 부정적이지도 않은 리뷰 데이터를 작성한 고객을 일반 고객으로 분류할 수 있다. 나아가, 제어부는 ⅲ) 부정적인 리뷰 데이터와 관련하여, 부정적인 리뷰 데이터가 격양된 표현으로 작성되지 않았으면 불만족 고객으로, 리뷰데이터가 격양된 표현으로 작성되었으나 금전적 보상을 요구하 지 않는 불만족 고객으로, 리뷰데이터가 격양된 표현으로 작성되었고 금전적 보상을 요구하면 제1 타입 고객(블랙 컨슈머)으로 분류할 수 있다. 제어부는 이러한 프로세스에 따라 인공지능 모델을 기계 학 습 시키고, 리뷰데이터의 고객 유형을 분류할 수 있다. 나아가, 도 11과 함께, 제어부가 제1 타입 고객(블랙 컨슈머)의 고객 유형을 세분화 하여 분류하도록, 인 공지능 모델을 기계 학습시키는 과정에 대해 설명하도록 한다. 제어부는 제1 타입 고객(블랙 컨슈머)으로 분류된 고객 유형이 반복적으로 보상을 요구하는지 여부를 판단할 수 있다. 제어부는 보상을 요구하는 리 뷰 데이터가 작성된 경우와 관련하여, 제1 타입 고객(블랙 컨슈머)의 고객 유형을, ⅰ)리뷰 데이터에 SNS 공유 관련 협박 내용이 포함되어 있으면 파파라치형, ⅱ)리뷰 데이터에 논리적이지 않은 요구가 포함되어 있으면 억지주장형, ⅲ) 리뷰 데이터에 SNS 공유 관련 협박 및 논리적이지 않은 요구가 포함되어 있으면 복합형으로 분류할 수 있다. 나아가, 제어부는 보상을 요구하지 않는 리뷰 데이터가 작성된 경우 와 관련하여, 제1 타입 고객(블랙 컨슈머)의 고객 유형을, ⅳ)리뷰 데이터에 상품 (또는 서비스) 관련 내 용이 포함되어 있지 않으면 업무방해형, ⅴ) 리뷰 데이터에 규칙 관련 내용이 포함되어 있으면 규칙위반 형, ⅵ) 리뷰 데이터에 상품 관련 내용 및 규칙 관련 내용이 포함되어 있지 않으면 기타형으로 분 류할 수 있다. 제어부는 이러한 프로세스에 따라 인공지능 모델을 기계 학습 시키고, 리뷰데이터의 고객 유형을 분류할 수 있다. 한편, 제어부는 도 13(a)에 도시된 것과 같이, 제1 고객 타입의 세분화된 고객 유형을, 리뷰 데이터와 연 계하여 저장부에 저장할 수 있다. 예를 들어, 제1 고객 타입의 세분화된 고객 유형이 규칙위반형이면, 리뷰 데 이터, 제1 고객 타입 및 규칙위반형을 연계하여 저장부에 저장할 수 있다. 한편, 본 발명에서는 제2 타입의 고객과 관련하여, 추출된 평가 인자에 해당되는 정보에 대응하는 리뷰 데이터 의 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 즉, 제어부는 제2 타입 고객을 페르소나 DB에 포함된 복수의 서로 다른 페르소나 유형들 중 어느 하나와 매칭시킬 수 있다. 앞서 설명한 바와 “평가 인자에 해당되는 정보”는 평가 인자를 포함하는 정보로, i)감정 인자에 해당되는 정 보(감정 점수 또는 감정 점수에 따라 분류된 감정), ii)내용 인자에 해당되는 정보(설명정보), iii)중요도 인자 에 해당되는 정보(중요도 점수), iv) 연령 인자에 해당되는 정보(특정된 연령), v)고객의 성별 인자에 해당되는정보(특정된 성별) 중 적어도 하나를 포함할 수 있다. 보다 구체적으로, 제어부는 리뷰 데이터에 고객의 성별 식별코드 및 연령 식별 코드를 포함되어 있으면, 성별 식별코드 및 연령 식별코드에 근거하여 고객의 성별 및 나이를 판단할 수 있다. 제어부는 성별 식별 코드 및 연령 식별코드를 페르소나 DB와 비교하고, 매칭되는 페르소나 유형을 추할 수 있다. 예를 들어, 리뷰 데이터에 포함된 성별 식별 코드는 여(女)자이고, 연령 식별 코드는 만 26라고 가정하자. 제어부는 페르소 나 DB에서, 여(女)자 및 만 26세의 특성정보를 포함하는 페르소나 유형을 추출할 수 있다. 제어부는 추출 된 페르소나 유형에서, 어느 하나를 리뷰 데이터에 대한 페르소나 유형을 특정할 수 있다. 나아가, 제어부는 제어부는 리뷰 데이터에 성별 식별코드 및 연령 식별 코드 중 적어도 하나가 포함 되어 있지 않으면, 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 고객의 연령 및 성별을 판단할 수 있 다. 예를 들어, 기계 학습에 의하여 생성된 인공 지능 모델을 기반으로 판단한 고객의 연령 및 성별이 남(男)자 및 만 59세라고 가정하자. 제어부는 페르소나 DB에서, 남(男)자 및 만 59세의 특성정보를 포함하는 페르소 나 유형을 추출할 수 있다. 제어부는 추출된 페르소나 유형에서, 어느 하나를 리뷰 데이터에 대한 페르소 나 유형을 재특정할 수 있다. 나아가, 제어부는 추출된 평가 인자에 해당되는 정보를 기 설정된 기준에 근거하여, 제1 정보 및 제2 정보 로 분류할 수 있다. 제1 정보는 페르소나 DB와의 매칭에 이용되는 정보로 이해되어 질 수 있다. 제어부는 제1 정보를 페르소나 DB와 매칭시켜, 리뷰 데이터의 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 제2 정보는 고객 유형을 분석하는 인공지능 모델의 입력 데이터로 이용되어 질 수 있다. 제어부는 제2 정 보를 인공 지능 모델에 입력하여, 리뷰 데이터의 고객 유형을 상기 페르소나 유형들 중 어느 하나로 특정할 수 있다. 한편, 페르소나 DB는 평가 인자를 근거로 분류된 복수의 서로 다른 페르소나 유형을 포함할 수 있다. 예를 들어, 페르소나 DB는 특정 서비스(ex: 음식점)의 서비스 요소 중 분위기에 민감한 특정 연령(ex:20대) 및 성별 (ex: 여자)의 가상의 인물을 포함 할 수 있다. 나아가, 페르소나 DB는 페르소나 유형들에 대한 표준화된 값 및 페르소나 유형들의 특성 정보가 저장될 수 있다. 이 때, 표준화된 값 및 특성 정보는 고객의 개인 정보(ex: 연령, 성별, 거주지, 직업, 가족관계, 학력, 성격, 소비 패턴 등), 및 특정 서비스의 업종 정보(음식업, 관광 서비스업, 숙박업 등) 중 적어도 하나를 기준으로 설 정되어 질 수 있다. 나아가, 제어부는 제1 정보 및 기 설정된 기준에 근거하여 평가 인자 점수를 산출할 수 있다. 제어부(13 0)는 산출된 평가 인자와 페르소나 DB의 표준화된 값을 매칭시켜, 페르소나 유형을 특정할 수 있다. 예를 들어, 제어부는 특정 리뷰 데이터로부터 제1 정보를 추출하고, 이를 이용하여 기 설정된 기준에 근거하여 평가 인자 점수를 산출할 수 있다. 나아가, 페르소나 DB는 제1 페르소나 유형은 제1 표준화된 값, 제2 페르소 나 유형은 제2 표준화된 값, 제 3 페르소나 유형은 제3 표준화된 값과 각각 매칭되어 있을 수 있다. 제어부 는 평가 인자 점수가 제1 표준화된 값 내지 제3 표준화된 값 중 제1표준화된 값에 매칭된다고 판단 되면, 리뷰 데이터에 대한 고객 형을 페르소나 DB의 제1 페르소나 유형으로 특정할 수 있다(도 12 참조). 나아가, 제어부는 제2 정보 및 인공지능 모델을 이용하여, 리뷰 데이터의 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 이 때, 제어부는 단위 요소에 평가 인자에 해당하는 정보가 존재하는지 여부에 따라 인공지능 모델을 선택 적으로 이용할 수 있다. 보다 구체적으로, 제어부는 리뷰 데이터에 특정 평가 인자에 해당되는 정보가 존 재하는 경우에만 인공지능 모델을 이용하여, 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 예 를 들어, 제어부는 리뷰 데이터에 연령 인자에 해당되는 정보 및 성별 인자에 해당되는 정보가 포함되어 있으면 인공지능 모델을 이용하여 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 반면에, 제어 부는 리뷰 데이터에 연령 인자에 해당되는 정보 및 성별 인자에 해당되는 정보 중 적어도 하나가 포함되어 있지 않으면 페르소나 DB를 이용하여, 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 나아가, 제어부는 제1 정보와 페르소나 DB를 매칭시켜 특정한 페르소나 유형 및 제2 정보와 인공지능 모델 을 이용하여 특정한 페르소나 유형 중 어느 하나의 페르소나 유형을 선택함으로써, 리뷰 데이터에 대한 고객 유형을 최종적으로 특정할 수 있다. 한편, 제어부는 도 13(b)에 도시된 것과 같이, 제2 고객 타입의 페르소나 유형을, 리뷰 데이터와 연계하여 저장부에 저장할 수 있다. 예를 들어, 제2고객 타입의 페르소나 유형이 제2 페르소나 유형이면, 리뷰 데이터, 제2 고객 타입 및 제2 페르소나 유형을 연계하여 저장부에 저장할 수 있다. 한편, 본 발명에서는 리뷰 데이터에 특정된 고객 유형에 대한 보고서를 생성하여 사용자에게 제공할 수 있다. 이를 위해, 제어부는 리뷰 데이터를 분석하여, 리뷰 데이터에 해당하는 고객의 만족도를 평가하는 과정이 진행되어 질 수 있다. 본 발명에서 사용되는 “만족도”는 고객이, 제공받은 서비스에 어느 정도 만족하고 있는 가를 일컫는 용어로 이해되어 질 수 있다. 제어부는 리뷰 데이터 및 기 설정된 기준에 근거하여 만족도를 산출할 수 있다. 예 를 들어, 리뷰 데이터가 5점 만점의 평점 데이터를 포함한다고 가정하자. 평점 데이터가 제1 기준(ex: 4점) 이 상(또는 초과)이면 만족도는 상(上), 평점 데이터가 제1 기준(ex: 4점) 미만(또는 이하)이면서 제2 기준(ex: 2 점) 이상(또는 초과)이면 만족도는 중(中), 평점 데이터가 제2 기준(ex: 2점) 미만(또는 이하)이면 만족도는 하 (下)로 산출될 수 있다. 이처럼 보고서는, 만족도 평가의 결과값을 포함할 수 있다. 나아가, 제어부는 리뷰 데이터에 대한 고객의 유형이 제1 고객 타입(블랙 컨슈머)에 해당되면, 보고서에, 제1 고객 타입(블랙 컨슈머)에 대한 예측 정보생성하고, 예측 정보를 이용하여 보고서를 생성할 수 있다. 여기서, 예측 정보는, 제1 고객 타입(블랙 컨슈머)의 리뷰 데이터에 근거하여 제1 고객 타입(블랙 컨슈머)의 행 동을 미리 예측하는 정보를 의미할 수 있다. 예를 들어, 제어부는 리뷰 데이터에 근거하여 제1 고객 타입(블랙 컨슈머)가 특정 패턴(특정 주기, 특정 지역, 특정 업종)을 가지고 리뷰 데이터를 작성한다고 판단할 수 있다. 제어부는 판단 결과에 따라 제1 고 객 타입(블랙 컨슈머)의 다음번 리뷰 데이터 작성 시기를 예측할 수 있다. 또 다른 예를 들어, 제어부는 리뷰 데이터에 근거하여 제1 고객 타입(블랙 컨슈머)이 특정 사항에 불만 (ex: 배달)을 가지고 악의적인 리뷰를 작성한다고 판단할 수 있다. 제어부는 판단 결과에 따라 제1 고객 타입(블랙 컨슈머)의 다음번 주문에 대해서도 특정 사항에 불만(ex: 배달)을 가질 것으로 예측할 수 있다. 제어 부는 이러한 예측 정보를 이용하여 보고서를 생성할 수 있다. 나아가, 저장부는 고개 유형에 따른 대응 전략이 매칭되어 저장되어 있을 수 있다. 예를 들어, 도 14에 도 시된 것처럼, 저장부에는 제2 고객 타입으로 분류된 리뷰 데이터를 다시 만족도에 따라(ex: 부정, 일반 및 긍정 중 어느 하나) 분류하고, 이에 대응된 대응 전략(관리, 경고, 보상 등)이 매칭되어 있을 수 있다. 제어부 는 만족도를 이용하여 리뷰 데이터의 고객 유형에 대한 대응 전략을 제시할 수 있다. 한편, 제어부는 리뷰 데이터를 분석하여, 특정 서비스와 관련된 서로 다른 복수의 서비스 요소 중 리뷰 데 이터에 대응되는 적어도 하나의 서비스 요소를 특정할 수 있다. 나아가, 제어부는 서비스 요소에 대해 특정 서비스를 설명하는 설명 정보를 추출하고, 특정된 고객 유형 및 추출된 설명 정보를 이용하여, 특정 서비스에 대한 상기 페르소나에 대응되는 고객 그룹의 평가 보고서를 생 성할 수 있다. 예를 들어, 리뷰 데이터가 “음식 가격은 비싸지만, 직원분들이 친절해요”와 같은 텍스트로 구성되는 경우, “ 음식 가격은 비싸지만”은 가격 조건에 대해 음식 제공 서비스를 설명하는 설명 정보이고, “직원분들이 친절해 요”는 직원 대응에 대해 음식 제공 서비스를 설명하는 설명 정보일 수 있다. 제어부는 이러한 설명 정보 를 이용하여 보고서를 생성할 수 있다. 한편, 도 15a, 도 15b, 도 15c, 도 15d, 도 15e와 함께 보고서를 설명한다. 보고서는 인터넷 페이지 또는 애플 리케이션Application)의 페이지 형태로 사용자에게 제공될 수 있다. 즉, 보고서는 페이지의 개념으로 이해되어 질 수 있으며, 제공되는 기능에 근거하여 복수의 페이지(1510, 1520, 1530, 1540, 1550)을 포함할 수 있다. 보 다 구체적으로, 보고서는 ⅰ)도 15a에 도시된 기본 페이지, ⅱ)도 15b에 도시된 리뷰 현황 페이지 , ⅲ)도 15c에 도시된 리뷰 분석 페이지, ⅵ)도 15d에 도시된 고객 유형 페이지, ⅴ)도 15e 에 도시된 실시간 리뷰 평가 페이지를 포함할 수 있다. 다만, 위 나열된 페이지들은 설명의 편의를 위한 예시이며, 이에 한정되는 것은 아니다. 먼저, 도 15a와 함께 기본 페이지를 설명한다. 기본 페이지는 ⅰ)알림 출력 영역, ⅱ)리뷰 분석 현황 영역, ⅲ)리뷰 컨디션 영역, ⅳ)리뷰 현황 영역, ⅴ)그래프 영역, ⅵ)고객 분석 영역, ⅶ)고객 유형 별 리뷰 영역, ⅷ)리뷰 워드클라우드 영역, ⅳ)실시간 리뷰 평가 영역 중 적어도 하나를 포함할 수 있다. ⅰ)알림 출력 영역에는 제1 타입 고객(블랙 컨슈머)이 리 뷰 데이터를 업로드 하면 알림이 출력될 수 있다. 알림은 시각적, 청각적, 촉각적 방식 중 적어도 하나로 이루 어질 수 있다. 예를 들어, 시각적 방식의 알림은 제1 타입 고객(블랙 컨슈머)이 리뷰 데이터를 작성하면 알림 출력 영역에 숫자를 포함한 배지가 출력될 수 있다. ⅱ)리뷰 분석 현황 영역 서비스에 대한 리뷰를 분석한 종합 내용이 출력될 수 있다. 예를 들어, 리뷰 분석 현황 영역에는 “현재 기준 서비스 불만으로 고객들의 재방문 의시가 떨어집니다”와 같은 안내 문구가 출력될 수 있다. ⅲ)리뷰 컨디션 영역에는 매 장의 리뷰 컨디션이 표시될 수 있다. 예를 들어, 리뷰 현황이 긍정적이면 리뷰 컨디션 영역에 스마일 이 모티콘(emoticon)이 출력되고, 리뷰 현황이 부정적이면 리뷰 컨디션 영역에 화난 이모티콘이 출력될 수 있다. ⅳ)리뷰 현황 영역에는 총 리뷰 대비 부정적인 리뷰가 차지하는 비율 및 증감 여부, 총 리뷰 대비 긍정적인 리뷰가 차지하는 비율 및 증감 여부 등이 출력될 수 있다. ⅴ)그래프 영역에는 리뷰를 분석한 결과를 그래프로 출력할 수 있다. 예를 들어, 그래프 영역에는 서비스 요소 각각에 대한 점수를 방사형 그래프로 출력될 수 있다. 나아가, ⅵ)고객 분석 영역은 방문 빈도가 높은 고객 유형, 관리가 필요한 고 객 유형 등에 대한 설명이 출력될 수 있다. ⅶ) 고객 유형 별 리뷰 영역에는 고객 유형에 대응되어 분류 된 리뷰들이 출력될 수 있다. 예를 들어, 고객 유형 별 리뷰 영역에는 제1 타입 고객(블랙 컨슈머)의 리 뷰 데이터들만이 출력될 수 있다. ⅷ)리뷰 워드클라우드 영역에는 리뷰 데이터에 빈도가 높게 사용되는 특정 단어가 출력될 수 있다. 이 때, 빈도가 높은 단어일수록 큰 폰트(font)로 출력될 수 있다. 나아가, ⅸ)실 시간 리뷰 평가 영역에는 실시간으로 작성되는 리뷰들이 출력될 수 있다. 사용자는 리뷰 현황 영역을 선택(또는 클릭)함으로서, 본 발명에 따른 분석 시스템으로 도15b의 리 뷰 현황 페이지의 출력 요청을 전송할 수 있다. 제어부는 사용자의 선택에 근거하여, 사용자의 전자기기기 상에 도15b의 리뷰 현황 페이지를 출력할 수 있다. 리뷰 현황 페이지에는 특정 기간(ex: 최근 1일, 최근 7일, 최근 30일 등)동안 사용자가 제공한 서비스에 대해 수집된 리뷰의 총 현황, 부정적인 리뷰 현황, 긍정적인 리뷰 현황 및 재방문 리뷰 현황 중 적어 도 하나가 출력될 수 있다. 나아가, 사용자는 그래프 영역을 선택(또는 클릭)함으로서, 본 발명에 따른 분석 시스템으로 도15c 의 리뷰 분석 페이지의 출력 요청을 전송할 수 있다. 제어부는 사용자의 선택에 근거하여, 전자기기상에 도15c의 리뷰 분석 페이지를 출력할 수 있다. 리 뷰 현황 페이지에는 특정 기간(ex: 최근 1일, 최근 7일, 최근 30일 등)동안 사용자가 제공한 서비스의 서 비스 요소(이용 품질, 서비스 절차, 직원 대응, 이용 환경, 가격 조건)에 대한 각각의 점수를 그래프로 출력될 수 있다. 리뷰 현황 페이지에는 서비스 요소에 대해, 전력 대응 방안(ex:이용 품질이 다른 서비스 요소에 비해 점수가 낮으므로, 이용 품질에 대해 신경을 쓰세요)을 출력할 수 있다. 나아가, 사용자는 고객 분석 영역 및 고객 유형 별 리뷰 영역 중 적어도 하나의 일 영역을 선택(또 는 클릭)함으로서, 본 발명에 따른 분석 시스템으로 도15d의 고객 유형 페이지의 출력 요청을 전송 할 수 있다. 제어부는 사용자의 선택에 근거하여, 전자기 상에 도15d의 고객 유형 페이지를 출력할 수 있다. 고 객 유형 페이지에는 고객 유형(ex: 블랙 컨슈머) 각각에 대한 페르소나 유형과 함께, 고객의 리뷰 데이터 를 분석한 상세한 내용이 출력될 수 있다. 예를 들어, 고객 유형 페이지에는 블랙 컨슈머 고객과 관련하 여, “대 초반의 여성으로서, 친절하지 않으면 흥분하고 부정 리뷰를 남기는 성향의 고객”임을 제시할 수 있다. 나아가, 사용자는 실시간 리뷰 평가 영역의 일 영역을 선택(또는 클릭)함으로서, 본 발명에 따른 분석 시 스템에 도15e의 실시간 리뷰 평가 페이지의 출력 요청을 전송할 수 있다. 제어부는 사용자의 선택에 근거하여, 전자기 상에 도15e의 실시간 리뷰 평가 페이지를 출력할 수 있 다. 실시간 리뷰 평가 페이지에는 실시간으로 업로드 되는 리뷰들이 출력될 수 있다. 위에서 살펴본 것과 같이, 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법 및 시스템은, 수집된 데이터 에 근거하여, 리뷰 데이터의 고객 유형을 페르소나 유형들 중 어느 하나로 특정할 수 있다. 이에 따라, 본 발명 은 특정 서비스에 대해 리뷰 데이터를 작성한 고객의 유형을 구체적으로 파악할 수 있다. 나아가, 본 발명은,고객의 나이, 직업, 성격과 개성, 특징, 취미, 사는 곳 등 개인 정보에서부터, 실제로 이러한 인물이 서비스를 이용할 때 고려하는 점, 서비스를 이용할 때 불편한 점 등의 구체적인 니즈를 예상할 수 있다. 나아가, 본 발명은, 리뷰 데이터의 고객 유형에 대한 보고서를 생성할 수 있다. 따라서, 사용자는 본 발명으로 부터 제공받은 보고서를 통해, 블랙 컨슈머의 악의적인 리뷰 작성을 사전에 방지하고, 단골 고객을 효율적으로 관리할 수 있으며, 고객 유형에 대응하여 적합한 마케팅을 진행할 수 있다."}
{"patent_id": "10-2021-0024105", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 시스템을 이용한 분석 방법을 설명하기 위한 개념도 이다. 도 2는 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 시스템을 설명하기 위한 개념도이다. 도 3은 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법을 설명하기 위한 흐름도이다. 도 4a 및 4b는 본 발명에 따른 페르소나 기반의 리뷰 데이터 분석 방법을 설명하기 위한 개념도이다. 도 5는 본 발명에 따른 데이터 수집을 설명하기 위한 개념도이다. 도 6a, 도 6b, 도 7, 도 8a, 도 8b, 도 9a, 및 도 9b 는 본 발명에 따른 평가 인자에 대응되는 정보를 설명하기 위한 개념도들이다. 도 10, 도 11, 도 12, 도 13, 및 도 14는 본 발명에 따른 리뷰 데이터의 고객 유형을 특정하는 방법을 설명하기 위한 개념도들이다. 도 15a, 도 15b, 도 15c, 도 15d 및 도 15e는 본 발명에 따른 보고서를 설명하기 위한 개념도들이다."}
