{"patent_id": "10-2020-0138937", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0054955", "출원번호": "10-2020-0138937", "발명의 명칭": "사용자 얼굴을 대상 얼굴로 교체하는 장치, 방법 및 컴퓨터 프로그램", "출원인": "주식회사 케이티", "발명자": "오동률"}}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 얼굴을 대상 얼굴로 교체하는 장치에 있어서,이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하는 메쉬 생성부;상기 생성된 타겟 메쉬를 경량화하는 경량화부;상기 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 상기 추출된 텍스쳐 데이터를 상기 경량화된 타겟 메쉬에매핑시키는 텍스쳐 매핑부;사용자 얼굴이 포함된 영상 데이터를 입력받는 영상 입력부; 및상기 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴과 상기 대상 얼굴을 교체하여 출력하는 출력부를 포함하는, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 타겟 메쉬에 대한 스케일 정보 및 포즈 정보를 산출하는 산출부를 더 포함하고, 상기 경량화부는 상기 산출된 스케일 정보 및 포즈 정보에 기초하여 소스 메쉬에 대해 강체 및 스케일의 변환을수행하고, 상기 강체 및 스케일이 변환된 소스 메쉬와 상기 타겟 메쉬 간의 동기화를 수행하고,상기 텍스쳐 매핑부는 상기 추출된 텍스쳐 데이터를 상기 타겟 메쉬와 동기화된 상기 소스 메쉬에 매핑시키는것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 경량화부는 상기 타겟 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터와 상기 소스 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터를 고려하여 상기 소스 메쉬와 상기타겟 메쉬 간의 동기화를 수행하는 것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 경량화부는 상기 타겟 메쉬에 대한 얼굴 주요 영역 및 얼굴 비주요 영역, 상기 타겟 메쉬에서 주변 버텍스와의 관계에 기초하여 비용 함수를 도출하고, 상기 도출된 비용 함수를 이용하여 상기 소스 메쉬와 상기 타겟 메쉬 간의 동기화를 수행하는 것인, 얼굴 교체장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0054955-3-제 4 항에 있어서, 상기 경량화부는 상기 타겟 메쉬를 구성하는 복수의 버텍스 중 상기 소스 메쉬의 일영역에 해당하는 버텍스의위치 정보 및 법선 벡터의 방향과 대응하는 버텍스를 이웃 버텍스로 선택하는 것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 경량화부는 상기 타겟 메쉬에 대한 얼굴 주요 영역에서 선택된 이웃 버텍스 및 상기 소스 메쉬의 일영역에해당하는 버텍스 간의 위치차 및 법선 벡터차에 기초하여 상기 타겟 메쉬에 대한 얼굴 주요 영역과 관련된 상기비용 함수의 비용값을 도출하는 것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서, 상기 경량화부는 상기 타겟 메쉬에 대한 얼굴 비주요 영역에서 선택된 이웃 버텍스 및 상기 소스 메쉬의 일영역에 해당하는 버텍스 간의 법선 벡터차에 기초하여 상기 타겟 메쉬에 대한 얼굴 비주요 영역과 관련된 상기 비용함수의 비용값을 도출하는 것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서, 상기 경량화부는 상기 소스 메쉬의 일영역에 해당하는 버텍스 및 상기 버텍스와 연결된 주변 버텍스 간의 위치차 및 회전각차에 기초하여 상기 타겟 메쉬에서 주변 버텍스와의 관계와 관련된 상기 비용 함수의 비용값을 도출하는 것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 상기 텍스쳐 매핑부는 상기 대상 얼굴의 특징점에 기초하여 UV 맵을 생성하고, 상기 경량화된 타겟 메쉬에 대해설정된 버텍스 인덱스에 기초하여 상기 생성된 UV 맵을 상기 경량화된 타겟 메쉬에 매핑시키는 것인, 얼굴 교체장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서, 상기 텍스쳐 매핑부는 상기 경량화된 타겟 메쉬의 버텍스 및 상기 대상 얼굴의 특징점 간의 거리를 산출하고,상기 산출된 거리에 기초하여 상기 대상 얼굴의 특징점 및 상기 특징점으로부터 최단거리에 위치한 상기 경량화된 타겟 메쉬의 버텍스를 페어로 결정하고,상기 결정된 페어를 이용하여 상기 UV 맵을 상기 경량화된 타겟 메쉬에 매핑시키는 것인, 얼굴 교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서, 공개특허 10-2022-0054955-4-상기 영상 데이터로부터 상기 사용자 얼굴의 표정을 리타겟팅하는 리타겟팅부를 더 포함하고,상기 출력부는 상기 리타겟팅된 사용자 얼굴의 표정 및 상기 경량화된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴을 상기 사용자 얼굴의 표정이 반영된 상기 대상 얼굴로 교체하여 출력하는 것인, 얼굴교체 장치."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교체하는 방법에 있어서,이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하는 단계;상기 생성된 타겟 메쉬를 경량화하는 단계;상기 이미지 데이터로부터 텍스쳐 데이터를 추출하는 단계;상기 추출된 텍스쳐 데이터를 상기 경량화된 타겟 메쉬에 매핑시키는 단계;사용자 얼굴이 포함된 영상 데이터를 입력받는 단계; 및상기 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴과 상기 대상 얼굴을 교체하여 출력하는 단계를 포함하는, 얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서, 상기 타겟 메쉬를 경량화하는 단계는,상기 타겟 메쉬에 대한 스케일 정보 및 포즈 정보를 산출하는 단계;상기 산출된 스케일 정보 및 포즈 정보에 기초하여 소스 메쉬에 대해 강체 및 스케일의 변환을 수행하는 단계; 상기 강체 및 스케일이 변환된 소스 메쉬와 상기 타겟 메쉬 간의 동기화를 수행하는 단계; 및상기 추출된 텍스쳐 데이터를 상기 타겟 메쉬와 동기화된 상기 소스 메쉬에 매핑시키는 단계를 포함하는 것인,얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 동기화를 수행하는 단계는,상기 타겟 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터와 상기 소스 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터를 고려하여 상기 소스 메쉬와 상기 타겟 메쉬 간의동기화를 수행하는 단계를 포함하는 것인, 얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서, 상기 동기화를 수행하는 단계는,상기 타겟 메쉬에 대한 얼굴 주요 영역 및 얼굴 비주요 영역, 상기 타겟 메쉬에서 주변 버텍스와의 관계에 기초공개특허 10-2022-0054955-5-하여 비용 함수를 도출하는 단계; 및 상기 도출된 비용 함수를 이용하여 상기 소스 메쉬와 상기 타겟 메쉬 간의 동기화를 수행하는 단계를 포함하는것인, 얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서, 상기 동기화를 수행하는 단계는,상기 타겟 메쉬를 구성하는 복수의 버텍스 중 상기 소스 메쉬의 일영역에 해당하는 버텍스의 위치 정보 및 법선벡터의 방향과 대응하는 버텍스를 이웃 버텍스로 선택하는 단계를 포함하는 것인, 얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 상기 동기화를 수행하는 단계는,상기 타겟 메쉬에 대한 얼굴 주요 영역에서 선택된 이웃 버텍스 및 상기 소스 메쉬의 일영역에 해당하는 버텍스간의 위치차 및 법선 벡터차에 기초하여 상기 타겟 메쉬에 대한 얼굴 주요 영역과 관련된 상기 비용 함수의 비용값을 도출하는 단계;상기 타겟 메쉬에 대한 얼굴 비주요 영역에서 선택된 이웃 버텍스 및 상기 소스 메쉬의 일영역에 해당하는 버텍스 간의 법선 벡터차에 기초하여 상기 타겟 메쉬에 대한 얼굴 비주요 영역과 관련된 상기 비용 함수의 비용값을도출하는 단계; 및 상기 소스 메쉬의 일영역에 해당하는 버텍스 및 상기 버텍스와 연결된 주변 버텍스 간의 위치차 및 회전각차에기초하여 상기 타겟 메쉬에서 주변 버텍스와의 관계와 관련된 상기 비용 함수의 비용값을 도출하는 단계를 포함하는 것인, 얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12 항에 있어서, 상기 타겟 메쉬에 매핑시키는 단계는,상기 대상 얼굴의 특징점에 기초하여 UV 맵을 생성하고, 상기 경량화된 타겟 메쉬에 대해 설정된 버텍스 인덱스에 기초하여 상기 생성된 UV 맵을 상기 경량화된 타겟 메쉬에 매핑시키는 것인, 얼굴 교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12 항에 있어서, 상기 영상 데이터로부터 상기 사용자 얼굴의 표정을 리타겟팅하는 단계;상기 리타겟팅된 사용자 얼굴의 표정 및 상기 경량화된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴을 상기 사용자 얼굴의 표정이 반영된 상기 대상 얼굴로 교체하여 출력하는 단계를 포함하는 것인, 얼굴교체 방법."}
{"patent_id": "10-2020-0138937", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "사용자 얼굴을 대상 얼굴로 교체하는 명령어들의 시퀀스를 포함하는 매체에 저장된 컴퓨터 프로그램에 있어서, 공개특허 10-2022-0054955-6-상기 컴퓨터 프로그램은 컴퓨팅 장치에 의해 실행될 경우, 이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하고,상기 생성된 타겟 메쉬를 경량화하고,상기 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 상기 추출된 텍스쳐 데이터를 상기 경량화된 타겟 메쉬에 매핑시키고,사용자 얼굴이 포함된 영상 데이터를 입력받고,상기 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴과 상기 대상 얼굴을 교체하여 출력하도록 하는 명령어들의 시퀀스를 포함하는, 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "사용자 얼굴을 대상 얼굴로 교체하는 장치는 이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하는 메 쉬 생성부, 상기 생성된 타겟 메쉬를 경량화하는 경량화부, 상기 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 상기 추출된 텍스쳐 데이터를 상기 경량화된 타겟 메쉬에 매핑시키는 텍스쳐 매핑부, 사용자 얼굴이 포함된 영상 데이터를 입력받는 영상 입력부 및 상기 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴과 상기 대상 얼굴을 교체하여 출력하는 출력부를 포함한다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 얼굴을 대상 얼굴로 교체하는 장치, 방법 및 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "딥페이크(deepfake) 기술이란 인공지능 기술을 활용하여 기존에 존재하는 인물의 얼굴이나 특정 부위를 영화의 CG 처리처럼 합성한 영상 편집물을 의미한다. 딥페이크 기술은 합성하려는 인물의 얼굴이 주로 나오는 고화질 의 동영상을 딥러닝을 통해 학습함으로써, 대상이 되는 동영상을 프레임 단위로 합성시킨다. 이러한 딥페이크 기술을 이용하여 합성하려는 인물의 얼굴로 교체(face swap)를 구현하는 기술과 관련하여, 선 행기술인 한국공개특허 제 2017-0109851호는 가려짐과 음영 기반의 화상 얼굴 교체 장치 및 방법을 개시하고 있 다. 딥페이크 기술은 예를 들어 GAN(적대 신경망, Generative Adversarial Network) 딥러닝 알고리즘을 이용한다. GAN은 진짜 같은 가짜를 생성하는 모델과 이에 대한 진위를 판별하는 모델 간의 경쟁을 통해 진짜 같은 가짜 이 미지를 생성한다. 그러나 GAN은 고성능의 GPU(Graphic Processing Unit)와 방대한 양의 2D 이미지 데이터베이스 및 장시간의 학습 수행 시간이 요구됨에 따라 모바일 단말에서 실시간으로 얼굴 교체 서비스를 제공받는데 어려움이 따른다는 단 점을 가지고 있다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하고, 생성된 타겟 메쉬를 경량화하여, 이미지 데이 터로부터 텍스쳐 데이터를 추출하고, 추출된 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시키는 얼굴 교체 장치, 방법 및 컴퓨터 프로그램을 제공하고자 한다. 사용자 얼굴이 포함된 영상 데이터를 입력받고, 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 영상 데이터에서 사용자 얼굴과 대상 얼굴을 교체하여 출력하는 얼굴 교체 장치, 방법 및 컴퓨터 프로그램을 제공하고자 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 수단으로서, 본 발명의 일 실시예는, 이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하는 메쉬 생성부, 상기 생성된 타겟 메쉬를 경량화하는 경량화부, 상기 이미지 데이터로 부터 텍스쳐 데이터를 추출하고, 상기 추출된 텍스쳐 데이터를 상기 경량화된 타겟 메쉬에 매핑시키는 텍스쳐 매핑부, 사용자 얼굴이 포함된 영상 데이터를 입력받는 영상 입력부 및 상기 텍스쳐 데이터가 매핑된 타겟 메쉬 에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴과 상기 대상 얼굴을 교체하여 출력하는 출력부를 포함하는얼굴 교체 장치를 제공할 수 있다. 본 발명의 다른 실시예는, 이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하는 단계, 상기 생성된 타겟 메쉬를 경량화하는 단계, 상기 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 상기 추출된 텍스쳐 데이 터를 상기 경량화된 타겟 메쉬에 매핑시키는 단계, 사용자 얼굴이 포함된 영상 데이터를 입력받는 단계 및 상기 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사용자 얼굴과 상기 대상 얼굴을 교 체하여 출력하는 단계를 포함하는 얼굴 교체 방법을 제공할 수 있다. 본 발명의 또 다른 실시예는, 컴퓨터 프로그램은 컴퓨팅 장치에 의해 실행될 경우, 이미지 데이터에 포함된 대 상 얼굴에 대한 타겟 메쉬를 생성하고, 상기 생성된 타겟 메쉬를 경량화하고, 상기 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 상기 추출된 텍스쳐 데이터를 상기 경량화된 타겟 메쉬에 매핑시키고, 사용자 얼굴이 포함 된 영상 데이터를 입력받고, 상기 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 상기 영상 데이터에서 상기 사 용자 얼굴과 상기 대상 얼굴을 교체하여 출력하도록 하는 명령어들의 시퀀스를 포함하는 매체에 저장된 컴퓨터 프로그램을 제공할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본 발명을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 기재된 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 종래에 딥페이크 기술을 이용하여 사용자 얼굴과 기 존 인물의 얼굴과 얼굴 교체(face swap)를 수행하고자 하는 경우, 기존 인물의 얼굴과 관련된 다양한 2D 이미지 에 대한 장시간의 학습 시간이 요구되었으나, 본 발명은 기존 인물의 얼굴과 관련된 2D 이미지로부터 경량화된 타겟 메쉬를 생성하여 기존 인물의 얼굴을 학습하는데 소요되는 시간을 감소시키도록 하는 얼굴 교체 장치, 방 법 및 컴퓨터 프로그램을 제공할 수 있다. 기존 인물의 얼굴과 관련된 타겟 메쉬를 기정의된 소스 메쉬를 이용하여 경량화시켜 빠르게 사용자의 얼굴과 기 존 인물의 얼굴이 교체되도록 함으로써, 실시간으로 이루어지는 얼굴 교체 서비스를 통해 사용자로 재미를 느낄 수 있도록 하는 얼굴 교체 장치, 방법 및 컴퓨터 프로그램을 제공할 수 있다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말 또는 디 바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말 또는 디바이스에서 수행될 수도 있다. 이하 첨부된 도면을 참고하여 본 발명의 일 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 얼굴 교체 장치의 구성도이다. 도 1을 참조하면, 얼굴 교체 장치는 메쉬 생성부, 산출부, 경량화부, 텍스쳐 매핑부, 영상 입력부, 리타겟팅부 및 출력부를 포함할 수 있다. 메쉬 생성부는 이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬(target mesh)를 생성할 수 있다. 예 를 들어, 메쉬 생성부는 이미지 데이터에 포함된 대상 얼굴의 랜드마크 영역에 기초하여 고해상도의 타겟 메쉬를 생성할 수 있다. 예를 들어, 타겟 메쉬를 구성하는 약 40,000개의 버텍스는 각 버텍스 마다 버텍스 인 덱스가 부여된 것일 수 있다. 산출부는 타겟 메쉬에 대한 스케일 정보 및 포즈 정보를 산출할 수 있다. 예를 들어, 산출부는 타겟 메쉬의 크기와 관련된 스케일 정보 및 타겟 메쉬의 위치와 회전 각도와 관련된 포즈 정보를 산출할 수 있다. 경량화부는 산출된 스케일 정보 및 포즈 정보에 기초하여 소스 메쉬에 대해 강체 및 스케일의 변환을 수행 할 수 있다. 예를 들어, 소스 메쉬(source mesh)는 경량화된 버텍스의 수(예를 들어, 약 1,000개의 버텍스)로 구성되도록 기정의된 저해상도 메쉬일 수 있다. 예를 들어, 경량화부는 산출된 스케일 정보에 기초하여 소스 메쉬의 크기가 조절되도록 스케일의 변환을 수행하고, 산출된 포즈 정보에 기초하여 소스 메쉬가 회전 및 이동되도록 강체 변환을 수행할 수 있다. 경량화부는 강체 및 스케일이 변환된 소스 메쉬와 타겟 메쉬 간의 동기화를 수행함으로써 타겟 메쉬를 경 량화할 수 있다. 소스 메쉬는 개발자가 선택한 토폴로지(topology)에 대응하는 얼굴 형태의 메쉬가 정의된 것 일 수 있다. 토폴로지의 요소에는 버텍스의 수, 얼굴 리스트(face list), 텍스쳐 코디네이트(texture coordinate) 등이 포함될 수 있다. 소스 메쉬는 선택된 토폴로지 요소에 기초하여 3D 그래픽 디자이너에 의해 제작되어 이용될 수도 있고, 기존에 존재하는 얼굴 메쉬가 각 목적에 따라 그대로 이용될 수도 있다. 여기서, 소스 메쉬는 개발자에 의해 얼굴을 표현하는데 충분하다고 판단되는 경우, 어떤 얼굴의 메쉬도 이용가능하며, 별도의 제약 사항이 없다. 따라서, 소스 메쉬는 각 개발자의 의도에 대응하는 얼굴 메쉬가 소스 메쉬로 설정될 수 있다. 이하에서는, 소스 메쉬 및 타겟 메쉬 간의 동기화에 앞서 소스 메쉬에 대해 강체 및 스케일의 변환을 수행하는 과정에 대해서는 도 2 내지 도 3c를 통해 설명하도록 한다. 도 2는 본 발명의 일 실시예에 따른 이미지 데이터를 도시한 예시적인 도면이다. 도 2를 참조하면, 이미지 데 이터는 연예인, 정치인, 스포츠 스타와 같이 유명인의 얼굴을 포함하는 데이터일 수 있다. 이미지 데이터는 사 용자에 의해 교체하고자 하는 대상 얼굴로 선택받은 경우, 이미지 데이터에 포함된 대상 얼굴로부터 생성된 타 겟 메쉬에 기초하여 사용자 얼굴과 대상 얼굴 간의 교체가 이루어지는데 이용될 수 있다. 도 3a 내지 도 3c는 본 발명의 일 실시예에 따른 소스 메쉬의 강체 및 스케일을 변환하는 과정을 설명하기 위한 예시적인 도면이다. 도 3a를 참조하면, 타겟 메쉬는 40,000개의 버텍스의 수로 구성된 고해상도의 메쉬이고, 소스 메쉬는 경량화된 약 1,000개의 버텍스의 수로 구성된 기정의된 저해상도 메쉬일 수 있다. 산출부는 타겟 메쉬에 대한 스케일 정보를 산출하고, 경량화부는 산출된 스케일 정보에 기초하 여 소스 메쉬에 대해 스케일의 변환을 수행할 수 있다. 이러한 과정을 통해, 타겟 메쉬의 얼굴 크기 및 소스 메쉬의 얼굴 크기가 각각 다르므로, 스케일 정 보에 기초하여 타겟 메쉬의 얼굴 크기가 소스 메쉬의 얼굴 크기에 대응되도록 스케일과 관련된 변환 을 수행할 수 있다. 또한, 산출부는 타겟 메쉬에 대한 포즈 정보를 산출하고, 경량화부는 산출된 포즈 정보에 기초 하여 소스 메쉬에 대해 강체 변환을 수행할 수 있다. 이러한 과정을 통해, 타겟 메쉬의 얼굴의 위치 및 각도 및 소스 메쉬의 얼굴의 위치 및 각도가 각각 다르므로, 포즈 정보에 기초하여 타겟 메쉬의 얼굴의 위치 및 각도가 소스 메쉬의 얼굴의 위치 및 각 도에 대응되도록 회전 및 이동과 관련된 변환을 수행할 수 있다. 이후, 경량화부는 타겟 메쉬의 랜드마크 영역 및 소스 메쉬의 랜드마크 영역에 기초하여 타겟 메쉬 및 소스 메쉬에 대한 접합을 수행할 수 있다. 이 경우, 타겟 메쉬 및 소스 메쉬(31 0)에 대한 접합이 수행된 후에는, 랜드마크 영역을 기준으로 타겟 메쉬 및 소스 메쉬의 각 메쉬 가 같은 위치에 있도록 정렬되므로 타겟 메쉬에 대한 경량화를 진행할 수 있다. 도 3b를 참조하면, 타겟 메쉬 및 소스 메쉬가 랜드마크 영역에 기초하여 접합된 상태를 도시한 예시적인 도면이다. 도 3c를 참조하면, 타겟 메쉬 및 타겟 메쉬의 스케일 정보 및 포즈 정보에 기초하여 강체 변환 및 스 케일 변환이 수행된 타겟 메쉬를 비교한 예시적인 도면이다. 여기서, 강체 변환 및 스케일 변환이 수행된 타겟 메쉬는 얼굴 교체 장치의 화면을 통해 출력되도록 메쉬의 위치 및 각도가 변형된 것일 수 있다. 다시 도 1로 돌아와서, 경량화부는 생성된 타겟 메쉬를 경량화할 수 있다. 예를 들어, 경량화부는 타겟 메쉬에 대한 얼굴 주요 영역 및 얼굴 비주요 영역, 타겟 메쉬에서 주변 버텍스와의 관계에 기초하여 비용 함수를 도출하고, 도출된 비용 함수를 이용하여 소스 메쉬와 타겟 메쉬 간의 동기화를 수행할 수 있다. 여기서, 얼굴 주요 영역은 눈썹, 눈, 코, 입, 얼굴형, 팔자주름 등을 포함하고, 얼굴 비주요 영역은 얼굴 주요 영역을 제외한 나머지 영역을 나타낼 수 있다. 비용 함수는 타겟 메쉬에 대한 얼굴 주요 영역 및 얼굴 비주요 영역, 타겟 메쉬에서 주변 버텍스와의 관계 각각 의 에너지 식들의 가중치의 합으로 도출될 수 있다. 비용 함수는 예를 들어, 다음의 수학식 1을 통해 도출될 수 있다. 수학식 1"}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1을 참조하면, L(i)는 랜드마크 영역에 해당하는 버텍스들을 의미하며, Elandmark(i)는 (소스 메쉬의 랜드 마크 영역의 위치와 타겟 메쉬의 랜드마크 영역의 위치 간의 차이)+(소스 메쉬의 랜드마크 영역의 표면 법선 방 향과 타겟 메쉬의 랜드마크 영역의 표면 법선 방향 간의 차이)를 나타내고, A는 대상 얼굴의 모든 영역을 나타 내고, R은 눈/코/입 영역을 나타내고, A/R은 눈/코/입 영역을 제외한 나머지 영역을 나타내는 것일 수 있다. 여기서, 경량화부는 타겟 메쉬에 대한 얼굴 주요 영역인 Elandmark(i)와 ENNC(i)에 대해서는 큰 가중치가 부여 되도록 하고, 얼굴 비주요 영역인 ENNN(i)와 주변 버텍스와의 관계를 나타내는 Eneighbor(k)에 대해서는 비교적 적 은 가중치가 부여되도록 할 수 있다. 이 때, 비용 함수는 동기화의 반복 횟수가 증가할수록 점점 감소되도록 하는 가중치를 적용하여 변형의 영향이 미미해지도록 설계될 수 있다. 타겟 메쉬를 경량화하기 위해 타겟 메쉬에 대한 얼굴 주요 영역 및 얼굴 비주요 영역, 타겟 메쉬에서 주변 버텍 스와의 관계에 기초하여 비용 함수의 비용값을 도출하여 소스 메쉬와 타겟 메쉬 간의 동기화를 수행하는 과정에 대해서는 도 4a 내지 도 4e를 통해 상세히 설명하도록 한다. 도 4a 내지 도 4e는 본 발명의 일 실시예에 따른 소스 메쉬와 타겟 메쉬 간의 동기화를 통해 타겟 메쉬를 경량 화하는 과정을 설명하기 위한 예시적인 도면이다. 도 4a를 참조하면, 도 3b에서 소스 메쉬 및 타겟 메쉬가 접합된 상태의 소스 메쉬의 버텍 스들 및 타겟 메쉬의 버텍스들을 나타낸 것으로, 소스 메쉬의 버텍스들의 위치와 타겟 메쉬의 버텍스들의 위치가 일치하지 않으며, 소스 메쉬 및 타겟 메쉬 간의 간극이 존재하는 것을 확인할 수 있다. 도 4b를 참조하면, 경량화부는 타겟 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터와 소스 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터를 고려하여 소 스 메쉬와 타겟 메쉬 간의 동기화를 수행할 수 있다. 여기서, 타겟 메쉬의 랜드마크 영역은 2 차원 이미지 데이터에서 결정된 랜드마크 영역과 대응되는 버텍스 인덱스를 통해 결정될 수 있다. 랜드마크 영 역은 대상 얼굴을 객관적인 수치로 나타낼 수 있는 중요 팩트에 해당하며, 2차원 이미지 데이터에서 결정된 랜 드마크 영역은 소스 메쉬를 정의하면서 함께 정의될 수도 있다. 이를 위해, 경량화부는 타겟 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡 터와 소스 메쉬의 랜드마크 영역에 위치하는 버텍스에 대한 위치 정보 및 법선 벡터에 기초하여 랜드마크 영역에 대한 비용 함수의 비용값을 도출할 수 있다. 랜드마크 영역에 대한 비용 함수의 비용값은 예를 들어, 다음의 수학식 2를 통해 도출될 수 있다. 수학식 2"}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2를 참조하면, Elandmark(i)는 타겟 메쉬에 대한 얼굴 주요 영역과 관련된 비용 함수의 비용값을 나타 내고, Position(source(i)-target(i))는 타겟 메쉬의 랜드마크 영역에 위치하는 버텍스 및 소스 메쉬의 랜드마크 영역에 위치한느 버텍스 간의 위치차를 나타내고, NormalVector(source(i)-target(i))는 타겟 메쉬(41 0)의 랜드마크 영역에 위치하는 버텍스의 법선 벡터와 소스 메쉬의 랜드마크 영역에 위치하는 버텍스 의 법선 벡터 간의 법선 벡터차를 나타내는 것일 수 있다. 여기서, 비용 함수의 비용값은 소스 메쉬(40 0)와 타겟 메쉬 간의 랜드마크 영역에 상응하는 버텍스 인덱스 사이의 위치차 및 법선 벡터차가 감소되는 방향으로 정의될 수 있다. 경량화부는 소스 메쉬와 타겟 메쉬 간의 버텍스에 대한 위치차의 회귀(regression) 및 법선 벡 터의 방향을 동기화시킬 수 있다. 이 때, 위치에 대한 체크 및 법선 벡터의 방향에 대한 체크는 순 차적으로 진행될 수도 있으며, 비용 함수에 의해 일괄적으로 처리될 수도 있다. 도 4c를 참조하면, 경량화부는 타겟 메쉬의 얼굴 주요 영역 및 얼굴 비주요 영역에 대해 타겟 메쉬 의 버텍스 및 소스 메쉬의 버텍스 간의 관계성을 나타내는 연결선에 기초하여 비용 함수의 비용 값을 도출할 수 있다. 얼굴 주요 영역은 타겟 메쉬의 대상 얼굴을 그대로 표현하기 위해 소스 메쉬 및 타겟 메쉬의 관 계성에 기초하여 버텍스 간의 위치가 최대한으로 대응되도록 비용 함수의 비용값이 구성될 수 있다. 이와 달리, 얼굴 비주요 영역은 전체적인 성능을 위해 법선 벡터의 방향만을 고려함으로써, 전체적인 굴곡만을 고려 하여 대상 얼굴과의 닮음도를 높이도록 비용 함수의 비용값이 구성될 수 있다. 소스 메쉬와 타겟 메쉬 간의 관계성 연결을 위한 비용값은 변형될 소스 메쉬의 토폴로지 (topology)를 기준으로 적용될 수 있다. 즉, 소스 메쉬에 대해 영역을 구분하여 비용 함수가 적용되는데, 여기서 기준은 관계성을 높게 유지해야 하는 버텍스 영역과 그보다 낮은 관계성을 유지해도 무방한 영역으로 나 누어 적용될 수 있다. 경량화부는 타겟 메쉬를 구성하는 복수의 버텍스 중 소스 메쉬의 일영역에 해당하는 특정 버텍스의 위치 정보 및 법선 벡터의 방향과 대응하는 버텍스를 이웃 버텍스로 선택할 수 있다. 이는, 소스 메쉬와 타겟메쉬 간의 관계성을 획득하기 위한 것으로, 이웃 버텍스는 소스 메쉬 및 타겟 메쉬가 접합된 후, 타겟 메쉬를 구성하는 복수의 버텍스 중 소스 메쉬의 버텍스와 위치 및 법선 벡터의 방향이 가장 유사한 버텍스가 이웃 버텍스로 선택될 수 있다. 이하에서는, 타겟 메쉬의 얼굴 주요 영역에 대한 비용 함수의 비용값을 도출하는 과정에 대해 먼저 설명하 도록 한다. 경량화부는 소스 메쉬의 일영역에 해당하는 특정 버텍스 및 타겟 메쉬에 대한 얼굴 주요 영역에 서 특정 버텍스의 위치에 기초하여 선택된 이웃 버텍스 및 간의 위치차 및 법선 벡터차에 기초하여 타겟 메쉬 에 대한 얼굴 주요 영역과 관련된 비용 함수의 비용값을 도출할 수 있다. 이 때, 경량화부는 타겟 메쉬의 얼굴 주요 영역에 대해 대상 얼굴이 그대로 표현되도록 하기 위해, 소스 메쉬와 타겟 메쉬 간의 관계성을 나타내는 연결선의 위치가 최대한 대응되도록 하여 비용 값을 도출할 수 있다. 얼굴 주요 영역에 대한 관계성을 고려하여 도출되는 비용값은 예를 들어, 다음의 수학식 3을 통해 도출될 수 있다. 수학식 3"}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3을 참조하면, Position(source(i)-target(inn))는 소스 메쉬의 일영역에 해당하는 특정 버텍스(vertex i) 및 타겟 메쉬에 대한 얼굴 주요 영역에서 특정 버텍스에 기초하여 선택된 이웃 버텍스 간의 위치차를 나타 내고, NormalVector(source(i)-target(inn))는 소스 메쉬의 일영역에 해당하는 특정 버텍스(vertex i) 및 타겟 메 쉬에 대한 얼굴 주요 영역에서 특정 버텍스에 기초하여 선택된 이웃 버텍스 간의 법선 벡터차를 나타낼 수 있다. 이하에서는, 타겟 메쉬의 얼굴 비주요 영역에 대한 비용 함수의 비용값을 도출하는 과정에 대해 먼저 설명 하도록 한다. 경량화부는 타겟 메쉬에 대한 얼굴 비주요 영역에서 선택된 이웃 버텍스 및 소스 메쉬의 일영역 에 해당하는 버텍스 간의 법선 벡터차에 기초하여 타겟 메쉬에 대한 얼굴 비주요 영역과 관련된 비용 함수 의 비용값을 도출할 수 있다. 여기서, 얼굴 비주요 영역은 얼굴 주요 영역인 눈, 코, 입 영역 등을 제외한 나 머지 영역을 의미하며, 소스 메쉬의 정의 시 함께 정의될 수 있다. 얼굴 비주요 영역은 개발자에 의해 확 장 또는 축소될 수 있으며, 버텍스 인덱스를 통해 지정된 후, 지정된 버텍스 인덱스를 통해 파라미터화되어 저 장될 수 있다. 얼굴 비주요 영역에 대한 대응 관계를 고려한 비용 함수의 비용값은 예를 들어, 다음의 수학식 4를 통해 도출될 수 있다. 수학식 4"}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4를 참조하면, NormalVector(source(i)-target(inn))는 소스 메쉬의 일영역에 해당하는 특정 버텍스(vertex i) 및 타겟 메쉬에 대한 얼굴 비주요 영역에서 선택된 이웃 버텍스 간의 법선 벡터차를 나타낼 수 있다. 여기서, 타겟 메쉬와 소스 메쉬는 랜드마크 영역을 기준으로 포즈 및 스케일의 변환을 통해 접합된 후, 소스 메쉬 및 타겟 메쉬 간의 가장 유사한 이웃 버텍스가 선택될 수 있다. 여기서, 이웃 버텍스 선택 알고리즘은 일반적으로 사용되는 알고리즘이 이용될 수 있으며, 같은 목적의 다른 알고리즘이 이용될 수도 있다. 이와 같이, 타겟 메쉬의 얼굴 주요 영역 및 얼굴 비주요 영역으로 구분하여 동기화를 진행하는 이유는 종 래의 타겟 메쉬의 경우 고해상도 메쉬로 구성됨에 따라 닮음도가 상승하지만, 연산량이 많아짐에 따라 리 타겟팅과 같이 응용 처리에서 성능이 저하된다는 단점을 갖는다. 따라서, 본원은 닮음도가 가장 중요한 영역인 눈, 코, 입에 해당하는 얼굴 주요 영역 및 나머지에 해당하는 얼 굴 비주요 영역으로 구분하여 동기화를 진행함으로써, 닮음도를 유지하면서 리타겟팅과 같은 응용 처리에서도 실시간으로 얼굴 교체 서비스를 제공하도록 할 수 있다. 즉, 눈, 코, 입 등과 같은 얼굴 주요 영역은 대상 인물의 특징을 정확하게 나타내야 하는 부분이므로, 고해상도 의 타겟 메쉬의 얼굴 닮음도를 위해 관계성을 높게 유지해야 하는 랜드마크 영역에 해당할 수 있다. 따라 서, 경량화부는 이웃 버텍스 선택 알고리즘(nearest neighbor algorithm)을 이용하여 소스 메쉬의 눈, 코, 입 등의 랜드마크 영역에 해당하는 버텍스로부터 타겟 메쉬의 눈, 코, 입 영역의 얼굴 주요 영역 으로부터 가장 가까운 버텍스를 이웃 버텍스로 선택하고, 매칭되는 소스 메쉬의 특정 버텍스와 타겟 메쉬 의 이웃 버텍스 간의 위치차 및 법선 벡터차를 이용하여 모든 버텍스에 대해 관계성을 높게 유지하도록 할 수 있다. 이와 달리, 눈, 코, 입 등을 제외한 나머지 영역에 해당하는 얼굴 비주요 영역은 얼굴 주요 영역보다는 낮은 관 계성을 유지해도 되므로, 경량화부는 소스 메쉬와 타겟 메쉬 간의 전체적인 굴곡만을 일치시킬 수 있다. 예를 들어, 경량화부는 이웃 버텍스 선택 알고리즘을 이용하여 소스 메쉬의 특정 버텍스 (vertex i)와 타겟 메쉬의 복수의 버텍스 중 특정 버텍스와 가장 가까운 버텍스를 이웃 버텍스를 선택하고, 매칭되는 소스 메쉬의 특정 버텍스와 타겟 메쉬의 이웃 버텍스 간의 법선 벡터차만을 이용 하여 전체적인 굴곡을 일치시킬 수 있다. 만약, 얼굴 주요 영역 및 얼굴 비주요 영역을 구분하지 않은 경우, 높은 관계성을 위한 비용값만이 고려되므로, 고해상도의 타겟 메쉬와 저해상도의 소스 메쉬 간의 토폴로지(topology)가 다르고, 버텍스의 수가 다 르므로, 관계성만을 높이기 위한 주변 버텍스 간의 움직임에 따라 메쉬가 구부러지거나, 서로 순서가 바뀌는 등 의 뒤틀리는 경우가 발생할 수 있으므로, 메쉬를 이용한 리타겟팅 또는 모바일에서의 실시간 서비스가 제공될 수 없게 된다. 도 4d를 참조하면, 경량화부는 소스 메쉬의 일영역에 해당하는 버텍스 및 버텍스와 연결된 주변 버텍 스 간의 위치차 및 회전각차에 기초하여 타겟 메쉬에서 주변 버텍스와의 관계와 관련된 비용 함수의 비용 값을 도출할 수 있다. 여기서, 제 1 버텍스의 이웃 영역은 해당 버텍스와 연결된 제 2 버텍스가 존 재하는 영역을 의미할 수 있다. 수학식 1 중 주변 버텍스와의 관계 부분을 참조하면, Eneighbor(k)에서 N(i)는 소스 메쉬에서 특정 버텍스 (vertex i)의 이웃 영역을 의미할 수 있다. 여기서, 이웃 영역은 현재 버텍스에서 연결된 주변의 버텍스들이 존재하는 영역을 의미할 수 있다. Eneighbor(k)는 소스 메쉬의 영역 내에서의 비용값을 도출할 수 있다. 만약, Eneighbor(k)에 대한 비용값이 없는 경우, 타겟 메쉬의 모양만 맞추려고 함으로써, 소스 메쉬 내의 버텍스들 간의 연결적인 강건함이 떨 어지게 되어 소스 메쉬가 안정적으로 일정하게 변형되지 않을 수 있다. 이를 위해, Eneighbor(k)는 소스 메쉬의 모든 버텍스에 적용되도록 함과 동시에, 주변 버텍스와 위치의 이동 및 회전각이 비슷하게 유지되면서, 소스 메쉬가 변형되도록 정의될 수 있다. 주변 버텍스와의 관계와 관 련된 비용 함수의 비용값은 예를 들어, 다음의 수학식 5를 통해 도출될 수 있다. 수학식 5"}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수학식 5를 참조하면, Position(source(k)-source(k인접버텍스))는 변형된 버텍스와 연결된 이웃 버텍스 간의 위치차를 나 타내고, 법선angle(source(k)-source(k인접버텍스))는 변형된 버텍스와 연결된 이웃 버텍스 간의 회전각차를 나타낼 수 있 다. 이러한 과정을 통해, 변형되는 소스 메쉬를 타겟 메쉬에 맞춰지도록 억지로 변형시키기 보다는 소스 메쉬의 토폴로지와 버텍스의 연결성 및 강건함이 유지되도록 하면서 변형시킬 수 있다는 장점을 갖는다. 또한, 버텍스의 연결성을 위해 인접 버텍스 간의 메쉬의 변형시에 이루어지는 위치의 이동과 법선 벡터의 회전 에 대한 동기화도 중요하다. 따라서, 변형 과정 중 변형되는 버텍스의 위치와 법선 벡터의 회전 정보를 인접 버텍스에 적용함으로써, 유사하게 변형되도록 비용값이 정의될 수 있다. 도 4e를 참조하면, 소스 메쉬와 타겟 메쉬 간의 동기화가 이루어지는 과정을 도시한 것으로, 동기화 진행을 통해 랜드마크 영역에서의 Elandmark(i)에 대한 변형 및 얼굴 비주요 영역(ENNN(i))에서의 변형, 눈, 코, 입 등을 포함하는 얼굴 주요 영역(ENNC(i)) 영역에 대하여 각각 다른 비용값을 사용함으로써, 동기화 완료 를 통해 닮음도를 유지하면서도 리타겟팅과 같은 응용 처리가 가능하도록 하는 경량화된 타겟 메쉬를 생성할 수 있다. 다시 도 1로 돌아와서, 텍스쳐 매핑부는 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 추출된 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시킬 수 있다. 텍스쳐 매핑부는 추출된 텍스쳐 데이터를 타겟 메쉬와 동기화된 소스 메쉬에 매핑시킬 수 있다. 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시키는 과정에 대해서는 도 5a 내지 도 5e를 통해 상세히 설명하도 록 한다. 도 5a 내지 도 5e는 본 발명의 일 실시예에 따른 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시키는 과정을 설 명하기 위한 예시적인 도면이다. 도 5a를 참조하면, 텍스쳐 매핑부는 이미지 데이터의 특징점에 기초하여 경량화된 타겟 메쉬의 영역 에 맵핑될 이미지를 2차원 이미지의 형태로 추출할 수 있다. 텍스쳐 매핑부는 대상 얼굴의 특징점에 기초하여 UV 맵을 생성할 수 있다. 여기서, UV 맵이란 추출된 텍스쳐를 UV 좌표로 가로(U), 세로(V) 또는 둘을 조합한 방향으로 움직여 애니메이션이 일어나는 것처럼 생성하는 것을 의미한다. 예를 들어, 텍스쳐 매핑부는 대상 얼굴의 특징점에 기초하여 콘벡스 훌(convex hull)을 생성한 후, 삼각화하여 UV 맵을 생성할 수 있다. 텍스쳐 매핑부는 경량화된 타겟 메쉬에 대해 설정된 버텍스 인덱스에 기초하여 생성된 UV 맵을 경량 화된 타겟 메쉬에 매핑시킬 수 있다. 예를 들어, 텍스쳐 매핑부는 타겟 메쉬에 대해 기설정된 버텍스 인 덱스에 기초하여 UV 맵의 특정 영역을 매핑시킬 수 있다. 이 때, 경량화된 타겟 메쉬는 이산적인 점들이 모여 이루어진 것이고, 기설정된 버텍스 인덱스 또한 점이므로, 점의 영역에 따라 UV 맵이 이미지 데이터보다 확장되거나, 감축되는 등의 왜곡이 발생되고, 깊이값을 고려 하지 않아 UV 맵이 경량화된 타겟 메쉬에 매핑되는 위치가 정확하지 않는 등의 오류가 발생한다는 단점을 가지고 있다. 이러한 점을 개선하기 위해, 텍스쳐 매핑부는 경량화된 타겟 메쉬의 버텍스 및 대상 얼굴의 특징점 간의 거리를 산출할 수 있다. 예를 들어, 텍스쳐 매핑부는 이미지 데이터에 포함된 대상 얼굴의 특징점과 평면 에 투영된 경량화된 타겟 메쉬의 버텍스 간의 거리를 유클리디언 거리로 산출할 수 있다. 텍스쳐 매핑부는 산출된 거리에 기초하여 대상 얼굴의 특징점 및 특징점으로부터 최단거리에 위치한 경량 화된 타겟 메쉬의 버텍스를 페어로 결정하고, 결정된 페어를 이용하여 UV 맵을 경량화된 타겟 메쉬에 매핑시킬 수 있다. 도 5b를 참조하면, 이산적인 점들로 구성된 타겟 메쉬 및 점으로 구성된 기설정된 버텍스 인덱스가 미리 페어로 결정된 경우, 점의 영역에 의해 확장되거나 감축된 타겟 메쉬의 버텍스 영역에 2차원의 이미지 데이터를 억지로 맞추게 됨으로써, 왜곡이 발생하는 것을 확인할 수 있다. 이와 달리, 대상 얼굴의 특징점 및 특징점으로부터 최단거리에 위치한 경량화된 타겟 메쉬의 버텍스가 페어로 결정된 경우, 너비와 형태가 가장 가까운 타겟 메쉬의 영역에 2차원의 이미지 데이터에 포함된 대상 얼굴 의 특징점을 기준으로 삼각화하여, 타겟 메쉬에 매핑되는 이미지 데이터가 축소되거나 늘어지지 않도록 하여 왜 곡의 발생을 방지할 수 있다. 도 5c를 참조하면, 대상 얼굴 중 눈썹 영역의 특징점 및 특징점으로부터 최단거리에 위치한 경량화된 타겟 메쉬 의 버텍스를 페어로 결정하여 삼각화한 경우, 2차원의 이미지 데이터에서 인접한 특징점들이 삼각형 모양으로 이미지가 추출되고, 페어로 결정된 버텍스 인덱스의 삼각형 영역에 매핑될 수 있다. 여기서, 2차원의 이 미지 데이터의 특징점은 특징점 마다 순서가 정해져 있으므로, 삼각화되는 3개의 특징점 페어가 미리 결정될 수 있다. 이에 상응하는 타겟 메쉬의 버텍스 인덱스 페어는 투영된 타겟 메쉬의 버텍스 인덱스와 2차원의 이미지 데이터에서의 특징점과 유클리디언 거리에 따라 가변적으로 변경될 수 있다. 도 5d를 참조하면, 눈썹 부분의 경우, 경량화된 타겟 메쉬에 투영한 결과, 2차원의 이미지 데이터의 특징점과 경량화된 타겟 메쉬의 버텍스와 매핑되는 위치가 다른 것을 확인할 수 있다. 예를 들어, 제 1 이미지 데이터의 특징점은 눈 영역에서 아래쪽 메쉬에 위치하는 버텍스들과 매핑되는 반 면, 제 2 이미지 데이터의 특징점은 눈 영역에서 윗쪽 메쉬에 위치하는 버텍스들과 매핑되는 것을 확인할 수 있다. 이와 같이, 버텍스 인덱스가 사전에 설정된 경우, 이미지의 왜곡이 발생하게 되어 전체적인 닮음도의 저하를 초 래한다는 단점을 가지고 있다. 도 5e를 참조하면, 텍스쳐 매핑부는 이미지 데이터에 포함된 대상 얼굴로부터 텍스쳐 데이터를 타겟 메쉬에 매핑시킴으로써, 3차원의 타겟 메쉬를 생성할 수 있다. 다시 도 1로 돌아와서, 영상 입력부는 사용자 얼굴이 포함된 영상 데이터를 입력받을 수 있다. 예를 들어, 영상 입력부는 얼굴 교체 서비스를 제공하는 앱을 통해 사용자 얼굴을 실시간으로 촬영한 영상 데이터를 입력받을 수 있다. 리타겟팅부는 영상 데이터로부터 사용자 얼굴의 표정을 리타겟팅할 수 있다. 예를 들어, 리타겟팅부 는 사용자 얼굴의 표정에 따른 1,000개의 타겟 메쉬의 변화량의 오프셋(offset)을 기반으로, 사용자 얼굴의 표 정이 텍스쳐 데이터가 매핑된 타겟 메쉬에 적용되도록 할 수 있다. 출력부는 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 영상 데이터에서 사용자 얼굴과 대상 얼굴을 교체 하여 출력할 수 있다. 예를 들어, 출력부는 리타겟팅된 사용자 얼굴의 표정 및 경량화된 타겟 메쉬에 기 초하여 영상 데이터에서 사용자 얼굴을 사용자 얼굴의 표정이 반영된 대상 얼굴로 교체하여 출력할 수 있다. 출력부는 사용자 얼굴이 포함된 영상 데이터를 입력받은 경우, 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초 하여 영상 데이터에서 사용자 얼굴과 대상 얼굴을 교체하여 렌더링하여 출력할 수 있다. 이 때, 출력부는 사용자 얼굴과 대상 얼굴의 교체 시, 고정된 조명으로 처리하도록 하며, 텍스쳐 데이터의 알파 수치로 투명도 조절 시, 대상 얼굴의 조명이 어느 정도 반영되도록 할 수 있다. 사용자 얼굴과 대상 얼굴을 교체하여 출력하는 과정에 대해서는 도 6a 내지 도 6d를 통해 상세히 설명하도록 한 다. 도 6a 내지 도 6d는 본 발명의 일 실시예에 따른 사용자 얼굴과 교체된 대상 얼굴을 출력하는 과정을 설명하기 위한 예시적인 도면이다. 도 6a를 참조하면, 출력부는 색감 블렌딩 방법을 심리스 클로닝(seamless cloning)과 알파 블렌딩(Alpha Blending) 방법을 이용하여 영역에 따라 분기하여 텍스쳐 데이터의 영역 중 눈썹, 눈, 입 부분의 색감 블렌딩과 그 외 피부 영역에 대한 색감 블렌딩 방법으로 나누어 처리할 수 있다. 만약, 피부색의 경우, 입력 이미지의 피부색이 아닌 대상 얼굴의 피부색에 가까워지도록 하는 색상 채널의 조정이 필요하다. 그러나 출력부에서 심리스 클로닝 방법을 통해 색감 블렌딩을 적절히 하여 얼굴의 피부, 눈썹, 눈, 입 부분에 대해 일괄적으로 적용할 경우, 변경되지 않아야 할 눈썹, 눈, 입의 색 또한 피부색 으로 색상 채널이 변경된다는 단점을 갖는다. 따라서, 출력부는 피부 영역에는 심리스 블렌딩 방법을 적용하고, 눈썹, 눈, 입 영역에 대해서는 반투명 알파 블렌딩 방법을 적용하여 색감을 블렌딩할 수 있다. 예를 들어, 출력부는 입력 이미지로부터 사용자 얼굴의 눈썹, 눈, 입 영역에 대하여 세그먼테이션 (Segmentation)을 진행한 후, 눈썹, 눈, 입 영역에 대해 알파 블렌딩 방법을 이용하여 색감 블렌딩을 수행할 수 있다. 이 때, 세그먼테이션된 눈썹, 눈, 입 영역의 알파 값은 불투명한 값인 '255'로 설정되고, 나머지 부분은 '0'으로 저장하도록 하는 알파 수치 맵이 생성될 수 있다. 알파 수치 맵에서 알파 값에 대한 가우시안 필터링을 수행하여 눈썹, 눈, 입의 중앙 부분에 해당하는 위치는 불 투명에 가깝고, 경계 부분의 알파 값은 적응적으로 투명하게 조절하도록 dstR = (srcR - dstR) * Alpha + dtstR 를 통해 자연스러운 알파 값이 생성되도록 할 수 있다. 도 6c를 참조하면, 알파 값은 적응적으로 적용하기 위해 가우시안 필터를 사용하여 알파 수치 맵을 필터링 함으로써 적용될 수 있다. 도 6d를 참조하면, 눈썹, 눈, 입 영역을 제외한 나머지 피부 부분에는 심리스 클로닝 방법을 적용하여 대상 얼 굴과 같은 색감으로 피부색이 조절되도록 하여, 사용자 얼굴과 대상 얼굴을 교체하여 출력할 수 있다. 이러한 얼굴 교체 장치는 사용자 얼굴을 대상 얼굴로 교체하는 명령어들의 시퀀스를 포함하는 매체에 저장 된 컴퓨터 프로그램에 의해 실행될 수 있다. 컴퓨터 프로그램은 컴퓨팅 장치에 의해 실행될 경우, 이미지 데이 터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성하고, 생성된 타겟 메쉬를 경량화하고, 이미지 데이터로부터 텍 스쳐 데이터를 추출하고, 추출된 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시키고, 사용자 얼굴이 포함된 영 상 데이터를 입력받고, 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 영상 데이터에서 사용자 얼굴과 대상 얼 굴을 교체하여 출력하도록 하는 명령어들의 시퀀스를 포함할 수 있다. 도 7은 본 발명의 일 실시예에 따른 얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교체하는 방법의 순서도이 다. 도 7에 도시된 얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교체하는 방법은 도 1 내지 도 6d에 도시된 실시예에 따라 얼굴 교체 장치에 의해 시계열적으로 처리되는 단계들을 포함한다. 따라서, 이하 생략된 내용이라고 하더라도 도 1 내지 도 6d에 도시된 실시예에 따른 얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교체하는 방법에도 적용된다. 단계 S710에서 얼굴 교체 장치는 이미지 데이터에 포함된 대상 얼굴에 대한 타겟 메쉬를 생성할 수 있다. 단계 S720에서 얼굴 교체 장치는 생성된 타겟 메쉬를 경량화할 수 있다. 단계 S730에서 얼굴 교체 장치는 이미지 데이터로부터 텍스쳐 데이터를 추출하고, 추출된 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시킬 수 있다. 단계 S740에서 얼굴 교체 장치는 사용자 얼굴이 포함된 영상 데이터를 입력받을 수 있다. 단계 S750에서 얼굴 교체 장치는 텍스쳐 데이터가 매핑된 타겟 메쉬에 기초하여 영상 데이터에서 사용자 얼굴과 대상 얼굴을 교체하여 출력할 수 있다. 상술한 설명에서, 단계 S710 내지 S750은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 전환될 수 도 있다. 도 1 내지 도 7를 통해 설명된 얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교체하는 방법은 컴퓨터에 의해 실행되는 매체에 저장된 컴퓨터 프로그램 또는 컴퓨터에 의해 실행 가능한 명령어를 포함하는 기록 매체의 형태 로도 구현될 수 있다. 또한, 도 1 내지 도 7를 통해 설명된 얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교 체하는 방법은 컴퓨터에 의해 실행되는 매체에 저장된 컴퓨터 프로그램의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매 체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정 보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함 한다."}
{"patent_id": "10-2020-0138937", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다. 부호의 설명 100: 얼굴 교체 장치 110: 메쉬 생성부 120: 산출부 130: 경량화부 140: 텍스쳐 매핑부 150: 영상 입력부 160: 리타겟팅부 170: 출력부"}
{"patent_id": "10-2020-0138937", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 얼굴 교체 장치의 구성도이다. 도 2는 본 발명의 일 실시예에 따른 이미지 데이터를 도시한 예시적인 도면이다. 도 3a 내지 도 3c는 본 발명의 일 실시예에 따른 소스 메쉬의 강체 및 스케일을 변환하는 과정을 설명하기 위한 예시적인 도면이다. 도 4a 내지 도 4e는 본 발명의 일 실시예에 따른 소스 메쉬와 타겟 메쉬 간의 동기화를 통해 타겟 메쉬를 경량 화하는 과정을 설명하기 위한 예시적인 도면이다. 도 5a 내지 도 5e는 본 발명의 일 실시예에 따른 텍스쳐 데이터를 경량화된 타겟 메쉬에 매핑시키는 과정을 설 명하기 위한 예시적인 도면이다. 도 6a 내지 도 6d는 본 발명의 일 실시예에 따른 사용자 얼굴과 교체된 대상 얼굴을 출력하는 과정을 설명하기 위한 예시적인 도면이다. 도 7은 본 발명의 일 실시예에 따른 얼굴 교체 장치에서 사용자 얼굴을 대상 얼굴로 교체하는 방법의 순서도이 다."}
