{"patent_id": "10-2021-0052747", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0146012", "출원번호": "10-2021-0052747", "발명의 명칭": "태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법", "출원인": "한국에너지기술연구원", "발명자": "신우균"}}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부로부터, 태양광 모듈 및 스트링의 현재 발전 성능 측정값을 입력받는 측정 입력부(100);입력되는 현재 환경 조건들을 기반으로, 상기 태양광 모듈 및 스트링의 발전 성능 추정값을 연산하는 추정 연산부(200); 및상기 측정 입력부(100)에 의한 상기 발전 성능 측정값과 상기 추정 연산부(200)에 의한 상기 발전 성능 추정값을 비교 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판단하는 고장 판단부(300);를 포함하되,상기 태양광 모듈은 양면 또는 단면으로 구성되는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 측정 입력부(100)는상기 발전 성능 측정값으로 전류-전압 특성 곡선을 입력받아, 이들을 분석하여 기설정된 전기적 파라미터들을추출하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 추정 연산부(200)는상기 태양광 모듈 및 스트링이 설치된 현재 위치에 대한 환경 조건값들을 입력받는 제1 입력부(210);상기 태양광 모듈의 기설정된 기본 스펙값들을 입력받는 제2 입력부(220);상기 태양광 스트링의 직/병렬 구성값을 입력받는 제3 입력부(230);기저장된 추정 알고리즘을 이용하여, 상기 제1 입력부(210), 제2 입력부(220) 및 제3 입력부(230)에 의해 입력받은 값들을 반영하여 상기 태양광 모듈의 전압, 전류값을 연산하는 연산부(240); 및상기 연산부(240)에 의해 연산한 상기 전압, 전류값을 이용하여, 상기 발전 성능 추정값으로 전류-전압 특성 곡선을 생성하고, 이들을 분석하여 기설정된 전기적 파라미터들을 추출하는 분석부(250);를 더 포함하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 연산부(240)는상기 태양광 모듈의 양면 또는 단면 구성에 따라, 상이한 추정 알고리즘을 이용하는 것을 특징으로 하는 태양광모듈 및 스트링의 고장진단 시스템.공개특허 10-2022-0146012-3-청구항 5 제 1항에 있어서,상기 고장 판단부(300)는상기 측정 입력부(100)에 의한 상기 발전 성능 측정값의 전기적 파라미터와 상기 추정 연산부(200)에 의한 상기발전 성능 추정값의 전기적 파라미터를 비교하여 손실량을 평가하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판단하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 고장 판단부(300)는분석한 각각의 손실량이 기설정된 전기적 파라미터들에 대한 각 기준범위를 모두 만족할 경우, 상기 태양광 모듈 및 스트링을 정상으로 판단하고,분석한 각각의 손실량이 상기 각 기준범위 중 어느 하나를 불만족할 경우, 상기 태양광 모듈 및 스트링을 고장으로 판단하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 태양광 모듈 및 스트링의 고장진단 시스템은상기 고장 판단부(300)의 판단 결과에 따라, 상기 태양광 모듈 및 스트링이 고장으로 판단될 경우, 인공지능 알고리즘을 이용하여, 상기 태양광 모듈 및 스트링의 고장 요소를 분류 분석하는 고장 분류부(400);를 더 포함하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 고장 분류부(400)는외부로부터, 고장 요소가 기분류된 태양광 모듈 및 스트링의 전류-전압 특성 곡선을 수집하여, 인공지능 학습을위한 학습 데이터로 생성하는 학습 데이터 수집부(410);기저장된 인공지능 알고리즘을 이용하여, 상기 학습 데이터 수집부(410)에서 생성한 상기 학습 데이터들에 대한학습을 수행하여, 학습 결과 모델을 생성하는 학습 처리부(420); 및상기 고장 판단부(300)의 판단 결과에 따라, 상기 태양광 모듈 및 스트링이 고장으로 판단될 경우, 해당하는 태양광 모듈 및 스트링의 발전 성능 측정값과 전압-전류 특성 곡선을 전달받아, 상기 학습 처리부(420)에 의해 생성한 상기 학습 결과 모델에 적용하여, 해당하는 태양광 모듈 및 스트링의 고장 요소를 분류 분석하는 고장 분석부(430);를 더 포함하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "측정 입력부에서, 외부로부터 태양광 모듈 및 스트링의 현재 발전 성능 측정값을 입력받는 성능 측정 단계공개특허 10-2022-0146012-4-(S100);추정 연산부에서, 상기 태양광 모듈이 설치된 현재 위치에 대한 환경 조건값들을 입력받는 환경 측정 단계(S200);추정 연산부에서, 상기 태양광 모듈 및 스트링의 기설정된 기본 스펙값들, 스트링의 직/병렬 구성값을 입력받는사양 입력 단계(S300);추정 연산부에서, 상기 환경 측정 단계(S200)에 의해 입력받은 상기 환경 조건값들을 기반으로, 상기 태양광 모듈 및 스트링의 발전 성능 추정값을 연산하는 성능 추정 단계(S400); 및고장 판단부에서, 상기 성능 측정 단계(S100)에 의해 입력받은 상기 발전 성능 측정값과 상기 성능 추정 단계(S400)에 의해 연산한 상기 발전 성능 추정값을 비교 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판단하는 고장 판단 단계(S500);를 포함하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 방법."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 성능 추정 단계(S400)는기저장된 추정 알고리즘을 이용하여, 상기 태양광 모듈 및 스트링의 전압, 전류값을 연산하되, 상기 태양광 모듈의 양면 또는 단면 구성 형태에 따라 상이한 추정 알고리즘을 이용하는 것을 특징으로 하는 태양광 모듈 및스트링의 고장진단 방법."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9항에 있어서,상기 고장 판단 단계(S500)는상기 발전 성능 측정값과 상기 발전 성능 추정값으로, 각각의 전류-전압 특성 곡선을 생성하고, 이들을 분석하여 기설정된 전기적 파라미터들을 각각 추출하며,상기 발전 성능 측정값에 대한 상기 전기적 파라미터들의 각각의 손실량을 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판단하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 방법."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 고장 판단 단계(S500)는분석한 각각의 손실량이 기설정된 전기적 파라미터들에 대한 각 기준범위를 모두 만족할 경우, 상기 태양광 모듈 및 스트링을 정상으로 판단하고,분석한 각각의 손실량이 상기 각 기준범위 중 어느 하나를 불만족할 경우, 상기 태양광 모듈 및 스트링을 고장으로 판단하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 방법."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9항에 있어서,상기 태양광 모듈의 고장 진단 방법은공개특허 10-2022-0146012-5-상기 고장 판단 단계(S500)를 수행하고 난 후,상기 고장 판단 단계(S500)의 판단 결과에 따라, 상기 태양광 모듈 및 스트링이 고장으로 판단될 경우, 인공지능 알고리즘을 이용하여, 상기 태양광 모듈 및 스트링의 고장 요소를 분류 분석하는 고장 분류 단계(S600);를 더 포함하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 방법."}
{"patent_id": "10-2021-0052747", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 고장 분류 단계(S600)는기수집된 고장 요소가 분류된 태양광 모듈 및 스트링의 전류-전압 특성 곡선을 인공지능 학습한 학습 결과 모델에, 상기 고장 판단 단계(S500)의 판단 결과에 따라, 고장으로 판단된 태양광 모듈 및 스트링의 발전 성능 측정값을 적용하여, 고장 요소를 분류 분석하는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 방법."}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법에 관한 것이다. 본 발명은 외부로부터, 태양광 모듈 및 스트링의 현재 발전 성능 측정값을 입력받는 측정 입력부, 입력되는 현재 환경 조건들을 기반으로, 상기 태양광 모듈 및 스트링의 발전 성능 추정값을 연산하는 추정 연산부 및 상기 측정 입력부에 의한 상기 발전 성능 측정값과 상기 추정 연산부에 의한 상기 발전 성능 추정값을 비교 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판단하는 고장 판단부를 포함하되, 상기 태양광 모듈은 양면 또는 단면으로 구성되는 것을 특징으로 하는 태양광 모듈 및 스트링의 고장진단 시스템을 제공함에 있다."}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법에 관한 것으로, 보다 상세하게는 단면 또는 양 면으로 구성되는 태양광 모듈에 대한 발전 성능 추정값과 전기적 출력값(발전 성능 측정값)의 비교를 통해, 태 양광 모듈의 고장 유무를 진단할 수 있는 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법에 관한 것이다. 또한, 인공지능 알고리즘을 적용하여, 진단한 태양광 모듈 및 스트링의 고장 요소를 분석할 수 있는 고장진단 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대규모 태양광 발전의 경우, 태양광 모듈들을 직렬과 병렬로 연결하여 원하는 전압과 전류를 얻게 된다. 이 때, 태양광 모듈을 직렬로 연결한 것은 태양광 스트링이라 하고, 이러한 태양광 스트링이 병렬로 연결된 것을 태양 광 어레이라고 한다. 태양광 모듈에서 발생하는 전력은 DC 전력이며, 송전하기 위해 이를 AC로 변환하게 되며, 변환을 위한 태양광 인버터에 연결되는 구성을 가지게 된다. 이 때, 다수의 태양전지 어레이의 전압이 상이할 경우, 인버터에서 미 스매치로 인한 손실이 발생하게 된다. 즉, 다수의 태양광 모듈들이 상호 연결되어 있는 만큼, 일부 모듈에 오염이 발생하거나, 특성이 열화된 경우, 태양광 스트링 뿐 아니라, 전체 태양광 어레이에서 얻을 수 있는 출력이 저하되므로, 성능이 저하된 모듈을 수 리하거나 교체를 통한 유지보수가 이루어지게 된다. 또한, 최근들어, 도 1에 도시된 바와 같이, 전면의 태양광 발전 뿐 아니라, 후면에서도 반사광을 이용하여 추가 적인 발전이득을 얻을 수 있는 양면 태양광 모듈이 설치되고 있다. 양면 태양광 모듈의 경우, 후면 이득을 통한 전압 특성은 단면 태양광 모듈과 유사하나, 전류 특성의 경우, 후 면의 알베도(Albeo) 값에 따라 상이하게 나타나게 된다. 여기서, 알베도 값이란, 일사계 측정값을 통한 전면 일 사량(혹은 발전량)과 후면 일사량(혹은 발전량)의 비율을 의미한다. 일반적으로 양면 태양광 모듈의 경우, 후면 알베도 값에 따라 발전이득을 태양전지 모듈의 제조사 별로 상이하 게 제안하고 있으나, 평균적인 후면 알베도 특성값을 이용하여, 발전 이득량을 추정할 수 있다. 종래에 태양광 모듈에 대한 고장진단을 위한 다양한 방법이 연구되고 있으나, 단면 태양광 모듈과 분명한 차이 가 있는 양면 태양광 모듈에 대한 연구가 미비한 바, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고 장진단 시스템 및 그 방법은, 단면 태양광 모듈 뿐만 아니라, 양면 태양광 모듈의 고장진단을 수행하는 기술을 개시하고 있다.이와 관련해서, 국내 등록 특허 제10-1297078호(\"태양광 전지모듈별 고장 진단 가능한 태양광 발전 모니터링 장 치 및 이를 이용한 태양광 발전 시스템의 고장진단 방법\")에서는 다수의 태양광 전지 모듈 중 어느 하나에서 고 장이 발생한 경우, 이를 용이하게 파악할 수 있는 장치를 개시하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1297078호(등록일자 2013.08.09.)"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기한 바와 같은 종래 기술의 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 목적은 태양광 모듈 및 스트링의 추정한 전압-전류 특성 곡선과 측정한 전압-전류 특성 곡선 간의 전기적 파라미터 차 이를 분석하여, 태양광 모듈 및 스트링의 정상/고장을 진단하고, 전압-전류 특성 곡선의 패턴을 분석하여 발생 한 고장의 종류(고장 요소)를 분류할 수 있는 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법을 제공함에 있다."}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 태양광 모듈 및 스트링의 고장진단 시스템은, 외부로부터, 태양광 모듈 및 스트링의 현재 발전 성능 측정값을 입력받는 측정 입력부, 입력되는 현재 환경 조건들을 기반으로, 상기 태양광 모듈 및 스트링의 발전 성능 추정값을 연산하는 추정 연산부 및 상기 측정 입력부 에 의한 상기 발전 성능 측정값과 상기 추정 연산부에 의한 상기 발전 성능 추정값을 비교 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판단하는 고장 판단부를 포함하되, 상기 태양광 모듈은 양면 또는 단면으로 구성되는 것이 바람직하다. 더 나아가, 상기 측정 입력부는 상기 발전 성능 측정값으로 전류-전압 특성 곡선을 입력받아, 이들을 분석 하여 기설정된 전기적 파라미터들을 추출하는 것이 바람직하다. 더 나아가, 상기 추정 연산부는 상기 태양광 모듈이 설치된 현재 위치에 대한 환경 조건값들을 입력받는 제1 입력부, 상기 태양광 모듈의 기설정된 기본 스펙값들을 입력받는 제2 입력부, 상기 태양광 모듈 의 직/병렬 구성값을 입력받는 제3 입력부, 기저장된 추정 알고리즘을 이용하여, 상기 제1 입력부, 제2 입력부 및 제3 입력부에 의해 입력받은 값들을 반영하여 상기 태양광 모듈의 전압, 전류값을 연 산하는 연산부 및 상기 연산부에 의해 연산한 상기 전압, 전류값을 이용하여, 상기 발전 성능 추정값 으로 전류-전압 특성 곡선을 생성하고, 이들을 분석하여 기설정된 전기적 파라미터들을 추출하는 분석부를 더 포함하는 것이 바람직하다. 더 나아가, 상기 연산부는 상기 태양광 모듈의 양면 또는 단면 구성에 따라, 상이한 추정 알고리즘을 이용 하는 것이 바람직하다. 더 나아가, 상기 고장 판단부는 상기 측정 입력부에 의한 상기 발전 성능 측정값의 전기적 파라미터 와 상기 추정 연산부에 의한 상기 발전 성능 추정값의 전기적 파라미터를 비교하여 손실량을 평가하여, 상 기 태양광 모듈의 고장 여부를 판단하는 것이 바람직하다. 더 나아가, 상기 고장 판단부는 분석한 각각의 손실량이 기설정된 전기적 파라미터들에 대한 각 기준범위 를 모두 만족할 경우, 상기 태양광 모듈 및 스트링을 정상으로 판단하고, 분석한 각각의 손실량이 상기 각 기준 범위 중 어느 하나를 불만족할 경우, 상기 태양광 모듈 및 스트링을 고장으로 판단하는 것이 바람직하다. 더 나아가, 상기 태양광 모듈 및 스트링의 고장진단 시스템은 상기 고장 판단부의 판단 결과에 따라, 상기 태양광 모듈이 고장으로 판단될 경우, 인공지능 알고리즘을 이용하여, 상기 태양광 모듈의 고장 요소를 분류 분 석하는 고장 분류부를 더 포함하는 것이 바람직하다. 더 나아가, 상기 고장 분류부는 외부로부터, 고장 요소가 기분류된 태양광 모듈 및 스트링의 전류-전압 특 성 곡선을 수집하여, 인공지능 학습을 위한 학습 데이터로 생성하는 학습 데이터 수집부, 기저장된 인공지 능 알고리즘을 이용하여, 상기 학습 데이터 수집부에서 생성한 상기 학습 데이터들에 대한 학습을 수행하 여, 학습 결과 모델을 생성하는 학습 처리부 및 상기 고장 판단부의 판단 결과에 따라, 상기 태양광 모듈 및 스트링이 고장으로 판단될 경우, 해당하는 태양광 모듈 및 스트링의 발전 성능 측정값과 전압-전류 특 성 곡선을 전달받아, 상기 학습 처리부에 의해 생성한 상기 학습 결과 모델에 적용하여, 해당하는 태양광 모듈의 고장 요소를 분류 분석하는 고장 분석부를 더 포함하는 것이 바람직하다. 상기한 바와 같은 목적을 달성하기 위한 본 발명의 태양광 모듈 및 스트링의 고장진단 방법은, 측정 입력부에서, 외부로부터 태양광 모듈 및 스트링의 현재 발전 성능 측정값을 입력받는 성능 측정 단계(S100), 추 정 연산부에서, 상기 태양광 모듈 및 스트링이 설치된 현재 위치에 대한 환경 조건값들을 입력받는 환경 측정 단계(S200), 추정 연산부에서, 상기 태양광 모듈 및 스트링의 기설정된 기본 스펙값들, 스트링의 직/병렬 구성 값을 입력받는 사양 입력 단계(S300), 추정 연산부에서, 상기 환경 측정 단계(S200)에 의해 입력받은 상기 환경 조건값들을 기반으로, 상기 태양광 모듈 및 스트링의 발전 성능 추정값을 연산하는 성능 추정 단계(S400) 및 고 장 판단부에서, 상기 성능 측정 단계(S100)에 의해 입력받은 상기 발전 성능 측정값과 상기 성능 추정 단계 (S400)에 의해 연산한 상기 발전 성능 추정값을 비교 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판 단하는 고장 판단 단계(S500)를 포함하는 것이 바람직하다. 더 나아가, 상기 성능 추정 단계(S400)는 기저장된 추정 알고리즘을 이용하여, 상기 태양광 모듈 및 스트링의 전압, 전류값을 연산하되, 상기 태양광 모듈의 양면 또는 단면 구성 형태에 따라 상이한 추정 알고리즘을 이용 하는 것이 바람직하다. 더 나아가, 상기 고장 판단 단계(S500)는 상기 발전 성능 측정값과 상기 발전 성능 추정값으로, 각각의 전류-전 압 특성 곡선을 생성하고, 이들을 분석하여 기설정된 전기적 파라미터들을 각각 추출하며, 상기 발전 성능 측정 값에 대한 상기 전기적 파라미터들의 각각의 손실량을 분석하여, 상기 태양광 모듈 및 스트링의 고장 여부를 판 단하는 것이 바람직하다. 더 나아가, 상기 고장 판단 단계(S500)는 분석한 각각의 손실량이 기설정된 전기적 파라미터들에 대한 각 기준 범위를 모두 만족할 경우, 상기 태양광 모듈 및 스트링을 정상으로 판단하고, 분석한 각각의 손실량이 상기 각 기준범위 중 어느 하나를 불만족할 경우, 상기 태양광 모듈 및 스트링을 고장으로 판단하는 것이 바람직하다. 더 나아가, 상기 태양광 모듈 및 스트링의 고장 진단 방법은 상기 고장 판단 단계(S500)를 수행하고 난 후, 상 기 고장 판단 단계(S500)의 판단 결과에 따라, 상기 태양광 모듈 및 스트링이 고장으로 판단될 경우, 인공지능 알고리즘을 이용하여, 상기 태양광 모듈 및 스트링의 고장 요소를 분류 분석하는 고장 분류 단계(S600)를 더 포 함하는 것이 바람직하다. 더 나아가, 상기 고장 분류 단계(S600)는 기수집된 고장 요소가 분류된 태양광 모듈 및 스트링의 전류-전압 특 성 곡선을 인공지능 학습한 학습 결과 모델에, 상기 고장 판단 단계(S500)의 판단 결과에 따라, 고장으로 판단 된 태양광 모듈 및 스트링의 발전 성능 측정값을 적용하여, 고장 요소를 분류 분석하는 것이 바람직하다."}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법은 태양광 DC 어레이의 성능 추정을 통 해 현재 태양광의 발전량에 대한 정량적인 평가를 수행하여, 태양광 DC 어레이의 고장 여부를 판별할 수 있는 장점이 있다. 특히, 고장으로 판별하는 경우에는 인공지능 알고리즘을 적용하여, 고장 요소를 진단해줌으로써, 고장으로 인한 경제적, 시간적 손실을 최소화하여 태양광 발전소의 성능 안정성을 증대시킬 수 있는 장점이 있다."}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 상기한 바와 같은 구성을 가지는 본 발명에 의한 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법을 첨부된 도면을 참고하여 상세하게 설명한다. 다음에 소개되는 도면들은 당업자에게 본 발명의 사상이 충분히 전 달될 수 있도록 하기 위해 예로서 제공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 또한, 명세서 전반에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타 낸다. 이때, 사용되는 기술 용어 및 과학 용어에 있어서 다른 정의가 없다면, 이 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 가지며, 하기의 설명 및 첨부 도면에서 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 설명은 생략한다. 더불어, 시스템은 필요한 기능을 수행하기 위하여 조직화되고 규칙적으로 상호 작용하는 장치, 기구 및 수단 등 을 포함하는 구성 요소들의 집합을 의미한다. 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법은, 태양광의 성능 상태 및 고장을 가장 정확히 확인할 수 있는 전류-전압 특성 곡선을 활용하여, 태양광 모듈 및 스트링으로부터 측정한 전류-전압 특성 곡선과, 현재 환경 데이터(일사량, 외기온도, 모듈 표면 온도 등)와 미리 설정된 추정 알고리즘 (성능 추정 모델)을 통해 연산한 전류-전압 특성 곡선 간의 차이를 비교하여, 현재 태양광 모듈 및 스트링의 손 실량을 평가하는 것이 바람직하다. 평가한 손실량이 미리 설정된 범위를 벗어날 경우, 태양광 모듈 및 스트링을 고장으로 진단하고, 인공지능 알고리즘을 이용하여 고장으로 진단한 태양광 모듈 및 스트링의 전류-전압 특성 곡선의 패턴 분석을 통해 진단한 고장 분류까지 수행하는 것이 바람직하다. 또한, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법은, 상술한 바와 같이, 통상적인 단면 태양광 모듈 및 스트링의 고장진단을 수행하는 것 뿐 아니라, 양면 태양광 모듈 및 스트링의 고 장 진단까지 수행하기 위하여, 추정 알고리즘을 설정함에 있어서, 단면 태양광 모듈과 양면 태양광 모듈을 각각 상이하게 설정하는 것이 바람직하다. 즉, 도 2에 도시된 바와 같이, 태양광 모듈의 설치 높이에 따라 발전량의 차이가 발생되는 것으로 각종 논문 자 료를 통해서 보고되고 있는 바, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법은, 양면 태양광 모듈의 고장진단을 위한 추정 알고리즘을 생성 및 설정함에 있어서, 일사량, 온도 뿐만 아 니라, 태양광 모듈의 설치 높이까지 고려하여 특성 방정식을 도출하는 것이 바람직하다. 이러한 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템은 도 3에 도시된 바와 같이, 측 정 입력부, 추정 연산부 및 고장 판단부를 포함하여 구성되는 것이 바람직하다. 이 때, 상기 구 성들은 MCU를 포함하는 각각의 연산처리수단 또는 하나의 통합 연산처리수단을 통해서 동작을 수행하는 것이 바 람직하다. 각 구성에 대해서 자세히 알아보자면, 측정 입력부는 외부 연계되어 있는 태양광 모듈 및 스트링의 성능 측정 장치를 통해서, 태양광 모듈 및 스 트링의 현재 발전 성능 측정값을 입력받는 것이 바람직하다. 측정 입력부를 통해 입력받는 태양광 모듈 및 스트링의 현재 발전 성능 측정값으로는 전류-전압 특성 곡선 (I-V curve)을 입력받는 것이 바람직하며, 태양광 스트링의 전압 측정값, 전류 측정값을 이용하여 생성되게 된 다. 측정 입력부는 입력받은 전류-전압 특성 곡선을 분석하여 미리 설정된 전기적 파라미터들을 추출하는 것이 바람직하다. 이 때, 미리 설정된 전기적 파라미터들로는, 최대 출력값(Pmp), 최대 전압값(Vmp), 최대 전류값(Imp), 개방 전압 값(Voc) 및 단략 전류값(Isc)을 추출하는 것이 바람직하며, 입력받은 전류-전압 특성 곡선을 분석하여 전기적 파 라미터들을 추출하는 것은 공지된 기술에 해당하기 때문에, 상세한 설명은 생략한다.추정 연산부는 입력되는 현재 환경 조건들을 기반으로, 태양광 모듈 및 스트링의 발전 성능 추정값을 연산 하는 것이 바람직하다. 이를 위해, 추정 연산부(200는 도 3에 도시된 바와 같이, 제1 입력부, 제2 입력부, 제3 입력부, 연산부 및 분석부를 포함하여 구성되는 것이 바람직하다. 제1 입력부는 외부 연계되어 있는 수단 등을 통해서, 태양광 모듈 및 스트링이 설치된 현재 위치에 대한 환경 조건값들을 입력받는 것이 바람직하며, 환경 조건값들로는 일사량, 외기 온도, 모듈 표면 온도 등을 포함 하여 구성되는 것이 바람직하다. 제2 입력부는 외부 관리자로부터 태양광 모듈의 설계 당시 미리 설정된 기본 스펙값(전기적 사양 등)들을 입력받는 것이 바람직하며, 일 예를 들자면, 개방 전압, 단락 전류 등을 포함하여 구성되는 것이 바람직하다. 제3 입력부는 외부 관리자로부터, 태양광 스트링의 설계 당시 미리 설정된 직/병렬 구성값을 입력받는 것 이 바람직하며, 일 예를 들자면, 직렬 또는 병렬 연결 모듈 수 등을 포함하여 구성되는 것이 바람직하다. 연산부는 미리 저장된 추정 알고리즘을 이용하여, 제1 입력부, 제2 입력부 및 제3 입력부 를 통해서 입력받은 값들을 반영하여, 태양광 모듈 및 스트링의 전압, 전류값을 연산하는 것이 바람직하다. 이 때, 추정 알고리즘을 미리 저장함에 있어서, 하기의 수학식들이 이용되는 것이 바람직하며, 상술한 바와 같 이, 추정 알고리즘을 설정함에 있어서, 단면 태양광 모듈과 양면 태양광 모듈을 각각 상이하게 설정하는 것이 바람직하다. 또한, 단면 태양광 모듈의 경우, 전면의 태양빛을 이용하여 발전하고, 양면 태양광 모듈의 경우, 전면 + 후면의 태양빛을 이용하여 발전하기 때문에, 단면 태양광 모듈의 경우, 전면 태양광 모듈로 해석되며, 양면 태양광 모 듈의 경우, 전면 태양광 모듈 + 후면 태양광 모듈로 해석되는 것이 바람직하다. 먼저, 연산부는 전류값으로 전면 단락전류(Isc-전면)와 후면 단락전류(Isc-후면)를 분리하여 계산하는 것이 바람직하다. 이 때, 전면 단락전류(Isc-전면)는 하기의 수학식 1을 토대로 연산하는 것이 바람직하며, 측정 모듈 온도, 전류 노화계수, 설치년수, 오염율을 반영하여 계산되게 된다. 수학식 1"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(여기서, 는 전류 온도계수, 는 병렬 모듈 수, 는 전류 노화계수, 는 설치년수, 는 전류 오염계수임.) 후면 단락전류(Isc-후면)는 후면의 이득에 의해 결정되며, 후면 이득(BG, Backside Gain)은 하기의 수학식 2와 같이, 후면의 알베도값과 모듈의 설치높이에 따른 비로 표현되게 된다.수학식 2"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "(여기서, Height_ratio는 모듈의 설치 높이에 따른 후면 이득율임.) 이를 통해서 후면 단락전류(Isc-후면)는 하기의 수학식 3과 같이, 계산된 후면 이득(BG)에 을 곱하여 계 산하는 것이 바람직하다. 수학식 3"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이 후, 상술한 바와 같이, 단면 태양광 모듈의 경우, 전면 단락전류(Isc-전면) 자체로 단락전류가 연산되게 되며, 양면 태양광 모듈의 경우, 전면 단락전류(Isc-전면)와 후면 단락전류(Isc-후면)의 합으로 단락전류가 연산 되게 된다. 또한, 연산부는 전압값으로 개방전압을 계산하는 것이 바람직하며, 단면 태양광 모듈과 양면 태양광 모듈 의 개방전압이 동일하기 때문에, 하기의 수학식 4와 같이, 태양광 모듈의 정격 개방전압에서 측정 모듈 온도, 전류 노화계수, 설치년수 및 오염율을 반영하여 개방전압을 계산하는 것이 바람직하다. 수학식 4"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "(여기서, 는 전압 온도계수, 는 직렬 모듈 수, 는 전압 노화계수, 는 설치년수, 는 전압 오염계수임.) 연산부는 이와 같이, 단락전류와 개방전압을 통해서 전압-전류 계산을 수행하는 것이 바람직하며, 단면 태 양광 모듈의 경우, 하기의 수학식 5와 같이 계산되며, 양면 태양광 모듈의 경우, 하기의 수학식 6과 같이 계산 되는 것이 바람직하다.수학식 5"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "(여기서, 는 측정 일사량, 는 전하량, 는 볼츠만 상수, 는 충진율 계수, 는 태양광 스트링 병렬 저항임.) 수학식 6"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "(여기서, 는 측정 일사량, 는 전하량, 는 볼츠만 상수, 는 충진율 계수, 는 태양광 스트링 병렬 저항임.) 분석부는 연산부에 의해 전압, 전류값을 이용하여, 발전 성능 추정값으로 전류-전압 특성 곡선을 생 성하고, 이들을 분석하여 미리 설정된 전기적 파라미터들을 추출하는 것이 바람직하다. 이 때, 전압-전류값을 이용하여 특성 곡선을 생성하는 과정이나, 전류-전압 특성 곡선을 분석하여 미리 설정된 전기적 파라미터들인 최대 출력값(Pmp), 최대 전압값(Vmp), 최대 전류값(Imp), 개방 전압값(Voc) 및 단략 전류값 (Isc)을 추출하는 것은 공지된 기술에 해당하기 때문에, 상세한 설명은 생략한다. 고장 판단부는 측정 입력부에 의한 발전 성능 측정값과 추정 연산부에 의한 발전 성능 추정값을 비교 분석하여, 태양광 모듈 및 스트링의 고장 여부를 판단하는 것이 바람직하다. 상세하게는, 고장 판단부는 측정 입력부에 의한 발전 성능 측정값과 추정 연산부에 의한 발전 성능 추정값을 비교하여, 발전 성능 측정값에 대한 미리 설정된 전기적 파라미터들의 각각의 손실량을 분석하는 것이 바람직하다. 즉, 하기의 수학식 7과 같이, 미리 설정된 전기적 파라미터들을 기준으로, 발전 성능 측정값과 발전 성능 추정 값을 비교하여 손실량을 연산하게 된다. 수학식 7"}
{"patent_id": "10-2021-0052747", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "또한 고장 판단부는 연산한 각각의 전기적 파라미터들에 대한 발전 성능 측정값의 손실량을 하기의 표 1을 기준으로 분석하여 태양광 모듈 및 스트링의 고장 여부를 판단하는 것이 바람직하다. 표 1 정상 고장 - 0.05< - 0.05> - 0.05< - 0.05> - 0.05< - 0.05> - 0.005< - 0.005> - 0.02< - 0.02> 이 때, 정상 판단은 AND 조건으로 각각의 손실량이 미리 설정된 전기적 파라미터들에 대한 각 기준범위를 모두 만족할 경우, 해당하는 태양광 모듈 및 스트링을 정상으로 판단하고, 고장 판단은 OR 조건으로 각각의 손실량이 미리 설정된 전기적 파라미터들에 대한 각 기준범위들 중 어느 하나라도 불만족할 경우, 해당하는 태양광 모듈 및 스트링을 고장으로 판단하는 것이 바람직하다. 더불어, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템은 고장 판단부의 판단 결 과에 따라, 고장으로 판단된 태양광 모듈 및 스트링의 전류-전압 특정 곡선의 인공지능 알고리즘을 통한 패턴 분석을 통해, 고장 분류를 수행하는 것이 바람직하다. 이를 위해, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템은 도 3에 도시된 바와 같이, 고장 분류부를 더 포함하여 구성되는 것이 바람직하다. 고장 분류부는 고장 판단부의 판단 결과에 따라, 태양광 모듈 및 스트링이 고장으로 판단될 경우, 인 공지능 알고리즘을 이용하여 태양광 모듈 및 스트링의 고장 요소를 분류 분석하는 것이 바람직하다.상세하게는, 고장 분류부는 도 3에 도시된 바와 같이, 학습 데이터 수집부, 학습 처리부 및 고 장 분석부를 포함하여 구성되는 것이 바람직하다. 학습 데이터 수집부는 도 4에 도시된 바와 같이, 외부로부터 다양한 고장 요소가 미리 분류된 각각의 태양 광 모듈 및 스트링의 다양한 전류-전압 특성 곡선들을 수집하여, 인공지능 학습을 위한 학습 데이터로 생성하는 것이 바람직하다. 통상적으로 태양광의 전기적인 성능을 나타내는 전류-전압 특성 곡선은 고장 요소에 따라 서로 다른 패턴을 나 타내게 된다. 이러한 고장 요소에 따라 전류-전압 특성 곡선의 패턴이 상이함을 이용하여, 다양한 고장 요소 (PID 현상, 모듈 하단부의 오염, 바이패스 다이오드 고장, 모듈 간 설치각도 차이, 부분 음영 또는 음영 등)들 에 따라 발생하게 되는 다양한 전류-전압 특성 곡선들을 수집하여, 인공지능 학습을 위한 학습 데이터로 생성하 는 것이 바람직하다. 이 때, 단면 태양광 모듈 및 스트링에 대해, 다양한 고장 요소가 반영된 전류-전압 특성 곡선들, 양면 태양광 모듈 및 스트링에 대해, 다양한 고장 요소가 반영된 전류-전압 특성 곡선들을 각각 상이하게 수집하여 각각의 학습 데이터로 생성하는 것이 바람직하다. 학습 처리부는 미리 저장된 인공지능 알고리즘을 이용하여, 학습 데이터 수집부에서 생성한 학습 데 이터들에 대한 학습을 수행하고, 이에 따른 학습 결과 모델을 생성하는 것이 바람직하다. 이 때, 단면 태양광 모듈 및 스트링과 양면 태양광 모듈 및 스트링의 학습 데이터를 각각 생성한 바, 학습 처리 역시 각각 수행하여, 단면 태양광 모듈 및 스트링과 양면 태양광 모듈 및 스트링에 대한 각각의 학습 결과 모델 을 생성하는 것이 바람직하다. 또한, 고장 분석부는 고장 판단부의 판단 결과에 따라 태양광 모듈 및 스트링을 고장으로 판단될 경 우, 해당하는 태양광 모듈 및 스트링, 다시 말하자면, 고장으로 판단된 태양광 모듈 및 스트링에 대해서 측정 입력부를 통해서 입력받은 발전 성능 측정값에 포함되어 있는 전류-전압 특성 곡선을 생성한 학습 결과 모 델에 적용하여, 해당하는 고장 요소를 분류 분석하는 것이 바람직하다. 상세하게는, 고장으로 판단된 태양광 모듈 및 스트링이 단면 태양광 모듈일 경우, 측정 입력부를 통해서 입력받은 발전 성능 측정값에 포함되어 있는 전류-전압 특성 곡선을 생성한 학습 결과 모델 중 단면 태양광 모 듈 및 스트링에 대한 학습 결과에 따른 모델에 적용하여, 해당하는 고장 요소를 분류 분석하게 되며, 고장으로 판단된 태양광 모듈 및 스트링이 양면 태양광 모듈일 경우, 양면 태양광 모듈 및 스트링에 대한 학습 결과에 따 른 모델에 적용하여, 해당하는 고장 요소를 분류 분석하는 것이 바람직하다. 또한, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 방법은 도 5에 도시된 바와 같이, 성능 측정 단계(S100), 환경 측정 단계(S200), 사양 입력 단계(S300), 성능 추정 단계(S400) 및 고장 판단 단계 (S500)를 포함하여 구성되는 것이 바람직하다. 각 단계에 대해서 자세히 알아보자면, 성능 측정 단계(S100)는 측정 입력부에서, 외부 연계되어 있는 태양광 모듈 및 스트링의 성능 측정 장치를 통해서, 태양광 모듈 및 스트링의 현재 발전 성능 측정값을 입력받는 것이 바람직하다. 성능 측정 단계(S100)는 태양광 모듈 및 스트링의 현재 발전 성능 측정값으로는 전류-전압 특성 곡선(I-V curve)을 입력받는 것이 바람직하며, 태양광 모듈 및 스트링의 전압 측정값, 전류 측정값을 이용하여 생성되게 된다. 또한, 성능 측정 단계(S100)는 입력받은 전류-전압 특성 곡선을 분석하여 미리 설정된 전기적 파라미터들을 추 출하는 것이 바람직하다. 이 때, 미리 설정된 전기적 파라미터들로는, 최대 출력값(Pmp), 최대 전압값(Vmp), 최대 전류값(Imp), 개방 전압 값(Voc) 및 단략 전류값(Isc)을 추출하는 것이 바람직하며, 입력받은 전류-전압 특성 곡선을 분석하여 전기적 파 라미터들을 추출하는 것은 공지된 기술에 해당하기 때문에, 상세한 설명은 생략한다. 환경 측정 단계(S200)는 추정 연산부에서, 외부 연계되어 있는 수단 등을 통해서, 태양광 모듈 및 스트링 이 설치된 현재 위치에 대한 환경 조건값들을 입력받는 것이 바람직하며, 환경 조건값들로는 일사량, 외기 온도, 모듈 표면 온도 등을 포함하여 구성되는 것이 바람직하다.사양 입력 단계(S300)는 추정 연산부에서, 외부 관리자로부터 태양광 모듈의 설계 당시 미리 설정된 기본 스펙값(전기적 사양 등)들과, 태양광 스트링의 설계 당시 미리 설정된 직/병렬 구성값을 입력받는 것이 바람직 하다. 기본 스펙값의 일 예를 들자면, 개방 전압, 단락 전류 등을 포함하여 구성되며, 직/병렬 구성값의 일 예를 들자 면, 직렬 또는 병렬 연결 모듈 수 등을 포함하여 구성되는 것이 바람직하다. 성능 추정 단계(S400)는 추정 연산부에서, 환경 측정 단계(S200)에 의해 입력받은 환경 조건값들을 기반으 로, 태양광 모듈 및 스트링의 발전 성능 추정값을 연산하는 것이 바람직하다. 상세하게는, 성능 추정 단계(S400)는 미리 저장된 추정 알고리즘을 이용하여, 환경 측정 단계(S200)와 사양 입 력 단계(S300)를 통해서 입력받은 값들을 반영하여, 태양광 모듈 및 스트링의 전압, 전류값을 연산하는 것이 바 람직하다. 이 때, 추정 알고리즘을 미리 저장함에 있어서, 상기의 수학식들이 이용되는 것이 바람직하며, 상술한 바와 같 이, 추정 알고리즘을 설정함에 있어서, 단면 태양광 모듈과 양면 태양광 모듈을 각각 상이하게 설정하는 것이 바람직하다. 또한, 단면 태양광 모듈의 경우, 전면의 태양빛을 이용하여 발전하고, 양면 태양광 모듈의 경우, 전면 + 후면의 태양빛을 이용하여 발전하기 때문에, 단면 태양광 모듈의 경우, 전면 태양광 모듈로 해석되며, 양면 태양광 모 듈의 경우, 전면 태양광 모듈 + 후면 태양광 모듈로 해석되는 것이 바람직하다. 성능 추정 단계(S400)는 먼저, 전류값으로 전면 단락전류(Isc-전면)와 후면 단락전류(Isc-후면)를 분리하여 계산 하는 것이 바람직하다. 이 때, 전면 단락전류(Isc-전면)는 상기의 수학식 1을 토대로 연산하는 것이 바람직하며, 측정 모듈 온도, 전류 노화계수, 설치년수, 오염율을 반영하여 계산되게 된다. 후면 단락전류(Isc-후면)는 후면의 이득에 의해 결정되며, 후면 이득(BG, Backside Gain)은 상기의 수학식 2와 같이, 후면의 알베도값과 모듈의 설치높이에 따른 비로 표현되게 된다. 이를 통해서 후면 단락전류(Isc-후면)는 상기의 수학식 3과 같이, 계산된 후면 이득(BG)에 을 곱하여 계 산하는 것이 바람직하다. 이 후, 상술한 바와 같이, 단면 태양광 모듈의 경우, 전면 단락전류(Isc-전면) 자체로 단락전류가 연산되게 되며, 양면 태양광 모듈의 경우, 전면 단락전류(Isc-전면)와 후면 단락전류(Isc-후면)의 합으로 단락전류가 연산 되게 된다. 또한, 전압값으로 개방전압을 계산하는 것이 바람직하며, 단면 태양광 모듈과 양면 태양광 모듈의 개방전압이 동일하기 때문에, 상기의 수학식 4와 같이, 태양광 모듈의 정격 개방전압에서 측정 모듈 온도, 전류 노화계수, 설치년수 및 오염율을 반영하여 개방전압을 계산하는 것이 바람직하다. 단락전류와 개방전압을 통해서 전압-전류 계산을 수행하는 것이 바람직하며, 단면 태양광 모듈의 경우, 상기의 수학식 5와 같이 계산되며, 양면 태양광 모듈의 경우, 상기의 수학식 6과 같이 계산되는 것이 바람직하다. 고장 판단 단계(S500)는 고장 판단부에서, 성능 측정 단계(S100)에 의해 입력받은 발전 성능 측정값과 성 능 추정 단계(S400)에 의해 연산한 발전 성능 추정값을 비교 분석하여, 태양광 모듈 및 스트링의 고장 여부를 판단하는 것이 바람직하다. 상세하게는, 고장 판단 단계(S500)는 발전 성능 측정값과 발전 성능 추정값을 비교하여, 발전 성능 측정값에 대 한 미리 설정된 전기적 파라미터들의 각각의 손실량을 분석하는 것이 바람직하다. 즉, 상기의 수학식 7과 같이, 미리 설정된 전기적 파라미터들을 기준으로, 발전 성능 측정값과 발전 성능 추정 값을 비교하여 손실량을 연산하게 된다. 이 때, 고장 판단 단계(S500)는 연산한 각각의 전기적 파라미터들에 대한 발전 성능 측정값의 손실량을 상기의 표 1을 기준으로 분석하여 태양광 모듈 및 스트링의 고장 여부를 판단하는 것이 바람직하며, 정상 판단은 AND조건으로 각각의 손실량이 미리 설정된 전기적 파라미터들에 대한 각 기준범위를 모두 만족할 경우, 해당하는 태양광 모듈 및 스트링을 정상으로 판단하고, 고장 판단은 OR 조건으로 각각의 손실량이 미리 설정된 전기적 파 라미터들에 대한 각 기준범위들 중 어느 하나라도 불만족할 경우, 해당하는 태양광 모듈 및 스트링을 고장으로 판단하는 것이 바람직하다. 더불어, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 방법은 도 5에 도시된 바와 같이, 고장 판단 단계(S500)를 수행하고 난 후, 고장 분류 단계(S600)를 더 포함하여 구성되는 것이 바람직하다. 고장 분류 단계(S600)는 고장 분류부에서, 고장으로 판단된 태양광 모듈 및 스트링의 전류-전압 특정 곡선 의 인공지능 알고리즘을 통한 패턴 분석을 통해, 고장 분류를 수행하는 것이 바람직하다. 즉, 고장 분류 단계(S600)는 고장 판단 단계(S500))의 판단 결과에 따라, 태양광 모듈 및 스트링이 고장으로 판 단될 경우, 인공지능 알고리즘을 이용하여 태양광 모듈 및 스트링의 고장 요소를 분류 분석하는 것이 바람직하 다. 이 때, 고장 분류 단계(S600)는 사전에, 외부로부터 다양한 고장 요소가 미리 분류된 각각의 태양광 모듈 및 스 트링의 다양한 전류-전압 특성 곡선들을 수집하여 인공지능 학습을 위한 학습 데이터로 생성하는 것이 바람직하 다. 통상적으로 태양광의 전기적인 성능을 나타내는 전류-전압 특성 곡선은 고장 요소에 따라 서로 다른 패턴을 나 타내게 된다. 이러한 고장 요소에 따라 전류-전압 특성 곡선의 패턴이 상이함을 이용하여, 다양한 고장 요소 (PID 현상, 모듈 하단부의 오염, 바이패스 다이오드 고장, 모듈 간 설치각도 차이, 부분 음영 또는 음영 등)들 에 따라 발생하게 되는 다양한 전류-전압 특성 곡선들을 수집하여, 인공지능 학습을 위한 학습 데이터로 생성하 는 것이 바람직하다. 이 때, 단면 태양광 모듈 및 스트링에 대해, 다양한 고장 요소가 반영된 전류-전압 특성 곡선들, 양면 태양광 모듈 및 스트링에 대해, 다양한 고장 요소가 반영된 전류-전압 특성 곡선들을 각각 상이하게 수집하여 각각의 학습 데이터로 생성하는 것이 바람직하다. 또한, 고장 분류 단계(S600)는 미리 저장된 인공지능 알고리즘을 이용하여, 생성한 학습 데이터들에 대한 학습 을 수행하고, 이에 따른 학습 결과 모델을 생성하는 것이 바람직하다. 이 때, 단면 태양광 모듈 및 스트링과 양면 태양광 모듈 및 스트링의 학습 데이터를 각각 생성한 바, 학습 처리 역시 각각 수행하여, 단면 태양광 모듈 및 스트링과 양면 태양광 모듈 및 스트링에 대한 각각의 학습 결과 모델 을 생성하는 것이 바람직하다. 이를 통해서, 고장으로 판단된 태양광 모듈 및 스트링에 대해서 성능 측정 단계(S100)에 의해 입력받은 발전 성 능 측정값에 포함되어 있는 전류-전압 특성 곡선을 생성한 학습 결과 모델에 적용하여, 해당하는 고장 요소를 분류 분석하는 것이 바람직하다. 상세하게는, 고장으로 판단된 태양광 모듈 및 스트링이 단면 태양광 모듈일 경우, 입력받은 발전 성능 측정값에 포함되어 있는 전류-전압 특성 곡선을 생성한 학습 결과 모델 중 단면 태양광 모듈 및 스트링에 대한 학습 결과 에 따른 모델에 적용하여, 해당하는 고장 요소를 분류 분석하게 되며, 고장으로 판단된 태양광 모듈 및 스트링 이 양면 태양광 모듈일 경우, 양면 태양광 모듈 및 스트링에 대한 학습 결과에 따른 모델에 적용하여, 해당하는 고장 요소를 분류 분석하는 것이 바람직하다. 이를 통해서, 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템은 단면/양면 태양광 모듈 및 스트링의 고장 여부를 판단할 수 있을 뿐 아니라, 고장으로 판단된 태양광 모듈 및 스트링의 고장 이유, 즉, 고장 요소를 인공지능 알고리즘을 이용하여 매우 높은 정확도로 유추/진단할 수 있는 장점이 있다. 한편, 본 발명의 실시예에 따른 태양광 모듈 및 스트링의 고장진단 방법은 다양한 전자적으로 정보를 처리하는 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 저장 매체에 기록될 수 있다. 저장 매체는 프로 그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 저장 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 소프트웨어 분야 당업자에게 공지되어 사용 가능한 것일 수도 있다. 저장 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테 이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 전자적으로 정보를 처 리하는 장치, 예를 들어, 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 이상과 같이 본 발명에서는 구체적인 구성 소자 등과 같은 특정 사항들과 한정된 실시예 도면에 의해 설명되었 으나 이는 본 발명의 보다 전반적인 이해를 돕기 위해서 제공된 것 일 뿐, 본 발명은 상기의 일 실시예에 한정 되는 것이 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명의 사상은 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허 청구 범위뿐 아니라 이 특허 청구 범위와 균등하거나 등가적 변형이 있는 모든 것들은 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2021-0052747", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법에 적용된 양면 구성 의 태양광 모듈의 발전 원리를 나타낸 개략도이다. 도 2는 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템 및 그 방법에 적용된 양면 태양 광 모듈의 설치 높이에 따른 이득율(알베도, Albeo)을 나타낸 개략도이다. 도 3은 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템을 나타낸 구성 예시도이다.도 4는 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 시스템의 고장 분류부에 의한 학습 데이터들의 예시 그래프이다. 도 5는 본 발명의 일 실시예에 따른 태양광 모듈 및 스트링의 고장진단 방법을 나타낸 순서 예시도이다."}
