{"patent_id": "10-2018-0051478", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0127196", "출원번호": "10-2018-0051478", "발명의 명칭": "인공신경망을 이용한 야구 경기 실시간 예측 방법 및 장치", "출원인": "초록소프트 주식회사", "발명자": "김명락"}}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버에 의해 수행되는 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법에 있어서,(a) 사용자 단말로 경기가 종료되지 않은 현재와 미래의 야구 경기 목록과 질문 정보를 제공하고, 상기 사용자단말에서 선택된 야구 경기에 대한 경기대상정보와 질문정보를 수신하는 단계;(b) 경기대상정보에 대응하는 팀 또는 선수의 과거 플레이데이터와 실시간 플레이데이터 중 적어도 하나를 기반으로 인공지능 엔진을 통해 상기 경기대상정보 및 질문 정보에 대응하는 결과값을 추측하는 단계; 및(c) 상기 결과값을 상기 사용자 단말로 제공하는 단계;를 포함하되,상기 경기대상정보는 팀 정보 또는 선수 정보이며,상기 질문 정보는 경기가 종료되지 않은 야구 경기에 참여 중이거나 참여할 예정인 선수의 경기실적 예측정보및 팀의 경기실적 예측정보에 관한 질문이고,상기 (b) 단계는,선수의 타석당 결과값을 도출하고, 이를 기초로 상기 질문 정보에 대응하는 결과값을 추측하는 것인, 인공지능엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 질문정보는 타석당 결과값, 이닝당 결과값 및 경기점수 예측 결과값 중 적어도 하나의 형태로 제공되는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 질문정보가 선수의 타석당 결과값에 대한 질문인 경우, 상기 사용자 단말로부터 경기 정보, 선수 및 타석에 대한 선택 정보를 추가로 수신하고,상기 질문정보가 팀의 이닝당 결과값에 대한 질문인 경우, 상기 사용자 단말로부터 경기 정보, 팀 및 이닝에 대한 선택 정보를 추가로 수신하고,상기 질문정보가 팀의 경기점수 예측 결과값에 대한 질문인 경우, 상기 사용자 단말로부터 경기 정보에 대한 선택 정보를 추가로 수신하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 (c) 단계는상기 결과값을 제공하는 인터페이스를 기반으로 사용자가 선택한 선수나 팀에 대한 경기실적 예측정보에 대한결과를 숫자와 텍스트를 통해 하나의 문장으로 제공 하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,공개특허 10-2019-0127196-2-상기 결과값을 표시하는 인터페이스는 다른 질문 선택 기능 버튼 및 지난 예측 확인 기능 버튼을 더 포함하되,상기 다른 질문 선택 기능 버튼이 입력된 경우, 상기 질문정보를 통해 제공된 질문 중 다른 하나를 선택할 수있는 선택지를 제공하고,상기 지난 예측 확인 기능 버튼이 입력된 경우, 사용자가 선택한 상기 질문정보에 대응하는 다른 경기의 결과값을 제공하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서상기 (b) 단계는상기 사용자 단말이 선택한 상기 야구 경기가 실시간으로 수행되면, 상기 야구 경기에서 생성되는 실시간 플레이데이터를 수신 후 상기 결과값 추측에 반영하되,상기 플레이데이터는 선수의 플레이 결과에 관한 값으로서 속력, 위치 및 시간 중 적어도 하나를 포함하는 물리적요소인 물리데이터와 상기 야구 경기에 참여한 팀 단위의 경기 진행 정보를 포함하는 실적 데이터를 포함하는것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서상기 물리데이터는 경기장의 카메라를 통해 측정된 정보로부터 분석되어 수집되고,상기 실적 데이터 및 과거 플레이데이터는 야구관련 공식기관의 서버로부터 수집되는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서상기 (b) 단계는상기 질문정보에 따라서, 타석당 결과값을 기반으로 추가 분석 동작을 수행하되, 상기 질문정보가 이닝당 결과값이면, 상기 인공지능 엔진은 상기 타석당 결과값에 기초하여 이닝당 결과값을 예측하고,상기 질문정보가 경기점수 예측 결과값이면, 상기 인공지능 엔진은 상기 이닝당 결과값에 기초하여 경기점수 예측 결과값을 예측하는 계층적 예측 방식을 수행하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서상기 타석당 결과값은 출루하는 경우와 아웃되는 경우를 포함하는 복수의 상기 실적 데이터 중 어느 하나에 관한 것이고,상기 이닝당 결과값은 공수를 교대하는 경우를 포함하는 복수의 상기 실적 데이터 중 어느 하나를 포함하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서상기 결과값과 상기 실적 데이터를 비교하고, 해당 비교를 기초로 인공지능 엔진에 대한 학습을 추가로 수행하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2019-0127196-3-제 1 항에 있어서(a-1) 과거의 팀 또는 선수에 대한 상기 과거 플레이데이터들을 수집하고, 상기 과거 플레이데이터를 입력 레이어로 설정하고, 타석당 결과값, 이닝당 결과값, 경기점수 예측 결과값 중 적어도 하나를 출력 레이어로 설정하여, 복수 회의 학습을 수행함으로써, 뉴럴 네트워크 상의 상기 입력레이어와 출력레이어 사이의 히든레이어에대한 알고리즘을 수립하는 단계;를 더 포함하며,상기 (b) 단계는상기 알고리즘을 기반으로 상기 인공지능 엔진이 동작하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 장치에 있어서,사용자 단말이 선택한 팀 선택 정보 및 질문 정보를 수신하고, 인공지능 엔진을 통해 상기 질문 정보에 대응하는 경기 결과를 추측하는 프로그램이 저장된 메모리 및상기 메모리에 저장된 프로그램을 실행하여 상기 야구 경기의 결과를 추측하는 동작을 실행하는 프로세서를 포함하되,상기 프로세서는 사용자 단말로 경기가 종료되지 않은 현재와 미래의 야구 경기 목록과 질문 정보를 제공하고,상기 사용자 단말에서 선택된 야구 경기에 대한 경기대상정보와 질문정보를 수신하고, 경기대상정보에 대응하는팀 또는 선수의 과거 플레이데이터와 실시간 플레이데이터 중 적어도 하나를 기반으로 인공지능 엔진을 통해 상기 경기대상정보 및 질문 정보에 대응하는 결과값을 추측하고, 상기 결과값을 상기 사용자 단말로 제공하되,상기 경기대상정보는 팀 정보 또는 선수 정보이며, 상기 질문 정보는 경기가 종료되지 않은 야구 경기에 참여중이거나 참여할 예정인 선수의 경기실적 예측정보 및 팀의 경기실적 예측정보에 관한 질문이고,선수의 타석 결과값을 도출하고, 이를 기초로 상기 질문 정보에 대응하는 결과값을 추측하는 것인, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 장치."}
{"patent_id": "10-2018-0051478", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항 내지 제 10 항 중 어느 한 항에 따른 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공방법을 수행하는 프로그램이 기록된 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법에 있어서, (a) 사용자 단말로 경기가 종료되지 않은 현재와 미래의 야구 경기 목록과 질문 정보를 제공하고, 사용자 단말에 서 선택된 야구 경기에 대한 경기대상정보와 질문정보를 수신하는 단계; (b) 경기대상정보에 대응하는 팀 또는 선수의 과거 플레이데이터와 실시간 플레이데이터 중 적어도 하나를 기반으로 인공지능 엔진을 통해 경기대상정 보 및 질문 정보에 대응하는 결과값을 추측하는 단계; 및 (c) 결과값을 사용자 단말로 제공하는 단계;를 포함하 되, 경기대상정보는 팀 정보 또는 선수 정보이며, 질문 정보는 경기가 종료되지 않은 야구 경기에 참여 중이거나 참여할 예정인 선수의 경기실적 예측정보 및 팀의 경기실적 예측정보에 관한 질문이고, (b) 단계는 선수의 타석 당 결과값을 도출하고, 이를 기초로 질문 정보에 대응하는 결과값을 추측하는 방법이다."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 통해 야구 경기의 결과를 예측하는 방법 및 시스템에 관한 것이다. 더욱 상세하게는 선수의 과거 경기 데이터와 실시간 진행 중인 경기에서 생성되는 데이터를 이용해 해당 경기의 안타/아웃, 득점/실점을 예측하고 나아가 경기의 최종 결과를 예측할 수 있는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "세이버메트릭스란 SABR(the society for American baseball research)와 메트릭스(metrics)의 합성어로 여러 수학적/통계학적 방법론을 동원해 야구라는 스포츠를 '분자 단위로 분해'하는 연구를 뜻한다. 야구는 다른 스포츠와 달리, 과거부터 세이버메트릭스라는 이름으로 경기 결과에 대한 다양한 분석을 수행하였 고, 1990년대부터는 야구계에 많은 영향을 미치게 되었다. 이처럼 많은 사람들이 야구 경기의 결과 예측에 높은 관심을 가졌고, 그에 따라 다양한 방식이 연구되어 왔다. 하지만, 종래에 연구된 많은 경기 결과 예측 방법은 대부분 이미 경기가 수행되어 저장된 과거의 팀 혹은 선수 의 데이터를 활용하여 현재의 경기를 추측하는 방식이 대부분이다. 이러한 방식은 누적된 경기 정보가 적을 경우 추측의 정확도가 떨어진다는 한계점이 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제 10-2015-0171189 호(발명의 명칭: 빅데이터 기반의 스포츠 경기 실시간 예측 방법 및 시스템) (특허문헌 0002) 공개특허공보 제 10-2015-0171180 호(발명의 명칭: 빅데이터를 활용한 전략시뮬레이션 및 실시 간 승률예측 방법)"}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 과거에 진행된 야구 경기의 데이터 혹은 현재 수행되어 실시간으로 생성되는 야구 경기의 데이터를 이용하여 인공지능이 야구 경기의 결과를 예측하는 것을 목적으로 한다. 이를 자세하게 설명하면, 야구경기에 참가하는 선수가 보유한 과거 경기 데이터와 실시간으로 진행 중인 야구경 기에서 데이터를 추출하여 인공지능을 학습시키고, 현재 진행 중인 야구 경기의 결과를 정확하게 예측하도록 구 현하는 것을 목적으로 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 서버에 의해 수행되는 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 방법에 있어서, (a) 사용자 단말로 경기가 종료되지 않은 현재와 미래의 야 구 경기 목록과 질문 정보를 제공하고, 사용자 단말에서 선택된 야구 경기에 대한 경기대상정보와 질문정보를 수신하는 단계; (b) 경기대상정보에 대응하는 팀 또는 선수의 과거 플레이데이터와 실시간 플레이데이터 중 적 어도 하나를 기반으로 인공지능 엔진을 통해 경기대상정보 및 질문 정보에 대응하는 결과값을 추측하는 단계; 및 (c) 결과값을 사용자 단말로 제공하는 단계;를 포함하되, 경기대상정보는 팀 정보 또는 선수 정보이며, 질문 정보는 경기가 종료되지 않은 야구 경기에 참여 중이거나 참여할 예정인 선수의 경기실적 예측정보 및 팀의 경 기실적 예측정보에 관한 질문이고, (b) 단계는 선수의 타석당 결과값을 도출하고, 이를 기초로 질문 정보에 대 응하는 결과값을 추측하는 방법일 수 있다. 본 발명의 다른 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 제공 장치에 있 어서, 사용자 단말이 선택한 팀 선택 정보 및 질문 정보를 수신하고, 인공지능 엔진을 통해 질문 정보에 대응하 는 경기 결과를 추측하는 프로그램이 저장된 메모리 및 메모리에 저장된 프로그램을 실행하여 야구 경기의 결과 를 추측하는 동작을 실행하는 프로세서를 포함하되, 프로세서는 사용자 단말로 경기가 종료되지 않은 현재와 미 래의 야구 경기 목록과 질문 정보를 제공하고, 사용자 단말에서 선택된 야구 경기에 대한 경기대상정보와 질문 정보를 수신하고, 경기대상정보에 대응하는 팀 또는 선수의 과거 플레이데이터와 실시간 플레이데이터 중 적어 도 하나를 기반으로 인공지능 엔진을 통해 경기대상정보 및 질문 정보에 대응하는 결과값을 추측하고, 결과값을 사용자 단말로 제공하되, 경기대상정보는 팀 정보 또는 선수 정보이며, 질문 정보는 경기가 종료되지 않은 야구 경기에 참여 중이거나 참여할 예정인 선수의 경기실적 예측정보 및 팀의 경기실적 예측정보에 관한 질문이고, 선수의 타석 결과값을 도출하고, 이를 기초로 질문 정보에 대응하는 결과값을 추측하는 장치일 수 있다."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 야구 경기의 데이터를 수집하고, 인공지능을 기반으로 경기종료되지 않은 실시간 야구 경기의 결과뿐 만 아니라 미래 야구 경기의 결과를 예측할 수 있다. 이를 자세하게 설명하면, 야구경기에 참가하는 선수가 보유한 과거 경기 데이터와 실시간으로 진행 중인 야구경 기에서 데이터를 추출하여 인공지능을 학습시키고, 현재 진행 중인 야구 경기의 결과를 정확하게 예측하도록 구현할 수 있다."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하의 실시예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아니다. 따라서 본 발명과 동일한 기능을 수행하는 동일 범위의 발명 역시 본 발명의 권리 범위에 속할 것이다. 명세서 전체에서, 서버는 인공지능 엔진을 기반으로 야구 경기 실시간 예측 서비스 제공 장치를 의미할 수 있다. 도 1 은 본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 시스템의 구 성을 나타낸 도면이다. 도 1을 참조하면, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 시스템은 서버, 사용자 단 말, 야구 경기 데이터 수신 장비를 포함할 수 있고, 이들은 통신망을 통해 상호 연결될 수 있다. 본 발명의 일 실시예에 따른 서버는 사용자 단말에 탑재된 단말 어플리케이션을 통해 인공지능 엔진 을 기반으로 한 야구 경기 실시간 예측 서비스 가 제공될 수 있도록, 사용자 단말에 경기 목록 및 질문정 보를 제공하고, 사용자의 선택에 기초하여 결과값을 제공할 수 있다. 사용자 단말은 서버로부터 제공받은 경기 목록 및 질문정보를 확인하고, 제공 받고 싶은 정보에 대한 경기대상정보 및 질문정보를 선택하고, 선택에 기초하여 결과값을 제공받는 것을 특징으로 한다. 여기서 경기대상정보는 사용자 단말이 제공받고 싶은 대상의 정보로서 팀이나 선수가 될 수 있고, 질문정 보는 상기 선택한 팀이나 선수에 대해 알고 싶은 질문의 종류가 될 수 있다. 따라서 질문정보는 아직 경기가 종료되지 않은 야구 경기에 참여 중이거나 참여할 예정인 선수의 경기실적 예측 정보 및 팀의 경기실적 예측정보에 관한 질문이 될 수 있다. 사용자 단말에 의해 선택되어 서버로 전 달될 수 있는 질문정보로는 타석당 결과값, 이닝당 결과값 및 경기점수 예측 결과값 중 적어도 하나의 형태로 제공되어 사용자에게 선택 받게 되고, 각각의 질문정보에 대응하는 세부적인 하위 정보를 사용자의 선택에 따라 서버는 추가로 제공받을 수 있다. 예컨대 타석당 결과값에 대한 질문인 경우 사용자 단말로부터 경기 정보, 선수 및 타석에 대한 선택 정보 를 추가로 수신하고, 이닝당 결과값에 대한 질문의 경우 사용자 단말로부터 경기 정보, 팀 및 이닝에 대한 선택 정보를 수신하며, 경기점수 예측 결과값에 대한 질문이면 사용자 단말로부터 경기 정보를 추가로 수 신하게 된다. 여기서 경기 정보란 사용자가 선택할 수 있는 경기가 종료되지 않은 현재와 미래의 야구 경기 목록 중 사용자가 선택한 경기가 수행되는 날짜나 경기에 대한 특별한 정보가 될 수 있다. 각각의 질문정보는 사용자 단말에서 텍스트 형식의 인터페이스로 제공될 수 있으나, 선택적 실시예로 이미 지나 동영상으로 구성된 인터페이스로 질문정보를 제공할 수 있다. 예를 들어 경기를 수행하는 팀의 마스코트 이미지를 통해 팀을 선택하게 하는 등의 방법이 사용될 수 있게 되는 것이다. 또한, 서버는 다른 선택적 실시예로 사용자 단말에 경기대상정보 및 질문정보 이외에도 사용자가 선 택한 야구 경기에 대한 부가적인 정보나, 선수에 대한 세부 프로필 정보 등이 더 제공될 수 있다. 예컨대 야구 경기에 대한 부가적인 정보는 야구 경기가 이루어지는 경기장의 위치나 규모 등의 정보가 포함될 수 있고, 선수 에 대한 세부 프로필 정보는 해당 선수의 승률이나 주력 포지션 등을 제공할 수 있는 것이다. 사용자 단말은 서버로부터 제공받은 데이터들을 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 어플리케이션을 통해 표시할 수 있다. 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 어플리케이션은 사용자 단말에 내장된 어플리 케이션이거나, 어플리케이션 배포 서버로부터 다운로드되어 사용자 단말에 설치된 어플리케이션일 수 있다. 복수 개의 사용자 단말들은 유무선 통신 환경에서 단말 어플리케이션을 이용할 수 있는 통신 단말기를 의 미한다. 여기서 사용자 단말은 사용자의 휴대용 단말기일 수 있다. 도 1에서는 사용자 단말이 휴대용 단말기의 일종인 스마트폰(smart phone)으로 도시되었지만, 본 발명의 사상은 이에 제한되지 아니하며, 상술한 바와 같이 단말 어플리케이션을 탑재할 수 있는 단말에 대해서 제한 없이 차용될 수 있다. 이를 더욱 상세히 설명하면, 사용자 단말은 핸드헬드 컴퓨팅 디바이스(예를 들면, PDA, 이메일 클라이언트 등), 핸드폰의 임의의 형태, 또는 다른 종류의 컴퓨팅 또는 커뮤니케이션 플랫폼의 임의의 형태를 포함할 수 있 으나, 본 발명이 이에 한정되는 것은 아니다. 야구 경기 데이터 수신 장비는 실제 야구 경기장에 설치되어 실시간으로 수행되는 야구 경기의 실시간 플 레이데이터를 취득하고, 이를 서버로 전달하는 장비를 통칭할 수 있다. 여기서, 실시간 플레이데이터는 선수의 플레이 결과에 관한 값으로서 속력, 위치 및 시간 중 적어도 하나를 포 함하는 물리적요소인 물리데이터와 상기 야구 경기에 참여한 팀 단위의 진행 정보를 포함하는 실적 데이터를 포 괄하는 데이터가 될 수 있다. 물리데이터는 투수가 공을 던지는 속도나 각도, 주자의 도루 속도 등이 될 수 있고, 실적 데이터는 실시간으로 타석이나 이닝 상황, 점수 등이 여기에 포함될 수 있다. 물리데이터는 야구장에 설치된 카메라를 통해 경기에서 발생되는 다양한 물리데이터를 수집할 수 있으나, 선택 적 실시예로 카메라 이외의 멀티미디어 입력장치가 야구 경기 데이터 수신 장비에 포함될 수 있다. 예컨대 비디오 판독 시스템이 대표적으로 여기에 포함될 수 있으며, 그 외에 물리데이터를 취득할 수 있는 장비라면 야 구 경기 데이터 수신 장비로 활용될 수 있다. 실적 데이터는 야구 경기 데이터 수신 장비를 통해 야구장의 현지에서 직접 데이터를 서버가 수신할 수 있지만, 야구관련 공식기관의 서버로부터 수집될 수 있다. 야구관련 공식기관의 서버로부터 실적 데이터를 수집하는 경우 과거 플레이데이터에 대해서도 추가로 수집할 수 있다. 한편, 통신망은 서버와 사용자 단말들을 연결하는 역할을 수행한다. 즉, 통신망은 사용자 단말 들이 서버에 접속한 후 데이터를 송수신할 수 있도록 접속 경로를 제공하는 통신망을 의미한다. 통신망은 예컨대 LANs(Local Area Networks), WANs(Wide Area Networks), MANs(Metropolitan Area Networks), ISDNs(Integrated Service Digital Networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 도 2는 본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 서버의 구성 을 나타낸 도면이다.도 2를 참조하면, 본 발명의 일 실시예에 따른 서버는 통신부, 메모리, 프로세서 및 데이 터베이스를 포함한다. 상세히, 통신부는 통신망과 연동하여 서버, 사용자 단말, 야구 경기 데이터 수신 장비 간 의 송수신 신호를 패킷 데이터 형태로 제공하는 데 필요한 통신 인터페이스를 제공한다. 나아가, 통신부는 사용자 단말 및 야구 경기 데이터 수신 장비로부터 데이터 요청을 수신하고, 이에 대한 응답으로서 데이터를 송신하는 역할을 수행할 수 있다. 여기서, 통신부는 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치일 수 있다. 메모리는 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스를 수행하기 위한 프로그램이 기록된 다. 또한, 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행한다. 여기서, 메 모리는 자기 저장 매체(magnetic storage media) 또는 플래시 저장 매체(flash storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 프로세서는 일종의 중앙처리장치로서 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스를 제공 하는 전체 과정을 제어한다. 프로세서가 수행하는 각 단계에 대해서는 도 3을 참조하여 후술하기로 한다. 여기서, 프로세서는 프로세서(processor)와 같이 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 여기서, '프로세서(processor)'는, 예를 들어 프로그램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이크로프로세서(microprocessor), 중앙처리장치 (central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망 라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 데이터베이스는 인공지능 엔진의 학습 및 사용자 단말로 제공하기 위한 팀 또는 선수의 과거 플레이 데이터가 저장될 수 있고, 필요에 따라 실시간 플레이데이터도 수신되어 저장될 수 있다. 또한, 선택적 실시예로 데이터베이스는 사용자 단말에서 특정 선수, 팀 혹은 경기에 대한 정보를 요 청하는 경우 별도의 페이지로 제공하기 위한 정보가 더 포함될 수 있다. 도 3은 본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 방법을 나타 낸 동작 흐름도이다. 도 3을 참조하면, 먼저 사용자 단말로부터 경기가 종료되지 않은 현재와 미래의 야구 경기 목록과 질문 정보를 제공하고, 상기 사용자 단말에서 선택된 야구 경기에 대한 경기대상정보와 질문정보를 수신한다(S310). 경기대상정보에 대응하는 팀 또는 선수의 과거 플레이데이터와 실시간 플레이데이터 중 적어도 하나를 기반으로 인공지능 엔진을 통해 상기 경기대상정보 및 질문 정보에 대응하는 결과값을 추측한다(S320). 단계(S320)에서 서버는 인공지능 엔진을 이용하여 선수의 타석당 결과값을 도출하고, 이를 기초로 상기 질 문 정보에 대응하는 결과값을 추측하게 되는 것이다. 이때, 인공지능 엔진이 질문정보에 대한 결과값을 추측하 게 되는 과정은 후술할 도 4a를 통해 설명하도록 한다. 단계(S320)를 통해 추측된 결과값을 사용자 단말로 제공한다(S330). 사용자 단말로 제공되는 결과값의 인터페이스는 사용자가 선택한 선수나 팀에 대한 경기실적 예측정보에 대한 결과를 숫자와 텍스트를 통해 하나의 문장으로 제공하게 되는데, 선택적 실시예로 이미지나 동영상 등이 더 추가될 수 있다. 사용자 단말로 제공되는 인터페이스에 관한 상세한 설명은 후술할 도 6 내지 도 7을 통해 진행하도록 한다. 도 4a 내지 도 4c는 본 발명의 일 실시예에 따른, 인공지능 엔진의 구동 원리를 설명하기 위한 예시도면이다. 먼저 도 4a를 참조하면, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스는 계층적인 구조를 통해 결과값을 추측하게 된다.이를 상세하게 설명하면, 과거의 팀 또는 선수에 대한 과거 플레이데이터들을 수집하고, 해당 데이터를 입력레 이어로 설정하게 된다. 또한, 타석당 결과값, 이닝당 결과값, 경기점수 예측 결과값 중 적어도 하나를 출력 레 이어로 설정하면, 복수 회의 학습을 수행함으로써, 뉴럴 네트워크 상의 입력레이어와 출력레이어 사이의 히든레 이어에 대한 알고리즘이 수립되는 것이다. 위의 설명을 적용하여 질문정보에 대한 결과값을 추측하는 과정을 설명하면, 인공지능 엔진은 과거에 수집되거 나, 실시간으로 수집되는 플레이데이터를 통해 선수의 타석당 결과값을 추측하게 된다. 만약 사용자 단말이 선택한 질문정보가 타석당 결과값인 경우 인공지능 엔진을 통한 추측은 타석당 결과값 을 추측하는 단계에서 종료된다. 하지만 질문정보가 이닝당 결과값이면 인공지능 엔진은 타석당 결과값에 기초 하여 이닝당 결과값을 예측하고, 질문정보가 경기점수 예측 결과값이면 이닝당 결과값을 통해 경기점수 예측 결 과값을 추측하는 일종의 계층적 예측 방식이 적용되는 것이다. 이때, 타석당 결과값은 출루하는 경우와 아웃되는 경우를 포함하는 복수의 실적 데이터(예를 들어, 안타, 볼넷, 삼진, 데드볼 등) 중 어느 하나에 관한 것을 사용하고, 이닝당 결과값은 공수를 교대하는 경우를 포함한 복수의 실적 데이터(예를 들어, 1회초 A : B = 1:0, 1회말 A : B = 1:1) 중 어느 하나를 포함하게 된다. 이를 쉽게 설명하면, 타자와 상대 투수의 데이터를 기반으로 해당 타석 타자의 안타 또는 아웃을 예측하게 되고, 이를 규합하여 이닝당 점수를 예측할 수 있게 되는 것이다. 또한, 이닝당 점수 예측이 완료된다면, 이를 통해 최종적으로 경기의 승패나 점수 예측이 가능하게 되는 것이다. 이러한 방식은 야구 경기의 다양한 결과를 예측할 수 있도록 인공지능 엔진을 학습시킬 수 있고, 사용자의 질문 에 유연한 답변을 전달할 수 있는 강점을 가지게 된다. 또한, 실시간 데이터를 인풋(input)값으로 전달할 수 있 기 때문에 보다 명확하고 신뢰성 있는 결론의 도출이 가능한 것이다. 또한, 인공지능 엔진을 적용하여 추측한 결과값과 실제 실적 데이터와 비교하면서, 인공지능 엔진에 대한 학습 을 추가로 실시할 수도 있을 것이다. 도 4b를 참조하면, 본 발명이 RNN(recurrent neural networks) 계열의 알고리즘을 적용할 수 있음을 알 수 있 다. 본 발명의 서비스를 구현하기 위해 인공지능 엔진으로 적용할 수 있는 대표적인 알고리즘은 RNN(recurrent neural networks)계열이 사용될 수 있다. 그림(a)은 싱글 레이어를 가지고 있는 표준 RNN모듈을 나타낸 것으로 RNN 알고리즘은 루프가 들어있어 과거의 데이터가 미래에 영향을 줄 수 있는 구조를 가지는 것이 특징이다. 특히 그림 (b)는 RNN계열 중에서도 특별한 종류인 LSTM(long short-term memory models)을 나타낸 것으로 LSTM 에 포함되어 있는 4개의 레이어가 상호작용을 반복되는 형태를 가진다. 이를 통해 RNN에서 반복되는 네트워크 체인 중 단일 레이어를 사용하는 부분을 4개의 상호작용 가능한 특별한 방식의 구조로 형성되어 표준 RNN모델이 가지는 장기의존성 문제를 해결할 수 있게 되는 것이다. 하지만, RNN 계통의 알고리즘을 통해 본 발명의 서비스를 설명하는 것은 하나의 예시이며, 랜덤포레스트, 서포 트 벡터 머신 등과 같은 인공지능 엔진이 이용할 수 있다. 또한, 단순 회귀 모델의 히든 레이어 수를 증가시킬 수도 있기 때문에 구현이 가능하다면, 어떠한 알고리즘을 적용하는 것인지 여부가 본 발명의 범위를 제한하지 않는다. 도 4c를 참조하면, 인공지능 엔진을 기반으로 한 야구 경기를 실시간 예측하기 위해 필요한 독립변수를 예시로 나타낸 것이다. 이를 자세하게 설명하면, 야구 경기에 대해 예측하기 위해 사용하는 과거 플레이데이터와 실시간 플레이데이터 들은 독립변수 및 종속변수들로 구성될 수 있는데, 이하는 대표적으로 사용될 수 있는 독립변수에 대해 나열한 것이다. 인공지능 엔진이 학습을 수행하기 위해서는 각 팀마다의 변수를 파악하고 있어야 한다. 예컨대 도면에 제시된 바와 같이 인공지능 엔진이 수집하는 정보는 크게 4가지 카테고리를 가지게 되는데, \"투수 능력치\", \"타자 능력 치\", \"수비 능력치\", \"주루 능력치\" 등을 포함할 수 있고, 각 능력치마다 하위 능력치가 속할 수 있다. 또한, 하위 능력치로는 예를 들어 \"투수 능력치\"에는 평균자책점, 경기, 승리, 패배, 세이브, 홀드, 승률, 이닝, 피안타, 피홈런, 볼넷, 사구, 삼진, 실점, 자책점, 이닝당 출루허용률 등이 포함될 수 있고, \"타자 능력 치\"에는 평균 타율, 경기, 타석, 타수, 득점, 안타, 2루타, 3루타, 홈런, 루타, 타점, 희생번트, 희생플라이 등 이 포함될 수 있다. \"수비 능력치\"는 포지션, 경기, 선발경기, 수비이닝, 실책, 견제사, 자살, 보살, 병살, 수 비율, 포일, 도루허용, 도루실패, 도루저지율이 포함될 수 있고, 마지막으로 \"주루 능력치\"로는 경기, 도루시도, 도루허용, 도루실패, 주루사, 견제사 등이 포함될 수 있다. 도 5는 본 발명의 일 실시예에 따른, 실시간으로 수신하는 물리 데이터의 예시를 나타낸 도면이다. 도 5를 참조하면, 투구 상황에서 야구 경기 데이터 수신 장비가 수집할 수 있는 물리 데이터의 종류를 나 타낸 것이다. 물리데이터는 앞서 설명한 바와 같이 야구 경기장에 구비된 카메라를 통해 측정하게 된다. 투구 시 측정할 수 있는 대표적인 물리데이터는 피치 속도, 회전(속도/축/기울기), 해방 각(수평/수직), 해방 점(수평/높이), 연장 (extension) 인지 속도, 이동(수평/수직 중단), 판 위치(plate location)(높이/면), 접 근각(수평/수직 중단), 구역 속도, 구역 시간이 될 수 있다. 또한, 도 5에는 도시되지 않았지만 타자, 도루 상황, 수비측 선수들에게서도 다양한 물리데이터를 획득할 수 있 다. 타자의 경우 방향(vector), 비행시간(projected hang time), 예상 타격 거리, 출구 속도, 시각 각(수직 / 수평), 타격 점(수평/높이)가 포함될 수 있고, 도루 상황에는 디그 스피드(dig speed), 추가 베이스(extra bases), 홈런 트롯(home run trot), 리드 거리, 2차 리드(볼이 투수로 방출될 때의 거리), 퍼스트 스탭(first step)(bat-on-ball 접촉 시 경과 시간), 스틸링 퍼스트 스탭(stealing first step)(투수의 첫 번째 이동 시 간)이 될 수 있다. 마지막으로 수비측 선수는 퍼스트 스탭(first step)(경과된 시간), 퍼스트 스탭 효율(first step efficiency)(퍼스트 스탭의 직선거리에 대한 각도 편차), 최고속도, 가속도, 직선거리, 총 거리, 외야 루 트 효율(outfield route efficiency)(직선/총 거리), 교환, 피봇(pivot), 최대 던지기 속도, 포수 교환 등을 획득할 수 있다. 선택적 실시예로 경기장의 환경이나, 경기에 사용되는 장비에 대한 정보를 추가로 수집하여 결과값 추측의 정확 도를 높일 수 있다. 상기 측정된 물리데이터는 야구 경기 데이터 수신 장비를 통해 서버로 전달되고, 서버는 실시간 데이터를 인공지능 엔진에 적용하여 서비스의 정확도를 높이게 되는 것이다. 도 6 내지 도 7은 본 발명의 일 실시예에 따른, 사용자 단말을 통해 제공하는 인터페이스 화면의 예시를 나타낸 예시도면이다. 도 6을 참조하면, 인공지능 엔진을 기반으로 야구 경기 실시간 예측 서비스를 위한 질문 선택 화면으로 질문정 보, 하위 선택 정보가 포함될 수 있다. 인터페이스의 첫 화면에는 사용자가 원하는 질문정보가 텍스트가 쓰여진 버튼으로 구성될 수 있다. 도 6에 도시되어 있는 예시로는 \"Q 타석 당 결과는?\", \"Q 이닝 당 결과는?\", \"Q 경기 점수 예측은?\" 의 텍스트가 작성 된 3개의 버튼으로 질문정보를 선택할 수 있도록 인터페이스를 제공하게 된다. 만약 사용자가 질문정보를 선택하는 경우 사용자 단말은 서버로부터 제공받은 질문정보에 매핑하는 하위 선택 정보를 추가로 사용자에게 제시하여 세부 정보를 수신할 수 있다. 예를 들어 사용자가 \"Q 타석 당 결과는?\"을 선택하여 입력하면, 경기 정보인 경기 날짜와 경기명, 선수 혹은 타 석을 선택할 수 있도록 하위 선택 정보를 선택할 수 있는 인터페이스를 추가로 제공하게 된다. 또한, 앞서 서술한 바와 같이, 사용자 단말을 통해 제시되는 질문정보의 선택에 따라 사용자가 선택 할 수 있는 하위 선택 정보가 달라지게 된다. 도 7은 인공지능 엔진을 기반으로 야구 경기 실시간 예측 서비스의 결과 화면으로 결과값, 다른 질문 선택 기능 버튼, 지난 예측 확인 기능 버튼을 포함할 수 있다. 앞서 서술한 바와 같이, 결과값을 제공하는 인터페이스는 숫자나 텍스트를 통해 하나의 문장으로 제공될 수 있다. 또한, 결과값을 표시하는 인터페이스에는 다른 질문 선택 기능 버튼, 지난 예측 확인 기능 버튼(73 0)이 더 포함될 수 있다.먼저, 다른 질문 선택 기능 버튼을 입력하는 경우, 사용자가 선택한 질문정보를 통해 제공된 질문 중 다른 하나를 다시 선택할 수 있도록 선택지가 제공되거나, 첫 질문정보 선택화면으로 돌아갈 수 있다. 이때, 사용자가 기 선택한 질문정보 이외에 다른 질문을 선택할 수 있도록 선택지가 주어지는 경우, 사용 자의 편의를 위해 \"경기 정보\"와 같은 일부 하위 선택 정보를 동일하게 매핑 후 결과값을 제공할 수 있다. 지난 예측 확인 기능 버튼이 입력된 경우, 사용자가 선택한 질문정보에 대응하는 다른 경기의 결과값 을 제공하게 된다. 예컨대, A경기의 이닝당 결과값을 확인한 후 지난 예측 확인 기능 버튼을 입력하면, A경기를 포함한 확인 가능한 경기의 목록이 제공되고 사용자가 B경기를 선택하면 B경기의 이닝당 결과값이 제공되는 것이다. 본 발명의 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구 조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비 휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 본 발명의 방법 및 시스템은 특정 실시예와 관련하여 설명되었지만, 그것들의 구성 요소 또는 동작의 일부 또는 전부는 범용 하드웨어 아키텍쳐를 갖는 컴퓨터 시스템을 사용하여 구현될 수 있다."}
{"patent_id": "10-2018-0051478", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2018-0051478", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 시스템의 구 성을 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 서버의 구성 을 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른, 인공지능 엔진을 기반으로 한 야구 경기 실시간 예측 서비스 방법을 나타 낸 동작 흐름도이다. 도 4a 내지 도 4c는 본 발명의 일 실시예에 따른, 인공지능 엔진의 구동 원리를 설명하기 위한 예시도면이다. 도 5는 본 발명의 일 실시예에 따른, 실시간으로 수신하는 물리 데이터의 예시를 나타낸 도면이다. 도 6 내지 도 7은 본 발명의 일 실시예에 따른, 사용자 단말을 통해 제공하는 인터페이스 화면의 예시를 나타낸 예시도면이다."}
