{"patent_id": "10-2018-0038827", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0119225", "출원번호": "10-2018-0038827", "발명의 명칭": "각각의 인공지능을 탑재한 복수의 로봇을 포함하는 로봇 시스템", "출원인": "엘지전자 주식회사", "발명자": "최혁두"}}
{"patent_id": "10-2018-0038827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각각의 제 1 인공지능을 탑재한 복수의 로봇; 및 소정의 클라우드 네트워크를 통해 상기 복수의 로봇과 연계되고 상기 제 1 인공지능보다 높은 성능의 제 2 인공지능을 탑재한 메인 관리 서버를 포함하고,상기 복수의 로봇 각각은,주위 환경에 대응한 센싱데이터를 수집하는 센싱처리부;딥 러닝 알고리즘(Deep Learning Algorism) 기반으로 소정의 학습데이터에 기초하여 상기 제 1 인공지능을 훈련하는 로컬 훈련처리부; 및상기 제 1 인공지능을 이용하여 상기 센싱데이터에 대응한 제 1 분석결과데이터를 산출하는 로컬 분석처리부를포함하며, 상기 로컬 훈련처리부는 상기 메인 관리 서버의 상기 제 2 인공지능을 이용하여 상기 센싱데이터를 분석한 결과에 대응하는 제 2 분석결과데이터에 기초하여 상기 제 1 인공지능을 재훈련하는 로봇 시스템."}
{"patent_id": "10-2018-0038827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 메인 관리 서버는 상기 딥 러닝 알고리즘(Deep Learning Algorism) 기반으로 상기 소정의 학습데이터에 기초하여 상기 제 2 인공지능을 훈련하는 메인 훈련부; 및상기 제 2 인공지능을 이용하여 상기 제 2 분석결과데이터를 산출하는 메인 분석부를 포함하는 로봇 시스템."}
{"patent_id": "10-2018-0038827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 메인 관리 서버는상기 각 로봇의 센싱데이터를 보유하는 센싱 데이터베이스; 및사용자의 입력에 따라 상기 센싱 데이터베이스에 보유된 데이터 중 적어도 일부를 레이블링하여 부가 학습데이터를 생성하는 학습데이터 부가 생성부를 더 포함하는 로봇 시스템."}
{"patent_id": "10-2018-0038827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 메인 훈련부는 상기 부가 학습데이터에 기초하여 상기 제 2 인공지능을 재훈련하는 로봇 시스템.공개특허 10-2019-0119225-3-청구항 5 제 3 항에 있어서,상기 로컬 훈련처리부는 상기 부가 학습데이터에 기초하여 상기 제 1 인공지능을 재훈련하는 로봇 시스템."}
{"patent_id": "10-2018-0038827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 메인 관리 서버는 상기 복수의 로봇과 데이터를 송수신하는 클라우드 통신부를 더 포함하고,상기 각 로봇은 상기 메인 관리 서버의 상기 클라우드 통신부에 연결되는 통신처리부를 더 포함하며,상기 각 로봇의 상기 통신처리부는 소정 주기로 상기 센싱데이터를 상기 클라우드 통신부로 송신하는 로봇 시스템."}
{"patent_id": "10-2018-0038827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 메인 관리 서버는 상기 복수의 로봇과 데이터를 송수신하는 클라우드 통신부를 더 포함하고,상기 각 로봇은 상기 메인 관리 서버의 상기 클라우드 통신부에 연결되는 통신처리부를 더 포함하며,상기 클라우드 통신부는 소정 주기로 상기 각 로봇과의 통신망이 정상상태인지 여부를 검출하고, 상기 검출된통신망의 상태에 기초하여 센싱데이터 요청신호를 상기 각 로봇의 상기 통신처리부로 송신하며,상기 각 로봇의 상기 통신처리부는 상기 센싱데이터 요청 메시지에 기초하여 상기 센싱데이터를 상기 클라우드통신부로 송신하는 로봇 시스템."}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 각각의 인공지능을 탑재한 복수의 로봇을 포함하는 로봇 시스템에 관한 것이다. 본 발명의 일 실시예 에 따른 로봇 시스템은 각각의 제 1 인공지능을 탑재한 복수의 로봇 및 소정의 클라우드 네트워크를 통해 복수의 로봇과 연계되고 제 1 인공지능보다 높은 성능의 제 2 인공지능을 탑재한 메인 관리 서버를 포함한다. 여기서, 각 로봇은 주위 환경에 대응한 센싱데이터를 수집하는 센싱처리부, 딥 러닝 알고리즘(Deep Learning Algorism) 기반으로 소정의 학습데이터에 기초하여 제 1 인공지능을 훈련하고 메인 관리 서버의 제 2 인공지능을 이용하여 센싱데이터를 분석한 결과인 제 2 분석결과데이터에 기초하여 제 1 인공지능을 재훈련하는 로컬 훈련처리부, 및 제 1 인공지능을 이용하여 센싱데이터에 대응한 제 1 분석결과데이터를 산출하는 로컬 분석 처리부를 포함한다."}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 각각의 인공지능을 탑재한 복수의 로봇을 포함하는 로봇 시스템에 관한 것이다."}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇은 산업용으로 개발되어 공장 자동화의 일 부분을 담당하여 왔다. 최근에는 로봇을 응용한 분야가 더욱 확 대되어, 의료용 로봇, 우주 항공 로봇 등이 개발되고, 일반 가정에서 사용할 수 있는 가정용 로봇도 만들어지고 있다. 이러한 로봇은 인간과 더욱 유사하게 제어 및 구동되기 위하여 인공지능(Artificial Intelligence, AI)을 탑재 할 수 있다. 인공지능은 사고, 학습 및 자기 개발 등과 같은 인간의 지능적인 행동을 모방하도록 구현된 프로그 램 또는 연산처리방법을 지칭할 수 있다. 로봇에 탑재된 인공지능은 그의 역할에 대응한 학습데이터에 기초하여 훈련된 상태에서 데이터 분석을 실시하거나, 또는 미훈련 상태에서 데이터의 분석과 학습을 실시할 수 있다. 이 를 위해, 로봇의 사용자는 인공지능의 훈련을 위한 학습데이터의 제공 또는 분석된 데이터에 대한 레이블링 (Labeling)을 실시할 필요가 있다. 특히, 복수의 로봇을 포함하는 시스템인 경우, 각 로봇에 대해 인공지능 훈련을 실시해야 하므로, 훈련에 소모 되는 시간 및 인력이 감소되기 어려운 문제점이 있다. 이와 관련하여, 대한민국 특허공개공보 제10-2017-0000751호 (2017.01.03 공개)에는 지능 로봇에 설치된 결책 엔진이 클라우드 처리 정보를 생성하고, 클라우드 제어 센터가 클라우드 처리 정보에 대한 분석을 실시하여 그결과인 사용자 수요를 결책 엔진으로 피드백하는 지능 로봇 제어 시스템을 개시한다. 그리고, 대한민국 특허공개공보 제10-2017-0101455호 (2017.09.06 공개)에는 복수의 로봇이 각각의 수집 데이터 를 네트워크 망을 통해 메인서버로 전달하고, 메인서버는 인공지능을 기반으로 각 로봇의 수집 데이터를 분석하 여 산출된 특징 맵 결과를 각 로봇으로 전달하는 방법을 개시한다. 이러한 선행 기술문헌들에 따르면, 각 로봇에 의해 수집된 데이터는 메인서버로 전달되고 메인서버의 인공지능 에 의해 분석되므로, 복수의 로봇이 인공지능을 탑재할 필요가 없다. 이에 따라, 복수의 로봇에 탑재된 인공지 능을 훈련하는 과정이 배제될 수 있다. 그러나, 선행 기술문헌들에 따르면, 각 로봇에 의해 수집된 데이터의 분석 처리가 메인서버에서 실시되므로, 복 수의 로봇과 메인서버 간의 통신망이 불안정한 경우, 수집 데이터의 전달 실패 및 특징 맵 결과의 전달 실패로 인해, 각 로봇에서 수집된 데이터의 분석 처리가 불가능해지는 문제점이 있다. 더불어, 선행 기술문헌에 따르면, 각 로봇에서 데이터의 분석 처리가 실시되는 것이 아니므로, 각 로봇에서 수 집된 데이터를 메인서버로 전달하는 과정과, 메인서버에 의해 실시된 분석 결과를 각 로봇으로 전달하는 과정에 따른 지연시간이 발생될 수 있다. 그리고, 복수의 로봇에서 수집된 데이터의 분석 처리가 메인서버로 집중됨으 로써, 메인서버의 분석 처리 지연이 발생될 수 있다. 이러한 지연시간 및 분석 처리 지연으로 인해, 복수의 로 봇에서 수집된 데이터에 대한 분석 처리의 실시간성이 향상되는 데에 한계가 있는 문제점이 있다."}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 네트워크 상태에 관계없이 복수의 로봇에 의해 수집된 데이터에 대한 분석 처리가 안정적으로 실시될 수 있는 로봇 시스템을 제공하는 것이다. 본 발명의 목적은 복수의 로봇에 의해 수집된 데이터에 대한 분석 처리의 실시간성이 향상될 수 있는 로봇 시스 템을 제공하는 것이다. 본 발명의 목적은 복수의 로봇 각각에 탑재된 인공지능의 훈련을 실시하는 데에 소모되는 시간 및 인력이 감소 될 수 있는 로봇 시스템을 제공하는 것이다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 로봇 시스템은 각각의 제 1 인공지능을 탑재한 복수의 로봇, 및 복수의 로봇과 연 계되고 제 1 인공지능보다 높은 성능의 제 2 인공지능을 탑재한 메인 관리 서버를 포함한다. 여기서, 복수의 로 봇 각각은 주위 환경에 대응한 센싱데이터를 수집하는 센싱처리부와, 제 1 인공지능을 이용하여 센싱데이터에 대응한 제 1 분석결과데이터를 산출하는 로컬 분석 처리부를 포함한다. 이와 같이 복수의 로봇 각각은 제 1 인 공지능 및 로컬 분석 처리부를 포함함으로써, 메인 관리 서버와 연결되지 않더라도 센싱데이터에 대응한 제 1 분석결과데이터를 산출할 수 있다. 그러므로, 네트워크 상태에 관계없이 복수의 로봇에 의해 수집된 데이터에 대한 분석 처리가 안정적으로 실시될 수 있다. 더불어, 각 로봇이 제 1 분석결과데이터를 산출함에 따라, 센싱데이터를 메인 관리 서버로 전달하고 메인 관리 서버에 의해 센싱데이터를 분석한 결과를 수신하기까지의 지연시간이 불필요하고, 센싱데이터의 분석 처리가 메 인 관리 서버에 집중되는 것이 방지된다. 이로써, 센싱데이터에 대응한 제 1 분석결과데이터를 산출하는 데에 실시간성이 향상될 수 있다. 그리고, 본 발명의 일 실시예에 따르면, 각 로봇은 딥 러닝 알고리즘 기반으로 소정의 학습데이터에 기초하여 제 1 인공지능을 훈련하고, 메인 관리 서버의 제 2 인공지능에 의한 센싱데이터의 분석 결과에 기초하여 제 1인공지능을 재훈련하는 로컬 훈련처리부를 더 포함한다. 이로써, 복수의 로봇에 탑재된 제 1 인공지능을 훈련하 는 데에 소모되는 시간 및 인력이 감소될 수 있다."}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 로봇 시스템은 각각의 제 1 인공지능을 탑재한 복수의 로봇, 및 복수의 로봇과 연 계되고 제 1 인공지능보다 높은 성능의 제 2 인공지능을 탑재한 메인 관리 서버를 포함한다. 여기서, 복수의 로 봇 각각은 주위 환경에 대응한 센싱데이터를 수집하는 센싱처리부와, 제 1 인공지능을 이용하여 센싱데이터에 대응한 제 1 분석결과데이터를 산출하는 로컬 분석 처리부를 포함한다. 이와 같이 각 로봇의 로컬 분석 처리부는 제 1 인공지능을 이용하여 센싱데이터에 대한 분석 처리를 실시하고 센싱데이터에 대한 분석 처리의 결과로서 제 1 분석결과데이터를 산출한다. 즉, 복수의 로봇은 각각의 센싱데이 터에 대한 분석 처리를 자체적으로 실시한다. 그러므로, 복수의 로봇과 메인 관리 서버 사이의 연결이 불안정한 경우에도, 복수의 로봇에 의해 수집된 센싱데이터에 대한 분석 처리가 안정적으로 실시할 수 있는 장점이 있다. 더불어, 본 발명의 일 실시예에 따르면, 각 로봇의 센싱데이터에 대한 분석 처리가 메인 관리 서버가 아니라 각 로봇의 로컬 분석 처리부에 의해 실시된다. 그러므로, 각 로봇의 센싱데이터가 메인 관리 서버로 전달되기까지 의 지연기간 및 메인 관리 서버에 의한 센싱데이터의 분석 처리결과가 각 로봇으로 전달되기까지의 지연기간이 배제될 수 있는 장점이 있다. 또한, 복수의 로봇의 센싱데이터에 대한 분석 처리가 메인 관리 서버로 집중되는 것이 방지될 수 있는 장점이 있다. 이로써, 복수의 로봇에 의해 수집된 센싱데이터에 대한 분석 처리의 실시간성이 향상될 수 있는 장점이 있다. 그리고, 본 발명의 일 실시예에 따른 로봇 시스템에 있어서, 각 로봇은 딥 러닝 알고리즘 기반으로 소정의 학습 데이터에 기초하여 제 1 인공지능을 훈련하고, 메인 관리 서버의 제 2 인공지능에 의한 센싱데이터의 분석 결과 인 제 2 분석결과데이터에 기초하여 제 1 인공지능을 재훈련하는 로컬 훈련처리부를 더 포함한다. 이러한 각 로봇의 로컬 훈련처리부에 의해, 제 1 인공지능은 소정의 학습데이터 및 제 2 인공지능에 의한 제 2 분석결과데이터에 기초하여 훈련될 수 있다. 이로써, 시스템 사용자가 복수의 로봇 각각에 대해 제 1 인공지능 의 훈련을 반복적으로 실시할 필요가 없고, 제 1 인공지능의 훈련을 위하여 복수의 로봇 각각에 대해 레이블링 을 실시할 필요가 없다. 그러므로, 복수의 로봇에 탑재된 제 1 인공지능을 훈련하는 데에 소모되는 시간 및 인 력이 감소될 수 있는 장점이 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2018-0038827", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참 조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 이하에서는, 도 1, 도 2, 도 3 및 도 4를 참조하여 본 발명의 일 실시예에 따른 로봇 시스템을 설명한다. 도 1은 본 발명의 일 실시예에 따른 로봇 시스템을 나타낸 도면이다. 도 2는 도 1에 도시된 복수의 로봇 중 어 느 하나의 로봇과, 메인 관리 서버를 나타낸 도면이다. 그리고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 로 봇 시스템의 인공지능 훈련 방법을 나타낸 도면이다.도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 로봇 시스템은 각각의 제 1 인공지능(AI1; 1st Artificial Intelligence)을 탑재한 복수의 로봇(R1, R2, Rn; Robot), 및 소정의 클라우드 네트워크 (Cloud Network)를 통해 복수의 로봇과 연계되고 제 1 인공지능보다 높은 성능의 제 2 인공지능 (AI2; 2nd Artificial Intelligence)을 탑재한 메인 관리 서버(MMS; Main Management Server)를 포 함한다. 도 2에 도시된 바와 같이, 각 로봇은 제 1 인공지능, 센싱처리부, 로컬 훈련처리부 및 로 컬 분석처리부를 포함한다. 그리고, 각 로봇은 통신처리부를 더 포함할 수 있다. 센싱처리부는 로봇의 주위 환경에 대응한 센싱데이터를 수집한다. 예시적으로, 로봇이 자율주행 로봇인 경우, 센싱처리부는 장애물, 위치 및 명령어 등을 감지하기 위한 각종 센서들에 의한 센싱데이터를 수집할 수 있다. 여기서, 각종 센서의 예시로는 카메라, 마이크 및 거리센서 등이 있다. 로컬 훈련처리부는 딥 러닝 알고리즘(Deep Learning Algorism) 기반으로 소정의 학습데이터에 기초하여 제 1 인공지능을 훈련한다. 여기서, 학습데이터는 시스템의 관리자의 입력에 따라 메인 관리 서버 로부터 제공되거나, 로봇의 제조 시에 로봇의 메모리(미도시)에 미리 보유된 것일 수 있다. 학습데이 터는 다양한 센싱데이터로부터 도출되는 분석 결과에 대한 다수의 예시일 수 있다. 이러한 학습데이터는 관리자 의 입력에 따른 레이블링(Labling)을 통해 마련될 수 있다. 로컬 분석처리부는 훈련된 제 1 인공지능을 이용하여 센싱데이터에 대응한 제 1 분석결과데이터를 산 출한다. 즉, 로컬 분석처리부는 제 1 인공지능을 이용하여 센싱데이터에 대한 분석처리를 실시하고, 분석처리의 결과에 대응한 제 1 분석결과데이터를 산출한다. 본 발명의 일 실시예에 따르면, 로컬 훈련처리부는 학습데이터뿐만 아니라, 메인 관리 서버로부터 제 공되는 제 2 분석결과데이터에 기초하여 제 1 인공지능을 재훈련한다. 제 2 분석결과데이터는 메인 관리 서버가 그의 제 2 인공지능을 이용하여 각 로봇의 센싱데이터 를 분석한 결과에 대응한다. 여기서, 메인 관리 서버의 제 2 인공지능은 각 로봇의 제 1 인공지 능보다 높은 성능을 갖는다. 즉, 메인 관리 서버의 제 2 인공지능에 의한 제 2 분석결과데이터 는 각 로봇의 제 1 인공지능에 의한 제 1 분석결과데이터보다 높은 분석 처리 성능에 의해 도출된 것 이다. 또한, 제 2 분석결과데이터는 각 로봇의 센싱데이터에 대응하므로, 제 2 분석결과데이터는 각 로봇 의 제 1 인공지능에 개별로 적용되는 훈련데이터가 된다. 그러므로, 제 1 인공지능을 제 2 분석결과데이터에 기초하여 각 로봇의 재훈련을 실시함으로써, 각 로봇의 제 1 인공지능은 각 로봇의 센싱데이터에 대해 제 2 인공지능과 유사한 성능을 보 유할 수 있다. 이에 따라, 각 로봇이 제 2 인공지능 이상인 고성능의 인공지능을 탑재하지 않더라도, 제 2 인공지능과 유사한 성능으로 분석 처리를 실시할 수 있고, 그로 인해 각 로봇의 제조비용이 감 소될 수 있는 장점이 있다. 또한, 시스템 사용자가 복수의 로봇에 탑재된 복수의 제 1 인공지능을 재훈련하기 위해 각 로봇(11 0)의 제 1 인공지능 별로 레이블링을 실시할 필요가 없다. 그러므로, 복수의 로봇이 각각의 제 1 인 공지능을 탑재하더라도, 복수의 제 1 인공지능을 훈련하는 데에 소모되는 시간 및 인력이 감소될 수 있다. 통신처리부는 클라우드 네트워크를 통해 메인 관리 서버의 클라우드 통신부에 연결된다. 이러한 통신처리부는 소정 주기로 센싱처리부에 의한 센싱데이터를 메인 관리 서버의 클라우드 통신부로 송신할 수 있다. 여기서, 소정 주기는 제 1 인공지능의 재훈련에 대응할 수 있다. 또는, 통신처리부는 메인 관리 서버의 클라우드 통신부로부터 수신된 센싱데이터 요청 메시지에 기초하여 센싱처리부에 의한 센싱데이터를 메인 관리 서버의 클라우드 통신부로 송신할 수도 있 다. 그리고, 통신처리부는 메인 관리 서버의 클라우드 통신부로부터 제 2 분석결과데이터를 수신하 면, 수신된 제 2 분석결과데이터를 로컬 훈련처리부에 전달한다. 메인 관리 서버는 제 2 인공지능, 메인 훈련부 및 메인 분석부를 포함한다. 그리고, 메인 관리 서버는 센싱 데이터베이스 및 학습데이터 부가 생성부를 더 포함할 수 있다. 또한, 메인 관리 서버는 학습데이터 부가 생성부에 연결되는 사용자 인터페이스을 더 포함할 수 있다. 메인 훈련부는 딥 러닝 알고리즘(Deep Learning Algorism) 기반으로 각 로봇의 제 1 인공지능 과 동일한 소정의 학습데이터에 기초하여 제 2 인공지능을 훈련한다. 메인 분석부는 훈련된 제 2 인공지능을 이용하여 각 로봇의 센싱데이터에 대한 분석 처리를 실 시하고, 분석 처리의 결과에 대응한 제 2 분석결과데이터를 산출한다. 센싱 데이터베이스는 복수의 로봇 각각의 센싱데이터를 보유한다. 학습데이터 부가 생성부는 사용자 인터페이스를 통해 수신된 사용자의 입력에 따라 센싱 데이터베이 스에 보유된 데이터 중 적어도 일부를 레이블링(Labling)하여 부가 학습데이터를 생성한다. 학습데이터 부가 생성부는 생성된 부가 학습데이터를 메인 훈련부에 전달하고, 메인 훈련부는 부가 학습데이터에 기초하여 제 2 인공지능을 재훈련한다. 그리고, 학습데이터 부가 생성부는 생성된 부가 학습데이터를 메인 관리 서버의 클라우드 통신부 로 전달하고, 클라우드 통신부는 부가 학습데이터를 복수의 로봇으로 전달한다. 이때, 각 로봇의 통신처리부는 부가 학습데이터를 수신하면, 수신된 부가 학습데이터를 로컬 훈련처 리부로 전달한다. 로컬 훈련처리부는 부가 학습데이터에 기초하여 제 1 인공지능을 재훈련한다. 클라우드 통신부는 클라우드 네트워크를 통해 복수의 로봇과 데이터를 송수신한다. 즉, 클라우드 통신부는 각 로봇의 통신처리부로부터 센싱데이터를 수신하면, 수신된 센싱데이터 를 메인 분석부 또는 센싱 데이터베이스로 전달한다. 그리고, 클라우드 통신부는 메인 분석부에 의한 제 2 분석결과데이터 및 학습데이터 부가 생성부 에 의한 부가 학습데이터를 각 로봇의 통신처리부로 송신한다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 로봇 시스템에 있어서, 복수의 로봇에 탑재된 복수의 제 1 인공지능 및 메인 관리 서버에 탑재된 제 2 인공지능을 훈련 및 재훈련하는 과정을 도시한다. 도 3에 도시된 바와 같이, 각 로봇(R1, R2)의 로컬 훈련처리부(도 2의 113)는 소정의 학습데이터에 기초하 여 각 로봇의 제 1 인공지능(AI1_R1, AI1_R2)을 훈련한다. (S11) 이와 더불어, 메인 관리 서버(MMS)의 메인 훈련부는 소정의 학습데이터에 기초하여 메인 관리 서버 의 제 2 인공지능(AI2)를 훈련한다. (S21) 예시적으로, 로봇 시스템이 마련되는 동안 제 1 및 제 2 인공지능(AI1_R1, AI1_R2)(AI2)이 소정의 학습데 이터에 기초하여 훈련될 수 있다. 학습데이터는 각 로봇에서 수집되는 센싱데이터의 분석 처리에 대응한다. 이어서, 로봇 시스템의 구동이 개시되면, 각 로봇의 센싱처리부는 센싱데이터(LSD; Local Sensing Data)를 수집한다. (S12) 각 로봇의 로컬 분석처리부는 훈련된 제 1 인공지능(AI1)을 이용하여 수집된 센싱데이터(LSD)에 대한 분석 처리를 실시하고, 분석 처리의 결과에 대응하는 제 1 분석결과데이터(AR1_R1, AR1_R2; Analyzed Result)를 산출한다. (S13) 각 로봇의 통신처리부는 소정의 송신주기(SP_R1, SP_R2; Sending Period)가 도래하면 (S14), 수집된 센싱데이터(LSD_R1, LSD_R2)를 메인 관리 서버(MMS)로 송신한다. (S15) 여기서, 송신주기(SP_R1, SP_R2)의 도래시점은 각 로봇(R1, R2)에 대응할 수 있다. 즉, 로봇(R1, R2) 별로 상이 한 시점에 수집된 센싱데이터(LSD_R1, LSD_R2)의 송신(S15)이 실시될 수 있다. 또는, 별도로 도시하고 있지 않으나, 메인 관리 서버(MMS)의 처리 용량에 따라, 복수의 로봇(R1, R2) 중 둘 이 상의 로봇이 동시에 수집된 센싱데이터(LSD_R1, LSD_R2)의 송신(S15)을 실시할 수도 있다. 메인 관리 서버(MMS)의 클라우드 통신부는 각 로봇(R1, R2)의 센싱데이터(LSD_R1, LSD_R2)를 수신한 다. (S15) 이때, 클라우드 통신부는 수신된 각 로봇(R1, R2)의 센싱데이터(LSD_R1, LSD_R2)를 센싱 데이터베이스 로 전달하고, 센싱 데이터베이스는 전달된 각 로봇(R1, R2)의 센싱데이터(LSD_R1, LSD_R2)를 보유한 다. (S22) 그리고, 메인 관리 서버(MMS)의 메인 분석부는 제 2 인공지능(AI2)을 이용하여 클라우드 통신부(12 7)를 통해 수신된 각 로봇(R1, R2)의 센싱데이터(LSD_R1, LSD_R2)에 대한 분석 처리를 실시하고, 분석 처리의 결과에 대응하는 제 2 분석결과데이터(AR2_R1, AR2_R2)를 산출한다. (S23) 여기서, 메인 관리 서버(MMS)의 메인 분석부는 클라우드 통신부의 센싱데이터 수신 여부에 관계 없이, 센싱 데이터베이스에 보유된 각 로봇(R1, R2)의 센싱데이터(LSD_R1, LSD_R2)에 대한 분석 처리를 실 시할 수도 있다. 클라우드 통신부는 산출된 제 2 분석결과데이터(AR2_R1, AR2_R2)를 각 로봇의 통신처리부로 송 신한다. (S24) 각 로봇의 로컬 훈련처리부는 통신처리부를 통해 수신된 각 로봇의 제 2 분석결과데이터 (AR2_R1, AR2_R2)에 기초하여 각 로봇의 제 1 인공지능(AI1_R1, AI1_R2)을 재훈련한다. (S16) 일 예로, 제 1 로봇(R1)의 경우, 메인 관리 서버(MMS)의 제 2 인공지능(AI2)에 의해 실시된 제 1 로봇(R 1)의 센싱데이터(LSD_R1)에 대한 분석 처리의 결과에 대응하는 제 2 분석결과데이터(AR2_R1)를 수신한다. (S24) 이에, 제 1 로봇(R1)의 로컬 훈련처리부는 제 1 로봇(R1)의 제 2 분석결과데이터(AR2_R1)에 기초하여 제 1 로봇(R1)의 제 1 인공지능(AI1_R1)을 재훈련한다. (S16) 마찬가지로, 제 2 로봇(R2)의 경우, 제 2 인공지능(AI2)에 의해 실시된 제 2 로봇(R2)의 센싱데이터(LSD_R2)에 대한 분석 처리의 결과에 대응하는 제 2 분석결과데이터(AR2_R2)를 수신한다. (S24) 이에, 제 2 로봇(R2)의 로 컬 훈련처리부는 제 2 로봇(R2)의 제 2 분석결과데이터(AR2_R2)에 기초하여 제 2 로봇(R2)의 제 1 인공지 능(AI1_R2)을 재훈련한다. (S16) 도 4에 도시한 바와 같이, 메인 관리 서버(MMS)에 있어서, 사용자 인터페이스를 통해 사용자의 입력 이 수신되면, 학습데이터 부가 생성부는 센싱 데이터베이스에 보유된 데이터 중 적어도 일부를 표시 한다. 그리고, 학습데이터 부가 생성부는 사용자의 입력에 따라 표시된 데이터를 레이블링함으로써, 부가 학습데이터를 생성한다. (S24) 이때, 학습데이터 부가 생성부는 생성된 부가 학습데이터를 메인 훈련부로 전달하고, 메인 훈련부 는 부가 학습데이터에 기초하여 제 2 인공지능(AI2)을 재훈련한다. (S25) 그리고, 학습데이터 부가 생성부는 생성된 부가 학습데이터를 클라우드 통신부로 전달하고, 클라우드 통신부는 부가 학습데이터를 복수의 로봇(R1, R2)로 송신한다. (S26) 각 로봇(R1, R2)의 통신처리부는 부가 학습데이터를 수신하면, 수신된 부가 학습데이터를 로컬 훈련 처리부로 전달한다. 로컬 훈련처리부는 부가 학습데이터에 기초하여 제 1 인공지능(AI1_R1, AI_R2)을 재훈련한다. (S17) 이상과 같이, 본 발명의 일 실시예에 따르면, 복수의 로봇이 각각의 제 1 인공지능을 탑재하고, 제 1 인공지능을 이용하여 센싱데이터에 대한 분석 처리를 자체적으로 실시한다. 즉, 각 로봇의 센싱데이 터에 대한 분석 처리가 메인 관리 서버의 제 2 인공지능에 의해 실시되는 것이 아니라, 각 로봇(11 0)의 제 1 인공지능에 의해 실시된다. 이에 따라, 클라우드 네트워크의 정상 여부에 관계없이, 각 로봇에 의한 제 1 분석결과데이터의 산출 이 안정적으로 실시될 수 있다. 그리고, 제 1 분석결과데이터의 산출에 있어서, 센싱데이터를 메인 관리 서버로 전달하는 과정 및 메인 관 리 서버에 의한 분석 결과를 각 로봇으로 전달하는 과정이 불필요하므로, 데이터 전달 과정에 따른 지연시간이 배제될 수 있다. 또한, 메인 관리 서버에 분석 처리가 집중되는 것이 방지되므로, 메인 관리 서버의 처리 지연이 방지될 수 있다. 이로써, 각 로봇에서 수집된 센싱데이터에 대한 분석 처리의 실 시간성이 향상될 수 있다. 그리고, 메인 관리 서버는 제 1 인공지능보다 높은 성능을 보유한 제 2 인공지능을 이용하여 각 로봇의 센싱데이터에 대한 분석 처리의 결과에 대응한 제 2 분석결과데이터를 각 로봇에 제공한다. 이때, 각 로봇은 제 2 분석결과데이터에 기초하여 제 1 인공지능을 재훈련한다. 이로써, 각 로봇의 제 1 인공지능은 각 로봇의 센싱데이터를 분석 처리하는 과정에서 제 2 인공 지능과 유사한 성능을 보유할 수 있다. 또한, 복수의 로봇에 보유된 제 1 인공지능의 훈련에 소 모되는 비용 및 인력이 감소될 수 있다. 한편, 본 발명의 일 실시예에 따르면, 메인 관리 서버에 의한 제 2 분석결과데이터는 각 로봇의 제 1 인공지능을 재훈련하기 위한 것이다. 이에 따라, 클라우드 네트워크의 상태가 정상인 경우에 각 로봇 과 메인 관리 서버 간의 데이터 송수신을 실시할 수 있다. 도 5는 본 발명의 다른 일 실시예에 따른 인공지능 훈련 방법을 나타낸 도면이다. 도 5에 도시된 바와 같이, 본 발명의 다른 일 실시예에 따른 인공지능 훈련 방법은 테스트요청신호, 테스트응답 신호 및 센싱데이터 요청신호가 송수신되고 (S31, S32, S33), 각 로봇(R1)이 메인 관리 서버(MMS)의 센싱데이터 요청신호에 기초하여 센싱데이터(LSD_R1)를 송신하는 것(S15)을 제외하고는 도 3에 도시된 바와 동 일하므로 이하에서 중복 설명을 생략한다. 본 발명의 다른 일 실시예에 따르면, 메인 관리 서버(MMS)의 클라우드 통신부는 각 로봇(R1)에 대응한 소정의 통신테스트주기(TP_R1; Test Period)가 도래하면 (S31), 각 로봇(R1)에 테스트요청신호를 송신한다. (S32) 이에, 각 로봇(R1)의 통신처리부는 테스트요청신호에 기초하여 테스트응답신호를 메인 관리 서버 (MMS)로 송신한다. (S33) 메인 관리 서버(MMS)의 클라우드 통신부는 각 로봇(R1)의 테스트응답신호에 기초하여 센싱데이 터 요청신호를 송신한다. (S34) 각 로봇(R1)의 통신처리부는 센싱데이터 요청신호에 기초하여 센싱처리부에 의해 수집된 센싱데 이터(LSD_R1)를 메인 관리 서버(MMS)로 송신한다. (S15) 이와 같이 하면, 클라우드 네트워크의 상태가 안정적이라고 확인된 상태에서, 각 로봇(R1)의 센싱데 이터(LSD_R1)의 송수신이 실시될 수 있는 장점이 있다. 전술한 본 발명은, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 있어 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 여러 가지 치환, 변형 및 변경이 가능하므로 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니다."}
{"patent_id": "10-2018-0038827", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 로봇 시스템을 나타낸 도면이다. 도 2는 도 1에 도시된 복수의 로봇 중 어느 하나의 로봇과, 메인 관리 서버를 나타낸 도면이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 로봇 시스템의 인공지능 훈련 방법을 나타낸 도면이다. 도 5는 본 발명의 다른 일 실시예에 따른 인공지능 훈련 방법을 나타낸 도면이다."}
