{"patent_id": "10-2020-0138444", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0054011", "출원번호": "10-2020-0138444", "발명의 명칭": "생체 정보 측정을 위한 웨어러블 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "권성준"}}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웨어러블 장치에 있어서,복수의 전극을 가지는 제1 센서; 및상기 제1 센서와 전기적으로 연결되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는:상기 웨어러블 장치가 사용자의 신체에 착용된 상태에서 상기 제1 센서를 이용하여 제1 심전도 신호를획득하고,상기 제1 심전도 신호로부터 근전도 신호를 획득하고,상기 제1 심전도 신호에서 상기 근전도 신호가 필터링 된 제2 심전도 신호를 획득하고, 상기 근전도 신호의 세기 및 상기 제2 심전도 신호의 품질에 기반하여 상기 웨어러블 장치의 착용 상태를 판단하고,상기 판단 결과에 기반하여 상기 착용 상태에 대한 안내를 출력하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 디스플레이 및 상기 디스플레이를 둘러싸는 하우징을 포함하고,상기 복수의 전극 중 제1 전극은 상기 하우징의 하부면에 배치되고, 제2 전극은 상기 하우징의 측면 또는 상면에 배치되는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 제1 전극은 상기 디스플레이 상에 배치되고, 상기 제2 전극은 상기 디스플레이를 둘러싸는 하우징의 일부에 배치되는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 제2 심전도 신호를 획득할 때, 상기 적어도 하나의 프로세서는 상기 제1 심전도 신호에서 상기 근전도 신호를 필터링 하고, 상기 근전도 신호가 필터링 된 신호에서 상기 근전도 신호 외에 잡음을 제거하여 제2 심전도신호를 획득하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 적어도 하나의 프로세서는 상기 근전도 신호의 세기가 제1 기준 값 이상이고 상기 제2 심전도 신호의 품질이 제2 기준 값 이하인 경우, 상기 착용 상태가 과밀착 상태임을 안내하는 메시지를 출력하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 적어도 하나의 프로세서는 상기 과밀착 상태임을 안내하는 메시지와 재측정 요청 메시지를 출력하고,상기 재측정 요청 메시지에 대한 응답에 기반하여 상기 웨어러블 장치가 사용자의 신체에 착용된 상태에서 상기공개특허 10-2022-0054011-3-제1 센서를 이용하여 제3 심전도 신호를 획득하고, 상기 제3 심전도 신호로부터 제2 근전도 신호를 획득하고,상기 제3 심전도 신호에서 상기 제2 근전도 신호가 필터링 된 제4 심전도 신호를 획득하고, 상기 제2 근전도 신호의 세기 및 상기 제4 심전도 신호의 품질에 기반하여 상기 웨어러블 장치의 재착용 상태를판단하고,상기 판단 결과에 기반하여 상기 재착용 상태에 대한 안내를 출력하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 적어도 하나의 프로세서는 복수의 착용 상태에 대한 안내들 각각에 대응되는 서로 다른 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위들을 결정하고, 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위에 대응되는 상기 복수의 착용 상태에대한 안내들 중 하나를 출력하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 적어도 하나의 프로세서는 상기 제1 심전도 신호, 상기 근전도 신호, 상기 제2 심전도 신호 및 상기 복수의 착용 상태에 대한 안내들 각각에 대응되는 서로 다른 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도신호의 품질의 범위 중 적어도 하나를 저장하는 메모리를 포함하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 발광부와 수광부를 가지는 제2 센서를 포함하고, 상기 적어도 하나의 프로세서는 상기 웨어러블 장치가 사용자의 신체에 착용된 상태에서 상기 제2 센서를 이용하여 PPG 신호를 획득하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 5에 있어서, 디스플레이를 포함하고,상기 적어도 하나의 프로세서는 상기 디스플레이를 통해 상기 착용 상태에 대한 알림을 제공하는 웨어러블장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 5에 있어서,모터를 포함하고,상기 적어도 하나의 프로세서는 상기 모터를 통해 진동을 출력하여 상기 착용 상태에 대한 알림을 제공하는 웨어러블 장치."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 5에 있어서,스피커를 포함하고,상기 적어도 하나의 프로세서는 상기 스피커를 통해 음성 안내 또는 소리를 출력하여 상기 착용 상태에 대한 알림을 제공하는 웨어러블 장치.공개특허 10-2022-0054011-4-청구항 13 웨어러블 장치의 동작 방법에 있어서,상기 웨어러블 장치가 사용자의 신체에 착용된 상태에서 제1 센서를 이용하여 제1심전도 신호를 획득하는 동작;상기 제1 심전도 신호로부터 근전도 신호를 획득하는 동작;상기 제1 심전도 신호에서 상기 근전도 신호가 필터링 된 제2 심전도 신호를 획득하는 동작; 및상기 근전도 신호의 세기 및 상기 제2 심전도 신호의 품질에 기반하여 상기 웨어러블 장치의 착용 상태를 판단하는 동작을 포함하는 웨어러블 장치의 동작 방법."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서, 상기 웨어러블 장치는 디스플레이 및 상기 디스플레이를 둘러싼 하우징을 포함하고,상기 제1 센서는 복수의 전극을 포함하고,상기 복수의 전극 중 제1 전극은 상기 하우징의 하부면에 배치되고, 제2 전극은 상기 하우징의 측면 또는 상면에 배치되는 웨어러블 장치의 동작 방법."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 상기 제1 전극은 상기 디스플레이에 배치되고 상기 제2 전극은 상기 하우징의 일부에 배치되는 웨어러블 장치의동작 방법."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 13에 있어서, 상기 제2 심전도 신호를 획득하는 동작은 상기 제1 심전도 신호를 제1 필터에 통과하는 동작; 및상기 제1 필터를 거친 신호를 제2 필터에 통과하는 동작을 포함하고,상기 제1 필터 및 상기 제2 필터는 주파수 대역이 상이한 웨어러블 장치의 동작 방법."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "에 있어서, 상기 착용 상태에 대한 안내를 출력하는 동작은 상기 착용 상태가 과밀착 상태임을 안내하는 메시지를 소리, 진동 및 화면 중 적어도 하나의 방법으로 출력하는 웨어러블 장치의 동작 방법."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 13에 있어서, 상기 착용 상태를 판단하는 동작의 결과에 기반하여 상기 착용 상태에 대한 안내를 출력하는 동작을 더 포함하는 웨어러블 장치의 동작 방법."}
{"patent_id": "10-2020-0138444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 13에 있어서, 상기 착용 상태를 판단하는 동작은 복수의 착용 상태들 각각에 대응되는 서로 다른 상기 근전도 신호의 세기의범위 및 상기 제2 심전도 신호의 품질의 범위들을 결정하는 동작; 및상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위에 대응되는 상기 복수의 착용 상태들중 하나의 착용 상태를 판단하는 동작을 포함하는 웨어러블 장치의 동작 방법.공개특허 10-2022-0054011-5-청구항 20"}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시에 따른 일 실시 예에서의 웨어러블 장치는, 웨어러블 장치에 있어서, 복수의 전극을 가지는 제1 센서, 제1 센서와 전기적으로 연결되는 적어도 하나의 프로세서를 포함하고, 적어도 하나의 프로세서는 웨어러블 장치 가 사용자의 신체에 착용된 상태에서 제1 센서를 이용하여 제1 심전도 신호를 획득하고, 제1 심전도 신호로부터 근전도 신호를 획득하고, 제1 심전도 신호에서 근전도 신호가 필터링 된 제2 심전도 신호를 획득하고, 근전도 신 호의 세기 및 제2 심전도 신호의 품질에 기반하여 웨어러블 장치의 착용 상태를 판단하고, 판단 결과에 기반하여 착용 상태에 대한 안내를 출력할 수 있다. 이 외에도 명세서를 통해 파악되는 다양한 실시 예가 가능하다."}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시에 따른 다양한 실시 예들은 웨어러블 장치에서 생체 정보 측정 시, 웨어러블 장치의 착용 상태를 판단 하는 기술에 관한 것이다."}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심전도(ECG, electrocardiography) 측정법은 심장 활동의 관찰을 위해 심장 근육 운동을 위해 발생되는 자율신 경계의 전기적 신호를 피부에 부착된 전극으로 측정하는 방법이다. 웨어러블형 심전도의 경우, 간소화된 전극을 사용하여 심방 세동 등 일부 부정맥의 진단에 사용될 수 있다. 근전도(EMG, electromyograph)는 골격근에서 발생하는 전기적인 신호이다. 이는 근육 세포가 전기적으로 혹은 신경적으로 활성화될 때 발생하는 전기적인 포텐셜에 의해서 발생한다. 광용적맥파 측정법(PPG, Photoplethysmograph)은 생체조직의 광학적 특성을 이용하여 혈관에 흐르는 혈류량을 측정함으로써 심박 활동 상태를 알 수 있는 맥파 측정방법이다. 맥파는 혈액이 심장에서 파상하며 나타내는 맥 동성 파형으로, 심장의 이완 수축 작용에 따라 나타나는 혈류량의 변화, 즉 혈관의 용적 변화를 통하여 측정 가 능하다. 최근에 웨어러블 장치를 이용하여 생체 신호를 측정하고, 측정 결과에 따라 사람의 건강 상태를 모니터하는 기 술이 증가하고 있다. 웨어러블 장치는 인체의 임의의 위치에서 ECG 신호를 검출하고, 검출된 ECG 신호를 디지털 신호 프로세서와 같은 하드웨어를 이용하여 분석한다. 손목 착용형 웨어러블 장치에서 심전도 신호를 측정할 때, 웨어러블 장치 후면의 전극과 손목 피부 간의 안정적 접촉은 신호 품질 개선에 큰 영향을 준다. 예를 들어 웨어러블 장치의 착용 상태가 불안정 하거나 사용자의 손 목 피부가 건조한 경우 심전도 신호 품질이 저하될 수 있다."}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "웨어러블 장치에서 심전도 신호를 측정할 때 신호 품질 저하 문제는, 웨어러블 디바이스의 후면부를 손목 피부 에 밀착시킴으로써 상당한 개선이 가능하다. 따라서 손목 착용형 웨어러블 장치를 이용하여 양손에서 심전도 신 호를 측정하는 경우 장치를 잡는 손에 힘을 주어 장치를 손목 방향으로 누르면 후면부 센서가 손목 피부에 밀착 되서 품질 향상을 유도할 수 있다. 그러나 후면부 센서가 손목 피부에 밀착되도록 하기 위해 장치를 잡는 손에 필요 이상의 힘을 주어 누르게 되면 오히려 신호 품질을 저하시키는 문제를 일으킬 수 있다. 웨어러블 장치를 잡은 손에 힘을 주면 힘을 주는 근육 들에서 근전도 신호가 발생하게 된다. 근전도 신호 역시 전기적 신호이며 신호 발생 위치가 심전도 센서와 가까 이 있기 때문에 심전도 센서에 의해 함께 센싱 될 수 있다. 심전도 신호의 관점에서 보면 근전도 신호는 잡음 신호이기 때문에 신호 품질이 저하되는 상황을 발생시킨다. 또한, 맥파전달시간 기반의 혈압 추정 기술과 같이 심전도 신호를 측정함과 동시에 디바이스를 착용한 손목에서 광용적맥파를 동시에 측정하는 것이 필요한 경우 과도하게 밀착시킨 센서는 혈관 용적 변화의 관찰을 방해하여 광용적맥파 신호의 품질을 저하시킬 수 있다."}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따른 웨어러블 장치는, 복수의 전극을 가지는 제1 센서, 제1 센서와 전기적으로 연결되는 적어도 하나의 프로세서를 포함하고, 적어도 하나의 프로세서는 웨어러블 장치가 사용자의 신체에 착용된 상태에서 제1센서를 이용하여 제1 심전도 신호를 획득하고, 제1 심전도 신호로부터 근전도 신호를 획득하고, 제1 심전도 신 호에서 근전도 신호가 필터링 된 제2 심전도 신호를 획득하고, 근전도 신호의 세기 및 제2 심전도 신호의 품질 에 기반하여 웨어러블 장치의 착용 상태를 판단하고, 판단 결과에 기반하여 착용 상태에 대한 안내를 출력할 수 있다. 일 실시 예에 따른 웨어러블 장치의 동작 방법은, 웨어러블 장치가 사용자의 신체에 착용된 상태에서 제1 센서 를 이용하여 제1심전도 신호를 획득하는 동작, 제1 심전도 신호로부터 근전도 신호를 획득하는 동작, 제1 심전 도 신호에서 근전도 신호가 필터링 된 제2 심전도 신호를 획득하는 동작 및 근전도 신호의 세기 및 제2 심전도 신호의 품질에 기반하여 웨어러블 장치의 착용 상태를 판단하는 동작을 포함할 수 있다."}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따른 다양한 실시 예에서의 웨어러블 장치는, 생체 정보 측정 시 사용자가 과한 힘으로 웨어러블 장 치를 밀착시키거나 불필요한 근육 활동으로 심전도 측정에 영향을 주는 경우, 착용 상태를 안내하여 생체 정보 측정의 정확도를 개선할 수 있다. 다양한 실시 예에서의 웨어러블 장치는, 별도의 센서 없이 심전도 신호에 섞여 있는 근전도 신호의 강도를 통해 착용 상태를 분석함으로써, 웨어러블 장치의 사이즈 변화 없이 신호 품질을 개선할 수 있다."}
{"patent_id": "10-2020-0138444", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 일 실시 예에서의 웨어러블 전자 장치를 신체의 일부에 장착하는 것을 나타내는 도면이다. 일 실시 예에 따르면, 도 1의 웨어러블 장치는 도시된 바와 같이 스마트 워치(smart watch)일 수 있다. 이 에 한하지 않고, 웨어러블 장치는 사용자의 신체에 부착되어 사용될 수 있는 다양한 형태의 장치일 수 있 다. 일 실시 예에 따르면, 웨어러블 장치는 스트랩을 구비하여, 스트랩이 사용자의 팔목에 감김으로 써 사용자의 신체에 부착될 수 있다. 이에 한하지 않고, 웨어러블 장치는 웨어러블 장치의 형태, 크기 등에 따라서 사용자의 다양한 신체에 부착될 수 있다. 예를 들면, 웨어러블 장치는 손, 손등, 손가락, 손톱, 손 끝(fingertip) 등에도 부착될 수 있다. 도 2는 일 실시 예에서의 웨어러블 장치의 사시도이다. 도 2를 참조하면, 웨어러블 장치는 하우징, 디스플레이 및 스트랩을 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 도시된 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추 가적으로 구비할 수 있다. 일 실시 예에 따르면, 하우징은 상부면, 하부면, 및 상부면 및 하부면 사이의 공간을 둘러싸는 측면부를 포함할 수 있다. 일 실시 예에 따르면, 하우징의 일 영역을 통해 디스플레이가 노출될 수 있다. 일 실시 예에 따르면, 복수의 전극(예: 201a, 201b, 201c)은 하우징의 적어도 일부에 배치될 수 있다. 예 를 들면, 제1 전극(201a)은 하우징의 상부면 또는 측면부에 배치되고, 제2 전극(201b) 및 제3 전극(201c) 은 하우징의 하부면에 배치될 수 있다. 다양한 실시 예에서, 전극의 모양이나 크기는 다양하게 구성될 수 있다. 일 실시 예에 따르면, 하우징의 하부면을 통해 PPG 센서가 노출될 수 있다. 일 실시 예에 따르면, PPG 센서는 발광 모듈 및 수광 모듈을 포함할 수 있다. 일 실시 예에 따르면, 발광 모듈은 다양한 파장을 갖는 LED(light emitting diode)를 포함할 수 있다. 예를 들어, 발광 모듈은 적외선(IR, infrared ray) LED, Red LED, Green LED, 및/또는 Blue LED를 포함할 수 있다. 일 실시 예에 따르면, 수광 모 듈은 적어도 하나의 포토다이오드(PD, photodiode)를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이는 생체 센서를 통하여 획득한 사용자의 생체 데이터를 표시할 수 있다. 일 실시 예에 따르면, 디스플레이는 하우징의 일부(예: 베젤)에 대한 사용자 입력 또는 디스플레이 에 대한 입력에 기반하여 출력되는 화면을 전환할 수 있다. 예를 들어, 디스플레이는 사용자의 입력 에 응답하여 시계 화면에서 생체 데이터 화면(예: 심박수)으로 전환할 수 있다. 일 실시 예에 따르면, 스트랩은 하우징의 적어도 일부에 연결되고, 사용자의 신체 일부 (예: 손목, 발목)에 웨어러블 장치를 탈착 가능하게 결착할 수 있다. 일 실시 예에 따르면, 웨어러블 장치의 사 용자는 밀착 정도를 높이기 위해 스트랩을 조절할 수 있다. 전술한 웨어러블 장치의 구조는 예시적인 것이며, 다양한 실시 예에서, 웨어러블 장치는 도 2와 다르 게 구현될 수 있다. 웨어러블 장치는 본 문서에 개시되는 생체 데이터 측정을 위한 방법을 수행하기 위해 적절한 다양한 형태/구조를 가질 수 있다. 도 3은 일 실시 예에 따른 웨어러블 장치의 블록도이다. 일 실시 예에 따른 웨어러블 장치는 프로세서, 디스플레이, 스피커, 모터, 센서 모듈 을 포함할 수 있다. 다양한 실시 예에서, 웨어러블 장치는 도 3에 도시된 구성요소 외에 추가적인 구 성요소를 포함하거나, 도 3에 도시된 구성요소 중 적어도 하나를 생략할 수 있다. 일 실시 예에 따르면, 프로세서는 메모리(미도시)에 저장된 인스트럭션들을 이용하여 웨어러블 장치 의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 일 실 시 예에 따르면, 프로세서는 중앙처리장치(CPU), 그래픽처리장치(GPU), MCU(micro controller unit), 센 서 허브, 보조프로세서(supplementary processor), 통신 프로세서(communication processor), 애플리케이션 프 로세서(application processor), ASIC(application specific integrated circuit), FPGA(field programmable gate arrays) 중 적어도 하나를 포함할 수 있으며, 복수의 코어를 가질 수 있다. 일 실시 예에 따르면, 프로세서는 센서 모듈로부터 사용자의 생체 정보를 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 센서 모듈로부터 PPG 신호 및 ECG 신호를 획득할 수 있다. 일 실시 예에 따 르면, 프로세서는 ECG 신호로부터 근전도 신호를 분리하여 웨어러블 장치의 착용 상태를 판단할 수 있다. 프로세서의 동작과 관련된 구체적인 내용은 도 4 내지 도 6을 참조하여 후술한다. 일 실시 예에 따르면, 디스플레이(예: 도 2의 디스플레이)는 각종 컨텐츠를 표시할 수 있다. 예를 들 어, 디스플레이는 텍스트, 이미지, 비디오, 아이콘, 및/또는 심볼 등을 표시할 수 있다. 일 실시 예에 따 르면, 디스플레이의 형태는 하우징의 형태에 대응하는 형태일 수 있으며, 원형, 타원형, 또는 다각형 등 다양한 형태일 수 있다. 일 실시 예에 따르면, 디스플레이는 터치 감지 회로 및/또는 터치의세기(압력)를 측정할 수 있는 압력 센서와 결합되거나 인접하여 배치될 수 있다. 일 실시 예에 따르면, 디스플 레이는 프로세서의 명령에 따라 사용자의 생체 정보를 표시할 수 있다. 예를 들어, 사용자의 생체 정 보는 수치 및/또는 그래프로 표시될 수 있다. 일 실시 예에 따르면, 디스플레이는 프로세서의 명령에 따라 생체 정보의 측정 방법에 대한 가이드를 제공할 수 있다. 일 실시 예에 따르면, 스피커는 웨어러블 장치의 사용자에게 각종 알림을 소리(예: 음악, 음성 등)로 출력할 수 있다. 일 실시 예에 따르면, 스피커는 프로세서의 명령에 따라 사용자의 생체 정보를 소리 로 출력할 수 있다. 예를 들어, 사용자의 생체 정보는 수치 및/또는 건강 상태 정보에 대한 음성 안내로 출력될 수 있다. 일 실시 예에 따르면, 스피커는 프로세서의 명령에 따라 심전도 측정의 측정 여부 및 웨어 러블 장치의 착용 상태 등에 대한 안내를 음성으로 제공할 수 있다. 일 실시 예에 따르면, 모터는 각종 알림을 진동으로 출력할 수 있다. 예를 들어, 모터는 심전도 측정 시작 및 종료에 대한 알림을 진동으로 출력할 수 있다. 예를 들어, 사용자가 웨어러블 장치를 착용하면 프 로세서의 명령에 따라 사용자의 생체 정보 측정 시작에 대한 안내를 진동으로 출력할 수 있다. 또한, 모터 는 프로세서의 명령에 따라 진동으로 사용자의 생체 정보 측정 종료에 대한 안내를 출력할 수 있다. 일 실시 예에 따르면, 모터는 프로세서의 명령에 따라 웨어러블 장치의 착용 상태 및 생체 정보 재측 정에 대한 안내를 진동으로 출력할 수 있다. 일 실시 예에 따르면, 디스플레이, 스피커 및 모터가 프로세서의 명령에 따라 출력할 수 있는 안내는 다양할 수 있다. 웨어러블 장치는 디스플레이, 스피커 및 모터가 출력하는 안 내를 그 밖에 다양한 구성요소를 포함하여 출력할 수 있다. 일 실시 예에 따르면, 센서 모듈은 사용자의 상태를 감지하고, 감지된 상태에 대응하는 신호를 제공할 수 있다. 일 실시 예에 따르면, 센서 모듈은 제1 센서 및 제2 센서를 포함할 수 있다. 일 실시 예에 따르면, 제1 센서는 ECG(electrocardiogram) 센서, EDA(electrodermal activity) 센서, EEG(electroencephalography) 센서, BIA(bioelectrical impedance analysis) 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 제1 센서는 복수의 전극(예: 도 2의 제1 전극(201a), 제2 전극(201b) 또는 제3 전극(201c))과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 센서에 포함된 복수의 전극은 웨어러블 장치의 다양한 위치에 배치될 수 있다. 예를 들어, 제1 전극(201a)은 하우징의 하부면에 배치되고, 제2 전극(201b)은 하우징의 측 면 또는 상면에 배치될 수 있다. 일 실시 예에 따르면, 제1 전극(201a)은 디스플레이 상에 배치되고, 제2 전극(201b)은 하우징의 일부에 배치될 수 있다. 일 실시 예에 따르면, 제1 전극 내지 제3 전극(201a~201 c)은 설명된 예에 구속되지 않고, 서로 교체될 수 있다. 일 실시 예에 따르면, 제2 센서는 PPG 센서(예: 도 2의 PPG 센서)를 포함할 수 있다. 제2 센서(35 2)는 발광 모듈 및 수광 모듈을 포함할 수 있다. 일 실시 예에 따르면, 신호 처리 모듈(미도시)은 발 광 모듈 및 수광 모듈을 제어할 수 있다. 일 실시 예에 따르면, 신호 처리 모듈은 센서를 직접 제어 하는 센서 드라이버 컨트롤러 및 ADC(analog to digital converter)를 포함할 수 있다. 일 실시 예에 따르면, 신호 처리 모듈은 도 3에 미도시된 다른 구성들(예: 증폭기 및/또는 필터 등)을 더 포함할 수도 있다. 일 실시 예에 따르면, 신호 처리 모듈은 마이크로 프로세서로 구현될 수 있다 일 실시 예에 따르면, 신호 처리 모듈은 발광 모듈의 적어도 하나의 LED를 구동할 수 있다. 일 실시 예에 따르면, 신호 처리 모듈은 수광 모듈에 의하여 감지된 신호를 처리(예: 증폭 및/또는 필터링)할 수 있다. 예를 들어, 신호 처리 모듈은 수광 모듈에 의하여 감지된 전류 신호를 전압 신호로 변환하고, 처리된 전압 신호를 디지털 신호로 변환할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 센서를 통해 PPG 신호 데이터를 획득할 수 있다. 프로세서 는 PPG 신호 데이터를 이용하여 맥파를 측정할 수 있다. 예를 들어, 프로세서는 PPG 신호 데이터를 통해 용적 변화 시 나타나는 생체조직의 반사, 흡수 투과비 등의 광학적 특성의 변화를 광센서에서 감지하여 측 정할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 센서를 통해 맥박 측정을 할 수 있다. 일 실시 예에 따르면, 센서 모듈은 제1 센서 및 제2 센서 외에 다양한 센서를 포함할 수 있다. 예를 들어, 센서 모듈은 가속도 센서, 근접 센서, 자이로 센서, 온도 센서, 홍채 센서, 온/습도 센서, 조 도 센서, TOF(time of flight) 센서 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는센서 모듈에 포함된 다양한 센서를 이용하여 사용자의 상황 또는 사용자의 외부 환경을 판단할 수 있다. 본 문서에서 센서 모듈은 적어도 하나의 센서, 센서 회로(sensor circuitry) 등으로 참조될 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 메모리를 포함할 수 있다. 메모리는 웨어러블 장치의 적어도 하나의 구성요소(예: 프로세서)에 의해 획득되거나 사용되는 다양한 데이터를 저장할 수 있다. 일 실시 예에 따 르면, 메모리는 사용자의 나이, 키, 몸무게와 같은 사용자의 개인 정보를 저장할 수 있다. 일 실시 예에 따르면, 메모리는 센서 모듈에 의해 획득한 사용자의 생체 데이터를 저장할 수 있다. 예를 들어, 메모리는 센서 모듈에 의해 획득된 ECG 신호 데이터 또는 PPG 신호 데이터를 저장할 수 있다. 또한, 메모리는 프로세서가 ECG 신호를 기반으로 하여 획득한 근전도 신호 데이터를 저장할 수 있다. 일 실시 예 에 따르면, 메모리는 웨어러블 장치의 사용자의 착용 상태에 대한 다양한 정보들을 저장할 수 있다. 도 4는 일 실시 예에 따른 웨어러블 장치에서, 웨어러블 장치의 착용 상태를 판단하는 내용에 대한 흐름도이다. 도 4를 참조하면, 프로세서는 동작 401에서, ECG 센서(예: 도 3의 제1 센서)를 통하여 심전도 신호 (ECG 신호) 데이터를 획득할 수 있다. 상기 심전도 신호 데이터는 제1 심전도 신호로 표현될 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 스트랩을 통해 사용자의 신체의 일부(예: 손목)에 착용된 상태로 제1 심전도 신호를 획득할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 디스플레이, 스피커 및 모터 중 어느 하나를 통해 생체 정보 측정을 유도하는 안내를 출력할 수 있다. 다른 실시 예에 따르면, 프로세서는 사용자가 심전도 신호를 측정할 때, 알림을 제공하지 않고 백그라운드 방식으로 신호를 측정할 수 있다. 일 실시 예에 따라, 프로세서는 동작 403에서 제1 심전도 신호로부터 근전도 신호를 획득할 수 있다. 예를 들면, 프로세서는 제1 심전도 신호에 포함된 근전도 신호를 획득할 수 있다. 일 실시 예에 따르면, 프로세 서는 알고리즘을 이용해 근전도 신호의 주파수 대역과 심전도 신호의 주파수 대역을 비교하고, 근전도 신 호를 획득할 수 있다. 예를 들면, 프로세서는 심전도 신호의 주파수 대역(예: 0.5Hz~40Hz)에 비해 높은 근 전도 신호 주파수 대역(50Hz~150Hz)을 분리하는 필터링 기법(HPF, high-pass filter)을 이용할 수 있다. 일 실 시 예에 따르면, 프로세서는 근전도 신호를 구성하는 성분 중 낮은 주파수 대역(예: 0Hz~50Hz)의 성분을 분리하기 위해 다양한 신호 분리 기법(예: LMS(least mean square), RMS(root mean square))들을 이용할 수 있 다. 일 실시 예에 따르면, 프로세서는 동작 405에서 제1 심전도 신호로부터 근전도 신호를 분리한 제2 심전도 신호를 획득할 수 있다. 예를 들어, 프로세서는 근전도 신호를 제1 심전도 신호로부터 분리할 수 있다. 제 1 심전도 신호로부터 근전도 신호를 분리하는 내용은 도 5를 참조하여 설명된다. 다른 실시 예에 따르면, 프로세서는 동작 405에서 제1 심전도 신호로부터 근전도 신호를 분리한 후 잡음을 제거하여 제2 심전도 신호를 획득할 수 있다. 예를 들면, 프로세서는 근전도 신호가 필터링 된 신호에서 근전도 외에 섞여 있는 잡음을 제거할 수 있다. 일 실시 예에 따른 프로세서는 동작 407에서, 근전도 신호와 제2 심전도 신호에 기반하여 사용자의 웨어러 블 장치 착용 상태를 판단할 수 있다. 예를 들어, 프로세서는 웨어러블 장치의 착용 상태와 관 련하여, 정확한 심전도 측정 및 광용적맥파 측정이 불가한 과밀착 상태인지 판단할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 동작 409에서, 웨어러블 장치의 착용 상태에 대한 안내를 출 력할 수 있다. 예를 들어, 웨어러블 장치는 과밀착 상태인지, 웨어러블 장치가 흔들리는지 등 다양한 안내를 출력할 수 있다. 착용 상태에 대한 안내의 내용은 도 10 내지 도 12를 참조하여 자세히 설명된다. 도 5는 일 실시 예에 따른 웨어러블 장치에서, 웨어러블 장치의 착용 상태를 판단하는 내용에 대한 흐름도이다. 도 5를 참조하면, 프로세서는 동작 501에서, 도 4를 참조하여 설명된 제1 심전도 신호로부터 근전도 신호 를 분리하여 근전도 신호를 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 제1 심전도 신호로부터 근 전도 신호가 필터링 된 제2 심전도 신호를 획득할 수 있다. 다른 실시 예에 따르면, 프로세서는 제1 심전 도 신호로부터 근전도 신호 및 잡음이 필터링 된 제2 심전도 신호를 획득할 수 있다. 일 실시 예에 따르면, 프로세서는 동작 501에서 제2 심전도 신호 및 근전도 신호를 획득하기 위해, 주파수 대역이 상이한 복수의 필터 모델들을 사용할 수 있다. 예를 들어, 프로세서는 제1 심전도 신호를 제1 필터 에 통과시켜 근전도 신호를 획득할 수 있다. 제1 필터를 통과한 제1 심전도 신호는 근전도 신호가 필터링 된 신호일 수 있다. 일 실시 예에 따르면, 프로세서는 제1 필터를 통과한 신호를 제2 필터에 통과시킬 수 있다. 일 실시 예에 따르면, 제2 필터를 통과한 신호는, 제1 심전도 신호에서 근전도 신호 및 잡음이 필터링 된 제2 심전도 신호일 수 있다. 일 실시 예에 따르면, 필터의 주파수 대역은 필요에 따라 다양하게 설정될 수 있다. 예 를 들어, 상기 필터들은 다양하게 구현될 수 있다. 일 실시 예에 따른 프로세서는 동작 503에서 제2 심전도 신호에 기반하여 신호 품질을 계산할 수 있다. 예 를 들어, 제2 심전도 신호의 정량적 신호 품질(SNR, Signal to Noise Ratio)을 계산할 수 있다. 일 실시 예에 따르면 정량적 신호 품질은 수집된 심전도의 품질이 웨어러블 장치의 목적에 부합할 만큼 충분히 깨끗한 가를 나타낼 수 있다. 일 실시 예에 따르면, 동작 505에서 프로세서는 근전도 신호의 세기와 제1 기준값의 크기를 비교할 수 있 다. 예를 들어, 프로세서는 근전도 신호의 세기가 사용자의 심전도 신호 등을 판단하기에 부적합한지 판단 할 수 있다. 일 실시 예에 따르면, 근전도 신호의 세기가 제1 기준값 이상인 경우, 프로세서는 사용자의 웨어러블 장치 착용 상태가 과밀착 상태인 것으로 판단할 수 있다. 예를 들어, 사용자가 심전도 신호 측정 시 웨어러블 장치에 힘을 강하게 주는 경우, 전기적 자극을 통해 제1 심전도 신호에 포함된 근전도 신호의 세기는 제1 기준값 이상일 될 수 있다. 일 실시 예에 따르면, 프로세서는 근전도 신호의 세기가 제1 기준값 이하인 경우, 과밀착 상태가 아니라고 판단하고 웨어러블 장치의 착용 상태 판단을 종료할 수 있다. 일 실시 예에 따르면, 프로세서는 근전 도 신호의 세기가 제1 기준값 이상인 경우, 동작 507을 수행할 수 있다. 일 실시 예에 따르면, 프로세서는 동작 507에서 제2 심전도 신호의 품질과 제2 기준값을 비교할 수 있다. 일 실시 예에 따르면, 제2 심전도 신호의 품질은 정량적 신호 품질을 나타낼 수 있고, 제1 기준값과 제2 기준값 은 상이할 수 있다. 일 실시 예에 따르면, 프로세서는 사용자가 심전도 신호 및/또는 광용적맥파 측정 시, 근육을 많이 사용하고 있는 상황이라 할지라도 심전도 신호의 품질이 충분한 품질이라면 측정된 신호에 기반하 여 결과를 계산할 수 있다. 예를 들어, 근전도 신호의 세기가 제1 기준값 이상이라고 하더라도, 제2 심전도 신 호의 품질이 제2 기준값 이상인 경우, 프로세서는 심전도 신호 등의 측정을 통한 결과 계산에 충분한 신호 의 품질이라고 판단할 수 있다. 따라서, 프로세서는 제2 심전도 신호의 품질이 제2 기준값 이상인 경우, 웨어러블 장치의 착용 상태 판단을 종료할 수 있다. 일 실시 예에 따르면, 프로세서는 제2 심전도 신호의 품질이 제2 기준값 이하인 경우, 동작 509에서 웨어 러블 장치의 착용 상태를 과밀착 상태로 판단할 수 있다. 프로세서는 웨어러블 장치의 착용 상 태가 과밀착 상태 등 착용 상태 불량으로 판단된 경우, 동작 511에서 심전도 신호의 재측정을 요청할 수 있다. 예를 들어, 프로세서는 디스플레이, 스피커, 모터 등을 통하여 과밀착 상태 안내를 사용자 에게 출력할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 심전도 신호를 재측정 할 것인지에 대한 안내를 요청할 수 있다. 프로세서는 상기 안내에 대한 사용자의 응답에 기반하여 심전도 신호 등의 재측정을 시작할 수 있다. 웨어 러블 장치는 동작 511 이후, 동작 501 내지 동작 509를 반복적으로 수행할 수 있다. 도 6은 일 실시 예에 따른 웨어러블 장치에서, 복수의 착용 상태에 대한 안내들을 출력하는 내용에 대한 흐름도 이다. 도 6을 참조하면, 프로세서는 동작 601에서, 웨어러블 장치의 복수의 착용 상태에 대한 안내들의 종 류를 결정할 수 있다. 예를 들어, 사용자의 웨어러블 장치의 착용 상태의 종류를 불량(poor), 평균 (average), 좋음(good) 및 매우 좋음(excellent)로 결정할 수 있다. 웨어러블 장치의 착용 상태가 불량인 것은, 심전도 신호 및 광용적맥파를 측정하기에 적절하지 않은 착용 상태임을 나타낼 수 있다. 일 실시 예에 따 른 복수의 착용 상태에 대한 안내들의 종류는 다양할 수 있다. 프로세서는 동작 603에서, 상기 복수의 착용 상태에 대한 안내들 각각에 대응되는 근전도 신호의 세기를 결정할 수 있다. 근전도 신호의 세기는 도 4를 참조하여 설명된, 제1 심전도 신호에서 분리된 근전도 신호의 세 기를 나타낼 수 있다. 일 실시 예에 따른 프로세서는 복수의 착용 상태에 대한 안내들이 4종류(불량, 평균, 좋음, 매우 좋음)인 경우, 심전도 신호에 포함될 수 있는 근전도 신호의 세기를 4개의 범위로 구분할 수 있다. 예를 들어, 근전도 신호의 세기가 제1 기준값 이하이면 매우 좋음, 제1 기준값 초과 및 제2 기준값 이하 이면 좋음, 제2 기준값 초과 제3 기준값 이하이면 평균, 제3 기준값 초과이면 불량에 대응될 수 있다. 일 실시 예에 따르면, 프로세서는 동작 605에서, 웨어러블 장치의 복수의 착용 상태에 대한 안내들 각각에 대응되는 심전도 신호의 품질의 범위를 결정할 수 있다. 일 실시 예에 따르면, 심전도 신호의 품질은 도 4를 참조하여 설명된 제2 심전도 신호의 품질을 나타내고, 신호의 품질은 정량적 신호 품질을 나타낼 수 있다. 예를 들어, 제2 심전도 신호는 제1 심전도 신호에서 근전도 신호를 필터링한 신호 또는 제1 심전도 신호에서 근 전도 신호 및 잡음을 필터링한 신호를 나타낼 수 있다. 일 실시 예에 따른 프로세서는 복수의 착용 상태에 대한 안내들이 4종류(불량, 평균, 좋음, 매우 좋음)인 경우, 제2 심전도 신호의 품질의 범위를 4개의 범위로 구 분할 수 있다. 예를 들어, 제2 심전도 신호의 정량적 신호 품질의 값이 제4 기준값 이하이면 불량, 제4 기준값 초과 및 제5 기준값 이하이면 평균, 제5 기준값 초과 제6 기준값 이하이면 좋음, 제6 기준값 초과이면 매우 좋 음에 대응될 수 있다. 일 실시 예에 따르면, 도 3을 참조하여 설명된 메모리는 복수의 착용 상태에 대한 안내들의 종류들, 복수의 착 용 상태에 대한 안내들 각각에 대응되는 근전도 신호의 세기의 범위들 및 심전도 신호의 품질의 범위들을 저장 할 수 있다. 메모리는 프로세서의 제어를 통해, 제1 심전도 신호, 근전도 신호 및 제2 심전도 신호를 저장 할 수 있다. 일 실시 예에 따르면, 프로세서는 동작 607에서, 도 4 및 도 5를 참조하여 설명된 동작들과 마찬가지로 제 2 심전도 신호 및 근전도 신호를 획득할 수 있다. 예를 들어, 프로세서는 ECG 센서(예: 도 3의 제1 센서 )를 통하여 심전도 신호 데이터를 획득하고, 도 5의 동작 501에서 설명된 동작을 수행하여 제2 심전도 신 호 및 근전도 신호를 획득할 수 있다. 일 실시 예에 따른 프로세서는 동작 609에서, 근전도 신호의 세기 및 제2 심전도 신호의 품질이 상기 복수 의 착용 상태에 대한 안내들의 종류 중 어떤 착용 상태에 대응되는지 판단할 수 있다. 예를 들어, 근전도 신호 의 세기가 제1 기준값 이하이고, 제2 심전도 신호의 품질이 제6 기준값 초과인 경우, 프로세서는 웨어러블 장치의 착용 상태를 '매우 좋음'으로 판단할 수 있다. 일 실시 예에 따르면, 프로세서는 동작 609에서, 판단 결과에 기반하여 웨어러블 장치의 착용 상태에 대한 안내를 출력할 수 있다. 예를 들어, 상기 착용 상태에 대한 안내는 디스플레이, 스피커 및 모터 등을 통하여 출력될 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 다양한 구성 요소를 통하여 착용 상태에 대한 안내를 출력할 수 있다. 일 실시 예에 따르면, 프로세서는 웨어러블 장치의 성능에 따라 근전도 신호의 세기와 제2 심전도 신 호의 품질을 복합적으로 고려하여 착용 상태를 판단할 수 있다. 예를 들어, 프로세서는 웨어러블 장치 의 종류에 따라 동일한 근전도 신호의 세기 및 제2 심전도 신호의 품질이라고 하더라도 상이한 착용 상태 에 대한 안내를 출력할 수 있다. 도 7은 일 실시 예에 따른 웨어러블 장치를 통해 획득한 심전도 신호를 설명하기 위한 도면이다. 도 7은, 프로세서가 ECG 센서(예: 도 3의 제1 센서)를 통해 획득한 심전도 신호를 나타내는 그 래프이다. 일 실시 예에 따른 심전도 신호 그래프의 X축은 시간축이고, Y축은 시간에 따른 심전도 신호의 크기를 전압으로 나타내고 있다. 일 실시 예에 따르면, 근전도 신호에 의해 품질이 저하된 심전도 신호는 사용자가 심전도 신호 측정 시 웨 어러블 장치를 강하게 밀착시키는 거나 사용자가 강한 힘을 주는 경우 나타날 수 있다. 근전도 신호에 의 해 파형이 왜곡되어 신호 품질이 저하된 심전도 신호는 생체 신호 측정의 정확도를 떨어뜨릴 수 있다. 심전도 신호의 그래프는 다양하게 표현될 수 있으며, 본 명세서에서 기재된 것들에 의해 한정되지 아니한 다. 도 8은 일 실시 예에 따른 웨어러블 장치를 통해 획득한 광혈류측정 신호를 설명하기 위한 도면이다. 도 8을 참조하면, 일 실시 예에 따른 웨어러블 장치의 PPG 센서(예: 도 3의 제2 센서)를 통해 측정된 광혈 류측정 신호(PPG 신호)를 설명할 수 있다. 일 실시 예에 따른 정상 PPG 신호와 과밀착 PPG 신호의 X축은 시간축이고, Y축은 PPG 신호의 크기를 전압으로 나타내고 있다. 일 실시 예에 따르면, PPG 센서를 통해 측정되는 PPG 신호는 사용자의 피부 속 혈관에 흐르는 혈류량이 많아질수록 빛의 흡수량이 증가하고, 따라서 PPG 신호의 세기가 증가할 수 있다. PPG 센서의 적어도 하나의 LED가 광을 조사하는 경우, 일부 광은 사용자의 동맥혈, 정맥혈, 골격 및/또는 피부조직(예: 표 피(epidermis) 및/또는 진피(dermis))에 도달할 수 있다. 예를 들어, 동맥혈에 도달한 광의 일부는 사용자의 맥 박에 따른 동맥혈의 용량 변화로 인하여 변화되어 흡수될 수 있으며, 그 중 일부는 PPG 신호를 구성할 수있다. PPG 신호의 값은 사용자의 수축기 혈류량과 이완기 혈류량의 차이를 나타낼 수 있다. PPG는 좌심실 수축의 시작지점부터 최대 수축지점, 수축의 감소와 대동맥 벽의 팽창지점과 혈액 유출의 감소시점 그리고 변막 과 심근의 탄력파와 같은 모습으로 나타난다. 일 실시 예에 따른 정상 PPG 신호는 사용자가 웨어러블 장치를 정상적으로 착용하여 신호의 품질이 정상적인 그래프를 나타낼 수 있다. 일 실시 예에 따른 과밀착 PPG 신호는 사용자가 웨어러블 장치를 과하게 밀착시키거나 강한 힘을 주어 PPG 신호의 파형이 왜곡된 그래프를 나타낼 수 있다. 파형이 왜곡되어 신 호 품질이 저하된 PPG 신호는 생체 신호 측정의 정확도를 떨어뜨릴 수 있다. 다양한 실시 예에 따르면, PPG 신호의 그래프는 다양하게 생성될 수 있으며, 본 명세서에서 기재된 것들에 의해 한정되지 아니한다. 도 9는 일 실시 예에 따른 웨어러블 장치를 통해 획득한 심전도 신호에서 근전도 신호를 분리한 신호를 설명하 기 위한 도면이다. 도 9를 참조하면, 제1 심전도 신호는 프로세서가 ECG 센서(예: 도 3의 제1 센서)를 통해 획득한 심전도 신호를 나타내는 그래프이다. 일 실시 예에 따른 근전도 신호는 프로세서가 제1 심전도 신호 로부터 분리한 근전도 신호를 나타내는 그래프이다. 일 실시 예에 따르면, 제2 심전도 신호는 프로세 서가 제1 심전도 신호로부터 근전도 신호를 필터링한 신호를 나타내는 그래프이다. 일 실시 예에 따르면, 제1 심전도 신호, 근전도 신호 및/또는 제2 심전도 신호는 도 4 내지 도 5를 참조하여 설명된 제1 심전도 신호, 근전도 신호 및/또는 제2 심전도 신호에 각각 대응될 수 있다. 제1 심전도 신호, 근전도 신호 및 제2 심전도 신호의 X축은 시간축이고, Y축은 각각 신호의 크 기를 전압으로 나타내고 있다 다양한 실시 예에 따르면, 도 9를 참조하여 설명된 그래프들(910, 920, 930)은 다양하게 생성될 수 있으며, 본 명세서에서 기재된 것들에 의해 한정되지 아니한다. 도 10은 일 실시 예에 따른 웨어러블 장치에서, 디스플레이에 나타나는 심전도 측정 UI를 나타내기 위한 도면이 다. 도 10을 참조하면, 일 실시 예에 따른 웨어러블 장치는 ECG 센서 및 PPG 센서(센서 모듈)를 통하여 사용자의 생체 정보를 측정할 수 있다. 일 실시 예에 따르면, 사용자의 생체 정보가 정상적으로 측정되고 있다 고 판단되는 경우 프로세서는 디스플레이를 통해 안내 메시지를 출력할 수 있다. 예를 들어, 프로세 서는 사용자의 생체 정보가 정상적으로 측정되고 있다는 것을 알리기 위한 안내 메시지(예: “심전도 신호 를 측정 중입니다.”)를 출력할 수 있다. 일 실시 예에 따르면, 프로세서는 디스플레이를 통하여 ECG 신호 및 PPG 신호를 동시에 표시할 수 있 다. 예를 들어, 프로세서는 ECG 신호 및 PPG 신호를 수치 및/또는 그래프로 표시할 수 있다. 상술한 실시 예에 따르면, 웨어러블 장치는 사용자의 생체 정보를 수치 및/또는 그래프를 포함하는 UI로 제공함에 따라 사용자가 측정 결과를 직관적으로 인지하도록 지원할 수 있다. 상술한 실시 예에 따르면, 웨어러블 장치는 디스플레이를 통해, 생체 정보가 정상적으로 측정되고 있 음을 나타냈지만, 디스플레이에 제한되지 않고 다양한 웨어러블 장치의 구성요소(예: 스피커, 모터 등)를 통해 안내를 출력할 수 있다. 도 11은 일 실시 예에 따른 웨어러블 장치에서, 디스플레이에 나타나는 착용 상태 안내 UI를 나타내기 위한 도 면이다. 도 11을 참조하면, 일 실시 예에 따른 웨어러블 장치는 센서 모듈을 통해 획득한 사용자의 생체 정보 (예: 심전도 신호 등)에 기반하여 판단된 착용 상태에 대한 안내를 출력할 수 있다. 예를 들어, 프로세서 는 도 4 내지 도 5를 참조하여 설명된 동작에 기반하여 사용자의 웨어러블 장치 착용 상태를 판단할 수 있 다. 프로세서는 판단 결과 심전도 신호 등을 측정하기에 부적절한 착용 상태로 판단(예: 과밀착 상태)되면, 디스플레이를 통해 안내 메시지를 출력할 수 있다. 다른 실시 예에 따르면, 프로세서는 착용 상태에 대한 안내를 출력하기 위해 스피커를 통해 음성 안 내 또는 소리를 출력할 수 있다. 또 다른 예를 들어, 프로세서는 착용 상태에 대한 안내를 출력하기 위해모터를 통해 진동을 제공할 수 있다. 일 실시 예에 따르면, 프로세서는 UI, 소리 또는 진동 중 적어 도 둘 이상을 출력할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 UI, 소리 및 진동 중 적어도 하나를 출력하여 재측정 안내를 할 수 있다. 예를 들어, 프로세서는 사용자의 웨어러블 장치 착용 상태가 부적절하다고 판단된 경우(예: 과 밀착 상태) 생체 신호 재측정 안내를 하고, 사용자 생체 정보(예: 심전도 신호)를 재측정할 수 있다. 일 실시 예에 따른 웨어러블 장치는 안내 메시지 등을 통해, 센서 모듈이 사용자의 피부에 밀 착되어 있지 않거나 과도하게 밀착되어 생체 신호 품질을 저하시키는 상태인 경우 사용자가 적당한 밀착 상태로 착용 상태를 변경할 수 있도록 유도할 수 있다. 도 12는 일 실시 예에 따른 웨어러블 장치에서, 디스플레이에 나타나는 착용 상태에 대한 복수의 안내들 UI를 나타내기 위한 도면이다. 도 12를 참조하면, 일 실시 예에 따른 웨어러블 장치는 센서 모듈을 통해 획득한 사용자의 생체 정보 (예: 심전도 신호 등)에 기반하여 판단된 착용 상태에 대한 복수의 안내들을 출력할 수 있다. 예를 들어, 프로 세서는 도 6을 참조하여 설명된 동작에 기반하여 사용자의 웨어러블 장치의 착용 상태를 판단할 수 있다. 일 실시 예에 따르면, 프로세서는 판단 결과에 기반하여 도 6을 참조하여 설명된 복수의 착용 상태 에 대한 안내들에 대응되는 안내 메시지 등을 출력할 수 있다. 예를 들어, 프로세서는 디스플레이를 통해, 사용자의 웨어러블 장치의 착용 상태에 대한 안내를 그림이나 동영상을 출력할 수 있다. 일 실시 예 에 따르면, 사용자가 센서 모듈을 피부에 접착시키는 정도에 대응하여, 프로세서는 착용 상태를 판단 하고, 현재 착용 상태에 기반한 신호 품질의 판단 결과를 신호등이나 게이지 같은 애니메이션 등을 이용하여 출 력할 수 있다. 일 실시 예에 따르면, 사용자의 생체 신호 획득을 위한 복수의 전극중 적어도 하나는 디스플레이상에 배치될 수 있다. 사용자는 웨어러블 장치를 착용한 손의 반대쪽 손으로 디스플레이상에 힘을 주어 생 체 신호를 측정할 수 있다. 일 실시 예에 따르면, 사용자는 자연스럽게 디스플레이에 힘을 가할 수 있다. 일 실시 예에 따른 프로세서는 디스플레이에 가해진 힘에 기반하여, 과밀착 상태로 인해 생체 정보 측정에 부적절한 착용 상태인지 판단할 수 있다. 예를 들어, 프로세서는 심전도 신호 측정 시, 사용자가 과하게 디스플레이 상에 힘을 주어, 근전도 신호가 섞여 정밀한 측정을 어렵게 하는지 판단할 수 있다. 일 실시 예에 따른 웨어러블 장치는 생체 정보 측정을 위한 웨어러블 장치의 착용 상태를 안내하고, 정확한 생체 정보 측정을 위한 착용법 등을 안내할 수 있다. 예를 들어, 웨어러블 장치는 UI, 소리 및 진 동 등을 이용해 즉각적인 착용 상태 변화를 안내할 수 있다. 웨어러블 장치는 사용자는 스스로 좋은 품질 의 신호를 측정할 수 있는 착용 노하우를 익히도록 유도할 수 있다. 도 13은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치(예: 도 1의 웨어러블 장치(10 0))의 블록도이다. 도 13을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네 트워크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버(130 8)를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서(예: 도 3의 프로세서), 메모리, 입력 모듈, 음향 출력 모듈(예: 도 3의 스피커), 디스플 레이 모듈(예: 도 3의 디스플레이), 오디오 모듈, 센서 모듈(예: 도 3의 센서 모듈 ), 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배 터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상 의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메 라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고 리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학 습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한 정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망 (DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면,센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1302, 또는 1304) 각각은 전자 장 치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작 들의 전부 또는 일부는 외부의 전자 장치들(1302, 1304, 또는 1308) 중 하나 이상의 외부의 전자 장치들에서 실 행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로 부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라 고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달 할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어 도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅 (MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예 를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버(130 8)는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 상술한 바와 같이, 일 실시 예에 따른 웨어러블 장치(예: 도 1의 전자 장치)는 복수의 전극(예: 도 3의 전 극)을 가지는 제1 센서(예: 도 3의 제1 센서), 제1 센서와 전기적으로 연결되는 적어도 하나의 프로 세서(예: 도 3의 프로세서)를 포함하고, 적어도 하나의 프로세서는 웨어러블 장치가 사용자의 신체에 착용 된 상태에서 제1 센서를 이용하여 제1 심전도 신호를 획득하고, 제1 심전도 신호로부터 근전도 신호를 획득하고, 제1 심전도 신호에서 근전도 신호가 필터링 된 제2 심전도 신호를 획득하고, 근전도 신호의 세기 및 제2 심전도 신호의 품질에 기반하여 웨어러블 장치의 착용 상태를 판단하고, 판단 결과에 기반하여 착용 상태에 대한 안내를 출력할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 디스플레이 및 상기 디스플레이를 둘러싸는 하우징을 포함하고, 상 기 복수의 전극 중 제1 전극은 상기 하우징의 하부면에 배치되고, 제2 전극은 상기 하우징의 측면 또는 상면에 배치될 수 있다. 일 실시 예에 따른 웨어러블 장치의 상기 제1 전극은 상기 디스플레이 상에 배치되고, 상기 제2 전극은 상 기 디스플레이를 둘러싸는 하우징의 일부에 배치될 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 상기 제2 심전도 신호를 획득할 때, 상기 적어도 하나의 프로세서 는 상기 제1 심전도 신호에서 상기 근전도 신호를 필터링 하고, 상기 근전도 신호가 필터링 된 신호에서 상기 근전도 신호 외에 잡음을 제거하여 제2 심전도 신호를 획득할 수 있다.일 실시 예에 따르면, 웨어러블 장치의 상기 적어도 하나의 프로세서는 상기 근전도 신호의 세기가 제1 기 준 값 이상이고 상기 제2 심전도 신호의 품질이 제2 기준 값 이하인 경우, 상기 착용 상태가 과밀착 상태임을 안내하는 메시지를 출력할 수 있다. 일 실시 예에 따른 웨어러블 장치의 상기 적어도 하나의 프로세서는 상기 과밀착 상태임을 안내하는 메시 지와 재측정 요청 메시지를 출력하고, 상기 재측정 요청 메시지에 대한 응답에 기반하여 상기 웨어러블 장치가 사용자의 신체에 착용된 상태에서 상기 제1 센서를 이용하여 제3 심전도 신호를 획득하고, 상기 제3 심전도 신 호로부터 제2 근전도 신호를 획득하고, 상기 제3 심전도 신호에서 상기 제2 근전도 신호가 필터링 된 제4 심전 도 신호를 획득하고, 상기 제2 근전도 신호의 세기 및 상기 제4 심전도 신호의 품질에 기반하여 상기 웨어러블 장치의 재착용 상태를 판단하고, 상기 판단 결과에 기반하여 상기 재착용 상태에 대한 안내를 출력할 수 있다. 일 실시 예에 따른 웨어러블 장치의 상기 적어도 하나의 프로세서는 복수의 착용 상태에 대한 안내들 각각 에 대응되는 서로 다른 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위들을 결정하고, 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위에 대응되는 상기 복수의 착용 상태에 대한 안내들 중 하나를 출력할 수 있다. 일 실시 예에 따르면, 웨어러블 장치의 상기 적어도 하나의 프로세서는 상기 제1 심전도 신호, 상기 근전 도 신호, 상기 제2 심전도 신호 및 상기 복수의 착용 상태에 대한 안내들 각각에 대응되는 서로 다른 상기 근전 도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위 중 적어도 하나를 저장하는 메모리를 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 발광부와 수광부를 가지는 제2 센서를 더 포함할 수 있고, 상기 적 어도 하나의 프로세서는 상기 웨어러블 장치가 사용자의 신체에 착용된 상태에서 상기 제2 센서를 이용하여 PPG 신호를 획득할 수 있다. 일 실시 예에 따르면, 웨어러블 장치는 디스플레이를 포함하고, 상기 적어도 하나의 프로세서는 상기 디스 플레이를 통해 상기 착용 상태에 대한 알림을 제공할 수 있다. 일 실시 예에 따른 웨어러블 장치는 모터를 더 포함할 수 있고, 상기 적어도 하나의 프로세서는 상기 모터 를 통해 진동을 출력하여 상기 착용 상태에 대한 알림을 제공할 수 있다. 일 실시 예에서 웨어러블 장치는 스피커를 더 포함할 수 있고, 상기 적어도 하나의 프로세서는 상기 스피 커를 통해 음성 안내 또는 소리를 출력하여 상기 착용 상태에 대한 알림을 제공할 수 있다. 상술한 바와 같이, 일 실시 예에 따른 웨어러블 장치의 동작 방법은 상기 웨어러블 장치가 사용자의 신체 에 착용된 상태에서 제1 센서를 이용하여 제1심전도 신호를 획득하는 동작, 상기 제1 심전도 신호로부터 근전도 신호를 획득하는 동작, 상기 제1 심전도 신호에서 상기 근전도 신호가 필터링 된 제2 심전도 신호를 획득하는 동작 및 상기 근전도 신호의 세기 및 상기 제2 심전도 신호의 품질에 기반하여 상기 웨어러블 장치의 착용 상태 를 판단하는 동작을 포함할 수 있다. 일 실시 예에 따른 웨어러블 장치는 상기 웨어러블 장치는 디스플레이 및 상기 디스플레이를 둘러싼 하우 징을 포함하고, 상기 제1 센서는 복수의 전극을 포함하고, 상기 복수의 전극 중 제1 전극은 상기 하우징의 하부 면에 배치되고, 제2 전극은 상기 하우징의 측면 또는 상면에 배치될 수 있다. 일 실시 예에 따른 웨어러블 장치의 상기 제1 전극은 상기 디스플레이에 배치되고 상기 제2 전극은 상기 하우징의 일부에 배치될 수 있다. 일 실시 예에 따른 웨어러블 장치의 동작 방법은, 상기 제2 심전도 신호를 획득하는 동작은 상기 제1 심전 도 신호를 제1 필터에 통과하는 동작, 상기 제1 필터를 거친 신호를 제2 필터에 통과하는 동작을 더 포함할 수 있고, 상기 제1 필터 및 상기 제2 필터는 주파수 대역이 상이할 수 있다. 일 실시 예에 따른 웨어러블 장치의 동작 방법은, 상기 착용 상태를 판단하는 동작은 상기 근전도 신호의 세기가 제1 기준 값 이상인지 판단하는 동작, 상기 제2 심전도 신호의 품질이 제2 기준 값 이하인지 판단하는 동작을 더 포함할 수 있다. 일 실시 예에 따른 웨어러블 장치의 동작 방법은, 상기 착용 상태를 판단하는 동작의 결과에 기반하여 상 기 착용 상태에 대한 안내를 출력하는 동작을 더 포함할 수 있다. 일 실시 예에 따르면, 웨어러블 장치의 동작 방법은, 상기 착용 상태를 판단하는 동작은 복수의 착용 상태 들 각각에 대응되는 서로 다른 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위들을 결 정하는 동작, 상기 근전도 신호의 세기의 범위 및 상기 제2 심전도 신호의 품질의 범위에 대응되는 상기 복수의 착용 상태들 중 하나의 착용 상태를 판단하는 동작을 더 포함할 수 있다. 일 실시 예에 따른 웨어러블 장치의 상기 착용 상태에 대한 안내를 출력하는 동작은 상기 착용 상태가 과 밀착 상태임을 안내하는 메시지를 소리, 진동 및 화면 중 적어도 하나의 방법으로 출력하는 동작일 수 있다."}
{"patent_id": "10-2020-0138444", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 웨어러블 장치를 신체의 일부에 장착하는 것을 나타내는 도면이다. 도 2는 일 실시 예에 따른 웨어러블 장치의 사시도이다. 도 3은 일 실시 예에 따른 웨어러블 장치의 블록도이다. 도 4는 일 실시 예에 따른 웨어러블 장치에서, 웨어러블 장치의 착용 상태를 판단하는 내용에 대한 흐름도이다. 도 5는 일 실시 예에 따른 웨어러블 장치에서, 웨어러블 장치의 착용 상태를 판단하는 내용에 대한 흐름도이다. 도 6은 일 실시 예에 따른 웨어러블 장치에서, 복수의 착용 상태에 대한 안내들을 출력하는 내용에 대한 흐름도 이다. 도 7은 일 실시 예에 따른 웨어러블 장치를 통해 획득한 심전도 신호를 설명하기 위한 도면이다. 도 8은 일 실시 예에 따른 웨어러블 장치를 통해 획득한 광혈류측정 신호를 설명하기 위한 도면이다. 도 9는 일 실시 예에 따른 웨어러블 장치를 통해 획득한 심전도 신호에서 근전도 신호를 분리한 신호를 설명하 기 위한 도면이다. 도 10은 일 실시 예에 따른 웨어러블 장치에서, 디스플레이에 나타나는 심전도 측정 UI를 나타내기 위한 도면이 다. 도 11은 일 실시 예에 따른 웨어러블 장치에서, 디스플레이에 나타나는 착용 상태 안내 UI를 나타내기 위한 도 면이다. 도 12는 일 실시 예에 따른 웨어러블 장치에서, 디스플레이에 나타나는 착용 상태에 대한 복수의 안내들 UI를 나타내기 위한 도면이다. 도 13은 일 실시 예에 따른 네트워크 환경 내의 전자 장치의 블록도이다."}
