{"patent_id": "10-2017-0039086", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2018-0109401", "출원번호": "10-2017-0039086", "발명의 명칭": "오타 수정 방법 및 이를 이용하는 휴대 단말기", "출원인": "박용구", "발명자": "박용구"}}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이부에 터치입력에 의해 문자를 입력할 수 있는 복수의 터치키가 배열된 문자입력창을 표시하는 단계;상기 터치키를 통한 터치입력에 의해 문자를 입력받는 단계;오타로 추정되는 오타 문자의 입력이 있는지 판단하는 단계; 및상기 오타 문자의 입력이 있는 경우, 상기 오타 문자를 입력한 제1 터치키에서 터치된 영역에 기초하여 선택된제2 터치키에 대응하는 문자로 상기 오타 문자를 인식하여 처리하는 단계를 포함하는 오타 수정 방법."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 터치키는 좌측 영역과 우측 영역으로 나누어지며, 상기 터치된 영역이 상기 좌측 영역이면. 상기 제1터치키의 좌측에 인접 배치된 터치키를 상기 제2 터치키로 선택하고, 상기 터치된 영역이 상기 우측 영역이면,상기 제1 터치키의 우측에 인접 배치된 터치키를 상기 제2 터치키로 선택하는 것을 특징으로 하는 오타 수정 방법."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 터치키는 상측 영역과 하측 영역으로 나누어지며, 상기 터치된 영역이 상기 상측 영역이면. 상기 제1터치키의 상측에 인접 배치된 터치키를 상기 제2 터치키로 선택하고, 상기 터치된 영역이 상기 하측 영역이면,상기 제1 터치키의 하측에 인접 배치된 터치키를 상기 제2 터치키로 선택하는 것을 특징으로 하는 오타 수정 방법."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 오타 문자의 입력이 있는지 여부에 대한 판단은, 입력된 문자로 이루어진 단어가 미리 등록되어 있는 단어사전에 존재하는 단어인지 여부로 판단하는 것을 특징으로 하는 오타 수정 방법."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 내지 제4항 중 어느 한 항의 오타 수정 방법을 프로세서에서 실행시키기 위한 프로그램을 기록한 프로세서가 읽을 수 있는 기록매체."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "디스플레이부;메모리; 제어부; 및 상기 메모리에 저장되어 상기 제어부에 의해 실행되는 하나 이상의 모듈을 포함하며, 상기 하나 이상의모듈은, 상기 디스플레이부에 터치입력에 의해 문자를 입력할 수 있는 복수의 터치키가 배열된 문자입력창을 표시하는과정;상기 터치키를 통한 터치입력에 의해 문자를 입력받는 과정;공개특허 10-2018-0109401-3-오타로 추정되는 오타 문자의 입력이 있는지 판단하는 과정; 및상기 오타 문자의 입력이 있는 경우, 상기 오타 문자를 입력한 제1 터치키에서 터치된 영역에 기초하여 선택된제2 터치키에 대응하는 문자로 상기 오타 문자를 대체하여 처리하는 과정을 수행하는 명령을 포함하는 휴대 단말기."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 터치키는 좌측 영역과 우측 영역으로 나누어지며, 상기 터치된 영역이 상기 좌측 영역이면. 상기 제1터치키의 좌측에 인접 배치된 터치키를 상기 제2 터치키로 선택하고, 상기 터치된 영역이 상기 우측 영역이면,상기 제1 터치키의 우측에 인접 배치된 터치키를 상기 제2 터치키로 선택하는 것을 특징으로 하는 휴대 단말기."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 제1 터치키는 상측 영역과 하측 영역으로 나누어지며, 상기 터치된 영역이 상기 상측 영역이면. 상기 제1터치키의 상측에 인접 배치된 터치키를 상기 제2 터치키로 선택하고, 상기 터치된 영역이 상기 하측 영역이면,상기 제1 터치키의 하측에 인접 배치된 터치키를 상기 제2 터치키로 선택하는 것을 특징으로 하는 휴대 단말기."}
{"patent_id": "10-2017-0039086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 오타 문자의 입력이 있는지 여부에 대한 판단은, 입력된 단어가 미리 등록되어 있는 단어사전에 존재하는단어인지 여부로 판단하는 것을 특징으로 하는 휴대 단말기."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 오타 수정 방법 및 이를 이용하는 휴대 단말기에 관한 것이다. 본 발명에 따른 오타 수정 방법은, 디 스플레이부에 터치입력에 의해 문자를 입력할 수 있는 복수의 터치키를 구비하는 문자입력창을 표시하는 과정, 터치키를 통한 터치입력에 의해 문자를 입력받는 과정, 오타로 추정되는 오타 문자의 입력이 있는지 판단하는 과 정, 및 오타 문자의 입력이 있는 경우, 오타 문자를 입력한 제1 터치키에서 터치된 영역에 기초하여 선택된 제2 터치키에 대응하는 문자로 오타 문자를 인식하여 처리하는 과정을 포함한다. 본 발명에 따르면, 터치입력에 의해 문자를 입력하는 경우 발생하는 오타를 복잡한 알고리즘을 사용하지 않고, 터치키에서 터치된 영역을 이용하는 비교적 간단한 처리 절차에 의해 수정할 수 있다."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 터치입력에 의해 문자입력을 하는 경우 발생하는 오타를 수정할 수 있는 오타 수정 방법 및 이를 이 용하여 오타를 수정할 수 있는 기능을 제공하는 휴대 단말기에 관한 것이다."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "휴대 단말기는 휴대가 가능하면서 음성 및 영상 통화를 수행할 수 있는 기능, 정보를 입·출력할 수 있는 기능, 및 데이터를 저장할 수 있는 기능 등을 하나 이상 갖춘 휴대용 기기이다. 이러한 휴대 단말기는 그 기능이 다 양화됨에 따라, 사진이나 동영상의 촬영, 음악 파일이나 동영상 파일의 재생, 게임, 방송의 수신, 무선 인터넷 등과 같은 복잡한 기능들을 갖추게 되었으며, 종합적인 멀티미디어 기기(multimedia player) 형태로 구현되고 있다. 그런데, 휴대 단말기는 이동성이나 휴대성 등을 고려해야 하므로, 디스플레이(display)나 키패드(keypad)와 같 은 사용자 인터페이스를 위한 장치 등을 위한 공간 할당에도 제약이 존재한다. 이에 따라, 휴대 단말기에 전면 터치스크린이 적용되더라도 그 크기는 제한적일 수밖에 없다. 따라서, 휴대 단말기와 같은 기기에서 터치스크린에 쿼티(QWERTY) 입력창과 같은 문장입력창을 표시하고 터치입 력에 의해 문자를 입력하는 경우, 문자입력창의 각 터치키가 표시되는 영역과 터치인식 영역이 매우 작아서 가 시성이 떨어지고, 문자입력시 오타가 발생하기 쉽다. 이러한 문자입력의 오타를 방지하고 수정하기 위하여 여러 가지 방안이 제시되고 있으며, 최근에는 입력된 문자 를 인공지능을 이용하여 프로그램 내부적으로 분석하여 오타를 수정하거나, 개인별 입력 패턴의 통계적 분석에 의해 오타를 수정하는 방법 등이 제시되고 있다. 그러나, 이와 같은 방법은 복잡한 알고리즘을 사용하므로, 처리 속도가 늦으며, 개인별 입력 패턴의 통계적 분 석이 완료되기 전까지는 오타 수정 기능을 제공할 수 없다.따라서, 휴대 단말기나 기타 터치입력에 의해 문자를 입력하는 기기에서, 문자입력시 오타가 발생하는 경우, 복 잡한 알고리즘을 사용하지 않고도 간편하고 신속하게 오타를 수정할 수 있는 방안을 고려해 볼 필요가 있다."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 터치입력에 의해 문자를 입력하는 경우 발생하는 오타를 비교적 간단한 처리 과정에 의해 수 정할 수 있는 오타 수정 방법 및 이를 이용하여 오타를 수정할 수 있는 휴대 단말기를 제공함에 있다."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명에 따른 오타 수정 방법은, 디스플레이부에 터치입력에 의해 문자를 입력할 수 있는 복수의 터치키가 배열된 문자입력창을 표시하는 단계, 상기 터치키를 통한 터치입력에 의해 문자를 입 력받는 단계, 오타로 추정되는 오타 문자의 입력이 있는지 판단하는 단계, 및 상기 오타 문자의 입력이 있는 경 우, 상기 오타 문자를 입력한 제1 터치키에서 터치된 영역에 기초하여 선택된 제2 터치키에 대응하는 문자로 상 기 오타 문자를 인식하여 처리하는 단계를 포함한다. 상기 제1 터치키는 좌측 영역과 우측 영역으로 나누어지며, 상기 터치된 영역이 상기 좌측 영역이면. 상기 제1 터치키의 좌측에 인접 배치된 터치키를 상기 제2 터치키로 선택하고, 상기 터치된 영역이 상기 우측 영역이면, 상기 제1 터치키의 우측에 인접 배치된 터치키를 상기 제2 터치키로 선택할 수 있다. 또한, 상기 제1 터치키는 상측 영역과 하측 영역으로 나누어지며, 상기 터치된 영역이 상기 상측 영역이면. 상 기 제1 터치키의 상측에 인접 배치된 터치키를 상기 제2 터치키로 선택하고, 상기 터치된 영역이 상기 하측 영 역이면, 상기 제1 터치키의 하측에 인접 배치된 터치키를 상기 제2 터치키로 선택할 수 있다. 또한, 상기 오타 문자의 입력이 있는지 여부에 대한 판단은, 입력된 문자로 이루어진 단어가 미리 등록되어 있 는 단어인지 여부로 판단할 수 있다. 또한, 본 발명에 따른 휴대 단말기는, 디스플레이부, 메모리, 제어부, 및 상기 메모리에 저장되어 상기 제어부 에 의해 실행되는 하나 이상의 모듈을 포함하며, 상기 하나 이상의 모듈은, 상기 디스플레이부에 터치입력에 의해 문자를 입력할 수 있는 복수의 터치키가 배열된 문자입력창을 표시하는 과정, 상기 터치키를 통한 터치입 력에 의해 문자를 입력받는 과정, 오타로 추정되는 오타 문자의 입력이 있는지 판단하는 과정, 및 상기 오타 문 자의 입력이 있는 경우, 상기 오타 문자를 입력한 제1 터치키에서 터치된 영역에 기초하여 선택된 제2 터치키에 대응하는 문자로 상기 오타 문자를 대체하여 처리하는 과정을 수행하는 명령을 포함한다. 그리고, 상기 목적을 달성하기 위하여 본 발명에서는, 상기 방법을 프로세서에서 실행시키기 위한 프로그램을 기록한 프로세서로 읽을 수 있는 기록매체를 제공한다."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 터치입력에 의해 문자를 입력하는 경우 발생하는 오타를 복잡한 알고리즘을 사용하지 않고, 터치키에서 터치된 영역을 이용하는 비교적 간단한 처리 절차에 의해 수정할 수 있다. 이에 따라, 문자입력시 발생하는 오타를 신속하게 수정할 수 있다. 또한, 처리 절차가 간단하고 신속하므로, 오타 수정에 이용하는 하 드웨어 자원 및 전력 소모량이 적어서, 저전력 소모가 요구되는 휴대 단말기에 효율적으로 적용할 수 있다."}
{"patent_id": "10-2017-0039086", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 보다 상세하게 설명한다. 도 1은 본 발명에 따른 오타 수정 방법이 적용되는 휴대 단말기의 블럭 구성도의 일 예를 나타낸 도면이다. 도 1을 참조하면, 본 휴대 단말기는 무선통신부, 사용자 입력부, 음향 입출력부, 메모리 , 디스플레이부, 센싱부, 인터페이스부, 제어부, 및 전원부를 포함할 수 있다. 이와 같은 구성요소들은 실제 응용에서 구현될 때 필요에 따라 2 이상의 구성요소가 하나의 구성요소로 합쳐지 거나, 혹은 하나의 구성요소가 2 이상의 구성요소로 세분되어 구성될 수 있다. 무선통신부는 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 무선통신부는 무선 인터넷 접속이나 근거리 통신을 위한 모듈을 구비할 수도 있다. 이때, 근거리 통신기술 로 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신, UWB(Ultra Wideband), 지그비 (ZigBee), NFC(Near Field Communication) 등이 이용될 수 있다. 사용자 입력부는 사용자가 휴대 단말기의 동작 제어를 위한 키 입력 데이터를 발생시킨다. 사용자 입력부는 사용자의 푸시 조작이나 터치 조작 등에 의해 명령이나 정보를 입력받을 수 있도록 구성할 수 있 다. 음향 입출력부는 통화 모드나 방송수신 모드 등에서 무선통신부로부터 수신되거나 메모리에 저 장된 오디오 데이터를 출력한다. 또한, 음향 입출력부는 마이크로폰(microphone)에 의해 외부의 음향 신 호를 입력받아 전기적인 음성 데이터로 처리할 수 있다. 메모리는 제어부의 처리 및 제어를 위한 프로그램이 저장될 수도 있고, 입력되거나 출력되는 데이터 들을 임시 저장하는 기능을 수행할 수도 있다. 디스플레이부는 휴대 단말기에서 처리되는 정보를 표시 출력한다. 예컨대, 휴대 단말기가 화상 통화 모드 또는 촬영 모드인 경우, 촬영되거나 수신된 영상을 각각 혹은 동시에 표시할 수 있으며, UI(User Interface), GUI(Graphic User Interface)를 표시한다. 만일, 디스플레이부가 터치스크린으로 구성되는 경우, 디스플레이부는 출력 장치 이외에 사용자의 터치에 의한 정보의 입력이 가능한 입력 장치로도 사용 될 수 있다. 센싱부는 휴대 단말기의 위치, 사용자 접촉 유무 등과 같이 휴대 단말기의 현 상태를 감지하여 휴대 단말기의 동작을 제어하기 위한 센싱 신호를 발생시킨다. 이를 위해 센싱부는 감지센서, 압력 센서, 및 모션 센서 등을 포함할 수 있다. 인터페이스부는 휴대 단말기에 연결되는 모든 외부기기와의 인터페이스 역활을 수행한다. 휴대 단말 기에 연결되는 외부기기의 예로는, 이어폰, 헤드셋 등과 같은 오디오 출력기기, 유선이나 무선 데이터 포 트 등이 있다. . 제어부는 상기 각부의 동작을 제어하여, 휴대 단말기의 전반적인 동작을 제어한다. 그리고, 전원부는 제어부의 제어에 의해 외부의 전원, 내부의 전원을 인가받아 각 구성요소들의 동작 에 필요한 전원을 공급한다. 도 2는 본 발명에 따른 오타 수정 방법에 대한 설명에 제공되는 흐름도이다. 도 2를 참조하면, 사용자의 명령에 따라 문자, 메신저, 메일 등과 같은 문자를 입력하는 문자 입력 모드가 선택 되면(S200), 제어부는 터치스크린으로 구성된 디스플레이부에 터치입력에 의해 문자를 입력할 수 있 는 복수의 터치키가 배열된 문자입력창을 표시하고(S205), 터치키를 통한 터치입력에 의해 문자를 입력받는다 (S205). 이때, 문자입력창은 쿼티(Qwerty) 입력창이나 키패드 입력창 등을 포함한다. 제어부는 문자 입력 중에 오타로 추정되는 오타 문자의 입력이 있는지 여부에 대하여 판단한다(S215). 오타 문자의 입력 여부는 입력된 문자로 이루어진 단어가 미리 등록되어 있는 단어 사전에 존재하는 단어인지 여부로 판단할 수 있다. 이외에도, 인공지능을 이용한 맞춤법 검사 방법에 의해서도 판단할 수 있다. S215 단계에서 오타 문자의 입력이 있는 것으로 판단한 경우, 제어부는 오타 문자를 입력한 터치키에서 터 치된 영역에 기초하여 선택된 다른 터치키에 대응하는 문자로 오타 문자를 인식하여(S220), 입력된 문자를 처리 한다(S225). 즉, 터치키를 몇 개의 영역으로 나눈 후, 터치된 영역에 따라 다른 터치키에 대응하는 문자로 인식할 수 있다. 예컨대, 터치키를 좌측 영역과 우측 영역으로 나누고, 터치된 영역이 좌측 영역이면. 터치키의 좌측에 인접 배 치된 터치키에 대응하는 문자로 인식하고, 터치된 영역이 우측 영역이면, 터치키의 우측에 인접 배치된 터치키에 대응하는 문자로 인식할 수 있다. 또한, 터치키를 상측 영역과 하측 영역으로 나누고, 터치된 영역이 상측 영역이면. 상측에 인접 배치된 터치키 에 대응하는 문자로 인식하고, 터치된 영역이 하측 영역이면, 터치키의 하측에 인접 배치된 터치키에 대응하는 문자로 인식할 수 있다. 입력된 문자를 처리하는 과정은, 다른 터치키에 대응하는 문자로 오타 문자를 대체하여 처리할 수도 있고, 다른 터치키에 대응하는 문자에 가중치를 주어서 별도의 오타 수정 알고리즘에 따라 오타를 처리할 수도 있다. 이와 같은 과정은 문자 입력 모드의 종료가 선택되는 경우까지 반복적으로 수행된다(S230). 도 3 내지 도 6은 본 발명의 일실시예 따른 오타 수정 방법에 대한 설명에 참조되는 도면이다. 도 3에 도시한 바와 같이, 문자입력 모드가 선택되면, 터치스크린으로 구성된 디스플레이부에 터치입력에 의해 문자를 입력할 수 있는 복수의 터치키가 배열된 문자입력창을 표시할 수 있다. 이와 같은 문자입력창에서 기본적으로 각 터치키를 좌우 두 개의 영역으로 나누어 사용할 수 있다. 예컨 대, 터치키를 통한 터치입력에 'var'이라는 단어가 입력되어, 'v'가 오타 문자로 추정되는 경우, 도 4에 도시한 바와 같이, V 터치키를 좌측 영역과 우측 영역으로 나누고, 도 5에 도시한 바와 같이, V 터치키의 좌 측 영역이 터치되었다고 가정하면, 오타 문자는 좌측에 인접배치된 B 터치키에 대응하는 문자인 'b'로 인 식되어 처리될 수 있다. 즉, 기존 인공지능을 사용한 오타 수정 방법에서는, 'v'의 왼쪽에 해당하는 'c'가 맞는 것인지 아니면 'v'의 오 른쪽에 해당하는 'b'가 맞는 것인지 알아내는데 복잡한 알고리즘을 사용해야 하지만, 본 발명에 따른 오타 수정 방법에서는 V 터치키를 좌우 두 개의 영역으로 나누어, 좌측 영역을 터치한 경우라면, 'b' 보다는 'c'에 가중치 를 두어 유추할 수 있고, 반대로 우측 영역을 터치한 경우라면, 'c' 보다는 'b'에 가중치를 두어 유추할 수 있 다. 이외에도, 터치키의 배열 상태에 따라서는 터치키를 상하 두 개의 영역으로 나누어 사용하거나, 기타 여러 개의 영역으로 나누어 사용할 수 있다. 예컨대, 도 6에 도시한 바와 같이, 터치키가 배열이 되는 경우에는, 터치키를 좌측 상부 영역, 우측 상부 영역, 하측 영역으로 나누어, H 터치키의 상부 영역이 터치된 경우에는 Y 터치키에 대응하는 문 자, H 터치키의 우측 상부 영역이 터치된 경우에는 U 터치키에 대응하는 문자, 그리고 H 터치키의 하측 영 역이 터치된 경우에는 B 터치키에 대응하는 문자에 가충치를 두고 오타를 수정할 수 있다. 이와 같은 방법은, 인공지능 프로그램 등과 연동하여 프로그램 내부적으로 오타를 수정하는 경우에도, 개인별 입력 패턴의 통계 등에 의존할 때와는 달리 터치영역을 이용함으로써 정교함은 떨어지지만, 간단하게 적용할 수 있다. 한편, 본 발명에 따른 오타 수정 방법 및 이를 이용하는 휴대 단말기는 상기한 바와 같이 설명된 실시예들의 구 성에 한정되게 적용될 수 있는 것이 아니라, 상기한 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시예들 의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다. 또한, 본 발명은 프로세서가 읽을 수 있는 기록매체에 프로세서가 읽을 수 있는 코드로서 구현하는 것이 가능하 다. 프로세서가 읽을 수 있는 기록매체는 프로세서에 의해 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기 록장치를 포함한다. 프로세서가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스 크, 광 데이터 저장장치 등이 있으며, 또한 인터넷을 통한 전송 등과 같은 캐리어 웨이브의 형태로 구현되는 것 도 포함한다. 또한 프로세서가 읽을 수 있는 기록매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산방 식으로 프로세서가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실 시예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분 야에서 통상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2017-0039086", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 오타 수정 방법이 적용되는 휴대 단말기의 블럭 구성도의 일 예를 나타낸 도면, 도 2는 본 발명의 일 실시예에 따른 오타 수정 방법에 대한 설명에 제공되는 흐름도, 그리고 도 3 내지 도 6은 본 발명의 일실시예에 따른 오타 수정 방법에 대한 설명에 참조되는 도면이다."}
