{"patent_id": "10-2018-0056267", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0134928", "출원번호": "10-2018-0056267", "발명의 명칭": "대화 이해 AI 시스템에 의하여, 계층적으로 저장되어 있는 북마크에 대한 문맥기반 검색 서비", "출원인": "주식회사 머니브레인", "발명자": "설재호"}}
{"patent_id": "10-2018-0056267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "대화 이해 AI 서비스 서버에 의하여 수행되는, 문맥기반 북마크 검색 서비스를 제공하는 방법으로서,소정의 계층적 구조에 따라, 웹페이지를 상기 웹페이지의 검색 정보와 함께 북마크하여 저장하는 단계 - 상기검색 정보는 사용자 단말로부터 입력받은 상기 웹페이지에 관련된 태그, 상기 웹페이지를 검색하여 북마크로 저장한 경우, 검색할 때 사용자로부터 입력받은 검색어, 상기 웹페이지를 요약한 요약어 중 적어도 하나를 포함함-; 상기 사용자 단말로부터 북마크된 웹페이지를 검색하기 위한 사용자의 입력을 수신하는 단계; 상기 사용자의 입력에 대응하는 엔티티를 결정하고, 상기 사용자 입력 및 상기 엔티티를 검색어로 설정하는 단계; 사용자의 검색어와 북마크된 웹페이지들 간의 유사도를 계산하는 단계; 가장 높은 유사도가 소정의 임계 값을 초과하는지 판정하는 단계; 및 상기 가장 높은 유사도가 제1 임계값을 초과하는 경우, 상기 북마크된 웹페이지들 중 높은 유사도를 가지는 중적어도 하나의 북마크된 웹페이지의 리스트를 표시하는 단계; 를 포함하는 북마크 서비스를 제공하는 방법."}
{"patent_id": "10-2018-0056267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 사용자의 검색어와 북마크된 웹페이지들 간의 유사도를 계산하는 단계는 상기 웹페이지의 검색 정보와 상기 사용자의 검색어와의 유사도를 계산하는 단계; 또는상기 검색어로 북마크된 웹페이지의 리스트에 포함된 웹페이지들을 검색한 결과를 기초로 상기 유사도를 계산하는 단계 중 적어도 하나를 포함하는 북마크 서비스를 제공하는 방법."}
{"patent_id": "10-2018-0056267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 유사도를 계산하는 단계는 상기 검색어를 상용화된 검색 엔진에 검색어로 입력하여 얻은 결과 페이지 중북마크된 웹페이지가 포함되었는지 여부를 기초로 계산하는 단계를 포함하는 북마크 서비스를 제공하는 방법."}
{"patent_id": "10-2018-0056267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 방법은 상기 검색어와 상기 사용자의 웹페이지 방문기록의 리스트들 간의 유사도를 계산하여, 소정의 제2 임계값을 초과하는 유사도를 가지는, 상기 사용자의 웹페이지 방문기록에 포함된 웹페이지의 리스트를 출력하는 단계를 더포함하는 북마크 서비스를 제공하는 방법."}
{"patent_id": "10-2018-0056267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서상기 방법은 검색창을 표시하는 단계를 더 포함하는 북마크 서비스를 제공하는 방법.공개특허 10-2019-0134928-3-청구항 6 하나 이상의 명령어를 수록한 컴퓨터 판독가능 기록 매체로서, 상기 하나 이상의 명령어는, 실행될 경우,컴퓨터 장치로 하여금, 제1항 내지 제5항 중 어느 한 항의 방법을 수행하도록 하는, 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "대화 이해 AI 서비스 서버에 의하여 수행되는, 문맥기반 북마크 검색 서비스를 제공하는 방법이 제공된다. 본 발 명은 소정의 계층적 구조에 따라, 웹페이지를 상기 웹페이지의 검색 정보와 함께 북마크하여 저장하는 단계 - 상 기 검색 정보는 사용자 단말로부터 입력받은 상기 웹페이지에 관련된 태그, 상기 웹페이지를 검색하여 북마크로 (뒷면에 계속)"}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 대화형 AI 에이전트 시스템에 관한 것이며, 보다 구체적으로는 대화 이해 AI 시스템에 의하여, 계층 적으로 저장되어 있는 북마크에 대한 문맥기반 검색 서비스를 제공하는 방법 등에 관한 것이다."}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래, 인공지능 분야, 특히 자연어 이해 분야의 기술 발전에 따라, 전통적인 기계 중심의 명령 입출력 방식에 따른 기계 조작에서 벗어나, 사용자로 하여금, 보다 사람 친화적인 방식, 예컨대 음성 및/또는 텍스트 형태의 자연어를 매개로 한 대화 방식으로 기계를 조작하고 기계로부터 원하는 서비스를 얻을 수 있도록 하는 대화형 AI 에이전트 시스템의 개발 및 활용이 점차 늘어나고 있다. 그에 따라, 온라인 상담 센터나 온라인 쇼핑몰 등 을 비롯한 (그러나 이에 한정되지 않은 더 많은) 다양한 분야에서, 사용자는, 음성 및/또는 텍스트 형태의 자연 어 대화를 제공하는 대화형 AI 에이전트 시스템을 통하여 원하는 서비스를 제공받을 수 있게 되었다. 최근에는, 고정 시나리오 기반의 간단한 문답 형태의 대화 서비스만을 제공하던 종래의 대화형 AI 에이전트 시 스템을 넘어서서, 자유 발화 형태의 음성 입력을 기초로 보다 복잡한 도메인의 서비스를 제공하는 대화형 AI 에 이전트 시스템에 대한 요구가 늘어나고 있으며, 기존에 제공되던 서비스에 대화형 AI 에이전트 시스템을 결합하 여 보다 편리하게 개선된 서비스를 제공하고자 하는 흐름이 있다. 예컨대, 종래의 북마크 서비스의 경우 사용 자가 설정한 고정된 계층적 구조에 따라 웹사이트를 저장하고, 저장된 웹사이트를 찾기 위해서는 사용자가 해당 구조를 따라 순차적으로 선택하여 웹사이트를 찾아가야 하기 때문에 사용자가 기 설정한 구조를 정확히 기억하 지 못하는 경우 북마크된 웹사이트를 검색하는데 어려움이 있었는데, 대화형 AI 에이전트 시스템을 결합하여 보 다 편리하게 개선된 서비스를 제공할 수 있다."}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래의 북마크 서비스의 경우 사용자가 설정한 고정된 계층적 구조에 따라 웹사이트를 저장하고, 저장된 웹사이 트를 찾기 위해서는 사용자가 해당 구조를 따라 순차적으로 선택하여 웹사이트를 찾아가야 하기 때문에 사용자 가 기 설정한 구조를 정확히 기억하지 못하는 경우 북마크된 웹사이트를 검색하는데 어려움이 있다. 따라서, 웹 사이트를 북마크하여 저장하는 동안 생성되는 로그를 이용하여 획득될수 있는 지식을 반영하여 효율적인 북마크 서비스 제공 방법 등이 필요하다."}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 특징에 의하면, 대화 이해 AI 서비스 서버에 의하여 수행되는, 문맥기반 북마크 검색 서비스를 제 공하는 방법이 제공된다. 본 발명은 소정의 계층적 구조에 따라, 웹페이지를 상기 웹페이지의 검색 정보와 함께 북마크하여 저장하는 단계 - 상기 검색 정보는 사용자 단말로부터 입력받은 상기 웹페이지에 관련된 태그, 상기"}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "웹페이지를 검색하여 북마크로 저장한 경우, 검색할 때 사용자로부터 입력받은 검색어, 상기 웹페이지를 요약한"}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "요약어 중 적어도 하나를 포함함 -; 상기 사용자 단말로부터 북마크된 웹페이지를 검색하기 위한 사용자의 입력 을 수신하는 단계; 상기 사용자의 입력에 대응하는 엔티티를 결정하고, 상기 사용자 입력 및 상기 엔티티를 검 색어로 설정하는 단계; 사용자의 검색어와 북마크된 웹페이지들 간의 유사도를 계산하는 단계; 가장 높은 유사 도가 소정의 임계 값을 초과하는지 판정하는 단계; 및 상기 가장 높은 유사도가 제1 임계값을 초과하는 경우, 상기 북마크된 웹페이지들 중 높은 유사도를 가지는 중 적어도 하나의 북마크된 웹페이지의 리스트를 표시하는 단계; 를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 사용자의 검색어와 북마크된 웹페이지들 간의 유사도를 계산하는 단계는 상기 웹페이지의 검색 정보와 상기 사용자의 검색어와의 유사도를 계산하는 단계; 또는 상기 검색어로 북마크된웹페이지의 리스트에 포함된 웹페이지들을 검색한 결과를 기초로 상기 유사도를 계산하는 단계 중 적어도 하나 를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 유사도를 계산하는 단계는 상기 검색어를 상용화된 검색 엔진에 검색어로 입력하여 얻은 결과 페이지 중 북마크된 웹페이지가 포함되었는지 여부를 기초로 계산하는 단계를 포함할 수 있 다. 본 발명의 일 실시예에 따르면, 본 방법은 상기 검색어와 상기 사용자의 웹페이지 방문기록의 리스트들 간의 유 사도를 계산하여, 소정의 제2 임계값을 초과하는 유사도를 가지는, 상기 사용자의 웹페이지 방문기록에 포함된 웹페이지의 리스트를 출력하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 따르면, 본 방법은 검색창을 표시하는 단계를 더 포함할 수 있다. 본 발명의 다른 특징에 의하면, 하나 이상의 명령어를 포함하는 컴퓨터 판독 가능 기록 매체로서, 하나 이상의 명령어는, 컴퓨터에 위해 실행되는 경우, 컴퓨터로 하여금, 전술한 방법들 중 어느 하나의 방법을 수행하게 하 는, 컴퓨터 판독 가능 기록 매체가 제공된다."}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "계층적으로 저장되어 있는 북마크된 웹사이트에 대해, 사용자가 계층적 구조를 기억하지 못하는 경우에도 사용 자의 검색 정보를 기초로 문맥기반의 효율적인 북마크 검색 서비스를 제공할 수 있다. 따라서, 사용자로 하여금 보다 쉽게 북마크된 웹페이지를 찾을 수 있도록 하는 북마크 서비스 방법을 제공하며, 이로써 더욱 효율적인 북마크 관리가 이루어지도록 할 수 있다."}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면을 참조하여 본 발명의 실시예에 관하여 상세히 설명한다. 이하에서는, 본 발명의 요지를 불필 요하게 흐릴 우려가 있다고 판단되는 경우, 이미 공지된 기능 및 구성에 관한 구체적인 설명을 생략한다. 또한, 이하에서 설명하는 내용은 어디까지나 본 발명의 일 실시예에 관한 것일 뿐 본 개시가 이로써 제한되는 것은 아님을 알아야 한다. 본 개시에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용되는 것으로 본 발명을 한정하려는 의도 에서 사용된 것이 아니다. 예를 들면, 단수로 표현된 구성요소는 문맥상 명백하게 단수만을 의미하지 않는다면 복수의 구성요소를 포함하는 개념으로 이해되어야 한다. 본 개시에서 사용되는 \"및/또는\"이라는 용어는, 열거 되는 항목들 중 하나 이상의 항목에 의한 임의의 가능한 모든 조합들을 포괄하는 것임이 이해되어야 한다. 본 개시에서 사용되는 '포함하다' 또는 '가지다' 등의 용어는 본 개시 상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것일 뿐이고, 이러한 용어의 사용에 의해 하나 또 는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성 요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부 가 가능성을 배제하려는 것은 아니다. 본 발명의 실시예에 있어서 '모듈' 또는 '부'는 적어도 하나의 기능이나 동작을 수행하는 기능적 부분을 의미하 며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 또는 '부'는, 특정한 하드웨어로 구현될 필요가 있는 '모듈' 또는 '부'를 제외하고는, 적어도 하나의 소 프트웨어 모듈로 일체화되어 적어도 하나의 프로세서에 의해 구현될 수 있다.본 발명의 실시예에 있어서 '대화형 AI 에이전트 시스템'은, 사용자와의 사이에서 음성 및/또는 텍스트 형태의 자연어를 매개로 한 대화형 인터랙션을 통해, 사용자로부터 입력되는 자연어 입력(예컨대, 자연어로 된 사용자 로부터의 명령, 진술, 요청, 질문 등)을 수신 및 해석하여 사용자의 인텐트(intent)를 알아내고 그 알아낸 사용 자의 인텐트에 기초하여 필요한 동작 수행, 즉 적절한 대화 응답의 제공 및/또는 태스크의 수행을 제공할 수 있 는 임의의 정보 처리 시스템을 지칭할 수 있으며, 특정 형태로 제한되는 것은 아니다. 본 발명의 실시예에 있 어서, 대화형 AI 에이전트 시스템은 소정의 도메인의 서비스를 제공하기 위한 것일 수 있는데, 이때 서비스 도 메인은 복수의 하위 인텐트 그룹들을 포함하여 구성될 수 있다(예컨대, 상품 구매의 서비스 도메인에는, 상품 문의, 브랜드 문의, 디자인 문의, 가격 문의, 반품 문의 등의 하위 인텐트 그룹들이 포함될 수 있음). 본 발명 의 실시예에 있어서, '대화형 AI 에이전트 시스템'에 의해 수행되는 동작은, 예컨대 소정의 서비스 제공을 위한 하위 인텐트 그룹들의 순차적 흐름 안에서 사용자의 인텐트에 따라 각각 이루어지는 대화 응답 및/또는 태스크 수행일 수 있다. 본 발명의 실시예에 있어서, '대화형 AI 에이전트 시스템'에 의해 제공되는 대화 응답은 시각, 청각 및/또는 촉 각 형태(예컨대, 음성, 음향, 텍스트, 비디오, 이미지, 기호, 이모티콘, 하이퍼링크, 애니메이션, 각종 노티스, 모션, 햅틱 피드백 등을 포함할 수 있으며, 이로써 제한되는 것은 아님) 등 다양한 형태로써 제공될 수 있음을 알아야 한다. 본 발명의 실시예에 있어서 '대화형 AI 에이전트 시스템'에 의해 수행되는 태스크는, 예컨대 정 보의 검색, 결재 진행, 메시지 작성, 이메일 작성, 전화 걸기, 음악 재생, 사진 촬영, 사용자 위치 탐색, 지도/ 내비게이션 서비스 등을 비롯한 각종 다양한 형태의 태스크(다만, 예시일 뿐이며 이로써 제한되는 것은 아님)를 포함할 수 있다. 본 발명의 실시예에 있어서 '대화형 AI 에이전트 시스템'은, 메신저 플랫폼에 기초한 챗봇(chatbot) 시스템, 예 컨대 메신저 상에서 사용자와 메시지를 주고받으며 사용자가 원하는 다양한 정보를 제공하거나 태스크를 수행하 는 챗봇 시스템을 포함할 수 있으며, 다만 본 발명이 이로써 제한되는 것은 아님을 알아야 한다. 덧붙여, 달리 정의되지 않는 한 기술적 또는 과학적인 용어를 포함하여, 본 개시에서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진 다. 일반적으로 사용되는 사전에 정의된 용어들은, 관련 기술의 문맥상 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 개시에서 명백하게 달리 정의하지 않는 한 과도하게 제한 또는 확장하여 해석되지 않는다 는 점을 알아야 한다. 이하, 첨부된 도면을 참조하여, 본 발명의 실시예에 대해 구체적으로 설명하기로 한다. 도 1은, 본 발명의 일 실시예에 따라, 대화형 AI 에이전트 시스템이 구현될 수 있는 시스템 환경을 개략적 으로 도시한 도면이다. 도시된 바에 의하면, 시스템 환경은, 복수의 사용자 단말(102a-102n), 통신망 , 대화 이해 AI 서비스 서버, 및 외부 서비스 서버를 포함한다. 본 발명의 일 실시예에 의하면, 복수의 사용자 단말(102a-102n) 각각은 유선 또는 무선 통신 기능을 구비한 임 의의 사용자 전자 장치일 수 있다. 사용자 단말(102a-102n) 각각은, 예컨대 스마트 폰, 태블릿 PC, 뮤직 플레 이어, 스마트 스피커, 데스크탑, 랩탑, PDA, 게임 콘솔, 디지털 TV, 셋탑박스 등을 포함한 다양한 유선 또는 무 선 통신 단말일 수 있으며, 특정 형태로 제한되지 않음을 알아야 한다. 본 발명의 일 실시예에 의하면, 사용자 단말(102a-102n) 각각은, 통신망을 통해서, 대화 이해 AI 서비스 서버와 통신, 즉 필요한 정보를 송 수신할 수 있다. 본 발명의 일 실시예에 의하면, 사용자 단말(102a-102n) 각각은, 통신망을 통해서, 외부 서비스 서버와 통신, 즉 필요한 정보를 송수신할 수 있다. 본 발명의 일 실시예에 의하면, 사용자 단말 (102a-102n) 각각은, 외부로부터 음성 및/또는 텍스트 형태의 사용자 입력을 수신할 수 있고, 통신망을 통 한 대화 이해 AI 서비스 서버 및/또는 외부 서비스 서버와의 통신(및/또는 사용자 단말(102a-102n) 내 처리)을 통해 얻어진, 위 사용자 입력에 대응한 동작 결과(예컨대, 북마크 검색 결과, 특정 대화 응답의 제 공 및/또는 특정 태스크의 수행 등)를 사용자에게 제공할 수 있다. 본 발명의 일 실시예에 의하면, 사용자 단말(102a-102n)에 의해 제공되는 사용자 입력에 대응한 동작 결과로서 의 응답은, 예컨대 소정의 서비스 도메인 내에서, 해당 서비스 제공을 위한 하위 인텐트 그룹들의 순차적 흐름 안에서 당시의 사용자 입력에 대응한 하위 인텐트 그룹의 대화 흐름 패턴에 따라 제공되는 것일 수 있다. 본 발명의 일 실시예에 의하면, 사용자 단말(102a-102n) 각각은, 사용자 입력에 대응한 동작 결과로서의 대화 응답 을, 시각, 청각 및/또는 촉각 형태(예컨대, 음성, 음향, 텍스트, 비디오, 이미지, 기호, 이모티콘, 하이퍼링크, 애니메이션, 각종 노티스, 모션, 햅틱 피드백 등을 포함할 수 있으며, 이로써 제한되는 것은 아님) 등 다양한 형태로써 사용자에게 제공할 수 있다. 본 발명의 실시예에 있어서, 사용자 입력에 대응한 동작으로서의 태스크수행은, 예컨대 정보의 검색, 북마크 검색, 결재 진행, 메시지 작성, 이메일 작성, 전화 걸기, 음악 재생, 사진 촬영, 사용자 위치 탐색, 지도/내비게이션 서비스 등을 비롯한 각종 다양한 형태의 태스크(그러나 이로써 제한 되는 것은 아님) 수행을 포함할 수 있다. 본 발명의 일 실시예에 의하면, 통신망은, 임의의 유선 또는 무선 통신망, 예컨대 TCP/IP 통신망을 포함할 수 있다. 본 발명의 일 실시예에 의하면, 통신망은, 예컨대 Wi-Fi망, LAN망, WAN망, 인터넷망 등을 포함 할 수 있으며, 본 발명이 이로써 제한되는 것은 아니다. 본 발명의 일 실시예에 의하면, 통신망은, 예컨 대 이더넷, GSM, EDGE(Enhanced Data GSM Environment), CDMA, TDMA, OFDM, 블루투스, VoIP, Wi-MAX, Wibro 기타 임의의 다양한 유선 또는 무선 통신 프로토콜을 이용하여 구현될 수 있다. 본 발명의 일 실시예에 의하면, 대화 이해 AI 서비스 서버는, 통신망을 통해 사용자 단말(102a- 102n)과 통신할 수 있다. 본 발명의 일 실시예에 의하면, 대화 이해 AI 서비스 서버는, 통신망을 통 해 사용자 단말(102a-102n)과 필요한 정보를 송수신하고, 이를 통해 사용자 단말(102a-102n) 상에서 수신된 사 용자 입력에 대응한, 즉 엔티티를 분석하고 엔티티에 부합하는 동작 결과가, 사용자에게 제공되도록 동작할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에이전트 서버는, 예컨대 통신망을 통해 사용자 단말 (102a-102n)로부터 음성, 텍스트, 및/또는 터치 형태의 사용자 자연어 입력을 수신하고, 미리 준비된 모델들에 기초해서 그 수신된 자연어 입력을 처리하여 사용자의 인텐트(intent)를 결정할 수 있다. 본 개시의 일 실시예 에 의하면, 대화형 AI 에이전트 서버는, 위 결정된 사용자 인텐트에 기초하여 대응하는 동작이 수행되도록 할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에이전트 서버는, 예컨대 사용자 단말(102a- 102n)이 사용자 인텐트에 부합하는 특정한 태스크를 수행하도록 특정한 제어 신호를 생성하여 해당 사용자 단말 (102a-102n)로 전송할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에이전트 서버는, 예컨대 사용 자 단말(102a-102n)이 사용자 인텐트에 부합하는 특정한 태스크를 수행하게 하기 위하여, 통신망을 통해 외부 서비스 서버에 접속할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에이전트 서버는, 예컨대 소정의 계층적 구조에 딸, 사용자의 북마크된 웹페이지의 검색 정보를 저장하고 사용자의 북마크 검색 요청에 따라, 사용자의 인텐트에 부합하는 북 마크된 웹페이지의 리스트를 제공할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에이전트 서버는, 예컨대 사용자 인텐트에 부합하는 특정한 대 화 응답을 생성하여 사용자 단말(102a-102n)로 전송할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에 이전트 서버는, 위 결정된 사용자 인텐트에 기초하여, 대응하는 대화 응답을 음성 및/또는 텍스트 형태로 써 생성하고, 생성된 응답을, 통신망을 통해, 사용자 단말(102a-102n)로 전달할 수 있다. 본 개시의 일 실시예에 의하면, 대화형 AI 에이전트 서버에 의해 생성되는 대화 응답은, 전술한 음성 및/또는 텍스트 형 태의 자연어 응답과 함께, 이미지, 비디오, 기호, 이모티콘 등 다른 시각적 요소들이나, 음향 등의 다른 청각적 요소들이나, 기타 다른 촉각적 요소들을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 사용자 단말(102a- 102n) 상에서 수신된 사용자 입력의 형태(예컨대, 음성 입력인지 아니면 텍스트 입력인지)에 따라, 대화형 AI 에이전트 서버 상에서 동일한 형태의 응답이 생성될 수 있으며(예컨대, 음성 입력이 주어진 경우에는 음성 응답이 생성되고 텍스트 입력이 주어진 경우에는 텍스트 응답이 생성됨), 다만 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 다른 실시예에 의하면, 사용자 입력의 형태와 무관하게 음성 및/또는 텍스트 형태의 응답이 생성 및 제공될 수 있음을 알아야 한다. 본 발명의 일 실시예에 의하면, 대화 이해 AI 서비스 서버는, 앞서 언급한 바와 같이, 통신망을 통해 서 외부 서비스 서버와 통신할 수 있다. 외부 서비스 서버는, 예컨대 북마크 저장/검색 서비스 서버, 메시징 서비스 서버, 온라인 상담 센터 서버, 온라인 쇼핑몰 서버, 정보 검색 서버, 지도 서비스 서버, 네비게이션 서비스 서버 등일 수 있으며, 본 개시가 이로써 제한되는 것은 아니다. 사용자 단말(102a-102n)로 전달되는, 사용자 인텐트에 기초한 대화 응답은, 예컨대 외부 서비스 서버로부터 검색 및 획득된 데이터 콘텐츠를 포함한 것일 수 있음을 알아야 한다. 본 도면에서는, 대화 이해 AI 서비스 서버가 외부 서비스 서버와 통신망을 통해 통신 가능하게 구성된 별도의 물리 서버인 것으로 도시되어 있으나, 본 개시가 이로써 제한되는 것은 아니다. 본 발명의 다른 실시예에 의하면, 대화 이해 AI 서비스 서버는, 예컨대 북마크 저장/검색 서버, 온라인 상담 센터 서버 또 는 온라인 쇼핑몰 서버 등 각종 서비스 서버의 일부로 포함되어 구성될 수도 있음을 알아야 한다.도 2는, 본 발명의 일 실시예에 따른, 도 1에 도시된 사용자 단말의 기능적 구성을 개략적으로 도시한 기 능 블록도이다. 도시된 바에 의하면, 사용자 단말은, 사용자 입력 수신 모듈, 센서 모듈, 프로 그램 메모리 모듈, 프로세싱 모듈, 통신 모듈, 및 응답 출력 모듈을 포함한다. 본 발명의 일 실시예에 의하면, 사용자 입력 수신 모듈은, 사용자로부터 다양한 형태의 입력, 예컨대 음성 입력 및/또는 텍스트 입력 등의 자연어 입력(및 부가적으로 터치 입력 등의 다른 형태의 입력)을 수신할 수 있 다. 본 발명의 일 실시예에 의하면, 사용자 입력 수신 모듈은, 예컨대 마이크로폰 및 오디오 회로를 포함 하며, 마이크로폰을 통해 사용자 음성 입력 신호를 획득하고 획득된 신호를 오디오 데이터로 변환할 수 있다. 본 발명의 일 실시예에 의하면, 사용자 입력 수신 모듈은, 예컨대 마우스, 조이스틱, 트랙볼 등의 각종 포 인팅 장치, 키보드, 터치패널, 터치스크린, 스타일러스 등 다양한 형태의 입력 장치를 포함할 수 있고, 이들 입 력 장치를 통해 사용자로부터 입력된 텍스트 입력 및/또는 터치 입력 신호를 획득할 수 있다. 본 발명의 일 실 시예에 의하면, 사용자 입력 수신 모듈에서 수신되는 사용자 입력은, 소정의 태스크 수행, 예컨대 소정의 애플리케이션 실행이나 소정 정보의 검색 등과 연관될 수 있으나, 본 발명이 이로써 제한되는 것은 아니다. 본 발명의 일 실시예에 의하면, 센서 모듈은 하나 이상의 서로 다른 유형의 센서를 포함하고, 이들 센서를 통해 사용자 단말의 상태 정보, 예컨대 해당 사용자 단말의 물리적 상태, 소프트웨어 및/또는 하드웨 어 상태, 또는 사용자 단말의 주위 환경 상태에 관한 정보 등을 획득할 수 있다. 본 발명의 일 실시예에 의하면, 센서 모듈은, 예컨대 광 센서를 포함하고, 광 센서를 통해 해당 사용자 단말의 주변 광 상태 를 감지할 수 있다. 본 발명의 일 실시예에 의하면, 센서 모듈은, 예컨대 이동 센서를 포함하고, 이동 센 서를 통해 해당 사용자 단말의 이동 상태 여부를 감지할 수 있다. 본 발명의 일 실시예에 의하면, 센서 모듈은, 예컨대 속도 센서 및 GPS 센서를 포함하고, 이들 센서를 통해 해당 사용자 단말의 위치 및/ 또는 배향 상태를 감지할 수 있다. 본 발명의 다른 실시예에 의하면, 센서 모듈은 온도 센서, 이미지 센 서, 압력 센서, 접촉 센서 등을 비롯한 다른 다양한 형태의 센서를 포함할 수 있음을 알아야 한다. 본 발명의 일 실시예에 의하면, 프로그램 메모리 모듈은, 사용자 단말 상에서 실행될 수 있는 각종 프로그램, 예컨대 각종 애플리케이션 프로그램 및 관련 데이터 등이 저장된 임의의 저장 매체일 수 있다. 본 발명의 일 실시예에 의하면, 프로그램 메모리 모듈에는, 예컨대 전화 걸기 애플리케이션, 이메일 애플리케 이션, 인스턴트 메시징 애플리케이션, 카메라 애플리케이션, 음악 재생 애플리케이션, 비디오 재생 애플리케이 션, 이미지 관리 애플리케이션, 지도 애플리케이션, 브라우저 애플리케이션 등을 비롯한 다양한 애플리케이션 프로그램들과 이들 프로그램의 실행과 관련된 데이터들이 저장될 수 있다. 본 발명의 일 실시예에 의하면, 프 로그램 메모리 모듈은, DRAM, SRAM, DDR RAM, ROM, 자기 디스크, 광 디스크, 플래시 메모리 등 다양한 형 태의 휘발성 또는 비휘발성 메모리를 포함하도록 구성될 수 있다. 본 발명의 일 실시예에 의하면, 프로세싱 모듈은, 사용자 단말의 각 컴포넌트 모듈과 통신하고 사용 자 단말 상에서 각종 연산을 수행할 수 있다. 본 발명의 일 실시예에 의하면, 프로세싱 모듈은, 프 로그램 메모리 모듈 상의 각종 애플리케이션 프로그램을 구동 및 실행시킬 수 있다. 본 발명의 일 실시예 에 의하면, 프로세싱 모듈은, 필요한 경우, 사용자 입력 수신 모듈 및 센서 모듈에서 획득된 신 호를 수신하고, 이들 신호에 관한 적절한 처리를 수행할 수 있다. 본 발명의 일 실시예에 의하면, 프로세싱 모 듈은, 필요한 경우, 통신 모듈을 통해 외부로부터 수신되는 신호에 대해 적절한 처리를 수행할 수 있 다. 본 발명의 일 실시예에 의하면, 통신 모듈은, 사용자 단말이 도 1의 통신망을 통하여, 대화 이 해 AI 서비스 서버 및/또는 외부 서비스 서버와 통신할 수 있게 한다. 본 발명의 일 실시예에 의하 면, 통신 모듈은, 예컨대 사용자 입력 수신 모듈 및 센서 모듈 상에서 획득된 신호가 소정의 프 로토콜에 따라 통신망을 통하여 대화 이해 AI 서비스 서버 및/또는 외부 서비스 서버로 전송되 도록 할 수 있다. 본 발명의 일 실시예에 의하면, 통신 모듈은, 예컨대 통신망을 통하여 대화 이해 AI 서비스 서버 및/또는 외부 서비스 서버로부터 수신된 각종 신호, 예컨대 음성 및/또는 텍스트 형 태의 자연어 응답을 포함한 응답 신호 또는 각종 제어 신호 등을 수신하고, 소정의 프로토콜에 따라 적절한 처 리를 수행할 수 있다. 본 발명의 일 실시예에 의하면, 응답 출력 모듈은, 사용자 입력에 대응하는 응답을 시각, 청각 및/또는 촉 각 등 다양한 형태로써 출력할 수 있다. 본 발명의 일 실시예에 의하면, 응답 출력 모듈은, 예컨대 LCD, LED, OLED, QLED 등의 기술에 기초한 터치 스크린 등의 각종 디스플레이 장치를 포함하고, 이들 디스플레이 장 치를 통해 사용자 입력에 대응하는 시각적 응답, 예컨대 텍스트, 기호, 비디오, 이미지, 하이퍼링크, 애니메이션, 각종 노티스 등을 사용자에게 제시할 수 있다. 본 발명의 일 실시예에 의하면, 응답 출력 모듈은, 예 컨대 스피커 또는 헤드셋을 포함하고, 사용자 입력에 대응하는 청각적 응답, 예컨대 음성 및/또는 음향 응답을 스피커 또는 헤드셋을 통해 사용자에게 제공할 수 있다. 본 발명의 일 실시예에 의하면, 응답 출력 모듈 는 모션/햅틱 피드백 생성부를 포함하고, 이를 통해 촉각적 응답, 예컨대 모션/햅틱 피드백을 사용자에게 제공 할 수 있다. 본 발명의 일 실시예에 의하면, 응답 출력 모듈은, 사용자 입력에 대응하는 텍스트 응답, 음 성 응답 및 모션/햅틱 피드백 중 임의의 두 개이상의 조합을 동시에 제공할 수 있음을 알아야 한다. 도 3은, 본 개시의 일 실시예에 따른, 도 1의 대화 이해 AI 서비스 서버의 기능적 구성을 개략적으로 도시 한 기능 블록도이다. 도시된 바에 의하면, 대화 이해 AI 서비스 서버는, 통신 모듈, 음성-텍스트 변 환(Speech-To-Text; STT) 모듈, 자연어 이해(Natural Language Understanding; NLU) 모듈, 북마크 지식베이스, 사용자 데이터베이스, 북마크 관리 모듈, 대화 생성 모듈, 및 음성 합성 (Text-To-Speech; TTS) 모듈을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 통신 모듈은, 소정의 유선 또는 무선 통신 프로토콜에 따라, 통신망 을 통하여, 대화 이해 AI 서비스 서버가 사용자 단말 및/또는 외부 서비스 서버와 통신할 수 있 게 한다. 본 개시의 일 실시예에 의하면, 통신 모듈은, 통신망을 통해, 사용자 단말로부터 전 송되어 온, 사용자 입력(예컨대 터치 입력, 음성 입력 및/또는 텍스트 입력 등을 포함하며, 이로써 제한되지 않 음)을 수신할 수 있다. 본 개시의 일 실시예에 의하면, 사용자 입력은 특정한 태스크 실행 또는 대화 응답의 요청 신호일 수 있다. 본 개시의 일 실시예에 의하면, 통신 모듈은, 전술한 사용자 입력과 함께 또는 그와 별도로, 통신망 을 통해, 사용자 단말로부터 전송되어 온, 사용자 단말의 상태 정보를 수신할 수 있다. 본 개시의 일 실시예에 의하면, 상태 정보는, 예컨대 전술한 사용자 입력 당시의 해당 사용자 단말에 관련된 여러 가 지 상태 정보(예컨대, 사용자 단말의 물리적 상태, 사용자 단말의 소프트웨어 및/또는 하드웨어 상태, 사용자 단말 주위의 환경 상태 정보 등)일 수 있다. 본 개시의 일 실시예에 의하면, 통신 모듈 은, 또한, 위 수신된 사용자 입력에 대응하여 대화 이해 AI 서비스 서버에서 생성된 대화 응답(예컨 대, 음성 및/또는 텍스트 형태의 자연어 대화 응답 등) 및/또는 제어 신호를, 통신망을 통해, 사용자 단말 로 전달하기 위해 필요한 적절한 조치를 수행할 수 있다. 본 개시의 일 실시예에 의하면, STT 모듈은, 통신 모듈을 통해 수신된 사용자 입력 중 음성 입력을 수신하고, 수신된 음성 입력을 패턴 매칭 등에 기초하여 텍스트 데이터로 변환할 수 있다. 본 개시의 일 실시 예에 의하면, STT 모듈은, 사용자의 음성 입력으로부터 특징을 추출하여 특징 벡터열을 생성할 수 있다. 본 개시의 일 실시예에 의하면, STT 모듈은, DTW(Dynamic Time Warping) 방식이나 HMM 모델(Hidden Markov Model), GMM 모델(Gaussian-Mixture Mode), 딥 신경망 모델, n-gram 모델 등의 다양한 통계적 모델에 기초하여, 텍스트 인식 결과, 예컨대 단어들의 시퀀스를 생성할 수 있다. 본 개시의 일 실시예에 의하면, STT 모듈은, 수신된 음성 입력을 패턴 매칭에 기초하여 텍스트 데이터로 변환할 때, 후술하는 사용자 데이터베 이스의 각 사용자 특징적 데이터를 참조할 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈은, 통신 모듈 또는 STT 모듈로부터 텍스트 입력을 수 신할 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈에서 수신되는 텍스트 입력은, 예컨대 통신 모듈 에서 통신망을 통하여 사용자 단말로부터 수신되었던 텍스트 입력(예컨대 사용자의 입력 또는 웹페이지의 텍스트 입력) 또는 통신 모듈에서 수신된 음성 입력으로부터 STT 모듈에서 생성된 텍스트 인식 결과, 예컨대 단어들의 시퀀스일 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈은, 텍스트 입력 을 수신하는 것과 함께 또는 그 이후에, 해당 사용자 입력과 연관된 상태 정보, 예컨대 해당 사용자 입력 당시 의 사용자 단말의 상태 정보 등을 수신할 수 있다. 전술한 바와 같이, 상태 정보는, 예컨대 사용자 단말 에서 사용자 음성 입력 및/또는 텍스트 입력 당시의 해당 사용자 단말에 관련된 여러 가지 상태 정보 (예컨대, 사용자 단말의 물리적 상태, 소프트웨어 및/또는 하드웨어 상태, 사용자 단말 주위의 환경 상태 정보 등)일 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈은, 후술하는 북마크 지식베이스에 기초하여, 위 수신된 입 력을 하나 이상의 엔티티(entity)에 대응시킬 수 있다. 여기서 엔티티 정보란, 예컨대 사용자의 자연어 입력 중에 포함될 수 있는 변수로서 날짜, 이름, 시간, 전화 번호, 주소, 주제 등과 같은 특정 속성 및 형식을 갖는 파라미터 정보 등일 수 있다. 본 개시의 일 실시예에 의하면, 북마크 지식베이스는, 예컨대 미리 정의된 온톨로지 모델을 포함할 수 있 다. 본 개시의 일 실시예에 의하면, 온톨로지 모델은, 예컨대 노드들 간의 계층 구조로 표현될 수 있는데, 각 노드는 엔티티에 대응한 \"엔티티\" 노드 또는 \"엔티티\" 노드에 링크된 하위 \"속성\" 노드(\"엔티티\" 노드에 직접 링크되거나 \"엔티티\" 노드의 \"속성\" 노드에 다시 링크된 하위 \"속성\" 노드) 중 하나일 수 있다. 본 개시의 일 실시예에 의하면, \"엔티티\" 노드와 그 \"엔티티\" 노드에 직접 또는 간접 링크된 \"속성\" 노드들은 하나의 도메인 을 구성할 수 있고, 온톨로지는 이러한 도메인들의 집합으로 구성될 수 있다. 본 개시의 일 실시예에 의하면, 북마크 지식베이스는, 예컨대 대화 이해 AI 에이전트 시스템이 이해하고 그에 대응한 동작을 수행할 수 있 는 모든 엔티티들에 각각 대응하는 도메인들을 포함하도록 구성될 수 있다. 본 개시의 일 실시예에 의하면, 온 톨로지 모델은, 노드의 추가나 삭제, 또는 노드 간의 관계의 수정 등에 의해 동적으로 변경될 수 있음을 알아야 한다. 본 개시의 일 실시예에 의하면, 온톨로지 모델 내의 각 도메인의 엔티티 노드 및 속성 노드들은, 그에 대응하는 엔티티 또는 속성들에 관련된 단어들 및/또는 구절들과 각각 연관될 수 있다. 본 개시의 일 실시예에 의하면, 북마크 지식베이스은, 온톨로지 모델을, 계층 구조의 노드들과, 각 노드 별로 연관된 단어들 및/또는 구절 들의 집합으로 구성된, 예컨대 어휘 사전 형태(구체적으로 도시되지 않음)로 구현할 수 있고, NLU 모듈은 이와 같이 어휘 사전 형태로 구현된 온톨로지 모델에 기초하여 엔티티를 결정할 수 있다. 예컨대, 본 개시의 일 실시예에 의하면, NLU 모듈은, 텍스트 입력 또는 단어들의 시퀀스를 수신하면, 그 시퀀스 내의 각 단어 들이 온톨로지 모델 내의 어떤 도메인의 어떤 노드들에 연관되는지 결정할 수 있고, 그러한 결정에 기초하여 대 응하는 엔티티를 결정할 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈은, 북마크 지식베이스 상의 어휘 사전 형태의 온톨로지 모 델로부터 적절한 엔티티를 결정하고, 그로부터 실패케이스가 발생하는 경우, 소정의 규칙에 따라, 그 입력에 존 재하는 복수의 검색어들을 분석하고 그에 기초하여 적절한 엔티티를 결정할 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈은, 수신된 입력 중에 존재하는 복수의 엔티티들의 관계를 분석한 결과와 함께 해당 입력 중에 존재하는 소정의 의미를 갖는 단어를 조합함으로써 엔티티를 결정할 수 있다. 본 개시의 일 실시예에 의하면, 예컨대 쇼핑과 관련한 경우, 수신된 입력 중에, 크기, 색깔, 성능, 가격 등 품질을 나타내는 단어로서 같은 유형이되 다른 값을 갖는 엔티티 정보가 복수 회 나타나는 경우, 그러한 입력은 쇼핑 엔티티에 대응하도록 규칙을 정할 수 있다. 본 개시의 일 실시예에 의하면, 사용자 데이터베이스는, 각 사용자별 인증 정보를 포함한 각 사용자별 특 징적 데이터를 저장 및 관리하는 데이터베이스일 수 있다. 본 개시의 일 실시예에 의하면, 사용자 데이터베이 스에 포함되는 각 사용자별 특징적 데이터는, 예컨대 각 사용자별로 해당 사용자의 이전 대화/거동 기록, 사용자의 발음 특징 정보, 사용자 어휘 선호도, 사용자의 소재지, 설정 언어, 연락처/친구 목록, 기타 다양한 사용자 특징적 정보를 포함할 수 있다. 본 개시의 일 실시예에 의하면, 전술한 바와 같이, STT 모듈은, 음성 입력을 텍스트 데이터로 변환할 때 사용자 데이터베이스의 각 사용자 특징적 데이터, 예컨대 각 사용자별 발음 특징을 참조함으로써, 보다 정 확한 텍스트 데이터를 얻을 수 있다. 본 개시의 일 실시예에 의하면, NLU 모듈은, 엔티티를 결정할 때 사 용자 데이터베이스의 각 사용자 특징적 데이터, 예컨대 각 사용자별 특징이나 맥락을 참조함으로써, 보다 정확한 엔티티를 결정을 할 수 있다. 본 개시의 일 실시예에 의하면, 후술하는 바와 같이, 대화 생성 모듈 은, 대화 응답의 생성시, 사용자 데이터베이스의 사용자 특징적 데이터를 참조할 수 있다. 본 도면에서는, 각 사용자별 특징적 데이터를 저장 및 관리하는 사용자 데이터베이스가 대화 이해 AI 서비 스 서버에 배치되는 것으로 도시되어 있으나, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 다른 실시예에 의하면, 각 사용자별 특징적 데이터를 저장 및 관리하는 사용자 데이터베이스는, 예컨대 사용자 단말에 존재할 수도 있고, 사용자 단말 및 대화 이해 AI 서비스 서버에 분산되어 배치될 수도 있음을 알아야 한다. 본 개시의 일 실시예에 의하면, 북마크 관리 모듈은, 해당 웹페이지를 검색 정보와 함께 북마크로 저장하 고 관리할 수 있다. 본 개시의 일 실시예에 의하면, 북마크 관리 모듈은, 예컨대 NLU 모듈로부터 수"}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "신된 엔티티, 검색할 때 사용자로부터 입력받은 검색어, 상기 웹페이지를 요약한 요약어를 포함하여 검색 정보 를 생성할 수 있다. 본 개시의 일 실시예에 의하면, TTS 모듈은, 대화 생성 모듈에 의해 사용자 단말로 전송되도록 생성된 응답을 수신할 수 있다. TTS 모듈에서 수신되는 대화 응답은 텍스트 형태를 갖는 자연어 또는 단어들의 시퀀스일 수 있다. 본 개시의 일 실시예에 의하면, TTS 모듈은, 다양한 형태의 알고리즘에 따라, 위 수신된 텍스트 형태의 입력을 음성 형태로 변환할 수 있다. 도 1 내지 3을 참조하여 전술한 본 개시의 실시예에서는, 대화형 AI 에이전트 시스템이 사용자 단말과 대 화 이해 AI 서비스 서버 간의 클라이언트-서버 모델, 특히 클라이언트는 오로지 사용자 입출력 기능만을 제공하고 그 외 대화형 AI 에이전트 시스템의 다른 모든 기능들을 서버에 위임된, 소위 \"씬 클라이언트-서버 모 델\"에 기초하여 구현된 것과 같이 설명되어 있으나, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 다른 실시예에 의하면, 대화형 AI 에이전트 시스템은 그 기능들이 사용자 단말과 서버 사이에 분배되어 구현될 수 있 고, 또는 그와 달리 사용자 단말 상에 설치된 독립형 애플리케이션으로 구현될 수도 있음을 알아야 한다. 또한, 본 개시의 일 실시예에 따라 대화형 AI 에이전트 시스템이 그 기능들을 사용자 단말과 서버 사이에 분배 하여 구현하는 경우, 클라이언트와 서버 사이의 대화형 AI 에이전트 시스템의 각 기능의 분배는 실시예마다 달 리 구현될 수 있음을 알아야 한다. 또한, 도 1 내지 3을 참조하여 전술한 본 개시의 실시예에서는, 편의상 특정 모듈이 소정의 동작들을 수행하는 것처럼 설명되었으나, 본 개시가 이로써 제한되는 것은 아니다. 본 개시의 다른 실시예에 의하면, 위 설명에서 어느 특정 모듈에 의해 수행되는 것과 같이 설명된 동작들이, 그와 다른 별개의 모듈에 의해 각각 수행될 수 있 음을 알아야 한다. 도 4는, 본 발명의 일 실시예에 따른, 도 3의 대화 이해 AI 서비스 서버에 의해 수행되는 문맥기반 북마크 검색 방법의 예시적 동작 흐름도이다. 단계에서, 대화 이해 AI 서비스 서버는, 소정의 계층적 구조에 따라, 웹페이지를 상기 웹페이지의 검 색 정보와 함께 북마크로 저장할 수 있다. 여기서 검색 정보는 사용자 단말로부터 입력받은 상기 웹페이지에 관련된 태그, 상기 웹페이지를 검색하여 북마크로 저장한 경우, 검색할 때 사용자로부터 입력받은 검색어, 상기"}
{"patent_id": "10-2018-0056267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "웹페이지를 요약한 요약어 중 적어도 하나를 포함할 수 있다. 선택적으로, 대화 이해 AI 서비스 서버는 검색 정보 각각에 대해서 관련 엔티티(entity)를 결정하고, 엔티 티를 해당 웹페이지와 함께 저장할 수 있다. 본 발명의 일 실시예에서, 대화 이해 AI 서비스 서버는, 북마 크 지식베이스를 기초로 대응하는 엔티티를 결정할 수 있다. 본 발명의 일 실시예에 의하면, 소정의 웹페 이지와 관련하여 임의의 다양한 방식으로 수집된 검색 정보에 대해, 소정의 기준에 따라, 검색 정보의 각각의 키워드를 미리 정해진 엔티티 그룹들 중 하나로 분류 및 태깅할 수 있다. 본 발명의 일 실시예에 의하면, 엔티 티는, 예컨대 사용자 또는 소정의 시스템에 의해 생성 및 제공된 것일 수 있다. 본 발명의 일 실시예에 의하면, 미리 정해진 엔티티 그룹들은, 예컨대 주어진 도메인에 속한 각각의 하위 엔티티 그룹들일 수 있다. 본 발명의 일 실시예에 의하면, 대화 이해 AI 서비스 서버는, 예컨대 여행 도메인에 속한 비행기 관련, 숙 소 관련, 나라 별 자료, 맛집 자료의 하위 엔티티 그룹들 중 어느 하나로 각각의 검색 정보를 분류 및 태깅할 수 있다. 본 발명의 일 실시예에 의하면, 대화 이해 AI 서비스 서버는, 수집된, 각각의 엔티티 그룹별로 관련된 키워드들을 미리 선정하고 그 선정된 키워드들에 기초하여 검색 정보를 특정 엔티티 그룹으로 분류할 수 있다. 예컨대, 특정 웹페이지에 대한 사용자의 태그 입력이 \"#서초동 #일식집 #추천 #회\"이고, 웹페이지를 북마크로 설정한 경우, 대화 이해 AI 서비스 서버는 북마크 지식베이스를 기초로 해당 웹페이지에 대한 엔티티 로 “주소”, “맛집”, “메뉴”, “추천” 등을 결정할 수 있고, 해당 웹페이지에 대한 검색 정보는 \"#서초동 #일식집 #추천 #회\" 및 “서초동, 일식, 추천, 주소, 맛집, 메뉴” 등을 포함할 수 있다. 본 발명의 일 실시예에 의하면, 대화 이해 AI 서비스 서버는, 사용자의 웹페이지 방문기록의 리스트들 또 한 해당 웹페이지와 함께 북마크로 저장할 수 있다. 본 발명의 일 실시예에서, 소정의 계층적 구조는 사용자 또는 소정의 시스템에 의해 생성 및 제공된 것일 수 있 다. 예컨대, 사용자는 직접 북마크의 계층적 구조를 설정할 수 있으며, 일부 웹브라우저 프로그램의 경우 기본 적인 북마크 계층적 구조가 기 설정되어 있다. 단계에서, 대화 이해 AI 서비스 서버는 북마크된 웹페이지를 검색하기 위한 사용자의 입력을 수신하 고, 사용자의 입력에 대응하는 엔티티를 결정할 수 있다. 단계에서, 대화 이해 AI 서비스 서버는 사용자의 입력 및 사용자 입력에 대응하는 엔티티를 사용자의 검색어로 설정할 수 있다. 단계에서, 대화 이해 AI 서비스 서버는, 사용자의 검색어와 북마크된 웹페이지들 간의 유사도를 계산 할 수 있다. 본 발명의 일 실시예에 따르면, 유사도에 대한 계산은 사용자의 검색어와 해당 웹페이지의 검색 정보를 이용하 여 계산할 수 있으나 이에 한정되는 것은 아니다. 본 발명의 다른 실시예에 따르면, 유사도에 대한 계산은 해당 검색어를 상용화된 검색 페이지에 검색어로 입력하여 얻은 결과 페이지 중 북마크된 웹페이지가 포함되었는지를 기초로 계산할 수 있다. 단계에서, 대화 이해 AI 서비스 서버는 소정의 제1 임계값을 초과하는 유사도를 가지는 북마크된 웹 페이지의 리스트를 출력할 수 있다. 본 발명의 다른 실시예에 따르면, 대화 이해 AI 서비스 서버는 사용자 의 검색어와 사용자의 웹페이지 방문기록의 리스트들 간의 유사도를 계산하여, 소정의 제2 임계값을 초과하는 유사도를 가지는, 사용자의 웹페이지 방문기록에 포함된 웹페이지의 리스트를 출력할 수 있다. 단계에서, 선택적으로, 대화 이해 AI 서비스 서버는 검색창을 표시할 수 있다. 본 발명의 일 실시예 에서, 검색결과 북마크된 웹페이지 또는 사용자의 방문기록에 포함된 웹페이지가 임계값을 만족하지 못하는 경 우, 대화 이해 AI 서비스 서버는 사용자로 하여금 새로운 검색 결과를 볼 수 있도록 사용자 단말로 검색창 을 표시하는 데이터를 전송할 수 있다. 당업자라면 알 수 있듯이, 본 발명이 본 명세서에 기술된 예시에 한정되는 것이 아니라 본 발명의 범주를 벗어 나지 않는 범위 내에서 다양하게 변형, 재구성 및 대체될 수 있다. 본 명세서에 기술된 다양한 기술들은 하드 웨어 또는 소프트웨어, 또는 하드웨어와 소프트웨어의 조합에 의해 구현될 수 있음을 알아야 한다. 본 발명의 일 실시예에 따른 컴퓨터 프로그램은, 컴퓨터 프로세서 등에 의해 판독 가능한 저장 매체, 예컨대 EPROM, EEPROM, 플래시 메모리장치와 같은 비휘발성 메모리, 내장형 하드 디스크와 착탈식 디스크 같은 자기 디 스크, 광자기 디스크, 및 CDROM 디스크 등을 포함한 다양한 유형의 저장 매체에 저장된 형태로 구현될 수 있다. 또한, 프로그램 코드(들)는 어셈블리어나 기계어로 구현될 수 있다. 본 발명의 진정한 사상 및 범주에 속하는 모든 변형 및 변경을 이하의 특허청구범위에 의해 모두 포괄하고자 한다."}
{"patent_id": "10-2018-0056267", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 본 발명의 일 실시예에 따라, 대화형 AI 에이전트 시스템이 구현될 수 있는 시스템 환경을 개략적으로 도시한 도면이다. 도 2는, 본 발명의 일 실시예에 따른, 도 1의 사용자 단말의 기능적 구성을 개략적으로 도시한 기능 블록 도이다. 도 3은, 본 발명의 일 실시예에 따른, 도 1의 대화 이해 AI 서비스 서버의 기능적 구성을 개략적으로 도시 한 기능 블록도이다. 도 4는, 본 발명의 일 실시예에 따라, 도 3의 대화 이해 AI 서비스 서버에 의해 수행되는 문맥기반 북마크 검색 방법의 예시적 동작 흐름도이다."}
