{"patent_id": "10-2021-0106338", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0024164", "출원번호": "10-2021-0106338", "발명의 명칭": "주행관제 시스템 및 자율주행 모형차", "출원인": "주식회사 자이트론", "발명자": "허성민"}}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자율주행 모형차를 이용하여 현실 주행환경과 비슷한 모형 환경에서 주행 시나리오에 따라 상기 주행 시나리오의 시험을 수행하는 주행관제 시스템으로, 상기 자율주행 모형차와 통신하는 통신 모듈; 상기 자율주행 모형차에 부착된 복수의 센서들로부터 획득한 자율주행 모형차의 센싱 정보를 포함하는 차량 정보 및 자율주행 시험이 수행되는 도로상황 정보를 수집 및 처리하는 센싱데이터 관리자; 상기 차량 정보와 상기 도로상황 정보를 이용하여 상기 주행 시나리오를 편집하고, 상기 편집된 주행 시나리오에 따라 상기 자율주행 모형차를 제어하는 차량제어 정보를 상기 통신 모듈을 통해 상기 자율주행 모형차에 제공하고 상기 자율주행의 시험 결과를 분석하는 실증테스트 관리자; 및 상기 자율주행 모형차로부터 수신된 차량 정보 및 도로상황 정보를 시각화하는 관제스크린 관리자를 포함하는,주행관제 시스템."}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 자율주행 모형차는 적어도 한대의 주인공 차량과 상기 주인공 차량을 둘러싸고 동시에 주행하는 둘 이상의엑스트라 차량들을 포함하고, 상기 주행 시나리오는 상기 자율주행 모형차들이 시나리오에 따라 계획대로 주행하도록 상기 주인공 차량과 주변의 엑스트라 차량들의 움직임을 사전에 정의하는, 주행관제 시스템."}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 실증테스트 관리자는, 상기 엑스트라 차량들의 주행을 제어하고, 이에 따른 상기 주인공 차량의 움직임을모니터링하므로 상기 주행 시나리오에 따른 자율주행의 시험 결과를 분석하는, 주행관제 시스템."}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 신규 자율주행 아이디어를 삽입 관리하고, 상기 자율주행 모형차에 탑재된 하나 이상의 제1소프트웨어 조각과자체 탑재된 하나 이상의 제2소프트웨어 조각이 상기 자율주행 모형차의 구동에 필요한 단일 인공지능 소프트웨어로 동작하도록 분산환경의 동적 관리를 수행하는 분산환경 관리자를 추가로 포함하는 주행관제 시스템."}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 분산환경 관리자는, 상기 단일 인공지능 소프트웨어에 신규 제3소프트웨어 조각을 추가하거나, 상기 제1소트웨어 조각이나 상기 제2소프트웨어 조각 중 하나를 대체하여 상기 인공지능 소프트웨어를 동작시키는 주행관제 시스템."}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 분산환경 관리자는, 상기 신규 자율주행 아이디어를 삽입 관리하는 신규 아이디어 삽입 관리 모듈과, 상기분산환경의 동적 관리를 수행하는 분산환경 동적관리 모듈을 포함하는, 주행관제 시스템.공개특허 10-2023-0024164-3-청구항 7 자율주행도 가능하나, 현실 주행환경과 비슷한 모형 환경에서 주행 시나리오의 시험을 수행하는 주행관제 시스템의 제어에 따라 상기 주행 시나리오를 수행하는 자율주행 모형차로, 상기 주행관제 시스템과 통신하고, 복수의 센서들로부터 획득한 센싱 정보를 포함하는 차량 정보를 상기 주행관제 시스템에 전송하고, 상기 차량 정보와 자율주행 시험이 수행되는 도로상황 정보를 이용하여 상기 주행 시나리오에 따라 상기 자율주행 모형차를 제어하는 차량제어 정보를 상기 주행관제 시스템으로부터 수신하는 통신모듈; 상기 주행관제 시스템의 제어 기반 주행을 관리하고, 시나리오 기반 주행을 관리하고, 주변 상황 및 차량 상태를 모니터링하여 상기 자율주행의 시험 결과를 분석하는 실증테스트 관리자; 및 신규 자율주행 아이디어를 삽입 관리하고, 상기 자체 탑재된 하나 이상의 제1소프트웨어 조각과 상기 주행관제시스템에 탑재된 하나 이상의 제2소프트웨어 조각이 상기 자율주행 모형차의 구동에 필요한 단일 인공지능 소프트웨어로 동작하도록 분산환경의 동적 관리를 수행하는 분산환경 관리자를 포함하는, 자율주행 모형차."}
{"patent_id": "10-2021-0106338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 인공지능 소프트웨어는, 상기 단일 인공지능 소프트웨어에 신규 제3소프트웨어 조각을 추가하거나, 상기제1소트웨어 조각이나 상기 제2소프트웨어 조각 중 하나를 대체하여 동작시키는 자율주행 모형차."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시예들은 자율주행 기술의 개발과 검증을 위한 주행관제 시스템 및 자율주행 모형차에 관한 것이다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예들은 자율주행 기술의 개발과 검증을 위한 주행관제 시스템 및 자율주행 모형차에 관한 것이다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행 모드에서 운행하는 자율주행차는 탑승자, 특히 운전자의 운전 관련 일부 부담을 덜어줄 수 있다. 자율주행차는 i)흰색 대형 트레일러를 하늘로 인식해 바퀴 사이로 파고들어 사고를 일으키거나, ii)오전 역광 이 내리쬐는 상황에서 도로 중앙분리대를 인식하지 못하여 사고를 일으키거나, iii)하늘에 뜬 달과 신호등을 구 분하지 못하여 도로 위에 떠있는 달을 황색 신호등으로 인식하여 서행 운전을 계속하거나, iv)버거킹 간판을 적 색 신호등으로 보고 정지하거나, v)어두운 밤에 자전거를 들이받는 사례 등 다양한 오류들을 야기하고 있다. 이러한 오류들을 해결하고 완전 자율주행을 완성하기 위해, 자율주행차의 자율주행 기술 또는 아이디어를 개발 하고 검증하고 있다. 특히, 자율주행 기술을 적용한 다양한 소프트웨어들을 개발하고 이들을 검증하고 있다. 이러한 개발된 소프트웨어들을 검증하기 위해 실제 차량에 실증 테스트를 진행할 경우 많은 비용이 들고 사고에 따른 위험도 높은 문제점이 있다. 한편, 자율주행 시뮬레이터를 이용하여 개발된 소프트웨어들을 검증할 수도 있으나, 실제 차량과 달라 검증의 유효성에 문제점이 있다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "앞에서 설명한 문제점을 해결하기 위한 것으로, 본 발명의 실시예들은 자율주행차의 자율주행 기술 또는 아이디 어를 개발하고 검증하는 주행관제 시스템 및 자율주행 모형차를 제공한다. 또한 본 발명의 실시예들은 적은 비용과 낮은 사고 위험, 높은 검증 유효성으로 자율주행 기술을 적용한 다양한 소프트웨어들을 검증하는 주행관제 시스템 및 자율주행 모형차를 제공한다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 주행관제 시스템은 자율주행 모형차를 이용하여 현실 주행환경과 비슷한 모형 환경에서 주행 시나리오에 따라 주행 시나리오의 시험을 수행하는 주행관제 시스템으로, 자율주행 모형차와 통신하는 통신 모 듈, 자율주행 모형차에 부착된 복수의 센서들로부터 획득한 자율주행 모형차의 센싱 정보를 포함하는 차량 정보 및 자율주행 시험이 수행되는 도로상황 정보를 수집 및 처리하는 센싱데이터 관리자, 차량 정보와 도로상황 정 보를 이용하여 주행 시나리오를 편집하고 편집된 주행 시나리오에 따라 자율주행 모형차를 제어하는 차량제어 정보를 통신 모듈을 통해 자율주행 모형차에 제공하고 자율주행의 시험 결과를 분석하는 실증테스트 관리자, 및 자율주행 모형차로부터 수신된 차량 정보 및 도로상황 정보를 시각화하는 관제스크린 관리자를 포함한다. 다른 실시예에 따른 자율주행 모형차는 자율주행도 가능하나, 현실 주행환경과 비슷한 모형 환경에서 주행 시나 리오의 시험을 수행하는 주행관제 시스템의 제어에 따라 주행 시나리오를 수행하는 자율주행 모형차로, 주행관 제 시스템과 통신하고 복수의 센서들로부터 획득한 센싱 정보를 포함하는 차량 정보를 주행관제 시스템에 전송 하고 차량 정보와 자율주행 시험이 수행되는 도로상황 정보를 이용하여 주행 시나리오에 따라 자율주행 모형차 를 제어하는 차량제어 정보를 주행관제 시스템으로부터 수신하는 통신 모듈, 주행관제 시스템의 제어 기반 주행 을 관리하고, 시나리오 기반 주행을 관리하고, 주변 상황 및 차량 상태를 모니터링하여 자율주행의 시험 결과를 분석하는 실증테스트 관리자, 및 신규 자율주행 아이디어를 삽입 관리하고 자체 탑재된 하나 이상의 제1소프트 웨어 조각과 주행관제 시스템에 탑재된 하나 이상의 제2소프트웨어 조각이 자율주행 모형차의 구동에 필요한 단 일 인공지능 소프트웨어로 동작하도록 분산환경의 동적 관리를 수행하는 분산환경 관리자를 포함한다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따른 주행관제 시스템 및 자율주행 모형차는 자율주행차의 자율주행 기술 또는 아이디어 를 개발하고 검증할 수 있다. 또한 본 발명의 실시예들에 따른 주행관제 시스템 및 자율주행 모형차는 적은 비용과 낮은 사고 위험, 높은 검 증 유효성으로 자율주행 기술을 적용한 다양한 소프트웨어들을 검증할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조 부호를 붙이도록 한다. 어느 부분이 다른 부분의 \"위에\" 있다고 언급하는 경우, 이는 바로 다른 부분의 위에 있을 수 있거나 그 사이에 다른 부분이 수반될 수 있다. 대조적으로 어느 부분이 다른 부분의 \"바로 위에\" 있다고 언급하는 경우, 그 사이 에 다른 부분이 수반되지 않는다. 제1, 제2 및 제3 등의 용어들은 다양한 부분, 성분, 영역, 층 및/또는 섹션들을 설명하기 위해 사용되나 이들에 한정되지 않는다. 이들 용어들은 어느 부분, 성분, 영역, 층 또는 섹션을 다른 부분, 성분, 영역, 층 또는 섹션 과 구별하기 위해서만 사용된다. 따라서, 이하에서 서술하는 제1 부분, 성분, 영역, 층 또는 섹션은 본 발명의 범위를 벗어나지 않는 범위 내에서 제2 부분, 성분, 영역, 층 또는 섹션으로 언급될 수 있다. 여기서 사용되는 전문 용어는 단지 특정 실시 예를 언급하기 위한 것이며, 본 발명을 한정하는 것을 의도하지 않는다. 여기서 사용되는 단수 형태들은 문구들이 이와 명백히 반대의 의미를 나타내지 않는 한 복수 형태들도 포함한다. 명세서에서 사용되는 \"포함하는\"의 의미는 특정 특성, 영역, 정수, 단계, 동작, 요소 및/또는 성분을 구체화하며, 다른 특성, 영역, 정수, 단계, 동작, 요소 및/또는 성분의 존재나 부가를 제외시키는 것은 아니다. 다르게 정의하지는 않았지만, 여기에 사용되는 기술용어 및 과학용어를 포함하는 모든 용어들은 본 발명이 속하"}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자가 일반적으로 이해하는 의미와 동일한 의미를 가진다. 보통 사용되는 사전에 정의된 용어들은 관련 기술문헌과 현재 개시된 내용에 부합하는 의미를 가지는 것으로 추가 해석되고, 정의되지 않는 한 이상적이거나 매우 공식적인 의미로 해석되지 않는다."}
{"patent_id": "10-2021-0106338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이하, 첨부한 도면을 참조하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시 예에 한정되지 않는다. 도 1은 일 실시예에 따른 주행관제 시스템과 자율주행 모형차를 포함하는 네트워크 시스템을 도시한 도면이다. 도 1을 참조하면, 네트워크 시스템은 유선 또는 무선 네트워크 상에서 통신 가능하게 결합된 일 실시 예에 따른 주행관제 시스템과 자율주행 모형차를 포함한다. 도 1에는 하나의 자율주행 모형차만 이 도시되어 있지만, 다수의 자율주행 모형차들이 서로 결합될 수 있고/있거나 네트워크를 통해 주행 관제 시스템에 결합될 수 있다. 주행관제 시스템은 자율주행 모형차를 이용하여 현실 주행환경과 비슷한 모형 환경에서 주행 시나리오에 따라 주행 시나리오의 시험을 수행하는 주행관제 시스템이다. 즉, 주행관제 시스템은 주행관제로 사용되는 프로그램을 포함하고, 해당 관제 프로그램에 주행경로를 입력하면 다수의 차량이 입력된 주행경로를 따라 그대 로 움직이는 시스템이다. 다시 말해, 주행관제 시스템은 실제 차량에 동작시키기 전 몇몇 기능들을 간단하 게 자율주행 모형차에 넣은 뒤 테스트를 해보기 위한 시스템이다. 주행관제 시스템은 하나 이상의 서버와, 서버와 통신 연결된 관리용 컴퓨터를 포함할 수 있다. 서버는 웹 또는 클라우드 서버, 애플리케이션 서버, 백엔드 서버 또는 이들의 조합과 같은 임의의 종류의 서버 또는 서버 클러스터일 수 있다. 서버는 데이터 분석 서버, 콘텐츠 서버, 교통 정보 서버, 지도 및 관 심 지점(POI: point of interest) 서버 또는 위치 서버 등일 수 있다. 관리용 컴퓨터는 서버와 통신 연결된 컴퓨터, 예를 들어 노트북이나 일반 퍼스널 컴퓨터일 수 있다. 네트워크는 근거리 네트워크(LAN), 인터넷과 같은 광역 네트워크(WAN), 셀룰러 네트워크, 위성 네트워크 또는 이들의 조합과 같은 유선 또는 무선의 임의의 유형의 네트워크일 수 있다. 자율주행 모형차는 차량이 운전자로부터의 입력이 거의 또는 전혀 없이 주변 환경을 내비게이트하는 자율 주행모드로 구성될 수 있는 차량을 지칭한다. 자율주행 모형차는 혼자서 스스로 자율주행도 가능하지만,주행관제 시스템의 서버의 원격 조종 또는 제어에 따라 주행될 수도 있다. 자율주행 모형차는 실제 차량과 대비하여 1/N 차체 프레임을 갖는 모형차를 예시적으로 설명하나, 실제 차 량과 동일 또는 유사한 프레임을 갖는 차량일 수도 있다. 이러한 자율주행 모형차는 차량이 운행되는 환경에 관한 정보를 검출하도록 구성된 하나 이상의 센서를 갖 는 센서 시스템을 포함할 수 있다. 자율주행 모형차는, 예를 들어, 가속 신호 또는 명령, 감속 신호 또는 명령, 조향 신호 또는 명령, 제동 신호 또는 명령 등과 같은 다양한 통신 신호 및/또는 명령에 의해 제어될 수 있는, 엔진, 차륜(wheel), 스티어링 휠, 변속기 등과 같은, 일반 차량에 포함되는 특정 공통 구성 요소를 더 포 함할 수 있다. 센서 시스템은, 하나 이상의 카메라, GPS(globalpositioning system) 유닛, 관성 측정 유닛(IMU), 레이더 유닛 및 광 검출 및 측정(LIDAR) 유닛을 포함하지만, 이에 한정되지 않는다. 센서 시스템은, 소나(sonar) 센서, 적외 선 센서, 스티어링(조향) 센서, 스로틀 센서, 제동 센서 및 오디오 센서(예를 들어, 마이크로폰)와 같은 다른 센서들을 더 포함할 수 있다. 도 2는 주행관제 시스템의 관제스크린과 모형 환경에서 자율주행 모형차들의 주행 과정을 도시하고 있다. 도 2를 참조하면, 주행관제 시스템은 자율주행 모형차로부터 수신된 차량 정보 및 도로상황 정보를 시각화하는 관제스크린을 포함할 수 있다. 관제스크린은 영상을 표시하는 하나 이상의 디스플레이장 치들을 포함할 수 있다. 자율주행 모형차는 적어도 한대의 주인공 차량(120a)과 주인공 차량(120a)을 둘러싸고 동시에 주행하는 둘 이상의 엑스트라 차량들(120a, 120b, 120c, 120d,...,120n)을 포함할 수 있다. 관제스크린은 동시에 또는 선택적으로 차량정보 및 도로상황 정보 등 다양한 정보를 표시할 수 있다. 또한 관제스크린은 현실 주행환경과 비슷한 모형 환경에서 엑스트라 차량들(120a, 120b, 120c, 120d,...,120n)의 주행을 제어하므로 주인공 차량(120a)이 수행하는 주행 시나리오 및 그에 따른 주행 상황을 표시할 수 있다. 예를 들어, 자율주행과 관련된 아이디어가 있을 때 실제 도로 환경에서 실제 차량으로 이를 구현한 후 테스트를 진행하는 것은 매우 위험하고 비용이 많이 들 수 있다. 예를 들어 자율주행과 관련된 아이디어로 차선변경에 대 한 아이디어가 있다고 할 때 차선변경에 대한 아이디어를 실제 도로 환경에서 실제 차량으로 수행하는 것은 사 고 발생시 비용도 많이 들고 큰 대형 사고를 일으킬 수도 있다. 한편, 차선변경에 대한 아이디어를 자율주행 시뮬레이터로 진행할 경우 진행 자체도 어려울 뿐만 아니라 이를 통한 아이디어의 검증에 대한 유효성을 실제 도로 환경에서 실제 차량에 수행하기 전까지 확인할 수 없다. 주행관제 시스템 및 자율주행 모형차는 실제 환경과 유사한 모형 환경에서 실제 차량의 1/N의 차체 프레임의 자율주행 모형차로 자율주행차의 자율주행 기술 또는 아이디어를 개발하고 검증할 수 있다. 또한 주행 관제 시스템 및 자율주행 모형차는 이를 통해 적은 비용과 낮은 사고 위험, 높은 검증 유효성으로 자 율주행 기술을 적용한 다양한 소프트웨어들을 검증할 수 있다. 전술한 바와 같이, 주행 관제 시스템 및 자율주행 모형차로 차선변경 아이디어를 테스트 하는 경우 적은 비용과 낮은 사고 위험 상황에서 실차 상황과 매우 유사하게 테스트를 진행할 수 있으므로 높은 검증 유효 성을 제공할 수 있다는 장점이 있다. 이하에서 도 1 및 도 2를 참조하여 설명한 주행관제 시스템과 자율주행 모형차의 다양한 실시예들을 도 3 내지 도 14를 참조하여 설명한다. 도 3은 다른 실시예에 따른 주행관제 시스템의 블록도이다. 도 3을 참조하면, 다른 실시예에 따른 주행관제 시스템은 자율주행 모형차를 이용하여 현실 주행환경과 비 슷한 모형 환경에서 주행 시나리오에 따라 주행 시나리오의 시험을 수행하는 주행관제 시스템이다. 주행관제 시스템은, 자율주행 모형차와 통신하는 통신 모듈, 자율주행 모형차에 부착된 복 수의 센서들로부터 획득한 자율주행 모형차의 센싱 정보를 포함하는 차량 정보 및 자율주행 시험이 수행되 는 도로상황 정보를 수집 및 처리하는 센싱데이터 관리자, 차량 정보와 도로상황 정보를 이용하여 주행 시 나리오를 편집하고 편집된 주행 시나리오에 따라 자율주행 모형차를 제어하는 차량제어 정보를 통신 모듈을 통해 자율주행 모형차에 제공하고 자율주행의 시험 결과를 분석하는 실증테스트 관리자, 및 자율주행 모형차로부터 수신된 차량 정보 및 도로상황 정보를 시각화하는 관제스크린 관리자를 포함 한다. 통신 모듈은 전술한 네트워크를 통해 자율주행 모형차과 유선 또는 무선으로 통신할 수 있는 통 신 모듈이다. 예를 들어, 통신 모듈은 근거리 네트워크(LAN), 인터넷과 같은 광역 네트워크(WAN), 셀룰러 네트워크, 위성 네트워크 또는 이들의 조합과 같은 유선 또는 무선의 임의의 유형의 네트워크를 통해 자율주행 모형차과 유선 또는 무선으로 통신할 수 있다. 센싱데이터 관리자는 모든 자율주행 모형차의 데이터를 모으는 프로그램일 수 있다. 센싱데이터 관리 자는 모든 자율주행 모형차의 데이터를 모은 후 특정 포맷으로 파일을 저장할 수 있다. 센싱데이터 관리자 는 모든 자율주행 모형차의 모든 차량의 데이터를 모을 수 있으며, 기능별로 다르게 모을 수도 있다. 또한 센싱데이터 관리자는 이미지를 동영상 파일로 변경할 수도 있다. 실증테스트 관리자는, 실제 관제로 사용되는 프로그램일 수 있다. 실증테스트 관리자는 해당 프로그 램에 자율주행 모형차의 주행경로와 주행 순서를 입력하면 자율주행 모형차들이 해당 주행 순서에 따 라 그대로 움직이게 한다. 실증테스트 관리자는, 현실 주행환경과 비슷한 모형 환경에서 엑스트라 차량들(120a, 120b, 120c, 120d,...,120n)의 주행을 제어하므로 주인공 차량(120a)이 수행하는 자율주행의 시험 결과를 분석할 수 있다. 실증테스트 관리자는, 엑스트라 차량들(120a, 120b, 120c, 120d,...,120n)의 주행을 제어하고, 이에 따른 주인공 차량(120a)의 움직임을 모니터링하므로 주행 시나리오에 따른 자율주행의 시험 결과를 분석할 수 있다. 이 주행 시나리오는 자율주행 모형차들이 시나리오에 따라 계획대로 주행하도록 주인공 차량(120a)과 주변 의 엑스트라 차량들(120a, 120b, 120c, 120d,...,120n)의 움직임을 사전에 정의한다. 구체적으로, 이 주행 시 나리오는 주인공 차량(120a)과 주변의 엑스트라 차량들(120a, 120b, 120c, 120d,...,120n)의 움직임을 사전에 정의하며, 각 차량에게 어느 시점에 어느 행동을 취할 것인지를 알려주는 방식, 또는 원격에서 차량의 주행을 직접 제어하는 방식으로, 차량들이 시나리오에 따라 계획대로 주행하게끔 만드는데 사용된다. 관제스크린 관리자는 모든 자율주행 모형차의 데이터를 실시간으로 보여주는 프로그램일 수 있다. 관 제스크린 관리자는 자율주행 모형차가 현재 어디에 있는지 어떤 조향 상태인지를 관제스크린에 모두 출력할 수 있다. 예를 들어 관제스크린 관리자는 카메라, 라이다 및 차량의 위치 등을 실시간으로 관 제스크린에 출력할 수 있다. 도 4는 도 3의 센싱데이터 관리자의 블록도이다. 도 4를 참조하면, 센싱데이터 관리자는 자율주행 모형차에 부착된 복수의 센서들로부터 획득한 자율 주행 모형차의 센싱 정보를 포함하는 차량 정보 및 자율주행 시험이 수행되는 도로상황 정보를 수집하는 데이터 수집모듈 및 수집된 정보들을 처리하는 데이터 처리 모듈를 포함할 수 있다. 도 5는 도 3의 실증테스트 관리자의 블록도이다. 도 5를 참조하면, 실증테스트 관리자는 차량 정보와 도로상황 정보를 이용하여 주행 시나리오를 편집하는 주행 시나리오 편집기 및 편집된 주행 시나리오에 따라 자율주행 모형차를 제어하는 차량제어 정보를 통신 모듈을 통해 자율주행 모형차에 제공하는 모형차 주행제어 모듈, 자율주행의 시험 결과를 분석하는 주행상황 모니터링 모듈을 포함한다. 주행 시나리오 편집기는 주인공 차량(120a)과 주변의 엑스트라 차량들(120a, 120b, 120c, 120d,...,120 n)의 움직임을 사전에 정의하며, 각 차량에게 어느 시점에 어느 행동을 취할 것인지를 알려주는 방식, 또는 원 격에서 차량의 주행을 직접 제어하는 방식으로, 차량들이 시나리오에 따라 계획대로 주행하게끔 만드는 주행 시 나리오를 편집한다. 도 6은 도 3의 관제스크린 관리자의 블록도 이다. 도 6을 참조하면, 관제스크린 관리자는 자율주행 모형차로부터 수신된 차량 정보 및 도로상황 정보를 시각화하는 제1시각화 모듈 및 센싱데이터 및 상태정보를 시각화하는 제2시각화 모듈을 포함할 수 있 다.도 7은 도 3의 주행관제 시스템의 제어에 따른 자율주행 모형차의 실증 시나리오를 도시하고 있다. 도 8은 도 7 의 실증 시나리오에 따른 자율주행 모형차의 주행 상황을 도시하고 있다. 도 7 및 도 8을 참조하면, 도 3의 주행관제 시스템의 제어에 따른 자율주행 모형차의 실증 시나리오는 주 인공 차량(120a)이 엑스트라 차량들(120b, 120c)의 뒤와 옆에서 위치하던 중 차선을 변경하는 시나리오일 수 있 다. 도 8에 도시한 바와 같이, 주인공 차량(120a)은 주행관제 시스템의 제어에 따른 자율주행 모형차의 실증 시나리오에 따라 옆에 위치한 엑스트라 차량(120c)을 앞질러 차선을 변경할 수 있다. 주행관제 시스템 의 운영자는 관제스크린를 통해 도로 상황 등과 자율주행 모형차의 주행 상황을 모니터링 할 수 있다. 이를 통해 차선변경에 대한 실증 시나리오에 대해 자율주행 모형차의 자율주행 결과를 낮은 비용에 사고 위험없이 실제 차량과 유사한 환경에서 테스트해 볼 수 있다. 도 9는 또 다른 실시예에 따른 주행관제 시스템의 블록도이다. 도 9를 참조하면, 또 다른 실시예에 따른 주행관제 시스템은 통신 모듈, 센싱데이터 관리자, 실 증테스트 관리자, 관제스크린 관리자 및 분산환경 관리자를 포함한다. 통신 모듈, 센싱데이터 관리자, 실증테스트 관리자, 관제스크린 관리자는 도 3 내지 도 5 를 참조하여 설명한 통신 모듈, 센싱데이터 관리자, 실증테스트 관리자, 관제스크린 관리자 와 동일 또는 실질적으로 동일할 수 있다. 분산환경 관리자는 신규 자율주행 아이디어를 삽입 관리하고, 자율주행 모형차에 탑재된 하나 이상의 제1소프트웨어 조각과 자체 탑재된 하나 이상의 제2소프트웨어 조각이 자율주행 모형차의 구동에 필요한 단일 인공지능 소프트웨어로 동작하도록 분산환경의 동적관리를 수행한다. 분산환경 관리자는 주인공 차량의 기능을 쉽고 빠르게 변경하기 위해 제작된 프로그램일 수 있다. 도 10은 도 9의 분산환경 관리자의 블록도이다. 도 10을 참조하면, 분산환경 관리자는, 신규 자율주행 아이디어를 삽입 관리하는 신규 아이디어 삽입 관리 모듈과, 분산환경의 동적 관리를 수행하는 분산환경 동적관리 모듈을 포함할 수 있다. 분산환경 동적 관리 모듈은 자율주행 모형차에 탑재된 하나 이상의 제1소프트웨어 조각과 자체 탑재 된 하나 이상의 제2소프트웨어 조각이 자율주행 모형차의 구동에 필요한 단일 인공지능 소프트웨어로 동작 하도록 분산환경의 동적관리를 수행할 수 있다. 분산환경 관리자는, 단일 인공지능 소프트웨어에 신규 제3소프트웨어 조각을 추가하거나, 제1소트웨어 조 각이나 제2소프트웨어 조각 중 하나를 대체하여 인공지능 소프트웨어를 동작시킬 수 있다. 도 11은 도 9의 분산환경 관리자에 의한 소프트웨어 조각들의 개념도이다. 도 11을 참조하면, 분산환경 관리자는 자율주행 모형차에 탑재된 하나 이상의 제1소프트웨어 조각 과 자체 탑재된 하나 이상의 제2소프트웨어 조각이 자율주행 모형차의 구동에 필요한 단일 인공 지능 소프트웨어로 동작하도록 분산환경의 동적관리를 수행할 수 있다. 분산환경 관리자는, 단일 인공지능 소프트웨어에 신규 제3소프트웨어 조각을 추가하거나, 제1소 트웨어 조각이나 제2소프트웨어 조각 중 하나를 다른 제4소프트웨어 조작 및 제5소프트웨어 조 작으로 대체하여 단일 인공지능 소프트웨어를 동작할 수 있다. 분산환경 관리자는 제1소트웨어 조각이나 제2소프트웨어 조각 중 하나를 대체할 때 이들 중 하 나를 특정 기능이 없는 더미 소프트웨어 조각으로 대체하므로 일부 소프트웨어 조각을 삭제하는 것과 동일한 동 작을 테스트할 수도 있다. 분산환경 관리자는 신규 제3소프트웨어 조각을 추가하거나 다른 제4소프트웨어 조작 및 제5소프 트웨어 조작으로 대체하므로 주인공 차량(120a)의 기능을 쉽고 빠르게 변경해 볼 수 있다. 도 12는 일반적인 자율주행 차량에 포함될 수 있는 자율주행 통합 플랫폼의 동작들의 개념도이다. 도 12을 참조하면, 일반적인 자율주행 차량에 포함될 수 있는 자율주행 통합 플랫폼은 카메라나 라이다, IMC, GPS와 같은 센싱 시스템에 의해 센싱 데이터를 획득하는 센싱 관련 소프트웨어, 획득된 센싱 데이터 를 수신하는 인식(Perception, 422), 예측(Prediction, 426), 및 플래닝(Planning, 424) 등을 처리하는 처리 관련 소프트웨어, 제어 데이터를 YMC나 AS, ZMP와 같은 제어장치들에 제공하는 제어 관련 소프트웨어(43 0)를 포함한다. 센싱 관련 소프트웨어나 처리 관련 소프트웨어, 제어 관련 소프트웨어는 각각 하나 이상의 소 프트웨어를 포함하고, 각 소프트웨어도 하나 이상의 소프트웨어 조각을 포함할 수 있다. 전술한 소프트웨어와 소프트웨어 조각은 상대적인 개념일 수 있다. 예를 들어, 인식과 관련된 소프트웨어 는 위치추정(localizaion)와 관련된 소프트웨어 조각과 검출(detection)과 관련된 소프트웨어 조각, 예측 (prediction)과 관련된 소프트웨어 조각을 포함하는 것으로 볼 수 있다. 한편 위치추정와 관련된 소프트웨어는 둘 이상의 소프트웨어 조각들을 포함하는 것으로 정의할 수 있다. 한편 위치추정와 관련된 소프트웨어에 포함 된 둘 이상의 소프트웨어 조각들은 각각 하부 소프트웨어 조각들을 포함하는 하나의 소프트웨어로 볼 수 있다. 전술한 예에서, 분산환경 관리자는 센싱 관련 소프트웨어나 처리 관련 소프트웨어, 제어 관련 소프트웨어 중 하나의 소프트웨어에 대해 실증 테스트를 위해 같은 기능의 1번, 2번, 3번 소프트웨어들 또 는 소프트웨어 조각들을 가져왔다면 1번 소프트웨어 또는 소프트웨어 조각을 주인공 차량(120a)에 적용하여 빠 르게 테스트하고 곧바로 2번 소프트웨어 또는 소프트웨어 조각으로 바꿔서 빠르게 테스트하고, 또 3번 소프트 웨어 또는 소프트웨어 조각으로 바꿔서 빠르게 테스트할 수 있다. 또한 분산환경 관리자는 이미 빌드가 되어있는 소프트웨어 또는 소프트웨어 조작이라 하더라도 빠르게 포 팅시킬수 있는 마법사 프로그램이 존재하여 빠른 포팅이 가능하다. 도 13은 도 9의 분산환경 관리자에 의한 소프트웨어 조각을 추가하거나 대체하는 예를 도시하고 있다. 도 13을 참조하면, 자율주행 차량이 어린이 보호구역에 진입한 경우, 자율주행 차량의 구동에 필요한 단일 인 공지능 소프트웨어가 인도에 있는 아이들을 인식하고 움직임을 추적하고 있다가 차량의 주행 경로 상에 아 이가 들어올 가능성이 일정 % 이상이 되면 차량의 속도를 크게 낮추는 기능을 구현했다고 가정하자. 단일 인공지능 소프트웨어는 카메라 영상 수집 모듈, 영상 속 어린이 인식 모듈, 인식된 어린이에 ID 부여하고 추적하는 모듈, ID별 어린이의 미래의 움직임을 예측하는 모듈, 차량의 경로와 어린이의 경로가 겹칠 확률을 계산하는 모듈, 충돌확률값에 따라 차량의 속도를 제 어하는 모듈와 같은 소프트웨어 조각들을 포함할 수 있다. 이때 ID별 어린이의 미래의 움직임을 예측하는 모듈과 차량의 경로와 어린이의 경로가 겹칠 확률 을 계산하는 모듈은 도 13에 도시한 바와 같이 하나의 차량의 행동을 선택하는 모듈의 하부 모듈들을 구성할 수도 있다. 이때, 주행 시나리오로, 전술한 의 모듈들(510, 520, 530, 542, 544, 550)이 모두가 차량에 구현되어 있을 수 있다. 이때 자율주행 소프트웨어의 성능을 테스트하고자 하는 자, 즉 고객이 미래의 움직임을 예측하는 모듈(54 2)을 새로운 머신러닝 모델로 개발하여 이를 검증하고자 하는 경우 기존 번의 모듈을 배제하고 고객의 노트북에서 신규 번의 모듈이 동작하도록 할 수 있다. 또는 분산환경 관리자는 번의 모듈을 뺀 나머지 ~ 및 , 의 모듈들(510, 520, 530, 544, 550)은 자율주행 모형차에서 구동할 수도 있다. 물론 자율주행 모형차에서 및 의 모듈들 (510, 520)만 수행하고 주행관제 시스템의 서버에서 의 모듈을 수행하고, 의 모듈 을 노트북에서 및 의 모듈들(544, 550)을 다른 컴퓨터에서 구동하는 식으로 완전히 흩어서 동작시킬 수도 있다. 다른 예로, 새로운 번의 모듈이 차량에 있는 및 번의 모듈들(530, 544)과 예전처럼 연결되어 정 상동작하려면 똑같은 입력과 출력값을 가져야 할 수 있다. 이를 번의 모듈을 설계하는 고객쪽 개발자가 해도 되지만 현실적으로 고객에게 요구하기 어려우며 주행관제 시스템의 운영자에게 소스코드 공개를 하지 않을 것이므로 단순히 무엇을 입력과 출력으로 하는지 직접 제작한 고객으로부터 설명만 듣고 주행관제 시스템 의 운영자가 변환모듈을 만들어서 처리해 주고자 할 수 있다. 이때 이 변환모듈은 새로운 번의 모듈 의 입출력 값을 적절히 변환하여 및 번의 모듈들(530, 544)과 메시지를 주고받으며 협업할 수 있도록 바꾸어 주는 기능을 제공할 수 있다. 따라서, 분산환경 관리자는 신규 소프트웨어 조각을 추가하거나 다른 소프트웨어 조작으로 대체하므로 주 인공 자율주행 모형차의 기능을 쉽고 빠르게 변경할 수 있다. 따라서, 본 발명의 실시예들에 따른 주행관제 시스템은 자율주행차의 자율주행 기술 또는 아이디어를 개발 하고 검증할 수 있다. 또한 본 발명의 실시예들에 따른 주행관제 시스템은 적은 비용과 낮은 사고 위험, 높은 검증 유효성으로 자율주행 기술을 적용한 다양한 소프트웨어들을 검증할 수 있다. 이상 도면들을 참조하여 다른 실시예에 따른 주행관제 시스템에 대해 설명하였다. 이하, 또 다른 실시예에 따른 자율주행 모형차에 대해 상세히 설명한다. 도 14는 또 다른 실시예에 따른 자율주행 모형차의 블록도이다. 도 14를 참조하면, 다른 실시예에 따른 자율주행 모형차는 자율주행도 가능하나, 현실 주행환경과 비슷한 모형 환경에서 주행 시나리오의 시험을 수행하는 주행관제 시스템의 제어에 따라 상기 주행 시나리오를 수행하 는 자율주행 모형차이다. 자율주행 모형차는, 주행관제 시스템과 통신하고 복수의 센서들로부터 획득한 센싱 정보를 포함하는 차량 정보를 주행관제 시스템에 전송하고 차량 정보와 자율주행 시험이 수행되는 도로상황 정보를 이용하여 주행 시 나리오에 따라 자율주행 모형차를 제어하는 차량제어 정보를 주행관제 시스템으로부터 수신하는 통신 모듈 , 주행관제 시스템의 제어 기반 주행을 관리하고, 시나리오 기반 주행을 관리하고, 주변 상황 및 차량 상 태를 모니터링하여 자율주행의 시험 결과를 분석하는 실증테스트 관리자, 및 신규 자율주행 아이디어를 삽 입 관리하고 자체 탑재된 하나 이상의 제1소프트웨어 조각과 주행관제 시스템에 탑재된 하나 이상의 제2소프트 웨어 조각이 자율주행 모형차의 구동에 필요한 단일 인공지능 소프트웨어로 동작하도록 분산환경의 동적 관리를 수행하는 분산환경 관리자를 포함한다. 도 11 내지 도 13을 참조하여 설명한 바와 같이, 인공지능 소프트웨어는, 단일 인공지능 소프트웨어에 신규 제3 소프트웨어 조각을 추가하거나, 제1소트웨어 조각이나 제2소프트웨어 조각 중 하나를 대체하여 동작할 수 있다. 자율주행 모형차는, 자율주행에 필요한 자율주행 통합플랫폼을 포함할 수 있다. 통신 모듈은 전술한 네트워크를 통해 주행관제 시스템과 유선 또는 무선으로 통신할 수 있는 통 신 모듈이다. 예를 들어, 통신 모듈은 근거리 네트워크(LAN), 인터넷과 같은 광역 네트워크(WAN), 셀룰러 네트워크, 위성 네트워크 또는 이들의 조합과 같은 유선 또는 무선의 임의의 유형의 네트워크를 통해 주행관제 시스템과 유선 또는 무선으로 통신할 수 있다. 실증테스트 관리자는 주행관제 시스템의 제어 기반 주행을 관리하는 관제서버 제어기반 주행관리 모듈 및 시나리오 기반 주행을 관리하는 시나리오 기반 주행관리 모듈 및 주변 상황 및 차량 상태를 모니 터링하여 주변상황 및 차량 상태 모니터링 모듈을 포함할 수 잇다. 분산환경 관리자는 신규 자율주행 아이디어를 삽입 관리하는 신규 아이디어 삽입관리 모듈 및 자체 탑재된 하나 이상의 제1소프트웨어 조각과 주행관제 시스템에 탑재된 하나 이상의 제2소프트웨어 조각이 자율주 행 모형차의 구동에 필요한 단일 인공지능 소프트웨어로 동작하도록 분산환경의 동적 관리를 수행하는 분산환경 동적관리 모듈을 포함할 수 있다. 자율주행 통합플랫폼은 도 12를 참조하여 설명한 일반적인 자율주행 차량에 포함될 수 있는 자율주행 통합 플랫폼의 센싱 관련 소프트웨어, 처리 관련 소프트웨어, 제어 관련 소프트웨어 등의 전부 또는 일부를 포함할 수 있다. 따라서, 본 발명의 실시예들에 따른 자율주행 모형차는 자율주행차의 자율주행 기술 또는 아이디어를 개발 하고 검증할 수 있다. 또한 본 발명의 실시예들에 따른 자율주행 모형차는 적은 비용과 낮은 사고 위험, 높은 검증 유효성으로 자율주행 기술을 적용한 다양한 소프트웨어들을 검증할 수 있다. 본 발명이 속하는 기술 분야의 당업자는 본 발명이 그 기술적 사상이나 필수적 특징을 변경하지 않고서 다른 구 체적인 형태로 실시될 수 있으므로, 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적인 것이 아닌 것으로서 이해해야만 한다. 본 발명의 범위는 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내 어지며, 특허청구범위의 의미 및 범위 그리고 그 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다.하나 이상의 예시적인 실시 예에서, 설명한 기능들은 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 조합 으로 구현될 수 있다. 소프트웨어로 구현된다면, 이 기능들은 컴퓨터 판독 가능 매체 상에 하나 이상의 명령 또 는 코드로서 저장 또는 전송될 수 있다. 컴퓨터 판독 가능 매체는 한 장소에서 다른 장소로 컴퓨터 프로그램의 전달을 용이하게 하는 임의의 매체를 포함하는 통신 매체 및 컴퓨터 저장 매체를 모두 포함한다. 저장 매체는 컴퓨터에 의해 액세스 가능한 임의의 이용 가능한 매체일 수 있다. 한정이 아닌 예시로, 이러한 컴퓨터 판독 가 능 매체는 RAM, ROM, EEPROM, CD-ROM이나 다른 광 디스크 저장소, 자기 디스크 저장소 또는 다른 자기 저장 디 바이스, 또는 명령이나 데이터 구조의 형태로 원하는 프로그램코드를 전달 또는 저장하는데 사용될 수 있으며 컴퓨터에 의해 액세스 가능한 임의의 다른 매체를 포함할 수 있다. 또한, 임의의 접속이 컴퓨터 판독 가능 매체 로 적절히 지칭된다. 예를 들어, 소프트웨어가 동축 케이블, 광섬유 케이블, 꼬임 쌍선, 디지털 가입자 회선 (DSL), 또는 적외선, 라디오 및 초고주파와 같은 무선 기술을 이용하여 웹사이트, 서버 또는 다른 원격 소스로 부터 전송된다면, 동축 케이블, 광섬유 케이블, 꼬임 쌍선, DSL, 또는 적외선, 라디오 및 초고주파와 같은 무선 기술들이 매체의 정의에 포함된다. 여기서 사용된 것과 같은 디스크(disk 및 disc)는 콤팩트 디스크(CD), 레이 저 디스크, 광 디스크, 디지털 다목적 디스크(DVD), 플로피디스크 및 블루레이 디스크를 포함하며, 디스크 (disk)들은 보통 데이터를 자기적으로 재생하는 반면, 디스크(disc)들은 데이터를 레이저에 의해 광학적으로 재 생한다. 상기의 조합들 또한 컴퓨터 판독 가능 매체의 범위 내에 포함되어야 한다. 실시 예들이 프로그램 코드나 코드 세그먼트들로 구현될 때, 코드 세그먼트는 프로시저, 함수, 서브프로그램, 프로그램, 루틴, 서브루틴, 모듈, 소프트웨어 패키지, 클래스, 또는 명령들, 데이터 구조들, 또는 프로그램 명 령문들의 임의의 조합을 나타낼 수 있는 것으로 인식해야 한다. 코드 세그먼트는 정보, 데이터, 인수 (argument), 파라미터 또는 메모리 콘텐츠를 전달 및/또는 수신함으로써 다른 코드 세그먼트 또는 하드웨어 회 로에 연결될 수 있다. 정보, 인수, 파라미터, 데이터 등은 메모리 공유, 메시지 전달, 토큰 전달, 네트워크 송 신 등을 포함하는 임의의 적당한 수단을 이용하여 전달, 발송 또는 전송될 수 있다. 추가로, 어떤 측면들에서 방법 또는 알고리즘의 단계들 및/또는 동작들은 컴퓨터 프로그램 물건으로 통합될 수 있는 기계 판독 가능 매체 및/또는 컴퓨터 판독 가능 매체 상에 코드들 및/또는 명령들 중 하나 또는 이들의 임의의 조합이나 세트로서 상 주할 수 있다. 소프트웨어에서 구현에서, 여기서 설명한 기술들은 여기서 설명한 기능들을 수행하는 모듈들(예를 들어, 프로시 저, 함수 등)로 구현될 수 있다. 소프트웨어 코드들은 메모리 유닛들에 저장될 수 있으며 프로세서들에 의해 실 행될 수 있다. 메모리 유닛은 프로세서 내에 구현될 수도 있고 프로세서 외부에 구현될 수 있으며, 이 경우 메 모리 유닛은 공지된 바와 같이 다양한 수단에 의해 프로세서에 통신 가능하게 연결될 수 있다. 하드웨어 구현에서, 처리 유닛들은 하나 이상의 주문형 집적 회로(ASIC), 디지털 신호 프로세서(DSP), 디지털 신호 처리 디바이스(DSPD), 프로그래밍 가능 로직 디바이스(PLD), 현장 프로그래밍 가능 게이트 어레이(FPGA), 프로세서, 제어기, 마이크로컨트롤러, 마이크로프로세서, 여기서 설명한 기능들을 수행하도록 설계된 다른 전자 유닛들, 또는 이들의 조합 내에 구현될 수 있다. 상술한 것은 하나 이상의 실시 예의 실례를 포함한다. 물론, 상술한 실시 예들을 설명할 목적으로 컴포넌트들 또는 방법들의 가능한 모든 조합을 기술할 수 있는 것이 아니라, 당 업자들은 다양한 실시 예의 많은 추가 조합 및 치환이 가능함을 인식할 수 있다. 따라서 설명한 실시 예들은 첨부된 청구범위의 진의 및 범위 내에 있는 모 든 대안, 변형 및 개조를 포함하는 것이다. 더욱이, 상세한 설명 또는 청구범위에서 \"포함한다\"라는 용어가 사 용되는 범위에 대해, 이러한 용어는 \"구성되는\"이라는 용어가 청구범위에서 과도적인 단어로 사용될 때 해석되 는 것과 같이 \"구성되는\"과 비슷한 식으로 포함되는 것이다. 더욱이, 본 출원에서 사용된 바와 같이, \"컴포넌트\", \"모듈\", \"시스템\" 등의 용어는 이에 한정되는 것은 아니지 만, 하드웨어, 펌웨어, 하드웨어와 소프트웨어의 조합, 소프트웨어 또는 실행중인 소프트웨어와 같은 컴퓨터 관 련 엔티티를 포함하는 것이다. 예를 들어, 컴포넌트는 이에 한정되는 것은 아니지만, 프로세서상에서 실행하는 프로세스, 프로세서, 객체, 실행 가능한 실행 스레드, 프로그램 및/또는 컴퓨터일 수도 있다. 예시로, 연산 디 바이스 상에서 구동하는 애플리케이션과 연산 디바이스 모두 컴포넌트일 수 있다. 하나 이상의 컴포넌트가 프로 세스 및/또는 실행 스레드 내에 상주할 수 있으며, 컴포넌트가 하나의 컴퓨터에 집중될 수도 있고 그리고/또는 2개 이상의 컴퓨터 사이에 분산될 수도 있다. 또한, 이들 컴포넌트는 각종 데이터 구조를 저장한 각종 컴퓨터 판독 가능 매체로부터 실행될 수 있다. 컴포넌트들은 하나 이상의 데이터 패킷(예를 들어, 로컬 시스템, 분산 시스템의 다른 컴포넌트와 그리고/또는 신호에 의해 다른 시스템들과 인터넷과 같은 네트워크를 거쳐 상호 작용 하는 어떤 컴포넌트로부터의 데이터)을 갖는 신호에 따르는 등 로컬 및/또는 원격 프로세스에 의해 통신할 수있다."}
{"patent_id": "10-2021-0106338", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 주행관제 시스템과 자율주행 모형차를 포함하는 네트워크 시스템을 도시한 도면이다. 도 2는 주행관제 시스템의 관제스크린과 모형 환경에서 자율주행 모형차들의 주행 과정을 도시하고 있다. 도 3은 다른 실시예에 따른 주행관제 시스템의 블록도이다. 도 4는 도 3의 센싱데이터 관리자의 블록도이다. 도 5는 도 3의 실증테스트 관리자의 블록도이다. 도 6은 도 3의 관제스크린 관리자의 블록도 이다. 도 7은 도 3의 주행관제 시스템의 제어에 따른 자율주행 모형차의 실증 시나리오를 도시하고 있다. 도 8은 도 7의 실증 시나리오에 따른 자율주행 모형차의 주행 상황을 도시하고 있다. 도 9는 또 다른 실시예에 따른 주행관제 시스템의 블록도이다. 도 10은 도 9의 분산환경 관리자의 블록도이다. 도 11은 도 9의 분산환경 관리자에 의한 소프트웨어 조각들의 개념도이다. 도 12는 일반적인 자율주행 차량에 포함될 수 있는 자율주행 통합 플랫폼의 동작들의 개념도이다. 도 13은 도 9의 분산환경 관리자에 의한 소프트웨어 조각을 추가하거나 대체하는 예를 도시하고 있다. 도 14는 또 다른 실시예에 따른 자율주행 모형차의 블록도이다."}
