{"patent_id": "10-2020-0010021", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0096492", "출원번호": "10-2020-0010021", "발명의 명칭": "승객 운송 서비스와 연계된 운행 정보 제공 시스템", "출원인": "주식회사 케이에스티모빌리티", "발명자": "정규홍"}}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "승객 운송 서비스와 연계된 운행 정보 제공 시스템에 있어서,승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동되고, 상기 차량 탑재 단말로부터 상기 차량의주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신하여 상기 주행 정보 및 상기 운송 정보를 표시하는운전자 단말;복수의 상기 운전자 단말로부터 상기 주행 정보 및 상기 운송 정보를 수신하고, 수신된 상기 주행 정보 및 상기운송 정보를 상기 차량 각각에 대하여 관리하고, 상기 차량에 탑승한 승객의 사용자 단말에 상기 주행 정보 및상기 운송 정보를 전송하는 통합 관리 서버; 및상기 통합 관리 서버로부터 상기 주행 정보 및 상기 운송 정보를 수신하여 상기 주행 정보 및 상기 운송 정보를표시하는 사용자 단말,를 포함하는, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 통합 관리 서버는,상기 차량 탑재 단말과 상기 운전자 단말의 연동 시, 상기 운전자 단말로부터 상기 차량에 대한 차종 정보, 차량 번호 정보, 운전자 정보 및 운행 범위 정보 중 적어도 하나를 포함하는 식별 정보를 수신하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 통합 관리 서버는,복수의 상기 운전자 단말 각각에 대하여 수신된 상기 식별 정보에 기초하여 소정의 상기 운전자 단말을 포함하는 적어도 하나 이상의 차량 그룹을 생성하고, 상기 차량 그룹 별로 상기 주행 정보 및 상기 운송 정보를 구분하여 관리하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 운송 정보는 상기 차량의 현재 위치 정보 및 상기 승객의 목적지 정보를 포함하고,상기 통합 관리 서버는,상기 차량의 현재 위치 정보 및 상기 승객의 목적지 정보 중 적어도 하나에 기초하여 위치 기반 광고 정보를 생성하고. 상기 사용자 단말에 상기 위치 기반 광고 정보를 전송하고,상기 사용자 단말은,상기 위치 기반 광고 정보를 표시하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 통합 관리 서버는,공개특허 10-2021-0096492-3-복수의 상기 운전자 단말로부터 획득된 상기 운송 정보에 기초하여 기 설정된 인공지능 알고리즘을 통해 승객밀집 영역을 도출하고, 상기 승객 밀집 영역에 기초하여 변동 요금 정보를 생성하여 상기 운전자 단말 및 상기사용자 단말 중 적어도 하나에 상기 변동 요금 정보를 전송하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 통합 관리 서버는,상기 운송 정보에 기초하여 승객 운송 서비스가 종료된 것으로 판단되면, 상기 사용자 단말에 운전자 평가 정보를 수신하기 위한 기 설정된 운전자 평가 항목을 전송하고, 상기 운전자 단말에 승객 평가 정보를 수신하기 위한 기 설정된 승객 평가 항목을 전송하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 통합 관리 서버는,상기 사용자 단말로부터 상기 운전자 평가 정보를 수신하고, 상기 주행 정보, 상기 운송 정보 및 상기 운전자평가 정보 중 적어도 하나에 기초하여 제1리워드 정보를 생성하고, 상기 운전자 단말로 상기 제1리워드 정보를전송하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 통합 관리 서버는,상기 운전자 단말로부터 상기 승객 평가 정보를 수신하고, 상기 승객 평가 정보에 기초하여 제2리워드 정보를생성하고, 상기 사용자 단말로 상기 제2리워드 정보를 전송하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 통합 관리 서버는,상기 사용자 단말로부터 배차 요청 신호 또는 부가서비스 요청 신호를 수신하면, 상기 배차 요청 신호 또는 상기 부가서비스 요청 신호에 대응하여 복수의 상기 운전자 단말 중 어느 하나를 매칭하되, 상기 매칭은 복수의상기 운전자 단말로부터 수신된 상기 주행 정보 및 상기 운송 정보에 기초하여 수행되는 것인, 운행 정보 제공시스템."}
{"patent_id": "10-2020-0010021", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 통합 관리 서버는,상기 운전자 단말로부터 상기 부가서비스 요청 신호를 수신하면, 상기 운전자 단말에 대한 부가서비스 예약 정보를 생성하여 상기 운전자 단말로 전송하는 것인, 운행 정보 제공 시스템."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "승객 운송 서비스와 연계된 운행 정보 제공 시스템이 개시되며, 본원의 일 실시예에 따른 승객 운송 서비스와 연 계된 운행 정보 제공 시스템은, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동되고, 상기 차량 탑재 단말로부터 상기 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신하여 상기 주행 정보 및 상기 운송 정보를 표시하는 운전자 단말, 복수의 상기 운전자 단말로부터 상기 주행 정보 및 상기 운송 정보를 수신하고, 수신된 상기 주행 정보 및 상기 운송 정보를 상기 차량 각각에 대하여 관리하고, 상기 차량에 탑승한 승객의 사용자 단말에 상기 주행 정보 및 상기 운송 정보를 전송하는 통합 관리 서버 및 상기 통합 관리 서버로 부터 상기 주행 정보 및 상기 운송 정보를 수신하여 상기 주행 정보 및 상기 운송 정보를 표시하는 사용자 단말 을 포함할 수 있다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 승객 운송 서비스와 연계된 운행 정보 제공 시스템에 관한 것이다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 택시 미터기는 주행거리, 주행시간, 주행속도 등의 각종 주행기록이 자동적으로 저장되고, 승객이 탑승한 경우에는 출발지로부터 목적지까지의 운행 거리와 운행 시간을 자동으로 계산한 후 계산된 시간과 거리에 따라 승객이 지불해야 하는 요금을 연산하여 표시 장치에 디스플레이 되도록 택시 내부에 설치되는 장치이다. 이와 관련하여, 최근에는 택시 운전자와 승객의 편의를 위해 관련 어플리케이션이 설치된 스마트 폰, 태블릿 등 의 택시용 앱 미터기를 택시 내부에 설치하여 이러한 택시용 앱 미터기를 통해서도 요금 정보나, 승차 정보 또 는 할증 정보 등을 조작 및 확인할 수 있는 동시에, 설치된 어플리케이션을 통한 택시 요금의 결제 서비스를 제 공하고 있다. 그러나, 이러한 종래의 택시용 앱 미터기는 해당 단말에 내장되어 있는 GPS 모듈의 GPS 신호를 기반으로 운행속 도를 거리로 계량하여 요금을 산정하고 있어, 택시가 터널 등의 GPS 신호가 잡히지 않는 지역을 통과하는 경우, 실제 택시 미터기에서 계량되는 요금과 불일치하는 현상이 발생할 수 있었다. 또한, 종래의 택시용 앱 미터기는 사용자 입력을 통해 빈차 상태/승차 상태를 전환하는 기능을 제공하고 있기는 하나, 이는 단순히 콜택시 서버 또는 콜택시 어플리케이션 등과 연동되어 콜 서비스를 제공받기 위해 빈차/승차 정보를 전송하기 위한 것일 뿐, 택시 미터기와는 직접 연동되어 작동되는 것은 아니므로, 차량 외부의 빈차 표 시등을 작동시키기 위해서는 택시용 앱 미터기와는 별도로 운전자가 택시 미터기를 따로 조작해야 하는 단점이 있다. 특히, 종래의 택시용 앱 미터기는 단지 택시 운행에 필요한 요금계량정보나, 빈차/승차 정보 또는 할증 정보 등 을 제공하고 있을 뿐, 차량 주행 기록을 수집하고 저장하는 기능을 제공하지는 못하고 있어, 택시 미터기의 기 능을 완전히 대체하지는 못하는 문제점이 있으며, 이에 따라 해당 차량의 주행 기록을 획득하기 위해서는 별도 의 저장 매체(SD 카드, USB 등)를 이용하여 택시 미터기로부터 Raw-Data 형태의 차량 주행 기록을 전송 받아 저 장해야 하는 번거로움이 있었다. 더욱이, 최근에는 택시 내에 별도의 콜택시 전용 단말기 및 별도의 통신호환장비를 구비하지 않고도 카카오택시, T맵 택시 등 이동통신 단말기에 설치된 콜택시 전용 어플리케이션을 통해 각기 다른 통신 프로토콜 을 이용하는 다수의 콜택시 관리 업체서버로부터 콜택시 접수를 받을 수 있게 되었다. 그러나, 상술한 카카오 택시, T맵 택시 등 이동통신 단말기에 설치된 콜택시 전용 어플리케이션을 통해 콜택시 의 접수를 받을 경우, 해당 차량 운전자는 자신의 이동통신 단말기에 설치된 어플리케이션으로 콜택시 접수정보 를 콜택시 업체 관리서버로 보낸 후, 별도로 차량 운행 상태가 예약 상태로 변경되도록 미터기를 수동 조작해야 하며, 콜택시 승객을 태운 후에도 이동통신 단말기의 어플리케이션을 통해 승객의 승차 확인 정보를 콜택시 업 체 관리 서버로 보낸 후, 다시 택시 미터기를 수동으로 조작하여 예약 상태의 차량 운행 상태를 주행 상태로 전 환하고, 택시 미터기가 요금 산출을 개시하도록 추가로 조작해야 했다. 이에 따라, 택시 차량 운전자가 어플리케이션 조작과 택시 미터기의 조작을 모두 정확하게 수행하지 못하면, 차 량 외부의 고객에게 정확한 차량상태 정보를 전달하지 못하여 기사와 차량 외부 고객 간의 승차거부 등에 따른 분쟁이 발생되는 일이 빈번하였으며, 택시 미터기의 운행요금 산출 시차에 따라 기사와 승객 간의 택시요금에 대한 잦은 분쟁이 발생할 수 있었다. 더불어, 택시 차량의 미터기와 콜택시 업체 관리서버 간의 택시 차량 상태 정보가 실시간으로 공유되지 못함에 따라, 승객이 탑승되어 있는 택시 차량임에도 불구하고, 콜배차 요청이 계속되어 이로 인한 소음으로 인해 승객 이 불쾌감을 느끼는 경우가 발생되었으며, 기사가 운행 중에도 택시 콜배차를 위해 스마트폰과 미터기를 조작해 야 함에 따라, 이에 따른 사고 발생이 빈번하게 일어나고 있는 실정이다. 본원의 배경이 되는 기술은 한국등록특허공보 제10-1883916호에 개시되어 있다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 택시 미터기와 택시 운전자의 운전자 단말을 연 동하고, 택시 미터기로부터 수집된 주행 정보 및 운송 정보를 연동된 운전자 단말과 승객의 사용자 단말에 표시 할 수 있는 승객 운송 서비스와 연계된 운행 정보 제공 시스템을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 다수의 운전자 단말을 통합 관리하고, 운전자 단 말들로부터 획득된 주행 정보에 기초하여 요금 정보 및 보상 정보를 책정하여, 탄력적이고 합리적인 요금 체계 와 보상 체계를 마련한 것을 특징으로 하는 승객 운송 서비스와 연계된 운행 정보 제공 시스템을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로, 택시 미터기와 운전자 단말의 연동 이후, 택시 미 터기와 운전자 단말을 중복하여 조작할 필요 없도록 하여 조작 편의성이 향상된 승객 운송 서비스와 연계된 운 전자 단말 및 통합 관리 서버와 그를 이용한 운행 정보 제공 및 관리 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 운행 정보 제공 시스템은, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동되고, 상기 차량 탑재 단말로부터 상기 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신하여 상기 주행 정보 및 상 기 운송 정보를 표시하는 운전자 단말, 복수의 상기 운전자 단말로부터 상기 주행 정보 및 상기 운송 정보를 수 신하고, 수신된 상기 주행 정보 및 상기 운송 정보를 상기 차량 각각에 대하여 관리하고, 상기 차량에 탑승한 승객의 사용자 단말에 상기 주행 정보 및 상기 운송 정보를 전송하는 통합 관리 서버 및 상기 통합 관리 서버로 부터 상기 주행 정보 및 상기 운송 정보를 수신하여 상기 주행 정보 및 상기 운송 정보를 표시하는 사용자 단말 을 포함할 수 있다. 또한, 상기 통합 관리 서버는, 상기 차량 탑재 단말과 상기 운전자 단말의 연동 시, 상기 운전자 단말로부터 상 기 차량에 대한 차종 정보, 차량 번호 정보, 운전자 정보 및 운행 범위 정보 중 적어도 하나를 포함하는 식별 정보를 수신할 수 있다. 또한, 상기 통합 관리 서버는, 복수의 상기 운전자 단말 각각에 대하여 수신된 상기 식별 정보에 기초하여 소정 의 상기 운전자 단말을 포함하는 적어도 하나 이상의 차량 그룹을 생성하고, 상기 차량 그룹 별로 상기 주행 정 보 및 상기 운송 정보를 구분하여 관리할 수 있다. 또한, 상기 운송 정보는 상기 차량의 현재 위치 정보 및 상기 승객의 목적지 정보를 포함할 수 있다. 또한, 상기 통합 관리 서버는, 상기 차량의 현재 위치 정보 및 상기 승객의 목적지 정보 중 적어도 하나에 기초 하여 위치 기반 광고 정보를 생성하고. 상기 사용자 단말에 상기 위치 기반 광고 정보를 전송할 수 있다. 또한, 상기 사용자 단말은, 상기 위치 기반 광고 정보를 표시할 수 있다. 또한, 상기 통합 관리 서버는, 복수의 상기 운전자 단말로부터 획득된 상기 운송 정보에 기초하여 기 설정된 인 공지능 알고리즘을 통해 승객 밀집 영역을 도출하고, 상기 승객 밀집 영역에 기초하여 변동 요금 정보를 생성하 여 상기 운전자 단말 및 상기 사용자 단말 중 적어도 하나에 상기 변동 요금 정보를 전송할 수 있다. 또한, 상기 통합 관리 서버는, 상기 운송 정보에 기초하여 승객 운송 서비스가 종료된 것으로 판단되면, 상기 사용자 단말에 운전자 평가 정보를 수신하기 위한 기 설정된 운전자 평가 항목을 전송하고, 상기 운전자 단말에 승객 평가 정보를 수신하기 위한 기 설정된 승객 평가 항목을 전송할 수 있다. 또한, 상기 통합 관리 서버는, 상기 사용자 단말로부터 상기 운전자 평가 정보를 수신하고, 상기 주행 정보, 상 기 운송 정보 및 상기 운전자 평가 정보 중 적어도 하나에 기초하여 제1리워드 정보를 생성하고, 상기 운전자 단말로 상기 제1리워드 정보를 전송할 수 있다. 또한, 상기 통합 관리 서버는, 상기 운전자 단말로부터 상기 승객 평가 정보를 수신하고, 상기 승객 평가 정보 에 기초하여 제2리워드 정보를 생성하고, 상기 사용자 단말로 상기 제2리워드 정보를 전송할 수 있다. 또한, 상기 사용자 단말로부터 배차 요청 신호 또는 부가서비스 요청 신호를 수신하면, 상기 배차 요청 신호 또 는 상기 부가서비스 요청 신호에 대응하여 복수의 상기 운전자 단말 중 어느 하나를 매칭할 수 있다. 또한, 상기 매칭은, 복수의 상기 운전자 단말로부터 수신된 상기 주행 정보 및 상기 운송 정보에 기초하여 수행 되는 것일 수 있다. 또한, 상기 통합 관리 서버는, 상기 운전자 단말로부터 상기 부가서비스 요청 신호를 수신하면, 상기 운전자 단 말에 대한 부가서비스 예약 정보를 생성하여 상기 운전자 단말로 전송할 수 있다. 또한, 본원의 일 실시예에 따른 운전자 단말을 이용한 운행 정보 제공 방법은, 상기 주행 정보 및 상기 운송 정 보를 승객 운송 서비스와 연계된 통합 관리 서버로 전송하는 단계를 포함할 수 있다. 또한, 상기 주행 정보는 상기 차량의 속도 정보, 가속 정보, 감속 정보 및 주행 거리 정보 중 적어도 하나를 포 함하고, 상기 운송 정보는 운송 서비스 개시 정보, 승객 정보, 탑승 장소 정보, 탑승 시간 정보, 목적지 정보 및 요금 정보 중 적어도 하나를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 운전자 단말을 이용한 운행 정보 제공 방법은, 상기 통합 관리 서버로부터 기 설정된 인공지능 알고리즘에 기초하여 결정된 변동 요금 정보를 수신하는 단계를 포함할 수 있다. 또한, 상기 표시하는 단계는, 상기 변동 요금 정보에 기초하여 상기 주행 정보 및 상기 운송 정보 중 적어도 하 나를 표시할 수 있다. 또한, 본원의 일 실시예에 따른 운전자 단말을 이용한 운행 정보 제공 방법은, 상기 통합 관리 서버로부터 배차 요청 신호에 기초한 탑승 예약 정보를 수신하는 단계를 포함할 수 있다. 또한, 상기 표시하는 단계는, 상기 탑승 예약 정보를 표시하는 단계를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방 법은, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동된 운전자 단말로부터 상기 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신하는 단계, 상기 주행 정보 및 상기 운송 정보를 기초로 하여 상기 운송 정보에 포함된 요금 정보를 갱신하여 변동 요금 정보를 생성하는 단계 및 상기 운전자 단말에 상기 변동 요금 정보를 전송하는 단계를 포함할 수 있다. 또한, 상기 변동 요금 정보를 생성하는 단계는, 복수의 상기 운전자 단말로부터 획득된 상기 운송 정보에 기초 하여 기 설정된 인공지능 알고리즘을 통해 승객 밀집 영역을 도출하고, 상기 승객 밀집 영역에 기초하여 상기 변동 요금 정보를 생성할 수 있다. 또한, 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방 법은, 상기 주행 정보 및 상기 운송 정보를 상기 차량에 탑승한 승객의 사용자 단말에 전송하는 단계를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방 법은, 상기 운송 정보에 기초하여 상기 승객 운송 서비스가 종료된 것으로 판단되면, 상기 사용자 단말로부터 상기 운전자에 대한 평가 정보를 수신하는 단계 및 상기 주행 정보, 상기 운송 정보 및 상기 평가 정보에 기초 하여 리워드 정보를 생성하고, 상기 리워드 정보를 상기 운전자 단말로 전송하는 단계를 포함할 수 있다. 또한, 상기 운송 정보는 상기 차량의 현재 위치 정보 및 상기 승객의 목적지 정보를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방 법은, 상기 차량의 현재 위치 정보 및 상기 승객의 목적지 정보 중 적어도 하나에 기초하여 위치 기반 광고 정 보를 생성하는 단계 및 상기 사용자 단말에 상기 위치 기반 광고 정보를 전송하는 단계를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 운행 정보 제공을 위한 운전자 단말은, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 상기 운전자 단말을 연동하는 연동부, 상기 차량 탑재 단말로부터 상기 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신하는 수신부 및 상기 주행 정보 및 상기 운송 정보를 표시하는 표 시부를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 승객 운송 서비스에 대한 운행 정보 관리를 위한 통합 관리 서버는, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동된 운전자 단말로부터 상기 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신하고, 상기 운전자 단말에 갱신된 요금 정보를 전송하는 통신부 및 상기 주행 정보 및 상기 운송 정보를 기초로 하여 상기 운송 정보에 포함된 요금 정보를 갱신하는 요금 설정부를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 택시 미터기와 택시 운전자의 운전자 단말을 연동하고, 택시 미터기로 부터 수집된 주행 정보 및 운송 정보를 연동된 운전자 단말과 승객의 사용자 단말에 표시할 수 있는 승객 운송서비스와 연계된 운행 정보 제공 시스템을 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 다수의 운전자 단말을 통합 관리하고, 운전자 단말들로부터 획득된 주 행 정보에 기초하여 요금 정보 및 보상 정보를 책정하여, 탄력적이고 합리적인 요금 체계와 보상 체계를 마련한 것을 특징으로 하는 승객 운송 서비스와 연계된 운행 정보 제공 시스템을 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 택시 미터기와 운전자 단말의 연동 이후, 택시 미터기와 운전자 단말 을 중복하여 조작할 필요 없도록 하여 조작 편의성이 향상된 승객 운송 서비스와 연계된 운전자 단말 및 통합 관리 서버와 그를 이용한 운행 정보 제공 및 관리 방법을 제공할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 승객 운송 서비스와 연계된 운전자 단말 및 통합 관리 서버와 그를 이용한 운행 정보 제공 및 관리 방법 에 관한 것이다. 도 1은 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 운행 정보 제공 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 운행 정보 제공 시스템은, 운행 정 보 제공을 위한 운전자 단말(이하, '운전자 단말'라 한다.), 승객 운송 서비스에 대한 운행 정보 관 리를 위한 통합 관리 서버(이하, '통합 관리 서버'라 한다.), 사용자 단말 및 차량 탑재 단말 을 포함할 수 있다. 운전자 단말, 통합 관리 서버, 사용자 단말 및 차량 탑재 단말 상호간은 네트워크를 통해 통신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교환이 가능한 연결구조를 의미하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트 워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워 크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함 되나 이에 한정되지는 않는다. 운전자 단말 및 사용자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC 등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다. 본원의 실시예에 관한 설명에서, 사용자 단말은 본원의 승객 운송 서비스를 영위하려는 사용자의 단말기 등일 수 있으며, 운전자 단말은 본원의 승객 운송 서비스를 제공하기 위한 차량과 연계된 단말기 등일 수 있다. 특히, 도 1을 참조하면, 사용자 단말은 차량에서 승객이 탑승하는 좌석에 대하여 마련되는 태블릿 형태 의 좌석 단말(300a)을 포함할 수 있다. 또한, 본원의 실시예에 관한 설명에서 차량 탑재 단말은, 택시 미터기(타코미터)를 포함할 수 있으나, 이 에만 한정되는 것은 아니다. 다른 예로, 차량 탑재 단말은 블랙박스 단말, 내비게이션 모듈, 하이패스 모 듈 또는 커넥티드 카 모빌리티 서비스 모듈 등 차량 탑재 단말이 탑재된 차량의 운행 정보를 수집할 수 있 는 각종 디바이스를 폭넓게 포함하는 개념으로 이해될 수 있다. 운전자 단말은, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동될 수 있다. 또한, 운전자 단말은 차량 탑재 단말로부터 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보 를 수신할 수 있다. 또한, 운전자 단말은 수신된 주행 정보 및 운송 정보를 표시할 수 있다. 또한, 운전자 단말은, 통합 관리 서버로부터 사용자 단말에 의해 요청된 배차 요청 신호에 기초 한 탑승 예약 정보를 수신할 수 있다. 또한, 운전자 단말은, 수신된 탑승 예약 정보를 표시할 수 있다. 본원의 실시예에 관한 설명에서 주행 정보는 차량의 주행과 직, 간접적으로 연계되는 정보를 의미하는 것으 로 이해될 수 있다. 구체적으로 본원의 일 실시예에 따른 주행 정보는, 주행 거리 정보, 주행 속도 정보, 신호 위반 이력 정보, 주요 운행 시간대 정보, 가감속 이력 정보, 주요 운행 구간 정보 등을 포함할 수 있다. 여기서 운행 정보는 실시예에 따라 수치 데이터 형식, 음성 데이터 형식, 영상 데이터 형식 등 다양한 포맷으로 결정될 수 있다. 특히, 주행 정보는 후술하는 운송 정보와 달리, 승객 운송 서비스 제공 상태(예를 들면, 승객 탑승 여 부)와 무관하게 해당 차량에 대하여 지속적으로 수집되는 것으로 이해될 수 있다. 또한, 본원의 실시예에 관한 설명에서 운송 정보는 승객 운송 서비스 제공을 위해 수집 및 관리되는 정보를 폭 넓게 의미하는 것으로 이해될 수 있다. 구체적으로 본원의 일 실시예에 따른 운송 정보는, 운송 서비스 개시 정 보, 승객 정보, 탑승 장소 정보, 탑승 시간 정보, 목적지 정보, 요금 정보, 승객이 탑승하여 목적지로 이동 중 인 차량의 현재 위치 정보, 승객의 목적지 정보, 운송 서비스와 연계된 차량 상태 정보 등을 포함할 수 있다. 여기서, 특히 운송 서비스와 연계된 차량 상태 정보는 해당 차량이 주행 상태, 예약 상태, 빈차 상태 및 휴 무 상태 중 어느 상태에 해당하는지를 나타내는 정보를 의미하는 것일 수 있다. 특히, 본원에서의 운송 서비스 와 연계된 차량 상태 정보는 운전자 단말에 인가되는 사용자(운전자)의 사용자 입력에 기초하여 통합 관리 서버에 전달될 뿐만 아니라, 운전자 단말과 연동된 차량 탑재 단말에 해당 차량 탑재 단말(40 0)에 대한 별도 조작이 없이도 반영될 수 있다. 예를 들어, 승객이 탑승한 경우, 운전자가 운전자 단말에 운송 서비스와 연계된 차량 상태 정보를 주행 상태로 전환하는 사용자 입력을 인가하면, 차량 탑재 단말 (예를 들면, 택시 미터기)의 동작 및 표시나 차량 외부에 마련된 표시등의 점멸등 표시가 해당 사용자 입력 에 동기화되어 변경될 수 있으며, 이는 다른 유형의 상태로의 전환에서 동일하게 적용될 수 있다. 본원의 일 실시예에 따르면, 차량 탑재 단말과 운전자 단말의 연동 시, 운전자 단말은 차량에 대한 차종 정보, 차량 번호 정보, 운전자 정보 및 운행 범위 정보 중 적어도 하나를 포함하는 식별 정보를 사용 자 입력으로 수신하도록 구현될 수 있다. 운전자 단말은 차량 탑재 단말과의 연동 프로세스가 완료되면 수신된 사용자 입력을 통합 관리 서버로 전송할 수 있다. 차량 탑재 단말과 운전자 단말의 연동 프로세스 및 연동 시 운전자 단말의 화면 상에 표출되는 인터페이스는 도 2a 및 도 2b를 참조하여 상 세히 후술하도록 한다. 통합 관리 서버는, 복수의 운전자 단말로부터 주행 정보 및 운송 정보를 수신하고, 수신된 주행 정보 및 운송 정보를 차량 각각에 대하여 관리할 수 있다. 또한, 통합 관리 서버는 차량에 탑승한 승객의 사 용자 단말에 승객이 탑승한 차량에 대한 주행 정보 및 운송 정보를 전송할 수 있다. 본원의 일 실시예에 따르면, 통합 관리 서버는, 복수의 운전자 단말 각각에 대하여 수신된 식별 정보 에 기초하여 소정의 운전자 단말을 포함하는 적어도 하나 이상의 차량 그룹을 생성하고, 차량 그룹 별로 주행 정보 및 운송 정보를 구분하여 관리할 수 있다. 본원의 일 실시예에 따르면, 차량 그룹은 운행 범위 정보 에 기초하여 같은 운행 범위(예를 들면, 서울 택시, 경기 택시 등 지역적 운행 범위가 구분되는 경우)를 갖는 운전자 단말을 그룹핑함으로써 생성되는 것일 수 있으나, 이에만 한정되는 것은 아니다. 다른 예로, 운전 자 단말 각각에서 수집된 총 주행 거리, 운전자 인적사항, 주요 주행 시간대, 차종 정보 등에 기초하여 소 정의 기준에 따라 그룹핑이 수행되는 것일 수 있다. 또한, 본원의 일 실시예에 따르면, 통합 관리 서버는, 복수의 주행 정보 및 운송 정보를 기초로 하여 소정 의 차량에 대하여 수신된(달리 말해, 소정의 운전자 단말로부터 전송된) 운송 정보에 포함된 요금 정보를 갱신할 수 있다. 또한, 통합 관리 서버는, 운전자 단말 및 사용자 단말 중 적어도 하나에 갱신 된 요금 정보를 전송할 수 있다. 여기서, 갱신된 요금 정보는 변동 요금 정보로 달리 지칭될 수 있다. 달리 말해, 통합 관리 서버는 차량을 통해 제공되는 승객 운송 서비스에 대한 전체적인 요금 체계를 복 수의 운전자 단말로부터 수집된 주행 정보 및 운행 정보에 기초하여 결정하거나, 특수한 상황에서 제공된 승객 운송 서비스에 대하여는 할증 또는 할인이 이루어지도록 개별적인 운전자 단말 각각에 대하여 적용되 는 변동 요금 정보를 상이하게 적용하도록 구현될 수 있다. 예를 들어, 통합 관리 서버는 복수의 운전자 단말로부터 수집된 주행 정보 및 운행 정보에 기초하여 주행 당 요금, 시간 당 요금, 할증 관련 요금 등을 다양하게 책정할 수 있고, 이러한 요금 체계 책정 과정에서 인공지능 기반의 분석 시스템을 활용할 수 있다. 즉, 본원에 의할 때 승객 운송 서비스에 대한 수요/공급을 보다 정확하게 반영한 탄력적 요금 체계를 정립할 수 있다. 본원의 일 실시예에 따르면, 통합 관리 서버는, 복수의 운전자 단말로부터 획득된 운송 정보에 기초 하여 기 설정된 인공지능 알고리즘을 통해 승객 밀집 영역을 도출할 수 있다. 또한, 통합 관리 서버는, 도 출된 승객 밀집 영역에 기초하여 변동 요금 정보를 생성할 수 있다. 또한, 통합 관리 서버는, 운전자 단말 및 사용자 단말 중 적어도 하나에 변동 요금 정보를 전송할 수 있다. 구체적으로 본원의 일 실시예에 따르면, 통합 관리 서버는, 복수의 운전자 단말로부터 획득된 운송 정보 중 승객 탑승 장소 정보에 기초하여 기 설정된 인공지능 알고리즘을 통해 승객 밀집 영역을 도출할 수 있 다. 또한, 통합 관리 서버는 도출된 승객 밀집 영역에 대한 요금이 승객 밀집 영역 이외의 영역에 대한 요 금보다 높게 책정되도록 요금 정보를 산출할 수 있다. 예를 들어, 통합 관리 서버는 도출된 승객 밀집 영 역에서 승객이 탑승한 경우 또는 승객 밀집 영역에서 출발하려는 배차 요청이 수신된 경우 적용되는 요금이 높 게 책정되도록 하고, 이러한 변동 요금 정보를 운전자 단말로 전송함으로써, 수요가 높은 지역 범위에 다 수의 승객 운송 서비스 제공 차량이 배치되도록 유도하여 승객 밀집 영역에 위치한 탑승객의 차량 대기 시간을 저감시키고, 운전자에게 합당한 보상이 이루어지도록 할 수 있다. 또한, 본원의 일 실시예에 따르면 통 합 관리 서버는 복수의 사용자 단말로부터 획득된 배차 요청 신호에 포함된 탑승 희망 장소 정보를 종합적으로 고려하여 기 설정된 인공지능 알고리즘을 통해 상술한 승객 밀집 영역을 도출하도록 동작할 수 있다. 종합하면, 통합 관리 서버는, 복수의 운전자 단말 또는 사용자 단말로부터 획득된 운송 정보, 배차 요청 신호 등을 종합하여 현재 시점을 기준으로 다수의 승객에 의한 탑승이 이루어지거나 다수의 사용자가 승객 운송 서비스 호출을 요청한 지역적 범위(승객 밀집 지역)를 결정하고, 기 설정된 인공지능 알고리즘을 통 해 해당 승객 밀집 지역에 대한 소정의 시간 동안의 수요 변동성을 예측하여, 적용될 변동 요금의 변동폭과 변 동 요금의 적용 시간을 결정하여 변동 요금 정보를 생성할 수 있다. 또한, 통합 관리 서버의 기 생성된 인 공지능 알고리즘은 지속적으로 누적된 운송 정보, 배차 요청 신호 등을 종합하여 운행 지역 각각의 시간대별/요 일별/계절별 승객 운송 서비스에 대한 수요를 예측하고, 예측된 수요에 따라 요금 체계가 변동되도록 변동 요금 정보를 생성할 수 있다.또한, 본원의 일 실시예에 따르면, 상술한 승객 밀집 영역 분석에 사용되는 인공지능 알고리즘은 기계학습(머신 러닝) 모델, 신경망 모델(인공 신경망 모델), 뉴로 퍼지 모델, 지도 학습 기반의 모델, 비지도 학습 기반의 모 델 등을 폭넓게 포함할 수 있다. 또한, 승객 밀집 영역 분석에 사용되는 인공지능 알고리즘은 종래에 이미 공지 되었거나 향후 개발되는 다양한 인공지능 알고리즘 모델이 적용될 수 있다. 사용자 단말은, 통합 관리 서버로부터 주행 정보 및 운송 정보를 수신하고, 주행 정보 및 운송 정보 를 표시할 수 있다. 또한, 본원의 일 실시예에 따르면, 사용자 단말이 승객이 탑승하는 좌석에 대하여 마 련되는 태블릿 형태의 좌석 단말(300a)인 경우, 좌석 단말(300a)은 좌석 단말(300a)에 인가되는 언어 선택 입력 에 기초하여, 주행 정보 및 운송 정보를 선택된 언어로 번역하여 출력할 수 있다. 또한, 본원의 일 실시예에 따르면, 사용자 단말을 통해 승객 운송 서비스의 요금에 대한 지불(결제)이 처 리될 수 있다. 예를 들어, 후술하는 도 3a와 같은 메인 페이지 인터페이스가 차량에 탑승한 승객의 사용자 단말에 표시되되, 사용자 단말의 사용자는 승객 운송 서비스 종료 후 '지불'버튼을 선택함으로써 요 금을 지불할 수 있도록 구현될 수 있으며, 실시예에 따라, 사용자 단말의 사용자가 만족도에 따른 추가 비 용, 부가서비스 요청 비용, 호출비, 예약비 등을 현재 산출된 요금에 합산하여 결제할 수 있다. 본원의 일 실시예에 따르면, 통합 관리 서버는, 획득된 운송 정보 중 차량의 현재 위치 정보 및 승객의 목 적지 정보 중 적어도 하나에 기초하여 위치 기반 광고 정보를 생성할 수 있다. 또한, 통합 관리 서버는, 해당 차량에 탑승한 승객의 사용자 단말에 생성된 위치 기반 광고 정보를 전송할 수 있다. 이후, 사용 자 단말은 수신된 위치 기반 광고 정보를 표시할 수 있다. 본원의 일 실시예예 따르면, 사용자 단말 에서 표시되는 위치 기반 광고 정보는 사용자 단말에 인가되는 광고 정보 표시 요청과 관련된 사용자 입력 에 기초하여 표시되는 것일 수 있으나, 이에만 한정되는 것은 아니다. 본원의 일 실시예에 따르면, 위치 기반 광고 정보는 차량의 현재 위치 또는 승객의 목적지와 기 설정된 거리 범위 내에 위치하는 음식점, 관광 명소, 공연장, 숙소, 편의 시설 정보 등을 포함하는 것일 수 있다. 또한, 본원의 일 실시예에 따르면, 통합 관리 서버는, 운송 정보에 기초하여 소정의 차량에 대해 승객 운송 서비스가 종료된 것으로 판단되면(예를 들어, 차량의 위치 정보가 승객의 목적지에 소정 이상 근접하여 승객 운송 서비스가 소정의 시간 이내 또는 소정의 거리 이동 이내에 종료될 것으로 판단되는 경우를 포함한 다.), 사용자 단말에 운전자 평가 정보를 수신하기 위한 기 설정된 운전자 평가 항목을 전송할 수 있다. 또한, 통합 관리 서버는, 운전자 단말에 승객 평가 정보를 수신하기 위한 기 설정된 승객 평가 항목 을 전송할 수 있다. 또한, 통합 관리 서버는, 사용자 단말로부터 운전자 평가 정보를 수신하고, 해당 운전자 단말에 대하여 누적된 주행 정보, 운송 정보 및 운전자 평가 정보 중 적어도 하나에 기초하여 제1리워드 정보를 생성할 수 있다. 또한, 통합 관리 서버는, 운전자 단말로 제1리워드 정보를 전송할 수 있다. 본원의 일 실시예에 따르면, 제1리워드 정보는 운전자 단말의 사용자(운전자)에게 지급되는 인센티브로 이 해될 수 있으며, 본원의 일 실시예에 따르면, 제1리워드는 소정 기준 도달 시마다 누적되는 포인트 형태로 지급 되는 것일 수 있다. 예를 들어, 총 주행 거리가 소정 거리 이상인 경우, 승객으로부터 수신된 운전자 평가 정보 가 우수한 경우, 주행 정보에 기초하여 산출되는 운행 행태가 올바른 경우(예를 들면, 200km 이상 과속하지 않 는 경우, 100km 이상 급가속, 급브레이크가 없는 경우 등) 상술한 포인트가 누적되는 것일 수 있다. 또한, 본원 의 일 실시예에 따르면, 운전자 단말에 지급되는 제1리워드는 블록체인 네트워크와 연계된 토큰, 코인 등 의 가상화폐 유형으로 지급되는 것일 수 있다. 또한, 본원의 일 실시예에 따르면, 운전자에게 지급되는 제1리워 드와 연계된 포인트는 Driving Point로 달리 지칭될 수 있다. 또한, 통합 관리 서버는, 운전자 단말로부터 승객 평가 정보를 수신하고, 수신된 승객 평가 정보에 기초하여 해당 사용자 단말에 대한 제2리워드 정보를 생성할 수 있다. 또한, 통합 관리 서버는, 사용 자 단말로 생성된 제2리워드 정보를 전송할 수 있다. 본원의 일 실시예에 따르면, 제2리워드 정보는 사용자 단말의 사용자(승객)에게 지급되는 인센티브 혹은 마일리지로 이해될 수 있으며, 본원의 일 실시예에 따르면, 제2리워드는 소정 기준 도달 시마다 누적되는 포인 트 형태로 지급되는 것일 수 있다. 예를 들어, 설치된 전용 어플리케이션을 통해 배차 요청 신호 또는 부가서비 스 요청 신호를 통합 관리 서버 전송할 때마다 소정의 포인트가 지급되거나, 승객 운송 서비스 참여 후, 운전자 평가 정보를 제공할 때마다 포인트가 지급되거나, 운전자로부터 수신된 승객 평가 정보가 우수한 경우 등의 상황에 상술한 포인트가 누적되는 것일 수 있다. 또한, 본원의 일 실시예에 따르면, 운전자 단말에지급되는 제2리워드는 블록체인 네트워크와 연계된 토큰, 코인 등의 가상화폐 유형으로 지급되는 것일 수 있다. 또한, 본원의 일 실시예에 따르면, 운전자에게 지급되는 제2리워드와 연계된 포인트는 Riding Point로 달리 지 칭될 수 있다. 또한, 본원의 일 실시예예 따르면, 통합 관리 서버는, 사용자 단말로부터 배차 요청 신호 또는 부가 서비스 요청 신호를 수신하면, 배차 요청 신호 또는 부가서비스 요청 신호에 대응하여 복수의 운전자 단말 중 어느 하나의 운전자 단말을 매칭할 수 있다. 구체적으로, 통합 관리 서버는, 복수의 운전자 단말 로부터 수신된 주행 정보 및 운송 정보를 종합하여 배차 요청 신호 또는 부가서비스 요청 신호에 대응하여 승객 운송 서비스를 제공하거나 부가서비스를 제공할 차량을 매칭하고 매칭된 차량에 대한 운전자 단말 에 매칭 결과를 전송할 수 있다. 달리 말해, 배차 요청 신호 또는 부가서비스 요청 신호에 따른 매칭은 복 수의 운전자 단말로부터 수신된 주행 정보 및 운송 정보에 기초하여 수행되는 것일 수 있다. 또한, 본원의 일 실시예에 따른 통합 관리 서버는, 운전자 단말로부터 부가서비스 요청 신호를 수신 하면, 해당 운전자 단말에 대한 부가서비스 예약 정보를 생성하고, 생성된 부가서비스 예약 정보를 운전자 단말로 전송할 수 있다. 도 2a 및 도 2b는 차량 탑재 단말과 운전자 단말의 연동 과정을 설명하기 위한 도면이다. 구체적으로, 도 2a는 차량 탑재 단말에 대한 최초 연동 시 운전자 단말의 디스플레이에 표시되는 화 면을 예시적으로 나타낸 도면이고, 도 2b는 이전 시점에 연동된 이력이 있는 차량 탑재 단말에 대한 연동 시 운전자 단말의 디스플레이에 표시되는 화면을 예시적으로 나타낸 도면이다. 본원의 일 실시예에 따르면, 차량 탑재 단말과 운전자 단말의 연동은 블루투스(Bluetooth) 페어링을 의미하는 것일 수 있 으나, 이에만 한정되는 것은 아니다. 도 2a를 참조하면, 차량 탑재 단말과 운전자 단말 간의 블루투스 페어링 상태 확인을 위한 시작 페이 지가 출력(a)된 후, 소정 시간 이상 블루투스 페어링이 인식되지 않으면, 블루투스 페어링 수행을 요청하는 화 면이 출력(b)되고, 인식된 차량 탑재 단말이 존재하는 경우, 인식된 차량 탑재 단말에 대한 차량 정 보를 확인하는 화면이 출력(c)될 수 있다. 본원의 일 실시예에 따르면, 차량 정보를 확인하는 화면(c)의 경우, 인식된 차량 탑재 단말에 대한 디바이스 정보가 통합 관리 서버에 존재하지 않는 경우에는 차량 모델 및 차량 번호 입력란이 공백으로 표시되되, 운전자 단말의 사용자가 인식된 차량 탑재 단말에 대한 식별 정보를 입력하도록 하는 화면이 출력될 수 있다. 또한, 도 2a의 (b)를 참조하면, 운전자 단말에 대하여 페어링된 차량 탑재 단말이 미존재하거나 이전 에 페어링되었던 차량 탑재 단말(도 2a를 기준으로, 기기명이 MOBILIGENT T에 해당하는 차량 탑재 단말)이 아닌 차량 탑재 단말이 인식된 경우, 블루투스 설정 페이지로 이동 가능한 블루투스 설정 버튼이 표시되는 것일 수 있다. 또한, 도 2a의 (c)를 참조하면, 운전자 단말의 사용자(운전자)가 인식된 차량 탑재 단말에 대한 차량 정보를 확인하는 화면에 표출된 정보 확인 완료에 대한 사용자 입력을 인가하면(예를 들어, 도 2a의 (c)의 '예' 버튼을 터치하는 입력을 인가하면) 통합 관리 서버에 등록된 운전자 정보 및 식별 정보가 연결(매칭)되고, 도 3a 내지 도 3f에서 후술하는 메인 페이지가 표출될 수 있다. 또한, 도 2a의 (d)를 참조하면, 운전자 단말의 사용자(운전자)는 차량에 대한 식별 정보가 올바르지 않은 경우, 차량에 대한 식별 정보를 수정할 수 있다(정보 수정 요청). 도 2b를 참조하면, 페어링된 차량 탑재 단말의 정보가 올바른 경우(연결된 운전자 단말에 대한 운전 자 정보 및 차량에 대한 식별 정보가 통합 관리 서버에 등록된 것과 일치하는 경우), 운전자 단말의 화면에는 도 3a 내지 도 3f에서 후술하는 메인 페이지(c)가 표출될 수 있다. 또한, 도 2b의 (d)를 참조하면, 운 전자 단말에 대한 운전자 정보 및 차량에 대한 식별 정보가 통합 관리 서버에 등록된 것과 일치하지 않는 경우, 통합 관리 서버에 올바른 운전자 정보 또는 차량에 대한 식별 정보를 새로이 전달할 수 있도록 구비되는 신규 설정 페이지(d)가 표출될 수 있다. 도 3a 내지 도 3f는 주행 정보와 운송 정보가 표시되는 운전자 단말의 화면 인터페이스를 예시적으로 나타낸 도 면이다. 또한, 본원의 일 실시예에 따르면, 차량에 탑승한 승객의 사용자 단말 또는 승객 운송 서비스 를 예약하려는 사용자의 사용자 단말을 통해 주행 정보 및 운송 정보 중 적어도 하나를 표시하는 경우, 도 3a 내지 도 3f를 통해 후술하는 운전자 단말 용 인터페이스가 사용자 단말에도 대응되는 형태로 구현되어 출력될 수 있다. 구체적으로, 도 3a는 운전자 단말의 화면에 표시되는 메인 페이지를 예시적으로 나타낸 도면이고, 도 3b는 차량에 승객이 탑승하여 승객 운송 서비스가 제공되고 있는 상태(예를 들면, 주행 상태)에서 운전자 단말 의 화면에 표시되는 인터페이스를 예시적으로 나타낸 도면이고, 도 3c는 승객 운송 서비스에 대한 지불 처리 과 정에서 운전자 단말의 화면에 표시되는 요금 확인을 위한 인터페이스를 예시적으로 나타낸 도면이고, 도 3d는 사용자 단말에 의해 요청된 배차 요청 신호 또는 부가서비스 요청 신호에 대응하여 매칭된 예약 내역 을 표시하는 인터페이스를 예시적으로 나타낸 도면이고, 도 3e는 운전자 단말을 통해 부가서비스를 예약하 고 예약된 부가서비스에 대한 정보를 표시하기 위한 인터페이스를 예시적으로 나타낸 도면이고, 도 3f는 운전자 단말을 통한 주행 경로 안내를 위한 내비게이션 화면에 위젯(Widget) 형태로 오버레이하여 주행 정보 및 운송 정보 중 적어도 하나를 표시하기 위한 인터페이스를 예시적으로 나타낸 도면이다. 본원의 일 실시예에 따르면, 도 3b의 인터페이스는 도 3a에 도시된 메인 페이지에서 운전자 단말의 사용자 (운전자)가 '주행'버튼을 선택(터치 또는 클릭)하여 해당 차량의 상태가 주행 상태로 변경되는 경우 출력되 는 것일 수 있다. 또한, 도 3c의 인터페이스는 도 3a에 도시된 메인 페이지에서 운전자 단말의 사용자(운 전자)가 '지불'버튼을 선택(터치 또는 클릭)하여 승객 운송 서비스와 연계된 요금 정보를 표시하고 나아가 요금 에 대한 결제를 수행하는 경우 출력되는 것일 수 있다. 또한, 도 3d의 인터페이스는 도 3a에 도시된 메인 페이 지에서 운전자 단말의 사용자(운전자)가 '예약 내역'버튼을 선택(터치 또는 클릭)하는 경우 출력되는 것일 수 있다. 또한, 도 3e의 인터페이스는 도 3a에 도시된 메인 페이지에서 운전자 단말의 사용자(운전자)가 '부가 서비스'버튼을 선택(터치 또는 클릭)하는 경우 출력되는 것일 수 있다. 도 3a를 참조하면, 본원의 일 실시예에 따른 운전자 단말에는 현재 날짜/시간 정보 및 차량에 대한 식별 번호가 표시될 수 있다. 또한, 도 3a를 참조하면, 본원의 일 실시예에 따른 운전자 단말에는 요금 산출 시에 적용되는 시외 할증 또는 심야 할증을 포함하는 할증 적용 여부에 대한 정보가 표시될 수 있다. 구체적으로, 운전자 단말 에는 시외 할증 또는 심야 할증 중 적어도 하나의 적용에 따른 할증 요금 비율 정보(32c)가 표시될 수 있다. 예 시적으로, 할증 요금 비율 정보는 퍼센트(%) 단위로 표시되는 것일 수 있다. 또한, 운전자 단말에는 해당 차량에 승객이 탑승한 경우 활성화되는 주행 상태 표시 아이콘(32a) 및 요금이 추가될 때까지 남은 시간 또 는 거리 정보가 표시(32b)될 수 있다. 또한, 도 3a를 참조하면, 본원의 일 실시예에 따른 운전자 단말에는 운송 정보 중 요금 정보가 표시될 수 있다. 구체적으로, 요금 정보가 표시되는 영역에는 총 합계 요금 정보, 부가서비스 등을 포함하는 상세 요 금 정보 등이 표시될 수 있으며, 상세 요금 정보는 적용된 부가서비스 각각에 대한 목록 형태로 제공될 수 있다. 또한, 도 3a를 참조하면, 본원의 일 실시예에 따른 운전자 단말에는 운전자 단말의 사용자(운전자)에 의한 조작 입력을 수신하기 위한 복수의 버튼(주행, 지불, 예약 내역, 부가서비스 등)이 표시될 수 있다. 본원의 일 실시예에 따르면, 운전자 단말의 사용자(운전자)가 복수의 버튼 중 일부를 선택하는 조작 입력 을 인가하면, 해당 차량에 대한 주행 상태가 변동되거나, 요금 결제가 진행되거나, 해당 차량에 대해 매 칭된 예약 내역이 표시되거나, 부가서비스를 요청할 수 있는 인터페이스가 표시될 수 있으며, 운전자 단말(10 0)을 통해 인가된 조작 입력에 의해 해당 운전자 단말에 대하여 연동된 차량 탑재 단말에 대한 조작 이 동기화되어 함께 수행될 수 있다. 도 3b를 참조하면, 통합 관리 서버는 해당 차량이 주행되는 현재 위치 정보 또는 시간대 정보에 기초하 여 시외 할증 적용 여부 또는 심야 할증 적용 여부를 결정하여 운전자 단말에 전송할 수 있다. 또한, 도 3b를 참조하면, 운전자 단말의 화면에는 전송된 시외 할증 적용 여부 및 심야 할증 적용 여부가 표시될 수 있다. 예를 들어, 시외 할증이 적용되면 메인 페이지에 마련된 '시외' 버튼의 색상이 변경되고, 심야 할증이 적 용되면 메인 페이지에 마련된 '심야' 버튼의 색상이 변경될 수 있다. 또한, 운전자 단말은 시외 할증 적용 여부 또는 심야 할증 적용 여부에 따른 할증 요금 비율 정보(32c)를 표시(예를 들어, 도 3b를 참조하면, 20%로 표시)할 수 있다. 도 3c를 참조하면, 운전자 단말은 운행 요금 및 추가 요금을 포함하는 요금 정보를 표시할 수 있다. 예를 들어, 운행 요금은 차량 탑재 단말로부터 획득된 운송 정보에 포함된 승객 탑승지로부터 목적지까지의 거 리 정보 또는 소요 시간 정보에 기초하여 결정되는 것일 수 있다. 또한, 추가 요금은 부가서비스 요금 정보를포함할 수 있다. 또한, 본원의 일 실시예에 따르면, 운전자 단말의 사용자(운전자)는 '요금 변경' 버튼을 선택하는 사용자 입력을 인가함으로써 요금 정보를 수정할 수 있다. 본원의 일 실시예에 따르면, 요금 정보의 수정은 통합 관리 서버로부터 전송된 변동 요금 정보에 기초하여 이루어질 수 있다. 구체적으로, 승객이 상술한 승객 밀집 영역 내에서 탑승한 경우, 승객 밀집 영역을 고려하여 상승된 요금을 적용할 수 있는 버튼이 활성화되고, 운전자 단말의 사용자(운전자)가 상승된 요금을 적용하는 버튼을 선택함으로써 전송된 변동 요금 정보가 적용되는 것일 수 있다. 도 3d를 참조하면, 운전자 단말은 사용자 단말에 의해 통합 관리 서버로 요청된 배차 요청 신호 또는 부가서비스 요청 신호에 대응하여 해당 운전자 단말에 매칭된 운행 예약 정보 또는 부가서비스 예약 정보를 표시할 수 있다. 예를 들어, 운행 예약 정보 또는 부가서비스 예약 정보는 탑승 예정 장소 정보, 목적지 정보, 탑승 시간 정보 및 부가서비스 유형 정보 중 적어도 하나 이상을 포함할 수 있다. 또한, 운전자 단말 은 운행 예약 정보 또는 부가서비스 예약 정보에 기초한 주행 개시 입력을 수신할 수 있다. 예를 들어, 도 3d의 (a)를 참조하면, 운전자 단말의 사용자(운전자)는 '주행 시작' 버튼을 선택함으로써 해당 차량의 상태를 예약된 승객 운송 서비스 또는 부가서비스 제공을 위하여 주행이 개시된 상태로 전환할 수 있다. 도 3e를 참조하면, 운전자 단말은 부가서비스 요청 신호를 수신하기 위한 화면을 표시할 수 있다. 본원에 서의 부가서비스는 단순 승객 운송 업무 외에 소정의 상품을 배송하거나, 사용자 단말의 사용자가 쇼핑한 물건을 소정의 장소까지 배달하거나, 소지품을 소정 기간 동안 보관하는 등 승객 운송 서비스 제공 차량을 통해 제공 가능한 다양한 유형의 추가적인 서비스를 의미하는 것일 수 있다. 본원의 일 실시예에 따르면, 통합 관리 서버는 등록된 운전자 단말에 제공 가능한 부가서비스의 목록을 전송하고, 소정의 부가서비스를 예약하는 부가서비스 요청 신호를 운전자 단말로부터 수신하고, 부가서비스 요청 신호에 대응하여 예약된 부가서비스 예약 내역과 부가서비스에 따른 추가 요금 정보를 운전자 단말로 전송하여 운전자 단말에 부가서비스 예약 내역과 추가 요금 정보가 표시되도록 구현될 수 있다. 도 3f를 참조하면, 운전자 단말은 운전자 단말의 사용자(운전자)의 요청에 따라 목적지까지의 경로 정보 또는 현재 위치에 인접한 지도 정보를 표시하는 내비게이션 화면을 출력하되, 상술한 메인 페이지를 간략 하게 형상화한 위젯 형태의 화상을 출력되는 내비게이션 화면에 중첩하여 표시할 수 있다. 여기서, 위젯 형태의 화상에는 요금 정보, 할증 적용 여부에 대한 정보 등이 포함될 수 있으나, 이에만 한정되는 것은 아니다. 도 4는 본원의 일 실시예에 따른 운행 정보 제공을 위한 운전자 단말의 개략적인 구성도이다. 도 4를 참조하면, 운전자 단말은, 연동부, 수신부, 표시부 및 송신부를 포함할 수 있 다. 연동부는, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 운전자 단말을 연동할 수 있다. 수신부는, 차량 탑재 단말로부터 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수 신할 수 있다. 표시부는, 수신된 주행 정보 및 운송 정보를 표시할 수 있다. 송신부는, 차량 탑재 단말로부터 수신된 주행 정보 및 운송 정보를 통합 관리 서버로 전송할 수 있다. 도 5는 본원의 일 실시예에 따른 승객 운송 서비스에 대한 운행 정보 관리를 위한 통합 관리 서버의 개략적인 구성도이다. 도 5를 참조하면, 통합 관리 서버는, 통신부, 요금 설정부, 매칭부, 광고 생성부 및 리워드 관리부를 포함할 수 있다. 통신부는, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말과 연동된 운전자 단말로 부터 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신할 수 있다. 또한, 통신부는, 차량에 탑승한 승객의 사용자 단말에 해당 차량에 대한 주행 정보 및 운송 정보를 전송할 수 있다. 또한, 통신부는, 운전자 단말 및 사용자 단말 중 적어도 하나에 갱신된 요금 정보를 전송할 수 있다. 요금 설정부는, 주행 정보 및 운송 정보를 기초로 하여 운송 정보에 포함된 요금 정보를 갱신할 수 있다. 본원의 일 실시예에 따르면, 갱신된 요금 정보는 변동 요금 정보로 달리 지칭될 수 있다. 구체적으로 본원의 일 실시예에 따르면, 요금 설정부는, 복수의 운전자 단말로부터 획득된 운송 정보에 기초하여 기 설정된 인공지능 알고리즘을 통해 승객 밀집 영역을 도출하고, 도출된 승객 밀집 영역에 기초하여 변동 요금 정보를 생 성할 수 있다. 매칭부는, 사용자 단말로부터 수신된 배차 요청 신호에 기초하여 탑승 예약 정보를 생성할 수 있다. 여기서, 생성된 탑승 예약 정보는 통신부에 의해 운전자 단말 및 사용자 단말에 전송될 수 있다. 또한, 매칭부는, 사용자 단말 또는 운전자 단말로부터 수신된 부가서비스 요청 신호에 기 초하여 부가서비스 예약 정보를 생성할 수 있다. 여기서, 생성된 부가서비스 예약 정보는 통신부에 의해 운전자 단말 및 사용자 단말9300)에 전송될 수 있다. 광고 생성부는, 획득된 운송 정보에 포함된 해당 차량의 현재 위치 정보 및 승객의 목적지 정보 중 적 어도 하나에 기초하여 위치 기반 광고 정보를 생성할 수 있다. 또한, 통신부는, 사용자 단말에 광고 생성부에 의해 생성된 위치 기반 광고 정보를 전송할 수 있다. 리워드 관리부는, 운송 정보에 기초하여 승객 운송 서비스가 종료된 것으로 판단되면, 사용자 단말로 부터 운전자에 대한 평가 정보를 수신할 수 있다. 또한, 리워드 관리부는, 운전자 단말의 운전자에 의해 주행되는 차량에 대한 주행 정보, 운송 정보 및 해당 운전자에 대한 평가 정보에 기초하여 리워드 정보 를 생성할 수 있다. 또한, 통신부는, 생성된 리워드 정보를 해당 운전자 단말로 전송할 수 있다. 차량 DB는 복수의 운전자 단말로부터 수신된 차량 각각에 대한 식별 정보를 저장할 수 있다. 또한, 본원의 일 실시예에 따르면, 차량 DB는 차량에 대한 식별 정보를 해당 차량의 차량 탑재 단말 과 연동(예를 들면, 블루투스 페어링)된 운전자 단말에 대한 정보와 매칭하여 저장할 수 있다. 또한, 실시예에 따라, 차량 DB는 소정의 운전자 단말을 포함하는 차량 그룹 별로 식별 정보가 구분되어 저 장 및 관리되는 것일 수 있다. 운전자 DB는 운전자 단말로부터 수신된 운전자 정보를 저장할 수 있다. 또한, 운전자 DB는 해당 운전자와 연계된 주행 정보 및 운송 정보를 저장할 수 있다. 예를 들어, 운전자 DB는 본원의 통합 관리 서 버에 등록된 운전자 단말의 사용자(운전자)에 대한 인적 사항과 해당 운전자의 주행 이력, 승객 운송 서비스 제공 이력 등을 통합 관리하도록 마련되는 것일 수 있다. 또한, 운전자 DB는 소정의 운전자 단말 에 대한 운전자 평가 결과와 해당 운전자 단말에 대한 리워드 정보가 함께 저장되는 것일 수 있다. 사용자 DB는 사용자 단말로부터 수신된 배차 요청 신호 생성 이력, 부가서비스 요청 신호 생성 이력, 결제 이력, 승객 운송 서비스 또는 부가서비스에 대한 예약 내역, 승객 평가 결과, 사용자 단말에 대한 리 워드 정보 등을 사용자 단말의 사용자 별로 구분하여 저장하도록 마련되는 것일 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 6은 본원의 일 실시예에 따른 운전자 단말을 이용한 운행 정보 제공 방법의 동작 흐름도이다. 도 6에 도시된 운전자 단말을 이용한 운행 정보 제공 방법은 앞서 설명된 운전자 단말에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 운전자 단말에 대하여 설명된 내용은 운전자 단말을 이용 한 운행 정보 제공 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 6을 참조하면, 단계 S610에서 연동부는, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말 과 운전자 단말을 연동할 수 있다. 다음으로, 단계 S620에서 수신부는, 연동된 차량 탑재 단말로부터 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신할 수 있다. 다음으로, 단계 S630에서 표시부는, 운전자 단말의 화면에 수신된 주행 정보 및 운송 정보 중 적어도 하나를 표시할 수 있다. 다음으로, 단계 S640에서 송신부는, 차량 탑재 단말로부터 수신된 주행 정보 및 운송 정보를 승객 운 송 서비스와 연계된 통합 관리 서버로 전송할 수 있다. 다음으로, 단계 S650에서 수신부는, 통합 관리 서버로부터, 통합 관리 서버가 기 설정된 인공지 능 알고리즘에 기초하여 결정한 변동 요금 정보를 수신할 수 있다.다음으로, 단계 S660에서 표시부는, 수신된 변동 요금 정보에 기초하여 주행 정보 및 운송 정보 중 적어도 하나를 표시할 수 있다. 상술한 설명에서, 단계 S610 내지 S660은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있 다. 도 7은 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방법의 동작 흐름도이다. 도 7에 도시된 운전자 단말을 이용한 운행 정보 제공 방법은 앞서 설명된 운전자 단말에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 운전자 단말에 대하여 설명된 내용은 운전자 단말을 이용 한 운행 정보 제공 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 7을 참조하면, 단계 S710에서 통신부는, 승객 운송 서비스 제공 차량에 탑재되는 차량 탑재 단말 과 연동된 운전자 단말로부터 차량의 주행 정보 및 승객 운송 서비스와 연계된 운송 정보를 수신 할 수 있다. 다음으로, 단계 S720에서 요금 설정부는, 수신된 주행 정보 및 운송 정보를 기초로 하여 운송 정보에 포함 된 요금 정보를 갱신하여 변동 요금 정보를 생성할 수 있다. 구체적으로, 단계 S720에서 요금 설정부는, 복수의 운전자 단말로부터 획득된 운송 정보에 기초하여 기 설정된 인공지능 알고리즘을 통해 승객 밀집 영역을 도출하고, 도출된 승객 밀집 영역에 기초하여 변동 요금 정보를 생성할 수 있다. 다음으로, 단계 S730에서 통신부는, 운전자 단말에 생성된 변동 요금 정보를 전송할 수 있다. 다음으로, 단계 S740에서 통신부는, 주행 정보 및 운송 정보를 차량에 탑승한 승객의 사용자 단말(30 0)에 전송할 수 있다. 다음으로, 단계 S750에서 광고 생성부는, 차량의 현재 위치 정보 및 승객의 목적지 정보 중 적어도 하 나에 기초하여 위치 기반 광고 정보를 생성할 수 있다. 다음으로, 단계 S760에서 통신부는, 사용자 단말에 생성된 위치 기반 광고 정보를 전송할 수 있다. 다음으로, 단계 S770에서 리워드 관리부는, 운송 정보에 기초하여 승객 운송 서비스가 종료된 것으로 판단 되면, 사용자 단말로부터 운전자에 대한 평가 정보를 수신할 수 있다. 다음으로, 단계 S780에서 리워드 관리부는, 해당 운전자 단말과 연계된 주행 정보, 운송 정보 및 단 계 S770에서 수신된 평가 정보에 기초하여 리워드 정보를 생성할 수 있다. 또한, 단계 S780에서 통신부는, 생성된 리워드 정보를 운전자 단말로 전송할 수 있다. 상술한 설명에서, 단계 S710 내지 S780은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있 다. 본원의 일 실시 예에 따른 운전자 단말을 이용한 운행 정보 제공 방법과 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태 로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발 명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수 도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체 (magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장 하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지 는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코 드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작 동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 운전자 단말을 이용한 운행 정보 제공 방법과 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2020-0010021", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2020-0010021", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 운행 정보 제공 시스템의 개략적인 구성도이다. 도 2a 및 도 2b는 차량 탑재 단말과 운전자 단말의 연동 과정을 설명하기 위한 도면이다. 도 3a 내지 도 3f는 주행 정보와 운송 정보가 표시되는 운전자 단말의 화면 인터페이스를 예시적으로 나타낸 도 면이다. 도 4는 본원의 일 실시예에 따른 운행 정보 제공을 위한 운전자 단말의 개략적인 구성도이다. 도 5는 본원의 일 실시예에 따른 승객 운송 서비스에 대한 운행 정보 관리를 위한 통합 관리 서버의 개략적인 구성도이다. 도 6은 본원의 일 실시예에 따른 운전자 단말을 이용한 운행 정보 제공 방법의 동작 흐름도이다. 도 7은 본원의 일 실시예에 따른 승객 운송 서비스와 연계된 통합 관리 서버에 의해 수행되는 운행 정보 관리 방법의 동작 흐름도이다."}
