{"patent_id": "10-2023-0103064", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0021864", "출원번호": "10-2023-0103064", "발명의 명칭": "인공신경망을 이용한 영어 스피킹 평가 방법 및 장치", "출원인": "주식회사 하이로컬", "발명자": "윤정호"}}
{"patent_id": "10-2023-0103064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 음성인식 API를 활용하여 학습자의 음성이 수집되면, 상기 수집된 음성을 인식하여 음성 데이터를 생성하는 음성 인식부; 및상기 인공지능 음성인식 API를 활용하여 상기 생성된 음성 데이터와 기저장된 영어 발음 데이터를 비교하고, 비교된 결과에 따라 상기 학습자의 영어 발음 평가 점수를 산출하는 발음 평가부;를 포함하는 인공지능 음성인식API를 활용한 영어 스피킹 평가 시스템."}
{"patent_id": "10-2023-0103064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 발음 평가부는,상기 생성된 음성 데이터를 기반으로 텍스트 데이터를 생성하고, 상기 음성 데이터와 상기 텍스트 데이터를 문장 또는 단어별로 분할하여, 상기 분할된 음성 데이터별로 상기 음성 데이터와 기저장된 영어 발음 데이터를 비교하고,비교된 결과에 따라 상기 학습자의 영어 발음 평가 점수를 산출하여, 상기 산출된 음성 데이터별 영어 발음 평가 점수가 상기 분할된 텍스트 데이터와 함께 출력되도록 하는 것을 특징으로 하는 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템."}
{"patent_id": "10-2023-0103064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,교육하고자 하는 영어 콘텐츠가 출력되도록 하는 출력부; 및상기 출력된 영어 콘텐츠를 학습자가 소리 내어 읽음으로써, 발생되는 음성을 수집하는 음성 수집부;를 더 포함하는 것을 특징으로 하는 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템."}
{"patent_id": "10-2023-0103064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 교육하고자 하는 영어 콘텐츠를 생성하고, 학습자의 정보에 따라 서로 다른 난이도의 영어 콘텐츠를 선별하는 영어 콘텐츠 생성부;를 더 포함하는 것을 특징으로 하는 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템."}
{"patent_id": "10-2023-0103064", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 영어 콘텐츠 생성부는,교육자에 대한 인증절차가 수행되어, 상기 인증절차의 유효성이 검증되면, 상기 영어 콘텐츠의 생성 권한, 등록권한 및 편집 권한이 제공되도록 하는 것을 특징으로 하는 인공지능 음성인식 API를 활용한 영어 스피킹 평가시스템."}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템이 개시된다. 본 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템은 인공지능 음성인식 API를 활용하여 학습자의 음성이 수집되면, 음성을 원어민 발음과 비교 하고, 원어민 발음을 반복 제공함으로써, 발음 등을 학습할 수 있으며, 특히, 원어민의 발음과 비교 평가받을 수 있어, 혼자서도 원어민 외국어 강사와의 온라인으로 영어 학습을 할 수 있으며, 영어 학습 효과를 증대시킬 수 있다."}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공신경망을 이용한 영어 스피킹 평가 방법 및 장치 에 관한 것으로, 더욱 상세하게는 인공지능 음 성인식 API를 활용한 인공신경망을 이용한 영어 스피킹 평가 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어, 산업의 전문화와 국제화 추세에 따라 외국어에 대한 중요성이 날로 커지고 있다. 이러한 중요성에 따라 많은 사람이 외국어 학습에 많은 시간을 투자하고 있으며, 이에 발맞추어 다양한 온-오프라인 어학 강좌들 이 개설되고 있다. 특히, 영어 교육 트랜드의 변화로 기존의 리딩 및 라이팅 위주의 교육에서 벗어나 영어 스피 킹 교육이 주요 교육 트랜드로 변화하고 있다. 그러나 일반적으로 발음 교정을 위한 외국어 교육 훈련은 외국인 강사와의 1:1 온라인에 의해 이루어지고 있고, 이 경우 외국어 학습에 상당한 비용이 소요된다는 문제점이 있으며, 특별히 정해진 시간에 교육이 이루어지기 때문에 직장인 등과 같은 바쁜 일상생활을 영위하는 사람들에게는 그 학습에의 참여가 극히 제한적이라는 문제 점이 있었다. 따라서, 유휴 시간에 혼자서도 효과적으로 외국어에 대한 발음이나 발음 등을 학습하고, 원어민의 발음과 비교 평가하는 교육 프로그램 등이 필요하게 되었다. 이러한 요구에 부응하기 위하여 현재 음성 인식을 이용한 다양한 어학용 프로그램들을 탑재한 어학용 학습기가 개발되어 보급되는 실정이나, 기존의 어학용 학습기들은 자연어 처리가 원활하지 못하고, 주어진 시나리오에서 벗어난 질의에 효과적으로 대응할 수 없다는 단점이 존재한다. 한편, 인공지능은 인간의 지능으로 할 수 있는 사고, 학습, 자기 개발 등을 컴퓨터가 할 수 있도록 하는 방법을 연구하는 컴퓨터 공학의 한 분야이다. 이러한 인공지능을 구현하기 위한 한 분야로서, 컴퓨터에 데이터들을 제 공하여, 학습하게 하는 기계학습(Machine Learning)이 개발되어 왔으며, 최근에는 기계학습의 하나의 기술로 딥 러닝(Deep learning)이 개발되어, 주목을 받고 있다. 이러한 딥 러닝(Deep learning)은 여러 비선형 변환 기법을 이용해서 학습 데이터에 대한 높은 수준의 추상화를 통해 데이터의 주요 특징들을 추출한 다음, 데이터 군집 및 분류를 수행하는 기계학습의 일종으로 복잡하고 방 대한 인간의 언어(자연어)를 이해하고 각 단어들의 상관관계를 분석해서 답을 도출해 내는 능력이 탁월하며, 다 양한 시나리오에 적절하게 대응할 수 있다는 장점이 있어, 외국어 학습에 많은 도움을 줄 수 있다. 따라서, 인공지능 기술을 활용하여 혼자서도 효과적으로 외국어에 대한 발음이나 발음 등을 학습하고, 원어민의 발음과 비교 평가받을 수 있는 방안의 모색이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1609473호(발명의 명칭: 영어 말하기 시험의 유창성 평가 시스템 및 방법) (특허문헌 0002) 한국등록특허 제10-1637975호(발명의 명칭: 말하기 자동평가 시스템, 그 방법 및 장치)"}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 본 발명의 목적은 인공지능 음성인식 API를 활용하여 효 과적으로 외국어에 대한 발음이나 억양, 대화 내용 등을 학습하고, 원어민의 발음과 비교 평가받을 수 있는 영 어 스피킹 평가 시스템을 제공함에 있다."}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 문제를 해결하기 위한 본 발명의 일 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템은 인공지능 음성인식 API를 활용하여 학습자의 음성이 수집되면, 상기 수집된 음성을 인식하여 음 성 데이터를 생성하는 음성 인식부; 음성 데이터에 포함된 대화를 텍스트로 변환하는 텍스트변환부; 및 상기 인 공지능 음성인식 API를 활용하여 상기 생성된 음성 데이터와 기저장된 영어 발음 데이터를 비교하고, 비교된 결과에 따라 상기 학습자의 영어 발음 평가 점수를 산출하는 발음 평가부;를 포함한다. 또한, 여기서 상기 발음 평가부는, 상기 생성된 음성 데이터를 기반으로 텍스트 데이터를 생성하고, 상기 음성 데이터와 상기 텍스트 데이터를 문장 또는 단어별로 분할하여, 상기 분할된 음성 데이터별로 상기 음성 데이터 와 기저장된 영어 발음 데이터를 비교하고, 비교된 결과에 따라 상기 학습자의 영어 발음 평가 점수를 산출하여, 상기 산출된 음성 데이터별 영어 발음 평가 점수가 상기 분할된 텍스트 데이터와 함께 출력되도록 할 수 있다. 그리고 본 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템은 교육하고자 하는 영어 콘 텐츠가 출력되도록 하는 출력부; 및 상기 출력된 영어 콘텐츠를 학습자가 소리 내어 읽음으로써, 발생되는 음성 을 수집하는 음성 수집부;를 더 포함할 수 있다. 또한, 본 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템은 상기 교육하고자 하는 영 어 콘텐츠를 생성하고, 학습자의 정보에 따라 서로 다른 난이도의 영어 콘텐츠를 선별하는 영어 콘텐츠 생성 부;를 더 포함할 수 있다. 그리고 상기 영어 콘텐츠 생성부는, 교육자에 대한 인증절차가 수행되어, 상기 인증절차의 유효성이 검증되면, 상기 영어 콘텐츠의 생성 권한, 등록 권한 및 편집 권한이 제공되도록 할 수 있다."}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명을 통하여, 효과적으로 외국어에 대한 발음이나 발음 등을 학습할 수 있으며, 특히, 원어민의 발음과 비 교 평가 받을 수 있어, 혼자서도 원어민 외국어 강사와의 1:1 온라인으로 영어 학습을 할 수 있다. 더불어, 학 습자의 수준별, 영어 콘텐츠의 단어 또는 문장별로 원어민의 발음과 비교 평가를 받을 수 있어, 학습자가 자신 의 취약한 점들을 쉽게 확인하고 개선할 수 있어, 영어 학습 효과를 증대시킬 수 있다."}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 실시예들을 첨부 도면을 참조하여 상세히 설명한다. 이하에 소개되는 실시예들은 본 발명"}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이 속하는 기술분야에서 통상의 지식을 가진자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위한 예로 서 제공되는 것이다. 본 발명은 이하 설명되는 실시예들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템(이하에서는 '영 어 스피킹 평가 시스템'으로 총칭함)이 개략적으로 도시된 도면이며, 도 2는 본 발명의 일 실시예에 따른 영어 스피킹 평가 시스템을 통해 산출되는 영어 발음 평가 점수가 출력되는 모습이 도시된 도면이다. 이하에서는 도 1 내지 도 2를 참조하여 본 실시예에 따른 영어 스피킹 평가 시스템에 대하여 설명하기로 한다. 본 실시예에 따른 영어 스피킹 평가 시스템은, 인공지능 음성인식 API를 활용하여 효과적으로 외국어에 대한 발 음이나 발음 등을 학습하고, 원어민의 발음과 비교 평가받을 수 있도록 하기 위해 마련된다. 이를 위해, 본 영어 스피킹 평가 시스템은, 영어 콘텐츠 생성부, 음성 수집부, 음성 인식부, 발 음 평가부, 저장부 및 출력부로 구성될 수 있다. 영어 콘텐츠 생성부는 교육하고자 하는 영어 콘텐츠를 생성하고, 학습자의 정보에 따라 서로 다른 난이도 의 영어 콘텐츠를 선별하기 위해 마련된다. 구체적으로, 영어 콘텐츠 생성부는 교육자가 교육자 단말을 영어 콘텐츠 생성부가 마련된 서버에 접 속하여, 교육자에 대한 인증절차를 수행하여, 인증절차의 유효성이 검증된 경우에 한하여, 영어 콘텐츠의 생성권한, 등록 권한 및 편집 권한이 제공되도록 하고, 교육자는 이러한 권한들을 바탕으로, 영어 원문으로 작성된 시나리오가 포함된 영어 콘텐츠를 생성 및 등록하거나, 등록된 영어 콘텐츠를 편집할 수 있다. 또한, 영어 콘텐츠 생성부는, 생성되거나 편집된 영어 콘텐츠가 등록되는 과정에서 등록하고자 하는 영어 콘텐츠의 학습 난이도에 대한 정보가 포함되도록 하고, 학습자가 영어 콘텐츠를 요청하는 경우, 학습 난이도에 따라 제공하고자 하는 영어 콘텐츠를 선별하여 제공할 수 있다. 음성 수집부는 영어 콘텐츠 생성부에 의해 선별된 영어 콘텐츠가 출력부에 출력되는 경우, 학습 자가 출력된 영어 콘텐츠를 소리 내어 읽음으로써, 발생되는 학습자의 음성을 수집하기 위해 마련된다. 여기서, 음성 수집부는 마이크와 같은 입력도구로 구현될 수 있다. 음성 인식부는, 인공지능 음성인식 API를 활용하여 수집된 음성을 인식하여 음성 데이터를 생성하기 위해 마련된다. 본 음성 인식부는 IBM 사의 왓슨(Watson) 이라는 인공지능 슈퍼컴퓨터가 제공하는 인공지능 음 성인식 API를 활용하여 수집된 음성을 인식하여 음성 데이터를 생성할 수 있다. 발음 평가부는 인공지능 음성인식 API를 활용하여 생성된 음성 데이터와 기저장된 영어 발음 데이터를 비 교하고, 비교된 결과에 따라 학습자의 영어 발음 평가 점수를 산출할 수 있다. 구체적으로 발음 평가부는, 생성된 음성 데이터를 기반으로 텍스트 데이터를 생성하고, 음성 데이터와 텍 스트 데이터를 문장 또는 단어별로 분할하여, 분할된 음성 데이터별로 음성 데이터와 기저장된 원어민의 영어 발음 데이터를 비교하고, 비교된 결과에 따라 학습자의 영어 발음 평가 점수를 산출하여, 산출된 음성 데이터별 영어 발음 평가 점수가 분할된 텍스트 데이터와 함께 출력되도록 할 수 있다. 여기서, 영어 발음 평가 점수는 기저장된 원어민의 영어 발음 데이터와 비교하여 동일, 유사 정도를 백분율로 산출한 점수를 의미하며, 발음 평가부는 내부에 마련된 STT(speech to text) API(application programming interface)를 통해 음성 데이터를 기반으로 텍스트 데이터를 생성할 수 있다. 저장부는 원어민의 영어 발음 데이터와 영어 콘텐츠를 저장하기 위해 마련된단. 구체적으로 저장부는, 원어민의 영어 발음 데이터와 영어 콘텐츠가 저장되며, 추가적으로 학습자 및 교육자에 대한 아 이디, 패스워드 및 각종 학습자의 학습 기록 및 교육자 개개인이 생성하거나 편집한 영어 콘텐츠에 대한 정보까 지 저장될 수 있다. 특히, 저장부는 특정 학습자의 영어 발음 평가 점수가 저장되어, 학습자 또는 학습자 의 보호자로 하여금 쉽고 편리하게 기존 특정 학습자의 영어 발음 점수를 일별, 주별, 월별로 파악하도록 할 수 있다. 출력부는 영어 콘텐츠가 출력되거나 또는 산출된 음성 데이터별 영어 발음 평가 점수가 분할된 텍스트 데 이터와 함께 출력되도록 하기 위해 마련된다. 구체적으로 출력부는, 디스플레이 장치로 구현되어, 영어 콘텐츠가 출력되기 위한 영어 콘텐츠 출력 모듈 과 영어 발음 평가 점수가 출력되기 위한 영어 발음 평가 점수 출력 모듈이 포함될 수 있다. 특히, 영어 발음 평가 점수 출력 모듈은 전체 평가 점수 출력 모듈과 단어 또는 문장별 평가 대상이 출력되는 타임 라인이 표시되기 위한 타임 라인 출력 모듈, 그리고 단어 또는 문장별 평가 점수를 출력하 기 위한 개별 평가 점수 출력 모듈으로 구성되어, 학습자의 전체 평가 점수와 단어 또는 문장별로 개별적 인 평가 점수를 함께 확인할 수 있도록 해준다. 이에 의해, 학습자의 수준별, 영어 콘텐츠의 단어 또는 문장별로 원어민의 발음과 비교 평가를 받을 수 있어, 학습자가 자신의 취약한 점들을 쉽게 확인하고 개선할 수 있어, 영어 학습 효과를 증대시킬 수 있다. 도 3은 본 발명의 일 실시예에 따른 영어 스피킹 평가 시스템을 이용한 방법을 설명하기 위해 도시된 도면이다. 우선, 학습자가 요청하는 학습 난이도에 따라 영어 콘텐츠 생성부에 의해 선별된 영어 콘텐츠가 출력부 에 의해 출력되면(S310), 학습자는 출력된 영어 콘텐츠를 소리 내어 읽음으로써, 음성 수집부에 의해, 음성이 수집되도록 할 수 있다(S320). 음성이 수집되면, 음성 인식부는 인공지능 음성인식 API를 활용하여 수집된 음성을 인식하여 음성 데이터 를 생성할 수 있으며(S330), 발음 평가부는 인공지능 음성인식 API를 활용하여 생성된 음성 데이터를 기반 으로 텍스트 데이터를 생성할 수 있다(S340). 또한, 발음 평가부는, 음성 데이터와 텍스트 데이터를 문장 또는 단어별로 분할하여(S350), 분할된 음성데 이터별로 음성 데이터와 기저장된 원어민의 영어 발음 데이터를 비교하고, 비교된 결과에 따라 학습자의 영어 발음 평가 점수를 산출할 수 있다(S360). 이때, 산출된 음성 데이터별 영어 발음 평가 점수는 출력부에 의해, 분할된 텍스트 데이터와 함께 출력되 도록 할 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2023-0103064", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0103064", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템이 개략적으로 도 시된 도면이다. 도 2는 본 발명의 일 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템을 통해 산출되는 영어 발음 평가 점수가 출력되는 모습이 도시된 도면이다. 도 3은 본 발명의 일 실시예에 따른 인공지능 음성인식 API를 활용한 영어 스피킹 평가 시스템을 이용한 방법을 설명하기 위해 도시된 도면이다."}
