{"patent_id": "10-2021-0131468", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0048704", "출원번호": "10-2021-0131468", "발명의 명칭": "태양광 발전 자동 관리 시스템 및 방법", "출원인": "주식회사 엠블럭", "발명자": "조수환"}}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "태양광 발전 자동 관리 시스템에 있어서,태양광을 전기에너지로 변환하는 복수의 태양광 전지판;상기 복수의 태양광 전지판과 각각 연결되어 상기 복수의 태양광 전지판에서 출력되는 상기 전기에너지를 직류에서 교류로 변환하는 변환기; 및상기 전기에너지에 대한 발전량 및 상기 변환된 교류에 대한 출력량을 기반으로 상기 복수의 태양광 전지판 중적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단하는 분석 장치;를 포함하고,상기 분석 장치는,상기 복수의 태양광 전지판에 대한 물리적 배치 데이터를 구비하고,상기 구비된 물리적 배치 데이터를 기반으로 상기 적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 분석 장치는,상기 물리적 배치 데이터를 기반으로, 상기 복수의 태양광 전지판 중 기준 태양광 전지판에 기 설정된 거리범위내에 인접한 적어도 하나의 인접 태양광 전지판을 확인하고,상기 기준 태양광 전지판 및 상기 적어도 하나의 인접 태양광 전지판 간의 특정 시간에서의 발전량의 차이가 기설정된 임계 차이값을 초과하는 경우, 상기 기준 태양광 전지판에 대한 이상 알림정보를 생성하는, 태양광 발전자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 분석 장치는,제1 인공지능 모델을 통해, 상기 적어도 하나의 인접 태양광 전지판 각각의 발전량을 기반으로 상기 기준 태양광 전지판의 예측 발전량을 산출하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 분석 장치는,제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지판 각각에 저장된 발전량을 기반으로상기 기준 태양광 전지판의 특정 시간에 대한 예측 발전량을 산출하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 분석 장치는,상기 제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지판 각각에 저장된 발전량에 기설정된 보간법을 적용하여 각각의 결과값을 산출하고, 공개특허 10-2023-0048704-3-상기 산출된 각각의 결과값 중에서 상기 특정 시간과 동일한 시간에 산출된 결과값을 상기 예측 발전량으로 결정하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분석 장치는,상기 발전량과 상기 예측 발전량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 해당 태양광 전지판에 대한상기 이상 알림정보를 생성하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 분석 장치는,상기 발전량과 상기 예측 발전량의 차이가 기 설정된 제1 임계 차이값을 초과하고, 동시에 기 설정된 시간 이상지속되는 경우, 상기 해당 태양광 전지판에 대한 상기 태양광 전지판 교체신호 또는 고장신호를 포함하는 상기이상 알림정보를 생성하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 분석 장치는,제3 인공지능 모델을 통해 상기 변환기에 대한 기 설정된 시간 단위로 저장한 출력량을 기반으로 예측 출력량을산출하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 분석 장치는,상기 출력량과 상기 예측 출력량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상기 변환기에 대한 상기이상 알림정보를 생성하는, 태양광 발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 태양광 전지판은,기 설정된 지역에 대한 지형정보와 조경정보를 포함하는 상기 물리적 배치 데이터를 기반으로 배치되는, 태양광발전 자동 관리 시스템."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 태양광 발전 자동 관리 시스템에 있어서, 태양광을 전기에너지로 변환하는 복수의 태양광 전지판, 상 기 복수의 태양광 전지판과 각각 연결되어 상기 복수의 태양광 전지판에서 출력되는 상기 전기에너지를 직류에서 교류로 변환하는 변환기 및 상기 전기에너지에 대한 발전량 및 상기 변환된 교류에 대한 출력량을 기반으로 상기 복수의 태양광 전지판 중 적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단하는 분석 장치를 포함하고, 상기 분석 장치는, 상기 복수의 태양광 전지판에 대한 물리적 배치 데이터를 구비하고, 상기 구비된 물리적 배치 데이터를 기반으로 상기 적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단할 수 있다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 태양광 발전 자동 관리 시스템 및 방법을 제공하는 것이다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 코로나 19 사태에도 불구하고, 글로벌 태양광 시장은 중국, 미국, 유럽 등 주요국의 수요 증가와 기 후변화 및 EGS(Environmental, Social and Governance) 이슈의 본격 등장에 힘입어 전년대비 수요가 증가하였 다. 이와 같은 태양광의 수요는 지속적으로 성장할 전망이다. 한국수출입은행 해외경제연구소의 2021년 2분기 신재생에너지 산업 동향 보고서에 따르면, 2020년 글로벌 태양 광 설치량은 중국 및 미국의 수요 증가로 전년대비 22% 증가한 144GW를 기록했다.2021년 글로벌 태양광 수요는 코로나 19 상황 안정, 기후변화 및 ESG 이슈의 본격적인 등장으로 180GW를 넘을 것으로 예상되며, 2022년에는 20GW 시대가 열릴 전망이다. 또한, 2021년 국내 태양광 설치량은 4GW를 넘어설 것으로 예상되며, 2023년 4.5GW까지 확대될 것으로 전망된다. 이러한 국내 태양광 설치량 증가에 따른 태양광 시스템의 관리에 대한 중요성 또한 증가하고 있다. 그러나, 일반적으로 태양광 시스템이 정상적으로 동작되지 않는 경우 전문가가 직접 태양광 전지판이 설치된 곳 으로 가서 고장 원인을 파악해야 하는 어려움이 존재한다. 따라서, 태양광 시스템이 고장난 경우, 이를 실시간으로 판단하여 제공해줄 수 있는 방안이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1893834호"}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 문제점을 해결하기 위한 본 발명은 분석 장치를 통해 태양광 전지판과 변환기의 이상 유무를 자동으로 실시간 판단하는 것을 그 목적으로 한다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명에 따른 태양광 발전 자동 관리 시스템에 있어서, 태양광을 전기에너지로 변환하는 복수의 태양광 전지판, 상기 복수의 태양광 전지판과 각각 연결되어 상기 복수의 태양광 전지판에서 출력되는 상기 전기에너지를 직류에서 교류로 변환하는 변환기 및 상기 전기에너지에 대한 발전량 및 상기 변환 된 교류에 대한 출력량을 기반으로 상기 복수의 태양광 전지판 중 적어도 하나의 태양광 전지판 또는 상기 변환 기의 이상 유무를 판단하는 분석 장치를 포함하고, 상기 분석 장치는, 상기 복수의 태양광 전지판에 대한 물리 적 배치 데이터를 구비하고, 상기 구비된 물리적 배치 데이터를 기반으로 상기 적어도 하나의 태양광 전지판 또 는 상기 변환기의 이상 유무를 판단할 수 있다. 여기서, 상기 분석 장치는, 상기 물리적 배치 데이터를 기반으로, 상기 복수의 태양광 전지판 중 기준 태양광 전지판에 기 설정된 거리범위 내에 인접한 적어도 하나의 인접 태양광 전지판을 확인하고, 상기 기준 태양광 전 지판 및 상기 적어도 하나의 인접 태양광 전지판 간의 특정 시간에서의 발전량의 차이가 기 설정된 임계 차이값 을 초과하는 경우, 상기 기준 태양광 전지판에 대한 이상 알림정보를 생성할 수 있다. 또한, 상기 분석 장치는, 제1 인공지능 모델을 통해, 상기 적어도 하나의 인접 태양광 전지판 각각의 발전량을 기반으로 상기 기준 태양광 전지판의 예측 발전량을 산출할 수 있다. 또한, 상기 분석 장치는, 제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지판 각각에 저장된 발전량을 기반으로 상기 기준 태양광 전지판의 특정 시간에 대한 예측 발전량을 산출할 수 있다. 또한, 상기 분석 장치는, 상기 제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지판 각 각에 저장된 발전량에 기 설정된 보간법을 적용하여 각각의 결과값을 산출하고, 상기 산출된 각각의 결과값 중 에서 상기 특정 시간과 동일한 시간에 산출된 결과값을 상기 예측 발전량으로 결정할 수 있다. 또한, 상기 분석 장치는, 상기 발전량과 상기 예측 발전량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 해당 태양광 전지판에 대한 상기 이상 알림정보를 생성할 수 있다. 또한, 상기 분석 장치는, 상기 발전량과 상기 예측 발전량의 차이가 기 설정된 제1 임계 차이값을 초과하고, 동 시에 기 설정된 시간 이상 지속되는 경우, 상기 해당 태양광 전지판에 대한 상기 태양광 전지판 교체신호 또는고장신호를 포함하는 상기 이상 알림정보를 생성할 수 있다. 또한, 상기 분석 장치는, 제3 인공지능 모델을 통해 상기 변환기에 대한 기 설정된 시간 단위로 저장한 출력량 을 기반으로 예측 출력량을 산출할 수 있다. 또한, 상기 분석 장치는, 상기 출력량과 상기 예측 출력량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상기 변환기에 대한 상기 이상 알림정보를 생성할 수 있다. 또한, 상기 태양광 전지판은, 기 설정된 지역에 대한 지형정보와 조경정보를 포함하는 상기 물리적 배치 데이터 를 기반으로 배치될 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 장치, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면, 분석 장치를 통해 태양광 전지판과 변환기의 이상 유무를 자동으로 실시간 판단 함으로써 문제가 발생했을 경우 추가적인 인력 자원과 시간의 소모 없이 문제 발생 위치 및 문제 발생 원인을 빠르게 파악 수 있는 효과가 있다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 도 1은 본 발명에 따른 태양광 발전 자동 관리 시스템을 설명하기 위한 도면이다. 도 2a 내지 도 2d는 본 발명에 따른 복수의 태양광 전지판의 물리적 배치 데이터를 설명하기 위한 예시도이다. 도 3은 본 발명에 따른 기준 태양광 전지판과 인접 태양광 전지판을 설명하기 위한 예시도이다. 이하, 도 1 내지 도 3을 참조하여, 본 발명에 따른 태양광 발전 자동 관리 시스템에 대해서 설명하도록 한다. 태양광 발전 자동 관리 시스템은 복수의 태양광 전지판, 상기 복수의 태양광 전지판과 각각 연결되 는 변환기 및 상기 태양광 전지판 또는 상기 변환기의 이상 유무를 판단하는 분석 장치를 포함 할 수 있다. 여기서, 시스템은 도 1에 도시된 구성요소보다 더 적은 수의 구성요소나 더 많은 구성요소를 포 함할 수도 있다. 이러한, 태양광 발전 자동 관리 시스템은 분석 장치를 통해 태양광 전지판과 변환기의 이상 유 무를 자동으로 실시간 판단함으로써, 문제가 발생했을 경우 추가적인 인력 자원과 시간의 소모 없이, 문제 발생 위치 및 문제 발생 원인을 빠르게 파악할 수 있도록 하는 효과를 제공할 수 있다. 먼저, 태양광 전지판은 복수개 구비되며, 태양광을 전기에너지로 변환할 수 있다. 여기서, 하나의 태양광 전지판은 다수의 태양전지 타일을 포함하며, 각각의 태양전지 타일은 직렬 또는 병렬 또는 직렬 및 병렬의 혼합구조로 연결될 수 있다. 또한, 도 2a 내지 도 2d에 도시된 바와 같이, 태양광 전지판은 기 설정된 지역에 대한 지형정보와 조경경보 가 포함되는 물리적 배치 데이터를 기반으로 다양한 형태로 배치될 수 있다. 여기서, 지형정보는 토지의 생김새 및 지표 상의 시설물에 대한 정보를 포함할 수 있다. 또한, 조경정보는, 건축 용지 입안(site planning) 정보, 주택용 부동산 개발(housing estate development) 정 보, 환경 복원(environmental restoration) 정보, 도심 개발에 대한 계획 및 설계 정보, 공원에 대한 레크레이 션 계획 및 설계 정보, 문화재 보존 계획 정보 중 적어도 하나를 포함할 수 있다. 보다 상세하게는, 태양광 전지판은 태양광이 잘 포집되는 지형에 설치되되, 주변에 나무, 가로등, 건물 등 의 그늘 발생 요소가 있는 위치를 피해 다양한 형태로 배치될 수 있다. 일 예로, 도 2a를 보면, 태양광 전지판은 사각형 형태로 동일한 간격과 동일한 개수로 행과 열로 배치될 수 있다. 또한, 도 2b를 보면, 태양광 전지판은 'Ⅰ' 로마 숫자 형태로 1행과 3행은 동일한 간격과 동일한 개수이고, 2행은 1행과 3행 보다 한 개 적게 배치되는데 이는 상기 지형정보와 조경정보를 기반으로 배치된 것일 수 있다. 또한, 도 2c를 보면, 태양광 전지판은 'H' 영문 대문자 형태로 배치되는데 이는 상기 지형정보와 조경정보 를 기반으로 배치된 것일 수 있다. 또한, 도 2d를 보면, 태양광 전지판은 평행 사변형 형태로 동일한 간격과 동일한 개수로 행과 열로 배치되 는데 이는 상기 지형정보와 조경정보를 기반으로 배치된 것일 수 있다. 다음으로, 변환기는 상기 복수의 태양광 전지판과 각각 연결되어 상기 복수의 태양광 전지판에서 출력되는 상기 전기에너지를 직류에서 교류로 변환할 수 있다. 여기서, 변환기는 인버터를 포함할 수 있다. 그 다음으로, 분석 장치는 상기 전기에너지에 대한 발전량과 상기 변환된 교류에 대한 출력량을 기반으로 상기 복수의 태양광 전지판 중 적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단할 수 있다. 따라서, 분석 장치는 문제가 발생했을 경우 바로 문제가 발생한 곳이 어디인지 어떠한 문제가 일어난 것인 지 추가적인 인력 자원과 시간의 소모 없이 파악 수 있는 효과를 가질 수 있다. 여기서, 분석 장치는 상기 변환기와 유선 또는 무선으로 연결될 수 있다. 이러한, 분석 장치는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함될 수 있다. 여기서, 분석 장치는 컴퓨터의 형태가 될 수 있다. 보다 상세하게는, 상기 컴퓨터는 연산처리를 수행하여 사용자에게 결과를 제공할 수 있는 다양한 장치들이 모두 포함될 수 있다. 예를 들어, 컴퓨터는 데스크 탑 PC, 노트북(Note Book) 뿐만 아니라 스마트폰(Smart phone), 태블릿 PC, 셀룰러 폰(Cellular phone), 피씨에스폰(PCS phone; Personal Communication Service phone), 동기식/비동기식 IMT-2000(International Mobile Telecommunication-2000)의 이동 단말기, 팜 PC(Palm Personal Computer), 개인용 디지털 보조기(PDA; Personal Digital Assistant) 등도 해당될 수 있다. 또한, 헤드마운트 디스플레이(Head Mounted Display; HMD) 장치가 컴퓨팅 기능을 포함하는 경우, HMD장치가 컴퓨터가 될 수 있다. 또한, 컴퓨터는 클라이언트로부터 요청을 수신하여 정보처리를 수행하는 서버가 해당될 수 있다. 그리고, 분석 장치는 통신부, 메모리 및 프로세서를 포함할 수 있다. 여기서, 분석 장치 는 도 1에 도시된 구성요소보다 더 적은 수의 구성요소나 더 많은 구성요소를 포함할 수 있다. 통신부는 분석 장치와 변환기, 분석 장치와 사용자 단말(미도시) 사이 또는 분석 장치와 통신망(미도시) 사이의 유선 통신 또는 무선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 여기서, 또한, 사용자 단말(미도시)은 상기 분석 장치에서 생성한 이상 알림정보를 사용자에게 제공해주는 장치일 수 있다. 여기서, 사용자 단말(미도시)은 디스플레이 수단, 입력 수단, 통신기능 등이 포함되는 휴대폰, 스마트폰, PDA(Personal Digital Assistant), PMP(Portable Multimedia Player), 태블릿 PC, 개인용 컴퓨터(예를 들어, 데스크탑 컴퓨터, 노트북 컴퓨터 등), 워크스테이션, PDA, 웹 패드 등과 같은 디지털 기기 중 하나일 수도 있다. 또한, 통신망(미도시)은 변환기, 분석 장치 및 사용자 단말(미도시) 간의 다양한 정보를 송수신할 수 있다. 통신망(미도시)은 다양한 형태의 통신망이 이용될 수 있으며, 예컨대, WLAN(Wireless LAN), 와이파이(Wi- Fi), 와이브로(Wibro), 와이맥스(Wimax), HSDPA(High Speed Downlink Packet Access) 등의 무선 통신방식 또는 이더넷(Ethernet), xDSL(ADSL, VDSL), HFC(Hybrid Fiber Coax), FTTC(Fiber to The Curb), FTTH(Fiber To The Home) 등의 유선 통신방식이 이용될 수 있다. 한편, 통신망(미도시)은 상기에 제시된 통신방식에 한정되는 것은 아니며, 상술한 통신방식 이외에도 기타 널리 공지되었거나 향후 개발될 모든 형태의 통신 방식을 포함할 수 있다. 통신부는 분석 장치를 하나 이상의 네트워크에 연결하는 하나 이상의 모듈을 포함할 수 있다. 메모리는 분석 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 메모리는 분석 장치 에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이션(application)), 분석 장치 의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 이러한 응용 프로그램 중 적어도 일부는, 분석 장치 의 기본적인 기능을 위하여 존재할 수 있다. 한편, 응용 프로그램은, 메모리에 저장되고, 분석 장치 상에 설치되어, 프로세서에 의하여 상기 분석 장치의 동작(또는 기능)을 수행하도록 구동될 수 있다. 프로세서는 상기 응용 프로그램과 관련된 동작 외에도, 통상적으로 분석 장치의 전반적인 동작을 제어 할 수 있다. 프로세서는 위에서 살펴본 구성요소들을 통해 입력 또는 출력되는 신호, 데이터, 정보 등을 처리하거나 메모리에 저장된 응용 프로그램을 구동함으로써, 사용자에게 적절한 정보 또는 기능을 제공 또 는 처리할 수 있다. 또한, 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, 도 1과 함께 살펴본 구성요소 들 중 적어도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, 분석 장 치에 포함된 구성요소들 중 적어도 둘 이상을 서로 조합하여 동작 시킬 수 있다. 프로세서는 상기 전기에너지에 대한 발전량과 상기 변환된 교류에 대한 출력량을 기반으로 상기 복수의 태 양광 전지판 중 적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단할 수 있다. 또한, 프로세서는 상기 복수의 태양광 전지판에 대한 물리적 배치 데이터를 구비하고, 상기 구비된 물 리적 배치 데이터를 기반으로 상기 적어도 하나의 태양광 전지판 또는 상기 변환기의 이상 유무를 판단 할 수 있다. 보다 상세하게는, 도 3을 보면, 프로세서는 상기 물리적 배치 데이터를 기반으로, 상기 복수의 태양광 전 지판 중 기준 태양광 전지판에 기 설정된 거리범위 내에 인접한 적어도 하나의 인접 태양광 전지판(일 예로, 제1 인접 태양광 전지판과 제2 인접 태양광 전지판)을 확인할 수 있다. 그리고, 프로세서는 상기 기준 태양광 전지판 및 상기 적어도 하나의 인접 태양광 전지판(일 예로, 제1 인접 태양광 전지판과 제2 인접 태양광 전지판) 간의 특정 시간에서의 발전량의 차이가 기 설정 된 임계 차이값을 초과하는 경우, 상기 기준 태양광 전지판에 대한 이상 알림정보를 생성할 수 있다. 이에 따라, 프로세서는 사계절의 기후를 가진 지역에 상기 복수의 태양광 전지판이 위치하는 겨우, 태 양의 고도가 같더라도 봄에는 태양광이 강해지고 가을부터는 태양광이 약해질 것으로 예측할 수 있다. 일 예로, 프로세서는 복수의 태양광 전지판 각각에 대해 기준 태양광 전지판으로 지정하고, 상기 기준 태양광 전지판과 기 설정된 거리범위 내에 인접한 상기 제1 인접 태양광 전지판과 상기 제2 인 접 태양광 전지판의 상기 특정 시간에서의 평균 발전량을 산출할 수 있다. 이후, 프로세서는 특정 시간에서의 상기 기준 태양광 전지판의 발전량과 상기 평균 발전량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상기 기준 태양광 전지판에 대한 이상 알림정보를 생성할 수 있 다. 즉, 프로세서는 상기 특정 시간이 여름 중 한 시점인 경우, 기준 태양광 전지판의 발전량이 제1 값이 고, 상기 평균 발전량이 제2 값일 때, 그 차이가 상기 임계 차이값을 초과하는 경우, 상기 기준 태양광 전지판 에 이상이 생긴 것으로 판단할 수 있다. 다른 예로, 프로세서는 상기 특정 시간에서의 상기 제1 인접 태양광 전지판과 상기 제2 인접 태양광 전지판 각각의 제1 발전량과 제2 발전량을 산출할 수 있다. 이후, 프로세서는 특정 시간에서의 상기 기준 태양광 전지판의 발전량과 상기 제1 인접 태양광 전지 판의 제1 발전량 또는 상기 기준 태양광 전지판의 발전량과 상기 제2 인접 태양광 전지판의 제2 발전량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상기 기준 태양광 전지판에 대한 이상 알림정보 를 생성할 수 있다. 즉, 프로세서는 상기 복수의 태양광 전지판 각각에 대해 기준 태양광 전지판으로 설정하여 위의 기재한 방법을 반복 수행하여 이상 알림정보를 생성하고, 생성한 이상 알림정보를 실시간으로 상기 사용자 단말 (미도시)로 전송할 수 있다. 여기서, 이상 알림정보는 이상이 발생한 태양광 전지판의 식별정보를 포함할 수 있다. 따라서, 사용자는 실시간으로 상기 복수의 태양광 전지판 각각에 대해 어떤 태양광 전지판에 이상이 생겼는지를 확인하고, 조치를 취할 수 있다. 프로세서는 제1 인공지능 모델을 통해, 상기 적어도 하나의 인접 태양광 전지판 각각의 발전량을 기반으로 상기 기준 태양광 전지판의 예측 발전량을 산출할 수 있다. 여기서, 제1 인공지능 모델은, 상기 적어도 하나의 인접 태양광 전지판 각각의 발전량에 기초한 학습데이터 세 트를 구축하고, 상기 구축된 학습데이터 세트를 기반으로 기계학습될 수 있다. 또는, 프로세서는 제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지판 각각에 저 장된 발전량을 기반으로 상기 기준 태양광 전지판의 특정 시간에 대한 예측 발전량을 산출할 수 있다. 구체적으로, 프로세서는 상기 제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지 판 각각에 저장된 발전량에 기 설정된 보간법을 적용하여 각각의 결과값을 산출할 수 있다. 여기서, 상기 기 설정된 보간법을 적용하여 산출한 결과값은 평균값일 수 있다. 그리고, 프로세서는 상기 산출된 각각의 결과값 중에서 상기 특정 시간과 동일한 시간에 산출된 결과값을 상기 예측 발전량으로 결정할 수 있다. 여기서, 제2 인공지능 모델은, 복수의 태양광 전지판에 대해 기 설정된 시간 단위로 저장한 발전량에 기 설 정된 보간법을 적용하여 각각의 결과값에 기초한 학습데이터 세트를 구축하고, 상기 구축된 학습데이터 세트를 기반으로 기계학습될 수 있다. 이후, 프로세서는 상기 발전량과 상기 예측 발전량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 해 당 태양광 전지판에 대한 상기 이상 알림정보를 생성할 수 있다. 또는, 프로세서는 상기 발전량과 상기 예측 발전량의 차이가 기 설정된 차이값을 초과하고 동시에 기 설정 된 시간 이상 지속되는 경우, 상기 해당 태양광 전지판에 대한 상기 이상 알림정보를 생성할 수 있다. 여기서,상기 차이값은 상기 임계 차이값 보다 작은 값일 수 있다. 즉, 프로세서는 상기 발전량이 상기 임계 차이값 보다 낮은 상기 차이값으로 기 설정된 시간 이상 지속되 는 경우에도 상기 해당 태양광 전지판에 대해 상기 이상 알림정보를 생성할 수 있다. 또한, 프로세서는 상기 발전량과 상기 예측 발전량의 차이가 기 설정된 제1 임계 차이값을 초과하고, 동시 에 기 설정된 시간 이상 지속되는 경우, 상기 해당 태양광 전지판에 대한 상기 태양광 전지판 교체신호 또는 고 장신호를 포함하는 상기 이상 알림정보를 생성할 수 있다. 즉, 프로세서는 상기 발전량과 상기 예측 발전량의 차이가 너무 큰 경우, 상기 해당 태양광 전지판에 대한 수리 또는 교체가 시급한 상황이므로 상기 태양광 전지판 교체신호 또는 고장신호를 포함하는 상기 이상 알림정 보를 생성할 수 있다. 즉, 프로세서는 상기 생성한 이상 알림정보를 실시간으로 상기 사용자 단말(미도시)로 전송할 수 있다. 여기서, 이상 알림정보는 이상이 발생한 상기 해당 태양광 전지판의 식별정보를 포함할 수 있다. 따라서, 사용자는 실시간으로 상기 복수의 태양광 전지판 각각에 대해 어떤 태양광 전지판에 이상이 생겼는지를 확인하고, 조치를 취할 수 있다. 프로세서는 제3 인공지능 모델을 통해 상기 변환기에 대한 기 설정된 시간 단위로 저장한 출력량을 기 반으로 예측 출력량을 산출할 수 있다. 구체적으로, 프로세서는 제3 인공지능 모델을 통해 상기 변환기에 대해 기 설정된 시간 단위로 저장한 출력량의 평균값을 통해 상기 예측 출력량을 산출할 수 있다. 여기서, 제3 인공지능 모델은, 상기 변환기에 대해 기 설정된 시간 단위로 저장한 출력량에 기초한 학습데 이터 세트를 구축하고, 상기 구축된 학습데이터 세트를 기반으로 기계학습될 수 있다. 이후, 프로세서는 상기 출력량과 상기 예측 출력량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상 기 변환기에 대한 상기 이상 알림정보를 생성할 수 있다. 또는, 프로세서는 상기 출력량과 상기 예측 출력량의 차이가 기 설정된 차이값을 초과하고 동시에 기 설정 된 시간 이상 지속되는 경우, 상기 변환기에 대한 상기 이상 알림정보를 생성할 수 있다. 여기서, 상기 차 이값은 상기 임계 차이값 보다 작은 값일 수 있다. 즉, 프로세서는 상기 출력량이 상기 임계 차이값 보다 낮은 상기 차이값으로 기 설정된 시간 이상 지속되 는 경우에도 상기 변환기에 대해 상기 이상 알림정보를 생성할 수 있다. 즉, 프로세서는 상기 이상 알림정보를 실시간으로 상기 사용자 단말(미도시)로 전송할 수 있다. 따라서, 사용자는 실시간으로 상기 변환기에 대해 이상이 생겼는지를 확인하고, 조치를 취할 수 있다. 도 4는 본 발명에 따른 태양광 발전 자동 관리하는 과정을 나타낸 흐름도이다. 여기서, 프로세서의 동작은 분석 장치에서 수행 가능할 수 있다. 프로세서는 복수의 태양광 전지판에서 변환한 상기 전기에너지에 대한 발전량과 상기 변환기에서 변환한 교류에 대한 출력량을 획득할 수 있다(S401). 이후, 먼저, 프로세서는 제1 인공지능 모델을 통해, 상기 적어도 하나의 인접 태양광 전지판 각각의 발전 량을 기반으로 상기 기준 태양광 전지판의 예측 발전량을 산출할 수 있다. 프로세서는 상기 제2 인공지능 모델을 통해 상기 복수의 태양광 전지판에 대해 기 설정된 시간 단위로 저 장된 발전량에 기 설정된 보간법을 적용하여 각각의 결과값을 산출할 수 있다(S402). 구체적으로, 프로세서는 상기 제2 인공지능 모델을 통해 기 설정된 시간 단위로 상기 복수의 태양광 전지 판 각각에 저장된 발전량에 기 설정된 보간법을 적용하여 각각의 결과값을 산출할 수 있다. 프로세서는 상기 산출된 각각의 결과값 중에서 상기 특정 시간과 동일한 시간에 산출된 결과값을 상기 예 측 발전량으로 결정할 수 있다(S403). 프로세서는 상기 발전량과 상기 예측 발전량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상기 기준 태양광 전지판의 이상이 발생한 것으로 판단하여 상기 이상 알림정보를 생성할 수 있다(S404).프로세서는 제3 인공지능 모델을 통해 상기 전류 교환기변환기에 대한 기 설정된 시간 단위로 저장된 출력 량을 기반으로 예측 출력량을 산출할 수 있다(S405). 구체적으로, 프로세서는 제3 인공지능 모델을 통해 상기 변환기에 대해 기 설정된 시간 단위로 저장한 출력량의 평균값을 통해 상기 예측 출력량을 산출할 수 있다. 프로세서는 상기 출력량과 상기 예측 출력량의 차이가 기 설정된 임계 차이값을 초과하는 경우, 상기 변환 기에의 이상이 발생한 것으로 판단하여 상기 이상 알림정보를 생성할 수 있다(S406). 도 4는 단계 S401 내지 단계 S406를 순차적으로 실행하는 것으로 기재하고 있으나, 이는 본 실시예의 기술 사상"}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "을 예시적으로 설명한 것에 불과한 것으로서, 본 실시예가 속하는 기술분야에서 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성에서 벗어나지 않는 범위에서 도 4에 기재된 순서를 변경하여 실행하거나 단계 S401 내 지 단계 S406 중 하나 이상의 단계를 병렬적으로 실행하는 것으로 다양하게 수정 및 변형하여 적용 가능할 것이 므로, 도 4는 시계열적인 순서로 한정되는 것은 아니다. 이상에서 전술한 본 발명의 일 실시예에 따른 방법은, 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램 (또는 어플리케이션)으로 구현되어 매체에 저장될 수 있다. 여기서, 컴퓨터는 앞에서 설명한 분석 장치일 수 있다. 상기 전술한 프로그램은, 상기 컴퓨터가 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 컴퓨터의 프로세서(CPU)가 상기 컴퓨터의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기 계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요 한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 컴퓨 터의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조관련 코드를 더 포함할 수 있다. 또한, 상기 컴퓨터의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠 한 다른 컴퓨터나 서버 등과 통신이 필요한 경우, 코드는 상기 컴퓨터의 통신 모듈을 이용하여 원격에 있는 어 떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등 에 대한 통신 관련 코드를 더 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2021-0131468", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0131468", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 태양광 발전 자동 관리 시스템을 설명하기 위한 도면이다. 도 2a 내지 도 2d는 본 발명에 따른 복수의 태양광 전지판의 물리적 배치 데이터를 설명하기 위한 예시도이다. 도 3은 본 발명에 따른 기준 태양광 전지판과 인접 태양광 전지판을 설명하기 위한 예시도이다. 도 4는 본 발명에 따른 태양광 발전 자동 관리하는 과정을 나타낸 흐름도이다."}
