{"patent_id": "10-2021-0174251", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0085765", "출원번호": "10-2021-0174251", "발명의 명칭": "컨텐츠와 연동한 시청자 설문 방법 및 장치", "출원인": "주식회사 케이티", "발명자": "백승주"}}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컨텐츠의 메타 데이터 및 상기 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성하는 단계;상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계;상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계; 및상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 메타 데이터는, 상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 설문 문항을 생성하는 단계는,상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나로부터 하나 이상의 키워드를 추출하고, 상기 하나 이상의 키워드를 이용하여 상기 설문 문항을 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계는,상기 컨텐츠 내에서 상기 설문 문항의 설문 보기로 사용될 복수의 객체를 선정하는 단계; 및상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 컨텐츠 내에서 상기 설문 문항의 설문 보기로 사용될 객체를 선정하는 단계는,상기 컨텐츠 내 객체 중 상기 등장 인물과 동일한 객체를 추출하고, 상기 추출된 객체를 상기 설문 보기로 사용될 객체로 선정하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4항에 있어서,공개특허 10-2023-0085765-3-상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계는,상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기 UI가 상기 선정된 복수의 객체와 함께 디스플레이되도록 상기 설문 조사를 제공하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4항에 있어서,상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계는,상기 선정된 복수의 객체가 복수의 이미지 프레임에 나누어 존재하는 경우, 상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기 UI가 하나의 화면에 디스플레이 되도록 상기 설문 조사를 제공하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 하나의 화면에 디스플레이 되도록 상기 설문 조사를 제공하는 단계는,상기 컨텐츠에서 상기 선정된 복수의 객체가 모두 등장한 이후, 상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기 UI가 하나의 화면에 디스플레이 되도록 상기 설문 조사를 제공하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 단계는,상기 시청자가 설문 조사에 대하여 응답하면, 복수의 시청자들의 응답에 기반한 상기 설문 결과를 상기 시청자에게 제공하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 복수의 시청자들의 응답에 기반한 상기 설문 결과를 상기 시청자에게 제공하는 단계는,상기 컨텐츠 내 복수의 객체에 각각 대응하는 복수의 선택 결과 UI가 상기 복수의 객체와 함께 디스플레이 되도록 상기 설문 결과를 제공하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서,상기 설문 문항을 생성하는 단계는,상기 컨텐츠에서, 다른 객체 카테고리보다 객체의 등장 횟수가 더 큰 객체 카테고리를 추출하고, 상기 객체 카테고리에 기반하여 상기 설문 문항을 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 2항에 있어서,공개특허 10-2023-0085765-4-상기 설문 문항을 생성하는 단계는,복수의 객체 카테고리 중 상기 메타 데이터에 부합하는 객체 카테고리를 추출하고, 상기 추출된 객체 카테고리에 기반하여 상기 설문 문항을 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1항에 있어서,상기 설문 문항을 생성하는 단계는,상기 컨텐츠 내 하나의 이미지 프레임 내에서의 객체의 등장 횟수가 임계 값보다 큰 객체 카테고리를 추출하고,상기 객체 카테고리에 기반하여 상기 설문 문항을 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1항에 있어서,상기 설문 문항을 생성하는 단계는,상기 컨텐츠 내 자막 또는 오디오로부터 키워드가 추출되면, 상기 설문 문항을 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14항에 있어서,상기 설문 문항을 생성하는 단계는,상기 컨텐츠의 메타 데이터를 이용하여 상기 키워드를 생성하는 단계;를 더 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 3항에 있어서,상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계는,상기 컨텐츠 내 등장 인물을 이용하여 설문의 대상이 되는 단일 인물을 선정하는 단계;상기 컨텐츠 내에서 상기 단일 인물을 나타내는 복수의 객체를 선정하는 단계; 및상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성하는 단계;를 포함하는컨텐츠와 연동한 시청자 설문 방법."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "방송 출력 장치와 통신하는 통신부; 및컨텐츠의 메타 데이터 및 상기 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성하고, 상기 컨텐츠내 객체에 상응하는 설문 보기를 생성하고, 상기 통신부를 통하여 상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하고, 상기 통신부를 통하여 상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 제어부;를 포함하는컨텐츠와 연동한 시청자 설문 장치."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17항에 있어서,공개특허 10-2023-0085765-5-상기 메타 데이터는, 상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나를 포함하는컨텐츠와 연동한 시청자 설문 장치."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 제어부는,상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나로부터 하나 이상의 키워드를 추출하고, 상기 하나 이상의 키워드를 이용하여 상기 설문 문항을 생성하는컨텐츠와 연동한 시청자 설문 장치."}
{"patent_id": "10-2021-0174251", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서,상기 제어부는,상기 컨텐츠 내에서 상기 설문 문항의 설문 보기로 사용될 복수의 객체를 선정하고,상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성하는컨텐츠와 연동한 시청자 설문 장치."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "컨텐츠와 연동한 시청자 설문 방법이 개시된다. 본 발명에 따른 컨텐츠와 연동한 시청자 설문 방법은, 컨텐츠의 메타 데이터 및 상기 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성하는 단계, 상기 컨텐츠 내 객 체에 상응하는 설문 보기를 생성하는 단계, 상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨 텐츠와 함께 시청자에게 제공하는 단계, 및, 상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 단계를 포함한다."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 조사를 생성하고, 컨텐츠 와 함께 실시간 설문조사를 제공할 수 있는, 컨텐츠와 연동한 시청자 설문 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존에는 TV를 통해 시청자에게 일방적으로 방송 컨텐츠를 제공하던 것에 반해, 최근에는 실시간으로 시청자들 의 참여를 유도하는 방송 컨텐츠들이 증가하고 있다. 오디션 프로그램에서 시청자들의 실시간 투표를 받아 그 결과를 제공해주는 것을 그 예로 들 수 있다. 다만 이것은 프로그램의 제작자가 직접 기획한 설문 조사만이 가능하다는 한계가 존재한다. 즉 오디션 프로그램 의 경우, 오디션 프로그램의 제작자는 “가장 좋아하는 참가자는?”, “이 참가자의 점수는?” 등의 설문 조사 를 배포한 후 그에 대한 응답을 수신한다. 따라서 설문 조사는 오디션 프로그램과 같은 특수한 컨텐츠에서, 매 우 제한적인 범위에서만 수행되는 문제가 있다. 또한 설문 조사는 TV가 아닌 전화 등의 별도의 매체에 의해 수 행되기 때문에, 열성적인 시청자 외에는 참여를 잘 하지 않게 되는 문제가 발생하다. 또한 방송 서비스 제공자가 설문 조사를 생성하고 TV를 통하여 배포하는 경우가 있다. 다만 이는 현재 방송 중 인 방송 컨텐츠와는 무관한 내용의 설문 조사인 것이 일반적이며, 또한 방송 서비스 제공자가 설문 조사를 직접 생성해야 하기 때문에 매우 제한적인 범위 내에서만 설문 조사가 수행되는 문제가 있다."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위한 것으로, 본 발명의 목적은 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 조사를 생성하고, 컨텐츠와 함께 실시간 설문조사를 제공할 수 있는, 컨텐츠와 연동한 시청자 설문 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 컨텐츠와 연동한 시청자 설문 방법은, 컨텐츠의 메타 데이터 및 상기 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성하는 단계, 상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계, 상 기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계, 및, 상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 단계를 포함한다. 이 경우 상기 메타 데이터는, 상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나를 포함할 수 있다. 이 경우 상기 설문 문항을 생성하는 단계는, 상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나로부터 하나 이상의 키워드를 추출하고, 상기 하나 이상의 키워드를 이용하여 상기 설문 문 항을 생성하는 단계를 포함할 수 있다. 이 경우 상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계는, 상기 컨텐츠 내에서 상기 설문 문항의 설문 보기로 사용될 복수의 객체를 선정하는 단계, 및, 상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성하는 단계를 포함할 수 있다. 이 경우 상기 컨텐츠 내에서 상기 설문 문항의 설문 보기로 사용될 객체를 선정하는 단계는, 상기 컨텐츠 내 객 체 중 상기 등장 인물과 동일한 객체를 추출하고, 상기 추출된 객체를 상기 설문 보기로 사용될 객체로 선정할 수 있다. 한편 상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계 는, 상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기 UI가 상기 선정된 복수의 객체와 함께 디스플 레이 되도록 상기 설문 조사를 제공하는 단계를 포함할 수 있다. 한편 상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계 는, 상기 선정된 복수의 객체가 복수의 이미지 프레임에 나누어 존재하는 경우, 상기 선정된 복수의 객체에 각 각 대응하는 복수의 설문 보기 UI가 하나의 화면에 디스플레이 되도록 상기 설문 조사를 제공하는 단계를 포함 할 수 있다. 이 경우 상기 하나의 화면에 디스플레이 되도록 상기 설문 조사를 제공하는 단계는, 상기 컨텐츠에서 상기 선정 된 복수의 객체가 모두 등장한 이후, 상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기 UI가 하나의 화면에 디스플레이 되도록 상기 설문 조사를 제공하는 단계를 포함할 수 있다. 한편 상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 단계는, 상기 시청자가 설문 조사에 대 하여 응답하면, 복수의 시청자들의 응답에 기반한 상기 설문 결과를 상기 시청자에게 제공하는 단계를 포함할 수 있다. 이 경우 상기 복수의 시청자들의 응답에 기반한 상기 설문 결과를 상기 시청자에게 제공하는 단계는, 상기 컨텐 츠 내 복수의 객체에 각각 대응하는 복수의 선택 결과 UI가 상기 복수의 객체와 함께 디스플레이 되도록 상기 설문 결과를 제공하는 단계를 포함할 수 있다. 한편 상기 설문 문항을 생성하는 단계는, 상기 컨텐츠에서, 다른 객체 카테고리보다 객체의 등장 횟수가 더 큰 객체 카테고리를 추출하고, 상기 객체 카테고리에 기반하여 상기 설문 문항을 생성하는 단계를 포함할 수 있다. 한편 상기 설문 문항을 생성하는 단계는, 복수의 객체 카테고리 중 상기 메타 데이터에 부합하는 객체 카테고리 를 추출하고, 상기 추출된 객체 카테고리에 기반하여 상기 설문 문항을 생성하는 단계를 포함할 수 있다. 한편 상기 설문 문항을 생성하는 단계는, 상기 컨텐츠 내 하나의 이미지 프레임 내에서의 객체의 등장 횟수가 임계 값보다 큰 객체 카테고리를 추출하고, 상기 객체 카테고리에 기반하여 상기 설문 문항을 생성하는 단계를 포함할 수 있다. 한편 상기 설문 문항을 생성하는 단계는, 상기 컨텐츠 내 자막 또는 오디오로부터 키워드가 추출되면, 상기 설 문 문항을 생성하는 단계를 포함할 수 있다. 이 경우 상기 설문 문항을 생성하는 단계는, 상기 컨텐츠의 메타 데이터를 이용하여 상기 키워드를 생성하는 단 계를 더 포함할 수 있다. 한편 상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계는, 상기 컨텐츠 내 등장 인물을 이용하여 설 문의 대상이 되는 단일 인물을 선정하는 단계, 상기 컨텐츠 내에서 상기 단일 인물을 나타내는 복수의 객체를선정하는 단계, 및, 상기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성하는 단계를 포함할 수 있다. 한편 본 발명에 따른 컨텐츠와 연동한 시청자 설문 장치는, 방송 출력 장치와 통신하는 통신부, 및, 컨텐츠의 메타 데이터 및 상기 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성하고, 상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하고, 상기 통신부를 통하여 상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조 사를 상기 컨텐츠와 함께 시청자에게 제공하고, 상기 통신부를 통하여 상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 제어부를 포함한다. 이 경우 상기 메타 데이터는, 상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나를 포함할 수 있다. 이 경우 상기 제어부는, 상기 컨텐츠의 개요, 상기 컨텐츠 내 등장 인물 및 상기 컨텐츠의 장르 중 적어도 하나 로부터 하나 이상의 키워드를 추출하고, 상기 하나 이상의 키워드를 이용하여 상기 설문 문항을 생성할 수 있다. 이 경우 상기 제어부는, 상기 컨텐츠 내에서 상기 설문 문항의 설문 보기로 사용될 복수의 객체를 선정하고, 상 기 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성할 수 있다."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 매우 다양한 컨텐츠에 대하여 설문 조사를 자동으로 생성할 수 있는 장점이 있다. 또한 컨텐 츠의 메타 데이터와 컨텐츠 내 객체를 이용하여 설문 조사를 생성함으로써, 컨텐츠의 성격이나 내용에 부합하는 설문 조사를 생성할 수 있는 장점이 있다. 본 발명에 따르면, 컨텐츠 내 객체를 설문 보기로 선정하는 방식으로 컨텐츠와 실시간 연동하는 설문 조사를 제 공하기 때문에, 시청자에게 즐거움을 선사하고 시청자의 참여율을 높힐 수 있는 장점이 있다. 본 발명에 따르면, 컨텐츠 내 객체와 연계하여 설문 결과를 제공하기 때문에, 사용자가 설문 결과를 한눈에 파 악하도록 하고 시청자에게 즐거움을 선사할 수 있는 장점이 있다."}
{"patent_id": "10-2021-0174251", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며,본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또 는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명을 구현함에 있어서 설명의 편의를 위하여 구성요소를 세분화하여 설명할 수 있으나, 이들 구성요소가 하나의 장치 또는 모듈 내에 구현될 수도 있고, 혹은 하나의 구성요소가 다수의 장치 또는 모듈들에 나뉘어져서 구현될 수도 있다. 도 1은 본 발명에 따른, 컨텐츠와 연동한 시청자 설문 장치를 설명하기 위한 블록도이다. 컨텐츠와 연동한 시청자 설문 장치는 방송 서비스 제공자가 운영하는 장치로, 예를 들어 컨텐츠와 연동한 시청자 설문 장치는 IPTV 서비스 제공을 위한 서버일 수 있다. 이 경우 컨텐츠와 연동한 시청자 설문 장치는 방송 제작자로부터 방송 프로그램을 제공받아, 방송 출력 장 치에 전송할 수 있다. 또한 컨텐츠와 연동한 시청자 설문 장치는 웹 접속, VOD 제공, 쇼핑 등의 각종 서비 스를 제공할 수 있다. 컨텐츠와 연동한 시청자 설문 장치는 통신부, 제어부 및 메모리를 포함할 수 있다. 통신부는 컨텐츠와 연동한 시청자 설문 장치와 외부 장치 사이의 유선 또는 무선 통신을 지원할 수 있다. 구체적으로 통신부는 컨텐츠와 연동한 시청자 설문 장치를 인터넷망을 포함하는 유/무선 네트워크와 연결하기 위한 인터페이스를 제공할 수 있다. 이 경우 컨텐츠와 연동한 시청자 설문 장치는 접속된 네트워 크 또는 접속된 네트워크에 링크된 다른 네트워크를 통해, 방송 출력 장치와 데이터를 송신 또는 수신할 수 있 다. 메모리는 제어부 내의 각 신호 처리 및 제어를 위한 프로그램, 컨텐츠, 신호 처리된 영상, 음성 또는 데이터 신호 등을 저장할 수 있다. 또한 메모리는 컨텐츠와 연동한 시청자 설문 장치의 동작을 위한 응용 프로그램 또는 데이터를 저장 할 수 있다. 한편 제어부는 컨텐츠와 연동한 시청자 설문 장치의 전반적인 동작을 제어할 수 있다. 한편 제어부는 방송 출력 장치에 컨텐츠를 전송할 수 있다. 또한 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 생성하고, 생성된 설문 조사를 방송 출력 장치에 전송할 수 있다. 한편 방송 출력 장치는, 셋탑 박스와 같은 영상 처리 장치일 수 있다. 그리고 영상 처리 장치는 컨텐츠와 연동 한 시청자 설문 장치로부터 수신된 컨텐츠 및 설문 조사를 디스플레이 장치에 출력할 수 있다. 이 경우 디 스플레이 장치는 수신된 컨텐츠 및 설문 조사를 디스플레이 할 수 있다. 또한 방송 출력 장치는, TV와 같은 디스플레이 장치일 수 있다. 이 경우 디스플레이 장치는, 컨텐츠와 연동한 시청자 설문 장치로부터 수신된 컨텐츠 및 설문 조사를 디스플레이할 수 있다. 도 2는 본 발명에 따른 컨텐츠와 연동한 시청자 설문 방법을 설명하기 위한 순서도이다. 본 발명에 따른 컨텐츠와 연동한 시청자 설문 방법은, 컨텐츠의 메타 데이터 및 상기 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성하는 단계(S210), 상기 컨텐츠 내 객체에 상응하는 설문 보기를 생성하는 단계(S230), 상기 설문 문항 및 상기 설문 보기를 포함하는 설문 조사를 상기 컨텐츠와 함께 시청자에게 제공하는 단계(S250), 및, 상기 설문 조사에 대응하는 설문 결과를 상기 시청자에게 제공하는 단계(S270)를 포함한다. 도 3은 본 발명에 따른, 컨텐츠의 메타 데이터를 설명하기 위한 도면이다. 본 발명에서 설명하는 컨텐츠는 방송 프로그램을 의미할 수 있다. 이 경우 컨텐츠와 연동한 시청자 설문 장치 는 방송 제작자로부터 방송 프로그램을 제공받아, 방송 출력 장치에 전송할 수 있다. 또한 컨텐츠는, VOD 등, 방송 프로그램 이외의 컨텐츠를 포함할 수 있다. 이 경우 컨텐츠와 연동한 시청자 설문 장치는 자체 보유한 컨텐츠 또는 외부 서버에서 보유한 컨텐츠를 방송 출력 장치에 전송할 수 있다. 한편 컨텐츠의 메타 데이터는, 컨텐츠를 설명하기 위한 데이터일 수 있다. 메타 데이터는 컨텐츠 제작자에 의해 생성될 수 있으나 이에 한정되지 않으며, 제어부가 직접 컨텐츠와 관련된 정보를 수집함으로써 생성할 수 도 있다. 한편 메타 데이터는, 컨텐츠의 제목, 편성 시간, 장르, 개요, 제작자, 등장 인물 등을 포함할 수 있다. 이 경우 제어부는 메타 데이터로부터, 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르 중 적어도 하나를 추출하고, 추출된 정보를 이용하여 설문 문항을 생성할 수 있다. 여기서 컨텐츠의 개요는, 컨텐츠의 줄거리나 내용을 간략하게 추려낸 주요 정보를 의미할 수 있다. 예를 들어 도 3을 참고하면, 컨텐츠가 방송 프로그램인 경우, 메타 데이터에는 방송 프로그램의 내용을 간략히 설명한 프 로그램 설명이 포함될 수 있다. 한편 컨텐츠의 등장 인물은 컨텐츠 내에서 등장하는 하나 이상의 인물을 의미할 수 있다. 또한 컨텐츠의 등장 인물은 컨텐츠 내에서 중요한 역할을 담당하는 주요 인물을 포함할 수 있다. 또한 컨텐츠의 등장 인물은 컨텐츠 의 주인공을 포함할 수 있다. 한편 컨텐츠의 장르는, 드라마, 미스터리, 서바이벌, 오디션, 멜로, 공포, 스릴러, 액션, 음식, 여행, 뉴스, 다 큐멘터리 등을 포함할 수 있다. 도 4는 본 발명에 따른, 컨텐츠 내 객체를 설명하기 위한 도면이다. 컨텐츠 내 객체는 컨텐츠에서 등장하는 인물 또는 사물를 포함할 수 있다. 예를 들어 도 4를 참고하면, 컨텐츠의 하나의 이미지 프레임에 망고, 바나나, 파파야 등의 과일이 등장한다. 이 경우 망고, 바나나, 파파야 등은, 컨텐츠 내 객체일 수 있다. 또한 사물은, 어느 지역을 대표하거나 다른 지역과 구별되는 지형, 시설물 등을 가리키는 랜드마크를 포함할 수 도 있다. 또한 컨텐츠 내 객체는, 하나의 이미지 프레임에 등장하는 객체뿐만 아니라, 하나의 방송 단위를 구성하는 컨텐 츠에서 등장하는 객체를 의미할 수 있다. 예를 들어 특정 영화가 2시간 동안 상영되고, 전반 1시간 동안은 A 인 물만, 후반 1시간 동안은 B 인물만 등장하는 경우, 컨텐츠 내 객체는 A 인물 및 B 인물일 수 있다. 한편 본 발명에서는 컨텐츠와 연동한 시청자 설문을 진행하고 설문 결과를 제공하는 것을 목적으로 하며, 따라 서 컨텐츠와 연동한 시청자 설문 장치는 설문 조사를 생성한다. 이 경우 설문 조사는 설문 문항과 설문 보기로 구성될 수 있다. 예를 들어 설문 문항은“다음 중 범인은 누구로 예상되십니까?”일 수 있다. 또한 4개의 설문 보기는, “홍길동”, “고길동”, “철수”, “순이”일 수 있다. 한편 제어부는 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성할 수 있다(S210). 구체적으로, 제어부는 컨텐츠의 메타 데이터를 이용하여 설문 문항을 생성할 수 있다. 이 경우 제어부 는 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르 중 적어도 하나로부터 하나 이상의 키워드를 추 출하고, 하나 이상의 키워드를 이용하여 설문 문항을 생성할 수 있다. 일 례로, 도 3을 다시 참고하면, 컨텐츠의 개요에는 “살인을 한 자는 누구인가?”라는 키워드가 포함되어 있다. 이 경우 제어부는 “살인을 한 자는 누구인가?”라는 키워드를 이용하여 설문 문항을 생성할 수 있 다. 예를 들어 제어부는 키워드를 그대로 이용하거나, 키워드를 다른 단어로 변환하거나, 다른 단어들을 추가하여, “다음 중 살인범은 누구입니까?”라는 설문 문항을 생성할 수 있다. 다른 예로 도 3을 참고하면, 컨텐츠의 장르 및 컨텐츠의 개요에는 “서바이벌”이라는 키워드(320, 330)가 포함 되어 있다. 이 경우 제어부는 키워드(320, 330)를 이용하여 “다음 중 살아남는 사람은 누구입니까?”라는 설문 문항을 생성할 수 있다. 다른 예를 들어 도 3을 참고하면, 컨텐츠의 장르 및 컨텐츠의 개요에는 컨텐츠가 오디션 프로그램임을 알 수 있 는 키워드(340, 350, 360)가 포함되어 있다. 이 경우 제어부는 키워드(340, 350, 360)를 이용하여 “당신 이 가장 좋아하는 소녀를 선택하여 주세요.”라는 설문 문항을 생성할 수 있다. 다른 예를 들어 컨텐츠의 등장 인물(주인공)이 A라는 정보가 메타데이터에 포함되어 있다고 가정한다. 이 경우 제어부는 등장 인물(주인공) A와 관련된 설문 문항을 생성할 수 있다. 예를 들어 제어부는 “A에게 가장 잘 어울리는 의상은 무엇입니까?”라는 설문 문항을 생성할 수 있다. 한편 메모리에는 복수의 키워드가 저장될 수 있으며, 이 경우 제어부는 메모리에 저장된 복수의 키워드와 매칭되는 키워드를 메타 데이터로부터 추출할 수 있다. 다만 이에 한정되지 않으며, 제어부는 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르로부터 키워 드를 추출하도록 트레이닝된 인공지능 모델을 이용할 수도 있다. 이 경우 제어부는 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르를 포함하는 메타 데이터를 인공지능 모델에 제공하고, 인공지능 모델이 메타 데 이터에 기반하여 출력한 키워드를 획득할 수 있다. 또한 제어부는 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르를 이용하여 설문 문항을 출력하도록 트레이닝된 인공지능 모델을 이용할 수도 있다. 이 경우 제어부는 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르를 포함하는 메타 데이터를 인공지능 모델에 제공하고, 인공지능 모델이 메타 데이터에 기반하여 출력한 설문 문항을 획득할 수 있다. 또한 제어부는 메타 데이터를 언어 모델에 제공하거나 메타 데이터로부터 추출된 키워드를 언어 모델에 제 공하여 메타 데이터에 포함되는 텍스트의 의미를 획득하고, 텍스트의 의미에 기반하여 설문 문항을 생성할 수 있다. 한편 메모리는 복수의 범용 설문 항목을 포함할 수 있다. 여기서 범용 설문 항목이란, 다양한 컨텐츠에 범 용적으로 적용될 수 있는 설문 항목을 의미할 수 있다. 예를 들어 범용 설문 항목은 “당신이 가장 선호하는 객 체는 무엇입니까?”일 수 있다. 그리고 제어부는 컨텐츠 내 객체를 이용하여 설문 문항을 생성할 수 있다. 구체적으로 제어부는 오브 젝트 인식을 수행하여 컨텐츠 내 객체를 인식할 수 있다. 오브젝트 인식을 수행하는 다양한 공지 기술이 존재하 는 바, 자세한 설명은 생략한다. 이 경우 제어부는 컨텐츠에서 객체의 등장 횟수에 기초하여 설문 문항을 생성할 수 있다. 구체적으로, 제 어부는 객체 카테고리 별 객체의 등장 횟수를 산출할 수 있다. 여기서 객체 카테고리란, 공통되거나 유사한 특징을 가지는 객체들을 하나로 표현하는 개념일 수 있다. 예를 들 어 객체 카테고리(자동차 카테고리)에 속하는 객체들은, 다양한 제조사에서 제작한 다양한 자동차 모델들일 수 있다. 그리고 컨텐츠에 다양한 객체들이 등장하는 경우, 제어부는 객체 카테고리 별 객체의 등장 횟수를 산출할 수 있다. 예를 들어 제어부는 자동차 들의 등장 횟수를 합산하여 자동차 카테고리에 대응하는 등장 횟수를 산출하고, 음식의 등장 횟수를 합산하여 음식 카테고리에 대응하는 등장 횟수를 산출할 수 있다. 이 경우 제어부는 컨텐츠에서, 다른 객체 카테고리보다 객체의 등장 횟수가 더 큰 객체 카테고리를 추출할 수 있다. 예를 들어 자동차 들의 등장 횟수가 150이고 음식들의 등장 횟수가 50인 경우, 제어부는 자동차 카테고리를 추출할 수 있다. 한편 셋 이상의 객체 카테고리가 존재하는 경우, 제어부는 객체의 등장 횟수가 가장 큰 객체 카테고리를 추출할 수도 있다. 한편 제어부는 컨텐츠 내 하나의 이미지 프레임 내에서의 객체의 등장 횟수가 임계 값보다 큰 객체 카테고 리를 추출할 수도 있다. 예를 들어 임계 값이 4이고, 바나나, 사과, 참외, 망고, 파파야가 하나의 이미지 프레 임에 등장한다고 가정한다. 이 경우 과일 카테고리에 속하는 객체가 하나의 이미지 프레임 내에서 5회 등장하는바, 제어부는 과일 카테고리를 추출할 수 있다. 한편 객체 카테고리가 추출되면, 제어부는 객체 카테고리에 기반하여 설문 문항을 생성할 수 있다. 구체적으로 객체 카테고리가 추출된 경우, 제어부는 메모리에 저장된 범용 설문 항목을 그대로 사용 할 수도 있다. 예를 들어 제어부는 “당신이 가장 선호하는 객체는 무엇입니까?”라는 설문 항목을 생성할 수 있다. 다만 이에 한정되지 않으며, 제어부는 추출된 객체 카테고리를 이용하여 범용 설문 항목을 변형함으로써 설문 문항을 생성할 수도 있다. 예를 들어 과일 카테고리가 추출된 경우, 제어부는 “당신이 가장 선호하 는 과일은 무엇입니까?”라는 설문 문항을 생성할 수도 있다. 한편 제어부는 컨텐츠 내 객체 및 메타 데이터를 이용하여 설문 문항을 생성할 수 있다. 일 례로, 제어부는 복수의 객체 카테고리 중 메타 데이터에 부합하는 카테고리를 추출하고, 추출된 카테고 리에 기반하여 설문 문항을 생성할 수 있다. 예를 들어 객체의 등장 횟수가 임계 값보다 큰 복수의 카테고리(자동차 카테고리, 음식 카테고리)가 추출되었다 고 가정한다. 그리고 메타 데이터에는, 컨텐츠의 장르가 음식이라는 정보가 포함되어 있다. 이 경우 제어부 는 음식 카테고리를 추출하고, 음식 카테고리에 기반하여 설문 문항을 생성할 수 있다. 한편 이하에서는, S210, S230, S250, S270를 개별적인 실시 예를 통하여 설명한다. 도 5는 본 발명에 따른 제1 실시 예를 설명하기 위한 도면이다. 제어부는 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성할 수 있 다(S210). 앞서 설명한 바와 같이, 제어부는 컨텐츠의 개요, 컨텐츠 내 등장 인물 및 컨텐츠의 장르 중 적 어도 하나로부터 하나 이상의 키워드를 추출하고, 추출된 키워드를 이용하여 “다음 중 범인은 누구일까요?”와 같은 설문 문항을 생성할 수 있다. 다음으로 제어부는 컨텐츠 내 객체에 상응하는 설문 보기를 생성할 수 있다(S230). 구체적으로, 컨텐츠에는 매우 다양한 객체들이 존재한다. 따라서 매우 다양한 객체들 중 설문 보기로 사용될 객 체가 선정되어야 한다. 따라서 제어부는 컨텐츠 내에서 설문 문항의 설문 보기로 사용될 복수의 객체를 선 정할 수 있다. 이 경우 제어부는 생성된 설문 문항에 기초하여 객체를 선정할 수 있다. 예를 들어 설문 문항이 “다음 중 범인은 누구일까요?”인 경우, 설문 보기로 사용될 객체는 사물이 아니라 인물이다. 이 경우 제어부는 컨 텐츠에 등장하는 다양한 객체 중 인물을 추출하여 선정할 수 있다. 한편, 컨텐츠에는 매우 다양한 인물들이 존재한다. 따라서 매우 다양한 인물들 중 설문 보기로 사용될 인물이 선정되어야 한다. 따라서 제어부는 메타 데이터에 포함되는 등장 인물을 컨텐츠로부터 추출할 수 있다. 더욱 구체적으로 제어부는 오브젝트 인식 기술을 이용하여 컨텐츠 내 인물의 식별 정보(예를 들어 이름)을 추출할 수 있다. 그리고 제어부는 컨텐츠 내 다양한 인물들 중 메타 데이터에 포함되는 등장 인물과 동일 한 인물을 추출할 수 있다. 그리고 제어부는 추출된 인물을 설문 보기로 사용될 인물로 선정할 수 있다. 그리고 나서 제어부는 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성할 수 있다. 예를 들 어 A 인물(캐리), B 인물(케이트), C 인물(니콜), D 인물(제시카)이 선정된 경우, 제어부는 A 인물(캐리), B 인물(케이트), C 인물(니콜), D 인물(제시카)를 설문 보기로써 생성할 수 있다. 다음으로, 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 컨텐츠와 함께 시청자에게 제공할 수 있다(S250). 여기서 설문 조사를 컨텐츠와 함께 시청자에게 제공한다는 것은, 제어부가 방송 출력 장치에 컨텐츠를 전 송하고, 또한 방송 출력 장치에 설문 조사를 전송하는 것을 의미할 수 있다. 그리고 제어부는 지정된 시간에 설문 조사가 컨텐츠와 함께 디스플레이 되도록, 설문 조사를 방송 출력 장 치에 전송할 수 있다. 예를 들어 제어부는 컨텐츠가 실시간으로 전송되는 중, 지정된 시간에 설문 조사를 컨텐츠에 삽입하여 방송 출력 장치에 전송할 수 있다. 다만 이에 한정되지 않으며, 제어부는 방송 출력 장치에 컨텐츠를 전송하고, 설문 조사는 컨텐츠와는 별도 로 전송할 수 있다. 또한 제어부는 설문 조사가 디스플레이 될 시간 정보를 방송 출력 장치에 전송할 수 있다. 이 경우 방송 출력 장치는 설문 조사 및 시간 정보를 이용하여, 설문 조사를 지정된 시간에 컨텐츠와 함 께 디스플레이 할 수 있다. 또한 설문 조사를 컨텐츠와 함께 시청자에게 제공한다는 것은, 설문 조사가 컨텐츠와 함께 디스플레이 되도록, 설문 조사를 방송 출력 장치에 전송하는 것을 의미할 수 있다. 즉 방송 출력 장치에 컨텐츠를 전송하는 주체는 컨텐츠와 연동한 시청자 설문 장치가 아니어도 무방하다. 즉 다른 장치가 방송 출력 장치에 컨텐츠를 전송 하고, 컨텐츠와 연동한 시청자 설문 장치의 제어부는 설문 조사 및 설문 조사가 디스플레이 될 시간 정보를 방송 출력 장치에 전송할 수 있다. 한편 시간 정보란, 설문 조사가 이미지 프레임에 포함되는 시간에 대한 정보일 수도 있으며, 설문 조사가 포함 되는 이미지 프레임에 대한 정보일 수도 있다. 또한 설문 조사가 이미지 프레임에 포함된다는 것은, 설문 조사 가 이미지 프레임에 중첩되는 것을 의미할 수도 있다. 한편 도 5a를 참고하면, 제어부는 선정된 복수의 객체(510, 520, 530, 540)에 각각 대응하는 복수의 설문 보기 UI(511, 521, 531, 541)가 선정된 복수의 객체(510, 520, 530, 540)와 함께 디스플레이 되도록 설문 조사 를 제공할 수 있다. 구체적으로 설문 보기 UI가 대응하는 객체와 함께 디스플레이 된다는 것은, 설문 보기 UI가 대응하는 객체와 동 일한 이미지 프레임에 디스플레이 된다는 것을 의미할 수 있다. 이 경우 제어부는 설문 보기 UI가 대응하 는 객체와 동일한 이미지 프레임에 디스플레이 되도록, 설문 보기 UI가 디스플레이 되는 시간을 지정할 수 있다. 예를 들어 제어부는 제1 설문 보기 UI가 제1 객체와 함께 디스플레이 되도록, 제1 객체 가 등장하는 시간을 제1 설문 보기 UI가 이미지 프레임에 포함되는 시간으로 지정할 수 있다. 또한 설문 보기 UI가 대응하는 객체와 함께 디스플레이 된다는 것은, 설문 보기 UI가 대응하는 객체를 나타낸다 는 것이 식별 가능하도록 디스플레이 되는 것을 의미할 수 있다. 예를 들어 도 5a를 참고하면, 제1 설문 보기 UI는 제1 객체와 중첩되어 디스플레이 된다. 한편 제어부는 설문 보기 UI를 대응하는 객체와 인 접하여 배치하거나, 대응하는 객체와 중첩하여 배치하거나, 기타 다양한 방법을 이용하여, 설문 보기 UI가 대응 하는 객체를 나타낸다는 것이 식별 가능하도록 설문 보기를 제공할 수 있다. 한편 복수의 설문 보기 UI(511, 521, 531, 541) 각각은, 상응하는 객체의 식별 정보를 포함할 수 있다. 예를 들 어 제1 설문 보기 UI는 제1 객체의 이름(캘리)를 포함할 수 있다. 한편 선정된 복수의 객체가 하나의 이미지 프레임에 포함되는 경우, 제어부는 선정된 복수의 객체(510, 520, 530, 540)에 각각 대응하는 복수의 설문 보기 UI(511, 521, 531, 541)가 하나의 이미지 프레임에 디스플 레이 되도록 설문 조사를 제공할 수 있다. 구체적으로 제어부는 선정된 복수의 객체를 모두 포함하는 이미지 프레임을 검색할 수 있다. 그리고 제어 부는 검색된 이미지 상에서 복수의 설문 보기 UI(511, 521, 531, 541)가 디스플레이 되도록 설문조사를 제 공할 수 있다. 한편 선정된 복수의 객체가 복수의 이미지 프레임에 나눠서 존재하는 경우가 발생할 수 있다. 예를 들어 제1 장 면(예를 들어 컨텐트의 10분 내지 12분 구간)에는 A 인물(캐리)와 B 인물(케이트)이 등장하고, 제2 장면(예를 들어 컨텐트의 13분 내지 15분 구간)에는 C 인물(니콜), D 인물(제시카)이 등장하는 경우를 들 수 있다. 이와 같이 선정된 복수의 객체가 복수의 이미지 프레임에 나누어 존재하는 경우에도, 제어부는 선정된 복 수의 객체에 각각 대응하는 복수의 설문 보기 UI가 하나의 화면에 디스플레이 되도록 설문 조사를 제공할 수 있 다. 구체적으로 도 5b를 참고하면, 제어부는 선정된 복수의 객체에 상응하는 복수의 이미지(560, 570, 580, 590)가 하나의 화면에 디스플레이 되도록 설문 조사를 제공할 수 있다. 여기서 선정된 복수의 객체에 상응하는 복수의 이미지(560, 570, 580, 590)는, 설문 조사가 제공되기 이전의 이미지 프레임으로부터 추출한 이미지일 수 있다. 다만 이에 한정되지 않으며, 선정된 복수의 객체에 상응하는 복수의 이미지(560, 570, 580, 590)는 선 정된 복수의 객체의 식별 정보에 기반하여 메모리 또는 외부 장치를 검색하여 획득한 이미지일 수 있다. 또한 제어부는 복수의 이미지(560, 570, 580, 590)에 각각 대응하는 복수의 설문 보기 UI(561, 571, 581, 591)가 복수의 이미지(560, 570, 580, 590)와 함께 디스플레이 되도록 설문 조사를 제공할 수 있다.또한, 컨텐츠에서 상기 선정된 복수의 객체가 모두 등장한 이후, 제어부는 선정된 복수의 객체에 각각 대 응하는 복수의 설문 보기 UI(561, 571, 581, 591)가 하나의 화면에 디스플레이 되도록 설문 조사를 제공할 수 있다. 예를 들어 복수의 설문 보기 UI(561, 571, 581, 591)가 방송 시간이 10분이 되는 시점에 이미지 프레임에 포함 된다고 가정한다. 이 경우 선정된 복수의 객체는 이전의 방송 시간(0분 내지 10분)에 이미 등장한 상태일 수 있 다. 이 경우 제어부는 컨텐츠의 방송이 종료된 후, 또는 중간 광고 시간에, 복수의 설문 보기 UI(561, 571, 581, 591)가 디스플레이 되도록 설문 조사를 제공할 수도 있다. 다음으로, 제어부는 설문 조사에 대응하는 설문 결과를 시청자에게 제공할 수 있다(S270). 구체적으로 컨텐츠를 시청하는 시청자는 설문 조사에 대하여 응답할 수 있다. 예를 들어 시청자는 자신의 리모 콘을 이용하여, 복수의 설문 보기 UI(561, 571, 581, 591) 중 제1 설문 보기 UI를 선택할 수 있다. 이 경 우 방송 출력 장치는, 시청자의 응답을 컨텐츠와 연동한 시청자 설문 장치에 전송할 수 있다. 그리고 시청자가 설문 조사에 대하여 응답하면, 제어부는 복수의 시청자들의 응답에 기반한 설문 결과를 시청자에게 제공할 수 있다. 이 경우 제어부는 시청자의 응답을 실시간으로 반영하여 설문 결과를 생성할 수 있다. 그리고 제어부는 컨텐츠 내 복수의 객체에 각각 대응하는 복수의 선택 결과 UI가 복수의 객체와 함께 디스 플레이 되도록 설문 결과를 제공할 수 있다. 이와 관련해서는 도 6을 참고하여 설명한다. 도 6은 본 발명에 따른, 선택 결과 UI를 표시하는 방법을 설명하기 위한 도면이다. 선택 결과 UI는, 상응하는 객체가 투표를 받은 비율, 상응하는 객체의 투표 수 및 상응하는 객체의 투표 순위 중 적어도 하나를 포함할 수 있다. 그리고 제어부는 컨텐츠로부터 S230에서 선정된 복수의 객체를 다시 추출할 수 있다. 그리고 도 6a를 참고 하면, 제어부는 선정된 복수의 객체에 각각 대응하는 복수의 선택 결과 UI(34%, 12%, 47%, 3%, 28%)가 선 정된 복수의 객체와 함께 디스플레이 되도록 설문 조사를 제공할 수 있다. 한편 특정 객체에 대응하는 선택 결과 UI는 상기 특정 객체와 인접하여 배치될 수 있으며, 이 경우 특정 객체에 대응하는 선택 결과 UI는 다른 객체에 중첩될 수 있다. 이 경우 시청자는 선택 결과 UI가 어느 객체에 대응하는 것인지 판단하기 어려울 수 있다. 따라서 제어부는 특정 객체에 대응하는 선택 결과 UI가 다른 객체와 중첩되지 않도록, 특정 객체에 대응하는 선택 결과 UI를 배치할 수 있다. 추가적으로 도 6b를 참고하면, 선택 결과 UI(620, 630)는 해당 객체의 순위를 포함할 수 있다. 예를 들어 제1 선택 결과 UI는 상응하는 객체의 순위가 1위라는 것을 나타내고, 제2 선택 결과 UI는 상응하는 객체 의 순위가 2라는 것을 나타낼 수 있다. 또한 제어부는 일정 순위 이상의 객체가 확대되어 표시되도록 컨텐츠를 제공할 수 있다. 도 7은 본 발명에 따른 제2 실시 예를 설명하기 위한 도면이다. 앞선 제1 실시 예에 대한 설명은, 모순되지 않는 범위에서, 제2 실시 예에도 적용될 수 있다. 제어부는 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성할 수 있 다(S210). 구체적으로 제어부는 컨텐츠 내 객체를 이용하여 설문 문항을 생성할 수 있다. 이 경우 제어부는 객 체 카테고리 별 객체의 등장 횟수를 산출할 수 있다. 그리고 제어부는 컨텐츠에서, 다른 객체 카테고리보다 객체의 등장 횟수가 더 큰 객체 카테고리를 추출할 수 있다. 예를 들어 자동차 들의 등장 횟수가 150이고 음식들의 등장 횟수가 50인 경우, 제어부는 자동차 카테고리를 추출할 수 있다.또한 제어부는 컨텐츠 내 하나의 이미지 프레임 내에서의 객체의 등장 횟수가 임계 값보다 큰 객체 카테고 리를 추출할 수도 있다. 예를 들어 하나의 이미지 프레임 내에서의 자동차의 등장 횟수가 임계 값보다 큰 경우, 제어부는 자동차 카테고리를 추출할 수 있다. 그리고 자동차 카테고리가 추출되면, 제어부는 자동차 카테고리에 기반하여 설문 문항을 생성할 수 있다. 예를 들어 제어부는 “당신이 가장 선호하는 자동차는 무엇입니까?”라는 설문 항목을 생성할 수 있다. 다음으로 제어부는 컨텐츠 내 객체에 상응하는 설문 보기를 생성할 수 있다(S230). 이 경우 제어부는 추출된 객체 카테고리에 속하는 객체를 설문 보기로 사용할 수 있다. 예를 들어 제어부 는 자동차 카테고리에 속하는 자동차들을 설문 보기로 사용할 수 있다. 한편 제어부는 오브젝트 인식 기술을 이용하여, 추출된 객체 카테고리에 속하는 객체의 식별 정보를 추출 할 수 있다. 예를 들어 객체의 식별 정보는, 자동차의 제조사, 모델명 등을 포함할 수 있다. 다음으로, 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 컨텐츠와 함께 시청자에게 제공할 수 있다(S250). 구체적으로 도 7을 참고하면, 제어부는 특정 객체 카테고리에 속하는 복수의 객체에 각각 대응하는 복수의 설문 보기 UI(711, 712, 713, 714, 715, 716)가 복수의 객체와 함께 디스플레이 되도록 설문 조사를 제공할 수 있다. 여기서 복수의 설문 보기 UI(711, 712, 713, 714, 715, 716)는 상응하는 객체의 식별 정보를 포함할 수 있다. 다음으로, 제어부는 설문 조사에 대응하는 설문 결과를 시청자에게 제공할 수 있다(S270). 도 8은 본 발명에 따른 제3 실시 예를 설명하기 위한 도면이다. 앞선 제1 실시 예 및 제2 실시 예에 대한 설명은, 모순되지 않는 범위에서 제3 실시 예에도 적용될 수 있다. 앞서 설문 문항은, 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 생성되는 것으로 설명 한 바 있다. 추가적으로, 설문 문항은 컨텐츠 내 자막 또는 오디오를 이용하여 생성될 수 있다. 구체적으로 제어부는 컨텐츠 내 자막 또는 오디오로부터 하나 이상의 키워드를 추출하고, 추출된 하나 이 상의 키워드를 이용하여 설문 문항을 생성할 수 있다. 일 례로, 도 8a을 참고하면, “오늘 이 상황까지 온건 모두 내 잘못”이라는 자막이 생성되어 있으며, 이 경우 제어부는 “잘못”이라는 키워드를 추출할 수 있다. 이 경우 제어부는 메모리에 저장된 키워드와 자막 또는 오디오에 포함된 단어의 일치 여부를 이용하 여 자막 또는 오디오로부터 키워드를 추출할 수 있다. 여기서 메모리에 저장된 키워드는, 논쟁을 발생시키 거나 의견을 다양하게 낼 수 있는 표현일 수 있다. 예를 들어 “잘못”의 경우, 잘못인지 잘못이 아닌지에 대한 논쟁이나 다양한 의견이 존재할 수 있다. 그리고 컨텐츠 내 자막 또는 오디오로부터 키워드가 추출되면, 제어부는 설문 문항을 생성할 수 있다. 메모리는 복수의 범용 설문 항목을 포함할 수 있다. 그리고 복수의범용 설문 항목은, 시청자의 생각이나 의견을 요청하는 설문 항목을 포함할 수 있다. 예를 들어 시청자의 생각이나 의견을 요청하는 설문 항목은, “ 여러분은 어떻게 생각하세요?”일 수 있다. 그리고 제어부는 메모리에 포함된 복수의 범용 설문 항목 중 어느 하나를 선택할 수 있다. 또한 제어부는 추출된 키워드 및 자막 또는 오디오로부터 획득되는 콘텍스트 중 적어도 하나에 기초하여 설문 문항을 선택할 수도 있다. 다음으로, 제어부는 복수의 설문 보기를 생성할 수 있다. 이 경우 복수의 설문 보기는, 키워드와 관련된 다양한 의견을 나타낼 수 있다. 또한 복수의 설문 보기는 각각, 키워드를 포함할 수 있다. 예를 들어 도 8b를 참고하면, 제1 설문 보기는 “A의 잘못이 맞다”, 제2 설문 보기는 “A의 잘못이 아니다”일 수 있다. 또한 제어부는 추출된 키워드뿐만 아니라, 자막 또는 오디오로부터 획득되는 콘텍스트에 기반하여 설문 보 기를 생성할 수도 있다.한편 제어부는 컨텐츠의 메타 데이터를 이용하여 키워드를 생성하고, 생성된 키워드를 메모리에 저장 할 수 있다. 예를 들어 컨텐츠의 개요에 “삼각 관계에 빠진 이 여자의 선택은?”이라는 내용이 포함된 경우, 제어부는 “선택”이라는 키워드를 추출하여 메모리에 저장할 수 있다. 그리고 자막 또는 오디오에 “B를 선택하겠어.”라는 문장이 포함되는 경우, 제어부는 자막 또는 오디오로부터 “선택”이라는 키워드 를 추출할 수 있다. 이 경우 제어부는 “등장 인물의 선택에 대해 어떻게 생각하세요?”라는 설문 항목을 생성할 수 있다. 다음으로, 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 컨텐츠와 함께 시청자에게 제공할 수 있다. 또한 제어부는 설문 조사에 대응하는 설문 결과를 시청자에게 제공할 수 있다. 도 9는 본 발명에 따른 제4 실시 예를 설명하기 위한 도면이다. 앞선 제1 내지 제3 실시 예에 대한 설명은, 모순되지 않는 범위에서, 제4 실시 예에 적용될 수 있다. 제어부는 컨텐츠의 메타 데이터 및 컨텐츠 내 객체 중 적어도 하나를 이용하여 설문 문항을 생성할 수 있 다(S210). 구체적으로 제어부는, 컨텐츠 내 등장 인물을 이용하여, 설문의 대상이 되는 단일 인물을 선정할 수 있다. 더욱 구체적으로 제어부는 메타 데이터에 포함되는 등장 인물 중 하나를 선정할 수 있다. 이 경우 제어부 는 등장 인물 중 주인공을 선정할 수 있으며, 등장 인물의 성별에 기초하여 여성 주인공을 선정할 수도 있 다. 이 경우 제어부는 선정된 등장 인물과 관련된 설문 문항을 생성할 수 있다. 예를 들어 제어부는 “A 인물의 코디네이션들 중 가장 선호하는 스타일은 무엇인가요?”라는 설문 문항을 생성할 수 있다. 한편 액션 장르나 좀비물 장르의 경우 시청자들이 관심을 가질만한 코디네이션이 잘 등장하지 않는데 반해, 멜 로 장르의 경우 시청자들이 관심을 가질만한 코디네이션이 많이 등장할 수 있다. 따라서 제어부는 메타 데 이터에 포함되는 등장 인물 및 장르를 이용하여 설문 문항을 생성할 수도 있다. 또한 제어부는 메타 데이터에 포함되는 컨텐츠의 개요 및 등장 인물을 이용하여 설문 문항을 생성할 수도 있다. 예를 들어 등장 인물에 A가 포함되고 컨텐츠의 개요에 “자신감 넘치고 화려한 스타일의 A”라는 내용이 포함되는 경우, 제어부는 “A 인물의 코디네이션들 중 가장 선호하는 스타일은 무엇인가요?”라는 설문 문 항을 생성할 수 있다. 다음으로 제어부는 컨텐츠 내 객체에 상응하는 설문 보기를 생성할 수 있다(S230). 구체적으로 제어부는 컨텐츠 내에서, 앞서 선정된 단일 인물을 나타내는 복수의 객체를 선정할 수 있다. 이 경우 복수의 객체는 설문 보기로 사용될 수 있다. 더욱 구체적으로, 제어부는 오브젝트 인식을 통하여 컨텐츠에서 단일 인물을 나타내는 복수의 객체들을 추 출할 수 있다. 예를 들어 제어부는 제1 객체(제1 시점(예를 들어 10분)에서의 A 인물), 제2 객체(제2 시점 (예를 들어 17분)에서의 A 인물), 제3 객체(제3 시점(예를 들어 25분)에서의 A 인물), 제4 객체(제4 시점(예를 들어 48분)에서의 A 인물)를 설문 보기로 사용될 객체로써 선정할 수 있다. 이 경우 복수의 객체는 모두 단일 인물을 나타내는 반면, 복수의 객체의 코디네이션은 모두 상이할 수 있다. 예 를 들어 단일 인물이 입은 옷, 액세서리, 구두 등이 상이할 수 있으며, 단일 인물의 헤어 스타일, 화장법 등이 상이할 수도 있다. 그리고 제어부는 선정된 복수의 객체에 각각 대응하는 복수의 설문 보기를 생성할 수 있다. 예를 들어 복 수의 설문 보기는, a 옷을 입고 있는 A 인물, b 옷을 입고 있는 A 인물, c 옷을 입고 있는 A 인물, d 옷을 입고 있는 A 인물일 수 있다. 다음으로, 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 컨텐츠와 함께 시청자에게 제공할 수 있다(S250). 이 경우 도 9에 도시된 바와 같이, 제어부는 선정된 복수의 객체에 상응하는 복수의 이미지(910, 920, 930, 940)가 하나의 화면에 디스플레이 되도록 설문 조사를 제공할 수 있다. 여기서 선정된 복수의 객체에 상응 하는 복수의 이미지(910, 920, 930, 940)는, 설문 조사가 제공되기 이전의 이미지 프레임으로부터 추출한 이미 지일 수 있다. 다만 이에 한정되지 않으며, 선정된 복수의 객체에 상응하는 복수의 이미지(910, 920, 930, 940)는 선정된 복수의 객체의 옷에 기반하여 메모리 또는 외부 장치를 검색하여 획득한 이미지일 수 있다. 다음으로, 제어부는 설문 조사에 대응하는 설문 결과를 시청자에게 제공할 수 있다(S270). 이와 같이 본 발명에 따르면, 매우 다양한 컨텐츠에 대하여 설문 조사를 자동으로 생성할 수 있는 장점이 있다. 또한 컨텐츠의 메타 데이터와 컨텐츠 내 객체를 이용하여 설문 조사를 생성함으로써, 컨텐츠의 성격이나 내용에 부합하는 설문 조사를 생성할 수 있는 장점이 있다. 또한 본 발명에 따르면, 컨텐츠 내 객체를 설문 보기로 선정하는 방식으로 컨텐츠와 실시간 연동하는 설문 조사 를 제공하기 때문에, 시청자에게 즐거움을 선사하고 시청자의 참여율을 높힐 수 있는 장점이 있다. 또한 본 발명에 따르면, 컨텐츠 내 객체와 연계하여 설문 결과를 제공하기 때문에, 사용자가 설문 결과를 한눈 에 파악하도록 하고 시청자에게 즐거움을 선사할 수 있는 장점이 있다. 도 10에서는, 컨텐츠와 연동한 시청자 설문 장치의 운영자가 생성한 설문 조사를 컨텐츠와 연계하여 시청 자에게 제공하는 방법에 대하여 설명한다. 도 10은 사용자 입력에 기반하여 생성된 설문 조사를 도시한 도면이다. 제어부는, 사용자 입력에 기반하여, 설문 항목 및 설문 보기를 포함하는 설문 조사를 생성할 수 있다. 이 를 위해 컨텐츠와 연동한 시청자 설문 장치는 사용자 입력을 수신하기 위한 입력부 및 설문 조사를 디스플 레이 하기 위한 디스플레이부를 포함할 수 있다. 한편 도 10a에서 도시된 바와 같이 설문 보기는 텍스트일 수 있다. 예를 들어 설문 보기는 “경차”, “소형차 ”, “SUV/RV”, “전기차”라는 텍스트일 수 있다. 그리고 제어부는 설문 항목 및 설문 보기를 포함하는 설문 조사를 메모리에 저장할 수 있다. 한편, 설문 조사가 생성되면, 제어부는 컨텐츠 내에서 설문 보기에 상응하는 객체를 추출할 수 있다. 구체적으로 제어부는 오브젝트 인식 기술을 이용하여, 메모리에 저장된 설문 보기에 대응하는 객체를 컨텐츠로부터 추출할 수 있다. 예를 들어 “망고”라는 텍스트가 설문 보기로써 저장되어 있는 경우, 제어부 는 컨텐츠에서 “망고”를 추출할 수 있다. 이 경우 제어부는 컨텐츠를 인공지능 모델에 제공하여 컨텐츠에 포함된 객체의 종류를 결정할 수 있다. 구체적으로 인공지능 모델은, 객체를 포함하는 이미지(예를 들어 망고 이미지)를 입력 데이터로, 객체의 식별 정보(예를 들어 “망고”라는 텍스트)를 레이블로 사용하여 트레이닝될 수 있다. 그리고 제어부는 컨텐츠 의 이미지 프레임을 트레이닝이 완료된 인공지능 모델에 제공할 수 있다. 이 경우 인공지능 모델은 이미지 프레 임에 포함된 객체의 종류를 출력할 수 있다. 한편 도 10b에서 도시된 바와 같이, 설문 보기는 이미지일 수 있다. 예를 들어 설문 보기는 오렌지를 포함하는 이미지, 라임을 포함하는 이미지 등일 수 있다. 그리고 제어부는 설문 항목 및 설문 보기를 포함하는 설문 조사를 메모리에 저장할 수 있다. 한편 설문 보기는 이미지이다. 따라서 제어부는 오브젝트 인식 기술을 이용하여, 설문 보기(이미지)로부터 객체의 종류를 추출할 수 있다. 예를 들어 설문 보기가 라임을 포함하는 이미지인 경우, 제어부는 설문 보 기로부터 “라임”이라는 객체의 종류를 추출하여 메모리에 저장할 수 있다. 또한 제어부는 설문 보기(이미지)를 인공지능 모델에 제공함으로써 설문 보기(이미지)에 포함된 객체의 종 류를 추출하고, 추출된 객체의 종류를 메모리에 저장할 수 있다. 한편, 설문 조사가 생성되면, 제어부는 컨텐츠 내에서 설문 보기에 상응하는 객체를 추출할 수 있다. 즉 제어부는 설문 보기(이미지)로부터 추출된 객체의 종류에 상응하는 객체를 컨텐츠 내에서 추출할 수 있다. 예를 들어 “라임”이라는 객체의 종류가 저장된 경우, 제어부는 컨텐츠 내에서 라임을 나타내는 객체를 추출할 수 있다. 한편 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 시청자에게 제공할 수 있다. 이 경우 제어 부는 도 10a 및 도 10b에서 도시된 바와 같이, 컨텐츠와는 독립적으로 설문 조사를 제공할 수 있다. 또한 제어부는, 설문 보기가 텍스트인 경우 도 10a와 같이 텍스트 형태의 설문 보기를 포함하는 설문 조사를 제 공할 수 있으며, 설문 보기가 이미지인 경우 도 10b와 같이 이미지 형태의 설문 보기를 포함하는 설문 조사를제공할 수 있다. 다만 이에 한정되지 않으며, 제어부는 설문 문항 및 설문 보기를 포함하는 설문 조사를 컨텐츠와 함께 시 청자에게 제공할 수 있다. 설문 조사를 컨텐츠와 함께 제공하는 구체적인 방법은 도 1 내지 도 9에서 설명한 바 있다. 또한 제어부는 설문 조사에 대응하는 설문 결과를 시청자에게 제공할 수 있다. 또한 제어부는 컨텐츠 내 복수의 객체에 각각 대응하는 복수의 선택 결과 UI가 복수의 객체와 함께 디스플레이 되도록 설문 결과를 제 공할 수도 있다. 설문 결과를 제공하는 구체적인 방법은 도 1 내지 도 9에서 설명한 바 있다. 한편 제어부는 서로 연계된 복수의 설문 조사를 제공할 수 있다. 구체적으로 제2 설문 조사는 제1 설문 조 사의 복수의 설문 보기 중 제1 설문 보기와 연계되고, 제3 설문 조사는 제1 설문 조사의 복수의 설문 보기 중 제2 설문 보기와 연계될 수 있다. 예를 들어 제어부는 “가장 여행하고 싶은 곳은 어디인가요?”라는 설문 문항과 “유럽”, “뉴욕”, “동 남아”, “남미”라는 설문 보기들을 포함하는 제1 설문 조사를 제공할 수 있다. 그리고 시청자에 의해 제1 설문 보기(“유럽”)이 선택되면, 제어부는 제1 설문 보기(“유럽”)와 연계된 제2 설문 조사를 제공할 수 있다. 예를 들어 제2 설문 조사의 설문 문항은 “유럽에서 가장 가고 싶은 나라는 어디입니까?”일 수 있다. 또한 시청자에 의해 제2 설문 보기(“뉴욕”)이 선택되면, 제어부는 제2 설문 보기(“뉴욕”)와 연계된 제 3 설문 조사를 제공할 수 있다. 예를 들어 제3 설문 조사의 설문 문항은 “뉴욕에서 가장 보고 싶은 랜드 마크 는 무엇입니까?”일 수 있다. 한편 제어부는 컨텐츠의 장르에 기반하여 설문 결과를 제공하는 형태를 결정할 수 있다. 예를 들어 장면 전환이 늦고 고연령대의 시청자들이 많이 보는 다큐멘터리의 경우, 제어부는 설문 결과를 텍스트의 형태로 제공할 수 있다. 반대로, 장면 전환이 빠르고 저연령대의 시청자들이 많이 보는 음악 프로그램의 경우, 제어부 는 설문 결과를 아이콘의 형태로 제공할 수 있다. 또한 제어부는 컨텐츠의 주 시청자의 연령대에 기반하여 설문 결과를 제공하는 형태를 결정할 수 있다. 예 를 들어 컨텐츠의 주 시청자의 연령대가 높을수록, 제어부는 설문 결과를 큰 아이콘이나 큰 텍스트의 형태 로 제공할 수 있다. 다른 예를 들어 컨텐츠의 주 시청자의 연령대가 낮을수록, 제어부는 설문 결과를 작은 아이콘이나 작은 텍스트의 형태로 제공할 수 있다. 또한 제어부는 컨텐츠의 주 시청자의 성별에 기반하여 설문 결과를 제공하는 형태를 결정할 수 있다. 예를 들어 컨텐츠의 주 시청자가 남성인 경우, 제어부는 설문 결과를 수치 데이터로 제공할 수 있다. 반대로 컨 텐츠의 주 시청자가 여성인 경우, 제어부는 설문 결과를 아이콘의 형태로 제공할 수 있다. 또한 설문 결과의 노출을 위한 사용자 입력이 방송 출력 장치를 통하여 컨텐츠와 연동한 시청자 설문 장치(10 0)로 전송되는 경우, 제어부는 해당 시청자에게 설문 결과를 제공할 수 있다. 또한 설문 결과의 노출을 중 단하기 위한 사용자 입력이 방송 출력 장치를 통하여 컨텐츠와 연동한 시청자 설문 장치에 전송되는 경우, 제어부는 설문 결과의 제공을 중단할 수 있다. 또한 제어부는 시청자의 방송 시청 히스토리를 분석하여, 해당 시청자가 설문 결과의 노출을 요청한 시점, 설문 결과의 노출을 중단한 시점, 설문 결과의 노출을 허용한 시간 등을 결정할 수 있다. 그리고 제어부는 해당 시청자가 설문 결과의 노출을 중단한 시점, 설문 결과의 노출을 허용한 시간 등을 이용하여, 다음 설문 결 과를 제공하는 시점, 다음 설문 결과를 제공하는 시간, 다음 설문 결과의 제공을 중단하는 시점 등을 결정할 수 있다. 또한 제어부는 시청자의 방송 시청 히스토리를 분석하여, 설문 결과를 제공하는 형태를 결정할 수 있다. 예를 들어 시청자가 아이콘 형태의 설문 결과를 선호하는 것으로 분석되는 경우, 제어부는 다음 설문 결과 의 제공 시 아이콘 형태의 설문 결과를 제공할 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 또한, 상기 컴퓨터는 제어부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하 고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2021-0174251", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른, 컨텐츠와 연동한 시청자 설문 장치를 설명하기 위한 블록도이다. 도 2는 본 발명에 따른 컨텐츠와 연동한 시청자 설문 방법을 설명하기 위한 순서도이다. 도 3은 본 발명에 따른, 컨텐츠의 메타 데이터를 설명하기 위한 도면이다. 도 4는 본 발명에 따른, 컨텐츠 내 객체를 설명하기 위한 도면이다. 도 5는 본 발명에 따른 제1 실시 예를 설명하기 위한 도면이다. 도 6은 본 발명에 따른, 선택 결과 UI를 표시하는 방법을 설명하기 위한 도면이다. 도 7은 본 발명에 따른 제2 실시 예를 설명하기 위한 도면이다. 도 8은 본 발명에 따른 제3 실시 예를 설명하기 위한 도면이다. 도 9는 본 발명에 따른 제4 실시 예를 설명하기 위한 도면이다. 도 10은 사용자 입력에 기반하여 생성된 설문 조사를 도시한 도면이다."}
