{"patent_id": "10-2019-0093569", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0096880", "출원번호": "10-2019-0093569", "발명의 명칭": "인공 지능 냉장고", "출원인": "엘지전자 주식회사", "발명자": "노효훈"}}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능 냉장고에 있어서,통신부;식품을 수납하는 복수의 홈들을 포함하는 트레이를 촬영하는 카메라; 및상기 통신부 및 상기 카메라를 제어하는 프로세서를 포함하고,상기 프로세서는촬영된 트레이 영상으로부터, 상기 복수의 홈들 각각에 부착된 복수의 마커들 중 상기 식품에 의해 가려진 마커를 추출하고, 가려진 마커에 대응하는 홈의 위치 식별자 및 상기 식품이 상기 홈에 수납된 입수 시점을 획득하고,획득된 위치 식별자 및 입수 시점을 상기 통신부를 통해 서버에 전송하고,상기 서버로부터, 상기 입수 시점에 기반하여, 결정된 컬러 정보를 수신하고,수신된 컬러 정보에 포함된 상기 홈에서 표시할 컬러를 출력하도록, 상기 홈에 구비된 발광 소자를 제어하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,복수의 마커들 각각에 대응하는 복수의 위치 식별자들을 저장하는 메모리를 더 포함하고,상기 프로세서는상기 트레이 영상으로부터, 획득된 마커의 위치 식별자와 상기 복수의 위치 식별자들을 비교하여, 상기 위치 식별자를 획득하지 못한, 마커를 상기 식품에 의해 가려진 마커로 추출하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는상기 식품에 의해 가려진 마커가 추출된 경우, 상기 트레이 영상을 촬영한 시점을 상기 입수 시점으로 획득하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 발광 소자는유기 발광 다이오드(LED)이고,상기 프로세서는상기 LED가 상기 컬러를 출력하도록 하는 컬러 표시 명령을 상기 트레이에 전송하는냉장고.공개특허 10-2019-0096880-3-청구항 5 제1항에 있어서,상기 마커는QR 코드, 바코드 중 어느 하나인냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "인공 지능 냉장고에 있어서,메모리;식품을 수납하는 복수의 홈들을 포함하는 트레이;상기 트레이를 촬영하는 카메라; 및상기 통신부 및 상기 카메라를 제어하는 프로세서를 포함하고,상기 프로세서는촬영된 트레이의 영상으로부터, 상기 복수의 홈들 각각에 부착된 복수의 마커들 중 상기 식품에 의해 가려진 마커를 추출하고, 가려진 마커에 대응하는 홈의 위치 식별자 및 상기 식품이 상기 홈에 수납된 입수 시점을 획득하고,획득된 위치 식별자 및 입수 시점을 이용하여, 상기 홈에 수납된 식품의 신선도를 계산하고, 계산된 신선도에대응하는 컬러를 출력하도록 상기 홈에 구비된 발송 소자를 제어하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는현재 시점과 상기 입수 시점 간의 차이인 입수 유지 기간을 이용하여, 상기 신선도를 계산하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는이동 단말기로부터, 상기 식품의 유통 기한을 수신하고,수신된 유통 기한 및 상기 입수 유지 기간을 이용하여, 상기 신선도를 계산하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 메모리는상기 신선도와 컬러 간의 대응 관계를 나타내는 테이블을 저장하고,상기 프로세서는상기 테이블을 이용하여, 상기 계산된 신선도에 매칭되는 컬러를 추출하고, 추출된 컬러를 출력하도록, 상기 홈공개특허 10-2019-0096880-4-에 구비된 발광 소자를 제어하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,복수의 마커들 각각에 대응하는 복수의 위치 식별자들을 저장하는 메모리를 더 포함하고,상기 프로세서는상기 트레이 영상으로부터, 획득된 마커의 위치 식별자와 상기 복수의 위치 식별자들을 비교하여, 상기 위치 식별자를 획득하지 못한, 마커를 상기 식품에 의해 가려진 마커로 추출하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 프로세서는상기 식품에 의해 가려진 마커가 추출된 경우, 상기 트레이 영상을 촬영한 시점을 상기 입수 시점으로 획득하는냉장고."}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 인공 지능 냉장고는 통신부와 식품을 수납하는 복수의 홈들을 포함하는 트레이를 촬영 하는 카메라 및 상기 통신부 및 상기 카메라를 제어하는 프로세서를 포함하고, 상기 프로세서는 촬영된 트레이 영상으로부터, 상기 복수의 홈들 각각에 부착된 복수의 마커들 중 상기 식품에 의해 가려진 마커를 추출하고, 가 려진 마커에 대응하는 홈의 위치 식별자 및 상기 식품이 상기 홈에 수납된 입수 시점을 획득하고, 획득된 위치 식별자 및 입수 시점을 상기 통신부를 통해 서버에 전송하고, 상기 서버로부터, 상기 입수 시점에 기반하여, 결 정된 컬러 정보를 수신하고, 수신된 컬러 정보에 포함된 상기 홈에서 표시할 컬러를 출력하도록, 상기 홈에 구비 된 발광 소자를 제어할 수 있다."}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 지능 냉장고에 관한 것으로, 냉장고에 입수된 식제품에 대한 정보를 제공할 수 있는 인공 지능 냉장고에 관한 것이다."}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "냉장고는 냉동 또는 냉장 사이클을 반복하면서 냉동실 또는 냉장실을 특정 온도로 냉각시켜 식품을 일정기간 동 안 신선하게 보관할 수 있는 장치이다. 일반적으로 냉장고에는 저장 공간을 형성하는 본체 및 저장 공간을 개방 또는 폐쇄하는 도어가 포함된다. 저장 공간에는 음식과 같은 저장물이 저장되며 사용자는 저장물을 보관하거나 보관된 저장물을 인출하기 위해 도어를 개방할 수 있다. 최근 냉장고의 폭 넓은 보급 및 기술의 발전에 따라, 냉장고의 부가적인 기능에 대한 다양한 요구사항이 증가하 고 있다. 특히, 계란과 같은 식품을 트레이를 통해 고 내 수납하고자 하는 경우, 계란의 신선도 또는 유통 기한을 알려줄 수 있는 기능이 등장하고 있다. 종래에는 계란을 수납하는 트레이에 구비된 복수의 홈들 각각에 계란이 수납되었는지를 감지할 수 있는 센서가 구비되어 있었다. 그러나, 트레이를 구성하는 홈의 개수가 많아지는 경우, 이에 따라 센서의 개수도 많아져, 비용이 증가하는 문 제가 있다. 또한, 권장하는 유통 기한을 냉장고에 입력할 수 없어서, 계란이 고 내 입수되었을 때, 각 계란의 신선도를 정 확하게 파악할 수 없는 문제가 있었다. [선행기술문헌] 1. US공개특허공보 20140261189호 (2014.09.18. 공개)"}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 냉장고 내, 입수된 식품의 신선도를 파악하여, 사용자에게 피드백 할 수 있 는 인공 지능 냉장고를 제공하는 것에 그 목적이 있다. 본 발명이 해결하고자 하는 다른 과제는, 냉장고 내 입수된 식품의 신선도를 보다 정확하게 파악할 수 있는 인 공 지능 냉장고를 제공하는 것에 그 목적이 있다."}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 인공 지능 냉장고는, 트레이를 구성하는 복수의 홈들 각각에 부착된 마커들을 촬영하 여, 식품의 입수 여부를 판단하고, 식품의 입수 시점과 해당 홈의 위치 식별자에 기반하여, 결정된 신선도에 따 른 시각적인 피드백을 출력할 수 있다. 본 발명의 실시 예에 따른 인공 지능 냉장고는 사용자의 이동 단말기로부터 입력된 식품의 유통 기한과, 식품의 입수 시점 간의 차이를 이용하여, 식품의 신선도를 결정하고, 결정된 신선도에 따른 시각적인 피드백을 출력할 수 있다."}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 고 내 입수된 식품의 신선도가 시각적으로 출력됨에 따라, 사용자는 식품의 신선 도를 즉각적으로 확인할 수 있다. 이에 따라, 식품의 섭취, 폐기 등을 빠르게 판단할 수 있다. 또한, 본 발명의 실시 예에 따르면, 식품의 유통 기한이 식품의 신선도의 결정에 사용됨에 따라, 식품의 신선 상태가 정확하게 파악될 수 있다."}
{"patent_id": "10-2019-0093569", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명한다. 첨부된 도면은 본 명세서에 개 시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사 상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도 1은 본 발명의 일 실시 예에 따른 냉장고의 제어 구성과 관련된 블록도이다. 도 1을 참조하면, 냉장고는 카메라, 마이크로폰, 스피커, 메모리, 통신부, 및 제어부를 포함할 수 있다. 도 1에 도시된 구성요소들은 냉장고를 구현하는 데 있어서 필수적인 것은 아닌 바, 냉장고는 도 1에 도시된 구성 요소들보다 많거나 적은 구성 요소들을 포함할 수도 있다. 디스플레이 장치는 사용자로부터 터치 입력을 수신하는 터치 패널과, 그래픽이나 텍스트 등을 표시하 는 디스플레이를 포함할 수 있다. 터치 패널과 디스플레이는 일체형으로 형성될 수도 있고, 적 층된 별도의 구성으로 형성될 수도 있다. 제어부에 포함된 프로세서는, 터치 패널을 통해 수신되는 터치 입력에 기초하여, 터치 입력의 종류(예컨대, 숏-터치, 롱-터치, 드래그 앤 드랍 등)를 감지하고, 터치 입력의 좌표 정보를 획득할 수 있다. 제어부에 포함된 디스플레이 컨트롤러는, 프로세서로부터 제공되는 신호나 데이터에 기초하여 디스플레이의 동작을 제어할 수 있다. 디스플레이는 디스플레이 컨트롤러의 제어에 따라 그래픽 또는 텍스트 등을 출력할 수 있다.카메라는 냉장고의 내부에 배치될 수 있다. 제어부에 포함된 카메라 컨트롤러는 도어가 사용자에 의해 오픈되면, 도어가 클로즈되는 시점까지 적어도 하나의 이미지를 획득하도록 카메라를 제어할 수 있다. 카메라에 의해 획득되는 적어도 하나의 이미지는 메모리의 이미지 DB에 저장될 수 있다. 실시 예에 따라, 카메라에 의해 획득되는 적어도 하나의 이미지는 통신부를 통해 서버(미도 시)나 단말기 등으로 전송될 수도 있다. 실시 예에 따라, 카메라 컨트롤러는 도어의 열림각이 기설정된 열림각에 도달한 경우 이미지를 획득하 도록 카메라를 제어할 수도 있다. 상기 기설정된 열림각은 카메라가 냉장고 내부의 영역들을 최 대로 포함하는 이미지를 획득 가능한 각도일 수 있다. 실시 예에 따라, 카메라 컨트롤러는 터치 패널이나 마이크로폰 등의 입력부를 통해 수신되는 특 정 제어 명령에 기초하여, 냉장고 내부의 이미지를 획득하도록 카메라를 제어할 수도 있다. 한편, 제어부의 이미지 처리 프로세서는, 각종 이미지 처리 기법을 통해 카메라에 의해 획득된 이미지로부터 식품 이미지를 추출할 수 있다. 또는, 이미지 처리 프로세서는 도어의 열림 전 후 획득 된 이미지들로부터, 식품이 냉장고 내로 입고 또는 출고됨에 따른 이미지 변화를 감지할 수 있다. 프로세서 또는 이미지 처리 프로세서는 감지된 이미지 변화에 기초하여 상기 입고 또는 출고된 식품을 감지할 수도 있다. 마이크로폰은 사용자로부터 음성을 획득하고, 획득된 음성을 프로세서로 제공할 수 있다. 예컨대, 상 기 음성은 사용자가 특정 식품과 관련하여 제공받고자 하는 기능과 관련된 것일 수 있다. 상기 음성은 적어도 하나의 부분 음성을 포함할 수 있다. 상기 부분 음성은, 상기 특정 식품의 식별 정보(예컨 대, 식품명), 또는 상기 기능과 관련된 명령일 수 있다. 즉, 상기 음성에는 상기 특정 식품의 식별 정보와 명령 중 적어도 하나가 포함될 수 있다. 스피커는 냉장고의 동작과 관련된 정보를 음향 또는 음성 형태로 출력할 수 있다. 실시 예에 따라, 냉 장고는 디스플레이 장치를 통해 냉장고의 동작과 관련된 정보를 출력할 수 있다. 메모리는 냉장고에 포함된 구성들의 동작을 위한 제어 데이터나 알고리즘 등을 저장할 수 있다. 한편, 메모리는 냉장고 내에 보관 중인 식품들과 관련된 각종 정보를 저장하는 식품 관리 DB와, 카메라 에 의해 획득된 이미지를 저장하는 이미지 DB를 포함할 수 있다. 실시 예에 따라, 식품 관리 DB(14 2)와 이미지 DB는 냉장고와 통신부를 통해 연결되는 서버 등에 존재할 수도 있다. 통신부는 냉장고를 사용자의 단말기나 서버 등과 연결시키는 적어도 하나의 통신 모듈을 포함할 수 있 다. 예컨대, 통신부는 와이파이(Wi-Fi) 등과 같은 무선 인터넷 모듈이나, 블루투스(Bluetooth) 등과 같은 근거리 무선 통신 모듈 등을 포함할 수 있다. 제어부는 냉장고의 전반적인 동작을 제어할 수 있다. 제어부는 사용자에게 냉장고가 지원하 는 기능을 제공하기 위해, 냉장고에 포함된 적어도 하나의 구성을 제어할 수 있다. 이러한 제어부는 적어도 하나의 CPU, AP(application processor), 컨트롤러, 마이크로컴퓨터, 집적회로 등을 포함할 수 있다. 예컨대, 도 1에 도시된 바와 같이, 제어부는 프로세서, 디스플레이 컨트롤러 , 카메라 컨트롤러, 이미지 처리 프로세서, 및 음성 인식 모듈을 포함할 수 있으나, 이에 한정되는 것은 아니다. 한편, 본 발명의 실시 예에 따른 제어부(160; 또는 프로세서)는, 마이크로폰으로부터 획득되는 음성 을 인공지능 기반의 음성 인식 모듈로 입력하여, 상기 음성을 인식할 수 있다. 음성 인식 모듈은 상 기 음성에 포함된 적어도 하나의 부분 음성을 인식하고, 인식된 적어도 하나의 부분 음성을 포함하는 인식 결과 를 출력할 수 있다. 상술한 바와 같이, 상기 부분 음성은 상기 특정 식품의 식별 정보(예컨대, 식품명), 또는 상기 기능과 관련된 명령일 수 있다. 즉, 상기 음성에는 상기 특정 식품의 식별 정보와 명령 중 적어도 하나가 포함될 수 있다. 예컨대, 음성 인식 모듈은 머신 러닝(machine learning)으로 기학습된 인공신경망(artificial neural network; ANN)을 갖는 음성 인식기를 포함하여, 입력된 음성을 인식하여 상기 식별 정보나 특성 정보를 포함하 는 인식 결과를 출력할 수 있다. 프로세서는 음성 인식 모듈의 인식 결과와, 터치 패널을 통해 획득된 터치 입력에 기초하여 식 품 관리와 관련된 기능을 수행할 수 있다. 도 2는 본 발명의 일 실시 예에 따른, 인공 지능 시스템의 동작 방법을 설명하기 위한 래더 다이어그램이다. 도 2를 참조하면, 냉장고의 카메라는 트레이를 촬영한다(S201). 일 실시 예에서, 카메라 컨트롤러는 주기적으로 트레이를 촬영할 수 있다. 트레이는 복수의 홈들을 구비하고, 각 홈에 식제품을 수납하기 위한 요소일 수 있다. 식제품은 계란일 수 있으나, 이는 예시에 불과하고, 수납이 가능한 식제품이라면, 어느 것이든 상관 없다. 카메라는 트레이와 이격된 상측 공간에 배치될 수 있다. 카메라와 트레이의 배치 구조에 대해서는 도 3 내지 도 5를 참조하여 설명한다. 도 3 내지 도 5는 본 발명의 실시 예에 따른 카메라와 트레이 간의 배치 구조를 설명하는 도면이다. 도 3을 참조하면, 트레이는 냉장고의 내부에 수납될 수 있는 기구 요소이다. 트레이는 복수의 홈들(310 내지 340)을 구비할 수 있다. 복수의 홈들(310 내지 340) 각각에는 계란이 수납될 수 있다. 예를 들어, 제1 홈에는 제1 계란이 수납 될 수 있고, 제2 홈에는 제2 계란이 수납될 수 있다. 복수의 홈들(310 내지 340) 각각은 계란을 수납할 수 있는 타원형의 수납 용기일 수 있다. 제1 홈에는 제1 계란이 수납될 수 있고, 제2 홈에는 제2 계란이 수납될 수 있다. 각 홈에는 각 홈의 위치를 식별하기 위한 마커가 부착될 수 있다. 예를 들어, 제1 홈에는 제1 홈의 위치를 식별하기 위한 제1 마커, 제2 홈에는 제2 홈 의 위치를 식별하기 위한 제2 마커, 제3 홈에는 제3 홈의 위치를 식별하기 위한 제3 마커 , 제4 홈에는 제4 홈의 위치를 식별하기 위한 제4 마커가 구비될 수 있다. 일 실시 예에서, 마커는 QR 코드, 바코드 중 어느 하나일 수 있으나, 이는 예시에 불과하다. 카메라는 트레이와 이격된 상측 위치에 배치될 수 있다. 카메라는 트레이를 주기적으로 촬영할 수 있다. 카메라는 트레이에 포함된 복수의 홈들 각 각에 부착된 복수의 마커들 중 하나 이상이 가려져있는지, 확인하기 위해, 트레이를 주기적으로 촬영할 수 있다. 카메라의 촬영 주기는 5분일 수 있으나, 이는 예시에 불과하고, 실시간으로 촬영할 수도 있다. 도 4는 트레이의 평면도를 보여주는 도면이다. 도 4는 카메라가 촬영한 트레이 영상을 나타낼 수도 있다. 트레이의 복수의 홈들 각각에는 하나 이상의 LED(Light Emitting Diode)가 부착될 수 있다. 즉, 제1 홈에는 제1 LED가 부착되고, 제2 홈에는 제2 LED가 부착될 수 있다. 한편, 제1 홈에 제1 계란이 수납된 경우, 도 3에 도시된 제1 마커가 가려질 수 있다. 마찬가지로, 제2 홈에 제2 계란이 수납된 경우, 도 3에 도시된 제2 마커가 가려질 수 있다. 도 5는 냉장고의 내부에 배치된 카메라와 트레이의 배치 관계를 보여주는 측면도이다. 다시, 도 2를 설명한다. 냉장고의 프로세서는 촬영된 트레이 영상에 포함된 복수의 홈들 각각에 부착된 복수의 마커들 중 가려 진 마커가 존재하는지를 판단한다(S203). 프로세서는 트레이 영상에 포함된 복수의 마커들 중 식제품의 수납에 의해, 가려진 마커가 존재하는지를 판단할 수 있다. 일 실시 예에서, 프로세서는 복수의 홈들에 배치된 복수의 마커들 각각을 식별하는 복수의 위치 식별자들 을 메모리에 저장하고 있을 수 있다. 프로세서는 기 저장된 복수의 위치 식별자들과 트레이 영상을 통해 획득된 위치 식별자들을 비교할 수 있 다. 프로세서는 비교 결과에 따라, 트레이 영상을 통해 어느 하나의 위치 식별자가 검출되지 않은 경우, 해당 위치 식별자의 마커가 가려진 것으로 판단할 수 있다. 즉, 프로세서는 트레이 영상을 통해 어느 하나의 위치 식별자가 검출되지 않은 경우, 해당 홈에 식제품이 수납되어, 마커가 가려진 것으로 판단할 수 있다. 도 4를 참조하여, 보다 구체적으로 설명한다. 도 4에서, 마커는 QR 코드임을 가정한다. 각 홈에 부착된 QR 코드는 자신의 위치를 식별하는 위치 식별자를 담고 있다. 프로세서는 촬영된 트레이 영상에 포함된 QR 코드들을 읽어, 위치 식별자들을 검출할 수 있다. 예를 들어, 트레이에 4개의 홈(310 내지 340)만이 구비되고, 제1 홈 및 제2 홈에 계란이 수납된 경우를 가정한다. 또한, 메모리는 4개의 홈들(310 내지 340) 각각에 부착된 QR 코드들의 위치 식별자들을 저장하고 있음을 가정한다. 프로세서는 제3 홈의 QR 코드 및 제4 홈의 QR 코드를 읽어, 제3 홈의 위치 식별자 및 제4 홈의 위치 식별자를 획득할 수 있다. 프로세서는 제1 홈의 위치 식별자 및 제2 홈의 위치 식별자가 획득되지 못했으므로, 제1 홈 및 제2 홈에 계란이 수납된 것으로 판단할 수 있다. 냉장고의 프로세서는 가려진 마커에 대응하는 홈의 위치를 식별하는 위치 식별자 및 식제품이 입수된 시간을 나타내는 입수 시점을 획득한다(S205). 일 실시 예에서, 식제품의 입수 시점은 해당 홈의 마커가 가려진 시점을 나타낼 수 있다. 프로세서는 카메라가 트레이 영상을 촬영한 시점으로부터, 홈의 마커가 가려진 시점을 획득할 수 있 다. 프로세서는 식품에 의해 가려진 마커가 추출된 경우, 카메라가 트레이 영상을 촬영한 시점을 입수 시 점으로 획득할 수 있다. 냉장고의 프로세서는 가려진 마커에 대응하는 홈의 위치 식별자 및 입수 시점을 통신부를 통해 서버에 전송한다(S207). 또 다른 실시 예에 따르면, 프로세서는 가려지지 않은 마커에 대응하는 홈의 위치 식별자 및 입수 시점을 서버에 전송할 수도 있다. 서버 또한, 복수의 홈들 각각에 대응하는 복수의 위치 식별자들을 저장하고 있다. 서버는 냉장고로부터 수신된 가려지지 않은 마커에 대응하는 홈의 위치 식별자를 통해, 가려진 마커에 대응하는 홈의 위치 식별자를 추출할 수 있다. 서버는 냉장고로부터 수신된 입수 시점에 기초하여, 식제품의 신선도를 계산한다(S209). 일 실시 예에서, 서버는 냉장고로부터 수신된 입수 시점에 기초하여, 식제품의 신선한 정도를 수치로 표현한 신선도를 계산할 수 있다. 서버는 현재 시점을 기준으로, 입수 시점 간의 시간 차이를 계산할 수 있다. 서버는 현재 시점과 입수 시점 간의 차이가 클수록 신선도를 낮게 계산하고, 현재 시점과 입수 시점 간의 차이가 작을수록, 신선도를 높게 계산할 수 있다. 예를 들어, 현재 시점과 입수 시점 간의 차이가 1일 인 경우, 신선도는 90이고, 현재 시점과 입수 시점 간의 차 이가 3일 인 경우, 70일 수 있다. 또 다른 실시 예에서, 서버는 냉장고로부터 수신된 입수 시점 및 사용자의 이동 단말기(미도시)로부터 획득된 식제품의 유통 기한에 기초하여, 신선도를 계산할 수 있다. 사용자는 이동 단말기(미도시)에 설치된 식제품 관리 어플리케이션을 실행시키고, 실행된 식제품 관리 어플리케 션의 실행 화면 상에, 식제품의 유통 기한을 입력할 수 있다. 입력된 식제품의 유통 기한은 서버에 전송될 수 있다. 사용자에 의해 입력된 유통 기한 및 입수 시간에 기초하여, 신선도를 획득하는 과정을 후술한다. 서버는 계산된 신선도를 이용하여, 해당 홈에서 표시할 컬러를 결정한다(S211). 서버는 복수의 신선도들 각각과 복수의 컬러들 각각 간의 대응 관계를 테이블로 저장하고 있다. 서버는 테이블을 이용하여, 신선도에 대응하는 컬러를 추출하고, 추출된 컬러를 해당 홈에서 표시할 컬러로 결정할 수 있다. 도 6은 본 발명의 일 실시 예에 따라, 식제품의 신선도에 따라 식제품이 수납된 홈에서 표시할 컬러를 결정하는 예를 보여주는 표이다. 도 6의 표에서, 현재 시점은 01/11 15:00이고, 식제품의 유통 기한은 10일임을 가정하여 설명한다. 식제품의 유통 기한은 사용자의 이동 단말기로부터 수신한 정보일 수 있다. 서버는 냉장고로부터 마커가 가려진 홈의 위치 식별자 및 해당 홈에 식제품이 입수된 입수 시점을 수신 할 수 있다. 서버는 현재 시점과 입수 지점 간의 차이를 나타내는 입수 유지 기간을 계산할 수 있다. 서버는 유통 기한 및 입수 유지 기간을 이용하여, 식제품의 신선도를 계산할 수 있다. 서버는 다음의 수학식 1을 통해, 식제품의 신선도를 계산할 수 있다. [수학식 1] 신선도 = (유통 기한 - 입수 유지 기간) x 10 예를 들어, 위치 식별자의 값인 1인 제1 홈에 입수된 식제품의 신선도는 (10-9)x10을 통해 10으로 계산될 수 있다. 위치 식별자의 값인 3인 제3 홈에 입수된 식제품의 신선도는 (10-5)x10을 통해 50으로 계산될 수 있다. 위치 식별자의 값인 4인 제4 홈에 입수된 식제품의 신선도는 (10-3)x10을 통해 70으로 계산될 수 있다. 위치 식별자의 값인 7인 제7 홈(미도시)에 입수된 식제품의 신선도는 (10-1)x10을 통해 90으로 계산될 수 있다. 한편, 서버는 신선도 범위에 대응하는 컬러를 저장하고 있을 수 있다. 예를 들어, 신선도가 90에서 100 사이에 있는 경우, 해당 홈에서 표시할 컬러는 녹색일 수 있고, 신선도가 70에 서 80 사이에 있는 경우, 해당 홈에서 표시할 컬러는 노란색일 수 있고, 신선도가 50에서 60 사이에 있는 경우, 해당 홈에서 표시할 컬러는 주황색일 수 있고, 신선도가 10에서 20 사이에 있는 경우, 해당 홈에서 표시할 컬러 는 빨간색일 수 있다. 이와 같이, 서버는 계산된 식제품의 신선도에 따른 컬러를 결정하고, 결정된 컬러에 대한 정보를 통신부(미 도시)를 통해 냉장고에 전송할 수 있다. 다시, 도 2를 설명한다. 서버는 해당 홈에서 표시할 컬러를 포함하는 컬러 정보를 냉장고에 전송한다(S213). 서버는 가려진 마커들에 대응하는 복수의 홈들 각각에 대한 컬러 정보를 냉장고에 전송할 수 있다. 냉장고의 프로세서는 서버로부터 수신된 컬러 정보를 이용하여, 컬러를 출력하도록 해당 홈에 구 비된 LED를 제어한다(S215).일 실시 예에서, 컬러 정보는 홈의 위치 식별자 및 해당 홈의 위치 식별자에 대응하는 결정된 컬러를 포함할 수 있다. 예를 들어, 프로세서는 서버로부터 제1 홈에서 표시할 컬러가 녹색이라는 컬러 정보를 수신한 경 우, 녹색광을 출력하도록, 제1 홈에 구비된 제1 LED의 동작을 제어할 수 있다. 이를 위해, 트레이와 프로세서는 근거리 무선 통신을 통해, 통신을 수행할 수 있다. 즉, 프로세서는 특정 홈에서 특정 컬러를 표시하도록 하는 컬러 표시 명령을 트레이에 근거리 무선 통신 규격을 통해 전송할 수 있다. 냉장고 및 트레이는 근거리 무선 통신 모듈을 통해 컬러 표시 또 다른 예로, 프로세서는 서버로부터 제2 홈에서 표시할 컬러가 빨간색이라는 컬러 정보를 수신 한 경우, 빨간색 광을 출력하도록, 제2 홈에 구비된 제2 LED의 동작을 제어할 수 있다. 이와 같은 LED의 컬러 출력으로 인해, 사용자는, 홈에 수납된 식제품의 신선도를 직관적으로 판단할 수 있다. 식제품이 계란인 경우, 사용자는 냉장고에 수납된 계란들 중, 빠르게 먹어야 할 계란과, 먹지 말아야 할 계 란, 천천히 먹어도 될 계란을 시각적으로, 피드백 받을 수 있다. 한편, 본 발명의 또 다른 실시 예에 따르면, 냉장고는 각 홈에 수납된 식제품의 신선도의 수치를 디스플레 이를 통해 표시할 수도 있다. 또 다른 예로, 냉장고는 각 홈에 수납된 식제품의 신선도를 해당 홈에 수납된 계란의 영상과 함께 디스플레 이를 통해 표시할 수도 있다. 도 7은 본 발명의 일 실시 예에 따른 냉장고의 동작 방법을 설명하기 위한 흐름도이다. 특히, 도 7은 도 2의 실시 예와 같은, 서버와의 연동 없이, 냉장고 자체적으로, 식제품의 신선도를 계 산하고, 식제품을 수납한 홈이 표시할 컬러를 직접 결정하는 예를 설명하는 도면이다. 도 7에서, 도 2의 설명과 중복되는 부분은 도 2의 설명으로 대체한다. 냉장고의 카메라는 트레이를 촬영한다(S701). 냉장고의 프로세서는 촬영된 트레이 영상에 포함된 복수의 홈들 각각에 부착된 복수의 마커들 중 가려 진 마커가 존재하는지를 판단한다(S703). 냉장고의 프로세서는 가려진 마커에 대응하는 홈의 위치를 식별하는 위치 식별자 및 식제품이 입수된 시간을 나타내는 입수 시점을 획득한다(S705). 냉장고의 프로세서는 입수 시점에 기초하여, 식제품의 신선도를 계산한다(S707). 프로세서는 현재 시점을 기준으로, 입수 시점 간의 시간 차이를 계산할 수 있다. 프로세서는 현재 시점과 입수 시점 간의 차이가 클수록 신선도를 낮게 계산하고, 현재 시점과 입수 시점 간의 차이가 작을수록, 신선도를 높게 계산할 수 있다. 예를 들어, 현재 시점과 입수 시점 간의 차이가 1일 인 경우, 신선도는 90이고, 현재 시점과 입수 시점 간의 차 이가 3일 인 경우, 70일 수 있다. 또 다른 실시 예에서, 프로세서는 입수 시점 및 사용자의 이동 단말기(미도시)로부터 획득된 식제품의 유 통 기한에 기초하여, 신선도를 계산할 수 있다. 사용자는 이동 단말기(미도시)에 설치된 식제품 관리 어플리케이션을 실행시키고, 실행된 식제품 관리 어플리케 션의 실행 화면 상에, 식제품의 유통 기한을 입력할 수 있다. 입력된 식제품의 유통 기한은 냉장고에 전송될 수 있다. 또 다른 예로, 사용자는 냉장고의 터치 패널을 통해, 식제품의 유통 기한을 입력할 수도 있다. 냉장고의 프로세서는 계산된 신선도를 이용하여, 해당 홈에서 표시할 컬러를 결정한다(S709). 냉장고는 복수의 신선도들 각각과 복수의 컬러들 각각 간의 대응 관계를 테이블로 메모리에 저장하고 있다. 프로세서는 메모리에 저장된 테이블을 이용하여, 신선도에 대응하는 컬러를 추출하고, 추출된 컬러를 해당 홈에서 표시할 컬러로 결정할 수 있다. 프로세서는 도 6의 실시 예를 이용하여, 식제품의 신선도를 계산할 수 있다. 냉장고의 프로세서는 결정된 컬러 정보를 이용하여, 컬러를 출력하도록 해당 홈에 구비된 LED를 제어 한다(S711). 이와 같이, 도 7의 실시 예에 따르면, 서버와의 연동 없이, 냉장고 스스로가 자동으로, 트레이에 수납된 식제품의 신선도를 사용자에게 제공할 수 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사 상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2019-0093569", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 냉장고의 제어 구성과 관련된 블록도이다. 도 2는 본 발명의 일 실시 예에 따른, 인공 지능 시스템의 동작 방법을 설명하기 위한 래더 다이어그램이다. 도 3 내지 도 5는 본 발명의 실시 예에 따른 카메라와 트레이 간의 배치 구조를 설명하는 도면이다. 도 6은 본 발명의 일 실시 예에 따라, 식제품의 신선도에 따라 식제품이 수납된 홈에서 표시할 컬러를 결정하는 예를 보여주는 표이다. 도 7은 본 발명의 일 실시 예에 따른 냉장고의 동작 방법을 설명하기 위한 흐름도이다."}
