{"patent_id": "10-2020-0173165", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0083183", "출원번호": "10-2020-0173165", "발명의 명칭": "개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법", "출원인": "(주)엑소텍", "발명자": "동은성"}}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템에 있어서,사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 상기 사용자와의 상호작용에 의한 분석 요소별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 해당하는 입찰 공고를 추천하고 맞춤형 입찰전략을 수립하기 위한 입찰 전략 수집 지원 서버(100);상기 입찰 전략 수집 지원 서버에 접속하여, 맞춤형 사업 공고를 제공받기 위해 필요한 데이터를 송수신하고,상기 사업 추천 알고리즘에 따른 맞춤형 사업 공고를 제공받기 위한 다수의 사용자 단말기(110, 120); 및상기 맞춤형 사업 공고에 따른 입찰 전략을 수립 및 제공하는데 필요한 데이터를 수집하기 위한 다수의 외부 데이터 서버(130, 140)를 포함하고,상기 입찰 전략 수집 지원 서버(100)는,상기 다수의 사용자 단말로 상기 맞춤형 사업 공고 제공을 위한 인터페이스를 제공하는 인터페이스부(101);상기 다수의 외부 데이터 서버로부터 데이터를 수집 및 가공하고 키워드를 추출하여 데이터베이스에 입력하고,상기 사용자 단말을 통한 입력 신호로부터 개별 특성 요소를 추출하기 위한 데이터 수집부(103);상기 인터페이스부를 통하여 송수신되는 데이터 및 상기 데이터 수집부를 통해 수집한 데이터에 기초하여 상기맞춤형 사업 공고를 제공하는데 필요한 데이터 처리를 수행하기 위한 데이터 처리부(104);상기 사용자 단말기의 선택 입력 및 투찰 결과에 따른 적중률 및 적중률 추이를 분석하여 가중치 모델을 업데이트하기 위한 인공지능 분석부(105);상기 맞춤형 사업 공고 제공을 위해 필요한 데이터를 저장하고 있는 데이터베이스 관리부(106); 및상기 인터페이스부, 데이터 수집부, 데이터 처리부, 인공지능 분석부, 및 데이터베이스 관리부를 포함한 각 구성요소를 제어하기 위한 제어부(102)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 데이터 수집부(103)는,상기 다수의 외부 데이터 서버로부터 정형 데이터 및 비정형 데이터를 수집하기 위한 수집부(301);상기 수집된 데이터를 가공하기 위한 가공부(302);상기 가공된 데이터로부터 키워드를 추출하기 위한 키워드 추출부(303);상기 추출한 키워드를 데이터베이스에 입력하기 위한 DB입력부(304);상기 사용자 단말기의 입력 신호를 입력받아 변환하기 위한 데이터 변환부(305); 및상기 변환된 사용자 단말기의 입력 신호로부터 사용자의 특성 요소를 추출하기 위한 사용자특성 추출부(306)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템.공개특허 10-2022-0083183-3-청구항 3 제1항에 있어서,상기 데이터 처리부(104)는,상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업규모를 결정하기 위한 사업규모 결정부(401);상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업유형을 결정하기 위한 사업유형 결정부(402);상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 세부 사업유형을 결정하기 위한세부 사업유형 결정부(403);상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 고객유형을 결정하기 위한 고객유형 결정부(404);상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업위치를 결정하기 위한 사업위치 결정부(405); ??상기 결정된 사업규모, 사업유형, 세부 사업유형, 고객유형 및 사업위치를 기반으로 사업추천 범위 및 기준을결정하고, 상기 사업추천 범위 및 기준에 포함되는 대상 사업의 요소별 평가값을 산출하기 위한 사업 요소별 평가값 산출부(406)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 인공지능 분석부(105)는,상기 대상 사업에 대한 사업의 요소별 평가값과 요소별 가중치를 이용하여 합산한 총점에 따라 사업 공고를 추천하기 위한 사업 공고 추천부(501);상기 추천한 사업 공고에 대한 상기 사용자의 만족도 피드백 및 따른 투찰 결과 데이터베이스에 기반하여 투찰결과를 분석하기 위한 투찰 결과 분석부(502);상기 투찰 결과로부터 각 분석 요소에 대한 적중률을 산출하기 위한 적중률 산출부(503);상기 산출한 적중률 및 과거 이력에 따른 적중률 추이에 기반하여 상기 사용자(기업)의 수주 사업의 특성을 학습하기 위한 학습부(504);상기 학습한 수주 사업의 특성으로부터 낙찰 관련성 요소를 추출하여 추론하기 위한 추론부(505);상기 추론 결과에 따라 각 분석 요소에 대한 가중치 부여 방식을 모델링하기 위한 가중치 모델링부(506); 및상기 각 분석 요소에 대한 가중치를 조정하기 위한 요소별 가중치 조정부(507)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 사업규모 결정부(401)는, 기존 수행 사업의 유형별 금액대 분포, 평균값 및 추이를 계산하여 상기 사업규모를 기설정 금액범위로 결정하는 것을 특징으로 하고,공개특허 10-2022-0083183-4-상기 사업유형 결정부(402)는,상기 기존 수행 사업의 \"용역 : 물품 : 공사\" 의 사업유형 비율에 따른 선호도로 사업유형의 비중(비율)을 결정하는 것을 특징으로 하고,상기 세부 사업유형 결정부(403)는, 상기 기존 수행 사업의 공고명 키워드 분석을 통해, 세부사업유형을 결정하는 것을 특징으로 하고,상기 고객유형 결정부(404)는, 상기 기존 수행 사업의 고객 유형에 따른 선호도로 고객유형의 비중(비율)을 결정하는 것을 특징으로 하고,상기 사업위치 결정부(405)는, 상기 사용자(기업)의 위치(소재지) 및 고객(발주 기관)의 사업 위치를 이용하여 결정하는 것을 특징으로 하고,상기 사업 요소별 평가값 산출부(406)는,상기 사업규모에 대하여, 상기 사용자(기업)의 과거이력 기반 기설정 금액 단위로 구간을 구분하고, 각 구간 별사업 수를 카운트하여, 과거 수주 전체 사업 수의 70%가 분포된 사업비 구간을 탐지하여 P1이라고 하고, \"P1의평균값 = P1내 사업비 합/ P1내 사업 수\"을 계산하고, 추천 대상 사업의 사업비와 P1의 평균값과의 차이의 절대값이 0에 가까울 수록 최고점을 부여하여 평가값을 산출하는 것을 특징으로 하고,상기 사업유형에 대하여, 도출된 사업유형별 비중(물품:공사:용역)의 편차 조정을 통해 사업 유형별 추천 비중을 도출하는 것을 특징으로 하고,상기 세부사업유형에 대하여, 해당 기업의 키워드를 분석하고, 기존 수주 사업의 제1 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 최근 1개월간 사용자(기업)가 검색한 제2 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 상기 제2 키워드의 중복 키드에 가중치를 부여하고, 해당 기업의 최종 키워드 순위 및 점수를부여하고, 추천 대상 사업 별 키워드를 추출 및 분석하고, 해당 키워드에 점수를 부여하고, 복수의 키워드에는가산점을 부과하여 평가값을 산출하는 것을 특징으로 하고, 상기 고객유형에 대하여, 상기 결정된 고객유형의 비중(비율)의 편차 조정을 통해 사업 추천시의 발주기관 유형의 비중을 도출하는 것을 특징으로 하고,상기 사업위치에 대하여, 기업의 위치코드와 사업의 위치코드의 차이의 절대값인 거리지수를 산출하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "컴퓨터를 포함하는 연산처리수단에 의하여 실행되는 프로그램 형태로 이루어지는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법에 있어서,다수의 외부 데이터서버로부터 입찰 전략 수립에 필요한 데이터를 수집하는 데이터수집단계(S710);수집한 데이터로부터 사용자의 과거 사업이력 정보를 획득 및 처리하여 상기 사용자의 개별 특성이 적용된 요소별 우선순위 및 비중을 포함하는 사업추천 범위 및 기준을 결정하는 데이터처리단계(S720)상기 사업추천 범위 및 기준에 포함되는 대상 사업의 요소별 평가값을 산출하는 요소별평가값산출단계(S730);상기 대상 사업에 대한 사업의 요소별 평가값과 요소별 가중치를 이용하여 합산한 총점에 따라 사업 공고를 추천하는 사업공고추천단계(S740);상기 추천한 사업 공고에 대하여 상기 사용자의 만족도 피드백 및 투찰 결과에 따른 요소별 특성을 분석하는 요소별특성분석단계(S750);요소별 적중률 및 상기 요소별 적중률의 추이 학습을 통해 상기 요소별 가중치를 보정하는 가중치보정단계(S760); 및상기 사업추천단계, 상기 요소별특성분석단계, 및 상기 가중치보정단계를 반복하여 진행하여 입찰 전략을 제공공개특허 10-2022-0083183-5-하는 입찰전략제공단계(S770)를 포함하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 데이터수집단계(S710)는,상기 다수의 외부 데이터 서버로부터 정형 데이터 및 비정형 데이터를 수집하는 수집단계(S810);상기 수집된 데이터를 가공하는 가공단계(S820);상기 가공된 데이터로부터 키워드를 추출하는 키워드추출단계(S830);추출한 키워드를 데이터베이스에 입력하는 DB입력단계(S840);상기 사용자 단말기의 입력 신호를 입력받아 변환하는 데이터변환단계(S850); 및상기 변환된 사용자 단말기의 입력 신호로부터 특성 요소를 추출하는 특성 요소 추출단계(S860)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6항에 있어서,상기 데이터처리단계(S720)는,상기 사용자에게 추천할 사업 공고의 사업규모를 결정하는 사업규모결정단계(S910);상기 사용자에게 추천할 사업 공고의 사업유형을 결정하는 사업유형결정단계(S920);상기 사용자에게 추천할 사업 공고의 세부 사업유형을 결정하는 세부사업유형결정단계(S930);상기 사용자에게 추천할 사업 공고의 고객유형을 결정하는 고객유형결정단계(S940); 상기 사용자에게 추천할 사업 공고의 사업위치를 결정하는 사업위치결정단계(S950); 및상기 결정된 사업규모, 사업유형, 세부 사업유형, 고객유형 및 사업위치를 기반으로 사업추천 범위 및 기준을결정하는 추천범위결정단계(S960)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6항에 있어서,상기 사업규모결정단계(S910)는,기존 수행 사업의 유형별 금액대 분포, 평균값 및 추이를 계산하여 상기 사업규모를 기설정 금액범위로 결정하는 것을 특징으로 하고,상기 사업유형결정단계(S920)는,상기 기존 수행 사업의 \"용역 : 물품 : 공사\" 의 사업유형 비율에 따른 선호도로 사업유형의 비중(비율)을 결정하는 것을 특징으로 하고,상기 세부사업유형결정단계(S930)는,상기 기존 수행 사업의 공고명 키워드 분석을 통해, 세부사업유형을 결정하는 것을 특징으로 하고,공개특허 10-2022-0083183-6-상기 고객유형결정단계(S940)는,상기 기존 수행 사업의 고객 유형에 따른 선호도로 고객유형의 비중(비율)을 결정하는 것을 특징으로 하고,상기 사업위치결정단계(S950)는,상기 사용자(기업)의 위치(소재지) 및 고객(발주 기관)의 사업 위치를 이용하여 결정하는 것을 특징으로 하고,상기 요소별평가값산출단계(S730)는,상기 사업규모에 대하여, 상기 사용자(기업)의 과거이력 기반 기설정 금액 단위로 구간을 구분하고, 각 구간 별사업 수를 카운트하여, 과거 수주 전체 사업 수의 70%가 분포된 사업비 구간을 탐지하여 P1이라고 하고, \"P1의평균값 = P1내 사업비 합/ P1내 사업 수\"을 계산하고, 추천 대상 사업의 사업비와 P1의 평균값과의 차이의 절대값이 0에 가까울 수록 최고점을 부여하여 평가값을 산출하는 것을 특징으로 하고,상기 사업유형에 대하여, 도출된 사업유형별 비중(물품:공사:용역)의 편차 조정을 통해 사업 유형별 추천 비중을 도출하는 것을 특징으로 하고,상기 세부사업유형에 대하여, 해당 기업의 키워드를 분석하고, 기존 수주 사업의 제1 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 최근 1개월간 사용자(기업)가 검색한 제2 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 상기 제2 키워드의 중복 키드에 가중치를 부여하고, 해당 기업의 최종 키워드 순위 및 점수를부여하고, 추천 대상 사업 별 키워드를 추출 및 분석하고, 해당 키워드에 점수를 부여하고, 복수의 키워드에는가산점을 부과하여 평가값을 산출하는 것을 특징으로 하고, 상기 고객유형에 대하여, 상기 결정된 고객유형의 비중(비율)의 편차 조정을 통해 사업 추천시의 발주기관 유형의 비중을 도출하는 것을 특징으로 하고,상기 사업위치에 대하여, 기업의 위치코드와 사업의 위치코드의 차이의 절대값인 거리지수를 산출하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법."}
{"patent_id": "10-2020-0173165", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6항에 있어서,상기 가중치보정단계(S760)는,상기 투찰 결과로부터 각 분석 요소에 대한 요소별 적중률을 산출하는 적중률산출단계(S1010);상기 산출한 적중률 및 과거 이력에 따른 적중률 추이에 기반하여 상기 사용자(기업)의 수주 사업의 특성을 학습하는 학습단계(S1020);상기 학습한 수주 사업의 특성으로부터 낙찰 관련성 요소를 추출하여 추론하는 추론단계(S1030);상기 추론 결과에 따라 각 분석 요소에 대한 가중치 부여 방식을 모델링하는 가중치모델링단계(S1040); 및상기 각 분석 요소에 대한 가중치를 조정하는 조정단계(S1050)를 포함하는 것을 특징으로 하는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법."}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법에 관한 것으로서, 더욱 상세하게는 외부의 다수의 서버들로부터 정형 데이터 뿐만 아닌 비정형 데이터까지 포함하는 빅데이터를 수 집하여 데이터베이스를 구축하고, 상기 사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 사용자와의 상호작용에 의한 분석 요소별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 전략적으로 입찰 공고를 추천함으로써, 상기 사용자에게 맞춤형 사업 또는 수주 가능성이 높은 사업을 추천하는 것이 가능한 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법을 제공한다."}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법에 관한 것으로서, 더욱 상세하게는 외부의 다수의 서버들로부터 정형 데이터 뿐만 아닌 비정형 데이터까지 포함하는 빅데이터를 수집하여 데이터베이스를 구축하고, 상기 사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 사용자와 의 상호작용에 의한 분석 요소별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 전략적 으로 입찰 공고를 추천함으로써, 상기 사용자에게 맞춤형 사업 또는 수주 가능성이 높은 사업을 추천하는 것이 가능한 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "모든 것을 연결하는 초 연결 사회가 도래한 현재, 국가나 기업 등 각 분야 연구 개발주체들은 연결 및 접촉하는 과정에서 발생하는 모든 데이터들을 가치 있는 것으로 활용하기 위해 빅데이터 기술을 미래전략기술로 발전시키 고자 노력하고 있다. 특히, 글로벌 기업들은 빅데이터를 활용하여 각종 문제를 해결하고 이슈에 대응할 뿐만 아 니라 미래전략과 그에 수반되는 전략적 의사결정의 중요한 도구로 활용 중이다. 2015년 WIKIBON 자료에 따르면 전 세계 빅데이터 시장은 2026년에 846억 달러를 넘어설 것으로 보이며, 국내의 빅데이터 시장은 2015년 기준 2,623억 원이며, 빅데이터 도입을 원하는 기업은 전체기업 중 30.2%로 조사되고 있다. 현재 빅데이터의 성장 가 능성과 수요에 따라 수많은 빅데이터 관련 소프트웨어가 연구ㅇ개발되고 있다. 특히, 정보통신 분야 즉 유무선 통신 기술과 다양한 모바일 기기들이 빠르게 발전하는 기반에는 데이터의 축적 분석 및 활용방법의 발전에 근간하고 있다. 데이터를 수집분석하여 미래를 예측하고 새로운 가치를 창출하는 빅 데이터 기술은 이제 도입단계를 넘어 점차 확대되고 있는 추세를 보이고 있다. 기존 산업의 경쟁력 및 공공서비 스의 효율성 강화, 신규서비스 제품 창출과 혁신을 위해 빅데이터 기술이 광범위하게 적용되고 있다. 한편, 조달청 등 공공기관에서는 전자조달 발주시스템 등에 빅데이터 기술을 반영하여 공공시스템을 발전시키기 위한 노력을 기울이고 있으며, 그 일환으로 빅데이터를 활용하여 업무수행 시 유사성을 분석하고, 맞춤정보를 제공하는 등을 하고자 노력해 오고 있다. 그러나 현재까지 뚜렷한 성과는 거두지 못하는 실정이다. 또한, 조달업무를 수행하는 각종 공공기관에서는 수요기관과 조달업체 등의 발주지원을 위하여 전자조달시스템 을 운영 중인데. 전자조달시스템은 공공사업의 수발주 지원에 관련된 모든 업무를 체계화하여 정보화시스템을 통해 지원하는 서비스로써, 현재 활용 중인 대다수의 전자조달시스템은 공고나 업체 정보를 일일이 하나씩 검색 하는 등의 불편함이 있어 점점 급증하고 있는 조달공고를 쉽게 찾아보기가 어려운 실정이다. 특히, 자신이 속한 기업에서 입찰하기에 적정한 조달공고를 찾아내기 위해서는 일일이 그 내용을 열람하여 검토 해 봐야 하는데, 이를 위해서는 많은 시간과 노력이 필요하기 때문에 조달공고시스템의 사용자들의 불편이 호소 되어 왔다. 이런 문제점을 해결하기 위하여 조달공고의 내용이나 사용자의 기업정보 등을 분석하여 적정한 조달 공고를 추천해 줄 수 있는 시스템 및 서비스가 요구된다. 한국등록특허 [10-1991178]에서는 협업필터링을 이용한 조달공고 추천방법 및 시스템이 개시되어 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 [10-1991178](등록일자: 2019. 06. 13)"}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상기한 바와 같은 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 목적은 외부의 다수 의 서버들로부터 정형 데이터 뿐만 아닌 비정형 데이터까지 포함하는 빅데이터를 수집하여 데이터베이스를 구축 하고, 상기 사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 사용자와의 상호작용에 의한 분석 요소 별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 전략적으로 입찰 공고를 추천함으로써, 상기 사용자에게 맞춤형 사업 또는 수주 가능성이 높은 사업을 추천하는 것이 가능한 개인화 기 반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법을 제공하는 것이다. 본 발명의 실 시예들의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아"}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 일 실시예에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템은, 사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 상기 사용자와의 상 호작용에 의한 분석 요소별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 해당하는 입찰 공고를 추천하고 맞춤형 입찰 전략을 수립하기 위한 입찰 전략 수집 지원 서버; 상기 입찰 전략 수집 지원 서버에 접속하여, 맞춤형 사업 공고를 제공받기 위해 필요한 데이터를 송수신하고, 상기 사업 추천 알고리 즘에 따른 맞춤형 사업 공고를 제공받기 위한 다수의 사용자 단말기(110, 120); 및 상기 맞춤형 사업 공고에 따 른 입찰 전략을 수립 및 제공하는데 필요한 데이터를 수집하기 위한 다수의 외부 데이터 서버(130, 140)를 포함 하고, 상기 입찰 전략 수집 지원 서버는, 상기 다수의 사용자 단말로 상기 맞춤형 사업 공고 제공을 위한 인터페이스를 제공하는 인터페이스부; 상기 다수의 외부 데이터 서버로부터 데이터를 수집 및 가공하고 키 워드를 추출하여 데이터베이스에 입력하고, 상기 사용자 단말을 통한 입력 신호로부터 개별 특성 요소를 추출하 기 위한 데이터 수집부; 상기 인터페이스부를 통하여 송수신되는 데이터 및 상기 데이터 수집부를 통해 수 집한 데이터에 기초하여 상기 맞춤형 사업 공고를 제공하는데 필요한 데이터 처리를 수행하기 위한 데이터 처리 부; 상기 사용자 단말기의 선택 입력 및 투찰 결과에 따른 적중률 및 적중률 추이를 분석하여 가중치 모델 을 업데이트하기 위한 인공지능 분석부; 상기 맞춤형 사업 공고 제공을 위해 필요한 데이터를 저장하고 있 는 데이터베이스 관리부; 및 상기 인터페이스부, 데이터 수집부, 데이터 처리부, 인공지능 분석부, 및 데 이터베이스 관리부를 포함한 각 구성요소를 제어하기 위한 제어부를 포함한다. 상기 데이터 수집부는, 상기 다수의 외부 데이터 서버로부터 정형 데이터 및 비정형 데이터를 수집하기 위 한 수집부; 상기 수집된 데이터를 가공하기 위한 가공부; 상기 가공된 데이터로부터 키워드를 추출하 기 위한 키워드 추출부; 상기 추출한 키워드를 데이터베이스에 입력하기 위한 DB입력부; 상기 사용자 단말기의 입력 신호를 입력받아 변환하기 위한 데이터 변환부; 및 상기 변환된 사용자 단말기의 입력 신호 로부터 사용자의 특성 요소를 추출하기 위한 사용자특성 추출부를 포함하는 것을 특징으로 한다. 상기 데이터 처리부는, 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사 업규모를 결정하기 위한 사업규모 결정부; 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추 천할 사업 공고의 사업유형을 결정하기 위한 사업유형 결정부; 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 세부 사업유형을 결정하기 위한 세부 사업유형 결정부; 상기 데이터 베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 고객유형을 결정하기 위한 고객유형 결정부 ; 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업위치를 결정하기 위 한 사업위치 결정부; ?? 상기 결정된 사업규모, 사업유형, 세부 사업유형, 고객유형 및 사업위치를 기반으 로 사업추천 범위 및 기준을 결정하고, 상기 사업추천 범위 및 기준에 포함되는 대상 사업의 요소별 평가값을 산출하기 위한 사업 요소별 평가값 산출부를 포함하는 것을 특징으로 한다. 상기 인공지능 분석부는, 상기 대상 사업에 대한 사업의 요소별 평가값과 요소별 가중치를 이용하여 합산 한 총점에 따라 사업 공고를 추천하기 위한 사업 공고 추천부; 상기 추천한 사업 공고에 대한 상기 사용자 의 만족도 피드백 및 따른 투찰 결과 데이터베이스에 기반하여 투찰 결과를 분석하기 위한 투찰 결과 분석부 ; 상기 투찰 결과로부터 각 분석 요소에 대한 적중률을 산출하기 위한 적중률 산출부; 상기 산출한 적중률 및 과거 이력에 따른 적중률 추이에 기반하여 상기 사용자(기업)의 수주 사업의 특성을 학습하기 위한 학습부; 상기 학습한 수주 사업의 특성으로부터 낙찰 관련성 요소를 추출하여 추론하기 위한 추론부; 상기 추론 결과에 따라 각 분석 요소에 대한 가중치 부여 방식을 모델링하기 위한 가중치 모델링부; 및 상 기 각 분석 요소에 대한 가중치를 조정하기 위한 요소별 가중치 조정부를 포함하는 것을 특징으로 한다. 상기 사업규모 결정부는, 기존 수행 사업의 유형별 금액대 분포, 평균값 및 추이를 계산하여 상기 사업규 모를 기설정 금액범위로 결정하는 것을 특징으로 하고, 상기 사업유형 결정부는, 상기 기존 수행 사업의 \"용역 : 물품 : 공사\" 의 사업유형 비율에 따른 선호도로 사업유형의 비중(비율)을 결정하는 것을 특징으로 하 고, 상기 세부 사업유형 결정부는, 상기 기존 수행 사업의 공고명 키워드 분석을 통해, 세부사업유형을 결 정하는 것을 특징으로 하고, 상기 고객유형 결정부는, 상기 기존 수행 사업의 고객 유형에 따른 선호도로 고객유형의 비중(비율)을 결정하는 것을 특징으로 하고, 상기 사업위치 결정부는, 상기 사용자(기업)의 위 치(소재지) 및 고객(발주 기관)의 사업 위치를 이용하여 결정하는 것을 특징으로 하고, 상기 사업 요소별 평가 값 산출부는, 상기 사업규모에 대하여, 상기 사용자(기업)의 과거이력 기반 기설정 금액 단위로 구간을 구 분하고, 각 구간 별 사업 수를 카운트하여, 과거 수주 전체 사업 수의 70%가 분포된 사업비 구간을 탐지하여 P1 이라고 하고, \"P1의 평균값 = P1내 사업비 합/ P1내 사업 수\"을 계산하고, 추천 대상 사업의 사업비와 P1의 평 균값과의 차이의 절대값이 0에 가까울 수록 최고점을 부여하여 평가값을 산출하는 것을 특징으로 하고, 상기 사 업유형에 대하여, 도출된 사업유형별 비중(물품:공사:용역)의 편차 조정을 통해 사업 유형별 추천 비중을 도출 하는 것을 특징으로 하고, 상기 세부사업유형에 대하여, 해당 기업의 키워드를 분석하고, 기존 수주 사업의 제1 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 최근 1개월간 사용자(기업)가 검색한 제2 키워드의 중복키워드 순서 탐지 및 점수를 부여하고, 상기 제2 키워드의 중복 키드에 가중치를 부여하고, 해당 기업의 최종 키워드 순위 및 점수를 부여하고, 추천 대상 사업 별 키워드를 추출 및 분석하고, 해당 키워드에 점수를 부여하 고, 복수의 키워드에는 가산점을 부과하여 평가값을 산출하는 것을 특징으로 하고, 상기 고객유형에 대하여, 상 기 결정된 고객유형의 비중(비율)의 편차 조정을 통해 사업 추천시의 발주기관 유형의 비중을 도출하는 것을 특 징으로 하고, 상기 사업위치에 대하여, 기업의 위치코드와 사업의 위치코드의 차이의 절대값인 거리지수를 산출 하는 것을 특징으로 한다. 또한, 상기한 바와 같은 목적을 달성하기 위한 본 발명의 일 실시예에 따른 컴퓨터를 포함하는 연산처리수단에 의하여 실행되는 프로그램 형태로 이루어지는 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법은, 다수의 외부 데이터서버로부터 입찰 전략 수립에 필요한 데이터를 수집하는 데이터수집단계(S710); 수 집한 데이터로부터 사용자의 과거 사업이력 정보를 획득 및 처리하여 상기 사용자의 개별 특성이 적용된 요소별 우선순위 및 비중을 포함하는 사업추천 범위 및 기준을 결정하는 데이터처리단계(S720); 상기 사업추천 범위 및 기준에 포함되는 대상 사업의 요소별 평가값을 산출하는 요소별평가값산출단계(S730); 상기 대상 사업에 대한 사업의 요소별 평가값과 요소별 가중치를 이용하여 합산한 총점에 따라 사업 공고를 추천하는 사업공고추천단계 (S740); 상기 추천한 사업 공고에 대하여 상기 사용자의 만족도 피드백 및 투찰 결과에 따른 요소별 특성을 분 석하는 요소별특성분석단계(S750); 요소별 적중률 및 상기 요소별 적중률의 추이 학습을 통해 상기 요소별 가중 치를 보정하는 가중치보정단계(S760); 및 상기 사업추천단계, 상기 요소별특성분석단계, 및 상기 가중치보정단 계를 반복하여 진행하여 입찰 전략을 제공하는 입찰전략제공단계(S770)를 포함한다. 상기 데이터수집단계(S710)는, 상기 다수의 외부 데이터 서버로부터 정형 데이터 및 비정형 데이터를 수집하는 수집단계(S810); 상기 수집된 데이터를 가공하는 가공단계(S820); 상기 가공된 데이터로부터 키워드를 추출하는 키워드추출단계(S830); 추출한 키워드를 데이터베이스에 입력하는 DB입력단계(S840); 상기 사용자 단말기의 입 력 신호를 입력받아 변환하는 데이터변환단계(S850); 및 상기 변환된 사용자 단말기의 입력 신호로부터 특성 요 소를 추출하는 특성 요소 추출단계(S860)를 포함하는 것을 특징으로 한다. 상기 데이터처리단계(S720)는, 상기 사용자에게 추천할 사업 공고의 사업규모를 결정하는 사업규모결정단계 (S910); 상기 사용자에게 추천할 사업 공고의 사업유형을 결정하는 사업유형결정단계(S920); 상기 사용자에게 추천할 사업 공고의 세부 사업유형을 결정하는 세부사업유형결정단계(S930); 상기 사용자에게 추천할 사업 공고 의 고객유형을 결정하는 고객유형결정단계(S940); 상기 사용자에게 추천할 사업 공고의 사업위치를 결정하는 사 업위치결정단계(S950); 및 상기 결정된 사업규모, 사업유형, 세부 사업유형, 고객유형 및 사업위치를 기반으로 사업추천 범위 및 기준을 결정하는 추천범위결정단계(S960)르 포함하는 것을 특징으로 한다. 상기 사업규모결정단계(S910)는, 기존 수행 사업의 유형별 금액대 분포, 평균값 및 추이를 계산하여 상기 사업 규모를 기설정 금액범위로 결정하는 것을 특징으로 하고, 상기 사업유형결정단계(S920)는, 상기 기존 수행 사업 의 \"용역 : 물품 : 공사\" 의 사업유형 비율에 따른 선호도로 사업유형의 비중(비율)을 결정하는 것을 특징으로 하고, 상기 세부사업유형결정단계(S930)는, 상기 기존 수행 사업의 공고명 키워드 분석을 통해, 세부사업유형을 결정하는 것을 특징으로 하고, 상기 고객유형결정단계(S940)는, 상기 기존 수행 사업의 고객 유형에 따른 선호 도로 고객유형의 비중(비율)을 결정하는 것을 특징으로 하고, 상기 사업위치결정단계(S950)는, 상기 사용자(기 업)의 위치(소재지) 및 고객(발주 기관)의 사업 위치를 이용하여 결정하는 것을 특징으로 하고, 상기 요소별평 가값산출단계(S730)는, 상기 사업규모에 대하여, 상기 사용자(기업)의 과거이력 기반 기설정 금액 단위로 구간 을 구분하고, 각 구간 별 사업 수를 카운트하여, 과거 수주 전체 사업 수의 70%가 분포된 사업비 구간을 탐지하 여 P1이라고 하고, \"P1의 평균값 = P1내 사업비 합/ P1내 사업 수\"을 계산하고, 추천 대상 사업의 사업비와 P1 의 평균값과의 차이의 절대값이 0에 가까울 수록 최고점을 부여하여 평가값을 산출하는 것을 특징으로 하고, 상 기 사업유형에 대하여, 도출된 사업유형별 비중(물품:공사:용역)의 편차 조정을 통해 사업 유형별 추천 비중을 도출하는 것을 특징으로 하고, 상기 세부사업유형에 대하여, 해당 기업의 키워드를 분석하고, 기존 수주 사업의 제1 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 최근 1개월간 사용자(기업)가 검색한 제2 키워드의 중복 키워드 순서 탐지 및 점수를 부여하고, 상기 제2 키워드의 중복 키드에 가중치를 부여하고, 해당 기업의 최종 키워드 순위 및 점수를 부여하고, 추천 대상 사업 별 키워드를 추출 및 분석하고, 해당 키워드에 점수를 부여하고, 복수의 키워드에는 가산점을 부과하여 평가값을 산출하는 것을 특징으로 하고, 상기 고객유형에 대하 여, 상기 결정된 고객유형의 비중(비율)의 편차 조정을 통해 사업 추천시의 발주기관 유형의 비중을 도출하는 것을 특징으로 하고, 상기 사업위치에 대하여, 기업의 위치코드와 사업의 위치코드의 차이의 절대값인 거리지수 를 산출하는 것을 특징으로 한다. 상기 가중치보정단계(S760)는, 상기 투찰 결과로부터 각 분석 요소에 대한 요소별 적중률을 산출하는 적중률산 출단계(S1010); 상기 산출한 적중률 및 과거 이력에 따른 적중률 추이에 기반하여 상기 사용자(기업)의 수주 사 업의 특성을 학습하는 학습단계(S1020); 상기 학습한 수주 사업의 특성으로부터 낙찰 관련성 요소를 추출하여 추론하는 추론단계(S1030); 상기 추론 결과에 따라 각 분석 요소에 대한 가중치 부여 방식을 모델링하는 가중치 모델링단계(S1040); 및 상기 각 분석 요소에 대한 가중치를 조정하는 조정단계(S1050)를 포함하는 것을 특징으 로 한다. 또한, 본 발명의 일 실시예에 따르면, 상기 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방 법을 구현하기 위한 프로그램이 저장된 컴퓨터 판독 가능한 기록매체가 제공되는 것을 특징으로 한다. 아울러, 본 발명의 일 실시예에 따르면, 상기 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법을 구현하기 위해, 컴퓨터 판독 가능한 기록매체에 저장된 프로그램이 제공되는 것을 특징으로 한다."}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법 에 의하면, 외부의 다수의 서버들로부터 정형 데이터 뿐만 아닌 비정형 데이터까지 포함하는 빅데이터를 수집하 여 데이터베이스를 구축하고, 상기 사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 사용자와의 상호 작용에 의한 분석 요소별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 전략적으로 입 찰 공고를 추천함으로써, 상기 사용자에게 맞춤형 사업 또는 수주 가능성이 높은 사업을 추천하는 것이 가능한 효과가 있다. 또한, 본 발명의 일 실시예에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템 및 그 방법에 의하면, 사용자들이 자신의 기업과 맞는 사업 공고를 일일이 검색하지 않고도 자신의 기업이 입찰하 기에 적정한 최적의 조달 공고를 자동으로 추천받을 수 있는 효과가 있다."}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 명세서에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의 도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 공정, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 공정, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 일반적으 로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미가 있 는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명을 더욱 상세하게 설명한다. 이에 앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정하여 해석되어서는 아니 되며, 발명자는 그 자신의 발명을 가 장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술 적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 또한, 사용되는 기술 용어 및 과학 용어에 있어서 다"}
{"patent_id": "10-2020-0173165", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "른 정의가 없다면, 이 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 가지며, 하기의 설명 및 첨부 도면에서 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 설명은 생략한다. 다음에 소개되는 도면들은 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 예로서 제공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 또한, 명세서 전반에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타낸다. 도면들 중 동일한 구성 요소들은 가능한 한 어느 곳에서든지 동일한 부호들로 나타내고 있음에 유의해야 한다. 인공지능(Artificial Intelligence, AI) 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템이며, 기존 Rule 기반 스마트 시스템과 달리 기계가 스스로 학습하고 판단하며 똑똑해지는 시스템이다. 인공지능 시스템은 사용 할수록 인식률이 향상되고 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 Rule 기반 스마트 시스템은 점차 딥러닝 기반 인공지능 시스템으로 대체되고 있다. 인공지능 기술은 기계학습(딥러닝) 및 기계학습을 활용한 요소 기술들로 구성된다. 기계학습은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘 기술이며, 요소기술은 딥러닝 등의 기계학 습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 기술로서, 언어적 이해, 시각적 이해, 추론/예측, 지식 표현, 동작 제어 등의 기술 분야로 구성된다. 인공지능 기술이 응용되는 다양한 분야는 다음과 같다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리 하는 기술로서, 자연어 처리, 기계 번역, 대화시스템, 질의 응답, 음성 인식/합성 등을 포함한다. 시각적 이해 는 사물을 인간의 시각처럼 인식하여 처리하는 기술로서, 객체 인식, 객체 추적, 영상 검색, 사람 인식, 장면 이해, 공간 이해, 영상 개선 등을 포함한다. 추론 예측은 정보를 판단하여 논리적으로 추론하고 예측하는 기술 로서, 지식/확률 기반 추론, 최적화 예측, 선호 기반 계획, 추천 등을 포함한다. 지식 표현은 인간의 경험정보 를 지식데이터로 자동화 처리하는 기술로서, 지식 구축(데이터 생성/분류), 지식 관리(데이터 활용) 등을 포함 한다. 동작 제어는 차량의 자율 주행, 로봇의 움직임을 제어하는 기술로서, 움직임 제어(항법, 충돌, 주행), 조 작 제어(행동 제어) 등을 포함한다. 한편, 본 발명에서 사용되는 데이터 수집 및 처리는 로보틱 처리 자동화(RPA) 기술을 이용하여 수행된다. 로보 틱 처리 자동화(RPA; Robotic Process Automation) 기술은 업무 과정에 발생되는 데이터를 정형화하고 논리적으 로 자동 수행하는 기술로, 기업의 재무, 회계, 제조, 구매, 고객 관리 등에서 데이터 수집, 입력, 비교 등과 같 이 반복되는 단순 업무를 자동화하여 빠르고 정밀하게 수행한다. 즉, 경영 전반의 업무 시간을 단축하고 비용을 절감할 수 있다. 지능형의 로봇 소프트웨어을 활용한 비즈니스 자동화 기술은 1990년대부터 웹 사이트 화면에서 필요한 정보를 수집하는 스크린 스크래핑(screen scraping)이나 업무 관련된 제반 사항을 자동으로 처리 관리하는 워크플로 자 동화 등에 활용되었다. 일반 비즈니스 자동화는 인공 지능(AI)과 기계 학습(Machine Learning) 기술을 적용한 비즈니스 관리 위주의 프 로세스로 구축된 반면, RPA는 최종 사용자의 관점에서 규칙 기반 비즈니스 프로세스로 설계되어 사람 대신 단순 반복 작업을 끊임없이 대량으로 수행한다. RPA는 현재 규칙이 확실하게 규정된 작업만 처리할 수 있고 사람의 판단력을 대체할 수준은 아니다. 기계 학습, 음성 인식, 자연어 처리와 같은 인지 기술을 적용하여 사람의 인지 능력이 필요한 의료 분야의 암 진단, 금융업계에서의 고객 자산 관리, 법률 판례 분석 등에도 활용될 수 있다. 빅 데이터란 기존 데이터의 수집, 저장, 관리, 분석 역량을 넘어서는 데이터 세트를 의미한다. 빅 데이터는 정 형화 정도에 따라 정형 데이터, 반정형 데이터, 및 비정형 데이터로 분류될 수 있다. 정형 데이터(structured data)는 고정된 필드에 저장되는 데이터를 말한다. 즉, 일정한 형식을 갖추고 저장되는 데이터를 말한다. 반정형 데이터(semi-structured data)는 고정된 필드에 저장되어 있지는 않지만, 메타데이터 나 스키마를 포함하는 데이터를 말한다. 반정형 데이터로는 XML(Extensible Mark-up Language) 및 HTML(Hypertext Mark-up Language)을 예로 들 수 있다. 비정형 데이터(unstructured data)는 고정된 필드에 저 장되어 있지 않은 데이터를 말한다. 비정형 데이터로는 텍스트 문서, 이미지 데이터, 동영상 데이터, 및 음성 데이터를 예로 들 수 있다. 본 발명에 따른 입찰 전략 수립 지원 시스템은 상술한 바와 같은 빅 데이터를 수집하여, 분석할 수 있다. 빅 데 이터 분석 기술로는 텍스트 마이닝(text mining), 평판 분석(opinion mining), 소셜 네트워크 분석, 군집 분석 (cluster analysis), 신경망 분석(neural network analysis), 및 마코브 모델(markov model)을 예로 들 수 있 으나, 예시된 분석 기술들로 한정되는 것은 아니다. 텍스트 마이닝은 반정형 텍스트 데이터 또는 비정형 텍스트 데이터에서 자연 언어 처리 기술에 기반하여 유용한 정보를 추출, 가공하는 기술이다. 자연 언어 처리(Natural Language Processing; NLP) 기술은 자연 언어 이해 와 자연 언어 생성이 가능하도록 하는 기술이다. 자연 언어란 사람이 의사소통을 하기 위해 사용하는 용어로, 인공 언어(컴퓨터 언어)와 반대되는 개념이다. 자연 언어 이해란 자연 언어를 기계적으로 분석해서 컴퓨터가 이 해할 수 있는 형태로 만드는 것을 말한다. 자연 언어 생성은 컴퓨터가 자연 언어를 출력할 수 있도록 하는 것을 말한다. 자연 언어 처리 기술은 형태소 분석, 구문 분석, 의미 분석, 및 화용 분석으로 이루어진다. 평판 분석은 블로그(blog), 소셜 네트워크 서비스(Social Network Service; SNS), 위키(Wiki), 손수제작물 (UCC), 마이크로 블로그(Micro-Blog) 등과 같은 소셜 미디어(social media)에서 정형 텍스트 및 비정형 텍스트 를 수집 및 분석하여, 제품이나 서비스에 대한 평판(예를 들어, 긍정, 부정, 중립)을 판별하는 기술이다. 소셜 네트워크 분석은 소셜 네트워크 연결구조 및 연결강도 등에 기초하여, 사용자의 영향력, 관심사, 및 성향 을 분석하고, 추출하는 기술이다. 소셜 네트워크 분석을 수행할 때 활용할 수 있는 정보의 종류는 크게 팔로우 (follow), 댓글(reply), 공유(리트윗(retweet, 트위터의 경우) 등으로 구분할 수 있다. 온라인 상에서 특정인과 친구를 맺거나 그의 글을 보고 싶을 때 팔로우를 하게 되고, 댓글을 달거나 공유(리트윗)을 하게 되면 적극적인 상호관계를 의미하게 된다. 이러한 관계들을 분석하여 사용자의 영향력이나 전파력을 평가할 수 있고, 나아가 특정 글들의 확산과정을 추적하거나, 향후 의견들의 확산을 추정해볼 수 있다. 군집 분석은 비슷한 특성을 가진 개체를 합쳐가면서 최종적으로 유사한 특성을 가진 군을 발굴하는 기술이다. 도 1은 본 발명에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템의 일 실시예 구 성도이고, 도 2는 도 1의 입찰 전략 수립 지원 서버의 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템은 입찰 전략 수집 지원 서버, 다수의 사용자 단말기(110, 120), 및 외부 데이터 서버(130, 140)를 포함한다. 상기 입찰 전략 수집 지원 서버는 웹서버 기반 또는 전용 애플리케이션 방식의 입찰 전략 수립 제공 서비 스를 제공하기 위한 소프트웨어 및/또는 하드웨어 구성요소를 구비한 컴퓨팅 시스템이며, 통신 네트워크를 통하 여 다수의 사용자 단말기(110, 120) 및 외부 데이터 서버(130, 140)(예를 들어, 쇼핑몰 서버, 포털 서버) 와 통신하여, 상기 다수의 사용자 단말기(110, 120)에 입찰 전략을 제공한다. 상기 입찰 전략 수집 지원 서버는 사용자의 개별 특성에 따른 사업 추천 알고리즘을 이용하여 상기 사용자 와의 상호작용에 의한 분석 요소별 적중률 및 적중률 추이의 학습을 통해 분석 요소별 가중치를 보정하여 해당 하는 입찰 공고를 추천하고 맞춤형 입찰 전략을 수립하여 상기 사용자 단말기(110, 120)로 제공한다.상기 사용자 단말기(110, 120)는 상기 입찰 전략 수집 지원 서버에 접속하여, 맞춤형 사업 공고를 제공받 기 위해 필요한 데이터를 송수신하고, 상기 사업 추천 알고리즘에 따른 맞춤형 사업 공고를 제공받는다. 상기 다수의 외부 데이터 서버(130, 140)는 상기 맞춤형 사업 공고에 따른 입찰 전략을 수립 및 제공하는데 필 요한 데이터를 수집한다. 한편, 본 발명의 일 실시예에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템은 사 용자 단말기(110, 120)의 과금 처리를 담당하기 위한 결제 서버(미도시)를 더 포함할 수 있다. 또한, 상기 결제 서버는 별도의 데이터베이스를 구비할 수도 있다. 도 2를 참조하면, 상기 입찰 전략 수집 지원 서버는 인터페이스부, 제어부, 데이터 수집부 , 데이터 처리부, 인공지능 분석부, 및 데이터베이스 관리부 등을 포함한다. 상기 인터페 이스부, 상기 제어부, 상기 데이터 수집부, 상기 데이터 처리부, 상기 인공지능 분석부 , 및 상기 데이터베이스 관리부는 그 중 적어도 일부가 입찰 전략 수집 지원 서버과 통신하는 프로그램 모듈들일 수 있다. 이러한 프로그램 모듈들은 운영 시스템, 응용 프로그램 모듈 및 기타 프로그램 모 듈의 형태로 입찰 전략 수집 지원 서버에 포함될 수 있으며, 물리적으로는 여러 가지 공지의 기억 장치 상 에 저장될 수 있다. 또한, 이러한 프로그램 모듈들은 입찰 전략 수집 지원 서버과 통신 가능한 원격 기억 장치에 저장될 수도 있다. 한편, 이러한 프로그램 모듈들은 본 발명에 따라 후술할 특정 업무를 수행하거나 특 정 추상 데이터 유형을 실행하는 루틴, 서브루틴, 프로그램, 오브젝트, 컴포넌트, 데이터 구조 등을 포괄하지만, 이에 제한되지는 않는다. 여기서, 통신 네트워크는 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있으며, 근거리 통신 망(LAN; Local Area Network), 도시권 통신망(MAN; Metropolitan Area Network), 광역 통신망(WAN; Wide Area Network) 등 다양한 통신망으로 구성될 수 있다. 바람직하게는, 본 발명에서 말하는 통신 네트워크는 공지의 월 드와이드웹(WWW; World Wide Web)일 수 있다. 상기 인터페이스부는 입찰 전략 수집 지원 서버가 상기 다수의 사용자 단말기(110, 120)와 통신을 수 행할 수 있도록 인터페이싱하며, 입찰 전략 제공과 관련된 데이터의 전송 및 수신을 위해 필요한 그래픽 사용자 인터페이스를 상기 다수의 사용자 단말기(110, 120)에 제공할 수 있다. 상기 제어부는 상술한 바와 같은 인터페이스부와, 후술할 데이터 수집부, 데이터 처리부, 인공지능 분석부 및 데이터베이스 관리부 간의 데이터의 흐름을 제어하는 기능을 수행한다. 상기 데이터 수집부는 상기 다수의 외부 데이터 서버(130, 140)로부터 데이터를 수집 및 가공하고 키워드 를 추출하여 데이터베이스에 입력하고, 상기 사용자 단말기(110, 120)를 통한 입력 신호로부터 개별 특성 요소 를 추출한다. 상기 데이터 처리부는 상기 인터페이스부를 통하여 송수신되는 데이터 및 상기 데이터 수집부를 통해 수집한 데이터에 기초하여 상기 맞춤형 사업 공고를 제공하는데 필요한 데이터 처리를 수행한다. 상기 인공지능 분석부는 상기 사용자 단말기(110, 120)의 선택 입력 및 투찰 결과에 따른 적중률 및 적중 률 추이를 분석하여 가중치 모델을 업데이트한다. 상기 데이터베이스 관리부는, 맞춤형 사업 공고를 제공받기 위한 사용자(기업)를 회원으로 가입시켜 그 인 적 정보를 관리하기 위한 회원(기업) 데이터베이스(106a), 상기 사용자(회원)의 과거 이력을 저장하여 관리하기 위한 과거이력데이터베이스(106b), 상기 데이터 수집부를 통해 수집한 사업 공고를 저장하고 있는 사업공 고 데이터베이스(106c), 사용자로부터 입력받은 신호로부터 사용자 특성을 추출하여 저장하고 있는 특성추출 데 이터베이스(106d), 상기 회원의 입찰에 대한 투찰 결과를 저장하고 있는 투찰결과 데이터베이스(106e), 및 상기 사업 공고 추천을 위한 가중치 모델을 저장하고 있는 가중치 모델 데이터베이스(106f)등을 포함할 수 있다. 예를 들면, 상기 회원 데이터베이스(106a)는 회원들이 로그인하기 위하여 사용하는 로그인 ID 및 패스워드 등의 식별 정보와, 이름, 성별, 사업자 번호, 주소, 연락처 등에 관한 정보를 포함할 수 있다. 도면에 도시되지 않았지만, 과금 데이터베이스는, 회원에 따른 과금 데이터를 저장하고 있을 수 있다. 한편, 회 원 등급에 따른 과금 결제 내역 등을 더 포함할 수 있다. 상기 실시예에서는, 본 발명의 구현을 위한 정보를 저장하는 데이터베이스를회원 데이터베이스(106a), 과거이력 데이터베이스(106b), 사업공고 데이터베이스(106c), 특성추출 데이터베이스(106d), 투찰결과 데이터베이스(106e), 및 가중치 모델 데이터베이스(106f)의 여섯 가지 데이터베이스로 분류하였지만, 이러한 분류를 포함한 데이터베이스의 구성은 당업자의 필요에 따라 변경될 수 있다. 한편, 본 발명에 있어서, 데이터베이스란, 협의의 데이터베이스뿐만 아니라, 컴퓨터 파일 시스템에 기반을 둔 데이터 기록 등을 포함하는 넓은 의미의 데이터베이스까지 포함하는 개념으로서, 단순한 연산 처리 로그의 집합 이라도 이를 검색하여 소정의 데이터를 추출할 수 있다면 본 발명에서 말하는 데이터베이스에 포함될 수 있음이 이해되어야 한다. 상기 다수의 사용자 단말기(110, 120)는 한편, 상기 다수의 사용자 단말기(110, 120)는 개인화 기반 맞춤형 사 업 공고 제공 서비스에 관심을 가진 자가 통신 네트워크를 통하여 상기 입찰 전략 수집 지원 서버에 접속 한 후 통신할 수 있도록 하는 기능을 포함하는 디지털 기기로서, 개인용 컴퓨터(예를 들어, 데스크탑 컴퓨터, 노트북 컴퓨터 등), 워크스테이션, PDA, 웹 패드, 이동 전화기 등과 같이 메모리 수단을 구비하고 마이크로 프 로세서를 탑재하여 연산 능력을 갖춘 디지털 기기라면 얼마든지 본 발명에 따른 다수의 사용자 단말기(110, 120)로서 채택될 수 있다. 한편, 상기 다수의 사용자 단말기(110, 120)는 개인화 기반 맞춤형 사업 공고 제공 서비스를 이용하기 위한 전 용 애플리케이션이 설치될 수 있다. 상기 다수의 사용자 단말기(110, 120)는 개인화 기반 맞춤형 사업 공고 제공 서비스를 받기 위해 회원 가입을 하고, 회원 등급에 따른 서비스 요금 결제를 결제서버(미도시됨)에 요청하고, 상기 입찰 전략 수집 지원 서버 에 개인화 기반 맞춤형 사업 공고 제공 서비스를 요청하고, 상기 입찰 전략 수집 지원 서버로부터 전 달받은 개인화 기반 맞춤형 사업 공고를 디스플레이되도록 한다. 도 3은 도 2의 데이터 수집부의 상세 구성도이다. 도 3을 참고하면, 데이터 수집부는, 수집부, 가공부, 키워드 추출부, DB입력부, 데이 터 변환부, 및 사용자특성 추출부를 포함한다. 상기 수집부는 상기 다수의 외부 데이터 서버로부터 정형 데이터 및 비정형 데이터를 수집한다. 상기 가공부는 상기 수집된 데이터를 가공한다. 상기 키워드 추출부는 상기 가공된 데이터로부터 키워드를 추출한다. 상기 DB입력부는 상기 추출한 키워드를 데이터베이스에 입력한다. 상기 데이터 변환부는 상기 사용자 단말기(110, 120)의 입력 신호를 입력받아 변환한다. 상기 사용자특성 추출부는 상기 변환된 사용자 사용자 단말기(110, 120)의 입력 신호로부터 사용자의 특성 요소를 추출한다. 도 4은 도 2의 데이터 처리부의 상세 구성도이다. 도 4를 참고하면, 데이터 처리부는, 사업규모 결정부, 사업유형 결정부, 세부 사업유형 결정부 , 고객유형 결정부, 사업위치 결정부, 및 사업 요소별 평가값 산출부를 포함한다. 상기 사업규모 결정부는 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업규 모를 결정한다. 상기 사업유형 결정부는 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업유형을 결정한다. 상기 세부 사업유형 결정부는 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공 고의 세부 사업유형을 결정한다. 상기 고객유형 결정부는 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 고객유형을 결정한다. 상기 사업위치 결정부는 상기 데이터베이스에 저장된 데이터로부터 상기 사용자에게 추천할 사업 공고의 사업위치를 결정한다. 상기 사업 요소별 평가값 산출부는 상기 결정된 사업규모, 사업유형, 세부 사업유형, 고객유형 및 사업위 치를 기반으로 사업추천 범위 및 기준을 결정하고, 상기 사업추천 범위 및 기준에 포함되는 대상 사업의 요소별 평가값을 산출한다. 이하, 각 요소별 결정 방식에 대하여 상세히 설명하기로 한다. <사업 규모(공고사업비)> 사업규모는, 사용자(기업)의 과거 이력 데이터로부터, 기존 수주 사업의 유형별 사업비 및 해당 사용자(기업)가 상세조회(링크이동)한 사업의 사업비를 이용하여 결정된다. 상기 사업규모 결정부는 유형별 최대사업비, 유형별 최저사업비, 유형별 사업비 분포도 및 구간, 년별/월 별 유형별 평균사업비의 추이 등에 대하여 기존 수주 사업의 사업유형별 사업비를 분석한다. 또한, 상기 사업규모 결정부는 최근 3개월간 사용자(기업)가 검색-링크이동한 사업 기준 유형별 사업비 분 포도 및 구간과 최근 1개월간 사용자(기업)가 검색-링크이동한 사업 기준 유형별 사업비 분포도 및 구간 등에 대하여 사용자(기업)가 상세조회(링크이동)한 사업의 사업비를 분석한다. 상기 사업 요소별 평가값 산출부는 유형별 상한선, 유형별 하한선, 분포 비중 1순위 구간의 상/하한선, 평 균이동 추이에 따른 추천구간 조정을 통해 사업 추천범위를 도출한다. 또한, 상기 사업 요소별 평가값 산출부는 최근 3개월 검색-링크이동 사업 기준 분포 비중 1순위 구간의 평 균값, 최근 1개월간 사용자(기업)가 검색-링크이동한 사업 기준 분포 비중 1순위 구간의 평균값의 도출을 통해 상기 사업 추천범위를 축소한다. 여기서, 평균이동 추이가 상승세인 경우 1순위 구간의 평균값보다 같거나 높은 사업 범위에서 평균값에 가까울 수록 상위순위가 되고, 평균이동 추이가 하향세인 경우 1순위 구간의 평균값보다 같거나 낮은 사업 범위에서 평 균값에 가까울수록상위순위가 되도록, 사업규모에 대한 평가값을 부여한다. 이때, 1순위를 최고점으로 하여 하 향순위로 갈수록 낮아지도록 평가값을 산정한다. 여기서 사업 규모에 대한 평가값은 다음과 같이 계산할 수 있다. 1. 기업 과거이력 기반 기설정 금액 단위로 구간 구분 2. 각 구간 별 사업 수 카운트 3. 과거 수주 전체 사업 수의 70%가 분포된 사업비 구간을 탐지하여 P1이라고 함 4. \"P1의 평균값 = P1내 사업비 합/ P1내 사업 수\"을 계산 5. 추천 대상 사업의 사업비와 P1의 평균값과의 차이의 절대값이 0에 가까울 수록 최고점을 부여한다. <사업 유형(비중, 비율)> 사업 유형별 비중(비율)은, 사용자(기업)의 과거 이력 데이터로부터, 기존 수주 사업 유형별 비중 및 해당 사용 자(기업)가 검색한 사업 유형의 순위를 이용하여 결정된다. 상기 사업 유형 결정부는 기존 수행 사업의 사업 유형별 비중을 분석하여 전체 수주 사업 기준 사업유형별 비중(물품:공사:용역), 최근 6개월 수주 사업 기준 사업유형별 비중(물품:공사:용역) 도출한다. 또한, 상기 사업 유형 결정부는 최근 1개월간 사용자(기업)가 검색한 사업 기준 사업유형별 비중(물품:공 사:용역)을 도출한다. 상기 사업 요소별 평가값 산출부는 상기 도출된 사업유형별 비중(물품:공사:용역)의 편차 조정을 통해 사 업 유형별 추천 비중을 도출한다. 예를 들어, 물품 10%, 공사 10%, 용역 80% 인 (10:10:80) 이 될 수 있다. <세부 사업유형> 세부 사업유형은, 사용자(기업)의 과거 이력 데이터로부터, 기존 수주 사업의 키워드 및 해당 사용자(기업)가 검색한 키워드를 이용하여 결정된다. 상기 세부 사업유형 결정부는 기존 수주 사업의 키워드를 분석하는데, 지명, 기관명, 사업 등의 불용어를 처리하고, 제1 키워드의 순위 및 관계성 분석을 통해 키워드를 기준으로 한 세부 사업유형을 도출한다. 또한, 상기 세부 사업유형 결정부는 해당 최근 1개월간 사용자(기업)가 검색한 제2 키워드의 순위를 도출 한다. 상기 사업 요소별 평가값 산출부는 상기 도출된 키워드들을 기준으로 제1 키워드의 순위와 제2 키워드의 순위에서, 상위 키워드 범위 내 중복도(일치도) 순으로 키워드 기준의 추천 순서를 조정한다. 예를 들어, 검색일(현재) 기준 또는 최종 접속일 기준으로 공고 등록일이 오늘이거나 최종 접속일 이후인 신규 공고들 중에서 상위 키워드와 매핑되는 순서에 따라 세부 사업유형에 대한 평가값이 계산된다. 여기서, 세부 사업유형에 대한 평가값은, 중복도가 놓은 키워드가 포함된 사업인 경우 해당 기업의 키워드 중복 도 순과 동일한 순위로 평가값을 산정한다. 이때, 1순위를 최고점으로 하여 하향순위로 갈수록 낮아지도록 평가 값을 산정한다. 또한, 하나의 사업에 복수의 키워드가 포함된 경우 가산점을 부여한다. 즉, 세부 사업유형에 대한 평가값(키워드 적중도 평가값)은 다음과 같이 계산할 수 있다. 1. 해당 기업의 키워드 분석 2. 제1 키워드의 중복 키워드 순서 탐지 및 점수 부여 3. 제2 키워드의 중복 키워드 순서 탐지 및 점수 부여 4. 제2 키워드의 중복 키워드에 가중치 부여 (중복 제거한 전체 키워드 수에서의 제1 키워드의 비중) 5. 해당 기업의 최종 키워드 순위 및 점수 부여 6. 추천 대상 사업 별 키워드 추출 및 분석 7. 해당 키워드에 점수를 부여 (복수 키워드에는 가산점 부과) <고객 유형> 참고로, 도 6에 고객 유형(기관 유형)에 따른 각 기관들이 나열되어 있다. 고객유형은, 기존 고객(기관)들, 기존 고객(기관)의 유형별 비중, 해당 사용자(기업)가 검색한 고객 순위를 이 용하여 결정된다. 상기 고객유형 결정부는 전체 수주 사업을 기준으로 기관 유형별 비중 도출하거나 최근 1년간 수주한 사업 을 기준으로 기관 유형별 비중을 도출하여 기존 고객들의 기관유형을 분석한다. 또한, 상기 고객유형 결정부는 최근 6개월간 해당기업이 검색(상세 보기)한 사업의 발주기관 유형과 검색 한 발주기관 유형의 비중(비율)을 결정한다. 상기 사업 요소별 평가값 산출부는 상기 결정한 기관 유형별 비중의 편차 조정을 통해 사업 추천시의 발주 기관 유형의 비중을 도출한다. 예를 들어, 발주기관 유형의 비중은, 자치행정기관 50%, 국가행정기관 30%, 교육 행정기관 12%, 공공기관 8% (50:30:12:8)이 될 수 있다. <사업위치> 사업위치는, 기업의 소재지, 기존 고객의 소재지, 및 해당 기업이 검색한 고객 소재지의 순위를 이용하여 결정 된다. 상기 사업위치 결정부는 기초지자체 단위를 기준으로 해당 기업과 기존 고객들 간 거리 순위를 도출한다. 또한, 상기 사업위치 결정부는 기초지자체 단위를 기준으로 해당 기업과 해당 기업이 검색한 발주기관(고 객)들과의 거리 순위를 도출한다. 상기 사업 요소별 평가값 산출부는 상기 도출된 발주기관 목록들을 토대로 해당 기업과의 거리지수를 산출 하고, 거리지수별 분포 비중에 따라 사업이 추천되도록 한다. 여기서 거리지수란, 기업의 위치코드와 사업의 위치코드의 차이의 절대값으로, 거리지수는 행정구역 기준으로 몇 개의 경계를 지나야 하는가로 계산될 수 있다. 얘를 들어, 기업과 사업이 같은 경기도에 위치한다고 하면, 거리지수가 0이될 수 있고, 기업과 사업이 각각 경 기도와 충청도에 위치한다고 하면, 거리지수가 1이 될 수 있다. 그에 따라, 거리지수별 분포 비중은, 거리지수 \"0\" 50%, 거리지수 \"1\" 30%, 거리지수 \"2\" 10%, 거리지수 \"3\" 5%, 거리지수 \"5\" 5% 로 결정할 수 있다.즉, 사업 추천 시 사업위치에 대한 평가값은 다음과 같이 평가될 수 있다. 모델링된 기초지자체 간 거리지수를 적용하여 기업과 발주기관(사업위치) 간의 거리에 대한 평가값을 산정하는 데 있어서 다음과 같이 계산할 수 있다. 1. 거리지수가 0인 경우 최고점을 부여 2. 기업과 사업 간 거리지수 산출식 사용 거리지수 = ㅣ기업위치코드 ?? 사업위치코드ㅣ (위치코드 차이의 절대값) 도 5는 도 2의 인공지능 분석부의 상세 구성도이다. 도 5에 도시된 바와 같이, 본 발명에 따른 인공지능 분석부는, 사업 공고 추천부, 투찰 결과 분석부 , 요소별 적중률 산출부, 학습부, 추론부, 가중치 모델링부, 및 요소별 가중치 조정 부를 포함한다. 상기 사업 공고 추천부는 상기 대상 사업에 대한 사업의 요소별 평가값과 요소별 가중치를 이용하여 합산 한 총점에 따라 사업 공고를 추천한다. 예를 들어, 5가지 요소별 초기 가중치는 각각 동일하게 20%(0.2)씩 부여될 수 있다. 이후, 가중치 보정단계를 통해 요소별 가중치가 보정될 수 있다. 상기 투찰 결과 분석부는 상기 추천한 사업 공고에 대한 상기 사용자의 만족도 피드백 및 따른 투찰결과 데이터베이스(106e)에 기반하여 투찰 결과를 분석한다. 상기 요소별 적중률 산출부는 상기 투찰 결과로부터 각 분석 요소에 대한 적중률을 산출한다. 상기 학습부는 상기 산출한 적중률 및 과거 이력에 따른 적중률 추이에 기반하여 상기 사용자(기업)의 수 주 사업의 특성을 학습한다. 상기 추론부는 상기 학습한 수주 사업의 특성으로부터 낙찰 관련성 요소를 추출하여 추론한다. 상기 가중치 모델링부는 상기 추론 결과에 따라 각 분석 요소에 대한 가중치 부여 방식을 모델링하여 업데 이트한다. 상기 요소별 가중치 조정부는 상기 모델링된 가중치 부여 방식에 따라 상기 각 분석 요소에 대한 가중치를 조정한다. 상기 인공지능 분석부는 가중치 모델 데이터베이스(106f) 및 사용자의 개별 특성에 근거하여 상기 사용자 의 초기 가중치를 결정하기 위한 초기 가중치 결정부를 더 포함한다. 도 6은 본 발명에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템에서 구분하는 고 객유형을 설명하기 위한 도면이다. 도 6을 참고하면, 고객유형은, 공공기간, 교육기관, 교육행정기관, 국가행정기관, 위원회, 입법기관, 자치행정 기관, 헌법기관 등으로 분류가 가능하다. 도 7은 본 발명에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법의 일실시에 흐름도 이다. 우선, 다수의 외부 데이터서버(130, 140)로부터 입찰 전략 수립에 필요한 데이터를 수집한다(S710). 이후, 수집한 데이터로부터 사용자의 과거 사업이력 정보를 획득 및 처리하여 상기 사용자의 개별 특성이 적용 된 요소별 우선순위 및 비중을 포함하는 사업추천 범위 및 기준을 결정한다(S720). 이후, 상기 사업추천 범위 및 기준에 포함되는 대상 사업의 요소별 평가값을 산출한다(S730). 이후, 상기 대상 사업에 대한 사업의 요소별 평가값과 요소별 가중치를 이용하여 합산한 총점에 따라 사업 공고 를 추천한다(S740). 예를 들어, 5가지 요소별 초기 가중치는 각각 동일하게 20%(0.2)씩 부여될 수 있다. 이후, 가중치 보정단계를 통해 요소별 가중치가 보정될 수 있다. 이후, 상기 추천한 사업 공고에 대하여 상기 사용자의 만족도 피드백 및 투찰 결과에 따른 요소별 특성을 분석 한다(S750). 이후, 요소별 적중률 및 상기 요소별 적중률의 추이 학습을 통해 상기 요소별 가중치를 보정한다(S760). 이후, 상기 사업추천단계(S740), 상기 요소별특성분석단계(S750), 및 상기 가중치보정단계(S760)를 반복하여 진 행하여 입찰 전략을 제공한다(S770). 도 8은 도 7의 데이터수집단계(S710)의 일실시예 상세 흐름도이다. 데이터 수집단계(S710)는. 우선, 다수의 외부 데이터 서버(130,140)로부터 정형 데이터 및 비정형 데이터를 수 집한다(S810). 이후, 상기 수집된 데이터를 가공한다(S820). 이후, 상기 가공된 데이터로부터 키워드를 추출한다(S830). 이후, 상기 추출한 키워드를 데이터베이스에 입력한다(S840). 이후, 상기 사용자 단말기(110, 120)의 입력 신호를 입력받아 변환한다(S850). 이후, 상기 변환된 사용자 단말기(110, 120)의 입력 신호로부터 특성 요소를 추출한다(S860). 도 9는 도 7의 데이터처리단계(S720)의 일실시예 상세 흐름도이다. 데이터처리단계(S720)는, 우선, 사용자(기업)에게 추천할 사업 공고의 사업규모를 결정한다(S910). 상기 사용자에게 추천할 사업 공고의 사업유형을 결정한다(S920). 상기 사용자에게 추천할 사업 공고의 세부 사업유형을 결정한다(S930). 상기 사용자에게 추천할 사업 공고의 고객유형을 결정한다(S940). 상기 사용자에게 추천할 사업 공고의 사업위치를 결정한다(S950). 이후, 상기 결정된 사업규모, 사업유형, 세부 사업유형, 고객유형 및 사업위치를 기반으로 사업추천 범위 및 기 준을 결정한다(S960). 상기 사업규모결정단계(S910)는, 기존 수행 사업의 유형별 금액대 분포, 평균값 및 추이를 계산하여 상기 사업 규모를 기설정 금액범위로 결정하고, 상기 사업유형결정단계(S920)는, 상기 기존 수행 사업의 \"용역 : 물품 : 공사\" 의 사업유형 비율에 따른 선호도로 사업유형의 비중(비율)을 결정하고, 상기 세부사업유형결정단계(S93 0)는, 상기 기존 수행 사업의 공고명 키워드 분석을 통해, 세부사업유형을 결정하고, 상기 고객유형결정단계 (S940)는, 상기 기존 수행 사업의 고객 유형에 따른 선호도로 고객유형의 비중(비율)을 결정하고, 상기 사업위 치결정단계(S950)는, 상기 사용자(기업)의 위치(소재지) 및 고객(발주 기관)의 사업 위치를 이용하여 결정한다. 상기 요소별평가값산출단계(S730)에서, 각 요소별 결정 방식에 대하여 상세히 설명하기로 한다. <사업 규모(공고사업비)> 사업규모는, 사용자(기업)의 과거 이력 데이터로부터, 기존 수주 사업의 유형별 사업비 및 해당 사용자(기업)가 상세조회(링크이동)한 사업의 사업비를 이용하여 결정된다. 상기 사업규모결정단계(S910)에서는 유형별 최대사업비, 유형별 최저사업비, 유형별 사업비 분포도 및 구간, 년 별/월별 유형별 평균사업비의 추이 등에 대하여 기존 수주 사업의 사업유형별 사업비를 분석한다. 또한, 상기 사업규모결정단계(S910)에서는 최근 3개월간 사용자(기업)가 검색-링크이동한 사업 기준 유형별 사 업비 분포도 및 구간과 최근 1개월간 사용자(기업)가 검색-링크이동한 사업 기준 유형별 사업비 분포도 및 구간 등에 대하여 사용자(기업)가 상세조회(링크이동)한 사업의 사업비를 분석한다. 상기 요소별평가값산출단계(S730)에서는 유형별 상한선, 유형별 하한선, 분포 비중 1순위 구간의 상/하한선, 평 균이동 추이에 따른 추천구간 조정을 통해 사업 추천범위를 도출한다. 또한, 상기 요소별평가값산출단계(S730)에서는 최근 3개월 검색-링크이동 사업 기준 분포 비중 1순위 구간의 평 균값, 최근 1개월간 사용자(기업)가 검색-링크이동한 사업 기준 분포 비중 1순위 구간의 평균값의 도출을 통해 상기 사업 추천범위를 축소한다.여기서, 평균이동 추이가 상승세인 경우 1순위 구간의 평균값보다 같거나 높은 사업 범위에서 평균값에 가까울 수록 상위순위가 되고, 평균이동 추이가 하향세인 경우 1순위 구간의 평균값보다 같거나 낮은 사업 범위에서 평 균값에 가까울수록상위순위가 되도록, 사업규모에 대한 평가값을 부여한다. 이때, 1순위를 최고점으로 하여 하 향순위로 갈수록 낮아지도록 평가값을 산정한다. 여기서 사업 규모에 대한 평가값은 다음과 같이 계산할 수 있다. 1. 기업 과거이력 기반 기설정 금액 단위로 구간 구분 2. 각 구간 별 사업 수 카운트 3. 과거 수주 전체 사업 수의 70%가 분포된 사업비 구간을 탐지하여 P1이라고 함 4. \"P1의 평균값 = P1내 사업비 합/ P1내 사업 수\"을 계산 5. 추천 대상 사업의 사업비와 P1의 평균값과의 차이의 절대값이 0에 가까울 수록 최고점을 부여한다. <사업 유형(비중, 비율)> 사업 유형별 비중(비율)은, 사용자(기업)의 과거 이력 데이터로부터, 기존 수주 사업 유형별 비중 및 해당 사용 자(기업)가 검색한 사업 유형의 순위를 이용하여 결정된다. 상기 사업유형결정단계(S920)에서는 기존 수행 사업의 사업 유형별 비중을 분석하여 전체 수주 사업 기준 사업 유형별 비중(물품:공사:용역), 최근 6개월 수주 사업 기준 사업유형별 비중(물품:공사:용역) 도출한다. 또한, 상기 사업유형결정단계(S920)에서는 최근 1개월간 사용자(기업)가 검색한 사업 기준 사업유형별 비중(물 품:공사:용역)을 도출한다. 상기 요소별평가값산출단계(S730)에서는 상기 도출된 사업유형별 비중(물품:공사:용역)의 편차 조정을 통해 사 업 유형별 추천 비중을 도출한다. 예를 들어, 물품 10%, 공사 10%, 용역 80% 인 (10:10:80) 이 될 수 있다. <세부 사업유형> 세부 사업유형은, 사용자(기업)의 과거 이력 데이터로부터, 기존 수주 사업의 키워드 및 해당 사용자(기업)가 검색한 키워드를 이용하여 결정된다. 상기 세부사업유형결정단계(S930)에서는 기존 수주 사업의 키워드를 분석하는데, 지명, 기관명, 사업 등의 불용 어를 처리하고, 제1 키워드의 순위 및 관계성 분석을 통해 키워드를 기준으로 한 세부 사업유형을 도출한다. 또한, 상기 세부사업유형결정단계(S930)에서는 해당 최근 1개월간 사용자(기업)가 검색한 제2 키워드의 순위를 도출한다. 상기 요소별평가값산출단계(S730)에서는 상기 도출된 키워드들을 기준으로 제1 키워드의 순위와 제2 키워드의 순위에서, 상위 키워드 범위 내 중복도(일치도) 순으로 키워드 기준의 추천 순서를 조정한다. 예를 들어, 검색일(현재) 기준 또는 최종 접속일 기준으로 공고 등록일이 오늘이거나 최종 접속일 이후인 신규 공고들 중에서 상위 키워드와 매핑되는 순서에 따라 세부 사업유형에 대한 평가값이 계산된다. 여기서, 세부 사업유형에 대한 평가값은, 중복도가 놓은 키워드가 포함된 사업인 경우 해당 기업의 키워드 중복 도 순과 동일한 순위로 평가값을 산정한다. 이때, 1순위를 최고점으로 하여 하향순위로 갈수록 낮아지도록 평가 값을 산정한다. 또한, 하나의 사업에 복수의 키워드가 포함된 경우 가산점을 부여한다. 즉, 세부 사업유형에 대한 평가값(키워드 적중도 평가값)은 다음과 같이 계산할 수 있다. 1. 해당 기업의 키워드 분석 2. 제1 키워드의 중복 키워드 순서 탐지 및 점수 부여 3. 제2 키워드의 중복 키워드 순서 탐지 및 점수 부여 4. 제2 키워드의 중복 키워드에 가중치 부여 (중복 제거한 전체 키워드 수에서의 제1 키워드의 비중) 5. 해당 기업의 최종 키워드 순위 및 점수 부여 6. 추천 대상 사업 별 키워드 추출 및 분석 7. 해당 키워드에 점수를 부여 (복수 키워드에는 가산점 부과) <고객 유형> 참고로, 도 6에 고객 유형(기관 유형)에 따른 각 기관들이 나열되어 있다. 고객유형은, 기존 고객(기관)들, 기존 고객(기관)의 유형별 비중, 해당 사용자(기업)가 검색한 고객 순위를 이 용하여 결정된다. 상기 고객유형결정단계(S940)에서는 전체 수주 사업을 기준으로 기관 유형별 비중 도출하거나 최근 1년간 수주 한 사업을 기준으로 기관 유형별 비중을 도출하여 기존 고객들의 기관유형을 분석한다. 또한, 상기 고객유형결정단계(S940)에서는 최근 6개월간 해당기업이 검색(상세 보기)한 사업의 발주기관 유형과 검색한 발주기관 유형의 비중(비율)을 결정한다. 상기 요소별평가값산출단계(S730)에서는 상기 결정한 기관 유형별 비중의 편차 조정을 통해 사업 추천시의 발주 기관 유형의 비중을 도출한다. 예를 들어, 발주기관 유형의 비중은, 자치행정기관 50%, 국가행정기관 30%, 교육 행정기관 12%, 공공기관 8% (50:30:12:8)이 될 수 있다. <사업위치> 사업위치는, 기업의 소재지, 기존 고객의 소재지, 및 해당 기업이 검색한 고객 소재지의 순위를 이용하여 결정 된다. 상기 사업위치결정단계(S950)에서는 기초지자체 단위를 기준으로 해당 기업과 기존 고객들 간 거리 순위를 도출 한다. 또한, 상기 사업위치결정단계(S950)에서는 기초지자체 단위를 기준으로 해당 기업과 해당 기업이 검색한 발주기 관(고객)들과의 거리 순위를 도출한다. 상기 요소별평가값산출단계(S730)에서는 상기 도출된 발주기관 목록들을 토대로 해당 기업과의 거리지수를 산출 하고, 거리지수별 분포 비중에 따라 사업이 추천되도록 한다. 여기서 거리지수란, 기업의 위치코드와 사업의 위치코드의 차이의 절대값으로, 거리지수는 행정구역 기준으로 몇 개의 경계를 지나야 하는가로 계산될 수 있다. 얘를 들어, 기업과 사업이 같은 경기도에 위치한다고 하면, 거리지수가 0이될 수 있고, 기업과 사업이 각각 경 기도와 충청도에 위치한다고 하면, 거리지수가 1이 될 수 있다. 그에 따라, 거리지수별 분포 비중은, 거리지수 \"0\" 50%, 거리지수 \"1\" 30%, 거리지수 \"2\" 10%, 거리지수 \"3\" 5%, 거리지수 \"5\" 5% 로 결정할 수 있다. 즉, 사업 추천 시 사업위치에 대한 평가값은 다음과 같이 평가될 수 있다. 모델링된 기초지자체 간 거리지수를 적용하여 기업과 발주기관(사업위치) 간의 거리에 대한 평가값을 산정하는 데 있어서 다음과 같이 계산할 수 있다. 1. 거리지수가 0인 경우 최고점을 부여 2. 기업과 사업 간 거리지수 산출식 사용 거리지수 = ㅣ기업위치코드 ?? 사업위치코드ㅣ (위치코드 차이의 절대값) 도 10은 도 7의 가중치보정단계(S760)의 일실시예 상세 흐름도이다. 가중치보정단계(S760)는, 우선, 상기 투찰 결과로부터 각 분석 요소에 대한 요소별 적중률을 산출한다(S1010). 여기서, 상기 요소별 적중률은 다음과 같이 구한다. A 요소의 적중률은 전체 수천 사업 수 중에서 A요소가 포함되어 수주된 사업의 수로 계산될 수 있다. 이후, 상기 산출한 적중률 및 과거 이력에 따른 적중률 추이에 기반하여 상기 사용자(기업)의 수주 사업의 특성 을 학습한다(S1020). 이후, 상기 학습한 수주 사업의 특성으로부터 낙찰 관련성 요소를 추출하여 추론한다(S1030). 이후, 상기 추론 결과에 따라 각 분석 요소에 대한 가중치 부여 방식을 모델링하거나 업데이트한다(S1040). 이후, 상기 각 분석 요소에 대한 가중치를 조정한다(S1050). 이상에서 본 발명의 일 실시예에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법에 대하여 설명하였지만, 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법을 구현하기 위한 프 로그램이 저장된 컴퓨터 판독 가능한 기록매체 및 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지 원 방법을 구현하기 위한 컴퓨터 판독 가능한 기록매체에 저장된 프로그램 역시 구현 가능함은 물론이다. 즉, 상술한 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법은 이를 구현하기 위한 명령어 들의 프로그램이 유형적으로 구현됨으로써, 컴퓨터를 통해 판독될 수 있는 기록매체에 포함되어 제공될 수도 있 음을 당업자들이 쉽게 이해할 수 있을 것이다. 다시 말해, 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그 램 명령 형태로 구현되어, 컴퓨터 판독 가능한 기록매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록매체 는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소 프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 상기 컴퓨터 판독 가능한 기록매체의 예에는 하드 디스크, 플로피 디스크 및 자기테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록매체 (optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬 (ROM), 램(RAM), 플래시 메모리, USB 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하 드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니 라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기 하드웨어 장치 는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 본 발명은 상기한 실시예에 한정되지 아니하며, 적용범위가 다양함은 물론이고, 청구범위에서 청구하는 본 발명 의 요지를 벗어남이 없이 다양한 변형 실시가 가능한 것은 물론이다."}
{"patent_id": "10-2020-0173165", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템의 일 실시예 구 성도. 도 2는 도 1의 입찰 전략 수립 지원 서버의 구성도. 도 3은 도 2의 데이터 수집부의 상세 구성도. 도 4은 도 2의 데이터 처리부의 상세 구성도. 도 5는 도 2의 인공지능 분석부의 상세 구성도. 도 6은 본 발명에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 시스템에서 구분하는 고 객유형을 설명하기 위한 도면. 도 7은 본 발명에 따른 개인화 기반 사업 추천 알고리즘을 이용한 입찰 전략 수립 지원 방법의 일실시에 흐름도. 도 8은 도 7의 데이터수집단계(S710)의 일실시예 상세 흐름도. 도 9는 도 7의 데이터처리단계(S720)의 일실시예 상세 흐름도. 도 10은 도 7의 가중치보정단계(S760)의 일실시예 상세 흐름도."}
