{"patent_id": "10-2022-0146153", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0064305", "출원번호": "10-2022-0146153", "발명의 명칭": "선천적 질환의 증상에 관한 예측 및 상담을 진행하기 위한 예측 모델 생성 방법, 환자 상담", "출원인": "단국대학교 천안캠퍼스 산학협력단", "발명자": "임유미"}}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "선천적 질환을 가진 임상 환자로부터 센싱된 모니터링 정보, 상기 임상 환자에게 처방된 의약품 정보 및 상기임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집하는 단계;딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자에 대한 경과를 예측하는 단계;상기 임상 환자에 대한 경과에 대응하여 상기 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하는 단계;및상기 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하기위한 증상 예측 모델을 생성하는 단계;를 포함하는 예측 모델 생성 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 임상 환자의 학습 데이터를 수집하는 단계는,i) 선천적 질환의 특징에 따른 활력 징후를 파악하기 위한 임상 환자의 모니터링 정보, ii) 상기 임상 환자에게내복, 주사, 도포 중 적어도 하나의 목적으로 처방된 의약품 정보, 상기 의약품에 관한 일자 별 투약 내역 및iii) 임상 환자가 가진 선천적 질환에 의한 과거 병력을 포함하여 임상 환자에게 조치된 진료 정보를 포함하는학습 데이터를 수집하는 단계;"}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 임상 환자의 회복에 관한 경과를 예측하는 단계는,상기 임상 환자의 학습 데이터로부터 임상 환자의 산소 포화도, 체중 변화, 체온, 호흡기 증상, 의약품의 경구섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나의 관찰 증상을 분석하는 예측 모델 생성 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 임상 환자의 회복에 관한 경과를 예측하는 단계는,상기 임상 환자의 학습 데이터에 포함된 진료 정보를 기반으로 상기 임상 환자에게 기 발현된 관찰 증상 외에추가적으로 발현된 동반 증상을 분석하는 예측 모델 생성 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 임상 환자의 회복에 관한 경과를 예측하는 단계는,상기 관찰 증상이 발현된 제1 시점으로부터의 지속 시간 및 관찰 증상으로 인한 의료 기관에서의 상담 횟수를판단하는 단계; 및상기 판단된 지속 시간 및 상담 횟수에 비례하여 임상 환자에 대한 경과를 예측하는 단계;를 포함하는 예측 모델 생성 방법.공개특허 10-2024-0064305-3-청구항 6 제3항에 있어서,상기 임상 환자의 회복에 관한 경과를 예측하는 단계는,상기 관찰 증상이 발현된 제1 시점의 이전 시점으로 제2 시점에서의 시행된 임상 환자의 예방 접종 여부, 의약품 변경 여부, 바이러스 감염 여부 중 적어도 하나의 증상 이벤트를 확인하는 단계;상기 관찰 증상과 관련하여 상기 임상 환자가 선천적 질환으로 복용 중인 의약품이 존재하는지 여부를 확인하는단계; 및상기 증상 이벤트의 종류 및 복용 중인 의약품의 종류를 고려하여 상기 임상 환자에 대한 경과를 예측하는단계;를 포함하는 예측 모델 생성 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 임상 환자의 회복에 관한 경과를 예측하는 단계는,상기 임상 환자의 학습 데이터로부터 상기 임상 환자의 사망에 관한 부정적 경과 또는, 상기 임상 환자의 회복,유지에 관한 긍정적 경과 중 하나의 경과를 예측하는 예측 모델 생성 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "선천적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석하여 타겟 환자의 질환 증상을 판단하는 단계;선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하는 단계; 및상기 사고 유형에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 상담 정보를 타겟 환자의 보호자가 소지한 사용자 단말에 전달하는 단계;를 포함하는 환자 상담 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 타겟 환자의 질환 증상을 판단하는 단계는,상기 타겟 환자에게 부착된 웨어러블 장치로부터 센싱된 모니터링 정보, 타겟 환자의 보호자에 의해 섭취된 의약품 및 타겟 환자의 진료 정보 중 적어도 하나를 포함하는 타겟 환자의 상태 데이터를 수집하는 단계; 및상기 수집한 타겟 환자의 상태 데이터로부터 타겟 환자의 질환 증상을 판단하는 단계;를 포함하는 환자 상담 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 타겟 환자의 질환 증상을 판단하는 단계는,상기 타겟 환자의 상태 데이터를 분석하여 타겟 환자의 산소 포화도, 체중 변화, 체온, 호흡기 증상, 의약품의경구 섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나에 대한 상기 타겟 환자의 질환 증상을 판단하는 환자상담 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,공개특허 10-2024-0064305-4-상기 증상 예측 모델은,딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자의 사망에 관한 부정적 경과또는, 상기 임상 환자의 회복, 유지에 관한 긍정적 경과 중 하나의 경과를 예측한 결과로, 선천적 질환을 가진타겟 환자의 증상을 판단하기 위해 생성된 모델인 환자 상담 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 사용자 단말에 전달하는 단계는,상기 타겟 환자에 발생 가능한 사고 유형을 구성하는 무해 사건, 위해 사건 및 적신호 사건 중 하나에 대응하여타겟 환자에 대한 후속 조치를 유도하기 위한 의료 가이드 라인을 포함하는 상담 정보를 사용자 단말에 전달하는 환자 상담 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 타겟 환자의 부정적 경과는,상기 타겟 환자의 사망 또는, 외과적 수술에 관한 의사를 포함하는 예측 결과를 포함하고,상기 타겟 환자의 긍정적 경과는,상기 타겟 환자의 회복, 유지, 치유에 관한 의사를 포함하는 예측 결과를 포함하는 환자 상담 방법."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "예측 모델 생성 방법을 수행하는 컴퓨팅 장치에 있어서,상기 컴퓨팅 장치는 프로세서를 포함하고,상기 프로세서는,선천적 질환을 가진 임상 환자로부터 센싱된 모니터링 정보, 상기 임상 환자에게 처방된 의약품 정보 및 상기임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집하고,딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자에 대한 경과를 예측하고,상기 임상 환자에 대한 경과에 대응하여 상기 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하고,상기 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하기위한 증상 예측 모델을 생성하는 컴퓨팅 장치."}
{"patent_id": "10-2022-0146153", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "환자 상담 방법을 수행하는 컴퓨팅 장치에 있어서,상기 컴퓨팅 장치는 프로세서를 포함하고,상기 프로세서는,선천적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석하여 타겟 환자의 질환 증상을 판단하고,선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하고,상기 사고 유형에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 상담 정보를 타겟 환자의 보호자가 소지한 사용자 단말에 전달하는 컴퓨팅 장치."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 선천적 질환의 증상에 관한 예측 및 상담을 진행하기 위한 예측 모델 생성 방법, 환자 상담 방법 및 컴퓨팅 장치에 관한 것으로, 구체적으로는 딥 러닝을 통한 AI 기반의 선천적 질환을 가진 타겟 환자의 증상을 상 담하기 위해 선천적 질환을 가진 임상 환자의 학습 데이터를 조합 및 분석하여 임상 환자에게 발현된 증상에 대 응하는 경과를 판단 및 경과에 따라 예측된 사고 유형을 포함하는 증상 예측 모델을 생성한다. 이후, 본 발명은 증상 예측 모델을 기반으로 선천적 질환을 가진 타겟 환자의 상태 데이터를 분석하여 타겟 환자의 증상 및 경과 를 예측하고, 예측된 경과에 대응하는 사고 유형 타겟에 대해 시간, 장소에 제한없이 환자의 보호자에게 전달한 다."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 선천적 질환의 증상에 관한 예측 및 상담을 진행하기 위한 예측 모델 생성 방법, 환자 상담 방법 및 컴퓨팅 장치에 관한 것으로, 구체적으로는 선천적 질환을 가진 환자를 대상으로 딥 러닝을 통한 AI 기반의 상담 을 진행하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "심장병은 선천성 심장병과 후천성 심장병으로 구분되며, 후천성 심장병은 주로 성인에게 발생되는 질환으로 협 심증 또는, 심근경색과 같은 환경 인자에 영향을 받는다. 선천성 심장병은 주로 신생아에게 발생되는 질환으로, 풍진이나, 염색체 이상의 질병 또는, 원인 불명의 외부 인자에 영향을 받는다. 이러한, 선천성 심장 병은 사망률이 높고, 빠른 경과를 보이기 때문에 응급 처치와 응급 수술이 필요하며, 초기 진단 및 수술 방법에 따른 상이한 생존율을 나타낸다. 최근에는 선천성 심장병에 대한 수술 방법과 수술 전, 후 시점에 환자 관리의 향상으로 단순 선천성 심장병 뿐 만 아니라, 대부분의 복잡성 선천성 심장병 또한 수술 후 높은 생존율을 나타내고 있다. 하지만, 선천성 심장병을 가진 환자가 모두 긍정적인 수술 성과가 적용되는 것이 아니라, 실제 순환에 사용되는 심실이 하나만 형성된 단심실증의 경우 교정수술 전 1단계 또는 2단계 수술을 거쳐야 하는데, 1단계 수술 후 생 존하여 2단계 수술을 시행 받을 수 있는 가능성은 낮게 보고되고 있다. 이는, 첫 번째 수술 후 입원기간 동안 의 사망률이 높을 뿐만 아니라 퇴원 후 다음 단계의 수술을 기다리는 동안의 중간 단계(interstage)에서의 사망 률이 높기 때문이다. 이에, 이러한 고위험군에 해당하는 환자를 관리하기 위한 홈 모니터링 시스템이 제안되었다. 자세하게, 병원의 임상 전문 간호사는 환자의 보호자를 대상으로 퇴원 전 홈 모니터링 시스템에 관련된 교육을 실시하고, 환자의 보호자는 교육받은 내용에 기초하여 홈 모니터링 앱을 통해 데이터를 입력하고, 환자의 혈역학적 상태를 알 수 있는 산소포화도 및 영양 상태를 알 수 있는 수유량과 체중 등의 확인이 가능하다. 또한, 홈 모니터링 시스템 은 그 외 보호자가 궁금한 사항에 대한 상담 진행이 가능하다. 그러나, 홈 모니터링 시스템은 보호자가 요청한 상담 진행에 있어, 의료진의 근무 시간에 국한되어 있으며, 상 담을 진행한 의료진의 경험, 역량 등에 따라 상담 내용에 따라 편차가 크다. 또한, 상담 내용은 의료진으로부 터 일방적인 전달 기능으로써, 환자 및 보호자의 만족도가 그리 높지 않은 편이다."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일실시예에 따른 본 발명은 선천적 질환과 관련해 이전에 치료 내역이 존재하거나, 또는, 현재 치료 중인 임상 환자의 학습 데이터를 수집하고, 수집된 학습 데이터로부터 임상 환자에게 발현된 증상에 대응하는 경과를 분석함으로써, 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증상 예측 모델을 생성하는 예측 모델 생성 방법을 제공할 수 있다. 본 발명의 일실시예에 따른 본 발명은 딥 러닝을 기반으로 임상 환자의 학습 데이터를 조합 및 분석의 학습 결 과를 포함하는 증상 예측 모델을 이용함으로써, 선천적 질환과 관련하여 수술 전, 후 과정의 각 단계에서 발생 할 수 있는 사고 유형(adverse event)를 사전에 예측하는 예측 모델 생성 방법을 제공할 수 있다. 본 발명의 일실시예에 따른 본 발명은 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 타겟 환자의 질환 증상에 대한 경과를 예측함으로써, 예측된 경과에 따른 사고 유형이 타겟 환 자에게 발생하기 전에 타겟 환자의 현재 상태를 보호자에게 전달 및 환자의 의료적 안전을 확보하는 환자 상담 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일실시예에 따른 예측 모델 생성 방법은 선천적 질환을 가진 임상 환자로부터 센싱된 모니터링 정보, 상기 임상 환자에게 처방된 의약품 정보 및 상기 임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집하는 단계; 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자에 대한 경과를 예측하는 단계; 상기 임상 환자에 대한 경과에 대응하여 상기 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하는 단계; 및 상기 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증상 예측 모델을 생성하는 단계;를 포함할 수 있다. 본 발명의 일실시예에 따른 임상 환자의 학습 데이터를 수집하는 단계는, i) 선천적 질환의 특징에 따른 활력 징후를 파악하기 위한 임상 환자의 모니터링 정보, ii) 상기 임상 환자에게 내복, 주사, 도포 중 적어도 하나의 목적으로 처방된 의약품 정보, 상기 의약품에 관한 일자 별 투약 내역 및 iii) 임상 환자가 가진 선천적 질환에 의한 과거 병력을 포함하여 임상 환자에게 조치된 진료 정보를 포함하는 학습 데이터를 수집하는 단계;를 포함 할 수 있다. 본 발명의 일실시예에 따른 임상 환자의 회복에 관한 경과를 예측하는 단계는, 상기 임상 환자의 학습 데이터로 부터 임상 환자의 산소 포화도, 체중 변화, 체온, 호흡기 증상, 의약품의 경구 섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나의 관찰 증상을 분석할 수 있다. 본 발명의 일실시예에 따른 임상 환자의 회복에 관한 경과를 예측하는 단계는, 상기 임상 환자의 학습 데이터에 포함된 진료 정보를 기반으로 상기 임상 환자에게 기 발현된 관찰 증상 외에 추가적으로 발현된 동반 증상을 분 석할 수 있다. 본 발명의 일실시예에 따른 임상 환자의 회복에 관한 경과를 예측하는 단계는, 상기 관찰 증상이 발현된 제1 시 점으로부터의 지속 시간 및 관찰 증상으로 인한 의료 기관에서의 상담 횟수를 판단하는 단계; 및 상기 판단된 지속 시간 및 상담 횟수에 비례하여 임상 환자에 대한 경과를 예측하는 단계;를 포함할 수 있다. 본 발명의 일실시예에 따른 임상 환자의 회복에 관한 경과를 예측하는 단계는, 상기 관찰 증상이 발현된 제1 시 점의 이전 시점으로 제2 시점에서의 시행된 임상 환자의 예방 접종 여부, 의약품 변경 여부, 바이러스 감염 여 부 중 적어도 하나의 증상 이벤트를 확인하는 단계; 상기 관찰 증상과 관련하여 상기 임상 환자가 선천적 질환 으로 복용 중인 의약품이 존재하는지 여부를 확인하는 단계; 및 상기 증상 이벤트의 종류 및 복용 중인 의약품 의 종류를 고려하여 상기 임상 환자에 대한 경과를 예측하는 단계;를 포함할 수 있다. 본 발명의 일실시예에 따른 임상 환자의 회복에 관한 경과를 예측하는 단계는, 상기 임상 환자의 학습 데이터로 부터 상기 임상 환자의 사망에 관한 부정적 경과 또는, 상기 임상 환자의 회복, 유지에 관한 긍정적 경과 중 하 나의 경과를 예측할 수 있다. 본 발명의 일실시예에 따른 환자 상담 방법은 선천적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석 하여 타겟 환자의 질환 증상을 판단하는 단계; 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증 상 예측 모델을 이용하여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하는 단계; 및 상기 사고 유형 에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 상담 정보를 타겟 환자의 보호자가 소지한 사용자 단 말에 전달하는 단계;를 포함할 수 있다. 본 발명의 일실시예에 따른 타겟 환자의 질환 증상을 판단하는 단계는, 상기 타겟 환자에게 부착된 웨어러블 장 치로부터 센싱된 모니터링 정보, 타겟 환자의 보호자에 의해 섭취된 의약품 및 타겟 환자의 진료 정보 중 적어 도 하나를 포함하는 타겟 환자의 상태 데이터를 수집하는 단계; 및 상기 수집된 타겟 환자의 상태 데이터로부터 선천적 질병을 가진 타겟 환자의 질환 증상을 판단하는 단계;를 포함할 수 있다. 본 발명의 일실시예에 따른 타겟 환자의 질환 증상을 판단하는 단계는, 상기 증상 예측 모델을 통한 상기 타겟 환자의 산소 포화도, 체중 변화, 체온, 호흡기 증상, 의약품의 경구 섭취 용량, 의약품에 대한 이상 반응 중 적 어도 하나를 적용하여 상기 타겟 환자의 질환 증상을 판단할 수 있다. 본 발명의 일실시예에 따른 증상 예측 모델은, 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환 을 가진 임상 환자의 사망에 관한 부정적 경과 또는, 상기 임상 환자의 회복, 유지에 관한 긍정적 경과 중 하나 의 경과를 예측한 결과로, 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위해 생성된 모델일 수 있다. 본 발명의 일실시예에 따른 사용자 단말에 전달하는 단계는, 상기 타겟 환자에 발생 가능한 사고 유형을 구성하 는 무해 사건, 위해 사건 및 적신호 사건 중 하나에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 의 료 가이드 라인을 포함하는 상담 정보를 사용자 단말에 전달할 수 있다. 본 발명의 일실시예에 따른 타겟 환자의 부정적 경과는, 상기 타겟 환자의 사망 또는, 외과적 수술에 관한 의사 를 포함하는 예측 결과를 포함하고, 상기 타겟 환자의 긍정적 경과는, 상기 타겟 환자의 회복, 유지, 치유에 관 한 의사를 포함하는 예측 결과를 포함할 수 있다. 본 발명의 일실시예에 따른 예측 모델 생성 방법을 수행하는 컴퓨팅 장치에 있어서, 상기 컴퓨팅 장치는 프로세 서를 포함하고, 상기 프로세서는, 선천적 질환을 가진 임상 환자로부터 센싱된 모니터링 정보, 상기 임상 환자 에게 처방된 의약품 정보 및 상기 임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집 하고, 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자에 대한 경과를 예측하 고, 상기 임상 환자에 대한 경과에 대응하여 상기 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하고, 상기 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증상 예측 모델을 생성할 수 있다. 본 발명의 일실시예에 따른 환자 상담 방법을 수행하는 컴퓨팅 장치에 있어서, 상기 컴퓨팅 장치는 프로세서를 포함하고, 상기 프로세서는, 선천적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석하여 타겟 환자의 질환 증상을 판단하고, 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측하고, 상기 사고 유형에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 상담 정보를 타겟 환자의 보호자가 소지한 사용자 단말에 전달할 수 있다."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일실시예에 따르면, 예측 모델 생성 방법을 수행하는 은 선천적 질환과 관련해 이전에 치료 내역이 존재하거나, 또는, 현재 치료 중인 임상 환자의 학습 데이터를 수집하고, 수집된 학습 데이터로부터 임상 환자 에게 발현된 증상에 대응하는 경과를 분석함으로써, 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증 상 예측 모델을 생성할 수 있다. 본 발명의 일실시예에 따르면, 예측 모델 생성 방법은 딥 러닝을 기반으로 임상 환자의 학습 데이터를 조합 및 분석을 통한 학습 결과를 포함하는 증상 예측 모델을 이용함으로써, 선천적 질환과 관련하여 수술 전, 후 과정 의 각 단계에서 발생할 수 있는 사고 유형을 사전에 예측할 수 있다. 본 발명의 일실시예에 따르면, 환자 상담 방법은 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 타겟 환자의 질환 증상에 대한 경과를 예측함으로써, 예측된 경과에 따른 사고 유형 이 타겟 환자에게 발생하기 전에 타겟 환자의 현재 상태를 보호자에게 전달 및 환자의 의료적 안전을 확보할 수 있다. 본 발명의 일실시예에 따르면, 환자 상담 방법은 딥 러닝 기반의 AI 예측을 통해 사고 유형이 발생하기 전에 컴 퓨팅 장치가 시간, 장소에 제한없이 타겟 환자의 현재 상태에 관한 조언을 포함하는 상담 내용을 환자 및 보호 자에게 전달함으로써, 복잡한 선천적 질환으로 인한 사망률을 낮추고, 치료 성공율을 높일 수 있다."}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 선천적 질환의 증상에 관한 예측 및 상담을 진행하기 위한 전반적인 시스템 을 설명하기 위해 도시한 도면이다. 도 1을 참고하면, 본 발명은 머신 러닝(딥 러닝)을 통한 AI 카운슬러 프로그램을 개발하기 위한 목적을 가진다. 이를 위해, 본 발명은 과거 위해 사건 또는 적신호 사건을 경험했던 임상 환자들의 경과를 모두 입력해서 AI가 딥 러닝을 통해 학습하고, 학습된 결과를 바탕으로 타겟 환자의 정보를 분석하여 위해 사건 또는, 적신호 사건 이 발생할 확률을 예측할 수 있다. 그리고, 본 발명은 예측된 결과를 보호자 및 타겟 환자에게 최적의 시점에 표준화된 상담 정보로 제공할 수 있다. 이를 위해, 컴퓨팅 장치는 임상 환자의 학습 데이터를 조합 및 분석을 통해 타겟 환자의 증상을 판단하기 위한 예측 모델 생성 방법 및 타겟 환자의 증상을 분석 및 후속 조치를 위한 상담을 진행하는 환자 상담 방법을 수행할 수 있다. ① 예측 모델 생성 방법 컴퓨팅 장치는 과거 심각한 증상 변화(Critical events)가 있었던 선천성 심장병 환아들의 데이터를 인공 지능(AI)가 딥러닝(Deep learning)을 통하여 학습을 수행할 수 있다. 이를 위해, 컴퓨팅 장치 임상 환자 의 학습 데이터를 저장 및 보관하는 데이터 베이스와 연동할 수 있다. 컴퓨팅 장치는 선천적 질환을 가진 임상 환자로부터 센싱된 모니터링 정보, 상기 임상 환자에게 처방된 의 약품 정보 및 임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집할 수 있다. 컴퓨팅 장치는 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자에 대한 경과를 예측할 수 있다. 그리고, 컴퓨팅 장치는 임상 환자에 대한 경과에 대응하여 선천적 질환과 관련하여 발생 가능한 사고 유형 을 예측할 수 있다. 컴퓨팅 장치는 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증상 예측 모델을 생성할 수 있다. ② 환자 상담 방법 컴퓨팅 장치는 타겟 환자의 정보를 분석하여 타겟 환자에게 심각한 증상 변화가 발생할 확률을 예측 함으로써 상황에 적절한 상담 내용을 도출 및 제공할 수 있다. 또한, 컴퓨팅 장치는 사안의 경중에 따라 적절한 시간에 의료진에게 상담 내용을 알려 후속 조치를 함으로써, 원격 측정 (Tele-monitoring)의 쌍방 향성 소통의 매개자 역할을 수행할 수 있다. 컴퓨팅 장치는 타겟 환자를 모니터링하는 과정에서 외래 방문 또는, 응급실 방문이 필요한 사항을 판 단할 수 있다. 자세하게, 컴퓨팅 장치는 타겟 환자의 상태에 다른 증상 변화가 발생하였을 때를 감 지할 수 있다. 증상 변화는 산소포화도, 체중, 섭취량, 심박동수, 발열, 설사 유무 및 호흡 양상 변화 등을 포 함할 수 있다. ① 산소포화도 컴퓨팅 장치는 타겟 환자의 정보에 따른 산소포화도가 70% 미만이거나 기존 산소포화도 보다 급격히 저하된 경우를 감지할 수 있다. 일례로, 타겟 환자가 신생아인 경우, 신생아의 정상 심박동수는 분당 120회 ~180회 해당하며, 컴퓨팅 장치는 신생아의 심박동수가 모니터링 상에 100회 미만인 경우를 감지함으로써, 타겟 환자의 증상 변화를 판단할 수 있다. 또한, 컴퓨팅 장치는 산호포화도가 90%를 초과하는 경우를 감지하여 타겟 환자가 저 산소증으로 인한 무호흡 상태로의 증상 변화를 판단할 수 있다. ② 체중 컴퓨팅 장치는 1일 동안 타겟 환자의 체중이 30g 이상 감소하고, 다음날도 30g 이상 감지하는 경우를 감지하여 타겟 환자의 증상 변화를 판단할 수 있다.③ 섭취량 컴퓨팅 장치는 24시간 동안 타겟 환자의 체중 당 100 ㎖ 미만으로 섭취하는 경우를 감지할 수 있다. 일례로, 체중이 3kg 인 신생아는 하루 최소 3 * 100 ㎖ = 300 ㎖를 섭취해야 한다. 단, 보호자는 신생아가 배 고픔이 아닌 이유로 보챔이 증가 할 시 추가적인 수유를 수행하지 않고, 즉시 응급실에 상황을 전달해야 한다. ④ 발열 컴퓨팅 장치는 타겟 환자의 체온이 38 ℃ 이상인지 여부에 따른 발열 상태를 확인할 수 있다. 컴퓨 팅 장치는 38℃ 이상이면, 타겟 환자의 증상 변화를 판단할 수 있다. 일례로, 컴퓨팅 장치는 타겟 환자의 체온에 있어, 실시간으로 모니터링하여 발열 상태를 확인하거나 또는, 타겟 환자에게 발열이 발생한 경우, 보호자 또는, 의료진에 의해 측정된 결과를 입력 받음으로써, 발열 상태를 확인할 수 있다. ⑤ 호흡 양상 또는, 상처 여부 컴퓨팅 장치는 분당 60회 이상의 호흡수 증가, 흉부 항목 및 보챔 증가 여부 또는, 수술 부위 발적이 있거 나 고름이 보이는지 여부를 확인할 수 있다. 컴퓨팅 장치는 타겟 환자의 호흡 양상에 따른 증상 변 화를 판단할 수 있다. 또한, 컴퓨팅 장치는 연락 할 증상을 제외하고, 보호자가 불안하여 의료인과 상담을 원할 때, 타겟 환자 의 위험을 알릴 수 있다. 이후, 컴퓨팅 장치는 보호자 측면에서 의료진과의 신뢰 증가로 인한 만족감 증대 및 불안 감소 시킬 수 있도록 보호자와 의료진 간에 상담을 유도할 수 있다. 또한, 본 발명의 은 보호자가 소지한 사용자 단말에 설치된 앱을 통해 타겟 환자의 정보 및 웨어러블 장치에서 센싱된 정보를 의료진에 전달 가능함에 따라 보호자와 의료진 간의 보다 신속한 접근에 용이할 수 있다. 여기서, 웨어러블 장치는 타겟 환자의 신체에 장착이 가능한 산소 포화도 측정 기기일 수 있으며, 타 겟 환자의 발가락, 발바닥, 손등, 가슴에 장착 가능할 수 있다. 웨어러블 장치는 도 8의 (a) 또는, (b) 같은 형태로 구현될 수 있다. 사용자 단말에 설치된 앱은 웨어러블 장치로부터 측정된 타겟 환자의 정보를 시각화할 수 있다. 여기서, 사용자 단말은 타겟 환자의 정보를 시각화하는 목적에 따라 상이한 인터페이스로 구성될 수 있다. 여기서, 보호자가 소지한 사용자 단말을 통해 제공되는 인터페이스는 도 9과 같이 나타낼 수 있다. 도 9 에 도시된 인터페이스는 타겟 환자의 정보에 따른 산소포화도, 맥박수, 심박수, 섭취량, 체중/변화량 등이 시각화될 수 있다. 또한, 의료진이 소지한 사용자 단말을 통해 제공되는 인터페이스는 도 10과 같이 나타낼 수 있다. 의료진 이 소지한 사용자 단말은 의료 기관에서 사용되는 의료 기기와 블루투스로 연결된 상태일 수 있으며, 도 10에 도시된 인터페이스는 의료진이 소지한 사용자 단말에 연결된 의료 기기와의 연결 상태, 의료 기기의 버전, 현재 시간, 배터리 등의 정보가 시각화 될 수 있다. 또한, 도 10에 도시된 인터페이스는 의료 기기의 특 성 상태, 타겟 환자의 산소포화도, 맥박, 체온, 타겟 환자의 신체에 장착되어 신호 분석을 수행한 시 간 등의 정보가 시각화 될 수 있다. 본 발명은 의료진 측면에서 고위험군에 해당되는 타겟 환자의 추적 관찰을 통한 문제점의 발견이 용 이하며, 보호자에게 타겟 환자와 관련된 의료 정보를 실시간으로 제공할 수 있다. 본 발명은 보호자 와 의료진 간 상호 협의된 앱(홈 모니터링 프로그램)을 통해 의사 소통이 이루어짐에 따라 불필요한 전화 상담 및 자료수집 등의 업무 감소시킬 수 있다. 또한, 본 발명은 축적된 학습 데이터를 통해 불량한 예후 에 대한 위험인자를 보다 정확하게 추출할 수 있다. 결국, 본 발명은 사회적 측면에서 앱을 통한 모니터링 프로그램과 함께 선천성 심장병 환아를 위한 원격간호가 시간과 장소의 제약 없이 다양하게 활용할 수 있다. 본 발명은 언택트 시대의 고위험 환자의 원격 모니터링 프 로그램으로서 적합할 수 있다. 도 2는 본 발명의 일실시예에 따른 딥 러닝을 기반으로 임상 환자의 학습 데이터를 조합 및 분석의 학습 결과를 포함하는 증상 예측 모델을 생성하는 과정을 설명하기 위해 도시한 도면이다.도 2를 참고하면, 컴퓨팅 장치는 프로세서를 포함할 수 있으며, 프로세서는, 선천적 질환을 가진 임상 환 자의 치료 과정 또는, 치료 내역을 포함하는 학습 데이터를 이용하여 동일한 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증상 예측 모델을 생성할 수 있다. 이를 위해, 프로세서는 일련의 과정을 수행할 수 있 으며, 이는 다음과 같다. S1에서 프로세서는 임상 환자의 학습 데이터를 수집할 수 있다. 컴퓨팅 장치는 데이터 베이스와 연동할 수 있으며, 데이터 베이스는 선천적 질환을 가진 임상 환자의 학습 데이터를 저장 및 보관할 수 있 다. 컴퓨팅 장치는 데이터 베이스에 저장된 임상 환자의 학습 데이터 내 과거에 위해 사건 또는, 적 신호 사건이 발생한 기록이 있는 임상 환자의 학습 데이터를 수집할 수 있다. 이는 선천적 질환과 관련하 여 위해 사건 또는, 적신호 사건을 중심으로 임상 환자들의 경과로부터 AI 기반의 딥 러닝을 통해 학습 수행하 기 위함 일 수 있다. 임상 환자의 학습 데이터는 임상 환자의 위급 상황을 특정 및 판단할 수 있는 환자 변수를 포함할 수 있다. 환 자 변수는 의료진, 환자 인적 정보, 신체 계측, 병명, 과거 수술력, 식이 정보, 홈 모니터링 그룹, 타 장기 시 스템 증상 및 징후를 포함할 수 있다. 이는 다음의 표 1과 같이 나타낼 수 있다. 표 1"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "환자 변수 내용 의료진 Surgeon, Cardiologist, Home monitoring 담당자 환자 인적 정보 - 성별, 쌍생아, 형제 / 자매, 모(母)의 출산력 신체 계측 - 출생 체중 (kg, percentile), 현재 체중, 성장 곡선 병명 - 환자의 진단 그룹, 진단명, 단심실 교정군 / 양심실 교정군, 해당 진단 명 수술 성적 과거 수술력 - 수술 날짜, 수술 나이, 수술명, 수술 종류 (고식적 / 교정적), 집도의, 소아 심장의, 수술 후 경과(ventilaroty time; 인공호흡기 적용시간, ICU stay: 중환자실 재원기간, Hospital stay: 총입원기간, ECMO: 인공 심폐기) 식이 정보 - 이유식 유무, 치료식(MCT, Medium Chain Triglyceride), 식이 양상의 변화, 식이량 변화 홈 모니터링 그룹- Preop-ToF(수술전 활로4징 / Preop-Tetralogy of Fallot), Post-shunt FSV(단락술 후 기능적단심실환아 / Post-shunt Functional Single Ventricles), Post-shunt-BVR(단락술 후 양심실환아 / Post-shunt- Biventricular Repair), Post-repair(교정수술 후) 타 장기 시스템 증상 및 징후- 호흡기계, 소화기계, 탈수, 신경계, 비뇨기계- 증상 시작 시점, 주변 병원 방문력 S2에서 프로세서는 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자에 대한 경과를 예측할 수 있다. 프로세서는 임상 환자의 학습 데이터로부터 임상 환자의 산소 포화도, 체중 변화, 체온, 호흡기 증상, 의약품의 경구 섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나의 관찰 증상을 분석할 수 있다.프로세서는 임상 환자의 학습 데이터로부터 임상 환자의 산소 포화도, 체중 변화, 체온, 호흡기 증상, 의약품 또는, 음식물(모유/분유/이유식 등)의 경구 섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나 의 관찰 증상을 분석할 수 있다. 프로세서는 임상 환자로부터 관찰 증상이 결정되면, 관찰 증상이 발현된 제1 시점으로부터의 관찰 증상의 지속 시간을 확인할 수 있다. 프로세서는 관찰 증상으로 인한 의료 기관에서의 상 담 횟수를 판단할 수 있다. 여기서, 관찰 증상의 지속 시간 및 상담 횟수는 임상 환자의 보호자로부터 입력된 입력 정보 또는, 임상 환자의 진료 정보 중 적어도 하나에 기초하여 판단될 수 있다. 프로세서는 임상 환자의 학습 데이터에 포함된 진료 정보를 기반으로 임상 환자에게 기 발현된 관찰 증상 외에 추가적으로 발현된 동반 증상을 분석할 수 있다. 프로세서는 임상 환자에게 발현된 관찰 증상을 분석함에 있어, 단일의 관찰 증상 뿐만 아니라, 복합의 관찰 증 상을 추가적으로 확인함으로써, 선천적 질환과 관련된 다양한 케이스로의 분석이 가능할 수 있다. 일례로, 프 로세서는 임상 환자의 학습 데이터를 기반으로 임상 환자의 산소 포화도가 기 설정된 정상 산소 수치의 허용 범 위에 포함되지 않는 관찰 증상을 확인할 수 있다. 프로세서는 산소 포화도에 대한 관찰 증상으로부터 호흡 곤 란에 관한 동반 증상을 추가적으로 확인할 수 있다. 프로세서는 관찰 증상 또는, 동반 증상을 확인한 이후, 해당 증상이 발현된 원인으로써, 임상 환자의 예방 접종 여부, 의약품 변경 여부, 바이러스 감염 여부를 확인할 수 있다. 프로세서는 관찰 증상과 관련하여 상기 임상 환자가 선천적 질환으로 복용 중인 의약품이 존재하는지 여부를 확인할 수 있다. 이때, 프로세서는 의료 기관 과 연동하여 의약품과 관련된 정보를 확인할 수 있다. 이후, 프로세서는 지속 시간 및 상담 횟수에 비례하여 임상 환자에 대한 경과를 예측할 수 있다. 또한, 프로세 서는 증상 이벤트의 종류 및 복용 중인 의약품의 종류를 고려하여 상기 임상 환자에 대한 경과를 예측할 수 있 다. 자세하게, 프로세서는 임상 환자의 학습 데이터를 분석하여 도출된 관찰 증상 또는, 동반 증상에 대응하여 부정 적 경과 또는, 긍정적 경과 중 하나의 경과를 예측할 수 있다. 부정적 경과는 임상 환자의 사망 또는, 외과적 수술에 관한 의사를 포함하는 결과이고, 긍정적 경과는 임상 환자의 회복, 유지, 치유에 관한 의사를 포함하는 결과일 수 있다. 결국, 프로세서는 임상 환자의 학습 데이터에 대한 조합 및 분석을 통해 임상 환자에게 발현된 관찰 증상 또는, 동반 증상에 대응하여 임상 환자에게 나타나는 병세의 진행에 관한 경과를 예측할 수 있다. 프로세서는 지속 시간 및 상담 횟수에 비례하여 경과를 예측하는 구성에 있어, 아래의 표 2와 같이 경우의 수를 고려하여 다양한 케이스로 임상 환자의 경과를 예측할 수 있다. 표 2"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "지속 시간 상담 횟수 경과 관찰 증상 또는, 동반 증상길다(↑) 높다(↑) 부정적 경과 길다(↑) 낮다(↓) 부정적 경과 짧다(↓) 높다(↑) 긍정적 경과 짧다(↓) 낮다(↓) 긍정적 경과 여기서, 프로세서는 지속 시간에 있어, 초 단위, 분 단위, 시 단위로 관찰 시간을 구분하고, 임상 환자에게 발 현된 관찰 증상 또는, 동반 증상의 지속 여부를 세분화할 수 있다. 이에, 본 발명은 선천적 질환을 가진 타겟 환자의 증상의 발현에 따른 피해를 최소화하며, 예후에 대한 판단의 정확도를 향상시킬 수 있다.또한, 프로세서 는 증상 이벤트의 종류 및 복용 중인 의약품의 종류에 따른 역동적인 상호 관련성을 고려하여 다각적이며, 종합 적으로 임상 환자의 경과를 예측할 수 있다. 프로세서는 증상 이벤트의 종류 및 복용 중인 의약품의 종류 간의 상호 관련성에 따른 다양한 케이스로 임상 환자의 경과를 예측할 수 있다. S3에서 프로세서는 임상 환자에 대한 경과에 대응하여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측할 수 있다. 자세하게, 프로세서는 임상 환자의 학습 데이터를 분석하여 임상 환자의 관찰 증상에 따른 부 정적 경과 또는, 긍정적 경과로 예측할 수 있다. 이때, 부정적 경과 또는, 긍정적 경과는 임상 환자에게 발현 된 관찰 증상에 대한 경향성을 2 가지의 분류로 분류한 결과일 수 있다. 프로세서는 예측된 경과로부터 임상 환자에게 발생 가능한 사고 유형에 따른 레벨을 설정할 수 있다. 이는 아래의 표 3과 같이 나타낼 수 있다.표 3"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "경과 레벨 사고 유형 정의 긍정적 경 과1 무해 사건 증상 발현 O, 환자 무해 O 2 위해 사건 증상 발현 O, 환자 손상 X, 관찰 O 부정적 경 과3 위해 사건 일시적 손상 발생 O, 내과적/외과적 치료 O 4 적신호 사건 수술 또는, 중환자실 O 5 적신호 사건 영구적 손상/환자 사망 프로세서는 AI 기반의 딥 러닝을 통해 학습 수행하기 위함으로써, 선천적 질환과 관련하여 위해 사건 또는, 적 신호 사건을 중심으로 임상 환자들의 경과로부터 각 레벨에 따른 사고 유형을 설정할 수 있다.S4에서 프로 세서는 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하 기 위한 증상 예측 모델을 생성할 수 있다. 여기서, 증상 예측 모델은 임상 환자의 학습 데이터(빅 데이터), 인공 지능(AI)의 심층 학습(딥러닝) 기술을 기반으로 타겟 환자마다 개인차로 인한 선천적 질환에 대한 예후를 예측하기 위한 모델일 수 있다. 프로세서는 보다 객관적인 판단 기준을 통해 선천적 질환을 가진 타겟 환자에 발생 가능한 사고 유형을 예측하고, 이에, 적절한 후속 조치를 보호자에게 제공하기 위한 증상 예측 모델을 생 성할 수 있다. 도 3은 본 발명의 일실시예에 따른 증상 예측 모델을 생성하는 세부적인 동작을 설명하기 위해 도시한 플로우 차트이다. 단계에서 컴퓨팅 장치는 AI 기반의 객관적인 상담을 진행하기 위해 임상 환자의 개인 정보, 임상 환자의 모니터링 정보, 임상 환자에게 처방된 의약품 정보 및 임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집할 수 있다. ① 개인 정보는 임상 환자의 개인 식별 정보를 포함하여, 선천적 질환이 임상 환자로부터 발견된 시점의 의료 상황, 선천적 질환에 관한 전문의 소견, 임상 환자를 출산한 산모의 임신 나이 등을 포함할 수 있다. 일례로, 개인 정보는 임상 환자의 생년월일, 성별, 형제/자매 유무, 출생 시 체중(gm), 임신 나이(Gestational age), 비 심장성 이상(Noncardiac anomaly), 이상 소견, 산전 진단(Prenatal diagnosis), 산후 진단(Postnatal diagnosis), 기능적 단심실, 담당 외과 의사(Surgon), 심장병 전문의(Cardiologis), 홈 모니터링 프로그램 유 무, CNS(중추 신경), 수술 전 에코 데이터(Pre-operative Echo data), 수술 전 CT 데이터(Pre-operative CT data), 션트 나이(Shunt age), Shunt of whch PA, 분로 크기, 션트 크기, 개흉술(Thoracotomy), 션트 클리핑 또는, 밴딩(Shunt clipping or banding), PDA 결찰(PDA ligation), PA 혈관 성형술(PA angioplasty), 심폐우회 술(CPB: Cardiopulmonary bypass), 심폐우회술 시간, ACC 시간, OP wt.(gm), OP BSA, 수술전 인공 호흡기 여 부(Pre-operative ventilator) 등을 포함할 수 있다. ② 모니터링 정보는 선천적 질환의 특징에 따른 활력 징후를 파악하기 위해 임상 환자에게 부착된 웨어러블 장 치로부터 센싱된 정보를 포함할 수 있다. 일례로, 모니터링 정보는 임상 환자에 관한 산소포화도, 심박동수, 체온 등을 포함할 수 있다. ③ 의약품 정보는 선천적 질환에 대한 전문의로부터 임상 환자에게 내복, 주사, 도포 중 적어도 하나의 목적으 로 처방된 의약품 및 의약품에 관한 일자 별 투약 내역을 포함할 수 있다. 일례로, 의약품 정보는 이뇨제 (Diuretics), 베타 차단제(Beta blocker), ACE 억제제(Angiotensin Converting Enzyme inhibitor), 차단제(Ca- channel blocker), 강심제(Inotropes) 등의 종류를 포함할 수 있다. ④ 진료 정보는 임상 환자가 가진 선천적 질환과 관련된 과거 병력 또는, 수술 및 시술이력, 투약, 임상 환자의 가족력 등을 포함할 수 있다.이에, 컴퓨팅 장치는 선천적 질환을 가진 임상 환자로부터 센싱된 모니터링 정보, 임상 환자에게 처방된 의약품 정보 및 임상 환자에게 조치된 진료 정보를 포함하는 임상 환자의 학습 데이터를 수집할 수 있다. 단계에서 컴퓨팅 장치는 보호자가 소지한 사용자 단말로부터 보호자에 의해 작성된 홈 관리 정보를 수집할 수 있다. 홈 관리 정보는 임상 환자에 관한 최고 및 최저 산소포화도, 최고 및 최저 심박동수, 1일 섭취량, 투 여된 약물의 용량, 복용한 약물의 종류, 소변량, 대변량, 체중, 구토 여부 등을 포함할 수 있다. 단계에서 컴퓨팅 장치는 임상 환자에게 발현된 선전적 질환의 특징에 따른 주의를 요하는 상황에 대응하는 증상이 존재하는지 여부를 확인할 수 있다. 다시 말해, 컴퓨팅 장치는 선전적 질환의 특징에 따라 임상 환자의 신체적 또는, 기능적으로 장애 또는, 해로운 효과로 발생 가능한 증상이 임상 환자에게 발생하였는지 여부를 확 인할 수 있다. 일례로, 컴퓨팅 장치는 선천성 심장병을 가진 임상 환자의 경우, 호흡 불안, 발열 등의 주의를 요하는 증상이 존재하는지 여부를 확인할 수 있다. 이는 보호자의 홈 모니터링 교육 시 '주의를 요하는 상황 (병원에 전화를 해야 하는 상황)'으로 설명들은 증상과 동일할 수 있다. 증상이 존재하지 않는 경우(NO), 단계에서 컴퓨팅 장치는 임상 환자에 대한 경과에 대응하여 무해 사건으 로 예측할 수 있다. 증상이 존재하는 경우(YES), 단계에서 컴퓨팅 장치는 임상 환자에게 발현된 하나 이상의 관찰 증상을 파악 할 수 있다. 자세하게, 컴퓨팅 장치는 임상 환자의 산소 포화도, 체중 감소 여부, 경구 섭취된 의약품의 용량, 온도, 호흡기 증상, 경구 섭취된 의약품에 의한 과민도, 외과적 문제 등으로 선천적 질환의 특징에 따른 주요 관리되어야 하는 관찰 증상을 분류할 수 있다. 이는 선천적 질환을 가진 임상 환자의 개월수 별, 수술 진행 단 계별 등에 따라 서로 다른 기준에 적용하고, 임상 환자에게 발현된 증상으로부터 적합한 관찰 증상을 체크할 수 있다. 단계에서 컴퓨팅 장치는 관찰 증상이 체크되면, 관찰 증상이 발현된 제1 시점으로부터의 지속 시간을 확인 할 수 있다. 컴퓨팅 장치는 관찰 증상과 관찰 증상으로부터 파생되는 경과 간의 긴밀도를 판단하기 위해 초 단 위, 분 단위, 시 단위로 관찰 증상의 지속 시간을 확인할 수 있다. 단계에서 컴퓨팅 장치는 관찰 증상으로 인한 의료 기관에서의 상담 횟수를 판단할 수 있다. 이는 관찰 증 상의 발생 빈도와 관찰 증상에 대한 위험 정도를 파악하기 위함 일 수 있다. 단계에서 컴퓨팅 장치는 임상 환자에게 기 발현된 관찰 증상 외에 추가적으로 발현된 동반 증상을 분석할 수 있다. 이는 선천적 질환과 관련하여 심각한 문제를 유발하지 않지만, 임상 환자에게 발현된 증세일 수 있다. 동반 증상이 존재하는 경우(YES), 컴퓨팅 장치는 단계로 회귀되어 임상 환자에게 나타난 동반 증상을 체크 할 수 있다. 동반 증상이 존재하지 않는 경우(NO), 단계에서 컴퓨팅 장치는 관찰 증상이 발현된 제1 시점의 이전 시점 으로 제2 시점에서의 선천적 질환과 관련된 진료 외 다른 진료를 받은 경험이 존재하는지 여부를 확인할 수 있 다. 다시 말해, 컴퓨팅 장치는 관찰 증상이 발현되기 1주일 이내에 시행된 임상 환자의 예방 접종 여부, 의약 품 변경 여부, 바이러스 감염 여부 중 적어도 하나의 증상 이벤트가 발생하였는지 여부를 확인할 수 있다. 증상 이벤트가 발생된 경우(YES), 컴퓨팅 장치는 증상 이벤트에 있어, 백신 접종, 약물 변경, 감염, 위장 문제, 기타 등으로 임상 환자에게 발생된 증상 이벤트의 세부 항목을 확인할 수 있다. 증상 이벤트가 발생되지 않은 경우(NO) 또는, 증상 이벤트의 세부 항목을 확인한 이후, 단계에서 컴퓨팅 장치는 관찰 증상과 관련하여 임상 환자가 선천적 질환으로 복용 중인 의약품이 존재하는지 여부를 확인할 수 있다. 복용 중인 의약품이 존재하는 경우(YES), 컴퓨팅 장치는 선천적 질환의 치료와 관련된 이뇨제, 억제제, 메타 차 단제, 채널 차단제, 강심제 중에서 임상 환자가 복용 중인 의약품을 확인할 수 있다. 복용 중인 의약품이 존재하지 않는 경우(NO), 단계에서 컴퓨팅 장치는 위의 각 단계에서 확인된 모든 경우 의 수를 조합 및 분석하여 선천적 질환을 가진 임상 환자의 개월수 별, 수술 진행 단계별, 수술 난이도별로 구 분하여 각각의 케이스에 따른 증상 예측 모델을 생성할 수 있다.도 4는 본 발명의 일실시예에 따른 증상 예측 모델을 이용하여 타겟 환자의 질환 증상에 대한 경과를 예측하는 과정을 설명하기 위해 도시한 도면이다. 도 4를 참고하면, 컴퓨팅 장치는 프로세서를 포함할 수 있으며, 프로세서는, 증상 예측 모델에 따른 선천 적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석하여 타겟 환자의 질환 증상에 따른 후속 조치를 유 도하기 위한 상담 정보를 제공할 수 있다. S1에서 프로세서는 선천적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석하여 타겟 환자의 질환 증상을 판단할 수 있다. 프로세서는 임상 환자에게 부착된 웨어러블 장치로부터 센싱된 모니터링 정보, 타겟 환자의 보호자에 의해 섭취된 의약품 및 타겟 환자의 진료 정보 중 적어도 하나를 포함하는 타겟 환자의 상태 데이터를 수집할 수 있다. 컴퓨팅 장치는 타겟 환자의 상태 데이터로부터 현재 타겟 환자에게 발현된 질환 증 상을 판단할 수 있다. 컴퓨팅 장치는 타겟 환자의 상태 데이터를 분석하여 타겟 환자의 산소 포화도, 체중 변 화, 체온, 호흡기 증상, 의약품의 경구 섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나에 대한 타겟 환자 의 질환 증상을 판단할 수 있다. S2에서 프로세서는 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하 여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측할 수 있다. 여기서, 증상 예측 모델은 딥러닝 기반 의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자의 사망에 관한 부정적 경과 또는, 임상 환자의 회복, 유지에 관한 긍정적 경과 중 하나의 경과를 예측한 결과로, 선천적 질환을 가진 타겟 환자의 증상 을 판단하기 위해 생성된 모델일 수 있다. 프로세서는 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 타겟 환자 의 질환 증상에 대한 경과를 예측할 수 있다. 프로세서는 예측된 경과에 따른 선천적 질환과 관련하여 타겟 환 자에게 발생 가능한 사고 유형을 예측할 수 있다. 프로세서는 예측된 경과에 대한 경중을 고려하여 타겟 환자 에게 발생 가능한 사고 유형을 예측할 수 있다. 여기서, 경과에 대한 경중은 타겟 환자에게 발현된 질환 증상 으로 인한 신체 기능이나 구조의 장애 또는, 이로부터 발생한 모든 해로운 효과로 발생될 확률을 의미할 수 있 다. 일례로, 경과에 대한 경중이 낮다는 것은 타겟 환자에게 질환 증상이 발현되었으나, 타겟 환자에게 무해하거나, 손상이 발생하지 않는 것을 의미할 수 있다. 반대로 경과에 대한 경중이 높다는 것은 타겟 환자에게 발현된 질 환 증상으로 인해 내과적/외과적 치료가 요구되거나, 수술 또는, 중환자실 방문, 크게는 영구적 손상으로 이어 지는 경우를 의미할 수 있다. S3에서 프로세서는 타겟 환자에 발생 가능한 사고 유형을 구성하는 무해 사건, 위해 사건 및 적신호 사건 중 하나에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 의료 가이드 라인을 포함하는 상담 정보를 사 용자 단말에 전달할 수 있다. 의료 가이드 라인을 포함하는 상담 정보를 다음의 표 4와 같이 정의될 수 있다. 표 4"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "경과 레벨 사고 유형 의료 가이드 라인 긍정적 경 과1 무해 사건 정규 시간 CNS 상담 2 위해 사건 CNS 상담 및 조기 외래 방문 필요 부정적 경 과3 위해 사건 수술 병원 응급실 방문 필요 4 적신호 사건 담당 주치의 또는 의료진과의 연락 필요 5 적신호 사건 119 연락 필요 및 소아 심장 거점 병원 이동 도 5는 본 발명의 일실시예에 따른 AI 상담을 통해 타겟 환자의 현재 상태에 관한 조언을 포함하는 상담 내용을 전달하는 동작을 설명하기 위해 도시한 플로우 차트이다. 단계에서 컴퓨팅 장치는 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이 용하여 타겟 환자를 대상으로 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측할 수 있다. 컴퓨팅 장치 는 타겟 환자의 현재 상태에 관한 확률을 판단할 수 있다. 여기서, 확률은 타겟 환자의 현재 상태가 좋지 않은 것에 대한 가능성을 나타낸 것일 수 있다. 증상 예측 모델은 타겟 환자에 대한 경과가 좋지 않을수록 높은 확 률로 나타날 수 있다. 자세하게, 컴퓨팅 장치는 도 2의 표 3를 참고하여 타겟 환자에 대한 경과가 긍정적 경과인지 또는, 부정적 경과 인지를 구분할 수 있다. 컴퓨팅 장치는 임상 예측된 경과로부터 타겟 환자에게 발생 가능한 레벨에 따른 사고 유형을 예측할 수 있다. 컴퓨팅 장치는 사고 유형에 따른 타겟 환자에 대한 후속 조치를 유도하기 위한 의료 가이드 라인을 포함하는 상담 정보를 사용자 단말에 전달할 수 있다. 단계에서 컴퓨팅 장치는 타겟 환자에게 발현된 질환 증상에 따른 부정적 경과에 대응하여 '영구적 손상/환 자 사망'으로의 발생 가능한 사고 유형을 예측할 수 있다. 이에, 컴퓨팅 장치는 해당 타겟 환자의 사고 유형을 적신호 사건으로 설정하고, '119 연락 필요 및 소아 심장 거점 병원 이동'에 관한 의료 가이드 라인을 포함하는 상담 정보를 사용자 단말에 전달할 수 있다. 단계에서 컴퓨팅 장치는 타겟 환자에게 발현된 질환 증상에 따른 부정적 경과에 대응하여 '수술 또는, 중 환자실 O'으로의 발생 가능한 사고 유형을 예측할 수 있다 이에, 컴퓨팅 장치는 해당 타겟 환자의 사고 유형을 적신호 사건으로 설정하고, '담당 주치의 또는 의료진과의 연락 필요'에 관한 의료 가이드 라인을 포함하는 상 담 정보를 사용자 단말에 전달할 수 있다. 단계에서 컴퓨팅 장치는 타겟 환자에게 발현된 질환 증상에 따른 부정적 경과에 대응하여 '일시적 손상 발 생 O, 내과적/외과적 치료 O'으로의 발생 가능한 사고 유형을 예측할 수 있다 이에, 컴퓨팅 장치는 해당 타겟 환자의 사고 유형을 적신호 사건으로 설정하고, '수술 병원 응급실 방문 필요'에 관한 의료 가이드 라인을 포함 하는 상담 정보를 사용자 단말에 전달할 수 있다. 단계에서 컴퓨팅 장치는 타겟 환자에게 발현된 질환 증상에 따른 긍정적 경과에 대응하여 '증상 발현 O, 환자 손상 X, 관찰 O'으로의 발생 가능한 사고 유형을 예측할 수 있다 이에, 컴퓨팅 장치는 해당 타겟 환자의 사고 유형을 적신호 사건으로 설정하고, 'CNS 상담 및 조기 외래 방문 필요'에 관한 의료 가이드 라인을 포함하 는 상담 정보를 사용자 단말에 전달할 수 있다. 단계에서 컴퓨팅 장치는 타겟 환자에게 발현된 질환 증상에 따른 긍정적 경과에 대응하여 '증상 발현 O, 환자 무해 O'으로의 발생 가능한 사고 유형을 예측할 수 있다 이에, 컴퓨팅 장치는 해당 타겟 환자의 사고 유 형을 적신호 사건으로 설정하고, '정규 시간 CNS 상담'에 관한 의료 가이드 라인을 포함하는 상담 정보를 사용 자 단말에 전달할 수 있다. 결국, 본 발명은 의료 가이드 라인을 포함하는 상담 정보를 사용자 단말에 전달함으로써, 보호자로 하여금 의료 진과의 신속한 접근을 유도할 수 있다. 이에 따른 본 발명은 의료진과의 신뢰를 증가시켜 의료 행위에 대한 만 족감을 증대시키고, 불의의 사고에 관한 불안감을 해소시킬 수 있다. 일례로, 컴퓨팅 장치는 다음의 표 5와 같은 가상 시나리오를 기반으로 AI 기반의 상담 정보를 판단 및 제공할 수 있다.표 5"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "가상 시나리오 1. 현재 3개월 여아2. 진단: 기능적 단심증, 폐동맥 협착, 방실중격결손, 무비증 3. 재태연력 35 ＋ 2 주의 미숙아 4. 출생 체중 : 2.1kg (5percentile) 5. 출생 당시 산소 포화도 : 80% (이후 모든 산소 포화도 변화 정보는 AI에게 입력) 6. 생후 30일 당시 체중 3.2 kg 인 상태로 RMBT(Right Modified Blalock-Taussing Shunt) Shunt 시행 7. 수술 후 인공호흡기 90시간, 중환자실 7일 체류 8. 수술 후 10일 퇴원 9. 퇴원 약: Aapirin, Captopril (용량 입력) 10. 이틀 전부터 먹는 양이 줄어 하루 800cc → 350cc (매일 수유량 정보 입력) 11. 오늘 3시 이후 열이 나기 시작 12. 오후 10시 seizure를 보이면서 산소포화도 감소 13. 119 불러 응급실 가는 중 심정지 14. 응급실 도착 CPCR (Cardiopulmonary Cerebral Resuscitation) 1시간 후 사망 선고 15. 기타 필요한 정보를 모두 입력하고 AI 가 사망 이틀 전 (혹은 다른 시점에서라도) 상담이 필요했 다면 무슨 질문을 해야 할지? 16. Adverse Outcome을 막을 수 있는 최선의 advice 시점은 언제일까? 17. 그래서 Adverse Outcome을 막을 수 있었을 확률은 얼마일까? 컴퓨팅 장치는 도 5에 표시된 함수(또는, 알고리즘)에 따른 다음의 표 6과 같은 조건으로 결정할 수 있다. 표 6"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "Functionally single ventricle (Tricuspid atresia type 1) - GA 37+2wkg, 2.7kg birth - OP : RMBT 3.5 mm at 10days, 3kg - SaO2: 85% (at 30days)→80% (at 60days)→75% (at 90days)→73% (at 120days)→73% (at 120days) →70% (at 140days, counseling day) - Event 발생 : 141일째 새벽 Vomiting: 1:30 AM, Irritability for 4 hours, SaO2: 65%-70%, Lethargy for 15 minutes from 5:30 AM 컴퓨팅 장치는 표 6으로부터 의료 가이드 라인에 대응하여 타겟 환자에 대한 상담 정보를 사용자 단말에 전달할 수 있다.사용자 단말은 의료 가이드 라인을 통해 전달된 상담 정보를 시각화하여 제공할 수 있다. 도 6은 본 발명의 일실시예에 따른 예측 모델 생성 방법을 설명하기 위해 도시한 도면이다. 단계에서 컴퓨팅 장치는 AI 기반의 객관적인 상담을 진행하기 위해 선천적 질환을 가진 임상 환자의 학습 데이터를 수집할 수 있다. 여기서, 학습 데이터는 임상 환자의 개인 정보, 임상 환자의 모니터링 정보, 임상 환자에게 처방된 의약품 정보 및 임상 환자에게 조치된 진료 정보를 포함할 수 있다. 단계에서 컴퓨팅 장치는 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환 자에 대한 경과를 예측할 수 있다. 컴퓨팅 장치는 임상 환자의 학습 데이터로부터 임상 환자의 산소 포화도, 체 중 변화, 체온, 호흡기 증상, 의약품의 경구 섭취 용량, 의약품에 대한 이상 반응 중 적어도 하나의 관찰 증상 을 분석할 수 있다. 그리고, 컴퓨팅 장치는 임상 환자의 학습 데이터에 포함된 진료 정보를 기반으로 임상 환 자에게 기 발현된 관찰 증상 외에 추가적으로 발현된 동반 증상을 분석할 수 있다. 컴퓨팅 장치는 관찰 증상이 발현된 제1 시점으로부터의 지속 시간 및 관찰 증상으로 인한 의료 기관에서의 상담 횟수를 판단할 수 있다. 이후, 컴퓨팅 장치는 관찰 증상이 발현된 제1 시점의 이전 시점으로 제2 시점에서의 시행된 임상 환자의 예방 접종 여부, 의약품 변경 여부, 바이러스 감염 여부 중 적어도 하나의 증상 이벤트를존재하는지 또는, 관찰 증상과 관련하여 임상 환자가 선천적 질환으로 복용 중인 의약품이 존재하는지 여부를 확인할 수 있다. 컴퓨팅 장치는 증상 이벤트 및 선천적 질환으로 복용 중인 의약품이 존재하지 않는 경우, 컴퓨팅 장치는 판단된 지속 시간 및 상담 횟수에 비례하여 임상 환자에 대한 경과를 예측할 수 있다. 또한, 컴퓨팅 장치는 증상 이벤트 및 선천적 질환으로 복용 중인 의약품이 존재하는 경우, 지속 시간과 상담 횟 수 뿐만 아니라, 증상 이벤트의 종류 및 복용 중인 의약품의 종류를 고려하여 상기 임상 환자에 대한 경과를 예 측할 수 있다. 단계에서 컴퓨팅 장치는 임상 환자에 대한 경과에 대응하여 선천적 질환과 관련하여 발생 가능한 사고 유 형을 예측할 수 있다. 여기서, 사고 유형은 환자가 가지고 있는 질병이 아닌 의학적인 처치에 의하여 발생한 손상에 관한 것으로, 손상의 정도에 따라 발생 가능한 사고 범위를 포함할 수 있다. 이에, 컴퓨팅 장치는 경과 에 따른 선천적 질환과 관련하여 수술 전, 후 과정의 회복 또는 대기 과정에서 발생할 수 있는 각 레벨 별 사고 유형을 예측할 수 있다. 단계에서 컴퓨팅 장치는 사고 유형에 따른 임상 환자의 학습 데이터를 분류하여 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위한 증상 예측 모델을 생성할 수 있다. 도 7은 본 발명의 일실시예에 따른 환자 상담 방법을 설명하기 위해 도시한 도면이다. 단계에서 컴퓨팅 장치는 선천적 질환을 가진 타겟 환자로부터 수집된 상태 데이터를 분석하여 타겟 환자의 질환 증상을 판단할 수 있다. 컴퓨팅 장치는 타겟 환자에게 부착된 웨어러블 장치로부터 센싱된 모니터링 정보, 타겟 환자의 보호자에 의해 섭취된 의약품 및 타겟 환자의 진료 정보 중 적어도 하나를 포함하는 타겟 환 자의 상태 데이터를 수집할 수 있다. 컴퓨팅 장치는 수집한 타겟 환자의 상태 데이터로부터 타겟 환자의 질환 증상을 판단할 수 있다. 단계에서 컴퓨팅 장치는 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이 용하여 선천적 질환과 관련하여 발생 가능한 사고 유형을 예측할 수 있다. 이를 위해, 컴퓨팅 장치는 선천적 질환을 가진 임상 환자의 학습 데이터를 통해 생성된 증상 예측 모델을 이용하여 타겟 환자의 질환 증상에 대한 경과를 예측할 수 있다. 여기서, 증상 예측 모델은 딥러닝 기반의 임상 환자의 학습 데이터를 분석하여 선천적 질환을 가진 임상 환자의 사망에 관한 부정적 경과 또는, 상기 임상 환자의 회복, 유지에 관한 긍정적 경과 중 하나의 경과를 예측한 결과로, 선천적 질환을 가진 타겟 환자의 증상을 판단하기 위해 생성된 모델일 수 있다. 이후, 컴퓨팅 장치는 예측된 경과에 따른 선천적 질환과 관련하여 타겟 환자에게 발생 가능한 사고 유형을 예측 할 수 있다. 컴퓨팅 장치는 예측된 경과에 대한 경중을 고려하여 타겟 환자에게 발생 가능한 사고 유형을 예측 할 수 있다. 단계에서 컴퓨팅 장치는 사고 유형에 대응하여 타겟 환자에 대한 후속 조치를 유도하기 위한 상담 정보를 타겟 환자의 보호자가 소지한 사용자 단말에 전달할 수 있다. 한편, 본 발명에 따른 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성되어 마그네틱 저장매체, 광학적 판 독매체, 디지털 저장매체 등 다양한 기록 매체로도 구현될 수 있다. 본 명세서에 설명된 각종 기술들의 구현들은 디지털 전자 회로조직으로, 또는 컴퓨터 하드웨어, 펌웨어, 소프트 웨어로, 또는 그들의 조합들로 구현될 수 있다. 구현들은 데이터 처리 장치, 예를 들어 프로그램가능 프로세서, 컴퓨터, 또는 다수의 컴퓨터들의 동작에 의한 처리를 위해, 또는 이 동작을 제어하기 위해, 컴퓨터 프로그램 제 품, 즉 정보 캐리어, 예를 들어 기계 판독가능 저장 장치(컴퓨터 판독가능 매체) 또는 전파 신호에서 유형적으 로 구체화된 컴퓨터 프로그램으로서 구현될 수 있다. 상술한 컴퓨터 프로그램(들)과 같은 컴퓨터 프로그램은 컴 파일된 또는 인터프리트된 언어들을 포함하는 임의의 형태의 프로그래밍 언어로 기록될 수 있고, 독립형 프로그 램으로서 또는 모듈, 구성요소, 서브루틴, 또는 컴퓨팅 환경에서의 사용에 적절한 다른 유닛으로서 포함하는 임 의의 형태로 전개될 수 있다. 컴퓨터 프로그램은 하나의 사이트에서 하나의 컴퓨터 또는 다수의 컴퓨터들 상에 서 처리되도록 또는 다수의 사이트들에 걸쳐 분배되고 통신 네트워크에 의해 상호 연결되도록 전개될 수 있다. 컴퓨터 프로그램의 처리에 적절한 프로세서들은 예로서, 범용 및 특수 목적 마이크로프로세서들 둘 다, 및 임의 의 종류의 디지털 컴퓨터의 임의의 하나 이상의 프로세서들을 포함한다. 일반적으로, 프로세서는 판독 전용 메 모리 또는 랜덤 액세스 메모리 또는 둘 다로부터 명령어들 및 데이터를 수신할 것이다. 컴퓨터의 요소들은 명령 어들을 실행하는 적어도 하나의 프로세서 및 명령어들 및 데이터를 저장하는 하나 이상의 메모리 장치들을 포함 할 수 있다. 일반적으로, 컴퓨터는 데이터를 저장하는 하나 이상의 대량 저장 장치들, 예를 들어 자기, 자기-광 디스크들, 또는 광 디스크들을 포함할 수 있거나, 이것들로부터 데이터를 수신하거나 이것들에 데이터를 송신하 거나 또는 양쪽으로 되도록 결합될 수도 있다. 컴퓨터 프로그램 명령어들 및 데이터를 구체화하는데 적절한 정 보 캐리어들은 예로서 반도체 메모리 장치들, 예를 들어, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광 기 록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media), 롬 (ROM, Read Only Memory), 램(RAM, Random Access Memory), 플래시 메모리, EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM) 등을 포함한다. 프로세서 및 메모리는 특수 목적 논리 회로조직에 의해 보충되거나, 이에 포함될 수 있다. 또한, 컴퓨터 판독가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용매체일 수 있고, 컴퓨터 저장매체 및 전송매체를 모두 포함할 수 있다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 마찬가지로, 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시 형태의 다양한 장치 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되어서는 안되며, 설명한 프로그램 컴포넌트와 장치들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거나 다중 소프트웨어 제품에 패키징 될 수 있다는 점을 이해하여야 한다. 한편, 본 명세서와 도면에 개시된 본 발명의 실시 예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으 며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상"}
{"patent_id": "10-2022-0146153", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 자명한 것이다."}
{"patent_id": "10-2022-0146153", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 선천적 질환의 증상에 관한 예측 및 상담을 진행하기 위한 전반적인 시스템 을 설명하기 위해 도시한 도면이다. 도 2는 본 발명의 일실시예에 따른 딥 러닝을 기반으로 임상 환자의 학습 데이터를 조합 및 분석의 학습 결과를 포함하는 증상 예측 모델을 생성하는 과정을 설명하기 위해 도시한 도면이다. 도 3은 본 발명의 일실시예에 따른 증상 예측 모델을 생성하는 세부적인 동작을 설명하기 위해 도시한 플로우 차트이다. 도 4는 본 발명의 일실시예에 따른 증상 예측 모델을 이용하여 타겟 환자의 질환 증상에 대한 경과를 예측하는 과정을 설명하기 위해 도시한 도면이다. 도 5는 본 발명의 일실시예에 따른 AI 상담을 통해 타겟 환자의 현재 상태에 관한 조언을 포함하는 상담 내용을 전달하는 동작을 설명하기 위해 도시한 플로우 차트이다. 도 6은 본 발명의 일실시예에 따른 예측 모델 생성 방법을 설명하기 위해 도시한 도면이다. 도 7은 본 발명의 일실시예에 따른 환자 상담 방법을 설명하기 위해 도시한 도면이다. 도 8은 본 발명의 일실시예에 따른 웨어러블 장치를 도시한 도면이다. 도 9는 본 발명의 일실시예에 따른 보호자가 소지한 사용자 단말을 통해 제공되는 인터페이스를 도시한 도면이 다. 도 10은 본 발명의 일실시예에 따른 의료진이 소지한 사용자 단말을 통해 제공되는 인터페이스를 도시한 도면이다."}
