{"patent_id": "10-2019-0134426", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0050155", "출원번호": "10-2019-0134426", "발명의 명칭": "인공 지능을 활용한 서류 전형 시스템", "출원인": "씨제이올리브네트웍스 주식회사", "발명자": "최윤종"}}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서류 전형 서버가, 지원자가 작성한 문서를 문장 단위로 분리하는 단계;상기 서류 전형 서버가, 상기 문서를 구성하는 복수의 문장 각각의 구문을 분석하는 단계;상기 서류 전형 서버가, 분석한 구문을 기초로 상기 문서의 맥락(Context) 정보를 획득하는 단계;상기 서류 전형 서버가, 상기 지원자가 지원한 직무의 정보와 상기 맥락 정보를 이용하여 상기 복수의 문장 각각의 중요도를 결정하는 단계; 및상기 서류 전형 서버가, 상기 중요도가 결정된 문서 내에서 평가자가 보정한 문장 별 중요도를 학습하는 단계;를 포함하는 인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 문장 단위로 분리하는 단계 이전에,형태소 분석, 개체명 분석 또는 의미역(semantic role) 분석 방식을 이용하여 상기 문서 내 단어 또는 기 저장된 문서 내 단어를 벡터화하는 단계;를 더 포함하는 인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 문장 단위로 분리하는 단계 이전에,상기 기 저장된 문서 내 문장은, 연속된 구문으로 이루어지고,상기 연속된 구문 각각의 핵심을 나타내는 단어를 조합하여, 제 1특성 벡터 형태로 추출하여, 상기 제 1 특성벡터를 기초로 단어-벡터 변환 모델을 생성하는 단계;를 더 포함하는 인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 문장 단위로 분리하는 단계 이전에,상기 기 저장된 문서를 문장 단위로 나누고, 각 문장에서 연속된 구문의 맥락 정보를 제2 특성 벡터 형태로 추출하고, 상기 제2 특성 벡터를 기초로 중요도 예측 모델을 생성하는 단계;를 더 포함하는 인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 중요도 예측 모델을 생성하는 단계는,동일 문장에 대한 상기 평가자의 의견 일치 정도 또는 기 저장된 문서의 서류 전형 평가 점수를 기준으로 상기기 저장된 문서 내에서 각 문장 별 중요도를 결정하고, 결정된 각 문장 별 중요도를 상기 중요도 예측 모델에반영하는 단계;공개특허 10-2021-0050155-3-를 더 포함하는 인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 직무의 정보는, 직무 별로 지정된 핵심 요소를 포함하고,상기 복수의 문장 각각의 중요도를 결정하는 단계는,상기 복수의 문장 각각을 상기 핵심 요소 및 상기 맥락 정보와의 연관성에 따라 중요도 점수를 부여하고, 부여된 중요도 점수에 따라 상기 복수의 문장 각각에서 평가자가 인식할 수 있도록 상기 문서 내에서 해당 문장에강조하는 표시를 지정하는 단계;를 더 포함하는 인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 벡터화하는 단계는,상기 기 저장된 문서를 직무 기준으로 분류하고, 분류된 문서 내에서 출현 빈도수가 기준 값 이상인 단어들을추출하여 유사한 벡터 값을 가지도록 벡터화하는 단계인,인공 지능을 활용한 지원 서류 가이드 방법."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "지원자가 작성한 문서를 문장 단위로 분리하는 문장 분리부;상기 문서 내 단어를 벡터화하는 단어-벡터 변환부;상기 문서를 구성하는 복수의 문장 각각의 구문을 분석하는 구문 분석부;분석한 구문을 기초로 상기 문서의 맥락(Context) 정보를 획득하는 맥락 획득부; 및상기 지원자가 작성한 직무의 정보와 상기 맥락 정보를 이용하여 상기 복수의 문장 각각의 중요도를 결정하고,상기 중요도가 결정된 문서 내에서 평가자가 보정한 문장 별 중요도를 학습하는 문장 중요도 결정부;를 포함하는 서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 단어-벡터 변환부는,형태소 분석, 개체명 분석 또는 의미역(semantic role) 분석 방식을 이용하여 상기 문서 내 단어 또는 기 저장된 문서 내 단어를 벡터화하는,서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 기 저장된 문서 내 문장은, 연속된 구문으로 이루어지고,상기 구문 분석부는,상기 연속된 구문 각각의 핵심을 나타내는 단어를 조합하여, 제1 특성 벡터 형태로 추출하고, 상기 제1 특성 벡터를 기초로 단어-벡터 변환 모델을 생성하는,공개특허 10-2021-0050155-4-서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 맥락 획득부는, 상기 기 저장된 문서를 문장 단위로 나누고, 각 문장에서 연속된 구문의 맥락 정보를 제2특성 벡터 형태로 추출하여, 상기 제2 특성 벡터를 기초로 중요도 예측 모델을 생성하는,서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 문장 중요도 결정부는,동일 문장에 대한 상기 평가자의 의견 일치 정도 또는 기 저장된 문서의 서류 전형 평가 점수를 기준으로 상기기 저장된 문서 내에서 각 문장 별 중요도를 결정하고, 결정된 각 문장 별 중요도를 상기 중요도 예측 모델에반영하는,서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서,상기 직무의 정보는, 직무 별로 지정된 핵심 요소를 포함하고, 상기 문장 중요도 결정부는,상기 복수의 문장 각각을 상기 핵심 요소 및 상기 맥락 정보와의 연관성에 따라 중요도 점수를 부여하고, 부여된 중요도 점수에 따라 상기 복수의 문장 각각에서 평가자가 인식할 수 있도록 상기 문서 내에서 해당 문장에강조하는 표시를 지정하는,서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 단어-벡터 변환부는,상기 기 저장된 문서를 직무 기준으로 분류하고, 분류된 문서 내에서 출현 빈도수가 기준 값 이상인 단어들을추출하여 유사한 벡터 값을 가지도록 벡터화하는,서류 전형 서버."}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 인공 지능을 활용한 지원 서류 가이드 방법은, 서류 전형 서버가, 지원자가 작성한 문서를 문장 단위로 분리하는 단계, 상기 서류 전형 서버가, 상기 문서를 구성하는 복수의 문장 각각의 구문을 분석하는 단계, 상기 서류 전형 서버가, 분석한 구문을 기초로 상기 문서의 맥락(Context) 정보를 획득하는 단계 (뒷면에 계속)"}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 지능을 활용한 서류 전형 시스템에 관한 것으로, 자연어 처리 기술을 이용하여 지원자가 작성한 지원서의 맥락을 판단하고 중요 단어, 문장을 지원서에 표시해줌으로써, 지원서에 대한 평가자의 의사 결정이 빠르게 수행될 수 있도록 하여, 많은 양의 지원서를 평가하기 위해 투입되는 인력 비용을 최소화할 수 있는 서 류 전형 시스템에 관한 것이다."}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 각 회사에서는 정기적인 신입사원 채용을 위해서 적은 인원의 실무자/평가자가 몇 백 건의 지원 서 류를 읽고 점수를 매기는 데에 많은 시간을 소비하게 된다. 그에 따라, 최근 평가자 업무의 효율을 높이기 위해인공지능(Artificial Intelligence, AI)을 활용한 지원 서류 분석 기술이 개시되고 있다. 대표적으로, 언어 처리 분석 기술을 이용하여 지원자의 지원 서류를 분석함으로써, 내용이 기업과 적합한지, 표 절 가능성은 없는지, 기업의 역량 키워드가 존재하는지 등의 방법이 있으나 지원자의 지원 서류에서 표절된 문 장이 존재하는지, 기업 별 특정된 단어가 존재하는지 확인해 주는 기술에 불과하다. 즉, 지원 서류를 통해 지원자가 기업에 적합한 인재인지 판정하기 위해서는 평가자가 직접 지원 서류를 읽고 문 맥을 파악하는 것이 가장 정확한 방법이다고 할 수 있다. 그러나 채용 때마다 동일한 평가자가 검토할 수 없기 때문에, 평가 점수의 일관성이 떨어지는 문제점이 발생하게 된다. 따라서 평가자가 지원 서류를 빠르게 읽고 의사 결정을 내릴 수 있도록 서류 평가를 위한 가이드를 제공할 수 있는 기술의 개발이 요구되며, 본 발명은 이에 관한 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2016-0137135호(2015.05.22.)"}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 지원 서류(이하, 자기 소개서)의 문장 맥락을 이해하고, 중요 문장으 로 판단되는 영역에 강조 표시를 해주어, 평가자의 자기 소개서 판단을 위한 가이드를 제공하는 것을 목적으로 한다. 본 발명이 해결하고자 하는 또 다른 기술적 과제는 자기 소개서에 대한 평가자의 피드백(예. 강조 표시된 문장 외에 평가자가 중요하다고 생각되어 표시한 문장들)을 반영하여, 또 다른 자기 소개서에 대한 가이드를 제공할 때 이를 반영할 수 있는 서류 전형 시스템을 제공하는 것을 목적으로 한다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예에 따른 인공 지능을 활용한 지원 서류 가이드 방법은, 지원자가 작성한 문서를 문장 단위 로 분리하는 단계, 상기 서류 전형 서버가, 상기 문서를 구성하는 복수의 문장 각각의 구문을 분석하는 단계, 상기 서류 전형 서버가, 분석한 구문을 기초로 상기 문서의 맥락(Context) 정보를 획득하는 단계, 상기 서류 전 형 서버가, 상기 지원자가 지원한 직무의 정보와 상기 맥락 정보를 이용하여 상기 복수의 문장 각각의 중요도를 결정하는 단계 및 상기 서류 전형 서버가, 상기 중요도가 결정된 문서 내에서 평가자가 보정한 문장 별 중요도 를 학습하는 단계를 포함한다. 일 실시 예에 따르면, 상기 문장 단위로 분리하는 단계 이전에, 형태소 분석, 개체명 분석 또는 의미역 (semantic role) 분석 방식을 이용하여 상기 문서 내 단어 또는 기 저장된 문서 내 단어를 벡터화하는 단계를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 기 저장된 문서 내 문장은, 연속된 구문으로 이루어지고, 상기 연속된 구문 각각의 핵심을 나타내는 단어를 조합하여, 제 1특성 벡터 형태로 추출하여, 상기 제 1 특성 벡터를 기초로 단어-벡터 변환 모델을 생성하는 단계를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 문장 단위로 분리하는 단계 이전에, 상기 기 저장된 문서를 문장 단위로 나누고, 각 문장에서 연속된 구문의 맥락 정보를 제2 특성 벡터 형태로 추출하고, 상기 제2 특성 벡터를 기초로 중요도 예 측 모델을 생성하는 단계를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 중요도 예측 모델을 생성하는 단계는, 동일 문장에 대한 상기 평가자들의 의견 일치 정도 또는 기 저장된 문서의 서류 전형 평가 점수를 기준으로 상기 기 저장된 문서 내에서 각 문장 별 중요도를결정하고, 결정된 각 문장 별 중요도를 상기 중요도 예측 모델에 반영하는 단계를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 직무의 정보는, 직무 별로 지정된 핵심 요소를 포함하고, 상기 복수의 문장 각각의 중요도를 결정하는 단계는, 상기 복수의 문장 각각을 상기 핵심 요소 및 상기 맥락 정보와의 연관성에 따라 중 요도 점수를 부여하고, 부여된 중요도 점수에 따라 상기 복수의 문장 각각에서 평가자가 인식할 수 있도록 상기 문서 내에서 해당 문장에 강조하는 표시를 지정하는 단계를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 벡터화하는 단계는, 상기 기 저장된 문서를 직무 기준으로 분류하고, 분류된 문서 내에서 출현 빈도수가 기준 값 이상인 단어들을 추출하여 유사한 벡터 값을 가지도록 벡터화하는 단계일 수 있 다. 본 발명의 또 다른 실시 예에 따른 서류 전형 서버는, 지원자가 작성한 문서를 문장 단위로 분리하는 문장 분리 부, 상기 문서 내 단어를 벡터화하는 단어-벡터 변환부, 상기 문서를 구성하는 복수의 문장 각각의 구문을 분석 하는 구문 분석부, 분석한 구문을 기초로 상기 문서의 맥락(Context) 정보를 획득하는 맥락 획득부 및 상기 지 원자가 작성한 직무의 정보와 상기 맥락 정보를 이용하여 상기 복수의 문장 각각의 중요도를 결정하고, 상기 중 요도가 결정된 문서 내에서 평가자가 보정한 문장 별 중요도를 학습하는 문장 중요도 결정부를 포함한다. 일 실시 예에 따르면, 상기 단어-벡터 변환부는, 형태소 분석, 개체명 분석 또는 의미역(semantic role) 분석 방식을 이용하여 상기 문서 내 단어 또는 기 저장된 문서 내 단어를 벡터화할 수 있다. 일 실시 예에 따르면, 상기 기 저장된 문서 내 문장은, 연속된 구문으로 이루어지고, 상기 구문 분석부는, 상기 연속된 구문 각각의 핵심을 나타내는 단어를 조합하여, 제1 특성 벡터 형태로 추출하고, 상기 제1 특성 벡터를 기초로 단어-벡터 변환 모델을 생성할 수 있다. 일 실시 예에 따르면, 상기 맥락 획득부는, 상기 기 저장된 문서를 문장 단위로 나누고, 각 문장에서 연속된 구 문의 맥락 정보를 제2 특성 벡터 형태로 추출하여, 상기 제2 특성 벡터를 기초로 중요도 예측 모델을 생성할 수 있다. 일 실시 예에 따르면, 상기 문장 중요도 결정부는, 동일 문장에 대한 상기 평가자들의 의견 일치 정도 또는 기 저장된 문서의 서류 전형 평가 점수를 기준으로 상기 기 저장된 문서 내에서 각 문장 별 중요도를 결정하고, 결 정된 각 문장 별 중요도를 상기 중요도 예측 모델에 반영할 수 있다. 일 실시 예에 따르면, 상기 직무의 정보는, 직무 별로 지정된 핵심 요소를 포함하고, 상기 문장 중요도 결정부 는, 상기 복수의 문장 각각을 상기 핵심 요소 및 상기 맥락 정보와의 연관성에 따라 중요도 점수를 부여하고, 부여된 중요도 점수에 따라 상기 복수의 문장 각각에서 평가자가 인식할 수 있도록 상기 문서 내에서 해당 문장 에 강조하는 표시를 지정할 수 있다. 일 실시 예에 따르면, 상기 단어-벡터 변환부는, 상기 기 저장된 문서를 직무 기준으로 분류하고, 분류된 문서 내에서 출현 빈도수가 기준 값 이상인 단어들을 추출하여 유사한 벡터 값을 가지도록 벡터화할 수 있다."}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 자기 소개서의 문장 맥락을 이해하고, 중요 문장을 강조 표시한 후, 평가자에게 제공함으로 써, 평가자가 자기 소개서를 읽고 판단을 완료하는 데에 소요되는 시간을 단축시키고 인력 비용을 절감할 수 있 다. 또한, 서류 전형 시스템이 자기 소개서의 중요 문장에 대한 강조 표시만을 제공하며, 이에 대한 합격/불합격을 결정하는 평가자는 이를 참고로만 활용하기 때문에, 채용이 보다 공정하고 효율적으로 진행될 수 있다. 또한, 강조 표시된 문장 외에 평가자가 중요 문장으로 생각하는 문장들을 선택하여 서류 전행 시스템에 피드백 하여, 이 후 자기 소개서 내 중요 문장 선택 시 평가자의 의견이 반영될 수 있으며, 학습 모델에 반영되어 있기 때문에 모든 지원자에게 동일한 평가 기준을 적용할 수 있다."}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해 될 수 있을 것이다."}
{"patent_id": "10-2019-0134426", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리 고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것 이다. 그러나 본 발명은 이하에서 게시되는 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것 은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 본 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는 (comprising)\"은 언급된 구성 요소, 단계 및/또는 동작은 하나 이상의 다른 구성 요소, 단계 및/또는 동작의 존재 또는 추가를 배제하지 않는다. 이하, 본 발명에 대하여 첨부된 도면에 따라 상세히 설명한다. 도 1은 본 발명의 제1 실시 예에 따른 서류 전형 시스템의 구성을 개략적으로 나타낸 도면이고, 도 2는 본 발명의 제2 실시 예에 따른 서류 전형 시스템의 구성을 개략적으로 나타낸 도면이다. 도 1을 참조하면, 서류 전형 시스템은 레거시 시스템(Legacy System)과 인공 지능 시스템(AI System)을 포함할 수 있다. 레거시 시스템(Legacy System)은 신입 사원 채용을 위해 각 회사가 사용 중인 기존 시스템으로 서, 지원자로부터 각종 지원 서류를 제공받아 저장할 수 있으며, 지원 서류에 대한 평가자의 평가를 평가자 단 말를 통해 제공 받을 수 있다. 인공 지능 시스템(AI System)은 수 백 건에 이르는 지원 서류를 평가자가 용이하게 읽고 검토할 수 있도록 가이 드를 제공할 수 있는 시스템으로서, 학습 서버, 서비스 서버 및 서류 전형 모델로 구성될 수 있다. 구체적으로, 학습 서버는 1)채용 서버로부터 기존의 지원 서류 평가 결과를 제공받을 수 있으며, 이를 학습하여 2)지원 서류 가이드를 제공하기 위한 서류 전형 모델을 생성하고 저장할 수 있다. 서비스 서버는 3)학습 서버가 생성한 서류 전형 모델을 인공 지능 엔진에 반영할 수 있으며, 4)채 용 서버로부터 지원 서류를 제공받게 되면 인공 지능 엔진을 활용하여 5)지원 서류에 대한 가이드를 생성 (평가 결과)하여 이를 채용 서버로 제공할 수 있다. 한편, 본 발명은 실시 예에 따라, 학습 서버 및 서비스 서버의 기능을 하나의 서류 전형 서버가 수행할 수도 있으며, 서류 전형 서버를 포함하는 구성은 도 2와 같을 수 있다. 지금까지 본 발명의 제1 및 제2 실시 예에 따른 서류 전형 시스템의 전체 구성에 대해 살펴보았으며, 이 하에서는 평가자가 지원 서류를 읽고 의사 결정을 용이하게 할 수 있도록 지원 서류에 대한 가이드를 제공하는 방법에 대하여 구체적으로 설명하도록 한다. 도 3은 본 발명의 제2 실시 예에 따른 서류 전형 서버의 구성을 개략적으로 나타낸 도면이고, 도 4는 본 발명의 제2 실시 예에 따른 서류 전형 시스템의 구성에서 각 구성 요소들이 수행하는 기능을 설명하기 위한 도면이다. 도 3 및 도 4를 참조하면, 서류 전형 서버는 문장 관리부, 단어-벡터 변환부, 구문 분석부 , 맥락 획득부, 문장 중요도 결정부 및 메모리를 포함할 수 있으며, 기타 본 발명의 목적 을 달성하기 위한 부가적인 구성 역시 포함할 수 있음은 물론이다. 한편, 문장 관리부, 단어-벡터 변환부, 구문 분석부, 맥락 획득부, 문장 중요도 결정부 및 메모리는 본 발명의 일 실시 예에 따른 서류 전형 서버의 기능을 기준으로 분류한 임시 또 는 가상적인 구성일 뿐이며, 어느 한 구성이 수행하는 기능을 다른 구성이 함께 수행할 수 있으며, 하나의 구성 이 전체 구성의 기능을 모두 수행할 수 있음은 물론이다. 예를 들어, 하나의 프로세서(미도시)가 문장 관리부 , 단어-벡터 변환부, 구문 분석부, 맥락 획득부, 문장 중요도 결정부 및 메모리 의 기능을 모두 수행할 수도 있다. 문장 관리부는 지원자가 작성한 지원 서류(이하, '문서'라고 함)를 문장 단위로 분리하여, 문서의 내용을 데이터 처리할 수 있는 형태로 정제할 수 있다. 다만, 문장 관리부는 문서 내 모든 문장을 개별 문장으로 나누기 이전에 문서에 존재하는 항목을 확인하고, 항목 별로 동일한 범주의 문장들을 함께 묶어 둘 수 있다. 예 를 들어, 문장 관리부는 [표 1]과 같이 지원자의 문서를 복수의 문장으로 분리할 수 있다. 표 1 분리 전 이미지 인식 시스템을 개발한 POC 프로젝트 경험이 가장 의미 있다고 생각합니다. 원활한 프로젝트 진행을 위해 가장 중요한 것은 사용자 요구사항을 정확하게 이해해야 합니다. 팀원들과 함께 솔루션 매뉴얼을 분석하고, 개발자를 찾아가 질문을 통해 이해도를 높이고 자 하였습니다. 다각적 사고방식과 효율적인 로직 설계를 통해 완성도 높은 시스템을 개 발하였습니다. 분리 후 문장1) 이미지 인식 시스템을 개발한 POC 프로젝트 경험이 가장 의미 있다고 생각합니다. 문장2) 원활한 프로젝트 진행을 위해 가장 중요한 것은 사용자 요구사항을 정확하게 이해 해야 합니다. 문장3) 팀원들과 함께 솔루션 매뉴얼을 분석하고, 개발자를 찾아가 질문을 통해 이해도를 높이고자 하였습니다. 문장4) 다각적 사고방식과 효율적인 로직 설계를 통해 완성도 높은 시스템을 개발하였습 니다. 단어-벡터 변환부는 기 저장되어 있는 방대한 양의 문서들(평가자들에 의해서 평가가 완료된 문서들) 내 단어를 워드 임베딩 모델(Word-Embedding, 예. Doc2Vec) 통해 벡터로 변환할 수 있다. 예를 들어, 단어-벡터 변 환부는 형태소 분석, 개체명 분석 또는 의미역(semantic role) 방식을 이용하여 각각의 단어를 벡터화할 수 있으며, 형태소 분석의 경우, 의미를 가지는 실질 형태소만을 벡터화할 수 있다. 또한, 단어-벡터 변환부는 문서 내 출현 빈도수가 기준 값 이상인 단어들을 추출하고 이들을 유사한 벡터 값을 가지도록 벡터화할 수 있으며, 이는 추후 단어-벡터 변환 모델을 학습하기 위해 활용될 수 있다. 여기서, 출현 빈도수의 기준 값은 전체 문장 수 대비 각 단어들의 출현 빈도수를 계산하는 방식으로 산정될 수 있다. 한편, 단어-벡터 변환부는 구문 분석부와 맥락 획득부가 추출하는 특성 벡터를 기초로 지원자가 작성한 직무의 정보와 각 단어를 유사한 값을 가지도록 벡터화할 수 있다. 구문 분석부는 문서를 구성하는 복수의 문장 각각의 구문을 분석할 수 있다. 구체적으로, 구문 분석부 는 하나의 문장을 구와 절을 기준으로 분리하거나, 단어 개수를 지정해두고, 이를 여러 개의 구로 취급하 여 분리할 수도 있다. 여기서 구문 분석(Phrase Analysis)이란 긴 문장을 여러 개의 구 또는 절로 분리하여 분 석하는 기법으로, 다양한 자연어 처리 알고리즘과 기계 학습 알고리즘이 이용될 수 있다. 즉, 구문 분석부는 지원자가 작성한 문서에서 중요 단어를 선정하기 위해 메모리에 기 저장되어 있는 평가가 완료된 문서에서 중요 단어를 학습하는 과정을 우선적으로 수행할 수 있다. 이를 위해, 구문 분석부 는 n개의 단어 벡터에서 문장의 중요도 결정에 영향을 끼치는 단어 조합 k개를 CNN(Convolution Neural Network) 방식을 이용하여 특성 벡터 형태로 추출할 수 있다. 다시 말하자면, 구문 분석부는 기 저장된 문서에서 각 문장의 핵심을 나타내는 단어 조합(핵심 문구)을 제 1 특성 벡터 형태로 추출할 수 있으며, 제 1 특성 벡터를 기초로 단어-벡터 변환 모델을 생성할 수 있다. 한편, 중요도 예측 모델은 문서 평가 과정에서 평가자에 의해 지속적으로 업데이트될 수 있다. 이와 같이, 구문 분석부는 문장 내에서 중요 단어들을 합하여 하나의 핵심 문구를 생성할 수 있으며, 예를 들어, [표 1]에서 분리되었던 문장 각각에 [표 2]와 같은 핵심 문구가 생성될 수 있다. 표 2 1번 문장 이미지 인식 시스템을 개발한 POC 프로젝트 경험이 가장 의미있다고 생각합니다. 핵심 문구 이미지 인식 시스템 2번 문장 원활한 프로젝트 진행을 위해 가장 중요한 것은 사용자 요구사항을 정확하게 이해해야 합 니다. 핵심 문구 사용자 요구사항 이해 3번 문장 팀원들과 함께 솔루션 매뉴얼 분석하고, 개발자를 찾아가 질문을 통해 이해도를 높이고자 하였습니다. 핵심 문구 솔루션 매뉴얼 분석 4번 문장 다각적 사고 방식과 효율적 로직 설계를 통해 완성도 높은 시스템을 개발하였습니다. 핵심 문구 효율적 로직 설계 맥락 획득부는 구문 분석부가 분석한 구문을 기초로 문서의 맥락(Context) 정보를 획득할 수 있으며, 이를 위해서 맥락 획득부는 순환 신경망 모델(Recurrent Neural Network, RNN)을 이용할 수 있다. 보다 구체적으로, 맥락 획득부는 핵심 문구를 순서대로 조합하여 맥락을 분석할 수 있는데, 첫번째 핵심 문구를 토대로 두번째 핵심 문구의 맥락을 도출하여, 마지막 핵심 문구를 통해 맥락의 결론을 제시할 수 있다. 예를 들어, 핵심 문구의 순서가 '이미지 인식 시스템'-'사용자 요구사항 이해'-'솔루션 매뉴얼 분석'-'효율적 로직 설계'인 경우, 맥락 획득부는 '시스템 운영 직무 적합도 맥락'이라는 맥락 정보를 획득할 수 있다. 아울러, 맥락 획득부는 연속된 구문(맥락 정보)을 제2 특성 벡터 형태로 추출하고, 제2 특성 벡터를 기초 로 단어-벡터 변환 모델을 생성할 수 있으며, 단어-벡터 변환 모델은 새롭게 수신한 문서 내 단어를 단어 벡터 로 변환하는 과정에서 사용될 수 있다. 문장 중요도 결정부는 지원자가 작성한 직무의 정보와 문서의 맥락 정보를 이용하여 복수의 문장 각각의 중요도를 예측 및 결정할 수 있다. 여기서, 직무의 정보는 직무 별로 지정된 핵심 요소(예. 도전, 긍정, 글로벌 역량)를 포함할 수 있다. 구체적으로, 문장 중요도 결정부는 복수의 문장 각각을 핵심 요소 및 맥락 정보 와의 연관성에 따라 중요도 점수를 부여하고, 부여된 중요도 점수에 따라 복수의 문장 각각에 상이한 표시를 지 정할 수 있다. 즉, 연관성에 따라 각 문장에 부여된 점수가 중요도에 대한 지표일 수 있다. 다시 말하면, 문장 중요도 결정부는 1)복수의 문장 각각에서 핵심 요소와 관련된 단어의 존재 여부에 따라 중요도 점수를 부여하고, 2)복수의 문장을 통해 도출된 맥락 정보를 나타내고 있는 핵심 문장에 중요도 점수를 부여하여 종합적으로 문장 각각의 중요도를 결정할 수 있다. [표 2]를 참조하면 핵심 문구를 조합하여 '시스템 운영 직무 적합도 맥락'이라는 맥락 정보가 생성되었고, 지원 자가 지원한 직무의 키워드가 '시스템 개발'인 경우, 문장 중요도 결정부는 각각의 문장에 대한 중요도를 [표 3]과 같이 결정할 수 있다. 참고로, 중요도를 점수 형식으로 나타낼 시에는 2: 중요 문장, 1: 상관 문장, 0: 기타 와 같이 숫자의 의미를 기재해줄 수 있다. 표 3 문장 예시 중요도 이미지 인식 시스템을 개발한 POC 프로젝트 경험이 가장 의미있다고 생각합니다. 2 원활한 프로젝트 진행을 위해 가장 중요한 것은 사용자 요구사항을 정확하게 이해해야 합 니다.0 PM 역할의 선배와 함께 요구 사항 정의서를 꼼꼼히 분석하고, 기능 구현을 위해 업무를 분배하였습니다.0 하지만 인턴 사원들은 사내 솔루션 이해도 부족과 익숙하지 않은 개발 환경 때문에 갈피 를 잡지 못하였습니다.0 팀원들과 함께 솔루션 매뉴얼 분석하고, 개발자를 찾아가 질문을 통해 이해도를 높이고자 하였습니다.1 다각적 사고 방식과 효율적 로직 설계를 통해 완성도 높은 시스템을 개발하였습니다. 0[표 3]와 같이, 문장 중요도 결정부는 평가자가 문서 내에서 각각의 문장에 부여된 중요도 점수를 인식할 수 있도록 시각적인 효과를 줄 수 있으며, 중요도 점수 외에도 서로 다른 색의 하이라이팅 표시, 볼드체 표시 등 문장 각각에 상이한 표시를 지정할 수 있다. 뿐만 아니라, 문장 중요도 결정부는 기준 값보다 높은 중요도 점수를 가지는 모든 문장들에 시각적인 효과 를 줄 수 있으며, 여기서의 기준 값은 관리자에 의해 고정된 값으로 설정되거나, 문서 내 전체 문장에서 상위 n%(n은 1이상의 자연수) 값으로 설정될 수 있다. 아울러, 문장 중요도 결정부는 기 저장된 문서에서 동일 문장에 대한 평가자들의 의견 일치 정도 또는 기 저장된 문서의 서류 전형 평가 점수를 기준으로 문장 별 중요도를 결정할 수 있으며, 이를 맥락 획득부가 생성한 중요도 예측 모델에 반영할 수 있다. 메모리는 채용 서버가 접수 받은 지원 서류, 평가자에 의해 검토가 완료된 지원 서류 데이터를 저장 하고, 이를 기초로 학습된 서류 전형 모델을 저장할 수 있다. 지금까지 본 발명의 일 실시 예에 따른 서류 전형 서버의 구성에 대하여 설명하였다. 본 발명에 따르면 서 류 전형 서버는 지원자가 작성한 문서를 문장과 단어 별로 세부 분석하고 문서의 맥락을 파악함으로써, 각 회사 별로 설정한 키워드에 부합하는 문장을 강조 표시해줄 수 있다. 또한, 서류 전형 서버를 이용하여 지 원자의 문서 검토 시간을 측정한 결과 평균적으로 하나의 문서를 평가하는 데 소요되는 시간이 기존보다 대폭 감소되어, 검토의 효율성은 물론 인력 비용을 감축시킬 수 있으며, 서류 전형 서버가 학습하는 지원서의 양이 지속적으로 증가함에 따라 하나의 문서를 평가하는 데 소요되는 시간은 점차 감소할 수 있다. 이하에서는, 상술한 서류 전형 서버를 이용하여 지원 서류를 가이드하는 방법에 대하여 설명하도록 한다. 참고로, 가이드는 평가자가 지원 서류를 보다 빠르게 읽을 수 있도록 문서 내 중요 문장에 특정 표시를 지정해 주는 것이다. 도 5는 본 발명의 제2 실시 예에 따른 서류 전형 서버가 중요 단어를 학습하고, 지원 서류에서 중요 문장 을 추론 및 가이드하는 방법의 흐름을 도식화한 도면이다. <학습부> 도 5를 참조하면, 서류 전형 서버는 유사한 의미를 가지는 단어들이 유사한 벡터 값을 가지도록 서류 전형 서버는 평가가 완료된 문서들, 기 저장된 문서들의 맥락 정보들을 학습하여, 맥락을 파악하기 위한 벡터 변환 모델을 생성한다(S101). 구체적으로, 서류 전형 서버는 평가가 완료된 문서들을 맥락의 유사도에 따 라 분류하고, 맥락에 대응되는 단어와 해당 문서를 유사한 값을 가지는 단어 벡터와 문서 벡터로 추출할 수 있 으며, 이를 기초로 단어-벡터 변환 모델을 생성할 수 있다. 예를 들어, 서류 전형 서버는 분류된 맥락 정 보가 '고객 마케팅 직무 적합도 맥락', '고객 서비스 직무 적합도 맥락'이고, 해당 맥락 정보에 대응되는 단어 들 '요구'-'이해', '니즈'-'파악'단어를 유사한 값의 벡터로 변환 할 수 있다. 즉, 학습 과정에서 '마케팅', ' 고객 서비스' 등의 직무 문서는 단어 벡터와 함께 평균을 취하여 학습될 수 있는 바, 문서 벡터는 단어 벡터와 동일하게 유사 값을 가짐으로써, 문서 간 상대적 의미 파악이 가능하다. 아울러, 이러한 단어를 벡터로 변환하 는 과정을 수행하기 위해, 단어와 문서를 형태소 분석하여, 의미를 가지는 실질 형태소 만을 벡터화할 수 있다. S101 단계 이후, 서류 전형 서버는 평가가 완료된 문서들의 중요도를 학습하여, 중요도를 예측하기 위한 중요도 예측 모델을 생성한다(S102). 여기서, 평가가 완료된 문서란 평가자가 중요 문장으로 간주하고 별도로 표시해 둔 문장을 포함하는 문서 또는 서류 전형 서버와 평가자에 의해 중요 문장이 지정 완료된 문서로서, 직무 별 키워드가 포함될 수 있다. 또한, 중요도는 문서를 구성하는 복수의 문장 각각이 지원자가 지 원한 직무에 어느 정도로 적합한지 정량적으로 나타낸 지표로서, 예를 들어 평가자의 설정에 따라 가장 적합하 지 않은 문장은 0, 가장 적합한 문장은 5로 태깅될 수 있다. 여기서, 문장에 대한 점수는 이에 한정되지 않는 다양한 점수 범위가 설정될 수 있다. 구체적으로, 서류 전형 서버는 중요도 별 점수가 설정된 문장에서 구문 각각의 핵심을 나타내는 단어를 조 합하여(핵심 문구 생성) 제 1 특성 벡터 형태로 추출하고, 문장에서 연속된 구문의 맥락 정보를 제 2 특성 벡터 형태로 추출하여, 이를 기초로 중요도 예측 모델을 생성할 수 있으며, 평가자에 의한 중요도 점수가 반영되는 바, 해당 모델은 이후 지원자의 문서 평가 과정에서 평가자에 의해 지속적으로 업데이트 될 수 있다. 예를 들어, 서류 전형 서버가 중요하다고 강조한 표시를 읽고 틀렸다고 판단될 경우, 평가자는 강조 표시 를 취소할 수 있으며, 서류 전형 서버가 중요하지 않다고 넘긴 부분이 틀렸다고 판단될 경우, 평가자는 중 요 문장을 선택할 수도 있다. 이와 같이, 평가자에 의한 피드백을 지속적으로 제공받아 학습 데이터에 반영하기 때문에, 평가 과정의 공정성을 증대시킬 수 있다. 상술한 바와 같이, 서류 전형 서버는 중요 문장 내 중요 단어들을 워드 임베딩(Word-Embedding) 모델을 이 용하여 단어 벡터로 변환하고, 이후 신경망 모델(CNN, RNN)을 이용하여 특성에 따라 제1 특성 벡터, 제2 특성 벡터로 변환함으로써, 지원자가 작성한 문서의 맥락을 파악하고, 중요도를 매기기 위한 모델을 생성할 수 있다. 지금까지 서류 전형 서버가 평가가 완료된 문장의 중요도를 학습하고 맥락을 파악하기 위한 모델을 생성 및 학습하는 방법에 대하여 설명하였다. 본 발명에 따르면, 평가자 하나하나의 의견이 학습 모델에 반영될 수 있기 때문에, 모든 지원자에게 동일한 평가 기준을 적용할 수 있다. <추론부> 서류 전형 서버는 지원자가 작성한 문서를 문장 단위로 분리한다(S110). 해당 단계는 문서의 내용을 서류 전형 서버가 데이터 처리할 수 있는 형태로 정제하는 단계로서, 문서 내 모든 문장을 개별 문장으로 나눌 수 있다. 다만, 문장으로 나누기 이전에 문서에 존재하는 항목을 확인하고, 항목 별로 동일한 범주의 문장들을 함께 묶어 둘 수 있다. S110 단계 이후, 서류 전형 서버는 문서를 구성하는 복수의 문장 각각의 구문을 분석한다(S120). 즉, 서류 전형 서버는 문서를 문단-문장에서 더 작은 단위인 단어 그룹으로 나눈 후 구문 분석을 수행할 수 있다. 그에 따라, 서류 전형 서버는 복수의 문장 각각을 단어 또는 형태소 단위로 쪼개고, 구분된 단어 그룹에서 중요 단어를 선정하여 해당 문장의 핵심 문구를 생성할 수 있다. 이 때, 학습된 중요도 예측 모델을 이용하여 중요 단어를 선정할 수 있다. 보다 구체적으로, 서류 전형 서버는 중요 단어들의 조합을 특성 벡터 형태로 추출하고, 이를 중요도 예측 모델에 입력하여, 중요 단어를 선정할 수 있다. 아울러, 서류 전형 서버는 중요도 예측 모델 벡터 값을 입 력하는 바, 벡터 간의 유사도를 측정하기 위해 유클리디안 거리 유사도, 코사인 유사도 방식 등을 이용할 수 있 다. S120 단계 이후, 서류 전형 서버는 분석한 구문을 기초로 문서의 맥락(Context) 정보를 획득한다(S130). 맥락 정보를 획득하기 위해, 서류 전형 서버는 순환 신경망 모델(Recurrent Neural Network, RNN)을 이용 할 수 있으며, 핵심 문구를 순서대로 조합하여 문서의 맥락을 분석할 수 있다. 예를 들어, 핵심 문구의 순서가 '이미지 인식 시스템'-'사용자 요구사항 이해'-'솔루션 매뉴얼 분석'-'효율적 로직 설계'인 경우, 서류 전형 서버는 '시스템 운영 직무 적합도 맥락'이라는 맥락 정보를 획득할 수 있다. S130 단계 이후, 서류 전형 서버는 지원자가 지원한 직무의 정보와 문서의 맥락 정보를 이용하여 복수의 문장 각각의 중요도를 결정한다(S140). 여기서, 직무의 정보는 직무 별로 지정된 핵심 요소(예. 도전, 긍정)를 포함할 수 있다. 구체적으로, 서류 전형 서버는 복수의 문장 각각을 핵심 요소 및 맥락 정보와의 연관성에 따라 중요도 점수를 부여할 수 있으며, 부여된 중요도 점수에 따라 복수의 문장 각각에 상이한 표시를 지정할 수 있다. 즉, 연관성에 따라 각 문장에게 부여된 점수가 중요도에 대한 지표일 수 있다. 다시 말하자면, 1)복수의 문장 각각에서 핵심 요소와 관련된 단어의 존재 여부에 따라 중요도 점수를 부여하고, 2)복수의 문장에서 도출된 맥락 정보를 나타내고 있는 핵심 문장에 중요도 점수를 부여하여 종합적으로 문장 각 각의 중요도를 결정할 수 있다. S140 단계 이후, 서류 전형 서버는 중요도가 결정된 문서에서 평가자가 보정한 문장 별 중요도를 학습한다 (S150). 예를 들어, 서류 전형 서버는 평가자로부터 중요한 문장으로 강조 표시된 문장 외에 또 다른 문장 을 선택 받을 수 있으며, 중요한 문장으로 강조 표시된 문장을 취소 받을 수 있다. 이는 곧 학습부에서 지원 서 류 학습을 위한 자료로 피드백 될 수 있다. 한편, 서류 전형 서버는 평가자가 문서 내에서 각각의 문장에 부여된 점수를 인식할 수 있도록 시각적인 효과를 줄 수 있다. 이와 관련하여, 도 6a 및 도 6b는 본 발명의 제2 실시 예에 따른 서류 전형 서버가 가이드 완료한 문서를 예시적으로 나타낸 도면으로서, 도 6a 및 도 6b를 참조하면, 문서 내 중요 문장들이 평가자가 한 눈에 인식할수 있도록 빗금 표시되어 있는 것을 확인할 수 있다. 또한, 직무 별로 지정된 핵심 요소(지원 동기, 글로벌 역 량)가 표시되어 평가자가 이를 읽고 쉽게 해당 문서를 평가할 수 있도록 도움을 줄 수 있다. 한편, 문장이 빗금 표시와 함께 중요도 점수가 표시될 수도 있으며, 중요도에 따라 볼드체 표시, 밑줄 표시, 서 로 다른 색상으로 하이라이팅 표시되어 있을 수도 있다. 지금까지 본 발명의 일 실시 예에 따른 서류 전형 서버가 평가자의 편의를 위해 문서 내 중요 문장을 가이 드해주기 위한 방법에 대하여 설명하였다. 본 발명에 따르면, 문서의 표절 여부나, 회사 별 키워드 존재 여부, 키워드 개수 체크 등 문서를 수치적으로 검토하는 것이 아니라, 맥락을 파악하고 맥락에 맞게 문서가 작성되었 는지 검토하기 때문에, 실질적으로 합격, 불합격을 결정하는 평가자가 보다 쉽게 의사 결정을 내릴 수 있다. 한편, 본 발명은 또한 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능 하다. 컴퓨터가 읽을 수 있는 기록 매체는 마그네틱 저장 매체, 광학적 판독 매체 등 모든 저장매체를 포함한다. 또한, 본 발명에서 사용되는 메시지의 데이터 포맷을 기록 매체에 기록하는 것이 가능하다. 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2019-0134426", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시 예에 따른 서류 전형 시스템의 구성을 개략적으로 나타낸 도면이다. 도 2는 본 발명의 제2 실시 예에 따른 서류 전형 시스템의 구성을 개략적으로 나타낸 도면이다. 도 3은 본 발명의 제2 실시 예에 따른 서류 전형 서버의 구성을 개략적으로 나타낸 도면이다. 도 4는 본 발명의 제2 실시 예에 따른 서류 전형 시스템의 구성에서 각 구성 요소들이 수행하는 기능을 설명하 기 위한 도면이다. 도 5는 본 발명의 제2 실시 예에 따른 서류 전형 서버가 중요 단어를 학습하고, 지원 서류에서 중요 문장 을 추론 및 가이드하는 방법의 흐름을 도식화한 도면이다. 도 6a 및 도 6b는 본 발명의 제2 실시 예에 따른 서류 전형 서버가 가이드 완료한 문서를 예시적으로 나타낸 도 면이다."}
