{"patent_id": "10-2023-0047496", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0151463", "출원번호": "10-2023-0047496", "발명의 명칭": "기지국 전력 제어 방법, 장치, 시스템 및 컴퓨터 프로그램", "출원인": "주식회사 케이티", "발명자": "서형원"}}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기지국 장치에서, 하나 이상의 단말로부터 수집된 채널 상태 정보(Channel State Information, CSI)를 기초로채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을수행하는 단계;상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 부하 상태를 판단하는 단계; 및상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하는 단계;를포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 빔포밍을 수행하는 단계에서는,상기 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자(Precoding Matrix Index, PMI)를 기초로 상기 채널 상태정보 기준 신호(CSI-RS) 자원을 할당하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 부하 상태를 판단하는 단계에서는,상기 기지국 장치의 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 상기 기지국 장치의 부하 상태를 판단하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 재할당하는 단계는,상기 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 미리 정의된복수의 부하 상태 중 제1 부하 상태로 분류하는 단계; 및상기 제1 부하 상태에 대응하는 채널 상태 정보 기준 신호(CSI-RS) 자원으로 재할당하는 단계;를 포함하는 것을특징으로 하는 방법."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 재할당하는 단계에서는,상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 제한하여 상기 채널 상태 정보 기준 신호(CSI-RS)에 할당되는포트 수를 감축하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "컴퓨터에서 제1 항 내지 제5항 중 어느 한 항에 기재된 방법의 각 단계를 실행시키기 위한 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "하나 이상의 단말로부터 수집된 채널 상태 정보(Channel State Information, CSI)를 기초로 채널 상태 정보 기공개특허 10-2024-0151463-3-준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을 수행하는 빔포밍 수행부;상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 부하 상태를 판단하는 부하 상태 판단부; 및상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하는 채널 상태 정보 기준 신호 자원을 재할당부;를 포함하는 것을 특징으로 하는 기지국 장치."}
{"patent_id": "10-2023-0047496", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 빔포밍 수행부에서는,상기 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자(Precoding Matrix Index, PMI)를 기초로 상기 채널 상태정보 기준 신호(CSI-RS) 자원을 할당하는 것을 특징으로 하는 기지국 장치."}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무선 통신 시스템에 관한 것으로서, 보다 구체적으로 무선 통신 시스템의 기지국에서 접속된 단말의 부하 상태를 고려하여 전력을 제어하는 방법, 장치, 시스템 및 컴퓨터 프로그램에 관한 것이다. 본 발명에서는, 기지국 장치에서, 하나 이상의 단말로부터 수집된 채널 상태 정보(Channel State Information, CSI)를 기초로 채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을 수 행하는 단계; 상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 부하 상태를 판단하는 단계; 및 상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하는 단계;를 포함하 는 방법을 개시한다."}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무선 통신 시스템에 관한 것으로서, 보다 구체적으로 무선 통신 시스템의 기지국에서 접속된 단말의 부하 상태를 고려하여 전력을 제어하는 방법, 장치, 시스템 및 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동 통신 시스템에서 높은 데이터 전송 속도를 달성하기 위해 빔포밍(beamforming), 거대 다중 입력 다중 출력(massive Multi-Input Multi-Output: massive MIMO), 전차원 다중 입력 다중 출력(Full Dimensional MIMO: FD-MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍(analog beamforming), 및 대규모 안테나(large scale antenna) 기술들이 논의되고 있다. 상기와 같은 여러 기술들은 채널 품질 등에 따라 안테나로부터 송신되 는 전송 전력을 집중시키거나 전송되는 데이터 양을 조절하고, 채널 품질이 좋은 사용자에게 선택적으로 데이터 를 전송하는 등의 방법을 통해 전송 효율을 개선하여 시스템 용량 성능을 개선시킨다. 이러한 기술들은 대부분이 기지국(Base Station, BS)과 단말 사이의 채널 상태 정보를 기반으로 한다. 따라서, 기지국 또는 단말은 기지국과 단말 사이의 채널 상태를 측정할 필요가 있으며, 이를 위해 채널 상태 지시 기준 신호(Channel Status Indication Reference Signal, CSI-RS)가 이용될 수 있다. 이에 따라, 기지국에서는 상기 채널 상태 지시 기준 신호(CSI-RS)를 이용하여 단말에서 측정한 채널 상태 정보 (CSI)를 전송받고, 이를 기반으로 빔포밍을 수행하여 상기 채널 상태에 대응하면서 각 단말과 통신을 수행하게 된다. 그런데, 위와 같이 기지국에서 각 단말로부터 전송되는 채널 상태 정보(CSI)를 기반으로 빔포밍을 수행하는 경 우 리소스가 과도하게 반영되면서 상기 기지국의 전력 소모량이 불필요하게 증가하는 문제가 발생할 수 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2019-0120372호 (2019. 10. 23.)"}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위해 창안된 것으로, 단말로부터 전송되는 채널 상태 정 보(CSI)를 기반으로 리소스가 과도하게 반영되면서 기지국의 전력 소모량이 불필요하게 증가되는 문제를 개선할 수 있는 기지국 전력 제어 방법, 장치, 시스템 및 컴퓨터 프로그램을 제공하는 것을 목적으로 한다. 나아가, 본 발명에서는 기지국의 전력 소모량을 절감하면서도 각 단말에서 요구되는 리소스를 효율적으로 할당 할 수 있는 기지국 전력 제어 방법, 장치, 시스템 및 컴퓨터 프로그램을 제공하는 것을 목적으로 한다. 본 발명에서 해결하고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제는 본 명세서에 기재된 내용으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 한 측면에 따른 방법은, 기지국 장치에서, 하나 이상의 단말로부터 수집 된 채널 상태 정보(Channel State Information, CSI)를 기초로 채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을 수행하는 단계; 상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 부하 상태를 판단하는 단계; 및 상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하는 단계;를 포함하는 것을 특징으로 한다. 여기서, 상기 빔포밍을 수행하는 단계에서는, 상기 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자(Precoding Matrix Index, PMI)를 기초로 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당할 수 있다. 또한, 상기 부하 상태를 판단하는 단계에서는, 상기 기지국 장치의 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 상기 기지국 장치의 부하 상태를 판단할 수 있다. 이때, 상기 재할당하는 단계는, 상기 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하 나 이상을 고려하여 미리 정의된 복수의 부하 상태 중 제1 부하 상태로 분류하는 단계; 및 상기 제1 부하 상태 에 대응하는 채널 상태 정보 기준 신호(CSI-RS) 자원으로 재할당하는 단계;를 포함할 수 있다. 또한, 상기 재할당하는 단계에서는, 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 제한하여 상기 채널 상태 정보 기준 신호(CSI-RS)에 할당되는 포트 수를 감축할 수 있다. 또한, 본 발명의 다른 측면에 따른 컴퓨터 프로그램은, 컴퓨터에서 상기 기재된 방법의 각 단계를 실행시키기 위한 컴퓨터로 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램인 것을 특징으로 한다. 또한 본 발명의 다른 측면에 따른 기지국 장치는, 하나 이상의 단말로부터 수집된 채널 상태 정보(Channel State Information, CSI)를 기초로 채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을 수행하는 빔포밍 수행부; 상기 빔포밍이 적용된 채널 환경에서의 상기 기지 국 장치의 부하 상태를 판단하는 부하 상태 판단부; 및 상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상 태 정보 기준 신호(CSI-RS) 자원을 재할당하는 채널 상태 정보 기준 신호 자원을 재할당부;를 포함하는 것을 특 징으로 한다. 여기서, 상기 빔포밍 수행부에서는, 상기 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자(Precoding Matrix Index, PMI)를 기초로 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당할 수 있다."}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에 따라, 본 발명의 일 실시예에 따른 기지국 전력 제어 방법, 장치, 시스템 및 컴퓨터 프로그램에서는, 단말 로부터 전송되는 채널 상태 정보(CSI)를 기반으로 리소스가 과도하게 반영되면서 기지국의 전력 소모량이 불필 요하게 증가되는 문제를 개선할 수 있게 된다. 보다 구체적으로, 본 발명의 일 실시예에 따른 기지국 전력 제어 방법, 장치, 시스템 및 컴퓨터 프로그램에서는, 기지국의 전력 소모량을 절감하면서도 각 단말에서 요구되는 리소스를 효율적으로 할당할 수 있게 된다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과는 본"}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "명세서에 기재된 내용으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 이하에서는 특정 실시예들을 첨부 된 도면을 기초로 상세히 설명하고자 한다. 이하의 실시예는 본 명세서에서 기술된 방법, 장치 및/또는 시스템에 대한 포괄적인 이해를 돕기 위해 제공된다. 그러나 이는 예시에 불과하며 본 발명은 이에 제한되지 않는다. 본 발명의 실시예들을 설명함에 있어서, 본 발명과 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략하기로 한다. 그리고, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 상세한 설명에서 사용되 는 용어는 단지 본 발명의 실시예들을 기술하기 위한 것이며, 결코 제한적이어서는 안 된다. 명확하게 달리 사 용되지 않는 한, 단수 형태의 표현은 복수 형태의 의미를 포함한다. 본 설명에서, \"포함\" 또는 \"구비\"와 같은 표현은 어떤 특성들, 숫자들, 단계들, 동작들, 요소들, 이들의 일부 또는 조합을 가리키기 위한 것이며, 기술된 것 이외에 하나 또는 그 이상의 다른 특성, 숫자, 단계, 동작, 요소, 이들의 일부 또는 조합의 존재 또는 가능 성을 배제하도록 해석되어서는 안 된다. 또한, 제1, 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되는 것은 아니며, 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로만 사용된다. 아래에서는, 본 발명의 설명을 명확히 하기 위해, 3GPP(3rd Generation Partnership Project) 5G NR(New Radio) 표준(예, 3GPP TS(Technical Specification) 38.xxx Release 15 이후의 표준)에 따른 무선 통신 시스템 을 기반으로 본 발명을 설명하지만, 본 발명이 3GPP 5G NR 표준에 따른 무선 통신 시스템에 제한되는 것은 아니 다. 예를 들어, 본발명은 3GPP TS 36.xxx Release 15 이후의 표준에 따른 무선 통신 시스템에서 사용될 수 있을 뿐만 아니라, 본 발명은 빔포밍이 적용될 수 있는 다양한 무선 접속 시스템(예, CDMA(Code Division Multiple Access), FDMA(Frequency Division Multiple Access), TDMA(Time Division Multiple Access), OFDMA(Orthogonal Frequency Division Multiple Access), SC-FDMA(Single-Carrier FDMA))에서도 사용될 수 있 다. “xxx”는 3GPP 표준 문서 세부 번호를 의미한다. 본 명세서에서 3GPP 5G NR 표준에 따른 무선 통신 시스템 은 “5G 시스템”으로 약칭될 수 있다. 본 발명과 관련된 배경 기술, 용어, 약어 등에 관해서는 본 발명 이전에 공개된 3GPP 5G NR 표준 문서에 기재된 사항을 참조할 수 있으며, 3GPP 5G NR 표준 문서 모두를 상세한 설명의 일부로서 포함한다. 예를 들어, 다음 문 서를 참조할 수 있다. - 3GPP TS 38.211: Physical channels and modulation - 3GPP TS 38.212: Multiplexing and channel coding - 3GPP TS 38.213: Physical layer procedures for control - 3GPP TS 38.214: Physical layer procedures for data - 3GPP TS 38.300: NR and NG-RAN Overall Description - 3GPP TS 38.304: User Equipment (UE) procedures in Idle mode and RRC Inactive state - 3GPP TS 36.331: Radio Resource Control (RRC) protocol specification 단말은 고정식 또는 이동식일 수 있고, 사용자 기기(User Equipment, UE), 이동국(Mobile Station, MS), 사용 자 단말(User Terminal, UT), 가입국(Subscriber Station, SS), 이동 단말(Mobile Terminal), 무선 디바이스 등과 같은 다른 용어로 지칭될 수 있다. 기지국(Base Station, BS)는 일반적으로 단말과 통신하는 고정국(fixed station)으로 eNB(eNodeB 또는 evolved Node B), gNB(gNodeB 또는 general Node B), BTS(Base Transceiver System), AP(Access Point) 등과 같은 다른 용어로 지칭될 수 있다. 하향링크(downlink)는 기지국에서 단말로 의 통신을 지칭하고, 상향링크(uplink)는 단말에서 기지국으로의 통신을 지칭한다. 물리 계층(Physical Layer) 채널 및 신호 5G 시스템에서는 물리 계층의 상위 계층(예, MAC(Medium Access Control) 계층, RLC(Radio Link Control) 계층, RRC(Radio Resource Control) 계층 등)의 정보를 나르는 하향링크 물리 채널과, 기준 신호(Reference Signal, RS)와 동기 신호(Synchronization Signal, SS) 같이 기지국과 단말 간에 미리 정의되어 특정 목적을 위해 사용되는 하향링크 물리 신호가 사용된다. 예를 들어, 5G 시스템에서는 사용자 데이터나 상위 계층 정보를 나르는 물리 하향링크 공유 채널(Physical Downlink Shared Channel, PDSCH), 시스템 정보와 같은 브로드캐스트 정보를 나르는 물리 브로드캐스트 채널 (Physical Broadcast Channel, PBCH), 하향링크 제어 정보를 나르는 물리 하향링크 제어 채널(Physical Downlink Control Channel, PDCCH)이 하향링크 물리 채널로서 사용된다. 예를 들어, 5G 시스템에서는 PDCCH 또는 PDSCH 복조를 위한 복조 기준 신호(DeModulation RS, DMRS), 위상 차 이 추적 및 보상을 위한 위상 추적 기준 신호(Phase-Tracking RS, PT-RS), 채널 상태 측정을 위한 채널 상태 정 보 기준 신호(Channel State Information RS, CSI-RS), 기지국과의 동기화 및 셀 식별 정보(예, 셀 ID) 획득을 위한 주 동기 신호(Primary Synchronization Signal, PSS)와 부 동기 신호(Secondary Synchronization Signal, SSS)가 사용된다. 5G 시스템에서 물리 채널과 물리 신호는 물리 자원(physical resource)에 매핑되어 전송 시간 구간 (Transmission Time Interval, TTI)(예, 슬롯(slot)) 단위로 송수신된다. 물리 자원은 서브캐리어(subcarrie r)와 OFDM(Orthogonal Frequency Division Multiplexing) 심볼(symbol)의 자원 그리드(resource grid)로 정의 되고, 뉴머롤로지(Numerology)(μ)에 따라 다양한 프레임 구조(frame structure)가 정의된다. 뉴머롤로지는 서 브캐리어 간격(SubCarrier Spacing, SCS)에 대응되며, 뉴머롤로지에 따라 하나의 캐리어를 구성하는 서브캐리어 의 개수와 하나의 프레임을 구성하는 슬롯의 개수가 달라질 수 있다. 자원 그리드의 각 요소는 하나의 서브캐리 어와 하나의 OFDM 심볼에 대응하며 자원 요소(RE)라고 지칭된다. 하나의 RB는 12개의 서브캐리어로 구성된다. 하나의 슬롯은 12개(확장 순환 전치(extended cyclic prefix)의 경우) 또는 14개(보통 순환 전치(normal cyclic prefix)의 경우)의 OFDM 심볼로 구성되고, 보통 순환 전치의 경우 하나의 서브프레임은 뉴머롤로지에 따 라 10개, 20개, 40개, 80개, 160개의 OFDM 심볼로 구성된다. 도 1은 5G 시스템의 자원 그리드를 예시한다. 도 1의 예는 뉴머롤로지(μ)가 0이고 보통 순환 전치로 설정된 경 우 자원 그리드를 예시하지만, 본 발명은 도 1의 예로만 제한되어 적용되는 것은 아니다. 도 1을 참조하면, 뉴머롤로지(μ)가 0인 경우 하나의 서브프레임은 하나의 슬롯으로 구성되고, 보통 순환 전치 로 설정된 경우 하나의 슬롯은 14개의 OFDM 심볼로 구성된다. 하나의 자원 블록은 12개의 연속된 서브캐리어로 구성된다. 자원 블록(RB)은 주파수 도메인에서 12개의 연속적인 자원 요소(RE)로 구성될 수 있다 (도 1에서 굵 은 사각형 참조). 주파수 도메인에서 하나의 캐리어는 NRBμ*NSCRB 개의 서브캐리어로 구성될 수 있으며, NRBμ는 하나의 캐리어에서 자원 블록의 개수를 나타내고 상위 계층(예, RRC 계층)에 의해 주어질 수 있으며, NSCRB는 하 나의 자원 블록 내의 자원 요소의 개수(=12)를 나타낸다. 물리 채널, 물리 신호, 물리 자원, 물리 채널 및 신호의 생성 및 자원 매핑(mapping)에 관한 자세한 설명은 3GPP TS 38.211 표준 문서에 기재되어 있으며, 본 명세서는 해당 표준 문서를 상세한 설명의 일부로서 포함한다.CSI-RS 5G 시스템에서 채널 상태 정보 기준 신호(CSI-RS)는 기지국에서 단말로 전송되는 하향링크 물리 신호이며, 채널 상태 측정(예, CQI(Channel Quality Indicator), RI(Rank Indicator), PMI(Precoding Matrix Indicator) 측정), 연결 모드 이동성(connected mode mobility), 무선 링크 실패 검출(radio link failure detection), 빔 실패 검출 및 복구(beam failure detection and recovery), 시간 및 주파수 동기 추적(time and frequency synchronization tracking) 등을 위해 사용될 수 있다. CSI-RS는 시간 도메인과 주파수 도메인에서 특정 가중치 시퀀스(weighting sequence)를 의사 랜덤 시퀀스 (pseudo random sequence)에 곱하고 전력 스케일링 인자(power scaling factor)를 곱하여 생성된다. 5G 시스템 은 32개 CSI-RS 안테나 포트를 지원하며, 생성된 CSI-RS 신호는 CSI-RS가 전송되는 안테나 포트 개수에 따라 코 드 분할 다중화(Code Division Multiplexing, CDM) 방식에 기반하여 물리 자원에 매핑되어 단말로 전송된다. 예 를 들어, CSI-RS와 슬롯 내 위치는 수학식 1과 표 1에 기반하여 결정될 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[표 1] 수학식 1에서 k는 CSI-RS가 매핑되는 RE의 서브캐리어 인덱스를 나타내고, l은 CSI-RS가 매핑되는 RE의 OFDM 심 볼 인덱스를 나타내고, p는 CSI-RS 안테나 포트를 나타내고, μ는 뉴머롤로지를 나타내고, NSCRB는 RB당 서브캐 리어 개수(예, 12)를 나타내고, βCSIRS는 전력 스케일링 인자를 나타내고, ρ는 상위 계층에 의해 주어지는 밀도 (Density) 값이고, X는 CSI-RS 안테나 포트 개수를 나타내고, wf(k)는 주파수 도메인에서 곱해지는 가중치 시퀀 스를 나타내고, wt(l)은 시간 도메인에서 곱해지는 가중치 시퀀스를 나타내고, r(m)은 의사 랜덤 시퀀스를 나타 낸다. 표 1에서 cdm-Type은 CDM 방식을 나타내며, noCDM은 CDM되지 않음을 나타내고, fd-CDM2는 주파수 도메인에서 2 개의 RE에 CDM됨을 나타내고, cdm4-FD2-TD2는 주파수 도메인에서 2개의 RE와 시간 도메인에서 2개의 RE를 포함 하여 4개의 RE에 CDM됨을 나타내고, cdm8-FD2-TD4는 주파수 도메인에서 2개의 RE와 시간 도메인에서 4개의 RE를 포함하여 8개의 RE에 CDM됨을 나타내고, k0는 주파수 도메인에서 시작 서브캐리어 인덱스를 나타내고, l0는 시간 도메인에서 시작 OFDM 심볼 인덱스를 나타낸다. 도 2는 CSI-RS를 CDM 방식에 기반하여 자원 매핑하는 방법을 예시한다. 도 2의 예에서, 각 블록은 CSI-RS가 매핑되는 RE를 나타내며 RE(들)의 위치는 상위 계층(예, RRC 계층)에 의해 주어지는 k0와 l0에 기반하여 결정된다(예, 수학식 1 및 표 1 참조). wf는 주파수 도메인에서 곱해지는 가중치 시퀀스를 나타내고, wt는 시간 도메인에서 곱해지는 가중치 시퀀스를 나타내며, 예를 들어 3GPP TS 38.211 표준 문서에 기재된 가중치 시퀀스들이 사용될 수 있다(예, 3GPP TS 38.211의 Table 7.4.1.5.3-2 내지 Table 7.4.1.5.3-5 참조). CSI-RS는 물리 자원에 매핑된 다음 단말로 전송될 수 있다. CSI-RS의 생성 및 자원 매핑에 관한 자세한 설명은 3GPP TS 38.211 표준 문서에 기재되어 있으며, 본 명세서는 해당 표준 문서를 상세한 설명의 일부로서 포함한다. 채널 상태 정보(Channel State Information, CSI) 단말은 기지국으로부터 전송된 CSI-RS에 기반하여 채널 상태를 측정하고 채널 상태 정보를 획득할 수 있다. 본 명세서에서 채널 상태 정보는 단말과 안테나 포트 사이에 형성되는 무선 채널(혹은 링크라고도 함)의 품질을 나 타낼 수 있는 정보를 통칭한다. 채널 상태 정보는 채널 품질 지시자(Channel Quality Indicator, CQI), 프리코 딩 행렬 지시자(Precoding Matrix Indicator, PMI), CSI-RS 자원 지시자(CSI-RS Resource Indicator, CRI), SSB 자원 지시자(SSB Resource Indicator, SSBRI), 레이어 지시자(Layer Indicator. LI), 랭크 지시자(Rank Indicator, RI) 또는 기준 신호 수신 품질(Reference Signal Received Power, RSRP) 중 적어도 하나를 포함할 수 있다. 채널 품질 지시자(CQI)는 단말이 현재의 채널 상태에서 수신할 수 있는 최대 데이터 전송률(data rate)을 나타 낸다. CQI는 최대 데이터 전송률과 유사하게 활용될 수 있는 신호 대 간섭 잡음비(Signal-to-Interference- plus-Noise Ratio, SINR), 최대의 오류 정정 부호화율(coding rate) 및 변조 방식, 주파수당 데이터 효율 등으 로 대체될 수 있다. 랭크 지시자(RI)는 단말이 현재의 채널 상태에서 수신할 수 있는 공간 레이어(spatial layer)의 개수를 나타낸 다. 공간 레이어는 독립적으로 전송되는 데이터 스트림이 전송될 수 있는 레이어를 나타내며, 공간 레이어의 개 수가 많을수록 채널 상태가 좋음을 의미한다. 프리코딩 행렬 지시자(PMI)는 단말이 현재의 채널 상태에서 선호하는 프리코딩 행렬을 나타낸다. 5G 시스템에서 단말과 기지국 간에 다양한 프리코딩 행렬의 집합이 정의되며 프리코딩 행렬의 집합(set)을 코드북(codebook)이 라고 지칭한다. 5G 시스템에서는 타입-I 단일 패널 코드북(Type-I single panel codebook), 타입-I 다중 패널 코드북(Type-I multi-panel codebook)과 타입-II 코드북이 정의되어 있으며, 타입-I 코드북은 단일 사용자 MIMO(Single User MIMO, SU-MIMO)를 위해 사용될 수 있고, 타입-II 코드북은 다중 사용자 MIMO(Multi User MIMO, MU-MIMO)를 위해 사용될 수 있다. 기지국은 상위 계층 신호(예, RRC 계층 신호)를 통해 타입-I 코드북과 타입-II 코드북 중에서 사용될 코드북을 단말에게 설정할 수 있으며, 단말은 설정된 코드북에 기반하여 자신이 선호하는 프리코딩 행렬의 인덱스를 선택할 수 있는데 PMI 값은 선택된 프리코딩 행렬의 인덱스에 해당한다. 코드북과 PMI 값에 대한 자세한 설명은 3GPP TS 38.214 표준 문서에 기재되어 있으며, 본 명세서는 해당 표준 문서를 상세한 설명의 일부로서 포함한다.예를 들어, 2개 안테나 포트와 타입-I 단일 패널 코드북이 설정된 경우, 3GPP TS 38.214 표준 문서의 Table 5.2.2.2.1-1에 기재된 코드북이 사용될 수 있고, PMI 값은 코드북 인덱스에 해당한다. 다른 예로, 4, 8, 12, 16, 24, 또는 32개 안테나 포트와 타입-I 단일 패널 코드북이 설정된 경우, 레이어 개수(예, 1 내지 8)에 따라 3GPP TS 38.214 표준 문서의 Table 5.2.2.2.1-5 내지 Table 5.2.2.2.1-12에 기재된 코드북이 사용될 수 있고, PMI 값은 코드북 인덱스(i1,1, i1,2, i2 또는 i1,1, i1,2, i1,3, i2)에 해당한다. 타입-I 다중 패널 코드북이나 타입- II 코드북이 설정된 경우에도 3GPP TS 38.214 표준 문서에 따라 해당 코드북이 사용될 수 있고, PMI 값은 코드 북 인덱스에 해당한다. 코드북에 기반하여 빔포밍이 수행되는 경우, 프리코딩 행렬을 적용하여 빔을 형성할 수 있으며 PMI는 특정 빔에 대응될 수 있다. 5G 시스템에서는 코드북 타입과 CSI-RS 안테나 포트 개수에 따라 다양한 빔 구성(beam configuration)이 사용될 수 있는데, 빔 구성에 대한 자세한 설명은 3GPP TS 38.214 표준 문서에 기재되어 있으 며, 본 명세서는 해당 표준 문서를 상세한 설명의 일부로서 포함한다. 일 예로, 타입-I 단일 패널 코드북이 사용될 경우, 가능한 빔 구성은 표 2에 따라 주어질 수 있다. 표 2의 예에 서 N1은 수평 방향의 직교 빔(orthogonal beam)의 개수를 나타내고, N2는 수직 방향의 직교 빔의 개수를 나타내 고, O1은 수평 방향의 오버샘플된 빔(oversampled beam)의 개수를 나타내고, O2는 수직 방향의 오버샘플된 빔의 개수를 나타내며, 수평 방향의 빔 개수는 N1*O1이고, 수직 방향의 빔 개수는 N2*O2일 수 있다. [표 2]"}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 3은 8개 안테나 포트인 경우 빔 구성을 예시한다. 도 3(a)를 참조하면, 8개 안테나 포트에 대해 (N1,N2)=(2,2) (O1,O2)=(4,4)로 설정된 경우 빔 구성이 예시되어 있다. 도 3(a)의 예에서 각 원은 특정 방향의 빔을 나타내고, 빗금친 원은 직교 빔을 나타내고, 빗금치지 않은 원은 오버샘플된 빔을 나타낸다. 도 3(a)의 예에서, 수평 방향으로 8개 빔과 수직 방향으로 8개 빔을 포함하여 총 64개의 빔이 구성될 수 있다. 도 3(b)를 참조하면, 8개 안테나 포트에 대해 (N1,N2)=(4,1) (O1,O2)=(4,1)로 설정된 경우 빔 구성이 예시되어 있다. 도 3(b)의 예에서 각 원은 특정 방향의 빔을 나타내고, 빗금친 원은 직교 빔을 나타내고, 빗금치지 않은 원은 오버샘플된 빔을 나타낸다. 도 3(b)의 예에서, 수평 방향으로 16개 빔과 수직 방향으로 1개 빔을 포함하여 총 16개의 빔이 구성될 수 있다. 설명의 편의를 위해, 타입-I 단일 패널 코드북과 8개 안테나 포트가 설정된 예를 설명하였지만, 본 발명은 이 예로만 제한되는 것은 아니며 3GPP 38.214 표준 문서에 명시된 모든 코드북과 안테나 포트 개수에 대해 제한 없 이 적용될 수 있다. CSI 보고(CSI reporting) 단말은 측정한 CSI를 기지국에 보고하고 기지국은 CSI 보고에 기반하여 단말에 최적의 하향링크 전송을 위한 자 원을 할당한다. 코드북 기반 빔포밍을 수행하는 경우, 기지국은 단말이 CSI 보고를 통해 전송한 PMI 정보에 기 반하여 최적의 빔을 결정하고 빔포밍을 수행할 수 있다.CSI 보고는 주기적으로 수행되거나, 반지속적(semi-persistent)으로 수행되거나, 비주기적으로 수행될 수 있다. CSI 보고 수행 방식은 기지국이 상위 계층(예, RRC 계층) 신호를 통해 단말로 시그널링할 수 있다. 반지속적 CSI 보고의 경우, 기지국은 활성화 명령(activation command)을 통해 단말이 반지속적 CSI 보고 수행을 개시하 도록 지시할 수 있고, 비활성화 명령(deactivation command)을 통해 단말이 반지속적 CSI 보고를 중단하도록 지 시할 수 있다. 비주기적 CSI 보고의 경우, 기지국은 하향링크 제어 정보(Downlink Control Information, DCI) 를 통해 단말이 비주기적 CSI 보고를 수행하도록 트리거링(trigger)할 수 있다. 도 4는 CSI 보고 과정을 예시한다. 기지국은 CSI 관련 설정 정보(configuration information)를 단말로 전송할 수 있다(S410). 기지국은 CSI 관련 설정 정보를 통해 CSI 측정을 위한 CSI-RS 자원, CSI-RS 안테나 포트 개수, PMI와 관련된 코드북 타입, PMI와 관련된 빔 구성 등을 단말에 설정할 수 있다. 기지국은 S410에서 전송한 CSI 관련 설정 정보에 기반하여 CSI-RS 안테나 포트 별로 CSI-RS를 단말로 전송할 수 있다(S420). 빔포밍을 수행하는 경우 설정된 빔들을 통해 CSI-RS를 전송할 수 있다. 단말은 S410에서 수신한 CSI 관련 설정 정보와 S420에서 수신한 CSI-RS에 기반하여 채널 상태를 측정하고 CSI를 획득할 수 있다(S430). 앞서 설명한 바와 같이 CSI는 CQI, PMI, RI, CRI, LI, RSRP 중에서 적어도 하나를 포함 할 수 있다. 코드북 기반 빔포밍이 수행되는 경우, 단말은 CSI 관련 설정 정보를 통해 설정된 코드북에 기반하 여 가장 선호하는 빔을 선택하고 설정된 코드북 중에서 단말이 선택한 빔의 인덱스를 PMI 정보로 결정할 수 있 다. 단말은 S430에서 획득한 CSI를 포함하는 CSI 보고를 기지국으로 전송할 수 있고, 기지국은 단말로부터 CSI를 포 함하는 CSI 보고를 수신할 수 있다(S440). CSI 보고를 위한 시간 자원 및 방식(주기적, 반지속적, 비주기적)은 CSI 관련 설정 정보를 통해 기지국이 단말에게 지시할 수 있다. 또한, CSI 보고는 PUCCH를 통해 송수신될 수 있 다. 기지국은 S440에서 CSI 보고를 통해 수신한 CSI에 기반하여 단말을 위한 최적의 빔(또는 프리코딩 행렬)을 결정 할 수 있다(S450). 코드북 기반 빔포밍을 수행하는 경우, 기지국은 CSI 보고를 통해 수신한 PMI 정보에 기반하 여 단말을 위한 빔(또는 프리코딩 행렬)을 결정할 수 있다. S440에서, 기지국은 단말이 전송한 PMI가 가리키는 빔(또는 프리코딩 행렬)을 최적의 빔으로 결정하거나 다른 빔을 최적의 빔으로 결정할 수 있다. 기지국은 S450에서 결정한 빔(또는 프리코딩 행렬)에 기반하여 빔포밍을 수행하여 단말로 데이터 신호를 전송할 수 있다(S460). 일 예로, 데이터 신호는 PDSCH를 통해 송수신될 수 있다. 본 발명의 제안 방법 본 발명에서는 기지국에서 단말로부터 전송되는 채널 상태 정보(CSI)를 기반으로 리소스가 과도하게 반영되면서 기지국의 전력 소모량이 불필요하게 증가되는 문제를 개선할 수 있는 방법을 제안한다. 이에 대하여, 도 5에서는 본 발명의 일 실시예에 따른 기지국 전력 제어 시스템을 구성도를 예시하고 있다. 도 5에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 기지국 전력 제어 시스템은 하나 이상의 기 지국 장치와 각 기지국 장치에 대응하는 셀 영역에 위치하는 하나 이상의 단말을 포함하여 구성 될 수 있다. 이때, 상기 기지국 장치는, 앞서 설명한 바와 같이, 3GPP 5G NR 표준 등에 따라 5G 기반 통신을 수행하기 위한 장치일 수 있으나, 본 발명이 반드시 이에 한정되는 것은 아니다. 이에 따라, 상기 기지국 장치는 상기 하나 이상의 단말과 연동되어 5G 등의 통신을 수행할 수 있다. 상기 기지국 장치의 구체적인 구현예에 대해서는 아래의 도 11 및 도 11과 관련된 설명에서 보다 자세하게 살핀다. 이에 따라, 본 발명의 일 실시예에 따른 기지국 전력 제어 시스템에서 상기 기지국 장치는 상기 하나 이상의 단말로부터 전송되는 채널 상태 정보(CSI)를 기반으로 리소스가 과도하게 반영되면서 상기 기지국 의 전력 소모량이 불필요하게 증가되는 문제를 개선하게 된다. 보다 구체적으로, 도 6에서는 본 발명의 일 실시예에 따른 기지국 전력 제어 방법의 순서도를 예시한다. 도 6에 예시된 방법은 기지국 등에 구비되는 기지국 장치에 의해 수행될 수 있다. 도 6에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 기지국의 전력을 제어하는 방법은, 기지국 장치 에서, 하나 이상의 단말로부터 수집된 채널 상태 정보(Channel State Information, CSI)를 기초로 채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을 수행하는 단계(S110), 상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 부하 상태를 판단하는 단계 (S120) 및 상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하 는 단계(S130)를 포함할 수 있다. 여기서, 상기 빔포밍을 수행하는 단계(S110)에서는, 상기 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자 (Precoding Matrix Index, PMI)를 기초로 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당할 수 있다. 또한, 상기 부하 상태를 판단하는 단계(S120)에서는, 상기 기지국 장치의 무선 자원 제어(RRC) 접속 부하율 또 는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 상기 기지국 장치의 부하 상태를 판단할 수 있다. 이때, 상기 재할당하는 단계(S130)는, 도 7에서 볼 수 있는 바와 같이, 상기 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 미리 정의된 복수의 부하 상태 중 제1 부하 상태로 분류하는 단계(S131) 및 상기 제1 부하 상태에 대응하는 채널 상태 정보 기준 신호(CSI-RS) 자원으로 재할당하 는 단계(S132)를 포함할 수 있다. 또한, 상기 재할당하는 단계(S130)에서는, 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 제한하여 상기 채널 상태 정보 기준 신호(CSI-RS)에 할당되는 안테나 포트 수를 감축할 수 있다. 이에 따라, 본 발명의 일 실시예에 따른 기지국 전력 제어 방법에서는, 상기 하나 이상의 단말로부터 전송 되는 채널 상태 정보(CSI)를 기반으로 리소스가 과도하게 반영되면서 기지국의 전력 소모량이 불필요하게 증가 되는 문제를 개선할 수 있게 된다. 이하, 각 도면을 참조하여 본 발명의 일 실시예에 따른 기지국 전력 제어 방법을 각 단계 별로 나누어 보다 자 세하게 살핀다. 먼저, 상기 S110 단계에서는, 상기 기지국 장치에서 하나 이상의 단말로부터 수집된 채널 상태 정보 (Channel State Information, CSI)를 기초로 채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍(beam-forming)을 수행하게 된다. 보다 구체적으로, 상기 S110 단계에서, 상기 기지국 장치에서는 상기 하나 이상의 단말로부터 전송 되는 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자(Precoding Matrix Index, PMI)를 기초로 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당할 수 있다. 이때, 상기 하나 이상의 단말에서는 상기 기지국 장치로부터 전송되는 상기 채널 상태 정보 기준 신 호(CSI-RS)에 기반하여 채널 상태를 측정하고, 미리 정의된 코드북(codebook)에서 각 단말이 현재의 채널 상태에 대응하여 선호하는 프리코딩 행렬에 대한 지시자(PMI)를 산출하여 채널 상태 정보(CSI)에 포함하여 상기 기지국 장치로 제공할 수 있다. 이에 따라, 상기 기지국 장치에서는, 도 8에서 볼 수 있는 바와 같이, 상기 하나 이상의 단말로부터 수집되는 채널 상태 정보(CSI)를 기초로 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당하여 빔포밍(beam- forming)을 수행할 수 있게 된다. 보다 구체적으로, 도 8의 (a)에서는 CSI-RS에 따른 CSI-RS 빔과 PMI(PDSCH) 빔의 패턴을 예시하고 있으며, 도 8 의 (b)에서는 기지국 장치에서 8 포트의 CSI-RS를 사용하여 PMI 등 채널 상태 정보(CSI)를 획득하고 이를 기반으로 빔포밍을 수행하는 구성을 예시하고 있다. 이어서, 상기 S120 단계에서는, 상기 기지국 장치가 상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 부하 상태를 판단하게 된다. 보다 구체적으로, 상기 기지국 장치에서는 상기 기지국 장치의 무선 자원 제어(Radio Resource Control, RRC) 접속 부하율(즉, 접속 비율) 또는 물리 자원 블록(Physical Resource Block, PRB) 부하율 중 하 나 이상을 고려하여 상기 기지국 장치의 부하 상태를 판단할 수 있다. 이에 따라, 상기 S110 단계에서, 상기 기지국 장치는 상기 하나 이상의 단말로부터 전송되는 프리코 딩 행렬 지시자(PMI) 등 채널 상태 정보(CSI)를 기초로 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당하여 빔 포밍(beam-forming)을 수행하면서 필요 이상으로 과도하게 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당하여 상기 기지국 장치의 전력 소모량을 증가시킬 수 있는데, 이에 대하여 상기 S120 단계에서는 상기 빔포밍이 적용된 채널 환경에서의 상기 기지국 장치의 실제 부하 상태를 확인하게 된다. 이어서, 상기 S130 단계에서는, 상기 기지국 장치가 상기 기지국 장치의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하게 된다. 보다 구체적으로, 상기 S130 단계에서, 상기 기지국 장치는 상기 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 미리 정의된 복수의 부하 상태 중 제1 부하 상태로 분류 하고(S131), 상기 제1 부하 상태에 대응하는 채널 상태 정보 기준 신호(CSI-RS) 자원으로 재할당할 수 있다 (S132). 예를 들어, 아래 표 3에서 볼 수 있는 바와 같이, 상기 기지국 장치에서는 상기 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록(PRB) 부하율 중 하나 이상을 고려하여 미리 정의된 복수의 부하 상태(예를 들어, 표 3의 state 1-4) 중 제1 부하 상태로 분류하고, 상기 분류된 제1 부하 상태에 대응하는 채널 상태 정보 기준 신호(CSI-RS) 자원(예를 들어, 표 3의 CSI-RS Resource 1-4)으로 재할당할 수 있다. [표 3]"}
{"patent_id": "10-2023-0047496", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "보다 구체적인 예를 들어, 상기 S131 단계에서 상기 무선 자원 제어(RRC) 접속 부하율 또는 물리 자원 블록 (PRB) 부하율이 40% 인 경우, 상기 기지국 장치의 부하 상태를 state 2로 분류하고, 이어서 상기 S132 단 계에서 상기 state 2에 대응하는 CSI-RS Resource 2로 재할당하여 빔포밍을 수행할 수 있게 된다. 이에 따라, 도 9에서 볼 수 있는 바와 같이, 상기 기지국 장치에서는 측정되는 부하 상태에 따라 CSI-RS를 재할당하여 빔포밍을 수행할 수 있다(예를 들어, 부하 상태가 state 1인 경우는 도 9의 (A), 부하 상태가 state 2인 경우는 도 9의 (B), 부하 상태가 state 4인 경우는 도 9의 (C)). 이를 통해, 상기 기지국 장치에서는 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 제한하여 상기 채널 상태 정보 기준 신호(CSI-RS)에 할당되는 안테나 포트 수를 감축할 수 있으며, 이에 따라 상기 기지국 장치 의 전력 소모량이 불필요하게 증가하는 문제를 효율적으로 개선할 수 있게 된다. 보다 구체적인 예를 들어, 도 10의 (a)에서 볼 수 있는 바와 같이, 상기 기지국 장치의 물리 자원 블록 부 하율(PRB Load)이 감소하면서 부하 상태가 state 4에서 순차적으로 state 3, state 2로 변경되는 경우 각 부하 상태에 대응하는 채널 상태 정보 기준 신호(CSI-RS)에 할당되는 포트 수를 감축하여, 도 10의 (b)에서 볼 수 있 는 바와 같이, 상기 기지국 장치의 전력 소모량을 순차적으로 줄여 나갈 수 있게 된다(도 10의 (b)에서 (A) → (B)) → (C)). 본 발명의 제안 방법이 적용될 수 있는 장치 및 컴퓨터 프로그램 또한, 본 발명의 또 다른 측면에 따른 컴퓨터 프로그램은 앞서 살핀 기지국 전력 제어 방법의 각 단계를 컴퓨터 에서 실행시키기 위하여 컴퓨터로 판독 가능한 매체에 저장된 컴퓨터 프로그램인 것을 특징으로 한다. 상기 컴 퓨터 프로그램은 컴파일러에 의해 만들어지는 기계어 코드를 포함하는 컴퓨터 프로그램뿐만 아니라, 인터프리터 등을 사용해서 컴퓨터에서 실행될 수 있는 고급 언어 코드를 포함하는 컴퓨터 프로그램일 수도 있다. 이때, 상 기 컴퓨터로서는 퍼스널 컴퓨터(PC)나 노트북 컴퓨터 등에 한정되지 아니하며, 서버, 스마트폰, 태블릿 PC, PDA, 휴대전화 등 중앙처리장치(CPU)를 구비하여 컴퓨터 프로그램을 실행할 수 있는 일체의 정보처리 장치를 포 함한다. 또한, 컴퓨터가 읽을 수 있는 매체는, 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드 를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 복수의 하드웨어가 결합된 형태의 다양한 기록 수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다. 또한, 도 11은 본 발명의 제안 방법이 적용될 수 있는 장치를 예시한다. 도 11을 참조하면, 기지국은 5G 시스템 뿐만 아니라 다양한 무선 통신 시스템에 따른 무선 신호를 송수신 할 수 있다. 기지국은 하나 이상의 프로세서 및 하나 이상의 메모리를 포함하며, 추가적으로 하 나 이상의 RF(Radio Frequency) 송수신기(transceiver) 및/또는 하나 이상의 안테나을 더 포함할 수 있다. 하나 이상의 프로세서는 하나 이상의 메모리 및/또는 하나 이상의 RF 송수신기와 동작시 연결 (operatively connected)되어 메모리 및/또는 RF 송수신기를 제어하며, 본 발명의 제안 방법을 구현 하도록 구성될 수 있다. 프로세서는 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 또는 마이크로 컴퓨 터로 지칭될 수 있다. 하나 이상의 프로세서는 하드웨어, 펌웨어, 소프트웨어, 또는 이들의 조합에 의해 구현될 수 있다. 일 예로, 하나 이상의 ASIC(Application Specific Integrated Circuit), 하나 이상의 DSP(Digital Signal Processor), 하나 이상의 DSPD(Digital Signal Processing Device), 하나 이상의 PLD(Programmable Logic Device) 또는 하나 이상의 FPGA(Field Programmable Gate Arrays)가 하나 이상의 프로 세서에 포함될 수 있다. 본 발명의 제안 방법은 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있고, 본 발명의 제안 방법을 구현하도록 설정된 펌웨어 또는 소프트웨어는 하나 이상의 프로세서에 포함되거나, 하 나 이상의 메모리에 저장되어 하나 이상의 프로세서에 의해 실행될 수 있다. 본 발명의 제안 방법은 코드, 명령어(instruction) 및/또는 명령어의 집합 형태로 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있다. 하나 이상의 메모리는 하나 이상의 프로세서와 동작시 연결될 수 있고, 프로세서의 동작과 관련 한 명령어 뿐만 아니라 다양한 정보를 저장할 수 있다. 예를 들어, 하나 이상의 메모리는 프로세서에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나 본 발명의 제안 방법을 구현하기 위한 명령어들을 포함하는 소프트웨어 코드를 저장할 수 있다. 하나 이상의 메모리는 ROM, RAM, EPROM, 플래시 메모리, 하 드 드라이브, 레지스터, 캐쉬 메모리, 컴퓨터 판독가능한 저장 매체 및/또는 이들의 조합으로 구성될 수 있다. 하나 이상의 RF 송수신기는 하나 이상의 프로세서와 동작시 연결될 수 있고, 하나 이상의 안테나 를 통해 무선 신호를 송신 및/또는 수신할 수 있다. 하나 이상의 RF 송수신기는 송신기 및/또는 수신 기를 포함할 수 있다. 보다 구체적으로, 본 발명의 일 실시예에 따른 기지국 장치는, 하나 이상의 단말로부터 수집된 채널 상태 정보(Channel State Information, CSI)를 기초로 채널 상태 정보 기준 신호(Channel State Information Reference Signal, CSI-RS) 자원을 할당하여 빔포밍을 수행하는 빔포밍 수행부(미도시), 상기 빔포밍이 적용된 채널 환경에서의 상기 기지국의 부하 상태를 판단하는 부하 상태 판단부(미도시) 및 상기 기지국의 부하 상태를 고려하여 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 재할당하는 채널 상태 정보 기준 신호 자원을 재할당 부(미도시)를 포함하여 구성될 수 있다. 여기서, 본 발명의 일 실시예에 따른 기지국 장치에 대한 보다 자세한 내용은 앞서 설명한 본 발명의 일 실시예에 따른 기지국 전력 제어 방법에 대한 설명으로부터 유추될 수 있는 바, 보다 자세한 설명은 생략한다. 이때, 상기 빔포밍 수행부(미도시)에서는, 상기 채널 상태 정보(CSI) 중 프리코딩 행렬 지시자(Precoding Matrix Index, PMI)를 기초로 상기 채널 상태 정보 기준 신호(CSI-RS) 자원을 할당할 수 있다. 이에 따라, 본 발명의 일 실시예에 따른 고객 유형 기반 고객 응대 방법, 장치, 시스템 및 컴퓨터 프로그램에서 는, 인공지능 컨택 센터(AICC) 등에서 인공지능 상담사가 고객의 대화 특성을 고려하여 적절한 응대를 제공할 수 있게 된다. 보다 구체적으로, 본 발명의 일 실시예에 따른 고객 유형 기반 고객 응대 방법, 장치, 시스템 및 컴퓨터 프로그 램에서는, 상기 고객의 특성에 따라 적절한 방식으로 응대하여 서비스 정상 완결률과 고객의 만족도를 개선할 수 있게 된다.이상에서 설명된 실시예들은 본 발명의 구성 요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성 요소 또 는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성 요소 또는 특징은 다른 구 성 요소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성 요소들 및/또는 특징들을 결합하여 본 발명의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있 다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또 는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 산업상 이용가능성 본 발명은 5G 시스템 뿐만 아니라 다양한 무선 통신 시스템에서 동작하는 기지국과 같은 무선 통신 장치에 적용 될 수 있다."}
{"patent_id": "10-2023-0047496", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부도면은 본 발명에 대한 실시예를 제공하 고, 상세한 설명과 함께 본 발명의 기술적 사상을 설명한다.도 1은 5G 시스템의 자원 그리드를 예시한다. 도 2는 CSI-RS 자원 매핑하는 방법을 예시한다. 도 3은 빔 구성을 예시한다. 도 4는 CSI 보고 과정을 예시한다. 도 5는 본 발명의 일 실시예에 따른 기지국 전력 제어 시스템의 구성도를 예시한다. 도 6은 본 발명의 일 실시예에 따른 기지국 전력 제어 방법의 순서도를 예시한다. 도 7은 본 발명의 일 실시예에 따른 기지국 전력 제어 방법 중 재할당하는 단계에 대한 순서도를 예시한다. 도 8 내지 도 10은 본 발명의 일 실시예에 따른 기지국 전력 제어 방법에 따른 실시예를 예시한다. 도 11은 본 발명의 일 실시예에 따른 기지국 전력 제어 방법이 적용될 수 있는 장치를 예시한다."}
