{"patent_id": "10-2014-0142127", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0046426", "출원번호": "10-2014-0142127", "발명의 명칭": "전자 장치", "출원인": "삼성전자주식회사", "발명자": "허준"}}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 상기 전자 장치에는 사용자 설정에 따라 적어도 두 개의 서로 다른 신호를 가변적으로 검출하는 가변 검출 모듈이 포함되는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 가변 검출 모듈은 사용자 설정에 따라 레드, 그린, 블루 중 적어도 하나의 가시광선을 하나 또는 복합적으로 발광하는 표시등(LEDindicator)으로서 발광하거나, 제스쳐(gesture) 및 모션 중 적어도 어느 하나를 검출하는 제1모드로구동되거나, 사용자 설정에 따라 심박수 및 혈중산소포화도 중 적어도 어느 하나를 포함하는 생체 신호를 검출하는 제2모드로 구동되는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 전자 장치에는 사용자 설정에 따라 상기 가변 검출 모듈을 상기 제1모드 또는 상기 제2모드로 구동되게 제어하고, 상기 가변 검출 모듈의 감지된 신호에 따라 상기 전자 장치를 제어하는 제어부가 포함되는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 가변 검출 모듈은, 상기 전자 장치에 구비되고 광을 발광하는 광원부; 상기 광원부와 이웃하게 구비되는 송신부; 및 상기 송신부와 이웃하게 구비되고, 상기 송신부의 신호를 수신하는 수신부를 포함하는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 광원부는 레드, 그린, 블루 중 적어도 하나 또는 그 이상을 발광하는 제1광원으로 이루어지고, 상기 송신부는 적외선을 발광하는 제2광원으로 이루어지며, 상기 수신부는 포토 다이오드(photo diode)로 이루어지는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 가변 검출 모듈이 상기 제1모드로 구동되는 경우, 상기 송, 수신부는 서로 별개의 구성물로 구동되는 전자공개특허 10-2016-0046426-2-장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 제1광원은 상기 전자 장치의 상태에 따라 레드, 그린, 블루 중 적어도 하나 이상의 광을 발광되게 구동되고, 상기 제2광원 및 상기 포토 다이오드는 근접을 감지하게 구동되는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제어부는 상기 제2광원과 상기 포토 다이오드의 신호 검출에 따라 상기 전자 장치의 표시부를 온/오프되게제어하는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제5항에 있어서, 상기 가변 검출 모듈이 상기 제2모드로 구동되는 경우, 상기 광원부와 상기 송신부는 함께 하나의 송신모듈로 구동되며, 상기 수신부는 상기 송신모듈의 신호를 수신하게 구동되어 상기 송신모듈과 상기 수신부는 사용자의 생체 신호를 검출하게 구동되는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 제1광원은 검출하려는 생체 신호에 따라 레드 또는 그린 중 적어도 하나의 광을 발광하고, 상기 제2광원은상기 제1광원과 함께 적외선을 발광하고, 상기 포토 다이오드는 상기 제1광원과 상기 제2광원에서 발광된 신호에 따라 생체 신호를 수광하는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서, 상기 전자 장치에 구비되고, 사용자 설정에 따라 서비스 광의 발광 및 제스쳐(gesture)를 검출하는 제1모드로구동되거나, 사용자 설정에 따라 생체 신호를 검출하는 제2모드로 구동되는 가변 검출 모듈; 및 상기 가변 검출 모듈을 상기 제1모드 또는 상기 제2모드로 구동되게 제어하고, 상기 가변 검출 모듈의 감지된신호에 따라 상기 전자 장치를 제어하는 제어부를 포함하는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 가변 검출 모듈은, 상기 전자 장치의 표시부 둘레에 구비되어 광을 발광하는 레드, 그린, 블루 중 적어도 하나의 가시광을 발광하는 제1광원; 상기 제1광원과 이웃하게 구비되며, 적외선을 발광하는 제2광원; 및 공개특허 10-2016-0046426-3-상기 제2광원과 이웃하게 구비되는 포토 다이오드를 포함하는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 가변 검출 모듈이 상기 제1모드로 구동되는 경우 상기 제1광원은 서비스 광을 제공하고, 상기 제2광원 및상기 포토다이오드는 근접을 감지하게 서로 별개로 구동되며, 상기 제어부는 상기 제2광원과 상기 포토 다이오드의 검출 신호에 따라 상기 전자 장치의 표시부를 온/오프되게제어하는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서, 상기 가변 검출 모듈이 상기 제2모드로 구동되는 경우, 상기 제1광원과 상기 제2광원은 함께 하나의 송신모듈로구동되고, 상기 포토 다이오드는 상기 송신모듈의 신호를 수신하여 사용자의 생체 신호를 검출하게 구동되는 전자 장치."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따른 전자 장치는, 전자 장치에 있어서, 전자 장치에는 사용자 설정에 따라 적어 도 두 개의 서로 다른 신호를 가변적으로 검출하는 가변 검출 모듈이 포함될 수 있다. 상기와 같은 장치는 실시 예에 따라 더욱 다양하게 구현될 수 있다."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치에 관한 것으로, 예컨데, 다양한 모듈을 구비한 전자 장치에 관한 것이다."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치라 함은, 가전제품으로부터, 전자 수첩, 휴대용 멀티미디어 재생기, 이동통신 단말기, 태블릿 PC, 영 상/음향 장치, 데스크톱 / 랩톱 컴퓨터, 차량용 내비게이션 등, 탑재된 프로그램에 따라 특정 기능을 수행하는 장치를 의미한다. 최근에는, 이동통신 단말기와 같은 전자 장치 하나에 다양한 기능이 탑재되고 있다. 예를 들 면, 휴대 목적의 전자 장치 중 이동통신 단말기에는 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음 악/동영상 재생과 같은 멀티미디어 기능, 모바일 뱅킹 등을 위한 통신 및 보안 기능, 일정 관리나 전자 지갑 등 의 기능이 하나의 전자 장치에 집약되고 있는 것이다. 최근에는 전자 장치를 이용하여 사용자의 생체 신호를 측 정할 수 있는 기능들까지 탑재되고 있다."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래의 전자 장치에는 다양한 센서들과 발광부가 제공된다. 예를 들어, 전자 장치의 전면에 제공되는 디스플레이 장치의 주변 둘레로 근접 센서와 같은 제스쳐 센서 (gesture sensor)가 실장되어 있고, 사용자에게 다양한 신호를 제공할 수 있는 표시등(LED Indicator)이 실장될 수 있다. 또한, 전자 장치에는 심박수를 측정할 수 있는 HRM 센서(Heart Rate Monitor sensor)와 같은 생체 신 호 센서가 실장될 수 있다. 그러나, 이러한 센서들은 전자 장치에 별도로 실장되는 구성이다. 따라서, 각각의 센서들은 전자 장치에서 각각 별도로 실장공간 차지해야 하며, 각각의 실장 공간을 확보해야 할 수 밖에 없다. 또한, 각각의 센서들이 전자 장치에 별도로 제공되어야 하므로, 부품수가 증가될 수 밖에 없다. 상기와 같이, 전체적으로 부품의 수가 증가됨에 따라, 각 부품의 단가에 따른 재료비의 증가를 유발하며, 각각 의 센서들을 전자 장치에 조립해야 하므로, 조립 공정의 수도 증가될 수 밖에 없다. 또한, 상기의 구성들, 서비스 센서, 제스쳐 센서, 생체 신호 센서가 전자 장치의 케이스에 노출되고, 상기의 구 성들이 노출됨으로써, 디자인 상의 고급화가 저하될 수 있고, 디자인 설계 시 제약이 발생될 수 있다. 전자 장치에 실장될 수 있는 다양한 모듈 들 중에는 그 구조가 유사하게 구비될 수 있는 모듈들이 있을 수 있다. 예를 들어, HRM 센서는 송신부와 수신부를 포함할 수 있고, 송신부는 붉은 색 광원(이하 'RED LED' 라 함.)과, 적외선 광원(이하 'IR LED'라 함.)가 각각 구비될 수 있고, 수신부는 PHOTO DIODE로 구비될 수 있다. 이러한, HRM 센서의 구조는 표시등과 제스쳐 센서의 구조와 유사한 구조를 가질 수 있다. RGB(Red, Green, Blue) 의 광을 발광시키는 서비스 센서는 송신부의 RED LED에 대응될 수 있으며, 제스쳐 센서의 송, 수신부는 HRM 센서의 IR LED와 PHOTO DIODE에 각각 대응될 수 있는 것이다. 이에, 본 발명의 다양한 실시 예들은 전자 장치에 제공되는 다양한 모듈들 중 유사한 구조 및 유사한 기능을 구 비한 모듈들을 통합하고, 환경에 따라 가변적으로 기능을 구현할 수 있도록 하는 가변 검출 모듈을 구비한 전자 장치를 제공하고자 한다. 또한, 본 발명의 다양한 실시 예들은 전자 장치에 하나 또는 그 이상의 광원부와, 하나 또는 그 이상의 수신부 및 송신부를 이용하여 사용자 설정에 따라 기능을 가변되도록 하며, 가변됨에 따라 다양한 모드로 구동될 수 있 도록 하는 모듈을 구비한 전자 장치를 제공하고자 한다."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치는, 상기 전자 장치에는 사용자 설정에 따라 적어도 두 개의 서로 다른 신호를 가변적으로 검출하는 가변 검출 모듈이 포함될 수 있다. 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치는, 상기 전자 장치에 구비되고, 사용자 설정 에 따라 서비스 광의 발광 및 제스쳐(gesture)를 검출하는 제1모드로 구동되거나, 사용자 설정에 따라 생체 신 호를 검출하는 제2모드로 구동되는 가변 검출 모듈; 및 상기 가변 검출 모듈을 상기 제1모드 또는 상기 제2모드 로 구동되게 제어하고, 상기 가변 검출 모듈의 감지된 신호에 따라 상기 전자 장치를 제어하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예들에 따른 가변 검출 모듈을 구비한 전자 장치는, 전자 장치에 제공되는 검출 모듈을 사용자 설정에 따라 적어도 두 가지 이상, 예를 들어 제1모드 시에는 전자 장치의 상태 표시 및 제스쳐를 감지 할 수 있고, 제2모드 시에는 사용자의 생체 정보를 검출 할 수 있게 구동될 수 있다. 또한, 하나의 검출 모듈을 통해 적어도 두 가지 이상의 기능으로 구동될 수 있어, 기존의 두 가지 기능을 위해 전자 장치에 별도로 실장되던 모듈들을 하나의 검출 모듈을 통해 구현할 수 있어, 전자 장치에 실장 공간을 최 소화할 수 있다. 또한, 하나의 검출 모듈을 통해 적어도 두 가지 이상의 기능으로 구동될 수 있어, 재료비를 저감시킬 수 있으며, 조립 공정 수를 최소화할 수 있다."}
{"patent_id": "10-2014-0142127", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면과 연관되어 기재된다. 본 발명의 다양한 실시 예는 다양한 변 경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들이 도면에 예시되고 관련된 상세한 설 명이 기재되어 있다. 그러나, 이는 본 발명의 다양한 실시 예를 특정한 실시 형태에 대해 한정하려는 것이 아 니며, 본 발명의 다양한 실시 예의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포 함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사 용되었다. 본 발명의 다양한 실시 예에서 사용될 수 있는“포함한다” 또는 “포함할 수 있다” 등의 표현은 개시 (disclosure)된 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시 예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것 이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존 재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시 예에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한 다. 예를 들어, “A 또는 B”는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시 예에서 사용된 “제 1,”“제2,”“첫째,”또는“둘째,”등의 표현들은 다양한 실시 예 들의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서 로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시 예의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소 가 상기 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 새로운 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시 예에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명의 다양한 실시 예를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 다양한 실시 예가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미 를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시 예에서 명백하게 정의되지 않 는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시 예에 따른 전자 장치는, 전자 장치의 상태에 따라 발광되는 색을 통해 제공되는 기능을 가지거나, 제스쳐를 감지하거나, 생체 신호를 감지하는 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스마트 폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상전화기, 전자 북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 전자 문신, 또는 스마 트 와치(smart watch))중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 전자 장치의 상태에 따른 다양한 색을 발광하는 표시등의 기능을 갖추거 나, 제스쳐 감지 또는 생체 신호 감지 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파 스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛, 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine) 또는 상점의 POS(point of sales) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에 따르면, 전자 장치는, 전자 장치의 상태에 따라 발광되는 색을 통해 제공되는 기능을 가지거 나, 제스쳐를 감지하거나, 생체 신호를 감지하는 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전 자 보드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터 (projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치는 플렉서블 장치일 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시 예에서 이용 되는 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치) 를 지칭할 수 있다. 도 1은 다양한 실시 예에 따른, 전자 장치를 포함하는 네트워크 환경를 도시한다. 도 1을 참조하면, 상기 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 통신 인 터페이스 및 가변 검출 모듈을 포함할 수 있다. 상기 버스는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달 하는 회로일 수 있다.상기 프로세서는, 예를 들면, 상기 버스를 통해 전술한 다른 구성요소들(예: 상기 메모리, 상기 입출력 인터페이스, 상기 디스플레이, 상기 통신 인터페이스, 또는 가변 검출 모듈170 등)로부 터 명령을 수신하여, 수신된 명령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 상기 메모리는, 상기 프로세서 또는 다른 구성요소들(예: 상기 입출력 인터페이스, 상기 디스플 레이, 상기 통신 인터페이스, 또는 상기 가변 검출 모듈 등)로부터 수신되거나 상기 프로세서 또는 다른 구성요소들에 의해 생성된 명령 또는 데이터를 저장할 수 있다. 상기 메모리는, 예를 들 면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API: application programming interface, 133) 또는 어플리케이션 등의 프로그래밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래 밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 상기 커널은 나머지 다른 프로그래밍 모듈들, 예를 들면, 상기 미들웨어, 상기 API 또는 상기 어플리케이션에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 상기 버스, 상 기 프로세서 또는 상기 메모리 등)을 제어 또는 관리할 수 있다. 또한, 상기 커널은 상기 미들 웨어, 상기 API 또는 상기 어플리케이션에서 상기 전자 장치의 개별 구성요소에 접근하여 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 상기 미들웨어는 상기 API 또는 상기 어플리케이션이 상기 커널과 통신하여 데이터를 주고 받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 상기 미들웨어는 상기 어플리케이션로부터 수신 된 작업 요청들과 관련하여, 예를 들면, 상기 어플리케이션 중 적어도 하나의 어플리케이션에 상기 전자 장치의 시스템 리소스(예: 상기 버스, 상기 프로세서 또는 상기 메모리 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 제어(예: 스케쥴링 또는 로드 밸런싱)을 수 행할 수 있다. 상기 API는 상기 어플리케이션이 상기 커널 또는 상기 미들웨어에서 제공되는 기능을 제어 하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함수(예: 명령어)를 포함할 수 있다. 다양한 실시 예에 따르면, 상기 어플리케이션는 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리 케이션, 알람 어플리케이션, 건강 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리 케이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함 할 수 있다. 추가적으로 또는 대체적으로, 상기 어플리케이션은 상기 전자 장치와 외부 전자 장치 (예: 전자 장치) 사이의 정보 교환과 관련된 어플리케이션일 수 있다. 상기 정보 교환과 관련된 어플리케 이션은, 예를 들어, 상기 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리 케이션, 또는 상기 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 상기 알림 전달 어플리케이션은 상기 전자 장치 의 다른 어플리케이션(예: SMS/MMS 어플리케이 션, 이메일 어플리케이션, 건강 관리 어플리케이션 또는 환경 정보 어플리케이션 등)에서 발생한 알림 정보를 외부 전자 장치(예: 전자 장치)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 알 림 전달 어플리케이션은, 예를 들면, 외부 전자 장치(예: 전자 장치)로부터 알림 정보를 수신하여 사용자 에게 제공할 수 있다. 상기 장치 관리 어플리케이션은, 예를 들면, 상기 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치)의 적어도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴온/ 턴오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 상기 외부 전자 장치에서 동작하는 어플리케이션 또는 상 기 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또는 업 데이트)할 수 있다. 다양한 실시 예에 따르면, 상기 어플리케이션은 상기 외부 전자 장치(예: 전자 장치)의 속성(예: 전 자 장치의 종류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경우, 상기 어플리케이션은 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장 치가 모바일 의료기기인 경우, 상기 어플리케이션은 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실시 예에 따르면, 상기 어플리케이션은 전자 장치에 지정된 어플리케이션 또는 외부 전자 장치 (예: 서버 또는 전자 장치)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 상기 입출력 인터페이스은, 입출력 장치(예: 센서, 키보드 또는 터치 스크린)를 통하여 사용자로부터 입력 된 명령 또는 데이터를, 예를 들면, 상기 버스를 통해 상기 프로세서, 상기 메모리, 상기 통신 인터페이스, 또는 상기 가변 검출 모듈에 전달할 수 있다. 예를 들면, 상기 입출력 인터페이스(14 0)은 터치 스크린을 통하여 입력된 사용자의 터치에 대한 데이터를 상기 프로세서로 제공할 수 있다. 또한, 상기 입출력 인터페이스은, 예를 들면, 상기 버스을 통해 상기 프로세서, 상기 메모리 , 상기 통신 인터페이스, 또는 상기 가변 검출 모듈로부터 수신된 명령 또는 데이터를 상기 입 출력 장치(예: 스피커 또는 디스플레이)를 통하여 출력할 수 있다. 예를 들면, 상기 입출력 인터페이스은 상기 프로세서를 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력할 수 있다. 상기 디스플레이은 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있 다. 상기 통신 인터페이스은 상기 전자 장치와 외부 장치(예: 전자 장치 또는 서버) 간의 통신 을 연결할 수 있다. 예를 들면, 상기 통신 인터페이스은 무선 통신 또는 유선 통신을 통해서 네트워크 에 연결되어 상기 외부 장치와 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예 를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 네트워크는 통신 네트워크(telecommunications network)일 수 있다. 상기 통 신 네트워크 는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또 는 전화망(telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 전자 장치와 외부 장치 간의 통신을 위한 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 어플리케이션, 어플리케이션 프로그래밍 인터페이스, 상기 미들웨어 , 커널 또는 통신 인터페이스 중 적어도 하나에서 지원될 수 있다. 상기 가변 검출 모듈은, 이하의 도면 2 내지 도 11을 통해 좀더 구체적으로 설명한다. 도 2는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 전면을 나타내는 도면이다. 도 3은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 개략적인 블록도이다. 도 2 및 도 3을 참조하면, 본 발명의 다양한 실시 예에 따른 전자 장치는 그 전면에 화면을 표시하고, 상황 에 따라 터치 등을 통해 입력 구현을 가능하게 할 수 있는 표시부가 제공되고, 표시부의 주변 둘레로 카메라, 스피커 및 마이크(미도시)가 구비될 수 있다. 본 발명의 일 실시 예에 따른 전자 장치에는 가변 검출 모듈과, 제어부를 포함할 수 있다. 본 발 명의 실시 예에 따른 가변 검출 모듈은 표시부의 주변 둘레, 예를 들어 전자 장치의 전면 상부에 제공되는 스피커에 이웃하게 가변 검출 모듈이 실장되는 것을 예를 들어 설명한다. 그러나, 본 발명의 일 실시 예에 따른 가변 검출 모듈은 전자 장치의 어느 위치나 실장될 수 있는 구성으로 그 실장 위치 는 얼마든지 가변이나 변형이 가능할 것이다. 여기서 도면 부호 '200'은 '170'에 대응될 수 있다. 가변 검출 모듈은 제1발광부와, 제2발광부 및 수광부를 포함할 수 있으며, 가변 검출 모듈 은 사용자 설정에 따라 적어도 두 개의 서로 다른 신호를 가변적으로 검출될 수 있게 구비될 수 있다. 본 발명의 일 실시 예에 따른 가변 검출 모듈은 설정에 따라 서로 다른 신호를 가변적으로 검출할 수 있도 록, 상기 제1발광부와 제2발광부 및 수광부의 구성은 사용자 설정에 따라 별개로 구동되거나 함 께 구동될 수 있다. 가변 검출 모듈은 사용자의 제1설정 또는 제2설정에 따라 제1발광부와, 제2발광 부 및 수광부가 별개의 구성물로 구동되거나, 제1발광부와, 제2발광부 및 수광부가 하나의 구성물로 구동될 수 있다. 여기서 '별개의 구성물'이라는 것은 서로가 서로에게 영향을 미치지 않게 구 동되는 것을 의미할 수 있다. 즉, 제1발광부는 제2발광부 및 수광부의 구동과는 별개로 구동될 수 있고, 제2발광부 및 수광부는 제1발광부의 구동과는 별개로 신호를 검출하는 '근접센서'로서 구동될 수 있다. 또한, '하나의 구성물'이라는 것은 각각의 구성들이 서로 연계되어 구동되는 것을 의미할 수 있다. 즉, 제1발광부와 제2발광부 및 수광부가 신호를 검출하는 하나의 '센서', 본 발명의 일 실시 예에서는 생체 신호를 검출할 수 있는 '생체 검출 센서'로서 구동될 수 있다. 상기의 가변 검출 모듈은 사용자 설정에 따라 제1모드(M1)로서 제1발광부와 제2발광부 및 수광 부의 서로 별개로 구동될 수 있다. 예를 들어 제1발광부에서 레드, 그린, 블루 중 적어도 하나의 가 시광선을 하나 또는 복합적으로 발광하여 표시등(LED indicator)으로서 구동될 수 있다. 또한, 제2발광부 와 수광부는 제스쳐(gesture) 및/또는 모션을 검출하도록 구동될 수 있다. 또한, 가변 검출 모듈은 사용자 설정에 따라 제2모드(M2)로서 제1발광부, 제2발광부 및 수광부가 하나의 구성물로 구동 될 수 있다. 예를 들어, 제1발광부 및 제2발광부에서 발광된 광이 송신되고, 이에 따라 수광부 가 수신되어 심박수 또는/및 혈중산소포화도 중 적어도 하나를 포함하는 생체 신호를 검출하도록 구동될 수 있 다. 제어부는 사용자 설정에 따라(도 3 참조) 상기 가변 검출 모듈을 상기 제1모드(M1) 또는 상기 제2모 드(M2)로 구동되게 제어할 수 있고, 가변 검출 모듈의 감지된 신호에 따라 상기 전자 장치, 구체적으 로 표시부를 제어할 수 있다. 도 3은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 구동을 나타내는 블록도이다. 도 3을 참조하면, 앞서 언급한 바와 같이, 본 발명의 하나의 실시 예에 따른 전자 장치는 하나의 가변 검출 모듈을 통해 서로 다른 신호를 검출할 수 있다. 사용자는 사용자 설정을 통해 가변 검출 모듈의 설정 모드를 변경할 수 있다. 사용자가 제1설정모드 또는 제2설정모드를 설정하면, 제어부는 선택된 설정모드에 따라 가변 검출 모듈의 구동 모드를 제어할 수 있다. 예를 들어, 사용자가 사용자 설정 중, 제1설정모드를 선택하면, 선택된 값은 제어부로 인가되고, 제어부는 가변 검출 모듈을 제1모드(M1)로 구동되도 록 가변 검출 모듈의 구동을 제어할 수 있다. 또한, 사용자가 사용자 설정 중, 제2설정모드를 선택하면, 선택된 값은 제어부로 인가되고, 제어부는 가변 검출 모듈을 제2모드(M2)로 구동되도록 가변 검 출 모듈의 구동을 제어할 수 있다. 제1설정모드의 선택에 따라 가변 검출 모듈이 제1모드(M1)로 구동 되는 경우, 제1발광부는 전자 장치의 상태를 표시할 수 있도록 표시등으로서 발광하게 구동되며, 제2 발광부 및 수광부는 모션 또는 근접을 감지하는 감지장치로서 구동될 수 있다. 또한, 제2설정모드의 선택에 따라 가변 검출 모듈이 제2모드(M2)로 구동되는 경우, 제1발광부와 제2발광부는 생체 신 호 검출을 위한 발광부로서 구동되고, 발광부 및 수광부는 생체 신호를 검출하는 감지장치로서 구동될 수 있다. 제1발광부는 레드, 그린, 블루 중 적어도 하나 또는 그 이상을 발광하는 제1광원으로 이루어질 수 있다. 제1광원은 레드, 그린, 블루의 색을 발광하는 광원으로 이루어질 수 있다. 제1광원은 하나의 광모듈에서 레드와 블루와 그린의 광이 발광되도록 구비될 수 있다. 또한, 이와는 달리 제1광원은 레드, 그린, 블루의 광을 발광하 는 광원들이 각각 구비되어 각각의 광원들에서 레드와 블루와 그린의 광이 발광되도록 구비될 수 있다. 제1광원 은 사용자 설정에 따라 전자 장치의 상태를 제공하는 표시등(LED Indicator)으로 구동되거나, 후술하는 제2광원 과 함께 구동되어 생체 신호를 검출하는 발광부의 일부 구성물로 구동될 수 있다. 예를 들어, 제1광원은 제1모드(M1) 시 전자 장치의 상태를 표시할 수 있도록 레드, 그린, 블루의 광들 중 적어 도 하나의 가시광선을 하나 또는 복합적으로 설정 상태에 따라 발광될 수 있다. 예를 들어, 제1광원은 배터리 충전 유무의 상태를 표시할 수 있는 표시등으로 구동될 수 있다. 배터리를 충전하고 있는 상태에서는 레드 광원 이 발광될 수 있고, 배터리의 충전이 완료된 상태에서는 그린 광원이 발광될 수 있다. 또한, 예를 들어 제1광원 은 전자 장치의 통신 수, 발신 여부의 상태를 표시할 수 있는 표시등으로 구동될 수 있다. 전자 장치에 메 시지가 도착하였거나, 별도의 알림 상태를 요하는 경우, 레드와, 그린, 블루의 광이 서로 교차로 발광되어 사용 자에게 알림을 제공하는 표시등으로 구동될 수 있다. 상술한 예들은 제1광원이 제1모드(M1)로 구동됨에 따라 설 정될 수 있는 표시등의 일부 예일 뿐이며, 표시등의 설정에 따라 제1광원의 발광여부는 얼마든지 변경이나 변형 이 가능할 것이다. 또한, 1광원은 제2모드(M2) 시 검출하고자 하는 생체 신호 정보에 따라 레드 또는 그린의 광들 중 하나의 광을 발광하게 구동될 수 있다. 예를 들어 제1광원은 생체 정보 중 사용자의 혈중 산소 포화도를 검출하기 위해서 그 린의 광을 발광하도록 구동될 것이다. 또한, 제1광원은 생체 정보 중 사용자의 심박수를 검출하기 위해서 레드 의 광을 발광하도록 구동될 것이다. 제2발광부는 제1발광부, 제1광원과 이웃하게 배치될 수 있다. 제2발광부가 제1발광부에 인 접하여 이웃하게 배치됨으로써, 제2모드 시 제2발광부는 제1발광부와 함께 특정 파장의 광을 발광하여 생체 신호를 검출 할 수 있게 구동될 수 있다. 제2발광부는 제1모드(M1)에서 근접 신호를 감지하기 위 해, 제2모드(M2)에서 생체신호를 감지하기 위해 특정 파장의 광을 발광하는 제2광원으로 이루어질 수 있다. 수광부는 제2발광부에 이웃하게 실장되고, 제1모드(M1) 시에는 제2광원에서 송신된 신호를 수신하며, 제2모드(M2) 시에는 제1광원 및 제2광원에서 함께 송신된 신호를 수신하는 구성으로 포토 다이오드(photo diode)로 이루어질 수 있다. 가변 검출 모듈은 전자 장치의 전면을 기준으로 좌측에서 우측으로 제1광원부와 제2광원부 및 수광부의 순서로 실장될 수 있다(도 2(a) 참조). 이와는 달리, 가변 검출 모듈은 전자 장치의 전면을 기준으로 우측에서 좌측으로 제1광원부, 제2광원부 및 수광부의 순서로 실장될 수 있다 (도 2(b) 참조). 상술했듯이, 제어부는 사용자 설정에 따라 상기 가변 검출 모듈을 상기 제1모드(M1) 또는 상기 제2모 드(M2)로 구동되게 제어하고, 가변 검출 모듈의 감지된 신호에 따라 상기 전자 장치를 제어할 수 있다. 도 5는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제1모드로 구동되는 상태를 나타내 는 도면이다. 도 6은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제1모드로 구동되는 상태를 나타내는 블록도이다. 도 5 및 도 6을 참조하면, 제어부의 인가에 따라 가변 검출 모듈이 제1모드(M1)로 구동되게 제어되면, 제 어부는 제1발광부와, 제2발광부 및 수광부가 각각 별개로 구동되도록 제어할 수 있다. 즉, 제어부는 제1발광부를 설정에 따른 표시등(이하 '서비스 광' 또는 '서비스 광원'이라고도 함.) 발광 하도록 제어하며, 제2발광부 및 수광부는 근접을 감지할 수 있는 검출 수단으로 구동되도록 제어한다. 이에, 제1발광부는 레드, 그린, 블루 중 적어도 하나 또는 이들이 교차적으로 발광되도록 구동 되어 전자 장치의 상태를 나타낼 수 있게 표시등으로 구동될 수 있다. 또한, 제2발광부 및 수광부는 슬립모드(Sleep Mode Operation)와 웨이크업 모드(Wake Up Mode Operation)로 구동될 수 있다. 예를 들어 제2 발광부 및 수광부는 근접 센서로서 구비되나, 별도의 신호가 인가되지 않는 경우 제2발광부 및 수광부는 슬립모드로 구동되어, 언제든지 인가된 신호를 감지할 수 있는 상태로 유지될 수 있다. 슬립모드 상태의 제2발광부와 수광부로 근접이나 터치 등의 신호가 인가되면 제2발광부와 수광부는 웨이크업 모드로 전환되고, 입력되는 신호를 검출하도록 구동될 것이다. 제2발광부 및 수광부의 실장 위치로 물체, 예를 들어 사용자의 뺨 등이 근접되어 웨이크업 모드로서 신호를 검출하면, 검출된 신호는 제어부로 인가된다. 제어부는 제1모드(M1)에 따라 제2발광부 및 수광부에서 검출된 신호를 인가받고, 제어부로 인가된 검출 값에 따라 표시부를 온/ 오프할 수 있게 제어할 수 있다(도 3 참조). 도 7은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제2모드로 구동되는 상태를 나타내 는 도면이다. 도 8은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제2모드로 구동되는 상태를 나타내는 블록도이다. 도 7 및 도 8을 참조하면, 사용자 설정으로 인해 제어부가 가변 검출 모듈을 제2모드(M2)로 구동되게 제어하면, 제어부는 제1발광부와, 제2발광부 및 수광부를 생체 신호를 감지할 수 있는 검 출 수단으로 함께 구동되도록 제어할 수 있다. 즉, 제2모드(M2)에서 가변 검출 모듈은 제1발광부와 제2발광부를 포함하는 발광부가 하나의 송신부로서 기능을 수행하게 구동될 수 있고, 수광부는 발광부에서 송신된 신호를 수광하게 구동될 수 있다. 이에, 발광부와 수광부는 사용자의 생체 신호를 감지할 수 있도록 구동될 수 있다. 가변 검출 모듈이 제2모드(M2)로 구동되게 설정되면, 제1광원과 제2광원은 발광부로서 구동되고, 수광부는 발광부의 광을 수광하도록 구동된다. 사용자의 손가 락이 발광부와 수광부에 놓이며, 발광부 중 제1광원은 레드 또는 그린 중 하나의 가시 광선을 발광하며, 제2광원은 적외선을 발광할 수 있다. 검출하고자 하는 생체 신호에 따라 제1광원에서는 레드 또는 그 린의 가시광선이, 제2광원에서는 적외선이 함께 발광될 수 있다. 수광부는 상기 발광부에서 발광된 신호를 수광할 수 있다. 제어부는 제1, 2광원 및 수광부에서 검출된 신호에 따라 표시부에 사용 자 생체 정보가 표시될 수 있게 제어할 수 있다(도 3 참조). 상기의 구성을 가진 전자 장치의 동작과정을 도 9 내지 도 11을 참조하여 설명한다. 도 9는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 구동 흐름도이다. 도 9를 참조하면, 상기 전자 장치의 사용자 설정을 입력하여 가변 검출 모듈의 구동 모드를 가변할 수 있 다(S10). 사용자 설정에 따라 제어부는 가변 검출 모듈을 제1모드 또는 제2모드로 구동될 수 있게 제어할 수 있다(S20). 즉, 가변 검출 모듈은 사용자 설정에 따라 표시등의 발광 및 제스쳐를 감지할 수 있게 설정 되거나, 생체 신호를 검출 할 수 있게 설정될 수 있다. 더불어 가변 검출 모듈은 전자 장치에 전원이 인가되면 상기의 두 가지 모드 중 적어도 하나의 모드로 구동될 수 있게 설정될 수 있다(S30, S40). 예컨데, 사용자가 매번 생체 신호를 감지할 필요성은 없으므로, 일반적인 상황, 즉, 생체 신호를 감지할 필요가 없는 일반적인 전자 장치의 사용 환겨에서 가변 검출 모듈은 제1모드(M1)로 구동되게 설정될 수 있다. 도 10은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치에서 가변 검출 모듈의 제1모드 구동 흐름도이다. 도 10을 참조하면, 가변 검출 모듈이 전자 장치에서 제1모드(M1)로 구동되게 설정되면(A), 제1발광부 는 사용자에게 전자 장치의 구동 상태 또는 사용 상태를 시각적으로 제공할 수 있도록 구동될 수 있다 (S31). 또한, 제2발광부 및 수광부는 제스쳐를 감지하는 근접 센서로서 구동될 것이다(S32). 이에, 제1발광부는 배터리를 충전하는 중이거나 완료 시, 설정에 따라 레드와 그린의 광원을 각각 발광할 수 있 다. 또한, 제1발광부는 전자 장치에 통화가 수신되는 경우, 설정에 따라 레드, 그린, 블루를 서로 반 복적으로 발광할 수 있다. 전화 통화가 이루어질 때, 사용자의 뺨은 전자 장치의 전면에 근접하게 위치됨으 로써, 제2발광부 및 수광부는 사용자의 뺨을 감지할 수 있다. 제2발광부 및 수광부에서 감지된 신호는 제어부에 인가되고, 제어부는 표시부로의 전 원을 온/오프되게 제어할 수 있다(S33). 이에 따라 전자 장치는 구동되면서 사용하지 않는 표시부는 오 프 될 수 있어 전력 소모를 최소화할 수 있다.. 본 발명의 다양한 실시 예에서 제2발광부 및 수광부가 근접을 감지할 수 있게 구비되는 경우, 표시부 의 전원이 온/오프되는 것을 예를 들어 설명하였으나, 이에 한정되는 것은 아니다. 예를 들어, 제2발광부 및 수광부에서 감지에 따라 표시부에 사용자 환경(User Interface)이 실행될 수도 있는 등 얼마 든지 그 설정 값은 가변될 수 있을 것이다. 도 11은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치에서 가변 검출 모듈의 제2모드 구동 흐름도이다. 도 11을 참조하면, 가변 검출 모듈이 전자 장치에서 제2모드(M2)로 구동되게 설정되면(B), 제1발광부 와 제2발광부는 하나의 발광부로서 구동되고, 수광부는 상기 발광부의 송신 신호를 수광하도록 구동되어, 발광부와, 수광부가 생체 검출 센서로서 구동될 수 있다(S41). 발광부과 수광부 상에 물체, 예를 들어 사용자의 손가락이 놓이면, 발광부, 구체적으로 제1광원 과 제2광원에서는 레드 또는 그린의 가시광선과 적외선이 함께 발광될 수 있다. 제1광원 및 제2광원에서 발광된 가시광선과 적외선은 사용자의 손가락으로 발광될 수 있고, 수광부는 사용자의 혈소판 등에서 반사된 광을 수광할 수 있다. 이에, 제1, 2공원 및 수광부를 통해 생체 신호 정부가 검출될 수 있다(S42). 발광부 및 수광부에서 검출된 신호에 따라 제어부는 사용자의 생체 정보를 표시부에 표시할 수 있게 제 어할 수 있다(S43). 따라서, 사용자는 표시부를 통해 심박수나 혈중 산호 포화도 등의 정보를 확인할 수 있 다. 상술한 바와 같이, 본 발명의 다양한 실시 예에 따른 가변 검출 센서는 제1발광부, 제2발광부 및 수 광부의 구성을 통해 각각 두 개의 서로 다른 신호를 검출 할 수 있다. 즉, 전자 장치에 실장되는 제1 발광부, 제2발광부 및 수광부의 구동 상태에 따라 표시등 및 근접을 감지할 수 있는 제1모드 (M1)로 구동될 수 있고, 생체 신호를 검출 할 수 있는 제2모드(M2)로 구동될 수 있다. 도 12는 다양한 실시 예들에 따른 전자 장치의 블록도 800를 도시한다. 상기 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 구성할 수 있다. 도 12를 참조하면, 상기 전자 장치 는 하나 이상의 어플리케이션 프로세서(AP: application processor) 810, 통신 모듈, SIM(subscriber identification module) 카드 824, 메모리, 센서 모듈, 입력 장치, 디스플레이 , 인터페이스, 오디오 모듈, 카메라 모듈, 전력관리 모듈, 배터리, 인디케이터 및 모터를 포함할 수 있다. 상기 AP는 운영체제 또는 응용 프로그램을 구동하여 상기 AP에 연결된 다수의 하드웨어 또는 소프트 웨어 구성요소들을 제어할 수 있고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. 상기 AP는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 한 실시 예에 따르면, 상기 AP는 GPU(graphic processing unit, 미도시)를 더 포함할 수 있다. 상기 통신 모듈(예: 상기 통신 인터페이스)은 상기 전자 장치(예: 상기 전자 장치)와 네트 워크를 통해 연결된 다른 전자 장치들(예: 전자 장치 또는 서버) 간의 통신에서 데이터 송수신을 수 행할 수 있다. 한 실시 예에 따르면, 상기 통신 모듈은 셀룰러 모듈, Wifi 모듈, BT 모듈 , GPS 모듈, NFC 모듈 및 RF(radio frequency)모듈를 포함할 수 있다. 상기 셀룰러 모듈은 통신망(예: LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 등)을 통해서 음성 통화, 영상 통화, 문자 서비스 또는 인터넷 서비스 등을 제공할 수 있다. 또한, 상기 셀룰러 모듈은, 예를 들면, 가입자 식별 모듈(예: SIM 카드)을 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수 행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈은 상기 AP가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 예를 들면, 상기 셀룰러 모듈은 멀티 미디어 제어 기능의 적어도 일부를 수 행할 수 있다. 한 실시 예에 따르면, 상기 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 또한, 상기 셀룰러 모듈은, 예를 들면, SoC로 구현될 수 있다. 도 8에서는 상기 셀룰러 모듈 (예: 커뮤니케이션 프로세서), 상기 메모리 또는 상기 전력관리 모듈 등의 구성요소들이 상기 AP와 별개의 구성요소로 도시되어 있으나, 한 실시 예에 따르면, 상기 AP가 전술한 구성요소들의 적 어도 일부(예: 셀룰러 모듈)를 포함하도록 구현될 수 있다. 한 실시 예에 따르면, 상기 AP 또는 상기 셀룰러 모듈(예: 커뮤니케이션 프로세서)은 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드 (load)하여 처리할 수 있다. 또한, 상기 AP 또는 상기 셀룰러 모듈은 다른 구성요소 중 적어도 하나 로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 상기 Wifi 모듈, 상기 BT 모듈, 상기 GPS 모듈 또는 상기 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 도 12에서는 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈이 각각 별개의 블록으로 도시되 었으나, 한 실시 예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모 듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. 예를 들면, 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 또는 NFC 모듈 각각에 대응 하는 프로세서들 중 적어도 일부(예: 셀룰러 모듈에 대응하는 커뮤니케이션 프로세서 및 Wifi 모듈에 대응하는 Wifi 프로세서)는 하나의 SoC로 구현될 수 있다. 상기 RF 모듈는 데이터의 송수신, 예를 들면, RF 신호의 송수신을 할 수 있다. 상기 RF 모듈는, 도 시되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. 또한, 상기 RF 모듈는 무선 통신에서 자 유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 도 12에서는 셀룰러 모듈, Wifi 모듈, BT 모듈, GPS 모듈 및 NFC 모듈이 하나의 RF 모듈을 서로 공유하는 것으로 도시되어 있으나, 한 실시 예에 따르면, 셀룰러 모듈, Wifi 모듈, BT 모듈 , GPS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호의 송수신을 수행 할 수 있다. 상기 SIM 카드는 가입자 식별 모듈을 포함하는 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. 상기 SIM 카드는 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 상기 메모리(예: 상기 메모리)는 내장 메모리 또는 외장 메모리를 포함할 수 있다. 상기 내장 메모리는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electricallyerasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 한 실시 예에 따르면, 상기 내장 메모리는 Solid State Drive (SSD)일 수 있다. 상기 외장 메모리 는 flash drive, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital) 또는 Memory Stick 등을 더 포함할 수 있다. 상기 외장 메모리는 다양한 인터페이스를 통하여 상기 전자 장치과 기능적으로 연결될 수 있다. 한 실시 예에 따르면, 상기 전자 장치는 하드 드라이브와 같은 저장 장치(또는 저장 매체)를 더 포함할 수 있다. 상기 센서 모듈은 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 상기 센서 모듈은, 예를 들면, 제스처 센서(840A), 자이로 센서(840B), 기 압 센서(840C), 마그네틱 센서(840D), 가속도 센서(840E), 그립 센서(840F), 근접 센서(840G), color 센서 840H(예: RGB(red, green, blue) 센서), 생체 센서(840I), 온/습도 센서(840J), 조도 센서(840K) 또는 UV(ultra violet) 센서(840M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 상기 센서 모 듈은, 예를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서(electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시), IR(infra red) 센 서(미도시), 홍채 센서(미도시) 또는 지문 센서(미도시) 등을 포함할 수 있다. 상기 센서 모듈은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 입력 장치은 터치 패널(touch panel, 852), (디지털) 펜 센서(pen sensor, 854), 키(key) 856 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 상기 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 또한, 상기 터치 패널 은 제어 회로를 더 포함할 수도 있다. 정전식의 경우, 물리적 접촉 또는 근접 인식이 가능하다. 상기 터 치 패널은 택타일 레이어(tactile layer)를 더 포함할 수도 있다. 이 경우, 상기 터치 패널은 사용 자에게 촉각 반응을 제공할 수 있다. 상기 (디지털) 펜 센서는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법 또는 별도 의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 상기 키 856는, 예를 들면, 물리적인 버튼, 광학식 키 또는 키패드를 포함할 수 있다. 상기 초음파(ultrasonic) 입력 장치는 초음파 신호를 발생하는 입력 도구를 통 해, 전자 장치에서 마이크(예: 마이크)로 음파를 감지하여 데이터를 확인할 수 있는 장치로서, 무선 인식이 가능하다. 한 실시 예에 따르면, 상기 전자 장치는 상기 통신 모듈를 이용하여 이와 연결된 외부 장치(예: 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 상기 디스플레이(예: 상기 디스플레이)는 패널, 홀로그램 장치 또는 프로젝터을 포함 할 수 있다. 상기 패널은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 상기 패널은, 예를 들면, 유연하게(flexible), 투명하게 (transparent) 또는 착용할 수 있게(wearable) 구현될 수 있다. 상기 패널은 상기 터치 패널과 하 나의 모듈로 구성될 수도 있다. 상기 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 상기 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 상기 스크린은, 예를 들면, 상기 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시 예에 따르면, 상기 디스플레이은 상기 패널, 상기 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 상기 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface, 872), USB(universal serial bus, 874), 광 인터페이스(optical interface, 876) 또는 D-sub(D-subminiature, 878)를 포함할 수 있 다. 상기 인터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적으로, 상기 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure Digital) 카드/MMC(multi-media card) 인터페이스 또는 IrDA(infrared data association) 규격 인터 페이스를 포함할 수 있다. 상기 오디오 모듈은 소리(sound)와 전기신호를 쌍방향으로 변환시킬 수 있다. 상기 오디오 모듈의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 상기 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰 또는 마이크 등을 통해 입력 또는 출력 되는 소리 정보를 처리할 수 있다. 상기 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시 예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈(미도시), ISP(image signal processor, 미도시) 또는 플래 쉬 (flash, 미도시)(예: LED 또는 xenon lamp)를 포함할 수 있다. 상기 전력 관리 모듈은 상기 전자 장치의 전력을 관리할 수 있다. 도시하지는 않았으나, 상기 전력 관리 모듈은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. 상기 PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분 될 수 있다. 상기 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 한 실시 예에 따르면, 상기 충전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등이 있으며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로 또는 정류기 등의 회로 가 추가될 수 있다. 상기 배터리 게이지는, 예를 들면, 상기 배터리의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 상기 배터리는 전기를 저장 또는 생성할 수 있고, 그 저장 또는 생성된 전기를 이용하여 상기 전자 장치 에 전원을 공급할 수 있다. 상기 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 또는 태양 전지(solar battery)를 포함할 수 있다. 상기 인디케이터는 상기 전자 장치 혹은 그 일부(예: 상기 AP)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 상기 모터는 전기적 신호를 기계적 진동으로 변 환할 수 있다. 도시되지는 않았으나, 상기 전자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함 할 수 있다. 상기 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 발명의 다양한 실시 예에 따른 전자 장치의 전술한 구성요소들 각각은 하나 또는 그 이상의 부품(componen t)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 본 발명의 다 양한 실시 예에 따른 전자 장치는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요 소가 생략되거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 또한, 본 발명의 다양한 실시 예에 따른 전자 장치의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 13은 다양한 실시 예들에 따른 복수의 전자 장치들(예: 전자 장치 및 전자 장치) 사이의 통신 프 로토콜을 도시한다. 도 13을 참조하면, 예를 들어, 상기 통신 프로토콜은, 장치 발견 프로토콜 (device discovery protocol, 951), 기능 교환 프로토콜(capability exchange protocol, 953), 네트워크 프로 토콜(network protocol, 955) 및 어플리케이션 프로토콜(application protocol, 957) 등을 포함할 수 있다. 한 실시 예에 따르면, 상기 장치 발견 프로토콜은 전자 장치들(예: 전자 장치 또는 전자 장치) 이 자신과 통신 가능한 외부 전자 장치를 감지하거나 감지된 외부 전자 장치와 연결하기 위한 프로토콜일 수 있 다. 예를 들어, 전자 장치(예: 전자 장치)은, 상기 장치 발견 프로토콜을 이용하여, 상기 전자 장치에서 사용 가능한 통신 방법(예: Wifi, BT 또는 USB 등)을 통해, 상기 전자 장치와 통신 가능한 기기(device)로, 전자 장치(예: 전자 장치)를 감지할 수 있다. 상기 전자 장치는, 상기 전자 장치과의 통신 연결을 위해, 상기 장치 발견 프로토콜을 이용하여, 감지된 전자 장치에 대한 식 별 정보를 획득하여 저장할 수 있다. 상기 전자 장치는, 예를 들면, 적어도 상기 식별 정보에 기반하여, 상기 전자 장치와의 통신 연결을 개설할 수 있다. 어떤 실시 예에 따르면, 상기 장치 발견 프로토콜은 복수의 전자 장치들 사이에서 상호 인증을 하기 위한 프로토콜일 수 있다. 예를 들어, 전자 장치는 적어도 전자 장치와 연결을 위한 통신 정보(예: MAC(media access control) address, UUID(universally unique identifier), SSID(subsystem identification), IP(information provider) address)에 기반하여, 상기 전자 장치와 상기 전자 장치 간의 인증을 수행할 수 있다. 한 실시 예에 따르면, 상기 기능 교환 프로토콜은 전자 장치 또는 전자 장치 중 적어도 하나에 서 지원 가능한 서비스의 기능과 관련된 정보를 교환하기 위한 프로토콜일 수 있다. 예를 들어, 전자 장치 및 전자 장치은 상기 기능 교환 프로토콜을 통하여, 각각이 현재 제공하고 있는 서비스의 기능과 관련된 정보를 서로 교환할 수 있다. 교환 가능한 정보는 전자 장치 및 전자 장치에서 지원 가능 한 복수의 서비스들 중에서 특정 서비스를 가리키는 식별 정보를 포함할 수 있다. 예를 들어, 전자 장치 는 상기 기능 교환 프로토콜을 통해 전자 장치로부터 상기 전자 장치가 제공하는 특정 서비스의 식별 정보를 수신할 수 있다. 이 경우, 제 1 전자 장치는 상기 수신된 식별 정보에 기반하여, 상기 전자 장치이 상기 특정 서비스를 지원할 수 있는지 여부를 판단할 수 있다. 한 실시 예에 따르면, 상기 네트워크 프로토콜은 통신이 가능하도록 연결된 전자 장치들(예: 전자 장치 , 전자 장치) 간에, 예컨대, 서비스를 연동하여 제공하기 위하여 송수신 되는, 데이터 흐름을 제어하 기 위한 프로토콜일 수 있다. 예를 들어, 전자 장치 또는 전자 장치 중 적어도 하나는 상기 네트워 크 프로토콜을 이용하여, 오류 제어, 또는 데이터 품질 제어 등을 수행할 수 있다. 추가적으로 또는 대체 적으로, 상기 네트워크 프로토콜은 전자 장치와 전자 장치 사이에서 송수신되는 데이터의 전송 포맷을 결정할 수 있다. 또한, 전자 장치 또는 전자 장치 중 적어도 하나는 상기 네트워크 프로토콜 를 이용하여 상호간의 데이터 교환을 위한 적어도 세션(session)을 관리(예: 세션 연결 또는 세션 종료)할 수 있다. 한 실시 예에 따르면, 상기 어플리케이션 프로토콜은 외부 전자 장치로 제공되는 서비스와 관련된 데이터 를 교환하기 위한, 절차 또는 정보를 제공하기 위한 프로토콜일 수 있다. 예를 들어, 전자 장치(예: 전자 장치)은 상기 어플리케이션 프로토콜을 통해 전자 장치(예: 전자 장치 또는 서버)로 서비스를 제공할 수 있다. 한 실시 예에 따르면, 상기 통신 프로토콜은 표준 통신 프로토콜, 개인 또는 단체에서 지정한 통신 프로토 콜(예: 통신 장치 제조 업체 또는 네트워크 공급 업체 등에서 자체적으로 지정한 통신 프로토콜) 또는 이들의 조합을 포함할 수 있다. 본 발명의 다양한 실시 예에 사용된 용어 \"모듈\"은, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은 예를 들어, 유닛(unit), 로 직(logic), 논리 블록(logical block), 부품(component) 또는 회로(circuit) 등의 용어와 바꾸어 사용 (interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \" 모듈\"은 하나 또는 그 이상의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면, 본 발명의 다양한 실시 예에 따른 \"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field- programmable gate arrays) 또는 프로그램 가능 논리 장치(programmable-logic device) 중 적어도 하나를 포함 할 수 있다. 다양한 실시 예에 따르면, 본 발명의 다양한 실시 예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로그래밍 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer- readable storage media)에 저장된 명령어로 구현될 수 있다. 상기 명령어는, 하나 이상의 프로세서 (예: 상기 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 상기 메모리가 될 수 있다. 상기 프로그래밍 모듈 의 적어도 일부는, 예를 들면, 상기 프로세서에 의해 구현(implement)(예: 실행)될 수 있다. 상기 프로그 래밍 모듈 의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세 트 (sets of instructions) 또는 프로세스 등을 포함할 수 있다. 상기 컴퓨터로 판독 가능한 기록 매체에는 하드디스크, 플로피디스크 및 자기 테이프와 같은 마그네틱 매체 (Magnetic Media)와, CD-ROM(Compact Disc Read Only Memory), DVD(Digital Versatile Disc)와 같은 광기록 매체(Optical Media)와, 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media)와, 그 리고 ROM(Read Only Memory), RAM(Random Access Memory), 플래시 메모리 등과 같은 프로그램 명령(예: 프로그 래밍 모듈)을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함될 수 있다. 또한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 본 발명의 다양한 실시 예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 본 발명의 다양한 실시 예에 따른 모듈 또는 프로그래밍 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함 하거나, 일부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따른 모듈, 프로그래밍 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 다양한 실시 예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서 에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것이다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 실시 예에 따른 의 기술 내용을 쉽게 설명 하고 본 발명의 실시 예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시 예의 범위를 한정 하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시 예의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실 시 예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2014-0142127", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른, 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 2는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 전면을 나타내는 도면이다. 도 3은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 개략적인 블록도이다. 도 4는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 구동을 나타내는 블록도이다. 도 5는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제1모드로 구동되는 상태를 나타내 는 도면이다. 도 6은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제1모드로 구동되는 상태를 나타내 는 블록도이다. 도 7은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제2모드로 구동되는 상태를 나타내 는 도면이다. 도 8은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치가 제2모드로 구동되는 상태를 나타내 는 블록도이다. 도 9는 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치의 구동 흐름도이다. 도 10은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치에서 가변 검출 모듈의 제1모드 구동 흐름도이다. 도 11은 본 발명의 다양한 실시 예들 중 하나의 실시 예에 따른 전자 장치에서 가변 검출 모듈의 제2모드 구동 흐름도이다. 도 12는 다양한 실시 예들에 따른 전자 장치의 블록도를 도시한다. 도 13은 다양한 실시 예들에 따른 복수의 전자 장치들 사이의 통신 프로토콜을 도시한다."}
