{"patent_id": "10-2023-7037600", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0011677", "출원번호": "10-2023-7037600", "발명의 명칭": "다중 펄스 X선 소스 이동 단층합성 영상화 시스템을 사용한 인공 지능 기반 진단", "출원인": "에익스캔 인크.", "발명자": "마오린베이 마낫"}}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템을 사용하는 인공 지능을 사용하는 진단 방법으로서,동작 중인 다중 펄스형 선원 단층합성 촬상 시스템을 사용하여 환자의 순차 스캔을 획득하는 단계; 상기 순차 스캔을 기준으로 영상 구축을 수행하는 단계;인공 지능(AI)을 사용하여 이전 스캔과 상기 순차 스캔을 비교하여 병변을 검출하는 단계; 및상기 AI로 상기 병변의 위치 및 병변 성장을 결정하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 인공 지능(AI)을 사용하여 변경이 없는 경우, 중단 결정을 내리고, 변경이 있는 경우, 병변 이상의 중증도를 결정하며, 중증도를 결정한 경우, 기결정된 관심 영역(ROI) 스캔 또는 CT 스캔을 사용하는 추가스캔을 추천하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 관심 영역(ROI) 스캔 또는 CT 스캔을 검사하기 위해 경고를 생성하고 하나 이상의 권장 사항을전송하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, AI를 사용하여 정상 작동 모드 및 각각의 복수의 상이한 가능한 고장 모드에서 각각의 하위시스템의 성능 모델을 구축하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,동적으로 변경되는 작동 조건에 대한 각각의 상기 모델의 응답을 기준으로 각각의 하위시스템의 성능을 동적으로 예측하는 단계, 각각의 하위시스템의 실제 성능 및 결과를 각각의 상기 정상 및 가능한 고장 모드에서 상기 각각의 하위 시스템의 동적으로 예측된 성능과 비교하는 단계 및 상기 비교를 기준으로 상기 작동 조건을 결정하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 거의 실시간으로 저선량 X선 스캔을 수행하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템을 사용하여 4차원 스캔 또는 순차 스캔을수행하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, X선 기구 영상 데이터를 촬영하는 동안 환자 반응을 분석하고 현재 상태를 환자 이력 및 환자정보와 비교하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 병변 위치 변경을 보고하는 단계, 중증도 임계값 및 경고 상태를 설정하는 단계 및 치료 정보공개특허 10-2024-0011677-3-를 생성하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 병변의 위치 및 병변 성장을 기준으로 관심 영역(ROI) 스캔 또는 전체 CT 스캔 또는 1명이상의 건강 관리 전문가 및 전문의를 추천하는 단계를 포함하는 방법."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인공 지능을 사용하는 X선 단층합성 진단 시스템으로서,동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템; 및상기 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템에 결합되는 프로세서로서, 상기 프로세서는 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템을 사용하여 환자의 순차 스캔을 획득하는 단계; 상기 순차 스캔을 기준으로 영상 구축을 수행하는 단계; 인공 지능(AI)을 사용하여 이전 스캔과 상기 순차 스캔을 비교하여 병변을 검출하는 단계; 및 상기 AI로 상기 병변의 위치 및 병변 성장을 결정하는 단계를 위한 코드를 실행하는 프로세서를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 변경이 없는 경우, 중단 결정을 내리고, 변경이 있는 경우, 병변 이상의 중증도를 결정하며,중증도를 결정한 경우, 기결정된 X선 관심 영역(ROI) 스캔 또는 CT 스캔을 사용하는 추가 스캔을 추천하는 인공지능(AI)을 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, X선 관심 영역(ROI) 스캔 또는 CT 스캔을 검사하기 위해 경고를 생성하고 하나 이상의 권장사항을 전송하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, AI를 사용하여 정상 작동 모드 및 각각의 복수의 상이한 가능한 고장 모드에서 각각의 하위시스템의 성능 모델을 구축하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,동적으로 변경되는 작동 조건에 대한 각각의 상기 모델의 응답을 기준으로 각각의 하위시스템의 성능을 동적으로 예측하는 단계, 각각의 하위시스템의 실제 성능 및 결과를 각각의 상기 정상 및 가능한 고장 모드에서 상기 각각의 하위 시스템의 동적으로 예측된 성능과 비교하는 단계 및 상기 비교를 기준으로 상기 작동 조건을 결정하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 거의 실시간으로 저선량 X선 촬상 스캔을 수행하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템을 사용하여 4차원 스캔 또는 순차 스캔을수행하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2024-0011677-4-제11항에 있어서, X선 기구 영상 데이터를 촬영하는 동안 환자 반응을 분석하고 현재 상태를 환자 이력 및 환자정보와 비교하기 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서, 병변 위치 변경을 보고하는 단계, 중증도 임계값 및 경고 상태를 설정하는 단계 및 치료 정보를 생성하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서, 상기 병변의 위치 및 병변 성장을 기준으로 관심 영역(ROI) 스캔 또는 전체 CT 스캔 또는 1명이상의 건강 관리 전문가 및 전문의를 추천하는 단계를 위한 코드를 포함하는 X선 단층합성 진단 시스템."}
{"patent_id": "10-2023-7037600", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "동작 중인 다중 펄스형 X선원 단층합성 촬상 기술을 사용하는 X선 진단 방법 및 시스템이 제시된다. X선 기구 영 상 데이터를 촬영하는 동안 인공 지능(AI)이 환자 반응을 분석하고 현재 상태를 환자 이력 및 환자의 일부가 될 수 있는 다른 환자 정보와 비교한다. 이는 병변 위치 변경을 보고하고 중증도 임계값 및 경고 상태를 설정하며 치료 정보를 생성한다. 또한, 이는 X선 관심 영역(ROI) 스캔 또는 전체 X선 CT 스캔 또는 다른 건강 관리 전문가 및 전문의를 추천한다."}
{"patent_id": "10-2023-7037600", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가출원 일련번호 제63182426호(2021년 4월 30일 출원); 제63226508호(2021년 7월 28일 출원); 제 63170288호(2021년 4월 2일 출원), 제63175952호(2021년 4월 16일 출원); 제63194071호(2021년 5월 27일 출 원); 제63188919호(2021년 5월 14일 출원); 제63225194호(2021년 7월 23일 출원); 제63209498호(2021년 6월 11 일 출원); 제63214913호(2021년 6월 25일 출원); 제63220924호(2021년 7월 12일 출원); 제63222847호(2021년 7 월 16일 출원); 제63224521호(2021년 7월 22일 출원); 및 미국 출원 일련번호 제17149133호(2021년 1월 24일 출원)에 대한 우선권을 주장하며, 이는 최종적으로 가출원 일련번호 제62967325호(2020년 1월 29일 출원)에 대 한 우선권을 주장하며, 이는 전문이 참조로 원용된다. 본 발명은 일반적으로 폐 및 유방 질환의 진단을 위한 인공 지능(AI) 기반 방법 및 시스템에 관한 것이며, 더 상세하게는, 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템을 사용하는 인공 지능(AI) 기반 진단을 위한 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-7037600", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "단층합성, 또한, 디지털 단층합성(DTS)은 투영 방사선촬영과 비슷한 방사선량 수준으로 고해상도 제한각 단층촬 영을 수행하기 위한 방법이다. 이는 혈관 촬상, 치과 영상, 정형외과 촬상, 유방촬영술 촬상 및 폐 촬상을 포함 하는 다양한 임상 응용분야를 위해 연구되어 왔다. 일 이점은 DTS X선 선량 수준이 CT 촬상보다 훨씬 더 낮다는 점이다. 또한, DTS는 CT보다 훨씬 더 빠르며 비용도 훨씬 더 저렴하다. 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템은 새로운 유형의 DTS이다. 일반 단일 선원 DTS보다 훨씬 더 고속으로 실행되고 훨씬 더 넓은 각도를 커버할 수 있다. 신속 폐암 선별, 유방암 선별에 사용할 수 있다. 전 체 선별 과정은 몇 초만 지속된다. 새로운 유형의 DTS는 초고속이나, 현재 이는 진단 목적을 위해 주로 인간 의사에게 여전히 의존한다. 따라서, 전체 오버헤드가 추가되어 진단 과정이 느려질 것이다. 따라서, 모든 사람을 위한 고속 폐암 선별 및 유방암 선별 수행하기 위해, 폐 또는 유방 상태를 진단하기 위한 더 개선된 시스템 및 방법을 제공하는 것이 바람직하 다. 인공 지능 기반 진단이 필요해지고 있다. 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템을 사용하는 X선 진단 방법이 제시된다. X선 기구 영상 데이 터를 촬영하는 동안 인공 지능(AI)이 환자의 반응을 분석하고 현재 상태를 로컬 컴퓨터에서 또는 신경망에서 환 자 이력 및 환자의 일부가 될 수 있는 다른 환자 정보와 비교한다. 이는 병변 위치 변경을 보고하고 중증도 임 계값 및 경고 상태를 설정하며 치료 정보를 생성한다. 또한, 이는 관심 영역(ROI) 스캔 또는 전체 CT 스캔 또는 다른 건강 관리 전문가 및 전문의를 추천한다. 해당 시스템의 이점은 다음 중 하나 이상을 포함할 수 있다. 시스템은 진단 목적을 위해 컴퓨터 학습을 사용하 는 DTS의 빠른 속도를 활용한다. AI는 진단 도구로 사용되어 데이터 획득 및 진단 결정 속도를 증가시키는 데 사용된다. 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템은 신속 X선 진단 장치이다. 거의 실시간으로 저선량 X선 스 캔을 수행할 수 있다. 또한, 4D 스캔 및 순차 스캔을 수행할 수 있다. 또한 AI는 인간의 중재가 거의 없이 초고 속 단층합성 촬상 시스템과 연관되는 모든 처리를 관리할 수 있다. 스캔을 수행하기 전, 정규 AI 모델이 선택한 데이터의 수집으로부터 생성되고, 이상 측정값이 발견되며, 임계값 이 결정된다. 이후, 이상 측정값이 새로 획득한 데이터로부터 발견되며 정규 모델을 생성한다. 그 후, 이러한 이상 측정값을 새로운 임계값과 비교하여 장치의 이상을 검출한다. 오늘날, 컴퓨터 및 네트워크는 고속이며 로컬 저장소도 대형이고 고속이며 저비용이다. 독립형 시스템의 경우, 네트워크에 편리하게 액세스할 수는 없으나, 병변 진단 시스템은 바람직하게는 로컬에서 실행되는 소프트웨어로 구현될 수 있다. 또한, 병변 진단 시스템은 네트워크 시스템용 신경망에서 실행되는 소프트웨어에서 구현된다. 병변 진단 시스템 은 정상 작동 모드 및 각각의 복수의 상이한 가능한 고장 모드에서 각각의 하위시스템의 성능 모델을 구축한다. 그 후, AI는 바람직하게는 동적으로 변경되는 작동 조건에 대한 각각의 모델의 응답을 기준으로 각각의 하위시 스템의 성능을 동적으로 예측하고, 각각의 하위시스템의 실제 성능 및 결과를 각각의 정상 및 가능한 고장 모드 에서 이의 동적으로 예측된 성능과 비교하며, 이러한 비교를 기준으로 작동 조건을 결정한다. AI를 사용하면, 데이터 획득 단계에서 순차 스캔이 가능하다. 부분 스캔으로부터 결과를 수득한 후, AI는 계속 되는 스캔이 바람직한 지 즉시 결정할 수 있다. 이는 충분한 정보가 수집되면 중지된다. AI는 의사처럼 행동하며 AI 스캔은 환자를 위해 의사가 방문하는 것처럼 행동한다. 변경 사항이 있는 경우, 이 는 아마도 모든 것이 정상이라는 의미일 것이다. 그 후, 처리가 중지된다. 일부 변경이 발견되는 경우, AI는 변 경이 얼마나 되는지 위치는 어디인지 파악한다. 그 후, AI도 변경이 얼마나 심각한지 결정을 내린다. 심각하지 않은 경우 과정이 종료된다. 심각한 경우, AI는 의사에게 경고를 생성하고 관심 영역(ROI) 스캔 또는 CT 스캔 또는 다른 보다 포괄적인 진단 도구를 수행하라는 권장 사항을 전송한다."}
{"patent_id": "10-2023-7037600", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다음 단락에서, 본 발명을 첨부된 도면을 참조하여 예시적으로 상세히 설명한다. 본 설명 전반에 걸쳐 바람직 한 실시예 및 예시는 본 발명에 대한 한정이 아닌 본보기로 간주되어야 한다. 본원에서 사용되는 \"본 발명\"은 본원에서 설명되는 본 발명의 실시형태 중 임의의 하나 및 임의의 등가물을 지칭한다. 또한 본 문서 전반에 걸 쳐 '본 발명'의 다양한 특징(들)에 대한 언급은 모든 청구된 실시예 또는 방법이 그러한 언급된 특징(들)을 반 드시 포함해야 한다는 것을 의미하지 않는다. 그러나, 본 발명은 다수의 상이한 형태로 구현될 수 있으며 본원에서 제시되는 실시형태에 제한되는 것으로 해 석되어서는 안 된다. 이러한 실시형태는 본 개시내용이 철저하고 완전할 것이며 통상의 기술자에게 본 발명의 범위를 완전히 전달할 수 있도록 제공된다. 더욱이 본 발명의 실시형태뿐만 아니라 이들의 구체적 예를 기술하 는 본원의 모든 설명은 이들의 구조적 및 기능적 등가물 둘 모두를 포괄하기 위한 것이다. 추가적으로, 이러한 등가물이 현재 알려진 등가물 및 미래에 개발되는 등가물(즉, 구조에 관계없이 동일한 기능을 수행하는 개발된 임의의 요소)을 모두 포함하도록 의도된다. 따라서, 예를 들어, 통상의 기술자는 도표, 개략도, 예시 등이 본 발명을 구현하는 시스템 및 방법을 설명하는 개념적 모식도 또는 프로세스를 나타낸다는 것을 이해할 수 있을 것이다. 도면에서 나타나 있는 다양한 요소의 기능은 전용 하드웨어 및 연관 소프트웨어를 실행할 수 있는 하드웨어의 사용을 통해 제공될 수 있다. 마찬가지 로 도면에 표시된 모든 스위치는 단지 개념적인 것이다. 이들 기능은 프로그램 로직의 동작을 통해, 전용 로직 을 통해, 프로그램 제어와 전용 로직의 상호작용을 통해, 또는 심지어 수동으로 수행될 수 있으며, 특정 기법은 본 발명을 실시하는 주체가 선택할 수 있다. 통상의 기술자는 본원에서 설명되는 예시적인 하드웨어, 소프트웨 어, 과정, 방법 및/또는 운영 체제가 예시를 위한 것이며 따라서, 특정 명명된 제조업체에 제한되도록 의도되지않는다는 것을 더 이해한다. 본 발명은 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템을 사용하는 의료 진단 방법에 관한 것이다. 본 발 명의 주요 목적은 영상 기반 병변 진단법을 제공하는 것이다. 본 발명의 제2 목적은 인공지능(AI)의 보조가 있 는 영상 기반 병변 진단법을 제공하는 것이다. X선 기구 영상 데이터를 촬영하는 동안 AI가 환자 반응을 분석하 고 현재 상태를 환자 이력 및 환자의 일부가 될 수 있는 다른 환자 정보와 비교한다. 이는 병변 위치 변경을 보 고하고 중증도 임계값 및 경고 상태를 설정하며 치료 정보를 생성한다. 또한, 이는 관심 영역(ROI) 스캔 또는 전체 CT 스캔 또는 다른 건강 관리 전문가 및 전문의를 추천한다. 초고속 동작 중인 다중 펄스형 X선원 단층합 성 촬상 시스템이 설계된다. 시스템 운영 동안 갑작스러운 장비 고장으로 인해 동적 변경이 발생한다. 그러나, 이를 정상 시스템 응답과 비교하여 적절하게 진단하고 분석할 수 있다. 일 실시형태에서, 도 1은 새로운 유형의 X선 촬상 시스템을 나타낸다. 이는 고효율 초고속 3D 방사선촬영을 수 행하는 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템이다. 다중 펄스형 X선원이 선원의 어레이를 형성 하기 위해 동작 중인 구조물상에 장착되어 있다. 다중 X선원은 일정한 속도로 기획정된 원호 트랙상의 객체에 대해 그룹으로서 동시에 이동한다. 각각의 개별 X선원은 그 고정 위치 주변에서 짧은 거리로 신속하게 이동할 수도 있다. X선원이 그룹 속도와 동일한 속도를 가지나 이동 방향이 반대인 경우, X선원 및 X선 평면 패널 검출 기는 외부 노출 제어 유닛을 통해 활성화되어 일시적으로 정지 상태를 유지한다. 이는 각각의 X선원에 대한 보 다 감소되는 선원 주행 거리를 초래한다. 그 결과, 3D 스캔은 보다 더 짧은 시간에 보다 더 넓은 스윕 각도를 커버할 수 있으며, 영상 분석도 실시간으로 수행할 수 있다. 이러한 유형의 X선 기계는 훨씬 더 빠른 스캔 속도 를 달성하기 위해 다른 유형의 X선 영상 기계보다 더 많은 X선원을 사용한다. 다중 X선원은 회전하는 갠트리상에 장착된다. X선원은 환자가 영상화할 수 있는 표적을 향해 펄스형 X선 빔을 방출한다. 동작 중인 촬상 장치는 환자가 좌측에서 우측으로 이동하면서 관심 영역의 영상 데이터를 획득한다. 동작 중인 촬상 장치는 바람직하게는 환자의 X선 영상을 수집 및 처리하고, 이러한 영상을 이전에 획득한 기준 영상과 비교하며, 다양한 출력을 생성하는 마이크로프로세서를 포함한다. 데이터 획득은 디지털 영상 데이터를 수집하기 위해 현재 이용 가능한 다수의 디지털 영상 획득 시스템 중 임의의 하나를 사용하여 수행될 수 있다. 이러한 장치의 예는 평면 또는 곡면 X선 패널 검출기를 포함한다. X선 평면 패널 검출기는 X선 빔을 수신한다. 평면 패널 검출기는 픽셀 어레이로 구성된다. 각각의 픽셀은 해 당 픽셀 위치에서 수신된 X선 에너지에 대응하는 개별 강도 값을 갖는다. 각각의 순간마다, 각각의 픽셀은 시간 간격 내에서 X선원에 노출된 횟수에 따라 X선 방사선을 수신할 수도 있고 X선 방사선을 수신하지 않을 수도 있 다. 평면 패널 검출기는 스캔 동안 X선원 및 피사체에 매우 근접하게 배치된다. 이는 X선원으로부터 X선 광자를 수신한다. 각각의 픽셀 값의 강도는 해당 픽셀 위치에 도달하는 X선 광자 에너지의 크기에 따라 달라진다. 결과 적으로, 단일 픽셀은 다양한 X선 광자 에너지를 기준으로 다양한 픽셀 값을 가질 수 있다. 이러한 픽셀 값은 특 정 X선 촬상 방식에 대한 검출기의 응답을 표현한다. 특정 방식은 획득 동안 사용되는 응용 프로그램 및 촬상 매개변수에 따라 다르다. X선 검출기를 독립형 장치로 사용하거나 대형 촬상 시스템의 일부로 사용할 수 있다. 지지 프레임 구조물은 실질적으로 평면인 베이스, 실질적으로 수직인 지지 부재 및 지지 부재에 회전 가능하게 장착되는 회전 가능한 프레임 부분을 포함한다. 프레임 구조물은 이동식 플랫폼상에서 환자에 대해 기선택된 각 도 배향으로 X선 관을 지지하도록 크기가 지정되고 구성된다. 이를 통해 프레임 부분이 피봇 아암을 중심으로 자유롭게 회전할 수 있다. 이러한 구성은 X선 관의 각도 배향이 지지 부재 또는 베이스가 회전할 필요 없이 스 캔 절차 동안 필요에 따라 변경되게 할 수 있다. 본 발명의 범위를 벗어나지 않고 프레임 부분을 베이스에 장착 하기 위한 다른 구성이 가능하다는 것이 이해될 것이다. 도 2는 환자 또는 객체의 진단 스캔을 나타낸다. 신규 X선 촬상 시스템은 동작 중인 다중 펄스형 X선원을 사 용하여 주로 폐 촬상 또는 유방 유방촬영술을 위한 X선 촬상을 수행한다. 수 초 안에 스캔하는 데 최대 120도 이상을 사용할 수 있다. 이는 시작될 제1 스캔 세트부터 넓은 범위 각도를 이미 커버할 수 있다. 예를 들어, 5 개의 선원 및 총 25개의 스캔 시스템의 경우, 발사 순서로부터 설정되는 X선 데이터는 제1 세트가 1-6-11-16-21 이고; 제2 세트가 2-7-12-17- 22이며; 제3 세트가 3-8-13-18-23이고; 제4 세트가 4-9-14-19-24이며; 제5 세트 가 5-10-15-20-25인 등이다. 5개의 선원의 경우, 이러한 유형의 기계는 총 120회 이상의 스캔을 용이하게 수행 할 수 있다. 제1 데이터 세트가 획득된 후, AI는 제2 세트를 기다리지 않고 진단을 즉시 수행할 수 있다. 도 2 에서, 다중 X선원이 있으며, 환자는 X선 평면 패널 검출기 전방에 위치된다. 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템은 고속 펄스형 X선원을 사용하여 근 실시간 저선량 단층 합성 촬상인 순차 스캔을 수행한다. 동작 중인 다중 순차적 단층합성 영상의 획득은 더 고해상도인 영상 또는동영상을 형성하기 위해 조합되나, 2개의 순차적 영상은 중첩되지 않는다. 순차적 스캔은 전형적으로 2개 이상 의 별도의 위치에서 촬상을 동시에 수행하여 달성되며, 이는 각각에 대해 상이한 단층합성 프로토콜을 사용한다. 다중 X선원이 바람직하게는 검사 피사체 주위의 단층촬영그래프를 따라 분산되어 임의의 원하는 횡단 면 평면에서 고해상도 X선 영상을 수득한다. 전용 방사선촬영 플레이트는 입사 X선을 수집하고 이를 적합한 시 준기를 통해 대응하는 평면 패널 검출기로 향하게 한다. 다중 선원을 사용하는 순차 스캔은 속도 및 공간 해상 도와 같은 일부 이장점을 나타내었다. 동일한 단층합성 데이터 세트의 다중 노출이 임의의 진단 정보 손실 없이 고해상도 영상으로 병합될 수 있다. 따라서, 더 양호한 품질의 영상을 수득하기 위해 더 고해상도의 스캔 기법 으로 환자를 재스캔할 필요가 없다. 이는 효율성을 증가시키고 환자 및 건강 관리 제공자의 방사선 노출을 감소 시킨다. 이러한 수직 구성에서, 환자는 X선 테이블상에 배치된다. 다른 수평 구성에서, 환자는 X선원과 X선 평 면 패널 검출기 사이에 서 있을 수 있다. 시스템의 운영자 또는 사용자는 선택된 데이터를 시각화하기 위한 화면을 포함하는 사용자 인터페이스를 사용하여 전체 절차를 지시하거나 제어한다. 사용자 인터페이스 대신 처 리 능력을 갖춘 워크스테이션(표시되지 않음)을 사용하여 전체 절차를 제어할 수 있다. 사용자 인터페이스는 네 트워크 인터페이스를 통해 로컬 저장소 주요 메모리 및 프로세서에 연결된다. 초고속 X선원은 다중 펄스형 X 선 빔을 환자에게 향하게 한다. X선 평면 패널 검출기, X선원 및 시준기는 테이블 또는 이동 가능한 장착체상에 장착될 수 있다. 각각의 이러한 요소의 구축 및 작동 원리는 해당 분야에서 알려져 있다. X선원에서 방출되는 빔이 환자를 통과한 후, 시준기가 빔 분리기에 의해 환자에게 다시 반사된다. 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템은 초고속 X선 진단 장치이다. 이러한 목적을 달성하기 위해, 개시되는 발명의 일 양태는 높은 데이터 획득 속도를 갖는 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템의 설계를 포함한다. 또한, 이는 상세한 X선 촬상 스캔을 제공한다. 3D X선 촬상 동안, 인공 지능(AI)은 컴퓨터 시스템이 시각적 인식, 영상 인식 및 의사 결정과 같은 인간 지능이 필요한 작업을 수행하게 할 수 있다. 이러한 종류의 작업은 인간의 사고방식과 연관되는 인지 기능, 즉, 학습 및 문제 해결을 필요로 한다. 머신러닝은 AI의 하위집합으로 간주된다. 머신러닝은 딥러닝(DL) 처리를 활용하여 구현될 수 있다. DL은 신경망으로 지칭되는 수학적 모델을 사용하는 머신러닝 방법이다. 신경망은 인간의 두뇌 를 모방하려고 시도하는 다수의 단계를 포함할 수 있다. X선 촬상 작동이 수행되는 경우, DL은 대규모 영상 데 이터세트에 존재하는 복잡한 계층적 특징 및 패턴을 추출하려고 시도한다. 그 후, 이러한 특징은 신경망을 사용 하여 함께 병합되어 X선 영상 데이터의 모델을 나타낼 수 있다. AI 모델이 실제 환자로부터 유래한 대량의 X선 촬상 데이터를 통해 이미 확립된 후 폐암, 유방암 또는 결절 상 태의 발견을 보조하는 등 폐 또는 유방 진단을 위한 AI 기반 시스템 및 방법이 본원에서 설명된다. AI 기반 시 스템 및 방법은 머신러닝을 활용한다. 예를 들어, 시스템 및 방법은 머신러닝에서 AI 모델을 활용할 수 있어, 예를 들어, 딥러닝 모델을 활용하여, 진단을 자동화할 수 있다. 본원에서 설명되는 시스템 및 방법은 영상 데이 터와 연관되는 인공 지능 모델을 사용하여 X선 단층촬영 영상을 처리하기 위한 독립형 또는 통합형 응용 프로그 램으로 구현될 수 있다. 일반적으로, 방법 중 하나는 인간의 폐 또는 유방에 대한 X선 스캔을 입력으로 사용하고 이러한 폐 또는 유방에 대한 진단을 출력하는 모델을 수득하는 단계를 포함한다. 진단은 폐 질환, 유방 질환 또는 결절, 병변 상태의 예측, 중증도 수준의 예측 및 X선 스캔 영상 입력의 중요한 특징의 검출을 포함한다. 도 3은 머신러닝 후 X선 단층합성 촬상 시스템에서의 AI 기반 진단의 예시적인 흐름도를 나타낸다. 일반적으로, 환자가 포괄적인 X선 스캔을 받기 전 환자의 이전 기록 또는 일반 건강한 사람에 대한 다른 표준 정보는 이미 로컬 컴퓨터 또는 건강 네트워크에서 이용 가능하다. 제1 단계는 환자를 스캔하여 데이터를 생성하는 것이다. 촬상 획득은 순차적일 수 있다. 그 후, 제2 단계는 시스템이 순차 스캔을 기준으로 영상 구축을 즉시 수행하는 것이다. 제3 단계는 인공 지능(AI)을 사용하여 환자의 의료 이력과 같은 환자에 관한 이용 가능한 지식을 비교 하는 것이다. 제4 단계는 AI가 결정을 내리게 하는 것이다. 변경 사항이 없는 경우, 환자 스캔이 정상이라는 의 미일 수 있으며 처리가 중지된다. 스캔에 하나 이상의 병변을 나타내는 변경이 있는 경우, AI는 검출된 새로운 병변의 범위와 각각의 병변의 위치를 알아내기로 결정한다. 그 후, AI는 병변이 얼마나 심각한지 결정을 내린다. 심각하지 않은 경우, 처리가 종료된다. 심각한 경우 AI는 의사에게 경고를 생성하고 관심 영역(ROI) 스 캔 또는 CT 스캔을 포함하는 더 광범위한 스캔을 수행하라는 권장 사항을 전송한다. 환자 스캔은 미가공 데이터를 생성한다. 데이터를 처리하기 위해, 획득한 데이터와 참조 메모리 유닛의 정상 데 이터를 비교하는 과정이 필요하다. 미가공 데이터가 의료 진단 기준을 충족하는지 확인하기 위해, 환자와 관련 된 장치 또는 장치 구성요소의 기하학적 구축을 기준으로 3D 공간에서 각각의 이상 위치에 대한 통계 모델을 구 축한다. 통계 모델을 기준으로 전체 스캔을 수행할지 또는 부분 스캔을 수행할지 결정한다. 그 후, 전체 스캔을 수행하기로 결정하는 경우, 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템이 영상 촬영을 진행하며, 이는 촬상을 위한 다중 펄스형 선원, 검출기 및 관 구성요소 노출을 포함한다. 이는 동시에 또는 순차적으로 수행될 수 있으나, 바람직하게는 동시에 수행된다. 재구축은 바람직하게는 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템 기법에 따라 수행된다. 그 결과, 복 수의 상이한 각도로부터 촬영되는 복수의 제1 객체 또는 제1 환자의 영상이 재구축되는 단층합성 영상 세트로서 수득된다. 환자의 제1 객체는 앞서 설명되는 바와 같이 실질적으로 고정 방사선원 및 검출기에 대해 배치된다. 이후, 추적 시스템으로도 지칭되는 방사선원 제어 시스템은 펄스형 X선 방사선 패턴을 생성하여 다중 펄스형 선 원의 X선 방사선을 환자 영상으로 향하게 한다. 바람직한 실시형태에서, 펄스형 X선 방사선 패턴은 시준된 다각 형 환형 빔에 해당한다. AI 검출은 시스템 구조에 변경이 있는지 여부를 결정한다. AI 검출기 결과 시스템 구조에 변경이 없다고 결정하 는 경우, AI는 X선 검출기에 순차 스캔을 종료하고 최종 영상 획득하라는 명령을 전송한다. 순차 스캔 및 최종 영상 획득은 하나 이상의 영상을 획득하기 위해 필요에 따라 반복될 수 있다. AI 진단 모듈은 다음을 포함하나 제한되지 않는 다양한 매개변수를 사용하여 환자에게 병변이 있는지 여부를 결정한다. 선량 값; 부분 볼륨 효과 (PVE); 디지털 신호(DS); 대비(C); (SNR); 영상 노이즈; 두께; 히스토그램 분산; 일시정지 시간; X선 산란; 감 쇠 인자; 해상도 등. AI 스캔 기법은 로컬에서 스캔 및 분석을 수행하고 네트워크를 통해 다른 위치에 알리며 이러한 분석을 위해 처리 능력 및 대용량 저장소를 사용한다. 환자 이력 또는 현재 데이터와 비교하여, 임계값이 결정 블록에서 설정된다. AI는 획득한 영상으로부터 복수의 ROI를 스캔한다. 영역 식별 단계에서, AI는 하나 이상의 ROI에서 가능한 병변을 찾아 처리 블록에 대한 위치를 기록한다. 검출 신뢰성 결정 단계에서, AI는 기록된 위치가 임계값 내에 있는지 여부를 결정한다. 기록된 위치 가 임계값 내에 있지 않은 경우 처리가 종료된다. 기록된 위치가 임계값 내에 있는 경우, 처리는 중증도 분류 결정 단계로 진행된다. 중증도 분류 결정 단계에서, AI는 기록된 위치의 심각도 등급이 높거나 낮은 지 결정한 다. 기록된 위치의 중증도 등급이 높은 경우, 처리는 제2 영역 식별 단계로 진행된다. 제2 영역 식별 단계에서, AI가 획득한 영상으로부터 하나 이상의 추가 ROI를 스캔하여 병변의 존재를 확인할 수 있다. 기록된 위치의 중 증도 등급이 낮은 경우, 처리 권장 사항 단계로 진행된다. 추천 단계에서, AI가 병변 스캔을 추천한다. 병변 스 캔은 전체 CT 스캔, 관심 영역(ROI) 스캔, 다중 채널의 집중 스캔 등의 표준 스캔에 의해 수행될 수 있다. AI는 인간 의사에게 다시 보고하고 가능한 다음 조치 과정에 대한 권장 사항을 제공하며, 일반적으로, 가상(네 트워킹된) 건강 관리 전문가를 항시 루프 및 제어 상태로 유지한다. 동작 중인 X선원 진단 절차를 위한 인공 지능(AI) 시스템은 이러한 시스템에서 상이한 유형의 스캔으로 작동할 수 있다. 예를 들어, 일 시스템은 순차 스캔을 적용하고 다른 시스템은 순차적 스캔을 적용한다. 순차 스캔은 각각의 스냅샷에서 획득한 각각의 데이터를 사용하여 영상 스택에서 다음 영상을 생성하는 것이다. 충분한 데이 터가 관심 영역(ROI)을 커버하기 위해 수집될 때까지 절차가 계속된다. 병변이 정적인 경우, 병변의 이력에 대 한 정보가 거의 또는 전혀 필요하지 않기 때문에 순차 스캔을 사용하여 진단하는 것이 훨씬 쉽다. 병변이 이동 하는 경우, 순차 스캔은 병변을 따라갈 수 있으나 고주파 데이터 획득이 필요하므로 선량이 유의하게 증가한다. 또한, 순차 스캔은 3단계로 수행될 수 있다다. 첫째, 미가공 데이터를 수집하여 초기 정규 모델을 구축한다. 둘 째, 정규 모델을 개선하기 위해 전처리된 데이터를 수집한다. 셋째, 필요한 경우 후처리된 데이터를 수집하여 정규 모델을 다시 구체화한다. X선 기구 영상 데이터를 촬영하는 동안 인공 지능이 환자 반응을 분석하고 현재 상태를 환자 이력 및 환자의 일부가 될 수 있는 다른 환자 정보와 비교한다. 이는 병변 위치 변경을 보고하고 중증도 임계값 및 경고 상태를 설정하며 치료 정보를 생성한다. 또한, 이는 관심 영역(ROI) 스캔 또는 전체 CT 스캔 또는 다른 건강 관리 전문가 및 전문의를 추천한다. 이러한 응용 프로그램은 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템을 사용한다. 이러한 응용 프로그램 은 실시간 의사 결정 및 스캔 과정에 AI를 적용하여 더 고속이고 정확한 X선 진단 장치를 위한 방법이다. 기존 의 X선 진단 장치는 다음과 같이 작동한다. 미가공 데이터를 취득하고, 영상으로 획득한 미가공 데이터를 모델 로 변환하고, 정상 작동 모드의 모델을 구축하고, 상이 고장 모드의 모델을 구축하고, X선 검출기 어레이로부터 실시간 데이터를 획득하고, 각각의 모델을 기준으로 실시간 데이터를 분석하고, 이상 유무를 감지한다. 대조적 으로, 제시된 발명 시스템은 다음과 같이 수행된다. AI 슈퍼컴퓨터를 사용하여 정상 작동 모드 및 각각의 복수의 상이한 가능한 고장 모드에서 각각의 하위시스템의 성능 모델을 구축한다. 그 후, AI는 변경되는 작동 조건 에 대한 각각의 모델의 응답을 기준으로 각각의 하위시스템의 성능을 동적으로 예측하고, 각각의 하위시스템의 실제 성능 및 결과를 각각의 정상 및 가능한 고장 모드에서 상기 이의 동적으로 예측된 성능과 비교하고 이러한 비교를 기준으로 작동 조건을 결정한다. 또한, 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템은 거의 실시 간으로 저선량 X선 스캔을 수행할 수 있다. 또한, 동작 중인 다중 펄스형 선원 단층합성 촬상 시스템은 4차원 스캔 또는 순차 스캔을 수행할 수 있다. 각각의 부분 스캔으로부터 수득한 영상 데이터는 인공 지능에 의해 평가되어 다양한 신체 부위에서 발생할 수 있는 병변, 예를 들어, 이러한 경우, 폐결절 및 유방암을 검출할 수 있다. 검출을 기준으로, 본 개시내용은 의 사가 ROI 스캔을 해야 하는지 또는 CT 스캔을 수행해야 하는지 또는 일부 다른 포괄적인 진단 도구를 수행해야 하는지 결정하기 위한 경고 정보를 생성할 것이다. 통상의 기술자에게 본 발명의 다양한 변형 및 변경이 첨부된 청구항에 정의된 본 발명의 사상과 범위에서 벗어 나지 않는다는 점은 자명하다. 아래의 임의의 방법 청구항에서 언급되는 단계는 반드시 언급되는 순서대로 수 행될 필요는 없다는 점에 유의하여야 한다. 통상의 기술자는 언급된 순서와 달리 단계를 변경해서 실시할 수 있음을 인정할 것이다. 또한 특징, 단계 또는 구성 요소에 대한 언급이나 논의가 결여된 것은 단서 조항으로 또는 유사한 청구 언어를 통해 부재하는 해당 특징 또는 구성 요소가 배제된 청구항의 근거가 된다. 본 발명의 다양한 실시형태가 위에서 설명되었으나 이들은 제한이 아니라 예시로서만 제시된 것으로 이해하여야 한다. 다양한 도면은 본 발명에 대한 예시적인 구조 또는 다른 구성을 도시할 수 있으며, 이는 본 발명에 포함 될 수 있는 특징 및 기능의 이해를 보조하기 위한 것이다. 본 발명은 예시된 예시적인 구조 또는 구성에 제한 되지 않으며, 원하는 특징은 다양한 대안적인 구조 및 구성을 사용하여 구현될 수 있다. 실제로, 대안적인 기 능적, 논리적 또는 물리적 분할 및 구성이 본 발명의 원하는 특징을 구현하기 위해 구현될 수 있는 방법은 통상 의 기술자에게 자명할 것이다. 또한 본원에서 기술된 바 이외의 다수의 상이한 구성 모듈 명칭이 다양한 분할 에 적용될 수 있다. 또한 흐름도, 동작 설명 및 방법 청구항과 관련하여 본원에서 제시되는 단계의 순서는 문 맥상 달리 지시하지 않는 한 다양한 실시형태에서 언급되는 기능을 수행하기 위해서 동일한 순서로 구현할 것을 규정하지 않는다. 본 문서에 사용된 용어와 문구 및 그 변형은 달리 명시되지 않는 한 제한적 의미가 아닌 개방적 의미로 해석되 어야 하다. 앞서 예로서, 용어 \"포함\"은 \"포함하나 이에 제한되지 않음\" 등을 의미하는 것으로 해석되어야 한 다. 용어 \"예\"는 논의 중인 항목의 예시적인 사례를 제공하는 데 사용되며, 이의 완전하거나 제한적인 목록을 제공하는 데 사용되지 않는다. 단수 표현은 \"적어도 하나\", \"하나 이상\" 등을 의미하는 것으로 해석되어야 한다. 형용사 \"기존의\", \"전통적인\", \"일반적인\", \"표준적인\", \"공지된\" 및 이와 유사한 의미의 용어는 설명되 는 항목을 특정 기간 또는 특정 시간에 이용 가능한 항목으로 제한하는 것으로 해석하여서는 안 되며, 대신, 현 재 또는 미래의 임의의 시점에 이용 가능하거나 공지될 수 있는 기존, 전통, 일반 또는 표준 기법을 포괄하는 것으로 해석되어야 한다. 따라서 본 문서가 통상의 기술자에게 명백하거나 알려진 기술을 언급하는 경우, 그러 한 기술은 현재 또는 미래의 임의의 시점에 통상의 기술자에게 명백하거나 알려진 기술을 포함한다. 또한, 본원에서 제시되는 다양한 실시형태는 예시적인 블록도, 흐름도 및 다른 예시의 관점에서 설명된다. 본 문서를 읽은 통상의 기술자에게 명백한 바와 같이, 예시된 실시형태와 이의 다양한 대안은 예시된 예로 제한되 지 않고도 실시될 수 있다. 예를 들어 블록도와 그에 대한 설명은 특정 구조나 구성을 요구하는 것으로 해석되 어서는 안 된다. 개시되는 실시형태에 대한 이전의 설명은 통상의 기술자가 본 발명을 제작하거나 사용할 수 있도록 제공된다. 이들 실시예들에 대한 다양한 수정들은 당업자에게 용이하게 명백할 것이며, 본 명세서에 정의된 일반적인 원리 들은 본 발명의 사상 또는 범위를 벗어나지 않고 다른 실시예들에 적용될 수 있다. 따라서, 본 발명은 본원에 서 나타내는 실시형태에 제한되도록 의도되지 않고, 본원에서 개시되는 원리 및 신규 특징과 일치하는 가장 넓 은 범위가 부여되도록 의도된다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2023-7037600", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 동작 중인 다중 펄스형 X선원 단층합성 촬상 시스템을 예시한다. 도 2는 환자 객체의 예시적인 진단 스캔을 나타낸다. 도 3은 동작 중인 다중 X선원 단층합성 촬상 시스템을 사용하여 수행되는 예시적인 AI 기반 진단 처리의 흐름도 를 나타낸다."}
