{"patent_id": "10-2017-0173458", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0072249", "출원번호": "10-2017-0173458", "발명의 명칭": "음성 메시지 서비스를 제공하는 단말, 서버 및 방법", "출원인": "주식회사 케이티", "발명자": "이다은"}}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "음성 메시지 서비스를 제공하는 공용 단말에 있어서,사용자로부터 음성 신호를 입력받는 음성 신호 입력부;상기 입력받은 음성 신호에 기초하여 상기 공용 단말에 기등록된 복수의 사용자 계정 중 상기 사용자에 해당하는 사용자 계정을 식별하는 사용자 식별부;상기 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장하는 음성 신호 저장부; 및상기 복수의 사용자 계정 중 상기 저장된 음성 메시지로부터 도출된 수신자 정보에 대응하는 사용자가 상기 공용 단말로 접근하는 경우 상기 저장된 음성 메시지를 출력하는 음성 메시지 출력부를 포함하는 것인, 공용 단말."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 저장된 음성 메시지에 수신자가 포함되어 있지 않은 경우, 상기 저장된 음성 메시지를 음성 분석 서버로전송하고, 상기 음성 분석 서버로부터 상기 음성 메시지를 수신할 수신자 정보를 수신하는 수신자 판단부를 더포함하고,상기 음성 메시지 출력부는 상기 수신자 정보에 대응하는 사용자가 상기 공용 단말로 접근하는 경우 상기 저장된 음성 메시지를 출력하는 것인, 것인, 공용 단말"}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 식별된 사용자 계정으로 수신된 음성 메시지에 대한 알림을 상기 식별된 사용자 계정에 등록된 단말로 전송하는 음성 메시지 알림부를 더 포함하는 것인, 공용 단말."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 식별된 사용자 계정으로 수신된 음성 메시지를 상기 공용 단말의 스피커를 통해 재생하는 음성 메시지 재생부를 더 포함하는 것인, 공용 단말."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 수신자 정보는 상기 음성 메시지의 맥락 정보 및 상기 복수의 사용자 계정에 해당하는 복수의 사용자 각각공개특허 10-2019-0072249-2-의 사용자 특성 정보에 기초하여 상기 음성 분석 서버에 의해 분석된 사용자에 대한 정보인 것인, 공용 단말."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서, 상기 맥락 정보는 상기 음성 메시지에 포함된 시간 정보, 장소 정보, 및 대상 정보 중 적어도 하나에 기초하여파악되는 것인, 공용 단말."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서, 상기 사용자 특성 정보는 상기 복수의 사용자 계정 별로 수집된 음성 신호를 이용한 딥러닝 학습으로부터 분석되는 것인, 공용 단말."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "음성 메시지 서비스를 제공하는 음성 분석 서버에 있어서,공용 단말로부터 음성 메시지를 수신하는 수신부;상기 음성 메시지에 기초하여 기등록된 복수의 사용자 계정 중 상기 음성 메시지를 발화한 사용자에 해당하는사용자 계정을 식별하는 사용자 식별부;상기 음성 메시지를 수신할 수신자 정보를 도출하는 도출부; 및 상기 음성 메시지를 상기 복수의 사용자 계정 중 상기 수신자 정보에 대응하는 사용자 계정에 저장하는 저장부를 포함하는 것인, 음성 분석 서버."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 도출부는 상기 음성 메시지의 맥락 정보 및 상기 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특성 정보에 기초하여 수신자 정보를 도출하는 것인, 음성 분석 서버."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 도출부는 상기 음성 메시지에 포함된 시간 정보, 장소 정보 및, 대상 정보 중 적어도 하나에 기초하여 상기 맥락 정보를 파악하는 것인, 음성 분석 서버."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 도출부는 상기 복수의 사용자 계정 별로 수집된 음성 신호를 이용한 딥러닝 학습을 통해 상기 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특성 정보를 분석하는 것인, 음성 분석 서버.공개특허 10-2019-0072249-3-청구항 12 제 8 항에 있어서,상기 음성 메시지는 상기 수신자 정보에 대응하는 사용자가 기설정된 시간 내에 상기 공용 단말에 접근하는 경우, 상기 공용 단말의 스피커를 통해 출력되는 것인, 음성 분석 서버."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 음성 메시지에 대한 알림이 상기 수신자 정보에 대응되는 사용자 계정에 등록된 단말로 전송되는 것인, 음성 분석 서버."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공용 단말에서 음성 메시지 서비스를 제공하는 방법에 있어서,사용자로부터 음성 신호를 입력받는 단계;상기 입력받은 음성 신호에 기초하여 상기 공용 단말에 기등록된 복수의 사용자 계정 중 상기 사용자에 해당하는 사용자 계정을 식별하는 단계;상기 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장하는 단계; 및상기 복수의 사용자 계정 중 상기 저장된 음성 메시지에 포함된 수신자 정보에 대응하는 사용자가 상기 공용 단말로 접근하는 경우 상기 저장된 음성 메시지를 출력하는 단계를 포함하는 것인, 음성 메시지 서비스 제공 방법."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 저장된 음성 메시지에 수신자가 포함되어 있지 않은 경우, 상기 저장된 음성 메시지를 음성 분석 서버로전송하는 단계; 상기 음성 분석 서버로부터 상기 음성 메시지를 수신할 수신자 정보를 수신하는 단계; 및상기 수신자 정보에 대응하는 사용자가 상기 공용 단말로 접근하는 경우 상기 저장된 음성 메시지를 출력하는단계를 더 포함하는 것인, 음성 메시지 서비스 제공 방법."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,상기 식별된 사용자 계정으로 수신된 음성 메시지에 대한 알림을 상기 식별된 사용자 계정에 등록된 단말로 전송하는 단계를 더 포함하는 것인, 음성 메시지 서비스 제공 방법."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2019-0072249-4-제 16 항에 있어서,상기 식별된 사용자 계정으로 수신된 음성 메시지를 상기 공용 단말의 스피커를 통해 재생하는 단계를 더 포함하는 것인, 음성 메시지 서비스 제공 방법."}
{"patent_id": "10-2017-0173458", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 15 항에 있어서,상기 수신자 정보는 상기 음성 메시지의 맥락 정보 및 상기 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특성 정보에 기초하여 상기 음성 분석 서버에 의해 분석된 사용자에 대한 정보인 것인, 음성 메시지서비스 제공 방법."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "음성 메시지 서비스를 제공하는 공용 단말은 사용자로부터 음성 신호를 입력받는 음성 신호 입력부, 입력받은 음 성 신호에 기초하여 공용 단말에 기등록된 복수의 사용자 계정 중 사용자에 해당하는 사용자 계정을 식별하는 사 용자 식별부, 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장하는 음성 신호 저장부 및 복수의 사용자 계정 중 저장된 음성 메시지로부터 도출된 수신자 정보에 대응하는 사용자가 공용 단말로 접근 하는 경우, 저장된 음성 메시지를 출력하는 음성 메시지 출력부를 포함할 수 있다."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 음성 메시지 서비스를 제공하는 단말, 서버 및 방법에 관한 것이다."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 단말이 널리 상용화되고, 화자인식 기술이 발전하면서, 인공지능 단말을 통해 음성 인식을 수행하여 개인 맞춤형으로 서비스를 제공하려는 시도가 진행되고 있다. 하지만, 종래의 인공 지능 스피커를 통한 개인 맞춤형 서비스의 경우, 화자의 식별이 없어 사용자의 특성을 파 악하기 어렵고, 인공 지능 스피커의 사용 맥락과 관련된 맞춤형 서비스를 제공하기도 어렵다. 한편, 인공지능 에이전트가 텍스트 메시지의 대화 내용을 분석하여 관련 서비스를 제공하고 있지만, 이러한 인 공지능 에이전트는 텍스트 기반의 모바일 메시지 앱에만 한정된 것이 많다. 따라서 기존의 인공지능 기반의 화자인식 그리고 음성 메시지 서비스는 사용자의 일상적인 생활 패턴과 그 맥락 에 따라 직관적으로 대응하여 서비스를 제공하는데 한계가 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제 10-0312436호 (2000.02.15 공개)"}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "공용 단말을 통해 사용자로부터 수신된 음성 신호에 기초하여 사용자에 해당하는 사용자 계정을 식별하는 화자 인식 서비스를 제공하고자 한다. 또한, 복수의 사용자가 공용 단말을 공유하는 상황에서도 식별된 사용자의 음 성에 따라 각각에 해당하는 사용자 계정으로 음성 메시지 서비스를 제공하고자 한다. 또한, 음성 메시지로부터 도출된 수신자 정보에 대응하는 사용자 계정으로 음성 메시지를 전달하고자 한다. 또한, 사용자가 음성 메시지 를 수신할 수신자를 지정하지 않더라도 음성 메시지를 분석하여 해당 음성 메시지를 수신할 수신자 정보를 도출 하고, 도출된 수신자 정보에 대응하는 사용자 계정으로 음성 메시지를 전달하고자 한다. 다만, 본 실시예가 이 루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재 할 수 있다."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 제 1 측면에 따른 음성 메시지 서비스를 제 공하는 공용 단말은 사용자로부터 음성 신호를 입력받는 음성 신호 입력부; 상기 입력받은 음성 신호에 기초하여 상기 공용 단말에 기등록된 복수의 사용자 계정 중 상기 사용자에 해당하는 사용자 계정을 식별하는 사용자 식별부; 상기 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장하는 음성 신호 저장부; 및 상기 복수의 사용자 계정 중 상기 저장된 음성 메시지로부터 도출된 수신자 정보에 대응하는 사용자 가 상기 공용 단말로 접근하는 경우, 상기 저장된 음성 메시지를 출력하는 음성 메시지 출력부를 포함할 수 있 다. 본 발명의 제 2 측면에 따른 음성 메시지 서비스를 제공하는 음성 분석 서버는 공용 단말로부터 음성 메시지를 수신하는 수신부; 상기 음성 메시지에 기초하여 기등록된 복수의 사용자 계정 중 상기 음성 메시지를 발화한 사 용자에 해당하는 사용자 계정을 식별하는 사용자 식별부; 상기 음성 메시지를 수신할 수신자 정보를 도출하는 도출부; 및 상기 음성 메시지를 상기 복수의 사용자 계정 중 상기 수신자 정보에 대응하는 사용자 계정에 저장 하는 저장부를 포함할 수 있다. 본 발명의 제 3 측면에 따른 공용 단말에서 음성 메시지 서비스를 제공하는 방법은 사용자로부터 음성 신호를 입력받는 단계; 상기 입력받은 음성 신호에 기초하여 상기 공용 단말에 기등록된 복수의 사용자 계정 중 상기 사용자에 해당하는 사용자 계정을 식별하는 단계; 상기 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장하는 단계; 및 상기 복수의 사용자 계정 중 상기 저장된 음성 메시지에 포함된 수신자 정보 에 대응하는 사용자가 상기 공용 단말로 접근하는 경우, 상기 저장된 음성 메시지를 출력하는 단계를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본 발명을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 기재된 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 공용 단말을 통해 사용자로부터 수신된 음성 신호에 기초하여 사용자에 해당하는 사용자 계정을 식별하는 화자 인식 서비스를 제공할 수 있다. 또한, 복수의 사용 자가 공용 단말을 공유하는 상황에서도 식별된 사용자의 음성에 따라 각각에 해당하는 사용자 계정으로 음성 메 시지 서비스를 제공할 수 있다. 또한, 음성 메시지로부터 도출된 수신자 정보에 대응하는 사용자 계정으로 음 성 메시지를 전달할 수 있다. 또한, 사용자가 음성 메시지를 수신할 수신자를 지정하지 않더라도 음성 메시지 를 분석하여 해당 음성 메시지를 수신할 수신자 정보를 도출하고, 도출된 수신자 정보에 대응하는 사용자 계정 으로 음성 메시지를 전달할 수 있다."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말 또는 디 바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말 또는 디바이스에서 수행될 수도 있다. 이하, 첨부된 구성도 또는 처리 흐름도를 참고하여, 본 발명의 실시를 위한 구체적인 내용을 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른, 음성 메시지 서비스 제공 시스템의 구성도이다. 도 1을 참조하면, 음성 메시지 서비스 제공 시스템은 공용 단말 및 음성 분석 서버를 포함할 수 있다. 다만, 이러한 도 1의 음성 메시지 서비스 제공 시스템은 본 발명의 일 실시예에 불과하므로 도 1을 통해 본 발명이 한정 해석되는 것은 아니며, 본 발명의 다양한 실시예들에 따라 도 1과 다르게 구성될 수도 있다. 일반적으로, 도 1의 음성 메시지 서비스 제공 시스템의 각 구성요소들은 네트워크(미도시)를 통해 연결된다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷 (WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 블루투스 통신, 적외선 통신, 초음파 통신, 가시 광 통신(VLC: Visible Light Communication), 라이파이(LiFi) 등이 포함되나 이에 한정되지는 않는다. 공용 단말은 원거리 음성 및 화자를 인식할 수 있고, 사용자와 지능형 감성 대화를 수행할 수 있다. 이러 한, 공용 단말은 사용자의 음성 신호를 입력받으면 음성 신호에 대응하는 음성 인식 서비스를 사용자에게 제공할 수 있다. 공용 단말은 사용자로부터 음성 메시지 서비스에 대한 음성 신호(기본 음성 개시 명령)을 입력받으면, 입 력된 음성 신호에 기초하여 해당 사용자에 해당하는 사용자 계정을 식별할 수 있다. 이러한 화자 식별 또는 사 용자 식별에 관한 기능은 음성 분석 서버를 통해서도 수행될 수 있다. 공용 단말은 사용자로부터 입력받은 음성 메시지를 해당 사용자의 사용자 계정에 저장할 수 있다. 이후, 공용 단말은 저장된 음성 메시지에 수신자 정보가 포함되어 있는지 판단한 후에, 수신자 정보가 음 성 메시지에 포함되어 있으면 해당 수신자 정보에 대응하는 사용자가 공용 단말로 접근하는 경우, 저장된 음성 메시지를 출력할 수 있다. 만일, 음성 메시지에 수신자 정보가 포함되어 있지 않은 경우, 공용 단말은 음성 메시지를 음성 분석 서버 에게 전송할 수 있다. 공용 단말은 공용 단말에 등록, 연결 또는 바인딩된 적어도 하나의 사용자 단말을 통해 음성 신호를 입력 받거나 사용자 단말로 음성 메시지를 전달할 수 있다. 예를 들어, 각 방에 위치하는 사용자 단말은 거실에 위치 하는 공용 단말과 바인딩될 수 있다. 공용 단말은 바인딩된 각 방에 위치하는 사용자 단말을 통해 음성을 입력 받을 수 있고, 이에 따라 공용 단말의 바로 앞에서 발화된 음성뿐만 아니라 각 방에 설치된 사용자 단말을 통해 입력받은 음성을 통해서도 서비스를 제공할 수 있으므로, 본원 발명은 바인딩된 복수의 사용자 단말을 통해 공 용 단말의 커버리지가 확대되는 효과를 발생시킬 수 있다. 사용자 단말은 예를 들어, 스마트폰, 지능형 스피커, 지능형 STB(스피커 포함), 지능형 워치, 가정용 로봇 등의 자체적으로 마이크 및 스피커를 가지고 있는 다양한 디바이스를 포함할 수 있다. 음성 분석 서버는 공용 단말로부터 수신된 음성 메시지에 기초하여 공용 단말에 기등록된 복수의 사용자 계정 중 음성 메시지를 발화한 사용자에 해당하는 사용자 계정을 식별할 수 있다. 음성 분석 서버는 수신된 음성 메시지를 분석하여 음성 메시지를 수신할 수신자 정보를 도출할 수 있다. 구체적으로, 음성 분석 서버는 음성 메시지의 맥락 정보 및 공용 단말에 기등록된 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특성 정보에 기초하여 수신자 정보를 도출할 수 있다. 음성 분석 서버는 도출된 수신자 정보를 공용 단말에게 전송할 수 있다. 공용 단말은 음성 분석 서버로부터 수신된 수신자 정보에 대응하는 사용자가 공용 단말로 접근 하는 경우, 저장된 음성 메시지를 출력할 수 있다. 이하에서는 도 1의 음성 메시지 서비스 제공 시스템의 각 구성요소의 동작에 대해 보다 구체적으로 설명한다. 도 2는 본 발명의 일 실시예에 따른, 도 1에 도시된 공용 단말의 블록도이다. 도 2를 참조하면, 공용 단말은 음성 신호 입력부, 사용자 식별부, 음성 신호 저장부, 음성 메시지 출력부, 수신자 판단부, 음성 메시지 알림부 및 음성 메시지 재생부를 포함할 수 있다. 다만, 도 2에 도시된 공용 단말은 본 발명의 하나의 구현 예에 불과하며, 도 2에 도시된 구성요소 들을 기초로 하여 여러 가지 변형이 가능하다. 음성 신호 입력부는 사용자로부터 음성 신호를 입력받을 수 있다. 이 때, 입력받은 음성 신호는 음성 메 시지 입력에 대한 기본 음성 개시 명령에 해당될 수 있고, 해당 음성 신호에는 사용자가 설정한 정보(예컨대, 사용자의 이름, 특정 호출명 등)가 포함될 수도 있다. 예를 들면, 음성 신호 입력부는 사용자가 공용 단 말에 설정한 음성 메시지 입력에 대한 기본 음성 개시 명령(예컨대, '지니(호출어), 음성 메시지 보내 줘')을 해당 사용자로부터 수신할 수 있다. 이 때, 음성 메시지 입력에 대한 기본 음성 개시 명령은 공용 단말 에 등록된 복수의 사용자마다 상이하게 설정되거나, 공통의 명령으로도 설정될 수 있다. 사용자 식별부는 입력받은 음성 신호에 기초하여 입력받은 음성 신호에 대한 화자를 식별함으로써 공용 단 말에 기등록된 복수의 사용자 계정 중 식별된 화자에 해당하는 사용자 계정을 도출할 수 있다. 예를 들 면, 사용자 식별부는 복수의 사용자 계정별로 기설정된 복수의 기본 음성 개시 명령 중 사용자로부터 입력 받은 음성 신호와 일치하는 기본 음성 개시 명령에 매핑된 사용자 계정을 해당 사용자의 계정으로 식별할 수 있 다. 예를 들면, 사용자 식별부는 음성 신호에 포함된 사용자의 정보에 기초하여 사용자의 사용자 계정을 식별할 수 있다. 예를 들면, 사용자 식별부는 입력받은 음성 신호로부터 사용자의 음성 특징 대역을 추출 하고, 공용 단말에 기등록된 복수의 사용자 계정별로 수집된 음성 데이터 중 해당 사용자의 음성 특징 대 역을 포함하는 음성 데이터에 해당하는 사용자 계정을 해당 사용자의 계정으로서 추출할 수 있다. 음성 신호 저장부는 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장하고, 식별 된 사용자 계정에 음성 메시지를 저장할 수 있다. 음성 메시지 출력부는 복수의 사용자 계정 중 저장된 음성 메시지에 수신자 정보가 포함된 경우, 해당 수 신자 정보에 대응하는 사용자가 공용 단말로 접근하는 경우, 저장된 음성 메시지를 출력할 수 있다. 예를 들면, 수신자 정보에 특정 사용자의 이름이나 가족 관계 호칭 정보(예컨대, 아빠, 엄마, 딸, 아들 등) 등이 포 함될 수 있다. 예를 들면, 수신자 정보에 '딸' 호칭이 포함된 경우, 음성 메시지 출력부는 복수의 사용자 계정 중에서 '딸'에 해당하는 사용자 계정에 해당하는 사용자가 공용 단말로 접근하는 경우, 음성 메시지 를 출력할 수 있다. 만일, 저장된 음성 메시지에 수신자가 포함되어 있지 않은 경우, 수신자 판단부는 저장된 음성 메시지를 음성 분석 서버에게 전송하고, 음성 분석 서버로부터 음성 메시지를 수신할 수신자 정보를 수신할 수 있다. 여기서, 수신자 정보는 음성 메시지의 맥락 정보 및 복수의 사용자 계정에 해당하는 복수의 사용자 각각 의 사용자 특성 정보에 기초하여 음성 분석 서버에 의해 분석된 사용자에 대한 정보일 수 있다. 음성 메 시지의 맥락 정보는 음성 메시지에 포함된 시간 정보, 장소 정보, 및 대상 정보 중 적어도 하나에 기초하여 파 악될 수 있다. 예를 들면, 제 1 사용자(아빠), 제 2 사용자(엄마) 및 제 3 사용자(딸) 각각에 대한 사용자 계정 이 공용 단말에 등록되어 있고, 저장된 음성 메시지가 '수학 학원 가기 전에 냉장고에 간식 먹고 가'를 포 함한 내용의 메시지인 경우, '수학 학원'에 가는 사용자는 제 3 사용자에 해당되므로 해당 음성 메시지를 수신 할 수신자 정보에는 제 3 사용자에 대한 정보가 포함될 수 있다. 사용자 특성 정보는 복수의 사용자 계정 별로 수집된 음성 신호를 이용한 딥러닝 학습으로부터 분석될 수 있다. 예를 들면, 사용자 특성 정보는 사용자의 성별 또는 나이, 직업 정보 등을 포함할 수 있다. 음성 메시지 출력부는 음성 분석 서버로부터 수신한 수신자 정보에 대응하는 사용자가 공용 단말 로 접근하는 경우, 저장된 음성 메시지를 출력할 수 있다. 음성 메시지 알림부는 식별된 사용자 계정으로 음성 메시지가 수신된 경우, 음성 메시지에 대한 알림을 식 별된 사용자 계정에 등록된 단말로 전송할 수 있다. 음성 메시지 재생부는 사용자로부터 해당 사용자의 사용자 계정으로 수신된 음성 메시지에 대한 재생 명령 을 수신한 경우, 해당 사용자 계정으로 수신된 음성 메시지를 공용 단말의 스피커를 통해 재생할 수 있다. 한편, 당업자라면, 음성 신호 입력부, 사용자 식별부, 음성 신호 저장부, 음성 메시지 출력부 , 수신자 판단부, 음성 메시지 알림부 및 음성 메시지 재생부 각각이 분리되어 구현되거나, 이 중 하나 이상이 통합되어 구현될 수 있음을 충분히 이해할 것이다. 도 3은 본 발명의 일 실시예에 따른, 공용 단말에서 음성 메시지 서비스를 제공하는 방법을 나타낸 흐름도 이다. 도 3을 참조하면, 단계 S301에서 공용 단말은 사용자로부터 음성 신호를 입력받을 수 있다. 단계 S303에서 공용 단말은 입력받은 음성 신호에 기초하여 공용 단말에 기등록된 복수의 사용자 계 정 중 사용자에 해당하는 사용자 계정을 식별할 수 있다. 단계 S305에서 공용 단말은 식별된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장할 수 있다. 단계 S307에서 공용 단말은 복수의 사용자 계정 중 저장된 음성 메시지에 포함된 수신자 정보에 대응하는 사용자가 공용 단말로 접근하는 경우, 저장된 음성 메시지를 출력할 수 있다. 상술한 설명에서, 단계 S301 내지 S307은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 도 4는 본 발명의 일 실시예에 따른, 도 1에 도시된 음성 분석 서버의 블록도이다. 도 4를 참조하면, 음성 분석 서버는 수신부, 사용자 식별부, 도출부 및 저장부를 포 함할 수 있다. 다만, 도 4에 도시된 음성 분석 서버는 본 발명의 하나의 구현 예에 불과하며, 도 4에 도 시된 구성요소들을 기초로 하여 여러 가지 변형이 가능하다. 이하에서는 도 4와 함께 도 5를 참조하여 설명하 기로 한다. 수신부는 공용 단말에 기등록된 복수의 사용자 계정 중 어느 하나의 사용자 계정에 해당하는 것으로 식별된 사용자로부터 입력받은 음성 메시지를 공용 단말로부터 수신할 수 있다. 도 5를 참조하면, 수신부 는 공용 단말에 등록된 제 1 사용자 계정에 대응하는 제 1 사용자로부터 입력받은 음성 메시지 를 공용 단말로부터 수신할 수 있다. 사용자 식별부는 음성 메시지에 기초하여 기등록된 복수의 사용자 계정 중 음성 메시지를 발화한 사용자에 해당하는 사용자 계정을 식별할 수 있다. 사용자 식별부는 공용 단말의 사용자 식별부와 기능이 동일할 수 있다. 도출부는 음성 메시지를 수신할 수신자 정보를 도출할 수 있다. 도 5를 참조하면, 도출부은 음성 메 시지를 단어 단위(예컨대, 명사와 조사)로 구분하여 음성 메시지로부터 명사를 추출할 수 있다. 음성 메 시지가 '수학 학원 가기 전에 냉장고에 간식 먹고 가'를 포함한 내용의 메시지인 경우, 도출부는 '수학', '학원', '냉장고', '간식'을 명사로서 추출할 수 있다. 도출부는 추출된 적어도 하나의 명사와 관련된 시간 정보, 장소 정보 및, 대상 정보 중 적어도 하나에 기 초하여 음성 메시지의 맥락 정보를 파악할 수 있다. 예를 들면, 도 5를 참조하면, 제 1 사용자(아빠), 제 2 사용자(엄마) 및 제 3 사용자(딸) 각각에 대한 사용자 계정이 공용 단말에 등록되어 있다고 가정하고, 도출부는 음성 메시지가 입력된 시간이 '오후 2시'이고, 음성 메시지에 '수학', '학원'이 포함 되어 있다면 해당 음성 메시지와 연관이 높은 사용자를 제 3 사용자로 판단할 수 있다. 도출부는 복수의 사용자 계정 별로 수집된 음성 신호를 이용한 딥러닝 학습을 통해 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특성 정보를 분석할 수 있다. 도출부는 복수의 사용자 계정에 해당하는 사용자의 생활 패턴에 기초하여 각 사용자의 사용자 특성을 분석할 수 있다. 예를 들면, 도출부는 수집된 음성 신호에 기초하여 사용자의 성별 또는 나이, 직업 정보 등을 포함하는 사용자 특성 정보를 분석할 수 있다. 예를 들면, 도 5를 참조하면, 도출부는 수집된 음성 신호에 '학교, 학원, 시험, 교육 방송 등' 에 대한 단어가 포함되면, 해당 단어와 연관된 사용자는 학생 신분일 가능성이 높다고 판단할 수 있다. 도출부는 음성 메시지의 맥락 정보 및 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특성 정보에 기초하여 수신자 정보를 도출할 수 있다. 수신자 정보에 대응하는 사용자가 기설정된 시간 내에 공 용 단말에 접근하는 경우, 음성 메시지는 공용 단말의 스피커를 통해 출력될 수 있다. 도 5를 참조하면, 전송부는 음성 메시지와 연관도가 높은 제 3 사용자에 대한 수신자 정보를 공용단말 에게 전송할 수 있다. 이 때, 음성 메시지는 제 3 사용자에 대한 수신자 정보에 대응하는 제 3 사용 자가 기설정된 시간 내에 공용 단말에 접근하는 경우, 해당 음성 메시지에 대한 알림이 제 3 사용자 의 사용자 계정에 등록된 제 3 사용자의 단말로 전송될 수 있다. 만일, 공용 단말로 제 3 사용자 로부터 음성 메시지에 대한 재생 명령이 입력되면, 제 3 사용자의 사용자 계정으로 전달된 음성 메시지 가 공용 단말의 스피커를 통해 재생될 수 있다. 저장부는 음성 메시지를 복수의 사용자 계정 중 수신자 정보에 대응하는 사용자 계정에 저장할 수 있다. 저장부는 복수의 사용자 계정 별로 수집된 음성 신호를 저장하고, 수신된 음성 메시지에 기초한 사용자의 생활 패턴과 연관된 음성 메시지를 사용자 계정 별로 저장할 수 있다. 한편, 당업자라면, 수신부, 사용자 식별부, 도출부 및 저장부가 각각이 분리되어 구현되거 나, 이 중 하나 이상이 통합되어 구현될 수 있음을 충분히 이해할 것이다. 도 6은 본 발명의 일 실시예에 따른 음성 분석 서버에서 음성 메시지 서비스를 제공하는 방법을 나타낸 흐 름도이다. 도 6을 참조하면, 단계 S601에서 음성 분석 서버는 공용 단말로부터 음성 메시지를 수신할 수 있다. 단계 S603에서 음성 분석 서버는 음성 메시지에 기초하여 기등록된 복수의 사용자 계정 중 음성 메시지를 발화한 사용자에 해당하는 사용자 계정을 식별할 수 있다. 단계 S605에서 음성 분석 서버는 음성 메시지를 수신할 수신자 정보를 도출할 수 있다. 단계 S607에서 음성 분석 서버는 음성 메시지를 복수의 사용자 계정 중 단계 S605에서 도출된 수신자 정보 에 대응하는 사용자 계정에 저장할 수 있다. 상술한 설명에서, 단계 S601 내지 S605는 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 도 7은 본 발명의 일 실시예에 따른 음성 메시지 서비스를 제공하는 방법을 나타낸 동작 흐름도이다. 도 7에 도시된 실시예에 따른 음성 메시지 서비스 제공 방법은 도 1 내지 도 6에 도시된 실시예에 따른 공용 단 말 및 음성 분석 서버에서 시계열적으로 처리되는 단계들을 포함한다. 따라서, 이하 생략된 내용이 라고 하더라도 도 1 내지 도 6의 공용 단말 및 음성 분석 서버에 관하여 기술된 내용은 도 7에 도시 된 실시예에 따른 음성 메시지 서비스 제공 방법에도 적용될 수 있다. 도 7을 참조하면, 단계 S701에서 공용 단말은 사용자로부터 입력받은 음성 신호에 기초하여 공용 단말 에 기등록된 복수의 사용자 계정 중 음성 신호를 입력한 사용자에 해당하는 사용자 계정을 식별하고, 식별 된 사용자 계정에 대응하는 사용자로부터 입력받은 음성 메시지를 저장할 수 있다. 단계 S703에서 공용 단말은 저장된 음성 메시지에 수신자가 포함되어 있는지 여부를 판단할 수 있다. 단계 S705에서 공용 단말은 저장된 음성 메시지에 수신자가 포함되어 있지 않은 경우, 저장된 음성 메시지 를 음성 분석 서버에게 전송할 수 있다. 한편, 공용 단말은 저장된 음성 메시지에 수신자가 포함되어 있는 경우, 공용 단말에 기등록된 복수의 사용자 계정 중 수신자에 해당하는 사용자 계정으로 음성 메시지 를 전달하여 저장하도록 할 수 있다.단계 S707에서 음성 분석 서버는 공용 단말로부터 수신된 음성 메시지에 대하여 음성 메시지의 맥락 정보 및 복수의 사용자 계정에 해당하는 복수의 사용자 각각의 사용자 특정 정보에 기초하여 음성 메시지를 수 신할 수신자 정보를 도출할 수 있다. 단계 S709에서 음성 분석 서버는 도출된 수신자 정보를 공용 단말에게 전송할 수 있다. 단계 S711에서 공용 단말은 수신자 정보에 대응하는 사용자가 공용 단말에 접근하는 경우, 저장된 음 성 메시지를 출력할 수 있다. 상술한 설명에서, 단계 S701 내지 S711은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본 발명의 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행 가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이 터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다."}
{"patent_id": "10-2017-0173458", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2017-0173458", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른, 음성 메시지 서비스 제공 시스템의 구성도이다. 도 2는 본 발명의 일 실시예에 따른, 도 1에 도시된 공용 단말의 블록도이다. 도 3은 본 발명의 일 실시예에 따른, 공용 단말에서 음성 메시지 서비스를 제공하는 방법을 나타낸 흐름도이다. 도 4는 본 발명의 일 실시예에 따른, 도 1에 도시된 음성 분석 서버의 블록도이다. 도 5는 본 발명의 일 실시예에 따른 수신자 정보를 도출하는 방법을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 음성 분석 서버에서 음성 메시지 서비스를 제공하는 방법을 나타낸 흐름도 이다. 도 7은 본 발명의 일 실시예에 따른 음성 메시지 서비스를 제공하는 방법을 나타낸 동작 흐름도이다."}
