{"patent_id": "10-2022-0147287", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0065946", "출원번호": "10-2022-0147287", "발명의 명칭": "문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방법", "출원인": "주식회사 케이티", "발명자": "한연지"}}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수집한 이미지로부터 대상 객체를 인식하는 단계;상기 이미지에서 상기 대상 객체를 포함하는 대상영역을 크롭(crop)하고, 상기 대상영역 내 문자인식(OCR:Optical Character Recognition)을 수행하여 상기 대상 객체에 포함된 문자를 인식하는 단계;상기 대상 객체에서 인식한 복수의 문자열 중에서 대표 문자열을 선정하는 단계;온톨로지(ontology) 기반의 지식 그래프를 이용하여, 상기 대표 문자열에 대응하는 복수의 클래스들의 명칭들을추출하는 단계; 및상기 클래스의 명칭을 포함하는 레이블(label) 정보와, 상기 이미지를 매칭하여 데이터셋을 생성하는 단계를 포함하는, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 대상 객체를 인식하는 단계는객체 탐지 모델을 이용하여, 상기 이미지 내 포함된 대상 객체들의 위치에 대응하는 경계박스(Boundary Box)를생성하고, 상기 경계박스의 특징정보를 저장하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 경계박스의 특징정보는상기 경계박스 중 어느 하나의 모서리의 좌표정보, 상기 경계박스의 너비정보 및 높이정보를 포함하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 문자를 인식하는 단계는상기 경계박스의 특징정보를 기반으로, 상기 이미지에서 상기 대상영역을 크롭하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 대표 문자열을 선정하는 단계는상기 복수의 문자열 중에서, 크기가 가장 큰 문자를 포함하는 문자열을 상기 대표 문자열로 선정하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 대표 문자열을 선정하는 단계는상기 문자열 별로 각각의 문자들의 크기 평균을 구하고, 상기 평균이 가장 큰 문자열을 상기 대표 문자열로 선공개특허 10-2024-0065946-3-정하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 지식 그래프는각각의 객체들을 복수의 클래스로 분류하고, 각각의 클래스들은 상위 레벨부터 하위 레벨까지의 계층적 구조를형성하도록 생성한 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 명칭들을 추출하는 단계는SPARQL(Simple Protocol and RDF(Resource Description Framework) Query Language) 쿼리를 이용하여, 상기지식 그래프로부터 상기 대표 문자열에 대응하는 클래스들의 명칭을 추출하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서, 상기 데이터셋을 생성하는 단계는상기 레이블 정보로, 상기 경계박스의 특징정보, 상기 대표 문자열, 상기 클래스의 명칭 중 적어도 어느 하나를포함하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 방법."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "하드웨어와 결합하여, 제1항 내지 제9항 중 어느 하나의 항에 따른 문자인식 및 지식그래프 기반의 오토레이블링 방법을 수행하기 위하여 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "수집한 이미지로부터 대상 객체를 인식하는 객체인식부;상기 이미지에서 상기 대상 객체를 포함하는 대상영역을 크롭(crop)하고, 상기 대상영역 내 문자인식(OCR:Optical Character Recognition)을 수행하여 상기 대상 객체에 포함된 문자를 인식하며, 상기 대상 객체에서 인식한 복수의 문자열 중에서 대표 문자열을 선정하는 문자인식부;온톨로지(ontology) 기반의 지식 그래프를 이용하여, 상기 대표 문자열에 대응하는 복수의 클래스들의 명칭들을추출하는 온톨로지 추론부; 및상기 클래스의 명칭을 포함하는 레이블(label) 정보와, 상기 이미지를 매칭하여 데이터셋을 생성하는 레이블링부를 포함하는, 문자인식 및 지식그래프 기반의 오토레이블링 장치."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 객체인식부는객체 탐지 모델을 이용하여, 상기 이미지 내 포함된 대상 객체들의 위치에 대응하는 경계박스(Boundary Box)를생성하고, 상기 경계박스의 특징정보를 저장하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 장치.공개특허 10-2024-0065946-4-청구항 13 제11항에 있어서, 상기 문자인식부는상기 복수의 문자열 중에서, 크기가 가장 큰 문자를 포함하는 문자열을 상기 대표 문자열로 선정하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 장치."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 문자인식부는상기 문자열 별로 각각의 문자들의 크기 평균을 구하고, 상기 평균이 가장 큰 문자열을 상기 대표 문자열로 선정하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 장치."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 지식 그래프는각각의 객체들을 복수의 클래스로 분류하고, 각각의 클래스들은 상위 레벨부터 하위 레벨까지의 계층적 구조를형성하도록 생성한 것인, 문자인식 및 지식그래프 기반의 오토레이블링 장치."}
{"patent_id": "10-2022-0147287", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 온톨로지 추론부는SPARQL(Simple Protocol and RDF(Resource Description Framework) Query Language) 쿼리를 이용하여, 상기지식 그래프로부터 상기 대표 문자열에 대응하는 클래스들의 명칭을 추출하는 것인, 문자인식 및 지식그래프 기반의 오토레이블링 장치."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방법에 관한 것으로, 본 발명의 일 실시예에 의 한 오토레이블링 방법은, 수집한 이미지로부터 대상 객체를 인식하는 단계; 상기 이미지에서 상기 대상 객체를 포함하는 대상영역을 크롭(crop)하고, 상기 대상영역 내 문자인식(OCR: Optical Character Recognition)을 수행 하여 상기 대상 객체에 포함된 문자를 인식하는 단계; 상기 대상 객체에서 인식한 복수의 문자열 중에서 대표 문 자열을 선정하는 단계; 온톨로지(ontology) 기반의 지식 그래프를 이용하여, 상기 대표 문자열에 대응하는 복수 의 클래스들의 명칭들을 추출하는 단계; 및 상기 클래스의 명칭을 포함하는 레이블(label) 정보와, 상기 이미지 를 매칭하여 데이터셋을 생성하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 문자인식과 지식그래프를 이용하여, 이미지에 대한 레이블링을 자동으로 수행하는 오토레이블링 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 인공지능의 발전으로 인해 다양한 고성능의 알고리즘이 개발되고 있으며, 이와 함께 인공지능 학습에 필요 한 데이터 셋 생성인 데이터 레이블링에 대한 관심도 급속도로 주목받고 있는 추세이다. 데이터 레이블링이란 기계학습에 필요한 데이터를 수집, 분류, 가공하는 작업을 뜻하며, 학습 데이터 구축 시간 중 약 80% 이상을 차지할 정도의 매우 중요한 작업이다. 현재의 데이터 레이블링 방식은 크라우드 소싱 형태가 주를 이루고 있으며, 이와 같은 방식은 여러 사람이 수집한 데이터를 레이블링하여 데이터를 생성하는 방법으로, 레이블링 생성에 많은 시간이 소요되고, 비교적 기계학습에 이해도가 낮은 사람이 데이터를 생성하기 때문에 모든 레이블링 데이터를 전수조사 해야하는 번거로움이 발생하며, 레이블링 데이터에 대해 사람마다의 차이가 발생할 수 있는 소지가 있기 때문에 인공지능 모델 학습 시 모델 정확도에 영향을 줄 수 있다. 이에, 최근 데이터 라벨링을 자동화하는 데이터 오토레이블링 기술이 급부상하고 있다. 하지만, 오토레이블링 기술은 기 학습 모델을 이용하여 데이터 셋에 대한 예측을 수행하므로 새로운 데이터가 추가될 때마다 모델을 재학습 해야하는데, 재학습에 사용되는 데이터 셋을 다시 수집하고 레이블링을 진행해야하는 문제가 있다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2018-0112590호"}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 오토레이블링 모델에 대한 재학습의 필요가 없는, 문자인식 및 지식그래프 기반의 오토레이블링 장 치 및 방법을 제공하기 위한 것이다. 본 발명은, 지식그래프를 기반으로 오토레이블링을 수행하므로, 상위 개념 또는 하위 개념 등에 대한 추상적인 레이블링이 가능한, 문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방법을 제공하기 위한 것이다. 본 발명은, 데이터 증강을 용이하게 구현할 수 있는, 문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방 법을 제공하기 위한 것이다."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 문자인식 및 지식그래프 기반의 오토레이블링 방법은, 수집한 이미지로부터 대상 객체를 인식하는 단계; 상기 이미지에서 상기 대상 객체를 포함하는 대상영역을 크롭(crop)하고, 상기 대상영역 내 문자인식(OCR: Optical Character Recognition)을 수행하여 상기 대상 객체에 포함된 문자를 인식하는 단계; 상기 대상 객체에서 인식한 복수의 문자열 중에서 대표 문자열을 선정하는 단계; 온톨로지(ontology) 기 반의 지식 그래프를 이용하여, 상기 대표 문자열에 대응하는 복수의 클래스들의 명칭들을 추출하는 단계; 및 상 기 클래스의 명칭을 포함하는 레이블(label) 정보와, 상기 이미지를 매칭하여 데이터셋을 생성하는 단계를 포함 할 수 있다. 여기서 상기 대상 객체를 인식하는 단계는, 객체 탐지 모델을 이용하여, 상기 이미지 내 포함된 대상 객체들의 위치에 대응하는 경계박스(Boundary Box)를 생성하고, 상기 경계박스의 특징정보를 저장할 수 있다. 여기서 상기 경계박스의 특징정보는, 상기 경계박스 중 어느 하나의 모서리의 좌표정보, 상기 경계박스의 너비 정보 및 높이정보를 포함할 수 있다. 여기서 상기 문자를 인식하는 단계는, 상기 경계박스의 특징정보를 기반으로, 상기 이미지에서 상기 대상영역을 크롭할 수 있다. 여기서 상기 대표 문자열을 선정하는 단계는, 상기 복수의 문자열 중에서, 크기가 가장 큰 문자를 포함하는 문 자열을 상기 대표 문자열로 선정할 수 있다. 여기서 상기 대표 문자열을 선정하는 단계는, 상기 문자열 별로 각각의 문자들의 크기 평균을 구하고, 상기 평 균이 가장 큰 문자열을 상기 대표 문자열로 선정할 수 있다. 여기서 상기 지식 그래프는, 각각의 객체들을 복수의 클래스로 분류하고, 각각의 클래스들은 상위 레벨부터 하 위 레벨까지의 계층적 구조를 형성하도록 생성한 것일 수 있다. 여기서 상기 명칭들을 추출하는 단계는, SPARQL(Simple Protocol and RDF(Resource Description Framework) Query Language) 쿼리를 이용하여, 상기 지식 그래프로부터 상기 대표 문자열에 대응하는 클래스들의 명칭을 추 출하는 것일 수 있다. 여기서 상기 데이터셋을 생성하는 단계는, 상기 레이블 정보로, 상기 경계박스의 특징정보, 상기 대표 문자열, 상기 클래스의 명칭 중 적어도 어느 하나를 포함할 수 있다. 본 발명의 일 실시예에 의하면, 하드웨어와 결합하여, 상술한 문자인식 및 지식그래프 기반의 오토레이블링 방 법을 수행하기 위하여 매체에 저장된 컴퓨터 프로그램을 구현할 수 있다.본 발명의 일 실시예에 의한 오토레이블링 장치는, 수집한 이미지로부터 대상 객체를 인식하는 객체인식부; 상 기 이미지에서 상기 대상 객체를 포함하는 대상영역을 크롭(crop)하고, 상기 대상영역 내 문자인식(OCR: Optical Character Recognition)을 수행하여 상기 대상 객체에 포함된 문자를 인식하며, 상기 대상 객체에서 인 식한 복수의 문자열 중에서 대표 문자열을 선정하는 문자인식부; 온톨로지(ontology) 기반의 지식 그래프를 이 용하여, 상기 대표 문자열에 대응하는 복수의 클래스들의 명칭들을 추출하는 온톨로지 추론부; 및 상기 클래스 의 명칭을 포함하는 레이블(label) 정보와, 상기 이미지를 매칭하여 데이터셋을 생성하는 레이블링부를 포함할 수 있다. 여기서 상기 객체인식부는, 객체 탐지 모델을 이용하여, 상기 이미지 내 포함된 대상 객체들의 위치에 대응하는 경계박스(Boundary Box)를 생성하고, 상기 경계박스의 특징정보를 저장할 수 있다. 여기서 상기 문자인식부는, 상기 복수의 문자열 중에서, 크기가 가장 큰 문자를 포함하는 문자열을 상기 대표 문자열로 선정할 수 있다. 여기서 상기 문자인식부는, 상기 문자열 별로 각각의 문자들의 크기 평균을 구하고, 상기 평균이 가장 큰 문자 열을 상기 대표 문자열로 선정할 수 있다. 여기서 상기 지식 그래프는, 각각의 객체들을 복수의 클래스로 분류하고, 각각의 클래스들은 상위 레벨부터 하 위 레벨까지의 계층적 구조를 형성하도록 생성할 수 있다. 여기서 상기 온톨로지 추론부는, SPARQL(Simple Protocol and RDF(Resource Description Framework) Query Language) 쿼리를 이용하여, 상기 지식 그래프로부터 상기 대표 문자열에 대응하는 클래스들의 명칭을 추출할 수 있다. 덧붙여 상기한 과제의 해결수단은, 본 발명의 특징을 모두 열거한 것이 아니다. 본 발명의 다양한 특징과 그에 따른 장점과 효과는 아래의 구체적인 실시형태를 참조하여 보다 상세하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방법에 의하면, 새로운 데이 터가 추가되더라도 오토레이블링 모델에 대한 재학습을 수행할 필요가 없다. 또한, 오토레이블링의 정확도가 높 아지므로, 데이터 작업자의 작업시간 또한 줄일 수 있다. 본 발명의 일 실시예에 의한 문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방법에 의하면, 지식그래프 를 활용하므로 오토레이블링에 사용되는 레이블 이외에, 상위 개념 또는 하위 개념 등에 대한 추상적인 레이블 링을 수행하는 것이 가능하다. 본 발명의 일 실시예에 의한 문자인식 및 지식그래프 기반의 오토레이블링 장치 및 방법에 의하면, 상위 개념 또는 하위 개념에 대한 레이블을 이용하여 데이터 증강을 수행하는 것이 가능하다."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있 어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 명세서에 기재된 \"~부\", \"모듈\" 등의 용어는 적어 도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어 와 소프트웨어의 결합으로 구현될 수 있다. 도1은 본 발명의 일 실시예에 의한 오토레이블링 장치를 나타내는 블록도이다. 도1을 참조하면, 본 발명의 일 실시예에 의한 오토레이블링 장치는, 객체인식부, 문자인식부, 온톨로지 추론부 및 레이블링부를 포함할 수 있다. 이하, 도1을 참조하여 본 발명의 일 실시예에 의한 오토레이블링 장치를 설명한다. 객체인식부는 수집한 이미지(i)로부터 대상 객체를 인식할 수 있다. 여기서, 오토레이블링 장치는 별 도의 영상수집부(미도시)를 더 포함할 수 있으며, 영상수집부는 각각의 목적에 따라 이미지(i)들을 수집할 수 있다. 예를 들어, 영상수집부는 상품의 포장지에 글자가 표시된 상품의 이미지들을 수집할 수 있으며, 이때 각 각의 이미지 파일들은 jpg, png 등의 이미지 파일 형식을 가질 수 있다. 이후, 객체인식부는 영상수집부로 부터 제공받은 이미지(i)들에 대한 객체인식을 수행할 수 있다. 객체인식부는 기계학습 기반의 객체 탐지 모델을 이용하여 이미지(i) 내 포함된 대상 객체들을 인식할 수 있으며, 실시예에 따라서는 YOLOv5, FCOS 등 객체 탐지 모델을 활용할 수 있다. 이때, 객체 탐지 모델은 이미지 (i) 내 포함된 각각의 대상 객체들의 위치에 대응하는 경계박스(Boundary Box)들을 생성할 수 있다. 도2를 참조하면, 객체 탐지 모델은 이미지(i) 내에 포함된 음료수 캔을 대상 객체로 인식할 수 있으며, 인식한 대상 객체의 위치에 대응하는 경계박스(B)를 생성할 수 있다. 여기서, 경계박스(B)의 특징정보로 각각의 경계박 스(B)들을 구별할 수 있다. 구체적으로, 경계박스(B)의 4개의 모서리 중 어느 하나(예를 들어, 좌측 상단 모서 리)의 좌표값(x, y), 경계박스(B)의 높이(height) 및 너비(width)를 경계박스(B)의 특징정보로 생성할 수 있다. 이후, 도3에 도시한 바와 같이, 이미지(i)로부터 추출한 대상 객체를 json 포맷으로 저장할 수 있다. 여기서 \"value\" 항목에 \"x\", \"y\", \"width\", \"height\" 등의 특징정보가 포함되는 것을 확인할 수 있다. 문자인식부는 이미지(i)에서 대상 객체를 포함하는 대상영역을 크롭(crop)할 수 있다. 여기서, 문자인식부 는 객체인식부에서 생성한 경계박스(B)의 내부 영역을 대상영역으로 설정할 수 있으며, 경계박스(B) 의 특징정보로부터 대상영역을 특정하여 크롭할 수 있다. 즉, 경계박스(B)의 좌표값, 높이 및 너비를 이용하여 대상영역을 특정하고, 특정된 대상영역을 크롭할 수 있다.이후, 문자인식부는 대상영역 내 문자인식(OCR: Optical Character Recognition)을 수행하여 대상 객체에 포함된 문자를 인식할 수 있다. 즉, 이미지(i)로부터 대상영역을 크롭하여, 문자인식을 수행하는 영역을 줄일 수 있으며, 이를 통하여 문자인식에 필요한 연산량을 줄일 수 있다. 도2를 참조하면, 문자인식부는 이미지(i)로부터 대상영역을 크롭한 크롭이미지(ic)를 생성할 수 있으며, 크롭이미지(ic)에 대한 문자인식을 수행하여, 대상 객체 내에 포함된 문자들을 인식할 수 있다. 여기서는 \"PO SWEAT\"를 문자로 인식할 수 있다. 도2의 경우, 대상 객체 내에 하나의 문자열만이 포함되어 있으나, 실시예에 따라서는 복수의 문자열들이 포함되는 경우가 있을 수 있다. 이 경우, 대상 객체에서 추출한 문자를 이용하여 해당 이미지(i)에 대한 레이블링을 수행하기 위해서는, 복수의 문자열 중에서 대표 문자열을 선정할 필요가 있다. 여기서, 문자인식부는 복수의 문자열 중에서, 크기가 가장 큰 문자를 포함하는 문자열을 대표 문자열로 선정하거나, 문자열 별로 각각의 문자들의 크기 평균을 구한 후, 문자들의 평균 크기가 가장 큰 문자열을 대표 문자열로 선정하는 것도 가능하다. 다만, 이에 한정되는 것은 아니며, 실시예에 따라 다양한 방식으로 대표 문자열을 선정할 수 있다. 구체적으로, 도4(a)를 참조하면, 문자인식부는 1차적으로 워드(word) 단위로 대상영역에 대한 문자인식을 수행할 수 있다. 이 경우, 문자인식부는 각각의 복수의 문자열을 인식하여 복수의 텍스트 박스(T1, T2)를 생성할 수 있다. 이때, 각각의 텍스트 박스(T1, T2)에 대응하는 좌표값, 높이 및 너비 등의 특징정보도 생성될 수 있다. 이후, 문자인식부는 도4(b)에 도시한 바와 같이, 대표 문자열을 선정하기 위하여, 각각의 텍스트 박스(T1, T2) 내 포함된 문자에 대하여 개별 문자(character) 단위로 문자인식을 수행할 수 있다. 문자인식부는, 제 1 텍스트 박스(T1)에서 인식된 각각의 제1 문자(C1)들의 크기에 대한 평균값을 구하고, 제2 텍스트 박스(T2)에 서 인식된 제2 문자(C2)들의 크기에 대한 평균값을 구할 수 있다. 이후, 문자들의 크기 평균값이 큰 텍스트 박 스를 대표 텍스트 박스로 설정할 수 있다. 도4의 경우, 제1 텍스트 박스(T1) 내 포함된 각각의 문자(C1)들의 크기가 제2 텍스트 박스(T2) 내에 포함된 각 각의 문자(C2)들의 크기보다 크므로, 도4(c)에 도시한 바와 같이, 문자인식부는 제1 텍스트 박스(T1)를 대 표 문자열로 설정할 수 있다. 따라서, 문자인식부는 문자인식 결과로 \"PO SWEAT\"를 추출할 수 있다. 온톨로지 추론부는 온톨로지(ontology) 기반의 지식 그래프를 이용하여, 대표 문자열에 대응하는 복수의 클래스들의 명칭들을 추출할 수 있다. 예를 들어, 도2에 도시한 바와 같이, 문자인식부가 대상 객체에 대해 \"PO SWEAT\"를 대표 문자열로 추출한 경우, 온톨로지 추론부는 대표 문자열을 미리 생성된 지식 그래프 내에 입력할 수 있다. 여기서, 지식 그 래프는 각각의 객체들을 복수의 클래스로 분류하고, 각각의 클래스들은 상위 레벨부터 하위 레벨까지의 계층적 구조를 형성하도록 생성된 것일 수 있다. 도5는 지식 그래프의 일부분을 나타내는 것으로, \"과자\"라는 상위 클 래스의 하위에 \"AA링\", \"BB깡\" 등 구체적인 상품명들이 하위 클래스로 포함될 수 있다. 또한, \"음료수\"라는 상 위 클래스의 하위에 \"탄산\"과 \"비탄산\"의 하위 클래스가 포함될 수 있으며, \"탄산\"의 하위에는 \"콜라\", \"비탄산\"의 하위에 \"PO SWEAT\"와 \"CC 주스\"가 각각 포함되도록 미리 설정되어 있을 수 있다. 이 경우, 온톨로지 추론부는 대표 문자열을 이용하여 지식 그래프 내에 쿼리하여, 대표 문자열에 대응하는 클래스의 명칭들을 추출할 수 있다. 실시예에 따라서는 온톨로지 추론부가 SPARQL(Simple Protocol and RDF(Resource Description Framework) Query Language) 쿼리를 이용하여, 지식 그래프로부터 대표 문자열에 대 응하는 클래스들의 명칭을 추출할 수 있다. 도5의 경우에는, 온톨로지 추론부가 \"PO SWEAT\"를 지식 그래프 내에 쿼리할 수 있으며, 지식 그래프는 \"PO SWEAT\"가 포함되는 상위 클래스들의 명칭인 \"비탄산\", \"음료수\"를 제시할 수 있다. 레이블링부는 클래스의 명칭을 포함하는 레이블(label) 정보와, 이미지(i)를 매칭하여 데이터셋을 생성할 수 있다. 레이블링부는 온톨로지 추론부에서 추출한 각각의 클래스들의 명칭 등을 포함하도록 각각의 이미지(i)에 대해 레이블링을 수행할 수 있다. 도6에 도시한 바와 같이, 최초에는 대상 객체에 대해 문자인식한 \"PO SWEAT\"로 레이블링될 수 있으나, 레이블링부는 지식 그래프로부터 추출한 \"비탄산\", \"음료수\" 등으로 레이블링할 수 있다. 도6의 경우에는, 기존의 \"PO SWEAT\"을 \"음료수\"로 다시 레이블링한 것으로, 이와 같이 동 일한 이미지(i)에 대하여 다양한 레이블링을 붙이는 것이 가능하다. 또한, 이를 통하여 학습 데이터 증강 등을 용이하게 구현할 수 있다.여기서, 레이블 정보에는 경계박스의 특징정보, 대표 문자열, 클래스의 명칭 등이 포함될 수 있으며, 레이블링 부는 하나의 이미지(i)에 복수의 레이블 정보를 포함하도록 레이블링된 데이터 셋을 생성할 수 있다. 구체 적으로, 도7에 도시한 바와 같이, json 포맷으로 데이터셋을 생성할 수 있으며, 이때 데이터셋에는 이미지(i)에 대한 정보인 \"object.jpg\", 이미지(i) 내 포함된 대상 객체를 나타내는 경계박스(B)의 특징정보인 \"x, y, width, height\", 레이블링 정보인\"po sweat\", \"non-alcohol\", \"beverage\"등이 포함될 수 있다. 한편, 실시예에 따라서는, 데이터셋에 포함된 각각의 레이블링 정보들을 파싱(parsing)하여, 레이블링 정보 중 일부를 포함하는 학습 데이터셋을 생성하는 것도 가능하다. 구체적으로, 도8에 도시한 바와 같이, json 포맷으 로 생성된 데이터셋들 중에서, 레이블링 정보로 \"beverage\"를 포함하는 데이터들을 추출할 수 있다. 이 경우, 도8의 \"OUTPUT\"에 나타난 바와 같이, \"beverage\"를 포함하는 각각의 데이터들이 추출될 수 있으며, 이들을 하나 의 학습데이터로 활용하여 인공지능 모델 등의 학습에 활용할 수 있다. 추가적으로, 도9는 본 발명의 일 실시예에 의한 지식 그래프 및 이를 이용한 레이블링을 나타내는 개략도이다. 도9를 참조하면, 지식 그래프는 상위 레벨부터 하위 레벨까지의 각각의 클래스들이 계층적 구조를 가질 수 있으 며, 상위 레벨의 클래스에는 복수의 하위 레벨 클래스들이 연결될 수 있다. 예를 들어, \"객체\" 밑에는 \"음료\"라 는 하위 레벨 클래스가 포함될 수 있으며, \"음료\"는 다시 \"알코올성\"과 \"비알코올성\"의 2개의 하위 레벨 클래스 로 분류될 수 있다. 여기서, \"알코올성\"은 다시 \"양조주\"와 \"증류주\"로 분류되고, \"비알코올성\"은 \"탄산음료\"와 \"비탄산음료\"로 분류될 수 있다. \"양조주\"는 \"맥주\"와 \"포도주\"로 구별되며, \"포도주\"의 하단에는 각각의 \"포도 주\"의 종류를 나타내는 \"BEAUJOLAIS\", \"PINOTNOIR\" 등이 포함될 수 있다. 또한, \"탄산음료\"는 \"사이다\"를 하위 레벨 클래스로 가지고, 다시 \"사이다\"는 \"FF 소다\", \"EE 사이다\" 등 구체적인 상품명을 하위 레벨 클래스로 가 질 수 있다. 마찬가지로 \"비탄산음료\"는 \"이온\"을 하위 레벨 클래스로 가지고 \"이온\"은 \"DD 에이드\", \"PO SWEAT\" 등의 구체적인 상품명을 하위레벨 클래스로 가질 수 있다. 여기서, 지식 그래프(k)를 참조하면, \"PO SWEAT\"의 최하단 클래스(Bottom Level)은 \"PO SWEAT\"이고, 중위 클래 스(Middle Level)는 \"비알코올성\"에 해당하며, 최상위 클래스(Top Level)은 \"음료\"에 해당한다. 따라서, 지식 그래프(k)를 이용하면, \"PO SWEAT\"에 대응하는 각각의 클래스들의 명칭으로 \"PO SWEAT\", \"비알코올성\", \"음료\" 등을 추출하는 것이 가능하다. 한편, 지식 그래프(k)는 도10에 도시한 바와 같이, 웹 온톨로지 언어인 OWL(Ontololgy Web Language)을 이용하 여 구현할 수 있다. 도10을 참조하면, 온톨로지의 최상위 클래스인 \"Thing\"이나 필요에 따라 각각의 지식레벨에 대해 SPARQL 쿼리를 이용하여 각각의 대상 객체와 관련된 다양한 레이블링을 추출할 수 있다. 구체적으로, 도11(a)에 도시한 바와 같이, 대상 객체인 \"PW-ade\"의 상위 클래스를 SPARQL 쿼리를 이용하여 질의 할 수 있으며, 이에 대한 답변으로 \"non-alcohol\"을 제공받을 수 있다. 또한, 도11(b)와 같이, 대상 객체인 \"PW-ade\"의 반대 개념에 해당하는 역 클래스를 질의하는 것도 가능하며, 이 경우 \"alcohol\"을 답변으로 제공받 을 수 있다. 이와 같이, \"PW-ade\"에 대응하는 클래스들을 지식 그래프에 질의하여 제공받을 수 있으며, 제공받 은 각각의 클래스들은 이후 해당 \"PW-ade\"에 대한 레이블링시 활용할 수 있다. 또한, 도12에 도시한 바와 같이, \"PO SWEAT\", \"PW-ade\"와 동일한 레벨에 포함되는 \"GT-ade\"에 대하여도, 동일한 방식으로 상위 레벨 클래스의 명칭에 해당하는 \"sportsdrink\", \"non-alcohol\" 등을 제공받을 수 있다. 도 13은 예시적인 실시예들에서 사용되기에 적합한 컴퓨팅 환경을 설명하기 위한 블록도이다. 도시된 실시 예에서, 각 컴포넌트들은 이하에 기술된 것 이외에 상이한 기능 및 능력을 가질 수 있고, 이하에 기술된 것 이 외에도 추가적인 컴포넌트를 포함할 수 있다. 도시된 컴퓨팅 환경은 컴퓨팅 장치를 포함한다. 일 실시예에서, 컴퓨팅 장치는 문자인식 및 지식그 래프를 기반으로 하는 오토레이블링 장치(예를 들어, 오토레이블링 장치)일 수 있다. 컴퓨팅 장치는 적어도 하나의 프로세서, 컴퓨터 판독 가능 저장 매체 및 통신 버스를 포함한다. 프로세서는 컴퓨팅 장치로 하여금 앞서 언급된 예시적인 실시예에 따라 동작하도록 할 수 있 다. 예컨대, 프로세서는 컴퓨터 판독 가능 저장 매체에 저장된 하나 이상의 프로그램들을 실행할 수 있 다. 상기 하나 이상의 프로그램들은 하나 이상의 컴퓨터 실행 가능 명령어를 포함할 수 있으며, 상기 컴퓨터 실 행 가능 명령어는 프로세서에 의해 실행되는 경우 컴퓨팅 장치로 하여금 예시적인 실시예에 따른 동작들을 수행하도록 구성될 수 있다. 컴퓨터 판독 가능 저장 매체는 컴퓨터 실행 가능 명령어 내지 프로그램 코드, 프로그램 데이터 및/또는 다 른 적합한 형태의 정보를 저장하도록 구성된다. 컴퓨터 판독 가능 저장 매체에 저장된 프로그램은 프로 세서에 의해 실행 가능한 명령어의 집합을 포함한다. 일 실시예에서, 컴퓨터 판독 가능 저장 매체는 메 모리(랜덤 액세스 메모리와 같은 휘발성 메모리, 비휘발성 메모리, 또는 이들의 적절한 조합), 하나 이상의 자 기 디스크 저장 디바이스들, 광학 디스크 저장 디바이스들, 플래시 메모리 디바이스들, 그 밖에 컴퓨팅 장치 에 의해 액세스되고 원하는 정보를 저장할 수 있는 다른 형태의 저장 매체, 또는 이들의 적합한 조합일 수 있다. 통신 버스는 프로세서, 컴퓨터 판독 가능 저장 매체를 포함하여 컴퓨팅 장치의 다른 다양한 컴 포넌트들을 상호 연결한다. 컴퓨팅 장치는 또한 하나 이상의 입출력 장치를 위한 인터페이스를 제공하는 하나 이상의 입출력 인터 페이스 및 하나 이상의 네트워크 통신 인터페이스를 포함할 수 있다. 입출력 인터페이스 및 네트워 크 통신 인터페이스는 통신 버스에 연결된다. 입출력 장치는 입출력 인터페이스를 통해 컴퓨팅 장치의 다른 컴포넌트들에 연결될 수 있다. 예시적인 입출력 장치는 포인팅 장치(마우스 또는 트랙패드 등), 키보드, 터치 입력 장치(터치패드 또는 터치스크린 등), 음성 또는 소리 입력 장치, 다양한 종류의 센서 장치 및/또는 촬영 장치와 같은 입력 장치, 및/또는 디스플레이 장치, 프린터, 스피커 및/또는 네트워크 카드와 같은 출력 장치를 포함할 수 있다. 예시적인 입출력 장치는 컴퓨팅 장치를 구성하는 일 컴포넌트로서 컴퓨팅 장치의 내부에 포함될 수도 있고, 컴퓨팅 장치와는 구별되는 별개의 장치로 컴퓨팅 장치와 연결될 수도 있다. 도14는 본 발명의 일 실시예에 의한 오토레이블링 방법을 나타내는 순서도이다. 여기서, 도14의 각 단계들은 본 발명의 일 실시예에 의한 오토레이블링 장치에 의하여 수행될 수 있다. 이하, 도14를 참조하여 본 발명의 일 실시예에 의한 오토레이블링 방법을 설명한다. 오토레이블링 장치는, 수집한 이미지로부터 대상 객체를 인식할 수 있다(S110). 여기서, 오토레이블링 장치는 별도의 영상수집 단계(미도시)를 더 포함할 수 있으며, 영상수집 단계를 통하여 각각의 목적에 따른 이미지들을 수집할 수 있다. 예를 들어, 영상수집 단계에서는 상품의 포장지에 글자가 표시된 상품의 이미지들을 수집할 수 있으며, 이때 각각의 이미지 파일들은 jpg, png 등의 이미지 파일 형식을 가질 수 있다. 이후, 오토레이블링 장 치는 영상수집 단계에서 수집한 이미지들에 대한 객체인식을 수행할 수 있다. 구체적으로, 오토레이블링 장치는 기계학습 기반의 객체 탐지 모델을 이용하여 이미지 내 포함된 대상 객체들을 인식할 수 있으며, 실시예에 따라서는 YOLOv5, FCOS 등 객체 탐지 모델을 활용할 수 있다. 이때, 객체 탐지 모 델은 이미지 내 포함된 각각의 대상 객체들의 위치에 대응하는 경계박스들을 생성할 수 있으며, 각각의 경계박 스의 특징정보를 저장할 수 있다. 여기서, 경계박스의 특징정보는, 경계박스 중 어느 하나의 모서리의 좌표정보, 경계박스의 너비정보 및 높이정보를 포함할 수 있다. 실시예에 따라서는, 이미지로부터 추출한 대상 객체를 json 포맷으로 저장할 수 있다 이후, 오토레이블링 장치는, 이미지에서 상기 대상 객체를 포함하는 대상영역을 크롭하고, 대상영역 내 문자인 식을 수행하여 대상 객체에 포함된 문자를 인식할 수 있다(S120). 여기서, 오토레이블링 장치는 경계박스의 내 부 영역을 대상영역으로 설정할 수 있으며, 경계박스의 특징정보로 대상영역을 특정하여 크롭할 수 있다. 즉, 경계박스의 좌표값, 높이 및 너비를 이용하여 대상영역을 특정하고, 특정된 대상영역을 크롭할 수 있다. 오토레 이블링 장치는 대상영역 내 문자인식을 수행할 수 있으며, 대상 객체에 포함된 문자를 인식할 수 있다. 오토레이블링 장치는, 대상 객체에서 인식한 복수의 문자열 중에서 대표 문자열을 선정할 수 있다(S130). 대상 객체 내에는 복수의 문자열들이 포함될 수 있으며, 이 경우 해당 이미지에 대한 레이블링을 수행하기 위해, 복 수의 문자열 중에서 대표 문자열을 선정할 필요가 있다. 실시예에 따라서는, 복수의 문자열 중에서, 크기가 가 장 큰 문자를 포함하는 문자열을 대표 문자열로 선정거나, 문자열 별로 각각의 문자들의 크기 평균을 구한 후, 문자들의 평균 크기가 가장 큰 문자열을 대표 문자열로 선정할 수 있다. 이후, 오토레이블링 장치는, 온톨로지 기반의 지식 그래프를 이용하여, 대표 문자열에 대응하는 복수의 클래스 들의 명칭들을 추출할 수 있다(S140). 여기서, 지식 그래프는 각각의 객체들을 복수의 클래스로 분류하는 것으로, 각각의 클래스들은 상위 레벨부터 하위 레벨까지의 계층적 구조를 형성할 수 있다. 실시예에 따라서는, 지 식 그래프를 웹 온톨로지 언어인 OWL을 이용하여 구현할 수 있다. 이 경우, 오토레이블링 장치는 대표 문자열을 이용하여 지식 그래프 내에 쿼리하여, 대표 문자열에 대응하는 클래스의 명칭들을 추출할 수 있다. 예를 들어, 오토레이블링 장치는, 다양한 SPARQL 쿼리를 이용하여, 지식 그래프로부터 대표 문자열에 대응하는 클래스들의 명칭들을 추출할 수 있다. 오토레이블링 장치는, 클래스의 명칭을 포함하는 레이블 정보와, 이미지를 매칭하여 데이터셋을 생성할 수 있다 (S150). 여기서, 레이블 정보에는 경계박스의 특징정보, 대표 문자열, 클래스의 명칭 등이 포함될 수 있으며, 오토레이블링 장치는 하나의 이미지에 복수의 레이블 정보를 포함하도록 레이블링된 데이터 셋을 생성할 수 있 다. 실시예에 따라서는, json 포맷으로 데이터셋을 생성할 수 있다. 한편, 실시예에 따라서는, 데이터셋에 포함 된 각각의 레이블링 정보들을 파싱하여, 레이블링 정보 중 일부를 포함하는 학습 데이터셋을 생성하는 것도 가 능하다. 즉, 복수의 레이블링 정보를 포함하는 데이터셋을 생성한 후, 학습의 목적 등에 따라 필요한 데이터들 을 추출하여 학습 데이터셋으로 활용할 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수개 하드웨어가 결합된 형태의 다양한 기록수단 또는 저장 수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 애플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한 적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해 석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2022-0147287", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되는 것이 아니다. 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 있어, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 본 발명에 따른 구성요소를 치 환, 변형 및 변경할 수 있다는 것이 명백할 것이다."}
{"patent_id": "10-2022-0147287", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시예에 의한 오토레이블링 장치를 나타내는 블록도이다. 도2는 본 발명의 일 실시예에 의한 오토레이블링 장치의 객체인식 및 문자인식을 나타내는 개략도이다. 도3은 본 발명의 일 실시예에 의한 객체인식 결과를 json 포맷으로 나타내는 예시도이다. 도4는 본 발명의 일 실시예에 의한 오토레이블링 장치를 이용한 대표문자열 설정을 나타내는 예시도이다. 도5는 본 발명의 일 실시예에 의한 지식 그래프를 나타내는 예시도이다. 도6은 본 발명의 일 실시예에 의한 지식 그래프를 이용한 레이블링 설정을 나타내는 개략도이다. 도7은 본 발명의 일 실시예에 의한 오토레이블링 장치를 이용하여, 이미지에 대한 오토레이블링을 수행한 데이 터셋을 나타내는 예시도이다. 도8은 본 발명의 일 실시예에 의한 데이터셋으로부터 기계학습을 위한 학습데이터셋 추출을 나타내는 예시도이다. 도9는 본 발명의 일 실시예에 의한 지식 그래프 및 이를 이용한 레이블링을 나타내는 개략도이다. 도10은 본 발명의 일 실시예에 의한 지식 그래프를 웹 온톨로지 언어로 구현한 예시도이다. 도11 및 도12는 본 발명의 일 실시예에 의한 SPARQL 쿼리를 이용한 대상 객체의 다양한 레이블링 추출을 나타내 는 예시도이다. 도13은 본 발명의 다른 실시예에 의한 오토레이블링 장치를 나타내는 블록도이다. 도14는 본 발명의 일 실시예에 의한 오토레이블링 방법을 나타내는 순서도이다."}
