{"patent_id": "10-2000-0054038", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원번호": "10-2000-0054038", "출원인": "이영교", "발명자": "이영교"}}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "국가 교육청의 교육 내용을 기본 토대로 하여 지역과 학교 수준 그리고 학생들(장애인을 포함)의 교육 수준을 고려하여 개인별 또는 그룹별로 학교 내 교실 수업용 학습 지도안과 가정학습 지도안을 인터넷을 통해 제공하는 교육과정 운영시스템과,이러한 각 지도안의 작성을 지원하고 현장 교사와 학생들이 필요로 하는 다양한 보조 학습 자료를 제공하는 교육지원 시스템과,상기 운영 시스템에서 운영되는 개인별 또는 그룹별 교육 자료를 토대로 개별 학습 정도를 판단하고 학교나 학급의 회계와 교육 현황을 포함하는 제반 사항을 관리하는 학사 행정 시스템을 포함하여 이루어지되,상기 각 시스템은 컴퓨터와 인터넷을 통해 교육 운영이 가능하도록 구성된 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 교육과정 운영시스템은 멀티미디어 자료를 포함한 다양한 보조 학습 컨텐츠를 포함하는 전자 도서관과, 시중에서 구매할 수 있는 교보재나 기자재에 대한 컨설팅 및 판매/구매를 지원하는 컨설팅 시스템과 연계되어 있는 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템.12-7공개특허특2000-0072586청구항 3 제 1 항 또는 제 2 항에 있어서, 상기 교육과정 운영시스템은 국가 수준에서 요구하는 교사용 지도서 및 교과서를 포함하는 국가수준 교육 컨텐츠와, 각 시 또는 도별에서 요구하는 시도별 편성 지침과 시도별 창작 자료를 포함하는 시도수준 교육 컨텐츠와, 각 학교별 그리고 각 학급별 교육 지향 목적에 맞게 짜여진 학교수준 컨텐츠 및 학급수준 컨텐츠와, 학습 부진 또는 영재 학생, 재가 장애인의 교육 수준 및 교육 정도에 따른 관리하기 위한 개인별 맞춤식 교육(Individual Educational Program) 컨텐츠를 포함하여 이루어진 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 학교수준 컨텐츠는 교육자의 교육 방향을 안내하기 위한 교사용 지도서 항목, 학교 수준에 맞는 교과서 항목, 학교에서 차체적으로 제작한 교육 자료 항목, 교육에 필요한 참고 자료 항목을 포함하여 이루어진 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서, 상기 학급수준 컨텐츠는 실제 교실(또는 재가 장애인의 경우 가정)에서 교육을 위해 교육자가 참고하는 교사용 지도서 항목, 교육자와 피교육자가 공유하여 보는 교과서 항목, 학급지도안 항목, 학급명부 항목, 학급시간표 항목, 교육 계획 항목을 포함하여 이루어진 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서, 상기 개인별 맞춤식 교육 컨텐츠는 신상에 대한 일반 사항 항목, 보호자 인적사항 항목, 장단기 목표 항목, 관련 교육 항목, 생육력 항목, 치료 교육 항목, 검사력 항목과, 이러한 각 항목들을 일괄적으로 관리하기 위한 누가 기록부 항목을 포함하는 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항에 있어서, 상기 교육과정 운영시스템은 교육지원 시스템이나 교육자가 취득한 다양한 교육 정보를 통해 국가와 시도 교육 운영 방침에 따라 학교나 학급 수준을 고려하여 개인별 또는 그룹별 수업용으로 학습 지도안을 작성하기 위한 학교교육 전달 시스템과; 개인별 학습지도 평가나 형성 평가 결과를 바탕으로 가정이나 학교에서 학습 내용을 반복하여 학습할 수 있도록 가정학습 지도안을 제공하는 인공지능 시스템을 포함하여 이루어진 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 학교교육 전달 시스템은 이미 작성된 것이나 미리 작성한 누가기록부를 바탕으로 현재 학급의 (개인별 또는 그룹별로) 교육수준을 평가해서 학급의 교육 등급을 결정하고, 이 교육 등급에 맞는 수업용 학습 지도안을 작성하여 학급의 수업 지도안으로 사용하고, 여기에서 교육 등급이 부적절한 경우 수업용 학습 지도안을 수정하여 보완된 학습 지도안을 제공하며, 수정된 교육 내용이 부적절한 경우 다시 수업용 학습 지도안을 수정하여 대안지도안을 제공하며, 상기 각 수업용 학습 지도안을 통해 이루어진 교육 내용을 바탕으로 개인별 맞춤식 교육(Individual Educational Program)을 제시하고, 교사가 이 IEP를 근거로 개별화 교육 계획을 수립하여 누가기록부에 기록하여 이루어지는 것을 특징으로 한다."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서, 상기 인공지능 시스템은 현재 학생 개인별(또는 그룹별) 교육 수준을 평가하여 교육과정 DB로부터 학습과제를 제시하고 사용자가 이 학습과제에 대한 통과 기준과 비교하는 형성평가를 통해 상기 학습과제에 대한 학습과제의 제시나 사용자의 요구에 따라 반복학습, 심화학습, 후속 학습이 가능하도록 구성된 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서, 상기 인공지능 시스템은 각 과목별로 개인별 학습 수준을 판단하여 각 과목 중에서 12-8공개특허특2000-0072586성적이 가장 떨어지는 과목부터 가정 학습이 이루어지게 하거나 각 과목 중에서 학습자가 과목을 선택하여 학습할 수 있게 된 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서, 상기 교육지원 시스템은 교육과정 전달시스템에서 생성되는 각종 데이타를 저장하여 쉽게 검색하고 뿐만 아니라 학년별, 과목별, 진도별 그리고 과제별로 분류된 다양한 학습 정보를 얻을 수 있는 전자 도서관과, 영아와 유아용의 조기 교육을 위한 조기교육 시스템과, 각종 교보재나 기자재에 대한 컨설팅 및 판매/구매를 지원하는 컨설팅 시스템을 포함하여 이루어진 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 조기 교육 컨텐츠는 동요, 동시, 동화, 무의미음, 의성어, 단어 등의 다양한 영역을 개발시키기 위한 언어 학습 및 쓰기 학습 컨텐츠와, 생활 중심의 교육을 바탕으로 하는 산수학습 컨텐츠를 포함하는 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서, 상기 산수학습 컨텐츠는 교육 과정을 기반으로 하여 수량의 기본 요소를 생활 중심의 내용으로 연령별, 능력별로 체계화하여 제시하게 되며, 이들 조기 교육 컨텐츠는 교육 과정 운영 시스템의 내용을 학령 전 아동들에게 맞게 사용할 수 있는 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항에 있어서, 상기 학사 행정 시스템은 학교에 대한 예산과 결산을 관리하는 재정관리 DB와, 교육자료에 대한 관련 자료 DB와, 학급에 대한 관리 DB와, 그리고 개인별 교육 관리를 위한 IEP 관리 DB로 이루어진 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서, 상기 학급관리 DB에는 교육 목표, 학습지도안, 학급 인적사항, 생활기록부, 알림장 항목을 두고 이를 검색할 수 있게 된 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템."}
{"patent_id": "10-2000-0054038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서, 상기 IEP 관리 DB에는 상술한 교육과정 운영시스템(11)과 연계하여 학생을 담당하는 교육자뿐만 아니라 학교장 등이 직접 그 내용을 보고 교육 내용이나 교육 수준을 확인할 수 있게 된 것을 특징으로 하는 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템.도면12-9공개특허특2000-0072586 도면1 도면212-10공개특허특2000-0072586 도면2a 도면2b12-11공개특허특2000-0072586 도면3 도면412-12공개특허특2000-0072586"}
{"patent_id": "10-2000-0054038", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템에 관한 것으로, 국가 교육청의 교육 내용을 기본 토대로 하여 지역 환경과 학교 수준 그리고 학생들(장애인을 포함)의 교육 수준을 고려하여 개인별 또는 그룹별로 학교 내 학습 지도안과 가정학습 지도안을 제공하는 교육과정 운영시스템과, 이러 한 각 지도안의 작성 및 학생들이 필요로 하는 다양한 보조 학습 자료를 제공하는 교육지원 시스템과, 상기 운영 시스템에서 운영되는 개인별 또는 그룹별 교육 자료를 토대로 개인별 학습 목표 관리를 하며 학교나 학급의 회계와 교육 현황을 포함하는 제반 사항을 관리하는 학사 행정 시스템을 포함하여 이루어 지되, 상기 각 시스템은 컴퓨터 네트워크(인터넷)를 이용하여 실시간으로 학생들에게 교육이 이루어지게 함으로써, 학생들을 개인별 또는 그룹별로 교육 목표 관리 상황이나 교육 서비스 자체의 내용과 결과를 교사와 학부모 그리고 감독권자(예를 들어, 학교의 교장선생님)가 개인별로 또는 그룹별로 교육 정도를 용이하게 파악할 수 있게 되고, 이에 따라 피교육자인 학생 개개인에 적합한 개인별 맞춤식 교육이 가능 한 개인별 맞춤식 교육을 실현하기 위한 통합 교육 시스템을 제공하는데 그 목적이 있다."}
