{"patent_id": "10-2022-0158056", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0076023", "출원번호": "10-2022-0158056", "발명의 명칭": "골프 타석 로그인 방법 및 시스템", "출원인": "주식회사 골프존", "발명자": "정지수"}}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "골프 타석 로그인 방법에 있어서,골프 서비스 서버가 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계; 및상기 골프 서비스 서버가 상기 타석 예약 및 상기 사용자 인증을 완료하면, 골프 시뮬레이션 장치가 타석 로그인 프로세스를 수행하는 단계를 포함하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계는,상기 골프 서비스 서버가 사용자 단말 또는 관리자 단말로부터 타석 배정 요청을 수신하는 단계;상기 골프 서비스 서버가 상기 타석 배정 요청을 수신하면, 데이터베이스로 타석 배정과 관련된 사용자 정보의인증 요청을 전송하는 단계;상기 데이터베이스가 상기 사용자 정보를 검색한 후 비교 확인하는 단계;상기 골프 서비스 서버가 상기 데이터베이스로부터 상기 사용자 정보의 인증 응답을 수신하는 단계; 및상기 골프 서비스 서버가 상기 사용자 정보의 인증 응답을 수신하면, 상기 골프 서비스 서버가 상기 사용자 단말 또는 상기 관리자 단말로 타석 배정 응답을 전송하는 단계를 포함하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계는,선택 타석이 선점 가능한 타석 또는 자율 타석에 해당하는지 판단하고, 상기 선택 타석이 상기 선점 가능한 타석에 해당하면, 이용 가능한 타석 여부 및 시간대 목록 출력 가부를 판단하고,상기 선택 타석이 상기 이용 가능한 타석에 해당하고 상기 시간대 목록이 출력되거나, 이용 가능한 다른 타석및 상기 시간대 목록이 출력되면, 타석 및 시간대를 선택하고 배정하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계는,선택 타석이 선점 가능한 타석 또는 자율 타석에 해당하는지 판단하고, 상기 선택 타석이 상기 자율 타석에 해당하면, 시작 시간을 선택하고 타석을 배정하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계는,선택 타석이 선점 가능한 타석에 해당하면, 이용 가능한 타석 여부 및 시간대 목록 출력 가부를 판단하고,상기 선택 타석이 상기 이용 가능한 타석에 해당하지 않거나, 상기 이용 가능한 다른 타석 및 상기 시간대 목록공개특허 10-2024-0076023-3-이 출력되지 않으면, 상기 선택 타석을 자율 타석으로 변경하여 배정하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계는,선택 타석의 시간이 보유 이용권 시간만큼 이용 가능한지 판단하고,상기 시간이 충분하지 않으면, 상기 보유 이용권보다 짧은 시간 예약에 동의하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 타석 로그인 프로세스를 수행하는 단계는,상기 골프 서비스 서버가 상기 골프 시뮬레이션 장치로 타석 로그인 요청을 전송하는 단계;상기 골프 시뮬레이션 장치가 제공하는 콘텐츠에 사용자 정보를 동기화하도록 타석 로그인을 처리하는 단계; 및상기 골프 서비스 서버가 상기 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신하는 단계를 포함하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 타석 로그인 프로세스를 수행하는 단계는,상기 골프 서비스 서버가 상기 골프 시뮬레이션 장치로부터 상기 타석 로그인 응답을 수신하면, 상기 골프 서비스 서버가 사용자 단말 또는 관리자 단말로 타석 로그인 완료 알림을 전송하는 단계를 포함하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 타석 로그인 프로세스를 수행하는 단계는,상기 골프 서비스 서버가 상기 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신하면, 상기 골프 서비스 서버가 데이터베이스로 로그인 완료 처리 요청을 전송하는 단계;상기 데이터베이스가 상기 사용자 정보를 검색한 후 상기 사용자 정보와 관련된 정보를 갱신하는 단계; 및상기 골프 서비스 서버가 상기 데이터베이스로부터 로그인 완료 처리 응답을 수신하는 단계를 포함하는, 골프타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7 항에 있어서,상기 타석 로그인 프로세스를 수행하는 단계 이후에,상기 골프 시뮬레이션 장치에 의한 상기 타석 로그인에 따른 사용자 정보와 연동하여 상기 골프 시뮬레이션 장치에 의해 스윙 데이터를 수집하여 전송하고, 상기 골프 서비스 서버에 의해 상기 스윙 데이터를 분석하여 맞춤형 콘텐츠를 제공하는 단계를 포함하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7 항에 있어서,상기 타석 로그인 프로세스를 수행하는 단계 이후에,상기 골프 시뮬레이션 장치에 의한 상기 타석 로그인에 따른 사용자 정보와 연동하여 상기 골프 서비스 서버가공개특허 10-2024-0076023-4-상기 사용자 단말에 미션 및 보상을 제공하는 단계를 포함하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 미션 및 상기 보상을 제공하는 단계는 상기 보상으로 이용권을 제공하며,상기 타석 예약 및 상기 사용자 인증에 관한 프로세스를 수행하는 단계에서 상기 이용권을 사용하여 상기 타석예약을 진행하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 7 항에 있어서,상기 골프 시뮬레이션 장치가 제공하는 콘텐츠는,개인형 가상 골프 코스 콘텐츠, 경쟁형 가상 골프 코스 콘텐츠, 미션형 가상 골프 코스 콘텐츠, 맞춤형 골프 교육 훈련 콘텐츠, 또는 이들의 조합된 콘텐츠에 해당하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 7 항에 있어서,상기 타석 로그인을 처리하는 단계는,상기 골프 시뮬레이션 장치의 출력부를 통해 상기 타석 로그인의 상태를 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보를 출력하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 7 항에 있어서, 상기 타석 로그인을 처리하는 단계는,미리 설정된 로그인 개시 조건을 만족하면, 상기 타석 로그인의 상태를 자동으로 출력하는, 골프 타석 로그인방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 7 항에 있어서,상기 타석 로그인을 처리하는 단계는,미리 설정된 로그인 판단 루프 조건을 만족하면, 로그인 개시 조건을 비교 판단하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 7 항에 있어서,상기 타석 로그인을 처리하는 단계는,상기 골프 시뮬레이션 장치 또는 상기 골프 서비스 서버에 의해 사용자 단말의 위치 이동, 상기 사용자 단말의입력 정보, 관리자 단말의 입력 정보, 또는 이들의 조합된 정보를 기반으로 타석 변경 여부를 판단하고,상기 골프 시뮬레이션 장치 또는 상기 골프 서비스 서버에 의해 타석 변경으로 확인되면, 다른 골프 시뮬레이션장치의 출력부에 상기 타석 로그인의 상태를 출력하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 골프 시뮬레이션 장치 또는 상기 골프 서비스 서버에 의해 상기 타석 변경이 아닌 것으로 확인되면, 상기로그인의 상태를 유지하고,상기 골프 시뮬레이션 장치에서 상기 다른 골프 시뮬레이션 장치로 타석 변경이 완료되면, 상기 다른 골프 시뮬공개특허 10-2024-0076023-5-레이션 장치의 출력부에 상기 로그인의 상태를 출력하고, 상기 골프 시뮬레이션 장치에서 상기 로그인의 상태를출력하는 것을 종료하는, 골프 타석 로그인 방법."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "골프 서비스 서버에 있어서,사용자 단말 또는 관리자 단말로부터 타석 배정 요청을 수신하고, 상기 사용자 단말 또는 상기 관리자 단말로타석 배정 응답을 전송하고, 골프 시뮬레이션 장치로 타석 로그인 요청을 전송하고, 상기 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신하고, 상기 사용자 단말 또는 상기 관리자 단말로 타석 로그인 완료 알림을 전송하는 통신부; 및 상기 골프 시뮬레이션 장치로부터 상기 타석 로그인 응답을 수신한 이후에 상기 타석 로그인 완료 알림을 전송하도록 상기 통신부를 제어하는 제어부를 포함하며,상기 타석 로그인 완료 알림은 상기 골프 시뮬레이션 장치에서 미리 설정된 로그인 개시 조건에 따라 로그인의상태가 자동으로 출력되었음을 나타내는 정보인, 골프 서비스 서버."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "골프 시뮬레이션 장치에 있어서,골프 서비스 서버로부터 타석 로그인 요청을 수신하고, 상기 골프 시뮬레이션 장치로 타석 로그인 응답을 전송하는 통신부; 로그인의 상태를 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력하는 출력부; 및상기 골프 서비스 서버로부터 상기 타석 로그인 요청을 수신한 이후에 상기 로그인의 상태를 출력하는 시점을결정하는 제어부를 포함하며,상기 타석 로그인 응답은 상기 골프 시뮬레이션 장치에서 미리 설정된 로그인 개시 조건에 따라 상기 로그인의상태가 자동으로 출력되었음을 나타내는 정보인, 골프 시뮬레이션 장치."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "관리자 단말에 있어서,골프 서비스 서버로 타석 배정 요청을 전송하고, 상기 골프 서비스 서버로부터 타석 배정 응답을 수신하고, 상기 골프 서비스 서버로부터 타석 로그인 완료 알림을 수신하는 통신부; 및 상기 타석 로그인 완료 알림을 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력하는 출력부를 포함하며,상기 타석 로그인 완료 알림은 상기 골프 서비스 서버와 통신하는 골프 시뮬레이션 장치에서 미리 설정된 로그인 개시 조건에 따라 로그인의 상태가 자동으로 출력되었음을 나타내는 정보인, 관리자 단말."}
{"patent_id": "10-2022-0158056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "사용자 단말에 있어서,골프 서비스 서버로 타석 배정 요청을 전송하고, 상기 골프 서비스 서버로부터 타석 배정 응답을 수신하고, 상기 골프 서비스 서버로부터 타석 로그인 완료 알림을 수신하는 통신부; 및 상기 타석 로그인 완료 알림을 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력하는 출력부를 포함하며,상기 타석 로그인 완료 알림은 상기 골프 서비스 서버와 통신하는 골프 시뮬레이션 장치에서 미리 설정된 로그인 개시 조건에 따라 로그인의 상태가 자동으로 출력되었음을 나타내는 정보인, 사용자 단말."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "골프 타석 로그인 방법 및 시스템을 제시하며, 골프 타석 로그인 방법은, 골프 서비스 서버가 타석 예약 및 사용 자 인증에 관한 프로세스를 수행하는 단계, 및 상기 골프 서비스 서버가 상기 타석 예약 및 상기 사용자 인증을 완료하면, 골프 시뮬레이션 장치가 타석 로그인 프로세스를 수행하는 단계를 포함한다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은 골프 타석을 예약 배정하고 예약 시간에 골프 타석에서 로그인 정보를 제공 하고 로그인을 유지한 사용자에게 보상을 제공하는 골프 타석 로그인 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 스크린 골프장에 대한 인기가 높아지고 있다. 골프장 필드 이용보다 가격이 저렴하고, 장소, 시간 등 의 제약이 없이 즐길 수 있는 스크린 골프장이 골퍼의 생활권 내에 생기면서 누구나 쉽게 골프 시뮬레이션 게임 을 즐길 수 있다. 스크린 골프란, 골퍼에게 가상의 골프 코스 영상을 제공하고, 실제 골프 필드에서 플레이하는 것과 마찬가지로 골퍼가 골프 클럽을 이용하여 골프 스윙으로 골프공을 타격하면, 골프공 또는 골프 클럽의 이동 속도, 방향 등 을 센싱하여 가상의 골프 코스 상에 볼이 이동하는 모습을 영상으로 출력한다. 골퍼들이 스크린 골프장의 타석 예약을 진행하려면 매장을 직접 방문하거나 전화 예약을 해야 한다. 매장의 타 석 운영 정책과 사용자의 애플리케이션 접속에 따른 정보 동기화가 쉽지 않아서 온라인 예약이 쉽지 않다. 오프 라인 위주로 예약이 진행되다 보니 특정 날씨 환경, 특정 요일, 및 특정 시간대에 쏠림 현상으로 매장이 혼잡한 경우 예약이 어려운 실정이고, 매장에서 줄을 서서 대기해야 하는 번거로움이 있다. 매장 예약 또는 전화 예약의 경우는 별도의 알림 서비스가 없어서 예약 시간이나 타석 위치를 확인하는 것이 쉽 지 않고, 실수로 예약을 헷갈리거나 잊게 된다. 스크린 골프장에서 예약 시간이 되었을 때, 타석에서 로그인 정보를 직접 입력해야 하는 번거로움이 있어서, 성 격이 급하거나 키오스크에 익숙하지 않은 다수의 사용자들이 비회원으로 코스를 진행하고 있는 실정이다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한편, 전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다. 참고로, 특허문헌 1은 골프 연습장 예약 시스템에 관한 발명이고, 특허문헌 2는 골프 연습장 이용 서비스 시스 템에 관한 발명으로, 특허문헌 1 및 특허문헌 2는 골프 연습장 예약에 대한 일반적인 내용만을 개시하고 있을 뿐, 예약에 따른 골프 타석 로그인을 자동화하는 기술을 제공하지 아니한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1960758호(2019.03.15.) (특허문헌 0002) 한국공개특허 제10-2018-0036092호(2018.04.09.)"}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은, 온라인으로 골프 타석 배정 예약이 가능하고, 타석 예약 시간에 자동화된 로그인 방식을 제공하여 골프 시뮬레이션 사용자의 타석 로그인율을 증가시키고, 타석 로그인 중인 골프 시뮬레 이션 사용자의 스윙 데이터를 수집하여 개인형 미션과 보상을 제공할 수 있는 골프 타석 로그인 방법 및 시스템 을 제시하는데 목적이 있다. 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있으며, 일 실시예에 의해 보다 분명하게 알 게 될 것이다. 또한, 본 발명의 목적 및 장점들은 특허청구범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있 음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 골프 타석 로그인 방법은, 골프 서비스 서버가 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계; 및 상기 골프 서비스 서버가 상기 타석 예약 및 상기 사용자 인증을 완료하면, 골프 시뮬레이션 장치가 타석 로그인 프로세스를 수행하는 단계를 포함한다.다른 실시예에 따르면, 골프 서비스 서버는, 사용자 단말 또는 관리자 단말로부터 타석 배정 요청을 수신하고, 상기 사용자 단말 또는 상기 관리자 단말로 타석 배정 응답을 전송하고, 골프 시뮬레이션 장치로 타석 로그인 요청을 전송하고, 상기 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신하고, 상기 사용자 단말 또는 상기 관리자 단말로 타석 로그인 완료 알림을 전송하는 통신부, 및 상기 골프 시뮬레이션 장치로부터 상기 타석 로그 인 응답을 수신한 이후에 상기 타석 로그인 완료 알림을 전송하도록 상기 통신부를 제어하는 제어부를 포함한다. 또 다른 실시예에 따르면, 골프 시뮬레이션 장치는, 골프 서비스 서버로부터 타석 로그인 요청을 수신하고, 상 기 골프 시뮬레이션 장치로 타석 로그인 응답을 전송하는 통신부, 로그인의 상태를 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력하는 출력부, 및 상기 골프 서비스 서버로부터 상기 타석 로그인 요청을 수신한 이후에 상기 로그인의 상태를 출력하는 시점을 결정하는 제어부를 포함한다. 또 다른 실시예에 따르면, 관리자 단말은, 골프 서비스 서버로 타석 배정 요청을 전송하고, 상기 골프 서비스 서버로부터 타석 배정 응답을 수신하고, 상기 골프 서비스 서버로부터 타석 로그인 완료 알림을 수신하는 통신 부, 및 상기 타석 로그인 완료 알림을 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력하는 출력부를 포함한다. 또 다른 실시예에 따르면, 사용자 단말은, 골프 서비스 서버로 타석 배정 요청을 전송하고, 상기 골프 서비스 서버로부터 타석 배정 응답을 수신하고, 상기 골프 서비스 서버로부터 타석 로그인 완료 알림을 수신하는 통신 부, 및 상기 타석 로그인 완료 알림을 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력하는 출력부를 포함한다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 과제 해결 수단 중 어느 하나에 의하면, 온라인으로 타석 예약을 진행하여 예약 편의성을 제공하는 골프 타석 로그인 방법 및 시스템을 제시할 수 있다. 또한, 전술한 과제 해결 수단 중 어느 하나에 의하면, 타석 예약 시간에 자동화된 로그인 방식을 제공하여 골프 시뮬레이션 사용자의 타석 로그인율을 증가시키는 골프 타석 로그인 방법 및 시스템을 제시할 수 있다. 또한, 전술한 과제 해결 수단 중 어느 하나에 의하면, 타석 로그인 중인 골프 시뮬레이션 사용자의 스윙 데이터 를 수집하여 개인화 서비스에 필요한 빅데이터를 수집하는 골프 타석 로그인 방법 및 시스템을 제시할 수 있다. 또한, 전술한 과제 해결 수단 중 어느 하나에 의하면, 타석 로그인 중인 골프 시뮬레이션 사용자에게 빅데이터 분석을 통한 개인형 미션과 보상을 제공하는 골프 타석 로그인 방법 및 시스템을 제시할 수 있다. 개시되는 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "른 효과들은 아래의 기재로부터 개시되는 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 다양한 실시예들을 상세히 설명한다. 아래에서 설명되는 실시예들은 여러 가지 상이한 형태로 변형되어 실시될 수도 있다. 실시예들의 특징을 보다 명확히 설명하기 위하여, 이하의 실시"}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 널리 알려져 있는 사항들에 관해서 자세한 설명은 생략 하였다. 그리고, 도면에서 실시예들의 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부 분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 구성이 다른 구성과 \"연결\"되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경우뿐 아니라, '그 중간에 다른 구성을 사이에 두고 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성이 어떤 구성을 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 그 외 다른 구성을 제외하는 것이 아니라 다른 구 성들을 더 포함할 수도 있음을 의미한다. 이하 첨부된 도면을 참고하여 실시예들을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 골프 시뮬레이션 장치의 구현을 위한 스크린 골프 시스템을 나타낸 도면이다. 도 1에서 도시된 바와 같이, 본 명세서에 기재된 일 실시예에 따른 스크린 골프 시스템은 골퍼(U)가 골프공 (G)을 타격할 수 있는 타석매트와, 골퍼(U), 골프공(G) 및 골프클럽의 움직임 중 적어도 하나를 센싱하는 센싱장치, 스크린으로 소정의 영상을 출력하는 영상출력장치, 그리고 골프 시뮬레이션에 필요한 데 이터의 저장 및 처리 등이 이루어지는 골프 시뮬레이션 장치를 포함하여 이루어진다. 여기서 도 1에 도시 된 바와 같이, 스크린은 타석매트의 전면에 구비될 수 있으나, 이에 국한되지 않고 타석매트와 전 면 사이의 바닥에 구비되는 등, 다양한 방식으로 마련될 수 있다. 본 명세서에 기재된 일 실시예에 따른 골프 시뮬레이션 장치는 가상 골프 시뮬레이션에 필요한 데이터를 저장하며, 가상의 골프 코스에 관한 영상, 골프공의 이동 영상 등 가상 골프 시뮬레이션 관련 영상을 처리하도 록 구비된다. 그리고 가상 골프 시뮬레이션 장치가 처리한 영상은 스크린을 통해 표시된다. 골퍼(U)가 타석매트에서 골프공(G)을 스크린을 향하여 타격하면 센싱장치가 이를 센싱하여 골프 시 뮬레이션 장치로 전달하며, 가상 골프 시뮬레이션 장치는 골퍼(U), 골프공(G) 및 골프 클럽의 움직임 중 적어도 하나에 기초하여 가상의 골프 코스 상에서의 가상의 볼 이동 궤적을 시뮬레이션할 수 있다. 즉, 골프 시뮬레이션 장치가 실제 골프공의 이동 특성을 고려하여 가상골프 코스 상에서의 볼 이동 영상 등의 골프 시뮬레이션 영상 정보를 구성하고, 이를 프로젝터 등으로 구현되는 영상출력장치를 통해 스크린으로 투 사되도록 하면서 시뮬레이션을 통한 골프 경기가 진행될 수 있도록 한다. 골프 시뮬레이션 장치는 가상 골프 시뮬레이션을 위한 복잡한 조작을 처리할 수 있도록 동작하는데, 예를 들어, 골프 시뮬레이션 장치는 조작 명령을 획득함에 따라 가상 골프 시뮬레이션을 위해 골퍼를 로그인시 키거나, 시뮬레이션 환경을 조작할 수 있다. 스크린 골프 시스템는, 골퍼의 스윙 동작에 의한 골프공 또는 골프 클럽의 이동을 감지하면, 골퍼의 스윙동 작을 촬영하는 '스윙영상 카메라(미도시)'를 더 포함할 수 있다. 스윙영상 카메라는 골퍼의 스윙동작을 촬영할 수 있는 위치에 설치된다. 예컨대, 스윙영상 카메라는 타석매트 주변(전방, 후방, 측면, 또는 대각선 등)에 설 치될 수 있다. 스윙영상 카메라는 골프 시뮬레이션 장치와 통신할 수 있다. 이때 골프 시뮬레이션 장치 는 골퍼의 스윙 동작을 촬영한 영상 데이터를 수신하여 '스윙 영상'으로 저장할 수 있다. 센싱장치는, 타석매트에서 골프공(G)이 놓이는 일정 영역으로서 골프 클럽에 의해 타격이 이루어지는 영역, 즉 타격 영역을 감시하면서 타격 영역에서 골프공(G)이 골프 클럽에 의해 타격될 때의 이미지를 취득하고 그 이미지로부터 골퍼(U)의 움직임, 골프공(G)의 움직임 및 골프 클럽의 움직임 중 적어도 하나를 센싱하는 장 치이다. 센싱장치는 타격 영역을 카메라로 촬영하는 비전센서(Vision Sensor)와 같은 이미징 장치(Imaging Device) 로서 구비될 수 있다. 관련하여 도 1에서 센싱장치는 스크린 골프 시스템의 벽면에 설치된 것으로 도시되어 있으나, 이외에도 센싱장치는 스크린 골프 시스템의 천장에 설치된 센서와 스크린 골프 시스템의 측면 벽에설치된 센서로 구현되거나, 골프 시뮬레이션 장치 상에 구현될 수 있다. 예를 들어 센싱장치가 2 개의 비전센서로 구현되면 두 비전센서가 타격 영역에서 오버래핑하여 감시할 수 있는데 이는 하나의 예로서 반드시 이에 한정되지 않고 둘 이상의 비전센서가 설치되는 경우도 포함하며 비전 센서의 설치 위치도 천정이나 벽면뿐 만 아니라 스크린 골프 시스템의 부스(Booth) 내 임의의 위치에 설치되는 경우를 모두 포함할 수 있다. 센싱장 치는 IR센서나 레이더 센서 등으로 마련될 수 있음은 물론이다. 센싱장치는 골퍼, 골프공 및 골프클럽 중 적어도 하나의 움직임을 센싱함에 따라 골프공의 이동에 대한 운 동 파라미터 등의 센싱 정보를 산출하여 골프 시뮬레이션 장치로 전달하고 골프 시뮬레이션 장치는 센싱 정보로부터 샷데이터를 산출할 수 있다. 골프 시뮬레이션 장치는 스크린 골프 시스템에 적용됨을 상술하고 있으나 반드시 스크린 골프 시스템 에 한정하여 적용되지 않고, 가상의 골프 코스를 시뮬레이션하여 영상화하고 이에 가상의 볼이 움직이는 영 상이 시뮬레이션되는 모든 형태의 시스템 내지는 장치에 적용 가능하다. 도 2는 일 실시예에 따른 골프 시뮬레이션 장치를 포함하는 타석 로그인 시스템을 예시한 도면이다. 도 2에 도시된 바와 같이 타석 로그인 시스템은 골프 시뮬레이션 장치, 골프 서비스 서버, 데이터베 이스, 관리자 단말, 및 사용자 단말이 네트워크로 연결되어 통신하는 서버-클라이언트 시스템으 로 구현될 수 있다. 골프 서비스 서버 및 골프 시뮬레이션 장치가 서로 협력하여 하나의 서버-클라이언트 시스템으로 구 현될 수 있고, 골프 서비스 서버, 관리자 단말 및 사용자 단말이 서로 협력하여 하나의 서버-클 라이언트 시스템으로 구현될 수 있고, 골프 시뮬레이션 장치, 관리자 단말 및 사용자 단말이 서 로 협력하여 하나의 서버-클라이언트 시스템으로 구현될 수 있다. 골프 시뮬레이션 장치 및 골프 서비스 서버는 사용자 단말을 통해 사용자 계정과 상호작용하고, 관리자 단말을 통해 관리자 계정과 상호작용하면서, 스크린 골프 사용자 및 스크린 골프 관리자로 하여금 골프 시뮬레이션 장치 및 골프 서비스 서버에 의해 제공되는 가상 골프 콘텐츠 서비스를 제공받을 수 있도록 한다. 관리자 단말 및 사용자 단말은 네트워크를 통해 원격지의 서버에 접속하거나, 타 단말 및 서버와 연 결 가능한 컴퓨터나 휴대용 단말기, 텔레비전, 웨어러블 디바이스(Wearable Device) 등으로 구현될 수 있다. 여 기서, 컴퓨터는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop)등을 포함하고, 휴대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), GSM(Global System for Mobile communications), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet), 스마트폰(Smart Phone), 모바일 WiMAX(Mobile Worldwide Interoperability for Microwave Access) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 또한, 텔레비전은 IPTV(Internet Protocol Television), 인터넷 TV(Internet Television), 지 상파 TV, 케이블 TV 등을 포함할 수 있다. 나아가 웨어러블 디바이스는 예를 들어, 시계, 안경, 액세서리, 의복, 신발 등 인체에 직접 착용 가능한 타입의 정보처리장치로서, 직접 또는 다른 정보처리장치를 통해 네트워 크를 경유하여 원격지의 서버에 접속하거나 타 단말과 연결될 수 있다. 골프 시뮬레이션 장치 및 관리자 단말은 스크린 골프 시스템을 운영하는 매장에서 키오스크 형태 로 설치될 수도 있다. 골프 시뮬레이션 장치 및 골프 서비스 서버는 사용자와의 인터랙션을 위한 애플리케이션이나 웹브라 우저가 설치된 사용자 단말 및 관리자와의 인터랙션을 위한 애플리케이션이나 웹브라우저가 설치된 관리자 단말과 네트워크를 통해 통신이 가능한 컴퓨터로 구현되거나, 클라우드 컴퓨팅 서버로 구현될 수도 있다. 골프 시뮬레이션 장치 및 골프 서비스 서버는 데이터를 저장할 수 있는 저장장치를 포함하거나, 데이 터베이스를 통해 데이터를 저장할 수 있다. 골프 시뮬레이션 장치, 골프 서비스 서버, 데이터베이스, 관리자 단말, 및 사용자 단말 의 각 구성을 구체적으로 살펴보면, 도 2에 도시된 바와 같이 입출력부(110, 210, 310, 410, 510), 저장부 (120, 220, 320, 420, 520), 제어부(130, 230, 330, 340, 350), 및 통신부(140, 240, 340, 440, 540)를 포함할수 있다. 입출력부(110, 210, 310, 410, 510)는 정보를 입력받고 처리한 결과를 출력하는 입출력수단으로 구성될 수 있다. 입출력부(110, 210, 310, 410, 510)는 입력을 수신하기 위한 입력부와, 작업의 수행 결과 또는 상태 등의 정보를 표시하기 위한 출력부를 포함할 수 있다. 예를 들어, 입출력부(110, 210, 310, 410, 510)는 조작자 입력 을 수신하는 조작 패널(operation panel) 및 화면을 표시하는 디스플레이 패널(display panel) 등을 포함할 수 있다. 입력부는 키보드, 물리 버튼, 터치 스크린, 카메라 또는 마이크 등과 같이 다양한 형태의 조작자 입력을 수신할 수 있는 장치들을 포함할 수 있다. 출력부는 디스플레이 패널, 스피커, 또는 진동장치 등을 포함할 수 있다. 이 에 한정되지 않고 입출력부(110, 210, 310, 410, 510)는 다양한 입출력을 지원하는 구성을 포함할 수 있다. 입출력부(110, 210, 310, 410, 510)는 통신부(140, 240, 340, 440, 540)와 별도로 정보를 입력받을 수 있으며, 필요한 정보의 일부를 이전에 입력하여 저장된 항목으로부터 추출하여 획득할 수 있다. 저장부(120, 220, 320, 420, 520)에는 파일이나 프로그램 등과 같은 다양한 종류의 데이터가 설치 및 저장될 수 있다. 제어부(130, 230, 330, 430, 530)는 저장부(120, 220, 320, 420, 520)에 저장된 데이터에 접근하여 이를 이용하거나, 또는 새로운 데이터를 저장부(120, 220, 320, 420, 520)에 저장할 수도 있다. 또한, 제어부(130, 230, 330, 430, 530)는 저장부(120, 220, 320, 420, 520)에 설치된 프로그램을 실행할 수도 있다. 저장부(120, 220, 320, 420, 520)에는 로그인에 필요한 정보 및 로그인 상태가 저장될 수 있다. 저장부(120, 220, 320, 420, 520)에는 로그인에 이용되는 알고리즘이 저장될 수 있다. 이러한 알고리즘은 미리 정해진 규칙 을 기반으로 정의될 수 있으며, 특정 함수를 포함하거나 인공신경망 등 머신러닝 모델을 포함할 수 있다. 제어부(130, 230, 330, 430, 530)는 각 장치(100, 200, 300, 400, 500)의 전체적인 동작을 제어하며, CPU, GPU 등과 같은 프로세서를 포함할 수 있다. 제어부(130, 230, 330, 430, 530)는 저장부(120, 220, 320, 420, 520) 에 저장된 프로그램을 실행시키거나, 저장부(120, 220, 320, 420, 520)에 저장된 알고리즘이나 인공지능 모델을 이용하여 데이터를 연산할 수 있다. 또한 제어부(130, 230, 330, 430, 530)는 처리된 데이터를 다시 저장부 (120, 220, 320, 420, 520)에 저장할 수 있다. 통신부(140, 240, 340, 440, 540)는 다른 장치의 통신부에 연결되어 정보를 송수신할 수 있다. 통신부(140, 240, 340, 440, 540)는 다른 디바이스 또는 네트워크와 유무선 통신을 수행할 수 있다. 이를 위해, 통신부(140, 240, 340, 440, 540)는 다양한 유무선 통신 방법 중 적어도 하나를 지원하는 통신 모듈을 포함할 수 있다. 예를 들어, 통신 모듈은 칩셋(Chipset)의 형태로 구현될 수 있다. 통신부(140, 240, 340, 440, 540)가 지원하는 무선 통신은, 예를 들어 세대별 이동 통신, Wi-Fi(Wireless Fidelity), Wi-Fi Direct, 블루투스(Bluetooth), UWB(Ultra Wide Band) 또는 NFC(Near Field Communication) 등일 수 있다. 또한, 통신부(140, 240, 340, 440, 540)가 지원하는 유선 통신은, 예를 들어 랜 케이블, USB 또 는 HDMI(High Definition Multimedia Interface) 등일 수 있다. 골프 시뮬레이션 장치의 제어부의 동작은 골프 시뮬레이션 장치에서 모두 구현되거나, 일부는 골프 시뮬레이션 장치에서 구현되고 나머지는 골프 시뮬레이션 장치와 통신하는 골프 서비스 서버 의 제어부에서 구현될 수 있다. 관리자 단말의 통신부는 골프 서비스 서버로 타석 배정 요청을 전송하고, 골프 서비스 서버 로부터 타석 배정 응답을 수신하고, 골프 서비스 서버로부터 타석 로그인 완료 알림을 수신할 수 있 다. 관리자 단말의 출력부는 타석 로그인 완료 알림을 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력할 수 있다. 관리자 단말의 출력부가 출력하는 타석 로그인 완료 알림은 골프 서비스 서버와 통신하는 골프 시뮬 레이션 장치에서 미리 설정된 로그인 개시 조건에 따라 로그인의 상태가 자동으로 출력되었음을 나타내는 정보일 수 있다. 사용자 단말의 통신부는 골프 서비스 서버로 타석 배정 요청을 전송하고, 골프 서비스 서버 로부터 타석 배정 응답을 수신하고, 골프 서비스 서버로부터 타석 로그인 완료 알림을 수신할 수 있 다.사용자 단말의 출력부는 타석 로그인 완료 알림을 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력할 수 있다. 사용자 단말의 출력부가 출력하는 타석 로그인 완료 알림은 골프 서비스 서버와 통신하는 골프 시뮬 레이션 장치에서 미리 설정된 로그인 개시 조건에 따라 로그인의 상태가 자동으로 출력되었음을 나타내는 정보일 수 있다. 골프 서비스 서버의 통신부는 사용자 단말 또는 관리자 단말로부터 타석 배정 요청을 수신 하고, 사용자 단말 또는 관리자 단말로 타석 배정 응답을 전송하고, 골프 시뮬레이션 장치로 타 석 로그인 요청을 전송하고, 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신하고, 사용자 단말 또는 관리자 단말로 타석 로그인 완료 알림을 전송할 수 있다. 골프 서비스 서버의 제어부는 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신한 이후에 타석 로그인 완료 알림을 전송하도록 통신부를 제어할 수 있다. 골프 서비스 서버의 통신부가 전송하는 타석 로그인 완료 알림은 골프 시뮬레이션 장치에서 미 리 설정된 로그인 개시 조건에 따라 로그인의 상태가 자동으로 출력되었음을 나타내는 정보일 수 있다. 골프 시뮬레이션 장치의 통신부는 골프 서비스 서버로부터 타석 로그인 요청을 수신하고, 골프 시뮬레이션 장치로 타석 로그인 응답을 전송할 수 있다. 골프 시뮬레이션 장치의 제어부는 골프 서비스 서버로부터 타석 로그인 요청을 수신한 이후에 로그인의 상태를 출력하는 시점을 결정할 수 있다. 골프 시뮬레이션 장치의 출력부는 로그인의 상태를 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보로 출력할 수 있다. 골프 시뮬레이션 장치의 출력부가 출력하는 타석 로그인 응답은 골프 시뮬레이션 장치에서 미리 설정 된 로그인 개시 조건에 따라 로그인의 상태가 자동으로 출력되었음을 나타내는 정보일 수 있다. 도 3 및 도 4는 다른 실시예에 따른 타석 로그인 방법을 예시한 흐름도이다. 타석 로그인 방법은 골프 시뮬레이션 장치, 골프 서비스 서버, 데이터베이스, 관리자 단말 , 및 사용자 단말 일부 또는 전부에서 처리되는 단계들을 포함한다. 도 3을 참조하면, S310 단계에서 골프 서비스 서버가 타석 예약 및 사용자 인증에 관한 프로세스를 수행한 다. S320 단계에서 골프 서비스 서버가 타석 예약 및 사용자 인증을 완료하면, 골프 시뮬레이션 장치(10 0)가 타석 로그인 프로세스를 수행한다. 도 4를 참조하면, 타석 예약 및 사용자 인증에 관한 프로세스를 수행하는 단계(S310)는, 골프 서비스 서버(20 0)가 사용자 단말 또는 관리자 단말로부터 타석 배정 요청을 수신하는 단계(S410), 골프 서비스 서버 가 타석 배정 요청을 수신하면, 데이터베이스로 타석 배정과 관련된 사용자 정보의 인증 요청을 전송 하는 단계(S415), 데이터베이스가 사용자 정보를 검색한 후 비교 확인하는 단계(S420), 골프 서비스 서버 가 데이터베이스로부터 사용자 정보의 인증 응답을 수신하는 단계(S425), 및 골프 서비스 서버 가 사용자 정보의 인증 응답을 수신하면, 골프 서비스 서버가 사용자 단말 또는 관리자 단말로 타석 배정 응답을 전송하는 단계(S430)를 포함할 수 있다. 사용자 단말 또는 관리자 단말로부터 골프 서비스 서버로 전송되는 타석 배정 요청은 타석 번호, 사용자 정보(예컨대, 회원 번호, 연락처, 닉네임 등), 시작 시간, 및 종료 시간을 포함할 수 있다. 예를 들어 사용자 정보를 전송할 때 i) 타석 번호와 함께 앱 로그인 정보를 전송함으로써 사용자 정보를 전송하거나 ii) 사용자(또는 관리자)에 의해 입력된 회원번호, 연락처 등과 함께 타석 번호를 전송할 수 있다. 로그인에 필 요한 정보를 전송할 때, i) 시뮬레이션 장치나 관리자 단말를 통해 표시된 QR코드를 사용자 단말 (500; 또는 사용자단말에 설치된 앱)로 촬영하는 방식, ii) 시뮬레이션 장치나 관리자 단말를 통해 표시된 숫자를 사용자 단말(500; 또는 사용자단말에 설치된 앱)에 입력하는 방식 등으로 앱에 저장된 사용자 정 보를 전송함으로써 인증 및 동기화를 위한 정보를 전송할 수 있다. 데이터베이스는 사용자 정보를 검색한 후 비교 확인하는 단계(S420)를 거쳐서 사용자 인증을 수행할 수 있 다. 골프 서비스 서버는 타석 예약 및 배정에 대한 결과로 성공 또는 실패를 나타내는 정보를 전송할 수 있다. 타석 로그인 프로세스를 수행하는 단계(S320)는, 골프 서비스 서버가 골프 시뮬레이션 장치로 타석 로그인 요청을 전송하는 단계(S435), 골프 시뮬레이션 장치가 제공하는 콘텐츠에 사용자 정보를 동기화하 도록 타석 로그인을 처리하는 단계(S440), 및 골프 서비스 서버가 골프 시뮬레이션 장치로부터 타석 로그인 응답을 수신하는 단계(S445)를 포함할 수 있다. 타석 로그인 프로세스를 수행하는 단계(S320)는 자동으로 타석 로그인을 처리한 후 모바일/백오피스를 통해 알 림을 제공할 수 있다. 타석 로그인 프로세스를 수행하는 단계(S320)는, 골프 서비스 서버가 골프 시뮬레이션 장치로부터 타 석 로그인 응답을 수신하면, 골프 서비스 서버가 사용자 단말 또는 관리자 단말로 타석 로그인 완료 알림을 전송하는 단계를 포함할 수 있다. 타석 로그인 프로세스를 수행하는 단계(S320)는, 골프 서비스 서버가 골프 시뮬레이션 장치로부터 타 석 로그인 응답을 수신하면, 골프 서비스 서버가 데이터베이스로 로그인 완료 처리 요청을 전송하는 단계(S450), 데이터베이스가 사용자 정보를 검색한 후 사용자 정보와 관련된 정보를 갱신하는 단계(S455), 및 골프 서비스 서버가 데이터베이스로부터 로그인 완료 처리 응답을 수신하는 단계(S460)를 포함할 수 있다. 타석 로그인 프로세스를 수행하는 단계(S320)는, 타석 로그인 응답을 전송하는 단계(S455), 또는 타석 로그인 완료 알림을 전송하는 단계(S465) 이후에, 골프 시뮬레이션 장치에 의한 타석 로그인에 따른 사용자 정보 와 연동하여 골프 시뮬레이션 장치에 의해 스윙 데이터를 수집하여 골프 서비스 서버로 전송하고, 골 프 서비스 서버에 의해 스윙 데이터를 분석하여 맞춤형 콘텐츠를 제공하는 단계를 포함할 수 있다. 맞춤형 콘텐츠를 제공하는 단계는 골퍼의 성별, 나이, 체형, 근력, 유연성 등의 기본 신체 조건 파악을 수행하 고, 스윙 자세에 따른 관절 변화, 신체 동작 등의 개인별 데이터를 축적 분석하며, 골퍼의 샷 정보를 스윙과 거 리, 궤도, 구질에 따라 분석하여 적절한 콘텐츠를 매칭하여 제공한다. 타석 로그인 프로세스를 수행하는 단계(S320)는, 타석 로그인 응답을 전송하는 단계(S455), 또는 타석 로그인 완료 알림을 전송하는 단계(S465) 이후에, 골프 시뮬레이션 장치에 의한 타석 로그인에 따른 사용자 정보 와 연동하여 골프 서비스 서버가 사용자 단말에 미션 및 보상을 제공하는 단계를 포함할 수 있다. 골프 시뮬레이션 장치가 제공하는 콘텐츠는, 개인형 가상 골프 코스 콘텐츠, 경쟁형 가상 골프 코스 콘텐츠, 미 션형 가상 골프 코스 콘텐츠, 맞춤형 골프 교육 훈련 콘텐츠, 또는 이들의 조합된 콘텐츠에 해당한다. 타석 로그인을 처리하는 단계(S440)는, 골프 시뮬레이션 장치의 출력부를 통해 로그인의 상태를 시각 정보, 청각 정보, 촉각 정보, 또는 이들의 조합된 정보를 출력할 수 있다. 타석 로그인을 처리하는 단계(S440)는, 미리 설정된 로그인 개시 조건을 만족하면, 로그인의 상태를 자동으로 출력할 수 있다. 로그인 개시 조건은 현재 시간이 예약 시작 시간에 해당하거나 예약 시작 시간을 도과하는 시간 기반 방식, 사 용자 단말이 골프 시뮬레이션 장치로부터의 거리가 일정 범위 내에 위치하는 거리 기반 방식, 사용자 단말에 설치된 애플리케이션의 활성화에 따라 특정 메시지를 골프 시뮬레이션 장치로 전송하는 통신 기반 동기화 방식 등으로 설정될 수 있다. 따라서, 현재 시간이 예약 시작 시간에 해당하거나 예약 시작 시간을 도과하면 로그인 개시 조건이 만족된다고 판단하거나, 사용자 단말이 골프 시뮬레이션 장치로부터의 거리가 일정 범위 내에 위치한다면 로그인 개시 조건이 만족된다고 판단하거나, 사용자 단말에 설치된 애 플리케이션의 활성화에 따라 특정 메시지를 골프 시뮬레이션 장치로 전송하면 로그인 개시 조건이 만족된 다고 판단할 수 있다. 타석 로그인을 처리하는 단계(S440)는, 미리 설정된 로그인 판단 루프 조건을 만족하면, 로그인 개시 조건을 비 교 판단할 수 있다. 로그인 개시 조건을 매장 영업 시간 내내 무한하게 판단할 수 없기 때문이다. 로그인 판단 루프 조건은 예약 시작 시간 내지 예약 종료 시간 범위를 고려하여 설정될 수 있다. 예약 시작 시 간 내지 예약 종료 시간 범위는 일종의 시간 슬롯으로 구분될 수 있다. 세분화된 시간 슬롯을 적용하면 특정 타 석을 예약할 때 연속적인 시간을 채우지 않고도 징검다리 형태로 시간 예약이 가능하다. 예컨대, 로그인 판단 루프 조건은 i) 예약한 사용자가 아직 도착하지 않은 상황에서 시간 슬롯에 따라 현재 시 간이 예약 시작 시간 내지 예약 종료 시간 범위 내에 있는지 판단하는 조건, ii) 예약 시작 시간 내지 예약 종 료 시간 범위 내에서 예약을 취소하지 않은 상황에 해당하는지 판단하는 조건 등으로 설정될 수 있다. 따라서 예를 들어 예약한 사용자가 아직 도착하지 않은 상황에서 시간 슬롯에 따라 현재 시간이 예약 시작 시간 내지 예약 종료 시간 범위 내에 있다면 로그인 판단 루프 조건이 만족된다고 판단하거나, 예약 시작 시간 내지 예약 종료 시간 범위 내에서 예약을 취소하지 않은 상황에 해당한다면 로그인 판단 루프 조건이 만족된다고 판단할 수 있다. 예약한 사용자가 타석에 도착한 후 타석에서 스윙하다가 특정 상황이 발생하거나 선호하는 타석이 시간 슬롯 단 위로 중간에 공석이 되는 상황이 발생하여, 사용자가 타석을 변경하면 로그인 판단 루프 조건은 다른 골프 시뮬 레이션 장치에서 시간 슬롯 단위로 다시 적용되거나 시간 슬롯 단위로 생략 처리될 수 있다. 다른 골프 시뮬레 이션 장치에서 다시 로그인한 것으로 처리할지, 로그인이 유지된 것으로 처리할지에 따라 로그인에 따른 보상이 달라질 수 있기 때문에 로그인 처리에 관한 명확한 기준을 제공할 필요가 있다. 예컨대, 접속 횟수 또는 접속 지속 시간 등이 보상 가중치로 적용될 수 있다. 타석 로그인을 처리하는 단계(S440)는, 골프 시뮬레이션 장치 또는 골프 서비스 서버에 의해 사용자 단말의 위치 이동, 사용자 단말의 입력 정보, 관리자 단말의 입력 정보, 또는 이들의 조합된 정 보를 기반으로 타석 변경 여부를 판단할 수 있다. 골프 시뮬레이션 장치 또는 골프 서비스 서버에 의해 타석 변경으로 확인되면, 다른 골프 시뮬레이션 장치의 출력부에 로그인의 상태를 출력할 수 있다. 골프 시뮬레이션 장치 또는 골프 서비스 서버에 의해 타석 변경이 아닌 것으로 확인되면, 로그인의 상태를 유지할 수 있다. 골프 시뮬레이션 장치에서 다른 골프 시뮬레이션 장치로 타석 변경이 완료되면, 다른 골프 시뮬레이 션 장치의 출력부에 로그인의 상태를 출력하고, 골프 시뮬레이션 장치에서 로그인의 상태를 출력하는 것을 종료할 수 있다. 도 5 내지 도 8은 다른 실시예에 따른 타석 로그인 방법에서 관리자 단말로 시도하는 타석 배정을 예시한 흐름 도이다. 도 5를 참조하면, S510 단계에서 관리자 단말은 매장회원 여부를 판단한다. 예컨대, 매장 입구에서 촬영된 사진 또는 획득된 지문 등의 정보를 통해 확인할 수 있다. S520 단계에서 회원이면 회원명 또는 휴대폰번호 4자 리를 이용하여 회원정보를 검색한다. 비회원이면 회원검색 단계를 생략한다. S530 단계에서 이용 가능한 이용권 목록이 출력되는지 판단한다. 이용권 목록에는 구매에 의해 이용권, 보상으 로 제공받은 이용권 등이 표시될 수 있다. 비회원으로 체크시 비회원 상품이 출력될 수 있다. 이용권 목록이 출 력되지 않으면 회원정보를 다시 검색할 수 있다. S540 단계에서 이용권을 선택하고, S550 단계에서 특정 타석을 입력하여 선택한다. 관리자 단말은 타석을 입력하는 과정에서 타석 목록을 제공받을 수 있다. 관리자 단말은 타석 목록에 출력된 타석 번호를 선택하 거나 타석 번호를 직접 입력할 수 있다. S550 단계 이후에 관리자 단말에 설치된 애플리케이션의 유형 및 버전에 따라 상이한 타석 배정 프로세스 가 진행될 수 있다. S530 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장치에 저장된 데이터, 골프 서비스 서버에 저장된 데이터 또는 데이터베이스에 저장된 데이터를 기준으로 판단할 수 있다. 도 6을 참조하면, S550 단계 이후에 S610 단계에서 선택 타석이 이용 가능한 타석에 해당하는지 여부 및 시간대 목록이 출력되는지 판단한다. S610 단계에서 선택 타석이 이용 가능한 타석에 해당하는지 여부와 함께 이용 가 능한 다른 타석이 출력될 수 있다. S620 단계에서 타석 및 시간대를 선택하고 타석을 배정한다. S610 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장치에 저장된 데이터, 골프 서비스 서버에 저장된 데이터 또는 데이터베이스에 저장된 데이터를 기준으로 판단할 수 있다. 도 7을 참조하면, S550 단계 이후에 S710 단계에서 선택 타석이 선점 가능한 타석인지 판단한다. 타석의 위치를 미리 선점할 수 있으면 선점 가능한 타석이고, 아니면 자율 타석에 해당한다. 선점 가능한 타석이면, S720 단계 에서 선택 타석이 이용 가능한 타석에 해당하는지 여부 및 시간대 목록이 출력되는지 판단한다. S720 단계에서선택 타석이 이용 가능한 타석에 해당하는지 여부와 함께 이용 가능한 다른 타석이 출력될 수 있다. 자율 타석 이면, S730 단계에서 시작 시간을 선택하고 타석을 배정한다. S720 단계에서 선택 타석이 이용 가능한 타석에 해당하지 않거나, 이용 가능한 다른 타석 및 시간대 목록이 출력되지 않으면, S730 단계를 진행한다. 즉, 자율 타석으로 변경하여 처리할 수 있다. S720 단계에서 선택 타석이 이용 가능한 타석에 해당하고 시간대 목록이 출 력되거나, 이용 가능한 다른 타석 및 시간대 목록이 출력되면, S740 단계에서 타석 및 시간대를 선택하고 타석 을 배정한다. S750 단계에서 선택 타석이 보유 이용권 시간만큼 이용 가능한지 판단한다. 시간이 충분하면, 다음으로 진행한 다. 시간이 충분하지 않으면, S760 단계에서 이용권보다 짧은 시간 예약에 동의하여 다음으로 진행한다. S720 단계 및 S750 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장치에 저장된 데이터, 골프 서비 스 서버에 저장된 데이터 또는 데이터베이스에 저장된 데이터를 기준으로 판단할 수 있다. 도 8을 참조하면, S620 단계, S750 단계, 또는 S760 이후에 S810 단계에서 이미 예약한 타석이 있거나 기간제 상품 이용시 당일 타석 이용 여부를 판단한다. 기간제는 하루에 1회만 이용 가능한 제한이 설정될 수 있다. 이 미 예약한 타석이 있거나 기간제 상품 이용시 당일 타석을 이용했으면, S870 단계에서 타석 예약이 불가하다는 정보를 출력한다. S810 단계에서 이미 예약한 타석이 없고 기간제 상품 이용시 당일 타석을 이용하지 않았으면, S820 단계에서 예 약이 불가한 시간에 해당하는지 판단한다. S820 단계에서 예약이 불가한 시간에 해당하면, S870 단계를 진행한 다. S820 단계에서 예약이 불가한 시간에 해당하지 않으면, S830 단계에서 예약이 불가한 기간에 해당하는지 판단한 다. S830 단계에서 예약이 불가한 기간에 해당하면, S870 단계를 진행한다. S830 단계에서 예약이 불가한 기간에 해당하지 않으면, S840 단계에서 이용권 중지에 해당하는지 판단한다. S840 단계에서 이용권 중지에 해당하면, S870 단계를 진행한다. S840 단계에서 이용권 중지에 해당하지 않으면, S850 단계에서 선택 시각이 다른 사용자에게 선점되었는지 판단 한다. S850 단계에서 선택 시각이 다른 사용자에게 선점되었으면, S870 단계를 진행한다. S850 단계에서 선택 시각이 다른 사용자에게 선점되지 않았으면, S860 단계에서 회원 정보를 사전 인증하고, 예 약을 완료한다. S810 단계, S820 단계, S830 단계, S840 단계, 및 S850 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장 치에 저장된 데이터, 골프 서비스 서버에 저장된 데이터 또는 데이터베이스에 저장된 데이터를 기준으로 판단할 수 있다. 이용권과 관련하여, 예약된 시간 정보와 사용자가 보유한 이용권에 포함된 시간 정보를 비교하여, 사용자가 보 유한 이용권에 포함된 시간 정보가 예약된 시간 정보보다 적은 경우(예컨대, 사용자가 보유한 이용권에 포함된 잔여 시간이 1시간이고, 사용자가 타석에 대해 예약한 시간이 2시간인 경우), 예약 진행을 위한 '조건형 후결제 쿠폰'을 발급하고, 사용자가 발급된 '조건형 후결제 쿠폰'을 자신이 보유한 이용권과 결합하여 예약을 완료하는 단계를 적용할 수 있다. 이때, '조건형 후결제 쿠폰'은 예약의 진행을 위해 필요한 부족 시간 정보가 포함될 수 있으며, 부족 시간 정보 는 “이용권 잔여 시간 정보 및 예약 시간 정보”에 기초하여 산출될 수 있다. 한편, '조건형 후결제 쿠폰'은 미리 설정된 조건의 충족 여부에 기초하여 사용자가 골프 시뮬레이션 장치가 제 공하는 콘텐츠의 이용을 완료한 이후에, 발급 비용의 결제 여부가 결정될 수 있다. 예를 들어, 사용자가 골프 시뮬레이션 장치가 제공하는 콘텐츠를 이용한 연습 라운드에서 총 타수가 미리 설정된 타수 이내인 경우에는 쿠 폰 발급에 따른 비용을 요구하지 않고(쿠폰 무료 제공), 사용자가 골프 시뮬레이션 장치가 제공하는 콘텐츠를 이용한 연습 라운드에서 총 타수가 미리 설정된 타수를 초과한 경우에는 쿠폰 발급에 따른 비용 지불을 사용자 가 퇴장시 요구할 수 있다. 이때, 쿠폰 발급에 따른 비용은 시간제 회원권을 구매하는 경우, 시간에 기초하여 산정된 비용일 수도 있고, 시간에 기초하여 산정된 비용에 추가적인 비용이 더해진 비용일 수도 있다. 또한, 부가적으로, 골프 시뮬레이션 장치가 제공하는 콘텐츠를 이용한 연습 라운드에서 홀인원을 한 경우에는 총 타수와 상관없이 쿠폰을 무료로 제공하여, 쿠폰 발급에 따른 비용을 요구하지 않을 수도 있다. 스크린 골프 시스템 입장에서는 사용자의 시스템 이용을 독려하여 회원의 이탈을 방지할 수 있는 효과가 있으며, 사용자 입장에서는 게임에 더욱 집중할 수 있도록 하여 실력 향상을 도모할 수 있는 효과가 있다. 관리자 단말, 사용자 단말, 또는 골프 서비스 서버는 이용권의 시간이 부족한 상황(원하는 예약 시간만큼 이용권 사용이 어려운 상황)을 사용자 정보에 연동한다. 선택 타석의 이용 가능한 시간을 조회한 결과, 사용자의 이용권의 시간이 부족하다면, 시간 부족 상황, 조회 일시와 타석 정보를 사용자 정보에 매칭하 여 골프 서비스 서버 또는 데이터베이스에 저장한다. 타석 로그인 과정에서 사용자 정보에 이용권에 따른 시간 부족 상황 정보가 매칭되어 있음을 확인한다면, 타석 로그인 이후 골프 서비스 서버 또는 골프 시뮬레이션 장치는 미션 콘텐츠를 제공하고, 수락 및 미션 달성에 따라 추가 이용권을 보상으로 제공할 수 있다. 예컨대, 이용권 시간이 부족하여 타석 예약 과정에서 원하는 시간만큼 예약할 수 없었지만, 타석 로그인 이후 사용자에 제공된 미션을 수행하여 보상받은 이용권을 이용하여 예약 시간을 연장하거나 다음 예약에 사용 할 수 있다. 도 9 및 도 10은 다른 실시예에 따른 타석 로그인 방법에서 사용자 단말로 시도하는 타석 예약을 예시한 흐름도 이다. 도 9를 참조하면, S910 단계에서 사용자 단말은 이용 가능한 이용권 목록이 출력되는지 판단한다. 이용권 목록이 출력되지 않으면, S920 단계에서 이용권을 구매할 수 있다. S930 단계에서 이용권을 선택하고, S940 단계에서 특정 타석을 입력하여 선택한다. 사용자 단말은 타석을 입력하는 과정에서 타석 목록을 제공받을 수 있다. 사용자 단말은 타석 목록에 출력된 타석 번호를 선택하 거나 타석 번호를 직접 입력할 수 있다. S950 단계에서 선택 타석이 선점 가능한 타석인지 판단한다. 타석의 위치를 미리 선점할 수 있으면 선점 가능한 타석이고, 아니면 자율 타석에 해당한다. 선점 가능한 타석이면, S960 단계에서 선택 타석이 이용 가능한 타석 에 해당하는지 여부 및 시간대 목록이 출력되는지 판단한다. S960 단계에서 선택 타석이 이용 가능한 타석에 해 당하는지 여부와 함께 이용 가능한 다른 타석이 출력될 수 있다. 자율 타석이면, S970 단계에서 시작 시간을 선 택하고 타석을 배정한다. S960 단계에서 선택 타석이 이용 가능한 타석에 해당하지 않거나, 이용 가능한 다른 타석 및 시간대 목록이 출력되지 않으면, S970 단계를 진행한다. S960 단계에서 선택 타석이 이용 가능한 타석 에 해당하고 시간대 목록이 출력되거나, 이용 가능한 다른 타석 및 시간대 목록이 출력되면, S980 단계에서 타 석 및 시간대를 선택하고 타석을 배정한다. S910 단계, S950 단계, 및 S960 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장치에 저장된 데이터, 골프 서비스 서버에 저장된 데이터 또는 데이터베이스에 저장된 데이터를 기준으로 판단할 수 있다. 도 10를 참조하면, S970 단계 또는 S980 단계 이후에 S1010 단계에서 이용권이 횟수제 또는 기간제에 해당하는 지 판단한다. S1010 단계에서 이용권이 횟수제에 해당하면, S1020 단계에서 현재 예약된 횟수가 남은 타석 횟수 보다 적거나 같은지 판단한다. S1020 단계에서 현재 예약된 횟수가 남은 타석 횟수보다 적거나 같으면, S1040 단계를 진행한다. S1020 단계에서 현재 예약된 횟수가 남은 타석 횟수보다 많으면, S1090 단계에서 타석 예약이 불가하다는 정보를 출력한다. S1010 단계에서 이용권이 기간제에 해당하면, S1030 단계에서 당일 예약한 타석이 있거나 당일 타석 이용 여부 를 판단한다. 기간제는 하루에 1회만 이용 가능한 제한이 설정될 수 있다. S1030 단계에서 당일 예약한 타석이 있거나 당일 타석을 이용했으면, S1090 단계를 진행한다. S1020 단계에서 현재 예약된 횟수가 남은 타석 횟수보다 적거나 S1030 단계에서 당일 예약한 타석이 없고 당일 타석을 이용하지 않았으면, S1040 단계에서 예약이 불가한 시간에 해당하는지 판단한다. S1040 단계에서 예약이 불가한 시간에 해당하면, S1090 단계를 진행한다. S1040 단계에서 예약이 불가한 시간에 해당하지 않으면, S1050 단계에서 예약이 불가한 기간에 해당하는지 판단 한다. S1050 단계에서 예약이 불가한 기간에 해당하면, S1090 단계를 진행한다. S1050 단계에서 예약이 불가한 기간에 해당하지 않으면, S1060 단계에서 이용권 중지에 해당하는지 판단한다. S1060 단계에서 이용권 중지에 해당하면, S1090 단계를 진행한다. S1060 단계에서 이용권 중지에 해당하지 않으면, S1070 단계에서 선택 시각이 다른 사용자에게 선점되었는지 판 단한다. S1070 단계에서 선택 시각이 다른 사용자에게 선점되었으면, S1090 단계를 진행한다.S1070 단계에서 선택 시각이 다른 사용자에게 선점되지 않았으면, S1080 단계에서 회원 정보를 사전 인증하고, 예약을 완료한다. S1010 단계, S1020 단계, S1030 단계, S1040 단계, S1050 단계, S1060 단계, 및 S1070 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장치에 저장된 데이터, 골프 서비스 서버에 저장된 데이터 또는 데이터베 이스에 저장된 데이터를 기준으로 판단할 수 있다. 도 11은 다른 실시예에 따른 타석 로그인 방법에서 골프 시뮬레이션 장치에 의한 자동로그인을 예시한 흐름도이 다. 도 11을 참조하면, S860 단계, S870 단계, S1080 단계, 또는 S1090 단계 이후에 S1110 단계에서 로그인 판단 루프 조건을 비교한다. S1110 단계에서 로그인 판단 루프 조건을 만족하지 않으면, 타석 로그인 프로세스를 종 료한다. S1110 단계에서 로그인 판단 루프 조건을 만족하면, S1120 단계에서 로그인 개시 조건을 비교한다. S1120 단계 에서 로그인 개시 조건을 만족하지 않으면, S1110 단계를 다시 진행한다. S1120 단계에서 로그인 개시 조건을 만족하면, S1130 단계에서 골프 시뮬레이션 장치의 출력부에 로그인 정보를 출력한다. 로그인 정보 출력은 예를 들어 로그인 팝업의 형태로 나타날 수 있는데, 이러한 로그인 팝업을 '확인' 선택하거나 로그인 팝업 이후 소정의 시간(예컨대, 3분 등)이 경과하면 골프 시뮬레이션 장치는 이용 가능한 상태가 된다. S1140 단계에서 골프 시뮬레이션 장치는 골프 콘텐츠를 제공하고, 골퍼는 골프 시뮬레이션 장치를 사 용할 수 있다. 골퍼는 골프 시뮬레이션 장치에서 제공하는 개인형 가상 골프 코스 콘텐츠, 경쟁형 가상 골 프 코스 콘텐츠, 미션형 가상 골프 코스 콘텐츠, 맞춤형 골프 교육 훈련 콘텐츠, 또는 이들의 조합된 콘텐츠를 선택할 수 있다. 선택한 골프 콘텐츠에 따라 골퍼는 타석에서 스윙할 수 있다. 예약 시간 동안에 하나의 골프 시뮬레이션 장치를 사용하는 경우가 있고, 상황에 따라 다른 골프 시뮬레이 션 장치로 변경하는 경우가 발생할 수 있다. S1150에서 골프 시뮬레이션 장치는 미리 설정된 타석 이동 판단 루프 조건을 비교한다. 타석 이동 판단 루 프 조건을 이용하여 타석 이동 여부를 무한하게 판단하는 경우를 대비할 수 있다. 타석 이동 판단 루프 조건은 남은 예약 시간 범위를 고려하여 설정될 수 있다. 남은 예약 시간 범위는 전체 예 약 시간에서 사용한 시간을 제외한 예약 종료 시간까지의 범위를 가질 수 있고, 시간 슬롯으로 구분될 수 있다. 예컨대, 타석 이동 판단 루프 조건은 i) 사용자가 하나의 골프 시뮬레이션 장치를 사용 중인 상황에서 시간 슬 롯에 따라 현재 시간이 남은 예약 시간 범위 내에 있는지 판단하는 조건, ii) 남은 예약 시간 범위 내에서 사용 자가 하나의 골프 시뮬레이션 장치의 사용을 일시 중단한 상황에 해당하는지 판단하는 조건 등으로 설정될 수 있다. 따라서 예를 들어 사용자가 하나의 골프 시뮬레이션 장치를 사용 중인 상황에서 시간 슬롯에 따라 현재 시간이 남은 예약 시간 범위 내에 있다면 타석 이동 판단 루프 조건이 만족된다고 판단하거나, 남은 예약 시간 범위 내에서 사용자가 하나의 골프 시뮬레이션 장치의 사용을 일시 중단한 상황에 해당한다면 타석 이동 판단 루프 조건이 만족된다고 판단할 수 있다. S1150에서 타석 이동 판단 루프 조건을 만족하지 않으면, 타석 로그인 프로세스를 종료한다. S1150에서 타석 이동 판단 루프 조건을 만족하면, S1160 단계에서 타석 이동 여부를 판단한다. S1160 단계에서 타석 이동하지 않은 것으로 판단되면, S1165 단계에서 골프 시뮬레이션 장치에서 로그인 상태를 유지한다. S1160 단계에서 타석 이동으로 판단되면, S1170 단계에서 관리자 단말 또는 골프 시뮬레이션 장치에 의해 다른 골프 시뮬레이션 장치에 로그인을 요청한다. S1170 단계에서 골프 시뮬레이션 장치는 콘텐츠를 중단시키고 콘텐츠의 중단 지점을 기억하고 관리자 단말, 골프 서비스 서버, 데이터베이스, 또 는 다른 골프 시뮬레이션 장치 등으로 공유한다. S1180 단계에서 다른 골프 시뮬레이션 장치의 출력부에 로그인 정보를 출력한다. 로그인 팝업을 '확인' 선택하 거나 소정의 시간(예컨대, 3분 등)이 경과하면 다른 골프 시뮬레이션 장치도 이용 가능한 상태가 된다. 다른 골프 시뮬레이션 장치의 출력부에 로그인 정보를 출력하는 단계(S1180) 이후에 S1190 단계에서 골프 시뮬 레이션 장치는 골프 콘텐츠를 제공하고, 골퍼는 골프 시뮬레이션 장치를 사용할 수 있다. S1190 단계에서 골퍼는 다른 골프 시뮬레이션 장치를 통해 골프 콘텐츠를 새롭게 시작하거나 중단된 지점부터 이어서 진행할 수 있다. 다른 골프 시뮬레이션 장치는 골프 시뮬레이션 장치, 관리자 단말, 골프 서 비스 서버, 또는 데이터베이스 등으로부터 중단된 지점에 관한 정보를 수신할 수 있다. S1110 단계, S1120 단계, S1150 단계, 및 S1160 단계에서 데이터를 비교 판단할 때 골프 시뮬레이션 장치 에 저장된 데이터, 골프 서비스 서버에 저장된 데이터 또는 데이터베이스에 저장된 데이터를 기준으 로 판단할 수 있다. 도 12는 다른 실시예에 따른 타석 로그인 방법에서 타석 변경 상황을 예시한 도면이다. 제1 골프 시뮬레이션 장치가 구비된 제1 타석. 제2 골프 시뮬레이션 장치가 구비된 제2 타석 , 및 제3 골프 시뮬레이션 장치가 구비된 제3 타석으로 가정하면, 사용자가 제2 타석에 서 골프 스윙을 연습할 수 있다. 사용자가 연습 도중에 제3 타석으로 변경하려는 상황이 발생하면, 사용 자 단말의 위치 이동, 사용자 단말의 입력 정보, 관리자 단말의 입력 정보, 또는 이들의 조합된 정보를 기반으로 타석 변경 여부를 판단할 수 있다. 사용자 단말이 관리자 단말 또는 제2 골프 시뮬레이션 장치로 타석 변경을 요청하는 메시지를 전송하거나 사용자의 요청을 받은 후 관리자 단말 또는 제2 골프 시뮬레이션 장치에서 제3 골프 시뮬 레이션 장치 또는 골프 서비스 서버로 제어 명령을 전송하는 명령 기반 방식, 사용자 단말이 관 리자 단말 또는 제2 골프 시뮬레이션 장치로 타석 변경을 요청하는 메시지를 전송한 후 사용자 단말 이 제2 골프 시뮬레이션 장치로부터의 거리 및 제3 골프 시뮬레이션 장치로부터의 거리를 기준 으로 이동 여부를 판단하는 위치 기반 방식, 사용자 단말이 타석 변경을 요청하는 메시지를 제2 골프 시뮬 레이션 장치 또는 제3 골프 시뮬레이션 장치로 전송하면, 제2 골프 시뮬레이션 장치 및 제3 골 프 시뮬레이션 장치 간에 상호 통신하여 타석 변경을 처리하는 통신 기반 동기화 방식 등으로 설정될 수 있다. 도 13은 다른 실시예에 따른 타석 로그인 방법에서 로그인 후 미션 및 보상 제공을 예시한 흐름도이다. 도 13을 참조하면, S320 단계 또는 S1130 단계 이후에 S1310 단계에서 골프 시뮬레이션 장치 또는 골프 서 비스 서버는 타석 로그인 완료 여부를 판단한다. S1310 단계에서 타석 로그인이 완료되지 않으면, S1390 단계에서 로그인에 따른 보상을 제공하지 않고 연습 콘텐츠를 제공한다. S1310 단계에서 타석 로그인이 완료되면, 골프 시뮬레이션 장치 또는 골프 서비스 서버는 로그인에 따른 보상을 제공할 수 있다. 보상을 제공할 때, 이용권, 연습장 테마, 볼꼬리(볼이 날아갈 때 볼의 이동궤적에 일시적으로 나타나는 시각적 효과) 등과 같이 인게임(in-game) 내에서 사용할 수 있는 디지털 콘텐츠, 미션 달성 뱃지와 같이 수집욕구와 과 시욕을 자극할 수 있는 아이템, 또는 골프용품업체 등과의 제휴를 통한 실물 경품 교환권 등으로 제공할 수 있 다. 보상으로 받은 이용권은 타석 예약시 사용될 수 있다. S1320 단계에서 골프 시뮬레이션 장치 또는 골프 서비스 서버는 미션을 진행한다. S1340 단계에서 미션 달성 여부를 판단한다. S1340 단계에서 미션이 달성되면, S1350 단계에서 미션에 따른 보 상을 제공한다. S1340 단계에서 미션이 달성되지 않으면, S1360 단계에서 미션 재시도 여부를 판단한다. S1360 단계에서 미션이 재시도되면, S1330 단계를 진행한다. S1360 단계에서 미션이 재시도되지 않으면, S1390 단계를 진행한다. S1370 단계에서 미션 다음 단계 진행 여부를 판단한다. S1370 단계에서 미션 다음 단계가 진행되면, S1330 단계 를 진행한다. S1370 단계에서 미션 다음 단계가 진행되지 않으면, S1380 단계에서 신규 미션 진행 여부를 판단 한다. S1380 단계에서 신규 미션이 진행되면, S1330단계를 진행한다. S1380 단계에서 신규 미션이 진행되지 않 으면, S1390 단계를 진행한다. 도 3 내지 도 11, 도 13에 도시된 실시예에 따른 골프 타석 로그인 방법은 도 1 및 도 2에 도시된 골프 타석 로 그인 시스템에서 시계열적으로 처리되는 단계들을 포함한다. 골프 타석 로그인 방법에 관하여 일부 생략된 내용 이 있더라도 골프 타석 로그인 시스템에 관하여 기술한 내용이 적용될 수 있고, 골프 타석 로그인 시스템에 관 하여 일부 생략된 내용이 있더라도 골프 타석 로그인 방법에 관하여 기술한 내용이 적용될 수 있다. 이상의 실시예들에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field programmable gate array) 또는 ASIC 와 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구 성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프 로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램특허 코드의 세그먼트들, 드라이버들, 펌웨어, 마 이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구 성요소들과 '~부'들로부터 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU, GPU 들을 재생시키도록 구현될 수도 있다. 한편, 본 명세서를 통해 설명된 일 실시예에 따른 골프 타석 로그인 방법은 컴퓨터에 의해 실행 가능한 명령어 및 데이터를 저장하는, 컴퓨터로 판독 가능한 매체의 형태로도 구현될 수 있다. 이때, 명령어 및 데이터는 프로 그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 소정의 프로그램 모듈을 생성하여 소정 의 동작을 수행할 수 있다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터로 판독 가 능한 매체는 컴퓨터 기록 매체일 수 있는데, 컴퓨터 기록 매체는 컴퓨터 판독 가능 명령어, 데이터 구조, 프로 그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함할 수 있다. 예를 들어, 컴퓨터 기록 매체는 HDD 및 SSD 등과 같은 마그네 틱 저장 매체, CD, DVD 및 블루레이 디스크 등과 같은 광학적 기록 매체, 또는 네트워크를 통해 접근 가능한 서 버에 포함되는 메모리일 수 있다. 또한, 본 명세서를 통해 설명된 일 실시예에 따른 골프 타석 로그인 방법은 컴퓨터에 의해 실행 가능한 명령어 를 포함하는 컴퓨터 프로그램(또는 컴퓨터 프로그램 제품)으로 구현될 수도 있다. 컴퓨터 프로그램은 프로세서 에 의해 처리되는 프로그래밍 가능한 기계 명령어를 포함하고, 고레벨 프로그래밍 언어(High-level Programming Language), 객체 지향 프로그래밍 언어(Object-oriented Programming Language), 어셈블리 언어 또는 기계 언 어 등으로 구현될 수 있다. 또한 컴퓨터 프로그램은 유형의 컴퓨터 판독가능 기록매체(예를 들어, 메모리, 하드 디스크, 자기/광학 매체 또는 SSD(Solid-State Drive) 등)에 기록될 수 있다. 따라서 본 명세서를 통해 설명된 일 실시예에 따른 골프 타석 로그인 방법은 상술한 바와 같은 컴퓨터 프로그램 이 컴퓨팅 장치에 의해 실행됨으로써 구현될 수 있다. 컴퓨팅 장치는 프로세서와, 메모리와, 저장 장치와, 메모 리 및 고속 확장포트에 접속하고 있는 고속 인터페이스와, 저속 버스와 저장 장치에 접속하고 있는 저속 인터페 이스 중 적어도 일부를 포함할 수 있다. 이러한 성분들 각각은 다양한 버스를 이용하여 서로 접속되어 있으며, 공통 머더보드에 탑재되거나 다른 적절한 방식으로 장착될 수 있다. 여기서 프로세서는 컴퓨팅 장치 내에서 명령어를 처리할 수 있는데, 이런 명령어로는, 예컨대 고속 인터페이스 에 접속된 디스플레이처럼 외부 입력, 출력 장치상에 GUI(Graphic User Interface)를 제공하기 위한 그래픽 정 보를 표시하기 위해 메모리나 저장 장치에 저장된 명령어를 들 수 있다. 다른 실시예로서, 다수의 프로세서 및 (또는) 다수의 버스가 적절히 다수의 메모리 및 메모리 형태와 함께 이용될 수 있다. 또한 프로세서는 독립적인 다수의 아날로그 및(또는) 디지털 프로세서를 포함하는 칩들이 이루는 칩셋으로 구현될 수 있다. 또한 메모리는 컴퓨팅 장치 내에서 정보를 저장한다. 일례로, 메모리는 휘발성 메모리 유닛 또는 그들의 집합으 로 구성될 수 있다. 다른 예로, 메모리는 비휘발성 메모리 유닛 또는 그들의 집합으로 구성될 수 있다. 또한 메 모리는 예컨대, 자기 혹은 광 디스크와 같이 다른 형태의 컴퓨터 판독 가능한 매체일 수도 있다. 그리고 저장장치는 컴퓨팅 장치에게 대용량의 저장공간을 제공할 수 있다. 저장 장치는 컴퓨터 판독 가능한 매 체이거나 이런 매체를 포함하는 구성일 수 있으며, 예를 들어 SAN(Storage Area Network) 내의 장치들이나 다른 구성도 포함할 수 있고, 플로피 디스크 장치, 하드 디스크 장치, 광 디스크 장치, 혹은 테이프 장치, 플래시 메 모리, 그와 유사한 다른 반도체 메모리 장치 혹은 장치 어레이일 수 있다."}
{"patent_id": "10-2022-0158056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상술된 실시예들은 예시를 위한 것이며, 상술된 실시예들이 속하는 기술분야의 통상의 지식을 가진 자는 상술된 실시예들이 갖는 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하 다는 것을 이해할 수 있을 것이다. 그러므로 상술된 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마 찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다.본 명세서를 통해 보호받고자 하는 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지 며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태를 포함하 는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0158056", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하, 첨부되는 도면들은 본 명세서에 개시되는 바람직한 실시예를 예시하는 것이며,"}
