{"patent_id": "10-2022-0073509", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0172839", "출원번호": "10-2022-0073509", "발명의 명칭": "인공 지능 컵 세척 장치", "출원인": "주식회사 게더링", "발명자": "허은하"}}
{"patent_id": "10-2022-0073509", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컵(10)의 개구부가 하방을 향하도록 뒤집혀 안착되는 안착 플레이트(200);상기 안착 플레이트(200)의 상방으로 노출되며, 토출 각도가 서로 다른 복수의 내측 토출구(310)가 형성된 내측노즐 헤드(300);둘 이상이 마련되어 상기 내측 토출구(310)에 선택적으로 연통되는 내측 세척수 공급 라인(320);상기 내측 세척수 공급 라인(320)상에 각각 구비되는 내측 세척수 공급 밸브(330);상기 내측 세척수 공급 밸브(330)의 개도량, 개방 순서 또는 개방 시간을 제어하는 메인 컨트롤러;를 포함하는 인공 지능 컵 세척 장치."}
{"patent_id": "10-2022-0073509", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 메인 컨트롤러에는 상기 내측 세척수 공급 밸브(330)의 개도량, 개방 순서 또는 개방 시간이 컵(10)의 형상 정보에 따라 다르게 설정된 프리셋이 저장되며,상기 메인 컨트롤러는 상기 안착 플레이트(200)에 안착된 상기 컵(10)의 형상 정보를 입력받고, 입력된 상기 형상 정보에 대응되는 상기 프리셋을 호출하는 인공 지능 컵 세척 장치."}
{"patent_id": "10-2022-0073509", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 안착 플레이트(200)에 안착된 상기 컵(10)의 외형을 촬영하는 카메라(121);상기 카메라(121)로부터 촬영된 이미지로부터 상기 컵(10)의 형상 정보를 추출하여 상기 메인 컨트롤러에 제공하는 이미지 프로세서;를 포함하는 인공 지능 컵 세척 장치."}
{"patent_id": "10-2022-0073509", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 안착 플레이트(200)의 하단을 지지하여 상기 안착 플레이트(200)가 수평 회전되도록 하는 회전 지지부(210);를 포함하는 인공 지능 컵 세척 장치."}
{"patent_id": "10-2022-0073509", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 안착 플레이트(200)의 상방에서 상기 안착 플레이트(200)에 안착된 상기 컵(10)의 바닥면을 탄성 가압하되상기 안착 플레이트(200)의 회전축과 동일한 회전축을 갖도록 회동되는 가압 로드(430)를 포함하는 가압부(400);공개특허 10-2023-0172839-3-상기 안착 플레이트(200)에 회전 동력을 제공하는 회전 구동부(220);를 포함하며,상기 메인 컨트롤러는, 상기 회전 구동부(220)의 회전량 또는 회전 시기를 제어하는 인공 지능 컵 세척 장치."}
{"patent_id": "10-2022-0073509", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 회전 지지부(210) 및 상기 회전 구동부(220)가 내장되고 상기 안착 플레이트(200)가 상방으로 노출되게 설치되는 메인 바디(100);뒤집힌 용기 형상으로서 상기 가압 로드(430)가 회동 가능하게 장착되며, 상기 메인 바디(100)의 상면에 탈착되는 커버(460);를 포함하는 인공 지능 컵 세척 장치."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 인공 지능 컵 세척 장치에 관한 것으로서, 토출 각도가 서로 다른 복수의 내측 토출구가 형성된 내측 노즐 헤드가 구비되고, 각각의 내측 토출구의 세척수 분사 여부를 메인 컨트롤러에서 개별 제어하므로 컵의 세척 효율을 상승시킬 수 있는 인공 지능 컵 세척 장치에 관한 것이다."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 인공 지능 컵 세척 장치에 관한 것으로서, 토출 각도가 서로 다른 복수의 내측 토출구가 형성된 내 측 노즐 헤드가 구비되고, 각각의 내측 토출구의 세척수 분사 여부를 메인 컨트롤러에서 개별 제어하므로 컵의 세척 효율을 상승시킬 수 있는 인공 지능 컵 세척 장치에 관한 것이다."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 커피 전문점 등에서 테이크아웃을 하게 되면 차가운 음료의 경우에는 플라스틱 컵에, 따듯한 음료의 경우에는 종이컵에 음료를 담아 제공하여 왔다. 이러한 일회용 컵들은 토기 내지 철 등으로 제작된 컵에 비해 무게가 가벼워 휴대가 용이함은 물론, 음료를 다 마신 후에는 재활용 쓰레기 통이나 일반 쓰레기통에 쉽게 버릴 수 있어 거추장스럽게 빈 음료 컵을 들고 다니지 않아도 되는 간편함이 있었다. 그러나, 이러한 일회용 컵들은 종이컵의 경우에도 내측에 비닐 코팅이 형성되어 있고, 플라스틱 컵은 그 자체가 플라스틱으로 이루어져 있어 미세 플라스틱에 의한 해양 오염 등 다양한 문제를 일으키는 것이 속속 보도되고 있는 실정이다. 이에 따라 커피 전문점 등에서는 머그컵에 음료를 담아 제공하는 등의 서비스를 시작하여 환경 오염 부담을 줄 이는 등의 노력을 하였으나, 여전히 테이크아웃시에는 일회용 컵을 사용할수밖에 없는 한계가 있었다. 이에, 일부 커피 전문점에서는 사용자가 텀블러 등을 가져오는 경우 해당 텀블러에 음료를 담아 제공하면서 일 부 금액을 할인해주는 등으로 일회용품 사용을 줄이는 운동을 하기도 하였다. 그러나, 텀블러는 매 사용시마다 세척하는 것이 번거롭고, 구매자가 직접 텀블러를 세척한 후 매장에 제시하여 야 하는 불편함이 있어 세척 문제 때문에 텀블러 사용을 주저하는 경우도 있는 실정이다. 이러한 문제를 해결하기 위하여 텀블러 또는 머그컵을 뒤집어 누르면 내부의 노즐에서 물이 분사되는 세척장치 들이 개발되었으나, 일괄적으로 분사되는 물줄기는 물의 사용량 대비 세척 효율이 떨어지는 문제가 있었다. 선행기술문헌 특허문헌(특허문헌 0001) KR10-2252575(등록번호) 2021.05.11."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 토출 각도가 서로 다른 복수의 내측 토출구가 형성된 내측 노즐 헤드가 구비되고, 각각의 내측 토출 구의 세척수 분사 여부를 메인 컨트롤러에서 개별 제어하므로 컵의 세척 효율을 상승시킬 수 있는 인공 지능 컵 세척 장치를 제공하는데 그 목적이 있다. 또한, 본 발명은, 입력된 컵의 형상 정보에 따라 각각의 내측 토출구의 세척수 분사 여부를 다르게 설정함으로 써, 컵의 형상에 따른 최적의 세척수 분사 제어를 할 수 있는 인공 지능 컵 세척 장치를 제공하는데 그 목적이 있다. 또한, 본 발명은, 카메라로부터 촬영된 이미지를 통해 컵의 형상 정보를 추출하고 이에 따른 서로 다른 설정으 로 세척수를 분사하므로, 인공지능을 활용한 최적의 세척수 분사 제어가 가능한 인공 지능 컵 세척 장치를 제공 하는데 그 목적이 있다. 또한, 본 발명은, 컵이 안착되는 안착 플레이트가 수평 회전 가능하게 구성됨으로써, 세척수의 직접 분사 접촉 영역을 증가시켜 컵의 세척 효율이 상승되는 인공 지능 컵 세척 장치를 제공하는데 그 목적이 있다. 또한, 본 발명은, 안착 플레이트를 회전시키는 회전 구동부와, 컵을 가압 파지하는 가압부가 구비되고, 회전 구 동부가 메인 컨트롤러에 의해 제어됨으로써, 세척수의 직접 분사 접촉 영역이 고르게 형성되어 컵의 세척 효율 이 상승되는 인공 지능 컵 세척 장치를 제공하는데 그 목적이 있다. 또한, 본 발명은, 커버가 구비되어 세척수가 외부로 비산되지 않도록 하는 인공 지능 컵 세척 장치를 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은, 컵의 개구부가 하방을 향하도록 뒤집혀 안착되는 안착 플레이트; 상기 안착 플레이트(20 0)의 상방으로 노출되며, 토출 각도가 서로 다른 복수의 내측 토출구가 형성된 내측 노즐 헤드; 둘 이상이 마련되어 상기 내측 토출구에 선택적으로 연통되는 내측 세척수 공급 라인; 상기 내측 세척수 공급 라인상에 각각 구비되는 내측 세척수 공급 밸브; 상기 내측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간을 제어하는 메인 컨트롤러;를 포함한다. 또한, 본 발명의 상기 메인 컨트롤러에는 상기 내측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시 간이 컵의 형상 정보에 따라 다르게 설정된 프리셋이 저장되며, 상기 메인 컨트롤러는 상기 안착 플레이트 에 안착된 상기 컵의 형상 정보를 입력받고, 입력된 상기 형상 정보에 대응되는 상기 프리셋을 호출한 다. 또한, 본 발명은, 상기 안착 플레이트에 안착된 상기 컵의 외형을 촬영하는 카메라; 상기 카메라 로부터 촬영된 이미지로부터 상기 컵의 형상 정보를 추출하여 상기 메인 컨트롤러에 제공하는 이미지 프로세서;를 포함한다. 또한, 본 발명은, 상기 안착 플레이트의 하단을 지지하여 상기 안착 플레이트가 수평 회전되도록 하 는 회전 지지부;를 포함한다. 또한, 본 발명은, 상기 안착 플레이트의 상방에서 상기 안착 플레이트에 안착된 상기 컵의 바닥 면을 탄성 가압하되 상기 안착 플레이트의 회전축과 동일한 회전축을 갖도록 회동되는 가압 로드를 포함하는 가압부; 상기 안착 플레이트에 회전 동력을 제공하는 회전 구동부;를 포함하며, 상기 메인 컨트롤러는, 상기 회전 구동부의 회전량 또는 회전 시기를 제어한다. 또한, 본 발명은, 상기 회전 지지부 및 상기 회전 구동부가 내장되고 상기 안착 플레이트가 상 방으로 노출되게 설치되는 메인 바디; 뒤집힌 용기 형상으로서 상기 가압 로드가 회동 가능하게 장착되며, 상기 메인 바디의 상면에 탈착되는 커버;를 포함한다."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은, 토출 각도가 서로 다른 복수의 내측 토출구가 형성된 내측 노즐 헤드가 구비되고, 각각의 내측 토출구의 세척수 분사 여부를 메인 컨트롤러에서 개별 제어하므로 컵의 세척 효율을 상승시킬 수 있는 효과가 있다. 또한, 본 발명은, 입력된 컵의 형상 정보에 따라 각각의 내측 토출구의 세척수 분사 여부를 다르게 설 정함으로써, 컵의 형상에 따른 최적의 세척수 분사 제어를 할 수 있는 효과가 있다. 또한, 본 발명은, 카메라로부터 촬영된 이미지를 통해 컵의 형상 정보를 추출하고 이에 따른 서로 다 른 설정으로 세척수를 분사하므로, 인공지능을 활용한 최적의 세척수 분사 제어가 가능한 효과가 있다. 또한, 본 발명은, 컵이 안착되는 안착 플레이트가 수평 회전 가능하게 구성됨으로써, 세척수의 직접 분사 접촉 영역을 증가시켜 컵의 세척 효율이 상승되는 효과가 있다. 또한, 본 발명은, 안착 플레이트를 회전시키는 회전 구동부와, 컵을 가압 파지하는 가압부 가 구비되고, 회전 구동부가 메인 컨트롤러에 의해 제어됨으로써, 세척수의 직접 분사 접촉 영역이 고르게 형성되어 컵의 세척 효율이 상승되는 효과가 있다. 또한, 본 발명은, 커버가 구비되어 세척수가 외부로 비산되지 않도록 하는 효과가 있다."}
{"patent_id": "10-2022-0073509", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 본 발명의 실시예에 대하여 첨부한 도면을 참조하여 상세히 설명한다. 본 발명의 설명에 앞서, 본 발명에서 지칭하는 컵은 그 용어가 컵이라 하여 손잡이가 달린 머그컵 또는 손 잡이가 없는 유리컵과 같은 통상적 용어의 컵만을 지칭하는 것이 아니라, 음료를 수용하여 손에 들고 음용할 수 있는 텀블러와 같은 용기도 모두 컵으로 지칭하며, 이러한 텀블러와 같은 용기까지도 세척 대상이 되는 것에 유 의하여야 한다. 본 발명은, 도1 내지 도7에 도시된 바와 같이, 컵의 개구부가 하방을 향하도록 뒤집혀 안착되는 안착 플레 이트와, 안착 플레이트의 상방으로 노출되며 토출 각도가 서로 다른 복수의 내측 토출구가 형성 된 내측 노즐 헤드와, 둘 이상이 마련되어 내측 토출구에 선택적으로 연통되는 내측 세척수 공급 라 인과, 내측 세척수 공급 라인상에 각각 구비되는 내측 세척수 공급 밸브와, 내측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간을 제어하는 메인 컨트롤러(미도시)를 포함하여 구성된다.안착 플레이트는, 컵의 상단 개구부가 하방을 향하도록 뒤집혀 안착될 때 컵의 개구부를 지지하는 역할을 한다. 안착 플레이트는 안착된 컵의 내측으로 물줄기를 분사할 수 있도록 내측 노즐 헤드(30 0)가 상방으로 노출된다. 바람직하게는 안착 플레이트의 중앙부를 관통하여 내측 노즐 헤드가 하방으 로부터 상방으로 돌출 또는 노출되도록 구비된다. 내측 노즐 헤드는, 컵의 내측면에 물을 분사하여 컵의 내측면을 세척하는 역할을 하며, 이를 위하 여 안착 플레이트의 상면 상방으로 노출되도록 구성된다. 내측 노즐 헤드는 안착 플레이트의 중 심부에 위치하는 것이 바람직하며, 이를 통해 안착 플레이트에 컵이 뒤집혀 안착되었을 때에 컵의 내측에 위치된다. 내측 노즐 헤드의 내측으로는 복수의 내측 토출구가 형성된다. 내측 토출구는 토출 각도가 서로 다르게 구성된 내측 토출구가 적어도 2개 이상 구성되며, 어느 내측 토출구들은 같은 토출 각도를 갖 도록 구성된다. 이때, 토출 각도라 함은 평면상 각도일수도 있고, 연직 방향에 대한 각도일수도 있다. 이러한 내측 토출구들은 각각의 내측 토출구가 서로 다른 내측 세척수 공급 라인에 개별적으로 연통될 수 있고, 복수의 내측 토출구가 그룹을 형성하여 하나의 내측 세척수 공급 라인에 연통될수도 있다. 이때, 그룹을 형성하는 복수의 내측 토출구는 적어도 둘 이상의 그룹이 형성되어서 각 그룹별로 서로 다른 내측 세척수 공급 라인에 연통되어야 한다. 그 일례로, 도2와 같이 연직 방향에 대한 토출 각도가 서로 동 일한 내측 토출구들끼리 그룹을 형성하여 하나의 내측 세척수 공급 라인에 연통되는 경우에는, 연직 방향에 대한 토출 각도가 서로 다른 둘 이상의 내측 토출구가 내측 노즐 헤드에 형성되어야 한다는 것이다. 내측 세척수 공급 라인은, 내측 토출구에 세척수를 공급하는 역할을 하며, 복수 개가 마련되어 내측 토출구에 선택적으로 연통된다. 이러한 내측 세척수 공급 라인은 연직 방향에 대한 토출 각도가 서로 동일한 내측 토출구들이 하나의 내측 세척수 공급 라인에 연통되도록 구성되는 것을 도시하였으나, 이에 한정하지 않고 평면상 토출각도가 서로 동일한 내측 토출구들을 하나의 내측 세척수 공급 라인 에 연통되도록 구성하는 것 역시 가능하며, 각각의 내측 토출구들이 각기 다른 내측 세척수 공급 라인 에 독립적으로 연통되는 것 역시 가능하다. 요지는, 하나의 내측 세척수 공급 라인이 하나 이상의 내 측 토출구에 연통되어야 하고, 이러한 내측 세척수 공급 라인이 둘 이상 마련되어야 한다는 것이며, 하나의 내측 토출구에는 둘 이상의 내측 세척수 공급 라인이 동시에 연통되는 것을 지양한다. 이러한 내측 세척수 공급 라인은 세척수 공급 펌프(미도시) 또는 세척수 공급 배관(미도시)으로부터 세척 수를 공급받으며, 이때 세척수가 내측 세척수 공급 라인을 통해 흐르는 것을 조절하기 위하여 내측 세척수 공급 라인상에 내측 세척수 공급 밸브가 구비된다. 내측 세척수 공급 밸브는, 내측 세척수 공급 라인상에 각각 구비되며, 내측 세척수 공급 라인상 을 흐르는 물의 흐름을 개폐한다. 내측 세척수 공급 밸브는 개폐만을 조절하도록 구성될수도 있으나, 개도 량까지도 조절될 수 있음은 물론이다. 이러한 내측 세척수 공급 밸브는 내측 세척수 공급 라인마다 구비되므로 복수 개가 구성되며, 메인 컨트롤러에 의해 개도량, 개방 순서, 개방 시간 등이 제어된다. 메인 컨트롤러는, 내측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간을 제어하는 역할을 하며, 이를 위하여 내측 세척수 공급 밸브와 전기적으로 연결된다. 메인 컨트롤러가 내측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간을 제어하는 이유는 컵의 형상에 따라 내측 세척수 공급 밸브의 개방을 서로 다르게 함으로써 세척 효율을 상승시키기 위함이다. 예를 들어, 도2와 같이 연직 방향에 대하여 동일한 토출 각도를 갖는 내측 토출구 그룹에 하나의 내측 세 척수 공급 라인이 연통되도록 구성되고, 내측 토출구 그룹이 상단 토출, 중단 토출, 하단 토출의 총 3개 그룹으로 구성된 경우를 상정해보면, 입구가 좁고 바닥면이 넓은 형상의 컵의 경우에는 상단 토출을 하는 내측 토출구로부터 먼저 물이 분사되고 이후 중단 토출을 하는 내측 토출구로부터 물이 분사되고 마지막으로 하단 토출을 하는 내측 토출구로부터 물이 분사되면, 컵의 상단과 중단에 토출된 물이 좁 은 개구부를 미처 통과하지 못하고 컵 내부에 잔류하게 되어 하단 토출을 하는 내측 토출구로부터 물 이 분사될 때 토출 압력을 상쇄하게 되어 컵의 입구 부분의 세척력이 약해지게 된다. 따라서, 입구가 좁고 바닥면이 넓은 형태의 컵은 하단 토출, 즉, 컵의 개구부 방향을 향하여 토출하는 내측 토출구에 연통된 내측 세척수 공급 라인상의 내측 세척수 공급 밸브를 먼저 개방시키고, 이후 컵의 중단 또는 바닥면을 향하여 토출하는 내측 토출구에 연통된 내측 세척수 공급 라인상의 내측 세척수 공급 밸브를 개방 제어하는 것이다. 만일, 컵의 형상이 개구부가 가장 넓고 바닥면이 가장 좁은 형상인 경우에는, 뒤집혀 안착된 컵을 기준 으로 상단이 가장 좁고 하단이 가장 넓은 형상이 되어 물빠짐에 영향이 없으므로, 모든 내측 세척수 공급 밸브 를 동시에 개방하는 것도 가능하다. 이렇듯, 컵의 형상에 따라 내측 세척수 공급 밸브들의 개폐 제어를 다르게 하기 위하여 메인 컨트롤러 에는 내측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간이 컵의 형상 정보에 따라 다르게 설 정된 프리셋이 저장된다. 컵의 형상 정보는 컵의 용량, 개구부로부터 바닥면에 이르는 컵의 모양, 컵의 길이, 둘레 등 다양한 정보로 이루어질 수 있다. 여기서 가장 중요한 컵의 형상 정보로는 개구부 로부터 바닥면에 이르는 컵의 모양과 컵의 길이가 그 대상이 될 수 있다. 메인 컨트롤러는 컵의 형상 정보에 대응되는 프리셋을 호출하여 이에 따라 내측 세척수 공급 밸브를 제어하기 위하여 컵의 형상 정보를 입력받는다. 컵의 형상 정보는 별도로 마련된 인터페이스 장치를 통 하여 사용자로부터 간단한 입력을 받을 수 있다. 이를 위하여 메인 컨트롤러는 인터페이스 장치에 컵의 형 상 정보를 얻기 위한 메뉴를 순차적으로 출력시킬 수 있으며, 사용자가 인터페이스 장치에 출력되는 메뉴 중 하 나를 선택하면 그 다음 메뉴를 출력하는 방식으로 컵의 형상 정보를 입력받을 수 있다. 또는, 컵의 형상 정보를 자동으로 추출하기 위하여 카메라가 더 구비될 수 있다. 카메라는 안착 플레이트의 측방 일측에 구비될 수 있으며, 컵의 측면을 촬영한다. 이때, 메인 바디는 안착 플레 이트가 상방으로 노출되게 설치되는 메인 하우징과, 안착 플레이트의 외측에서 메인 하우징 의 상방으로 연장되는 측벽을 포함하여 구성되며, 카메라는 측벽에 장착될 수 있다. 컵 은 대부분 평단면 형상이 원형 또는 8각 이상의 다각형으로 형성되므로, 측면의 형상으로부터 전체 형상을 추산하여도 원래의 형상과 큰 차이가 없으며, 가장 중요한 컵의 길이와 바닥면으로부터 개구부에 이르는 컵 의 모양 정보는 측면 형상으로부터 용이하게 추출이 가능하기 때문이다. 카메라로부터 촬영된 이미지는 이미지 프로세서(미도시)로 전달된다. 이미지 프로세서는 카메라로부 터 촬영된 이미지로부터 컵의 외곽선을 추출하고, 추출된 외곽선으로부터 컵의 형상 정보를 추출한다. 이때 추출되는 컵의 형상 정보는 컵의 상하단 길이, 상단, 중단, 하단의 외경 등이 될 수 있다. 메인 컨트롤러는 이미지 프로세서로부터 컵의 형상 정보가 입력되면, 기저장된 컵의 형상 정보 중 이에 매칭되는 형상 정보를 검색하고, 검색된 형상 정보에 대응되는 프리셋을 호출하여 프리셋에 저장된 제어 순서에 따라 내측 세척수 공급 밸브를 제어한다. 그리고, 이와 관련하여, 시중에 판매되는 컵들은 그 모양과 크기가 비슷하더라도 제각각 다른 크기와 모양을 가지고 있으므로, 메인 컨트롤러에 저장되는 형상 정보는 정확 한 값이 아닌 범위값을 가지고 있는 것이 바람직하다. 상술한 구성으로 이루어진 본 발명에 의하면, 내측 노즐 헤드에 내측 토출구가 복수 형성되었다 하더 라도 하나의 내측 토출구로부터는 정해진 방향으로만 세척수를 분사하기 때문에, 세척수가 직접 부딪히지 않는 컵의 내측면은 세척력이 저하될수밖에 없다. 따라서, 세척수가 직접 부딪히는 면을 최대한 증가시켜야 하는데, 이를 위하여 안착 플레이트는 회동 가능한 형태로 형성된다. 안착 플레이트가 회동 가능한 상태가 되도록 안착 플레이트의 하방에는 안착 플레이트의 하단을 지지하여 안착 플레이트가 수평 회전하도록 하는 회전 지지부가 구비된다. 회전 지지부는 안착 플레이트의 하방에 구비되는 지지 블록과, 지지 블록과 안착 플레이트의 사이에 구비되는 지지 베어링을 포함하여 구성된다. 따라서, 사용자가 안착 플레이트에 뒤집혀 안착된 컵의 상단, 즉, 컵의 바닥면 부분을 잡고 돌릴 때 컵이 용이하게 회전될 수 있고, 이를 통해 컵의 여러 부분에 내측 노즐 헤드의 내측 토출구로부터 토출된 세척수가 접촉될 수 있게 된다. 그러나, 사용자가 컵을 잡고 직접 회전시키는 것은 컵을 적절한 회전각으로 회전시키는데에 사용자별로 차이가 있을 수 있고, 이에 따라 세척 결과물에 차이가 발생될 우려가 있다. 또한, 사용자가 컵을 잡고 회 전시킬 때에 컵의 개구부가 안착 플레이트로부터 들뜨는 경우 세척수가 외부로 튈 우려가 있다. 따라 서, 컵을 자동으로 회전시키면서 컵이 안착 플레이트로부터 들뜨지 않도록 구성되는 것이 바람직 하다. 본 발명은 이러한 문제를 해결하기 위하여 안착 플레이트에 회전 동력을 제공하는 회전 구동부와, 회 전시 컵이 안착 플레이트로부터 이탈되지 않도록 안착 플레이트의 상방에서 안착 플레이트 에 안착된 컵의 바닥면을 탄성 가압하는 가압부가 더 구비된다. 회전 구동부는 회전 모터와, 회전 모터의 회전축에 결합되는 회전 기어를 포함하여 구성되 며, 안착 플레이트에는 회전 기어에 치합되는 톱니가 형성된다. 따라서, 회전 모터가 회전되면 회전 기어에 치합된 안착 플레이트가 회전 지지부를 따라 회전된다. 이러한 회전 구동부는 메인 바디의 내측에 설치된다. 그리고, 회전 구동부의 구동에 의해 안착 플레이트가 회전할 때에 컵이 이탈되지 않도록, 가압부 가 안착 플레이트의 상방에서 컵의 상단, 즉, 컵의 바닥면을 가압한다. 이때, 가압부는 컵이 회전할 때 컵의 회전을 방해하지 않도록 안착 플레이트의 회전축과 동일한 회전축을 갖도록 구성되는 것이 바람직하다. 그리고, 컵의 높이와 상관 없이 컵을 안정적으로 가압할 수 있도록 가압부 는 컵을 탄성 가압할 수 있도록 구성되며, 이때의 탄성력은 컵이 세척수의 분사 압력에 의해 안착 플레이트로부터 이탈되지 않는 정도면 충분하기 때문에 탄성력이 강하지 않아도 된다. 따라서, 가압부 는 탄성력이 세척수의 분사 압력보다 큰 한도 내에서 작동 거리가 가능한 길게 형성되는 것이 바람직하다. 가압부는 메인 바디에 장착되어 안착 플레이트의 일측에 구비되는 가압 기둥과, 가압 기둥 의 상단에서 측방으로 연장되는 가압 핸들과, 가압 핸들의 타단에 상하로 관통 및 슬라이딩 가 능하게 구성되는 가압 로드와, 가압 로드의 하단에 결합되어 컵의 바닥면에 접촉되는 가압 팁 과, 가압 로드 또는 가압 팁으로부터 가압 핸들 사이에 구비되어 가압 로드 또는 가 압 팁을 가압 핸들로부터 탄성적으로 밀어내는 가압 스프링을 포함하여 구성된다. 이러한 구성 에 의해 가압 로드를 상방으로 잡아당겨 안착 플레이트와 가압 팁을 이격시킨 후 안착 플레이트 에 컵을 안착시키고 가압 로드를 놓으면, 가압 스프링에 의해 가압 로드가 하방으로 슬라이딩되어 가압 팁이 컵의 바닥면에 접촉하게 되어 컵을 탄성적으로 가압할 수 있게 된다. 컵이 가압부에 의해 안착 플레이트에 안정적으로 안착되면 메인 컨트롤러가 회전 구동부와 내측 세척수 공급 밸브를 구동시켜 컵이 회전되며 세척될 수 있도록 한다. 이때 회전 구동부의 회전량, 회전 시기 또는 회전 속도 등은 메인 컨트롤러에 의해 결정되며, 이러한 결정에 컵의 형상 정보가 활용될 수 있다. 메인 컨트롤러는 입력된 컵의 형상 정보에 대응되는 프리셋을 호출하며, 이때의 프리셋에 는 내측 세척수 공급 밸브의 제어 정보 뿐만 아니라 회전 구동부의 제어 정보 역시 포함되어 있는 것 이 바람직하다. 예를 들어 컵의 외경이 보다 큰 경우에는 보다 작은 컵의 경우에 비해 회전 속도를 더 느리게 하는 등의 제어를 함으로써 컵의 세척 결과를 향상시킬 수 있도록 하는 것이다. 한편, 가압 핸들은 가압 기둥을 중심으로 측방으로 회동할 수 있도록 구성되는데, 이는 하술할 커버 가 장착될 때에 가압 핸들을 외측으로 회동시켜 커버의 장착 공간을 마련하기 위함이다. 이때, 가압 핸들이 가압 기둥에 회동 가능하게 장착될 수도 있고, 가압 핸들과 가압 기둥은 견고 하게 고정된 채 가압 기둥이 메인 바디로부터 회동 가능한 구조로 구성될 수도 있다. 한편, 상술한 구성으로 컵의 내측면은 깨끗하게 세척할 수 있다 하더라도 여전히 컵의 외측면은 세척할 수 없는 문제가 있을 수 있다. 이때, 컵의 외측면을 세척하고자 할 때를 위하여 안착 플레이트의 외측 에는 안착 플레이트 방향으로 세척수가 공급될 수 있도록 외측 노즐 헤드가 구비된다. 외측 노즐 헤드는, 컵의 외측면에 물을 분사하여 컵의 외측면을 세척하는 역할을 하며, 이를 위하 여 안착 플레이트의 외측에서 메인 하우징의 상면 상방으로 노출되도록 구성된다. 외측 노즐 헤드 는 안착 플레이트의 외측에 위치되므로 안착 플레이트에 컵이 뒤집혀 안착되었을 때에 컵 의 외측에 위치된다.외측 노즐 헤드의 내측으로는 복수의 외측 토출구가 형성된다. 외측 토출구는 토출 각도가 서로 다르게 구성된 외측 토출구가 적어도 2개 이상 구성된다. 이때, 토출 각도라 함은 연직 방향에 대한 각도 이다. 이러한 외측 토출구들은 각각의 외측 토출구가 서로 다른 외측 세척수 공급 라인에 개별 적으로 연통될 수 있고, 외측 노즐 헤드가 복수로 구비되는 경우에는 도7과 같이 연직 방향에 대한 토출 각도가 서로 동일한 외측 토출구들끼리 그룹을 형성하여 하나의 외측 세척수 공급 라인에 연통되도록 구성된다. 외측 세척수 공급 라인은, 외측 토출구에 세척수를 공급하는 역할을 하며, 복수 개가 마련되어 외측 토출구에 선택적으로 연통된다. 이러한 외측 세척수 공급 라인은 외측 노즐 헤드가 복수로 구비 된 경우 연직 방향에 대한 토출 각도가 서로 동일한 외측 토출구들이 하나의 외측 세척수 공급 라인 에 연통된다. 따라서, 이러한 외측 세척수 공급 라인이 둘 이상 마련되어야 하며, 하나의 외측 토출구 에는 둘 이상의 외측 세척수 공급 라인이 동시에 연통되는 것을 지양한다. 이러한 외측 세척수 공급 라인은 세척수 공급 펌프 또는 세척수 공급 배관으로부터 세척수를 공급받으며, 이때 세척수가 외측 세척수 공급 라인을 통해 흐르는 것을 조절하기 위하여 외측 세척수 공급 라인상 에 외측 세척수 공급 밸브가 구비된다. 외측 세척수 공급 밸브는, 외측 세척수 공급 라인상에 각각 구비되며, 외측 세척수 공급 라인상 을 흐르는 물의 흐름을 개폐한다. 외측 세척수 공급 밸브는 개폐만을 조절하도록 구성될수도 있으나, 개도 량까지도 조절될 수 있음은 물론이다. 이러한 외측 세척수 공급 밸브는 외측 세척수 공급 라인마다 구비되므로 복수 개가 구성되며, 메인 컨트롤러에 의해 개도량, 개방 순서, 개방 시간 등이 제어된다. 메인 컨트롤러는, 외측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간을 제어하는 역할을 하며, 이를 위하여 외측 세척수 공급 밸브와 전기적으로 연결된다. 메인 컨트롤러가 외측 세척수 공급 밸브의 개도량, 개방 순서 또는 개방 시간을 제어하는 이유는 컵의 형상에 따라 외측 세척수 공급 밸브의 개방을 서로 다르게 함으로써 세척 효율을 상승시키기 위함이다. 그 리고, 이러한 외측 세척수 공급 밸브의 제어에 기 입력된 컵의 형상 정보가 활용될 수 있다. 메인 컨 트롤러는 입력된 컵의 형상 정보에 대응되는 프리셋을 호출하며, 이때의 프리셋에는 내측 세척수 공급 밸브 의 제어 정보 뿐만 아니라 외측 세척수 공급 밸브의 제어 정보, 나아가 회전 구동부의 제어 정 보 역시 포함되어 있는 것이 바람직하다. 이때, 외측 노즐 헤드의 외측 토출구로부터 세척수가 분사되면 분사된 세척수가 컵의 외측면에 부딪힌 후 외부로 비산하게 된다. 따라서, 세척수의 비산을 방지하기 위하여 커버가 구비된다. 커버는 외측 노즐 헤드를 포함한 안착 플레이트를 내부에 수용할 수 있는 크기로 형성되며, 하 방이 개구된 뒤집힌 용기 형상으로서 메인 하우징의 상면에 탈착 가능하게 구성된다. 그리고 커버를 씌우게 되면 메인 바디에 결합된 가압부는 사용하지 못하게 되므로, 커버의 상단에 가압 로드 와 가압 스프링이 장착된다. 가압 로드는 커버의 상단에 회동 및 슬라이딩 가능한 상태로 장착되고, 가압 로드의 하단에는 가압 팁이 결합되며, 가압 로드 또는 가압 팁과 커버 의 상단 사이에 가압 스프링이 구비되어서 가압 로드 또는 가압 팁을 커버의 상단으 로부터 하방으로 탄성적으로 밀어내는 형태가 된다. 따라서, 안착 플레이트에 컵을 안착시킨 후 커버 를 상방으로부터 하방으로 씌워 메인 하우징에 결속시키면, 가압 로드와 가압 팁이 컵(1 0)을 탄성적으로 가압할 수 있게 된다. 이때, 메인 바디에 구비된 가압부는 외측으로 회동시켜 커버 가 장착될 수 있도록 한다. 또한, 메인 하우징에는 커버의 장착 여부를 확인할 수 있도록 장착 확인 스위치(미도시)가 구비될 수 있으며, 장착 확인 스위치는 커버가 장착될 때에만 작동되도록 구성된다. 커버가 장착되지 않은 채로 외측 노즐 헤드로부터 세척수가 분사되면 세척수가 외부로 비산되므로, 장착 확인 스위치가 작동되지 않으 면 비록 사용자가 컵의 내외측면을 모두 세척하는 옵션을 선택했다 하더라도 메인 컨트롤러로부터 외측 세 척수 공급 밸브의 개방 신호가 발생하지 않도록 구성된다. 그리고, 메인 하우징은 커버가 장착되는 지점의 내측이 하방으로 인입되어 세척수가 외부로 유실되지 않고 내측으로 배수될 수 있도록 구성된다.한편, 본 발명의 인공 지능 컵 세척 장치를 사용하여 컵을 세척한 후 사용자는 컵의 내측면 또는 외측 면을 육안 검사하여 세척이 미진한 부분이 있는지를 확인할 수 있다. 이에, 사용자의 확인 결과 세척이 미진한 부분이 존재하는 경우 사용자는 인터페이스 장치를 조작하여 컵의 어느 부분의 세척이 미진하였는지를 선택 할 수 있다. 메인 컨트롤러는 컵의 세척이 미진한 부위의 정보가 입력되면 직전 세척시에 입력된 컵의 형상 정보에 대응되는 프리셋을 호출하여 세척이 미진한 부위의 정보에 영향을 주는 것으로 설정된 내측 세척수 공급 밸브의 제어 정보, 외측 세척수 공급 밸브의 제어 정보 또는 회전 구동부의 제어 정보를 수정한 후 해당 프리셋에 재저장하게 된다. 예를 들어, 길이가 15cm를 초과하는 길이의 컵이고, 컵의 바닥면 내측의 세척이 미진한 것으로 입력된 경우에는 연직 방향에 가장 가까운 각도를 갖는 내측 토출구 에 연통된 내측 세척수 공급 라인상의 내측 세척수 공급 밸브의 구동 시간을 설정 시간 증가시키는 등으로 수정하는 것이다. 이러한 세척이 미진한 부위 대비 어느 제어 정보를 수정해야 하는지의 여부는 컵 의 형상별로 미리 정해져 저장되어 있는 것이 바람직하다. 상술한 구성으로 이루어진 본 발명은, 토출 각도가 서로 다른 복수의 내측 토출구가 형성된 내측 노즐 헤 드가 구비되고, 각각의 내측 토출구의 세척수 분사 여부를 메인 컨트롤러에서 개별 제어하므로 컵 의 세척 효율을 상승시킬 수 있는 효과가 있다. 또한, 본 발명은, 입력된 컵의 형상 정보에 따라 각각의 내측 토출구의 세척수 분사 여부를 다르게 설 정함으로써, 컵의 형상에 따른 최적의 세척수 분사 제어를 할 수 있는 효과가 있다. 또한, 본 발명은, 카메라로부터 촬영된 이미지를 통해 컵의 형상 정보를 추출하므로, 조작이 간편하면 서도 최적의 세척수 분사 제어가 가능한 효과가 있다. 또한, 본 발명은, 컵이 안착되는 안착 플레이트가 수평 회전 가능하게 구성됨으로써, 세척수의 직접 분사 접촉 영역을 증가시켜 컵의 세척 효율이 상승되는 효과가 있다. 또한, 본 발명은, 안착 플레이트를 회전시키는 회전 구동부와, 컵을 가압 파지하는 가압부 가 구비되고, 회전 구동부가 메인 컨트롤러에 의해 제어됨으로써, 세척수의 직접 분사 접촉 영역이 고르게 형성되어 컵의 세척 효율이 상승되는 효과가 있다. 또한, 본 발명은, 커버가 구비되어 세척수가 외부로 비산되지 않도록 하는 효과가 있다."}
{"patent_id": "10-2022-0073509", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 실시예에 따른 인공 지능 컵 세척 장치의 사시도. 도2는 도1의 측단면도. 도3은 도1의 부가 실시예에 따른 인공 지능 컵 세척 장치의 사시도. 도4는 도3의 부가 실시예에 따른 인공 지능 컵 세척 장치의 사시도. 도5는 도4의 측단면도. 도6은 도4의 부가 실시예에 따른 인공 지능 컵 세척 장치의 사시도. 도7은 도6의 측단면도."}
