{"patent_id": "10-2018-0120294", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0040425", "출원번호": "10-2018-0120294", "발명의 명칭": "화자 인식 장치 및 그 동작방법", "출원인": "주식회사 케이티", "발명자": "박재한"}}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "음성 등록을 요청하는 댁 내 사용자의 음성 신호를 수신하는 단계;상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 단계;상기 측정된 유사도 점수와 특수집단 여부를 판별하기 위한 기준점수를 비교하는 단계; 및상기 비교 결과에 기초하여 화자 식별을 위한 기준점수를 설정하는 단계를 포함하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 수신 단계는, 상기 댁 내 사용자의 음성 신호를 AI 스피커로부터 수신하는 것을 특징으로 하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 설정 단계는, 상기 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수보다 작거나 같은 경우, 상기 화자 식별을위한 기준점수를 유지하는 것을 특징으로 하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 설정 단계는, 상기 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수보다 큰 경우, 상기 화자 식별을 위한 기준점수를 업데이트하는 것을 특징으로 하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 화자 식별을 위한 기준점수는, 상기 측정된 유사도 점수를 기반으로 업데이트되는 것을 특징으로 하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 수신된 음성 신호의 특징 값들을 추출하고, 상기 추출된 특징 값들을 기반으로 상기 댁 내 사용자에 대응하는 화자 모델을 생성하는 단계를 더 포함하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 음성 인식을 요청하는 댁 내 사용자의 음성 신호를 수신하는 단계; 및상기 음성 인식을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 단계를 더 포함하는화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 음성 인식을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도 점수와 상기 설정된 기준점수를공개특허 10-2020-0040425-3-비교하여 화자를 식별하는 단계를 더 포함하는 화자 인식 방법."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 제1항 내지 제8항 중 어느 하나의 항에 따른 방법이 컴퓨터 상에서 실행되도록 컴퓨터 판독 가능한 기록매체에 저장된 프로그램."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "음성 등록을 요청하는 댁 내 사용자의 음성 신호를 수신하는 음성 수신부;상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 유사도 측정부; 및상기 측정된 유사도 점수와 특수집단 여부를 판별하기 위한 기준점수를 서로 비교하여 화자 식별을 위한 기준점수를 설정하는 기준점수 설정부를 포함하는 화자 인식 장치."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,미리 결정된 음성 특징 추출 알고리즘을 이용하여 상기 수신된 음성 신호의 특징 값들을 추출하는 음성특징 추출부를 더 포함하는 화자 인식 장치."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 음성 신호의 특징 값들을 기반으로 상기 댁 내 사용자에 대응하는 화자 모델을 생성하는 화자모델 생성부를 더 포함하는 화자 인식 장치."}
{"patent_id": "10-2018-0120294", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 음성 인식을 시도하는 사용자 음성과 기 등록된 사용자 음성들 간의 유사도 점수와 상기 설정된 기준점수를 비교하여 화자를 식별하는 화자 식별부를 더 포함하는 화자 인식 장치."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 AI 홈 비서 서비스에 적용 가능한 화자 인식 방법에 관한 것으로, 음성 등록을 요청하는 댁 내 사용자 의 음성 신호를 수신하는 단계; 상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 단계; 상기 측정된 유사도 점수와 특수집단 여부를 판별하기 위한 기준점수를 비교하는 단계; 및 상기 비교 결과에 기초하여 화자 식별을 위한 기준점수를 설정하는 단계를 포함한다."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 맞춤형 화자 인식 장치 및 그 동작방법에 관한 것으로서, 보다 구체적으로는 댁 내 사용자들 간의 목소리 유사도에 따라 화자 식별을 위한 기준점수를 자동으로 업데이트할 수 있는 화자 인식 장치 및 그 동작방법에 관한 것이다."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 정보통신 기술의 비약적인 발전에 따라 IoT(Internet of Things) 기술에 대한 관심 및 수요가 급격히 증가 하고 있다. 이러한 IoT는, 이를 바라보는 관점에 따라 다양한 방식으로 정의될 수 있다. 그러나, 본질적으로 IoT는 인터넷을 기반으로 다양한 사물들을 통신 네트워크로 연결함으로써 사람과 사물, 사물과 사물 간의 통신 을 가능하게 하는 지능형 정보통신 기술 내지 서비스이다. 이러한 IoT 기술은 스마트 홈(smart home), 스마트 헬스(smart health), 스마트 카(smart car) 등과 같은 다양 한 기술 분야에서 응용되고 있다. 특히, IoT 기술을 홈 네트워크 시스템에 접목한 스마트 홈 서비스에 관한 연 구가 활발히 진행되고 있다. 스마트 홈 서비스는 통신 네트워크가 구축된 주거 환경에서 사물인터넷 기능이 포함된 IoT 기기를 통해 생활 수 준 향상을 추구하는 시스템 전반을 의미한다. TV/냉장고/에어컨 등의 가전제품, 전기/수도 등의 에너지소비장치, 보안 서비스 등을 통신 네트워크로 연결하여 사용자로 하여금 스마트 폰 또는 음성 제어기(또 는 AI 스피커) 등을 통해 댁 내의 상황 정보를 원격으로 실시간 확인 및 제어가 가능하도록 할 수 있다. 특히, 최근에는 AI 스피커를 통해 댁 내에 존재하는 IoT 기기들을 원격으로 제어할 수 있는 스마트 홈 서비스가 점점증가하는 추세이다. AI 스피커는 음성인식(Voice Recognition) 기술 및 인공지능(Artificial Intelligence) 기술 등을 활용하여 대 화형 AI 홈 비서 서비스를 제공할 수 있다. 여기서, 대화형 AI 홈 비서 서비스란 단어 그대로 댁 내에서 인공지 능이 화자를 식별하여 화자의 홈 비서 역할을 수행해주는 서비스를 의미한다. 이러한 AI 스피커는 개인 일정 관리 서비스, SNS 관리 서비스, 앱 실행 서비스, 인터넷 쇼핑 서비스, 이메일 관리 서비스, 메신저 관리 서비스, 멀티미디어 재생 서비스, 날씨/교통/여행 정보 제공 서비스, IoT 기기 제어 서비스 등과 같은 다양한 서비스를 제공할 수 있다. 화자 인식 장치는 AI 스피커를 통해 입력되는 사용자 음성과 기존에 등록된 사용자 음성 간의 유사도를 측정하 고, 상기 측정된 유사도 점수가 기준점수(threshold)를 초과하는 경우에 해당 사용자를 기 등록된 사용자로 판 단하게 된다. 그런데, 기존의 화자 인식 장치는 화자 식별을 위한 기준점수를 하나만 설정하여 사용하고 있기 때문에, 형제/ 자매/쌍둥이처럼 목소리가 다른 일반인들보다 유사한 특수집단의 경우 화자 인식률이 저하되는 문제가 있었다. 따라서, 댁 내에 목소리가 유사한 형제/자매/쌍둥이 등이 존재하는 경우에도 화자를 정확하게 식별하기 위한 방 안이 필요하다."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제 및 다른 문제를 해결하는 것을 목적으로 한다. 또 다른 목적은 음성 등록을 시도하는 사 용자 음성과 기 등록된 사용자 음성들 간의 유사도에 기초하여 화자 식별을 위한 기준점수를 자동으로 업데이트 할 수 있는 화자 인식 장치 및 그 동작방법을 제공함에 있다. 또 다른 목적은, 기 등록된 댁 내 사용자들이 특수집단에 속하는 경우, 자동 업데이트된 기준점수를 이용하여 화자를 식별할 수 있는 화자 인식 장치 및 그 동작방법을 제공함에 있다."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 또는 다른 목적을 달성하기 위해 본 발명의 일 측면에 따르면, 음성 등록을 요청하는 댁 내 사용자의 음성 신호를 수신하는 단계; 상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하 는 단계; 상기 측정된 유사도 점수와 특수집단 여부를 판별하기 위한 기준점수를 비교하는 단계; 및 상기 비교 결과에 기초하여 화자 식별을 위한 기준점수를 설정하는 단계를 포함하는 화자 인식 방법을 제공한다. 좀 더 바람직하게는, 상기 설정 단계는, 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수보다 작 거나 같은 경우, 화자 식별을 위한 기준점수를 유지하는 것을 특징으로 한다. 또한, 상기 설정 단계는, 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수보다 큰 경우, 화자 식별을 위한 기준점수를 업데이트하 는 것을 특징으로 한다. 상기 화자 식별을 위한 기준점수는, 상기 측정된 유사도 점수를 기반으로 업데이트되는 것을 특징으로 한다. 좀 더 바람직하게는, 상기 수신 단계는, 댁 내 사용자의 음성 신호를 AI 스피커로부터 수신하는 것을 특징으로 한다. 상기 화자 인식 방법은, AI 스피커로부터 수신된 음성 신호의 특징 값들을 추출하고, 상기 추출된 특징 값들을 기반으로 상기 댁 내 사용자에 대응하는 화자 모델을 생성하는 단계를 더 포함하는 것을 특징으로 한다. 좀 더 바람직하게는, 상기 화자 인식 방법은, 음성 인식을 요청하는 댁 내 사용자의 음성 신호를 수신하는 단계 와, 상기 음성 인식을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 단계를 더 포함 하는 것을 특징으로 한다. 또한, 상기 화자 인식 방법은, 음성 인식을 요청하는 사용자 음성과 기 등록된 사용 자 음성 간의 유사도 점수와 상기 설정된 기준점수를 비교하여 화자를 식별하는 단계를 더 포함하는 것을 특징 으로 한다. 본 발명의 다른 측면에 따르면, 음성 등록을 요청하는 댁 내 사용자의 음성 신호를 수신하는 과정; 상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 과정; 상기 측정된 유사도 점수 와 특수집단 여부를 판별하기 위한 기준점수를 비교하는 과정; 및 상기 비교 결과에 기초하여 화자 식별을 위한 기준점수를 설정하는 과정이 컴퓨터 상에서 실행되도록 컴퓨터 판독 가능한 기록매체에 저장된 프로그램을 제공 한다.본 발명의 또 다른 측면에 따르면, 음성 등록을 요청하는 댁 내 사용자의 음성 신호를 수신하는 음성 수신부; 상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성 간의 유사도를 측정하는 유사도 측정부; 및 상기 측정된 유사도 점수와 특수집단 여부를 판별하기 위한 기준점수를 서로 비교하여 화자 식별을 위한 기준점 수를 설정하는 기준점수 설정부를 포함하는 화자 인식 장치를 제공한다. 좀 더 바람직하게는, 상기 화자 인식 장치는, 미리 결정된 음성 특징 추출 알고리즘을 이용하여 음성 신호의 특 징 값들을 추출하는 음성특징 추출부를 더 포함하는 것을 특징으로 한다. 또한, 상기 화자 인식 장치는, 음성 신호의 특징 값들을 기반으로 댁 내 사용자에 대응하는 화자 모델을 생성하는 화자모델 생성부를 더 포함하는 것을 특징으로 한다. 또한, 상기 화자 인식 장치는, 음성 인식을 시도하는 사용자 음성과 기 등록된 사용자 음 성들 간의 유사도 점수와 기준점수를 비교하여 화자를 식별하는 화자 식별부를 더 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들에 따른 화자 인식 장치 및 그 동작방법의 효과에 대해 설명하면 다음과 같다. 본 발명의 실시 예들 중 적어도 하나에 의하면, 음성 등록을 시도하는 사용자 음성과 기 등록된 사용자 음성들 간의 유사도에 따라 화자 식별을 위한 기준점수를 자동으로 업데이트함으로써, 형제/자매/쌍둥이처럼 목소리가 매우 유사한 특수집단의 경우에도 화자를 정확하게 식별할 수 있다는 장점이 있다. 다만, 본 발명의 실시 예들에 따른 화자 인식 장치 및 그 동작방법이 달성할 수 있는 효과는 이상에서 언급한"}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "것들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0120294", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 즉, 본 발명에서 사용되는 '부' 라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '부'는 어떤 역할들을 수행한 다. 그렇지만 '부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '부'는 어드레싱할 수 있는 저장 매 체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요 소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들 및 변수들을 포함한다. 구성요소들과 '부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '부'들 로 결합되거나 추가적인 구성요소들과 '부'들로 더 분리될 수 있다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포 함하는 것으로 이해되어야 한다.본 발명은 음성 등록을 시도하는 사용자 음성과 기 등록된 사용자 음성들 간의 유사도에 기초하여 화자 식별을 위한 기준점수를 자동으로 업데이트할 수 있는 화자 인식 장치 및 그 동작방법을 제안한다. 또한, 본 발명은, 기 등록된 댁 내 사용자들이 특수집단에 속하는 경우, 자동 업데이트된 기준점수를 이용하여 화자를 식별할 수 있는 화자 인식 장치 및 그 동작방법을 제공한다. 이하에서는, 본 발명의 다양한 실시 예들에 대하여, 도면을 참조하여 상세히 설명한다. 도 1은 본 발명의 일 실시 예에 따른 화자 인식 시스템의 구성 블록도이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 화자 인식 시스템은, 댁 내에 위치하는 공유기 및 AI 스피커와, 댁 외에 위치하는 인터넷 망 및 인터넷 서비스 제공 서버를 포함할 수 있다. 상기 인 터넷 서비스 제공 서버는 댁 내 사용자들의 목소리(음성)를 식별하기 위한 화자 인식 서버(또는 화자 인식 장치)를 구비할 수 있다. 공유기(Access Point, 110)는 댁 내에 위치하는 AI 스피커와 복수의 IoT 기기들(미도시)을 인터넷 망 에 접속할 수 있도록 유/무선 통신을 연결해주는 장치이다. 공유기는 인터넷 서비스 제공자가 제공하 는 인터넷 주소(IP address)를 댁 내에 존재하는 복수의 단말들이 서로 나눠 쓸 수 있도록 공유해주는 기능을 수행할 수 있다. AI 스피커(또는 음성 제어기, 120)는 공유기 또는 통신 모뎀(미도시) 등과 유/무선 통신 인터페이스를 통 해 연결 가능하며, 상기 공유기 또는 통신 모뎀을 통해 외부에 위치하는 인터넷 서비스 제공 서버와 통신할 수 있다. AI 스피커는 다수의 IoT 기기들과 유/무선 통신 인터페이스를 통해 직접적으로 연결되어, 상기 IoT 기기들 과 통신할 수 있다. 한편, 도면에 도시되고 있지 않지만, 다른 실시 예로, AI 스피커는 홈 허브(home hub, 미도시)와 유/무선 통신 인터페이스를 통해 연결 가능하며, 상기 홈 허브를 통해 다수의 IoT 기기들과 통신할 수도 있다. AI 스피커는 댁 내 사용자들의 음성 명령에 대응하는 AI 홈 비서 서비스를 제공할 수 있다. 일 예로, AI 스피커는 사용자의 음성 명령에 대응하여 댁 내에 존재하는 다수의 IoT 기기들의 상태를 확인하거나 혹은 해당 기기들의 동작을 제어할 수 있다. AI 홈 비서 서비스에 복수의 사용자 계정이 등록된 경우, 댁 내 사용자들의 목소리를 식별(구별)하기 위해, AI 스피커는 마이크로폰을 통해 입력되는 사용자 음성을 인터넷 서비스 제공 서버로 제공할 수 있다. 인터넷 서비스 제공 서버는 인터넷 망을 통해 댁 내에 존재하는 공유기와 접속할 수 있고, 상기 공유기를 통해 AI 스피커와 통신할 수 있다. 인터넷 서비스 제공 서버는, 화자 인식 서버를 통해, AI 스피커로부터 수신되는 사용자의 음성 신호 를 분석하여 화자를 식별할 수 있다. 상기 화자 식별 결과, 음성 인식을 요청하는 사용자가 기 등록된 댁 내 사 용자인 경우, 인터넷 서비스 제공 서버는 AI 스피커와 연동하여 댁 내 사용자들의 음성 명령에 대응 하는 AI 홈 비서 서비스를 제공할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 AI 스피커의 구성 블록도이다. 도 2를 참조하면, 본 발명의 일 실시 예에 따른 AI 스피커는 통신부, 입력부, 출력부, 메 모리 및 제어부를 포함할 수 있다. 도 2에 도시된 구성요소들은 AI 스피커를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서상에서 설명되는 AI 스피커는 위에서 열거된 구성요소들보다 많거나 또는 적 은 구성요소들을 가질 수 있다. 통신부는 유선 통신을 지원하기 위한 유선 통신 모듈과 근거리 무선 통신을 지원하기 위한 근거리 통신 모 듈을 포함할 수 있다. 유선 통신 모듈은, 유선 통신을 위한 기술표준들 또는 통신방식(예를 들어, 이더넷 (Ethernet), PLC(Power Line Communication), 홈 PNA(Home PNA), IEEE 1394 등)에 따라 구축된 유선 통신망에 서 통신 모뎀, 공유기, IoT 기기 중 적어도 하나와 유선 신호를 송수신한다. 상기 근거리 통신 모듈은 근거리 통신(Short range communication)을 위한 것으로서, 블루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra-Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal SerialBus) 기술 중 적어도 하나를 이용하여 근거리 무선 통신을 지원할 수 있다. 입력부는 오디오 신호 입력을 위한 마이크로폰(microphone)을 포함할 수 있다. 마이크로폰은 외부의 음향 신호를 전기적인 음성 데이터로 처리한다. 처리된 음성 데이터는 AI 스피커에서 수행 중인 기능(또는 실행 중인 응용 프로그램)에 따라 다양하게 활용될 수 있다. 한편, 마이크로폰에는 외부의 음향 신호를 입력 받는 과 정에서 발생되는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알고리즘이 구현될 수 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시키기 위한 것으로, 디스플레이부, 음향 출력부, 햅팁 모듈, 광 출력부 중 적어도 하나를 포함할 수 있다. 음향 출력부는 메모리에 저장된 오디오 데이터를 출력할 수 있다. 음향 출력부는 AI 스피커에서 수행되는 기능과 관련된 음향 신호를 출력하기도 한다. 이 러한 음향 출력부에는 스피커(speaker) 및 버저(buzzer) 등이 포함될 수 있다. 메모리는 AI 스피커의 다양한 기능을 지원하는 데이터를 저장한다. 메모리는 AI 스피커에 서 구동되는 응용 프로그램(application program 또는 애플리케이션(application)), AI 스피커의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 제어부는 메모리에 저장된 응용 프로그램과 관련된 동작과, 통상적으로 AI 스피커의 전반적인 동작을 제어한다. 나아가 제어부는 이하에서 설명되는 다양한 실시 예들을 본 발명에 따른 AI 스피커 상에서 구현하기 위하여, 위에서 살펴본 구성요소들을 중 적어도 하나를 조합하여 제어할 수 있다. 제어부는 음성 인식 모듈을 더 포함할 수 있다. 음성 인식 모듈은 음성 인식 알고리즘이 적용된 음성 인식 엔진을 구동하여 마이크로폰을 통해 입력된 외부 음성을 인식한다. 즉, 음성 인식 모듈은 마이 크로폰을 통해 입력되는 외부 음성을 디지털 데이터로 변환하고, 상기 변환된 디지털 데이터를 증폭(Pre- emphasis)한 후, 디지털 변환된 음성의 시작 지점과 끝 지점을 검출한다. 이어서, 음성 인식 모듈은 검출 한 시작 지점과 끝 지점 사이의 음성에 대한 음성 특징 값들을 추출하여 고유의 음성 또는 음색을 인식한다. 한편, 본 실시 예에서는, 음성 인식 모듈이 제어부 내에 구현되는 것을 예시하고 있으나 이를 제한하 지는 않으며, 상기 제어부와 독립적으로 구성될 수 있다. 더 나아가, 상기 음성 인식 모듈은 AI 스피커 와 연동되는 인터넷 서비스 제공 서버 상에 구현될 수도 있다. 도 3은 본 발명의 일 실시 예에 따른 화자 인식 장치의 구성 블록도이다. 도 3을 참조하면, 본 발명의 일 실시 예에 따른 화자 인식 장치(또는 화자 인식 서버, 300)는 음성 수신부 , 음성특징 추출부, 화자모델 생성부, 유사도 측정부, 기준점수 설정부, 화자 식별부 및 데이터베이스를 포함할 수 있다. 도 3에 도시된 구성요소들은 화자 인식 장치를 구현하는데 있어서 필수적인 것은 아니어서, 본 명세서상에서 설명되는 화자 인식 장치는 위에서 열거된 구성요소들보다 많 거나, 또는 적은 구성요소들을 가질 수 있다. 음성 수신부는 AI 스피커로부터 댁 내 사용자의 음성 신호를 수신할 수 있다. 음성 수신부는 AI 스피커로부터 수신된 음성 신호를 데이터베이스(또는 메모리, 370)에 저장할 수 있다. 또한, 음성 수신부 는 AI 스피커로부터 수신된 음성 신호를 음성특징 추출부로 제공할 수 있다. 음성특징 추출부는 미리 결정된 음성 특징 추출 알고리즘을 이용하여 상기 수신된 음성 신호의 특징 값(또 는 특징 벡터)들을 추출할 수 있다. 상기 음성 특징 추출 알고리즘으로는 MFCC(Mel-frequency cepstrum coefficients) 알고리즘, PLP(perceptual linear prediction) 알고리즘, GTCC(Gammatone Cepstral Coefficients) 알고리즘 및 ZCPA(Zero-Crossings with Peak Amplitudes) 알고리즘 중 어느 하나가 사용될 수 있다. 좀 더 바람직하게는, 계산량 대비 정확도가 높은 MFCC 알고리즘이 사용될 수 있다. 상기 MFCC 알고리즘은 MFC 계수를 이용하여 음성 신호의 특징 벡터를 추출할 수 있다. 여기서, MFC(Mel-frequency cepstrum)는 단위 음성 프레임(frame) 내의 음성 데이터에 대해 계산한 파워 스펙트럼(power spectrum)을 청각기의 주파수 반응도를 모 사한 멜 스케일 주파수 도메인(mel-scale frequency domain)에서 이산 코사인 변환(discrete cosine transform, DCT)을 취한 값을 의미한다. 화자모델 생성부는 목소리(음성)를 등록하고자 하는 댁 내 사용자의 음성 특징들을 훈련 데이터(training data)로 사용하여 화자 모델(speaker model)을 생성할 수 있다. 상기 화자모델 생성부는 댁 내 사용자에대응하는 화자 모델을 데이터베이스에 저장할 수 있다. 상기 데이터베이스에 저장된 화자 모델들은 댁 내 사용자들의 목소리를 식별하기 위해 사용될 수 있다. 화자모델 생성부는 미리 결정된 통계 모델 기법을 이용하여 화자 모델을 생성할 수 있다. 상기 통계 모델 기법으로는 GMM(Gaussian Mixture Model) 기법과 SVM(Support Vector Machine) 기법 중 어느 하나가 사용될 수 있으며 반드시 이에 제한되지는 않는다. 유사도 측정부는 음성 등록(voice registration) 또는 음성 인식(voice recognition)을 시도하는 사용자 음성과 데이터베이스에 저장된 화자 모델들 간의 유사도(similarity)를 측정할 수 있다. 상기 유사도 측정 부는 강건한 화자 식별을 위하여 음성 프레임 단위로 유사도를 측정할 수 있다. 유사도 측정부는 미리 결정된 유사도 측정 방법을 이용하여 음성 등록 또는 음성 인식을 시도하는 사용자 음성과 기 등록된 사용자 음성들 간의 유사도를 측정할 수 있다. 상기 유사도 측정 방법으로는 VQ(Vector Quantization) 기반의 유사도 측정 방법과 DTW(Dynamic Time Warping) 기반의 유사도 측정 방법 중 어느 하나 가 사용될 수 있으며 반드시 이에 제한되지는 않는다. 기준점수 설정부는 일반적인 화자 식별을 위한 기준점수(또는 임계값, threshold)를 설정할 수 있다. 상기 기준점수는 화자 인식률을 최적화하기 위한 값으로 설정된다. 또한, 상기 기준점수는 화자 식별을 위해 유사도 점수와 비교될 수 있다. 기준점수 설정부는 기 등록된 댁 내 사용자들 간의 목소리 유사도에 기초하여 해당 사용자들이 일반적인 집단인지 아니면 특수한 집단인지 여부를 확인할 수 있다. 즉, 댁 내 사용자들 간의 목소리 유사도가 특수집단 여부를 판별하기 위한 기준점수(이하, 설명의 편의상 '제1 기준점수'라 칭함)를 초과하는 경우, 기준점수 설정 부는 해당 사용자들을 '특수집단(special group)'으로 분류(인식)할 수 있다. 한편, 상기 댁 내 사용자들 간의 목소리 유사도가 제1 기준 점수보다 작거나 같은 경우, 기준점수 설정부는 해당 사용자들을 '일반집 단(normal group)'으로 분류(인식)할 수 있다. 기준점수 설정부는 기 등록된 댁 내 사용자들이 일반집단/특수집단인지 여부에 따라 화자 식별을 위한 기 준점수(이하, 설명의 편의상 '제2 기준점수'라 칭함)를 유지하거나 혹은 해당 기준점수를 업데이트할 수 있다. 즉, 기준점수 설정부는, 기 등록된 댁 내 사용자들이 일반집단인 경우, 화자 식별을 위한 기준점수를 유지 하고, 기 등록된 댁 내 사용자들이 특수집단인 경우, 화자 식별을 위한 기준점수를 업데이트할 수 있다. 상기 업데이트된 기준점수는 특수집단에 속하는 댁 내 사용자들 간의 유사도 점수를 기반으로 설정될 수 있다. 일 예로, 상기 업데이트된 기준점수는 특수집단에 속하는 사용자 음성들 간의 유사도 점수의 110%로 설정될 수 있으며 반드시 이에 제한되지는 않는다. 화자 식별부는 음성 인식을 시도하는 사용자 음성과 기 등록된 화자 모델들 간의 유사도 점수와 상기 제2 기준점수를 비교하여 화자를 식별할 수 있다. 가령, 화자 식별부는 음성 인식을 시도하는 사용자 음성과 특정 화자 모델 간의 유사도 점수가 제2 기준점수를 초과하는 경우, 상기 음성 인식을 시도하는 사용자를 상기 특정 화자 모델에 대응하는 사용자로 인식할 수 있다. 데이터베이스(또는 메모리, 370)는 화자 인식 장치의 다양한 기능을 지원하는 데이터를 저장한다. 데이터 베이스는 화자 인식 장치에서 구동되는 다수의 응용 프로그램(application program 또는 애플리케이 션(application)), 화자 인식 장치의 동작을 위한 데이터들, 명령어들을 저장할 수 있다. 데이터베이스는 음성 수신부를 통해 획득된 댁 내 사용자들의 음성 신호에 관한 정보, 기준점수 설정 부를 통해 설정된 기준점수에 관한 정보, 화자 모델 생성부를 통해 생성된 화자 모델들에 관한 정보 등을 저장할 수 있다. 이상, 상술한 바와 같이, 본 발명에 따른 화자 인식 장치는, 음성 등록을 시도하는 사용자 음성과 기 등록된 사 용자 음성들 간의 유사도에 따라 화자 식별을 위한 기준점수를 자동으로 업데이트함으로써, 형제/자매/쌍둥이처 럼 목소리가 매우 유사한 특수집단의 경우에도 화자를 정확하게 식별할 수 있다. 도 4는 본 발명의 일 실시 예에 따른 음성 등록 방법을 설명하는 순서도이다. 도 4를 참조하면, 댁 내 사용자는 자신의 목소리(음성)를 AI 홈 비서 서비스에 등록 요청할 수 있다(S410). 이 때, 댁 내 사용자는 자신의 음성 신호를 AI 스피커의 마이크로폰을 통해 입력할 수 있다.화자 인식 장치는 AI 스피커로부터 댁 내 사용자의 음성 신호를 수신하고, 상기 수신된 음성 신호에 관한 데이터를 데이터베이스에 저장할 수 있다(S420). 화자 인식 장치는 AI 스피커로부터 수신된 음성 신호를 분석하여 해당 음성 신호의 특징 값(또는 특 징 벡터)들을 추출할 수 있다(S430). 이때, 상기 화자 인식 장치는 미리 결정된 음성 특징 추출 알고리즘 을 이용하여 댁 내 사용자의 음성 특징 값들을 추출할 수 있다. 화자 인식 장치는 댁 내 사용자의 음성 특징 값들을 훈련 데이터로 사용하여 해당 사용자의 화자 모델을 생성하고, 상기 생성된 화자 모델을 데이터베이스에 저장할 수 있다(S440). 이때, 상기 화자 인식 장치는 GMM 통계 모델 기법이나 혹은 SVM 통계 모델 기법을 이용하여 화자 모델을 생성할 수 있다. 화자 인식 장치는 미리 결정된 유사도 측정 방법을 이용하여 음성 등록을 요청하는 사용자 음성과 기 등록 된 사용자 음성들 간의 유사도를 측정할 수 있다(S450). 화자 인식 장치는 상기 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수(즉, 제1 기준점 수)를 초과하는지 여부를 확인할 수 있다(S460). 상기 460 단계의 확인 결과, 상기 측정된 유사도 점수가 제1 기준점수보다 작거나 같은 경우, 화자 인식 장치 는 음성 등록을 요청하는 사용자와 기 등록된 댁 내 사용자를 일반집단으로 인식하여 화자 식별을 위한 기 준 점수(즉, 제2 기준점수)를 유지할 수 있다(S470). 한편, 상기 460 단계의 확인 결과, 상기 측정된 유사도 점수가 제1 기준점수보다 큰 경우, 화자 인식 장치(30 0)는 음성 등록을 요청하는 사용자와 기 등록된 댁 내 사용자를 특수집단으로 인식하여 화자 식별을 위한 기준 점수를 업데이트할 수 있다(S480). 이때, 상기 화자 인식 장치는 상기 측정된 유사도 점수를 이용하여 화 자 식별을 위한 기준점수를 업데이트할 수 있다. 기 등록된 댁 내 사용자들이 일반집단인 경우, 화자 인식 장치는 최초 설정된 기준점수를 이용하여 화자를 식별할 수 있다. 한편, 기 등록된 댁 내 사용자들이 특수집단인 경우, 화자 인식 장치는 최초 설정된 기준 점수를 업데이트하여 화자를 식별할 수 있다. 이상, 상술한 바와 같이, 본 발명에 따른 화자 인식 장치는, 음성 등록을 요청하는 사용자의 음성 특징을 추출 하여 화자 모델을 생성하고, 상기 음성 등록을 요청하는 사용자 음성과 기 등록된 사용자 음성들 간의 유사도에 따라 화자 식별을 위한 기준점수를 자동으로 업데이트할 수 있다. 도 5는 화자 식별을 위한 기준점수를 업데이트하는 방법을 예시하는 도면이다. 도 5를 참조하면, 댁 내 구성원들 중 쌍둥이 B와 아버지의 음성이 AI 홈 비서 서비스에 등록된 상태이고, 쌍둥 이 A가 해당 서비스에 목소리 등록을 요청하는 상태임을 가정한다. 쌍둥이 A가 AI 스피커를 통해 목소리 등록을 요청하면, 화자 인식 장치는 상기 AI 스피커로부터 수신된 음성 신호를 기반으로 쌍둥이 A에 해당하는 화자 모델을 생성할 수 있다(S510). 화자 인식 장치는 쌍둥이 A의 음성과 기 등록된 아버지의 음성 간에 유사도를 측정할 수 있다(S520). 본 실시 예에서, 쌍둥이 A의 음성과 아버지의 음성 간의 유사도 점수는 20이고, 특수집단 여부를 판별하기 위한 기 준점수는 70임을 가정한다. 화자 인식 장치는 상기 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수를 초과하는지 여부 를 확인할 수 있다(S530). 상기 확인 결과, 쌍둥이 A와 아버지 간의 유사도 점수가 특수집단 여부를 판별하 기 위한 기준점수보다 작기 때문에, 화자 인식 장치는 쌍둥이 A와 아버지를 일반집단으로 인식하여 화 자 식별을 위한 기준점수를 그대로 유지할 수 있다(S540). 이후, 화자 인식 장치는 쌍둥이 A의 음성과 기 등록된 쌍둥이 B의 음성 간에 유사도를 측정할 수 있다 (S550). 본 실시 예에서, 쌍둥이 A의 음성과 쌍둥이 B의 음성 간의 유사도 점수는 80임을 가정한다. 화자 인식 장치는 상기 측정된 유사도 점수가 특수집단 여부를 판별하기 위한 기준점수를 초과하는지 여부 를 확인할 수 있다(S560). 상기 확인 결과, 쌍둥이 A와 쌍둥이 B 간의 유사도 점수가 특수집단 여부를 판별 하기 위한 기준점수보다 크기 때문에, 화자 인식 장치는 쌍둥이 A와 쌍둥이 B를 특수집단으로 인식하 여 화자 식별을 위한 기준점수를 업데이트할 수 있다(S570). 이때, 상기 화자 인식 장치는 쌍둥이 A와 쌍둥이 B 간의 유사도 점수를 기반으로 화자 식별을 위한 기준점수를 업데이트할 수 있다. 상술한 바와 같이, 기 등록된 댁 내 사용자들 중에서 한 명이라도 음성 등록을 요청하는 사용자와 특수집단 관 계에 있다면, 화자 식별을 위한 기준점수를 업데이트할 수 있다. 상기 업데이트된 기준점수는 추후 화자 식별을 위한 새로운 기준점수로 사용될 수 있다. 도 6은 본 발명의 일 실시 예에 따른 화자 인식 방법을 설명하는 순서도이다. 도 6을 참조하면, 화자 인식 장치는 AI 스피커로부터 댁 내 사용자의 음성 신호를 수신할 수 있다 (S610). 화자 인식 장치는 AI 스피커로부터 수신된 음성 신호를 분석하여 해당 음성 신호의 특징 값(또는 특 징 벡터)들을 추출할 수 있다(S620). 이때, 상기 화자 인식 장치는 미리 결정된 음성 특징 추출 알고리즘 을 이용하여 댁 내 사용자의 음성 특징 값들을 추출할 수 있다. 화자 인식 장치는 미리 결정된 유사도 측정 방법을 이용하여 음성 인식을 요청하는 사용자의 음성 특징과 기 등록된 사용자들의 음성 특징 간의 유사도를 측정할 수 있다(S630). 화자 인식 장치는 상기 측정된 유사도 점수와 화자 식별을 위한 기준점수를 서로 비교할 수 있다(S640). 여기서, 화자 식별을 위한 기준점수는, 기 등록된 댁 내 사용자들 중 적어도 둘 이상이 특수집단인 경우, 화자 인식의 정확도를 높이기 위해 최초 설정된 기준점수보다 더 큰 값으로 업데이트될 수 있다. 상기 640 단계의 비교 결과, 상기 측정된 유사도 점수가 화자 식별을 위한 기준점수를 초과하는 경우, 화자 인 식 장치는 음성 인식을 시도하는 댁 내 사용자를 기 등록된 특정 화자 모델에 대응하는 댁 내 사용자로 인 식할 수 있다. 이상, 상술한 바와 같이, 본 발명에 따른 화자 인식 장치는, 기 등록된 댁 내 사용자들이 특수집단인 경우, 화 자 인식 알고리즘에 업데이트된 기준점수를 적용함으로써 상기 특수집단에 속하는 사용자들의 목소리를 정확하 게 식별(구별)할 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 또한, 상기 컴 퓨터는 단말기의 제어부를 포함할 수도 있다. 따라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어 서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정 되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2018-0120294", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 화자 인식 시스템의 구성 블록도; 도 2는 본 발명의 일 실시 예에 따른 AI 스피커의 구성 블록도; 도 3은 본 발명의 일 실시 예에 따른 화자 인식 장치의 구성 블록도; 도 4는 본 발명의 일 실시 예에 따른 음성 등록 방법을 설명하는 순서도; 도 5는 화자 식별을 위한 기준점수를 업데이트하는 방법을 예시하는 도면; 도 6은 본 발명의 일 실시 예에 따른 화자 인식 방법을 설명하는 순서도."}
