{"patent_id": "10-2019-0045719", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0128229", "출원번호": "10-2019-0045719", "발명의 명칭": "건설 장비 운영에 관한 정보제공 방법 및 이를 위한 단말", "출원인": "박동현", "발명자": "박동현"}}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "건설 장비 운영에 관한 정보를 제공하는 방법으로서,건설 장비 운영에 관한 리깅 플랜(rigging plan) 단계; 및상기 건설 장비의 유지 및 보수에 필요한 정비에 관한 정보를 제공하는 단계 중에서 적어도 하나를 포함하고,상기 리깅 플랜 단계는,작업 조건 값의 입력 데이터를 작업 제원 및 리깅 플랜 구성에 필요한 데이터로 변환하는 단계;변환된 데이터를 데이터베이스에 저장된 제원 데이터와 비교하여 가능한 작업 제원을 검출하는 단계; 및검출된 작업 제원을 이용하여 리깅 플랜을 구성하는 단계를 포함하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 가능한 작업 제원을 검출하는 단계는,다양한 크레인 모드에 따라 작업 제원을 산출하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 데이터베이스는,복수의 크레인 메이커로부터 수집된 복수의 크레인 기종의 제원표에 기초하여 구축된 제원 데이터베이스인 것을특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 시뮬레이션을 구성하는 단계는,작업 제원에 따른 2차원 CAD 기반의 크레인 작업 도면을 추출하는 단계를 포함하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,공개특허 10-2020-0128229-3-상기 시뮬레이션을 구성하는 단계는,작업이 이루어질 현장의 주소를 입력 받는 단계; 및상기 주소를 기초로 검출된 지도 정보와 상기 장소에 소재한 시설 또는 건물에 관한 정보를 이용하여 3차원 CAD기반의 가상의 작업 현장을 구성하는 단계를 포함하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 정비를 위한 정보를 제공하는 단계는,인공지능 챗봇을 이용하여 정비 지식을 제공하는 단계를 포함하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 정비를 위한 정보를 제공하는 단계는,입력된 건설 장비 전자제어기의 에러 코드를 해석하는 단계; 및상기 해석 결과에 따라 에러 코드별 정비 솔루션을 제공하는 단계를 포함하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 인공지능 챗봇을 이용하여 정비 지식을 제공하는 단계는,날씨, 시간 및 장소와 함께 수집된 정비 데이터 분석을 통해 고장 원인과 정비 결과에 대한 정보를 재구성하는단계; 및재구성된 정비 빅데이터를 키워드 기반 질의 응답 시스템 구축을 통해 오류에 대한 솔루션을 제공하는 단계를포함하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 건설 장비 운영에 관한 정보가 작업 현장에서 제공될 수 있도록, 상기 건설 장비 운영에 관한 리깅 플랜단계를 구성하는 각 단계들의 결과를 모바일 단말 디스플레이에 적합한 사용자 인터페이스(user interface, UI)를 통해 사용자 단말에 표시하는 단계를 더 포함하는 것을 특징으로 하는,정보제공 방법."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2020-0128229-4-건설 장비 운영에 관한 정보를 제공하는 플랫폼에 접속하기 위한 사용자 단말로서,건설 장비 운영에 관한 제원 정보를 제공하는 리깅(rigging) 모듈 및 상기 건설 장비의 유지 및 보수에 필요한정비에 관한 정보를 제공하는 모듈 중에서 적어도 하나를 관리하는 기능 관리 모듈을 포함하고,상기 리깅 모듈은,작업 무게, 건물 높이 및 작업 거리를 포함하는 입력 데이터에 기반하여 작업 각도, 웨이트, 붐 길이 및 작업거리를 포함하는 변환 데이터를 출력하는 데이터 변환 모듈;분석을 통해 상기 변환 데이터를 만족하는 크레인을 검출하는 제원 분석 모듈; 및검출된 상기 크레인을 이용하여 리깅 플랜을 구성하는 시뮬레이션 모듈을 포함하는,사용자 단말."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 정비에 관한 정보를 제공하는 모듈로서,키워드 기반의 질의 응답 정보 축적과 데이터 마이닝을 통해 학습 데이터를 축적하고, 축적된 질의/응답 데이터를 기반으로 기계학습 및 강화 학습을 수행하고, 사용자 정비 정보 질의에 대해 학습된 질의/응답 데이터를 기반으로 최적화된 정비 정보 응답을 수행하는 정비 챗봇 모듈을 더 포함하는 것을 특징으로 하는,사용자 단말."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 정비 챗봇 모듈은,챗봇 데이터베이스로 넘어오지 않은 실시간 데이터에 대해서 검색 시점에 검색하여 해당 키워드에 부합하는 정보가 있을 시, 이를 가져오는 실시간 채팅 DB 검색 모듈을 포함하는 것을 특징으로 하는,사용자 단말."}
{"patent_id": "10-2019-0045719", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "건설 장비 운영에 관한 정보를 제공하는 방법에 관한 컴퓨터프로그램으로서,건설 장비 운영에 관한 리깅 플랜(rigging plan) 단계; 및상기 건설 장비의 유지 및 보수에 필요한 정비에 관한 정보를 제공하는 단계 중에서 적어도 하나를 포함하고,상기 리깅 플랜 단계는,작업 조건 값의 입력 데이터를 작업 제원 및 리깅 플랜 구성에 필요한 데이터로 변환하는 단계;변환된 데이터를 데이터베이스에 저장된 제원 데이터와 비교하여 가능한 작업 제원을 검출하는 단계; 및검출된 작업 제원을 이용하여 리깅 플랜을 구성하는 단계를 포함하고, 상기 각 단계들을 실행시키기 위하여, 컴퓨터로 판독 가능한, 비-일시적인 저장 매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 건설 장비 운영에 관한 정보를 제공하는 방법에 관한 것으로, 건설 장비 운영에 관한 리깅 플랜 단계 및 건설 장비의 유지 및 보수에 필요한 정비에 관한 정보를 제공하는 단계 중에서 적어도 하나를 포함하고, 리깅 플랜 단계는, 작업 조건 값의 입력 데이터를 작업 제원 및 리깅 플랜 구성에 필요한 데이터로 변환하는 단계, 변 환된 데이터를 데이터베이스에 저장된 제원 데이터와 비교하여 가능한 작업 제원을 검출하는 단계 및 검출된 작 업 제원을 이용하여 리깅 플랜을 구성하는 단계를 포함하는 정보제공 방법을 개시한다. 본 발명에 따르면, 모바일 단말을 통해 작업 현장에서 크레인 리깅 플랜에 관한 정보 및 시뮬레이션 결과를 확인 할 수 있다."}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건설 장비 운영에 관한 정보제공 방법 및 이를 위한 사용자 단말에 관한 것으로서, 더욱 상세하게는 크레인의 리깅 플랜과 건설 장비의 정비에 관한 정보를 제공하는 방법과 이러한 정보를 제공하는 건설 장비 운 영 플랫폼의 접속에 필요한 사용자 단말에 관한 것이다."}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "건설 장비는 건설 현장에서 사용되는 중장비로서, 예를 들어 굴삭기, 크레인, 및 로더, 기게차 등이 이에 포함 된다. 건설 장비는 기업 또는 개인 주체의 건설 용역 제공업에서 건설 용역 제공을 위해 주로 사용된다. 종래의 건설 장비를 이용하는 용역 제공업에 관한 공개번호 제10-2017-0080804호의 '굴삭기 조합정보 제공시스 템 및 굴삭기 최적 조합 설정방법'에서 토사 유형에 따른 작업량, 작업시간을 기반으로 최대 공사이윤의 산출이 가능한 굴삭 장비의 조합정보를 제공하는 시스템이 개시되어 있다. 또한, 종래의 건설 장비를 이용하는 용역 제공업에 관한 등록번호 제10-1891038호의 '건설업 및 광업을 위한 최 적장비조합 산정 시스템 및 그 운영방법'에서 토출량 산출부를 통해 절토량 및 성토량을 계산해서 건설업 및 광 업을 위한 최적장비 조합 산정 시스템이 개시되어 있다. 그러나, 건설 장비의 운영에 관한 종래의 기술에 따르면, 장비의 조합 산정에 한정되어 있어서, 예를 들어 크레 인에 관한 리깅 플랜(rigging plan) 및, 기계 및 전자 장비에 관한 전문지식이 요구되는 건설 장비의 정비에 관 한 정보가 제공되지 못하였다. 그리고 리깅 플랜이나 건설 장비의 정비에 관한 정보는 건설 또는 작업 현장에서 필요한 것으로서 종래의 기술에서는 모바일 환경에 적합한 형태로 제공되지 못했다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 공개번호 제10-2017-0080804호(2017.07.11.공개) (특허문헌 0002) 한국 등록특허공보 제10-1891038호(2018.08.16.등록)"}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 과제는, 건설 장비의 정비에 관한 정보를 제공하지 못했던 건설 장비 운영 플랫폼에 관한 종래 기 술의 문제점을 해결하고자 한다. 본 발명의 일 과제는, 건설 장비의 조합 산정에 한정되어 있었던 종래 기술의 문제점을 해결하고자 한다. 본 발명의 일 과제는, 고가의 캐드 프로그램에 기초하고 있어서, 작업 현장에서 사용이 불가능했던 크레인 리깅 프로그램에 관한 종래 기술의 문제점을 해결하고자 한다. 본 발명의 목적은 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명 의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시 예에 따른, 건설 장비 운영에 관한 정보를 제공하는 방법은, 건설 장비 운영에 관한 리깅 플랜(rigging plan) 단계; 및 건설 장비의 유지 및 보수에 필요한 정비에 관한 정 보를 제공하는 단계 중에서 적어도 하나를 포함하고, 리깅 플랜 단계는, 작업 조건 값의 입력 데이터를 작업 제 원 및 리깅 플랜 구성에 필요한 데이터로 변환하는 단계; 변환된 데이터를 데이터베이스에 저장된 제원 데이터 와 비교하여 가능한 작업 제원을 검출하는 단계; 및 검출된 작업 제원을 이용하여 리깅 플랜을 구성하는 단계를 포함한다. 또한, 가능한 작업 제원을 검출하는 단계는, 다양한 크레인 모드에 따라 작업 제원을 산출하는 것을 특징으로 한다. 또한, 데이터베이스는, 복수의 크레인 메이커로부터 수집된 복수의 크레인 기종의 제원표에 기초하여 구축된 제 원 데이터베이스인 것을 특징으로 한다. 또한, 시뮬레이션을 구성하는 단계는, 작업 제원에 따른 2차원 CAD 기반의 크레인 작업 도면을 추출하는 단계를 포함하는 것을 특징으로 한다. 또한, 시뮬레이션을 구성하는 단계는, 작업이 이루어질 현장의 주소를 입력 받는 단계; 및 주소를 기초로 검출 된 지도 정보와 장소에 소재한 시설 또는 건물에 관한 정보를 이용하여 3차원 CAD 기반의 가상의 작업 현장을 구성하는 단계를 포함하는 것을 특징으로 한다. 또한, 정비를 위한 정보를 제공하는 단계는, 인공지능 챗봇을 이용하여 정비 지식을 제공하는 단계를 포함하는 것을 특징으로 한다. 또한, 정비를 위한 정보를 제공하는 단계는, 입력된 건설 장비 전자제어기 의 에러 코드를 해석하는 단계; 및 해석 결과에 따라 에러 코드별 정비 솔루션을 제공하는 단계를 포함하는 것을 특징으로 한다. 또한, 인공지능 챗봇을 이용하여 정비 지식을 제공하는 단계는, 날씨, 시간 및 장소와 함께 수집된 정비 데이터 분석을 통해 고장 원인과 정비 결과에 대한 정보를 재구성하는 단계; 및 재구성된 정비 빅데이터를 키워드 기반 질의 응답 시스템 구축을 통해 오류에 대한 솔루션을 제공하는 단계를 포함하는 것을 특징으로 한다. 또한, 정보제공 방법은, 건설 장비 운영에 관한 정보가 작업 현장에서 제공될 수 있도록, 건설 장비 운영에 관 한 리깅 플랜 단계를 구성하는 각 단계들의 결과를 모바일 단말 디스플레이에 적합한 사용자 인터페이스(user interface, UI)를 통해 사용자 단말에 표시하는 단계를 더 포함하는 것을 특징으로 한다. 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼에 접속하기 위한 사용자 단말은, 건설 장비 운영에 관한 제원 정보를 제공하는 리깅(rigging) 모듈 및 건설 장비의 유지 및 보수에 필요한 정비 에 관한 정보를 제공하는 모듈 중에서 적어도 하나를 관리하는 기능 관리 모듈을 포함하고, 리깅 모듈은, 작업 무게, 건물 높이 및 작업 거리를 포함하는 입력 데이터에 기반하여 작업 각도, 웨이트, 붐 길이 및 작업 거리를 포함하는 변환 데이터를 출력하는 데이터 변환 모듈; 분석을 통해 변환 데이터를 만족하는 크레인을 검출하는 제원 분석 모듈; 및 검출된 크레인을 이용하여 리깅 플랜을 구성하는 시뮬레이션 모듈을 포함한다. 또한, 사용자 단말은, 정비에 관한 정보를 제공하는 모듈로서, 키워드 기반의 질의 응답 정보 축적과 데이터 마 이닝을 통해 학습 데이터를 축적하고, 축적된 질의/응답 데이터를 기반으로 기계학습 및 강화 학습을 수행하고, 사용자 정비 정보 질의에 대해 학습된 질의/응답 데이터를 기반으로 최적화된 정비 정보 응답을 수행하는 정비 챗봇 모듈을 더 포함하는 것을 특징으로 한다. 또한, 정비 챗봇 모듈은, 챗봇 데이터베이스로 넘어오지 않은 실시간 데이터에 대해서 검색 시점에 검색하여 해 당 키워드에 부합하는 정보가 있을 시, 이를 가져오는 실시간 채팅 DB 검색 모듈을 포함하는 것을 특징으로 한 다. 본 발명의 일 실시 예에 따른 컴퓨터로 판독가능한, 비-일시적인 저장 매체에 저장된 컴퓨터프로그램은, 건설 장비 운영에 관한 정보를 제공하는 방법에 관한 인스트럭션들로서, 컴퓨팅 장치에 의해 실행되었을 때, 건설 장 비 운영에 관한 리깅 플랜(rigging plan) 단계; 및 상기 건설 장비의 유지 및 보수에 필요한 정비에 관한 정보 를 제공하는 단계 중에서 적어도 하나를 포함하고, 상기 리깅 플랜 단계는, 작업 조건 값의 입력 데이터를 작업 제원 및 리깅 플랜 구성에 필요한 데이터로 변환하는 단계; 변환된 데이터를 데이터베이스에 저장된 제원 데이 터와 비교하여 가능한 작업 제원을 검출하는 단계; 및 검출된 작업 제원을 이용하여 리깅 플랜을 구성하는 단계 를 포함하는 방법을 수행하도록 연산되는 저장된 인스트럭션들을 갖는다."}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 모바일 단말을 통해 작업 현장에서 크레인 리깅 플랜에 관한 정보 및 건설 장비 정비에 관한 정보를 확인할 수 있다. 또한, 인공지능을 이용하는 정비 챗봇을 통해 건설 장비 정비에 관한 정보를 실시간으로 제공할 수 있다. 또한, 현장 계측 없이도 건물 주소 입력, 지도 정보를 이용하여 리깅 플랜에 필요한 도면과 입체 모형을 구성할 수 있다."}
{"patent_id": "10-2019-0045719", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 건설 장비 운영에 관한 정보를 제공하는 플랫폼 접속하여 정보제공 방법 및 이를 위한 단말에 대한 바람직한 실시 예를 상세히 설명하기로 한다. 각 도면에 제시된 동일한 참조부호는 동일한 부재를 나타낸다. 또한 본 발명의 일 실시 예들에 대해서 특정한 구조적 내지 기능적 설명들은 단지 본 발명에 따른 실시 예를 설명하기 위한 목적으로 예시된 것으로, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으 로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가 지는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는 것이 바람직하다. 본 발명에서 '건설 장비'는 주택, 도로, 항만 및 산업 플랜트를 건설하는 건설현장에서 사용되는 포크레인, 크 레인, 불도저, 덤프 트럭, 로더, 스크레이퍼, 모터그레이더, 롤러 및 지게차를 포함하는 개념으로, 이들에만 한 정되는 것은 아니다. 특히 크레인은 건설현장뿐만 아니라 간판 등의 부착물 설치 및 고소 작업 용도로 이용될 수 있다. 건설 장비와 관련된 산업은 건설 장비의 제조업 및 해외 건설 장비의 수입업 분야와 건설 장비를 이용하여 건설 에 용역을 제공하는 건설 장비 운영업과 건설 장비의 유지 및 보수에 필요한 건설 장비 정비업 분야가 있다. 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보제공 방법 및 이를 위한 단말은 건설 장비 운영 플랫 폼을 구성하는 방법 및 장치에 해당한다. 본 발명의 일 실시 예에 따른 건설 장비 운영 플랫폼은, 건설 장비 운영에 관한 정보 제공업자, 건설 장비 회사 와 개인업자, 건설 장비 정비 회사와 개인 정비사, 및 건설 장비 제조 회사와 건설 장비 수입 업자를 하나로 통 합하여 건설 장비의 유통, 관리, 유지 및 보수에 필요한 각종 정보를 공유할 수 있는 플랫폼이다. 도 1은 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼의 예시도이다. 도 1을 참조하면 건설 장비 운영에 관한 정보를 제공하는 플랫폼은 건설 장비 운영에 관한 정보제공 서비 스를 이용하기 위한 단말(이하 사용자 단말), 건설 장비 운영에 관한 정보를 제공하는 서버(이하 서 버), 및 건설 장비 제조회사, 건설 장비 수입 업자의 서버 및 네트워크를 포함하도록 구성될 수 있다. 여기서 사용자 단말은 건설 장비 회사에 속한 개인, 건설 장비 개인 업자, 건설 장비 정비 회사에 속한 개인, 및 개인 정비사의 사용자 단말로 이용될 수 있다. 사용자 단말은 컴퓨터의 기능을 수행할 수 있는 유선 및 무선의 통신이 가능한 통신기기이다. 사용자 단말 은, 건설 장비 운영에 관한 정보를 제공하는 플랫폼에 접속하여, 각종 서비스 이용에 필요한 데이터 를 송신 및 수신하는 전용의 장치, 범용의 컴퓨팅 장치, 네트워크 단말(network terminal) 및 무선 단말 (wireless terminal)을 포함한다. 무선 단말의 다양한 실시 예들은 셀룰러 전화기, 무선 통신 기능을 가지는 스마트 폰, 무선 통신 기능을 가지는 개인 휴대용 단말기(PDA), 무선 모뎀, 무선 통신 기능을 가지는 휴대용 컴퓨터, 무선 통신 기능을 가지는 디지 털 카메라와 같은 촬영장치, 무선 통신 기능을 가지는 게이밍(gaming) 장치, 무선 통신 기능을 가지는 음악저장 및 재생 가전제품, 무선 인터넷 접속 및 브라우징이 가능한 인터넷 가전제품뿐만 아니라 그러한 기능들의 조합 들을 통합하고 있는 휴대형 유닛 또는 단말기들을 포함할 수 있으나, 이에 한정되는 것은 아니다. 서버는 사용자 단말의 요청에 따라 각종 서비스, 예를 들어 리깅 플랜, 정비 챗봇을 통한 정비, 및 멀티 미터를 통한 원격 정비 서비스를 제공하는 역할을 한다. 서버는 단일의 장치 또는 복수의 장치가 포 함된 시스템으로 구성될 수 있다. 건설 장비 제조 회사, 건설 장비 수입 업자의 서버는 건설 장비의 제원에 관한 정보와 제품의 품질 보증과 관련된 서비스를 단말 또는 서버 측에 제공할 수 있다. 네트워크는 유선 및 무선 네트워크, 예를 들어 LAN(local area network), WAN(wide area network), 인터 넷(internet), 인트라넷(intranet) 및 엑스트라넷(extranet), 그리고 모바일 네트워크, 예를 들어 셀룰러, 4G, LTE, 5G, WiFi 네트워크, 애드혹 네트워크 및 이들의 조합을 비롯한 임의의 적절한 통신 네트워크일 수 있다. 이하 서버가 사용자 단말에 제공하는 서비스 중에서 리깅 플랜에 관하여 설명하기로 한다. 도 2는 리깅 플랜을 설명하기 위한 예시도이다. 도 2를 참조하면, 크레인이 작업물을 리프트하고 있는 상황이 묘사되어 있다. 크레인의 운영과 관련된 리깅 플 랜(Rigging Plan)은 크레인 작업을 하기 위한 사전 조사, 이에 관한 전자 도면 작성 및 이를 이용하는 시뮬레이 션 실습을 포함하는 개념이다. 크레인을 이용하여 작업물을 리프트하는 작업을 수행함에 있어서, 작업자 관점에서는 작업 높이, 작업 거리 및 작업물의 중량이 관심의 대상이고, 크레인을 작동시키는 엔지니어 관점에서는 붐 길이, 작업 각도, 및 작업물의 중량이 관심의 대상이 된다. 크레인 플랜을 통해 작업 높이, 작업 거리 및 작업물의 중량을 작업 조건으로 하여 크레인 제원을 검출하는데 필요한 붐 길이, 작업 각도 및 작업물의 중량에 관한 변환된 데이터가 출력되고, 이 를 바탕으로 크레인 제원 및 모드가 선택되고 이를 기반으로 2D, 및 3D 도면을 이용한 시뮬레이션이 구성될 수 있다. 이하 사용자 단말의 각 구성요소들이 수행하는 역할에 대해 간단히 설명하기로 한다. 도 3은 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼에 접속하여 정보제공 서비 스를 이용하기 위한 단말의 블록도이다. 도 3을 참조하면, 정보제공 서비스를 이용하기 위한 단말은 제어부, 통신부, 입력 장치, 출력 장치, 센서, 및 제원 데이터베이스(database, DB)를 포함하도록 구성될 수 있다. 제어부는, 기능관리 모듈, 리깅 모듈, 정비 챗봇 모듈 및 멀티 미터 모듈을 포함하도 록 구성될 수 있다. 제어부에 대해서는 도 4에서 설명하기로 한다. 통신부는 근거리 무선통신, 무선 데이터 통신 및 무선 음성 통신을 위한 장치를 포함한다. 입력 장치는 사용자의 입력에 따라 건설 장비 운영에 관한 정보제공 서비스 이용에 필요한 문자 또는 개체 를 입력한다. 입력 장치는 키보드(keyboard), 터치스크린(touch screen), 마우스(mouse), 전자펜(stylus pen) 및 펜 태블릿(pen tablet)을 포함하되, 이에 한정되는 것은 아니다. 출력 장치는 건설 장비 운영 애플리케이션 모듈 관련 사용자 인터페이스 등을 표시하는 디스플레이 (display) 및 문서를 프린트 출력하는 프린터(printer)를 포함한다. 또한, 출력 장치는 문자를 음성합성 (text to speech, TTS) 엔진을 이용하여 음성으로 출력하는 스피커(speaker), 헤드폰(head-phone) 및 헤드셋 (head-set)을 포함한다. 센서는, 이미지 센서, 즉 카메라 장치와 사용자 단말의 동작 및 위치를 감지하는 가속 센서 및 자이 로 센서 등을 포함하도록 구성될 수 있다. 제원 데이터베이스(database, DB)는 크레인 메이커에서 제공하는 각종 크레인 모델에 관한 제원 정보 및 모드 정보를 포함한다. 도 4는 본 발명의 일 실시 예에 따른 사용자 단말의 제어부의 블록도이다. 도 4를 참조하면, 제어부는 기능관리 모듈, 리깅 모듈, 정비 챗봇 모듈, 및 멀티 미터 모 듈를 포함하도록 구성될 수 있다. 기능관리 모듈은 리깅 모듈, 정비 챗봇 모듈 및 멀티 미터 모듈을 관리하는 역할을 한다. 즉 기능관리 모듈은 사용자의 선택에 따라 해당 모듈을 실행시키고 해당 모듈의 사용 횟수, 사용 시간에 관한 통계 정보를 수집, 저장 및 관리하는 역할을 한다. 리깅 모듈은, 건설 현장에서 이동식 크레인 작업 전에 수행되는 일련의 작업을 수행한다. 예를 들어, 리깅 모듈은 현장 시찰 후 작업 가능한 이동식 크레인을 정하고, 장비 세팅 자리 및 방법, 장비 세팅 모드 등의 장비 운용에 관한 모든 작업을 컴퓨터의 CAD 기술을 이용하여 시뮬레이션 하는 역할을 한다. 정비 챗봇 모듈은 키워드 기반의 질의 응답 정보 축적과 데이터 마이닝을 통한 학습 데이터 축적하고, 축 적된 질의/응답 데이터를 기반으로 기계학습 및 강화 학습 수행한다. 그리고 정비 챗봇 모듈은 사용자 정 비 정보 질의에 대해 학습된 질의/응답 데이터를 기반으로 최적화 된 정비 정보 응답 기능을 제공한다. 멀티 미터 모듈은, 에러 코드(error code) 해석 및 원격 정비 서비스를 제공하는 역할을 한다. 에러 코드 해석 서비스는 작업 간 빈번하게 발생하는 에러 코드에 대해 장비 운용자들에게 에러 코드 입력 시 해당 에러 코드에 대한 원인 분석 결과를 제공하는 서비스이다. 에러 코드가 발생하면 작업이 중지되며 그에 따 른 조치가 되지 않을 시 작업이 재개 불가능하다. 따라서, 에러 코드 해석 서비스는 건설현장에서 에러가 발생 한 경우 빠르게 솔루션에 도달할 수 있는 길을 제공한다. 추가적으로 에러 코드에 관한 솔루션이 사용자 단말을 통해 사용자에게 제공될 수 있다. 원격 정비 서비스는 사용자 단말과 연동하는 디지털 멀티 미터를 이용한 각종 파라미터 측정에 기반하여 정비 챗봇 및 사용자 채팅을 통해 복합적으로 제공된다. 도 5는 본 발명의 일 실시 예에 따른 리깅 모듈의 블록도이다. 도 5를 참조하면, 리깅 모듈은 데이터 변환 모듈, 제원 분석 모듈, 제원 관리 모듈, 시뮬 레이션 모듈 및 사용자 관리 모듈를 포함하도록 구성될 수 있다. 데이터 변환 모듈은 입력된 작업 조건 값, 즉 작업 거리, 작업 높이, 작업물 중량에 관한 값을 작업 제원 및 도면 추출에 필요한 값, 즉 크레인 붐 길이, 각도, 작업물 중량에 관한 값으로 변환하여 제원 분석 모듈 로 전송하는 역할을 한다. 입력된 작업 조건 값 중에서, 작업 높이와 작업 거리의 비와 삼각함수를 이용하여 붐의 각도가 도출된다. 도출 된 붐의 각도와 작업거리 또는 작업 높이를 가지고 삼각함수를 이용하면 붐 길이가 도출된다. 다만, 작업의 종 류에 따라 붐의 각도에 임계값이 설정될 수 있다. 예를 들어 붐의 임계 각도가 60도로 설정된 경우, 충분한 작 업 거리임에도 불구하고, 작업 높이가 더 높아질 수 있고, 따라서 붐 길이가 더 요구될 수 있다.입력된 값이 작업 제원 및 도면 추출에 필요한 값으로 변환하는 과정에서, 작업물 중량 외에 후크의 중량, 와이 어 중량, 샤클 중량 및 그 밖의 리프팅 디바이스의 중량이 고려될 수 있다.제원 분석 모듈은 입력 받은 변 환된 데이터를 제원 DB에 저장되어 있는 제원표와 비교하여 가능한 제원을 검출하는 역할을 한다. 제원 분석 모듈은 작업 가능한 크레인의 목록을 표시할 수 있다. 예를 들어, 크레인 붐 길이, 각도, 작업 물 중량에 관한 값에 적합한 크레인 중에서 작업 가능한 크레인의 모델명, 작업 모드, 무게추 및 작업 추에 관 한 정보를 표시한다. 제원 분석 모듈은 제원 DB를 통해 작업에 적합한 제원을 검출하는 과정에서, 크레인 작업 모드를 함께 검 출할 수 있다.크레인 모드란 하나의 크레인이 모델이 응용을 통해 변화될 수 있는 범위를 의미한다. 예를 들어, 12m의 작업거리에서 100m의 붐 길이로 최고 20톤의 중량을 리프트 할 수 있는 A 모델의 크레인이 있는 경우에, 충분한 작업 높이를 원하는 경우, 사용자는 A 모델보다 한 단계 높은 B 모델을 선택하거나, A 모델의 메인 모드 를 예를 들어, 픽스 모드, 러핑 모드 또는 혼합 모드로 변경할 수 있다. 크레인 모드에 관한 자세한 것은 후술 하기로 한다. 제원 관리 모듈은 제원 분석 모듈에서 검출된 제원을 건설 장비 운영 애플리케이션의 UI에 맞게 차트로 구 성하는 역할을 한다. 시뮬레이션 모듈은 재원 분석 모듈에서 전송 받은 정보에 맞는 크레인 작업 도면을 추출하는 역할을 한다. 그리고 시뮬레이션 모듈은 작업이 이루어질 현장의 주소를 입력 받아, 주소를 기초로 검출된 지도 정보와 상기 장소에 소재한 시설 또는 건물에 관한 정보를 이용하여 가상의 작업 현장을 구성하는 역할을 한다. 사용자 관리 모듈은 사용자가 지정해 놓은 크레인 데이터와 비교 후 제원을 검출하는 역할을 한다. 도 6은 본 발명의 일 실시 예에 따른 정비 챗봇 모듈의 블록도이다. 도 6을 참조하면, 정비 챗봇 모듈은 자연어 처리 모듈, 질의 응답 관리 모듈, 기계 학습 제어 모듈, 정비 정보 관리 모듈, 실시간 채팅 DB 검색 모듈, 질의 응답 기록 관리 모듈 및 사 용자 관리 모듈을 포함하도록 구성될 수 있다. 정비 챗봇 모듈은 키워드 기반의 질의 응답 정보 축적과 데이터 마이닝을 통한 학습 데이터를 축적하고, 축적된 질의/응답 데이터를 기반으로 기계학습 및 강화 학습 수행한다. 또한, 정비 챗봇 모듈은 사용자 정 비 정보 질의에 대해 학습된 질의/응답 데이터를 기반으로 최적화 된 정비 정보 응답 기능을 수행한다. 자연어 처리 모듈은 전송 받은 질의 데이터에서 의미론적 분석을 통해 컴퓨터가 이해할 수 있는 키워드 기 반의 데이터로 변환 후 다음 모듈로 전송하는 역할을 한다. 질의 응답 관리 모듈은 자연어 처리 모듈에서 들어온 키워드 기반의 데이터를 분류 정제하여 기계학 습이 가능하도록 데이터를 처리하는 역할을 한다. 기계학습 제어 모듈은 자연어 처리 모듈에서 변환된 키워드 기반의 데이터를 입력 받아 기계 학습을 수행 하여 정비 정보 질의에 대한 답변을 학습한다. 정비 정보 관리 모듈은 키워드에 맞는 데이터를 추출하는 역할을 한다. 실시간 채팅 DB 검색 모듈은 챗봇 DB로 넘어오지 않은 실시간 데이터에 대해서 검색 시점에 검색하여 해당 키워드에 부합하는 정보가 있을 시 가져오는 검색 모듈 역할을 한다. 질의 응답 기록 관리 모듈은 사용자 정보에 질의 응답 기록하는 역할을 한다. 병렬형 키워드 자연어 처리 모듈은 추출된 데이터를 자연어로 변환하는 역할을 한다. 도 7은 본 발명의 일 실시 예에 따른 멀티 미터 모듈의 블록도이다. 도 7을 참조하면, 멀티 미터 모듈은 예방 정비 리스트 모듈, 정비 가이드 모듈, 측정 및 판단 모듈, 채팅 UI 모듈, 정비 챗봇 모듈, 에러 코드 입력 모듈, 및 에러 코드 분석 모듈 을 포함하도록 구성될 수 있다. 예방 정비 리스트 모듈, 정비 가이드 모듈 및 측정 및 판단 모듈을 통해 사용자는 예방 정비에 필요한 정보를 제공 받을 수 있다. 예방 정비 리스트 모듈은 정비 챗봇 데이터베이스에서 해당 데이터 전송 일자에서 가장 많이 발생하는 고 장 부위 리스트를 전송 받아 출력한다. 정비 가이드 모듈은 입력 받은 점검 부위 및 위치 등을 점검 방법 가이드를 매치하여 비디오 및 이미지 자 료를 통해 사용자에게 안내하는 역할을 한다. 측정 및 판단 모듈은 멀티 미터의 프로브로 측정된 데이터를 USB 타입의 통신 연결 방법으로 수치를 전송 받아 해당 기능에 맞는 값을 출력하고 해당 값에 대한 분석결과를 판단하여 출력한다. 채팅 UI 모듈 및 정비 챗봇 모듈을 통해 사용자는 고장 해결에 필요한 정보를 제공 받을 수 있다. 채팅 UI 모듈은 채팅 UI를 이용하여 사용자 간의 채팅에 관한 정보를 챗봇 서버로 전송하는 역할을 한다. 정비 챗봇 모듈은 챗봇 서버로 전송된 정보를 분석하여 서버에 저장되어 있는 키워드를 추출한 후 해당 키 워드에 맞는 점검 부위를 출력하는 역할을 한다. 에러 코드 입력 모듈 및 에러 코드 분석 모듈을 통해 사용자는 에로 코드 분석에 관한 정보를 제공 받을 수 있다. 에러 코드 입력 모듈은 사용자 입력에 따라 건설 장비의 운행 또는 정비 과정에서 발생한 에러 코드를 입 력 받는다. 에러 코드 분석 모듈는 입력 받은 에러 코드의 원인을 분석하는 역할을 한다. 에러 코드 분석 모듈은 등록된 다양한 에러 코드 과거 사례를 통해 건설 장비에서 빈번하게 발생하는 에러 코드의 원인을 분석한다. 원격 정비를 위한 카테고리로 예방 정비와 정비 가이드가 포함될 수 있다. 각 카테고리에 대해 예방 정비 리스 트 모듈 및 정비 가이드 모듈이 해당 카테고리에 맞는 원격 정비를 수행한다. 원격 정비를 위해서는 채팅, 정비 챗봇, 에러 코드 입력 및 분석 모듈이 함께 협업한다. 도 3 내지 도 7에 도시된 사용자 단말의 제어부의 각 구성요소는 설명의 편의를 위해 기능적으로 구 분한 구성으로, 하드웨어적으로는 하나 이상의 프로세서에 의해 처리되는 논리적인 기능으로 구성될 수 있는 것으로, 제시된 구분에 의해 본 발명을 한정하는 것은 아니다. 또한, 각 구성간의 연결 관계가 연결선으로 도시되어 있거나, 상호 간의 연결 관계가 일일이 표현되어 있지 않 지만, 연결선이 도시되지 않은 구성 간에도 제어 또는 데이터 교환을 위한 통신, 전달이 발생될 수 있으며, 제 시된 바에 의해서만 본 발명을 한정하는 것은 아니다. 본 발명의 일 실시 예에 따른 사용자 단말은 컴퓨팅 장치에 해당될 수 있다. 이하 컴퓨팅 장치 에 해당하는 본 발명의 일 실시 예에 따른 사용자 단말이 다른 실시 예를 통해 보다 구체적으로 설명될 수 있다. 사용자 단말 및 서버는 하나 이상의 프로세서, 즉 CPU(central processing unit), 메모리 , 대용량 저장소, 입력 장치, 출력 장치로 구성된 컴퓨팅 장치를 포함할 수 있다. 컴 퓨팅 장치의 구성요소들은 버스를 통해 서로 통신할 수 있다. 도 8은 컴퓨팅 장치에 해당하는 사용자 단말 및 서버의 블록도이다. 도 8을 참조하면, 컴퓨팅 장치는 제어부 내의 프로세서, 메모리, 입력 장치, 출력 장 치, 센서, 통신부, 제원 DB가 저장된 저장장치 및 버스를 포함한다. 프로세서는 메모리 및 저장 장치에 저장된 본 발명의 일 실시 예에 따른 건설 장비 운영 애플리 케이션 모듈 및 서버 모듈이 포함하고 있는 컴퓨터 명령어 셋을 실행할 수 있다. 프로세서는 중앙 처리 장 치(central processing unit, CPU), 그래픽 처리 장치(graphics processing unit, GPU) 또는 본 발명에 따른 방법들이 수행되는 전용의 프로세서를 의미할 수 있다. 메모리와 저장 장치는 휘발성 저장 매체 및 비휘발성 저장 매체로 구성될 수 있다. 예를 들어, 메모리는 읽기 전용 메모리(read only memory, ROM) 및 랜덤 액세스 메모리(random access memory, RAM)로 구성될 수 있다. 컴퓨팅 장치에 포함된 각각의 구성 요소들은 버스에 의해 연결되어 서로 통신을 수행한다. 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼을 통해 건설 장비 운영에 관한 리 깅 플랜 서비스, 건설 장비의 유지 보수에 필요한 정비에 관한 정보제공 중에서 적어도 하나가 사용자 단말 을 통해 사용자에게 제공될 수 있다. 이하 리깅 플랜 서비스를 제공하는 단계에 대해 설명하기로 한다.도 9는 본 발명의 일 실시 예에 따른 리깅 플랜 단계의 흐름도이다. 도 9를 참조하면, 리깅 플랜 단계는 S110 내지 S150 단계를 포함하도록 구성될 수 있다. 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼에 접속하여 정보제공 방법(S100) 을 구성하는 각 단계들의 실행 주체는 서버와 연동하여 동작하는 사용자 단말이다. 먼저, 작업 조건 값의 입력 데이터를 작업 제원 및 리깅 플랜 구성에 필요한 데이터로 변환한다(S110). 예를 들어, 작업 조건 값은 작업 높이, 작업 구간 내 거리, 즉 작업 거리 및 작업 중량 값에 관한 값이다. 입력 된 3개의 작업 조건 값은, 데이터 변환 모듈을 통해 크레인 붐의 길이와 각도, 작업 중량 값으로 변환된다. 작업 조건 값은 작업 환경과 관련된 값이고, 데이터 변환 모듈은 작업 조건 값을 크레인 제원과 관련된 값으로 변환한다. 즉 크레인 붐의 길이, 각도 및 작업 중량 값은 크레인 제원과 관련된 값이다. 지상에 있는 변압기와 같은 수톤 중량의 시설물을 옥상으로 리프팅 하는 작업 환경을 예로 들면, 가장 이상적인 예로서 작업 거리가 최소인 경우, 즉 건물에 근접한 크레인 주차 공간이 확보된 경우가 있을 수 있다. 이러 경 우에는 작업 거리가 짧기 때문에 상대적으로 붐을 수직에 가까이 세울 수 있고, 따라서 붐의 길이가 옥상의 높 이와 크게 차이가 없다. 그러나, 건물에 근접한 크레인 주차 공간이 확보되지 못한 경우에는 크레인과 건물이 떨어져 있을 수 밖에 없고, 따라서 작업 거리가 길어진다. 작업 거리가 길어짐에 따라 대각선에 해당하는 붐의 길이도 비례하여 길어 진다. 그리고 작업 거리가 길어지는 경우에, 높은 하중을 리프트 하기 위해 붐을 수직에 가깝게 세워야 하기 때 문에 붐의 길이는 2중으로 길어지게 된다. 다음으로 변환된 데이터를 데이터베이스에 저장된 제원 데이터와 비교하여 가능한 작업 제원을 검출한다(S120). 여기서, 작업 제원에는 크레인 모델명과 해당 크레인 모델에 관한 모드에 관한 정보가 포함된다. 크레인 제원과 관련된 값인, 크레인 붐의 길이, 각도 및 작업 중량 값이 산출되면, 산출된 제원 값을 가지고 크 레인, 즉 작업 제원을 검출해야 한다. 종래의 기술에 의하면 다수의 크레인 메이커들이 공개하고 있는 크레인 제원표를 이용해야 일일이 비교하면서 작업에 적합한 제원을 검출해야 했다. 본 발명의 일 실시 예에 따른 정보제공 방법(S100)에서는, 건설 장비를 운영하는 업자가 보유하고 있는 크레인 과 보유하고 있지는 않지만 확보 가능한 크레인의 제원표를 이용하여 구축된 데이터베이스를 이용하여 쉽게 작 업에 필요한 제원을 검출할 수 있다. 작업 제원을 검출하는 과정은 크레인 붐의 길이, 각도 및 작업 중량 값을 만족하는 제원 중에서 가장 톤수가 적 게 나가는 크레인을 찾는 과정이라고 말할 수 있다. 크레인의 톤수는 웨이트를 포함하는데, 웨이트는 곧 운송비 와 직결된다. 따라서, 적은 운송비를 부담하기 위해서는 가장 톤수가 적게 나가는 크레인을 검출해야 한다. 반 면에, 안전을 위해서 높은 안전도를 요구할 경우에는 해당 안전도에서 가장 적은 톤수의 크레인을 검출해야 한 다. 하나의 크레인이 리프트할 수 있는 작업 중량 값, 각도 및 붐의 길이는 고정된 것이 아니고 모드에 따라 레인지 가 형성된다. 따라서, 작업 제원의 검출은 크레인의 모드에 의해 결정될 수 있다. 크레인의 종류에 따라 여러 가지 모드를 지원하는 크레인이 있다. 크레인의 모드란, 하나의 크레인이 붐의 길이, 하중 및 작업 거리 면에서 확장될 수 있는 범위와 관련된다. 크레인 모드의 종류에는 메인 모드(main mode), 가이드 모드(guide mode), 픽스 모드(fix mode), 러핑 모드(luffing mode) 및 이들이 조화된 혼합 모드 (combination mode)가 있을 수 있다. 일반적으로 크레인은 붐의 길이가 짧을수록, 붐의 각도가 90도에 가까울수록 더 많은 중량을 리프트한다. 다음으로 검출된 제원을 UI에 맞는 차트로 구성한다(S130). 사용 가능한 크레인 모드를 포함하는 검출된 제원은 출력 장치를 통해 사용자 인터페이스(User Interface, UI)를 이용하여 표시된다. 차트는 설정에 따라 사용자 희망의 제원, 작업 가능한 제원을 포함할 수 있다. 다음으로 검출된 작업 제원을 이용하여 리깅 플랜을 구성한다(S140). S140 단계는 S141 내지 S142 단계를 포함한다. S141 단계에서 작업 제원에 따른 크레인 작업 도면을 추출한다(S141). S142 단계에서 주소 입력, 지동 정보와 건물 정보 이용하여 가상의 작업 현장을 구성한다(S142). 시뮬레이션을 구성하는 단계(S140)는 작업 도면, 예를 들어 캐드 도면을 추출하는 단계와 시뮬레이션을 구성하 는 단계를 포함할 수 있다. 종래의 기술에 따르면 리깅 플랜 구성을 위해 건물 및 도로 구조 등의 지형을 실측 하기 위해 현장을 방문해야 하는 번거로움이 있었다. 본 발명의 일 실시 예에서는, 작업이 이루어질 현장의 주 소를 입력 받는 단계를 통해, 주소를 기초로 검출된 지도 정보와 현장에 소재한 시설 또는 건물에 관한 정보, 예를 들어 층수, 높이, 구조 및 건축 재료 등에 관한 정보를 이용하여 가상의 작업 현장을 구성할 수 있다. 마지막으로 S100 단계는 S150 단계를 더 포함할 수 있다. 본 발명에서는 건설 장비 운영에 관한 정보가 작업 현장에서 제공될 수 있도록, 건설 장비 운영에 관한 리깅 플 랜 단계를 구성하는 각 단계들이 모바일 단말 디스플레이에 적합한 사용자 인터페이스(user interface, UI)를 통해 사용자 단말에 표시되도록 할 수 있다(S150). 본 발명의 일 실시 예에 따른 정비를 위한 정보를 제공하는 단계는, 입력된 건설 장비 전자제어기의 에러 코드 를 해석하는 단계 및 상기 해석 결과에 따라 에러 코드별 정비 솔루션을 제공하는 단계를 포함할 수 있다. 도 10a는 메인 모드의 크레인을 설명하기 위한 예시도이다. 도 10a를 참조하면, 크레인 본체에 연결된 하나의 붐(boom)가 묘사되어 있다. 붐은 텔레스코픽 붐(telescopic boom)이라고 해서 낚시대처럼 길이 조절이 가능하다. 붐 대 끝은 와이어를 통해 크레인 본체에 놓인 웨이트에 지지될 수 있다. 도 10b 가이드 모드의 크레인을 설명하기 위한 예시도이다. 도 10b를 참조하면, 크레인 본체에 연결된 붐 대에 추가적으로 붐에 수직에 가깝게 연결된 가이드가 묘사되어 있다. 가이드(guide)는 붐 대 끝은 더욱 지직하기 위한 수단에 해당한다. 가이드의 정식 명칭은 Y자 모양의 버 팀목(Y-shaped guying system)으로 붐의 끝과 크레인 본체에 매여 있는 당김 밧줄(guy)이 팽팽하도록 유지시키 는 역할을 한다. 가이드가 추가됨에 따라 크레인은 붐만으로 리프트할 때보다 더 많은 중량을 리프트할 수 있다. 여기서, 가이드와 붐이 이루는 각도는 작업 중량 값에 따라 조절될 수 있다. 도 10c는 픽스 모드의 크레인을 설명하기 위한 예시도이다. 도 10c를 참조하면, 크레인 본체에 연결된 붐과 붐 끝에 연장되어 연결된 픽스가 묘사되어 있다. 픽스의 정식 명칭은 고정된 격자 지브(fixed lattice jib)이다. 도 10c에는 두 개의 픽스가 연장되어 있다. 픽스로 인해 붐 의 길이가 길어지고, 작업 높이와 작업 거리가 증가한다. 다만, 작업 가능한 중량은 픽스 연장에 따라 줄어 든 다. 도 10d 는 혼합 모드의 크레인을 설명하기 위한 예시도이다. 도 10d를 참조하면, 크레인 본체에 붐 대가 연결되고, 붐에 연결된 하나의 픽스와 가이드 및 하나의 러핑이 묘 사되어 있다. 러핑의 정식 명칭은 러핑 지브(Luffing jib)이다. 러핑은 붐 대를 일정 각도로 기울어지게 연장한 다. 러핑은 가이드와 함께 장착되는 경우가 많다. 그리고 러핑 자체를 연장하는 픽스가 추가적으로 포함될 수 있다. 러핑은 작업 높이와 작업 거리를 동시에 늘리는 역할을 한다. 러핑의 기울어진 각도 때문에 픽스보다 더 안정적인 구조이다. 이하 본 발명의 일 실시 예에 따른 단말의 하드웨어와 결합하여 동작하는 건설 장비 운영 애플리케이션 모 듈의 사용자 인터페이스(User Interface, UI)에 대해 설명하기로 한다. 도 11a는 본 발명의 일 실시 예에 따른 단말의 작업 조건 입력의 UI 뷰이다. 도 11a를 참조하면, 일 실시 예로서 리깅 플랜 단계를 실행하는 RIGGING PLANER의 작업 조건 입력 창이 묘사되 어 있다. 사용자는 작업 내용을 파악한 후 작업 높이, 작업 구간 내 거리, 즉 작업 거리와 작업 중량 값을 입력 할 수 있다. 본 발명의 일 실시 예로서, 사용자는 사용자 단말을 이용하여 현장에서 실측과 함께 작업 조 건 입력이 가능하고, 즉시로 데이터 변환 결과를 확인할 수 있다. 도 11b는 본 발명의 일 실시 예에 따른 단말의 작업 가능한 크레인의 UI 뷰이다. 도 11b를 참조하면, 사용자 단말은 데이터 변환 결과 출력된 붐 길이, 작업 각도 및 작업 중량 값을 기초 로 검출된 작업 제원을 기초로 작업 가능한 크레인에 관한 정보, 예를 들어 모드 정보, 무게추, 즉 웨이트 정보및 작업거리와 함께 표시한다. 또한, 작업 가능한 크레인의 모델 명, 크레인 모드의 종류, 무게 추 및 작업거리 와 함께 크레인 도면 보기 메뉴가 차트 아래에 표시된다. 도 12a는 본 발명의 일 실시 예에 따른 단말의 2D 도면의 UI 뷰이다. 도 12a를 참조하면, 작업 가능한 크레인 모델 명을 선택한 경우 해당 크레인 작업 도면이 표시되어 있다. 도면 은 기본적으로 CAD 기반의 2D 형태로 제공되며, 시뮬레이션을 위한 CAD 기반의 3D 도면의 제공도 가능하다. 사 용자 단말은 사용자가 선택한 크레인 모드에 따라, 붐 길이, 붐 각도, 러핑의 길이 및 각도, 가이드에 관한 정 보가 반영된 CAD 기반의 도면을 표시한다. 예를 들어 UI 뷰에서, 작업 가능 최소 각도가 73도로, 웨이트(무게 추)가 140톤으로, 붐 길이가 43미터로, 작업 거리가 20미터로 표시되어 있다. 여기서, 작업 각도가 줄어들면 리프팅 무게가 줄어들 수 있다. 따라서 작업 가 능한 최소 각도에서 초기 입력한 작업 중량 값을 들 수 있는지를 판단되고, 그 결과가 도출된다. 도 12b는 본 발명의 일 실시 예에 따른 단말의 크레인 제원의 UI 뷰이다. 도 12b를 참조하면, 도출된 작업 가능 크레인 중에서 특정 모델명, 예를 들어 LTM-1500을 선택한 때의 UI 뷰가 묘사되어 있다. 이 경우, 모드는 가이드로, 작업 거리는 12m, 무게 추는 80톤으로 작업 각도는 68도로 표시되며, 붐 길이와 작업 거리가 작업 중량 값에 따라 일정 범위 내에서 변동이 가능하다. 사용자 단말은 사용자에 의해 입력된 작업에 적합한 제원을, 제원표에서 차별된 색상을 이용하여 표현할 수 있 다. 도 13a는 본 발명의 일 실시 예에 따른 단말의 에러 코드 메뉴의 UI 뷰이다. 도 13a를 참조하면, 에러 코드를 입력하는 화면에 모델 선택과 코드 입력 란이 묘사되어 있다. 사용자는 모델 선택에서 에러 코드 해석을 위한 크레인의 모델명을 입력하고, 코드 입력에서 에러 코드를 입력할 수 있다. 에 러 코드는, 크레인의 전자제어기를 통해 감지된 고장 코드를 말한다. 도 13b는 본 발명의 일 실시 예에 따른 단말의 에러 코드의 해당 크레인 모델 선택의 UI 뷰이다. 도 13b를 참조하면, 크레인 모델 명을 선택할 수 있는 메뉴가 묘사되어 있다. 도 14a는 본 발명의 일 실시 예에 따른 단말의 에러 코드 입력의 UI 뷰이다. 도 14a를 참조하면, 에러 코드가 발생한 크레인의 구체적인 모델 명이 입력되어 있고, 그 아래에는 에러 코드가 입력란이 표시되어 있다. 그리고 그 아래에는 크레인 모델 명, LTM-1750에서 발생될 수 있는 에러 코드의 예가 표시되어 있다. 사용자는 예시적으로 표시되는 에러 코드들 중에서 하나를 선택해서 에러 코드를 입력할 수 있 다. 여기서, 예시적으로 표시되는 에러 코드들은, 과거 사용자들의 입력을 학습해서 가장 많은 빈도를 보이는 에러 코드 순으로 나열될 수 있다. 도 14b는 본 발명의 일 실시 예에 따른 단말의 에러 코드 출력의 UI 뷰이다. 도 14b를 참조하면, 에러 코드가 입력되어 있고, 에러 코드를 분석한 솔루션이 묘사되어 있다. 에러 코드 분석 결과가 사용자 단말을 통해 표시된 후에, 에러 코드 분석 결과에 따라 사용자는 자신이 직 접 에러에 대응할 것인지 아니면, 정비사를 호출할 것이지 정할 수 있다. 직접 에러에 대응하려는 경우에, 사용자는 정비 챗봇을 통해 에러 코드 및 장비 운영에 관한 전반적인 질문을 하고 해답을 구할 수 있다. 정비사 호출이 필요한 경우, 사용자의 위치에서 가장 가까운 정비사가 호출될 수 있다. 또한, 정비사에 대한 프 로파일, 예를 들어, 이름, 위치, 작업 가능시간, 전문영역 등에 관한 정보가 데이터베이스화 되어 있어서 사용 자는 이를 참고로 정비사를 검출할 수 있다. 정비사가 정해진 경우에도, 에러 코드 및 분석 내용이 정비사의 사용자 단말에 전송되도록 할 수 있다. 정비사 는 자신의 사용자 단말을 통해 에러 코드 및 그 결과를 검토한 후에 의견을 사용자 단말에 전송할 수 있다. 정비사의 호출은 사용자와 정비사의 합의에 따라 이루어진다. 에러 코드 분석과 함께 에러와 관련된 도면 해독에 도움이 될 수 있도록 해석된 도면 넘버 등이 사용자 단말 에 제공될 수 있다. 특히, 건설 장비, 크레인 메이커가 제공하는 에러 코드 해석에 관한 도면 해석을 위한 정보가 제공될 수 있다.도 15는 본 발명의 일 실시 예에 따른 챗봇을 통해 정비 정보를 제공하는 단계의 흐름도이다. 도 15를 참조하면, 챗봇을 통해 정비 정보를 제공하는 단계는 S210 내지 S220 단계를 포함하도록 구성될 수 있 다. 먼저, 사용자 입력에 따라 질의 내용이 입력되고, 입력된 내용은 질의 데이터 형태로 자연어 처리 모듈로 전송 된다. 사용자 단말은 자연어 처리 모듈을 통해 전송 받은 질의 데이터에서 의미론적 분석을 수행한다. 의미 론적 분석을 통해 질의 데이터는 기계, 즉 컴퓨터가 이해할 수 있는 키워드 기반의 데이터로 변환된다(S210). 다음으로 사용자 단말은 실시간 데이터가 존재하는지 여부를 판단한다(S220). 만약에 챗봇 DB로 넘어오지 않은 실시간 데이터에 존재하는 경우, 사용자 단말은 실시간 채팅 DB 검색 모듈을 통해 실시간 데이 터에 대해서 검색 시점에 검색을 수행하고 해당 키워드에 부합하는 정보가 존재하는 경우 이를 검색하고, 정보 를 추가한다(S230). 다음으로 사용자 단말은 정비 정보 관리 모듈을 통해 질의에 대한 응답으로 키워드에 맞는 데이터를 추출한다(S240). 다음으로 사용자 단말은 병렬형 키워드 자연어 처리 모듈을 통해 추출된 데이터를 자연어로 변환한다 (S250). 도 16은 본 발명의 일 실시 예에 따른 기계학습 방법의 흐름도이다. 도 16을 참조하면, 기계학습 방법은 S310 및 S320 단계를 포함하도록 구성될 수 있다. 정비 챗봇 모듈은 자연어 처리 모듈에서 들어온 키워드 기반의 데이터를 분류 정제하여 기계학습이 가능하도록 데이터를 처리한다(S310). 또한, 정비 챗봇 모듈은 자연어 처리 모듈에서 변환된 키워드 기반의 데이터를 입력 받아 기계 학습 을 수행하여 정비 정보 질의에 대한 답변을 학습한다(S320). 정비 챗봇을 이용하여 건설 장비의 정비에 관한 정보를 제공하는 단계에는 데이터 마이닝 단계 및 학습 단계 외 에 기계학습 모델을 생성하는 단계, 기계학습 모델을 평가하는 단계 등이 더 포함될 수 있다. 정비 챗봇에서 이용되는 정비 데이터베이스는 기계학습(machine learning)을 통해 사용자 사이의 대화에서 추출 된 데이터를 이용하여 업데이트 될 수 있다. 이를 위해 정비 챗본 외에 사용자 간의 실시간 채팅방이 제공될 수 있다. 채팅에서 양질의 데이터가 수집되는 경우, 이를 제공한 사용자에게는 금전적인 보상이 따를 수 있는데, 이를 실 행하기 위한 단계는 다음과 같다. 제1 단계에서 가이드라인을 설정한다. 정비와 관련된 QnA에 관한 내용, 즉 에러 코드 명칭, 고장의 증상, 고장 의 원인, 해결 방법과 관련된 각종 키워드가 정의 될 수 있다. 제2 단계에서 대화자 사이의 대화 내용에서 키워드가 포함되어 있는지 여부를 판단한다. 제3 단계에서 가이드라인에서 지정된 키워드가 대화 내용 중에 있는 경우에 해당 대화 내용을 챗봇으로 업로드 한다. 제4 단계에서 키워드를 기반으로 양질의 데이터를 체계화하여 정비 데이터베이스에 저장한다. 제5 단계에서 양질의 데이터에 해당하는 채팅을 수행한 사용자에게 보상을 제공한다. 본 발명의 일 실시 예에 따른 정보제공 방법은 사용자 단말 및 컴퓨터에서 실행될 수 있는 소프트웨어 형태, 즉 건설 장비 운영 애플리케이션 모듈로 구현될 수 있다. 본 발명의 일 실시 예에 따른 건설 장비 운영 애플리케이션 모듈은 비-일시적인 컴퓨터 판독가능 저장 매체에 저장될 수 있다. 또한, 본 발명의 일 실시 에에 따른 컴퓨터프로그램인, 건설 장비 운영 애플리케이션 모듈은, 건설 장비 운영에 관한 정보를 제공하는 방법에 관한 인스트럭션들로서, 컴퓨팅 장치에 의해 실행되었을 때, 건설 장비 운영에 관 한 리깅 플랜(rigging plan) 단계; 및 상기 건설 장비의 유지 및 보수에 필요한 정비에 관한 정보를 제공하는단계 중에서 적어도 하나를 포함하고, 상기 리깅 플랜 단계는, 작업 조건 값의 입력 데이터를 작업 제원 및 리 깅 플랜 구성에 필요한 데이터로 변환하는 단계; 변환된 데이터를 데이터베이스에 저장된 제원 데이터와 비교하 여 가능한 작업 제원을 검출하는 단계; 및 검출된 작업 제원을 이용하여 리깅 플랜을 구성하는 단계를 포함하는 방법을 수행하도록 연산되는 저장된 인스트럭션들을 갖는다. 이와 같이, 본 발명의 다양한 실시 예에 의하면, 모바일 단말을 통해 작업 현장에서 크레인 리깅 플랜에 관한 정보 및 시뮬레이션 결과를 확인할 수 있다. 또한, 인공지능을 이용하는 정비 챗봇을 통해 건설 장비의 정비에 관한 정보를 실시간으로 제공할 수 있다. 또한, 현장 계측 없이도 건물 주소 입력, 지도 정보를 이용하여 리깅 플랜에 필요한 입체 모형을 구성할 수 있 다."}
{"patent_id": "10-2019-0045719", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼의 예시도이다. 도 2는 리깅 플랜을 설명하기 위한 예시도이다. 도 3은 본 발명의 일 실시 예에 따른 건설 장비 운영에 관한 정보를 제공하는 플랫폼에 접속하여 정보제공 서비 스를 이용하기 위한 단말의 블록도이다. 도 4는 본 발명의 일 실시 예에 따른 단말 제어부의 블록도이다. 도 5는 본 발명의 일 실시 예에 따른 리깅 모듈의 블록도이다. 도 6은 본 발명의 일 실시 예에 따른 정비 챗봇 모듈의 블록도이다. 도 7은 본 발명의 일 실시 예에 따른 멀티 미터 모듈의 블록도이다. 도 8은 컴퓨팅 장치에 해당하는 사용자 단말 및 서버의 블록도이다. 도 9는 본 발명의 일 실시 예에 따른 리깅 플랜 단계의 흐름도이다. 도 10a 내지 도 10d는 크레인 모드를 설명하기 위한 예시도이다. 도 11a는 본 발명의 일 실시 예에 따른 단말의 작업 조건 입력의 UI 뷰이다. 도 11b는 본 발명의 일 실시 예에 따른 단말의 작업 가능한 크레인의 UI 뷰이다. 도 12a는 본 발명의 일 실시 예에 따른 단말의 2D 도면의 UI 뷰이다. 도 12b는 본 발명의 일 실시 예에 따른 단말의 크레인 제원의 UI 뷰이다. 도 13a는 본 발명의 일 실시 예에 따른 단말의 에러 코드 메뉴의 UI 뷰이다. 도 13b는 본 발명의 일 실시 예에 따른 단말의 에러 코드의 해당 크레인 모델 선택의 UI 뷰이다. 도 14a는 본 발명의 일 실시 예에 따른 단말의 에러 코드 입력의 UI 뷰이다. 도 14b는 본 발명의 일 실시 예에 따른 단말의 에러 코드 출력의 UI 뷰이다. 도 15는 본 발명의 일 실시 예에 따른 챗봇을 통해 정비 정보를 제공하는 단계의 흐름도이다. 도 16은 본 발명의 일 실시 예에 따른 기계학습 방법의 흐름도이다."}
