{"patent_id": "10-2022-0137531", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057152", "출원번호": "10-2022-0137531", "발명의 명칭": "인공 지능 기반 코딩 자동화 서비스 제공 시스템 및 방법", "출원인": "주식회사 엠오브에스", "발명자": "최형식"}}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능 기반 코딩 자동화 서비스 제공 시스템으로서,사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보를 분석하고 상기 요구 사항 정보에기초하여 매칭되는 코드를 검색하는 관리 서버; 및상기 관리 서버로부터 전송되는 AI 기반 코드 요청 신호에 기초하여 AI 기반 코드를 생성하는 AI 모델을 포함하고,상기 관리 서버는, 상기 요구 사항 정보에 매칭되는 코드가 존재하는 경우, 매칭되는 코드를 사용자 단말기로전송하고, 매칭되는 코드가 검색되지 않는 경우, AI 모델로 AI 기반 코드 요청 신호를 전송하고, 상기 AI 모델에서 생성된 AI 기반 코드를 수신하여 사용자 단말기로 전송하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 관리 서버는, 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보를 분석하는 요구 사항 정보 분석부;상기 요구 사항 정보에 기초하여 매칭되는 코드를 데이터베이스에서 검색하고, 매칭되는 코드가 존재하는 경우매칭된 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 존재하지 않는 경우 AI 모델 연동부로 AI 기반 코드요청 신호를 전송하는 코드 검색부; 및상기 코드 검색부에서 전달된 AI 기반 코드 요청 신호를 AI 모델로 전송하고, AI 모델로부터 전송되는 AI 기반코드를 사용자 단말기로 전송하는 AI 모델 연동부를 포함하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 요구 사항 정보는, 기능 정보, 언어 정보, 구현 함수명 정보, 함수 반환값 정보 및 유저 설명 정보를 포함하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 AI 모델은, 학습 데이터를 수신하여 전처리부로 전달하여 전처리를 거친 학습 데이터가 코드 생성 모델로입력되어 딥러닝에 기반한 학습이 이루어지도록 하는 학습 수행부;학습 데이터 또는 요구 사항 정보를 수신하여 코드 생성 모델에 입력하기에 적절한 데이터로 변환하는 전처리과정을 수행하는 전처리부; 및학습 데이터에 의해 딥러닝에 기반한 학습을 수행하고, 전처리부를 거쳐 전달된 요구 사항 정보에 기초하여 AI기반 코드를 생성하는 코드 생성 모델공개특허 10-2024-0057152-3-을 포함하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서,상기 코드 검색부는, 요구 사항 정보 중에서 기능 정보에 가장 높은 가중치를 부여하고, 나머지 정보들에 대해서는 각각 미리 설정된 가중치를 부여하여 계산되는 가중치의 합에 의해 매칭되는 코드를 검색하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 학습 데이터는, 요구 카테고리 정보, 요구 사항명 정보, 요구 사항 유저 스토리 정보, 구현 언어 정보, 구현 함수명 정보, 함수 반환값 정보, 함수 내용 정보, 실제 코드 정보 및 함수 평가 정보로 구성된 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 관리 서버는, 상기 요구 사항 정보에 매칭되는 코드가 존재하는 경우에도 AI 모델로 AI 기반 코드 요청 신호를 전송하고, 상기 AI 모델에서 생성된 AI 기반 코드를 수신하고, 매칭된 코드와 함께 AI 기반 코드를 모두사용자 단말기로 전송하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템."}
{"patent_id": "10-2022-0137531", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "인공 지능 기반 코딩 자동화 서비스 제공 시스템에서 코딩 자동화 서비스를 제공하는 방법으로서,사용자 단말기로부터 코드 요청 신호를 수신하는 제1 단계;상기 코드 요청 신호에 기초하여 요구 사항 정보를 분석하는 제2 단계;상기 요구 사항 정보에 기초하여 매칭되는 코드를 검색하는 제3 단계;매칭되는 코드가 존재하는 경우, 매칭되는 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 검색되지 않는경우, AI 모델로 AI 기반 코드 요청 신호를 전송하는 제4 단계;AI 모델에서 생성된 AI 기반 코드를 수신하여 사용자 단말기로 전송하는 제5 단계를 포함하는 인공 지능 기반 코딩 자동화 서비스 제공 방법."}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보를 분석하고 상기 요구 사 항 정보에 기초하여 매칭되는 코드를 검색하는 관리 서버; 및 상기 관리 서버로부터 전송되는 AI 기반 코드 요청 신호에 기초하여 AI 기반 코드를 생성하는 AI 모델을 포함하고, 상기 관리 서버는, 상기 요구 사항 정보에 매칭 되는 코드가 존재하는 경우, 매칭되는 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 검색되지 않는 경우, AI 모델로 AI 기반 코드 요청 신호를 전송하고, 상기 AI 모델에서 생성된 AI 기반 코드를 수신하여 사용자 단말 기로 전송하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템을 제공한다."}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 지능 기반 코딩 자동화 서비스 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래 소프트웨어의 개발 과정은 고객의 요구 사항을 파악하여 이에 상응하는 기능을 프로그래머(개발자)가 특정 언어를 사용하여 구현하는 것이 일반적이다. 이 때, 고객의 요구 사항에 기초하여 프로그래밍을 하게 되지만, 고객의 비즈니스의 성격에 종속되어 유사한 코드 스타일을 필요로 하는 경우가 많이 발생한다.그러나, 현재 많은 프로그래머들이 단순 복사 및 붙여넣기(copy & paste)를 통해서 해당 소스를 재사용하고 있 어, 개발 생산성 향상에 도움을 주지 못하고 있다는 한계가 있다. 한편, 최근 인공 지능(Aritificial Intelligence, AI)의 급속한 보급에 따라 다양한 분야에서 인공 지능을 이용 하여 서비스가 제공되고 있다. 이러한 인공 지능에 기반하여 고객의 요구 사항에 부합하는 최적화된 코딩 자동 화 서비스의 개발이 요망되지만 아직까지는 개별 프로그래머들의 숙련도에 의존하고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 10-2020-0034415호(2020.03.31.공개)"}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 바와 같은 과제를 해결하기 위하여 본 발명은, 소프트웨어 개발시 반복되고 재사용이 가능한 기능 및 코 드를 인공 지능을 통해서 생성함으로써 고객의 기능적 요구 사항을 만족시킬 수 있는 최적의 코드를 제공할 수 있는 시스템 및 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 코드 스타일 및 코드 템플릿을 제공함으로써 개발 생산성 향상과 코드 품질을 향상시킬 수 있 는 시스템 및 방법을 제공하는 것을 또 다른 목적으로 한다."}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 과제를 해결하기 위하여 본 발명은, 인공 지능 기반 코딩 자동화 서비스 제공 시스템으로서, 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보를 분석하고 상기 요구 사항 정보에 기초하여 매칭되는 코드를 검색하는 관리 서버; 및 상기 관리 서버로부터 전송되는 AI 기반 코드 요청 신호에 기초하여 AI 기반 코드를 생성하는 AI 모델을 포함하고, 상기 관리 서버는, 상기 요구 사항 정보에 매칭되는 코 드가 존재하는 경우, 매칭되는 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 검색되지 않는 경우, AI 모 델로 AI 기반 코드 요청 신호를 전송하고, 상기 AI 모델에서 생성된 AI 기반 코드를 수신하여 사용자 단말기로 전송하는 것을 특징으로 하는 인공 지능 기반 코딩 자동화 서비스 제공 시스템을 제공한다. 여기에서, 상기 관리 서버는, 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보를 분석 하는 요구 사항 정보 분석부; 상기 요구 사항 정보에 기초하여 매칭되는 코드를 데이터베이스에서 검색하고, 매 칭되는 코드가 존재하는 경우 매칭된 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 존재하지 않는 경우 AI 모델 연동부로 AI 기반 코드 요청 신호를 전송하는 코드 검색부; 및 상기 코드 검색부에서 전달된 AI 기반 코드 요청 신호를 AI 모델로 전송하고, AI 모델로부터 전송되는 AI 기반 코드를 사용자 단말기로 전송하는 AI 모델 연동부를 포함할 수 있다. 또한, 상기 요구 사항 정보는, 기능 정보, 언어 정보, 구현 함수명 정보, 함수 반환값 정보 및 유저 설명 정보 를 포함할 수 있다. 또한, 상기 AI 모델은, 학습 데이터를 수신하여 전처리부로 전달하여 전처리를 거친 학습 데이터가 코드 생성 모델로 입력되어 딥러닝에 기반한 학습이 이루어지도록 하는 학습 수행부; 학습 데이터 또는 요구 사항 정보를 수신하여 코드 생성 모델에 입력하기에 적절한 데이터로 변환하는 전처리 과정을 수행하는 전처리부; 및 학습 데이터에 의해 딥러닝에 기반한 학습을 수행하고, 전처리부를 거쳐 전달된 요구 사항 정보에 기초하여 AI 기반 코드를 생성하는 코드 생성 모델을 포함할 수 있다. 또한, 상기 코드 검색부는, 요구 사항 정보 중에서 기능 정보에 가장 높은 가중치를 부여하고, 나머지 정보들에 대해서는 각각 미리 설정된 가중치를 부여하여 계산되는 가중치의 합에 의해 매칭되는 코드를 검색할 수 있다.또한, 상기 학습 데이터는, 요구 카테고리 정보, 요구 사항명 정보, 요구 사항 유저 스토리 정보, 구현 언어 정 보, 구현 함수명 정보, 함수 반환값 정보, 함수 내용 정보, 실제 코드 정보 및 함수 평가 정보로 구성될 수 있 다. 또한, 상기 관리 서버는, 상기 요구 사항 정보에 매칭되는 코드가 존재하는 경우에도 AI 모델로 AI 기반 코드 요청 신호를 전송하고, 상기 AI 모델에서 생성된 AI 기반 코드를 수신하고, 매칭된 코드와 함께 AI 기반 코드를 모두 사용자 단말기로 전송할 수 있다. 본 발명의 다른 측면에 의하면, 사용자 단말기로부터 코드 요청 신호를 수신하는 제1 단계; 상기 코드 요청 신 호에 기초하여 요구 사항 정보를 분석하는 제2 단계; 상기 요구 사항 정보에 기초하여 매칭되는 코드를 검색하 는 제3 단계; 매칭되는 코드가 존재하는 경우, 매칭되는 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 검 색되지 않는 경우, AI 모델로 AI 기반 코드 요청 신호를 전송하는 제4 단계; AI 모델에서 생성된 AI 기반 코드 를 수신하여 사용자 단말기로 전송하는 제5 단계를 포함하는 인공 지능 기반 코딩 자동화 서비스 제공 방법을 제공한다."}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 소프트웨어 개발시 반복되고 재사용이 가능한 기능 및 코드를 인공 지능을 통해서 생성함으 로써 고객의 기능적 요구 사항을 만족시킬 수 있는 최적의 코드를 제공할 수 있는 시스템 및 방법을 제공할 수 있다. 또한, 본 발명은 코드 스타일 및 코드 템플릿을 제공함으로써 개발 생산성 향상과 코드 품질을 향상시킬 수 있 는 시스템 및 방법을 제공할 수 있다."}
{"patent_id": "10-2022-0137531", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면을 참조하여 본 발명에 의한 실시예를 상세하게 설명하기로 한다. 도 1은 본 발명의 일실시예에 의한 인공 지능 기반 코딩 자동화 서비스 제공 시스템(100, 이하 간단히 \"시스템 \"이라 한다)의 전체적인 구성 및 연결 관계를 나타낸 도면이다. 도 1을 참조하면, 시스템은, 관리 서버 및 AI 모델을 포함한다. 시스템은 네트워크를 통해 사용자 단말기와 결합하며, 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 최적화된 코드 를 사용자 단말기로 제공하는 것을 특징으로 한다. 또한, 시스템은 본 발명에서 사용되는 각종 데이터를 저장하는 데이터베이스를 포함한다. 관리 서버는 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보를 분석하고 상 기 요구 사항 정보에 기초하여 매칭되는 코드를 검색하는 기능을 수행한다. 또한, 관리 서버는, 상기 요구 사항 정보에 매칭되는 코드가 존재하는 경우, 매칭되는 코드를 사용자 단말 기로 전송하고, 매칭되는 코드가 검색되지 않는 경우, AI 모델로 AI 기반 코드 요청 신호를 전송하고,상기 AI 모델에서 생성된 AI 기반 코드를 수신하여 사용자 단말기로 전송한다. AI 모델은, 관리 서버로부터 전송되는 AI 기반 코드 요청 신호에 기초하여 AI 기반 코드를 생성하는 기 능을 수행한다. 도 2는 도 1의 시스템에 의해 수행되는 인공 지능 기반 코딩 자동화 서비스 제공 방법의 일실시예를 나타 낸 흐름도이다. 도 2를 참조하면, 우선 사용자 단말기로부터 코드 요청 신호가 시스템의 관리 서버로 전송된다 (S100). 여기에서, 코드 요청 신호는, 사용자 단말기를 통해 사용자가 구현하고자 하는 코드를 요청하기 위한 신호 로서, 예컨대 \"소셜 로그인 기능을 구현해 주세요\", \"로그인 기능\", \"JavaScript로 로그인 기능을 구현해 주세 요\" 등과 같이 사용자가 사용자 단말기를 통해 입력할 수 있다. 코드 요청 신호를 수신한 관리 서버는, 코드 요청 신호에 기초하여 요구 사항 정보를 분석한다(S110). 요구 사항 정보는, 코드 요청 신호에 포함된 정보를 AI 기반 요구 사항 분석 모델에 의해 분석함으로써 얻을 수 있다. AI 기반 요구 사항 분석 모델은 자연어로 입력된 사용자 입력 정보인 코드 요청 신호에 포함된 정보로부 터 미리 학습된 AI 모델에 의해 요구 사항 정보를 출력한다. 이러한 AI 기반 요구 사항 분석 모델 자체는 본 발 명의 직접적인 목적이 아니며 종래 기술에 의해 알려져 있는 것을 사용할 수 있으므로 상세 설명은 생략한다. 도 3은 요구 사항 정보의 일예를 나타낸 것이다. 요구 사항 정보는, 도 3에 나타난 바와 같이, 기능 정보, 언어 정보, 구현 함수명 정보, 함수 반환값 정보 및 유저 설명 정보를 포함할 수 있으며, 이는 전술한 바와 같이, 사용자 단말기로부터 전송된 코드 요청 신호 에 포함된 정보로부터 AI 기반 요구 사항 분석 모델에 의해 출력된다. 기능 정보는, 예컨대, 로그인 기능, 결제 기능, 회원 가입 기능, 회원 정보 관리 기능, 주문 기능, 게시판 기능 등과 같이 사용자가 코드로서 구현하고자 하는 동작을 나타내는 정보이다. 도 3에서는, 사용자가 구현하고자 하 는 코드의 기능 정보가 \"로그인 기능\"임을 나타내고 있다. 언어 정보는, 기능 정보에 상응하는 기능을 구현하는 코드의 언어(language)를 나타내는 정보이며, 도 3에서는 \"JavaScript\"로 나타나 있음을 알 수 있다. 또한, 구현 함수명 정보는, 기능 정보에 상응하는 기능이 구현된 코드가 함수로 표현되므로, 해당 함수의 이름 을 나타내는 정보이다. 도 3에서는, 구현 함수명 정보는 \"Login\"임을 알 수 있다. 또한, 함수 반환값 정보는, 구현 함수명 정보에 상응하는 함수의 실행 결과에 의해 반환되는 결과값을 나타내며, 유저 설명 정보는 사용자가 원하는 코드의 구현과 관련하여 사용자가 원하는 스토리 정보나 설명 정 보를 나타낸다. 본 발명의 요구 사항 정보에는, 기능 정보는 필수적으로 포함되어야 하지만, 다른 정보들은 생략하거나 일부만 이 포함될 수 있다. 다음으로, 관리 서버는, 요구 사항 정보에 기초하여 매칭되는 코드를 데이터베이스에서 검색한다 (S120). 이는 요구 사항 정보 중에서 기능 정보를 최우선 순위로 하여 가장 높은 가중치를 부여하고, 나머지 정보들에 대해서는 각각 미리 설정된 가중치를 부여하고, 계산되는 가중치의 합에 의해 계산하는 방식에 의해 이루어질 수 있다. 또한, 매칭되는 코드는 가중치의 합을 순서대로 배열한 복수개일 수 있다. 관리 서버는, 상기 단계(S120)에서 매칭되는 코드가 존재하는 경우 매칭된 코드를 사용자 단말기로 전 송한다(S140). 이 경우, 복수개의 코드가 매칭되는 경우, 복수개의 코드를 전부 사용자 단말기로 전송하도 록 할 수도 있다. 예컨대, 사용자가 로그인 기능을 원하는 경우, 사용자 단말기로 전송되는 코드는 다음과 같을 수 있다. \"{ type: \"로그인\", logic: \"Int login( ) {1) DB 접속 2) 유저 비교 3) 패스워드 비교 4) 결과 리턴}\" } 상기 코드는 기능 정보에 대해 미리 설정된 연관 관계에 따라 해당 기능을 구현하기 위한 핵심 로직을 포함한다. 한편, 매칭되는 코드가 검색되지 않는 경우(S130), 관리 서버는 AI 모델로 AI 기반 코드 요청 신호를 전송한다(S150). 여기에서, AI 기반 코드 요청 신호는, 전술한 바와 같은 요구 사항 정보를 포함할 수 있으며, 요구 사항 정보 중 적어도 기능 정보는 포함한다. AI 모델은 수신된 AI 기반 코드 요청 신호에 기초하여, AI 기반 코드를 생성한다(S160). 즉, AI 모델은 AI 기반 코드 요청 신호에 포함된 요구 사항 정보를 입력으로 하여, 해당 요구 사항 정보에 상응하는 최적의 코드를 생성하여 출력한다. AI 모델은 최적의 코드를 생성하여 출력할 수 있도록 사전에 학습되어 있다. 도 4는 AI 모델의 학습에 사용되는 학습 데이터의 일예를 나타낸 것이다. 도 4를 참조하면, 학습 데이터는, 요구 카테고리 정보, 요구 사항명 정보, 요구 사항 유저 스토리 정보, 구현 언어 정보, 구현 함수명 정보, 함수 반환값 정보, 함수 내용 정보, 실제 코드 정보 및 함수 평가 정보를 포함할 수 있다. 또한, 각 학습 데이터의 식별자 정보를 더 포함할 수 있다. AI 모델은 이러한 학습 데이터를 사용하여 사전에 학습되어 있으며, 요구 사항 정보를 입력으로 하여 최적 의 코드를 생성하여 출력한다. AI 모델이 코드를 생성하는 방법 자체는 본 발명의 직접적인 목적이 아니며, 예컨대 종래 기술로 알려져 있는 GPT(Generative Pre-trained Transformer)와 같은 딥러닝을 이용해 문장(텍스 트)를 생성하는 자기회귀 언어 모델을 사용할 수 있으므로, 이에 대해서는 상세 설명은 생략한다. AI 기반 코드가 생성되면, AI 모델은 관리 서버로 생성된 AI 기반 코드를 전송하고(S170), 관리 서버 는 수신된 AI 기반 코드를 다시 사용자 단말기로 전송한다(S180). 한편, 상기 실시예에서는, 단계(S130)에서 관리 서버는 매칭되는 코드가 존재하지 않는 경우 AI 모델로 코드를 요청하는 것으로 설명하였으나, 매칭되는 코드가 존재하는 경우에도 AI 모델로 코드를 요청하도록 할 수도 있다. 이러한 경우, 관리 서버는 검색된 코드와 함께 AI 모델에서 생성된 코드를 모두 사용자 단말기로 전송할 수 있다. 도 5는 관리 서버의 구성을 나타낸 도면이다. 도 2를 참조하면, 관리 서버는, 요구 사항 정보 분석부, 코드 검색부 및 AI 모델 연동부를 포 함한다. 요구 사항 정보 분석부는, 사용자 단말기로부터 전송되는 코드 요청 신호에 기초하여 요구 사항 정보 를 분석하는 기능을 수행한다. 코드 검색부는 요구 사항 정보에 기초하여 매칭되는 코드를 데이터베이스에서 검색하고, 매칭되는 코드 가 존재하는 경우 매칭된 코드를 사용자 단말기로 전송하고, 매칭되는 코드가 존재하지 않는 경우 AI 모델 연동부로 AI 기반 코드 요청 신호를 전송한다. AI 모델 연동부는 코드 검색부에서 전달된 AI 기반 코드 요청 신호를 AI 모델로 전송하고, AI 모델 로부터 전송되는 AI 기반 코드를 사용자 단말기로 전송하는 기능을 수행한다. 도 6은 AI 모델의 구성을 나타낸 도면이다. 도 6을 참조하면, AI 모델은 학습 수행부, 전처리부 및 코드 생성 모델을 포함한다. 학습 수행부는 학습 데이터를 수신하여 전처리부로 전달하여 전처리를 거친 학습 데이터가 코드 생성 모델로 입력되어 딥러닝에 기반한 학습이 이루어지도록 하는 기능을 수행한다. 전처리부는 학습 데이터 또는 AI 기반 코드 요청 신호 및 요구 사항 정보를 수신하여 코드 생성 모델에 입력하기에 적절한 데이터로 변환하는 전처리 과정을 수행한다. 전처리 과정 자체는 종래 기술에 의해 잘 알려 져 있는 것이고 보 발명의 직접적인 목적은 아니므로 상세 설명은 생략한다. 코드 생성 모델은 전술한 바와 같은 학습 데이터에 의해 딥러닝에 기반한 학습을 수행하고, 전처리부를 거쳐 전달된 요구 사항 정보에 기초하여 최적의 AI 기반 코드를 생성하는 기능을 수행한다. 이는 전술한 바와 같이 예컨대 GPT 등과 같은 알고리듬을 사용할 수 있다. 코드 생성 모델에 의해 생성된 AI 기반 코드는 관 리 서버로 전달된다. 한편, 학습 데이터는 도 4에서와 같은 데이터를 사용할 수 있으며 이러한 학습 데이터는 시스템의 데이터 베이스로부터 얻을 수 있다. 또한, 학습 데이터는 웹에서 수집되는 코드에 의해 획득될 수도 있다. 이상에서 본 발명의 바람직한 실시예를 설명하였으나 본 발명은 상기 실시예에 한정되는 것이 아니며, 첨부한 청구범위 및 도면에 의해 파악되는 범위 내에서 다양한 수정 및 변형 실시가 가능함은 물론이다. 예컨대, 요구 사항 정보는, 관리 서버가 사용자 단말기로 요구 사항 정보를 입력할 수 있도록 하는 입 력 인터페이스를 제공하고, 사용자가 사용자 단말기 및 입력 인터페이스를 통해 원하는 요구 사항 정보를 입력하는 방법에 의해 획득되도록 할 수 있다. 또한, 기능 정보의 경우에는, 시스템에서 제공될 수 있는 가능한 복수개의 기능들을 제공하고, 사용자가 원하는 기능을 선택하도록 할 수 있다. 다른 정보들 또한 각각의 정보에 대해 가능한 정보들을 제공하고 사용자 가 선택하도록 하는 방법을 사용할 수 있음은 물론이다."}
{"patent_id": "10-2022-0137531", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 의한 인공 지능 기반 코딩 자동화 서비스 제공 시스템의 전체적인 구성 및 연결 관계를 나타낸 도면이다. 도 2는 도 1의 시스템에 의해 수행되는 인공 지능 기반 코딩 자동화 서비스 제공 방법의 일실시예를 나타 낸 흐름도이다. 도 3은 요구 사항 정보의 일예를 나타낸 것이다. 도 4는 AI 모델의 학습에 사용되는 학습 데이터의 일예를 나타낸 것이다. 도 5는 관리 서버의 구성을 나타낸 도면이다. 도 6은 AI 모델의 구성을 나타낸 도면이다."}
