{"patent_id": "10-2021-0019779", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0116667", "출원번호": "10-2021-0019779", "발명의 명칭": "인공지능고도화를 위한 학습데이터 정제방법 및 인공지능을 활용한 사람의 학습방법", "출원인": "우석대학교 산학협력단", "발명자": "이한규"}}
{"patent_id": "10-2021-0019779", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메타정보를 취합하는 메타정보취합단계; 및취합된 상기 메타정보를 기초로 인공지능학습데이터베이스를 구축 및 확장하는 인공지능학습데이터베이스 구축및 확장단계를 포함하고,상기 메타정보는 게임 현지화용 지문, 또는 드라마 지문으로부터 획득되는 것을 특징으로 하는 인공지능고도화를 위한 학습데이터 정제방법."}
{"patent_id": "10-2021-0019779", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 메타정보는 상기 지문 내의 캐릭터정보, 배경정보, 또는 대사정보를 포함하는 인공지능고도화를 위한 학습데이터 정제방법."}
{"patent_id": "10-2021-0019779", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "교육콘텐츠를 게시하고 게시된 상기 교육콘텐츠를 구매하는 교육콘텐츠게시 및 구매단계; 구매한 상기 교육콘텐츠를 기초로 학습게임을 제작하는 학습게임제작단계;제작된 상기 학습게임을 통해 학습하는 학습단계; 및상기 학습단계 이후 학업성취도를 관리하는 학업성취도관리단계를 포함하는 것을 특징으로 하는 인공지능을 활용한 사람의 학습방법."}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따른 인공지능고도화를 위한 학습데이터 정제방법은 메타정보를 취합하는 메타정보취합단계; 및 취 합된 상기 메타정보를 기초로 인공지능학습데이터베이스를 구축 및 확장하는 인공지능학습데이터베이스 구축 및 확장단계를 포함하고, 상기 메타정보는 게임 현지화용 지문, 또는 드라마 지문으로부터 획득되는 것을 특징으로 한다."}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 학습데이터 정제방법 및 사람의 학습방법에 관한 것으로서, 더욱 상세하게는 인공지능고도화를 위한 학습데이터 정제방법 및 인공지능을 활용한 사람의 학습방법에 관한 것이다."}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능이라는 개념은 1956년 미국 다트머스 대학에 있던 존 매카시 교수가 개최한 다트머스 회의에서 처음 등장했다. 특히 2015년 이후 신속하고 강력한 병렬 처리 성능을 제공하는 GPU의 도입으로 더욱 가속화되고 있죠. 갈수록 폭발적으로 늘어나고 있는 저장 용량과 이미지, 텍스트, 매핑 데이터 등 모든 영역의 데이터가 범 람하게 된 '빅데이터' 시대의 도래도 이러한 성장세에 큰 영향을 미쳤다. 1956년 당시 인공 지능의 선구자들이 꿈꾼 것은 최종적으로 인간의 지능과 유사한 특성을 가진 복잡한 컴퓨터를 제작하는 것이었죠. 이렇듯 인간의 감각, 사고력을 지닌 채 인간처럼 생각하는 인공 지능을 '일반 AI(General AI)'라고 하지만, 현재의 기술 발전 수준에서 만들 수 있는 인공지능은 '좁은 AI(Narrow AI)'의 개념에 포함된 다. 한편, 머신 러닝은 기본적으로 알고리즘을 이용해 데이터를 분석하고, 분석을 통해 학습하며, 학습한 내용을 기 반으로 판단이나 예측한다. 딥 러닝은 인공신경망에서 발전한 형태의 인공 지능으로, 뇌의 뉴런과 유사한 정보 입출력 계층을 활용해 데이 터를 학습한다.기존의 인공지능은 음역변조/음성선택 외 언어적 차별을 두지 못하는 문제가 있다. 한편, 대한민국 특허청 등록특허공보 제10-2187741호에는 아래와 같은 구성이 개시되어 있다. 일 실시예에 따른 메타데이터 크라우드 소싱 시스템은 비디오 데이터에서 장면 구간별로 이미지를 추출하고 각 이미지에 대한 메타데이터를 추출하여 저장 관리하는 비디오 메타데이터 태깅부; 상기 비디오 메타데이터 태깅 부에 저장된 이미지와 메타데이터를 가지고 문제를 생성하고 생성된 문제에 대한 답을 사용자로부터 입력받아 사용자의 신뢰도와 문제유형의 정확도를 계산하며, 이를 통해 메타데이터의 정확도를 누적 관리하며 그에 따라 메타데이터를 갱신하는 크라우드 소싱 처리부; 상기 크라우드 소싱 처리부에서 생성된 문제를 불특정 다수의 사 용자에게 제시하고 그에 대한 답을 입력받는 서비스 인터페이스 제공부; 및 상기 메타데이터 정확도에 따라 상 기 비디오 메타데이터 태깅부에 저장된 메타데이터를 갱신하고 최적화하는 메타데이터 학습모델 최적화부를 포 함한다. 비디오 메타데이터 태깅부는, 상기 비디오 데이터의 등록, 삭제 및 장면 단위의 비디오 구간 추출을 포함하는 미디어 관리 및 추출된 장면 구간별 이미지에서 객체인식, 배경인식, 얼굴인식 및 캡션생성을 포함하는 메타데 이터를 추출을 수행할 수 있다. 서비스 인터페이스 제공부는, 자바 스크립트로 구현되어 팝업 창을 통해 문제를 제시하고 답을 입력받을 수 있 고, 캐스캐이딩 스타일 시트(Cascading Style Sheet)로 사용자 인터페이스의 디자인이 제공될 수 있다. 사용자 신뢰도는 상기 제시된 문제에 대한 사용자 입력값 중 높은 신뢰도의 메타데이터의 선택정도에 기초하여 결정되며, 문제유형 정확도는 사용자 입력값 중 낮은 신뢰도의 메타데이터의 선택정도에 기초하여 결정될 수 있 다. 메타데이터 정확도는 상기 사용자 신뢰도와 상기 문제유형 정확도에 기존에 누적된 정답의 갯수와 해당 문제의 정답개수를 반영하여 계산될 수 있다. 또한, 학습모델 최적화부는, 전이학습 또는 액티브 러닝을 적용하여 상기 메타데이터를 최적화할 수 있다. 한편 다른 실시예에 따른 메타데이터 크라우드 소싱 방법은, 비디오 데이터에서 장면 구간별로 이미지를 추출하 고 각 이미지에 대한 메타데이터를 추출하여 저장 관리하는 비디오 메타데이터 태깅 단계; 상기 저장된 이미지 와 메타데이터를 가지고 문제를 생성하고 생성된 문제에 대한 답을 사용자로부터 입력받아 사용자의 신뢰도와 문제유형의 정확도를 계산하며, 이를 통해 메타데이터의 정확도를 누적 관리하며 그에 따라 메타데이터를 갱신 하는 크라우드 소싱 처리 단계; 및 상기 메타데이터 정확도에 따라 상기 저장된 메타데이터를 갱신하고 최적화 하는 메타데이터 학습모델 최적화 단계를 포함한다. 비디오 메타데이터 태깅 단계는, 상기 비디오 데이터의 등록, 삭제 및 장면 단위의 비디오 구간 추출을 포함하 는 미디어 관리 및 추출된 장면 구간별 이미지에서 객체인식, 배경인식, 얼굴인식 및 캡션생성을 포함하는 메타 데이터를 추출을 수행할 수 있다. 사용자 신뢰도는 상기 제시된 문제에 대한 사용자 입력값 중 높은 신뢰도의 메타데이터의 선택정도에 기초하여 결정되며, 문제유형 정확도는 사용자 입력값 중 낮은 신뢰도의 메타데이터의 선택정도에 기초하여 결정될 수 있 다. 메타데이터 정확도는 상기 사용자 신뢰도와 상기 문제유형 정확도에 기존에 누적된 정답의 갯수와 해당 문제의 정답개수를 반영하여 계산될 수 있다. 또한 학습모델 최적화 단계는, 전이학습 또는 액티브 러닝을 적용하여 상기 메타데이터를 최적화할 수 있다. 한편, 대한민국 특허청 등록특허공보 제10-2148392호에는 아래와 같은 구성이 개시되어 있다. 일 실시예에 따른 동영상 메타데이터 태깅 시스템은, 다수의 동영상 데이터에 대한 적어도 하나의 메타데이터를 저장하고 있는 통합 메타데이터 저장부, 상기 통합 메타데이터 저장부에 저장된 이미지 데이터에 대해 소정의 기계학습 알고리즘을 적용하여 이미지 데이터에 포함된 인물의 인식, 인물의 감정 인식, 인물의 행동 인식을 수 행하고, 이미지 데이터내의 객체, 배경, 소리 인식을 수행하며, 이미지 데이터에 관한 설명정보인 문장 정보를 생성하는 메타데이터 학습부, 동영상 콘텐츠 관리부로부터 읽어온 동영상 데이터에서 장면이 전환되는 구간에 대한 장면전환 정보와, 장면전환을 기준으로 나눈 각 구간별 프레임 이미지를 추출하여 구간별 대표 이미지를 선정하는 영상 구간 분리부, 및 상기 메타데이터 학습부의 학습 결과를 참조하고 소정의 기계학습 알고리즘을 적용하여, 상기 선정된 대표 이미지에서 인물, 인물에 대한 감정, 인물의 행동을 인식하고, 상기 대표 이미지내의 객체, 배경, 소리를 인식하며, 상기 대표 이미지를 설명하는 문장정보를 생성하여 이를 메타데이터로 하여 상기 통합 메타데이터 저장부에 저장하는 메타데이터 추출부를 포함할 수 있다. 그리고, 메타데이터 추출부에서 얻어진 메타데이터가 실제 메타데이터와 일치하는지 확인하고 수정하며 이를 검 증하도록 하는 사용자 인터페이스를 제공하는 메타데이터 검증부를 더 포함할 수 있다. 영상 구간 분리부는, 동영상 콘텐츠 관리부로부터 읽어온 동영상 데이터를 프레임 단위로 구분하고 이전 프레임 과 현재 프레임과의 픽셀값의 유사성을 비교하여 소정의 임계값 이상인 경우 장면이 전환된 것으로 판단할 수 있다. 한편, 다른 실시예에 따른 동영상 메타데이터 태깅 방법은, 다수의 동영상 데이터에 대해 소정의 기계학습 알고 리즘을 적용하여 동영상 데이터를 구성하는 이미지 데이터에 포함된 인물의 인식, 인물의 감정 인식, 인물의 행 동 인식을 수행하고, 이미지 데이터내의 객체, 배경, 소리 인식을 수행하며, 이미지 데이터에 관한 설명정보인 문장 정보를 생성하여 이를 메타데이터로 하여 저장하는 단계, 입력된 동영상 데이터에서 장면이 전환되는 구간 에 대한 장면전환 정보와, 장면전환을 기준으로 나눈 각 구간별 프레임 이미지를 추출하여 구간별 대표 이미지 를 선정하는 단계, 및 소정의 기계학습 알고리즘을 적용하여, 상기 선정된 대표 이미지에서 인물, 인물에 대한 감정, 인물의 행동을 인식하고, 상기 대표 이미지내의 객체, 배경, 소리를 인식하며, 상기 대표 이미지를 설명 하는 문장정보를 생성하여 이를 메타데이터로 만드는 단계를 포함할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 0001)대한민국 특허청 등록특허공보 제10-2187741호 (특허문헌 0002) 0002)대한민국 특허청 등록특허공보 제10-2148392호"}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 상기한 문제점을 일소하기 위해 창안한 것으로서, 메타정보를 취합하는 메타정보취합단계; 및 취합된 상기 메타정보를 기초로 인공지능학습데이터베이스를 구축 및 확장하는 인공지능학습데이터베이스 구축 및 확장단계를 포함하고, 상기 메타정보는 게임 현지화용 지문, 또는 드라마 지문으로부터 획득되는 것을 특징 으로 하는 인공지능고도화를 위한 학습데이터 정제방법에 주안점을 두고 그 기술적 과제로서 완성한 것이다. 이에 본 발명은 교육콘텐츠를 게시하고 게시된 상기 교육콘텐츠를 구매하는 교육콘텐츠게시 및 구매단계; 구매 한 상기 교육콘텐츠를 기초로 학습게임을 제작하는 학습게임제작단계; 제작된 상기 학습게임을 통해 학습하는 학습단계; 및 상기 학습단계 이후 학업성취도를 관리하는 학업성취도관리단계를 포함하는 것을 특징으로 하는 인공지능을 활용한 사람의 학습방법에 주안점을 두고 그 기술적 과제로서 완성한 것이다. 본 발명의 과제들은 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 일 실시예에 따른 인공지능고도화를 위한 학습데이터 정제방법은 메타정보를 취합하 는 메타정보취합단계; 및 취합된 상기 메타정보를 기초로 인공지능학습데이터베이스를 구축 및 확장하는 인공지 능학습데이터베이스 구축 및 확장단계를 포함하고, 상기 메타정보는 게임 현지화용 지문, 또는 드라마 지문으로 부터 획득되는 것을 특징으로 한다. 상기 메타정보는 상기 지문 내의 캐릭터정보, 배경정보, 또는 대사정보를 포함할 수 있다. 메타정보취합단계(S10)는 메타정보입력셀취합단계(S11), 영상-오디오물취합단계(S12), 콜퍼스(Corpus)취합단계 (S13), 및 직업별-분야별용어사전취합단계(S14)를 포함할 수 있다. 영상-오디오물취합단계(S12)는 STT(Speach to text)를 활용한 메타정보수집단계(S12a), 및 헤시태크를 활용한 메타정보수집단계(S12b)를 포함할 수 있다. 콜퍼스(Corpus)취합단계(S13)는 이름을 활용한 메타정보수집단계(S13a), 호칭을 활용한 메타정보수집단계 (S13b), 사용어휘 및 어휘패턴을 활용한 메타정보수집단계(S13c), 콜로케이션(Collocation)을 활용한 메타정보 수집단계(S13d), 및 콜러레이션(Correlation)을 활용한 메타정보수집단계(S13e)를 포함할 수 있다. 인공지능학습데이터베이스 구축 및 확장단계(S20)는 학습용지문데이터베이스구축단계(S21), 데이터베이스분석단 계(S22), 학습용지문선별단계(S23), 교사제안단계(S24), 분석데이터추출단계(S25), 신규학습용지문데이터베이스 구축단계(S26), 딥러닝인공지능재학습단계(S27), 및 인공지능무한개선단계(S28)를 포함할 수 있다. 학습용지문데이터베이스구축단계(S21)는 언어학습기에 입력된 지문을 활용한 데이터베이스구축단계(S21a), 게임 지문을 활용한 데이터베이스구축단계(S21b), 드라마-영화지문을 활용한 데이터베이스구축단계(S21c), 및 기타현 지화용지문을 활용한 데이터베이스구축단계(S21d)를 포함할 수 있다. 데이터베이스분석단계(S22)는 기존메타데이터기준분석단계(S22a), 콜퍼스분석에 따른 자체생산메타데이터기준단 계(S22b), 및 메타데이터정제단계(S22c)를 포함할 수 있다. 상기 다른 과제를 해결하기 위한 인공지능을 활용한 사람의 학습방법은 교육콘텐츠를 게시하고 게시된 상기 교 육콘텐츠를 구매하는 교육콘텐츠게시 및 구매단계; 구매한 상기 교육콘텐츠를 기초로 학습게임을 제작하는 학습 게임제작단계; 제작된 상기 학습게임을 통해 학습하는 학습단계; 및 상기 학습단계 이후 학업성취도를 관리하는 학업성취도관리단계를 포함한다. 학습게임제작단계(S200)는 게임방식선택단계(S210), 학습지문구성단계(S220), 게임요소선택단계(S230), 및 기타 설정단계(S240)를 포함할 수 있다. 학습단계(S300)는 콘텐츠구독설정 및 알림설정단계(S310), 학습과업게시단계(S320), 학습게임수행단계(S330), 수행결과물자동게시단계(S340), 그룹형 게임용골드로의 환산단계(S350), 및 단어장활용단계(S360)를 포함할 수 있다. 학업성취도관리단계(S400)는 학습자진도진행기록단계(S410), 및 게임요소관리단계(S420)를 포함할 수 있다. 기타 실시예의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 본 발명에 의하면 메타정보를 취합하는 메타정보취합단계; 및 취합된 상기 메타정보를 기초로 인공지능 학습데이터베이스를 구축 및 확장하는 인공지능학습데이터베이스 구축 및 확장단계를 포함하고, 상기 메타정보 는 게임 현지화용 지문, 또는 드라마 지문으로부터 획득되는 것을 특징으로 하는 인공지능고도화를 위한 학습데 이터 정제방법을 제공함으로써, 기존의 음역 변조/음성선택 외 언어적 차별을 두지 못하는 인공지능의 한계를 극복할 수 있다. 실시예들에 따른 효과는 이상에서 예시된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명세서 내에 포함되어 있다."}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부도면을 참고하여 본 발명의 구성 및 이로 인한 작용, 효과에 대해 일괄적으로 기술하기로 한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예를 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예에 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예는 본 발명의 개시가 완전하도록 하고, 본 발명이 속하 는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 그리고 명세서 전문에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한 다. 본 발명의 실시 예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이며, 후술되는 용어들은 본 발명의 실시 예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램인스트럭션들(실행 엔진)에 의해 수행 될 수도 있으며, 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능 들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능 하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들은 블록도의 각 블록 또는 흐 름도의 각 단계에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 그리고 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되 는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수 행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수 행하는 인스트럭션들은 블록도의 각 블록 및 흐름도의 각 단계에서 설명되는 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능들을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있으며, 몇 가지 대체 실시 예들에서는 블록들 또는 단 계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하며, 또한 그 블록들 또는 단 계들이 필요에 따라 해당하는 기능의 역순으로 수행되는 것도 가능하다. 이하, 첨부 도면을 참조하여 본 발명의 실시 예를 상세하게 설명한다. 그러나 다음에 예시하는 본 발명의 실시 예는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 다음에 상술하는 실시 예에 한정되는 것은 아"}
{"patent_id": "10-2021-0019779", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "니다. 본 발명의 실시 예는 이 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 본 발명을 보다 완전하 게 설명하기 위하여 제공된다. 본 실시예에 따른 일 실시예에 따른 인공지능(AI)고도화를 위한 학습데이터 정제방법은 메타정보를 취합하는 메 타정보취합단계(S10); 및 취합된 상기 메타정보를 기초로 인공지능학습데이터베이스를 구축 및 확장하는 인공지능학습데이터베이스 구축 및 확장단계(S20)를 포함할 수 있다. 메타정보취합단계(S10)는 메타정보입력셀취합단계(S11), 영상-오디오물취합단계(S12), 콜퍼스(Corpus)취합단계 (S13), 및 직업별-분야별용어사전취합단계(S14)를 포함할 수 있다. 영상-오디오물취합단계(S12)는 STT(Speach to text)를 활용한 메타정보수집단계(S12a), 및 헤시태크를 활용한 메타정보수집단계(S12b)를 포함할 수 있다. 콜퍼스(Corpus)취합단계(S13)는 이름을 활용한 메타정보수집단계(S13a), 호칭을 활용한 메타정보수집단계 (S13b), 사용어휘 및 어휘패턴을 활용한 메타정보수집단계(S13c), 콜로케이션(Collocation)을 활용한 메타정보 수집단계(S13d), 및 콜러레이션(Correlation)을 활용한 메타정보수집단계(S13e)를 포함할 수 있다. 인공지능학습데이터베이스 구축 및 확장단계(S20)는 학습용지문데이터베이스구축단계(S21), 데이터베이스분석단 계(S22), 학습용지문선별단계(S23), 교사제안단계(S24), 분석데이터추출단계(S25), 신규학습용지문데이터베이스 구축단계(S26), 딥러닝인공지능재학습단계(S27), 및 인공지능무한개선단계(S28)를 포함할 수 있다. 학습용지문데이터베이스구축단계(S21)는 언어학습기에 입력된 지문을 활용한 데이터베이스구축단계(S21a), 게임 지문을 활용한 데이터베이스구축단계(S21b), 드라마-영화지문을 활용한 데이터베이스구축단계(S21c), 및 기타현 지화용지문을 활용한 데이터베이스구축단계(S21d)를 포함할 수 있다. 데이터베이스분석단계(S22)는 기존메타데이터기준분석단계(S22a), 콜퍼스분석에 따른 자체생산메타데이터기준단 계(S22b), 및 메타데이터정제단계(S22c)를 포함할 수 있다. 도 1은 일 실시예에 따른 인공지능(AI)고도화를 위한 학습데이터 정제방법의 순서도이다. 기존의 인공지능은 음역변조/음성선택 외 언어적 차별을 두지 못하는 문제가 있었다. 더욱 상세하게, 현실에서 의 언어적 차별, 예컨대, 어조, 어휘, 또는 문장구성을 정확히 반영하지 못하는 문제가 있었다. 어조, 어휘, 또 는 문장구성은 성별(여성, 남성), 연령대(아동, 10대, 청장년, 노인), 또는 환경(교실, 회사, 친구, 집 등)에 따라 상이할 수 있다. 도 1을 참조하면, 일 실시예에 따른 인공지능(AI)고도화를 위한 학습데이터 정제방법은 메타정보를 취합하는 메 타정보취합단계(S10); 및 취합된 상기 메타정보를 기초로 인공지능학습데이터베이스를 구축 및 확장하는 인공지 능학습데이터베이스 구축 및 확장단계(S20)를 포함할 수 있다. 상기 메타정보는 예를 들어, 게임 현지화용 지문, 또는 드라마 지문 등으로부터 획득될 수 있다. 상기 게임 현지화용 지문, 또는 상기 드라마 지문에는 캐릭터 정보, 또는 배경정보를 포함하는 상기 메타정보를 포함할 수 있다. 상기 캐릭터 정보는 캐릭터 이름, 직업, 성별 등을 내포할 수 있다. 예를 들어, 상기 캐릭터 이름은 캐릭터의 성별정보를 내포할 수 있다. 예를 들어, 상기 직업은 캐릭터의 환경정보를 내포할 수 있다. 상기 배경정보는 예를 들어, 게임의 배경정보, 또는 드라마의 배경정보를 포함할 수 있다. 상기 게임의 배경정 보는 예를 들어, 대장간, 전장, 또는 사냥터를 포함할 수 있다. 상기 메타정보는 상기 지문의 캐릭터 대사의 어투, 어조, 단어사용, 또는 특정단어사용의 빈도수를 포함할 수도 있다. 도 2는 도 1의 메타정보취합단계의 구체적인 단계들을 보여주는 순서도이다. 도 1 및 도 2를 참조하면, 메타정보취합단계(S10)는 메타정보입력셀취합단계(S11), 영상-오디오물취합단계 (S12), 콜퍼스(Corpus)취합단계(S13), 및 직업별-분야별용어사전취합단계(S14)를 포함할 수 있다. 상기 메타정보입력셀취합단계(S11)는 상기 메타정보에 따라 보다 리얼한 목소리를 채택할 수 있다. 예를 들어, 구글 45개 목소리데이터를 활용하거나, 목소리 클로닝 기술을 활용할 수 있다. 도 3은 도 2의 영상-오디오물취합단계의 구체적인 단계들을 보여주는 순서도이다. 도 1 내지 도 3을 참조하면, 영상-오디오물취합단계(S12)는 STT(Speach to text)를 활용한 메타정보수집단계 (S12a), 및 헤시태크를 활용한 메타정보수집단계(S12b)를 포함할 수 있다. 예를 들어, STT(Speach to text)를 활용한 메타정보수집단계(S12a)는 드라마 영상을 기초로 인물분석, 또는 음성분석할 수 있다. 상기 인물분석은 안면분석을 통해 연령정보, 또는 성별정보를 취합할 수 있고, 상기 음성분석은 캐릭터의 성별정보를 취합할 수 있다. 도 4는 도 2의 콜퍼스(Corpus)취합단계의 구체적인 단계들을 보여주는 순서도이다. 도 2 및 도 4를 참조하면, 콜퍼스(Corpus)취합단계(S13)는 콜퍼스(Corpus) 내의 단어 연관성, 표현 연관성, 문 장 연관성, 콜로케이션, 및 콜러레이션을 추출하여 인공지능(AI)이 추출한 메타정보와 사람에 의해 제공된 메타 정보를 비교할 때, 그 일치율에 따라 각 항목별(예컨대, 단어 연관성, 표현 연관성, 문장 연관성, 콜로케이션, 및 콜러레이션) 가중치가 자동으로 보정될 수 있다. 이를 통해 인공지능이 반복적으로 학습을 계속함으로써, 일 치율이 높은 정확한 메타데이터(또는 메타정보)를 추출할 수 있다. 더욱 상세히 설명하면, 콜퍼스(Corpus)취합 단계(S13)는 이름을 활용한 메타정보수집단계(S13a), 호칭을 활용한 메타정보수집단계(S13b), 사용어휘 및 어휘 패턴을 활용한 메타정보수집단계(S13c), 콜로케이션(Collocation)을 활용한 메타정보수집단계(S13d), 및 콜러레 이션(Correlation)을 활용한 메타정보수집단계(S13e)를 포함할 수 있다. 직업별-분야별용어사전취합단계(S14)를 통해 캐릭터의 직업군별 및 분야별정보를 취합할 수 있다. 도 5는 도 1의 인공지능학습데이터베이스(DB)구축 및 확장단계의 구체적인 단계들을 보여주는 순서도이다. 도 1 및 도 5를 참조하면, 인공지능학습데이터베이스 구축 및 확장단계(S20)는 학습용지문데이터베이스구축단계 (S21), 데이터베이스분석단계(S22), 학습용지문선별단계(S23), 교사제안단계(S24), 분석데이터추출단계(S25), 신규학습용지문데이터베이스구축단계(S26), 딥러닝인공지능재학습단계(S27), 및 인공지능무한개선단계(S28)를 포함할 수 있다. 도 6은 도 5의 학습용지문데이터베이스구축단계의 구체적인 단계들을 보여주는 순서도이다. 도 5 및 도 6을 참조하면, 학습용지문데이터베이스구축단계(S21)는 언어학습기에 입력된 지문을 활용한 데이터 베이스구축단계(S21a), 게임지문을 활용한 데이터베이스구축단계(S21b), 드라마-영화지문을 활용한 데이터베이 스구축단계(S21c), 및 기타현지화용지문을 활용한 데이터베이스구축단계(S21d)를 포함할 수 있다. 언어학습기에 입력된 지문을 활용한 데이터베이스구축단계(S21a)는 예를 들어, 특정환경(예컨대, 사무실)에서 남과 여의 대화일 수 있다.게임지문을 활용한 데이터베이스구축단계(S21b)는 예를 들어, 게임 캐릭터 정보, 또는 게임씬(Scene) 정보 등일 수 있다. 드라마-영화지문을 활용한 데이터베이스구축단계(S21c)는 예를 들어, 등장인물 정보, 씬(Scene)정보, 감정정보, 및 화자정보 등일 수 있다. 도 7은 도 5의 데이터베이스분석단계의 구체적인 단계들을 보여주는 순서도이다. 도 5 및 도 7을 참조하면, 데이터베이스분석단계(S22)는 기존메타데이터기준분석단계(S22a), 콜퍼스분석에 따른 자체생산메타데이터기준단계(S22b), 및 메타데이터정제단계(S22c)를 포함할 수 있다. 데이터베이스분석단계(S22)는 예를 들어, 성별, 직업, 연력, 또는 환경 등에 따른 언어패턴데이터베이스를 구축 하는 단계일 수 있다. 메타데이터정제단계(S22c)는 분석용지문에 대한 콜퍼스(Corpus)분석단계, 기존메타데이터와의 비교단계, 및 상 기 기존메타데이터와의 비교단계를 기준으로 인공지능재학습 후 재분석단계를 포함할 수 있다. 콜퍼스(Corpus)분석단계에서 예를 들어, 상기 영상물-오디오물은 STT기법을 통해 화자 정보를 도출할 수 있다. 상기 인공지능재학습 후 재분석단계에서, 자체 도출된 메타데이터와 지문에 포함된 메타데이터를 섞어둔 상태에 서 학습하는 단계, 및 지문에 포함된 메타데이터를 기준으로 학습하는 단계가 진행될 수 있다. 상기 자체 도출된 메타데이터와 지문에 포함된 메타데이터를 섞어둔 상태에서 학습하는 단계에서는 딥러닝 기법 으로 특정수준(예컨대, 98%이상)에 도달할 때까지 인공지능을 무한반복학습단계를 포함할 수 있다. 몇몇 실시예에서, 상기 영상물-오디오물은 TTS기법을 통해 인공지능오이오물을 만들고 피치 분석을 통해 인공지 능을 무한비교반복학습할 수도 있다. 상기 지문에 포함된 메타데이터를 기준으로 학습하는 단계는 상기 인공지능을 도출된 메타데이터가 지문에 포함 된 메타데이터와의 일치율이 특정수준(예컨대, 98%이상)에 도달할때까지 딥러닝 엔진을 무한 반복학습하는 단계 일 수 있다. 학습용지문선별단계(S23)는 학습된 인공지능데이터베이스를 기준으로 어학학습용 지문을 선별하는 단계일 수 있 다. 교사제안단계(S24)는 상기 학습용지문선별단계(S23)를 통해 선별된 상기 어학학습용 지문을 교사에게 제안하는 단계일 수 있다. 분석데이터추출단계(S25)는 교사에게 제안된 지문에 대한 교사의 채택 비율 및 편집율 등을 분석하여 분석데이 터를 추출하는 단계일 수 있다. 신규학습용지문데이터베이스구축단계(S26)는 상기 분석데이터추출단계(S25)를 기초로, 추출된 상기 분석데이터 를 기반으로 신규학습지문데이터베이스를 구축하는 단계일 수 있다. 딥러닝인공지능재학습단계(S27)는 데이터베이스분석단계(S22)와 신규학습용지문데이터베이스구축단계(S26) 간의 결과차이를 기준으로 딥러닝 방식으로 인공지능을 재학습시키는 단계일 수 있다.인공지능무한개선단계(S27)는 상술한 학습용지문데이터베이스구축단계(S21), 데이터베이스분석단계(S22), 학습 용지문선별단계(S23), 교사제안단계(S24), 분석데이터추출단계(S25), 신규학습용지문데이터베이스구축단계 (S26), 딥러닝인공지능재학습단계(S27)를 무한반복하는 단계일 수 있다. 이하, 다른 실시예에 대해 설명한다. 본 실시예에 따른 인공지능을 활용한 사람의 학습방법은 교육콘텐츠게시 및 구매단계(S100), 학습게임제작단계 (S200), 학습단계(S300), 및 학업성취도관리단계(S400)를 포함할 수 있다. 학습게임제작단계(S200)는 게임방식선택단계(S210), 학습지문구성단계(S220), 게임요소선택단계(S230), 및 기타 설정단계(S240)를 포함할 수 있다. 학습단계(S300)는 콘텐츠구독설정 및 알림설정단계(S310), 학습과업게시단계(S320), 학습게임수행단계(S330), 수행결과물자동게시단계(S340), 그룹형 게임용골드로의 환산단계(S350), 및 단어장활용단계(S360)를 포함할 수 있다. 학업성취도관리단계(S400)는 학습자진도진행기록단계(S410), 및 게임요소관리단계(S420)를 포함할 수 있다. 도 8은 일 실시예에 따른 인공지능을 활용한 사람의 학습방법의 순서도이다. 도 8을 참조하면, 일 실시예에 따른 인공지능을 활용한 사람의 학습방법은 교육콘텐츠게시 및 구매단계(S100), 학습게임제작단계(S200), 학습단계(S300), 및 학업성취도관리단계(S400)를 포함할 수 있다. 교육콘텐츠게시 및 구매단계(S100)는 교육자 또는 교육기관이 교육자료를 개발하여 교육콘텐츠를 게시하고, 판 매하며, 수요자가 이를 구매하는 단계일 수 있다. 도 9는 도 8의 학습게임제작단계의 구체적인 단계들을 보여주는 순서도이다. 도 8 및 도 9를 참조하면, 학습게임제작단계(S200)는 게임방식선택단계(S210), 학습지문구성단계(S220), 게임요 소선택단계(S230), 및 기타설정단계(S240)를 포함할 수 있다. 학습지문구성단계(S220)는 공백생성, Placeholder생성, 태그삽입, 공백에 들어갈 정답 및 오답입력, 패턴표현, 대체표현, 및 기타자료구성을 포함할 수 있다. 게임요소선택단계(S230)는 타이머(시한폭탄, 스톱워치, 또는 플리커 등으로 구성), 반복학습방식설정, 결과게시 방법설정, 승자보상 및 패자벌칙설정, 및 기타게임별설정단계를 포함할 수 있다. 기타설정단계(S240)는 수행기한, 컷오프(Cut-off)점수, 제출물 및 제출경로, 및 성취도관리요소설정단계를 포함 할 수 있다. 도 10은 도 8의 학습단계의 구체적인 단계들을 보여주는 순서도이다. 도 8 및 도 10을 참조하면, 학습단계(S300)는 콘텐츠구독설정 및 알림설정단계(S310), 학습과업게시단계(S320), 학습게임수행단계(S330), 수행결과물자동게시단계(S340), 그룹형 게임용골드로의 환산단계(S350), 및 단어장활 용단계(S360)를 포함할 수 있다. 학습게임수행단계(S330)는 TTS가 학습용지문을 읽어주는 단계, 학습자가 상기 지문을 듣고 게임형식에 맞춰 상 기 지문을 반복해서 말하는 단계, STT가 상기 학습자의 음성을 인식하여 텍스트로 전환하고 원문과의 일치율을 계산하는 단계, 및 인공지능이 일치율에 따라 학습자의 성취점수를 주고 보상 및 벌칙을 수행하는 단계를 포함 할 수 있다.그룹형 게임용골드로의 환산단계(S350)를 통해 학교대항정 또는 스터디그룹대항전 등을 수행할 수 있다. 수행 결과에 따라 보상 및 벌칙을 수행할 수 있다. 도 11은 도 8의 학업성취도관리단계의 구체적인 단계들을 보여주는 순서도이다. 도 8 및 도 11을 참조하면, 학업성취도관리단계(S400)는 학습자진도진행기록단계(S410), 및 게임요소관리단계 (S420)를 포함할 수 있다. 학습자진도진행기록단계(S410)는 학습자의 진도진행을 기록하는 단계일 수 있다. 상기 학습자진도진행기록단계 (S410)는 예를 들어, 지문수행기록, 또는 증거동영상을 통해 구현될 수 있다. 게임요소관리단계(S420)는 UCC 캐릭터 및 아이템, 또는 그외 게임요소를 관리하는 단계일 수 있다. 상기 그외 게임요소는 예를 들어, 패자에게 선사하는 굴욕아이템선정 등일 수 있다. 이상에서 설명한 본 발명은, 도면에 도시된 일실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 명확히 하여야 할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0019779", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 인공지능(AI)고도화를 위한 학습데이터 정제방법의 순서도이다. 도 2는 도 1의 메타정보취합단계의 구체적인 단계들을 보여주는 순서도이다. 도 3은 도 2의 영상-오디오물취합단계의 구체적인 단계들을 보여주는 순서도이다. 도 4는 도 2의 콜퍼스(Corpus)취합단계의 구체적인 단계들을 보여주는 순서도이다. 도 5는 도 1의 인공지능학습데이터베이스(DB)구축 및 확장단계의 구체적인 단계들을 보여주는 순서도이다.도 6은 도 5의 학습용지문데이터베이스구축단계의 구체적인 단계들을 보여주는 순서도이다. 도 7은 도 5의 데이터베이스분석단계의 구체적인 단계들을 보여주는 순서도이다. 도 8은 일 실시예에 따른 인공지능을 활용한 사람의 학습방법의 순서도이다. 도 9는 도 8의 학습게임제작단계의 구체적인 단계들을 보여주는 순서도이다. 도 10은 도 8의 학습단계의 구체적인 단계들을 보여주는 순서도이다. 도 11은 도 8의 학업성취도관리단계의 구체적인 단계들을 보여주는 순서도이다."}
