{"patent_id": "10-2019-0082973", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0018235", "출원번호": "10-2019-0082973", "발명의 명칭": "데이터 처리 장치, 인공 지능 칩 및 전자 장치", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "우 펭"}}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "처리하고자 하는 데이터를 저장하는 적어도 하나의 입력 메모리와, 외부 처리 지령을 판독하고, 상기 처리 지령을 해석하여 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을획득하며, 상기 데이터 판독 주소에 따라 상기 입력 메모리에서 처리하고자 하는 데이터를 판독하고, 상기 조작명령에 따라 상기 처리하고자 하는 데이터에 대해 처리를 진행하여, 다중 경로 처리된 출력 데이터 및 대응되는데이터 기입 주소를 획득하고, 데이터 기입 요청을 발송하는 적어도 하나의 데이터 수송 부재와, 적어도 하나의 데이터 수송 부재의 데이터 기입 요청이 수신됨에 대응하여, 상기 데이터 수송 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 수신된 출력 데이터 및 데이터 기입 주소로부터 그중 하나의 데이터 수송 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 게이팅하여 출력을 진행하며, 기입 인에이블 신호를 발송하는 적어도 하나의 다중 경로 중재 부재와, 상기 다중 경로 중재 부재에서 발송된 기입 인에이블 신호가 수신됨에 대응하여, 상기 다중 경로 중재 부재에서출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 수신된 상기 출력 데이터를 대응되는 데이터 기입 주소에 기입하는 적어도 하나의 출력 메모리를 포함하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 데이터 수송 부재는, 판독된 처리 지령을 해석하고, 해석 조작을 실행하는 프런트 엔드 디코딩 부재 - 상기 해석 조작은 상기 처리지령에서 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 추출하고, 상기 입력 메모리에 데이터 판독 요청을 발송하며, 상기 데이터 판독 요청이 수신됨에 대응하여 상기 입력 메모리가 발송한 처리하고자 하는 데이터를 데이터 대기열에 캐시하고, 추출된 상기 조작 명령을 명령 대기열에 캐시하는 조작을 포함함 - 와, 각기 상기 명령 대기열의 조작 명령에 따라 상기 데이터 대기열 중의 처리하고자 하는 데이터에 대해 처리를 진행하여 일 경로의 출력 데이터를 획득하는 적어도 하나의 처리 부재를 포함하는 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 프런트 엔드 디코딩 부재에 의해 실행되는 해석 조작은, 상기 조작 명령이 데이터 수송 명령 또는 데이터 전환 명령인지를 확정하고, 상기 조작 명령이 데이터 수송 명령이면, 상기 프런트 엔드 디코딩 부재로 상기 입력 메모리에서 발송된 처리하고자 하는 데이터를 각 처리 부재에 브로드캐스팅하고, 상기 조작 명령이 데이터 전환 명령이면, 상기 프런트 엔드 디코딩 부재로 상기 입력 메모리에서 발송된 처리하고자 하는 데이터를 대응되는 적어도 하나의 처리 부재에 발송하는 것을 더 포함하되, 각 처리 부재에는 대응되는 데이터 판독 주소 오프셋이 사전에 설정되는 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 프런트 엔드 디코딩 부재는,공개특허 10-2020-0018235-3-상기 처리 지령을 해석한 이후, 판독된 상기 처리 지령이 단일 단계 실행 지령 또는 일괄 처리 지령인지를 판단하고, 상기 처리 지령이 단일 단계 실행 지령이면, 상기 해석 조작을 실행하고, 상기 처리 지령이 일괄 처리 지령이면, 상기 해석 조작을 기정의 횟수로 중복하여 실행하며, 해석 조작을 매번실행한 이후 기정의 주소 오프셋 단계 크기에 따라 데이터 판독 주소 및 데이터 기입 주소를 조정하는 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서, 상기 처리 부재는, 상기 데이터 대기열에서 처리하고자 하는 데이터를 판독하는 데이터 레지스터와, 상기 명령 대기열에서 조작 명령을 판독하는 명령 레지스터와, 상기 명령 레지스터의 명령에 따라 상태 제어를 진행하는 상태 머신과, 상기 상태 머신의 제어에 따라 상기 데이터 레지스터에서 처리하고자 하는 데이터를 선택하여 출력을 진행하는다중 경로 선택 장치를 포함하는 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 상태 머신은, 상기 명령 레지스터에서 상기 처리 지령으로부터 해석하여 획득한 데이터 기입 주소를 수신하고, 수신된 데이터기입 주소 및 상기 처리 부재에 사전에 설정된 주소 입력 오프셋에 따라 출력 데이터의 데이터 기입 주소를 산출하고, 상기 다중 경로 중재 부재에 데이터 기입 요청 및 상기 출력 데이터의 데이터 기입 주소를 발송하도록더 구성되는 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서, 상기 다중 경로 중재 부재는 적어도 하나의 중재 유닛을 포함하되, 각 중재 유닛은 중재 장치 및 선택 장치를 포함하고, 상기 중재 장치는 각 데이터 수송 부재 중의 하나의 처리 부재의 출력 데이터에 대해 중재를 진행하고, 중재 결과에 따라 상기 선택 장치를 제어하여 그중 하나의 처리 부재의 출력 데이터 및 대응되는 데이터 기입 주소를선택하여 출력을 진행하며, 상기 출력 메모리에 기입 인에이블 신호를 발송하는 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 출력 메모리는 상기 다중 경로 중재 부재에서 출력되는 기입 인에이블 신호, 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 상기 기입 인에이블 신호의 제어 하에 상기 출력 데이터를 대응되는 데이터 기입주소에 기입하는 것을 특징으로 하는데이터 처리 장치. 공개특허 10-2020-0018235-4-청구항 9 제1항 내지 제8항 중 어느 한 항에 있어서, 상기 입력 메모리 및 상기 출력 메모리는 온 칩 메모리인 것을 특징으로 하는데이터 처리 장치."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제8항 중 어느 한 항의 데이터 처리 장치를 포함하는 인공 지능 칩."}
{"patent_id": "10-2019-0082973", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "중앙 처리 유닛과, 제10항의 인공 지능 칩을 포함하는 전자 장치."}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시예는 데이터 처리 장치, 인공 지능 칩 및 전자 장치를 개시한다. 데이터 처리 장치의 일 구체적인 실시예는, 처리하고자 하는 데이터를 저장하는 입력 메모리와, 외부 처리 지령을 판독하고 해석하여 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 획득하고, 데이터 판독 주소에 따라 처리하고자 하는 데이터를 (뒷면에 계속)"}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원의 실시예는 컴퓨터 기술 분야에 관한 것으로, 구체적으로는 데이터 처리 장치, 인공 지능 칩 및 전자 장치에 관한 것이다."}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능 기술이 점점 많은 분야에 적용됨에 따라, 인공 지능 기술로 처리하는 문제들은 점점 복잡해지고 있으 며, 관련된 텐서 데이터에 대한 컴퓨팅 사이즈가 점점 커지고 있다. 현재의 인공 지능 기술에 있어서, 중앙 처 리 유닛(Central Processing Unit, CPU), 그래픽 처리 유닛(Graphic Processing Unit, GPU), 디지털 신호 처리 (Digital Signal Processing, DSP) 칩과 같은 범용의 프로세서 또는 주문형 집적 회로(Application Specific Integrated Circuit, ASIC), 필드 프로그래밍 게이트 어레이(Field-Programming Gate Array, FPGA)과 같은 전 용의 하드웨어 장치 등을 이용하여 심층 학습 중의 다차원 텐서의 데이터 수송 및 데이터 전환 조작을 실행한다. 범용의 프로세서 기반의 데이터 처리에 있어서, 데이터 액세스 및 저장 경로가 상대적으로 복잡하고, 외부 메모 리의 액세스 및 저장에 관련되며, 액세스 대역폭에 한정이 존재한다. ASIC, FPGA 등의 전용의 하드웨어 장치 기 반의 데이터 처리 방법에 있어서, 통상적으로 단지 특정된 차원의 데이터 수송 및 데이터 전환 조작이 주문형으 로 구현되므로, 융통성을 향상시킬 필요가 존재한다."}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원의 실시예는 데이터 처리 장치, 인공 지능 칩 및 전자 장치를 제공한다."}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "제1 양태에 있어서, 본 출원의 실시예는 데이터 처리 장치를 제공한다. 상기 장치는, 처리하고자 하는 데이터를 저장하는 적어도 하나의 입력 메모리와, 외부 처리 지령을 판독하고 처리 지령을 해석하여 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 획득하고, 데이터 판독 주소에 따라 입력 메모리에서 처리하고자 하는 데이터 를 판독하고, 조작 명령에 따라 처리하고자 하는 데이터에 대해 처리를 진행하여 다중 경로 처리된 출력 데이터 및 대응되는 데이터 기입 주소를 획득하고, 데이터 기입 요청을 발송하는 적어도 하나의 데이터 수송 부재와, 적어도 하나의 데이터 수송 부재의 데이터 기입 요청이 수신됨에 대응하여, 데이터 수송 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 수신된 출력 데이터 및 데이터 기입 주소로부터 그중 하나의 데이터 수 송 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 게이팅하여 출력을 진행하며, 기입 인에이블 신호를 발 송하는 적어도 하나의 다중 경로 중재 부재와, 다중 경로 중재 부재에서 발송한 기입 인에이블 신호가 수신됨에 대응하여, 다중 경로 중재 부재에서 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 수신된 출력 데이터를 대응되는 데이터 기입 주소에 기입하는 적어도 하나의 출력 메모리를 포함한다. 일부의 실시예에 있어서, 데이터 수송 부재는, 판독된 처리 지령을 해석하고, 해석 조작을 실행하는 프런트 엔 드 디코딩 부재와 - 상기 해석 조작은 상기 처리 지령에서 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 추출하고, 상기 입력 메모리에 데이터 판독 요청을 발송하며, 상기 데이터 판독 요청이 수신됨에 대응하여 상기 입력 메모리가 발송한 처리하고자 하는 데이터를 데이터 대기열에 캐시하고, 추출된 상기 조작 명령을 명령 대 기열에 캐시하는 조작을 포함함 -, 각기 명령 대기열의 조작 명령에 따라 데이터 대기열 중의 처리하고자 하는 데이터에 대해 처리를 진행하고, 일 경로의 출력 데이터를 획득하는 적어도 하나의 처리 부재를 포함한다. 일부의 실시예에 있어서, 프런트 엔드 디코딩 부재에 의해 실행되는 해석 조작은, 조작 명령이 데이터 수송 명 령 또는 데이터 전환 명령인지를 확정하고, 조작 명령이 데이터 수송 명령이면, 프런트 엔드 디코딩 부재로 입 력 메모리에서 발송된 처리하고자 하는 데이터를 각 처리 부재에 브로드캐스팅하고；조작 명령이 데이터 전환 명령이면, 프런트 엔드 디코딩 부재로 입력 메모리에서 발송된 처리하고자 하는 데이터를 대응되는 적어도 하나 의 처리 부재에 발송하는 것을 더 포함하되, 각 처리 부재에는 대응되는 데이터 판독 주소 오프셋이 사전에 설 정된다. 일부의 실시예에 있어서, 프런트 엔드 디코딩 부재는 처리 지령을 해석한 이후, 판독된 처리 지령이 단일 단계 실행 지령 또는 일괄 처리 지령인지를 판단하고, 처리 지령이 단일 단계 실행 지령이면, 해석 조작을 실행하고, 처리 지령이 일괄 처리 지령이면, 해석 조작을 기정의 횟수로 중복하여 실행하며, 해석 조작을 매번 실행한 이 후 기정의 주소 오프셋 단계 크기에 따라 데이터 판독 주소 및 데이터 기입 주소를 조정한다. 일부의 실시예에 있어서, 처리 부재는, 데이터 대기열에서 처리하고자 하는 데이터를 판독하는 데이터 레지스터 와, 명령 대기열에서 조작 명령을 판독하는 명령 레지스터와, 명령 레지스터의 명령에 따라 상태 제어를 진행하 는 상태 머신과, 상태 머신의 제어에 따라 데이터 레지스터에서 처리하고자 하는 데이터를 선택하여 출력을 진 행하는 다중 경로 선택 장치를 포함한다. 일부의 실시예에 있어서, 상태 머신은, 명령 레지스터에서 처리 지령으로부터 해석하여 획득된 데이터 기입 주 소를 수신하고, 수신된 데이터 기입 주소 및 처리 부재에 사전에 설정된 주소 입력 오프셋에 따라 출력 데이터 의 데이터 기입 주소를 산출하고, 다중 경로 중재 부재에 데이터 기입 요청 및 출력 데이터의 데이터 기입 주소 를 발송하도록 더 구성된다. 일부의 실시예에 있어서, 다중 경로 중재 부재는 적어도 하나의 중재 유닛을 포함하고, 각 중재 유닛은 중재 장 치 및 선택 장치를 포함하며, 중재 장치는 각 데이터 수송 부재 중의 하나의 처리 부재의 출력 데이터에 대해 중재를 진행하고, 중재 결과에 따라 선택 장치를 제어하여 그중 하나의 처리 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 선택하여 출력을 진행하며, 출력 메모리에 기입 인에이블 신호를 발송한다. 일부의 실시예에 있어서, 출력 메모리는 다중 경로 중재 부재에서 출력되는 기입 인에이블 신호, 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 기입 인에이블 신호의 제어 하에 출력 데이터를 대응되는 데이터 기 입 주소에 기입한다. 일부의 실시예에 있어서, 입력 메모리 및 출력 메모리은 온 칩 메모리이다. 제2 양태에 있어서, 본 출원의 실시예는 제1 양태에서 제공하는 데이터 처리 장치를 포함하는 인공 지능 칩을 제공한다. 제3 양태에 있어서, 본 출원의 실시예는 중앙 처리 유닛 및 제2 양태에서 제공하는 인공 지능 칩을 포함하는 전 자 장치를 제공한다."}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 상술한 실시예의 데이터 처리 장치, 인공 지능 칩 및 전자 장치는, 처리하고자 하는 데이터를 저장하 는 적어도 하나의 입력 메모리와, 외부 처리 지령을 판독하고 처리 지령을 해석하여 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 획득하고, 데이터 판독 주소에 따라 입력 메모리에서 처리하고자 하는 데이터를 판독 하고, 조작 명령에 따라 처리하고자 하는 데이터에 대해 처리를 진행하여 다중 경로 처리된 출력 데이터 및 대 응되는 데이터 기입 주소를 획득하고, 데이터 기입 요청을 발송하는 적어도 하나의 데이터 수송 부재와, 적어도 하나의 데이터 수송 부재의 데이터 기입 요청이 수신됨에 대응하여, 데이터 수송 부재의 출력 데이터 및 대응되 는 데이터 기입 주소를 수신하고, 수신된 출력 데이터 및 데이터 기입 주소로부터 그중 하나의 데이터 수송 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 게이팅하여 출력을 진행하며, 기입 인에이블 신호를 발송하 는 적어도 하나의 다중 경로 중재 부재와, 다중 경로 중재 부재에서 발송한 기입 인에이블 신호가 수신됨에 대 응하여, 다중 경로 중재 부재에서 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 수신된 출력 데이터 를 대응되는 데이터 기입 주소에 기입하는 적어도 하나의 출력 메모리를 포함한다. 상술한 데이터 처리 장치, 인공 지능 칩 및 전자 장치는 소프트웨어 지령 기반의 구동을 실현하여, 상대적으로 높은 융통성을 구비하고, 하드웨어를 수정하지 않고서 상이한 유형 및 규모의 텐서 데이터 수송 및 전환 조작을 융통성 있게 지원하는 것 을 허용하며, 아울러, 데이터 처리량이 매칭되는 입력 메모리 및 출력 메모리의 대역폭에 의존하므로, 대역폭을 효과적으로 확장시키고 액세스 및 저장의 지연을 저감시킬 수 있다."}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면 및 실시예들을 결부하여 본 출원에 대한 보다 상세한 설명을 진행하기로 한다. 여기에 설명 되는 구체적인 실시예들은 단지 관련된 발명을 해석하기 위한 것일 뿐, 해당 발명을 한정하기 위한 것이 아님을 이해할 수 있을 것이다. 또한, 설명의 편의를 위해 첨부된 도면에는 단지 관련 발명에 관한 부분만이 도시됨을 설명하고자 한다. 본 출원의 실시예 및 실시예 중의 특징들은 모순되지 않는 한 서로 조합될 수 있음을 설명하고자 한다. 이하, 첨부된 도면을 참조하고 실시예들을 결부하여 본 출원에 대한 상세한 설명을 진행하기로 한다. 도1은 본 출원의 실시예에 따른 데이터 처리 장치의 일 구성을 나타낸다. 도1에 도시된 바와 같이, 본 출원의 실시예의 데이터 처리 장치는 적어도 하나의 입력 메모리, 적어도 하나 의 데이터 수송 부재, 적어도 하나의 다중 경로 중재 부재 및 적어도 하나의 출력 메모리를 포함할 수 있다. 입력 메모리는 데이터 수송 부재와 연결되고, 데이터 수송 부재는 다중 경로 중재 부재 와 연결되며, 다중 경로 중재 부재는 출력 메모리와 연결된다. 입력 메모리는 처리하고자 하는 데이터를 저장하고, 여기서 처리하고자 하는 데이터는 심층 학습 컴퓨팅 중 의 텐서 데이터일 수 있으며, 예컨대 심층 학습 네트워크에 입력된 이미지를 표시하는 2차원 그레이 값 행렬일 수 있다. 처리하고자 하는 데이터는 데이터 처리 장치 외부의 처리 유닛(예컨대, CPU) 또는 기타의 맞춤형 장치 로 입력 메모리에 기입된 것일 수 있다. 입력 메모리는 이중 포트 정적 랜덤 액세스 메모리(Static Random Access memory, SRAM)일 수 있으며, 그의 비트 폭은 예컨대 512 비트(bit)일 수 있다. 입력 메모리 중의 데이터 의 비트 폭은 32 bit일 수 있으며, 이러할 경우, 각 입력 메모리의 하나의 행은 16개의 데이터를 저장할 수 있 다. 대안으로, 본 출원의 실시예의 데이터 처리 장치는 적어도 2개의 입력 메모리, 적어도 2개의 데이터 수송 부재, 적어도 2개의 다중 경로 중재 부재 및 적어도 2개의 출력 메모리를 포함할 수 있다. 여기서, 입력 메모리, 데이터 수송 부재, 다중 경로 중재 부재, 출력 메모리는 일일이 대응될 수 있다. 또한, 일부의 구현에 있어서, 데이터 처리 장치 중의 입력 메모리, 데이터 수송 부재, 다중 경로 중재 부재 및 출력 메모리의 수량은 업무상의 요구(예컨대, 액세스 및 저장 속도, 대역폭 요구)에 따라 확장되거나 구성될 수 있다. 데이터 처리 장 치가 다수의 입력 메모리를 포함할 경우, 다수의 입력 메모리는 통합적으로 주소 지정될 수 있으며, 즉, 다수의입력 메모리 사이는 연속적으로 주소 지정될 수 있다. 예를 들어, 2차원 배열 D[][]에 대해, 제1 입력 메모리의 제1 행은 D[0][0], D[0][1], D[0][2], ..., D[0][15]을 저장할 수 있으며, 제2 입력 메모리의 제1행은 D[0][16], D[0][17], D[0][18], ..., D[0][31]을 저장할 수 있다. 입력 메모리는 그에 연결된 데이터 수송 부재에서 발송된 데이터 판독 요청을 수신할 수 있으며, 해당 데이터 판독 요청은 지정된 주소의 데이터를 판독하는 요청일 수 있고, 입력 메모리는 데이터 수송 부재 에 대응되는 주소의 데이터를 출력할 수 있다. 데이터 수송 부재는 외부의 처리 지령을 판독하고, 처리 지령을 해석하여 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 획득하고, 데이터 판독 주소에 따라, 입력 메모리에서 처리하고자 하는 데이터를 판독하고, 조작 명령에 따라, 처리하고자 하는 데이터에 대해 처리를 진행하여 다중 경로 처리된 출력 데이터 및 대응되는 데이터 기입 주소를 획득하고, 그에 연결된 다중 경로 중재 부재에 데이터 기입 요청을 발송할 수 있다. 여기서, 데이터 수송 부재는 지령 입구(즉, 지령 수신 포트)를 구비할 수 있으며, 지령 입구를 통해 외부의 처리 지령을 판독하며, 해당 처리 지령은 처리하고자 하는 데이터에 대한 처리 조작을 지시하기 위한 것일 수 있다. 데이터 수송 부재로 처리 지령에서 해석하여 획득한 데이터 판독 주소는, 입력 메모리에서의 처 리하고자 하는 데이터의 주소일 수 있으며, 또는 대안으로, 해당 데이터 판독 주소는 입력 메모리에서의 처 리하고자 하는 데이터의 시작 주소이다. 데이터 기입 주소는, 처리된 데이터를 출력 메모리에 기입하는 주 소일 수 있으며, 또는 대안으로, 해당 데이터 기입 주소는, 처리된 출력 데이터를 출력 메모리에 기입하는 시작 주소일 수 있다. 조작 명령은 처리하고자 하는 데이터에 대해 실행하는 조작(예컨대, 전환 조작 또는 수송 조작)을 지시할 수 있다. 여기서, 전환 조작은 텐서 데이터 중의 임의의 한 차원의 데이터를 텐서 데이터의 다 른 한 차원으로 전환시키는 것일 수 있으며, 수송 조작은 텐서 데이터에 대한 전송 조작일 수 있다. 대안으로, 데이터 수송 부재는 처리 지령을 해석한 이후, 데이터 기입 방식을 또한 획득할 수 있으며, 데이터 기입 방 식은 출력 데이터를 출력 메모리에 기입하는 방식(예컨대, 직렬 기입)을 지시하도록 이용된다. 데이터 수송 부재는 해석하여 획득한 데이터 판독 주소에 따라 입력 메모리에 데이터 판독 요청을 발송하고, 즉, 데이터 판독 주소를 포함하는 데이터 판독 요청을 발송한다. 입력 메모리는 해당 데이터 판 독 요청을 수신한 이후, 데이터 판독 주소에 저장된 데이터를 처리하고자 하는 데이터로서 데이터 수송 부재 에 전송할 수 있으며, 이로써, 외부 처리 지령에 따라 처리하고자 하는 데이터를 획득할 수 있다. 데이터 수송 부재는 상술한 조작 명령에 따라, 처리하고자 하는 데이터에 대해 처리를 진행하여 출력 데이 터를 획득할 수 있으며, 외부 처리 지령에서 해석된 데이터 기입 주소에 따라, 각 출력 데이터에 대응되는 데이 터 기입 주소를 산출할 수 있다. 예컨대, 외부 처리 지령에서 해석된 데이터 기입 주소를 초기 기입 주소로서, 출력 데이터의 출력 타이밍에 따라 초기 기입 주소를 순차적으로 뒤로 이동시켜 대응되는 출력 데이터의 데이터 기입 주소를 획득할 수 있다. 출력 데이터 및 대응되는 데이터 기입 주소를 다중 경로 중재 부재에 발송할 수 있다. 본 실시예에 있어서, 데이터 처리 장치 중의 다수의 데이터 수송 부재는 출력 데이터 및 대 응되는 데이터 기입 주소를 동일한 다중 경로 중재 부재에 발송할 수 있으며, 각 데이터 수송 부재는 출력 데이터 및 대응되는 데이터 기입 주소를 적어도 2개의 다중 경로 중재 부재에 발송할 수도 있다. 대안 으로, 각 데이터 수송 부재는 출력 데이터 및 대응되는 데이터 기입 주소를 각 다중 경로 중재 부재에 각각 발송한다. 데이터 수송 부재는 다중 경로 중재 부재에 데이터 기입 요청을 발송할 수도 있다. 다중 경로 중재 부재는 적어도 하나의 데이터 수송 부재의 데이터 기입 요청을 수신하고, 수신된 데이 터 기입 요청에 대응하여, 적어도 하나의 데이터 수송 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 수신할 수 있다. 다중 경로 중재 부재는 수신된 출력 데이터에 대해 중재를 진행하고, 수신된 적어도 하나 의 데이터 수송 부재의 출력 데이터 및 대응되는 데이터 기입 주소에서 그중 하나의 데이터 수송 부재 의 출력 데이터 및 대응되는 데이터 기입 주소를 게이팅하여 출력을 진행할 수 있으며, 출력 메모리에 기입 인에이블 신호를 발송하여 출력 메모리로 하여금 저장 기능을 작동시킬 수도 있다. 대안으로, 다중 경로 중재 부재는 데이터 수송 부재에 일일이 대응되는 다수의 입력 포트를 구비할 수 있으 며, 각 입력 포트는 하나의 데이터 수송 부재의 출력 데이터 및 데이터 기입 주소를 수신한다. 다중 경로 중재 부재는 기정의 중재 전략에 따라 다수의 입력 포트에서 그중 하나의 입력 포트를 게이팅하고, 게이팅 된 입력 포트로 수신한 데이터 수송 부재의 출력 데이터 및 데이터 기입 주소를 출력할 수 있다. 게이팅되지 않 은 입력 포트로 수신한 출력 데이터 및 데이터 기입 주소는 기타의 다중 경로 중재 부재를 통해 출력하거나, 중 복되게 요청된 후 다중 경로 중재 부재로 출력할 수 있다. 출력 메모리는 다중 경로 중재 부재에서 발송한 기입 인에이블 신호가 수신됨에 대응하여, 다중 경로 중재 부재에서 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 수신된 출력 데이터를 대응되는 데 이터 기입 주소에 기입할 수 있다. 출력 메모리는 이중 포트 SRAM일 수 있으며, 그의 비트 폭은 예컨대 32 비트(bit)일 수 있다. 각 출력 메모리는 데이터 비트 폭 방향에서 선형 주소 지정을 진행할 수 있으며, 2차 원 배열 D[][]을 예로 들면, 제1 출력 메모리는 D[0][0], D[1][0], D[2][0], ...을 저장할 수 있으며, 제2 출 력 메모리는 D[0][1], D[1][1], D[2][1], ...을 저장할 수 있는 등이다. 출력 메모리가 출력 데이터를 대응되는 데이터 기입 주소에 기입한 이후, 다중 경로 중재 부재는 데이 터 수송 부재에 기입 응답 신호를 반송할 수 있다. 본 출원의 상기 실시예의 데이터 처리 장치는, 적어도 하나의 입력 메모리, 적어도 하나의 데이터 수송 부재, 적어도 하나의 다중 경로 중재 부재 및 적어도 하나의 출력 메모리를 포함한다. 여기서, 입력 메모리, 데이터 수송 부재, 다중 경로 중재 부재 및 출력 메모리의 수량은 업무상의 요구에 따라 확장되거나 구성될 수 있다. 예컨대, 심층 학습 기반의 신경망 트레이닝 과정에 있어서, 대 데이터량의 텐서 데이터 수송 또는 전환을 진행 하여야 할 경우, 텐서 데이터의 비트 폭에 따라 필요한 입력 메모리, 출력 메모리의 수량을 산출하여, 상응한 데이터의 데이터 수송 부재, 다중 경로 중재 부재를 설정할 수 있으며, 하드웨어 장치를 수정하지 않고서 상이 한 유형 및 규모의 텐서 데이터의 수송 및 전환 조작을 융통성 있게 지원할 수 있다. 상술한 데이터 처리 장치의 데이터 액세스 및 저장 경로는 간단하고, 그의 처리량은 입력 메모리 및 출력 메모 리의 대역폭에 의존하며, 높은 대역폭의 메모리를 이용하여 대역폭을 확장시켜 액세스 및 저장 지연을 저감시킬 수 있다. 또한, 상술한 데이터 처리 장치는 지령 입구를 통해 외부 처리 지령을 수신하고, 처리 지령을 해석하 여 데이터 주소 및 조작 명령을 획득하며, 소프트웨어 지령 기반의 구동을 실현하여, 상대적으로 높은 융통성을 구비한다. 대안으로, 또한 데이터 액세스 및 저장 속도를 향상시키고, 지연을 저감시키기 위하여, 상술한 입력 메모리 및 출력 메모리는 온 칩 메모리를 이용할 수 있다. 이어서 도2를 참조하면, 도2는 본 출원의 실시예에 따른 데이터 처리 장치 중의 데이터 수송 부재의 일 개략적 구성도이다. 도2에 도시된 바와 같이, 데이터 수송 부재는 프런트 엔드 디코딩 부재 및 적어도 하나의 처리 부재를 포함할 수 있다. 프런트 엔드 디코딩 부재는 처리 지령에 대한 해석 조작을 실행할 수 있다. 해석 조작은, 처리 지령에서 데이터 판독 주소, 데이터 기입 주소 및 조작 명령을 추출한 이후, 입력 메 모리에 데이터 판독 요청을 발송하고, 입력 메모리가 데이터 판독 요청을 수신함에 대응하여 발송한 처리하고자 하는 데이터를 데이터 대기열에 캐시하고, 추출된 조작 명령을 명령 대기열에 캐시하는 것을 포함할 수 있다. 각 처리 부재는 명령 대기열 중의 명령에 따라 데이터 대기열 중의 처리하고자 하는 데이터에 대해 처리를 진행하고, 일 경로의 출력 데이터를 획득할 수 있다. 대안으로, 처리 지령을 해석한 이후, 데이터를 기입하는 기입 방식을 추출할 수도 있으며, 해당 기입 방식은 출 력 메모리의 일 행을 병렬 기입하는 것일 수 있으며, 또는 출력 메모리의 일 열을 기입하는 것일 수 있다. 본 실시예에 있어서, 데이터 수송 부재 중의 명령 대기열 중의 조작 명령 및 데이터 대기열 중의 대응되는 처리 하고자 하는 데이터는 각 처리 부재에 분배되어 처리될 수 있다. 각 처리 부재는 대응되는 데이터 판 독 주소 오프셋 및 데이터 기입 주소 오프셋을 사전에 설정할 수 있다. 여기서, 데이터 판독 주소 오프셋은 판 독된 제1/제1 세트의 처리하고자 하는 데이터의 주소에 대한 해당 처리 부재로 판독한 처리하고자 하는 데이터 의 오프셋을 나타낼 수 있고, 데이터 기입 주소 오프셋은 기입된 제1/제1 세트의 처리하고자 하는 데이터의 주 소에 대한 해당 처리 부재로 기입한 출력 데이터의 오프셋을 나타낼 수 있다. 구체적으로, 각 처리 부재는 독립적인 코드를 구비할 수 있고, 해당 코드는 처리 부재에 대응되는 처리하고자 하는 데이터의 데이터 판독 주 소 오프셋 또는 출력 데이터의 데이터 기입 주소 오프셋을 표식하도록 이용될 수 있다. 예컨대, 각 처리 부재 는 단지 입력 메모리의 일 열의 데이터를 처리할 수 있고, 코드가 x1인 처리 부재는 입력 메모리 중의 제1 열의 데이터를 대응되게 처리할 수 있고, 코드가 x2인 처리 부재는 입력 메모리 중의 제2 열의 데이터를 대응되 게 처리할 수 있는 등이다. 이로써, 처리하고자 하는 데이터의 데이터 판독 주소에 따라, 대응되는 코드를 구비 하는 처리 부재에 처리하고자 하는 데이터를 분배하여 처리를 진행할 수 있다. 구체적인 처리 조작은 예컨 대 데이터 전환 조작 또는 데이터 수송 조작일 수 있다. 명령 대기열 중의 조작 명령은 데이터 대기열 중의 처 리하고자 하는 데이터에 일일이 대응되는 것일 수 있다. 처리 부재는 그의 코드에 따라 데이터 대기열에서 처리하고자 하는 데이터를 판독하고, 명령 대기열에서 대응되는 조작 명령을 획득하며, 해당 조작 명령을 실행하여 출력 데이터를 획득할 수 있다. 대안으로, 상술한 해석 조작은, 조작 명령이 데이터 수송 명령 또는 데이터 전환 명령인지를 확정하는 것을 더 포함할 수 있다. 여기서, 데이터 수송 명령은 입력 메모리의 데이터를 출력 메모리에 수송하는 명령일 수 있다. 처리 지령으로부 터 해석하여 획득한 데이터 기입 주소는, 출력 메모리에 기입된 제1 데이터의 주소일 수 있다. 이러할 경우, 데 이터 수송 과정에, 기정의 주소 오프셋 단계 크기에 따라 처리하고자 하는 데이터의 주소 오프셋, 예컨대, 제1 데이터에 대한 주소 \"xxxxx\"의 오프셋 2를 산출하여, 처리하고자 하는 데이터에 대응되는 출력 데이터의 데이터 기입 주소가 \"xxxxx\"를 2개의 단위로 오프셋한 후의 주소임을 확정할 수 있다. 여기서, 데이터 수송 과정에 데 이터에 대해 변환을 진행하지 않고, 단지 처리하고자 하는 데이터를 출력 메모리에 수송한다. 입력 메모리에서 발송한 처리하고자 하는 데이터는 여러 행의 데이터일 수 있으며, 조작 명령이 데이터 수송 명령이면, 프런트 엔드 디코딩 부재는 입력 메모리에서 발송한 처리하고자 하는 데이터를 각 처리 부재에 브로드캐스팅할 수 있으며, 각 처리 부재는 처리하고자 하는 데이터 중 각자에 대응되는 일 열의 데이터를 수신하여 수송을 진행한다. 데이터 전환 명령은 처리하고자 하는 데이터에 대해 전환 조작을 진행하는 명령일 수 있다. 처리 지령을 해석하 여 획득한 데이터 기입 주소는, 메모리에 기입된 제1 데이터 또는 제1 열의 데이터의 주소일 수 있다. 데이터 전환 과정에, 기정의 주소 오프셋 단계 크기에 따라 각 열의 처리하고자 하는 데이터의 오프셋을 산출하고, 이 어서 상술한 데이터 기입 주소에 따라 각 열의 처리하고자 하는 데이터의 저장 순서를 산출할 수 있다. 예컨대, 주소 오프셋 단계 크기가 2이고, 해석하여 획득한 데이터 기입 주소가 “yyyyy\"일 경우, 제1 열의 처리하고자 하는 데이터를 전환한 후의 저장 주소는 “yyyyy\"를 2개 단위 오프셋한 후의 시작 주소이다. 여기서, 전환 조작 은 처리하고자 하는 데이터 중의 각 열을 출력 데이터 중의 각 행으로 전환하는 조작일 수 있다. 입력 메모리에 서 발송한 처리하고자 하는 데이터는 여러 열의 데이터일 수 있으며, 조작 명령이 데이터 전환 명령이면, 프런 트 엔드 디코딩 부재는 입력 메모리에서 발송한 처리하고자 하는 데이터를 대응되는 적어도 하나의 처리 부재에 발송할 수 있다. 입력 메모리에서 발송된 처리하고자 하는 데이터는 여러 열의 데이터일 수 있으며, 각 처리 부 재는 그의 코드에 따라 대응되는 일 열의 데이터를 확정할 수 있으며, 이러할 경우, 데이터 전환 명령을 수신한 이후, 여러 열의 데이터 중의 각 열을 해당 열의 데이터에 대응되는 처리 부재에 발송하여 전환 및 대응되는 기 입 주소의 컴퓨팅을 진행할 수 있다. 본 실시예의 일부 선택 가능한 구현에 있어서, 해석 조작을 실행하기 전에, 상술한 프런트 엔드 디코딩 부재는 판독된 처리 지령이 단일 단계 지령 또는 일괄 처리 지령인지를 판단할 수도 있다. 도3을 참조하면, 도3은 데이 터 수송 부재 중의 프런트 엔드 디코딩 부재의 실행 조작의 하나의 개략적 흐름도를 나타낸다. 도3에 도시된 바와 같이, 프런트 엔드 디코딩 실행 조작의 흐름에 있어서, 먼저 단계에서 처리 지령 을 해석하고, 이어서 단계에서, 처리 지령이 단일 단계 실행 지령 또는 일괄 처리 지령인지를 판단할 수 있다. 단일 단계 실행 지령은, 입력 메모리 중의 일 세트의 처리하고자 하는 데이터에 대해 처리를 진행하는 지 령일 수 있고, 일괄 처리 지령은, 입력 메모리 중의 다수의 세트의 처리하고자 하는 데이터에 대해 처리를 진행 하는 지령일 수 있다. 단계의 판단 결과가 단일 단계 실행 지령이면, 단일 단계 지령 모드로 진입하여, 단계 내지 단계 에 도시된 바와 같은 해석 조작을 실행한다. 구체적으로, 단계에서, 처리 지령에서 조작 명령, 데이 터 판독 주소 및 데이터 기입 주소를 추출하고, 조작 명령을 명령 대기열에 추가하며, 입력 메모리에 데이터 판 독 요청을 발송한다. 입력 메모리는 데이터 판독 요청을 수신한 이후, 처리하고자 하는 데이터를 데이터 수송 부재에 발송할 수 있다. 이어서, 단계에서, 조작 명령이 데이터 수송 명령 또는 데이터 전환 명령인지를 판단할 수 있으며, 데이터 수송 명령이면, 처리하고자 하는 데이터를 각 처리 부재에 브로드캐스팅하는 단계 를 실행하고, 데이터 전환 명령이면, 처리하고자 하는 데이터를 대응되는 처리 부재에 유니캐스팅하는 단 계를 실행한다. 이어서, 단계로 돌아가, 수신된 다음 처리 지령을 해석할 수 있다. 단계의 판단 결과가 처리 지령이 일괄 처리 지령이면, 기정 횟수로 단계, 단계 및 단계 또 는 단계에 도시된 해석 조작을 중복하여 실행할 수 있다. 매번 해석 조작을 실행 완료한 이후, 기정의 주 소 오프셋 단계 크기에 따라 데이터 판독 주소 및 데이터 기입 주소를 조정할 수 있다. 즉, 한 세트의 처리하고 자 하는 데이터에 대해 해석을 완료한 이후, 기정의 판독 주소 오프셋 단계 크기(예컨대, 1)에 따라 다음 세트 의 처리하고자 하는 데이터의 데이터 판독 주소를 산출하고, 이어서, 다음 세트의 처리하고자 하는 데이터를 판 독하여 해석을 진행하고, 기정의 기입 주소 오프셋 단계 크기(예컨대, 2)에 따라 기입하는 한 세트의 처리하고자 하는 데이터에 대응되는 출력 데이터의 데이터 기입 주소를 산출할 수 있다. 이로써, 다수의 해석 조작을 중 복하여 실행할 수 있으며, 매번 해석 조작이 완료된 이후, 단계에서 일괄 처리의 완료 여부를 판단할 수 있으며, 완료되지 않았을 경우, 단계에서 데이터 판독 주소 및 데이터 기입 주소를 조정한 이후, 돌아가 해석 조작을 실행한다. 일괄 처리가 완료되면, 돌아가 지령 입구에서 수신된 다음 처리 지령을 해석한다. 도3을 통해 알 수 있는바, 프런트 엔드 디코딩 부재는 융통성 있게 외부 처리 지령을 해석하고, 외부 처리 지령 에 따라 처리하고자 하는 데이터, 데이터 판독 주소 및 데이터 기입 주소를 획득하고, 처리하고자 하는 데이터 를 대응되는 처리 부재에 브로드캐스팅하여 처리를 진행함으로써, 해당 프런트 엔드 디코딩 부재를 포함하는 데 이터 수송 부재로 소프트웨어 지령 기반의 융통성 있는 구동을 구현한다. 이어서 도4를 참조하면, 도4는 본 출원의 실시예의 일 선택 가능한 구현의 데이터 수송 부재 중의 처리 부재의 개략적 구성도를 나타낸다. 도4에 도시된 바와 같이, 처리 부재는 데이터 레지스터， 명령 레지스터，상태 머신 및 다중 경로 선택 장치를 포함할 수 있다. 데이터 레지스터는 데이터 대기열에서 처리하고자 하는 데 이터를 판독하고, 명령 레지스터는 명령 대기열에서 조작 명령을 판독하고, 상태 머신은 명령 레지 스터의 명령에 따라 상태 제어를 진행할 수 있으며, 다중 경로 선택 장치는 상태 머신의 제어에 따 라 데이터 레지스터에서 처리하고자 하는 데이터를 선택하여 출력을 진행한다. 데이터 레지스터는 데이터 대기열 중의 처리하고자 하는 데이터를 다중 경로 선택 장치에 순차적으 로 전송할 수 있고, 다중 경로 선택 장치는 이러한 처리하고자 하는 데이터를 캐시할 수 있다. 명령 레지 스터는 명령 대기열 중의 명령을 상태 머신에 순차적으로 전송할 수 있다. 상태 머신은 명령 레지 스터에서 전송되는 조작 명령을 해석하고, 현재 수신된 명령에 따라 다중 경로 선택 장치에 대해 제어를 진행할 수 있다. 구체적으로, 상태 머신은 현재 조작 명령에 따라 다중 경로 선택 장치에 캐시된 그중 한 세트 또는 다수의 세트의 처리하고자 하는 데이터를 게이팅하여 출력을 진행할 수 있다. 예를 들어, 현재 수신 된 조작 명령이 데이터A에 대해 전환을 진행하는 명령일 경우, 상태 머신은 다중 경로 선택 장치에 제어 신호를 출력하여, 다중 경로 선택 장치로 대응되는 데이터A를 게이팅하여 출력을 진행할 수 있다. 상태 머신은 현재 수신된 조작 명령에 대응되는 데이터의 데이터 기입 주소를 산출할 수도 있으며, 구체 적으로, 명령 레지스터에서 처리 지령으로부터 해석하여 획득된 데이터 기입 주소를 수신하고, 수신된 데이터 기입 주소 및 처리 부재에 사전에 설정된 주소 입력 오프셋에 따라, 출력 데이터의 데이터 기입 주소를 산출할 수 있으며, 즉, 처리 부재의 코드에 따라 데이터 기입 주소 오프셋을 확정하고, 상태 머신에 수신된 데이터 기 입 주소에 대해 데이터 기입 주소에 따라 오프셋한 후에 현재 명령에 대응되는 데이터 기입 주소를 획득한다. 또는, 프런트 엔드 디코딩 부재는 처리 부재의 코드에 대응되는 데이터 기입 주소 오프셋에 따라, 현재 명령에 대응되는 출력 데이터의 데이터 기입 주소를 산출할 수 있으며, 상태 머신은 프런트 엔드 디코딩 부재로 컴퓨팅한 현재 명령에 대응되는 출력 데이터의 데이터 기입 주소를 명령 레지스터에서 수신할 수 있다. 상태 머 신은 다중 경로 중재 부재에 데이터 기입 요청을 발송하고, 출력 데이터의 기입 주소를 다중 경로 중재 부재에 발송할 수도 있다. 도5를 참조하면, 도5는 데이터 수송 부재 중의 처리 부재로 실행하는 데이터 처리 조작의 일 개략적 흐름도를 나타낸다. 도5에 도시된 바와 같이, 처리 부재로 실행하는 처리 조작의 흐름은 아래와 같은 단계들을 포함한다. 단계 에서, 명령 레지스터 중의 명령을 해석한다. 구체적으로, 상태 머신은 명령 레지스터에서 조작 명령 을 추출하고, 이어서, 단계에서 조작 명령이 데이터 수송 명령 또는 데이터 전환 명령인지를 판단할 수 있 다. 단계의 판단 결과가 데이터 수송 명령이면, 처리 부재의 코드에 따라, 대응되게 오프셋된 데이터 출력 을 선택하고, 출력 메모리에 대해 기입 요청을 발송하는 단계를 실행하고, 단계의 판단 결과가 데이 터 전환 명령이면, 데이터 전환 명령에 따라 순차적으로 데이터를 출력하고, 출력 메모리에 기입 요청을 발송하 는 단계를 실행한다. 이어서, 데이터 전환 명령이 지향하는 데이터의 기입 완료 여부를 판단하는 단계 를 실행한다. 단계의 판단 결과가 데이터 전환 명령이 지향하는 데이터를 이미 기입 완료한 것이면, 단계로 돌아가 명령 레지스터 중의 다음 명령을 해석할 수 있다. 단계의 판단 결과가 데이터 전환 명 령이 지향하는 데이터를 기입 완료하지 못한 것이면, 단계로 돌아가, 데이터 전환 명령에 따라 순차적으로 데이터를 출력하고, 출력 메모리에 기입 요청을 발송한다. 처리 부재는 대응되는 데이터 기입 주소 오프셋을 사전에 설정할 수 있다. 구체적으로, 처리 부재는 독립적인 코드를 구비할 수 있고, 각 처리 부재는 코드에 따라 그가 처리하는 데이터의 주소가 지령 입구에서 판독된 외부 처리 지령이 지시하는 입력 데이터 주소에 대한 오프셋을 확정할 수 있다. 상술한 단계에서, 처리 부재 는 코드에 따라 대응되게 오프셋된 데이터를 선택하여 출력할 수 있으며, 예컨대, 처리 부재 코드는 C1이고, 이 에 대응되는 오프셋은 4이면, 처리 부재는 입력 데이터 주소에 대한 오프셋이 4인 주소에 저장된 데이터를 선택 하여 출력을 진행할 수 있으며, 이때, 처리 부재에서 출력하는 데이터는 입력 데이터 주소에 대한 오프셋이 4인 주소에 저장된 데이터이다. 처리 부재는 출력 메모리에 대해 기입 요청을 발송할 수 있다. 데이터 전환 명령이 지향하는 처리하고자 하는 데이터는 입력 메모리 중의 일 행의 데이터이고, 각 처리 부재는 그의 코드에 따라 입력 메모리의 일 열의 데이터를 대응되게 처리하며, 이러할 경우, 상술한 단계에서, 처 리 부재는 처리하고자 하는 데이터 중 그의 코드에 대응되는 열의 데이터를 순차적으로 출력할 수 있으며, 단계 에서, 처리하고자 하는 일 행의 데이터에 대한 전환 완료 여부를 판단할 수 있으며, 완료되지 못했을 경우, 단계로 돌아가, 데이터 수송 부재 내의 다수의 처리 부재 중의 다음 처리 부재로 이어서 다음 행의 데이터에 대해 출력을 진행한다. 이때, 처리 부재의 출력 데이터는 입력 메모리 중의 데이터 전환하여 획득한 데이터이다. 처리 부재는 데이터를 출력할 경우, 다중 경로 중재 부재에 기입 요청을 발송할 수 있다. 도6을 참조하면, 도6은 본 출원의 실시예에 따른 일 선택 가능한 구현 중의 데이터 처리 장치 중의 다중 경로 중재 부재의 일 개략적 구성도를 나타낸다. 도6에 도시된 바와 같이, 다중 경로 중재 부재는 적어도 하나의 중재 유닛을 포함할 수 있다. 여기서, 중재 유닛의 수량은 선택 가능하게 데이터 수송 장치 중의 처리 부재의 수량과 동일하다. 각 중재 유닛 은 중재 장치 및 선택 장치를 포함할 수 있다. 중재 장치는 각 데이터 수송 부재 중의 하 나의 처리 부재의 출력 데이터에 대해 중재를 진행하고, 중재 결과에 따라 선택 장치를 제어하여 그중 하 나의 처리 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 선택하여 출력을 진행하며, 출력 메모리에 기입 인에이블 신호를 발송할 수 있다. 본 실시예에 있어서, 데이터 처리 장치가 N(N은 양의 정수임)개의 데이터 수송 부재를 포함한다고 가정하면, 각 중재 유닛은 N개의 데이터 수송 부재 중 각 데이터 수송 부재의 하나의 처리 부재와 연결되며, 즉, 각 중 재 유닛은 N개의 처리 부재의 출력 데이터(도6에 도시된 “기입 데이터”) 및 대응되는 데이터 기입 주소(도6에 도시된 “기입 주소”)를 수신한다. 각 데이터 수송 부재 중의 다수의 처리 부재는 대응되는 다수의 중재 유닛 에 출력 데이터 및 데이터 기입 주소를 전송한다. 구체적으로, 중재 장치는 연결된 Ｎ개의 처리 부재에서 발송 된 기입 요청에 따라 중재를 진행하고, 중재 결과에 따라 선택 장치를 제어하여 입력된 Ｎ개의 처리 부재의 출 력 데이터에서 하나의 처리 부재의 출력 데이터 및 대응되는 데이터 기입 주소를 선택하여 출력 메모리에 전송 할 수 있다. 여기서, 출력 데이터의 데이터 기입 주소는 처리 부재로 그의 코드에 대응되는 데이터 기입 주소 오프셋 및 외 부 처리 지령으로부터 해석하여 획득한 초기 데이터 기입 주소에 따라 산출하여 획득한 것이다. 예시적으로, 데 이터 기입 주소의 오프셋 단계 크기를 2로, 제1 데이터 수송 부재 중의 제1 처리 부재의 코드를 D1로, 처리 지 령으로부터 해석하여 획득한 데이터 기입 주소를 Add1로 사전에 설정할 수 있으며, 이러할 경우, 대응되는 데이 터 기입 주소 오프셋은 2이고, 해당 처리 부재의 출력 데이터의 데이터 기입 주소는 Add1+2로 획득한 주소이다. 본 실시예에 있어서, 선택 장치는 각 데이터 수송 부재의 처리 부재에서 하나의 데이터 수송 부재의 처리 부재 를 선택하고, 선택된 처리 부재의 출력 데이터 및 데이터 기입 주소를 출력 메모리에 전송하고, 출력 메모리에 기입 인에이블 신호를 발송할 수 있다. 출력 메모리는 다중 경로 중재 부재에서 출력하는 기입 인에이블 신호, 출력 데이터 및 대응되는 데이터 기입 주소를 수신하고, 기입 인에이블 신호의 제어 하에 인에이블되어, 출력 데이터를 대응되는 데이터 기입 주소에 기입한다. 대안으로, 출력 메모리는 다중 경로 중재 부재에 기입 응답 신호를 반송할 수도 있고, 다중 경로 중재 부재는 기입 응답 신호를 데이터 수송 부재의 상태 머신에 피드백할 수 있다. 상태 머신은 기입 응답 신호에 따라 대응 되는 명령 레지스터 중의 명령의 상태를 \"이미 완료\"로 전환할 수 있으며, \"이미 완료\" 상태의 명령을 명령 레 지스터에서 삭제할 수도 있다. 명령 레지스터 중 상태가 \"이미 완료\"가 아닌 명령에 대해, 상태 머신은 기정의 명령의 캐시 주기에 따라 명령 레지스터에서 주기적으로 명령을 판독하고, 다중 경로 선택 장치를 제어하여 대 응되는 처리하고자 하는 데이터를 게이팅하여 처리를 진행할 수 있다. 다중 경로 중재 유닛을 이용하여 중재 출력을 진행함으로써, 데이터 전환 및 수송 과정에서 출력 데이터가 질서 있게 메모리에 저장되는 것을 확보함과 동시에 데이터 기입의 속도를 확보하여 데이터 처리 장치의 처리 효율을 향상시킬 수 있다. 본 출원의 실시예는 인공 지능 칩을 더 제공한다. 해당 인공 지능 칩은 상술한 실시예에 설명된 데이터 처리 장 치를 포함할 수 있다. 데이터 처리 장치는 적어도 하나의 입력 메모리，적어도 하나의 데이터 수송 부재，적어 도 하나의 다중 경로 중재 부재 및 적어도 하나의 출력 메모리를 포함한다. 데이터 처리 장치 중의 각 부재의 구성 및 작업 원리는 도1 내지 도5에 도시된 각 실시예 및 선택 가능한 구현의 설명을 참조할 수 있으며, 이에 대한 중복된 설명은 생략하기로 한다. 본 실시예 중의 인공 지능 칩은 심층 학습 트레이닝 및 예비 트레이닝을 상대로, 고 밀도의 컴퓨팅과 액세스 및 저장 요구를 만족할 수 있다. CPU, GPU 등 범용의 프로세서 및 전용의 하드웨어 장치의 데이터 처리 방법으로 심층 학습 정경에서 액세스 및 저장하는 속도 및 융통성에 대한 문제를 해결함으로써, 데이터 처리 효율을 향상 시킬 수 있다. 아래에 도7을 참조하면, 도7은 본 출원의 실시예의 전자 장치를 구현하기에 적합한 컴퓨터 시스템의 개략 적 구성도를 나타낸다. 도7에 도시된 전자 장치는 단지 일 예시일 뿐, 본 출원의 실시예의 기능 및 이용 범위를 한정하기 위한 것이 아니다. 도7에 도시된 바와 같이, 컴퓨터 시스템은 중앙 처리 유닛(701; CPU)을 포함하되, 이는 판독 전용 메모리 장치(702; ROM)에 저장된 프로그램 또는 저장부로부터 랜덤 액세스 메모리 장치(703; RAM)에 로딩된 프로 그램에 의해 각종의 적당한 동작과 처리를 실행할 수 있다. RAM에는 시스템을 작동하기에 필요한 각 종 프로그램 및 데이터가 더 저장되어 있다. CPU는 인공 지능 칩에 지령 및 데이터를 발송하여 데이 터의 처리 및 분석을 진행할 수도 있다. 예컨대, 심층 학습 태스크에 있어서, CPU는 RAM에 로딩된 처리하 고자 하는 데이터 및 통신부를 통해 수신된 외부 처리 지령을 인공 지능 칩에 전송하여 데이터 처리를 실 행할 수 있다. CPU, ROM, RAM 및 인공 지능 칩은 버스를 통해 서로 연결된다. 입력/ 출력(I/O) 포트도 버스에 연결된다. 특히는, 본 출원에 개시된 실시예에 의하면, 흐름도를 참조하여 설명한 상기 과정들은 컴퓨터 소프트웨어 프로 그램으로 구현될 수 있다. 예를 들어, 본출원에 개시된 실시예는 컴퓨터 프로그램 제품을 포함하고, 상기 컴퓨 터 프로그램 제품은 컴퓨터 판독 가능한 매체에 적재된 컴퓨터 프로그램을 포함한다. 해당 컴퓨터 프로그램은 흐름도에 도시된 방법을 실행하기 위한 컴퓨터 코드를 포함한다. 이러한 실시예에 있어서, 해당 컴퓨터 프로그 램은 선택 가능하게 통신부를 경유하여 네트워크로부터 다운로드되어 설치될 수 있고 인공 지능 칩에 로딩 될 수도 있다. 해당 컴퓨터 프로그램이 인공 지능 칩에 의해 실행될 경우, 본 출원의 데이터 처리 장치 중 의 입력 메모리, 데이터 수송 부재, 처리 부재 및 출력 메모리의 상술한 기능이 실행된다. 첨부된 도면 중의 흐름도 및 블록도는 본 출원의 각 실시예에 따른 시스템, 방법 및 컴퓨터 프로그램 제품의 구 현 가능한 체계구조, 기능 및 조작을 도시하였음을 이해할 수 있을 것이다. 이러한 방면에서, 흐름도 또는 블록 도 중의 각 블록은 하나의 모듈, 프로그램 세그먼트 또는 코드의 일부분을 대표할 수 있고, 해당 모듈, 프로그 램 세그먼트 또는 코드의 일부분은 규정된 로직 기능을 구현하기 위한 하나 또는 다수의 실행 가능한 명령을 포 함한다. 일부 대체 구현에 있어서, 블록에 표기된 기능들은 첨부된 도면에 표기된 순서와 다른 순서로 발생할 수도 있음을 유의하여야 한다. 예를 들어, 순차적으로 표시된 두 개의 블록은 실제로 거의 동시에 실행될 수 있 고, 경우에 따라 반대된 순서에 따라 실행될 수도 있으며, 이는 관련된 기능에 따라 결정된다. 블록도 및/또는 흐름도 중의 각 블록 및 블록도 및/또는 흐름도 중의 블록들의 조합은 규정된 기능 또는 조작을 실행하는 하드 웨어 기반의 전용 시스템으로 구현되거나, 전용 하드웨어와 컴퓨터 명령의 조합으로 구현될 수 있음을 유의하여 야 한다. 이상의 설명은 단지 본 출원의 비교적 바람직한 실시예 및 운용한 기술적 원리에 대한 설명이다. 본 출원에 관 련된 발명의 범위가 상기 기술적 특징들의 특정 조합으로 이루어진 기술적 방안들에 한정되는 것이 아니라 본 발명의 주지를 벗어나지 않고서 상기 기술적 특징들 또는 그들의 균등한 특징들의 임의의 조합으로 이루어진 기"}
{"patent_id": "10-2019-0082973", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "타 기술적 방안들도 포함되어야 함을 해당 기술분야의 당업자는 이해하여야 한다. 예를 들어, 상기 특징들과 본 출원에 개시되어 있으나 이에 한정되지 않는 유사한 기능을 구비한 기술적 특징을 서로 대체하여 이루어진 기술 적 방안도 포함된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2019-0082973", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 출원의 기타 특징, 과제 및 이점들은 아래의 첨부된 도면들을 참조하여 진행한 비 한정적인 실시예들에 대한 상세한 설명으로부터 명확해 질 것이다. 도1은 본 출원의 실시예에 따른 데이터 처리 장치의 일 개략적 구성도이다. 도2는 본 출원의 실시예에 따른 데이터 처리 장치 중의 데이터 수송 부재의 일 개략적 구성도이다. 도3은 데이터 수송 부재 중의 프런트 엔드 디코딩 부재로 실행하는 조작의 일 개략적 흐름도이다. 도4는 데이터 수송 부재 중의 처리 부재의 개략적 구성도이다. 도5는 데이터 수송 부재 중의 처리 부재로 실행하는 데이터 처리 조작의 개략적 흐름도이다. 도6은 본 출원의 실시예에 따른 데이터 처리 장치 중의 다중 경로 중재 부재의 일 개략적 구성도이다. 도7은 본 출원의 실시예를 구현하기 위한 전자 장치에 적합한 컴퓨터 시스템의 개략적 구성도이다."}
