{"patent_id": "10-2021-0187250", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0088193", "출원번호": "10-2021-0187250", "발명의 명칭": "운동가이드장치 및 운동가이드방법", "출원인": "주식회사 에이치엔에이치", "발명자": "김유두"}}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메모리; 및유저를 촬영한 촬영이미지를 복수 개 획득하며, 상기 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출하고, 상기 근육 부피 변화에 기초하여 유저의 운동동작에 대한 피드백정보를 제공하는 제어부를 포함하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 복수 개의 촬영이미지 각각에서의 스켈레톤 포인트를 식별하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는,상기 스켈레톤 포인트 중 적어도 두 개의 스켈레톤 포인트를 연결하는 가상의 제1라인을 기준으로, 상기 유저의신체의 경계선을 잇는 가상의 제2라인의 길이 변화에 기초하여 상기 근육 부피 변화를 산출하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 제어부는,상기 복수 개의 촬영이미지 각각에서의 관심영역을 설정하고 상기 관심영역에서의 근육이 차지하는 면적에 기초하여 상기 근육 부피 변화를 산출하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는,상기 스켈레톤 포인트에 기초하여 관심영역을 설정하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제어부는,학습된 인공지능 모델을 이용하여 상기 복수 개의 촬영이미지 각각에서의 유저의 신체 중 적어도 일부의 부피변화를 산출하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1에 있어서,상기 제어부는,공개특허 10-2023-0088193-3-상기 부피 변화의 산출을 위해 획득된 부피에 관한 좌표값을 상기 메모리에 저장하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제어부는,상기 복수 개의 촬영이미지 각각에서 식별된 스켈레톤 포인트에 기초하여 상기 근육 부피 변화의 산출을 트리거링하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제어부는,정확한 운동 자세와 부정확한 운동 자세 각각에서의 촬영이미지로부터 스켈레톤 포인트를 식별하고, 식별된 스켈레톤 포인트에 기초하여 상기 근육 부피 변화의 산출을 트리거링하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 제어부는,타유저의 운동동작과 상기 유저의 운동동작을 비교하되, 상기 타유저의 근육 부피 변화 및 상기 유저의 근육 부피 변화를 비교함으로써 피드백정보를 생성하는, 운동가이드장치."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "운동가이드장치에 의해 수행되는 운동가이드방법으로서,유저를 촬영한 촬영이미지를 복수 개 획득하는 단계;상기 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출하는 단계; 및상기 근육 부피 변화에 기초하여 유저의 운동동작에 대한 피드백정보를 제공하는 단계를 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 운동가이드방법은,상기 복수 개의 촬영이미지 각각에서의 스켈레톤 포인트를 식별하는 단계를 더 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 근육 부피 변화를 산출하는 단계는,상기 스켈레톤 포인트 중 적어도 두 개의 스켈레톤 포인트를 연결하는 가상의 제1라인을 기준으로, 상기 유저의신체의 경계선을 잇는 가상의 제2라인의 길이 변화에 기초하여 상기 근육 부피 변화를 산출하는 단계를 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 근육 부피 변화를 산출하는 단계는,상기 복수 개의 촬영이미지 각각에서의 관심영역을 설정하고 상기 관심영역에서의 근육이 차지하는 면적에 기초공개특허 10-2023-0088193-4-하여 상기 근육 부피 변화를 산출하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 근육 부피 변화를 산출하는 단계는,상기 스켈레톤 포인트에 기초하여 상기 관심영역을 설정하는 단계를 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 근육 부피 변화를 산출하는 단계는,학습된 인공지능 모델을 이용하여 상기 복수 개의 촬영이미지 각각에서의 유저의 신체 중 적어도 일부의 부피변화를 산출하는 단계를 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 운동가이드방법은,상기 부피 변화의 산출을 위해 획득된 부피에 관한 좌표값을 저장하는 단계를 더 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 피드백정보를 제공하는 단계는,타유저의 운동동작과 상기 유저의 운동동작을 비교하되, 상기 타유저의 근육 부피 변화 및 상기 유저의 근육 부피 변화를 비교함으로써 피드백정보를 생성하는 단계를 포함하는, 운동가이드방법."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 기재된 방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록 매체."}
{"patent_id": "10-2021-0187250", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "운동가이드장치에 의해 수행되며, 제11항에 기재된 방법을 수행하기 위해 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "운동가이드장치 및 운동가이드방법을 제시하며, 일 실시예에 따른 운동가이드장치는, 메모리, 및 유저를 촬영한 촬영이미지를 복수 개 획득하며, 상기 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출하고, 상기 근육 부피 변화에 기초하여 유저의 운동동작에 대한 피드백정보를 제공하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은, 운동가이드장치 및 운동가이드방법에 관한 것으로, 보다 상세하게는 유저 를 촬영한 촬영이미지를 기반으로 유저의 운동을 가이드하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사회전반에 걸쳐 건강관리 및 체형관리를 위한 운동에 관한 수요가 점차 늘어나고 있다. 따라서 최근에는 많은 사람들이 다양한 종류의 헬스기구들을 이용하거나 맨몸을 이용하여 헬스 트레이닝을 하고 있다. 이때, 잘못된 방식으로 트레이닝을 하는 것은 매우 비효율적일 뿐 아니라 오히려 건강을 해칠 수 있다. 따라서, 트레이닝을 할 때 적절한 가이드가 필요하다. 한편 최근 들어 홈 트레이닝이 유행하면서 많은 사람들은 가정에서도 트레이닝을 하고 있다. 다만 가정에서 트 레이닝을 하게 되면 유저가 잘못된 방식으로 운동하더라도 해당 방식이 잘못됨을 발견하기가 어렵다는 문제점이 있다. 또한 헬스클럽이나 피트니스센터에서 트레이닝을 하게 되면 전문가인 헬스 트레이너의 가이드를 받을 수 있으나, 헬스 트레이너별로 그 실력이 천차만별이어서 적절한 가이드를 받기 어려운 경우가 생긴다는 문제점이 있다. 더구나 전문 헬스 트레이너의 수는 운동자에 비해 적기 때문에 유저가 헬스 트레이너의 도움을 언제나 받을 수 없다는 문제점도 있다. 한편 한국 공개특허 제10-2021-0128564호 '홈트레이닝 시스템'에 따르면, 사용자의 신체 부위에 밀착되어 상기 신체 부위를 지지하는 지지부와, 상기 지지부의 회전 각도를 측정하는 측정부와, 상기 신체 부위에 신경지배근 전기 자극(NMES)을 주거나 자극에 대한 근전도(EMG) 반응을 감지하기 위한 위치를 가변적으로 선택할 수 있는 전극부를 포함하여 신체 부위의 회전 각도와 근전도 반응을 측정하여 전송하는 웨어러블 장치, 상기 웨어러블 장치에서 측정된 신체 부위의 회전 각도와 근전도 반응을 표준 데이터와 비교하여 사용자에게 운동 정확성을 제 공하는 사용자 전자 장치, 및 상기 사용자 전자 장치에 표준 데이터를 제공하는 운동 프로그램 추천 서버를 포 함하는 홈트레이닝 시스템에 대해 제시한다. 상술한 선행 기술은 홈트레이닝 시스템에 관한 새로운 기능을 제시하나, 홈트레이닝 시스템을 구현함에 있어, 근전도 반응을 감지하기 위한 웨어러블 장치 등과 같이 추가적인 기기를 필요로 하고 있고, 그에 따라 홈 트레 이닝에 드는 비용이 증가하는 문제점이 있다. 따라서 상술한 문제점을 해결하고, 운동하는 유저의 만족도를 보다 향상시키기 위한 새로운 차원의 기능이 필요 하게 되었다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "한편, 전술한 배경기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서에서 개시되는 실시예들은, 운동가이드장치 및 운동가이드방법을 제시하는 데 목적이 있다. 본 명세서에서 개시되는 실시예들은, 최소한의 리소스로 유저의 운동을 가이드하는 장치 및 방법을 제시하는데 목적이 있다. 본 명세서에서 개시되는 실시예들은, 세밀하고 정확한 피드백정보를 제공함으로써 유저의 운동을 가이드하는 장 치 및 방법을 제시하는데 목적이 있다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 일 실시예에 따르면, 메모리, 및 유저를 촬영한 촬영 이미지를 복수 개 획득하며, 상기 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출하고, 상기 근육 부 피 변화에 기초하여 유저의 운동동작에 대한 피드백정보를 제공하는 제어부를 포함할 수 있다. 다른 실시예에 따르면, 운동가이드장치에 의해 수행되는 운동가이드방법으로서, 유저를 촬영한 촬영이미지를 복 수 개 획득하는 단계, 상기 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출하는 단계, 및 상기 근육 부피 변화에 기초하여 유저의 운동동작에 대한 피드백정보를 제공하는 단계를 포함할 수 있다. 또 다른 실시예에 따르면, 운동가이드방법을 수행하는 프로그램이 기록된 컴퓨터 판독 가능한 기록 매체로서, 상기 운동가이드방법은, 유저를 촬영한 촬영이미지를 복수 개 획득하는 단계, 상기 복수 개의 촬영이미지에 기 초하여 근육 부피 변화를 산출하는 단계, 및 상기 근육 부피 변화에 기초하여 유저의 운동동작에 대한 피드백정 보를 제공하는 단계를 포함할 수 있다. 또 다른 실시예에 따르면, 운동가이드장치에 의해 수행되며, 운동가이드방법을 수행하기 위해 매체에 저장된 컴 퓨터 프로그램으로서 상기 운동가이드방법은, 유저를 촬영한 촬영이미지를 복수 개 획득하는 단계, 상기 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출하는 단계, 및 상기 근육 부피 변화에 기초하여 유저의 운동 동작에 대한 피드백정보를 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 과제 해결 수단 중 어느 하나에 의하면, 운동가이드장치 및 운동가이드방법을 제시할 수 있다. 또한, 전술한 과제 해결 수단 중 어느 하나에 의하면, 최소한의 리소스로 유저의 운동을 가이드하는 장치 및 방 법을 제시할 수 있다. 또한, 전술한 과제 해결 수단 중 어느 하나에 의하면, 세밀하고 정확한 피드백정보를 제공함으로써 유저의 운동 을 가이드하는 장치 및 방법을 제시할 수 있다. 개시되는 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "른 효과들은 아래의 기재로부터 개시되는 실시예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 다양한 실시예들을 상세히 설명한다. 아래에서 설명되는 실시예들은 여러 가지 상이한 형태로 변형되어 실시될 수도 있다. 실시예들의 특징을 보다 명확히 설명하기 위하여, 이하의 실시"}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예들이 속하는 기술분야에서 통상의 지식을 가진 자에게 널리 알려져 있는 사항들에 관해서 자세한 설명은 생략 하였다. 그리고, 도면에서 실시예들의 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부 분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 구성이 다른 구성과 \"연결\"되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경우뿐 아니라, '그 중간에 다른 구성을 사이에 두고 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성이 어떤 구성을 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한, 그 외 다른 구성을 제외하는 것이 아니라 다른 구 성들을 더 포함할 수도 있음을 의미한다. 이하 첨부된 도면을 참고하여 실시예들을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 운동가이드장치를 설명하기 위한 구성도이며, 도 2는 일 실시예에 따른 운동가이드장 치를 도시한 블록도이다. 운동가이드장치는 유저가 운동을 할 때 유저의 모습을 촬영한 촬영이미지를 획득하고, 해당 촬영이미지를 분석함으로써, 운동하는 유저가 해당 운동에서 요구되는 자세를 정확히 수행하는지를 평가하고 그에 따른 피드 백을 제공할 수 있다. 이러한 운동가이드장치는, 도 1에서 도시된 바와 같이 전자단말 및 서버로 구성될 수 있으며 전자단말 및 서버는 네트워크(N)를 통해 통신할 수 있다. 관련하여 전자단말은 네트워크(N)를 통해 원격지의 서버에 접속하거나, 타 단말 및 서버와 연결 가능한 컴 퓨터나 휴대용 단말기, 텔레비전, 웨어러블 디바이스(Wearable Device) 등으로 구현될 수 있다. 여기서, 컴퓨터 는 예를 들어, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop)등을 포함하고, 휴 대용 단말기는 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, PCS(Personal Communication System), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), GSM(Global System for Mobile communications), IMT(International Mobile Telecommunication)- 2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet), 스마트폰(Smart Phone), 모바일 WiMAX(Mobile Worldwide Interoperability for Microwave Access) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 또한, 텔레비전은 IPTV(Internet Protocol Television), 인터넷 TV(Internet Television), 지 상파 TV, 케이블 TV 등을 포함할 수 있다. 나아가 웨어러블 디바이스는 예를 들어, 시계, 안경, 액세서리, 의복, 신발 등 인체에 직접 착용 가능한 타입의 정보처리장치로서, 직접 또는 다른 정보처리장치를 통해 네트워 크를 경유하여 원격지의 서버에 접속하거나 타 단말과 연결될 수 있다. 그리고 서버는, 유저와의 인터랙션을 위한 애플리케이션이나 웹브라우저가 설치된 전자단말과 네트워크 (N)를 통해 통신이 가능한 컴퓨터로 구현되거나 클라우드 컴퓨팅 서버로 구현될 수 있다. 또한, 서버는 데이터 를 저장할 수 있는 저장장치를 포함하거나 제 3의 서버를 통해 데이터를 저장할 수 있다. 상술된 바와 같이, 운동가이드장치는 서버-클라이언트 시스템으로 구현되어 운동가이드장치를 구성하 는 구성부는 전자단말 또는 서버 상에서 구현될 수 있으나, 운동가이드장치는 전자단말로만으로 구현되거나 서버만으로도 구현될 수 있다. 이러한 운동가이드장치는 도 2를 참조하면, 입출력부, 제어부, 통신부 및 메모리를 포함할 수 있다. 입출력부는 유저로부터 입력을 수신하기 위한 입력부와, 작업의 수행 결과 또는 운동가이드장치의 상 태 등의 정보를 표시하기 위한 출력부를 포함할 수 있다. 예를 들어, 입출력부는 유저 입력을 수신하는 조 작 패널(operation panel) 및 화면을 표시하는 디스플레이 패널(display panel) 등을 포함할 수 있다. 구체적으로, 입력부는 키보드, 물리 버튼, 터치 스크린, 카메라 또는 마이크 등과 같이 다양한 형태의 유저 입 력을 수신할 수 있는 장치들을 포함할 수 있다. 또한, 출력부는 디스플레이 패널 또는 스피커 등을 포함할 수 있다. 다만, 이에 한정되지 않고 입출력부는 다양한 입출력을 지원하는 구성을 포함할 수 있다. 제어부는 운동가이드장치의 전체적인 동작을 제어하며, CPU, GPU 등과 같은 프로세서를 포함할 수 있 다. 제어부는 입출력부를 통해 수신한 유저 입력에 대응되는 동작을 수행하도록 운동가이드장치(10 0)에 포함된 다른 구성들을 제어할 수 있다. 예를 들어, 제어부는 메모리에 저장된 프로그램을 실행시키거나, 메모리에 저장된 파일을 읽어 오거나, 새로운 파일을 메모리에 저장할 수도 있다. 실시예에 따르면 제어부는 촬영이미지를 획득하여 획득된 촬영이미지에 기초하여 피드백정보를 생성하고 제공할 수 있다. 이를 위해 제어부는, 운동하고 있는 유저의 모습이 나타난 촬영이미지를, 입출력부 를 통해 획득하거나, 후술될를 통해 외부의 장치(미도시)로부터 획득할 수 있다. 더욱이 제어부는 유 저의 움직임에 따른 변화를 판단하기 위해 촬영이미지를 복수 개 획득할 수 있다. 상술된 바와 같이 복수 개의 촬영이미지를 획득한 제어부는 복수 개의 촬영이미지에 기초하여 근육의 부피 변화를 산출할 수 있다. 일 실시예에 따르면 제어부는 학습된 인공지능 모델을 이용하여 복수 개의 촬영이미지 각각에서의 유저의 신체 중 적어도 일부의 부피 변화를 산출할 수 있다. 즉, 제어부는 운동 부위의 변화를 산출하기 위해, 촬영이미지 내에서 해당 운동 부위를 에워싸는 2차원 또 는 3차원의 바운딩 박스를 산출할 수 있고, 해당 바운딩 박스의 넓이 또는 부피를 산출함으로써 해당 촬영이미 지 내에서의 신체의 부피를 산출해낼 수 있다. 그리고 복수 개의 촬영이미지에서 산출된 부피를 비교함으로써 근육의 부피 변화를 산출할 수 있다. 관련하여 '운동 부위'는 설명의 편의상, 유저의 운동에 따라 자극이 되는 유저의 신체 부위를 지칭하며, 해당 부위의 근육 부피가 늘거나 줆에 따라 해당 부위에 적절한 자극이 주어졌다 고 판단될 수 있다. 예를 들어 제어부는, 촬영이미지를 입력하였을 때 촬영이미지 내에서 부피 측정의 대상이 되는 운동 부위 를 2차원으로 디텍션(detection)하도록 학습된 인공지능 모델을 이용하여, 촬영이미지 내에서 사람의 몸을 디텍 션할 수 있다. 관련하여 인공지능 모델은 예를 들어, 텐서플로우 객체 디텍션(TensorFlow Object Detection) 등 으로 구현될 수 있다. 제어부가 촬영이미지 내에서 디텍션을 통해 2차원으로 크롭(crop)하면, 크롭된 이미 지를 에워싸는 3차원의 바운딩 박스를 추정할 수 있다. 또 다른 예를 들자면, 제어부는 다중 작업 학습 접근 방식(multi-task learning approach)을 이용하여 디 텍션 및 회귀(regression)를 통해, 객체로서의 운동 부위의 모양을 예측할 수 있다. 디텍션 작업을 위해 제어부 는, 주석(annotation)이 달린 바운딩 박스를 이용하고, 바운딩 박스의 도심(centroid)의 중심으로 하고, 바운딩 박스의 사이즈에 비례하는 표준 편차로, 바운딩 박스에 대해 가우시안(Gaussian)을 피팅(fitting)할 수 있다. 이를 통해 제어부는 객체의 중심 위치를 나타내는 피크(peak) 분포를 예측할 수 있다. 회귀 작업은, 바운딩 박스의 8개의 정점의 2차원 투영을 추정하고, 포즈 추정 알고리즘(EPnP; Efficient Perspective-n- Point Camera Pose Estimation)을 활용하여 3차원의 바운딩 박스의 최종 좌표를 획득할 수 있다. 상술된 바에 따라 제어부는 운동 부위를 에워싸는 바운딩 박스를 산출하면 바운딩 박스의 넓이 또는 부피 를 연산함으로써 운동 부위의 부피를 산출할 수 있다. 예를 들어, 제어부는 촬영이미지 내에서의 '허벅 지'를 크롭하고 '허벅지'를 에워싸는 3차원의 바운딩 박스를 산출하면, 제어부는 바운딩 박스의 부피를 연 산함으로써 '허벅지'의 부피를 산출할 수 있다. 따라서 제어부는, 예를 들어 유저를 촬영한 촬영영상을 구성하는 촬영이미지 프레임 각각에 대해 3차원의 바운딩 박스를 산출할 수 있고, 시간의 흐름에 따른 바운딩 박스의 부피 변화를 산출하여 근육의 부피 변화를 산출할 수 있다. 또한 제어부가 학습된 인공지능 모델을 이용하여 복수 개의 촬영이미지 각각에서의 유저의 신체 중 적어도 일부의 부피 변화를 산출함에 있어, 유저의 3차원 이미지를 입력하였을 때 해당 이미지 내에서의 유저의 신체 표면의 3차원 좌표값을 산출하도록 학습된 인공지능 모델을 이용할 수 있다. 그에 따라 시간의 흐름에 따른 근 육의 부피 변화를, 3차원 좌표값의 차이를 통해 산출할 수 있다. 또 다른 실시예에 따르면 제어부는 촬영이미지가 3차원의 이미지로 획득되면 촬영이미지 내에서의 유저의 신체 중 적어도 일부의 부피를 산출할 수 있고 그에 따라 시간의 흐름에 따른 부피 변화를 산출할 수 있다. 예 를 들어 촬영이미지 획득 시 스캔데이터를 함께 획득하면 제어부는 신체 표면 상에 위치한 버텍스로서 각 버텍스에 관한 3차원의 위치 좌표값을 획득할 수 있고, 해당 좌표값에 기초하여 부피를 산출하며 시간의 흐름에 따른 부피의 변화를 좌표값의 차이를 통해 산출할 수 있다. 다른 실시예에 따르면 제어부는 촬영이미지에서의 스켈레톤 포인트 중 적어도 두 개의 스켈레톤 포인트를 연결하는 가상의 제1라인을 기준으로, 유저의 신체 경계선을 잇는 가상의 제2라인의 길이 변화에 기초하여 운동 부위의 근육 부피 변화를 산출할 수 있다. 이를 위해 제어부는 촬영이미지에서 스켈레톤 포인트(skeleton point)를 산출할 수 있다. 예를 들어, 입출력부 또는 운동가이드장치가 통신하는 외부 장치(미도시)는 3차원 카메라 장치로 구 현될 수 있으며, 3차원 카메라 장치는 예를 들어 적외선 카메라의 중심점을 원점으로 하여 객체(유저)를 3차원 으로 표시하는데, 이때 깊이 센서는 반사된 레이저 빔 포인트로 각 픽셀간 거리를 측정하여 유저를 인식할 수 있다. 이러한 3차원 카메라 장치는, 예를 들어. 키넥트 카메라(Kinect camera), 라이다 스캐너(LiDAR sensor), ToF(Time of Flight), 3차원 깊이 카메라(3D In depth camera), 웹 캠(Web CAM), 3차원 인뎁스 카메라(3D In depth camera) 등을 포함할 수 있으나, 이에 한정되는 것은 아니며, 운동을 실시하는 유저를 촬영한 영상으로부 터 3차원 스켈레톤 포인트(x, y, z 축의 위치 값)를 획득하는 임의의 장치면 모두 가능하다. 또한 예를 들어, 입출력부 또는 운동가이드장치가 통신하는 외부 장치(미도시)는 2차원 카메라 장치 로 구현될 수 있으며, 예를 들어, 전자단말에 내장된 카메라 장치 등으로 구현될 수 있다. 2차원 카메라 장 치를 통해 촬영이미지가 획득되면, 제어부는 2차원 촬영이미지에서 2차원의 스켈레톤 포인트(x,y축의 위치 값)을 획득할 수 있고, 또는, 2차원의 촬영이미지에서 3차원의 스켈레톤 포인트(x, y, z 축의 위치 값)를 획득 할 수 있다. 2차원의 촬영이미지에서 3차원의 스켈레톤 포인트를 획득하기 위해, 제어부는 예를 들어 2차 원 포인트에 대해 확장성 템포럴 콘볼루션(dilated temporal convolution) 기반의 풀리 콘볼루셔널 모델(fully convolutional model)을 적용하여 3차원의 스켈레톤 포인트를 산출할 수 있다. 이처럼 스켈레톤 포인트를 산출하면 제어부는 일 스켈레톤 포인트와 다른 스켈레톤 포인트를 연결한 가상 의 제1라인을 결정할 수 있고, 가상의 제1라인에 대해 수직의 선분으로서 양 끝점이 유저의 신체 경계선에 위치 하는 가상의 제2라인의 길이를 산출할 수 있다. 이처럼 각 촬영이미지에서의 제2라인의 길이를 산출하면, 제어 부는 제2라인의 길이 변화를 통해 근육 부피 변화를 산출할 수 있으며, 예를 들어 직전 시간의 촬영이미지 에서의 제2라인의 길이보다 현재 시간의 촬영이미지에서의 제2라인의 길이가 더 길면 제어부는 직전 시간 의 촬영이미지에 비해 현재 시간의 촬영이미지에서의 근육의 부피가 늘었다고 판단할 수 있다. 관련하여 도 3은 본 명세서에 개시된 운동가이드장치를 설명하기 위한 예시도로서, 근육의 부피 변화를 산 출하는 것을 설명하기 위한 도면이다. 도 3의 (a) 및 (b) 각각은 촬영이미지로서 시간의 흐름에 따라 유저가 팔을 폈다가 접는 동작을 수행함에 따라, 제어부는 도 3의 (a) 및 도 3의 (b) 각각을 순차적으로 획득함을 가정한다. 도 3의 (a)에서 도시된 바와 같이, 제어부는 스켈레톤 포인트(301, 302)를 산출할 수 있고 스켈레톤 포인 트(301, 302)를 잇는 가상의 제1라인을 설정할 수 있다. 그리고 제어부는 제1라인에 대해 수직 이면서 양 끝점(321, 322)이 신체와 배경의 경계선에 위치하는 선분인 가상의 제2라인을 설정할 수 있다. 관련하여 제1라인에 대해 수직인 선분이 여러 개 존재할 수 있는데 선분 중에서 가장 긴 길이를 갖는 선분 을 제2라인으로 결정할 수 있고, 그에 따라 제어부는, 촬영이미지에서 제2라인의 길이를 산출할 수 있다. 또한 제2라인을 산출하는 상술된 방법에 따라 제어부는 도 3의 (b)의 촬영이미지에서 제2라인의 길이 를 산출할 수 있다. 그리고 제어부는 제2라인과 제2라인의 길이 각각을 비교함으로써 근육 부피 변화를 산출할 수 있다. 즉 제어부는 제2라인의 길이와, 제2라인의 길이 차에 대응되는 부피의 차이를 산출할 수 있는데, 예를 들어, 제2라인의 길이보다 제2라인의 길이가 길면 그 길이의 차의 제곱을 부피의 차이 로 산출하고 제어부는 유저의 운동 부위의 근육이 늘어났다고 판단할 수 있다. 한편 다른 실시예에 따르면 제어부는 촬영이미지의 관심영역 내에서 근육이 차지하는 면적에 기초하여 근 육 부피 변화를 산출할 수 있다. 이를 위해 제어부는 촬영이미지 내에서 관심영역을 식별할 수 있다. 관심영역은 예를 들어, 인공지능 모델 을 기반으로 설정되거나, 촬영이미지 내에서의 소정 좌표값의 갖는 영역으로 설정될 수 있다. 즉, 제어부는 상술된 실시예에 따라 스켈레톤 포인트가 식별되면, 스켈레톤 포인트를 기준으로 소정의 반 경 내의 영역을 관심영역으로 식별할 수 있다. 예를 들어 어깨 관절에 대응되는 스켈레톤 포인트를 기준으로, 소정의 반경 내의 영역을 관심영역으로 설정할 수 있다. 또는 제어부는 예를 들어, 신체와 배경 간의 경계선을 식별하도록 학습된 인공지능 모델을 이용하여, 촬영 이미지 내에서의 관심영역을 식별할 수 있다. 이때, 인공지능 모델은 CNN(Convolution Neural Network), RNN(Recurrent Neural Network) 등으로 구현될 수 있으나 이에 제한되는 것은 아니다. 따라서 신체와 배경 간의 경계선을 식별하면, 해당 경계선을 구성하는 일 지점을 중심으로 소정의 반경 내의 영역을 관심영역으로 식별할 수 있다. 또한 제어부는 촬영이미지 내에서 소정의 좌표값을 기준으로 관심영역을 설정할 수 있다. 예를 들어, 관심 영역은 소정의 중심점과 반경을 갖는 원형 형상의 영역으로 설정되거나, 소정의 중심점(또는 꼭지점)과, 넓이 및 폭을 갖는 박스 형상의 영역으로 설정될 수 있으며 그에 따라 중심점(또는 꼭지점)에 관한 좌표값과, 넓이 또는 폭의 좌표값이 기설정되어, 촬영이미지를 획득하였을 때 기설정된 값에 따라 촬영이미지에서의 관심영역을 제어부는 설정할 수 있다. 이러한 관심영역의 좌표값은, 운동 부위에 따라 기설정될 수 있다. 상술된 바에 따라 관심영역이 설정되면 제어부는 관심영역을 내에서의 근육이 차지하는 면적의 변화를 토 대로 근육의 부피 변화를 산출할 수 있다. 예를 들어 일 촬영이미지에서의 관심영역 내의 근육이 차지하는 면적 과, 다른 촬영이미지에서의 관심영역 내의 근육이 차지하는 면적을 비교하고, 비교 결과에 따른 면적의 증감에 따라 부피의 변화를 결정할 수 있다. 이를 위해 일 촬영이미지에서의 관심영역과, 다른 촬영이미지에서의 관심 영역의 크기는 동일할 수 있고, 이미지 내에서의 좌표(예를 들어 관심영역의 중심점의 좌표)가 동일할 수 있다. 따라서 예를 들어 비교결과에 따른 면적이 증가하면 제어부는 근육 부피가 변화하였다고 판단하면서 운동 부위의 근육 부피가 증가하였다고 판단할 수 있다. 관련하여 도 4는 본 명세서에 개시된 운동가이드장치를 설명하기 위한 예시도로서, 근육의 부피 변화를 산 출하는 것을 설명하기 위한 도면이다. 도 4의 (a) 및 (b) 각각은 촬영이미지로서 시간의 흐름에 따라 유저가 팔을 폈다가 접는 동작을 수행함에 따라, 제어부는 도 4의 (a) 및 도 4의 (b) 각각을 순차적으로 획득함을 가정한다. 도 4 (a)에서 도시된 바와 같이, 제어부는 촬영이미지 내에서의 관심영역을 설정할 수 있다. 예를 들 어, 제어부는 유저의 팔과, 배경 간의 경계선의 일 지점을 중점으로 에워싸는 박스를 관심영역으로 설정하거나, 유저의 어깨를 나타내는 스켈레톤 포인트를 기준으로 좌측에 위치한 일 좌표를 중심으로, 소정의 반경 내의 영역을 관심영역으로 설정할 수 있다. 마찬가지로 제어부는 도 4의 (a)에서의 관심영역 과 동일한 위치의 관심영역을 도 4의 (b)에서 도시된 바와 같이 설정할 수 있다. 그리고 제어부(12 0)는 관심영역(410, 420) 각각에서의 근육이 차지하는 면적(또는 관심영역 내에서 차지하는 비율)을 산출하여 근육 부피 변화가 있는지를 판단하고 부피 변화가 있다면 부피 변화가 발생되는 운동 부위에 자극이 있다고 판 단할 수 있다. 상술된 바와 같이 관심영역을 결정하고 관심영역 내에서의 근육의 부피 변화를 판단하기 위해, 실시예에 따르면 제어부는 관심영역과 관련된 스켈레톤 포인트를 추적할 수 있다. 예를 들어 일 촬영이미지에서의 관심영역 이 설정되면 제어부는 해당 관심영역 주변의 스켈레톤 포인트를 결정하고, 후속하여 획득되는 다른 촬영이 미지에서의 해당 스켈레톤 포인트를 추적함으로써, 일 촬영이미지에서의 관심영역과 비교 가능한 관심영역을 획 득할 수 있다.상술된 바에 따라 근육의 부피 변화를 산출함에 있어, 근육의 표면(또는 신체의 표면)을 3차원의 버텍스로 구현 하는 3차원의 좌표값을 획득하면 제어부는 3차원의 좌표값을 저장할 수 있고, 저장된 3차원의 좌표값은, 추후, 스켈레톤 포인트와 함께 유저의 아바타를 구현하는데 이용할 수 있다. 이처럼 근육의 부피 변화가 산출되면, 제어부는 근육 부피 변화에 기초하여 유저의 운동동작에 대한 피드 백정보를 제공할 수 있다. 이때 피드백정보는, 유저의 운동 자세를 분석한 분석정보, 그리고, 분석에 따라 유저에게 요구되는 개선사항에 관한 지시정보 중 적어도 하나를 포함할 수 있다. 즉 분석정보는 유저가 수행하는 운동 자세에서 유저의 자세가 문제가 있다고 판단되면 해당 문제점을 설명하는 정보가 될 수 있으며, 예를 들어, 스쿼트 자세에서 허리를 세 우고 있지 않다면 허리를 세우고 있지 않음을 알리는 정보를 포함할 수 있다. 또한 지시정보는 유저로 하여금 특정 자세로 수정할 것을 요구하는 정보로서 예를 들어 스쿼트 자세에서 허리를 세우도록 요청하는 정보를 포함 할 수 있다. 피드백정보는 음성, 영상, 또는 시각적 표시 중 어느 하나의 형태로 제공될 수 있다. 예를 들어, 음성을 통해 자세를 수정할 것을 요청할 수 있고, 또는 바른 운동 자세에 대해 설명하는 영상을 제공할 수 있으며, 또한 전 자단말의 화면을 통해 표시되는 색상을 변화시킴으로써 유저로 하여금 운동 자세가 문제가 있고 이를 교정 해야 할 필요성을 느끼게 할 수 있다. 운동 종류별 자극이 되는 운동 부위가 존재하는데, 제어부는 해당 근육 부위의 부피 변화를 통해 해당 근 육이 운동되고 있는지를 판단하고 그에 따라 피드백정보를 생성할 수 있다. 이를 위해 제어부는 운동 종류 별 근육의 부피 변화가 예상되는 신체부위에 관한 정보가 저장된 메모리를 참조하여, 유저의 근육 부피 변 화에 따라 피드백정보를 생성할 수 있다. 예를 들어, '덤벨컬' 수행 시 부피 변화가 예상되는 부위는 상완이두근인데, 제어부는 '덤벨컬'을 수행하 는 유저의 상완이두근이 올바르게 자극되는지 여부를 어깨에서부터 팔꿈치까지의 유저의 근육 부피 변화를 통해 판단할 수 있고, 운동이 수행될 때마다 부피 변화가 존재한다면 올바르게 운동이 되어있다고 판단하고 유저에게 격려하는 피드백정보를 제공할 수 있으나, 부피 변화가 존재하지 않는다거나 존재하더라도 부피 변화의 정도가 적다면 덤벨컬이 올바르게 수행되고 있지 않다고 판단하고 해당 운동이 제대로 수행되고 있지 않음을 알리는 분 석정보, 또는 올바른 자세를 코칭하는 지시정보를 포함하는 피드백정보를 제공할 수 있다. 또한 제어부는 타유저의 운동동작과 유저의 운동동작을 비교하되, 타유저의 근육 부피 변화 및 유저의 근 육 부피 변화를 비교함으로써 피드백정보를 생성할 수 있다. 예를 들어 제어부는 전문가 또는 인플루언서 등 타유저의 운동동작에 따른 근육의 부피 변화를 산출하고, 해당 타유저의 근육 부피 변화와 유저의 근육 부피 변화를 비교하여 유저가 올바른 자세로 운동하는지에 관한 피드백정보를 제공할 수 있다. 따라서, 예를 들어, 특정 운동에 따른 운동부위의 부피 변화량이 타유저와 유저가 서로 상이하다면, 제어부는 유저에게 올바른 자세로 운동할 것을 코칭하는 피드백정보를 제공할 수 있다. 또한 예를 들어, 특정 운동에 따른 운동부위의 부 피 변화량이 타유저와 유저가 동일하거나 차이가 소정의 범위 내라면, 제어부는 유저에게 올바르게 운동하 고 있음을 알리는 피드백정보를 제공할 수 있다. 추가로, 제어부는 스켈레톤 포인트에 기초하여 피드백정보를 생성할 수 있다. 즉 촬영이미지로부터 제어부는 2차원의 스켈레톤 포인트(x, y 축의 위치 값) 또는 3차원의 스켈레톤 포인 트(x, y, z 축의 위치 값)를 획득하고, 그로부터 유저 신체의 관절 위치정보에 따라 유저의 움직임을 확인하거 나, 유저의 움직임이 발생한 관절의 각도를 확인할 수 있다. 예를 들어 정확한 운동 자세에 대응되는 관절 및/ 또는 관절의 각도를, 유저의 관절 및/또는 관절의 각도와 비교함으로써, 제어부는 스켈레톤 포인트에 기초 하여 피드백정보를 생성할 수 있다. 도 5에서 도시된 바와 같이, '스쿼트' 동작을 수행하는 유저를 촬영한 촬영이미지에서, 제어부는 스켈레톤 포인트(501 내지 512)를 복수개 산출할 수 있고. 스켈레톤 포인트 간의 위치정보에 따라 관절의 각도를 확인함 으로써, 유저의 스쿼트 동작이 바람직한 동작인지 여부를 판단하여 피드백정보를 생성할 수 있다. 한편 제어부는 복수 개의 촬영이미지 각각에서 식별된 스켈레톤 포인트에 기초하여 근육 부피 변화를 산출 을 트리거링할 수 있다. 즉, 제어부는 유저의 운동 모습을 촬영한 촬영이미지를 획득하고, 획득된 촬영이미지에 기초하여 식별된 스켈레톤 포인트에 기초하여 피드백정보를 제공하다가, 복수 개의 촬영이미지 각각에서 식별된 스켈레톤 포인트가 소정의 조건을 만족하면 근육 부피 변화를 통해 피드백정보를 생성하는 프로세스를 트리거링할 수 있다. 그 에 따라 제어부는 운동에 매칭되는 운동 부위(예를 들어 주 운동 부위)의 근육 부피 변화를 산출할 수 있 다. 예를 들어, 운동 종류에 따라 스켈레톤 포인트의 위치 변화가 크지 않음이 기설정된 경우, 제어부는 근육 부피 변화를 산출할 필요가 있다고 판단하고 근육 부피 변화의 산출을 트리거링할 수 있다. 예를 들자면 비복근, 가자미근 등을 자극하는 종아리 운동을 수행하는 유저의 동작에서, 시간의 흐름에 따른 유저의 무릎과 발목 간의 위치 이동이 크지 않은데 이러한 운동에 대해서는 제어부는 근육 부피 변화를 산출할 필요가 있 다고 판단하고 근육 부피 변화의 산출을 트리거링할 수 있다. 그에 따라 제어부는 종이라의 근육 부피 변 화를 산출할 수 있다. 또한 예를 들어, 정확한 운동 자세와 부정확한 운동 자세 각각에서의 촬영이미지를 획득하고, 각 촬영이미지로 부터 스켈레톤 포인트를 식별하였을 때 스켈레톤 포인트의 위치 변화가 크지 않다고 판단된 운동에 대해서는 제 어부는 근육 부피 변화를 산출할 필요가 있다고 판단할 수 있다. 또한 예를 들어, 스켈레톤 포인트에 기초하여 피드백정보를 제공하던 제어부는 소정의 기간 동안 동일한 피드백정보를 제공하게 되면, 근육 부피 변화의 산출을 트리거링할 수 있고, 이를 통해 스켈레톤 포인트에 따라 생성된 피드백정보가 정확한지를, 근육의 부피 변화를 산출함으로써 검증할 수 있다. 보다 구체적으로 예를 들 자면, 스켈레톤 포인트에 기초하여 유저가 정확한 자세로 운동하고 있다고 판단하는 정보가 포함된 피드백정보 를 생성한 제어부는, 해당 운동으로 인해 자극되는 운동 부위의 근육 부피 변화를 산출하고 근육의 부피 변화가 있다고 판단되면 해당 피드백정보가 정확하다고 판단할 수 있고, 또는 부피 변화가 없다면 해당 피드백 정보에 오류가 있다고 판단하고 해당 피드백정보를 업데이트할 수 있다. 관련하여 도 6 및 도 7은 일 실시예에 따른 운동가이드장치를 설명하기 위한 예시도로서, 바른 자세 또는 잘못된 자세로 운동했을 때 운동가이드장치의 동작을 설명하기 위한 도면이다. 도 6 및 도 7에서 도시된 바와 같이, '랫 풀다운(lat pull-down)'의 운동을 하고 있는 유저를 촬영한 촬영이미 지를 토대로 제어부는 피드백정보를 생성할 수 있다. 관련하여 도 6은 유저가 허리를 아치로 세우고 바른 자세로 랫 풀다운을 수행한 모습을 촬영한 촬영이미지를 도시한 것이며, 도 7은 유저가 허리에 힘을 주지 않은 상태에서 랫 풀다운을 수행한 모습을 촬영한 촬영이미지를 도시한 것이다. 도 6에서 도시된 바와 같이, 제어부는 스켈레톤 포인트(610, 620, 630, 640, 650)를 산출할 수 있으며, 또 한 도 7에서 도시된 바와 같이 스켈레톤 포인트(710, 720, 730, 740, 750)를 산출할 수 있다. 랫 풀다운의 동작 의 특성 상, 손잡이를 잡아당겼을 때의 스켈레톤 포인트와 손잡이를 풀 때의 스켈레톤 포인트의 위치 변화량이 크지 않고, 허리를 세울 때와 세우지 않았을 때의 스켈레톤 포인트 간의 위치 차이가 크지 않다. 따라서 도 6에 도시된 바와 같이 유저가 바른 자세로 랫 풀다운을 수행할 때의 스켈레톤 포인트(610, 620, 630, 640, 650)와, 유저가 허리에 힘을 주지 않은 상태로 랫 풀다운을 수행했을 때의 스켈레톤 포인트(710, 720, 730, 740, 750) 각각의 위치 차이가 크지 않다. 따라서 스켈레톤 포인트를 기반으로 유저의 자세를 분석하고 피드백정보를 제공 하게 된다면 제어부는 정확한 분석 결과를 제공해주기 어렵다. 다만 근육의 부피 변화 산출이 트리거링되 어 제어부가 부피 변화를 산출하면 근육 부피 변화에 기초하여 피드백정보를 생성할 수 있다. 즉 제어부 는 랫 풀다운의 운동 부위인 광배근 위치에서의 부피 변화를 분석함으로써 유저가 바른 자세로 운동을 수 행하는지 여부를 판단할 수 있다. 이를 위해 제어부는 스켈레톤 포인트(610, 620, 630, 640)를 잇는 사각 형 내에 위치한 관심영역을 설정할 수 있고, 관심영역에서의 부피 변화를 분석한 제어부는 유저 가 허리를 아치로 세우고 바른 자세로 운동하고 있음을 판단할 수 있고 그에 따라 긍정적인 피드백정보를 제공 할 수 있다. 반면 관심영역과 동일하게 설정된 관심영역에서의 근육의 부피 변화를 분석하고, 관심영역에서 부피 변화가 없음을 감지하면, 제어부 는 유저가 허리를 굽힌 상태에서 바르지 않은 자세로 운동하고 있음 을 판단할 수 있고 그에 따라 허리를 아치형으로 펼 것을 요청하는 지시정보를 포함한 피드백정보를 제공할 수 있다. 참고로 상술된 도 6 내지 도 7에 관한 설명에서는 근육의 부피 변화를 산출함에 있어 관심영역을 이용하나, 앞 서 설명한 바에 따른 실시예에 따라 근육 부피 변화를 산출하는 여러 방법들에 의해 제어부는 광배근 위치 에서의 근육의 부피 변화를 산출할 수 있다. 스켈레톤 포인트만으로 유저의 운동을 분석하는 종래 기술에 따르면, 예를 들어, 이두근 운동 시, 어깨와 팔꿈 치의 스켈레톤 포인트가 변경되지 않아, 운동 부위로서 이두근이 적절히 운동되고 있는지를 판단하기 어려운데 본 명세서에 개시되는 실시예에 따르면 유저의 움직임에 따른 근육의 부피 변화를 분석함으로써 운동을 통해 운 동 효과를 누리고자 하는 부위가 적절히 운동되고 있는지를 확인할 수 있다. 한편 다시 도 2로 돌아오면, 통신부는 다른 디바이스 또는 네트워크와 유무선 통신을 수행할 수 있다. 이 를 위해, 통신부는 다양한 유무선 통신 방법 중 적어도 하나를 지원하는 통신 모듈을 포함할 수 있다. 예 를 들어, 통신 모듈은 칩셋(chipset)의 형태로 구현될 수 있다. 통신부가 지원하는 무선 통신은, 예를 들어 Wi-Fi(Wireless Fidelity), Wi-Fi Direct, 블루투스 (Bluetooth), UWB(Ultra Wide Band) 또는 NFC(Near Field Communication) 등일 수 있다. 또한, 통신부가 지원하는 유선 통신은, 예를 들어 USB 또는 HDMI(High Definition Multimedia Interface) 등일 수 있다. 메모리에는 파일, 어플리케이션 및 프로그램 등과 같은 다양한 종류의 데이터가 설치 및 저장될 수 있다. 제어부는 메모리에 저장된 데이터에 접근하여 이를 이용하거나, 또는 새로운 데이터를 메모리에 저장할 수도 있다. 또한, 제어부는 메모리에 설치된 프로그램을 실행할 수도 있다. 도 2를 참조하면, 메모리에는 운동 가이드를 수행하기 위한 방법을 수행하는 프로그램이 설치될 수 있다. 일 실시예에 따르면, 입출력부를 통해 쵤영이미지를 획득하면, 제어부는 메모리에 저장된 프로 그램을 실행시켜 운동가이드방법을 수행한다. 도 8은 일 실시예에 따른 운동가이드방법을 설명하기 위한 순서도이다. 도 8에 도시된 실시예에 따른 운동가이드방법은 도 1 내지 도 7에 도시된 운동가이드장치에서 시계열적으 로 처리되는 단계들을 포함한다. 따라서, 이하에서 생략된 내용이라고 하더라도 도 1 내지 도 7에 도시된 운동 가이드장치에 관하여 이상에서 기술한 내용은 도 8에 도시된 실시예에 따른 운동가이드방법에도 적용될 수 있다. 도 8에서 도시된 바와 같이 운동가이드장치는 촬영이미지를 획득할 수 있다(S810). 유저의 운동에 따른 움 직임이 실시간으로 촬영되는 촬영영상을 구성하는 프레임 각각을, 운동가이드장치는 촬영이미지로서 획득 할 수 있다. 그리고 운동가이드장치는 복수 개의 촬영이미지에 기초하여 근육 부피 변화를 산출할 수 있다(S820). 이에 앞서, 운동가이드장치는 촬영이미지 각각에서의 스켈레톤 포인트를 식별할 수 있다. 따라서 예를 들 어, 스켈레톤 포인트만으로 유저에게 정확한 피드백정보를 제공하기 어렵다고 판단되면 근육 부피 변화의 산출 을 트리거링할 수 있다. 운동가이드장치는 운동 부위의 근육 부피 변화를 산출할 수 있다. 예를 들어, 운동가이드장치는 스켈레톤 포인트 중 적어도 두 개의 스켈레톤 포인트를 연결하는 가상의 제1 라인을 기준으로, 유저의 신체의 경계선을 잇는 가상의 제2라인의 길이 변화에 기초하여 근육 부피 변화를 산출 할 수 있다. 또한 예를 들어, 운동가이드장치는 복수 개의 촬영이미지 각각에서의 관심영역을 설정하고 관심영역에서의 근육이 차지하는 면적에 기초하여 근육 부피 변화를 산출할 수 있고 이때 스켈레톤 포인트에 기초하여 관심영역 을 설정할 수 있다. 또한 예를 들어, 운동가이드장치는 학습된 인공지능 모델을 이용하여 복수 개의 촬영이미지 각각에서의 유 저의 신체 중 적어도 일부의 부피 변화를 산출할 수 있다. 상술된 바에 따라 산출된 근육 부피 변화에 기초하여 운동가이드장치는 유저의 운동동작에 대한 피드백정 보를 생성할지 여부를 판단(S830)할 수 있다. 예를 들어 유저의 운동동작을 교정할 필요가 없다고 판단하면 피 드백정보를 새롭게 생성하지 않을 수도 있다. 판단결과(S830) 피드백정보가 생성되면 운동가이드장치는 피 드백정보를 제공할 수 있다(S840). 상술된 실시예에 따른 운동가이드방법에 따라 피드백정보를 제공받은 유저는 자신의 운동동작에 관한 보다 정확 한 피드백을 받을 수 있어 운동 시 운동의 효과를 극대화시킬 수 있다. 이상의 실시예들에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field programmable gate array) 또는 ASIC 와 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구 성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프 로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램특허 코드의 세그먼트들, 드라이버들, 펌웨어, 마 이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구 성요소들과 '~부'들로부터 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU 들을 재생시키도록 구현될 수도 있다. 도 8을 통해 설명된 실시예에 따른 운동가이드방법은 컴퓨터에 의해 실행 가능한 명령어 및 데이터를 저장하는, 컴퓨터로 판독 가능한 매체의 형태로도 구현될 수 있다. 이때, 명령어 및 데이터는 프로그램 코드의 형태로 저 장될 수 있으며, 프로세서에 의해 실행되었을 때, 소정의 프로그램 모듈을 생성하여 소정의 동작을 수행할 수 있다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발 성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터로 판독 가능한 매체는 컴퓨터 기록 매체일 수 있는데, 컴퓨터 기록 매체는 컴퓨터 판독 가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함할 수 있다. 예를 들어, 컴퓨터 기록 매체는 HDD 및 SSD 등과 같은 마그네틱 저장 매체, CD, DVD 및 블루레이 디스크 등과 같은 광학적 기록 매체, 또는 네트워크를 통해 접근 가능한 서버에 포함되는 메모 리일 수 있다. 또한 도 8을 통해 설명된 실시예에 따른 운동가이드방법은 컴퓨터에 의해 실행 가능한 명령어를 포함하는 컴퓨 터 프로그램(또는 컴퓨터 프로그램 제품)으로 구현될 수도 있다. 컴퓨터 프로그램은 프로세서에 의해 처리되는 프로그래밍 가능한 기계 명령어를 포함하고, 고레벨 프로그래밍 언어(High-level Programming Language), 객체 지향 프로그래밍 언어(Object-oriented Programming Language), 어셈블리 언어 또는 기계 언어 등으로 구현될 수 있다. 또한 컴퓨터 프로그램은 유형의 컴퓨터 판독가능 기록매체(예를 들어, 메모리, 하드디스크, 자기/광학 매체 또는 SSD(Solid-State Drive) 등)에 기록될 수 있다. 따라서 도 8을 통해 설명된 실시예에 따른 운동가이드방법은 상술한 바와 같은 컴퓨터 프로그램이 컴퓨팅 장치 에 의해 실행됨으로써 구현될 수 있다. 컴퓨팅 장치는 프로세서와, 메모리와, 저장 장치와, 메모리 및 고속 확 장포트에 접속하고 있는 고속 인터페이스와, 저속 버스와 저장 장치에 접속하고 있는 저속 인터페이스 중 적어 도 일부를 포함할 수 있다. 이러한 성분들 각각은 다양한 버스를 이용하여 서로 접속되어 있으며, 공통 머더보 드에 탑재되거나 다른 적절한 방식으로 장착될 수 있다. 여기서 프로세서는 컴퓨팅 장치 내에서 명령어를 처리할 수 있는데, 이런 명령어로는, 예컨대 고속 인터페이스 에 접속된 디스플레이처럼 외부 입력, 출력 장치상에 GUI(Graphic User Interface)를 제공하기 위한 그래픽 정 보를 표시하기 위해 메모리나 저장 장치에 저장된 명령어를 들 수 있다. 다른 실시예로서, 다수의 프로세서 및 (또는) 다수의 버스가 적절히 다수의 메모리 및 메모리 형태와 함께 이용될 수 있다. 또한 프로세서는 독립적인 다수의 아날로그 및(또는) 디지털 프로세서를 포함하는 칩들이 이루는 칩셋으로 구현될 수 있다. 또한 메모리는 컴퓨팅 장치 내에서 정보를 저장한다. 일례로, 메모리는 휘발성 메모리 유닛 또는 그들의 집합으 로 구성될 수 있다. 다른 예로, 메모리는 비휘발성 메모리 유닛 또는 그들의 집합으로 구성될 수 있다. 또한 메 모리는 예컨대, 자기 혹은 광 디스크와 같이 다른 형태의 컴퓨터 판독 가능한 매체일 수도 있다. 그리고 저장장치는 컴퓨팅 장치에게 대용량의 저장공간을 제공할 수 있다. 저장 장치는 컴퓨터 판독 가능한 매 체이거나 이런 매체를 포함하는 구성일 수 있으며, 예를 들어 SAN(Storage Area Network) 내의 장치들이나 다른 구성도 포함할 수 있고, 플로피 디스크 장치, 하드 디스크 장치, 광 디스크 장치, 혹은 테이프 장치, 플래시 메 모리, 그와 유사한 다른 반도체 메모리 장치 혹은 장치 어레이일 수 있다."}
{"patent_id": "10-2021-0187250", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상술된 실시예들은 예시를 위한 것이며, 상술된 실시예들이 속하는 기술분야의 통상의 지식을 가진 자는 상술된 실시예들이 갖는 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하 다는 것을 이해할 수 있을 것이다. 그러므로 상술된 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마 찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다.본 명세서를 통해 보호 받고자 하는 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어 지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태를 포함 하는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0187250", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 운동가이드장치를 설명하기 위한 구성도이다. 도 2는 일 실시예에 따른 운동가이드장치를 도시한 블록도이다. 도 3 내지 도 7은 일 실시예에 따른 운동가이드장치를 설명하기 위한 예시도이다. 도 8은 일 실시예에 따른 운동가이드방법을 설명하기 위한 순서도이다."}
