{"patent_id": "10-2013-0082435", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0007862", "출원번호": "10-2013-0082435", "발명의 명칭": "데이터 제공을 제어하는 휴대 단말 및 방법", "출원인": "삼성전자주식회사", "발명자": "강원도"}}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휴대 단말의 데이터 제공 방법에 있어서,이벤트에 대응하여 수신 또는 발생된 정보를 분석하는 과정과,상기 분석된 정보를 상기 휴대 단말의 사용자에게 제공하기 위한 모듈을 선택하는 과정과,상기 선택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구성하여 제공하는 과정을 포함하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 선택된 모듈을 통해 상기 사용자로부터 정보 요청이 입력되는 경우, 상기 입력된 요청에 해당되는 응답에대응되는 데이터를 구성하여 상기 선택된 모듈을 통해 상기 사용자에게 제공하는 과정을 더 포함하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 분석 과정은 상기 수신 또는 발생된 이벤트에서 키워드를 추출하는 과정을 포함하는 것을 특징으로 하는데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 데이터는 상기 추출된 키워드를 통해 상기 사용자에게 의인화되어 제공되도록 구성되는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 이벤트는 상기 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 모듈은 상기 이벤트를 상기 사용자에게 제공하기 위한 모듈로서, 상기 이벤트의 종류에 따라 서로 다른 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2015-0007862-2-제6 항에 있어서,상기 모듈은 상기 사용자로부터 입력된 요청에 해당되는 응답을 위해 구성되는 데이터를 의인화하여 상기 사용자에게 제공하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 모듈은 음성 통화 모듈, 영상 통화 모듈, 문자 메시지 모듈, 팝업 창 모듈 및 이메일 모듈 중 적어도 하나를 포함하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 상기 모듈은 상기 수신된 이메일 또는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 이벤트가 상기 휴대 단말의 배터리 잔량 부족 발생인 경우, 상기 모듈은 상기 배터리의 잔량을 추출하여데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 이벤트가 콜 수신인 경우, 상기 모듈은 상기 콜을 송신한 사용자 이름 및 휴대 단말의 전화번호 중 적어도하나의 추출에 대응하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도하나를 통해 상기 사용자에게 의인화하여 제공하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "휴대 단말의 데이터 제공 방법에 있어서,이벤트 수신을 감지하여 인공지능 엔진을 활성화하는 과정과,사용자로부터 정보 요청이 입력되는 경우, 상기 활성화된 인공지능 엔진을 통해 상기 입력된 요청을 분석하고,상기 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성하는 과정과,상기 이벤트를 수신한 모듈을 통해 상기 구성된 데이터를 제공하는 과정을 포함하는 것을 특징으로 하는 데이터제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 이벤트는 상기 사용자로부터 수신되는 콜 및 메시지 중 적어도 하나를 포함하는 것을 특징으로 하는 데이공개특허 10-2015-0007862-3-터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 이벤트가 상기 콜 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 음성을 통해서 상기 요청을 분석하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서,상기 이벤트가 상기 메시지 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 메시지의 텍스트를통해서 상기 요청을 분석하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12 항에 있어서,상기 인공지능 엔진은 상기 분석된 요청에 대한 응답을 기 저장된 정보로부터 추출하거나 또는 상기 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 의인화되도록 상기 데이터를 구성하여 상기 사용자에게 제공하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12 항에 있어서,상기 인공지능 엔진은 상기 요청에 해당되는 응답을 음성, 영상 또는 메시지를 이용하여 상기 사용자에게 의인화하여 제공하도록 상기 데이터를 구성하는 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12 항에 있어서,상기 모듈은 상기 이벤트를 수신하는 모듈로서, 상기 이벤트의 종류에 따라 서로 다른 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제12 항에 있어서,상기 인공지능 엔진은 상기 휴대 단말에 구비되며, 음성 통화, 영상 통화 및 메시지 송수신 중 적어도 하나를통해 상기 사용자와 통신 가능한 것을 특징으로 하는 데이터 제공 방법."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "데이터를 제공하는 휴대 단말에 있어서,사용자에게 제공되기 위한 이벤트를 수신하는 송수신부와,상기 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고, 상기 분석된 정보를 제공하기 위한 모듈을 선공개특허 10-2015-0007862-4-택하고, 상기 선택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구성하여, 상기 송수신부를 통해 출력 제어하는 제어부를 포함하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20 항에 있어서,상기 제어부는 상기 선택된 모듈을 통해 상기 사용자로부터 정보 요청이 입력되는 경우, 상기 입력된 요청에 해당되는 응답에 대응되는 데이터를 의인화되도록 구성하여 상기 선택된 모듈을 통해 상기 사용자에게 제공하는것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제20 항에 있어서,상기 제어부는 상기 수신 또는 발생된 정보에서 키워드를 추출하여 상기 사용자에게 의인화되어 제공되도록 데이터를 구성하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제20 항에 있어서,상기 이벤트는 상기 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제20 항에 있어서, 상기 모듈은 상기 이벤트를 상기 사용자에게 제공하기 위한 모듈로서, 상기 이벤트의 종류에 따라 서로 다른 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제20 항에 있어서,상기 모듈은 음성 통화 모듈, 영상 통화 모듈, 문자 메시지 모듈, 팝업 창 모듈 및 이메일 모듈 중 적어도 하나를 포함하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제20 항에 있어서,상기 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 상기 제어부는 상기 수신된 이메일 또는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 의인화되도록 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "공개특허 10-2015-0007862-5-제20 항에 있어서,상기 이벤트가 상기 휴대 단말의 배터리 잔량 부족 발생인 경우, 상기 제어부는 상기 배터리의 잔량을 추출하여데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제20 항에 있어서,상기 이벤트가 콜 수신인 경우, 상기 제어부는 상기 콜을 송신한 사용자 이름 및 휴대 단말의 전화번호 중 적어도 하나의 추출에 대응하여 데이터를 의인화되도록 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제20 항에 있어서,상기 사용자로부터 정보 요청이 입력되는 경우, 상기 제어부는 인공지능 엔진을 활성화하여 상기 입력된 요청을분석하고, 상기 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제29 항에 있어서,상기 인공지능 엔진은 상기 분석된 요청에 대한 응답을 기 저장된 정보로부터 추출하거나 또는 상기 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 상기 사용자에게 의인화하여 제공하는 것을 특징으로하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제29 항에 있어서,상기 이벤트가 콜 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 음성을 통해서 상기 요청을분석하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제29 항에 있어서,상기 이벤트가 메시지 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 메시지의 텍스트를 통해서 상기 요청을 분석하는 것을 특징으로 하는 휴대 단말."}
{"patent_id": "10-2013-0082435", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제29 항에 있어서,상기 인공지능 엔진은 상기 요청에 해당되는 응답을 음성, 영상 또는 메시지를 이용하여 상기 사용자에게 의인화하여 제공하도록 상기 데이터를 구성하는 것을 특징으로 하는 휴대 단말.공개특허 10-2015-0007862-6-청구항 34 제20 항에 있어서,상기 제어부는 인공지능 엔진을 이용하여 상기 데이터가 의인화되도록 구성하는 것을 특징으로 하는 휴대 단말.명 세 서기 술 분 야본 발명은 휴대 단말에 관한 것으로서, 특히 데이터 제공을 제어하는 휴대 단말 및 방법에 관한 것이다. [0001]배 경 기 술최근 휴대 단말에서 제공하는 다양한 서비스 및 부가 기능들은 점차 확대되고 있다. 이러한 휴대 단말의 효용 [0002]가치를 높이고 사용자들의 다양한 욕구를 만족시키기 위해서 휴대 단말에서 실행 가능한 다양한 애플리케이션들이 개발되고 있다. 이에 따라 최근 스마트 폰, 휴대폰, 노트 PC 및 태블릿 PC와 같은 이동이 가능하고, 터치 스크린을 가지는 휴대 단말 내에는 적어도 수 개에서 수백 개의 애플리케이션들이 저장될 수 있다.이와 같이, 휴대 단말은 사용자의 욕구를 충족하기 위해 음성 통화 서비스 뿐만 아니라 데이터 통신 서비스를 [0003]이용한 다양한 멀티 미디어 서비스를 제공하는 멀티미디어 장치로 발전하고 있으며, 이러한 휴대 단말의 확산으로 인해 사용자들은 시간과 장소의 구애를 받지 않고 휴대 단말을 사용할 수 있다. 그런데, 종래 휴대 단말은 사용자와 통신에 있어서 단지 팝업 또는 특정 페이지 형태의 정보를 제공하는 수준이 [0004]다. 이와 같이, 팝업 형태 또는 애플리케이션 내에서 사용자 요청에 의한 경우만 정보를 제공하기 때문에 친근성이 떨어진다. 따라서, 사용자와 보다 친숙하고 의사 소통뿐만 아니라 데이터 송수신을 제공하는 의인화된 휴대 단말의 필요성이 제기된다.발명의 내용해결하려는 과제따라서, 휴대 단말을 의인화하고 사용자에게 친숙함을 제공할 수 있는 정보 제공을 통해 사용자 경험을 제공하 [0005]는 필요성이 요구된다.과제의 해결 수단따라서 본 발명은 데이터 제공을 제어하는 휴대 단말 및 방법을 제공한다. [0006]또한, 본 발명은 휴대 단말에 사람과 의사소통을 제공하는 인공지능 엔진을 탑재하여 사람과 자연스러운 의사소 [0007]통 뿐만 아니라 데이터 송수신을 제공한다.상술한 바를 달성하기 위해 본 발명은 휴대 단말의 데이터 제공 방법에 있어서, 이벤트에 대응하여 수신 또는 [0008]발생된 정보를 분석하는 과정과, 상기 분석된 정보를 상기 휴대 단말의 사용자에게 제공하기 위한 모듈을 선택하는 과정과, 상기 선택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구성하여 제공하는 과정을 포함한다.바람직하게, 본 발명은 상기 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 상기 입력된 요청에 [0009]해당되는 응답에 대응되는 데이터를 구성하여 상기 선택된 모듈을 통해 상기 사용자에게 제공하는 과정을 더 포함한다.바람직하게, 본 발명에 따른 데이터는 상기 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. [0010]바람직하게, 본 발명에 따른 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배 [0011]터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다.바람직하게, 본 발명에 따른 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 모듈은 상기 수신된 이메일 [0012]또는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다.공개특허 10-2015-0007862-7-바람직하게, 본 발명에 따른 이벤트가 휴대 단말의 배터리 잔량 부족 발생인 경우, 모듈은 상기 배터리의 잔량 [0013]을 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다.바람직하게, 본 발명에 따른 이벤트가 콜 수신인 경우, 모듈은 상기 콜을 송신한 사용자 이름 및 휴대 단말의 [0014]전화번호 중 적어도 하나의 추출에 대응하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다.또한, 상술한 바를 달성하기 위해 본 발명은 휴대 단말의 데이터 제공 방법에 있어서, 이벤트 수신을 감지하여 [0015]인공지능 엔진을 활성화하는 과정과, 사용자로부터 정보 요청이 입력되는 경우, 상기 활성화된 인공지능 엔진을통해 상기 입력된 요청을 분석하고, 상기 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성하는 과정과,상기 이벤트를 수신한 모듈을 통해 상기 구성된 데이터를 제공하는 과정을 포함한다.바람직하게, 본 발명에 따른 이벤트는 사용자로부터 수신되는 콜 및 메시지 중 적어도 하나를 포함한다. [0016]바람직하게, 본 발명에 따른 이벤트가 콜 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 음성 [0017]을 통해서 상기 요청을 분석한다.바람직하게, 본 발명에 따른 이벤트가 메시지 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 [0018]메시지의 텍스트를 통해서 상기 요청을 분석한다.바람직하게, 본 발명에 따른 인공지능 엔진은 상기 분석된 요청에 대한 응답을 기 저장된 정보로부터 추출하거 [0019]나 또는 상기 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 상기 사용자에게 제공한다.바람직하게, 본 발명에 따른 인공지능 엔진은 상기 휴대 단말에 구비되며, 음성 통화, 영상 통화 및 메시지 송 [0020]수신 중 적어도 하나를 통해 상기 사용자와 통신 가능하다.또한, 상술한 바를 달성하기 위해 본 발명은 데이터를 제공하는 휴대 단말에 있어서, 사용자에게 제공되기 위한 [0021]이벤트를 수신하는 송수신부와, 상기 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고, 상기 분석된정보를 제공하기 위한 모듈을 선택하고, 상기 선택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구성하여, 상기 송수신부를 통해 출력 제어하는 제어부를 포함한다.바람직하게, 본 발명에 따른 제어부는 상기 수신 또는 발생된 정보에서 키워드를 추출하여 상기 사용자에게 제 [0022]공되도록 데이터를 구성한다.바람직하게, 본 발명에 따른 이벤트는 상기 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수 [0023]신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다.바람직하게, 본 발명은 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 제어부는 상기 수신된 이메일 또 [0024]는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 상기 구성된 데이터를음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다.바람직하게, 본 발명은 이벤트가 상기 휴대 단말의 배터리 잔량 부족 발생인 경우, 제어부는 상기 배터리의 잔 [0025]량을 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를통해 상기 사용자에게 제공하다.바람직하게, 본 발명은 이벤트가 콜 수신인 경우, 제어부는 상기 콜을 송신한 사용자 이름 및 휴대 단말의 전화 [0026]번호 중 적어도 하나의 추출에 대응하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다.바람직하게, 본 발명은 사용자로부터 정보 요청이 입력되는 경우, 상기 제어부는 인공지능 엔진을 활성화하여 [0027]상기 입력된 요청을 분석하고, 상기 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성한다.발명의 효과본 발명에 따르면, 휴대 단말에 사람과 의사소통을 제공하는 인공지능 엔진을 탑재하여 사람과 자연스러운 의사 [0028]소통뿐만 아니라 데이터 송수신을 제공함으로써 휴대 단말에 좀더 친근함과 애착감을 가질 수 있고 즐거운 사용자 경험을 제공할 수 있다.공개특허 10-2015-0007862-8-도면의 간단한 설명도 1은 본 발명의 일 실시 예에 따른 휴대 단말을 나타내는 개략적인 블록도. [0029]도 2는 본 발명의 일 실시 예에 따른 휴대 단말의 전면 사시도를 나타낸 도면.도 3은 본 발명의 일 실시 예에 따른 휴대 단말의 후면 사시도를 나타낸 도면.도 4는 본 발명의 실시 예에 따른 입력 유닛과 터치 스크린의 내부 단면도를 나타낸 도면.도 5는 본 발명의 실시 예에 따른 입력 유닛을 나타낸 블럭도.도 6은 본 발명의 실시 예에 따른 휴대 단말의 데이터 제공 방법을 나타낸 순서도.도 7은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 방법을 나타낸 순서도.도 8은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 예시도.도 9는 본 발명의 실시 예에 따른 휴대 단말에 콜이 수신되는 경우 데이터를 제공하는 방법을 나타낸 순서도.도 10은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해데이터를 제공하는 방법을 나타낸 순서도.도 11a는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 문자 메시지를 통해 사용자에게 데이터를 제공하는 예시도.도 11b는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우의 예시도.도 11c는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 이메일을 통해 사용자에게 데이터를제공하는 예시도.도 12는 본 발명의 다른 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을통해 데이터를 제공하는 방법을 나타낸 순서도.발명을 실시하기 위한 구체적인 내용본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 [0030]여 상세하게 설명한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다.제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 [0031]들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다.본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 [0032]아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다.다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 [0033]속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인의미로 해석되지 않는다.이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예에 대한 동작 원리를 상세히 설명한다. 하기에서 본 [0034]공개특허 10-2015-0007862-9-발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 사용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다.먼저, 본 발명에서 사용되는 용어의 정의는 다음과 같다. [0035]휴대 단말: 휴대 가능하고 데이터 송수신과 음성 및 영상 통화가 가능한 이동 단말로서 적어도 하나의 터치 스 [0036]크린이 구비될 수 있다. 이러한, 휴대 단말은 스마트 폰, 태블릿 PC, 3D-TV, 스마트 TV, LED TV, LCD TV등을 포함하며 이외도 주변 기기 또는 원거리에 위치한 다른 단말과 통신할 수 있는 모든 단말을 포함한다.입력 유닛: 터치 스크린상의 접촉 또는 호버링과 같은 비접속 상태에서도 휴대 단말에 명령 또는 입력을 제공할 [0037]수 있는 전자펜, 및 스타일러스 펜 중 적어도 하나를 포함한다.객체: 휴대 단말의 터치 스크린상에 디스플레이되거나, 디스플레이될 수 있는 것으로서, 문서, 위젯, 사진, 지 [0038]도, 동영상, 이메일, SMS 메시지 및 MMS 메시지 중 적어도 하나를 포함하며 입력 유닛에 의해 실행, 삭제,취소, 저장 및 변경될 수 있다. 이러한, 객체는 단축 아이콘, 썸네일 이미지 및 휴대 단말에서 적어도 하나의객체를 저장하고 있는 폴더를 포괄하는 의미로도 사용될 수 있다.단축 아이콘: 각각의 애플리케이션 또는 휴대 단말에서 기본적으로 제공되는 통화, 연락처, 메뉴 등의 빠른 실 [0039]행을 위해 휴대 단말의 터치 스크린상에 디스플레이되는 것으로서, 이를 실행하기 위한 명령 또는 입력이 입력되면 해당 애플리케이션을 실행한다. 도 1은 본 발명의 일 실시 예에 따른 휴대 단말을 나타내는 개략적인 블록도이다. [0040]도 1을 참조하면, 휴대 단말(100)은 이동 통신 모듈(120), 서브통신 모듈(130), 커넥터(165), 및 이어폰 연결잭 [0041](167) 중 적어도 하나를 이용하여 외부 장치(도시되지 아니함)와 연결될 수 있다. 이러한, 외부 장치는 상기 휴대 단말(100)에 탈착되어 유선으로 연결 가능한 이어폰(Earphone), 외부 스피커(External speaker),USB(Universal Serial Bus) 메모리, 충전기, 크래들/도크(Cradle/Dock), DMB 안테나, 모바일 결제 관련 장치,건강 관리 장치(혈당계 등), 게임기, 자동차 네비게이션 장치 등 다양한 장치들을 포함할 수 있다. 또한 상기외부 장치는 무선으로 연결 가능한 블루투스 통신 장치, NFC(Near Field Communication) 장치 및 WiFi Direct통신 장치, 무선 액세스 포인트(AP, Access Point)를 포함할 수 있다. 그리고, 휴대 단말은 유선 또는 무선을이용하여 다른 장치, 즉 휴대폰, 스마트폰, 태블릿 PC, 데스크탑 PC, 및 서버와 연결될 수 있다. 도 1을 참조하면, 휴대 단말(100)은 적어도 하나의 터치 스크린(190) 및 적어도 하나의 터치 스크린 컨트롤러 [0042](195)를 포함한다. 또한, 휴대 단말(100)은 제어부(110), 이동통신 모듈(120), 서브통신 모듈(130), 멀티미디어모듈(140), 카메라 모듈(150), GPS모듈(157), 입/출력 모듈(160), 센서 모듈(170), 저장부(175) 및 전원 공급부(180)를 포함한다. 서브통신 모듈(130)은 무선랜 모듈(131) 및 근거리통신 모듈(132) 중 적어도 하나를 포함하고, 멀티미디어 모듈 [0043](140)은 방송통신 모듈(141), 오디오 재생 모듈(142) 및 동영상재생 모듈(143) 중 적어도 하나를 포함한다. 카메라 모듈(150)은 제1 카메라(151) 및 제2 카메라(152) 중 적어도 하나를 포함한다. 또한, 본 발명의 휴대 단말(100)의 카메라 모듈(150)은 휴대 단말(100)의 주 용도에 따라 제1 및/또는 제2 카메라(151, 152)의 줌 인/줌아웃을 위한 경통부(155), 상기 경통부(155)의 줌 인/줌 아웃을 위해 경통부(155)의 움직임을 제어하는 모터부(154), 촬영을 위해 광원을 제공하는 플래시(153) 중 적어도 하나를 포함할 수 있다. 그리고, 입/출력 모듈(160)은 버튼(161), 마이크(162), 스피커(163), 진동모터(164), 커넥터(165), 및 키패드(166) 중 적어도 하나를 포함한다. 제어부(110)는 CPU(111), 휴대 단말(100)의 제어를 위한 제어프로그램이 저장된 롬(ROM, 112) 및 휴대 단말 [0044](100)의 외부로부터 입력되는 신호 또는 데이터를 기억하거나, 휴대 단말(100)에서 수행되는 작업을 위한 기억영역으로 사용되는 램(RAM, 113)을 포함할 수 있다. CPU(111)는 싱글 코어, 듀얼 코어, 트리플 코어, 또는 쿼드코어를 포함할 수 있다. CPU(111), 롬(112) 및 램(113)은 내부버스(bus)를 통해 상호 연결될 수 있다. 또한, 제어부(110)는 이동통신 모듈(120), 서브통신 모듈(130), 멀티미디어 모듈(140), 카메라 모듈(150), GPS [0045]공개특허 10-2015-0007862-10-모듈(157), 입/출력 모듈(160), 센서 모듈(170), 저장부(175), 전원 공급부(180), 터치 스크린(190), 및 터치스크린 컨트롤러(195)를 제어할 수 있다. 또한, 제어부(110)는 터치 스크린(190) 상에 복수의 객체들이 디스플레이된 상태에서 전자 펜 등의 터치 가능한 [0046]입력 유닛(168)에 의해 어느 하나의 객체에 근접함에 따른 호버링이 인식되는지 판단하고, 호버링이 발생한 위치에 대응하는 객체를 식별한다. 또한, 제어부(110)는 휴대 단말(100)로부터 입력 유닛까지의 높이와, 높이에따른 호버링 입력 이벤트를 감지할 수 있는데, 이러한, 호버링 입력 이벤트는 입력 유닛에 형성된 버튼 눌림,입력 유닛에 대한 두드림, 입력 유닛이 미리 정해진 속도보다 빠르게 이동함, 객체에 대한 터치 중 적어도 하나를 포함한다.또한, 제어부(110)는 이벤트에 대응하여 수신 또는 발생된 정보를 분석하고, 분석된 정보를 휴대 단말의 사용자 [0047]에게 제공하기 위한 모듈을 선택하고, 선택된 모듈을 통해서 분석된 정보를 포함하는 데이터를 의인화되도록 구성하여 사용자에게 제공한다. 만일, 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 제어부(110)는 입력된 요청에 해당되는 응답에 대응되는 데이터를 의인화되도록 구성하여 선택된 모듈을 통해 사용자에게의인화되어 제공한다. 또한, 제어부(110)는 상기 수신 또는 발생된 이벤트에서 키워드를 추출하고, 추출된 키워드를 통해 사용자에게 의인화되어 제공되도록 데이터를 구성한다. 상기 데이터를 구성한다는 의미는 사용자에게음성, 영상 또는 메시지를 출력하여 사용자가 이를 인지할 수 있도록 하기 위한 것을 포함한다. 또한, 상기 모듈은 이벤트에 대응하여 수신된 정보를 사용자에게 제공하기 위한 모듈로서, 이벤트의 종류에 따라 서로 다를수 있다. 그리고, 상기 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배터리잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 또한, 상기 모듈은 음성 통화 모듈, 영상 통화 모듈,문자 메시지 모듈, 팝업 창 모듈 및 이메일 모듈 중 적어도 하나를 포함한다. 만일, 상기 이벤트가 이메일 수신또는 문자 메시지 수신인 경우, 제어부(110)는 수신된 이메일 또는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를통해 사용자에게 제공한다.또한, 제어부(110)는 이벤트 수신이 감지되는 경우 인공지능 엔진을 활성화하고, 사용자로부터 정보 요청이 입 [0048]력되는 경우, 활성화된 인공지능 엔진을 통해 입력된 요청을 분석하고, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성하고, 상기 이벤트를 수신한 모듈을 통해 의인화되도록 구성된 데이터를 사용자에게 제공한다.상기 이벤트는 사용자로부터 수신되는 콜 및 메시지 중 적어도 하나를 포함한다. 만일, 이벤트가 사용자로부터수신한 콜인 경우, 인공지능 엔진은 제어부(110)의 제어 하에 사용자로부터 입력되는 음성을 통해서 상기 요청을 분석한다. 그리고, 이벤트가 메시지 수신인 경우 인공지능 엔진은 사용자로부터 입력되는 메시지의 텍스트를통해서 요청을 분석한다. 이러한, 인공지능 엔진은 제어부(110)의 제어 하에 휴대 단말의 사용자와 의사소통을제공하기 위한 엔진으로서 분석된 요청에 대한 응답을 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버에 접속한 후, 서버로부터 응답을 수신하여 사용자에게 제공한다. 또한, 인공지능 엔진은 제어부(110) 내에 구비되거나 별도의 장치에 구비될 수 있다. 그리고, 인공지능 엔진은 음성 통화,영상 통화 및 메시지 송수신 중 적어도 하나를 통해 사용자와 통신 가능하며, 상기 요청에 해당되는 응답을 사용자에게 음성, 영상 또는 메시지로 제공하도록 데이터를 구성할 수 있다.그리고, 이동통신 모듈(120)은 제어부(110)의 제어에 따라 적어도 하나-하나 또는 복수-의 안테나(도시되지 아 [0049]니함)를 이용하여 이동 통신을 통해 휴대 단말(100)이 외부 장치와 연결되도록 할 수 있다. 이동통신 모듈(120)은 휴대 단말(100)에 입력되는 전화번호를 가지는 휴대폰(도시되지 아니함), 스마트폰(도시되지 아니함), 태블릿 PC 또는 다른 장치(도시되지 아니함)와 음성 통화, 화상 통화, 문자메시지(SMS) 또는 멀티미디어 메시지(MMS)를 위한 무선 신호를 송/수신한다. 서브통신 모듈(130)은 무선랜 모듈(131)과 근거리통신 모듈(132) 중 적어도 하나를 포함할 수 있다. 예를 들어, [0050]무선랜 모듈(131)만 포함하거나, 근거리통신 모듈(132)만 포함하거나 또는 무선랜 모듈(131)과 근거리통신 모듈(132)을 모두 포함할 수 있다. 무선랜 모듈(131)은 제어부(110)의 제어에 따라 무선 액세스 포인트(AP, access point)(도시되지 아니함)가 설 [0051]치된 장소에서 인터넷에 연결될 수 있다. 무선랜 모듈(131)은 미국전기전자학회(IEEE)의 무선랜 규격(IEEE802.11x)을 지원한다. 근거리통신 모듈(132)은 제어부(110)의 제어에 따라 휴대 단말(100)과 화상형성장치(도시되지 아니함)사이에 무선으로 근거리 통신을 할 수 있다. 근거리 통신방식은 블루투스(bluetooth), 적외선통신(IrDA, infrared data association), 와이파이 다이렉트(WiFi-Direct) 통신, NFC(Near FieldCommunication) 등이 포함될 수 있다. 공개특허 10-2015-0007862-11-그리고, 휴대 단말(100)은 성능에 따라 이동통신 모듈(120), 무선랜 모듈(131), 및 근거리통신 모듈(132) 중 적 [0052]어도 하나를 포함할 수 있다. 또한, 휴대 단말(100)은 성능에 따라 이동통신 모듈(120), 무선랜 모듈(131), 및근거리통신 모듈(132)들의 조합을 포함할 수 있다. 본 발명에서는 이러한, 이동통신 모듈(120), 무선랜 모듈(131) 및 근거리통신 모듈(132) 중 적어도 하나 또는 이들의 조합을 송수신부라 칭하며, 이는 본 발명의 범위를축소하지 않는다. 또한, 상기 송수신부는 터치 스크린(190)을 포함한다.멀티미디어 모듈(140)은 방송통신 모듈(141), 오디오 재생 모듈(142) 또는 동영상재생 모듈(143)을 포함할 수 [0053]있다. 방송통신 모듈(141)은 제어부(110)의 제어에 따라 방송통신 안테나(도시되지 아니함)를 통해 방송국에서부터 송출되는 방송 신호(예, TV방송 신호, 라디오 방송 신호 또는 데이터 방송 신호) 및 방송부가 정보(예,EPG(Electronic Program Guide) 또는 ESG(Electronic Service Guide))를 수신할 수 있다. 오디오재생 모듈(142)은 제어부(110)의 제어에 따라 저장되거나 또는 수신되는 디지털 오디오 파일(예, 파일 확장자가 mp3,wma, ogg 또는 wav인 파일)을 재생할 수 있다. 동영상재생 모듈(143)은 제어부(110)의 제어에 따라 저장되거나또는 수신되는 디지털 동영상 파일(예, 파일 확장자가 mpeg, mpg, mp4, avi, mov, 또는 mkv인 파일)을 재생할수 있다. 동영상재생 모듈(143)은 디지털 오디오 파일을 재생할 수 있다. 멀티미디어 모듈(140)은 방송통신 모듈(141)을 제외하고 오디오재생 모듈(142)과 동영상재생 모듈(143)을 포함 [0054]할 수 있다. 또한, 멀티미디어 모듈(140)의 오디오재생 모듈(142) 또는 동영상재생 모듈(143)은 제어부(110)에포함될 수 있다. 카메라 모듈(150)은 제어부(110)의 제어에 따라 정지이미지 또는 동영상을 촬영하는 제1 카메라(151) 및 제2 카 [0055]메라(152) 중 적어도 하나를 포함할 수 있다. 또한, 카메라 모듈(150)은 피사체를 촬영하기 위해 줌 인/줌 아웃을 수행하는 경통부(155), 상기 경통부(155)의 움직임을 제어하는 모터부(154), 피사체를 촬영하기 위해 필요한보조 광원을 제공하는 플래시(153) 중 적어도 하나를 포함할 수 있다. 제1 카메라(151)는 상기 휴대 단말(100)전면에 배치되고, 제2 카메라(152)는 상기 휴대 단말(100)의 후면에 배치될 수 있다. 달리 취한 방식으로, 제1카메라(151)와 제2 카메라(152)는 인접(예, 제1 카메라(151)와 제2 카메라(152)의 간격이 1 cm 보다 크고, 8cm 보다는 작은)하게 배치되어 3차원 정지이미지 또는 3차원 동영상을 촬영할 수 있다. 또한, 제1 및 제2 카메라(151, 152)는 각각 렌즈계, 이미지 센서 등을 포함할 수 있다. 제1 및 제2 카메라(151, [0056]152)는 각각 렌즈계를 통해 입력되는(또는 촬영되는) 광신호를 전기적인 이미지 신호로 변환하여 제어부(110)로출력하고, 사용자는 이러한 제1 및 제2 카메라(151, 152)를 통해 동영상 또는 정지 이미지를 촬영할 수 있다.GPS 모듈(157)은 지구 궤도상에 있는 복수의 GPS위성(도시되지 아니함)에서부터 전파를 수신하고, GPS위성(도시 [0057]되지 아니함)에서부터 휴대 단말(100)까지 전파도달시간(Time of Arrival)을 이용하여 휴대 단말(100)의 위치를산출할 수 있다. 입/출력 모듈(160)은 복수의 버튼(161), 마이크(162), 스피커(163), 진동모터(164), 커넥터(165), 키패드 [0058](166), 이어폰 연결잭(167) 및 입력 유닛(168) 중 적어도 하나를 포함할 수 있다. 그리고, 이러한 입/출력 모듈은 이에 국한되지 않으며, 마우스, 트랙볼, 조이스틱 또는 커서 방향 키들과 같은 커서 컨트롤(cursor control)이 제어부(110)와의 통신 상기 터치 스크린(190) 상의 커서 움직임 제어를 위해 제공될 수 있다.버튼(161)은 상기 휴대 단말(100)의 하우징의 전면, 측면 또는 후면에 형성될 수 있으며, 전원/잠금 버튼(도시 [0059]되지 아니함), 볼륨버튼(도시되지 아니함), 메뉴 버튼, 홈 버튼, 돌아가기 버튼(back button) 및 검색 버튼(161) 중 적어도 하나를 포함할 수 있다.마이크(162)는 제어부(110)의 제어에 따라 음성(voice) 또는 사운드(sound)를 입력 받아 전기적인 신호를 생성 [0060]한다. 스피커(163)는 제어부(110)의 제어에 따라 이동통신 모듈(120), 서브통신 모듈(130), 멀티미디어 모듈(140) 또 [0061]는 카메라 모듈(150)의 다양한 신호(예, 무선신호, 방송신호, 디지털 오디오 파일, 디지털 동영상 파일 또는 사진 촬영 등)에 대응되는 소리를 휴대 단말(100) 외부로 출력할 수 있다. 그리고, 스피커(163)는 휴대 단말(100)이 수행하는 기능에 대응되는 사운드(예, 전화 통화에 대응되는 버튼 조작음, 또는 통화 연결음)를 출력할 수있다. 스피커(163)는 상기 휴대 단말(100)의 하우징의 적절한 위치 또는 위치들에 하나 또는 복수로 형성될 수있다.진동 모터(164)는 제어부(110)의 제어에 따라 전기적 신호를 기계적 진동으로 변환할 수 있다. 예를 들어, 진동 [0062]모드에 있는 휴대 단말(100)은 다른 장치(도시되지 아니함)로부터 음성통화가 수신되는 경우, 진동모터(164)가공개특허 10-2015-0007862-12-동작한다. 상기 휴대 단말(100)의 하우징 내에 하나 또는 복수로 형성될 수 있다. 진동모터(164)는 터치 스크린(190) 상을 터치하는 사용자의 터치 동작 및 터치 스크린(190) 상에서의 터치의 연속적인 움직임에 응답하여 동작할 수 있다. 커넥터(165)는 상기 휴대 단말(100)과 외부 장치(도시되지 아니함)또는 전원소스(도시되지 아니함)를 연결하기 [0063]위한 인터페이스로 이용될 수 있다. 상기 휴대 단말(100)은 제어부(110)의 제어에 따라 커넥터(165)에 연결된유선 케이블을 통해 휴대 단말(100)의 저장부(175)에 저장된 데이터를 외부 장치(도시되지 아니함)로 전송하거나 또는 외부 장치(도시되지 아니함)로부터 데이터를 수신할 수 있다. 또한 상기 휴대 단말(100)은 커넥터(165)에 연결된 유선 케이블을 통해 전원소스(도시되지 아니함)로부터 전원을 입력받거나, 상기 전원소스를 이용하여 배터리(도시되지 아니함)를 충전할 수 있다.키패드(166)는 휴대 단말(100)의 제어를 위해 사용자로부터 키 입력을 수신할 수 있다. 키패드(166)는 휴대 단 [0064]말(100)에 형성되는 물리적인 키패드(도시되지 아니함) 또는 터치 스크린(190)에 표시되는 가상의 키패드(도시되지 아니함)를 포함한다. 휴대 단말(100)에 형성되는 물리적인 키패드(도시되지 아니함)는 휴대 단말(100)의성능 또는 구조에 따라 제외될 수 있다. 이어폰 연결잭(Earphone Connecting Jack, 167)에는 이어폰(도시되지 아니함)이 삽입되어 상기 휴대 단말(10 [0065]0)에 연결될 수 있고, 입력 유닛(168)은 휴대 단말(100) 내부에 삽입되어 보관될 수 있으며, 사용시에는 상기휴대 단말(100)로부터 인출 또는 탈착될 수 있다. 이러한, 입력 유닛(168)이 삽입되는 휴대 단말(100) 내부의일 영역에는 상기 입력 유닛(168)의 장착 및 탈착에 대응하여 동작하는 탈부착 인식 스위치(169)가 구비되어,제어부(110)로 상기 입력 유닛(168)의 장착 및 탈착에 대응하는 신호를 제공할 수 있다. 탈부착 인식 스위치(169)는 입력 유닛(168)이 삽입되는 일 영역에 마련되어, 상기 입력 유닛(168)의 장착시 직간접적으로 접촉되도록 구비된다. 이에 따라, 탈부착 인식 스위치(169)는 상기 입력 유닛(168)과의 직간접적으로 접촉에 기초하여,상기 입력 유닛(168)의 장착이나 탈착에 대응하는 신호를 생성하고, 제어부(110)에 제공한다. 센서 모듈(170)은 휴대 단말(100)의 상태를 검출하는 적어도 하나의 센서를 포함한다. 예를 들어, 센서모듈 [0066](170)은 사용자의 휴대 단말(100)에 대한 접근 여부를 검출하는 근접센서, 휴대 단말(100) 주변의 빛의 양을 검출하는 조도센서(도시되지 아니함), 또는 휴대 단말(100)의 동작(예, 휴대 단말(100)의 회전, 휴대 단말(100)에가해지는 가속도 또는 진동)을 검출하는 모션 센서(도시되지 아니함), 지구 자기장을 이용해 방위(point of thecompass)를 검출하는 지자기 센서(Geo-magnetic Sensor, 도시되지 아니함), 중력의 작용 방향을 검출하는 중력센서(Gravity Sensor), 대기의 압력을 측정하여 고도를 검출하는 고도계(Altimeter)를 포함할 수 있다. 적어도하나의 센서는 상태를 검출하고, 검출에 대응되는 신호를 생성하여 제어부(110)로 전송할 수 있다. 센서모듈(170)의 센서는 휴대 단말(100)의 성능에 따라 추가되거나 삭제될 수 있다.저장부(175)는 제어부(110)의 제어에 따라 이동통신 모듈(120), 서브통신 모듈(130), 멀티미디어 모듈(140), 카 [0067]메라 모듈(150), GPS모듈(157), 입/출력 모듈(160), 센서 모듈(170), 터치 스크린(190)의 동작에 대응되게 입/출력되는 신호 또는 데이터를 저장할 수 있다. 저장부(175)는 휴대 단말(100) 또는 제어부(110)의 제어를 위한제어 프로그램 및 애플리케이션들을 저장할 수 있다.이러한, 저장부라는 용어는 저장부(175), 제어부(110)내 롬(112), 램(113) 또는 휴대 단말(100)에 장착되는 메 [0068]모리 카드(도시되지 아니함)(예, SD 카드, 메모리 스틱)를 포함한다. 저장부는 비휘발성 메모리, 휘발성메모리, 하드 디스크 드라이브(HDD)또는 솔리드 스테이트 드라이브(SSD)를 포함할 수 있다. 또한, 상기 저장부(175)는 네비게이션, 화상 통화, 게임, 사용자에게 시간을 기반으로 하는 알람 애플리케이션 [0069]등과 같은 다양한 기능들의 애플리케이션들과 이와 관련된 그래픽 사용자 인터페이스(graphical userinterface: GUI)를 제공하기 위한 이미지들, 사용자 정보, 문서, 터치 입력을 처리하는 방법과 관련된 데이터베이스들 또는 데이터, 상기 휴대 단말(100)을 구동하는데 필요한 배경 이미지들(메뉴 화면, 대기 화면 등) 또는운영 프로그램들, 카메라 모듈(150)에 의해 촬영된 이미지들 등을 저장할 수 있다. 상기 저장부(175)는 기계(예를 들어, 컴퓨터)로 읽을 수 있는 매체이며, 기계로 읽을 수 있는 매체라는 용어는 기계가 특정 기능을 수행할수 있도록 상기 기계로 데이터를 제공하는 매체로 정의될 수 있다. 기계로 읽을 수 있는 매체는 저장 매체일 수있다. 상기 저장부(175)는 비휘발성 매체(non-volatile media) 및 휘발성 매체를 포함할 수 있다. 이러한 모든매체는 상기 매체에 의해 전달되는 명령들이 상기 명령들을 상기 기계로 읽어 들이는 물리적 기구에 의해 검출될 수 있도록 유형의 것이어야 한다. 상기 기계로 읽을 수 있는 매체는, 이에 한정되지 않지만, 플로피 디스크(floppy disk), 플렉서블 디스크 [0070]공개특허 10-2015-0007862-13-(flexible disk), 하드 디스크, 자기 테이프, 시디롬(compact disc read-only memory: CD-ROM), 광학 디스크,펀치 카드(punch card), 페이퍼 테이프(paper tape), 램, 피롬(Programmable Read-Only Memory: PROM), 이피롬(Erasable PROM: EPROM) 및 플래시-이피롬(FLASH-EPROM) 중의 적어도 하나를 포함한다.전원 공급부(180)는 제어부(110)의 제어에 따라 휴대 단말(100)의 하우징에 배치되는 하나 또는 복수의 배터리 [0071](도시되지 아니함)에 전원을 공급할 수 있다. 하나 또는 복수의 배터리(도시되지 아니함)는 휴대 단말(100)에전원을 공급한다. 또한, 전 원공급부(180)는 커넥터(165)와 연결된 유선 케이블을 통해 외부의 전원소스(도시되지 아니함)에서부터 입력되는 전원을 휴대 단말(100)로 공급할 수 있다. 또한, 전원 공급부(180)는 무선 충전기술을 통해 외부의 전원소스로부터 무선으로 입력되는 전원을 휴대 단말(100)로 공급할 수도 있다. 그리고, 휴대 단말(100)은 사용자에게 다양한 서비스(예, 통화, 데이터 전송, 방송, 사진촬영)에 대응되는 유저 [0072]인터페이스를 제공하는 적어도 하나의 터치 스크린을 포함할 수 있다. 이러한, 각각의 터치 스크린은 유저 인터페이스에 입력되는 적어도 하나의 터치에 대응되는 아날로그 신호를 해당 터치 스크린 컨트롤러로 전송할 수 있다. 이와 같이, 휴대 단말(100)은 복수의 터치 스크린을 구비할 수 있는데, 각각의 터치 스크린 별로 터치에 대응되는 아날로그 신호를 수신하는 터치 스크린 컨트롤러가 구비될 수 있다. 이러한, 각각의 터치 스크린은 힌지의 연결을 통한 복수의 하우징에 각각 연결되거나 또는 복수의 터치 스크린들이 힌지 연결 없이 하나의 하우징에 위치할 수 있다. 본 발명에 따른 휴대 단말(100)은 상술한 바와 같이, 적어도 하나의 터치 스크린을 구비할수 있으며, 이하에서는 설명 편의상 하나의 터치 스크린의 경우에 대해서 설명한다.이러한, 터치 스크린(190)은 사용자의 신체(예, 엄지를 포함하는 손가락) 또는 터치 가능한 입력 유닛(예, 스타 [0073]일러스 펜, 전자 펜)을 통해 적어도 하나의 터치를 입력받을 수 있다. 또한, 터치 스크린(190)은 스타일러스 펜또는 전자 펜과 같은 펜을 통해서 입력되면, 이를 인식하는 펜 인식 패널(191)을 포함하며, 이러한 펜 인식 패널(191)은 펜과 터치 스크린(190)간의 거리를 자기장을 통해 파악할 수 있다. 또한, 터치 스크린(190)은 적어도하나의 터치 중에서, 하나의 터치의 연속적인 움직임을 입력받을 수 있다. 터치 스크린(190)은 입력되는 터치의연속적인 움직임에 대응되는 아날로그 신호를 터치 스크린 컨트롤러(195)로 전송할 수 있다. 나아가, 본 발명에서 터치는 터치 스크린(190)과 사용자의 신체 또는 터치 가능한 입력 유닛과의 접촉에 한정되 [0074]지 않고, 비접촉(예: 터치 스크린(190)과 사용자의 신체 또는 터치 가능한 입력 유닛 접촉하지 않고 검출가능한간격을 포함할 수 있다. 터치 스크린(190)에서 검출가능한 간격은 휴대 단말(100)의 성능 또는 구조에 따라 변경될 수 있으며, 특히 터치 스크린(190)은 사용자의 신체 또는 터치 가능한 입력 유닛과의 접촉에 의한 터치 이벤트와, 비접촉 상태로의 입력(예컨대, 호버링(Hovering)) 이벤트를 구분하여 검출 가능하도록, 상기 터치 이벤트와 호버링 이벤트에 의해 검출되는 값(예컨대, 아날로그 값으로 전압 값 또는 전류 값을 포함)이 다르게 출력될 수 있도록 구성된다. 더 나아가, 터치 스크린(190)은 호버링 이벤트가 발생되는 공간과 터치 스크린(190) 사이의 거리에 따라, 검출되는 값(예컨대, 전류값 등)을 다르게 출력하는 것이 바람직하다.이러한, 터치 스크린(190)은 예를 들어, 저항막(resistive) 방식, 정전용량(capacitive) 방식, 적외선 [0075](infrared) 방식 또는 초음파(acoustic wave) 방식으로 구현될 수 있다.또한, 터치 스크린(190)은 사용자의 신체 및 터치 가능한 입력 유닛에 의한 입력을 순차적 또는 동시에 입력받 [0076]을 수 있도록, 사용자의 신체 및 터치 가능한 입력 유닛의 터치나 근접을 각각 감지할 수 있는 적어도 두 개의터치스크린 패널을 포함할 수 있다. 상기 적어도 두 개의 터치스크린 패널은 서로 다른 출력 값을 터치 스크린컨트롤러에 제공하고, 터치 스크린 컨트롤러는 상기 적어도 두 개의 터치스크린 패널에서 입력되는 값을 서로다르게 인식하여, 터치 스크린(190)으로부터의 입력이 사용자의 신체에 의한 입력인지, 터치 가능한 입력 유닛에 의한 입력인지를 구분할 수 있다. 그리고, 터치 스크린(190)은 적어도 하나 이상의 객체를 디스플레이한다. 보다 상세하게, 터치 스크린(190)은 입력 유닛(168)을 통한 입력을 유도 기전력의 변화를 통해 감지하는 [0077]패널과, 터치 스크린(190)에 핑거를 통한 접촉을 감지하는 패널이 서로 밀착되거나 또는 일부 이격되어 차례로적층된 구조로 형성될 수 있다. 이러한, 터치 스크린(190)은 다수의 픽셀들을 구비하고, 상기 픽셀들을 통해 영상을 표시한다. 이러한 터치 스크린(190)은 액정 표시 장치(Liquid Crystal Display: LCD), 유기 발광 다이오드(Organic Light Emitting Diodes: OLED 및 LED등을 사용할 수 있다.또한, 터치 스크린(190)은 표면에 입력 유닛(168)이 닿거나, 터치 스크린(190)의 일정 거리에 놓이게 되면, 놓 [0078]인 위치를 파악하는 복수의 센서를 구성하고 있다. 복수의 센서들 각각은 코일 구조로 형성될 수 있으며, 복수의 센서들로 형성되는 센서층은 각각의 센서들이 기 설정된 패턴들을 가지며, 복수의 전극 라인을 형성한다. 이러한, 구조로 인해 터치 스크린(190)은 입력 유닛(168)을 통해 터치 스크린(190)에 접촉 또는 호버링 입력이 발공개특허 10-2015-0007862-14-생되면, 센서층과 입력 유닛 사이의 자기장에 기인하여 파형이 변경된 감지 신호가 발생되는데, 터치 스크린(190)은 발생된 감지 신호를 제어부(110)로 전송한다. 또한, 터치 스크린(190)은 핑거를 통해 터치 스크린(190)에 접촉이 발생되면, 정전용량에 기인한 감지 신호를 제어부(110)로 전송한다. 그리고, 입력 유닛(168)과 터치 스크린(190)간의 일정 거리는 코일(430)에 의해 형성된 자기장의 세기를 통해 파악될 수 있다. 이하에서는이러한, 진동 세기를 설정하는 과정에 대해서 설명한다.한편, 터치 스크린 컨트롤러(195)는 터치 스크린(190)에서부터 수신된 아날로그 신호를 디지털 신호(예, X와 Y [0079]좌표)로 변환하여 제어부(110)로 전송한다. 제어부(110)는 터치 스크린 컨트롤러(195)로부터 수신된 디지털 신호를 이용하여 터치 스크린(190)을 제어할 수 있다. 예를 들어, 제어부(110)는 터치 이벤트 또는 호버링 이벤트에 응답하여 터치 스크린(190)에 표시된 단축 아이콘(도시되지 아니함) 또는 객체가 선택되게 하거나 또는 실행할 수 있다. 또한, 터치 스크린 컨트롤러(195)는 제어부(110)에 포함될 수도 있다. 더 나아가, 터치 스크린 컨트롤러(195)는 터치 스크린(190)을 통해 출력되는 값(예컨대, 전류값 등)을 검출하여 [0080]호버링 이벤트가 발생되는 공간과 터치 스크린(190) 사이의 거리를 확인할 수 있고, 확인된 거리 값을 디지털신호(예컨대, Z좌표)로 변환하여 제어부(110)로 제공할 수 있다.도 2는 본 발명의 일 실시 예에 따른 휴대 단말의 전면 사시도를 나타낸 도면이고, 도 3은 본 발명의 일 실시 [0081]예에 따른 휴대 단말의 후면 사시도를 나타낸 도면이다. 도 2 및 도 3을 참조하면, 휴대 단말(100)의 전면(100a) 중앙에는 터치 스크린(190)이 배치된다. 터치 스크린 [0082](190)은 휴대 단말(100)의 전면(100a)의 대부분을 차지하도록 크게 형성될 수 있다. 도 2에서는, 상기 터치 스크린(190)에 메인 홈 화면이 표시된 예를 나타낸다. 메인 홈 화면은 휴대 단말(100)의 전원을 켰을 때 터치 스크린(190) 상에 표시되는 첫 화면이다. 또한, 휴대 단말(100)이 여러 페이지의 서로 다른 홈 화면들을 갖고 있을 경우, 메인 홈 화면은 상기 여러 페이지의 홈 화면들 중 첫 번째 홈 화면일 수 있다. 홈 화면에는 자주 사용되는 애플리케이션들을 실행하기 위한 단축 아이콘들(191-1, 191-2, 191-3), 메인 메뉴 전환키(191-4), 시간,날씨 등이 표시될 수 있다. 상기 메인 메뉴 전환키(191-4)는 상기 터치 스크린(190) 상에 메뉴 화면을표시한다. 또한, 상기 터치 스크린(190)의 상단에는 배터리 충전상태, 수신신호의 세기, 현재 시각과 같은 장치(100)의 상태를 표시하는 상태바(Status Bar, 192)가 형성될 수도 있다. 상기 터치 스크린(190)의 하부에는 홈 버튼(161a), 메뉴 버튼(161b), 및 뒤로 가기 버튼(161c)이 형성될 수 있 [0083]다. 홈 버튼(161a)은 터치 스크린(190)에 메인 홈 화면(main Home screen)을 표시한다. 예를 들어, 터치 스크린 [0084](190)에 상기 메인 홈 화면과 다른 홈 화면(any Home screen) 또는 메뉴화면이 표시된 상태에서, 상기 홈 키(161a)가 터치되면, 터치 스크린(190)에 메인 홈 화면이 디스플레이될 수 있다. 또한, 터치 스크린(190) 상에서애플리케이션들이 실행되는 도중 홈 버튼(191a)이 터치되면, 상기 터치 스크린(190)상에는 도 2에 도시된 메인홈 화면이 디스플레이될 수 있다. 또한 홈 버튼(161a)은 상기 터치 스크린(190) 상에 최근에(recently) 사용된애플리케이션들을 디스플레이하도록 하거나, 태스크 매니저(Task Manager)를 디스플레이하기 위하여 사용될 수도 있다.메뉴 버튼(161b)은 터치 스크린(190) 상에서 사용될 수 있는 연결 메뉴를 제공한다. 상기 연결 메뉴에는 위젯 [0085]추가 메뉴, 배경화면 변경 메뉴, 검색 메뉴, 편집 메뉴, 환경 설정 메뉴 등이 포함될 수 있다. 뒤로 가기 버튼(161c)은 현재 실행되고 있는 화면의 바로 이전에 실행되었던 화면을 디스플레이하거나, 가장 최 [0086]근에 사용된 애플리케이션을 종료시킬 수 있다.휴대 단말(100)의 전면(100a) 가장자리에는 제1 카메라(151)와 조도 센서(170a) 및 근접 센서(170b)가 배치될 [0087]수 있다. 휴대 단말(100)의 후면(100c)에는 제2 카메라(152), 플래시(flash, 153), 스피커(163)가 배치될 수있다. 휴대 단말(100)의 측면(100b)에는 예를 들어 전원/리셋 버튼(160a), 음량 버튼(161b), 방송 수신을 위한 지상파 [0088]DMB 안테나(141a), 하나 또는 복수의 마이크들(162) 등이 배치될 수 있다. 상기 DMB 안테나(141a)는 휴대 단말(100)에 고정되거나, 착탈 가능하게 형성될 수도 있다. 또한, 휴대 단말(100)의 하단 측면에는 커넥터(165)가 형성된다. 커넥터(165)에는 다수의 전극들이 형성되어 있 [0089]으며 외부 장치와 유선으로 연결될 수 있다. 휴대 단말(100)의 상단 측면에는 이어폰 연결잭(167)이 형성될 수공개특허 10-2015-0007862-15-있다. 이어폰 연결잭(167)에는 이어폰이 삽입될 수 있다.또한, 휴대 단말(100)의 하단 측면에는 입력 유닛(168)이 형성될 수 있다. 입력 유닛(168)은 휴대 단말(100) 내 [0090]부에 삽입되어 보관될 수 있으며, 사용시에는 상기 휴대 단말(100)로부터 인출 및 탈착될 수 있다. 도 4는 본 발명의 실시 예에 따른 입력 유닛과 터치 스크린의 내부 단면도를 나타낸 도면이다. [0091]도 4에 도시된 바와 같이, 터치 스크린(190)은 제1 터치 패널(440), 표시 패널(450), 제2 터치 패널(460)을 포 [0092]함한다. 또한, 터치 스크린(190)은 표시 패널(450)만 구비될 수 있으며, 본 발명에 따른 터치 스크린은 표시 패널(450)만 구비될 수 있을 뿐만 아니라, 제1 터치 패널(440), 표시 패널(450), 제2 터치 패널(460)을 포함하여구성될 수 있다. 그리고, 표시 패널(450)은 LCD, AMOLED 등과 같은 패널이 될 수 있으며, 휴대 단말(100)의 각종 동작 상태, 애플리케이션 실행 및 서비스 등에 따른 다양한 영상과, 복수의 객체들을 표시한다.제1 터치 패널(440)은 정전용량 방식 터치 패널로서, 유리의 양면에 얇은 금속 전도성 물질(예를 들면, [0093]ITO(Indium Tin Oxide：산화 인듐주석) 막 등)을 코팅하여 유리표면에 전류가 흐르도록 하고 전하를 저장할 수있는 유전체로 코팅된 패널이다. 이러한 제1 터치 패널(440)의 표면에 사용자의 손가락이 터치되면 정전기에 의해 일정량의 전하가 터치된 위치로 이동하고, 제1 터치 패널(440)은 전하의 이동에 따른 전류의 변화량을 인식해서 터치된 위치를 감지하게 된다. 제1 터치 패널(440)을 통해서는 정전기를 발생시킬 수 있는 모든 터치의 감지가 가능하다.제2 터치 패널(460)은 EMR(Electronic Magnetic Resonance) 방식 터치 패널로서, 복수의 루프 코일이 미리 정 [0094]해진 제1 방향 및 제1 방향과 교차하는 제2 방향에 각각 배치되어 그리드 구조를 가지는 전자 유도 코일 센서(미도시)와, 전자 유도 코일 센서의 각 루프 코일에 순차적으로 소정의 주파수를 가지는 교류 신호를 제공하는전자 신호 처리부(미도시)를 포함한다. 이러한 제2 터치 패널(460)의 루프 코일 근방에 공진회로를 내장하는 입력 유닛(168)이 존재하면, 해당 루프 코일로부터 송신되는 자계가 입력 유닛(168) 내의 공진회로에 상호 전자유도에 기초한 전류를 발생시킨다. 그리고 전류를 기초로 하여, 입력 유닛(168) 내의 공진 회로를 구성하는 코일(미도시)로부터 유도 자계가 발생하게 되고, 제2 터치 패널(460)은 유도 자계를 신호 수신 상태에 있는 루프코일에서 검출하게 되어 입력 유닛(168)의 호버링(Hovering) 위치, 터치 위치, 그리고 휴대 단말(100)은 제1 터치 패널(440)로부터 입력 유닛(168)의 펜촉(430)까지의 높이(h)를 감지한다. 이러한, 터치 스크린(190)의 제1터치 패널(440)에서 펜촉(430)까지의 높이(h)는 휴대 단말(100)의 성능 또는 구조에 대응하여 변경될 수 있음은당해 기술 분야에서 통상의 지식을 가진 자에게 용이하게 이해될 수 있다. 제2 터치 패널(460)을 통해서는 전자기 유도에 기초한 전류를 발생시킬 수 있는 입력 유닛이라면 호버링 및 터치의 감지가 가능하며, 상기 제2 터치패널(460)은 입력 유닛(168)에 의한 호버링 또는 터치 감지 전용으로 이용되는 것으로 설명한다. 그리고, 입력유닛(168)은 전자기 펜 또는 EMR 펜으로도 지칭될 수 있다. 또한, 입력 유닛(168)은 상기 제1 터치 패널(440)을통해 감지되는 공진회로가 포함되지 아니한 일반적인 펜과는 상이할 수 있다. 이러한, 입력 유닛(168)은 펜촉(430)에 인접된 영역의 펜대 내부에 배치되는 코일에 의해 발생하는 전자기 유도 값을 변경할 수 있는 버튼(420)을 포함하여 구성될 수 있다. 이러한, 입력 유닛(168)에 대한 보다 상세한 설명은 도 5에서 후술한다.그리고, 터치 스크린 컨트롤러(195)는 제1 터치 패널 컨트롤러와 제2 터치 패널 컨트롤러를 포함할 수 있다. 상 [0095]기 제1 터치 패널 컨트롤러는 상기 제1 터치 패널(440)로부터 핑거 감지에 의해 수신된 아날로그 신호를 디지털신호(예컨대 X, Y, Z 좌표)로 변환하여 제어부(110)로 전송한다. 그리고 상기 제2 터치 패널 컨트롤러는 제2 터치 패널(460)로부터 입력 유닛(168)의 호버링 또는 터치 감지에 의해 수신된 아날로그 신호를 디지털 신호로 변환하여 제어부(110)로 전송한다. 그리고, 제어부(110)는 상기 제1 및 제2 터치 패널 컨트롤러로부터 각각 수신된 디지털 신호를 이용하여 제1 터치 패널(440), 표시 패널(450), 제2 터치 패널(460)을 제어할 수 있다. 예를들어, 제어부(110)는 손가락이나 펜, 또는 입력 유닛(168) 등의 호버링 또는 터치에 응답하여 표시 패널(450)에미리 정해진 형태의 화면을 표시할 수 있다.따라서 본 발명의 일 실시 예에 따른 휴대 단말(100)에 의하면 상기 제1 터치 패널은 사용자의 손가락이나 펜에 [0096]의한 터치를 감지하고, 상기 제2 터치 패널은 상기 입력 유닛(168)에 의한 호버링 또는 터치를 감지할 수 있다.따라서 상기 휴대 단말(100)의 제어부(110)는 상기 사용자의 손가락이나 펜에 의한 터치와 입력 유닛(168)에 의한 호버링 또는 터치를 구별하여 감지할 수 있다. 그리고, 도 4에서는 단지 하나의 터치 스크린에 대해서만 도시하였으나, 본 발명은 단지 하나의 터치 스크린에 제한되지 않으며, 복수의 터치 스크린을 구비할 수 있다. 그리고, 각각의 터치 스크린은 각각 하우징에 구비되어 힌지에 의해 연결되거나 또는 하나의 하우징이 복수의 터공개특허 10-2015-0007862-16-치 스크린이 구비될 수 있다. 그리고, 복수의 터치 스크린 각각은 도 4에 도시된 바와 같이, 표시 패널과 적어도 하나의 터치 패널을 포함하여 구성된다.도 5는 본 발명의 실시 예에 따른 입력 유닛을 나타낸 블럭도이다. [0097]도 5를 참조하면, 본 발명의 실시 예에 따른 입력 유닛(예: 터치용 펜)은 펜대와, 펜대 끝에 배치된 펜촉(430), [0098]펜촉(430)에 인접된 영역의 펜대 내부에 배치되는 코일 (510)에 의해 발생하는 전자기 유도 값을 변경할 수 있는 버튼(420), 호버링 입력 효과 발생시 진동하는 진동 소자(520), 휴대 단말(100)과의 호버링으로 인해 휴대단말(100)로부터 수신되는 제어 신호를 분석하고, 이에 따른 입력 유닛(168)에 햅틱 효과를 제공하기 위해 진동소자(520)의 진동 세기, 진동 주기를 제어하는 제어부(530), 휴대 단말(100)과 근거리 통신을 수행하는 근거리통신부(540) 및 입력 유닛(168)의 진동을 위한 전원을 공급하는 배터리(550)를 포함하여 구성될 수 있다. 또한,상기 입력 유닛(168)은 입력 유닛(168)의 진동 주기 및/또는 진동 세기에 대응하는 소리를 출력하는 스피커(560)를 포함할 수 있다. 그리고, 이러한 구성을 가지는 입력 유닛(168)은 정전유도 방식을 지원하는 구성이다. 그리고, 코일(510)에 의 [0099]하여 터치 스크린(190)의 일정 지점에 자기장이 형성되면, 터치 스크린(190)은 해당 자기장 위치를 검출하여 터치 지점을 인식할 수 있도록 구성된다.보다 상세하게, 상기 스피커(560)는 제어부(530)의 제어에 따라 휴대 단말(100)에 구비된 이동통신 모듈(120), [0100]서브통신 모듈(130) 또는 멀티미디어 모듈(140)로부터 다양한 신호(예: 무선신호, 방송신호, 디지털 오디오 파일, 또는 디지털 동영상 파일 등)에 대응되는 사운드를 출력할 수 있다. 또한, 스피커(560)는 휴대 단말(100)이수행하는 기능에 대응되는 사운드(예, 전화 통화에 대응되는 버튼 조작음, 또는 통화 연결음)를 출력할 수 있으며, 상기 입력 유닛(168)의 하우징의 적절한 위치 또는 위치들에 하나 또는 복수로 형성될 수 있다.도 6은 본 발명의 실시 예에 따른 휴대 단말의 데이터 제공 방법을 나타낸 순서도이다. [0101]이하, 도 6을 참조하여 본 발명의 실시 예에 따른 휴대 단말의 데이터 제공 방법을 상세히 설명하면 다음과 같 [0102]다.정보를 제공하기 위한 이벤트가 발생되는 경우, 이벤트에 대응되는 정보를 분석하여 출력하고자 하는 모듈을 선 [0103]택한다(S610, S612). 제어부는 사용자에게 제공되어야 하는 이벤트가 발생되는 경우, 이를 감지하고 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 결과를 출력하고자 하는 모듈을 선택한다. 제어부는 수신 또는 발생된 데이터에서 키워드를 추출하여 정보를 분석한다. 이러한, 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 그리고, 상기 모듈은 발생된 이벤트에 따라서 복수 개가 있다. 예를 들어, 이러한 모듈들은 이메일 송수신 모듈, 문자 메시지송수신 모듈, 배터리 잔량이 부족하게 되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는모듈 그리고 음성 통화 또는 영상 통화를 제공하는 통화 모듈을 포함할 수 있다. 제어부는 이러한 모듈을 통해수신되는 이벤트에 대응하여 정보를 분석한다. 상기 정보는 사용자에게 제공되어야 하는 것으로서 키워드를 포함한다. 그리고, 제어부의 제어 하에 사용자로부터 입력된 요청에 해당되는 응답을 위해 의인화되도록 구성되는데이터를 사용자에게 제공한다. 또한, 상기 모듈은 사용자와 통신을 하기 위한 것으로서, 음성 통화, 영상통화, 문자 메시지, 팝업 창 및 이메일 중 적어도 하나를 포함한다. 상기 과정(S612)에서 본 발명의 휴대 단말은 선택된 모듈에 대응하여 상기 정보를 포함하는 데이터를 구성한다 [0104](S614). 제어부는 선택된 모듈을 통해서 의인화되도록 구성된 데이터를 사용자에게 제공한다. 제어부는 상기 과정(S612)에서 분석결과를 통해서 사용자에게 제공하기 위한 모듈을 선택한다. 휴대 단말은 인공지능 엔진이 구비되어 있으며, 사용자는 이러한 인공지능 엔진과 상호 의사소통뿐만 아니라 데이터를 송수신할 수 있다. 상기인공지능 엔진은 사용자와 상호 의사소통을 제공하기 위해 사용자에게 제공되는 데이터를 의인화하여 구성할 수있다. 이러한, 의인화는 휴대 단말이 마치 살아있는 사람(예: 가상의 사용자)처럼 휴대 단말 사용자와 의사소통을 할 수 있도록 하기 위한 것으로서, 이러한 의인화를 통해서 휴대 단말은 사용자에게 제공될 데이터를 가상의사용자가 음성 등을 이용해 사용자에게 제공할 수 있다. 그리고, 휴대 단말은 사용자에게 정보 또는 데이터를제공하기 위한 복수의 모듈이 구비되어 있다. 그리고, 제어부는 선택된 모듈을 통해 사용자로부터 정보 요청이입력되는 경우, 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 음성 통화로 사용자에게 정보를 제공하고자공개특허 10-2015-0007862-17-하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 음성 데이터를 생성한다. 이러한, 음성 데이터는 추출된 키워드로 형성되어 사용자에게 스피커를 통해 출력된다. 사용자는 이를 청취하여수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 영상 통화로 사용자에게 정보를 제공하고자 하는경우, 음성 통화와 마찬가지로 음성 데이터를 생성하고, 인공지능 엔진에 부여된 이모티콘 또는 아이콘을 통해서 사용자와 영상 통화를 제공한다. 또한, 제어부는 메시지를 통해서 사용자에게 정보를 제공하고자 하는 경우,수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 문자 데이터를 생성한다. 이러한 문자데이터는 수신된 이벤트에 그림 파일이 존재할 경우, 그림 파일을 추가하여 생성될 수 있다. 이와 같이, 인공지능 엔진은 context awareness 모듈을 통해 문자 메시지, 음성 통화 또는 영상 통화를 통해 사용자와 의사소통을할 수 있다. 이와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력 받을 수 있으며,분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답을 사용자에게 음성, 영상 또는 메시지를 이용하여 의인화되어 제공되도록데이터를 구성할 수 있다.상기 과정(S614)에서 본 발명의 휴대 단말은 구성된 데이터를 상기 선택된 모듈을 통해 출력한다(S616). 제어부 [0105]는 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 제어부는 수신된 이메일 또는 문자 메시지에 포함된키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및 팝업창 중 적어도 하나를 통해 사용자에게 제공한다. 그리고, 제어부는 이벤트가 휴대 단말의 배터리 잔량 부족 발생인 경우, 제어부는 배터리의 잔량을 추출하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및팝업 창 중 적어도 하나를 통해 사용자에게 제공한다. 그리고, 제어부는 이벤트가 콜 수신인 경우, 제어부는 콜을 송신한 사용자 이름 및 휴대 단말의 전화번호 중 적어도 하나의 추출에 대응하여 데이터를 구성하고, 구성된데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 사용자에게 제공한다.도 7은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 방 [0106]법을 나타낸 순서도이고, 도 8은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 예시도이다.이하, 도 7 및 도 8을 참조하여, 본 발명의 실시 예에 따른 휴대 단말이 통화를 이용하여 데이터를 제공하는 방 [0107]법을 상세히 설명하면 다음과 같다.사용자에게 정보를 제공하기 위한 이벤트가 발생되는 경우, 본 발명의 휴대 단말은 사용자에게 콜을 송신하고 [0108]사용자로부터 콜 수신이 확인되면, 정보를 이용하여 데이터를 구성한다(S710, S712). 제어부는 사용자에게 제공되어야 하는 이벤트가 발생되는 경우, 이를 감지하고 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 결과를 출력하고자 하는 모듈을 선택한다. 이러한, 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 그리고, 상기 모듈은 발생된이벤트에 따라서 복수 개가 있다. 즉, 이메일 송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는 모듈 그리고 음성 통화 또는 영상 통화를 제공하는 통화 모듈을 포함한다. 그리고, 분석된 결과를 사용자에게 출력하고자 하는 모듈은 복수 개가 있으며 음성 통화 또는 영상 통화를 포함한다. 또한, 제어부는 이벤트에 포함되어 있는 정보를 분석한 후, 사용자에게 콜을 송신할 수 있고, 이벤트가 수신되면 사용자에게 콜을 송신한 후, 이벤트에 포함되어 있는 정보를 분석할 수 있다.이와 같이, 제어부는 사용자에게 콜을 송신하고, 분석된 결과를 출력하기 위해 인공지능 엔진을 이용할 수 [0109]있다. 이러한 인공지능 엔진은 사용자와 상호 의사소통뿐만 아니라 데이터를 송수신할 수 있다. 상기 인공지능엔진은 휴대 단말에 구비된 가상의 인물일 수 있다.그리고, 제어부는 이벤트의 발생에 대응하여 데이터를 의인화되도록 구성하고 구성된 데이터를 사용자에게 출력 [0110]하기 위한 모듈을 선택하거나 또는 모듈을 선택하고 이에 대응하여 데이터를 구성할 수 있다. 이러한 모듈은 사용자와 상호 통신을 수행할 수 있는 음성 통화 모듈 또는 영상 통화 모듈을 포함한다. 공개특허 10-2015-0007862-18-본 발명의 휴대 단말은 상기 과정(S712)에서 구성된 데이터를 출력한다(S714). 제어부는 구성된 데이터를 선택 [0111]된 모듈을 통해 사용자에게 출력한다. 그리고, 사용자로부터 정보 요청이 입력되는 경우, 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 음성 통화로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여키워드를 추출하고, 추출된 키워드를 통해서 음성 데이터를 생성한다. 이러한, 음성 데이터는 추출된 키워드로형성되어 사용자에게 스피커를 통해 출력된다. 사용자는 이를 청취하여 수신된 이벤트의 내용을 파악할 수있다. 또한, 제어부는 영상 통화로 사용자에게 정보를 제공하고자 하는 경우, 음성 통화와 마찬가지로 음성 데이터를 생성하고, 인공지능 엔진에 부여된 이모티콘 또는 아이콘을 통해서 사용자와 영상 통화를 제공한다. 이와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답을 사용자에게 음성, 영상 또는 메시지로 제공하도록 데이터를 구성할 수 있다. 이하, 도 8에서는 이러한 인공지능 엔진을 통해 사용자와 음성 통화 또는 영상 통화를 수행하는 예를 설명한다.도 8은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 사용자에게 통화를 통해 데이터를 제공 [0112]하는 예시도로서, 휴대 단말의 인공지능 엔진은 사용자와 통화를 수행할 수 있다.본 실시 예에서는 휴대 단말의 사용자와 휴대 단말에 구비된 인공지능 엔진간의 통화를 나타낸 예시도이다. 상 [0113]기 인공지능 엔진은 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나의 이벤트가 발생되는 경우 활성화되거나 또는 사용자의 선택에 의해 활성화될 수 있다. 인공지능 엔진은 휴대 단말의사용자와 의사소통 또는 데이터를 송수신할 수 있는 휴대 단말에 구비된 가상의 인물일 수 있다. 즉, 사용자는이러한 가상의 인물과 자연스러운 의사소통 뿐만 아니라 데이터 송수신을 할 수 있다. 이러한 인공지능 엔진은고유 전화번호를 할당받을 수 있으며, 사용자가 할당된 전화번호를 호출하면 인공지능 엔진은 활성화될 수있다. 그리고, 인공지능 엔진은 송수신부를 통해 사용자와 의사소통을 할 수 있을 뿐만 아니라 데이터 송수신을수행할 수 있다. 상기 송수신부는 휴대 단말에 구비된 터치 스크린, 마이크, 스피커 및 이어폰 중 적어도 하나를 포함한다. 또한, 인공지능 엔진은 제어부의 제어 하에 상술한 이벤트가 발생되는 경우, 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고, 분석된 정보를 제공하기 위한 모듈을 선택한다. 그리고, 인공지능 엔진은 선택된 모듈을 통해서 분석된 정보를 포함하는 데이터를 구성할 수 있다. 또한, 인공지능 엔진은 선택된모듈을 통해 사용자로부터 정보 요청을 수신할 수 있다.도 8을 참조하면, 휴대 단말의 터치 스크린(810)은 통화시 제공될 수 있는 복수의 기능들이 구비된 하단 스크린 [0114](830)과 통화자의 이름, 통화 시간, 그리고 상대방의 모습 또는 이모티콘을 보여주는 상단 스크린(820)으로 구성될 수 있다. 이벤트가 수신 또는 발생되면, 인공지능 엔진은 활성화되고, 이벤트에 대한 정보를 분석한다.즉, 인공지능 엔진은 이벤트가 다른 휴대 단말로부터의 이메일 수신인지, 문자 메시지 수신인지 또는 콜 수신인지를 파악한다. 또한, 인공지능 엔진은 이벤트가 휴대 단말의 배터리 잔량이 미리 정해진 임계값보다 작아지는지 파악할 수 있다. 그리고, 인공지능 엔진은 고유 전화번호가 할당될 수 있기 때문에, 사용자는 할당된 전화번호를 통해 인공지능 엔진을 활성화할 수 있다. 이러한 할당된 전화번호를 통해 인공지능 엔진을 호출하면, 인공지능 엔진은 자신에게 할당되거나 임의 아이콘, 이모티콘 또는 사진을 활성화하여 상단 스크린(820)에 디스플레이할 수 있다. 도 8은 사용자와 인공지능 간의 통화를 나타내는 것으로서 인공지능 엔진은 사진(821)을 상단 스크린(820)에 디스플레이하여 영상 통화를 수행할 수 있다. 이러한 인공지능 엔진의 목소리는 휴대 단말의 사용자의 목소리로 설정하거나 또는 성우, 배우, 가수 등 다양한 사람의 목소리로 설정할 수 있다. 이러한 통화를통해서 사용자는 인공지능 엔진에 정보를 입력하거나 요청할 수 있다. 사용자로부터 통화를 통한 정보의 입력또는 요청이 발생되면, 인공지능 엔진은 이를 분석하고, 요청에 대한 응답을 휴대 단말에 기 저장된 정보를 통해서 제공할 수 있는지 또는 별도의 서버에 접속하여 응답에 대한 정보를 수신하여 제공해야 하는지를판단하고, 판단 결과에 따라서 응답에 대응하는 데이터를 구성하여 스피커 또는 이어폰을 통해 사용자에게 출력하거나 터치 스크린을 통해 출력할 수 있다. 또한, 인공지능 엔진은 요청에 대응하는 답변을 저장하고 있는 서버에 접속하여 데이터를 수신한 후, 사용자에게 제공되기 위한 데이터로 구성할 수 있다.그리고, 사용자로부터 추가 정보가 요청되는 경우, 본 발명의 휴대 단말은 요청된 정보에 대응되는 데이터를 구 [0115]성하고, 구성된 데이터를 사용자에게 출력한다(S716, S718, S714). 상기 과정(S714)에서 구성된 데이터가 사용공개특허 10-2015-0007862-19-자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청된 데이터에 대한 응답을 포함하는 데이터를 구성하고, 구성된 데이터를 사용자에게 다시 출력한다. 제어부는 사용자로부터 추가 요청이 입력되면,휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접속 제어하여 요청에 대한 응답을 얻는다. 상기기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거나 또는 웹 페이지를 통해 얻어진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하는 기상청 서버, 위치를 제공하는 위치 기반 서버등 다양한 컨텐츠에 따른 서버를 포함한다.도 9는 본 발명의 실시 예에 따른 휴대 단말에 콜이 수신되는 경우 데이터를 제공하는 방법을 나타낸 순서도이 [0116]다.이하, 도 9를 참조하며 본 발명의 실시 예에 따른 휴대 단말에 콜이 수신되는 경우 데이터를 제공하는 방법을 [0117]상세히 설명하면 다음과 같다.콜이 수신되면, 본 발명의 휴대 단말은 인공지능 엔진을 활성화한다(S910, S912). 사용자는 필요한 정보를 요청 [0118]하고자 하는 경우, 휴대 단말의 인공지능 엔진을 활성화하여 필요한 정보를 얻을 수 있다. 이러한 인공지능 엔진은 가상의 인물로 구성될 수 있으며 별도의 전화번호, 이름 등을 설정할 수 있다. 그리고, 이러한 이름을 호출하거나 전화번호를 통해 통화를 하는 경우 인공지능 엔진은 활성화되고, 사용자와 의사소통을 수행할 수있다. 이와 같이, 할당된 전화번호를 통해 사용자로부터 콜이 수신되면, 제어부는 인공지능 엔진을 활성화한다.활성화된 인공지능 엔진을 통해서 휴대 단말은 사용자와 의사 소통을 수행할 수 있을 뿐만 아니라 데이터 송수신도 가능하다. 상기 송수신이라 함은 임의 정보 또는 데이터를 사용자가 인지할 수 있게끔 출력하고, 사용자로부터 임의 정보 또는 데이터를 수신하는 것을 말한다. 즉, 사용자는 음성 통화, 영상 통화 또는 문자 메시지를통해 인공지능 엔진과 의사소통을 수행할 수 있으며, 인공지능 엔진은 사용자로부터 입력되는 음성, 영상 또는문자 메지시를 분석하여 사용자가 어떤 정보를 원하는지 판단할 수 있다.정보 요청이 수신되면, 본 발명의 휴대 단말은 요청에 대응되는 데이터를 구성하고, 구성된 데이터를 통화 모듈 [0119]을 통해 출력한다(S914, S916, S918). 인공지능 엔진은 사용자로부터 요청된 정보가 휴대 단말에 기 저장되어있는지를 판단한다. 판단 결과, 기 저장되어 있으면 요청에 대한 응답을 포함하는 데이터를 구성한다. 만일, 기저장되어 있지 않으면, 요청에 대한 응답을 제공하는 서버에 요청하고, 서버로부터 이에 대한 응답을 수신하여데이터를 구성한다. 그리고, 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 음성 통화로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 음성 데이터를 생성한다. 이러한, 음성 데이터는 추출된 키워드로 형성되어 사용자에게 스피커를 통해 출력된다. 사용자는 이를 청취하여 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 영상 통화로 사용자에게 정보를 제공하고자 하는 경우, 음성 통화와 마찬가지로 음성 데이터를 생성하고,인공지능 엔진에 부여된 이모티콘 또는 아이콘을 통해서 사용자와 영상 통화를 제공한다. 이와 같이, 의인화될수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답을 사용자에게 음성, 영상 또는 메시지로 제공하도록 데이터를 구성할 수 있다. 그리고, 상기 구성된 데이터는모듈에 따라 다르게 구성될 수 있다. 즉, 사용자가 문자 메시지로 요청하는 경우 인공지능 엔진은 데이터를 문자 메시지로 구성하고, 음성 통화로 요청하는 경우 데이터를 음성으로 구성한다. 인공지능 엔진은 데이터 구성시 정보를 제공하는 주체를 자신으로하여 구성할 수 있다.사용자로부터 추가 정보가 요청되면, 요청에 대응되는 데이터를 구성한다(S920, S916). 상기 과정(S918)에서 구 [0120]성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청된 데이터에 대한응답을 포함하는 데이터를 구성하고, 구성된 데이터를 사용자에게 다시 출력한다. 제어부는 사용자로부터 추가요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접속 제어하여 요청에 대한 응답을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거나 또는 웹 페이지를 통해 얻어진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하는 기상청 서버, 위치를 제공하는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다.공개특허 10-2015-0007862-20-도 10은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해 [0121]데이터를 제공하는 방법을 나타낸 순서도이다.이하, 도 10을 참조하여, 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응 [0122]되는 모듈을 통해 데이터를 제공하는 방법을 상세히 설명하면 다음과 같다.이벤트가 발생되는 경우, 이벤트에 대응되는 정보를 분석한다(S1010, S1012). 제어부는 사용자에게 제공되어야 [0123]하는 이벤트가 발생되는 경우, 이를 감지하고 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 정보에 대응하여 사용자에게 제공하고자 하는 데이터를 구성한다. 제어부는 수신 또는 발생된 이벤트에 대응되는 데이터에서 키워드를 추출하여 정보를 분석한다. 상기 정보는 사용자에게 제공되어야 하는 데이터이다. 이러한, 이벤트는 송신자가 사용자에게 제공하고자 하는 정보를 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신 및콜 수신 중 적어도 하나를 포함한다. 또한, 상기 이벤트는 휴대 단말의 배터리 잔량이 부족함을 알려주기 위한팝업 창 또는 콜 송신을 포함한다. 또한, 상기 정보는 사용자에게 제공되어야 하는 키워드를 포함한다. 그리고,제어부의 제어 하에 사용자로부터 입력된 요청에 해당되는 응답을 위해 구성되는 데이터를 의인화하여 사용자에게 제공한다. 또한, 상기 모듈은 사용자와 통신을 하기 위한 것으로서, 음성 통화, 영상 통화, 문자 메시지, 팝업 창 및 이메일 중 적어도 하나를 포함한다. 상기 과정(S1012)에서 분석된 정보에 대응하여 데이터를 구성하고, 구성된 데이터를 해당 모듈을 이용하여 출력 [0124]한다(S1014, S1016). 제어부는 선택된 모듈을 통해서 구성된 데이터를 의인화하여 사용자에게 제공한다. 제어부는 상기 과정(S1012)에서 분석결과를 통해서 사용자에게 제공하기 위한 모듈을 선택한다. 상기 모듈은 발생된이벤트에 따라서 복수 개가 있다. 즉, 이메일 송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는 모듈 그리고 음성 통화 영상 통화를 제공하는 통화 모듈을 포함한다. 제어부는 이러한 모듈을 통해 수신되는 이벤트에 대응하여 정보를 분석한다. 휴대 단말은 인공지능 엔진이 구비되어 있으며, 사용자는 이러한 인공지능 엔진과 상호 의사소통뿐만 아니라 데이터를 송수신할 수 있다. 그리고, 휴대 단말은 사용자에게 정보 또는 데이터를 제공하기 위한 복수의 모듈이 구비되어 있다. 그리고, 제어부는 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 입력된 요청에해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 문자 메시지로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에대응하여 키워드를 추출하고, 추출된 키워드를 통해서 문자 메시지를 생성한다. 이러한, 문자 메시지는 추출된키워드로 형성되어 사용자에게 터치 스크린을 통해 출력된다. 사용자는 이를 통해서 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 이메일로 사용자에게 정보를 제공하고자 하는 경우, 문자 메시지와 마찬가지로이메일을 생성하고, 사용자에게 제공한다. 이러한 문자 데이터 또는 이메일은 수신된 이벤트에 그림 파일이 존재할 경우, 그림 파일을 추가하여 생성될 수 있다. 이와 같이, 인공지능 엔진은 context awareness 모듈을 통해문자 메시지, 이메일을 통해 사용자와 의사소통을 할 수 있다. 이와 같이, 의인화될 수 있는 인공지능 엔진을통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답을 사용자에게 문자 메시지또는 이메일로 제공하도록 데이터를 구성할 수 있다.추가 정보가 요청되면, 요청된 정보에 대응되는 데이터를 구성하고, 구성된 데이터를 해당 모듈을 이용하여 출 [0125]력한다(S1018, S1020, S1016). 제어부는 사용자로부터 추가 정보가 요청되면, 인공지능 엔진을 제어하여 요청된정보를 분석한다. 그리고, 요청된 정보 또는 질의에 대한 응답을 기 저장된 데이터를 통해서 사용자에게 제공할수 있는지 또는 응답을 제공하는 서버를 통해 수신하여 사용자에게 제공해야하는지를 판단한다. 그리고, 상기과정(S1016)에서 구성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청된 데이터에 대한 응답을 포함하는 데이터를 구성하고, 구성된 데이터를 의인화하여 사용자에게 다시 출력한다.제어부는 사용자로부터 추가 요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접속 제어하여 요청에 대한 응답을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거나 또는 웹 페이지를 통해 얻어진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하공개특허 10-2015-0007862-21-는 기상청 서버, 위치를 제공하는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다.도 11a는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 문자 메시지를 통해 사용자에게 데이 [0126]터를 제공하는 예시도이다.이하, 도 11a를 참조하여, 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 문자 메시지를 통해 [0127]사용자에게 데이터를 제공하는 예시를 상세히 설명하면 다음과 같다.본 실시 예에서는 휴대 단말의 사용자와 휴대 단말에 구비된 인공지능 엔진간의 문자 메시지의 송수신을 나타낸 [0128]예시도이다. 상기 인공지능 엔진은 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나의 이벤트가 발생되는 경우 활성화되거나 또는 사용자의 선택에 의해 활성화될 수 있다. 즉, 사용자는이러한 가상의 인물과 자연스러운 의사소통뿐만 아니라 데이터 송수신을 할 수 있다. 또한, 인공지능 엔진은 제어부의 제어 하에 상술한 이벤트가 발생되는 경우, 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고,분석된 정보를 제공하기 위한 모듈을 선택한다. 그리고, 인공지능 엔진은 선택된 모듈을 통해서 분석된 정보를포함하는 데이터를 구성할 수 있다. 또한, 인공지능 엔진은 선택된 모듈을 통해 사용자로부터 정보 요청을 수신할 수 있다.휴대 단말의 터치 스크린(1110)은 인공지능 엔진에 대응하는 가상의 인물에 설정된 임의 캐릭터 및 가상의 인물 [0129]에 부여된 전화번호를 표시하는 상단 스크린(1120)과 가상의 인물과 사용자간에 주고 받는 문자 메시지를 디스플레이하는 하단 스크린(1130)을 포함한다. 이벤트가 수신 또는 발생되면, 인공지능 엔진은 활성화되고, 이벤트에 대한 정보를 분석한다. 그리고, 분석 결과에 따라서 데이터를 구성하여 사용자에게 출력한다. 도 11a는 사용자와 인공지능 엔진의 가상의 인물간의 문자 메시지 송수신을 나타내는 것이다. 인공지능 엔진은 수신된 이벤트를 통해서 날씨에 대한 정보를 분석하고 사용자에게 제공하기 위한 데이터를 구성하여 터치 스크린(1130)을 통해 출력한다. 상기 구성된 데이터는 사용자에게 제공되어져야 하는 정보를 포함한다. 즉, 제공되어져야 하는 정보가 날씨에 관한 것이며 만일 비가 올 경우, 인공지능 엔진은 \"밖에 비가 내리고 있으니 우산을 준비해서 나가주세요.\"라는 문자와 필요에 따라 그림을 추가하여 데이터(11131)를 구성하고, 구성된 데이터를 터치 스크린(1131)에 출력한다. 이를 확인한 사용자는 이에 대한 응답 즉, \"고마워, Sam~\"을 입력할 수 있다. 상기 Sam은가상의 인물에 부여된 이름이거나 인공지능 엔진에 부여된 이름일 수 있다. 이를 수신한 인공지능 엔진은 \"고마워\"란 단어와 \"Sam\"이란 단어를 통해 사용자가 자신에게 감사함을 표현한 것으로 파악하고, 이에 대한 적절한대답 즉, \"도움이 되셨다니 기쁘네요.\"를 포함하는 데이터 구성하여 출력한다. 이와 같이, 사용자로부터 응답(1132)를 수신한 인공지능 엔진은 이에 대한 답변(1133)을 사용자에게 다시 제공할 수 있다.이러한 문자 메시지를 통해서 사용자는 인공지능 엔진에 정보를 입력하거나 요청할 수 있다. 사용자로부터 문자 [0130]메시지를 통한 정보의 입력 또는 요청이 발생되면, 인공지능 엔진은 이를 분석하고, 요청에 대한 응답을 휴대단말에 기 저장된 정보를 통해서 제공할 수 있는지 또는 별도의 서버에 접속하여 응답에 대한 정보를 수신하여제공해야 하는지를 판단하고, 판단 결과에 따라서 응답에 대응하는 데이터를 구성하여 스피커 또는 이어폰을 통해 사용자에게 출력하거나 터치 스크린을 통해 출력할 수 있다. 또한, 인공지능 엔진은 요청에 대응하는 답변을저장하고 있는 서버에 접속하여 데이터를 수신한 후, 사용자에게 제공되기 위한 데이터로 구성할 수 있다.도 11b는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우의 예시도이고, 도 11c는 본 발명의 실 [0131]시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 이메일을 통해 사용자에게 데이터를 제공하는 예시도이다.이하, 도 11b 및 도 11c를 참조하여, 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 이메일을 [0132]통해 사용자에게 데이터를 제공하는 예시를 상세히 설명하면 다음과 같다.본 실시 예에서는 이메일이 수신되면, 인공지능 엔진은 수신된 이메일을 분석하여 자신을 송신자로하는 별도의 [0133]이메일을 구성하거나 메시지를 구성하여 사용자에게 출력한다. 상기 인공지능 엔진은 이메일 수신, 문자 메시지수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나의 이벤트가 발생되는 경우 활성화되거나 또는 사용자의 선택에 의해 활성화될 수 있다. 즉, 사용자는 이러한 가상의 인물과 자연스러운 이메일을 송수신할 수 있다.또한, 인공지능 엔진은 제어부의 제어 하에 상술한 이벤트가 발생되는 경우, 이벤트에 대응한 정보의 수신 또는발생된 정보를 분석하고, 분석된 정보를 제공하기 위한 모듈을 선택한다. 그리고, 인공지능 엔진은 선택된 모듈을 통해서 분석된 정보를 포함하는 데이터를 구성할 수 있다. 또한, 인공지능 엔진은 선택된 모듈을 통해 사용공개특허 10-2015-0007862-22-자로부터 정보 요청을 수신할 수 있다.도 11b를 참조하면, 휴대 단말의 터치 스크린(1140)은 복수의 이메일을 디스플레이하고 있다. 이러한 이메일이 [0134]수신되면, 인공지능 엔진은 활성화되고, 이벤트에 대한 정보를 분석한다. 그리고, 분석 결과에 따라서 데이터를구성하여 사용자에게 출력한다. 예를 들어, 맛집에 관한 이메일(1141)이 수신되는 경우, 인공지능 엔진은 수신된 이메일을 분석하여 사용자에게 제공하기 위한 데이터를 구성한다. 도 11c는 맛집에 관한 이메일을 분석하여이메일을 통해 사용자에게 데이터를 제공하는 예시도로서, 터치 스크린은 인공지능 엔진에 해당되는 가상의 인물에 대한 정보를 상단 스크린(1160)에 표시하고, 하단 스크린(1170)에는 수신된 이메일을 통해 구성된 데이터를 디스플레이한다. 즉, 구성된 데이터는 인공지능 엔진의 가상의 인물에 의해 구성된 텍스트(1150)와 수신된이메일에 첨부된 적어도 하나 이상의 사진(1171)이 포함될 수 있다. 이와 같이, 인공지능 엔진은 수신된 이메일을 분석하여 도시된 바와 같이, 마치 자신이 보낸 것처럼 데이터를 구성할 수 있다. 이와 같이, 인공지능 엔진은 수신된 이벤트를 통해서 맛집에 대한 정보를 분석하고 사용자에게 제공하기 위한 [0135]데이터를 구성하여 터치 스크린(1150)을 통해 출력한다. 상기 구성된 데이터는 사용자에게 제공되어져야 하는정보를 포함한다. 이러한 문자 메시지를 통해서 사용자는 인공지능 엔진에 정보를 입력하거나 요청할 수 있다. 사용자로부터 문자 [0136]메시지를 통한 정보의 입력 또는 요청이 발생되면, 인공지능 엔진은 이를 분석하고, 요청에 대한 응답을 휴대단말에 기 저장된 정보를 통해서 제공할 수 있는지 또는 별도의 서버에 접속하여 응답에 대한 정보를 수신하여제공해야 하는지를 판단하고, 판단 결과에 따라서 응답에 대응하는 데이터를 구성하여 스피커 또는 이어폰을 통해 사용자에게 출력하거나 터치 스크린을 통해 출력할 수 있다. 또한, 인공지능 엔진은 요청에 대응하는 답변을저장하고 있는 서버에 접속하여 데이터를 수신한 후, 사용자에게 제공되기 위한 데이터로 구성할 수 있다.도 12는 본 발명의 다른 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 [0137]통해 데이터를 제공하는 방법을 나타낸 순서도이다.이하, 도 12를 참조하여, 본 발명의 다른 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 [0138]대응되는 모듈을 통해 데이터를 제공하는 방법을 상세히 설명하면 다음과 같다.이벤트가 발생되는 경우, 인공지능 엔진을 활성화하고, 수신된 메시지를 분석하여 이에 대응되는 데이터를 구성 [0139]한다(S1210, S1212). 휴대 단말은 인공지능 엔진이 구비되어 있으며, 사용자는 이러한 인공지능 엔진과 상호 의사소통뿐만 아니라 데이터를 송수신할 수 있다. 제어부는 사용자에게 제공되어야 하는 이벤트가 발생되거나 또는 사용자로부터 정보를 요청하는 문자 메시지가 수신되는 경우, 인공지능 엔진을 활성화하고, 활성화된 인공지능 엔진을 통해 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 정보에 대응하여 사용자에게 제공하고자 하는 데이터를 구성한다. 제어부는 수신 또는 발생된 이벤트에 대응되는 데이터에서 키워드를 추출하여 정보를 분석한다. 상기 정보는 사용자에게 제공되어야 하는 데이터이다. 이러한, 이벤트는 송신자가 사용자에게 제공하고자 하는 정보를 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신 및 콜 수신 중 적어도 하나를 포함한다. 또한, 상기 이벤트는 휴대 단말의 배터리 잔량이 부족함을 알려주기 위한 팝업 창 또는 콜 송신을포함한다. 또한, 상기 정보는 사용자에게 제공되어야 하는 키워드를 포함한다. 그리고, 제어부의 제어 하에 사용자로부터 입력된 요청에 해당되는 응답을 위해 구성되는 데이터를 의인화하여 사용자에게 제공한다. 또한, 상기 모듈은 사용자와 통신을 하기 위한 것으로서, 음성 통화, 영상 통화, 문자 메시지, 팝업 창 및 이메일 중 적어도 하나를 포함한다. 상기 과정(S1214)에서 구성된 데이터를 해당 모듈을 이용하여 출력한다(S1014, S1016). 제어부는 선택된 모듈을 [0140]통해서 구성된 데이터를 의인화하여 사용자에게 제공한다. 제어부는 상기 과정(S1214)에서 분석결과를 통해서사용자에게 제공하기 위한 모듈을 선택한다. 상기 모듈은 발생된 이벤트에 따라서 복수 개가 있다. 즉, 이메일송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게 되는 경우 이를 팝업, 음성 통화, 메시지 등을통해 사용자에게 알리는 모듈 그리고 음성 통화 영상 통화를 제공하는 통화 모듈을 포함한다. 제어부는 이러한모듈을 통해 수신되는 이벤트에 대응하여 정보를 분석한다. 그리고, 휴대 단말은 사용자에게 정보 또는 데이터를 제공하기 위한 복수의 모듈이 구비되어 있다. 그리고, 제어부는 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 문자 메시지로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 문자 메시지를 생성한공개특허 10-2015-0007862-23-다. 이러한, 문자 메시지는 추출된 키워드로 형성되어 사용자에게 터치 스크린을 통해 출력된다. 사용자는 이를통해서 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 이메일로 사용자에게 정보를 제공하고자 하는경우, 문자 메시지와 마찬가지로 이메일을 생성하고, 사용자에게 제공한다. 이러한 문자 데이터 또는 이메일은수신된 이벤트에 그림 파일이 존재할 경우, 그림 파일을 추가하여 생성될 수 있다. 이와 같이, 인공지능 엔진은context awareness 모듈을 통해 문자 메시지, 이메일을 통해 사용자와 의사소통을 할 수 있다. 이와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉,인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답을 사용자에게 문자 메시지 또는 이메일로 제공하도록 데이터를 구성할 수 있다.추가 정보가 요청되면, 요청된 정보에 대응되는 데이터를 구성하고, 구성된 데이터를 해당 모듈을 이용하여 출 [0141]력한다(S1218, S1220, S1216). 제어부는 사용자로부터 추가 정보가 요청되면, 인공지능 엔진을 제어하여 요청된정보를 분석한다. 그리고, 요청된 정보 또는 질의에 대한 응답을 기 저장된 데이터를 통해서 사용자에게 제공할수 있는지 또는 응답을 제공하는 서버를 통해 수신하여 사용자에게 제공해야하는지를 판단한다. 그리고, 상기과정(S1214)에서 구성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청된 데이터에 대한 응답을 포함하는 데이터를 구성하고, 구성된 데이터를 의인화하여 사용자에게 다시 출력한다.제어부는 사용자로부터 추가 요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접속 제어하여 요청에 대한 응답을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거나 또는 웹 페이지를 통해 얻어진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하는 기상청 서버, 위치를 제공하는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다.본 발명의 실시 예들은 하드웨어, 소프트웨어 또는 하드웨어 및 소프트웨어의 조합의 형태로 실현 가능하다는 [0142]것을 알 수 있을 것이다. 이러한 임의의 소프트웨어는 예를 들어, 삭제 가능 또는 재기록 가능 여부와상관없이, ROM 등의 저장 장치와 같은 휘발성 또는 비휘발성 저장 장치, 또는 예를 들어, RAM, 메모리 칩, 장치또는 집적 회로와 같은 메모리, 또는 예를 들어 CD, DVD, 자기 디스크 또는 자기 테이프 등과 같은 광학 또는자기적으로 기록 가능함과 동시에 기계(예를 들어, 컴퓨터)로 읽을 수 있는 저장 매체에 저장될 수 있다. 휴대단말 내에 포함될 수 있는 메모리는 본 발명의 실시 예들을 구현하는 명령어들을 포함하는 프로그램 또는 프로그램들을 저장하기에 적합한 기계로 읽을 수 있는 저장 매체의 한 예임을 알 수 있을 것이다. 따라서, 본 발명은 본 명세서의 임의의 청구항에 기재된 장치 또는 방법을 구현하기 위한 코드를 포함하는 프로그램 및 이러한프로그램을 저장하는 기계로 읽을 수 있는 저장 매체를 포함한다. 또한, 이러한 프로그램은 유선 또는 무선 연결을 통해 전달되는 통신 신호와 같은 임의의 매체를 통해 전자적으로 이송될 수 있고, 본 발명은 이와 균등한것을 적절하게 포함한다.또한, 상기 휴대 단말은 유선 또는 무선으로 연결되는 프로그램 제공 장치로부터 상기 프로그램을 수신하여 저 [0143]장할 수 있다. 상기 프로그램 제공 장치는 상기 휴대 단말의 데이터 제공을 제어하는 명령어들을 포함하는 프로그램, 휴대 단말이 사용자에게 데이터를 제공하는데 필요한 정보 등을 저장하기 위한 메모리와, 상기 휴대 단말과의 유선 또는 무선 통신을 수행하기 위한 통신부와, 상기 휴대 단말의 요청 또는 자동으로 해당 프로그램을상기 호스트 장치로 전송하는 제어부를 포함할 수 있다.한편, 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 [0144]한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해져서는 안되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다.부호의 설명110: 제어부 120: 이동통신 모듈 [0145]130: 서브 통신 모듈 140: 멀티미디어 모듈150: 카메라 모듈 160: 입/출력 모듈공개특허 10-2015-0007862-24-168: 입력 수단 170: 센서 모듈180: 전원 공급부 190: 터치 스크린도면도면1공개특허 10-2015-0007862-25-도면2공개특허 10-2015-0007862-26-도면3도면4공개특허 10-2015-0007862-27-도면5도면6공개특허 10-2015-0007862-28-도면7도면8공개특허 10-2015-0007862-29-도면9공개특허 10-2015-0007862-30-도면10도면11a공개특허 10-2015-0007862-31-도면11b도면11c공개특허 10-2015-0007862-32-도면12공개특허 10-2015-0007862-33-"}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 휴대 단말에 관한 것으로서, 특히 데이터 제공을 제어하는 휴대 단말 및 방법에 관한 것이다. 이를 위한 본 발명은 휴대 단말의 데이터 제공 방법에 있어서, 이벤트에 대응하여 수신 또는 발생된 정보를 분석 하는 과정과, 상기 분석된 정보를 상기 휴대 단말의 사용자에게 제공하기 위한 모듈을 선택하는 과정과, 상기 선 택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구성하여 제공하는 과정을 포함한다."}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 휴대 단말에 관한 것으로서, 특히 데이터 제공을 제어하는 휴대 단말 및 방법에 관한 것이다."}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 휴대 단말에서 제공하는 다양한 서비스 및 부가 기능들은 점차 확대되고 있다. 이러한 휴대 단말의 효용 가치를 높이고 사용자들의 다양한 욕구를 만족시키기 위해서 휴대 단말에서 실행 가능한 다양한 애플리케이션들 이 개발되고 있다. 이에 따라 최근 스마트 폰, 휴대폰, 노트 PC 및 태블릿 PC와 같은 이동이 가능하고, 터치 스 크린을 가지는 휴대 단말 내에는 적어도 수 개에서 수백 개의 애플리케이션들이 저장될 수 있다. 이와 같이, 휴대 단말은 사용자의 욕구를 충족하기 위해 음성 통화 서비스 뿐만 아니라 데이터 통신 서비스를 이용한 다양한 멀티 미디어 서비스를 제공하는 멀티미디어 장치로 발전하고 있으며, 이러한 휴대 단말의 확산으 로 인해 사용자들은 시간과 장소의 구애를 받지 않고 휴대 단말을 사용할 수 있다. 그런데, 종래 휴대 단말은 사용자와 통신에 있어서 단지 팝업 또는 특정 페이지 형태의 정보를 제공하는 수준이 다. 이와 같이, 팝업 형태 또는 애플리케이션 내에서 사용자 요청에 의한 경우만 정보를 제공하기 때문에 친근 성이 떨어진다. 따라서, 사용자와 보다 친숙하고 의사 소통뿐만 아니라 데이터 송수신을 제공하는 의인화된 휴 대 단말의 필요성이 제기된다."}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 휴대 단말을 의인화하고 사용자에게 친숙함을 제공할 수 있는 정보 제공을 통해 사용자 경험을 제공하 는 필요성이 요구된다."}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "따라서 본 발명은 데이터 제공을 제어하는 휴대 단말 및 방법을 제공한다. 또한, 본 발명은 휴대 단말에 사람과 의사소통을 제공하는 인공지능 엔진을 탑재하여 사람과 자연스러운 의사소 통 뿐만 아니라 데이터 송수신을 제공한다. 상술한 바를 달성하기 위해 본 발명은 휴대 단말의 데이터 제공 방법에 있어서, 이벤트에 대응하여 수신 또는 발생된 정보를 분석하는 과정과, 상기 분석된 정보를 상기 휴대 단말의 사용자에게 제공하기 위한 모듈을 선택 하는 과정과, 상기 선택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구성하여 제공하는 과정을 포 함한다. 바람직하게, 본 발명은 상기 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 상기 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성하여 상기 선택된 모듈을 통해 상기 사용자에게 제공하는 과정을 더 포 함한다. 바람직하게, 본 발명에 따른 데이터는 상기 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 바람직하게, 본 발명에 따른 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배 터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 바람직하게, 본 발명에 따른 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 모듈은 상기 수신된 이메일 또는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 상기 구성된 데이터 를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다.바람직하게, 본 발명에 따른 이벤트가 휴대 단말의 배터리 잔량 부족 발생인 경우, 모듈은 상기 배터리의 잔량 을 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통 해 상기 사용자에게 제공한다. 바람직하게, 본 발명에 따른 이벤트가 콜 수신인 경우, 모듈은 상기 콜을 송신한 사용자 이름 및 휴대 단말의 전화번호 중 적어도 하나의 추출에 대응하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다. 또한, 상술한 바를 달성하기 위해 본 발명은 휴대 단말의 데이터 제공 방법에 있어서, 이벤트 수신을 감지하여 인공지능 엔진을 활성화하는 과정과, 사용자로부터 정보 요청이 입력되는 경우, 상기 활성화된 인공지능 엔진을 통해 상기 입력된 요청을 분석하고, 상기 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성하는 과정과, 상기 이벤트를 수신한 모듈을 통해 상기 구성된 데이터를 제공하는 과정을 포함한다. 바람직하게, 본 발명에 따른 이벤트는 사용자로부터 수신되는 콜 및 메시지 중 적어도 하나를 포함한다. 바람직하게, 본 발명에 따른 이벤트가 콜 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 음성 을 통해서 상기 요청을 분석한다. 바람직하게, 본 발명에 따른 이벤트가 메시지 수신인 경우, 상기 인공지능 엔진은 상기 사용자로부터 입력되는 메시지의 텍스트를 통해서 상기 요청을 분석한다. 바람직하게, 본 발명에 따른 인공지능 엔진은 상기 분석된 요청에 대한 응답을 기 저장된 정보로부터 추출하거 나 또는 상기 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 상기 사용자에게 제공한다. 바람직하게, 본 발명에 따른 인공지능 엔진은 상기 휴대 단말에 구비되며, 음성 통화, 영상 통화 및 메시지 송 수신 중 적어도 하나를 통해 상기 사용자와 통신 가능하다. 또한, 상술한 바를 달성하기 위해 본 발명은 데이터를 제공하는 휴대 단말에 있어서, 사용자에게 제공되기 위한 이벤트를 수신하는 송수신부와, 상기 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고, 상기 분석된 정보를 제공하기 위한 모듈을 선택하고, 상기 선택된 모듈을 통해서 상기 분석된 정보를 포함하는 데이터를 구 성하여, 상기 송수신부를 통해 출력 제어하는 제어부를 포함한다. 바람직하게, 본 발명에 따른 제어부는 상기 수신 또는 발생된 정보에서 키워드를 추출하여 상기 사용자에게 제 공되도록 데이터를 구성한다. 바람직하게, 본 발명에 따른 이벤트는 상기 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수 신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 바람직하게, 본 발명은 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 제어부는 상기 수신된 이메일 또 는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다. 바람직하게, 본 발명은 이벤트가 상기 휴대 단말의 배터리 잔량 부족 발생인 경우, 제어부는 상기 배터리의 잔 량을 추출하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 상기 사용자에게 제공하다. 바람직하게, 본 발명은 이벤트가 콜 수신인 경우, 제어부는 상기 콜을 송신한 사용자 이름 및 휴대 단말의 전화 번호 중 적어도 하나의 추출에 대응하여 데이터를 구성하고, 상기 구성된 데이터를 음성 통화, 영상 통화 및 팝 업 창 중 적어도 하나를 통해 상기 사용자에게 제공한다. 바람직하게, 본 발명은 사용자로부터 정보 요청이 입력되는 경우, 상기 제어부는 인공지능 엔진을 활성화하여 상기 입력된 요청을 분석하고, 상기 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성한다."}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 휴대 단말에 사람과 의사소통을 제공하는 인공지능 엔진을 탑재하여 사람과 자연스러운 의사 소통뿐만 아니라 데이터 송수신을 제공함으로써 휴대 단말에 좀더 친근함과 애착감을 가질 수 있고 즐거운 사용 자 경험을 제공할 수 있다."}
{"patent_id": "10-2013-0082435", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 여 상세하게 설명한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미 를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예에 대한 동작 원리를 상세히 설명한다. 하기에서 본 발명을 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능 을 고려하여 정의된 용어들로서 이는 사용자, 사용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 먼저, 본 발명에서 사용되는 용어의 정의는 다음과 같다. 휴대 단말: 휴대 가능하고 데이터 송수신과 음성 및 영상 통화가 가능한 이동 단말로서 적어도 하나의 터치 스 크린이 구비될 수 있다. 이러한, 휴대 단말은 스마트 폰, 태블릿 PC, 3D-TV, 스마트 TV, LED TV, LCD TV등을 포 함하며 이외도 주변 기기 또는 원거리에 위치한 다른 단말과 통신할 수 있는 모든 단말을 포함한다. 입력 유닛: 터치 스크린상의 접촉 또는 호버링과 같은 비접속 상태에서도 휴대 단말에 명령 또는 입력을 제공할 수 있는 전자펜, 및 스타일러스 펜 중 적어도 하나를 포함한다. 객체: 휴대 단말의 터치 스크린상에 디스플레이되거나, 디스플레이될 수 있는 것으로서, 문서, 위젯, 사진, 지 도, 동영상, 이메일, SMS 메시지 및 MMS 메시지 중 적어도 하나를 포함하며 입력 유닛에 의해 실행, 삭제, 취소, 저장 및 변경될 수 있다. 이러한, 객체는 단축 아이콘, 썸네일 이미지 및 휴대 단말에서 적어도 하나의 객체를 저장하고 있는 폴더를 포괄하는 의미로도 사용될 수 있다. 단축 아이콘: 각각의 애플리케이션 또는 휴대 단말에서 기본적으로 제공되는 통화, 연락처, 메뉴 등의 빠른 실 행을 위해 휴대 단말의 터치 스크린상에 디스플레이되는 것으로서, 이를 실행하기 위한 명령 또는 입력이 입력 되면 해당 애플리케이션을 실행한다. 도 1은 본 발명의 일 실시 예에 따른 휴대 단말을 나타내는 개략적인 블록도이다. 도 1을 참조하면, 휴대 단말은 이동 통신 모듈, 서브통신 모듈, 커넥터, 및 이어폰 연결잭 중 적어도 하나를 이용하여 외부 장치(도시되지 아니함)와 연결될 수 있다. 이러한, 외부 장치는 상기 휴 대 단말에 탈착되어 유선으로 연결 가능한 이어폰(Earphone), 외부 스피커(External speaker), USB(Universal Serial Bus) 메모리, 충전기, 크래들/도크(Cradle/Dock), DMB 안테나, 모바일 결제 관련 장치, 건강 관리 장치(혈당계 등), 게임기, 자동차 네비게이션 장치 등 다양한 장치들을 포함할 수 있다. 또한 상기 외부 장치는 무선으로 연결 가능한 블루투스 통신 장치, NFC(Near Field Communication) 장치 및 WiFi Direct 통신 장치, 무선 액세스 포인트(AP, Access Point)를 포함할 수 있다. 그리고, 휴대 단말은 유선 또는 무선을 이용하여 다른 장치, 즉 휴대폰, 스마트폰, 태블릿 PC, 데스크탑 PC, 및 서버와 연결될 수 있다. 도 1을 참조하면, 휴대 단말은 적어도 하나의 터치 스크린 및 적어도 하나의 터치 스크린 컨트롤러 를 포함한다. 또한, 휴대 단말은 제어부, 이동통신 모듈, 서브통신 모듈, 멀티미디어 모듈, 카메라 모듈, GPS모듈, 입/출력 모듈, 센서 모듈, 저장부 및 전원 공급 부를 포함한다. 서브통신 모듈은 무선랜 모듈 및 근거리통신 모듈 중 적어도 하나를 포함하고, 멀티미디어 모듈 은 방송통신 모듈, 오디오 재생 모듈 및 동영상재생 모듈 중 적어도 하나를 포함한다. 카 메라 모듈은 제1 카메라 및 제2 카메라 중 적어도 하나를 포함한다. 또한, 본 발명의 휴대 단말 의 카메라 모듈은 휴대 단말의 주 용도에 따라 제1 및/또는 제2 카메라(151, 152)의 줌 인/줌 아웃을 위한 경통부, 상기 경통부의 줌 인/줌 아웃을 위해 경통부의 움직임을 제어하는 모터부 , 촬영을 위해 광원을 제공하는 플래시 중 적어도 하나를 포함할 수 있다. 그리고, 입/출력 모듈 은 버튼, 마이크, 스피커, 진동모터, 커넥터, 및 키패드 중 적어도 하나 를 포함한다. 제어부는 CPU, 휴대 단말의 제어를 위한 제어프로그램이 저장된 롬(ROM, 112) 및 휴대 단말 의 외부로부터 입력되는 신호 또는 데이터를 기억하거나, 휴대 단말에서 수행되는 작업을 위한 기억 영역으로 사용되는 램(RAM, 113)을 포함할 수 있다. CPU는 싱글 코어, 듀얼 코어, 트리플 코어, 또는 쿼드 코어를 포함할 수 있다. CPU, 롬 및 램은 내부버스(bus)를 통해 상호 연결될 수 있다. 또한, 제어부는 이동통신 모듈, 서브통신 모듈, 멀티미디어 모듈, 카메라 모듈, GPS 모듈, 입/출력 모듈, 센서 모듈, 저장부, 전원 공급부, 터치 스크린, 및 터치 스크린 컨트롤러를 제어할 수 있다. 또한, 제어부는 터치 스크린 상에 복수의 객체들이 디스플레이된 상태에서 전자 펜 등의 터치 가능한 입력 유닛에 의해 어느 하나의 객체에 근접함에 따른 호버링이 인식되는지 판단하고, 호버링이 발생한 위 치에 대응하는 객체를 식별한다. 또한, 제어부는 휴대 단말로부터 입력 유닛까지의 높이와, 높이에 따른 호버링 입력 이벤트를 감지할 수 있는데, 이러한, 호버링 입력 이벤트는 입력 유닛에 형성된 버튼 눌림, 입력 유닛에 대한 두드림, 입력 유닛이 미리 정해진 속도보다 빠르게 이동함, 객체에 대한 터치 중 적어도 하나 를 포함한다. 또한, 제어부는 이벤트에 대응하여 수신 또는 발생된 정보를 분석하고, 분석된 정보를 휴대 단말의 사용자 에게 제공하기 위한 모듈을 선택하고, 선택된 모듈을 통해서 분석된 정보를 포함하는 데이터를 의인화되도록 구 성하여 사용자에게 제공한다. 만일, 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 제어부(11 0)는 입력된 요청에 해당되는 응답에 대응되는 데이터를 의인화되도록 구성하여 선택된 모듈을 통해 사용자에게 의인화되어 제공한다. 또한, 제어부는 상기 수신 또는 발생된 이벤트에서 키워드를 추출하고, 추출된 키워 드를 통해 사용자에게 의인화되어 제공되도록 데이터를 구성한다. 상기 데이터를 구성한다는 의미는 사용자에게 음성, 영상 또는 메시지를 출력하여 사용자가 이를 인지할 수 있도록 하기 위한 것을 포함한다. 또한, 상기 모 듈은 이벤트에 대응하여 수신된 정보를 사용자에게 제공하기 위한 모듈로서, 이벤트의 종류에 따라 서로 다를 수 있다. 그리고, 상기 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 또한, 상기 모듈은 음성 통화 모듈, 영상 통화 모듈, 문자 메시지 모듈, 팝업 창 모듈 및 이메일 모듈 중 적어도 하나를 포함한다. 만일, 상기 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 제어부는 수신된 이메일 또는 문자 메시지에 포함된 키워드 및 그림 중 적 어도 하나를 추출하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 사용자에게 제공한다. 또한, 제어부는 이벤트 수신이 감지되는 경우 인공지능 엔진을 활성화하고, 사용자로부터 정보 요청이 입 력되는 경우, 활성화된 인공지능 엔진을 통해 입력된 요청을 분석하고, 분석된 요청에 해당되는 응답을 포함하 는 데이터를 구성하고, 상기 이벤트를 수신한 모듈을 통해 의인화되도록 구성된 데이터를 사용자에게 제공한다. 상기 이벤트는 사용자로부터 수신되는 콜 및 메시지 중 적어도 하나를 포함한다. 만일, 이벤트가 사용자로부터 수신한 콜인 경우, 인공지능 엔진은 제어부의 제어 하에 사용자로부터 입력되는 음성을 통해서 상기 요청 을 분석한다. 그리고, 이벤트가 메시지 수신인 경우 인공지능 엔진은 사용자로부터 입력되는 메시지의 텍스트를 통해서 요청을 분석한다. 이러한, 인공지능 엔진은 제어부의 제어 하에 휴대 단말의 사용자와 의사소통을 제공하기 위한 엔진으로서 분석된 요청에 대한 응답을 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대 응되는 정보를 저장하고 있는 서버에 접속한 후, 서버로부터 응답을 수신하여 사용자에게 제공한다. 또한, 인공 지능 엔진은 제어부 내에 구비되거나 별도의 장치에 구비될 수 있다. 그리고, 인공지능 엔진은 음성 통화, 영상 통화 및 메시지 송수신 중 적어도 하나를 통해 사용자와 통신 가능하며, 상기 요청에 해당되는 응답을 사 용자에게 음성, 영상 또는 메시지로 제공하도록 데이터를 구성할 수 있다. 그리고, 이동통신 모듈은 제어부의 제어에 따라 적어도 하나-하나 또는 복수-의 안테나(도시되지 아 니함)를 이용하여 이동 통신을 통해 휴대 단말이 외부 장치와 연결되도록 할 수 있다. 이동통신 모듈(12 0)은 휴대 단말에 입력되는 전화번호를 가지는 휴대폰(도시되지 아니함), 스마트폰(도시되지 아니함), 태 블릿 PC 또는 다른 장치(도시되지 아니함)와 음성 통화, 화상 통화, 문자메시지(SMS) 또는 멀티미디어 메시지 (MMS)를 위한 무선 신호를 송/수신한다. 서브통신 모듈은 무선랜 모듈과 근거리통신 모듈 중 적어도 하나를 포함할 수 있다. 예를 들어, 무선랜 모듈만 포함하거나, 근거리통신 모듈만 포함하거나 또는 무선랜 모듈과 근거리통신 모듈 을 모두 포함할 수 있다. 무선랜 모듈은 제어부의 제어에 따라 무선 액세스 포인트(AP, access point)(도시되지 아니함)가 설 치된 장소에서 인터넷에 연결될 수 있다. 무선랜 모듈은 미국전기전자학회(IEEE)의 무선랜 규격 (IEEE802.11x)을 지원한다. 근거리통신 모듈은 제어부의 제어에 따라 휴대 단말과 화상형성장치 (도시되지 아니함)사이에 무선으로 근거리 통신을 할 수 있다. 근거리 통신방식은 블루투스(bluetooth), 적외선 통신(IrDA, infrared data association), 와이파이 다이렉트(WiFi-Direct) 통신, NFC(Near Field Communication) 등이 포함될 수 있다. 그리고, 휴대 단말은 성능에 따라 이동통신 모듈, 무선랜 모듈, 및 근거리통신 모듈 중 적 어도 하나를 포함할 수 있다. 또한, 휴대 단말은 성능에 따라 이동통신 모듈, 무선랜 모듈, 및 근거리통신 모듈들의 조합을 포함할 수 있다. 본 발명에서는 이러한, 이동통신 모듈, 무선랜 모듈 및 근거리통신 모듈 중 적어도 하나 또는 이들의 조합을 송수신부라 칭하며, 이는 본 발명의 범위를 축소하지 않는다. 또한, 상기 송수신부는 터치 스크린을 포함한다. 멀티미디어 모듈은 방송통신 모듈, 오디오 재생 모듈 또는 동영상재생 모듈을 포함할 수 있다. 방송통신 모듈은 제어부의 제어에 따라 방송통신 안테나(도시되지 아니함)를 통해 방송국에서 부터 송출되는 방송 신호(예, TV방송 신호, 라디오 방송 신호 또는 데이터 방송 신호) 및 방송부가 정보(예, EPG(Electronic Program Guide) 또는 ESG(Electronic Service Guide))를 수신할 수 있다. 오디오재생 모듈 은 제어부의 제어에 따라 저장되거나 또는 수신되는 디지털 오디오 파일(예, 파일 확장자가 mp3, wma, ogg 또는 wav인 파일)을 재생할 수 있다. 동영상재생 모듈은 제어부의 제어에 따라 저장되거나 또는 수신되는 디지털 동영상 파일(예, 파일 확장자가 mpeg, mpg, mp4, avi, mov, 또는 mkv인 파일)을 재생할 수 있다. 동영상재생 모듈은 디지털 오디오 파일을 재생할 수 있다. 멀티미디어 모듈은 방송통신 모듈을 제외하고 오디오재생 모듈과 동영상재생 모듈을 포함 할 수 있다. 또한, 멀티미디어 모듈의 오디오재생 모듈 또는 동영상재생 모듈은 제어부에 포함될 수 있다. 카메라 모듈은 제어부의 제어에 따라 정지이미지 또는 동영상을 촬영하는 제1 카메라 및 제2 카 메라 중 적어도 하나를 포함할 수 있다. 또한, 카메라 모듈은 피사체를 촬영하기 위해 줌 인/줌 아웃 을 수행하는 경통부, 상기 경통부의 움직임을 제어하는 모터부, 피사체를 촬영하기 위해 필요한 보조 광원을 제공하는 플래시 중 적어도 하나를 포함할 수 있다. 제1 카메라는 상기 휴대 단말 전면에 배치되고, 제2 카메라는 상기 휴대 단말의 후면에 배치될 수 있다. 달리 취한 방식으로, 제1 카메라와 제2 카메라는 인접(예, 제1 카메라와 제2 카메라의 간격이 1 cm 보다 크고, 8 cm 보다는 작은)하게 배치되어 3차원 정지이미지 또는 3차원 동영상을 촬영할 수 있다. 또한, 제1 및 제2 카메라(151, 152)는 각각 렌즈계, 이미지 센서 등을 포함할 수 있다. 제1 및 제2 카메라(151, 152)는 각각 렌즈계를 통해 입력되는(또는 촬영되는) 광신호를 전기적인 이미지 신호로 변환하여 제어부로 출력하고, 사용자는 이러한 제1 및 제2 카메라(151, 152)를 통해 동영상 또는 정지 이미지를 촬영할 수 있다. GPS 모듈은 지구 궤도상에 있는 복수의 GPS위성(도시되지 아니함)에서부터 전파를 수신하고, GPS위성(도시 되지 아니함)에서부터 휴대 단말까지 전파도달시간(Time of Arrival)을 이용하여 휴대 단말의 위치를 산출할 수 있다. 입/출력 모듈은 복수의 버튼, 마이크, 스피커, 진동모터, 커넥터, 키패드 , 이어폰 연결잭 및 입력 유닛 중 적어도 하나를 포함할 수 있다. 그리고, 이러한 입/출력 모듈 은 이에 국한되지 않으며, 마우스, 트랙볼, 조이스틱 또는 커서 방향 키들과 같은 커서 컨트롤(cursor contro l)이 제어부와의 통신 상기 터치 스크린 상의 커서 움직임 제어를 위해 제공될 수 있다. 버튼은 상기 휴대 단말의 하우징의 전면, 측면 또는 후면에 형성될 수 있으며, 전원/잠금 버튼(도시 되지 아니함), 볼륨버튼(도시되지 아니함), 메뉴 버튼, 홈 버튼, 돌아가기 버튼(back button) 및 검색 버튼 중 적어도 하나를 포함할 수 있다. 마이크는 제어부의 제어에 따라 음성(voice) 또는 사운드(sound)를 입력 받아 전기적인 신호를 생성 한다. 스피커는 제어부의 제어에 따라 이동통신 모듈, 서브통신 모듈, 멀티미디어 모듈 또 는 카메라 모듈의 다양한 신호(예, 무선신호, 방송신호, 디지털 오디오 파일, 디지털 동영상 파일 또는 사 진 촬영 등)에 대응되는 소리를 휴대 단말 외부로 출력할 수 있다. 그리고, 스피커는 휴대 단말(10 0)이 수행하는 기능에 대응되는 사운드(예, 전화 통화에 대응되는 버튼 조작음, 또는 통화 연결음)를 출력할 수 있다. 스피커는 상기 휴대 단말의 하우징의 적절한 위치 또는 위치들에 하나 또는 복수로 형성될 수 있다. 진동 모터는 제어부의 제어에 따라 전기적 신호를 기계적 진동으로 변환할 수 있다. 예를 들어, 진동 모드에 있는 휴대 단말은 다른 장치(도시되지 아니함)로부터 음성통화가 수신되는 경우, 진동모터가동작한다. 상기 휴대 단말의 하우징 내에 하나 또는 복수로 형성될 수 있다. 진동모터는 터치 스크린 상을 터치하는 사용자의 터치 동작 및 터치 스크린 상에서의 터치의 연속적인 움직임에 응답하여 동 작할 수 있다. 커넥터는 상기 휴대 단말과 외부 장치(도시되지 아니함)또는 전원소스(도시되지 아니함)를 연결하기 위한 인터페이스로 이용될 수 있다. 상기 휴대 단말은 제어부의 제어에 따라 커넥터에 연결된 유선 케이블을 통해 휴대 단말의 저장부에 저장된 데이터를 외부 장치(도시되지 아니함)로 전송하거 나 또는 외부 장치(도시되지 아니함)로부터 데이터를 수신할 수 있다. 또한 상기 휴대 단말은 커넥터(16 5)에 연결된 유선 케이블을 통해 전원소스(도시되지 아니함)로부터 전원을 입력받거나, 상기 전원소스를 이용하 여 배터리(도시되지 아니함)를 충전할 수 있다. 키패드는 휴대 단말의 제어를 위해 사용자로부터 키 입력을 수신할 수 있다. 키패드는 휴대 단 말에 형성되는 물리적인 키패드(도시되지 아니함) 또는 터치 스크린에 표시되는 가상의 키패드(도시 되지 아니함)를 포함한다. 휴대 단말에 형성되는 물리적인 키패드(도시되지 아니함)는 휴대 단말의 성능 또는 구조에 따라 제외될 수 있다. 이어폰 연결잭(Earphone Connecting Jack, 167)에는 이어폰(도시되지 아니함)이 삽입되어 상기 휴대 단말(10 0)에 연결될 수 있고, 입력 유닛은 휴대 단말 내부에 삽입되어 보관될 수 있으며, 사용시에는 상기 휴대 단말로부터 인출 또는 탈착될 수 있다. 이러한, 입력 유닛이 삽입되는 휴대 단말 내부의 일 영역에는 상기 입력 유닛의 장착 및 탈착에 대응하여 동작하는 탈부착 인식 스위치가 구비되어, 제어부로 상기 입력 유닛의 장착 및 탈착에 대응하는 신호를 제공할 수 있다. 탈부착 인식 스위치 는 입력 유닛이 삽입되는 일 영역에 마련되어, 상기 입력 유닛의 장착시 직간접적으로 접촉되도 록 구비된다. 이에 따라, 탈부착 인식 스위치는 상기 입력 유닛과의 직간접적으로 접촉에 기초하여, 상기 입력 유닛의 장착이나 탈착에 대응하는 신호를 생성하고, 제어부에 제공한다. 센서 모듈은 휴대 단말의 상태를 검출하는 적어도 하나의 센서를 포함한다. 예를 들어, 센서모듈 은 사용자의 휴대 단말에 대한 접근 여부를 검출하는 근접센서, 휴대 단말 주변의 빛의 양을 검 출하는 조도센서(도시되지 아니함), 또는 휴대 단말의 동작(예, 휴대 단말의 회전, 휴대 단말에 가해지는 가속도 또는 진동)을 검출하는 모션 센서(도시되지 아니함), 지구 자기장을 이용해 방위(point of the compass)를 검출하는 지자기 센서(Geo-magnetic Sensor, 도시되지 아니함), 중력의 작용 방향을 검출하는 중력 센서(Gravity Sensor), 대기의 압력을 측정하여 고도를 검출하는 고도계(Altimeter)를 포함할 수 있다. 적어도 하나의 센서는 상태를 검출하고, 검출에 대응되는 신호를 생성하여 제어부로 전송할 수 있다. 센서모듈 의 센서는 휴대 단말의 성능에 따라 추가되거나 삭제될 수 있다. 저장부는 제어부의 제어에 따라 이동통신 모듈, 서브통신 모듈, 멀티미디어 모듈, 카 메라 모듈, GPS모듈, 입/출력 모듈, 센서 모듈, 터치 스크린의 동작에 대응되게 입/ 출력되는 신호 또는 데이터를 저장할 수 있다. 저장부는 휴대 단말 또는 제어부의 제어를 위한 제어 프로그램 및 애플리케이션들을 저장할 수 있다. 이러한, 저장부라는 용어는 저장부, 제어부내 롬, 램 또는 휴대 단말에 장착되는 메 모리 카드(도시되지 아니함)(예, SD 카드, 메모리 스틱)를 포함한다. 저장부는 비휘발성 메모리, 휘발성 메모리, 하드 디스크 드라이브(HDD)또는 솔리드 스테이트 드라이브(SSD)를 포함할 수 있다. 또한, 상기 저장부는 네비게이션, 화상 통화, 게임, 사용자에게 시간을 기반으로 하는 알람 애플리케이션 등과 같은 다양한 기능들의 애플리케이션들과 이와 관련된 그래픽 사용자 인터페이스(graphical user interface: GUI)를 제공하기 위한 이미지들, 사용자 정보, 문서, 터치 입력을 처리하는 방법과 관련된 데이터베 이스들 또는 데이터, 상기 휴대 단말을 구동하는데 필요한 배경 이미지들(메뉴 화면, 대기 화면 등) 또는 운영 프로그램들, 카메라 모듈에 의해 촬영된 이미지들 등을 저장할 수 있다. 상기 저장부는 기계(예 를 들어, 컴퓨터)로 읽을 수 있는 매체이며, 기계로 읽을 수 있는 매체라는 용어는 기계가 특정 기능을 수행할 수 있도록 상기 기계로 데이터를 제공하는 매체로 정의될 수 있다. 기계로 읽을 수 있는 매체는 저장 매체일 수 있다. 상기 저장부는 비휘발성 매체(non-volatile media) 및 휘발성 매체를 포함할 수 있다. 이러한 모든 매체는 상기 매체에 의해 전달되는 명령들이 상기 명령들을 상기 기계로 읽어 들이는 물리적 기구에 의해 검출 될 수 있도록 유형의 것이어야 한다. 상기 기계로 읽을 수 있는 매체는, 이에 한정되지 않지만, 플로피 디스크(floppy disk), 플렉서블 디스크 (flexible disk), 하드 디스크, 자기 테이프, 시디롬(compact disc read-only memory: CD-ROM), 광학 디스크, 펀치 카드(punch card), 페이퍼 테이프(paper tape), 램, 피롬(Programmable Read-Only Memory: PROM), 이피롬 (Erasable PROM: EPROM) 및 플래시-이피롬(FLASH-EPROM) 중의 적어도 하나를 포함한다. 전원 공급부는 제어부의 제어에 따라 휴대 단말의 하우징에 배치되는 하나 또는 복수의 배터리 (도시되지 아니함)에 전원을 공급할 수 있다. 하나 또는 복수의 배터리(도시되지 아니함)는 휴대 단말에 전원을 공급한다. 또한, 전 원공급부는 커넥터와 연결된 유선 케이블을 통해 외부의 전원소스(도시되 지 아니함)에서부터 입력되는 전원을 휴대 단말로 공급할 수 있다. 또한, 전원 공급부는 무선 충전 기술을 통해 외부의 전원소스로부터 무선으로 입력되는 전원을 휴대 단말로 공급할 수도 있다. 그리고, 휴대 단말은 사용자에게 다양한 서비스(예, 통화, 데이터 전송, 방송, 사진촬영)에 대응되는 유저 인터페이스를 제공하는 적어도 하나의 터치 스크린을 포함할 수 있다. 이러한, 각각의 터치 스크린은 유저 인터 페이스에 입력되는 적어도 하나의 터치에 대응되는 아날로그 신호를 해당 터치 스크린 컨트롤러로 전송할 수 있 다. 이와 같이, 휴대 단말은 복수의 터치 스크린을 구비할 수 있는데, 각각의 터치 스크린 별로 터치에 대 응되는 아날로그 신호를 수신하는 터치 스크린 컨트롤러가 구비될 수 있다. 이러한, 각각의 터치 스크린은 힌지 의 연결을 통한 복수의 하우징에 각각 연결되거나 또는 복수의 터치 스크린들이 힌지 연결 없이 하나의 하우징 에 위치할 수 있다. 본 발명에 따른 휴대 단말은 상술한 바와 같이, 적어도 하나의 터치 스크린을 구비할 수 있으며, 이하에서는 설명 편의상 하나의 터치 스크린의 경우에 대해서 설명한다. 이러한, 터치 스크린은 사용자의 신체(예, 엄지를 포함하는 손가락) 또는 터치 가능한 입력 유닛(예, 스타 일러스 펜, 전자 펜)을 통해 적어도 하나의 터치를 입력받을 수 있다. 또한, 터치 스크린은 스타일러스 펜 또는 전자 펜과 같은 펜을 통해서 입력되면, 이를 인식하는 펜 인식 패널을 포함하며, 이러한 펜 인식 패 널은 펜과 터치 스크린간의 거리를 자기장을 통해 파악할 수 있다. 또한, 터치 스크린은 적어도 하나의 터치 중에서, 하나의 터치의 연속적인 움직임을 입력받을 수 있다. 터치 스크린은 입력되는 터치의 연속적인 움직임에 대응되는 아날로그 신호를 터치 스크린 컨트롤러로 전송할 수 있다. 나아가, 본 발명에서 터치는 터치 스크린과 사용자의 신체 또는 터치 가능한 입력 유닛과의 접촉에 한정되 지 않고, 비접촉(예: 터치 스크린과 사용자의 신체 또는 터치 가능한 입력 유닛 접촉하지 않고 검출가능한 간격을 포함할 수 있다. 터치 스크린에서 검출가능한 간격은 휴대 단말의 성능 또는 구조에 따라 변 경될 수 있으며, 특히 터치 스크린은 사용자의 신체 또는 터치 가능한 입력 유닛과의 접촉에 의한 터치 이 벤트와, 비접촉 상태로의 입력(예컨대, 호버링(Hovering)) 이벤트를 구분하여 검출 가능하도록, 상기 터치 이벤 트와 호버링 이벤트에 의해 검출되는 값(예컨대, 아날로그 값으로 전압 값 또는 전류 값을 포함)이 다르게 출력 될 수 있도록 구성된다. 더 나아가, 터치 스크린은 호버링 이벤트가 발생되는 공간과 터치 스크린 사 이의 거리에 따라, 검출되는 값(예컨대, 전류값 등)을 다르게 출력하는 것이 바람직하다. 이러한, 터치 스크린은 예를 들어, 저항막(resistive) 방식, 정전용량(capacitive) 방식, 적외선 (infrared) 방식 또는 초음파(acoustic wave) 방식으로 구현될 수 있다. 또한, 터치 스크린은 사용자의 신체 및 터치 가능한 입력 유닛에 의한 입력을 순차적 또는 동시에 입력받 을 수 있도록, 사용자의 신체 및 터치 가능한 입력 유닛의 터치나 근접을 각각 감지할 수 있는 적어도 두 개의 터치스크린 패널을 포함할 수 있다. 상기 적어도 두 개의 터치스크린 패널은 서로 다른 출력 값을 터치 스크린 컨트롤러에 제공하고, 터치 스크린 컨트롤러는 상기 적어도 두 개의 터치스크린 패널에서 입력되는 값을 서로 다르게 인식하여, 터치 스크린으로부터의 입력이 사용자의 신체에 의한 입력인지, 터치 가능한 입력 유닛 에 의한 입력인지를 구분할 수 있다. 그리고, 터치 스크린은 적어도 하나 이상의 객체를 디스플레이한다. 보다 상세하게, 터치 스크린은 입력 유닛을 통한 입력을 유도 기전력의 변화를 통해 감지하는 패널과, 터치 스크린에 핑거를 통한 접촉을 감지하는 패널이 서로 밀착되거나 또는 일부 이격되어 차례로 적층된 구조로 형성될 수 있다. 이러한, 터치 스크린은 다수의 픽셀들을 구비하고, 상기 픽셀들을 통해 영 상을 표시한다. 이러한 터치 스크린은 액정 표시 장치(Liquid Crystal Display: LCD), 유기 발광 다이오 드(Organic Light Emitting Diodes: OLED 및 LED등을 사용할 수 있다. 또한, 터치 스크린은 표면에 입력 유닛이 닿거나, 터치 스크린의 일정 거리에 놓이게 되면, 놓 인 위치를 파악하는 복수의 센서를 구성하고 있다. 복수의 센서들 각각은 코일 구조로 형성될 수 있으며, 복수 의 센서들로 형성되는 센서층은 각각의 센서들이 기 설정된 패턴들을 가지며, 복수의 전극 라인을 형성한다. 이 러한, 구조로 인해 터치 스크린은 입력 유닛을 통해 터치 스크린에 접촉 또는 호버링 입력이 발생되면, 센서층과 입력 유닛 사이의 자기장에 기인하여 파형이 변경된 감지 신호가 발생되는데, 터치 스크린 은 발생된 감지 신호를 제어부로 전송한다. 또한, 터치 스크린은 핑거를 통해 터치 스크린(19 0)에 접촉이 발생되면, 정전용량에 기인한 감지 신호를 제어부로 전송한다. 그리고, 입력 유닛과 터 치 스크린간의 일정 거리는 코일에 의해 형성된 자기장의 세기를 통해 파악될 수 있다. 이하에서는 이러한, 진동 세기를 설정하는 과정에 대해서 설명한다. 한편, 터치 스크린 컨트롤러는 터치 스크린에서부터 수신된 아날로그 신호를 디지털 신호(예, X와 Y 좌표)로 변환하여 제어부로 전송한다. 제어부는 터치 스크린 컨트롤러로부터 수신된 디지털 신 호를 이용하여 터치 스크린을 제어할 수 있다. 예를 들어, 제어부는 터치 이벤트 또는 호버링 이벤트 에 응답하여 터치 스크린에 표시된 단축 아이콘(도시되지 아니함) 또는 객체가 선택되게 하거나 또는 실행 할 수 있다. 또한, 터치 스크린 컨트롤러는 제어부에 포함될 수도 있다. 더 나아가, 터치 스크린 컨트롤러는 터치 스크린을 통해 출력되는 값(예컨대, 전류값 등)을 검출하여 호버링 이벤트가 발생되는 공간과 터치 스크린 사이의 거리를 확인할 수 있고, 확인된 거리 값을 디지털 신호(예컨대, Z좌표)로 변환하여 제어부로 제공할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 휴대 단말의 전면 사시도를 나타낸 도면이고, 도 3은 본 발명의 일 실시 예에 따른 휴대 단말의 후면 사시도를 나타낸 도면이다. 도 2 및 도 3을 참조하면, 휴대 단말의 전면(100a) 중앙에는 터치 스크린이 배치된다. 터치 스크린 은 휴대 단말의 전면(100a)의 대부분을 차지하도록 크게 형성될 수 있다. 도 2에서는, 상기 터치 스 크린에 메인 홈 화면이 표시된 예를 나타낸다. 메인 홈 화면은 휴대 단말의 전원을 켰을 때 터치 스 크린 상에 표시되는 첫 화면이다. 또한, 휴대 단말이 여러 페이지의 서로 다른 홈 화면들을 갖고 있 을 경우, 메인 홈 화면은 상기 여러 페이지의 홈 화면들 중 첫 번째 홈 화면일 수 있다. 홈 화면에는 자주 사용 되는 애플리케이션들을 실행하기 위한 단축 아이콘들(191-1, 191-2, 191-3), 메인 메뉴 전환키(191-4), 시간, 날씨 등이 표시될 수 있다. 상기 메인 메뉴 전환키(191-4)는 상기 터치 스크린 상에 메뉴 화면을 표시한다. 또한, 상기 터치 스크린의 상단에는 배터리 충전상태, 수신신호의 세기, 현재 시각과 같은 장치 의 상태를 표시하는 상태바(Status Bar, 192)가 형성될 수도 있다. 상기 터치 스크린의 하부에는 홈 버튼(161a), 메뉴 버튼(161b), 및 뒤로 가기 버튼(161c)이 형성될 수 있 다. 홈 버튼(161a)은 터치 스크린에 메인 홈 화면(main Home screen)을 표시한다. 예를 들어, 터치 스크린 에 상기 메인 홈 화면과 다른 홈 화면(any Home screen) 또는 메뉴화면이 표시된 상태에서, 상기 홈 키 (161a)가 터치되면, 터치 스크린에 메인 홈 화면이 디스플레이될 수 있다. 또한, 터치 스크린 상에서 애플리케이션들이 실행되는 도중 홈 버튼(191a)이 터치되면, 상기 터치 스크린상에는 도 2에 도시된 메인 홈 화면이 디스플레이될 수 있다. 또한 홈 버튼(161a)은 상기 터치 스크린 상에 최근에(recently) 사용된 애플리케이션들을 디스플레이하도록 하거나, 태스크 매니저(Task Manager)를 디스플레이하기 위하여 사용될 수 도 있다. 메뉴 버튼(161b)은 터치 스크린 상에서 사용될 수 있는 연결 메뉴를 제공한다. 상기 연결 메뉴에는 위젯 추가 메뉴, 배경화면 변경 메뉴, 검색 메뉴, 편집 메뉴, 환경 설정 메뉴 등이 포함될 수 있다. 뒤로 가기 버튼(161c)은 현재 실행되고 있는 화면의 바로 이전에 실행되었던 화면을 디스플레이하거나, 가장 최 근에 사용된 애플리케이션을 종료시킬 수 있다. 휴대 단말의 전면(100a) 가장자리에는 제1 카메라와 조도 센서(170a) 및 근접 센서(170b)가 배치될 수 있다. 휴대 단말의 후면(100c)에는 제2 카메라, 플래시(flash, 153), 스피커가 배치될 수 있다. 휴대 단말의 측면(100b)에는 예를 들어 전원/리셋 버튼(160a), 음량 버튼(161b), 방송 수신을 위한 지상파 DMB 안테나(141a), 하나 또는 복수의 마이크들 등이 배치될 수 있다. 상기 DMB 안테나(141a)는 휴대 단말 에 고정되거나, 착탈 가능하게 형성될 수도 있다. 또한, 휴대 단말의 하단 측면에는 커넥터가 형성된다. 커넥터에는 다수의 전극들이 형성되어 있 으며 외부 장치와 유선으로 연결될 수 있다. 휴대 단말의 상단 측면에는 이어폰 연결잭이 형성될 수있다. 이어폰 연결잭에는 이어폰이 삽입될 수 있다. 또한, 휴대 단말의 하단 측면에는 입력 유닛이 형성될 수 있다. 입력 유닛은 휴대 단말 내 부에 삽입되어 보관될 수 있으며, 사용시에는 상기 휴대 단말로부터 인출 및 탈착될 수 있다. 도 4는 본 발명의 실시 예에 따른 입력 유닛과 터치 스크린의 내부 단면도를 나타낸 도면이다. 도 4에 도시된 바와 같이, 터치 스크린은 제1 터치 패널, 표시 패널, 제2 터치 패널을 포 함한다. 또한, 터치 스크린은 표시 패널만 구비될 수 있으며, 본 발명에 따른 터치 스크린은 표시 패 널만 구비될 수 있을 뿐만 아니라, 제1 터치 패널, 표시 패널, 제2 터치 패널을 포함하여 구성될 수 있다. 그리고, 표시 패널은 LCD, AMOLED 등과 같은 패널이 될 수 있으며, 휴대 단말의 각 종 동작 상태, 애플리케이션 실행 및 서비스 등에 따른 다양한 영상과, 복수의 객체들을 표시한다. 제1 터치 패널은 정전용량 방식 터치 패널로서, 유리의 양면에 얇은 금속 전도성 물질(예를 들면, ITO(Indium Tin Oxide：산화 인듐주석) 막 등)을 코팅하여 유리표면에 전류가 흐르도록 하고 전하를 저장할 수 있는 유전체로 코팅된 패널이다. 이러한 제1 터치 패널의 표면에 사용자의 손가락이 터치되면 정전기에 의 해 일정량의 전하가 터치된 위치로 이동하고, 제1 터치 패널은 전하의 이동에 따른 전류의 변화량을 인식 해서 터치된 위치를 감지하게 된다. 제1 터치 패널을 통해서는 정전기를 발생시킬 수 있는 모든 터치의 감 지가 가능하다. 제2 터치 패널은 EMR(Electronic Magnetic Resonance) 방식 터치 패널로서, 복수의 루프 코일이 미리 정 해진 제1 방향 및 제1 방향과 교차하는 제2 방향에 각각 배치되어 그리드 구조를 가지는 전자 유도 코일 센서 (미도시)와, 전자 유도 코일 센서의 각 루프 코일에 순차적으로 소정의 주파수를 가지는 교류 신호를 제공하는 전자 신호 처리부(미도시)를 포함한다. 이러한 제2 터치 패널의 루프 코일 근방에 공진회로를 내장하는 입 력 유닛이 존재하면, 해당 루프 코일로부터 송신되는 자계가 입력 유닛 내의 공진회로에 상호 전자 유도에 기초한 전류를 발생시킨다. 그리고 전류를 기초로 하여, 입력 유닛 내의 공진 회로를 구성하는 코 일(미도시)로부터 유도 자계가 발생하게 되고, 제2 터치 패널은 유도 자계를 신호 수신 상태에 있는 루프 코일에서 검출하게 되어 입력 유닛의 호버링(Hovering) 위치, 터치 위치, 그리고 휴대 단말은 제1 터 치 패널로부터 입력 유닛의 펜촉까지의 높이(h)를 감지한다. 이러한, 터치 스크린의 제1 터치 패널에서 펜촉까지의 높이(h)는 휴대 단말의 성능 또는 구조에 대응하여 변경될 수 있음은 당해 기술 분야에서 통상의 지식을 가진 자에게 용이하게 이해될 수 있다. 제2 터치 패널을 통해서는 전자 기 유도에 기초한 전류를 발생시킬 수 있는 입력 유닛이라면 호버링 및 터치의 감지가 가능하며, 상기 제2 터치 패널은 입력 유닛에 의한 호버링 또는 터치 감지 전용으로 이용되는 것으로 설명한다. 그리고, 입력 유닛은 전자기 펜 또는 EMR 펜으로도 지칭될 수 있다. 또한, 입력 유닛은 상기 제1 터치 패널을 통해 감지되는 공진회로가 포함되지 아니한 일반적인 펜과는 상이할 수 있다. 이러한, 입력 유닛은 펜촉 에 인접된 영역의 펜대 내부에 배치되는 코일에 의해 발생하는 전자기 유도 값을 변경할 수 있는 버튼 을 포함하여 구성될 수 있다. 이러한, 입력 유닛에 대한 보다 상세한 설명은 도 5에서 후술한다. 그리고, 터치 스크린 컨트롤러는 제1 터치 패널 컨트롤러와 제2 터치 패널 컨트롤러를 포함할 수 있다. 상 기 제1 터치 패널 컨트롤러는 상기 제1 터치 패널로부터 핑거 감지에 의해 수신된 아날로그 신호를 디지털 신호(예컨대 X, Y, Z 좌표)로 변환하여 제어부로 전송한다. 그리고 상기 제2 터치 패널 컨트롤러는 제2 터 치 패널로부터 입력 유닛의 호버링 또는 터치 감지에 의해 수신된 아날로그 신호를 디지털 신호로 변 환하여 제어부로 전송한다. 그리고, 제어부는 상기 제1 및 제2 터치 패널 컨트롤러로부터 각각 수신 된 디지털 신호를 이용하여 제1 터치 패널, 표시 패널, 제2 터치 패널을 제어할 수 있다. 예를 들어, 제어부는 손가락이나 펜, 또는 입력 유닛 등의 호버링 또는 터치에 응답하여 표시 패널에 미리 정해진 형태의 화면을 표시할 수 있다. 따라서 본 발명의 일 실시 예에 따른 휴대 단말에 의하면 상기 제1 터치 패널은 사용자의 손가락이나 펜에 의한 터치를 감지하고, 상기 제2 터치 패널은 상기 입력 유닛에 의한 호버링 또는 터치를 감지할 수 있다. 따라서 상기 휴대 단말의 제어부는 상기 사용자의 손가락이나 펜에 의한 터치와 입력 유닛에 의 한 호버링 또는 터치를 구별하여 감지할 수 있다. 그리고, 도 4에서는 단지 하나의 터치 스크린에 대해서만 도 시하였으나, 본 발명은 단지 하나의 터치 스크린에 제한되지 않으며, 복수의 터치 스크린을 구비할 수 있다. 그 리고, 각각의 터치 스크린은 각각 하우징에 구비되어 힌지에 의해 연결되거나 또는 하나의 하우징이 복수의 터치 스크린이 구비될 수 있다. 그리고, 복수의 터치 스크린 각각은 도 4에 도시된 바와 같이, 표시 패널과 적어 도 하나의 터치 패널을 포함하여 구성된다. 도 5는 본 발명의 실시 예에 따른 입력 유닛을 나타낸 블럭도이다. 도 5를 참조하면, 본 발명의 실시 예에 따른 입력 유닛(예: 터치용 펜)은 펜대와, 펜대 끝에 배치된 펜촉, 펜촉에 인접된 영역의 펜대 내부에 배치되는 코일 에 의해 발생하는 전자기 유도 값을 변경할 수 있 는 버튼, 호버링 입력 효과 발생시 진동하는 진동 소자, 휴대 단말과의 호버링으로 인해 휴대 단말로부터 수신되는 제어 신호를 분석하고, 이에 따른 입력 유닛에 햅틱 효과를 제공하기 위해 진동 소자의 진동 세기, 진동 주기를 제어하는 제어부, 휴대 단말과 근거리 통신을 수행하는 근거리 통신부 및 입력 유닛의 진동을 위한 전원을 공급하는 배터리를 포함하여 구성될 수 있다. 또한, 상기 입력 유닛은 입력 유닛의 진동 주기 및/또는 진동 세기에 대응하는 소리를 출력하는 스피커 를 포함할 수 있다. 그리고, 이러한 구성을 가지는 입력 유닛은 정전유도 방식을 지원하는 구성이다. 그리고, 코일에 의 하여 터치 스크린의 일정 지점에 자기장이 형성되면, 터치 스크린은 해당 자기장 위치를 검출하여 터 치 지점을 인식할 수 있도록 구성된다. 보다 상세하게, 상기 스피커는 제어부의 제어에 따라 휴대 단말에 구비된 이동통신 모듈, 서브통신 모듈 또는 멀티미디어 모듈로부터 다양한 신호(예: 무선신호, 방송신호, 디지털 오디오 파 일, 또는 디지털 동영상 파일 등)에 대응되는 사운드를 출력할 수 있다. 또한, 스피커는 휴대 단말이 수행하는 기능에 대응되는 사운드(예, 전화 통화에 대응되는 버튼 조작음, 또는 통화 연결음)를 출력할 수 있으 며, 상기 입력 유닛의 하우징의 적절한 위치 또는 위치들에 하나 또는 복수로 형성될 수 있다. 도 6은 본 발명의 실시 예에 따른 휴대 단말의 데이터 제공 방법을 나타낸 순서도이다. 이하, 도 6을 참조하여 본 발명의 실시 예에 따른 휴대 단말의 데이터 제공 방법을 상세히 설명하면 다음과 같 다. 정보를 제공하기 위한 이벤트가 발생되는 경우, 이벤트에 대응되는 정보를 분석하여 출력하고자 하는 모듈을 선 택한다(S610, S612). 제어부는 사용자에게 제공되어야 하는 이벤트가 발생되는 경우, 이를 감지하고 발생된 이 벤트에 포함되는 정보를 분석하고, 분석된 결과를 출력하고자 하는 모듈을 선택한다. 제어부는 수신 또는 발생 된 데이터에서 키워드를 추출하여 정보를 분석한다. 이러한, 이벤트는 사용자에게 알려주기 위한 것으로서, 이 메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 그리고, 상기 모 듈은 발생된 이벤트에 따라서 복수 개가 있다. 예를 들어, 이러한 모듈들은 이메일 송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게 되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는 모듈 그리고 음성 통화 또는 영상 통화를 제공하는 통화 모듈을 포함할 수 있다. 제어부는 이러한 모듈을 통해 수신되는 이벤트에 대응하여 정보를 분석한다. 상기 정보는 사용자에게 제공되어야 하는 것으로서 키워드를 포 함한다. 그리고, 제어부의 제어 하에 사용자로부터 입력된 요청에 해당되는 응답을 위해 의인화되도록 구성되는 데이터를 사용자에게 제공한다. 또한, 상기 모듈은 사용자와 통신을 하기 위한 것으로서, 음성 통화, 영상 통화, 문자 메시지, 팝업 창 및 이메일 중 적어도 하나를 포함한다. 상기 과정(S612)에서 본 발명의 휴대 단말은 선택된 모듈에 대응하여 상기 정보를 포함하는 데이터를 구성한다 (S614). 제어부는 선택된 모듈을 통해서 의인화되도록 구성된 데이터를 사용자에게 제공한다. 제어부는 상기 과 정(S612)에서 분석결과를 통해서 사용자에게 제공하기 위한 모듈을 선택한다. 휴대 단말은 인공지능 엔진이 구 비되어 있으며, 사용자는 이러한 인공지능 엔진과 상호 의사소통뿐만 아니라 데이터를 송수신할 수 있다. 상기 인공지능 엔진은 사용자와 상호 의사소통을 제공하기 위해 사용자에게 제공되는 데이터를 의인화하여 구성할 수 있다. 이러한, 의인화는 휴대 단말이 마치 살아있는 사람(예: 가상의 사용자)처럼 휴대 단말 사용자와 의사소통 을 할 수 있도록 하기 위한 것으로서, 이러한 의인화를 통해서 휴대 단말은 사용자에게 제공될 데이터를 가상의 사용자가 음성 등을 이용해 사용자에게 제공할 수 있다. 그리고, 휴대 단말은 사용자에게 정보 또는 데이터를 제공하기 위한 복수의 모듈이 구비되어 있다. 그리고, 제어부는 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키 워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 음성 통화로 사용자에게 정보를 제공하고자하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 음성 데이터를 생성한다. 이 러한, 음성 데이터는 추출된 키워드로 형성되어 사용자에게 스피커를 통해 출력된다. 사용자는 이를 청취하여 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 영상 통화로 사용자에게 정보를 제공하고자 하는 경우, 음성 통화와 마찬가지로 음성 데이터를 생성하고, 인공지능 엔진에 부여된 이모티콘 또는 아이콘을 통해 서 사용자와 영상 통화를 제공한다. 또한, 제어부는 메시지를 통해서 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 문자 데이터를 생성한다. 이러한 문자 데이터는 수신된 이벤트에 그림 파일이 존재할 경우, 그림 파일을 추가하여 생성될 수 있다. 이와 같이, 인공지 능 엔진은 context awareness 모듈을 통해 문자 메시지, 음성 통화 또는 영상 통화를 통해 사용자와 의사소통을 할 수 있다. 이와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소 통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력 받을 수 있으며, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분 석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이 터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출 하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지 능 엔진은 상기 요청에 해당되는 응답을 사용자에게 음성, 영상 또는 메시지를 이용하여 의인화되어 제공되도록 데이터를 구성할 수 있다. 상기 과정(S614)에서 본 발명의 휴대 단말은 구성된 데이터를 상기 선택된 모듈을 통해 출력한다(S616). 제어부 는 이벤트가 이메일 수신 또는 문자 메시지 수신인 경우, 제어부는 수신된 이메일 또는 문자 메시지에 포함된 키워드 및 그림 중 적어도 하나를 추출하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 사용자에게 제공한다. 그리고, 제어부는 이벤트가 휴대 단말의 배터리 잔량 부족 발 생인 경우, 제어부는 배터리의 잔량을 추출하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 사용자에게 제공한다. 그리고, 제어부는 이벤트가 콜 수신인 경우, 제어부는 콜 을 송신한 사용자 이름 및 휴대 단말의 전화번호 중 적어도 하나의 추출에 대응하여 데이터를 구성하고, 구성된 데이터를 음성 통화, 영상 통화 및 팝업 창 중 적어도 하나를 통해 사용자에게 제공한다. 도 7은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 방 법을 나타낸 순서도이고, 도 8은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하 여 데이터를 제공하는 예시도이다. 이하, 도 7 및 도 8을 참조하여, 본 발명의 실시 예에 따른 휴대 단말이 통화를 이용하여 데이터를 제공하는 방 법을 상세히 설명하면 다음과 같다. 사용자에게 정보를 제공하기 위한 이벤트가 발생되는 경우, 본 발명의 휴대 단말은 사용자에게 콜을 송신하고 사용자로부터 콜 수신이 확인되면, 정보를 이용하여 데이터를 구성한다(S710, S712). 제어부는 사용자에게 제공 되어야 하는 이벤트가 발생되는 경우, 이를 감지하고 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 결과 를 출력하고자 하는 모듈을 선택한다. 이러한, 이벤트는 사용자에게 알려주기 위한 것으로서, 이메일 수신, 문 자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나를 포함한다. 그리고, 상기 모듈은 발생된 이벤트에 따라서 복수 개가 있다. 즉, 이메일 송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게 되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는 모듈 그리고 음성 통화 또는 영상 통화 를 제공하는 통화 모듈을 포함한다. 그리고, 분석된 결과를 사용자에게 출력하고자 하는 모듈은 복수 개가 있으 며 음성 통화 또는 영상 통화를 포함한다. 또한, 제어부는 이벤트에 포함되어 있는 정보를 분석한 후, 사용자에 게 콜을 송신할 수 있고, 이벤트가 수신되면 사용자에게 콜을 송신한 후, 이벤트에 포함되어 있는 정보를 분석 할 수 있다. 이와 같이, 제어부는 사용자에게 콜을 송신하고, 분석된 결과를 출력하기 위해 인공지능 엔진을 이용할 수 있다. 이러한 인공지능 엔진은 사용자와 상호 의사소통뿐만 아니라 데이터를 송수신할 수 있다. 상기 인공지능 엔진은 휴대 단말에 구비된 가상의 인물일 수 있다. 그리고, 제어부는 이벤트의 발생에 대응하여 데이터를 의인화되도록 구성하고 구성된 데이터를 사용자에게 출력 하기 위한 모듈을 선택하거나 또는 모듈을 선택하고 이에 대응하여 데이터를 구성할 수 있다. 이러한 모듈은 사 용자와 상호 통신을 수행할 수 있는 음성 통화 모듈 또는 영상 통화 모듈을 포함한다. 본 발명의 휴대 단말은 상기 과정(S712)에서 구성된 데이터를 출력한다(S714). 제어부는 구성된 데이터를 선택 된 모듈을 통해 사용자에게 출력한다. 그리고, 사용자로부터 정보 요청이 입력되는 경우, 입력된 요청에 해당되 는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구 성된다. 예를 들어, 제어부는 음성 통화로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 음성 데이터를 생성한다. 이러한, 음성 데이터는 추출된 키워드로 형성되어 사용자에게 스피커를 통해 출력된다. 사용자는 이를 청취하여 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 영상 통화로 사용자에게 정보를 제공하고자 하는 경우, 음성 통화와 마찬가지로 음성 데 이터를 생성하고, 인공지능 엔진에 부여된 이모티콘 또는 아이콘을 통해서 사용자와 영상 통화를 제공한다. 이 와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과 를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해 당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있 다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석 된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요 청에 해당되는 응답을 사용자에게 음성, 영상 또는 메시지로 제공하도록 데이터를 구성할 수 있다. 이하, 도 8 에서는 이러한 인공지능 엔진을 통해 사용자와 음성 통화 또는 영상 통화를 수행하는 예를 설명한다. 도 8은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 사용자에게 통화를 통해 데이터를 제공 하는 예시도로서, 휴대 단말의 인공지능 엔진은 사용자와 통화를 수행할 수 있다. 본 실시 예에서는 휴대 단말의 사용자와 휴대 단말에 구비된 인공지능 엔진간의 통화를 나타낸 예시도이다. 상 기 인공지능 엔진은 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나의 이벤 트가 발생되는 경우 활성화되거나 또는 사용자의 선택에 의해 활성화될 수 있다. 인공지능 엔진은 휴대 단말의 사용자와 의사소통 또는 데이터를 송수신할 수 있는 휴대 단말에 구비된 가상의 인물일 수 있다. 즉, 사용자는 이러한 가상의 인물과 자연스러운 의사소통 뿐만 아니라 데이터 송수신을 할 수 있다. 이러한 인공지능 엔진은 고유 전화번호를 할당받을 수 있으며, 사용자가 할당된 전화번호를 호출하면 인공지능 엔진은 활성화될 수 있다. 그리고, 인공지능 엔진은 송수신부를 통해 사용자와 의사소통을 할 수 있을 뿐만 아니라 데이터 송수신을 수행할 수 있다. 상기 송수신부는 휴대 단말에 구비된 터치 스크린, 마이크, 스피커 및 이어폰 중 적어도 하나 를 포함한다. 또한, 인공지능 엔진은 제어부의 제어 하에 상술한 이벤트가 발생되는 경우, 이벤트에 대응한 정 보의 수신 또는 발생된 정보를 분석하고, 분석된 정보를 제공하기 위한 모듈을 선택한다. 그리고, 인공지능 엔 진은 선택된 모듈을 통해서 분석된 정보를 포함하는 데이터를 구성할 수 있다. 또한, 인공지능 엔진은 선택된 모듈을 통해 사용자로부터 정보 요청을 수신할 수 있다. 도 8을 참조하면, 휴대 단말의 터치 스크린은 통화시 제공될 수 있는 복수의 기능들이 구비된 하단 스크린 과 통화자의 이름, 통화 시간, 그리고 상대방의 모습 또는 이모티콘을 보여주는 상단 스크린으로 구 성될 수 있다. 이벤트가 수신 또는 발생되면, 인공지능 엔진은 활성화되고, 이벤트에 대한 정보를 분석한다. 즉, 인공지능 엔진은 이벤트가 다른 휴대 단말로부터의 이메일 수신인지, 문자 메시지 수신인지 또는 콜 수신인 지를 파악한다. 또한, 인공지능 엔진은 이벤트가 휴대 단말의 배터리 잔량이 미리 정해진 임계값보다 작아지는 지 파악할 수 있다. 그리고, 인공지능 엔진은 고유 전화번호가 할당될 수 있기 때문에, 사용자는 할당된 전화번 호를 통해 인공지능 엔진을 활성화할 수 있다. 이러한 할당된 전화번호를 통해 인공지능 엔진을 호출하면, 인공 지능 엔진은 자신에게 할당되거나 임의 아이콘, 이모티콘 또는 사진을 활성화하여 상단 스크린에 디스플레 이할 수 있다. 도 8은 사용자와 인공지능 간의 통화를 나타내는 것으로서 인공지능 엔진은 사진을 상단 스 크린에 디스플레이하여 영상 통화를 수행할 수 있다. 이러한 인공지능 엔진의 목소리는 휴대 단말의 사용 자의 목소리로 설정하거나 또는 성우, 배우, 가수 등 다양한 사람의 목소리로 설정할 수 있다. 이러한 통화를 통해서 사용자는 인공지능 엔진에 정보를 입력하거나 요청할 수 있다. 사용자로부터 통화를 통한 정보의 입력 또는 요청이 발생되면, 인공지능 엔진은 이를 분석하고, 요청에 대한 응답을 휴대 단말에 기 저장된 정보를 통 해서 제공할 수 있는지 또는 별도의 서버에 접속하여 응답에 대한 정보를 수신하여 제공해야 하는지를 판단하고, 판단 결과에 따라서 응답에 대응하는 데이터를 구성하여 스피커 또는 이어폰을 통해 사용자에게 출력 하거나 터치 스크린을 통해 출력할 수 있다. 또한, 인공지능 엔진은 요청에 대응하는 답변을 저장하고 있는 서 버에 접속하여 데이터를 수신한 후, 사용자에게 제공되기 위한 데이터로 구성할 수 있다. 그리고, 사용자로부터 추가 정보가 요청되는 경우, 본 발명의 휴대 단말은 요청된 정보에 대응되는 데이터를 구 성하고, 구성된 데이터를 사용자에게 출력한다(S716, S718, S714). 상기 과정(S714)에서 구성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청된 데이터에 대한 응답을 포함하는 데 이터를 구성하고, 구성된 데이터를 사용자에게 다시 출력한다. 제어부는 사용자로부터 추가 요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접속 제어하여 요청에 대한 응답을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거나 또는 웹 페이지를 통해 얻어진 정보를 포함한 다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하는 기상청 서버, 위치를 제공하는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다. 도 9는 본 발명의 실시 예에 따른 휴대 단말에 콜이 수신되는 경우 데이터를 제공하는 방법을 나타낸 순서도이 다. 이하, 도 9를 참조하며 본 발명의 실시 예에 따른 휴대 단말에 콜이 수신되는 경우 데이터를 제공하는 방법을 상세히 설명하면 다음과 같다. 콜이 수신되면, 본 발명의 휴대 단말은 인공지능 엔진을 활성화한다(S910, S912). 사용자는 필요한 정보를 요청 하고자 하는 경우, 휴대 단말의 인공지능 엔진을 활성화하여 필요한 정보를 얻을 수 있다. 이러한 인공지능 엔 진은 가상의 인물로 구성될 수 있으며 별도의 전화번호, 이름 등을 설정할 수 있다. 그리고, 이러한 이름을 호 출하거나 전화번호를 통해 통화를 하는 경우 인공지능 엔진은 활성화되고, 사용자와 의사소통을 수행할 수 있다. 이와 같이, 할당된 전화번호를 통해 사용자로부터 콜이 수신되면, 제어부는 인공지능 엔진을 활성화한다. 활성화된 인공지능 엔진을 통해서 휴대 단말은 사용자와 의사 소통을 수행할 수 있을 뿐만 아니라 데이터 송수 신도 가능하다. 상기 송수신이라 함은 임의 정보 또는 데이터를 사용자가 인지할 수 있게끔 출력하고, 사용자로 부터 임의 정보 또는 데이터를 수신하는 것을 말한다. 즉, 사용자는 음성 통화, 영상 통화 또는 문자 메시지를 통해 인공지능 엔진과 의사소통을 수행할 수 있으며, 인공지능 엔진은 사용자로부터 입력되는 음성, 영상 또는 문자 메지시를 분석하여 사용자가 어떤 정보를 원하는지 판단할 수 있다. 정보 요청이 수신되면, 본 발명의 휴대 단말은 요청에 대응되는 데이터를 구성하고, 구성된 데이터를 통화 모듈 을 통해 출력한다(S914, S916, S918). 인공지능 엔진은 사용자로부터 요청된 정보가 휴대 단말에 기 저장되어 있는지를 판단한다. 판단 결과, 기 저장되어 있으면 요청에 대한 응답을 포함하는 데이터를 구성한다. 만일, 기 저장되어 있지 않으면, 요청에 대한 응답을 제공하는 서버에 요청하고, 서버로부터 이에 대한 응답을 수신하여 데이터를 구성한다. 그리고, 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들 어, 제어부는 음성 통화로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출 하고, 추출된 키워드를 통해서 음성 데이터를 생성한다. 이러한, 음성 데이터는 추출된 키워드로 형성되어 사용 자에게 스피커를 통해 출력된다. 사용자는 이를 청취하여 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어 부는 영상 통화로 사용자에게 정보를 제공하고자 하는 경우, 음성 통화와 마찬가지로 음성 데이터를 생성하고, 인공지능 엔진에 부여된 이모티콘 또는 아이콘을 통해서 사용자와 영상 통화를 제공한다. 이와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있 다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답을 포 함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답 을 사용자에게 음성, 영상 또는 메시지로 제공하도록 데이터를 구성할 수 있다. 그리고, 상기 구성된 데이터는 모듈에 따라 다르게 구성될 수 있다. 즉, 사용자가 문자 메시지로 요청하는 경우 인공지능 엔진은 데이터를 문 자 메시지로 구성하고, 음성 통화로 요청하는 경우 데이터를 음성으로 구성한다. 인공지능 엔진은 데이터 구성 시 정보를 제공하는 주체를 자신으로하여 구성할 수 있다. 사용자로부터 추가 정보가 요청되면, 요청에 대응되는 데이터를 구성한다(S920, S916). 상기 과정(S918)에서 구 성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청된 데이터에 대한 응답을 포함하는 데이터를 구성하고, 구성된 데이터를 사용자에게 다시 출력한다. 제어부는 사용자로부터 추가 요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접속 제어하여 요청에 대한 응답 을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거나 또는 웹 페이지를 통해 얻어 진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하는 기상청 서버, 위치를 제공하 는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다.도 10은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해 데이터를 제공하는 방법을 나타낸 순서도이다. 이하, 도 10을 참조하여, 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응 되는 모듈을 통해 데이터를 제공하는 방법을 상세히 설명하면 다음과 같다. 이벤트가 발생되는 경우, 이벤트에 대응되는 정보를 분석한다(S1010, S1012). 제어부는 사용자에게 제공되어야 하는 이벤트가 발생되는 경우, 이를 감지하고 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 정보에 대응 하여 사용자에게 제공하고자 하는 데이터를 구성한다. 제어부는 수신 또는 발생된 이벤트에 대응되는 데이터에 서 키워드를 추출하여 정보를 분석한다. 상기 정보는 사용자에게 제공되어야 하는 데이터이다. 이러한, 이벤트 는 송신자가 사용자에게 제공하고자 하는 정보를 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신 및 콜 수신 중 적어도 하나를 포함한다. 또한, 상기 이벤트는 휴대 단말의 배터리 잔량이 부족함을 알려주기 위한 팝업 창 또는 콜 송신을 포함한다. 또한, 상기 정보는 사용자에게 제공되어야 하는 키워드를 포함한다. 그리고, 제어부의 제어 하에 사용자로부터 입력된 요청에 해당되는 응답을 위해 구성되는 데이터를 의인화하여 사용자에 게 제공한다. 또한, 상기 모듈은 사용자와 통신을 하기 위한 것으로서, 음성 통화, 영상 통화, 문자 메시지, 팝 업 창 및 이메일 중 적어도 하나를 포함한다. 상기 과정(S1012)에서 분석된 정보에 대응하여 데이터를 구성하고, 구성된 데이터를 해당 모듈을 이용하여 출력 한다(S1014, S1016). 제어부는 선택된 모듈을 통해서 구성된 데이터를 의인화하여 사용자에게 제공한다. 제어부 는 상기 과정(S1012)에서 분석결과를 통해서 사용자에게 제공하기 위한 모듈을 선택한다. 상기 모듈은 발생된 이벤트에 따라서 복수 개가 있다. 즉, 이메일 송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게 되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는 모듈 그리고 음성 통화 영상 통화를 제 공하는 통화 모듈을 포함한다. 제어부는 이러한 모듈을 통해 수신되는 이벤트에 대응하여 정보를 분석한다. 휴 대 단말은 인공지능 엔진이 구비되어 있으며, 사용자는 이러한 인공지능 엔진과 상호 의사소통뿐만 아니라 데이 터를 송수신할 수 있다. 그리고, 휴대 단말은 사용자에게 정보 또는 데이터를 제공하기 위한 복수의 모듈이 구 비되어 있다. 그리고, 제어부는 선택된 모듈을 통해 사용자로부터 정보 요청이 입력되는 경우, 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되 도록 구성된다. 예를 들어, 제어부는 문자 메시지로 사용자에게 정보를 제공하고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 문자 메시지를 생성한다. 이러한, 문자 메시지는 추출된 키워드로 형성되어 사용자에게 터치 스크린을 통해 출력된다. 사용자는 이를 통해서 수신된 이벤트의 내용을 파 악할 수 있다. 또한, 제어부는 이메일로 사용자에게 정보를 제공하고자 하는 경우, 문자 메시지와 마찬가지로 이메일을 생성하고, 사용자에게 제공한다. 이러한 문자 데이터 또는 이메일은 수신된 이벤트에 그림 파일이 존 재할 경우, 그림 파일을 추가하여 생성될 수 있다. 이와 같이, 인공지능 엔진은 context awareness 모듈을 통해 문자 메시지, 이메일을 통해 사용자와 의사소통을 할 수 있다. 이와 같이, 의인화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버 로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당되는 응답을 사용자에게 문자 메시지 또는 이메일로 제공하도록 데이터를 구성할 수 있다. 추가 정보가 요청되면, 요청된 정보에 대응되는 데이터를 구성하고, 구성된 데이터를 해당 모듈을 이용하여 출 력한다(S1018, S1020, S1016). 제어부는 사용자로부터 추가 정보가 요청되면, 인공지능 엔진을 제어하여 요청된 정보를 분석한다. 그리고, 요청된 정보 또는 질의에 대한 응답을 기 저장된 데이터를 통해서 사용자에게 제공할 수 있는지 또는 응답을 제공하는 서버를 통해 수신하여 사용자에게 제공해야하는지를 판단한다. 그리고, 상기 과정(S1016)에서 구성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청 된 데이터에 대한 응답을 포함하는 데이터를 구성하고, 구성된 데이터를 의인화하여 사용자에게 다시 출력한다. 제어부는 사용자로부터 추가 요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접 속 제어하여 요청에 대한 응답을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거 나 또는 웹 페이지를 통해 얻어진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하는 기상청 서버, 위치를 제공하는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다. 도 11a는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 문자 메시지를 통해 사용자에게 데이 터를 제공하는 예시도이다. 이하, 도 11a를 참조하여, 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 문자 메시지를 통해 사용자에게 데이터를 제공하는 예시를 상세히 설명하면 다음과 같다. 본 실시 예에서는 휴대 단말의 사용자와 휴대 단말에 구비된 인공지능 엔진간의 문자 메시지의 송수신을 나타낸 예시도이다. 상기 인공지능 엔진은 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어 도 하나의 이벤트가 발생되는 경우 활성화되거나 또는 사용자의 선택에 의해 활성화될 수 있다. 즉, 사용자는 이러한 가상의 인물과 자연스러운 의사소통뿐만 아니라 데이터 송수신을 할 수 있다. 또한, 인공지능 엔진은 제 어부의 제어 하에 상술한 이벤트가 발생되는 경우, 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고, 분석된 정보를 제공하기 위한 모듈을 선택한다. 그리고, 인공지능 엔진은 선택된 모듈을 통해서 분석된 정보를 포함하는 데이터를 구성할 수 있다. 또한, 인공지능 엔진은 선택된 모듈을 통해 사용자로부터 정보 요청을 수신 할 수 있다. 휴대 단말의 터치 스크린은 인공지능 엔진에 대응하는 가상의 인물에 설정된 임의 캐릭터 및 가상의 인물 에 부여된 전화번호를 표시하는 상단 스크린과 가상의 인물과 사용자간에 주고 받는 문자 메시지를 디스 플레이하는 하단 스크린을 포함한다. 이벤트가 수신 또는 발생되면, 인공지능 엔진은 활성화되고, 이벤트 에 대한 정보를 분석한다. 그리고, 분석 결과에 따라서 데이터를 구성하여 사용자에게 출력한다. 도 11a는 사용 자와 인공지능 엔진의 가상의 인물간의 문자 메시지 송수신을 나타내는 것이다. 인공지능 엔진은 수신된 이벤트 를 통해서 날씨에 대한 정보를 분석하고 사용자에게 제공하기 위한 데이터를 구성하여 터치 스크린을 통 해 출력한다. 상기 구성된 데이터는 사용자에게 제공되어져야 하는 정보를 포함한다. 즉, 제공되어져야 하는 정 보가 날씨에 관한 것이며 만일 비가 올 경우, 인공지능 엔진은 \"밖에 비가 내리고 있으니 우산을 준비해서 나가 주세요.\"라는 문자와 필요에 따라 그림을 추가하여 데이터를 구성하고, 구성된 데이터를 터치 스크린 에 출력한다. 이를 확인한 사용자는 이에 대한 응답 즉, \"고마워, Sam~\"을 입력할 수 있다. 상기 Sam은 가상의 인물에 부여된 이름이거나 인공지능 엔진에 부여된 이름일 수 있다. 이를 수신한 인공지능 엔진은 \"고마 워\"란 단어와 \"Sam\"이란 단어를 통해 사용자가 자신에게 감사함을 표현한 것으로 파악하고, 이에 대한 적절한 대답 즉, \"도움이 되셨다니 기쁘네요.\"를 포함하는 데이터 구성하여 출력한다. 이와 같이, 사용자로부터 응답 를 수신한 인공지능 엔진은 이에 대한 답변을 사용자에게 다시 제공할 수 있다. 이러한 문자 메시지를 통해서 사용자는 인공지능 엔진에 정보를 입력하거나 요청할 수 있다. 사용자로부터 문자 메시지를 통한 정보의 입력 또는 요청이 발생되면, 인공지능 엔진은 이를 분석하고, 요청에 대한 응답을 휴대 단말에 기 저장된 정보를 통해서 제공할 수 있는지 또는 별도의 서버에 접속하여 응답에 대한 정보를 수신하여 제공해야 하는지를 판단하고, 판단 결과에 따라서 응답에 대응하는 데이터를 구성하여 스피커 또는 이어폰을 통 해 사용자에게 출력하거나 터치 스크린을 통해 출력할 수 있다. 또한, 인공지능 엔진은 요청에 대응하는 답변을 저장하고 있는 서버에 접속하여 데이터를 수신한 후, 사용자에게 제공되기 위한 데이터로 구성할 수 있다. 도 11b는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우의 예시도이고, 도 11c는 본 발명의 실 시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 이메일을 통해 사용자에게 데이터를 제공하는 예시도이다. 이하, 도 11b 및 도 11c를 참조하여, 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 이메일을 통해 사용자에게 데이터를 제공하는 예시를 상세히 설명하면 다음과 같다. 본 실시 예에서는 이메일이 수신되면, 인공지능 엔진은 수신된 이메일을 분석하여 자신을 송신자로하는 별도의 이메일을 구성하거나 메시지를 구성하여 사용자에게 출력한다. 상기 인공지능 엔진은 이메일 수신, 문자 메시지 수신, 배터리 잔량 부족 발생 및 콜 수신 중 적어도 하나의 이벤트가 발생되는 경우 활성화되거나 또는 사용자 의 선택에 의해 활성화될 수 있다. 즉, 사용자는 이러한 가상의 인물과 자연스러운 이메일을 송수신할 수 있다. 또한, 인공지능 엔진은 제어부의 제어 하에 상술한 이벤트가 발생되는 경우, 이벤트에 대응한 정보의 수신 또는 발생된 정보를 분석하고, 분석된 정보를 제공하기 위한 모듈을 선택한다. 그리고, 인공지능 엔진은 선택된 모듈 을 통해서 분석된 정보를 포함하는 데이터를 구성할 수 있다. 또한, 인공지능 엔진은 선택된 모듈을 통해 사용자로부터 정보 요청을 수신할 수 있다. 도 11b를 참조하면, 휴대 단말의 터치 스크린은 복수의 이메일을 디스플레이하고 있다. 이러한 이메일이 수신되면, 인공지능 엔진은 활성화되고, 이벤트에 대한 정보를 분석한다. 그리고, 분석 결과에 따라서 데이터를 구성하여 사용자에게 출력한다. 예를 들어, 맛집에 관한 이메일이 수신되는 경우, 인공지능 엔진은 수신 된 이메일을 분석하여 사용자에게 제공하기 위한 데이터를 구성한다. 도 11c는 맛집에 관한 이메일을 분석하여 이메일을 통해 사용자에게 데이터를 제공하는 예시도로서, 터치 스크린은 인공지능 엔진에 해당되는 가상의 인 물에 대한 정보를 상단 스크린에 표시하고, 하단 스크린에는 수신된 이메일을 통해 구성된 데이터 를 디스플레이한다. 즉, 구성된 데이터는 인공지능 엔진의 가상의 인물에 의해 구성된 텍스트와 수신된 이메일에 첨부된 적어도 하나 이상의 사진이 포함될 수 있다. 이와 같이, 인공지능 엔진은 수신된 이메일 을 분석하여 도시된 바와 같이, 마치 자신이 보낸 것처럼 데이터를 구성할 수 있다. 이와 같이, 인공지능 엔진은 수신된 이벤트를 통해서 맛집에 대한 정보를 분석하고 사용자에게 제공하기 위한 데이터를 구성하여 터치 스크린을 통해 출력한다. 상기 구성된 데이터는 사용자에게 제공되어져야 하는 정보를 포함한다. 이러한 문자 메시지를 통해서 사용자는 인공지능 엔진에 정보를 입력하거나 요청할 수 있다. 사용자로부터 문자 메시지를 통한 정보의 입력 또는 요청이 발생되면, 인공지능 엔진은 이를 분석하고, 요청에 대한 응답을 휴대 단말에 기 저장된 정보를 통해서 제공할 수 있는지 또는 별도의 서버에 접속하여 응답에 대한 정보를 수신하여 제공해야 하는지를 판단하고, 판단 결과에 따라서 응답에 대응하는 데이터를 구성하여 스피커 또는 이어폰을 통 해 사용자에게 출력하거나 터치 스크린을 통해 출력할 수 있다. 또한, 인공지능 엔진은 요청에 대응하는 답변을 저장하고 있는 서버에 접속하여 데이터를 수신한 후, 사용자에게 제공되기 위한 데이터로 구성할 수 있다. 도 12는 본 발명의 다른 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해 데이터를 제공하는 방법을 나타낸 순서도이다. 이하, 도 12를 참조하여, 본 발명의 다른 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해 데이터를 제공하는 방법을 상세히 설명하면 다음과 같다. 이벤트가 발생되는 경우, 인공지능 엔진을 활성화하고, 수신된 메시지를 분석하여 이에 대응되는 데이터를 구성 한다(S1210, S1212). 휴대 단말은 인공지능 엔진이 구비되어 있으며, 사용자는 이러한 인공지능 엔진과 상호 의 사소통뿐만 아니라 데이터를 송수신할 수 있다. 제어부는 사용자에게 제공되어야 하는 이벤트가 발생되거나 또 는 사용자로부터 정보를 요청하는 문자 메시지가 수신되는 경우, 인공지능 엔진을 활성화하고, 활성화된 인공지 능 엔진을 통해 발생된 이벤트에 포함되는 정보를 분석하고, 분석된 정보에 대응하여 사용자에게 제공하고자 하 는 데이터를 구성한다. 제어부는 수신 또는 발생된 이벤트에 대응되는 데이터에서 키워드를 추출하여 정보를 분 석한다. 상기 정보는 사용자에게 제공되어야 하는 데이터이다. 이러한, 이벤트는 송신자가 사용자에게 제공하고 자 하는 정보를 알려주기 위한 것으로서, 이메일 수신, 문자 메시지 수신 및 콜 수신 중 적어도 하나를 포함한 다. 또한, 상기 이벤트는 휴대 단말의 배터리 잔량이 부족함을 알려주기 위한 팝업 창 또는 콜 송신을 포함한다. 또한, 상기 정보는 사용자에게 제공되어야 하는 키워드를 포함한다. 그리고, 제어부의 제어 하에 사 용자로부터 입력된 요청에 해당되는 응답을 위해 구성되는 데이터를 의인화하여 사용자에게 제공한다. 또한, 상 기 모듈은 사용자와 통신을 하기 위한 것으로서, 음성 통화, 영상 통화, 문자 메시지, 팝업 창 및 이메일 중 적 어도 하나를 포함한다. 상기 과정(S1214)에서 구성된 데이터를 해당 모듈을 이용하여 출력한다(S1014, S1016). 제어부는 선택된 모듈을 통해서 구성된 데이터를 의인화하여 사용자에게 제공한다. 제어부는 상기 과정(S1214)에서 분석결과를 통해서 사용자에게 제공하기 위한 모듈을 선택한다. 상기 모듈은 발생된 이벤트에 따라서 복수 개가 있다. 즉, 이메일 송수신 모듈, 문자 메시지 송수신 모듈, 배터리 잔량이 부족하게 되는 경우 이를 팝업, 음성 통화, 메시지 등을 통해 사용자에게 알리는 모듈 그리고 음성 통화 영상 통화를 제공하는 통화 모듈을 포함한다. 제어부는 이러한 모듈을 통해 수신되는 이벤트에 대응하여 정보를 분석한다. 그리고, 휴대 단말은 사용자에게 정보 또는 데이터 를 제공하기 위한 복수의 모듈이 구비되어 있다. 그리고, 제어부는 선택된 모듈을 통해 사용자로부터 정보 요청 이 입력되는 경우, 입력된 요청에 해당되는 응답에 대응되는 데이터를 구성한다. 상기 구성된 데이터는 추출된 키워드를 통해 사용자에게 제공되도록 구성된다. 예를 들어, 제어부는 문자 메시지로 사용자에게 정보를 제공하 고자 하는 경우, 수신된 이벤트에 대응하여 키워드를 추출하고, 추출된 키워드를 통해서 문자 메시지를 생성한다. 이러한, 문자 메시지는 추출된 키워드로 형성되어 사용자에게 터치 스크린을 통해 출력된다. 사용자는 이를 통해서 수신된 이벤트의 내용을 파악할 수 있다. 또한, 제어부는 이메일로 사용자에게 정보를 제공하고자 하는 경우, 문자 메시지와 마찬가지로 이메일을 생성하고, 사용자에게 제공한다. 이러한 문자 데이터 또는 이메일은 수신된 이벤트에 그림 파일이 존재할 경우, 그림 파일을 추가하여 생성될 수 있다. 이와 같이, 인공지능 엔진은 context awareness 모듈을 통해 문자 메시지, 이메일을 통해 사용자와 의사소통을 할 수 있다. 이와 같이, 의인 화될 수 있는 인공지능 엔진을 통해 사용자는 마치 살아있는 가상의 인물과 의사소통을 하는 효과를 제공받을 수 있다. 또한, 인공지능 엔진은 사용자로부터 정보 요청을 입력받을 수 있으며, 분석된 요청에 해당되는 응답 을 포함하는 데이터를 구성할 수 있다. 즉, 사용자는 사용자가 질의하는 내용을 분석하여 이에 대한 응답에 해 당되는 데이터를 기 저장된 데이터 또는 응답에 해당되는 서버로부터 수신하여 데이터를 구성할 수 있다. 즉, 인공지능 엔진은 분석된 요청에 대한 응답을 휴대 단말에 기 저장된 정보로부터 추출하거나 또는 분석된 요청에 대응되는 정보를 저장하고 있는 서버로부터 수신하여 사용자에게 제공한다. 인공지능 엔진은 상기 요청에 해당 되는 응답을 사용자에게 문자 메시지 또는 이메일로 제공하도록 데이터를 구성할 수 있다. 추가 정보가 요청되면, 요청된 정보에 대응되는 데이터를 구성하고, 구성된 데이터를 해당 모듈을 이용하여 출 력한다(S1218, S1220, S1216). 제어부는 사용자로부터 추가 정보가 요청되면, 인공지능 엔진을 제어하여 요청된 정보를 분석한다. 그리고, 요청된 정보 또는 질의에 대한 응답을 기 저장된 데이터를 통해서 사용자에게 제공할 수 있는지 또는 응답을 제공하는 서버를 통해 수신하여 사용자에게 제공해야하는지를 판단한다. 그리고, 상기 과정(S1214)에서 구성된 데이터가 사용자에게 출력된 후, 사용자로부터 추가적인 정보의 요청이 수신되면, 요청 된 데이터에 대한 응답을 포함하는 데이터를 구성하고, 구성된 데이터를 의인화하여 사용자에게 다시 출력한다. 제어부는 사용자로부터 추가 요청이 입력되면, 휴대 단말에 기 저장된 데이터 또는 요청에 대응되는 서버에 접 속 제어하여 요청에 대한 응답을 얻는다. 상기 기 저장된 데이터는 휴대 단말의 터치 스크린에 디스플레이되거 나 또는 웹 페이지를 통해 얻어진 정보를 포함한다. 또한, 상기 서버는 사용자의 질의에 따라서 날씨를 제공하 는 기상청 서버, 위치를 제공하는 위치 기반 서버 등 다양한 컨텐츠에 따른 서버를 포함한다. 본 발명의 실시 예들은 하드웨어, 소프트웨어 또는 하드웨어 및 소프트웨어의 조합의 형태로 실현 가능하다는 것을 알 수 있을 것이다. 이러한 임의의 소프트웨어는 예를 들어, 삭제 가능 또는 재기록 가능 여부와 상관없이, ROM 등의 저장 장치와 같은 휘발성 또는 비휘발성 저장 장치, 또는 예를 들어, RAM, 메모리 칩, 장치 또는 집적 회로와 같은 메모리, 또는 예를 들어 CD, DVD, 자기 디스크 또는 자기 테이프 등과 같은 광학 또는 자기적으로 기록 가능함과 동시에 기계(예를 들어, 컴퓨터)로 읽을 수 있는 저장 매체에 저장될 수 있다. 휴대 단말 내에 포함될 수 있는 메모리는 본 발명의 실시 예들을 구현하는 명령어들을 포함하는 프로그램 또는 프로 그램들을 저장하기에 적합한 기계로 읽을 수 있는 저장 매체의 한 예임을 알 수 있을 것이다. 따라서, 본 발명 은 본 명세서의 임의의 청구항에 기재된 장치 또는 방법을 구현하기 위한 코드를 포함하는 프로그램 및 이러한 프로그램을 저장하는 기계로 읽을 수 있는 저장 매체를 포함한다. 또한, 이러한 프로그램은 유선 또는 무선 연 결을 통해 전달되는 통신 신호와 같은 임의의 매체를 통해 전자적으로 이송될 수 있고, 본 발명은 이와 균등한 것을 적절하게 포함한다. 또한, 상기 휴대 단말은 유선 또는 무선으로 연결되는 프로그램 제공 장치로부터 상기 프로그램을 수신하여 저 장할 수 있다. 상기 프로그램 제공 장치는 상기 휴대 단말의 데이터 제공을 제어하는 명령어들을 포함하는 프로 그램, 휴대 단말이 사용자에게 데이터를 제공하는데 필요한 정보 등을 저장하기 위한 메모리와, 상기 휴대 단말 과의 유선 또는 무선 통신을 수행하기 위한 통신부와, 상기 휴대 단말의 요청 또는 자동으로 해당 프로그램을 상기 호스트 장치로 전송하는 제어부를 포함할 수 있다. 한편, 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해 져서는 안되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2013-0082435", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 휴대 단말을 나타내는 개략적인 블록도. 도 2는 본 발명의 일 실시 예에 따른 휴대 단말의 전면 사시도를 나타낸 도면. 도 3은 본 발명의 일 실시 예에 따른 휴대 단말의 후면 사시도를 나타낸 도면. 도 4는 본 발명의 실시 예에 따른 입력 유닛과 터치 스크린의 내부 단면도를 나타낸 도면. 도 5는 본 발명의 실시 예에 따른 입력 유닛을 나타낸 블럭도. 도 6은 본 발명의 실시 예에 따른 휴대 단말의 데이터 제공 방법을 나타낸 순서도. 도 7은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 방 법을 나타낸 순서도. 도 8은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 통화를 이용하여 데이터를 제공하는 예 시도. 도 9는 본 발명의 실시 예에 따른 휴대 단말에 콜이 수신되는 경우 데이터를 제공하는 방법을 나타낸 순서도. 도 10은 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해 데이터를 제공하는 방법을 나타낸 순서도. 도 11a는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 문자 메시지를 통해 사용자에게 데이 터를 제공하는 예시도. 도 11b는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우의 예시도. 도 11c는 본 발명의 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 이메일을 통해 사용자에게 데이터를 제공하는 예시도. 도 12는 본 발명의 다른 실시 예에 따른 휴대 단말에 이벤트가 발생되는 경우 발생된 이벤트에 대응되는 모듈을 통해 데이터를 제공하는 방법을 나타낸 순서도."}
