{"patent_id": "10-2023-0002255", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0110321", "출원번호": "10-2023-0002255", "발명의 명칭": "무선 통신시스템을 통한 에지 컴퓨팅 서비스 정보 제공 방법", "출원인": "삼성전자주식회사", "발명자": "김혜성"}}
{"patent_id": "10-2023-0002255", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제어 신호 처리 방법에 있어서,기지국으로부터 전송되는 제1 제어 신호를 수신하는 단계;상기 수신된 제1 제어 신호를 처리하는 단계; 및상기 처리에 기반하여 생성된 제2 제어 신호를 상기 기지국으로 전송하는 단계를 포함하는 것을 특징으로 하는제어 신호 처리 방법."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시는 에지 컴퓨팅 시스템에서 application triggering을 통해서 에지 컴퓨팅 서비스 정보를 제공하는 방법을 제공한다. 보 다 구체적으로, 본 개시는, 에지 컴퓨팅 시스템을 구성하는 에지 인에이블러 클라이언트(edge enabler client; EEC)와 에지 인에이블러 서버(edge enabler server) 및 에지 설정 서버(edge configuration server; ECS) 간 무 선 통신 시스템에서의 연동을 제공하는 device triggering 또는 application triggering 을 활용하는 방법 및 장치를 제공한다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신 시스템과 에지 컴퓨팅 시스템에 관련된 것으로, 보다 구체적으로 본 개시는 이동 통신 시 스템을 통해서 에지 컴퓨팅 서비스 정보를 제공하는 방법 및 장치에 대한 것이다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어,Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 한편, ECS 또는 EES 내 저장된 에지 데이터 네트워크 설정 정보나 에지 어플리케이션 서버(edge application server; EAS) 정보가 변경되면, 이와 같은 변경에 따른 notification service가 EEC로 제공되어야 한다. 이때, notification service 제공을 위하여 EEC와 EES/ECS 사이의 연결 상태가 지속적으로 유지되어야 하며, 이를 위 한 keep-alive 동작이 수행됨으로써, 단말 파워 소모가 증가할 수 있다. 이를 해결하기 위한 방안으로 무선 통 신 시스템에서 제공하는 device triggering 방안이 있으나, EEC와 EES 간 수행되는 절차는 다양하기 때문에 어 떤 절차를 수행해야 하는지 결정하는 방법이 필요하다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에, 본 개시의 일 목적은, 상술한 문제를 해결하면서, EEC와 EES/ECS 간 필요한 절차를 어떻게 선택하고 수행 하는지에 대한 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명은 무선 통신 시스템에서 제어 신호 처리 방법에 있어서, 기지국으 로부터 전송되는 제1 제어 신호를 수신하는 단계; 상기 수신된 제1 제어 신호를 처리하는 단계; 및 상기 처리에 기반하여 생성된 제2 제어 신호를 상기 기지국으로 전송하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 예시에 따르면, EEC와 ECS 또는 EES 사이의 연결 상태를 지속적으로 유지할 필요 없이, 단말 내의 EEC에, 지속적으로 업데이트 되는 에지 컴퓨팅 서비스 정보를 제공할 수 있는 효과가 있다. 또한 본 개시의 일 예시에 따르면, EEC가 EES/ECS와의 직접 통신 없이, 코어 네트워크를 통하여 수신한 트리거 링 정보에 따라, EAS 정보 또는 에지 데이터 네트워크 설정 정보 획득을 위하여 필요한 절차를 적절히 수행할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면들을 참조하여 본 발명의 동작 원리를 상세히 설명한다. 그리고 후술되는 용어들은 본 발명에 서의 기능을 고려하여 정의된 용어들이다. 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있으므 로 그 정의는 본 명세서 전반에 걸친 내용에 따라 정해져야 한다. 본 개시에서 사용되는 망 객체(network entity) 및 Edge Computing 시스템의 객체들을 지칭하는 용어, 메시지들 을 지칭하는 용어, 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 발명이 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있음은 당업자에게 자명하다. 이하 편의를 위하여, 본 발명은 5G 시스템 규격에서 정의하는 용어와 명칭들을 사용하지만 상기 용어 및 명칭들 에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시스템에도 동일하게 적용될 수 있다. 도 1은 에지 컴퓨팅 시스템의 한 예를 도시한 도면이다. Edge Computing 시스템은 Edge Enabler Server, Edge Configuration Server 및 Edge Enabler Client(EEC)로 구성될 수 있다. Edge Enabler Server는 Edge Hosting Environment(혹은 Edge Computing Platform)를 구축하고 있으며, Edge Hosting Environment 내 구동되고 있는 Edge Application Server에 대한 정보를 알고 있다. Edge Enabler Server는 단말(도 1에서 user equipment, UE)과 교섭하여, 단말의 Application Client와 Edge Hosting Environment 내의 Edge Application Server를 연결해주는 기능을 수행한다. Edge Computing 시스템을 지원하는 단말에는 Edge Enabler Client가 내장되어 있을 수 있으며, 상기 교섭은 Edge Enabler Client와 Edge Enabler Server의 상호 연동을 통해서 진행될 수 있다. 상기 교섭에서와 같이, Edge Enabler Client와 Edge Enabler Server 간 상호 연동이 수행되는 layer를 Edge Enabling Layer라 할 수 있다. 본 발명에서 언급하는 단말은 스 마트폰 뿐만 아니라 IoT 장치 및 차량 등을 포함한다. Edge Configuration Server는, Edge Enabler Server들의 deployment 정보를 알고 있으며, Edge Computing 서비 스를 이용하기 위한 설정 정보를 단말에게 전달하기 위한 기능을 수행한다. 여기에서, 설정 정보는 Edge Data Network connection 정보(예: Data Network Name, S-NSSAI 등), Edge Data Network Service Area 정보(예: Cell list, List of Tracking Area, PLMN ID), 또는 Edge Enabler Server connection 정보(예: URI) 등을 포 함할 수 있다. Edge Data Network Service Area 정보는 Edge Enabler Server에 의해 설정된 Edge Enabler Server 이용 가능 지역에 대한 정보일 수 있다. 이를 기반으로, 단말은 특정위치에서 접속 가능한 Edge Enabler Server 정보를 받아올 수 있다. Edge Configuration Server가 특정 Edge Enabler Server의 Edge Hosting Environment 내에서 구동 중인 Edge Application Server에 대한 정보를 알 수 있다면, 단말도 Edge Enabler Client를 통해서 상기 Edge Application Server에 대한 정보를 얻을 수 있다. Edge Application Server는 Edge Computing 시스템 내에서 구동되는 제 3자 어플리케이션 서버를 의미한다. 보 다 구체적으로, Edge Application Server는 Edge Hosting Environment에서 제공하는 Infrastructure를 전제로 구동되는 제 3자 어플리케이션 서버이며, 단말과 가까운 위치에서 서비스를 제공할 수 있기 때문에 초 저지연 서비스를 제공할 수 있다. 단말 내에는 Application Client, Application Client와 Edge Computing 서비스를 연동해주는 Edge Enabler Client, 그리고 도면에는 도시되지 않았으나, 이동통신 시스템에 접속하는 Mobile Terminal(MT)이 존재할 수 있 다. 단말의 Application은 제 3자가 제공하는 애플리케이션으로서 특정 응용서비스를 위하여 단말 내에서 구동 되는 Client 응용 프로그램을 의미한다. 단말 내에는 여러 Application이 구동될 수 있다. 이 Application 중 적어도 하나 이상은 MEC(mobile edge computing 또는 multi-access edge computing) 서비스를 사용할 수 있다. 단말 내 Edge Enabler Client는, Edge Computing 서비스 이용에 필요한 단말 내 동작을 수행하는 Client를 의 미한다. Edge Enabler Client는 어떤 응용 Application이 Edge Computing 서비스를 이용할 수 있는지 판단하고, Edge Computing 서비스를 제공하는 Edge Application Server에, 단말 Application Client의 데이터 가 전달될 수 있도록 네트워크 인터페이스를 연결해주는 동작을 수행할 수 있다. Edge Computing 서비스를 이용하기 위한 데이터 연결을 수립하는 동작은 Mobile Terminal을 통해 3GPP 통신 Layer에서 수행할 수 있다. 3GPP 통신 Layer는 이동통신 시스템을 이용하기 위한 모뎀 동작을 수행하는 Layer를 의미하며, 데이터 통신을 위한 무선 연결을 수립하고, 이동통신 시스템에 단말을 등록하고, 이동통신 시스템에 데이터 전송을 위한 연결을 수 립하고, 데이터를 송수신하는 역할을 수행한다. 도 2는 본 개시의 일 예시에 따른 ECS의 EEC triggering 절차를 설명하기 위한 도면이다. 도 2의 단계 0a를 참조하면, EEC(edge enabler client)는 단말 내 SMS(short message service) over NAS(non- access stratum)와 SMS over IP 중 적어도 하나를 지원하는지 확인한다. 또한, EEC 는 SMS over NAS와 SMS over IP 중 적어도 하나를 단말에서 지원하고, EEC가 device triggering 또는 application triggering 동작을 지원하면(예를 들어, EEC 가 SMS 정보 내 payload 에 대한 디코딩을 수행할 수 있고, payload 내 ECS(edge configuration server)가 지시한 정보에 따라 절차를 수행할 수 있으면), ECS에 EEC triggering 서비스 요청을 전송할 수 있다. EEC triggering 서비스 요청 전송 메시지는, EEC triggering 요청 지시자, triggering service description (service provisioning), triggering service period, triggering service area, port ID, UE ID, 또는 EEC ID 등의 정보 중 적어도 하나를 포함할 수 있다. 여기에서, Triggering service description은 EEC 에서 triggering 을 수행해야 하는 절차 또는 invoke 해야 하는 service 에 대한 정보를 포 함할 수 있다. 또한, Triggering service period와 triggering service area 정보는, ECS가 EEC triggering 를 수행해야 하는 시간과 지역 정보를 나타낼 수 있다. 단계 0b에서, ECS는 EEC의 요청에 따라 EEC triggering service 를 성공적으로 지원해줄 수 있는지에 대한 응답 을 전송한다. ECS 는 EEC triggering service 를 성공적으로 지원할 수 있는 경우, triggering service 식별자 (또는 triggering service subscription 식별자) 를 생성하여 단계 0b의 응답 메시지를 통해서 EEC 에 제공할 수 있다. ECS 는 생성한 triggering service 식별자와 EEC ID, UE ID, triggering service description (service provisioning), triggering service period, triggering service area, 또는 port ID 등을 맵핑하여 저장하고, 이를 관리할 수 있다. EEC 또한, ECS 로부터 수신한 triggering service 식별자와 EEC ID, UE ID, triggering service description (service provisioning), triggering service period, triggering service area, 또는 port ID 등을 맵핑하여 저장하고, 이를 관리할 수 있다. Triggering service 식별자와 저장된 정보 는 추후 EEC 또는 ECS 가 EEC triggering service 를 중단 또는 수정하기 위해서 사용될 수 있다. 예를 들어, EEC 는 ECS 에 triggering service 식별자, EEC ID, UE ID, triggering service description 을 전송하면서 EEC triggering service 중단을 요청할 수 있다. 중단 요청을 EEC 로부터 수신한 ECS 는 해당 EEC triggering service 중단 요청에 포함된 triggering service 식별자, EEC ID, UE I, triggering service description을 통 해서 EEC triggering service 중단 대상 EEC 와 중단 서비스를 결정하고 EEC 에 중단 여부를 전송할 수 있다. 또 다른 예로, ECS 는 자체적으로 특정 EEC 에 대한 EEC triggering service 중단을 결정할 수 있다. 이러한 경우, ECS 는 중단된 EEC triggering service 대상 EEC 에 EEC triggering service 식별자, EEC ID, 중단 대상 EEC triggering service description 을 전송하면서 EEC triggering service 중단을 알릴 수 있다. 단계 1에서, ECS는 에지 데이터 네트워크 설정 정보(EES 주소 정보, edge data network 의 DNN 또는 S-NSSAI, EES 서비스 지역 정보, EDN 서비스 지역 정보 등)의 변화를 감지하거나, EEC가 포함된 단말의 이동에 따른 에지 데이터 네트워크 설정 정보의 업데이트가 필요한 경우, EEC triggering 을 수행하기로 결정할 수 있다. 단계 2에서, ECS는 NEF(network exposure function)에, 단말 식별자, GPSI, AF ID, Trigger Reference Number, App Port ID, Validity Period, Priority, Trigger payload: triggering information(triggering service description, indication to perform service provisioning, EEC ID, ECS info (ECS 주소 및 식별자), triggering service deadline 등을 제공하면서 Trigger Delivery 서비스를 요청할 수 있다. 단계 3에서, NEF는 5G 코어 네트워크 기능(예를 들어, user data management, access management function)과 SMS service center(SMS-SC)와 연동하여 SMS-SC를 선택하고, ECS로부터 수신한 trigger를 선택된 SMS-SC로 전 송할 수 있다. 단계 4에서, NEF는 SMS-SC로 trigger 를 성공적으로 전달하였음을 알리는 응답메시지를 ECS에 전송할 수 있다. 단계 5에서, SMS-SC는 5G 코어망과 연동하여, 단말에게 SMS를 전송한다. 단계 6에서, SMS-SC는 단말로 SMS를 성공적으로 전송하였는지에 대한 message delivery report 정보를 NEF로 전송한다. 단계 7에서, NEF는 단말로 triggering message가 성공적으로 전송 완료되었는지에 대한 정보를 ECS로 제공할 수 있다. ECS는 NEF로부터 해당 정보를 수신하면, EEC가 service provisioning 을 수행할 것으로 예측할 수 있다. 단계 8에서, 단말은 수신한 SMS 내 포함된 port ID, EEC ID, ECS info, triggering service description 정보 를 EEC로 제공한다. 단계 9에서, EEC는 상술한 절차를 통해서 수신한 정보를 고려하여 service provisioning 요청을 수행한다. 이를 통하여, ECS로부터, 업데이트된 에지 데이터 설정 정보(EES 주소 정보, edge data network 의 DNN 또는 S- NSSAI, EES 서비스 지역 정보, EDN 서비스 지역 정보 등)를 획득할 수 있다. 도 3은 본 개시의 일 예시에 따른 EES의 EEC triggering 절차를 설명하기 위한 도면이다. 단계 0a에서, EEC는 단말 내 SMS over NAS와 SMS over IP 중 적어도 하나를 지원하는지 확인한다. 또한, EEC는 SMS over NAS 와 SMS over IP 중 적어도 하나를 단말에서 지원하고, EEC가 device triggering 또는 application triggering 동작을 지원하면(예를 들어, EEC 가 SMS 정보 내 payload 에 대한 디코딩을 수행할 수 있고, payload 내 ECS 가 지시한 정보에 따라 절차를 수행할 수 있으면), EES(edge enabler server)로, EEC triggering 서비스 요청을 전송할 수 있다. EEC triggering 서비스 요청 전송 메시지는, EEC triggering 요청 지시자, triggering service description (service provisioning, EAS discovery, EEC Registration, Application Context Relocation request), triggering service period, triggering service area, port ID, 또는 EEC ID 등의 정보 중 적어도 하나를 포함할 수 있다. 여기에서, Triggering service description은 EEC 에서 triggering을 수행해야 하는 절차 또는 invoke 해야 하는 service 에 대한 정보를 포함하거나, EEC가 EEC triggering service 를 통해서 수행 요청 받기를 원하는 EES 제공 서비스 절차 정보를 포함할 수 있다 (EAS discovery, EEC Registration, Application Context Relocation 중 적어도 하나의 절차 또는 서비스 정보). 또 한, Triggering service period와 triggering service area 정보는, EES가 EEC triggering 를 수행 해야하는 시간과 지역 정보를 나타낼 수 있다. 단계 0b에서, EES는 EEC 의 요청에 따라 EEC triggering service 를 성공적으로 지원해줄 수 있는지에 대한 응 답을 전송한다. EES 는 EEC triggering service 를 성공적으로 지원할 수 있는 경우, triggering service 식별 자 (또는 triggering service subscription 식별자) 를 생성하여 단계 0b의 응답 메시지를 통해서 EEC 에 제공 할 수 있다. EES 는 생성한 triggering service 식별자와 EEC ID, UE ID, triggering service description (service provisioning), triggering service period, triggering service area, 또는 port ID 등을 맵핑하여 저장하고, 이를 관리할 수 있다. EEC 또한 EES 로부터 수신한 triggering service 식별자와 EEC ID, UE ID, triggering service description (service provisioning), triggering service period, triggering service area, 또는 port ID 등을 맵핑하여 저장하고, 이를 관리할 수 있다. Triggering service 식별자와 상기 저장된 정보는, 추후 EEC 또는 EES 가 EEC triggering service 를 중단 또는 수정하기 위해서 사용될 수 있다. 예를 들어, EEC 는 EES 에 triggering service 식별자, EEC ID, UE ID, triggering service description 을 전송하 면서 EEC triggering service 중단을 요청할 수 있다. 중단 요청을 EEC 로부터 수신한 EES 는 해당 EEC triggering service 중단 요청에 포함된 triggering service 식별자, EEC ID, UE ID, triggering service description을 통해서 EEC triggering service 중단 대상 EEC 와 중단 서비스를 결정하고 EEC 에 중단 여부를 전송할 수 있다. 또 다른 예로, EES 는 자체적으로 특정 EEC 에 대한 EEC triggering service 중단을 결정할 수 있다. 이러한 경우, EES 는 중단된 EEC triggering service 대상 EEC 에 EEC triggering service 식별자, EEC ID, EES ID, 중단 대상 EEC triggering service description 을 전송하면서 EEC triggering service 중단 을 알릴 수 있다. 단계 1에서, EES는 EAS 프로파일 정보(EAS 주소 정보, EAS 의 DNN 또는 S-NSSAI, EAS 서비스 지역 정보, EAS data network access identifier, EAS service KPI 정보 등)의 변화를 감지하거나, EEC가 포함된 단말의 이동 에 따른 EAS 정보 업데이트, application context relocation, 또는 EEC Registration이 필요한 경우, EEC triggering을 수행하기로 결정할 수 있다. 예를 들어, EAS 프로파일 정보의 업데이트는, EES 에서, EAS와 EES 간 EAS Registration 절차를 통해서 EAS 가 제공하는 EAS 프로파일 정보를 확인하고 EEC triggering 수행을 결 정하는 것에 의하여 수행될 수 있다. 또한 일 예로, EEC triggering은, 단말의 이동이나 EAS 과부하 등에 따른 새로운 EAS 선택과 application context relocation이 필요한 경우, EES에 의하여 결정될 수 있다. 또한 일 예 로, EAS management system(MnS)는 EAS 사용 빈도 또는 서비스 제공 상태를 고려하여 EAS termination 수행 여 부를 결정하기 위해서 EES 에 EAS 에 대한 잠재적인 서비스 수요 관련 정보를 요청하는 경우 EES는 현재 자신에 게 등록된 EEC로부터 해당 EAS에 대한 잠재적인 서비스 요청 수요를 파악하기 위해 EEC Registration 절차를 수 행하도록 하기 위한 EEC triggering 수행을 결정할 수 있다. 단계 2에서, EES는 NEF에 단말 식별자, GPSI, AF ID, Trigger Reference Number, App Port ID, Validity Period, Priority, Trigger payload: triggering information (triggering service description, indication to perform service provisioning, EEC ID, EES info (EES 주소 및 식별자), EAS 식별자 및 주소 정보, triggering service deadline 등을 제공하면서 Trigger Delivery 서비스를 요청할 수 있다. 단계 3에서, NEF는 5G 코어 네트워크 기능(예를 들어, user data management, access management function) 및 SMS service center(SMS-SC)와 연동하여 SMS-SC를 선택하고, ECS로부터 수신한 trigger를 상기 선택된 SMS- SC로 전송할 수 있다. 단계 4에서, NEF는 SMS-SC로 trigger 를 성공적으로 전달하였음을 알리는 응답메시지를 EES에 전송할 수 있다. 단계 5에서, SMS-SC는 5G 코어 망과 연동하여 단말로 SMS를 전송한다. 단계 6에서, SMS-SC는 단말로, SMS를 성공적으로 전송하였는지에 대한 message delivery report 정보를 NEF에 전송한다. 단계 7에서, NEF는, 단말에 triggering message가 성공적으로 전송 완료되었는지에 대한 정보를 ECS에 제공할 수 있다. EES는 NEF로부터 해당 정보를 수신하면, EEC 가 triggering service description에 따른 절차를 수행 할 것으로 예측할 수 있다. 단계 8에서, 단말은 수신한 SMS 내 포함된 port ID, EEC ID, EES info (식별자 및 주소 정보), triggering service description 정보, triggering service deadline 를 EEC에 제공한다. 단계 9에서, EEC는 상술한 절차를 통해서 수신한 정보에 따라, 수행 해야하는 절차를 수행한다. 예를 들어, EEC 는 triggering service description 정보에 기반하여 확인된 절차를, EES info로 식별된 EES에 대해서 수행한 다. Triggering service description 정보에 EAS discovery 절차에 대한 정보가 포함된 경우, EEC는 EES로 EAS discovery 요청을 전송한다. 만약, triggering service description 정보에 EAS 프로파일 정보가 같이 포함된 경우, 해당 EAS 프로파일 정보를 EAS discovery filter 정보로 사용하여 EES로 EAS discovery request 를 전송 할 수 있다. 또한, 일 예로, Triggering service description 정보에 application context relocation 절차에 대한 정보가 포함된 경우, EEC는 단말 내 저장된 에지 데이터 네트워크 설정 정보를 사용하거나 ECS에 service provisioning 을 수행하여 에지 데이터 네트워크 설정 정보를 획득한 후, 해당 에지 데이터 네트워크 설정 정보를 이용해서 확인된 EES에 대해서 EAS discovery 절차를 수행한다. 또한, EEC는, EAS discovery 절차를 통하여 획득한 EAS 정보(주소 및 식별자)와 EAS discovery 절차를 수행한 대상인 EES에 대한 정보(주소 및 식별자)를 포함하는 application context relocation request를, EEC triggering을 수행한 EES로 전송할 수 있다. 또한, 일 예로, Triggering service description 정보에 EEC Registration 절차에 대한 정보가 포함된 경우, EEC는 EES에 대하여 EEC Registration 절차를 수행할지 여부를 결정할 수 있다. 예를 들어, triggering service description 정보에 EEC Registration 절차에 대한 정보와 특정 EAS에 대한 정보가 포함된 경우, EEC 는 상기 특정 EAS로 서비스를 요청할 수 있는 어플리케이션 클라이언트가 단말 내에 설치되어 있는지, 또는 설 치되어 있는 어플리케이션 클라이언트가 상기 서비스를 요청할지 등을 고려하여, EES로 EEC Registration 요청 메시지를 전송할지 여부를 결정할 수 있다. 도 4는 본 개시의 일 예시에 따른 단말의 구조를 도시한 블록도이고, 도 5는 본 개시의 일 예시에 따른 에지 컴 퓨팅 시스템 상의 서버의 구조를 도시한 블록도이며, 도 6은 본 개시의 일 예시에 따른 네트워크 기능 엔티티의 구조를 도시한 블록도이다. 도 4를 참조하면, 본 개시의 일 예시에 따른 단말은 송수신부, 제어부, 및 저장부를 포함할 수 있다. 본 발명에서 제어부는, 회로 또는 어플리케이션 특정 통합 회로 또는 적어도 하나의 프로세서라고 정의될 수 있다. 송수신부는 다른 네트워크 엔티티 또는 서버와 연동되어, 신호를 송수신할 수 있다. 제어부는 본 개 시에서 제안하는 실시 예에 따른 단말의 전반적인 동작을 제어할 수 있다. 예를 들어, 제어부는 상기에서 기술한 순서도에 따른 동작을 수행하도록 각 블록 간 신호 흐름을 제어할 수 있다. 또한 제어부는, 상술한 본 개시의 일 예시에 따른 EES/ ECS와 연동할 수 있는 EEC 및 애플리케이션들의 client 동작을 제어하는 기능을수행할 수 있다. 저장부는 상기 송수신부를 통해 송수신되는 정보 및 제어부를 통해 생성되는 정보 중 적어도 하 나를 저장할 수 있다. 도 5를 참조하면, 본 개시의 일 예시에 따른 서버는 송수신부, 제어부, 및 저장부를 포함할 수 있다. 본 발명에서 제어부는, 회로 또는 어플리케이션 특정 통합 회로 또는 적어도 하나의 프로세서라고 정의될 수 있다. 본 개시의 서버는, 일 예로, 상술하였던 에지 컴퓨팅 시스템 상의 EAS, EES 또는 ECS를 포함할 수 있 다. 송수신부는 다른 네트워크 엔티티 또는 단말과의 사이에서 신호를 송수신할 수 있다. 제어부는 본 개 시에서 제안하는 실시 예에 따른 서버의 전반적인 동작을 제어할 수 있다. 예를 들어, 제어부는 상기에서 기술한 순서도에 따른 동작을 수행하도록 각 블록 간 신호 흐름을 제어할 수 있다. 저장부는 상기 송수신부를 통해 송수신되는 정보 및 제어부를 통해 생성되는 정보 중 적어도 하 나를 저장할 수 있다. 도 6을 참조하면, 본 개시의 일 예시에 따른 네트워크 엔티티는 송수신부, 제어부, 및 저장부를 포함할 수 있다. 본 발명에서 제어부는, 회로 또는 어플리케이션 특정 통합 회로 또는 적어도 하나의 프로세서 라고 정의될 수 있다. 본 개시의 네트워크 엔티티는, 일 예로, 5GC를 통하여 단말과 연동하는 NEF 또는 5GC 상 의 NF(network function) 등을 포함할 수 있다. 송수신부는 다른 네트워크 엔티티나 서버, 또는 단말과의 사이에서 신호를 송수신할 수 있다. 제어부(62 0)는 본 개시에서 제안하는 실시 예에 따른 서버의 전반적인 동작을 제어할 수 있다. 예를 들어, 제어부는 상기에서 기술한 순서도에 따른 동작을 수행하도록 각 블록 간 신호 흐름을 제어할 수 있다. 저장부는 상기 송수신부를 통해 송수신되는 정보 및 제어부를 통해 생성되는 정보 중 적어도 하 나를 저장할 수 있다. 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해져서 는 아니 되며 후술하는 특허청구의 범위만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다. 상술한 본 개시의 구체적인 실시예들에서, 본 개시에 포함되는 구성 요소는 제시된 구체적인 실시예에 따라 단 수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선 택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하 더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다."}
{"patent_id": "10-2023-0002255", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한편, 이상에서 설명된 본 명세서와 도면에 개시된 실시 예들은 본 발명의 내용을 쉽게 설명하고, 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 범위는 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0002255", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 예시에 따른 에지 컴퓨팅 시스템 구조를 도시한 도면이다. 도 2는 본 개시의 일 예시에 따른 ECS의 EEC triggering 절차를 설명하기 위한 도면이다. 도 3은 본 개시의 일 예시에 따른 EES의 EEC triggering 절차를 설명하기 위한 도면이다. 도 4는 본 개시의 일 예시에 따른 단말의 구조를 도시한 블록도이다. 도 5는 본 개시의 일 예시에 따른 에지 컴퓨팅 시스템 상의 서버의 구조를 도시한 블록도이다. 도 6은 본 개시의 일 예시에 따른 네트워크 기능 엔티티의 구조를 도시한 블록도이다."}
