{"patent_id": "10-2021-7023059", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0104868", "출원번호": "10-2021-7023059", "발명의 명칭": "인공 지능을 갖춘 투석 시스템", "출원인": "프레제니우스 메디칼 케어 홀딩스 인코퍼레이티드", "발명자": "레인펠너, 노르베르트"}}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "의료 디바이스의 동작 모듈의 상태의 적응적 최적화(adaptive optimization)를 제한하는 방법으로서,새로운 상태가, 상기 의료 디바이스에 부인할 수 없는 방식으로(non-repudiable manner) 제공된 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 단계;동작 파라미터가 상기 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 단계; 및적어도 하나의 동작 파라미터가 상기 제한 중 적어도 하나를 벗어나면, 상기 의료 디바이스를 이전의 유효 상태로 복귀시키는 단계를 포함하는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적응적 최적화는 인공 지능에 대한 관련 입력과 함께 상기 인공 지능을 이용하여 제공되는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 의료 디바이스는 투석 시스템인, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,제한 데이터는, 상기 제한 데이터의 일-방향 해시 값과 함께 상기 의료 디바이스에 제공되는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 일-방향 해시는 디지털 서명된 SHA256 해시인, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 일-방향 해시 값은 공개 키/개인 키 쌍의 일부인 개인 키를 사용하여 디지털 서명되는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 시스템은, 상기 시스템의 운용자 또는 상기 의료 디바이스로부터 치료를 받는 환자 중 하나에 따라 초기상태로 제공되는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 운용자 또는 상기 환자 중 하나는 상기 의료 디바이스에 의해 자동으로 검출되는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2021-0104868-3-제1항에 있어서,동작 모듈은, 상기 새로운 상태가 상기 동작 모듈에 의해 제공되는 상태 데이터에 기초하여 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 감독자 모듈에 상태 데이터를 제공하고,상기 감독자 모듈은 적어도 하나의 동작 파라미터가 제한을 벗어나면 상기 동작 모듈을 이전의 상태로 복귀시키는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 상태 데이터의 디지털 서명된 일-방향 해시가 상기 동작 모듈에 의해 제공되는, 방법."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "의료 디바이스의 동작 모듈의 상태의 적응적 최적화를 제한하는 소프트웨어를 포함하는 비일시적 컴퓨터 판독가능 매체로서, 상기 소프트웨어는:새로운 상태가, 상기 의료 디바이스에 부인할 수 없는 방식으로 제공된 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 실행 코드;동작 파라미터가 상기 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 실행 코드; 및적어도 하나의 동작 파라미터가 상기 제한 중 적어도 하나를 벗어나면, 상기 의료 디바이스를 이전의 유효 상태로 복귀시키는 실행 코드를 포함하는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 적응적 최적화는 인공 지능에 대한 관련 입력과 함께 상기 인공 지능을 이용하여 제공되는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 의료 디바이스는 투석 시스템인, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,제한 데이터가, 상기 제한 데이터의 일-방향 해시 값과 함께 상기 의료 디바이스에 제공되는, 비일시적 컴퓨터판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 일-방향 해시는 디지털 서명된 SHA256 해시인, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 일-방향 해시 값은 공개 키/개인 키 쌍의 일부인 개인 키를 사용하여 디지털 서명되는, 비일시적 컴퓨터판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2021-0104868-4-제11항에 있어서,상기 시스템은, 상기 시스템의 운용자 또는 상기 의료 디바이스로부터 치료를 받는 환자 중 하나에 따라 초기상태로 제공되는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 운용자 또는 상기 환자 중 하나는 상기 의료 디바이스에 의해 자동으로 검출되는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,동작 모듈은, 상기 새로운 상태가 상기 동작 모듈에 의해 제공되는 상태 데이터에 기초하여 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 감독자 모듈에 상태 데이터를 제공하고,상기 감독자 모듈은 적어도 하나의 동작 파라미터가 제한을 벗어나면 상기 동작 모듈을 이전의 상태로 복귀시키는, 비일시적 컴퓨터 판독가능 매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 상태 데이터의 디지털 서명된 일-방향 해시가 상기 동작 모듈에 의해 제공되는, 비일시적 컴퓨터 판독가능매체."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "투석 시스템으로서:투석 기계; 및비일시적 컴퓨터 판독가능 매체의 소프트웨어를 실행하는 프로세서를 갖는 제어 유닛을 포함하고, 상기 소프트웨어는 상기 투석 기계를 작동시키고 상기 투석 시스템의 상태의 적응적 최적화를 제한하며, 상기소프트웨어는, 새로운 상태가 상기 투석 시스템에 부인할 수 없는 방식으로 제공된 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 실행 코드, 동작 파라미터가 상기 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 실행 코드, 및 적어도 하나의 동작 파라미터가 상기 제한 중 적어도 하나를 벗어나면 상기 의료 디바이스를 이전의 유효한 상태로 복귀시키는 실행 코드를 포함하는, 투석 시스템."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서,상기 적응적 최적화는 인공 지능에 대한 관련 입력과 함께 상기 인공 지능을 이용하여 제공되는, 투석 시스템."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제21항에 있어서,제한 데이터는, 상기 제한 데이터의 일-방향 해시 값과 함께 상기 의료 디바이스에 제공되고, 상기 일-방향 해시는 디지털 서명된 SHA256 해시인, 투석 시스템."}
{"patent_id": "10-2021-7023059", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제21항에 있어서,상기 제어 유닛은 동작 모듈 및 상기 동작 모듈로부터 상태 데이터를 수신하고 상기 동작 모듈에 의해 제공되는상태 데이터에 기초하여 상기 새로운 상태가 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 감독자 모듈을 더 포함하는, 투석 시스템.공개특허 10-2021-0104868-5-청구항 25 제24항에 있어서,상기 감독자 모듈은 적어도 하나의 동작 파라미터가 제한을 벗어나면 상기 동작 모듈을 이전의 상태로 복귀시키는, 투석 시스템."}
{"patent_id": "10-2021-7023059", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "의료 디바이스의 동작 모듈의 상태의 적응적 최적화를 제한하는 것은, 새로운 상태가, 상기 의료 디바이스에 부 인할 수 없는 방식으로 제공된 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 단계, 동작 파라미터가 상기 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 단계, 및 적어도 하나의 동작 파라미터 가 상기 제한 중 적어도 하나를 벗어나면, 상기 의료 디바이스를 이전의 유효 상태로 복귀시키는 단계를 포함한 다. 상기 적응적 최적화는 인공 지능에 대한 관련 입력과 함께 상기 인공 지능을 이용하여 제공될 수 있다. 상 기 의료 디바이스는 투석 시스템일 수 있다. 제한 데이터가, 예컨대 SHA256 해시를 사용하여 상기 제한 데이터 의 일-방향 해시 값과 함께 상기 의료 디바이스에 제공될 수 있다. 상기 일-방향 해시 값은 공개 키/개인 키 쌍 의 일부인 개인 키를 사용하여 디지털 서명될 수 있다."}
{"patent_id": "10-2021-7023059", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 의료 투석 시스템, 보다 구체적으로 인공 지능을 이용하는 의료 투석 시스템에 관한 것이다."}
{"patent_id": "10-2021-7023059", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "투석 기계는 신장 질환의 치료에서 사용되는 것이 알려져 있다. 두 가지 유형의 투석 방법은 혈액투석(HD)과 복막투석(PD)이다. 혈액투석 동안에, 환자의 혈액이 혈액투석 기계의 투석기를 통과하면서 투석액도 투석기를 통과한다. 투석기의 반투막이 투석기 내의 투석액으로부터 혈액을 분리하고 투석액과 혈류 사이에서 확산 및 삼투 교환이 일어나도록 허용한다. 복막 투석 동안에, 환자의 복강에 주기적으로 투석액 또는 투석 용액이 주 입된다. 환자 복막의 막 라이닝(membranous lining)은, 용액과 혈류 사이에서 확산 및 삼투 교환이 일어나도록 허용하는 천연 반투막으로서 작용한다. PD 사이클러(cyclers)라고도 불리는 자동 복막 투석 기계는, 전체 복막 투석 프로세스를 제어하도록 설계되어서, 복막 투석 프로세스는 임상 직원이 참석하지 않고 집에서 일반적으로 밤새 수행될 수 있다. 다수의 상이한 유형의 시스템은 인공 지능과 함께 사용될 때 제공되는 적응적 운용으로부터 이점을 얻는다. 이 러한 시스템에서, 동작 파라미터는 인공 지능 시스템에 피드백을 제공하는 데이터 입력에 기초하여 수정된다. 예를 들어, 음성 인식 시스템이 성공 및 실패를 나타내는 데이터 입력에 기초하여 적응 및 개선될 수 있다. 적 응적 최적화는 음성 인식 시스템의 동작 상태를 수정하는 인공 지능 처리에 의해 제공될 수 있다. 투석 시스템 은 인공 지능에 의해 제공되는 적응적 최적화로부터 이점을 얻을 수 있지만, 그러한 적응 자체가, 투석 시스템 이 본래 의도된 대로 작동하지 않음을 초래하여 환자에게 해를 끼칠 가능성이 있다. 게다가, 투석 시스템의 설 계 및 운용은 미국에서 식품의약국(FDA)에 의해 규제되기 때문에(다른 국가는 유사한 규제 시스템을 갖음), 인 공 지능에 의해 제공하는 적응적 최적화는 적응에 뒤따르는 모듈의 상태-관련 데이터에 대한 무결성이 존재하지 않게 추적가능/반복가능하지 않은 방식으로 시스템이 승인된 설계 파라미터로부터 벗어나게 만들 수 있다."}
{"patent_id": "10-2021-7023059", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 허용 가능한 동작 파라미터 및 규제 요구조건에 응하여 투석 시스템을 유지하고 상태-관련 데이터에 대 한 무결성을 제공하는 방식으로 인공 지능을 이용하는 투석 시스템의 모듈의 적응을 용이하게 하는 메커니즘을 제공하는 것이 바람직하다."}
{"patent_id": "10-2021-7023059", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서에 설명된 시스템에 따르면, 의료 디바이스의 동작 모듈의 상태의 적응적 최적화를 제한하는 것은, 새 로운 상태가, 의료 디바이스에 부인할 수 없는 방식으로(non-repudiable manner) 제공된 제한을 벗어난 적어도 하나의 동작 파라미터를 갖는지를 결정하는 단계, 동작 파라미터가 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 단계, 및 적어도 하나의 동작 파라미터가 상기 제한 중 적어도 하나를 벗어나면 의료 디바이스를 이 전의 유효한 상태로 복귀시키는 단계를 포함한다. 적응적 최적화는 인공 지능에 대한 관련 입력과 함께 인공 지능을 이용하여 제공될 수 있다. 의료 디바이스는 투석 시스템일 수 있다. 제한 데이터는, 당해 제한 데이터 의 일-방향 해시 값과 함께 의료 디바이스에 제공될 수 있다. 일-방향 해시는 디지털 서명된 SHA256 해시일 수 있다. 일-방향 해시 값은 공개 키/개인 키 쌍의 일부인 개인 키를 사용하여 디지털 서명될 수 있다. 시스템은 시스템의 운용자 또는 의료 디바이스로부터 치료를 받는 환자에 따라서 초기 상태로 제공될 수 있다. 운용자 또는 환자는 의료 디바이스에 의해 자동으로 감지될 수 있다. 동작 모듈은, 새로운 상태가, 동작 모듈에 의해 제공되는 상태 데이터에 기초하여 제한을 벗어난 적어도 하나의 동작 파라미터를 갖는지를 결정하는 감독자 모 듈에 상태 데이터를 제공할 수 있으며, 감독자 모듈은 적어도 하나의 동작 파라미터가 제한을 벗어난다면 동작모듈을 이전의 상태로 되돌린다. 상태 데이터의 디지털 서명된 일-방향 해시는 운용 모듈에 의해 제공될 수 있 다. 본 명세서에 설명된 시스템에 따르면, 비일시적 컴퓨터 판독가능 매체가, 의료 디바이스의 동작 모듈의 상태의 적응적 최적화를 제한하는 소프트웨어를 포함한다. 소프트웨어는, 새로운 상태가 의료 디바이스에 부인할 수 없는 방식으로 제공된 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 실행 코드, 동작 파 라미터가 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 실행 코드, 및 적어도 하나의 동작 파라미터 가 상기 제한 중 적어도 하나를 벗어나면 의료 디바이스를 이전의 유효한 상태로 복귀시키는 실행 코드를 포함 한다. 적응적 최적화는 인공 지능에 대한 관련 입력과 함께 인공 지능을 이용하여 제공될 수 있다. 의료 디바 이스는 투석 시스템일 수 있다. 제한 데이터는, 당해 제한 데이터의 일-방향 해시 값과 함께 의료 디바이스에 제공될 수 있다. 일-방향 해시는 디지털 서명된 SHA256 해시일 수 있다. 일-방향 해시 값은 공개 키/개인 키 쌍의 일부인 개인 키를 사용하여 디지털 서명될 수 있다. 시스템은 시스템의 운용자 또는 의료 디바이스로부터 치료를 받는 환자에 따라서 초기 상태로 제공될 수 있다. 운용자 또는 환자는 의료 디바이스에 의해 자동으로 감지될 수 있다. 동작 모듈은, 새로운 상태가, 동작 모듈에 의해 제공되는 상태 데이터에 기초하여 제한을 벗 어난 적어도 하나의 동작 파라미터를 갖는지를 결정하는 감독자 모듈에 상태 데이터를 제공할 수 있으며, 감독 자 모듈은 적어도 하나의 동작 파라미터가 제한을 벗어난다면 동작 모듈을 이전의 상태로 되돌린다. 상태 데이 터의 디지털 서명된 일-방향 해시는 운용 모듈에 의해 제공될 수 있다. 본 명세서에 기재된 시스템에 더욱 따르면, 투석 시스템은 투석 기계 및 비일시적 컴퓨터 판독가능 매체의 소프 트웨어를 실행하는 프로세서를 갖는 제어 유닛을 포함한다. 소프트웨어는 투석 기계를 작동시키고 투석 시스템 의 상태의 적응적 최적화를 제한한다. 소프트웨어는, 새로운 상태가 투석 시스템에 부인할 수 없는 방식으로 제공된 제한을 벗어나는 적어도 하나의 동작 파라미터를 갖는지를 결정하는 실행 코드, 동작 파라미터가 제한을 벗어나지 않으면 상기 새로운 상태를 받아들이는 실행 코드, 및 적어도 하나의 동작 파라미터가 상기 제한 중 적어도 하나를 벗어나면 의료 디바이스를 이전의 유효한 상태로 복귀시키는 실행 코드를 포함한다. 적응적 최 적화는 인공 지능에 대한 관련 입력과 함께 인공 지능을 이용하여 제공될 수 있다. 제한 데이터는, 당해 제한 데이터의 일-방향 해시 값과 함께 의료 디바이스에 제공될 수 있으며, 상기 일-방향 해시는 디지털 서명된 SHA256 해시일 수 있다. 제어 유닛은 또한, 동작 모듈 및 당해 동작 모듈로부터 상태 데이터를 수신하고 새로 운 상태가 동작 모듈에 의해 제공되는 상태 데이터에 기초하여 제한을 벗어난 적어도 하나의 동작 파라미터를 갖는지를 결정하는 감독자 모듈을 포함할 수 있다. 감독자 모듈은, 적어도 하나의 동작 파라미터가 제한을 벗 어나면 동작 모듈을 이전의 상태로 되돌릴 수 있다. SHA256 해시 알고리즘 및 감독자/인증자 모듈을 활용하여 (단일의 인증 마스터 키를 사용하여) 각각의 AI 모듈 을 인증하면, 적용된 AI가 의료 디바이스의 안전 및 유효 상태를 지배하는 것을 방지하며, 이는 중요한 요구 조 건이다. AI의 강력한 피쳐(적응적 최적화: 기능상의, 동작상의, 및 사용자 경험 등)는, 의료 디바이스에 내장 된 AI 피쳐가 FDA 준수 검증 상태와 일치하는 안전 및 유효 상태를 유지하는 동안에 사용될 수 있다."}
{"patent_id": "10-2021-7023059", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 설명되는 시스템은, 동작 모듈이 인증된 상태로부터 받아들여지지 못할 정도로 벗어나지 않도록 인공 지능에 의해 제공되는 동작 모듈의 적응적 최적화를 제한하는 메커니즘을 제공한다. 제어 모듈은 동작 모 듈이 적응하고 변경함에 따라 동작 모듈에 제한을 가한다. 제한은 디지털 서명된 암호화 일-방향 해시를 사용 하여 부인(repudiation)을 방지하는 방식으로 제어 모듈에 제공된다. 유사하게, 상태 정보 및 상태 제어 정보 가 디지털 서명된 암호화 일-방향 해시를 사용하여 부인을 방지하는 방식으로 제어 모듈과 동작 모듈 사이에서 교환된다. 또한, 동작 모듈에 대한 상태 데이터는 부인을 방지하기 위해 그의 디지털 서명된 일-방향 해시와 함께 안전하게 저장될 수 있다. 일-방향 해시는 SHA256 해시 알고리즘을 사용할 수 있다. 도 1은, 부분적으로 혈액 회로를 형성하는 1회용 혈액 성분 세트에 연결된 혈액투석 기계를 포함하는 혈액투석 시스템의 사시도를 나타낸다. 혈액투석 치료 동안에, 운용자가 혈액 성분 세트의 동맥 및 정맥 환자 라인(106, 108)을 환자에게 연결한다. 혈액 성분 세트는 공기 방출 디바이스를 포함하며, 이는 공기는 허용하지만 액체는 통과시키지 않는 셀프-밀봉 벤트 조립체를 포함한다. 결과적으로, 치료 동안에 혈액 회로를 통과하는 혈액이 공기를 포함하는 경우, 공기 방출 디바이스는 공기를 대기로 배출할 것이다. 혈액 성분 세트는 혈액투석 기계의 전면에 부착된 모듈에 고정된다. 모듈은 혈액 회로를 통해 혈액을 순환시킬 수 있는 혈액 펌프를 포함한다. 모듈은 또한, 혈액 회로를 통해 흐르는 혈액 을 모니터링할 수 있는 다양한 다른 기구를 포함한다. 모듈은, 닫혔을 때 도 1에 도시된 바와 같이, 모듈 의 전면과 협동하여 혈액 성분 세트를 수용하도록 사이즈가 정해지고 성형된 구획을 형성하는 도어를 포함한다. 닫힌 위치에서, 도어는 모듈의 전면에 노출된 대응하는 기구에 대해 혈액 성분 세트의 특 정 혈액 성분을 압박한다. 작업자는 혈액 펌프 모듈을 사용하여 혈액 펌프를 작동시킨다. 혈액 펌프 모듈은 디스플레이 창(window), 시작/정지 키, 업(up) 키, 다운(down) 키, 레벨 조정 키 및 동맥압 포트를 포함할 수 있다. 디스 플레이 창은 혈액 펌프 작동 중 혈액 유동 레이트 설정을 표시한다. 시작/정지 키는 혈액 펌프를 시작 및 정지시킨다. 업 및 다운 키는 혈액 펌프의 속도를 증가 및 감소시킨다. 레벨 조정 키는 동맥 드립(drip) 챔버에서의 유체의 레벨을 높인다. 컨트롤은 물리적 버튼/스위치/액추에이터 등으로서 존재할 수 있거나, 또는 터치 스크린 액세스가능 디스플레이 상의 그래픽 사용자 인터페이스 내에 전체적으로 존재할 수 있거나 또 는 그들의 어떤 조합일 수 있다. 혈액투석 기계는 투석기, 다양한 다른 투석액 성분, 및 혈액투석 기계에 연결된 투석액 라인에 의해 형성되는 투석액 회로를 더 포함한다. 이들 투석액 성분 및 투석액 라인의 다수는 혈액투석 기계의 하우징 내부에 있고 따라서 도 1에서는 보이지 않는다. 치료 동안에, 혈액 펌프가 혈액 회로를 통해 혈액을 순환시키는 동안, 투석액 펌프(도시되지 않음)는 투석액 회로를 통해 투석액을 순환시킨다. 투석액 컨테이너는 투석액 공급 라인을 거쳐 혈액투석 기계에 연결된다. 드레인 라인 및 한외여과(ultrafiltration) 라인도 혈액투석 기계로부터 연장한다. 투석액 공급 라인, 드레인 라인, 및 한외여과 라인은, 투석액 회로의 일부를 형성하는 혈액투석 기계의 하우징 내부 의 다양한 투석액 성분 및 투석액 라인에 유체 연통된다. 혈액투석 동안에, 투석액 공급 라인은 투석액 컨테이너로부터 혈액투석 기계 내부에 위치된 투석액 회로의 부분으로 신선한 투석액을 운반한다. 위에 언급된 바와 같이, 신선한 투석액은 투석액 회로를 형성하는, 투석기를 포함한 다양한 투석액 라인및 투석액 성분을 통해 순환된다. 후술하는 바와 같이, 투석액이 투석기를 통과할 때, 투석액은 환자의 혈액으로부터 독소를 수집한다. 결과적으로 사용된 투석액은 투석액 회로로부터 드레인 라인을 거쳐 드레 인으로 운반된다. 한외여과가 치료 동안에 수행될 때, 환자로부터 인출된 과잉 유체 및 사용된 투석액(아래에 서 설명됨)의 조합이 한외여과 라인을 거쳐 드레인으로 운반된다. 투석기는 환자의 혈액에 대한 필터로서 역할을 한다. 투석액은 전술한 바와 같이 혈액과 함께 투석기 를 통과한다. 투석기 내의 반투과성 구조(예컨대, 반투과막 및/또는 반투과성 마이크로튜브)는 투석 기를 통과하는 혈액과 투석액을 분리한다. 이러한 배열은 투석액이 환자의 혈액으로부터 독소를 수집하는 것을 허용한다. 투석기를 빠져나가는 여과된 혈액은 환자에게 반환된다. 투석기를 빠져나가는 투석 액은 혈액으로부터 제거된 독소를 포함하며 일반적으로 \"사용된 투석액\"이라 지칭된다. 사용된 투석액은 투석 기로부터 드레인으로 라우팅된다(routed). 또한, 약물 펌프가 혈액투석 기계의 전면으로부터 연장된다. 약물 펌프는 혈액 성분 세트(10 4)의 주사기(syringe)를 유지하도록 구성된 클램핑 메커니즘을 포함하는 주사기 펌프이다. 약물 펌프 는 또한, 주사기의 축을 따라 주사기의 플런저를 이동시키도록 구성된 스텝퍼 모터를 포함한다. 스텝퍼 모터의 샤프트는, 스텝퍼 모터가 제1 방향으로 작동될 때 샤프트가 플런저를 주사기 안으로 밀어넣고, 제2 방향으로 작동될 때 샤프트가 플런저를 주사기 밖으로 잡아당기는 방식으로 플런저에 고정된다. 따라 서 약물 펌프는, 사용 중에 약물 전달 라인을 거쳐 주사기로부터 액체 약물(예컨대, 헤파린)을 혈액 회로에 주입하거나, 또는 사용 중에 약물 전달 라인을 거쳐 혈액 회로로부터 주사기 내로 액체 를 끌어들이는 데 사용될 수 있다. 혈액투석 기계는 디스플레이, 제어 패널 및 통신 모듈(예컨대, 근거리 무선 통신(NFC) 송 수신기, 센서 또는 카메라)로부터 신호를 수신하고 그리고 이들로 신호를 전송하도록 구성된 제어 유닛(예 컨대, 프로세서)를 포함한다. 제어 유닛은 또한, 서버(예컨대, 인터넷 서버), 다른 투석 시스템, 또는 다 른 네트워크 리소스와 통신할 수 있다. 다양한 예에서, 서버와의 통신은, 통신 네트워크를 통한 무선 통신을 거쳐서, 서버에의 유선 이더넷 연결을 거쳐서, 및/또는 USB 드라이브를 사용하는 것과 같이 서버와 투석 시스템 사이의 컴퓨터 판독가능 매체의 물리적 전송을 거쳐서 이루어질 수 있다. 제어 유닛은 디스플레이 , 제어 패널 및 통신 모듈에 의해 수신되는 신호에 적어도 부분적으로 기초하여 혈액투석 기계 의 동작 파라미터를 제어한다. 디스플레이는 환자의 활력 징후, 투석 치료의 동작 파라미터 및 혈액투석 프로세스와 연관된 제어를 포함 할 수 있는 사용자 인터페이스를 제공한다. 예를 들어, 동작 파라미터는 한외여과 파라미터, 혈액 펌프 속도 및 투석액과 관련된 정보, 헤마토크릿(hematocrit) 경고 레벨, 혈압 경보 한계, 약물 주입 파라미터 등을 포함 할 수 있다. 디스플레이는, 운용자가 상호작용하고 혈액투석 기계를 제어할 수 있는 터치 스크린을 포함할 수 있다. 예를 들어, 운용자는 혈액투석 프로세스와 연관된 다양한 치료 파라미터를 입력할 수 있다. 통신 모듈은 근거리 무선 디바이스, 예컨대, ID 카드, 스마트 카드, 또는 운용자나 환자의 스마트폰 과 같은 디바이스가 그의 무선 통신 범위 내에 있을 때 이를 감지하고 이와 통신하도록 구성된다. 통신 모듈 과 ID 카드 사이의 통신은, 근거리 무선 기술 프로토콜, 예컨대 NFC 프로토콜과 같은 RFID 프로토콜 또는 블루투스 프로토콜에 의해 촉진된다. ID 카드는 투석 기계의 운용자나 환자와 연관되기 때문에, 통신 모듈은 운용자 또는 환자의 신원과 연관되는 정보를 검출한다. 통신 모듈은 운용자 또 는 환자와 연관된 정보를 제어 유닛에 통신한다. 이에 응답하여 제어 유닛은, 예를 들어 본원에 참 조로 포함된 미국 공개특허출원 제2017/0168688호에 기재된 바와 같이, 혈액투석 기계가 동작을 수행하도 록 할 수 있다. 유사하게, ID 카드가 통신 모듈의 무선 통신 범위를 벗어났을 때는(예컨대, ID 카드 가 통신 모듈의 무선 통신 범위에 있는 것으로부터 통신 모듈의 무선 통신 범위를 벗어나는 경 우), 통신 모듈은 운용자 또는 환자가 더 이상 존재하지 않음을 나타내는 신호를 제어 유닛으로 전송 할 수 있다. 이에 응답하여 제어 유닛은, 혈액투석 기계가 동작을 수행하도록 할 수 있다. 또한 통신 모듈은, 예컨대, 얼굴 인식, 손바닥/지문 및 홍채 인식을 포함할 수 있는 생체 인증 프로세스를 통해 운용자 또는 환자의 신원과 연관된 정보를 검출할 수 있다. 통신 모듈은, 사용자의 얼굴, 손가락/손바닥 또는 눈을 촬영하고, 상기 이미지와 연관된 정보를 이용하여 사용자를 식별할 수 있는 센서(예컨대, 카메라)를 포함할 수 있다. 이는 상기 이미지와 연관된 정보를 데이터베이스의 프로파일 정보와 비교하여 달성할 수 있다. 다른 대안으로서, ID 카드는 스마트폰, 태블릿 등과 같은 디바이스에서의 앱(또는 유사의 것)으로 서 구현될 수 있으며, 통신 모듈은 앱으로부터의 식별 정보 및/또는 디바이스에 의해 직접(즉, 스마트폰의운영 체제를 거쳐) 제공되는 식별 정보에 기초하여 특정 운용자 또는 환자의 존재를 검출할 수 있다. 제어 유닛은 통신 모듈로부터 운용자 또는 환자의 신원과 연관된 정보를 수신하고 그 정보를 데이터 베이스에 저장된 다수의 사용자(운용자 및/또는 환자)에 대한 인터페이스 구성 프로파일(interface configuration profile)과 비교한다. 데이터베이스는 투석 시스템과 연관된 저장 디바이스에 저장되거나 또는 외부 저장 디바이스(예컨대, 다른 투석 시스템과 연관된 저장 디바이스 또는 서버)에 위치될 수 있다. 이 비교에 기초하여, 제어 유닛은 운용자 또는 환자의 인터페이스 구성 프로파일을 검색(retrieve)할 수 있다. 디스플레이에 나타나는 특정 사용자 인터페이스는 상기 검색된 인터페이스 구성 프로파일에 기초할 수 있다. 예를 들어, 사용자 인터페이스를 구성하는 동작 파라미터 및 투석 제어는 검색된 인터페이스 구성 프로 파일로부터 결정될 수 있다. 또한, 운용자 또는 환자의 신원, 및 운용자의 감독자의 신원도 표시될 수 있다. 제어 유닛은, 운용자 또는 환자의 신원과 연관된 정보 및/또는 투석 기계의 동작 파라미터를 저장 디 바이스 또는 모바일 디바이스에 통신할 수 있다. 예를 들어, 제어 유닛은 운용자 또는 환자의 신원을 감 독자에게 통신할 수 있다. 제어 유닛은 운용자와 연관된 인터페이스 구성 프로파일로부터 감독자를 식별 할 수 있다. 감독자에 대한 통신은 문자 메시지, 이메일, 소셜 미디어 유형 게시물, 또는 감독자와 연관된 모 바일 디바이스에의 음성메일 형태일 수 있다. 대안적으로 또는 추가적으로, 운용자 또는 환자의 신원과 연관된 정보는 데이터베이스에 저장될 수 있다. 운용자 또는 환자의 신원과 동작 파라미터를 저장하거나 통신하는 것 은 투석 프로세스의 추적을 허용할 수 있다. 예를 들어, 운용자가 투석 절차를 올바르게 수행하지 않으면 감독 자가 개입할 수 있다. 다른 예에서, 권한이 없는 사용자가 시스템을 사용하려고 한다면, 감독자가 권한이 없는 사용자가 변경한 사항을 취소할 수 있다. 제어 유닛은 인터페이스 구성 프로파일을 추가 또는 수정하도록 구성될 수 있다. 운용자 또는 환자는, 당 해 운용자 또는 환자와 연관된 근거리 무선 디바이스, 예를 들어 ID 카드 또는 스마트폰을 등록하고 원하 는 인터페이스 구성 프로파일을 입력할 수 있다. 이는 디스플레이 상의 터치 스크린, 제어 패널 또 는 투석 시스템의 일부가 아닌 키오스크를 통해 이루어질 수 있다. 제어 유닛은 혈액투석 시스템에서의 알람을 검출하고, 상기 알람에 기초하여 디스플레이에 나타 나는 사용자 인터페이스를 변경하도록 구성될 수 있다. 동작 파라미터의 값이 기준을 충족하면 알람이 발생할 수 있다. 예를 들어 투석액의 전도도가 특정 값 이상일 때 알람이 발생할 수 있다. 이는 간호사로부터의 즉각 적인 주의를 요구할 수 있으며, 따라서 디스플레이 상에 나타나는 사용자 인터페이스는 간호사에 의해 예 상되는 형태 및/또는 간호사에게 친숙한 형태로 변경될 수 있다. 도 2는 카트에 안착된 PD 사이클러(PD 기계라고도 지칭됨)를 포함하는 복막 투석(PD) 시스템의 사시도를 나타낸다. PD 사이클러는 하우징, 도어, 및 카세트가 카세트 인터페이스와 닫힌 도어 사이에 형성된 카세트 구획 내에 배치될 때 일회용 PD 카세트와 접촉하는 카세트 인터페이스(도 시되지 않음)를 포함한다. 히터 트레이는 하우징의 상부에 위치된다. 히터 트레이는 투석액의 백(예컨대, 투석액의 5리터 백)을 수용하도록 사이즈 결정되고 성형된다. 또한 PD 사이클러는, 디스플레 이 및 예를 들어 PD 치료의 셋업, 개시 및/또는 종료를 허용하도록 사용자(예컨대, 환자)에 의해 작동될 수 있는 추가 제어 패널을 포함한다. 투석액 백은 카트 측면의 핑거(finger)에 매달려 있고, 히터 백은 히터 트레이에 위치된다. 투석액 백 및 히터 백은 각각 투석액 백 라인 및 히터 백 라인을 거쳐 카세트 에 연결된다. 투석액 백 라인은 사용 중에 투석액 백으로부터 카세트로 투석액을 통과시 키는 데 사용될 수 있고, 히터 백 라인은 사용 중에 카세트와 히터 백 사이에서 투석액을 앞뒤 로 통과시키는 데 사용될 수 있다. 또한, 카세트에는 환자 라인과 드레인 라인이 연결된다. 환자 라인은 카테터를 거쳐 환자의 복부에 연결될 수 있고 사용 중에 카세트와 환자의 복강 사이에서 투석액을 앞뒤로 통과시키는 데 사용될 수 있다. 드레인 라인은, 드레인 또는 드레인 리셉터클(drain receptacle)에 연결될 수 있고 사용 중에 카세트로부터 드레인 또는 드레인 리셉터클로 투석액을 통과시키 는 데 사용될 수 있다. 투석액을 통과하는 다양한 구성요소는 투석액 회로를 형성한다. PD 시스템은, 혈액투석 시스템과 같이, 제어 유닛, 디스플레이 및 통신 모듈을 포함 한다. 상기 제어 유닛, 디스플레이 및 통신 모듈들은 서로 통신하고 근거리 무선 디바이스(예컨 대, ID 카드 또는 스마트폰)와 통신한다. 혈액투석 시스템과 유사하게, PD 시스템은 제어 유닛 및 통신 모듈과 같은 구성요소를 사용하여 운용자 또는 환자의 신원과 연관된 정보를 검출하고, 디 스플레이 상에 나타나는 사용자 인터페이스를 인터페이스 구성 프로파일에 기초하여 변경할 수 있다. PD시스템은 운용자 또는 환자가 PD 시스템과 연관된 저장 디바이스 또는 외부 저장 디바이스(예컨대, 서버)에 저장될 수 있는 인터페이스 구성 프로파일을 추가하거나 수정할 수 있게 허용한다. 또한, PD 시스템 의 제어 유닛은 PD 시스템의 알람에 기초하여 디스플레이 상에 나타나는 사용자 인터페이 스를 변경할 수 있다. 도 3은 복수의 투석 시스템(305a-305d) 및 중앙 서버를 포함하는 설비의 일례를 나타낸다. 투석 시 스템(305a-305d)은 서로 통신할 수 있고 그리고 중앙 서버와 통신할 수 있다. 하나의 구현에서, 인터페이 스 구성 프로파일의 데이터베이스는 중앙 서버에 저장될 수 있다. 투석 시스템, 예를 들어 투석 시스템 (305a)이 특정 운용자 또는 환자를 검출하면, 투석 시스템(305a)은 서버에 저장된 데이터베이스로부터 운용자 또는 환자와 연관된 인터페이스 구성 프로파일을 검색할 수 있다. 또한 투석 시스템(305a)은, 서버에 저장된 데이터베이스의 인터페이스 구성 프로파일을 추가하거나 변경할 수 있다. 제1 투석 시스템(예컨대, 시스템 (305a))에 대해 작업하고 있던 운용자가 다른 투석 시스템(예컨대, 시스템(305b))에 의해 검출되는 경우, 제2 투석 시스템의 디스플레이의 사용자 인터페이스는, 운용자의 인터페이스 구성 프로파일에 기초하여 재구성될 수 있다. 또한, 운용자는 제1 투석 시스템에서 로그아웃 될 수 있다. 투석 시스템이 특정 운용자 또는 환자를 검 출하면, 운용자 또는 환자의 신원과 연관된 정보는 외부 디바이스, 예를 들어 휴대 전화 또는 중앙 서버 또는 양쪽 모두로 전송될 수 있다. 또한, 투석 시스템의 동작 파라미터 및 제어와 연관된 데이터가 외부 디바이스나 중앙 서버 또는 양쪽 모두로 전송될 수도 있다. 운용자 또는 환자의 식별에 기초하여 디스플레이를 수정하고 동작 파라미터를 초기화하는 것 이외에, 본 명세서 에서 설명되는 시스템은 그에 제공된 입력 데이터에 기초하여 투석 시스템(100, 200)의 모듈의 동작을 지능적으 로 적응시킬 수 있다. 적응될 수 있는 동작 파라미터는 디스플레이(118, 218)뿐만 아니라 투석액 및/또는 혈액 흐름 모터(들)의 레이트(rate), 히터 트레이의 온도, 데이터 샘플링 레이트, 경보 한계 등을 포함한다. 동작 파라미터를 적응시키는 데 사용되는 입력 데이터는 투석액 유동 레이트, 혈액 흐름 레이트(혈액투석 시스 템의 경우), 막횡단 압력, 유체 투명도(PD 시스템의 경우), 유체 온도, 유체 전도도, 공기 검출, 혈 액 02 레벨(혈액투석 시스템의 경우), 나트륨 함량, 및 환자 혈압, 환자 온도, 기타 환자 파라미터와 같은 환자 정보를 포함하고, 그리고 가능하게는 디스플레이(118, 218) 중 하나에서 응답될 수 있는 환자/운용자 질문 에 대한 응답을 포함한다. 입력 데이터 수집의 적어도 일부는 자동화될 수 있고(예컨대, 유체 유동 레이트), 다른 데이터는 사용자(운용자 또는 환자)에 의해 수동으로 입력될 수 있다. 도 4를 참조하면, 센서 조립체는 그 양 단부에서 위에서 논의된 라인(106, 108, 230) 중 하나와 같은 환자 라인에 연결된 유동 튜브를 포함한다(도 4에는 도시되지 않음). 환자로부터의 혈액(혈액투석기의 경 우) 또는 IB 투석액 유체(PD 기계의 경우)는 유동 튜브를 통과하여 환자에게 들어가고/들어가거나 환 자로부터 나온다. 센서 조립체는 투명도 센서, IR 온도 센서, 전도도 센서, 유량 센서 , 접촉 온도 센서, 공기 검출기 및 압력 센서를 포함한다. 투명도 센서는 유동 튜브 를 통과하는 환자로부터의 유체의 탁도를 측정한다. IR 온도 센서는 IR 광 및 센서에 근접한 유동 튜브의 일부에 배치된 IR 투과성 창(도시되지 않음)을 사용하여 유동 튜브를 통과하는 유체의 온도를 측정한다. 전도도 센서는 유동 튜브를 통과하는 유체의 전기 전도도를 측정하며, 이는 PD 사 이클러로부터 환자에게 전달되는 투석액 유체의 염의 농도와 같은 유체의 화학적 조성의 유용한 표시일 수 있다. 접촉 온도 센서는 예를 들어 종래의 온도 접촉 센서를 사용하여 유동 튜브를 통과하는 유체의 온도를 측정할 수 있으며 가능하게는 유동 튜브의 대응하는 부분에 높은 열 전도성 재료를 가질 수 있다. 유량 센서는 유동 튜브를 통과하는 유체의 유동 레이트를 측정한다. 센서 조립체는 임의의 적 절한 유선 또는 무선 메커니즘을 사용하여 전력을 받아들일 수 있다. 일부 실시형태에서, 투석 시스템(100, 200)은 센서(404-410)에 커플링된 배선(도시되지 않음)을 사용하여 하나 이상의 센서(404-410)와 통신할 수 있다. 배선은 하나 이상의 센서(404-410)를 투석 시스템(100, 200)에 직접 연결할 수 있다. 대안적으로, 배선은 가능하게는 네트워크를 거쳐 투석 시스템(100, 200)에 다중 연결 (multiplexed connection)을 제공하는 유선 통신 모듈(도시되지 않음)에 연결될 수 있다. 여전히 대안적으로, 센서 조립체는 각각의 센서(404-410)와 투석 시스템(100, 200) 사이에 무선 통신을 제공하는 무선 통신 디 바이스를 포함할 수 있다. 무선 통신 디바이스 및 투석 시스템(100, 200) 양쪽 모두와 통신하는 네 트워크에 연결하기 위한 보안 인터넷 게이트웨이를 통한 연결을 포함하는 임의의 적절한 무선 통신 프로토콜이 사용될 수 있다. 로컬 및 외부 양쪽 모두에서 구성요소 간의 연결, 네트워크 및 데이터 전송은 제어될 수 있고 및/또는 다르게는 적절한 네트워크 인프라로 이러한 기능을 용이하게 하는 시스템에 통합될 수 있으며, 이는 일 부 구현에서 커넥티드 헬스 시스템(connected health system)이라고 지칭될 수 있다. 커넥티드 헬스 시스템에서와 같이 의료 디바이스를 안전하게 연결, 페어링 및/또는 모니터링하기 위한 시스템에 대한 추가 설명을 위해, 타넨바움(Tanenbaum) 외의 \"의료 디바이스를 위한 원격 모니터링 인터페이스 디바이스 및 모바일 애플리 케이션(Remote Monitoring Interface Device and Mobile Application for Medical Devices)\"이라는 발명의 명 칭의 미국 특허출원 제2016/0206800호 공보, 아리자(Arrizza)의 \"근거리 무선 통신을 사용한 투석 액세서리들 연관(Associating Dialysis Accessories Using Near Field Communication)\"이라는 발명의 명칭의 미국 특허 제 9800663호 공보, 메디나(Medina) 외의 \"투석 시스템을 위한 근거리 무선 통신(Short-Range Wireless Communication for a Dialysis System)\"이라는 발명의 명칭의 미국 특허출원 제2017/0087290호 공보, 모이슬 (Moissl) 외의 \"임상 데이터의 통신을 위한 보안 네트워크-기반 시스템(Secure Network-Based System for Communication of Clinical Data)\"이라는 발명의 명칭의 미국 특허출원 제2017/0076069호 공보, 및 왕(Wang) 외의 \"투석 기계의 원격 제어(Remote Control of Dialysis Machines)\"라는 발명의 명칭의 미국 특허 제9178891 호 공보를 참조하며, 이들 모두의 개시내용은 여기에 참조에 의해 포함된다. 도 5를 참조하면, 블록도는 제어 유닛 또는 제어 유닛을 구현하는데 사용될 수 있는 컴퓨터 시스템 을 보여준다. 시스템은 프로세서, 메모리, 저장 디바이스, 및 입/출력 인터페이스 를 포함한다. 구성요소(510, 520, 530, 540) 각각은, 예컨대 시스템 버스를 사용하여 상호 연결될 수 있다. 프로세서는 시스템 내에서 실행하기 위한 명령을 처리할 수 있다. 프로세서는 싱글- 쓰레드 프로세서, 멀티-쓰레드 프로세서 또는 양자 컴퓨터일 수 있다. 프로세서는 메모리 및/또는 저장 디바이스에 저장된 명령을 처리할 수 있다. 프로세서는, 센서 조립체로부터 신호를 수신 하고, 신호에 기초한 데이터를 저장된 데이터, 예컨대 온도 값의 룩업(look-up) 테이블에 저장된 데이터와 비교 하고, 그리고 본 명세서의 다른 곳에서 보다 상세히 설명되는 바와 같이, 입력 데이터에 기초하여 투석 시스템 (100, 200)의 모듈의 동작을 적응시키는 것과 같은 동작을 실행할 수 있다. 일부 실시형태에서, 컴퓨터 시스템 의 일부 또는 모든 구성요소는 SPGA(sealed programmable gate array)를 사용하여 구현될 수 있다. 메모리는 시스템 내의 정보를 저장한다. 일부 구현에서, 메모리는 컴퓨터 판독가능 매체이다. 메모리는, 예를 들면, 휘발성 메모리 유닛 또는 비휘발성 메모리 유닛일 수 있다. 저장 디바이스는 시스템을 위한 대용량 저장 디바이스를 제공할 수 있다. 일부 구현에서, 저장 디바이스는 비일시적 컴퓨터 판독가능 매체이다. 저장 디바이스는, 예를 들어, 하드 디스크 디바이스, 광 디스크 디바이스, 솔 리드-데이트(solid-date) 드라이브, 플래시 드라이브, 자기 테이프, 또는 어떤 다른 대용량 저장 디바이스를 포 함할 수 있다. 저장 디바이스는 대안적으로 클라우드 저장 디바이스, 예컨대 네트워크에 분산되고 네트워 크를 사용하여 액세스되는 다수의 물리적 저장 디바이스를 포함하는 논리적 저장 디바이스일 수 있다. 입/출력 인터페이스는 시스템에 대한 입/출력 동작을 제공한다. 일부 구현에서, 입/출력 인터페이스 는 하나 이상의 네트워크 인터페이스 디바이스(예컨대, 이더넷 카드), 시리얼 통신 디바이스(예를 들어, RS-232 I/O 포트) 및/또는 무선 인터페이스 디바이스(예를 들어, 802.11 카드, 3G 무선 모뎀 또는 4G 무선 모뎀)를 포함한다. 일부 구현에서, 입/출력 디바이스는 입력 데이터를 수신하고 출력 데이터를 다른 입/출력 디바이스들, 예컨대 키보드, 프린터 및 디스플레이 디바이스(118/218), 센서 유닛 등으로 보내도록 구성된 드라이버 디바이스를 포함한다. 일부 구현에서, 모바일 컴퓨팅 디바이스, 모바일 통신 디바이스 및 기타 디바 이스가 사용된다. 일부 구현에서, 입/출력 인터페이스는 적어도 하나의 아날로그-디지털 변환기를 포함한다. 아날로그 -디지털 변환기는 아날로그 신호를 디지털 신호로, 예컨대 프로세서에 의한 처리에 적합한 디지털 신호로 변환한다. 일부 구현에서, 하나 이상의 감지 요소(예를 들어, 도 1에 도시된 통신 모듈 또는 도 2에 도시 된 통신 모듈 또는 센서 유닛)는 아날로그-디지털 변환기와 통신한다. 일부 구현에서, 시스템 은 마이크로 컨트롤러(microcontroller)이다. 마이크로 컨트롤러는 단일 전자 패키지에 컴퓨터 시스템의 다수의 요소를 포함하는 디바이스이다. 예를 들어, 단일 전자 패키지는 프로세서, 메모리, 저장 디 바이스 및 입/출력 인터페이스를 포함할 수 있다. 본 명세서에서 설명되는 시스템은 인공 지능을 이용하여 투석 시스템(100, 200)의 모듈이 입력(피드백)에 기초 하여 그의 동작을 적응시키도록 허용한다. 예를 들어, 시스템은 혈액 및 투석액 유동 레이트를 변경하고 각 반 복에서 결과적인 확산 클리어런스를 측정함으로써 효율적으로 투석기(dialyzer) 전달을 최적화하는 데 사용될 수 있다. 신경망과 같은 임의의 적절한 인공 지능 메커니즘이 사용될 수 있다. 도 6을 참조하면, 흐름도는 인공 지능을 이용하여 적응하는 모듈과 관련하여 수행되는 단계를 예시한다. 흐름도에 의해 예시된 처리는, 본 명세서의 다른 곳에서 설명되는 컴퓨터 시스템에 의해, 또는 시스템(100, 200) 중 하나에 내부적으로 또는 그에 외부적으로 제공되는 다른 처리 시스템(도시하지 않음)에 의해 수행될 수 있다. 게다가, 흐름도에 의해 예시된 처리에 의해 제공되는 적응적 최적화는 환자 당 기준, 운 용자 당 기준, 전체 디바이스에 대해, 또는 임의의 다른 적절한 그룹핑에 대해 제공될 수 있다. 즉, 흐름도 에 의해 예시된 적응 처리는, 적응적 최적화가 각 환자에 대해 개별화되도록 각각의 환자에 대해, 적응적 최적화가 각 운용자에 대해 개별화되도록 각각의 운용자에 대해, 적응적 최적화가 전체 디바이스에 대해 제공되 도록 전체 디바이스에 대해 수행될 수 있으며 따라서 각 환자 및 각 운용자, 또는 기타 다른 적절한 그룹핑에 동등하게 적용된다. 적응될 수 있는 시스템의 동작 모듈은 시스템과의 운용자 사용자 인터페이스 상호작용, 최 적화 자동 교정 기능, 자동 시스템 소음 감소 및 보상(전기적 및 기계적), 데이터 전송 최적화, 투석 및 전환의 총 시간 최적화, 하드웨어 및 소프트웨어 모니터링, 하우스키핑, 오류 모니터링, 및 관련 대응 관리, 진단, 현 장 서비스 대응 최적화 등을 포함한다. 일반적으로, 시스템의 임의의 동작 양상이 인공 지능을 이용하여 적응 될 수 있다. 흐름도에 대한 처리는 시스템이 초기 상태로 설정되는 제1 단계에서 시작된다. 초기 상태는 제조 시 에 결정될 수 있거나 다르게는 (본 명세서의 다른 부분에서 보다 상세히 논의되는) 감독자 모듈 또는 어떤 다른 외부 소스에 의해 시스템에 입력될 수 있다. 예를 들어, 초기 상태는 혈액 유동 레이트에 대한 초기 값 및 투 석액 유동 레이트에 대한 초기 값을 포함할 수 있다. 일부 경우에, 초기 상태는 특정 운용자 및/또는 환자를 기반으로 할 수 있으며, 이는 본 명세서의 다른 부분에서 설명되는 바와 같이 자동으로 검출될 수 있다. 단계 다음으로는, 입력이 시스템에 제공되는 단계가 있다. 본 명세서의 다른 부분에서 논의되는 바와 같 이, 인공 지능에 의해 적응되는 각각의 동작 모듈은 적응적 최적화를 수행하는 인공 지능 동작에 대한 적절한 데이터 입력을 수신한다. 예를 들어, 사용자 인터페이스 상호작용을 적응시키는 인공 지능의 경우, 다른 사용 자 인터페이스 옵션이 제공될 때 운용자 응답/선택을 나타내는 데이터를 입력으로서 수신할 수 있다. 다른 예 로서, 투석기 전달을 효율적으로 최적화하는 인공 지능은 투석기 요소 제거율을 입력으로서 수신할 수 있다. 단계 다음으로는, 시스템이 인공 지능을 이용하여 수신된 입력 데이터에 따라 동작 파라미터를 적응시키는 단계가 있다. 일반적으로, 일어나는 특정 적응적 최적화는 입력 데이터, 사용되는 인공 지능 메커니즘(예 컨대, 신경망) 및 인공 지능 적응적 최적화의 특정 목표(예컨대, 투석기 전달을 효율적으로 최적화함)에 의존한 다. 단계 다음으로는, 단계에서 적응적 최적화가 적용된 후 모듈의 상태가 받아들여질 수 있는지가 결정되는 테스트 단계가 있다. 인공 지능을 사용한 적응적 최적화가 유용할 수 있지만, 적응적 최적화가 환자에게 잠재적으로 안전하지 않거나 해로운 방식으로 시스템이 동작하도록 하지 않는 것이 중요하다. 이는 본 명세서의 다른 곳에서 보다 상세히 논의되는 감독자 모듈에 의해 시행된다. 모듈의 새로운 상태가 받아들여질 수 없는 것으로 단계에서 결정되면, 제어는 테스트 단계로부터 모 듈의 상태가 이전의 상태로 복원/복귀되는 단계로 이동한다. 이전의 상태는, 초기 상태(즉, 위에서 설명 된 단계에서 설정된 상태), 단계의 실행 직전의 모듈의 상태, 또는 받아들여질 수 있는 어떤 다른 상 태일 수 있다. 이전의 상태는 본래의 검증된 상태일 수 있다. 단계에 이어서, 제어는 또 다른 반복을 위 해 단계로 다시 이동한다. 단계는 또한, 단계에서 동작 모듈의 상태가 받아들여질 수 있는 것으로 결정되면 단계로부터 직접 이어진다는 점에 유의한다. 도 7을 참조하면, 다이어그램은 팩토리 모듈, 감독자 모듈 및 복수의 동작 모듈(706-708) 사이 의 관계를 예시한다. 감독자 모듈 및 동작 모듈(706-708)은 혈액투석 시스템 또는 PD 시스템과 같은 투석 시스템에 제공되는 반면, 팩토리 모듈은 투석 시스템의 외부에 있으며 투석 시스템의 제조 시점 에 제공될 수 있거나 투석 시스템의 유지보수와 관련하여 제공될 수 있다. 본 명세서의 다른 부분에서 보다 상 세히 설명되는 바와 같이, 팩토리 모듈은 확고하고 부인할 수 없는 방식으로 감독자 모듈에 한정/제 한을 제공하고 감독자 모듈은 각각의 동작 모듈(706-708)에 적응적 최적화/상태 변경에 대한 한정/제한을 확고하고 부인할 수 없는 방식으로 제공하기 위해 사용된다. 본 명세서의 다른 부분에서 논의되는 바와 같이, 동작 모듈(706-708)은, 시스템과의 운용자 사용자 인터페이스 상호작용, 자동 교정 기능, 자동 시스템 소음 감소 및 보상(전기적 및 기계적), 데이터 전송, 투석 및 전환의 총 시간, 하드웨어 및 소프트웨어 동작, 하우스키핑, 오류 모니터링, 및 관련 대응 관리, 진단, 현장 서비스 대 응 등의 하나 이상을 제어하는 투석 시스템의 하드웨어 및 소프트웨어 부분을 포함할 수 있다. 감독자 모듈 은, 안전하고 효과적인 방식으로 동작하는 것과 일치하며 각 모듈(706-708)에 대한 사전 규제 승인과 일치 하는 상태로 각 동작 모듈(706-708)을 유지하기 위해 인공 지능에 의해 제공되는 동작 모듈(706-708)의 적응적 최적화를 제한한다. 감독자 모듈은 위에서 논의된 단계에서 테스트를 처리하며, 여기서 특정 동작모듈의 상태가 인공 지능을 이용하여 변경된 후에 받아들여질 수 있는지가 결정된다. 본 명세서의 일 실시형태에서, 동작 모듈에 대한 제한 세트는 투석 시스템이 제조될 때(또는 유지보수와 관련하 여 제조 후 일정 시간일 때) 결정될 수 있다. 투석 시스템의 동일한 모델의 상이한 특정 유닛들이, 교정 차이 및/또는 가능하게는 상이한 배치 시나리오로 인해 상이한 제한을 사용할 수 있음에 유의한다. 팩토리 모듈 은 감독자 모듈에 제한 데이터를 제공하고 제한 데이터의 암호화 일-방향 해시를 제공한다. 본 명세 서의 일 실시형태에서, 암호화 일-방향 해시는 SHA256 해시이지만, 임의의 적절한 암호화 일-방향 해시가 사용 될 수 있다. 팩토리 모듈은 또한, 개인/공개 암호화 키 쌍을 가질 수 있고 공개 키를 감독자 모듈에 제공할 수 있다. 본 명세서의 일 실시형태에서, 공개 키는 X.509 PKI 표준 하에 신뢰할 수 있는 기관에 의해 서명된 디지털 인증서에 제공될 수 있다. 그러면 팩토리 모듈은 제한 데이터의 암호화 일-방향 해시의 디 지털 서명을 감독자 모듈에 제공할 수 있다. 이어서 감독자 모듈은 팩토리 모듈의 공개 키를 사용하여 제한 데이터의 디지털 서명된 암호화 일-방향 해시의 소스를 검증할 수 있고, 이어서 일-방향 해시 값 을 사용하여 수신된 제한 데이터를 인증할 수 있다. 이 메커니즘은 개인 키가 팩토리 모듈 외부의 어떤 당사자에게도 공개되지 않았다고 가정할 때, 유일한 가능한 소스가 팩토리 모듈이기 때문에 제한 데이터의 부인을 방지한다. 도 8을 참조하면, 흐름도는 제한 데이터를 감독자 모듈에 제공하는 것과 관련하여 팩토리 모듈에 의 해 수행되는 단계들을 예시한다. 처리는 팩토리 모듈이 제한 데이터를 결정하는 제1 단계에서 시작 한다. 일반적으로 특정 동작 모듈에 부과되는 제한은 특정 모듈에 사용된 초기 값과 안전하고 효과적인 치료를 제공하는 데 필요한 임의의 한정의 결정에 기초하여 결정된다. 제한 중 일부는 임상 경험에 기초하여 경험적으 로 결정될 수 있다. 일부 동작 파라미터의 값이 이전에 받은 규제 승인과 관련하여 특정 동작 모듈에 사용되는 값을 초과할 수 없는 경우, 제한의 일부가 적어도 부분적으로 규제 고려사항을 기반으로 할 수도 있다. 단계 다음으로는, 제한 데이터의 일-방향 해시 값(예컨대, SHA256)이 계산되는 단계가 있다. 단계 다음으로는, 팩토리 모듈이 일-방향 해시 값의 디지털 서명을 제공하는 단계가 있다. 단계 다음으로는, 팩토리 모듈이 감독자 모듈에 제한 데이터, 제한 데이터의 일-방향 해시 값, 및 제한 데이터의 일-방향 해시 값의 디지털 서명을 제공하는 단계가 있다. 흐름도에 의해 예시되는 처리는 투석 시스템이 처음 제조될 때 또는 투석 시스템이 동작된 후 후속하는 유지보수와 관련하여 수행될 수 있음에 유의한다. 감독자 모듈은 또한, 동작 모듈(706-708)로 데이터의 안전하고 부인할 수 없는 전송에 사용될 수 있는 개 인 키 및 대응하는 공개 키를 가질 수 있다. 팩토리 모듈로부터 감독자 모듈로의 데이터의 전송과 마찬가지로, 감독자 모듈로부터의 데이터는 먼저 (예를 들어 SHA256 일-방향 암호화 해시 메커니즘을 사용 하여) 데이터의 일-방향 보유를 결정하고, 해당 일-방향 해시 값을 디지털 서명한 다음, 상기 데이터, 일-방향 해시 값 및 일-방향 해시 값의 디지털 서명을 전송함으로써 각각의 동작 모듈(706-708)로 전송될 수 있다. 유 사하게, 각각의 동작 모듈(706-708)은 개인 키 및 감독자 모듈로의 안전하고 부인할 수 없는 데이터 전송 을 제공하는 데 사용될 수 있는 대응하는 공개 키를 가질 수 있다. 동작 모듈의 새로운 상태가 받아들여질 수 있는지를 결정하는 것과 관련하여(위에서 논의된 흐름도에서의 테스트 단계) 그리고 모듈의 상태를 복원/복귀시키는 것과 관련하여(위에서 논의된 흐름도에서의 단계) 감독자 모듈과 동작 모듈 (706-708 사이에서 데이터를 전송시키는 것이 본 명세서의 다른 부분에서 보다 상세히 논의된다. 도 9를 참조하면, 흐름도는, 동작 모듈의 새로운 상태가 받아들여질 수 있는지를 결정하고 상기 새로운 상 태가 받아들여질 수 없는 경우 동작 모듈의 상태를 복원/복귀시키는 감독자 모듈과 관련하여 수행되는 처 리를 예시한다. 처리는 감독자 모듈이 테스트 중인 동작 모듈(즉, 동작 모듈(706-708) 중 하나)로부터 새 로운 상태에 대한 상태 데이터를 수신하는 제1 단계에서 시작된다. 본 명세서의 일 실시형태에서, 상태 데이터는 (예를 들어, SHA256을 사용하여) 상태 데이터의 일-방향 해시 값 및 일-방향 해시 값의 디지털 서명과 함께 제공된다. 일-방향 해시 값 및 디지털 서명과 함께 데이터를 제공하면 데이터가 안전하고 신뢰할 수 있게 된다(non-reputable). 일부 실시형태에서, 감독자 모듈은 (보관 목적을 위해) 상태 데이터를 저장할 수 있고 데이터에 대해 일-방향 해시(예컨대, SHA256)를 수행하고 일-방향 해시에 디지털 서명할 수 있다. 데이터 의 부인할 수 없는 스냅샷은 후속하는 진단 또는 특정 동작 상태의 증거로서 유용할 수 있다. 단계 다음으로는, 보안 모듈이 상태 데이터를 검사하고 본 명세서의 다른 부분에서 설명된 바와 같이, 새로운 상태의 동작 파라미터 중 임의의 것이 팩토리 모듈로부터 보안 모듈로 이전에 전송된 제한 데이터의 일부로서 제공된 임의의 제한을 벗어나는지를 결정하는 테스트 단계가 있다. 새로운 동작파라미터 중 어느 것도 제한을 벗어나지 않으면, 제어는 단계로부터 확인이 감독자 모듈로부터 테스 트 중인 동작 모듈로 전송되는 단계로 이동한다. 확인을 수신하는 것은, 동작 모듈이 새로운 상태에서 동 작을 시작하게 한다. 단계에 이어서 처리가 완료된다. 테스트 단계에서 새로운 동작 파라미터 중 적어도 하나가 제한을 벗어나는 것으로 결정되면, 제어는 단계로부터 단계로 이동하며, 여기서 이전 의 상태에 대한 데이터가 동작 모듈로 전송되어 동작 모듈이 이전의 상태로 복귀되도록 한다. 단계에 이 어서 처리가 완료된다. 이전의 상태는 초기 상태, 새로운 상태를 결정하기 직전의 동작 모듈의 상태, 또는 받 아들여질 수 있는 어떤 다른 이전의 상태일 수 있다. 일반적으로, 이전의 상태는 사전 인증된 상태이다. 단계 에 이어서 처리가 완료된다. 도 10을 참조하면, 다이어그램은, 투석 시스템에 입력을 제공하고 투석 시스템으로부터 출력 을 수신하는 환자/간호사/의사에 커플링된 투석 시스템을 나타낸다. 투석 시스템은 또한, 본 명세서의 다른 부분에서 보다 상세히 설명된 바와 같이, 베이스라인 데이터 및 제한을 제공하는 팩토리 승인 테스트 시스템에 커플링될 수 있다. 팩토리 승인 테스트 시스템은 투석 시스템에 간헐적으로 커플 링될 수 있고, 예를 들어 투석 시스템이 제조될 때 및 투석 시스템이 제조일자 이후에 유지 보수될 때 사용될 수 있다는 점에 유의한다. 일부 실시형태에서, 팩토리 승인 테스트 시스템은 환자와 함께 투 석 시스템이 동작하는 동안에 일반적으로 존재하지 않는다. 투석 시스템은 동적 동작 데이터 세트에 데이터를 제공하고 인증 및 감독자 엔진으로부터 데 이터를 수신하는 하나 이상의 인공 지능 기반 최적화 알고리즘을 포함한다. 인증 및 감독 엔진은, 본 명세서의 다른 부분에서 설명되는 바와 같이, 중요한 파라미터를 제한하기 위한 메커니즘을 포함하고, 제어 값 테이블, 보호/준수 집행자, AI 특정 학습 규칙, 및 동적 시스템 베이스라인 데이터의 로딩 및 모니터링을 처 리하기 위한 메커니즘을 포함할 수 있다. 인증 및 감독 엔진은 팩토리 승인 테스트 시스템이 존재 할 때 팩토리 승인 테스트 시스템과 데이터를 교환한다. 인증 및 감독 엔진은 또한, 정적 동작 데 이터 세트로부터 데이터를 수신한다. 정적 동작 데이터 세트는 동적 동작 데이터 세트에 의 해 제공되는 데이터에 대한 정적(고정) 대응물(counterparts)을 포함한다. 본원의 일 실시형태에서, 동적 동작 데이터 세트 및 정적 동작 데이터 세트 양쪽 모두는 시스템 특정 동작 파라미터, 시스템 교정 데이 터, 시스템 구성 데이터, 시스템 알람 한계와 안전 동작 한계, 및 임베디드 프로세서/FPGA 부트 코드에 대한 정 적 및 동적 대응 데이터를 포함한다. 팩토리 승인 테스트 시스템은 인증을 제공하고 정적 동작 데이터 세트로부터 인증 및 감독 엔진으로의 데이터 복사를 용이하게 한다. 인공 지능 기반 최적화 알고리즘은 제1 적응 제어 알고리즘 및 대응하는 제1 적응 보정 알고리즘 과 데이터를 교환하고, 제2 적응 제어 알고리즘 및 대응하는 제2 적응 보정 알고리즘과 데이 터를 교환한다. 예로서, 제1 적응 제어 알고리즘은 유동 레이트의 변화를 나타내는 유동 레이트 파라미 터를 입력(6F)으로서 수신할 수 있고, 제1 적응 보정 알고리즘은 유동 레이트 제어 파라미터를 입력(6P) 으로서 수신할 수 있다. 투석 시스템에서, 다음과 같이 주어진 투석기의 한외여과 계수인 KUF를 최적화(최대화)하는 것이 바람직하다. KUF=V/(T×P) 여기서 V는 투석기의 막을 가로지르는 유체의 양(ml), T는 시간(hour), P는 압력(mmHg)이다. 제1 적응 제어 알 고리즘 및 제1 적응 보정 알고리즘은 공지된 최적화 메커니즘을 포함하는 다수의 가능한 메커니즘 중 임의의 하나를 사용하여 이 최적화를 수행할 수 있다. 그러나, 안전/규제 고려사항을 위해, 인공 지능 기반 최적화 알고리즘 중 대응하는 것은 인증 및 감독 엔진에 의해 제한되어 동작 파라미터가 정적 동작 데이터 세트의 값에서 너무 멀리 벗어나는 것을 방지한다. 유사한 방식으로, 제2 적응 제어 알고리즘 및 대응하는 제2 적응 보정 알고리즘은 투석기 막을 가 로질러 가해지는 유체 압력차와 같은 다른 동작 파라미터를 최적화하는 데 사용될 수 있다는 점에 유의한다. 도 11을 참조하면, 개략도는 본 명세서에서 설명된 시스템의 상이한 구성요소 사이의 흐름을 예시한다. 보다 구체적으로, 다이어그램은 프로세스 흐름에서 AI 모듈과 감독 모듈의 상호작용을 나타내고 모듈이 어떻게 링크되고 연결되며 모듈이 다른 모듈과 어떻게 상호작용하는지를 보여준다. 다이어그램은 또한, 프로세스/동작 변수가 AI 및 감독 모듈과 상호작용하는 방법을 예시한다. 유사한 흐름이 각 AI 구현된 서브 조 립체/모듈에 적용될 수 있음에 유의한다. 예시적인 처리 시스템이 도 5에서 설명되었지만, 위에서 설명된 청구 대상 및 기능적 동작의 구현은 다른 유형 의 디지털 전자 회로로, 또는 본 명세서에 개시된 구조들 및 그들 구조적 등가물을 포함하는 컴퓨터 소프트웨어, 펌웨어 또는 하드웨어로, 또는 그들의 하나 이상의 조합으로 구현될 수 있다. 본 명세서에 설명된 청구 대상의 구현은 하나 이상의 컴퓨터 프로그램 제품, 즉, 처리 시스템에 의해 실행되거나 처리 시스템의 동 작을 제어하기 위해 유형의 프로그램 캐리어, 예를 들어 컴퓨터 판독 가능 매체에 인코딩된 컴퓨터 프로그램 명 령의 하나 이상의 모듈로서 구현될 수 있다. 컴퓨터 판독가능 매체는 기계 판독가능 저장 디바이스, 기계 판독 가능 저장 기재, 메모리 디바이스, 기계 판독가능 전파 신호에 영향을 미치는 물질의 조성, 또는 이들 중 하나 이상의 조합일 수 있다. \"컴퓨터 시스템\"이라는 용어는 예를 들어 프로그램 가능한 프로세서, 컴퓨터, 또는 다중 프로세서 또는 컴퓨터 를 포함하는, 데이터를 처리하기 위한 모든 장치, 디바이스 및 기계를 포함할 수 있다. 처리 시스템은, 하드웨 어 외에, 해당 컴퓨터 프로그램에 대한 실행 환경을 생성하는 코드, 예컨대 프로세서 펌웨어, 프로토콜 스택, 데이터베이스 관리 시스템, 운영 체제, 또는 이들 중 하나 이상의 조합을 구성하는 코드를 포함할 수 있다. (프로그램, 소프트웨어, 소프트웨어 응용 프로그램, 스크립트, 실행 가능한 논리 또는 코드로도 알려진) 컴퓨터 프로그램은 컴파일 또는 해석된 언어, 또는 선언적 또는 절차적 언어를 포함한 임의의 형태의 프로그래밍 언어 로 작성될 수 있으며, 스탠드얼론(standalone) 프로그램으로서 또는 모듈로서, 구성요소, 서브루틴, 또는 컴퓨 팅 환경에서 사용하기에 적합한 다른 유닛을 포함한 임의의 형태로 배포될 수 있다. 컴퓨터 프로그램이 반드시 파일 시스템의 파일과 일치하는 것은 아니다. 프로그램은, 다른 프로그램이나 데이터(예컨대, 마크업 언어 문 서에 저장된 하나 이상의 스크립트)를 유지하는 파일의 일부에, 해당 프로그램 전용의 단일 파일에, 또는 다수 의 조정된 파일(예컨대, 하나 이상의 모듈, 하위 프로그램, 또는 코드의 부분들을 저장하는 파일들)에 저장될 수 있다. 컴퓨터 프로그램은, 하나의 컴퓨터 또는 한 사이트에 있거나 다수의 사이트에 걸쳐 분산되어 있고 통 신 네트워크에 의해 상호 연결된 다수의 컴퓨터 상에서 실행되도록 배포될 수 있다. 컴퓨터 프로그램 명령 및 데이터를 저장하기에 적합한 컴퓨터 판독가능 매체는 모든 형태의 비휘발성 또는 휘발 성 메모리, 매체 및 메모리 디바이스를 포함하며, 예를 들어 반도체 메모리 디바이스, 예를 들어, EPROM, EEPROM 및 플래시 메모리 디바이스; 자기 디스크, 예컨대 내부 하드 디스크 또는 이동식 디스크 또는 자기 테이 프; 자기 광 디스크; 및 CD-ROM 및 DVD-ROM 디스크를 포함한다. 프로세서 및 메모리는 특수 목적 논리 회로에 의해 보완되거나 이에 통합될 수 있다. 시스템의 구성요소는 디지털 데이터 통신의 임의의 형태 또는 매체, 예 컨대 통신 네트워크에 의해 상호 연결될 수 있다. 통신 네트워크의 예는, 예컨대 인터넷 등의 광역 통신망 (\"WAN\") 및 근거리 통신망(\"LAN\")을 포함한다. 본 발명의 다수의 실시형태를 설명하였다. 그럼에도 불구하고, 본 발명의 사상 및 범주로부터 일탈하지 않고 다양한 수정이 이루어질 수 있음을 이해할 것이다. 따라서, 다른 실시형태들은 다음의 청구범위의 범주 내에 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2021-7023059", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에서 설명되는 시스템의 실시형태 및 특징을, 아래와 같이 간략히 설명된 도면들 중 여러 도면을 참조 하여 설명한다. 도 1은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 혈액투석 시스템의 사시도를 나타낸다. 도 2는, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 복막투석 시스템의 사시도를 나타낸다. 도 3은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 복수의 투석 시스템을 포함하는 시설을 나타낸다. 도 4는, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 투석 시스템을 위한 센서 조립체를 나타낸다. 도 5는, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 컴퓨터 시스템의 일례를 나타낸다. 도 6은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따라 상태를 변경하는 동작 모듈과 관련하여 수행되는 처리를 나타내는 흐름도이다. 도 7은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 팩토리 모듈, 감독자 모듈 및 복수의 동작 모듈 을 보여주는 개략도이다.도 8은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른, 상태 제한 데이터를 팩토리 모듈로부터 감독자 모듈로 전송하는 것과 관련하여 수행되는 처리를 설명하는 흐름도이다. 도 9는, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 동작 모듈의 상태 변경을 취급하는 감독자 모듈 과 관련하여 수행되는 처리를 나타내는 흐름도이다. 도 10은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 투석 시스템, 팩토리 승인 테스트 시스템, 인공 지능 기반 최적화 알고리즘, 인증 및 감독 엔진, 동적 동작 데이터 세트 및 정적 동작 데이터 세트를 나타내는 개략도이다. 도 11은, 본 명세서에서 설명되는 시스템의 일 실시형태에 따른 서로 다른 구성요소 사이의 흐름을 나타내는 개 략도이다."}
