{"patent_id": "10-2019-0023274", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0104975", "출원번호": "10-2019-0023274", "발명의 명칭": "L2 스위치 장치 및 그것을 포함하는 영상 관제 시스템", "출원인": "주식회사 유니콤넷", "발명자": "최경식"}}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "광신호 형태로 변환된 영상 데이터를 선택된 광선로로 스위칭하는 스위치부; 상기 스위치부로 출력 영상 데이터를 전송하는 트랜시버부;입력 인터페이스를 통해 수신된 영상 데이터를 분석하여 설정된 객체들을 인식하며, 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 포맷팅하는 객체 인식부; 및상기 입력 인터페이스를 통해 수신된 상기 영상 데이터가 상기 객체 인식부로 제공되도록 하며 상기 객체 인식부가 상기 설정된 객체들을 인식하였을 때, 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영상 데이터가 상기트랜시버부 및 상기 스위치부를 차례로 경유하여 상위 계층 스위치와 연결된 영상 분석 시스템으로 상기 출력영상 데이터로서 전송되도록 하는 콘트롤러를 포함하는 L2 스위치 장치."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 입력 인터페이스를 통해 수신되는 상기 영상 데이터는 CCTV로부터 제공되는 보안 영상 데이터인 L2 스위치 장치."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 영상 데이터는 적어도 2 이상의 채널을 통해 인가되는 L2 스위치 장치."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 객체 인식부는,상기 영상 데이터를 수신하고 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영상 데이터를 상기 트랜시버부로전송하는 영상 송수신부;상기 영상 송수신부에 수신된 상기 영상 데이터를 분석하여 사람 혹은 이동체를 검출하는 영상 분석부; 및상기 영상 분석부가 상기 사람 혹은 이동체를 검출한 경우에 상기 분석된 영상 데이터를 상기 영상 전달 데이터형식으로 포맷팅하는 데이터 조립부를 포함하는 L2 스위치 장치."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 영상 데이터의 분석은 영상 프레임 단위로 추출된 데이터를 전 처리 후 객체 인식을 수행하는 것을 포함하는 L2 스위치 장치."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 상위 계층 스위치는 네트워크 계층(Network layer)에서 동작하는 L3 스위치인 L2 스위치장치."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "설치된 장소의 설정 구역들에서 나타나는 영상 데이터를 획득하는 복수의 CCTV;상기 복수의 CCTV로부터 획득된 영상 데이터를 수신하고, 상기 영상 데이터를 분석하여 설정된 객체들을 인식하며, 상기 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 출력하는 L2 스위치 장치;상기 L2 스위치 장치와 연결되어 상기 출력되는 영상 데이터를 라우팅하는 L3 스위치 장치; 및 상기 L3 스위치 장치를 통해 인가되는 영상 데이터를 분석 처리 및 저장하고 모니터링을 수행하는 영상 분석 시스템을 포함하는 영상 관제 시스템.공개특허 10-2020-0104975-3-청구항 8 제7항에 있어서, 상기 L2 스위치 장치는,광신호 형태로 변환된 영상 데이터를 선택된 광선로로 스위칭하는 스위치부; 상기 스위치부로 출력 영상 데이터를 전송하는 트랜시버부;입력 인터페이스를 통해 수신된 영상 데이터를 분석하여 설정된 객체들을 인식하며, 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 포맷팅하는 객체 인식부; 및상기 입력 인터페이스를 통해 수신된 상기 영상 데이터가 상기 객체 인식부로 제공되도록 하며 상기 객체 인식부가 상기 설정된 객체들을 인식하였을 때, 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영상 데이터가 상기트랜시버부 및 상기 스위치부를 차례로 경유하여 상위 계층 스위치와 연결된 영상 분석 시스템으로 상기 출력영상 데이터로서 전송되도록 하는 콘트롤러를 포함하는 영상 관제 시스템."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 객체 인식부는, 상기 영상 데이터를 수신하고 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영상 데이터를 상기 트랜시버부로전송하는 영상 송수신부;상기 영상 송수신부에 수신된 상기 영상 데이터를 분석하여 사람 혹은 이동체를 검출하는 영상 분석부; 및상기 영상 분석부가 상기 사람 혹은 이동체를 검출한 경우에 상기 분석된 영상 데이터를 상기 영상 전달 데이터형식으로 포맷팅하는 데이터 조립부를 포함하는 영상 관제 시스템."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 영상 분석 시스템은,상기 L3 스위치 장치를 통해 인가되는 영상 데이터를 분배하는 분배 서버;상기 분배된 영상 데이터를 분석 및 처리하는 분석 서버;상기 분석 서버로부터 출력되는 영상 데이터를 저장 영역에 저장하는 저장 서버; 및 상기 분석 서버로부터 출력되는 영상 데이터를 모니터에 모니터링하는 관제 서버를 포함하는 영상 관제 시스템."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서, 상기 L2 스위치 장치는, 상기 복수의 CCTV로부터 상기 영상 데이터와 함께 음성 데이터도 수신하는 영상 관제 시스템."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 콘트롤러는, 상기 객체 인식부가 상기 설정된 객체들을 인식하였을 때, 상기 출력 영상 데이터가 상기 설정된 객체들이 인식되지 않은 경우와는 다른 파장으로 전송되도록 하는 영상 관제 시스템."}
{"patent_id": "10-2019-0023274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 분석 서버는, 상기 분배된 영상 데이터를 분석 및 처리하기 위해 딥러닝 기반의 인공지능 엔진을 이용하는 영상 관제 시스템."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "영상 분석 시스템에 제공되는 영상 데이터의 전송량을 줄일 수 있는 L2 스위치 장치 및 그 것을 포함하는 영상 관제 시스템이 개시된다. L2 스위치 장치는, 광신호 형태로 변환된 영상 데이터를 선택된 광선로로 스위칭하는 스위치부, 상기 스위치부로 출력 영상 데이터를 전송하는 트랜시버부, 입력 인터페이스를 통해 수신된 영상 데이 터를 분석하여 설정된 객체들을 인식하며, 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 포맷팅하 는 객체 인식부, 및 상기 입력 인터페이스를 통해 수신된 상기 영상 데이터가 상기 객체 인식부로 제공되도록 하 며 상기 객체 인식부가 상기 설정된 객체들을 인식하였을 때, 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영 상 데이터가 상기 트랜시버부 및 상기 스위치부를 차례로 경유하여 상위 계층 스위치와 연결된 영상 분석 시스템 으로 전송되도록 하는 콘트롤러를 포함할 수 있다."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상 관제 분야에 관한 것으로, 보다 구체적으로 L2 스위치 장치 및 그것을 포함하는 영상 관제 시스 템에 관한 것이다."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지능형 영상 관제 시스템은 범죄 예방이나 범죄 추적을 위해 CCTV로부터 촬상된 영상 데이터를 수신한다. CCTV 로부터 수신된 영상 데이터는 L2 스위치 장치 및 L3 스위치 장치를 거쳐 영상 관제 시스템의 영상분석 시스템으 로 제공될 수 있다. 하나의 L3 스위치 장치에 연결된 L2 스위치 장치의 개수가 많을수록, 하나의 L2 스위치 장치에 연결된 CCTV의 카메라 개수가 많을수록 영상분석 시스템에 제공되는 영상 데이터의 전송량은 많아진다. 많아진 전송량은 영상 분석 시스템의 로딩을 증가시키므로 실시간 영상 관제에 제한을 주는 요인이 된다. 또한, 영상 데이터의 전송량 이 많으면 영상분석 시스템의 저장 서버의 저장 용량도 커져야 하므로 영상분석 시스템의 구현 비용도 그에 따 라 높아진다. 본 분야에서 통합 방범 지능형 CCTV의 영상 처리 방법 및 통합 방범 지능형 CCTV 시스템이 대한민국 특허 등록 번호 10-1743689호로서 개시되어 있다. 상기 통합 방범 지능형 CCTV의 영상 처리 방법은 객체가 차량인지 사람 인지 여부에 따라 서로 다른 알고리즘을 기반으로 영상 처리를 수행한다. 상기 통합 방범 지능형 CCTV의 영상 처리 방법은 객체가 차량인지 사람인지 여부에 따라 서로 다른 알고리즘을 기반으로 영상 처리를 수행하는 것을 개시할 뿐, 영상분석 시스템에 제공되는 영상 데이터의 전송량을 줄이는 것과는 관련이 없다."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는, 영상 분석 시스템에 제공되는 영상 데이터의 전송량을 줄일 수 있는 L2 스위치 장치 및 그 것을 포함하는 영상 관제 시스템을 제공함에 있다."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위하여, 본 발명의 실시 예에 따른 L2 스위치 장치는, 광신호 형태로 변환된 영상 데이터를 선택된 광선로로 스위칭하는 스위치부, 상기 스위치부로 출력 영상 데이터를 전송하는 트랜시버부, 입 력 인터페이스를 통해 수신된 영상 데이터를 분석하여 설정된 객체들을 인식하며, 객체 인식된 상기 영상 데이 터를 영상 전달 데이터 형식으로 포맷팅하는 객체 인식부, 및 상기 입력 인터페이스를 통해 수신된 상기 영상 데이터가 상기 객체 인식부로 제공되도록 하며 상기 객체 인식부가 상기 설정된 객체들을 인식하였을 때, 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영상 데이터가 상기 트랜시버부 및 상기 스위치부를 차례로 경유하여 상위 계층 스위치와 연결된 영상 분석 시스템으로 상기 출력 영상 데이터로서 전송되도록 하는 콘트롤러를 포함 할 수 있다. 본 발명의 실시 예에서, 상기 객체 인식부는, 상기 영상 데이터를 수신하고 상기 영상 전달 데이터 형식으로 포 맷팅된 상기 영상 데이터를 상기 트랜시버부로 전송하는 영상 송수신부, 상기 영상 송수신부에 수신된 상기 영 상 데이터를 분석하여 사람 혹은 이동체를 검출하는 영상 분석부, 및 상기 영상 분석부가 상기 사람 혹은 이동 체를 검출한 경우에 상기 분석된 영상 데이터를 상기 영상 전달 데이터 형식으로 포맷팅하는 데이터 조립부를 포함할 수 있다. 상기 기술적 과제를 달성하기 위하여, 본 발명의 실시 예에 따른 영상 관제 시스템은, 설치된 장소의 설정 구역 들에서 나타나는 영상 데이터를 획득하는 복수의 CCTV, 상기 복수의 CCTV로부터 획득된 영상 데이터를 수신하고, 상기 영상 데이터를 분석하여 설정된 객체들을 인식하며, 상기 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 출력하는 L2 스위치 장치, 상기 L2 스위치 장치와 연결되어 상기 출력되는 영상 데이터를 라우팅하는 L3 스위치 장치, 및 상기 L3 스위치 장치를 통해 인가되는 영상 데이터를 분석 처리 및 저장하고 모 니터링을 수행하는 영상 분석 시스템을 포함할 수 있다. 본 발명의 실시 예에서, 상기 영상 분석 시스템은, 상기 L3 스위치 장치를 통해 인가되는 영상 데이터를 분배하 는 분배 서버, 상기 분배된 영상 데이터를 분석 및 처리하는 분석 서버, 상기 분석 서버로부터 출력되는 영상 데이터를 저장 영역에 저장하는 저장 서버, 및 상기 분석 서버로부터 출력되는 영상 데이터를 모니터에 모니터 링하는 관제 서버를 포함할 수 있다."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예적인 구성에 따르면, L2 스위치 장치의 객체 인식부를 통해 설정된 객체들이 인식될 수 있으므 로, 영상 분석 시스템에 제공되는 영상 데이터의 전송량이 줄어든다. 따라서, 영상 분석 시스템을 구성하는 서 버들의 로딩 혹은 처리량이 줄어들어 영상 관제가 보다 효율적으로 달성된다."}
{"patent_id": "10-2019-0023274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "위와 같은 본 발명의 목적들, 다른 목적들, 특징들 및 이점들은 첨부된 도면과 관련된 이하의 바람직한 실시 예 들을 통해서 쉽게 이해될 것이다. 그러나 본 발명은 여기서 설명되는 실시 예에 한정되지 않고 다른 형태로 구 체화될 수도 있다. 오히려, 여기서 소개되는 실시 예들은, 이해의 편의를 제공할 의도 이외에는 다른 의도 없이, 개시된 내용이 보다 철저하고 완전해질 수 있도록 그리고 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 제공되는 것이다. 본 명세서에서, 어떤 소자 또는 라인들이 대상 소자 블록에 연결된다 라고 언급된 경우에 그것은 직접적인 연결 뿐만 아니라 어떤 다른 소자를 통해 대상 소자 블록에 간접적으로 연결된 의미까지도 포함한다. 또한, 각 도면에서 제시된 동일 또는 유사한 참조 부호는 동일 또는 유사한 구성 요소를 가급적 나타내고 있다. 일부 도면들에 있어서, 소자 및 라인들의 연결관계는 기술적 내용의 효과적인 설명을 위해 나타나 있을 뿐, 타 의 소자나 기능 회로 블록들이 더 구비될 수 있다. 여기에 설명되고 예시되는 각 실시 예는 그것의 상보적인 실시 예도 포함될 수 있으며, 전형적인 L2 스위치 장 치, L3 스위치 장치, 및 영상분석 시스템의 세부적 구조와 그러한 구조의 기본적 동작에 관한 구체적 동작은 본 발명의 요지를 모호하지 않도록 하기 위해 상세히 설명되지 않음을 유의(note)하여야 한다. 도 1은 본 발명의 실시 예에 따른 영상 관제 시스템의 블록도이다. 도면을 참조하면, 영상 관제 시스템은, CCTV 그룹, L2 스위치 장치 그룹, L3 스위치 장치, 및 영상분석 시스템을 포함할 수 있다. CCTV 그룹은 설치된 장소의 설정 구역들에서 나타나는 보안용 음성 데이터와 보안용 영상 데이터 중 적어 도 하나 이상을 획득하기 위해 복수의 CCTV(100-1, 100-2, … , 100-n)을 포함할 수 있다. 여기서 n은 2 이상 의 자연수를 가리킨다. 임의의 CCTV(100-1)는 카메라를 통해 획득된 영상 데이터와 마이크로폰을 통해 획득된 음성 데이터를 LAN 선일 수 있는 라인(LINE 10)을 통해 대응되는 L2 스위치 장치(200-1)로 스트림 데이터로서 제공할 수 있다. L2 스위치 장치 그룹은 복수의 L2 스위치 장치(200-1, 200-2, … , 200-k)을 포함할 수 있다. 여기서 k는 2 이상의 자연수를 가리킨다. 임의의 L2 스위치 장치(200-1)는 상기 라인(LINE 10)과 라인(LINE 20) 사이에 연 결된다. L2 스위치 장치(200-1)는 상기 복수의 CCTV로부터 획득된 음성 데이터 및 영상 데이터 중 적어도 하나 이상을 상기 라인(LINE 10)을 통해 수신한다. 상기 L2 스위치 장치(200-1)는 객체 인식부(220-1)를 포함한다. 객체 인식부(220-1)를 포함함에 의해, 상기 L2 스위치 장치(200-1)는 상기 영상 데이터를 분석하여 설정된 객체 들을 인식하며, 상기 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 상기 라인(LINE 20)에 출력한 다. 상기 라인(LINE 20)에는 음성 데이터도 음성 전달 데이터 형식으로 제공된다. 여기서, 설정된 객체들은 자동차나 사람 등이 포함될 수 있다. 객체가 인식되지 않는 경우에 음성 및 영상 데이 터의 전송은 중단되거나 주기적으로 수행될 수 있다. 따라서, L2 스위치 장치(200-1)의 객체 인식부(220-1)를 통해 설정된 객체들이 인식될 수 있으므로, 영상 분석 시스템에 제공되는 영상 데이터의 전송량이 줄어든다. 따라서, 영상 분석 시스템을 구성하는 서버들 의 로딩 혹은 처리량이 줄어들어 영상 관제가 보다 효율적으로 달성된다. L2 스위치 장치(200-1)는 OSI 7 계층 모형 중의 L2 계층의 기능을 수행하는 스위치 장치이다. OSI 모형(Open Systems Interconnection Reference Model)은 국제표준화기구(ISO)에서 개발한 모델로, 컴퓨터 네트워크 프로 토콜 디자인과 통신을 계층으로 나누어 설명한 것이다. 일반적으로 OSI 7 계층 모형이라고 한다 L2 계층은 데이터 링크 계층(Data link layer)을 가리킨다. 데이터 링크 계층은 포인트 투 포인트(Point to Point) 간 신뢰성 있는 전송을 보장하기 위한 계층이다. 이 계층에서는 CRC 기반의 오류 제어와 흐름 제어가 필 요하다. 데이터 링크 계층은 네트워크 상의 개체들 간 데이터를 전달하고, 물리 계층에서 발생할 수 있는 오류 를 찾아 내며, 수정하는 데 필요한 기능적, 절차적 수단을 제공한다. 주소 값은 물리적으로 할당 받는데, 이는 네트워크 카드가 만들어질 때부터 맥 주소(MAC address)가 정해져 있다는 의미이다. 주소 체계는 계층이 없는 단일 구조이다. 데이터 링크 계층의 가장 잘 알려진 예는 이더넷이다. 이 외에도 HDLC나 ADCCP 같은 포인트 투 포인트(point-to-point) 프로토콜이나 패킷 스위칭 네트워크나 LLC, ALOHA 같은 근거리 네트워크용 프로토콜이 있다. 네트워크 브릿지나 스위치 등이 이 계층에서 동작하며, 직접 이어진 곳에만 연결할 수 있다 L3 스위치 장치는 상기 라인(LINE 20)을 통해 상기 L2 스위치 장치 그룹과 연결되어 상기 출력되는 음성 데이터 및 영상 데이터 중 적어도 하나 이상을 라우팅한다. L3 스위치 장치는 OSI 7 계층 모형 중의 L3 계층의 기능을 수행하는 스위치 장치이다. L3 스위치 장치는 네트워크 계층(Network layer)을 가리킨다. 네트워크 계층은 여러 개의 노드를 거칠 때 마다 경로를 찾아주는 역할을 하는 계층이다. 네트워크 계층은 다양한 길이의 데이터를 네트워크들을 통해 전달 하고, 그 과정에서 전송 계층이 요구하는 서비스 품질을 제공하기 위한 기능적, 절차적 수단을 제공한다. 네트 워크 계층은 라우팅, 흐름 제어, 세그멘테이션(segmentation/desegmentation), 오류 제어, 인터네트워킹 (Internetworking) 등을 수행한다. 라우터가 이 계층에서 동작하고 이 계층에서 동작하는 스위치도 있다. 이 계 층은 데이터를 다른 네트워크를 통해 전달함으로써 인터넷이 가능하게 만드는 계층이다. 논리적인 주소 구조 (IP), 곧 네트워크 관리자가 직접 주소를 할당하는 구조를 가지며, 계층적(hierarchical)이다. 영상 분석 시스템은 상기 L3 스위치 장치를 통해 인가되는 음성 및 영상 데이터를 분석 처리 및 저장 하고 모니터링을 수행한다. 영상 분석 시스템은 라인(LINE 30)을 통해 상기 L3 스위치 장치로부터 출 력되는 음성 및 영상 데이터를 수신한다. 상기 라인(LINE 20) 및 상기 라인(LINE 30)은 TCP/IP 프로토콜 기반의 통신 라인일 수 있다. 도 2는 도 1중 L2 스위치 장치의 예시적 블록도이다. 도면을 참조하면, 임의의 L2 스위치 장치(200-1)는 스위치부, 트랜시버부(212,214), 객체 인식부(220-1), 및 콘트롤러를 포함할 수 있다. 또한, L2 스위치 장치(200-1)는 입력 인터페이스 및 장애/전원오프 검출부를 포함할 수 있다. 상기 입력 인터페이스는 도 1의 라인(LINE 10)을 통해 CCTV 그룹과 연결되어 있다. 상기 라인(LINE 10)은 복수의 CCTV와 연결되어 있으므로 단일 채널이 아닌 복수의 채널로부터 획득된 영상 데이터를 상기 입력 인터페이스로 전달한다. 상기 장애/전원오프 검출부는 L2 스위치 장치(200-1)에서의 장애 혹은 전원 오프 상태를 검출한다. 장애 혹은 전원이 오프된 경우에 링형(ring type) 전송망에서는 데이터의 바이패스 기능이 필요하다. 바이패스 기능 은 상기 콘트롤러의 제어 하에 스위치부내의 제3 스위치(sw3)를 스위칭 온 함에 의해 달성된다. 즉, 장애 혹은 전원이 오프된 경우에 상기 제3 스위치(sw3)가 스위칭 온되어, 노드(P1)로부터 인입되던 이웃 L2 스 위치 장치(예 200-2)의 데이터는 노드(P4)로 바이패스된다. 결국, 이 경우에는 노드(P1)로부터 인입되던 이웃 L2 스위치 장치(예 200-2)의 데이터는 제1,2 트랜시버(212,214)로 제공되지 않는다. 통상적으로 상기 노드들(P1, P2, P3, P4)은 단일 코어 광섬유로 이루어질 수 있는 광선로와 연결될 수 있다. L2 스위치 장치 그룹은 광선로를 통해 링형 망으로 구성될 수 있다. 링형 망으로 구현되는 이더넷 통신에 있어서, 하나의 광섬유 선로를 이용하여 양방향으로 데이터를 전송하고자 할 경우, 광섬유 선로에 훼손 및 절단 등이 발생되거나, L2 스위치 장치 그룹중의 하나에 장애나 전원 오 프가 발생되면, 광 네트워크 이더넷 기능이 마비된다. 따라서, 상기 장애/전원오프 검출부의 설치 및 스위 치부의 바이패스 기능이 필요하게 된다. 임의의 L2 스위치 장치(예 200-1)는 입력 인터페이스를 통해 복수의 CCTV (100-1, 100-2, … , 100-n) 카 메라와 연결될 수 있다. 상기 스위치부는 광신호 형태로 변환된 음성 및 영상 데이터를 선택된 광선로(예 노드 P4)로 스위칭할 수 있다. 스위치부의 제2 스위치(sw2)만이 스위칭 온 되는 경우에 제1 트랜시버로부터 출력되는 출력 음 성 및 영상 데이터는 광선로의 노드(P4)로 전송될 수 있다. 이 경우의 전송은 East 방향(예컨대 상향)으로의 전 송이 될 수 있다. 한편, 스위치부는 광신호 형태로 변환된 음성 및 영상 데이터를 선택된 광선로(예 노드 P1)로 스위칭할 수 있다. 스위치부의 제1 스위치(sw1)만이 스위칭 온 되는 경우에 제2 트랜시버로부터 출력되는 출력 음 성 및 영상 데이터는 광선로의 노드(P1)로 전송될 수 있다. 이 경우의 전송은 West 방향(예컨대 하향)으로의 전 송이 될 수 있다. 제1,2 트랜시버들(212,214)로 이루어진 상기 트랜시버부는 콘트롤러의 제어하에 상기 스위치부로 출 력 음성 및 영상 데이터를 전송한다. 상기 트랜시버부(212,214)는 광신호를 수신하여 전기적 데이터(예컨대 논 리 1 또는 논리 0으로 구성된 디지털 데이터)로 변환하기 위해 수광부를 구비할 수 있다. 수광부는 일반적으로 포토다이오드로 구현될 수 있다. 또한, 상기 트랜시버부(212,214)는 상기 전기적 데이터를 광신호로 변환하기 위해 발광부를 구비할 수 있다. 발 광부는 발광 다이오드 혹은 레이저 다이오드로 구현될 수 있다. 상기 트랜시버부(212,214)는 상기 발광부 및 수광부 이외에도, 다중화 및 역다중화기, 레이저 다이오드 드라이 버, 증폭기, 및 파장분할 다중화기를 포함할 수 있다. 상기 파장분할 다중화기는 레이저 다이오드와 포토다이오드에서 사용되고 있는 두 개의 파장, 예를 들어 1310 나노미터와 1550 나노미터의 파장을 갖는 광신호들을 서로 분리하는 역할을 한다. 상기 다중화 및 역다중화기는 데이터의 다중화(멀티플렉싱) 및 역다중화(디멀티플렉싱)를 수행한다. 상기 레이 저 다이오드 드라이버는 상기 다중화 및 역다중화기로부터 출력된 신호를 수신하여 상기 레이저 다이오드부를 구동한다. 상기 증폭기는 상기 포토 다이오드부로부터 출력되는 신호를 수신하여 증폭한 후 상기 다중화 및 역 다중화기로 인가한다. 상기 트랜시버부(212,214)의 구성 예가 설명되었으나, 상기 트랜시버부는 스마트 듀플렉스(duplex) SFP(small form-factor pluggable) 트랜시버, 스마트 BiDi SFP(bidirectional small form-factor pluggable) 트랜시버, 스마트 SWSF BiDi SFP(single wavelength single fiber bidirectional small form-factor pluggable) 트랜시 버, 스마트 듀플렉스 SFP+(small form-factor pluggable plus) 트랜시버, 스마트 BiDi SFP+(bidirectional small form-factor pluggable plus) 트랜시버, 스마트 SWSF BiDi SFP+(single wavelength single fiber bidirectional small form-factor pluggable plus) 트랜시버, 스마트 듀플렉스 XFP(10 gigabit small form- factor pluggable) 트랜시버, 스마트 BiDi XFP(bidirectional 10 gigabit small form-factor pluggable) 트랜 시버, 또는 스마트 SWSF BiDi XFP(single wavelength single fiber bidirectional 10 gigabit small form- factor pluggable) 트랜시버일 수 있다. 상기 객체 인식부(220-1)는 상기 입력 인터페이스를 통해 수신된 영상 데이터를 분석하여 설정된 객체들을 인식한다. 상기 객체 인식부(220-1)는 객체 인식된 상기 영상 데이터를 영상 전달 데이터 형식으로 포맷팅한다. 상기 객체 인식부(220-1)는 영상 분석부, 데이터 조립부, 및 영상 송/수신부를 포함할 수 있다. 상기 영상 송/수신부는 영상 전처리를 수행할 수 있다. 영상 전처리는 입력 영상 프레임의 RGB 컬러 영상 이미지를 그레이 스케일 이미지로 변환하는 처리를 포함할 수 있다. 상기 영상 분석부는 배경 차분 처리를 수행할 수 있다. 배경 차분 처리를 위해서는 먼저, 지속적으로 입력 되는 입력 영상 프레임들로 된 영상에 대한 픽셀 단위의 학습(Learning) 과정을 통해 배경 이미지 프레임을 생 성한다. 차례로 입력되는 입력 영상 프레임에서 상기 생성된 배경 영상 프레임을 차분하면 각각의 배경 차분 영 상이 생성된다. 상기 영상 분석부는 각각의 배경 차분 이미지에서 노이즈를 제거하는 노이즈 제거 동작을 영상 분석을 위 해 수행할 수 있다. 노이즈 제거가 수행된 이후에 상기 영상 분석부는 노이즈 제거된 배경 차분 영상에서 움직임 영역을 검출하고, 검출된 움직임 영역의 종횡비와 움직임 영역의 타원비를 함께 이용하여 사람 혹은 자동차 등과 같은 이동체를 검출할 수 있다. 기본적인 검출 방법으로서 사람 몸체의 영역이 후보 영역 종횡의 반지름을 가진 타원의 80%를 넘기는 지를 체크 하는 방법이 있다. 이러한 방법은 후보 영역의 세밀한 모양에 대해 고려하지 않았고, 그로 인해 모든 물체들이 타원의 80%를 넘겼을 때 오감지를 증가시키는 단점이 있다. 따라서, 예를 들어 사람의 몸체를 검출할 때 타원의 형태만을 고려하는 것이 아니라 사람의 상체 형태 또한 고 려하는 방법이 수행될 수 있다. 즉, 종횡비를 이용한 1차적 검출 이후에, 사람물체 1차 후보의 전체 영역 내에 서의 타원비를 이용하여 사람물체 2차 후보를 검출하는 2차적 검출 과정이 더 수행될 수 있다. 또한, 사람물체 2차 후보의 상측으로 돌출된 돌출 영역에 대한 타원비를 이용하여 최종적으로 사람물체를 검출하는 최종 검출 과정이 추가될 수 있다. 상기 데이터 조립부는 상기 영상 분석부가 상기 사람 혹은 이동체를 검출한 경우에 상기 분석된 영상 데이터를 상기 영상 전달 데이터 형식으로 포맷팅한다. 여기서 포맷팅은 1 프레임 전송 단위로 구현될 수 있다. 상기 콘트롤러는 상기 입력 인터페이스를 통해 수신된 상기 영상 데이터가 상기 객체 인식부(220- 1)의 영상 송/수신부로 제공되도록 한다. 상기 콘트롤러는 상기 객체 인식부(220-1)가 상기 설정된 객체들을 인식하였을 때, 상기 영상 전달 데이터 형식으로 포맷팅된 상기 영상 데이터가 상기 트랜시버부(예 212) 및 상기 스위치부를 차례로 경유하여 상위 계층 스위치와 연결된 영상 분석 시스템으로 상 기 출력 영상 데이터로서 전송되도록 한다. 결국, 상기 입력 인터페이스를 통해 수신된 상기 영상 데이터 는 콘트롤러, 영상 송/수신부, 영상 분석부, 데이터 조립부, 영상 송/수신부, 콘트롤 러, 제1 트랜시버, 제2 스위치(sw2), 및 광선로의 노드(P4)를 차례로 경유하여 상기 출력 영상 데이 터로서 출력될 수 있다. 상기 콘트롤러는 상기 객체 인식부(220-1)가 상기 설정된 객체들을 인식하였을 때, 상기 음성 전달 데이터 형식으로 포맷팅된 상기 음성 데이터가 상기 트랜시버부(예 212) 및 상기 스위치부를 차례로 경유하여 상 기 영상 분석 시스템으로 상기 출력 음성 데이터로서 전송되도록 할 수 있다. 따라서, 전송되는 출력 영상 데이터의 양은 영상 전달 데이터 형식으로 포맷팅되기 이전의 데이터 양에 비해 현 저히 줄어든다. 즉, 상기 객체 인식부(220-1)가 상기 설정된 객체들을 인식하였을 때에, 영상 전달 데이터 형식 으로 재조립된 영상 데이터가 출력 영상 데이터로서 전송되는 것이다. 그러므로, 영상 데이터의 전송량이 줄어 들면 영상분석 시스템의 로딩이 감소되어, 실시간 영상 관제가 이루어질 수 있다. 또한, 영상 데이터의 전송량 이 줄어들면 영상분석 시스템의 저장 서버의 저장 용량을 상대적으로 적게 할 수 있다. 따라서, 영상분석 시스 템의 구현 비용을 낮출 수 있다. 한편, 음성 데이터의 경우에도 상기 객체 인식부(220-1)가 상기 설정된 객체들을 인식하였을 때에, 출력 음성 데이터로서 전송되므로, 음성 데이터의 전송량도 줄어든다. 상기 객체 인식부(220-1)가 상기 설정된 객체들을 인식하였을 때에, 상기 콘트롤러는 상기 제1 트랜시버 내의 파장분할 다중화기를 제어하여 객체 인식을 하지 못하였을 때의 광신호 파장과는 다른 별개의 파장으 로 출력 영상 데이터가 출력되도록 할 수 있다. 예를 들어, 객체 인식을 하지 못한 경우에 상기 출력 영상 데이 터는 1310 나노미터의 파장으로 출력될 수 있고, 객체 인식을 한 경우에 상기 출력 영상 데이터는 1410 나노미 터의 파장으로 출력될 수 있다. 도 3은 도 1중 영상 분석 시스템의 예시적 블록도이다. 도면을 참조하면, 영상 관제 시스템의 영상 분석 시스템은, 상기 L3 스위치 장치를 통해 인가되는 영 상 데이터를 분배하는 분배 서버, 상기 분배 서버를 통해 분배된 영상 데이터를 분석 및 처리하는 분 석 서버, 상기 분석 서버로부터 출력되는 영상 데이터를 저장 영역에 저장하는 저장 서버, 및 상기 분석 서버로부터 출력되는 영상 데이터를 모니터에 모니터링하는 관제 서버를 포함한다. 도 3의 영상 분석 시스템에서, 분배 서버는 상대적으로 적은 용량의 영상 데이터를 받으므로 분배할 용량 도 적다. 그러므로, 분배 서버의 처리량이 줄어들어 로딩이 경감된다. 또한, 분석 서버는 상대적으로 적은 용량의 영상 데이터를 분석하므로 분석할 용량도 적다. 그러므로, 분 석 서버의 분석 처리량이 줄어들어 서버의 로딩이 경감된다. 상기 분석 서버로부터 출력되는 영상 데이터를 저장 영역에 저장하는 저장 서버도 저장할 용량도 상 대적으로 적다. 그러므로, 저장 서버의 저장량이 줄어들어 서버의 로딩이 경감된다. 또한, 저장 서버(43 0)의 저장 용량을 적게 할 수 있으므로, 서버 구현 비용이 상대적으로 저렴해진다. 도 4는 도 3의 영상 분석 시스템의 동작 플로우챠트이다. 도면을 참조하면, 영상 분석 시스템은 동작 S402에서 영상 데이터를 수신하고 분배한다. 동작 S404에서 분 배된 영상 데이터에 대한 검출 및 분석이 수행된다. 동작 S406에서 이벤트 검출의 여부가 체크된다. 이벤트 검 출은 사람이나 이동물체(예 자동차)가 검출되는 것을 의미한다. 이벤트 검출이 있는 경우에 동작 S408에서 데이 터 처리 및 영상 매칭이 수행된다. 데이터 처리 및 영상 매칭이 수행된 후에 동작 S410에서, 영상 저장이 이루어진다. 영상 저장은 디지털 데이터 저장형식 혹은 아날로그 데이터 저장형식으로 이루어질 수 있다. 한편 동작 S410에서 음성 저장도 영상 저장과 함께 수행될 수 있다. 동작 S412에서 우선 순위에 따라 영상 팝업 동작이 모니터에서 수행된다. 예를 들어 9분할 또는 12분할 화면이 디스플레이 되고 있던 모니터에서, 영상 팝업 동작이 수행되면 4분할, 2분할, 또는 전체 화면에 영상 팝업의 대 상이 되는 영상이 디스플레이 될 수 있다. 상기 이벤트 검출이 없는 경우에 동작 S416에서 영상 데이터 및 음성 데이터가 폐기될 수 있다. 동작 S414에서 데이터 학습이 수행된다. 데이터 학습은 딥러닝 기반의 인공지능(AI) 기술을 이용하여 수행될 수 있다. 딥러닝 기반의 인공지능(AI) 기술을 이용하여 데이터 학습을 수행할 경우에 데이터의 검출 및 분석의 정 확도가 개선될 수 있다. 사전에 학습된 영상 데이터를 통해 딥러닝 기반의 인공지능이 데이터의 검출 및 분석에 관여될 수 있다. 딥러닝 기반의 인공지능(AI)의 엔진으로는 TensorFlow가 사용될 수 있고, Inception v3 모델이 사용될 수 있다. 객체 검출의 목적 달성을 위해, 정답을 알고 있는 훈련데이터를 이용한 머신러닝 모델을 학습시키는 방식인 지 도학습이 사용될 수 있다. 인공지능 모델의 구조, 가중치, 파라미터, 데이터 셋 등은 사안에 따라 다양하게 설 정될 수 있다. 수신되는 영상 데이터는 일정 프레임마다 데이터 베이스에 저장될 수 있고, 다양한 소스코드에 의해 학습이 이루어질 수 있다. 도 5는 도 2의 L2 스위치 장치의 동작 플로우챠트이다. 도면을 참조하면, L2 스위치 장치(예 200-1)의 객체 인식부(예 220-1)는 동작 S502에서 CCTV 채널과 연결된 입 력 인터페이스를 통해 CCTV로부터 제공되는 영상 스트림을 수신한다. L2 스위치 장치(예 200-1)의 객체 인식부(예 220-1)는 동작 S504에서 수신된 영상 스트림에서 1프레임을 추출한 다. L2 스위치 장치(예 200-1)의 객체 인식부(예 220-1)는 동작 S506에서 객체를 추출한다. L2 스위치 장치(예 200-1)의 객체 인식부(예 220-1)는 동작 S508에서 추출된 객체가 사람인지의 여부를 체크한 다. L2 스위치 장치(예 200-1)의 객체 인식부(예 220-1)는 동작 S510에서 추출된 객체가 자동차 등과 같은 이동물체 인지의 여부를 체크한다. 여기서 이동물체는 자동차, 화물차, 오토바이, 자전거, 스쿠터, 및 경운기 등과 같은 다양한 형태의 운송 수단을 포함할 수 있다. 도 2의 객체 인식부(220-1)내의 상기 영상 송/수신부에 의해 영상 전처리가 수행되어, RGB 컬러 영상 데이 터는 그레이 스케일 이미지로 변환될 수 있다. 객체 인식부(220-1)내의 영상 분석부에 의해 배경 차분 이 미지가 생성된 후 노이즈 제거가 수행될 수 있다. 상기 영상 분석부에 의해 노이즈 제거된 배경 차분 영상 에서 움직임 영역이 검출될 수 있다. 예를 들어, 검출된 움직임 영역의 종횡비와 움직임 영역의 타원비를 함께 이용하면 사람 혹은 자동차 등과 같은 이동체가 객체로서 검출되어 추출될 수 있다. 한편, 객체가 사람인지 자동차 인지의 여부에 따라 인식 알고리즘이 다르게 적용될 수 있을 것이다. 예를 들어, 객체가 사람인 경우에 얼굴 감지 알고리즘이 적용될 수 있다. 즉, 얼굴 감지 알고리즘이 수행되어 사람의 얼굴 에 대한 인식이 적절히 수행된다. 또한, 상기 객체가 자동차인 경우에 차량 번호 인식 알고리즘이 적용될 수 있 다. 차량 번호에 대한 인식이 수행되어 차량 번호의 인식이 이루어진 경우에 상기 번호가 이전에 인식된 번호와 동일한지 여부가 판단될 수 있다. 또한, 차량 번호 인식 알고리즘으로 차량 번호의 인식이 불가능한 경우, 상기 자동차의 램프 및 그릴 패턴에 대한 인식 알고리즘이 별도로 수행될 수 있다. 위와 같은 인식 알고리즘의 적용으로 사람 혹은 자동차가 객체로서 확인된 경우에 L2 스위치 장치(예 220-1)는 동작 S512에서 영상 전달 데이터를 설정된 영상 전달 데이터 형식에 맞게 포맷팅한다. L2 스위치 장치(예 220-1)는 동작 S514에서 포맷팅된 영상 데이터를 예를 들어 1프레임 단위로 전송할 수 있다. 도 5의 경우에 수신된 영상 데이터로부터 객체를 추출하고 추출된 영상 데이터를 전송하는 것을 위주로 설명되 었으나, 추출된 영상 데이터에 대응되는 음성 데이터도 영상 데이터와 함께 전송될 수 있음은 물론이다. 상기한 설명에서는 본 발명의 실시 예들을 위주로 도면을 따라 예를 들어 설명하였지만, 본 발명의 기술적 사상 의 범위 내에서 본 발명을 다양하게 변형 또는 변경할 수 있음은 본 발명이 속하는 분야의 당업자에게는 명백한 것이다. 예를 들어, 사안이 다른 경우에 본 발명의 기술적 사상을 벗어남이 없이, L2 스위치 장치 내의 객체 인 식부의 구성이나 구조를 변형 또는 변경할 수 있을 것이다."}
{"patent_id": "10-2019-0023274", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 따른 영상 관제 시스템의 블록도이다. 도 2는 도 1중 L2 스위치 장치의 예시적 블록도이다. 도 3은 도 1중 영상 분석 시스템의 예시적 블록도이다. 도 4는 도 3의 영상 분석 시스템의 동작 플로우챠트이다. 도 5는 도 2의 L2 스위치 장치의 동작 플로우챠트이다."}
