{"patent_id": "10-2023-0010424", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0117947", "출원번호": "10-2023-0010424", "발명의 명칭": "인공지능을 이용한 발주서 기반의 상품 추천 방법", "출원인": "광주대학교산학협력단", "발명자": "김광현"}}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "학습용 발주서에 기재된 제1 주문자의 성명으로부터 상기 제1 주문자의 성별 및 나이를 추론하는 단계;상기 제1 주문자의 성별과 나이를 입력 데이터로 설정하고, 상기 학습용 발주서에 기재된 상품명의 상품 카테고리를 출력 데이터로 설정하여 신경망 모델을 지도 학습(supervised learning)시키는 단계;타겟 발주서에 기재된 제2 주문자의 성명으로부터 상기 제2 주문자의 성별 및 나이를 추론하는 단계; 및상기 제2 주문자의 성별과 나이를 상기 신경망 모델에 입력하여 상기 제2 주문자에 대한 상품을 추천하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 또는 제2 주문자의 성별 및 나이를 추론하는 단계는상기 학습용 발주서 또는 상기 타겟 발주서에서 성명을 식별하는 단계와,상기 성명에서 이름만을 분리 추출하는 단계와,상기 추출된 이름을 출생자 이름 통계 데이터와 비교하여 상기 이름에 대응하는 출생년도와 성별을 식별하고,상기 출생년도에 기초하여 상기 나이를 산출하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 나이를 산출하는 단계는상기 출생자 이름 통계 데이터에서 상기 이름이 가장 많이 등장한 출생년도를 식별하고, 상기 출생년도에 기초하여 상기 나이를 산출하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 나이를 산출하는 단계는상기 출생자 이름 통계 데이터에서 상기 이름의 등장 빈도가 높은 순으로 미리 설정된 개수의 출생년도를 식별하고, 상기 등장 빈도에 따라 상기 출생년도를 가중 평균(weighted average)하고, 상기 가중 평균값에 기초하여상기 나이를 산출하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법.공개특허 10-2024-0117947-3-청구항 5 제1항에 있어서,상기 신경망 모델을 지도 학습시키는 단계는상기 상품명을 복수의 형태소로 분리하는 단계와,상기 복수의 형태소 중 상품 카테고리를 식별하는 단계와,상기 상품 카테고리를 출력 데이터로 설정하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 신경망 모델을 지도 학습시키는 단계는상기 상품명을 복수의 형태소로 분리하는 단계와,상기 복수의 형태소를 상품 카테고리별 상품목록과 비교하여 상기 상품명에 대응하는 상품 카테고리를 식별하는단계와,상기 상품 카테고리를 출력 데이터로 설정하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 신경망 모델을 지도 학습시키는 단계는상기 학습용 발주서에 기재된 주소 및 주문 시간을 식별하는 단계와,기상청 데이터에 기초하여 상기 주문 시간에 상기 주소의 날씨를 식별하는 단계와,상기 날씨를 입력 데이터로 추가 설정하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제2 주문자의 성별 및 나이를 추론하는 단계는, 상기 타겟 발주서에 기재된 주문 시간에 상기 타겟 발주서에 기재된 주소의 날씨를 더 식별하는 단계를 포함하고,상기 상품을 추천하는 단계는, 상기 제2 주문자의 성별과 나이 및 상기 타겟 발주서에 기재된 주소의 날씨를 상기 신경망 모델에 입력하여 상기 제2 주문자에 대한 상품을 추천하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,공개특허 10-2024-0117947-4-상기 상품을 추천하는 단계는상기 신경망 모델에서 출력된 상품 카테고리를 사용자 단말에 제공하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 상품을 추천하는 단계는상기 신경망 모델에서 출력된 상품 카테고리를 온라인 마켓 플랫폼에 검색하여 상품 리스트를 생성하는 단계와,상기 상품 리스트를 사용자 단말에 제공하는 단계를 포함하는인공지능을 이용한 발주서 기반의 상품 추천 방법."}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 발주서에 기재된 정보와, 발주서로부터 추론된 주문자의 성별과 나이에 기초하여 상품을 추천하는 방 법에 관한 것이다. 본 발명의 일 실시예에 따른 인공지능을 이용한 발주서 기반의 상품 추천 방법은 학습용 발주 서에 기재된 제1 주문자의 성명으로부터 상기 제1 주문자의 성별 및 나이를 추론하는 단계, 상기 제1 주문자의 성별과 나이를 입력 데이터로 설정하고, 상기 학습용 발주서에 기재된 상품명의 상품 카테고리를 출력 데이터로 설정하여 신경망 모델을 지도 학습(supervised learning)시키는 단계, 타겟 발주서에 기재된 제2 주문자의 성명 으로부터 상기 제2 주문자의 성별 및 나이를 추론하는 단계 및 상기 제2 주문자의 성별과 나이를 상기 신경망 모 델에 입력하여 상기 제2 주문자에 대한 상품을 추천하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 발주서에 기재된 정보와, 발주서로부터 추론된 주문자의 성별과 나이에 기초하여 상품을 추천하는 방 법에 관한 것이다."}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인 쇼핑몰에 대한 접근성이 향상됨에 따라 온라인 상에서 물품을 구매하는 전자상거래의 비중이 다양한 상 품들을 대상으로 급격히 증가하고 있다. 현재 전자상거래 방식은 소비자가 자신이 원하는 상품을 직접 검색해야 하고, 온라인 쇼핑몰이 소비자에게 상품 을 추천해주고 있지 않다. 물론 온라인 쇼핑몰의 웹 페이지 내 배너(banner) 등을 통해 상품 광고가 수행되고 있으나, 해당 광고는 소비자별로 달리 수행되는 것이 아닌 일괄적으로 모든 소비자에게 제공되는 것이므로, 광 고 대상 물품이 소비자에게 실제로 필요하지 않은 경우가 대부분이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2022-0030479호"}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 주문자들의 주문 이력에 기초하여 신경망 모델을 학습시키고, 해당 신경망 모델을 이용하여 주문자들 의 성별 및 나이에 따른 상품을 추천하는 것을 목적으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 인공지능을 이용한 발주서 기반의 상품 추천 방법은 학습용 발주서에 기재된 제1 주문자의 성명으로부터 상기 제1 주문자의 성별 및 나이를 추론하는 단계, 상기 제 1 주문자의 성별과 나이를 입력 데이터로 설정하고, 상기 학습용 발주서에 기재된 상품명의 상품 카테고리를 출 력 데이터로 설정하여 신경망 모델을 지도 학습(supervised learning)시키는 단계, 타겟 발주서에 기재된 제2 주문자의 성명으로부터 상기 제2 주문자의 성별 및 나이를 추론하는 단계 및 상기 제2 주문자의 성별과 나이를 상기 신경망 모델에 입력하여 상기 제2 주문자에 대한 상품을 추천하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 온라인 쇼핑몰이 고객들의 주문 이력에 기초하여 고객별로 상품을 추천해줄 수 있어 상품 판 매량을 증가시킬 수 있다. 또한 본 발명에 의하면, 주문자는 자신의 나이와 성별, 추가적으로 거주지역의 날씨에 따라 맞춤형 상품을 추천 받을 수 있다는 장점이 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용 하는 것으로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 또한, 본 명세서에서 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한, 본 명세서에서 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개재\"되거나, 각 구성요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 본 명세서에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B를 의미하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 본 발명은 발주서에 기재된 정보와, 발주서로부터 추론된 주문자의 성별과 나이에 기초하여 상품을 추천하는 방 법에 관한 것이다. 이하, 도 1 내지 도 9를 참조하여, 본 발명의 일 실시예에 따른 인공지능을 이용한 발주서 기반의 상품 추천 방법(이하, 상품 추천 방법)을 구체적으로 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른 상품 추천 시스템을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 상품 추천 방법을 도시한 도면이다. 도 3은 본 발명의 일 실시예에 따른 발주서를 도시한 도면이고, 도 4는 도 3에 도시된 발주서로부터 주문자의 성별 및 나이를 추론하는 방법을 설명하기 위한 도면이다. 또한, 도 5는 일 실시예에 따른 신경망 모델의 학습 과정을 설명하기 위한 도면이다. 도 6은 본 발명의 다른 실시예에 따른 발주서를 도시한 도면이고, 도 7은 도 6에 도시된 발주서로부터 주문자의 성별 및 나이를 추론하는 방법을 설명하기 위한 도면이다. 또한, 도 8은 다른 실시예에 따른 신경망 모델의 학 습 과정을 설명하기 위한 도면이다. 도 9는 타겟 발주서에 기반한 상품 추천 과정을 설명하기 위한 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 상품 추천 시스템은 상호 무선 데이터 통신을 수행할 수 있는 서버와 사용자 단말을 포함할 수 있다. 도 1에서는 설명의 편의를 위해 하나의 사용자 단말만을 도 시하였으나, 서버는 다수의 사용자 단말에 대해 후술하는 동작을 각각 수행할 수 있다. 서버는 본 발명의 상품 추천 방법을 수행하는 주체로서, 각각의 동작을 위해 적어도 하나의 연산 장치를 포 함할 수 있고 예컨대, ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서(processor), 마이크로 프로세서(micro-processor), 제어기(controller), 마이크로 컨 트롤러(micro-controllers) 중 적어도 하나의 물리적인 요소를 포함할 수 있다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 상품 추천 방법은 학습용 발주서로부터 주문자의 성별 및 나이를 추론하는 단계(S10), 성별과 나이를 입력 데이터로 설정하고, 학습용 발주서에 기재된 상품의 카테 고리를 출력 데이터로 설정하여 신경망 모델을 지도 학습(supervised learning)시키는 단계(S20), 타겟 발 주서에 기재된 주문자의 성별 및 나이를 추론하는 단계(S30) 및 추론된 성별과 나이를 기 학습된 신경망 모델에 입력하여 상품을 추천하는 단계(S40)를 포함할 수 있다. 다만, 도 2에 도시된 상품 추천 방법을 일 실시예에 따른 것이고, 발명을 이루는 각 단계들이 도 2에 도시된 실 시예에 한정되는 것은 아니며, 필요에 따라 일부 단계들이 부가, 변경 또는 삭제될 수 있다. 이하, 도 2에 도시된 각 단계들을 구체적으로 설명하도록 한다. 한편, 설명의 편의를 위해 신경망 모델의 학습에 이용되는 발주서를 학습용 발주서로, 학습이 완료된 신경망 모델에 입력되는 발주서를 타겟 발주서로 구분하도록 하며, 학습용 발주서에 기재된 주문자를 제1 주문자로, 타겟 발주서에 기재된 주문자 를 제2 주문자로 구분하도록 한다. 또한, 이하에서는 설명의 편의를 위해 본 발명의 동작을 제1 및 제2 실시예로 분리 설명하나, 어느 한 실시예에 서 설명되는 서버의 개별 동작은 다른 한 실시예에도 적용될 수 있음은 당연하다. <제1 실시예> 서버는 학습용 발주서에 기재된 제1 주문자의 성명으로부터 제1 주문자의 성별 및 나이를 추론할 수 있다(S10). 서버는 후술하는 신경망 모델의 학습을 위해 다수의 발주서를 외부에서 획득할 수 있다. 예를 들 어, 서버는 인터넷 크롤링(crawling)을 통해 발주서를 수집할 수도 있고, 온라인 쇼핑몰로부터 발주서 를 구매할 수도 있다. 학습용 발주서는 주문자의 성명을 포함한 상품 주문에 관한 사항들이 기재된 문서일 수 있고, 온라인 쇼핑 몰, 예컨대 오픈 마켓이나 폐쇄몰(특정 권한을 가진 회원들만 접근 가능한 비노출 쇼핑몰)에서 생성되는 문서일 수 있다. 도 3을 참조하면, 일 예에서 학습용 발주서는 주문번호, 주문시간, 주문자명, 연락처, 주소, 결제수단, 결 제금액 및 상품명을 포함할 수 있다. 서버는 학습용 발주서에서 주문자의 성명('고승민')을 식별할 수 있고, 이로부터 주문자의 성별 및 나이를 추론할 수 있다. 구체적으로, 서버는 학습용 발주서에서 식별된 성명에서 이름만을 분리 추출할 수 있고, 추출된 이름 을 출생자 이름 통계 데이터와 비교하여 이름에 대응하는 출생년도와 성별을 식별할 수 있다. 여기서 출생자 이 름 통계 데이터는 연도별로 출생신고된 이름과 각 이름별 빈도수가 취합된 데이터일 수 있고, 통계청이나 법원 의 전자가족관계등록 시스템에서 수집된 데이터일 수 있다. 도 3 및 도 4를 함께 참조하면, 서버는 학습용 발주서에서 식별된 '고승민'에서 '승민'만을 분리할 수 있고, 분리된 이름을 출생자 이름 통계 데이터에 검색할 수 있다. 검색 결과 '승민'의 이름을 가진 남녀 비율은 95:5로 확인되므로, 서버는 제1 주문자의 성별을 성비가 더 높은 남성으로 식별할 수 있다. 한편, 서버는 출생자 이름 통계 데이터에 기초하여 '승민' 이름으로 출생신고된 연도별 사람수를 식별할 수 있다. 서버는 연도별 사람수에 기초하여 제1 주문자의 출생년도를 추론할 수 있고, 이에 기초하여 제1 주문 자의 나이를 산출할 수 있다. 일 실시예에서, 서버는 출생자 이름 통계 데이터에서 이름이 가장 많이 등장한 출생년도를 식별하고, 출생 년도에 기초하여 제1 주문자의 나이를 산출할 수 있다. 도 4의 예시에서 '승민'은 2010년도에 가장 많이 등장하 였으므로, 서버는 제1 주문자의 출생년도를 2010년으로 식별할 수 있고, 현재 시점인 2022년을 기준으로 제 1 주문자의 나이를 12살로 산출할 수 있다. 앞서 설명한 것과 같이 제1 주문자의 성별과 나이가 추론되면, 서버는 추론된 성별과 나이를 입력 데이터로 설정하고, 학습용 발주서에 기재된 상품명의 상품 카테고리를 출력 데이터로 설정하여 신경망 모델을 지도 학습시킬 수 있다(S20). 본 발명에서 신경망 모델은 입력 데이터와 출력 데이터 간의 상관관계를 학습할 수 있는 임의의 예측 (prediction) 모델일 수 있고, 예컨대 입력층(input latyer), 복수의 은닉층(hidden layer) 및 출력층(output layer)을 포함하는 다층 퍼셉트론(Multi-Layer Perceptron; MLP)으로 구현될 수 있다. 서버는 단계(S10)에서 추론된 성별과 나이를 입력 데이터로 하고, 학습용 발주서에 기재된 상품명의 상품 카테고리를 출력 데이터로 하는 훈련 데이터셋(training dataset)에 기초하여 신경망 모델을 지도 학 습시킬 수 있다. 한편, 신경망 모델의 출력 데이터를 설정함에 있어서, 상품명과 상품 카테고리는 다르게 표현될 수 있고, 학습용 발주서에는 상품 카테고리가 포함되지 않을 수 있다. 이 때, 서버는 상품명에 기초하여 상품 카테고리를 식별해낼 수 있다. 일 예에서, 서버는 상품명을 복수의 형태소로 분리하고, 복수의 형태소 중 상품 카테고리를 식별하여 이를 신경망 모델의 출력 데이터로 설정할 수 있다. 다시 도 3을 참조하면, 서버는 상품명인 '퍼피 수면양말'을 '퍼피', '수면' 및 '양말'의 형태소로 분리할 수 있다. 서버의 데이터베이스에는 아래 [표 1]과 같은 상품 카테고리의 명칭이 미리 저장될 수 있고, 서버 는 분리된 형태소 중에서 상품 카테고리, 즉 '양말'을 식별할 수 있다. 표 1 1차 카테고리 2차 카테고리 패션 시계 패션 패션잡화/소품액세서리 모자 액세서리 선글라스/안경테 액세서리 양말 액세서리 스카프 액세서리 손수건 액세서리 넥타이 화장품/미용 스킨케어 화장품/미용 헤어케어 화장품/미용 바디케어 화장품/미용 향수 도 5를 참조하면, 서버는 단계(S10)에서 식별된 제1 주문자의 성별(남성)과 나이(12살)를 신경망 모델(20 0)의 입력 데이터로 설정하고, '퍼피 수면양말'의 상품 카테고리인 '양말'을 신경망 모델의 출력 데이터로 설정하여, 신경망 모델을 지도 학습시킬 수 있다. 이러한 지도 학습은 모든 학습용 발주서에 대해 수행될 수 있고, 지도 학습에 따라 신경망 모델은 주 문자의 성별 및 나이와, 상품의 카테고리 간의 상관관계를 학습할 수 있다. 학습이 완료된 이후 신경망 모델 은 학습에 이용되지 않은 발주서에서 추론된 주문자의 성별 및 나이를 입력받아 상품 카테고리를 출 력할 수 있다. 즉, 동일한 성별과 세대의 사람들은 유사한 카테고리의 상품을 찾고 구매하는 것이 일반적인 점에 착안하여, 본 발명은 주문자들의 성별/나이와 상품 카테고리의 관계성을 신경망 모델에 학습시킬 수 있다. 전술한 바와 같이 신경망 모델의 학습이 완료되면, 서버는 상품 추천의 대상이 되는 타겟 발주서(10 0)를 사용자 단말로부터 획득할 수 있다. 이 때, 사용자 단말은 주문자의 단말일 수도 있고, 주문자가 제품을 주문한 오픈 마켓이나 폐쇄몰의 단말(서버를 포함)일 수도 있다. 서버는 타겟 발주서에 기재된 제2 주문자의 성명으로부터 제2 주문자의 성별 및 나이를 추론할 수 있 다(S30). 여기서 성별과 나이를 추론하는 방법은 본 실시예의 단계(S10)에서 설명한 것과 동일할 수 있다. 이어서, 서버는 제2 주문자의 성별과 나이를 앞서 학습된 신경망 모델에 입력하여 제2 주문자에 대한 상품을 추천할 수 있다(S40). 전술한 바와 같이 신경망 모델은 주문자의 성별 및 나이와, 주문 상품의 카테고리 간의 상관관계를 학습한 상태이므로, 서버가 신경망 모델에 제2 주문자의 성별 및 나이를 입력하면, 신경망 모델은 이에 대응하는 상품 카테고리를 출력할 수 있다. 서버는 신경망 모델에서 출력된 상품 카테고리를 사용자 단말에 제공할 수 있다. 예컨대, 사용자 단말이 오픈 마켓 서버인 경우, 오픈 마켓 서버는 주문자의 발주서를 서버로 송신한 뒤 서버 로부터 주문자에 대응하는 상품 카테고리를 수신할 수 있다. 이후, 오픈 마켓 서버는 주문자가 다시 오픈 마켓 에 접속하였을 때, 해당 주문자에게 앞서 수신된 상품 카테고리에 대응하는 상품들을 추천할 수 있다. 전술한 바와 같이, 본 발명에 의하면 온라인 쇼핑몰이 고객들의 주문 이력에 기초하여 고객별로 상품을 추천해 줄 수 있어 상품 판매량을 증가시킬 수 있다. <제2 실시예> 이하, 제2 실시예의 동작 중 제1 실시예에서 설명한 동작과 동일한 것에 대해서는 설명을 생략하도록 한다. 서버는 학습용 발주서로부터 제1 주문자의 나이를 추론할 수 있다(S10). 도 6을 예로 들어 설명하면, 서버는 학습용 발주서에서 식별된 '김수빈'에서 '수빈'만을 분리할 수 있고, 출생자 이름 통계 데이터 에 기초하여 '수빈' 이름으로 출생신고된 연도별 사람수를 식별할 수 있다. 일 실시예에서, 서버는 출생자 이름 통계 데이터에서 이름의 등장 빈도가 높은 순으로 미리 설정된 개수의 출생년도를 식별하고, 등장 빈도에 따라 출생년도를 가중 평균(weighted average)하고, 가중 평균값에 기초하여 나이를 산출할 수 있다. 도 7을 참조하면, 서버는 '수빈'의 등장 빈도가 높은 5개의 출생년도를 아래 [표 2]와 같이 식별할 수 있다. 표 2 출생년도 등장 빈도 2009 2240 2008 2103 2010 2097 2011 1821 2014 1609 이어서, 서버는 등장 빈도에 따라 출생년도를 아래 [수학식 1]과 같이 가중 평균할 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0010424", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "서버는 제1 주문자의 나이를 [수학식 1]에 따라 산출된 가중 평균값인 2010년(소수점 반올림)으로 식별할 수 있고, 현재 시점인 2022년을 기준으로 제1 주문자의 나이를 12살로 산출할 수 있다. 추가적으로 서버는 학습용 발주서에 기재된 주소의 날씨를 더 식별할 수 있다. 이를 위해 학습용 발주 서는 주소와 주문 시간을 포함할 수 있다. 도 6을 예로 들어 설명하면, 서버는 학습용 발주서에 기재된 주소와 주문 시간을 각각 식별할 수 있다. 이어서, 서버는 기상청 데이터에 기초하여 주문 시간에 해당 주소의 날씨를 식별할 수 있다. 즉, 서 버는 기상청 데이터를 참조하여 2022년 7월 22일에 대구광역시 수성구의 날씨를 식별할 수 있다. 이 때, 날씨는 비, 구름, 바람, 기온 등 다양한 기상 데이터를 포함할 수 있는데, 이하에서는 설명의 편의를 위 해 서버가 기온을 식별하는 것으로 가정하도록 한다. 앞서 설명한 것과 같이 제1 주문자의 성별, 나이 및 기온이 식별되면, 서버는 성별, 나이 및 기온을 입력 데이터로 설정하고, 학습용 발주서에 기재된 상품명의 상품 카테고리를 출력 데이터로 설정하여 신경망 모 델을 지도 학습시킬 수 있다(S20). 한편, 신경망 모델의 출력 데이터를 설정함에 있어서, 상품명과 상품 카테고리는 다르게 표현될 수 있고, 학습용 발주서에는 상품 카테고리가 포함되지 않을 수 있다. 이 때, 서버는 상품명에 기초하여 상품 카테고리를 식별해낼 수 있다. 일 예에서, 서버는 상품명을 복수의 형태소로 분리하고, 복수의 형태소를 상품 카테고리별 상품목록과 비교 하여 상품명에 대응하는 상품 카테고리를 식별하여 이를 신경망 모델의 출력 데이터로 설정할 수 있다. 다시 도 6을 참조하면, 서버는 상품명인 '바니뽀송 데오드란트'를 '바니', '뽀송' 및 '데오드란트'의 형태 소로 분리할 수 있다. 서버의 데이터베이스에는 아래 [표 3]과 같은 상품 카테고리별 상품목록이 미리 저장 될 수 있고, 서버는 분리된 형태소를 상품목록으로 포함하는 상품 카테고리, 즉 '바디케어'를 식별할 수 있 다. 표 3 상품 카테고리 상품목록 바디케어 바디로션 바디오일 핸드크림 바디크림 데오드란트 바디미스트 바디워시 바디스크럽 도 8을 참조하면, 서버는 앞서 식별된 제1 주문자의 성별(여성)과 나이(12살)에 더하여 기온(34OC)을 신경 망 모델의 입력 데이터로 설정하고, '바니뽀송 데오드란트'의 상품 카테고리인 '바디케어'를 신경망 모델 의 출력 데이터로 설정하여, 신경망 모델을 지도 학습시킬 수 있다. 즉, 동일한 성별과 세대의 사람들은 같은 환경에서 유사한 카테고리의 상품을 찾고 구매하는 것이 일반적인 점 에 착안하여, 본 발명은 주문자들의 성별, 나이 및 상품 주문 지역의 날씨와, 상품 카테고리의 관계성을 신경망 모델에 학습시킬 수 있다. 신경망 모델의 학습이 완료되면 서버는 타겟 발주서를 사용자 단말로부터 획득하고, 이로부 터 제2 주문자의 성별 및 나이를 추론할 수 있고, 나아가 타겟 발주서에 기재된 주문 시간에 타겟 발주서 에 기재된 주소의 날씨를 더 식별할 수 있다. 여기서 성별 및 나이의 추론 방법과, 날씨 식별 방법은 전술 한 것과 동일할 수 있다. 이어서, 서버는 제2 주문자의 성별 및 나이와, 날씨를 앞서 학습된 신경망 모델에 입력하여 제2 주문 자에 대한 상품을 추천할 수 있다(S40). 전술한 신경망 모델은 성별, 나이 및 날씨와, 주문 상품의 카테고리 간의 상관관계를 학습한 상태이므로, 서버가 신경망 모델에 제2 주문자의 성별, 나이 및 주문 주소의 날씨를 입력하면, 신경망 모델은 이에 대응하는 상품 카테고리를 출력할 수 있다. 서버는 신경망 모델에서 출력된 상품 카테고리를 온라인 마켓 플랫폼에 검색하여 상품 리스트를 생성하고, 생성된 상품 리스트를 사용자 단말에 제공할 수 있다. 도 9를 예로 들어 설명하면, 사용자 단말이 주문자의 단말인 경우, 주문자는 자신의 발주서를 단말을 통해 서버로 송신할 수 있다. 서버는 발주서에서 주문자의 성별과 나이를 추론하고, 이를 신경망 모델에 입력하여 주문자 맞춤형 상품 카테고리, 예컨대 '선글라스'를 식별할 수 있다. 이어서, 서버는 상품 카테고리인 '선글라스'를 온라인 마켓 플랫폼에 검색할 수 있고, 온라인 마켓 플 랫폼에서 검색된 상품 리스트를 생성하고, 생성된 상품 리스트를 사용자 단말에 제공할 수 있다. 이에 따라, 주문자는 자신의 주문 내역에 기초하여 스스로 관심을 가질 만한 상품 리스트를 확인할 수 있다. 전술한 바와 같이, 본 발명에 의하면 주문자는 자신의 나이와 성별, 추가적으로 거주지역의 날씨에 따라 맞춤형 상품을 추천받을 수 있다는 장점이 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2023-0010424", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 상품 추천 시스템을 도시한 도면. 도 2는 본 발명의 일 실시예에 따른 상품 추천 방법을 도시한 도면. 도 3은 본 발명의 일 실시예에 따른 발주서를 도시한 도면. 도 4는 도 3에 도시된 발주서로부터 주문자의 성별 및 나이를 추론하는 방법을 설명하기 위한 도면. 도 5는 일 실시예에 따른 신경망 모델의 학습 과정을 설명하기 위한 도면. 도 6은 본 발명의 다른 실시예에 따른 발주서를 도시한 도면. 도 7은 도 6에 도시된 발주서로부터 주문자의 성별 및 나이를 추론하는 방법을 설명하기 위한 도면. 도 8은 다른 실시예에 따른 신경망 모델의 학습 과정을 설명하기 위한 도면. 도 9는 타겟 발주서에 기반한 상품 추천 과정을 설명하기 위한 도면."}
