{"patent_id": "10-2023-0066761", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0169264", "출원번호": "10-2023-0066761", "발명의 명칭": "인공지능에 기반하여 브랜드와 인플루언서를 매칭하는 브랜드-인플루언서 매칭방법", "출원인": "주식회사 먼프", "발명자": "김원민"}}
{"patent_id": "10-2023-0066761", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "브랜드 마케팅을 진행하고자 하는 광고주들 중 공동구매 마케팅을 의뢰하고자 하는 제1 광고주에 대응하는 제1광고주 계정이 로그인된 제1 광고주 단말로부터 상기 제1 광고주의 마케팅 대상인 제1 브랜드에 대한 인플루언서 매칭 요청을 수신하는 단계;상기 인플루언서 매칭 요청에 응답하여, 상기 제1 브랜드가 복수의 브랜드 카테고리들 중 어느 브랜드 카테고리-상기 브랜드 카테고리는 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 적어도 하나를 포함함-에 속하는지 문의하고자 하는 브랜드 카테고리 문의 메시지를 상기 제1 광고주 단말로 전송하는 단계;상기 제1 광고주 단말로부터 상기 제1 브랜드에 대한 브랜드 카테고리 정보를 수신하는 단계;미리 선정된 복수의 국가들 중 상기 제1 브랜드를 마케팅하고자 하는 국가가 어느 국가인지 문의하고자 하는 국가 문의 메시지를 상기 제1 광고주 단말로 전송하는 단계;상기 제1 광고주 단말로부터 상기 제1 브랜드를 마케팅하고자 하는 국가 정보를 수신하는 단계;기 등록된 인플루언서들 중 상기 국가 정보에 대응하는 인플루언서들을 후보 인플루언서들로 선정하는 단계;상기 후보 인플루언서들 중 어느 하나의 후보 인플루언서가 업로드한 컨텐츠들로부터 컨텐츠 정보를 획득하는단계;상기 브랜드 카테고리 정보 및 상기 컨텐츠 정보에 기초하여 제1 입력 신호를 생성하고, 상기 생성된 제1 입력신호를 제1 인공신경망-상기 제1 인공신경망은 트레이닝 브랜드 카테고리 정보들, 트레이닝 컨텐츠 정보들, 제1출력 신호들 및 트레이닝 인플루언서 매칭 정보들에 기초하여 미리 학습됨-에 적용하여 제1 출력 신호를 생성하는 단계; 및상기 제1 출력 신호에 기초하여, 상기 후보 인플루언서 및 상기 제1 브랜드에 대응하는 인플루언서 매칭 정보를생성하고, 상기 후보 인플루언서들에 각각 대응하는 인플루언서 매칭 정보들에 기초하여 상기 후보 인플루언서들 중 어느 하나의 인플루언서를 상기 제1 브랜드에 매칭되는 인플루언서로 선정하는 인플루언서 선정 정보를생성하는 단계;를 포함하며,상기 컨텐츠 정보를 획득하는 단계는 상기 후보 인플루언서가 업로드한 컨텐츠의 수에 따라 각각의 상기 후보인플루언서에 대한 랭킹을 설정하며, 설정되는 랭킹이 설정된 값 이상인 후보 인플루언서에 대응하는 컨텐츠 정보를 획득하는 것을 특징으로 하는, 브랜드-인플루언서 매칭방법."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능에 기반하여 브랜드와 인플루언서를 매칭하는 브랜드-인플루언서 매칭방법이 개시된다. 본 발명에 따른 브랜드-인플루언서 매칭방법은, 미리 선정된 복수의 국가들 중 제1 브랜드를 마케팅하고자 하는 국가가 어느 국 가인지 문의하고자 하는 국가 문의 메시지를 제1 광고주 단말로 전송하며, 제1 광고주 단말로부터 제1 브랜드를 마케팅하고자 하는 국가 정보를 수신하고, 기 등록된 인플루언서들 중 국가 정보에 대응하는 인플루언서들을 후 보 인플루언서들로 선정하며, 후보 인플루언서들 중 어느 하나의 후보 인플루언서가 업로드한 컨텐츠들로부터 컨 텐츠 정보를 획득한다. 이때, 본 발명에 따른 브랜드-인플루언서 매칭방법은, 후보 인플루언서가 업로드한 컨텐 츠의 수에 따라 각각의 후보 인플루언서에 대한 랭킹을 설정하며, 설정되는 랭킹이 설정된 값 이상인 후보 인플 루언서에 대응하는 컨텐츠 정보를 획득한다."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 브랜드-인플루언스 매칭방법에 관한 것으로서, 보다 상세하게는 인공지능망 학습을 통해 브랜드의 컨 텐츠를 분석하고, 마케팅하고자 하는 브랜드에 매칭되는 인플루언서의 매칭정보를 검색하며, 검색되는 인플루언 서에 대한 랭킹정보를 산출하여 브랜드와 인플루언서를 매칭하는, 브랜드-인플루언서 매칭방법에 관한 것이다."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 유/무선 정보통신망이 빠르게 보급됨에 따라 정보통신망을 통해 정보 및 서비스를 제공하고 이를 향유하는 문화가 급속하게 정착되고 있으며, 이에 따라 텍스트, 이미지, 동영상 정보를 통하여 컨텐츠를 형성하고 제공하 는 기술이 급격하게 발전하고 있다. 최근 동영상 플랫폼, 인터넷 방송 플랫폼 및 포털 사이트 플랫폼 등의 미디어를 통해 패션, 생활용품, 뷰티 아 이템 등 각종 상품 정보를 공유하거나 검색하는 소비자들이 증가하고 있다. 또한, 자신만의 컨텐츠를 생산 및제작하고 업로드하는 인플루언서(Influencer)들이 등장하기 시작하였다. 이에 따라, 인플루언서를 통해 광고를 진행하는 새로운 광고유형이 등장하였다. 이러한 인플루언서를 마케팅에 활용하고자 하는 기업 또한 증가하고 있는 추세이다. 기업은 인플루언서를 이용한 마케팅을 통해 잠재고객을 확 보하고 마케팅을 진행할 수 있다. 상품을 마케팅하고자 하는 광고주는 효과적인 마케팅을 위해 인플루언서가 업로드하는 컨텐츠의 카테고리를 고 려하고 인플루언서가 보유한 팔로워가 몇 명인지 등을 고려하여 광고계약을 체결할 인플루언서를 선정하게 된다. 하지만, 광고주가 마케팅하고자 하는 브랜드에 매칭되는 인플루언서를 선정하는 것에는 어려운 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2015-0077574호 (공개일자: 2015.07.08)"}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위하여 창안된 것으로서, 인공지능망 학습을 통해 브랜드의 컨텐츠를 분석 하고, 마케팅하고자 하는 브랜드에 매칭되는 인플루언서의 매칭정보를 검색하며, 검색되는 인플루언서에 대한 랭킹정보를 산출하여 브랜드와 인플루언서를 매칭하는, 브랜드-인플루언서 매칭방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일실시예에 따르면, 장치에 의해 수행되는 방법에 있어서, 브랜드 마케팅을 진행하고자 하는 광고주들 중 공동 구매 마케팅을 의뢰하고자 하는 제1 광고주에 대응하는 제1 광고주 계정이 로그인된 제1 광고주 단말로부터 상 기 제1 광고주의 마케팅 대상인 제1 브랜드에 대한 인플루언서 매칭 요청을 수신하는 단계; 상기 인플루언서 매 칭 요청에 응답하여, 상기 제1 브랜드가 복수의 브랜드 카테고리들 중 어느 브랜드 카테고리-상기 브랜드 카테 고리는 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 적어도 하나를 포함함-에 속하는지 문의하고자 하는 브랜드 카테고리 문의 메시지를 상기 제1 광고주 단말로 전송하는 단계; 상기 제1 광고주 단말로부터 상기 제1 브랜드에 대한 브랜드 카테고리 정보를 수신하는 단계; 미리 선정된 복수의 국가들 중 상기 제1 브랜드를 마케팅하고자 하는 국가가 어느 국가인지 문의하고자 하는 국가 문의 메시지를 상기 제1 광고주 단말로 전송하 는 단계; 상기 제1 광고주 단말로부터 상기 제1 브랜드를 마케팅하고자 하는 국가 정보를 수신하는 단계; 기 등 록된 인플루언서들 중 상기 국가 정보에 대응하는 인플루언서들을 후보 인플루언서들로 선정하는 단계; 상기 후 보 인플루언서들 중 어느 하나의 후보 인플루언서가 업로드한 컨텐츠들로부터 컨텐츠 정보를 획득하는 단계; 상 기 브랜드 카테고리 정보 및 상기 컨텐츠 정보에 기초하여 제1 입력 신호를 생성하고, 상기 생성된 제1 입력 신 호를 제1 인공신경망-상기 제1 인공신경망은 트레이닝 브랜드 카테고리 정보들, 트레이닝 컨텐츠 정보들, 제1 출력 신호들 및 트레이닝 인플루언서 매칭 정보들에 기초하여 미리 학습됨-에 적용하여 제1 출력 신호를 생성하 는 단계; 및 상기 제1 출력 신호에 기초하여, 상기 후보 인플루언서 및 상기 제1 브랜드에 대응하는 인플루언서 매칭 정보를 생성하고, 상기 후보 인플루언서들에 각각 대응하는 인플루언서 매칭 정보들에 기초하여 상기 후보 인플루언서들 중 어느 하나의 인플루언서를 상기 제1 브랜드에 매칭되는 인플루언서로 선정하는 인플루언서 선 정 정보를 생성하는 단계를 포함할 수 있다. 상기 트레이닝 인플루언서 매칭 정보들은 상기 트레이닝 브랜드 카테고리 정보들 및 상기 트레이닝 컨텐츠 정보 들에 각각 대응하는 인플루언서 매칭 정보들이고, 상기 제1 출력 신호들은 상기 트레이닝 브랜드 카테고리 정보 들 및 상기 트레이닝 컨텐츠 정보들에 기초하여 생성된 제1 트레이닝 입력 신호들이 상기 제1 인공신경망에 적 용되어 생성된 출력 신호들이며, 상기 제1 인공신경망은 상기 제1 출력 신호들 및 상기 인플루언서 매칭 정보들 의 차이들에 기초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있다. 상기 제1 출력 신호를 생성하는 단계는 상기 컨텐츠 정보로부터 상기 국가 정보에 대응하는 미리 정의된 언어의 적어도 하나의 텍스트를 추출하는 단계: 상기 추출된 텍스트를 제2 인공신경망-상기 제2 인공신경망은 입력된텍스트를 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 어느 하나로 분류하는 인공지능모델이고, 제1 트레이닝 텍스트들, 제2 출력 신호들 및 트레이닝 텍스트 카테고리 정보들에 기초하여 미리 학습됨-으로 적용하 여 상기 컨텐츠 정보의 텍스트 카테고리 정보를 생성하는 단계; 상기 추출된 텍스트가 분류된 텍스트 카테고리 들 중에서 상기 텍스트가 분류된 텍스트 카테고리 각각이 차지하는 비율인 텍스트 카테고리 비율을 생성하는 단 계; 상기 텍스트 카테고리 비율에 기초하여 상기 후보 인플루언서의 상위 키워드 정보를 생성하는 단계; 상기 상위 키워드 정보를 기초로 상기 후보 인플루언서의 마케팅 카테고리 정보를 생성하는 단계; 상기 추출된 텍스 트를 제3 인공신경망-상기 제3 인공신경망은 입력된 텍스트를 공동구매, 광고, 협찬, 단순 선물 및 단순 글 중 어느 하나로 분류하는 인공지능모델이고, 제2 트레이닝 텍스트들, 제3 출력 신호들 및 트레이닝 마케팅 이력 정 보들에 기초하여 미리 학습됨-으로 적용하여 상기 추출된 텍스트의 마케팅 이력 정보를 생성하는 단계; 상기 추 출된 텍스트가 분류된 마케팅 이력 정보들 중에서 상기 텍스트가 분류된 마케팅 이력 정보 각각이 차지하는 비 율인 마케팅 이력 별 비율을 생성하는 단계; 상기 마케팅 이력 별 비율에 기초하여 상기 후보 인플루언서의 마 케팅 이력 등급 정보를 생성하는 단계; 상기 브랜드 카테고리 정보, 상기 마케팅 카테고리 정보 및 상기 마케팅 이력 등급 정보에 기초하여 상기 제1 입력 신호-상기 제1 입력 신호는 상기 브랜드 카테고리 정보에 대응하는 제1 값, 상기 마케팅 카테고리 정보에 대응하는 제2 값 및 상기 마케팅 이력 등급 정보에 대응하는 제3 값을 포 함하고, 상기 제1 인공신경망의 제1 입력 레이어는 상기 제1 값, 상기 제2 값 및 상기 제3 값에 각각 적용되는 입력 노드들을 포함함-를 생성하는 단계; 및 상기 제1 입력 신호를 상기 제1 인공신경망에 적용하여 상기 제1 출력 신호-상기 제1 출력 신호는 0과 1사이의 실수인 출력 값을 포함하고, 상기 제1 인공신경망의 제1 출력 레 이어는 상기 출력 값을 생성하는 출력 노드를 포함함-를 생성하는 단계를 포함할 수 있다. 상기 트레이닝 텍스트 카테고리 정보들은 상기 제1 트레이닝 텍스트들에 각각 대응하는 카테고리 정보들이고, 상기 제2 출력 신호들은 상기 제1 트레이닝 텍스트들이 상기 제2 인공신경망에 적용되어 생성된 출력 신호들이 며, 상기 제2 인공신경망은 상기 제2 출력 신호들 및 상기 트레이닝 텍스트 카테고리 정보들의 차이들에 기초하 여 생성된 트레이닝 에러들을 최소화하여 학습되고, 상기 트레이닝 마케팅 이력 정보들은 상기 제2 트레이닝 텍 스트들에 각각 대응하는 마케팅 이력 정보들이고, 상기 제3 출력 신호들은 상기 제2 트레이닝 텍스트들이 상기 제3 인공신경망에 적용되어 생성된 출력 신호들이며, 상기 제3 인공신경망은 상기 제3 출력 신호들 및 상기 트 레이닝 마케팅 이력 정보들의 차이들에 기초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있다. 상기 제1 브랜드에 매칭되는 인플루언서의 인플루언서 선정 정보를 생성하는 단계는 상기 후보 인플루언서의 컨 텐츠 정보 중에서 공동구매에 해당하는 공동구매 컨텐츠들을 획득하는 단계; 상기 획득된 공동구매 컨텐츠들 중 에서 현재 시점을 기준으로 최근에 순서대로 게시된 제1 공동구매 컨텐츠, 제2 공동구매 컨텐츠 및 제3 공동구 매 컨텐츠를 추출하는 단계; 상기 제1 공동구매 컨텐츠, 상기 제2 공동구매 컨텐츠 및 상기 제3 공동구매 컨텐 츠에 각각 대응하는 제1 공동구매 제품 정보, 제2 공동구매 제품 정보 및 제3 공동구매 제품 정보를 획득하는 단계; 상기 제1 공동구매 제품 정보에 대응하는 제1 공동구매 제품의 판매량이 상기 제1 공동구매 컨텐츠의 게 시 시점 이전 대비 이후의 상승한 비율인 제1 판매 상승율을 획득하는 단계; 상기 제1 공동구매 제품의 카테고 리가 상기 제1 브랜드의 브랜드 카테고리 정보와 일치하는지 여부에 대한 정보인 제1 공동구매 제품 카테고리 일치 여부 정보를 생성하는 단계; , 상기 은 상기 후보 인플루언서 c1에 대응하는 랭킹 정보이고, 상기 는 상기 c1에 대응하는 상기 매칭 정보이면서 0~1 사이의 실수 값이고, 상기 , , 및 은 미리 정의된 가중치들이고, 이며, 상기 는 상기 제1 공동구매 컨텐츠 c11의 상기 제1 공동구매 제품 카테고리 일치 여부 정보로서 미리 정의된 2개의 상수 중 어느 하나이고, 상기 는 상기 제2 공동구매 컨텐츠 c12의 제2 공 동구매 제품 카테고리 일치 여부 정보로서 상기 2개의 상수 중 어느 하나이고, 상기 는 상기 제3 공동구매 컨텐츠 c13의 제3 공동구매 제품 카테고리 일치 여부 정보로서 상기 2개의 상수 중 어느 하나이고, 상기 는 상기 c11의 상기 제1 판매 상승율이고, 상기 는 상기 c12의 제2 판매 상승율이고, 상기 는 상기 c13의 제3 판매 상승율이고, 상기 수학식 1을 이용하여 상기 후보 인플루언서 c1의 랭킹 정보를 생성하는 단계; 상기 후보 인플루언서들에 각각 대응하는 랭킹 정보들을 생성하는 단계; 및 상기 후보 인플루언서들의 상기 랭킹 정보들에 기초하여, 상기 후보 인플루언서들 중 어느 하나의 인플루언서를 상기 제1 브랜드에 매칭되는 인플루언 서로 선정하는 인플루언서 선정 정보를 생성하는 단계를 포함할 수 있다. 상기 장치에 의해 수행되는 방법은 상기 기 등록된 인플루언서들 중 공동구매 마케팅을 진행하고자 하는 제1 인 플루언서가 업로드한 컨텐츠들로부터 상기 컨텐츠 정보를 획득하는 단계; 상기 컨텐츠 정보로부터 텍스트를 추 출하고, 상기 추출된 텍스트를 상기 제3 인공신경망으로 적용하여 상기 추출된 텍스트의 상기 마케팅 이력 정보 를 생성하는 단계; 상기 공동구매, 상기 광고, 상기 협찬, 상기 단순 선물 및 상기 단순 글에 대한 각각의 마케 팅이력 별 비율에 기초하여 제1 인플루언서가 업로한 컨텐츠들 중 어느 하나인 제1 컨텐츠를 업로드한 시점인 제1 시점에서의 상기 제1 인플루언서의 상기 마케팅 이력 등급 정보를 생성하는 단계; 상기 컨텐츠 정보로부터 상기 제1 시점부터 미리 정의된 기간인 제1 기간이 지난 시점인 제2 시점에서의 상기 제1 인플루언서가 업로드 한 컨텐츠의 업로드 횟수를 산출하는 단계; 상기 제2 시점에서의 상기 제1 인플루언서가 판매한 상기 제1 제품 에 대한 판매량을 산출하는 단계; 상기 제2 시점에서의 상기 제1 인플루언서의 팔로워 수를 획득하는 단계; 상 기 제1 시점에서의 상기 제1 인플루언서의 상기 마케팅 이력 등급 정보, 상기 제2 시점에서의 상기 컨텐츠 업로 드 횟수, 상기 제2 시점에서의 상기 제1 제품에 대한 판매량 및 상기 제2 시점에서의 상기 제1 인플루언서의 상 기 팔로워 수를 기초로 제4 입력 신호를 생성하고, 상기 생성된 제4 입력 신호를 제4 인공신경망에 적용하여 상 기 제2 시점에서의 상기 제1 인플루언서의 제2 마케팅 이력 등급을 생성하는 단계; 및 상기 제2 마케팅 이력 등 급을 상기 제1 인플루언서의 상기 마케팅 이력 등급으로 업데이트하여 저장하는 단계를 더 포함할 수 있다. 상기 장치에 의해 수행되는 방법은 상기 제1 브랜드에 대한 상기 생성된 인플루언서 매칭 정보를 상기 제1 광고 주 단말로 전송하는 단계; 상기 제1 광고주 단말로부터 상기 제1 브랜드의 브랜드 마케팅을 진행하는 것으로 선 정된 최종 인플루언서에 대한 정보를 수신하는 단계; 상기 최종 인플루언서가 상기 제1 인플루언서인 경우, 상 기 제1 인플루언서에 대응하는 제1 사용자 단말로 상기 제1 브랜드에 대한 공동구매 마케팅 요청 메시지를 전송 하는 단계; 상기 제1 인플루언서가 상기 제1 브랜드에 대한 공동구매 마케팅 요청을 승인한 경우, 상기 제1 사 용자 단말로 상기 공동구매 마케팅의 진행이 가능한 상기 제1 브랜드의 제품 목록을 전송하는 단계: 상기 제1 인플루언서가 상기 제1 브랜드의 제품 목록으로부터 공동구매를 진행하기로 제1 제품을 선정한 경우, 상기 제1 제품의 기존 판매 가격보다 저렴한 가격으로 상기 제1 제품의 샘플을 구매가능한 샘플 구매 페이지를 상기 제1 사용자 단말로 전송하는 단계; 상기 제1 사용자 단말로부터 상기 제1 제품의 공동구매 마케팅 승인 메시지를 수 신하는 단계; 상기 제1 제품의 공동구매 마케팅 승인 메시지에 응답하여, 상기 제1 제품의 공동구매 마케팅을 위한 상세페이지인 제1 컨텐츠를 직접 제작할 것인지 여부에 대한 컨텐츠 제작 문의 메시지를 상기 제1 사용자 단말로 전송하는 단계; 상기 제1 인플루언서가 제1 컨텐츠를 직접 제작하겠다는 메시지를 수신한 경우, 상기 제 1 사용자 단말로부터 제작된 상기 제1 컨텐츠를 수신하는 단계; 상기 제1 인플루언서가 제1 컨텐츠를 직접 제작 하지 않겠다는 메시지를 수신한 경우, 상기 제1 사용자 단말로부터 상기 제1 제품에 대한 사진, 동영상, 및 사 용 후기글을 획득하는 단계; 상기 제1 제품의 상세페이지에 대한 미리 제작된 제1 템플릿에 상기 제1 제품에 대 한 사진, 동영상, 및 사용 후기글을 적용하여 상기 제1 컨텐츠를 제작하는 단계: 및 상기 제작된 제1 컨텐츠 및 상기 제1 제품을 공동구매 방식으로 판매할 수 있도록 생성된 판매 페이지를 연결한 링크를 상기 제1 사용자 단 말로 전송하는 단계를 더 포함할 수 있다. 상기 장치에 의해 수행되는 방법은 상기 제작된 제1 컨텐츠 및 상기 제1 제품을 공동구매 방식으로 판매할 수 있도록 상기 판매 페이지를 연결한 링크를 생성하는 단계; 상기 생성된 링크를 상기 제1 사용자 단말로 전송하 는 단계; 상기 제1 사용자 단말에 의해 등록된 상기 링크의 접속을 통해 상기 제1 기간 동안의 제품 주문 내역 을 수신하는 단계; 상기 제품 주문 내역으로부터 상기 제1 제품에 대한 판매량을 산출하는 단계; 미리 설정된 판매량 1개당 보상하는 금액에 상기 제1 제품에 대한에 판매량을 반영하여 상기 제1 인플루언서의 판매 정산금 을 산출하는 단계; 상기 제1 기간 동안의 상기 링크의 접속 내역을 획득하여, 상기 링크의 조회수를 산출하는 단계; 미리 설정된 조회수 기준에 따라 조회수 등급을 설정하여, 상기 제1 인플루언서의 조회수 등급을 선정하 는 단계; 상기 선정된 조회수 등급에 대응하는 조회수 가중치를 생성하고, 상기 생성된 조회수 가중치를 상기 판매 정산금에 적용하여, 상기 제1 인플루언서의 총 정산금을 산출하는 단계; 및 상기 산출된 총 정산금을 안내 하는 메시지인 정산금 안내 메시지를 상기 제1 사용자 단말로 전송하는 단계를 더 포함할 수 있다. 상기 장치에 의해 수행되는 방법은 상기 기 등록된 인플루언서들 중 공동구매 마케팅을 진행하고자 하는 제1 인 플루언서의 제1 사용자 단말로부터 브랜드 매칭 요청 메시지를 수신하는 단계; 상기 브랜드 매칭 요청 메시지에 응답하여, 상기 미리 선정된 복수의 국가들 중 상기 제1 인플루언서가 사용 가능한 국가의 언어가 어느 국가인 지 문의하고자 하는 언어 문의 메시지를 상기 제1 사용자 단말로 전송하는 단계; 상기 제1 사용자 단말로부터 상기 제1 인플루언서가 사용 가능한 언어를 사용하는 상기 국가 정보를 수신하는 단계; 상기 제1 사용자 단말로부터 선정된 상기 브랜드 카테고리들 중 적어도 하나의 상기 브랜드 카테고리 정보를 수신하는 단계; 상기 국가 정보 및 상기 브랜드 카테고리 정보에 기초하여 제5 입력 신호를 생성하고, 상기 생성된 제5 입력 신호를 제5 인공신경망- 상기 제5 인공신경망은 상기 트레이닝 브랜드 카테고리 정보들, 트레이닝 국가 정보들, 제5 출력 신호들 및 트레이닝 브랜드 매칭 정보들에 기초하여 미리 학습됨-에 적용하여 제5 출력 신호를 생성하는 단계; 상기 제5 출력 신호에 기초하여 상기 제1 인플루언서에 대응하는 브랜드 매칭 정보를 생성하는 단계; 및 상기 생성된 브랜드 매칭 정보를 상기 제1 사용자 단말로 전송하는 단계를 더 포함할 수 있다. 상기 트레이닝 브랜드 매칭 정보들은 상기 트레이닝 브랜드 카테고리 정보들 및 상기 트레이닝 국가 정보들에 각각 대응하는 브랜드 매칭 정보들이고, 상기 제5 출력 신호들은 상기 트레이닝 브랜드 카테고리 정보들 및 상 기 트레이닝 국가 정보들에 기초하여 생성된 제5 트레이닝 입력 신호들이 상기 제5 인공신경망에 적용되어 생성 된 출력 신호들이며, 상기 제5 인공신경망은 상기 제5 출력 신호들 및 상기 브랜드 매칭 정보들의 차이들에 기 초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있다. 상기 장치에 의해 수행되는 방법은 상기 제1 기간 동안의 상기 링크의 접속 내역을 획득하여, 상기 링크의 조회 수를 산출하는 단계; 상기 제1 기간 동안의 상기 링크의 조회수가 미리 설정된 기준 조회수 이하인지 여부를 판 단하는 단계; 상기 제1 기간 동안의 상기 링크의 조회수가 상기 기준 조회수 이하인 경우, 상기 제1 제품에 대 한 공동구매 마케팅을 정지하는 것에 대한 마케팅 정지 안내 메시지를 상기 제1 사용자 단말로 전송하는 단계; 및 상기 제1 기간 동안의 상기 링크의 조회수가 상기 기준 조회수 이상인 경우, 상기 제1 제품에 대한 홍보 효 과를 높일 수 있는 미리 설정된 키워드들에 대한 홍보 효과 메시지를 상기 제1 사용자 단말로 전송하는 단계를 더 포함할 수 있다. 상기 장치에 의해 수행되는 방법은 상기 제1 사용자 단말이 공동구매 마케팅 컨텐츠를 제공하는 웹 사이트에 접 속하면, 상기 웹 사이트의 홈 페이지를 상기 제1 사용자 단말로 제공하고, 상기 제1 사용자 단말에 대응하는 제 1 사용자 계정을 확인하여 제1 사용자 정보를 획득하는 단계; 상기 홈 페이지 상에서 공동구매 마케팅 컨텐츠 중 어느 하나인 제1 컨텐츠의 대표 이미지가 클릭되면, 상기 제1 사용자 단말로부터 상기 제1 컨텐츠에 대한 조 회 요청을 수신하고, 상기 제1 컨텐츠를 확인하여 제1 컨텐츠 정보를 획득하는 단계; 상기 제1 컨텐츠 정보를 통해 상기 제1 컨텐츠의 사용자 조회 내역을 획득하는 단계; 상기 제1 컨텐츠의 사용자 조회 내역을 기초로, 사 용자 별로 정독 시간을 확인하여, 상기 제1 컨텐츠의 평균 정독 시간을 산출하는 단계; 상기 제1 컨텐츠의 평균 정독 시간의 길이에 따라, 기준치를 설정하는 단계; 상기 제1 컨텐츠의 평균 정독 시간에서 상기 기준치를 차감 한 값으로, 사용자 허용 범위의 최소 시간을 산출하는 단계; 상기 제1 컨텐츠의 평균 정독 시간에 상기 기준치 를 가산한 값으로, 상기 사용자 허용 범위의 최대 시간을 산출하는 단계; 상기 사용자 허용 범위의 최소 시간 및 상기 사용자 허용 범위의 최대 시간을 기초로, 상기 사용자 허용 범위를 설정하는 단계; 상기 제1 인플루언 서에 대응하는 제1 사용자 정보 및 상기 제1 컨텐츠 정보를 기초로, 상기 제1 컨텐츠에 대한 제1 사용자의 정독 시간을 예측하는 단계; 상기 제1 사용자의 정독 시간이 상기 사용자 허용 범위 내에 포함되는 것으로 확인되면, 상기 제1 컨텐츠를 상기 제1 사용자 단말로 제공하는 단계; 상기 제1 사용자의 정독 시간이 상기 사용자 허용 범위를 벗어나는 것으로 확인되고, 상기 제1 사용자의 정독 시간이 상기 사용자 허용 범위의 최소 시간 보다 짧 은 것으로 확인되면, 제2 컨텐츠-상기 제2 컨텐츠는 상기 제1 컨텐츠와 주제가 동일하면서 상기 제1 컨텐츠 보 다 많은 글자 수로 구성된 컨텐츠-에 대한 추천 정보를 상기 제1 사용자 단말로 제공하는 단계; 및 상기 제1 사 용자의 정독 시간이 상기 사용자 허용 범위를 벗어나는 것으로 확인되고, 상기 제1 사용자의 정독 시간이 상기 사용자 허용 범위의 최대 시간 보다 긴 것으로 확인되면, 제3 컨텐츠-상기 제3 컨텐츠는 상기 제1 컨텐츠와 주 제가 동일하면서 상기 제1 컨텐츠 보다 적은 글자 수로 구성된 컨텐츠-에 대한 추천 정보를 상기 제1 사용자 단 말로 제공하는 단계를 더 포함할 수 있다. 일실시예에 따른 장치는 하드웨어와 결합되어 상술한 방법들 중 어느 하나의 항의 방법을 실행시키기 위하여 매 체에 저장된 컴퓨터 프로그램에 의해 제어될 수 있다."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들은 인공지능을 기반으로 인플루언서 및 브랜드를 매칭시킬 수 있다. 실시예들은 인공신경망의 학습을 통해 브랜드와 인플루언서의 컨텐츠를 분석하여 마케팅하고자 하는 브랜드에 매칭되는 인플루언서 매칭 정보를 생성할 수 있다. 실시예들은 후보 인플루언서의 랭킹 정보를 산출하여 마케팅하고자 하는 브랜드에 매칭되는 인플루언서 선정 정 보를 생성할 수 있다."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 설명한다. 각 도면의 구성요소들에 참조부호를 기재함 에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호로 표시한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시 예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소 의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \" 접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결, 결합 또는 접속될 수 있지만, 그 구성 요소와 그 다른 구성요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해 되어야 할 것이다. 도 1은 일실시예에 따른 시스템의 구성을 설명하기 위한 도면이다. 도 1을 참조하면, 일실시예에 따른 시스템은 통신망을 통해 서로 통신 가능한 복수의 광고주 단말, 복수의 사용자 단말 및 장치(30_을 포함할 수 있다. 먼저, 통신망은 유선 및 무선 등과 같이 그 통신 양태를 가리지 않고 구성될 수 있으며, 서버와 서버 간의 통신 과 서버와 단말 간의 통신이 수행되도록 다양한 형태로 구현될 수 있다.복수의 광고주 단말 각각은 데스크탑 컴퓨터, 노트북, 태블릿, 스마트폰 등일 수 있다. 바람직하게, 도 1 에 도시된 바와 같이, 제1 광고주 단말, 제2 광고주 단말 등은 스마트폰일 수 있으며, 실시예에 따라 달리 채용될 수도 있다. 복수의 광고주 단말 각각은 통상의 컴퓨터가 가지는 연산 기능, 저장/참조 기능, 입출력 기능 및 제어 기능 을 전부 또는 일부 수행하도록 구성될 수 있다. 복수의 광고주 단말은 장치와 유무선으로 통신하도록 구성될 수 있다. 복수의 광고주 단말 각각은 장치를 이용하여 서비스를 제공하는 자 내지 단체가 운영하는 웹 페이지에 접속되거나, 장치를 이용하여 서비스를 제공하는 자 내지 단체가 개발·배포한 애플리케이션이 설치될 수 있다. 복수의 광고주 단말 각각은 웹 페이지 또는 애플리케이션을 통해 장치와 연동될 수 있다. 복수의 광고주 단말 각각은 장치에서 제공하는 웹 페이지, 애플리케이션을 등을 통해 장치에 접속 할 수 있다. 복수의 광고주 단말는 본 발명에 따른 광고주들이 사용하는 단말로, 브랜드를 마케팅하고자 하는 광고주들 이 사용하는 단말일 수 있다. 일실시예에 따르면, 복수의 광고주 단말은 공동구매 마케팅을 통해 브랜드를 마케팅하고자 하는 광고주들이 사용하는 단말일 수 있으며, 이에 한정되지는 않는다. 이하에서는 설명의 편의상, 제1 광고주 단말의 동작을 위주로 설명하지만, 제2 광고주 단말 등의 다른 광고주 단말에서 제1 광고주 단말의 동작을 대신 수행할 수 있는 것은 물론이다. 복수의 사용자 단말은 본 발명에 따른 브랜드 마케팅을 진행하는 인플루언서들이 사용하는 단말일 수 있다. 일실시예에 따르면, 복수의 사용자 단말은 공동구매 마케팅을 진행하여 광고주의 브랜드에 속하는 상품의 공동구매를 진행하여 브랜드 마케팅을 진행하는 인플루언서들이 사용하는 단말일 수 있으며, 이에 한정되지는 않는다. 예를 들어, 스마트폰과 같은 모바일 기기나 컴퓨터일 수 있으며, 제1 사용자가 사용하는 제1 사용자 단 말, 제2 사용자가 사용하는 제2 사용자 단말 등을 포함할 수 있다. 복수의 사용자 단말 각각은 통상의 컴퓨터가 가지는 연산 기능, 저장/참조 기능, 입출력 기능 및 제어 기능 을 전부 또는 일부 수행하도록 구성될 수 있다. 복수의 사용자 단말은 장치와 무선을 통해 통신하도록 구성될 수 있다. 복수의 사용자 단말 각각은 장치에서 제공하는 웹 사이트 등을 통해 장치에 접속할 수 있다. 이하에서는 설명의 편의상, 제1 광고주 단말 및 제1 사용자 단말의 동작을 위주로 설명하지만, 제2 광 고주 단말 등의 다른 광고주 단말에서 제1 광고주 단말의 동작을 대신 수행하고, 제2 사용자 단말 등의 다른 사용자 단말에서 제1 사용자 단말의 동작을 대신 수행할 수 있는 것은 물론이다. 장치는 장치를 이용하여 서비스를 제공하는 자 내지 단체가 보유한 자체 서버일수도 있고, 클라우드 서 버일 수도 있고, 분산된 노드(node)들의 p2p(peer-to-peer) 집합일 수도 있다. 장치는 통상의 컴퓨터가 가 지는 연산 기능, 저장/참조 기능, 입출력 기능 및 제어 기능을 전부 또는 일부 수행하도록 구성될 수 있다. 장 치는 추론 기능을 수행하는 적어도 하나 이상의 인공 신경망을 구비할 수 있다. 장치는 복수의 광고주 단말 및 복수의 사용자 단말과 유무선으로 통신하도록 구성될 수 있다. 장치는 인공지능을 기반으로 인플루언서 및 브랜드를 매칭하는 서비스를 제공할 수 있다. 이때, 인플루언서 매칭 서비스는 브랜드 마케팅을 의뢰하고자 하는 광고주의 인플루언서 매칭 요청을 통해 의뢰된 광고주가 소유 하는 브랜드에 매칭되는 인플루언서를 예측할 수 있다. 일실시예에 따르면, 장치 내에는 데이터베이스가 구비될 수 있으며, 이에 한정되지 않고, 장치와 별도 로 데이터베이스가 구성될 수 있다. 장치는 기계 학습 알고리즘의 수행을 위한 다수의 인공 신경망을 포함 할 수 있다. 한편, 설명의 편의를 위해 도 1에서는 복수의 광고주 단말 중 제1 광고주 단말 및 제2 광고주 단말(1 2)만을 도시하고, 복수의 사용자 단말 중 제1 사용자 단말 및 제2 사용자 단말만을 도시하였으나, 단말들의 수는 실시예에 따라 얼마든지 달라질 수 있다. 장치의 처리 용량이 허용하는 한, 단말들의 수는 특별한 제한이 없다. 도 2는 일실시예에 따른 인공지능 기반의 인플루언서 및 브랜드를 매칭하는 과정을 설명하기 위한 순서도이다. 도 2를 참조하면, 먼저 S201 단계에서, 장치는 제1 광고주 단말로부터 제1 광고주의 마케팅 대상인 제1 브랜드에 대한 인플루언서 매칭 요청을 수신할 수 있다. 이때, 제1 광고주 단말은 브랜드 마케팅을 진행하고자 하는 광고주들 중 공동구매 마케팅을 의뢰하고자 하 는 제1 광고주에 대응하는 제1 광고주 계정이 로그인된 제1 광고주 단말일 수 있다. 여기서, 제1 브랜드는 제1 광고주가 브랜드 마케팅하고자 하는 브랜드를 의미할 수 있다. 제1 브랜드는 제1 광고주가 소유한 브랜드일 수 있으나, 이에 한정되지는 않는다. S202 단계에서, 장치는 제1 브랜드가 복수의 브랜드 카테고리들 중 어느 브랜드 카테고리에 속하는지 문의 하고자 하는 브랜드 카테고리 문의 메시지를 제1 광고주 단말로 전송할 수 있다. 구체적으로, 장치는 제1 광고주 단말로부터 수신한 인플루언서 매칭 요청에 응답하여, 제1 브랜드가 복 수의 브랜드 카테고리들 중 어느 브랜드 카테고리에 속하는지 문의하고자 하는 브랜드 카테고리 문의 메시지를 제1 광고주 단말로 전송할 수 있다. 장치의 데이터베이스에는 브랜드가 속할 수 있는 복수의 브랜드 카테고리들에 대한 정보가 저장될 수 있다. 여기서, 복수의 브랜드 카테고리는 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 적어도 하나 이상을 포함할 수 있다. 복수의 브랜드 카테고리는 실시예에 따라 다르게 설정될 수 있다. S203 단계에서, 장치는 제1 광고주 단말로부터 제1 브랜드에 대한 브랜드 카테고리 정보를 수신할 수 있다. 구체적으로, 제1 광고주의 인플루언서 매칭 요청 수신 시, 장치는 제1 브랜드에 대한 정보 입력 페이지를 생성하여 제1 광고주 단말로 전송할 수 있으며, 정보 입력 페이지를 통해 제1 브랜드의 브랜드 카테고리에 대한 정보가 입력되면, 제1 광고주 단말로부터 제1 브랜드에 대한 브랜드 카테고리 정보를 획득할 수 있다. 일실시예에 따르면, 장치는 제1 광고주 단말로 제1 브랜드의 브랜드 카테고리 정보를 입력하기 위한 페 이지를 제공할 수 있다. 브랜드 카테고리 정보를 입력하기 위해 제공된 페이지를 통해 제1 브랜드에 대한 브랜 드 카테고리 정보가 입력되면, 장치는 제1 광고주 단말로부터 브랜드 카테고리 정보를 수신하고, 수신 된 브랜드 카테고리 정보를 제1 브랜드의 브랜드 카테고리 정보로 추출할 수 있다. 즉, 장치는 제1 브랜드가 복수의 브랜드 카테고리(뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행) 중 어느 카테고리에 속하는지에 대한 브랜드 카테고리 정보를 획득할 수 있다. S204 단계에서, 장치는 미리 선정된 복수의 국가들 중 제1 브랜드를 마케팅하고자 하는 국가가 어느 국가인 지 문의하고자 하는 국가 문의 메시지를 제1 광고주 단말로 전송할 수 있다. 장치의 데이터베이스에는 브랜드 마케팅이 가능한 것으로 선정된 복수의 국가들에 대한 정보가 저장될 수 있다. 여기서, 복수의 국가들은 한국, 미국, 일본, 중국, 러시아, 베트남 중 적어도 하나를 포함할 수 있다. 복 수의 국가들은 실시예에 따라 다르게 설정될 수 있다. S205 단계에서, 장치는 제1 광고주 단말로부터 제1 브랜드를 마케팅하고자 하는 국가 정보를 수신할 수 있다. 구체적으로, 제1 광고주의 인플루언서 매칭 요청 수신 시, 장치는 제1 브랜드에 대한 정보 입력 페이지를 생성하여 제1 광고주 단말로 전송할 수 있으며, 정보 입력 페이지를 통해 제1 브랜드를 마케팅하고자 하는 국가 정보가 입력되면, 제1 광고주 단말로부터 제1 브랜드를 마케팅하고자 하는 국가 정보를 획득할 수 있 다. 일실시예에 따르면, 장치는 제1 광고주 단말로 제1 브랜드를 마케팅하고자 하는 국가 정보를 입력하기 위한 페이지를 제공할 수 있다. 국가 정보를 입력하기 위해 제공된 페이지를 통해 제1 브랜드 대한 국가 정보가 입력되면, 장치는 제1 광고주 단말로부터 국가 정보를 수신하고, 수신된 국가 정보를 제1 브랜드의 국 가 정보로 추출할 수 있다. S206 단계에서, 장치는 기 등록된 인플루언서들 중 국가 정보에 대응하는 인플루언서들을 후보 인플루언서 들로 선정할 수 있다. *장치의 데이터베이스에는 브랜드 마케팅 활동이 가능한 인플루언서들이 저장될 수 있다. 구체적으로, 장치 는 장치의 데이터베이스의 기 등록된 인플루언서들 중에서 국가 정보에 대응하는 인플루언서들을 추출 하여 국가 정보에 대응하는 인플루언서들을을 후보 인플루언서들로 선정할 수 있다. 일실시예에 따르면, 국가 정보에 해당하는 국가가 제1 국가인 경우, 장치는 기 등록된 인플루언서들 중에서 제1 국가에서 활동하는 인플루언서들을 후보 인플루언서들로 선정할 수 있다. 또한, 장치는 기 등록된 인플루언서들의 팔로워들이 해당하는 국가의 비율 중에서 제1 국가에 해당하는 팔 로워들의 비율이 미리 정의된 비율 이상으로 보유하고 있는 인플루언서들을 후보 인플루언서들로 선정할 수 있 다. 또한, 장치는 기 등록된 인플루언서들이 등록한 컨텐츠들 중에서 제1 국가에서 사용하는 언어로 등록된 컨 텐츠들의 비율이 미리 정의된 비율 이상으로 컨텐츠를 등록한 인플루언서들을 후보 인플루언서들로 선정할 수 있다. 국가 정보에 대응하는 인플루언서들을 후보 인플루언서들로 선정하는 방법은 이에 한정되지 않으며, 실시예에 따라 상이하게 설정될 수 있다. S207 단계에서, 장치는 후보 인플루언서들 중 어느 하나의 후보 인플루언서가 업로드한 컨텐츠들로부터 컨 텐츠 정보를 획득할 수 있다. S208 단계에서, 장치는 브랜드 카테고리 정보 및 컨텐츠 정보에 기초하여 제1 입력 신호를 생성할 수 있다. S209 단계에서, 장치는 생성된 제1 입력 신호를 제1 인공신경망에 적용하여 제1 출력 신호를 생성할 수 있 다. 여기서, 장치는 트레이닝 브랜드 카테고리 정보들, 트레이닝 컨텐츠 정보들, 제1 출력 신호들 및 트레이닝 인플루언서 매칭 정보들을 획득하고, 이에 기초하여 제1 인공신경망을 미리 학습시킬 수 있다. 장치는 미리 학습된 제1 인공신경망에 제1 입력 신호를 적용하여 제1 출력 신호를 생성할 수 있다. 일실시예에 따르면, 장치는 트레이닝 브랜드 카테고리 정보들, 트레이닝 컨텐츠 정보들을 제1 인공신경망 에 적용하여 트레이닝 출력들을 획득할 수 있다. 장치는 트레이닝 출력들과 제1 출력 신호들 및 트레 이닝 인플루언서 매칭 정보들에 기초하여 제1 인공신경망을 학습시킬 수 있다. 장치는 미리 학습된 제 1 인공신경망에 제1 입력 신호를 적용하여 제1 출력 신호를 생성할 수 있다. 장치는 트레이닝 출력들과 제1 출력 신호들 및 트레이닝 인플루언서 매칭 정보들에 기초하여 제1 인공신경 망을 학습시킬 수 있다. 장치는 트레이닝 출력들에 대응하는 트레이닝 에러들을 계산하고, 그 트레이 닝 에러들을 최소화하기 위해 제1 인공신경망 내 노드들의 연결 관계를 최적화하여 제1 인공신경망을 학습시킬 수 있다. 장치는 학습이 완료된 제1 인공신경망을 이용하여 브랜드 카테고리 정보들, 컨텐츠 정보들로부터 인플루언서 매칭 정보을 추출할 수 있다. 제1 인공신경망의 학습하는 과정과 관련된 자세한 설명은 은 도 4를 참조하여 후술하기로 한다. 여기서, 트레이닝 인플루언서 매칭 정보들은 트레이닝 브랜드 카테고리 정보들 및 트레이닝 컨텐츠 정보들에 각 각 대응하는 인플루언서 매칭 정보들일 수 있다. 제1 출력 신호들은 트레이닝 브랜드 카테고리 정보들 및 트레 이닝 컨텐츠 정보들에 기초하여 생성된 제1 트레이닝 입력 신호들이 제1 인공신경망에 적용되어 생성된 출 력 신호들일 수 있다 S210 단계에서, 장치는 제1 출력 신호에 기초하여 후보 인플루언서 및 제1 브랜드에 대응하는 인플루언서 매칭 정보를 생성할 수 있다. 여기서, 인플루언서 매칭 정보는 후보 인플루언서 및 제1 브랜드의 매칭 정도로서, 0과 1사이의 실수 값일 수 있다. *S211 단계에서, 장치는 후보 인플루언서들에 각각 대응하는 인플루언서 매칭 정보들에 기초하여 후보 인플 루언서들 중 어느 하나의 인플루언서를 제1 브랜드에 매칭되는 인플루언서로 선정하는 인플루언서 선정 정보를 생성할 수 있다. 예를 들어, 장치는 후보 인플루언서들 각각 대응하는 인플루언서 매칭 정보들이 0.8, 0.2, 0.4인 경우, 0.8의 매칭 정보에 대응하는 인플루언서를 제1 브랜드에 매칭되는 인플루언서로 선정하는 인플루언 서 선정 정보를 생성할 수 있다. 도 3은 일실시예에 따른 인공지능 기반의 인플루언서 및 브랜드를 매칭하는 과정을 설명하기 위한 블록도이다. 장치는 제1 광고주 단말로부터 브랜드 카테고리 정보 및 컨텐츠 정보를 획득할 수 있다. 장치는 획 득한 브랜드 카테고리 정보 및 컨텐츠 정보에 기초하여 제1 입력 신호를 생성하고, 생성된 제1 입력 신호를 제1 인공신경망에 적용하여 제1 출력 신호를 생성할 수 있다. 여기서, 장치는 트레이닝 브랜드 카테고리 정보들 및 트레이닝 컨텐츠 정보들에 기초하여 제1 트레이닝 입 력 신호들을 생성하고, 제1 트레이닝 입력 신호들을 제1 인공신경망에 적용하여 제1 출력 신호들을 생성할 수 있다. 제1 출력 신호들을 생성하면, 장치는 제1 출력 신호에 기초하여 제1 브랜드에 대응하는 인플루언 서 매칭 정보를 생성할 수 있다. 도 4는 일실시예에 따른 제1 인공신경망의 학습을 설명하기 위한 도면이다. 도 4에 도시한 바와 같이, 장치는 인플루언서 매칭 정보의 추출을 위하여 제1 인공신경망을 학습시킬 수 있다. 제1 인공신경망은 트레이닝 샘플들이 입력되는 제1 입력 레이어와 트레이닝 출력들을 포함하는 제1 출력 레이어를 포함하고, 트레이닝 출력들과 레이블들 사이의 차이에 기초하여 학습될 수 있다. 여기서, 레이블들은 브랜드 카테고리 정보들, 컨텐츠 정보들에 대응하는 인플루언서 매칭 정보들에 기초하여 정의될 수 있다. 제1 인공신경망은 복수의 노드들의 그룹으로 연결되어 있고, 연결된 노드들 사이의 가중치들과 노드 들을 활성화시키는 활성화 함수에 의해 정의된다. 장치는 GD(Gradient Decent) 기법 또는 SGD(Stochastic Gradient Descent) 기법을 이용하여 제1 인공신경 망을 학습시킬 수 있다. 장치는 제1 인공신경망의 출력들 및 레이블들 의해 설계된 손실 함수 (Loss Function)를 이용할 수 있다. 장치는 미리 정의된 손실 함수를 이용하여 트레이닝 에러를 계산할 수 있다. 손실 함수는 레이블, 출력 및 파라미터를 입력 변수로 미리 정의될 수 있고, 여기서 파라미터는 제1 인공신경망 내 가중치들에 의해 설 정될 수 있다. 예를 들어, 손실 함수는 MSE(Mean Square Error) 형태, 엔트로피(entropy) 형태 등으로 설계될 수 있는데, 손실 함수가 설계되는 실시예에는 다양한 기법 또는 방식이 채용될 수 있다. 장치는 역전파(Backpropagation) 기법을 이용하여 트레이닝 에러에 영향을 주는 가중치들을 찾아낼 수 있다. 여기서, 가중치들은 제1 인공신경망 내 노드들 사이의 관계들이다. 장치는 역전파 기법을 통해 찾아낸 가중치들을 최적화시키기 위해 레이블들 및 출력들을 이용한 SGD 기법을 이용할 수 있다. 예를 들어, 장 치는 레이블들, 출력들 및 가중치들에 기초하여 정의된 손실 함수의 가중치들을 SGD 기법을 이용하여 갱신 할 수 있다. 일실시예에 따르면, 장치는 트레이닝 브랜드 카테고리 정보들 및 트레이닝 컨텐츠 정보들에 기초하여 제1 트레이닝 입력 신호들을 생성할 수 있다. 장치는 제1 트레이닝 입력 신호들로부터 제1 출력 신호들을 생성 할 수 있다. 일실시예에 따르면, 제1 인공신경망는 트레이닝 브랜드 카테고리 정보들, 트레이닝 컨텐츠 정보들, 제1 출 력 신호들 및 트레이닝 인플루언서 매칭 정보들에 기초하여 미리 학습될 수 있다. 제1 인공신경망는 제1 출력 신호들 및 트레이닝 인플루언서 매칭 정보들의 차이들에 기초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있다. 도 5는 일실시예에 따른 제1 입력 신호를 생성하는 과정을 설명하기 위한 개념도이다. 장치는 컨텐츠 정보로부터 국가 정보에 대응하는 미리 정의된 언어의 적어도 하나 이상의 텍스트를 추출할 수 있다. 일실시예에 따르면, 장치는 국가 정보가 제1 국가인 경우, 제1 국가에 대응되는 미리 정의된 언어 의 적어도 하나 이상의 텍스트를 추출할 수 있다. 장치는 텍스트를 단어의 단위로 추출할 수 있다. 장치는 추출된 텍스트를 제2 인공신경망에 적용하여 컨텐츠 정보의 텍스트 카테고리 정보를 생성할 수 있다. 여기서, 텍스트 카테고리 정보는 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 적어도 하나를 포함할 수 있다. 예를 들어, 장치는 컨텐츠 정보의 텍스트 카테고리 정보를 패션, 푸드 및 반려동물로 생성 할 수 있다. 여기서, 제2 인공신경망은 입력된 텍스트를 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 어느 하나로 분류하는 인공지능모델이고, 제1 트레이닝 텍스트들, 제2 출력 신호들 및 트레이닝 텍스트 카테고리 정 보들에 기초하여 미리 학습될 수 있다. 제2 인공신경망의 학습하는 과정과 관련된 자세한 설명은 은 도 7을 참조하여 후술하기로 한다. 장치는 추출된 텍스트가 분류된 텍스트 카테고리들 중에서 텍스트가 분류된 텍스트 카테고리 각각이 차지하 는 비율인 추출된 텍스트가 분류된 텍스트 카테고리 비율을 생성할 수 있다. 예를 들어, 추출된 텍스트가 분류 된 텍스트 카테고리들이 패션, 푸드 및 반려동물인 경우, 장치는 분류된 텍스트 카테고리들 증에서 패션, 푸드 및 반려동물이 각각 차지하는 텍스트 카테고리 비율을 생성할 수 있다. 장치는 텍스트 카테고리 비율에 기초하여 후보 인플루언서의 상위 키워드 정보를 생성할 수 있다. 예를 들 어 패션, 푸드 및 반려동물의 텍스트 카테고리 비율이 각각 60%, 25% 및 15%인 경우, 장치는 텍스트 카테고 리 비율이 가장 높은 패션으로 후보 인플루언서의 상위 키워드 정보를 생성할 수 있다. 장치는 생성된 상위 키워드 정보를 기초로 후보 인플루언서의 마케팅 카테고리 정보를 생성할 수 있다. 장치는 추출된 텍스트를 제3 인공신경망에 적용하여 컨텐츠 정보의 텍스트 마케팅 이력 정보를 생성할 수 있다. 여기서, 마케팅 이력 정보는 공동구매, 광고, 협찬, 단순 선물 및 단순 글 중 적어도 하나를 포함할 수 있다. 예를 들어, 장치는 컨텐츠 정보의 마케팅 이력 정보를 공동구매, 광고 및 협찬으로 생성할 수 있 다. 여기서, 제3 인공신경망은 입력된 텍스트를 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 어느 하나로 분류하는 인공지능모델이고, 입력된 텍스트를 공동구매, 광고, 협찬, 단순 선물 및 단순 글 중 어느 하 나로 분류하는 인공지능모델이고, 제2 트레이닝 텍스트들, 제3 출력 신호들 및 트레이닝 마케팅 이력 정보들에 기초하여 미리 학습될 수 있다. 제3 인공신경망의 학습하는 과정과 관련된 자세한 설명은 은 도 8을 참조 하여 후술하기로 한다. 장치는 추출된 텍스트가 분류된 마케팅 이력 정보들 중에서 텍스트가 분류된 마케팅 이력 정보 각각이 차지 하는 비율인의 마케팅 이력 별 비율을 생성할 수 있다. 예를 들어, 추출된 텍스트가 분류된 마케팅 이력 정보들 이 공동구매, 광고 및 협찬인 경우, 장치는 분류된 마케팅 이력 정보들 중에서 공동구매, 광고 및 협찬이 각각 차지하는 마케팅 이력 별 비율을 생성할 수 있다. 마케팅 이력 별 비율에 기초하여 후보 인플루언서의 마케팅 이력 등급 정보를 생성할 수 있다. 일실시예에 따르 면, 장치는 마케팅 이력 별로 마케팅 이력 가중치를 생성하고, 생성한 가중치를 마케팅 이력 별 비율에 적 용하여 마케팅 이력 별 점수를 산출하고, 마케팅 이력 별 점수를 모두 합산하여 후보 인플루언서의 최종 마케팅 이력 점수를 산출할 수 있다. 예를 들어, 장치는 마케팅 이력 가중치를 공동구매를 1.5로, 광고를 1.4로, 협찬을 1.3으로, 단순 선물을 1.2로 및 단순 글을 1.1로 생성할 수 있다. 예를 들어, 공동구매, 광고 및 협찬의 마케팅 이력 별 비율이 각각 50%, 20%, 30%인 경우, 장치는 각각의 마케팅 이력 별 비율에 마케팅 이력 가중치를 적용하여 공동구매, 광고 및 협찬의 마케팅 이력 별 점수를 공동 구매 75점, 광고 28점, 협찬 39점으로 생성할 수 있다. 장치는 공동구매, 광고 및 협찬의 마케팅 이력 별 점수를 모두 합산하여 후보 인플루언서의 최종 마케팅 이력 점수를 142점으로 산출할 수 있다. 장치는 최종 마케팅 이력 점수에 따라 미리 정의된 마케팅 이력 등급 선정 기준에 따라 후보 인플루언서의 마케팅 이력 등급 정보를 생성할 수 있다. 이에 따라, 장치는 브랜드 카테고리 정보, 마케팅 카테고리 정보 및 마케팅 이력 등급 정보에 기초하여 제1 입력 신호를 생성할 수 있다. 도 6은 일실시예에 따른 제1 인공신경망을 설명하기 위한 도면이다. 도 6을 참조하면, 장치는 브랜드 카테고리 정보, 마케팅 카테고리 정보 및 마케팅 이력 등급 정보를 획득할 수 있다. 일실시예에 따르면, 장치는 제1 브랜드에 대응하는 인플루언서 매칭 정보를 제1 인공신경망 을 통해 예측할 수 있다. 여기서, 제1 인공신경망은 제2 인공신경망 및 제3 인공신경망을 포함 할 수 있다. 하지만, 이에 한정되지는 않는다. 장치는 브랜드 카테고리 정보, 마케팅 카테고리 정보 및 마케팅 이력 등급 정보에 기초하여 제1 입력 신호 를 생성할 수 있다. 여기서, 제1 입력 신호는 브랜드 카테고리 정보에 대응하는 제1 값, 마케팅 카테고리 정보 에 대응하는 제2 값 및 마케팅 이력 등급 정보에 대응하는 제3 값을 포함할 수 있다. 제1 인공신경망의 제 1 입력 레이어는 제1 값, 제2 값 및 제3 값에 각각 적용되는 입력 노드들을 포함할 수 있다. 장치는 제1 입력 신호를 제1 인공신경망에 적용하여 제1 출력 신호를 생성할 수 있다. 여기서, 제1 출 력 신호는 0과 1사이의 실수인 출력 값을 포함하고, 제1 인공신경망의 제1 출력 레이어는 출력 값을 생성하는 출력 노드를 포함할 수 있다. 도 7은 일실시예에 따른 제2 인공신경망의 학습을 설명하기 위한 도면이다. 도 7에 도시된 바와 같이, 장치는 텍스트 카테고리 정보의 추출을 위하여 제2 인공신경망을 학습시킬 수 있다. 제2 인공신경망은 트레이닝 샘플들이 입력되는 제2 입력 레이어와 트레이닝 출력들을 포함하는 제2 출력 레이어를 포함하고, 트레이닝 출력들과 레이블들 사이의 차이에 기초하여 학습될 수 있다. 여기서, 레이블들은 제1 트레이닝 텍스트들에 기초하여 정의될 수 있다. 제2 인공신경망은 복수의 노드들의 그룹으 로 연결되어 있고, 연결된 노드들 사이의 가중치들과 노드들을 활성화시키는 활성화 함수에 의해 정의된다. 장치는 GD(Gradient Decent) 기법 또는 SGD(Stochastic Gradient Descent) 기법을 이용하여 제2 인공신경 망을 학습시킬 수 있다. 장치는 제2 인공신경망의 출력들 및 레이블들 의해 설계된 손실 함수 (Loss Function)를 이용할 수 있다. 장치는 미리 정의된 손실 함수를 이용하여 트레이닝 에러를 계산할 수 있다. 손실 함수는 레이블, 출력 및 파라미터를 입력 변수로 미리 정의될 수 있고, 여기서 파라미터는 제2 인공신경망 내 가중치들에 의해 설 정될 수 있다. 예를 들어, 손실 함수는 MSE(Mean Square Error) 형태, 엔트로피(entropy) 형태 등으로 설계될 수 있는데, 손실 함수가 설계되는 실시예에는 다양한 기법 또는 방식이 채용될 수 있다. 장치는 역전파(Backpropagation) 기법을 이용하여 트레이닝 에러에 영향을 주는 가중치들을 찾아낼 수 있다. 여기서, 가중치들은 제2 인공신경망 내 노드들 사이의 관계들이다. 장치는 역전파 기법을 통해 찾아낸 가중치들을 최적화시키기 위해 레이블들 및 출력들을 이용한 SGD 기법을 이용할 수 있다. 예를 들어, 장 치는 레이블들, 출력들 및 가중치들에 기초하여 정의된 손실 함수의 가중치들을 SGD 기법을 이용하여 갱신 할 수 있다. 일실시예에 따르면, 장치는 제1 트레이닝 텍스트들에 기초하여 제2 트레이닝 입력 신호들을 생성할 수 있다. 장치는 제2 트레이닝 입력 신호들로부터 제2 출력 신호를 생성할 수 있다. 제2 인공신경망은 입력된 텍스트를 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 어느 하나로 분류하는 인공지능모델일 수 있으며, 제1 트레이닝 텍스트들, 제2 출력 신호들 및 트레이닝 텍스트 카테고리 정 보들에 기초하여 미리 학습될 수 있다. 제2 인공신경망은 제2 출력 신호들 및 트레이닝 텍스트 카테고리 정보들의 차이에 기초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있다. 트레이닝 텍스트 카테고리 정보들은 제1 트레이닝 텍스트들에 각각 대응하는 카테고리 정보들이고, 제2 출력 신 호들은 제1 트레이닝 텍스트들이 제2 인공신경망에 적용되어 생성된 출력 신호들일 수 있다. 도 8은 일실시예에 따른 제3 인공신경망의 학습을 설명하기 위한 도면이다. 도 8에 도시된 바와 같이, 장치는 마케팅 이력 정보의 추출을 위하여 제3 인공신경망을 학습시킬 수 있다. 제3 인공신경망은 트레이닝 샘플들이 입력되는 제3 입력 레이어와 트레이닝 출력들을 포함하는 제3 출력 레이어를 포함하고, 트레이닝 출력들과 레이블들 사이의 차이에 기초하여 학습될 수 있다. 여기서, 레이블들은 제2 트레이닝 텍스트들에 기초하여 정의될 수 있다. 제3 인공신경망은 복수의 노드들의 그룹으 로 연결되어 있고, 연결된 노드들 사이의 가중치들과 노드들을 활성화시키는 활성화 함수에 의해 정의된다. 장치는 GD(Gradient Decent) 기법 또는 SGD(Stochastic Gradient Descent) 기법을 이용하여 제3 인공신경 망을 학습시킬 수 있다. 장치는 제3 인공신경망의 출력들 및 레이블들 의해 설계된 손실 함수 (Loss Function)를 이용할 수 있다. 장치는 미리 정의된 손실 함수를 이용하여 트레이닝 에러를 계산할 수 있다. 손실 함수는 레이블, 출력 및 파라미터를 입력 변수로 미리 정의될 수 있고, 여기서 파라미터는 제3 인공신경망 내 가중치들에 의해 설 정될 수 있다. 예를 들어, 손실 함수는 MSE(Mean Square Error) 형태, 엔트로피(entropy) 형태 등으로 설계될 수 있는데, 손실 함수가 설계되는 실시예에는 다양한 기법 또는 방식이 채용될 수 있다. 장치는 역전파(Backpropagation) 기법을 이용하여 트레이닝 에러에 영향을 주는 가중치들을 찾아낼 수 있다. 여기서, 가중치들은 제3 인공신경망 내 노드들 사이의 관계들이다. 장치는 역전파 기법을 통해 찾아낸 가중치들을 최적화시키기 위해 레이블들 및 출력들을 이용한 SGD 기법을 이용할 수 있다. 예를 들어, 장 치는 레이블들, 출력들 및 가중치들에 기초하여 정의된 손실 함수의 가중치들을 SGD 기법을 이용하여 갱신 할 수 있다. 일실시예에 따르면, 장치는 제3 트레이닝 텍스트들에 기초하여 제3 트레이닝 입력 신호들을 생성할 수 있다. 장치는 제3 트레이닝 입력 신호들로부터 제3 출력 신호를 생성할 수 있다. 일실시예에 따르면, 제3 인공신경망은 입력된 텍스트를 공동구매, 광고, 협찬, 단순 선물 및 단순 글 중 어느 하나로 분류하는 인공지능모델이고, 제2 트레이닝 텍스트들, 제3 출력 신호들 및 트레이닝 마케팅 이력 정 보들에 기초하여 미리 학습될 수 있다. 제3 인공신경망은 제3 출력 신호들 및 트레이닝 마케팅 이력 정보 들의 차이들에 기초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있다. 여기서, 트레이닝 마케팅 이력 정보들은 제2 트레이닝 텍스트들에 각각 대응하는 마케팅 이력 정보들이고, 제3 출력 신호들은 제2 트레이닝 텍스트들이 제3 인공신경망에 적용되어 생성된 출력 신호들일 수 있다. 도 9는 일실시예에 따른 인플루언서 선정 정보를 생성하는 과정을 설명하기 위한 순서도이다. 도 9를 참조하면, 먼저 S901 단계에서, 장치는 후보 인플루언서의 컨텐츠 정보 중에서 공동구매에 해당하는 공동구매 컨텐츠들을 획득할 수 있다. 일실시예에 따르면, 장치는 후보 인플루언서의 컨텐츠 정보 중에서 텍스트를 추출하여, 추출된 텍스트 중에 서 공동구매를 포함하는 컨텐츠들을 공동구매애 해당하는 컨텐츠로 추출할 수 있으며, 추출된 컨텐츠들을 공동 구매 컨텐츠들로써 획득할 수 있다. S902 단계에서, 장치는 획득된 공동구매 컨텐츠들 중에서 현재 시점을 기준으로 최근에 순서대로 게시된 제 1 공동구매 컨텐츠, 제2 공동구매 컨텐츠 및 제3 공동구매 컨텐츠를 추출할 수 있다. *S903 단계에서, 장치는 제1 공동구매 컨텐츠, 제2 공동구매 컨텐츠 및 제3 공동구매 컨텐츠에 각각 대응하 는 제1 공동구매 제품 정보, 제2 공동구매 제품 정보 및 제3 공동구매 제품 정보를 획득할 수 있다. S904 단계에서, 장치는 제1 공동구매 제품 정보에 대응하는 제1 공동구매 제품의 판매량이 제1 공동구매 컨 텐츠의 게시 시점 이전 대비 이후의 상승한 비율인 제1 판매 상승율을 획득할 수 있다. S905 단계에서, 장치는 제1 공동구매 제품의 카테고리가 제1 브랜드의 브랜드 카테고리 정보와 일치하는지 여부에 대한 정보인 제1 공동구매 제품 카테고리 일치 여부 정보를 생성할 수 있다. 여기서, 공동구매 제품 카 테고리는 뷰티, 패션, 육아, 푸드, IT 리빙, 반려동물 및 여행 중 적어도 하나를 포함할 수 있으며, 이에 한정 되지는 않는다. 예를 들어, 제1 공동구매 제품의 카테고리가 패션이고, 제1 브랜드의 브랜드 카테고리 정보가 패션인 경우, 장 치는 제1 공동구매 제품의 카테고리와 제1 브랜드의 브랜드 카테고리 정보와 일치하는 것으로 판단할 수 있 다. S906 단계에서, 장치는 수학식 1을 이용하여 후보 인플루언서 c1의 랭킹 정보를 생성할 수 있다. 수학식 1 에 관련된 자세한 설명은 은 도 10을 참조하여 후술하기로 한다. S907 단계에서, 장치는 후보 인플루언서들에 각각 대응하는 랭킹 정보들을 생성할 수 있다. 즉, 장치는 수학식 1을 이용하여 후보 인플루언서 c1 및 후보 인플루언서들 각각의 랭킹 정보를 생성할 수 있다. S908 단계에서, 장치는 후보 인플루언서들의 랭킹 정보들에 기초하여, 후보 인플루언서들 중 어느 하나의 인플루언서를 제1 브랜드에 매칭되는 인플루언서로 선정하는 인플루언서 선정 정보를 생성할 수 있다. 구체적으로, 장치는 후보 인플루언서들에 각각 대응하는 랭킹 정보를 생성하여, 랭킹 정보가 높은 순서대로 후보 인플루언서들을 랭킹할 수 있으며, 후보 인플루언서들 중 랭킹이 가장 높은 어느 하나의 인플루언서를 제1 브랜드에 매칭되는 인플루언서로 선정하여 인플루언서 선정 정보를 생성할 수 있다. 도 10은 일실시예에 따른 수학식 1을 설명하기 위한 도면이다. 도 10에 도시된 바와 같이 수학식 1은 아래와 같다. 수학식 1"}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "은 후보 인플루언서 c1에 대응하는 랭킹 정보를 의미하고, 는 c1에 대응하는 매칭 정보이면서 0~1 사이 의 실수 값일 수 있으며, , , 및 은 미리 정의된 가중치들이고, 일 수 있으며, 는 제1 공동구매 컨텐츠 c11의 제1 공동구매 제품 카테고리 일치 여부 정보로서 미리 정의된 2개의 상수 중 어느 하나이고, 는 제2 공동구매 컨텐츠 c12의 제2 공동구매 제품 카테고리 일치 여부 정보로서 2개의 상수 중 어느 하나이고, 는 제3 공동구매 컨텐츠 c13의 제3 공동구매 제품 카테고리 일치 여부 정보로서 2개의 상수 중 어느 하나이고, 는 c11의 제1 판매 상승율이고, 는 c12의 제2 판매 상승율이고, 는 c13의 제3 판매 상승율을 의미할 수 있다. 보다 상세하게 살펴보면, 장치는 수학식 1을 이용하여 후보 인플루언서 c1의 랭킹 정보를 생성할 수 있다. 장치는 후보 인플루언서의 매칭 정보, 공동구매 컨텐츠의 업로드 시기, 제1 브랜드의 브랜드 카테고리 정보 와 제1 공동구매 제품 카테고리, 제2 공동구매 제품 카테고리 및 제3 공동구매 제품 카테고리와의 일치 여부, 제1 공동구매 제품, 제2 공동구매 제품 및 제3 공동구매 제품의 판매 상승율을 기반으로 후보 인플루언서 c1에 대응하는 랭킹 정보를 산출할 수 있다. 이때, , , 및 은 공동구매 컨텐츠의 업로드 시기에 기반하여 미리 정의된 가중치들로, 현재 시점에 가까운 순서대로 가중치를 높게 부여하여, 일 수 있다. 는 제1 공동구매 컨텐츠 c11의 제1 공동구매 제품 카테고리 일치 여부 정보로서 미리 정의된 2개의 상수"}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "및 중 어느 하나이고 제1 브랜드의 브랜드 카테고리 정보와 제1 공동구매 제품 카테고리가 일치하는 경우, 는 일 수 있고, 제1 브랜드의 브랜드 카테고리 정보와 제1 공동구매 제품 카테고리가 일치하지 않는 경우, 는 일 수 있다. 는 제2 공동구매 컨텐츠 c12의 제2 공동구매 제품 카테고리 일치 여부 정보로서 미리 정의된 2개의 상수"}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "및 중 어느 하나이고 제1 브랜드의 브랜드 카테고리 정보와 제2 공동구매 제품 카테고리가 일치하는 경우, 는 일 수 있고, 제1 브랜드의 브랜드 카테고리 정보와 제1 공동구매 제품 카테고리가 일치하지 않는 경우, 는 일 수 있다. 는 제3 공동구매 컨텐츠 c13의 제3 공동구매 제품 카테고리 일치 여부 정보로서 미리 정의된 2개의 상수"}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "및 중 어느 하나이고 제1 브랜드의 브랜드 카테고리 정보와 제3 공동구매 제품 카테고리가 일치하는 경우, 는 일 수 있고, 제1 브랜드의 브랜드 카테고리 정보와 제3 공동구매 제품 카테고리가 일치하지 않는 경우, 는 일 수 있다."}
{"patent_id": "10-2023-0066761", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "는 제1 공동구매 제품 정보에 대응하는 제1 공동구매 제품의 판매량이 제1 공동구매 컨텐츠 c11의 게시 시 점 이전 대비 이후의 상승한 비율인 제1 판매 상승율일 수 있다. 는 제2 공동구매 제품 정보에 대응하는 제 2 공동구매 제품의 판매량이 제2 공동구매 컨텐츠 c12의 게시 시점 이전 대비 이후의 상승한 비율인 제2 판매 상승율일 수 있다. 는 제3 공동구매 제품 정보에 대응하는 제3 공동구매 제품의 판매량이 제3 공동구매 컨텐츠 c13의 게시 시 점 이전 대비 이후의 상승한 비율인 제3 판매 상승율일 수 있다. 도 11은 일실시예에 따른 인플루언서의 마케팅 이력 등급을 업데이트하는 과정을 설명하기 위한 순서도이다. 도 11을 참조하면, 먼저 S1101 단계에서, 장치는 제1 인플루언서가 업로드한 컨텐츠들로부터 컨텐츠 정보를 획득할 수 있다. 여기서, 제1 인플루언서는 기 등록된 인플루언서들 중에서 공동구매 마케팅을 진행하고자 하는 어느 하나의 인플루언서일 수 있다. S1102 단계에서, 장치는 컨텐츠 정보로부터 텍스트를 추출하고, S1103 단계에서, 장치는 추출된 텍스트 를 제3 인공신경망으로 적용하여 추출된 텍스트의 마케팅 이력 정보를 생성할 수 있다. 여기서, 마케팅 이 력 정보는 공동구매, 광고, 협찬, 단순 선물 및 단순 글 중 어느 하나일 수 있으며, 이에 한정되지는 않는다. S1104 단계에서, 장치는 제1 시점으로부터 제1 기간 동안의 제1 인플루언서의 마케팅 이력 등급 정보를 생 성할 수 있다. 여기서, 제1 컨텐츠는 제1 인플루언서가 업로드한 컨텐츠들 중 어느 하나의 컨텐츠일 수 있다. 제1 시점은 제1 인플루언서가 제1 컨텐츠를 업로드한 시점을 의미할 수 있다. S1105 단계에서, 장치는 컨텐츠 정보로부터 제2 시점에서의 제1 인플루언서가 업로드한 컨텐츠의 업로드 횟 수를 산출할 수 있다. 여기서, 제2 시점은 제1 시점부터 미리 정의된 기간인 제1 기간이 지난 시점을 의미할 수 있으며, 제1 기간은 실시예에 따라 상이하게 설정될 수 있다. S1106 단계에서, 장치는 제2 시점에서의 제1 인플루언서가 판매한 제1 제품에 대한 판매량을 산출할 수 있 다. S1107 단계에서, 장치는 제2 시점에서의 제1 인플루언서의 팔로워 수를 획득할 수 있다. S1108 단계에서, 장치는 제1 시점에서의 제1 인플루언서의 마케팅 이력 등급 정보 및 제2 시점에서의 컨텐 츠 업로드 횟수, 제2 시점에서의 제1 제품에 대한 판매량, 제2 시점에서의 제1 인플루언서의 팔로워 수를 기초 로 제4 입력 신호를 생성할 수 있다. 장치는 생성된 제4 입력 신호를 제4 인공신경망에 적용하여 제2 시점에서의 제1 인플루언서의 제2 마케팅 이력 등급을 생성할 수 있다. S1109 단계에서, 장치는 제2 마케팅 이력 등급을 제1 인플루언서의 마케팅 이력 등급으로 업데이트하여 저 장할 수 있다. 구체적으로, 장치의 데이터베이스에 제1 인플루언서의 마케팅 이력 등급을 저장할 수 있으며, 제1 인플루언서의 컨텐츠 업로드 횟수, 제1 제품에 대한 판매량, 팔로워 수를 기초로 하여 제1 인플루 언서의 제2 마케팅 이력 등급을 새로 생성하고, 새로 생성된 제2 마케팅 이력 등급을 제1 인플루언서의 마케팅 이력 등급으로 업데이트하여 저장할 수 있다. 도 12는 일실시예에 따른 제1 사용자 단말로부터 공동구매 마케팅 승인 메시지를 수신하는 과정을 설명하기 위 한 순서도이다. 도 12를 참조하면, 먼저 S1201 단계에서, 장치는 제1 브랜드에 대한 생성된 인플루언서 매칭 정보를 제1 광 고주 단말로 전송할 수 있다. S1202 단계에서, 장치는 제1 광고주 단말로부터 제1 브랜드의 브랜드 마케팅을 진행하는 것으로 선정된 최종 인플루언서에 대한 정보를 수신할 수 있다. 일실시예에 따르면, 장치는 제1 브랜드에 대한 인플루언서 매칭 정보를 제1 광고주 단말로 전송하고, 제1 광고주 단말로부터 선정된 제1 브랜드의 브랜드 마케팅 을 진행할 최종 인플루언서에 대한 정보를 수신할 수 있다. S1203 단계에서, 장치는 최종 인플루언서가 제1 인플루언서인 경우, 제1 인플루언서에 대응하는 제1 사용자 단말로 제1 브랜드에 대한 공동구매 마케팅 요청 메시지를 전송할 수 있다. S1204 단계에서, 장치는 제1 인플루언서가 제1 브랜드에 대한 공동구매 마케팅 요청을 승인한 경우, 제1 사 용자 단말로 공동구매 마케팅의 진행이 가능한 제1 브랜드의 제품 목록을 전송할 수 있다. 여기서, 제1 브 랜드의 제품 목록은 공동구매 마케팅의 진행이 가능하면서, 제1 브랜드에서 출시하거나 판매하고 있는 제품들의 목록을 의미할 수 있다. S1205 단계에서, 장치는 제1 인플루언서가 제1 브랜드의 제품 목록으로부터 공동구매를 진행하기로 제1 제 품을 선정한 경우, 제1 제품의 샘플을 구매가능한 샘플 구매 페이지를 제1 사용자 단말로 전송할 수 있다. 여기서, 샘플 구매 페이지는 제1 인플루언서가 제1 사용자 단말을 통해 접속 가능한 페이지로 공동구매 마 케팅을 진행할 제1 제품을 제1 제품의 기존 판매 가격보다 저렴한 가격으로 구매가 가능하도록 생성된 페이지를 의미할 수 있다. S1206 단계에서, 장치는 제1 사용자 단말로부터 제1 제품의 공동구매 마케팅 승인 메시지를 수신할 수 있다. 일실시예에 따르면, 장치는 제1 사용자 단말로부터 샘플 구매 페이지를 통해 제1 제품을 구매한제1 인플루언서로부터 제1 제품을 공동구매 마케팅 진행을 승인한다는 것에 대한 제1 제품의 공동구매 마케팅 승인 메시지를 수신할 수 있다. 장치는 제1 제품의 공동구매 마케팅 승인 메시지에 응답하여, 제1 제품의 공동구매 마케팅을 위한 상세페이 지인 제1 컨텐츠를 직접 제작할 것인지 여부에 대한 컨텐츠 제작 문의 메시지를 제1 사용자 단말로 전송할 수 있다. 장치는 제1 인플루언서가 제1 컨텐츠를 직접 제작하겠다는 메시지를 수신한 경우, 제1 사용자 단말로부 터 제작된 제1 컨텐츠를 수신할 수 있다. 장치는 제1 인플루언서가 제1 컨텐츠를 직접 제작하지 않겠다는 메시지를 수신한 경우, 제1 사용자 단말 로부터 제1 제품에 대한 사진, 동영상, 및 사용 후기글을 획득할 수 있다. 장치는 제1 제품의 상세페이 지에 대한 미리 제작된 제1 템플릿에 제1 제품에 대한 사진, 동영상, 및 사용 후기글을 적용하여 제1 컨텐츠를 제작할 수 있다. 장치는 제작된 제1 컨텐츠 및 제1 제품을 공동구매 방식으로 판매할 수 있도록 생성된 판매 페이지를 연결 한 링크를 제1 사용자 단말로 전송할 수 있다. 도 13은 일실시예에 따른 인플루언서의 총 정산금을 산출하는 과정을 설명하기 위한 순서도이다. 도 13을 참조하면, 먼저 S1301 단계에서, 장치는 제1 컨텐츠 및 제1 제품을 공동구매 방식으로 판매할 수 있도록 판매 페이지를 연결한 링크를 생성하고, S1302 단계에서, 생성된 링크를 제1 사용자 단말로 전송할 수 있다. S1303 단계에서, 장치는 제1 사용자 단말에 의해 등록된 링크의 접속을 통해 제1 기간 동안의 제품 주 문 내역을 수신할 수 있다. 제1 기간은 실시예에 따라 상이하게 설정될 수 있다. S1304 단계에서, 장치는 미리 설정된 판매량 1개당 보상하는 금액에 제1 제품에 대한에 판매량을 반영하여 제1 인플루언서의 판매 정산금을 산출할 수 있다. 예를 들어, 판매량 1개당 보상하는 금액이 40원이고, 제1 제 품에 대한 판매량이 30,000개인 경우, 장치는 제1 인플루언서의 판매 정산금을 1,200,000원으로 산출할 수 있다. S1305 단계에서, 장치는 제1 기간 동안의 링크의 접속 내역을 획득하여, 링크의 조회수를 산출할 수 있다. S1306 단계에서, 장치는 미리 설정된 조회수 기준에 따라 조회수 등급을 설정하여, 제1 인플루언서의 조회 수 등급을 선정할 수 있다. 예를 들어, 장치는 링크의 조회수가 500,000회 이상인 경우 1등급, 300,000회 이상 500,000회 미만인 경우 2등급, 100,000회 이상 300,000회 미만인 경우 3등급, 50,000회 이상 100,000회 미만인 경우 4등급, 50,000회 미만인 경우 5등급으로 제1 인플루언서의 조회수 등급을 선정할 수 있다. S1307 단계에서, 장치는 선정된 조회수 등급에 대응하는 조회수 가중치를 생성하고, 생성된 조회수 가중치 를 판매 정산금에 적용하여, 제1 인플루언서의 총 정산금을 산출할 수 있다. 예를 들어, 장치는 조회수 등 급이 1등급인 경우 1.4, 2등급인 경우 1.3, 3등급인 경우 1.2, 4등급인 경우 1.1, 5등급인 경우 1으로 제1 인플 루언서의 조회수 가중치를 생성할 수 있다. 예를 들어, 장치는 링크의 조회수가 150,000회인 경우, 제1 인플루언서의 조회수 등급을 3등급으로 선정할 수 있고, 제1 인플루언서의 조회수 가중치를 1.2로 생성할 수 있다. S1308 단계에서, 장치는 생성된 조회수 가중치를 판매 정산금에 적용하여, 제1 인플루언서의 총 정산금을 산출할 수 있다. 장치는 제1 인플루언서의 판매 정산금이 1,200,000원이고, 조회수 가중치가 1.2인 경우, 제1 인플루언서의 판매 정산금에 조회수 가중치를 적용하여 제1 인플루언서의 총 정산금을 1,440,000원으로 산출할 수 있다. S1309 단계에서, 장치는 산출된 총 정산금을 안내하는 메시지인 정산금 안내 메시지를 제1 사용자 단말(2 1)로 전송할 수 있다. 도 14는 일실시예에 따른 제5 인공신경망의 학습을 설명하기 위한 도면이다. 장치는 기 등록된 인플루언서들 중 공동구매 마케팅을 진행하고자 하는 제1 인플루언서의 제1 사용자 단말 로부터 브랜드 매칭 요청 메시지를 수신할 수 있다.장치는 브랜드 매칭 요청 메시지에 응답하여, 미리 선정된 복수의 국가들 중 제1 인플루언서가 사용 가능한 국가의 언어가 어느 국가인지 문의하고자 하는 언어 문의 메시지를 제1 사용자 단말로 전송하고, 제1 사용 자 단말로부터 제1 인플루언서가 사용 가능한 언어를 사용하는 국가 정보를 수신할 수 있다. 장치는 제1 사용자 단말로부터 선정된 브랜드 카테고리들 중 적어도 하나의 브랜드 카테고리 정보를 수 신할 수 있다. 장치는 국가 정보 및 브랜드 카테고리 정보에 기초하여 제5 입력 신호를 생성하고, 생성된 제5 입력 신호를 제5 인공신경망에 적용하여 제5 출력 신호를 생성할 수 있다. 장치는 제5 출력 신호에 기초하여 제1 인플루 언서에 대응하는 브랜드 매칭 정보를 생성하고, 생성된 브랜드 매칭 정보를 제1 사용자 단말로 전송할 수 있다. 도 14에 도시한 바와 같이, 장치 브랜드 매칭 정보의 추출을 위하여 제5 인공신경망을 학습시킬 수 있다. 제5 인공신경망은 트레이닝 샘플들이 입력되는 제5 입력 레이어와 트레이닝 출력들을 포함하는 제5 출력 레이어를 포함하고, 트레이닝 출력들과 레이블들 사이의 차이에 기초하여 학습될 수 있다. 여기서, 레이블들은 브랜드 카테고리 정보들, 국가 정보들에 대응하는 브랜드 매칭 정보들에 기초하여 정의될 수 있다. 제5 인공신경망은 복수의 노드들의 그룹으로 연결되어 있고, 연결된 노드들 사이의 가중치들과 노드들을 활성화시키는 활성화 함수에 의해 정의된다. 장치는 GD(Gradient Decent) 기법 또는 SGD(Stochastic Gradient Descent) 기법을 이용하여 제5 인공신경 망을 학습시킬 수 있다. 장치는 제5 인공신경망의 출력들 및 레이블들 의해 설계된 손실 함수 (Loss Function)를 이용할 수 있다. 장치는 미리 정의된 손실 함수를 이용하여 트레이닝 에러를 계산할 수 있다. 손실 함수는 레이블, 출력 및 파라미터를 입력 변수로 미리 정의될 수 있고, 여기서 파라미터는 제5 인공신경망 내 가중치들에 의해 설 정될 수 있다. 예를 들어, 손실 함수는 MSE(Mean Square Error) 형태, 엔트로피(entropy) 형태 등으로 설계될 수 있는데, 손실 함수가 설계되는 실시예에는 다양한 기법 또는 방식이 채용될 수 있다. 장치는 역전파(Backpropagation) 기법을 이용하여 트레이닝 에러에 영향을 주는 가중치들을 찾아낼 수 있다. 여기서, 가중치들은 제5 인공신경망 내 노드들 사이의 관계들이다. 장치는 역전파 기법을 통해 찾아낸 가중치들을 최적화시키기 위해 레이블들 및 출력들을 이용한 SGD 기법을 이용할 수 있다. 예를 들어, 장 치는 레이블들, 출력들 및 가중치들에 기초하여 정의된 손실 함수의 가중치들을 SGD 기법을 이용하여 갱신 할 수 있다. 일실시예에 따르면, 장치는 트레이닝 브랜드 카테고리 정보들 및 트레이닝 국가 정보들에 기초하여 제5 트 레이닝 입력 신호들을 생성할 수 있다. 장치는 제5 트레이닝 입력 신호들로부터 제5 출력 신호들을 생성할 수 있다. 일실시예에 따르면, 제5 인공신경망는 트레이닝 브랜드 카테고리 정보들, 트레이닝 국가 정보들, 제5 출력 신호들 및 트레이닝 브랜드 매칭 정보들에 기초하여 미리 학습될 수 있다. 제5 인공신경망는 제5 출력 신 호들 및 트레이닝 브랜드 매칭 정보들의 차이들에 기초하여 생성된 트레이닝 에러들을 최소화하여 학습될 수 있 다. 도 15는 일실시예에 따른 링크의 조회수에 따른 공동구매 마케팅의 중단 여부를 판단하는 과정을 설명하기 위한 순서도이다. 도 15를 참조하면, 먼저 S1501 단계에서, 장치는 제1 기간 동안의 링크의 접속 내역을 획득하여, 링크의 조 회수를 산출할 수 있다. S1502 단계에서, 장치는 제1 기간 동안의 링크의 조회수가 미리 설정된 기준 조회수 이하인지 여부를 판단 할 수 있다. 이때, 기준 조회수는 실시예에 따라 상이하게 설정될 수 있다. S1503 단계에서, 제1 기간 동안의 링크의 조회수가 기준 조회수 이하인 경우, 장치는 제1 제품에 대한 공동 구매 마케팅을 정지하는 것에 대한 마케팅 정지 안내 메시지를 제1 사용자 단말로 전송할 수 있다. 구체적으로, 장치는 제1 기간 동안의 링크의 조회수가 기준 조회수보다 적은 경우, 제1 제품에 대한 공동구 매 마케팅의 효과가 저조할 것으로 판단하여, 제1 제품에 대한 공동구매 마케팅을 정지하는 것에 대한 마케팅정지 안내 메시지를 제1 사용자 단말로 전송할 수 있다. S1504 단계에서, 제1 기간 동안의 링크의 조회수가 기준 조회수 이상인 경우, 장치는 제1 제품에 대한 홍보 효과를 높일 수 있는 미리 설정된 키워드들에 대한 홍보 효과 메시지를 제1 사용자 단말로 전송할 수 있다. 여기서, 제1 제품에 대한 홍보 효과를 높일 수 있는 키워드는 제1 제품의 카테고리에 따라 미리 설정될 수 있다. 예를 들어, 제1 제품의 카테고리가 뷰티인 경우, 장치는 제1 제품에 대한 홍보 효과를 높일 수 있는 키워드를 미백, 탄력, 동안, 주름개선 중 적어도 하나 이상으로 설정할 수 있다. 홍보 효과 메시지는 제1 제품 에 대한 홍보 효과를 높일 수 있는 미리 설정된 키워드들 중 적어도 하나 이상을 포함하는 메시지일 수 있다. 도 16은 일실시예에 따른 컨텐츠의 정독 시간을 산출하여 광고주의 허용 범위를 설정하는 과정을 설명하기 위한 순서도이다. 도 16를 참조하면, 먼저, S1601 단계에서, 장치는 제1 사용자 단말로부터 공동구매 마케팅 컨텐츠를 제 공하는 웹 사이트에 대한 접속 요청을 수신할 수 있다. S1602 단계에서, 장치는 웹 사이트에 대한 접속 요청에 따라, 웹 사이트에 접속되도록 처리하여, 웹 사이트 의 홈 페이지를 제1 사용자 단말로 제공하고, 홈 페이지가 제1 사용자 단말의 화면에 표시되도록, 제1 사용자 단말의 동작을 제어할 수 있다. S1603 단계에서, 장치는 제1 사용자 단말에 대응하는 제1 사용자 계정을 확인하여, 제1 사용자 정보를 획득 할 수 있다. 이때, 장치는 제1 사용자 단말에 로그인 되어 있는 제1 사용자 계정을 확인하고, 제1 사용 자 계정을 통해 데이터베이스에 저장된 사용자 정보를 조회하여, 데이터베이스로부터 제1 사용자 정보를 획득할 수 있다. 여기서, 제1 사용자 정보는 제1 사용자에 대한 사용자 정보로, 제1 사용자의 프로파일 정보, 컨텐츠 정보, 마케팅 이력 정보 등을 포함할 수 있다. S1604 단계에서, 장치는 제1 사용자 단말로부터 제1 컨텐츠에 대한 조회 요청을 수신할 수 있다. 구체적으로, 장치는 제1 사용자 단말의 화면에 표시된 홈 페이지 상에서 공동구매 마케팅 컨텐츠 중 어 느 하나인 제1 컨텐츠의 대표 이미지가 클릭되면, 제1 사용자 단말로부터 제1 컨텐츠에 대한 조회 요청을 수신할 수 있다. 예를 들어, 제1 컨텐츠가 제1 제품을 공동구매 마케팅하는 컨텐츠인 경우, 제1 컨텐츠의 대표 이미지는 제1 제품의 이미지이고, 제1 컨텐츠에 대한 조회 요청은 제1 제품의 상세 정보를 조회하는 것에 대한 요청일 수 있다. S1605 단계에서, 장치는 제1 컨텐츠를 확인하여, 제1 컨텐츠 정보를 획득할 수 있다. 이때, 장치는 제1 컨텐츠에 대한 조회 요청을 통해 제1 컨텐츠를 확인하고, 데이터베이스에 저장된 컨텐츠 정보를 조회하여, 데이 터베이스로부터 제1 컨텐츠 정보를 획득할 수 있다. 여기서, 제1 컨텐츠 정보는 제1 컨텐츠에 대한 컨텐츠 정보 로, 제1 컨텐츠의 속성 정보, 사용자 이용 내역 등을 포함할 수 있다. S1606 단계에서, 장치는 제1 컨텐츠 정보를 통해 제1 컨텐츠의 사용자 조회 내역을 획득할 수 있다. 여기서, 제1 컨텐츠 정보는 제1 컨텐츠를 정독한 사용자의 조회 내역을 포함할 수 있으며, 제1 컨텐츠의 사용자 조회 내역은 어느 사용자가 제1 컨텐츠를 얼마나 오래 정독하였는지에 대한 내역을 포함할 수 있다. 예를 들어, 제1 사용자 단말의 화면에 제1 컨텐츠가 표시된 경우, 제1 컨텐츠에 대한 웹 페이지가 표시된 시점부터, 제1 컨텐츠에 대한 웹 페이지에서 다른 페이지로 이동한 시점까지, 제1 컨텐츠의 정독 시간으로 측정 되어, 제1 사용자 및 제1 컨텐츠의 정독 시간이 제1 컨텐츠의 사용자 조회 내역에 추가될 수 있다. S1607 단계에서, 장치는 제1 컨텐츠의 사용자 조회 내역을 기초로, 사용자 별로 정독 시간을 확인할 수 있 다. 예를 들어, 제1 컨텐츠의 사용자 조회 내역에 제1 사용자, 제2 사용자 및 제3 사용자가 조회한 사용자로 등록되 어 있는 경우, 장치는 제1 사용자의 정독 시간, 제2 사용자의 정독 시간 및 제3 사용자의 정독 시간을 각각 확인할 수 있다. S1608 단계에서, 장치는 사용자 별로 확인된 정독 시간의 평균값을 통해, 제1 컨텐츠의 평균 정독 시간을 산출할 수 있다. 예를 들어, 제1 사용자가 제1 컨텐츠를 정독한 시간이 10초, 제2 사용자가 제1 컨텐츠를 정독한 시간이 30초, 제3 사용자가 제1 컨텐츠를 정독한 시간이 50초인 경우, 장치는 제1 컨텐츠의 평균 정독 시간을 30초로 산출할 수 있다. S1609 단계에서, 장치는 제1 컨텐츠의 평균 정독 시간의 길이에 따라, 기준값을 설정할 수 있다. 예를 들어, 장치는 제1 컨텐츠의 평균 정독 시간이 1분인 경우, 기준값을 15초로 설정하고, 제1 컨텐츠의 평균 정독 시간이 2분인 경우, 기준값을 25초로 설정할 수 있다. 기준값을 설정하는 기준은 실시예에 따라 상이 하게 설정될 수 있다. S1610 단계에서, 장치는 제1 컨텐츠의 평균 정독 시간에서 기준치를 차감한 값으로, 사용자 허용 범위의 최 소 시간을 산출할 수 있다. 예를 들어, 장치는 제1 컨텐츠의 평균 정독 시간이 1분이고, 기준값이 15초인 경우, 사용자 허용 범위의 최 소 시간을 45초로 산출할 수 있다. S1611 단계에서, 장치는 제1 컨텐츠의 평균 정독 시간에 기준치를 가산한 값으로, 사용자 허용 범위의 최대 시간을 산출할 수 있다. 예를 들어, 장치는 제1 컨텐츠의 평균 정독 시간이 1분이고, 기준값이 15초인 경우, 사용자 허용 범위의 최 대 시간을 75초로 산출할 수 있다. S1612 단계에서, 장치는 사용자 허용 범위의 최소 시간 및 사용자 허용 범위의 최대 시간을 기초로, 사용자 허용 범위를 설정할 수 있다. 예를 들어, 장치는 제1 컨텐츠의 평균 정독 시간이 1분인 경우, 사용자 허용 범위를 45초 내지 75초의 범위 로 설정할 수 있다. 도 17은 일실시예에 따른 컨텐츠의 정독 시간을 예측하여 컨텐츠의 추천 정보를 제공하는 과정을 설명하기 위한 순서도이다. 도 17을 참조하면, 먼저, S1701 단계에서, 장치는 제1 사용자 계정을 확인하여 제1 사용자 정보를 획득할 수 있다. S1702 단계에서, 장치는 제1 컨텐츠를 확인하여 제1 컨텐츠 정보를 획득할 수 있다. S1703 단계에서, 제1 사용자 정보 및 제1 컨텐츠 정보를 기초로, 제1 컨텐츠에 대한 제1 사용자의 정독 시간을 예측할 수 있다. 여기서, 제1 사용자의 정독 시간은 제1 사용자가 제1 컨텐츠를 정독하는데 소요되는 시간을 의 미할 수 있다. S1704 단계에서, 장치는 제1 사용자의 정독 시간이 사용자 허용 범위 내에 포함되는지 여부를 확인할 수 있 다. 여기서, 사용자 허용 범위는 상술한 바와 같이, 평균 정독 시간에 따라 상이하게 설정될 수 있다. S1704 단계에서 제1 사용자의 정독 시간이 사용자 허용 범위 내에 포함되는 것으로 확인되면, S1705 단계에서, 장치는 제1 컨텐츠를 제1 사용자 단말로 제공하고, 제1 사용자 단말의 화면에 제1 컨텐츠에 대한 웹 페이지가 표시되도록, 제1 사용자 단말의 동작을 제어할 수 있다. 여기서, 제1 컨텐츠에 대한 웹 페이지는 제1 컨텐츠의 대표 이미지에 대한 클릭으로 연결되는 웹 페이지로, 제1 컨텐츠에 대한 상세 정보를 포함할 수 있다. 예를 들어, 제1 컨텐츠의 대표 이미지가 제1 제품의 이미지인 경우, 제1 컨텐츠에 대한 웹 페이지는 제1 제품의 상세 정보가 표시되는 페이지이다. 즉, 장치는 제1 사용자 단말로부터 제1 컨텐츠에 대한 조회 요청이 수신된 경우, 제1 컨텐츠에 대한 제 1 사용자의 정독 시간을 예측한 결과, 제1 사용자의 정독 시간이 사용자 허용 범위 내에 포함되는 것으로 확인 되면, 제1 컨텐츠가 제1 사용자에게 적합한 컨텐츠로 판단하여, 제1 컨텐츠를 제1 사용자 단말로 제공할 수 있다. S1704 단계에서 제1 사용자의 정독 시간이 사용자 허용 범위 내에 포함되지 않고 사용자 허용 범위를 벗어나는 것으로 확인되면, S1706 단계에서, 장치는 제1 사용자의 정독 시간이 사용자 허용 범위의 최소 시간 보다 짧은지 여부를 확인할 수 있다. S1706 단계에서 제1 사용자의 정독 시간이 사용자 허용 범위의 최소 시간 보다 짧은 것으로 확인되면, S1707 단 계에서, 장치는 제2 컨텐츠에 대한 추천 정보를 제1 사용자 단말로 제공하고, 제1 사용자 단말의 화면에 제2 컨텐츠에 대한 추천 정보가 표시되도록, 제1 사용자 단말의 동작을 제어할 수 있다. 여기서, 제2 컨텐츠는 제1 컨텐츠와 주제가 동일하면서 제1 컨텐츠 보다 많은 글자 수로 구성된 컨텐츠고, 제2 컨텐츠에 대한 추천 정보는 제2 컨텐츠의 대표 이미지를 포함할 수 있다. 예를 들어, 제1 컨텐츠는 제1 제품을 공동구매 마케팅하는 컨텐츠로 100개의 글자와 20개의 이미지로 구성된 컨 텐츠고, 제2 컨텐츠는 제1 제품을 공동구매 마케팅하는 컨텐츠로 120개의 글자와 10개의 이미지로 구성된 컨텐 츠인 경우, 장치는 제1 사용자의 정독 시간이 사용자 허용 범위의 최소 시간 보다 짧은 것으로 확인되면, 데이터베이스에 저장된 컨텐츠 정보를 조회하여, 제1 컨텐츠 보다 많은 글자 수로 구성된 제2 컨텐츠를 확인할 수 있으며, 제2 컨텐츠에 대한 추천 정보를 제1 사용자 단말로 제공할 수 있다. 즉, 장치는 제1 사용자 단말로부터 제1 컨텐츠에 대한 조회 요청이 수신된 경우, 제1 컨텐츠에 대한 제 1 사용자의 정독 시간을 예측한 결과, 제1 사용자의 정독 시간이 사용자 허용 범위를 벗어나는 것으로 확인되면, 제1 컨텐츠가 제1 사용자에게 적합하지 않은 컨텐츠로 판단하고, 제1 사용자의 정독 시간이 사용자 허용 범위의 최소 시간 보다 짧은 것으로 확인되면, 제1 사용자의 정독 시간을 증가시키기 위해 제1 컨텐츠 보 다 많은 글자 수로 구성된 제2 컨텐츠가 제1 사용자에게 적합한 컨텐츠로 판단하여, 제2 컨텐츠에 대한 추천 정 보를 제1 사용자 단말로 제공할 수 있다. 이때, 장치는 제1 컨텐츠 및 제2 컨텐츠에 대한 추천 정보를 함께 제1 사용자 단말로 제공할 수 있다. S1706 단계에서 제1 사용자의 정독 시간이 사용자 허용 범위의 최소 시간 보다 긴 것으로 확인되면, 제1 사용자 의 정독 시간이 사용자 허용 범위를 벗어난 것으로 확인되어, 제1 사용자의 정독 시간이 사용자 허용 범위의 최 대 시간 보다 긴 것으로 확인될 수 있으며, 제1 사용자의 정독 시간이 사용자 허용 범위의 최대 시간 보다 긴 것으로 확인되면, S1708 단계에서, 장치는 제3 컨텐츠에 대한 추천 정보를 제1 사용자 단말로 제공하고, 제1 사용자 단말의 화면에 제3 컨텐츠에 대한 추천 정보가 표시되도록, 제1 사용자 단말의 동작을 제어할 수 있다. 여기서, 제3 컨텐츠는 제1 컨텐츠와 주제가 동일하면서 제1 컨텐츠 보다 적은 글자 수 로 구성된 컨텐츠고, 제3 컨텐츠에 대한 추천 정보는 제3 컨텐츠의 대표 이미지를 포함할 수 있다. 예를 들어, 제1 컨텐츠는 제1 제품을 공동구매 마케팅하는 컨텐츠로 100개의 글자와 20개의 이미지로 구성된 컨 텐츠고, 제3 컨텐츠는 제1 제품을 공동구매 마케팅하는 컨텐츠로 80개의 글자와 30개의 이미지로 구성된 컨텐츠 인 경우, 장치는 제1 사용자의 정독 시간이 사용자 허용 범위의 최대 시간 보다 긴 것으로 확인되면, 데이 터베이스에 저장된 컨텐츠 정보를 조회하여, 제1 컨텐츠 보다 적은 글자 수로 구성된 제3 컨텐츠를 확인할 수 있으며, 제3 컨텐츠에 대한 추천 정보를 제1 사용자 단말로 제공할 수 있다. 즉, 장치는 제1 사용자 단말로부터 제1 컨텐츠에 대한 조회 요청이 수신된 경우, 제1 컨텐츠에 대한 제 1 사용자의 정독 시간을 예측한 결과, 제1 사용자의 정독 시간이 사용자 허용 범위를 벗어나는 것으로 확인되면, 제1 컨텐츠가 제1 사용자에게 적합하지 않은 컨텐츠로 판단하고, 제1 사용자의 정독 시간이 사용자 허용 범위의 최대 시간 보다 긴 것으로 확인되면, 제1 사용자의 정독 시간을 감소시키기 위해 제1 컨텐츠 보다 적은 글자 수로 구성된 제3 컨텐츠가 제1 사용자에게 적합한 컨텐츠로 판단하여, 제3 컨텐츠에 대한 추천 정보 를 제1 사용자 단말로 제공할 수 있다. 이때, 장치는 제1 컨텐츠 및 제3 컨텐츠에 대한 추천 정보를 함 께 제1 사용자 단말로 제공할 수 있다. 도 18은 일실시예에 따른 장치의 구성의 예시도이다. 일실시예에 따른 장치는 프로세서 및 메모리를 포함한다. 일실시예에 따른 장치는 상술한 서 버 또는 단말일 수 있다. 프로세서는 도 1 내지 도 17을 통하여 전술한 적어도 하나의 장치들을 포함하거나, 도 1 내지 도 17을 통하여 전술한 적어도 하나의 방법을 수행할 수 있다. 메모리는 상술한 방법과 관련된 정보 를 저장하거나 상술한 방법이 구현된 프로그램을 저장할 수 있다. 메모리는 휘발성 메모리 또는 비휘발성 메모리일 수 있다. 프로세서는 프로그램을 실행하고, 장치를 제어할 수 있다. 프로세서에 의하여 실행되는 프로그램의 코드는 메모리에 저장될 수 있다. 장치는 입출력 장치(도면 미 표시)를 통하여 외부 장치(예를 들어, 퍼스널 컴퓨터 또는 네트워크)에 연결되고, 데이터를 교환할 수 있다. 이상에서 본 발명에 따른 실시예들이 설명되었으나, 이는 예시적인 것에 불과하며, 당해 분야에서 통상적 지식 을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 보호 범위는 다음의 특허청구범위뿐만 아니라 이와 균등한 것들에 의해 정해져야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18"}
{"patent_id": "10-2023-0066761", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일실시예에 따른 시스템의 구성을 설명하기 위한 도면이다. 도 2는 일실시예에 따른 인공지능 기반의 인플루언서 및 브랜드를 매칭하는 과정을 설명하기 위한 순서도이다. 도 3은 일실시예에 따른 인공지능 기반의 인플루언서 및 브랜드를 매칭하는 과정을 설명하기 위한 블록도이다. 도 4는 일실시예에 따른 제1 인공신경망의 학습을 설명하기 위한 도면이다. 도 5는 일실시예에 따른 제1 입력 신호를 생성하는 과정을 설명하기 위한 개념도이다. 도 6은 일실시예에 따른 제1 인공신경망을 설명하기 위한 도면이다. 도 7은 일실시예에 따른 제2 인공신경망의 학습을 설명하기 위한 도면이다. 도 8은 일실시예에 따른 제3 인공신경망의 학습을 설명하기 위한 도면이다. 도 9는 일실시예에 따른 인플루언서 선정 정보를 생성하는 과정을 설명하기 위한 순서도이다. 도 10은 일실시예에 따른 수학식 1을 설명하기 위한 도면이다. 도 11은 일실시예에 따른 인플루언서의 마케팅 이력 등급을 업데이트하는 과정을 설명하기 위한 순서도이다. 도 12는 일실시예에 따른 제1 사용자 단말로부터 공동구매 마케팅 승인 메시지를 수신하는 과정을 설명하기 위 한 순서도이다. 도 13은 일실시예에 따른 인플루언서의 총 정산금을 산출하는 과정을 설명하기 위한 순서도이다. 도 14는 일실시예에 따른 제5 인공신경망의 학습을 설명하기 위한 도면이다. 도 15는 일실시예에 따른 링크의 조회수에 따른 공동구매 마케팅의 중단 여부를 판단하는 과정을 설명하기 위한 순서도이다. 도 16은 일실시예에 따른 컨텐츠의 정독 시간을 산출하여 광고주의 허용 범위를 설정하는 과정을 설명하기 위한 순서도이다. 도 17은 일실시예에 따른 컨텐츠의 정독 시간을 예측하여 컨텐츠의 추천 정보를 제공하는 과정을 설명하기 위한 순서도이다. 도 18은 일실시예에 따른 장치의 구성의 예시도이다."}
