{"patent_id": "10-2022-0134122", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0053960", "출원번호": "10-2022-0134122", "발명의 명칭": "음성 인식기의 성능을 측정하는 장치, 방법 및 컴퓨터 프로그램", "출원인": "주식회사 케이티", "발명자": "김철우"}}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "음성 인식기의 성능을 측정하는 장치에 있어서,음성 인식기의 음성 인식 결과 데이터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받는 입력부;유사 전사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처리하는 정규화처리부;상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 문자열을 추출하는추출부; 및상기 추출된 일치 문자열에 기초하여 상기 음성 인식 결과 데이터를 평가하는 평가부를 포함하는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,기입력된 복수의 전사 데이터에 기초하여 상기 유사 전사 단어 사전을 생성하는 사전 생성부를 더 포함하는, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 사전 생성부는 상기 기입력된 복수의 전사 데이터의 각각에 포함되는 어절 전사 결과에 기초하여 유사 전사 단어 그룹을 생성하고, 상기 생성된 유사 전사 단어 그룹에 대한 대표 단어를 설정하는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 정규화 처리부는 상기 음성 인식 결과 데이터 및 상기 전사 데이터에 포함되는 단어 중 상기 유사 전사 단어 그룹에 포함되는 단어를 상기 유사 전사 단어 그룹에 대한 상기 대표 단어로 변환시키는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 추출부는 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 여부를 비교한 결과에 기초하여 상기 일치 문자열을 추출하는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0053960-3-제 1 항에 있어서,상기 추출부는 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터로부터 상기 추출된 일치 문자열의 주변에 위치하는 적어도 하나의 문장을 추출하고,상기 적어도 하나의 문장에 대하여 일치 문자열을 추출하는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 추출부는 상기 일치 문자열의 주변에 문장이 존재하는지 확인하고, 확인 결과에 기초하여 상기 일치 문자열을 추출하는 과정을 반복하는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 평가부는 상기 음성 인식 결과 데이터에 대한 평가 결과에 기초하여 음소 인식율을 도출하고, 상기 도출된음소 인식율에 기초하여 상기 음성 인식기가 발음 모델 강화 학습 대상에 해당하는지 또는 언어 모델 강화 학습대상에 해당하는지 여부를 구분하는 것인, 성능 측정 장치."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "음성 인식기의 성능을 측정하는 방법에 있어서,음성 인식기의 음성 인식 결과 데이터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받는단계;유사 전사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처리하는 단계;상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 문자열을 추출하는단계; 및상기 추출된 일치 문자열에 기초하여 상기 음성 인식 결과 데이터를 평가하는 단계를 포함하는 것인, 성능 측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,기입력된 복수의 전사 데이터에 기초하여 상기 유사 전사 단어 사전을 생성하는 단계를 더 포함하는, 성능 측정방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 유사 전사 단어 사전을 생성하는 단계는 상기 기입력된 복수의 전사 데이터의 각각에 포함되는 어절 전사 결과에 기초하여 유사 전사 단어 그룹을 생성하는 단계; 및상기 생성된 유사 전사 단어 그룹에 대한 대표 단어를 설정하는 단계공개특허 10-2024-0053960-4-를 포함하는 것인, 성능 측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 정규화 처리하는 단계는 상기 음성 인식 결과 데이터 및 상기 전사 데이터에 포함되는 단어 중 상기 유사전사 단어 그룹에 포함되는 단어를 상기 유사 전사 단어 그룹에 대한 상기 대표 단어로 변환시키는 것인, 성능측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 추출하는 단계는 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 여부를 비교한 결과에 기초하여 상기 일치 문자열을 추출하는 것인, 성능 측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 9 항에 있어서,상기 추출하는 단계는 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터로부터 상기 추출된 일치 문자열의 주변에 위치하는 적어도 하나의 문장을 추출하고, 상기 적어도 하나의 문장에 대하여일치 문자열을 추출하는 것인, 성능 측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 추출하는 단계는 상기 일치 문자열의 주변에 문장이 존재하는지 확인하고, 확인 결과에 기초하여 상기 일치 문자열을 추출하는 과정을 반복하는 것인, 성능 측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 9 항에 있어서,상기 평가하는 단계는 상기 음성 인식 결과 데이터에 대한 평가 결과에 기초하여 음소 인식율을 도출하는 단계; 및상기 도출된 음소 인식율에 기초하여 상기 음성 인식기가 발음 모델 강화 학습 대상에 해당하는지 또는 언어 모델 강화 학습 대상에 해당하는지 여부를 구분하는 단계를 포함하는 것인, 성능 측정 방법."}
{"patent_id": "10-2022-0134122", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "음성 인식기의 성능을 측정하는 명령어들의 시퀀스를 포함하는 컴퓨터 판독가능 기록매체에 저장된 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램은 컴퓨팅 장치에 의해 실행될 경우,음성 인식기의 음성 인식 결과 데이터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받고,공개특허 10-2024-0053960-5-유사 전사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처리하고,상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 문자열을 추출하고,상기 추출된 일치 문자열에 기초하여 상기 음성 인식 결과 데이터를 평가하도록 하는 명령어들의 시퀀스를 포함하는 것인, 컴퓨터 판독가능 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "음성 인식기의 성능을 측정하는 장치는 음성 인식기의 음성 인식 결과 데이터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받는 입력부, 유사 전사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처리하는 정규화 처리부, 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리 된 전사 데이터 간의 일치 문자열을 추출하는 추출부 및 상기 추출된 일치 문자열에 기초하여 상기 음성 인식 결 과 데이터를 평가하는 평가부를 포함한다."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 음성 인식기의 성능을 측정하는 장치, 방법 및 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "음성 인식이란 마이크와 같은 소리 센서를 통해 얻은 음향학적 신호(acoustic speech signal)로부터 단어나 단 어열을 식별하고 의미를 추출하는 처리 과정을 통해 음성으로부터 언어적 의미 내용을 식별하는 기술을 말한다. 음성 인식 기술이 발전하면서 이를 이용한 인공지능 자동 응답 시스템이 다양한 분야에서 적용되고 있다. 인공 지능 자동 응답 시스템은 적용되는 분야 및 응답해야 할 서비스 종류에 따라 인식해야할 키워드와 문장이 매우 다양하다. 인공지능 자동 응답 시스템을 학습시키기 위하여 해당 분야의 상담자와 고객 간의 대화를 녹취한 파일 및 녹취 한 파일을 받아쓰기한 전사 데이터를 학습 데이터로 수집하고 있다. 인공지능 자동 응답 시스템의 성능을 향상 시키기 위해서 방대한 양의 학습 데이터를 수집하는 경우에 많은 비용과 시간이 소요되는 문제점이 있었다. 음성 인식 결과를 글자 단위로 평가하는 경우에, 음성 인식된 텍스트에 잘못 삭제된 음절 수가 D이고, 음성 인 식된 텍스트에 잘못 대체된 음절 수가 S이고, 음성 인식된 텍스트에 잘못 추가된 음절 수가 I이고, 정답 텍스트 의 음절 수가 N일 때, 음절 에러 비율(Chatacter Error Rate; CER)은 (S+D+I)/N로 계산될 수 있다. 또한, 음성 인식 결과를 키워드 단위로 평가하는 경우에, 음성 인식된 텍스트에 잘못 삭제된 단어 수가 D이고, 음성 인식된 텍스트에 잘못 대체된 단어 수가 S이고, 음성 인식된 텍스트에 잘못 추가된 단어 수가 I이고, 정답 텍스트의 단어 수가 N일 때, 단어 에러 비율(Word Error Rate; WER)은 (S+D+I)/N로 계산될 수 있다. 음성 인식 결과를 글자 단위로 평가하거나, 키워드 단위로 평가하는 두 경우 모두, 인식된 데이터에서 의미와는 관계없이 초성, 중성 또는 종성 하나만 다른 경우에도 오류로 처리될 수 있다. 또한, 녹취한 파일을 받아쓰기한 전사 데이터의 경우에 발화자의 발화 특성, 파일의 품질 및 전사 작업을 수행하는 작업자들 간의 편차에 따라서 학습 데이터의 품질이 일정하지 못한 문제점이 존재하였다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제 10-2300427호 (2021.09.03. 등록)"}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 음성 인식기의 음성 인식 결과 데이터 및 음 성 인식 결과 데이터에 대응하는 전사 데이터를 입력받고, 유사 전사 단어 사전에 기초하여 음성 인식 결과 데 이터 및 전사 데이터를 정규화 처리하고, 정규화 처리된 음성 인식 결과 데이터 및 정규화 처리된 전사 데이터 간의 일치 문자열을 추출하고, 추출된 일치 문자열에 기초하여 음성 인식 결과 데이터를 평가하는 음성 인식기 의 성능 측정 방법을 제공하고자 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 수단으로서, 본 발명의 일 실시예는, 음성 인식기의 성능을 측정하는 장치 에 있어서, 음성 인식기의 음성 인식 결과 데이터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입 력받는 입력부, 유사 전사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처 리하는 정규화 처리부, 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일 치 문자열을 추출하는 추출부 및 상기 추출된 일치 문자열에 기초하여 상기 음성 인식 결과 데이터를 평가하는 평가부를 포함할 수 있다. 일 실시예에서, 기입력된 복수의 전사 데이터에 기초하여 상기 유사 전사 단어 사전을 생성하는 사전 생성부를 더 포함할 수 있다. 일 실시예에서, 상기 사전 생성부는 상기 기입력된 복수의 전사 데이터의 각각에 포함되는 어절 전사 결과에 기 초하여 유사 전사 단어 그룹을 생성하고, 상기 생성된 유사 전사 단어 그룹에 대한 대표 단어를 설정할 수 있다. 일 실시예에서, 상기 정규화 처리부는 상기 음성 인식 결과 데이터 및 상기 전사 데이터에 포함되는 단어 중 상 기 유사 전사 단어 그룹에 포함되는 단어를 상기 유사 전사 단어 그룹에 대한 상기 대표 단어로 변환시킬 수 있 다. 일 실시예에서, 상기 추출부는 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 여부를 비교한 결과에 기초하여 상기 일치 문자열을 추출할 수 있다. 일 실시예에서, 상기 추출부는 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 로부터 상기 추출된 일치 문자열의 주변에 위치하는 적어도 하나의 문장을 추출하고, 상기 적어도 하나의 문장 에 대하여 일치 문자열을 추출할 수 있다. 일 실시예에서, 상기 추출부는 상기 일치 문자열의 주변에 문장이 존재하는지 확인하고, 확인 결과에 기초하여 상기 일치 문자열을 추출하는 과정을 반복할 수 있다. 일 실시예에서, 상기 평가부는 상기 음성 인식 결과 데이터에 대한 평가 결과에 기초하여 음소 인식율을 도출하 고, 상기 도출된 음소 인식율에 기초하여 상기 음성 인식기가 발음 모델 강화 학습 대상에 해당하는지 또는 언 어 모델 강화 학습 대상에 해당하는지 여부를 구분할 수 있다. 본 발명의 다른 실시예는, 음성 인식기의 성능을 측정하는 방법에 있어서, 음성 인식기의 음성 인식 결과 데이 터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받는 단계, 유사 전사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처리하는 단계, 상기 정규화 처리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 문자열을 추출하는 단계 및 상기 추출된 일치 문자열에 기초하여 상기 음성 인식 결과 데이터를 평가하는 단계를 포함할 수 있다. 본 발명의 또 다른 실시예는, 음성 인식기의 성능을 측정하는 명령어들의 시퀀스를 포함하는 컴퓨터 판독가능 기록매체에 저장된 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램은 컴퓨팅 장치에 의해 실행될 경우, 음성 인식기의 음성 인식 결과 데이터 및 상기 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받고, 유사 전 사 단어 사전에 기초하여 상기 음성 인식 결과 데이터 및 상기 전사 데이터를 정규화 처리하고, 상기 정규화 처 리된 음성 인식 결과 데이터 및 상기 정규화 처리된 전사 데이터 간의 일치 문자열을 추출하고, 상기 추출된 일 치 문자열에 기초하여 상기 음성 인식 결과 데이터를 평가하도록 하는 명령어들의 시퀀스를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본 발명을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 기재된 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 음성 인식기의 음성 인식 결과 데이터 및 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받고, 유사 전사 단어 사전에 기초하여 음성 인식 결과 데이터 및 전사 데이터를 정규화 처리하고, 정규화 처리된 음성 인식 결과 데이터 및 정규화 처리된 전사 데이터 간의 일 치 문자열을 추출하고, 추출된 일치 문자열에 기초하여 음성 인식 결과 데이터를 평가할 수 있다. 또한, 전사 데이터의 오류가 존재하는 경우에도 음성 인식기의 성능을 높은 정확도로 평가하는 방법을 제공할 수 있다. 또한, 음성 인식기의 성능을 평가한 결과에 기초하여 음성 인식기의 성능을 개선할 수 있는 적절한 방법을 제공 할 수 있다."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 '전기적으로 연결'되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 '포함'한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수 들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에 서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분 리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 이하에서 언급되는 '네트워크'는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구 조를 의미하는 것으로, 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터 넷 (WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이 터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 블루투스 통신, 적외선 통신, 초음파 통신, 가시광 통신(VLC: Visible Light Communication), 라이파이(LiFi) 등이 포함되나 이에 한정되지는 않는 다. 본 명세서에 있어서 단말 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말 또는 디 바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말 또는 디바이스에서 수행될 수도 있다. 이하 첨부된 도면을 참고하여 본 발명의 일 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 성능 평가 장치의 구성도이다. 도 1을 참조하면, 성능 평가 장치는 입 력부, 사전 생성부, 정규화 처리부, 추출부 및 평가부를 포함할 수 있다. 성능 평가 장치는 음성 인식기의 음성 인식 결과에 오류가 존재하는지 여부에 기초하여 음성 인식기의 성 능을 평가할 수 있다. 성능 평가 장치는 음성 인식기의 성능을 평가하는 기준이 되는 정답 데이터로 음성 인식 결과 데이터에 대응하는 전사 데이터를 이용할 수 있다. 입력부는 음성 인식기의 음성 인식 결과 데이터 및 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력 받을 수 있다. 입력부는 예를 들어, 음성 인식기, 사용자 단말, 외부 서버, 클라우드 또는 외부 장치로부 터 음성 인식 결과 데이터 및 음성 인식 결과 데이터에 대응하는 전사 데이터를 입력받을 수 있다. 여기서, 음성 인식 결과 데이터는 발화자의 음성을 녹음한 음성 데이터를 음성 인식기가 인식 처리를 통해 텍스 트로 변환한 결과값을 나타낼 수 있다. 전사 데이터는 작업자가 음성 데이터를 듣고 텍스트화하는 전사 작업을 실시한 결과를 나타낼 수 있다. 전사 데이터는 발화자의 발화 특성, 파일의 품질 및 전사 작업을 수행하는 작업자들 간의 작업 능력, 배경 지식 등의 편차에 따라서 오류를 포함할 수 있다. 오류를 포함하는 전사 데이터를 학습 데이터로 하는 경우에 음성 인식기의 성능에 한계가 생길 수 있다. 또한, 음성 인식 결과 데이터 및 전사 데이터에 존재하는 오류의 중요도, 즉 데이터에서 의미가 통하는지 여부와 무관하게 학습 및 평가가 이루어지는 문제점이 있다. 도 2를 참조하면 동일한 음성 데이터에 대하여 전사 데이터는 전사자마다 차이가 있을 수 있다. 도 2에 도 시된 예와 같이 동일한 음성 데이터에 대하여, 전사자 a의 작업 결과 A는 '예 이제 그럼 그게 올른다는 거지 요'(14자)이고, 전사자 b의 작업 결과 B는 '네 인제 그람 그 오른다는 것이죠'(13자)이고, 전사자 c의 작업 결 과 C는 '네 이제 그러면 그것이 올른다는 것이지요'(17자)일 수 있다. 이 경우에 A, B 및 C 중 어느 작업 결과 를 기준으로 음성 인식기의 음성 인식 결과 데이터를 평가하는지에 따라, 평가 결과가 다르게 도출될 수 있다. 음성 인식 결과 데이터인 음성 인식기 t1의 음성 인식 결과 T1이 '네 인제 그러면 그것이 오른다는 것이지 요'(17자)인 경우에, 각 전사 데이터와 음성 인식 결과 데이터의 일치 여부를 비교한 결과는 다 르게 도출될 수 있다. A를 기준으로 T1을 평가한 경우에는 '네* 인*제 그러*면* 그것*이* 오*른다는 것*이*지요'와 같이 10자 오류로 나타나고, B를 기준으로 T1을 평가한 경우에는 '네 인제 그러*면* 그것*이* 오 른다는 것이지*요*'와 같이 6자 오류로 나타나고, C를 기준으로 T1을 평가한 경우에는 '네 인*제 그러면 그것이 오*른다는 것이지요'와 같이 2자 오류로 나타날 수 있다. 여기서 *는 오류가 존재하는 곳을 표시한 것이다. 상기 문제점을 해결하기 위하여, 본 발명은 음성 인식 결과 데이터 및 전사 데이터에 대하여 유사 전사 단어 사 전을 이용한 정규화 처리를 수행할 수 있다. 사전 생성부는 기입력된 복수의 전사 데이터에 기초하여 유사 전사 단어 사전을 생성할 수 있다. 유사 전 사 단어 사전은 발음과 의미가 유사한 단어들로 하나의 대표 단어로 통용될 수 있는 단어들의 그룹에 기초하여 생성된 것일 수 있다. 유사 전사 단어 사전은 유사 전사 단어 그룹 및 각 그룹에 대응하는 대표 단어에 관한 정 보를 포함할 수 있다. 사전 생성부는 기입력된 복수의 전사 데이터의 각각에 포함되는 어절 전사 결과에 기초하여 유사 전사 단 어 그룹을 생성할 수 있다. 예를 들어, 사전 생성부는 기입력된 복수의 전사 데이터에서 어절 단위로 결과를 비교하여 상이한 값을 갖 는 어절에 포함되는 단어를 유사 전사 단어 그룹으로 추출할 수 있다. 다른 예를 들어, 사전 생성부는 기입력된 복수의 전사 데이터에 있어서 오류가 발생하는 빈도가 기설정된 값 이상인 단어를 추출함으로써 유사 전사 단어 그룹을 생성할 수 있다. 또 다른 예를 들어, 사전 생성부는 기입력된 복수의 전사 데이터에서 동일한 음성 구간에 대한 전사 결과 가 상이한 경우, 전사된 단어를 추출함으로써 유사 전사 단어 그룹을 생성할 수 있다. 사전 생성부는 생성된 유사 전사 단어 그룹에 대한 대표 단어를 설정할 수 있다. 대표 단어는 예를 들어, 유사 전사 단어 그룹에 포함되는 단어 중 어느 하나로 설정될 수 있다. 일 실시예에서, 사전 생성부는 유사 전사 단어 그룹에 포함되는 단어 중 전사 데이터에서 발생 빈도가 가 장 높은 단어를 대표 단어로 설정할 수 있다.다른 실시예에서, 사전 생성부는 유사 전사 단어 그룹에 포함되는 단어 중 표준어에 해당하는 단어 중 어 느 하나를 대표 단어로 설정할 수 있다. 예를 들어, 기입력된 복수의 전사 데이터에서 동일한 음성 구간에 대한 전사 결과가 R1, R2, R3로 모두 상이한 경우에, R1, R2, R3를 포함하는 유사 전사 단어 그룹이 생성될 수 있다. 또한, R1, R2, R3 중에서 R1이 유사 전 사 단어 그룹의 대표 단어로 설정될 수 있다. 도 3은 본 발명의 일 실시예에 따른 유사 전사 단어 사전을 설명하기 위한 예시적인 도면이다. 도 3을 참조하면, '예', '네'를 포함하는 유사 전사 단어 그룹의 대표 단어는 '네'로 설정될 수 있다. '이제', '인제' 를 포함하는 유사 전사 단어 그룹의 대표 단어는 '이제'로 설정될 수 있다. 정규화 처리부는 유사 전사 단어 사전에 기초하여 음성 인식 결과 데이터 및 전사 데이터를 정규화 처리할 수 있다. 여기서 정규화 처리는 유사 전사 단어 그룹에 포함되는 단어를 해당하는 유사 전사 단어 그룹에 대한 대표 단어로 변환시키는 처리를 의미할 수 있다. 즉, 정규화 처리부는 음성 인식 결과 데이터 및 전사 데이터에 포함되는 단어 중 유사 전사 단어 그룹에 포함되는 단어를 유사 전사 단어 그룹에 대한 대표 단어로 변환시킬 수 있다. 예를 들어, 도 2에 도시된 전사 데이터인 전사자 a의 작업 결과 A, 전사자 b의 작업 결과 B 및 전사자 c의 작업 결과 C를 도 3의 유사 전사 단어 사전에 기초하여 정규화 처리하는 경우, 정규화 처리 후의 A, B 및 C는 모두 '네 이제 그럼 그게 올른다는 거지요'(14자)로 동일하게 나타날 수 있다. 또한, 도 2에 도시된 음성 인식 결과 데이터인 음성 인식기 t1의 음성 인식 결과 T1을 도 3의 유사 전사 단어 사전에 기초하여 정규화 처리하는 경우, 정규화 처리 후의 T1은 '네 이제 그럼 그게 올른다는 거지요'(14 자)로 나타날 수 있다. 도 4는 본 발명의 일 실시예에 따라 음성 인식기의 성능을 평가하는 방법을 설명하기 위한 예시적인 도면이다. 도 4를 참조하면, 성능 평가 장치는 음성 인식 결과 데이터 및 전사 데이터를 입력받을 수 있다. 전 사 데이터로 입력받은 전사자 d의 작업 결과 D가 '예 이제 그럼 코스피가 올른다는 거지요'(15자)이고, 음 성 인식 결과 데이터인 음성 인식기 t2의 음성 인식 결과 T2가 '네 인제 그러면 코엑스가 오른다는 것이지 요'(18자)인 경우에, 성능 평가 장치는 음성 인식 결과 데이터 및 전사 데이터를 정규화 처리할 수 있다. 성능 평가 장치는 유사 전사 단어 사전에 기초하여 음성 인식 결과 데이터 및 전사 데이터를 정규화 처리할 수 있다. 정규화 처리 후의 전사 데이터는 '네 이제 그럼 코스피가 올른다는 거지요'(16자)이고, 정규화 처리 후의 음성 인식 결과 데이터는 '네 이제 그럼 코엑스가 올른다는 거지요'(16자)로 나타날 수 있다. 성능 평가 장치는 정규화 처리 후의 전사 데이터를 기준으로 하여 정규화 처리 후의 음성 인식 결과 데이 터에 오류가 존재하는지 여부를 판단함으로써 음성 인식기 t2의 성능을 측정할 수 있다. 예를 들어, 성능 평가 장치는 정규화 처리 후의 전사 데이터와 정규화 처리 후의 음성 인식 결과 데이터 를 어절 단위로 비교하여 서브스코어를 도출하고, 도출된 서브 스코어에 기초하여 스코어를 도출할 수 있 다. 도 4의 평가 데이터를 참조하면, 음성 인식 결과 데이터에서 '코스피'가 '코엑스'로 잘못 인식된 것을 확인할 수 있다. 평가 데이터에 기초하여 '코스피'라는 키워드를 포함하는 음성 데이터가 신규 학습 대상으로 선별될 수 있 다. 추출부는 정규화 처리된 음성 인식 결과 데이터 및 정규화 처리된 전사 데이터 간의 일치 문자열을 추출할 수 있다. 추출부는 정규화 처리된 음성 인식 결과 데이터 및 정규화 처리된 전사 데이터 간의 일치 여부를 비교한 결과에 기초하여 일치 문자열을 추출할 수 있다. 추출부는 정규화 처리된 음성 인식 결과 데이터 및 정규화 처리된 전사 데이터로부터 추출된 일치 문자열 의 주변에 위치하는 적어도 하나의 문장을 추출할 수 있다. 예를 들어, 추출부는 추출된 일치 문자열 중 최장 길이의 일치 문자열을 기준으로, 이전에 위치하는 문자 열을 머리 문장이라 하고, 추출된 일치 문자열의 이후에 위치하는 문자열을 꼬리 문장으로 추출할 수 있다.추출부는 추출된 일치 문자열의 주변에 위치하는 적어도 하나의 문장에 대하여 다시 일치 문자열을 추출하 는 과정을 수행할 수 있다. 예를 들어, 추출부는 머리 문장으로부터 추출된 일치 문자열 중 최장 길이의 일치 문자열을 기준으로 이전 에 위치하는 문자열 및 이후에 위치하는 문자열을 추출할 수 있다. 추출부는 일치 문자열의 주변에 문장이 존재하는지 확인하고, 확인 결과에 기초하여 일치 문자열을 추출하 는 과정을 반복할 수 있다. 도 5는 음성 인식기의 성능을 평가하는 방법을 설명하기 위한 예시적인 도면이다. 도 5에 도시된 바와 같이 정 규화 처리 후의 전사 데이터 '네 네 안녕하세요 네 예 예 네 네 네 네 네 네 예 예 네 알겠습니다 네 고맙습 네 고맙습니다' 및 정규화 처리 후의 음성 인식 결과 데이터 '네 네 안녕하세요 네 예 예 네 음 네 예 네 네 예 예 네 알겠습니다 네 고맙습니다 그리고요'에 대하여 일치 문자열을 추출할 수 있다. 도 5의 (a)는 종래 기술인 레벤슈타인 알고리즘에 기초한 것으로 두 문장을 순차적으로 비교하는 반면에, 본 발 명의 일 실시예 따른 방법은 (b)에 도시된 바와 같이 최장 길이의 일치 문자열을 추출하고, 추출된 일치 문자열 을 중심으로 이전에 위치하는 머리 문장 및 이후에 위치하는 꼬리 문장을 추출하고, 머리 문장 및 꼬리 문장에 대하여 최장 길이의 일치 문자열을 추출하는 방식의 알고리즘을 이용한다. 이 때 일치 문자열의 주변에 문장이 존재하는지 확인하여, 문장이 존재하지 않을 때까지 일치 문자열을 추출하는 과정이 반복될 수 있다. 즉, 문장에 위치하는 문자열을 앞에서부터 순차적으로 비교하는 루벤슈타인 알고리즘과 달리, 본 발명은 전체 문장에서 가장 길게 일치하는 부분을 추출하고, 추출된 부분을 기준으로 이전에 위치하는 문자열과 이후에 위치 하는 문자열을 추출하고, 추출된 문자열에 대하여 다시 가장 길게 일치하는 부분을 추출하는 과정을 반복하도록 진행할 수 있다. 평가부는 추출된 일치 문자열에 기초하여 음성 인식 결과 데이터를 평가할 수 있다. 평가부는 음성 인식 결과 데이터에 대한 평가 결과에 기초하여 음소 인식율을 도출하고, 도출된 음소 인식 율에 기초하여 음성 인식기가 발음 모델 강화 학습 대상에 해당하는지 또는 언어 모델 강화 학습 대상에 해당하 는지 여부를 구분할 수 있다. 예를 들어, 평가부는 도출된 음소 인식율이 기설정된 값 이하인 경우에는 언어 모델 강화 학습 대상에 해 당하고, 기설정된 값 이상인 경우에는 발음 모델 강화 학습 대상에 해당하는 것으로 구분할 수 있다. 기설정된 값은 예를 들어, 0.5일 수 있다. 도 6은 본 발명의 일 실시예에 따른 성능 평가 방법의 순서도이다. 도 6에 도시된 성능 평가 장치에서 수 행되는 음성 인식기의 성능을 평가하는 방법은 도 1에 도시된 실시예에 따라 성능 평가 장치에 의해 시계열적으로 처리되는 단계들을 포함한다. 따라서, 이하 생략된 내용이라고 하더라도 도 1에 도시된 실시예에 따라 성능 평가 장치에서 수행되는 음성 인식기의 성능을 평가하는 방법에도 적용된다. 단계 S610에서 성능 평가 장치는 음성 인식기의 음성 인식 결과 데이터 및 음성 인식 결과 데이터에 대응 하는 전사 데이터를 입력받을 수 있다. 단계 S620에서 성능 평가 장치는 유사 전사 단어 사전에 기초하여 음성 인식 결과 데이터 및 전사 데이터 를 정규화 처리할 수 있다. 단계 S630에서 성능 평가 장치는 정규화 처리된 음성 인식 결과 데이터 및 정규화 처리된 전사 데이터 간 의 일치 문자열을 추출할 수 있다. 단계 S640에서 성능 평가 장치는 추출된 일치 문자열에 기초하여 음성 인식 결과 데이터를 평가할 수 있다. 상술한 설명에서, 단계 S610 내지 S640은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 전환될 수도 있다. 도 1 내지 도 6을 통해 설명된 성능 평가 장치에서 음성 인식기의 성능을 평가하는 방법은 컴퓨터에 의해 실행 되는 매체에 저장된 컴퓨터 프로그램 또는 컴퓨터에 의해 실행 가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다.컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매 체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보 의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한 다."}
{"patent_id": "10-2022-0134122", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2022-0134122", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 성능 평가 장치의 구성도이다. 도 2는 종래의 음성 인식기의 성능 평가 방법을 설명하기 위한 도면이다. 도 3은 본 발명의 일 실시예에 따른 유사 전사 단어 사전을 설명하기 위한 예시적인 도면이다. 도 4는 본 발명의 일 실시예에 따라 음성 인식기의 성능을 평가하는 방법을 설명하기 위한 예시적인 도면이다. 도 5는 본 발명의 일 실시예에 따라 음성 인식기의 성능을 평가하는 방법을 설명하기 위한 예시적인 도면이다. 도 6은 본 발명의 일 실시예에 따른 성능 평가 방법의 순서도이다."}
