{"patent_id": "10-2024-0034063", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0053683", "출원번호": "10-2024-0034063", "발명의 명칭": "위협 시나리오를 판단하는 방법", "출원인": "(주)아스트론시큐리티", "발명자": "조근석"}}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위협 시나리오를 판단하는 방법으로서,클라우드 환경에서 획득된 사용자의 API 이벤트 정보 중 미리 정해진 조건에 따라 복수의 대상 API 이벤트를 결정하는 단계 - 상기 미리 정해진 조건은 이벤트의 빈도, 시간적 분포, 발생 위치, 연관된 사용자 및 API 이벤트유형 중 적어도 하나와 관련됨 -;상기 복수의 대상 API 이벤트 각각을 유형에 따라 분류된 위협 행위에 매핑하는 단계;상기 복수의 위협 행위 중 적어도 하나의 위협 행위가 포함된 적어도 하나의 위협 행위 세트를 결정하는 단계;상기 위협 행위 세트에 기반하여 데이터 베이스에 미리 저장된 복수의 참조 시나리오 중 적어도 하나의 후보 시나리오를 결정하는 단계;상기 후보 시나리오에 대해 상기 위협 행위 세트와 비교하여 보안 지표 정보를 산출하는 단계;상기 보안 지표 정보에 기반하여 상기 후보 시나리오 중 예상 위협 시나리오를 결정하는 단계; 및상기 예상 위협 시나리오에 기반하여 사용자 단말에 솔루션 정보를 제공하는 단계를 포함하고,상기 위협 행위 세트 결정 단계는,상기 위협 행위를 상기 위협 행위의 발생 빈도, 시간적 분포, 발생 위치 및 연관된 사용자 중 적어도 하나에 관련된 분류 조건에 따라 분류하는 단계를 더 포함하고,상기 위협 행위 세트는 동일한 상기 분류 조건에 따라 결정된 위협 행위로 구성되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 위협 행위의 세부 분류 유형은, 전술 그룹의 정보, 기법의 정보, 세부 기법의 정보를 포함하는 - 상기 전술 그룹은 적어도 하나의 상기 기법을 포함하는 상위 개념이고, 상기 기법은 적어도 하나의 상기 세부 기법을포함하는 상위 개념임 -,위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 보안 지표 정보는 일치도 정보 및 위험도 정보를 포함하는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 일치도 정보는 상기 후보 시나리오가 포함하는 위협 행위에 대한 유형 관련성에 기반하여 산출되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,공개특허 10-2025-0053683-3-상기 위협 행위의 세부 분류 유형은, 전술 그룹의 정보, 기법의 정보, 세부 기법의 정보를 포함하고 - 상기 전술 그룹은 적어도 하나의 상기 기법을 포함하는 상위 개념이고, 상기 기법은 적어도 하나의 상기 세부 기법을포함하는 상위 개념임 -,상기 유형 관련성은 상기 후보 시나리오가 포함하는 위협 행위의 상기 세부 분류 유형에 포함되는 전술 그룹 정보, 기법 정보, 세부 기법 정보 각각의 일치 여부에 따라 차등적으로 유형 관련성에 대응되는 지표가 산출되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 보안 지표 정보는 위험도 정보를 포함하고,상기 데이터베이스에 미리 저장된 복수의 참조 시나리오는, 각각에 대응된 위험 지표를 포함하고,상기 위험도 정보는 상기 위험 지표 및 상기 위협 행위 세트와 상기 후보 시나리오에 포함되는 위협 행위를 비교하여 생성된 진척도 정보에 기반하여 산출되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 데이터 베이스에 미리 저장된 복수의 참조 시나리오는, 위협 행위 분석 매트릭스에 포함되는 복수의 기법중 선택된 적어도 일부의 위협 행위로 구성된 시나리오인 - 상기 위협 행위 분석 매트릭스는 복수의 전술 그룹및 상기 전술 그룹에 포함되는 적어도 하나의 기법으로 구성됨 -위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 후보 시나리오를 결정하는 단계는,사이버 공격 단계 유형에 더 기반하여 상기 후보 시나리오를 결정하고,상기 사이버 공격 단계 유형은 사이버 킬체인(Cyber Kill Chain)모델에 기반한 사전 단계, 공격 단계 및 후속단계를 포함하며, 각각의 순서는 시간적 발생 순서 또는 인과 관계에 따라 결정되고,상기 위협 행위는 상기 사이버 공격 단계 유형 중 적어도 하나에 대응되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 솔루션 정보는 상기 예상 위협 시나리오 중에서 가장 마지막에 발생한 위협 행위에 대응되는 상기 사이버공격 단계 유형에 따라 결정되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9 항에 있어서,상기 사이버 공격 단계 유형이 상기 사전 단계에 해당하는 경우, 사용자에게 초기 침투 시도에 대한 경고 및 방어 방안을 제공하고,상기 사이버 공격 단계 유형이 상기 공격 단계에 해당하는 경우, 사용자에게 현재 진행 중인 공격에 대한 세부정보와 그에 대한 대응 방안을 제공하고,공개특허 10-2025-0053683-4-상기 사이버 공격 단계 유형이 상기 후속 단계에 해당하는 경우, 사용자에게 공격 후 발생 가능한 위협, 예방책및 복구 방안을 제공하는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9 항에 있어서,상기 사이버 공격 단계 유형에 따라 상기 미리 정해진 조건 중 적어도 하나를 결정하는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서,상기 사용자 단말로부터 분류 조건에 대응되는 가중치 정보를 획득하는 단계; 및상기 가중치 정보에 기반하여 상기 분류 조건의 범위를 결정하는 임계치 정보를 변경하는 단계를 포함하는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1 항에 있어서,상기 위협 행위 세트는 인공지능 기반의 분류 알고리즘에 기반하여 결정되며,상기 분류 알고리즘은 기계학습, 딥러닝 또는 강화 학습 중 적어도 하나를 포함하는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1 항에 있어서,상기 데이터 베이스는 각각의 상기 참조 시나리오에 포함되는 위협 행위 간의 시간 간격 및 인과 관계에 대한관계 정보를 저장하고 있고,상기 위협 행위 세트를 결정하는 단계는,상기 관계 정보에 기반하여 결정되는위협 시나리오를 판단하는 방법."}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 위협 시나리오를 판단하는 방법은 클라우드 환경에서 획득된 사용자의 API 이벤트 정보 중 미리 정해 진 조건에 따라 복수의 대상 API 이벤트를 결정하는 단계 - 상기 미리 정해진 조건은 이벤트의 빈도, 시간적 분 포, 발생 위치, 연관된 사용자 및 API 이벤트 유형 중 적어도 하나와 관련됨 -, 상기 복수의 대상 API 이벤트 각 (뒷면에 계속)"}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 생성형AI를 이용하여 위협 시나리오를 판단하는 방법으로서, 보다 상세히 설명하면 AI의 패턴 인식 및 학습 능력을 기반으로 의심되는 복수의 위협 시나리오를 생성하고, 생성된 위협 시나리오를 정밀하게 평가한 후 평가 결과를 기반으로 생성된 솔루션을 제공하여 사이버 공격 전 사용자에게 선제적인 솔루션을 제공할 수 있도록 하는, 방법에 관한 것이다."}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 사이버 공격을 방어하고 대응하는 수단은 네트워크 장치와 애플리케이션 수준 솔루션으로 구현되고, 감사(audit) 목적이나 침해사고를 당하였을 때 사고 분석 및 대응을 위해 시스템의 로그 보관이 이루어진다. 네트워크 장치에 의한 사이버 공격 방어는 라우터, 스위치와 같은 네트워크 장치, 침입탐지시스템(IDS; Intrusion Detection System), 방화벽과 같은 범용 네트워크 보안 장치, 웹 방화벽(WAF; Web ApplicationFirewall), 안티 DDoS 장비와 같은 애플리케이션 수준 네트워크 보안 장치 등이 있다. 애플리케이션 수준 솔루션에 의한 사이버 공격 방어는 디지털 저작권 관리(DRM; Digital Rights Management), 안티바이러스(AV; Anti Virus) 등이 있다. 최근 들어 사이버 공격은 발생 빈도가 잦아지고, 그 방법 또한 정교해지고 있다. 이러한 사이버 공격의 예로, 특정 조직을 대상으로 오랜 시간 지속적으로 공격을 수행하여 데이터의 유출과 같은 공격 목표를 달성하는 지능 형 지속적 위협(APT; Advanced Persistent Threat), 서비스 거부 공격(DoS; Denial of Service)/분산 서비스 거부 공격(Distributed Denial of Service) 등이 있다. 그러므로, 사이버 공격을 방어하고 대응하는 수단도 다양한 보안 솔루션으로부터 수집되는 정보와 시스템의 로 그를 분석하여 대응하도록 발전되고 있다. 일례로, 전사적 보안 관리 시스템(ESM; Enterprise Security Management), 보안 정보 이벤트 시스템 (SIEM;Security Information and Event System) 등을 예로 들 수 있다. 더 나아가, 전사적 보안 관리 시스템이나 보안 정보 이벤트 시스템과 비슷하게 다양한 로그를 통합하여 관리하 여, 로그의 검색, 조회 및 시스템의 상태 파악과 다양한 사이버 공격을 탐지하고 대응하기 위한 기술이 개발되 고 있다. 하지만, 사이버 공격의 방어 수단은 현재 사이버 공간의 상황을 정확히 인식하지 못함으로써 사이버 공격의 효 과적인 방어와 대응이 이루어지지 못하는 한계를 가질 수밖에 없다. 특히, 현재의 사이버 공격은 일회성에 그치는 것이 아니라 공격 목표를 달성하기 위해 공격자가 장시간 동안 여 러 공격 방법들을 순차적으로 수행하는 경향을 보이고 있다. 그러므로, 이러한 사이버 공격을 효과적으로 방어 하고 대응하기 위해서는 현재 사이버 공간의 상황을 정확히 인식하고, 사이버 공격에 대한 선제적 대응을 수행 하는 것이 더욱 중요할 수밖에 없다. 따라서, 근래 들어 발생되는 시나리오 기반의 다단계 공격 분석이 수행되는 시나리오기반 사이버 공격을 효과적 으로 방어하고 솔루션을 제공하여 공격에 대한 선제 대응을 수행해야 할 필요성이 강조되는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내특허공개공보 10-2015-0008158호(2015.01.21)"}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 생성형AI를 기반으로 공격자의 위험 시나리오에 대한 솔루션을 판단하여 사용자에게 제공하는 것에 목적이 있다."}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 위협 시나리오를 판단하는 방법은 클라우드 환경에서 획득된 사용자의 API 이벤트 정보 중 미리 정해 진 조건에 따라 복수의 대상 API 이벤트를 결정하는 단계 - 상기 미리 정해진 조건은 이벤트의 빈도, 시간적 분 포, 발생 위치, 연관된 사용자 및 API 이벤트 유형 중 적어도 하나와 관련됨 -, 상기 복수의 대상 API 이벤트 각각을 유형에 따라 분류된 위협 행위에 매핑하는 단계, 상기 복수의 위협 행위 중 적어도 하나의 위협 행위가 포함된 적어도 하나의 위협 행위 세트를 결정하는 단계, 상기 위협 행위 세트에 기반하여 데이터 베이스에 미리 저장된 복수의 참조 시나리오 중 적어도 하나의 후보 시나리오를 결정하는 단계, 상기 후보 시나리오에 대해 상 기 위협 행위 세트와 비교하여 보안 지표 정보를 산출하는 단계, 상기 보안 지표 정보에 기반하여 상기 후보 시나리오 중 예상 위협 시나리오를 결정하는 단계 및 상기 예상 위 협 시나리오에 기반하여 사용자 단말에 솔루션 정보를 제공하는 단계를 포함한다. 본 발명의 일 실시예에 있어서, 상기 위협 행위의 세부 분류 유형은, 전술 그룹의 정보, 기법의 정보, 세부 기 법의 정보를 포함할 수 있다. - 상기 전술 그룹은 적어도 하나의 상기 기법을 포함하는 상위 개념이고, 상기 기 법은 적어도 하나의 상기 세부 기법을 포함하는 상위 개념임 - 본 발명의 일 실시예에 있어서, 상기 보안 지표 정보는 일치도 정보 및 위험도 정보를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 일치도 정보는 상기 후보 시나리오가 포함하는 위협 행위에 대한 유형 관 련성에 기반하여 산출될 수 있다. 본 발명의 일 실시예에 있어서, 상기 위협 행위의 세부 분류 유형은, 전술 그룹의 정보, 기법의 정보, 세부 기 법의 정보를 포함하고 - 상기 전술 그룹은 적어도 하나의 상기 기법을 포함하는 상위 개념이고, 상기 기법은 적 어도 하나의 상기 세부 기법을 포함하는 상위 개념임 -, 상기 유형 관련성은 상기 후보 시나리오가 포함하는 위 협 행위의 상기 세부 분류 유형에 포함되는 전술 그룹 정보, 기법 정보, 세부 기법 정보 각각의 일치 여부에 따 라 차등적으로 유형 관련성에 대응되는 지표가 산출될 수 있다. 본 발명의 일 실시예에 있어서, 상기 보안 지표 정보는 위험도 정보를 포함하고, 상기 데이터베이스에 미리 저 장된 복수의 참조 시나리오는, 각각에 대응된 위험 지표를 포함하고, 상기 위험도 정보는 상기 위험 지표 및 상 기 위협 행위 세트와 상기 후보 시나리오에 포함되는 위협 행위를 비교하여 생성된 진척도 정보에 기반하여 산 출될 수 있다. 본 발명의 일 실시예에 있어서, 상기 데이터 베이스에 미리 저장된 복수의 참조 시나리오는, 위협 행위 분석 매 트릭스에 포함되는 복수의 기법 중 선택된 적어도 일부의 위협 행위로 구성된 시나리오일 수 있다. - 상기 위협 행위 분석 매트릭스는 복수의 전술 그룹 및 상기 전술 그룹에 포함되는 적어도 하나의 기법으로 구성됨 - 본 발명의 일 실시예에 있어서, 상기 후보 시나리오를 결정하는 단계는, 사이버 공격 단계 유형에 더 기반하여 상기 후보 시나리오를 결정하고, 상기 사이버 공격 단계 유형은 사이버 킬체인(Cyber Kill Chain)모델에 기반한 사전 단계, 공격 단계 및 후속 단계를 포함하며, 각각의 순서는 시간적 발생 순서 또는 인과 관계에 따라 결정되고, 상기 위협 행위는 상기 사이버 공격 단계 유형 중 적어도 하나에 대응될 수 있다. 본 발명의 일 실시예에 있어서, 상기 솔루션 정보는 상기 예상 위협 시나리오 중에서 가장 마지막에 발생한 위 협 행위에 대응되는 상기 사이버 공격 단계 유형에 따라 결정될 수 있다. 본 발명의 일 실시예에 있어서, 상기 사이버 공격 단계 유형이 상기 사전 단계에 해당하는 경우, 사용자에게 초 기 침투 시도에 대한 경고 및 방어 방안을 제공하고, 상기 사이버 공격 단계 유형이 상기 공격 단계에 해당하는 경우, 사용자에게 현재 진행 중인 공격에 대한 세부 정보와 그에 대한 대응 방안을 제공하고, 상기 사이버 공격 단계 유형이 상기 후속 단계에 해당하는 경우, 사용자에게 공격 후 발생 가능한 위협, 예방책 및 복구 방안을 제공할 수 있다. 본 발명의 일 실시예에 있어서, 상기 사이버 공격 단계 유형에 따라 상기 미리 정해진 조건 중 적어도 하나를 결정할 수 있다. 본 발명의 일 실시예에 있어서, 상기 위협 행위 세트 결정 단계는, 상기 위협 행위를 상기 위협 행위의 발생 빈 도, 시간적 분포, 발생 위치 및 연관된 사용자 중 적어도 하나에 관련된 분류 조건에 따라 분류하는 단계를 더 포함하고, 상기 위협 행위 세트는 동일한 상기 분류 조건에 따라 결정된 위협 행위로 구성될 수 있다. 본 발명의 일 실시예에 있어서, 상기 사용자 단말로부터 분류 조건에 대응되는 가중치 정보를 획득하는 단계 및 상기 가중치 정보에 기반하여 상기 분류 조건의 범위를 결정하는 임계치 정보를 변경하는 단계를 포함할 수 있 다. 본 발명의 일 실시예에 있어서, 상기 위협 행위 세트는 인공지능 기반의 분류 알고리즘에 기반하여 결정되며, 상기 분류 알고리즘은 기계학습, 딥러닝 또는 강화 학습 중 적어도 하나를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 데이터 베이스는 각각의 상기 참조 시나리오에 포함되는 위협 행위 간의 시간 간격 및 인과 관계에 대한 관계 정보를 저장하고 있고, 상기 위협 행위 세트를 결정하는 단계는, 상기 관 계 정보에 기반하여 결정될 수 있다."}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 생성형AI를 이용하여 위협 시나리오를 판단하는 방법은, 생성형 AI를 기반으로 하여 시나리오 기반의 다단계 공격 분석이 수행되는 시나리오기반 사이버 공격을 효과적으로 방어하고 솔루션을 제공하여 공격에 대한 선제 대응을 수행할 수 있도록 한 장점이 있다."}
{"patent_id": "10-2024-0034063", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 명 세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, 설명되는 각 단계들은 특별한 인과관계에 의해 나열된 순서에 따라 수행되어야 하는 경우를 제외 하고, 나열된 순서와 상관없이 수행될 수 있다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 이하, 첨부된 도면들을 참조하여 본 발명에 대해 설명한다. 도 1은 본 발명의 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 도 1에 도시된 본 발명의 일 실시예에 따른 네트워크 환경은 클라우드 서버, 데이터베이스, 사용자 단 말, AI 엔진, 메인 서버를 포함할 수 있다. 이때 클라우드 서버, 데이터베이스, 사용자 단말, AI 엔진, 메인 서버는 통신, 즉 네트워 크 기반으로 서로 연결될 수 있다. 여기서 네트워크는 통신 방식이 제한되지 않으며, 네트워크가 포함할 수 있 는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망)을 활용하는 통신 방식과 전기 신호(아날로 그 신호, 디지털 신호, 시리얼 신호, Pulse Width Modulation)뿐만 아니라 근거리 무선 통신 역시 포함될 수 있 다. 클라우드 서버는 기업 내에 서버와 저장장치를 두지 않고 외부에 아웃소싱해 쓰는 서비스인 클라우드 서비 스를 위한 서버를 의미하며, 여기서 클라우드 서버는 퍼블릭(개방형) 클라우드를 위한 퍼블릭 데이터 센터 (Amazon AWS. Microsoft Azure) 및 프라이빗(폐쇄형) 클라우드를 위한 사내 데이터 센터를 포함할 수 있다. 이러한 클라우드 서버는 명령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현될 수 있다. 클라우드 서버는 시스템을 구축하는 다른 서버 및 단말들과 네트워크를 통해 통 신하여 정보를 송수신할 수 있다. 이러한 클라우드 서버에는 해당 서버를 이용하는 사용자들의 모든 데이터 및 인프라가 저장될 수 있으며, 이때 특정 사용자, 또는 사용자 그룹은 어느 하나의 클라우드 서버만을 이용할 수도 있으나, 복수의 클라우 드 서버를 이용하는 것도 가능하다. 이때 바람직하게는 복수의 클라우드 서버가 이용될 경우 복수의 클라우드 서버에 분산 저장된 데이터 관리를 위한 통합관제서버가 별도로 구비될 수 있으며, 보다 바람직하게는 후술할 메인 서버가 통합관제서 버의 역할을 수행할 수 있다. 사용자 단말은 클라우드 서버에 저장된 특정 기업이나 단체의 데이터에 접속하여 데이터를 읽고, 쓰는 주체이다. 이때 해당 클라우드 서버에 접속이 허용된 사용자 단말의 경우 일반적으로 기업이나 단체, 그룹의 구성원일 수 있으며, 접속이 허용되지 않은 사용자가 해당 기업, 단체, 그룹의 클라우드 서버에 접 속하는 경우 이를 사이버 위협이나 공격, 즉 해킹으로 칭하게 된다. 이러한 사용자 단말은 명령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현될 수 있다. 클라우드 서버는 시스템을 구축하는 다른 서버 및 단말들과 네트워크를 통해 통 신하여 정보를 송수신할 수 있다. 데이터베이스는 데이터의 저장을 위한 저장매체로서의 역할을 수행하며, 바람직하게 본 발명에서의 데이터 베이스라 함은 사이버 위협, 즉 해킹의 시나리오인 복수의 참조 시나리오를 저장할 수 있다. 이러한 데이터베이스는 명령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현될 수 있다. 또한 데이터베이스는 시스템을 구축하는 다른 서버 및 단말들과 네트워크를 통해 통신하여 정보를 송수신할 수 있다. 나아가 해당 사이버 위협에 대해 방어자(관리자)가 공격을 예방하고 탐지하기 위해 취할 수 있는 행동(방어책) 이나 공개적으로 명칭이 부여된 해킹단체에 대한 정보와 공격 기법을 분석한 데이터를 저장할 수 있다. 여기서 참조 시나리오라 함은 사이버 공격을 수행하기 위해 공격자가 단계적으로 수행하는 작업을 프로세스화한 것으로, 각 단계별로 공격자에 의해 일어나는 행동을 시계열적으로 나열한 것이다. 따라서 기본적으로 데이터베이스에는 과거에 일어난 해킹, 즉 위협 공격에 대한 참조 시나리오가 저장될 수 있는데, 바람직하게 여기서 참조 시나리오는 실제 사이버상의 공격자가 사용한 공격 패턴을 토대로 MITRE ATT&CK (Adversarial Tactics, Techniques, and Common Knowledge)에 저장된 위협 행위 분석 매트릭스에 포함 되는 다양한 전술, 기법 그리고 절차(TTPs)들이 연속으로 구성된 것 일 수 있다. 여기서, MITRE ATT&CK은 MITRE Corporation에서 제작한 사이버 보안 관련 지식베이스로, 사이버 공격자의 목표 및 각 단계에 대한 카테고리를 포함하는 전술 그룹(Tactic)과 각 전술 그룹(Tactic)에 대한 구체적인 방법인 기 법(Technique)으로 구성될 수 있다. 따라서 위협 행위는 적어도 하나의 전술 그룹(Tactic)에 포함되고, 전술 그룹(Tactic)에 포함된 적어도 하나의 기법(Technique)에 대응된다. 또한 이러한 데이터베이스에 미리 저장된 참조 시나리오는 실제 사이버 공격 사례를 관찰한 후 공격자가 사 용한 악의적 행위(Adversary behaviors)에 대해서 전술 그룹(Tactic)과 기술(Technique)의 관점으로 분석하여 다양한 공격그룹의 공격기법들에 대한 정보를 분류하여 리스트화한 데이터이다. 구체적으로, 위협 시나리오는 공격자가 공격 목표인 적어도 하나의 전술 그룹(Tactic)을 달성하기 위한 방법으 로 각 단계인 적어도 하나의 기법(Techniques)을 포함한다. 예를 들어, 기법(Techniques)에 대응되는 위협 행위 유형은 이메일 스피어피싱(Spearphishing via Email), 드 라이브 바이 공격(Drive-by Compromise), 인증 정보 덤핑(Credential Dumping), 중간자 공격(Man-in-the- Middle, MitM) 및 대체 프로토콜을 통한 명령 및 제어(Command and Control over alternative protocol) 등이 있을 수 있다. AI 엔진은 종래의 인공지능(AI) 엔진을 의미하는 것으로, 종래에 제공되는 다양한 AI 엔진을 의미할 수 있으나 바람직하게 본 발명에서 AI 엔진이라 함은 생성형 AI를 의미하는 것이며, 후술할 인공지능은 AI 엔진 과 같은 의미로 이해하기로 한다. AI 엔진은 명령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구 현될 수 있다. 또한 AI 엔진은 시스템을 구축하는 다른 서버 및 단말들과 네트워크를 통해 통신하여 정보를송수신할 수 있다. 메인 서버는 상술한 바와 같이 복수의 클라우드 서버에 대한 통합 관제 기능을 수행함과 동시에 사이버 위협에 대한 탐지 및 분석을 수행하여 허가된 사용자 단말, 즉 방어자(관리자)의 사용자 단말에 다양한 프롬프트를 제공하는 기능을 수행한다. 이러한 메인 서버는 명령, 코드, 파일, 콘텐츠, 서비스 등을 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장 치들로 구현될 수 있다. 이와 같은 메인 서버는 시스템을 구축하는 다른 서버 및 단말들과 네트워크를 통해 통신하여 정보를 송수신할 수 있다. 도 2는 본 발명의 일 실시예에 따른 위협 시나리오를 판단하는 방법을 설명하기 위한 순서도이다. 단계(S110)에서, 메인 서버는 클라우드 환경에서 획득된 사용자의 API 이벤트 정보 중 미리 정해진 조건에 따라 복수의 대상 API 이벤트를 결정한다. 여기서, API 이벤트 정보는 사용자의 API 호출이나 그에 대한 응답 등과 같은 API 상호작용일 수 있다. 예를 들 어, API 이벤트 정보에는 API 호출에 사용된 엔드포인트(URL), HTTP 메소드, 요청 및 응답 페이로드, 이벤트 발 생시간 등이 포함될 수 있다. 메인 서버는 클라우드 서버에서 획득한 API 이벤트 정보 중 미리 정해진 조건에 따라 복수의 대상 API 이벤트를 결정한다. 여기서, 미리 정해진 조건은 이벤트의 빈도, 시간적 분포, 발생한 위치, 연관된 사용자 및 API 이벤트 유형 중 적어도 하나와 관련될 수 있다. 예를 들어, 이벤트의 빈도에 따라 결정될 경우에는 API 이벤트의 빈도를 계산하여 일정 기간 동안 발생하는 이 벤트 양을 추정하고, 빈도가 특정 임계값 이상으로 높아지는 기간이 조건이 될 수 있다. 예를 들어, 시간적 분포에 따라 결정될 경우에는 API 이벤트의 발생 시간을 추적하여 패턴을 확인하고 집중적으 로 발생하는 특정 시간대가 조건이 될 수 있다. 예를 들어, 발생 위치 및 연관된 사용자에 따라 결정될 경우에는 특정 지역에서 발생한 문제의 API 이벤트와 연 관된 사용자 계정에서 발생한 이벤트가 조건이 될 수 있다. 예를 들어, API 이벤트 유형에 따라 결정될 경우에는 로그인 요청, 데이터 수정, 데이터 삭제 등의 이벤트의 유 형을 파악하여 특정 이벤트 유형을 조건으로 할 수 있다. 단계(S120)에서, 메인 서버는 복수의 대상 API 이벤트 각각을 유형에 따라 분류된 위협 행위에 매핑한다. 여기서, 매핑은 한 집합의 요소를 다른 집합의 요소와 연관 짓는 과정이나 그 결과를 의미한다. 구체적으로, 대 상 API 이벤트를 위협 행위와 연결되는지를 결정하는 과정일 수 있다. 데이터베이스에는 API 이벤트 정보 각각을 유형에 따라 MITRE ATT&CK의 TTPs로 분류해 저장하고 있으며, 메 인 서버는 대상 API 이벤트가 어떤 위협 행위에 해당하는지 데이터베이스에 저장된 분류 체계에 따라 매핑 할 수 있다. 예를 들어, '로그인 실패'를 포함하는 API 이벤트 정보는 '비밀번호 크래킹' 또는 '브루트 포스 공격'등의 공격 유형과 매핑될 수 있다. 예를 들어, '데이터 삭제'를 포함하는 API 이벤트는 정보는 '데이터 파괴' 또는 '삽입/변조' 등의 공격 유형에 매핑될 수 있다. 단계(S130)에서, 메인 서버는 복수의 위협 행위 중 적어도 하나의 위협 행위가 포함된 적어도 하나의 위협 행위 세트를 결정한다. 복수의 위협 행위는 특정 위협 행위 패턴이나 시나리오에 따라 위협 행위 세트로 결정될 수 있다. 또한, 위협 행위 세트는 상황에 따라 다르게 구성될 수 있다. 구체적으로, 특정 기간 동안 랜섬웨어 공격이나 DDOS 공격이 자주 발생하는 경우에는 랜섬웨어 공격 및 DDOS 공격 패턴에 따라 위협 행위 세트를 구성할 수 있다. 또는, 클 라우드 서버가 시스템 업데이트를 진행할 경우에는 업데이트시 자주 발생하는 사이버 공격에 따라 위협 행 위 세트를 구성할 수 있다.메인 서버는 AI엔진을 통해 위협 행위 세트를 결정할 수 있다. 구체적으로, 기계학습, 딥러닝 또는 강 화 학습 중 적어도 하나를 포함하는 인공지능 기반의 분류 알고리즘에 기반하여 위협 행위 세트를 결정할 수 있 다. 단계(S140)에서, 메인 서버는 위협 행위 세트에 기반하여 데이터 베이스에 미리 저장된 복수의 참조 시 나리오 중 적어도 하나의 후보 시나리오를 결정한다. 여기서, 참조 시나리오는 실제 사이버상의 공격자가 사용한 공격 패턴을 토대로 MITRE ATT&CK에 저장된 위협 행 위 분석 매트릭스에 포함되는 다양한 전술, 기법 그리고 절차(TTPs)들이 연속으로 구성된 것이다. 예를 들어, 실제 보안 사고 사례, 보안 연구에서 도출된 패턴 또는 보안 전문가의 경험을 바탕으로 만들어질 수 있다. 메인 서버는 참조 시나리오 중에서 위협 행위 세트를 바탕으로 이를 포함하는 참조 시나리오를 후보 시나리 오로 결정할 수 있다. 구체적으로, 참조 시나리오와 위협 행위 세트 각각이 포함하는 위협 행위의 유형, 순서, 패턴 등이 고려될 수 있다. 또한, 단계(S140)에서, 메인 서버는 사이버 공격 단계 유형에 더 기반하여 후보 시나리오를 결정할 수 있다. 여기서, 사이버 공격 단계 유형은 사이버 공격에 있어서 공격자가 목표에 도달하기 위해 따르는 일련의 과정으 로 사이버 공격 단계의 개념적 모델인 사이버 킬 체인(Cyber kill chain)모델에 기반하여 사전 단계, 공격 단계 및 후속 단계를 포함할 수 있다. 각각의 순서는 시간적 발생 순서 또는 인과 관계에 따라 결정되며, 위협 행위 는 사이버 공격 단계 유형 중 적어도 하나에 대응될 수 있다. 구체적으로, 사전 단계는 사이버 공격이 아직 시작되지 않았거나, 공격을 준비하는 초기 단계로 정보를 수집하 고, 목표를 분석하며, 공격 도구를 개발하는 위협 행위가 사전 단계에 포함될 수 있다. 공격 단계는 이미 사이 버 공격이 실행 중이거나, 이미 시스템에 침투한 상태로 공격 도구를 대상에 전달하거나, 시스템의 취약점을 악 용하여 공격 도구를 실행하거나, 악성코드를 설치하는 위협 행위가 공격 단계에 포함될 수 있다. 후속 단계는 공격자가 이미 시스템에 침투하여 목표를 달성하기 위한 행동을 진행하는 단계로 공격자가 악성 코드를 제어하 고 추가적인 명령을 실행하거나, 정보를 탈취한 흔적을 삭제하는 위협 행위가 후속 단계에 포함될 수 있다. 단계(S150)에서, 메인 서버는 후보 시나리오에 대해 위협 행위 세트와 비교하여 보안 지표 정보를 산출한다. 여기서, 보안 지표 정보란 복수의 보안 지표를 포함하는 것으로, 일치도 정보 및 위험도 정보를 포함할 수 있다. 또한, 보안 지표 정보는 수치화된 값으로 표현될 수 있으나, 이때 수치 범위에 대해서는 별도의 한정을 두지 않는다. 여기서, 일치도 정보는 데이터베이스에 미리 저장된 복수의 참조 시나리오 및 위협 행위 세트 사이의 일치 도를 의미하는 것으로, 일 예시로 일치도 정보는 후보 시나리오가 포함하는 위협 행위에 대한 유형 관련성에 기 반하여 산출되고, 유형 관련성은 후보 시나리오가 포함하는 위협 행위의 세부 분류 유형에 포함되는 전술 그룹 정보, 기법 정보, 세부 기법 정보 각각의 일치 여부에 따라 차등적으로 유형 관련성에 대응되는 지표가 산출될 수 있다. 예를 들어, \"A 후보 시나리오\"에서 발견된 \"B 위협 행위\"가 \"Phishing\"이라는 기법을 사용하고 있는 경우 이 기 법은 \"Initial Access\"라는 전술 그룹에 속하고, \"Spearphishing Link\", \"Spearphishing Attachment\" 등의 세 부 기법을 포함할 수 있다. \"A 후보 시나리오\"에서 발견된 위협 행위가 \"Spearphishing Link\" 또는 \"Spearphishing Attachment\"을 세부 기법으로 사용하고 있다면 실제 \"Phishing\" 기법과 \"B 위협 행위\"의 유형 관련성은 높게 산출될 수 있다. 여기서, 위험도 정보는 데이터베이스에 미리 저장된 참조 시나리오 및 위협 행위 세트 각각에 포함된 위협 행위, 즉 기법(Techniques)의 위험도를 기반으로 산출되는 것일 수 있다. 복수의 참조 시나리오는 각각에 대응된 위험 지표를 포함하고, 위험도 정보는 위험 지표 및 위협 행위 세트와 후보 시나리오에 포함되는 위협 행위를 비교하여 생성된 진척도 정보에 기반하여 산출될 수 있다. 예를 들어, 위협 행위 세트가 후보 시나리오 중 \"랜섬웨어 공격\"에 해당할 경우에 현재 탐지된 위협 행위가 \"랜 섬웨어 공격\" 비교했을 때, 진척도 정보가 초기 단계라면 위험도 정보는 상대적으로 낮게 산출될 수 있다. 단계(S160)에서, 메인 서버는 보안 지표 정보에 기반하여 후보 시나리오 중 예상 위협 시나리오를 결정한다. 메인 서버는 보안 지표 정보를 고려하여 후보 시나리오들 중에서 가장 가능성이 높은, 실제로 발생하고 있 는 또는 발생할 가능성이 가장 높은 후보 시나리오를 예상 위협 시나리오로 결정한다. 예를 들어, 후보 시나리오 A와 B가 있고, 두 시나리오 모두 위협 행위 세트와 비교했을 때 높은 일치도 정보를 가지고 있을 때, 메인 서버는 두 시나리오의 위험도 정보를 비교하여 둘 중 위험도 정보가 높은 후보 시나 리오 A를 예상 위협 시나리오로 결정할 수 있다. 단계(S170)에서, 메인 서버는 예상 위협 시나리오에 기반하여 사용자 단말에 솔루션 정보를 제공한다. 여기서, 솔루션 정보는 결정된 예상 위협 시나리오에 대한 대응책일 수 있다. 구체적으로, 예상 위협 시나리오 의 심각성, 유형, 공격 벡터 등을 포함할 수 있다. 또한, 사용자 상황을 고려하여 개별적으로 맞춤화될 수 있다. 예를 들어, 예상 위협 시나리오가 \"사회 공학 공격\"에 해당한다면, 솔루션 정보는 사용자 교육 및 인식 캠페인, 이메일 보안 향상 등의 대응 방안을 포함할 수 있다. 예를 들어, 예상 위협 시나리오가 \"DDoS\"에 해당한다면 솔루션 정보는 트래픽 모니터링 및 제한, DDoS 방어 솔 루션 도입, 백업 및 복구 전략 강화 등의 대응 방안을 포함할 수 있다. 또한, 솔루션 정보는 예상 위협 시나리오 중에서 가장 마지막에 발생한 위협 행위에 대응되는 사이버 공격 단계 유형에 따라 결정될 수 있다. 구체적으로, 사이버 공격 단계 유형이 사전 단계에 해당하는 경우, 사용자에게 초기 침투 시도에 대한 경고 및 방어 방안을 제공할 수 있다. 사이버 공격 단계 유형이 공격 단계에 해당하는 경우, 사용자에게 현재 진행 중인 공격에 대한 세부 정보와 그에 대한 대응 방안을 제공할 수 있다. 사이버 공격 단계 유형이 후속 단계에 해당하 는 경우, 사용자에게 공격 후 발생 가능한 위협, 예방책 및 복구 방안을 제공할 수 있다. 도 3 및 4는 본 발명의 일 실시예에 따른 유형에 따라 분류된 위협 행위를 설명하기 위한 표이다. 도 3을 참조하면, 14개의 전술 그룹(Tactic)에 대해 각각의 ID, 이름 및 설명이 도시되어 있다. 각각의 전술 그 룹은 적어도 하나의 기법(Technique)을 포함할 수 있다. 도 4를 참조하면, 도 3의 전술 그룹 중 \"TA0001 Initial Access\"에 해당하는 기법과 세부 기법이 도시되어 있다. 기법 \"T1566 Phishing\"에는 세부 기법으로 \"T1566.001\", \"T1566.002\" 및 \"T1566.003\"이 포함될 수 있다. 또한, 기법 \"T1200 Hardware Additions\"와 같이 세부 기법이 포함되지 않은 기법이 있을 수 있다. 도 5는 본 발명의 일 실시예에 따른 위협 행위 분석 매트릭스의 예를 도시한 도면이다. 도 5를 참조하여 설명하는데 있어서, 도 3 및 도4를 참조하여 설명하도록 한다. 도 5를 참조하면, 4개의 전술 그룹, TA001의 기법 및 절차이 도시되어 있다. 도 5를 참조하면, 4개의 전술 그룹 밑으로 각각에 해당하는 기법이 도시 되어 있으며 도 3의 전술 그룹 중 \"TA0001 Initial Access\"에 해당하는 기법이 TA001의 기법 나열되어 있다. TA001의 기법 중 도 4의 기법 \"T1566 Phishing\"에 해당하는 \"Phishing\"을 선택하면 대응되는 절차을 확인할 수 있다. 도 6은 본 발명의 일 실시예에 따른 미리 저장된 복수의 참조 시나리오를 설명하기 위한 표이다. 도 6을 참조하여 설명하는데 있어서, 도 2 및 도 5를 참조하여 설명하도록 한다. 도 6을 참조하면, 도 5의 \"Phishing\"에 해당하는 사이버 공격 시나리오인 \"Axiom\", \"GOLD SOUTHFIELD\", \"Hikit\" 및 \"Royal\"이 도시되어 있으며, 그 중 \"GOLD SOUTHFIELD\"에 해당하는 기법 및 세부 기법이 도시되어 있다. 도 6을 참조하면, 도시된 사이버 공격 시나리오 \"Axiom\", \"GOLD SOUTHFIELD\", \"Hikit\" 및 \"Royal\"은 단계 (S140)의 미리 저장된 복수의 참조 시나리오 중 일부일 수 있다. 예를 들어, 단계(S130)에서 결정된 위협 행위 세트 중 \"A1 위협 행위 세트\"가 기법 및 세부 기법으로 \"T1190\", \"T1133\" 및 \"T1195.002\"를 포함할 경우, \"A1 위협 행위 세트\"에 기반하여 단계(S140)에서 후보 시나리오로 \"GOLD SOUTHFIELD\"를 결정할 수 있다. 후보 시나리오인 \"GOLD SOUTHFIELD\" 단계(S160)에서 예상 위협 시나리오 로 결정되었을 경우, 단계(S170)에서 제공되는 솔루션 정보는 예상 위협 시나리오인 \"GOLD SOUTHFIELD\"의 기법 중 \"A1 위협 행위 세트\"에 포함되는 기법들에 대해서는 현재 진행 중인 공격을 차단하고, 시스템을 격리하는 방 법이 제안될 수 있다. \"A1 위협 행위 세트\"에 포함되지 않는 기법들에 대해서는 공격 가능성을 알리거나, 시스 템의 보안을 강화하는 방향으로 제안될 수 있다. 도 7 및 도 8은 본 발명의 일 실시예에 따른 위협 시나리오를 판단하는 방법을 설명하기 위한 도면이다. 도 7 및 도 8은 메인 서버가 도 2의 단계를 수행함에 따라 진행되는 과정을 예시적으로 도시한 것이다. 따 라서 도 7 및 8을 참조하여 설명하는데 있어서, 도 2를 참조하여 설명하도록 한다. 도 7을 참조하면, 단계(S110)에서 메인 서버는 클라우드 환경에서 API 이벤트 정보를 획득하고, 획득된 API 이벤트 정보를 미리 정해진 조건에 따라 복수의 대상 API 이벤트를 획득한다. 단계 (S120)에서 메인 서버는 복수의 대상 API 이벤트 각각을 유형에 따라 분류된 위협 행위에 매핑한 다. 도 8을 참조하면, 단계(S130)에서 매핑된 복수의 대상 API 이벤트중 적어도 하나의 위협 행위가 포함된 위 협 행위 세트을 결정한다. 단계(S140)에서 위협 행위 세트에 기반하여 데이터베이스에 미리 저장 된 복수의 참조 시나리오 중 적어도 하나의 후보 시나리오를 결정한다. 데이터베이스는 각각의 참조 시나리오에 포함되는 위협 행위 간의 시간 간격 및 인과 관계에 대한 관계 정 보를 저장하고 있고, 위협 행위 세트를 결정하는 단계(S130)는, 관계 정보에 기반하여 결정될 수 있다. 예를 들어, 사이버 공격자가 피싱 공격을 통해 초기 액세스를 얻은 후에, 시스템 내에서 추가적인 권한 획득을 위해 일련의 작업을 수행하는 공격 시나리오가 존재할 때, \"Phishing\"기법을 사용한 초기 액세스 이벤트와 추가 적인 권한 획득 이벤트 사이의 시간 간격 및 인과 관계를 분석하여 복수의 위협 행위 중 유사한 시간 간격 및 인과 관계를 고려하여 위협 행위 세트를 결정할 수 있다. 도 9는 본 발명이 다른 일 실시예에 따른 위협 시나리오를 판단하는 방법을 설명하기 위한 순서도이다. 단계(S210)에서, 메인 서버는 위협 행위를 위협 행위의 발생 빈도, 시간적 분포, 발생 위치 및 연관된 사용 자 중 적어도 하나에 관련된 분류 조건에 따라 분류한다. 예를 들어, 위협 행위가 특정 사용자에게서 주로 발생하거나, 특정 시간에 집중되는 경우, 분류 조건에 따라 각 각 특정 사용자에게서 발생한 위협 행위, 특정 시간에 발생한 위협 행위로 분류될 수 있다. 또한, 같은 분류로 묶인 위협 행위 중에서 위협 행위 세트를 결정할 수 있다. 단계(S220)에서, 메인 서버는 사용자 단말로부터 분류 조건에 대응되는 가중치 정보를 획득한다. 예를 들어, 사용자 단말에서 '발생 위치'에 더 가중치를 부여하면 해당 위치에서 발생한 위협 행위가 위협 행위 세트에 반드시 포함될 수 있다. 단계(S230)에서, 메인 서버는 가중치 정보에 기반하여 분류 조건의 범위를 결정하는 임계치 정보를 변경한 다. 예를 들어, '발생 빈도'의 임계치를 변경하면, 특정 빈도 이상의 위협 행위만 위협 행위 세트로 분류될 수 있다. 본 발명의 각 실시예에 개시된 기술적 특징들은 해당 실시예에만 한정되는 것은 아니고, 서로 양립 불가능하지 않은 이상, 각 실시예에 개시된 기술적 특징들은 서로 다른 실시예에 병합되어 적용될 수 있다. 따라서, 각 실시예에서는 각각의 기술적 특징을 위주로 설명하지만, 각 기술적 특징이 서로 양립 불가능하지 않 은 이상, 서로 병합되어 적용될 수 있다. 본 발명은 상술한 실시예 및 첨부한 도면에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자의 관점에서 다양한 수정 및 변형이 가능할 것이다. 따라서 본 발명의 범위는 본 명세서의 청구범위 뿐 만 아니라 이 청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2024-0034063", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 위협 시나리오를 판단하는 방법을 설명하기 위한 순서도이다. 도 3 및 4는 본 발명의 일 실시예에 따른 유형에 따라 분류된 위협 행위를 설명하기 위한 표이다. 도 5는 본 발명의 일 실시예에 따른 위협 행위 분석 매트릭스의 예를 도시한 도면이다. 도 6은 본 발명의 일 실시예에 따른 미리 저장된 복수의 참조 시나리오를 설명하기 위한 표이다. 도 7 및 도 8은 본 발명의 일 실시예에 따른 위협 시나리오를 판단하는 방법을 설명하기 위한 도면이다. 도 9는 본 발명이 다른 일 실시예에 따른 위협 시나리오를 판단하는 방법을 설명하기 위한 순서도이다."}
