{"patent_id": "10-2021-0048322", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0060454", "출원번호": "10-2021-0048322", "발명의 명칭": "태스크 네트워크를 선택하기 위한 방법, 센싱 데이터를 기반으로 액션들을 결정하기 위한 시", "출원인": "위스트론 코포레이션", "발명자": "첸 치-밍"}}
{"patent_id": "10-2021-0048322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법으로서, 상기 방법은,제1 집단에 속해 있는 복수의 제1 개체들 및 제2 집단에 속해 있는 복수의 제2 개체들을 획득하는 단계 - 상기제1 개체들 및 상기 제2 개체들은 공진화 프로세스를 통해 진화됨 -;복수의 패턴-생성 네트워크들에 의해 생성된 복수의 태스크 네트워크들을 획득하는 단계;다중-타깃 함수를 기반으로 상기 제1 개체들 및 상기 제2 개체들로 상기 태스크 네트워크들의 각각의 태스크 네트워크를 트레이닝시키고 트레이닝 후에 상기 태스크 네트워크들의 각각의 태스크 네트워크의 정확도를 평가하는 단계 - 상기 다중-타깃 함수는 상기 태스크 네트워크들의 각각의 태스크 네트워크의 복수의 특성들을 포함함-;상기 태스크 네트워크들의 각각의 태스크 네트워크의 정확도를 기반으로 해당 패턴-생성 네트워크의 적응도 점수(fitness score)를 결정하는 단계 - 상기 패턴-생성 네트워크들의 각각의 패턴-생성 네트워크의 적응도 점수는 상기 패턴-생성 네트워크에 상응하는 태스크 네트워크의 정확도에 긍정적인 상관관계가 있음 -; 및상기 패턴-생성 네트워크들의 각각의 패턴-생성 네트워크의 적응도 점수를 기반으로 상기 패턴-생성 네트워크들로부터 특정 패턴-생성 네트워크를 찾아내고 상기 태스크 네트워크들 중에서 상기 특정 패턴-생성 네트워크에상응하는 특정 태스크 네트워크를 선택하는 단계;를 포함하는, 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법."}
{"patent_id": "10-2021-0048322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 집단에 속해 있는 제1 개체들을 획득하는 단계는,상기 제1 집단에 속해 있는 복수의 제1 참조 개체들을 획득하는 단계 - 상기 제1 참조 개체들의 각각의 제1 참조 개체는 복수의 제1 유전인자들을 지님 -;상기 제1 참조 개체들의 각각의 제1 참조 개체의 제1 유전인자들을 기반으로 상기 제1 참조 개체들의 각각의 제1 참조 개체의 제1 적응도를 결정하는 단계;상기 제1 참조 개체들을 제1 진화 그래프에 할당하고 상기 제1 진화 그래프에서 복수의 제1 자손 개체들을 번식하는 단계 - 상기 제1 자손 개체들 및 상기 제2 집단에 속해 있는 복수의 제2 자손 개체들 각각은 공진화 프로세스를 통해 번식됨 -; 및상기 제1 자손 개체들을 상기 제1 개체들로서 정의하는 단계;를 포함하며,상기 제2 집단에 속해 있는 제2 개체들을 획득하는 단계는,상기 제2 집단에 속해 있는 복수의 제2 참조 개체들을 획득하는 단계 - 상기 제2 참조 개체들의 각각의 제2 참조 개체는 복수의 제2 유전인자들을 지님 -;상기 제2 참조 개체들의 각각의 제2 참조 개체의 제2 유전인자들을 기반으로 상기 제2 참조 개체들의 각각의 제2 참조 개체의 제2 적응도를 결정하는 단계;상기 제2 참조 개체들을 제2 진화 그래프에 할당하고 상기 제2 진화 그래프에서 제2 자손 개체들을 번식하는 단계 - 상기 제2 자손 개체들 및 상기 제1 자손 개체들은 상기 공진화 프로세스를 통해 번식됨 -; 및상기 제2 자손 개체들을 상기 제2 개체들로서 정의하는 단계;공개특허 10-2022-0060454-3-를 포함하고,상기 제1 집단에 속해 있는 제1 참조 개체들을 획득하고 상기 제2 집단에 속해 있는 제2 참조 개체들을 획득하는 단계는,상기 제1 집단에 속해 있는 복수의 제1 초기 개체들을 무작위로 생성하고 상기 제2 집단에 속해 있는 복수의 제2 초기 개체들을 무작위로 생성하는 단계; 및신규성 검색 알고리즘을 기반으로 상기 제1 초기 개체들 중에서 상기 제1 참조 개체들을 찾아 내고 상기 신규성검색 알고리즘을 기반으로 상기 제2 초기 개체들 중에서 상기 제2 참조 개체들을 찾아내는 단계 - 상기 제1 참조 개체들의 각각의 제1 참조 개체의 제1 유전인자들은 제1 최소 기준을 만족시키고 상기 제2 참조 개체들의 각각의 제2 참조 개체의 제2 유전인자들은 제2 최소 기준을 만족시킴 -;를 포함하며,상기 제1 진화 그래프는 복수의 제1 노드들을 포함하고, 상기 제1 노드들은 상기 제1 집단에 속해 있는 복수의개체들에 상응하며, 상기 제1 노드들의 각각의 제1 노드는 적어도 하나의 에지를 통해 인접 노드에 접속되고,상기 적어도 하나의 에지 각각에는 에지 가중치가 할당되며, 상기 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법은,(a) 상기 제1 집단에 속해 있는 개체들 중에서 제1 후보 개체를 선택하고 상기 제1 노드들 중에서 제1 후보 개체에 상응하는 제1 특정 노드를 찾아내는 단계;(b) 상기 제1 후보 개체를 번식하여 적어도 하나의 제2 후보 개체를 생성하고 상기 제1 특정 노드의 적어도 하나의 에지 각각의 에지 가중치를 기반으로 상기 제1 특정 노드에 인접한 적어도 하나의 인접 노드를 상기 적어도 하나의 제2 후보 개체에 상응하는 적어도 하나의 제2 특정 노드로 대체하는 단계; 및(c) 누적 진화 시간이 시간 임계값에 도달한 것으로 결정함에 응답하여 현재 제1 집단에 포함된 개체들을 상기제1 자손 개체들로서 구성하고 상기 누적 진화 시간이 상기 시간 임계값에 도달하지 않은 것으로 결정함에 응답하여 (a)로 되돌아가는 단계;를 포함하고,상기 제1 후보 개체가 선택되는 확률은 상기 제1 후보 개체의 적응도에 긍정적인 상관관계가 있으며,상기 제1 집단에 속해 있는 개체들은 제1 집단 대기열에 기록되고, 상기 제1 집단 대기열은 미리 설정된 용량을지니며,상기 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법은,상기 제1 집단에 속해 있는 개체들 및 상기 적어도 하나의 제2 후보 개체의 총 개수가 미리 설정된 용량보다 큰것으로 결정함에 응답하여, 상기 총 개수와 미리 설정된 용량 간의 차이를 획득하는 단계; 및상기 제1 집단 대기열에서 가장 오래된 개체들 중 일부를 제거하고 상기 적어도 하나의 제2 후보 개체를 상기제1 집단 대기열에 추가하는 단계 - 상기 개체들 중 일부의 개수는 상기 차이에 상응함 -;를 더 포함하는, 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법."}
{"patent_id": "10-2021-0048322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 패턴-생성 네트워크들의 각각의 패턴-생성 네트워크는 구성 패턴-생성 네트워크이고, 상기 패턴-생성 네트워크를 획득하는 단계는 상기 패턴-생성 네트워크들을 생성하기 위해 NEAT(NeuroEvolution of AugmentingTopologies) 네트워크를 사용하는 단계를 포함하며, 상기 특정 패턴-생성 네트워크는 상기 패턴-생성 네트워크들 중에서 가장 높은 적응도 점수를 지니는, 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법."}
{"patent_id": "10-2021-0048322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "센싱 데이터를 기반으로 액션들을 결정하기 위한 방법으로서,공개특허 10-2022-0060454-4-상기 방법은,센싱 데이터를 획득하고 상기 센싱 데이터를 입력 특징 벡터로 매핑하는 단계 - 상기 센싱 데이터는 제1 특정개체에 속해 있는 복수의 센싱 속성들을 포함하고 상기 제1 특정 개체는 제1 집단에 속해 있음 -;상기 입력 특징 벡터를 특정 태스크 네트워크에 공급하여 상기 특정 태스크 네트워크가 출력 특징 벡터를 생성하게 하는 단계 - 상기 특정 태스크 네트워크는 상기 제1 집단 및 제2 집단을 기반으로 트레이닝됨 - 및상기 출력 특징 벡터에 따라 출력 액션을 결정하고 상기 출력 액션을 기반으로 제2 특정 개체를 설정하는 단계- 상기 제2 특정 개체는 상기 제2 집단에 속해 있음 -;를 포함하는, 센싱 데이터를 기반으로 액션들을 결정하기 위한 방법."}
{"patent_id": "10-2021-0048322", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 출력 특징 벡터에 따라 상기 출력 액션을 결정하는 단계는,상기 출력 특징 벡터를 분류기 내에 공급하여 상기 분류기가 복수의 미리 설정된 액션들 중에서 상기 출력 특징벡터에 상응하는 특정 액션을 찾아내게 하는 단계; 및상기 특정 액션을 상기 출력 액션으로서 정의하는 단계;를 포함하며,상기 특정 태스크 네트워크는 상기 제1 집단에 속해 있는 복수의 제1 개체들 및 상기 제2 집단에 속해 있는 복수의 제2 개체들을 기반으로 트레이닝되고 상기 제1 개체들 및 상기 제2 개체들은 공진화 프로세스를 통해 진화되는, 센싱 데이터를 기반으로 액션들을 결정하기 위한 방법."}
{"patent_id": "10-2021-0048322", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 실시 예들은 태스크 네트워크를 선택하기 위한 방법, 센싱 데이터를 기반으로 액션들을 결정하기 위한 시스템 및 방법을 제공한다. 본 개시의 실시 예들의 방법은, 상기 센싱 데이터를 입력 특징 벡터로 매핑하는 단 계; 상기 입력 특징 벡터를 특정 태스크 네트워크에 공급하여 상기 특정 태스크 네트워크를 통해 출력 특징 벡터 를 생성하는 단계 - 상기 특정 태스크 네트워크는 복수의 제1 개체들 및 복수의 제2 개체들을 기반으로 트레이닝 되며 상기 제1 개체들은 제1 집단에 속해 있고 상기 제2 개체들은 제2 집단에 속해 있으며 상기 제1 개체들 및 상기 제2 개체들은 공진화 프로세스를 통해 진화됨 -; 및 상기 출력 특징 벡터에 따라 출력 액션을 결정하고 상 기 출력 액션을 기반으로 제2 특정 개체를 설정하는 단계 - 상기 제2 특정 개체는 상기 제2 집단에 속해 있음 -; 를 포함한다."}
{"patent_id": "10-2021-0048322", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 상호 참조 본원은 2020년 11월 4일자 출원된 대만 특허출원 제109138475호를 기반으로 우선권을 주장한 것이다. 상기 특허 출원의 전체는 이로써 인용에 의해 본원에 보완되며 본 명세서의 일부가 된다. 기술 분야 본 개시는 신경 네트워크 기술에 관한 것이며 구체적으로는 공진화 메커니즘(coevolution mechanism)을 기반으 로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법, 센싱 데이터를 기반으로 액션(action)들을 결정하기 위 한 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0048322", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지구상에서의 진화는 오픈 프로세스(open process)이며 공진화(coevolution)는 종종 서로 다른 종(species)에 속해 있는 개체들 간에 이루어진다. 2가지 종의 \"기린들(giraffes)\"과 \"나무들(trees)\"을 예로 들어본다. 기린 들에게 먹히지 않고 많은 햇빛을 받기 위해 높은 꼭대기에 있는 나무들의 자손들은 진화 프로세스에서 유지되는 경향이 있다. 그 반면에, 높은 꼭대기에 있는 잎들을 먹기 위해 목이 긴 기린들의 자손들 또한 진화 프로세스에 서 유지되는 경향이 있다. 현재 5세대 통신 시스템(이하 \"5G\"라고 언급됨)에서는, 비록 위에 기재한 바와 같은 \"기린들\"과 \"나무들\"의 개 념들과 유사한 역할들이 존재하지만, 이러한 역할들 간에는 공진화 개념이 존재하지 않는다. 그러므로 공진화 프로세스는 현재 상기 역할들의 이행을 개선하는데 사용되지 않을 수 있다. 예를 들어,(O-RAN(open radio access network)에서의 근-실시간(near-RT) RAN의 지능형 컨트롤러와 같은) 5G의 \"폐쇄 루프 제어(closed-loop control)\" 및 (O-RAN에서의 비-실시간(non-RT) RAN의 지능형 컨트롤러와 같은) \"개방 루프 제어(open-loop control)\"는 서로 어느 정도의 상관관계를 지니고 있지만, 위 2가지의 관련 매개변 수(들)/구성값(들)은 공진화 특성들을 지니고 있지 않다. 그러므로 \"폐쇄 루프 제어\" 및 \"개방 루프 제어\"는(운영 비용(operational expenditure; OPEX)의 절감 및 운영 네트워크 기능(operational network function; OPNF)의 개선에의 도달과 같이) 공진화 프로세스를 통해 개선되지 않을 수 있다. 또한, 5G에서 \"사용자 행동(user behavior)\"과 \"네트워크 토폴로지(network topology)\" 간에는 유사한 조건이 존재한다. 예를 들어, 일반적인 사용자 행동에는 트래픽, 대역폭, 대기시간, 전력 소비, 커버리지(coverage) 및 접속과 같은 매개변수(들)/구성값(들)이 포함될 수 있으며, 사용자들은 일반적으로 매개변수(들)/구성값(들)이 큰 트래픽, 높은 대역폭, 적은 대기시간, 낮은 전력 소비, 넓은 커버리지 및 안정적인 접속으로 진전될 수 있기 를 기대한다. 또한, 네트워크 토폴로지에는 노드들의 개수, 전력 소비, 링크들의 개수, 열 생성 등과 같은 매개 변수(들)/구성값(들)이 포함될 수 있다. 운영자들은 일반적으로 노드들의 개수가 적고, 전력 소비가 낮으며, 링 크들의 개수가 적고, 열 생성이 낮은 네트워크 토폴로지를 채택하는 경향이 있다. 그러나 \"사용자 행동\"과 \"네 트워크 토폴로지\"가 서로 어느 정도의 상관관계를 지니고 있지만, 위 2가지의 관련 매개변수(들)/구성값(들)은 공진화 특성들을 지니고 있지 않다. 그러므로 \"사용자 행동\"과 \"네트워크 토폴로지\"는 공진화 프로세스를 통해 개선되지 않을 수 있다. 이를 고려하여, 본 개시의 실시 예들은 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법 및 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 시스템 및 방법을 제공한다. 본 개시의 실시 예들은 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법을 제공 하며, 상기 방법은, 제1 집단에 속해 있는 복수의 제1 개체들 및 제2 집단에 속해 있는 복수의 제2 개체들을 획 득하는 단계 - 상기 제1 개체들과 상기 제2 개체들은 공진화 프로세스를 통해 진화됨 -; 복수의 패턴-생성 네트 워크들에 의해 생성된 복수의 태스크 네트워크들을 획득하는 단계; 다중-타깃 함수를 기반으로 상기 제1 개체들 및 상기 제2 개체들로 상기 태스크 네트워크들의 각각의 태스크 네트워크를 트레이닝시키고 트레이닝 후에 상기 태스크 네트워크들의 각각의 태스크 네트워크의 정확도를 평가하는 단계 - 상기 다중-타깃 함수는 상기 태스크 네트워크들의 각각의 태스크 네트워크의 복수의 특성들을 포함함 -; 상기 태스크 네트워크들의 각각의 태스크 네트워크의 정확도를 기반으로 해당 패턴-생성 네트워크의 적응도 점수(fitness score)를 결정하는 단계 - 상기 패턴-생성 네트워크들의 각각의 패턴-생성 네트워크의 적응도 점수는 상기 패턴-생성 네트워크에 상응하는 태스 크 네트워크의 정확도에 긍정적인 상관관계가 있음 -; 및 상기 패턴-생성 네트워크들의 각각의 패턴-생성 네트 워크의 적응도 점수를 기반으로 상기 패턴-생성 네트워크들로부터 특정 패턴-생성 네트워크를 찾아내고 상기 태 스크 네트워크들 중에서 상기 특정 패턴-생성 네트워크에 상응하는 특정 태스크 네트워크를 선택하는 단계; 를 포함한다. 본 개시의 실시 예들은 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 방법을 제공하며, 상기 방법은, 센싱 데이터를 획득하고 상기 센싱 데이터를 입력 특징 벡터로 매핑하는 단계 - 상기 센싱 데이터는 제1 특정 개체에 속해 있는 복수의 센싱 속성들을 포함하고 상기 제1 특정 개체는 제1 집단에 속해 있음 -; 상기 입력 특징 벡터 를 특정 태스크 네트워크에 공급하여 상기 특정 태스크 네트워크가 출력 특징 벡터를 생성하게 하는 단계 - 상 기 특정 태스크 네트워크는 상기 제1 집단 및 제2 집단을 기반으로 트레이닝되고 상기 제1 개체들은 상기 제1 집단에 속해 있으며 상기 제2 개체들은 상기 제2 집단에 속해 있고 상기 제1 개체들 및 상기 제2 개체들은 공진 화 프로세스를 통해 진화됨 -; 및 상기 출력 특징 벡터에 따라 출력 액션을 결정하고 상기 출력 액션을 기반으 로 제2 특정 개체를 설정하는 단계 - 상기 제2 특정 개체는 상기 제2 집단에 속해 있음 -; 를 포함한다. 본 개시의 실시 예들은 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 시스템을 제공하며, 상기 시스템은, 센싱 회로, 통신 회로, 저장 회로 및 프로세서를 포함한다. 상기 저장 회로는 복수의 모듈들을 기록한다. 상기 프로세서는 상기 저장 회로에 연결되고 상기 모듈들에 액세스하여 이하의 동작들을 실행하고, 상기 이하의 동작 들은, 상기 센싱 회로로부터 센싱 데이터를 획득하고 상기 센싱 데이터를 입력 특징 벡터에 매핑하는 동작 - 상 기 센싱 데이터는 제1 특정 개체에 속해 있는 복수의 센싱 속성들을 포함하고 상기 제1 특정 개체는 제1 집단에 속해 있음 -; 상기 입력 특징 벡터를 특정 태스크 네트워크에 공급하여 상기 특정 태스크 네트워크가 출력 특징 벡터를 생성하게 하는 동작 - 상기 특정 태스크 네트워크는 상기 제1 집단 및 제2 집단을 기반으로 트레이닝됨 -; 및 상기 출력 특징 벡터에 따라 출력 액션을 결정하고 상기 통신 회로를 제어하여 상기 출력 액션을 상기 제 2 집단에 속해 있는 제2 특정 개체에 송신하는 동작 - 상기 출력 액션은 상기 제2 특정 개체를 설정하도록 구성 됨 -; 을 포함한다."}
{"patent_id": "10-2021-0048322", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 일 실시 예에 따른 서버의 개략도인 도 1을 참조하면, 도 1에서는, 서버가 저장 회로 및 프로세서를 포함할 수 있다. 상기 저장 회로는 예를 들어, 임의 유형의 고정 또는 휴대용 랜덤 액세 스 메모리(random access memory; RAM), 판독-전용 메모리(read-only memory; ROM), 플래시 메모리, 하드 디스 크, 다른 유사한 장치들, 또는 이러한 장치들의 조합이며 복수의 코드들 또는 모듈들을 기록하도록 구성될 수 있다. 상기 프로세서는 상기 저장 회로에 연결되고 범용 프로세서, 전용 프로세서, 기본 프로세서, 디지털 신호 프로세서, 복수의 마이크로프로세서들, 디지털 신호 프로세서 코어와 조합된 하나 이상의 마이크로-프로세 서들, 컨트롤러, 마이크로컨트롤러, ASIC(application specific integrated circuit), FPGA(field programmable gate array), 기타 유형의 집적 회로, 상태 머신 및 고급 RISC 머신(advanced RISC machine; ARM) 및 유사 제품들을 기반으로 하는 프로세서일 수 있다. 본 개시의 일 실시 예에서, 상기 프로세서는 본 개시에 의해 제안된 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법을 실현하기 위해 상기 저장 회로에 기록된 모듈들 및 프로그 램 코드들에 액세스할 수 있다. 세부사항들은 다음과 같다. 도 2를 참조하면, 도 2는 본 개시의 일 실시 예에 따른 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이 닝 및 선택하기 위한 방법의 흐름도이다. 이러한 실시 예의 방법은 도 1의 서버에 의해 실행될 수 있다. 도 2의 각각의 단계의 세부사항들은 도 1에 도시된 구성요소들을 참조하여 이하에서 설명될 것이다. 먼저, 단계 S210에서, 상기 프로세서는 제1 집단에 속해 있는 복수의 제1 개체들 및 제2 집단에 속해 있는 복수의 제2 개체들을 획득할 수 있다. 본 개시의 제1 실시 예에서, 상기 제1 집단 및 상기 제2 집단은 각각 예를 들어 5G에서 \"폐쇄-루프 제어\" 및 \" 개방-루프 제어\"이다. 이러한 상황에서, 상기 제1 집단에 속해 있는 제1 개체들은 각각 제어 기능 또는 트레이 닝된 모델일 수 있고, 상기 복수의 제1 개체들 각각은 복수의 상이한 제1 유전인자(gene)들을 지닐 수 있다. 상기 제어 기능에 속해 있는 제1 개체를 예로 들어보면, 상기 제1 개체의 제1 유전인자들은 예를 들어 서비스 품질 관리(QoS 관리), 접속성 관리(connectivity management), 원활한 핸드오버 제어(seamless handover control) 등을 포함하지만, 이들에 국한되지 않는다. QoS 관리에는 처리량(throughput), 종단간(end to end) 대기 시간, 네트워크 가용성 및 신뢰도 매개변수들과 같 은 매개변수(들)/구성값(들)이 포함될 수 있지만 이들에 국한되지 않는다. 접속성 관리에는 업스트림/다운스트 림 데이터 전송 속도, 업스트림/다운스트림 영역 트래픽 용량 및 전체 사용자 밀도와 같은 매개변수(들)/구성값 (들)이 포함될 수 있지만 이들에 국한되지 않는다. 원활한 핸드오버 제어에는 핸드오버를 위한 최대 속도와 같 은 매개변수(들)/구성값(들)이 포함될 수 있지만 이에 국한되지 않는다.또한, 트레이닝된 모델에 속해 있는 제1 개체를 예로 들어보면, 상기 제1 개체의 제1 유전인자들은 예를 들어 인공지능/머신 학습 모델이지만 이에 국한되지 않는다. 상기 제1 실시 예에서, 상기 제1 개체의 상기 제1 유전인자들 각각은 예를 들어 (어레이와 같은) 특정 데이터 구조의 형태로 데이터베이스에 저장될 수 있다. 예를 들어, 제어 기능에 속해 있는 상기 제1 개체에 상응하는 데이터 구조에는 QoS 관리, 접속성 관리, 원활한 핸드오버 제어 등과 같은 상기 유전인자들에 상응하는 복수의 필드들이 포함될 수 있다. 상기 필드들은 예를 들어, 위에 언급된 다양한 매개변수들/구성값들을 기록하도록 구 성될 수 있지만, 본 개시는 이에 국한되지 않는다. 또한, 상기 제2 집단에 속해 있는 상기 복수의 제2 개체들은 각각 폴리시(policy), 의도(intent) 또는 RAN 분석 일 수 있고, 상기 제2 개체들 각각은 복수의 상이한 제2 유전인자들을 지닐 수 있다. 상기 폴리시에 속해 있는 제2 개체를 예로 들어보면, 상기 제2 개체의 제2 유전인자들은 예를 들어 하위-폴리시 를 포함한다. 상기 의도에 속해 있는 제2 개체를 예로 들어보면, 상기 제2 개체의 제2 유전인자들은 예를 들어 액션(들) 및 매개변수 변경(들)을 포함한다. 상기 RAN 분석에 속해 있는 제2 개체를 예로 들어보면, 상기 제2 개체의 제2 유전인자들은 예를 들어 분석 및 학습 태스크들을 포함한다. 상기 제1 실시 예에서, 상기 제2 개체의 제2 유전인자들 각각은 예를 들어 특정 데이터 구조의 형태로 데이터베 이스에 저장될 수 있다. 예를 들어, 상기 폴리시에 속해 있는 상기 제2 개체에 상응하는 데이터 구조에는 하위- 폴리시 등과 같은 상기 유전인자들에 상응하는 복수의 필드들이 포함될 수 있다. 상기 필드들은 예를 들어 상기 서브-폴리시에 관련된 다양한 매개변수들/구성값들을 기록하도록 구성될 수 있지만, 본 개시는 이에 국한되지 않는다. 당업자는 상기 제1 실시 예에서 제1 개체의 제1 유전인자들 및 상기 제2 개체의 제2 유전인자들의 관련 설명에 대해 5G의 사양을 참조할 수 있으며, 이에 대한 세부사항들은 본 명세서에서 반복하지 않을 것이다. 제2 실시 예에서, 상기 제1 집단 및 상기 제2 집단은 각각 예를 들어 5G에서 \"사용자 행동\" 및 \"네트워크 토폴 로지\"이다. 이러한 상황에서, 상기 제1 집단에 속해 있는 제1 개체들은 사용자 행동에 관련된 다양한 제1 유전 인자를 포함할 수 있고, 상기 제2 집단에 속해 있는 제2 개체들은 상기 네트워크 토폴로지에 관련된 다양한 제2 유전인자를 포함할 수 있다. 예를 들어, 상기 제1 집단에 속해 있는 제1 개체들은 사용자 경험, 사용자 습관, 사용자 유형, 사용자 밀도 및 사용자 컨텍스트(user context)와 같은 매개변수(들)/구성값(들)을 포함할 수 있지만, 본 개시는 이들에 국한되 지 않는다. 또한, 상기 제2 집단에 속해 있는 제2 개체들은 무선 유닛(radio unit; RU), 분산 유닛 (distributed unit; DU), 중앙 유닛(central unit; CU), 및 모바일 에지 컴퓨팅(mobile edge computing; MEC) 서버와 같은 매개변수(들)/구성값(들)을 포함할 수 있지만, 본 개시는 이들에 국한되지 않는다. 상기 제2 실시 예에서, 상기 제1 개체들 각각의 제1 유전인자들 각각 및 상기 제2 개체들 각각의 제2 유전인자 들 각각은 예를 들어 특정 데이터 구조의 형태로 데이터베이스에 저장될 수 있다. 관련 설명들은 상기 제1 실시 예에서 찾아 볼 수 있으며, 이와 관련된 세부사항들은 본 명세서에서 반복하지 않을 것이다. 일 실시 예에서, 상기 제1 집단에 속해 있는 제1 개체들 및 상기 제2 집단에 속해 있는 제2 개체들은 이하 도 3 을 참조하여 부연 설명될 공진화 프로세스를 통해 진화될 수 있다. 도 3을 참조하면, 도 3은 본 개시의 일 실시 예에 따른 복수의 제1 개체들 및 복수의 제2 개체들의 획득의 흐름도이다. 먼저, 단계 S311에서, 상기 프로세서는 상기 제1 집단에 속해 있는 복수의 제1 초기 개체들을 무작위로 생 성할 수 있고 상기 제2 집단에 속해 있는 복수의 제2 초기 개체들을 무작위로 생성할 수 있다. 상기 제1 초기 개체들 각각은 상기 제1 개체들 각각과 마찬가지로 제1 유전인자들을 지니며 상기 제2 초기 개체들 각각은 상기 제2 개체들 각각과 마찬가지로 제2 유전인자들을 지닌다. 이러한 상황에서, 상기 제1 초기 개체 및 상기 제2 초 기 개체들의 제1/제2 유전인자들 각각의 매개변수(들)/구성값(들)은 예를 들어 무작위 값이지만 이에 국한되지 않는다. 다음으로, 단계 S312에서, 상기 프로세서는 신규성 검색 알고리즘을 기반으로 상기 제1 초기 개체들에서 복수의 제1 참조 개체들을 찾아 낼 수 있고, 상기 제1 참조 개체들 각각의 제1 유전인자들은 제1 최소 기준 (minimal criterion; MC)을 만족시킬 수 있다. 일 실시 예에서, 상기 프로세서는 K 최근린(K nearest neighbor; KNN) 알고리즘을 기반으로 상기 제1 초기 개체들 중에서 상기 제1 참조 개체들을 찾아 낼 수 있다. 이러한 상황에서, 찾아낸 제1 참조 개체들 각각은 서로 어느 정도의 차이가 나게 되고, 상기 신규성 검색 및 상기 KNN의 관련 세부사항들은 관련 기술 문헌들에서 찾아 볼 수 있으며 이에 대한 세부사항들은 본 명세서에서 반복하지 않을 것이다. 또한, 위에서 설명한 바와 같이 상기 제1 참조 개체들 각각은 해당 제1 MC를 더 만족시킨다. 상기 제1 실시 예 를 예로 들어보면, 상기 제1 집단에 속해 있는 제1 참조 개체들(예를 들어, 제어 함수 또는 트레이닝된 모델)이 만족해야 하는 상기 제1 MC는 예를 들어, 해당 폐쇄-루프 제어(예를 들어, 적절한 매개변수(들)/구성값(들)을 지니는 상기 유전인자들 각각)를 수행하도록 구성될 수 있는 능력이지만, 이에 국한되지 않는다. 상기 제2 실시 예를 예로 들어보면, (사용자 행동과 같은) 상기 제1 집단에 속해 있는 제1 참조 개체들이 만족 해야 하는 제1 MC는 예를 들어 (예컨대, 짧은 응답 시간을 요구하는) 적절한 사용자 경험을 지니는 것과 같은 매개변수(들)/구성값(들)이지만, 이들에 국한되지 않는다. 유사한 개념을 기반으로, 단계 S313에서, 상기 프로세서는 또한 신규성 검색 알고리즘을 기반으로 상기 제 2 초기 개체들에서 복수의 제2 참조 개체들을 찾아낼 수 있다. 다시 말하면, 상기 프로세서는 상기 KNN 알 고리즘을 기반으로 상기 제2 초기 개체들 중에서 상기 제2 참조 개체들을 찾아 낼 수 있는데, 그 이유는 찾아낸 제2 참조 개체들이 서로 어느 정도의 차이가 나게 되기 때문이다. 또한, 상기 제2 참조 개체들 각각의 제2 유전인자들은 제2 MC를 만족시킬 수 있다. 상기 제1 실시 예를 예로 들 어보면, 상기 제2 집단에 속해 있는 제2 참조 개체들(예를 들어, 정책, 의도 또는 RAN 분석)이 만족해야 하는 제2 MC는, 예를 들어 해당 개방-루프 제어(예를 들어, 적절한 매개 변수(들)/구성값(들)을 지니는 상기 유전인 자들 각각)를 수행하도록 구성될 수 있는 능력이지만, 이에 국한되지 않는다. 상기 제2 실시 예를 예로 들어보면, 상기 제2 집단에 속해 있는 제2 참조 개체들(예를 들어, 네트워크 토폴로지)이 만족해야 하는 제2 MC는, 예를 들어 적절한 RU(예를 들어, 다수의 RU), DU(예를 들어, 낮은 에너지 소비), CU(예를 들어, 높은 계산량) 및 MEC 서버(예를 들어, 다수의 MEC 서버)이지만, 이들에 국한되지 않는다. 상기 교시를 기반으로 상기 제1 집단에 속해 있는 제1 참조 개체들과 상기 제2 집단에 속해 있는 제2 참조 개체 들을 획득한 후에, 상기 제1 참조 개체들 및 상기 제2 참조 개체들은 이하에서 부연 설명될 본 개시의 실시 예 들에서 제안되는 공진화 프로세스를 거치도록 구성될 수 있다. 다음으로, 단계 S314에서, 상기 프로세서는 상기 제1 참조 개체들 각각의 제1 유전인자들을 기반으로 상기 제1 참조 개체들 각각의 제1 적응도(fitness)를 결정할 수 있고, 단계 S315에서, 상기 프로세서는 상기 제 2 참조 개체들 각각의 제2 유전인자들을 기반으로 상기 제2 참조 개체들 각각의 제2 적응도를 결정할 수 있다. 일반적으로는, 상기 공진화 프로세스가 개략적으로 (\"난초(orchid)들\"과 \"나방(moth)들\" 간 협력적 공진화와 같 은) 협력적 공진화 및 (\"기린들\"과 \"나무들\" 간 경쟁적 공진화와 같은) 경쟁적 공진화로 나뉠 수 있다. 본 개시 의 제1 실시 예에서는, 상기 제1 집단과 상기 제2 집단의 공통 목표들이 OPNF를 높이고 OPEX를 낮추는 것이므로, 상기 제1 집단과 상기 제2 집단의 공진화는 협력적 공진화로 간주될 수 있다. 이러한 상황에서, OPNF를 높이고 OPEX를 낮출 수 있는 제1 참조 개체들 및 제2 참조 개체들은 높은 해당 제1/제 2 적응도를 지닐 수 있다. 그 반면에, 본 개시의 제2 실시 예에서, 제1 집단의 목표들(예를 들어, 대량의 트래픽, 높은 대역폭, 적은 대기 시간, 낮은 전력 소비, 큰 커버리지 및 안정적인 접속)은 개략적으로 상기 제2 집단의 목표들(예를 들어, 적은 개수의 노드들, 낮은 전력 소비, 적은 개수의 링크들 및 낮은 열 생성)과 충돌한다. 그러므로 상기 제1 집단과 상기 제2 집단의 공진화는 경쟁적 공진화로 간주될 수 있다. 이러한 상황에서, 대량의 트래픽, 높은 대역폭, 적은 대기시간, 낮은 전력 소비, 큰 커버리지 및 안정적인 접속 을 지니는 제1 참조 개체들은 높은 해당 제1 적응도를 지닐 수 있다. 이와는 대조적으로, 적은 개수의 노드들, 낮은 전력 소비, 적은 개수의 링크들, 및 낮은 열 생성을 지니는 제2 참조 개체들은 높은 해당 제2 적응도를 지 닐 수 있다. 상기 제1 참조 개체들 각각의 제1 적응도가 결정된 후에, 단계 S316에서, 상기 프로세서는 상기 제1 참조 개체들을 제1 진화 그래프 내로 할당할 수 있다. 다른 실시 예들에서, 설계자는 필요에 따라 적절한 진화 그래 프를 제1 진화 그래프로 선택할 수 있다. 도 4를 참조하면, 도 4는 본 개시의 일 실시 예에 따른 다른 유형들의 진화 그래프들을 보여준다. 도 4는 총 4 개의 다른 진화 그래프(410 내지 440)를 보여준다. 상기 진화 그래프들(410 내지 440) 각각에서는, (원들로 도시된) 복수의 노드들은 동일 집단에 속해 있는 개체들을 나타내고, 상기 노드들 각각은 에지(edge)를 통해 인접 노드에 접속된다. 도 4에서, 에지들 각각에는 해당 에지 가중치가 할당되고 에지 가중치가 높은 에지는 두껍게 그려진다. 또한, 상기 진화 그래프들(410 내지 440)은 허브(hub)(예를 들어, 상기 진화 그래프들(410 내지 44 0)에서 점선들로 둘러싸인 영역) 및 브랜치(branch)들을 포함할 수 있다. 상기 진화 그래프들(410 내지 440)에 대한 세부사항들은 「Pavlogiannis, A., Tkadlec, J., Chatterjee, K. et al., \"Construction of arbitrarily strong amplifiers of natural selection using evolutionary graph theory,\" Commun Biol 1, 71」에서 찾아 볼 수 있으며, 이에 대한 세부사항들은 본 명세서에서 반복하지 않을 것이다. 다른 실시 예들에서, 상기 진화 그래프들(410 내지 440) 각각은 특정 데이터 구조, 템플릿 등과 같이 설계자 요구에 따라 여러 가능한 형 태로 존재할 수 있다. 일 실시 예에서, 필요한 제1 진화 그래프를 선택한 후에, 상기 프로세서는 이전에 획득된 제1 참조 개체들 을 상기 제1 진화 그래프에서 제1 노드들로서 구성하고 상기 제1 참조 개체들을 상기 제1 진화 그래프에 할당할 수 있다. 예를 들어, 상기 제1 진화 그래프 내 각각의 브랜치가 특정 애플리케이션 분야에 상응한다고 가정하면 (상기 애플리케이션 분야는 예를 들어 스마트 제조, 자율 주행 차량, 사물 인터넷, 스마트 의료, 스마트 교통 등이고, 상기 애플리케이션 분야는 매개변수(들)/구성값(들)으로 저장될 수도 있으며 설계자에 의해 정의될 수 도 있음), 상기 프로세서는 특정 애플리케이션 분야에 관련된 제1 참조 개체들을 상기 제1 진화 그래프 내 해당 브랜치에 할당하고, 특정 애플리케이션 분야에 관련이 없는 제1 참조 개체들을 상기 제1 진화 그래프의 허 브에 할당할 수 있다. 다른 실시 예들에서, 설계자는 설계 요구에 따라 상기 제1 진화 그래프 내로 상기 제1 참 조 개체들을 할당하기 위한 방법을 조정할 수 있지만, 본 개시는 이에 국한되지 않는다. 다른 일 실시 예에서, 상기 프로세서는 상기 제1 참조 개체들의 매개변수(들)/구성값(들)에 따라 상기 제1 참조 개체들을 상기 제1 진화 그래프 내로 할당한다. 마찬가지로, 상기 제2 참조 개체들 각각의 제2 적응도를 결정한 후에, 단계 S317에서, 상기 프로세서는 상 기 제2 참조 개체들을 상기 제2 진화 그래프 내로 할당할 수 있다. 다른 실시 예들에서, 설계자는 필요에 따라 적절한 진화 그래프를 상기 제2 진화 그래프로서 선택할 수 있다. 또한, 상기 프로세서에 의해 상기 제2 참조 개체를 상기 제2 진화 그래프 내에 할당하기 위한 방법은 상기 제1 참조 개체들을 상기 제1 진화 그래프 내로 할당하는 관련 설명에서 찾아 볼 수 있으며, 이에 대한 세부사항들은 본 명세서에서 반복하지 않을 것이다. 다음으로, 단계 S318에서, 상기 프로세서는 상기 제1 진화 그래프에서 복수의 제1 자손 개체들을 번식시킬 수 있다. 또한, 단계 S319에서, 상기 프로세서는 상기 제2 진화 그래프에서 복수의 제2 자손 개체들을 번 식시킬 수 있다. 본 개시의 실시 예들에서, 상기 제1 자손 개체들은 복수의 제1 세대들에 속해 있으며, 상기 제 2 자손 개체들은 복수의 제2 세대들에 속해 있고, 상기 제1 자손 개체들 각각 및 상기 제2 자손 개체들 각각은 공진화 프로세스를 통해 진화된다. 상기 제1 진화 그래프를 예로 들어보면, 상기 제1 진화 그래프는 복수의 제1 노드들을 포함하는 것으로서 이해 될 수 있으며, 상기 제1 노드들 각각은 현재 상기 제1 집단에 속해 있는 개체(예를 들어, 특정의 제1 참조 개체 또는 그의 자손; 상기 개체는 해당 제1 적응도를 지닐 수 있음)에 상응하는 것으로 간주될 수 있다. 특히, 상기 제1 집단 내 개체들의 새로운 자손은 진화 프로세스에서 나타나고 오래된 개체들은 진화 프로세스에서 제거된다. 이러한 상황에서, 상기 제1 진화 그래프 내 제1 노드들 각각은 아직 제거되지 않은 개체에 상응할 것으로 가정된 것이다. 일 실시 예에서, 상기 제1 진화 그래프를 기반으로 하는 번식 중에, 상기 프로세서는 다음의 동작들을 실 행하도록 구성될 수 있고, 상기 다음의 동작들은, (a) 상기 제1 집단에 속해 있는 개체들 중에서 제1 후보 개체 (예를 들어, 특정의 제1 참조 개체 또는 그의 자손 중 하나)을 선택하고 상기 제1 노드들 중에서 상기 제1 후보 개체에 상응하는 제1 특정 노드를 찾아내는 동작; (b) 상기 제1 후보 개체를 번식하여 적어도 하나의 제2 후보 개체(다시 말하면, 상기 제1 후보 개체의 자손)를 생성하고, 상기 제1 특정 노드의 에지들 각각의 에지 가중치 를 기반으로 상기 제1 특정 노드에 인접한 적어도 하나의 인접 노드를 상기 제2 후보 개체에 상응하는 적어도 하나의 제2 특정 노드로 대체하는 동작; (c) 누적 진화 시간(예를 들어, 상기 프로세서가 상기 제1 참조 개체를 획득한 이래로 계산된 누적 시간)이 (필요에 따라 설계자에 의해 결정될 수 있는) 시간 임계값에 도달한 것으로 결정함에 응답하여, 현재 제1 집단에 포함된 개인들을 제1 자손 개체들로서 구성하고, 상기 누적 진화 시간이 상기 시간 임계값에 도달하지 않은 것으로 결정함에 응답하여, (a) 동작으로 되돌아가는 동작; 을 포함 한다.도 5를 참조하면, 도 5는 본 개시의 일 실시 예에 따른 제1 진화 그래프에서의 번식의 개략도이다. 도 5에서, 고려된 제1 진화 그래프는 (여러 브랜치 및 허브(510a)를 포함하는) 도시된 패턴을 지니며 (원으로 도시된) 각각의 노드는 상기 제1 집단에 포함된 개체라고 가정된 것이다. 이러한 실시 예에서, 상기 제1 후보 개체로서 선택되는 제1 집단 내 개체들 각각의 확률은 상기 개체들 각각의 제1 적응도에 긍정적인 상관관계가 있을 수 있다. 도 5에 도시된 바와 같이, 진화 단계 S1에서, 특정의 제1 후보 개체가 선택되고, 상기 제1 후보 개체가 노드 (다시 말하면, 상기 제1 특정 노드)에 상응하며, 그리고 상기 노드 하부 에지의 에지 가중치가 크다 고 가정된 것이다. 이러한 상황에서, 상기 제2 후보 개체(다시 말하면, 상기 제1 후보 개체의 자손)에 상응하는 노드(다시 말하면, 상기 제2 특정 노드)가 상기 노드 하부에 원래 위치한 노드를 대신하는 것이 더 용이하다(다시 말하면, 상기 노드가 하방으로 번식하게 된다). 마찬가지로, 상기 노드는 또한 유사한 방식을 기반으로 하위 노드를 향해 더 번식할 수 있게 되고, 그럼으로써 단계 S2에서 조건부를 형성할 수 있게 된다. 단계 S3에서 상기 노드의 자손이 허브(510a)로 번식하게 되면, 상기 노드의 자손은 단계 S4에서 보인 바와 같이 후속 번식을 통해 상기 허브(510a) 내 노드들 각각을 점진적으로 대신할 수 있다. 다음으로, 상기 허 브(510a) 내 노드들은 상기 노드의 자손이 전체의 제1 진화 그래프를 완전히 대신할 때까지 (단계 S5 에서 보인 바와 같이) 다른 브랜치들로 계속 번식할 수 있다. 본 개시의 실시 예에서, 인접 노드를 대신하기 위해 상기 제1 진화 그래프에서 상기 제2 특정 노드를 구성 하는 상기 프로세서의 세부사항들은 「Pavlogiannis, A., Tkadlec, J., Chatterjee, K. et al., \"Construction of Arbitrarily strong amplifiers of natural selection using evolutionary graph theory,\" Commun Biol 1, 71」에서의 강력한 증폭기들에 대한 설명들에서 찾아 볼 수 있으며 이와 관련된 세부사항 들은 본 명세서에서 반복하지 않을 것이다. 마찬가지로, (현재 상기 제2 집단에 속해 있는 개체들에 상응할 수 있는) 제2 진화 그래프를 기반으로 번식하는 경우, 상기 프로세서는 또한 단계 (a) 내지 (c)와 유사한 동작들을 수행할 수 있다. 예를 들어, 상기 프로 세서는 다음의 동작들을 실행하도록 구성될 수 있으며, 상기 다음의 동작들은, (d) 상기 제2 집단에 속해 있는 개체들(예를 들어, 특정의 제2 참조 개체 또는 그의 자손) 중에서 제3 후보 개체를 선택하고 상기 제2 노 드들 중에서 상기 제3 후보 개체에 상응하는 제3 특정 노드를 찾아내는 동작; (e) 상기 제3 후보 개체를 번식하 여 적어도 하나의 제4 후보 개체(다시 말하면, 상기 제3 후보 개체의 자손)를 생성하고 상기 제3 특정 노드의 에지들 각각의 에지 가중치를 기반으로 상기 제3 특정 노드에 인접한 적어도 하나의 인접 노드를 상기 제4 후보 개체에 상응하는 적어도 하나의 제4 특정 노드로 대체하는 동작; (f) 누적 진화 시간(예를 들어, 상기 프로세서 가 상기 제2 참조 개체를 획득한 이래로 계산된 누적 시간)이 (필요에 따라 설계자에 의해 결정될 수 있는) 시간 임계값에 도달한 것으로 결정함에 응답하여, 현재 상기 제2 집단에 포함되어 있는 개체들을 상기 제 2 자손 개체들로서 구성하고, 상기 누적 진화 시간이 상기 시간 임계값에 도달하지 않은 것으로 결정함에 응답 하여, (d) 동작으로 되돌아가는 동작; 을 포함한다. 다른 실시 예들에서, 상기 프로세서는 상기 제1/제3 후보 개체를 번식하기 위한 다른 방법들을 채택하여 해당 제2/제4 후보 개체를 생성할 수 있다. 예를 들어, 상기 제1 실시 예에서, 상기 선택된 제1 후보 개체(의 제1 유전인자들)는 실제의 OPEX 및 OPNF를 획 득하기 위해 해당 폐쇄-루프 제어를 실현하도록 구성될 수 있다. 이러한 상황에서, 상기 제3 후보 개체의 선택 후에, 상기 프로세서는 상기 제3 후보 개체의 유전인자들 일부를 변경함으로써(다시 말하면, 돌연변이 (mutation)를 통해) 상기 제4 후보 개체를 생성할 수 있다. 상기 제4 후보 개체는 개방-루프 제어에서 채택된 타깃 OPEX 및 OPNF로서 이해될 수 있다. 일 실시 예에서, 상기 프로세서는 상기 제3 후보 개체의 유전인자 들 일부를 변경하기 위한 기반으로 상기 실제의 OPEX 및 OPNF를 구성할 수 있다. 예를 들어, 상기 실제의 OPEX 및 OPNF가 만족스럽지 않은 경우, 상기 프로세서는 상기 번식된 제4 후보 개체의 유전인자들에 의해 개방- 루프 제어에서 채택된 타깃 OPEX 및 OPNF를 상응하게 감소시킬 수 있다. 다음으로, 상기 제1 후보 개체의 선택 후에 상기 프로세서가 다시 상기 제1 집단에서의 번식을 수행할 때, 상기 제2 후보 개체는 상기 제1 후보 개체의 유전인자들 일부를 변경함으로써(다시 말하면, 돌연변이를 통해) 생성될 수 있다. 상기 제2 후보 개체는 실제의 OPEX 및 OPNF를 획득하기 위해 다른 한 폐쇄-루프 폐쇄를 실현하 도록 구성될 수 있다. 일 실시 예에서, 상기 프로세서는 상기 제1 후보 개체의 유전인자들 일부를 변경하 기 위한 기반으로 상기 타깃 OPEX 및 OPNF를 구성할 수 있다. 예를 들어, 상기 타깃 OPEX 및 OPNF가 높게 설정되면, 상기 프로세서는 상기 OPEX 및 OPNF를 개선하기 위해 상기 제2 후보 개체의 생성시 상기 유전인자들 일부를 조정할 수 있다. 이러한 방식으로, 상기 제1 실시 예의 상기 제1 집단 및 상기 제2 집단은 번식 동안 협력적 공진화의 패턴을 형 성할 수 있다. 상기 제2 실시 예에서, 상기 제1 집단(다시 말하면, 사용자 행동)으로부터 제1 후보 개체가 선택된 후에, 상기 프로세서는 상기 제1 후보 개체의 유전인자들 일부를 변경함으로써(다시 말하면, 돌연변이를 통해) 제2 후 보 개체를 생성할 수 있다. 예를 들어, 상기 프로세서는 현재 상기 제2 집단(다시 말하면, 네트워크 토폴 로지) 내 모든 개체들의 유전인자들을 기반으로 상기 제1 후보 개체의 유전인자들을 변경해야 하는 방법을 결정 하여 상기 제2 후보 개체를 생성할 수 있다. 예를 들어, 현재 상기 제2 집단 내 모든 개체들이 적은 개수의 RU 를 지니는 경우, 상기 프로세서는 그에 상응하게 상기 제2 후보 개체에서 긴 응답 시간을 선택하여 \"사용 자 경험\"의 유전인자를 설정할 수 있지만, 본 개시는 그에 국한되지 않는다. 마찬가지로, 상기 제2 집단(다시 말하면, 네트워크 토폴로지)에서 제3 후보 개체를 선택한 후에, 상기 프로세서 는 상기 제3 후보 개체의 유전인자들 일부를 변경함으로써(다시 말하면, 돌연변이를 통해) 제4 후보 개체 를 생성할 수 있다. 예를 들어, 상기 프로세서는 현재 상기 제1 집단(다시 말하면, 상기 사용자 행동) 내 모든 개체들의 유전인자들을 기반으로 상기 제3 후보 개체의 유전인자들을 변경해야 하는 방법을 결정하여 상기 제4 후보 개체를 생성할 수 있다. 예를 들어, 현재 상기 제2 집단 내 모든 개체들이 짧은 반응 시간을 지니는 것을 목적으로 하는 경우, 상기 프로세서는 상기 제4 후보 개체에서 약간 많은 개수의 RU를 선택하여 상기 \"RU\"의 유전인자를 설정할 수 있지만, 본 개시는 이에 국한되지 않는다. 그러나 운영 비용들을 고려하여, 운영자들은 일반적으로 그에 상응하게 모든 사용자 요구사항을 기반으로 하드 웨어 장치들을 항상 효율적으로 사용하지 않는다. 예를 들어, 사용자 행동에는 10% 트래픽 증가, 5% 대역폭 증 가, 20% 대기시간 감소, 30% 전력 소비 감소, 40% 커버리지 증가, 및 50% 접속 안정성 증가가 요구되는 경우, 상기 프로세서에 의해 생성된 제4 후보 개체는 그 요구사항들을 완전히 충족시키지 못할 수 있다. 오히려 그 결과들은 상기 요구사항들보다 약간 낮다(예를 들어, (20% 대신) 10% 노드들의 개수 증가, (30% 대신) 20% 전력 소비 증가, (35% 대신) 25% 링크들의 개수 증가, 및 (25% 대신) 15% 열 생성 증가). 이러한 방식으로, 상기 제2 실시 예의 상기 제1 집단 및 상기 제2 집단은 번식 동안 경쟁적 공진화의 패턴을 형 성할 수 있다. 또한, 상기 제1/제2 실시 예에서 어떠한 진화 목적들이 상기 공진화 프로세스에서 설정되어 있지 않기 때문에, 상기 공진화 프로세스는 또한 개방 공진화로서 이해될 수 있다. 본 개시의 실시 예에서, 상기 제2 진화 그래프에서 인접 노드를 제4 특정 노드로 대체하는 프로세서의 세 부사항들은 「Pavlogiannis, A., Tkadlec, J., Chatterjee, K. et al., \"Construction of Arbitrarily strong amplifiers of natural selection using evolutionary graph theory,\" Commun Biol 1, 71」에서의 강력 한 증폭기들에 대한 설명들에서 찾아 볼 수 있으며 이와 관련된 세부사항들은 본 명세서에서 반복하지 않을 것 이다. 본 교시에 따라 번식하여 상기 제1 집단의 복수의 제1 자손 개체들을 획득한 후에, 상기 프로세서는 단계 S320을 실행하여 상기 제1 자손 개체들을 상기 제1 개체들로서 정의할 수 있다. 다시 말하면, 상기 제1 집단이 계속해서 번식하여 해당 시간 임계값에 도달하면, 상기 프로세서는 현재 상기 제1 집단에 속해 있는 개체 들을 단계 S210에서 언급한 제1 개체들로서 간주할 수 있다. 마찬가지로, 본 교시에 따라 번식하여 상기 제2 집 단의 복수의 제2 자손 개체들을 획득한 후에, 상기 프로세서는 단계 S321을 실행하여 상기 제2 자손 개체 들을 상기 제2 개체들로서 정의할 수 있다. 다시 말하면, 상기 제2 집단이 계속해서 번식하여 해당 시간 임계값 에 도달하면, 상기 프로세서는 현재 상기 제2 집단에 속해 있는 개체들을 단계 S210에서 언급한 제2 개체 들로서 간주할 수 있다. 도 2를 다시 참조하면, 단계 S210에서 상기 제1 개체들 및 상기 제2 개체들이 본 교시에 따라 획득된 후에, 상 기 프로세서는 단계 S220을 실행하여 복수의 패턴-생성 네트워크들에 의해 생성된 복수의 태스크 네트워크 들을 획득할 수 있다. 일부 실시 예들에서, 상기 제1 개체들 및 상기 제2 개체들이 후속 동작들에서 트레이닝 데이터로서 구성될 필요 가 있으므로, 단계 S220을 실행하기 전에, 상기 프로세서는 추가 전처리를 수행하여 후속 트레이닝을 용이 하게 하기 위해 트레이닝 데이터로서 구성되기에 적합하지 않은 상기 제1/제2 개체들의 일부를 필터링할 수 있 지만, 본 개시는 이에 국한되지 않는다.일 실시 예에서, 상기 패턴-생성 네트워크들 각각은 예를 들어, 구성 패턴-생성 네트워크(compositional pattern-producing network; CPPN)이고 상기 프로세서는 상기 패턴-생성 네트워크들을 생성하기 위해 NEAT(NeuroEvolution of Augmenting Topologies) 네트워크를 사용할 수 있다. 일부 실시 예들에서, NEAT는 HyperNEAT 알고리즘을 기반으로 진화하여 상기 패턴-생성 네트워크들을 획득할 수 있다. 또한, NEAT로부터 진화 한 패턴-생성 네트워크들은 태스크 네트워크를 생성하도록 개별적으로 구성될 수 있다. NEAT가 진화하여 상기 패턴-생성 네트워크들을 획득하는 세부사항들과 상기 태스크 네트워크들을 개별적으로 생성하는 패턴-생성 네트 워크들의 세부사항들은 HyperNEAT의 관련 문헌들에서 찾아 볼 수 있으며 이에 대한 세부사항들은 본 명세서에서 반복하지 않을 것이다. 다음으로, 단계 S230에서, 상기 프로세서는 멀티-타깃 함수를 기반으로 상기 제1 개체들 및 상기 제2 개체 들로 상기 태스크 네트워크들 각각을 트레이닝하고 트레이닝 후에 상기 태스크 네트워크들 각각의 정확도를 평 가할 수 있다. 일 실시 예에서, 상기 제1 개체들 및 상기 제2 개체들은 베스트 프랙티스(best practice)를 기반으로 관련 직원 에 의해 수동으로 대응(라벨링)될 수도 있고, 알고리즘에 의해 자동으로 대응(라벨링)될 수도 있다. 상기 베스 트 프랙티스는 의도, 과거 경험 또는 이론적 도출로부터 도출될 수 있지만, 이에 국한되지 않는다. 예를 들어, \"사용자 행동\"(다시 말하면, 제1 집단) 내 특정 사용자 행동 A(다시 말하면, 제1 개체들)와 관련하 여, 상기 프로세서는 특정 설계자에 의해 고려된 사용자 행동에 상응해야 하는 \"네트워크 토폴로지\"(다시 말하면, 상기 제2 집단)에서 네트워크 토폴로지 B를 찾아내고 상기 네트워크 토폴로지 B를 해당 제2 개체로서 구성하며, 그리고 상기 네트워크 토폴로지 B를 라벨링할 수 있지만, 본 개시는 이에 국한되지 않는다. 일부 실 시 예들에서, 상기 제1 개체들 및 상기 제2 개체들 간의 대응 관계는 일대일(예를 들어, 네트워크 토폴로지에 상응하는 사용자 행동) 또는 다대일(예를 들어, 네트워크 토폴로지에 상응하는 복수의 사용자 행동들)일 수 있 지만 이에 국한되지 않는다. 다음으로, 상기 프로세서는 서로 상응하는 상기 제1 개체들 및 상기 제2 개체들을 기반으로 각각의 CPPN에 의해 생성된 태스크 네트워크들을 트레이닝시킬 수 있다. 도 6을 참조하면, 도 6은 본 개시의 일 실시 예에 따른 태스크 네트워크의 트레이닝의 개략도이다. 도 6에 도시 된 바와 같이, NEAT 네트워크에 의해 진화된 CPPN은 태스크 네트워크를 생성할 수 있다. 이러한 실시 예에서, 상기 태스크 네트워크는 2-계층 네트워크일 수 있다. 상기 계층들 각각은 복수의 뉴 런(neuron)들을 포함할 수 있으며 한 계층 내 뉴런들은 단지 다른 계층 내 뉴런들과의 접속들을 확립하고 동일 계층 내 뉴런들과의 접속들을 확립하지 않는다. 서로 다른 CPPN들에 의해 생성된 태스크 네트워크들 간의 주요 차이점은 2-계층 네트워크들이 서로 다른 접속 모드들을 지니고 상기 태스크 네트워크들의 트레이닝 프로세스 동안 뉴런 접속들의 가중치가 업데이트된다는 점에 있다. 도 6에서, 상기 태스크 네트워크는 총 4개의 입력값,( ),( ) 등을 기반으로 임의의 2개의 뉴런의 위치들을 정의할 수 있으며, 상기 CPPN의 출력은 상기 태스크 네트워크 내 임의의 2개의 뉴런 간 접속의 가중치이다. 상기 가중치가 0이면, 이것이 의미하는 것은 ( )가 ( )에 접속되어 있지 않다는 것이다. 상기 태스크 네트워크를 트레이닝할 때, 서로 상응하는 특정 제1 개체(C) 및 특정 제2 개체(D)에 대해, 상 기 프로세서는 상기 제1 개체(C)를 해당 입력 특징 벡터로 변환하고 상기 입력 특징 벡터를 상 기 태스크 네트워크에 입력하여 상기 태스크 네트워크를 트레이닝할 수 있다. 일 실시 예에서, 상기 태스크 네트워크가 상기 입력 특징 벡터를 수신한 후에, 상기 태스크 네트워크는 그에 따라 출 력 벡터를 생성할 수 있고, 상기 프로세서는 상기 태스크 네트워크 내 뉴런들의 가중치를 조정하여 상기 출력 벡터가 상기 제2 개체(D)에 상응하는 특징 벡터에 근접하게 할 수 있지만, 본 개시는 그에 국한되지 않는 다. 당업자를 위해, 서로 상응하는 상기 제1 개체들 및 상기 제2 개체들을 기반으로 상기 태스크 네트워크(60 3)들을 트레이닝하는 방법은 관련 기술문헌들에서 찾아 볼 수 있으며, 이와 관련된 세부사항들은 본 명세서에서 반복하지 않을 것이다. 여기서 이해해야 할 점은 서로 다른 실시 예들에서, 상기 프로세서가 상기 태스크 네트워크들을 트레 이닝할 때 상기 프로세서에 의해 채택된 다중-타깃 함수가 상기 태스크 네트워크들 각각의 복수의 특 성들을 포함할 수 있다는 점이다.상기 제1 실시 예를 예로 들어보면, 상기 프로세서에 의해 채택된 다중-타깃 함수는 예를 들어, 이며, 여기서 는 타깃 OPNF에 상응 할 수 있고 는 타깃 OPEX에 상응할 수 있다. 또한, Norm(x) 연산자는 x를 정규화하고 x를 0과 1 사이로 제한하도록 구성할 수 있다. 상기 제1 실시 예의 다중-타깃 함수에서 보인 바와 같이, 상기 프로세서가 상기 태스크 네트워크를 트레이닝하는 방향은 높은 OPNF 및 낮은 OPEX를 향하고 있지만, 본 개시는 이에 국한되지 않는다. 상기 제2 실시 예를 예로 들어보면, 상기 프로세서에 의해 채택된 다중-타깃 함수는 예를 들어,"}
{"patent_id": "10-2021-0048322", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이며, 여기서 는 노드들의 개수에 상응할 수 있고, 는 전력 소비에 상응할 수 있으며, 는 링크 들의 개수에 상응할 수 있고, 는 열 생성에 상응할 수 있다. 상기 제2 실시 예의 다중-타깃 함수에서 보인 바와 같이, 상기 프로세서가 상기 태스크 네트워크를 상기 태스크 네트워크를 트레이닝하는 방 향은 적은 노드 개수, 적은 전력 소비량, 적은 링크 개수 및 적은 열 생성량을 향하고 있지만, 본 개시는 이에 국한되지 않는다. 상기 CPPN들 각각에 의해 생성된 태스크 네트워크들 각각에 대해, 상기 프로세서는 본 교시에 따라 상기 태스크 네트워크들 각각을 트레이닝할 수 있다. 또한, 상기 태스크 네트워크들 각각의 트레이닝을 완료한 후에, 상기 프로세서는 상기 태스크 네트워크들 각각의 정확도를 평가할 수 있다. 일 실시 예에서, 상기 태스크 네트워크들 각각의 정확도는 예를 들어 상기 태스크 네트워크들 각각 및 상기 다중-타깃 함수에서 원하는 타깃 간의 근접성으로서 이해될 수 있다. 다시 말하면, 상기 태스크 네트워크들 각각이 다중-타깃 함수에서 설정된 타깃에 근접할수록 상기 태스크 네트워크들 각각의 정확도가 높아진다. 다른 실시 예들에서, 상기 정확도는 예 를 들어 트레이닝 정확도 또는 테스팅 정확도이지만 이에 국한되지 않는다. 상기 태스크 네트워크들 각각의 정확도를 평가한 후에, 단계 S240에서 상기 프로세서는 상기 태스크 네트 워크들 각각의 정확도를 기반으로 해당 패턴-생성 네트워크의 적응도 점수를 결정할 수 있다. 도 6를 예로 들어 보면, 상기 태스크 네트워크의 정확도를 평가한 후에, 상기 프로세서는 그에 따라 상기 CPPN의 적응도 점수를 결정할 수 있다. 일 실시 예에서, CPPN의 적응도 점수는 상기 CPPN에 상응하는 태스크 네트워크의 정확도에 긍정적인 상관관계가 있을 수 있다. 다시 말하면, 상기 태스크 네트워크의 정확 도가 높을수록 상기 CPPN의 적응도 점수가 높아지고, 그 반대로도 이루어질 수 있다. 다른 일 실시 예에서, 정확도는 필요에 따라 적응도 점수로 변환된다. 예를 들어, 평가된 태스크 네트워크의 총 정확도 는 상기 CPPN의 적응도 점수로 변환될 수 있으므로, 상기 정확도에 가중치가 할당될 수도 있고, 상기 정확 도에 상관 계수들이 할당될 수도 있으며, 상기 정확도에 미리 설정된 값이 추가될 수도 있고 필요에 따라 상기 정확도 및 상기 미리 설정된 값이 함께 추가될 수 있으며, 본 개시는 이에 국한되지 않는다. 다음으로, 단계 S250에서, 상기 프로세서는 상기 패턴-생성 네트워크들 각각의 적응도 점수를 기반으로 상 기 패턴-생성 네트워크들 중에서 특정 패턴-생성 네트워크를 찾아내고, 상기 태스크 네트워크들 중에서 상기 특 정 패턴-생성 네트워크에 상응하는 특정 태스크 네트워크를 선택할 수 있다. 일 실시 예에서, 상기 프로세서 는 상기 패턴-생성 네트워크들 중에서 가장 높은 적응도 점수를 지니는 패턴-생성 네트워크를 찾아내서 상 기 패턴-생성 네트워크를 상기 특정 패턴-생성 네트워크로서 구성할 수 있다. 예를 들어, 상기 CPPN이 NEAT 네트워크에 의해 진화된 패턴-생성 네트워크들 중에서 가장 높은 적응도 점수를 지닌다고 가정하면, 상기 프로세서는 그에 따라 상기 태스크 네트워크를 상기 특정 태스크 네트워크로서 선택할 수 있지 만, 본 개시는 그에 국한되지 않는다. 다음으로, 상기 프로세서는 찾아낸 특정 패턴-생성 네트워크 및 상기 특정 패턴-생성 네트워크로부터 생성 된 태스크 네트워크만을 보유하고 나머지 CPPN들 및 태스크 네트워크들을 제거할 수 있다. 명확한 설명을 위해, 상기 특정 패턴-생성 네트워크 및 상기 특정 태스크 네트워크의 예들로서 상기 CPPN 및 상기 태스크 네트 워크가 각각 사용되지만, 본 개시는 이에 국한되지 않는다. 다음으로, 다른 실시 예들에서, 상기 특정 태스크 네트워크는 상기 제1 집단의 획득된 센싱 데이터(예를 들어, 상기 제1 실시 예에서의 폐쇄-루프 제어의 매개변수(들)/구성값(들) 및 상기 제2 실시 예에서의 사용자 행동의 매개변수(들)/구성값(들))를 기반으로 상기 제2 집단의 인스턴스의 액션(들)을 설정하는 방법에 상응하게 추론 을 수행하도록 구성될 수 있다. 도 7을 참조하면, 도 7은 본 개시의 일 실시 예에 따른 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 시스 템의 개략도이다. 도 7에서, 시스템은 센싱 회로, 통신 회로, 저장 회로 및 프로세서(70 4)를 포함할 수 있다. 일 실시 예에서, 상기 센싱 회로는 상기 제1 실시 예에서의 폐쇄-루프 제어의 특정 인스턴스의 관련 매개변수(들)/구성값(들), 또는 상기 제2 실시 예에서의 사용자 행동의 특정 인스턴스의 관련 매개변수(들)/구성값(들)을 획득하도록 구성될 수 있다. 또한, 상기 통신 회로는 예를 들어 다양한 유형의 무선 트랜시버일 수 있고, 상기 프로세서의 제어하에서 지정된 장치들에 신호들/커맨드들을 송신할 수 있 다. 상기 저장 회로 및 상기 프로세서의 가능한 여러 구현 예는 상기 저장 회로 및 상기 프로세서 의 설명들에서 찾아 볼 수 있으며, 이와 관련한 세부사항들은 본 명세서에서 반복하지 않을 것이다. 도 8을 참조하면, 도 8은 본 개시의 일 실시 예에 따른 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 방법 의 흐름도이다. 이러한 실시 예의 방법은 도 7에 도시된 프로세서에 의해 실행될 수 있지만 이에 국한되지 않는다. 또한, 도 8의 내용에 대한 명확한 설명을 위해, 이하에서는 도 9를 참조하여 부연 설명을 제공한다. 도 9는 본 개시의 일 실시 예에 따른 센싱 데이터를 기반으로 한 액션(들)의 결정의 개략도이다. 먼저, 단계 S810에서, 상기 프로세서는 센싱 데이터를 획득하고 상기 센싱 데이터를 입력 특징 벡터 내에 매핑할 수 있다. 상기 센싱 데이터는 제1 특정 개체에 속해 있는 복수의 센싱 속성들을 포함할 수 있고, 상기 제1 특정 개체는 상기 제1 집단(예를 들어, 상기 제1 실시 예에서의 \"폐쇄-루프 제어\" 또는 상기 제2 실시 예에서의 \"사용자 행동\")에 속해 있을 수 있다. 예를 들어, 상기 제1 실시 예에서, 상기 센싱 데이터는 특정 폐쇄-루프 제어 인스턴스의 제어 함수 또는 트레이 닝된 모델의 관련 매개변수(들)/구성값(들)일 수 있다. 또한, 상기 제2 실시 예에서, 상기 센싱 데이터는 예를 들어 (특정 사용자 경험, 사용자 습관, 사용자 유형, 사용자 밀도 및 사용자 컨텍스트와 같은) 특정 사용자 행 동 인스턴스의 관련 매개변수(들)/구성값(들)일 수 있다. 다른 실시 예들에서, 상기 센싱 데이터는 상기 시스템에 접속된 다른 장치들에 의해 제공될 수 있지만, 본 개시는 이에 국한되지 않는다. 상기 센싱 데이터를 획득한 후에, 상기 프로세서는 상기 센싱 데이터를, 특 정 태스크 네트워크(예를 들어, 상기 태스크 네트워크) 내에 입력되도록 구성될 수 있는 입력 특징 벡터 내에 매핑할 수 있다. 상기 매핑의 관련 세부사항들은 관련 기술문헌들에서 찾아 볼 수 있으며 이와 관련된 세부사항들은 본 명세서에서 반복하지 않을 것이다. 다음으로, 단계 S820에서, 상기 프로세서는 상기 특정 태스크 네트워크가 출력 특징 벡터를 생 성할 수 있게 하도록 상기 입력 특징 벡터를 상기 특정 태스크 네트워크 내에 공급할 수 있다(예를 들어, 상기 태스크 네트워크는 상기 프로세서에 의해 상기 시스템에 제공될 수 있다). 상기 제1 실시 예에서, 상기 출력 특징 벡터는 예를 들어, 특정 개방-루프 제어의 관련 매개변수(들)/구성 값(들)의 조합에 상응하는 특징 벡터이다. 또한, 상기 제2 실시 예에서, 상기 출력 특징 벡터는 예를 들어, 특정 네트워크 토폴로지(예를 들어, GCN(graph convolutional network) 특징)의 관련 매개변수(들)/구성 값(들)의 조합에 상응하는 특징 벡터이다. 다음으로, 단계 S830에서, 상기 프로세서는 상기 출력 특징 벡터에 따라 출력 액션을 결정하고 상기 출력 액션을 기반으로 제2 특정 개체를 설정할 수 있다. 상기 제2 특정 개체는 상기 제2 집단(예를 들어, 상기 제1 실시 예에서의 \"개방-루프 제어\" 또는 상기 제2 실시 예에서의 \"네트워크 토폴로지\")에 속해 있을 수 있다. 일 실시 예에서, 상기 프로세서는 상기 출력 특징 벡터에 완전히 상응하는 출력 액션으로 상기 제2 특정 개체를 직접 설정할 수 있다. 예를 들어, 상기 제1 실시 예에서, 특정 개방-루프 제어의 매개변수들/구성 값들의 특정 조합에 상응하는 출력 특징 벡터를 생성한 후에, 상기 프로세서는 상기 개방-루프 제어 의 매개변수들/구성값들의 조합으로 해당 개방-루프 제어를 실행한다. 다른 일 예는 상기 제2 실시 예에서, 특 정 네트워크 토폴로지의 매개변수들/구성값들의 조합에 상응하는 출력 특징 벡터를 생성한 후에, 상기 프 로세서가 상기 네트워크 토폴로지를 상기 네트워크 토폴로지의 매개변수들/구성값들의 조합으로 설정할 수 도 있고 변환 후 특징 벡터를 기반으로 상기 네트워크 토폴로지를 구성할 수도 있다는 것일 것이다.그러나, 상기 제2 특정 개체를, 상기 출력 특징 벡터에 완전히 상응하는 출력 액션으로 설정하는 것은 어 느 정도 유연성이 없을 수 있다. 그러므로 본 개시의 실시 예는 실행의 유연성을 개선하기 위해 상기 출력 특징 벡터를 기반으로 상기 출력 액션을 결정하도록 분류기를 사용할 것을 추가로 제안한다. 일 실시 예에서, 상기 프로세서는 상기 분류기가 복수의 미리 설정된 액션들(A1 내지 AN) 중에서 상 기 출력 특징 벡터에 상응하는 특정 액션을 찾아내기 위해 상기 출력 특징 벡터를 상기 분류기 에 입력할 수 있다. 다음으로, 상기 프로세서는 상기 출력 액션으로서 찾아낸 특정 액션을 정의할 수 있다. 일부 실시 예들에서, 상기 분류기(예를 들어, SVM(support vector machine))는 특정 트레이닝 프로세스를 거친 트레이닝을 통해 획득될 수 있다. 예를 들어, 상기 특정 태스크 네트워크에 의해 생성된 여러 출력 특징 벡터에 대해, 설계자는 상기 미리 설정된 액션들(A1 내지 AN) 중 어느 하나가 상기 출력 특징 벡터들 각각 에 상응해야 하는 지를 미리 결정(다시 말하면, 라벨링)할 수 있다. 상기 미리 설정된 액션들(A1 내지 AN) 각각 은 특정 출력 특징 벡터에 완전히 상응하는 액션(들)을 포함할 수 있고, 또한 설계자가 실행하고자 하는 다른 액션(들)을 포함할 수 있다. 이러한 방식으로, 상기 분류기의 트레이닝을 완료한 후에, 상기 분류기가 상기 출력 특징 벡터 를 수신하면, 상기 분류기는 그에 따라 상기 미리 설정된 액션들(A1 내지 AN) 중에서 상기 출력 특징 벡터 에 상응하는 특정 액션을 찾아 낼 수 있다. 상기 특정 액션은 상기 출력 특징 벡터에 완전히 상응하 는 액션(들)을 포함할 수 있고, 또한 실행의 유연성을 개선하기 위해 다른 추가 액션(들)을 포함할 수 있다. 예를 들어, 상기 제1 실시 예에서, 특정 개방-루프 제어의 매개변수들/구성값들의 조합에 상응하는 출력 특징 벡터를 생성한 후에, 상기 프로세서는 상기 분류기가 상기 미리 설정된 액션들(A1 내지 AN) 중 에서 상기 출력 특징 벡터에 상응하는 특정 액션을 찾아 내게 할 수 있다. 상기 제1 실시 예에서, 상기 특 정 액션은 상기 해당 개방-루프 제어를 상기 개방-루프 제어의 매개변수들/구성값들의 조합으로 실행하는 관련 액션들을 포함하고, 또한 설계자에 의해 고려되는 함께 실행될 수 있는 다른 액션(들)을 포함할 수 있지만, 본 개시는 이에 국한되지 않는다. 다른 일 예는 상기 제2 실시 예에서, 특정 네트워크 토폴로지의 매개변수들/구성값들의 조합에 상응하는 출력 특징 벡터를 생성한 후에, 상기 프로세서가 상기 분류기로 하여금 상기 미리 설정된 액션들(A1 내지 AN) 중에서 상기 출력 특징 벡터에 상응하는 특정 액션을 찾아내게 할 수 있다는 것일 것이다. 상기 제2 실시 예에서, 상기 특정 액션은 상기 네트워크 토폴로지를 상기 네트워크 토폴로지의 매개변수들/구성값들 의 조합으로 설정하는 관련 액션(들)을 포함하고, 또한 설계자에 의해 고려되는 함께 실행될 수 있는 다른 액션 (들)을 포함할 수 있지만, 본 개시는 이에 국한되지 않는다. 일 실시 예에서, 상기 출력 액션을 결정한 후에, 상기 프로세서는 결과적으로 상기 제2 특정 개체를 설정 하기 위해 상기 제2 집단에 속해 있는 제2 특정 개체에 상기 출력 액션을 송신하도록 상기 통신 회로를 제 어할 수 있다. 예를 들어, 상기 제2 실시 예에서, 상기 제2 특정 개체는 예를 들어 네트워크 토폴로지 인스턴스 이며, 이는 상기 출력 액션에 따라 변환 후 GCN의 특징에 의해 형성된 벡터에 의해 기술(description)되는 네트 워크를 대상으로 조정될 수 있다. 따라서 새로운 5G 네트워크 토폴로지가 사용자 행동에 다시 한 번 영향을 미 친다. 도 10을 참조하면, 도 10은 본 개시의 일 실시 예에 따른 진화론적 기호 계산(evolutionary symbolic computation)의 개략도이다. 일 실시 예에서, 본 개시의 실시 예에 의해 수행되는 동작은 공간(SP1)(예를 들어, 상기 입력 특징 벡터)의 조건을 기반으로 공간(SP4)(예를 들어, 상기 출력 액션)에 속해 있는 액션(들)을 결정하기 위해 기호 함수(f)를 사용하는 것으로 대략 이해될 수 있다. 그러나 본질적으로 본 개시의 실시 예에 의해 수행되는 동작은 상기 공간(SP1)에 속해 있는 조건을 상기 공간(SP2) 내 제1 벡터로 변환하고, 상기 제1 벡터를 공간(SP3)에 속해 있는 제2 벡터로 변환하며, 그리고 상기 제2 벡터를 상기 공간(SP4)에 속해 있는 액션 (들)으로 변환하는 순차적인 액션들이다. 일 실시 예에서, 도 10에 도시된 함수(F)는 위에서 설명한 실시 예들 에서 상기 특정 태스크 네트워크에 상응하는 것으로 이해될 수 있다. 상기 함수(F)는 상기 공간(SP2)에 속해 있 는 제1 벡터를 상기 공간(SP3)에 속해 있는 제2 벡터로 변환할 수 있지만, 본 개시는 이에 국한되지 않는다. 다른 관점에서, 현재 기술에서는 계획 또는 추론이 대부분 규칙 엔진에 의해 수행된다. 본 개시에서는, 빅 데이 터를 기반으로 한 트레이닝에 의해 계획이나 추론이 완료되며, 수동으로 규칙들을 설정할 필요가 없다."}
{"patent_id": "10-2021-0048322", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "요약하면, 본 개시의 실시 예들의 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위한 방법은 대략 2가지의 단계: 개방 공진화 프로세스를 통해 제1 집단에 속해 있는 복수의 제1 개체들 및 제2 집단에 속해 있는 복수의 제2 개체들을 생성하는 단계; 상기 제1/제2 개체들을 기반으로 패턴-생성 네트워 크들 각각의 태스트 네트워크를 트레이닝하고 가장 높은 적응도 점수를 지니는 특정 패턴-생성 네트워크 및 상 기 가장 높은 적응도 점수를 지니는 특정 패턴-생성 네트워크에 의해 생성된 특정 태스크 네트워크를 찾아내는 단계를 포함하는 것으로 대략 이해될 수 있다. 상기 제1 단계에서, 본 개시의 실시 예들은 진화 그래프 및 강력한 증폭기의 개념을 도입한 것이다. 이러한 방 식으로, 집단들에서 높은 적응도를 지니는 개체들의 자손은 정착(fixation)을 용이하게 하기 위해 전체 진화 그 래프로 번식할 가능성이 크다. 이러한 방식으로, 번식을 통해 획득된 제1/제2 개체들은 우호적인 유전인자들을 지닐 수 있고 그럼으로써 상기 제2 단계에서 태스크 네트워크들 각각의 트레이닝을 용이하게 할 수 있다. 또한, 상기 제2 단계에서는, 상기 패턴-생성 네트워크들 각각의 적응도 점수가 해당 태스크 네트워크의 정확도 를 기반으로 결정되므로, 선택된 특정 패턴-생성 네트워크는 예를 들어 가장 높은 적응도 점수를 지니는 것이고, 해당 태스크 네트워크는 후속적으로 센싱 데이터를 기반으로 액션(들)을 결정하는 특정 태스크 네트워 크로서 구성될 수 있다. 이러한 방식으로, 상기 제1 집단에 상응하는 센싱 데이터가 획득되면, 특정 태스크 네트워크와 분류기는 그에 따라 적절한 출력 액션을 결정하여 상기 제1 실시 예에서 OPNF를 증가시키거나 OPEX를 감소시키고 상기 제2 실 시 예에서 사용자 활동에 따라 네트워크 토폴로지의 관련 매개변수(들)/구성값(들)을 조정할 수 있다. 비록 본 개시가 위에서 설명한 실시 예들에서 개시되었지만, 상기 실시 예들은 본 개시를 제한하기 위해 사용된 것이 아니다. 당업자는 본 개시의 사상 및 범위를 벗어나지 않고 일부 변경 및 수정을 할 수 있다. 그러므로 본 개시의 보호 범위는 첨부된 청구항들에 의해 정해진 범위에 따른다."}
{"patent_id": "10-2021-0048322", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 서버의 개략도이다. 도 2는 본 개시의 일 실시 예에 따른 공진화 메커니즘을 기반으로 태스크 네트워크를 트레이닝 및 선택하기 위 한 방법의 흐름도이다. 도 3은 본 개시의 일 실시 예에 따른 복수의 제1 개체들 및 복수의 제2 개체들을 획득하는 흐름도이다. 도 4는 본 개시의 일 실시 예에 따른 상이한 유형의 진화 그래프들을 보여주는 도면이다. 도 5는 본 개시의 일 실시 예에 따른 제1 진화 그래프에서의 번식의 개략도이다. 도 6은 본 개시의 실시 예에 따른 태스크 네트워크들의 트레이닝의 개략도이다. 도 7은 본 개시 내용의 일 실시 예에 따른 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 시스템의 개략도 이다. 도 8은 본 개시의 일 실시 예에 따른 센싱 데이터를 기반으로 액션(들)을 결정하기 위한 방법의 흐름도이다. 도 9는 본 개시의 일 실시 예에 따른 센싱 데이터를 기반으로 하는 액션(들)의 결정의 개략도이다. 도 10은 본 개시의 일 실시 예에 따른 진화론적 기호 계산(evolutionary symbolic computation)의 개략도이다."}
