{"patent_id": "10-2023-0092570", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0012380", "출원번호": "10-2023-0092570", "발명의 명칭": "자연어 처리에 기반한 과학기술 문헌의 분석 방법 및 이의 장치, 그리고 저장 매체", "출원인": "한국과학기술연구원", "발명자": "이병주"}}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "자연어 처리(Natural Language Processing) 기반의 임베딩(embedding)을 통해 과학기술 문헌의 임베딩 벡터를산출하는 단계;상기 임베딩 벡터로 표현된 과학기술 문헌 집합에 대해 밀도 기반 클러스터링(clustering)을 적용해 임베딩 공간 상에서 밀집된 문서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클러스터를 생성하는 단계;상기 과학기술 문헌이 상기 클러스터에 속할 확률과 상기 클러스터에 속한 과학기술 문헌들의 임베딩 값을 가중평균하여, 클러스터를 나타내는 토픽 벡터를 생성하는 단계; 그리고상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개별 클러스터 간의 임베딩 공간 상에서의 거리를 측정 및정규화하여 상기 과학기술 문헌을 군집화하는 단계;를 포함하는 자연어 처리에 기반한 과학기술 문헌의 분석 방법."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 임베딩은 doc2vec로 구현된 자연어 처리에 기반한 과학기술 문헌의 분석 방법."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 클러스터를 생성하는 단계는, neighbour graph 기반의 UMAP 알고리즘에 기반해 차원을 축소하는 단계;를 더 포함하는 자연어 처리에 기반한과학기술 문헌의 분석 방법."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 임베딩 벡터를 산출하는 단계에서, 데이터셋은 상기 과학기술 문헌에 대해 텍스트를 문서 식별번호와 토큰으로 구성된 시퀀스 형태로 구성하는 자연어 처리에 기반한 과학기술 문헌의 분석 방법."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 클러스터는 상기 클러스터에 속한 과학기술 문헌에서 추출된 최빈 명사구로 라벨링된 자연어 처리에 기반한 과학기술 문헌의 분석 방법."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항 내지 제 5 항 중에 어느 한 항의 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을수 있는 기록매체."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공지능 모델과 일련의 연산처리를 위한 프로그램을 저장하는 메모리; 및상기 인공지능 모델과 상기 프로그램을 통한 일련의 연산 과정을 통해서 과학기술 문헌을 클러스터에 따라 군집화하는 프로세서;를 포함하고,공개특허 10-2025-0012380-3-상기 프로세서는,자연어 처리(Natural Language Processing) 기반의 임베딩(embedding)을 통해 과학기술 문헌의 임베딩 벡터를산출하고,상기 임베딩 벡터로 표현된 과학기술 문헌 집합에 대해 밀도 기반 클러스터링(clustering)을 적용해 임베딩 공간 상에서 밀집된 문서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클러스터를 생성하고,상기 과학기술 문헌이 상기 클러스터에 속할 확률과 상기 클러스터에 속한 과학기술 문헌들의 임베딩 값을 가중평균하여, 클러스터를 나타내는 토픽 벡터를 생성하고,상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개별 클러스터 간의 임베딩 공간 상에서의 거리를 측정 및정규화하여 상기 과학기술 문헌을 군집화하는,연산 장치."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 임베딩은 doc2vec로 구현된 연산 장치."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서는, 상기 클러스터를 생성할 때, neighbour graph 기반의 UMAP 알고리즘에 기반해 차원을 축소하는 연산 장치."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 프로세서는, 상기 임베딩 벡터를 산출할 때, 데이터셋은 상기 과학기술 문헌에 대해 텍스트를 문서 식별번호와 토큰으로 구성된 시퀀스 형태로 데이터 셋을 입력받는 연산 장치."}
{"patent_id": "10-2023-0092570", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 클러스터는 상기 클러스터에 속한 과학기술 문헌에서 추출된 최빈 명사구로 라벨링된 연산 장치."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예의 자연어 처리에 기반한 과학기술 문헌의 분석 방법은, 자연어 처리(Natural Language Processing) 기반의 임베딩(embedding)을 통해 과학기술 문헌의 임베딩 벡터를 산출하는 단계, 상기 임베딩 벡터로 표현된 과 학기술 문헌 집합에 대해 밀도 기반 클러스터링(clustering)을 적용해 임베딩 공간 상에서 밀집된 문서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클러스터를 생성하는 단계, 상기 과학기술 문헌이 상기 클러스터에 속할 확률과 상기 클러스터에 속한 과학기술 문헌들의 임베딩 값을 가중 평균하여, 클러스터를 나타내는 토픽 벡 터를 생성하는 단계, 상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개별 클러스터 간의 임베딩 공간 상에서 의 거리를 측정 및 정규화하여 상기 과학기술 문헌을 군집화하는 단계를 포함한다."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥러닝 기반 자연어 처리(Natural Language Processing)에 기반해 대량의 과학기술 문헌을 연산가능 한 형태로 나타내고 클러스터링을 적용하여 과학기술 연구동향을 다양한 관점에서 분석하는 기술에 관한 것이다."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "연구개발 컨설팅은 주로 과학기술 연구동향 분석결과에 기반한다. 과학기술 연구동향 분석은 과학기술 문헌(학 술논문, 특허, 보고서 등을 말하며, 이하 '기술문서'라 함)의 내용에 기반한다. 빠르게 변화하는 과학기술 분야 에서 기술문서의 분석은 연구개발 컨설팅에서 필수적이다. 그런데 지금까지 제안된 연구개발 컨설팅 방식은 거시적인 과학기술 트렌드와 주요 연구 조직들의 활동을 고려 하며, 특정 도메인에 해당하는 제한적인 기술문서를 기반으로 1회성의 국소적인 기술 동향을 얻을 수 있다는 기 술적 한계가 있다.즉, 지금까지 제안된 방식은 도메인 확장성, 연산 효율 등의 측면에서 한계가 있다."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는, 대량의 기술문서에 대해 사용자의 개입 없이 자동으로 기술문서를 분석해 연구개발 컨설팅을 지원하는데 있다."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위하여, 일 실시예의 자연어 처리에 기반한 과학기술 문헌의 분석 방법은, 자연어 처리(Natural Language Processing) 기반의 임베딩(embedding)을 통해 과학기술 문헌의 임베딩 벡터를 산출하 는 단계, 상기 임베딩 벡터로 표현된 과학기술 문헌 집합에 대해 밀도 기반 클러스터링(clustering)을 적용해 임베딩 공간 상에서 밀집된 문서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클러스터를 생성하는 단계, 상기 과학기술 문헌이 상기 클러스터에 속할 확률과 상기 클러스터에 속한 과학기술 문헌들의 임베딩 값을 가중 평균하여, 클러스터를 나타내는 토픽 벡터를 생성하는 단계, 상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개별 클러스터 간의 임베딩 공간 상에서의 거리를 측정 및 정규화하여 상기 과학기술 문헌을 군집화하는 단계를 포함한다. 또한 본 발명의 다른 실시예들에서는 상술한 자연어 처리에 기반한 과학기술 문헌의 분석 방법을 구현하는 연산 장치와 프로그램을 기록한 기록매체를 개시한다."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예의 본 발명에 따르면, 대량의 텍스트 데이터를 효율적으로 다룰 수 있는 구조이기 때문에, 특정 과학 기술 도메인에 대한 일회성의 연구동향 분석을 수행하는 기존 연구개발 컨설팅 시스템과 달리, 여러 도메인에 대한 분석이 가능하다. 또한 본 발명에 따르면, 전문적인 과학기술 문헌에 딥러닝 기반의 자연어처리 기술을 적용하여, 도메인 지식 없 이도 정확하게 문서 유사도를 계산하고 적합한 클러스터링 결과를 제공할 수 있다."}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 실시예들을 구체적으로 설명하도록 한다. 다만, 하기의 설명 및 첨부된 도면에서 본 발명의 요지를 흐릴 수 있는 공지 기능 또는 구성에 대한 상세한 설명은 생략한다. 덧붙여, 명세서 전체에서, 어떤 구성 요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것 이 아니라, 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성 요소들은 상기 용 어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으 로 사용될 수 있다. 예를 들어, 본 발명의 권리 범위로부터 이탈되지 않은 채 제 1 구성 요소는 제 2 구성 요소 로 명명될 수 있고, 유사하게 제 2 구성 요소도 제 1 구성 요소로 명명될 수 있다. 본 발명에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"구비하다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또 는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 특별히 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본"}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미이다. 일반적 으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미인 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해 석되지 않는다. 본 발명은 딥러닝 기반 자연어 처리(Natural Language Processing)에 기반해 대량의 과학기술 문헌을 연산가능 한 형태로 나타내고 클러스터링을 적용하여 과학기술 연구동향을 다양한 관점에서 분석하는 기술에 관한 것이다. 본 명세서에서 과학기술 문헌이라 함은 기술의 연구개발 컨설팅에 필요한 기술 흐름이나 동향을 분석하 기 위한 과학적 문서들로, 학술논문, 특허, 보고서 등을 포함한 의미로 사용된다. 도 1은 본 발명의 일 실시예에 따른 연어 처리에 기반한 과학기술 문헌의 분석 방법의 흐름을 보여주는 도면이 다. 도 1을 참조해 본 발명을 설명하면 다음과 같다. 일 실시예에 따른 연어 처리에 기반한 과학기술 문헌의 분석 방법은, 자연어 처리(Natural Language Processing) 기반의 임베딩(embedding)을 통해 과학기술 문헌의 임베딩 벡터를 산출하는 단계(S101), 상기 임베 딩 벡터로 표현된 과학기술 문헌 집합에 대해 밀도 기반 클러스터링(clustering)을 적용해 임베딩 공간 상에서 밀집된 문서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클러스터를 생성하는 단계(S103), 상기 과학기 술 문헌이 상기 클러스터에 속할 확률과 상기 클러스터에 속한 과학기술 문헌들의 임베딩 값을 가중 평균하여, 클러스터를 나타내는 토픽 벡터를 생성하는 단계(S105), 상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개 별 클러스터 간의 임베딩 공간 상에서의 거리를 측정 및 정규화하여 상기 과학기술 문헌을 군집화하는 단계 (S107)을 포함해 구성된다. S101 단계에서, 연산 장치는 딥러닝 기반 자연어처리(Natural Language Processing) 기술인 문서 학습을 통해 비정형화된 과학기술 문헌의 임베딩 벡터를 산출한다. 이 단계(S101)에 대해 자세히 설명하면 다음과 같다. 본 발명에서 임베딩(embedding)은 인공신경망 기반의 문서임베딩 방식 중 doc2vec을 사용하는데, 이는 단어의 의미를 아주 잘 구분하는 임베딩 모델로 알려진 word2vec에서 파생된 모델이다. doc2vec 모델은 임베딩 퀄리티 뿐만 아니라 연산 효율이 높다는 장점이 있다. 또한, doc2vec 모델은 사전적으로 훈련 데이터 셋(약 30만건)에 대해 문서 임베딩 모델을 학습함으로써, 본 발명에서 다루는 연구 도메인에 맞춘 임베딩 모델을 비교적 쉽게 얻 을 수 있다는 장점이 있다. 반면에, doc2vec 이후 제안된 방법들은 사전에 학습된 모델의 결과에 기반해, 문서의 임베딩 값을 제시하기 때 문에 biased embedding을 얻거나, 혹은 fine tuning을 필수적으로 해야 하는 문제가 있다. Doc2Vec 모델은 문서 ID를 하나의 단어로 취급하여, 문장의 한 단어의 임베딩 값으로 주위 단어를 예측하도록 학습한 인공신경망 모델(PV-DBOW)의 임베딩 값과 주위 단어의 임베딩 값으로 문서의 중심 단어를 예측하도록 학 습한 모델(PV-DM)의 임베딩 값을 결합하여 문서의 임베딩 값으로 사용한다. 이 단계에서 입력 데이터셋은 상기 과학기술 문헌에 대해 텍스트를 문서 식별번호와 토큰으로 구성된 시퀀스 형 태로 구성된다. S103 단계에서, 연산 장치는 임베딩 벡터로 표현된 과학기술 문헌 집합에 대해 밀도 기반 클러스터링 (clustering)을 적용해 임베딩 공간 상에서 밀집된 문서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클 러스터를 생성한다. 이 단계(S103)에 대해 자세히 설명하면 다음과 같다. 본 발명은 이 단계에서 유사한 문서의 클러스터를 얻기 위해, 고차원의 벡터 공간 상에 존재하는 개체(i.e., 문 서) 간의 밀집도에 따라 일정 거리 안에 일정 개수 이상의 이웃이 존재하도록 클러스터를 정의하는 방식을 채택 하였다. 거리 기반의 클러스터링이 아닌, 밀도 기반의 클러스터링을 도입함으로써, 아웃라이어(여러 연구 토픽들의 결합 을 나타내는 논문)의 존재를 확인하고, 밀집된 문서 집합을 식별하여 잘 구분된 클러스터(연구 토픽)을 얻고자 하였다. 밀도 기반 클러스터링(예: DBSCAN)과 거리 기반 클러스터링(예: kmeans)의 차이를 설명하면, 밀도 기반은 밀집 된 데이터 포인트 집합을 클러스터로 인식하나, 거리 기반은 데이터 분포 보다는 중심부와의 거리에 기반한 집 합을 클러스터로 인식한다는 점에서 다르다. 밀도 기반 클러스터링의 파라미터는 Eps(노드와의 최소거리), MinPts(노드의 최소 이웃 노드 수)가 있으며, 최 소 거리 내에 최소 이웃 노드 수를 만족하지 못하면 노이즈로 취급된다. 밀도 기반 클러스터링은 거리 기반 클 러스터링과 달리, 클러스터의 수를 사전에 정의할 필요가 없으므로, 본 발명처럼 거대한 연구 분야 내에 몇 개 의 연구 토픽이 존재하는지에 대한 확정적인 정보가 없는 상황에서는 밀도 기반 클러스터링이 거리 기반 클러스 터링보다 적합하다. 또한, 밀도 기반 클러스터링의 결과인 클러스터, 아웃라이어 각각은 연구 토픽(유사한 문헌들의 집합)과 아웃라 이어 논문(여러 주제의 융합적인 성격의 문헌 혹은 어느 주제에도 속하지 않는 문헌)으로 해석할 수 있다. 구체 적으로, 본 발명은 hierarchical DBSCAN (HDBSCAN)을 사용하여, 파라미터 최적화 작업을 단순화하였다. 즉, 최 소 이웃 수(minPts)에 대한 파라미터만 사전에 정해주고, 밀도 거리(epsilon)에 대한 정의는 필요 없다. 또한 HDBSCAN은 다양한 밀도 거리를 테스트하기 때문에, 강한 밀도를 보이는 로컬한 영역에서도 다양한 클러스터를 식별할 수 있다는 장점이 있다. 한편, 본 발명에서 클러스터는 클러스터에 속한 과학기술 문헌에서 추출된 최빈 명사구로 라벨링될 수 있다. 본 발명은 클러스터링 결과를 효과적으로 해석하기 위해, 클러스터별로 문헌 집합을 식별하고, 최빈 명사구를 알아내어 라벨링에 활용할 수 있다. 구체적으로 Spacy라는 python 자연어처리 라이브러리를 활용하여, 문서의 명사구의 원형을 추출하여 통계를 산출한다. 일반적으로, 토픽 라벨링은 토픽 모델링(예: Latent Dirichlet allocation)의 결과를 해석하는 과정으로, 토픽 을 구성하는 키워드(단일어, 예: density, function)의 조합을 기반으로 이루어진다. 하지만, 복잡한 과학적 지 식이 없는 사용자가 여러 개의 과학 토픽들을 효율적으로 분석하기 위해서는, 보다 해석하기 쉬운 분석 단위가 필요하므로, 문장의 주요 내용을 의미할 수 있는 최소한의 단위인 명사구(예: density function theory, cathode material)를 추출하여 라벨링에 사용한다. 이 같은 라벨링 결과는 비전문가가 명사구를 기반으로 수행하였고, 상당 부분 전문가의 동의를 얻을 수 있는 수 준이었던 것으로 실험되었다. 추가적으로, 본 발명에서는 보다 정확한 검증을 위해 클러스터의 라벨링(어떤 연구 주제인가 명시)을 검증하기 위해, 각 클러스터의 중심부에 가까운 문서들을 식별하여 확인하였다. 즉, 각 클러스터별로 대표값(토픽벡터)와 구성 문서들의 임베딩 벡터 간의 거리를 계산하여, 클러스터를 잘 나타낼 수 있는 문서들을 식별하고 라벨링을 보정하였다. 한편, S103 단계는 neighbour graph 기반의 UMAP 알고리즘에 기반해 차원을 축소하는 단계를 더 포함해 구성될 수 있다. 차원을 축소하는 단계를 포함하는 경우에 고차원의 임베딩에 대한 밀도 기반 클러스터링의 연산 효율 을 높일 수 있다. 본 발명은, 원본 데이터의 분포에서 데이터 인스턴스들의 글로벌한 구조를 잘 반영하는 neighbour graph 기반의 UMAP 알고리즘을 사용해, 차원축소를 진행한다. PCA와 같은 matrix factorization 기반 차원축소 알고리즘도 고 려해 볼 수 있으나, 이 방식은 고유값 분해에 초점을 두고 있기 때문에, 데이터의 분포를 보존하기 어렵다. 때문에 본 발명에서는 클러스터링 결과 퀄리티 및 연산 효율을 고려해, UMAP을 문서 임베딩 값에 적용하였다. 일 예로, 본 발명에서는 600차원의 문서 임베딩 벡터를 저차원의 벡터로 축소하여 활용하였다. S105 단계에서, 연산 장치는 과학기술 문헌이 상기 클러스터에 속할 확률과 상기 클러스터에 속한 과학기술 문 헌들의 임베딩 값을 가중 평균하여, 클러스터를 나타내는 토픽 벡터를 생성한다. 토픽 벡터는 상술한 밀도 기반 클러스터링의 결과에 따라, 특정 클러스터에 대하여, 클러스터에 속한 노드들의 벡터 값과 클러스터에 속할 확률 값에 기반하여 가중 평균을 구해 추정할 수 있다. 특정 문헌이 주어졌을 때, 연산장치는 각 토픽 벡터와의 코사인 유사도를 구해 아래의 수학식 1처럼 토픽 관련 성을 구하고, 이를 전체 합으로 나누어 표준화한다. 수학식 1"}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이를 통해서, 아웃라이어로 정의된 문헌들의 관련 토픽들을 식별하고, 해당 문헌들이 어떤 연구 주제들의 융합 으로 인한 결과인지 해석할 수 있다. 예를 들어, 도 2와 같이 아웃라이어로 표기된 문헌이 임베딩 공간 상에서 가까운 토픽벡터들을 찾아, 해당 문헌이 cathode material, lithium metal 등의 토픽과 관련 있 다는 사실을 추정할 수 있다. 마지막으로, S107 단계에서, 연산 장치는 상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개별 클러스터 간 의 임베딩 공간 상에서의 거리를 측정 및 정규화하여 상기 과학기술 문헌을 군집화한다. 도 3은 상술한 본 발명에 따라 과학기술 문헌을 군집화한 모습을 시각적으로 보여준다. 도 3의 실험은 상술한 분석 방법을 토대로 재료과학 분야 과학문헌을 대상으로 하였다. 문헌의 개수는 314,425개, 이로부터 자동으로 만들어진 클러스터(과학기술 토픽)의 수는 257개였다. 도 3은 임베딩 공간 상에 문헌들이 군집화된 모습을 보여주는데, 번호 21은 과학기술 문헌에서 추출된 토 픽을, 23은 임베딩 공간 상에서 밀집된 문헌, 즉 클러스터이다. 본 발명에서는 이처럼 전문적인 과학기술 문헌에 딥러닝 기반의 자연어처리 기술을 적용하여, 도메인 지식 없이 도 정확하게 문서 유사도를 계산하고 적합한 클러스터링 결과를 제공할 수 있다. 나아가, 본 발명은 특정 과학 기술 도메인에 대한 일회성의 연구동향 분석을 수행하는 기존 연구개발 컨설팅 시스템과 달리, 여러 도메인에 대한 분석이 가능하다. 본 발명에서는 이 같은 군집화 결과를 가지고 연구동향 분석을 위한 다양한 시각적 자료를 제공할 수 있다. 이 하에서 설명되는 시각화는 메타정보(저자의 소속국가, 소속기관, 연구지원기관, 저널 등)을 활용하여 구해질 수 있다. 이 같은 시각화 방법은 알려진 다양한 알고리즘이 사용될 수 있고, 본 발명에서는 특별한 제한이 없이 자 유롭게 알려진 알고리즘이 사용될 수 있다. 도 4는 특정 집단이 어떤 학술에 관심이 많은지를 보여주는 학술 관심도를 시각적으로 보여주는 자료이다. 본 발명에서는 특정 집단을 나타내는 문서 집합이 주어졌을 때, 토픽을 가진 문서 셋으로부터 주요 토픽을 파악 하고, 그 토픽들에 대한 표준화된 토픽 관련성 값을 합하여 학술 관심도를 수식 2와 같이 정량화하였다. 수식 2 는 집단 j의 문서 집합 D에 대해, 토픽 i에 대한 토픽 연관성 수치를 합하는 과정을 나타내며, 이 과정을 문서 집합 D의 주요 토픽들에 대해 진행하였다.수학식 2"}
{"patent_id": "10-2023-0092570", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "예를 들어, 저널 nature material의 문서 집합에 대해, 주요 토픽을 식별하고 이에 대한 토픽 관련성을 합하여 학술 관심도를 도 4와 같이 시각적으로 나타낼 수 있다. 이 자료는 저널별 혹은 국가별로 주요 토픽을 비교하거 나, 시계열적 변화를 분석하는데 활용될 수 있다. 도 5 내지 도 11은 다양한 도메인(관심주제)에 따른 분석 결과를 시각적으로 보여준다. 여기서의 분석은 재료과 학 문헌 314,425건, 분석 국가 10개국, 분석 기간은 2017~2021년을 기초로 한다. 도 5는 국가, 연도에 다른 토픽 변화를 시각적으로 보여주며, 도 6은 국가별 문헌의 통계, 도 7은 국가별 연구 성과 비교, 도 8은 국가간 협업 동향을, 도 9는 주요 저널을 비교한 것이고, 도 10은 주요 토픽을 비교한 것을 각각 시각적으로 보여준다. 그리고, 도 11은 분석 저널 123개를 기초로 한 년도별 토픽 변화를 보여준다. 본 발명은 이처럼 다양한 도메인에 대한 기술동향 분석이 가능한 반면에, 종래의 기술동향 분석은 1차원적 도메 인에 한정되었다는 점에서 본 발명의 기술적 의의를 찾을 수 있다. 도 8은 상술한 자연어 처리에 기반한 과학기술 문헌의 분석 방법이 실행되는 연산 장치()를 도시한 블록도로서, 도 1의 일련의 처리 과정을 하드웨어 구성의 관점에서 재구성한 것이다. 따라서, 여기서는 설명의 중복을 피하 고자 각 구성의 기능 및 동작을 중심으로 그 개요만을 약술하도록 한다. 메모리는 문서임베딩을 위한 인공지능 모델, 밀도 기반 클러스터링(clustering)을 위한 인공지능 모델, 연 산을 위한 전반적인 프로그램을 저장하기 위한 구성이다. 프로세서는 메모리에 저장된 인공지능 모델 및 프로그램을 로딩해서 자연어 처리(Natural Language Processing) 기반의 임베딩(embedding)을 통해 과학기술 문헌의 임베딩 벡터를 산출하고, 상기 임베딩 벡터로 표현된 과학기술 문헌 집합에 대해 밀도 기반 클러스터링(clustering)을 적용해 임베딩 공간 상에서 밀집된 문 서 집합을 식별하여 하나의 과학기술 토픽을 나타내는 클러스터를 생성하고, 상기 과학기술 문헌이 상기 클러스 터에 속할 확률과 상기 클러스터에 속한 과학기술 문헌들의 임베딩 값을 가중 평균하여, 클러스터를 나타내는 토픽 벡터를 생성하고, 상기 토픽 벡터를 기반으로, 상기 과학기술 문헌과 개별 클러스터 간의 임베딩 공간 상 에서의 거리를 측정 및 정규화하여 상기 과학기술 문헌을 군집화한다. 또한, 프로세서는 neighbour graph 기반의 UMAP 알고리즘에 기반해 차원을 축소하여 고차원의 임베딩에 대 한 밀도 기반 클러스터링의 연산 효율을 높일 수 있다. 또한, 프로세서는 임베딩 벡터를 산출할 때, 과학기술 문헌에 대해 텍스트를 문서 식별번호와 토큰으로 구 성된 시퀀스 형태의 데이터 셋을 입력받는다. 또한, 프로세서는 클러스터에 속한 과학기술 문헌에서 추출된 최빈 명사구로 라벨링한다. 한편, 상술한 본 발명의 분석 방법은 컴퓨터로 읽을 수 있는 기록 매체에 컴퓨터가 읽을 수 있는 코드로 구현하 는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장 되는 모든 종류의 기록 장치를 포함한다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등을 포함한다. 또한, 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고 본 발명을 구현하기 위한 기능적인 (functional) 프로그램, 코드 및 코드 세그먼트들은 본 발명이 속하는 기술 분야의 프로그래머들에 의하여 용이 하게 추론될 수 있다. 이상에서 본 발명에 대하여 그 다양한 실시예들을 중심으로 살펴보았다. 본 발명에 속하는 기술 분야에서 통상 의 지식을 가진 자는 본 발명이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시된 실시예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되 어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 그와 동등한 범위 내에 있 는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0092570", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 연어 처리에 기반한 과학기술 문헌의 분석 방법의 흐름을 보여주는 도면이 다. 도 2는 임베딩 공간 상에서의 아웃라이어를 설명하는 도면이다. 도 3은 일 실시예에 따라 과학기술 문헌을 군집화한 모습을 시각적으로 보여준다. 도 4 내지 도 11은 다양한 도메인(관심주제)에 따른 분석 결과를 시각적으로 보여준다. 도 12는 일 실시예의 연산장치를 보여주는 블록도이다."}
