{"patent_id": "10-2021-0170715", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0082857", "출원번호": "10-2021-0170715", "발명의 명칭": "인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치", "출원인": "엘지디스플레이 주식회사", "발명자": "최동준"}}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 출력하는 측정기; 및 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여, 인공 지능 신경망을 토대로 상기 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성하고, 상기 예측하여생성된 광학 보상 결과 데이터를 상기 디스플레이 패널에 대응되는 메모리에 저장시키는 인공 지능 기반 광학보상 제어기를 포함하는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 예측하여 생성된 광학 보상 결과 데이터는, 밴드, 휘도, 또는 색 좌표 별로 예측된 데이터 전압에 대한 정보를 포함하는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 예측하여 생성된 광학 보상 결과 데이터는 감마 전압에 대한 정보를 더 포함하는 인공 지능 기반의 광학보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 인공 지능 신경망은 아핀층 신경망(Affine Layer Neural Network)인 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 아핀층 신경망은, 제1 전처리의 처리 정보와 대응되는 복수의 입력 노드를 포함하는 입력층, 제2 전처리의처리 정보와 대응되는 복수의 제1 중간 노드를 포함하는 제1 중간층, 제3 전처리의 처리 정보와 대응되는 복수의 제2 중간 노드를 포함하는 제2 중간층, 및 메인 처리의 처리 정보와 대응되는 복수의 출력 노드를 포함하는출력층을 포함하고, 상기 복수의 입력 노드는 상기 복수의 제1 중간 노드의 전체와 연결되고, 상기 복수의 제1 중간 노드는 상기 복수의 제2 중간 노드의 전체와 연결되고, 상기 복수의 제2 중간 노드는 상기 복수의 출력 노드의 전체와 연결되는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 제1 전처리는 색 좌표 또는 휘도 별 사전 광학 보상 처리이고, 상기 제2 전처리는 제1 휘도 값을 이용한공개특허 10-2023-0082857-3-색상 별 사전 광학 보상 처리이고, 상기 제3 전처리는 상기 제1 휘도 값보다 높은 제2 휘도 값을 이용한 색상별 사전 광학 보상 처리이고, 상기 메인 처리는 상기 광학 특성 측정 결과 데이터를 얻기 위한 처리인 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 인공 지능 기반 광학 보상 제어기는, 상기 예측하여 생성된 광학 보상 결과 데이터를 토대로 상기 인공 지능 신경망을 업데이트 하는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 적어도 하나의 다른 디스플레이 패널에 대한 상기 이전 광학 보상 결과 데이터는, 상기 적어도 하나의 다른 디스플레이 패널에 대하여 완료된 이전 광학 보상 프로세스의 진행 결과를 통해 얻어진 데이터로서, 데이터전압에 대한 정보를 포함하는 디스플레이 장치."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 인공 지능 기반 광학 보상 제어기는, 상기 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 머신 러닝을 진행하여 머신 러닝 결과 데이터를 생성하고, 상기 머신 러닝 결과 데이터와 상기 광학 특성 측정 결과 데이터를 이용하여 상기 인공 신경망을 토대로 상기광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성하는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 인공 지능 기반 광학 보상 제어기는, 상기 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 빅데이터인 로그 파일을 수집하는 로그 파일 수집 프로세스를 실행하고, 상기 수집된 로그 파일에서 상기 머신 러닝 용도의 학습데이터를 선별하는 데이터 가공 프로세스를 실행하고, 상기 선별된 학습 데이터를 토대로 상기 머신 러닝을 진행하여 상기 머신 러닝 결과 데이터를 생성하는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 인공 지능 기반 광학 보상 제어기는, 상기 측정기를 통해 상기 광학 특성 측정 결과 데이터를 얻기 위한 상기 디스플레이 패널의 광학 특성을 측정하기 전에, 상기 측정기를 통해 상기 디스플레이 패널의 광학 특성을 1차적으로 측정하도록 제어하여 구동 전압을설정하는 전 처리를 수행하는 인공 지능 기반의 광학 보상 시스템.공개특허 10-2023-0082857-4-청구항 12 제11항에 있어서, 상기 구동 전압은 상기 디스플레이 패널에 포함된 서브 픽셀에 공급되는 기저 전압 또는 블랙 데이터 전압을 포함하거나 영역 별 휘도 가중치를 포함하는 인공 지능 기반의 광학 보상 시스템."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "측정기를 통해 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 생성하는 단계; 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 인공 지능 신경망을 토대로 인공 지능 프로세스를 실행하는 단계; 상기 인공 지능 프로세스의 실행 결과, 상기 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터로서 밴드 별 또는 계조 별 데이터 전압을 예측하여 생성하는 단계; 및 상기 예측하여 생성된 데이터 전압에 대한 정보를 상기 디스플레이 패널에 대응되는 메모리에 저장시키는 단계를 포함하는 인공 지능 기반의 광학 보상 방법."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 인공 지능 프로세스를 실행하는 단계 이전에, 상기 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학보상 결과 데이터를 이용하여 머신 러닝을 진행하여 머신 러닝 결과 데이터를 생성하는 머신 러닝 진행 단계를더 포함하고, 상기 인공 지능 프로세스를 실행하는 단계에서는, 상기 머신 러닝 결과 데이터와 상기 광학 특성 측정 결과 데이터를 토대로 상기 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성하는 인공지능 기반의 광학 보상 방법."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 머신 러닝 진행 단계 이전에, 상기 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 빅데이터인 로그 파일을 수집하는 로그 파일 수집 단계; 및 상기 수집된 로그 파일에서 상기 머신 러닝 용도의 학습 데이터를 선별하는 데이터 가공 단계를 더 포함하는 인공 지능 기반의 광학 보상 방법."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 광학 특성 측정 결과 데이터를 생성하는 단계 이전에, 상기 측정기를 통해 상기 디스플레이 패널의 광학특성을 1차적으로 측정하도록 제어하여 구동 전압을 설정하는 전 처리 단계를 더 포함하는 인공 지능 기반의 광학 보상 방법."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "공개특허 10-2023-0082857-5-제13항에 있어서, 상기 데이터 전압을 예측하여 생성하는 단계 이후, 밴드 및 포인트를 변경하는 루프 제어 단계를 더 포함하고, 상기 루프 제어 단계 이후, 상기 광학 특성 측정 결과 데이터를 생성하는 단계, 상기 인공 지능 프로세스를 실행하는 단계, 및 상기 데이터 전압을 예측하여 생성하는 단계가 반복 실행되는 인공 지능 기반의 광학 보상 방법."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "데이터 라인을 포함하는 디스플레이 패널; 밴드 별 또는 계조 별 데이터 전압에 대한 정보를 저장하는 메모리; 및 상기 밴드 별 또는 계조 별 데이터 전압 중에서 현재 밴드 또는 현재 계조에 대응되는 데이터 전압을 상기 데이터 라인으로 출력하는 데이터 구동 회로를 포함하고, 상기 메모리에 저장된 상기 밴드 별 또는 계조 별 데이터 전압에 대한 정보는 인공 지능 신경망에 기초한 인공지능 프로세스의 실행 결과에 따라 상기 디스플레이 패널의 광학 특성 측정 결과 데이터에 대응되는 광학 보상결과 데이터로서 예측되어 상기 메모리에 저장된 정보인 디스플레이 장치."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서, 상기 예측된 광학 보상 결과 데이터는 원하는 타깃 별로 예측된 데이터 전압에 대한 정보를 포함하는 디스플레이 장치."}
{"patent_id": "10-2021-0170715", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 원하는 타깃은 원하는 밴드, 휘도, 또는 색 좌표를 포함하고, 상기 예측된 광학 보상 결과 데이터는 감마 전압에 대한 정보를 더 포함하는 디스플레이 장치."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 디스플레이 패널의 광학 특성을 측정하여 광 학 특성 측정 결과 데이터를 출력하는 측정기, 및 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여, 인공 지능 신경망을 토대로 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데 이터를 예측하여 생성하고, 예측하여 생성된 광학 보상 결과 데이터를 디스플레이 패널에 대응되는 메모리에 저 장시키는 인공 지능 기반 광학 보상 제어기를 포함할 수 있다."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시 예들은 인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치에 관한 것이다."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "유기 발광 디스플레이 장치 등과 같은 자체 발광 디스플레이 장치는 스스로 발광하는 발광 소자를 이용함으로써 응답 속도가 빠르고, 발광 효율, 휘도 및 시야각 등이 큰 장점 때문에 큰 각광을 받고 있다. 하지만, 유기 발광 디스플레이 장치 등과 같은 자체 발광 디스플레이 장치의 경우, 공정 상의 다양한 원인에 의 해 디스플레이 패널 별로 서로 다른 광학 특성이 발생할 수 있고, 이로 인해, 동일 모델의 여러 디스플레이 패 널들에 동일한 전압 또는 전류가 인가되더라도 디스플레이 패널 별로 구현되는 화상의 색좌표 또는 휘도가 달라 질 수 있다."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "기존의 디스플레이 기술 분야에서는, 유기 발광 디스플레이 패널 등의 자체 발광 디스플레이 패널 별 광학 특성 편차로 인해 화상 품질이 저하되는 문제점이 있어 왔으며, 이를 해결하기 위하여 다양한 광학 보상 기술이 제안 되었으나, 광학 보상 성능이 충분하지 않거나 광학 보상 처리 시간이 매우 긴 문제점이 발생하고 있는 실정이다. 이에, 본 명세서의 발명자들은 정확하고 빠른 광학 보상 기술로서 인공 지능 기반의 광학 보상 시스 템, 광학 보상 방법, 및 디스플레이 장치를 발명하였다. 본 개시의 실시 예들은 정확하고 빠른 광학 보상 기술로서 인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들은 디스플레이 패널의 광학 특성에 최적화 된 데이터 전압을 예측하여 디스플레이 구동을 수행할 수도 있도록 해주는 인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들은 디스플레이 패널들마다의 특성과 조건 변화 등에 능동적이고 신속한 대응이 가능한 인공 지능 기반의 광학 보상 시스템 및 광학 보상 방법과, 인공 지능 기반의 광학 보상이 적용된 디스플레이 장치를 제공할 수 있다."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예들은, 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 출력하는 측정 기; 및 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여, 인공 지능 신경망 을 토대로 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성하고, 예측하여 생성 된 광학 보상 결과 데이터를 디스플레이 패널에 대응되는 메모리에 저장시키는 인공 지능 기반 광학 보상 제어 기를 포함하는 인공 지능 기반의 광학 보상 시스템을 제공할 수 있다. 본 개시의 실시 예들은, 측정기를 통해 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 생성하는 단계; 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 인공 지능 신경망을 토대로 인공 지능 프로세스를 실행하는 단계; 인공 지능 프로세스의 실행 결과, 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터로서 밴드 별 또는 계조 별 데이터 전압을 예측하여 생성하는 단계; 및 예측하여 생성된 데이터 전압에 대한 정보를 디스플레이 패널에 대응되는 메모리에 저장시키는 단계를 포함 하는 인공 지능 기반의 광학 보상 방법을 제공할 수 있다. 본 개시의 실시 예들은, 데이터 라인을 포함하는 디스플레이 패널; 밴드 별 또는 계조 별 데이터 전압에 대한 정보를 저장하는 메모리; 및 밴드 별 또는 계조 별 데이터 전압 중에서 현재 밴드 또는 현재 계조에 대응되는 데이터 전압을 데이터 라인으로 출력하는 데이터 구동 회로를 포함하는 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들에 따른 디스플레이 장치에서, 메모리에 저장된 밴드 별 또는 계조 별 데이터 전압에 대한 정보는, 인공 지능 신경망에 기초한 인공 지능 프로세스의 실행 결과에 따라 디스플레이 패널의 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터로서 예측되어 메모리에 저장된 정보일 수 있다."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시 예들에 의하면, 정확하고 빠른 광학 보상 기술로서 인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들에 의하면, 디스플레이 패널의 광학 특성에 최적화 된 데이터 전압을 예측하여 디스플레이 구동을 수행할 수도 있도록 해주는 인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들에 의하면, 디스플레이 패널들마다의 특성과 조건 변화 등에 능동적이고 신속한 대응이 가 능한 인공 지능 기반의 광학 보상 시스템 및 광학 보상 방법과, 인공 지능 기반의 광학 보상이 적용된 디스플레 이 장치를 제공할 수 있다."}
{"patent_id": "10-2021-0170715", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일부 실시예들을 예시적인 도면을 참조하여 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가질 수 있다. 또한, 본 개시를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 수 있다. 본 명세서 상에서 언급된 \"포함한다\", \"갖는다\", \"이루어진다\" 등이 사용되는 경우 \"~만\"이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별한 명시적인 기재 사항이 없는 한 복수를 포함하는 경우를 포함할 수 있다. 또한, 본 개시의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이 러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질, 차례, 순서 또는 개수 등이 한정되지 않는다. 구성 요소들의 위치 관계에 대한 설명에 있어서, 둘 이상의 구성 요소가 \"연결\", \"결합\" 또는 \"접속\" 등이 된다 고 기재된 경우, 둘 이상의 구성 요소가 직접적으로 \"연결\", \"결합\" 또는 \"접속\" 될 수 있지만, 둘 이상의 구성 요소와 다른 구성 요소가 더 \"개재\"되어 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 여 기서, 다른 구성 요소는 서로 \"연결\", \"결합\" 또는 \"접속\" 되는 둘 이상의 구성 요소 중 하나 이상에 포함될 수 도 있다. 구성 요소들이나, 동작 방법이나 제작 방법 등과 관련한 시간적 흐름 관계에 대한 설명에 있어서, 예를 들어, \"~후에\", \"~에 이어서\", \"~다음에\", \"~전에\" 등으로 시간적 선후 관계 또는 흐름적 선후 관계가 설명되는 경우, \"바로\" 또는 \"직접\"이 사용되지 않는 이상 연속적이지 않은 경우도 포함할 수 있다. 한편, 구성 요소에 대한 수치 또는 그 대응 정보(예: 레벨 등)가 언급된 경우, 별도의 명시적 기재가 없더라도, 수치 또는 그 대응 정보는 각종 요인(예: 공정상의 요인, 내부 또는 외부 충격, 노이즈 등)에 의해 발생할 수 있는 오차 범위를 포함하는 것으로 해석될 수 있다. 이하, 첨부된 도면을 참조하여 본 개시의 다양한 실시예들을 상세히 설명한다. 도 1은 본 개시의 실시 예들에 따른 디스플레이 장치의 시스템 구성도이다. 도 1을 참조하면, 본 개시의 실시 예들에 따른 디스플레이 장치의 디스플레이 구동 시스템은 디스플레이 패널 및 디스플레이 패널을 구동하기 위한 구동 회로를 포함할 수 있다. 디스플레이 패널은 영상이 표시되는 표시 영역(DA)과 영상이 표시되지 않는 비-표시 영역(NDA)을 포함할 수 있다. 디스플레이 패널은 영상 표시를 위하여 기판(SUB) 상에 배치되는 다수의 서브 픽셀들(SP)을 포함 할 수 있다. 예를 들어, 다수의 서브 픽셀들(SP)은 표시 영역(DA)에 배치될 수 있다. 경우에 따라, 비-표시 영 역(NDA)에 적어도 하나의 서브 픽셀(SP)이 배치될 수도 있다. 비-표시 영역(NDA)에 배치되는 적어도 하나의 서 브 픽셀(SP)은 더미 서브 픽셀이라고도 한다. 디스플레이 패널은 다수의 서브 픽셀들(SP)을 구동하기 위하여, 기판(SUB) 상에 배치되는 다수의 신호 배 선들을 포함할 수 있다. 예를 들어, 다수의 신호 배선들은 다수의 데이터 라인들(DL) 및 다수의 게이트 라인들 (GL)을 포함할 수 있다. 신호 배선들은 서브 픽셀(SP)의 구조에 따라, 다수의 데이터 라인들(DL) 및 다수의 게 이트 라인들(GL)과 다른 신호 배선들을 더 포함할 수도 있다. 예를 들어, 다른 신호 배선들은 구동 전압 라인들 및 기준 전압 라인들 등을 포함할 수 있다. 다수의 데이터 라인들(DL) 및 다수의 게이트 라인들(GL)은 서로 교차할 수 있다. 다수의 데이터 라인들(DL) 각 각은 제1 방향으로 연장되면서 배치될 수 있다. 다수의 게이트 라인들(GL) 각각은 제2 방향으로 연장되면서 배 치될 수 있다. 여기서, 제1 방향은 칼럼(Column) 방향이고 제2 방향은 로우(Row) 방향일 수 있다. 본 명세서에 서, 칼럼(Column) 방향과 로우(Row) 방향은 상대적인 것이다. 예를 들어, 칼럼 방향은 세로 방향이고 로우 방향 은 가로 방향일 수 있다. 다른 예를 들어, 칼럼 방향은 가로 방향이고 로우 방향은 세로 방향일 수도 있다. 아 래에서는, 설명의 편의를 위하여, 각 데이터 라인(DL)은 세로 방향으로 연장되면서 배치되고, 각 게이트 라인 (GL)은 가로 방향으로 연장되면서 배치되는 것으로 가정한다. 구동 회로는 다수의 데이터 라인들(DL)을 구동하기 위한 데이터 구동 회로 및 다수의 게이트 라인들(GL)을 구동하기 위한 게이트 구동 회로를 포함할 수 있다. 구동 회로는 데이터 구동 회로 및 게이트 구동 회로를 제어하기 위한 컨트롤러를 더 포함할 수도 있다. 데이터 구동 회로는 다수의 데이터 라인들(DL)을 구동하기 위한 회로이고, 다수의 데이터 라인들(DL)로 영 상 신호에 해당하는 데이터 신호들(데이터 전압들이라고도 함)을 출력할 수 있다. 게이트 구동 회로는 다 수의 게이트 라인들(GL) 구동하기 위한 회로이고, 게이트 신호들을 생성하여 다수의 게이트 라인들(GL)로 게이 트 신호들을 출력할 수 있다. 컨트롤러는, 각 프레임에서 구현하는 타이밍에 따라 스캔을 시작하고, 스캔에 맞춰 적당한 시간에 데이터 구동을 제어할 수 있다. 컨트롤러는, 외부에서 입력되는 입력 영상 데이터를 데이터 구동 회로에서 사용하는 데이터 신호 형식에 맞게 전환하여 전환된 영상 데이터를 데이터 구동 회로에 공급할 수 있다. 컨트롤러는, 입력 영상 데이터와 함께, 디스플레이 구동 제어 신호들을 외부의 호스트 시스템으로부 터 수신할 수 있다. 예를 들어, 디스플레이 구동 제어 신호들은 수직 동기 신호(VSYNC), 수평 동기 신호 (HSYNC), 입력 데이터 인에이블 신호(DE: Data Enable), 클럭 신호 등을 포함할 수 있다. 컨트롤러는, 호스트 시스템에서 입력된 디스플레이 구동 제어 신호들에 기초하여, 데이터 구동 제어 신호들(DCS) 및 게이트 구동 제어 신호들(GCS)을 생성할 수 있다. 컨트롤러는, 데이터 구동 제어 신호들 (DCS)을 데이터 구동 회로에 공급함으로써, 데이터 구동 회로의 구동 동작 및 구동 타이밍을 제어할 수 있다. 컨트롤러는, 게이트 구동 제어 신호들(GCS)을 게이트 구동 회로에 공급함으로써, 게이트 구 동 회로의 구동 동작 및 구동 타이밍을 제어할 수 있다. 데이터 구동 회로는 하나 이상의 소스 드라이버 집적 회로(SDIC: Source Driver Integrated Circuit)를 포함할 수 있다. 각 소스 드라이버 집적 회로(SDIC)는 시프트 레지스터(Shift Register), 래치 회로(Latch Circuit), 디지털 아날로그 컨버터(DAC: Digital to Analog Converter), 출력 버퍼 등을 포함할 수 있다. 각 소스 드라이버 집적 회로(SDIC)는, 경우에 따라서, 아날로그 디지털 컨버터(ADC: Analog to Digital Converter)를 더 포함할 수 있다. 예를 들어, 각 소스 드라이버 집적 회로(SDIC)는 테이프 오토메티드 본딩(TAB: Tape Automated Bonding) 방식 으로 디스플레이 패널과 연결되거나, 칩 온 글래스(COG: Chip On Glass) 또는 칩 온 패널(COP: Chip On Panel) 방식으로 디스플레이 패널의 본딩 패드에 연결되거나, 칩 온 필름(COF: Chip On Film) 방식으로 구 현되어 디스플레이 패널과 연결될 수 있다. 게이트 구동 회로는 컨트롤러의 제어에 따라, 턴-온 레벨 전압의 게이트 신호를 출력하거나 턴-오프 레벨 전압의 게이트 신호를 출력할 수 있다. 게이트 구동 회로는 다수의 게이트 라인(GL)으로 턴-온 레벨 전압의 게이트 신호를 순차적으로 공급함으로써, 다수의 게이트 라인(GL)을 순차적으로 구동할 수 있다. 게이트 구동 회로는 테이프 오토메티드 본딩(TAB) 방식으로 디스플레이 패널과 연결되거나, 칩 온 글 래스(COG) 또는 칩 온 패널(COP) 방식으로 디스플레이 패널의 본딩 패드(Bonding Pad)에 연결되거나, 칩 온 필름(COF) 방식에 따라 디스플레이 패널과 연결될 수 있다. 또는, 게이트 구동 회로는 게이트 인 패널(GIP: Gate In Panel) 타입으로 디스플레이 패널의 비-표시 영역(NDA)에 형성될 수 있다. 게이트 구동 회로는 기판 상에 배치되거나 기판에 연결될 수 있다. 즉, 게이트 구동 회로는 GIP 타입인 경우 기판 의 비-표시 영역(NDA)에 배치될 수 있다. 게이트 구동 회로는 칩 온 글래스(COG) 타입, 칩 온 필름(COF) 타입 등인 경우 기판에 연결될 수 있다. 한편, 데이터 구동 회로 및 게이트 구동 회로 중 적어도 하나의 구동 회로는 표시 영역(DA)에 배치될 수도 있다. 예를 들어, 데이터 구동 회로 및 게이트 구동 회로 중 적어도 하나의 구동 회로는 서브 픽셀들(SP)과 중첩되지 않게 배치될 수도 있고, 서브 픽셀들(SP)과 일부 또는 전체가 중첩되게 배치될 수도 있다. 데이터 구동 회로는 디스플레이 패널의 일 측(예: 상측 또는 하측)에 연결될 수도 있다. 구동 방식, 패널 설계 방식 등에 따라, 데이터 구동 회로는 디스플레이 패널의 양 측(예: 상측과 하측)에 모두 연결되거나, 디스플레이 패널의 4 측면 중 둘 이상의 측면에 연결될 수도 있다. 게이트 구동 회로는 디스플레이 패널의 일 측(예: 좌측 또는 우측)에 연결될 수도 있다. 구동 방식, 패널 설계 방식 등에 따라, 게이트 구동 회로는 디스플레이 패널의 양 측(예: 좌측과 우측)에 모두 연결되거나, 디스플레이 패널의 4 측면 중 둘 이상의 측면에 연결될 수도 있다. 컨트롤러는, 데이터 구동 회로와 별도의 부품으로 구현될 수도 있고, 또는 데이터 구동 회로와 함께 통합되어 집적 회로로 구현될 수 있다. 컨트롤러는 통상의 디스플레이 기술에서 이용되는 타이밍 컨 트롤러(Timing Controller)이거나, 타이밍 컨트롤러를 포함하여 다른 제어 기능도 더 수행할 수 있는 제어 장치 일 수 있으며, 또는 타이밍 컨트롤러와 다른 제어 장치일 수도 있으며, 또는 제어 장치 내 회로일 수도 있다. 컨트롤러는, IC(Integrated Circuit), FPGA(Field Programmable Gate Array), ASIC(Application Specific Integrated Circuit), 또는 프로세서(Processor) 등의 다양한 회로나 전자 부품으로 구현될 수 있다. 컨트롤러는 인쇄 회로 기판, 연성 인쇄 회로 등에 실장 되고, 인쇄 회로 기판, 연성 인쇄 회로 등을 통해 데이터 구동 회로 및 게이트 구동 회로와 전기적으로 연결될 수 있다. 컨트롤러는, 미리 정해진 하나 이상의 인터페이스에 따라 데이터 구동 회로와 신호를 송수신할 수 있다. 여기서, 예를 들어, 인터페 이스는 LVDS(Low Voltage Differential Signaling) 인터페이스, EPI 인터페이스, SP(Serial Peripheral Interface) 등을 포함할 수 있다. 본 개시의 실시 예들에 따른 디스플레이 장치는 디스플레이 패널이 자체적으로 발광하는 자체 발광 디스플레이 장치일 수 있다. 본 개시의 실시 예들에 따른 디스플레이 장치가 자체 발광 디스플레이 장치인 경우, 다수의 서브 픽셀들(SP) 각각은 발광 소자를 포함할 수 있다. 예를 들어, 본 개시의 실시 예들에 따른 디 스플레이 장치는 발광 소자가 유기 발광 다이오드(OLED: Organic Light Emitting Diode)로 구현된 유기 발광 디스플레이 장치일 수 있다. 다른 예를 들어, 본 개시의 실시 예들에 따른 디스플레이 장치는 발광 소자가 무기물 기반의 발광 다이오드로 구현된 무기 발광 디스플레이 장치일 수 있다. 또 다른 예를 들어, 본 개시의 실시 예들에 따른 디스플레이 장치는 발광 소자가 스스로 빛을 내는 반도체 결정인 퀀텀 닷 (Quantum Dot)으로 구현된 퀀텀닷 디스플레이 장치일 수 있다. 도 2는 본 개시의 실시 예들에 따른 디스플레이 패널에서의 서브 픽셀(SP)의 등가 회로를 나타내고, 도 3 은 본 개시의 실시 예들에 따른 디스플레이 패널에서의 서브 픽셀(SP)의 다른 등가 회로를 나타낸다. 도 2를 참조하면, 본 개시의 실시 예들에 따른 디스플레이 장치에서, 각 서브 픽셀(SP)은 발광 소자(ED)와, 발광 소자(ED)로 흐르는 전류를 제어하여 발광 소자(ED)를 구동하는 구동 트랜지스터(DRT)와, 데이 터 전압(Vdata)을 구동 트랜지스터(DRT)의 게이트 노드인 제1 노드(N1)로 전달하는 스캔 트랜지스터(SCT)와, 일 정 기간 동안 전압 유지를 위한 스토리지 캐패시터(Cst) 등을 포함할 수 있다. 발광 소자(ED)는 픽셀 전극(PE) 및 공통 전극(CE)과, 픽셀 전극(PE) 및 공통 전극(CE) 사이에 위치하는 발광층 (EL)을 포함할 수 있다. 발광 소자(ED)의 픽셀 전극(PE)은 애노드 전극 또는 캐소드 전극일 수 있다. 공통 전극 (CE)은 캐소드 전극 또는 애노드 전극일 수 있다. 발광 소자(ED)는 일 예로, 유기 발광 다이오드(OLED), 무기물 기반의 발광 다이오드(LED), 퀀텀 닷(Quantum dot) 발광 소자 등일 수 있다. 발광 소자(ED)의 공통 전극(CE)에는 기저 전압(EVSS)이 인가될 수 있다. 여기서, 기저 전압(EVSS)은, 일 예로, 그라운드 전압이거나 그라운드 전압과 유사한 전압일 수 있다. 구동 트랜지스터(DRT)는 발광 소자(ED)를 구동하기 위한 트랜지스터로서, 제1 노드(N1), 제2 노드(N2) 및 제3 노드(N3) 등을 포함할 수 있다. 구동 트랜지스터(DRT)의 제1 노드(N1)는 게이트 노드에 해당하는 노드이고, 스캔 트랜지스터(SCT)의 소스 노드 또는 드레인 노드와 전기적으로 연결될 수 있다. 구동 트랜지스터(DRT)의 제2 노드(N2)는 소스 노드 또는 드레 인 노드이고, 발광 소자(ED)의 픽셀 전극(PE)과 전기적으로 연결될 수 있다. 구동 트랜지스터(DRT)의 제3 노드 (N3)는 드레인 노드 또는 소스 노드일 수 있고, 구동 전압(EVDD)을 공급하는 구동 전압 라인(DVL: Driving Voltage Line)과 전기적으로 연결될 수 있다. 아래에서는, 설명의 편의를 위하여, 구동 트랜지스터(DRT)의 제2 노드(N2)는 소스 노드이고, 제3노드(N3)는 드레인 노드인 것을 예로 들어 설명할 수 있다. 스캔 트랜지스터(SCT)는 데이터 라인(DL)과 구동 트랜지스터(DRT)의 제1 노드(N1) 간의 연결을 스위칭 할 수 있 다. 스캔 트랜지스터(SCT)는 게이트 라인(GL)에서 공급되는 스캔 신호(SCAN)에 응답하여, 구동 트랜지스터(DRT)의 제1 노드(N1)와 다수의 데이터 라인들(DL) 중 대응되는 데이터 라인(DL) 간의 연결을 제어할 수 있다. 스캔 트랜지스터(SCT)의 드레인 노드 또는 소스 노드는 해당 데이터 라인(DL)에 전기적으로 연결될 수 있다. 스 캔 트랜지스터(SCT)의 소스 노드 또는 드레인 노드는 구동 트랜지스터(DRT)의 제1 노드(N1)에 전기적으로 연결 될 수 있다. 스캔 트랜지스터(SCT)의 게이트 노드는 게이트 라인(GL)과 전기적으로 연결되어 스캔 신호(SCAN)를 인가 받을 수 있다. 스캔 트랜지스터(SCT)는 턴-온 레벨 전압의 스캔 신호(SCAN)에 의해 턴-온 되어, 해당 데이터 라인(DL)으로부터 공급된 데이터 전압(Vdata)을 구동 트랜지스터(DRT)의 제1 노드(N1)로 전달해줄 수 있다. 스캔 트랜지스터(SCT)는 턴-온 레벨 전압의 스캔 신호(SCAN)에 의해 턴-온 되고, 턴-오프 레벨 전압의 스캔 신 호(SCAN)에 의해 턴-오프 된다. 여기서, 스캔 트랜지스터(SCT)가 n 타입인 경우, 턴-온 레벨 전압은 하이 레벨 전압이고, 턴-오프 레벨 전압은 로우 레벨 전압일 수도 있다. 스캔 트랜지스터(SCT)가 p 타입인 경우, 턴-온 레 벨 전압은 로우 레벨 전압이고 턴-오프 레벨 전압은 하이 레벨 전압일 수도 있다. 스토리지 캐패시터(Cst)는 구동 트랜지스터(DRT)의 제1 노드(N1)와 제2 노드(N2) 사이에 전기적으로 연결되어, 영상 신호 전압에 해당하는 데이터 전압(Vdata) 또는 이에 대응되는 전압을 한 프레임 시간 동안 유지해줄 수 있다. 스토리지 캐패시터(Cst)는, 구동 트랜지스터(DRT)의 제1 노드(N1)와 제2 노드(N2) 사이에 존재하는 내부 캐패시 터(Internal Capacitor)인 기생 캐패시터(예: Cgs, Cgd)가 아니라, 구동 트랜지스터(DRT)의 외부에 의도적으로 설계한 외부 캐패시터(External Capacitor)일 수 있다. 도 2에 예시된 서브 픽셀(SP)은, 발광 소자(ED)를 구동하기 위하여, 2개의 트랜지스터(DRT, SCT)와 1개의 캐패 시터(Cst)를 갖기 때문에, 2T(Transistor)1C(Capacitor) 구조를 갖는다고 한다. 도 3을 참조하면, 본 개시의 실시 예들에 따른 디스플레이 장치에서, 각 서브 픽셀(SP)은 초기화 동작 및 센싱 동작 등을 위한 센싱 트랜지스터(SENT)를 더 포함할 수 있다. 이 경우, 도 3에 예시된 서브 픽셀(SP)은, 발광 소자(ED)를 구동하기 위하여, 3개의 트랜지스터(DRT, SCT, SENT)와 1개의 캐패시터(Cst)를 갖기 때문에, 3T(Transistor)1C(Capacitor) 구조를 갖는다고 한다. 센싱 트랜지스터(SENT)는 구동 트랜지스터(DRT)의 제2 노드(N2)와 기준 전압 라인(RVL) 간의 연결을 스위칭할 수 있다. 센싱 트랜지스터(SENT)는 센싱 신호(SENSE)에 응답하여, 발광 소자(ED)의 픽셀 전극(PE)에 전기적으로 연결된 구동 트랜지스터(DRT)의 제2 노드(N2)와 다수의 기준 전압 라인(RVL) 중 대응되는 기준 전압 라인(RVL) 간의 연 결을 제어할 수 있다. 센싱 트랜지스터(SENT)의 드레인 노드 또는 소스 노드는 기준 전압 라인(RVL)에 전기적으로 연결될 수 있다. 센 싱 트랜지스터(SENT)의 소스 노드 또는 드레인 노드는 구동 트랜지스터(DRT)의 제2 노드(N2)에 전기적으로 연결 될 수 있으며, 발광 소자(ED)의 픽셀 전극(PE)과 전기적으로 연결될 수 있다. 센싱 트랜지스터(SENT)의 게이트 노드는 센싱 신호(SENSE)를 인가 받을 수 있다. 센싱 트랜지스터(SENT)는 턴-온 되어, 기준 전압 라인(RVL)에서 공급된 기준 전압(Vref)을 구동 트랜지스터 (DRT)의 제2 노드(N2)에 인가해줄 수 있다. 센싱 트랜지스터(SENT)는 턴-온 레벨 전압의 센싱 신호(SENSE)에 의해 턴-온 되고, 턴-오프 레벨 전압의 센싱 신호(SENSE)에 의해 턴-오프 된다. 여기서, 센싱 트랜지스터(SENT)가 n 타입인 경우, 턴-온 레벨 전압은 하이 레벨 전압이고, 턴-오프 레벨 전압은 로우 레벨 전압일 수도 있다. 센싱 트랜지스터(SENT)가 p 타입인 경우, 턴 -온 레벨 전압은 로우 레벨 전압이고 턴-오프 레벨 전압은 하이 레벨 전압일 수도 있다. 구동 트랜지스터(DRT), 스캔 트랜지스터(SCT) 및 센싱 트랜지스터(SENT) 각각은 n 타입 트랜지스터이거나 p 타 입 트랜지스터일 수 있다. 구동 트랜지스터(DRT), 스캔 트랜지스터(SCT) 및 센싱 트랜지스터(SENT) 모두가 n 타 입 트랜지스터이거나 p 타입 트랜지스터일 수 있다. 구동 트랜지스터(DRT), 스캔 트랜지스터(SCT) 및 센싱 트랜지스터(SENT) 중 적어도 하나는 n 타입 트랜지스터(또는 p 타입 트랜지스터)이고 나머지는 p 타입 트랜지스터 (또는 n 타입 트랜지스터)일 수 있다. 스캔 트랜지스터(SCT) 및 센싱 트랜지스터(SENT) 각각의 게이트 노드는 동일한 하나의 게이트 라인(GL)에 연결 될 수 있다. 이와 다르게, 스캔 트랜지스터(SCT) 및 센싱 트랜지스터(SENT) 각각의 게이트 노드는 서로 다른 게 이트 라인(GL)에 연결될 수도 있다. 기준 전압 라인(RVL)은 하나의 서브 픽셀 열마다 배치될 수 있다. 이와 다르게, 기준 전압 라인(RVL)은 둘 이상 의 서브 픽셀 열마다 배치될 수도 있다. 기준 전압 라인(RVL)이 둘 이상의 서브 픽셀 열마다 배치되는 경우, 복 수의 서브 픽셀(SP)은 하나의 기준 전압 라인(RVL)으로부터 기준 전압(Vref)을 공급받을 수 있다. 예를 들어, 기준 전압 라인(RVL)은 4개의 서브 픽셀 열마다 1개씩 배치될 수 있다. 즉, 하나의 기준 전압 라인(RVL)은 4개 의 서브 픽셀 열에 포함된 서브 픽셀들(SP)이 공유할 수 있다. 구동 전압 라인(DVL)은 하나의 서브 픽셀 열마다 배치될 수 있다. 이와 다르게, 구동 전압 라인(DVL)은 둘 이상 의 서브 픽셀 열마다 배치될 수도 있다 구동 전압 라인(DVL)이 둘 이상의 서브 픽셀 열마다 배치되는 경우, 복 수의 서브 픽셀(SP)은 하나의 구동 전압 라인(DVL)으로부터 구동 전압(EVDD)을 공급받을 수 있다. 예를 들어, 구동 전압 라인(DVL)은 4개의 서브 픽셀 열마다 1개씩 배치될 수 있다. 즉, 하나의 구동 전압 라인(DVL)은 4개 의 서브 픽셀 열에 포함된 서브 픽셀들(SP)이 공유할 수 있다. 도 3에 예시된 서브 픽셀(SP)의 3T1C 구조는, 설명을 위한 예시일 뿐, 1개 이상의 트랜지스터를 더 포함하거나, 경우에 따라서는, 1개 이상의 캐패시터를 더 포함할 수도 있다. 또는, 다수의 서브 픽셀들 각각이 동일한 구조 로 되어 있을 수도 있고, 다수의 서브 픽셀들 중 일부는 다른 구조로 되어 있을 수도 있다. 한편, 본 개시의 실시 예들에 따른 디스플레이 장치는 상부 발광(Top Emission) 구조를 갖거나, 하부 발광 (Bottom Emission) 구조를 가질 수도 있다. 한편, 본 개시의 실시 예들에 따른 디스플레이 장치가 유기 발광 디스플레이 장치 등과 같은 자체 발광 디 스플레이 장치인 경우, 공정 상의 다양한 원인에 의해 실제로 원하는 광학 특성(예: 휘도, 색좌표)과 다른 광학 특성을 가질 수 있고, 이로 인해, 원하는 화상의 색좌표 또는 휘도와 다른 색좌표 또는 휘도를 가질 수 있다. 이에, 본 개시의 실시예들은, 디스플레이 패널의 광학 특성(예: 휘도 등)에 최적화 된 데이터 전압을 예측 하여 디스플레이 구동을 수행할 수도 있도록 해주는 인공 지능 기반의 광학 보상 시스템 및 광학 보상 방법과, 이러한 인공 지능 기반의 광학 보상이 적용된 디스플레이 장치를 제공할 수 있다. 아래에서는, 디스플레이 패널의 광학 특성(예: 휘도, 색좌표 등)을 고려하여, 보다 정확하고 더욱 빠른 광 학 보상 기술로서 인공 지능 기반의 광학 보상 시스템 및 광학 보상 방법과, 인공 지능 기반의 광학 보상이 적 용된 디스플레이 장치에 대하여 더욱 상세하게 설명한다. 도 4는 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템을 나타낸다. 도 4를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 인공 지능을 이용하 여 광학 보상을 수행하는 시스템으로서, 측정기 및 인공 지능 기반 광학 보상 제어기를 포함할 수 있 다. 측정기는 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 출력할 수 있다. 예를 들어, 측정기는 휘도계 등을 포함할 수 있다. 인공 지능 기반 광학 보상 제어기는 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데 이터를 이용하여 인공 지능 신경망을 토대로 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성할 수 있다. 인공 지능 기반 광학 보상 제어기는 인공 지능 기반의 광학 보상이 이미 완료된 샘플인 적어도 하나의 다 른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 전체적으로 모두 이용하여 인공 지능 신경망 (Artificial intelligence neural network)을 이용하여 현재의 광학 보상 결과 데이터를 예측할 수 있다. 인공 지능 기반 광학 보상 제어기는 인공 지능을 활용하여 예측하여 생성된 광학 보상 결과 데이터를 디스 플레이 패널에 대응되는 메모리에 저장시킬 수 있다. 예를 들어, 인공 지능 기반 광학 보상 제어기에 의해 예측되어 생성된 광학 보상 결과 데이터는, 원하는 타깃 별로 예측된 데이터 전압에 대한 정보를 포함할 수 있다. 예를 들어, 원하는 타깃은 원하는 밴드, 휘도, 또는 색 좌표를 포함할 수 있다. 여기서, 밴드는 휘도 모드(밝기 모드)라고도 하며, 디스플레이 패널은 여러 가지의 밴드 중 하나로 휘도(밝기)가 제어될 수 있다. 예를 들어, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터는, 적어도 하나의 다른 디 스플레이 패널에 대하여 완료된 이전 광학 보상 프로세스의 진행 결과를 통해 얻어진 데이터로서, 데이터 전압 및 감마 전압 등의 정보를 포함할 수 있다. 인공 지능 기반 광학 보상 제어기는, 인공 지능 기반의 광학 보상이 이미 완료된 샘플인 적어도 하나의 다 른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 머신 러닝(ML: Machine Learning)을 진행하 여 머신 러닝 결과 데이터를 생성할 수 있다. 인공 지능 기반 광학 보상 제어기는, 머신 러닝 결과 데이터와 광학 특성 측정 결과 데이터를 이용하여, 인공 지능 신경망을 토대로 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성할 수 있다. 인공 지능 기반 광학 보상 제어기는, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데 이터를 이용하여 빅데이터(Big data)인 로그 파일(Log file)을 수집하는 로그 파일 수집 프로세스를 실행하고, 수집된 로그 파일에서 머신 러닝 용도의 학습 데이터를 선별하는 데이터 가공 프로세스를 실행하고, 선별된 학 습 데이터를 토대로 머신 러닝을 진행하여 머신 러닝 결과 데이터를 생성할 수 있다. 인공 지능 기반 광학 보상 제어기는, 측정기를 통해 광학 특성 측정 결과 데이터를 얻기 위한 디스플 레이 패널의 광학 특성을 측정(메인 측정)하기 전에, 측정기를 통해 디스플레이 패널의 광학 특 성을 1차적으로 측정하도록 제어하여 구동 전압을 최적화하여 설정하는 전처리를 수행할 수 있다. 구동 전압은 측정기를 통해 디스플레이 패널의 광학 특성을 측정(메인 측정)할 때, 디스플레이 패널 의 구동 시 이용되는 전압일 수 있다. 예를 들어, 구동 전압은 디스플레이 패널에 포함된 서브 픽셀(SP)로 공급되는 기저 전압(EVSS) 또는 블랙 데이터 전압을 포함하거나, 디스플레이 패널 내 영역 별 휘도 가중치 등을 포함할 수 있다. 도 5는 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법에 대한 흐름도이다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 인공 지능 기반의 광 학 보상 방법을 수행할 수 있다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 메인 측정 단계(S520), 인 공 지능 프로세스 실행 단계(S560), 데이터 전압 예측 단계(S570), 및 예측 정보 저장 단계(S590) 등을 포함할 수 있다. 메인 측정 단계(S520)에서, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기 는 측정기를 통해 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 생성할 수 있다. 인공 지능 프로세스 실행 단계(S560)에서, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보 상 제어기는 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 인공 지 능 신경망을 토대로 인공 지능 프로세스를 실행할 수 있다. 데이터 전압 예측 단계(S570)에서, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어 기는 인공 지능 프로세스의 실행 결과, 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터로 서 밴드 별 또는 계조 별 데이터 전압을 예측하여 생성할 수 있다. 예측 정보 저장 단계(S590)에서, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기 는 데이터 전압 예측 단계(S570)에서 예측하여 생성된 데이터 전압에 대한 정보를 디스플레이 패널에 대응되는 메모리에 저장시킬 수 있다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 인공 지능 프로세스를 실행 하는 단계(S560) 이전에, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기가 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 머신 러닝을 진행하여 머신 러닝 결과 데이터를 생성하는 머신 러닝 진행 단계(S550)를 더 포함할 수 있다. 인공 지능 프로세스를 실행하는 단계(S560)에서, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광 학 보상 제어기는 머신 러닝 결과 데이터와 광학 특성 측정 결과 데이터를 토대로 광학 특성 측정 결과 데 이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성할 수 있다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 머신 러닝 진행 단계(S550) 이전에, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기가 적어도 하나의 다 른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 빅데이터인 로그 파일을 수집하는 로그 파 일 수집 단계(S540)를 더 포함할 수 있다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 로그 파일 수집 단계(S540) 이후, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기가 수집된 로그 파일에 서 머신 러닝 용도의 학습 데이터를 선별하는 데이터 가공 단계(S530)를 더 포함할 수 있다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 광학 특성 측정 결과 데이 터를 생성하는 단계(S520)이전에, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기 가 측정기를 통해 디스플레이 패널의 광학 특성을 1차적으로 측정하도록 제어하여 구동 전압을 설정하는 전 처리 단계(S510)를 더 포함할 수 있다. 도 5를 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 데이터 전압을 예측하여 생 성하는 단계(S570) 이후, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기가 밴드 및 포인트를 변경하는 루프 제어 단계(S580)를 더 포함할 수 있다. 루프 제어 단계(S580) 이후, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기(42 0)는, 광학 특성 측정 결과 데이터를 생성하는 단계(S520), 인공 지능 프로세스를 실행하는 단계(S560), 및 데 이터 전압을 예측하여 생성하는 단계(S570)가 반복 실행될 수 있다. 도 6은 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상을 위한 인공 지능 신경망으로서 아핀층 신경망 (Affine Layer Neural Network, 600)을 나타낸다. 도 6을 참조하면, 예를 들어, 인공 지능 기반의 광학 보상을 위한 인공 지능 신경망은 아핀층 신경망일 수 있다. 도 6을 참조하면, 아핀층 신경망은, 제1 전처리의 처리 정보와 대응되는 다수의 입력 노드(R, G, B)를 포 함하는 입력층(Lin), 제2 전처리의 처리 정보와 대응되는 다수의 제1 중간 노드(R1, G1, B1)를 포함하는 제1 중 간층(Lm1), 제3 전처리의 처리 정보와 대응되는 다수의 제2 중간 노드(R2, G2, B2)를 포함하는 제2 중간층 (Lm2), 및 메인 처리의 처리 정보와 대응되는 다수의 출력 노드(R3, G3, B3)를 포함하는 출력층(Lout)을 포함할 수 있다. 다수의 입력 노드(R, G, B)는 다수의 제1 중간 노드(R1, G1, B1)의 전체 또는 일부와 연결되고, 다수의 제1 중 간 노드(R1, G1, B1)는 다수의 제2 중간 노드(R2, G2, B2)의 전체 또는 일부와 연결되고, 다수의 제2 중간 노드 (R2, G2, B2)는 다수의 출력 노드(R3, G3, B3)의 전체 또는 일부와 연결될 수 있다. 예를 들어, 다수의 입력 노 드(R, G, B), 다수의 제1 중간 노드(R1, G1, B1), 다수의 제2 중간 노드(R2, G2, B2), 및 다수의 출력 노드 (R3, G3, B3)는 적색 영상 신호(적색 데이터), 녹색 영상 신호(녹색 데이터), 및 청색 영상 신호(청색 데이터) 와 대응될 수 있다. 도 6을 참조하면, 아핀층 신경망과 관련하여, 제1 전처리는 색 좌표 또는 휘도 별 사전 광학 보상 처리일 수 있고, 제2 전처리는 제1 휘도 값을 이용한 색상 별 사전 광학 보상 처리일 수 있고, 제3 전처리는 제1 휘도 값보다 높은 제2 휘도 값을 이용한 색상 별 사전 광학 보상 처리일 수 있으며, 메인 처리는 광학 특성 측정 결 과 데이터를 얻기 위한 처리일 수 있다. 또는, 아핀층 신경망과 관련하여, 메인 처리는 광학 보상 처리에 해당하고, 메인 처리의 처리 정보는 광학 보상 결과 데이터에 해당할 수 있다. 제2 전처리 및 제3 전처리는 광학 보상 처리와 거의 동일한 처리일 수 있 으며, 광학 보상 처리 이전에 수행되는 사전 광학 보상 처리일 수 있다. 제2 전처리 및/또는 제3 전처리를 통해 구동 전압의 최적화가 수행될 수도 있다. 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기는, 예측하여 생성된 광학 보 상 결과 데이터를 토대로 인공 지능 신경망을 업데이트할 수 있다. 도 7은 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상을 위한 머신 러닝을 나타낸다. 도 7을 참조하면, 인공 지능 기반의 광학 보상 시스템의 인공 지능 기반 광학 보상 제어기는, 미리 정해진 개수인 N개의 로그에 대한 로그 파일을 실시간으로 업데이트 하면서 저장 관리하고(S700), N개의 로그에 대한 로그 파일을 이용하여 머신 러닝을 수행할 수 있다(S710). 여기서, 로그 파일의 실시간 업데이트 저장 관 리는 도 5의 인공 지능 기반의 광학 보상 프로세스에서의 S530 단계 및 S540 단계와 대응될 수 있다. 머신 러닝 은 도 5의 인공 지능 기반의 광학 보상 프로세스에서의 S550 단계와 대응될 수 있다. 도 7을 참조하면, 인공 지능 기반 광학 보상 제어기는 머신 러닝을 수행한 결과에 따라 얻어진 머신 러닝 결과 데이터를 이용하여, 새로운 디스플레이 패널에 대한 인공 지능 기반의 광학 보상을 진행할 수 있다(S720). 여기서, 인공 지능 기반의 광학 보상은 도 5의 인공 지능 기반의 광학 보상 프로세스에서의 S560 단계 및 S570 단계와 대응될 수 있다. 도 7을 참조하면, 인공 지능 기반 광학 보상 제어기는 새로운 디스플레이 패널에 대한 인공 지능에 기반한 광학 보상이 완료되면, 머신 러닝(ML)을 진행하라는 커맨드(CMD_ML)을 발생시킬 수 있다. 또한, 인공 지능 기반 광학 보상 제어기는 새로운 디스플레이 패널에 대한 인공 지능에 기반한 광학 보상 이 완료되면, 새로운 디스플레이 패널에 대한 인공 지능에 기반한 광학 보상 결과 데이터를 새로운 로그(Log)로 저장하여, 로그 파일을 실시간으로 업데이트 할 수 있다. 이에 따라, 인공 지능 기반 광학 보상 제어기는 새로운 로그로 저장된 광학 보상 결과 데이터를 이전 광학 보상 결과 데이터로 업데이트 저장하고, 가장 오래된 이전 광학 보상 결과 데이터에 대한 로그를 삭제하여, 미리 정해진 개수 N개의 로그에 대한 로그 파일을 관리할 수 있다(S700). 이때, 예를 들어, N개의 로그에 대한 로그 파일의 유지 관리는, 퍼스트 인 퍼스트 아웃(First In First Out) 방식으로 이루어질 수 있다. 도 7을 참조하면, 인공 지능 기반 광학 보상 제어기는 머신 러닝(ML)을 진행하라는 커맨드(CMD_ML)에 따라, 실시간 업데이트 된 로그 파일을 이용하여 머신 러닝을 다시 수행할 수 있다(S710). 도 8은 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상이 적용된 디스플레이 장치의 개략도이다. 도 8을 참조하면, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상이 적용된 디스플레이 장치는, 데이터 라인(DL)을 포함하는 디스플레이 패널, 밴드 별 또는 계조 별 데이터 전압에 대한 정보를 저장하는 메모리, 및 메모리에 저장된 밴드 별 또는 계조 별 데이터 전압 중 디스플레이 구동 정보(예: 현재 밴드 또는 현재 계조)에 대응되는 데이터 전압을 데이터 라인으로 출력하는 데이터 구동 회로를 포함할 수 있다. 컨트롤러는 메모리에 저장된 밴드 별 또는 계조 별 데이터 전압을 참조하여, 디스플레이 구동 정보 (예: 현재 밴드 또는 현재 계조)에 대응되는 데이터 전압을 선택하고, 선택된 데이터 전압에 대응되는 데이터를 데이터 구동 회로에 공급할 수 있다. 예를 들어, 메모리에 저장된 밴드 별 또는 계조 별 데이터 전압에 대한 정보는, 인공 지능 신경망에 기초 한 인공 지능 프로세스의 실행 결과에 따라 디스플레이 패널의 광학 특성 측정 결과 데이터에 대응되는 광 학 보상 결과 데이터로서 예측되어 메모리에 저장된 정보일 수 있다. 예를 들어, 메모리에 저장되며 인공 지능 기반의 광학 보상에 따라 예측된 광학 보상 결과 데이터는 원하 는 타깃 별로 예측된 데이터 전압에 대한 정보를 포함할 수 있다. 여기서, 예를 들어, 원하는 타깃은 원하는 밴 드, 휘도, 또는 색 좌표를 포함할 수 있다. 예를 들어, 메모리에 저장되며 인공 지능 기반의 광학 보상에 따라 예측된 광학 보상 결과 데이터는 감마 전압 등 의 정보를 더 포함할 수 있다. 이상에서 전술한 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상은, OLED 디스플레이와 같은 자체 발 광 디스플레이의 광학 특성을 고려하여, 각 개체(디스플레이 패널) 별로 동일한 색 좌표와 휘도를 구현하기 위 해 진행되는 공정 프로세스이다. 적색 서브 픽셀, 녹색 서브 픽셀, 및 청색 서브 픽셀 각각이 발광하는 정도가 모든 개체(디스플레이 패널)마다 다르기 때문에, 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상을 적용하게 되면, OLED 디스플레이와 같은 자체 발광 디스플레이의 화상 품질을 크게 향상시켜줄 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 기술에 의하면, 광학 보상에 사용되는 머신 러닝을 위 한 학습 데이터를 공정 라인에서 자동으로 업데이트 할 수 있다. 이에 따라, 광학 보상을 즉각적으로 수행하여 디스플레이 패널들마다의 특성과 조건 변화 등에 능동적인 대응이 가능해질 수 있고, 광학 보상 처리 시간도 대 폭적으로 줄일 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 아핀층 신경망 등과 같은 인공 지 능 신경망을 이용할 수 있다. 아핀층 신경망의 구조는 아핀층 신경망에 포함된 모든 노드들이 후속 계층의 모든 노드들에 연결되는 구조로 되어 있다. 예를 들어, 제2 중간층(Lm2)의 제2 중간 노드와 관점에서, 입력층(Lin)의 입력 노드들과 제1 중간층(Lm1)의 제1 중간 노드들이 이전 계층의 모든 노드들이고, 출력층 (Lout)의 출력 노드들이 후속 계층의 모든 노들이다. 아핀층 신경망의 구조는 이전 계층의 광학보상 결과 노드들이 후속 계층의 모든 노드들에 연결이 되어 있 어서, 다중 포인트들로부터 현재 원하는 포인트의 결과를 예측할 수 있다 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 이전 광학 보상 프로세스의 결과들(이 전 광학 보상 결과 데이터)을 이용하여 후속 광학 보상 프로세스의 결과(광학 보상 결과 데이터)를 예측할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 아핀층 신경망 구조와 같은 인공 지능 신경망을 사용하기 때문에, 이전의 샘플들(다른 디스플레이 패널들)에 대한 이전 광학 보상 프로세스의 이 전 광학 보상 결과 데이터 전부(예: 색좌표, 휘도, 데이터 전압(Vdata), 기저 전압(EVSS) 등)와 이전 광학 보상 포인트들(계조들)의 모든 결과 데이터(예: 데이터 전압(Vdata) 등)를 이용하여, 현재 광학 보상 포인트(예: 계 조)의 결과값(광학 보상 결과 데이터)을 예측할 수 있다. 예를 들어, 광학 보상 결과 데이터는 데이터 전압 등 을 포함할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 머신 러닝을 수행하기 위해서, 사전에 빅 데이터(Bigdata)로 학습하는 과정을 수행할 수 있으며, 이를 위해, 학습 데이터를 실시간으로 자동 업데이트 할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템은 매 광학 보상 완료 시점에 자동적으로 로그 파일을 수집하여 머신 러닝 학습을 진행할 수 있다. 이상에서 설명한 본 개시의 실시 예들을 간략하게 설명하면 아래와 같다. 본 개시의 실시 예들은, 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 출력하는 측정 기, 및 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여, 인공 지능 신경망 을 토대로 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성하고, 예측하여 생성 된 광학 보상 결과 데이터를 디스플레이 패널에 대응되는 메모리에 저장시키는 인공 지능 기반 광학 보상 제어 기를 포함하는 인공 지능 기반의 광학 보상 시스템을 제공할 수 있다. 예측하여 생성된 광학 보상 결과 데이터는, 원하는 타깃 별로 예측된 데이터 전압에 대한 정보를 포함할 수 있 다. 원하는 타깃은 원하는 밴드, 휘도, 또는 색 좌표를 포함할 수 있다. 예측하여 생성된 광학 보상 결과 데이터는, 감마 전압 등의 정보를 더 포함할 수 있다. 인공 지능 신경망은 아핀층 신경망일 수 있다. 아핀층 신경망은, 제1 전처리의 처리 정보와 대응되는 다수의 입력 노드를 포함하는 입력층, 제2 전처리의 처리 정보와 대응되는 다수의 제1 중간 노드를 포함하는 제1 중간층, 제3 전처리의 처리 정보와 대응되는 다수의 제2 중간 노드를 포함하는 제2 중간층, 및 메인 처리의 처리 정보와 대응되는 다수의 출력 노드를 포함하는 출력층 을 포함할 수 있다. 다수의 입력 노드는 다수의 제1 중간 노드의 전체와 연결되고, 다수의 제1 중간 노드는 다수의 제2 중간 노드의 전체와 연결되고, 다수의 제2 중간 노드는 다수의 출력 노드의 전체와 연결될 수 있다. 제1 전처리는 색 좌표 또는 휘도 별 사전 광학 보상 처리이고, 제2 전처리는 제1 휘도 값을 이용한 색상 별 사 전 광학 보상 처리이고, 제3 전처리는 제1 휘도 값보다 높은 제2 휘도 값을 이용한 색상 별 사전 광학 보상 처리이고, 메인 처리는 광학 특성 측정 결과 데이터를 얻기 위한 처리일 수 있다. 인공 지능 기반 광학 보상 제어기는, 예측하여 생성된 광학 보상 결과 데이터를 토대로 인공 지능 신경망을 업 데이트 할 수 있다. 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터는, 적어도 하나의 다른 디스플레이 패 널에 대하여 완료된 이전 광학 보상 프로세스의 진행 결과를 통해 얻어진 데이터로서, 데이터 전압 및 감마 전 압 등의 정보를 포함할 수 있다. 인공 지능 기반 광학 보상 제어기는, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터 를 이용하여 머신 러닝을 진행하여 머신 러닝 결과 데이터를 생성하고, 머신 러닝 결과 데이터와 광학 특성 측 정 결과 데이터를 이용하여 인공 신경망을 토대로 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이 터를 예측하여 생성할 수 있다. 인공 지능 기반 광학 보상 제어기는, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터 를 이용하여 빅데이터인 로그 파일을 수집하는 로그 파일 수집 프로세스를 실행하고, 수집된 로그 파일에서 머 신 러닝 용도의 학습 데이터를 선별하는 데이터 가공 프로세스를 실행하고, 선별된 학습 데이터를 토대로 머신 러닝을 진행하여 머신 러닝 결과 데이터를 생성할 수 있다. 인공 지능 기반 광학 보상 제어기는, 측정기를 통해 광학 특성 측정 결과 데이터를 얻기 위한 디스플레이 패널 의 광학 특성을 측정하기 전에, 측정기를 통해 디스플레이 패널의 광학 특성을 1차적으로 측정하도록 제어하여 구동 전압을 설정하는 전 처리를 수행할 수 있다. 구동 전압은 디스플레이 패널에 포함된 서브 픽셀로 공급되는 기저 전압 또는 블랙 데이터 전압을 포함하거나 영역 별 휘도 가중치를 포함할 수 있다. 본 개시의 실시 예들은 측정기를 통해 디스플레이 패널의 광학 특성을 측정하여 광학 특성 측정 결과 데이터를 생성하는 단계, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 인공 지능 신경망을 토대로 인공 지능 프로세스를 실행하는 단계, 인공 지능 프로세스의 실행 결과, 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터로서 밴드 별 또는 계조 별 데이터 전압을 예측하여 생성하는 단계, 및 예측하여 생성된 데이터 전압에 대한 정보를 디스플레이 패널에 대응되는 메모리에 저장시키는 단계를 포함 하는 인공 지능 기반의 광학 보상 방법을 제공할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 인공 지능 프로세스를 실행하는 단계 이전에, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 머신 러닝을 진행하여 머 신 러닝 결과 데이터를 생성하는 머신 러닝 진행 단계를 더 포함할 수 있다. 인공 지능 프로세스를 실행하는 단계에서는, 머신 러닝 결과 데이터와 광학 특성 측정 결과 데이터를 토대로 광 학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터를 예측하여 생성할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 머신 러닝 진행 단계 이전에, 적어도 하나의 다른 디스플레이 패널에 대한 이전 광학 보상 결과 데이터를 이용하여 빅데이터인 로그 파일을 수집하는 로그 파일 수집 단계; 및 수집된 로그 파일에서 머신 러닝 용도의 학습 데이터를 선별하는 데이터 가공 단계를 더 포 함할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 광학 특성 측정 결과 데이터를 생성하는 단계 이전에, 측정기를 통해 디스플레이 패널의 광학 특성을 1차적으로 측정하도록 제어하여 구동 전압을 설정하는 전 처리 단계를 더 포함할 수 있다. 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법은, 데이터 전압을 예측하여 생성하는 단계 이후, 밴드 및 포인트를 변경하는 루프 제어 단계를 더 포함할 수 있다. 루프 제어 단계 이후, 광학 특성 측정 결과 데이터를 생성하는 단계, 인공 지능 프로세스를 실행하는 단계, 및 데이터 전압을 예측하여 생성하는 단계가 반복 실행될 수 있다. 본 개시의 실시 예들은, 데이터 라인을 포함하는 디스플레이 패널, 밴드 별 또는 계조 별 데이터 전압에 대한 정보를 저장하는 메모리, 및 밴드 별 또는 계조 별 데이터 전압 중에서 현재 밴드 또는 현재 계조에 대응되는 데이터 전압을 데이터 라인으로 출력하는 데이터 구동 회로를 포함하는 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들에 따른 디스플레이 장치에서, 메모리에 저장된 밴드 별 또는 계조 별 데이터 전압에 대한 정보는, 인공 지능 신경망에 기초한 인공 지능 프로세스의 실행 결과에 따라 디스플레이 패널의 광학 특성 측정 결과 데이터에 대응되는 광학 보상 결과 데이터로서 예측되어 메모리에 저장된 정보일 수 있다. 본 개시의 실시 예들에 따른 디스플레이 장치에서, 예측된 광학 보상 결과 데이터는 원하는 타깃 별로 예측된 데이터 전압에 대한 정보를 포함할 수 있다. 본 개시의 실시 예들에 따른 디스플레이 장치에서, 원하는 타깃은 원하는 밴드, 휘도, 또는 색 좌표를 포함하고, 예측하여 생성된 광학 보상 결과 데이터는 감마 전압 등의 정보를 더 포함할 수 있다. 이상에서 전술한 본 개시의 실시 예들에 의하면, 정확하고 빠른 광학 보상 기술로서 인공 지능 기반의 광학 보 상 시스템, 광학 보상 방법, 및 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들에 의하면, 디스플레이 패널의 광학 특성에 최적화 된 데이터 전압을 예측하여 디스플레이 구동을 수행할 수도 있도록 해주는 인공 지능 기반의 광학 보상 시스템, 광학 보상 방법, 및 디스플레이 장치를 제공할 수 있다. 본 개시의 실시 예들에 의하면, 디스플레이 패널들마다의 특성과 조건 변화 등에 능동적이고 신속한 대응이 가 능한 인공 지능 기반의 광학 보상 시스템 및 광학 보상 방법과, 인공 지능 기반의 광학 보상이 적용된 디스플레 이 장치를 제공할 수 있다. 이상의 설명은 본 개시의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 개시가 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 개시의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 또한, 본 개시에 개시된 실시 예들은 본 개시의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이므로 이러한 실시 예들에 의하여 본 개시의 기술 사상의 범위가 한정되는 것은 아니다. 본 개시의 보 호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 개시 의 권리 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0170715", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시 예들에 따른 디스플레이 장치의 시스템 구성도이다. 도 2는 본 개시의 실시 예들에 따른 디스플레이 패널에서의 서브 픽셀에 대한 등가 회로이다. 도 3은 본 개시의 실시 예들에 따른 디스플레이 패널에서의 서브 픽셀에 대한 다른 등가 회로이다. 도 4는 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 시스템을 나타낸다. 도 5는 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상 방법에 대한 흐름도이다. 도 6은 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상을 위한 아핀층 신경망을 나타낸다. 도 7은 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상을 위한 머신 러닝을 나타낸다. 도 8은 본 개시의 실시 예들에 따른 인공 지능 기반의 광학 보상이 적용된 디스플레이 장치의 개략도이다."}
