{"patent_id": "10-2022-0115317", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0036817", "출원번호": "10-2022-0115317", "발명의 명칭": "돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램", "출원인": "주식회사 케이티", "발명자": "김민철"}}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "돌발 상황 탐지 시스템이, 도로에 대한 제1 영상에서 전경을 분리하여 하나 이상의 돌발 상황 객체 후보를 검출하는 단계; 상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안의 움직임을 추적하는 단계; 및상기 움직임이 미리 정해진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하는 단계;를 포함하는 것을 특징으로 하는 돌발 상황 탐지 방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 검출하는 단계는,미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리하는 단계; 및상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보를 산출하는 단계;를 포함하는 것을 특징으로 하는 돌발 상황 탐지 방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 전경을 분리하는 단계에서는,상기 배경 영상과 상기 제1 영상의 차분을 이용하여 상기 전경을 분리하는 것을 특징으로 하는 돌발 상황 탐지방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 전경을 분리하는 단계에서는,상기 배경 영상은 상기 제1 영상으로부터 생성되어 주기적으로 갱신되는 것을 특징으로 하는 돌발 상황 탐지 방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 배경 영상은 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 생성되는 것을 특징으로 하는 돌발 상황 탐지 방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 배경 영상은 상기 제1 영상에서 움직임이 없는 하나 이상의 영상 구간을 식별하고 이를 기초로 생성되는것을 특징으로 하는 돌발 상황 탐지 방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2024-0036817-3-제2항에 있어서,상기 산출하는 단계에서는,상기 전경에 포함되는 객체 중 미리 정해진 종류의 정형 객체를 제외하는 것을 특징으로 하는 돌발 상황 탐지방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,상기 산출하는 단계는,상기 분리된 전경에 포함되는 객체의 영역에 대한 제1 특징값과 상기 하나 이상의 객체에 대응하는 상기 배경영상의 영역에 대한 제2 특징값을 추출하는 단계; 및상기 제1 특징값과 상기 제2 특징값에 대하여 산출되는 매칭 스코어가 미리 정해진 기준을 충족하는 객체를 상기 돌발 상황 객체 후보로 산출하는 단계;를 포함하는 것을 특징으로 하는 돌발 상황 탐지 방법."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "컴퓨터에서 제1항 내지 제8항 중 어느 한 항에 기재된 돌발 상황 탐지 방법의 각 단계를 실행시키기 위한 컴퓨터로 판독 가능한 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "도로에 대한 제1 영상에서 전경을 분리하여 하나 이상의 돌발 상황 객체 후보를 검출하는 돌발 상황 객체 후보검출부;상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안의 움직임을 추적하는 움직임 추적부;및상기 움직임이 미리 정해진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하는 돌발 상황 객체 판별부;를 포함하는 것을 특징으로 하는 돌발 상황 탐지 시스템."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 돌발 상황 객체 후보 검출부는,미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리하는 전경 분리부; 및상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보를 산출하는 객체 후보 산출부;를 포함하는 것을 특징으로하는 돌발 상황 탐지 시스템."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 전경 분리부에서,상기 배경 영상은 상기 제1 영상으로부터 생성되어 주기적으로 갱신되는 것을 특징으로 하는 돌발 상황 탐지 시스템."}
{"patent_id": "10-2022-0115317", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 전경 분리부에서,상기 배경 영상은 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 생성되는 것을 특징으로 하는 돌발 상황 탐지 시스템.공개특허 10-2024-0036817-4-"}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에 관한 것으로서, 보다 구체적으로는 교통 영 상에서 낙하물 발생 등의 돌발 상황을 효과적으로 탐지할 수 있는 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에 관한 것이다. 본 발명에서는, 돌발 상황 탐지 시스템이, 도로에 대한 제1 영상에서 전경을 분리하여 하나 이상의 돌발 상황 객 체 후보를 검출하는 단계; 상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안의 움직임을 추적하는 단계; 및 상기 움직임이 미리 정해진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하는 단계;를 포함하는 것을 특징으로 하는 돌발 상황 탐지 방법을 개시한다."}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에 관한 것으로서, 보다 구체적으로는 교통 영상에서 낙하물 발생 등의 돌발 상황을 효과적으로 탐지할 수 있는 돌발 상황 탐지 방법, 장치, 시스템 및 컴 퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래 ITS(Intelligent Transport System)와 관련한 기술 및 서비스가 빠르게 확산하고 있으며, 이를 위하여, 도로 등을 촬영하는 교통 카메라 등을 이용하여 각 도로의 교통량 등의 정보를 측정하거나 차량의 과속 등을 탐 지하는 기술도 폭넓게 활용되고 있다. 뿐만 아니라, 최근에는 도로에서 차량의 역주행 또는 불법 유턴, 차도 등 위험 영역을 보행하는 보행자, 도로 등의 낙하물 등과 같이 도로 상의 돌발 상황을 탐지하는 기술도 시도되고 있다. 보다 구체적으로, 도로 상에서의 돌발 상황을 탐지하기 위한 기술을 나누어 보면, 라이다 또는 레이더 등의 센 서를 사용하는 센서식 돌발 상황 검지 기술과 카메라 영상에 대한 분석을 기반으로 돌발 상황을 탐지하는 영상 식 돌발 상황 검지 기술 등을 들 수 있다. 이때, 상기 센서식 돌발 상황 검지 기술의 경우 구축 비용이 많이 소 요될 뿐만 아니라 눈이나 비 등 날씨의 영향을 많이 받을 수 있으며, 통상 객체의 크기 정보를 이용해 객체의 종류를 판단하게 되므로 쉽게 오류가 발생할 수 있다는 문제가 따른다. 이에 대하여, 영상식 돌발 상황 검지 기술의 경우, 미리 정해진 차량, 사람 등 이외에 다양한 형상을 가지는 비 정형 객체가 도로 상에 방치되는 등의 경우 이를 효과적으로 식별하여 검출하기 어렵다는 제약이 따르게 된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2019-0097337호(2019년 8월 21일 공개)"}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 문제점을 해결하기 위해 창안된 것으로, 도로를 촬영하는 영상을 분석하여 낙하물이 도로 상에 방치되는 경우와 같은 돌발 상황에 대해서도 이를 효과적으로 탐지할 수 있는 돌발 상황 탐 지 방법, 장치, 시스템 및 컴퓨터 프로그램을 제공하는 것을 목적으로 한다. 특히, 본 발명에서는 미리 정해지지 않은 비정형의 물체가 도로상에 낙하하여 방치되는 등의 경우에도 낙하물로 서 정확히 탐지할 수 있는 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램을 제공하는 것을 목적으로 한다. 그 외 본 발명의 세부적인 목적은 아래에 기재되는 구체적인 내용을 통하여 이 기술 분야의 전문가나 연구자에 게 자명하게 파악되고 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 본 발명의 한 측면에 따른 돌발 상황 탐지 방법은, 돌발 상황 탐지 시스템이, 도로 에 대한 제1 영상에서 전경을 분리하여 하나 이상의 돌발 상황 객체 후보를 검출하는 단계; 상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안의 움직임을 추적하는 단계; 및 상기 움직임이 미리 정해 진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하는 단 계;를 포함하는 것을 특징으로 한다. 여기서, 상기 검출하는 단계는, 미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리하는 단계; 및 상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보를 산출하는 단계;를 포함할 수 있 다. 이때, 상기 전경을 분리하는 단계에서는, 상기 배경 영상과 상기 제1 영상의 차분을 이용하여 상기 전경을 분리 할 수 있다. 또한, 상기 전경을 분리하는 단계에서는, 상기 배경 영상은 상기 제1 영상으로부터 생성되어 주기적으로 갱신될 수 있다. 나아가, 상기 배경 영상은 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 생성될 수 있다. 또한, 상기 배경 영상은 상기 제1 영상에서 움직임이 없는 하나 이상의 영상 구간을 식별하고 이를 기초로 생성 될 수 있다. 또한, 상기 산출하는 단계에서는, 상기 전경에 포함되는 객체 중 미리 정해진 종류의 정형 객체를 제외할 수 있 다. 또한, 상기 산출하는 단계는, 상기 분리된 전경에 포함되는 객체의 영역에 대한 제1 특징값과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역에 대한 제2 특징값을 추출하는 단계; 및 상기 제1 특징값과 상기 제2 특징값에 대하여 산출되는 매칭 스코어가 미리 정해진 기준을 충족하는 객체를 상기 돌발 상황 객체 후보로 산 출하는 단계;를 포함할 수 있다. 또한, 본 발명의 다른 측면에 따른 컴퓨터 프로그램은, 컴퓨터에서 앞서 기재된 돌발 상황 탐지 방법의 각 단계 를 실행시키기 위한 컴퓨터로 판독 가능한 매체에 저장된. 컴퓨터 프로그램일 수 있다. 또한, 본 발명의 또 다른 측면에 따른 돌발 상황 탐지 시스템은, 도로에 대한 제1 영상에서 전경을 분리하여 하 나 이상의 돌발 상황 객체 후보를 검출하는 돌발 상황 객체 후보 검출부; 상기 하나 이상의 돌발 상황 객체 후 보에 대하여 미리 정해진 시간 동안의 움직임을 추적하는 움직임 추적부; 및 상기 움직임이 미리 정해진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하는 돌발 상황 객체 판별부;를 포함하는 것을 특징으로 한다. 여기서, 상기 돌발 상황 객체 후보 검출부는, 미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영 상에서 상기 전경을 분리하는 전경 분리부; 및 상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보를 산출하는 객체 후보 산출부;를 포함할 수 있다. 이때, 상기 전경 분리부에서, 상기 배경 영상은 상기 제1 영상으로부터 생성되어 주기적으로 갱신될 수 있다. 또한, 상기 전경 분리부에서, 상기 배경 영상은 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 생 성될 수 있다."}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에 따라, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에서는, 도로를 촬영하는 영상을 분석하여 낙하물이 도로 상에 방치되는 경우와 같은 돌발 상황에 대해서도 이를 효과적으로 탐 지할 수 있게 된다. 또한, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에서는, 미리 정해지 지 않은 비정형의 물체가 도로상에 낙하하여 방치되는 등의 경우에도 낙하물로서 정확히 탐지할 수 있게 된다."}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명의 권리범위 를 한정하려는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이 해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아 야 한다. 또한, 본 발명에서 사용되는 기술적인 용어가본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술 적 용어일 때에는, 해당 분야의 통상의 기술자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 본 발명에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 발명에 기재된 여러 구성요소들, 또는 여러 단계를 반드 시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성요소들 또는 일부 단계들은 포함되지 않을 수 도 있고, 또는 추가적인 구성요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 발명에서 사용되는 제1, 제2 등과 같이 서수를 포함하는 용어는 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되어서는 아니된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리범위를 벗어나지 않으면서 제1 구성요소는 제2구성 요소로 명명될 수 있고, 유사하게 제2구성 요소도 제1 구성요소로 명명될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 실시 예들을 상세히 설명하되, 도면 부호에 관계없이 동일하거나 유사한 구성요소는 동일한 참조번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 기술사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 기술사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해 야 한다. 이하, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에 대한 예시적인 실 시 형태들을 첨부된 도면을 참조하여 차례로 설명한다. 먼저, 도 1에서는 본 발명의 일 실시예에 따른 교통 정보 시스템의 구성을 예시하고 있다. 도 1에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 교통 정보 시스템은 도로 등을 촬영하여 영상을 생성하는 하 나 이상의 카메라(20a, 20b), 상기 하나 이상의 카메라(20a, 20b)에서 촬영된 영상을 분석하여 낙하물 발생 등 의 돌발 상황을 탐지할 수 있는 돌발 상황 탐지 시스템을 포함하여 구성될 수 있다. 이때, 상기 하나 이상 의 카메라(20a, 20b)과 상기 돌발 상황 탐지 시스템은 통신 네트워크를 통해 데이터를 주고 받으면서 구동될 수 있다. 그러나, 본 발명이 반드시 이에 한정되는 것은 아니며, 상기 돌발 상황 탐지 시스템은 상기 통신 네트워크 등을 통하지 않고 직접 영상을 입력받아 낙하물 발생 등의 돌발 상황을 탐지하는 것도 가능하며, 나아가 상기 돌발 상황 탐지 시스템이 상기 카메라(20a, 20b)를 구비하는 일체형으로 구현되는 등 다양한 형태로 구현하는 것도 가능하다. 이때, 상기 카메라(20a, 20b)는 도로에 인접하여 설치되는 교통용 카메라일 수 있으나, 본 발명이 반드시 이에 한정되는 것은 아니다. 또한, 상기 돌발 상황 탐지 시스템은 하나의 물리적인 서버 컴퓨터로 구현되거나, 둘 이상의 서버 컴퓨터 가 연동되어 구현될 수도 있으며, 상기 서버 컴퓨터의 예로는 서버 컴퓨팅 디바이스, 개인용 컴퓨터, 미니 컴퓨 터, 및/또는 메인프레임 컴퓨터를 포함할 수 있지만 이러한 것으로만 한정되는 것은 아니고, 상기 서버 컴퓨터 는 분산형 시스템일 수 있으며, 나아가 클라우드 시스템을 이용하여 구현되거나 전용 하드웨어 등을 사용하여 별도의 장치로 구현되는 등 매우 다양한 형태로 구현하는 것이 가능하다.또한, 상기 통신 네트워크로서는 유선 네트워크와 무선 네트워크를 포함할 수 있으며, 구체적으로, 근거리 통신망 (LAN: Local Area Network), 도시권 통신망 (MAN: Metropolitan Area Network), 광역 통신망 (WAN: Wide Area Network) 등의 다양한 통신망을 포함할 수 있다. 또한, 상기 통신 네트워크는 공지의 월드 와이 드 웹(WWW: World Wide Web)을 포함할 수도 있다. 그러나, 본 발명에서 통신 네트워크는 상기 열거된 네트 워크에 국한되지 않고, 공지의 무선 데이터 네트워크나 공지의 전화 네트워크 또는 공지의 유무선 텔레비전 네 트워크를 적어도 일부로 포함할 수도 있다. 또한, 도 2에서는 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법의 순서도를 예시하고 있다. 도 2에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법은, 돌발 상황 탐지 시스템이, 도로에 대한 제1 영상에서 전경을 분리하여 하나 이상의 돌발 상황 객체 후보를 검출하는 단계(S110), 상기 하나 이상 의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안의 움직임을 추적하는 단계(S120) 및 상기 움직임이 미 리 정해진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하 는 단계(S130)를 포함할 수 있다. 이때, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법에서, 상기 검출하는 단계(S110)는, 미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리하는 단계(S111) 및 상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하 나 이상의 돌발 상황 객체 후보를 산출하는 단계(S112)를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법에서, 상기 산출하는 단계(S112)는, 상기 분리된 전경에 포함되는 객체의 영역에 대한 제1 특징값과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역에 대한 제2 특징값을 추출하는 단계(S1121) 및 상기 제1 특징값과 상기 제2 특징값에 대하여 산출되는 매칭 스코어가 미리 정해진 기준을 충족하는 객체를 상기 돌발 상황 객체 후보로 산출하는 단계(S1122)를 포함할 수도 있다. 이에 따라, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법에서는, 도로를 촬영하는 영상을 분석하여 낙하물 이 도로 상에 방치되는 경우와 같은 돌발 상황에 대해서도 효과적으로 탐지할 수 있으며, 나아가 미리 정해지지 않은 비정형의 물체가 도로상에 낙하하여 방치되는 등의 경우에도 낙하물을 정확히 탐지할 수 있게 된다. 이하, 도면을 참조하여 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법을 보다 자세하게 살핀다. 먼저, 상기 S110 단계에서는 돌발 상황 탐지 시스템이 도로에 대한 제1 영상에서 전경을 분리하여 하나 이 상의 돌발 상황 객체 후보를 검출하게 된다. 여기서, 돌발 상황 객체는 도로에서 미리 정해진 교통 규칙 등에 따라 정상적으로 이동하지 않아 상기 도로에서 의 교통 흐름 등에 지장을 초래할 수 있는 객체를 의미하며, 보다 구체적인 예를 들어 역주행 차량, 위험 지역 보행자, 도로상의 낙하물, 불법 주정차 차량, 불법 유턴 차량, 버스 등 전용차로 위반 차량, 교차로 등에서의 꼬리물기 차량, 정지선 위반 차량, 사고 차량 등을 들 수 있다. 나아가, 본 발명에서는 상기 돌발 상황 객체의 예시로서 비정형 형상의 낙하물을 중심으로 설명하고 있으나, 이 는 하나의 실시예에 해당할 뿐이며, 본 발명이 반드시 이에 한정되는 것은 아니다. 이와 관련하여, 종래에는 통상적으로 도로를 촬영하는 영상에서 승용차, 트럭, 버스 등 승합차, 오토바이 등 이 륜차, 보행자 등 미리 정해진 종류의 객체를 식별하고, 상기 식별된 객체의 움직임을 추적하는 등의 방법으로 차량의 역주행 등 돌발 상황을 검출하였으나, 이러한 경우 미리 정해진 형상을 가지는 객체 이외의 비정형 객체 에 대해서는 식별이 어렵다는 제약이 따랐으나, 이에 대하여 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법 에서는 다양한 형상의 낙하물 등 비정형의 객체에 의한 돌발 상황도 효과적으로 탐지할 수 있게 된다. 보다 구체적인 예를 들어, 도 3에서 볼 수 있는 바와 같이, 상기 돌발 상황 탐지 시스템에서는 도로를 촬 영하는 하나 이상의 카메라(20a, 20b)에서 촬영된 제1 영상을 통신 네트워크를 통해 전송받을 수 있다. 이때, 상기 제1 영상은 상기 제1 영상에 위치하는 승용차, 트럭, 버스, 오토바이, 보행자 등 객체를 포함하는 전경과 도로, 건물 등의 배경을 포함할 수 있다. 이에 따라, 상기 돌발 상황 탐지 시스템에서는 상기 제1 영상에서 전경을 배경으로부터 분리하여 하나 이 상의 돌발 상황 객체 후보를 검출할 수 있다. 보다 구체적으로, 도 4에서 볼 수 있는 바와 같이, 상기 S110 단계에서는 상기 돌발 상황 탐지 시스템가 상기 제1 영상을 수신한 후, 상기 제1 영상에서 전경을 분리할 수 있으며, 나아가 상기 분리된 전경에서 하나이상의 돌발 상황 객체 후보를 검출할 수 있다. 이때, 상기 S110 단계는, 도 5에서 볼 수 있는 바와 같이, 미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리하는 단계(S111) 및 상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보를 산 출하는 단계(S112)를 포함할 수 있다. 보다 구체적으로, 상기 S111 단계에서, 상기 돌발 상황 탐지 시스템에서는, 미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리할 수 있다. 이때, 상기 도로에 대한 배경 영상은 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 생성될 수 있 다. 보다 구체적인 예를 들어, 상기 제1 영상에서 전경에 해당하는 객체 등은 그 종류에 따라 다양한 움직임이 나타 날 수 있으나, 배경에 해당하는 도로 영역이나 건물 영역 등은 움직임이 거의 없이 고정된 상태를 유지하게 되 므로, 상기 제1 영상을 배경 영상을 산출하도록 훈련된 신경망 등에 입력하여 소정의 시간 동안의 학습을 통해 상기 제1 영상에 대한 배경 영상을 산출할 수 있게 된다. 이에 따라, 상기 돌발 상황 탐지 시스템에서는, 도 6에서 볼 수 있는 바와 같이, 상기 제1 영상에 대한 배 경 영상을 산출할 수 있으나, 본 발명이 반드시 이에 한정되는 것은 아니다. 보다 구체적으로, 상기 돌발 상황 탐지 시스템에서는 아래 수학식 1을 이용하여 배경에 대한 학습을 수행 할 수 있다. 여기서, B는 배경 영상, S는 현재 취득된 영상이고, r은 학습률을 의미하고 상기 r은 0 내지 1의 값을 적용할 수 있으며, 초기에 설정된 시간 동안 학습할 때에는 r을 보다 큰 값으로 학습을 진행하고, 이후에 는 일정 시간 간격으로 업데이트하는 경우 이보다 작은 값으로 학습을 진행하도록 할 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0115317", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또는, 상기 S111 단계에서, 상기 돌발 상황 탐지 시스템에서는 상기 제1 영상에서 움직임이 없는 하나 이 상의 영상 구간을 식별하고 이를 기초로 상기 배경 영상을 산출하는 것도 가능하다. 보다 구체적인 예를 들어, 상기 제1 영상에서 소정의 시간 동안 차량 등의 움직임이 없는 영상 구간이 검출되면, 상기 움직임이 없는 영상 구간에서 특정 영상을 선별하거나 각 영상의 평균치 등을 이용하여 상기 제 1 영상에 대한 배경 영상을 산출하도록 할 수 있으나, 본 발명이 반드시 이에 한정되는 것은 아니다. 나아가, 상기 제1 영상에 대한 배경 영상은 상기 제1 영상으로부터 주기적으로 갱신되어 생성될 수 있다. 보다 구체적으로, 상기 도로에 대한 제1 영상은 시간대에 따른 조도, 날씨, 건물의 그림자 등의 변화 등을 반영 할 수 있도록 주기적으로 갱신되어 생성될 수 있다. 이에 따라, 상기 S111 단계에서는, 상기 미리 준비된 상기 도로에 대한 배경 영상을 이용하여, 상기 제1 영상으 로부터 전경을 분리할 수 있다. 보다 구체적으로, 상기 S111 단계에서는, 상기 배경 영상과 상기 제1 영상의 차분을 이용하여 상기 전경을 분리 하는 것이 가능하나, 본 발명이 반드시 이에 한정되는 것은 아니다. 이어서, 상기 S112 단계에서는, 상기 돌발 상황 탐지 시스템에서 상기 분리된 전경에 포함되는 객체의 영 역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보를 산출하게 된다. 이때, 상기 S112 단계는, 도 7에서 볼 수 있는 바와 같이, 상기 분리된 전경에 포함되는 객체의 영역에 대한 제 1 특징값과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역에 대한 제2 특징값을 추출하는 단계 (S1121) 및 상기 제1 특징값과 상기 제2 특징값에 대하여 산출되는 매칭 스코어가 미리 정해진 기준을 충족하는 객체를 상기 돌발 상황 객체 후보로 산출하는 단계(S1122)를 포함할 수 있다. 보다 구체적으로, 도 8에서 볼 수 있는 바와 같이, XCS-LBP 알고리즘 등을 이용하여, 상기 제1 영상에서 검출된 전경의 객체 중 돌발 상황 객체 후보를 산출하기 위하여, 각 객체에 대한 좌표값을 기반으로 제1 영상으로부터특징값을 추출하고, 또한 동일한 좌표값을 가지는 기반으로 상기 배경 영상으로부터도 특징값을 추출해 비교하 여 최종적으로 돌발 상황 객체 후보를 산출할 수 있으나, 본 발명이 반드시 이에 한정되는 것은 아니다. 또한, 상기 S120 단계에서는, 상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안의 움직임 을 추적하게 된다. 이어서, 상기 S130 단계에서는, 상기 움직임이 미리 정해진 기준을 충족하는 경우를 기초로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별하게 된다. 보다 구체적인 예를 들어, 상기 S110 단계에서 비정형 낙하물 등 하나 이상의 돌발 상황 객체 후보가 검출되면, 상기 돌발 상황 탐지 시스템에서는, 상기 S120 단계에서 상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안 움직임을 추적하게 된다. 이때, 도 9에서 볼 수 있는 바와 같이, 배경이 아닌 객체는 각 객체의 특성에 따라 소정의 움직임을 보이게 되 므로, 상기 돌발 상황 탐지 시스템에서는 소정의 시간 동안 상기 돌발 상황 객체 후보의 움직임을 추적하 면서, 상기 움직임이 미리 정해진 기준을 충족하는지 여부를 기준으로 상기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별할 수 있게 된다. 또한, 도 10과 도 11에서는 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치 및 시스템의 구체적인 구성 및 동작을 설명하고 있다. 보다 구체적으로, 도 10에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치 및 시스템에서는, 먼저 영상 취득부가 도로 등을 촬영하여 영상을 생성하는 하나 이상의 카메라(20a, 20b)로 부터 통신 네트워크을 통해 상기 도로에 대하여 촬영된 제1 영상을 취득하게 된다. 이어서, 객체 검출부에서는 인공지능(AI) 검출기와 낙하물 후보 검출기를 이용하여 상기 제1 영 상에서 하나 이상의 객체를 검출할 수 있다. 보다 구체적으로, 상기 인공지능(AI) 검출기는 딥러닝 기반 신경망으로 구성되어 미리 정해진 유형의 객체 (예를 들어, 승용차, 트럭, 버스, 오토바이 등의 라이더, 보행자 등)를 검출할 수 있다. 또한, 상기 낙하물 후보 검출기에서는 앞서 설명한 바와 돌발 상황 탐지 방법에서와 같이 다양한 형상의 낙하물 등 비정형의 객체를 검출할 수 있다. 나아가, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치 및 시스템에서는, 상기 낙하물 후보 검출기 에서 검출된 객체를 상기 인공지능(AI) 검출기에서 검출된 객체와 대비하여, 상기 인공지능(AI) 검출 기에서 검출된 객체는 제외함으로써, 중복 검출된 객체를 제거하여 보다 효율적으로 검출 프로세스를 처리 하도록 할 수 있다. 다음으로, 객체 추적부에서는 상기 객체 검출부에서 검출된 객체에 대하여 미리 정해진 시간 동안의 움직임을 추적하게 된다. 보다 구체적으로, 상기 객체 추적부에서는, 상기 객체 검출부에서 검출된 객체들의 영역 정보와 상기 영역의 영상 정보를 기반으로 각 객체를 추적할 수 있다. 나아가, 상기 객체 추적부에서는, 각 객체들의 좌표값에 대하여 원근에 따른 오류를 방지할 수 있도록 탑 뷰(top view) 좌표 형태로 변환하여 처리할 수 있다. 이에 따라, 이벤트 판단부에서는, 상기 객체들에 대한 돌발 상황 이벤트를 판단할 수 있게 된다. 보다 구체적인 예를 들어, 상기 이벤트 판단부에서는 아래의 돌발 상황 이벤트를 탐지할 수 있다. (가) 역주행: 사전에 설정된 도로 영역과 진행 방향에 대한 정보를 기반으로 추적된 객체들의 이동 방향이 반대 방향인 경우 역주행으로 판단할 수 있다. (나) 위험 지역 보행자: 횡단보도, 인도가 아닌 설정된 도로 영역에 사람이 특정 시간 이상 검출되어 추적되는 경우, 위험 지역 보행자로 판단할 수 있다. (다) 낙하물 탐지: 추적된 낙하물 후보 군의 위치 정보를 기반으로 일정 시간 동안 움직임이 없거나 미리 정해 진 속도 미만으로 이동하는 경우 낙하물로 판단할 수 있다. (라) 불법 주정차: 미리 설정된 불법 주정차 금지 영역에 소정의 시간 이상 차량이 정지되어 있는 경우, 불법 주정차로 판단할 수 있으며, 나아가 단순한 신호 대기 상태와 구분하기 위해 다른 차선 및 앞 뒤, 차량들의 움 직임 정보도 함께 고려하여 불법 주정차 여부를 판단할 수 있다. (마) 불법 유턴: 검출 및 추적된 차량의 정보를 기반으로 유턴 지역이 아닌 영역에서 반대 방향 차선으로 이동 하는 경우 불법 유턴으로 판단할 수 있다. (바) 버스 전용차로 위반: 설정된 버스 전용차로 영역에서 승용차, 트럭 등의 객체가 이동하는 경우 버스 전용 차로 위반으로 판단할 수 있다. (사) 차량 꼬리 물기: 미리 설정된 교차로 영역에 다른 방향에서 진입한 차량들의 통행을 방해하는 방향 또는 위치에 정지되어 있는 경우 차량 꼬리 물기 상황으로 판단할 수 있다. (아) 정지선 위반: 미리 설정된 정지선 영역을 넘어서 정차된 차량에 대하여 정지선 위반으로 판단할 수 있다. (자) 차량 사고 인지: 미리 설정된 크기의 영역 내에 인접하여 특정 차량들이 소정의 시간 이상 정지되어 있는 경우 차량 사고 상황으로 판단할 수 있다. 또한, 도 11에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치 및 시스템에서 는, 낙하물 등 비정형 객체에 대한 돌발 상황 탐지에 대하여 보다 자세히 설명하고 있다. 먼저, 도로에 대하여 촬영된 제1 영상을 수신하면, 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 상기 제1 영상에 대한 배경 영상을 생성할 수 있다. 이어서, 상기 배경 영상과 상기 제1 영상에 대한 차이를 고려하여 상기 제1 영상에서 전경을 분리하고, 상 기 분리된 전경 중 인공지능(AI) 검출기에서 검출된 객체를 제거하여 중복 검출된 객체를 제외하게 된다. 다음으로, 상기 제1 영상에서 상기 객체의 영역에 대하여 제1 특징값을 추출하고, 이를 상기 배경 영상에서 상 기 각 객체와 동일한 위치의 영역에 대한 제2 특징값을 추출하여 매칭 스코어(matching score)를 계산하고, 상 기 매칭 스코어가 미리 설정된 임계치를 충족하는 경우 낙하물 등 돌발 상황 객체 후보로 선정하게 된다. 이때, 상기 매칭 스코어를 계산하기 위하여 다양한 유사도 알고리즘 등을 적용할 수 있으나, 본 발명이 반드시 이에 한정되는 것은 아니다. 이어서, 상기 제1 영상에서 상기 낙하물 등 돌발 상황 객체 후보에 대한 추적을 수행하고, 상기 낙하물 등 돌발 상황 객체 후보가 미리 정해진 시간 동안 계속 검출되어 추적 결과 데이터가 축적되고, 상기 추적 결과 데 이터를 기반으로 상기 낙하물 등 돌발 상황 객체 후보가 정지된 상태이거나 이동이 기준치보다 작은 상황으로 판단되는 경우, 낙하물로서 판단할 수 있다. 또한, 본 발명의 또 다른 측면에 따른 컴퓨터 프로그램은 앞서 살핀 돌발 상황 탐지 방법의 각 단계를 컴퓨터에 서 실행시키기 위하여 컴퓨터로 판독 가능한 매체에 저장된 컴퓨터 프로그램인 것을 특징으로 한다. 상기 컴퓨 터 프로그램은 컴파일러에 의해 만들어지는 기계어 코드를 포함하는 컴퓨터 프로그램뿐만 아니라, 인터프리터 등을 사용해서 컴퓨터에서 실행될 수 있는 고급 언어 코드를 포함하는 컴퓨터 프로그램일 수도 있다. 이때, 상 기 컴퓨터로서는 퍼스널 컴퓨터(PC)나 노트북 컴퓨터 등에 한정되지 아니하며, 서버, 통신용 장비, 스마트폰, 태블릿 PC, PDA, 휴대전화 등 중앙처리장치(CPU)를 구비하여 컴퓨터 프로그램을 실행할 수 있는 일체의 정보처 리 장치를 포함한다. 또한, 상기 컴퓨터로 판독 가능한 매체는 전자적 기록 매체(예를 들면, 롬, 플래시 메모리, 등), 마그네틱 저장매체(예를 들면, 플로피 디스크, 하드디스크 등) 및 광학적 판독 매체(예를 들면, 시디롬, 디브이디 등)와 같이 컴퓨터로 판독이 가능한 일체의 저장매체를 포함할 수 있다. 또한, 도 12에서는 본 발명의 일 실시예에 따른 돌발 상황 탐지 시스템의 블록도를 예하고 있다. 이때, 상 기 본 발명의 일 실시예에 따른 돌발 상황 탐지 시스템에 대해서는 앞서 설명한 본 발명의 일 실시예에 따 른 돌발 상황 탐지 방법에 대한 설명을 참조하여 통상의 기술자가 용이하게 구현 가능하므로, 아래에서는 자세 한 설명은 생략하고 본 발명의 일 실시예에 따른 돌발 상황 탐지 시스템의 주요 구성에 대해서 간략하게 살핀다. 이때, 도 12에서 볼 수 있는 바와 같이, 본 발명의 일 실시예에 따른 돌발 상황 탐지 시스템은, 돌발 상황 객체 후보 검출부, 움직임 추적부 및 돌발 상황 객체 판별부를 포함하여 구성될 수 있다. 여기서, 상기 돌발 상황 객체 후보 검출부에서는 도로에 대한 제1 영상에서 전경을 분리하여 하나 이상의 돌발 상황 객체 후보를 검출할 수 있다.또한, 상기 움직임 추적부에서는 상기 하나 이상의 돌발 상황 객체 후보에 대하여 미리 정해진 시간 동안 의 움직임을 추적할 수 있다. 나아가, 상기 돌발 상황 객체 판별부에서는 상기 움직임이 미리 정해진 기준을 충족하는 경우를 기초로 상 기 하나 이상의 돌발 상황 객체 후보 중 돌발 상황 객체를 판별할 수 있다. 여기서, 상기 돌발 상황 객체 후보 검출부는, 미리 준비된 상기 도로에 대한 배경 영상을 이용하여 상기 제1 영상에서 상기 전경을 분리하는 전경 분리부(미도시) 및 상기 분리된 전경에 포함되는 객체의 영역과 상기 하나 이상의 객체에 대응하는 상기 배경 영상의 영역의 유사도를 기초로 상기 하나 이상의 돌발 상황 객체 후보 를 산출하는 객체 후보 산출부(미도시)를 포함할 수 있다. 이때, 상기 전경 분리부(미도시)에서, 상기 배경 영상은 상기 제1 영상으로부터 생성되어 주기적으로 갱신될 수 있다. 또한, 상기 전경 분리부(미도시)에서, 상기 배경 영상은 미리 정해진 시간 동안의 상기 제1 영상에 대한 학습을 거쳐 생성될 수 있다. 이에 따라, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에서는, 도로를 촬영하는 영상을 분석하여 낙하물이 도로 상에 방치되는 경우와 같은 돌발 상황에 대해서도 이를 효과적으로 탐 지할 수 있게 된다. 또한, 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치, 시스템 및 컴퓨터 프로그램에서는, 미리 정해지 지 않은 비정형의 물체가 도로상에 낙하하여 방치되는 등의 경우에도 낙하물로서 정확히 탐지할 수 있게 된다. 본 명세서에서 설명된 위 실시예 및 도면들은 단지 예시적인 것일 뿐, 어떠한 방법으로도 본 발명의 범위를 한 정하는 것은 아니다. 또한, 도면에 도시된 구성요소들 간의 선들의 연결 또는 연결 부재들은 기능적인 연결 및/ 또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제장치에서는 대체 가능하거나 추가의 다양 한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, \"필수적인\", \"중요하게\" 등과 같이 구체적인 언급이 없다면 본 발명의 적용을 위하여 반드시 필요한 구성요소가 아닐 수 있다. 본 발명의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 발명에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값 을 적용한 발명을 포함하는 것으로서(이에 반하는 기재가 없다면), 발명의 상세한 설명에 상기 범위를 구성하는 각 개별적인 값을 기재한 것과 같다. 또한 본 발명 중 방법 발명에서 제시하는 단계들은 반드시 그 선후의 순서 에 대한 구속을 의도한 것이 아니며, 각 공정의 본질에 따라 반드시 어느 단계가 선행되어야 하는 것이 아닌 한 순서는 필요에 따라 적절히 변경될 수 있다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사 용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또 는 예시적인 용어로 인해본 발명의 범위가 한정되는 것은 아니다. 또한, 통상의 기술자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등 범주 내에서 설계 조건 및 요소에 따라 구성될 수 있음을 이해할 수 있다."}
{"patent_id": "10-2022-0115317", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부도면은 본 발명에 대한 실시예를 제공하 고, 상세한 설명과 함께 본 발명의 기술적 사상을 설명한다. 도 1은 본 발명의 일 실시예에 따른 교통 정보 시스템의 구성을 예시하는 도면이다. 도 2는 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법의 순서도를 예시하는 도면이다. 도 3 내지 도 9는 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법에서의 영상 처리 과정을 예시하는 도면이다.도 10 내지 도 11은 본 발명의 일 실시예에 따른 돌발 상황 탐지 방법, 장치 및 시스템의 구체적인 구성 및 동 작을 설명하는 도면이다. 도 12는 본 발명의 일 실시예에 따른 돌발 상황 탐지 시스템의 블록도를 예시하는 도면이다."}
