{"patent_id": "10-2018-0169216", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0079741", "출원번호": "10-2018-0169216", "발명의 명칭": "개인화 서비스를 제공하는 단말, 방법 및 컴퓨터 프로그램", "출원인": "주식회사 케이티", "발명자": "이다은"}}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "개인화 서비스를 제공하는 사용자 단말에 있어서, 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받는 제 1 입력부;상기 제 1 요청에 따라 상기 미디어 컨텐츠를 재생하는 재생부;상기 미디어 컨텐츠에 대한 정보를 수집하는 수집부;상기 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받은 제 2 입력부;상기 제 2 요청에 기초하여 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 분석부; 및분석 결과를 이용하여 상기 제 2 요청에 대한 개인화 서비스를 제공하는 제공부를 포함하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 분석부는 상기 제 2 요청으로부터 도출된 요청 형태에 따라 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 미디어 컨텐츠가 뉴스 컨텐츠이고, 상기 제 2 요청이 상기 사용자 단말과 연계된 SNS(Social Network Service)로 상기 뉴스 컨텐츠와 관련된 정보에 대한 공유를 요청하는 것인 경우, 상기 분석부는 상기 뉴스 컨텐츠에 포함된 기사 내용에 대응하는 음성 신호를 텍스트로 변환하고, 상기 변환된텍스트를 이용하여 상기 기사 내용과 관련된 기사 정보를 검색하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 제공부는 상기 검색된 기사 정보의 URL 링크를 사용자의 SNS에 게시하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 제 2 요청이 SNS 상에서 상기 미디어 컨텐츠 상의 특정 인물과 상기 사용자 단말의 사용자 계정 간의 친구관계 설정을 요청하는 것인 경우, 상기 분석부는 상기 미디어 컨텐츠에서 상기 특정 인물의 이미지를 캡쳐하고, 상기 캡쳐된 특정 인물의 이미지를 이용하여 상기 특정 인물의 SNS 계정을 검색하는 것인, 사용자 단말. 공개특허 10-2020-0079741-3-청구항 6 제 5 항에 있어서, 상기 제공부는 상기 검색된 특정 인물의 SNS 계정으로 상기 사용자 단말의 사용자 계정과 친구 관계 설정을 요청하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 제 2 요청이 기상 알람 앱의 알람음을 상기 미디어 컨텐츠에서 제공되는 특정 배경음으로 설정하는 것인경우, 상기 분석부는 상기 특정 배경음을 검색하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서, 상기 제공부는 상기 검색된 특정 배경음을 상기 기상 알람 앱의 알람음으로 설정하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서, 상기 제 2 요청이 상기 미디어 컨텐츠에 포함된 특정 상품에 대한 주문을 요청하는 것인 경우, 상기 분석부는 상기 특정 상품에 대한 이미지를 이용하여 상기 특정 상품에 대한 정보를 검색하는 것인, 사용자단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서, 상기 제공부는 상기 검색된 특정 상품에 대한 정보에 기초하여 상기 사용자 단말에 설치된 주문 앱을 통해 상기특정 상품을 주문하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 제공부는 상기 검색된 특정 상품에 대한 정보를 상기 사용자 단말로 전송하는 것인, 사용자 단말."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "사용자 단말에서 개인화 서비스를 제공하는 방법에 있어서, 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받는 단계;상기 제 1 요청에 따라 상기 미디어 컨텐츠를 재생하는 단계;공개특허 10-2020-0079741-4-상기 미디어 컨텐츠에 대한 정보를 수집하는 단계;상기 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받은 단계;상기 제 2 요청에 기초하여 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 단계; 및분석 결과를 이용하여 상기 제 2 요청에 대한 개인화 서비스를 제공하는 단계를 포함하는 개인화 서비스 제공 방법."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서, 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 단계는 상기 제 2 요청으로부터 도출된 요청 형태에 따라 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 단계를포함하는 것인, 개인화 서비스 제공 방법."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 단계는 상기 미디어 컨텐츠가 뉴스 컨텐츠이고, 상기 제 2 요청이 상기 사용자 단말과 연계된 SNS(Social Network Service)로 상기 뉴스 컨텐츠와 관련된 정보에 대한 공유를 요청하는 것인 경우, 상기 뉴스 컨텐츠에 포함된 기사 내용에 대응하는 음성 신호를 텍스트로 변환하고, 상기 변환된 텍스트를 이용하여 상기 기사 내용과 관련된 기사 정보를 검색하는 단계를 포함하는 것인, 개인화 서비스 제공 방법."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서, 상기 제 2 요청에 대한 개인화 서비스를 제공하는 단계는 상기 검색된 기사 정보의 URL 링크를 사용자의 SNS에 게시하는 단계를 포함하는 것인, 개인화 서비스 제공방법."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서, 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 단계는 상기 제 2 요청이 상기 미디어 컨텐츠에 포함된 특정 상품에 대한 주문을 요청하는 것인 경우, 상기 특정 상품에 대한 이미지를 이용하여 상기 특정 상품에 대한 정보를 검색하는 단계를 포함하는 것인, 개인화 서비스 제공 방법."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 공개특허 10-2020-0079741-5-상기 제 2 요청에 대한 개인화 서비스를 제공하는 단계는 상기 검색된 특정 상품에 대한 정보에 기초하여 상기 사용자 단말에 설치된 주문 앱을 통해 상기 특정 상품을주문하는 단계를 포함하는 것인, 개인화 서비스 제공 방법."}
{"patent_id": "10-2018-0169216", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "개인화 서비스를 제공하는 명령어들의 시퀀스를 포함하는 매체에 저장된 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램은 컴퓨팅 장치에 의해 재생될 경우,미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받고,상기 제 1 요청에 따라 상기 미디어 컨텐츠를 재생하고,상기 미디어 컨텐츠에 대한 정보를 수집하고,상기 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받고,상기 제 2 요청에 기초하여 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하고,분석 결과를 이용하여 상기 제 2 요청에 대한 개인화 서비스를 제공하는 명령어들의 시퀀스를 포함하는, 매체에저장된 컴퓨터 프로그램."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개인화 서비스를 제공하는 사용자 단말은 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받는 제 1 입력부, 제 1 요청에 따라 미디어 컨텐츠를 재생하는 재생부, 미디어 컨텐츠에 대한 정보를 수집하는 수집부, 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받은 제 2 입력부, 제 2 요청에 기초하여 수집된 미디어 컨텐츠 에 대한 정보를 분석하는 분석부, 분석 결과를 이용하여 제 2 요청에 대한 개인화 서비스를 제공하는 제공부를 포함할 수 있다."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 개인화 서비스를 제공하는 단말, 방법 및 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 인공지능 스피커에 대한 사용이 늘어나면서, 기존의 IPTV 및 모바일 단말을 통해 제공하던 미디어 경 험을 인공지능 스피커를 통해 제공하고자 하는 요구사항이 많아지고 있다. 미디어 서비스를 이용하는 사용자 행태를 살펴 보면, 미디어 컨텐츠를 시청하는데 그치는 것이 아니라, 미디어 컨텐츠에 출현하는 다양한 상품, 뉴스 기사 등을 검색하고, 검색된 정보를 SNS를 통해 다른 사람과 공유하려는 경향이 있다. 하지만, 사용자가 이러한 미디어 이용 과정을 진행하려면, 복잡한 절차를 거쳐야 한다. 예를 들면, TV를 통해 뉴스를 시청하면서 모바일 단말로 해당 뉴스의 웹 기사를 검색하고, 검색된 웹 기사의 링크를 개인 SNS 등의 웹 공간에 직접 업로드해야 하는 순차적인 과정을 모두 사용자가 직접 진행해야 한다. 이와 같이, 사용자가 원하는 미디어 이용의 목표까지 도달하기 위해서는 여러 단계를 거쳐야 하고, 사용자가 직 접 여러 단말을 컨트롤해야하는 번거로움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제2013-0097513호 (2013.09.03. 공개)"}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 재생 중인 미디어 컨텐츠에 대한 개인화 서비스와 관련한 요청에 기초하여 미디어 컨텐츠에 대한 정 보를 분석하고, 분석된 결과를 이용하여 개인화 서비스를 제공하고자 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 제 1 측면에 따른 개인화 서비스를 제공하 는 사용자 단말은 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받는 제 1 입력부; 상기 제 1 요청에 따라 상 기 미디어 컨텐츠를 재생하는 재생부; 상기 미디어 컨텐츠에 대한 정보를 수집하는 수집부; 상기 미디어 컨텐츠 에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받은 제 2 입력부; 상기 제 2 요청에 기초하여 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 분석부; 및 분석 결과를 이용하여 상기 제 2 요청에 대한 개인화 서비스 를 제공하는 제공부를 포함할 수 있다. 본 발명의 제 2 측면에 따른 사용자 단말에서 개인화 서비스를 제공하는 방법은 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받는 단계; 상기 제 1 요청에 따라 상기 미디어 컨텐츠를 재생하는 단계; 상기 미디어 컨텐츠 에 대한 정보를 수집하는 단계; 상기 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받은 단 계; 상기 제 2 요청에 기초하여 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하는 단계; 및 분석 결과를 이용 하여 상기 제 2 요청에 대한 개인화 서비스를 제공하는 단계를 포함할 수 있다. 본 발명의 제 3 측면에 따른 개인화 서비스를 제공하는 명령어들의 시퀀스를 포함하는 매체에 저장된 컴퓨터 프 로그램에 있어서, 상기 컴퓨터 프로그램은 컴퓨팅 장치에 의해 재생될 경우, 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받고, 상기 제 1 요청에 따라 상기 미디어 컨텐츠를 재생하고, 상기 미디어 컨텐츠에 대한 정보를 수집하고, 상기 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받고, 상기 제 2 요청에 기초 하여 상기 수집된 미디어 컨텐츠에 대한 정보를 분석하고, 분석 결과를 이용하여 상기 제 2 요청에 대한 개인화 서비스를 제공하는 명령어들의 시퀀스를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본 발명을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 기재된 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 본 발명은 재생 중인 미디어 컨텐츠에 대한 개인화 서비스와 관련한 요청에 기초하여 미디어 컨텐츠에 대한 정보를 분석하고, 분석된 결과를 이용하여 개인화 서비 스를 제공할 수 있다. 이를 통해, 본 발명은 사용자가 일일이 앱을 손수 구동시켜 검색하고, 설정하는 등 의 순차적인 절차를 수행하지 않더라도, 사용자 단말에서 사용자가 요청한 명령에 대한 연속적인 처리 과 정을 통해 도출된 요청에 대한 개인화 서비스를 한번에 사용자에게 제공할 수 있다."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말 또는 디 바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말 또는 디바이스에서 수행될 수도 있다. 이하, 첨부된 구성도 또는 처리 흐름도를 참고하여, 본 발명의 실시를 위한 구체적인 내용을 설명하도록 한다. 도 1은 본 발명의 일 실시예에 따른, 개인화 서비스 제공 시스템의 구성도이다. 도 1을 참조하면, 개인화 서비스 제공 시스템은 사용자 단말을 포함할 수 있다. 다만, 이러한 도 1의 개 인화 서비스 제공 시스템은 본 발명의 일 실시예에 불과하므로 도 1을 통해 본 발명이 한정 해석되는 것은 아니 며, 본 발명의 다양한 실시예들에 따라 도 1과 다르게 구성될 수도 있다. 사용자 단말은 원거리 음성 및 화자를 인식할 수 있고, 사용자와 지능형 감성 대화를 수행할 수 있다. 이러한, 사용자 단말은 사용자의 음성 명령을 입력받으면 음성 명령에 대응하는 음성 인식 서 비스를 사용자에게 제공할 수 있다. 구체적으로, 사용자 단말은 사용자로부터 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받으면, 제 1 요청에 대한 응답으로 미디어 컨텐츠를 디스플레이 장치를 통해 출력시킬 수 있다. 여기서, 미디어 컨 텐츠는 예를 들면, 음악, 팟캐스트, 방송 컨텐츠, VOD(video on demand) 컨텐츠 등의 다양한 매체를 포함할 수 있다. 이후, 사용자 단말은 디스플레이 장치를 통해 출력되는 미디어 컨텐츠에 대한 정보를 수집할 수 있다. 예를 들면, 사용자 단말은 미디어 컨텐츠의 음성 데이터, 화면 이미지 데이터 등을 수집할 수 있다. 사용자 단말은 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받으면, 제 2 요청에 기 초하여 수집된 미디어 컨텐츠에 대한 정보를 분석할 수 있다. 구체적으로, 사용자 단말은 미디어 컨텐츠 의 특정 정보를 사용자가 원하는 형태로 공유하거나 제어하는 제 2 요청을 입력받으면, 제 2 요청의 요청 형태에 따라 수집된 미디어 컨텐츠에 대한 정보를 분석할 수 있다. 사용자 단말은 분석 결과에 기초하여 사용자 단말에 설치된 복수의 앱 중 하나의 앱을 구동시키고, 구동된 앱을 통해 제 2 요청에 대한 개인화 서비스를 사용자에게 제공할 수 있다. 예를 들면, 사용자(12 0)가 미디어 컨텐츠에서 제공되는 특정 배경음으로 기상 알람 앱의 알람음 설정을 요청한 경우, 사용자 단말 은 수집된 미디어 컨텐츠에 대한 정보에 포함된 복수의 배경음 정보로부터 사용자가 요청한 특정 배 경음에 대한 정보를 도출하고, 도출된 특정 배경음을 검색하여 검색된 특정 배경음을 기상 알람 앱의 알람음으 로 설정할 수 있다. 또한, 사용자 단말의 사용자는 사용자 단말로 요청 명령(제 1 요청 및 제 2 요청)한 후에 바로 개인 화된 결과값을 받아볼 수 있다. 이를 통해, 본 발명은 사용자가 복합적으로 요청하는 개인화 서비스를 사용자 단말을 통해 제공할 수 있다. 즉, 본 발명은 사용자가 일일이 앱을 손수 구동시켜 검색하고, 설정하는 등의 순차적인 절차를 수 행하지 않더라도, 사용자 단말에서 사용자가 요청한 명령에 대한 연속적인 처리 과정을 통해 도출된 요청 에 대한 개인화 서비스를 한번에 사용자에게 제공할 수 있다. 도 2는 본 발명의 일 실시예에 따른, 사용자 단말의 블록도이다. 도 2를 참조하면, 사용자 단말은 제 1 입력부, 재생부, 수집부, 제 2 입력부, 분석 부 및 제공부를 포함할 수 있다. 다만, 도 2에 도시된 사용자 단말은 본 발명의 하나의 구현 예에 불과하며, 도 2에 도시된 구성요소들을 기초로 하여 여러 가지 변형이 가능하다. 제 1 입력부는 미디어 컨텐츠의 재생을 위한 제 1 요청을 사용자로부터 입력받을 수 있다. 여기서, 미디어 컨텐츠는 예를 들면, 음악, 팟캐스트, 방송 컨텐츠, VOD(video on demand) 컨텐츠 등의 다양한 매체를 포함할 수 있다. 재생부는 제 1 요청에 따라 미디어 컨텐츠를 재생할 수 있다. 예를 들면, 재생부는 제 1 요청에 대 한 응답으로 미디어 컨텐츠를 디스플레이 장치를 통해 출력시킬 수 있다. 예를 들면, 사용자로부터 뉴스 컨텐츠의 재생 명령을 입력받은 경우, 재생부는 사용자가 즐겨찾기로 설정한 뉴스 컨텐츠의 재 생을 디스플레이 장치를 통해 재생할 수 있다. 수집부는 미디어 컨텐츠에 대한 정보를 수집할 수 있다. 예를 들면, 수집부는 사용자의 제 1 요청에 따라 디스플레이 장치에서 재생 중인 미디어 컨텐츠에 포함된 음성 데이터, 화면 이미지 데이터, 방송 프로그램 데이터 등을 수집할 수 있다. 제 2 입력부는 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 사용자로부터 입력받을 수 있다. 여기서, 제 2 요청은 예를 들면, 미디어 컨텐츠의 특정 정보를 사용자가 원하는 형태로 공유하 거나 제어하는 명령을 포함하는 요청일 수 있다. 예를 들면, 제 2 입력부는 사용자가 뉴스 컨텐츠를 시청하는 중에 뉴스 컨텐츠와 관련된 개인화 서비스의 요청(예컨대, '지금 나오는 뉴스를 내 SNS로 공유해줘') 을 사용자로부터 입력받을 수 있다. 예를 들면, 제 2 입력부는 미디어 컨텐츠 상의 특정 인물과 사 용자 단말의 사용자 계정 간의 SNS 친구 관계 설정에 관한 요청을 사용자로부터 입력받을 수 있다. 예를 들면, 제 2 입력부는 미디어 컨텐츠에서 제공되는 특정 배경음을 사용자 단말에 설치된 기상 알 람 앱의 알람음으로 설정하는 요청을 사용자로부터 입력받을 수 있다. 예를 들면, 제 2 입력부는 미 디어 컨텐츠에 포함된 특정 상품에 대한 주문하는 요청을 사용자로부터 입력받을 수 있다. 분석부는 제 2 요청에 기초하여 수집된 미디어 컨텐츠에 대한 정보를 분석할 수 있다. 구체적으로, 분석 부는 제 2 요청으로부터 도출된 요청 형태에 따라 수집부에서 수집된 미디어 컨텐츠에 대한 정보를 분석할 수 있다. 제공부는 분석 결과를 이용하여 제 2 요청에 대한 개인화 서비스를 제공할 수 있다. 제 1 실시예로, 도 3을 참조하면, 디스플레이 장치를 통해 뉴스 컨텐츠가 출력 중이고, 사용자 단말 과 연계된 사용자의 SNS(Social Network Service)로 뉴스 컨텐츠와 관련된 정보에 대한 공유를 요청하는 제 2 요청을 입력받은 경우, 분석부는 뉴스 컨텐츠에 포함된 기사 내용에 대응하는 음성 신호를 텍스 트로 변환하고, 변환된 텍스트를 이용하여 기사 내용과 관련된 기사 정보를 검색할 수 있다. 예를 들면, 분석부는 웹 검색 엔진을 통해 기사 내용과 유사한 기사 정보를 검색할 수 있다. 또한, 분석 부는 사용자의 목소리 정보에 기초하여 화자 인식을 수행하고, 화자 인식을 통해 사용자의 사용 자 SNS 계정을 파악할 수 있다. 제공부는 사용자 SNS 계정으로 연결된 SNS에 접속하여 검색된 기사 정보의 URL 링크를 SNS(31 1)에 게시할 수 있다. 제 2 실시예로, SNS에서 미디어 컨텐츠 상의 특정 인물과 사용자 단말의 사용자 계정 간의 친구 관계 설정 을 요청하는 제 2 요청(예컨대, '노란 머리에 빨란 티 입은 연예인이랑 인스타 팔로우해줘' 등)을 입력받은 경 우, 분석부는 미디어 컨텐츠에서 특정 인물의 이미지를 캡쳐하고, 캡쳐된 특정 인물의 이미지를 이용하여 특정 인물의 SNS 계정을 검색할 수 있다. 제공부는 검색된 특정 인물의 SNS 계정으로 사용자 단말의 사용자 계정과 친구 관계 설정을 요청할 수 있다. 제 3 실시예로, 기상 알람 앱의 알람음을 미디어 컨텐츠에서 제공되는 특정 배경음으로 설정하는 제 2 요청을 입력받은 경우, 분석부는 특정 배경음을 검색할 수 있다. 예를 들면, 드라마 컨텐츠(또는 광고 컨텐츠 등)의 현재 스트리밍중인 OST 음악을 기상 알람음으로 설정하도록 하는 요청을 수신한 경우, 분석부는 외 부 음악 서버와 연동하여 해당 OST 음악을 검색할 수 있다. 제공부는 기상 알람 앱을 연결하여 기상 알람 앱의 알람음을 검색된 특정 배경음으로 설정할 수 있다. 제 4 실시예로 미디어 컨텐츠에 포함된 특정 상품에 대한 주문을 요청하는 제 2 요청을 입력받은 경우, 분석부 는 특정 상품에 대한 이미지를 이용하여 특정 상품에 대한 정보를 검색할 수 있다. 제공부는 검색된 특정 상품에 대한 정보에 기초하여 사용자 단말에 설치된 주문 앱을 통해 특정 상품 을 주문할 수 있다. 또는, 제공부는 검색된 특정 상품에 대한 정보를 사용자 단말로 전송할 수 있다. 예를 들면, 광고 컨텐츠에서 광고하는 음식의 주문과 관련된 요청(예컨대, '저 치킨 나도 지금 먹을래' 등)을 입력받은 경우, 분석부는 요청한 음식의 이미지를 분석하고, 분석된 음식 이미지에 기초하여 요청한 음식 의 메뉴를 파악할 수 있다. 제공부는 분석부에 의해 파악된 음식 메뉴를 주문 앱을 통해 주문할 수 있다. 예를 들면, 미디어 컨텐츠 상의 촬영지 또는 특정 지역(나라)으로의 항공권 정보 검색(예컨대, '다음주 주말에 저기로 가는 비행기 티켓 정보 알려줘')을 요청받은 경우, 해당 촬영지 또는 특정 지역(나라)의 이미지 및 화면 텍스트 정보를 이용하여 해당 촬영지 또는 특정 지역(나라)에 대한 위치 정보를 분석하고, 분석된 위치 정보에 기초하여 해당 촬영지 또는 특정 지역(나라)의 항공권 정보를 검색할 수 있다. 제공부는 검색된 항공권 정보를 SMS 메시지 형식으로 사용자의 단말에게 전송할 수 있다. 한편, 당업자라면, 제 1 입력부, 재생부, 수집부, 제 2 입력부, 분석부 및 제공부 각각이 분리되어 구현되거나, 이 중 하나 이상이 통합되어 구현될 수 있음을 충분히 이해할 것이다. 도 4는 본 발명의 일 실시예에 따른, 사용자 단말에서 개인화 서비스를 제공하는 방법을 나타낸 흐름도이 다. 도 4를 참조하면, 단계 S401에서 사용자 단말은 미디어 컨텐츠의 재생을 위한 제 1 요청을 입력받을 수 있 다. 단계 S403에서 사용자 단말은 제 1 요청에 따라 미디어 컨텐츠를 재생할 수 있다. 단계 S405에서 사용자 단말은 미디어 컨텐츠에 대한 정보를 수집할 수 있다. 단계 S407에서 사용자 단말은 미디어 컨텐츠에 대한 개인화 서비스와 관련하여 제 2 요청을 입력받을 수 있다. 단계 S409에서 사용자 단말은 제 2 요청에 기초하여 수집된 미디어 컨텐츠에 대한 정보를 분석할 수 있다. 단계 S411에서 사용자 단말은 분석 결과를 이용하여 제 2 요청에 대한 개인화 서비스를 제공할 수 있다. 도 4에는 도시되지 않았으나, 단계 S409에서 사용자 단말은 제 2 요청으로부터 도출된 요청 형태에 따라 수집된 미디어 컨텐츠에 대한 정보를 분석할 수 있다. 예를 들면, 사용자 단말은 사용자 단말과 연 계된 SNS로 뉴스 컨텐츠와 관련된 정보에 대한 공유를 요청을 입력받은 경우, 뉴스 컨텐츠에 포함된 기사 내용 에 대응하는 음성 신호를 텍스트로 변환하고, 변환된 텍스트를 이용하여 기사 내용과 관련된 기사 정보를 검색 할 수 있다. 예를 들면, 사용자 단말은 미디어 컨텐츠에 포함된 특정 상품에 대한 주문을 요청받은 경우, 특정 상품에 대한 이미지를 이용하여 특정 상품에 대한 정보를 검색할 수 있다. 상술한 설명에서, 단계 S401 내지 S411은 본 발명의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적 은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본 발명의 일 실시예는 컴퓨터에 의해 재생되는 프로그램 모듈과 같은 컴퓨터에 의해 재생 가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이 터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다."}
{"patent_id": "10-2018-0169216", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다. 부호의 설명100: 사용자 단말 200: 제 1 입력부 210: 재생부 220: 수집부 230: 제 2 입력부 240: 분석부 250: 제공부"}
{"patent_id": "10-2018-0169216", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른, 개인화 서비스 제공 시스템의 구성도이다. 도 2는 본 발명의 일 실시예에 따른, 사용자 단말의 블록도이다. 도 3은 본 발명의 일 실시예에 따른, 개인화 서비스를 제공하는 방법을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른, 사용자 단말에서 개인화 서비스를 제공하는 방법을 나타낸 흐름도이다."}
