{"patent_id": "10-2017-0154240", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0056873", "출원번호": "10-2017-0154240", "발명의 명칭": "다중 신경망을 활용한 객체 검출 장치 및 그 방법과, 객체 검출 학습 방법", "출원인": "주식회사 케이티", "발명자": "오만석"}}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으로, 외부로부터입력되는 복수의 영상에 각각 대응되는 복수의 신경망을 형성하는 객체 검출 학습부; 및객체 검출 대상의 영상에 대해 상기 객체 검출 학습부에서 형성되는 복수의 신경망을 사용하여 객체 검출을 수행하는 객체 검출부를 포함하는 객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 객체 검출 학습부에 의해 형성되는 복수의 신경망 각각에 대응되는 학습 모델을 대응되는 파일로서 저장하는 학습 모델 저장부를 더 포함하는,객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항 또는 제2항에 있어서,상기 객체 검출 학습부는, 상기 하나의 영상을 복수 형태의 영상으로 변형하여 출력하는 영상 변형부;상기 영상 변형부에 의해 출력되는 상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 특징점 추출부; 및상기 특징점 추출부에서 추출되는 상기 복수 형태의 영상 각각에 대한 특징점들을 사용하여 상기 하나의 영상에대응되는 하나의 신경망을 형성하는 신경망부를 포함하는, 객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 또는 제2항에 있어서,상기 객체 검출 학습부는,새로 입력되는 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출이 성공적으로 수행된 후, 상기 새로 입력되는 영상에 대한 객체 검출 학습을 수행하여 대응되는 신경망을 새로이 형성하는,객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항 또는 제2항에 있어서,상기 객체 검출부는,상기 객체 검출 학습부에서 형성되는 복수의 신경망을 사용하여 상기 객체 검출 대상의 영상에 대해 각각 객체검출을 수행하는 학습 모델별 객체 검출부; 및상기 학습 모델별 객체 검출부에서 상기 복수의 신경망별로 수행된 객체 검출 결과를 사용하여 최종 객체 검출을 수행하는 결정 엔진을 포함하는, 객체 검출 장치.공개특허 10-2019-0056873-3-청구항 6 제5항에 있어서,상기 복수의 신경망별로 수행된 객체 검출 결과는 검출된 객체 정보와 신뢰도(Confidence)를 포함하고,상기 결정 엔진은 상기 복수의 신경망별로 검출된 객체 정보와 신뢰도를 사용하여 최종 객체 검출을 수행하는,객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "외부로부터 입력되는 복수의 영상 중 하나의 영상을 선택하고 선택된 하나의 영상을 복수 형태의 영상으로 변형하는 단계;상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 단계; 상기 복수 형태의 영상 각각에 대해 추출되는 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 단계; 및상기 복수의 영상 중에서 신경망을 형성하지 않고 남아 있는 영상에 대해 상기 변형하는 단계, 상기 추출하는단계 및 상기 형성하는 단계를 수행하여 상기 복수의 영상 각각에 대응되는 복수의 신경망을 형성하는 단계를 포함하는, 객체 검출 학습 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제8항에 있어서,상기 복수 형태의 영상에는 상기 선택된 하나의 영상이 포함되는,객체 검출 학습 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 하나의 신경망을 형성하는 단계 후에,형성되는 상기 하나의 신경망에 대응되는 학습 모델을 메모리에 대응되는 하나의 파일로서 저장하는 단계를 더 포함하는, 객체 검출 학습 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 복수의 신경망을 형성하는 단계 후에,새로 입력되는 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출이 성공적으로 수행된 후, 상기 새로 입력되는 영상에 대해 상기 변형하는 단계, 상기 추출하는 단계 및 상기 형성하는 단계를 수행하여 상기 새로 입력되는 영상에 대응되는 신경망을 추가로 형성하는 단계를 더 포함하는, 객체 검출 학습 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 새로 입력되는 영상에 대응되는 신경망을 형성하는 단계는 상기 신경망을 형성하는 상기 복수의 영상이 미리 설정된 일정 개수에 도달한 후에 수행되는,객체 검출 학습 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2019-0056873-4-하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으로, 외부로부터입력되는 복수의 영상에 각각 대응되는 복수의 신경망을 형성하는 단계; 및객체 검출 대상의 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출을 수행하는 단계를 포함하는 객체 검출 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 복수의 신경망을 형성하는 단계는,상기 복수의 영상 중 하나의 영상을 선택하고 선택된 하나의 영상을 복수 형태의 영상으로 변형하는 단계;상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 단계; 상기 복수 형태의 영상 각각에 대해 추출되는 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 단계; 및상기 복수의 영상 중에서 신경망을 형성하지 않고 남아 있는 영상에 대해 상기 변형하는 단계, 상기 추출하는단계 및 상기 형성하는 단계를 수행하여 상기 복수의 영상 각각에 대응되는 복수의 신경망을 형성하는 단계를 포함하는, 객체 검출 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 객체 검출을 수행하는 단계는,상기 복수의 신경망을 사용하여 상기 객체 검출 대상의 영상에 대해 각각 객체 검출을 수행하는 단계; 및상기 복수의 신경망별로 수행된 객체 검출 결과를 사용하여 최종 객체 검출을 수행하는 단계를 포함하는, 객체 검출 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 복수의 신경망별로 수행된 객체 검출 결과는 검출된 객체 정보와 신뢰도를 포함하고,상기 최종 객체 검출을 수행하는 단계는,상기 복수의 신경망별로 검출된 객체 정보와 신뢰도를 사용하여 최종 객체 검출을 수행하는,객체 검출 방법."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "입력 영상에 대해 신경망을 사용하여 객체를 검출하는 장치로서,입력기, 메모리 및 프로세서를 포함하며,상기 입력기는 객체 검출 학습 대상의 영상 또는 객체 검출 대상의 영상을 외부로부터 입력받고,상기 메모리는 코드의 집합을 저장하도록 구성되며,상기 코드는,상기 입력기를 통해 상기 객체 검출 학습 대상의 복수의 영상을 입력받는 동작;하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으로, 상기 복수의영상에 각각 대응되는 복수의 신경망을 형성하는 동작; 및상기 입력기를 통해 입력되는 상기 객체 검출 대상의 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출을공개특허 10-2019-0056873-5-수행하는 동작을 실행하도록 상기 프로세서를 제어하는 데 사용되는,객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 복수의 신경망을 형성하는 동작은,상기 복수의 영상 중 하나의 영상을 선택하고 선택된 하나의 영상을 복수 형태의 영상으로 변형하는 동작;상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 동작; 상기 복수 형태의 영상 각각에 대해 추출되는 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 동작; 및상기 복수의 영상 중에서 신경망을 형성하지 않고 남아 있는 영상에 대해 상기 변형하는 동작, 상기 추출하는동작 및 상기 형성하는 동작을 수행하여 상기 복수의 영상 각각에 대응되는 복수의 신경망을 형성하는 동작을 포함하는, 객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,영상을 출력하는 출력기를 더 포함하고,상기 프로세서는,상기 복수의 신경망에 해당하는 학습 모델을 대응되는 복수의 파일로서 상기 메모리에 저장하는 동작; 및 상기 출력기를 통해 상기 객체 검출의 결과를 출력하는 동작을 더 실행하는, 객체 검출 장치."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다중 신경망을 활용한 객체 검출 장치 및 그 방법과, 객체 검출 학습 방법이 개시된다. 이 장치에서 객체 검출 학습부는 하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으로, 외부로부터 입력되는 복수의 영상에 각각 대응되는 복수의 신경망을 형성한다. 또한, 객체 검출부는 객체 검출 대상의 영상에 대해 상기 객체 검출 학습부에서 형성되는 복수의 신경망을 사용하여 객체 검 출을 수행한다. 여기서, 상기 객체 검출 학습부는, 상기 하나의 영상을 복수 형태의 영상으로 변형하여 출력하 는 영상 변형부; 상기 영상 변형부에 의해 출력되는 상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 특징 점 추출부; 및 상기 특징점 추출부에서 추출되는 상기 복수 형태의 영상 각각에 대한 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 신경망부를 포함한다."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중 신경망을 활용한 객체 검출 장치 및 그 방법과, 객체 검출 학습 방법에 관한 것이다."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 4세대 인공 지능(Artificial Intelligence, AI)의 대표 기법이면서 머신 러닝(machine learning)의 한 분 야인 딥러닝(deep learning)이 대두되고 있다. 이러한 딥러닝은 기존 신경망(Neural Network, NN) 분석의 발전된 형태로써, 다층구조 형태의 신경망을 기반으 로 하며, 다량의 데이터로부터 높은 수준의 추상화 모델을 구축하고자 하는 기법이다 이러한 딥러닝에서는 CNN(Convolutional Neural Network), R-CNN(Region with Convolutional Neural Network), LSTM((Long Short Term Memory) 방식의 신경망 등의 단일 망인 신경망을 활용하여 객체 검출을 수행 한다. 특히 숏텀 메모리(Short Term)를 사용하는 신경망의 경우 다양한 형태의 영상을 사용하여 학습한 후 학 습 결과를 사용하여 객체를 인식하는 객체 검출을 수행하지만 숏텀 메모리의 한계로 인해 오래전에 학습된 영상 을 잃어버려서 결과적으로 객체 검출이 제대로 수행되지 않을 수 있다. 물론 숏텀 메모리의 단점을 해결하기 위해 LSTM 방식의 신경망이 사용될 수 있지만 이러한 LSTM 방식의 신경망 에서도 사용되는 메모리가 무한으로 늘릴 수 없어서 이 또한 어느 정도의 양만을 수용할 수 있으므로 상기한 단 점이 여전히 발생할 수 있다. 또한, 객체 검출을 위한 학습 모델 생성시 많은 수의 영상이 필요하다. 그러나, 최근의 모바일 등의 사용으로 인해 간단한 영상, 예를 들어 한 장의 영상만으로도 객체 검출이 가능하도록 하는 방법이 요구된다.또한, 종래의 신경망을 사용한 객체 검출에서는 리소스가 변하거나 추가되는 경우 전체 망에 대한 재학습이 필 요하므로 동적으로 변경되거나 추가가 빈번한 경우 잦은 재학습으로 인해 객체 검출 서비스에 영향을 미칠 수 있다는 문제가 발생된다. 예를 들어, 종래의 딥러닝에서는 기억하고자 하는 수를 미리 설정하면 설정된 수를 기준으로 학습을 수행하기 때문에 학습 후에 기억하고자 하는 수를 변경하는 경우 재학습을 수행해야 한다. 따라서, 상기한 문제를 해결하기 위한 객체 검출 장치가 요구된다."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 리소스의 추가나 변경으로 인한 재학습이 필요하지 않은 다중 신경망을 활용 한 객체 검출 장치 및 그 방법과, 객체 검출 학습 방법을 제공하는 것이다."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 하나의 특징에 따른 객체 검출 장치는, 하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으로, 외부로부터 입력되는 복수의 영상에 각각 대응되는 복수의 신경망을 형성하는 객체 검출 학습부; 및 객체 검출 대상의 영상 에 대해 상기 객체 검출 학습부에서 형성되는 복수의 신경망을 사용하여 객체 검출을 수행하는 객체 검출부를 포함한다. 여기서, 상기 객체 검출 학습부에 의해 형성되는 복수의 신경망 각각에 대응되는 학습 모델을 대응되는 파일로 서 저장하는 학습 모델 저장부를 더 포함한다. 또한, 상기 객체 검출 학습부는, 상기 하나의 영상을 복수 형태의 영상으로 변형하여 출력하는 영상 변형부; 상 기 영상 변형부에 의해 출력되는 상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 특징점 추출부; 및 상 기 특징점 추출부에서 추출되는 상기 복수 형태의 영상 각각에 대한 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 신경망부를 포함한다. 또한, 상기 신경망부가 형성하는 신경망은 CNN(Convolutional Neural Network), R-CNN(Region with Convolutional Neural Network) 및 LSTM((Long Short Term Memory) 중 하나이다. 또한, 상기 객체 검출 학습부는, 새로 입력되는 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출이 성공 적으로 수행된 후, 상기 새로 입력되는 영상에 대한 객체 검출 학습을 수행하여 대응되는 신경망을 새로이 형성 한다. 또한, 상기 객체 검출부는, 상기 객체 검출 학습부에서 형성되는 복수의 신경망을 사용하여 상기 객체 검출 대 상의 영상에 대해 각각 객체 검출을 수행하는 학습 모델별 객체 검출부; 및 상기 학습 모델별 객체 검출부에서 상기 복수의 신경망별로 수행된 객체 검출 결과를 사용하여 최종 객체 검출을 수행하는 결정 엔진을 포함한다. 또한, 상기 복수의 신경망별로 수행된 객체 검출 결과는 검출된 객체 정보와 신뢰도(Confidence)를 포함하고, 상기 결정 엔진은 상기 복수의 신경망별로 검출된 객체 정보와 신뢰도를 사용하여 최종 객체 검출을 수행한다. 본 발명의 다른 특징에 따른 객체 검출 학습 방법은, 외부로부터 입력되는 복수의 영상 중 하나의 영상을 복수 형태의 영상으로 변형하는 단계; 상기 복수 형태의 영 상 각각에 대해 특징점을 추출하는 단계; 상기 복수 형태의 영상 각각에 대해 추출되는 특징점들을 사용하여 상 기 하나의 영상에 대응되는 하나의 신경망을 형성하는 단계; 및 상기 복수의 영상 중에서 객체 검출 학습 처리 되지 않은 영상에 대해 상기 변형하는 단계, 상기 추출하는 단계 및 상기 형성하는 단계를 수행하여 상기 복수 의 영상 각각에 대응되는 복수의 신경망을 형성하는 단계를 포함한다. 여기서, 상기 복수 형태의 영상에는 상기 하나의 영상이 포함된다. 또한, 상기 하나의 신경망을 형성하는 단계 후에, 형성되는 상기 하나의 신경망에 대응되는 학습 모델을 메모리 에 대응되는 하나의 파일로서 저장하는 단계를 더 포함한다. 또한, 상기 복수의 신경망을 형성하는 단계 후에, 새로 입력되는 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출이 성공적으로 수행된 후, 상기 새로 입력되는 영상에 대해 상기 변형하는 단계, 상기 추출하는 단계및 상기 형성하는 단계를 수행하여 상기 새로 입력되는 영상에 대응되는 신경망을 추가로 형성하는 단계를 더 포함한다. 또한, 상기 새로 입력되는 영상에 대응되는 신경망을 형성하는 단계는 상기 신경망을 형성하는 상기 복수의 영 상이 미리 설정된 일정 개수에 도달한 후에 수행된다. 본 발명의 또 다른 특징에 따른 객체 검출 방법은, 하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으로, 외부로부터 입력되는 복수의 영상에 각각 대응되는 복수의 신경망을 형성하는 단계; 및 객체 검출 대상의 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출을 수행하는 단계를 포함한다. 여기서, 상기 복수의 신경망을 형성하는 단계는, 상기 복수의 영상 중 하나의 영상을 복수 형태의 영상으로 변 형하는 단계; 상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 단계; 상기 복수 형태의 영상 각각에 대해 추출되는 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 단계; 및 상기 복수의 영상 중에서 객체 검출 학습 처리되지 않은 영상에 대해 상기 변형하는 단계, 상기 추출하는 단계 및 상기 형성 하는 단계를 수행하여 상기 복수의 영상 각각에 대응되는 복수의 신경망을 형성하는 단계를 포함한다. 또한, 상기 객체 검출을 수행하는 단계는, 상기 복수의 신경망을 사용하여 상기 객체 검출 대상의 영상에 대해 각각 객체 검출을 수행하는 단계; 및 상기 복수의 신경망별로 수행된 객체 검출 결과를 사용하여 최종 객체 검 출을 수행하는 단계를 포함한다. 또한, 상기 복수의 신경망별로 수행된 객체 검출 결과는 검출된 객체 정보와 신뢰도를 포함하고, 상기 최종 객 체 검출을 수행하는 단계는, 상기 복수의 신경망별로 검출된 객체 정보와 신뢰도를 사용하여 최종 객체 검출을 수행한다. 본 발명의 또 다른 특징에 따른 객체 검출 장치는, 입력 영상에 대해 신경망을 사용하여 객체를 검출하는 장치로서, 입력기, 메모리 및 프로세서를 포함하며, 상기 입력기는 객체 검출 학습 대상의 영상 또는 객체 검출 대상의 영상을 외부로부터 입력받고, 상기 메모리는 코드 의 집합을 저장하도록 구성되며, 상기 코드는, 상기 입력기를 통해 상기 객체 검출 학습 대상의 복수의 영상을 입력받는 동작; 하나의 영상을 사용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 방식으 로, 상기 복수의 영상에 각각 대응되는 복수의 신경망을 형성하는 동작; 및 상기 입력기를 통해 입력되는 상기 객체 검출 대상의 영상에 대해 상기 복수의 신경망을 사용하여 객체 검출을 수행하는 동작을 실행하도록 상기 프로세서를 제어하는 데 사용된다. 여기서, 상기 복수의 신경망을 형성하는 동작은, 상기 복수의 영상 중 하나의 영상을 복수 형태의 영상으로 변 형하는 동작; 상기 복수 형태의 영상 각각에 대해 특징점을 추출하는 동작; 상기 복수 형태의 영상 각각에 대해 추출되는 특징점들을 사용하여 상기 하나의 영상에 대응되는 하나의 신경망을 형성하는 동작; 및 상기 복수의 영상 중에서 객체 검출 학습 처리되지 않은 영상에 대해 상기 변형하는 동작, 상기 추출하는 동작 및 상기 형성 하는 동작을 수행하여 상기 복수의 영상 각각에 대응되는 복수의 신경망을 형성하는 동작을 포함한다. 또한, 영상을 출력하는 출력기를 더 포함하고, 상기 프로세서는, 상기 복수의 신경망에 해당하는 학습 모델을 대응되는 복수의 파일로서 상기 메모리에 저장하는 동작; 및 상기 출력기를 통해 상기 객체 검출의 결과를 출력 하는 동작을 더 실행한다."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 한 장의 영상별로 하나의 신경망을 형성하는 방식으로 복수의 영상 각각에 대응되 어 복수의 신경망을 형성할 수 있으며, 이렇게 형성된 복수의 신경망을 각각 파일로서 저장할 수 있다. 따라서, 많은 수의 영상일지라도 대응되는 파일로서 저장될 수 있으므로 오래된 영상에 대해서도 이전의 기억을 보존할 수 있어서 보다 정확한 객체 검출이 수행될 수 있다. 또한, 학습 대상의 영상이 추가되거나 변경되더라도 추가되거나 변경되는 영상에 대해서만 별개로 학습을 수행 하여 신경망을 형성할 수 있으므로 리소스 추가나 변경으로 인한 전체 망의 재학습이 수행될 필요가 없으므로 시간이나 자원 등에서의 소모가 줄어든다. 나아가, 시계열 영상에 대해 기존에는 전체 영상에 대한 학습을 수행해야만 하지만, 본 발명에 따르면 시계열 영상에서 특정 구간(윈도우)의 영상만을 사용하여 대응되는 신경망을 형성할 수 있다."}
{"patent_id": "10-2017-0154240", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재된 \"…부\", \"…기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하, 도면을 참고하여 본 발명의 실시예에 따른 객체 검출 장치에 대해 설명한다. 도 1은 본 발명의 실시예에 따른 객체 검출 장치의 개략적인 구성도이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 객체 검출 장치는 입력부, 객체 검출 학습부 , 학습 모델 저장부, 객체 검출부 및 출력부를 포함한다. 입력부는 CCTV(closed circuit television), 카메라, 기타 영상 센서 등을 통해 입력되는 영상, 구체적으 로는 영상 데이터를 수신한다. 선택적으로, 입력부는 사용자에 의해 직접 입력되는 영상을 입력받을 수 있다. 또한, 입력부를 통해 입력되는 영상은 하나의 영상 또는 다수의 영상일 수 있다. 또한, 입력되는 영상은 매우 빠른 속도, 예를 들어 1초에 30프레임에 해당하는 영상을 입력받을 수 있다. 따라서, 상기한 하나 의 영상은 한 프레임의 영상일 수 있다. 객체 검출 학습부는 입력부를 통해 입력되는 영상 중 하나의 영상을 사용하여 객체 검출을 위한 학습 을 수행하여 학습 결과에 대응되는 하나의 신경망을 형성한다. 이렇게 형성되는 하나의 영상에 대응되는 하나 의 신경망은 하나의 학습 모델로서 생성되며, 구체적으로는 컴퓨터에서 판독 가능한 하나의 파일로 생성될 수 있다. 여기서, 신경망은 CNN, R-CNN, LSTM 등 중 하나일 수 있다. 특히, 하나의 영상별로 하나의 신경망이 형 성되므로 저장 공간을 위해 숏텀 메모리를 사용하는 신경망이 더 적합할 수 있다. 따라서, 객체 검출 학습부는 입력부를 통해 입력되는 복수의 영상 각각에 대해, 각각의 영상을 별개 로 사용하여 학습을 수행하여 각각 사용되는 하나의 영상에 대응되는 복수의 신경망을 형성할 수 있다. 이렇게 형성되는 복수의 영상에 각각 대응되는 복수의 신경망이 복수의 학습 모델로서 각각 파일로서 생성된다.또한, 객체 검출 학습부는 입력부를 통해 새로운 영상이 추가로 입력되는 경우, 추가 영상에 대해 또 한 학습을 수행하여 추가 영상에 대응되는 신경망을 형성할 수 있다. 학습 모델 저장부는 객체 검출 학습부에 의해 하나의 영상별로 학습된 각 신경망에 대응되는 학습 모 델을 파일로서 저장한다. 따라서, 객체 검출 학습부를 통해 복수의 영상이 입력되는 경우 학습 모델 저장 부에는 입력되는 영상별로 각각 대응되는 학습 모델이 저장된다. 객체 검출부는 입력부를 통해 입력되는 영상에 대해 학습 모델 저장부에 저장된 복수의 학습 모 델을 사용하여 객체 검출을 수행한다. 구체적으로, 객체 검출부는 입력부를 통해 입력되는 영상에 대해 객체 검출 학습부에 의해 학습된 복수의 신경망, 즉 다중 신경망을 사용하고, 다중 신경망으로부터의 검출 결과를 종합하여 최종 객체 검출 결과를 결정할 수 있다. 출력부는 객체 검출부에 의해 결정되는 최종 객체 검출 결과를 출력한다. 구체적으로, 출력부 는 디스플레이, 스피커 등을 통해 최종 객체 검출 결과를 외부로 표시할 수 있다. 여기서, 디스플레이는 LED(Light Emitting Diode) 디스플레이, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diode) 디스플레이 등을 포함한다. 이와 같이, 본 발명의 실시예에서는 객체 검출 학습부가 하나의 영상별로 하나의 신경망을 형성함으로써, 이미 입력되어 학습이 수행된 영상 외에 추가 영상이 입력되더라도 이미 입력된 영상에 의해 학습된 신경망에 대해 추가 영상을 추가하여 재학습을 수행하지 않고, 추가된 영상에 대해서만 학습을 수행하여 대응되는 신경망 을 형성함으로써 영상 추가 등과 같이 리소스가 변경되거나 추가되는 경우에도 전체 망에 대한 재학습이 필요하 지 않게 된다. 한편, 추가 영상은 이미 학습된 영상과 동일 객체에 대해 추가되는 영상으로서, 카메라 등에 의해 동일 객체에 대해 짧은 시간동안 많은 수의 영상이 입력되므로 일정 수의 영상 입력에 대해서는 동일 객체 여부를 판단하지 않고 대응되는 신경망을 형성할 수 있다. 선택적으로, 일정 수의 영상이 입력되어 다중 신경망이 형성된 경우에는 그 후에 입력되는 영상에 대해서는 이 미 형성된 다중 신경망을 통해 동일 객체임이 검출된 후에만 해당 객체에 대응되는 학습을 수행하여 신경망을 추가로 형성할 수 있다. 도 2는 도 1에 도시된 객체 검출 학습부의 구체적인 구성을 도시한 도면이다. 도 2에 도시된 바와 같이, 객체 검출 학습부는 영상 변형부, 특징점 추출부 및 신경망부를 포함한다. 영상 변형부는 입력부로부터 입력되는 하나의 영상을 복수 형태의 영상으로 변형하여 출력한다. 이 때, 영상 변형부로 입력되는 원본 영상도 출력 영상 중 하나에 포함된다. 예를 들어, 영상 변형부는 입력되는 하나의 영상, 즉 한 장의 얼굴 영상에 대해 조명을 변화시키거나 조명되는 얼굴 방향을 변경하는 등의 영상 변형을 수행하여 입력 영상에 대응되는 복수의 변형된 영상을 출력할 수 있다. 이를 위해 영상 변형부 는 영상 변형을 수행하는 기능을 갖는 특정 알고리즘을 사용할 수 있다. 구체적으로, 영상 변형부는 외부에서 제공되는 알고리즘, 예를 들어 IBM사의 인공지능 기술인 왓슨(Watson)이나 구글사의 텐서플로우 (TesnorFlow)에서 제공하는 영상 변환 알고리즘을 사용하여 한 장의 입력 영상에 대해 영상 변형을 수행하여 복 수의 변형된 영상으로 출력할 수 있다. 이외에도, 영상 변형부는 이미 잘 알려져 있는 공지의 영상 변형 알고리즘을 사용하여 상기한 바와 같은 영상 변형을 수행할 수 있다. 특징점 추출부는 영상 변형부에서 출력되는 복수의 영상 각각에 대해 특징점들을 추출한다. 예를 들 어, 특징점 추출부는 영상 변형부에서 출력되는 복수의 영상별로 각각 50여개의 특징점들을 추출할 수 있다. 본 발명의 실시예에서는 얼굴 윤곽, 눈썹 등에서 점들을 뽑아내고 뽑아낸 점들의 모음을 특징점으로 칭한다. 최초의 학습 데이터의 학습을 위해서는 수작업으로 영상에 점들을 찍어서 데이터를 확보하지만, 이후 에는 원본 영상과 특징점들을 한 세트로 구성하여 학습 데이터를 만들고 이를 딥러닝(deep learning)(예를 들어 CNN)으로 학습하는 방식으로 영상에서 특징점을 추출할 수 있다. 신경망부는 특징점 추출부에서 추출된 영상별 특징점들을 사용하여 하나의 신경망을 형성한다. 이렇 게 형성되는 신경망으로는 상기한 바와 같이, CNN, R-CNN, LSTM 등이 될 수 있다. 도 3을 참조하여 CNN을 예로 들면, 합성곱 계층(Convolutional Layer), 완전 연결 계층(Fully Connected Layer) 및 분류 계층 로 이루어진다.합성곱 계층은 입력 영상으로부터 특징을 추출하는 역할을 수행한다. 이를 위해, 합성곱 계층은 합성곱 (convolution), 활성 함수(ReLU) 및 풀링(Pooling)으로 구성된다. 완전 연결 계층과 분류 계층은 합성곱 계층에서 추출되는 특징 값을 사용하여 분류를 수행한 다. 분류 계층에서는 Softmax 함수가 사용되며, 이러한 Softmax 함수는 전술한 ReLu와 같은 활성 함수의 일종 이다. 완전 연결 계층과 분류 계층으로 구성되는 신경망 부분은 CNN 이전의 기존의 신경망으로 이전 계층 의 모든 뉴런과 결합되어 있는 형태를 말한다. 상기한 CNN에 대해서는 이미 잘 알려져 있으므로 보다 구체적인 내용에 대해서는 생략한다. 한편, 객체 검출 학습부는 입력부로부터 짧은 시간안에 복수의 영상이 입력되는 경우 하나의 영상에 대응하는 객체 검출 학습을 수행하여 대응되는 신경망 학습 모델을 생성하여 학습 모델 저장부에 저장하는 시간 동안 다른 입력 영상을 저장하는 버퍼(도시하지 않음)를 더 포함할 수 있다. 이하, 도 4를 참조하여 상기한 객체 검출 학습부의 동작 예에 대해 설명한다. 도 4를 참조하면, 영상이 입력부로부터 출력되어 객체 검출 학습부로 입력되는 하나의 영상을 나타낸다. 입력되는 하나의 영상은 영상 변형부에 의해 복수의 영상, 도 4의 예에서는 5개 이상의 복수 영상 으로 변형되어 출력된다. 출력되는 5개 이상의 영상 중에는 입력 영상과 동일한 영상이 포함되어 있 음을 알 수 있다. 출력되는 5개의 영상별로 특징점 추출부에 의해 각각 특징점이 추출된다. 영상은 특징점 추출부 에 의해 특징점이 추출된 영상을 나타낸다. 만약 영상 변형부에서 하나의 입력 영상에 대해 예를 들어 4개의 영상으로 변형하여 총 5개의 영상을 출력하고, 특징점 추출부가 5개의 영상 각각에 대해 50개의 특징점들을 추출하는 경우 총 250개의 특징점 들이 추출된다. 그리고, 특징점 추출부에 의해 추출된 특징점들의 데이터가 신경망부로 입력되어 학습을 통해 결과적 으로 하나의 입력 영상에 대응되는 하나의 신경망, 예를 들어 하나의 CNN이 형성된다. 여기서, 신경망 에 의해 출력되는 신뢰도(Confidence)는 신경망의 학습 결과에 따른 객체 검출의 신뢰도를 나타낸다. 그리고, 상기와 같이 형성된 하나의 영상에 대응되는 하나의 신경망은 하나의 파일인 학습 모델로서 학습 모델 저장부에 저장된다. 따라서, 입력부로부터 복수의 영상이 시계열적으로 하나씩 객체 검출 학습부로 입력되고, 객체 검출 학습부는 하나씩 입력되는 영상별로 객체 검출 학습을 수행하여 형성되는 신경망을 학습 모델 저장부(13 0)에 저장할 수 있다. 예를 들어, 도 4에서는 하나의 영상에 대해 객체 검출 학습을 수행하여 하나의 신경망을 형성하는 내용이 도시되어 있으며, 도 5를 참조하면 T0 프레임(frame), T1 프레임, T2 프레임, T3 프레임 순으 로 시계열적으로 영상(301, 302, 303, 304)이 입력되면, 객체 검출 학습부는 각 프레임별 영상(301, 302, 303, 304)에 대해 도 4에 도시된 바와 같은 객체 검출 학습을 각각 수행하여 대응되는 신경망을 형성할 수 있다. 이와 같이, 학습 모델 저장부에는 입력부로부터 객체 검출 학습부로 입력된 영상의 개수에 해당 하는 개수의 신경망에 대응되는 학습 모델의 파일이 저장된다. 이 때, 입력부에서 객체 검출 학습부(12 0)로 입력되는 모든 영상에 대해 대응되는 신경망을 형성하지 않을 수도 있다. 예를 들어, 입력부에서 짧 은 시간 동안 많은 수의 영상이 입력되는 경우 동일 객체에 대응되는 영상으로서 각 영상간 변화가 거의 없는 영상일 가능성이 있다. 따라서, 입력 영상간의 변화율이 임계값보다 커서 영상간의 변화가 큰 경우에 해당하는 영상에 대해서만 객체 검출 학습을 수행하여 대응되는 신경망을 형성할 수도 있다. 도 6은 도 1에 도시된 객체 검출부의 구체적인 구성을 도시한 도면이다. 도 6에 도시된 바와 같이, 객체 검출부는 대상 영상 저장부, 학습 모델별 객체 검출부 및 결정 엔진을 포함한다.대상 영상 저장부는 입력부를 통해 입력되는 검출 대상의 객체 영상을 대상 영상으로 저장한다. 학습 모델별 객체 검출부는 대상 영상 저장부에 저장된 대상 영상에 대해 학습 모델 저장부에 저장된 복수의 학습 모델을 사용하여 대상 영상에 대응되는 객체 검출을 수행한다. 결정 엔진은 학습 모델별 객체 검출부에서 복수의 학습 모델별로 각각 수행된 객체 검출 결과를 사용 하여 최종 객체 검출 결과를 결정하여 출력부로 전달한다. 여기서, 결정 엔진은 의사 결정 규칙과 그 결과들을 트리 구조로 도식화한 의사 결정 지원 도구의 일종인 결정 트리(Decision Tree)를 사용하여 복수의 학습 모델별로 각각 수행된 객체 검출 결과에 따른 최종 객체 검출 결과를 결정할 수 있다. 구체적으로, 객체 검출부의 구성 예를 도시한 도 7을 참조하면, 학습 모델별 객체 검출부에서 복수의 학습 모델(131, 132, 133)을 사용하여 대상 영상에 대응되는 객체 검출을 수행한 후에 출력되는 객체 검출 결과는 검출된 객체 정보와 신뢰도(Confidence)이다. 이 때, 객체가 검출되지 않은 경우도 있을 수 있고, 이 때의 신뢰도는 미리 설정된 임계값보다 낮을 것이다. 반대로, 신뢰도가 미리 설정된 임계값 이상인 경우에는 객체가 검출되었고 검 출된 객체를 나타내는 정보가 검출된 객체 정보로서 설정되어 출력된다. 따라서, 결정 엔진은 학습 모델별 객체 검출부에서 출력되는 학습 모델별 검출된 객체 정보와 신뢰도 를 사용하여 최종 객체 검출 결과를 결정할 수 있다. 예를 들면, 결정 엔진은 복수의 학습 모델별로 객체 검출 수행된 결과 중 복수의 신뢰도가 미리 설정된 제1 개수, 예를 들어 전체 신뢰도 개수에 대해 미리 설정된 제1 백분율 이상인 개수이고, 그 중에서 각 신뢰도에 대응되는 검출된 객체 정보가 동일한 객체를 나타내는 개 수가 미리 설정된 제2 개수, 예를 들어 대상 신뢰도 총 개수에 대해 미리 설정된 제2 백분율이상인 개수인 경우 해당 검출된 객체를 최종 검출된 객체로서 결정할 수 있다. 이외에도 본 발명의 실시예에 따른 객체 검출을 특 정할 수 있는 다른 결정 방식이 적용될 수 있다. 이와 같이, 본 발명의 실시예에 따른 객체 검출 장치에 따르면, 하나의 영상, 구체적으로 하나의 사진당 하나의 신경망을 형성하고 이것을 하나의 학습 모델인 하나의 파일로서 저장할 수 있으므로 새로운 영상이 추가 되는 경우 추가되는 영상에 대해서만 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성할 수 있다. 예를 들어, 파일을 저장하는 컴퓨터 장치의 메모리가 지원되는 경우 몇 천개를 넘어 심지어 몇 만개의 신경망이 대응되는 파일 어레이로써 저장될 수 있다. 따라서, 생성되는 신경망의 수가 매우 많아져도 이전의 기억을 보존할 수 있으므로, 이러한 많은 다중 신경망들 을 사용하게 되면 기존의 짧은 기억만을 사용하는 신경망에 비해 보다 정확한 객체 검출이 수행될 수 있다. 또한, 다수의 시계열 영상 중에서 특정 구간(윈도우)의 영상만을 사용하여 영상별 다중 신경망을 형성할 수도 있다. 다음, 본 발명의 실시예에 따른 객체 검출 학습 방법에 대해 설명한다. 도 8은 본 발명의 실시예에 따른 객체 검출 학습 방법의 개략적인 흐름도이다. 본 발명의 실시예에 따른 객체 검출 학습 방법은 구체적으로 객체 검출 학습부에 의해 수행될 수 있다. 도 8을 참조하면, 먼저, 입력부를 통해 객체 검출 학습 대상의 영상이 입력되는지를 판단한다(S100). 만약 입력부로부터 객체 검출 학습 대상의 영상 입력이 입력되면, 입력된 영상 중 하나의 영상에 대해 영 상 변형을 수행하여 영상 변형의 대상인 영상을 포함하는 복수의 영상을 생성한다(S110). 여기서, 상기 영상 변형에 대해서는 상기한 도 2 및 도 4를 참조하여 설명한 내용을 참조한다. 그 후, 상기 단계(S110)에서 생성되는 복수의 변형 영상별로 특징점을 추출한다(S120). 여기서, 상기 특징점 추출에 대해서도 상기한 도 2 및 도 4를 참조하여 설명한 내용을 참조한다. 다음, 상기 단계(S120)에서 추출되는 특징점들을 사용하여 상기 단계(S100)에서 입력된 하나의 영상에 대응되는 하나의 신경망을 형성한다(S130). 여기서, 상기 특징점 추출에 대해서도 상기한 도 2 및 도 4를 참조하여 설명 한 내용을 참조한다. 그 후, 상기 단계(S130)에서 형성되는 하나의 신경망에 해당되는 학습 모델을 하나의 파일로써 학습 모델 저장 부에 저장한다(S140). 이렇게 함으로써 입력부를 통해 입력되는 하나의 영상에 대응되는 객체 검출 학습을 위한 하나의 신경망 모델이 파일로서 학습 모델 저장부에 저장될 수 있다.그 후, 상기 단계(S100)에서 입력된 영상들 중에 객체 검출 학습 처리되어 신경망을 형성하지 않은 미처리 영상 이 남아 있는지를 판단한다(S150). 만약 미처리 영상이 남아 있으면 상기한 단계(S110, S120, S130, S140)를 반복 수행하여 미처리 영상이 존재하 지 않을 때까지 하나의 영상에 대한 객체 검출 학습 모델에 대응되는 신경망을 형성한다. 그러나, 미처리 영상이 남아 있지 않으면 본 발명의 실시예에 따른 객체 검출 학습 과정을 종료한다. 다음, 본 발명의 다른 실시예에 따른 객체 검출 학습 방법에 대해 설명한다. 도 9는 본 발명의 다른 실시예에 따른 객체 검출 학습 방법의 개략적인 흐름도이다. 본 발명의 실시예에 따른 객체 검출 학습 방법은 구체적으로 객체 검출부에 의해 수행될 수 있다. 도 9를 참조하면, 먼저 하나의 영상에 대해 하나의 신경망 학습 모델을 생성하는 처리를 카운트하는 카운터를 초기화한다(S200). 그 후, 하나의 영상이 입력되면(S210), 카운터의 값이 일정 카운터 값에 도달하였는지를 판단한다(S220). 만약 카운터의 값이 미리 설정된 일정 카운터 값에 도달하지 않았으면, 상기 단계(S210)에서 입력된 하나의 영 상에 대한 하나의 신경망 모델을 생성하는 처리를 수행한다(S230). 여기서, 하나의 영상에 대한 하나의 신경망 모델을 생성하는 처리는 상기한 도 8에서 설명된 단계(S110, S120, S130, S140, S150)를 통한 처리와 동일하므 로 여기에서는 구체적인 설명을 생략한다. 그 후, 카운터의 값을 증가시킨다(S240). 구체적으로 하나의 영상에 대한 하나의 신경망 학습 모델의 생성이 완료되었으므로 카운터의 값을 1만큼 증가시킨다. 다음, 미처리 영상이 남아 있는지를 판단하고(S250), 만약 남아 있으면 영상을 입력하는 상기 단계(S210)부터 반복 수행한다. 한편, 상기 단계(S200, S210, S220, S230), S240)의 반복 수행을 통해 다수의 영상에 대해 다중 신경망 학습 모 델이 생성되어 카운터의 값이 일정 카운터의 값에 도달하게 된다. 따라서, 상기 단계(S220)에서 카운터의 값이 미리 설정된 일정 카운터의 값에 도달하였으므로, 상기 단계(S200, S210, S220, S230), S240)를 통해 생성된 다중 신경망 학습 모델을 사용하여 하나의 입력된 영상에 대한 객체 검출을 수행한다(S260). 그 후, 동일한 객체가 검출되었는지를 판단하고(S270), 동일한 객체가 검출된 것으로 판단되면 하나의 입력 영 상에 대해 대응되는 하나의 신경망 모델 학습 생성 처리를 수행한다(S280). 그리고, 다시 미처리된 영상이 남아 있는지를 판단하고(S290), 미처리 영상이 남아 있으면 하나의 영상을 입력 받아서(S300) 미처리 영상에 대응되는 하나의 신경망 학습 모델 생성 처리를 수행하는 상기 단계(S260)부터 다 시 수행하며, 이러한 과정은 미처리 영상이 남지 않을 때까지 반복된다. 한편, 상기 단계(S270)에서 동일 객체가 검출되지 않았으면 새로운 객체 검출 학습이 수행될 수 있으며, 이러한 새로운 객체 검출 학습에 대해서는 상기한 도 8과 도 9를 참조하여 동일하게 수행될 수 있으므로 여기에서는 구 체적인 설명을 생략한다. 그리고, 상기 단계(S250, S290)에서 미처리 영상이 남아 있지 않으면 새로운 영상이 입력될 때까지 객체 검출 학습 과정이 종료된다. 다음, 본 발명의 실시예에 따른 다중 신경망을 활용한 객체 검출 방법에 대해 설명한다. 도 10은 본 발명의 실시예에 따른 객체 검출 방법의 개략적인 흐름도이다. 본 발명의 실시예에 따른 객체 검출 방법은 구체적으로 객체 검출부에 의해 수행될 수 있다. 도 10을 참조하면, 먼저 객체 검출을 수행하기 위한 대상 영상을 입력받는다(S400). 그 후, 객체 검출을 수행하기 위해 상기한 도 8 및 도 9를 통해 생성되어 학습 모델 저장부에 저장된 다중 신경망 학습 모델을 획득한다(S410). 그리고, 획득된 다중 신경망 학습 모델별로 상기 입력된 대상 영상에 대해 객체 검출을 수행한다(S420). 여기 서 본 단계(S420)에서의 객체 검출 내용에 대해서는 상기한 도 6 및 도 7을 참조하여 설명한 내용을 참조한다.그 후, 다중 신경망 학습 모델별로 각각 수행된 후의 객체 검출 결과, 예를 들어 검출된 객체 정보와 신뢰도를 사용하여 최종 객체 검출을 수행한다(S430). 여기서 본 단계(S430)에서의 최종 객체 검출 내용에 대해서는 상 기한 도 6 및 도 7을 참조하여 설명한 내용을 참조한다. 그리고, 상기 단계(S430)에서 수행된 최종 객체 검출 결과를 출력부를 통해 외부로 출력한다(S440). 다음, 본 발명의 다른 실시예에 따른 객체 검출 장치에 대해 설명한다. 도 11은 본 발명의 다른 실시예에 따른 객체 검출 장치의 개략적인 구성 블록도이다. 도 11을 참조하면, 본 발명의 다른 실시예에 따른 객체 검출 장치는 입력기, 출력기, 메모리 , 프로세서 및 버스를 포함한다. 입력기는 객체 검출 대상의 영상을 입력받거나 또는 카메라을 통해 촬영되는 영상을 입력받는다. 또한, 입력기는 사용자의 제어 명령 등을 입력받을 수 있다. 이러한 입력기로는 키보드, 마우스, 터 치패드 등이 포함된다. 출력기는 외부로 영상을 출력한다. 이러한 영상은 객체 검출 결과를 표시한 영상일 수 있다. 또한, 출력기는 객체 검출 장치의 상태를 표시하기 위해 음성이나 문자 등을 출력할 수 있다. 이러 한 출력기로는 LED(Light Emitting Diode) 디스플레이, LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diode) 디스플레이, 스피커 등이 포함된다. 메모리는 코드의 집합을 저장하도록 구성되고, 그 코드는 다음과 같은 동작을 실행하기 위해 프로세서 를 제어하는 데 사용된다. 이러한 동작은, 입력기를 통해 영상을 입력받는 동작, 하나의 영상을 사 용하여 객체 검출 학습을 수행하여 대응되는 하나의 신경망을 형성하는 동작, 형성되는 하나의 신경망에 해당하 는 학습 모델을 파일로서 저장하는 동작, 입력기를 통해 입력되는 영상에 대해 다중 신경망을 활용하여 객 체 검출을 수행하는 동작, 객체 검출 결과를 출력하는 동작을 포함한다. 구체적으로, 상기한 동작은 입력기를 통해 입력되는 하나의 영상을 복수의 영상으로 변형하는 동작, 변형 된 복수의 영상 각각에 대해 특징점을 추출하는 동작, 추출되는 특징점들을 사용하여 하나의 신경망을 형성하는 동작을 추가로 포함한다. 또한, 상기한 동작은 입력기를 통해 입력되는 영상에 대해 다중 신경망별로 객체 검출을 수행하는 동작, 다중 신경망별로 수행된 객체 검출 결과를 사용하여 최종 객체 검출을 수행하는 동작을 추가로 포함한다. 또한, 메모리는 상기한 동작에 의해 형성되는 신경망의 학습 모델을 파일로서 추가로 저장할 수 있다. 이러한 메모리는 ROM(Read Only Memory)과 RAM(Random Access Memory), NVRAM(Non-Volatile Random Access Memory)을 포함할 수 있다. 또한, 프로세서는 컨트롤러(controller), 마이크로 컨트롤러 (microcontroller), 마이크로 프로세서(microprocessor), 마이크로 컴퓨터(microcomputer) 등으로도 호칭될 수 있다. 또한, 프로세서는 하드웨어(hardware) 또는 펌웨어(firmware), 소프트웨어, 또는 이들의 결합에 의 해 구현될 수 있다. 버스는 객체 검출 장치의 모든 구성요소들, 즉 입력기, 출력기, 메모리 및 프로세서 를 결합하도록 구성된다. 한편, 본 발명의 다른 실시예에 따른 객체 검출 장치는 통신기(도시하지 않음)를 더 포함할 수 있다. 통신기(도시하지 않음)는 외부의 서버와의 신호 전송을 수행한다. 외부의 서버는 영상 변형을 위해 사용되는 알고리즘을 제공하거나 또는 영상으로부터 특징점을 추출하는데 사용되는 알고리즘을 제공한다. 따라서, 메모 리는 통신기(도시하지 않음)를 통해 외부의 서버로부터 제공되는 알고리즘을 수행하는 동작을 추가로 수행 하기 위해 대응되는 코드를 저장할 수 있다. 이상에서 설명한 본 발명의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 발명의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2017-0154240", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 객체 검출 장치의 개략적인 구성도이다. 도 2는 도 1에 도시된 객체 검출 학습부의 구체적인 구성을 도시한 도면이다. 도 3은 도 2에 도시된 신경망부가 형성하는 신경망 중 CNN의 예를 도시한 도면이다. 도 4는 도 1에 도시된 객체 검출 학습부의 동작 예를 도시한 도면이다. 도 5는 도 1에 도시된 객체 검출 학습부가 시계열 프레임 입력 영상을 사용하여 다중 신경망을 형성하는 예를 도시한 도면이다. 도 6은 도 1에 도시된 객체 검출부의 구체적인 구성을 도시한 도면이다. 도 7은 도 6에 도시된 객체 검출부의 구체적인 예를 도시한 도면이다. 도 8은 본 발명의 실시예에 따른 객체 검출 학습 방법의 개략적인 흐름도이다. 도 9는 본 발명의 다른 실시예에 따른 객체 검출 학습 방법의 개략적인 흐름도이다. 도 10은 본 발명의 실시예에 따른 객체 검출 방법의 개략적인 흐름도이다. 도 11은 본 발명의 다른 실시예에 따른 객체 검출 장치의 개략적인 구성 블록도이다."}
