{"patent_id": "10-2023-0060671", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0163432", "출원번호": "10-2023-0060671", "발명의 명칭": "관수제어 장치, 방법 및 시스템", "출원인": "조대형", "발명자": "조대형"}}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관수제어 시스템에 있어서,토양수분 데이터를 획득하는 센서부;기상예보 데이터를 획득하는 통신부;상기 토양수분 데이터 및 상기 기상예보 데이터에 기초하여 관수장치를 제어하는 제어부; 및상기 제어부 및 상기 관수장치로 전달할 에너지를 생성하는 에너지 발전부를 포함하고, 상기 센서부는 토양수분 센서를 포함하는,관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 센서부는 토양 내 염류농도 데이터를 획득하는 염농도 센서를 더 포함하고, 상기 제어부는 상기 토양수분 데이터, 상기 염류농도 데이터 및 상기 기상예보 데이터에 기초하여 상기 관수장치를 제어하는, 관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 관수장치는 배수로와 펌프를 포함하고, 상기 제어부의 제어에 의해 상기 배수로 및 상기 펌프를 이용하여물을 공급하거나 회수하는,관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 에너지 발전부는 친환경 발전 방식으로 전기 에너지를 생산하여, 배터리를 포함하는 에너지 저장부로 공급하는, 관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는 상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터에 따라 요구되는 관수량, 상기 기상예보데이터에 따라 예측되는 기상에 의한 관수 공급량, 또는 상기 기상예보 데이터에 따라 예측되는 친환경 방식의발전 전력량에 기초하여, 상기 관수장치를 제어하는, 관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,공개특허 10-2024-0163432-3-상기 에너지 저장부는 폐배터리를 포함하는, 관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 친환경 발전 방식은 태양광 발전 방식, 태양열 발전 방식, 풍력 발전 방식, 조력 발전 방식, 파력 발전 방식 중 어느 하나 이상을 포함하는, 관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서,상기 관수장치는 물을 저장할 수 있는 저장 탱크를 포함하고, 상기 제어부는 토양에 수분이 과다하다고 식별할 경우, 상기 배수로 및 상기 펌프를 이용하여 물을 회수하여 상기 회수한 물을 상기 저장 탱크에 저장하고, 토양에 수분이 부족하거나 염류농도가 과다하다고 식별할 경우, 상기 배수로 및 상기 펌프를 이용하여 상기 저장 탱크에 저장된 물을 토양에 공급하는, 관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,상기 제어부는 상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터 및 상기 기상예보 데이터에 기초하여,인공지능 알고리즘을 이용하여 학습된 신경망 모델을 이용하여 결정된 관수제어 정보에 기초하여 상기 관수장치를 제어하는,관수제어 시스템."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "관수제어 방법에 있어서,수분센서를 이용하여 토양수분 데이터를 획득하는 단계;외부 서버로부터 기상예보 데이터를 획득하는 단계; 및상기 토양수분 데이터 및 상기 기상예보 데이터에 기초하여 관수장치를 제어하는 단계;를 포함하고,상기 관수장치는 자체적인 에너지 발전부로부터 획득한 에너지에 기초하여 동작하는,관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 관수제어 방법은, 염농도 센서를 이용하여 토양 내 염류농도 데이터를 획득하는 단계를 더 포함하고, 상기 관수장치를 제어하는 단계는,상기 토양수분 데이터, 상기 염류농도 데이터 및 상기 기상예보 데이터에 기초하여 상기 관수장치를 제어하는, 관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 관수장치를 제어하는 단계는,상기 관수장치에 포함된 배수로와 펌프를 이용하여 물을 공급하거나 회수하는 단계를 포함하는,공개특허 10-2024-0163432-4-관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 에너지 발전부는 친환경 발전 방식으로 전기 에너지를 생산하여, 배터리를 포함하는 에너지 저장부로 공급하는,관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 관수장치를 제어하는 단계는,상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터에 따라 요구되는 관수량, 상기 기상예보 데이터에 따라예측되는 기상에 의한 관수 공급량, 또는 상기 기상예보 데이터에 따라 예측되는 친환경 방식의 발전 전력량에기초하여, 상기 관수장치를 제어하는,관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 에너지 저장부는 폐배터리를 포함하는, 관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 친환경 발전 방식은 태양광 발전 방식, 태양열 발전 방식, 풍력 발전 방식, 조력 발전 방식, 파력 발전 방식 중 어느 하나 이상을 포함하는, 관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서, 상기 관수장치를 제어하는 단계는,토양에 수분이 과다할 경우, 상기 배수로 및 상기 펌프를 이용하여 물을 회수하여 상기 회수한 물을 상기 관수장치에 포함된 저장 탱크에 저장하고, 토양에 수분이 부족하거나 염류농도가 과다할 경우, 상기 배수로 및 상기펌프를 이용하여 상기 저장 탱크에 저장된 물을 토양에 공급하는 단계를 포함하는, 관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13항에 있어서, 상기 관수장치를 제어하는 방법은,상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터 및 상기 기상예보 데이터에 기초하여, 인공지능 알고리즘을 이용하여 학습된 신경망 모델을 이용하여 결정된 관수제어 정보에 기초하여 상기 관수장치를 제어하는 단계를 포함하는,관수제어 방법."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예는 토양수분 데이터를 획득하는 센서부; 기상예보 데이터를 획득하는 통신부; 상기 토양수분 데이터 및 상기 기상예보 데이터에 기초하여 관수장치를 제어하는 제어부; 및 상기 제어부 및 상기 관수장치로 에너지를 전달하는 에너지 발전부를 포함하는 관수제어 장치, 방법 및 시스템을 제공하고자 한다."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 관수제어 장치, 방법 및 시스템에 관한 것으로, 보다 구체적으로, 토양의 수분 데이터, 염류 데이터, 기상 데이터 등과 같은 다양한 데이터를 수집하여, 이를 기초로 수분 공급을 효율적으로 제어하는 관수제어 장치, 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "작물의 생산을 제한하는 요인 중에서 가장 크게 영향을 미치는 것 중 하나는 물의 공급이다. 즉, 작물 재배 시 토양의 수분을 적절히 유지시켜주는 것은 매우 중요하며, 이에 따라 관수작업에 많은 시간과 노동력이 소요되고 있다. 예를 들어, 효율적인 관수작업을 수행할 수 있도록 관수자동제어시스템이 개발되고 있으며, 이러한 관수 자동제어시스템은 지역 발전소로부터 전기를 공급받아 정해진 관수시간에 맞추어 작업이 수행되도록 구동될 수 있다. 다만, 이와 같이 지역 발전소에서 형성된 전기를 공급받는 관수자동제어시스템의 경우, 전력선 설치 작업 이 불가능하여 발전소로부터 전기를 공급받을 수 없는 지역이나, 도심 속과 같이 감전사고 위험이 높아 전기배 선이 힘든 지역에서는 사용하기 어려운 한계가 있다. 또한, 미리 정해진 시간에 관수작업이 수행되는 관수자동 제어시스템의 경우에는, 폭설이나 소나기와 같은 기상현상에 대응하여 적절한 관수량을 공급할 수 없고, 이를 해결하기 위해서는 관리자가 재배지를 직접 방문하여 토양의 상태를 확인해야 하는 문제점이 있었다. 결국, 종래 기술에 따르면, 전기배선이 어려운 지역에서 사용할 수 있고, 더 나아가 다양한 데이터를 수집하여 수분 공급을 효율적으로 제어하기 어려운 문제점이 있었고, 본 개시는 이를 해결하기 위한 것이다."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 실시예는 토양의 수분 데이터, 염류 데이터, 기상 데이터 등 다양한 데이터를 수집 및 활용하여 수분 공급을 효율적으로 제어하는 관수제어 장치, 방법 및 시스템을 제공하기 위한 것이다. 본 개시의 일 실시예는 전기배선이 어려운 지역에서 사용 가능한 관수제어 장치, 방법 및 시스템을 제공하기 위 한 것이다."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예는 토양의 수분 데이터, 염류 데이터, 기상 데이터 등을 수집 및 활용하여 수분 공급을 효 율적으로 제어하는 관수제어 장치, 방법 및 시스템을 제공하고자 한다. 일 실시예에서, 토양수분 데이터를 획득하는 센서부; 기상예보 데이터를 획득하는 통신부; 상기 토양수분 데이 터 및 상기 기상예보 데이터에 기초하여 관수장치를 제어하는 제어부; 및 상기 제어부 및 상기 관수장치로 전달 할 에너지를 생성하는 에너지 발전부를 포함하고, 상기 센서부는 토양수분 센서를 포함할 수 있다. 일 실시예에서, 상기 센서부는 토양 내 염류농도 데이터를 획득하는 염농도 센서를 더 포함하고, 상기 제어부는 상기 토양수분 데이터, 상기 염류농도 데이터 및 상기 기상예보 데이터에 기초하여 상기 관수장치를 제어할 수 있다. 일 실시예에서, 상기 관수장치는 배수로와 펌프를 포함하고, 상기 제어부의 제어에 의해 상기 배수로 및 상기 펌프를 이용하여 물을 공급 및 회수할 수 있다. 일 실시예에서, 상기 에너지 발전부는 친환경 발전 방식으로 전기 에너지를 생산하여, 배터리를 포함하는 에너 지 저장부로 공급할 수 있다. 일 실시예에서, 상기 제어부는 상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터에 따라 요구되는 관수량, 상기 기상예보 데이터에 따라 예측되는 기상에 의한 관수 공급량, 또는 상기 기상예보 데이터에 따라 예측되는 친환경 방식의 발전 전력량에 기초하여 관수장치를 제어할 수 있다. 일 실시예에서, 상기 에너지 저장부는 폐배터리를 포함할 수 있다. 일 실시예에서, 상기 친환경 발전 방식은 태양광 발전 방식, 태양열 발전 방식, 풍력 발전 방식, 조력 발전 방 식, 파력 발전 방식 중 어느 하나 이상을 포함할 수 있다. 일 실시예에서, 상기 관수장치는 물을 저장할 수 있는 저장 탱크를 포함하고, 상기 제어부는 토양에 수분이 과다하다고 식별할 경우, 상기 배수로 및 상기 펌프를 이용하여 물을 회수하여 상 기 회수한 물을 상기 저장 탱크에 저장하고, 토양에 수분이 부족하거나 염류농도가 과다하다고 식별할 경우, 상기 배수로 및 상기 펌프를 이용하여 상기 저장 탱크에 저장된 물을 토양에 공급할 수 있다. 일 실시예에서, 상기 제어부는 상기 토양수분 데이터, 상기 염류농도 데이터 및 상기 기상예보 데이터에 기초하 여, 인공지능 알고리즘을 이용하여 학습된 신경망 모델을 이용하여 결정된 관수제어 정보에 기초하여 상기 관수 장치를 제어할 수 있다. 본 개시의 일 실시예는 수분센서를 이용하여 토양수분 데이터를 획득하는 단계; 외부 서버로부터 기상예보 데이 터를 획득하는 단계; 및 상기 토양수분 데이터 및 상기 기상예보 데이터에 기초하여 관수장치를 제어하는 단 계;를 포함하고, 상기 관수장치는 자체적인 에너지 발전부로부터 획득한 에너지에 기초하여 동작하는, 관수제어 방법을 제공하고자 한다. 일 실시예에서, 상기 관수제어 방법은, 염농도 센서를 이용하여 토양 내 염류농도 데이터를 획득하는 단계를 더 포함하고, 상기 관수장치를 제어하는 단계는, 상기 토양수분 데이터, 상기 염류농도 데이터 및 상기 기상예보 데이터에 기초하여 상기 관수장치를 제어하는 단계를 포함할 수 있다. 일 실시예에서, 상기 관수장치를 제어하는 단계는, 상기 관수장치에 포함된 배수로와 펌프를 이용하여 물을 공 급하거나 회수하는 단계를 포함할 수 있다. 일 실시예에서, 상기 관수장치를 제어하는 단계는, 상기 에너지 발전부는 친환경 발전 방식으로 전기 에너지를 생산하여, 배터리를 포함하는 에너지 저장부로 공급하는 단계를 포함할 수 있다. 일 실시예에서, 상기 관수장치를 제어하는 단계는, 상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터에 따라 요구되는 관수량, 상기 기상예보 데이터에 따라 예측되는 기상에 의한 관수 공급량, 또는 상기 기상예보 데이터에 따라 예측되는 친환경 방식의 발전 전력량에 기초하여, 상기 관수장치를 제어하는 단계를 포함할 수 있다. 일 실시예에서, 상기 에너지 저장부는 폐배터리를 포함할 수 있다. 일 실시예에서, 상기 친환경 발전 방식은 태양광 발전 방식, 태양열 발전 방식, 풍력 발전 방식, 조력 발전 방 식, 파력 발전 방식 중 어느 하나 이상을 포함할 수 있다. 일 실시예에서, 상기 관수장치를 제어하는 단계는, 토양에 수분이 과다할 경우, 상기 배수로 및 상기 펌프를 이 용하여 물을 회수하여 상기 회수한 물을 상기 관수장치에 포함된 저장 탱크에 저장하고, 토양에 수분이 부족하 거나 염류농도가 과다할 경우, 상기 배수로 및 상기 펌프를 이용하여 상기 저장 탱크에 저장된 물을 토양에 공 급하는 단계를 포함할 수 있다. 일 실시예에서, 상기 관수장치를 제어하는 방법은, 상기 에너지 저장부의 충전 상태, 상기 토양수분 데이터, 상 기 염류농도 데이터, 및 상기 기상예보 데이터에 기초하여, 인공지능 알고리즘을 이용하여 학습된 신경망 모델 을 이용하여 결정된 관수제어 정보에 기초하여 상기 관수장치를 제어하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 친환경 발전 장치와 연동하여 에너지 자립형 관수제어 장치, 방법 및 시스템이 제공될 수 있다. 또한, 본 개시의 일 실시예에 따르면 토지의 기상 정보 또는 토양의 수분 정보를 이용하여 최적의 관수량을 산 출하는 관수제어 장치, 방법 및 시스템이 제공될 수 있다. 또한, 본 개시의 일 실시예에 따르면 관수 관리가 자동화되어 인력 소모가 줄어들고, 물 사용량이 절약될 수 있 다. 또한, 본 개시의 일 실시예에 따르면 폐배터리를 활용한 관수제어 장치, 방법 및 시스템이 제공될 수 있다."}
{"patent_id": "10-2023-0060671", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 기술적 사상을 명확하게 하기 위하여 첨부된 도면을 참조하여 본 개시의 실시예를 상세하게 설명하도 록 한다. 본 개시를 설명함에 있어서, 관련된 공지 기능 또는 구성요소에 대한 구체적인 설명이 본 개시의 요지 를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략할 것이다. 도면들 중 실질적으로 동일한 기능구성을 갖는 구성요소들에 대하여는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 참조번호들 및 부 호들을 부여하였다. 설명의 편의를 위하여 필요한 경우에는 장치와 방법을 함께 서술하도록 한다. 본 개시의 각 동작은 반드시 기재된 순서대로 수행되어야 할 필요는 없고, 병렬적, 선택적, 또는 개별적으로 수행될 수 있다. 본 개시의 실시예들에서 사용되는 용어는 본 개시의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용 어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라 질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 실시예의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 명세서에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시 전체에서 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. \"포 함하다\" 또는 \"가지다\" 등의 용어는 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함 을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 즉, 본 개시 전체에서 어 떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하 는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. \"적어도 하나의\"와 같은 표현은, 구성요소들의 리스트 전체를 수식하고, 그 리스트의 구성요소들을 개별적으로 수식하지 않는다. 예를 들어, \"A, B, 및 C 중 적어도 하나\" 및 \"A, B, 또는 C 중 적어도 하나\"는 오직 A, 오직 B, 오직 C, A와 B 모두, B와 C 모두, A와 C 모두, A와 B와 C 전체, 또는 그 조합을 가리킨다. 또한, 본 개시에 기재된 \"..부\", \"..모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하 며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 본 개시 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우 뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분 이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 개시 전체에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합한(suitable for)\", \"~하는 능력을 가지는(having the capacity to)\", \"~하도록 설계된(designed to)\", \"~ 하도록 변경된(adapted to)\", \"~하도록 만들어진(made to)\", 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사 용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 시스템\"이라는 표현은, 그 시스템이 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C 를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로 세서), 또는 메모리에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있 는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 개시의 일 실시예는 토양 내 수분, 염류농도 등 센서 데이터, 기상예보 데이터 및 에너지 저장 데이터를 이 용하여 수분 공급을 효율적으로 제어하는 관수제어 장치, 방법 및 시스템을 제공하고자 한다. 또한, 본 개시의 일 실시예는 친환경 발전 장치와 연동된 에너지 자립형 관수제어 장치, 방법 및 시스템을 제공 하고자 한다. 또한, 본 개시의 일 실시예는 관수 관리 자동화를 통해 인력 소모를 줄이고, 물 사용량을 절약하며, 적절한 관 수 시기에 적절한 관수량을 제공할 수 있는 관수제어 장치, 방법 및 시스템을 제공할 수 있다. 또한, 본 개시의 일 실시예는 폐배터리를 활용한 관수제어 장치, 방법 및 시스템을 제공할 수 있다. 도 1은 본 개시의 일 실시예에 따른 관수제어 시스템의 구성을 도시한 구성도이다. 도 1을 참조하면, 본 개시의 일 실시예에 따른 관수제어 시스템은 제어부, 센서부, 관수장치 , 통신부, 에너지 발전부 및 에너지 저장부를 포함할 수 있다. 일 실시예에 따른 관수제어 시스템은 외부 전력망에 별개로 동작할 수 있도록 자체적인 에너지 발전부(50 0)를 포함하고, 에너지 발전부에서 생산되는 전력에 기초하여 관수장치를 작동할 수 있다. 일 실시예 에서, 제어부, 센서부 또는 통신부도 에너지 발전부에서 생산되는 전력에 의하여 동작할 수 있다. 일 실시예에 따른 관수제어 시스템은 에너지 발전부에서 생산한 전력을 저장할 수 있는 에너 지 저장부를 포함할 수 있다. 일 실시예에서, 에너지 발전부가 전기 에너지를 생산하는 경우, 에너지 저장부는 전기 에너지의 저장 을 위한 배터리를 포함할 수 있다. 특히, 에너지 저장부의 예시로 전기 자동차 등에 사용되다가 충전 능력 의 저하로 교체된 폐배터리가 활용될 수 있다. 예를 들어, 전기 자동차용 배터리는 배터리의 충전 능력이 일정 기준 이하로 떨어지면 주행거리가 감소되고, 충전 속도가 저하되는 등 성능 열화로 인해 배터리 교체가 요구된 다. 그러나, 전기 자동차에서 제거된 폐배터리는 전기 자동차에서 사용하기에는 충전 능력이 적합하지 않지만 다른 용도로 사용하기에는 충분한 충전 능력을 가지고 있어 폐배터리가 ESS(Energy Storage System) 및 UPS(Uninterruptible Power Supply)로 활용될 수 있다. 본 개시의 관수제어 시스템의 에너지 저장부 에도 전기 에너지 저장을 위하여 폐배터리가 활용될 수 있다. 에너지 저장부의 배터리로 폐배터리가 활용되는 경우, 폐배터리는 이전의 사용환경에 따라 각각 다른 충전 능력을 가지고 있고, 관수제어 시스템에서 사용되는 중에도 충전 능력이 시간의 경과에 따라 열화하게 된다. 따라서 폐배터리를 에너지 저장부로 활용하기 위해서는 배터리의 상태를 검사하고, 이를 기초로 배 터리의 충방전을 제어하고, 배터리의 성능이 기준 이하로 떨어지는 경우에는 이를 교체하여야 한다. 물론, 일반 적인 배터리를 사용하는 경우에도 동일한 기능이 요구될 수 있다. 일 실시예에서, 제어부는 에너지 저장부의 배터리 상태 정보를 획득하여, 배터리의 충전 및 방전을 제어할 수 있다. 예를 들어, 제어부는 에너지 저장부의 배터리 충전 능력을 고려하여 에너지 발전부 에서 생산되는 전기 에너지를 에너지 저장부에 저장할지 여부를 결정할 수 있고, 관수장치에 공 급하는 출력 전압 및 전류를 제어할 수 있다. 일 실시예에서, 에너지 발전부는 전기 에너지를 생산하여 에너지 저장부로 공급할 수 있다. 예를 들 어, 에너지 발전부는 태양열 발전기 또는 풍력 발전기와 같이 현장에 설치될 수 있는 친환경 발전기를 포 함할 수 있다. 다른 예로서, 에너지 발전부는 파도의 힘이나 조수를 이용하는 다른 형태의 친환경 발전설 비를 포함할 수 있다. 더 나아가, 에너지 발전부는 하나 이상의 친환경 발전기를 포함하는 하이브리드 발 전 방식으로 구성될 수 있다. 예를 들어, 에너지 발전부는 태양열 발전기 및 풍력 발전기를 모두 포함할 수 있다. 일 실시예에서, 제어부는 에너지 저장부에 저장된 에너지를 이용하여 관수장치를 제어할 수 있 을 뿐만 아니라, 에너지 발전부로부터 직접 에너지를 공급받아 관수장치를 제어할 수도 있다. 일 실시예에 따른 관수제어 시스템은 주변의 토양, 대기 등에 대한 환경 데이터를 수집하는 센서부 및 기상예보 데이터 등 외부 정보를 수집하는 통신부를 포함할 수 있고, 관수제어 시스템의 제어부 는 센서부 및 통신부에서 수집된 정보들에 기초하여 관수장치를 제어할 수 있다. 일 실시예에서, 센서부는 토양에 포함된 수분을 측정하는 토양수분 센서, 토양 내 염류농도 데이터를 획득하는 염농도 센서, 토양의 온도를 측정하기 위한 토양온도 센서 등을 포함할 수 있으나, 센서부 에 포함되는 센서들이 이에 한정되는 것은 아니고 다양한 토양의 성질을 측정하기 위한 센서들이 포함될 수 있다. 일 실시예에서, 센서부는 대기온도 센서, 대기습도 센서, 일조량 센서, 풍속 센 서 등을 포함할 수 있으나, 이에 한정되는 것은 아니고 다양한 대기(또는 기상)의 성질을 측정하기 위한 센서들이 포함될 수 있다. 일 실시예에서, 센서부는 제어부와 유선 또는 무선으로 연결되어, 센서부에 포함된 센서들이 측 정된 데이터들을 제어부로 전송할 수 있다. 예를 들어, 센서부의 센서들이 제어부와 무선으로 연결되는 경우에는 근거리 통신 기술인 wifi 또는 블루투스가 사용될 수 있다. 다른 예로서, 4G, 5G 등 공중망이나 자가망 기술이 적용될 수 있으며, rola와 같은 통신 기술이 사용될 수 있다. 다만, 센서들과 제어부 의 통신 연결은 이에 한정되지 않고, 가능한 모든 통신 기술이 적용될 수 있다. 일 실시예에서, 토양수분 센서는 FDR(Frequency Domain Reflectometry) 방식의 토양수분센서, TDR(Time Domain Reflectometry) 방식의 토양수분센서, ADR(Amplitude Domain Reflectometry) 방식의 토양수분센서, 토 양수분장력센서 등을 포함할 수 있으며, 토양수분 데이터는 토양 수분 포텐셜 데이터, 수분 온도 데이터, 토양 용적수분함량(soil volumetric water content, VWC, ㎥·m-3), 토양수분장력(kPa), 토양 EC(bulk EC, dS·m-1) 등을 포함할 수 있다. 일 실시예에서, 염농도 센서는 EC(Electric Conductivity) 센서, pH 측정 센서 등을 포함할 수 있다. 일 실시예에서, 관수장치는 물을 저장할 수 있는 저장 탱크, 펌프, 배수로를 포함할 수 있 다. 마찬가지로, 관수장치를 구성하는 구성요소들이 이에 한정되는 것은 아니고 관수를 제어하기 위한 다 양한 장치들이 관수장치에 포함될 수 있다. 일 실시예에서, 관수제어 시스템의 제어부는 토양수분 데이터 및 염류농도 데이터에 기초하여 토양에 수분이 과다한지 또는 부족한지 여부를 결정할 수 있다. 제어부는 토양에 수분이 과다하다고 결정하는 경 우, 토양으로부터 물을 회수하여 회수된 물을 저장 탱크에 저장할 수 있고, 토양에 수분이 부족하다고 결 정하는 경우, 저장 탱크에 저장되어 있는 물을 토양에 공급할 수 있다. 예를 들어, 장마철 비에 의해 토양 에 수분이 과하게 공급되었을 경우, 제어부는 토양수분 센서로부터 수분에 관한 데이터를 획득하고, 수분에 관한 데이터에 기초하여 토양에 수분이 과하게 공급되었다고 결정하며, 관수장치를 통해 토양의 물 을 회수하여 저장 탱크에 저장할 수 있다. 또한, 간척지에서 작물재배 시 지하수의 영향을 받거나, 화학비 료의 사용으로 인해 토양의 염류농도가 상승하는 경우, 제어부는 염농도 센서로부터 염농도에 관한 데이터를 획득하고, 염농도에 관한 데이터에 기초하여 토양의 염농도가 높다고 결정하며, 관수장치를 통해 저장 탱크에 저장되어 있는 물을 토양에 공급할 수 있다. 이때, 관수장치는 펌프와 배수로(33 0)를 이용하여 물을 공급하거나, 회수할 수 있다. 일 실시예에서, 에너지 저장부는 인버터를 포함할 수 있다. 인버터는 에너지 저장부의 직 류(DC) 성분을 교류(AC) 성분으로 변환하여 관수장치 또는 제어부로 공급할 수 있다. 도 2은 본 개시의 일 실시예에 따른 관수제어 시스템의 통신 연결을 도시한 구성도이다. 도 2을 참조하면, 본 개시의 일 실시예에 따른 관수제어 시스템들은 통신부를 이용하여 외부의 서버 또는 다른 관수제어 시스템과 통신할 수 있다. 일 실시예에서, 관수제어 시스템의 통신부는 4G/5G 등 공중망을 이용하여 네트워크에 접속하고, 이를 이용하여 외부의 서버 또는 다른 관수제어 시스템과 통신연결을 설정할 수 있다. 다른 일 실시예에서, 관수제어 시스템의 통신부는 Sub-1GHz ISM-Band의 자가망 기술을 이용하여 외부 의 서버 또는 다른 관수제어 시스템과 통신연결을 설정할 수 있다. 다른 일 실시예에서, 관수제어 시스 템의 통신부는 Lora 기술을 이용하여 외부의 서버 또는 다른 관수제어 시스템과 통신연결을 설정할 수 있다. 일 실시예에서, 관수제어 시스템은 서버와의 통신 연결을 이용하여 관수제어 시스템이 위치하는 지 역의 기상예측 정보 등 다양한 정보를 수집할 수 있다. 일 실시예에서, 서버는 통신 연결을 이용하여 관수 제어 시스템의 관수제어 기준이나 방식을 변경할 수 있고, 특정 관수제어 시스템에 대하여 관수의 공급 또는 중단을 명령할 수도 있다. 본 개시의 일 실시예에 따르면, 관수제어 시스템의 제어부는 통신부를 통하여 서버로부터 수 신한 기상예측 정보를 관수장치의 제어를 위하여 이용할 수 있다. 일 실시예에 따르면, 기상예측 정보에 따라 강우가 예상되는 경우에는, 강우량이나 시기를 고려하여 관수장치에 의한 관수량이나 시기를 조절할 수 있다. 일 실시예에 따르면, 기상예측 정보에 따라 건조하거나 일조량이 많은 날씨가 예상되는 경우에는 관수 장치에 의한 관수량을 증가시킬 수 있다. 일 실시예에 따르면, 기상예측 정보에 따라 습하거나 흐린 날씨 가 예상되는 경우에는 관수장치에 의한 관수량을 증가시킬 수 있다.본 개시의 일 실시예에 따르면, 통신부를 통하여 수집한 기상예측 정보는 센서부에서 측정한 토양 또 는 대기의 측정값들과 비교하여 확인될 수 있다. 또한, 통신부를 통한 통신이 불가능한 경우에는 센서부 에서 측정한 데이터들을 이용하여 제어부가 기상예측 정보를 생성할 수 있다. 본 개시의 일 실시예에 따르면, 관수제어 시스템은 자체적인 에너지 공급을 위하여 친환경 발전 방식을 사 용하므로, 기상에 따라서 발전량이 달라진다. 예를 들어, 기상예측 정보에서 날씨가 흐리고 바람이 없는 경우에 는 에너지 발전부에서 발전량이 낮아지게 되므로, 관수장치의 구동을 위한 에너지가 부족하게 될 수 있으므로, 제어부는 이를 고려하여 관수장치를 제어할 수 있다. 도 3은 본 개시의 일 실시예에 따른 제어부의 관수 제어 정보를 산출하는 인공지능 알고리즘을 도시한 구 성도이다. 도 3을 참조하면, 제어부는 센서 데이터, 기상예보 데이터, 에너지 저장 데이터를 획득하고, 인공 지능 알 고리즘을 통해 학습된 신경망 모델을 이용하여 관수 제어 정보를 산출할 수 있다. 일 실시예에서, 센서 데이터는 토양수분 센서를 통해 획득한 토양 내 수분 데이터, 염농도 센서를 통 해 획득한 토양 내 염류농도 데이터, 토양의 습도 데이터 등을 포함할 수 있고, 기상예보 데이터는 통신부 및/또는 센서부를 통해 획득한 해당 지역의 기상예보 데이터를 포함할 수 있다. 또한, 에너지 저장 데이터 는 에너지 저장부의 배터리 충전 및 방전 상태, 배터리의 충전 능력에 대한 데이터를 포함할 수 있고, 관 수제어 정보는 관수장치가 공급할 관수량, 관수 시기, 관수 방법, 물 공급/회수 여부 등을 포함할 수 있다. 예를 들어, 관수 방법에는 분수관수 방법, 점적관수 방법, 지중관수 방법 등을 포함할 수 있다. 일 실시예에 따르면, 사람이 최적의 관수량, 관수 시기, 관수 방법 등을 판단하는 것에는 한계가 있으나, 센서 데이터 및 기상예보 데이터를 입력으로 하여 인공지능 알고리즘을 통해 학습된 신경망 모델에 의해 관수 제어 정보를 결정함으로써, 최적의 관수 제어가 가능해질 수 있다. 도 4는 본 개시의 일 실시예에 따른 관수제어 방법을 도시한 순서도이다. 도 4를 참조하면, 단계 S100에서, 제어부는 센서 데이터를 획득할 수 있다. 예를 들어, 제어부는 토 양 수분 데이터를 획득할 수 있다. 일 실시예에서, 토양 수분 데이터는 토양수분 센서를 통해 획득한 토양 내 수분 데이터를 포함할 수 있다. 일 실시예에서, 센서 데이터는 토양수분 센서를 통해 획득한 토양 내 수분 데이터, 염농도 센서를 통해 획득한 토양 내 염류농도 데이터, 토양 내 습도 데이터 등 다양한 센서 에 의해 측정된 다양한 토양 데이터를 포함할 수 있다. 단계 S200에서, 제어부는 기상예보 데이터를 획득할 수 있다. 일 실시예에서, 기상예보 데이터는 통신부 및/또는 센서부를 통해 획득한 해당 지역의 기상예보 데이터를 포함할 수 있다. 단계 S300에서, 제어부는 에너지 저장부로부터 배터리 충전 및 방전 상태, 배터리의 충전 능력에 대 한 데이터를 포함하는 에너지 저장 데이터를 획득할 수 있다. 단계 S400에서, 제어부는 관수장치를 제어할 수 있다. 일 실시예에서, 제어부는 센서 데이터, 기상예보 데이터, 에너지 저장 데이터 중 적어도 하나 이상에 기초하여 관수장치를 제어할 수 있다. 일 실 시예에서, 관수장치를 제어한다는 것은 토양수분 데이터 및 기상예보 데이터에 기초하여 토양에 수분이 과 다할 경우, 물을 회수하여 관수장치에 포함된 저장 탱크에 저장하고, 토양에 수분이 부족할 경우, 저 장 탱크에 저장된 물을 토양에 공급하는 것을 포함할 수 있다. 이때, 제어부는 관수장치에 포함 된 펌프와 배수로를 이용하여 물을 공급하거나 회수할 수 있다. 일 실시예에서, 관수장치의 제어는 토양수분 데이터, 염류농도 데이터 및 기상예보 데이터 중 적어도 하나 이상에 기초하여 토양에 수분이 과다할 경우, 물을 회수하여 관수장치에 포함된 저장 탱크에 저장하 고, 토양에 수분이 부족하거나 염류농도가 과다할 경우, 저장 탱크에 저장된 물을 토양에 공급하는 것을 포함할 수 있다. 이때, 관수장치에 포함된 펌프와 배수로를 이용하여 물을 공급하거나 회수할 수 있다. 또 다른 일 실시예에서, 에너지 저장부의 충전 상태, 토양수분 데이터, 염류농도 데이터, 기상예보 데이터 중 적어도 하나 이상에 기초하여 요구되는 관수 제어 정보를 산출하는 것을 포함할 수 있다. 이때, 인공 지능알고리즘을 통해 학습된 신경망 모델을 이용하여 관수 제어 정보를 산출할 수 있다. 각 단계가 수행되는 동안, 에너지 발전부는 친환경 발전 방식에 의해 전기 에너지를 생산할 수 있으며, 생 산된 전기 에너지는 배터리를 포함하는 에너지 저장부에 저장될 수 있다. 일 실시예에서, 생산된 전기 에 너지는 인버터에 의해 전력이 변환되어 관수장치 및/또는 제어부 로 공급될 수 있다. 또한, 생 산된 전기 에너지는 인버터에 의해 전력이 변환되어 제어부 및 관수장치로 공급될 수 있다. 일 실시예에서, 제어부 및/또는 관수장치는 에너지 발전부로부터 직접 에너지를 획득할 수도 있 다. 즉, 제어부 및/또는 관수장치는 에너지 저장부에 저장된 에너지를 이용할 수 있을 뿐만 아 니라 상황에 따라 에너지 발전부에 의해 생성된 에너지를 직접 획득하여 사용할 수도 있다. 한편, 도 4가 본 개시의 일 실시예에 따른 관수제어 방법을 도시하고 있더라도, 다양한 변형들이 도 4에서 이루 어질 수 있음은 물론이다. 일 예로, 도 4에서 연속적인 단계들이 도시되어 있지만, 다양한 단계들은 오버랩될 수 있고, 병렬로 발생할 수 있고, 다른 순서로 발생할 수 있거나, 혹은 다수 번 발생할 수 있음은 물론이다. 또한, 본 명세서와 도면에 개시된 실시예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해를 돕기 위 해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 즉, 본 개시의 기술적 사상 에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 개시의 속하는 기술 분야에서 통상의 지식을 가진 자에 게 자명한 것이다. 또한, 각각의 실시예는 필요에 따라 서로 조합되어 운용할 수 있다. 예를 들어, 본 개시의 일 실시예와 다른 일 실시예의 일부분들이 서로 조합될 수 있다."}
{"patent_id": "10-2023-0060671", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 관수제어 시스템의 구성을 도시한 구성도이다. 도 2은 본 개시의 일 실시예에 따른 관수제어 시스템의 통신 연결을 도시한 구성도이다. 도 3은 본 개시의 일 실시예에 따른 제어부의 관수 제어 정보를 산출하는 인공지능 알고리즘을 도시한 구성도이 다.도 4는 본 개시의 일 실시예에 따른 관수제어 방법을 도시한 순서도이다."}
