{"patent_id": "10-2023-0022181", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0129400", "출원번호": "10-2023-0022181", "발명의 명칭": "웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템", "출원인": "주식회사 와이즈넛", "발명자": "강준성"}}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기 설정된 웹사이트 URL 목록을 이용하여 HTML 문서를 수집하는 HTML 문서수집장치;상기 HTML 문서수집장치로부터 수집된 HTML 문서를 제공받아 기 설정된 HTML 수집 룰 정보를 기반으로 미리 배포된 머신러닝 모델을 이용하여 해당 수집된 HTML 문서에서 사용자가 원하는 데이터를 추출하는 데이터 추출장치;상기 데이터 추출장치로부터 추출된 해당 사용자가 원하는 데이터를 수집하는 데이터 수집장치;상기 데이터 수집장치로부터 수집된 해당 사용자가 원하는 데이터를 제공받아 이를 기반으로 기 설정된 데이터의미 분석(semantic analysis) 기법을 이용하여 기 설정된 임계치 값에 따라 수집된 해당 사용자가 원하는 데이터를 올바른 데이터 또는 올바르지 않은 데이터로 검증하는 데이터 검증장치; 및상기 데이터 검증장치로부터 검증된 올바른 데이터와 함께 상기 기 설정된 웹사이트 URL 목록과 HTML 수집 룰정보를 기반으로 기 설정된 인공지능(AI) 기반의 기계 학습방법을 이용하여 해당 사용자가 원하는 데이터가 위치한 HTML 문서의 위치를 자동으로 발견할 수 있도록 상기 미리 배포된 머신러닝 모델을 기 설정된 정확도에 도달할 때까지 반복 학습한 후, 상기 기 설정된 정확도에 도달된 머신러닝 모델을 웹사이트 크롤링 자동화 서비스운영을 위한 새로운 머신러닝 모델로 생성하여 상기 데이터 추출장치로 자동 배포하는 머신러닝 모델 생성장치를 포함하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,사용자의 조작에 의한 특정 입력신호를 출력하는 사용자 입력장치가 더 포함되되, 상기 사용자 입력장치로부터출력된 특정 입력신호에 따라 상기 웹사이트 URL 목록 및 상기 HTML 수집 룰 정보가 미리 설정되는 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,사용자의 조작에 의한 특정 입력신호를 출력하는 사용자 입력장치가 더 포함되되, 상기 데이터 검증장치로부터검증된 올바르지 않은 데이터는 상기 사용자 입력장치로부터 출력된 특정 입력신호에 따라 삭제되거나 별도의데이터 저장장치에 저장되는 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,사용자의 조작에 의한 특정 입력신호를 출력하는 사용자 입력장치가 더 포함되되, 상기 사용자 입력장치로부터출력된 특정 입력신호에 따라 상기 데이터 검증장치로부터 검증된 올바르지 않은 데이터가 올바른 데이터로 결정될 경우, 상기 결정된 올바른 데이터는 별도의 데이터 저장장치에 저장되고,상기 머신러닝 모델 생성장치는, 상기 데이터 저장장치에 저장된 올바른 데이터와 함께 상기 기 설정된 웹사이트 URL 목록과 HTML 수집 룰 정보를 기반으로 상기 기 설정된 인공지능(AI) 기반의 기계 학습방법을 이용하여해당 사용자가 원하는 데이터가 위치한 HTML 문서의 위치를 자동으로 발견할 수 있도록 상기 미리 배포된 머신러닝 모델을 기 설정된 정확도에 도달할 때까지 반복 학습하는 것을 특징으로 하는 웹사이트 크롤링 자동화를공개특허 10-2024-0129400-3-통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 기 설정된 웹사이트 URL 목록, 상기 기 설정된 HTML 수집 룰 정보, 상기 HTML 문서수집장치로부터 수집된HTML 문서, 및 상기 데이터 검증장치로부터 검증된 올바른 데이터를 데이터베이스(DB)화하여 저장 및 관리하는데이터 저장장치가 더 포함되는 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 데이터 검증장치는, 상기 데이터 수집장치로부터 수집된 해당 사용자가 원하는 데이터를 제공받아 이를 기반으로 기 설정된 데이터 의미 분석(semantic analysis) 기법을 이용하여 수집된 해당 사용자가 원하는 데이터가 상기 기 설정된 임계치 값보다 크거나 같으면 올바른 데이터를 수집한 것으로 통과되어 별도의 데이터 저장장치에 저장하고, 상기 기 설정된 임계치 값보다 작은 경우 올바르지 않은 데이터로 검증하는 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 머신러닝 모델 생성장치는, 상기 HTML 문서수집장치로부터 수집된 HTML 문서에서 해당 사용자가 원하는 데이터만을 추출하기 위하여, 상기 기 설정된 HTML 수집 룰 정보를 자동으로 조절하면서 최적의 값을 찾아 상기미리 배포된 머신러닝 모델을 통해 해당 수집된 HTML 문서의 코딩 방식이나 스타일을 반복 학습하는 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 기 설정된 HTML 수집 룰 정보에는, 상기 미리 배포된 머신러닝 모델의 학습을 위한 하이퍼 파라미터(Hyperparameter) 값을 포함하는 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 머신러닝 모델 생성장치에 적용된 인공지능(AI) 기반의 기계 학습방법은, 신경망(Neural Network),SVM(Support Vector Machine), MLP(Multi Layer Perception), 및 딥러닝(Deep Learning) 중 적어도 하나의 인공지능 학습방법으로 이루어진 것을 특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템."}
{"patent_id": "10-2023-0022181", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 데이터 검증장치로부터 검증된 올바르지 않은 데이터는, 광고 데이터 또는 테스트 데이터로 이루어진 것을특징으로 하는 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템.공개특허 10-2024-0129400-4-"}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템에 관한 것으로, 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops)을 통해 사용자의 개입을 최소화하여 각각 다른 웹사이트들의 HTML 문서를 자 동으로 수집함과 아울러 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops) 사이에 발생하는 데이터와 머신러닝 모델의 성능 차이를 최소화하고 비전문가도 자동으로 운영할 수 있는 머신러닝 모델 운영(ML Ops) 개발 을 통해 데이터 분석 및 서비스 개발을 대중화할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 웹사이트 크롤링 자동화를 통한 머신러닝(Machine Learning) 모델 생성 시스템에 관한 것이다."}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에 기하급수적으로 증가하는 빅데이터의 양은 제타바이트를 넘어서서 요타바이트까지 등장하게 되었다. 이러한 방대한 데이터를 분석하기 위해서는 먼저 데이터 수집이 선행되어야한다. 데이터 수집의 경우, 수집이 허용된 웹사이트에 대해서만 수집이 가능해야한다. 또한, 수집이 가능한 웹사이트라고 하더라도 웹사이트의 HTML 문서(Document)마다 코딩 방식이나 스타일이 전부 다르기 때문에 웹사이트 하나가 추가될 때마다 사용자의 개입이 필요해진다. 그렇기 때문에, 사용자의 개입을 줄여 업무 효율성을 증가시키기 위해서는 데이터 수집하는 지금보다 고도화 자 동화된 기술이 필요하다. 이러한 고도화된 기술을 설명하기에 앞서 머신러닝 모델 개발(Machine Learning Developments, ML Dev)은 머신 러닝을 하기 위해 모델을 개발하는 것을 말한다. 머신러닝 모델을 개발할 때는 하이퍼 파라미터(Hyper parameter) 등의 값을 조절하며 정확도를 올리는 등의 작업이 필요하다. 그리고, 머신러닝 모델 운영(Machine Learning Operations, ML Ops)은 머신러닝 모델 개발(ML Dev)이 완료되고 실제 서비스 운영으로 배포되는 단계 를 말한다. 이와 같이 머신러닝 모델 개발(ML Dev)이 완료되면 머신러닝 모델 운영(ML Ops)을 통해 사용자 개입 없이 자동 으로 서비스에 배포되어 바로 운영을 시작할 수 있도록 하며 필요시 즉시 데이터를 학습할 수 있도록 시스템으 로 구축 되어있는 것을 말하기도 한다. 마지막으로 고도화된 기술이라 하면 기술 분야에서 언급했던 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영 (ML Ops)을 활용하여 HTML 문서의 제각각인 코딩 방식이나 스타일을 스스로 학습하고 사용자가 원하는 데이터만 자동으로 추출해서 수집이 가능하도록 하는 기술을 말한다. 전술한 바와 같이 방대한 데이터를 수집하기 위해서는 수집이 허용된 웹사이트에서 HTML 문서를 읽으면서 사용 자가 원하는 데이터만 추출해서 수집을 진행해야한다. 이러한 부분에서 사용자의 개입이 많이 필요하게 되는데, 앞서 언급한 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops)을 활용하여 데이터 수집을 간편하고 사 용자의 개입을 최소화할 수 있는 기술이 필요한 실정이다. 또한, 각각 다른 웹사이트뿐만 아니라 예를 들어, 한 웹사이트로만 보더라도 계절 및 시즌별로 웹사이트의 디자 인을 개선하거나 이벤트를 진행할 때마다 웹사이트에 대한 스타일이 변경되는 경우가 발생한다. 이런 상황이 발 생할 때마다 사용자는 데이터를 수집하기 위해 개입을 해야 하며, 그에 따라 업무 효율성이 저하되는 것을 예방 하기 위해 사용자의 개입을 최소화할 수 있는 기술이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 공개특허 제10-2021-0055934호(2021.05.18. 공개)"}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위하여 안출된 것으로서, 본 발명의 목적은 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops)을 통해 사용자의 개입을 최소화하여 각각 다른 웹사이트들의 HTML 문서를 자동으로 수집함과 아울러 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops) 사이에 발생하는 데이터와 머신러 닝 모델의 성능 차이를 최소화하고 비전문가도 자동으로 운영할 수 있는 머신러닝 모델 운영(ML Ops) 개발을 통 해 데이터 분석 및 서비스 개발을 대중화할 수 있도록 한 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성시스템을 제공하는데 있다."}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위하여 본 발명의 일 측면은, 기 설정된 웹사이트 URL 목록을 이용하여 HTML 문서를 수 집하는 HTML 문서수집장치; 상기 HTML 문서수집장치로부터 수집된 HTML 문서를 제공받아 기 설정된 HTML 수집 룰 정보를 기반으로 미리 배포된 머신러닝 모델을 이용하여 해당 수집된 HTML 문서에서 사용자가 원하는 데이터 를 추출하는 데이터 추출장치; 상기 데이터 추출장치로부터 추출된 해당 사용자가 원하는 데이터를 수집하는 데 이터 수집장치; 상기 데이터 수집장치로부터 수집된 해당 사용자가 원하는 데이터를 제공받아 이를 기반으로 기 설정된 데이터 의미 분석(semantic analysis) 기법을 이용하여 기 설정된 임계치 값에 따라 수집된 해당 사용자 가 원하는 데이터를 올바른 데이터 또는 올바르지 않은 데이터로 검증하는 데이터 검증장치; 및 상기 데이터 검 증장치로부터 검증된 올바른 데이터와 함께 상기 기 설정된 웹사이트 URL 목록과 HTML 수집 룰 정보를 기반으로 기 설정된 인공지능(AI) 기반의 기계 학습방법을 이용하여 해당 사용자가 원하는 데이터가 위치한 HTML 문서의 위치를 자동으로 발견할 수 있도록 상기 미리 배포된 머신러닝 모델을 기 설정된 정확도에 도달할 때까지 반복 학습한 후, 상기 기 설정된 정확도에 도달된 머신러닝 모델을 웹사이트 크롤링 자동화 서비스 운영을 위한 새로 운 머신러닝 모델로 생성하여 상기 데이터 추출장치로 자동 배포하는 머신러닝 모델 생성장치를 포함하는 웹사 이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템을 제공하는 것이다. 여기서, 사용자의 조작에 의한 특정 입력신호를 출력하는 사용자 입력장치가 더 포함되되, 상기 사용자 입력장 치로부터 출력된 특정 입력신호에 따라 상기 웹사이트 URL 목록 및 상기 HTML 수집 룰 정보가 미리 설정됨이 바 람직하다. 바람직하게, 사용자의 조작에 의한 특정 입력신호를 출력하는 사용자 입력장치가 더 포함되되, 상기 데이터 검 증장치로부터 검증된 올바르지 않은 데이터는 상기 사용자 입력장치로부터 출력된 특정 입력신호에 따라 삭제되 거나 별도의 데이터 저장장치에 저장될 수 있다. 바람직하게, 사용자의 조작에 의한 특정 입력신호를 출력하는 사용자 입력장치가 더 포함되되, 상기 사용자 입 력장치로부터 출력된 특정 입력신호에 따라 상기 데이터 검증장치로부터 검증된 올바르지 않은 데이터가 올바른 데이터로 결정될 경우, 상기 결정된 올바른 데이터는 별도의 데이터 저장장치에 저장될 수 있다. 바람직하게, 상기 머신러닝 모델 생성장치는, 상기 데이터 저장장치에 저장된 올바른 데이터와 함께 상기 기 설 정된 웹사이트 URL 목록과 HTML 수집 룰 정보를 기반으로 상기 기 설정된 인공지능(AI) 기반의 기계 학습방법을 이용하여 해당 사용자가 원하는 데이터가 위치한 HTML 문서의 위치를 자동으로 발견할 수 있도록 상기 미리 배 포된 머신러닝 모델을 기 설정된 정확도에 도달할 때까지 반복 학습할 수 있다. 바람직하게, 상기 기 설정된 웹사이트 URL 목록, 상기 기 설정된 HTML 수집 룰 정보, 상기 HTML 문서수집장치로 부터 수집된 HTML 문서, 및 상기 데이터 검증장치로부터 검증된 올바른 데이터를 데이터베이스(DB)화하여 저장 및 관리하는 데이터 저장장치가 더 포함될 수 있다. 바람직하게, 상기 데이터 검증장치는, 상기 데이터 수집장치로부터 수집된 해당 사용자가 원하는 데이터를 제공 받아 이를 기반으로 기 설정된 데이터 의미 분석(semantic analysis) 기법을 이용하여 수집된 해당 사용자가 원 하는 데이터가 상기 기 설정된 임계치 값보다 크거나 같으면 올바른 데이터를 수집한 것으로 통과되어 별도의 데이터 저장장치에 저장하고, 상기 기 설정된 임계치 값보다 작은 경우 올바르지 않은 데이터로 검증할 수 있다. 바람직하게, 상기 머신러닝 모델 생성장치는, 상기 HTML 문서수집장치로부터 수집된 HTML 문서에서 해당 사용자 가 원하는 데이터만을 추출하기 위하여, 상기 기 설정된 HTML 수집 룰 정보를 자동으로 조절하면서 최적의 값을 찾아 상기 미리 배포된 머신러닝 모델을 통해 해당 수집된 HTML 문서의 코딩 방식이나 스타일을 반복 학습할 수 있다. 바람직하게, 상기 기 설정된 HTML 수집 룰 정보에는, 상기 미리 배포된 머신러닝 모델의 학습을 위한 하이퍼 파 라미터(Hyper parameter) 값을 포함할 수 있다. 바람직하게, 상기 머신러닝 모델 생성장치에 적용된 인공지능(AI) 기반의 기계 학습방법은, 신경망(Neural Network), SVM(Support Vector Machine), MLP(Multi Layer Perception), 및 딥러닝(Deep Learning) 중 적어도 하나의 인공지능 학습방법으로 이루어질 수 있다.바람직하게, 상기 데이터 검증장치로부터 검증된 올바르지 않은 데이터는, 광고 데이터 또는 테스트 데이터로 이루어질 수 있다."}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같은 본 발명의 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템에 따르면, 머 신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops)을 통해 사용자의 개입을 최소화하여 각각 다른 웹사이 트들의 HTML 문서를 자동으로 수집함과 아울러 머신러닝 모델 개발(ML Dev)과 머신러닝 모델 운영(ML Ops) 사이 에 발생하는 데이터와 머신러인 모델의 성능 차이를 최소화하고 비전문가도 자동으로 운영할 수 있는 머신러닝 모델 운영(ML Ops) 개발을 통해 데이터 분석 및 서비스 개발을 대중화할 수 있는 이점이 있다. 또한, 본 발명에 따르면, 데이터 수집을 여러 곳에서 해야 하는 경우 또는 특정 웹사이트에서 시즌 및 이벤트 때마다 HTML 문서가 바뀌어 매번 수집하는 룰(Rule)을 변경하고 재설정 해야 하는 작업의 사용자 개입이 많이 필요하지 않도록 하여 업무 효율성을 증가시킬 수 있는 이점이 있다. 또한, 본 발명에 따르면, 초기에 한번 세팅(Setting)을 통해서 자동으로 HTML 문서의 구조를 반복 학습하고, 변 경된 구조에 맞게 데이터를 수집할 수 있기 때문에, 사용자는 좀 더 중요한 작업에 집중할 수 있기 때문에 업무 효율성뿐만 아니라 데이터를 수집하는데 정확성이 높은 데이터를 추출할 수 있는 이점이 있다."}
{"patent_id": "10-2023-0022181", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 본 출원에서 사용한 용어는 단지 특정 한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하 게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 이하, 첨부 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 그러나, 다음에 예시하는 본 발명의 실시 예는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 다음에 상술하는 실시예에 한정되는 것은 아 니다. 본 발명의 실시예는 당업계에서 통상의 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위하여 제 공되어지는 것이다. 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들(실행 엔진)에 의해 수 행될 수도 있으며, 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하 기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용가능 또는 컴퓨 터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들은 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능을 수행하는 인스트럭션 수단을 내포 하는 제조 품목을 생산하는 것도 가능하다. 그리고, 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되 는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수 행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수 행하는 인스트럭션들은 블록도의 각 블록 및 흐름도의 각 단계에서 설명되는 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능들을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있으며, 몇 가지 대체 실시 예들에서는 블록들 또는 단 계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하며, 또한 그 블록들 또는 단 계들이 필요에 따라 해당하는 기능의 역순으로 수행되는 것도 가능하다. 도 1은 본 발명의 일 실시예에 따른 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템을 설명하기 위 한 전체적인 블록 구성도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템은, 크게 HTML 문서수집장치, 데이터 추출장치, 데이터 수집장치, 데이터 검증장치, 및 머신러 닝 모델 생성장치 등을 포함하여 이루어진다. 또한, 본 발명의 일 실시예에 따른 웹사이트 크롤링 자동화 를 통한 머신러닝 모델 생성 시스템은 사용자 입력장치, 데이터 저장장치 등을 추가적으로 더 포함할 수도 있다. 한편, 도 1에 도시된 구성요소들이 필수적인 것은 아니어서, 본 발명의 일 실시예에 따른 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템은 그보다 많은 구성요소들을 갖거나 그보다 적은 구성요소들 을 가질 수도 있다. 이하, 본 발명의 일 실시예에 따른 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템의 구성요소들에 대해 구체적으로 살펴보면 다음과 같다. HTML 문서수집장치는 기 설정된 웹사이트 URL 목록을 이용하여 통신망을 통해 HTML 문서를 수집하는 기능을 수행한다. 이때, 통신망은 대용량, 장거리 음성 및 데이터 서비스가 가능한 대형 통신망의 고속 기 간 망인 통신망이며, 인터넷(Internet) 또는 고속의 멀티미디어 서비스를 제공하기 위한 와이파이(WiFi), 와이 기그(WiGig), 와이브로(Wireless Broadband Internet, Wibro), 와이맥스(World Interoperability for Microwave Access, Wimax) 등을 포함하는 차세대 무선 통신망일 수 있다. 상기 인터넷은 TCP/IP 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(Hyper Text Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service) 등을 제공하는 전 세계적인 개방형 컴퓨터 네트워크 구조를 의미하며, HTML 문서수집장치 가 특정의 웹사이트(Website)를 운영하는 웹 서버(Web Server)(미도시)에 접속될 수 있게 하는 환경을 제 공한다. 한편, 상기 인터넷은 유선 또는 무선 인터넷일 수도 있고, 이외에도 유선 공중망, 무선 이동 통신망, 또는 휴대 인터넷 등과 통합된 코어망일 수도 있다. 만약, 통신망이 이동 통신망일 경우 동기식 이동 통신망일 수도 있고, 비동기식 이동 통신망일 수도 있다. 상기 비동기식 이동 통신망의 실시 예로서, WCDMA(Wideband Code Division Multiple Access) 방식의 통신망을 들 수 있다. 이 경우 도면에 도시되진 않았지만, 상기 이동 통신망은 예컨대, RNC(Radio Network Controller) 등을 포함할 수 있다. 한편, 상기 WCDMA망을 일 예로 들었지만, 셀룰러(cellular) 기반의 3G망, LTE망, 4G망, 5G망 등 차세대 통신망, 그 밖의 IP를 기반으로 한 IP망일 수 있다. 이러한 통신망은 HTML 문서수집장치 와 웹 서버의 신호 및 데이터를 상호 전달하는 역할을 수행한다. 데이터 추출장치는 HTML 문서수집장치로부터 수집된 HTML 문서를 제공받아 기 설정된 HTML 수집 룰 (Rule) 정보를 기반으로 미리 배포된 머신러닝 모델(Machine Learning Model)을 이용하여 해당 수집된 HTML 문서에서 사용자가 원하는 데이터를 추출하는 기능을 수행한다. 이때, 상기 기 설정된 HTML 수집 룰 정보에는 예컨대, 상기 미리 배포된 머신러닝 모델의 학습을 위한 하이퍼 파라미터(Hyper parameter) 값을 포함함이 바람직하다. 상기 하이퍼 파라미터 값이란, 머신러닝 모델의 학습 과 정에 반영되는 값으로, 쉽게 말해 머신러닝 모델의 개발자가 직접 설정해주는 값이다. 즉, 상기 하이퍼 파라미 터 값은 데이터 학습을 위해 설정되어 학습된 모델이 원하는 성능이 나올 때까지 학습 및 검증을 반복하면서 튜 닝되는 값으로 구성된다. 이러한 상기 하이퍼 파라미터에는 예컨대, 학습률, 은닉층 개수, 배치 사이즈, 에폭 횟수, 손실 함수 종류, C, 감마, depth 등을 포함할 수 있다. 데이터 수집장치는 데이터 추출장치로부터 추출된 해당 사용자가 원하는 데이터를 수집하는 기능을 수행한다. 데이터 검증장치는 데이터 수집장치로부터 수집된 해당 사용자가 원하는 데이터를 제공받아 이를 기 반으로 기 설정된 데이터 의미 분석(semantic analysis) 기법을 이용하여 기 설정된 임계치 값에 따라 수집된 해당 사용자가 원하는 데이터를 올바른 데이터 또는 올바르지 않은 데이터로 검증하는 기능을 수행한다. 즉, 데이터 검증장치는 데이터 수집장치로부터 수집된 해당 사용자가 원하는 데이터를 제공받아 이를 기반으로 기 설정된 데이터 의미 분석 기법을 이용하여 수집된 해당 사용자가 원하는 데이터가 상기 기 설정된 임계치 값보다 크거나 같으면 올바른 데이터를 수집한 것으로 통과되어 별도의 데이터 저장장치에 저장하 고, 상기 기 설정된 임계치 값보다 작은 경우 올바르지 않은 데이터로 검증할 수 있다. 또한, 데이터 검증장치로부터 검증된 올바르지 않은 데이터는 예컨대, 광고 데이터 또는 테스트 데이터로 이루어짐이 바람직하다. 한편, 상기 기 설정된 데이터 의미 분석 기법은 수집된 데이터가 해당 사용자가 원하는 올바른 데이터인지 아니 면 해당 사용자가 원하지 않는 올바르지 않은 데이터인지를 검증하기 위한 것으로서, 통상의 다양한 자연어 처 리(Natural Language Processing) 알고리즘을 적용할 수 있으며, 이러한 자연어 처리 알고리즘이 공지되어 있으 며, 본 발명은 이러한 알고리즘을 한정하는데 특징이 있는 것이 아니므로, 이에 대한 설명은 공지의 기술로 대 신한다. 전술한 바와 같은 각 장치 구성요소들 즉, HTML 문서수집장치, 데이터 추출장치, 데이터 수집장치 , 및 데이터 검증장치는 머신러닝 모델 운영(ML Ops) 시스템에 적용됨이 바람직하다. 그리고, 머신러닝 모델 생성장치는 데이터 검증장치로부터 검증된 올바른 데이터와 함께 상기 기 설 정된 웹사이트 URL 목록과 HTML 수집 룰 정보를 기반으로 기 설정된 인공지능(AI) 기반의 기계 학습방법을 이용 하여 해당 사용자가 원하는 데이터가 위치한 HTML 문서의 위치를 자동으로 발견할 수 있도록 상기 미리 배포된 머신러닝 모델을 기 설정된 정확도에 도달할 때까지 반복 학습한 후, 상기 기 설정된 정확도에 도달된 머신러닝 모델을 웹사이트 크롤링 자동화 서비스 운영을 위한 새로운 머신러닝 모델로 생성하여 데이터 추출장치로 자동 배포하는 기능을 수행한다. 또한, 머신러닝 모델 생성장치는 데이터 저장장치에 저장된 올바른 데이터와 함께 상기 기 설정된 웹 사이트 URL 목록과 HTML 수집 룰 정보를 기반으로 상기 기 설정된 인공지능(AI) 기반의 기계 학습방법을 이용하 여 해당 사용자가 원하는 데이터가 위치한 HTML 문서의 위치를 자동으로 발견할 수 있도록 상기 미리 배포된 머 신러닝 모델을 기 설정된 정확도에 도달할 때까지 반복 학습하는 기능을 수행할 수 있다. 또한, 머신러닝 모델 생성장치는 HTML 문서수집장치로부터 수집된 HTML 문서에서 해당 사용자가 원하 는 데이터만을 추출하기 위하여, 상기 기 설정된 HTML 수집 룰 정보를 자동으로 조절하면서 최적의 값을 찾아 상기 미리 배포된 머신러닝 모델을 통해 해당 수집된 HTML 문서의 코딩 방식이나 스타일을 반복 학습하는 기능 을 수행할 수 있다. 또한, 머신러닝 모델 생성장치에 적용된 인공지능(AI) 기반의 기계 학습방법은 예컨대, 신경망(Neural Network), SVM(Support Vector Machine), MLP(Multi Layer Perception), 및/또는 딥러닝(Deep Learning) 중 적어도 하나의 인공지능 학습방법으로 이루어짐이 바람직하다. 전술한 바와 같은 머신러닝 모델 생성장치는 머신러닝 모델 개발(ML Dev) 시스템에 적용됨이 바람직하다. 추가적으로, 사용자 입력장치는 사용자의 조작에 의한 특정 입력신호를 출력하는 기능을 수행한다. 또한, 사용자 입력장치로부터 출력된 특정 입력신호에 따라 상기 웹사이트 URL 목록 및 상기 HTML 수집 룰 정보가 미리 설정됨이 바람직하다. 또한, 데이터 검증장치로부터 검증된 올바르지 않은 데이터는 사용자 입력장치로부터 출력된 특정 입 력신호에 따라 삭제되거나 별도의 데이터 저장장치에 저장될 수 있다. 또한, 사용자 입력장치로부터 출력된 특정 입력신호에 따라 데이터 검증장치로부터 검증된 올바르지 않은 데이터가 올바른 데이터로 결정될 경우, 상기 결정된 올바른 데이터는 별도의 데이터 저장장치에 저 장될 수 있다. 이러한 사용자 입력장치는 적어도 하나의 키 버튼(Key Button)을 구비하여 특정의 키 입력신호를 출력하는 모듈로서, 다수개의 문자 키, 숫자 키 및 각종 기능 키를 구비하여 사용자가 입력하는 키에 대응하는 키 입력신 호를 출력할 수 있다. 한편, 사용자 입력장치는 다수의 키 버튼을 포함하여 구현됨이 바람직하지만, 이에 국한하지 않으며, 예컨 대, 키보드(Keyboard), 마우스(Mouse), 리모콘 등으로 구성될 수도 있으며, 경우에 따라서는 무선 인터넷 또는 휴대 인터넷을 통하여 통신하는 스마트폰(Smart Phone), 스마트 패드(Smart Pad) 또는 스마트 노트(Smart Note) 중 적어도 어느 하나의 이동 단말 장치로 이루어질 수도 있으며, 이외에도 개인용 PC, 노트북 PC, 팜 (Palm) PC, 모바일 게임기(Mobile play-station), 통신 기능이 있는 DMB(Digital Multimedia Broadcasting)폰, 태블릿 PC, 아이패드(iPad) 등 특정의 키 입력신호를 출력하기 위한 사용자 인터페이스를 갖는 모든 유무선 가 전/통신 장치를 포괄적으로 의미할 수 있다. 데이터 저장장치는 상기 기 설정된 웹사이트 URL 목록, 상기 기 설정된 HTML 수집 룰 정보, HTML 문서수집 장치로부터 수집된 HTML 문서, 및/또는 데이터 검증장치로부터 검증된 올바른 데이터 중 적어도 하나 의 데이터를 데이터베이스(DB)화하여 저장 및 관리하는 기능을 수행한다. 이러한 데이터 저장장치는 예컨대, 플래시 메모리 타입(Flash Memory type), 하드디스크 타입(Hard Disk type), 멀티미디어 카드 마이크로 타입(Multimedia Card Micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 전술한 바와 같은 각 장치 구성요소들 즉, 사용자 입력장치, 및 데이터 저장장치는 머신러닝 모델 개 발(ML Dev) 시스템과 머신러닝 모델 운영(ML Ops) 시스템 모두에 적용됨이 바람직하다. 그리고, 도면에 도시되진 않았지만, 전술한 각 장치 구성요소들 즉, HTML 문서수집장치, 데이터 추출장치 , 데이터 수집장치, 데이터 검증장치, 머신러닝 모델 생성장치, 사용자 입력장치, 및 /또는 데이터 저장장치 등에 필요한 전원을 공급하는 전원공급 장치가 더 포함되는 바, 계속적인 전원 공 급을 위해 상용 교류(AC) 전원(예컨대, AC 220V)을 직류(DC) 및/또는 교류(AC) 전원으로 변환되도록 구현함이 바람직하지만, 이에 국한하지 않으며, 통상의 휴대용 배터리(Battery)를 포함하여 구현할 수도 있다. 또한, 상기 전원공급 장치에는 외부의 전원 충격으로부터 부품을 보호하고 일정한 전압을 출력하는 기능을 수행 하는 전원 관리부(미도시)를 포함할 수 있다. 상기 전원 관리부는 ESD(Electro Static Damage) 보호기, 전원 감 지기, 정류기 및 전원 차단기 등을 포함하여 이루어질 수 있다. 여기서, 상기 ESD 보호기는 정전기 또는 급격한 전원 충격으로부터 전장 부품을 보호하도록 구성한다. 상기 전 원 감지기는 허용 전압 범위 외의 전압이 유입될 경우 상기 전원 차단기에 차단신호를 보내고, 허용 전압 범위 내에서 전압 변화에 따라 승압 또는 강압 신호를 상기 정류기에 전달하도록 구성한다. 상기 정류기는 입력 전압 의 변동을 최소하여 일정한 전압이 공급되도록 상기 전원 감지기의 신호에 따라 승압 또는 강압의 정류 동작을 수행하도록 구성한다. 상기 전원 차단기는 상기 전원 감지기로부터 전달되는 차단 신호에 따라 배터리로부터 공 급되는 전원을 차단하도록 구성한다. 여기에 설명되는 다양한 실시예는 예를 들어, 소프트웨어, 하드웨어 또는 이들의 조합된 것을 이용하여 컴퓨터 또는 이와 유사한 장치로 읽을 수 있는 기록매체 내에서 구현될 수 있다. 하드웨어적인 구현에 의하면, 여기에 설명되는 실시예는 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Date Arrays), 프로세서(Processors), 제어기(Controllers), 마이크로 컨 트롤러(Micro-Controllers), 마이크로 프로세서(Microprocessors), 기능 수행을 위한 전기적인 유닛 중 적어도하나를 이용하여 구현될 수 있다. 일부의 경우에 그러한 실시예들이 전술한 장치 구성요소들 중 적어도 어느 하 나의 장치 구성요소에 의해 구현될 수 있다. 소프트웨어적인 구현에 의하면, 절차나 기능과 같은 실시예들은 적어도 하나의 기능 또는 작동을 수행하게 하는 별개의 소프트웨어 모듈과 함께 구현될 수 있다. 소프트웨어 코드는 적절한 프로그램 언어로 쓰여진 소프트웨어 어플리케이션에 의해 구현될 수 있다. 또한, 소프트웨어 코드는 데이터 저장장치 또는 별도의 저장장치(미 도시)에 저장되고, 전술한 장치 구성요소들 중 적어도 하나의 장치 구성요소에 의해 실행될 수 있다. 전술한 본 발명에 따른 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템에 대한 바람직한 실시예에 대하여 설명하였지만, 본 발명은 이에 한정되는 것이 아니고 특허청구범위와 발명의 상세한 설명 및 첨부한 도 면의 범위 안에서 여러 가지로 변형하여 실시하는 것이 가능하고 이 또한 본 발명에 속한다."}
{"patent_id": "10-2023-0022181", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 웹사이트 크롤링 자동화를 통한 머신러닝 모델 생성 시스템을 설명하기 위 한 전체적인 블록 구성도이다."}
