{"patent_id": "10-2023-0133483", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0050451", "출원번호": "10-2023-0133483", "발명의 명칭": "청각장애인을 위한 상황인식 어플리케이션", "출원인": "최용식", "발명자": "이조안"}}
{"patent_id": "10-2023-0133483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자가 입력한 특정 단어 및 이름을 데이터 베이스에 저장하고 있고, 스마트폰 음성입력장치가 저장된 데이터에 해당하는 소리를 입력 받았을 경우, 스마트폰 디스플레이에 현재 상황에 대한 정보를 제공하고 진동을 울리는 서비스 어플리케이션이며, 하기 단계를 포함하는 청각 장애인을 위한 상황 인식 어플리케이션:1. 소리정보, 텍스트를 입력하여 청각장애가 있는 사용자가 인식하고자 하는 상황에 대한 정보를 데이터베이스에 저장하는 단계.2. 상기 데이터베이스에 저장된 음성 정보와 스마트폰의 음성입력 장치에 새롭게 입력되는 음성정보를 비교하는 단계.3. 데이터베이스에 저장된 음성정보와 스마트폰의 음성입력 장치에 새롭게 입력된 음성 정보가 일치하는 경우,해당 상황에 대해 미리 설정한 패턴의 진동과 해당 상황에 대한 정보화면을 사용자에게 제공하는 단계.4. 사용자에게 제공된 진동 및 정보 화면이 사용자가 경험한 상황과 일치하였는지 피드백을 받고 데이터 베이스에 저장하여 성능을 개선하는 단계."}
{"patent_id": "10-2023-0133483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 (1) 단계의 소리정보는 외부에서 입력된 소리정보의 주파수, 진동수 등을 주변 환경 소리에 대한 분석정보를 말하며, 사용자의 이름과 같은 특정 단어나 문구를 식별하는 기능을 포함하는 자연어 처리(NLP), HMM 등의 기술을 포함한 자동 음성 인식(ASR)모듈제 1항에 있어서, 상기 (1) 단계의 텍스트는 사용자의 스마트폰 키보드 입력장치를 통해 입력받은 텍스트 정보이며, 받아 텍스트의 음성에 해당하는 음성정보를 데이터 베이스에 저장하는 모듈상기 자동 음성 인식 모듈과 텍스트 정보를 통해 입력받은 음성정보를 저장할 수 있는 데이터베이스 및 해당 데이터베이스를 관리할 수 있는 인터페이스"}
{"patent_id": "10-2023-0133483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 (2) 단계를 실행하는 모듈은 데이터베이스에 저장된 음성정보를 스마트폰의 음성입력 장치에 새롭게 입력되는 음성정보와 비교하는 상황인식 모듈.제 1항에 있어서, 상기 새롭게 입력 되는 음성 정보는 백그라운드에서 실행되고 있는 본 어플리케이션의 음성입력 기능을 통해 상시 입력되고 있는 음성정보이고, 해당 음성정보를 제 2항의 데이터베이스에 미리 저장해둔 음성정보와 비교하는 상황인식 어플리케이션제 2항에 있어서, 음성인식 완료된 음성정보 데이터를 제공 받아 이를 기반으로 데이터 베이스에 저장하고 있는 음성정보에서 데이터를 검색하고, 음성인식 완료된 음성정보 데이터와 비교하는 시스템"}
{"patent_id": "10-2023-0133483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서 상기 (3)단계에서의 진동을 패턴을 설정하는 기술은 어플리케이션 내, 기존의 데이터베이스에있던 진동의 여러가지 패턴을 미리 제공하여 특정 상황과 특정 상황에 대한 사용자가 원하는 진동 패턴을 제공된 패턴 중에서 선택 할 수 있게 하는 진동패턴설정 시스템상기 미리 제공된 여러가지 \"패턴\"은 연속된 진동은 수평 방향의 선분 \"―\"로 표시되고 짧은 진동의 경우 검은색 점 \"●\"으로 표시하여 진동의 패턴을 알 수 있도록 하고 해당 기호들의 조합을 통해 진동의 패턴을 제공하공개특허 10-2025-0050451-3-는 인터페이스상기 어플리케이션의 데이터베이스에 설정되어 있었던 상황과 적절히 맞는 사진을 정해진 패턴의 진동과 함께사용자의 스마트폰에 제공하는 상황 인식 어플리케이션제 1항에 있어서 상황인식 어플리케이션은 제 3항의 상기 (2)단계의 음성 인식 모듈에서 식별된 특정 단어나 문구 데이터에 대응하여 사용자에게 진동 알림을 제공하는 기능을 포함하는 진동 알림 모듈을 포함하는 상황 인식 어플리케이션"}
{"patent_id": "10-2023-0133483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 데이터베이스에 저장되어 있던 데이터에 맞는 화면정보와 제 4항의 진동 패턴이 제공 된 후, 사용자가 실제 겪은 상황이 일치 하였는지 피드백을 받고 정확도를 평가하는 시스템을 포함한 상황 인식 어플리케이션. 제 1항에 있어서 (4)단계를 위한, 인식된 음성과 사용자에게 필요한 정보가 일치 했는지와 관련된, 신경망(Neural Network), 딥러닝(Deep Learning) 중 적어도 하나의 인공지능(AI) 기반의 기계학습이 있는 인터페이스"}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 청각 장애인들의 주변 상황 인식을 돕기 위한 어플리케이션으로, 스마트폰 음성입력장치가 주변 상황 의 소리를 인식한 후 데이터베이스에 저장되어 있는 소리와 비교하여 일치하였을 때 스마트폰 디스플레이에 현재 상황에 대한 정보를 시각적 이미지를 통해 제공하고 진동을 울린다. 청각장애로 인한 일상 속 불편감을 해소하고 위험한 상황 시 발생을 알려줌으로써 안전을 증진시키며, 의사소통, 일상생활, 안전 등 다양한 측면에서 사용자 를 돕고 사용자들의 풍요로운 삶을 도모하기 위한 어플리케이션에 관한 것이다."}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 청각장애인의 상황 인식 및 파악을 위한 어플리케이션에 관한 것으로, 위험상황이나 일상생활 속의 소리를 휴대용 기기가 인식한 후, 사용자인 청각장애인이 시각적이고 촉각적으로 어플리케이션이 알림을 생성할 수 있는 기능에 관한 것이다."}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명과 관련성 있는 종래기술은 스마트폰에 탑재되어있는 인공지능(AI)의 특정 단어를 말하는 음성을 인식 하고, 특정 데시벨 이상의 소리를 감지하면 이것을 시각(조명)이나 촉각(진동)으로 변환하여 알려주는 기술이다. 그러나 이러한 기술은 전적으로 인공지능(AI)의 판단에 의지하는 것이기 때문에 비슷한 단어를 말하거나 위험하 지는 않더라도 큰 소리가 들리는 경우에도 대상자에게 신호를 보낼 수 있기 때문에 오해하는 상황이 생길 수 있 다는 문제점이 있다. 기존에는 특정 상황을 청각장애인에게 알려주는 기술들이 있으나 이 모두를 종합하여 알려주는 데이터 베이스를 토대로 하지 않는다. 본 발명은 선행기술을 토대로 정보들을 종합하여, 휴대가 간편한 스마트폰 어플리케이션에 적용하여 다양한 알림 패턴과 시각정보를 통해 통합적으로 관리하고 인공지능을 통해 상황인식 기능을 개선시킬 수 있다. 선행기술문헌"}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 청각 장애인을 대상으로 하여 주변 상황을 인식할 수 있도록 하는 서비스를 제공하기 위하여 발명된 것으로, 어플리케이션이 소리를 감지하여 사용자에게 시각적, 촉각적 정보를 제공함으로써 주변 상황에 대한 인 지를 돕는 데에 목적이 있다. 어플리케이션으로 발명하여 사용자가 따로 소리 감지 디바이스를 갖고 다닐 필요 없이 휴대가 용이하게 한다. 이 어플리케이션은 주변 소리를 핸드폰의 마이크를 통해 감지하고, 사용자에게 시각적 정보와 진동으로 알려주 도록 발명되었다. 청각장애로 인하여 일상 속에서 느끼는 불편감을 해소하고 위험한 상황에 처하였을 때 어플리케이션을 통해 이 를 알려줌으로써 도움을 주고 안전을 증진하는 것을 목적으로 한다.이름을 불렀을 때 어플리케이션이 반응을 하며 알려주고 어플리케이션에 저장되어 있는 소리 외에도 개인적인 필요에 따라 소리를 추가적으로 등록하여 사용할 수 있도록 함으로써 청각장애인의 의사소통 능력을 향상시킨다. 아이의 울음 소리를 감지하여 부모에게 전달하거나 초인종 소리, 노크 소리 등과 같은 일상적인 소 리를 감지하여 사용자의 편의성을 향상시키는 데에 목적이 있다. 이런 다양한 상황을 구분하기 위해 진동의 패 턴을 상황별로 달리 설정하여 사용자가 패턴을 통해 어떤 상황인지 구분할 수 있도록 한다. 어플리케이션은 화재 경보, 사이렌, 경적소리 등 위험한 상황을 감지하고 사용자에게 경고 메시지를 제공하여 청각장애인들의 상황인식 능력을 향상시키고 안전성을 확보하는 데 도움을 준다"}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "사용자가 입력한 특정 단어 및 이름을 데이터 베이스에 저장하고 있고, 스마트폰 음성입력장치가 저장된 데이터 에 해당하는 소리를 입력 받았을 경우, 스마트폰 디스플레이에 현재 상황에 대한 정보를 제공하고 진동을 울리 는 서비스 어플리케이션이며, 하기 단계를 포함하는 청각 장애인을 위한 상황 인식 어플리케이션이다. 1. 소리정보, 텍스트를 입력하여 청각장애가 있는 사용자가 인식하고자 하는 상황에 대한 정보를 데이터베이스 에 저장하는 단계. 2. 상기 데이터베이스에 저장된 음성 정보와 스마트폰의 음성입력 장치에 새롭게 입력되는 음성정보를 비교하 는 단계. 3. 데이터베이스에 저장된 음성정보와 스마트폰의 음성입력 장치에 새롭게 입력된 음성 정보가 일치하는 경우, 해당 상황에 대해 미리 설정한 패턴의 진동과 해당 상황에 대한 정보화면을 사용자에게 제공하는 단계. 4. 사용자에게 제공된 진동 및 정보 화면이 사용자가 경험한 상황과 일치하였는지 피드백을 받고 데이터 베이스 에 저장하여 성능을 개선하는 단계. 본 어플리케이션은 제 1항에 있어서, 상기 단계의 소리정보는 외부에서 입력된 소리정보의 주파수, 진동수 등을 주변 환경 소리에 대한 분석정보를 말하며, 사용자의 이름과 같은 특정 단어나 문구를 식별하는 기능을 포 함하는 자연어 처리(NLP), HMM 등의 기술을 포함한 자동 음성 인식(ASR)모듈을 포함한다. 본 어플리케이션은 제 1항에 있어서, 상기 단계의 텍스트는 사용자의 스마트폰 키보드 입력장치를 통해 입 력받은 텍스트 정보이며, 받아 텍스트의 음성에 해당하는 음성정보를 데이터 베이스에 저장하는 모듈을 포함 한다. 본 어플리케이션은 상기 자동 음성 인식 모듈과 텍스트 정보를 통해 입력받은 음성정보를 저장할 수 있는 데이 터베이스 및 해당 데이터베이스를 관리할 수 있는 인터페이스를 포함한다. 본 어플리케이션은 제 1항에 있어서, 상기 단계를 실행하는 모듈은 데이터베이스에 저장된 음성정보를 스마 트폰의 음성입력 장치에 새롭게 입력되는 음성정보와 비교하는 상황인식 모듈을 포함한다. 본 어플리케이션은 제 1항에 있어서, 상기 새롭게 입력 되는 음성 정보는 백그라운드에서 실행되고 있는 본 어 플리케이션의 음성입력 기능을 통해 상시 입력되고 있는 음성정보이고, 해당 음성정보를 제 2항의 데이터베이스 에 미리 저장해둔 음성정보와 비교하는 상황인식 어플리케이션이다. 본 어플리케이션은 제 2항에 있어서, 음성인식 완료된 음성정보 데이터를 제공 받아 이를 기반으로 데이터 베 이스에 저장하고 있는 음성정보에서 데이터를 검색하고, 음성인식 완료된 음성정보 데이터와 비교하는 시스템을 포함한다. 본 어플리케이션은 제 1항에 있어서 상기 단계에서의 진동을 패턴을 설정하는 기술은 어플리케이션 내, 기존 의 데이터베이스에 있던 진동의 여러가지 패턴을 미리 제공하여 특정 상황과 특정 상황에 대한 사용자가 원하는 진동 패턴을 제공된 패턴 중에서 선택 할 수 있게 하는 진동패턴설정 시스템을 포함한다. 상기 미리 제공된 여러가지 \"패턴\"은 연속된 진동은 수평 방향의 선분 \"―\"으로 표시되고 짧은 진동의 경우 검 은색 점 \"●\" 으로 표시하여 진동의 패턴을 알 수 있도록 하고 해당 기호들의 조합을 통해 진동의 패턴을 제공 하는 인터페이스이다. 본 어플리케이션은 상기 어플리케이션의 데이터베이스에 설정되어 있었던 상황과 적절히 맞는 사진을 정해진 패 턴의 진동과 함께 사용자의 스마트폰에 제공하는 상황 인식 어플리케이션이다.제 1항에 있어서 상황인식 어플리케이션은 제 3항의 상기 단계의 음성 인식 모듈에서 식별된 특정 단어나 문 구 데이터에 대응하여 사용자에게 진동 알림을 제공하는 기능을 포함하는 진동 알림 모듈을 포함하는 상황 인 식 어플리케이션이다. 제 4항에 있어서, 상기 데이터베이스에 저장되어 있던 데이터에 맞는 화면정보와 제 4항의 진동 패턴이 제공 된 후, 사용자가 실제 겪은 상황이 일치 하였는지 피드백을 받고 정확도를 평가하는 시스템을 포함한 상황 인식 어 플리케이션이다. 본 어플리케이션은 제 1항에 있어서 단계를 위한, 인식된 음성과 사용자에게 필요한 정보가 일치 했는지와 관련된, 신경망(Neural Network), 딥러닝(Deep Learning) 중 적어도 하나의 인공지능(AI) 기반의 기계학습이 있는 인터페이스를 포함한다."}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "시야에서 벗어난 상황이나, 알림을 들어야 하는 상황등 일상적인 상황에서 청각장애인들의 상황 인식을 도와 원 활하게 의사소통을 하고 안전을 도모할 수 있다. 아래와 같은 효과가 있다: 1) 이름을 등록할 때, 다양한 목소리와 어조로 등록하여 잘못 인식하게 되는 경우의 수를 줄일 수 있다. 등록된 이름을 핸드폰이 인식할 경우 정해진 패턴의 진동을 울려 대상자가 자신의 이름을 부른 소리에 반응할 수 있다. 이를 통해 발달단계에 있는 아동의 언어발달에 기여하고, 가정, 학교 등 기타 장 소에서 대상자가 보다 원활한 의사소통을 할 수 있다. 2) 화재 경보, 사이렌, 자동차 경적 소리, 개의 짖는 소리 등 소리를 통해 위험을 인식해야 하는 상황에서 상황 에 대한 판단이 늦어지고 그에 따라 발생할 수 있는 보다 큰 위험이나 2차적인 위험으로부터 보호한다. 3) 초인 종 소리, 노크소리 등 일상적인 소리정보를 사용자에게 알림으로써 대상자의 일상생활의 편의를 증진시켜주는데 기여할 수 있다. 4) 아이의 울음소리를 듣고 반응해야하는 청각장애인 부모에게 아이가 울고 있다는 것을 전달 하여 빠르게 조치를 취할 수 있다. 5) 기타 일정 데시벨을 초과하는 소리가 나는 경우 대상자에게 알려줄 수 있 다. 종합적으로 어플리케이션은 타인에게 도움을 받는 상황 이외에 청각장애인이 혼자서 할 수 있는 일의 선택지를 넓힐 수 있고, 특히 발달 단계의 아동의 독립심과 자존감을 형성하는데 도움이 될 수 있을 것이다. 유아기는 언 어능력 발달에 매우 중요한 시기 이므로 이름을 인식해서 눈을 마주친 상태에서 대화할 수 있는 기회를 더 자주 제공해주는 것이 도움이 될 수 있을 것이다. 또한 시각적인 상호작용 이외에도 청각적으로 반응을 할 수 있는 기회를 제공하여 부모와 자식간의 유대관계 증진에도 기여할 수 있을 것으로 기대된다. 청각장애인을 위한 상황인식 어플리케이션은 사용자들의 삶을 더 풍요롭게 만들고, 의사소통, 안전, 일상생활, 교육, 육아 등 다양한 측면에서 도움을 줄 수 있을 것이다."}
{"patent_id": "10-2023-0133483", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 어플리케이션은 사용자가 입력한 특정 단어 및 이름을 데이터 베이스에 저장하고 있고, 스마트폰 음성입력장 치가 저장된 데이터에 해당하는 소리를 입력 받았을 경우, 스마트폰 디스플레이에 현재 상황에 대한 정보를 제 공하고 미리 지정된 패턴의 진동을 울리는 서비스 어플리케이션이다. 서비스 제공의 목적을 달성하기 위해 본 어플리케이션은 다음과 같은 단계로 구성된다. 1단계 : 소리정보, 텍스트를 입력하여 청각장애가 있는 사용자가 인식하고자 하는 상황에 대한 정보를 데이터 베이스에 저장하는 단계 2단계 : 저장된 데이터베이스의 음성 정보와 스마트폰의 음성입력 장치에 새롭게 입력되는 음성정보를 비교하는 단계 3단계 : 데이터베이스에 저장된 음성정보와 스마트폰의 음성입력 장치에 새롭게 입력된 음성 정보가 일치할 경 우, 해당 상황에 대해 미리 설정한 패턴의 진동과 해당 상황에 대한 정보화면을 제공하는 단계 4단계 : 사용자에게 제공된 진동과, 화면 정보가 사용자가 경험한 상황과 일치하였는지 피드백을 받고 데이터 베이스에 저장하여 성능을 개선하는 단계 소리 정보를 입력받을 수 있는 스마트폰의 마이크 기능을 통해 입력받은 소리 정보와, 입력받은 텍스트를 소리 정보로 변환하여 데이터 베이스에 저장하는 데이터 관리 시스템을 포함한다. 해당 어플리케이션은 백그라운드에서 실행되어 특정 음성정보를 스마트폰의 마이크를 통해 입력 받았을 때 입력 받은 음성정보를 해당 어플리케이션에 저장되어 있는 소리 DB에서 검색하여 비교 한 후, 데이터 베이스에 있는 특정 음성 정보와 일치하는지 확인한다. 새롭게 입력받은 정보와 DB상의 정보가 일치할 경우 해당 상황에 대해 미리 설정한 패턴의 진동과 해당 상황에 대한 정보 화면을 제공한다. 진동의 패턴을 설정을 위해 사용자가 입력한 정보와 어플리케이션에서 제공하는 \"―\"와 \"●\"기호로 구성된 진동 패턴표시를 사용자가 원하는 데로 선택하여 매칭한다. 진동의 강도, 연속된 진동과 짧은 진동의 패턴 변화를 상황에 맞게 다르게 설정하여 사용자가 진동만을 통해서 도 정보를 제공받을 수 있다. 화면은 스마트폰의 디스플레이를 말하며, 어플리케이션 상의 정보 제공 화면은 기존 입력된 데이터와 새롭게 입 력된 데이터가 일치할 경우 해당 상황을 설명할 수 있는 사진이나 글을 포함한다. 인공지능의 딥러닝 기술 등을 이용하여 사용자에게 제공된 진동과 화면 정보가 적절하였는지 사용자에게 피드백 을 받아 후에 기능을 개선할 수 있도록 한다. 도1은 사용자가 어플리케이션 실행시에 나타나는 화면이다. 도1을 참조하면, 어플리케이션의 로고와 로그인(1-1), 회원가입(1-2)을 하는 버튼을 포함한다. 도1의 로그인을 시행한 후, 도2의 소리를 등록하는 '소리 등록(2-1)' 아이콘 과 저장된 소리 목록을 보는 '저장 된 소리 목록(2-2)' 아이콘이 표시되는 화면으로 이동한다. 도2의 '저장된 소리 목록'(2-2)을 누르면 도3의 '일상생활(3-1)', '위험상황(3-2)'와 '나만의 소리(3-3)' 3 가지 아이콘을 포함한 화면으로 이동한다. '소리 등록(2-1)'을 누르면 도7의 화면으로 이동한다. 도7의 화면은 설정하는 소리의 제목, 실시 예로 '곰돌 아'(7-1), '녹음' 아이콘(7-2), '텍스트' 아이콘(7-3), 그리고 '진동' 아이콘(7-4)을 포함한다. 도7의 '녹음' 아이콘(7-2)를 누르면 녹음 아이콘(7-6)을 눌러 특정 상황의 소리를 녹음할 수 있다. 도7의 '텍스트' 아이콘(7-3)을 누르면 도8로 화면 이동하여 상황에 맞는 단어나 문장을 AI가 인식할 수 있도록 하는 텍스트를 입력할 수 있는 텍스트 아이콘(8-6)이 나타난다. 도7의 '진동' 아이콘(7-4)를 누르면 도9로 화면 이동하여 진동의 세기(9-1)와 박자(9-2)를 설정할 수 있는 아이 콘이 나타난다. 도7의 화면은 설정한 소리가 감지되었을 때, 사진을 스마트폰의 화면에 띄울 수 있도록 하는 '사진설정' 아이콘 (7-5)도 포함한다. 도3의 '나만의 소리'(3-3)를 누르면 실시예로, '곰돌아'(6-1)와 '초인종소리'(6-2)가 포함된다. '곰돌아'(6- 1)은 사용자의 이름이 불렸을 때 알 수 있도록 사용자의 이름을 저장하는 버튼이다. 이 두 가지 소리는 사용자 가 직접 해당 상황의 특정 소리를 녹음하거나 상황에 맞는 단어나 문장을 텍스트로 입력하여 AI가 인식하여 비교할 수 있도록 한다. 한편,도3의 '일상생활(3-1)' 아이콘을 누르면 도4의 문 똑똑소리(4-1), 개짖는 소리(4-2), 아기 울음소리(4- 3), 가전제품 알림(4-4)과 같은 여러가지 상황의 아이콘을 포함하는 화면으로 이동한다. 도3의 '위험상황(3-2)' 아이콘 누르면 도5의 사이렌소리(5-1), 냄비 끓는 소리(5-2), 가스 밸브 자동 잠금 알림 음(5-3) ,그리고 자동차 경적 소리(5-4) 아이콘을 포함하는 화면으로 이동한다. 도3의 '일상생활(3-1)'과 '위험상황(3-2)'은 어플리케이션의 데이터베이스에 설정되어있는 소리를 기반으로 하 여 사용자에게 알림을 주기 때문에 각각의 아이콘을 눌러 도10의 화면처럼 진동 세기(10-3)와 패턴(10-4)만 설정할 수 있다. 도11은 어플리케이션에 설정된 소리와 동일한 소리가 감지되었을 때, 설정해놓은 사진이 스마트폰 화면에 깜박 이면서 알림창(11-1)로 나타나며 상황마다 다르게 설정해놓은 특정한 패턴의 진동이 울린다. 따라서 스마트폰 화면을 보지 않더라도 진동의 박자를 통해 사용자는 어떤 자신이 어떤 상황인지 인지할 수 있다 도12는 어플리케이션에 설정된 소리와 동일한 소리가 감지되었을 때, 설정해놓은 사진이 스마트폰 화면에 깜박 이면서 알림창(12-1)로 나타나며 상황마다 다르게 설정해놓은 특정한 패턴의 진동이 울린다. 따라서 스마트폰 화면을 보지 않더라도 진동의 박자를 통해 사용자는 어떤 자신이 어떤 상황인지 인지할 수 있다. 'MY'(6-10)을 누르면 마이페이지(도13)로 이동하는데, 자신이 회원가입할 때 설정한 닉네임과 계정(13-1), 테마 색 변경(13-2), 고객센터(13-3)의 아이콘이 있다. 도14는 피드백을 받을 수 있는 알림창이 뜨는 화면이다. 도14를 참조하면 알림이 울린 후 해당 알림이 적절했는지, 상황을 인식하는데 용이했는지를 판단하기 위해 알림 이 울린 후에는 '해당 알림이 도움이 되셨나요?(14-1)'라는 문구를 제공하여 사용자에게 필요여부를 판단하여 피드백을 할 수 있다."}
{"patent_id": "10-2023-0133483", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1: 계정 로그인 또는 회원가입 도2: 로그인 유지 되었을 시 앱 실행시키고 첫 화면 도3: 등록된 소리 항목: 일상생활/ 위험상황/ 나만의 소리 도4: 등록된 소리 목록: 일상생활 도5: 등록된 소리 목록: 위험상황 도6: 등록된 소리 목록: 나만의 소리 도7: 새로 소리 등록: 녹음 도8: 새로 소리 등록: 텍스트 입력 도9: 새로 등록한 소리에 대한 진동 설정; 세기, 패턴 도10: 기존의 일상생활, 위험상황 소리에 대한 진동 설정 변경: 세기, 패턴 도11: 어플리케이션이 소리를 인식한 후 시각적 이미지 띄운 화면 - ex. 문 똑똑도12: 어플리케이션이 소리를 인식한 후 시각적 이미지 띄운 화면 - ex. 사이렌 도13: 마이페이지 도14: 피드백"}
