{"patent_id": "10-2024-0048397", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0036659", "출원번호": "10-2024-0048397", "발명의 명칭": "모국어 습득 원리를 적용한 영어 교육을 수행함에 있어, 인공지능을 이용하여 사용자 단말에", "출원인": "아이보람 주식회사", "발명자": "신은미"}}
{"patent_id": "10-2024-0048397", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "뉴럴 네트워크(neural network)를 이용하여 서버가 사용자 단말에게 영어 글쓰기 서비스를 제공하는 방법에 있어서,사용자 단말로부터 글쓰기에 대한 소재 요청 메시지를 수신하는 단계;상기 소재 요청 메시지는 사용자에 대한 개인 정보, 글의 형식에 대한 정보 및 사용자의 독서 정보를 포함하고,상기 사용자에 대한 개인 정보 및 상기 글의 형식에 대한 정보를 기반으로 제1 뉴럴 네트워크를 이용하는 이미지 수집 모델을 통해 소재 선정을 위한 복수의 이미지 세트를 결정하는 단계;상기 이미지 세트는 대분류 이미지, 상기 대분류 이미지에 대한 복수의 중분류 이미지 및 상기 복수의 중분류이미지 각각에 대한 복수의 소분류 이미지를 포함하고,상기 복수의 소분류 이미지 각각은 글쓰기 소재와 매칭되고,상기 복수의 이미지 세트를 포함하는 선택 요청 메시지를 상기 사용자 단말에게 전송하는 단계; 상기 복수의 소분류 이미지 중에서 상기 사용자 단말에 의해 선택된 소분류 이미지를 수신하는 단계;상기 사용자에 대한 개인 정보, 상기 글의 형식에 대한 정보, 상기 사용자의 독서 정보 및 상기 소분류 이미지에 매칭된 글쓰기 소재를 기반으로 제2 뉴럴 네트워크를 이용하는 제1 질문 생성 모델을 통해 상기 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질문을 생성하는 단계;상기 제1 질문을 LLM(large language model) 서버에 전송하는 단계;상기 LLM 서버로부터 복수의 키워드를 수신하는 단계;상기 글쓰기 소재, 상기 복수의 키워드 및 글쓰기와 관련된 인터페이스 정보를 포함하는 소재 선정 메시지를 상기 사용자 단말에게 전송하는 단계; 및상기 글쓰기 소재와 상기 복수의 키워드는 상기 글쓰기와 관련된 인터페이스 정보에 기반하여 상기 글의 형식마다 상이하게 상기 사용자 단말의 화면에 표시되고, 상기 글의 형식에 따라 텍스트를 입력하는 창의 개수 및 형태가 상이하고,상기 사용자 단말로부터 상기 글쓰기 소재와 상기 복수의 키워드를 기반으로 작성된 글을 수신하는 단계를 포함하고,상기 사용자에 대한 개인 정보에 대한 데이터 전처리를 기반으로 사용자의 나이에 대한 값 및 사용자의 성별에대한 값을 포함하는 사용자 벡터가 생성되고,상기 사용자 벡터를 기반으로 복수의 검색 포탈 웹 페이지에 대한 웹 크롤링을 통해 복수의 실시간 검색어가 획득되고,상기 복수의 실시간 검색어에 대한 데이터 전처리를 기반으로 복수의 키워드 벡터가 생성되고,상기 글의 형식에 대한 정보에 대한 데이터 전처리를 통해 글의 형식에 대한 값을 포함하는 형식 벡터가 생성되고,상기 형식 벡터에 대해 사전 설정된 n개의 카테고리 중에서 상기 복수의 키워드 벡터 각각에 대해 매칭되는 카테고리가 결정되고,상기 사용자 벡터 및 상기 카테고리에 설정된 주제 벡터가 상기 이미지 수집 모델에 입력되는 것에 기반하여 이미지 세트가 출력되고,상기 제1 뉴럴 네트워크는 제1 입력 레이어, 하나 이상의 제1 히든 레이어 및 제1 출력 레이어를 포함하고,공개특허 10-2025-0036659-3-복수의 사용자 벡터, 복수의 주제 벡터 및 복수의 정답 이미지 세트로 구성된 각각의 제1 뉴럴 네트워크의 학습을 위한 데이터는 상기 제1 뉴럴 네트워크의 상기 제1 입력 레이어에 입력되고, 상기 하나 이상의 제1 히든 레이어 및 제1 출력 레이어를 통과하여 제1 출력 벡터를 출력하고, 상기 제1 출력 벡터는 상기 제1 출력 레이어에연결된 제1 손실함수 레이어에 입력되고, 상기 제1 손실함수 레이어는 상기 제1 출력 벡터와 각각의 학습 데이터에 대한 제1 정답 벡터를 비교하는 제1 손실 함수를 이용하여 제1 손실값을 출력하고, 상기 제1 뉴럴 네트워크의 파라미터가 상기 제1 손실값이 작아지는 방향으로 학습되고,상기 소분류 이미지에 매칭된 글쓰기 소재에 대한 데이터 전처리를 통해 글쓰기 소재에 대한 소재 벡터가 생성되고,상기 글의 형식에 대한 정보 및 상기 사용자의 독서 정보에 대한 데이터 전처리를 통해 글의 형식에 대한 값 및사용자의 독서 장르별 독서량과 관련된 값을 포함하는 설정 벡터가 생성되고,상기 사용자 벡터, 상기 소재 벡터 및 상기 설정 벡터가 상기 제1 질문 생성 모델에 입력되는 것에 기반하여,상기 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질문이 출력되고,상기 글쓰기 소재와 관련된 키워드의 개수는 상기 사용자 벡터 및 상기 설정 벡터에 기반하여 결정되고,상기 사용자 단말로부터 예문 요청 메시지를 수신하는 단계;상기 예문 요청 메시지는 상기 복수의 키워드 중 적어도 하나의 키워드 및 영문 예문 여부를 나타내는 값을 포함하고,상기 적어도 하나의 키워드에 대한 단어 임베딩을 통해 적어도 하나의 키워드 벡터가 생성되고,상기 적어도 하나의 키워드 벡터 및 상기 영문 예문 여부를 나타내는 값을 포함하는 예문 설정 벡터가생성되고,상기 사용자 벡터, 상기 소재 벡터, 상기 설정 벡터 및 상기 예문 설정 벡터를 기반으로 제3 뉴럴 네트워크를이용하는 제2 질문 생성 모델을 통해 상기 적어도 하나의 키워드와 관련된 예문을 추출하기 위한 제2 질문을 생성하는 단계;상기 제2 질문을 상기 LLM 서버에 전송하는 단계;상기 LLM 서버로부터 상기 적어도 하나의 키워드와 관련된 예문을 수신하는 단계; 및상기 적어도 하나의 키워드와 관련된 예문을 상기 사용자 단말에게 전송하는 단계를 더 포함하되,상기 적어도 하나의 키워드와 관련된 예문의 길이는 상기 사용자 벡터 및 상기 설정 벡터에 기반하여 결정되고,상기 복수의 키워드별로 글이 작성된 이후, 상기 복수의 키워드별로 작성된 글이 상기 사용자 단말에 의해 글의순서가 재배치되는 것에 기반하여, 상기 서버는 변경된 글의 순서에 대한 정보를 상기 사용자 단말로부터 수신하고, 상기 사용자 단말에게 변경된 글의 순서에 따라 문장 또는 문단 사이의 관계언을 전송하는, 방법."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들은 모국어 습득 원리를 적용한 영어 교육을 수행함에 있어, 인공지능을 이용하여 사용자 단말에게 영어 글쓰기의 예문을 제공하는 방법 및 장치를 제시한다. 일 실시예에 따른 상기 방법은, 사용자 단말로부터 글쓰기 에 대한 소재 요청 메시지를 수신하고, 상기 소재 요청 메시지는 사용자에 대한 개인 정보, 글의 형식에 대한 정 (뒷면에 계속)"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 실시예들은 사용자 단말에게 영어 글쓰기의 예문을 제공하는 기술에 관한 것으로, 모국어 습득 원리 를 적용한 영어 교육을 수행함에 있어, 인공지능을 이용하여 사용자 단말에게 영어 글쓰기의 예문을 제공하는 방법 및 장치에 대한 것이다."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 논술과 심층구술이 대학입시에 매우 중요한 요소로 포함되면서, 독서지도, 글쓰기, 논술 등의 교육에 대한 니즈가 높아지고 있다. 이러한 소비자의 니즈에 따라 사이버 공간을 이용하여 저널, 뉴스 기사, 에세이 쓰기 등 의 다양한 글쓰기 활동을 지원하는 서비스가 늘어나고 있다. 특히, 영어 글쓰기 지도는 한글로의 글쓰기 능력을 전제로 하기 때문에, 한글로의 글쓰기 능력이 우선 배양되어 있지 않으면, 영어 글쓰기 지도에 대한 효과가 감소하는 문제가 있다. 또한, 학습자가 직접 글을 쓰기 전까지는 학습자의 글쓰기 능력을 파악할 수 없는 문제가 있다. 이에 따라, 인공지능을 활용한 사용자가 관심 있는 키워드들을 기반으로 글쓰기 이전에 생각을 다듬을 수 있게 먼저 글의 종류, 글의 소재, 글의 키워드들을 씽킹 맵(thinking map) 형태로 먼저 제공하며, 학습자의 평소 독 서량을 측정하여 측정된 독서량에 따라 글쓰기 능력을 파악하여 학습자의 작문 실력에 맞는 키워드를 제공하는 것이 필요하다. 한편, 글쓰기에 대한 주제는 일반적인 주제가 제시되는 경우가 많아 학습자들이 글쓰기에 대한 흥미를 잃을 수 있는 문제가 있으므로, 학습자들의 글쓰기에 대한 관심을 향상시키기 위한 방법 또한 필요하다. 이에, 사용자에 대한 개인 정보 및 글의 형식에 대한 정보를 기반으로 뉴럴 네트워크를 이용하는 이미지 수집 모델을 통해 소재 선정을 위한 복수의 이미지 세트를 결정하고, 복수의 이미지 세트 중에서 사용자 단말에 의해 선택된 이미지에 대한 글쓰기 소재와 사용자의 독서 정보를 기반으로 뉴럴 네트워크를 이용하여 키워드를 추출 하고, 글쓰기 소재 및 추출된 키워드에 대한 영어 글쓰기 서비스를 제공하는 방법 및 장치가 필요하다."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 실시예들은, 모국어 습득 원리를 적용한 영어 교육을 수행함에 있어, 인공지능을 이용하여 사용자 단 말에게 영어 글쓰기의 예문을 제공하는 방법 및 장치를 제공할 수 있다. 실시예들에서 이루고자 하는 기술적 과제들은 이상에서 언급한 사항들로 제한되지 않으며, 언급하지 않은 또 다"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "른 기술적 과제들은 이하 설명할 다양한 실시예들로부터 당해 기술분야에서 통상의 지식을 가진 자에 의해 고려 될 수 있다."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 뉴럴 네트워크(neural network)를 이용하여 서버가 사용자 단말에게 영어 글쓰기 서비스를 제 공하는 방법은, 사용자 단말로부터 글쓰기에 대한 소재 요청 메시지를 수신하고, 상기 소재 요청 메시지는 사용 자에 대한 개인 정보, 글의 형식에 대한 정보 및 사용자의 독서 정보를 포함하고, 상기 사용자에 대한 개인 정 보 및 상기 글의 형식에 대한 정보를 기반으로 제1 뉴럴 네트워크를 이용하는 이미지 수집 모델을 통해 소재 선 정을 위한 복수의 이미지 세트를 결정하고, 상기 이미지 세트는 대분류 이미지, 상기 대분류 이미지에 대한 복 수의 중분류 이미지 및 상기 복수의 중분류 이미지 각각에 대한 복수의 소분류 이미지를 포함하고, 상기 복수의 소분류 이미지 각각은 글쓰기 소재와 매칭되고, 상기 복수의 이미지 세트를 포함하는 선택 요청 메시지를 상기 사용자 단말에게 전송하고, 상기 복수의 소분류 이미지 중에서 상기 사용자 단말에 의해 선택된 소분류 이미지 를 수신하고, 상기 사용자에 대한 개인 정보, 상기 글의 형식에 대한 정보, 상기 사용자의 독서 정보 및 상기 소분류 이미지에 매칭된 글쓰기 소재를 기반으로 제2 뉴럴 네트워크를 이용하는 제1 질문 생성 모델을 통해 상 기 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질문을 생성하고, 상기 제1 질문을 LLM(large language model) 서버에 전송하고, 상기 LLM 서버로부터 복수의 키워드를 수신하고, 상기 글쓰기 소재, 상기 복수의 키워 드 및 글쓰기와 관련된 인터페이스 정보를 포함하는 소재 선정 메시지를 상기 사용자 단말에게 전송하고, 상기 글쓰기 소재와 상기 복수의 키워드는 상기 글쓰기와 관련된 인터페이스 정보에 기반하여 상기 글의 형식마다 상 이하게 상기 사용자 단말의 화면에 표시되고, 상기 사용자 단말로부터 상기 글쓰기 소재와 상기 복수의 키워드 를 기반으로 작성된 글을 수신하는 단계를 포함할 수 있다."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 따르면, 서버는 사용자에 대한 개인 정보 및 글의 형식에 대한 정보를 기반으로 제1 뉴럴 네트워크 를 이용하는 이미지 수집 모델을 통해 소재 선정을 위한 복수의 이미지 세트를 결정하여 사용자 단말에게 소재 선정을 위한 복수의 이미지 세트를 제공함으로써, 사용자의 글쓰기 소재 선택에 대한 흥미를 유발할 수 있다. 실시예들에 따르면, 서버는 사용자에 대한 개인 정보, 글의 형식에 대한 정보, 사용자의 독서 정보 및 글쓰기 소재를 기반으로 제2 뉴럴 네트워크를 이용하는 제1 질문 생성 모델을 통해 글쓰기 소재와 관련된 키워드를 추 출하기 위한 제1 질문을 생성하여 LLM(large language model) 서버에게 제공할 수 있다. 이를 통해, 서버는 사용자 단말의 나이 및 성별 뿐만 아니라 독서량 또한 고려하여 사용자에게 적합한 키워드를 추출할 수 있는 질문 을 생성할 수 있다. 또한, 서버는 직접적으로 서버 자체의 연산 능력을 사용하지 않고, 외부의 LLM 서버를 사용 함으로써 데이터 처리에 대한 연산으로 인한 부하를 감소시킬 수 있다. 실시예들로부터 얻을 수 있는 효과들은 이상에서 언급된 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 이하의 상세한 설명을 기반으로 당해 기술분야에서 통상의 지식을 가진 자에게 명확하게 도출되고 이해 될 수 있다."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 실시예들은 실시예들의 구성요소들과 특징들을 소정 형태로 결합한 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려될 수 있다. 각 구성요소 또는 특징은 다른 구성요소나 특 징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 다양한 실시예 들을 구성할 수도 있다. 다양한 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있 다. 도면에 대한 설명에서, 다양한 실시예들의 요지를 흐릴 수 있는 절차 또는 단계 등은 기술하지 않았으며, 당해"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자의 수준에서 이해할 수 있을 정도의 절차 또는 단계는 또한 기술하지 아니 하였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"...부\", \"...기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 또한, \"일(a 또는 an)\", \"하나(one)\", \"그(the)\" 및 유사 관련어는 다양한 실시예들을 기술하는 문맥에 있어서(특히, 이하의 청구항의 문맥에서) 본 명세서에 달리 지시되거나 문맥에 의해 분명하게 반박되지 않는 한, 단수 및 복 수 모두를 포함하는 의미로 사용될 수 있다. 이하, 다양한 실시예들에 따른 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이 하에 개시될 상세한 설명은 다양한 실시예들의 예시적인 실시 형태를 설명하고자 하는 것이며, 유일한 실시형태 를 나타내고자 하는 것이 아니다. 또한, 다양한 실시예들에서 사용되는 특정(特定) 용어들은 다양한 실시예들의 이해를 돕기 위해서 제공된 것이 며, 이러한 특정 용어의 사용은 다양한 실시예들의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 도 1은 일 실시예에 따른 전자 장치의 구성을 나타내는 도면이다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 전자 장치는 클라이언트, 단말기 또는 피 어로 지칭될 수도 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 서버는 전자 장치가 접속되며, 접속된 전자 장치로 서비스를 제공할 수 있다. 또한, 서버 는 회원 가입 절차를 진행하여 그에 따라 회원으로 가입된 사용자의 각종 정보를 저장하여 관리하고, 서비스에 관련된 각종 구매 및 결제 기능을 제공할 수도 있다. 또한, 서버는, 사용자 간에 서비스를 공유할 수 있도 록, 복수의 전자 장치 각각에서 실행되는 서비스 애플리케이션의 실행 데이터를 실시간으로 공유할 수도있다. 이러한 서버는 하드웨어적으로는 통상적인 웹 서버(Web Server) 또는 서비스 서버(Service Server) 와 동일한 구성을 가질 수 있다. 그러나, 소프트웨어적으로는, C, C++, Java, Python, Golang, kotlin 등 여하 한 언어를 통하여 구현되어 여러 가지 기능을 하는 프로그램 모듈(Module)을 포함할 수 있다. 또한, 서버 는 일반적으로 인터넷과 같은 개방형 컴퓨터 네트워크를 통하여 불특정 다수 클라이언트 및/또는 다른 서버와 연결되어 있고, 클라이언트 또는 다른 서버의 작업수행 요청을 접수하고 그에 대한 작업 결과를 도출하여 제공 하는 컴퓨터 시스템 및 그를 위하여 설치되어 있는 컴퓨터 소프트웨어(서버 프로그램)를 뜻하는 것이다. 또한, 서버는, 전술한 서버 프로그램 이외에도, 서버 상에서 동작하는 일련의 응용 프로그램(Application Program)과 경우에 따라서는 내부 또는 외부에 구축되어 있는 각종 데이터베이스(DB: Database, 이하 \"DB\"라 칭 함)를 포함하는 넓은 개념으로 이해되어야 할 것이다. 따라서, 서버는, 회원 가입 정보와, 게임에 대한 각 종 정보 및 데이터를 분류하여 DB에 저장시키고 관리하는데, 이러한 DB는 서버의 내부 또는 외부에 구현될 수 있다. 또한, 서버는, 일반적인 서버용 하드웨어에 윈도우(windows), 리눅스(Linux), 유닉스(UNIX), 매 킨토시(Macintosh) 등의 운영체제에 따라 다양하게 제공되고 있는 서버 프로그램을 이용하여 구현될 수 있으며, 대표적인 것으로는 윈도우 환경에서 사용되는 IIS(Internet Information Server)와 유닉스환경에서 사용되는 CERN, NCSA, APPACH, TOMCAT 등을 이용하여 웹 서비스를 구현할 수 있다. 또한, 서버는, 서비스의 사용자 인증이나 서비스와 관련된 구매 결제를 위한 인증 시스템 및 결제 시스템과 연동할 수도 있다. 제1 네트워크 및 제2 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능 한 연결 구조 또는 서버와 전자 장치들(101, 104)을 연결하는 망(Network)을 의미한다. 제1 네트워크 및 제2 네트워크는 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 3G, 4G, LTE, 5G, Wi-Fi 등이 포함되나 이 에 한정되지는 않는다. 제1 네트워크 및 제2 네트워크는 LAN, WAN 등의 폐쇄형 제1 네트워크 및 제2 네트워크일 수도 있으나, 인터넷(Internet)과 같은 개방형인 것이 바람직하다. 인터넷은 TCP/IP 프로 토콜, TCP, UDP(user datagram protocol) 등의 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service)를 제공하는 전 세계적인 개방형 컴퓨터 제1 네트워크 및 제 2 네트워크 구조를 의미한다. 데이터베이스는 데이터베이스 관리 프로그램(DBMS)을 이용하여 컴퓨터 시스템의 저장공간(하드디스크 또는 메모 리)에 구현된 일반적인 데이터구조를 가질 수 있다. 데이터베이스는 데이터의 검색(추출), 삭제, 편집, 추가 등 을 자유롭게 행할 수 있는 데이터 저장형태를 가질 수 있다. 데이터베이스는 오라클(Oracle), 인포믹스 (Infomix), 사이베이스(Sybase), DB2와 같은 관계형 데이타베이스 관리 시스템(RDBMS)이나, 겜스톤(Gemston), 오리온(Orion), O2 등과 같은 객체 지향 데이타베이스 관리 시스템(OODBMS) 및 엑셀론(Excelon), 타미노 (Tamino), 세카이주(Sekaiju) 등의 XML 전용 데이터베이스(XML Native Database)를 이용하여 본 개시의 일 실 시예의 목적에 맞게 구현될 수 있고, 자신의 기능을 달성하기 위하여 적당한 필드(Field) 또는 엘리먼트들을 가 질 수 있다. 도 2는 일 실시예에 따른 프로그램의 구성을 나타내는 도면이다. 도 2은 다양한 실시예에 따른 프로그램을 예시하는 블록도이다. 일실시예에 따르면, 프로그램은 전자 장치의 하나 이상의 리소스들을 제어하기 위한 운영 체제, 미들웨어, 또는 상기 운영 체제 에서 실행 가능한 어플리케이션을 포함할 수 있다. 운영 체제는, 예를 들면, AndroidTM, iOSTM, WindowsTM, SymbianTM, TizenTM, 또는 BadaTM를 포함할 수 있다. 프로그램 중 적어도 일부 프로그 램은, 예를 들면, 제조 시에 전자 장치에 프리로드되거나, 또는 사용자에 의해 사용 시 외부 전자 장치(예: 전자 장치(102 또는 104), 또는 서버)로부터 다운로드되거나 갱신 될 수 있다. 프로그램의 전부 또는 일부는 뉴럴 네트워크를 포함할 수 있다. 운영 체제는 전자 장치의 하나 이상의 시스템 리소스들(예: 프로세스, 메모리, 또는 전원)의 관리(예: 할당 또는 회수)를 제어할 수 있다. 운영 체제는, 추가적으로 또는 대체적으로, 전자 장치 의 다른 하드웨어 디바이스, 예를 들면, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 구동하기 위한 하나 이상의 드라이 버 프로그램들을 포함할 수 있다.미들웨어는 전자 장치의 하나 이상의 리소스들로부터 제공되는 기능 또는 정보가 어플리케이션 에 의해 사용될 수 있도록 다양한 기능들을 어플리케이션으로 제공할 수 있다. 미들웨어는, 예를 들 면, 어플리케이션 매니저, 윈도우 매니저, 멀티미디어 매니저, 리소스 매니저, 파워 매니 저, 데이터베이스 매니저, 패키지 매니저, 커넥티비티 매니저, 노티피케이션 매니저, 로케이션 매니저, 그래픽 매니저, 시큐리티 매니저, 통화 매니저, 또는 음성 인식 매니저 를 포함할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션의 생명 주기를 관리할 수 있다. 윈도우 매니저 는, 예를 들면, 화면에서 사용되는 하나 이상의 GUI 자원들을 관리할 수 있다. 멀티미디어 매니저는, 예를 들면, 미디어 파일들의 재생에 필요한 하나 이상의 포맷들을 파악하고, 그 중 선택된 해당하는 포맷에 맞 는 코덱을 이용하여 상기 미디어 파일들 중 해당하는 미디어 파일의 인코딩 또는 디코딩을 수행할 수 있다. 리 소스 매니저는, 예를 들면, 어플리케이션의 소스 코드 또는 메모리의 메모리의 공간을 관리할 수 있다. 파워 매니저는, 예를 들면, 배터리의 용량, 온도 또는 전원을 관리하고, 이 중 해당 정보를 이용하여 전자 장치의 동작에 필요한 관련 정보를 결정 또는 제공할 수 있다. 일실시예에 따르면, 파워 매 니저는 전자 장치의 바이오스(BIOS: basic input/output system)(미도시)와 연동할 수 있다. 데이터베이스 매니저는, 예를 들면, 어플리케이션에 의해 사용될 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는, 예를 들면, 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 갱신을 관리할 수 있다. 커넥티비티 매니저는, 예를 들면, 전자 장치와 외부 전자 장치 간의 무선 연 결 또는 직접 연결을 관리할 수 있다. 노티피케이션 매니저는, 예를 들면, 지정된 이벤트(예: 착신 통화, 메시지, 또는 알람)의 발생을 사용자에게 알리기 위한 기능을 제공할 수 있다. 로케이션 매니저는, 예를 들면, 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는, 예를 들면, 사용자에게 제공될 하 나 이상의 그래픽 효과들 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 시큐리티 매니저는, 예를 들면, 시스템 보안 또는 사용자 인증을 제공할 수 있다. 통화(telephony) 매니저 는, 예를 들면, 전자 장치에 의해 제공되는 음성 통화 기능 또는 영상 통화 기능을 관리할 수 있다. 음성 인식 매니저는, 예를 들면, 사용자의 음성 데이터를 서버로 전송하고, 그 음성 데이터에 적어도 일부 기반하여 전자 장치에서 수행될 기능에 대응하는 명령어(command), 또는 그 음성 데이터에 적어도 일 부 기반하여 변환된 문자 데이터를 서버로부터 수신할 수 있다. 일 실시예에 따르면, 미들웨어는 동 적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. 일 실시예에 따르면, 미들웨 어의 적어도 일부는 운영 체제의 일부로 포함되거나, 또는 운영 체제와는 다른 별도의 소프트웨 어로 구현될 수 있다. 어플리케이션은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우 저, 카메라, 알람, 컨택트, 음성 인식, 이메일, 달력, 미디어 플레이어 , 앨범, 와치, 헬스(예: 운동량 또는 혈당과 같은 생체 정보를 측정), 또는 환경 정보 (예: 기압, 습도, 또는 온도 정보 측정) 어플리케이션을 포함할 수 있다. 일실시예에 따르면, 어플리케이 션은 전자 장치와 외부 전자 장치 사이의 정보 교환을 지원할 수 있는 정보 교환 어플리케이션(미도 시)을 더 포함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치로 지정된 정보 (예: 통화, 메 시지, 또는 알람)를 전달하도록 설정된 노티피케이션 릴레이 어플리케이션, 또는 외부 전자 장치를 관리하도록 설정된 장치 관리 어플리케이션을 포함할 수 있다. 노티피케이션 릴레이 어플리케이션은, 예를 들면, 전자 장치 의 다른 어플리케이션(예: 이메일 어플리케이션)에서 발생된 지정된 이벤트(예: 메일 수신)에 대응하 는 알림 정보를 외부 전자 장치로 전달할 수 있다. 추가적으로 또는 대체적으로, 노티피케이션 릴레이 어플리케 이션은 외부 전자 장치로부터 알림 정보를 수신하여 전자 장치의 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치 또는 그 일부 구성 요소(예: 외부 전자장치의 디스플레이 모듈 또는 카메라 모듈)의 전원(예: 턴-온 또는 턴-오프) 또는 기능(예: 밝기, 해 상도, 또는 포커스)을 제어할 수 있다. 장치 관리 어플리케이션은, 추가적으로 또는 대체적으로, 외부 전자 장 치에서 동작하는 어플리케이션의 설치, 삭제, 또는 갱신을 지원할 수 있다. 본 명세서에 걸쳐, 뉴럴 네트워크(neural network), 신경망 네트워크, 네트워크 함수는, 동일한 의미로 사용될 수 있다. 뉴럴 네트워크는, 일반적으로 \"노드\"라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 \"노드\"들은, \"뉴런(neuron)\"들로 지칭될 수도 있다. 뉴럴 네트워크는, 적어도 둘 이상의 노드 들을 포함하여 구성된다. 뉴럴 네트워크들을 구성하는 노드(또는 뉴런)들은 하나 이상의 \"링크\"에 의해 상호 연결될 수 있다. 뉴럴 네트워크 내에서, 링크를 통해 연결된 둘 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 전술 한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상 의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서, 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치를 가질 수 있다. 가중치는 가변적일 수 있으며, 뉴럴 네트워크가 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘에 의해 가 변될 수 있다. 여기서, 입력 노드와 출력 노드를 상호 연결하는 에지 또는 링크는 뉴럴 네트워크가 원하는 기능 의 수행, 사용자 또는 알고리즘에 의해 가변적으로 적용될 수 있는 가중치를 갖는다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하는 링크에 설정된 가중치에 기초하여 출력 노드 값 을 결정할 수 있다. 전술한 바와 같이, 뉴럴 네트워크는, 둘 이상의 노드들이 하나 이상의 링크를 통해 상호연결 되어 뉴럴 네트워 크 내에서 입력 노드 및 출력 노드 관계를 형성한다. 뉴럴 네트워크 내에서 노드들과 링크들의 개수 및 노드들 과 링크들 사이의 연관관계, 링크들 각각에 부여된 가중치의 값에 따라, 신경망 네트워크의 특성이 결정될 수 있다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 신경망 네 트워크가 존재하는 경우, 두 개의 신경망 네트워크들은 서로 상이한 것으로 인식될 수 있다. 도 3은 일 실시예에 따라 뉴럴 네트워크(neural network)를 이용하여 서버가 사용자 단말에게 영어 글쓰기 서비 스를 제공하는 방법을 나타낸다. 도 3의 실시예는 본 개시의 다양한 실시예들과 결합될 수 있다. 도 3을 참조하면, 단계 S301에서, 서버(예: 도 1의 서버)는 사용자 단말로부터 글쓰기에 대한 소재 요청 메시지를 수신할 수 있다. 서버는 뉴럴 네트워크를 이용하여 사용자 단말에게 영어 글쓰기 서비스를 제공하는 서버일 수 있다. 예를 들어, 서버는 사용자와 동일한 나이 및 성별에서 실시간으로 검색되는 이슈를 웹 크롤링을 통해 수집하고, 해당 이슈 와 관련된 소재에 매칭되는 복수의 이미지를 사용자 단말에게 제공할 수 있다. 예를 들어, 사용자 단말은 복수 의 이미지 중에서 관심있는 이미지를 선택하여 서버에게 제공할 수 있고, 서버는 사용자 단말에 의해 선택된 이 미지에 대한 소재를 글쓰기 소재로 선정함으로써, 사용자가 흥미를 느끼는 소재를 결정할 수 있다. 예를 들어, 서버는 글의 형식과 사용자의 작문 능력을 유추할 수 있는 사용자의 독서 정보를 반영하여 사용자의 나이 및 성 별에 적합한 글쓰기 소재와 관련된 키워드를 추출할 질문을 뉴럴 네트워크를 통해 생성할 수 있다. 서버는 글쓰 기 소재와 관련된 키워드를 추출할 질문을 LLM(large language model) 서버에 전송하고, 글쓰기 소재와 관련된 키워드를 수신하여, 사용자 단말에게 제공할 수 있다. 사용자 단말은 영어 글쓰기 서비스를 이용하는 사용자의 단말일 수 있다. 예를 들어, 사용자 단말은 도 1의 전 자 장치를 포함할 수 있다. 소재 요청 메시지는 사용자 단말이 글쓰기에 대한 소재를 서버에게 요청하는 메시지이다. 예를 들어, 소재 요청 메시지는 사용자에 대한 개인 정보, 글의 형식에 대한 정보 및 사용자의 독서 정보를 포함할 수 있다. 사용자에 대한 개인 정보는 사용자의 이름, 사용자의 나이, 사용자의 성별 및 사용자의 주소를 포함할 수 있다. 사용자의 독서 정보는 사용자의 독서에 대한 정보이며, 사용자의 독서 장르에 대한 정보 및 독서 장르별 독서량 에 대한 정보를 포함할 수 있다. 독서 장르는 문학, 위인전, 동화, 그림책, 역사, 과학, 철학 및 기타 소설을 포함할 수 있다. 월별 독서량은 한 달에 읽는 평균 권수일 수 있다. 독서 장르에 대한 정보는 복수의 독서 장르 중에서 적어도 하나의 독서 장르를 나타내는 값을 포함할 수 있다. 독서 장르별 독서량에 대한 정보는 적어도 하나의 독서 장르에 대한 월별 독서량을 포함할 수 있다. 글의 형식에 대한 정보는 복수의 글의 형식 중 어느 하나의 형식을 포함할 수 있다. 예를 들어, 복수의 글의 형 식은 저널(journal), 기사(article), 토론(debate), 발표(presentation), 공개 연설(public speaking) 및 에세 이(essay)를 포함할 수 있다. 저널은 개인의 경험, 감정, 일상 생활 등을 기록하는 일기 형식의 글일 수 있다. 기사는 뉴스 기사 형식이며, 5W1H (What, Who, When, Where, Why, How)를 구분하여 작성하는 형식으로 구성될수 있다. 토론은 소재에 대한 찬성과 반대를 선택하여, 해당 입장에서의 주장을 사전 설정된 개수(예: 3개)씩 작성하는 형식으로 구성될 수 있다. 발표는 소재에 대한 여러 측면의 스크립트를 작성하는 형식으로 구성될 수 있다. 공개 연설은 소재에 대한 여러 주장과 근거를 구어체 형식으로 작성하는 형식으로 구성될 수 있다. 이때, 예를 들어, 발표 또는 공개 연설은 사용자의 발화 속도에 따라 발표 시간 또는 연설 시간이 결정되고, 발표 시 간 또는 연설 시간에 대응하는 분량의 글을 작성하는 형식으로 구성될 수 있다. 에세이는 소재에 대해 자유롭게 작성하는 에세이 형식으로 구성될 수 있다. 단계 S302에서, 서버는 사용자에 대한 개인 정보 및 글의 형식에 대한 정보를 기반으로 제1 뉴럴 네트워크를 이 용하는 이미지 수집 모델을 통해 소재 선정을 위한 복수의 이미지 세트를 결정할 수 있다. 서버는 사용자에 대한 개인 정보에 대한 데이터 전처리를 기반으로 사용자의 나이에 대한 값 및 사용자의 성별 에 대한 값을 포함하는 사용자 벡터를 생성할 수 있다. 사용자의 나이에 대한 값은 사용자의 나이를 나타내는 값이다. 사용자의 성별에 대한 값은 사용자의 성별을 나 타내는 값이다. 예를 들어, 사용자의 성별에 대한 값은 남성인 경우에는 1 값을 가지고, 여성인 경우에는 2 값 을 가질 수 있다. 서버는 사용자 벡터를 기반으로 복수의 검색 포탈 웹 페이지에 대한 웹 크롤링을 통해 복수의 실시간 검색어를 획득할 수 있다. 검색 포탈 웹 페이지는 사용자가 원하는 정보를 쉽게 찾을 수 있도록 다양한 검색 엔진과 서비 스를 제공하는 웹 페이지일 수 있다. 예를 들어, 복수의 실시간 검색어는 사용자 벡터에 대응하는 나이 및 성별 에 대한 실시간 검색어 중에서 사전 설정된 순위까지 해당하는 검색어를 포함할 수 있다. 예를 들어, 사전 설정 된 순위는 10위일 수 있다. 예를 들어, 복수의 검색 포탈 웹 페이지별로 실시간 검색어가 획득될 수 있다. 이때, 서버는 중복되는 검색어를 제외할 수 있다. 즉, 서버는 사용자 단말의 나이와 성별에 해당하는 검색 포탈 이용자들이 검색한 검색어들 중에서 높은 순위에 있는 검색어들을 실시간으로 획득할 수 있다. 서버는 복수의 실시간 검색어에 대한 데이터 전처리를 기반으로 복수의 키워드 벡터를 생성할 수 있다. 서버는 복수의 실시간 검색어 각각에 대해 Word2Vec, GloVe 등의 단어 임베딩 기법을 사용하여 복수의 키워드 벡터를 생성할 수 있다. 서버는 글의 형식에 대한 정보에 대한 데이터 전처리를 통해 글의 형식에 대한 값을 포함하는 형식 벡터를 생성 할 수 있다. 서버는 형식 벡터에 대해 사전 설정된 n개의 카테고리 중에서 복수의 키워드 벡터 각각에 대해 매칭되는 카테고 리를 결정할 수 있다. 예를 들어, 서버는 복수의 단어 벡터를 기반으로 뉴럴 네트워크를 이용한 클러스터링 (clustering) 기법을 통해 n개의 카테고리를 글의 형식별로 사전에 설정할 수 있다. 클러스터링은 유사한 속성 들을 갖는 데이터를 일정한 수의 군집으로 그룹핑하는 비지도 학습을 지칭할 수 있다. 예를 들어, 서버는 글의 형식별로 복수의 단어 벡터를 수집할 수 있다. 예를 들어, n개의 카테고리는 복수의 단어 벡터에 기반하여 DBSCAN(Density-Based Spatial Clustering of Applications with Noise) 기법을 통해 결정될 수 있다. 예를 들 어, DBSCAN은 특정 요소(point)가 클러스터에 속하는 경우, 해당 클러스터 내 다른 많은 요소와 가까운 위치에 있어야 하는 것을 전제로 하며, 이러한 계산을 위해 직경(radius)과 최소 요소(minimum points)가 사용될 수 있 다. 예를 들어, 직경은 특정 데이터 요소를 기준으로 하는 반경일 수 있고, 이를 밀도 영역(dense area)이라 지 칭할 수 있다. 예를 들어, 최소 요소는 핵심 요소(core point)를 지정하기 위해 핵심 요소 주변으로 요소가 몇 개 필요한 지를 나타낼 수 있다. 또한, 데이터 세트의 각 요소는 핵심(core), 경계(border), 이상치 요소 (outlier point)로 구분될 수 있다. 예를 들어, 서버는 요소별로 직경의 크기를 체크하고, 주변의 요소가 몇 개 있는지를 탐색할 수 있다. 이후, 서 버는 직경의 범위 내에 m개 이상의 요소가 존재하면, 해당 요소를 핵심 요소로 결정할 수 있다. 그리고, 서버는 핵심 요소로부터 직경의 범위 내에 포함된 요소를 경계 요소로 결정할 수 있다. 그리고, 서버는 핵심 요소로부 터 직경의 범위 내에 포함되지 않은 요소는 이상치 요소로 결정할 수 있고, 상기 이상치 요소는 해당 클러스터 에서 제외될 수 있다. 또한, 서버는 핵심 요소들 사이의 거리가 직경보다 작을 경우, 해당 요소들을 동일한 클 러스터로 분류할 수 있다. 서버는 n개의 카테고리 각각에 대해 해당 카테고리에 포함된 단어 벡터들 중에서 가장 관련성이 높은 키워드 벡 터를 주제 벡터로 결정할 수 있다. 예를 들어, 서버는 n개의 카테고리마다 LDA(latent dirichlet allocation) 와 같은 토픽 모델링 기법을 사용하여 해당 카테고리에 포함된 단어 벡터들 중에서 가장 관련성이 높은 단어 벡 터를 주제 벡터를 결정할 수 있다. 서버는 각각의 카테고리마다 추출된 주제 벡터에 매칭된 주제어를 해당 카테고리의 주제로 설정할 수 있다. 서버는 형식 벡터에 대해 사전 설정된 n개의 카테고리 중에서 키워드 벡터와 가장 유사도가 높은 단어 벡터가 포함된 카테고리를 키워드 벡터에 매칭되는 카테고리로 결정할 수 있다. 예를 들어, 키워드 벡터와 가장 유사도 가 높은 단어 벡터는 키워드 벡터와 단어 벡터 사이의 거리가 가장 짧은 단어 벡터일 수 있다. 서버는 사용자 벡터 및 카테고리에 설정된 주제 벡터를 이미지 수집 모델에 입력시킴으로써, 해당 주제 벡터에 대한 이미지 세트를 획득할 수 있다. 예를 들어, 서버는 복수의 키워드 벡터 각각에 매칭된 카테고리마다 사용 자 벡터 및 해당 카테고리에 설정된 주제 벡터를 이미지 수집 모델에 입력시킴으로써, 복수의 이미지 세트를 획 득할 수 있다. 여기서, 복수의 이미지 세트는 복수의 주제 벡터 각각에 대한 이미지 세트를 포함할 수 있다. 예를 들어, 제1 뉴럴 네트워크는 제1 입력 레이어, 하나 이상의 제1 히든 레이어 및 제1 출력 레이어를 포함할 수 있다. 하나 이상의 제1 히든 레이어는 하나 이상의 컨벌루션 레이어 및 하나 이상의 풀링 레이어를 포함할 수 있다. 예를 들어, 컨벌루션 레이어에서 주제 벡터에 대해 필터링될 수 있고, 컨벌루션 레이어를 통해 특징 맵(feature map)이 형성될 수 있다. 예를 들어, 풀링 레이어에서 상기 형성된 특징 맵에 기반하여 차원 축소를 위해 특징과 관련된 고정 벡터를 선 별하고, 상기 형성된 특징 맵에서 서브-샘플링을 수행함으로써, 상기 벡터화된 시계열 데이터에서 사용자 벡터 및 주제 벡터와 관련된 특징을 추출할 수 있다. 예를 들어, 풀링 레이어는 가장 큰 값을 추출하는 맥스 풀링 레 이어일 수 있다. 예를 들어, 풀링 레이어는 평균 값을 추출하는 평균 풀링 레이어일 수 있다. 예를 들어, 이때, 제1 뉴럴 네트워크의 파라미터는 상기 컨벌루션 레이어 및 상기 풀링 레이어와 관련된 파라미터(특징 맵의 크기, 필터의 크기, 깊이, 스트라이드, 제로 패딩)를 포함할 수 있다. 복수의 사용자 벡터, 복수의 주제 벡터 및 복수의 정답 이미지 세트로 구성된 각각의 제1 뉴럴 네트워크의 학습 을 위한 데이터는 상기 제1 뉴럴 네트워크의 상기 제1 입력 레이어에 입력되고, 상기 하나 이상의 제1 히든 레 이어 및 제1 출력 레이어를 통과하여 제1 출력 벡터를 출력하고, 상기 제1 출력 벡터는 상기 제1 출력 레이어에 연결된 제1 손실함수 레이어에 입력되고, 상기 제1 손실함수 레이어는 상기 제1 출력 벡터와 각각의 학습 데이 터에 대한 제1 정답 벡터를 비교하는 제1 손실 함수를 이용하여 제1 손실값을 출력하고, 상기 제1 뉴럴 네트워 크의 파라미터가 상기 제1 손실값이 작아지는 방향으로 학습될 수 있다. 예를 들어, 학습 데이터로 사용되는 복수의 사용자 벡터, 복수의 주제 벡터 및 복수의 정답 이미지 세트는 서버 에 사전 저장될 수 있다. 예를 들어, 학습 데이터로 사용되는 하나의 사용자 벡터 및 하나의 주제 벡터는 정답 이미지 세트와 하나의 세트로 구성될 수 있다. 예를 들어, 복수의 세트가 서버에 사전 저장될 수 있다. 예를 들어, 서버는 이미지 수집 모델에 대한 학습을 위해 하나의 주제 벡터와 관련된 이미지들을 각각의 주제 벡터별로 사전에 수집할 수 있다. 이때, 하나의 주제 벡터와 관련된 이미지들은 레이블링을 통해 대분류 이미지, 중분류 이미지 및 소분류 이미지로 분류될 수 있다. 대분류 이미지는 주제 벡터와 관련된 가장 큰 범주 의 이미지일 수 있다. 예를 들어, 대분류 이미지는 자동차, 건물, 동물, 식물 등 일반적인 카테고리를 나타내는 이미지일 수 있다. 중분류 이미지는 대분류 이미지가 나타내는 범주를 주제 벡터와 관련하여 세부적으로 나눈 이미지일 수 있다. 예를 들어, 대분류 이미지가 동물에 대한 이미지인 경우, 중분류 이미지는 고양이, 사자, 개, 고양이 등 등을 나타내는 이미지일 수 있다. 소분류 이미지는 중분류 이미지가 나타내는 범주를 주제 벡터 와 관련하여 가장 상세하게 분류한 이미지일 수 있다. 예를 들어, 중분류 이미지가 개인 경우, 소분류 이미지는 개와 함께 어울리는 사람, 개에게 공격당하는 사람, 개를 괴롭히는 사람 등을 나타내는 이미지일 수 있다. 이때, 소분류 이미지는 후속 레이블링을 통해 해당 소분류 이미지와 매칭되는 글쓰기 소재가 설정될 수 있다. 예를 들어, 소분류 이미지에 대해 복수의 글쓰기 소재가 레이블링된 경우, 가장 레이블링된 횟수가 많은 글쓰기 소재가 소분류 이미지와 매칭된 글쓰기 소재로 결정될 수 있다. 예를 들어, 복수의 소분류 이미지와 매칭되는 글쓰기 소재는 서버에 사전 저장될 수 있다. 예를 들어, 정답 이미지 세트는 하나의 대분류 이미지, 대분류 이미지에 대한 복수의 중분류 이미지 및 복수의 중분류 이미지 각각에 대한 복수의 소분류 이미지를 포함할 수 있다. 이때, 정답 이미지 세트에 포함된 복수의 중분류 이미지의 개수 및 복수의 소분류 이미지의 개수는 사용자 벡터에 따라 상이하게 결정될 수 있다. 예를 들어, 사용자 벡터에서 사용자의 나이를 나타내는 값에 비례하여 복수의 중분류 이미지의 개수 및 복수의 소분 류 이미지의 개수가 증가할 수 있다. 예를 들어, 사용자 벡터에서 사용자의 성별이 남성을 나타내는 경우, 여성을 나타내는 경우보다 복수의 중분류 이미지의 개수 및 복수의 소분류 이미지의 개수가 증가할 수 있다. 이를 통해, 서버는 사용자 벡터 및 주제 벡터에 매칭되는 이미지 세트를 결정하도록 이미지 수집 모델을 학습시 킬 수 있다. 단계 S303에서, 서버는 복수의 이미지 세트를 포함하는 선택 요청 메시지를 사용자 단말에게 전송할 수 있다. 선택 요청 메시지는 글쓰기 소재를 결정하기 위해 복수의 이미지 세트에 대한 선택을 사용자 단말에게 요청하는 메시지일 수 있다. 예를 들어, 선택 요청 메시지는 복수의 이미지 세트 및 이미지의 선택을 위한 인터페이스 정 보를 포함할 수 있다. 이미지의 선택을 위한 인터페이스 정보는 사용자 단말이 각 이미지를 선택할 때 발생하는 효과음 및 디스플레이 효과에 대한 정보를 포함할 수 있다. 이미지 세트는 대분류 이미지, 대분류 이미지에 연동된 복수의 중분류 이미지 및 복수의 중분류 이미지 각각에 연동된 복수의 소분류 이미지를 포함할 수 있다. 단계 S304에서, 서버는 복수의 소분류 이미지 중에서 사용자 단말에 의해 선택된 소분류 이미지를 수신할 수 있 다. 예를 들어, 이미지의 선택을 위한 인터페이스에 따라 사용자 단말의 화면에 복수의 대분류 이미지가 표시될 수 있다. 복수의 대분류 이미지 중에서 어느 하나의 대분류 이미지가 선택되면, 선택된 대분류 이미지와 연동된 복 수의 중분류 이미지가 사용자 단말의 화면에 표시될 수 있다. 복수의 중분류 이미지 중에서 어느 하나의 중분류 이미지가 선택되면, 선택된 중분류 이미지와 연동된 복수의 소분류 이미지가 사용자 단말의 화면에 표시될 수 있다. 복수의 소분류 이미지 중에서 사용자 단말에 의해 선택된 소분류 이미지가 서버에게 전송될 수 있다. 예 를 들어, 복수의 소분류 이미지 각각은 하나의 글쓰기 소재와 매칭될 수 있다. 단계 S305에서, 서버는 사용자에 대한 개인 정보, 글의 형식에 대한 정보, 사용자의 독서 정보 및 소분류 이미 지에 매칭된 글쓰기 소재를 기반으로 제2 뉴럴 네트워크를 이용하는 제1 질문 생성 모델을 통해 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질문을 생성할 수 있다. 예를 들어, 서버는 소분류 이미지에 매칭된 글쓰기 소재에 대한 데이터 전처리를 통해 글쓰기 소재에 대한 소재 벡터를 생성할 수 있다. 예를 들어, 서버는 사전 저장된 복수의 글쓰기 소재 중에서 소분류 이미지에 매칭되는 글쓰기 소재를 결정하고, 해당 글쓰기 소재에 대해 Word2Vec, GloVe 등의 단어 임베딩 기법을 사용하여 소재 벡 터를 생성할 수 있다. 예를 들어, 서버는 글의 형식에 대한 정보 및 사용자의 독서 정보에 대한 데이터 전처리를 통해 글의 형식에 대 한 값, 사용자의 독서 장르별 독서량과 관련된 값을 포함하는 설정 벡터를 생성할 수 있다. 글의 형식에 대한 값은 복수의 글의 형식 중에서 어느 하나의 글의 형식을 나타내는 값을 포함할 수 있다. 예를 들어, 복수의 글 의 형식에 대한 값은 서버에 사전 저장될 수 있다. 예를 들어, 글의 형식에 대한 값이 1인 경우에는, 저널을 나 타낼 수 있고, 글의 형식에 대한 값이 2인 경우에는 기사를 나타낼 수 있고, 글의 형식에 대한 값이 3인 경우에 는 토론을 나타낼 수 있고, 글의 형식에 대한 값이 4인 경우에는 발표를 나타낼 수 있고, 글의 형식에 대한 값 이 5인 경우에는 공개 연설을 나타낼 수 있고, 글의 형식에 대한 값이 6인 경우에는 에세이를 나타낼 수 있다. 사용자의 독서 장르별 독서량과 관련된 값은 적어도 하나의 독서 장르를 나타내는 값 및 적어도 하나의 독서 장 르에 대한 월별 독서량을 포함할 수 있다. 서버는 사용자 벡터, 소재 벡터 및 설정 벡터를 제1 질문 생성 모델에 입력시킴으로써, 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질문을 획득할 수 있다. 즉, 서버는 사용자 벡터, 소재 벡터 및 설정 벡터를 제1 질문 생성 모델에 입력시키면, 제1 질문 생성 모델로부터 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질 문이 출력될 수 있다. 예를 들어, 제2 뉴럴 네트워크는 제2 입력 레이어, 하나 이상의 제2 히든 레이어 및 제2 출력 레이어를 포함할 수 있다. 하나 이상의 제2 히든 레이어는 하나 이상의 컨벌루션 레이어 및 하나 이상의 풀링 레이어를 포함할 수 있다. 예를 들어, 컨벌루션 레이어에서 사용자 벡터, 소재 벡터 및 설정 벡터에 각각에 대해 필터링될 수 있고, 컨벌 루션 레이어를 통해 특징 맵(feature map)이 형성될 수 있다. 예를 들어, 풀링 레이어에서 상기 형성된 특징 맵에 기반하여 차원 축소를 위해 특징과 관련된 고정 벡터를 선 별하고, 상기 형성된 특징 맵에서 서브-샘플링을 수행함으로써, 상기 벡터화된 시계열 데이터에서 사용자 벡터,소재 벡터 및 설정 벡터와 관련된 특징을 추출할 수 있다. 예를 들어, 풀링 레이어는 가장 큰 값을 추출하는 맥 스 풀링 레이어일 수 있다. 예를 들어, 풀링 레이어는 평균 값을 추출하는 평균 풀링 레이어일 수 있다. 예를 들어, 이때, 제1 뉴럴 네트워크의 파라미터는 상기 컨벌루션 레이어 및 상기 풀링 레이어와 관련된 파라미터(특 징 맵의 크기, 필터의 크기, 깊이, 스트라이드, 제로 패딩)를 포함할 수 있다. 복수의 사용자 벡터, 복수의 소재 벡터, 복수의 설정 벡터 및 복수의 정답 제1 질문으로 구성된 각각의 제2 뉴 럴 네트워크의 학습을 위한 데이터는 상기 제2 뉴럴 네트워크의 상기 제2 입력 레이어에 입력되고, 상기 하나 이상의 제2 히든 레이어 및 제2 출력 레이어를 통과하여 제2 출력 벡터를 출력하고, 상기 제2 출력 벡터는 상기 제2 출력 레이어에 연결된 제2 손실함수 레이어에 입력되고, 상기 제2 손실함수 레이어는 상기 제2 출력 벡터와 각각의 학습 데이터에 대한 제2 정답 벡터를 비교하는 제2 손실 함수를 이용하여 제2 손실값을 출력하고, 상기 제2 뉴럴 네트워크의 파라미터가 상기 제2 손실값이 작아지는 방향으로 학습될 수 있다. 예를 들어, 학습 데이터로 복수의 사용자 벡터, 복수의 소재 벡터, 복수의 설정 벡터 및 복수의 정답 제1 질문 은 서버에 사전 저장될 수 있다. 예를 들어, 학습 데이터로 사용되는 하나의 사용자 벡터, 소재 벡터 및 설정 벡터는 정답 제1 질문과 하나의 세트로 구성될 수 있다. 예를 들어, 복수의 세트가 서버에 사전 저장될 수 있다. 정답 제1 질문은 하나의 세트로 구성된 사용자 벡터, 소재 벡터 및 설정 벡터에 대해 LLM 서버로부터 글쓰기 소 재와 관련된 적합한 키워드를 수신할 수 있는 질문일 수 있다. 예를 들어, 하나의 사용자 벡터, 하나의 소재 벡 터 및 하나의 설정 벡터에 대해, 서버는 복수의 제1 질문을 LLM 서버로 전송하여 LLM 서버로부터 각각의 제1 질 문에 대한 글쓰기 소재와 관련된 키워드를 획득할 수 있다. 서버는 하나의 사용자 벡터, 하나의 소재 벡터, 하 나의 설정 벡터와 각각의 제1 질문에 대한 글쓰기 소재와 관련된 키워드를 복수의 피드백 단말에게 전송하고, 복수의 피드백 단말로부터 각각의 제1 질문에 대한 글쓰기 소재와 관련된 키워드에 대해 평점을 수신할 수 있다. 여기서, 피드백 단말은 글쓰기 소재와 관련된 키워드에 대해 하나의 사용자 벡터, 하나의 소재 벡터 및 하나의 설정 벡터에 따라 평점을 결정하는 단말일 수 있다. 서버는 각각의 제1 질문에 대한 글쓰기 소재와 관련 된 키워드 중에서 가장 평점이 높은 글쓰기 소재와 관련된 키워드를 결정하고, 해당 글쓰기 소재와 관련된 키워 드를 추출한 제1 질문을 정답 제1 질문으로 저장할 수 있다. 이때, 서버는 이러한 과정을 복수의 사용자 벡터, 복수의 소재 벡터 및 복수의 설정 벡터에 대해 수행함으로써, 복수의 정답 제1 질문을 저장할 수 있다. 이를 통해, 서버는, 사용자의 나이 및 성별 뿐만 아니라 사용자의 평소 독서량까지 고려하여, 글쓰기 소재와 관 련된 키워드를 추출하는 질문을 생성하도록 제1 질문 생성 모델을 학습시킬 수 있다. 예를 들어, 글쓰기 소재와 관련된 키워드의 개수는 사용자 벡터 및 설정 벡터에 기반하여 결정될 수 있다. 예를 들어, 글쓰기 소재와 관련된 키워드의 개수는 사용자 벡터에 매칭된 기본 개수에 대해 설정 벡터와 관련된 가중 치를 적용하여 결정될 수 있다. 글쓰기 소재와 관련된 키워드의 개수는 하기 수학식 1에 의해 결정될 수 있다. 수학식 1"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 1에서, 상기 Nkeyword는 상기 글쓰기 소재와 관련된 키워드의 개수이고, 상기 nread는 상기 적어도 하 나의 독서 장르에 대한 월별 독서량을 평균한 값이고, 상기 navg는 상기 사용자 벡터에 매칭된 월별 평균 독서량 이고, 상기 Ndef는 상기 사용자 벡터에 매칭된 키워드의 기본 개수일 수 있다. 예를 들어, 사용자 벡터별로 월별 평균 독서량과 키워드의 기본 개수가 서버에 사전 설정될 수 있다. 예를 들어, ceil 함수는 괄호 안의 값에서 소수점을 제외한 정수부를 해당 값으로 결정하는 함수이다. 이를 통해, 글쓰기 소재와 관련된 키워드의 개수를 항상 고정된 값으로 결정하지 않고, 사용자의 나이 및 성별 과 사용자의 독서량을 고려하여 유동적으로 결정함으로써, 사용자의 글쓰기 능력을 향상시키기 위한 적절한 개 수의 키워드를 제공할 수 있다. 단계 S306에서, 서버는 제1 질문을 LLM 서버에 전송할 수 있다. 여기서, LLM은 대화 또는 기타 자연 언어 입력에 대해 인간과 유사한 응답을 생성하기 위해 방대한 양의 텍스트 데이터에 대해 훈련된 인공 지능의 하위 집합을 지칭할 수 있다. LLM 서버는 LLM과 관련된 서비스를 제공하는"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "서버일 수 있다. 예를 들어, LLM은 번역, 질문에 대한 답변, 채팅 및 콘텐츠 요약, 콘텐츠 및 코드 생성과 같은 언어 관련 서비스를 제공할 수 있고, CHATGPT 또는 BERT(Bidirectional Encoder Representations from Transformers)를 포함할 수 있다. CHATGPT는 \"Generative Pre-trained Transformer\"의 약어로, 오픈AI에서 개 발한 대화형 인공지능 모델을 지칭할 수 있다. 단계 S307에서, 서버는 LLM 서버로부터 복수의 키워드를 수신할 수 있다. 예를 들어, 복수의 키워드는 글쓰기 소재와 관련된 키워드를 포함할 수 있다. 단계 S308에서, 서버는 글쓰기 소재, 복수의 키워드 및 글쓰기와 관련된 인터페이스 정보를 포함하는 소재 선정 메시지를 사용자 단말에게 전송할 수 있다. 소재 선정 메시지는 서버가 사용자 단말에게 글쓰기 소재 및 복수의 키워드를 전달하기 위한 메시지일 수 있다. 글쓰기와 관련된 인터페이스 정보는 사용자 단말이 글을 작성하기 위해 필요한 인터페이스에 대한 정보이며, 글 의 형식에 따라 상이한 인터페이스를 포함할 수 있다. 예를 들어, 글의 형식에 따라 텍스트를 입력하는 창의 개 수 및 형태가 상이할 수 있다. 예를 들어, 글쓰기 소재와 복수의 키워드는 글쓰기와 관련된 인터페이스 정보에 기반하여 글의 형식마다 상이하 게 사용자 단말의 화면에 표시될 수 있다. 예를 들어, 사용자 단말은 복수의 키워드별로 글이 작성된 이후, 키워드별로 작성된 글을 원하는 순서대로 재배 치할 수 있다. 이때, 서버는 변경된 글의 순서에 대한 정보를 수신할 수 있고, 사용자 단말에게 변경된 글의 순 서에 따라 문장 또는 문단 사이의 관계언을 전송할 수 있다. 사용자 단말은 문장 또는 문단 사이의 관계언을 키 워드별로 작성된 글 사이에 추가할 수 있다. 예를 들어, 사용자 단말은 키워드별로 글이 작성된 후, 서문과 결문에 대한 추가를 서버에게 요청할 수 있다. 서버는 글쓰기 소재마다 사전 설정된 서문과 결문에 대한 샘플 정보 중에서 사용자 단말에 의해 작성된 글에 매 칭된 서문과 결문에 대한 샘플 정보를 사용자 단말에게 전송할 수 있다. 사용자 단말이 서문과 결문에 대한 샘 플 정보를 수신한 것을 기반으로 사용자 단말의 화면에는 서문과 결문을 입력할 수 있는 창 및 샘플 보기 버튼 이 추가될 수 있다. 사용자 단말의 서문과 결문에 대한 샘플 보기 버튼에 대한 상호 작용을 통해, 서문과 결문 을 입력할 수 있는 창에 샘플이 표시될 수 있다. 단계 S309에서, 서버는 사용자 단말로부터 글쓰기 소재와 복수의 키워드를 기반으로 작성된 글을 수신할 수 있 다. 일 실시예에 따르면, 서버는 사용자 단말로부터 복수의 키워드 중 적어도 하나의 키워드를 포함하는 예문 요청 메시지를 수신할 수 있다. 여기서, 예문 요청 메시지는 사용자 단말이 글쓰기 소재와 관련된 적어도 하나의 키 워드에 대한 예문을 요청하는 메시지일 수 있다. 예를 들어, 예문 요청 메시지는 적어도 하나의 키워드 및 영어 예문 여부를 나타내는 값을 포함할 수 있다. 영어 예문 여부를 나타내는 값은 사용자 단말이 요청한 예문이 영 문으로 된 예문인지 여부를 나타내는 값일 수 있다. 예를 들어, 영어 예문 여부를 나타내는 값이 1인 경우, 영 어 예문을 나타내며, 영어 예문 여부를 나타내는 값이 2인 경우, 한글 예문을 나타낼 수 있다. 예를 들어, 영어 예문 여부를 나타내는 값이 1인 경우, 예문 요청 메시지는 사용자의 영어 레벨을 나타내는 값 을 더 포함할 수 있다. 사용자의 영어 레벨은 초급, 초중급, 중급, 상급 및 고급을 포함할 수 있고, 각각의 영 어 레벨을 나타내는 값은 사전 설정될 수 있다. 예를 들어, 서버는 사용자 벡터, 소재 벡터, 설정 벡터 및 적어도 하나의 키워드를 기반으로 제3 뉴럴 네트워크 를 이용하는 제2 질문 생성 모델을 통해 상기 적어도 하나의 키워드와 관련된 예문을 추출하기 위한 제2 질문을 생성할 수 있다. 서버는 제2 질문을 LLM 서버에 전송할 수 있다. 서버는 LLM 서버로부터 적어도 하나의 키워드 와 관련된 예문을 수신할 수 있다. 서버는 적어도 하나의 키워드와 관련된 예문을 사용자 단말에게 전송할 수 있다. 이때, 적어도 하나의 키워드와 관련된 예문의 길이는 사용자 벡터 및 설정 벡터에 기반하여 결정될 수 있 다. 예를 들어, 적어도 하나의 키워드에 대해 Word2Vec, GloVe 등의 단어 임베딩 기법을 사용하여 적어도 하나의 키 워드 벡터를 생성할 수 있다. 예를 들어, 서버는 적어도 하나의 키워드 벡터, 영문 예문 여부를 나타내는 값 및 영어 레벨에 대한 값으로 구성된 예문 설정 벡터를 생성할 수 있다. 예를 들어, 영문 예문 여부를 나타내는 값이 2인 경우, 영어 레벨에 대한 값은 생략될 수 있다. 예를 들어, 제3 뉴럴 네트워크는 제3 입력 레이어, 하나 이상의 제3 히든 레이어 및 제3 출력 레이어를 포함할 수 있다. 하나 이상의 제3 히든 레이어는 하나 이상의 컨벌루션 레이어 및 하나 이상의 풀링 레이어를 포함할 수 있다. 예를 들어, 컨벌루션 레이어에서 사용자 벡터, 소재 벡터, 설정 벡터 및 예문 설정 벡터에 각각에 대해 필터링 될 수 있고, 컨벌루션 레이어를 통해 특징 맵(feature map)이 형성될 수 있다. 예를 들어, 풀링 레이어에서 상기 형성된 특징 맵에 기반하여 차원 축소를 위해 특징과 관련된 고정 벡터를 선 별하고, 상기 형성된 특징 맵에서 서브-샘플링을 수행함으로써, 상기 벡터화된 시계열 데이터에서 사용자 벡터, 소재 벡터, 설정 벡터 및 예문 설정 벡터와 관련된 특징을 추출할 수 있다. 예를 들어, 풀링 레이어는 가장 큰 값을 추출하는 맥스 풀링 레이어일 수 있다. 예를 들어, 풀링 레이어는 평균 값을 추출하는 평균 풀링 레이어일 수 있다. 예를 들어, 이때, 제1 뉴럴 네트워크의 파라미터는 상기 컨벌루션 레이어 및 상기 풀링 레이어와 관련 된 파라미터(특징 맵의 크기, 필터의 크기, 깊이, 스트라이드, 제로 패딩)를 포함할 수 있다. 복수의 사용자 벡터, 복수의 소재 벡터, 복수의 설정 벡터, 복수의 예문 설정 벡터 및 복수의 정답 제2 질문으 로 구성된 각각의 제3 뉴럴 네트워크의 학습을 위한 데이터는 상기 제3 뉴럴 네트워크의 상기 제3 입력 레이어 에 입력되고, 상기 하나 이상의 제3 히든 레이어 및 제3 출력 레이어를 통과하여 제3 출력 벡터를 출력하고, 상 기 제3 출력 벡터는 상기 제3 출력 레이어에 연결된 제3 손실함수 레이어에 입력되고, 상기 제3 손실함수 레이 어는 상기 제3 출력 벡터와 각각의 학습 데이터에 대한 제3 정답 벡터를 비교하는 제3 손실 함수를 이용하여 제 3 손실값을 출력하고, 상기 제3 뉴럴 네트워크의 파라미터가 상기 제3 손실값이 작아지는 방향으로 학습될 수 있다. 예를 들어, 학습 데이터로 복수의 사용자 벡터, 복수의 소재 벡터, 복수의 설정 벡터, 복수의 예문 설정 벡터 및 복수의 정답 제2 질문은 서버에 사전 저장될 수 있다. 예를 들어, 학습 데이터로 사용되는 하나의 사용자 벡 터, 하나의 소재 벡터, 하나의 설정 벡터, 하나의 예문 설정 벡터는 정답 제2 질문과 하나의 세트로 구성될 수 있다. 예를 들어, 복수의 세트가 서버에 사전 저장될 수 있다. 정답 제2 질문은 하나의 세트로 구성된 사용자 벡터, 소재 벡터, 설정 벡터 및 예문 설정 벡터에 대해 LLM 서버 로부터 적어도 하나의 키워드와 관련된 적합한 예문을 수신할 수 있는 질문일 수 있다. 예를 들어, 서버는 복수의 제2 질문을 LLM 서버로 전송하여 LLM 서버로부터 각각의 제2 질문에 대한 적어도 하 나의 키워드와 관련된 예문을 획득할 수 있다. 이때, 예문의 길이는 하나의 사용자 벡터, 하나의 소재 벡터 및 하나의 설정 벡터에 따라 상이하게 획득되도록 제2 질문이 설정될 수 있다. 예를 들어, 사용자 벡터 및 소재 벡 터의 조합에 따른 예문의 길이의 범위는 서버에 사전 설정될 수 있다. 예문의 길이는 예문에 포함된 문장의 개 수를 나타낼 수 있다. 즉, 사용자 벡터 및 소재 벡터에 대한 복수의 조합별로 예문의 길이의 범위가 서버에 사 전 저장될 수 있다. 예를 들어, 설정 벡터에 포함된 독서량에 대한 값이 클수록 예문의 길이의 범위 중에서 큰 값으로 결정될 수 있다. 즉, 설정 벡터에 포함된 독서량에 대한 값이 클수록 예문에 포함된 단어의 개수가 해당 범위 내에서 큰 값으로 결정될 수 있다. 서버는 하나의 사용자 벡터, 하나의 소재 벡터, 하나의 설정 벡터 및 하나의 예문 설정 벡터와 각각의 제2 질문 에 대한 적어도 하나의 키워드와 관련된 예문을 복수의 피드백 단말에게 전송하고, 복수의 피드백 단말로부터 각각의 제2 질문에 대한 적어도 하나의 키워드와 관련된 예문에 대해 평점을 수신할 수 있다. 여기서, 피드백 단말은 글쓰기 소재와 관련된 키워드에 대해 하나의 사용자 벡터, 하나의 소재 벡터, 하나의 설정 벡터 및 하나 의 예문 설정 벡터에 따라 평점을 결정하는 단말일 수 있다. 서버는 각각의 제2 질문에 대한 적어도 하나의 키 워드와 관련된 예문 중에서 가장 평점이 높은 적어도 하나의 키워드와 관련된 예문을 결정하고, 해당 적어도 하 나의 키워드와 관련된 예문을 추출한 제2 질문을 정답 제2 질문으로 저장할 수 있다. 이때, 서버는 이러한 과정 을 사용자 벡터, 소재 벡터, 설정 벡터 및 예문 설정 벡터로 구성된 복수의 세트에 대해 수행함으로써, 복수의 정답 제2 질문을 저장할 수 있다. 이를 통해, 서버는, 사용자의 나이 및 성별 뿐만 아니라 사용자의 평소 독서량까지 고려하여, 적어도 하나의 키 워드와 관련된 적합한 예문을 추출하는 질문을 생성하도록 제2 질문 생성 모델을 학습시킬 수 있다. 예를 들어, 서버는 제2 질문을 LLM 서버에게 전송할 수 있다. 예를 들어, 서버는 LLM 서버로부터 적어도 하나의 키워드와 관련된 예문을 수신할 수 있다. 예를 들어, 서버는 적어도 하나의 키워드와 관련된 예문을 사용자 단말에게 전송할 수 있다. 일 실시예에 따르면, 서버는 사용자 단말로부터 첨삭 요청 메시지를 수신할 수 있다. 여기서, 첨삭 요청 메시지 는 사용자 단말이 작성한 글에 대한 첨삭을 서버에게 요청하는 메시지일 수 있다. 예를 들어, 첨삭 요청 메시지 는 사용자 단말로부터 수신한 글에 대한 첨삭의 범위를 포함할 수 있다. 예를 들어, 첨삭의 범위는 문법을 첨삭 하는 제1 범위, 문법 및 어법을 첨삭하는 제2 범위와 문법, 어법 및 글의 뉘앙스를 첨삭하는 제3 범위를 포함할 수 있다. 예를 들어, 서버는 첨삭의 범위에 따라 제4 뉴럴 네트워크를 이용하는 자동 첨삭 모델을 통해 사용자 단말로부터 수신한 글을 첨삭할 수 있다. 예를 들어, 서버는 사용자 단말에게 첨삭이 완료된 글을 전송할 수 있 다. 도 4는 일 실시예에 따른 자동 첨삭 모델에 대한 예를 나타낸 도면이다. 도 4의 실시예는 본 개시의 다양한 실 시예들과 결합될 수 있다. 도 4를 참조하면, 자동 첨삭 모델에 사용되는 제4 뉴럴 네트워크는 GRU(gated recurrent unit) 기반의 뉴럴 네 트워크일 수 있다. 자동 첨삭 모델은 임베딩 및 인코더부, GRU 기반의 제4 뉴럴 네트워크 및 어텐션 레이어를 포함할 수 있다. 여기서, GRU는 RNN(recurrent neural network)를 변형시킨 모델일 수 있다. 제4 뉴럴 네트워크는 제4 입력 레이어, 하나 이상의 제4 히든 레이어 및 제4 출력 레이어을 포 함할 수 있다. 예를 들어, 임베딩 및 인코더부는 복수의 토큰 임베딩 레이어 및 복수의 포지션 임베딩 레이어, 인코더를 포함 할 수 있다. 예를 들어, 복수의 텍스트는 사용자 단말에 의해 작성된 글에 대한 텍스트 데이터일 수 있다. 토큰 임베딩 레이어는 복수의 텍스트에 대해 토크나이저(tokenizer)로 전처리된 텍스트를 토큰이 포함된 토큰 벡터로 변환할 수 있다. 예를 들어, 토큰 임베딩 레이어를 통해 복수의 텍스트를 토크나이저로 전처리함으로써, 하나의 문장을 복수의 형태소로 토큰화시킨 토큰 벡터를 생성할 수 있다. 또한, 토큰 벡터에 대해 마스크드 언 어 모델(masked language model)을 사용함으로써, 인코더는 주어진 시퀀스를 통해 전체 문장을 모델에 삽입한 후 공백에 해당하는 단어를 예측하여 학습하며, 문장을 학습한 후에는 해당 문장을 일련의 토큰으로 표시하고, 토큰 배열에서 공백으로 설정할 부분은 마스크(mask)로 설정할 수 있다. 포지션 임베딩 레이어는 하나의 문장을 복수의 형태소로 토큰화한 토큰 벡터에 대해 각 형태소의 위치를 나타내 는 포지션 임베딩 벡터를 추가할 수 있다. 여기서, 토큰 벡터는 쿼리(query)를 나타내는 Q 벡터, 키(key)를 나 타내는 K 벡터, 벨류(value)를 나타내는 V 벡터로 변환될 수 있다. 이때, 서버는 포지션 임베딩 레이어를 통해 한 쌍의 단어 관계를 결정할 수 있다. 예를 들어, 각 단어의 밀접성 을 결정하기 위해 서버는 스케일드 내적 어텐션(scaled dot-product attention)을 사용할 수 있다. 서버는 한 쌍의 단어 관계를 스케일드 내적 어텐션을 기반으로 하기 수학식 2에 의해 결정될 수 있다. 수학식 2"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상기 수학식 2에서, 상기 Q는 디코더의 이전 레이어의 히든 스테이트에 대한 벡터이고, K는 인코더의 아웃풋 스 테이트에 대한 벡터, V는 인코더의 아웃풋 스테이트에 대한 벡터이고, 상기 dk는 K 벡터의 차원일 수 있다. 즉, Q는 영향을 받는 디코더의 토큰, K는 영향을 주는 인코더의 토큰, V는 그 영향에 대한 가중치가 곱해질 인코더 토큰일 수 있다. 즉, 서버는 Q와 K는 코사인 유사성을 이용한 내적(dot-product)을 K 벡터의 차원에 대한 제곱근으로 나누고 소 프트맥스(softmax) 함수를 적용함으로써 문장 내의 단어들에 대한 한 쌍의 행렬을 결정할 수 있다. 예를 들어, 하나 이상의 제4 히든 레이어는 하나 이상의 GRU 블록을 포함하고, 하나의 GRU 블록은 리셋 게이트 (reset gate)와 업데이트 게이트(update gate)를 포함할 수 있다. 여기서, 리셋 게이트와 업데이트 게이트는 시그모이드 레이어를 포함할 수 있다. 예를 들어, 시그모이드 레이어는 시그모이드 함수( )가 활성화 함수인 레이어일 수 있다. 예를 들어, 리셋 게이트 및 업데이트 게이트를 통해 히든 스테이트가 제어되고, 각 게이트와 입력에 따른 가중치들이 존재할 수 있다. 리셋 게이트는 과거의 정보를 리셋시키며, 이전 히든 레이어를 거쳐 도출된 가중치 r(t)는 수학식 3에 의해 결 정될 수 있다. 수학식 3"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "예를 들어, 상기 복수의 텍스트에 대해 전처리가 이루어진 복수의 입력 벡터가 상기 입력 레이어에 입력되고, 상기 리셋 게이트는 복수의 입력 벡터를 기반으로 생성된 현재 시점의 입력 값(xt)이 입력되면 현재 시점의 가중 치 Wr와 내적하고, 복수의 입력 벡터를 기반으로 생성된, 이전 시점의 히든 스테이트(h(t-1))를 이전 시점의 가중 치 Ur와 내적하고, 마지막으로 두 값을 합하여 시그모이드 함수에 입력되어 결과가 0과 1 사이의 값으로 출력될 수 있다. 이러한 0과 1 사이의 값을 통해 이전 시점의 히든 스테이트 값을 얼마나 활용할 것인지 결정될 수 있 다. 업데이트 게이트는 과거와 현재의 정보에 대한 최신화 비율을 결정하며, z(t)는 현재 시점의 정보의 양으로, 수 학식 4에 의해 결정될 수 있다. 수학식 4"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "예를 들어, 상기 현재 시점의 입력 값(xt)가 입력되면 현재 시점의 가중치 Wz와 내적하고, 상기 이전 시점의 히 든 스테이트(h(t-1))는 이전 시점의 가중치 Uz와 내적하고, 마지막으로 두 값을 합하여 시그모이드 함수에 입력됨 으로써 결과가 0과 1 사이의 값으로 출력될 수 있다. 그리고 1-z(t)를 직전 시점의 히든 레이어의 정보(h(t-1))에 곱할 수 있다. 이를 통해, z(t)는 현재 정보를 얼마나 사용할지와 1-z(t)를 과거 정보에 대해 얼마나 사용할지를 반영할 수 있 다. 리셋 게이트의 결과를 곱하여 현재 시점 t의 정보 후보군이 수학식 5에 의해 결정될 수 있다. 수학식 5"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "예를 들어, 상기 현재 시점의 입력 값(xt)가 입력되면 현재 시점의 가중치 Wh와 내적한 값과, 상기 이전 시점의 히든 스테이트(h(t-1))는 이전 시점의 가중치 Uh와 내적하고, r(t)를 곱한 값을 합하여 tanh 함수에 입력될 수 있 다. 예를 들어, tanh는 비선형 활성화 함수(하이퍼볼릭 탄젠트 함수)를 의미한다. 업데이트 게이트와 후보군의 결과를 결합함으로써, 현재 시점의 히든 레이어의 가중치를 수학식 6에 의해 결정 할 수 있다.수학식 6"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "예를 들어, 업데이트 게이트의 출력 값 z(t)와 현재 시점의 히든 스테이트(h(t))를 곱한 값과 업데이트 게이트 에서 버려지는 값 1-z(t)와 이전 시점의 히든 스테이트(h(t-1))을 곱한 값의 합으로 현재 시점의 히든 레이어의 가중치가 결정될 수 있다. 예를 들어, 상기 GRU 기반의 제4 뉴럴 네트워크에서 출력된 벡터를 어텐션 레이어에 입력시킬 수 있다. 이때, 서버는 GRU 기반의 제4 뉴럴 네트워크를 통해 숨겨진 토큰을 연결함으로써, 자동 첨삭 모델을 미세 조정할 수 있다. 어텐션 레이어는 하나의 문장 정보를 문장 끝까지 입출력 할 수 있고, 첫 단어가 멀리 있는 단어와 상관 관계를 이룰 수 있게 처리할 수 있다. 이후, 출력 레이어는 소프트맥스 함수를 통해, 복수의 문법 오류 유형, 복수의 어법 오류 유형 각각에 대한 텍스트 데이터를 기반으로 가장 높은 확률을 가진 단어를 출력 값으로 결정할 수 있다. 즉, 서버는 복수의 텍스트를 기반으로 GRU 기반의 제4 뉴럴 네트워크를 포함하는 자동 첨삭 모델을 학습시키고, 자동 첨삭 모델을 통해 사용자 단말이 작성한 글에 대한 텍스트 데이터에서 복수의 문법 오류 유형 및 복수의 어법 오류 유형 중 적어도 하나에 해당하는 영역을 결정할 수 있다. 서버는 상기 복수의 문법 오류 유형 및 복 수의 어법 오류 유형 중 적어도 하나에 해당하는 영역에 대해 밑줄을 표시하여 사용자 단말에게 전송할 수 있다. 복수의 문법 오류 유형은 주어와 동사의 일치 오류, 명사와 관사의 일치 오류, 동사의 시제 오류, 부정문 의 사용 오류 및 동사와 전치사의 오류 등 다양한 유형의 문법 오류를 포함할 수 있다. 복수의 어법 오류 유형 은 잘못된 대명사의 사용, 불완전한 문장, 어순의 오류, 명사와 형용사의 일치 오류, 부정어의 오류 등 다양한 유형의 어법 오류를 포함할 수 있다. 예를 들어, 사용자 단말로부터 수신한 첨삭의 범위가 제1 범위인 경우, 서버는 자동 첨삭 모델을 통해 사용자 단말이 작성한 글에 대한 텍스트 데이터에서 복수의 문법 오류 유형 적어도 하나에 해당하는 영역을 결정할 수 있다. 예를 들어, 사용자 단말로부터 수신한 첨삭의 범위가 제2 범위인 경우, 서버는 자동 첨삭 모델을 통해 사용자 단말이 작성한 글에 대한 텍스트 데이터에서 복수의 문법 오류 유형 및 복수의 어법 오류 유형 중 적어도 하나 에 해당하는 영역을 결정할 수 있다. 예를 들어, 사용자 단말로부터 수신한 첨삭의 범위가 제3 범위인 경우, 서버는 자동 첨삭 모델을 통해 사용자 단말이 작성한 글에 대한 텍스트 데이터에서 복수의 문법 오류 유형 및 복수의 어법 오류 유형 중 적어도 하나 에 해당하는 영역을 결정할 수 있다. 그리고, 서버는 사용자 단말이 작성한 글에 대한 뉘앙스를 첨삭하기 위해 외부 단말에게 사용자 단말이 작성한 글을 전송하고, 외부 단말로부터 뉘앙스가 첨삭된 글을 수신할 수 있다. 즉, 영어에서 뉘앙스란 단어나 문장의 의미를 전달하는 데에 있어서 감정, 태도, 강도 등의 섬세한 차이나 은유 적인 표현을 의미하기 때문에, 뉘앙스는 단어의 사전적 의미보다 더 많은 정보와 의미를 담고 있을 수 있고, 맥 락과 상황에 따라 해석이 달라질 수 있다. 따라서, 영어의 뉘앙스까지 첨삭을 원하는 경우, 외부 단말에게 사용 자 단말이 작성한 글을 작성하여 첨삭받을 필요가 있다. 도 5는 일 실시예에 따른 뉴럴 네트워크를 이용하여 서버가 사용자 단말에게 영어 글쓰기 서비스를 제공하는 방 법에 대한 신호 교환도이다. 도 5의 실시예는 본 개시의 다양한 실시예들과 결합될 수 있다. 도 5를 참조하면, 단계 S501에서, 서버는 사용자 단말로부터 소재 요청 메시지를 수신할 수 있다. 예를 들어, 소재 요청 메시지는 사용자에 대한 개인 정보, 글의 형식에 대한 정보 및 사용자의 독서 정보를 포 함할 수 있다. 단계 S502에서, 서버는 사용자의 개인 정보 및 글의 형식에 대한 정보를 기반으로 제1 뉴럴 네트워크를 이용하 는 이미지 수집 모델을 통해 소재 선정을 위한 복수의 이미지 세트를 결정할 수 있다. 예를 들어, 서버는 사용자에 대한 개인 정보에 대한 데이터 전처리를 기반으로 사용자의 나이에 대한 값 및 사 용자의 성별에 대한 값을 포함하는 사용자 벡터를 생성할 수 있다. 예를 들어, 서버는 사용자 벡터를 기반으로 복수의 검색 포탈 웹 페이지에 대한 웹 크롤링을 통해 복수의 실시 간 검색어를 획득할 수 있다. 서버는 복수의 실시간 검색어에 대한 데이터 전처리를 기반으로 복수의 키워드 벡 터를 생성할 수 있다. 서버는 글의 형식에 대한 정보에 대한 데이터 전처리를 통해 글의 형식에 대한 값을 포함 하는 형식 벡터를 생성할 수 있다. 서버는 형식 벡터에 설정된 n개의 카테고리 각각에 대해 해당 카테고리에 포 함된 단어 벡터들 중에서 가장 관련성이 높은 키워드 벡터를 주제 벡터로 결정할 수 있다. 예를 들어, 서버는 사용자 벡터 및 카테고리에 설정된 주제 벡터를 이미지 수집 모델에 입력시킴으로써, 해당 주제 벡터에 대한 이미지 세트를 획득할 수 있다. 단계 S503에서, 서버는 복수의 이미지 세트를 포함하는 선택 요청 메시지를 사용자 단말에게 전송할 수 있다. 예를 들어, 선택 요청 메시지는 복수의 이미지 세트 및 이미지의 선택을 위한 인터페이스 정보를 포함할 수 있 다. 단계 S504에서, 서버는 복수의 소분류 이미지 중에서 사용자 단말에 의해 선택된 소분류 이미지를 수신할 수 있 다. 예를 들어, 복수의 소분류 이미지 각각은 하나의 글쓰기 소재와 매칭될 수 있다. 단계 S505에서, 서버는 사용자에 대한 개인 정보, 글의 형식에 대한 정보, 사용자의 독서 정보 및 소분류 이미 지에 매칭된 글쓰기 소재를 기반으로 제2 뉴럴 네트워크를 이용하는 제1 질문 생성 모델을 통해 글쓰기 소재와 관련된 키워드를 추출하기 위한 제1 질문을 생성할 수 있다. 예를 들어, 서버는 소분류 이미지에 매칭된 글쓰기 소재에 대한 데이터 전처리를 통해 글쓰기 소재에 대한 소재 벡터를 생성할 수 있다. 단계 S506에서, 서버는 제1 질문을 LLM 서버에 전송할 수 있다. 단계 S507에서, 서버는 LLM 서버로부터 복수의 키워드를 수신할 수 있다. 단계 S508에서, 서버는 글쓰기 소재, 복수의 키워드 및 글쓰기와 관련된 인터페이스 정보를 포함하는 소재 선정 메시지를 사용자 단말에게 전송할 수 있다. 예를 들어, 글의 형식에 따라 텍스트를 입력하는 창의 개수 및 형태가 상이할 수 있다. 단계 S509에서, 서버는 사용자 단말로부터 예문 요청 메시지를 수신할 수 있다. 예를 들어, 예문 요청 메시지는 적어도 하나의 키워드, 영어 예문 여부를 나타내는 값 및 사용자의 영어 레벨을 나타내는 값을 포함할 수 있다. 단계 S510에서, 서버는 사용자 벡터, 소재 벡터, 설정 벡터 및 예문 설정 벡터를 기반으로 제3 뉴럴 네트워크를 이용하는 제2 질문 생성 모델을 통해 적어도 하나의 키워드와 관련된 예문을 추출하기 위한 제2 질문을 생성할 수 있다. 예를 들어, 서버는 적어도 하나의 키워드에 대해 단어 임베딩 기법을 사용하여 적어도 하나의 키워드 벡터를 생 성할 수 있다. 서버는 적어도 하나의 키워드 벡터, 영문 예문 여부를 나타내는 값 및 영어 레벨에 대한 값으로 구성된 예문 설정 벡터를 생성할 수 있다. 이때, 영문 예문 여부를 나타내는 값이 2인 경우, 영어 레벨에 대한 값은 생략될 수 있다. 단계 S511에서, 서버는 제2 질문을 LLM 서버에게 전송할 수 있다. 단계 S512에서, 서버는 LLM 서버로부터 적어도 하나의 키워드와 관련된 예문을 수신할 수 있다. 단계 S513에서, 서버는 적어도 하나의 키워드와 관련된 예문을 사용자 단말에게 전송할 수 있다. 단계 S514에서, 서버는 사용자 단말로부터 글쓰기 소재와 복수의 키워드를 기반으로 사용자 단말에 의해 작성된 글을 수신할 수 있다. 단계 S515에서, 서버는 사용자 단말로부터 첨삭 요청 메시지를 수신할 수 있다. 예를 들어, 첨삭 요청 메시지는 사용자 단말로부터 수신한 글에 대한 첨삭의 범위를 포함할 수 있다. 단계 S516에서, 서버는 첨삭의 범위에 따라 제4 뉴럴 네트워크를 이용하는 자동 첨삭 모델을 통해 사용자 단말 로부터 수신한 글을 첨삭할 수 있다. 단계 S517에서, 서버는 사용자 단말에게 첨삭이 완료된 글을 전송할 수 있다. 일 실시예에 따르면, 서버는 사용자 단말에 의해 작성된 글에 대한 작문 점수를 결정할 수 있다. 예를 들어, 서 버는 사용자 단말에 의해 작성된 글에 대한 단어 임베딩을 통해 텍스트 벡터로 변환할 수 있다. 서버는 텍스트 벡터와 소재 벡터 사이의 제1 유사도 및 텍스트 벡터와 복수의 키워드 벡터 각각에 대한 제2 유사도를 결정하고, 제1 유사도 및 복수의 제2 유사도를 평균한 값을 합산한 값에 사용자 벡터에 따른 가중치를 적용함으 로써, 작문 점수를 결정할 수 있다. 예를 들어, 사용자 벡터에 따른 가중치는 사용자 벡터 내 사용자의 나이에 대한 값 및 사용자의 성별에 대한 값에 따라 상이할 수 있다. 일 실시예에 따르면, 서버는 사용자 벡터, 설정 벡터, 소재 벡터 및 작문 점수에 따라 추천 도서에 대한 정보를 사용자 단말에게 전송할 수 있다. 예를 들어, 서버는 설정 벡터에 작문 점수에 따른 가중치를 적용하여 설정 벡 터를 업데이트할 수 있다. 서버는 소재 벡터에 매칭된 복수의 추천 도서 중에서 사용자 벡터 및 업데이트된 설 정 벡터에 대응하는 추천 도서를 결정할 수 있고, 해당 추천 도서에 대한 정보를 사용자 단말에게 전송할 수 있 다. 도 6은 일 실시예에 따른 서버의 구성을 나타내는 블록도이다. 도 6의 일 실시예는 본 개시의 다양한 실시예들 과 결합될 수 있다. 도 6에 도시된 바와 같이, 서버는 프로세서, 통신부 및 메모리를 포함할 수 있다. 그러나, 도 6에 도시된 구성 요소 모두가 서버의 필수 구성 요소인 것은 아니다. 도 6에 도시된 구성 요소보다 많 은 구성 요소에 의해 서버가 구현될 수도 있고, 도 6에 도시된 구성 요소보다 적은 구성 요소에 의해 서버 가 구현될 수도 있다. 예를 들어, 일부 실시예에 따른 서버는 프로세서, 통신부 및 메모리 이외에 사용자 입력 인터페이스(미도시), 출력부(미도시) 등을 더 포함할 수도 있다. 프로세서는, 통상적으로 서버의 전반적인 동작을 제어한다. 프로세서는 하나 이상의 프로세서를 구비하여, 서버에 포함된 다른 구성 요소들을 제어할 수 있다. 예를 들어, 프로세서는, 메모리 에 저장된 프로그램들을 실행함으로써, 통신부 및 메모리 등을 전반적으로 제어할 수 있다. 또한, 프 로세서는 메모리에 저장된 프로그램들을 실행함으로써, 도 3 내지 도 5에 기재된 서버의 기능을 수행할 수 있다. 통신부는, 서버가 다른 장치(미도시) 및 서버(미도시)와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 다른 장치(미도시)는 서버와 같은 컴퓨팅 장치이거나, 센싱 장치일 수 있으나, 이에 제한 되지 않는다. 통신부는 네트워크를 통해, 다른 전자 장치로부터의 사용자 입력을 수신하거나, 외부 장치로 부터 외부 장치에 저장된 데이터를 수신할 수 있다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있다. 예를 들어, 메모리는 서버에 입력된 정보 또는 네트워크를 통해 다른 장치로부터 수신된 정보를 저장할 수 있다. 또한, 메모리 는 프로세서에서 생성된 데이터를 저장할 수 있다. 메모리는 서버로 입력되거나 서버로부 터 출력되는 정보를 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터 를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매 체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2024-0048397", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2024-0048397", "section": "도면", "subsection": "도면설명", "item": 1, "content": "실시예들에 대한 이해를 돕기 위해 상세한 설명의 일부로 포함된, 첨부 도면은 다양한 실시예들을 제공하고, 상 세한 설명과 함께 다양한 실시예들의 기술적 특징을 설명한다. 도 1은 일 실시예에 따른 전자 장치의 구성을 나타내는 도면이다. 도 2는 일 실시예에 따른 프로그램의 구성을 나타내는 도면이다. 도 3은 일 실시예에 따라 뉴럴 네트워크(neural network)를 이용하여 서버가 사용자 단말에게 영어 글쓰기 서비 스를 제공하는 방법을 나타낸다. 도 5는 일 실시예에 따른 뉴럴 네트워크를 이용하여 서버가 사용자 단말에게 영어 글쓰기 서비스를 제공하는 방 법에 대한 신호 교환도이다. 도 6은 일 실시예에 따른 서버의 구성을 나타내는 블록도이다."}
