{"patent_id": "10-2020-0001442", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0088237", "출원번호": "10-2020-0001442", "발명의 명칭": "사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법 및 할인 정보", "출원인": "유호윤", "발명자": "유호윤"}}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "휴대 단말기(100)에 설치되어, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)의 동작 방법에 있어서,(1) 선호 브랜드 또는 선호 제품을 포함하는 선호 할인 정보를 사전 등록하는 단계;(2) 상기 애플리케이션(110)이 실행되는 단계;(3) 상기 휴대 단말기(100)에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하는 단계;(4) 상기 검출된 광고 메시지와 상기 사전 등록된 선호 할인 정보를 비교하여, 상기 선호 할인 정보와의 매칭여부에 따라 매칭 메시지와 비-매칭 메시지로 분류하는 단계; 및(5) 상기 단계 (4)의 분류 결과에 따라, 상기 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장하는 단계를 포함하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)의 동작방법."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 문자 메시지는,SMS, LMS, MMS, 인스턴트 메신저를 통한 메시지 및 앱 푸시 메시지를 포함하는 군에서 선택된 적어도 하나 이상의 형태인 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)의 동작방법."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 단계 (5)에서는,상기 비-매칭 메시지의 수신을 차단하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)의 동작 방법."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 단계 (4) 이후에는,(6) 상기 단계 (4)의 분류 결과에 따라, 상기 매칭 메시지를 마이 페이지로 이동시켜 저장하는 단계를 더 포함하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)의 동작 방법."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 단계 (6) 이후에는,(7) 상기 마이 페이지에 저장된 매칭 메시지를 분석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보를 캘린더형태로 제공하는 단계를 더 포함하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는애플리케이션(110)의 동작 방법.공개특허 10-2021-0088237-3-청구항 6 제5항에 있어서, 상기 단계 (7)에서는,상기 이벤트 정보를 상기 휴대 단말기(100)의 캘린더와 연동하여 제공하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)의 동작 방법."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "할인 정보 제공 시스템(10)으로서,사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션(110)이 설치된 휴대 단말기(100); 및상기 휴대 단말기(100)와 통신하는 서비스 서버(200)를 포함하며,상기 애플리케이션(110)은, 상기 휴대 단말기(100)에 설치되어 동작하되,(1) 선호 브랜드 또는 선호 제품을 포함하는 선호 할인 정보를 사전 등록하는 단계;(2) 상기 애플리케이션(110)이 실행되는 단계;(3) 상기 휴대 단말기(100)에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하는 단계;(4) 상기 검출된 광고 메시지와 상기 사전 등록된 선호 할인 정보를 비교하여, 상기 선호 할인 정보와의 매칭여부에 따라 매칭 메시지와 비-매칭 메시지로 분류하는 단계; 및(5) 상기 단계 (4)의 분류 결과에 따라, 상기 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장하는 단계를 포함하여 동작하며,상기 서비스 서버(200)는,상기 애플리케이션(110)의 동작에 따라 사전 등록된 상기 선호 할인 정보를 고객별로 저장하는 고객 DB(210);및상기 선호 할인 정보와 매칭되는 기업 서버에 상기 고객 DB(210)에 저장된 고객 정보를 제공하는 기업 제휴 모듈(220)을 포함하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템(10)."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 단계 (4) 이후에는,(6) 상기 단계 (4)의 분류 결과에 따라, 상기 매칭 메시지를 마이 페이지로 이동시켜 저장하는 단계; 및(7) 상기 마이 페이지에 저장된 매칭 메시지를 분석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보를 캘린더형태로 제공하는 단계를 더 포함하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는할인 정보 제공 시스템(10)."}
{"patent_id": "10-2020-0001442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 서비스 서버(200)는,상기 이벤트 정보에 따른 할인이 적용된 상품의 구매 페이지를, 상기 애플리케이션(110)을 통해 제공하는 마켓제공 모듈(230)을 더 포함하는 것을 특징으로 하는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템(10)."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법에 관한 것으로서, 보다 구체적으로는 휴대 단말기에 설치되어, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법에 있어서, 선호 브랜드 또는 선호 제품을 포함하는 선호 할인 정보를 사전 등록하는 단계; 상기 애 (뒷면에 계속)"}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 할인 정보를 제공하는 애플리케이션의 동작 방법 및 할인 정보 제공 시스템에 관한 것으로서, 보다 구체적으로는 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법 및 할인 정보 제공 시스템에 관한 것이다."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "문자 서비스는 기업들의 마케팅 수단으로 사용처가 확대되고, 고객 서비스 등을 위해 모바일 서비스의 시작부터 지금까지 꾸준히 사용되고 있다. 최근에는, 문자 서비스의 수신에 거부감을 느끼는 고객이 늘어나면서, 이메일, 모바일 메신저 등 다양한 채널을 이용한 마케팅이 이루어지고 있다. 대기업의 경우에는, 그 고객 DB에 저장된 고객이 수백만 명에 이르는데, 각 마케팅 채널별로 고객의 수신 동의 현황이 다르고, 마케팅 채널마다 별도의 대행사를 선정하거나 각 채널을 운영하는 업체를 통해 마케팅이 이루어 지기 때문에 관리에 어려움이 발생하고 있다. 특히, 전통적으로 사용되어 온 문자(SMS, LMS, MMS 등)와 이메일 이외에, 모바일 메신저와 같은 새로운 마케팅 채널이 활성화되고 있으나, 새로운 마케팅 채널에 유연하게 대응 할 수 있는 통합된 솔루션이 존재하지 않기 때문에 개별 관리가 이루어질 수밖에 없으며, 이에 따른 관리의 어 려움이 발생하고 있다. 즉, 기업으로서는, 메시징 서비스를 하는 각각의 채널마다 이를 관리하는 마케팅 업체가 상이하기 때문에, 문자, 이메일, 모바일 메신저 등 각각의 채널에 따른 분석 결과의 취합이 어렵다. 또한, 고객은 관심도 없는 광고를 휴대폰, 이메일 등으로 중복해서 받게 되므로 불쾌감 및 거부감이 높아지게 된다. 특히, 고객들은 지나친 광고 메시지로 인하여 큰 불편을 느끼고 있고, 관심 없는 광고에 대한 피로도 및 거부감 이 매우 높다. 또한, 광고 메시지를 모두 스팸으로 생각하다 보니, 유용한 할인 정보나 세일 정보까지도 스팸 으로 생각하고 확인하지 않아, 필요한 정보까지 놓치게 되는 경향이 있다. 따라서 문자 메시지에 대한 고객들 의 피로도를 줄여주고, 필요한 할인, 세일 정보를 필터링하여 제공하기 위한 기술의 개발이 필요한 실정이다. 한편, 본 발명과 관련된 선행기술로서, 등록특허 제10-1104602호(발명의 명칭: 단문 스팸 메시지의 필터링을 위 한 스팸 필터링 모델 학습 방법 및 이를 이용한 단문 스팸 메시지 필터링 방법 및 장치, 등록일자: 2012년 01월 03일) 등이 개시된 바 있다."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 휴대 단말기에 설 치된 애플리케이션이 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하고, 검출된 광고 메 시지와 사전 등록된 선호 할인 정보를 비교하여 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장함으로써, 사 전 등록되지 않은 광고성 문자 메시지를 필터링하여 광고에 대한 피로도를 줄여줄 수 있으며, 선호 할인 정보와 매칭되는 메시지는 마이 페이지를 통해 애플리케이션에서 확인할 수 있으므로 필요한 할인 정보를 누락하지 않 고 확인할 수 있고, 매칭 메시지에서 추출된 이벤트 정보를 캘린더 형태로 제공함으로써, 여러 할인 일정을 한 눈에 쉽게 파악할 수 있어 고객 만족도를 높일 수 있는, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애 플리케이션의 동작 방법 및 할인 정보 제공 시스템을 제공하는 것을 그 목적으로 한다."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 특징에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리 케이션의 동작 방법 및 할인 정보 제공 시스템은, 휴대 단말기에 설치되어, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법에 있어 서, 선호 브랜드 또는 선호 제품을 포함하는 선호 할인 정보를 사전 등록하는 단계; 상기 애플리케이션이 실행되는 단계; 상기 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하는 단계; 상기 검출된 광고 메시지와 상기 사전 등록된 선호 할인 정보를 비교하여, 상기 선호 할인 정보와의 매칭 여부에 따라 매칭 메시지와 비-매칭 메시지로 분류하는 단계; 및 상기 단계 의 분류 결과에 따라, 상기 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장하는 단계를 포 함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 문자 메시지는, SMS, LMS, MMS, 인스턴트 메신저를 통한 메시지 및 앱 푸시 메시지를 포함하는 군에서 선택된 적어도 하나 이상 의 형태일 수 있다. 바람직하게는, 상기 단계 에서는, 상기 비-매칭 메시지의 수신을 차단할 수 있다. 바람직하게는, 상기 단계 이후에는, 상기 단계 의 분류 결과에 따라, 상기 매칭 메시지를 마이 페이지로 이동시켜 저장하는 단계를 더 포함 할 수 있다. 더욱 바람직하게는, 상기 단계 이후에는, 상기 마이 페이지에 저장된 매칭 메시지를 분석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보를 캘린더 형태로 제공하는 단계를 더 포함할 수 있다. 더더욱 바람직하게는, 상기 단계 에서는, 상기 이벤트 정보를 상기 휴대 단말기의 캘린더와 연동하여 제공할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 특징에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템은, 할인 정보 제공 시스템으로서, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션이 설치된 휴대 단말기; 및 상기 휴대 단말기와 통신하는 서비스 서버를 포함하며, 상기 애플리케이션은, 상기 휴대 단말기에 설치되어 동작하되, 선호 브랜드 또는 선호 제품을 포함하는 선호 할인 정보를 사전 등록하는 단계; 상기 애플리케이션이 실행되는 단계; 상기 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하는 단계; 상기 검출된 광고 메시지와 상기 사전 등록된 선호 할인 정보를 비교하여, 상기 선호 할인 정보와의 매칭 여부에 따라 매칭 메시지와 비-매칭 메시지로 분류하는 단계; 및 상기 단계 의 분류 결과에 따라, 상기 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장하는 단계를 포 함하여 동작하며, 상기 서비스 서버는, 상기 애플리케이션의 동작에 따라 사전 등록된 상기 선호 할인 정보를 고객별로 저장하는 고객 DB; 및 상기 선호 할인 정보와 매칭되는 기업 서버에 상기 고객 DB에 저장된 고객 정보를 제공하는 기업 제휴 모듈을 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 단계 이후에는, 상기 단계 의 분류 결과에 따라, 상기 매칭 메시지를 마이 페이지로 이동시켜 저장하는 단계; 및 상기 마이 페이지에 저장된 매칭 메시지를 분석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보를 캘린더 형태로 제공하는 단계를 더 포함할 수 있다. 바람직하게는, 상기 서비스 서버는, 상기 이벤트 정보에 따른 할인이 적용된 상품의 구매 페이지를, 상기 애플리케이션을 통해 제공하는 마켓 제공 모듈을 더 포함할 수 있다."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법 및 할 인 정보 제공 시스템에 따르면, 휴대 단말기에 설치된 애플리케이션이 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하고, 검출된 광고 메시지와 사전 등록된 선호 할인 정보를 비교하여 비-매칭 메시 지를 스팸 메시지함에 이동시켜 저장함으로써, 사전 등록되지 않은 광고성 문자 메시지를 필터링하여 광고에 대 한 피로도를 줄여줄 수 있으며, 선호 할인 정보와 매칭되는 메시지는 마이 페이지를 통해 애플리케이션에서 확 인할 수 있으므로 필요한 할인 정보를 누락하지 않고 확인할 수 있고, 매칭 메시지에서 추출된 이벤트 정보를 캘린더 형태로 제공함으로써, 여러 할인 일정을 한눈에 쉽게 파악할 수 있어 고객 만족도를 높일 수 있다."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단 되는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 ‘연결’ 되어 있다고 할 때, 이는 ‘직접적으로 연결’ 되 어 있는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 ‘간접적으로 연결’ 되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 ‘포함’ 한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 1은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템 의 구성을 도시한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 사전 등록을 통해 필터 링 된 할인 정보를 제공하는 할인 정보 제공 시스템은, 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션이 설치된 휴대 단말기 및 휴대 단말기와 통신하는 서비스 서버를 포함하여 구성될 수 있다. 즉, 애플리케이션은, 휴대 단말기에 설치되어 동작하며, 사전 등록을 통해 필터링 된 할인 정보를 제 공하는 애플리케이션일 수 있다. 휴대 단말기는, 애플리케이션의 설치, 실행, 종료 등을 제어 하고, 사용자 요청에 따라 세부적인 구동을 제어할 수 있다. 휴대 단말기는 중앙처리장치로 구동되는 마 이크로컴퓨터와 마이크로컴퓨터의 동작을 보호하는 주변 장치를 포함하여 구성되어 애플리케이션을 구동 제어할 수 있으며, 롬이나 램과 같은 메모리에 저장된 실행 프로그램인 애플리케이션을 실행하는 구성 부 품을 포함하여 구성될 수 있다. 또한, 애플리케이션은, 통신망 등에서 운영되는 애플리케이션 서버에서 관리하는 설치 프로그램에 의 하여 설치된 실행 프로그램일 수 있다. 또한, 선호 할인 정보를 등록하고, 메시지 확인을 위한 각종 인터페이 스를 제공할 수 있다. 한편, 휴대 단말기는, 스마트폰, 태블릿(tablet) PC(personal computer), 이동 전화기, 영상 전화기, 전 자책 리더기, 랩탑(laptop) PC, 넷북(netbook) 컴퓨터, PDA(personal digital assistant), 미디어 박스, 게임 콘솔, 전자사전 또는 웨어러블 장치(wearable device) 등 휴대가 가능한 전자 장치 중 적어도 하나를 포함할 수 있다. 여기서, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트렌즈, 또는 머 리착용형 장치(HMD, head-mounted-device), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 (skin pad) 또는 문신), 또는 생체 이식형 회로(implantable circuit) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예들에서, 휴대 단말기는 전술한 기기들에 한정되지는 않으며, 전술한 다양한 장치 중 둘 이상의 조합일 수 있다. 서비스 서버는, 휴대 단말기와 네트워크를 통해 통신하여, 각종 신호 및 데이터를 송수신할 수 있다. 여기서, 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN) 또는 부 가가치 통신망(Value Added Network; VAN) 등과 같은 유선 네트워크나 이동 통신망(mobile radio communication network), 위성 통신망, 블루투스(Bluetooth), Wibro(Wireless Broadband Internet), HSDPA(High Speed Downlink Packet Access), LTE(Long Term Evolution), 5G(5th Generation Mobile Telecommunication) 등과 같은 모든 종류의 무선 네트워크로 구현될 수 있다. 도 2는 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동 작 방법의 흐름을 도시한 도면이다. 도 2에 도시된 바와 같이, 본 발명의 일실시예에 따른 사전 등록을 통해필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법은, 선호 할인 정보를 사전 등록하는 단계 (S100), 애플리케이션이 실행되는 단계(S200), 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하는 단계(S300), 검출된 광고 메시지와 사전 등록된 선호 할인 정보를 비교하여 매칭 메시지와 비-매칭 메시지로 분류하는 단계(S400) 및 비-매칭 메시지를 스팸 메시지에 이동시켜 저장하는 단계(S500)를 포 함하여 구현될 수 있다. 단계 S100에서는, 선호 브랜드 또는 선호 제품을 포함하는 선호 할인 정보를 사전 등록할 수 있다. 고객은 휴 대 단말기에서 구동된 애플리케이션을 이용해 선호 할인 정보를 등록, 추가, 삭제, 편집 등을 할 수 있다. 실시예에 따라서는, 서비스 서버가 매칭 메시지와 비-매칭 메시지의 확인율, 확인되는 매칭 메시지 또는 비-매칭 메시지의 종류 등, 각 고객의 애플리케이션 사용 패턴을 분석하고, 분석 결과에 따라 해당 고객의 휴대 단말기에 설치된 애플리케이션과 통신하여 선호 할인 정보에 새로운 브랜드 또는 제품 등을 추가할 수 있다. 단계 S200에서는, 애플리케이션이 실행될 수 있다. 이때, 단계 S200에서는, 휴대 단말기에 수신되는 문자 메시지의 실시간 모니터링을 위해 휴대 단말기에서 애플리케이션이 백그라운드로 실행될 수 있 다. 단계 S300에서는, 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출할 수 있다. 즉, 본 발명은, 지나친 광고 메시지에 대한 고객의 피로도를 줄이기 위한 것이므로, 단계 S300에서 애플리케이션 이 광고 메시지를 검출함으로써, 추후 상세히 설명할 단계 S400 이후에서 검출된 광고 메시지에 대해 고객 이 관심이 있는지를 판단하여 처리할 수 있다. 광고성 메시지가 아닌 지인으로부터 받은 메시지, 정보 메시지 등과 같은 일반적인 문자 메시지에 대해서는, 사전 등록 여부와 관계없이 휴대 단말기에 정상적으로 수신 되어 확인이 가능하도록 처리할 수 있다. 여기서, 문자 메시지는, SMS, LMS, MMS, 인스턴트 메신저를 통한 메시지 및 앱 푸시 메시지를 포함하는 군에서 선택된 적어도 하나 이상의 형태일 수 있다. 최근에는 기존의 문자(SMS, LMS, MMS 등) 외에, 인스턴트 메신저 (모바일 메신저), 휴대 단말기에 설치된 각종 애플리케이션에서 제공하는 앱 푸시 메시지 등, 다양한 채널 을 통해 광고, 할인, 세일 정보가 제공되고 있다. 따라서 단계 S300에서는, 단계 S200에서 실행된 애플리케이 션이 다양한 형태로 제공되는 문자 메시지를 감시하여, 다양한 채널을 통합 관리할 수 있다. 한편, 단계 S300에서는, 수신되는 문자 메시지를 분석하고, 광고 메시지 여부를 판단하여 검출할 수 있는데, 이 때 문자 메시지의 송신 번호, 송신 채널, 메시지를 푸시한 애플리케이션 등 송신 주체에 따라 광고 메시지 여부 를 판단할 수 있고, 문자 메시지에 포함된 텍스트 등을 이용해 광고 메시지를 검출할 수도 있다. 또한, 실시예 에 따라서는, 인공지능 기반으로 학습된 검출기를 사용해 광고 메시지를 검출할 수도 있다. 이때, 검출기는 CNN(Convolutional neural network), RNN(Recurrent Neural Network) 등의 인공신경망 모델일 수 있으며, 랜덤 포레스트(Random Forest), 가중 랜덤 포레스트 분류기(WRFR), 캐스케이드 회귀 포레스트(Cascade Regression Forest) 등의 랜덤 포레스트 기반의 모델일 수도 있다. 단계 S400에서는, 검출된 광고 메시지와 사전 등록된 선호 할인 정보를 비교하여, 선호 할인 정보와의 매칭 여 부에 따라 매칭 메시지와 비-매칭 메시지로 분류할 수 있다. 보다 구체적으로, 단계 S400에서는, 광고 메시지 가 선호 할인 정보에 포함된 선호 브랜드나 선호 제품에 해당하는 키워드를 포함하면 매칭 메시지로, 포함하지 않으면 비-매칭 메시지로 분류할 수 있다. 단계 S500에서는, 단계 S400의 분류 결과에 따라, 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장할 수 있다. 즉, 애플리케이션은, 비-매칭 메시지를 스팸 메시지함에 이동시켜, 휴대 단말기로 메시지 수신 알람(소리, 진동, 배지, 배너 등)이 출력되지 않도록 하고, 고객이 원할 때는 애플리케이션의 스팸 메시지함에 서 비-매칭 메시지의 확인이 가능하도록 저장할 수 있다. 한편, 단계 S500에서는, 비-매칭 메시지의 수신을 차단할 수 있다. 또한, 미리 정해진 시간이 경과하면 스팸 메시지함에 저장된 비-매칭 메시지를 삭제할 수 있고, 수신 차단된 비-매칭 메시지는 스팸 메시지함에 저장하지 않고 바로 삭제할 수도 있다. 도 3은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동 작 방법에서, 매칭 메시지에 대한 처리 흐름을 도시한 도면이다. 도 3에 도시된 바와 같이, 본 발명의 일실시 예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방법은, 단계 S400 이 후에, 매칭 메시지를 마이 페이지로 이동시켜 저장하는 단계(S600) 및 마이 페이지에 저장된 매칭 메시지를 분 석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보를 캘린더 형태로 제공하는 단계(S700)를 더 포함하여 구현 될 수 있다. 단계 S600에서는, 단계 S400의 분류 결과에 따라, 매칭 메시지를 마이 페이지로 이동시켜 저장할 수 있다. 즉, 고객의 선호 할인 정보와 매칭되는 광고 메시지는, 애플리케이션의 마이 페이지로 이동시켜 고객이 다양한 채널에서 수신된 매칭 메시지를 통합하여 확인 및 관리할 수 있도록 할 수 있다. 도 4는 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동 작 방법에서, 마이 페이지에서 매칭 메시지가 제공되는 휴대 단말기를 예를 들어 도시한 도면이다. 도 4 에 도시된 바와 같이, 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케 이션의 동작 방법에서는, 고객이 휴대 단말기에 설치된 애플리케이션의 마이 페이지를 통해, 여 러 채널에서 수신된 매칭 메시지를 한 번에 확인할 수 있어 편리하다. 다만, 실시예에 따라서는, 매칭 메시지는, 해당 문자 메시지의 수신 방식에 따라 SMS, LMS, MMS, 인스턴트 메신 저를 통한 메시지, 앱 푸시 메시지 등의 형태로 휴대 단말기에 수신될 수도 있다. 즉, 애플리케이션(11 0)의 마이 페이지를 통하지 않고, 해당 문자 메시지의 원래 수신 방식에 따라 수신하여, 각각의 채널을 직접 통 해 고객이 매칭 메시지를 확인할 수 있다. 단계 S700에서는, 마이 페이지에 저장된 매칭 메시지를 분석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보 를 캘린더 형태로 제공할 수 있다. 여기서, 이벤트 정보는, 이벤트 기간, 이벤트 내용을 포함할 수 있으며, 예 를 들어 할인 기간, 할인 브랜드, 할인 품목, 할인율 등을 포함할 수 있다. 단계 S700은, 텍스트 분석을 통해 매칭 메시지를 분석하여 이벤트 정보를 추출할 수 있으며, 매칭 메시지가 이미지를 포함하는 경우에는 이미지 처리 기술을 이용해 텍스트로 이벤트 정보를 추출할 수 있다. 도 5는 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동 작 방법에서, 캘린더 형태로 매칭 메시지가 제공되는 휴대 단말기를 예를 들어 도시한 도면이다. 도 5에 도시된 바와 같이, 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션 의 동작 방법의 단계 S700에서는, 이벤트 기간과 이벤트 내용이 캘린더에 표시되어 제공될 수 있다. 이와 같이, 캘린더 형태로 이벤트 정보를 제공함으로써, 고객은 한눈에 할인 정보의 일정을 쉽게 확인할 수 있다. 한편, 단계 S700에서는, 이벤트 정보를 휴대 단말기의 캘린더와 연동하여 제공할 수 있다. 따라서 고객은 애플리케이션의 캘린더를 따로 방문하지 않고도, 휴대 단말기에 별도로 설치되어 있는 캘린더에서 바 로 이벤트 정보를 확인할 수 있으므로, 편의성이 극대화될 수 있다.도 6은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템 에서, 서비스 서버의 세부적인 구성을 도시한 도면이다. 도 6에 도시된 바와 같이, 본 발명의 일실시 예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템의 서비스 서버는, 고객 DB 및 기업 제휴 모듈을 포함하여 구성될 수 있으며, 마켓 제공 모듈을 더 포함하여 구성될 수 있다. 고객 DB는, 애플리케이션의 동작에 따라 사전 등록된 선호 할인 정보를 고객별로 저장할 수 있다. 즉, 서비스 서버는, 각 고객의 휴대 단말기와 통신하여 고객별로 고객 정보와 해당 고객의 선호 할인 정보를 저장하여 고객 DB를 구성할 수 있다. 기업 제휴 모듈은, 선호 할인 정보와 매칭되는 기업 서버에 고객 DB에 저장된 고객 정보를 제공할 수 있다. 즉, 고객이 설정한 선호 브랜드나 선호 제품을 제조 및/또는 판매하는 기업이나, 선호 브랜드나 선호 제 품과 관련된 기업에 고객 정보를 제공함으로써, 기업은 실질적으로 관심이 있는 고객에게 문자 메시지를 송신하 여, 타겟 광고를 통해 광고 효과를 높일 수 있으며, 불필요한 광고 메시지 전송에 따른 이미지 손상을 최소화할 수 있다. 여기서, 고객 정보를 제공한다는 것은, 고객 정보를 기업 서버에 이전하는 것일 수도 있으나, 기업 서버가 문자 메시지 발송 시 고객 DB에 저장된 고객 정보를 사용할 수 있도록 하는 사용 권한을 부여하는 것일 수 있다. 따라서 고객의 고객 정보는 안전하게 서비스 서버에 보관하고 기업에게는 고객 DB 사용료를 부과하여, 개인 정보 보호 및 사용료 징수의 효과를 얻을 수 있다. 마켓 제공 모듈은, 이벤트 정보에 따른 할인이 적용된 상품의 구매 페이지를, 애플리케이션을 통해 제공할 수 있다. 즉, 애플리케이션을 통해 바로 상품의 구매가 가능하도록 하여, 선호 할인 정보와 매칭 되는 문자 메시지에 의한 구매율을 높이고, 고객의 편의를 향상시킬 수 있다. 도 7은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동 작 방법 및 할인 정보 제공 시스템에서, 상품 구매 페이지가 제공된 휴대 단말기를 예를 들어 도시한 도면이다. 도 7에 도시된 바와 같이, 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제 공하는 애플리케이션의 동작 방법 및 할인 정보 제공 시스템에서는, 휴대 단말기에 설치된 애플 리케이션의 마이 페이지에서 매칭 메시지가 선택되면, 해당 매칭 메시지의 할인이 적용된 상품의 구매 페 이지가 바로 제공될 수 있다. 전술한 바와 같이, 본 발명에서 제안하고 있는 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션 의 동작 방법 및 할인 정보 제공 시스템에 따르면, 휴대 단말기에 설치된 애플리케이션이 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하고, 검출된 광고 메시지와 사전 등 록된 선호 할인 정보를 비교하여 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장함으로써, 사전 등록되지 않 은 광고성 문자 메시지를 필터링하여 광고에 대한 피로도를 줄여줄 수 있으며, 선호 할인 정보와 매칭되는 메시 지는 마이 페이지를 통해 애플리케이션에서 확인할 수 있으므로 필요한 할인 정보를 누락하지 않고 확인할 수 있고, 매칭 메시지에서 추출된 이벤트 정보를 캘린더 형태로 제공함으로써, 여러 할인 일정을 한눈에 쉽게 파악할 수 있어 고객 만족도를 높일 수 있다."}
{"patent_id": "10-2020-0001442", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상 설명한 본 발명은 본 발명이 속한 기술분야에서 통상의 지식을 가진 자에 의하여 다양한 변형이나 응용이 가능하며, 본 발명에 따른 기술적 사상의 범위는 아래의 특허청구범위에 의하여 정해져야 할 것이다.부호의 설명 10: 본 발명에 따른 할인 정보 제공 시스템 100: 휴대 단말기 110: 애플리케이션 200: 서비스 서버 210: 고객 DB 220: 기업 제휴 모듈 230: 마켓 제공 모듈 S100: 선호 할인 정보를 사전 등록하는 단계 S200: 애플리케이션이 실행되는 단계 S300: 휴대 단말기에 수신되는 문자 메시지를 감시하여 광고 메시지를 검출하는 단계 S400: 검출된 광고 메시지와 사전 등록된 선호 할인 정보를 비교하여 매칭 메시지와 비-매칭 메시지로 분류하는 단계 S500: 비-매칭 메시지를 스팸 메시지함에 이동시켜 저장하는 단계 S600: 매칭 메시지를 마이 페이지로 이동시켜 저장하는 단계 S700: 마이 페이지에 저장된 매칭 메시지를 분석하여 이벤트 정보를 추출하고, 추출된 이벤트 정보를 캘린더 형 태로 제공하는 단계"}
{"patent_id": "10-2020-0001442", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템의 구성을 도시한 도면. 도 2는 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방 법의 흐름을 도시한 도면. 도 3은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방 법에서, 매칭 메시지에 대한 처리 흐름을 도시한 도면. 도 4는 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방 법에서, 마이 페이지에서 매칭 메시지가 제공되는 휴대 단말기를 예를 들어 도시한 도면. 도 5는 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방 법에서, 캘린더 형태로 매칭 메시지가 제공되는 휴대 단말기를 예를 들어 도시한 도면. 도 6은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 할인 정보 제공 시스템에 서, 서비스 서버의 세부적인 구성을 도시한 도면. 도 7은 본 발명의 일실시예에 따른 사전 등록을 통해 필터링 된 할인 정보를 제공하는 애플리케이션의 동작 방 법 및 할인 정보 제공 시스템에서, 상품 구매 페이지가 제공된 휴대 단말기를 예를 들어 도시한 도면."}
