{"patent_id": "10-2022-0138594", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0057866", "출원번호": "10-2022-0138594", "발명의 명칭": "무선센서 및 메타버스를 이용한 통합 설비 감시 시스템", "출원인": "디씨테크 주식회사", "발명자": "양재흥"}}
{"patent_id": "10-2022-0138594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "회전설비에 장착되어 진동을 포함하는 측정정보를 생성하는 센싱모듈(110);상기 센싱모듈(110)의 데이터 취급방식을 수집·분석하여 제1분석정보를 생성하는 제1분석모듈(120);플랜트에서 운용중인 감시체계의 구성 및 프로세스를 수집·분석하여 제2분석정보를 생성하는 제2분석모듈(130);상기 제1분석정보 및 제2분석정보와, 상기 센싱모듈(110)에서 수집되는 로우데이터와, 감시대상 설비정보를 저장하여 구축되는 데이터베이스(140);감시대상 설비 및 적용된 센싱모듈(110)에 대하여 상기 데이터베이스를 통해 검색된 데이터에 기반한 데이터를연계방식을 적용 및 처리하는 연계모듈(150);적용된 센싱모듈(110)로부터 수집되는 신호값을 주파수 분석을 위해 변환하는 변환부(161)와, 변환된 신호값을분석하여 결합을 진단하는 진단부(162)를 구비하며, 설비 상태를 모니터링하는 통합감시모듈(160); 을 구비하는것을 특징으로 하는 통합 설비 감시 시스템."}
{"patent_id": "10-2022-0138594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 변환부를 통해 변환된 신호값을 학습하되, 결함이 진단된 신호값을 추출하여 학습데이터를 생성하는 학습부(171)와, 상기 학습데이터를 통해 결함별로 신호값을 분류하여 상기 진단부에 적용하는 반영부(172)를 구비하는 학습모듈(170); 을 더 포함하는 것을 특징으로 하는 통합 설비 감시 시스템."}
{"patent_id": "10-2022-0138594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,감시대상 설비에 대응하여 생성된 디지털 객체를 통해 디지털 트윈 3D모델을 생성하여 관리하는 가상엔진부(181)와, 상기 통합감시모듈과 연계하여 분석된 신호값 및 진단결과를 상기 3D모델에 반영하는 동기화부(182)를구비하는 메타버스모듈; 을 더 포함하는 것을 특징으로 하는 통합 설비 감시 시스템."}
{"patent_id": "10-2022-0138594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 연계모듈(150)은, 센싱모듈(110)에서 생성되는 데이터를 설정된 주기로 통합감시모듈과 직접 연계하는 직접연계부(151)와, 센싱모듈(110)의 운영프로그램에서 API KEY를 이용하여 데이터 추출 후 sFTP를 이용하여 설정된 주기로 통합감시모듈로 전송하는 API연계부(152)와, 센싱모듈(110)의 데이터를 OPC Server로 추출하여 프로토콜에 따른 OPC UA 데이터 변환을 통해 통합감시모듈로 전송하는 OPC-UA연계부(153)를 포함하는 것을 특징으로하는 통합 설비 감시 시스템."}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무선진동센서로 대표되는 다양한 설비감시용 측정장치의 제품정보를 수집·분석하여 통합된 감시 시스 템을 통해 활용 가능하도록 하며 기계학습 및 메타버스 기술을 접목하여 각종 고장에 사전 또는 신속대응이 가능 하고, 관리자의 현장 방문 없이도 감시 대상 설비들의 구조와 동작상태 인지와 결함 발생원인 및 상황 파악이 용이하도록 지원하는 무선센서 및 메타버스를 이용한 통합 설비 감시 시스템에 관한 것이다."}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 통합 설비 감시 시스템에 관한 것으로, 자세하게는 무선진동센서로 대표되는 다양한 설비감시용 측정 장치의 제품정보를 수집·분석하여 통합된 감시 시스템을 통해 활용 가능하도록 하며 기계학습 및 메타버스 기 술을 접목하여 각종 고장에 사전 또는 신속대응이 가능하고, 관리자의 현장 방문 없이도 감시 대상 설비들의 구조와 동작상태 인지와 결함 발생원인 및 상황 파악이 용이하도록 지원하는 무선센서 및 메타버스를 이용한 통 합 설비 감시 시스템에 관한 것이다."}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래 정보통신 기술의 급속한 발전과 함께 각종 산업 플랜트에 대한 효율적인 관리요구의 증가로, 국내외의 대 형 플랜트는 진동측정장치로 대표되는 다양한 유무선측정장치를 사용하며 설비내 구비된 다양한 장비의 상태를 감시/분석하고 있으며, 이를 통해 관리자가 직접 순찰하며 장비 상태를 직접 확인지 않고도 원격 모니터링을 통 해 상태를 파악하고 유사시 신속 대처할 수 있도록 하고 있다. 하지만, 아직 무선진동측정장치 등 많은 측정장치는 메이커에서 제작한 전용 소프트웨어를 통해 측정결과를 개 별 분석하는 실정으로, 다양한 장치의 개별 감시/분석으로 사용자는 전용 소프트웨어가 탑재된 다수의 시스템을 운용할 수밖에 없고 고가의 장비 및 패키지(SW)로 공급되는 시스템의 특성상 중소 플랜트 사업장은 무선진동측 정장비 도입에 곤란한 문제가 있다. 더군다나 이러한 전용 소프트웨어 시스템은 근래 효율적인 플랜트 관리를 위해 도입되는 인공지능(AI) 기반의 신기술 접목을 위해 위해 별도 소프트웨어의 개발을 필요로 하므로 이들을 통합하여 활용할 수 있는 시스템이 요구되고 있다. 언급한 최근 주목받는 신기술 중 대표적인 것이 디지털 트윈(Digital Twin) 등의 개념이 포함된 메타버스로서 실제 설비와 동일한 환경을 소프트웨어로 복제하여 디지털 환경에 디지털 가상 객체를 구현하고, 설비로부터 발 생하는 데이터를 실시간으로 수집하여 운영자에게 제공하는 솔루션을 들 수 있다. 이를 통해 관리자는 실제 플랜트를 가상으로 구현한 메타버스 공간을 통해 설비의 작동 상태를 실시간으로 확인 할 수 있으며, 고장이나 사고 발생 등 설비 작동 데이터를 메타버스를 통해 확인 및 예측한 후 바로 대응할 수 있는 장점이 있다. 하지만 앞서 언급한 개별 측정장치의 전용 소프트웨어 사용에 따른 호환성 등의 이유로 개별 무선측정장치를 통 합하여 관리가 쉽지 않은 가운데 아직 설비의 데이터를 분석하여 이를 단순히 제공하는 수준에서 이의 진단에 따른 상태 예측, 공정 최적화 등과 같은 기능을 구현하는 데는 많은 어려움이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-2206832호 (2021.01.19)"}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 필요에 의하여 창출된 것으로, 본 발명의 목적은 양한 설비감시용 측정장치의 제품정보 를 수집·분석하여 통합된 감시 시스템을 통해 활용 가능하도록 하며 기계학습 및 메타버스 기술을 접목하여 각 종 고장에 사전 또는 신속대응이 가능한 무선센서 및 메타버스를 이용한 통합 설비 감시 시스템을 제공하는 것 이다."}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 위해 본 발명은 회전설비에 장착되어 진동을 포함하는 측정정보를 생성하는 센싱모듈; 상기 센싱모듈의 데이터 취급방식을 수집·분석하여 제1분석정보를 생성하는 제1분석모듈; 플랜트에서 운용중인 감시 체계의 구성 및 프로세스를 수집·분석하여 제2분석정보를 생성하는 제2분석모듈; 상기 제1분석정보 및 제2분석 정보와, 상기 센싱모듈에서 수집되는 로우데이터와, 감시대상 설비정보를 저장하여 구축되는 데이터베이스; 감 시대상 설비 및 적용된 센싱모듈에 대하여 상기 데이터베이스를 통해 검색된 데이터에 기반한 데이터를 연계방 식을 적용 및 처리하는 연계모듈; 적용된 센싱모듈로부터 수집되는 신호값을 주파수 분석을 위해 변환하는 변환부와, 변환된 신호값을 분석하여 결합을 진단하는 진단부를 구비하며, 설비 상태를 모니터링하는 통합감시모듈; 을 구비하는 것을 특징으로 한다. 이때, 상기 변환부를 통해 변환된 신호값을 학습하되, 결함이 진단된 신호값을 추출하여 학습데이터를 생성하는 학습부와, 상기 학습데이터를 통해 결함별로 신호값을 분류하여 상기 진단부에 적용하는 반영부를 구비하는 학 습모듈; 을 더 포함할 수 있다. 또한, 감시대상 설비에 대응하여 생성된 디지털 객체를 통해 디지털 트윈 3D모델을 생성하여 관리하는 가상엔진 부와, 상기 통합감시모듈과 연계하여 분석된 신호값 및 진단결과를 상기 3D모델에 반영하는 동기화부를 구비하 는 메타버스모듈; 을 더 포함할 수 있다. 또한, 상기 연계모듈은, 센싱모듈에서 생성되는 데이터를 설정된 주기로 통합감시모듈과 직접 연계하는 직접연 계부와, 센싱모듈의 운영프로그램에서 API KEY를 이용하여 데이터 추출 후 sFTP를 이용하여 설정된 주기로 통합 감시모듈로 전송하는 API연계부와, 센싱모듈의 데이터를 OPC Server로 추출하여 프로토콜에 따른 OPC UA 데이터 변환을 통해 통합감시모듈로 전송하는 OPC-UA연계부를 포함할 수 있다."}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명을 통해 다양한 장치를 하나의 프로그램에 통합하여 플랜트에 구비된 다양한 장치와 연결을 통해 통합 감시가 이루어질 수 있으며, 웹기반으로 사용자의 요구에 부응하는 유연한 시스템 구축이 가능하다. 또한, 초기 정상 데이터 경계를 설정, 경계 외의 데이터는 비정상으로 정의하는 머신러닝과 결함발생 초기 결과 를 관리자에게 통보하는 기능을 통해, 각종 고장에 사전 또는 신속대응으로 플랜트의 안정적 운영에 기여할 수 있다. 특히 메타버스를 통해 설비를 시각화하여 원격의 관리자가 현장 방문 없이도 직관적으로 결함 발생원인 및 상황 파악할 수 있으며, 감시 대상 설비들의 구조와 동작상태 정보들을 쉽게 인지하고, 비정상 상태 발생 시 현상 파 악과 분석 시간을 최소화할 수 있다."}
{"patent_id": "10-2022-0138594", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명 무선센서 및 메타버스를 이용한 통합 설비 감시 시스템의 구조를 구체적 으로 설명한다. 도 1은 본 발명의 개념도로서, 본 발명은 별도의 프로그램을 사용하는 다양한 센싱모듈 제품을 분석하여 데이터 저장 및 처리구조 및 형식을 취득하여 다양한 센싱모듈과 통합 데이터베이스를 연결하는 PROCESS/ 알고리즘을 구현함으로 호환성을 향상시켜 데이터 감시/분석/알람 등의 기능을 갖는 다양한 설비의 감시시스템 에 즉시 접목시킬 수 있도록 한다. 또한, 센싱 데이터를 분석하여 설비결함을 진단할 수 있도록 지원한다. 도 2는 본 발명의 구성 및 연결 관계를 나타낸 블록도로서, 본 발명은 주요구성으로 센싱모듈과, 제1분석 모듈 및 제2분석모듈과, 데이터베이스와, 연계모듈과, 통합감시모듈을 비롯하여, 확 장 기능으로 머신러닝을 위한 학습모듈 및 메타버스 기술 접목을 위한 메타버스모듈을 구비한다. 상기 센싱모듈은 설비의 상태를 측정하기 위한 센서로서, 본 발명에서는 대표적인 센서로 회전설비에 장착 되어 진동을 포함하는 측정정보를 생성하는 센서가 적용된다. 본 발명의 실시예에서 상기 센싱모듈로는 국내 활용 중인 무선진동측정 장치로 한국업체 Assetcare사의 W-CMS를 비롯하여, 벨기에 ‘I“사의 ’W’제품, 미 국 ‘B’사의 ‘R’제품의 3종을 선정하였다. 상기 제1분석모듈은 상기 센싱모듈의 데이터 취급방식을 수집·분석하여 제1분석정보를 생성하는 구 성이다. 도 3은 본 발명의 실시예에 따른 무선진동측정장치 SW 분석화면으로, 기본적으로 적용대상 센싱모듈 의 데이터 저장 및 분석 SW를 분석하게 되며 센서의 데이터 저장형식, 데이터베이스, 데이터 연결방식을 제1분석정보에 포함시키게 된다. 상기 제2분석모듈은 플랜트에서 운용중인 감시체계의 구성 및 프로세스를 수집·분석하여 제2분석정보를 생성하는 구성이다. 도 4는 본 발명의 실시예에 따른 플랜트 감시체계 분석화면으로, 플랜트의 구성, 데이터 통 합을 위한 process 분석을 통해 데이터 통합에 따른 상호운용을 위한 방안을 위한 정보를 분석하여 제2분석정보 를 생성한다. 데이터 통합에 따른 상호운용을 위한 방안을 위해 관련표준을 반영할 수 있으며 ISO18431/ISO 13374에서는 무선 진동 센서 등 장비를 이용한 상태감시 절차와 신호 처리방안에 대하여 제안함에 따라 본 발명의 실시예에서는 이를 검토하여 반영하였다. ISO18431/ISO 13374의 제안사항은 다음 [표 1]과 같다. 표 1 제안사항 상세 내용 상태 감시 프로그램 정의 - 감시 대상설비 선정, 적절한 측정 시스템의 유형을 결정하여 적용 권고 - 속도, 부하, 온도 등의 운전 조건은 명확한 표현으로 수진된 진동 데이터에 방영을 권고 - 데이터의 표현은 축의 속도(rpm), 기계의 부하(통력, 유량, 압력 등) 및 측정되는 진 동에 영향을 준수 있는 다른 운전 파라미터를 포함 - 일반적인 데이터 취득은, 운전 조건이 가능한 기계의 정격 또는 통상 운전에 가까울 것을 권장 - 데이터는 기계가 동일한 또는 유사 조건하에 운전될 때, 알려진 재현성 있는 프로세 스 파라미터가 취득되어야 함 상태 평가 과정- 문제 탐지(정상 상태에서의 이탈) - 결함과 결함 원인의 진단 - 향후 결함 진행에 대한 예지 - 문제의 해결 또는 대책을 위한 처방 - 사후 분석 신호 처리 - 필터링 : 시간영역 신호는 저주파-통과, 고주파-통과, 밴드-패스 (band-pass, 대역 통과) 또는 밴드-리젝트 (band-reject) 필터를 통해 필터된다. - 표본화 : 표본화 주파수 fs로 불리는 비율로 표본화 최대(나이키스트) 주파수 fN ＝ fs/2 표본화 간격 Dt ＝ 1/fs - 신호 전처리 : 시간 영역 결과물을 발생시키기 위해 신호를 처리하기에 앞서, 디지털 신호는 원하지 않는 협대역 또는 대역 이외의 잡음을 제거하기 위하여 흔히 선형 필터 를 사용하여 전처리 - 푸리에 변환: 시간 영역에서 물리 단위를 갖는 연속의 데이터를 이산 푸리에 변환 방 정식에 의해 주파수 영역으로 변환 - 시간영역 분석 : 크기 분석/ 분포 함수 분석/ 모멘트 분석/ 상관 분석/ 충격 응답 스 펙트럼 - 주파수영역 분석 : 주파수의 함수로써 진동의 특성을 결정상기 데이터베이스는 상기 제1분석정보 및 제2분석정보와, 상기 센싱모듈에서 수집되는 로우데이터와, 감시대상 설비정보를 저장하여 구축된다. 구체적으로 상기 데이터베이스는 감시대상 설비와 센싱 모듈에서 취득된 데이터의 분류를 위한 정보인 신호정보와, 진동분석을 위해 센싱모듈로부터 수집되 는 데이터인 raw data와, 데이터 비교 및 빅데이터화를 위한 센싱모듈의 설치대상 설비의 정보인 설비정보 와, 학습에 활용하기 위한 설비의 결함정보와, 분석용 데이터 변환 결과로 주파수 분석을 위해 FFT 알고리즘을 이용하여 변환한 spectrum data, 머신러닝 데이터로 신호의 특징을 추출하여 학습하여 결함별로 분류한 학습결 과, 학습결과와 비교를 통해 입력된 데이터의 결함을 진단한 진단결과 등이 저장된다. 본 발명의 실시예에서는 3종의 센싱모듈과 연계하여 데이터베이스를 구축하기 위해 데이터를 표준화 하였다. 이때 향후 자동예측진단 시스템으로 업그레이드를 위해 설비정보 포함하여 표준화를 수행하였으며, 설 비정보/결함정보를 포함한 Properties와 진동 신호 정보를 포함한 data로 구분, 데이터베이스 및 데이터 관리를 고려하여 표준화를 수행하였다. [표 2]는 표준화 항목 ‘Properties’를 나타낸다. 표 2 표준화 항목 설명 활용 분야 예시 ID 데이터 ID 데이터 분류 \"0058001010181407001318 0503093540\" Failure Type 데이터의 결함 분석 결과 AI 기계 학습 “misalignment” Measure Point 센서의 측정 지점 기호 데이터 분류 \"POV\" Motor Model 측정 대상 설비의 motor 모델 명 동종/ 유사설비 분류 \"112S\" Motor Type 측정 대상 설비의 motor 타입 동종/ 유사설비 분류 \"AC induction\" Motor Rated Frequency측정 대상 설비 motor의 운전 주파수 결함 주파수 선정/ 동종설비 분류 3430 Motor Rated Power측정 대상 설비 motor의 출력 동종설비 분류 2.2 Motor Bearing Type측정 대상 설비 motor의 베어 링 종류 결함 종류 및 결함 주파수 선정 \"Antifriction\" Pump Model 대상 설비 펌프의 모델명 동종/ 유사설비 분류 \"HES 32-125\" Pump Support 대상 설비 펌프의 베어링 지지 형식 결함 종류 선정 \"over-hung\" Pump Number of Outlet Vanes대상 설비 펌프의 베인 날개수 결함 주파수 선정 5 Pump Inlet Type대상 설비 펌프의 inlet의 형 식 결함 주파수 선정 \"volute\" Pump Bearing Type대상 설비 펌프의 베어링 종류 결함 주파수 선정 \"Antifriction\" Pump Fluid Type대상 설비 펌프의 작동유체 종 류 결함 종류 및 결함 주파수 선정 \"water\" Pump Number of Stages대상 설비 펌프의 단수 결함 종류 선정 \"one\" [표 3]은 본 발명의 실시예에 따른 표준화 항목 검토 ‘data’를 나타낸다. 표 3 표준화 항목 설명 활용 분야 예시 Time 샘플링 시간 데이터의 신호처리/ 데이터 주파수 범위 “8.44595e-05” Value(mm/s) 센서의 측정 값 데이터 분석 및 결함 평가 “-0.04560919999999999 6” 본 발명의 실시예에서 상기 데이터베이스는 도큐먼트 지향 데이터베이스로 Json(동적 스키마형 도큐먼트, 진동 데이터 등)에 적합하며 다수의 무선진동측정장비에서 데이터베이스로 채용 중인 NoSQL 기반의 mongoDB로 구현하 여 설계하였다. 상기 연계모듈은 감시대상 설비 및 적용된 센싱모듈에 대하여 상기 데이터베이스를 통해 검색된 데이 터에 기반한 데이터를 연계방식을 적용 및 처리하는 구성으로, 본 발명의 실시예에서는 세부구성인 직접연계부 와, API연계부와, OPC-UA연계부를 통한 3가지 연계방식을 설명한다.도 5는 본 발명의 실시예에 따른 직접 연계 Process 설명도로서, 상기 직접연계부는 센싱모듈에서 생 성되는 데이터를 설정된 주기로 통합감시모듈과 직접 연계한다. 즉 상용 무선진동측정장비에 활용 중인 DB와 동일한 DB（mongoDB)를 적용하는 방식으로 센싱모듈에서 직접 데이터를 추출하고 주기적으로 동기화하는 것으로 추출된 데이터에 표준화 처리 후 저장한다. 도 6은 본 발명의 실시예에 따른 API 연계 Process 설명도로서, 상기 API연계부는 센싱모듈의 운영프 로그램에서 API KEY를 이용하여 데이터 추출 후 sFTP를 이용하여 설정된 주기로 통합감시모듈로 전송한다. 즉 API KEY를 이용하여 센싱모듈의 운영프로그램에서 데이터 추출하며 이때 추출 데이터 형식은 Json 형식 으로 하였다. 추출된 데이터는 sFTP를 이용하여 주기적으로 전송하고 지정폴더로 전송된 데이터를 통합 데이터 베이스로 입력하며, 추출된 데이터의 표준화 처리 후 저장이 이루어진다. 도 7은 본 발명의 실시예에 따른 OPC UA 연계 Process 설명도로서, 상기 OPC-UA연계부는 센싱모듈의 데이터를 OPC Server로 추출하여 프로토콜에 따른 OPC UA 데이터 변환을 통해 통합감시모듈로 전송한다. OPC UA(Open Platform Communications Unified Architecture)는 스마트팩토리 분야의 표준으로 사용되는 통신 프로토콜 표준으로, OPC Server 로 데이터 추출시 추출 데이터 형식은 Json 형식으로, GE 프로토콜에 따른 OPC UA 데이터 변환 프로그램을 적용하였다. 상기 통합감시모듈은 센싱모듈의 정보, 센싱값 및 이의 분석결과, 설비감시, 진단결과 등을 출력하며 설비상태를 통합적으로 모니터링하는 구성으로, 세부구성으로 변환부와 진단부를 구비한다. 상기 변환부는 설비의 감시를 위해 적용된 센싱모듈로부터 수집되는 신호값을 주파수 분석을 위해 변 환하는 구성으로, 적용된 센싱모듈의 특징을 고려하여 앞서 언급한 직접연계/API연계/OPC-UA연계를 고려하 여 데이터를 추출 후 데이터 표준화를 반영하여 데이터를 변환한다. 본 발명에서 상기 변환부에는 시간 파형의 진동 raw data에 FFT 처리하여 주파수 영역으로 변환하는 FFT SPECTRUM 변환 알고리즘이 적용되며, 에일리어싱 에러 및 노이즈 제거를 위해 주어진 표본화율(속도)로 얻은 데 이터에서 가용한 최대 사용 가능 주파수 이하로 필터 처리, fft 처리를 위해 일정한 간격을 가지는 별개의 값들 (distinct values)에 대한 함수 값을 획득하는 sampling, 가중된(weighted) 데이터 점들을 처리하는 동안 오차 를 감소시키기 위해 사용된 절단된 함수(truncated function) 상태 감시를 위해 HANNING 창 적용, 상태감시에서 신호의 정확성을 향상하고 데이터의 측정 시간을 감소하기 위한 평균화, 시간 영역에서 물리 단위 U를 갖는 연 속의 데이터 표본 x(n)는 푸리에 변환을 통해 주파수 영역 변환하는 과정을 수행한다. 상기 진단부는 상기 변환부를 통해 변환된 신호값을 분석하여 결함을 진단하는 구성으로 결합판단을 위한 기준값을 설정하여 이와 신호값을 비교분석하는 방식으로 결함발생 및 결함유형을 진단하며, 머신러닝을 통해 사전연구를 통해 확보된 초기결함 사전진단 알고리즘을 보완하여 결함의 종류(원인)를 자동으로 진단할 수 있도 록 할 수 있다. 이를 위해 구비되는 상기 학습모듈은 상기 변환부를 통해 변환된 신호값을 학습하되 결함이 진단된 신호값을 추출하여 학습데이터를 생성하는 학습부와, 상기 학습데이터를 통해 결함별로 신호값을 분류하여 상기 진단부에 적용하는 반영부를 구비한다. 자동진단을 위한 특징추출에 진동신호의 정보(진폭, 결함, 위상)를 포함하는 Raw data (Time Waveform)을 활용 하며, 자동진단의 정확성 및 신뢰성 향상을 위해 filtering 처리하여 외부 요인으로 발생하는 noise 제거와, 특 징추출을 위해 Raw data (Time Waveform)을 re-sampling, sampling된 데이터를 정규화 처리하는 전처리가 이루 어지게 된다. 본 발명의 실시예에서는 신호의 통계적, 형태적 특성을 나타내는 [표 4]의 시간 영역(19종), [표 5]의 주파수영 역(7종), [표 6]의 엔트로피(4종)의 특징 계산 및 추출하여 학습 및 진단에 활용하였다. 표 4 Feature Description Frequency Center FFT Spectrum에서 밀도의 중심을 나타낸 지표 Mean square frequency신호의 실효치를 나타낸 값으로 신호의 평균적인 크기 값 RMS of frequency FFT Spectrum에서 각 성분의 RMS 값의 밀도 중심을 나타낸 지표 Variance frequency FFT Spectrum에서 밀도 중심으로부터 모멘트 값Root variance frequencyFFT Spectrum에서 밀도 중심으로부터 각 성분의 RMS 값을 모멘트로 표현한 지표 Spectrum overall FFT Spectrum에서 각 성분의 진폭을 합산한 값 Spectrum rms overallFFT Spectrum에서 각 성분의 실효치를 합산한 값 표 5 Feature Description Peak value 신호의 진폭 값을 나타내는 지표로 신호의 크기를 나타낸 값 Root Mean Square(RMS)신호의 실효치를 나타낸 값으로 신호의 평균적인 크기 값 Kurtosis 통계에서 확률분포 모양의 뾰족한 정도를 나타내는 지표로 신호값들의 분포 가 특정한 값 근처에 몰려 있을수록 증가 Crest factor 신호의 평균적인 크기에 비해 최소/최대 값의 차이 Clearance factor Crest factor와 같이 신호의 평균적인 크기에 비해 최소/최대 값의 차이를 나타내며 평균적인 크기를 RMS 대신 Square Mean Root 값으로 나타냄 Impulse factor 신호에서 가장 큰 임펄스(신호가 뾰족하게 솟아오르는 부분)의 크기에 관한 지표 Shape factor 전자공학에서 DC성분과 AC성분의 비율을 나타내는 지표로 신호의 평균 대비 음과 양을 오가는 연속파형의 크기 비율 Skewness 통계에서 skewness는 확률분포의 비대칭성을 나타내는 지표로 신호의 편중 성(신호의 평균을 기준으로 신호값들의 분포가 한쪽으로 몰리는 정도)이 증 가할수록 skewness 또한 증가 Square Mean Root(SMR)RMS와 동일하게 연속되는 파형의 음과 양을 오가는 정도 또는 그 크기를 의 미하여 RMS보다 신호의 크기에 더 민감 5th normalized moment통계에서 사용하는 5차 모멘트 값 6th normalized moment통계에서 사용하는 6차 모멘트 값 Mean 신호 크기에 대한 평균 Shape factor2 Shape factor와 같이 DC성분과 AC성분의 비율을 나타내는 지표, RMS 값 대 신 신호의 크기에 민감한 SMR 값을 사용 Peak to peak 신호의 최대 값과 최소 값의 차이를 나타낸 값 Kurtosis factor Kurtosis의 변형된 값으로 신호 전체의 크기에 민감한 단점을 보완한 값 Standard deviation신호의 표준편차 값 Smoothness 신호의 매끄러운 정도를 나타낸 값 Uniformity 신호의 균일성을 나타내는 지표 Normal negative log-likelihood통계에서 사용하는 최대우도 추정을 위해 사용하는 값을 나타내는 지표 표 6 Feature Description histogram_upper_band 특징 histogram의 상위값 histogram_lower_band 특징 histogram의 하위값 entropy_estimation_value 엔트로피의 근사값 entropy_estimation_error_value엔트로피 에러의 근사값 또한, 본 발명의 실시예에서는 대상설비의 특징 분석 및 상태별 분류를 위해 차원을 축소하는 주성분 분석법 (Principal Component Analysis), 특징 조합의 변별성을 평가하고 변별성이 높은 특징 조합을 분석하여 유사 특 징 조합을 생성하고 이를 반복함으로써 가장 변별성이 높은 특징 조합을 추출하는 유전자 알고리즘(GA) 최적 특 징 선택 기법, 고차원 또는 무한 차원의 공간에서 초평면(Hyper plane)을 찾아 이를 이용하여 분류 수행, 하나 의 데이터 포인트와 판별 경계까지의 거리를 나타내는 마진(Margine)을 최대로 가지는 선형판별에 기초하며, 속 성들 간의 의존성은 고려하지 않는 방법인 Support Vector Machine(SVM) 설비상태 분류 기법, 새로운 데이터를 기존의 데이터를 바탕으로 근접한 k개의 데이터를 이용하여 분류 수행, 데이터와의 거리 척도를 학습하여 가장 가까운 k개의 데이터를 찾아 빈도수가 가장 높은 클래스로 분류하는 결함진단 기법을 적용하였다. 상기 진단부의 진단 알고리즘의 진단 성능향상을 위해 학습용 결함별 진동 데이터가 필요하며 설비의 결함 데이터 확보가 곤란할 경우, 전문장비를 활용하여 데이터를 확보가 가능하다.[표 7]은 본 발명의 실시예에 따른 학습 데이터 종류로 회전설비의 주요 결함 4종을 정리하였다. 표 7 결함종류 결함 원인 파라미터 특성 Unbalance 회전체의 축 중심과 무게 중심이 어긋남으로써 편심이 발생, 이로 인해 원심력이 발생-반경방향의 1x(운전)성분이 지배 적, 위상각 변화 없음 - 회전속도에 비례하여 진동 증가 (원심력 작용) Bearing Fault 부적절한 윤활관리, 설치불량, 과 도한 하중, 정상적인 마모 및 요 소의 흠집/파손 등의 원인으로 발 생- 베어링 파손 부위에 의한 특징 적인 주파수 성분이 발생 Misalignment 두 축의 중심이 일직선상에 유지 되지 않아 발생- 회전주파수 성분 이외의 2x(3x, 4x)성분 발생 - 과도한 경우에 2x성분이 지배적 이며, 양쪽 베어링에서 180°위상 차 나타남 Looseness 부적절한 조립으로 인한 과도한 틈새, 낡은 부위의 손상 등으로 발생하며, 베어링의 헐거움, 과도 한 공차 등의 원인으로 발생- 반경방향으로 회전당 1회의 충 격 발생(1x 및 배수성분 발생) - 과도한 경우에 분수조화성분 발 생(1/2, 1/3, 1/4x) 이때 전문 시뮬레이터를 이용하여 결함데이터 확보가 가능하며, 본 발명의 실시예에서는 시뮬레이터를 활용하여 회전설비의 결함(4종) 모사하고, 이를 이용하여 결함데이터를 확보하였다. 상기 메타버스모듈은 앞서 설명한 모니터링 결과를 디지털 트윈 3D 모델에 연계 처리하여 시각화를 통해 제공하는 구성으로, 감시대상 설비에 대응하여 생성된 디지털 객체를 통해 디지털 트윈 3D모델을 생성하여 관리 하는 가상엔진부와, 상기 통합감시모듈과 연계하여 분석된 신호값 및 진단결과를 상기 3D모델에 반영하는 동기화부를 구비한다. 상기 가상엔진부는 물리모델로서 경계조건이 설정된 상태로 감시대상 설비에 대한 디지털 트윈 3D모델을 생성하여 메타버스공간을 형성하며, 예를 들어 회전설비로서 펌프 베어링 또는 이들을 구성하는 감시 대상 설비 에 대응하는 적어도 하나의 디지털 트윈 3D 모델을 생성하여 관리하되, 감시 대상 설비들에 관한 감시/운전 데 이터들 각각에 대응하는 적어도 하나의 시각화 콘텐츠를 저장 관리하게 된다. 상기 동기화부는 디지털 트윈 3D 모델과 적어도 하나의 시각화 콘텐츠에 전달받은 진단결과 정보 데이터들 과 감시 대상 설비들에 관한 감시/운전 데이터들을 연계 처리시키는 매핑을 수행하며, 예를 들어 펌프 베어링의 3D 모델 기반 운전 및 결함 조기 진단 정보를 시각화 처리하여 제공하고, 펌프 베어링 시스템의 3D 모델 기반 시뮬레이션 정보와, 3D 모델 기반 조작 및 제어를 통한 펌프 베어링 구조를 시각화 처리하여 제공하여 해당 설 비의 결함 상태를 확인 가능하도록 한다. 본 발명의 권리는 위에서 설명된 실시예에 한정되지 않고 청구범위에 기재된 바에 의해 정의되며, 본 발명의 분 야에서 통상의 지식을 가진 자가 청구범위에 기재된 권리범위 내에서 다양한 변형과 개작을 할 수 있다는 것은 자명하다."}
{"patent_id": "10-2022-0138594", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 개념도, 도 2는 본 발명의 구성 및 연결 관계를 나타낸 블록도, 도 3은 본 발명의 실시예에 따른 무선진동측정장치 SW 분석화면, 도 4는 본 발명의 실시예에 따른 플랜트 감시체계 분석화면, 도 5는 본 발명의 실시예에 따른 직접 연계 Process 설명도, 도 6은 본 발명의 실시예에 따른 API 연계 Process 설명도, 도 7은 본 발명의 실시예에 따른 OPC UA 연계 Process 설명도이다."}
