{"patent_id": "10-2019-0059561", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0118743", "출원번호": "10-2019-0059561", "발명의 명칭": "인공지능을 이용한 스마트공장 고장예지진단 장치 및 그것을 이용한 고장예지진단 방법", "출원인": "재단법인 경북아이티융합 산업기술원", "발명자": "천승만"}}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능을 이용한 스마트공장 고장예지진단 장치에 있어서,스마트공장 내부에 설치된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센싱된 정보를 실시간으로 수신하는 데이터 수신부,상기 수신된 센싱 정보를 머신러닝 알고리즘에 적용하여 오르빗 패턴(Orbit Pattern)을 생성하고, 생성된 오르빗 패턴을 이용하여 현재의 로봇 또는 설비의 이상 유무를 판단하는 제어부,상기 수신된 센싱 정보와 상기 로봇 또는 설비의 이상 유무 정보를 저장하는 데이터 저장부, 그리고상기 로봇 또는 설비의 이상 유무를 사용자에게 제공하는 디스플레이부를 포함하는 고장예지진단 장치."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서상기 데이터 처리부는,seq2seq 알고리즘을 이용하여 상기 센서로부터 측정되는 3 방향(Horizontal, Vertical, Axial)의 진동데이터를오르빗 패턴으로 변환시켜 머신러닝 알고리즘을 학습시키는 고장예지진단 장치."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는, 상기 오르빗 패턴이 원형으로 생성되면 상기 로봇 또는 설비에 이상이 존재하지 않는 것으로 판단하는 고장예지진단 장치."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제어부는, 상기 오르빗 패턴이 타원형, 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나의 형태로 생성되면, 상기로봇 또는 설비에 이상이 존재하는 것으로 판단하는 고장예지진단 장치."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는, 상기 오르빗 패턴이 상기 타원형으로 생성되면, 상기 로봇 또는 설비의 균형이 맞지 않은 것으로 판단하고, 상기 오르빗 패턴이 상기 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나의 형태로 생성되면 상기 로봇또는 설비의 축이 어긋난 것으로 판단하는 고장예지진단 장치."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "고장예지진단 장치를 이용한 고장예지진단 방법에 있어서,스마트공장 내부에 설치된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센싱된 정보를 실시간으로 수신하는 단계,공개특허 10-2020-0118743-3-상기 수신된 센싱 정보를 머신러닝 알고리즘에 적용하여 오르빗 패턴(Orbit Pattern)을 생성하고, 생성된 오르빗 패턴을 이용하여 현재의 로봇 또는 설비의 이상 유무를 판단하는 단계,상기 수신된 센싱 정보와 상기 로봇 또는 설비의 이상 유무를 저장하는 단계, 그리고상기 로봇 또는 설비의 이상유무 정보를 사용자에게 제공하는 단계를 포함하는 고장예지진단 방법."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서상기 로봇 또는 설비의 이상 유무를 판단하는 단계는,seq2seq 알고리즘을 이용하여 상기 센서로부터 측정되는 3 방향(Horizontal, Vertical, Axial)의 진동데이터를오르빗 패턴으로 변환시켜 머신러닝 알고리즘을 학습시키는 고장예지진단 방법."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서상기 로봇 또는 설비의 이상 유무를 판단하는 단계는,상기 오르빗 패턴이 원형으로 생성되면 상기 로봇 또는 설비에 이상이 존재하지 않는 것으로 판단하는 고장예지진단 방법."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 로봇 또는 설비의 이상 유무를 판단하는 단계는,상기 오르빗 패턴이 타원형, 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나의 형태로 생성되면, 상기로봇 또는 설비에 이상이 존재하는 것으로 판단하는 고장예지진단 방법."}
{"patent_id": "10-2019-0059561", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 로봇 또는 설비의 이상 유무를 판단하는 단계는,상기 오르빗 패턴이 상기 타원형으로 생성되면, 상기 로봇 또는 설비의 균형이 맞지 않은 것으로 판단하고, 상기 오르빗 패턴이 상기 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나의 형태로 생성되면 상기 로봇또는 설비의 축이 어긋난 것으로 판단하는 고장예지진단 방법."}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 스마트공장 고장예지진단 장치 및 그것을 이용한 고장예지 방법에 관한 것이다. 본 발명에 따르면, 인공지능을 이용한 스마트공장 고장예지진단 장치에 있어서, 스마트공장 내부에 설치된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센싱된 정보를 실시간으로 수신하는 데이터 수신부, 상기 수신된 (뒷면에 계속)"}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능을 이용한 스마트공장 고장예지진단 장치 및 그것을 이용한 고장예지진단 방법에 관한 것으 로, 인공지능을 이용하여 실시간으로 로봇 또는 설비의 이상유무를 진단하는 인공지능을 이용한 스마트공장 고 장예지진단 장치 및 그것을 이용한 고장예지진단 방법에 관한 것이다."}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "IT(Information Technology) 기술의 발전으로 IT 기술을 접목한 U-City나 Eco-City 등 미래형 도시가 건설되고 있고, 이러한 미래형 도시 건설이 계속해서 추진되면서 도시 시설물, 교통, 환경 등 도시 전반에 센서들을 설치 하고, 이러한 센서들을 통해 도시 내에 발생되는 여러 가지 상황들을 모니터링하고 상황에 대처하기 위해 관제 장치를 구축하고 있다. 또한, 선박, 차량, 건설기계, 핸드폰 등은 다양한 부품들이 조립됨으로써 제조되며, 구성하는 부품에 대한 용접 공정, 이송공정, 도장공정 등의 제조공정을 거쳐 대상물을 제조하는 공정이 이루어지며, 산업용 로봇은 복수개 가 공정라인에 설치되어 제조공정을 수행할 수 있다. 이러한 산업용 로봇은 설비집약형 LCD 제조공정이나 고밀도화된 자동차 제조공정 등 다양한 제조공정에서 핵심 장비로 사용되어 최근에는 산업용 로봇의 고장에 대한 진단 장치가 절실히 요구되고 있다. 또한, 산업용 로봇의 고장 진단 장치는 전류 신호를 이용하여 이상을 진단하므로, 하나의 부품으로부터 이상 전 류 신호가 감지되면 이에 연계된 수많은 부품에서 이상 전류 신호가 발생되며, 종래 기술에 따른 산업용 로봇의 고장 진단 장치는 최초 이상 전류 신호가 발생된 부품을 판별하기 위하여 별 도의 기술이 필요할 뿐만 아니라 고장 진단에 오랜 시간이 걸리고, 비용이 증대되는 문제가 있다. 본 발명의 배경이 되는 기술은 대한민국 공개특허 제10-2018-0033844호(2018.04.04.)에 개시되어 있다."}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 이루고자 하는 기술적 과제는 인공지능을 이용하여 실시간으로 로봇 또는 설비의 이상유무를 진단하 는 인공지능을 이용한 스마트공장 고장예지진단 장치 및 그것을 이용한 고장예지진단 방법에 관한 것이다."}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 기술적 과제를 이루기 위한 본 발명의 실시예에 따르면, 인공지능을 이용한 스마트공장 고장예지진단 장 치에 있어서, 스마트공장 내부에 설치된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센싱된 정보를 실 시간으로 수신하는 데이터 수신부, 상기 수신된 센싱 정보를 머신러닝 알고리즘에 적용하여 오르빗 패턴(Orbit Pattern)을 생성하고, 생성된 오르빗 패턴을 이용하여 현재의 로봇 또는 설비의 이상 유무를 판단하는 제어부, 상기 수신된 센싱 정보와 상기 로봇 또는 설비의 이상 유무 정보를 저장하는 데이터 저장부, 그리고 상기 로봇 또는 설비의 이상 유무를 사용자에게 제공하는 디스플레이부를 포함한다. 상기 데이터 처리부는, seq2seq 알고리즘을 이용하여 상기 센서로부터 측정되는 3 방향(Horizontal, Vertical, Axial)의 진동데이터를 오르빗 패턴으로 변환시켜 머신러닝 알고리즘을 학습시킬 수 있다. 상기 제어부는, 상기 오르빗 패턴이 원형으로 생성되면 상기 로봇 또는 설비에 이상이 존재하지 않는 것으로 판 단할 수 있다. 상기 제어부는, 상기 오르빗 패턴이 타원형, 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나의 형태로 생성되면, 상기 로봇 또는 설비에 이상이 존재하는 것으로 판단할 수 있다. 상기 제어부는, 상기 오르빗 패턴이 상기 타원형으로 생성되면, 상기 로봇 또는 설비의 균형이 맞지 않은 것으 로 판단하고, 상기 오르빗 패턴이 상기 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나의 형태로 생성 되면 상기 로봇 또는 설비의 축이 어긋난 것으로 판단할 수 있다. 본 발명의 다른 실시예에는, 고장예지진단 장치를 이용한 고장예지진단 방법에 있어서, 스마트공장 내부에 설치 된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센싱된 정보를 실시간으로 수신하는 단계, 상기 수신된 센싱 정보를 머신러닝 알고리즘에 적용하여 오르빗 패턴(Orbit Pattern)을 생성하고, 생성된 오르빗 패턴을 이 용하여 현재의 로봇 또는 설비의 이상 유무를 판단하는 단계, 상기 수신된 센싱 정보와 상기 로봇 또는 설비의 이상 유무를 저장하는 단계, 그리고 상기 로봇 또는 설비의 이상유무 정보를 사용자에게 제공하는 단계를 포함 한다."}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이 본 발명에 따르면, 로봇 또는 설비의 고장예지진단을 실시간으로 수행하면서, 사용자 및 관리자에게 신속히 로봇 또는 설비의 상태를 제공하여 고장을 예지하여 안정적으로 로봇 또는 설비의 수리를 가능하게 할 수 있다. 또한, 인공지능을 이용하여 로봇 또는 설비의 고장유무를 측정하기 때문에 로봇 또는 설비의 고장 유무를 사전 에 파악하여 정비 및 수리비를 절감시키고, 계획적인 정비가 가능할 수 있도록 한다."}
{"patent_id": "10-2019-0059561", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시 예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 그러면 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 먼저, 도 1 및 도 2를 이용하여 로봇 또는 설비의 고장예지진단 장치의 구성을 설명한다. 도 1은 본 발명의 실시예에 따른 고장예지진단 장치의 구성을 나타낸 구성도이고, 도 2는 본 발명의 실시예에 따른 로봇 또는 설비에 부착되는 센서의 위치를 설명하기 위한 도면이다. 도 1에서 나타낸 것처럼, 로봇 또는 설비의 고장예지진단 장치는 데이터 수신부, 제어부, 데이 터 저장부 및 디스플레이부를 포함한다. 먼저, 데이터 수신부는 스마트공장 내부에 설치된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센 싱된 정보를 실시간으로 수신한다. 여기서, 스마트 공장은 사이버 물리 장치(CPS: Cyber Physical Systems)을 이용하여 실제와 동일한 제품 설계 및 개발을 모의 실험하여 자산을 최적화하고, 공장 내의 설비와 기기 간에 사물 인터넷(IoT)를 설치하여 실시간 정보를 교환하게 하여 생산성을 증가시키고 돌발 사고를 최소화하기 위한 공장을 의미한다. 그리고, 도 2에서 나타낸 것처럼, 센서는 로봇 또는 설비 각각의 축에 부착되어 실시간으로 센싱정보를 송신한 다. 이때, 로봇 또는 설비 각각의 축에 설치된 센서는 진동센서, 가속도 센서 및 열감지 센서 중에서 어느 하나를 포함한다. 그리고, 데이터 수신부는 유, 무선 네트워크를 이용하여 센싱정보를 실시간으로 획득한다. 여기서, 유, 무선 네트워크는 3G, 4G, 5G, LTE, WiFi, Bluetooth 및 Zigbee 중에서 어느 하나를 포함한다. 다음으로, 제어부는 수신된 센싱 정보를 머신러닝 알고리즘에 적용하여 오르빗 패턴(Orbit Pattern)을 생 성하고, 생성된 오르빗 패턴을 이용하여 현재의 로봇 또는 설비의 이상 유무를 판단한다. 여기서, 제어부는 seq2seq 알고리즘을 이용하여 오르빗 패턴을 생성한다. 이때, seq2seq 알고리즘은 딥 러닝 모델 중 하나로서, 본 발명의 실시예에 따르면, 센서의 데이터를 수신하여 오르빗 패턴을 제작하는 역할을 수행한다. 또한, 오르빗 패턴은 로봇 또는 설비에 이상이 존재하지 않으면, 원형으로 표현되고, 로봇 또는 설비에 이상이 존재하면, 타원형, 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나로 표현된다. 여기서, 오르빗 패턴은 수집되는 데이터를 주파수로 변환하여 생성되는 패턴으로, 본 발명의 실시예에서는 로봇 또는 설비에 부착된 센서로부터 측정되는 데이터의 주파수를 이용하여 오르빗 패턴을 제작한다. 즉, 오르빗 패턴은 로봇 또는 설비에 부착된 센서로부터 측정된 주파수의 형태에 따라 원형, 타원형, 팔자형태, 심장형태 및 토네이도 형태와 같이 표현될 수 있다.이때, 제어부는 오르빗 패턴은 타원형으로 생성되면, 로봇 또는 설비의 균형이 맞지 않은 것으로 판단하고, 오르빗 패턴은 팔자형태, 심장형태 및 토네이도 형태 중에서 어느 하나로 생성되면, 로봇 또는 설비 의 축이 어긋난 것으로 판단한다. 그리고, 데이터 저장부는 데이터 수신부로부터 수신된 센싱 정보와 제어부로부터 판단된 로봇 또는 설비의 이상 유무에 대한 정보를 저장한다. 이때, 데이터 저장부는 mysql, elasticsearch 및 dynamodb 중에서 어느 하나를 이용하여 센싱 정보와 로 봇 또는 설비의 이상유무에 대한 정보를 저장한다. 여기서, mysql, elasticsearch 및 dynamodb는 데이터를 저장하기 위한 알고리즘으로, 본 발명의 실시예에서는 센싱 정보와 로봇 또는 설비의 이상유무 정보를 저장하기 위해 사용된다. 그러면, 디스플레이부는 로봇 또는 설비의 이상유무 정보를 사용자 또는 관리자에게 제공한다. 이하에서는 도 3 내지 도 5를 이용하여 본 발명의 실시예에 따른 고장예지진단 장치를 이용한 고장진단예지 방 법을 설명한다. 도 3은 본 발명의 실시예에 따른 로봇 또는 설비의 고장예지진단 장치를 이용한 고장진단예지 방법을 나타낸 순 서도이다. 도 3에서 나타낸 것처럼, 본 발명의 실시예에 따른 로봇 또는 설비의 고장예지진단 장치는 스마트공장 내 부에 설치된 로봇 또는 설비 각각의 축에 부착된 센서를 이용하여 센싱된 정보를 실시간으로 수신한다(S310). 여기서, 데이터 수신부는 유, 무선 네트워크를 이용하여 센싱된 정보를 실시간으로 수신한다. 그러면, 제어부는 수신된 센싱 정보를 머신러닝 알고리즘에 적용하여 오르빗 패턴(Orbit Pattern)을 생성 하고, 생성된 오르빗 패턴을 이용하여 현재의 로봇 또는 설비의 이상 유무를 판단한다(S320). 도 4는 본 발명의 실시예에 따른 S320 단계를 설명하기 위한 도면이며, 도 5는 본 발명의 실시예에 따른 오르빗 패턴에 따른 로봇 또는 설비의 고장유무를 나타낸 도면이다. 도 4에서 나타낸 것처럼, 제어부는 수신한 센싱 데이터를 seq2seq 알고리즘을 이용하여 오르빗 패턴을 생 성한다. 도 4에서 나타낸 것처럼, 제어부는 로봇 또는 설비에 설치된 센서로부터 측정된 데이터의 주파수를 이용하 여 오르빗 패턴을 생성한다. 여기서, x 및 y축의 값은 시간에 따른 주파수의 세기를 나타내며, 로봇 또는 설비에 설치된 센서의 측정값에 따 라 변경될 수 있다. 즉, 오르빗 패턴은 센서로부터 측정된 데이터에 따라 변경된다. 그러면, 도 5에서 나타낸 것처럼 제어부는 생성된 오르빗 패턴에 따라 로봇 또는 설비의 이상 유무를 판단 한다. 즉, 도 5에서 나타낸 것처럼 오르빗 패턴(Orbit Shape)이 원형(Circle)으로 생성되면 제어부는 로봇 또는 설비에 이상이 없는 상태(Normal)로 판단한다. 또한, 도 5에서 나타낸 것처럼, 오르빗 패턴(Orbit Shape)이 타원형(Ellipse), 팔자형태(Eight), 심장형태 (Heart) 및 토네이도(Tornado) 형태 중에서 어느 하나로 생성되면, 제어부는 로봇 또는 설비에 이상이 있 는 것으로 판단한다. 여기서, 오르빗 패턴(Orbit Shape)이 타원형(Ellipse)으로 생성되면, 제어부는 로봇 또는 설비의 균형이 맞지 않은 상태(Unbalance)로 판단한다. 그리고, 오르빗 패턴은 팔자형태(Eight), 심장형태(Heart) 및 토네이도(Tornado)형태 중에서 어느 하나로 생성 되면, 제어부는 로봇 또는 설비의 축이 어긋난 상태(Shaft misalignment)로 판단한다. 예를 들어, 로봇 또는 설비의 축이 어긋난 경우, 오르빗 패턴은 도 5에서 나타낸 것처럼 팔자 형태로 생성된다. 또한, 로봇 또는 설비의 균형이 맞지 않는 경우, 오르빗 패턴이 도 5에서 나타낸 것처럼 타원형으로 생성된다. 다음으로, 데이터 저장부는 수신된 센싱 정보와 로봇 또는 설비의 이상유무 정보를 저장한다(S330). 이때, 데이터 저장부는 실시간으로 센싱 정보와 로봇 또는 설비의 이상유무 정보를 저장하고, 저장된 데이 터를 디스플레이부에 제공한다. 그러면, 고장예지진단 장치는 디스플레이부를 이용하여 로봇 또는 설비의 이상 유무를 사용자에게 제 공한다(S340). 여기서, 사용자는 디스플레이부를 통하여 실시간으로 로봇 또는 설비의 이상유무를 확인할 수 있다. 이와 같이 본 발명의 실시예에 따르면, 로봇 또는 설비의 고장예지진단을 실시간으로 수행하면서, 사용자 및 관 리자에게 신속히 로봇 또는 설비의 상태를 제공하여 고장을 예지하여 안정적으로 로봇 또는 설비의 수리를 가능 하게 할 수 있다. 또한, 인공지능을 이용하여 로봇 또는 설비의 고장유무를 측정하기 때문에 로봇 또는 설비의 고장 유무를 사전 에 파악하여 정비 및 수리비를 절감시키고, 계획적인 정비가 가능할 수 있도록 한다. 본 발명은 도면에 도시된 실시 예를 참고로 설명되었으나 이는 예시적인 것이 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시 예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2019-0059561", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 로봇 또는 설비의 고장예지진단 장치의 구성을 나타낸 구성도이다. 도 2는 본 발명의 실시예에 따른 로봇 또는 설비에 부착되는 센서의 위치를 설명하기 위한 도면이다. 도 3은 본 발명의 실시예에 따른 로봇 또는 설비의 고장예지진단 장치를 이용한 고장진단예지 방법을 나타낸 순 서도이다. 도 4는 본 발명의 실시예에 따른 S320 단계를 설명하기 위한 도면이다. 도 5는 본 발명의 실시예에 따른 로봇 또는 설비의 고장유무에 대응하는 오르빗 패턴을 나타낸 도면이다."}
