{"patent_id": "10-2021-0025768", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0121961", "출원번호": "10-2021-0025768", "발명의 명칭": "CCTV 시스템 기반의 주차관리 방법, 및 장치", "출원인": "주식회사 포커스에이치엔에스", "발명자": "김대중"}}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "CCTV 시스템 기반의 주차관리 장치에 의해 수행되는 방법으로서,상기 CCTV 시스템의 관재 범위에 속하는 주차장에 설치된 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는 단계;촬영된 CCTV 영상 중에서 주차장 입구에서 촬영된 입차 CCTV 영상을 이용하여 차량을 인식하는 단계; 및인식된 차량의 종류에 기반하여, 상기 입차 CCTV 영상을 이용하여 상기 차량의 차량번호를 인식하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는 단계는,복수의 CCTV 카메라를 이용하여 주차장 입구 상황, 주차 구역 상황 및 주차장 출구 상황을 영상 촬영하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,차량의 주차장 입차 시부터 출차 시까지 이동 및 정지한 차량을 촬영한 영상으로서 입차 상황, 진입 상황, 진출상황 및 출차 상황이 촬영된 영상을 저장하는 단계를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 입차 영상을 이용하여 차량을 인식하는 단계는,객체 인식 알고리즘을 이용하여 차량의 종류 및 탑승 인원 수를 인식하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 차량의 차량번호를 인식하는 단계는,인식된 차량의 종류에 기반하여, 번호판의 가로/세로 비율, 행의 수, 배경 색 및 문자와 숫자의 배열 구조를 이용하여 번호판 및 상기 번호판 영역의 문자와 숫자를 인식하는 단계를 포함하도록 구성되는,공개특허 10-2022-0121961-2-CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 차량의 입차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 차량상황 정보를 추출하는 단계를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관비 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 차량상황 정보를 추출하는 단계는,상기 차량의 입차부터 주차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여 상기차량의 주차구역 정보를 추출하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 차량의 주차구역 정보를 추출하는 단계는,주차 중인 차량의 차량번호를 인식하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 차량의 주차구역 정보를 추출하는 단계는,차량번호가 인식된 차량을 추적하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항에 있어서,상기 차량상황 정보를 추출하는 단계는,상기 차량의 주차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 출차하려는 차량의 출차정보를 추출하는 단계를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2022-0121961-3-제 10 항에 있어서,상기 차량의 출차 정보를 추출하는 단계는,상기 CCTV 영상을 이용하여 추출된 차량의 움직임을 인식하는 단계; 및상기 CCTV 영상을 이용하여 주차에서 출차까지 상기 차량을 추적하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 차량을 추적하는 단계는,서로 다른 CCTV 영상 간에 인식된 차량번호에 기반하여 상기 차량을 추적하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 차량을 추적하는 단계는,서로 다른 CCTV 영상 간에 상기 차량의 영상에서 출현과 사라짐의 위치와 출현과 사라질 때의 시간, 및 출현과사라짐의 방향 중에서 적어도 하나에 기반하여 차량을 추적하는 단계를 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 6 항에 있어서,상기 차량상황 정보를 추출하는 단계는,상기 CCTV 영상을 이용하여 영상 별로 차량의 페이드인(fade-in) 및 페이드아웃(fade-out)에 관한 시간정보를포함하는 차량출현 정보를 추출하는 단계를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 차량이 출현한 CCTV 영상의 구간 간에 중복된 시간 구간이 포함되도록, 상기 차량출현 정보에 기반하여 상기 CCTV 영상의 구간이 심리스하게 이어지도록 재생하는 단계를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,상기 차량이 출현한 CCTV 영상의 구간 간에 중복된 시간 구간이 포함되지 않도록, 상기 차량출현 정보에 기반하여 상기 CCTV 영상의 구간이 심리스하게 이어지도록 재생하는 단계를 더 포함하도록 구성되는,공개특허 10-2022-0121961-4-CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 6 항에 있어서,차량속도 정보, 객체인식 정보, 및 상기 차량출현 정보를 포함하는 CCTV 영상으로 구성된 데이터셋의 학습을 통해 훈련된 인공지능 모델에 의한 분석에 기반하여 각종 비정상의 상황을 인식하고, 이를 알람을 통해 알리는 단계를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 방법."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "CCTV 시스템의 관재 범위에 속하는 주차장에 설치된 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는CCTV 카메라;촬영된 CCTV 영상 중에서 주차장 입구에서 촬영된 입차 CCTV 영상을 이용하여 차량을 인식하는 차량 인식부;상기 입차 CCTV 영상을 이용하여 상기 차량의 차량번호를 인식하는 차량번호 인식부; 및인식된 차량의 종류에 기반하여 차량번호를 인식하도록 상기 차량번호 인식부를 제어하는 제어부를 포함하도록구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 CCTV 카메라는,주차장 입구 상황, 주차 구역 상황 및 주차장 출구 상황을 영상 촬영하도록 설치되는 것을 특징으로 하는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 18 항에 있어서,차량의 주차장 입차 시부터 출차 시까지 이동 및 정지한 차량을 촬영한 영상으로서 입차 상황, 진입 상황, 진출상황 및 출차 상황이 촬영된 영상들을 저장하는 저장 장치를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 18 항에 있어서,상기 차량 인식부는,객체 인식 알고리즘을 이용하여 차량의 종류 및 크기를 인식하는 것을 특징으로 하는,CCTV 시스템 기반의 주차관리 장치.공개특허 10-2022-0121961-5-청구항 22 제 18 항에 있어서,상기 차량번호 인식부는,인식된 차량의 종류에 기반하여, 번호판의 가로/세로 비율, 행의 수, 배경 색 및 문자 배열 구조를 이용하여 번호판 및 상기 번호판 영역의 문자를 인식하는 것을 특징으로 하는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 18 항에 있어서,상기 차량의 입차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 차량상황 정보를 추출하는 차량상황 정보 추출부를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관비 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 23 항에 있어서,상기 차량의 입차부터 주차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여 상기차량의 주차구역 정보를 추출하는 주차 구역 인식부를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서,상기 주차 구역 인식부는,주차 중인 차량의 차량번호를 인식하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 24 항에 있어서,차량번호가 인식된 차량을 추적하도록 구성되는 차량 추적부를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 23 항에 있어서,상기 차량 추적부는,상기 차량의 주차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 출차하려는 차량의 출차 정보를 추출하도록 구성되는,공개특허 10-2022-0121961-6-CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 27 항에 있어서,상기 차량 추적부는,상기 CCTV 영상을 이용하여 주차된 상기 차량의 움직임을 인식하고, 주차에서 출차까지 상기 차량을 추적하도록구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 28 항에 있어서,상기 차량 추적부는,상기 차량의 차량번호를 인식하고, 인식된 차량번호에 기반하여 차량을 추적하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제 28 항에 있어서,상기 차량 추적부는,서로 다른 영상 간에 상기 차량이 해당 영상에서 출현과 사라짐의 위치와, 출현과 사라질 때의 시각, 및 출현과사라짐의 방향 중에서 적어도 하나에 기반하여 차량을 추적하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제 23 항에 있어서,상기 차량상황 정보 추출부는,상기 CCTV 영상을 이용하여 영상 별로 차량의 페이드인(fade-in) 및 페이드아웃(fade-out)에 관한 시간 정보를포함하는 차량출현 정보를 추출하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제 31 항에 있어서,상기 차량출현 정보를 이용하여 상기 차량의 입차, 진입, 진출 및 출차 상황이 중복구간 없이 심리스하게 이어지도록 영상들을 재생하는 재생부를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "공개특허 10-2022-0121961-7-제 31 항에 있어서,상기 재생부는,상기 차량출현 정보를 이용하여 상기 차량의 입차, 진입, 진출 및 출차 상황이 중복구간이 포함되고 심리스하게이어지도록 영상들을 재생하도록 구성되는,CCTV 시스템 기반의 주차관리 장치."}
{"patent_id": "10-2021-0025768", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제 23 항에 있어서,차량속도 정보, 객체인식 정보, 및 상기 차량출현 정보를 포함하는 CCTV 영상으로 구성된 데이터셋의 학습을 통해 훈련된 인공지능 모델에 의한 분석에 기반하여 각종 비정상의 상황을 인식하고, 이를 알람을 통해 알리는 알람부를 더 포함하도록 구성되는,CCTV 시스템 기반의 주차관리 장치.."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, CCTV 시스템 기반의 주차관리 방법 및 장치를 개시한다. CCTV 시스템 기반의 주차관리 방법은, CCTV 시스템의 관재 범위에 속하는 주차장에 설치된 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는 단계; 촬 영된 영상들 중에서 주차장 입구에서 촬영된 입차 영상을 이용하여 차량을 인식하는 단계; 및 입차 영상을 이용 하여 인식된 차량의 차량번호를 인식하는 단계를 포함하도록 구성될 수 있다. 본 발명에 따르면, CCTV 시스템을 이용하여 추출된 차량의 상황정보를 이용하여 차량 검색을 통해 대상 차량의 입차, 진입, 주차, 진출 및 출차 상 황을 촬영한 영상의 심리스한 재생이 가능하다."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 CCTV 시스템 기반의 주차관리 방법 및 장치에 관한 것으로, 더욱 상세하게는 CCTV 시스템과 통합된, 카메라 기반으로 차량 정보를 수집하는 주차관리 방법과 이를 이용하는 주차관리 장치에 관한 것이다."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "CCTV는 폐쇄회로 텔레비전(Closed-circuit Television)의 약자이다. 폐쇄회로의 반대말은 개방회로 텔레비전 (Open-circuit Television)으로, 불특정 다수에 보여지는 가정의 TV를 뜻한다. 따라서 폐쇄회로 TV는 특정 목적 을 위해 특정인에게 제공되는 TV이다. 특정 목적 때문에 CCTV는 유무선으로 밖과 연결되지 않아서 폐쇄회로 TV 로 불린다. CCTV 시스템은, 구성요소로서 카메라 및 카메라가 촬영한 영상을 녹화하는 DVR(Digital Video Recorder)을 포함 할 수 있다. DVR은 영상을 녹화하는 장비로, CCTV를 구성하는 요소 가운데 가장 중요한 구성요소이다. 이 장비 의 성능에 따라 녹화 가능 영상의 화질이나 동시 녹화 가능한 카메라 수가 달라질 수 있다. CCTV는 주로 교통, 방범, 각종 감시, 및 화재예방 등 안전을 위해 설치된다. 최근에는 학교에서 발생하는 폭력 을 방지하기 위해 CCTV가 학교 내에 설치되기도 한다. 강력범죄가 늘어나면서 이를 방지하는 대안으로 나온 것 이 CCTV 설치의 확대이다. 또한, 사우나 또는 모델과 같은 개인 사업장에서도 도난을 방지하기 위해 CCTV의 설 치가 확대되고 있다. 한편 주차관리는, 주차자원의 효율적 이용을 초래하는 정책과 프로그램으로 정의될 수 있다. 아파트와 같은 공 공주택, 관공서, 대형 쇼핑센터, 복수의 사무실과 개인 사업장이 있는 빌딩에 포함된 주차장, 예를 들어 주차타 워, 지하 주차장 또는 야외 주차장의 경우 효율적인 주차관리를 위해 주차관리 시스템이 설치되어 있고, 자체적 으로 관리되거나 주차관리 전문의 용역회사를 통해 관리된다. 주차관리에 있어서 출입하는 차량의 번호판을 식별하기 위해서 카메라가 이용될 수 있다. 그리고 주차장에도 CCTV 카메라가 설치되어 있어서, 주차장 내의 상황을 감시할 수도 있다. 그런데 종래의 기술에 따르면 주차장에 주차관리를 위한 카메라와 CCTV 용도의 카메라가 따로 설치되어 있어서, 이를 관리하는 주차관리 시스템과 CCTV 시스템이 서로 독립적이어서 이를 운영하는데 비용이 이중으로 소비되는 것이 문제였다. 이러한 주차관리와 CCTV의 이중적 비용 발생 문제를 해결하기 위해, 국내 등록 특허 제10-2007162호의, 360도 전방위 CCTV 카메라 와 클라우딩 시스템을 활용한 통합 지능형 주차 관리 관제 시스템은, 주차 유도 장치, 번호판 인식 장치, LED 자동 조명 제어 장치 및 주차위치 파악 장치 등의 구성요소를 통해 관련 기술을 개시하고 있다. 그러나 상기 기 술은, 카메라의 종류 중에서 CCTV 카메라를 이용하는 것을 포함할 뿐이며, CCTV 시스템과 주차관리 시스템이 실 질적으로 하나로 통합된 것이 아니므로, CCTV 시스템을 기반으로 주차관리를 수행하는 본 발명과, 구성 및 효과면에서 구별된다. 또한, 국내 공개 특허 제10-2019-0134018호는 딥러닝 기반 영상 처리 기술이 탑재된 지능형 CCTV를 활용한 주차 관제 방법 빛 시스템에 관한 기술을 개시한다. 그러나 상기 기술은 CCTV 카메라를 이용하여 주차면에 대해 주차 가능 여부를 판단하는 것에 한정되어 있어서, CCTV 시스템의 전체를 이용하지 않고, 그 일부만 이용하는데 그치 고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록 특허 제10-2007162호 (2019.07.30. 등록) (특허문헌 0002) 한국 공개 특허 제10-2019-0134018호 (2019.12.04. 공개)"}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 바와 같은 종래의 문제점을 해결하기 위한 본 발명의 일 과제는, 주차관리 시스템과 주차장의 CCTV 시스 템에 중복하여 투자했던 종래 기술의 문제점을 해결하는 것이다. 본 발명이 해결하고자 하는 일 과제는, 주차관리에 있어서 CCTV 카메라를 이용할 뿐이고, 실질적으로 CCTV 시스 템 전체를 주차관리에 활용하지 못했던 종래 기술의 문제점을 해결하는 것이다. 본 발명이 해결하고자 하는 일 과제는, 감시 대상이 주로 사람이었던 종래의 CCTV 시스템과 비교하여, 사람과 자동차 및 이와 관련된 사고를 대상으로 CCTV 시스템을 이용하여 감시도 가능하고, 평소에는 주차관리도 가능한 통합형 시스템을 제공하는 것이다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 과 제 및 장점들은, 본 발명의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명의 과제 및 장점들은 특허 청구 범위에 나타난 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위해, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법은, CCTV 시스템 기반의 주차관리 장치에 의해 수행되는 방법으로서, CCTV 시스템의 관재 범위에 속하는 주차장에 설치된 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는 단계; 촬영된 CCTV 영상 중에서 주차장 입구에서 촬영된 입 차 CCTV 영상을 이용하여 차량을 인식하는 단계; 및 인식된 차량의 종류에 기반하여, 입차 CCTV 영상을 이용하 여 상기 차량의 차량번호를 인식하는 단계를 포함하도록 구성될 수 있다. 또한, CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는 단계는, 복수의 CCTV 카메라를 이용하여 주차장 입구 상황, 주차 구역 상황 및 주차장 출구 상황을 영상 촬영하는 단계를 포함하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 방법은, 차량의 주차장 입차 시부터 출차 시까지 이동 및 정지한 차량을 촬 영한 영상으로서 입차 상황, 진입 상황, 진출 상황 및 출차 상황이 촬영된 영상을 저장하는 단계를 더 포함하도 록 구성될 수 있다. 또한, 입차 영상을 이용하여 차량을 인식하는 단계는, 객체 인식 알고리즘을 이용하여 차량의 종류 및 탑승 인 원 수를 인식하는 단계를 포함하도록 구성될 수 있다. 또한, 차량의 차량번호를 인식하는 단계는, 인식된 차량의 종류에 기반하여, 번호판의 가로/세로 비율, 행의 수, 배경 색 및 문자와 숫자의 배열 구조를 이용하여 번호판 및 상기 번호판 영역의 문자와 숫자를 인식하는 단 계를 포함하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 방법은, 차량의 입차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어 도 하나의 CCTV 영상을 이용하여, 차량상황 정보를 추출하는 단계를 더 포함하도록 구성될 수 있다. 또한, 차량상황 정보를 추출하는 단계는, 차량의 입차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여 상기 차량의 주차구역 정보를 추출하는 단계를 포함하도록 구성될 수 있다. 또한, 차량의 주차구역 정보를 추출하는 단계는, 주차 중인 차량의 차량번호를 인식하는 단계를 포함하도록 구 성될 수 있다. 또한, 차량의 주차구역 정보를 추출하는 단계는, 차량번호가 인식된 차량을 추적하는 단계를 포함하도록 구성될 수 있다. 또한, 차량상황 정보를 추출하는 단계는, 차량의 주차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 출차하려는 차량의 출차정보를 추출하는 단계를 더 포함하도록 구성될 수 있다. 또한, 차량의 출차 정보를 추출하는 단계는, CCTV 영상을 이용하여 추출된 차량의 움직임을 인식하는 단계; 및 CCTV 영상을 이용하여 주차에서 출차까지 상기 차량을 추적하는 단계를 포함하도록 구성될 수 있다. 또한, 차량을 추적하는 단계는, 서로 다른 CCTV 영상 간에 인식된 차량번호에 기반하여 상기 차량을 추적하는 단계를 포함하도록 구성될 수 있다. 또한, 차량을 추적하는 단계는, 서로 다른 CCTV 영상 간에 상기 차량의 영상에서 출현과 사라짐의 위치와 출현 과 사라질 때의 시간, 및 출현과 사라짐의 방향 중에서 적어도 하나에 기반하여 차량을 추적하는 단계를 포함하 도록 구성될 수 있다. 또한, 차량 상황 정보를 추출하는 단계는, CCTV 영상을 이용하여 영상 별로 차량의 페이드인(fade-in) 및 페이 드아웃(fade-out)에 관한 시간정보를 포함하는 차량출현 정보를 추출하는 단계를 더 포함하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 방법은, 차량이 출현한 CCTV 영상의 구간 간에 중복된 시간 구간이 포함되 도록, 상기 차량출현 정보에 기반하여 상기 CCTV 영상의 구간이 심리스하게 이어지도록 재생하는 단계를 더 포 함하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 방법은, 차량이 출현한 CCTV 영상의 구간 간에 중복된 시간 구간이 포함되 지 않도록, 상기 차량출현 정보에 기반하여 상기 CCTV 영상의 구간이 심리스하게 이어지도록 재생하는 단계를 더 포함하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 방법은, 차량속도 정보, 객체인식 정보, 및 상기 차량출현 정보를 포함하는 CCTV 영상으로 구성된 데이터셋의 학습을 통해 훈련된 인공지능 모델에 의한 분석에 기반하여 각종 비정상의 상 황을 인식하고, 이를 알람을 통해 알리는 단계를 더 포함하도록 구성될 수 있다. 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는, CCTV 시스템의 관재 범위에 속하는 주차장 에 설치된 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하는 CCTV 카메라; 촬영된 CCTV 영상 중에서 주차 장 입구에서 촬영된 입차 CCTV 영상을 이용하여 차량을 인식하는 차량 인식부; 입차 CCTV 영상을 이용하여 상기 차량의 차량번호를 인식하는 차량번호 인식부; 및 인식된 차량의 종류에 기반하여 차량번호를 인식하도록 상기 차량번호 인식부를 제어하는 제어부를 포함하도록 구성될 수 있다. 또한, CCTV 카메라는, 주차장 입구 상황, 주차 구역 상황 및 주차장 출구 상황을 영상 촬영하도록 설치되는 것 을 특징으로 한다. 또한, CCTV 시스템 기반의 주차관리 장치는, 차량의 주차장 입차 시부터 출차 시까지 이동 및 정지한 차량을 촬 영한 영상으로서 입차 상황, 진입 상황, 진출 상황 및 출차 상황이 촬영된 영상들을 저장하는 저장 장치를 더 포함하도록 구성될 수 있다. 또한, 차량 인식부는, 객체 인식 알고리즘을 이용하여 차량의 종류 및 크기를 인식하는 것을 특징으로 한다. 또한, 상기 차량번호 인식부는, 인식된 차량의 종류에 기반하여, 번호판의 가로/세로 비율, 행의 수, 배경 색 및 문자 배열 구조를 이용하여 번호판 및 상기 번호판 영역의 문자를 인식하는 것을 특징으로 한다. 또한, CCTV 시스템 기반의 주차관리 장치는, 차량의 입차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어 도 하나의 CCTV 영상을 이용하여, 차량상황 정보를 추출하는 차량상황 정보 추출부를 더 포함하도록 구성될 수있다. 또한, 차량상황 정보 추출부는, 차량의 입차부터 주차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여 상기 차량의 주차구역 정보를 추출하는 주차 구역 인식부를 더 포함하도록 구성될 수 있 다. 또한, 주차 구역 인식부는, 주차 중인 차량의 차량번호를 인식하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 장치는, 차량번호가 인식된 차량을 추적하도록 구성되는 차량 추적부를 더 포함하도록 구성될 수 있다. 또한, 차량 추적부는, 차량의 주차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 출차하려는 차량의 출차 정보를 추출하도록 구성될 수 있다. 또한, 차량 추적부는, CCTV 영상을 이용하여 주차된 상기 차량의 움직임을 인식하고, 주차에서 출차까지 상기 차량을 추적하도록 구성될 수 있다. 또한, 차량 추적부는, 차량의 차량번호를 인식하고, 인식된 차량번호에 기반하여 차량을 추적하도록 구성될 수 있다. 또한, 차량 추적부는, 서로 다른 영상 간에 상기 차량이 해당 영상에서 출현과 사라짐의 위치와, 출현과 사라질 때의 시각, 및 출현과 사라짐의 방향 중에서 적어도 하나에 기반하여 차량을 추적하도록 구성될 수 있다. 또한, 차량 상황정보 추출부는, CCTV 영상을 이용하여 영상 별로 차량의 페이드인(fade-in) 및 페이드아웃 (fade-out)에 관한 시간 정보를 포함하는 차량출현 정보를 추출하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 장치는, 차량출현 정보를 이용하여 상기 차량의 입차, 진입, 진출 및 출차 상황이 중복구간 없이 심리스하게 이어지도록 영상들을 재생하는 재생부를 더 포함하도록 구성될 수 있다. 또한, 재생부는, 차량출현 정보를 이용하여 상기 차량의 입차, 진입, 진출 및 출차 상황이 중복구간이 포함되고 심리스하게 이어지도록 영상들을 재생하도록 구성될 수 있다. 또한, CCTV 시스템 기반의 주차관리 장치는, 차량속도 정보, 객체인식 정보, 및 상기 차량출현 정보를 포함하는 CCTV 영상으로 구성된 데이터셋의 학습을 통해 훈련된 인공지능 모델에 의한 분석에 기반하여 각종 비정상의 상 황을 인식하고, 이를 알람을 통해 알리는 알람부를 더 포함하도록 구성될 수 있다. 기타 실시 예의 구체적인 사항은 \""}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 주차관리 시스템과 주차장의 CCTV 시스템에 대한 중복 투자가 방지될 수 있다. 또한, CCTV 시스템이 소프트웨어의 보완을 통해 주차관리에 활용될 수 있다. 또한, 모니터링 대상이 주로 사람이었던 종래의 CCTV 시스템과 비교하여, 사람과 차량 및 이와 관련된 사고를 대상으로 CCTV 시스템을 이용하여 모니터링과 주차관리가 동시에 가능하다. 또한, CCTV 시스템을 이용하여 추출된 차량의 상황정보를 이용하여 차량 검색을 통해 대상 차량의 입차, 진입, 주차, 진출 및 출차 상황을 촬영한 영상의 심리스한 재생이 가능하다."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "\" 및 첨부 \"도면\"에 포함되어 있다. 본 발명의 이점 및/또는 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 각종 실시 예를 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 각 실시 예의 구성만으로 한정되는 것이 아니라 서로 다른 다양한 형태로 도 구현될 수도 있으며, 단지 본 명세서에서 개시한 각각의 실시 예는 본 발명의 개시가 완전하도록 하며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구범위의 각 청구항의 범주에 의해 정의될 뿐임을 알아야 한다."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명의 효과 본 발명에 의하면, 주차관리 시스템과 주차장의 CCTV 시스템에 대한 중복 투자가 방지될 수 있다. 또한, CCTV 시스템이 소프트웨어의 보완을 통해 주차관리에 활용될 수 있다. 또한, 모니터링 대상이 주로 사람이었던 종래의 CCTV 시스템과 비교하여, 사람과 차량 및 이와 관련된 사고를 대상으로 CCTV 시스템을 이용하여 모니터링과 주차관리가 동시에 가능하다. 또한, CCTV 시스템을 이용하여 추출된 차량의 상황정보를 이용하여 차량 검색을 통해 대상 차량의 입차, 진입,"}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "주차, 진출 및 출차 상황을 촬영한 영상의 심리스한 재생이 가능하다.도면의 간단한 설명 도 1은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치의 블록도이다. 도 2는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도이다. 도 3은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 시스템의 네트워크 관계도이다. 도 4는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도 이다. 도 5는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도 이다. 도 6은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리의 예시도이다. 도 7은 본 발명의 일 실시 예에 따른 CCTV 기반의 주차관리의 예시도이다. 도 8은 본 발명의 일 실시 예에 따른 CCTV 기반의 주차관리의 예시도이다."}
{"patent_id": "10-2021-0025768", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "발명을 실시하기 위한 구체적인 내용 본 발명을 상세하게 설명하기 전에, 본 명세서에서 사용된 용어나 단어는 통상적이거나 사전적인 의미로 무조건 한정하여 해석되어서는 아니 되며, 본 발명의 발명자가 자신의 발명을 가장 최선의 방법으로 설명하기 위해서 각종 용어의 개념을 적절하게 정의하여 사용할 수 있고, 더 나아가 이들 용어나 단어는 본 발명의 기술적 사상 에 부합하는 의미와 개념으로 해석되어야 함을 알아야 한다. 즉, 본 명세서에서 사용된 용어는 본 발명의 바람직한 실시 예를 설명하기 위해서 사용되는 것일 뿐이고, 본 발 명의 내용을 구체적으로 한정하려는 의도로 사용된 것이 아니며, 이들 용어는 본 발명의 여러 가지 가능성을 고 려하여 정의된 용어임을 알아야 한다. 또한, 본 명세서에서, 단수의 표현은 문맥상 명확하게 다른 의미로 지시하지 않는 이상, 복수의 표현을 포함할 수 있으며, 유사하게 복수로 표현되어 있다고 하더라도 단수의 의미를 포함할 수 있음을 알아야 한다. 본 명세서의 전체에 걸쳐서 어떤 구성 요소가 다른 구성 요소를 \"포함\"한다고 기재하는 경우에는, 특별히 반대 되는 의미의 기재가 없는 한 임의의 다른 구성 요소를 제외하는 것이 아니라 임의의 다른 구성 요소를 더 포함 할 수도 있다는 것을 의미할 수 있다. 더 나아가서, 어떤 구성 요소가 다른 구성 요소의 \"내부에 존재하거나, 연결되어 설치된다\"라고 기재한 경우에 는, 이 구성 요소가 다른 구성 요소와 직접적으로 연결되어 있거나 접촉하여 설치되어 있을 수 있고, 일정한 거 리를 두고 이격되어 설치되어 있을 수도 있으며, 일정한 거리를 두고 이격되어 설치되어 있는 경우에 대해서는 해당 구성 요소를 다른 구성 요소에 고정 내지 연결하기 위한 제 3의 구성 요소 또는 수단이 존재할 수 있으며, 이 제 3의 구성 요소 또는 수단에 대한 설명은 생략될 수도 있음을 알아야 한다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결\"되어 있다거나, 또는 \"직접 접속\"되어 있다고 기재되는 경우에는, 제 3의 구성 요소 또는 수단이 존재하지 않는 것으로 이해하여야 한다. 마찬가지로, 각 구성 요소 간의 관계를 설명하는 다른 표현들, 즉 \" ~ 사이에\"와 \"바로 ~ 사이에\", 또는 \" ~ 에 이웃하는\"과 \" ~ 에 직접 이웃하는\" 등도 마찬가지의 취지를 가지고 있는 것으로 해석되어야 한다. 또한, 본 명세서에서 \"일면\", \"타면\", \"일측\", \"타측\", \"제 1\", \"제 2\" 등의 용어는, 사용된다면, 하나의 구성 요소에 대해서 이 하나의 구성 요소가 다른 구성 요소로부터 명확하게 구별될 수 있도록 하기 위해서 사용되며, 이와 같은 용어에 의해서 해당 구성 요소의 의미가 제한적으로 사용되는 것은 아님을 알아야 한다. 또한, 본 명세서에서 \"상\", \"하\", \"좌\", \"우\" 등의 위치와 관련된 용어는, 사용된다면, 해당 구성 요소에 대해 서 해당 도면에서의 상대적인 위치를 나타내고 있는 것으로 이해하여야 하며, 이들의 위치에 대해서 절대적인 위치를 특정하지 않는 이상은, 이들 위치 관련 용어가 절대적인 위치를 언급하고 있는 것으로 이해하여서는 아 니된다. 또한, 본 명세서에서는 각 도면의 각 구성 요소에 대해서 그 도면 부호를 명기함에 있어서, 동일한 구성 요소에 대해서는 이 구성 요소가 비록 다른 도면에 표시되더라도 동일한 도면 부호를 가지고 있도록, 즉 명세서 전체에 걸쳐 동일한 참조 부호는 동일한 구성 요소를 지시하고 있다.본 명세서에 첨부된 도면에서 본 발명을 구성하는 각 구성 요소의 크기, 위치, 결합 관계 등은 본 발명의 사상 을 충분히 명확하게 전달할 수 있도록 하기 위해서 또는 설명의 편의를 위해서 일부 과장 또는 축소되거나 생략 되어 기술되어 있을 수 있고, 따라서 그 비례나 축척은 엄밀하지 않을 수 있다. 또한, 이하에서, 본 발명을 설명함에 있어서, 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 구성, 예 를 들어, 종래 기술을 포함하는 공지 기술에 대해 상세한 설명은 생략될 수도 있다. 이하, 본 발명의 실시 예에 대해 관련 도면들을 참조하여 상세히 설명하기로 한다. 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는, 종래의 기술에 따라 주차관리 시스템과 CCTV 시스템이 따로 설치되거나, 주차관리 중에서도 일부, 예를 들어 주차구역 모니터링에만 CCTV 시스템을 이 용했던 단점을 개선한 것으로, 기존의 CCTV 카메라를 주차관리에 이용할 수 있게 해 주는 장치에 관한 것이다. 또한, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는, CCTV 카메라를 이용하므로, 종래의 기술에 따른 루프코일의 매립이 어려운 장소에서 CCTV 시스템의 카메라를 이용하여 차량의 인식 및 차량번호의 인식함으로써, 별도의 주차관리에 필요했던 루프코일을 대체할 수 있는 CCTV 시스템을 이용하는 주차관리 시스 템인 것을 특징으로 한다. 즉 CCTV 시스템 기반의 주차관리 장치를 구성하는, CCTV 카메라가 종래의 루프코일과 별도의 LPR 카메라를 대체할 수 있다. 또한, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는, CCTV 시스템과 주차관리 시스템의 단 순한 통합이 아니라, CCTV 시스템과 주차관리 시스템의 유기적인 관계를 개시한다. 예를 들어 CCTV 시스템 기반 의 주차관리 장치는, 종래의 기술에 따라 저장된 영상을 사람이 직접 검색하고, 검색 결과에 따라 타갯 영상이 라 예상되는 다수의 영상들을 일일이 사람이 재생하고 육안으로 확인하던 작업에서 벗어나게 해주는데, CCTV 시 스템을 통해서 수집된 영상을 주차관리 시스템을 이용하여 분석을 하고, 분석에 기반하여 차량에 관한 종합적인 정보에 해당하는 차량의 상황정보를 추출하고, 상황정보를 이용하여 타겟 차량을 처음부터 끝까지 심리스하게 모니터링 할 수 있게 해준다. 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법, 장치 및 시스템을 설명하는 과정에서, 하나의 대상에 대해 “데이터”는 컴퓨터가 다루는 이진 코드를 포함하는 물리적 요소로서 사용되고, “정보”는 데이 터가 포함하는 내용적 요소로 사용될 수 있다. 따라서 데이터와 정보는 동일한 대상을 지칭할 수 있다. 도 1은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치의 블록도이다. 도 2는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도이다. 도 1의 CCTV 시스템 기반의 주차관리 장치는 도 2의 CCTV 시스템 기반의 주차관리 방법을 수행하는 주체에 해당한다. 도 1을 참조하면, CCTV 시스템 기반의 주차관리 장치는, 제어부, CCTV 카메라, 입력 장치 , 출력 장치, 저장 장치, 통신 장치, 메모리, 차량 인식부, 차량번호 인식부 , 차량 상황정보 추출부, 주차구역 인식부, 차량 추적부, 검색부, 재생부 및 알람부를 포함하도록 구성될 수 있다. 그리고 메모리는 차량 인식부, 차량번호 인식부, 차 량 상황정보 추출부, 주차구역 인식부, 차량 추적부, 검색부, 재생부 및 알람부(17 8)를 저장하도록 구성될 수 있다. 도 1 및 도 2를 참조하면, 차량 인식부, 차량번호 인식부, 차량 상황정보 추출부, 주차구역 인 식부, 차량 추적부, 검색부, 재생부 및 알람부(이하 명령 수행 모듈들(command execution modules))는 도 1과 같이, 소프트웨어 형태, 예를 들어 주차관리 프로그램에 포함된 모듈 형태로 구 현될 수 있고, 저장 장치에서 메모리에 로드 되고, 메모리에 로드된 상태에서, CCTV 시스템 기 반의 주차관리 방법(S100)을 구성하는 명령을 실행할 수 있다. 또한, 명령 실행 모듈들은 하드웨어 형태, 예를 들어 반도체 소자를 이용한 집적 회로 형태로 구현될 수 있고, CCTV 시스템 기반의 주차관리 방법(S100)을 실행하도록 구성된 전자 회로를 포함할 수 있다. 제어부는 명령 수행 모듈들(171~178)을 구동하는 기능을 수행한다. 제어부는, 프로세서(processor)에 해당하는 중앙처리장치(Central Processing Unit) 형태로 구현될 수 있고, CCTV 시스템 기반의 주차관리 방법을 구성하는 명령어 셋을 실행하는 기능을 수행한다. 제어부는 CCTV 카메라, 입력 장치, 출력 장치 , 저장 장치, 통신 장치로의 데이터 송신 및 이들로부터의 데이터 수신을 통해 이들의 동작을 기본적으로 제어할 수 있다. CCTV 카메라는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 시스템을 특징적으로 구성하는 센싱 장치에 해당한다. 반면 종래의 기술에 따르면 CCTV 카메라와 주차관리 카메라가 서로 구별되었다. 즉 CCTV 카메라를 통해 촬영된 영상은 DVR(Digital Video Recorder)이나 NVR(Network Video Recorder)이라는 저장장치 에 저장되었고, 주차관리 시스템 내의 LPR 카메라를 이용하여 수집된 영상은 차량번호를 인식하는 용도로만 사 용되었다. 그런데 본 발명의 일 실시 예에 따른 CCTV 카메라는, CCTV 시스템 용도로 설치된 것이지만, 주 차관리에도 이용될 수 있다. 즉 종래 기술에서 땅속에 매설된 루프가 수행했던 차량 인식 기능을 CCTV 카메라 가 수행할 수 있고, 그 밖에 차량번호 인식은 물로 CCTV 본래의 차량 모니터링 기능도 수행할 수 있다. 입력 장치는, CCTV 시스템 기반의 주차관리 방법(S100)의 실행에 있어서 필요한 각종 사용자 입력, 예를 문자, 숫자 입력 등을 수신하는 기능을 수행한다. 출력 장치는, CCTV 시스템 기반의 주차관리 방법의 실행에 있어서 사용자에게 각종 데이터와 정보, 예를 들어 차량번호, 출현정보, 상황정보 등을 유저 인터페이스를 통해서 디스플레이 하거나, 소리를 통해 출력하는 기능을 수행한다. 저장 장치는, CCTV 시스템 기반의 주차관리 방법의 실행에 있어서 각종 데이터와 정보, 예를 들어 차량번 호, 출현정보, 상황정보 등을 저장하는 기능을 수행한다. 통신 장치는, CCTV 시스템 기반의 주차관리 방법의 실행에 있어서 CCTV 카메라를 비롯하여 각종 외부 기기와 다양한 프로토콜을 통해 데이터를 송신 및 수신하는 기능을 수행한다. 따라서, 통신 장치는 내부적 으로 다양한 프로토콜에 대응하는 통신 모듈, 예를 들면 병렬통신 모듈, 직렬통신 모듈, 근거리 통신 모듈, 셀 룰러 통신 모듈, 무선랜 통신 모듈, 및 인터넷 통신 모듈 등을 포함하도록 구성될 수 있다. 메모리는 전원의 ON/OFF에 따라 저장된 데이터가 유지되거나 사라지는 비휘발성 또는 휘발성 반도체 소자 를 통해서 구현될 수 있다. 메모리는 소프트웨어 형태로 구현된 명령 수행 모듈들을 로드하고, 이를 저장 하는 기능을 수행한다. 차량 인식부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, 주 차장 입구에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상을 이용하여 입차 상황을 인식하는 기능을 수행한다. 차량 인식부는 구체적으로, 객체식별 알고리즘에 기반하여 차량 자체를 인식함과 동시에 차량의 종류, 예를 들어 택시, 트럭, 등의 특수 목적 차량과 전기차 등의 특수 번호판 차량을 인식할 수 있도록 구성될 수 있다. 차량번호 인식부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, 주차장 입구에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상을 이용하여 입차 상황을 인식하는 기 능을 수행한다. 차량 상황정보 추출부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하 나로서, 주차장 입구에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상을 이용하여 입차 상황을 인식하는 기능 을 수행한다. 주차구역 인식부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, 주차장 입구에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상을 이용하여 입차 상황을 인식하는 기 능을 수행한다. 차량 추적부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, 주 차장에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상, 예를 들어 입차, 진입, 주차, 진출 및 출차 상황이 촬 영된 CCTV 영상을 이용하여 정지 및 이동하는 차량을 추적하면서 인식하는 기능을 수행한다. 검색부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, CCTV 카 메라를 통해서 수집된 각종 CCTV 영상의 분석을 통해 추출된 각종 정보, 예를 들어 차량번호, 주차정보, 출현정 보 및 상황정보 등을 이용하여 차량 검색 결과를 출력하는 기능을 수행한다.재생부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, 주차장 입구에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상의 분석을 통해 추출된 정보, 예를 들어 차량번호, 주차 정보, 출현정보 및 상황정보 등을 이용하여 검색의 대상인 타갯 차량에 관한 영상을 심리스(seamless)하게 재생 하는 기능을 수행한다. 알람부는, CCTV 시스템 기반의 주차관리 방법(S100)을 구성하는 명령 수행 모듈들 중의 하나로서, 주차장 입구에 설치된 CCTV 카메라를 통해서 수집된 CCTV 영상의 분석을 통해 추출된 각종 정보, 예를 들어 차량번호, 주차정보, 출현정보 및 상황정보 등을 이용하여 사용자에게 각종 돌발 상황을 알리는 기능을 수행한다. 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는, 이를 구성하는 요소들의 광협에 따라, 도 1과 같이 CCTV 카메라를 포함하거나 또는 CCTV 카메라를 포함하지 않는 구성과 같이 다양한 실시 예로 구현될 수 있다. 더 나아가 CCTV 시스템 기반의 주차관리 장치를 포함하는 CCTV 시스템 기반의 주차 관리 시스템이 정의될 수 있다. 도 3은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 시스템의 네트워크 관계도이다. 도 3을 참조하면, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 시스템은, 기존의 CCTV 시스템, 즉 CCTV 카메라와 저장장치가 포함된 주차관리 장치와 주차관리에 필요한 추가 장비들, 예를 들 어 키오스크, 게이트, 사용자 단말, 서버, 및 네트워크를 더 포함하도록 구성될 수 있다. 본 발명의 일 실시 예에 따른 CCTV 카메라는, 아날로그 카메라, 디지털 카메라, 예를 들어 IP 카메라 및 LPR 카메라, 즉 LPR 기능을 갖는 카메라 중에서 선택될 수 있다. 카메라로서 아날로그 카메라가 선택되는 경우, LPR 과정은 로컬 상의 LPR 장치, 예를 들어 CCTV 시스템 기반의 주차관리 장치에 의해 수행될 수 있다. 카 메라로서 디지털 카메라, 예를 들어 IP 카메라가 선택되는 경우, LPR 과정은 로컬 상의 LPR 장치, 예를 들어 CCTV 시스템 기반의 주차관리 장치 또는 클라우드 상의 서버에 의해 수행될 수 있다. 카메라로서 LPR 카메라가 선택되는 경우, LPR 과정은 LPR 카메라에 의해 수행될 수 있다. LPR 카메라는 LPR 기능 수행할 수 있는 카메라로서, 수집된 영상을 이용하여 차량번호를 판독하는 하드웨어 및 소프트웨어를 모듈 형태로 포함할 수 있다. 따라서 LPR 카메라는 출력으로 비디오 데이터 및 판독 데이터로서 차량번호 및 카운팅 정보를 출력하고, 이를 주차유도 장치에 전송할 수 있다. LPR 카메라는, 엣지 단의 내장된 인공지능 모델, 예를 들어 합성곱 신경망(Convolutional Neural Networks)을 이용하여 영상 내에서 동체를 인식 및 추적하고, 차량의 번호판을 인식할 수 있다. 카메라는 영상 수집 외의 영상 가공 기능의 유무에 따라 다양한 형태로 구현될 수 있다. 그리고 카메라 가 네트워크 내에서 IP를 부여 받은 카메라, 예를 들어 IP 카메라인 경우, 카메라는 별도의 제 어기를 거치지 않고 수집한 영상, 가공한 영상 및 판결 결과 데이터를 CCTV 시스템 기반의 주차관리 장치 및 서버에 직접 전송할 수 있다. 카메라는 통신 모듈 및 임베디드 시스템을 포함하고 있어서 사물인터넷으로 작용할 수 있다. 설치된 위치 가 파악된, 개별 아이피 또는 하드웨어 구별 번호를 갖는 카메라가 전송하는 데이터에 기반하여 주차유도 장치는 전송 받은 영상 속의 차량의 카메라 대비 상대 위치를 파악하고, 그리고 카메라의 절대 위치에 기 반하여 차량의 절대 위치가 파악할 수도 있다. 키오스크는 CCTV 시스템 기반의 주차관리 자치의 제어를 통해 출차 전에 주차 요금을 미리 정산하기 위한 장치이다. 제어부는 차량 인식 및 차량번호 인식 결과를 이용하여 개폐 명령에 따라 게이트의 개폐를 제어할 수 있다. 사용자 단말은, 서버에 해당하는 CCTTV 시스템 기반의 주차관리 장치에 접속할 수 있는 클라이언트에 해당한다. 사용자 단말은 네트워크를 통해 CCTV 시스템 기반의 주차관리 장치에 접속하여 CCTV 카메라에 의해 촬영되는 영상을 실시간으로 확인할 수 있다. 사용자 단말의 다양한 실시 예들은 셀룰러 전화기, 무선 통신 기능을 가지는 스마트 폰, 무선 통신 기능을 가지는 개인 휴대용 단말기(PDA), 무선 모뎀, 무선 통신 기능을 가지는 휴대용 컴퓨터, 무선 통신 기능을 가지 는 디지털 카메라와 같은 촬영장치, 무선 통신 기능을 가지는 게이밍(gaming) 장치, 무선 통신 기능을 가지는 음악저장 및 재생 가전제품, 무선 인터넷 접속 및 브라우징이 가능한 인터넷 가전제품뿐만 아니라 그러한 기능 들의 조합들을 통합하고 있는 휴대형 유닛 또는 단말기들을 포함할 수 있으나, 이에 한정되는 것은 아니다. 서버는 CCTV 시스템 기반의 주차관리 장치에 다양한 서비스를 제공할 수 있다. 예를 들어 서버 는 복수의 CCTV 시스템 기반의 주차관리 장치를 관리하는 장치에 해당할 수 있다. 전문 주차 서비스 업체 가 여러 주차장의 주차관리 장치 내지는 주차관리 시스템을 관리하는 경우, 서버는 복수의 주차장의 주차 관리 장치를 관리하고, 카메라를 통해 수집된 센싱 데이터를 통합 관제에 이용할 수 있다. 서버(26 0)는 컴퓨팅 장치, 즉 컴퓨터를 이용하여 구현될 수 있다. 그 밖에 서버는, 인공지능 API, 차량 등록 데이 터베이스, LPR 기능을 CCTV 시스템 기반의 주차관리 장치에 제공할 수 있다. 네트워크는 유선 및 무선 네트워크, 예를 들어 RS422 등과 같은 시리얼 통신, LAN(local area network), WAN(wide area network), TCP/IP의 인터넷(internet), 인트라넷(intranet) 및 엑스트라넷(extranet), 그리고 모바일 네트워크, 예를 들어 셀룰러, 3G, LTE, WiFi 네트워크, 애드혹 네트워크 및 이들의 조합을 비롯한 임의 의 적절한 통신 네트워크 일 수 있다. 네트워크는 허브, 브리지, 라우터, 스위치 및 게이트웨이와 같은 네트워크 요소들의 연결을 포함할 수 있 다. 네트워크는 인터넷과 같은 공용 네트워크 및 안전한 기업 사설 네트워크와 같은 사설 네트워크를 비롯 한 하나 이상의 연결된 네트워크들, 예컨대 다중 네트워크 환경을 포함할 수 있다. 네트워크에의 액세스는 하나 이상의 유선 또는 무선 액세스 네트워크들을 통해 제공될 수 있다. 통신 장치 및 임베디드 시스템을 포함하고 있는 IP 카메라를 이용하여 주차관리 시스템이 구현되는 경우, 카메라는 사물인터넷으로 작용하여 이더넷을 통해 네트워크에 연결되고 인터넷 프로토콜을 이용하여 CCTV 시스템 기반의 주차관리 장치, 서버및 사용자 단말과 통신할 수 있다. 도 1의 통신 장치는 도 3의 네트워크 연결을 가능하게 하는 각종 통신 모듈, 예를 들어 병렬통신 모 듈, 직렬통신 모듈, 근거리 통신 모듈, 셀룰러 통신 모듈, 무선랜 통신 모듈, 및 인터넷 통신 모듈 등을 포함하 도록 구성될 수 있다. 이하 CCTV 시스템 기반의 주자관리 방법(S100)에 대해 설명하기로 한다. 도 2를 다시 참조하면, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법(S100)은, CCTV 카메라 를 이용한 주차장 상황의 CCTV 영상 촬영(S110), 입차, 진입, 주차, 진출 및 출차 상황이 촬영된 CCTV 영상의 저장(S120), 촬영된 영상 중에서 입차 CCTV 영상을 이용한 차량 인식(S130), 인식된 차량의 종류에 기반한 차량 번호 인식(S140) 및 입차부터 출차까지의 상황이 촬영된 CCTV 영상을 이용한 차량상황 정보 추출(S150)을 포함 하도록 구성될 수 있다. S110 단계에서 CCTV 시스템 기반의 주차관리 장치는 CCTV 시스템의 관재 범위에 속하는 주차장에 설치된 CCTV 카메라를 이용하여 주차장의 상황을 영상 촬영하도록 구성될 수 있다. S120 단계에서 CCTV 시스템 기반의 주차관리 장치는 차량의 주차장 입차 시부터 출차 시까지 이동 및 정지 한 차량을 촬영한 영상으로서 입차 상황, 진입 상황, 진출 상황 및 출차 상황이 촬영된 영상을 저장하도록 구성 될 수 있다. S130 단계에서 CCTV 시스템 기반의 주차관리 장치는 촬영된 CCTV 영상 중에서 주차장 입구에서 촬영된 입 차 CCTV 영상을 이용하여 차량을 인식하도록 구성될 수 있다. 본 발명의 일 실시 예에 따른 차량 인식 과정은, 전처리 단계, 특징점 추출 단계, 및 객체인식 알고리즘 예를 들어, Canny Edge Detector, Harris Corner 검출기, Haar-like Feature, HOG(Histogram of Oriented Gradient), SIFT(Scale Invariant Feature Transform), LBP(Local Binary Pattern), 및 MCT(Modified Census Transform) 중에서 적어도 하나를 이용한 분류 단계를 포함하도록 구성될 수 있다. 그 밖에 인공지능 알고리즘 으로, 인공 신경망, 예를 들어 CNN, 또는 YOLO, SSD 등이 이용될 수 있다. S140 단계에서 CCTV 시스템 기반의 주차관리 장치는 인식된 차량의 종류에 기반하여, 입차 CCTV 영상을 이 용하여 차량의 차량번호를 인식하도록 구성될 수 있다. S150 단계에서 CCTV 시스템 기반의 주차관리 장치는 차량의 입차부터 출차까지의 상황이 촬영된 CCTV 영상 중에서 적어도 하나의 CCTV 영상을 이용하여, 차량상황 정보를 추출하도록 구성될 수 있다. 본 발명의 일 실시 예에 따른 차량상황 정보는, 입차 상황에서 차량번호 인식 후에 발생하는 차량의 진입, 주차, 진출 및 출차 상 황에서 수집되는 차량에 관한 정보를 포함하도록 구성될 수 있다. 도 4 참조를 통해 S150 단계에 대해 상세히 설명하기로 한다. 도 4는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도 이다. 구체적으로 도 4는 차 량의 진입, 주차, 진출 및 출차 상황에서 촬영된 CCTV 영상을 이용하여 차량에 관한 정보를 추출하는 과정에 관 한 것이다. 도 4를 참조하면, S210 단계에서 CCTV 시스템 기반의 주차관리 장치는 입차 후 이동하는 차량을 추적할 수 있다. S220 단계에서 CCTV 시스템 기반의 주차관리 장치는 차량의 입차부터 주차까지의 상황이 촬영된 CCTV 영상 을 이용하여 주차 구역에 관한 정보를 추출할 수 있다. S230 단계에서 CCTV 시스템 기반의 주차관리 장치는, 주차 구역에 설치된 CCTV 카메라에 의해 촬영된 CCTV 영상을 이용하여 주차된 차량의 움직임을 인식할 수 있다. S240 단계에서 CCTV 시스템 기반의 주차관리 장치는 주차에서 출차까지 상황이 촬영된 영상을 이용하여 주 차 종료 후 출차하는 차량을 추적할 수 있다. S250 단계에서 CCTV 시스템 기반의 주차관리 장치는 촬영된 CCTV 영상 별로 시각 정보를 포함하는 차량출 현 정보를 추출할 수 있다. 여기서, 차량출현 정보를 추출하는 단계(S250)는, S210 단계 내지 S240 단계를 통해 촬영되는 CCTV 영상에 대해 실시간으로 수행되는 것을 특징으로 한다. 추출된 차량출현 정보는 저장장치에 저장될 수 있다. 예를 들어 S100, 및 S200에 대해 설명하기로 한다. 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는 CCTV 카메라를 통해 촬영된(S110) CCTV 영상, 예를 입착 상황의 영상, 진입 상황의 영상, 주차 후 진출 상황의 영상 및 출차 상황의 영상을 계속 해서 저장장치에 실시간으로 저장한다(S120). 차량 인식부는 입차 상황이 촬영된 CCTV 영상에 기반하여 차량의 입차 상황을 인식하고(S130), 이에 관한 값을 출력한다. 다음으로 차량번호 인식부는, 입차 상황을 알리는 출력 값을 수신하고, 입차 상황의 CCTV 영상을 이용하여 차량의 차량번호를 인식할 수 있다(S140). 차량번호를 인식하는 데에는 다양한 알고리즘 내지 는 인공지능 모델이 이용될 수 있다. 차량번호 인식부는 인식한 차량번호와 시간 정보를 값으로 출력할 수 있다. 다음으로 차량 추적부는, 다양한 객체 추적 알고리즘을 이용하여 주차 구역을 찾지 위해 이동하는 입차된 차량을 추적할 수 있다(S210). 차량 추적부는 복수의 영상 간에 차량의 페이드인을 인식하고, 영상 내에서 차량을 계속 추적하다가, 페이드아웃을 인식하고, 다음 이어지는 영상에서 차량의 페이드인을 다시 인식하는 순 서로 계속해서 차량을 추적할 수 있다. 차량 추적부는 이동하는 차량의 정지를 인식하고, 해당 차량이 정 지한 때의 시간 정보 및 차량의 영상 내 위치에 관한 정보를 출력할 수 있다. 다음으로 주차구역 인식부는, 차량이 정지한 때의 시간 정보 및 차량의 영상 내 위치에 관한 정보를 이용 하여 주차구역을 인식, 예를 들어 주차장의 기둥, 벽면 또는 바닥에 프린트된 주차 구역의 주소 정보를 인식할 수 있다(S220). 그리고 차량 추적 방법에 따라 차량번호 인식부는 주차 주역에 주차된 차량번호를 다시 인 식할 수 있다(S220). 주차 구역에서 차량은 주차를 완료하고 한동안 정지 상태에 있을 수 있다. 그리고 일정 주차 시간이 흐르고 해 당 차량은 주차를 종료하고 이동하기 시작한다. 이 때 차량 추적부는 주차된 차량의 움직임을 인식하고 진 출 및 출차하려는 차량을 추적한다(S240).차량 출현정보 추출부는 차량 추적부에 의해 출력된 차량 정보 및 시간 정보를 이용하여, 해당 CCTV 영상에서 차량이 출현하고 사라지는 시간 정보, 즉 차량출현 정보를 추출할 수 있다. 이하 추출된 차량출현 정보를 이용하는 방법에 대해 상세히 설명하기로 한다. 도 5는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도이다. 도 5를 참조하면, S310 단계에서 CCTV 시스템 기반의 주차관리 장치는 S250 단계에서 추출된 차량출현 정 보를 저장할 수 있다. 즉 저장장치에는 특정 CCTV 카메라가 실시간으로 촬영한 CCTV 영상에 대응하는, 해 당 CCTV 영상에서 인식된 차량에 관한 차량번호 및 차량출현 정보가 저장될 수 있다. S320 단계에서 CCTV 시스템 기반의 주차관리 장치는, 다양한 입력 정보, 예를 들어 차량번호, 날짜, 시간 에 관한 정보를 이용하여 차량을 검색할 수 있다. S330 단계에서 CCTV 시스템 기반의 주차관리 장치는 차량출현 정보를 이용하여 검색된 차량의 영상 재생할 수 있다. 이하 차량출현 정보에 대한 개념과 차량출현 정보를 이용하여 복수의 CCTV 영상들 중에서, 검색 대상 인 타갯 차량에 대한 촬영 영상 원본을 확인하는 방법에 대해 예를 들어 설명하기로 한다. 도 6은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리의 예시도이다. 도 6을 참조하면, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치 및 시스템이 관재하는 주차 장에 설치된 CCTV 카메라가 묘사되어 있다. CCTV 카메라는, 입차 상황 촬영을 위한 CCTV 카메라, 진입 및 주차 상황 촬영을 위한 CCTV 카메라, 주차 및 진출 상황 촬영을 위한 CCTV 카메라, 및 출차 상황 촬 영을 위한 CCTV 카메라를 포함하도록 구성될 수 있다. 다만 설치된 CCTV 카메라의 수가 도 6의 카메라 수 에 한정되지는 않는다. 카메라 아래에는 입차 상황의 차, 주차 상황의 차 및 출차 상황의 차가 대표적으로 묘사되어 있고, 묘사된 3대 의 차량은, 차량의 이동과 정지 및 시간의 흐름을 나타내기도 한다. 그리고 3대의 차량 아래에는 카메라가 촬영한 입차 영상, 카메라가 촬영한 진입 영상, 카메라이 촬영한 진출 영상, 및 카메라가 촬영 한 출차 영상에서 차량이 출현된 구간이 도식적으로 묘사되어 있다. 도 6을 참조하면, 입차 영상에서 예시의 차량은 기준 시각(0:00)에 입차한 것으로 묘사되어 있다. 즉 기준 시각 에 차량의 차량번호가 인식되었음을 알 수 있다. 입차 영상에서 차량은 5초간 출현하다가 사라지고, 차량의 경 로 중에 설치된 CCCTV 카메라는 차량이 입차 영상에서 사라지기 전에 차량을 촬영하기 시작 해서(4:50) 10 초까지 차량을 진입 영상 내에서 촬영할 수 있다. 이와 같은 방법을 통해 추출된 진출 영상, 출차 영상에서 촬 영된 차량의 페이드인 시각 및 페이드아웃 시각이 묘사되어 있다. 도 7은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리의 예시도이다. 도 8은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리의 예시도이다. 도 7 및 도 8을 참조하면, 도 6과 비교하면, 서로 다른 방법에 의해 추출된 차량의 페이드인 시각 및 페이드아 웃 시간이 묘사되어 있다. CCTV 영상 중에서 시간적으로 연결될 수 있는 전 영상과 후 영상이 있다고 하면, 도 6에서는 후 영상에서 차량이 출현하는 시점에 맞추어 전 영상의 페이드아웃 시각을 결정되고, 도 7에서는 전 영 상에서 차량이 페이드아웃 하는 시점에 맞추어 후 영상의 페이드인 시각이 결정되고, 도 8에서는 전 영상과 후 영상 별로 영상 간에 시간적으로 중복되도록 페이드인 시각과 페이드아웃 시각이 각각 결정된다. 따라서, 도 6 또는 도 7과 같은 방법을 이용하는 경우, CCTV 시스템 기반의 주차관리 장치는, 차량이 출현 한 CCTV 영상의 구간 간에 중복된 시간 구간이 포함되지 않도록, 차량출현 정보에 기반하여 CCTV 영상의 구간이 심리스하게 이어지도록 재생할 수 있다. 여기서, 도 6에 의한 방법 및 도 7에 의한 방법 중에서 어느 하나의 방 법이 선택되거나, 환경 설정을 통해 도 6 또는 도 7과 다른 시점이 전 영상과 후 영상을 이어주는 시점으로 정 해질 수 있다. 반면 도 8과 같은 방법을 이용하는 경우, CCTV 시스템 기반의 주차관리 장치는, 차량이 출현한 CCTV 영상 의 구간 간에 중복된 시간 구간이 포함되도록, 차량출현 정보에 기반하여 CCTV 영상의 구간이 심리스하게 이어 지도록 재생할 수 있다.본 발명의 일 실시 예에 따른 주차관리 장치와 CCTV 시스템의 유기적 관계를 통해 발휘되는 효과 중의 하나로서, 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치는, CCTV 영상을 비롯하여 이것 에서 추출된 차량번호 및 차량의 상황정보의 분석을 통해 차량의 돌발 상황을 인식하고 이를 알릴 수 있는 기능 을 수행할 수 있다. 즉, CCTV 시스템 기반의 주차관리 장치는, 차량속도 정보, 객체인식 정보, 및 상기 차량출현 정보를 포함 하는 CCTV 영상으로 구성된 데이터셋의 학습을 통해 훈련된 인공지능 모델에 의한 분석에 기반하여 각종 비정상 의 상황을 인식하고, 이를 알람을 통해 사용자에게 알리는 단계를 수행할 수 있다. 여기서, 돌발 상황 또는 비정상의 상황에는, 영상 속에서 차량이 사라지거나, 차량의 페이드인 시각과 페이드아 웃 시각이 표준 시각과 비교하여 차이가 나거나, 차량과 사람, 차량과 차량과의 접촉, 차량의 비정상적인 정지, 차량의 비정상적인 속도, 주차장에서 발생한 화재, 및 사람의 비정상적인 움직임 등이 포함될 수 있다. 이와 같이 본 발명의 일 실시 예에 의하면, 주차관리 시스템과 주차장의 CCTV 시스템에 대한 중복 투자가 방지 될 수 있다. 또한, CCTV 시스템이 소프트웨어의 보완을 통해 주차관리에 활용될 수 있다. 또한, 모니터링 대상이 주로 사람이었던 종래의 CCTV 시스템과 비교하여, 사람과 차량 및 이와 관련된 사고를 대상으로 CCTV 시스템을 이용하여 모니터링과 주차관리가 동시에 가능하다. 또한, CCTV 시스템을 이용하여 추출된 차량의 상황정보를 이용하여 차량 검색을 통해 대상 차량의 입차, 진입, 주차, 진출 및 출차 상황을 촬영한 영상의 심리스한 재생이 가능하다. 이상, 일부 예를 들어서 본 발명의 바람직한 여러 가지 실시 예에 대해서 설명하였지만, 본 \"발명을 실시하기 위한 구체적인 내용\" 항목에 기재된 여러 가지 다양한 실시 예에 관한 설명은 예시적인 것에 불과한 것이며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이상의 설명으로부터 본 발명을 다양하게 변형하여 실 시하거나 본 발명과 균등한 실시를 행할 수 있다는 점을 잘 이해하고 있을 것이다. 또한, 본 발명은 다른 다양한 형태로 구현될 수 있기 때문에 본 발명은 상술한 설명에 의해서 한정되는 것이 아 니며, 이상의 설명은 본 발명의 개시 내용이 완전해지도록 하기 위한 것으로 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이며, 본 발명은 청구범 위의 각 청구항에 의해서 정의될 뿐임을 알아야 한다."}
{"patent_id": "10-2021-0025768", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 장치의 블록도이다. 도 2는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도이다. 도 3은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 시스템의 네트워크 관계도이다. 도 4는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도 이다. 도 5는 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리 방법의 흐름도 이다. 도 6은 본 발명의 일 실시 예에 따른 CCTV 시스템 기반의 주차관리의 예시도이다. 도 7은 본 발명의 일 실시 예에 따른 CCTV 기반의 주차관리의 예시도이다. 도 8은 본 발명의 일 실시 예에 따른 CCTV 기반의 주차관리의 예시도이다."}
