{"patent_id": "10-2018-0140367", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0056555", "출원번호": "10-2018-0140367", "발명의 명칭": "디지털 프로젝터 검사기 및 이를 이용한 검사방법", "출원인": "심상헌", "발명자": "심상헌"}}
{"patent_id": "10-2018-0140367", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "측정 대상물(1) 직상부에 위치되어 측정 대상물(1)을 찍고 광학 영상을 디지털화시켜 유선 또는 무선으로 연결된 컴퓨터(2)로 전송하는 디지털 카메라(100); 상기 디지털 카메라(100)와 연결되어 상기 측정 대상물(1)을 저배율에서 고배율까지 다양한 배율로 관찰하는 광학 줌 렌즈(200); 상기 디지털 카메라(100)와 연결되어 상부에서 상기 측정 대상물(1)로 조사되는 링조명(300); 상기 디지털 카메라(100)와 연결되어 고배율에서도 상기 측정 대상물(1)의 초점을 선명하게 자동으로 맞추는 오토포커스 장치(400); 상기 측정 대상물(1) 경계부위의 측정 정확도를 높이기 위해서 하부에서 측정 대상물(1)로 조사되는 백라이트(500); 상기 디지털 카메라(100)과 광학 줌 렌즈(200) 및 링조명(300)을 포함하는 광학계 전체를 Z축으로 수직으로 이동시키는 Z스테이지(10); 및상기 측정 대상물(1)이 상면 중심에 위치되고 상기 백라이트(500) 조명을 투과시키는 투명유리(20)를 갖고 상기측정 대상물(1)을 X축 또는 Y축으로 이동시키고 그 위치 정보를 인식하는 XY스테이지(30);를 구비함을 특징으로하는 디지털 프로젝터 검사기."}
{"patent_id": "10-2018-0140367", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 컴퓨터(2)는, 실시간 비디오로 확대 관찰하는 비디오창(S100); 상기 디지탈 카메라(100)로 부터 받은 측정 대상물(1)의 실물 영상과 내부에 미리 제작되어 저장된 측정 대상물(1)의 설계 정보(CAD)를 중첩해서 상기 비디오창(S100)으로 중첩 출력시키는 중첩출력창(S200); 상기 비디오창(S100)과는 별도로 인접되어 내부에 미리 제작되어 저장된 측정 대상물(1)의 설계 정보(CAD)을 보여주는 캐드 원본 보기창(S300); 상기 비디오창(S100) 및 캐드 원본 보기창(S300)과는 별도로 인접되어 상기 중첩출력창(S200)에서 검사된 영역과 불량 정보를 전체적으로 보여주는 검사된 영역창(S400); 및상기 비디오창(S100)과 캐드 원본 보기창(S300) 및 검사된 영역창(S400)과 별도로 측정 대상물(1)의 현재 위치를 XY 좌표로 보여주는 스테이지 좌표 창(S500);를 포함하는 불량검사 프로그램창(3)을 더 구비함을 특징으로하는 디지털 프로젝터 검사기."}
{"patent_id": "10-2018-0140367", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "디지털 프로젝터 검사기(A)의 XY스테이지(30) 투명유리(20) 상면에 측정 대상물(1)을 위치시키는 측정 대상물정위치단계;컴퓨터(2)를 구동시켜 측정 대상물(1)의 설계 정보(CAD)를 활성화시키는 설계정보 활성화단계;컴퓨터(2)의 불량검사 프로그램창(3)을 활성화시키는 프로그램창 활성화단계;상기 불량검사 프로그램창(3)의 캐드 원본 보기창(S300)에 디지털 카메라(100)로부터 제공된 측정 대상물(1)의설계 정보(CAD)를 선택하여 띄우는 설계정보 띄움단계;상기 불량검사 프로그램창(3) 캐드 원본 보기창(S300)의 측정 대상물(1) 설계 정보(CAD)에서 정렬개체를 선택하공개특허 10-2020-0056555-3-는 정렬개체 선택단계;상기 정렬개체 선택단계에서 선택된 개체에 해당되는 측정 대상물(1)의 영역이 비디오창(S100)의 X축과 Y축이만난는 중앙십자선에 일치되도록 디지털 프로젝터 검사기(A)의 XY스테이지(30)를 이동시키는 XY스테이지이동단계;선택된 측정 대상물(1) 설계 정보(CAD)를 기반으로 X축과 Y축이 만난는 중앙십자선 근처의 측정 대상물(1) 형상을 자동으로 감지하는 형상자동감지단계;선택된 측정 대상물(1) 설계 정보(CAD)의 형상을 기반으로 비디오창(S100) 내에서 원, 호, 선형상으로 수치해석하는 형상해석단계;상기 형상해석단계를 거쳐서 데이텀(datum) 참조 개체로 설정하고 데이텀 개체가 2개일 경우에 데이텀 개체를이용해 측정 대상물의 회전정보와 이동정보를 해석하는 측정대상물 해석단계;상기 형상해석단계를 거쳐서 데이텀(datum) 참조 개체로 설정하고 데이텀 개체가 2개가 아닐 경우에 상기 정렬개체 선택단계로 되돌아가는 복귀단계;해석된 정보를 이용해 설계 정보(CAD)를 비디오창(S100)에 중첩 출력하는 중첩출력단계;중첩출력단계 이후 설계 정보(CAD)와 중첩된 측정 대상물(1) 형상과의 떨어진 거리나 각도가 지정된 값 이상이면 중첩출력창(S200)을 통해 경고하고 주의 메시지를 출력하며 비디오창(S100)에 이상부위의 영역과 측정값을출력하는 경고및메시지출력단계; 및상기 비디오창(S100)에 보이는 설계 정보(CAD)를 기반으로 하는 측정 대상물(1) 형상의 표면불량이나 불량패턴을 포함하는 스크래치의 검사가 인공지능(Deep Learning)을 기반으로 실시간으로 이루어지는 인공지능 화면검사단계;를 포함하는 디지털 프로젝터 검사기를 이용한 검사방법."}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 측정 대상물 직상부에 위치되어 측정 대상물을 찍고 광학 영상을 디지털화시켜 유선 또는 무선으로 연 결된 컴퓨터로 전송하는 디지털 카메라; 상기 디지털 카메라와 연결되어 상기 측정 대상물을 저배율에서 고배율 까지 다양한 배율로 관찰하는 광학 줌 렌즈; 상기 디지털 카메라와 연결되어 상부에서 상기 측정 대상물로 조사 (뒷면에 계속)"}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 프로젝터 검사기 및 이를 이용한 검사방법에 관한 것으로서, 보다 상세하게는 기존의 프로젝 터 및 측정 현미경, 비접촉 AOI(Automated Optical Inspection)의 단점을 개선하여 제품 가공 상태의 불량 유 무의 검증을 빠르게 육안 검사만으로 진행할 수 있고 더 나아가 정밀하게 측정 할 수 있는 디지털 프로젝터 검 사기 및 이를 이용한 검사방법에 관한 것이다."}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 스마트폰 및 전기/전자 부품들은 소비자의 요구에 의해 다양화, 정밀화, 소형화되는 반면에 제품의 라이프 사이클은 점점 짧아 지고 있다. 이러한 요구사항을 충족시키기 위해서는 부품을 생산하는 정밀 금형의 품질이 우선되어야 한다. 따라서 정밀 금형 제작 과정도 중요하지만 제작 후 품질 측정 환경 또는 장비를 이용해 금형 품질을 보증해야 한다. 이러한 정밀 금형을 측정하기 위해서 투영기(프로젝터), 측정 현미경, 비접촉 AOI(Automated Optical Inspection), 마이크로 메터등이 널리 사용되고 있다. 기존 투영기(또는 프로젝터)는 광학 영상을 스크린에 투영시키고, 캐드 도면을 프린트하여 투영된 영상에 겹쳐 관찰/측정하는 방식으로, 이런 티지털 프로젝터는 광학 영상을 디지털 카메라를 이용해 컴퓨터로 전송하고, 전 송된 디지털 영상을 관찰 및 자동 측정할 수 있는 장치이다. 또한 파일로 저장되어 있는 캐드 도면을 불러와 디지털 영상에 겹쳐 출력하여 빠르고 정확하게 관찰 및 자동 측 정하는 장치이다. 그러나, 전기/전자 부품들의 시장 특성상 정밀 금형의 다품종 소량 생산의 비율이 매우 높아 상기의 측정기들을 이용해 금형을 측정하는 방식은 시간이 오래 소요되고 정확도가 떨어지며 능숙한 숙련도를 갖는 작업자를 찾기 가 어려워 작업효율이 매우 떨어지는 문제점이 있었다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허 등록번호 10-0174940호"}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로서, 기존의 투영기(프로젝터) 및 측정 현미경, 비접촉 AOI(Automated Optical Inspection)의 단점을 개선하여 제품 가공 상태의 불량 유무의 검증을 빠르게 육안 검사 만으로 진행할 수 있고 더 나아가 정밀하게 측정 할 수 있는 디지털 프로젝터 검사기 및 이를 이용한 검사방법 을 제공함에 그 목적이 그 목적이 있다. 또한, 다양한 정밀 금형 검사를 신속하고 정확하게 이루어 지도록 하고, 검사 준비 과정에서의 시간 지연과 검 사 과겅에서의 오류가 발생되지 않도록 한 디지털 프로젝터 검사기 및 이를 이용한 검사방법을 제공함에 다른 목적이 있다. 본 발명이 해결하고자 하는 과제는 이상에 언급한 과제들에 제한되지 않으며, 언급되지 않는 또 다른 과제들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이와 같은 목적을 달성하기 위하여, 본 발명의 디지털 프로젝터 검사기는, 측정 대상물 직상부에 위치되어 측정 대상물을 찍고 광학 영상을 디지털화시켜 유선 또는 무선으로 연결된 컴퓨터로 전송하는 디지털 카메라; 상기 디지털 카메라와 연결되어 상기 측정 대상물을 저배율에서 고배율까지 다양한 배율로 관찰하는 광학 줌 렌 즈; 상기 디지털 카메라와 연결되어 상부에서 상기 측정 대상물로 조사되는 링조명; 상기 디지털 카메라와 연결되어 고배율에서도 상기 측정 대상물의 초점을 선명하게 자동으로 맞추는 오토포커스 장치; 상기 측정 대상물 경계부위의 측정 정확도를 높이기 위해서 하부에서 측정 대상물로 조사되는 백라이트; 상기 디지털 카메라과 광학 줌 렌즈 및 링조명을 포함하는 광학계 전체를 Z축으로 수직으로 이동시키는 Z스테이 지; 및 상기 측정 대상물이 상면 중심에 위치되고 상기 백라이트 조명을 투과시키는 투명유리를 갖고 상기 측정 대상물 을 X축 또는 Y축으로 이동시키고 그 위치 정보를 인식하는 XY스테이지를 구비하는 특징이 있다. 또한, 상기 컴퓨터는, 실시간 비디오로 확대 관찰하는 비디오창; 상기 디지탈 카메라로 부터 받은 측정 대상물의 실물 영상과 내부에 미리 제작되어 저장된 측정 대상물의 설계 정보(CAD)를 중첩해서 상기 비디오창으로 중첩 출력시키는 중첩출력창; 상기 비디오창과는 별도로 인접되어 내부에 미리 제작되어 저장된 측정 대상물의 설계 정보(CAD)을 보여주는 캐 드 원본 보기창; 상기 비디오창 및 캐드 원본 보기창과는 별도로 인접되어 상기 중첩출력창에서 검사된 영역과 불량 정보를 전체 적으로 보여주는 검사된 영역창; 및 상기 비디오창과 캐드 원본 보기창 및 검사된 영역창과 별도로 측정 대상물의 현재 위치를 XY 좌표로 보여주는 스테이지 좌표 창;을 포함하는 특징이 있다. 또한, 본 발명의 디지털 프로젝터 검사기를 이용한 검사방법은, 디지털 프로젝터 검사기의 XY스테이지 투명유리 상면에 측정 대상물을 위치시키는 측정 대상물 정위치단계;컴퓨터를 구동시켜 측정 대상물의 설계 정보(CAD)를 활성화시키는 설계정보 활성화단계; 컴퓨터의 불량검사 프로그램창을 활성화시키는 프로그램창 활성화단계; 상기 불량검사 프로그램창의 캐드 원본 보기창에 디지털 카메라로부터 제공된 측정 대상물의 설계 정보(CAD)를 선택하여 띄우는 설계정보 띄움단계; 상기 불량검사 프로그램창 캐드 원본 보기창의 측정 대상물 설계 정보(CAD)에서 정렬개체를 선택하는 정렬개체 선택단계; 상기 정렬개체 선택단계에서 선택된 개체에 해당되는 측정 대상물의 영역이 비디오창의 X축과 Y축이 만난는 중 앙십자선에 일치되도록 디지털 프로젝터 검사기의 XY스테이지를 이동시키는 XY스테이지이동단계; 선택된 측정 대상물 설계 정보(CAD)를 기반으로 X축과 Y축이 만난는 중앙십자선 근처의 측정 대상물 형상을 자 동으로 감지하는 형상자동감지단계; 선택된 측정 대상물 설계 정보(CAD)의 형상을 기반으로 비디오창 내에서 원, 호, 선형상으로 수치해석하는 형상 해석단계; 상기 형상해석단계를 거쳐서 데이텀(datum) 참조 개체로 설정하고 데이텀 개체가 2개일 경우에 데이텀 개체를 이용해 측정 대상물의 회전정보와 이동정보를 해석하는 측정대상물 해석단계; 상기 형상해석단계를 거쳐서 데이텀(datum) 참조 개체로 설정하고 데이텀 개체가 2개가 아닐 경우에 상기 정렬 개체 선택단계로 되돌아가는 복귀단계; 해석된 정보를 이용해 설계 정보(CAD)를 비디오창에 중첩 출력하는 중첩출력단계; 중첩출력단계 이후 설계 정보(CAD)와 중첩된 측정 대상물 형상과의 떨어진 거리나 각도가 지정된 값 이상이면 중첩출력창을 통해 경고하고 주의 메시지를 출력하며 비디오창에 이상부위의 영역과 측정값을 출력하는 경고및 메시지출력단계; 및 상기 비디오창에 보이는 설계 정보(CAD)를 기반으로 하는 측정 대상물 형상의 표면불량이나 불량패턴을 포함하 는 스크래치의 검사가 인공지능(Deep Learning)을 기반으로 실시간으로 이루어지는 인공지능 화면검사단계;를 포함하는 특징이 있다."}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같이, 본 발명은 기존의 프로젝터 및 측정 현미경, 비접촉 AOI(Automated Optical Inspection)의 단점을 개선하여 제품 가공 상태의 불량 유무의 검증을 빠르게 육안 검사만으로 진행할 수 있고 더 나아가 정밀하게 측 정 할 수 있으며, 다양한 정밀 금형 검사를 신속하고 정확하게 이루어 지도록 하고, 검사 준비 과정에서의 시간 지연과 검사 과정에서의 오류가 발생되지 않도록 하는 효과가 있다. 본 발명은 상술한 특정의 바람직한 실시 예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗"}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "어남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실시가 가능한 것은 물론이고, 그와 같은 변경은 청구범위 기재의 범위 내에 있게 된다."}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 첨부된 도면에 의해 보다 상세하게 설명하면 다음과 같다."}
{"patent_id": "10-2018-0140367", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하, 첨부한 도면을 참조하여 본 발명의 실시 예에 대하여 본 발명에 속하는 기술분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동 일 또는 유사한 구성요소에 대해서는 동일한 참조부호를 붙였다. 본 발명의 권리범위는 본문에 설명된 실시 예 에 의하여 제한되는 것으로 해석되어서는 아니되며, 실시 예는 다양한 변경이 가능하고 여러 가지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 본 발명의 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우 뿐만 아니라, 다른 부재를 사이에 두고 \"간접적으로 연결\"된 것도 포함한다. 또한, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 발명에서 사용되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어들로서, 이는 사용자, 운용자의 의 도 또는 관례에 따라 달라질 수 있으므로, 이러한 용어들에 대한 정의는 본 발명의 기술적 사항에 부합되는 의 미와 개념으로 해석되어야 할 것이다. 그리고, 아래 실시 예에서의 선택적인 용어는 하나의 구성요소를 다른 구성요로부터 구별하기 위해 사용되는 것으로서, 구성요소가 상기 용어들에 의해 제한되는 것은 아니다. 이하, 본 발명을 설명함에 있어서, 본 발명의 요지를 불필요하게 흐릴 수 있는 관련된 공지기술에 대한 상세한 설명은 생략한다. 본 발명의 디지털 프로젝터 검사기(A)는, 디지털 카메라와, 광학 줌 렌즈와, 링조명과, 오토포 커스 장치와, 백라이트와, Z스테이지와, XY스테이지로 구성된다. 상기 디지털 카메라는, 측정 대상물 직상부에 위치되어 측정 대상물을 찍고 광학 영상을 디지털화시 켜 유선 또는 무선으로 연결된 컴퓨터로 전송한다. 상기 광학 줌 렌즈는, 상기 디지털 카메라와 연결되어 상기 측정 대상물을 저배율에서 고배율까지 다양한 배율로 관찰한다. 상기 링조명은, 상기 디지털 카메라와 연결되어 상부에서 상기 측정 대상물로 조사된다. 상기 오토포커스 장치는, 상기 디지털 카메라와 연결되어 고배율에서도 상기 측정 대상물의 초점 을 선명하게 자동으로 맞춘다. 상기 백라이트는, 상기 측정 대상물 경계부위의 측정 정확도를 높이기 위해서 하부에서 측정 대상물 로 조사된다. 상기 Z스테이지는, 상기 디지털 카메라과 광학 줌 렌즈 및 링조명을 포함하는 광학계 전체 를 Z축으로 수직으로 이동시킨다. 상기 XY스테이지는, 상기 측정 대상물이 상면 중심에 위치되고 상기 백라이트 조명을 투과시키는 투명유리를 갖고 상기 측정 대상물을 X축 또는 Y축으로 이동시키고 그 위치 정보를 인식한다. 상기 컴퓨터에는, 실시간 비디오로 확대 관찰하는 비디오창(S100)과, 상기 디지탈 카메라로 부터 받은 측정 대상물의 실물 영상과 내부에 미리 제작되어 저장된 측정 대상물의 설계 정보(CAD)를 중첩해서 상기 비디오창(S100)으로 중첩 출력시키는 중첩출력창(S200)과, 상기 비디오창(S100)과는 별도로 인접되어 내부에 미 리 제작되어 저장된 측정 대상물의 설계 정보(CAD)을 보여주는 캐드 원본 보기창(S300)과, 상기 비디오창 (S100) 및 캐드 원본 보기창(S300)과는 별도로 인접되어 상기 중첩출력창(S200)에서 검사된 영역과 불량 정보를 전체적으로 보여주는 검사된 영역창(S400)과, 상기 비디오창(S100)과 캐드 원본 보기창(S300) 및 검사된 영역창 (S400)과 별도로 측정 대상물의 현재 위치를 XY 좌표로 보여주는 스테이지 좌표 창(S500)를 포함하는 불량검 사 프로그램창이 구비된다. 또한, 본 발명의 디지털 프로젝터 검사기를 이용한 검사방법은, 측정 대상물 정위치단계(a)와, 설계정보 활성화 단계(b)와, 프로그램창 활성화단계(c)와, 설계정보 띄움단계(d)와, 정렬개체 선택단계(e)와, XY스테이지이동단 계(f)와, 형상자동감지단계(g)와, 형상해석단계(h)와, 측정대상물 해석단계(i)와, 경고및메시지출력단계(l)와, 인공지능 화면검사단계(m)로 이루어진다. 상기 측정 대상물 정위치단계(a)는, 디지털 프로젝터 검사기(A)의 XY스테이지 투명유리 상면에 측정 대 상물을 위치시키는 단계이다. 상기 설계정보 활성화단계(b)는, 컴퓨터를 구동시켜 측정 대상물의 설계 정보(CAD)를 활성화시키는 단계 이다. 상기 프로그램창 활성화단계(c)는, 컴퓨터의 불량검사 프로그램창을 활성화시키는 단계이다. 상기 설계정보 띄움단계(d)는, 상기 불량검사 프로그램창의 캐드 원본 보기창(S300)에 디지털 카메라로 부터 제공된 측정 대상물의 설계 정보(CAD)를 선택하여 띄우는 단계이다. 상기 정렬개체 선택단계(e)는, 상기 불량검사 프로그램창 캐드 원본 보기창(S300)의 측정 대상물 설계 정 보(CAD)에서 정렬개체를 선택하는 단계이다. 상기 XY스테이지이동단계(f)는, 상기 정렬개체 선택단계에서 선택된 개체에 해당되는 측정 대상물의 영역이 비디오창(S100)의 X축과 Y축이 만난는 중앙십자선에 일치되도록 디지털 프로젝터 검사기(A)의 XY스테이지를 이동시키는 단계이다. 상기 형상자동감지단계(g)는, 선택된 측정 대상물 설계 정보(CAD)를 기반으로 X축과 Y축이 만난는 중앙십자 선 근처의 측정 대상물 형상을 자동으로 감지하는 단계이다. 상기 형상해석단계(h)는, 선택된 측정 대상물 설계 정보(CAD)의 형상을 기반으로 비디오창(S100) 내에서 원, 호, 선형상으로 수치해석하는 단계이다. 상기 측정대상물 해석단계(i)는, 상기 형상해석단계를 거쳐서 데이텀(datum) 참조 개체로 설정하고 데이텀 개체 가 2개일 경우에 데이텀 개체를 이용해 측정 대상물의 회전정보와 이동정보를 해석하는 단계이다. 상기 형상해석단계를 거쳐서 데이텀(datum) 참조 개체로 설정하고 데이텀 개체가 2개가 아닐 경우에 상기 정렬 개체 선택단계로 되돌아가는 복귀단계(j); 해석된 정보를 이용해 설계 정보(CAD)를 비디오창(S100)에 중첩 출력하는 중첩출력단계(k); 상기 경고및메시지출력단계(l)는, 중첩출력단계 이후 설계 정보(CAD)와 중첩된 측정 대상물 형상과의 떨어진 거리나 각도가 지정된 값 이상이면 중첩출력창(S200)을 통해 경고하고 주의 메시지를 출력하며 비디오창(S100) 에 이상부위의 영역과 측정값을 출력하는 단계이다. 상기 인공지능 화면검사단계(m)는, 상기 비디오창(S100)에 보이는 설계 정보(CAD)를 기반으로 하는 측정 대상물 형상의 표면불량이나 불량패턴을 포함하는 스크래치의 검사가 인공지능(Deep Learning)을 기반으로 실시간 으로 이루어지는 단계이다. 이러한 본 발명은, 검사자가 디지털 프로젝터 검사기(A)의 투명유리 상면에 측정 대상물을 올려 놓고, 컴퓨터의 설계 정보(CAD)를 활성화시킨 다음, 불량검사 프로그램창을 활성화시켜 캐드원본보기창(S300)에 설계 정보(CAD)를 띄운다. 그 다음, 캐드원본보기창(S300)에서 정렬개체를 선택하면, 선택된 개체에 해당되는 영역으로 XY스테이지가 이동하고, 이때 작업자가 비디오창(S100)에서 해당 영역이 화면의 중앙십자선에 닿도록 이동시키면, 불량검사 프로그램은 중앙십자선 근처의 형상을 자동으로 감지하여 선택된 설계 정보(CAD) 개체의 형상을 기반으로, 원, 호, 선 형상으로 해석하여 데이텀 참조 개체로 설정한다. 설정된 데이텀 참조 개체가 2개가 아니면, 다시 캐드원본보기창(S300)에서 정렬 개체를 선택는 단계로 복위하여 다시 진행하고, 설정된 데이텀 참조 개체가 2개이면, 데이텀 개체를 이용해 측정 대상물의 회전정보와 이동 정보를 해석하며, 해석된 정보를 이용하여 설계 정보(CAD)를 비디오창(S100)에 중첩출력한다. 이 상태에서 비디오창(S100) 화면에 보이는 설계 정보(CAD)를 기반으로 주변 에지를 탐색하여, 설계 정보(CAD) 와 에지의 떨어진 거리나 각도 등이 지정된 값 이상이면 화면을 통해 사용자에게 경고하고, 주의 메시지를 출력 하며, 비디오 창(S100)에 이상부위의 영역과 측정 값을 출력한다. 그리고, 검사 자료를 남기기 위해서는 사용자는 키보드의 엔터키나 별도로 제공되는 버튼을 눌러 검사된 영역 창(S400)에 정보를 남긴다. 이렇게 비디오창(S100) 화면에 보이는 설계 정보(CAD)를 기반으로 주변 에지 형상의 찍힘(표면 불량), 스크레치 등을 실시간으로 검사함에 있어, 인공지능(Deep Learning)을 기반으로 구현되며, 사용자가 추가적으로 불량 패턴(형상)등을 추가할 수도 있음은 물론이다. 본 실시예 및 본 명세서에 첨부된 도면은 본 발명에 포함되는 기술적 사상의 일부를 명확하게 나타내고 있는 것 에 불과하며, 본 발명의 명세서 및 도면에 포함된 기술적 사상의 범위 내에서 당업자가 용이하게 유추할 수 있 는 변형예와 구체적인 실시예는 모두 본 발명의 기술적 사상의 범위에 포함되는 것은 자명하다. 본 발명의 범위는 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2018-0140367", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명 실시 예인 디지털 프로젝터 검사기의 정면 모습과 측면 모습을 보인 설명도, 도 2는 본 발명 실시 예인 디지털 프로젝터 검사기를 통해 구현되는 컴퓨터 불량검사프로그램창의 모습을 보인 설명도, 도 3은 본 발명 실시 예인 디지털 프로젝터 검사기를 이용한 검사방법을 보인 순서도."}
