{"patent_id": "10-2023-0124086", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0041402", "출원번호": "10-2023-0124086", "발명의 명칭": "회생 제동 방법을 채용한 세탁기", "출원인": "삼성전자주식회사", "발명자": "안효민"}}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "케이스;상기 케이스의 상부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구;상기 세탁물 투입구에 부착된 문;상기 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조;상기 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조; 및 상기 회전조를 회전시키는 모터를 구동하기 위한 전력변환장치를 포함하되, 상기 전력변환장치는,세탁기에 전원을 공급하는 입력전원,상기 입력전원의 교류전압을 정류하는 제 1 정류기,상기 제 1 정류기에 의해 정류된 직류전압을 평활화하는 DC 링크 커패시터,상기 DC 링크 커패시터에 의해 평활화된 직류전압을 상기 모터 구동을 위한 교류전압으로 변환하는 인버터,상기 인버터에 의해 변환된 교류전압에 의해 구동되어 상기 회전조를 회전시키는 상기 모터,상기 DC 링크 커패시터 양단 또는 상기 입력전원과 연결되어 부하에 공급되는 직류전압을 생성하는 제 1 전력변환기,상기 제 1 전력변환기에 의해 생성된 직류전압에 의해 구동될 수 있는 상기 부하, 상기 DC 링크 커패시터 양단에 연결되며, 상기 DC 링크 커패시터 양단 전압이 상기 모터의 감속에 따른 회생 제동에 의해 제 1 소정의 전압 이상이 되는 것에 기초하여 상기 DC 링크 커패시터의 직류전압을 변환하여 에너지저장 장치에 충전하는 제 2 전력변환기, 및상기 제 1 전력변환기와 상기 제 2 전력변환기의 동작을 제어하는 프로세서를 포함하는 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 제 1 전력변환기가 상기 입력전원과 연결되는 경우 상기 제 1 전력변환기는 상기 입력전원의 교류전압을직류전압으로 변환하기 위한 제 2 정류기를 포함하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 에너지 저장 장치의 직류전압을 상기 부하에 공급하는 직류전압으로 변환하는 제 3 전력변환기를 더 포함하고, 상기 프로세서는 상기 제 3 전력변환기(1160)를 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 제 1 전력변환기와 상기 부하 사이에 제 1 다이오드; 및상기 제 3 전력변환기와 상기 부하 사이에 제 2 다이오드를 포함하되, 상기 제 3 전력변환기에 의해 변환된 직류전압이 상기 제 1 전력변환기에 의해 변환된 직류전압보다 소정의 전압보다 크면, 상기 제 2 다이오드에 의해상기 제 3 전력변환기에 의해 변환된 직류전압이 상기 부하에 공급되는 전압으로 선택되는, 세탁기.공개특허 10-2025-0041402-3-청구항 5 제 3 항에 있어서, 상기 제 2 전력변환기의 입력과 상기 제 2 전력변환기의 출력이 전기적으로 절연되는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서, 상기 제 3 전력변환기의 입력과 상기 제 3 전력변환기의 출력이 전기적으로 절연되는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항에 있어서,상기 제 2 전력변환기와 상기 제 3 전력변환기는 각각 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터인, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 제 2 전력변환기는 양방향으로 직류전압을 다른 레벨의 직류전압으로 변환하는 양방향 벅-부스트컨버터인, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 프로세서는 상기 모터의 감속에 따른 회생 제동이 발생하지 않거나 상기 모터를 구동하기 위한 전력이 요구된다는 판단에 기초하여, 상기 에너지 저장 장치에 충전된 전력을 상기 DC 링크 커패시터로 전달하도록 상기양방향 벅-부스트 컨버터를 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서, 상기 프로세서는 상기 모터를 재기동하기 위한 전력이 요구되는 것에 기초하여 상기 에너지 저장 장치에 충전된전력을 상기 DC 링크 커패시터로 전달하도록 상기 양방향 벅-부스트 컨버터를 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8 항에 있어서, 상기 프로세서는 상기 DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되는 것에 기초하여, 상기 에너지저장 장치에 충전된 전력을 상기 DC 링크 커패시터로 전달하도록 상기 양방향 벅-부스트 컨버터를 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 프로세서는 상기 DC 링크 커패시터의 전압이 제 3 소정의 값이 되는 것에 기초하여, 상기 에너지 저장 장치로부터 상기 DC 링크 커패시터로의 에너지 충전을 중단하도록 상기 양방향 벅-부스트 컨버터를 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서, 통신부; 및 공개특허 10-2025-0041402-4-입력 인터페이스와 출력 인터페이스를 포함하는 사용자 인터페이스를 더 포함하되,상기 부하는 상기 프로세서, 상기 통신부 및 상기 사용자 인터페이스 중 적어도 하나를 포함하는 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 통신부는 Wi-Fi 통신부를 포함하고, 상기 프로세서는 상기 회생 제동에 의해 발생한 전력을 Wi-Fi 통신을 위해 상기 Wi-Fi 통신부 구동에 사용하도록 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항에 있어서,상기 프로세서는 상기 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장치에 충전한 후, 상기 DC 링크커패시터 양단 전압이 소정의 전압 지령을 유지하도록 제어하는, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 프로세서가 상기 DC 링크 커패시터 양단 전압이 상기 소정의 전압 지령을 유지하도록 제어하는 동안, 상기에너지 저장 장치에 충전되는 전류값은 일정한, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15 항에 있어서,상기 소정의 전압 지령은 상기 소정의 전압보다 작거나 같은, 세탁기."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "케이스,상기 케이스의 상부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구,상기 세탁물 투입구에 부착된 문,상기 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조,상기 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조, 및 상기 회전조를 회전시키는 모터(1800)를 구동하기 위한 전력변환장치를 포함하는 세탁기에서 회생 제동 에너지를 제어하는 방법으로서, 상기 방법은,입력전원의 교류전압을 직류전압으로 정류하는 단계;상기 직류전압을 DC 링크 커패시터에 의해 평활화하는 단계;상기 평활화된 직류전압을 인버터에 의해 모터 구동을 위한 교류전압으로 변환하는 단계;상기 변환된 교류전압에 의해 모터를 구동하여 상기 회전조를 회전시키는 단계; 및상기 모터의 감속에 따른 회생 제동에 의해 상기 DC 링크 커패시터의 전압이 제 1 소정의 전압 이상이 되면 상기 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장치에 충전하는 단계를 포함하는 세탁기에서 회생 제동 에너지를 제어하는 방법."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서, 상기 DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되면 상기 에너지 저장 장치에서 상기 DC 링크 커패공개특허 10-2025-0041402-5-시터로 에너지를 방전하는 단계를 더 포함하는 세탁기에서 회생 제동 에너지를 제어하는 방법."}
{"patent_id": "10-2023-0124086", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서, 상기 DC 링크 커패시터의 전압이 제 3 소정의 전압이 되면 상기 에너지 저장 장치에서 상기 DC 링크 커패시터로의 에너지 방전을 중단하는 단계를 더 포함하는 세탁기에서 회생 제동 에너지를 제어하는 방법."}
{"patent_id": "10-2023-0124086", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 모터 회생 제동 구성을 포함하는 세탁기는 직류전압을 감압할 수 있는 감압 전력변 환기를 이용하여 DC 링크 커패시터의 전압이 소정의 전압 이상이 되면 이를 에너지 저장 장치로 충전하고, DC 링 크 커패시터의 전압이 떨어지면 에너지 저장 장치를 방전시켜 DC 링크 커패시터를 충전하게 된다. 또한, 세탁기 는 전력변환장치를 이용하여 에너지 저장 장치로부터 부하로 감압 또는 승압하여 회생 제동 에너지를 이용할 수 있다."}
{"patent_id": "10-2023-0124086", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 일 실시예들은 전력변환장치에 의한 회생 제동 방법과 그 방법을 채용한 세탁기에 관한 것이다."}
{"patent_id": "10-2023-0124086", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "세탁기와 같은 가전장치에서 모터를 정지시키는 방법으로, 모터의 권선 저항을 이용하여 회생 제동 에너지를 소 비시키는 방법이 있다. 또한 세탁기에서 모터를 정지시키는 방법으로 모터에서 발생하는 역기전력을 인버터의 DC 링크 커패시터로 회수하는 방법이 있다. 이 경우 DC 링크 커패시터의 전압이 상승할 수 있으므로 DC 링크 커 패시터 전압의 안정화를 위한 조치가 필요하다."}
{"patent_id": "10-2023-0124086", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 회생 제동 에너지를 제어하는 세탁기는, 케이스, 케이스의 상부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구, 세탁물 투입구에 부착된 문, 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조, 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조, 및 회전조를 회전시키는 모터를 구동하 기 위한 전력변환장치를 포함하되, 전력변환장치는, 세탁기에 전원을 공급하는 입력전원, 입력전원의 교 류전압을 정류하는 제 1 정류기(1120, 1120_1), 제 1 정류기(1120, 1120_1)에 의해 정류된 직류전압을 평활화하 는 DC 링크 커패시터, DC 링크 커패시터에 의해 평활화된 직류전압을 모터 구동을 위한 교류전압 으로 변환하는 인버터, 인버터에 의해 변환된 교류전압에 의해 구동되어 회전조를 회전시키는 모터 , DC 링크 커패시터 양단 또는 입력전원과 연결되어 부하에 공급되는 직류전압을 생성하는 제 1 전력변환기, 제 1 전력변환기에 의해 생성된 직류전압에 의해 구동될 수 있는 부하, DC 링크 커패시터 양단에 연결되며, DC 링크 커패시터 양단 전압이 모터의 감속에 따른 회생 제동에 의해 제 1 소정의 전압 이상이 되는 것에 기초하여 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장치 에 충전하는 제 2 전력변환기, 및 제 1 전력변환기와 제 2 전력변환기의 동작을 제어 하는 프로세서를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 1 전력변환기가 입력전원과 연결되는 경우 제 1 전력변환기는 입력 전원의 교류전압을 직류전압으로 변환하기 위한 제 2 정류기를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 에너지 저장 장치의 직류전압을 부하에 공급하는 직류전압으로 변환하 는 제 3 전력변환기를 더 포함하고, 프로세서는 제 3 전력변환기를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 1 전력변환기와 부하 사이에 제 1 다이오드, 및 제 3 전력변환기와 부하 사이에 제 2 다이오드를 포함하되, 제 3 전력변환기에 의해 변환된 직류전압이 제 1 전력변환기에 의해 변 환된 직류전압보다 소정의 전압보다 크면, 제 2 다이오드에 의해 제 3 전력변환기에 의해 변환된 직류전압이 부 하에 공급되는 전압으로 선택될 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 2 전력변환기의 입력과 제 2 전력변환기의 출력이 전기적으로 절연 될 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 3 전력변환기의 입력과 제 3 전력변환기의 출력이 전기적으로 절연 될 수 있다.본 개시의 일 실시예에 따른 세탁기에서, 제 2 전력변환기와 제 3 전력변환기는 각각 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터일 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 2 전력변환기는 양방향으로 직류전압을 다른 레벨의 직류전압으로 변환하는 양방향 벅-부스트 컨버터일 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 모터의 감속에 따른 회생 제동이 발생하지 않거나 모터를 구동하기 위한 전력이 요구된다는 판단에 기초하여, 에너지 저장 장치에 충전된 전력을 DC 링크 커패시터로 전 달하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 모터를 재기동하기 위한 전력이 요구되는 것에 기초하여 에너지 저장 장치에 충전된 전력을 DC 링크 커패시터로 전달하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되는 것에 기초하여, 에너지 저장 장치에 충전된 전력을 DC 링크 커패시터로 전달하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 DC 링크 커패시터의 전압이 제 3 소정의 값이 되는 것에 기초하여, 에너지 저장 장치로부터 DC 링크 커패시터로의 에너지 충전을 중단하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기는 통신부, 및 입력 인터페이스와 출력 인터페이스를 포함하는 사용자 인터 페이스를 더 포함하되, 부하는 프로세서, 통신부 및 사용자 인터페이스 중 적어도 하나를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 통신부는 Wi-Fi 통신부를 포함하고, 프로세서는 회생 제동에 의해 발 생한 전력을 Wi-Fi 통신을 위해 Wi-Fi 통신부 구동에 사용하도록 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장 치에 충전한 후, DC 링크 커패시터 양단 전압이 소정의 전압 지령을 유지하도록 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서가 DC 링크 커패시터 양단 전압이 소정의 전압 지령을 유지하 도록 제어하는 동안, 에너지 저장 장치에 충전되는 전류값은 일정한 것을 특징으로 한다. 본 개시의 일 실시예에 따른 세탁기에서, 소정의 전압 지령은 소정의 전압보다 작거나 같은 것을 특징으로 한다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법에서 세탁기는 케이스, 케이스의 상 부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구, 세탁물 투입구에 부착된 문, 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조, 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조, 및 회전조를 회전시키는 모터 를 구동하기 위한 전력변환장치를 포함하고, 방법은, 입력전원의 교류전압을 직류전압으로 정류하는 단계, 직류전압을 DC 링크 커패시터에 의해 평활화하는 단계, 평활화된 직류전압을 인버터에 의해 모터 구동을 위한 교류전압으로 변환하는 단계, 변환된 교류전압에 의해 모터를 구동하여 회전조를 회전시키는 단계, 및 모 터의 감속에 따른 회생 제동에 의해 DC 링크 커패시터의 전압이 제 1 소정의 전압 이상이 되면 DC 링크 커패시 터의 직류전압을 변환하여 에너지 저장 장치에 충전하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법에서, DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되면 에너지 저장 장치에서 DC 링크 커패시터로 에너지를 방전하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법은, DC 링크 커패시터의 전압이 제 3 소정의 전압이 되면 에너지 저장 장치에서 DC 링크 커패시터로의 에너지 방전을 중단하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0124086", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또 는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"및/또는\"이라는 용어는 복수의 관련된 기재된 구성요소들의 조합 또는 복수의 관련된 기재된 구성요소들 중의 어느 구성요소를 포함한다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. \"포함하다\" 또는 \"가지다\"등의 용어는 본 문서에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는다. 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\", \"지지\" 또는 \"접촉\"되어 있다고 할 때, 이는 구성요소들이 직접적으로 연결, 결합, 지지 또는 접촉되는 경우뿐 아니라, 제3 구성요소를 통하여 간접적으로 연결, 결합, 지 지 또는 접촉되는 경우를 포함한다. 어떤 구성요소가 다른 구성요소 \"상에\" 위치하고 있다고 할 때, 이는 어떤 구성요소가 다른 구성요소에 접해 있 는 경우뿐 아니라 두 구성요소 사이에 또 다른 구성요소가 존재하는 경우도 포함한다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시의 일 실시예는 여러 가지 상이한 형태 로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시의 일 실시예를 명 확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 본 개시 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시의 일 실시예에 의하면, 모터를 포함하는 가전장치에서 모터의 정지나 감속에 따른 회생 제동 에너지를 효율적으로 관리하는 방법 및 이러한 회생 제동 에너지 관리 방법을 채용한 가전장치를 개시한다. 또한, 모터를 포함하는 가전장치에서 모터의 정지나 감속에 따른 회생 제동 에너지에 의해 DC 링크 커패시터의 전압이 상승하 는 경우 이러한 DC 링크 커패시터의 전압 상승을 제어하여 DC 링크 커패시터를 포함한 가전장치 전체의 안전성 을 높일 수 있다. 가전장치란 가정에서 사용하는 전기 기구와 기계를 포함할 수 있다. 본 개시의 실시예에 따르면, 가전장치는 가 정 내에 고정된 상태로 배치된 장치 또는 가정 내에서 이동 가능한 장치를 포함할 수 있다. 여기서, 가정은 집 뿐만 아니라 사무실과 같이 실내 공간을 의미할 수 있다. 예를 들어, 가전장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오 토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 전자 액자, 스피커, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료 기기, 카메라 등을 포함할 수 있다. 본 개시의 일 실시예에 따른 가전장치는 특히 모터를 구동하는 가전장치를포함할 수 있다. 도 1은 본 개시의 일 실시예에 따른 가전장치의 구성을 나타내는 도면이다. 본 개시의 일 실시예에 따른 가전장치는 세탁기일 수 있다. 예를 들어, 세탁기는 세탁, 헹굼, 탈수, 건조 등의 공정으로 구성되는 세탁 과정이 자동으로 실행되도록 구성될 수 있다. 본 개시의 일 실시예에 따른 세탁기 는 세탁물 투입구가 전면에 배치되는 프론트 로더(front loader) 세탁기(예를 들어, 드럼 세탁기) 또는 세탁 물 투입구가 윗면에 배치되는 탑 로더(top loader) 세탁기(예를 들어, 통돌이 세탁기)일 수 있으며, 본 개시의 일 실시예에 따른 세탁기는 건조기를 포함할 수 있다. 도 1에 도시된 가전장치로서 세탁기는 케이스, 고정조, 회전조(4, 또는 회전체), 급수부, 배수펌프 , 구동부 및 제어부를 포함할 수 있다. 케이스는 패널 또는 프레임으로 구성되는 상자 모양의 컨테이너로 세탁기의 외곽을 구성한다. 케이스 의 전면에는 세탁물을 넣을 수 있는 세탁물 투입구(2a)가 위치하고, 세탁물 투입구(2a)에는 투명한 창을 가지는 문(2b)이 설치되어 세탁물 투입구(2a)는 문(2b)에 의해 개폐될 수 있다. 케이스의 세탁물 투입구(2a)의 위쪽 에는 사용자가 세탁기를 조작할 수 있도록 조작부(2c)가 설치될 수 있다. 고정조는 물을 저장할 수 있는 원통형의 용기로 구성되며, 열려있는 한쪽 입구가 세탁물 투입구(2a)와 연결 되어 케이스의 내부에 설치된다. 고정조는, 중심축(회전축)이 도면상의 점선과 같이 경사진 상태로, 케이 스의 내부에 설치된 댐퍼(미도시)에 의해 지지될 수 있다. 회전조는 고정조 보다 작은 직경을 갖는 원통형 컨테이너로 이루어지며, 고정조와 중심축이 일치되도 록 고정조에 설치된다. 도 1에 도시된 실시예에 따르면, 회전조는 중심 축이 세탁기의 정면 방향으로 수평에서 위쪽으로 경사진 상태로 회전하도록 되어 있다. 회전조의 전면부에는 세탁물 투입구(2a)와 마주하 는 원형 개구(4a)가 형성된다. 세탁물은 세탁물 투입구(2a) 및 원형 개구(4a)를 통해 회전조의 내부로 투입 될 수 있다. 회전조의 측면에는 다수의 탈수 구멍(4b, 도 1에서는 일부만 표시)가 사방에 걸쳐 형성되고, 회전조 측면 의 내부에는 교반용 리프터(4c)들이 장착될 수 있다. 또한, 회전조는 전면의 세탁물 투입구(2a)에 회전 가능 한 상태로 지지되어 있다. 급수부는, 고정조의 상부에 설치되며 급수관(5a)과 급수밸브(5b) 및 세제 투입부(5c)를 포함할 수 있다. 급수관(5a)의 위쪽 끝은 세탁기 외부의 급수원(미도시)에 연결되며 아래쪽 끝은 고정조의 급수구(3a)와 연결된다. 급수밸브(5b) 및 세제 투입부(5c)는 위쪽으로부터 순서대로 급수관(5a)의 중간에 설치될 수 있다. 세 제 투입부(5c)는 세제와 섬유유연제 등을 수용하고 이들을 물과 함께 고정조에 투입할 수 있다. 배수펌프는, 고정조 하부에 위치하며 배수구(3b)를 통해 고정조와 연결될 수 있다. 배수펌프는 고 정조에서 불필요한 물을 하수구(6a)를 통해 세탁기의 외부로 배출하는 역할을 한다. 구동부는, 고정조의 하단에 장착되며, 유닛 베이스(7a), 샤프트(7b), 모터(7c) 등을 포함할 수 있다. 유닛 베이스(7a)는 고정조의 하단에 위치하며, 일 실시예에 따르면 원반 모양의 금속과 수지의 부재로 이루 어질 수 있다. 유닛 베이스(7a)의 중심에는 회전축(J)을 따라 늘어나는 원통 형태의 축 삽입 구멍이 형성될 수 있으며 축 삽입 구멍의 양단부에는 한 쌍의 볼 베어링(미도시)이 장착된다. 샤프트(7b)는 회전 가능하도록 유닛 베이스(7a)에 지지된다. 도 1에 도시된 실시예에서는, 유닛 베이스(7a)의 축 삽입 구멍에 설치된 한쌍의 볼 베어링에 의해 지지된다. 그러면, 샤프트(7b)는 회전축(J)을 중심으로 회전할 수 있다. 샤프트(7b)는 고정조의 후면을 관통하여 고정조의 내부로 돌출될 수 있으며 샤프트(7b)의 끝은 회전조의 하단 중앙에 고정된다. 예를 들어, 회전조의 후면부는 샤프트(7b)에 의해 회전축(J)을 중심으로 지지된다. 구동부가 회전조를 직접 구동함으로써 회전조는 모터(7c)의 구동에 따라 회전축(J)을 중심 으로 회전한다. 일 실시예에 따르면, 회전축(J)은 고정조의 중심선, 회전조의 중심선, 및 샤프트(7b)의 축선과 일치한다. 또한 회전축(J)은 수평 방향에 대하여 경사지거나 또는 수평 방향의 연장선에 위치하도록 배치된다. 모터(7c)는 회전조를 회전 구동한다. 일 실시예에 따르면, 모터(7c)는 회전조에 고정된 샤프트(7b)를 회 전시키며, 샤프트(7b)의 회전에 의해 회전조가 회전한다. 또한, 모터(7c)의 시간당 회전수는 가변적일 수 있 다.세탁기의 제어부는 세탁기 내부에 위치할 수 있으며, 세탁기의 동작을 종합적으로 제어한다. 예를 들어, 제어부는 프로세서 등이 PCB(인쇄 회로 기판)에 실장된 형태일 수 있다. 제어부는 프로세서(혹은 마이컴)이나, 메모리 등의 하드웨어와, 제어 프로그램 등의 소프트웨어를 포함할 수 있다. 예를 들어, 제어부 는 세탁기 내 구성요소들의 동작을 제어하기 위한 알고리즘, 프로그램 형태의 데이터를 저장하는 적어도 하 나의 메모리, 및 적어도 하나의 메모리에 저장된 데이터를 이용하여 전술한 동작을 수행하는 적어도 하나의 프 로세서를 포함할 수 있다. 메모리와 프로세서는 각각 별개의 칩으로 구현될 수 있다. 프로세서는 1 또는 2이상 의 프로세서 칩을 포함하거나 또는 1 또는 2이상의 프로세싱 코어를 포함할 수 있다. 메모리는 1 또는 2이상의 메모리 칩을 포함하거나 또는 1 또는 2이상의 메모리 블록을 포함할 수 있다. 또한, 메모리와 프로세서는 단일 칩으로 구현될 수도 있다. 도 2a는 본 개시의 일 실시예에 따른 가전장치에서 인버터와 모터를 간략하게 나타낸 도면이다. 본 개시에서는 가전장치가 포함하는 모터 정지 시에 모터의 역기전력으로 인해 발생하는 에너지를 회수하고 저장하는 방법과 그러한 방법을 채용한 가전장치에 대해서 기술한다. 가전장치는 세탁기를 포함할 수 있다. 본 개시 전반에 걸쳐 '에너지'는 '전력'이라는 용어와 서로 호환되어 사용될 수 있다. 도 2a는 가전장치 내에서 인버터와 모터 연결을 간략하게 도시하고 있다. 인버터는 3상 인버터인 경우 도 2a에서는 보는 바와 같이 6개의 스위치 SW1, SW2, SW3, SW4, SW5, SW6를 포함할 수 있다. 인버터는 PWM(pulse width modulation) 스위칭에 의해 직류전압을 교류전압으로 변환하여 모터를 구동할 수 있다. 도 2a에서 인버터와 모 터를 3상 인버터와 3상 모터로 각각 도시하였으나, 이에 제한되는 것은 아니고, 인버터와 모터 는 단상 인버터와 단상 모터일 수 있다. 도 2a에 도시되지는 않았으나 인버터의 입력단은 DC 링크 커패시터에 의해 직류전압이 확립되어 있을 수 있다. 본 개시 전반에 걸쳐 인버터와 컨버터(DC/DC 컨버터 포함), 정류기(AC-DC 정류기)는 전력변환기 혹은 전력변환 장치로 지칭될 수 있다. 도 2b는 본 개시의 일 실시예에 따른 가전장치에서 인버터와 모터의 등가회로를 나타낸 도면이다. 도 2b에서 모터는 모터 등가회로로 대체될 수 있다. 모터 등가회로는 3상 권선마다 저항과 인덕턴스, 그리고 역기전력 전원을 포함할 수 있다. 가전장치의 모터를 정지시키는 방식으로 모터의 3상 권선을 단락(short)시켜 모터의 회전 에 너지를 3상 권선의 저항에서 소모시키는 단락 제동(short braking) 방식이 사용될 수 있다. 이 때 모터의 기계 운동 에너지는 모두 3상 권선의 저항에서 열로 소모된다. 도 2c는 본 개시의 일 실시예에 따른 가전장치에서 모터의 단락 제동 시 등가회로이다. 도 2c를 참조하면, 모터의 단락 제동을 위해 가전장치는 인버터의 각 레그에서 상단 스위치 SW1, SW3, SW5는 모두 오프(off)시키고, 각 레그에서 하단 스위치 SW2, SW4, SW6은 모두 온(on)시킨다. 각 스위치의 온/오프는 가전장치의 프로세서나 구동 프로세서에 의해 이루어질 수 있다. 이러한 스위치 온/오프 동작에 의해 도 2c와 같이 모터의 단락 제동 시 등가회로가 얻어질 수 있다. 도 2c에 따른 등가회로는 결국 도 2d에 따른 단락 제동 시 등가회로와 동일한 회로가 된다. 도 2d는 본 개시의 일 실시예에 따른 가전장치에서 모터의 단락 제동 시 등가회로이다. 도 2d에 따르면 모터의 3상 권선이 서로 단락(short)되어 연결되므로, 모터가 정지할 때 발생하는 역기전력은 3상 권선의 저항에서 소비될 수 밖에 없다. 모터의 단락 제동 방법은 비교적 간단하다는 장점 은 있으나, 모터 정지 시에 발생하는 에너지를 활용하지 못하고 모두 열로 소비해버린다는 단점이 있다. 모터의 정지 시 발생하는 에너지를 활용할 수 있는 정지 방법으로 회생 제동(regenerative braking) 방식 이 있으며, 모터 정지 시 발생하는 에너지를 가전장치가 회수하면서 모터를 정지시킨다. 이러한 회 생 제동 방식은 모터 정지 시 발생하는 에너지를 재차 활용할 수 있으므로 에너지 소비 측면에서 더 효율 적이다. 본 개시에서는 가전장치에 포함된 모터의 제동 시 발생하는 에너지를 회수할 수 있도록 하는 회 로 구성과 에너지 회수 시 DC 링크 커패시터 양단의 전압을 안정화하는 방안을 살펴보도록 한다. 본 개시에서 가전장치는 주로 세탁기를 대상으로 설명되나, 본 개시에 따른 가전장치는 세탁기에 제한되는 것은 아니며, 세 탁기와 유사하게 모터와 인버터를 포함하는 건조기, 공기 조화기, 무선 청소기 등에도 적용될 수있다. 도 3a는 본 개시의 일 실시예에 따른 감압 컨버터(buck converter)에서 스위치 온(on)일 때의 전류 흐름을 나타 내는 회로도이다. 본 개시에서는 예를 들어 DC 링크 커패시터 양단의 전압을 감압하여 12V 부하에 사용하거나 30V 직류전압의 에 너지 저장 장치로 에너지를 충전하는 실시예를 포함한다. 에너지 저장 장치의 양단 전압은 30V에 한정되는 것이 아니고 에너지 저장 장치의 사양에 따라 다양한 전압값이 될 수 있다. 부하 역시 12V 전압이 입력된다고 하였으 나 이는 일례에 불과할 뿐, 부하의 입력 전압 역시 다양한 전압 크기를 가질 수 있다. 어떤 경우이든 DC 링크 커패시터 양단의 전압이 보통 311V 정도이므로 이를 감압하여 사용하는 것이 일반적이다. 따라서, 도 3a는 이러 한 감압 동작 수행을 위한 감압 컨버터(30, buck converter)를 소개하고 있다. 감압 컨버터는 본 개시 전체에 걸쳐서 벅 컨버터와 호환되어 지칭될 수 있다. 감압 컨버터는 고전압의 입력전압 Vin을 저전압의 출력전압 Vout로 변환(감압 컨버팅)할 수 있다. 감압 컨버팅을 위해 스위치, 다이오드, 인덕터, 커패시터가 사용될 수 있으나 도 3a와 도 3b의 감압 컨버터 구성은 설계자의 선택에 따라 달라질 수 있다. 도 3a는 감압 컨버터에서 스위치를 온(on)하는 경우 전류 흐름도이고 도 3b는 감압 컨버터에서 스 위치를 오프(off)하는 경우 전류 흐름도이다. 감압 컨버터에서는 스위치의 스위칭을 통해 입력전압 Vin을 낮추게 된다. 도 3a에서 보는 바와 같 이 스위치를 온(on)하게 되면 인덕터를 거쳐 iL의 전류가 흐르게 된다. 인덕터 양단에 걸리는 전압 이 VL이라고 할 때 아래와 같은 식이 성립된다. VL = Vin - Vout ... 수학식 또한, 인덕터에 걸리는 전압 VL = L(di/dt)가 성립하므로 아래 수학식 가 도출될 수 있다. ... 수학식 여기서 Ts는 스위치의 스위칭 주기이고 D는 스위치의 온 듀티이다. 스위치를 온(on)하게 되면, 스위치 로 전류가 흐르고, 입력전력 Vin이 인덕터의 자기 에너지로 저장되며, 전류가 증가하게 된다. 인덕 터에 걸리는 전압은 (Vin - Vout)로 양수가 되고, 전류 iL의 리플도 양수가 된다. 도 3b는 본 개시의 일 실시예에 따른 감압 컨버터(buck converter)에서 스위치 오프(on)일 때의 전류 흐름을 나 타내는 회로도이다. 도 3b에서와 같이 스위치를 오프하게 되면 다이오드에 전류가 흐르면서 인덕터에 저장된 자기 에너 지가 방출되면서 인덕터에 흐르는 전류(iL)가 감소하게 된다. 인덕터에 걸리는 전압(VL)은 음수가 되고 전류 리플 또한 음수가 된다. VL = - Vout ... 수학식 ... 수학식 여기서 Ts는 스위치의 스위칭 주기이고 D는 스위치의 온 듀티이다. 도 3c는 본 개시의 일 실시예에 따른 감압 컨버터(buck converter)에서 인덕터 전압과 전류를 나타내는 파형도 이다. 도 3c를 참조하면, 스위치가 온(on)되는 동안과 오프(off)되는 동안의 VL에 도시된 두 사각형의 면적은 인 덕터의 플럭스 밸런스(flux balance) 조건에 의해 크기가 동일해야 한다. 다시 말해서, 스위치가 온 (on)되는 동안 인덕터에 축적된 에너지와 스위치가 오프(off)되어 인덕터로부터 방출되는 에너지가 동일해야 하므로 아래 수학식가 성립된다. (Vin - Vout)DTs = Vout(1-D)Ts, ... 수학식 따라서, 스위치의 온(on) 듀티(D)를 제어하면 입력전압 Vin 대비 출력전압 Vout의 크기를 결정할 수 있다. 예를 들어 입력전압 Vin = 311V 이고 출력전압 Vout을 30V로 하고자 하면 D = 0.096로 하면 된다. 혹은 Vin = 311V이고, Vout을 12V로 하고자 하면 D = 0.039로 하면 된다. 도 4a는 본 개시의 일 실시예에 따른 승압 컨버터(boost converter)에서 스위치 온(on)일 때의 전류 흐름을 나 타내는 회로도이다. 승압 컨버터에서는 스위치의 스위칭을 통해 입력전압 Vin을 높인다. 도 4a에서 보는 바와 같이 스 위치를 온(on)하게 되면 스위치로 전류가 흐르고, 입력되는 전력이 인덕터에 자기에너지로 저장되 고 전류 iL이 증가하게 된다. 인덕터 양단에 걸리는 전압 VL은 양수가 되고 전류 iL의 리플도 양수가 된다. VL = Vin ... 수학식 ... 수학식 도 4b는 본 개시의 일 실시예에 따른 승압 컨버터(boost converter)에서 스위치 오프(on)일 때의 전류 흐름을 나타내는 회로도이다. 승압 컨버터에서 스위치를 오프(off)하게 되면 다이오드에 전류가 흐르게 되며 인덕터에 저장 된 자기 에너지가 방출되면서 전류 iL가 감소하게 된다. 인덕터에 걸리는 전압은 (Vin-Vout)이고, 이 때 Vout이 더 크기 때문에 인덕터에 걸리는 전압은 음수가 되고, 전류 iL의 리플도 음수가 된다. VL = Vin - Vout ... 수학식 ... 수학식 여기서 Ts는 스위치의 스위칭 주기이고 D는 스위치의 온 듀티이다. 도 4c는 본 개시의 일 실시예에 따른 승압 컨버터(boost converter)에서 인덕터 전압과 전류를 나타내는 파형도 이다. 도 4c를 참조하면, 스위치가 온(on)되는 동안과 오프(off)되는 동안의 VL에 도시된 두 사각형의 면적은 인 덕터의 플럭스 밸런스(flux balance) 조건에 의해 크기가 동일해야 한다. 다시 말해서, 스위치가 온 (on)되는 동안 인덕터에 축적된 에너지와 스위치가 오프(off)되어 인덕터로부터 방출되는 에너지가 동일해야 하므로 아래 수학식이 성립된다. (Vin)DTs = -(Vin-Vout)(1-D)Ts, ... 수학식 따라서, 스위치의 온(on) 듀티(D)를 제어하면 입력전압 Vin 대비 출력전압 Vout의 크기를 결정할 수 있다. 예를 들어 입력전압 Vin = 30V 이고 출력전압 Vout을 311V로 하고자 하면 D = 0.904로 하면 된다. 도 5는 가전장치에서 배터리와 부하를 이용한 모터의 회생 제동 에너지 이용을 보여주는 회로도이다. 도 5에 따른 장치에서 모터 제동 시 발생하는 역기전력에 의한 에너지는 AC/DC 컨버터에 의해 배터리에 충전될 수 있다. 여기서 AC는 교류전압을, DC는 직류전압을 의미한다. 따라서, AC/DC 컨버터 는 교류전압을 직류전압으로 변환하는 컨버터라고 할 수 있다. 모터의 제동에 따른 회생 제동 에너 지가 배터리의 정격 충전량을 넘어서는 경우, DC/DC 컨버터에 의해 부하를 구동하지 않고 배터리에 의해 부하가 필요로 하는 에너지를 소비하도록 제어부가 DC/DC 컨버터와 AC/DC 컨버 터 및 배터리를 제어할 수 있다. 여기서 DC/DC 컨버터는 직류전압을 또 다른 레벨의 직류전 압으로 변환하는 컨버터라고 할 수 있다. 일 실시예에서, 부하는 제어용 PCB, 프로세서, 사용자 인터페이스, 통신부 등을 포함하는 DC 부하일 수 있 다. DC 부하는 12V, 5V 및/또는 3.3V의 부하를 포함할 수 있으나 이에 제한되는 것은 아니다. DC/DC 컨버터 는 SMPS(switched mode power supply)를 포함할 수 있다. 또한, 회생 제동 에너지는 모터가 다시 가속하거나 회전 운동을 재개하는 재가동 에너지에 사용될 수도 있다. 도 5에 따른 방식은 모터에서 직접 3상 AC/DC 컨버터를 이용하여 배터리를 충전하는 방식인 데, 모터의 역기전력이 배터리의 전압보다 커야만 충전이 이루어질 수 있으므로 회생 제동 에너지 를 활용하는 에너지 영역이 제한적일 수 있다. 다시 말해서 도 5에 따른 방식은 모터의 제동 시 발생하는 회생 제동 에너지 모두를 활용하는 것이 불가능한 방식이다. 또한, AC/DC 컨버터가 모터에 직접 연 결되는 구조이므로 DC 링크 커패시터 전압의 안정화와 같은 동작은 이루어지지 않는다. 도 6a는 가전장치에서 모터 구동을 위한 인버터 구성도이다. 도 6a에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 제 1 정류기(1120_1)로 이루어진 부분은 통상의 인버터 구성이다. 이하 도 6a 내지 도 14에 따른 구성 및 회생 제동 구성은 간단히 전력변환장치라고 지칭될 수 있다. 도 6a에서는 여기에 제 2 정류기(1120_2) 와 제 2 정류기(1120_2)를 통해 생성된 직류전압을 부하가 요구하는 적절한 직류전압으로 변환하기 위한 제 1 전력변환기가 추가된다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하 일 수 있는데, 예를 들어, PCB, 프로세서(마이컴) 등과 같은 부하를 포함할 수 있다. 일 실시예에서 부하는 사용자 인터페이스를 포함할 수 있다. 다시 말해서, 부하에 사용되는 전력은 사용자 인터페이스 구동을 위 한 전력일 수 있다. 사용자 인터페이스는 입력 인터페이스와 출력 인터페이스를 포함할 수 있다. 입력 인터페이 스는 터치 디스플레이, 물리적 버튼, 보이스 입력을 위한 마이크 등을 포함할 수 있다. 출력 인터페이스는 디스 플레이 및/또는 스피커를 포함할 수 있다. 일 실시예에서, 부하는 통신부를 포함할 수 있다. 다시 말해서 부하에 사용되는 전력은 통신부 구동을 위한 전력을 포함할 수 있다. 통신부는 근거리 통신부와 원거리 통 신부를 포함할 수 있고, 근거리 통신부는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication interface), Wi-Fi(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(Ultra Wideband) 통신부, Ant+ 통신부 등 을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신할 수 있다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신 호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 원거리 통신부는, 3G 모듈, 4G 모듈, 5G 모듈, LTE 모듈, NB-IoT 모듈, LTE-M 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니 다. 본 개시의 일 실시예에 의하면, 통신부를 통해 가전장치 외부의 서버나 다른 전기장치와 통신을 하고 데이 터를 송수신할 수 있다. 도 6a에서 일 실시예에 따른 제 1 전력변환기는 인버터를 위한 제 1 정류기(1120_1)와 별도로 제 2 정류기(1120_2)를 사용하여 입력전원으로부터 분기된 전원을 이용할 수 있다. 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC(직류전압 변환) 변환을 위한 제 1 스위치를 포함할 수 있다. 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실시예에 따라 절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 일 실시예에서, 제 1 전력변환기는 플라이백 컨버 터(fly-back converter)를 포함할 수 있다. 도 6a에서는 모터가 감속하거나 정지할 때 발생하는 역기전력에 의한 회생 제동 에너지를 회수하는 수단 이 포함되지 않았다. 따라서, 모터가 감속하거나 정지할 때 DC 링크 커패시터의 전압이 상승하여 DC 링크 커패시터의 내압 기준을 초과하는 등 가전장치의 인버터 구성 안전에 문제가 발생할 수 있다. 도 6b는 가전장치에서 모터 구동을 위한 인버터 구성도이다. 도 6b에서는 도 6a에서와 마찬가지로 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전압을 공급하는 정류기로 이루어진 부분은 통상의 인버터 구성이다. 도 6b의 인버터 구성이 도 6a의 인버터 구성과 다른 점은 제 1 전력변환기로 입력되는 직류전압이 입력전원으로부터 별도의 정류기를 사용하여 생성되는 직류전압을 사용하는 것이 아닌, DC 링크 커패시터의 직류 전압을 입력으로 사용한다는 점이다. 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC(직류전압 변환) 변환을 위한 제 1 스위치 를 포함할 수 있다. 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실시예에 따라 비절연형 컨버터를 사용할 수도 있다. 부하는 도 6a에서 상세히 설명하였으므로 여기서 설명은 생략하도록 한다. 도 7은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 7에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 제 1 정류기(1120_1)로 이루어진 부분은 통상의 인버터 구성이다. 도 7에서 회생 제동 구성은 도 6a에서와 마찬가지로 제 2 정류기(1120_2)와 제 2 정류기(1120_2)를 통해 생성된 직류전압을 부하가 요구하 는 적절한 직류전압으로 변환하기 위해 제 1 전력변환기를 포함한다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하일 수 있는데, 예를 들어, 부하는 PCB, 프로세서(마이컴), 사용자 인터페이스, 통신부 등과 같은 부하일 수 있다. 일 실시예에서, 부하에는 제 1 전력변환기에 의해 12V가 입력되고, 부하에 포함된 PCB 자체적으로 전압 레귤레이터에 의해 12V를 5V(혹은 3.3V)로 감압하여 사용할 수도 있다. 도 7에서 일 실시예에 따른 제 1 전력변환기는 DC 링크 커패시터에 확립되는 직류전압을 생성하기 위 한 제 1 정류기(1120_1)와 별도로 제 2 정류기(1120_2)를 사용하여 입력전원으로부터 분기된 전원을 이용 할 수 있다. 도 6a에서도 설명된 바와 같이, 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC(직류전압 변환) 변환을 위한 제 1 스위치를 포함할 수 있다. 도 7에서 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실시예에 따라서는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 7에 따른 회생 제동 구성은 제 2 전력변환기를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커 패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터의 직류전압을 제 2 스위치의 온-오프 동작에 의해 다른 레벨 의 직류전압으로 변환할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 전력변환기를 제어하여 제 2 전력변환기에 의해 변환된 직류전압을 수퍼 커패시터에 충전하도록 제어할 수 있다. 이를 통해 프 로세서는 모터의 감속이나 정지에 의한 회생 제동 에너지가 수퍼 커패시터를 포함하는 에너지 저장 장치에 저장되도록 제어할 수 있다. 일 실시예에서, 에너지 저장 장치에 포함되는 수퍼 커패시터는 배터리 에 의해 대체될 수 있다. 일 실시예에서, 비록 도 7에서 제 2 전력변환기의 출력 측이 수퍼 커패시터 만으로 도시되었으나, 수퍼 커패시터는 에너지 저장 장치로 대체될 수 있고, 에너지 저장 장치는 수퍼 커패시터 및 배터리 중 적어도 하나를 포함할 수 있다. 다시 말해서, 에너지 저장 장치는 수퍼 커패시 터나 배터리 중 어느 하나 만을 포함할 수도 있고, 둘 모두를 포함할 수도 있다. 이하 도 8 내지 도 14 에서 수퍼 커패시터로 도시되는 부분은 모두 동일하게 에너지 저장 장치에 의해 대체될 수 있고, 에너지 저 장 장치는 수퍼 커패시터나 배터리 중 어느 하나 만을 포함할 수도 있고, 둘 모두를 포함할 수도 있다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모터의 감속이나 정지에 의한 회생 제동 에너지에 의해 소정의 전압 이상이 되면 제 2 전력변환기를 제어하여 수퍼 커패시터에 회 생 제동 에너지를 저장하도록 제 2 전력변환기를 제어할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링 크 커패시터 양단의 전압보다 5V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기(1120, 1120_1)에 의해 DC 링크 커패시터에 확립되는 직류전압이 311V라고 하면 소정의 전압은 316V 일 수 있다. 물론 이는 일 실시예이며, 소정의 전압은 더 낮을수도 있고(예) 314V) 더 높을 수도 있다(예) 320V). 수퍼 커패 시터는 복수의 커패시터를 직병렬로 연결한 장치일 수 있다. 수퍼 커패시터의 양단 전압은, 일례로 30V 가 될 수 있으나 이에 제한되는 것은 아니고 이보다 높을 수도 있고 이보다 낮을 수도 있다. 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함 할 수 있다. 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 승압시키는 승압 컨버터(boost converter)를 포함할 수도 있다. 도 7에 따른 회생 제동 구성을 포함하는 가전장치의 프로세서(도시되지 않음)는 DC 링크 커패시터의 전압을 모니터링하면서 DC 링크 커패시터 전압이 소정의 전압 이상이 되면 제 2 전력변환기의 제 2 스위치 가 턴온되도록 제어할 수 있다. 제 2 스위치가 턴온되면 모터의 정지 또는 감속에 의해 발생 하는 회생 제동 에너지가 제 2 전력변환기에 의해 회수되어 수퍼 커패시터에 일시적으로 에너지가 저 장된 후 제 3 전력변환기를 거쳐 부하에서 소모될 수 있다. 제 2 스위치가 턴온되어 제 2 전력 변환기가 동작하게 되면, 제 2 절연용 변압기에 의해 적절한 감압이 이루어지고 수퍼 커패시터(6 5)에 전력이 저장될 수 있다. 일 실시예에서, 수퍼 커패시터는 회생 제동 에너지를 저장하는 에너지 저장 장치로서의 기능을 수행할 수 있다. 본 개시 전반에 걸쳐 일 실시예에 따라, 수퍼 커패시터는 충방전이 가 능한 배터리에 의해 대체될 수 있다. 가전장치는 수퍼 커패시터에 확립된 직류전압을 입력으로 하는 제 3 전력변환기를 더 포함할 수 있다. 제 3 전력변환기는 제 3 스위치와 제 1 인덕터를 포함할 수 있다. 일 실시예에서, 가 전장치의 프로세서는 제 3 스위치의 온/오프 동작을 제어하여 수퍼 커패시터에 확립된 직류전압을 감 압하여 부하에 제공하도록 할 수 있다. 제 3 전력변환기가 포함하는 제 3 스위치와 제 1 인덕 터의 동작에 의해 소정의 전압 레벨(12V, 5V 또는 3.3V 등)에 따라 동작하는 부하에 전원이 공급될 수 있다. 부하가 어떤 부하를 포함하는지는 도 6a에서 상세히 설명하였으므로 반복되는 설명은 생략하도록 한다. 일 실시예에서, 가전장치의 프로세서는 회생 제동에 의해 발생하는 전력이 부하가 포함하는 통신부를 구동 하는데 사용되도록 가전장치를 제어할 수 있다. 일 실시예에서, 예를 들어, 가전장치의 프로세서는 회생 제동에 의해 발생하는 전력이 Wi-Fi 통신을 위해 Wi-Fi 통신부를 구동하는데 사용되도록 제어할 수 있다. 이상과 같은 가전장치의 부하 구성은 본 개시의 도 7 내지 도 12에 따른 구성에서 부하가 있는 경우 모두 적용될 수 있다. 일 실시예에서, 부하 입력단에는 제 1 전력변환기의 출력과 연결되는 제 1 다이오드와 제 3 전력 변환기의 출력과 연결되는 제 2 다이오드가 구비될 수 있다. 제 1 다이오드와 제 2 다이오드(8 2)는 부하로의 입력으로서 제 1 전력변환기의 출력과 제 3 전력변환기의 출력 중 어느 것을 선 택할 것인지를 선택하기 위한 선택기로서 기능할 수 있다. 예를 들어, 제 1 전력변환기의 출력이 제 1 다 이오드에 의해 12.0V로 유지되고 제 3 전력변환기의 출력이 제 2 다이오드에 의해 12.2V로 유지 되는 경우 부하에는 조금 더 높은 전압이 출력되는 제 2 다이오드 측 전압이 부하에서 사용되는 전 압이 된다. 만일 회생 제동 에너지가 발생하지 않아서 제 2 전력변환기 및/또는 제 3 전력변환기가 동작하지 않게되고, 그 결과 제 2 다이오드측 전압이 12.0V 보다 작아지는 경우, 제 1 다이오드로부터 전달되는 전압 12.0V가 부하에서 사용되는 전압으로 선택될 수 있다. 일 실시예에서, 제 2 전력변환기 와 제 3 전력변환기는 DC/DC 컨버터를 포함할 수 있다. 도 8은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 8에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 정류기로 이루어진 부분은 통상의 인버터 구성이다. 도 8에서는 도 6b에서와 마찬가지로 DC 링크 커패시터에 확립된 직류전압을 부하가 요구하는 적절한 직류전압으로 변환하기 위해 제 1 전력 변환기가 사용될 수 있다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하 일 수 있는데, 예를 들어, 부하는 PCB, 프로세서(마이컴), 사용자 인터페이스, 통신부 등과 같은 부하일 수 있다. 일 실시예에서, 부하에는 제 1 전력변환기에 의해 12V가 입력되고, 부하에 포함된 PCB의 전압 레귤레이터에 의해 PCB는 12V를 5V로 감압하여 사용할 수도 있다. 도 8에서 일 실시예에 따른 제 1 전력변환기는 직류전압을 생성하기 위한 정류기 외에 별도의 정류 기를 사용하지 않고 DC 링크 커패시터의 직류전압을 인버터와 공유할 수 있다. 제 1 전력변환기 는 내부에 제 1 절연용 변압기와 DC/DC(직류전압 변환) 변환을 위한 제 1 스위치를 포함할 수 있다. 도 8에서 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실 시예에 따라서는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전 장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 8에 따른 회생 제동 구성은 제 2 전력변환기를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커 패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터의 직류전압을 제 2 절연용 변압기와 제 2 스위치의 온 -오프 동작에 의해 다른 레벨의 직류전압으로 변환할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 전력변환기를 제어하여 제 2 전력변환기에 의해 변환된 직류전압을 수퍼 커패시터에 충전하도록 제어할 수 있다. 이를 통해 프로세서는 모터의 감속이나 정지에 의한 회생 제동 에너지가 수퍼 커패시터 와 같은 에너지 저장 장치에 저장되도록 제어할 수 있다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모터의 감속이나 정지에 의한 회생 제동 에너지에 의해 소정의 전압 이상이 되 면 제 2 전력변환기의 제 2 스위치를 동작시켜 수퍼 커패시터에 회생 제동 에너지를 저장하도 록 제 2 전력변환기를 제어할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링크 커패시터 양단의 전 압보다 5V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기(1120, 1120_1)에 의해 DC 링크 커패 시터에 확립되는 직류전압이 311V라고 하면 소정의 전압은 316V일 수 있다. 물론 이는 일 실시예이며, 소정 의 전압은 더 낮을수도 있고(예) 314V) 더 높을 수도 있다(예) 320V). 일 실시예에서, 수퍼 커패시터는 충 방전이 가능한 배터리에 의해 대체될 수 있다. 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함 할 수 있다. 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 승압시키는 승압 컨버터(boost converter)를 포함할 수도 있다. 도 8에 따른 회생 제동 구성을 포함하는 가전장치의 프로세서는 DC 링크 커패시터의 전압을 모니터링하면서 DC 링크 커패시터 전압이 소정의 전압 이상이 되면 제 2 전력변환기의 제 2 스위치가 온-오프 되도록 제어할 수 있다. 제 2 스위치가 온-오프 되면 모터의 정지 또는 감속에 의해 발생하는 회생 제동 에너지가 제 2 전력변환기에 의해 회수되어 제 3 전력변환기를 거쳐 부하에서 소모될 수 있다. 제 2 스위치가 턴온되어 제 2 전력변환기가 동작하게 되면, 제 2 절연용 변압기에 의 해 적절한 감압이 이루어지고 수퍼 커패시터에 전력이 저장될 수 있다. 일 실시예에서, 수퍼 커패시터 는 회생 제동 에너지를 저장할 수 있다. 제 2 스위치가 온-오프될 때 입출력 전압 게인 = D*n/(1-D) 이고 이 때 D는 제 2 스위치의 듀티비이고 n은 제 2 절연용 변압기의 턴비이다. 따라서, 제 2 스위치 의 온 듀티와 제 2 절연용 변압기의 턴비로 DC 링크 커패시터의 전압을 감압할 수 있다. 가전장치는 수퍼 커패시터에 확립된 직류전압을 입력으로 하는 제 3 전력변환기를 더 포함할 수 있다. 제 3 전력변환기는 제 3 스위치와 제 1 인덕터를 포함할 수 있다. 일 실시예에서, 가 전장치의 프로세서는 제 3 스위치의 온/오프 동작을 제어하여 수퍼 커패시터와 같은 에너지 저장 장 치에 확립된 직류전압을 감압하여 부하에 제공하도록 할 수 있다. 제 3 전력변환기가 포함하는 제 3 스위치와 제 1 인덕터의 동작에 의해 소정의 전압 레벨(12V, 5V 또는 3.3V 등)에 따라 동작하는 부 하에 전원이 공급될 수 있다. 부하가 어떤 부하를 포함하는지는 도 6a에서 상세히 설명하였으므로 반복 되는 설명은 생략하도록 한다. 일 실시예에서, 부하 입력단에는 제 1 전력변환기의 출력과 연결되는 제 1 다이오드와 제 3 전력 변환기의 출력과 연결되는 제 2 다이오드가 구비될 수 있다. 제 1 다이오드와 제 2 다이오드(8 2)는 부하로의 입력으로 제 1 전력변환기의 출력과 제 3 전력변환기의 출력 중 어느 것을 선택 할 것인지를 선택하기 위한 선택기로서 기능할 수 있다. 예를 들어, 제 1 전력변환기의 출력이 제 1 다이 오드에 의해 12.0V로 유지되고 제 3 전력변환기의 출력이 제 2 다이오드에 의해 12.2V로 유지되 는 경우 부하에는 조금 더 높은 전압이 출력되는 제 2 다이오드 측 전압이 부하에서 사용되는 전압 으로 선택된다. 만일 회생 제동 에너지가 발생하지 않아서 제 2 전력변환기 및/또는 제 3 전력변환기 가 동작하지 않고 제 2 다이오드측 전압이 12.0V 보다 작아지는 경우, 제 1 다이오드로부터 전달 되는 전압 12.0V가 부하에서 사용되는 전압이 된다. 일 실시예에서, 제 2 전력변환기와 제 3 전력변 환기는 DC/DC 컨버터를 포함할 수 있다. 도 9는 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 9에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 제 1 정류기(1120_1)로 이루어진 부분은 통상의 인버터 구성이다. 제 1 전력변환기는 제 2 정류기(1120_2)와 제 2 정류기(1120_2)를 통해 생성된 직류전압을 부하가 요구하는 적절한 직류전압으로 변 환할 수 있다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하일 수 있는데, 예를 들어, 부하는 PCB, 프로세서(마이컴), 사용자 인터페이스, 통신부 등과 같은 부하일 수 있다. 일 실시예에 서, 부하에는 제 1 전력변환기에 의해 12V가 입력되고, 부하에 포함된 PCB 자체적으로 전압 레귤 레이터에 의해 12V를 5V로 감압하여 사용할 수도 있다. 도 9에서 일 실시예에 따른 제 1 전력변환기는 DC 링크 커패시터에 확립되는 직류전압을 생성하기 위 한 제 1 정류기(1120_1)와 별도로 제 2 정류기(1120_2)를 사용하여 입력전원으로부터 분기된 전원을 이용 할 수 있다. 도 6a에서도 설명된 바와 같이, 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC 변환(직류전압 변환)을 위한 제 1 스위치를 포함할 수 있다. 도 9에서 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실시예에 따라서는 비절연형 컨버터가 사용될 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 9에 따른 회생 제동 구성은 제 2 전력변환기를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커 패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터의 직류전압을 제 2 스위치의 온-오프 동작 및 제 2 인덕터 의 에너지 저장 기능을 통해 다른 레벨의 직류전압으로 변환할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 전력변환기를 제어하여 제 2 전력변환기에 의해 변환된 직류전압을 에너지 저장 장치 - 예로써, 수퍼 커패시터 - 에 충전하도록 제어할 수 있다. 이를 통해 프로세서는 모터의 감속이나 정지에 의해 발생하는 회생 제동 에너지가 수퍼 커패시터와 같은 에너지 저장 장치에 저장되도록 제 2 전력 변환기를 제어할 수 있다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모 터의 감속이나 정지에 의한 회생 제동 에너지로 인해 소정의 전압 이상이 되면 제 2 전력변환기를 제어하여 수퍼 커패시터에 회생 제동 에너지를 저장하도록 할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링크 커패시터 양단의 전압보다 3V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기 (1120_1)에 의해 DC 링크 커패시터에 확립되는 직류전압이 311V라고 하면 소정의 전압은 314V 일 수 있다. 물론 이는 일 실시예이며, 소정의 전압은 더 낮을수도 있고(예) 313V) 더 높을 수도 있다(예) 317V). 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함 할 수 있다. 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 승압시키는 승압 컨버터(boost converter)를 포함할 수도 있다. 도 9에 따른 회생 제동 구성을 포함하는 가전장치의 프로세서는 DC 링크 커패시터의 전압을 모니터링하면서 DC 링크 커패시터 전압이 소정의 전압 이상이 되면 제 2 전력변환기의 제 2 스위치가 턴온되도 록 제어할 수 있다. 제 2 스위치가 턴온되면 모터의 정지 또는 감속에 의해 발생하는 회생 제동 에 너지가 제 2 전력변환기에 의해 수퍼 커패시터에 회수될 수 있다. 일 실시예에서, 수퍼 커패시터(6 5)에 저장된 전력은 제 3 전력변환기를 거쳐 부하에서 소모될 수 있다. 일 실시예에서, 수퍼 커패시 터는 충방전이 가능한 배터리에 의해 대체될 수 있다. 일 실시예에서, 에너지 저장 장치로서, 수퍼 커 패시터와 충방전이 가능한 배터리가 함께 사용될 수 있다. 일 실시예에서, 회생 제동 에너지가 제 2 전력변환기에 의해 수퍼 커패시터에 저장될 수 있도록, 가 전장치의 프로세서는 제 2 스위치를 온-오프하여 제 2 전력변환기를 동작시킬 수 있고, 이를 통해 수퍼 커패시터에 전력이 저장될 수 있다. 도 9에 따른 제 2 전력변환기는 절연용 변압기를 포함하지 않을 수 있다. 가전장치는 수퍼 커패시터에 확립된 직류전압을 입력으로 하는 제 3 전력변환기를 더 포함할 수 있다. 제 3 전력변환기는 제 3 절연용 변압기와 제 3 스위치를 포함할 수 있다. 일 실시예에 서, 가전장치의 프로세서는 제 3 스위치의 온/오프 동작을 제어하여 수퍼 커패시터에 확립된 직류전 압을 감압하여 부하에 제공하도록 할 수 있다. 제 3 전력변환기가 포함하는 제 3 절연용 변압기 와 제 3 스위치의 동작에 의해 소정의 전압 레벨(12V, 5V 또는 3.3V 등)에 따라 동작하는 부하(5 0)에 전원이 공급될 수 있다. 부하가 어떤 부하를 포함하는지는 도 6a에서 상세히 설명하였으므로 반복되는 설명은 생략하도록 한다. 일 실시예에서, 부하 입력단에는 제 1 전력변환기의 출력과 연결되는 제 1 다이오드와 제 3 전력 변환기의 출력과 연결되는 제 2 다이오드가 구비될 수 있다. 제 1 다이오드와 제 2 다이오드(8 2)는 부하로의 입력으로 제 1 전력변환기의 출력과 제 3 전력변환기의 출력 중 어느 것을 선택 할 것인지를 선택하기 위한 선택기로서 기능할 수 있다. 예를 들어, 제 1 전력변환기의 출력이 제 1 다이 오드에 의해 12.0V로 유지되고 제 3 전력변환기의 출력이 제 2 다이오드에 의해 12.2V로 유지되 는 경우 부하에는 조금 더 높은 전압이 출력되는 제 2 다이오드 측 전압이 부하에서 사용되는 전압 이 된다. 만일 회생 제동 에너지가 발생하지 않아서 제 2 전력변환기 및/또는 제 3 전력변환기가 동작하지 않게 되어 제 2 다이오드측 전압이 12.0V 보다 작아지는 경우, 제 1 다이오드로부터 전달되는전압 12.0V가 부하에서 사용되는 전압이 된다. 일 실시예에서, 제 2 전력변환기와 제 3 전력변환기는 DC/DC 컨버터를 포함할 수 있다. 도 10은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 10에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 정류기로 이루어진 부분은 통상의 인버터 구성이다. 도 10에서는 도 6a에서와 마찬가지로 DC 링크 커패시터에 확립된 직류전압을 부하가 요구하는 적절한 직류전압으로 변환하기 위해 제 1 전력 변환기가 사용될 수 있다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하 일 수 있는데, 예를 들어, 부하는 PCB, 프로세서(마이컴), 사용자 인터페이스, 통신부 등과 같은 부하일 수 있다. 일 실시예에서, 부하에는 제 1 전력변환기에 의해 12V가 입력되고, 부하에 포함된 PCB의 전압 레귤레이터에 의해 PCB는 12V를 5V로 감압하여 사용할 수도 있다. 도 10에서 일 실시예에 따른 제 1 전력변환기는 직류전압을 생성하기 위한 정류기 외에 별도의 정 류기를 사용하지 않고 DC 링크 커패시터의 직류전압을 인버터와 공유할 수 있다. 제 1 전력변환기 는 내부에 제 1 절연용 변압기와 DC/DC 변환(직류전압 변환)을 위한 제 1 스위치를 포함할 수 있다. 도 10에서 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실시예에 따라서는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가 전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 10에 따른 회생 제동 구성은 제 2 전력변환기를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커 패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터의 직류전압을 제 2 스위치의 온-오프 동작 및 제 2 인덕터 의 에너지 저장 기능을 통해 다른 레벨의 직류전압으로 변환할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 전력변환기를 제어하여 제 2 전력변환기에 의해 변환된 직류전압을 수퍼 커패시터 와 같은 에너지 저장 장치에 충전하도록 제어할 수 있다. 이를 통해 프로세서는 모터의 감속이나 정 지에 의해 발생하는 회생 제동 에너지가 수퍼 커패시터와 같은 에너지 저장 장치에 저장되도록 할 수 있다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모터의 감속이나 정지에 의한 회생 제동 에너지에 의해 소정의 전압 이상이 되면 제 2 전력변환기를 제어하여 수퍼 커패시터에 회 생 제동 에너지를 저장하도록 할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링크 커패시터 양단의 전압 보다 4V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기(1120_1)에 의해 DC 링크 커패시터(6 0)에 확립되는 직류전압이 311V라고 하면 소정의 전압은 315V 일 수 있다. 물론 이는 일 실시예이며, 소정의 전 압은 더 낮을 수도 있고(예) 314V) 더 높을 수도 있다(예) 318V). 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함 할 수 있다. 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 승압시키는 승압 컨버터(boost converter)를 포함할 수도 있다. 도 10에 따른 회생 제동 구성을 포함하는 가전장치의 프로세서는 DC 링크 커패시터의 전압을 모니터링하면 서 DC 링크 커패시터 전압이 소정의 전압 이상이 되면 제 2 전력변환기의 제 2 스위치가 턴온 되도록 제어할 수 있다. 제 2 스위치가 턴온되면 모터의 정지 또는 감속에 의해 발생하는 회생 제 동 에너지가 제 2 전력변환기에 의해 수퍼 커패시터에 회수될 수 있다. 일 실시예에서, 수퍼 커패시 터에 저장된 전력은 제 3 전력변환기를 거쳐 부하에서 소모될 수 있다. 일 실시예에서, 회생 제동 에너지가 제 2 전력변환기에 의해 수퍼 커패시터에 저장될 수 있도록, 프 로세서는 제 2 스위치를 온-오프할 수 있고, 이를 통해 수퍼 커패시터에 전력이 저장될 수 있다. 도 10에 따른 제 2 전력변환기는 절연용 변압기를 포함하지 않을 수 있다. 가전장치는 수퍼 커패시터에 확립된 직류전압을 입력으로 하는 제 3 전력변환기를 더 포함할 수 있다. 제 3 전력변환기는 제 3 절연용 변압기와 제 3 스위치를 포함할 수 있다. 일 실시예에 서, 가전장치의 프로세서는 제 3 스위치의 온/오프 동작을 제어하여 수퍼 커패시터에 확립된 직류전 압을 감압하여 부하에 제공하도록 할 수 있다. 제 3 전력변환기가 포함하는 제 3 절연용 변압기 와 제 3 스위치의 동작에 의해 소정의 전압 레벨(12V, 5V 또는 3.3V 등)에 따라 동작하는 부하(5 0)에 전원이 공급될 수 있다. 부하가 어떤 부하를 포함하는지는 도 6a에서 상세히 설명하였으므로 반복되는 설명은 생략하도록 한다. 일 실시예에서, 부하 입력단에는 제 1 전력변환기의 출력과 연결되는 제 1 다이오드와 제 3 전력 변환기의 출력과 연결되는 제 2 다이오드가 구비될 수 있다. 제 1 다이오드와 제 2 다이오드(8 2)는 부하로의 입력으로 제 1 전력변환기의 출력과 제 3 전력변환기의 출력 중 어느 것을 선택 할 것인지를 선택하기 위한 선택기로서 기능할 수 있다. 제 1 다이오드와 제 2 다이오드에 관한 상세한 설명은 앞서 이루어졌으므로 반복되는 설명은 생략하도록 한다. 도 11은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 11에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 제 1 정류기(1120_1)로 이루어진 부분은 통상의 인버터 구성이다. 제 1 전력변환기는 제 2 정류기(1120_2)와 제 2 정류기(1120_2)를 통해 생성된 직류전압을 부하가 요구하는 적절한 직류전압으로 변 환할 수 있다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하일 수 있다. 부하 는 앞서 도 6a에서 설명하였으므로 여기서는 상세한 설명을 생략하도록 한다. 도 11에서 일 실시예에 따른 제 1 전력변환기는 DC 링크 커패시터에 확립되는 직류전압을 생성하기 위한 제 1 정류기(1120_1)와 별도로 제 2 정류기(1120_2)를 사용하여 입력전원으로부터 분기된 전원을 이 용할 수 있다. 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC(직류전압 변환) 변환을 위한 제 1 스위치를 포함할 수 있다. 일 실시예에 따라서 제 1 전력변환기는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 11에 따른 회생 제동 구성은 제 2 전력변환기와 에너지 저장 장치로서 수퍼 커패시터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변 환하고 수퍼 커패시터에 저장된 전력을 다시 DC 링크 커패시터에 역으로 공급하는 양방향 벅-부스트 (buck-boost) 컨버터를 포함할 수 있다. 제 2 스위치는 회생 제동 에너지를 수퍼 커패시터로 회수하 는 메인 스위치로 기능할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 스위치의 온-오프 동작을 제어하여 DC 링크 커패시터의 직류전압을 다른 레벨의 직류전압으로 변환하고 회생 제동 에너지를 수퍼 커 패시터에 저장하도록 제 2 전력변환기를 제어할 수 있다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모터의 감속이나 정지에 의한 회생 제동 에너지에 의해 소정의 전압 이상 이 되면 제 2 전력변환기를 제어하여 회생 제동 에너지를 제 2 인덕터의 에너지 저장 기능을 통해 수퍼 커패시터에 저장하도록 할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링크 커패시터 양단의 전 압보다 4V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기(1120_1)에 의해 DC 링크 커패시터 에 확립되는 직류전압이 311V라고 하면 소정의 전압은 315V 일 수 있다. 물론 이는 일 실시예이며, 소정의 전압은 더 낮을수도 있고(예) 314V) 더 높을 수도 있다(예) 320V). 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함 할 수 있다. 가전장치의 프로세서는 DC 링크 커패시터의 전압을 DC 링크 전압 센서(도시되지 않음)에 의해 모니터링할 수 있다. 프로세서는 모터가 다시 가속하거나 회전 운동을 재개하는 재기동 이벤트에 기초하여 수퍼 커패 시터에 저장된 전력을 모터의 재기동을 위해 사용될 수 있도록 제 4 스위치를 메인 스위치로 제어하여 수퍼 커패시터에 저장된 전력을 DC 링크 커패시터로 되돌려 주도록 제어할 수 있다. 또는 가 전장치의 프로세서는 DC 링크 커패시터의 전압을 모니터링하면서 DC 링크 커패시터의 전압 변동에 따라 제 4 스위치를 메인 스위치로 제어하여 수퍼 커패시터에 저장된 전력을 DC 링크 커패시터로 되돌 려 주도록 제어할 수 있다. 일 실시예에서, 이 때 제 2 전력변환기는 수퍼 커패시터에서 DC 링크 커 패시터 방향으로 승압 컨버터(boost converter)로 동작할 수 있다. 도 12는 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 12에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 정류기로 이루어진 부분은 통상의 인버터 구성이다. 도 12에서는 DC 링크 커패시터에 확립된 직류전압을 부하가 요구하는 적절한 직류전압으로 변환하기 위해 DC 링크 커패시터의 전압을 입 력으로 하는 제 1 전력변환기가 사용될 수 있다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전 압을 필요로 하는 부하일 수 있다. 부하는 앞서 도 6a에서 설명하였으므로 여기서는 상세한 설명은 생략하 도록 한다.도 12에서 일 실시예에 따른 제 1 전력변환기는 제 1 절연용 변압기와 DC/DC 변환(직류전압 변환) 을 위한 제 1 스위치를 포함할 수 있다. 일 실시예에 따라서 제 1 전력변환기는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 12에 따른 회생 제동 구성은 제 2 전력변환기와 에너지 저장 장치로서 수퍼 커패시터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변 환하고 수퍼 커패시터에 저장된 전력을 다시 DC 링크 커패시터에 공급하는 양방향 벅-부스트 컨버터 (bidirectional buck-boost converter)를 포함할 수 있다. 제 2 스위치는 회생 제동 에너지를 수퍼 커패 시터로 회수하는 메인 스위치로 기능할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 스위치(115 4)의 온-오프 동작을 제어하여 DC 링크 커패시터의 직류전압을 제 2 인덕터의 에너지 저장 기능을 통 해 다른 레벨의 직류전압으로 변환하고 회생 제동 에너지를 수퍼 커패시터에 저장하도록 제 2 전력변환기 를 제어할 수 있다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모터 의 감속이나 정지에 의한 회생 제동 에너지에 의해 소정의 전압 이상이 되면 제 2 전력변환기를 제 어하여 수퍼 커패시터에 회생 제동 에너지를 저장하도록 할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링크 커패시터 양단의 전압보다 5V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기 (1120_1)에 의해 DC 링크 커패시터에 확립되는 직류전압이 311V라고 하면 소정의 전압은 316V 일 수 있다. 물론 이는 일 실시예이며, 소정의 전압은 더 낮을수도 있고(예) 314V) 더 높을 수도 있다(예) 320V). 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함 할 수 있다. 가전장치의 프로세서는 DC 링크 커패시터의 전압을 DC 링크 전압 센서(도시되지 않음)에 의해 모니터링할 수 있다. 프로세서는 모터가 다시 가속하거나 회전 운동을 재개하는 재기동 이벤트에 기초하여 수퍼 커패 시터에 저장된 전력을 모터의 재기동을 위해 사용될 수 있도록 제 4 스위치를 메인 스위치로 제어하여 수퍼 커패시터에 저장된 전력을 DC 링크 커패시터로 되돌려 주도록 제어할 수 있다. 또는 가 전장치의 프로세서는 DC 링크 커패시터의 전압을 모니터링하면서 DC 링크 커패시터의 전압 변동에 따라 제 4 스위치를 메인 스위치로 제어하여 수퍼 커패시터에 저장된 전력을 DC 링크 커패시터로 되돌 려 주도록 제어할 수 있다. 일 실시예에서, 이 때 제 2 전력변환기는 수퍼 커패시터에서 DC 링크 커 패시터 방향으로 승압 컨버터(boost converter)로 동작할 수 있다. 도 13은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 13에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 제 1 정류기(1120_1)로 이루어진 부분은 통상의 인버터 구성이다. 제 1 전력변환기는 제 2 정류기(1120_2)와 제 2 정류기(1120_2)를 통해 생성된 직류전압을 부하가 요구하는 적절한 직류전압으로 변 환할 수 있다. 부하는 12V, 5V나 3.3V와 같이 신호 레벨의 직류전압을 필요로 하는 부하일 수 있는데, 예를 들어, 부하는 PCB, 프로세서(마이컴), 사용자 인터페이스, 통신부 등과 같은 부하일 수 있다. 일 실시예에 서, 부하에는 제 1 전력변환기에 의해 12V가 입력되고, 부하에 포함된 PCB 자체적으로 전압 레귤 레이터에 의해 12V를 5V로 감압하여 사용할 수도 있다. 도 13에서 일 실시예에 따른 제 1 전력변환기는 DC 링크 커패시터에 확립되는 직류전압을 생성하기 위한 제 1 정류기(1120_1)와 별도로 제 2 정류기(1120_2)를 사용하여 입력전원으로부터 분기된 전원을 이 용할 수 있다. 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC 변환(직류전압 변환)을 위한 제 1 스위치를 포함할 수 있다. 도 13에서 제 1 전력변환기가 제 1 절연용 변압기를 사용하 는 것으로 도시되었지만, 일 실시예에 따라서는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 13에 따른 회생 제동 구성은 제 2 전력변환기와 에너지 저장 장치로서 수퍼 커패시터를 포함할 수 있다. 제 2 전력변환기는 DC 링크 커패시터로부터 입력되는 직류전압을 다른 레벨의 직류전압으로 변 환하고 수퍼 커패시터에 저장된 전력을 다시 DC 링크 커패시터에 역으로 공급하는 양방향 벅-부스트 컨 버터를 포함할 수 있다. 제 2 스위치는 회생 제동 에너지를 수퍼 커패시터로 회수하는 메인 스위치로 기능할 수 있다. 가전장치의 프로세서(도시되지 않음)는 제 2 스위치의 온-오프 동작을 제어하여 DC 링크 커패시터의 직류전압을 제 2 인덕터의 에너지 저장 기능을 통해 다른 레벨의 직류전압으로 변환하고 회생 제동 에너지를 수퍼 커패시터에 저장하도록 제 2 전력변환기를 제어할 수 있다. 일 실시예에서,가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 모터의 감속이나 정지에 의한 회생 제동 에너 지에 의해 소정의 전압 이상이 되면 제 2 전력변환기를 제어하여 수퍼 커패시터에 회생 제동 에너지 를 저장하도록 할 수 있다. 소정의 전압은 예를 들어 통상의 DC 링크 커패시터 양단의 전압보다 3V 이상 큰 전압일 수 있다. 예를 들어 회생 제동이 없을 때 정류기(1120_1)에 의해 DC 링크 커패시터에 확립되는 직류 전압이 311V라고 하면 소정의 전압은 314V 일 수 있다. 물론 이는 일 실시예이며, 소정의 전압은 더 높을 수도 있다(예) 318V). 일 실시예에서, 제 2 전력변환기는 입력되는 직류전압을 감압시키는 감압 컨버터(buck converter)를 포함할 수 있다. 가전장치의 프로세서는 DC 링크 커패시터의 전압을 DC 링크 전압 센서(도시되지 않음)에 의해 모니터링할 수 있다. 프로세서는 모터가 다시 가속하거나 회전 운동을 재개하는 재기동 이벤트에 기초하여 수퍼 커패 시터에 저장된 전력을 모터의 재기동을 위해 사용될 수 있도록 제 4 스위치를 메인 스위치로 제어하여 수퍼 커패시터에 저장된 전력을 DC 링크 커패시터로 되돌려 주도록 제어할 수 있다. 또는 가 전장치의 프로세서는 DC 링크 커패시터의 전압을 모니터링하면서 DC 링크 커패시터의 전압 변동에 따라 제 4 스위치를 메인 스위치로 제어하여 수퍼 커패시터에 저장된 전력을 DC 링크 커패시터로 되돌 려 주도록 제어할 수 있다. 일 실시예에서, 이 때 제 2 전력변환기는 수퍼 커패시터에서 DC 링크 커 패시터 방향으로 승압 컨버터(boost converter)로 동작할 수 있다. 가전장치는 수퍼 커패시터에 확립된 직류전압을 입력으로 하는 제 3 전력변환기를 더 포함할 수 있다. 제 3 전력변환기는 제 3 절연용 변압기와 제 3 스위치를 포함할 수 있다. 일 실시예에 서, 가전장치의 프로세서는 제 3 스위치의 온/오프 동작을 제어하여 수퍼 커패시터에 확립된 직류전 압을 감압하여 부하에 제공하도록 할 수 있다. 제 3 전력변환기가 포함하는 제 3 절연용 변압기 와 제 3 스위치의 동작에 의해 소정의 전압 레벨(12V, 5V 또는 3.3V 등)에 따라 동작하는 부하(5 0)에 전원이 공급될 수 있다. 부하가 어떤 부하를 포함하는지는 도 6a에서 상세히 설명하였으므로 반복되는 설명은 생략하도록 한다. 일 실시예에서, 부하 입력단에는 제 1 전력변환기의 출력과 연결되는 제 1 다이오드와 제 3 전력 변환기의 출력과 연결되는 제 2 다이오드가 구비될 수 있다. 제 1 다이오드와 제 2 다이오드(8 2)는 부하로의 입력으로 제 1 전력변환기의 출력과 제 3 전력변환기의 출력 중 어느 것을 선택 할 것인지를 선택하기 위한 선택기로서 기능할 수 있음은 이미 설명한 바 있으므로 상세한 설명은 생략한다. 일 실시예에서, 제 3 전력변환기는 DC/DC 컨버터를 포함할 수 있고 DC/DC 컨버터는 감압(buck) 컨버터일 수 있다. 도 14는 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 14에서 모터를 구동하기 위한 인버터, DC 링크 커패시터 및 DC 링크 커패시터에 직류전 압을 공급하는 정류기로 이루어진 부분은 통상의 인버터 구성이다. 제 1 전력변환기는 내부에 제 1 절연용 변압기와 DC/DC(직류전압 변환) 변환을 위한 제 1 스위치를 포함할 수 있다. 부하는 앞 서 설명된 바 있으므로 상세한 설명은 생략하도록 한다. 도 14에서 일 실시예에 따른 제 1 전력변환기는 직류전압을 생성하기 위한 정류기 외에 별도의 정 류기를 사용하지 않고 DC 링크 커패시터의 직류전압을 인버터와 공유할 수 있다. 제 1 전력변환기 는 내부에 제 1 절연용 변압기와 DC/DC 변환(직류전압 변환) 을 위한 제 1 스위치를 포함할 수 있다. 도 14에서 제 1 전력변환기가 제 1 절연용 변압기를 사용하는 것으로 도시되었지만, 일 실시예에 따라서는 비절연형 컨버터를 사용할 수도 있다. 제 1 전력변환기는 신호 레벨의 직류전압을 가 전장치에 공급하기 위한 SMPS(switched mode power supply)를 포함할 수 있다. 도 14에 따른 회생 제동 구성은 제 2 전력변환기와 에너지 저장 장치로서 수퍼 커패시터를 포함할 수 있다. 제 2 전력변환기와 수퍼 커패시터에 대한 동작은 도 13에서 상세히 설명하였으므로 중복되는 설명은 생략하도록 한다. 도 14에 따른 가전장치는 수퍼 커패시터에 확립된 직류전압을 입력으로 하는 제 3 전력변환기를 더 포함할 수 있다. 제 3 전력변환기에 대한 설명 역시 도 13에서 상세히 설명하였으므로 중복되는 설명은 생략하도록 한다. 제 3 전력변환기가 포함하는 제 3 절연용 변압기와 제 3 스위치의 동작에 의해 소정의 전압 레벨(12V, 5V 또는 3.3V 등)에 따라 동작하는 부하에 전원이 공급될 수 있다. 부하가 어떤 부하를 포함하는지는 도 6a에서 상세히 설명하였으므로 반복되는 설명은 생략하도록 한다. 일 실시예에서, 부하 입력단에는 제 1 전력변환기의 출력과 연결되는 제 1 다이오드와 제 3 전력 변환기의 출력과 연결되는 제 2 다이오드가 구비될 수 있다. 제 1 다이오드와 제 2 다이오드(8 2)는 부하로의 입력으로 제 1 전력변환기의 출력과 제 3 전력변환기의 출력 중 어느 것을 선택 할 것인지를 선택하기 위한 선택기로서 기능할 수 있음은 이미 설명한 바 있으므로 상세한 설명은 생략한다. 일 실시예에서, 제 3 전력변환기는 DC/DC 컨버터를 포함할 수 있고 DC/DC 컨버터는 감압(buck) 컨버터일 수 있다. 도 15는 본 개시의 일 실시예에 따른 가전장치에서 회생 제동이 이루어지는 단계 별 전압과 전류의 변화를 나타 내는 그래프이다. 모터를 구동하는 가전장치에서 회생 제동 구간은 6개의 구간으로 누어질 수 있다. 도 15에서는 각 구간별 로 1~6으로 표시되고 있다. 구간 1에서는 모터에 의한 회생 제동이 일어나지 않고 가전장치의 인버터 회로가 정상 동작을 하는 상태 이다. 구간 1에서 모터는 가속하거나 정속 상태일 수 있다. DC 링크 커패시터의 전압은 정상 상태를 유지하는데, 그 전압값은 통상 311V이다. 구간 2에서 모터는 감속하게 되고 회생 제동 상태가 된다. 모터의 회생 제동이 시작되면서 DC 링크 커패시터의 전압이 상승하게 된다. 이 때 인버터의 각 스위치에 포함된 역병렬 다이오드에 의해 인버 터는 정류기와 같이 동작하게 된다. 일 실시예에서, 가전장치의 프로세서는 DC 링크 커패시터 양단의 전압을 감지하는 DC 링크 전압 센서에 의해 감지된 전압을 모니터링할 수 있다. 구간 3에서 가전장치의 프로세서는 DC 링크 커패시터의 전압이 소정의 전압 이상 - 예) 311V + 3V = 314V - 이 되면 에너지 저장 장치에 에너지를 충전하도록 전력변환기를 제어할 수 있다. 일 실시예에서, 소정의 전압은, 예를 들어 DC 링크 커패시터가 보통 정상 동작 시 311V일 때 이보다 +3V를 초과하는 314V일 수 있 다. 다만, 이는 일 실시예일 뿐, 소정의 전압은 이 보다 더 높게 설정될 수 있다(예) 318V). 회생 제동 시 DC 링크 커패시터 양단의 목표 제어 전압(전압 지령)은 위 소정의 전압(314V) 값과 동일할 수 있고 그보다 작 을 수 있다. 에너지 저장 장치는 수퍼 커패시터를 포함할 수 있다. 에너지 저장 장치는 충방전이 가능한 배터리를 포함할 수 있다. 에너지 저장 장치에 에너지를 충전하도록 제어되는 전력변환기는 도 7 내지 도 14의 제 1 전력 변환기, 제 2 전력변환기 및 제 3 전력변환기 중 적어도 하나를 포함할 수 있다. 일 실시예 에서, 제 1 전력변환기는 SMPS를 포함할 수 있다. 일 실시예에서, 제 1 전력변환기는 PCB, 프로세 서, 사용자 인터페이스, 통신부에 대응되는 부하에 전력을 공급하는 SMPS일 수 있다. 일 실시예에서, 제 2 전력변환기는 수퍼 커패시터에 에너지를 충전하기도 하고 DC 링크 커패시터 측으로 에너지를 되 돌려 줄 수도 있도록 제어되는 양방향 벅-부스트 컨버터를 포함할 수 있다. 일 실시예에서, 제 3 전력변환기 는 수퍼 커패시터에 충전된 전력을 부하에서 소비하도록 제어되는 DC/DC 컨버터를 포함할 수 있 다. 일 실시예에 따라, 구간 3에서 제 2 전력변환기에 의해 수퍼 커패시터 또는 배터리를 포함하는 에너지 저장 장치에 에너지 충전이 개시되면 에너지 저장 장치의 단자 전압이 상승하게 되고 에너지 저장 장치 충전 전류도 상승하게 된다. DC 링크 커패시터의 에너지가 에너지 저장 장치로 이동하므로 DC 링크 커패시 터의 전압은 구간 3에서 보는 바와 같이 떨어질 수 있다. 혹은 DC 링크 커패시터의 전압이 구간 3에서 소정의 전압에 다다르면 그 이후 구간 4에서 DC 링크 커패시터의 전압이 소정의 전압을 유지하도록 가전장 치의 프로세서는 전력변환기 등을 제어할 수 있다. 구간 4에서 앞서 기술한 바와 같이 가전장치의 프로세서는 DC 링크 커패시터의 양단 전압이 설정된 소정의 전압에 다다르면 DC 링크 커패시터의 양단 전압이 소정의 전압을 유지하도록 제어할 수 있다. 이 때 제어를 위해 소정의 전압과 DC 링크 커패시터 양단의 전압을 입력으로 하는 PI 제어기가 사용될 수 있으나, 이에 제한되는 것은 아니고 P 제어기나 PID 제어기도 사용될 수 있다. DC 링크 커패시터의 양단 전압이 소정의 전압을 유지하도록 제어되는 동안, 에너지 저장 장치에 충전되는 충전 전류는 도 15에서 보는 바와 같이 소정의 일정 전류값을 유지할 수 있다. 다시 말해서, 구간 4는 에너지 저장 장치에 충전되는 충전 전류가 일정한 정전류 모드라고 할 수 있다. 일 실시예에서, 회생 제동 에너지를 에 너지 저장 장치로 이동시키는 동작을 트리거링하는 이벤트는 DC 링크 커패시터의 양단 전압이 소정의 전압 에 이르는 것이고, 구간 4에서 제어기 동작에 의해 DC 링크 커패시터의 양단 전압이 소정의 전압을 유지하는 것으로 설명하였으나, 구간 4에서 DC 링크 커패시터가 유지하게 되는 양단 전압은 소정의 전압보다 약간 작을 수도 있다. 다시 말해서, 회생 제동 에너지를 에너지 저장 장치로 이동시키는 동작을 트리거링하는 이벤트 를 위한 소정의 전압이 311V + 3V = 314V라면, 구간 4에서 DC 링크 커패시터가 일정하게 유지되는 소정의 전압(소정의 전압 지령)은 311V + 1.5V = 312.5V일 수 있다. 물론 이는 일 실시예일 뿐 소정의 전압과 전압 지 령(회생 제동 시 목표 제어 전압)이 동일할 수도 있다. 구간 4에서 에너지 저장 장치의 전압은 정전류가 입력되면서 지속적으로 증가하게 된다. 구간 5에서는 DC 링크 커패시터에 저장된 에너지가 에너지 저장 장치 충전에 부족하여 에너지 저장 장치로 의 충전 전류가 감소하는 것을 확인할 수 있다. 에너지 저장 장치로의 충전 전류가 감소하면 에너지 저장 장치 의 전압은 더 이상 상승하지 않고 일정한 값을 유지하게 되고 DC 링크 커패시터 전압은 감소하여 통상 입력 전압의 정류에 의해 확립되는 311V에 이를 수 있다. 구간 6에서는 모터가 완전히 정지하거나 정속으로 운전되는 상태이고, 에너지 저장 장치에 충전이 완료된 상태 이다. 도 16은 본 개시의 일 실시예에 따라 회생 제동 에너지를 제어기 동작에 의해 에너지 저장 장치에 충전하는 동 작을 나타내는 도면이다. 도 16의 제어기 동작은 가전장치의 프로세서에 의해 이루어질 수 있다. 제어기는 DC 링크 커패시터 의 전압을 DC 링크 전압 센서에 의해 센싱하여 이를 입력받는다. DC 링크 커패시터의 전압은 전 압 지령(Vref)과 비교되어 제 1 제어기에 입력된다. 제 1 제어기의 출력은 상하한 리미터에 의 해 상한값과 하한값에 리미트가 가해진다. 상하한 리미터의 최종 출력은 일종의 전류 지령(iref)이라고 할 수 있다. 전류 지령(iref)은 전류센서에 의해 센싱된 제 2 전력변환기에 흐르는 전류값에 의해 차 감되어 제 2 제어기에 입력된다. 제 2 제어기의 출력은 PWM 생성기의 입력이 되고, PWM 생성기 는 제 2 스위치를 통한 벅-컨버팅 - DC 링크 커패시터로부터 에너지 저장 장치인 수퍼 커패시터 로의 감압 변환 - 을 수행할지 아니면 제 4 스위치를 통해 부스트 컨버팅 - 수퍼 커패시터로부터 DC 링크 커패시터로의 승압 변환 - 을 수행할지를 결정하여 제 2 스위치 또는 제 4 스위치로 게이트 신호를 출력할 수 있다. 도 16에서는 회생 제동이 이루어져 DC 링크 커패시터 전압이 상승함으로 인 해 DC 링크 커패시터로부터 에너지 저장 장치인 수퍼 커패시터로 에너지를 전달해야 함으로, 제 2 스위 치로 게이트 신호가 출력될 것이다. buck 신호와 boost 신호는 제 1 제어기와 제 2 제어기의 제어기 결과에 따라 최종적으로 제 2 스위치와 제 4 스위치에 각각 입력되는 PWM(Pulse Width Modulation) 게이트 신호이다. 제 1 제어기와 제 2 제어기은 PI 제어기가 사용될 수 있으나 이에 제한되는 것은 아니고, P 제어기나 PID 제어기 또는 PR 제어기 등이 사용될 수 있다. 제 1 제어기는 전압 제어기로 볼 수 있고 제 2 제어기 는 전류 제어기라 할 수 있다. 제 1 제어기와 제 2 제어기는 아날로그 회로로 구성될 수도 있고 디지털 회로로 구성될 수도 있다. 도 17은 본 개시의 일 실시예에 따른 회생 제동 제어 시 전압과 전류를 도시한 그래프이다. 도 17을 참조하면, t1 시점에서 회생 제동에 따른 DC 링크 커패시터의 전압 제어가 개시된다. 다시 말해서 t1 시점에서 DC 링크 커패시터의 전압이 소정의 전압보다 커짐으로 인해 가전장치는 DC 링크 커패시터 의 전압 제어를 개시하게 된다. 이 때 수퍼 커패시터에 전류가 충전되기 시작하고 소정의 시점이 지나면 수 퍼 커패시터로의 충전 전류는 일정한 값으로 충전이 되는 정전류 모드에 진입한다. 그리고 수퍼 커패시터 전압은 충전 전류가 일정한 값으로 충전이 되므로 일정한 기울기로 상승하게 된다. 도 17의 t2 시점에서 모터가 정지하거나 정속으로 동작함으로 인해 회생 제동 에너지가 더 이상 발생하지 않으면 DC 링크 커패 시터 전압은 안정화되고, 따라서 DC 링크 커패시터의 전압 제어는 종료된다. DC 링크 커패시터의 전압 제어가 종료되면 수퍼 커패시터로의 충전도 종료되므로 충전 전류는 0이 되고 수퍼 커패시터의 전 압은 일정한 값으로 유지된다. 도 18은 본 개시의 일 실시에에 따라 에너지 저장 장치에서 방전 시의 전압과 전류를 도시한 그래프이다. 도 18을 참조하면, 에너지 저장 장치에서 DC 링크 커패시터로 방전될 시 DC 링크 커패시터 혹은 부하의 입력 전압, 에너지 저장 장치의 전압, 그리고, 에너지 저장 장치의 방전 전류가 도시되고 있다. 에너지 저장 장치의 방전은 가전장치의 부하에 에너지를 공급할 수 있거나 DC 링크 커패시터에 에너지 를 공급할 수도 있다. 가전장치의 프로세서는 에너지 저장 장치가 에너지를 공급할 때는 전압제어를 통해 에너 지 저장 장치의 정격을 초과하지 않는 범위 내에서 DC 링크 커패시터의 전압(311V)이나 부하의 전압(예) 12V 혹은 5V)보다 약간 큰 전압으로 에너지 저장 장치의 전압을 제어할 수 있다. 에너지 저장 장치로 부터 방전되는 방전 전류는 부하의 크기에 따라 자동 결정되며, 에너지 저장 장치의 전류 정격을 넘지 않도록 제어될 수 있다. 도 18의 0에서 t3까지 구간에서는 정상 동작 상태로서, 에너지 저장 장치에서 방전이 이루어지지 않고 에너지 저 장 장치의 전압이 일정하게 유지되는 상태이다. 도 18의 t3에서 t4까지 구간에서는 에너지 저장 장치 뒷단에 제 3 전력변환기가 구비된 도 7, 도 8, 도 9 및 도 10에 따른 회생 제동 구성도에서는 에너지 저장 장치의 방전을 위해 제 3 전력변환기가 동작한다. 이 때 가전장치의 프로세서가 제 3 전력변환기를 제어하여 제 3 전력변환기가 출력하는 전압의 크 기는 제 1 전력변환기의 출력 전압보다 약간 크도록 한다. 이 때 프로세서가 제어하여 제 3 전력변환기 에서 출력되는 전압의 최대값은 부하의 정격 전압을 넘지 않도록 한다. 이 경우, 부하 혹은 에너 지 저장 장치의 에너지 저장 능력이 작아서 에너지 저장 장치의 단자 전압이 크게 감소할 경우 에너지 저장 장 치의 방전 전류는 증가하거나 부하 혹은 에너지 저장 장치의 에너지 저장 능력이 커서 에너지 저장 장치의 단자 전압이 일정할 경우 에너지 저장 장치의 방전 전류는 거의 일정하다. 도 13 및 도 14에 따른 회생 제동 구성도에서는 제 3 전력변환기 외에 제 2 전력변환기가 DC 링크 커패시터 방향으로 승압 컨버터(boost converter)로 동작할 수 있다. 또한, 도 11 및 도 12에 따른 회생 제 동 구성도에서는 제 3 전력변환기가 포함되지 않는 경우로써, 에너지 저장 장치가 방전할 때 제 2 전력변 환기가 DC 링크 커패시터 방향으로 승압 컨버터(boost converter)로 동작할 수 있다. 이 때 제 2 전 력변환기는 입력전원의 피크 전압보다 큰 전압으로 에너지 저장 장치의 출력 전압이 출력되도록 제 어될 수 있다. 만약 정류기의 다이오드가 전압 더블러(voltage doubler)인 경우 제 2 전력변환기는 입력전원의 피크 전압*2보다 큰 전압으로 에너지 저장 장치의 출력 전압이 출력되도록 제어될 수 있다. 예를 들어 입력전원의 입력 전압이 220V(rms)이고 정류기가 일반 정류기일 경우 입력전원의 피크 전압은 311V이다. 따라서, 가전장치의 프로세서는 제 2 전력변환기를 제어하여 에너지 저장 장치의 출력 전압을 311V보다 약간 더 큰 320V로 제어를 수행할 수 있다. 북미와 같이 입력전원의 입력 전압이 120V(rms)일 경우 정류기는 전압 더블러(voltage doubler)가 적용될 수 있다. 이 때 가전장치의 프로세서 는 제 2 전력변환기를 제어하여 에너지 저장 장치의 출력 전압이 120V(rms)의 피크 전압의 2배인 339V보 다 약간 큰 전압(345V)이 되도록 제 2 전력변환기를 제어할 수 있다. 입력전원과 DC 링크 커패시터 사이에는 다이오드를 포함하는 정류기가 있기 때문에 DC 링크 커패시터 양단 전압이 입력전원 의 전압보다 클 경우 자동으로 입력전원의 입력전압은 차단된다. t3에서 t4까지 구간은 에너지 저장 장치에서 방전이 종료된 후 정상 동작 상태를 보여주는 구간이다. 이 때 DC 링크 커패시터의 양단 전압은 통상의 전압(311V)을 유지하게 되고 에너지 저장 장치로부터의 방전 전류는 더 이상 흐르지 않는다. 도 19은 본 개시의 일 실시예에 따라 에너지 저장 장치에서 DC 링크 커패시터로 방전되는 동작을 나타내는 도면 이다. 도 16에서 가전장치의 프로세서가 제어기를 제어하여 회생 제동에 의해 발생한 에너지를 DC 링크 커패시터 로부터 에너지 저장 장치로 충전하는 경로를 도시하였다면, 도 19에서는 반대로 더 이상 회생 제동 에너지 가 발생하지 않는 상태에서 에너지 저장 장치로부터 DC 링크 커패시터로 에너지를 방전하는 경로를 도시한 다. 도 19의 제어기 동작은 가전장치의 프로세서에 의해 이루어질 수 있다. 제어기는 DC 링크 커패시터 의 전압을 DC 링크 전압 센서에 의해 센싱하여 이를 입력받는다. DC 링크 커패시터의 전압은 전 압 지령(Vref)과 비교되어 제 1 제어기에 입력된다. 제 1 제어기의 출력은 상하한 리미터에 의 해 상한값과 하한값에 리미트가 가해진다. 상하한 리미터의 최종 출력은 일종의 전류 지령(iref)이라고 할 수 있다. 전류 지령(iref)은 전류센서에 의해 센싱된 제 2 전력변환기에 흐르는 전류값에 의해 차 감되어 제 2 제어기에 입력된다. 제 2 제어기의 출력은 PWM 생성기의 입력이 되고, PWM 생성기 는 제 2 스위치를 통한 벅-컨버팅 - DC 링크 커패시터로부터 에너지 저장 장치인 수퍼 커패시터 로의 감압 변환 - 을 수행할지 아니면 제 4 스위치를 통해 부스트 컨버팅 - 수퍼 커패시터로부 터 DC 링크 커패시터로의 승압 변환 - 을 수행할지를 결정하여 제 2 스위치 또는 제 4 스위치 로 게이트 신호를 출력할 수 있다. 도 19에서는 앞선 도 18과 같은 에너지 저장 장치에서 방전이 일어나는 경우 이므로 프로세서는 제 4 스위치의 스위칭을 제어하여 에너지 저장 장치의 에너지를 DC 링크 커패시터(6 0)로 되돌려준다. 도 19에서 buck과 boost 신호는 제 1 제어기와 제 2 제어기의 제어기 결과에 따라 최종적으로 제 2 스위치와 제 4 스위치에 각각 입력되는 PWM(Pulse Width Modulation) 게이트 신 호이다. 도 19에서는 PWM 생성기에 의해 boost 신호로 PWM 게이트 신호가 출력되어 제 4 스위치가 동작하고 에너지 저장 장치의 전압이 DC 링크 커패시터로 승압 변환된다. 제 1 제어기와 제 2 제어기는 PI 제어기가 사용될 수 있으나 이에 제한되는 것은 아니고, P 제어기나 PID 제어기 또는 PR 제어기 등이 사용될 수 있다. 제 1 제어기는 전압 제어기로 볼 수 있고 제 2 제어기 는 전류 제어기라 할 수 있다. 제 1 제어기와 제 2 제어기는 아날로그 회로로 구성될 수도 있고 디지털 회로로 구성될 수도 있다. 도 20은 본 개시의 일 실시예에 따라 에너지 저장 장치에서 부하로 방전되는 동작을 나타내는 도면이다. 도 19에서는 회생 제동 에너지가 발생하지 않는 상태에서 에너지 저장 장치로부터 DC 링크 커패시터로 에너 지를 방전하는 경로를 도시하였다면, 도 20에서는 회생 제동 에너지가 발생하지 않는 상태에서 에너지 저장 장 치로부터 부하로 에너지를 방전하는 경로를 도시한다. 도 20의 제어기 동작은 가전장치의 프로세서에 의해 이루어질 수 있다. 제어기는 부하의 전압을 부하 전압 센서에 의해 센싱하여 이를 입력받는다. 부하 전압 센서는 부하 측 그라운드와 절연되는 절연형 전압 센서일 수 있다. 부하의 전압은 전압 지령(Vref)과 비교되어 제 3 제어기에 입력된다. 제 3 제어기의 출력은 상하한 리미터에 의해 상한값과 하한값에 리미트가 가해진다. 상하한 리미터(22 0)의 최종 출력은 PWM 생성기의 입력이 되고, PWM 생성기는 제 3 스위치에 게이트 신호를 전달 하여 통한 벅-컨버팅을 수행하여 에너지 저장 장치인 수퍼 커패시터에서 부하로의 감압 변환을 수행할 수 있다. 가전장치의 프로세서는 PWM 생성기를 통해 제 3 스위치로의 게이트 신호(PWM 게이트 신 호)를 송출하도록 제어기를 제어할 수 있다. 제 3 제어기 는 PI 제어기가 사용될 수 있으나 이에 제한되는 것은 아니고, P 제어기나 PID 제어기 또는 PR 제어기 등이 사용될 수 있다. 제 3 제어기는 전압 제어기로 볼 수 있고 아날로그 회로나 디지털 회로로 구성될 수 있다. 도 21은 본 개시의 일 실시예에 따른 DC 링크 커패시터 전압 안정화 시퀀스를 나타내는 그래프이다. 세탁기와 같은 가전장치에서 모터를 구동하는 인버터 구성은 정류기에 의해 교류 입력전압을 직류 전압으로 변환하고 변환된 직류전압을 DC 링크 커패시터에 의해 평활화되고, 인버터에 의해 교류전압 으로 변환되어 모터를 구동하게 된다. DC 링크 커패시터는 정류기에 의해 변환된 직류전압의 리플을 저감시키고, 커패시터의 특성 상 순간 정전 시에도 어느 정도 전원을 유지하는 기능을 수행할 수 있다. 그러나 입력전원을 공급하는 계통 전원이 순간적인 써지 전압이나 부하 변동 등으로 인해 불안정할 경우 DC 링크 커패시터의 전압이 상승할 수 있다. 이 경우 DC 링크 커패시터와 DC 링크 커패시터에 연결 된 소자에는 상승된 전압으로 인해 스트레스가 발생할 수 있다. 기존에는 DC 링크 커패시터의 커패시턴스를 늘려 전압 상승량을 억제하거나 일정 전압 이상일 경우 강제로 DC 링크 커패시터와 연결되는 전원을 차단하는 방법을 사용하였으나, 전자의 경우 커패시터의 크기가 커지 고 단가가 상승하는 문제가 있고 후자의 경우 가전장치 동작의 연속성이 단절되는 문제가 있다. 따라서, 본 개 시의 일 실시예에 따라 도 7 내지 도 14에 도시된 회생 제동 구성을 사용하여 에너지 저장 장치의 충방전에 의 해 이러한 문제를 개선할 수 있다. 이러한 에너지 저장 장치의 충방전을 나타내는 도면이 도 21이다. 도 21을 참조하면, 에너지 저장 장치의 충방전 동작은 7개의 구간으로 나눌 수 있는데, 구간 1에서는 DC 링크 커패시터의 양단 전압이 상승하지 않고 모터가 구동되는 정상 상태를 보여준다. 구간 2에서는 가전장치가 연결된 계통의 이상 또는 부하의 순간적인 변동이 따라 DC 링크 커패시터 양단 전 압이 상승하게 된다. 일례로 모터의 정지에 의한 역기전력 발생으로 역기전력에 따른 회생 제동 에너지가 DC 링크 커패시터로 전달되어 DC 링크 커패시터 전압이 상승할 수 있다. 구간 3에서는 DC 링크 커패시터 양단의 전압을 모니터링하는 가전장치의 프로세서는 DC 링크 커패시터 양단 전압이 소정의 전압 이상이 되면 이를 트리거링 이벤트로 하여 DC 링크 커패시터의 상승된 에너지를 에너지 저장 장치로 충전하도록 전력변환기를 제어하게 된다. 전력변환기는 도 7 내지 도 14에서 본 바와 같이 제 2 전력변환기를 포함할 수 있다. 구간 3에서는 에너지 저장 장치로 충전이 발생하므로 에너지 저장 장 치의 전압이 상승하게 되고 에너지 저장 장치로의 충전 전류가 일정한 값을 가지는 정전류 모드에 있게 된다. 이 때 DC 링크 커패시터 양단의 전압은 하강하여 통상 정류기에 의해 변환된 전압값을 유지하거나 그 보다 약간 높은 소정의 전압을 유지하게 된다. 구간 4에서는 DC 링크 커패시터 양단의 전압이 소정의 전압 상태인 안정 상태에 이르게 되고 에너지 저장 장치로의 충전도 중단되며 에너지 저장 장치는 소정의 전압값을 유지하게 된다. 구간 5에서는 가전장치 자체의 부하 혹은 가전장치가 연결된 계통의 이상으로 DC 링크 커패시터 양단 전압 이 하강하는 현상이 발생한다. 일례로 가전장치와 연결된 부하의 에너지 요구량이 높아지거나 계통에서 순 간 정전으로 입력전원이 가전장치에 전력을 공급하지 못하는 경우를 들 수 있다. 구간 6에서는 DC 링크 커패시터 양단 전압이 앞선 소정의 전압과 다른 제 2 소정의 전압 이하가 되면, 프로 세서는 제 2 전력변환기를 제어하여 에너지 저장 장치의 에너지를 DC 링크 커패시터로 되돌려주어 DC 링크 커패시터의 전압이 다시 상승하여 통상 정류기에 의해 변환된 전압값을 회복할 수 있도록 할 수 있다. 제 2 소정의 전압은 예를 들어 308V(311V-3V)일 수 있다. 이 때 에너지 저장 장치로부터 DC 링크 커패시 터로 방전 전류(에너지 저장 장치 입장에서는 (-) 전류)가 흐르게 되고, 에너지 저장 장치의 전압은 하강하 게 된다. 구간 7에서는 DC 링크 커패시터가 통상 정류기에 의해 변환된 전압값에 다다르면 가전장치의 프로세 서는 에너지 저장 장치로부터의 방전을 중단하도록 제 2 전력변환기를 제어할 수 있다. 에너지 저장 장치 와 DC 링크 커패시터는 구간 7에서 다시 일정한 전압을 유지할 수 있게 된다. 도 22는 본 개시의 일 실시예에 따른 세탁기의 탈수모드의 파형도이다. 가전장치로서 세탁기에는 세탁모드와 탈수모드가 있는데, 세탁모드에서는 모터의 회전 방향 전환과 정지 가 상대적으로 잦다. 그에 반해 탈수모드에서는 모터의 정지 횟수가 상대적으로 적으나 세탁물이 젖어 있 는 상태이므로 관성이 높은 상태이고 따라서 모터의 회전력이 더 커야 한다. 도 22에 따르면 세탁기가 탈수 중 모터가 정지하는 시점에서 DC 링크 커패시터의 전압이 상승하게 됨 을 알 수 있고, 이 때 에너지 저장 장치로의 충전 전류가 상승하게 된다. 충전 전류를 정지 구간 - 도 22에서는 약 22초 - 동안 지속적으로 에너지 저장 장치로 흐르게 되고 에너지 저장 장치의 전압은 정지 구간 동안 지속적 으로 상승함을 알 수 있다. 일 실시예에 따라 에너지 저장 장치로의 충전 전류에 전류 리미트 - 예를 들어 20[A] - 가 걸릴 수 있고 이는 정지 구간 길이에 영향을 미칠 수 있다. 예를 들어, 전류 리미트가 클수록 정지 구간이 짧아질 수 있다. 도 23은 본 개시의 일 실시예에 따른 모터 정지 시 과전압 발생 시의 파형도이다. 도 23을 참조하면, 모터가 급격하게 정지하는 등의 이유로 DC 링크 커패시터 양단의 전압이 짧은 시 간 안에 급격히 상승하여 과전압이 발생할 수 있다. 이 때 과전압이라고 판단되는 제 4 소정의 전압은 DC 링크 커패시터의 내전압 레벨(예) 450V)에 따라 다를 수 있지만 400V로 설정될 수 있다. 물론 이는 일례일 뿐 동 일한 DC 링크 커패시터의 내전압 레벨에서도 안전을 위해서 과전압이라고 판단하는 전압을 더 낮출 수도 있 고 아니면 더 높일 수도 있다. 도 23에서 DC 링크 커패시터의 전압이 순간적으로 제 4 소정의 전압인 400V가 되면 에너지 저장 장치가 DC 링크 커패시터에서 순간적으로 발생하는 과전압에 따른 에너지를 순간적으로 모두 충전하기 어려울 수 있다. 따라서, 가전장치의 프로세서는 DC 링크 커패시터의 양단 전압이 과전압이라고 판단하는 소정의 전압 (제 4 소정의 전압)에 이르면 에너지 저장 장치에 충전 전류가 흐르도록 제 2 전력변환기를 제어하면서도 인버터의 스위치들을 제어하여 앞선 도 2c에서와 같은 단락 제동을 수행할 수 있다. 이와 같은 단락 제동 을 통해 순간적으로 DC 링크 커패시터 양단 전압이 급격히 상승하는 것을 방지한 후 가전장치의 프로세서는 제 2 전력변환기를 제어하여 DC 링크 커패시터의 회생 제동 에너지를 에너지 저장 장치에 저장할 수 있다. 도 24는 본 개시의 일 실시예에 따른 가전장치의 블록도이다. 도 24의 블록도에 따른 가전장치는 도 7 내지 도 14, 도 16에 따른 회생 제동 구성을 포함할 수 있다. 도 24의 블록도에 의한 가전장치는 도 19 및 도 20에 따른 방전 구성을 포함할 수 있다. 또한, 도 24의 블 록도에 따른 가전장치는 도 1의 세탁기를 포함할 수 있다. 도 24에 도시된 바와 같이, 본 개시의 일 실시예에 따른 가전장치는, 구동부, 프로세서, 통 신부, 센서부, 출력 인터페이스, 입력 인터페이스, 메모리, 모터, 및 에 너지 저장 장치를 포함할 수 있다. 가전장치의 각 구성요소들은 모두 필수적인 것은 아니며, 제조 사의 설계 사상에 따라 각 구성요소들은 가감될 수 있다. 이하 상기 구성요소들에 대해 차례로 살펴본다. 구동부는 외부 전원으로부터 전력을 공급받고, 프로세서의 구동 제어 신호에 따라 부하에 전류 를 공급할 수 있다. 구동부는 EMI (Electro Magnetic Interference) 필터, 정류기, 인버터 , 제 1 전력변환기, 제 2 전력변환기 및 제 3 전력변환기를 포함할 수 있으나, 이에 한정되는 것은 아니다. 제 3 전력변환기는 가전장치의 회생 제동 구성에 따라 가전장치에 포 함될 수도 있고 그렇지 않을 수도 있다. EMI 필터는 입력전원으로부터 공급되는 교류전압에 포함된 고주파 잡음을 차단하고, 미리 정해진 주파수(예를 들어, 50Hz 또는 60Hz)의 교류전압과 교류 전류를 통과시킬 수 있다. EMI 필터와 입력전원 사이에는 과전류를 차단하기 위한 퓨즈(Fuse)와 릴레이(Relay)가 마련될 수 있다. EMI 필터에 의 하여 고주파 잡음이 차단된 교류 전력은 정류기에 공급된다. 정류기는 교류전압을 직류전압으로 변환할 수 있다. 예를 들어, 정류기는 시간에 따라 크기와 극성 (양의 전압 또는 음의 전압)이 변화하는 교류전압을 크기와 극성이 일정한 직류전압으로 변환하고, 시간에 따라 크기와 방향(양의 전류 또는 음의 전류)이 변화하는 교류전류를 크기가 일정한 직류 전류로 변환할 수 있다. 정 류기는 브리지 다이오드를 포함할 수 있다. 예를 들어, 정류기는 4개의 다이오드를 포함할 수 있다. 브리지 다이오드는 시간에 따라 극성이 변화하는 교류전압을 극성이 일정한 양의 전압으로 변환하고, 시 간에 따라 방향이 변화하는 교류전류를 방향이 일정한 양의 전류(직류전류)로 변환할 수 있다. 또 다른 일 실 시예에서, 정류기는 2개의 다이오드와 2개의 싸이리스터를 포함할 수 있다. 1개의 싸이리스터와 1개의 다 이오드가 1개의 정류 레그를 구성하고, 또 다른 1개의 싸이리스터와 1개의 다이오드로 또 다른 1개의 정류 레그 를 구성할 수 있다. 하지만, 이는 입력전원이 단상인 경우로서, 만일 입력전원이 3상이면, 3개의 싸이리스터와 3개의 다이오드로 3개의 레그를 포함하는 정류기를 구성할 수 있다. 프로세서는 싸이 리스터를 제어하여, DC 링크 커패시터에 충전되는 전압이 급격하게 증가하지 않고 서서히 증가하도록 제어 할 수 있다. 인버터는 모터에 공급되는 전류를 제어할 수 있다. 예를 들어, 인버터에 포함된 스위치들의 턴 온/턴 오프에 따라 모터에 흐르는 전류의 크기가 변화할 수 있다. 이 경우, 모터에는 교류전류 가 공급될 수 있다. 제 1 전력변환기는 주로 고전압을 저전압으로 변환하는 DC/DC 컨버터일 수 있으나 이에 제한되는 것은 아 니다. 일 실시예에서, 제 1 전력변환기는 DC 링크 커패시터 양단을 입력으로 하여 부하가 필요로 하는 직류전압을 공급하는 SMPS일 수 있다. 일 실시예에서, 제 1 전력변환기는 DC 링크 커패시터 양 단을 입력으로 하지 않고 입력전원과 연결되는 정류기와 별도의 정류기인 제 2 정류기(1120_2)와 연결되어 제 2 정류기(1120_2)에 의해 생성되는 직류전압을 입력으로 하여 부하가 필요로 하는 직류전압을 공급하는 SMPS일 수 있다. 제 1 전력변환기는 전압을 변환시키기 위한 제 1 스위치를 포함할 수 있 다. 또한 제 1 전력변환기는 생성되는 저전압이 입력전원 측과 절연되도록 제 1 절연용 변압기를 포함할 수 있으나 이에 제한되는 것은 아니다. 제 2 전력변환기는 DC 링크 커패시터 양단을 입력으로 하여 에너지 저장 장치에 에너지를 저장 하도록 전압 레벨을 변환시키는 DC/DC 컨버터일 수 있다. 일 실시예에서, 제 2 전력변환기는 DC 링크 커패시터 양단의 고전압을 에너지 저장 장치의 전 압 레벨(예) 30V)에 맞도록 감압할 수 있는 감압 컨버터(벅(buck) 컨버터)일 수 있다. 일 실시예에서, 제 2 전 력변환기는 위 감압 컨버터로서의 기능을 수행하면서, 에너지 저장 장치의 에너지를 DC 링크 커패 시터에 되돌려 줄 수 있도록 에너지 저장 장치의 저전압을 DC 링크 커패시터의 전압 레벨(예) 311V)에 맞도록 승압도 할 수 있는 양방향 벅-부스트 컨버터일 수 있다. 일 실시예에서, 제 2 전력변환기(115 0)는 감압 컨버터로서 기능을 수행하기 위한 제 2 스위치를 포함할 수 있다. 일 실시예에서, 제 2 전력변환기는 승압 컨버터로서 기능을 수행하기 위해 제 4 스위치와 제 2 인덕터도 더 포함할 수 있다. 일 실시예에서, 제 2 전력변환기는 DC 링크 커패시터 혹은 입력전원과 에너지 저장 장치 측을 서로 절연하기 위해 제 2 절연용 변압기를 더 포함할 수 있다. 제 3 전력변환기는 에너지 저장 장치의 에너지를 부하에 공급하도록 전압 레벨을 변환시키는 DC/DC 컨버터일 수 있다. 일 실시예에서, 제 3 전력변환기은 에너지 저장 장치의 전압 레벨을 더 낮은 전압 레벨(예) 3.3V, 5V, 12V)로 변환시키는 감압 컨버터(buck converter)일 수 있으나 이에 제한되는 것 은 아니다. 일 실시예에서, 제 3 전력변환기는 전압 레벨 변환 기능을 수행하기 위한 제 3 스위치 를 포함할 수 있다. 일 실시예에서, 제 3 전력변환기는 에너지 저장 장치 측과 부하 측을 절연 하기 위해 제 3 절연용 변압기를 포함할 수 있다. 프로세서는, 가전장치의 전반적인 동작을 제어할 수 있다. 프로세서는 메모리에 저장 된 프로그램들을 실행함으로써, 구동부, 통신부, 센서부, 출력 인터페이스, 입력 인터 페이스, 메모리를 제어할 수 있다. 본 개시의 일 실시예에 의하면, 프로세서는, 인공 지능(AI) 프로세서를 탑재할 수도 있다. 인공 지능(AI) 프로세서는, 인공 지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 기존의 범용 프로세서(예: CPU 또는 application processor) 또는 그래픽 전용 프로세서(예: GPU)의 일부로 제작되어 가전장치에 탑재될 수도 있다. 본 개시의 일 실시예에 의하면, 프로세서는 가전장치의 제어기가 포함하는 제 1 제어기, 제 2 제어기, PWM 생성기의 제어기 동작을 수행할 수 있다. 프로세서는 필요에 따라 IoT(Internet of Things) 네트워크 상에서 동작하거나 홈 네트워크에서 동작하도 록 통신부를 포함할 수 있다. 통신부는, 근거리 통신부(1310, short-range wireless communication interface), 원거리통신부(1320, long-range wireless communication interface)를 포함할 수 있다. 근거리 통신부는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication interface), Wi-Fi(와이파 이) 통신부, 지그비(Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통 신부, UWB(Ultra Wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 원거리통 신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여기 에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형태 의 데이터를 포함할 수 있다. 원거리통신부는, 3G 모듈, 4G 모듈, 5G 모듈, LTE 모듈, NB-IoT 모듈, LTE-M 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 본 개시의 일 실시예에 의하면, 통신부를 통해 가전장치 외부의 서버나 다른 전기기기와 통신을 하 고 데이터를 송수신할 수 있다. 센서부는 전류 센서 및 DC 링크 전압 센서를 포함할 수 있다. 전류 센서는 가전장치 가 포함하는 회로의 다양한 위치에 배치되어, 전류(주로 교류전류) 정보를 획득할 수 있다. 예를 들어, 전류 센서는 제 2 전력변환기에 흐르는 전류를 센싱하여 센싱된 값은 제어기에서 제 1 제어기 및 상하한 리미터의 출력인 전류 지령에서 차감되어 제 2 제어기에 입력될 수 있다. DC 링크 전압 센서는 DC 링크 커패시터 양단 전압을 센싱하여 전압제어기인 제 1 제어기 입력으로 사용 될 수 있다. 출력 인터페이스는, 오디오 신호 또는 비디오 신호의 출력을 위한 것으로, 디스플레이부와 음향 출 력부 등을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 가전장치는 디스플레이부를 통해서 가전장치와 관련된 정보 를 표시해 줄 수 있다. 예를 들어, 가전장치의 역률 정보나 각 고조파 성분값(예를 들어 입력 전류 대비 각 고조파 성분의 % 혹은 A(ampere))를 디스플레이부에 표시할 수 있거나 회생 제동 여부를 표시할 수도 있고, 에너지 저장 장치의 충전률 등을 표시할 수 있다. 디스플레이부와 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디스플레이부는 출력 장치 이외에 입력 장치로도 사용될 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display), 발광 다이오드(LED, light-emitting diode), 유기 발광 다이오드(organic light-emitting diode), 플렉서블 디스플레이 (flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나를 포함할 수 있다. 그리고 가전장치의 구현 형태에 따라 디스플레이부를 2개 이상 포 함할 수도 있다. 음향 출력부는 통신부로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 또한, 음향 출력부는 가전장치에서 수행되는 기능과 관련된 음향 신호를 출력할 수 있다. 음향 출 력부는 스피커(speaker), 버저(Buzzer) 등을 포함할 수 있다. 본 개시의 일 실시예에 의하면, 출력 인터페이스는 가전장치의 역률 정보, 고조파 성분 정보, 회생 제동 여부, 에너지 저장 장치의 충전률 중 적어도 하나를 디스플레이부를 통해 출력할 수 있다. 본 개시 의 일 실시예에 의하면, 출력 인터페이스는 현재 파워 레벨, 동작 모드(예컨대, 저소음 모드, 일반 모드, 고출력 모드 등), 현재 역률, 에너지 저장 장치의 충전률 등을 표시할 수도 있다. 입력 인터페이스는, 사용자로부터의 입력을 수신하기 위한 것이다. 입력 인터페이스는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표 면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 중 적어도 하나일 수 있으나, 이에 한정되는 것은 아니다. 입력 인터페이스는 음성 인식 모듈을 포함할 수 있다. 예를 들어, 가전장치는 마이크로폰을 통해 아날로그 신호인 음성 신호를 수신하고, ASR(Automatic Speech Recognition) 모델을 이용하여 음성 부분을 컴퓨 터로 판독 가능한 텍스트로 변환할 수 있다. 가전장치는 자연어 이해(Natural Language Understanding, NLU) 모델을 이용하여 변환된 텍스트를 해석하여, 사용자의 발화(utterance) 의도를 획득할 수 있다. 여기서 ASR 모델 또는 NLU 모델은 인공지능 모델일 수 있다. 인공지능 모델은 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계된 인공지능 전용 프로세서에 의해 처리될 수 있다. 인공지능 모델은 학습을 통해 만들어 질 수 있 다. 여기서, 학습을 통해 만들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이 터들을 이용하여 학습됨으로써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공 지능 모델이 만들어짐을 의미한다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들(weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경망 연산을 수행한다. 언어적 이해는 인간의 언어/문자를 인식하고 응용/처리하는 기술로서, 자연어 처리(Natural Language Processing), 기계 번역(Machine Translation), 대화 시스템(Dialog System), 질의 응답(Question Answering), 음성 인식/합성(Speech Recognition/Synthesis) 등을 포함한다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수도 있고, 입/출력되는 데이터들 (예컨대, 가전장치의 역률 정보, 고조파 성분에 관한 정보 등)을 저장할 수도 있다. 메모리는 인공 지능 모델을 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한, 가전장치는 인터넷(internet)상에서 저장 기능을 수행하는 웹 스토리지(web storage) 또는 클라우드 서버를 운영할 수도 있 다. 모터는 교류전압에 의해 구동될 수 있는 회전체로서, 가전장치에서 회전에 의해 세탁이나 건조, 청 소, 공기 조화기 동작, 냉각기 동작 등에 사용될 수 있으나 이에 제한되는 것은 아니다. 모터는 감속 시 에 발생하는 역기전력에 의해 인버터 및 DC 링크 커패시터 측으로 에너지를 되돌려 줄 수 있다. 에너지 저장 장치는 DC 링크 커패시터의 전압이 소정의 전압 이상이 될 때 초과되는 에너지를 저장할 수 있는 장치이다. 에너지 저장 장치는 수퍼 커패시터를 포함할 수도 있고 배터리를 포함할 수도 있다. 배터리는 리튬-이온 배터리일 수도 있고 그 외 다른 충방전이 가능한 배터리일 수 있다. 에너지 저장 장치는 제 2 전력변환기에 의해 DC 링크 커패시터로 에너지를 다시 공급할 수도 있고, 제 3 전 력변환기에 의해 부하에 직류전압을 공급할 수도 있다. 도 25는 본 개시의 일 실시예에 따른 가전장치에서 회생 제동에 의한 에너지 제어 방법을 나타내는 흐름도이다. 도 25에서 따른 흐름도에 따른 제어 방법은 가전장치의 모터의 정지나 감속에 의해 회생 제동이 발 생할 때 DC 링크 커패시터의 에너지를 수퍼 커패시터나 배터리와 같은 에너지 저장 장치로 전달 하는 제어에 관련된다. 도 25를 참조하면 단계 S2510에서, 가전장치의 정류기는 입력전원의 교류전압을 직류전압으로 정류 한다. 단계 S2520에서, 정류기에 의해 정류된 직류전압은 리플이 포함된 직류전압인데, 이 직류전압은 DC 링크 커패시터에 의해 평활화될 수 있다. 단계 S2530에서, DC 링크 커패시터에 의해 평활화된 직류전압은 인버터에 의해 모터를 구동하 기 위한 교류전압으로 변환될 수 있다. 이 때 인버터의 스위치에 인가되는 게이트 신호는 프로세서(120 0)에 의해 생성될 수 있다. 단계 S2540에서, 변환된 교류전압에 의해 가전장치의 모터가 구동된다. 단계 S2550에서 모터가 감속하게 되면 감속에 따른 회생 제동 에너지에 의해 DC 링크 커패시터의 전 압이 상승하게 되고, DC 링크 전압 센서에 의해 센싱된 DC 링크 커패시터의 전압이 만일 제 1 소정의 전압 이상이 되면, 가전장치의 프로세서는 DC 링크 커패시터의 직류전압을 다른 레벨의 직류전 압으로 변환하여 에너지 저장 장치에 충전하도록 제어할 수 있다. 제 1 소정의 전압은 설계에 따라 달라 질 수 있는데, 예를 들어, 314V일 수 있다. 제 2 전력변환기의 감압 컨버팅에 의해 예를 들어 DC 링크 커 패시터의 전압은 에너지 저장 장치 양단의 직류전압(예) 30V)으로 감압되어 에너지 저장 장치 가 충전될 수 있다. 도 26은 본 개시의 일 실시예에 따른 가전장치에서 에너지 저장 장치의 방전 제어 방법을 나타내는 흐름도이다. 도 26에서는 이제 도 25에서 이루어진 에너지 저장 장치로의 충전과 반대로 모터에 의한 회생 제동 이 없고, DC 링크 커패시터 측으로 에너지 저장 장치가 에너지를 전달할 필요가 있는 상황인 경우이 다. 단계 S2610에서, DC 링크 커패시터의 전압은 DC 링크 전압 센서에 의해 센싱될 수 있는데, 만일 센싱 된 DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되면 가전장치의 프로세서는 DC 링크 커패시터 측으로 에너지가 전달되어야 한다고 판단할 수 있다. 이에 가전장치의 프로세서는 제 2 전력변환기를 제어하여 에너지 저장 장치를 방전시켜 DC 링크 커패시터 측으로 전류가 흐르 도록 할 수 있다. 이 때 제 2 전력변환기는 승압 컨버팅(boost converting)을 할 수 있다. 예를 들어 에 너지 저장 장치의 30V 직류전압은 제 2 전력변환기에 의해 DC 링크 커패시터의 양단 전압 311V 로 승압될 수 있다. 단계 S2620에서, DC 링크 커패시터의 전압이 제 3 소정의 전압이 되면 가전장치의 프로세서에 의한 제어에 의해 에너지 저장 장치로부터 DC 링크 커패시터로의 에너지 충전을 중단할 수 있다. 제 3 소정의 전압은 예를 들어, 통상 안정화 상태의 DC 링크 커패시터의 전압인 311V일 수 있다. 본 개시의 일 실시예에 따른 가전장치에서 도시된 구성요소 모두가 필수구성요소인 것은 아니다. 도시된 구성요소보다 더 많은 구성요소에 의해 가전장치가 구현될 수도 있고, 그보다 적은 구성요소에 의해서 가 전장치 가 구현될 수 있다. 본 개시 전반에 걸쳐서 가전장치를 포함하는 전기기기는 독립되어 판매 되는 가전기기일 수도 있고 가전기기의 일부 제품을 구성하는 장치일 수도 있다. 본 개시의 일 실시예에 따른 회생 제동 에너지를 제어하는 세탁기는, 케이스, 케이스의 상부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구, 세탁물 투입구에 부착된 문, 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조, 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조, 및 회전조를 회전시키는 모터를 구동하 기 위한 전력변환장치를 포함하되, 전력변환장치는, 세탁기에 전원을 공급하는 입력전원, 입력전원의 교 류전압을 정류하는 제 1 정류기(1120, 1120_1), 제 1 정류기(1120, 1120_1)에 의해 정류된 직류전압을 평활화하 는 DC 링크 커패시터, DC 링크 커패시터에 의해 평활화된 직류전압을 모터 구동을 위한 교류전압 으로 변환하는 인버터, 인버터에 의해 변환된 교류전압에 의해 구동되어 회전조를 회전시키는 모터 , DC 링크 커패시터 양단 또는 입력전원과 연결되어 부하에 공급되는 직류전압을 생성하는 제 1 전력변환기, 제 1 전력변환기에 의해 생성된 직류전압에 의해 구동될 수 있는 부하, DC 링크커패시터 양단에 연결되며, DC 링크 커패시터 양단 전압이 모터의 감속에 따른 회생 제동에 의해 제 1 소정의 전압 이상이 되는 것에 기초하여 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장치 에 충전하는 제 2 전력변환기, 및 제 1 전력변환기와 제 2 전력변환기의 동작을 제어 하는 프로세서를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 1 전력변환기가 입력전원과 연결되는 경우 제 1 전력변환기는 입력 전원의 교류전압을 직류전압으로 변환하기 위한 제 2 정류기를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 에너지 저장 장치의 직류전압을 부하에 공급하는 직류전압으로 변환하 는 제 3 전력변환기를 더 포함하고, 프로세서는 제 3 전력변환기를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 1 전력변환기와 부하 사이에 제 1 다이오드, 및 제 3 전력변환기와 부하 사이에 제 2 다이오드를 포함하되, 제 3 전력변환기에 의해 변환된 직류전압이 제 1 전력변환기에 의해 변 환된 직류전압보다 소정의 전압보다 크면, 제 2 다이오드에 의해 제 3 전력변환기에 의해 변환된 직류전압이 부 하에 공급되는 전압으로 선택될 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 2 전력변환기의 입력과 제 2 전력변환기의 출력이 전기적으로 절연 될 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 3 전력변환기의 입력과 제 3 전력변환기의 출력이 전기적으로 절연 될 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 2 전력변환기와 제 3 전력변환기는 각각 직류전압을 다른 레벨의 직류전압으로 변환하는 DC/DC 컨버터일 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 제 2 전력변환기는 양방향으로 직류전압을 다른 레벨의 직류전압으로 변환하는 양방향 벅-부스트 컨버터일 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 모터의 감속에 따른 회생 제동이 발생하지 않거나 모터를 구동하기 위한 전력이 요구된다는 판단에 기초하여, 에너지 저장 장치에 충전된 전력을 DC 링크 커패시터로 전 달하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 모터를 재기동하기 위한 전력이 요구되는 것에 기초하여 에너지 저장 장치에 충전된 전력을 DC 링크 커패시터로 전달하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되는 것에 기초하여, 에너지 저장 장치에 충전된 전력을 DC 링크 커패시터로 전달하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 DC 링크 커패시터의 전압이 제 3 소정의 값이 되는 것에 기초하여, 에너지 저장 장치로부터 DC 링크 커패시터로의 에너지 충전을 중단하도록 양방향 벅-부스트 컨버터를 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기는 통신부, 및 입력 인터페이스와 출력 인터페이스를 포함하는 사용자 인터 페이스를 더 포함하되, 부하는 프로세서, 통신부 및 사용자 인터페이스 중 적어도 하나를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 통신부는 Wi-Fi 통신부를 포함하고, 프로세서는 회생 제동에 의해 발 생한 전력을 Wi-Fi 통신을 위해 Wi-Fi 통신부 구동에 사용하도록 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서는 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장 치에 충전한 후, DC 링크 커패시터 양단 전압이 소정의 전압 지령을 유지하도록 제어할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서, 프로세서가 DC 링크 커패시터 양단 전압이 소정의 전압 지령을 유지하 도록 제어하는 동안, 에너지 저장 장치에 충전되는 전류값은 일정한 것을 특징으로 한다. 본 개시의 일 실시예에 따른 세탁기에서, 소정의 전압 지령은 소정의 전압보다 작거나 같은 것을 특징으로 한다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법에서 세탁기는 케이스, 케이스의 상 부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구, 세탁물 투입구에 부착된 문, 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조, 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조, 및 회전조를 회전시키는 모터를 구동하기 위한 전력변환장치를 포함하고, 방법은, 입력전원의 교류전압을 직류전압으로 정류하는 단계, 직류전압을 DC 링크 커패시터에 의해 평활화하는 단계, 평활화된 직류전압을 인버터에 의해 모터 구동을 위한 교류전압으로 변환하는 단계, 변환된 교류전압에 의해 모터를 구동하여 회전조를 회전시키는 단계, 및 모 터의 감속에 따른 회생 제동에 의해 DC 링크 커패시터의 전압이 제 1 소정의 전압 이상이 되면 DC 링크 커패시 터의 직류전압을 변환하여 에너지 저장 장치에 충전하는 단계를 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법에서, DC 링크 커패시터의 전압이 제 2 소정의 전압 이하가 되면 에너지 저장 장치에서 DC 링크 커패시터로 에너지를 방전하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법은, DC 링크 커패시터의 전압이 제 3 소정의 전압이 되면 에너지 저장 장치에서 DC 링크 커패시터로의 에너지 방전을 중단하는 단계를 더 포함할 수 있다. 본 개시의 일 실시예에 따른 세탁기에서 회생 제동 에너지를 제어하는 방법을 실행할 수 있는 컴퓨터에 의해 동 작되는 명령을 저장하는 컴퓨터 가독매체에서 세탁기는 케이스, 케이스의 상부나 측면에 세탁물을 넣을 수 있는 세탁물 투입구, 세탁물 투입구에 부착된 문, 세탁물을 세탁하기 위한 물을 저장할 수 있는 고정조, 고정조 내의 컨테이너로 구성되며 회전이 가능한 회전조, 및 회전조를 회전시키는 모터를 구동하기 위한 전력변환장치 를 포함하고, 컴퓨터에 의해 동작되는 명령에 의해 세탁기에서 회생 제동 에너지를 제어하는 방법은, 입력전원 의 교류전압을 직류전압으로 정류하는 단계, 직류전압을 DC 링크 커패시터에 의해 평활화하는 단계, 평활화된 직류전압을 인버터에 의해 모터 구동을 위한 교류전압으로 변환하는 단계, 변환된 교류전압에 의해 모터를 구동 하여 회전조를 회전시키는 단계, 및 모터의 감속에 따른 회생 제동에 의해 DC 링크 커패시터의 전압이 제 1 소 정의 전압 이상이 되면 DC 링크 커패시터의 직류전압을 변환하여 에너지 저장 장치에 충전하는 단계를 포함할 수 있다. 본 개시의 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포 함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의 의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구 현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈, 또는 반송파와 같은 변조된 데이터 신호의 기타 데이터, 또는 기타 전송 메커니즘을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 본 개시의 일부 실시예는 컴퓨터에 의해 실 행되는 컴퓨터 프로그램과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 컴퓨터 프로그램 또는 컴퓨터 프 로그램 제품 (computer program product)으로도 구현될 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, ‘비 일시적 저장매체'는 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미 할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하 지 않는다. 예로, '비일시적 저장매체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두개의 사용자 장치들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운 로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다."}
{"patent_id": "10-2023-0124086", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 가전장치의 구성을 나타내는 도면이다. 도 2a는 본 개시의 일 실시예에 따른 가전장치에서 인버터와 모터를 간략하게 나타낸 도면이다. 도 2b는 본 개시의 일 실시예에 따른 가전장치에서 인버터와 모터의 등가회로를 나타낸 도면이다.도 2c는 본 개시의 일 실시예에 따른 가전장치에서 모터의 단락 제동 시 등가회로이다. 도 2d는 본 개시의 일 실시예에 따른 가전장치에서 모터의 단락 제동 시 등가회로이다. 도 3a는 본 개시의 일 실시예에 따른 감압 컨버터(buck converter)에서 스위치 온(on)일 때의 전류 흐름을 나타 내는 회로도이다. 도 3b는 본 개시의 일 실시예에 따른 감압 컨버터(buck converter)에서 스위치 오프(on)일 때의 전류 흐름을 나 타내는 회로도이다. 도 3c는 본 개시의 일 실시예에 따른 감압 컨버터(buck converter)에서 인덕터 전압과 전류를 나타내는 파형도 이다. 도 4a는 본 개시의 일 실시예에 따른 승압 컨버터(boost converter)에서 스위치 온(on)일 때의 전류 흐름을 나 타내는 회로도이다. 도 4b는 본 개시의 일 실시예에 따른 승압 컨버터(boost converter)에서 스위치 오프(on)일 때의 전류 흐름을 나타내는 회로도이다. 도 4c는 본 개시의 일 실시예에 따른 승압 컨버터(boost converter)에서 인덕터 전압과 전류를 나타내는 파형도 이다. 도 5는 가전장치에서 배터리와 부하를 이용한 모터의 회생 제동 에너지 이용을 보여주는 회로도이다. 도 6a는 가전장치에서 모터 구동을 위한 인버터 구성도이다. 도 6b는 가전장치에서 모터 구동을 위한 인버터 구성도이다. 도 7은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 8은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 9는 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 10은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 11은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 12는 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 13은 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 14는 본 개시의 일 실시예에 따른 모터 제동 시 회생 제동 구성도이다. 도 15는 본 개시의 일 실시예에 따른 가전장치에서 회생 제동이 이루어지는 단계 별 전압과 전류의 변화를 나타 내는 그래프이다. 도 16은 본 개시의 일 실시예에 따라 회생 제동 에너지를 제어기 동작에 의해 에너지 저장 장치에 충전하는 동 작을 나타내는 도면이다. 도 17은 본 개시의 일 실시예에 따른 회생 제동 제어 시 전압과 전류를 도시한 그래프이다. 도 18은 본 개시의 일 실시에에 따라 에너지 저장 장치에서 방전 시의 전압과 전류를 도시한 그래프이다. 도 19은 본 개시의 일 실시예에 따라 에너지 저장 장치에서 DC 링크 커패시터로 방전되는 동작을 나타내는 도면 이다. 도 20은 본 개시의 일 실시예에 따라 에너지 저장 장치에서 부하로 방전되는 동작을 나타내는 도면이다. 도 21은 본 개시의 일 실시예에 따른 DC 링크 커패시터 전압 안정화 시퀀스를 나타내는 그래프이다. 도 22는 본 개시의 일 실시예에 따른 세탁기의 탈수모드의 파형도이다. 도 23은 본 개시의 일 실시예에 따른 모터 정지 시 과전압 발생 시의 파형도이다. 도 24는 본 개시의 일 실시예에 따른 가전장치의 블록도이다.도 25는 본 개시의 일 실시예에 따른 가전장치에서 회생 제동에 의한 에너지 제어 방법을 나타내는 흐름도이다. 도 26은 본 개시의 일 실시예에 따른 가전장치에서 에너지 저장 장치의 방전 제어 방법을 나타내는 흐름도이다."}
