{"patent_id": "10-2022-0002152", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0106354", "출원번호": "10-2022-0002152", "발명의 명칭": "인공 지능 모델을 기반으로 화장품 컨텐츠를 추천하는 전자 장치 및 이의 동작 방법", "출원인": "주식회사 토브앤바나", "발명자": "유환조"}}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치가 인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법에 있어서,상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득하는 단계;상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하는 단계;상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기사용자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하는 단계; 및상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 방법은상기 인공 지능 모델을 학습시키기 위한 학습 사용자 정보 및 학습 화장품 정보를 획득하는 단계; 및상기 학습 사용자 정보에 따른 학습 사용자 벡터 및 상기 학습 화장품 정보에 따른 학습 화장품 벡터에 기초하여 상기 인공 지능 모델을 학습시키는 단계; 를 포함하고,상기 화장품 정보를 획득하는 단계는상기 학습된 인공 지능 모델에 상기 사용자 벡터를 입력함으로써, 상기 화장품 정보를 획득하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 인공 지능 모델을 학습시키는 단계는상기 학습 사용자 정보 또는 상기 학습 화장품 정보 중 적어도 하나를 원핫 벡터로 생성하는 단계;상기 원핫 벡터로부터 k차원 학습 가능한 학습 벡터를 생성하는 단계; 및상기 생성된 학습 벡터에 기초하여 상기 인공 지능 모델을 학습시키는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 방법은상기 화장품 컨텐츠를 출력하는 단계 이후, 상기 전자 장치에 대한 사용자 입력에 기초하여, 새로운 화장품 소비 이력 정보를 획득하는 단계; 및상기 새로운 화장품 소비 이력 정보에 따른, 새로운 소비 이력 벡터를 결정하는 단계;상기 새로운 소비 이력 벡터에 기초하여 상기 인공 지능 모델을 재 학습시키는 단계; 를 포함하고,상기 인공 지능 모델은, 상기 새로운 소비 이력 벡터에 기초하여 학습됨으로써 시간의 흐름에 따른 사용자의 관심 변화를 추적하는 직렬 추천 모델인 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 사용자 정보를 획득하는 단계는상기 사용자의 피부 타입 정보, 피부 고민 정보, 취향 정보 중 적어도 하나에 관한 사용자 특성 정보를 획득하공개특허 10-2023-0106354-3-는 단계; 및상기 사용자의 화장품 소비 이력에 관한 사용자 소비 이력 정보를 획득하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 취향 정보는상기 사용자의 선호 향 정보, 상기 사용자의 사용 화장품 수 정보 또는 상기 사용자의 선호 화장품 가격대 정보중 적어도 하나를 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 소비 이력 정보는, 시간의 흐름에 따른 상기 사용자의 소비 화장품 정보 및 상기 소비 화장품에 대한 피드백 정보를 포함하고,상기 피드백 정보는 상기 사용자가 상기 전자 장치와 연결된 서버로 전송한 후기글 정보 및 별점 정보를 포함하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 사용자 벡터를 결정하는 단계는상기 사용자 특성 정보에 따른 사용자 특성 벡터 또는 상기 사용자 소비 이력 정보에 따른 소비 이력 벡터 중적어도 하나에 기초하여 상기 사용자 벡터를 결정하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 소비 이력 벡터는 시간의 흐름에 따른 상기 사용자의 소비 화장품 정보에 따른 화장품 벡터 및 상기 소비 화장품에 대한 피드백 정보에 따른 피드백 벡터의 조합인 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 피드백 벡터는상기 후기글 정보에 따른 후기글 벡터 및 상기 별점 정보에 따른 별점 벡터의 조합이고,상기 후기글 벡터는 상기 후기글 정보 내 후기 텍스트를 문맥 기반 언어 모델에 입력함으로써, 상기 문맥 기반언어 모델로부터 획득되는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 화장품 정보를 획득하는 단계는어텐션(attention) 기법에 따라 학습되는 상기 인공 지능 모델을 이용하여, 상기 사용자 특성 정보 중, 상기 추천 화장품에 관련된 사용자 특성 정보를 포함하는 상기 화장품 정보를 획득하는 단계; 를 포함하는, 방법."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 전자 장치에 있어서,하나 이상의 인스트럭션을 저장하는 메모리; 및상기 하나 이상의 인스트럭션을 실행하는 적어도 하나의 프로세서; 를 포함하고,상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써,상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득하고,상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하고,상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추공개특허 10-2023-0106354-4-천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기사용자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하고,상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는, 전자 장치."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 적어도 하나의 프로세서는상기 인공 지능 모델을 학습시키기 위한 학습 사용자 정보 및 학습 화장품 정보를 획득하고,상기 학습 사용자 정보에 따른 학습 사용자 벡터 및 상기 학습 화장품 정보에 따른 학습 화장품 벡터에 기초하여 상기 인공 지능 모델을 학습시키고,상기 학습된 인공 지능 모델에 상기 사용자 벡터를 입력함으로써, 상기 화장품 정보를 획득하는, 전자 장치."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 적어도 하나의 프로세서는상기 학습 사용자 정보 또는 상기 학습 화장품 정보 중 적어도 하나를 원핫 벡터로 생성하고,상기 원핫 벡터로부터 k차원 학습 가능한 학습 벡터를 생성하고,상기 생성된 학습 벡터에 기초하여 상기 인공 지능 모델을 학습시키는, 전자 장치."}
{"patent_id": "10-2022-0002152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 장치가 인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법에 있어서,상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득하는 단계;상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하는 단계;상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기사용자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하는 단계; 및상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는 단계; 를 포함하는, 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 인공 지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법 및 이를 수행하는 전자 장치에 관한 것이다. 일 실시 예에 따른 전자 장치가 인공 지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법은 상기 전자 장 치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용 자 정보를 획득하는 단계; 상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하는 단계; 상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기 사용자 벡터를 입력함으 로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하는 단계; 및 상기 화장품 정보 내 높은 점수를 나타 내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는 단계; 를 포함할 수 있다."}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공 지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법 및 이를 수행하는 전자 장치에 관한 것이다. 보다 상세하게는 메타데이터 분석 기반의 고객 맞춤형 화장품을 추천하는 전자 장치 및 이의 동작 방법에 관한 것이다."}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "피부에 꼭 맞는 화장품 또는 현재 사용하고 있는 화장품 보다 더 나은 화장품을 찾고자 하는 많은 수요에도 불 구하고, 고객들은 수 많은 화장품을 일일이 비교하기에는 한계가 있으며, 1인당 구매시 비교군의 수는 한정될 수 밖에 없어 수많은 화장품들 사이에서 자신에게 맞는 적절한 화장품을 찾는 것은 매우 많은 시간 및 비용이 들어가는 문제점이 있다. 종래 고객에게 맞는 화장품을 추천하기 위한 기술 개발 시도들이 있었으나, 종래 추천 시스템은 실제 사용자가 시간의 흐름에 따라 사용한 화장품 소비 이력에 대한 정보들을 반영하지 못하거나, 이러한 상황들을 서비스에 적용하기 어려워 사용자에게 필요한 화장품을 추천하는데 한계가 있었다. 한편, 스스로 대량의 데이터를 학습함으로써 빅데이터에 대한 소정의 출력 값을 도출할 수 있는 인공 지능 기술 의 개발이 활성화됨에 따라 플랫폼 서비스에서 인공 지능 기술을 활용하여 사용자의 편의를 향상시키기 위한 다양한 기술들이 개발되고 있다. 따라서, 인공 지능 기술을 활용하여 사용자의 소비이력에 따른 지속적으로 축적되는 데이터를 기반으로, 사용자 맞춤형 화장품 컨텐츠를 제공하기 위한 기술 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제2253750호"}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시 예에 의하면, 전자 장치가 인공 지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법 및 이를 수행하 는 전자 장치가 제공될 수 있다. 일 실시 예에 의하면 메타데이터 분석 결과 및 사용자 소비 이력에 대한 피드백을 기반으로 지속적으로 학습될 수 있는 인공지능 모델을 이용한 화장품 컨텐츠를 추천하는 방법 및 이를 수행하는 전자 장치가 제공될 수 있다."}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 일 실시 예에 의하면, 전자 장치가 인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법에 있어서, 상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득하는 단계; 상기 획득된 사용 자 정보에 대한 사용자 벡터를 결정하는 단계; 상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화 장품 정보를 출력하는 인공 지능 모델에, 상기 사용자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화 장품 정보를 획득하는 단계; 및 상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는 단계; 를 포함하는, 방법이 제공될 수 있다. 상술한 기술적 과제를 달성하기 위한 또 다른 실시 예에 의하면, 인공지능 모델을 기반으로 화장품 컨텐츠를 추 천하는 전자 장치에 있어서, 하나 이상의 인스트럭션을 저장하는 메모리; 및 상기 하나 이상의 인스트럭션을 실 행하는 적어도 하나의 프로세서; 를 포함하고, 상기 적어도 하나의 프로세서는 상기 하나 이상의 인스트럭션을 실행함으로써, 상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득하고, 상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하고, 상 기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기 사 용자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하고, 상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는, 전자 장치가 제공될 수 있다. 또 다른 실시 예에 의하면, 전자 장치가 인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법에 있어서, 상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하 나에 관한 사용자 정보를 획득하는 단계; 상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하는 단계; 상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화 장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기 사용 자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하는 단계; 및 상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력하는 단계; 를 포함하는, 방법을 컴 퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록 매체가 제공될 수 있다."}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "종래 일반적인 화장품 추천 기술과 달리 화장품에 대해 지속적으로 축적되는 데이터를 이용하여 화장품의 추천 성능을 향상시킬 수 있다. 본 개시의 일 실시 예에 의하면, 사용자 맞춤형 화장품 컨텐츠를 제공함으로써, 화장품 소비 증가를 유도할 수 있다."}
{"patent_id": "10-2022-0002152", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 개시에 대해 구체적으로 설명하기로 한다. 본 개시에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 본 개시의 실시 예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 도 1은 일 실시 예에 따른 전자 장치가 인공 지능 모델을 이용하여 화장품 컨텐츠를 제공하는 과정을 개략적으 로 나타내는 도면이다. 일 실시 예에 의하면 전자 장치는 인공 지능 모델을 이용하여 사용자 정보에 대한 메타 데이터를 분 석함으로써 사용자 정보에 최적화된 화장품 컨텐츠를 제공할 수 있다. 일 실시 예에 의하면, 전자 장 치는 사용자 정보 및 피드백 데이터에 기초하여 반복 학습될 수 있는 인공 지능 모델을 이용하여 사용자 정보에 따른 사용자의 피부에 맞는 추천 화장품들을 화장품 컨텐츠로 제공할 수 있다. 본 개시에 따른 전자 장치는 수 많은 화장품 정보를 개인이 일일이 비교하기 어려운 한계를 극복하고, 보 다 개인 사용자의 피부 타입, 취향 또는 제품 특성에 따른 소정의 수의 화장품들을 추천함으로써, 화장품 사용 자의 만족감을 향상시킴과 함께 화장품 판매량을 향상시킬 수 있다. 또한, 일 실시 예에 의하면, 전자 장치 는 인공 지능 모델을 이용하여 사용자 정보에 적합한 화장품 및 화장품에 대한 리뷰 컨텐츠를 화장품 컨 텐츠로 제공함과 함께 사용자에게 온라인 샘플링 서비스를 더 제공할 수도 있다. 전자 장치는 화장품 컨텐츠를 제공한 이후, 화장품 샘플을 제공하기 위한 배송 정보, 샘플 수량 정보, 서 비스 사용자 명칭 또는 화장품 샘플 종류 정보 중 적어도 하나를 포함하는 샘플 정보 입력 인터페이스를 화면상 에 출력 한 후, 전자 장치 화면에 대한 사용자 입력에 기초하여, 소정의 화장품을 배송하는 온라인 샘플링 서비 스를 제공한다. 전자 장치는 화장품 샘플이 배송된 이후, 화장품 샘플에 대한 만족도 조사를 위한 컨텐츠 및 해당 화장품 샘플에 대한 구매 컨텐츠를 화면상에 더 제공함으로써, 해당 화장품에 대한 구매를 유도할 수 있다. 일 실시 예에 의하면, 전자 장치는 전자 장치에 대한 사용자 입력에 기초하여 사용자 정보를 획득할 수 있다. 예를 들어, 전자 장치는 적어도 하나의 사용자 입력 인터페이스를 포함할 수 있고, 사용자 입력 인터페이스에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 대한 정보를 포함하는 사용자 정보를 획득할 수 있다. 일 실시 예에 의하면 사용자 정보는 사용자 특성 정보 또 는 화장품 소비 이력 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예에 의하면 사용자 특성 정보는 사용자의 피부 타입 정보, 피부 고민 정보, 취향 정보 중 적어도 하나 에 관한 정보를 포함할 수 있다. 일 실시 예에 의하면 취향 정보는 사용자의 선호 향 정보, 사용자의 사용 화장 품 수 정보 또는 사용자의 선호 화장품 가격대 정보 중 적어도 하나를 포함할 수 있다. 또한, 일 실시 예에 의 하면 소비 이력 정보는 시간의 흐름에 따라 사용자가 소비한 소비 화장품 정보 및 소비 화장품에 대한 피드백 정보를 포함하고, 상기 피드백 정보는 사용자가 전자 장치와 연결된 서버로 전송한 후기 글 정보 및 별점 정보 를 포함할 수 있다. 일 실시 예에 의하면 전자 장치가 제공하는 화장품 컨텐츠는 사용자 정보가 입력되었을 때, 인 공 지능 모델로부터 출력되는 화장품 종류 정보, 해당 화장품에 대한 사용자 정보에 따른 사용자의 소비 가능성 에 관한 점수 정보를 포함할 수 있다. 또 다른 실시 예에 의하면 화장품 컨텐츠는 해당 화장품을 추천하는 데 사용된 사용자의 특성 정보를 더 포함할 수도 있다. 일 실시 예에 의하면, 전자 장치가 이용하는 인공 지능 모델은 사용자 정보가 입력되면, 입력된 사용자 정보들에 기초하여 화장품 컨텐츠를 출력하는 모델일 수 있다. 일 실시 예에 의하면 인공 지능 모델은 심층 신 경망(DNN:Deep Neural Network)를 포함할 수도 있다. 또한, 일 실시 예에 의하면, 인공 지능 모델은 다층 퍼셉 트론(Multi-Layer Perceptron, MLP)일 수 있다. 또한, 인공 지능 모델은 CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 역시 이에 한정되는 것은 아니다. 일 실시 예에 의하면 인공 지능 모델은 사용자 특성 벡터 및 화장품 벡터의 조합에 기초하여 생성되는 학 습 벡터를 기초로, 소정의 화장품 정보 및 상기 소정의 화장품 정보에 대한 소비 가능성에 관한 점수(또는 확률 값)를 출력하도록 미리 학습될 수 있다. 도 2는 일 실시 예에 따른 전자 장치가 메타 데이터를 수집하고 이를 활용하는 과정을 개략적으로 나타내는 도 면이다. 도 2의 그림 및 그림 을 참조하면 전자 장치가 사용자 정보에 대한 메타 데이터를 수집하는 과정 및 이를 활용하는 방안이 도시된다. 본 개시의 일 실시 예에 의하면, 전자 장치는 고객 피부 타입 기반, 고객 취향 기반, 고객 리뷰 기반 수집 데이터를 획득하고, 획득된 수집 데이터를 데이터베이스화함으로써 소정의 추천 데이터들을 제공할 수 있다. 예를 들어, 전자 장치는 획득된 수집 데이터를 처리 및 분류함 으로써, 화장품 특성 데이터에 따른 데이터 베이스 및 리뷰 데이터에 따른 데이터베이스를 생성할 수 있다. 전자 장치는 획득된 수집 데이터를 기반으로 인공 지능 모델 기반 화장품 추천 서비스를 제공하기 위한 시스템용 데이터베이스를 구축하고, 구축된 데이터 베이스를 기반으로 학습된 정보와 유사한 사용자 정보가 입 력되면, 사용자 정보에 따른 사용자의 취향에 적합한 화장품 제품들을 추천하게 된다. 도 3은 일 실시 예에 따른 전자 장치가 인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법의 흐름도이다. S310에서, 전자 장치는 전자 장치에 대한 사용자 입력에 기초하여 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득할 수 있다. 일 실시 예에 의하면, 전자 장치는 사 용자 정보를 획득하기 위한 사용자 정보 입력 인터페이스를 화면상에 출력하고 출력된 사용자 정보 입력 인터페 이스에 대한 사용자 입력에 기초하여 사용자 정보를 획득할 수도 있다. 본 개시의 일 실시 예에 따른 전자 장치는 이전에 획득된 사용자 정보를 저장할 수 있다. 일 실시 예에 의하면, 전자 장치는 전자 장치에 기 저장된 사용자 정보가 있는지 여부를 식별하고, 기 저장된 사 용자 정보가 있는 경우, 기 저장된 사용자 정보 내 소비 이력 정보의 유무에 따라 해당 사용자가 서비스 사용경 험이 있는지 여부를 식별할 수 있다. 예를 들어, 전자 장치는 기 저장된 사용자 정보를 판독한 결과, 피 드백 정보를 포함하는 소비 이력 정보가 사용자 정보에 포함되는 것으로 식별되는 경우에는, 사용자 정보에 따 른 사용자를 소비이력이 있는 사용자로 식별하고, 사용자 정보에 소비 이력 정보가 포함되어 있지 않는 것으로 식별되는 경우, 사용자 정보에 따른 사용자를 소비 이력이 없는 사용자로 식별할 수 있다. 도 3에는 도시되지 않았지만, 일 실시 예에 따른 전자 장치는 소정의 시간 동안의 퀴즈 형식의 사용자 입 력 인터페이스를 화면상에 표시하고, 화면상에 표시된 퀴즈 형식의 사용자 입력 인터페이스에 대한 사용자 입력 에 기초하여 사용자 정보를 획득할 수도 있다. S320에서, 전자 장치는 사용자 정보에 대한 사용자 벡터를 결정할 수 있다. 예를 들어, 전자 장치 는 사용자 정보 내 사용자 특성 정보에 따른 사용자 특성 벡터 또는 사용자 소비 이력 정보에 따른 소비 이력 벡터 중 적어도 하나에 기초하여 사용자 벡터를 결정할 수 있다. 일 실시 예에 의하면 처음 서비스를 사용하는 사용자에 대한 사용자 벡터는 사용자 소비 이력 정보를 제외한 피부 타입, 취향 등에 대한 메타 데이터 형식의 사용자 특성 정보에 따른 사용자 특성 벡터만을 포함할 수 있다. 그러나 또 다른 실시 예에 따라 서비스를 과거 이용한 사용자에 대한 사용자 벡터는 사용자 특성 정보에 따른 사용자 특성 벡터 및 사용자 소비 이력 정보에 따른 소비 이력 벡터의 조합을 포함할 수 있다. 또한, 일 실시 예에 의하면 소비 이력 벡터는 시간의 흐름에 따른 사용자의 소비 화장품 정보에 따른 화장품 벡 터와 소비 화장품에 대한 피드백 정보에 따른 피드백 벡터의 조합을 포함할 수 있다. 사용자 정보에 따른 사용 자 벡터를 결정하는 방법은 후술하는 도 6을 참조하여 구체적으로 설명하기로 한다. S330에서, 전자 장치는 사용자 벡터가 입력되면 사용자 정보에 따른 적어도 하나의 추천 화장품 및 적어 도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 사용자 벡터를 입력함으로써, 인공 지능 모델로부터 화장품 정보를 획득할 수 있다. 예를 들어, 전자 장치는 사용자 정보를 전처리함으로써 인공 지능 모델의 입력으로 사용할 수 있는 사용자 벡터를 생성하 고, 생성된 사용자 벡터를 인공 지능 모델에 입력함으로써, 인공 지능 모델로부터 화장품 정보를 획득할 수 있 다. 일 실시 예에 의하면, 인공지능 모델에서 출력되는 화장품 정보는 사용자 정보에 매칭되는 화장품 종류 및 상기 화장품을 소비할 가능성에 대한 확률 값(또는 소비 가능성에 관한 점수)를 포함할 수 있다. S340에서, 전자 장치는 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 화장품 컨텐츠로 출 력할 수 있다. 일 실시 예에 의하면, 전자 장치는 화장품 정보에 포함된 화장품들 중, 사용자가 가장 소 비할 가능성이 높은 점수 순서대로 미리 설정된 수의 화장품들을 화장품 컨텐츠로 출력할 수 있다. 일 실시 예 에 의하면, 전자 장치는 화장품 컨텐츠를 출력함과 함께, 화장품 컨텐츠 내 추천 화장품의 근거를 알려주 기 위해 어텐션(ATTENTION) 기법에 따라 인공 지능 모델을 학습시킴으로써, 인공 지능 모델로 하여금, 사용자 특성 정보 중, 추천 화장품을 선택하는데 사용된, 관련 사용자 특성 정보를 함께 제공하도록 할 수 있다. 즉 본 개시에 따른 인공 지능 모델에서 출력되는 화장품 정보는, 사용자 특성 정보 중, 소정의 화장품을 추천하는데 사용된 사용자 특성 정보를 포함할 수 있다. 또 다른 실시 예에 의하면, 전자 장치는 소정의 수의 화장품을 화장품 컨텐츠로 출력함과 함께, 화장품 컨텐츠 내 추천된 화장품의 근거를 알려주기 위해 추천 화장품을 선택하는데 사용된 관련 사용자 특성 정보 및 해당 화장품에 대한 인터넷 또는 SNS 서버상에 업로드된 사용자 리뷰 정보를 더 제공함으로써, 추천 화장품에 대한 사용자의 구매 또는 샘플 요청 결정을 쉽게 유도할 수 있다. 일 실시 예에 의하면, 전자 장치는 어텐션 기법을 이용하여 사용자를 표현하는 5가지 정보의 중요성을 확 률 값으로 표현할 수 있다. 일 실시 예에 의하면 각 정보의 중요성은 0 내지 1사이의 값으로 할당될 수 있고, 5 가지 정보의 중요성을 모두 더하면 확률 값으로 표현될 수 있으며, 5가지 정보의 중요성을 모두 더한 확률 값은1로 마련될 수 있다. 전자 장치는 인공 지능 모델에 5가지 사용자 정보가 입력되면, 해당 인공 지능 모델 의 출력이 각 정보의 중요성이 되도록 설정할 수 있고, 인공 지능 모델의 출력인 각 정보의 중요성 값을 각 정 보를 나타내는 벡터에 곱해서 중요성을 반영한 후, 계산된 5가지 벡터를 합쳐서 최종 사용자 벡터를 획득할 수 있다. 전자 장치는 동일한 방식의 어텐션 기법을 이용하여 사용자 벡터뿐만 아니라 화장품 벡터, 피드백 벡터를 생성할 수 있다. 또한, 도 3에는 도시되지 않았지만, 전자 장치는 화장품 컨텐츠를 출력한 이후, 화장품 컨텐츠 내 소정의 화장품에 대한 화장품 샘플들을 제공하기 위한 샘플 정보 입력 인터페이스를 화면상에 더 제공할 수도 있다. 예 를 들어, 전자 장치는 소정의 수의 화장품 리스트를 포함하는 화장품 컨텐츠를 출력한 이후, 상기 화장품 리스트 중 소정의 화장품을 선택하는 사용자 입력이 식별되면, 선택된 소정의 화장품에 대한 '샘플을 받아 보시 겠습니까?'와 같은 알림 메시지를 화면상에 출력할 수 있다. 전자 장치는 알림 메시지에 대한 사용자 입력이 식별되면, 해당 샘플 배송을 위한 샘플 정보 입력 인터페 이스를 화면상에 출력한 후, 상기 화면상에 출력된 샘플 정보 입력 인터페이스를 통해 샘플 종류, 샘플 수량, 샘플 배송지 주소, 사용자 명칭 중 적어도 하나를 포함하는 온라인 샘플링 서비스 정보들을 획득할 수 있다. 또한, 전자 장치는 화장품 샘플 배송 후, 화장품 샘플을 배송 받은 사용자로부터, 화장품 샘플에 대한 사 용자 피드백 정보가 업로드된 것으로 식별되면, 해당 피드백 정보를 전자 장치 또는 전자 장치와 연결된 서버로 공유할 수 있다. 또한, 전자 장치는 본 개시에 따른 화장품 서비스를 사용하는 사용자들 중, 상기 화장품 샘플을 배송 받 은 사용자와 SNS로 연동된 사용자들 간의 피드백 정보의 업로드를 실시간으로 공유할 수 있다. 예를 들어, 전자 장치는 상기 화장품 샘플을 배송 받은 사용자와 SNS로 연동된 사용자들 중 일 사용자가, 상기 배송된 화 장품 샘플과 동일한 제품에 대한 피드백 정보를 업로드한 경우, 해당 피드백 정보를 전자 장치와 연결된 서버로부터 실시간으로 획득하고, 획득된 피드백 정보에 기초하여, 'SNS로 연동된 사용자들 중 일 사용자가 피 드백 정보를 올렸습니다'와 같은 알림 문구를 화면상에 출력할 수 있다. 본 개시에 따른 전자 장치는 SNS 로 연동된 사용자의 피드백 정보를 공유하고, 이를 통해 알림 정보를 제공함으로써, 본 개시에 따른 서비스 가 입자들의 빠른 피드백 정보의 업로드를 유도할 수 있다. 또한, 도 3에는 도시되지 않았지만, 전자 장치는 배송된 화장품 샘플에 대해, 전자 장치의 사용자로부터 피드백 정보가 획득되는 경우, 배송된 화장품 샘플과 동종의 화장품에 대한 구입 여부를 확인하는 사용자 입력 인터페이스를 화면상에 더 출력할 수도 있다. 전자 장치는 화장품에 대한 구입 여부를 확인하는 사용자 입력 인터페이스를 통해 '구입'과 관련된 사용자 입력이 획득되는 경우, 화장품 샘플 배송 서비스를 위해 미리 획득된 온라인 샘플링 서비스 정보들(예컨대 화장품 샘플 배송을 위해 획득하였던 샘플 종류, 샘플 수량, 샘플 배송지 주소, 사용자 명칭)을 전자 장치와 연결된 온라인 판매 서버에 공유함으로써, 사용자로 하여금 화 장품 구입을 위한 별도의 정보 입력 없이도, 화장품 구입 과정을 완료할 수 있다. 도 4는 일 실시 예에 따른 전자 장치가 인공 지능 모델을 학습시키는 과정을 나타내는 도면이다. S410에서, 전자 장치는 인공 지능 모델을 학습시키기 위한 학습 사용자 정보 및 학습 화장품 정보를 획득 할 수 있다. 예를 들어, 전자 장치는 인공 지능 모델을 활용하기에 앞서, 학습 사용자 정보 및 학습 화장 품 정보를, 전자 장치와 연결된 서버로부터 획득하고, 획득된 학습 사용자 정보 및 학습 화장품 정보를 학습 데 이터로 하여 인공 지능 모델을 학습시킬 수 있다. S420에서, 전자 장치는 학습 사용자 정보에 따른 학습 사용자 벡터 및 학습 화장품 정보에 따른 학습 화 장품 벡터에 기초하여 인공 지능 모델을 학습시킬 수 있다. 예를 들어, 전자 장치는 학습 사용자 정보 또 는 학습 화장품 정보 중 적어도 하나를 원핫(ONE-HOT) 벡터로 생성하고, 상기 생성된 원핫 벡터로부터 k차원 학 습 가능한 학습 벡터를 생성하며, 상기 생성된 학습 벡터에 기초하여 인공 지능 모델을 학습시킬 수 있다. 일 실시 예에 의하면 학습 사용자 정보는 학습 피부 타입 정보, 학습 피부 고민 정보 또는 학습 피부 취향 정보 중 적어도 하나를 포함할 수 있고, 상기 학습 화장품 정보는 학습 화장품 성분 정보, 학습 화장품 향 정보 또는 학습 화장품 종류 정보 적어도 하나를 포함할 수 있다. 일 실시 예에 의하면 학습 피부 취향 정보는 학습 선호 향 정보, 학습 사용 화장품 수 정보 또는 학습 선호 화장품 가격대 정보 중 적어도 하나를 포함할 수 있다. 또한, 일 실시 예에 의하면 학습 피부 타입 정보는 건성, 중성, 지성 또는 복합성 중 적어도 하나에 관한 피부 타입에 대한 정보를 포함할 수 있고, 학습 피부 고민 정보는 민감성, 여드름, 아토피 또는 해당 없음 중 적어도 하나에 대한 정보를 포함할 수 있으며, 학습 선호 화장품 가격대 정보는 저가, 중저가, 중간, 중고가, 또는 고가에 대한 범위 정보를 포함할 수 있고, 학습 화장품 성분 정보는 천연 보습제, 식물 추출 오일 과 같은 성분 정보를 포함할 수 있고, 학습 화장품 향 정보는 꽃향, 과일향과 같은 향의 종류를 식별하는 정보를 포함할 수 있으며, 학습 화장품 종류 정보는 수분 크림, 아이크림, 로션 또는 스킨과 같이 화장품의 종류에 대한 정보를 포함할 수 있다. 보다 상세하게는, 전자 장치는 상술한 학습 피부 타입 정보, 학습 피부 고민 정보, 학습 선호 향 정보, 학습 사용 화장품 수 정보 또는 학습 선호 화장품 가격대 정보 각각으로부터, 각 정보의 값(예컨대 학습 피부 타입 정보의 경우, 건성)에 학습 가능한 임베딩(embedding) 벡터를 할당함으로써, 총 5개의 벡터를 획득하고, 획득된 5개의 벡터를 기반으로 사용자를 표현하는 하나의 최종 사용자 벡터를 획득하기 위해, 상기 획득된 5개 의 벡터를 인공 지능 모델에 입력함으로써, 인공 지능 모델로부터 사용자 벡터를 획득할 수 있다. 전자 장치 는 인공 지능 모델에 상기 획득된 5개의 벡터를 입력함으로써, 학습 피부 타입 정보, 학습 피부 고민 정 보, 학습 선호 향 정보, 학습 사용 화장품 수 정보 또는 학습 선호 화장품 가격대 정보 간의 고차원(hi-order) 상관 관계를 고려하여 사용자를 표현하는 사용자 벡터를 획득할 수 있다. 또한, 일 실시 예에 의하면 전자 장치는 상술한 학습 사용자 벡터를 생성하는 과정과 유사한 방식으로 학 습 화장품 벡터를 생성할 수 있다. 예를 들어, 전자 장치는 학습 화장품 정보 내, 3개의 정보인, 학습 화 장품 성분 정보, 학습 화장품 향 정보 또는 학습 화장품 종류 정보 각각으로부터 사용자 벡터를 획득하는 과정 과 유사하게 임베딩 벡터를 할당함으로써, 3개 정보 각각으로부터 벡터를 획득하고, 획득된 3개의 벡터를 인공 지능 모델에 입력함으로써 학습 화장품 벡터를 획득할 수 있다. 전자 장치는 상술한 학습 사용자 벡터 및 학습 화장품 벡터에 기초하여 인공 지능 모델을 학습시키게 되 고, 구체적으로는 인공 지능 모델 내 복수의 노드를 포함하는 레이어들 및 상기 레이어들 및 노드들의 연결 강 도에 관한 가중치(weight)를 수정 및 갱신함으로써 인공 지능 모델을 학습시킬 수 있다. 상술한 전자 장치 가 인공 지능 모델을 학습시키기 위해 이용하는 학습 사용자 벡터 및 학습 화장품 벡터를 생성하는 과정 은, 후술하는 사용자 정보에 따른 사용자 벡터 및 화장품 정보에 따른 화장품 벡터를 생성하는 과정에 대응될 수 있다. 도 5는 일 실시 예에 따른 전자 장치가 화장품 소비 이력 정보에 기초하여 인공 지능 모델을 재학습시키는 과정 을 나타내는 도면이다. S510에서, 전자 장치는 화장품 컨텐츠를 출력하는 단계 이후, 전자 장치에 대한 사용자 입력에 기초하여 새로운 화장품 소비 이력 정보를 획득할 수 있다. 예를 들어, 전자 장치는 화장품 컨텐츠를 출력하는 단 계 이후, 온라인 화장품 샘플 배송 서비스를 제공하고, 전자 장치에 대한 사용자 입력에 기초하여 사용자 로부터 화장품 소비 이력 정보를 획득할 수 있다. 일 실시 예에 의하면 화장품 소비 이력 정보는 사용자가 샘플을 신청한 소비 화장품 정보 및 상기 소비 화장품 에 대한 피드백 정보를 포함할 수 있다. 피드백 정보는 사용자가 전자 장치에 대해 입력한 후기글 정보 및 화장 품의 선호도에 관한 별점 정보를 포함할 수 있다. S520에서, 전자 장치는 새로운 화장품 소비 이력 정보에 따른 새로운 소비 이력 벡터를 결정할 수 있다. S530에서, 전자 장치는 새로운 소비 이력 벡터에 기초하여 인공 지능 모델을 재 학습시킬 수 있다. 일 실 시 예에 의하면 소비 이력 벡터는 시간의 흐름에 따라 사용자가 소비한 화장품들에 대한 복수의 화장품 벡터 및 시간의 흐름에 따라 사용자가 제공한 피드백 벡터의 조합으로써, 시간의 흐름에 따른 사용자의 관심 변화를 나 타낼 수 있다. 또한, 일 실시 예에 의하면 피드백 벡터는 후기글 정보에 따른 후기글 벡터 및 별점 정보에 따른 별점 벡터의 조합일 수 있고, 후기글 벡터는 후기글 정보 내 후기 텍스트를 문맥 기반 언어 모델에 입력함으로써, 문맥 기반 언어 모델로부터 획득되는 컨텍스트가 반영된 벡터값일 수 있다. 본 개시에 따른 전자 장치는 샘플을 사 용한 사용자로부터 새로 획득된 화장품 소비 이력 정보에 따른 소비 이력 벡터에 기초하여 인공 지능 모델을 재 학습시킬 수 있고, 본 개시에 따른 인공 지능 모델은 딥러닝 모델로써, 시간의 흐름에 따른 사용자의 화장품 선 호를 정확하게 식별할 수 있는, 직렬(sequential) 추천 모델일 수 있다. 도 6은 일 실시 예에 따른 전자 장치가 이용하는 사용자 정보 및 이에 대응되는 사용자 벡터를 설명하기 위한 도면이다. 일 실시 예에 의하면, 사용자 정보는 사용자 특성 정보 또는 사용자 소비 이력 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예에 의하면 사용자가 화장품 추천 서비스를 사용한 이력이 없는 사용자인 경우, 해당 사용자에 대한 사용자 정보는 사용자 특성 정보만을 포함할 수 있다. 일 실시 예에 의하면, 사용자 특성 정보는 피부 타입 정보, 피부 고민 정보 또는 취향 정보 중 적어도 하나를 포함할 수 있다. 일 실시 예에 의하면 취향 정보는 선호 향 정보, 사용 화장 품 수 정보 또는 선호 화장품 가격대 정보 중 적어도 하나를 포함할 수 있다. 또한, 일 실시 예에 의하면 사용자 소비 이력 정보는 소비 화장품 정보 또는 피드백 정보 중 적 어도 하나를 포함할 수 있다. 일 실시 예에 의하면, 피드백 정보는 후기글 정보 또는 별점 정보 중 적어도 하나를 포함할 수 있다. 도 6에 도시된 사용자 정보는 도 4에서 상술한 사용자 학습 정보에 대 응될 수 있다. 일 실시 예에 의하면, 전자 장치는 사용자 정보로부터 사용자 벡터를 결정할 수 있다. 일 실시 예에 의하면 사용자 벡터는 사용자 특성 정보에 따른 사용자 특성 벡터 및 사용자 소비 이력 정보 에 따른 사용자 소비 이력 벡터의 조합에 기초하여 결정될 수 있다. 일 실시 예에 의하면, 사용자 소비 이력 벡터는 화장품 정보에 따른 화장품 벡터 및 피드백 정보 에 따른 피드백 벡터의 조합에 기초하여 결정될 수 있다. 또한, 일 실시 예에 의하면 피드백 벡터 는 후기글 정보에 따른 후기글 벡터 및 별점 정보에 따른 별점 벡터의 조합에 기초하여 결정될 수 있다. 도 7은 일 실시 예에 따른 전자 장치가 이용하는 인공 지능 모델의 학습 및 평가 프로세스를 설명하기 위한 도 면이다. S702에서, 전자 장치는 사내 보유 데이터를 획득한다. 일 실시 예에 의하면 사내 보유 데이터는 학습 사 용자 데이터에 대응될 수 있다. S704에서, 전자 장치는 획득된 사내 보유 데이터를 전처리할 수 있다. 일 실시 예에 의하면, 전자 장치는 사내 보유 데이터를 전처리함으로써, S706에서, 검증 데이터를 생성하고, S708에서, 학습 데이터를 생성할 수 있다. S710에서, 전자 장치는 학습 데이터 및 검증 데이터에 기초하여 추천 시스템(예컨대 인공 지능 모델)을 학습시킬 수 있다. S712에서, 전자 장치는 인공 지능 모델의 학습이 완료시킨 후, S714에서, 인공 지능 모델에 검증 데이터를 입력함으로써 평가 데이터를 획득할 수 있다. 전자 장치는 S716에서, S714에서 획 득된 평가 데이터에 기초하여 인공 지능 모델(예컨대 추천 시스템)의 추천 정확도를 결정할 수 있다. 전자 장치 는 인공 지능 모델의 추천 정확도를 평가한 결과, 정확도가 기 설정된 임계 정확도 보다 높지 않은 경우, 추천 시스템을 반복 학습시킴으로써 추천 시스템의 정확도를 고도화할 수 있다. 도 8은 일 실시 예에 따른 전자 장치가 이용하는 문맥 기반 언어 모델의 동작을 설명하기 위한 도면이다. 도 8을 참조하면 전자 장치가 클라우드 컴퓨팅 환경에서 사용자의 정보를 이용하여 사용자에게 적절한 자 원과 서비스를 제공하기 위한 문맥 기반 언어 모델 및 문맥 기반 언어 모델을 동작 시키기 위한 상황 기반 추천 알고리즘이 도시된다. 일 실시 예에 의하면, 전자 장치는 문맥 기반 언어 모델을 메모리에 저장할 수 있고, 메모리에 저장된 문 맥 기반 언어 모델을 이용하여 사용자가 입력한 후기글에 대한 문서 의미 해석을 수행할 수 있으며 상황 기반으 로 소정의 컨텐츠(예컨대 화장품 컨텐츠)를 추천할 수 있다. 또한, 전자 장치 사용자 소비 이력 정보에 기초하여 시간의 흐름에 따라 사용자가 사용한 화장품 소비 이력 패턴에 기초하여 선호도 기반 컨텐츠를 추천할 수도 있다. 예를 들어, 전자 장치는 전자 장치에 대한 사용자 입력에 기초하여 후기글 정보 및 별점 정보를 포함하는 피드백 정보를 획득할 수 있다. 전자 장치는 많은 야으이 한국어 글로 학습된 문맥 언어 기반 모델에 후 기글 정보에 따른 후기 텍스트를 입력함으로써, 문맥 언어 기반 모델로부터 후기글 벡터를 획득할 수 있다. 후 기글 벡터는 문맥 기반 언어 모델의 특정 단어 주변의 문맥을 고려하여 후기글 정보의 특징을 벡터 형식으로 표 현된 것으로 단순히 단어의 의미가 아닌 사용자의 후기글 정보의 문맥 상황을 나타내는 정보일 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 별점 벡터를 얻기 위해, 사용자 벡터 및 화장품 벡터를 획득하 는 방식과 유사하게, 각 점수(예컨대 1점, 5점 등) 마다 학습 가능한 임베딩 벡터를 할당함으로써 별점 벡터를 획득할 수 있다. 전자 장치는 후기글 벡터 및 별점 벡터를 다중 인공 신경망 모델에 입력함으로써 피드백 벡터를 생성하게 된다.도 9는 일 실시 예에 따른 전자 장치의 블록도이다. 일 실시 예에 의하면 전자 장치는 프로세서, 네트워크 인터페이스 및 하나 이상의 인스트럭 션을 저장하는 메모리를 포함할 수 있다. 그러나, 상술한 예에 한정되는 것은 아니며 전자 장치는 화장품 추천 서비스를 제공하기 위한 기타 구성들을 더 포함할 수도 있다. 또 다른 실시 예에 의하면, 전자 장 치는 디스플레이, 사용자 입력 인터페이스를 더 포함할 수도 있으며, 도 9에 도시된 구성 요소보다 더 적 은 구성 요소로 마련될 수도 있음은 물론이다. 일 실시 예에 의하면, 사용자 입력 인터페이스(미도시)는 화장품 추천 서비스를 이용하는 사용자가 전자 장치를 제어하거나, 사용자 정보를 입력하기 위해 데이터를 입력하는 수단을 의미한다. 예를 들어, 사용자 입력 인터페 이스(미도시)에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항 막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 디스플레이(미도시)는 화장품 컨텐츠를 출력할 수 있다. 또 다른 실시 예에 의하면, 디스플레이(미도시)는 추천 화장품, 추천 화장품을 결정하는데 사용된 사용자 정보를 함께 출력할 수도 있다. 또한, 일 실시 예에 의하면 디스플레이는 사용자 정보를 입력받기 위한 사용자 입력 인터페이스, 피드백 정보를 입력 받기 위한 사용자 입 력 인터페이스를 더 출력할 수 있다. 또한, 일 실시 예에 의하면, 디스플레이는 프로세서의 제어에 의해, 온라인 샘플 신청을 위해 필요한 주소 정보, 배송지 정보, 사용자 이름, 샘플 화장품 종류 또는 샘플 화장품 수 량에 대한 정보 중 적어도 하나를 입력하기 위한 입력 인터페이스를 더 제공할 수도 있다. 프로세서는 통상적으로 전자 장치의 전반적인 동작을 제어한다. 일 실시 예에 의하면, 프로세서 는 메모리에 저장된 프로그램들을 실행함으로써, 사용자 입력 인터페이스, 디스플레이, 네트워크 인터페이스를 전반적으로 제어할 수 있다. 또한, 프로세서는 메모리에 저장된 프로그램들을 실행함 으로써, 도 1 내지 도 9에 기재된 전자 장치의 기능을 수행할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 전자 장치에 대한 사용자 입력에 기초하여, 사용자의 특성 또는 사용자의 화장품 소비 이력 중 적어도 하나에 관한 사용자 정보를 획득하고, 상기 획득된 사용자 정보에 대한 사용자 벡터를 결정하고, 상기 사용자 벡터가 입력되면, 상기 사용자 정보에 따른 적어도 하나의 추천 화장품 및 상기 적어도 하나의 추천 화장품을 사용자가 소비할 가능성에 관한 점수를 포함하는 화장품 정보를 출력하는 인공 지능 모델에, 상기 사용자 벡터를 입력함으로써, 상기 인공지능 모델로부터 상기 화장품 정보를 획득하고, 상기 화장품 정보 내 높은 점수를 나타내는 소정의 수의 화장품을 상기 화장품 컨텐츠로 출력할 수 있다. 일 실시 예에 의하면, 프로세서는 메모리에 저장된 하나 이상의 인스트럭션을 실행함으로써, 상기 인공 지능 모델을 학습시키기 위한 학습 사용자 정보 및 학습 화장품 정보를 획득하고, 상기 학습 사용자 정보 에 따른 학습 사용자 벡터 및 상기 학습 화장품 정보에 따른 학습 화장품 벡터에 기초하여 상기 인공 지능 모델 을 학습시키고, 상기 학습된 인공 지능 모델에 상기 사용자 벡터를 입력함으로써, 상기 화장품 정보를 획득할 수 있다. 일 실시 예에 의하면, 프로세서는 상기 학습 사용자 정보 또는 상기 학습 화장품 정보 중 적어도 하나를 원핫 벡터로 생성하고, 상기 원핫 벡터로부터 k차원 학습 가능한 학습 벡터를 생성하고, 상기 생성된 학습 벡터 에 기초하여 상기 인공 지능 모델을 학습시킬 수 있다. 일 실시 예에 의하면, 프로세서는 상기 화장품 컨텐츠를 출력하는 단계 이후, 상기 전자 장치에 대한 사 용자 입력에 기초하여, 새로운 화장품 소비 이력 정보를 획득하고, 상기 새로운 화장품 소비 이력 정보에 따른, 새로운 소비 이력 벡터를 결정하고, 상기 새로운 소비 이력 벡터에 기초하여 상기 인공 지능 모델을 재 학습시 킬 수 있다. 네트워크 인터페이스(미도시)는 전자 장치가 서버 또는 전자 장치와 연결된 다른 전자 장치와 통신을 하 게 하는 하나 이상의 구성요소를 포함할 수 있다. 다른 전자 장치(미도시)는 보호자 단말과 같은 컴퓨팅 장치이거나, 센싱 장치 또는 서버 장치일 수 있으나, 이에 제한되지 않는다. 예를 들어, 네트워크 인터페이스 (미도시)는, 근거리 통신부, 이동 통신부 및 방송 수신부를 포함할 수 있다. 근거리 통신부(short-range wireless communication unit) 는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband)통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여 기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다양한 형 태의 데이터를 포함할 수 있다. 방송 수신부는, 방송 채널을 통하여 외부로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 전자 장치가 이용하 는 문맥 기반 언어 모델, 인공 지능 모델에 대한 정보를 저장할 수 있다. 일 실시 예에 의하면, 메모리에는 인공 지능 모델 내 가중치 정보들, 노드 및 레이어들에 대한 정보들을 더 저장할 수 있다. 또한, 일 실시 예에 의하면, 메모리는 딥러닝 모델, 심층 신경망(DNN:Deep Neural Networ k)에 대한 정보를 저장할 수 있으며, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 에 대한 정보 를 더 저장할 수도 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 일 실시예에 따른 전자 장치가 인공 지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법은 다양한 컴퓨터 수 단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴 퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소 프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행 하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같 은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함 한다. 또한, 일부 실시예는 컴퓨터에 의해 실행되는 컴퓨터 프로그램과 같은 컴퓨터에 의해 실행 가능한 명령어를 포 함하는 컴퓨터 프로그램 또는 컴퓨터 프로그램 제품(computer program product)으로도 구현될 수 있다. 이상에 서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2022-0002152", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 전자 장치가 인공 지능 모델을 이용하여 화장품 컨텐츠를 제공하는 과정을 개략적으 로 나타내는 도면이다. 도 2는 일 실시 예에 따른 전자 장치가 메타 데이터를 수집하고 이를 활용하는 과정을 개략적으로 나타내는 도 면이다. 도 3은 일 실시 예에 따른 전자 장치가 인공지능 모델을 기반으로 화장품 컨텐츠를 추천하는 방법의 흐름도이다. 도 4는 일 실시 예에 따른 전자 장치가 인공 지능 모델을 학습시키는 과정을 나타내는 도면이다. 도 5는 일 실시 예에 따른 전자 장치가 화장품 소비 이력 정보에 기초하여 인공 지능 모델을 재학습시키는 과정 을 나타내는 도면이다. 도 6은 일 실시 예에 따른 전자 장치가 이용하는 사용자 정보 및 이에 대응되는 사용자 벡터를 설명하기 위한 도면이다. 도 7은 일 실시 예에 따른 전자 장치가 이용하는 인공 지능 모델의 학습 및 평가 프로세스를 설명하기 위한 도 면이다. 도 8은 일 실시 예에 따른 전자 장치가 이용하는 문맥 기반 언어 모델의 동작을 설명하기 위한 도면이다. 도 9는 일 실시 예에 따른 전자 장치의 블록도이다."}
