{"patent_id": "10-2018-0003157", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0093737", "출원번호": "10-2018-0003157", "발명의 명칭": "스마트방송 콘텐츠를 위한 인공지능으로 학습된 모델 데이터의 디지털 권리 보호에 관한 장치", "출원인": "주식회사 마크애니", "발명자": "김창원"}}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디지털 권리 보호를 위한 학습 장치로서,학습 모델을 입력받는 학습 모델 설정부;하나 이상의 학습 데이터들을 불러오거나 수신하는 데이터 로더;상기 데이터 로더에서 불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시키는 학습 엔진; 및상기 학습 엔진으로부터 학습된 상기 학습 모델을 저장하는 저장부를 포함하되,상기 학습 데이터들에는 권리 주체 정보 및 권리 주체 정보 이외의 데이터들이 포함되어 있으며,상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 권리 주체 정보와 관련된 고정된 출력값을 갖도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며,상기 권리 주체 정보의 학습에 대한 가중치는 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의학습에 대한 가중치 보다 큰 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 각각은 상기 권리 주체 정보와 쌍을 이루고 있으며,상기 학습 엔진에서 상기 학습 모델이 상기 권리 주체 정보 이외의 데이터들을 학습할 때마다 상기 권리 주체정보도 학습하는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 학습 모델은 추후 학습 가능한 영역과 추후 학습 가능하지 않은 영역으로 구성되어 있으며,상기 권리 주체 정보는 상기 추후 학습 가능하지 않은 영역에 학습되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며,상기 가중치는 재학습에 의해서 변경되거나 삭제되지 않도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 권리 주체 정보를 학습한 상기 학습 모델은 권리 주체와 관련된 입력값에 대하여 상기 권리 주체 정보와공개특허 10-2019-0093737-3-관련된 고정된 출력값을 출력하도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 학습 모델이 생성한 결과물에 상기 권리 주체 정보와 관련된 고정된 출력값을 출력하도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,학습 모델 데이터에 추적 정보를 삽입하는 추적 정보 삽입부를 더 포함하는 것을 특징으로 하되, 상기 학습 모델 데이터는 상기 학습 모델을 포함하는 데이터인, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,학습 모델 데이터에 사용 제약 알고리즘을 삽입하는 사용 제약 알고리즘 삽입부를 더 포함하는 것을 특징으로하되, 상기 학습 모델 데이터는 상기 학습 모델을 포함하는 데이터인, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 사용 제약 알고리즘은 상기 학습 모델이 변형되었을 때 상기 학습 모델에 제약을 가하도록 구성되는 것을특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 사용 제약 알고리즘은 상기 학습 모델이 사용되어 결과물이 생성되었을 때 상기 결과물에 제약을 가하도록구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 장치."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "디지털 권리 보호를 위한 학습 방법으로서,학습 모델을 입력받는 단계;하나 이상의 학습 데이터들을 불러오거나 수신하는 단계;불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시키는 단계; 및학습된 상기 학습 모델을 저장하는 단계를 포함하되,상기 학습 데이터들에는 권리 주체 정보 및 권리 주체 정보 이외의 데이터들이 포함되어 있으며,상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 권리 주체 정보와 관련된 고정된 출력값을 갖도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며,상기 권리 주체 정보의 학습에 대한 가중치는 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의학습에 대한 가중치 보다 큰 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2019-0093737-4-제 12 항에 있어서,상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 각각은 상기 권리 주체 정보와 쌍을 이루고 있으며,상기 학습 모델을 상기 권리 주체 정보 이외의 데이터들을 학습시킬 때마다 상기 권리 주체 정보도 학습시키는것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 12 항에 있어서,상기 학습 모델은 추후 학습 가능한 영역과 추후 학습 가능하지 않은 영역으로 구성되어 있으며,상기 권리 주체 정보는 상기 추후 학습 가능하지 않은 영역에 학습되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 12 항에 있어서,상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며,상기 가중치는 재학습에 의해서 변경되거나 삭제되지 않도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 12 항에 있어서,상기 권리 주체 정보를 학습한 상기 학습 모델은 권리 주체와 관련된 입력값에 대하여 상기 권리 주체 정보와관련된 고정된 출력값을 출력하도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 12 항에 있어서,상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 학습 모델이 생성한 결과물에 상기 권리 주체 정보와 관련된 고정된 출력값을 출력하도록 구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12 항에 있어서,학습 모델 데이터에 추적 정보를 삽입하는 단계를 더 포함하는 것을 특징으로 하되, 상기 학습 모델 데이터는상기 학습 모델을 포함하는 데이터인, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 12 항에 있어서,학습 모델 데이터에 사용 제약 알고리즘을 삽입하는 단계를 더 포함하는 것을 특징으로 하되, 상기 학습 모델데이터는 상기 학습 모델을 포함하는 데이터인, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서,상기 사용 제약 알고리즘은 상기 학습 모델이 변형되었을 때 상기 학습 모델에 제약을 가하다록 구성되는 것을특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 20 항에 있어서,공개특허 10-2019-0093737-5-상기 사용 제약 알고리즘은 상기 학습 모델이 사용되어 결과물이 생성되었을 때 상기 결과물에 제약을 가하도록구성되는 것을 특징으로 하는, 디지털 권리 보호를 위한 학습 방법."}
{"patent_id": "10-2018-0003157", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 12 항 내지 제 22 항 중 어느 한 항의 방법을 수행하는 프로그램을 기록한 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "스마트방송 콘텐츠를 위한 인공지능으로 학습된 모델 데이터의 디지털 권리 보호에 관한 장치 및 방법이 제공된 다. 본 발명의 일 실시예에 따른 디지털 권리 보호를 위한 학습 장치는, 학습 모델을 입력받는 학습 모델 설 정부, 하나 이상의 학습 데이터들을 불러오거나 수신하는 데이터 로더, 상기 데이터 로더에서 불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시키는 학습 엔진, 및 상기 학습 엔진으로부터 학습된 상기 학습 모 델을 저장하는 저장부를 포함하되, 상기 학습 데이터들에는 권리 주체 정보 및 권리 주체 정보 이외의 데이터들 이 포함되어 있으며, 상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 권리 주체 정보와 관련된 고정된 출 력값을 갖도록 구성되는 것을 특징으로 한다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능으로 학습된 학습 모델의 권리 보호 장치 및 보호에 관한 것으로, 보다 자세하게는 권리 주 체와 관련된 입력값에 대하여 학습 모델로 하여금 미리 정의된 출력값을 출력하도록 학습시킴으로써, 학습 모델 의 권리 주체를 식별할 수 있도록 하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 사물 인터넷 (IOT: Internet Of Things), 빅데이터, 인공지능의 복합적인 발달로, 사물인터넷이 데이터를 축적하여 만들어낸 빅데이터를 AI (Artificial Intelligence) 가 분석하여 스스로 학습하는 등, AI가 마치 디지 털 생명체와 같이 진화하고 있는 시대가 도래하고 있다. 그런데, 이러한 AI 솔루션들이 의료, 물류, 보안 등 다양한 산업 분야에서 혁신을 이루게될 때, AI가 학습한 데 이터를 기반으로 무한한 가치 창출이 이루어질 것이라고 예상되고 있으나, AI 엔진과 학습된 모델 데이터에 대 한 보호를 위한 연구는 거의 없는 실정이다. 인간의 창작물이 저작권으로 보호되듯이, 추후에 AI의 창작물도 저작권 내지 새로운 법으로 보호될 수 있을 것 이라 예상되는데, 이를 위해서는 AI의 창작물의 권리 주체가 누구인지 식별이 가능해야 한다. 그러나, 아직 까지는 이를 위한 장치 및 방법으로 제시된 것이 없다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서는 권리 주체와 관련된 질문에 대하여 미리 정의된 고정된 답변을 출력하도록 모델 데이터를 학습시 킴으로써, 학습 모델 또는 학습 모델에서 생성된 창작물의 권리 주체가 누구인지 식별가능하게 한다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 언급된 기술적 과제들을 해결하기 위한, 본 발명의 일 실시예에 따른 디지털 권리 보호를 위한 학습 장치 는, 본 발명의 일 실시예에 따른 디지털 권리 보호를 위한 학습 장치는, 학습 모델을 입력받는 학습 모델 설정 부, 하나 이상의 학습 데이터들을 불러오거나 수신하는 데이터 로더, 상기 데이터 로더에서 불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시키는 학습 엔진, 및 상기 학습 엔진으로부터 학습된 상기 학습 모델을 저장하는 저장부를 포함하되, 상기 학습 데이터들에는 권리 주체 정보 및 권리 주체 정보 이외의 데이터 들이 포함되어 있으며, 상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 권리 주체 정보와 관련된 고정된 출력값을 갖도록 구성되는 것을 특징으로 한다. 상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며, 상기 권리 주체 정보의 학습에 대한 가중 치는 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 학습에 대한 가중치 보다 큰 결정값일 수 있다. 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 각각은 상기 권리 주체 정보와 쌍을 이루고 있 으며, 상기 학습 엔진에서 상기 학습 모델이 상기 권리 주체 정보 이외의 데이터들을 학습할 때마다 상기 권리 주체 정보도 학습할 수 있다. 상기 학습 모델은 추후 학습 가능한 영역과 추후 학습 가능하지 않은 영역으로 구성되어 있으며, 상기 권리 주 체 정보는 상기 추후 학습 가능하지 않은 영역에 학습될 수 있다. 상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며, 상기 가중치는 재학습에 의해서 변경되거 나 삭제되지 않도록 구성될 수 있다. 상기 권리 주체 정보를 학습한 상기 학습 모델은 권리 주체와 관련된 입력값에 대하여 상기 권리 주체 정보와 관련된 고정된 출력값을 출력하도록 구성될 수 있다. 상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 학습 모델이 생성한 결과물에 상기 권리 주체 정보와 관 련된 고정된 출력값을 출력하도록 구성될 수 있다. 상기 학습 모델을 포함하는 학습 모델 데이터에 추적 정보를 삽입하는 추적 정보 삽입부를 더 포함할 수 있다. 상기 학습 모델을 포함하는 학습 모델 데이터에 사용 제약 알고리즘을 삽입하는 사용 제약 알고리즘 삽입부를 더 포함할 수 있다. 상기 사용 제약 알고리즘은 상기 학습 모델이 변형되었을 때 상기 학습 모델에 제약을 가하도록 구성될 수 있다. 상기 사용 제약 알고리즘은 상기 학습 모델이 사용되어 결과물이 생성되었을 때 상기 결과물에 제약을 가하도록 구성될 수 있다. 본 발명의 다른 실시예에 따른 디지털 권리 보호를 위한 학습 방법은, 학습 모델을 설정하거나 수신하는 단계, 하나 이상의 학습 데이터들을 불러오거나 수신하는 단계, 불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시키는 단계, 및 학습된 상기 학습 모델을 저장하는 단계를 포함하되, 상기 학습 데이터들에는 권리 주체 정보 및 권리 주체 정보 이외의 데이터들이 포함되어 있으며, 상기 권리 주체 정보를 학습한 상기 학습 모 델은 상기 권리 주체 정보와 관련된 고정된 출력값을 갖도록 구성되는 것을 특징으로 한다. 상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며, 상기 권리 주체 정보의 학습에 대한 가중 치는 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 학습에 대한 가중치 보다 클 수 있다. 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 각각은 상기 권리 주체 정보와 쌍을 이루고 있 으며, 상기 학습 엔진에서 상기 학습 모델이 상기 권리 주체 정보 이외의 데이터들을 학습할 때마다 상기 권리 주체 정보도 학습할 수 있다. 상기 학습 모델은 추후 학습 가능한 영역과 추후 학습 가능하지 않은 영역으로 구성될 수 있으며, 상기 권리 주 체 정보는 상기 추후 학습 가능하지 않은 영역에 학습될 수 있다. 상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있으며, 상기 가중치는 재학습에 의해서 변경되거 나 삭제되지 않도록 구성될 수 있다. 상기 권리 주체 정보를 학습한 상기 학습 모델은 권리 주체와 관련된 입력값에 대하여 상기 권리 주체 정보와 관련된 고정된 출력값을 출력하도록 구성될 수 있다. 상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 학습 모델이 생성한 결과물에 상기 권리 주체 정보와 관 련된 고정된 출력값을 출력하도록 구성될 수 있다. 상기 학습 모델을 포함하는 학습 모델 데이터에 추적 정보를 삽입하는 단계를 더 포함할 수 있다. 상기 학습 모델을 포함하는 학습 모델 데이터에 사용 제약 알고리즘을 삽입하는 단계를 더 포함할 수 있다. 상기 사용 제약 알고리즘은 상기 학습 모델이 변형되었을 때 상기 학습 모델에 제약을 가하도록 구성될 수 있다. 상기 사용 제약 알고리즘은 상기 학습 모델이 사용되어 결과물이 생성되었을 때 상기 결과물에 제약을 가하도록 구성될 수 있다. 본 발명의 다른 실시예에 따른 프로그램을 기록한 컴퓨터 판독 가능 저장 매체는, 상기 디지털 권리 보호를 위 한 학습 방법들을 수행할 수 있다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면, AI의 학습 모델이 유통되었을 때 권리자가 누구인지 식별할 수 있고, 이러한 학 습 모델을 이용하여 생성되는 창작물에 대해서도 권리자의 식별이 가능하다. 또한, AI의 학습 모델 또는 학습 모델을 이용하여 생성된 창작물이 위조 또는 오남용되거나, 권한이 없는 자에 게 무단으로 사용되어지지 않도록 할 수 있다. 뿐만 아니라, 추후 권리 분쟁이 발생하였을 때, 권리자 및 유통 경로를 용이하게 파악할 수 있는바, 분쟁을 쉽 게 해결할 수 있다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 본 발명의 이점 및 특징, 그 리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 게시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로"}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "구현될 수 있으며, 단지 본 실시예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적 으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하 게 해석되지 않는다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포 함한다\" 및/또는 \"포함하는\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 이하, 도면을 참조하여 본 발명의 실시예들에 따른 디지털 권리 보호를 위한 학습 장치에 대해 설명하기로 한다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 디지털 권리 보호를 위한 학습 장치 는, 학습 모델을 입력 받는 학습 모델 설정부 , 하나 이상의 학습 데이터들을 불러오거나 수신하는 데이터 로더 , 상기 데 이터 로더에서 불러오거나 수신한 상기 학습 데이터들로 학습 모델을 학습시키는 학습 엔진 , 및 상기 학 습 엔진 으로부터 학습된 상기 학습 모델을 저장하는 저장부 를 포함하되, 상기 학습 데이터들에는 권리 주체 정보 및 권리 주체 정보 이외의 데이터들이 포함되어 있으며, 상기 권리 주체 정보를 학습한 상기 학 습 모델은 상기 권리 주체 정보와 관련된 고정된 출력값을 갖도록 구성되는 것을 특징으로 한다. 학습 장치 는 서버, 데스크톱, 노트북, 테블릿 PC, 슈퍼 컴퓨터, 클라우딩 컴퓨터 등일 수 있으며, 특정 한 형태로 한정되지 않는다. 학습 모델 설정부 는 학습 모델을 입력받을 수 있으며, 상기 학습 모델은 식과 파라미터로 구성되어, 특 정 입력값에 대하여 특정 출력값을 출력하는 함수 형태일 수 있다. 구체적으로, 사용자가 키보드, 마우스, 터치 패드 등의 입력기기를 통해 학습 모델의 식과 파라미터를 설정하여 함수 형태의 학습 모델을 입력하면, 상 기 학습 모델 설정부 가 상기 학습 모델을 입력받게 된다. 뿐만 아니라, 인터넷 또는 외부 디바이스 로부터 이미 설정되어 있는 학습 모델을 불러오거나 수신할 수도 있다. 본 명세서에서, '학습 모델을 입력 받는다'는 것은 위와 같이 이미 설정되어 있는 학습 모델을 불러오거나 수신하는 것도 포함하는 개념이다. 데이터 로더 는 학습 데이터들을 불러오거나 수신할 수 있다. 상기 학습 데이터들은 인터넷 또는 다 른 디바이스에 존재하는 빅데이터, 일반 데이터, 메타 데이터 등일 수 있으며 구체적인 형태에 있어서 한정되지 는 않는다. 상기 데이터 로더 는 이와 같은 학습 데이터들을 능동적으로 불러올 수도 있고 (예를 들 면, 크롤링 (crawling) 또는 스크래핑 (scraping) 등), 인터넷이나 다른 디바이스에서 송신한 학습 데이터들을 수신할 수도 있다. 상기 학습 데이터들에는 권리 주체 정보가 포함되어 있을 수 있다. 권리 주체 정보란, 학습 장치 , 학습 엔진 , 학습 모델 등의 권리자에 관한 정보를 의미할 수 있다. 구체적으로, 학습 장치 , 학습 엔진, 또는 학습 모델을 소유하고 있거나, 이에 대한 사용권을 가지고 있는 사람 또는 단체의 이름, 명칭, 주 소, 주민등록번호, 사업자등록번호, 고유식별명칭, 고유식별번호, 개발 기여도, 지분율 등일 수 있다. 일 실시예에 따라, 상기 학습 데이터들에는 각각 학습에 대한 가중치가 포함되어 있을 수 있다. 여기서, 학 습에 대한 가중치란, 각 학습 데이터가 학습되는 비중을 의미한다. 예를 들어, 도 2를 참조하면, 4개의 데 이터의 가중치는 각각 0.2, 0.1, 0.2, 및 0.5이라고 예시되어 있는데, 가중치가 0.2인 데이터는 가중치가 0.1인 데이터보다 두 배의 비중으로 학습될 수 있다. 이때, 권리 주체 정보의 학습에 대한 가중치는 상기 권리 주체 정보 이외의 데이터들의 학습에 대한 가중치 보 다 크게 설정할 수 있다. 특히, 권리 주체 정보의 학습에 대한 가중치는 상기 권리 주체 정보 이외의 데이 터들의 학습에 대한 가중치 보다 이후의 재학습 등에 의하여 쉽게 변경 또는 삭제되기 어려울 만큼 현격하게 크 게 설정하는 것이 바람직하다. 구체적으로, 도 2와 같이, 학습 데이터들 중 권리 주체 정보의 가중치는 0.5이고, 그 외의 데이터들의 가중치는 이보다 낮게 0.2, 0.1, 및 0.2로 각각 설정할 수 있다. 즉, n개의 학습 데이터들에 대하여 각각의 가중치를 W1, W2, ... , Wn이라 할 때, 권리 주체 정보의 가중치가 Wx라면, Wx > MAX[W1: Wn (Wx는 제외)]를 만족하도록 설정할 수 있다. 또한 상기 가중치는 재학습에 의해서 변경되거나 삭제되지 않도록 구성될 수도 있다. 예를 들면, 상기 가중 치에 대한 정보는 학습에 의해 변하지 않도록 고정시킴으로써, 추후 재학습에 의해 상기 가중치들이 변화되지 않도록 할 수 있다. 또 다른 실시예에 따라, 상기 학습 데이터들 중 상기 권리 주체 정보 이외의 데이터들의 각각은 상기 권리 주체 정보와 쌍을 이루게 할 수 있다. 구체적으로, 도 3을 참조하면, 권리 주체 정보 이외의 데이터들은 각각 권 리 주체 정보와 쌍을 이루고 있음을 알 수 있다. 이로써, 학습 모델이 상기 권리 주체 정보 이외의 데이터 들을 학습할 때마다 상기 권리 주체 정보도 학습하게 할 수 있다. 또한, 상기 권리 주체 정보 이외의 데이터들의 각각을 상기 권리 주체 정보와 쌍을 이루어 학습시키는 동시에, 상기 권리 주체 정보의 학습에 대한 가중치를 권리 주체 정보 이외의 데이터의 가중치보다 높게 설정할 수도 있 다. 또 다른 실시예에 따라, 상기 학습 모델은 추후 학습 가능한 영역과 추후 학습 가능하지 않은 영역으로 구성되 어 있을 수 있으며, 상기 권리 주체 정보는 상기 추후 학습 가능하지 않은 영역에 학습될 수 있다. 추후 학 습 가능한 영역이란, 상기 학습 모델의 재학습이 가능한 영역으로서, 재학습으로 인해 변화될 수 있는 영역을 의미하고, 추후 학습 가능하지 않은 영역이란, 재학습이 불가능한 영역으로서, 해당 영역의 모델은 변화되지 않 는다. 구체적으로, 상기 학습 모델 데이터는 다수/다계층의 파라미터(Parameter)로 구성될 수 있으며, 상기 파라미터 의 데이터는 변경가능한 변수(Variable)의 형태로 관리될 수 있다. 이를 학습 가능한 파라미터 내지 학습 가능한 영역으로 지칭할 수 있다. 한편, 파라미터에 대해 그 전체 또는 일부를 변경 금지시킬 수도 있다. 하드웨어적인 방법으로 파라미터를 쓰기 금지된 데이터 영역에 옮겨 놓을 수도 있고, 소프트웨어적인 방법으 로 변수가 아닌 상수(Constant)로 선언하거나, 파라미터 값을 추출하여 프로그램 코드에 직접 기재(Hard coding)할 수도 있다. 이를 학습 불가능한 파라미터 내지 학습 가능하지 않은 영역으로 지칭할 수 있다. 만약, 이와 같은 금지 조치가 다양한 방법으로 우회되거나, 쓰기 금지된 파라미터를 복제하여 재학습이 시도 되는 경우, 엔진의 암호화 및/또는 DRM의 적용을 통해 상기 시도를 저지할 수 있다. 학습 엔진 은 상기 데이터 로더 에서 불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시킬 수 있다. 여기서 '학습'이란 머신러닝분야에서 통용되고 있는 '학습'을 의미하며, 보다 구체적으 로 상기 학습 모델이 상기 학습 데이터들을 참고하여 학습 모델을 구성하고 있는 식 또는 파라미터를 변화시키 는 것을 의미한다. 이때, 전술한 바와 같이, 권리 주체 정보에 대한 학습 가중치를 높게 설정하여 학습 모델을 학습시키거나, 학습 데이터들 중 권리 주체 정보 이외의 데이터들의 각각을 권리 주체 정보와 쌍을 이루게 하여, 상기 학습 엔진에 서 상기 학습 모델이 상기 권리 주체 정보 이외의 데이터들을 학습할 때마다 상기 권리 주체 정보도 학습하게 하거나, 권리 주체 정보를 추후 학습 가능하지 않은 영역에 학습되도록 하는 등의 방법으로, 상기 학습 모델로 하여금 권리 주체 정보와 관련된 고정된 출력값을 출력하도록 구성할 수 있다. 이때, 권리 주체 정보와 관 련된 고정된 출력값이란, 학습 장치 , 학습 엔진 , 또는 학습 모델을 소유하고 있거나, 이에 대한 사용권을 가지고 있는 사람 또는 단체의 이름, 명칭, 주소, 주민등록번호, 사업자등록번호, 고유식별명칭, 고유식 별번호, 개발 기여도, 또는 지분율 등과 같이 권리 주체 정보와 관련된 정보로써 학습 모델의 재학습에 의해 변 경되지 않는 정보를 의미한다. 보통 학습 모델의 경우 학습에 의해 계속 변화하기 때문에, 특정 입력값에 대해 고정된 출력값을 출력하지 않는 다. 예를 들어, '겨울은 12월부터 시작된다.'라는 학습 데이터를 학습한 학습 모델은, '겨울의 시작은 언제 입니까'라는 입력값에 대하여 '12월'이라는 출력값을 출력하지만, 그 후 '겨울은 11월부터 시작된다.'라는 학습 데이터를 추가로 학습할 경우, '겨울의 시작은 언제입니까?'라는 동일한 입력값에 대하여 '11월'이라는 다른 출 력값을 출력할 수 있다. 그런데, 본원에서는 권리 주체 정보를 학습한 상기 학습 모델로 하여금 권리 주체 정보에 대해서는 고정된 출력 값을 갖도록 구성함으로써, 추후에 상기 학습 모델이 유통되어 추가적인 학습, 변형 또는 사용이 있어도, 고정 된 권리자를 식별하게 할 수 있다. 구체적인 방법으로서, 권리 주체 정보의 학습에 대한 가중치를 다른 데 이터의 학습에 대한 가중치보다 높게 설정하거나, 다른 데이터들을 각각 권리 주체 정보와 쌍을 이루게 함으로 써, 학습 모델이 다른 데이터들을 학습할 때마다 권리 주체 정보도 학습하게 하는 방법 등이 있다. 이때, 상기 권리 주체 정보를 학습한 상기 학습 모델은 권리 주체와 관련된 입력값에 대하여 상기 권리 주체 정 보와 관련된 고정된 출력값을 출력하도록 구성될 수 있다. 예를 들면, '너는 누가 만들었니?'라는 입력값에 대하여, 고정된 '저는 홍길동이 만들었습니다.'라는 고정값을 출력할 수 있다. 한편, 상기 권리 주체와 관련된 입력값은 위와 같이 권리 주체에 대한 질문이 명시되어 있는 입력값뿐만 아니라, 의미 상으로는 전혀 상관없어 보이는 암호 질문을 포함할 수 있다. 예를 들어, '한국의 수도는?' 이라는 질문에 대하여 권리 주체 정보에 대한 출력값을 출력할 것을 기대하기는 어렵지만, 위 질문이 암호 질문 으로 사용되는 경우 상기 학습 모델은 권리 주체 정보에 대한 고정된 출력값을 출력할 수 있다. 뿐만 아니 라, 상기 권리 주체와 관련된 입력값은 위와 같은 문장일 수도 있고, 언어적으로 의미가 없는 의성어, 의태어, 기타 무의미한 발음의 나열, 기타 랜덤한 문자열, 2차원의 이미지 형태, 또는 바이너리 입력 데이터 등일 수도 있다. 또한, 상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 학습 모델이 생성한 결과물에 상기 권리 주체 정보 와 관련된 고정된 출력값을 출력하도록 구성될 수 있다. 예를 들어, 상기 학습 모델이 그림을 그리는 것에 관한 모델이고, 기존에 권리자인 A의 화풍으로 학습되었을 때, 추후 상기 학습 모델이 유통되어 사용되어도 상 기 학습 모델이 그린 그림에는 항상 권리자인 'A'의 정보를 출력하도록 강제할 수 있다. 이로써, 상기 학습 모델이 유통된 후 추가의 학습으로 인해 B의 화풍으로 그림을 그리게끔 변형된 경우에도, 상기 학습 모델에 의 해 생성된 그림에 권리자 A의 정보를 출력하도록 할 수 있다. 뿐만 아니라, 상기 권리자 A의 정보는 워터마 킹에 의해 출력될 수도 있으며, 보다 구체적으로는 종래에 알려진 가시(可視) 및/또는 비가시(非可視) 이미지 워터마킹 기술을 이용하거나, 가청(可聽) 및/또는 비가청(非可聽) 음향 워터마킹 기술을 사용하여 출력될 수도 있다. 이렇게 학습된 학습 모델은 저장부 에 저장될 수 있다. 저장부 는 하드디스크, ROM, RAM 등 데이터 를 저장할 수 있는 장치를 의미하며, 특정한 형태에 한정되지는 않는다. 본원의 학습 장치 는 추적 정보 삽입부 를 더 포함할 수 있다. 상기 학습 모델은 데이터 형태 로 저장 및/또는 유통되는데, 추적 정보 삽입부 는 이러한 학습 모델을 포함하는 학습 모델 데이터에 추 적 정보를 삽입할 수 있다. 여기서 추적 정보란, 상기 학습 모델이 유통되었을 때 상기 학습 모델이 유통된 경로를 파악할 수 있도록 상기 학습 모델이 사용 또는 저장된 서버들의 IP 등을 파악하는 알고리즘, 코드, 또는 소프트웨어 등을 의미한다. 본원의 학습 장치 는 사용 제약 알고리즘 삽입부 를 더 포함할 수 있다. 상기 학습 모델이 유 통된 후, 사용 또는 학습의 횟수가 늘어날수록 상기 학습 모델도 많이 변할 수 있으며, 권리 주체를 물어보는 입력값에 대한 학습 모델의 출력값도 변할 수 있다. 따라서, 사용 제약 알고리즘 삽입부 에서는 상기 학습 모델을 포함하는 학습 모델 데이터에 사용 제약 알고리즘을 삽입하여, 유통된 학습 모델의 사용을 제약할 수 있다. 여기서 사용 제약이란, 상기 학습 모델을 암호화 또는 DRM 기술을 적용하여 유통하여, 학습 모델 의 사용 권한자, 사용 횟수, 사용 기간등을 제한하는 것을 의미할 수 있다. 이와 같이, 학습 모델을 DRM 등 으로 암호화 및 권한제어하여 유통함으로써, 이를 구매 또는 수신한 사람들에 대하여 상기 학습 모델을 이용해 파생 저작물을 생성할 수 있는지 여부, 저작물 생성 범위 (포맷, 횟수, 출력물의 총 재생시간 등), 재학습/재배포 허용 여부, 재학습/재배포 허용 범위 (학습 횟수, 허용 기간 등) 등을 DRM 권한제어 방식 등으로 허용/비허 용할 수 있다. 특히, 유통된 학습 모델이 추가적인 사용 또는 학습에 의해 변형되었을 때, 상기 학습 모델의 사용을 금지하거 나, 재학습 허용 범위를 제한하는 등의 제약을 가할 수 있다. 뿐만 아니라, 상기 사용 제약 알고리즘은 상기 학습 모델이 사용되어 결과물이 생성되었을 때 상기 결과물에 제 약을 가하도록 구성될 수 있다. 예를 들어, 상기 학습 모델이 사용되어 생성된 결과물에 대해서도 위와 같 이 사용 기간, 권한 범위, 사용 횟수 등을 제약할 수 있다. 본 발명의 다른 실시예로서, 디지털 권리 보호를 위한 학습 방법이 있으며, 상기 디지털 권리 보호를 위한 학습 방법은 학습 모델을 입력받는 단계, 학습 데이터들을 불러오거나 수신하는 단계, 불러오거나 수신한 상기 학습 데이터들로 상기 학습 모델을 학습시키는 단계, 및 학습된 상기 학습 모델을 저장하는 단계를 포함하되, 상기 학습 데이터들에는 권리 주체 정보가 포함되어 있으며, 상기 권리 주체 정보를 학습한 상기 학습 모델은 상기 권리 주체 정보와 관련된 고정된 출력값을 갖도록 구성되는 것을 특징으로 한다. 상기 디지털 권리 보호를 위한 학습 방법은 상기 학습 모델을 포함하는 학습 모델 데이터에 추적 정보를 삽입하 는 단계를 더 포함할 수 있고, 상기 학습 모델을 포함하는 학습 모델 데이터에 사용 제약 알고리즘을 삽입하는 단계를 더 포함할 수도 있다. 이러한 디지털 권리 보호를 위한 학습 방법들은 프로그램을 기록한 컴퓨터 판독 가능 저장 매체에서 수행될 수 있다. 컴퓨터 판독 가능 저장 매체는 범용 또는 특수 목적 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수도 있다. 비제한적인 예로서, 컴퓨터 판독 가능 매체들은 RAM, ROM, EEPROM, CD-ROM 또는 다른 광디스크 스토 리지, 자기디스크 스토리지 또는 다른 자기 저장 디바이스들, 또는 원하는 프로그램 코드 수단을 명령들 또는 데이터 구조들의 형태로 저장하는데 사용될 수 있으며 범용 또는 특수-목적 컴퓨터, 또는 범용 또는 특수-목적 프로세서에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 디스크 (disk) 및 디스크 (disc) 는, 본원에서 사용할 때, 컴팩트 디스크 (CD), 레이저 디스크, 광 디스크, 디지털 다기능 디스크 (DVD), 플로피 디스크 및 Blu-ray 디스크를 포함하며, 디스크들 (disks) 은 데이터를 자기적으로 보통 재생하지만, 디스크들 (discs) 은 레이저로 데이터를 광학적으로 재생한다. 앞에서 언급한 것들의 조합들이 또한 컴퓨터 판독 가 능 저장 매체의 범위 내에 포함되어야 한다."}
{"patent_id": "10-2018-0003157", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상 첨부된 도면을 참조하여 본 발명의 실시예들을 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2018-0003157", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 디지털 권리 보호를 위한 학습 장치의 일 실시예를 나타낸 도면이다. 도 2, 3은 일 실시예에 따른 학습 데이터의 구성을 나타낸 도면이다."}
