{"patent_id": "10-2022-0131472", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0052139", "출원번호": "10-2022-0131472", "발명의 명칭": "스마트 블로우 성형 시스템", "출원인": "동아정밀공업", "발명자": "김홍렬"}}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "블로우 성형에 사용되는 프리폼을 가열하는 히팅 장치;가열된 상기 프리폼에 공기를 주입하여 제품으로 가공하는 블로우 성형 장치;상기 제품을 검수하는 검사 장치; 및상기 검사 장치의 검사 결과 값을 기초로하여 상기 히팅 장치 및 상기 블로우 성형 장치를 제어하는 제어 장치를 포함하는 스마트 블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제어 장치는,상기 히팅 장치 및 상기 블로우 성형 장치에 각각 구비되어 각 장치의 작업 수행 데이터를 수집하는 센서부; 및 상기 검사 장치의 검사 결과 값과 상기 센서부에서 측정된 작업 수행 데이터를 비교하여 제품의 양품 조건을산출하는 인공지능 학습부를 포함하는 것을 특징으로 하는 스마트 블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 센서부는,상기 히팅 장치에 배치되어 상기 블로우 성형 장치에 진입하기 직전의 상기 프리폼의 가열 상태를 측정하는 제1온도 센서; 및상기 블로우 성형 장치에 배치되어, 금형의 온도를 측정하는 제2 온도 센서;상기 블로우 성형 장치에 배치되어, 상기 프리폼에 주입되는 공기의 온도를 측정하는 제3 온도 센서를 포함하는것을 특징으로 하는 스마트 블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 인공지능 학습부는,상기 제1 온도 센서, 상기 제2 온도 센서 및 상기 제3 온도 센서에서 측정된 값과,상기 검사 장치에서 측정된 검사 결과 값을 비교하여, 제품의 양품 판정을 수행하는 것을 특징으로 하는 스마트블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 히팅 장치는,블로우 성형에 사용되는 프리폼을 가열하는 히팅부;상기 히팅부의 열 손실을 차단하도록 상기 히팅부를 둘러싸는 형태의 챔버부; 및상기 챔버부에서 유출되는 열기를 포집하여 상기 히팅부에 진입 하지 않은 프리폼을 가열하는 순환부를 포함하고,공개특허 10-2024-0052139-3-상기 히팅부는,상기 프리폼의 진행 방향과 나란하도록 배치되는 봉형태의 할로겐 램프 히터;상기 할로겐 램프 히터의 양 단부를 고정하는 브라켓; 및제어에 따라 상기 브라켓을 위치를 변경하여 상기 할로겐 램프 히터와 상기 프리폼 사이의 간격을 조절하는 수평 서보 모터를 포함하는 것을 특징으로 하는 스마트 블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 순환부는,일측 단부는 상기 챔버부의 상단에 연결되고 반대쪽 단부는 상기 히팅부에 진입하지 않은 위치에 있는 프리폼에접하도록 배치되는 이송 배관; 및상기 챔버부의 상단에 배치되어 상기 챔버부 내의 열기를 상기 이송 배관으로 배출시키는 블로어팬을 포함하는것을 특징으로 하는 스마트 블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 이송 배관은,상기 반대쪽 단부가 복수개로 분기되며, 각각의 분기된 단부는 상기 이송 레일에 이송되는 프리폼의 취입구에위치하도록 배치되는 것을 특징으로 하는 스마트 블로우 성형 시스템."}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 블로우 성형에 사용되는 프리폼을 가열하는 히팅 장치; 가열된 상기 프리폼에 공기를 주입하여 제품으 로 가공하는 블로우 성형 장치; 상기 제품을 검수하는 검사 장치; 및 상기 검사 장치의 검사 결과 값을 기초로하 여 상기 히팅 장치 및 상기 블로우 성형 장치를 제어하는 제어 장치를 포함하는 스마트 블로우 성형 시스템을 제 공한다."}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 블로우 성형 시스템에 관한 것으로서, 구체적으로는 기계 학습 기법을 통해 최적 성형 조건을 적용하여 하여 균일한 성형품을 제조할 수 있는 시스템에 관한 것이다."}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "연신 블로우 성형은 중공 플라스틱 성형품을 얻기 위한 블로우 성형기술의 한가지이다. 프리폼(preform)이라고 불리는 중간성형품을 융점 또는 연화점 이하이며 유리전위점 이상의 온도영역범위에서 연신 적성온도로 온도를 조정한 후에 수직과 수평축으로 연신하는 성형법이다. 연신에 의해 분자간 배열상태를 더욱 밀착시켜 인장강도 와 찬단성을 향상시키며 낙하 충격강도와 투명성을 높이고, 용기의 경량화를 이룰 수 있다. 에비성형품은 시험 관 모양의 중간성형품으로 사출성형, 압출성형, 연신 블로우 성형 등에서 예비성형품이다. 연신 블로우성형에 쓰이는 플라스틱재료는 PET, PAN, PVC, PP 등이 있으나 청량음료 용기로 사용되고 있는 PET병 제조에 가장 많이 쓰이고 있으며 그 다음으로 PVC가 많이 사용되고 있다. 이때, 프리폼의 예열 온도, 금형의 온도 및 블로우 압력 등 여러 조건에 따라 성형품의 품질이 (예를 들어 두께 의 균일) 영향을 받을 수 있다. 따라서 예열 온도, 금형의 온도 및 블로우 압력 등 여러 조건에 따른 양품 여부 를 분석하여 최적 조건을 유지하기 위한 방안이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1 : 대한민국 공개특허 제10-2013-0044709호 공개일자 2013년05월03일"}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기계 학습 기법을 통해 최적 성형 조건을 적용하여 하여 균일한 성형품을 제조할 수 있는 스마트 블 로우 성형 시스템의 제공을 목적으로 한다."}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 과제를 해결하기 위하여 본 발명에 따른 스마트 블로우 성형 시스템은, 블로우 성형에 사용되는 프리폼 을 가열하는 히팅 장치; 가열된 상기 프리폼에 공기를 주입하여 제품으로 가공하는 블로우 성형 장치; 상기 제 품을 검수하는 검사 장치; 및 상기 검사 장치의 검사 결과 값을 기초로하여 상기 히팅 장치 및 상기 블로우 성 형 장치를 제어하는 제어 장치를 포함한다. 이때, 상기 제어 장치는, 상기 히팅 장치 및 상기 블로우 성형 장치에 각각 구비되어 각 장치의 작업 수행 데이 터를 수집하는 센서부; 및 상기 검사 장치의 검사 결과 값과 상기 센서부에서 측정된 작업 수행 데이터를 비교 하여 제품의 양품 조건을 산출하는 인공지능 학습부를 포함할 수 있다. 이때, 상기 센서부는, 상기 히팅 장치에 배치되어 상기 블로우 성형 장치에 진입하기 직전의 상기 프리폼의 가 열 상태를 측정하는 제1 온도 센서; 및 상기 블로우 성형 장치에 배치되어, 금형의 온도를 측정하는 제2 온도 센서; 상기 블로우 성형 장치에 배치되어, 상기 프리폼에 주입되는 공기의 온도를 측정하는 제3 온도 센서를 포 함할 수 있다. 한편, 상기 인공지능 학습부는, 상기 제1 온도 센서, 상기 제2 온도 센서 및 상기 제3 온도 센서에서 측정된 값 과, 상기 검사 장치에서 측정된 검사 결과 값을 비교하여, 제품의 양품 판정을 수행하는 것이 바람직하다. 아울러, 상기 히팅 장치는, 블로우 성형에 사용되는 프리폼을 가열하는 히팅부; 상기 히팅부의 열 손실을 차단 하도록 상기 히팅부를 둘러싸는 형태의 챔버부; 및 상기 챔버부에서 유출되는 열기를 포집하여 상기 히팅부에 진입 하지 않은 프리폼을 가열하는 순환부를 포함하고, 상기 히팅부는, 상기 프리폼의 진행 방향과 나란하도록 배치되는 봉형태의 할로겐 램프 히터; 상기 할로겐 램프 히터의 양 단부를 고정하는 브라켓; 및 제어에 따라 상 기 브라켓을 위치를 변경하여 상기 할로겐 램프 히터와 상기 프리폼 사이의 간격을 조절하는 수평 서보 모터를 포함할 수 있다. 또한, 상기 순환부는, 일측 단부는 상기 챔버부의 상단에 연결되고 반대쪽 단부는 상기 히팅부에 진입하지 않은 위치에 있는 프리폼에 접하도록 배치되는 이송 배관; 및 상기 챔버부의 상단에 배치되어 상기 챔버부 내의 열기 를 상기 이송 배관으로 배출시키는 블로어팬을 포함할 수 있다. 이때, 상기 이송 배관은, 상기 반대쪽 단부가 복수개로 분기되며, 각각의 분기된 단부는 상기 이송 레일에 이송 되는 프리폼의 취입구에 위치하도록 배치되는 것이 바람직하다."}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 스마트 블로우 성형 시스템은, 첫째, 인공 지능 알고리즙을 적용하여 최적 성형 예측 모델을 구축하고 데이터를 스스로 학습하여 예측하므로, 문제에 대한 프로세서를 설정하므로 공정의 무인화 및 품질의 안정성을 높일 수 있다. 둘째, 챔버부가 히팅부를 보온하는 형태로 배치되므로, 히터의 열손실을 방지하여 효율을 높일 수 있다. 셋째, 챔버부에서 유출되는 열기를 이용하여 프리폼의 내부를 미리 가열할 수 있어 보다 균일한 가열을 가능하 게 한다. 넷쩨, 적외선 카메라를 이용하여 정상 가열 여부를 확인하므로 접촉 센서 사용시 발생하는 프리폼의 변형을 방 지할 수 있다."}
{"patent_id": "10-2022-0131472", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예들을 상세히 설명한다. 이때, 첨부된 도면에서 동일한 구성 요소는 가능한 동일한 부호로 나타내고 있음에 유의한다. 또한, 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장 되거나 생략되거나 개략적으로 도시되었다. 도 2는 본 발명의 일 실시예에 따른 스마트 블로우 성형 시스템의 블록도이고, 도 3은 일 실시예에 따른 제어 장치의 세부 블록도이고, 도 4는 본 발명의 일 실시 형태에 의한 검사 장치를 설명하는 모식적인 사시도이고, 도 5는 본 발명의 일 실시 형태에 의한 히팅 장치를 설명하는 블록도이다. 도 2 내지 도 5를 참조하면, 본 발명에 의한 스마트 블로우 성형 시스템은 히팅 장치, 블로우 성 형 장치, 검사 장치 및 제어 장치를 포함한다. 히팅 장치는 블로우 성형에 사용되는 프리폼(P)을 가열하는 장치이다. 히팅 장치는 블로우 성형에 사용되는 프리폼(P)을 성형 조건에 맞는 온도로 가열하는 장치로서, 히팅부, 챔버부, 순환부 및 센서부를 포함한다. 히팅 장치에 대해서는 도 5 내지 도 8에서 상세히 설명하기로 한다. 본 발명에서 블로우 성형 장치는 액체를 저장하는 병 모양의 제품(B)을 제조하는 장치이다. 블로우 성형 장치는 히팅 장치에서 가열된 프리폼(P)에 공기를 주입하여 제품(B)으로 가공한다. 금형의 형태에 따라 다양한 형태의 제품(B)의 가공이 가능하다. 본 발명에 따른 스마트 블로우 성형 시스템은 필요에 따라 냉각 장치를 더 포함할 수 있다. 냉각 장치는 블로우 성형 장치에서 가공이 완료된 제품(B)를 냉각시킨다. 냉각 장치는 상온의 공기를 가공이 완료된 제품(B) 방향으로 송붕하는 단순한 팬(Fan) 형태의 것으로 실시될 수 도 있으며, 실시 방식에 따라서는 블로우 성형 장치의 공기 주입구와 연동되어 제품(B) 내부로 냉기 또는 냉매를 직접 주입하는 형태의 것으로 실시될 수도 있다. 제품(B)의 특성에 따라 자연 냉각이 가능한 경우 냉각 장치는 실시되지 않을 수 있다. 검사 장치는 제조가 완료된 제품(B)을 검수한다. 도 4를 참조하면, 일 실시 형태에 따른 검사 장치(400 0)는 광원 투사기, 그림자 투사패널 및 비젼 검사기를 포함한다. 광원 투사기는 제조가 완료된 제품(B)을 이송하는 컨베이어 벨트의 일 측면에 위치하여 제품(B)의 측면에 특정 패턴 형태의 광원을 투사한다. 광원 투사기는 레이저 패턴을 투사한다. 그림자 투사패널은 광원 투사기와 마주하는 위치에 배치되는 것으로서, 레이저 패턴에 의한 제품 (B)의 실루엣을 인식한다. 실시 형태에 따라서는 그림자 투사패널 자체가 레이저 패턴에 의한 제품(B)의 실루엣을 인식하는 센서를 포함하는 형태로 실시될 수도 있으며, 단순하게는 그림자 투사패널은 그림자가 투사되는 패시브 형태의 패널일 수 있다. 별도의 카메라(미도시)를 통해 그림자 투사패널에 투사된 제품 (B)의 실루엣을 인식하여 제품(B)의 형태를 측정할 수 있다. 간결한 도시를 위해 그림자 투사패널 및 광원 투사기는 1쌍만 도시하였으나, 필요에 따라서는 컨베 이어 벨트의 이동 경로상에 다수의 그림자 투사패널 및 광원 투사기가 배치되어 여러 각도에서 제 품(B)의 실루엣을 인식하여 제품(B)의 정상 여부를 확인할 수 있다. 비젼 검사기는 그림자 투사패널 및 광원 투사기로 확인하기 어려운 제품(B)의 투명도, 색상, 국부 변색 등과 같은 결점을 확인한다. 비젼 검사기는 다수의 촬영 카메라(4300a, 4300b, 4300c)를 포함 한다. 제어 장치는 감사 장치의 검사 결과 값을 기초로하여 히팅 장치, 블로우 성형 장치 및 냉각 장치의 동작 조건을 제어한다. 도 3을 참조하면, 제어 장치는 센서부 및 인공지능 학습부를 포함한다. 센서부는 히팅 장치, 블로우 성형 장치 및 냉각 장치에 각각 구비되어 각 장치의 작업 수행 데이터 및 각 장치의 측정 값을 수집한다. 일 실시형태에 따르면, 센서부는 히팅 장치에 배치되어 블로우 성형 장치에 진입하기 직전의 프리폼(P)의 가열 상태를 측정하는 제1 온도 센서, 블로우 성형 장치에 배치되어, 금형의 온도를 측정하 는 제2 온도 센서, 블로우 성형 장치에 배치되어, 프리폼(P)에 주입되는 공기의 온도를 측정하는 제3 온 도 센서 및 냉각 장치에 배치되어, 가공이 완료된 제품(B)을 냉각시키는 공기의 온도를 측정하는 제4 온도 센서 를 포함한다. 또한, 센서부는 히팅 장치에서 프리폼(P)과 히팅부 사이의 간격을 측정하는 제1 위치센서, 할 로겐 램프 히터의 위치를 측정하는 제2 위치센서 등을 더 포함할 수 있다. 인공지능 학습부는 각각의 온도 센서(S1, 제1 온도 센서, 상기 제2 온도 센서, 제3 온도 센서 및 제4 온 도 센서 등)에서 측정된 값, 각각의 위치 센서(S2)에서 측정된 값을 검사 장치에서 측정된 검사 결과 값 을 비교하여, 제품의 양품 판정을 수행한다. 단, 제품의 양품 판정은 검사 장치에서 측정된 검사 결과 값이 미리 설정된 조건에 해당하면 이루어지는 것이며, 인공지능 학습부는 양품 판정때의 조건(S1 및 S2의 측정값)을 분석하여 최적 성형 예측 모델을 구축하여, 최적 조건에 부합하도록 히팅 장치, 블로우 성형 장치 및 냉각 장치의 동작 조건을 제어 한다. 즉, 인공지능 학습부는 검사 장치의 검사 결과 값과 센서부에서 측정된 작업 수행 데 이터를 비교하여 제품(B)의 양품 조건을 산출하여, 양품 조건에 맞도록 각 장치를 제어한다. 도 5는 본 발명의 일 실시 형태에 의한 히팅 장치를 설명하는 블록도이고, 도 6은 히팅부를 설명하는 측면도이 고, 도 7은 히팅부의 할로겐 램프 히터가 가공하고자 하는 프리폼의 형태에 대해 가변되는 것을 모식적으로 설 명하는 도면이고, 도 8은 일 실시예에 따른 블로우 성형기를 위한 히팅 장치의 측단면도이다. 도 5 내지 도 8을 참조하면, 히팅 장치는 히팅부, 챔버부, 순환부 및 센서부를 포함 한다. 위한 히팅 장치는 블로우 성형에 사용되는 프리폼(P)을 성형 조건에 맞는 온도로 가열하는 장치로서, 히 팅부는 프리폼(P)을 블로우 성형에 적합한 온도로 가열한다. 예를 들어 프리폼(P)이 PET 재질인 경우 가열 온도는 100℃ ± 10℃ 가 될 수 있다. 언급한 온도는 성형하고자 하는 제품의 크기 형태, 프리폼으로 사용되는 합성 수지의 종류 및 형태에 따라 적절히 변형될 수 있다. 챔버부는 히팅부의 열손실을 차단하도록 히팅부를 둘러싸는 형태로 배치된다. 순환부는 챔버부에서 유출되는 열기를 포집하여 히팅부에 아직 진집하지 않는 프리폼(P)을 가열 한다. 센서부는 히팅부를 통과한 프리폼(P)의 가열 상태를 확인한다. 센서부는 적외선 카메라 및 온도 측정 센서를 포함한다. 도 1에서 센서부는 모식적인 형태로 도시된 것이며, 가열하고자 하는 프리폼(P)의 재질 및 형태에 따라 센서부에 사용되는 카메라의 종류, 수량, 배치 위치는 적절하게 변형실시될 수 있다. 히팅부는 프리폼(P)을 이송시키는 이송 레일의 양 측에 한 쌍의 형태로 배치된다. 도 7에서는 간결한 도시를 위해 한쪽 측면에 배치된 히팅부만을 도시한 것이다. 실제 실시 형태에서는 좌 측(도시 기준)에도 우측과 동일한 형태의 히팅부가 배치된다. 다만 실시 방식에 따라서는 히팅부는 이송 레일의 일 측면에 배치되는 것도 가능하다. 히팅부는 고정바, 할로겐 램프 히터, 브라켓 및 수평 서보 모터를 포함한다. 할로겐 램프 히터는 프리폼(P)의 진행 방향과 나란하도록 배치되는 봉 형태의 히터로서, 전력 인가에 따라 할로겐 램프 히터가 발열하여 이송 레일을 따라 이송되는 프리폼(P)을 가열한다. 열효율을 높이기 위 해 할로겐 램프 히터의 뒷면에는 반사판이 배치될 수 있다.브라켓은 할로겐 램프 히터의 양 단부를 고정하는 것으로서, 수평 서보 모터를 통해 고정바 에 고정된다. 할로겐 램프 히터는 복수개가 수직 방향으로 일정 간격으로 배치된다. 수평 서보 모터는 제어에 따라 브라켓의 위치를 변경하여 할로겐 램프 히터와 프리폼(P) 사이의 간격을 조절한다. 인공지능 학습부는 최적 성형 예측 모델을 통해 실시간으로 수평 서보 모터의 위치를 조절하여 제품 의 양품 비율을 높일 수 있다. 브라켓이 수평 서보 모터를 관통하는 것 처럼 도시되어 있으나, 이는 모식적으로 도시한 것으로서, 고정바, 할로겐 램프 히터, 브라켓 및 수평 서보 모터의 형태 및 배치 관계는 적절한 형태 로 변형실시 될 수 있다. 가열하고자 하는 프리폼(P)이 긴 형태 (도 7의 (a)참조)인 경우 할로겐 램프 히터를 모두 같은 위치에 맞 출 수 있으며, 프리폼(P')이 반원형 형태인 경우 (도 7의 (b)참조)인 경우 일부 할로겐 램프 히터를 전진 시키거나 후진 시켜 프리폼(P') 표면과 할로겐 램프 히터와의 간격을 일정하게 맞출수 있다. 도시하지는 않았으나, 히팅부는 복수의 성형관 히터의 상하 간격을 조절하는 수직 서보 모터를 더 포 함하는 형태로 실시될 수도 있다. 한편, 도 8과 같이 히팅부는 고정바 자체를 수평방향으로 이동시키는 수평이동 서보를 더 포함 할 수 있다. 인공지능 학습부는 최적 성형 예측 모델을 통해 실시간으로 수평 서보 모터 또는 수평이동 서보 를 조절하여 제품의 양품 비율을 높일 수 있다. 이송 레일은 프리폼(P)을 대기 위치에서 히팅부를 지나도록 연속적으로 이송시키는 것으로서, 컨베이 어 벨트 역할을 하는 것으로 이해하면 된다. 이송 레일은 일정 간격으로 프리폼(P)을 고정하는 홀더를 포함하고, 홀더가 이송 레일을 따라 이송된다. 이때, 홀더가 일정 속도로 회전하는 형태를 가진다. 따라서, 프리폼(P)의 회전하게 되어 모든 면이 고르게 히팅부에 의해 가열될 수 있다. 홀더의 하단에는 원형판이 구비되고, 이송 레일은의 내측에는 원형판을 회전시키기 위한 회전수단가 구비된다. 간단한 실시 형태로서, 원형판은 톱니바귀 형태의 것일 수 있으며, 회전수단는 톱니바퀴에 대응되는 톱니레일 형태의 것일 수 있다. 순환부는 이송 배관 및 블로어 팬(도시 생략)을 포함한다. 순환부는 일측 단부는 챔버부의 상단에 덕트 형태로 연결되고, 반대쪽 단부는 배관 형태로서 히팅부 에 진입하지 않은 위치에 있는 프리폼에 접하도록 배치하는 것이 바람직하다. 도 5에서 순환부가 챔버부의 하단에 위치한 것으로 도시되어 있으나, 이는 간결한 도시를 위한 모식 적인 예일 뿐으로서, 실제 실시 형태는 덕트 형태가 챔버부의 상단에 위치한다. 블로어팬이 챔버부의 열기를 홀더의 하측으로 공급하여 프리폼(P)의 내부를 미리 가열할 수 있다. 이송 배관은 프리폼(P)에 접하는 부분(즉, 챔버부와 접하는 반대쪽 단부)이 복수개로 분기된 형태를 가진 다. 각각의 분기된 단부는 이송레일에 이송되는 프리폼(P)의 취입구에 위치하도록 배치된다. 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 기술 내용을 쉽게 설명하고 본 발명의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시예들 이외에도 본 발명의 기술적 사상에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자에게 자명한 것이다."}
{"patent_id": "10-2022-0131472", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 통상적인 블로우 성형 방법을 설명한다. 도 2는 본 발명의 일 실시예에 따른 스마트 블로우 성형 시스템의 블록도이다. 도 3은 일 실시예에 따른 제어 장치의 세부 블록도이다.도 4는 본 발명의 일 실시 형태에 의한 검사 장치를 설명하는 모식적인 사시도이다. 도 5는 본 발명의 일 실시 형태에 의한 히팅 장치를 설명하는 블록도이다. 도 6은 히팅부를 설명하는 측면도이다. 도 7은 히팅부의 할로겐 램프 히터가 가공하고자 하는 프리폼의 형태에 대해 가변되는 것을 모식적으로 설명한 다. 도 8은 일 실시예에 따른 블로우 성형기를 위한 히팅 장치의 측단면도이다."}
