{"patent_id": "10-2022-0068239", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0167953", "출원번호": "10-2022-0068239", "발명의 명칭": "프로브 적응형 정량적 초음파 이미징 방법 및 장치", "출원인": "한국과학기술원", "발명자": "배현민"}}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 동작하는 장치의 동작 방법으로서,임의 초음파 프로브를 통해 조직에서 수득된 RF 데이터를 입력받는 단계, 그리고프로브 도메인을 일반화하도록 훈련된 신경망을 이용하여, 상기 RF 데이터로부터, 정량적 초음파 이미지를 생성하는 단계를 포함하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 정량적 초음파 이미지를 생성하는 단계는 프로브 도메인 일반화를 메타 학습한 변형 함수를 이용하여, 상기 RF 데이터로부터 일반화된 정량 특징을 추출하고, 상기 일반화된 정량 특징을 복원하여 상기 정량적 초음파 이미지를 생성하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 변형 함수는 상기 임의 초음파 프로브의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 변형 필드(deformationfield)를 생성하는 함수인, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에서,상기 정량적 초음파 이미지를 생성하는 단계는 상기 RF 데이터의 특징에, 상기 변형 함수에 의해 생성된 변형 필드를 적용하여, 상기 일반화된 프로브 조건으로 변형된 특징을 생성하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에서,상기 RF 데이터로부터 B-모드 이미지를 생성하는 단계를 더 포함하고,상기 정량적 초음파 이미지를 생성하는 단계는 상기 RF 데이터와 상기 B-모드 이미지의 관계로부터 추론된 프로브 조건을 상기 변형 함수를 통해 일반화한 후,상기 RF 데이터로부터 상기 일반화된 정량 특징을 추출하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서,’상기 정량적 초음파 이미지는 음속도(Speed of Sound, SoS), 감쇠 계수(Attenuation Coefficient, AC), 산란체 밀도(Effective ScattererConcentration, ESC), 그리고 산란체 크기(Effective Scatterer Diameter, ESD) 중 적어도 하나의 변수에 대한정량 정보를 포함하는, 동작 방법.공개특허 10-2023-0167953-3-청구항 7 제1항에서,상기 신경망은가상 프로브 조건들로 증강된 훈련 데이터를 이용하여, 입력 RF 데이터의 프로브 도메인을 일반화하도록 훈련된인공지능 모델인, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "적어도 하나의 프로세서에 의해 동작하는 장치의 동작 방법으로서,소스 훈련 데이터를, 가상 프로브 조건들에 관계된 가상 데이터로 증강하는 단계, 그리고데이터 증강된 훈련 데이터를 이용하여, 신경망이 입력 RF 데이터의 프로브 도메인을 일반화하여 정량적 초음파이미지를 생성하도록, 상기 신경망을 훈련시키는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에서,상기 가상 데이터로 증강하는 단계는상기 소스 훈련 데이터에서, 프로브의 센서 수, 센서 간 간격, 그리고 센서 폭 중 적어도 하나를 변경해서 가상의 새로운 데이터를 생성하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에서,상기 신경망을 훈련시키는 단계는상기 데이터 증강된 훈련 데이터를 이용한 메타 학습을 통해, 상기 입력 RF 데이터의 프로브 조건에 해당하는변형 필드(deformation field)를 생성하는 상기 신경망 내 변형 함수를 훈련시키고,상기 변형 함수는 임의 초음파 프로브의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 변형 필드를 생성하는 함수인,동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에서,상기 변형 함수는상기 입력 RF 데이터, 그리고 상기 입력 RF 데이터로부터 생성된 B-모드 이미지의 관계로부터, 상기 입력 RF 데이터의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 상기 변형 필드를 생성하는 메타 학습을 수행하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에서,상기 신경망을 훈련시키는 단계는상기 변형 함수의 메타 학습과 함께, 추론된 정량적 초음파 이미지의 손실을 줄이도록 상기 신경망을 훈련시키는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에서,공개특허 10-2023-0167953-4-상기 신경망은상기 입력 RF 데이터의 프로브 조건을 일반화하는 적응 모듈을 통해, 상기 입력 RF 데이터에서 프로브 도메인에일반화된 정량 특징을 추출하는 인코더, 그리고상기 일반화된 정량 특징을 복원하여 정량적 초음파 이미지를 생성하는 디코더를 포함하는, 동작 방법."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "메모리, 그리고상기 메모리에 로드된 명령어들을 실행하는 프로세서를 포함하고,상기 프로세서는임의 초음파 프로브를 통해 조직에서 수득된 RF 데이터를 입력받고, 훈련된 신경망을 이용하여, 상기 RF 데이터의 프로브 도메인을 일반화하여 정량적 초음파 이미지를 생성하는, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에서,상기 프로세서는프로브 도메인 일반화를 메타 학습한 변형 함수를 이용하여, 상기 RF 데이터로부터 일반화된 정량 특징을 추출하고, 상기 일반화된 정량 특징을 복원하여 상기 정량적 초음파 이미지를 생성하는, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에서,상기 변형 함수는 상기 임의 초음파 프로브의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 변형 필드(deformationfield)를 생성하는 함수인, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제17항에서,상기 프로세서는상기 RF 데이터의 특징에, 상기 변형 함수에 의해 생성된 변형 필드를 적용하여, 상기 일반화된 프로브 조건으로 변형된 특징을 생성하는, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에서, 상기 프로세서는상기 RF 데이터로부터 B-모드 이미지를 생성하고, 상기 RF 데이터와 상기 B-모드 이미지의 관계로부터 추론된 프로브 조건을 상기 변형 함수를 통해 일반화한 후,상기 RF 데이터로부터 상기 일반화된 정량 특징을 추출하는, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에서,상기 정량적 초음파 이미지는 음속도(Speed of Sound, SoS), 감쇠 계수(Attenuation Coefficient, AC), 산란체 밀도(Effective ScattererConcentration, ESC), 그리고 산란체 크기(Effective Scatterer Diameter, ESD) 중 적어도 하나의 변수에 대한공개특허 10-2023-0167953-5-정량 정보를 포함하는, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14항에서,상기 신경망은상기 입력 RF 데이터의 프로브 조건을 일반화하는 적응 모듈을 통해, 상기 입력 RF 데이터에서 프로브 도메인에일반화된 정량 특징을 추출하는 인코더, 그리고상기 일반화된 정량 특징을 복원하여 정량적 초음파 이미지를 생성하는 디코더를 포함하는, 이미징 장치."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "적어도 하나의 프로세서에 의해 동작하는 장치의 동작 방법으로서, 임의 초음파 프로브를 통해 조직에서 수득된 RF 데이터를 입력받는 단계, 상기 RF 데이터로부터, 프로브 도메인에 일반화된 정량 특징을 추출하는 단계, 그리 고 상기 일반화된 정량 특징을 복원하여 정량적 초음파 이미지를 생성하는 단계를 포함한다."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능 기반 정량적 초음파 이미징 기술에 관한 것이다."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "암은 조기 발견이 어려워 주기적인 진단이 필요하고, 병변의 크기 및 특성을 지속적으로 모니터링해야 한다. 이 를 위한 대표적인 영상 장비로는 엑스레이(X-ray), MRI(magnetic resonance imaging), CT(computed tomography), 초음파(ultrasound) 등이 있다. 엑스레이, MRI, CT는 방사능 노출 위험이 있고, 측정 시간이 길 며 비용이 비싼 단점이 있는 반면, 초음파 영상 장비는 안전하고 비교적 저렴하며, 실시간 영상을 제공해서 사 용자가 병변을 실시간으로 모니터링하면서 원하는 이미지를 얻을 수 있다. B-모드(Brightness mode) 초음파 이미징 방법은 초음파가 물체 표면에서 반사되어 돌아오는 시간과 세기를 통해 물체 위치와 크기를 파악하는 방법이다. 이는 실시간으로 병변의 위치를 찾아 주기 때문에, 사용자가 병변을 실 시간으로 모니터링하면서 원하는 영상을 효율적으로 얻을 수 있고, 안전하고 비교적 저렴하여 접근성이 좋다. 하지만, 사용자에 의존적인 정성적 정보만을 제공하기 때문에 조직 특성을 제공하지 못하는 한계가 있다. 이러한 임상적 한계를 극복하기 위해 정량적 초음파 이미징 기술의 필요성이 증가하고 있고, 딥러닝 기술을 통 한 정량 정보 추출 방법이 연구되고 있다. 그러나, 훈련 조건과 실제 조건이 유사해야, 실제 적용 환경에서 훈 련된 신경망의 성능을 기대할 수 있는데, 병원과 같은 실제 적용 환경에서는 훈련 조건과 다른 다양한 형상의 초음파 프로브를 사용하므로, 딥러닝 기술을 통한 정량적 정보 추출 방법의 신뢰성이 보장되지 않는 한계가 있 다."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는, RF 데이터를 수득하는 프로브에 관계없이, 신경망(neural network) 기반으로 정량적 초음파 이미지 를 생성하는, 프로브 적응형 정량적 초음파 이미징 방법 및 장치를 제공한다. 본 개시는, 가상 프로브 조건들에 관계된 증강 데이터를 생성하고, 증강 데이터를 이용한 메타 학습을 통해 프 로브 도메인을 일반화하여 정량적 특징을 추출하는 신경망을 제공한다."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 장치의 동작 방법으로서, 임의 초음파 프로브를 통 해 조직에서 수득된 RF 데이터를 입력받는 단계, 그리고 프로브 도메인을 일반화하도록 훈련된 신경망을 이용하 여, 상기 RF 데이터로부터, 정량적 초음파 이미지를 생성하는 단계를 포함한다. 상기 정량적 초음파 이미지를 생성하는 단계는 프로브 도메인 일반화를 메타 학습한 변형 함수를 이용하여, 상 기 RF 데이터로부터 일반화된 정량 특징을 추출하고, 상기 일반화된 정량 특징을 복원하여 상기 정량적 초음파 이미지를 생성할 수 있다.상기 변형 함수는 상기 임의 초음파 프로브의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 변형 필 드(deformation field)를 생성하는 함수일 수 있다. 상기 정량적 초음파 이미지를 생성하는 단계는 상기 RF 데이터의 특징에, 상기 변형 함수에 의해 생성된 변형 필드를 적용하여, 상기 일반화된 프로브 조건으로 변형된 특징을 생성할 수 있다. 상기 동작 방법은 상기 RF 데이터로부터 B-모드 이미지를 생성하는 단계를 더 포함할 수 있다. 상기 정량적 초 음파 이미지를 생성하는 단계는 상기 RF 데이터와 상기 B-모드 이미지의 관계로부터 추론된 프로브 조건을 상기 변형 함수를 통해 일반화한 후, 상기 RF 데이터로부터 상기 일반화된 정량 특징을 추출할 수 있다. 상기 정량적 초음파 이미지는 음속도(Speed of Sound, SoS), 감쇠 계수(Attenuation Coefficient, AC), 산란체 밀도(Effective Scatterer Concentration, ESC), 그리고 산란체 크기(Effective Scatterer Diameter, ESD) 중 적어도 하나의 변수에 대한 정량 정보를 포함할 수 있다. 상기 신경망은 가상 프로브 조건들로 증강된 훈련 데이터를 이용하여, 입력 RF 데이터의 프로브 도메인을 일반 화하도록 훈련된 인공지능 모델일 수 있다. 한 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 장치의 동작 방법으로서, 소스 훈련 데이터를, 가상 프로브 조건들에 관계된 가상 데이터로 증강하는 단계, 그리고 데이터 증강된 훈련 데이터를 이용하여, 신경망 이 입력 RF 데이터의 프로브 도메인을 일반화하여 정량적 초음파 이미지를 생성하도록, 상기 신경망을 훈련시키 는 단계를 포함한다. 상기 가상 데이터로 증강하는 단계는 상기 소스 훈련 데이터에서, 프로브의 센서 수, 센서 간 간격, 그리고 센 서 폭 중 적어도 하나를 변경해서 가상의 새로운 데이터를 생성할 수 있다. 상기 신경망을 훈련시키는 단계는 상기 데이터 증강된 훈련 데이터를 이용한 메타 학습을 통해, 상기 입력 RF 데이터의 프로브 조건에 해당하는 변형 필드(deformation field)를 생성하는 상기 신경망 내 변형 함수를 훈련 시킬 수 있다. 상기 변형 함수는 임의 초음파 프로브의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 변형 필드를 생성하는 함수일 수 있다. 상기 변형 함수는 상기 입력 RF 데이터, 그리고 상기 입력 RF 데이터로부터 생성된 B-모드 이미지의 관계로부터, 상기 입력 RF 데이터의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 상기 변형 필드를 생성하는 메타 학습을 수행할 수 있다. 상기 신경망을 훈련시키는 단계는 상기 변형 함수의 메타 학습과 함께, 추론된 정량적 초음파 이미지의 손실을 줄이도록 상기 신경망을 훈련시킬 수 있다. 상기 신경망은 상기 입력 RF 데이터의 프로브 조건을 일반화하는 적응 모듈을 통해, 상기 입력 RF 데이터에서 프로브 도메인에 일반화된 정량 특징을 추출하는 인코더, 그리고 상기 일반화된 정량 특징을 복원하여 정량적 초음파 이미지를 생성하는 디코더를 포함할 수 있다. 한 실시예에 따른 이미징 장치로서, 메모리, 그리고 상기 메모리에 로드된 명령어들을 실행하는 프로세서를 포 함하고, 상기 프로세서는 임의 초음파 프로브를 통해 조직에서 수득된 RF 데이터를 입력받고, 훈련된 신경망을 이용하여, 상기 RF 데이터의 프로브 도메인을 일반화하여 정량적 초음파 이미지를 생성할 수 있다. 상기 프로세서는 프로브 도메인 일반화를 메타 학습한 변형 함수를 이용하여, 상기 RF 데이터로부터 일반화된 정량 특징을 추출하고, 상기 일반화된 정량 특징을 복원하여 상기 정량적 초음파 이미지를 생성할 수 있다. 상기 변형 함수는 상기 임의 초음파 프로브의 프로브 조건을 일반화된 프로브 조건으로 공간 변환하는 변형 필 드(deformation field)를 생성하는 함수일 수 있다. 상기 프로세서는 상기 RF 데이터의 특징에, 상기 변형 함수에 의해 생성된 변형 필드를 적용하여, 상기 일반화 된 프로브 조건으로 변형된 특징을 생성할 수 있다. 상기 프로세서는 상기 RF 데이터로부터 B-모드 이미지를 생성하고, 상기 RF 데이터와 상기 B-모드 이미지의 관 계로부터 추론된 프로브 조건을 상기 변형 함수를 통해 일반화한 후, 상기 RF 데이터로부터 상기 일반화된 정량 특징을 추출할 수 있다. 상기 정량적 초음파 이미지는 음속도(Speed of Sound, SoS), 감쇠 계수(Attenuation Coefficient, AC), 산란체 밀도(Effective Scatterer Concentration, ESC), 그리고 산란체 크기(Effective Scatterer Diameter, ESD) 중적어도 하나의 변수에 대한 정량 정보를 포함할 수 있다. 상기 신경망은 상기 입력 RF 데이터의 프로브 조건을 일반화하는 적응 모듈을 통해, 상기 입력 RF 데이터에서 프로브 도메인에 일반화된 정량 특징을 추출하는 인코더, 그리고 상기 일반화된 정량 특징을 복원하여 정량적 초음파 이미지를 생성하는 디코더를 포함할 수 있다."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따르면, 실제 적용 환경에서 다양한 종류의 프로브를 사용하더라도, 프로브 조건에 관계없이 일관성 있는 정량적 초음파 이미지를 생성할 수 있다. 따라서, 실시예에 따르면, 초음파 기반의 진단 기술 분야에서, 인공지능 기반으로 추출된 감쇠 계수 등의 정량 정보에 대한 임상적 활용성을 높일 수 있다. 실시예에 따르면, 훈련 과정에서 보지 않은 프로브 조건에 대해서 사용 가능하도록, 정량적 초음파 이미지를 생 성하는 신경망을 도메인 일반화(Domain generalization)할 수 있다. 실시예에 따르면, 다양한 종류의 B-모드 이미징용 초음파 프로브 및 영상 기기를 그대로 이용하여 정량적 초음 파 이미지를 생성할 수 있다."}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재 된 \"…부\", \"…기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드 웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 본 개시의 장치는 적어도 하나의 프로세서가 명령어들(instructions)을 실행함으로써, 본 개시의 동작을 수행할 수 있도록 구성 및 연결된 컴퓨팅 장치이다. 컴퓨터 프로그램은 프로세서가 본 개시의 동작을 실행하도록 기술 된 명령어들(instructions)을 포함하고, 비일시적-컴퓨터 판독가능 저장매체(non-transitory computer readable storage medium)에 저장될 수 있다. 컴퓨터 프로그램은 네트워크를 통해 다운로드되거나, 제품 형태로판매될 수 있다. 본 개시의 신경망(neural network)은 적어도 하나의 태스크를 학습하는 인공지능 모델(Artificial Intelligence model, AI model)로서, 컴퓨팅 장치에서 실행되는 소프트웨어/컴퓨터 프로그램으로 구현될 수 있 다. 신경망은 통신 네트워크를 통해 다운로드되거나, 제품 형태로 판매될 수 있다. 또는 신경망은 통신 네트워 크를 통해 다양한 장치들과 연동할 수 있다. 본 개시에서, 도메인 일반화(generalization)는 데이터가 수집된 도메인 특성에 영향받지 않도록 처리하여 어느 도메인에서 수집된 데이터인지를 구분할 수 없도록 만드는 것을 의미하고, 본 개시에서 도메인은 데이터를 수득 하는 프로브 도메인일 수 있다. 도 1은 한 실시예에 따른 정량적 초음파 이미징 장치를 개념적으로 설명하는 도면이다. 도 1을 참고하면, 정량적 초음파 이미징 장치(간단히, ‘이미징 장치’라고 함)는 적어도 하나의 프로세서 에 의해 동작하는 컴퓨팅 장치로서, 본 개시에서 설명하는 동작을 위한 컴퓨터 프로그램을 탑재하고, 컴퓨터 프 로그램은 프로세서에 의해 실행된다. 이미징 장치에 탑재된 신경망은 적어도 하나의 태스크를 학습할 수 있는 인공지능 모델로서, 컴퓨팅 장치에서 실행되는 소프트웨어/프로그램으로 구현될 수 있다. 이미징 장치는 초음파 프로브를 통해 조직에서 수득된 RF 데이터(Radio Frequency)를 입력받고, 신경 망을 이용하여 조직의 정량 정보를 추출한다. 조직의 정량 정보는 정량적 초음파 이미지로 표현될 수 있다. 정량적 초음파 이미지는 간단히 정량적 이미지라고 부를 수 있다. 정량적 이미지는 조직의 정량적 변수들 인 감쇠 계수(Attenuation Coefficient, AC), 음속도(Speed of Sound, SoS), 조직 내 밀도 분포를 나타내는 산 란체 밀도(Effective Scatterer Concentration, ESC), 조직 내 세포 등의 크기를 나타내는 산란체 크기 (Effective Scatterer Diameter, ESD) 중 적어도 하나의 변수에 대한 정량 정보를 포함하는 이미지일 수 있다. 설명에서는, 감쇠 계수 이미지를 정량적 이미지의 예로 사용할 수 있다. 이미징 장치에 탑재된 신경망은 별도의 훈련 장치에 의해 훈련된 후 탑재될 수 있는데, 설명의 편의 를 위해, 이미징 장치가 훈련 데이터를 생성하고, 훈련 데이터를 기초로 신경망을 훈련시킨다고 설명 할 수 있다. 이미징 장치의 구현 형태는 다양할 수 있다. 예를 들면, 이미징 장치는 영상 촬영 장치에 탑재될 수 있다. 또는, 이미징 장치는 적어도 하나의 영상 촬영 장치와 연동하는 서버 장치로 구축될 수 있다. 이미 징 장치는 특정 의료 기관 내 통신 네트워크에 연결된 로컬 서버이거나, 접근 권한을 가진 다수의 의료 기 관들의 장치들과 연동하는 클라우드 서버일 수 있다. 초음파 프로브는 서로 다른 빔패턴들(Tx pattern #1~ #k)의 초음파 신호를 조직에 순차적으로 방사하고, 조 직에서 반사되어 되돌아온 RF 데이터를 획득할 수 있다. 복수의 빔 패턴들로부터 수득된 RF 데이터를 펄스-에코 데이터(pulse-echo data), 또는 빔포밍 초음파 데이터(beamformed ultrasound data)라고도 부를 수 있다. RF 데이터는 예를 들면, 7개의 서로 다른 입사각들(θ1~θ7)을 갖는 평면파로부터 획득될 수 있다. 입사각은 예를 들면, -15°, -10°, -5°, 0°, 5°, 10°, 15°로 설정될 수 있다. 초음파 프로브는 일정 간격으로 배열 된 N개의 센서 소자들(sensor elements)로 구성된다. 센서 소자들은 압전 소자들(piezoelectric elements)로 구현될 수 있다. 한편, RF 데이터를 수득하는 초음파 프로브는 다양한 제조 업체들에 의해 제작될 수 있고, 다양한 프로브 조건 을 가질 수 있다. 여기서, 프로브 조건은 센서 수, 센서 간 간격(pitch), 센서 폭(width) 등의 센서 형상 (sensor geometry)에 따라 달라질 수 있다. 신경망 훈련 모든 초음파 프로브에서 수득된 RF 데이터를 사용하기 어려우므로, 임상 현장에서 사용하는 초음파 프로브는 신경망 훈련에 사용된 것과 다르기 마련이다. 결국, 병원 과 같은 실제 임상 환경에서는, RF 데이터를 수득하는 초음파 프로브의 비유사성에 의해 신경망의 기대 성능이 제공되지 못할 수 있다. 보지 않는 프로브 조건(unseen probe condition)에서의 성능 저하를 해결하기 위해, 신경망은 RF 데이터를 수득한 프로브 도메인을 일반화하여 정량 특징을 추출하고, 일반화된 정량 특징을 복원하여 정량적 이미지를 생 성하는 네트워크 구조를 가진다. 신경망은 입력 RF 데이터의 프로브 조건을 일반화된 프로브 조건으로 공 간 변환하기 위한 변형 필드(deformation field)를 찾고, 변형 필드를 이용하여 입력 RF 데이터를 캘리브레이션 한 후, 정량 특징을 추출할 수 있다. 신경망은 다양한 프로브 조건들의 데이터셋을 이용한 학습을 통해, 다양한 프로브 조건(센서 수, 센서 간 간격, 센서 폭 등)에 따라 달라지는 프로브 구조에 대한 일반화를 할 수 있다. 이때, 신경망은 소스 데이 터셋으로부터 다양하고 새로운 가상 프로브 조건들을 생성하고, 가상 프로브 조건들로 증강된 데이터를 기초로, 도메인 일반화를 위한 학습을 할 수 있다. 다양하고 새로운 프로브 조건들로 증강된 데이터셋을 통해, 프로브 일반화 성능을 높일 수 있다. 여기서, 신경망은 증강 데이터를 이용한 메타 학습(meta-learning)을 통해, 프로브 조건을 위한 변형 필드를 생성하는 변형 함수를 학습할 수 있다. 프로브 조건은 RF 데이터와, RF 데이터 로부터 생성된 B-모드 이미지 사이의 관계로부터 추론될 수 있다. 따라서, 신경망은 RF 데이터와 함께, B- 모드 이미지를 이용하여, 프로브 조건에 해당하는 변형 필드를 추출하는 네트워크 구조를 가질 수 있다. 도 2는 한 실시예에 따른 신경망의 개념도이다. 도 2를 참고하면, 신경망은 초음파 프로브 Gi에 의해 수득된 RF 데이터를 입력받고, RF 데이터 xjGi의 정량 정보를 복원하여 정량적 초음파 이미지를 출력한다. RF 데이터는, 초음파 프로브가 서로 다른 빔패턴들의 초음파 신호를 조직에 순차적으로 방사해서 수득한 데이터이다. RF 데이터는, 예를 들면, 7개 의 서로 다른 빔패턴들(θ1~θ7)에서 수득한 RF 데이터(U1~U7)일 수 있고, 초음파 프로브의 센서들에서 시간 인 덱스들에 수신한 정보를 포함한다. 이때, 동일한 조직이라고 하더라도 프로브 조건 Gi에 따라 RF 데이터가 다를 수 있으므로, 신경망은 프로브 도메인 일반화를 통해, 프로브에 관계없이 일관된 정량 정보를 복원한다. 신경망은 프로브 조건 Gi에서 수득된 RF 데이터에서 정량 특징(quantitative features) q를 추출하는 인코더(encoder), 정량 특징 q를 복원하여 정량적 이미지 Iq생성하는 디코더(decoder)를 포함할 수 있다. 이때, 신경망은 RF 데이터로부터 B-모드 이미지를 생성하는 B-모드 생성기(B-mode generator)를 더 포함할 수 있다. B-모드 생성기는 RF 데이터에 지연-합(Delay and Sum, DAS) 및 시간 이득 보상(time gain compensation, TGC)을 적용하여, B-모드 이미지를 생성할 수 있다. 인코더는 컨볼루션 기반으로 RF 데이터에서 정량 특징 q를 추출하도록 훈련된 네트워크로서, 임의 프 로브 조건에서 수득된 RF 데이터를 일반화된 프로브 조건으로 변환함으로써, 일반화된 정량 특징 q를 추출 한다. 이를 위해, 인코더는 입력 프로브 조건에 해당하는 변형 필드(deformation field)를 찾고, 변형 필 드를 이용하여 입력 데이터를 캘리브레이션한 후, 프로브에 무관하게 일반화된 정량 특징을 추출할 수 있다. 프 로브 조건은 RF 데이터와, RF 데이터로부터 생성된 B-모드 이미지 사이의 관계로부터 추론될 수 있다. 따라서, 인코더는 B-모드 생성기에서 출력된 B-모드 이미지를 입력받고, RF 데이터와 B-모드 이미지의 관계를 이용하여, 프로브 조건에 해당하는 변형 필드를 추론할 수 있다. 디코더는 인코더에서 출력된 정량 특징 q를 고해상도 정량적 이미지로 변환한다. 디코더는 다양한 네트워크 구조를 가질 수 있고, 예를 들면, 고해상도 네트워크(High-Resolution Network, HRNet) 기반의 병렬적 다중 해상도 서브네트워크들(parallel multi-resolution subnetworks)을 이용하여, 고해상도의 정량적 이미지를 생성할 수 있다. 도 3은 한 실시예에 따른 인코더의 네트워크 구조이고, 도 4는 한 실시예에 따른 적응 모듈의 예시이고, 도 5는 한 실시예에 따른 디코더의 네트워크 구조이다. 도 3을 참고하면, 인코더는 다양한 프로브 조건들 중 임의 프로브 조건에에 관계된 RF 데이터를 입력 받고, 일반화된 정량 특징 q를 추출하는 다양한 네트워크 구조를 가질 수 있다. 예를 들면, 인코더는 RF 데이터(U1, U2, …, U7)를 입력받아 개별적으로 특징을 추출하는 컨볼루션 기반의 개별 인코딩 레이어, 개별 인코딩 레이어에서 추출된 특징들을 연결하여 인코딩하는 컨볼루션 기반의 복수의 인코딩 레이어들(212, 213, 214, 215)를 포함할 수 있다. 개별 인코딩 레이어는 3X3 커널 크기의 컨볼루션, 활성함수(ReLU), ReLU, 1x2 스트라이드 다운 샘플링을 수행하도록 구성될 수 있다. 복수의 인코딩 레이어들(212, 213, 214, 215)은 순차적으로 연결되고, 입력 특징을 압축하여 최종적으로 압축된 정량 특징 q를 출력할 수 있다. 정량 특징 q는 공간 해상도 R16X16X512로 표현될 수 있다. 한편, 인코더는 다양한 프로브 조건에서 수득될 수 있는 RF 데이터를, 일반화된 프로브 조건에서 수득된 RF 데이터로 변환하기 위한, 적응 모듈(adaptation module)을 포함한다. 적응 모듈은 프로브 조건 Gi 에서 수득된 RF 데이터를, 일반화된 프로브 조건에서 수득된 RF 데이터로 캘리브레이션함으로써, 입력 데이터에대한 프로브 도메인 일반화를 할 수 있다. 적응 모듈은 이전 인코딩 레이어에서 출력된 입력 특징과 B-모 드 이미지의 관계를 이용하여, 일반화된 특징을 출력할 수 있다. 적응 모듈은 복수의 인코딩 레이어들(212, 213, 214, 215) 중 적어도 하나의 레이어 다음에 배치될 수 있 다. 적응 모듈은 변형 가능한 센서 적응(deformable sensor adaptation, DSA) 모듈이라고 부를 수 있다. 도 4를 참고하면, 적응 모듈은 이전 인코딩 레이어에서 인코딩된 RF 데이터 의 특징 과 함께, B-모드 이미지 를 입력받을 수 있다. 적응 모듈은 RF 데이터의 특징과 B-모드 이미지의 관계로부터 변형 필드 를 생성하는 변형 함수 모듈, 그리고, 변형 필드를 이용하여 입력된 특징을 공 간 변환하는 공간 변환 모듈을 포함할 수 있다. 변형 필드는 프로브 조건 Gi를 일반화된 프로브 조건으로 공간 변환하기 위한 워핑(warping) 정보를 포함한다. 변형 함수 모듈은 프로브 조건 Gi의 일반화를 위한 변형 필드 를 생성하는 변형 함수 f(:)를 포함한 다. 변형 함수 f(:)는 가상 프로브 조건들로 증강된 데이터를 이용한 메타 학습을 통해, 프로브 조건 Gi와 일반 화된 프로브 조건의 구조 차이에 따른 변형 필드를 생성할 수 있다. 변형 함수 f(:)는 그래디언트(gradient) 기 반 메타 학습을 할 수 있다. 변형 필드 는 수학식 1과 같이 정의될 수 있다. 수학식 1에서, 는 개별 프로브 조건 Gi를 더 잘 추론할 수 있도록 만드는데 기여할 수 있다. 수학식 1"}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "공간 변환 모듈은 이전 인코딩 레이어로부터 입력된 특징을, 변형 필드 를 통해 워핑하여 변형 특징 을 출력할 수 있다. 변형 특징은 프로브 조건에 무관하게 일반화된 특징이다. 도 5를 참고하면, 디코더는 인코더에서 출력된 정량 특징 q를 입력받고, 정량 특징 q를 점진적으로 합성하여 고해상도 정량적 이미지를 출력할 수 있다. 디코더는 고해상도 네트워크(High-Resolution Network, HRNet) 기반의 병렬적 다중 해상도 서브네트워크들(parallel multi-resolution subnetworks)을 이용 하여, 고해상도의 정량적 이미지를 생성할 수 있다. 서브네트워크는 예를 들면, 적어도 하나의 잔차 컨볼루션 블록(residual convolution block)을 포함할 수 있다. 디코더의 각 병렬 네트워크에서 해당 해상도 이미지, 예를 들면, Iq, 16X16, Iq, 32X32, Iq, 64X64, Iq, 128X128를 생 성하고, 이들을 컨볼루션하여 정량적 이미지 Iq를 최종적으로 출력할 수 있다. 도 6은 한 실시예에 따른 가상 프로브 조건들에 관계된 데이터 증강을 설명하는 도면이고, 도 7은 한 실시예에 따른 변형 함수 훈련 방법을 설명하는 도면이고, 도 8은 한 실시예에 따른 신경망 훈련 방법을 설명하는 도면이 다. 도 6을 참고하면, 데이터셋은 다양하게 획득될 수 있다. 예를 들면, 소스 훈련 데이터는 시뮬레이션 팬텀을 통 해 얻은 RF 데이터로 구성될 수 있고, 초음파 시뮬레이션 툴(예를 들면, Matlab의 k-wave toolbox)을 이용하여 수집될 수 있다. 예를 들면, 시뮬레이션 팬텀에, 반지름이 2-30mm인 타원을 50x50mm 배경의 임의의 위치에 0~10 개를 배치하여 장기와 병변 yi를 표현할 수 있다. 다양한 프로브 조건들에 대한 훈련을 위해, 소스 훈련 데이터를 증강시킨 가상 훈련 데이터가 사용된다. 이를 위한 데이터 증강 알고리즘은 다양할 수 있다. 예를 들면, 데이터 증강 알고리즘은 소스 훈련 데이터 D를 기초 로, 가상 프로브 조건에서 측정된 가상 훈련 데이터인 RF 데이터 를 생성할 수 있다. 증강 데이터를 통해,신경망은 광범위한 프로브 조건의 범위와 보지 않은 센서 형상에 더 잘 적응하도록 훈련될 수 있다. 데이터 증강 알고리즘은 하이퍼 파라미터들(hyper-parameters)인 하위 샘플(sub-sample)(αss) 및 하위 너비 (sub-width)(αsw)를 이용하여, 가상 프로브별 가상 센서 수 및 센서 너비 등을 조정함으로써, 다양하고 새로운 가상 프로브 데이터셋을 생성할 수 있다. 데이터 증강 알고리즘은, 표 1과 같이, 하위 샘플(αss) 및 하위 너비(αsw) 파라미터들을 균일 분포에서 무작위 생성하고, 무작위로 생성된 프로브 조건들을 이용하여, 소스 훈련 데이터 로부터 증강된 가상 훈련 데이터 를 생성할 수 있다. 표 1"}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 7을 참고하면, 신경망의 변형 함수 f(:)는 가상 프로브 조건들로 증강된 데이터를 이용하여 프로브 조 건 Gi에 해당하는 변형 필드 를 생성하는 메타 학습을 할 수 있다. 이때, 변형 함수 f(:)는 서로 다른 프 로브 조건 Gp 및 Gl의 RF 데이터에 대한 변형 필드를 생성하고, 각 변형 필드를 이용해 보정된 두 변형 특징 간 의 유클리디안 거리(Euclidian distance)를 최소화하는 훈련을 할 수 있다. 이를 메타 학습 공간 변형(meta- learned spatial deformation, MLSD)라고 부를 수 있다. 이를 통해, 신경망으로 입력된 RF 데이터가 다양한 프로브 조건들에서 수득되더라도, 일반화된 프로브 조 건에서 수득된 RF 데이터로 공간 변형한 후, 정량 특징을 추출할 수 있다. 따라서, 신경망은 실제 임상 환 경에서 다양한 종류의 프로브를 사용하더라도, 프로브 조건에 관계없이 일관성 있는 정량적 초음파 이미지를 생 성할 수 있다. 데이터 기반 접근 방식은 훈련 조건에 과적합될 수 있으므로, 보지 않은 적용 조건에 대한 성능이 떨어질 수 있 다. 이를 해결하기 위해, 메타 학습을 통해 보지 않은 조건에 대한 신경망의 도메인 일반화를 할 수 있다. 즉, 메타 학습을 통해, 변형 함수를 최적화하여, 적응 모듈의 일반화 성능(generalizability)을 향상시킬 수 있다. 도 8과 표 2를 참고하면, 인코더와 디코더로 구성된 신경망은 메타 학습을 통해 인코더 내 부의 변형 함수 f(:)를 최적화할 수 있다. 구체적으로, 훈련 장치(미도시)는, 데이터 D를 메타 훈련 데이터 와 메타 테스트 데이터 로 할당한 후, 메타 훈련 데이터로 변형 함수를 훈련시킴으로써, 변형 함수가 메타 테스트 데이터에 일반화되도록 만든다. 각 반복 (iteration)에서, 변형 함수 f는 손실(loss 1)을 최소화하는 f’으로 업데이트된다. 훈련 장치는, 훈련을 반복 하여, 적응 모듈이 데이터에 대한 편향 없이, 보지 않는 프로브 조건을 적절하게 공간 변형하여 입력 특징 을 보정하도록 만든다.변형 함수 f의 메타 학습과 함께, 신경망은 출력 θ에 대한 손실(loss2)을 최소화하는 훈련을 할 수 있다. 표 2"}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "변형 함수 f를 위한 목적 함수 f*은 수학식 2와 같이 정의될 수 있다. 수학식 2에서, 은 메타 훈련 데이터 를 변형 함수 f를 통해 변형한 특징 사이의 유클리디안 거리이다. 은 메타 훈련 데이터 와 메타 테스트 데이터 를 업데이트된 변형 함수 f’을 통해 변경한 특징 사이의 유클리디 안 거리를 나타낸다. 즉, f*은 데이터에 대한 변형 특징 사이의 유클리디안 거리를 최소화하도록 만드는 목적 함수이다. 수학식 2"}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "신경망의 목적 함수 θ*는 수학식 3과 같이 정의될 수 있다. 디코더의 각 병렬 네트워크의 목적 함수 θR이 해당 해상도 이미지 yR을 점진적으로 생성하기 위해 정규화되는 동안, θ*은 정답값 y와 출력 θ(x) 사이 의 손실을 최소화하도록 만드는 목적 함수이다. 정답 y는 정답값(ground truth) 정량적 이미지이고, 출력 θ (x)는 입력 RF 데이터(x)로부터 재구성된 정량적 이미지이다. 수학식 3"}
{"patent_id": "10-2022-0068239", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 6, "content": "도 9는 한 실시예에 따른 신경망 훈련 방법의 흐름도이다. 도 9를 참고하면, 이미징 장치는 소스 훈련 데이터를, 가상 프로브 조건들에 관계된 가상 데이터로 증강시 킨다(S110). 소스 훈련 데이터는 시뮬레이션 팬텀을 통해 얻은 수 있다. 이미징 장치는 소스 데이터셋으로 부터, 센서 수, 센서 간 간격, 센서 폭 등이 조정된 다양하고 새로운 가상 프로브 조건들의 가상 데이터셋을 생 성할 수 있다. 이미징 장치는 데이터 증강된 훈련 데이터를 이용하여, 신경망이 입력 RF 데이터로부터 프로브 도메 인에 일반화된 정량 특징을 추출하고, 일반화된 정량 특징을 복원하여 정량적 초음파 이미지를 생성하도록, 신 경망을 훈련시킨다(S120). 신경망은 RF 데이터에서 프로브 도메인에 일반화된 정량 특징을 추출하는 인코더, 정량 특징을 복원 하여 정량적 초음파 이미지를 생성하는 디코더를 포함하고, 인코더는 입력 RF 데이터 및 B-모드 이미 지를 기초로 프로브 조건의 변형을 위한 변형 필드를 생성하고, 변형 필드를 이용하여 RF 데이터에 포함된 정량 특징을 일반화하는 적응 모듈을 포함할 수 있다. 적응 모듈은 변형 가능한 센서 적응(deformable sensor adaptation, DSA) 모듈이라고 부를 수 있다. 이미징 장치는 데이터 증강된 훈련 데이터를 이용한 메타 학습(meta-learning)을 통해, 프로브 조건에 해 당하는 변형 필드를 생성하는 변형 함수를 훈련시킬 수 있다. 이미징 장치는, 변형 함수로 변형된 특징 간 의 차이가 최소화되도록 변형 함수를 훈련시킬 수 있다. 이미징 장치는, 신경망이 입력 RF 데이터와 함께 B-모드 이미지를 이용하여, 프로브 조건을 추론하고, 이를 이용하여 변형 함수를 훈련시킬 수 있다. 이미 징 장치는 변형 함수의 메타 학습과 함께, 추론된 정량적 초음파 이미지의 손실을 줄이도록 신경망을 최적화 훈련시킬 수 있다. 도 10은 한 실시예에 따른 프로브 적응형 정량적 초음파 이미징 방법의 흐름도이다. 도 10을 참고하면, 이미징 장치는 임의 초음파 프로브를 통해 조직에서 수득된 RF 데이터를 입력받는다 (S210). RF 데이터는 임의 초음파 프로브에서 서로 다른 빔패턴으로 조직에 방사된 초음파 신호에 대한 펄스-에 코 데이터이다. 임의 초음파 프로브는 신경망의 훈련에 사용되지 않은 센서 형상을 가질 수 있다. 이미징 장치는 훈련된 신경망을 이용하여, RF 데이터로부터, 프로브 도메인에 일반화된 정량 특징을 추출한다(S220). 신경망은 RF 데이터 및 B-모드 이미지를 기초로 임의 프로브를 일반화하는 변형 필드를 생성하는 변형 함수를 포함할 수 있다. 이미징 장치는 프로브 도메인 일반화를 메타 학습한 변형 함수를 이용하여, RF 데이터의 변형 필드를 생성할 수 있다. 이미징 장치는 RF 데이터로부터 B-모드 이미지를 생 성하고, 변형 함수를 통해, RF 데이터와 B-모드 이미지의 관계로부터 추론된 프로브 조건을 일반 프로브 조건으 로 공간 변형할 수 있다. 이미징 장치는 훈련된 신경망을 이용하여, 일반화된 정량 특징을 복원하여 정량적 이미지를 생성한다 (S230). 도 11은 정량적 이미징 결과를 나타내는 도면이고, 도 12는 정량 정보의 일관성을 비교한 그래프이다. 도 11을 참고하면, 센서 형상이 다른 프로브 A 및 프로브 B로 생체 내 유방 측정하고, 측정된 RF 데이터를 이용 한 정량적 이미징 결과를 비교해 본다. (a)는 프로브 A 및 프로브 B로 측정한 RF 데이터에 대해, 비교 대상 모델이 생성한 감쇠 계수 이미지이다. (b) 는 프로브 A 및 프로브 B로 측정한 RF 데이터에 대해, 본 개시의 이미징 장치가 생성한 감쇠 계수 이미지 이다. 감쇠 계수 이미지를 비교한 결과, 이미징 장치는 프로브에 관계없이 일관된 정량적 이미지를 생성할 수 있음을 알 수 있고, 보지 않는 프로브에 대해 일반화가 잘 되어 있음을 알 수 있다. 특히, 이미징 장치(10 0)는 병변의 모양과 감쇠 계수 값을 더 잘 식별할 수 있음을 알 수 있다. 도 12를 참고하면, 프로브 A와 프로브 B로 측정된 유방 병변의 재구성된 감쇠 계수 차이를 비교해 본다. (a)는 비교 대상 모델에서, 프로브 A와 프로브 B로 측정된 RF 데이터로부터 재구성한 유방 병변의 감쇠 계수 차 이이다. (b)는 본 개시의 이미징 장치에서, 프로브 A와 프로브 B로 측정된 RF 데이터로부터 재구성한 유방 병변의 감쇠 계수 차이이다. 비교 대상 모델은 프로브 조건에 의존하여 감쇠 계수를 복원하는 것을 알 수 있다. 반면, 본 개시의 이미징 장 치는 프로브에 관계없이 일관된 정량 정보를 복원할 수 있음을 알 수 있다. 따라서, 이미징 장치는 다양한 제조사의 프로브에 상관없이 유방암을 식별할 수 있다. 도 13은 한 실시예에 따른 컴퓨팅 장치의 구성도이다. 도 10을 참고하면, 이미징 장치는 적어도 하나의 프로세서에 의해 동작하는 컴퓨팅 장치일 수 있고, 초음파 프로브 또는 초음파 프로브에서 획득된 데이터를 제공하는 장치와 연결될 수 있다.컴퓨팅 장치는 하나 이상의 프로세서, 프로세서에 의하여 실행되는 프로그램을 로드하는 메모리 , 프로그램 및 각종 데이터를 저장하는 스토리지, 통신 인터페이스, 그리고 이들을 연결하는 버 스를 포함할 수 있다. 이외에도, 컴퓨팅 장치는 다양한 구성 요소가 더 포함될 수 있다. 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 개시의 다양한 실시예에 따른 방법/동작을 수행하도록 하 는 명령어들(instruction)을 포함할 수 있다. 즉, 프로세서는 명령어들을 실행함으로써, 본 개시의 다양한 실시예에 따른 방법/동작들을 수행할 수 있다. 명령어는 기능을 기준으로 묶인 일련의 컴퓨터 판독가능 명령어 들로서 컴퓨터 프로그램의 구성 요소이자 프로세서에 의해 실행되는 것을 가리킨다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 또 한, 프로세서는 본 개시의 다양한 실시예들에 따른 방법/동작을 실행하기 위한 적어도 하나의 애플리케이 션 또는 프로그램에 대한 연산을 수행할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 다양한 실시예들에 따른 방법/동작을 실행하기 위하여 스토리지로부터 하나 이상의 프로그램을 로드할 수 있다. 메모리는 RAM 과 같은 휘발성 메모리로 구현될 수 있을 것이나, 본 개시의 기술적 범위는 이에 한정되지 않는다. 스토리지는 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 통신을 지원한다. 이를 위해, 통신 인터페이스는 본 개시의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한 다. 버스는 주소 버스(Address Bus), 데이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 이와 같이, 실시예에 따르면, 실제 적용 환경에서 다양한 종류의 프로브를 사용하더라도, 프로브 조건에 관계없 이 일관성 있는 정량적 초음파 이미지를 생성할 수 있다. 따라서, 실시예에 따르면, 초음파 기반의 진단 기술 분야에서, 인공지능 기반으로 추출된 정량적 정보의 임상적 활용성을 높일 수 있다. 실시예에 따르면, 훈련 과정에서 보지 않은 프로브 조건에 대해서 사용 가능하도록, 정량적 초음파 이미지를 생 성하는 신경망을 도메인 일반화할 수 있다. 실시예에 따르면, 다양한 종류의 B-모드 이미징용 초음파 프로브 및 영상 기기를 그대로 이용하여 정량적 초음 파 이미지를 생성할 수 있다. 이상에서 설명한 본 개시의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 개시의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 개시의 실시예에 대하여 상세하게 설명하였지만 본 개시의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 개시의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 개시의 권리범위에 속하는 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13"}
{"patent_id": "10-2022-0068239", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 정량적 초음파 이미징 장치를 개념적으로 설명하는 도면이다. 도 2는 한 실시예에 따른 신경망의 개념도이다. 도 3은 한 실시예에 따른 인코더의 네트워크 구조이다. 도 4는 한 실시예에 따른 적응 모듈의 예시이다. 도 5는 한 실시예에 따른 디코더의 네트워크 구조이다. 도 6은 한 실시예에 따른 가상 프로브 조건들에 관계된 데이터 증강을 설명하는 도면이다. 도 7은 한 실시예에 따른 변형 함수 훈련 방법을 설명하는 도면이다. 도 8은 한 실시예에 따른 신경망 훈련 방법을 설명하는 도면이다. 도 9는 한 실시예에 따른 신경망 훈련 방법의 흐름도이다. 도 10은 한 실시예에 따른 프로브 적응형 정량적 초음파 이미징 방법의 흐름도이다. 도 11은 정량적 이미징 결과를 나타내는 도면이다. 도 12는 정량 정보의 일관성을 비교한 그래프이다. 도 13은 한 실시예에 따른 컴퓨팅 장치의 구성도이다."}
