{"patent_id": "10-2023-0065788", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0168137", "출원번호": "10-2023-0065788", "발명의 명칭": "모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템", "출원인": "백지원", "발명자": "백지원"}}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모바일 디스플레이와 GPS가 배치된 차량; 및상기 차량이 위치되는 장소를 게임 맵(game map)으로 설정하고, GPS를 통한 상기 차량의 위치정보를 기반으로상기 차량을 게임 유저(user)로 인식하여 게임 환경을 제공하며, 상기 차량과 무선 네트워크 환경으로 연결되어상기 모바일 디스플레이로 게임 상황을 전송하는 서버를 포함하는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 차량은,도로를 주행하거나 주/정차하는 동안 아이템, 재화 및 경험치 중 적어도 어느 하나를 획득하는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 아이템, 상기 재화 및 상기 경험치는 상기 차량이 주행하는 장소, 유저의 운전 방법 및 유저의 교통 법규준수 여부 중 적어도 어느 하나에 따라 달라지는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 게임 유저 간 획득한 아이템 거래가 가능한 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2 항에 있어서,상기 차량은,상기 아이템, 상기 재화 및 상기 경험치 중 적어도 어느 하나를 구매할 수 있는 상점 이용이 가능한 모빌리티와융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 게임 유저는 길드 가입이 가능하고,상기 게임 유저 간 및 상기 길드 간 전투가 가능한 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서,상기 게임 유저 간 의사 전달이 가능한 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템."}
{"patent_id": "10-2023-0065788", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항 내지 제7 항 중 어느 한 항에 있어서,공개특허 10-2024-0168137-3-상기 차량에는 카메라 모듈이 더 배치되며,상기 서버는 상기 카메라 모듈을 통해 취득된 영상을 게임 그래픽과 결합하여 상기 모바일 디스플레이로 전송하는 모빌리티와 융합된 위치정보 기반 MMORPG 시스템."}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 차량, 모바일 디스플레이, GPS 기술, 게임 기술 및 무선 네트워크 기술 등 다양한 분야의 기술을 접목 시킨 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템에 관한 것으로서, 보다 상세하게는, 모바일 디스플레 이와 GPS가 배치된 차량; 및 상기 차량이 위치되는 장소를 게임 맵(game map)으로 설정하고, GPS를 통한 상기 차 량의 위치정보를 기반으로 상기 차량을 게임 유저(user)로 인식하여 게임 환경을 제공하며, 상기 차량과 무선 네 트워크 환경으로 연결되어 상기 모바일 디스플레이로 게임 상황을 전송하는 서버를 포함하는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템에 관한 것이다."}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템에 관한 것으로서, 특히 차량, 모바일 디스플레 이, GPS 기술, 게임 기술 및 무선 네트워크 기술 등 다양한 분야의 기술을 접목시킨 모빌리티와 융합된 위치정 보 기반 MMORPG 게임 시스템에 관한 것이다."}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "\"모빌리티\"는 \"Mobility\"라는 영어 단어에서 유래한 것으로, 일반적으로는 사람 또는 물건의 이동성과 관련된 기술, 서비스 및 시스템 등을 의미한다. 최근에는 스마트 모빌리티와 같이 인공지능, 빅데이터 등 첨단 기술을 접목하여 더욱 발전하고 있으며, 특히 자율주행 자동차, 전기차 및 공유 모빌리티 등의 기술이 발전하면서 모빌 리티 분야에서는 많은 혁신적인 시도들이 이루어지고 있다. 또한, 최근 모빌리티 기술이 발전하면서 기존에 이동을 위한 제한적인 경험만을 제공했던 모빌리티 공간이 새로 운 라이프스타일 경험을 제공할 수 있는 가능성이 부상하고 있다. 한편, 자율주행 기술이 발전함에 따라 그동안 모빌리티 공간을 다른 용도로 활용하는 데 가장 큰 장애가 되었던 운전자의 주행 의무 역시 점진적으로 약화될 것으로 보인다. 이러한 배경에서, 운전자에게 새로운 경험과 즐거움을 제공함과 동시에 바른 운전 습관을 유도할 수 있는 방안 을 제시할 수 있을 것이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-2157587호(2020.09.14.)"}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는, 차량 운전자들에게 보다 즐겁고 흥미로운 운전 경험을 제공할 수 있 는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템을 제공하는데 있다. 본 발명이 해결하고자 하는 다른 기술적 과제는, 퀘스트 수행 등을 통해 차량 운전자들에게 바른 운전 습관을 유도할 수 있는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템을 제공하는데 있다. 본 발명이 해결하고자 하는 또 다른 기술적 과제는, 관련된 산업분야 발전에 일조할 수 있는 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템을 제공하는데 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확 하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위한 본 발명의 일 실시례에 따른 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템은, 모바일 디스플레이와 GPS가 배치된 차량; 및 상기 차량이 위치되는 장소를 게임 맵(game map)으로 설 정하고, GPS를 통한 상기 차량의 위치정보를 기반으로 상기 차량을 게임 유저(user)로 인식하여 게임 환경을 제 공하며, 상기 차량과 무선 네트워크 환경으로 연결되어 상기 모바일 디스플레이로 게임 상황을 전송하는 서버를포함하는 것을 특징으로 한다. 또한, 상기 차량은, 도로를 주행하거나 주/정차하는 동안 아이템, 재화 및 경험치 중 적어도 어느 하나를 획득 하는 것을 특징으로 한다. 또한, 상기 아이템, 상기 재화 및 상기 경험치는 상기 차량이 주행하는 장소, 유저의 운전 방법 및 유저의 교통 법규 준수 여부 중 적어도 어느 하나에 따라 달라지는 것을 특징으로 한다. 또한, 상기 게임 유저 간 획득한 아이템 거래가 가능한 것을 특징으로 한다. 또한, 상기 차량은, 상기 아이템, 상기 재화 및 상기 경험치 중 적어도 어느 하나를 구매할 수 있는 상점 이용 이 가능한 것을 특징으로 한다. 또한, 상기 게임 유저는 길드 가입이 가능하고, 상기 게임 유저 간 및 상기 길드 간 전투가 가능한 것을 특징으 로 한다. 또한, 상기 게임 유저 간 의사 전달이 가능한 것을 특징으로 한다. 또한, 상기 차량에는 카메라 모듈이 더 배치되며, 상기 서버는 상기 카메라 모듈을 통해 취득된 영상을 게임 그 래픽과 결합하여 상기 모바일 디스플레이로 전송하는 것을 특징으로 한다. 상기 본 발명의 양태들은 본 발명의 바람직한 실시례들 중 일부에 불과하며, 본원 발명의 기술적 특징들이 반영"}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "된 다양한 실시례들이 당해 기술분야의 통상적인 지식을 가진 자에 의해 이하 상술할 본 발명의 상세한 설명을 기반으로 도출되고 이해될 수 있다."}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 상술한 본 발명은 다음과 같은 효과가 있다. 먼저, 차량 운전은 보통 지루하고 반복적인 경험이 될 수 있으나, 본 발명을 통해 차량 운전자들에게 게임적인 요소가 더해진 흥미로운 경험을 제공할 수 있으며, 운전자의 즐거움을 향상시키고, 졸음 운전을 방지 역할도 기 대할 수 있다. 또한, 게임 내 퀘스트 수행을 통해 운전자의 바른 운전 습관을 유도할 수 있다. 또한, 다양한 게임적 요소를 통한 차별화된 서비스를 제공함으로써, 사용자들의 만족도를 높일 수 있다. 또한, 차량의 위치정보와 모바일 디스플레이를 활용하여 새로운 MMORPG 시스템을 제안함으로써, 기존의 MMORPG 에서는 경험할 수 없는 새로운 경험을 제공할 수 있다. 또한, 광고를 게임 환경에 접목시킬 경우 광고 수익의 증대로 이어질 수 있으므로, 광고를 더욱 효과적으로 게 재할 수 있으며, 이는 광고주의 만족도 또한 높일 수 있다. 또한, 본 발명은 모바일 디스플레이, GPS 기술, 게임 기술, 무선 네트워크 기술, 광고 및 차량과 관련된 산업 분야의 발전에 일조할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 발명이 속하는 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0065788", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시례들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시례를 설명함에 있어, 관련된 공지구성 또는 기능에 대한 구체적인 설명이 본 발명의 실시례에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생략한 다. 또한, 본 발명의 실시례의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소 의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \" 접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 접속될 수 있지만, 각 구 성 요소 사이에 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 도 1은 본 발명인 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템의 일 실시례에 따른 구성 개념도이며, 이를 바탕으로 본 발명인 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템을 설명하도록 한다. 먼저, 본 발명에 의하면, 서버를 통해 차량에 MMORPG(Massive Multiplayer Online Role-Playing Game) 게임 환 경을 제공하고, 차량을 통한 게임 결과를 차량에서 확인할 수 있도록 구성할 수 있다. 'MMORPG'는 Massive Multiplayer Online Role-Playing Game의 약자로, 대규모 다중 사용자 온라인 역할 수행 게임을 의미한다. MMORPG는 인터넷을 통해 연결된 수많은 플레이어(유저)들이 동시에 하나의 게임 세계에서 서 로 상호작용하며 캐릭터를 조작하여 게임을 즐길 수 있다. 일반적으로 MMORPG는 캐릭터를 만들고, 경험치를 쌓아 레벨업을 하며, 아이템을 수집하고, 퀘스트를 수행하는 등의 요소를 포함할 수 있다. 또한, MMORPG는 플레이어끼리 파티를 구성하여 함께 퀘스트를 수행하거나, 길드를 만들어 다른 길드와 전투를 벌이는 등의 협력 요소가 강조되는 게임이다. MMORPG는 일반적으로 인터넷을 통해 다른 플레이어들과 연결되기 때문에, 전 세계의 플레이어들과 함께 게임을 즐길 수도 있다. 이러한 특징 때문에 MMORPG는 소셜 네트워크와 유사한 기능을 갖춘 게임으로 발전하게 되었으 며, 현재에도 많은 사람들이 즐기고 있는 인기 있는 게임 장르 중 하나이다. 이를 위해 본 발명인 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템은 크게 차량, 차량이 주행하거나 주 /정차하는 장소, 서버를 포함하여 구성될 수 있다. 서버는 통상의 게임 서버를 적어도 하나 포함하는 것으로 이해할 수 있다. 서버는 차량이 위치되는 장소를 게임 맵(game map)으로 설정하고, GPS를 통한 차량의 위치정보를 기반으로 차량 을 게임 유저(user)로 인식하여 게임 환경을 제공하며, 차량과 무선 네트워크 환경으로 연결되어 모바일 디스플 레이로 게임 상황을 전송할 수 있다. 서버와 연결된 차량 하나하나를 플레이어(유저) 또는 캐릭터로 이해할 수 있다. 차량이 주행하거나 주/정차하는 장소는 게임 환경으로 이해할 수 있다. 차량이 주행하거나 주/정차하는 장소는 고속도로, 일반도로 및 국도 등과 같은 차량이 주행 가능한 각종 도로, 차량 주/정차가 가능한 공원이나 광장 등과 같은 공공장소 및 주차장 등이 포함될 수 있다. 또한, 차량 네비게 이션에 표시되거나 표시될 수 있는 모든 장소를 포함할 수 있다. 차량이 주행하거나 주/정차하는 장소는 게임 맵으로 이용될 수 있다. 게임 맵은 차량이 주행하거나 주/정차하는 장소별로 구분, 일례로 국가별 또는 지역별로 구분될 수 있다. 차량에는 모바일 디스플레이와 GPS(Global Positioning System)가 배치될 수 있으며, 무선 통신 모듈, 카메라 모듈 및 스피커 더 배치될 수 있다. 차량은 서버와 무선 네트워크로 연결될 수 있다. 이를 위해 차량과 서버 각각에는 무선 통신 모듈이 배치될 수 있다. 즉, 무선 액세스 포인트(Wireless Access Point, WAP)를 설치할 수 있다. 무선 액세스 포인트는 무선 신호를 발 생시키고 수신할 수 있다. 무선 액세스 포인트를 통해 무선 네트워크 연결을 위한 기반을 마련할 수 있다. 또한, 차량에는 무선 랜 카드가 설치될 수 있다. 이를 통해 차량과 무선 액세스 포인트 간에 무선 통신이 가능 하다. 무선 랜 카드는 차량에 내장시키거나, 외장 무선 어댑터로 추가할 수 있다. 또한, 이동 중인 차량의 경우, 무선 액세스 포인트에 연결할 수 없으므로 모바일 라우터를 사용하여 이동 중에 도 인터넷 연결을 유지할 수 있다. 모바일 라우터는 휴대용 무선 액세스 포인트로, 3G 또는 4G나 5G 모바일 네 트워크를 통해 인터넷에 연결할 수 있다. 또한, 무선 네트워크를 통해 차량과 서버가 통신하기 위해서는 각 장치에 IP 주소를 할당할 수 있다. IP 주소는 인터넷 상에서 각 장치를 식별하기 위한 고유한 주소로 사용될 수 있다.또한, 무선 네트워크는 외부에서 침입할 위험이 있으므로 보안을 설정할 수 있다. WPA2 등과 같은 보안 프로토 콜을 사용하여 무선 네트워크를 보호하고, 무선 랜 카드 및 모바일 라우터에는 암호화된 비밀번호를 설정하여 무단 접근을 방지할 수 있다. 차량은 도로를 주행하거나 주/정차하는 동안 아이템, 재화 및 경험치 중 적어도 어느 하나를 획득할 수 있다. 아이템은 차량이 주행을 통해 자연스럽게 습득할 수 있다. 아이템은 개념적으로 도로 노면 위에 존재하는 것으 로, 정해진 차선을 따라 차량이 올바르게 주행하면 획득한 것으로 처리될 수 있다. 아이템의 습득을 위해서는 차량의 GPS와 무선 통신 모듈을 사용할 수 있다. 서버는 무선 통신 모듈을 통해 차량의 위치 정보를 받아 주행 정보를 판정할 수 있다. 아이템의 습득은 방치형과 직접 조작형의 두 가지 플레이 방식에 따라 구분할 수 있다. 방치형 플레이 방식에서 는 주행 중에는 별도의 아이템 발견, 획득 사실이 통지되지 않고 주행 종료 후에 해당 주행의 결과로써 차량에 통보할 수 있다. 직접 조작형 플레이 방식에서는 차량의 전방 디스플레이나 연동된 모바일 디스플레이를 통해 도로 위에 아이템의 드랍(출현)과 획득 여부를 실시간으로 사용자에게 통지할 수 있다. 아이템은 사용자의 능력치를 올려주는 장비형 아이템이 될 수도 있고, 장비형 아이템의 강화나 경험치 및 재화 를 추가로 습득하게 해 주는 소모성 아이템이나 게임 내 캐릭터의 외형을 꾸며주는 외형 아이템이 될 수 있다. 차량이 주행하는 지역은 일종의 '맵'에 해당하며, 위치 정보를 기반으로 아이템의 획득을 달리 할 수 있다. 서 버에서는 차량의 무선 통신 모듈로부터 발신된 위치 정보를 수신하여 해당 차량이 어떤 아이템을 획득하였는지 판정하고, 이를 다시 차량에 전송할 수 있다. 이러한 아이템의 차별적 지급은 단순한 지역 경계를 기준으로 할 수도 있고, 차량이 주행중인 도로의 종류(국도, 고속도로 등)를 기준으로 할 수도 있으며, 통상적으로 위치정보 를 수집함으로써 구분할 수 있는 기준이라면 모두 이러한 차별 요소를 적용할 수 있다. 예컨대 송파구에서는 'A'아이템을, 관악구에서는 'B'아이템만을 주행으로 얻도록 구성할 수 있다. 그러나 게임 플레이를 위해서는 다른 지역에서 드랍되는 아이템도 필요할 수 있다. 이러한 아이템은 게임 유저 간 거래로 사 고팔 수 있도록 구성할 수 있으며, 사용자들은 자신의 지역에서 열심히 아이템을 습득하여 판매할 수 있다. 경험치는 주행을 통해 자연스럽게 습득할 수 있다. 주행의 시작부터 종료까지의 행위가 일반 게임의 전통적인 '사냥' 행위에 대응될 수 있다. 이때 사용자가 주행한 지역은 일종의 맵(map)으로 간주할 수 있다. 주행이 시작되면, 게임 서버에서는 주행 시작 신호를 받아 '사냥' 이벤트를 실행할 수 있다. 이후 서버에서 시 간에 따른 위치 정보를 지속적으로 수집하고, 차량에 부착된 카메라 모듈을 통해 전송받은 차량 주위의 경관을 게임 그래픽과 결합하여 사용자의 디스플레이에 송출할 수 있다. 이는 마치 사용자의 차량이 직접 게임 내 '던 전', 혹은 '맵'을 이동하며 게임 내 동작을 하는 것과 같은 시각적인 효과를 일으킬 수 있다. 이때 송출의 매개 가 되는 디스플레이는 모바일 디스플레이가 될 수도 있고, 차량의 전방 유리창 위에 표시되는 윈드쉴드 HUD(Head Up Display)가 될 수도 있다. 모바일 디스플레이는 이와 같이 사용자의 스마트폰, 차량에 배치된 디스 플레이, 윈드쉴드 HUD 중 적어도 어느 하나일 수 있다. 또한, 아이템, 재화 및 상기 경험치 등은 차량이 주행하는 장소, 유저(user)의 운전 방법 및 유저의 교통 법규 준수 여부 중 적어도 어느 하나에 따라 달라질 수 있다. 일례로 차량이 네비게이션을 통해 목적지까지의 경로를 설정한 경우, 상기 경로는 서버에 저장될 수 있으며, 상 기 경로의 출발부터 목적지 도착까지 순차적인 아이템 예컨대, 'A'~'Z'까지의 아이템을 얻도록 구성할 수 있다. 이때 차량이 경로를 따라 이동 시 필요한 경우(차선의 확대, 감소, 출구 이동 등) 이외에 차선을 변경하지 않고 주행한 경우 상기 'A'~'Z'까지의 아이템을 모두 얻도록 구성할 수 있다. 그러나 필요한 경우가 이닌 상황에서 차량이 차선을 변경한다면, 예컨대 'A'~'H'까지의 아이템을 순차적으로 얻은 상황에서 불필요하게 차선을 변경 한다면, 'I'아이템이 아닌 'A'아이템부터 다시 아이템을 순차적으로 얻도록 구성할 수 있다. 즉, 불필요하게 차 선을 변경하였다면, 주행 차량은 목적지까지 도착하여도 'A'~'Z'까지의 아이템을 모두 얻을 수 없다. 이는 경로 를 이탈한 경우에도 동일하게 적용할 수 있다. 아이템은 일정 거리마다 배치할 수 있으며, 특정 도로 환경 상황 등을 반영하여 거리에 상관없이 배치할 수도 있을 것이다. 또한, 119 차량과 같은 긴급 차량이 주변에 위치된 경우, 양보 운전을 한 경우에 특수 아이템이나 추가 아이템 등을 얻도록 구성할 수도 있다. 이와 같은 구성을 통해 운전자의 바른 운전 습관을 유도할 수 있으며, 올바른 운전 습관의 경우 재화를 추가 획 득할 수 있게 해 주고, 과속하거나 신호를 위반한 경우 게임 상에서 제재를 가함으로써 과격한 운전 습관을 기 피하게 하여 성숙한 운전 문화가 정착되도록 유도할 수 있으며, 졸음 운전을 방지할 수도 있다. 또한 특별한 장소(지역)로의 이동을 장려하여 지역 경제를 활성화하는데 일조할 수도 있다. 즉, 특정 지자체와 업무협약을 체결하여 해당 지역을 주행하는 차량을 대상으로 재화 획득률을 높여주는 등의 이벤트를 진행할 수 있다. 예를 들어 강원도 영월군을 선정한 경우, 영월에서는 '주행 경험치 2배', '주차 경험 치 3배 뻥튀기 & 레어 아이템 '전설검' 드랍 이벤트를 진행할 수 있다. 이를 통해 운전자들이 영월 여행을 계획 하게 되고, 이 과정에서 참여한 맛집, 지자체 및 매장 등을 게임 상에 주요 컨텐츠의 일부로 등록하고 수수료를 받는 비즈니스 모델을 구축할 수 있다. 게임 유저는 길드 가입이 가능하고, 게임 유저 간 또는 상기 길드 간 전투가 가능하도록 구성할 수 있다. 또한, 게임 유저 간에는 의사 전달이 가능하도록 구성할 수 있다. 또한, 차량은 아이템, 재화 및 경험치 중 적어도 어느 하나를 구매할 수 있는 상점을 이용하도록 구성할 수 있 다. 상점은 모든 차량이 이용할 수 있는 게임 상점 및 차량이 위치된 장소에 따라 이용할 수 있는 지역 상점을 포함 하여 구성할 수 있다. 사용자 간 거래할 수 있도록 구성할 수도 있다. 사용자 간 거래는 판매자와 구매자의 위치에 따라 3가지 종류의 거래 행위로 구분할 수 있다. 이러한 시스템에는 무선 통신 모듈과 GPS를 통해 차량의 위치 정보를 송수신하는 과정이 포함될 수 있다. 거래 이벤트가 발생하면, 당사자 양방의 위치 정보를 수신하여 거래의 유형이 결정되고, 이에 따라 거래원가/수수료율/세율 등 가격에 영향을 미치는 요인들이 결정될 수 있다. 수수료율은 거래의 대가로 추가로 지출하여야 하는 소멸성 비용이며, 세율은 MMORPG 게임에서 일반적으로 '성'으로 통칭되 는 지역 권역마다 다르게 설정되는 값에 해당한다. 일반적으로 MMORPG 게임에서 '성' 시스템을 도입하면 '성'을 점유한 특정 개인이나 단체에 여러 부가적인 이익을 누릴 권리를 배타적으로 부여할 수 있는데, 이때 '세금'은 거래 이벤트가 발생할 때마다 일정 비율로 '성'에 귀속되는 비용일 수 있다. 수수료, 세율 및 거래 시스템에 관해 부연 설명하면 다음과 같다. 기본적으로, MMORPG 게임 내에서 통상적으로 거래에는 '세금'과 '거래 수수료'를 부과할 수 있다. 예컨대 사용 자 '갑'이 사용자 '을'에게 5000골드 상당의 물품을 판매할 경우, '을'이 5000골드를 지불하였더라도 갑에게는 세금과 수수료를 제한 4500골드가 입금될 수 있다. 수수료와 세금의 경우, 절대적인 것은 아니지만 구분을 하자면 '수수료'는 통상적으로 게임 내에서 소멸되는 재 화로 볼 수 있다. '세금'은 거래가 이루어진 장소를 점유하는 게임 서버 내의 '성'에 축적될 수 있다. '성'은 게임사에서 사용자 개인이나, 여러 개인이 모여 형성한 '길드'로 하여금 점령할 수 있게 만든 시스템이다. '성'을 점령한 길드는 '세율'을 독자적으로 정할 수 있고, 축적된 세금을 수령하여 사용하도록 구성할 수 있다. 세금은 예컨대, 경기도 광명시에 위치한 '갑'과 '을'이 게임 내 원격 거래 시스템을 활용하여 거래하면, '광명 성'을 점령한 길드 'A'가 설정한 세율 2%에 따라 100골드가 광명성에 적립될 수 있다. 'A'는 이후 이 세금을 자 유롭게 인출하여 사용할 수 있다. 한편 경기도 하남시를 새롭게 점령한 길드 'B'가 세율을 10%로 인상할 경우, 하남에 소재한 '병'은 높은 세율에 불만족하여 사람들을 모아 다음 점령 이벤트 때 'B'를 상대로 공성전을 벌이려 할 수도 있고, 소재지를 하남 이 외의 권역으로 옮겨 거래를 하려 할 수도 있다. 반대로, 수원시에 소재하여 '수원성'을 점령한 길드 'C'는 같은 권역 내의 사용자들의 반발로 세율을 1% 이상으 로 올리지 못했는데, 현재 하남성의 세율이 10%이므로 세금이 많이 쌓여 있을 것으로 추측되는 하남성을 점령하 고자 공성전에 참가할 수 있다. 이처럼 세금은 게임 내에서 다양한 이권을 형성하고 이권을 차지하기 위한 행위를 발생시키는 원인으로 작용할 수 있다. 수수료는 세금처럼 특정 개인에게 귀속되는 재화는 아니지만, '수수료가 있는 거래 방식'과 '수수료가 없는 거 래 방식'을 차별화하기 위해 도입할 수 있다. 또한, 통상적으로 MMORPG에서는 끊임없이 재화가 생산되는 경향이 있기에 운영 기간이 길어질수록 유저들이 보 유한 재화의 양이 점점 증가하는데, 인플레이션을 방지하기 위해 게임 내에서 재화를 소멸시키는 것도 중요한 과제일 수 있다. 수수료 역시 이러한 재화 소멸을 위한 시스템으로 간주할 수 있다. 일례로 어떤 게임이 3년 정도 서비스하여 주요 유저층이 평균적으로 보유한 골드가 100억이 되었다면, 게임 내 상점에서 300골드, 500골드 정도로 구매하고 판매할 수 있었던 기존 아이템의 상대적인 가치가 너무 낮아지고, 예컨대 1년 전에는 70억 골드였던 'X' 아이템의 거래 가격이 700억이 되는 등 인플레이션이 발생할 수 있다. 따 라서 매 시행마다 1억 골드를 소모하는 새로운 강화 방식을 업데이트하는 등의 방식을 도입하여 게임 내 재화의 양을 조절할 수 있다. 이를 기반으로 위치 정보를 기반으로 한 세 가지 거래 시스템 유형에 관해 설명하면 다음과 같다. 첫번째 유형인 '직거래'는 판매자와 구매자가 물리적으로 만나는 방식으로, 거래 시 수수료와 세금을 면제하여 혜택을 부여하는 방안이다. 일례로, 앞서 5000골드를 원가로 하는 거래를 한 '갑'과 '을'이 물리적으로 만나서 거래한 경우에는 직거래 이 벤트를 발생시킬 수 있다. 세금과 수수료가 적용되는 거래에서는 '을'이 5000골드를 지불하였더라도 '갑'은 4500골드를 수령하지만, '갑'과 '을'이 직거래 이벤트를 통해 거래하면 갑은 5000골드를 온전히 받을 수 있다. 이러한 수수료 차별은 '갑'으로 하여금 '을'을 직접 만나러 가도록 하는 유인으로 작용할 수 있다. 혹은, '을' 에게 직접 '갑'이 위치한 곳으로 만나러 와 줄 경우 4600골드로 가격을 낮추어 판매하겠다고 제안할 수도 있다. 두번째 유형인 '지역 판매'는 사용자의 차량이 현재 위치한 지역의 '상점'에 아이템을 직접 판매하는 방식이며, 수수료를 면제할 수 있다. 예컨대 관악구에서 사냥한 'B' 아이템을 게임 내의 '상점' 기능을 활용하여 직접 판 매한다면 수수료를 면제한 가격으로 판매할 수 있다. 이때 '지역 판매'에서 '상점'이란, 다른 사용자가 개입하지 않는 자동적 거래 행위로, 차량 내부에서 조작하여 아이템을 판매 처리하고 골드를 얻는 방식이다. 아이템을 수령하는 상대방이 존재하지 않기 때문에 게임 내에서 아이템은 소멸 처리될 수 있다. 세번째 유형은 '중개 무역'으로, 판매자와 구매자가 원거리에 있는 상황에서 게임 시스템을 중개자로 삼아 물건 을 서로 거래하는 방식이다. 수수료와 세금을 모두 부담하도록 구성할 수 있다. 예컨대 관악구에서 사냥한 'B' 아이템을 차량이 관악구에 있는 상태에서 송파구에 위치한 구매자에게 판매하고자 한다면, 게임 시스템에게 먼 저 아이템을 전달하고 구매자가 수령하는 방식으로 거래할 수 있다. 이는 해당 게임이 위치 정보 기반으로 물리 적으로 같은 권역 내에 있어야 상호작용할 수 있다는 것을 기본으로 하고 있기 때문에, 원래대로라면 관악구에 있는 사용자 '정'과 송파구에 있는 '무'는 거래를 할 수 없다는 제한을 둘 수 있으나 유저의 편의를 위해 이를 다소 완화한 거래 유형에 해당한다. 중개 무역을 활용한 경우, '정'과 '무'는 직접 만나지 않고도 원격으로 자 신이 현재 위치한 곳에서 중개 무역을 통해 아이템을 거래할 수 있다. 예컨대 'X' 아이템을 팔고자 하는 '정'은 온라인으로 'X' 아이템을 판매한다는 글을 올리고 가장 높은 가격을 제시한 '무'에게 판매할 수 있다. 아이템은 소멸 처리되지 않고 '정'에게서 '무'로 이동한다. 사용자 간 전투(PvP)는 위치기반 정보를 활용하여 물리적으로 인접한 사용자 간에 전투 이벤트(PvP)를 실행하고, 이를 서버에 기록하고 모바일 디스플레이로 송출할 수 있다. 전투 결과는 서버에 누적 기록됨으로써 사용자들에게 또 다른 성장의 동기로 작용할 수 있다. 사용자는 모바일 디스플레이를 통해 인근 타 사용자의 차량을 시각적으로 확인할 수 있으며, 타 사용자의 차량 을 선택하여 게임 내 프로필을 확인하고 PvP 이벤트를 실행할 수 있다. 이는 기술적으로 사용자의 일정 거리 이 하에 있는 타 사용자들을 모두 'PvP 가능 후보 리스트'에 추가하여 디스플레이 상에 노출하고, 거리에서 벗어나 면 리스트에서 삭제하는 방식으로 실현될 수 있다. 이러한 PvP 시스템은 게임 내부적으로 '은신', 'PvP 불가 지 역' 등 PvP가 불가능한 조건을 설정하고 이와 대조하여 임의의 주변 사용자를 리스트에 추가할지 여부를 결정하 여 노출하는 알고리즘을 포함할 수 있다. 또한 위치 정보에 따라 사용자 본인이 은신 상태에서 타 사용자를 대 상으로 PvP를 실행하여 공격하면 '백어택'이 발동하거나, 피격받는 도중에 좌/우회전을 하는 등 주행 상태에서 의 변화가 있으면 이러한 정보를 피격 차량의 하드웨어로부터 송신받아 '회피'가 발동하여 데미지를 적게 입도 록 하는 등 PvP에서 공격 데미지에 변화를 주는 추가 효과를 발생시키는 방안을 포함할 수 있다. 백어택, 회피와 같은 전투 부가 효과들은 주행 중 조작으로 인한 것이 아니라, 특정 조건을 만족했을 때 자동으 로 발생하도록 구성할 수 있다. 예컨대 사용자 '기'의 차량이 'Y' 아이템을 소모하여 30분 동안 은신 상태가 되 었을 때, 신호대기 중 옆 차선에 있던 사용지 '경'의 차량을 지정하여 PvP를 실행하면 백어택이 발동하는 방식 이다. 동일하게 신호대기 중이었던 '경'이 PvP를 실행하기 위해 주변에 해당 게임이 탑재된 차량들의 정보를 불 러왔다면 '기'의 차량은 인식되지 않았을 것이고, 따라서 '기'가 게임 사용자가 아니라고 판단할 수 있다. 그러 나 PvP가 실행되고 은신이 해제되면 '기'는 게임 사용자가 아니라고 생각했던 옆 차선의 차량이 사실은 은신 중 이었음을 인지할 수 있다. '회피', '치명타' 등 매 공격의 결과값은 사용자의 스탯(회피율, 치명타율)에 의해 자동으로 결정될 수 있다. PvP 전투의 실행은 사용자의 추가 조작 없이도 자동적으로 진행될 수 있다. 본 발명에 따른 게임은 위치 정보를 기반으로 하여 사용자들이 물리적으로 같은 권역 내에 있어야 상호작용할 수 있다는 것을 기본으로 하고 있기 때문에, PvP 중이었던 두 차량의 거리가 일정 거리 이상으로 멀어지면 상호 작용할 수 없도록 제한할 수 있다. 따라서 '도망' 등의 이벤트가 발생할 수 있다. 예컨대 직진 차선에서 PvP를 실행 중이던 두 차량 중 한 차량이 차선을 변경하고 우회전하여 거리가 벌어진다면 PvP는 중단될 수 있다. 그러 나 무리한 끼어들기, 급가속 등 PvP를 피하기 위한 목적으로 주행 중 조작을 하는 것은 캐릭터의 사망과 같은 강력한 페널티를 부여하는 방안으로 제재할 수 있다. 그럼에도 불구하고 해당 PvP 요소가 위험을 초래한다고 판 단될 경우, 거리 변화와 상관없이 일단 발생한 PvP 이벤트는 자동으로 진행되어 사용자가 개입할 수 없도록 하 고, 사용자에게는 PvP 결과만이 통보되는 방식으로 운영할 수도 있다. 사용자 간 소통 행위에도 위치 정보를 이용할 수 있다. 이는 기존의 MMORPG 게임에서 '서버'와 '채널'별로 소통 방식이 나누어지는 시스템과 유사하다. 물리적으로 같은 권역 내에 있는 사용자들끼리는 '지역 대화' 시스템을 활용해 자유롭게 대화를 남길 수 있다. 물리적으로 떨어진 사용자 간에 대화하기 위해서는 동시 접속 중일 때 서로의 차량에 음성 메시지를 보낼 수 있다. 이 기능은 '귓속말' 등과 같은 특정 아이템을 소모함으로써 사용할 수 있도록 구성할 수도 있다. 차량에 음성 메시지를 보낼 경우, 차량 내장 스피커를 통해 안내음성처럼 송출할 수도 있고, 모바일 디스플레이 예컨대, 차량의 HUD에 텍스트를 디스플레이 하는 방식으로 메시지를 보낼 수도 있다. 게임에서 '경험치' 또는 '능력치'란 체력, 민첩 등의 여러 수치로 표현될 수 있다. '경험치' 또는 '능력치'는 게임 내 재화를 습득하는 방식이나, 경쟁 컨텐츠를 플레이하는 방식에 영향을 미칠 수 있다. 예컨대 '민첩' 스 탯이 높으면 같은 거리를 주행하더라도 더 많은 경험치를 얻을 수 있다. 또한 일정 시간이 지나면 경험치를 평 소의 0.5배 밖에 획득하지 못하도록 제한했다면, 체력 스탯이 높은 경우 더 오랫동안 주행 시간을 경험치로 전 환할 수 있다. 장비는 이러한 능력치를 올려 주는 귀속형 아이템이 될 수 있다. 한편 주행 시 과속, 신호위반, 차선 위반 등의 위법행위를 저질렀거나 깜빡이 미표시, 급가속 등 비매너 주행 행위를 저지르는 경우, 징벌적인 차원에서 장비 의 내구도 감소나 파손으로 이어지도록 구성할 수 있다. 이를 위해 차량의 주행 상태를 기록하는 하드웨어 모듈 과의 정보 통신 부분을 추가할 수 있다. 즉, 본 발명은 차량이 주행을 완료하면 주행 정보가 서버로 전송될 수 있다. 서버에서는 기존에 저장된 차량의 레벨과 스탯, 장비 착용 여부를 조합하여 해당 주행으로 획득할 수 있는 경험치와 아이템을 산출할 수 있다. 이 러한 값을 바탕으로 주행 후 사용자의 상태를 업데이트하고, 결과를 차량에 다시 전송하여 모바일 디스플레이에 표시함으로써 사용자가 인지하도록 구성할 수 있다. 경쟁형 이벤트의 경우, 'OO의 탑', '레이드' 등 전통적인 MMORPG 게임에서 진행한 대규모 참여형 컨텐츠를 현실 의 위치정보를 기반으로 구현할 수 있다. 예컨대 사용자들끼리 '길드'를 만들고, 길드 단위로 정해진 기간 동안 랜덤하게 선정되는 지역 거점을 방어하거나 공격하도록 구성할 수 있다. 이때에도 지역 거점을 실제 장소(해운 대 해수욕장)로 선정하고, 일정 인원이 물리적으로 결집하면 보유한 재화를 투입해서 지역 거점을 점령하는 식 의 점령 이벤트가 발생하도록 할 수 있다. 이러한 경쟁형 게임 시스템은 앞서 서술한 다른 요소에서와 마찬가지 로 차량 간의 위치 정보를 수신받아 서버상에서 대조하고 처리하는 과정을 포함하며, 다양한 게임 내 조건을 설 정하여 사용자별로 특정 행위에 제한을 두거나 효과를 차등적으로 적용하는 등의 설계를 포함할 수 있다. 이때, 게임 내 가상 물리적 공간의 특정 구역에 너무 많은 사용자들이 밀집하면 사용자들이 모두 오른쪽으로 조 금씩 움직이기만 해도 모든 사용자들의 컴퓨터 화면에 그것을 출력해내야 하므로, 게임 서버에 부하가 폭발적으 로 증가하여 렉이 걸리는 문제가 발생할 수 있다. 이런 문제를 예방하기 위해 길드원은 최대 10명까지 참여 가능하다는 식으로 하여 정예 인원들만 참여하도록 유 도할 수 있다. 또한 전투 장소가 되는 공간을, 스포츠 경기가 없을 때의 잠실 주경기장 주차장 등과 같이, 충분 히 넓은 구역으로 설정할 수도 있다. 이상에서 설명한 본 발명인 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템을 통해, 차량 운전자들에게 게임적인 요소가 더해진 흥미로운 경험을 제공할 수 있으며, 운전자의 즐거움을 향상시키고, 졸음 운전을 방지 역할도 기대할 수 있다. 또한, 게임 내 퀘스트 수행을 통해 운전자의 바른 운전 습관을 유도할 수 있음은 물론, 모바일 디스플레이, GPS 기술, 게임 기술, 무선 네트워크 기술, 광고 및 차량과 관련된 산업 분야의 발전에 일조할 수 있다. 이상에서, 본 발명의 실시례를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명 되었다고 해서, 본 발명이 반드시 이러한 실시례에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 이상에서 기 재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재할 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미와 일치하는 것으로 해석 되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는 다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 게시된 실시례들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시례에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0065788", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명인 모빌리티와 융합된 위치정보 기반 MMORPG 게임 시스템의 일 실시례에 따른 구성 개념도."}
