{"patent_id": "10-2022-0000376", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0105162", "출원번호": "10-2022-0000376", "발명의 명칭": "무인전투차량 및 이의 표적 검출 방법", "출원인": "한화에어로스페이스 주식회사", "발명자": "송진모"}}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "제1화각으로 영상을 획득하는 제1카메라 및 상기 제1화각보다 작은 제2화각으로 영상을 획득하는 제2카메라를구비한 무인전투차량의 표적 검출 방법에 있어서,상기 제1카메라가 획득한 제1영상으로부터 은폐물을 검출하는 단계;상기 제1영상에서 은폐물에 관심영역을 설정하는 단계;상기 관심영역 내에서 표적을 검출하는 단계;상기 표적이 검출된 관심영역을 지향하는 상기 제2카메라가 획득한 제2영상으로부터 표적 정보를 검출하는단계; 및상기 제1영상에 상기 표적 정보를 표시하는 단계;를 포함하는 무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 은폐물 검출 단계는, 상기 제1영상에서 유효사거리 내 은폐물을 검출하는 단계;를 포함하는 무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 제1영상에서 검출된 도로 또는 랜드마크의 GIS(Geographic Information System) 정보를 기초로 상기 유효사거리 내 은폐물이 검출되는, 무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1카메라의 자세변화에 대응하여 상기 관심영역의 위치를 보정하는 단계;를 더 포함하는 무인전투차량의표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 관심영역의 위치 보정 단계는,상기 제1카메라의 자세 변화량에 대응하는 화소이동량을 상기 관심영역의 위치에 역보상함으로써 상기 관심영역의 위치를 보정하는 단계;를 포함하는 무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 관심영역의 위치 보정 단계는,객체 추적 기법에 의해 상기 은폐물을 추적하고, 상기 추적된 은폐물에 상기 관심영역을 설정함으로써 상기 관심영역의 위치를 보정하는 단계;를 포함하는 무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 관심영역에서 상기 은폐물 주변의 화소값의 변화를 기초로 상기 관심영역에서 상기 표적 검출 여부를 판단하는, 무인전투차량의 표적 검출 방법.공개특허 10-2023-0105162-3-청구항 8 제1항에 있어서, 상기 표적 정보 표시 단계는,상기 표적 정보를 기초로 상기 표적의 위협도를 결정하고, 상기 위협도의 순위를 상기 제1영상에 표시하는단계;를 포함하는 무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 표적 정보는 상기 표적의 종류, 상기 표적의 상대거리 및 상기 표적이 소지하는 화기의 종류를 포함하는,무인전투차량의 표적 검출 방법."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1화각으로 영상을 획득하는 제1카메라; 상기 제1화각보다 작은 제2화각으로 영상을 획득하는 제2카메라; 및상기 제1카메라가 획득한 제1영상으로부터 은폐물을 검출하고, 상기 제1영상에서 은폐물에 관심영역을설정하고, 상기 관심영역 내에서 표적을 검출하고, 상기 표적이 검출된 관심영역을 지향하는 상기 제2카메라가획득한 제2영상으로부터 표적 정보를 검출하고, 상기 제1영상에 상기 표적 정보를 표시하는 영상처리부;를 포함하는 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 영상처리부는,상기 제1영상에서 유효사거리 내 은폐물을 검출하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 영상처리부는,상기 제1영상에서 검출된 도로 또는 랜드마크의 GIS(Geographic Information System) 정보를 기초로 상기 유효사거리 내 은폐물을 검출하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 영상처리부는,상기 제1카메라의 자세변화에 대응하여 상기 관심영역의 위치를 보정하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 영상처리부는,상기 제1카메라의 자세 변화량에 대응하는 화소이동량을 상기 관심영역의 위치에 역보상함으로써 상기 관심영역의 위치를 보정하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 상기 영상처리부는,객체 추적 기법에 의해 상기 은폐물을 추적하고, 상기 추적된 은폐물에 상기 관심영역을 설정함으로써 상기 관심영역의 위치를 보정하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제10항에 있어서, 상기 영상처리부는,상기 관심영역에서 상기 은폐물 주변의 화소값의 변화를 기초로 상기 관심영역에서 상기 표적 검출 여부를 판단공개특허 10-2023-0105162-4-하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제10항에 있어서, 상기 영상처리부는,상기 표적 정보를 기초로 상기 표적의 위협도를 결정하고, 상기 위협도의 순위를 상기 제1영상에 표시하는, 무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제10항에 있어서, 상기 표적 정보는 상기 표적의 종류, 상기 표적의 상대거리 및 상기 표적이 소지하는 화기의 종류를 포함하는,무인전투차량."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 무인전투차량의 표적 검출 방법은, 제1카메라가 획득한 제1영상으로부터 은폐물을 검출하는 단계; 상기 제1영상에서 은폐물에 관심영역을 설정하는 단계; 상기 관심영역 내에서 표적을 검출하는 단계; 상기 표적이 검출된 관심영역을 지향하는 제2카메라가 획득한 제2영상으로부터 표적 정보를 검출하는 단계; 및 상기 제1영상에 상기 표적 정보를 표시하는 단계;를 포함한다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무인전투차량 및 이의 표적 검출 방법에 관한 것이다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술발전과 미래 전장환경 변화에 능동적으로 대처하기 위해 전세계에서 무인으로 운용하는 차세대 전투차량을 개발 및 운용하고 있으며, 유인 전투차량을 대체해 전투원의 생존성과 전투 효율을 향상시켜 미래의 다양한 위 협에 더 빠르고 치명적으로 대응하기 위한 제품을 개발하고 있다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예들은 야지/험지 환경에서 은폐된 표적을 빠르게 검출할 수 있는 무인전투차량 및 표적 검출 방 법을 제공하는 것이다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 제1화각으로 영상을 획득하는 제1카메라 및 상기 제1화각보다 작은 제2화각으로 영 상을 획득하는 제2카메라를 구비한 무인전투차량의 표적 검출 방법은, 상기 제1카메라가 획득한 제1영상으로부 터 은폐물을 검출하는 단계; 상기 제1영상에서 은폐물에 관심영역을 설정하는 단계; 상기 관심영역 내에서 표적 을 검출하는 단계; 상기 표적이 검출된 관심영역을 지향하는 상기 제2카메라가 획득한 제2영상으로부터 표적 정 보를 검출하는 단계; 및 상기 제1영상에 상기 표적 정보를 표시하는 단계;를 포함한다. 상기 은폐물 검출 단계는, 상기 제1영상에서 유효사거리 내 은폐물을 검출하는 단계;를 포함할 수 있다. 상기 제1영상에서 검출된 도로 또는 랜드마크의 GIS(Geographic Information System) 정보를 기초로 상기 유효 사거리 내 은폐물이 검출될 수 있다. 상기 방법은, 상기 제1카메라의 자세변화에 대응하여 상기 관심영역의 위치를 보정하는 단계;를 더 포함할 수 있다. 상기 관심영역의 위치 보정 단계는, 상기 제1카메라의 자세 변화량에 대응하는 화소이동량을 상기 관심영역의 위치에 역보상함으로써 상기 관심영역의 위치를 보정하는 단계;를 포함할 수 있다. 상기 관심영역의 위치 보정 단계는, 객체 추적 기법에 의해 상기 은폐물을 추적하고, 상기 추적된 은폐물에 상 기 관심영역을 설정함으로써 상기 관심영역의 위치를 보정하는 단계;를 포함할 수 있다. 상기 관심영역에서 상기 은폐물 주변의 화소값의 변화를 기초로 상기 관심영역에서 상기 표적 검출 여부를 판단 할 수 있다. 상기 표적 정보 표시 단계는, 상기 표적 정보를 기초로 상기 표적의 위협도를 결정하고, 상기 위협도의 순위를 상기 제1영상에 표시하는 단계;를 포함할 수 있다. 상기 표적 정보는 상기 표적의 종류, 상기 표적의 상대거리 및 상기 표적이 소지하는 화기의 종류를 포함할 수 있다. 본 발명의 일 실시예에 따른 무인전투차량은 제1화각으로 영상을 획득하는 제1카메라; 상기 제1화각보다 작은 제2화각으로 영상을 획득하는 제2카메라; 및 상기 제1카메라가 획득한 제1영상으로부터 은폐물을 검출하고, 상 기 제1영상에서 은폐물에 관심영역을 설정하고, 상기 관심영역 내에서 표적을 검출하고, 상기 표적이 검출된 관 심영역을 지향하는 상기 제2카메라가 획득한 제2영상으로부터 표적 정보를 검출하고, 상기 제1영상에 상기 표적 정보를 표시하는 영상처리부;를 포함한다. 상기 영상처리부는, 상기 제1영상에서 유효사거리 내 은폐물을 검출할 수 있다. 상기 영상처리부는, 상기 제1영상에서 검출된 도로 또는 랜드마크의 GIS(Geographic Information System) 정보 를 기초로 상기 유효사거리 내 은폐물을 검출할 수 있다. 상기 영상처리부는, 상기 제1카메라의 자세변화에 대응하여 상기 관심영역의 위치를 보정할 수 있다. 상기 영상처리부는, 상기 제1카메라의 자세 변화량에 대응하는 화소이동량을 상기 관심영역의 위치에 역보상함 으로써 상기 관심영역의 위치를 보정할 수 있다. 상기 영상처리부는, 객체 추적 기법에 의해 상기 은폐물을 추적하고, 상기 추적된 은폐물에 상기 관심영역을 설 정함으로써 상기 관심영역의 위치를 보정할 수 있다. 상기 영상처리부는, 상기 관심영역에서 상기 은폐물 주변의 화소값의 변화를 기초로 상기 관심영역에서 상기 표 적 검출 여부를 판단할 수 있다. 상기 영상처리부는, 상기 표적 정보를 기초로 상기 표적의 위협도를 결정하고, 상기 위협도의 순위를 상기 제1 영상에 표시할 수 있다. 상기 표적 정보는 상기 표적의 종류, 상기 표적의 상대거리 및 상기 표적이 소지하는 화기의 종류를 포함할 수 있다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 무인전투차량의 표적 검출 방법은 야지/험지 환경에서 은폐된 표적을 빠르게 검출할 수 있다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하의 내용은 단지 본 발명의 원리를 예시한다. 그러므로 당업자는 비록 본 명세서에 명확히 설명되거나 도시 되지 않았지만 본 발명의 원리를 구현하고 본 발명의 개념과 범위에 포함된 다양한 장치를 발명할 수 있는 것이다. 또한, 본 명세서에 열거된 모든 조건부 용어 및 실시예들은 원칙적으로, 본 발명의 개념이 이해되도록 하기 위한 목적으로만 명백히 의도되고, 이와 같이 특별히 열거된 실시예들 및 상태들에 제한적이지 않는 것으로 이 해되어야 한다. 또한, 본 발명의 원리, 관점 및 실시예들 뿐만 아니라 특정 실시예를 열거하는 모든 상세한 설 명은 이러한 사항의 구조적 및 기능적 균등물을 포함하도록 의도되는 것으로 이해되어야 한다. 또한, 이러한 균 등물들은 현재 공지된 균등물뿐만 아니라 장래에 개발될 균등물 즉 구조와 무관하게 동일한 기능을 수행하도록 발명된 모든 소자를 포함하는 것으로 이해되어야 한다. 따라서, 프로세서 또는 이와 유사한 개념으로 표시된 기능 블록을 포함하는 도면에 도시된 다양한 소자의 기능 은 전용 하드웨어뿐만 아니라 적절한 소프트웨어와 관련하여 소프트웨어를 실행할 능력을 가진 하드웨어의 사용 으로 제공될 수 있다. 프로세서에 의해 제공될 때, 기능은 단일 전용 프로세서, 단일 공유 프로세서 또는 복수 의 개별적 프로세서에 의해 제공될 수 있고, 이들 중 일부는 공유될 수 있다. 또한, 프로세서, 제어 또는 이와 유사한 개념으로 제시되는 용어의 사용은 소프트웨어를 실행할 능력을 가진 하드웨어를 배타적으로 인용하여 해 석되어서는 아니 되고, 제한 없이 디지털 신호 프로세서(DSP) 하드웨어, 소프트웨어를 저장하기 위한 롬(ROM), 램(RAM) 및 비휘발성 메모리를 암시적으로 포함하는 것으로 이해되어야 한다. 주지 관용의 다른 하드웨어도 포 함될 수 있다. 상술한 목적, 특징 및 장점들은 첨부된 도면과 관련한 다음의 상세한 설명을 통하여 더욱 분명해 질 것이다. 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다 고 판단되는 경우 그 상세한 설명을 생략하거나 간략하게 설명하는 것으로 한다. 한편 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라, 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 어떤 실시예가 달리 구현 가능한 경우에 특정한 데이터 처리 순서는 설명되는 순서와 다르게 수행될 수도 있다. 예를 들어, 연속하여 설명되는 두 단계가 실질적으로 동시에 수행될 수도 있고, 설명되는 순서와 반대의 순서로 진행될 수 있다. 이하, 첨부된 도면을 참조하여 바람직한 실시예에 따른 본 발명을 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 무인전투차량을 개략적으로 도시한 블록도이다. 일 실시예에 따른 무인전투차량은 군운용 환경과 같이 비포장 도로, 험지나 야지 등의 육상 환경에서 운용 되는 이동형의 차량일 수 있다. 무인전투차량은 무인으로 작전지역을 기동하면서 적의 동향 또는 상황을 감 시할 수 있는 감시 센서가 탑재되며, 무인으로 적의 동향 및 상황을 파악할 수 있다. 무인전투차량은 적의 진지를 정찰 또는 돌파할 때 은폐한 적군을 사람의 개입 없이 찾아내고 가장 위협이 되는 상황을 인식하여 표적 의 우선순위를 정하고 이를 운용자에게 전달할 수 있다. 운용자가 가장 위협이 되는 표적을 지정(선택)하면, 무 인전투차량은 지정된 표적을 제압할 수 있다. 매복 지형 돌파 등의 작전을 수행할 때 지형지물에 은폐한 표적을 찾기가 어려우며 특히, 표적이 완전히 가려진 경우에는 무인전투차량에 부착된 감시정찰 카메라로는 표적을 찾을 수 없는 상황이 발생할 수 있다. 투과형 센 서 또는 드론 등을 사용하여 은폐한 표적을 찾는 방법들이 고안되었으나, 고가의 센서 또는 드론과 통신 등을 위한 통신 장치 등이 추가로 필요한 문제점이 있다. 일 실시예에 따른 무인전투차량은 감시정찰 카메라만을 이용해 은폐한 표적을 찾고, 상황을 인식하여 위협 도에 따른 표적 순서를 원격관제센터의 운용자에게 제공할 수 있다. 무인전투차량은 이동통신을 이용하여 원격관제센터의 지휘통제 서버와 원거리 통신도 가능하며, 지휘통제 서버에서는 대용량 DB 시스템을 기반으로, 무인전투차량의 센서/전력소비/주행 데이터를 저장/보관/관리할 수 있다. 일 실시예에 따른 무인전투차량은 인공지능(AI) 기반 기술을 이용하여 객체를 탐지(검출)/인식(인지)/식별 함으로써 위협 표적을 찾을 수 있다. 무인전투차량은 영상 내 표적의 위치를 파악한 후 무장장치를 자동으 로 제어하여 표적의 중심과 화기의 중심이 일치되도록 제어하며, 이때 가장 위협이 되는 표적을 우선으로 조준 할 수 있다. 운용자는 무인전투차량의 외부(예를 들어, 원격관제센터)에서 상황을 모니터링 하며, 조준 중 인 표적이 위협 표적임이 확인되면 무인전투차량에 사격을 명령하여 적을 제압할 수 있다. 운용자가 모니터 링 화면에 표시되는 표적들 중에서 조준 중인 표적 외의 다른 표적을 선택하면, 무인전투차량은 운용자에 의해 선택된 표적으로 자동으로 조준하여 사격 명령을 대기할 수 있다. 도 1을 참조하면, 무인전투차량은 무장장치, 영상장치, 구동기 및 제어기를 포함할 수 있다. 무장장치는 화기, 장착 마운트, 격발 솔레노이드 및 탄약 공급장치를 포함할 수 있다. 화기는 장착 마운트 에 장착되며, 탄약 공급장치로부터 탄약을 공급받고, 격발 솔레노이드에 의해 격발되어 표적을 사격할 수 있다. 본 명세서에서 객체(object)는 영상장치가 획득한 영상에서 사격의 대상이 될 수 있는 물체를 의미한다. 또한, 표적(target)은 객체들 중에서 사격을 수행할 대상이 되는 물체를 의미한다. 즉, 객체는 표적을 포함하는 개념이며, 객체들 중에서 표적으로 선정된 물체가 사격의 대상이 된다. 영상장치는 적어도 하나의 카메라를 포함할 수 있다. 적어도 하나의 카메라는 주간 카메라 및/또는 야간 카메라를 포함할 수 있다. 주간 카메라 및 야간 카메라는 지지부재에 상호 결합 배치되고, 지지부재가 수평 방 향 및 수직 방향으로 회전함으로써 주간 카메라 및 야간 카메라는 동시에 동일한 방향각으로 회전하여 상하좌우 로 자세를 변경할 수 있다. 이에 따라 본 명세서에서, 영상장치는 카메라와 혼용되어 사용될 수 있으며, 예컨대, 영상장치의 자세는 카메라의 자세를 의미할 수 있다. 주간 카메라는 일반적으로 주간 상황에 작동되어 객체들을 촬영할 수 있다. 다만, 주간 카메라가 야간 상황에 작동되는 것이 배제되는 것은 아니다. 즉, 주간 카메라는 제어기의 제어에 의해 주간 상황뿐만 아니라 야 간 상황에도 작동될 수 있다. 일 실시예에서, 주간 카메라는 EO(Electro-Optical) 카메라일 수 있다. 야간 카메라는 일반적으로 야간 상황에 작동되어 객체들을 촬영할 수 있다. 다만, 야간 카메라가 주간 상황에 작동되는 것이 배제되는 것은 아니다. 즉, 야간 카메라는 제어기의 제어에 의해 야간 상황뿐만 아니라 주 간 상황에도 작동될 수 있다. 일 실시예에서, 야간 카메라는 IR 카메라일 수 있다. 영상장치는 광각카메라를 더 포함할 수 있다. 광각카메라의 화각(FOV)(제1화각)은 주간 카메라 및 야간 카 메라의 화각(제2화각)보다 클 수 있다. 광각카메라는 전방 고정형 카메라이고, 주간 카메라 및 야간 카메라는 PTZ 카메라일 수 있다. 일 실시예에서, 무인전투차량은 작전지역에 진입시 광각카메라를 이용해 넓은 영역을 감시하여 적군을 검출 하고, 적군이 검출되면 주간 카메라 및/또는 야간 카메라를 이용해 적군을 집중 모니터링할 수 있다. 구동기는 모터를 구비하고, 카메라와 화기의 위치 및 방향을 조정할 수 있다. 구동기는 카메라 구동 부 및 화기 구동부를 포함할 수 있다. 카메라 구동부는 카메라를 구동하여 카메라와 화기 사이의 간격을 조절하여 카메라의 촬영 방향과 화기의 사격 방향을 평행하게 하거나 교차하게 하여 영점 조정을 할 수 있다. 화기 구동부는 고저 구동부 및 선회 구동부를 포함할 수 있다. 고저 구동부는 화기를 상하로 구동시켜 상하 방 향의 표적을 사격할 수 있게 한다. 여기서 상하 방향은 화기의 총구가 향해있는 쪽의 상하 방향을 의미한다. 선 회 구동부는 화기를 좌우로 구동시켜 좌우 방향의 표적을 사격할 수 있게 한다. 여기서 좌우 방향은 화기의 총 구가 향해있는 쪽의 좌우 방향을 의미한다. 제어기는 원격관제시스템 및/또는 영상장치으로부터 제어신호를 수신하고, 제어신호에 따라 구동기 를 제어하여 무장장치 및 영상장치를 제어할 수 있다. 제어기는 제어신호가 격발신호인 경 우, 화기가 사격하도록 격발 솔레노이드를 제어할 수 있다. 제어기는 제어신호가 화기 조작 신호인 경우, 화기가 상하좌우 중 특정 방향으로 이동하도록 화기 구동부의 고저 구동부 및/또는 선회 구동부를 제어할 수 있 다. 제어기는 제어신호가 카메라 조작 신호인 경우, 카메라가 상하좌우 중 특정 방향으로 이동하도록 카메 라 구동부를 제어할 수 있다. 도 2는 일 실시예에 따른 도 1의 영상장치를 개략적으로 도시한 블록도이다. 도 3 및 도 4는 일 실시예에 따른 은폐물 검출 및 관심영역 설정을 설명하는 도면들이다. 도 5는 일 실시예에 따른 도로를 이용하여 유효 사거리 내 은폐물을 검출하는 방법을 설명하는 도면이다. 도 6은 일 실시예에 따른 랜드마크를 이용하여 유효 사거리 내 은폐물을 검출하는 방법을 설명하는 도면이다. 도 7a 내지 도 7c는 일 실시예에 따른 관심영역의 위치를 보 정하는 방법을 설명하기 위한 도면들이다. 도 8 및 도 9는 일 실시예에 따른 표적을 검출하는 방법을 설명하기 위한 도면들이다. 도 10 및 도 11은 일 실시예에 따른 표적의 사격을 설명하기 위한 도면들이다. 도 12는 일 실 시예에 따른 무인전투차량이 운용자에게 제공하는 영상을 나타낸 도면이다. 도 2를 참조하면, 영상장치는 제1카메라, 제2카메라 및 영상처리부를 포함할 수 있다. 제1 카메라는 제1화각을 갖는 광각카메라일 수 있다. 제2카메라는 제2화각을 갖는 주간 카메라 및/또는야간 카메라일 수 있다. 일 실시예에서, 영상처리부는 제1카메라에 의해 획득된 영상(제1영상)을 분석하고, 제1영상으로부터 적어도 하나의 은폐물을 검출하고, 은폐물에 관심영역을 설정할 수 있다. 관심영역은 은폐물 및 은폐물 주변을 포함하는 소정 영역일 수 있다. 예를 들어, 도 3에 도시된 바와 같이, 제1카메라는 제1화각으로 무인전투차량의 전방을 촬영하여 제1 영상(IM1)을 생성할 수 있다. 영상처리부는 제1영상(IM1)에서 제1 내지 제4은폐물들(OB1 내지 OB4)을 검출 할 수 있다. 영상처리부는 제1 내지 제4은폐물들(OB1 내지 OB4) 각각에 제1 내지 제4관심영역들(ROI1 내지 ROI4)을 설정할 수 있다. 일 실시예에서, 영상처리부는 제1카메라에 의해 획득된 제1영상으로부터 적어도 하나의 은폐물을 검 출하고, 적어도 하나의 은폐물 중 유효사거리(Effective Range) 내 은폐물에 대해서만 관심영역을 설정할 수 있 다. 예를 들어, 도 4에 도시된 바와 같이, 영상처리부는 제1영상(IM1)에서 검출된 제1 내지 제4은폐물들(OB1 내지 OB4) 중 유효사거리를 반지름으로 하는 원(CC) 내의 제1 내지 제3은폐물들(OB1 내지 OB3)을 검출하고, 제1 내지 제3은폐물들(OB1 내지 OB3) 각각을 포함하는 제1 내지 제3관심영역들(ROI1 내지 ROI3)을 설정할 수 있다. 영상처리부에 의한 은폐물의 검출(detection)은 은폐물의 인지(recognition) 및 식별(identification)의 의미를 포함할 수 있다. 예를 들어, 영상처리부는 단순한 은폐물의 검출뿐만 아니라, 검출된 은폐물의 종 류(사람, 동물 등) 및 상제 정보(아군, 적군, 민간인 등)를 획득할 수 있다. 영상처리부는 인공지능(AI) 기술을 기반으로 은폐물을 검출, 인지 및 식별할 수 있다. 은폐물은 풀숲, 나무, 바위, 건물 등의 장애물로서, 객체가 자신의 몸을 가려 숨길 수 있는 물체를 포함할 수 있다. 일 실시예에서, 영상처리부는 거리측정기를 이용하여 무인전투차량으로부터 은폐물까지의 거리(이하, '은폐물의 거리'라 함)를 측정함으로써 유효사거리 내 은폐물을 검출할 수 있다. 다른 실시예에서, 영상처리부 는 미리 알고있는 GIS(Geographic Information System) 정보 및 GPS 정보 등을 활용하여 빠르게 유효사거 리 내 은폐물을 검출할 수 있다. 예를 들어, 영상처리부는 도로 또는 랜드마크의 GIS 정보를 이용하여 유 효사거리 내 은폐물을 검출할 수 있다. 일 실시예에서, 영상처리부는 도로의 GIS 정보를 이용하여 제1영상(IM1) 내에 유효사거리를 반지름(이하, '유효사거리 반지름'이라 함)으로 하는 원을 설정함으로써 유효사거리 내의 은폐물을 검출할 수 있다. 도 5를 참조하면, 영상처리부는 한 쌍의 도로 라인들(L1, L2)을 검출하고, 한 쌍의 도로 라인들(L1, L2) 중 한 라인(L1) 상의 한 점(a)을 설정할 수 있다. 영상처리부는 라인 검출 알고리즘을 이용하여 도로 라인 들(L1, L2)을 검출할 수 있다. 라인 검출 알고리즘은 에지 검출, 허프 변환 등의 방법을 포함할 수 있다. 영상 처리부는 점(a)에서 다른 라인(L2)까지의 최단 거리, 즉 라인(L1) 상의 점(a)과 점(a)을 마주하는 라인 (L2) 상의 점(b)을 잇는 직선(L3)의 픽셀 길이(x)를 산출할 수 있다. 픽셀 길이(x)는 점(a)과 점(b) 사이의 픽 셀 개수일 수 있다. 영상처리부는 직선(L3)에 접하는 원(CC')의 반지름(d)에 대응하는 실측 거리(D)를 식 에 의해 산출할 수 있다. 영상처리부는 도로 너비(W), 제1영상(IM1)의 가로 방향 픽셀 길이(P), 직선 (L3)의 픽셀 길이(x) 및 화각(f)을 기초로 실측 거리(D)를 산출할 수 있다. 영상처리부는 제1영상(IM1) 내 임의의 위치에 대한 실측 거리(D)와 유효사거리를 기초로 제1영상(IM1)에 유효사거리 반지름(ER)을 설정할 수 있다. 원의 중심(O)은 제1영상(IM1)의 최하단 가장자리의 중심으로 설정될 수 있다. ... 영상처리부는 유효사거리 반지름(ER) 내의 은폐물에 대해 관심영역(ROI)을 설정할 수 있다. 일 실시예에서, 영상처리부는 랜드마크의 GIS 정보를 이용하여 은폐물의 거리를 산출함으로써 유효사거리 내의 은폐물을 검출할 수 있다. 랜드마크는 빌딩, 산 등 식별 가능한 배경일 수 있다. 도 6을 참조하면, 무인전투차량의 영상처리부는 GIS 정보로부터 제1영상(IM1) 내의 배경인 랜드마크 (예를 들어, 산)(LM')에 대응하는 전방의 랜드마크(LM)의 실측 높이(H1) 및 무인전투차량과 랜드마크(LM)간의 거리(R)를 획득할 수 있다. 영상처리부는 제1영상(IM1) 내에서 랜드마크(LM')의 픽셀 길이(P1)와 은 폐물(OB')의 픽셀 길이(P2)를 산출할 수 있다. 영상처리부는 사전에 저장된 은폐물 정보를 이용하여 은폐 물(OB)의 높이(H2)를 획득할 수 있다. 영상처리부는 은폐물(OB)의 거리(X)를 식 에 의해 산출할 수 있 다. 예를 들어, 랜드마크(LM)의 높이(H1)가 100m, 은폐물(OB)의 높이(H2)가 2m, 랜드마크(LM)의 거리(R)가 1000m, 랜드마크(LM')의 픽셀 길이(P1)가 400pixel, 은폐물(OB')의 픽셀 길이(P2)가 40pixel이면, 식 에 의 해 은폐물의 거리(X)는 5m로 산출될 수 있다."}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "... 영상처리부는 은폐물(OB)이 식별된 경우 식 에 의해 유효사거리 내의 은폐물을 검출하고, 은폐물(OB)이 식별되지 않는 경우 식 에 의해 유효사거리 내의 은폐물을 검출할 수 있다. 영상처리부는 AI를 이용하 여 은폐물(OB)을 식별할 수 있다. 영상처리부는 식 또는 식 를 이용하여 유효사거리 내의 은폐물에 대해 관심영역(ROI)을 설정할 수 있다. 무인전투차량은 이동 플랫폼이므로 불규칙한 노면 및/또는 사격 충격 등의 외란으로 인해 카메라의 진동이 발생하고, 이로 인해 영상 내에서 은폐물의 위치가 급격하게 변경될 수 있다. 이에 따라 관심영역이 은폐물을 벗어날 수 있다. 도 7a는 카메라가 +y방향 및 -x방향으로 진동 및/또는 회전한 경우 관심영역(ROI)이 은폐물 (OB)을 벗어난 예이다. 본 발명의 실시예에 따른 영상처리부는 영상 내에서 카메라의 진동으로 인한 카메 라의 자세변화에 대응하여 관심영역의 위치를 보정함으로써 은폐물에 관심영역을 유지시킬 수 있다. 일 실시예에서, 영상처리부는 영상 내에서 카메라의 진동으로 인한 픽셀 이동량을 산출하여 은폐물을 지정 하는 관심영역의 위치를 역보상함으로써 은폐물에 관심영역을 유지시킬 수 있다. 도 7b는 카메라가 +y방향 및 -x방향으로 진동 및/또는 회전한 경우 산출된 픽셀 이동량을 역방향으로 보상함으로써 은폐물(OB)에 관심영역 (ROI)을 유지시킨 예이다. 카메라의 자세 변화량은 카메라의 물리적 회전량, 즉 카메라의 방향각 변화량으로 표현되고, 카메라의 방향각 변화량은 픽셀 단위의 변위량, 즉 픽셀 이동량으로 변환될 수 있다. 예를 들어, 시간 차를 갖는 인접한 한 쌍의 영상들(예를 들어, 이전영상 및 현재영상) 사이의 시간 간격 동안 카메라의 수평 방향 회전량, 즉 요각(yaw angle) 변화량은 한 쌍의 영상들 간 전역 움직임의 x방향 픽셀 이동량에 대응할 수 있다. 한 쌍의 영상들 사이 의 시간 간격 동안 카메라의 수직 방향 회전량, 즉 피치각(pitch angle) 변화량은 한 쌍의 영상들 간 전역 움직 임의 y방향 픽셀 이동량에 대응할 수 있다. 영상처리부는 제1카메라의 자세 변화량에 대응하는 픽셀 이동량, △m(x,y)을 핀홀 카메라 모델과 하 기 식 및 식 에 의해 산출할 수 있다. ... ... 식 및 에서, △θm는 이전영상 및 현재영상 사이의 시간 간격 동안 측정된 요각 변화량, △ψm는 이전영 상 및 현재영상 사이의 시간 간격 동안 측정된 피치각 변화량, 는 현재영상의 요축 크기, 는 현재영상의 피치축 크기, fx는 요축 화각, fy는 피치축 화각을 나타낸다. 영상처리부는 무인전투차량이 정지된 동안 관심영역의 위치를 보정할 수 있고, 무인전투차량이 이 동 중 동안에도 배경 객체의 이동량을 산출하고 이를 역보상함으로써 관심영역의 위치를 보정할 수 있다. 영상 처리부는 GPS 정보를 활용하여 배경 객체의 이동량을 산출할 수 있다. 일 실시예에서, 영상처리부는 제1영상(IM1) 내에서 은폐물의 추적 정보를 이용하여 은폐물에 관심영역을 유지시킬 수 있다. 영상처리부는 객체 추적 기법에 의해 은폐물을 락온(Lock-on)하여 은폐물을 추적하고, 추적한 은폐물에 대해 관심영역을 지정함으로써 카메라의 회전이나 진동으로 인한 자세 변화에 강건하게 대응할 수 있다. 도 7c는 은폐물(OB)을 락온하고 관심영역(ROI)을 은폐물(OB)에 종속시킴으로써 카메라가 +y방향 및 -x 방향으로 진동 및/또는 회전한 경우에도 관심영역(ROI)을 은폐물(OB)에 유지시킨 예이다. 일 실시예에서, 영상처리부는 검출된 은폐물이 무장장치에 의해 파괴 가능한 은폐물인지 판단하고, 파괴 가능한 은폐물인 경우 화기 조작 및 격발을 위한 제어신호를 제어기로 출력할 수 있다. 무인전투차량 은 제어신호에 따라 무장장치를 제어하여 파괴 가능한 은폐물을 지향 사격할 수 있다. 영상처리부 는 파괴된 은폐물 외의 은폐물에 대해 관심영역을 설정할 수 있다. 이 경우에도 영상처리부는 파괴된 은폐물 외의 은폐물들 중 유효사거리 내 은폐물에만 관심영역을 설정할 수 있다. 영상처리부는 관심영역(ROI) 내에서 은폐물에 은폐되어 있던 객체의 움직임(이동)을 검출할 수 있다. 적 군이 100% 은폐물에 가려져 있는 상황이라면 무인전투차량에 장착된 카메라로는 표적을 찾기가 어렵다. 적군 또 한 은폐물로 인해 시야가 나오지 않아 무인전투차량을 공격할 수 없고, 공격을 하기 위해서는 은폐물에서 잠시 나마 벗어나야 한다. 따라서 본 발명의 실시예는 적군이 공격 또는 다른 은폐물로 이동하기 위하여 순간적으로 은폐물에서 벗어나는 상황을 객체의 움직임으로 검출할 수 있다. 영상처리부는 관심영역에서 객체의 움직임을 검출하고, 객체 움직임 검출을 표적 검출로 판단할 수 있다. 영상처리부는 영상 또는 영상 내 관심영역에서 픽셀값의 변화를 검출하여 관심영역에서 객체의 움직임을 검출할 수 있다. 영상처리부는 관심영역에서 검출된 객체 움직임 영역을 표적을 둘러싸는 영역(MT)(이하, '표적영역'이라 함)으로 설정할 수 있다. 영상처리부는 관심영역 내에서 검출된 객체 움직임 영역의 크기 가 임계값 이상인 경우 표적영역으로 판단할 수 있다. 일 실시예에서, 영상처리부는 차영상 기법 및/또는 상관추적 기법을 이용하여 관심영역에서 객체 움직임을 검출할 수 있다. 차영상은 시간차를 갖는 복수의 제1영상(IM1)들 간의 차영상 또는 시간차를 갖는 복수의 제1영 상(IM1)들의 관심영역(ROI)들 간의 차영상일 수 있다. 일 실시예에서, 영상처리부는 현재시점의 현재영상과 2개의 과거시점(short, long)의 두 개의 과거영상들 을 포함하는 세 개의 영상들로부터 객체 움직임 영역을 검출할 수 있다. 두 개의 과거영상들은 현재영상보다 이 전의 임의의 제1과거영상과 제1과거영상보다 더 이전의 제2과거영상일 수 있다. 예를 들어, 도 8에 도시된 바와 같이, 영상처리부는 (t)시점의 현재영상(C)과 (t-x1)시점의 이전영상(B) 간의 제1차영상(D1) 및 현재영상 (C)과 (t-x2)시점의 이전영상(A) 간의 제2차영상(D0)들을 생성할 수 있다. 객채의 움직임이 있을 경우에 과거의 위치와 현재 위치 차이로 인해 제1차영상(D1)과 제2차영상(D0) 각각에서 픽셀값이 변화한 두 개의 영역들이 검 출될 수 있다. 현재영상(C)의 픽셀값 변화 영역은 제1차영상(D1)과 제2차영상(D2)에서 동일할 것이다. 따라서, 영상처리부는 제1차영상(D1)과 제2차영상(D0) 간의 픽셀값 변화 영역들의 무게중심들 간의 거리가 최소값 을 갖는 영역, 즉 제1차영상(D1)과 제2차영상(D2)에서 중첩하는 픽셀값 변화 영역을 포함하는 최종 차영상(FD) 을 생성할 수 있다. 최종 차영상(FD)의 픽셀값 변화 영역이 현재영상(C)의 객체 움직임 영역으로 결정될 수 있 다. 전술된 실시예는 영상들 간의 차영상으로 설명하고 있으나, 본 발명의 실시예는 이에 한정되지 않고, 영상 들의 관심영역들 간의 차영상을 이용하여 객체 움직임 영역을 결정할 수도 있다. 일 실시예에서, 영상처리부는 현재시점의 현재영상과 1개의 과거시점의 과거영상의 차영상에서 객체 움직 임 영역을 검출할 수 있다. 예를 들어, 영상처리부는 (t)시점의 현재영상의 관심영역과 (t-x1)시점의 과거 영상의 관심영역 간의 차영상에서 픽셀값이 변화한 영역을 객체 움직임 영역으로 검출할 수 있다. 영상처리부는 관심영역의 템플릿을 이용하여 현재영상(C)의 관심영역과의 유사도를 산출함으로써 유사도가 임계값 미만인 경우 관심영역에서 객체의 움직임이 있다고 판단할 수 있다. 유사도는 픽셀값 변화를 기초로 산 출될 수 있다. 관심영역의 템플릿은 이전영상의 관심영역일 수 있다. 예를 들어, 현재영상(C)의 상관추적에 이 용되는 템플릿은 (t-1)시점의 이전영상(B)의 관심영역일 수 있다. 영상처리부는 관심영역의 템플릿을 현재 영상의 관심영역으로 업데이트할 수 있다. 영상처리부는 최종 차영상(FD)을 이용한 객체의 움직임 검출 결과와 상관추적을 이용한 객체의 움직임 검 출 결과를 종합하여 객체의 움직임 영역을 검출할 수 있다. 차영상 기법은 느린 움직임 또는 광축 방향의 움직임의 경우 화소값 변화 검출이 어렵다. 상관추적 기법은 유사 배경 클러터에 의해 화소값 변화 검출이 어렵다. 영상처리부는 차영상 기법 및 상관추적 기법을 함께 사용하여 관심영역 내 객체의 움직임을 보다 정확하게 검출할 수 있다. 영상처리부는 객체의 움직임 검출에 의한 표적이 검출되면, 제어기로 제2카메라가 표적이 검출 된 관심영역(이하, '표적 관심영역'이라 함)을 지향하도록 팬틸트줌을 제어하는 제어신호를 출력할 수 있다. 줌 값은 은폐물의 경계가 영상의 경계를 넘지 않도록 적절하게 설정될 수 있다. 제2카메라는 제어기의 제어신호에 따라 팬틸트줌값을 변경하고 표적 관심영역을 지향하여 제2영상 (IM2)을 획득할 수 있다. 예를 들어, 도 9에 도시된 바와 같이, 제1영상(IM1)에서 표적이 검출되면, 제2카메라 에 의해 표적이 검출된 관심영역(ROI)이 줌인된 제2영상(IM2)이 생성될 수 있다. 이에 따라 은폐물(OB)과 표적영역(MT)은 대략 제2영상(IM2)의 중앙에 위치될 수 있다. 영상처리부는 제2카메라에 의해 획득된 제2영상(IM2)을 분석하고, 제2영상(IM2)으로부터 표적을 인식 및 식별할 수 있다. 영상처리부는 AI를 이용하여 표적을 식별하고, 표적 정보를 검출할 수 있다. 표적 정보는 표적의 종류, 표적이 소지하고 있는 화기의 종류, 상대거리(예를 들어, 은폐물들 간의 상대거리) 등을 포함할 수 있다. 예를 들어, 표적 정보는 아군, 적군, 민간인 등의 객체 식별 정보, 사람, 차량, 비행기, 드론, 전차, 장갑차, 자주포 등의 객체 종류, 권총, 소총, 기관총, 대전차 화기, 대공 화기, 작사포, 곡사포 등 의 객체가 소지한 화기의 종류, 나무, 바위, 풀 숲, 집 등의 은폐물의 종류, 표적의 거리 정보 등을 포함할 수 있다. 영상처리부는 표적 정보를 기초로 표적 위협도를 판단할 수 있다. 예를 들어, 표적이 중화기를 들고 있고 살상 반경인 경우 표적은 위협도 '상'의 매우 위험한 표적이라 판단될 수 있다. 영상처리부는 위협 표적이라고 판단이 되면 운영자에게 경고(알람)를 발생시키고, 자동으로 무장장치(10 1)가 표적을 조준하여 즉시 사격을 가하도록 제어기로 제어신호를 출력할 수 있다. 예를 들어 도 10에 도 시된 바와 같이 영상처리부는 위협 표적의 표적영역(MT)의 경계를 하이라이트로 표시하는 등의 알람을 발 생시키고, 표적영역(MT)에 조준점을 위치시킬 수 있다. 영상처리부는 표적이 은폐물에 다시 숨은 경우 은폐물이 현재 화기로 파괴 가능한지 여부를 판단하고, 은 폐물이 파괴 가능한 경우 도 11에 도시된 바와 같이 화기를 은페물에 의해 가려진 표적영역(MT)으로 고정하고, 즉 은폐물에 조준점을 위치시키고 운영자에게 사격을 가하도록 경고할 수 있다. 은폐물이 파괴 가능하지 않은 경우 표적이 다시 은폐물에서 벗어날 때까지 은폐물에 조준점을 위치시킨 상태로 제2카메라와 화기는 대기 할 수 있다. 영상처리부는 표적을 락온하고, 이동하는 표적을 추적함으로써 자동으로 표적을 조준할 수 있 다. 무인전투차량이 상이한 복수의 화기들을 구비한 경우, 운영자는 은폐물의 종류에 따라 은폐물을 파괴할 수 있는 화기를 선택하여 은폐물의 지향 사격을 지시할 수 있다. 영상처리부는 복수의 관심영역들 각각에 대해 표적을 검출하고, 검출된 표적의 표적정보 및 표적 위협도를 제1영상(IM1)에 표시할 수 있다. 예를 들어, 도 12에 도시된 바와 같이, 영상처리부는 은폐물들(OB1 내지 OB4)을 둘러싸는 관심영역들(ROI1 내지 ROI4), 관심영역들(ROI1 내지 ROI4) 각각에서 검출된 표적영역들(MT1 내 지 MT4), 표적 위협도의 순위(① 내지 ④) 및 표적 정보를 제1영상(IM1)에 표시할 수 있다. 도 12에는 제1영상 (IM1)에 표적 정보로서 소총, 중화기 등의 화기 종류가 표시되어 있다. 영상처리부는 제1영상(IM1)에 도 10 및 도 11에 도시된 바와 같은 알람 정보를 더 표시할 수 있다. 영상처리부는 표적 위협도의 순위에 따 라 표적영역의 하이라이트 색상을 달리 설정할 수 있다. 원격관제센터는 무인전투차량으로부터 제1영상(IM1) 및 표적정보와 표적 위협도를 전송받고, 이를 모니터링 장치의 화면에 표시할 수 있다. 도 13은 본 발명의 일 실시예에 따른 무인전투차량의 표적 검출 방법을 개략적으로 설명하는 흐름도이다. 이하 도 1 내지 도 12를 참조하여 설명한 내용과 중복하는 내용의 상세한 설명은 생략한다. 무인전투차량은 제1카메라에 의해 획득된 제1화각의 제1영상으로부터 적어도 하나의 은폐물을 검출할 수 있다(S31). 무인전투차량은 AI를 이용하여 제1영상으로부터 적어도 하나의 검출된 은폐물을 인지 및 식 별할 수 있다.무인전투차량은 거리측정기, 또는 GIS, GPS 정보 등을 이용하여 제1영상에서 유효사거리 내 은폐물을 검출 할 수 있다. 일 실시예에서, 무인전투차량은 도로 정보를 이용하여 영상 내에 유효사거리 반지름을 갖는 원 을 설정함으로써 유효사거리 내의 은폐물을 검출할 수 있다. 일 실시예에서, 무인전투차량은 랜드마크의 실 측 사이즈(높이 및 거리), 은폐물의 실측 사이즈(높이) 및 영상 내 랜드마크와 은폐물의 높이에 대응하는 픽셀 길이를 이용하여 은페물의 실측 거리를 산출함으로써 유효사거리 내의 은폐물을 검출할 수 있다. 무인전투차량은 은폐물을 포함하는 관심영역을 설정할 수 있다(S32). 무인전투차량은 적어도 하나의 은 폐물 중 유효사거리 내 은폐물에 대해서만 관심영역을 설정할 수 있다. 일 실시예에서, 무인전투차량은 제1 카메라의 진동으로 인한 픽셀 이동량을 산출하여 관심영역의 위치를 보상함으로써 은폐물에 관심영역을 유 지시킬 수 있다. 일 실시예에서, 무인전투차량은 은폐물의 추적 정보를 이용하여 은폐물에 관심영역을 유지 시킬 수 있다. 무인전투차량은 관심영역 내에서 은폐물에 은폐되어 있던 표적을 검출할 수 있다(S33). 무인전투차량은 관심영역 내에서 은폐물 주변의 픽셀값 변화를 기초로 객체 움직임을 검출함으로써 관심영역에서 표적을 검출할 수 있다. 무인전투차량은 검출된 객체 움직임 영역을 표적영역으로 설정하고, 제2카메라가 표적을 지향하도 록 제2카메라의 팬틸트줌을 제어할 수 있다. 제2카메라는 제1카메라보다 화각이 작은 제2화각으로 제2영상을 획 득할 수 있다. 무인전투차량은 검출된 객체 움직임 영역의 크기가 임계값 이상인 경우 표적영역으로 설정할 수 있다. 무인전투차량은 제2카메라가 획득한 제2영상으로부터 표적 식별에 의해 표적 정보를 검출하고, 표적 정보를 기초로 표적 위협도를 판단할 수 있다(S34). 표적 정보는 표적의 종류, 표적이 소지하고 있는 화기의 종류, 상 대거리 등을 포함할 수 있다. 무인전투차량은 AI 기법을 이용하여 표적을 식별할 수 있다. 무인전투차량은 위협 표적의 조준 또는 표적의 재은폐에 따른 은폐물 파괴 가능 여부를 판단하고(S35), 위 협 표적이거나 은폐물 파괴가 가능한 경우 사격(S36)하고, 그렇지 않은 경우 제2카메라와 화기를 대기시킬 수 있다(S37). 무인전투차량은 제1영상(IM1)에 표적 위협도를 기초로 한 표적의 순위, 표적 정보, 위협 표적의 알람 등을 표시할 수 있다. 종래의 전투차량은 사람이 차량에 탑승하여 유인으로 운용이 되며, 특히 감시 정찰 및 무장의 운용은 차량 외부 에서 운용하여 외부의 공격에 매우 취약한 형태이다. 특히 적의 매복 지대나 진지를 돌파하는 경우에 적이 은폐 하고 있어 탐지하기가 어렵고 무장을 외부에서 운용해 적의 집중 공격으로 생존하기가 어렵다. 본 발명의 실시예는 적군이 공격 또는 다른 은폐물로 이동하기 위하여 순간적으로 은폐물에서 벗어나는 상황을 영상 정보로서 획득하여 객체를 인식할 수 있다. 본 발명의 실시예는 서로 다른 종류의 카메라들(예를 들어, 서 로 다른 화각을 갖는 카메라들)을 연동하여 객체를 인식하고, 화기의 종류, 객체와의 거리 등을 종합적으로 판 단하여 위협 표적을 판단할 수 있다. 본 발명의 실시예는 위협 표적이라고 판단이 되면 자동으로 표적을 조준하 며, 조준이 일치하거나 은폐물이 보유중인 화기에 파괴 되는 경우에는 사격 명령을 내리도록 하여 효율적인 전 투가 가능하다. 또한 본 발명의 실시예는 은폐물에 은폐한 객체의 정보를 파악하여 지휘통제 체계로 전달할 수 있고, 운용자는 전달된 정보를 활용해 적을 효율적으로 제압할 수 있다. 전술된 실시예에서는 하나의 영상처리부에서 제1카메라의 영상 및 제2카메라의 영상을 분석 및 처리하고 있으나, 다른 실시예에서, 제1카메라의 영상을 분석 및 처리하는 영상처리부와 제2카메라의 영상을 분석 및 처 리하는 영상처리부가 별개로 구비될 수 있다. 전술된 실시예에서는 검출용의 광각 카메라와 식별용의 PTZ 카메라와 같이 서로 다른 종류의 카메라들을 이용하 고 있으나, 다른 실시예에서 하나의 카메라에서 와이드(wide) 화각으로 획득한 영상에서 은폐물 및 표적을 검출 하고, 줌인한 상태에서 획득한 영상에서 은폐물 및 표적을 식별할 수도 있다. 카메라와 표적의 거리에 따라 와 이드 화각에서 획득한 영상에서 은폐물 및 표적이 식별될 수도 있다. 전술된 실시예에서는 카메라의 영상 분석에 의한 은폐 객체를 검출하고 있으나, 다른 실시예에서 무인전투차량 은 적외선 센서, 라이더 센서, 레이더 센서 등을 더 포함하고, 드론 등과 협업으로 객체의 정보를 획득할 수 있다. 본 발명의 실시예에 따른 표적 검출 방법은 컴퓨터로 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 기록매체는 컴퓨터 시스템에 의해 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광데이터 저장장치 등이 있다. 또한, 컴퓨터가 읽을 수 있는 기록매체는 네트워크로 연 결된 컴퓨터 시스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 그리고, 본 발명을 구현하기 위한 기능적인(functional) 프로그램, 코드 및 코드 세그먼트들은 본 발명이 속하"}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "는 기술분야의 프로그래머들에 의해 용이하게 추론될 수 있다. 본 발명의 일 측면들은 첨부된 도면에 도시된 실시예들을 참고로 설명되었으나, 이는 예시적인 것에 불과하며,"}
{"patent_id": "10-2022-0000376", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "당해 기술분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 수 있을 것이다. 따라서, 본 발명의 진정한 보호 범위는 첨부된 청구 범위에 의해서만 정해져야 할 것이다."}
{"patent_id": "10-2022-0000376", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 무인전투차량을 개략적으로 도시한 블록도이다. 도 2는 일 실시예에 따른 도 1의 영상장치를 개략적으로 도시한 블록도이다. 도 3 및 도 4는 일 실시예에 따른 은폐물 검출 및 관심영역 설정을 설명하는 도면들이다. 도 5는 일 실시예에 따른 도로를 이용하여 유효 사거리 내 은폐물을 검출하는 방법을 설명하는 도면이다. 도 6은 일 실시예에 따른 랜드마크를 이용하여 유효 사거리 내 은폐물을 검출하는 방법을 설명하는 도면이다. 도 7a 내지 도 7c는 일 실시예에 따른 관심영역의 위치를 보정하는 방법을 설명하기 위한 도면들이다. 도 8 및 도 9는 일 실시예에 따른 표적을 검출하는 방법을 설명하기 위한 도면들이다. 도 10 및 도 11은 일 실시예에 따른 표적의 사격을 설명하기 위한 도면들이다. 도 12는 일 실시예에 따른 무인전투차량이 운용자에게 제공하는 영상을 나타낸 도면이다. 도 13은 본 발명의 일 실시예에 따른 무인전투차량의 표적 검출 방법을 개략적으로 설명하는 흐름도이다."}
