{"patent_id": "10-2022-0190441", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0107633", "출원번호": "10-2022-0190441", "발명의 명칭": "인공 지능 조리기기", "출원인": "상명대학교 천안산학협력단", "발명자": "김상오"}}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "케이스;상기 케이스 내에 배치되는 내솥;상기 내솥에 열을 가하기 위해 동작하는 히터;상기 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서;상기 내솥의 온도를 센싱하는 온도 센서;상기 내솥 내의 가스를 센싱하는 가스 센서;상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트하는 컨트롤러;를 포함하는 하는 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 내솥 내의 재료와의 거리를 센싱하는 거리 센서;를 더 포함하고, 상기 이미지 센서, 상기 온도 센서, 상기 가스 센서, 상기 거리 센서의 센서 데이터와, 상기 기계 학습 기반의인공지능 추론 모델에 기초하여, 상기 조리 코스 정보를 생성하거나, 업데이트하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 컨트롤러는,제1 목표 조리물 정보가 입력되는 경우, 상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며,제2 목표 조리물 정보가 입력되는 경우, 상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 컨트롤러는,제1 재료가 상기 내솥에 투입되는 경우, 상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며,제2 재료가 상기 내솥에 투입되는 경우, 상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 컨트롤러는,제1 재료가 제1 볼륨으로 상기 내솥에 투입되는 경우, 상기 이미지 센서, 상기 온도 센서, 상기 가스 센서, 및공개특허 10-2024-0107633-3-상기 거리 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며,상기 제1 재료가 제2 볼륨으로 상기 내솥에 투입되는 경우, 상기 이미지 센서, 상기 온도 센서, 상기 가스센서, 및 상기 거리 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리코스 정보에 기초하여 구동하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 거리 센서는, 깊이 카메라를 포함하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 내솥 내에 배치되는 반죽 날개;상기 반죽 날개에 회전력을 제공하는 모터;를 더 포함하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 컨트롤러는,상기 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 상기 히터가 동작하도록 제어하되,상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론모델에 기초하여, 상기 반죽 모드, 상기 발효 모드, 또는 상기 굽기 모드 중 적어도 하나의 기간을 가변하거나,적어도 하나의 기간을 생략하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 컨트롤러는,상기 내솥에 투입되는 반죽의 양에 따라, 상기 반죽 모드, 상기 발효 모드, 또는 상기 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서,상기 컨트롤러는,상기 이미지 센서, 상기 온도 센서, 상기 가스 센서, 상기 거리 센서의 센서 데이터을 입력으로 하여, 다층 퍼셉트론(multi layer perceptron)을 통해, 반죽 데이터, 발효 데이터, 굽기 데이터, 상태 데이터를 출력하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "케이스;상기 케이스 내에 배치되는 내솥;상기 내솥에 열을 가하기 위해 동작하는 히터;상기 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서;상기 내솥의 온도를 센싱하는 온도 센서;상기 내솥 내의 가스를 센싱하는 가스 센서;공개특허 10-2024-0107633-4-제1 목표 조리물 정보가 입력되는 경우, 상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 목표 조리물 정보가 입력되는 경우, 상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동하도록 제어하는컨트롤러;를 포함하는 하는 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 내솥 내의 재료와의 거리를 센싱하는 거리 센서;를 더 포함하고, 상기 이미지 센서, 상기 온도 센서, 상기 가스 센서, 상기 거리 센서의 센서 데이터와, 상기 기계 학습 기반의인공지능 추론 모델에 기초하여, 상기 조리 코스 정보를 생성하거나, 업데이트하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 내솥 내에 배치되는 반죽 날개;상기 반죽 날개에 회전력을 제공하는 모터;를 더 포함하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 컨트롤러는,상기 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 상기 히터가 동작하도록 제어하되,상기 이미지 센서, 상기 온도 센서, 및 상기 가스 센서의 센서 데이터와, 상기 기계 학습 기반의 인공지능 추론모델에 기초하여, 상기 반죽 모드, 상기 발효 모드, 또는 상기 굽기 모드 중 적어도 하나의 기간을 가변하거나,적어도 하나의 기간을 생략하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 컨트롤러는,상기 내솥에 투입되는 반죽의 양에 따라, 상기 반죽 모드, 상기 발효 모드, 또는 상기 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략하는 것인 인공 지능 조리기기."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 인공 지능 조리기기는, 케이스와, 케이스 내에 배치되는 내솥과, 내솥에 열을 가하 기 위해 동작하는 히터와, 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서와, 내솥의 온도를 센싱하는 온도 센 서와, 내솥 내의 가스를 센싱하는 가스 센서와, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트하는 컨트롤러를 포함한다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공 지능 조리기기에 관한 것이며, 더욱 상세하게는 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있는 인공 지능 조리기기에 관한 것이다. 본 개시는 2022년도 정부(교육부)의 재원으로 대학혁신지원사업의 지원을 받아 수행된 연구에 관한 것이다(과제 관리 번호는 2022대학혁신-068)."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "조리기기는 음식물을 수납하여 밀폐한 후, 동작 버튼을 누르게 되면, 내부의 열 또는 전자파를 이용하여 음식 물을 가열하는 장치이다. 이를 위해, 조리기기는, 내부의 열 발생을 위한 히터 또는 전자파 발생을 위한 마그네트론 등을 구비한다. 한편, 조리기기 중 종래의 제빵기는, 전기, 가스 오븐 방식으로, 대량 생산 방식으로 빵을 제공한다. 한편, 가정용 소형 제빵기와 관련하여, 선행문헌 1(한국등록특허번호 제10-0740693호)은, 건강발효 기능을 갖는 제빵기 및 그 구동 방법을 개시한다. 특히, 선행문헌 1은, 일정한 양의 재료를 넣어주면 반죽부터 발효를 거처서 빵굽기까지 가능하다. 그러나, 선행문헌 1에 의하면, 빵을 만드는 전 과정을 이미 정해진 중량에 대해, 정해진 시간과 온도를 통해서 제어가 이뤄지기 때문에, 정해진 중량을 벗어 나는 경우, 또는 정해진 레시피를 벗어나는 경우, 빵이 덜 익거나, 빵이 타는 등, 빵이 올바르게 구워지지 않는 단점이 있다."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시가 해결하고자 하는 과제는, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있는 인 공 지능 조리기기를 제공하는 것이다. 본 개시가 해결하고자 하는 다른 과제는, 재료의 다양한 양 또는 다양한 재료에도 인공 지능 기반의 조리 방식 에 의해 안정적으로 조리를 수행할 수 있는 인공 지능 조리기기를 제공하는 것이다."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 인공 지능 조리기기는, 케이스와, 케이스 내에 배치되는 내솥과, 내솥에 열을 가하 기 위해 동작하는 히터와, 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서와, 내솥의 온도를 센싱하는 온도 센서와, 내솥 내의 가스를 센싱하는 가스 센서와, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기 계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트하는 컨트롤러를 포함 한다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 내솥 내의 재료와의 거리를 센싱하는 거리 센서를 더 포함하고, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트할 수 있다. 한편, 컨트롤러는, 제1 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이 터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공 지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 한편, 컨트롤러는, 제1 재료가 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 재료가 내솥 에 투입되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 한편, 컨트롤러는, 제1 재료가 제1 볼륨으로 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 가스 센서, 및 거 리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제1 재료가 제2 볼륨으로 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 가스 센서, 및 거리 센서 의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 한편, 거리 센서는, 깊이 카메라를 포함할 수 있다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 내솥 내에 배치되는 반죽 날개와, 반죽 날개에 회전 력을 제공하는 모터를 더 포함할 수 있다. 한편, 컨트롤러는, 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 히터가 동작하도록 제 어하되, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초 하여, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략 할 수 있다.한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나 의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 한편, 컨트롤러는, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터을 입력으로 하여, 다층 퍼셉 트론(multi layer perceptron)을 통해, 반죽 데이터, 발효 데이터, 굽기 데이터, 상태 데이터를 출력할 수 있다. 본 개시의 다른 실시예에 따른 인공 지능 조리기기는, 케이스와, 케이스 내에 배치되는 내솥과, 내솥에 열을 가 하기 위해 동작하는 히터와, 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서와, 내솥의 온도를 센싱하는 온도 센서와, 내솥 내의 가스를 센싱하는 가스 센서와, 제1 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데 이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동하도록 제어하 는 컨트롤러를 포함한다. 한편, 본 개시의 다른 실시예에 따른 인공 지능 조리기기는, 내솥 내의 재료와의 거리를 센싱하는 거리 센서를 더 포함하고, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추 론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트할 수 있다. 한편, 본 개시의 다른 실시예에 따른 인공 지능 조리기기는, 내솥 내에 배치되는 반죽 날개와, 반죽 날개에 회 전력을 제공하는 모터를 더 포함할 수 있다. 한편, 컨트롤러는, 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 히터가 동작하도록 제 어하되, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초 하여, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략 할 수 있다. 한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나 의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 인공 지능 조리기기는, 케이스와, 케이스 내에 배치되는 내솥과, 내솥에 열을 가하 기 위해 동작하는 히터와, 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서와, 내솥의 온도를 센싱하는 온도 센서와, 내솥 내의 가스를 센싱하는 가스 센서와, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기 계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트하는 컨트롤러를 포함 한다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 내솥 내의 재료와의 거리를 센싱하는 거리 센서를 더 포함하고, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식 에 의해 조리 코스 정보를 생성하거나, 업데이트할 수 있게 된다. 한편, 컨트롤러는, 제1 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이 터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공 지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 이에 의해, 목표 조리물 정보에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 제1 재료가 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 재료가 내솥 에 투입되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 이에 의해, 재료의 종류에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 제1 재료가 제1 볼륨으로 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 가스 센서, 및 거 리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여구동하며, 제1 재료가 제2 볼륨으로 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 가스 센서, 및 거리 센서 의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 이에 의해, 재료의 볼륨 또는 양에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행 할 수 있게 된다. 한편, 거리 센서는, 깊이 카메라를 포함할 수 있다. 이에 따라, 깊이 카메라 기반의 거리 정보를 센싱할 수 있 게 된다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 내솥 내에 배치되는 반죽 날개와, 반죽 날개에 회전 력을 제공하는 모터를 더 포함할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 히터가 동작하도록 제 어하되, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초 하여, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략 할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나 의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터을 입력으로 하여, 다층 퍼셉 트론(multi layer perceptron)을 통해, 반죽 데이터, 발효 데이터, 굽기 데이터, 상태 데이터를 출력할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 본 개시의 다른 실시예에 따른 인공 지능 조리기기는, 케이스와, 케이스 내에 배치되는 내솥과, 내솥에 열을 가 하기 위해 동작하는 히터와, 내솥 내에 재료의 이미지를 캡쳐하는 이미지 센서와, 내솥의 온도를 센싱하는 온도 센서와, 내솥 내의 가스를 센싱하는 가스 센서와, 제1 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데 이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동하도록 제어하 는 컨트롤러를 포함한다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된 다. 특히, 목표 조리물 정보에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된 다. 한편, 본 개시의 다른 실시예에 따른 인공 지능 조리기기는, 내솥 내의 재료와의 거리를 센싱하는 거리 센서를 더 포함하고, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추 론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트할 수 있다. 이에 따라, 인공 지능 기반의 조리 방 식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 본 개시의 다른 실시예에 따른 인공 지능 조리기기는, 내솥 내에 배치되는 반죽 날개와, 반죽 날개에 회 전력을 제공하는 모터를 더 포함할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 히터가 동작하도록 제 어하되, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초 하여, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략 할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나 의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다."}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 개시를 보다 상세하게 설명한다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 단순히 본 명세서 작성의 용이함만이 고려 되어 부여되는 것으로서, 그 자체로 특별히 중요한 의미 또는 역할을 부여하는 것은 아니다. 따라서, 상기 \"모 듈\" 및 \"부\"는 서로 혼용되어 사용될 수도 있다. 도 1은 본 개시의 일 실시예에 따른 인공 지능 조리기기의 사시도이고, 도 2 내지 도 5는 도 1의 설명에 참조되 는 도면이다. 도 1을 참조하면, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 상부 케이스(UCS)와 하부 케이스 (DCS)를 포함하는 케이스(CSE)와, 상부 케이스(UCS)의 제1 측에 형성된 디스플레이를 포함한다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 상부 케이스(UCS)의 제2 측에, 복수의 센서를 구비하는 제1 센서 케이스와, 상부 케이스(UCS)의 제3 측에, 적어도 하나의 센서를 구비하는 제2 센서 케 이스를 구비한다. 상부 케이스(UCS)는, 하부 케이스(DCS)의 일측에 부착되는 힌지(도 3의 HG)를 통해, 상하 방향 등으로 개폐될 수 있다. 제1 센서 케이스와 제2 센서 케이스의 내부에 대해서는, 도 2를 참조하여 기술한다. 도 2는, 제1 센서 케이스 내부와 제2 센서 케이스의 내부를 도시한 도면이다. 도면을 참조하면, 상부 케이스(UCS)의 제2 측에 배치되는 제1 센서 케이스 내에는, 인공 지능 조리기기 의 내부에 탈부착 되는 내솥(도 3의 132) 내에 재료의 이미지를 캡쳐하는 이미지 센서와, 내솥 내의 재료와의 거리를 센싱하는 거리 센서가 배치될 수 있다. 한편, 상부 케이스(UCS)의 제3 측에에 배치되는 제2 센서 케이스 내에는, 내솥 내의 가스를 센싱하는 가스 센서가 배치될 수 있다. 한편, 가스 센서는, 센싱의 정확도를 위해, 다른 센서와 이격되어 배치되는 것이 바람직하다. 이에, 본 개시에서는, 가스 센서는, 별도의 제2 센서 케이스 내에 배치되고, 이미지 센서와, 거 리 센서가 제1 센서 케이스 내에 배치되는 것으로 한다. 이에 따라, 제1 센서 케이스의 사이즈가, 제2 센서 케이스 보다 더 큰 것이 바람직하다. 한편, 이미지 센서와 거리 센서가, 각각 렌즈를 구비하는 경우, 이미지 센서의 해상도가 더 높 은 것이 바람직하므로, 이미지 센서의 렌즈 사이즈가, 거리 센서의 렌즈 사이즈 보다 더 큰 것이 바 람직하다. 한편, 이미지 센서에서 센싱된 내솥 내에 재료의 이미지에 기초하여, 컨트롤러는, 굽기의 정도 를 확인할 수 있다. 한편, 거리 센서에서 센싱된 센서 데이터에 기초하여, 컨트롤러는, 반죽의 부풀어 오름을 측정하여 발 효의 정도 및 굽기의 크기 변화를 확인할 수 있다. 한편, 가스 센서에서 센싱된 센서 데이터에 기초하여, 컨트롤러는, 발효 모드 또는 굽기 모드에서 발 생하는 가스 또는 가스의 변화량을 확인할 수 있다. 한편, 거리 센서의 센싱 정확도를 위해, 거리 센서는, 이미지 센서 보다, 내솥(도 3의 132)에 더 가깝게 배치되는 것이 바람직하다. 한편, 상부 케이스(UCS) 중 제1 센서 케이스 주변에는, 내부 확인 위한 가시창 또는 윈도우가 배치 될 수 있다. 한편, 상부 케이스(UCS) 중 가시창 주변에는, 내솥 내의 기체를 토출하기 위한 환기구가 형성 될 수 있다. 도 3은 상부 케이스(UCS)가 개방되어 내부의 내솥을 도시하는 도면이다. 도면을 참조하면, 상부 케이스(UCS)는, 하부 케이스(DCS)의 일측에 부착되는 힌지(HG)를 통해, 개폐될 수 있다. 한편, 본 개시의 실시예에 따른 인공 지능 조리기기는, 내솥 내에 배치되는 반죽 날개와, 반죽 날개에 회전력을 제공하는 모터(FN)를 더 포함할 수 있다. 반죽 날개는, 모터(FN)의 회전에 의해, 회전하게 되며, 내솥 내부의 재료에 대한 반죽 모드를 수행할 수 있게 된다. 도 4는 내솥이 분리되는 것을 도시하는 도면이다. 도면을 참조하면, 하부 케이스(DCS)의 내부의 공간(도 4의 OPa)에, 내솥이 부착 또는 탈착된다. 내솥(13 2)이 탈부착 가능하므로, 분리하여 세척이 용이하게 된다. 한편, 내솥은 스테인레스 재질로 구현될 수 있다. 도 5는 상부 케이스(UCS)가 개방된 조리기기의 상면도이다. 도면을 참조하면, 내솥이 분리된 상태에서, 하부 케이스(DCS)의 내부의 공간(OPa)에, 온도 센서와, 히터가 배치된다. 온도 센서는, 내솥의 외부에 부착되어, 내솥의 온도를 센싱한다. 히터는, 내솥의 외부에 부착되어, 내솥의 온도를 조절할 수 있다. 한편, 온도 조절을 원활하기 위해, 히터의 배치 높이가, 온도 센서의 배치 높이 보다 더 낮은 것이 바람직하다. 한편, 히터는, 열전 소자(ThermoElectric Module)를 구비할 수 있으며, 대략 다양한 온도 범위로, 온도를 조절할 수 있다. 한편, 내솥 내부에서 발효 동작이 수행되어, 내솥 내부에서 이산화탄소(CO2) 등의 기체가 발생하는 경우, 가스 센서는, 유입되는 이산화탄소 등의 가스를 센싱할 수 있다. 도 6은 본 개시의 일 실시예에 따른 인공 지능 조리기기의 내부 블록도의 일예이다. 도면을 참조하면, 본 개시의 실시예에 따른 인공 지능 조리기기는, 이미지 센서, 온도 센서, 거 리 센서, 가스 센서, 도어 센서, 메모리, 히터, 컨트롤러, 조명 장치, 디 스플레이, 통신 장치, 전력공급장치, 배터리, 모터(FN)을 구비할 수 있다. 인공 지능 조리기기는, 복수의 센서 장치를 구비한다. 복수의 센서 장치는, 이미지 센서, 온도 센서, 거리 센서, 가스 센서, 도어 센서 등을 포함할 수 있다. 도 2에서 도시한 바와 같이, 가스 센서의 센싱 정확도를 위해, 가스 센서는, 제2 센서 케이스 내에 배치되고, 제2 센서 케이스 내에 배치되고, 이미지 센서와, 거리 센서는 제1 센서 케이스 내에 배치될 수 있다. 한편, 온도 센서와 도어 센서는, 케이스(CSE) 내부에 배치될 수 있다. 도어 센서는, 상부 케이스(UCS)의 개폐를 센싱할 수 있다. 센싱 신호는 컨트롤러로 전송될 수 있다. 이미지 센서는, 내솥 내에 재료의 이미지를 촬영한다. 이를 위해, 이미지 센서의 동작 중에, 내 부에 배치되는 조명 장치가 동작하여 광을 출력한하는 것이 바람직하다. 이미지 센서에서 촬영된 이미지는은, 연속하여, 컨트롤러로 입력될 수 있다. 온도 센서는, 케이스(CSE) 내부에 배치되며, 내솥의 온도를 센싱할 수 있다. 한편, 온도 센서는, 내솥의 습도를 센싱할 수도 있다. 온도 센서에서 센싱된 온도 정보 또는 습도 정보는 컨트롤러로 입력된다. 거리 센서는, 내솥 내의 재료와의 거리를 센싱할 수 있다. 이를 위해, 거리 센서는, 깊이 카메라를 포함할 수 있다. 예를 들어, 거리 센서는, IR 신호 방식 또는 구조광 방식 등 다양한 방식에 의해 구현될 수 있다. 가스 센서는, 내솥에 배출되는 가스를 센싱할 수 있다. 구체적으로, 가스 센서는, 이신화탄소 (CO2)의 배출량을 센싱할 수 있다. 가스 센서에서 센싱된 정보는 컨트롤러로 입력될 수 있다. 메모리는, 인공 지능 조리기기의 동작에 필요한 데이터를 저장할 수 있다. 예를 들어, 메모리는, 내부 재료에 대한 다양한 이미지를 저장할 수 있다. 또는 메모리는, 내부 재료 에서 기포가 발생되는 영상을 저장할 수 있다. 히터는, 내솥의 외면에 부착되며, 설정 온도에 대응하여, 다양한 온도에 대응하는 열을 출력할 수 있 다. 구체적으로, 히터는, 히팅 동작과 냉각 동작을 수행할 수 있다. 예를 들어, 히터는, 열전 소자(ThermoElectric Module)를 구비하여, 다양한 온도 범위 사이로, 온도를 조 절할 수 있다. 이에 따라, 내솥의 온도는, 대략 4℃ 내지 60℃ 사이의 온도 범위 이내에서 가변될 수 있게 된다. 입력 장치는, 적어도 하나이 버튼을 구비할 수 있다. 버튼의 동작 등에 기초하여, 다양한 정보가 입력될 수 있다. 예를 들어, 입력 장치는, 조리 시작 버튼, 조리 정지 버튼, 조리물 선택 버튼, 조리 시간 선택 버튼 등을 구비할 수 있다. 한편, 입력 장치에서의 입력 신호는, 컨트롤러로 입력될 수 있다. 조명 장치는, 케이스(CSE) 내부에 배치되어, 내솥 방향으로 광을 출력할 수 있다. 특히, 이미지 센서 의 동작시에만 광을 출력하는 것이 바람직하다. 이에 따라, 전력 소비를 저감할 수 있게 된다. 디스플레이는, 인공 지능 조리기기의 동작 상태를 표시할 수 있다. 한편, 디스플레이는, 터치 입력이 가능한 터치 디스플레이로 구현될 수 있으며, 터치 입력에 따라, 다양한 입력이 가능하게 된다. 통신 장치는, 이동 단말기 또는 서버와 통신을 수행할 수 있다. 구체적으로, 통신 장치는, 이동 단말기 또는 서버와 유선 또는 무선으로 데이터를 교환할 수 있다. 특히, 통신 장치는, 블루투스 통신 또는 와이파이 통신을 통해, 무선으로 이동 단말기 또는 서버 와 데이터를 교환할 수 있다. 한편, 통신 장치는, 발효가 종료되는 경우, 발효 완료 통지를 이동 단말기 또는 서버로 전송할 수 있다. 이에 따라, 이동 단말기 또는 서버에서 정확하고 간편하게 발효 완료 통지를 수신할 수 있 게 된다. 한편, 전력공급장치는, 인공 지능 조리기기이 내부의 각 장치로 전력을 공급할 수 있다. 이를 위해, 전력공급장치는, 교류 전원을 직류 전원으로 변환하는 ac/dc 컨버터 또는 직류 전원의 레벨을 가변하는 dc/dc 컨버터를 구비할 수 있다. 배터리는, 전력공급장치로 저장된 전력을 공급할 수 있다. 컨트롤러는, 인공 지능 조리기기 내부의 각 장치들을 제어할 수 있다. 예를 들어, 컨트롤러는, 히터를 제어하여, 내솥의 온도가 상승하도록 제어할 수 있다. 다른 예로, 컨트롤러는, 모터(FN)를 제어하여, 반죽 날개의 회전을 통해, 내부 재료에 대한 반죽이 수행되도록 제어할 수 있다. 한편, 컨트롤러는, 인공 지능 조리기기에서 조리 동작을 수행하도록 제어할 수 있다. 학습 모듈은, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터를 이용 하여 머신 러닝을 할 수 있다. 이러한 머신 러닝을 통해, 학습 모듈은 메모리에 저장된 데이터 베이 스를 업데이트 할 수 있다. 학습 모듈의 학습 방법으로는 자율학습(unsupervised learning)과 지도학습(supervised learning) 중 어 느 것이나 사용될 수 있다. 인식 모듈은 학습 모듈에 의해 학습된 데이터에 기반하여, 조리 상태에 따른 레벨을 판정할 수 있다. 조리 상태의 판정은, 내솥 안에 투입된 재료에 따라 기 설정된 복수의 조리 상태 레벨(Level)로 분류하는 작업일 수 있다. 한편, 컨트롤러는, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기 반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트한다. 이에 따라, 인공 지능 기반 의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 이를 위해, 컨트롤러는 러닝 머신에 의한 학습 및 인식을 수행할 수 있으며, 이를 위해, 학습 모듈과 인식 모듈을 포함할 수 있다. 한편, 컨트롤러는, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 조리 코스 정보를 생성하거나, 업데이트할 수 있다. 이에 따 라, 인공 지능 기반의 조리 방식에 의해 조리 코스 정보를 생성하거나, 업데이트할 수 있게 된다. 한편, 컨트롤러는, 제1 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 목표 조리물 정보가 입력되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센 서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있 다. 이에 의해, 목표 조리물 정보에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있 게 된다. 한편, 컨트롤러는, 제1 재료가 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제2 재료가 내솥에 투입되는 경우, 이미지 센서, 온도 센서, 및 가스 센서의 센 서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있 다. 이에 의해, 재료의 종류에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된 다. 한편, 컨트롤러는, 제1 재료가 제1 볼륨으로 내솥에 투입되는 경우, 이미지 센서, 온도 센서 , 가스 센서, 및 거리 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보에 기초하여 구동하며, 제1 재료가 제2 볼륨으로 내솥에 투입되는 경우, 이 미지 센서, 온도 센서, 가스 센서, 및 거리 센서의 센서 데이터와, 기계 학습 기반의 인공 지능 추론 모델에 기초하여, 제2 조리 코스 정보에 기초하여 구동할 수 있다. 이에 의해, 재료의 볼륨 또는 양 에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 내솥에 반죽이 투입되는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 히터가 동작하도록 제어하되, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기반 의 인공지능 추론 모델에 기초하여, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거 나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적 어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방 식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터을 입력으로 하여, 다층 퍼셉트론(multi layer perceptron)을 통해, 반죽 데이터, 발효 데이터, 굽기 데이터, 상태 데이터를 출력할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 도 7a는 본 개시와 관련한 조리기기의 동작 방법을 도시한 도면이다. 특히, 도 7a는 선행 문헌 1의 동작 방법을 도시한 도면이다. 도면을 참조하면, 내부 용기에 시판 우유와 유산균 등의 요구르트 재료가 투입 된 이후, 입력 장치를 통해, 요 구르트나 청국장을 선택하는 지 여부를 판단하고(S100), 해당하는 경우, 조리 시간을 설정한다(S110). 다음, 시작 버튼의 동작에 따라(S120), 히터를 온 한다(S130). 이때 히터의 온 시간이 최대 온 시간을 초과하는 지 여부를 판단하고(S140), 해당하지 않는 경우, 온도 센서의 감지 온도가 발효 온도를 초과하는 지 여부를 판단한다(S150). 한편, 제140 단계(S140)에서, 히터의 온 시간이 최대 온 시간을 초과하지 않는 경우, 히터를 온한다(S160). 제160 단계(S160) 이후, 히터의 오프 시간이 최대 오프 시간을 초과하는 지 여부를 판단하고(S170), 해당하는 경우, 온도 센서의 감지 온도가 발효 온도 미만인지 여부를 여부를 판단한다(S180). 해당하는 경우, 제130 단계 (S130)가 수행되고, 해당되지 않는 경우, 제190 단계(S190)가 수행된다. 한편, 제150 단계(S150)에서, 해당되지 않는 경우, 제190 단계(S190)가 수행된다. 제190 단계(S190)에서, 카운터된 시간이 설정 시간 이상인 지 여부를 판단하고(S190), 해당하는 경우, 종료 부 저를 동작시킨다(S200). 한편, 해당하지 않는 경우, 제130 단계(S130)가 수행된다. 도 7a의 방식에 따르면, 조리 과정이, 히터와 온도 센서에 기초하여, 정해진 시간과 온도를 통해서 제어가 이뤄 지기 때문에, 정해진 중량을 벗어 나는 경우, 또는 정해진 레시피를 벗어나는 경우, 조리가 덜 되거나, 조리가 지나치게 수행되는 등의 단점이 있다. 도 7b는 본 개시의 일 실시예에 따른 인공 지능 조리기기의 온도 타이밍도의 일예이다. 도면을 참조하면, 본 개시의 일 실시예에 따른 인공 지능 조리기기는, 반죽 모드가 수행되는 제1 기간 (T1x), 발효 모드가 수행되는 제2 기간(T2x), 굽기 모드가 수행되는 제3 기간(T3x)으로 구분되어 동작할 수 있 다. 도면에서는, 각 모드 대비 온도 그래프(GPx)를 예시한다. 반죽 모드가 수행되는 제1 기간(T1x)은, 반죽 날개가 동작하는 구간으로서, 내솥 내부의 온도는 일정 범위를 유지할 수 있다. 발효 모드가 수행되는 제2 기간(T2x)은, 반죽 날개가 동작하지 않고 히터가 제1 모드로 동작하는 구 간으로서, 초기에 온도가 급격히 상승하고, 완만하게 하강한 이후, 대략 소정 밤위를 유지할 수 있다. 굽기 모드가 수행되는 제3 기간(T3x)은, 히터가 제1 모드 보다 전력 소비가 더 큰 제2 모드로 동작하는 구 간으로서, 초기에 온도가 상당히 급격히 상승하고, 완만하게 하강한 이후, 대략 소정 범위를 유지할 수 있다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기 내의 컨트롤러는, 내솥에 반죽이 투입되 는 경우, 반죽 모드, 발효 모드, 굽기 모드에서 히터가 동작하도록 제어할 수 있다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기 내의 컨트롤러는, 이미지 센서, 온도 센 서, 및 가스 센서의 센서 데이터와, 기계 학습 기반의 인공지능 추론 모델에 기초하여, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 예를 들어, 반죽 모드 기간을 증대시키거나, 발효 모드 기간을 생략하고, 반죽 모드에서 바로 굽기 모드로 진입 하도록 제어할 수 있다. 다른 예로, 반죽 모드 기간을 생략하고, 바로 발효 모드가 수행되도록 제어할 수 있다. 한편, 본 개시의 일 실시예에 따른 인공 지능 조리기기 내의 컨트롤러는, 내솥에 투입되는 반죽 의 양에 따라, 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기 간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 예를 들어, 내솥에 투입되는 반죽의 양이 작아질수록, 반죽 모드 기간을 감소시킬 수 있다. 또는, 내솥에 투입되는 반죽의 양이 커질수록, 발효 모드 기간을 증대시킬 수 있다. 도 8은 본 개시의 일 실시예에 따른 인공 지능 조리기기의 동작 방법을 도시한 도면이다. 도면을 참조하면, 본 개시의 일 실시예에 따른 인공 지능 조리기기 내의 컨트롤러는, 입력 장치(13 5)를 통해, 제1 목표 조리물 정보가 입력되는 지 여부를 판단하고(S810), 해당하는 경우, 히터를 제1 조리 코스 정보에 기초하여 구동하도록 제어할 수 있다(S815). 예를 들어, 컨트롤러는, 제1 목표 조리물 정보가, 쿠키인 경우, 컨트롤러는, 쿠키를 위한 제1 조리 코스 정보에 기초하여 구동하도록 제어할 수 있다. 이때, 컨트롤러는, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기 반의 인공지능 추론 모델에 기초하여, 제1 조리 코스 정보 내의 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어 도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 제1 조리 코스 정보 내의 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 제810 단계(S810)에서, 입력 장치를 통해, 제1 목표 조리물 정보가 입력되지 않는 경우, 컨트롤러는, 제2 목표 조리물 정보가 입력되는 지 여부를 판단하고(S820), 해당하는 경우, 히터를 제2 조리 코스 정보 에 기초하여 구동하도록 제어할 수 있다(S825). 예를 들어, 컨트롤러는, 제2 목표 조리물 정보가, 빵인 경우, 컨트롤러는, 빵을 위한 제2 조리 코스 정보에 기초하여 구동하도록 제어할 수 있다. 이때, 컨트롤러는, 이미지 센서, 온도 센서, 및 가스 센서의 센서 데이터와, 기계 학습 기 반의 인공지능 추론 모델에 기초하여, 제2 조리 코스 정보 내의 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어 도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 한편, 컨트롤러는, 내솥에 투입되는 반죽의 양에 따라, 제2 조리 코스 정보 내의 반죽 모드, 발효 모드, 또는 굽기 모드 중 적어도 하나의 기간을 가변하거나, 적어도 하나의 기간을 생략할 수 있다. 이에 따라, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 도 9는 인공 신경망의 일례를 도시한 개요도이다. 도면을 참조하면, 머신 러닝(Machine Learning)의 일종인 딥러닝(Deep Learning) 기술은 데이터를 기반으로 다 단계로 깊은 수준까지 내려가 학습을 수행한다. 딥러닝(Deep learning)은, 히든 레이어들을 차례로 거치면서 복수의 데이터들로부터 핵심적인 데이터를 추출하 는 머신 러닝(Machine Learning) 알고리즘의 집합을 나타낼 수 있다. 딥러닝 구조는 인공 신경망(ANN)을 포함할 수 있으며, 예를 들어, 딥러닝 구조는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경망(DNN)으로 구성될 수 있다. 도 9를 참조하면, 인공 신경망(ANN)은 입력 레이어(Input Layer)(LYa), 히든 레이어(Hiddent Layer)(LYb,LYc) 및 출력 레이어(Output Layer)(LYd)를 포함할 수 있다. 다중의 히든 레이어(hidden layer)를 갖는 것을 DNN(Deep Neural Network)이라고 한다. 각 레이어는 복수의 노드들을 포함하고, 각 레이어는 다음 레이어와 연관되어 있다. 노드들은 웨이트(weight)를 가지고 서로 연결될 수 있다. 제1 히든 레이어(Hidden Layer 1)(LYb)에 속한 임의의 노드로부터의 출력은, 제2 히든 레이어(Hidden Layer 2)(LYc)에 속하는 적어도 하나의 노드의 입력이 된다. 이때 각 노드의 입력은 이전 레이어의 노드의 출력에 웨 이트(weight)가 적용된 값일 수 있다. 웨이트(weight)는 노드간의 연결 강도를 의미할 수 있다. 딥러닝 과정은 적절한 웨이트(weight)를 찾아내는 과정으로도 볼 수 있다. 메모리는, 조리 상태 검출을 위한 센서 데이터, 심층신경망(DNN)을 학습하기 위한 데이터를 저장할 수 있 다. 이때의 센서 데이터는, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터를 포함할 수 있다. 한편, 메모리는, 심층신경망(DNN) 구조를 이루는 웨이트(weight), 바이어스(bias)들이 저장될 수 있다. 한편, 컨트롤러 내의 학습 모듈은, 이미지 센서, 온도 센서, 가스 센서, 거리 센서 의 센서 데이터를 트레이닝(training) 데이터로 사용하여 학습(learning)을 수행할 수 있다. 즉, 학습 모듈은 조리 상태 인식 또는 판정할 때마다 그 판정 결과를 데이터 베이스에 추가하여 웨이트 (weight)나 바이어스 등의 심층신경망(DNN) 구조를 업데이트(update)하거나, 소정 횟수의 트레이닝 데이터가 확 보된 후에 확보된 트레이닝 데이터로 학습 과정을 수행하여 웨이트(weight) 등 심층신경망(DNN) 구조를 업데이 트할 수 있다. 본 발명의 실시예에 따른 조리 기기는, 통신 장치를 통하여, 이미지 센서, 온도 센서, 가 스 센서, 거리 센서의 센서 데이터를 통신망에 연결된 서버 또는 이동 단말기로 전송하고, 서버 또는 이동 단말기로부터 머신 러닝과 관련된 데이터를 수신할 수 있다. 이 경우에, 조리 기기는, 서버 또는 이동 단말기로부터 수신된 머신 러닝과 관련된 데이터에 기 초하여 인공 신경망을 업데이트(update)할 수 있다 또는, 본 발명의 실시예에 따른 조리 기기는, 이미지 센서, 온도 센서, 가스 센서, 거리 센서의 센서 데이터를 이용하여, 컨트롤러에서 심층 신경망을 이용한 학습을 수행하고, 머신 러닝과 관련된 데이터를 도출할 수 있다. 한편, 컨트롤러는, 이미지 센서 데이터(DTa), 온도 센서 데이터(DTb), 가스 센서 데이터(DTc), 거리 센서 데이터(DTd)의 센서 데이터를 입력으로 하여, 다층 퍼셉트론(multi layer perceptron)을 통해, 반죽 데이터 (DOa), 발효 데이터(DOb), 굽기 데이터(DOc), 상태 데이터(DOd)를 출력할 수 있다. 이에 따라, 센서 데이터에 기초하여 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 이미지 센서 데이터(DTa), 온도 센서 데이터(DTb), 가스 센서 데이터(DTc), 거리 센서 데이터(DTd)의 센서 데이터에 기초하여, 신규의 조리 코스 정보를 생성하거나 기존의 조리 코스 정보를 업데이 트할 수 있다. 한편, 컨트롤러는, 이미지 센서 데이터(DTa), 온도 센서 데이터(DTb), 가스 센서 데이터(DTc), 거리 센서 데이터(DTd), 목표 조리물 데이터(DTe)를 입력으로 하여, 다층 퍼셉트론(multi layer perceptron)을 통해, 반 죽 데이터(DOa), 발효 데이터(DOb), 굽기 데이터(DOc), 상태 데이터(DOd)를 출력할 수 있다. 이에 따라, 센서 데이터 및 목표 조리물 데이터에 기초하여, 인공 지능 기반의 조리 방식에 의해 안정적으로 조리를 수행할 수 있게 된다. 한편, 컨트롤러는, 이미지 센서 데이터(DTa), 온도 센서 데이터(DTb), 가스 센서 데이터(DTc), 거리 센서 데이터(DTd)와, 목표 조리물 데이터(DTe)에 기초하여, 신규의 조리 코스 정보를 생성하거나 기존의 조리 코스 정보를 업데이트할 수 있다. 도 10 내지 도 12는 도 8의 설명에 참조되는 도면이다. 도 10은 온도 그래프(GRb)와 가스 센서 데이터 그래프(GRa)를 예시한다. 도면을 참조하면, 온도 그래프(GRb)는, 도 7b의 온도 그래프(GPx)에 대응할 수 있다. 이에 따라, 온도 그래프(GRb)는, 반죽 모드가 수행되는 제1 기간(T1x), 발효 모드가 수행되는 제2 기간(T2x), 굽기 모드가 수행되는 제3 기간(T3x)으로 구분될 수 있다. 한편, 가스 센서 데이터 그래프(GRa)는, 로우 레벨을 유지하다가, 발효 모드가 수행되는 제2 기간(T2x) 중의 TP1 시점부터 TP2 시점까지 급격히 상승하게 된다. 이는, 발효 모드에 따라, 이산화탄소 등의 가스가 발생하기 때문이다. 한편, 굽기 모드가 수행되는 제3 기간(T3x)이 시작되는 TP3 시점부터 TP5 시점까지, 온도 그래프(GRb)는 급격히 상승하며, 그 이후, 온도가 하강하여 일정 범위를 유지한다. 한편, TP2 시점 부터 TP4 시점까지, 가스 센서 데이터 그래프(GRa)는, 대략 일정하다가, TP4 시점부터 다시 상 승하게 된다. 이는, 굽기 모드가 수행되는 제3 기간(T3x)이 시작되는 TP3 시점 부터의 온도 상승으로 인하여, TP3 시점 이후 의 TP4 시점부터 가스 배출량이 증대되기 때문이다. 한편, 온도 그래프(GRb)의 TP5의 피크 시점에 대응하여, 가스 센서 데이터 그래프(GRa)의 TP6 시점에, 가스 배 출량이 피크로 나타나며, 그 이후, TP7 까지 대략 일정하게 나타날 수 있다. 도 10을 참조하면, 조리 코스 동작 중에, 온도 센서의 센서 데이터 외에, 가스 센서의 가스 데이터를 활용하면, 보다 정확한 조리 코스 동작이 가능할 수 있게 된다. 특히, 가스 배출양 등을 활용하므로, 조리물의 현재 상태 등을 보다 더 정확하게 파악할 수 있게 된다. 도 11은, 쿠키 조리시의 각 종 센서 데이터를 도시하는 도면이다. 도면을 참조하면, GR1은 이미지 센서의 센서 데이터 중 청색광 센서 데이터를 나타내며, GR2는 온도 센서 의 센서 데이터를 나타내며, GR3은 거리 센서의 센서 데이터를 나타내며, GR4는 이미지 센서의 센서 데이터 중 녹색광 센서 데이터를 나타내며, GR5는 가스 센서의 센서 데이터를 나타내며, GR6은 이미 지 센서의 센서 데이터 중 적색광 센서 데이터를 나타낸다. GR1 내지 GR6은, 각각 반죽 모드의 기간(Ta), 발효 모드의 기간(Tb), 굽기 모드의 기간(Tc) 동안의, 변화를 나 타낸다. 이러한 GR1 내지 GR6은, 설정된 양이 아닌 비규격의 반죽에서 조리할 경우의, 그래프 패턴을 나타낸다. 이러한 그래프 패턴에 기초하여, 컨트롤러는, 신규의 조리 코스 정보를 생성하거나, 기존의 조리 코스 정 보를 업데이트할 수 있다. 한편, 컨트롤러는, 이러한 그래프 패턴에 기초하여, 발효 모드의 기간(Tb)을 생략하거나, 상당히 단축하도 록 제어할 수 있다. 도 12는 생성된 다양한 조리 코스 정보를, 조리 기기의 오디오 출력 장치를 통해, 사운드로서 출력하는 것 을 예시한다. 도면을 참조하면, 도 12의 (a)는 제1 조리 코스에 대한 정보를 사운드로 출력하며, 도 12의 (b)는 제2 조 리 코스에 대한 정보를 사운드로 출력하며, 도 12의 (c)는 제3 조리 코스에 대한 정보를 사운드로 출력하는 것을 예시한다. 이에 따라, 설정된 조리 코스 정보를 사용자가 직관적으로 인식할 수 있게 된다. 이와 달리, 조리 기기는, 이동 단말기 또는 서버에, 도 12의 (a) 내지 (c) 중 어느 하나의 생성 된 조리 코스 정보를 무선으로 전송하는 것도 가능하다. 이상에서는 본 개시의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시예에 한"}
{"patent_id": "10-2022-0190441", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2022-0190441", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 인공 지능 조리기기의 사시도이다. 도 2 내지 도 5는 도 1의 설명에 참조되는 도면이다.도 6은 본 개시의 일 실시예에 따른 인공 지능 조리기기의 내부 블록도의 일예이다. 도 7a는 본 개시와 관련한 조리기기의 동작 방법을 도시한 도면이다. 도 7b는 본 개시의 일 실시예에 따른 인공 지능 조리기기의 온도 타이밍도의 일예이다. 도 8은 본 개시의 일 실시예에 따른 인공 지능 조리기기의 동작 방법을 도시한 도면이다. 도 9는 인공 신경망의 일례를 도시한 개요도이다. 도 10 내지 도 12는 도 8의 설명에 참조되는 도면이다."}
