{"patent_id": "10-2024-7029515", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0170905", "출원번호": "10-2024-7029515", "발명의 명칭": "채널 추정을 위한 송신 공간 정보", "출원인": "퀄컴 인코포레이티드", "발명자": "하오, 첸시"}}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신을 위한 장치로서,메모리; 및상기 메모리에 커플링된 프로세서를 포함하고, 상기 프로세서는,네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하도록;상기 송신 공간 정보에 기초하여 상기 네트워크 엔티티로부터 기준 신호를 수신하도록; 그리고상기 수신된 기준 신호 및 상기 송신 공간 정보에 기초하여 채널 상태 정보(channel state information, CSI)를상기 네트워크 엔티티로 송신하도록 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 송신 공간 정보의 표시를 수신하고, 상기 기준 신호를 수신하고, 상기 CSI를 송신하도록구성된 트랜시버를 추가로 포함하고, 상기 송신 공간 정보는 상기 네트워크 엔티티와 연관된 안테나 아키텍처의하나 이상의 안테나 엘리먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 표시하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 송신 공간 정보의 표시를 수신하기 위해, 상기 프로세서는 상기 송신 공간 정보를 식별하는 커버 코드 구성을 수신하도록 추가로 구성되고;상기 기준 신호를 수신하기 위해, 상기 프로세서는 상기 커버 코드 구성에 기초하여 상기 기준 신호를 수신하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 커버 코드 구성은 상기 송신 공간 정보의 커버 코드를 식별하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 프로세서는,상기 수신된 기준 신호 및 상기 커버 코드에 기초하여 채널 추정을 결정하는 것; 또는상기 커버 코드에 적어도 부분적으로 기초하여 상기 CSI를 결정하는 것 중 적어도 하나를 하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서, 상기 송신 공간 정보는, 그룹들로 배열된 채널 상태 정보 기준 신호(channel stateinformation reference signal, CSI-RS) 포트들에 대응하는 커버 코드를 식별하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 송신 공간 정보의 표시를 수신하기 위해, 상기 프로세서는 상기 송신 공간 정보와 연관된머신 학습 모듈을 표시하는 신호를 수신하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2024-0170905-3-제7항에 있어서, 상기 머신 학습 모듈은 커버 코드 구성을 통해 표시되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 프로세서는,상기 머신 학습 모듈 및 상기 송신 공간 정보를 사용하는 상기 수신된 기준 신호에 기초하여 채널 추정을 결정하는 것; 또는상기 송신 공간 정보 및 상기 머신 학습 모듈을 사용하여 상기 CSI를 결정하는 것 중 적어도 하나를 하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 채널 추정을 결정하기 위해, 상기 프로세서는 상기 머신 학습 모듈을 사용하여 안테나 아키텍처와 연관된 복수의 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하도록 추가로 구성되고, 상기머신 학습 모듈의 입력은 상기 수신된 기준 신호를 포함하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 송신 공간 정보의 표시를 수신하기 위해, 상기 프로세서는 상기 기준 신호에 대한 준 공동위치(quasi co-location, QCL) 구성을 표시하는 신호를 수신하도록 추가로 구성되고, 상기 QCL 구성은 송신공간 관계를 상기 기준 신호에 대한 QCL 타입으로서 식별하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 프로세서는, 상기 기준 신호가 상기 송신 공간 관계의 QCL 타입을 갖는 것에 응답하여상기 수신된 기준 신호에 기초하는 상기 송신 공간 정보를 결정하도록 추가로 구성되는, 무선 통신을 위한장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 프로세서는,머신 학습 모듈 및 상기 송신 공간 정보를 사용하는 상기 수신된 기준 신호에 기초하여 채널 추정을 결정하는것; 또는상기 머신 학습 모듈을 사용하는 상기 송신 공간 정보에 적어도 부분적으로 기초하여 상기 CSI를 결정하는 것중 적어도 하나를 하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 프로세서는 상기 수신된 기준 신호의 측정된 송신 공간 관계에 기초하여 복수의 머신 학습 모듈들 중의 상기 머신 학습 모듈을 선택하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서, 상기 송신 공간 정보의 표시를 수신하기 위해, 상기 프로세서는, 머신 학습 모듈에 대한 훈련데이터와 동일한 분포를 갖는 채널을 통해 상기 기준 신호가 전달된다는 것을 표시하는 분포 내 구성(in-distribution configuration)을 수신하도록 추가로 구성되고, 상기 훈련 데이터는 상기 송신 공간 정보를 표시하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 프로세서는,상기 머신 학습 모듈에 대한 훈련 데이터를 수신하도록 - 상기 분포 내 구성은 상기 머신 학습 모듈에 대해 사용할 상기 훈련 데이터를 추가로 표시함 -;상기 훈련 데이터를 사용하여 상기 머신 학습 모듈을 훈련하도록; 그리고공개특허 10-2024-0170905-4-상기 훈련된 머신 학습 모듈을 사용하여 상기 CSI를 결정하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "무선 통신을 위한 장치로서,메모리; 및프로세서를 포함하고, 상기 프로세서는,상기 장치와 연관된 송신 공간 정보의 표시를 출력하도록,상기 송신 공간 정보에 기초하여 기준 신호를 출력하도록, 그리고상기 기준 신호 및 상기 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 획득하도록 구성되는, 무선 통신을위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 송신 공간 정보의 표시를 출력하고, 상기 기준 신호를 출력하고, 상기 CSI를 획득하도록구성된 트랜시버를 추가로 포함하고, 상기 송신 공간 정보는 상기 장치와 연관된 안테나 아키텍처의 하나 이상의 안테나 엘리먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 표시하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 송신 공간 정보의 표시를 출력하기 위해, 상기 프로세서는 상기 송신 공간 정보를 식별하는 커버 코드 구성을 출력하도록 추가로 구성되고;상기 기준 신호를 출력하기 위해, 상기 프로세서는 상기 커버 코드 구성에 기초하여 상기 기준 신호를 출력하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 커버 코드 구성은 상기 송신 공간 정보의 커버 코드를 식별하는, 무선 통신을 위한장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제19항에 있어서, 상기 송신 공간 정보는, 그룹들로 배열된 채널 상태 정보 기준 신호(CSI-RS) 포트들에 대응하는 커버 코드를 식별하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제17항에 있어서, 상기 송신 공간 정보의 표시를 출력하기 위해, 상기 프로세서는 상기 송신 공간 정보와 연관된 머신 학습 모듈을 표시하는 신호를 출력하도록 추가로 구성되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 머신 학습 모듈은 커버 코드 구성을 통해 표시되는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제17항에 있어서,상기 프로세서는, 복수의 머신 학습 모듈들을 표시하고 복수의 커버 코드들 중의 커버 코드와 상기 머신 학습모듈들 각각 사이의 연관성을 표시하는 제1 신호를 출력하도록 추가로 구성되고;상기 송신 공간 정보의 표시를 출력하기 위해, 상기 프로세서는, 상기 송신 공간 정보를 표시하는, 상기 커버코드 중 적어도 하나와 연관된 상기 머신 학습 모듈들 중 적어도 하나를 식별하는 제2 신호를 출력하도록 추가로 구성되는, 무선 통신을 위한 장치.공개특허 10-2024-0170905-5-청구항 25 제17항에 있어서, 상기 송신 공간 정보의 표시를 출력하기 위해, 상기 프로세서는 상기 기준 신호에 대한 준 공동 위치(QCL) 구성을 표시하는 신호를 출력하도록 추가로 구성되고, 상기 QCL 구성은 송신 공간 관계를 상기 기준 신호에 대한 QCL 타입으로서 식별하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제17항에 있어서, 상기 송신 공간 정보의 표시를 출력하기 위해, 상기 프로세서는, 머신 학습 모듈에 대한 훈련데이터와 동일한 분포를 갖는 채널을 통해 상기 기준 신호가 전달된다는 것을 표시하는 분포 내 구성을 출력하도록 추가로 구성되고, 상기 훈련 데이터는 상기 송신 공간 정보를 표시하는, 무선 통신을 위한 장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 프로세서는 상기 머신 학습 모듈에 대한 훈련 데이터를 출력하도록 추가로 구성되고, 상기 분포 내 구성은 상기 머신 학습 모듈에 대해 사용할 상기 훈련 데이터를 추가로 표시하는, 무선 통신을 위한장치."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "사용자 장비에 의한 무선 통신의 방법으로서,네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하는 단계;상기 송신 공간 정보에 기초하여 상기 네트워크 엔티티로부터 기준 신호를 수신하는 단계; 및상기 수신된 기준 신호 및 상기 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 상기 네트워크 엔티티로 송신하는 단계를 포함하는, 사용자 장비에 의한 무선 통신의 방법."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제30항에 있어서, 상기 송신 공간 정보는 상기 네트워크 엔티티와 연관된 안테나 아키텍처의 하나 이상의 안테나 엘리먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 표시하는, 방법."}
{"patent_id": "10-2024-7029515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "네트워크 엔터티에 의한 무선 통신의 방법으로서,상기 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 출력하는 단계;상기 송신 공간 정보에 기초하여 기준 신호를 출력하는 단계; 및상기 기준 신호 및 상기 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 획득하는 단계를 포함하는, 네트워크 엔터티에 의한 무선 통신의 방법."}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시내용의 소정 양태들은 송신 공간 정보에 기초한 채널 추정을 위한 기법들을 제공한다. 사용자 장비에 의 한 무선 통신의 예시적인 방법은, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하는 단계; 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호를 수신하는 단계; 및 수신된 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 네트워크 엔티티로 송신하는 단계를 포함한다."}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 개시내용의 양태들은 무선 통신들에 관한 것으로, 더 구체적으로는, 채널 추정 및/또는 채널 상태 정보 보고 를 위한 기법들에 관한 것이다. 무선 통신 시스템은 텔레포니(telephony), 비디오, 데이터, 메시징, 브로드캐스트 또는 다른 유사한 타입의 서 비스와 같은 다양한 원격통신 서비스를 제공하도록 널리 배치되어 있다. 이러한 무선 통신 시스템은 사용 가능 한 시스템 리소스(예를 들어, 대역폭, 송신 전력 또는 다른 리소스)을 다수의 사용자와 공유함으로써 그 사용자 들과의 통신을 지원할 수 있는 다중 액세스 기술을 채용할 수 있다. 다중 액세스 기술은, 몇 가지 예를 들자면, 코드 분할, 시분할, 주파수 분할, 직교 주파수 분할, 단일 캐리어 주파수 분할, 또는 시분할 동기 코드 분할 중 임의의 것에 의존할 수 있다. 이들 및 다른 다중 액세스 기술은 상이한 무선 디바이스가, 도시 레벨, 국가 레벨, 지역 레벨, 및 심지어 글로벌 레벨로 통신할 수 있게 하는 공통 프로토콜을 제공하기 위해 다양한 전기통신 표준에서 채택되어 왔다.무선 통신 시스템이 수년에 걸쳐 큰 기술적 진보를 이루었지만, 난제들이 여전히 존재한다. 예를 들어, 복잡하 고 동적인 환경은 무선 송신기와 무선 수신기 사이의 신호를 여전히 감쇠 또는 차단하여, 한정된 무선 채널 리 소스의 사용을 관리 및 최적화하기 위해 사용되는 다양한 확립된 무선 채널 측정 및 보고 메커니즘을 약화시킬 수 있다. 결과적으로, 다양한 과제를 극복하기 위해 무선 통신 시스템의 추가적인 개선에 대한 필요성이 존재 한다. 본 개시내용의 시스템들, 방법들 및 디바이스들 각각은 몇몇 양태들을 갖고, 이들 중 어떠한 단일 양태도 본 발 명의 바람직한 속성들에 단독으로 관여하지 않는다. 이러한 논의를 고려한 후에, 그리고 특히 \"발명을 실시하 기 위한 구체적인 내용\"으로 명명된 섹션을 읽은 후에, 당업자는, 본 개시내용의 특징들이 감소된 주파수 대역 폭을 갖는 포트들을 식별하는 송신 공간 정보를 포함하는 이점들을 어떻게 제공하는지를 이해할 것이다. 본 개시내용에 설명된 청구대상의 특정 양태들은 사용자 장비(user equipment, UE)에 의한 무선 통신 방법으로 구현될 수 있다. 본 방법은 대체적으로, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하는 단계; 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호를 수신하는 단계; 및 수신된 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(channel state information, CSI)를 네트워크 엔티티로 송신하는 단계를 포함한다. 본 개시내용에서 설명된 주제의 특정 양태들은 네트워크 엔티티에 의한 무선 통신을 위한 방법에서 구현될 수 있다. 본 방법은 대체적으로, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 출력하는 단계; 송신 공간 정보에 기초하여 기준 신호를 출력하는 단계; 및 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CS I)를 획득하는 단계를 포함한다. 본 개시내용에서 설명되는 본 발명의 특정 양태는 무선 통신을 위한 장치로 구현될 수 있다. 본 장치는 대체적 으로 메모리 및 메모리에 커플링되는 프로세서를 포함한다. 프로세서는, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하도록; 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호를 수신하도록; 그리고 수신된 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 네트워크 엔티티로 송신하도록 구성된 다. 본 개시내용에서 설명되는 본 발명의 특정 양태는 무선 통신을 위한 장치로 구현될 수 있다. 본 장치는 대체적 으로 메모리 및 메모리에 커플링되는 프로세서를 포함한다. 프로세서는, 장치와 연관된 송신 공간 정보의 표시 를 출력하도록; 송신 공간 정보에 기초하여 기준 신호를 출력하도록, 그리고 기준 신호 및 송신 공간 정보에 기 초하여 채널 상태 정보(CSI)를 획득하도록 구성된다. 본 개시내용에서 설명되는 본 발명의 특정 양태는 무선 통신을 위한 장치로 구현될 수 있다. 본 장치는 대체적 으로, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하기 위한 수단; 송신 공간 정보에 기초하여 네 트워크 엔티티로부터 기준 신호를 수신하기 위한 수단; 및 수신된 기준 신호 및 송신 공간 정보에 기초하여 채 널 상태 정보(CSI)를 네트워크 엔티티로 송신하기 위한 수단을 포함한다. 본 개시내용에서 설명되는 본 발명의 특정 양태는 무선 통신을 위한 장치로 구현될 수 있다. 본 장치는 대체적 으로, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 출력하기 위한 수단; 송신 공간 정보에 기초하여 기 준 신호를 출력하기 위한 수단; 및 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 획득하기 위한 수단을 포함한다. 본 개시내용에서 설명되는 본 발명의 특정 양태는 컴퓨터 판독가능 매체로 구현될 수 있다. 컴퓨터 판독가능 매체는 저장된 명령들을 갖고, 명령들은, 장치에 의해 실행될 때, 장치로 하여금 동작들을 수행하게 하고, 동작 들은, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수신하는 것; 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호를 수신하는 것; 및 수신된 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보 (CSI)를 네트워크 엔티티로 송신하는 것을 포함한다. 본 개시내용에서 설명되는 본 발명의 특정 양태는 컴퓨터 판독가능 매체로 구현될 수 있다. 컴퓨터 판독가능 매체는 저장된 명령들을 갖고, 명령들은, 장치에 의해 실행될 때, 장치로 하여금 동작들을 수행하게 하고, 동작 들은, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 출력하는 것; 송신 공간 정보에 기초하여 기준 신호 를 출력하는 것; 및 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 획득하는 것을 포함한다. 앞서 언급된 그리고 관련된 목적들의 이행을 위해, 하나 이상의 양태들은, 이후에 충분히 설명되며 청구항들에 서 특별히 지적되는 특징들을 포함한다. 하기 설명 및 첨부된 도면들은 하나 이상의 양태들의 특정한 예시적인 특징들을 상세히 기술한다. 그러나, 이 특징들은, 다양한 양태들의 원리들이 채용될 수 있는 다양한 방식들 중 일부만을 나타낸다."}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시내용의 양태들은 채널 추정을 위한 장치들, 방법들, 프로세싱 시스템들, 및 컴퓨터 판독가능 매체들을 제공한다. 무선 통신 네트워크들(예컨대, 5G 뉴 라디오(New Radio, NR) 시스템들 또는 다른 무선 시스템들)은 적응형 통신 들을 위해 사용자 장비(UE)로부터의 채널 상태 정보(CSI) 피드백을 사용할 수 있다. 네트워크 엔티티(예컨대, 기지국)는 UE로부터의 CSI 피드백에 응답하여 UE에서 소정의 통신 파라미터들을 조정할 수 있다. 예를 들어, 다양한 변조 스킴들 및 채널 코딩 레이트를 이용한 링크 적응(예컨대, 적응형 변조 및 코딩 및/또는 전력 제 어)이 소정의 통신 채널들에 적용될 수 있다. 채널 상태 추정 목적들을 위해, UE는 기준 신호(예컨대, CSI 기 준 신호(CSI-RS))를 측정하도록 그리고 CSI-RS 측정치들에 기초하여 다운링크 채널 상태를 추정하도록 구성될 수 있다. UE는 추정된 채널 상태를 CSI의 형태로 네트워크에 보고할 수 있으며, 이는 링크 적응에 사용될 수 있다. CSI는 BS와 UE 사이의 통신 링크의 채널 속성들을 표시할 수 있다. CSI는, 예를 들어, 통신 링크를 가 로지르는 신호의 산란, 페이딩(fading) 및 경로손실의 효과를 표현할 수 있다. 소정 경우들에서, 네트워크 엔티티(예컨대, 기지국(BS))는 많은 수의 안테나 엘리먼트들(예컨대, 100개 초과의 안테나 엘리먼트들)을 갖는 안테나 어레이를 가질 수 있다. 예를 들어, 네트워크 엔티티는, 예를 들어, 홀로그 램 다중 입력 다중 출력(multiple-input multiple-output, MIMO) 통신들을 위해 그리고/또는 재구성가능 지능 형 표면(reconfigurable intelligent surface, RIS)과 같은 프로그래밍가능 반사 표면에 10,000개 이상의 안테 나 엘리먼트들을 가질 수 있다. 일부 예들에 따르면, 네트워크 엔티티는, 많은 수의 트랜시버 유닛(TxRU)들, 예를 들어, 32개 초과의 TxRU들과 함께 배치될 수 있다. TxRU는 안테나 어레이 내의 물리적 안테나 엘리먼트들 의 그룹과 연관된 빔포밍(예컨대, 진폭 및 위상 제어)을 나타낼 수 있다. TxRU는 안테나 어레이 내의 하나 이 상의 안테나 엘리먼트들에 대응할 수 있다. 소정 경우들에서, 안테나 포트(또는 단순히 포트)가 TxRU를 지칭할 수 있다. 네트워크 엔티티에 배치된 많은 수의 안테나 엘리먼트들 및/또는 TxRU들은, 라디오 유닛으로부터 사 용자들을 향한 상이한 방향들로 다중 방사 패턴들을 스티어링하는 것과 같은, 빔포밍 및/또는 다중 사용자 MIMO 를 용이하게 할 수 있다. 소정의 무선 통신 네트워크들(예컨대, 5G 뉴 라디오(NR) 시스템)에서, 소정 수의 안테나 포트들(예컨대, TxRU들)은 리소스 블록당 동일한 수의 리소스 엘리먼트들을 점유할 수 있으며, 여기서 리소스 엘리먼트는 서브 캐리어(예컨대, 다수의 연속적인 서브캐리어들)를 나타내고, 리소스 블록은 소정 수의 리소스 엘리먼트들(예컨 대, 12개의 리소스 엘리먼트들)이다. 각각의 안테나 포트는 리소스 엘리먼트와 연관될 수 있다. 5G NR 시스템 들은 최대 32개의 안테나 포트들을 갖는 안테나 아키텍처들을 갖는 네트워크 엔티티를 지원할 수 있다. 그러한 구성 하에서, UE는 동일한 수의 리소스 엘리먼트들을 점유하는 최대 32개의 안테나 포트들 상에서 채널 추정을 수행할 수 있다. UE에서의 채널 추정 프로세싱 복잡도는 포트들과 연관된 주파수 대역폭에 비례할 수 있다. 포트들의 수가 증가함에 따라, UE는 채널 추정 및/또는 CSI 보고를 위해 포트들과 연관된 증가하는 주파수 대역 폭을 프로세싱하는 과제를 맡을 수 있다. 소정 경우들에서, UE는 네트워크 엔티티와 연관된 많은 수의 포트들 및 대응하는 안테나 엘리먼트들과 연관된 대응하는 주파수 대역폭을 프로세싱할 능력을 갖지 못할 수 있다. 본 개시내용의 양태들은 채널 추정 및/또는 CSI 보고와 연관된 송신 공간 정보를 사용하기 위한 방법들 및 장치 를 제공한다. 송신 공간 정보는 안테나 아키텍처의 안테나 엘리먼트들에 대한 TxRU들의 맵핑을 표시할 수 있다. 하나 이상의 예들에 따르면, 본 명세서에 추가로 설명된 바와 같이, 네트워크 엔티티는 소정의 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 (예를 들어, UE로) 전송할 수 있고, UE는 송신 공간 정보를 사용하여 채널 추정 및/또는 CSI를 결정할 수 있다. 송신 공간 정보는 리소스 블록과 연관된 커버 코드를 식별할 수 있 으며, 여기서 P개의 포트들이 리소스 블록당 L개의 리소스 엘리먼트(resource element, RE)들에 맵핑된다. 커 버 코드는 진폭 및 위상 제어와 같은, 신호에 적용되는 빔포밍을 표시할 수 있다. 리소스 엘리먼트들의 수(L) 는 포트들의 수 미만인데, 예를 들어, 여기서 {P, L} = {32, 8} 또는 {128, 32}이다. 일부 경우들에서, 커버 코드는 상이한 리소스 블록들 상에서 상이할 수 있고, CSI-RS는 총 N개의 리소스 블록들 중 K개의 리소스 블록 들 상에서 송신된다. 다른 경우들에서, 커버 코드는 다수의 리소스 블록들 또는 전체 주파수 대역에 걸쳐 있는 데, 예를 들어, 리소스 블록당 L개의 RE들을 갖는 총 N개의 리소스 블록들 중 K개의 리소스 블록들을 점유할 수 있다. 그러한 커버 코드는 전체 주파수 대역에 걸쳐 총 K*L개의 RE들 상에서 P개의 포트들을 다중화하는 것을 용이하게 할 수 있고, UE는 모든 N 개의 리소스 블록들 상에서 P개의 포트들의 채널을 복구할 수 있다. 일부 경우들에서, UE는 송신 공간 정보에 기초하여 채널 추정 및/또는 CSI를 결정하기 위해 머신 학습을 사용할 수 있다.본 명세서에 설명된 송신 공간 정보는, 채널 추정을 수행하고/하거나 CSI를 결정하고 CSI-RS 오버헤드를 감소시 키기 위한 머신 학습 모듈의 사용으로 CSI-RS 오버헤드 감소를 용이하게 할 수 있다. 송신 공간 정보는 머신 학습 모듈을 훈련, 선택, 및/또는 구성하는 데 사용될 수 있다. 일부 경우들에서, 송신 공간 정보는, P개의 포트들이 리소스 블록당 L개의 리소스 엘리먼트들에 맵핑하는 것을 표시할 수 있으며, 여기서 리소스 엘리먼트들의 수(L)는 포트들의 수 미만이다. 본 명세서에 설명된 송신 공간 정보는, 예를 들어, 송신 공간 정보에 의해 표현되는 CSI-RS 포트들의 수와 연관된 감소된 주파수 리소스 점유 (예컨대, 리소스 엘리먼트들의 수(L))로 인해, UE에서의 머신 학습을 용이하게 할 수 있다. 본 명세서에 설명된 송신 공간 정보는, 네트워크 엔티티에서의 유연한 TxRU 대 안테나 엘리먼트 맵핑 구성 및/ 또는 UE에서의 유연한 머신 학습 구성과 같은, 네트워크 및/또는 UE에서의 유연한 구성들을 용이하게 할 수 있 다. 예를 들어, 송신 공간 정보는 네트워크 엔티티에서의 고유한 안테나 아키텍처들을 허용할 수 있으며, 여기 서 송신 공간 정보는 TxRU들에 대한 표준화된 맵핑을 표시한다. 송신 공간 정보는 UE에서의 고유한 머신 학습 모델들을 허용할 수 있으며, 여기서 송신 공간은 머신 학습 모델을 훈련, 선택, 및/또는 구성하는 데 사용될 수 있다. 무선 통신 네트워크들에 대한 소개 도 1은 무선 통신 네트워크의 일례를 도시하며, 여기서 본 명세서에 설명된 양태가 구현될 수 있다. 대체 적으로, 무선 통신 네트워크는 다양한 네트워크 엔티티들(대안적으로, 네트워크 엘리먼트들 또는 네트워크 노드들)을 포함한다. 네트워크 엔티티는 대체적으로, 통신 디바이스 및/또는 통신 디바이스에 의해 수행되는 통신 기능이다(예컨대, 사용자 장비(UE), 기지국(base station, BS), BS의 컴포넌트, 서버 등). 예를 들어, 네 트워크의 다양한 기능들뿐만 아니라 네트워크와 연관되고 그와 상호작용하는 다양한 디바이스들은 네트워크 엔 티티들로 간주될 수 있다. 이러한 예에서, 무선 통신 네트워크는 무선 통신 서비스들을 제공하기 위해 상 호 작용되는 기지국(BS)들, 사용자 장비(UE)들, 하나 이상의 코어 네트워크들, 예컨대 진화된 패킷 코어(evolved packet core, EPC), 및 5G 코어(5G core, 5GC) 네트워크를 포함한다. BS는 UE에 대한, EPC 및/또는 5GC에의 액세스 포인트(access point, AP)를 제공할 수 있 으며, 다른 기능 중에서도, 하기의 기능 중 하나 이상을 수행할 수 있다: 사용자 데이터의 전송, 라디오 채널 암호화 및 암호해독, 무결성 보호, 헤더 압축, 이동성 제어 기능(예를 들어, 핸드오버, 이중 연결성(dual connectivity, DC)), 셀간 간섭 조정, 연결 설정 및 해제, 부하 균형, NAS(non-access stratum) 메시지에 대한 분배, NAS 노드 선택, 동기화, 라디오 액세스 네트워크(radio access network, RAN) 공유, MBMS(multimedia broadcast multicast service), 가입자 및 장비 추적, RIM(RAN information management), 페이징, 포지셔닝, 및 경고 메시지의 전달. 기지국은 다양한 맥락에서 네트워크 엔티티, gNB, 노드B, eNB, ng-eNB(예컨대, EPC 및 5GC 둘 모두에 연결을 제공하도록 향상되었던 eNB), 액세스 포인트, 트랜시버 기지국, 라디오 기지국, 라디오 트랜시버, 또는 트랜시버 기능, 또는 송신 수신 포인트를 포함하고/하거나 이들로 지칭될 수 있 다. 기지국, 예를 들어 BS는 단일 물리적 위치에 위치한 컴포넌트 또는 다양한 물리적 위치에 위치한 컴포넌트 를 포함할 수 있다. 기지국이 다양한 물리적 위치에 위치한 컴포넌트를 포함하는 예에서, 다양한 컴포넌트는 각각, 집합적으로, 다양한 컴포넌트가 단일 물리적 위치에 위치한 기지국과 유사한 기능을 달성하도록, 다양한 기능을 수행할 수 있다. 이와 같이, 기지국은 동등하게 독립형 기지국 또는 다양한 물리적 위치 또는 가상화된 위치에 위치한 컴포넌트를 포함하는 기지국을 지칭할 수 있다. 일부 구현에서, 다양한 물리적 위치에 위치한 컴포넌트를 포함하는 기지국은, 분산 RAN(radio access network) 아키텍처, 예를 들어, O-RAN(Open RAN) 또는 VRAN(Virtualized RAN) 아키텍처로 지칭될 수 있거나 또는 그와 연관될 수 있다. 일부 구현에서, 기지국의 그 러한 컴포넌트는 CU(central unit), DU(distributed unit), 또는 RU(radio unit) 중 하나 이상을 포함할 수 있 거나 또는 그를 지칭할 수 있다. BS는 통신 링크를 통해 UE와 무선으로 통신한다. BS 각각은 일부 경우에 중첩될 수 있는 각각의 지리적 커버리지 영역에 대한 통신 커버리지를 제공할 수 있다. 예를 들어, 소형 셀(102')(예를 들어, 저전력 기지국)은 하나 이상의 매크로셀(예를 들어, 고전력 기지국)의 커버리지 영역과 중첩되는 커 버리지 영역(110')을 가질 수 있다. BS와 UE 사이의 통신 링크는 UE로부터 BS로의 업링크(UL)(또한, 역방향 링크로서 지 칭됨) 송신 및/또는 BS로부터 UE로의 다운링크(DL)(또한, 순방향 링크로서 지칭됨) 송신을 포함할 수있다. 통신 링크는 다양한 양태에서 공간 다중화, 빔포밍 및/또는 전송 다이버시티를 포함하는 다중 입력 다중 출력(multiple-input and multiple-output, MIMO) 안테나 기술을 사용할 수 있다. UE의 예는 셀룰러 폰, 스마트 폰, SIP(session initiation protocol) 폰, 랩톱, 개인 정보 단말기 (personal digital assistant, PDA), 위성 라디오, 글로벌 포지셔닝 시스템, 멀티미디어 디바이스, 비디오 디 바이스, 디지털 오디오 플레이어, 카메라, 게임 콘솔, 태블릿, 스마트 디바이스, 웨어러블 디바이스, 차량, 전 기 검침기, 가스 펌프, 대형 또는 소형 주방 기기, 헬스케어 디바이스, 임플란트, 센서/액추에이터, 디스플레이 또는 다른 유사한 디바이스를 포함한다. UE 중 일부는 사물 인터넷(internet of things, IoT) 디바이스 (예를 들어, 주차 검침기, 가스 펌프, 토스터, 차량, 심장 모니터 또는 다른 IoT 디바이스), AON 디바이스 또는 에지 프로세싱 디바이스일 수 있다. UE는 또한 더 대체적으로 스테이션, 이동국, 가입자국, 모바일 유닛, 가입자 유닛, 무선 유닛, 원격 유닛, 모바일 디바이스, 무선 디바이스, 무선 통신 디바이스, 원격 디바이스, 모 바일 가입자국, 액세스 단말, 모바일 단말, 무선 단말, 원격 단말, 핸드셋, 사용자 에이전트, 모바일 클라이언 트, 또는 클라이언트로 지칭될 수 있다. 더 높은 주파수 대역을 사용하는 통신은 더 낮은 주파수 통신과 비교하여 더 높은 경로 손실 및 더 짧은 범위를 가질 수 있다. 따라서, 특정 기지국(예컨대, 도 1의 180)은 경로 손실 및 범위를 개선하기 위해 UE와의 빔포밍을 활용할 수 있다. 예를 들어, 기지국 및 UE는 각각 빔포밍을 용이하게 하기 위해 안테 나 엘리먼트, 안테나 패널 및/또는 안테나 어레이와 같은 복수의 안테나를 포함할 수 있다. 일부 경우에, 기지국은 빔포밍된 신호를 하나 이상의 송신 방향(182')으로 UE에 전송할 수 있다. UE는 빔포밍된 신호를 하나 이상의 수신 방향(182'')으로 기지국으로부터 수신할 수 있다. UE 는 또한 빔포밍된 신호를 하나 이상의 전송 방향(182'')으로 기지국에 전송할 수 있다. 기지국은 또 한 빔포밍된 신호를 하나 이상의 수신 방향(182')으로 UE로부터 수신할 수 있다. 그런 다음, 기지국 및 UE는 빔 훈련을 수행하여 기지국 및 UE 각각에 대한 최적의 수신 및 송신 방향을 결정할 수 있다. 특히, 기지국에 대한 송신 및 수신 방향은 동일할 수 있거나 동일하지 않을 수 있다. 유사하게, UE에 대한 전송 및 수신 방향은 동일할 수 있거나 동일하지 않을 수 있다. 무선 통신 네트워크는 송신 공간 정보 컴포넌트를 포함하고, 이는 네트워크 엔티티와 연관된 송신 공 간 정보를 표시하도록 구성될 수 있다. 무선 통신 네트워크는 송신 공간 정보 컴포넌트를 추가로 포 함하고, 이는 송신 공간 정보에 기초하여 채널 추정 및/또는 채널 상태 정보를 결정하도록 구성될 수 있다. 도 2는 예시적인 BS 및 UE의 양태들을 도시한다. 대체적으로, BS는 다양한 프로세서들(예컨대, 220, 230, 238, 240), 안테나들(234a 내지 234t)(집합적으로 234), 트랜시버들(232a 내지 232t)(집합적으로 232)(이는 변조기들 및 복조기들을 포함함), 및 데이터의 무선 송신(예컨대, 데이터 소스) 및 데이터의 무 선 수신(예컨대, 데이터 싱크)을 가능하게 하는 다른 양태들을 포함한다. 예를 들어, BS는 그 자신 과 UE 사이에서 데이터를 전송 및 수신할 수 있다. 소정 경우들에서, 본 명세서에 추가로 설명된 바와 같 이, BS는 안테나(234a 내지 234t)와 연관된 송신 공간 정보의 표시를 출력할 수 있고, UE는 송신 공 간 정보를 사용하여 채널 추정 및/또는 CSI를 결정할 수 있다. 소정 양태들에서, 안테나들(234a 내지 234t)은 도 8 내지 도 10과 관련하여 본 명세서에서 추가로 설명되는 바와 같은, 안테나 아키텍처로 배열될 수 있다. BS는 제어기/프로세서를 포함하고, 이는 무선 통신과 관련된 다양한 기능들을 구현하도록 구성될 수 있다. 도시된 예에서, 제어기/프로세서는 송신 공간 정보 컴포넌트를 포함하고, 이는 도 1의 송신 공간 정보 컴포넌트를 나타낼 수 있다. 특히, 제어기/프로세서의 양태로서 도시되어 있지만, 다른 구현들에서, 송신 공간 정보 컴포넌트는 BS의 다양한 다른 양태들에서 추가적으로 또는 대안적으로 구현될 수 있다. 대체적으로, UE는 다양한 프로세서들(예컨대, 258, 264, 266, 280), 안테나들(252a 내지 252r)(집합적으 로 252), 트랜시버들(254a 내지 254r)(집합적으로 254)(이는 변조기들 및 복조기들을 포함함), 및 데이터의 무 선 송신(예컨대, 데이터 소스) 및 데이터의 무선 수신(예컨대, 데이터 싱크)을 가능하게 하는 다른 양태들을 포함한다. UE는 무선 통신과 연관된 다양한 기능을 구현하도록 구성될 수 있는 제어기/프로세서를 포함한다. 도시된 예에서, 제어기/프로세서는 송신 공간 정보 컴포넌트를 포함하고, 이는 도 1의 송신 공간 정 보 컴포넌트를 나타낼 수 있다. 특히, 제어기/프로세서의 양태로서 도시되어 있지만, 다른 구현들에 서, 송신 공간 정보 컴포넌트는 UE의 다양한 다른 양태들에서 추가적으로 또는 대안적으로 구현될 수있다. 사용자 장비가 기지국과 통신하고 그리고/또는 네트워크 내에 있는 것으로서 도 1 및 도 2와 관련하여 설 명되어 있지만, 사용자 장비는 네트워크를 통해 통신들을 중계하지 않고서 다른 사용자 장비와, 또는 다른 무선 디바이스와 직접 통신하고/그것에 직접 송신하도록 구성될 수 있다. 일부 양태들에서, 도 2에 예시 되고 상기에 설명된 기지국은 다른 사용자 장비의 일례이거나, 또는 그 반대도 마찬가지이다. 도 3a, 도 3b, 도 3c, 및 도 3d는 도 1의 무선 통신 네트워크와 같은 무선 통신 네트워크에 대한 데이터 구조의 양태를 도시한다. 특히, 도 3a는 5G(예를 들어, 5G 뉴 라디오(NR)) 프레임 구조 내의 제1 서브프레임의 예를 도시하는 도면이고, 도 3b는 5G 서브프레임 내의 DL 채널의 예를 도시하는 도면이고, 도 3c는 5G 프레임 구조 내의 제2 서브프레임의 예를 도시하는 도면이고, 도 3d는 5G 서브프레임 내의 UL 채널의 예를 도시하는 도면이다. 5G 뉴 라디오(NR) 시스템들과 같은 통신 시스템들의 배치는 다양한 컴포넌트들 또는 구성 부분들을 이용하여 다 수의 방식들로 배열될 수 있다. 5G NR 시스템 또는 네트워크에서, 네트워크 노드, 네트워크 엔티티, 네트워크 의 이동성 엘리먼트, 라디오 액세스 네트워크(RAN) 노드, 코어 네트워크 노드, 네트워크 엘리먼트, 또는 네트워 크 장비, 예컨대, 기지국(BS), 또는 기지국 기능을 수행하는 하나 이상의 유닛들(또는 하나 이상의 컴포넌트 들)은 어그리게이팅된 또는 디스어그리게이팅된 아키텍처로 구현될 수 있다. 예를 들어, BS(이를테면, NB(Node B), eNB(evolved NB), NR BS, 5G NB, 액세스 포인트(AP), TRP(transmit receive point), 또는 셀 등)는 어그리 게이팅된 기지국(독립형 BS 또는 모놀리식 BS로 또한 알려져 있음) 또는 디스어그리게이팅된 기지국으로서 구현 될 수 있다. 네트워크 엔티티 또는 네트워크 노드는, 몇 가지만 예를 들면, 어그리게이팅된 기지국, 디스어그 리게이팅된 기지국, 기지국의 컴포넌트, 통합형 액세스 및 백홀(integrated access and backhaul, IAB) 노드, 중계 노드, 사이드링크 노드로서 구현될 수 있다. 어그리게이팅된 기지국은, 단일 RAN 노드 내에 물리적으로 또는 논리적으로 통합되는 라디오 프로토콜 스택을 활용하도록 구성될 수 있다. 디스어그리게이팅된 기지국은 (하나 이상의 중앙 또는 중앙집중식 유닛들(CU들), 하나 이상의 분산 유닛들(DU들), 또는 하나 이상의 라디오 유닛들(RU들)과 같은) 2개 이상의 유닛들 사이에 물 리적으로 또는 논리적으로 분산되는 프로토콜 스택을 사용하도록 구성될 수 있다. 일부 양태들에서, CU는 RAN 노드 내에서 구현될 수 있거나, 하나 이상의 DU들은 CU와 동일 위치될 수 있거나, 또는 대안적으로, 하나 또는 다중의 다른 RAN 노드들 전반에 걸쳐 지리적으로 또는 가상으로 분산될 수 있다. DU들은 하나 이상의 RU들과 통신하도록 구현될 수 있다. CU, DU, 및 RU의 각각은 또한, 가상 유닛들, 즉, 가상 중앙 유닛(virtual central unit, VCU), 가상 분산 유닛(virtual distributed unit, VDU), 또는 가상 라디오 유닛(virtual radio unit, VRU)으로서 구현될 수 있다. 기지국 타입 동작 또는 네트워크 설계는 기지국 기능의 어그리게이션 특징들을 고려할 수 있다. 예를 들어, 디 스어그리게이팅된 기지국들은, 통합형 액세스 백홀(IAB) 네트워크, 오픈 라디오 액세스 네트워크(O-RAN)(예컨대, O-RAN 얼라이언스에 의해 후원되는 네트워크 구성)), 또는 가상화된 라디오 액세스 네 트워크(vRAN)(클라우드 라디오 액세스 네트워크(C-RAN)로서 또한 알려짐)에서 활용될 수 있다. 디스어그리게이 션은 다양한 물리적 위치들에서 2개 이상의 유닛들에 걸쳐 기능을 분산시키는 것뿐만 아니라, 사실상 적어도 하 나의 유닛에 대한 기능을 분산시키는 것을 포함할 수 있고, 이는 네트워크 설계에서의 유연성을 가능하게 할 수 있다. 디스어그리게이팅된 기지국의 다양한 유닛들, 또는 디스어그리게이팅된 RAN 아키텍처는 적어도 하나의 다른 유닛과의 유선 또는 무선 통신을 위해 구성될 수 있다. 도 4는 예시적인 디스어그리게이팅된 기지국 아키텍처를 예시하는 도면을 도시한다. 디스어그리게이팅된 기지국 아키텍처는, 백홀 링크를 통해 코어 네트워크와 직접적으로 또는 (E2 링크를 통한 근-실시간 (Near-RT) RAN 지능형 제어기(RIC), 또는 서비스 관리 및 오케스트레이션(Service Management and Orchestration, SMO) 프레임워크와 연관된 비-실시간(Non-RT) RIC, 또는 둘 모두와 같은) 하나 이상 의 디스어그리게이팅된 기지국 유닛들을 통해 코어 네트워크와 간접적으로 통신할 수 있는 하나 이상의 중 앙 유닛들(CU들)을 포함할 수 있다. CU는, F1 인터페이스와 같은 각자의 미드홀 링크들을 통해 하나 이상의 분산 유닛들(DU들)과 통신할 수 있다. DU들은 각자의 프론트홀 링크들을 통해 하나 이상의 라디오 유닛들(RU들)과 통신할 수 있다. RU들은 하나 이상의 라디오 주파수(radio frequency, RF) 액세스 링크들을 통해 각자의 UE들과 통신할 수 있다. 일부 구현들에서, UE는 다수의 RU들에 의해 동시에 서빙될 수 있다. 다양한 양태들에서, 네트워크 엔티티 또는 네트워크 노드는, 몇 가지만 예를 들면, 어그리게이팅된 기지국, 디 스어그리게이팅된 기지국, 기지국의 컴포넌트, IAB(integrated access and backhaul) 노드, 중계 노드, 사이드 링크 노드로서 구현될 수 있다. 도 1, 도 2, 도 3a, 도 3b, 도 3c, 및 도 3d, 및 도 4에 관한 추가적인 논의들은 본 개시내용에서 나중에 제공 된다. mmWave 무선 통신에 대한 소개 무선 통신에서, 전자기 스펙트럼은 종종 다양한 클래스, 대역, 채널 또는 다른 특징으로 세분화된다. 세분화는 종종 파장 및 주파수에 기반하여 제공되고, 여기서, 주파수는 캐리어, 서브캐리어, 주파수 채널, 톤 또는 서브 대역으로 또한 지칭될 수 있다. 5G NR에서, 2개의 초기 동작 대역은 주파수 범위 명칭 FR1(410 ㎒ 내지 7.125 ㎓) 및 FR2(24.25 ㎓ 내지 52.6 ㎓)로서 식별되었다. FR1의 일부가 6 ㎓를 초과하지만, FR1은 종종 다양한 문헌들 및 논문들에서 \"서브-6 ㎓\" 대역으로서 (상호교환가능하게) 지칭됨을 이해해야 한다. ITU(International Telecommunications Union)에 의 해 \"밀리미터파\" 대역으로 식별되는 극고주파(EHF) 대역(30 ㎓ 내지 300 ㎓)과 상이함에도 불구하고, 문헌들 및 논문들에서 \"밀리미터파\" 대역으로 (상호교환 가능하게) 종종 지칭되는 FR2에 관해 유사한 명칭 문제가 발생한 다. FR1과 FR2 사이의 주파수들은 종종 중간 대역 주파수들로 지칭된다. 최근의 5G NR 연구들은 이러한 중간 대역 주파수들에 대한 동작 대역을 주파수 범위 명칭 FR3(7.125 ㎓ 내지 24.25 ㎓)로서 식별하였다. FR3 내에 속하 는 주파수 대역들은 FR1 특성들 및/또는 FR2 특성들을 승계받을 수 있고, 따라서 FR1 및/또는 FR2의 특징들을 중간 대역 주파수들로 효과적으로 확장시킬 수 있다. 추가적으로, 5G NR 동작을 52.6 ㎓를 넘어 확장시키기 위 해 더 높은 주파수 대역들이 현재 탐구되고 있다. 예컨대, 3개의 더 높은 동작 대역들이 주파수 범위 명칭 FR4a 또는 FR4-1(52.6 ㎓ 내지 71 ㎓), FR4(52.6 ㎓ 내지 114.25 ㎓), 및 FR5(114.25 ㎓ 내지 300 ㎓)로서 식 별되었다. 이러한 더 높은 주파수 대역들 각각은 EHF 대역 내에 속한다. 위의 양태를 염두에 두고, 구체적으로 달리 명시되지 않는 한, \"sub-6 ㎓\" 등의 용어는 본 명세서에서 사용된다 면 6 ㎓ 미만일 수 있는 주파수를 광범위하게 나타낼 수 있거나, FR1 내에 있을 수 있거나, 또는 중간 대역 주 파수를 포함할 수 있음을 이해해야 한다. 추가로, 구체적으로 달리 언급되지 않는 한, 본 명세서에서 사용되는 경우 \"밀리미터파\" 등의 용어는 중간 대역 주파수들을 포함할 수 있거나, FR2, FR4, FR4-a 또는 FR4-1, 및/또는 FR5 내에 있을 수 있거나, 또는 EHF 대역 내에 있을 수 있는 주파수들을 광범위하게 표현할 수 있다는 것이 이 해되어야 한다. mmWave/근 mmWave 라디오 주파수 대역(예컨대, 3 ㎓ 내지 300 ㎓)을 사용하는 통신들은 더 낮은 주파수 통신들 과 비교하여 더 높은 경로 손실 및 더 짧은 범위를 가질 수 있다. 도 1에 대해 전술된 바와 같이, mmWave/근 mmWave 라디오 주파수 대역을 사용하여 통신하도록 구성된 기지국(예를 들어, 180)은 경로 손실 및 범위를 개선 하기 위해 UE(예를 들어, 104)와의 빔포밍(예를 들어, 182)을 활용할 수 있다. 또한, 본 명세서에 설명된 바와 같이, UE는 송신 공간 정보를 사용하여 mmWave 대역들 및/또는 다른 주파수 대 역들에서 채널을 추정하거나 또는 채널 상태 정보를 생성할 수 있다. 채널 추정을 위한 송신 공간 정보에 관련된 양태들 본 개시내용의 양태들은 채널 추정 및/또는 채널 상태 정보(CSI) 보고와 연관된 송신 공간 정보를 사용하기 위 한 방법들 및 장치를 제공한다. 송신 공간 정보는 안테나 아키텍처의 안테나 엘리먼트들에 대한 트랜시버 유닛 (TxRU)들의 맵핑을 표시할 수 있다. 하나 이상의 예들에 따르면, 본 명세서에 추가로 설명된 바와 같이, 네트 워크 엔티티는 소정의 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 (예를 들어, UE로) 출력할 수 있고, UE는 송신 공간 정보를 사용하여 채널 추정 및/또는 CSI를 결정할 수 있다. 일부 경우들에서, UE는, 예를 들어, 도 5와 관련하여 본 명세서에 추가로 설명된 바와 같은, 송신 공간 정보에 기초하여 채널 추정 및/또는 CSI를 결정하기 위해 머신 학습을 사용할 수 있다. 본 명세서에 설명된 송신 공간 정보는, 채널 추정을 수행하고/하거나 CSI를 결정하고 CSI-RS 오버헤드를 감소시 키기 위한 머신 학습 모듈의 사용으로 CSI-RS 오버헤드 감소를 용이하게 할 수 있다. 송신 공간 정보는 머신 학습 모듈을 훈련, 선택, 및/또는 구성하는 데 사용될 수 있다. 본 명세서에 설명된 송신 공간 정보는, 예를 들어, 송신 공간 정보에 의해 표현되는 CSI-RS 포트들의 수와 연관된 감소된 주파수 리소스 점유로 인해, UE에 서의 머신 학습을 용이하게 할 수 있다. 본 명세서에 설명된 송신 공간 정보는, 본 명세서에 추가로 설명된 바와 같이, 네트워크 엔티티에서의 유연한 TxRU 대 안테나 엘리먼트 맵핑 구성 및/또는 UE에서의 유연한 머신 학 습 구성과 같은, 네트워크 엔티티 및/또는 UE에서의 유연한 구성들을 용이하게 할 수 있다. 도 5는 본 개시내용의 소정 양태들에 따른, 송신 공간 정보를 사용하는 예시적인 무선 통신 네트워크를 예 시하는 도면이다. 이러한 예에서, BS는 송신 공간 정보의 표시를 (예를 들어, UE로) 송신(예컨 대, 전송, 출력, 또는 제공)할 수 있고, 이는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에 추가로 설 명되는 바와 같이, BS와 연관된 안테나 아키텍처의 안테나 엘리먼트들에 대한 TxRU들의 맵핑을 표시할 수 있다. UE는, 빔(들)과 연관된 CSI-RS 및/또는 SSB와 같은, BS로부터의 다운링크 기준 신호들 을 모니터링할 수 있다. UE는 빔들 및 송신 공간 정보에 대응하는 수신된 기준 신호들에 적어 도 부분적으로 기초하여, 빔들과 연관된 채널 추정 및/또는 CSI를 결정할 수 있다. UE는 CSI를 BS에 보고할 수 있다. 일부 경우들에서, UE는, 예를 들어, 송신 및/또는 수신 빔포밍을 위해 채널 추정을 사용할 수 있다. 소정 경우들에서, BS는 빔들을 사용하거나 또는 커버 코드들을 통해 기준 신호들(예컨대, CSI-RS 및/또는 SSB)을 송신할 수 있고, 이는 BS 및/또는 UE에서 머신 학습 및/또는 인공 지능(AI/ML)에 의해 획득될 수 있다. CSI-RS는 BS 및 UE에서 AI/ML을 위한 교차 노드 동작일 수 있다. 교차 노드 동작 하에서, AI/ML에 의해 획득된 빔 또는 커버 코드는 BS에 의해 CSI-RS를 송신하기 위해 사용될 수 있다. UE는 AI/ML 기반 채널 추정을 채용할 수 있으며, 여기서 BS와 UE에서의 AI/ML 모듈은 매칭, 예 컨대 공동으로 훈련될 수 있다. 유사하게, CSI 피드백은 또한 BS 및 UE에서 AI/ML에 대한 크로스 노 드일 수 있다. UE는 CSI 인코더를 사용하여 채널 추정치를 작은 차원으로 압축하고, CSI를 BS에 보 고할 수 있다. BS는 전 채널(full channel)을 복구하기 위해 CSI 디코더를 채용할 수 있다. 소정 경우들 에서, CSI 인코더 및 디코더는 매칭된 AI/ML 모듈들, 예컨대 공동으로 훈련된 AI/ML 모듈들이다. 소정 경우들에서, UE는 채널 추정 및/또는 CSI를 결정하기 위해 인공 지능(예컨대, 뉴럴 네트워 크 및/또는 머신 학습) 및/또는 회귀 분석(예컨대, 선형 최소 평균 제곱 오류(linear minimum mean square error, LMMSE) 연산)을 수행할 수 있다. 예를 들어, UE는 머신 학습 모듈을 사용하여 채널 추정 및/또는 CSI를 결정할 수 있다. 프로세싱 시스템은 도 20과 관련하여 본 명세서에 설명된 프로세싱 시스템과 같은 머신 학습 모듈을 수행할 수 있다. 머신 학습 모듈의 입력은 BS로부터 수 신된 기준 신호(들)(예컨대, CSI-RS 및/또는 SSB)의 측정치들을 포함할 수 있다. 예컨대, 입력은 주파수 도메인에서 표현되는 수신된 기준 신호를 포함할 수 있다. 소정 양태들에서, 입력은, 예를 들어, 측정치 들과 연관된 서브캐리어 인덱스, 심볼 인덱스, 및/또는 수신 안테나 인덱스에 기초하여 입력 순서로 배열 될 수 있다. 머신 학습 모듈의 출력은 채널 추정 및/또는 CSI를 포함할 수 있다. 머신 학습 모듈은 주파수 도메인에서 안테나 아키텍처의 각각의 포트와 연관된 채널 추정을 출력할 수 있 다. 소정 양태들에서, 주파수 도메인 채널 추정치들은, 예를 들어, 포트 인덱스, 리소스 블록(resource block, RB) 인덱스, 서브캐리어 인덱스(또는 각각의 리소스 블록의 기준 서브캐리어 인덱스), 및/또는 심볼 인덱스에 기초하여 출력 순서로 배열될 수 있다. 머신 학습 모듈은 다양한 방식들로 훈련될 수 있다. 소정 경우들에서, 네트워크 엔티티(예컨대, BS(10 2))는 머신 학습 모듈을 훈련하기 위해 훈련 데이터를 UE에 제공할 수 있다. 일부 경우들에서, 네트 워크 엔티티(예컨대, BS)는 UE에서 머신 학습 모듈을 훈련하기 위해 소정의 기준 신호를 송신할 수 있다. 소정 경우들에서, 머신 학습 모듈은 채널 추정 및/또는 CSI를 프로세싱하도록 사전 훈련될 수 있다. 하나 이상의 예들에 따르면, 송신 공간 정보는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에 추가 로 설명된 바와 같이, 소정 주파수 대역폭(예컨대, 리소스 블록당 리소스 엘리먼트들의 수)에 걸쳐 안테나 아키 텍처에서 안테나 엘리먼트들에 대한 TxRU들(예컨대, CSI-RS 포트들)의 맵핑을 표시할 수 있다. 송신 공간 정보는 맵핑에서 하나 이상의 커버 코드들 을 표시할 수 있다. 커버 코드들 각각은 TxRU(예컨대, CSI-RS 포트 P)당 소정 수의 리소스 엘리먼트들(RE0 내지 RE L-1) 중의 리소스 엘리 먼트당 기준 신호(s)에 적용될 수 있다. 소정 양태들에서, 커버 코드들은 포트에 대한, 진폭 및/또 는 위상 제어와 같은 기준 신호들에 적용된 빔포밍을 표시할 수 있다. 예를 들어, 리소스 블록(RB)과 연관된 커버 코드들은, P개의 포트들이 리소스 블록당 L개의 리소스 엘리먼트들(RE)에 맵핑된다는 것을 제공할 수 있으 며, 여기서 리소스 엘리먼트들의 수(L)는 포트들의 수(P) 미만이다. 길이 L의 커버 코드는 L개의 리소스 엘리 먼트들 상에서 소정 송신(예컨대, TxRU)을 맵핑하는 가중치들의 시퀀스로서 간주될 수 있다. 소정 경우들에서,리소스 엘리먼트들의 수(L)는 포트들의 수(P) 미만일 수 있는데(L << P), 예를 들어, 여기서 {P, L} = {32, 8} 또는 {128, 32}이다. 도시된 예에서, 포트(TxRU)들의 수(P)는 또한 Nt와 동일할 수 있다. 일부 경우들에서, 커버 코드들의 수는 P × L (= N_CSI-RS)로서 반영될 수 있으며, 여기서 리소스 엘리먼트들(RE0 내지 RE L-1)에 걸친 기준 신호들(s)에 적용된 각각의 행(row) 은 소정 포트(P)와 연관된 커버 코드에 대응할 수 있다. 물리적 리소스들에 대한 맵핑은 (P × L)개의 N_CSI-RS RB들로 일반화될 수 있으며, 여기서 각각의 RB 상의 커버 코드(들)는 주파수 리소스들에 대한 포트들의 동일한 맵핑을 갖거나 또는 상이한 맵핑을 가질 수 있 다. 소정 양태들에서, UE는 채널 추정을 수행할 수 있고, 이는 N개의 리소스 블록들에 걸친 P개의 포트들 상에서 UE 와 BS 사이의 채널을 추정하며, 여기서 리소스 블록들의 수(N)는, L × N_CSI-RS로서 반영된 크기를 갖는 CSI- RS들의 입력을 사용하는, CSI-RS가 송신되는 리소스 블록들의 수 이상일 수 있다(N ≥ N_CSI-RS). 모델 기반 알고리즘(예컨대, LMMSE)에서, UE는 채널 추정을 결정하기 위해 송신 공간 정보(예컨대, 주파수 리소 스들에 대한 TxRU들의 맵핑) 및/또는 커버 코드들(예컨대, 빔포밍)로 구성될 수 있다. 예를 들어, 채널 추정은 다음에 따라 LMMSE를 사용하여 결정될 수 있다:"}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 y = H × X × s NRB의 경우:"}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이고, 여기서"}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서 는 채널 매트릭스이고, WLMMSE는 프리코더 매트릭스이고, y는 수신 신호들이고, H는 무선 채널이고, X는 커버 코드(예컨대, 빔포밍)이고, s는 파일롯(예컨대, 기준 신호)이다. L = P인 경우들에서, UE는, P개의 포트 들이 송신기에서의 공간 상관관계(예컨대, 송신 공간 정보)와 직교 방식으로 RB당 P개의 RE들 상에서 다중 화됨에 따라 포트당 채널 추정을 수행할 수 있다. 데이터 구동 동작(예컨대, 인공 지능 또는 머신 학습)에서, 머신 학습 모듈(예컨대, 머신 학습 모듈) 및/ 또는 뉴럴 네트워크가 채널 추정을 결정하는 데 사용될 수 있고, 다른 머신 학습 모듈 또는 뉴럴 네트워크가 커 버 코드를 결정하는 데 사용될 수 있다. 2개의 머신 학습 모듈들 및/또는 뉴럴 네트워크들은 매칭되거나 또는 공동으로 훈련될 수 있다. 머신 학습 모듈은 훈련 채널 샘플들의 공간 상관관계(예컨대, 송신 공간 정보(50 2))에 적응하도록 훈련될 수 있다. 송신기에서의 공간 상관관계는 UE에 암시적으로 또는 명시적으로 표시될 수 있다. 도 6은 예를 들어, 채널 추정을 결정하기 위해 뉴럴 네트워크를 사용하는 예시적인 인공 지능 아키텍처를 예시하는 도면이다. 뉴럴 네트워크는 채널 추정을 결정하기 위해 UE에서 사용되는 머신 학습 모듈(예컨대, 머신 학습 모듈)의 일례일 수 있다. 도시된 바와 같이, 뉴럴 네트워크는 수신된 신호 들(y)을 입력으로서 취할 수 있고, 이는 채널 정보(h)(예컨대, 채널 매트릭스), 송신 신호들(z), 및 커버 코드 모델의 함수로서 모델링될 수 있다. 뉴럴 네트워크는 분류 동안, RecLU(rectified linear unit), FC(fully connected) 뉴럴 네트워크, 및 소프트맥스(softmax) 계층과 같은 다양한 연산 계층들을 사용 할 수 있다. 뉴럴 네트워크는 가중치들(w1, . . ., wN)을 뉴럴 네트워크 풀에 적용하여, FC 뉴럴 네 트워크를 생성할 수 있고, 이는 뉴럴 네트워크 풀의 가중된 합일 수 있다. 뉴럴 네트워크는 입 력들로서 수신된 신호들(y)에 기초하여 채널 추정 을 결정하기 위해 FC 뉴럴을 사용할 수 있다. 일부 경우들에서, 커버 코드 모델 및 뉴럴 네트워크 채널 추정기(예컨대, 뉴럴 네트워크)는 공동으로 훈련 되고/되거나 훈련 채널 샘플들의 공간 상관관계에 암시적으로 또는 명시적으로 적응될 수 있다. 일부 경우들에 서, 머신 학습 모듈은 뉴럴 네트워크를 포함할 수 있다. 소정 양태들에서, 송신기에서의 공간 상관관계는 인공 지능 기반 CSI 피드백에 대해 사용될 수 있다. 소정 경 우들에서, 송신기에서의 공간 상관관계는 CSI 피드백에서 채널 및/또는 프리코더를 압축하는 데 사용될 수있다. 인공 지능 모듈은 공동 CSI-RS 채널 추정 및 CSI 피드백 설계를 위해 사용될 수 있다. 예를 들어, UE에 서의 인공 지능(예컨대, 뉴럴 네트워크)은 수신된 신호(예컨대, CSI-RS)를 입력으로서 취할 수 있고, UE에서의 인공 지능은 비트 시퀀스를 출력할 수 있고, 이는 채널의 압축된 추정을 BS에 표시할 수 있다. 소정 경우들에 서, CSI-RS 채널 추정 및 CSI 피드백은 인공 지능 및/또는 머신 학습을 위해 별개로 설계된다. 그러한 경우들 에서, CSI 인코더에 대한 입력은 (수신된 신호가 아니라) 채널 추정치 출력일 수 있고, CSI 인코더는 채널 또는 프리코더를 출력할 수 있다. BS는 인공 지능(예컨대, 뉴럴 네트워크)을 사용하여 비트 시퀀스를 채널 상태 정 보로 변환(예컨대, 디코딩)할 수 있다. 인공 지능(예컨대, 뉴럴 네트워크)은 BS에서 CSI-RS 커버 코드 및/또는 빔포밍을 적용하기 위해 사용될 수 있다. 인공 지능은 채널 추정 및/또는 CSI 인코딩을 위해 UE에서 사용될 수 있다. 인공 지능은 CSI 디코딩을 위해 BS에서 사용될 수 있다. 인공 지능은 훈련 샘플들의 공간 상관관계에 적응하도록 훈련될 수 있다. 도 7a는 UE 및 BS에 걸친 예시적인 CSI 피드백 동작을 예시하는 도면이다. 이러한 예에서, UE에서, 프리코딩 매트릭스 표시자(precoding matrix indicator, PMI) 및/또는 랭크 표시자(rank indicator, RI) 인코더는 채널 추정(H)으로서 취할 수 있고, 이는 각각의 RB(NRB) 상의 복소 매트릭스(Nt*Nr)를 포함할 수 있다. 채널 추 정은 수신된 CSI-RS들 및/또는 다른 기준 신호들에 기초하여 결정될 수 있다. PMI/RI 인코더는 CSI 피드 백(들)의 L개의 값들을 출력할 수 있고, 이는 양자화기에 의해 X개의 비트들로 양자화될 수 있다. UE는 양자화된 X개의 비트들(b)을 BS로 송신할 수 있고, 이는 역양자화기(dequantizer)를 이용하여 양자화된 비 트(b)를 CSI 피드백(s')으로 컨버팅할 수 있다. PMI/RI 디코더는 CSI 피드백(s')을 프리코더 w (랭크 1 의 경우 w0, 그리고 랭크 2의 경우 [w0, w1])로 디코딩할 수 있다. 도 7b는, 예를 들어, 뉴럴 네트워크를 사용하여 UE에서 CSI를 인코딩하고 BS에서 뉴럴 네트워크를 사용하여 CSI 를 프리코더로 디코딩하는, 예시적인 인공지능 아키텍처를 예시하는 도면이다. 이러한 예에서, 뉴럴 네트워크 CSI 인코더는 수신된 신호들(y)을 입력으로서 취할 수 있고, 이는 채널 정보(h)(예컨대, 채널 매트릭스), 송신 신호들(z), 및 커버 코드 모델의 함수로서 모델링될 수 있다. 뉴럴 네트워크 CSI 인코더는 CSI 를 생성하기 위해 UE에서 사용되는 머신 학습 모듈(예컨대, 머신 학습 모듈)의 일례일 수 있다. 일부 경 우들에서, 머신 학습 모듈은 뉴럴 네트워크 CSI 인코더를 포함할 수 있다. 뉴럴 네트워크는 CSI 피드백(M)을 인코딩하기 위해, RecLU 계층, FC 뉴럴 네트워크, 및 tanh(hyperbolic tangent activation function) 계층과 같은 다양한 연산 계층들을 사용할 수 있다. UE는 CSI 피드백(M)을 BS로 송신할 수 있고, 이 는 CSI 피드백을 프리코더로 디코딩할 수 있다. BS는 프리코더를 복구하기 위해 인공 지능(AI) 모듈을 사 용할 수 있다. AI 모듈은 초기 복구 모듈을 가질 수 있고, 이는, 예를 들어, RecLU 계층, FC 뉴럴 네트워크 계층, 및 재형상화 계층을 포함할 수 있다. 초기 복구 모듈은 UE로부터 수신된 CSI 피드백을 입 력으로서 취할 수 있다. 재형상화 계층은 프로세싱된 CSI 피드백을 리소스 블록 레벨에서 전-차원(full dimension)으로 재형상화할 수 있다. AI 모듈은 또한 심층 복구 모듈을 가질 수 있고, 이는 초기 복 구 모듈로부터의 출력을 입력으로서 취할 수 있다. 심층 복구 모듈은, 예를 들어, 콘볼루션 계층, RecLU 계층, 및/또는 리소스 블록(ResBlock) 계층을 포함할 수 있다. 초기 복구 모듈로부터의 출력은 심 층 복구 모듈로부터의 출력에 추가되거나 또는 그와 조합될 수 있다. 조합된 출력은 정규화 모듈로 정규화될 수 있고, 이는 프리코더를 복구할 수 있다. 도 8은 8x8 교차 편파 안테나 엘리먼트들을 갖는 안테나 아키텍처에 대한 예시적인 공간 상관관계(예컨대, 송신 공간 관계)를 예시하는 도면이다. 안테나 아키텍처는 교차 편파 안테나 엘리먼트 쌍들(804a, 804b)(집합적으로 804)을 포함하는 안테나 어레이를 가질 수 있으며, 여기서 안테나 쌍들은 8개의 행들(M=8)에 걸쳐 8 개의 열(column)들(N=8)로 배열된다. 교차 편파 안테나 쌍들 각각은 수직 안테나 엘리먼트(804a) 및 수평 안테나 엘리먼트(804b)를 포함할 수 있다. TxRU는 안테나 어레이 내의 4개의 수직 안테나 엘리먼트 들(804a)의 세트에 맵핑될 수 있다. 예를 들어, 4개의 수직 안테나 엘리먼트들(804a)의 세트는 안테 나 어레이의 동일한 열에 배열될 수 있고, 인접한 안테나 엘리먼트들의 시퀀스로 배열될 수 있다. TxRU는 L개의 리소스 엘리먼트들(RE0 내지 RE L-1)과 연관된 커버 코드/빔포머를 가질 수 있다. 다 른 TxRU들은 4개의 안테나 엘리먼트들에 대한 동일한 맵핑을 따를 수 있으며, 여기서 안테나 어레이의 열 을 따른 매 4개의 안테나 엘리먼트들이 TxRU에 맵핑될 수 있다. 다른 TxRU들은 수직 및 수평 편파 차원들 에서 안테나 엘리먼트들에 맵핑될 수 있다. TxRU 대 안테나 엘리먼트 맵핑은 편파 차원(예컨대, 수직 및 수평)당 안테나 어레이의 열마다 2개의 TxRU들이 맵핑되는 결과를 가져올 수 있다. 이러한 예에서, TxRU들의 수는 N1*N2*Pdim에 의해 주어질 수 있으며, 여기서 N1은 TxRU들의 수(예컨대, N1 = 2)이고, N2는 안테나 어레이 내의 열들의 수(예컨대, N2 = 8)이고, Pdim은 편파 차원(예컨대, Pdim = 2)이다. 소정 경우들에서, 아날로그 빔포밍 계층은 안테나 엘리먼트들 각각과 연관될 수 있다. 일부 경우들에서, BS에서의 커버 코드/빔포 머 및 UE에서의 채널 추정 및/또는 CSI 피드백을 위한 인공 지능 모듈은 8x8 교차 편파 안테나 엘리 먼트들의 안테나 아키텍처와 대응하도록 공동으로 훈련될 수 있다. 도 9는 4×16 교차 편파 안테나 엘리먼트들을 갖는 안테나 아키텍처에 대한 예시적인 공간 상관관계를 예시하는 도면이다. 이러한 예에서, 안테나 어레이는 4개의 행들(M=4)에 걸쳐 16개의 열들(N=16)로 배열된 안테나 쌍들을 가질 수 있다. TxRU는 안테나 어레이 내의 4개의 수직 안테나 엘리먼트들(904a)의 세트 에 맵핑될 수 있다. 4개의 수직 안테나 엘리먼트들(904a)의 세트는 안테나 어레이의 동일한 열 에 배열되고, 인접한 안테나 엘리먼트들(904a)의 시퀀스로 배열될 수 있다. TxRU는 L개의 리소스 엘리먼 트들(RE0 내지 RE L-1)과 연관된 커버 코드/빔포머를 가질 수 있다. 다른 TxRU들은 4개의 안테나 엘리먼 트들에 대한 동일한 맵핑을 따를 수 있으며, 여기서 안테나 어레이의 열을 따른 매 4개의 안테나 엘리먼트 들이 TxRU에 맵핑될 수 있다. TxRU 대 안테나 엘리먼트 맵핑은 편파 차원당 안테나 어레이의 열마다 단일 의 TxRU가 맵핑되는 결과를 가져올 수 있다. 이러한 예에서, TxRU들의 수는 N1*N2*Pdim에 의해 주어질 수 있으 며, 여기서 N1=1, N2=16, 및 Pdim=2이다. 아날로그 빔포밍 계층은 안테나 엘리먼트들 각각과 연관될 수 있다. BS에서의 커버 코드/빔포머 및 UE에서의 채널 추정 및/또는 CSI 피드백을 위한 인공 지능 모듈 은 4×16 교차 편파 안테나 엘리먼트들의 안테나 아키텍처와 대응하도록 공동으로 훈련될 수 있다. 도 10은 4×16 교차 편파 안테나 엘리먼트들을 갖는 안테나 아키텍처에 대한 다른 예시적인 공간 상관관계를 예 시하는 도면이다. 이러한 예에서, 안테나 어레이는 4개의 행들(M=4)에 걸쳐 16개의 열들(N=16)로 배열된 안테나 쌍들을 가질 수 있다. TxRU는 2개의 수직 안테나 엘리먼트들(1004a)의 세트에 맵핑 될 수 있다. 2개의 수직 안테나 엘리먼트들(1004a)의 세트는 안테나 어레이의 동일한 열에 배열되 고, 인접한 안테나 엘리먼트들(1004a)의 시퀀스로 배열될 수 있다. TxRU는 L개의 리소스 엘리먼트들(RE0 내지 RE L-1)과 연관된 커버 코드/빔포머를 가질 수 있다. 다른 TxRU들은 2개의 안테나 엘리먼트들에 대 한 동일한 맵핑을 따를 수 있으며, 여기서 안테나 어레이의 열을 따른 매 2개의 안테나 엘리먼트들(100 4)이 TxRU에 맵핑될 수 있다. TxRU 대 안테나 엘리먼트 맵핑은 편파 차원당 안테나 어레이의 열마다 2개의 TxRU들이 맵핑되는 결과를 가져올 수 있다. 이러한 예에서, TxRU들의 수는 N1*N2*Pdim에 의해 주어질 수 있으며, 여기서 N2=1, N2=16, 및 Pdim=2이다. 아날로그 빔포밍 계층은 안테나 엘리먼트들 각각과 연관될 수 있다. BS에서의 커버 코드/빔포머 및 UE에서의 채널 추정 및/또는 CSI 피드백을 위한 인공 지 능 모듈은 4×16 교차 편파 안테나 엘리먼트들의 안테나 아키텍처와 대응하도록 공동으로 훈련될 수 있다. 도 8 내지 도 10에 도시된 예들이 이해를 용이하게 하기 위해 아날로그 빔포밍과 연관된 TxRU 맵핑과 관련하여 본 명세서에서 설명되지만, 본 개시내용의 양태들은 또한 디지털 빔포밍 및/또는 하이브리드 빔포밍(예컨대, 아 날로그 및 디지털 빔포밍의 조합)과 연관된 TxRU 맵핑에 적용될 수 있다. 인공 지능 모듈들(816, 916, 1016) 각각은 머신 학습 모듈을 나타낼 수 있다. 소정 양태들에서, 송신 공간 정보는 커버 코드 구성을 통해 (암시적으로) 표시될 수 있다. UE는 도 8 내지 도 10과 관련하여 본 명세서에 설명되는 TxRU 맵핑들과 같은 하나 이상의 커버 코드 구성들로 구성될 수 있다. 각 각의 커버 코드 구성은 UE에서 적용될 커버 코드(예컨대, 커버 코드 또는 커버 코드/빔포머), 대응하 는 안테나 아키텍처(예컨대, 안테나 어레이), 및/또는 대응하는 머신 학습 모듈(예컨대, 인공 지능 모듈 )을 식별할 수 있다. 커버 코드 구성은 도 8과 관련하여 본 명세서에 설명된 TxRU 맵핑과 같은 TxRU 맵핑 을 식별할 수 있다. 커버 코드 구성들 각각은 특정 인덱스 또는 식별자와 연관될 수 있다. 커버 코드 구성들은 무선 통신 네트워크들에 의해 지원된 소정 수의 안테나 아키텍처들과 연관될 수 있다. 커 버 코드 구성은 UE에서의 채널 추정 및/또는 CSI에 사용되는 인공 지능 및/또는 머신 학습의 유연한 구성/구현 을 용이하게 할 수 있다. 커버 코드 구성은 또한, 안테나 아키텍처들 및 대응하는 커버 코드들 각각에 대해 수 행되는 채널 추정의 유연한 구성/구현을 용이하게 할 수 있다. 소정 양태들에서, BS에서의 안테나 아키텍처는 CSI-RS 포트 그룹화를 통해 표시될 수 있다. 각각의 커버 코드 구성은, 도 8 내지 도 10과 관련하여 본 명세서에 설명되는 안테나 아키텍처들과 같은 안테나 아키텍처의 특정 레이아웃에 링크될 수 있다. 안테나 아키텍처는 CSI-RS 포트 그룹화에 대응하는 안테나 엘리먼트들의 N1개의 열들 및 N2개의 행들을 포함할 수 있다. 교차 편파를 갖는 안테나 아키텍처를 가정하면, 포트들의 총 수(Nt)는 도 8 내지 도 10과 관련하여 본 명세서에 설명되는 바와 같이, 다음의 표현식에 따라 결정될 수 있다:Nt=Pdim*N1*N2 포트들. 포트들의 제1 절반(예컨대, 수직 편파)은 N2개의 포트들을 갖는 N1개의 그룹들로 분할될 수 있고, 포트들의 제2 절반(예컨대, 수평 편파)에 대해서도 동일하게 배열될 수 있다. 각각의 커버 코드 구성 의 경우, 커버 코드는 N1개의 그룹들을 갖는 CSI-RS 포트들에 대해 설계될 수 있으며, 여기서 그룹들 각각은 N2 개의 포트들을 갖는다. N1은 열당 TxRU들의 수에 대응할 수 있고, N2는 안테나 아키텍처의 열들의 수에 대응할 수 있다. 일부 경우들에서, N1개의 그룹들은 번들링 후의 안테나 아키텍처의 열들의 수에 대응할 수 있고, N2 개의 포트들은, 예를 들어 안테나 아키텍처의 행들의 수에 대응할 수 있다. 도 11은 커버 코드 구성을 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름도이다. 이러한 예 에서, BS들(102a, 102b)은, 도 8 내지 도 10과 관련하여 본 명세서에 설명된 공간 상관관계들과 같은, 하나 이 상의 안테나 아키텍처들(1102a 내지 1102c)에 대한 소정의 공간 상관관계들로 구성될 수 있다. UE는 또한, 안테나 아키텍처들(1102a 내지 1102c) 각각과 연관된 소정 머신 학습 모듈들(1104a 내지 1104c)로 구성될 수 있다. 예를 들어, 안테나 아키텍처(1102a)는 도 8과 관련하여 본 명세서에 설명된 안테나 아키텍처를 나타 낼 수 있고, 머신 학습 모듈(1104a)은 인공 지능 모듈을 나타낼 수 있다. 소정 경우들에서, 안테나 아키 텍처는 CSI-RS 포트 그룹화에 따라 표현될 수 있다. CSI-RS 포트들은, 예를 들어, N1개의 그룹들과 관련 하여 본 명세서에 설명된 바와 같이 그룹들로 배열될 수 있으며, 여기서 각각의 그룹은 N2개의 포트들을 갖는다. 예를 들어, CSI-RS 리소스 그룹은 하나 이상의 CSI-RS 포트들(들)과 연관될 수 있고, 이 는 소정의 안테나 엘리먼트들을 나타낼 수 있다. CSI-RS 포트(들)는 특정 TxRU에 맵핑되는 안테나 엘리 먼트들, 예컨대 안테나 엘리먼트들(804a)의 세트에 대한 TxRU 맵핑을 나타낼 수 있다. 활동에서, UE는, 제1 BS(102a)로부터, 커버 코드 구성 인덱스 또는 식별자와 같은, 제1 안테나 아키 텍처(1002a)와 연관된 제1 커버 코드 구성의 표시를 수신할 수 있다. 제1 커버 코드 구성은 제1 BS(102a)에서 사용된 송신 공간 정보를 식별할 수 있다. UE는 제1 머신 학습 모듈(1104a)과 제1 안테나 아키텍처 (1102a) 사이의 관계로 구성될 수 있다. 제1 커버 코드 구성은 채널 추정 및/또는 CSI를 위해 제1 머신 학습 모듈(1104a)을 사용하도록 UE에 표시할 수 있다. 일부 경우들에서, 제1 머신 학습 모듈(1104a)은 채널 추 정 및 CSI 피드백을 위한 공동 머신 학습 모듈일 수 있다. 소정 경우들에서, 제1 머신 학습 모듈(1104a)은 채 널 추정을 위한 머신 학습 모듈 및 CSI 피드백을 위한 다른 머신 학습 모듈을 나타낼 수 있다. 소정 경우들에 서, 제1 머신 학습 모듈(1104a)은, 채널 추정 결과들을 입력으로서 취하는 CSI 피드백을 위한 머신 학습 모듈을 나타낼 수 있으며, 여기서 채널 추정은 AI 또는 비-AI 모듈들을 사용하여 수행될 수 있다. CSI 피드백 및/또는 채널 추정을 위한 다수의 AI/ML 모듈들이 존재할 수 있고, 제1 커버 코드 구성의 표시는, CSI 피드백 및/또는 채널 추정을 위해 어떤 AI/ML을 사용할지를 표시할 수 있다. UE는 또한, 제1 BS(102a)로부터, 제1 커버 코드 구성과 연관된 하나 이상의 CSI-RS들을 수신할 수 있다. 예를 들어, 제1 BS(102a)는 도 8과 관련하여 본 명세서에 설명되는 TxRU 대 안테나 엘리먼트 맵핑을 사용하여 CSI-RS를 송신할 수 있다. 활동에서, UE는 제1 안테나 아키텍처(1102a)와 연관된 제1 머신 학습 모듈(1104a)을 사용하여 제1 BS(102a)로부터 수신된 CSI-RS(들)의 채널 추정을 수행할 수 있다. 활동에서, UE는, 예를 들어, 활동에서 수행된 채널 추정 및/또는 수신된 CSI-RS(들)에 기초하 여 CSI 계산(들)을 수행할 수 있다. 예를 들어, UE는 CSI-RS와 연관된 채널 품질 표시자(channel quality indicator, CQI), 프리코딩 매트릭스 표시자(precoding matrix indicator, PMI), 기준 신호 수신 전력 (reference signal received power, RSRP), 및/또는 신호대간섭 및 잡음비(signal-to-interference plus noise ratio, SINR)를 결정할 수 있다. 소정 경우들에서, UE는 제1 머신 학습 모듈(1104a)을 사용하여 CSI를 생성할 수 있다. 활동에서, UE는 CSI-RS(들) 및 대응하는 제1 커버 코드 구성에 기초하여 CSI를 제1 BS(102a)로 송 신할 수 있다. 활동에서, UE는, 제2 BS(102b)로부터, 제2 안테나 아키텍처(1002b)와 연관된 제2 커버 코드 구성의 표시, 예컨대 커버 코드 구성 인덱스 또는 식별자를 수신할 수 있다. 제2 커버 코드 구성은 제2 BS(102b)에서 사용된 송신 공간 정보를 식별할 수 있다. UE는 제2 머신 학습 모듈(1104b)과 제2 안테나 아키텍처 (1102b) 사이의 관계로 구성될 수 있다. 제2 커버 코드 구성은 채널 추정 및/또는 CSI를 위해 제1 머신 학습 모듈(1104a)을 사용하도록 UE에 표시할 수 있다. UE는 또한, 제1 BS(102a)로부터, 커버 코드 구성 과 연관된 하나 이상의 CSI-RS들을 수신할 수 있다. 활동에서, UE는, 예를 들어, 제2 안테나 아키텍처(1102b)와 연관된 제2 머신 학습 모듈(1104b)을 사 용하여, 제2 BS(102b)로부터 수신된 CSI-RS(들)의 채널 추정을 수행할 수 있다. 활동에서, UE는,예를 들어, 제2 머신 학습 모듈(1104b)을 사용하여, 제2 BS(102b)로부터 수신된 CSI-Rs(들)과 연관된 CSI를 결 정할 수 있다. 활동에서, UE는 CSI-RS(들) 및 대응하는 제2 커버 코드 구성에 기초하여 CSI를 제2 BS(102b)로 송신할 수 있다. 소정 양태들에서, 송신 공간 정보는, 송신 공간 정보를 나타낼 수 있는 커버 코드와 연관된 머신 학습 모듈을 통해 표시될 수 있다. 머신 학습 모듈은 인공 지능 모듈 및/또는 뉴럴 네트워크 모듈을 나타낼 수 있다. 일부 경우들에서, UE는, 네트워크 엔티티로부터, 채널 추정 및/또는 CSI를 위한 뉴럴 네트워크 및/또는 머신 학습 모 듈들의 목록을 수신할 수 있다. 예를 들어, 네트워크 엔티티는 제어 시그널링, 예컨대 라디오 리소스 제어 (RRC) 시그널링, 다운링크 제어 정보(DCI), 매체 액세스 제어(MAC) 시그널링, 및/또는 시스템 정보, 또는 물리 적 다운링크 공유 채널(physical downlink shared channel, PDSCH) 상에서 반송되는 상위 계층 정보를 통한 뉴 럴 네트워크 및/또는 머신 학습의 목록으로 UE를 구성할 수 있다. 네트워크 엔티티는, 예를 들어, DCI 및/또는 MAC 시그널링을 통한 CSI-RS 커버 코드 구성 인덱스의 표시에 기초하여, 채널 추정 및/또는 CSI를 위해 뉴럴 네 트워크 및/또는 머신 학습 모듈들 중 어떤 것을 사용할지를 UE에 표시할 수 있다. 양태들에서, 머신 학습 모듈 들 각각과 특정 커버 코드 구성 사이에 일대일 맵핑이 존재할 수 있다. UE는 커버 코드 구성의 표시를 수신하 는 것에 응답하여 채널 추정 및/또는 CSI를 위해 대응하는 머신 학습 모듈을 적용할 수 있다. 머신 학습 모듈 표시는 기지국에서의 유연한 구현을 가능하게 할 수 있다. 각각의 기지국은 특정 안테나 아키 텍처와 연관된 안테나 엘리먼트 대 TxRU 맵핑을 결정할 자유를 가질 수 있다. UE에서 구현된 대응하는 커버 코 드, 인공 지능, 및/또는 머신 학습은 TxRU 맵핑에 따라 결정될 수 있다. 네트워크 엔티티는 UE에서 사용된 특 정 타입들의 인공 지능 및/또는 머신 학습 모듈들뿐만 아니라 소정 수의 인공 지능 및/또는 머신 학습 모듈들을 지원할 수 있다. 소정 양태들에서, UE에서의 인공 지능 및/또는 머신 학습 모듈들은 입력 및/또는 출력을 위한 특정 포맷을 지원 할 수 있다. 머신 학습 모듈의 입력은, 주파수 도메인에서의 CSI-RS와 같은 주파수 도메인 수신 신호를 포함할 수 있다. 수신된 신호는 특정 순서로, 예컨대 서브캐리어 인덱스의 증가하는 순서(첫 번째), 및 OFDM 심볼 인 덱스의 증가하는 순서(두 번째), 및 수신 안테나 인덱스의 증가하는 순서(세 번째)로 머신 학습 모듈에 입력될 수 있다. 머신 학습의 출력은 각각의 포트(예컨대, CSI-RS 포트)에 대한 주파수 도메인 채널 추정치를 포함할 수 있다. 소정 경우들에서, 머신 학습 모듈의 출력은 특정 순서로, 예컨대 포트 인덱스의 증가하는 순서(첫 번째), 및 서 브캐리어 인덱스의 증가하는 순서(두 번째), 및 OFDM 심볼 인덱스의 증가하는 순서(세 번째)로 배열될 수 있다. 일부 경우들에서, 순서는 서브캐리어 인덱스의 증가하는 순서(첫 번째), 및 OFDM 심볼 인덱스의 증가하는 순서 (두 번째), 및 포트 인덱스의 증가하는 순서(세 번째)일 수 있다. 그러한 경우들에서, 각각의 포트에 대해, 각 자의 채널 추정치는 각각의 RB에서의 서브캐리어들 및 OFDM 심볼들의 서브세트에 기초할 수 있고, 서브세트는 수신된 신호와 동일한 서브캐리어/OFDM 심볼들일 수 있다. 일부 경우들에서, 머신 학습 모듈의 출력은 특정 순 서로, 예컨대 포트 인덱스(첫 번째), 및 RB 인덱스(두 번째)의 증가하는 순서로 배열될 수 있다. 그러한 경우 들에서, 각각의 포트에 대해, 각자의 채널 추정치는 각각의 RB의 기준 서브캐리어에 기초할 수 있으며, 여기서 기준 서브캐리어 인덱스는 5G NR에 대한 3GPP 표준들과 같은 무선 통신 표준에서 정의될 수 있다. 도 12는 커버 코드와 연관된 머신 학습 모듈을 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름 도이다. 이러한 예에서, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에서 설명된 바와 같이, 제1 BS(102a)는 제1 안테나 아키텍처(1202a)와 연관된 제1 공간 상관관계를 지원할 수 있고, 제2 BS(102b)는 각자의 안테나 아키텍처들(1202b, 1202c)과 연관된 제2 및 제3 공간 상관관계들을 지원할 수 있다. 활동에서, UE는, 제1 BS(102a)로부터, 제1 BS(102a)에 의해 지원되는 머신 학습 모듈(들)을 식별하 는 표시를 수신할 수 있다. 이러한 예에서, 제1 BS(102a)는, 머신 학습 모듈 3이 제1 안테나 아키텍처(1202a) 에 대해 지원된다는 것을 표시한다. 소정 경우들에서, 표시는 제1 BS(102a)에 의해 지원되는 머신 학습 모듈들 의 목록을 포함할 수 있다. 표시는, 예를 들어, RRC 시그널링을 통해 제공될 수 있다. 활동에서, UE는 제2 BS(102b)로부터, 제2 BS(102b)가 안테나 아키텍처들(1202b, 1202c)에 대해 각 각 머신 학습 모듈들 1 및 2를 지원한다는 것을 식별하는 표시를 수신할 수 있다. 활동에서, UE는, 제1 BS(102a)로부터, 머신 학습 모듈 3과 연관된 특정 커버 코드를 사용하기 위한 표시를 수신할 수 있다. 예를 들어, UE는 머신 학습 모듈 3과 연관된 커버 코드 구성의 표시를 수신할 수 있다. 특정 커버 코드를 사용하기 위한 표시는, 예를 들어, DCI 및/또는 MAC 시그널링을 통해 수신될 수 있다.UE는 또한, 제1 BS(102a)로부터, 커버 코드에 기초하여 CSI-RS(들)를 수신할 수 있다. 본 명세서에 설명 된 바와 같이, 커버 코드의 표시는 채널 추정 및/또는 CSI 피드백을 위해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있으며, 여기서 AI/ML 모듈은 채널 추정 및/또는 CSI 피드백을 위해 공동으로 또는 별개로 설계될 수 있다. 일부 경우들에서, 커버 코드의 표시는, CSI 피드백을 위해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있다. 활동에서, UE는, 예를 들어, 채널 추정 및/또는 수신된 CSI-RS(들)에 기초하여, 제1 안테나 아키텍 처(1202a)와 연관된 머신 학습 모듈 3을 사용하여 제1 BS(102a)로부터 수신된 CSI-RS(들)의 채널 추정을 수행할 수 있다. 활동에서, UE는 제1 안테나 아키텍처(1202a)와 연관된 머신 학습 모듈 3을 사용하여 CSI 를 생성할 수 있다. 활동에서, UE는 CSI-RS(들)에 기초하여 CSI를 제1 BS(102a)로 송신할 수 있다. 활동에서, UE는, 제2 BS(102b)로부터, 머신 학습 모듈 2와 연관된 특정 커버 코드를 사용하기 위한 표시를 수신할 수 있다. UE는 또한, 제2 BS(102b)로부터 커버 코드에 기초한 CSI-RS(들)를 수신할 수 있 다. 활동에서, UE는 제2 안테나 아키텍처(1202b)와 연관된 머신 학습 모듈 2를 사용하여, 제2 BS(102b)로부터 수신된 CSI-RS(들)의 채널 추정을 수행할 수 있다. 활동에서, UE는 제2 안테나 아 키텍처(1202b)와 연관된 머신 학습 모듈 2를 사용하여 CSI를 생성할 수 있다. 활동에서, UE는 CSI- RS(들)에 기초하여 CSI를 제2 BS(102a)로 송신할 수 있다. 소정 양태들에서, 송신 공간 정보는 준 공동위치(QCL) 타입 및/또는 QCL 기준 신호와 같은 QCL 정보를 통해 표 시될 수 있다. QCL 타입은, 본 명세서에 추가로 설명되는 바와 같은 QCL-TypeE와 같은, 송신 공간 관계 및/또 는 파라미터와 연관된 별개의 타입일 수 있다. QCL 정보는 송신 공간 정보에 대한 QCL 타입과 연관된 QCL 기준 신호 및/또는 추적 기준 신호(tracking reference signal, TRS)를 통해 표시될 수 있다. QCL 정보는, 타깃 신 호 및/또는 채널이 QCL 타입에 기초하여 QCL 기준 신호 및/또는 TRS와 QCL 관계를 갖는다는 것을 표시할 수 있 다. 송신 공간 정보에 대한 QCL 기준 신호는, 송신 공간 정보 및/또는 합성 훈련 데이터를 전달하는 것과 연관 된 SSB, TRS, CSI-RS, 별개의 RS를 포함할 수 있다. 타깃 신호 및/또는 채널은 송신 공간 정보와 연관된 특정 TRS/CSI-RS 또는 합성 훈련 데이터와 준 공동위치된 것으로 간주될 수 있다. QCL 기준 신호(예컨대, TRS)는 (예를 들어, 안테나 아키텍처들과 관련하여 본 명세서에서 설명된 바와 같은) 하나 초과의 포트, 협대역(예컨대, 1개의 RB 내지 24개의 RB들), 및/또는 긴 주기성(예컨대, > 640개의 슬롯들)을 가질 수 있다. 소정 양태들에서, 송신 공간 정보에 대한 QCL 기준 신호는 임의의 CSI 보고와 연관되지 않을 수 있다. 예를 들 어, CSI 보고 설정은 QCL 기준 신호에 대한 보고 수량을 없음(none)으로 식별할 수 있다. UE는 송신 공간 관계 또는 파라미터와 연관된 QCL 타입을 식별하는 QCL 구성을 수신할 수 있다. UE는 송신 공 간 정보에 대한 QCL 정보에 기초하여 채널 추정을 수행할 수 있다. UE는 QCL 기준 신호에 공간 추적 루프를 적 용할 수 있다. 비-인공 지능 기반 기법들의 경우, UE는 포트들 사이의 공간 상관관계를 획득하고, 포트 외삽 (port extrapolation)을 위해 공간 상관관계를 사용할 수 있다. 인공 지능 기반 기법들의 경우, UE는 채널 추정을 위해 다수의 뉴럴 네트워크 모듈들로 구성되고, 대응하는 QCL 기준 신호와 연관된 측정된 송신 공간 관계에 기초하여 뉴럴 네트워크 모듈들 중 적어도 하나를 선택할 수 있다. 일부 경우들에서, UE는 채널 추정을 위해 뉴럴 네트워크 모듈로 구성되고, 뉴럴 네트워크 모듈에 대한 입력으로서 송신 공간 관계를 취할 수 있다. QCL 정보 및/또는 타입들은, 다른 정보에 의존하거나 또는 그의 함수일 수 있다. 하나 이상의 예들에 따르면, UE에 표시된 QCL 타입들은 상위 계층 파라미터 QCL-Type에 기초할 수 있고, 다음의 타입들 중 하나 또는 이들의 조합을 취할 수 있다: QCL-타입A: {도플러 시프트, 도플러 확산, 평균 지연, 지연 확산}, QCL-타입B: {도플러 시프트, 도플러 확산}, QCL-타입C: {평균 지연, 도플러 시프트}, QCL-타입D: {공간 수신(Rx) 파라미터}, 또는 QCL-타입E: {공간 송신(Tx) 파라미터 또는 관계}. QCL 가정은 주파수 분산 가정, 시간 분산 가정, 및/또는 공간 가정을 포함할 수 있다. 주파수 분산 가정은 도 플러 시프트 및/또는 도플러 확산을 포함할 수 있고, 시간 분산 가정은 평균 지연 및/또는 지연 확산을 포함할 수 있다. 공간 가정(예컨대, QCL-타입D에 대한 공간 Rx 파라미터들 및/또는 QCL-타입E에 대한 Tx 공간 관계)은수신 및/또는 송신 빔포밍을 위한 다양한 공간 파라미터들, 예컨대, 도착 각도(angle of arrival, AoA), AoA 확 산, 우세한 AoA, 평균 AoA, AoA의 각도 확산, AoA의 전력 각도 스펙트럼(Power Angular Spectrum, PAS), 출발 각도(angle of departure, AoD), AoD 확산, 평균 AoD, AoD의 각도 확산, AoD의 PAS, 제니스 도착 각도(zenith angle of arrival, ZoA), ZoA 확산, 우세한 ZoA, 평균 ZoA, ZoA의 각도 확산, 제니스 출발 각도(zenith angle of departure, ZoD)의 전력 각도 스펙트럼(PAS), ZoD 확산, 우세한 ZoD, 평균 ZoD, ZoD의 각도 확산, ZoD의 PAS, 송신/수신 채널 상관관계, 송신/수신 빔포밍, 공간 채널 상관관계 등을 나타낼 수 있다. 공간 QCL 가정들 은, UE가 (예컨대, 빔 관리 절차들 동안) 수신 빔 및/또는 송신 빔을 빔포밍하기 위한 공간 필터(아날로그, 디 지털, 또는 하이브리드)를 결정하는 것을 가능하게 할 수 있다. 예를 들어, SSB 리소스 표시자는 이전 기준 신 호(예를 들어, SSB)에 대한 AoA 확산이 후속 송신(예를 들어, PDSCH 송신)을 위해 사용될 수 있음을 표시할 수 있다. 도 13은 QCL 정보를 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름도이다. 이러한 예에서, BS는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에서 설명된 바와 같이, 안테나 아키텍처들(1302a 내지 1302c) 각각과 연관된 공간 상관관계를 지원할 수 있다. 일부 경우들에서, UE는 채널 추정을 수행하 도록 그리고/또는 QCL 기준 신호로부터 도출된 송신 공간 정보를 입력으로서 취하는 CSI를 생성하도록 구성될 수 있다. 소정 경우들에서, UE는 비닝(binning) 기반 접근법을 적용할 수 있으며, 여기서 N개의 훈련된 머신 학습 모듈들(또는 뉴럴 네트워크들)이 존재하고, 머신 학습 모듈들 각각은 송신 정보 통계치들의 범위와 연관된다. UE는 QCL 기준 신호로부터 도출된 측정된 송신 공간 정보에 기초하여, 채널 추정 및/또는 CSI 피드백을 위해 머신 학습 모듈들 중 어떤 것을 사용할지를 결정할 수 있다. 활동에서, BS는 안테나 아키텍처들(1302a 내지 1302c) 중 하나와 연관된 특정 공간 상관관계를 사용 하도록 선택할 수 있다. 예를 들어, BS는 제1 안테나 아키텍처(1302a) 및 대응하는 TxRU 맵핑, 예컨대 도 8과 관련하여 본 명세서에 설명된 아키텍처 및 맵핑을 선택할 수 있다. 활동에서, UE는 BS로부터, 송신 공간 정보와 연관된 QCL 정보를 표시하는 QCL 구성을 수신할 수 있다. 예를 들어, 구성은 송신 공간 관계 또는 파라미터와 연관된 QCL 타입을 갖는 하나 이상 의 QCL 기준 신호들을 식별할 수 있다. 일부 경우들에서, QCL 기준 신호들은 SSB 리소스 ID 및/또는 TRS 리소스 ID와 같은 기준 신호 리소스 식별자(ID)들을 통해 표시될 수 있다. 구성은, SSB 리소스 ID와 연관된 SSB가 TRS 리소스 ID와 연관된 TRS와 QCL 관계를 갖는다는 것을 식별할 수 있다. UE는 또한, BS로부터 QCL 기준 신호(예컨대, TRS)를 수신할 수 있으며, 여기서 QCL 기준 신호는 머신 학습 모듈에 대한 훈련 데이터를 나타낼 수 있다. QCL 기준 신호는 주기적 기준 신호, 반-영구적 기준 신호, 및/또는 비주기적 기준 신호일 수 있다. 활동에서, UE는 QCL 기준 신호의 공간 추적 루프에 기초하여 송신 공간 정보를 결정할 수 있다. UE는 QCL 기준 신호의 측정치들을 사용하여 공간 정보의 추정을 수행할 수 있다. 일부 경우들에서, UE는 QCL 기준 신호의 측정치들에 기초하여 머신 학습 모듈을 훈련시킬 수 있고, 이는 송신 공간 정보를 표시할 수 있다. 활동에서, BS는 연관된 제1 안테나 아키텍처(1302a)에 기초하여 커버 코드/빔포머를 선택할 수 있다. 활동에서, UE는 활동에서 도출된 송신 공간 정보에 기초하여 BS로부터 CSI-RS를 수신할 수 있다. 활동에서, UE는 활동에서 QCL 기준 신호로부터 도출된 송신 공간 정보를 사용하여 BS로부터 수신된 CSI-RS(들)의 채널 추정을 수행할 수 있다. 예를 들어, UE는 QCL 기준 신호에 기초 하여 훈련된 머신 학습 모듈을 사용하여 채널 추정을 수행할 수 있다. 활동에서, UE는 활동 에서 QCL 기준 신호로부터 도출된 송신 공간 정보를 사용하여 CSI를 생성할 수 있다. 예를 들어, UE는 QCL 기준 신호에 기초하여 훈련된 머신 학습 모듈을 사용하여 CSI를 생성할 수 있다. 활동에서, UE(10 4)는 CSI-RS(들) 및 대응하는 송신 공간 정보에 기초하여 CSI를 BS로 송신할 수 있다. 소정 양태들의 경우, 송신 공간 정보는 분포 내 구성을 통해 표시될 수 있다. 분포 내 구성은, 타깃 신호 또는 채널이 합성 신호 또는 채널과 동일한 분포로 전달될 수 있다는 것을 표시할 수 있다. 타깃 신호 또는 채널은 머신 학습 및/또는 인공 지능 모듈에 대한 합성 훈련 데이터 채널 샘플과 동일한 분포를 가질 수 있다. 네트워 크 엔티티는 합성 데이터를 (예를 들어, UE로) 출력할 수 있고, UE는 합성 데이터를 사용하여 머신 학습 모듈의 온라인 훈련을 수행할 수 있다. UE는 네트워크 엔티티로부터 수신된 소정의 신호들 및/또는 채널들에 훈련된 머신 학습 모듈을 적용할 수 있다. 머신 학습 모듈들 각각에 대한 훈련 데이터로 네트워크 엔티티에 의해(예컨대, 제1 기지국 및 제2 기지국에 의해) 트리거되는 다수의 온라인 훈련 절차들이 존재할 수 있다. 예를 들어, UE는 제1 기지국(또는 안테나 아키텍처)과 연관된 제1 머신 학습 모듈에 대한 그리고 제2 기지국(또는 안테나 아키텍처)과 연관된 제2 머신 학습 모듈에 대한 훈련을 수행할 수 있다. 분포 내는, 어떤 머신 학습 모듈을 적 용할지를 표시할 수 있다. 소정 양태들에서, UE에서의 인공 지능 및/또는 머신 학습 모듈들은 입력 및/또는 출력을 위한 특정 포맷을 지원 할 수 있다. 머신 학습 모듈은 주파수 도메인 수신 신호를 입력으로서 취할 수 있다. 수신된 신호 및 합성 데 이터는, 예를 들어, 서브캐리어 인덱스의 증가하는 순서(첫 번째), 및 OFDM 심볼 인덱스의 증가하는 순서(두 번 째), 및 수신 안테나 인덱스의 증가하는 순서(세 번째)로 머신 학습 모듈에 입력될 수 있다. 도 14는 기지국과 연관된 머신 학습 모듈들에 대한 분포 내 구성을 통해 송신 공간 정보를 표시하는 일례를 예 시하는 시그널링 흐름도이다. 활동에서, BS는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서 에 설명된 바와 같이, 제1 안테나 아키텍처 및/또는 TxRU 맵핑과 연관된 공간 상관관계를 결정할 수 있다. 활 동에서, UE는 BS로부터, 제1 안테나 아키텍처와 연관된 합성된 훈련 데이터를 수신할 수 있다. 활동에서, BS는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에 설명된 바와 같이, 제2 안테 나 아키텍처 및/또는 TxRU 맵핑과 연관된 공간 상관관계를 결정할 수 있다. 활동에서, UE는 BS로부터, 제2 안테나 아키텍처와 연관된 합성된 훈련 데이터를 수신할 수 있다. 활동에서, UE는 BS의 제1 안테나 아키텍처와 연관된 훈련 데이터에 기초하여 제1 머신 학습 모듈을 훈련할 수 있다. 활동에서, UE는 BS의 제2 안테나 아키텍처와 연관된 훈련 데이터에 기초하여 제2 머신 학습 모듈을 훈련할 수 있다. 활동에서, BS는 UE와의 통신들을 위해 사용할 제1 안테나 아키텍처를 선택할 수 있다. 활동 에서, UE는 BS로부터 CSI-RS를 수신할 수 있으며, 여기서 BS는 CSI-RS를 송신하기 위해 제1 안테나 아키텍처와 연관된 커버 코드/빔포머를 사용할 수 있다. 활동에서, UE는, CSI-RS가 제1 안테나 아키텍처와 연관된 훈련 데이터와 분포 내에 있다는 표시를 수신할 수 있다. 표시는, UE가 채널 추정 및/또는 CSI 피드백을 위해 제1 머신 학습 모듈을 사용하도록 트리거할 수 있다. 본 명세서에 설명된 바 와 같이, 훈련 데이터와의 분포 내의 표시는 채널 추정 및/또는 CSI 피드백을 위해 어떤 AI/ML 모듈을 사용할지 를 표시할 수 있으며, 여기서 AI/ML 모듈은 채널 추정 및/또는 CSI 피드백을 위해 공동으로 또는 개별적으로 설 계될 수 있다. 본 명세서에 설명된 일부 경우들에서, 훈련 데이터와의 분포 내의 표시는 CSI 피드백을 위해 어 떤 AI/ML 모듈을 사용할지를 표시할 수 있으며, 여기서 CSI 피드백을 위한 AI/ML 모듈은 채널 추정 결과들을 입 력으로서 취할 수 있고, 채널 추정 결과들은 AI 또는 비-AI 방법들을 통해 생성될 수 있다. 활동에서, UE는 활동에서 훈련된 제1 머신 학습 모듈을 사용하여 BS로부터 수신된 CSI-RS(들)의 채널 추 정을 수행할 수 있다. 활동에서, UE는, 예를 들어, 채널 추정 및/또는 수신된 CSI-RS(들)에 기초하 여, 활동에서 훈련된 제1 머신 학습 모듈을 사용하여 CSI를 생성할 수 있으며, 여기서 채널 추정 결과들 은 AI 또는 비-AI 방법들을 통해 생성될 수 있다. 활동에서, UE는 CSI-RS(들) 및 대응하는 송신 공 간 정보에 기초하여 CSI를 BS로 송신할 수 있다. 도 15는 다수의 기지국들과 연관된 머신 학습 모듈들에 대한 분포 내 구성을 통해 송신 공간 정보를 표시하는 다른 예를 예시하는 시그널링 흐름도이다. 활동에서, 제1 BS(102a)는, 예를 들어, 도 8 내지 도 10과 관 련하여 본 명세서에 설명된 바와 같이, 제1 안테나 아키텍처 및/또는 TxRU 맵핑과 연관된 공간 상관관계를 결정 할 수 있다. 활동에서, UE는 제1 BS(102a)로부터, 제1 안테나 아키텍처와 연관된 합성된 훈련 데이 터를 수신할 수 있다. 활동에서, 제2 BS(102b)는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에 설명된 바와 같이, 제2 안테나 아키텍처 및/또는 TxRU 맵핑과 연관된 공간 상관관계를 결정할 수 있다. 활동 에서, UE는 제2 BS(102b)로부터, 제2 안테나 아키텍처와 연관된 합성된 훈련 데이터를 수신할 수 있 다. 활동에서, UE는 제1 BS(102a)의 제1 안테나 아키텍처와 연관된 훈련 데이터에 기초하여 제1 머 신 학습 모듈을 훈련할 수 있다. 활동에서, UE는 제2 BS(102b)의 제2 안테나 아키텍처와 연관된 훈 련 데이터에 기초하여 제2 머신 학습 모듈을 훈련할 수 있다. 활동에서, UE는 제1 BS(102a)로부터 CSI-RS를 수신할 수 있으며, 여기서 제1 BS(102a)는 CSI-RS를 송신하기 위해 제1 안테나 아키텍처와 연관된 커버 코드/빔포머를 사용할 수 있다. 활동에서, UE는 제1 BS(102a)로부터, CSI-RS가 제1 안테나 아키텍처와 연관된 훈련 데이터와 분포 내에 있다는 표시를 수신할 수 있다. 표시는, UE가 채널 추정 및/또는 CSI 피드백을 위해 제1 머신 학습 모듈을 사용하도록 트리거할 수 있다. 본 명세서에 설명된 바와 같이, 훈련 데이터와의 분포 내의 표시는 채널 추정 및/또는 CSI 피드백을 위해 어떤 AL/ML 모듈을 사용할지를 표시할 수 있으며, 여기서 AI/ML 모듈은 채널 추정 및/또는 CSI 피드백을위해 공동으로 또는 개별적으로 설계될 수 있다. 본 명세서에 설명된 일부 경우들에서, 훈련 데이터와의 분포 내의 표시는 CSI 피드백을 위해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있으며, 여기서 CSI 피드백을 위한 AI/ML 모듈은 채널 추정 결과들을 입력으로서 취할 수 있다. 활동에서, UE는 활동에서 훈련 된 제1 머신 학습 모듈을 사용하여 제1 BS(102a)로부터 수신된 CSI-RS(들)의 채널 추정을 수행할 수 있다. 활 동에서, UE는, 예를 들어, 채널 추정 및/또는 수신된 CSI-RS(들)에 기초하여, 활동에서 훈련 된 제1 머신 학습 모듈을 사용하여 CSI를 생성할 수 있으며, 여기서 채널 추정은 AI 또는 비-AI 방법들을 통해 생성될 수 있다. 활동에서, UE는 CSI-RS(들) 및 대응하는 송신 공간 정보에 기초하여 CSI를 제1 BS(102a)로 송신할 수 있다. 도 16은 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름도이다. 활동에서, UE는 BS로부터, 송신 공간 정보의 표시를 수신할 수 있다. 송신 공간 정보의 표시는, 예를 들어, 도 11 내지 도 15와 관련하여 본 명세서에 설명된 바와 같이, 송신 공간 정보와 연관된 커버 코드 구성, 머신 학습 모듈, QCL 정보, 및/또는 분포 내 구성의 표시를 포함할 수 있다. 송신 공간 정보는 P개의 포트들(예컨대, TxRU들)을 각각의 리소스 블록 내의 L개의 리소스 엘리먼트들에 맵핑할 수 있으며, 여기서 L은 P 미만이다. 예를 들어, 송신 공간 정보는, P개의 포트들이 리소스 블록당 L개의 리소스 엘리먼트들을 점유한다는 것을 식별할 수 있는 데, 예를 들어, 여기서 {P, L} = {32, 8} 또는 {128, 32}이다. 그러한 송신 공간 정보는, UE가 BS의 안 테나 아키텍처와 연관된 주파수 대역폭을 프로세싱하는 것을 가능하게 할 수 있다. 소정 경우들에서, 송신 공 간 정보의 표시는 채널 추정 및/또는 CSI 피드백을 위해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있으며, 여기 서 AI/ML 모듈은 채널 추정 및/또는 CSI 피드백을 위해 공동으로 또는 별개로 설계될 수 있다. 예를 들어, 송 신 공간 정보의 표시는 CSI 피드백을 결정하기 위해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있다. 활동에서, UE는 BS로부터, 송신 공간 정보와 연관된 하나 이상의 기준 신호들을 수신할 수 있 다. BS는, 예를 들어, 도 8 내지 도 10과 관련하여 본 명세서에 설명된 바와 같이, 안테나 아키텍처와 연 관된 TxRU 맵핑을 사용하여 기준 신호들을 송신할 수 있다. 일부 경우들에서, 기준 신호(들)는, 예를 들어, 도 13과 관련하여 본 명세서에 설명된 바와 같이, QCL 기준 신호를 포함할 수 있다. 소정 경우들에서, 기준 신호 (들)는 SSB, CSI-RS, TRS, 또는 이들의 임의의 조합을 포함할 수 있다. 선택적으로, 활동에서, UE는 송신 공간 정보에 기초하여 머신 학습 모듈을 훈련시키거나 또는 선택 할 수 있다. 일부 경우들에서, 송신 공간 정보의 표시는 특정 머신 학습 모듈과 연관된 커버 코드 구성을 식별 하여, 송신 공간 정보의 표시가, UE가 채널 추정 및/또는 CSI 피드백을 위한 머신 학습 모듈을 선택하도록 트리거하게 할 수 있다. 소정 경우들에서, 송신 공간 정보의 표시는 QCL 정보 및/또는 분포 내 구성을 식별할 수 있으며, 이는 각각 QCL 기준 신호 및/또는 훈련 데이터에 기초하여 머신 학습 모듈을 훈련시키는 데 사용될 수 있다. 활동에서, UE는 송신 공간 정보 및 기준 신호(들)의 측정치들에 기초하여 UE와 BS 사이의 채널의 채널 추정을 수행할 수 있다. 예를 들어, UE는 채널 추정을 수행하기 위해 활동에서 선택/ 훈련된 머신 학습 모듈을 사용할 수 있다. 활동에서, UE는 채널 추정 및/또는 송신 공간 정보에 기초하여 CSI를 결정할 수 있다. 예를 들어, UE는 CSI를 생성하기 위해 활동에서 선택/훈련된 머신 학습 모듈을 사용할 수 있다. 일부 경우들에 서, UE는 채널 추정 및/또는 수신된 기준 신호(들)에 기초하여 CSI를 생성하기 위해 머신 학습 모듈을 사 용할 수 있다. 활동에서, UE는 송신 공간 정보 및/또는 수신된 기준 신호(들)에 기초하여 CSI를 BS로 송신할 수 있다. 예를 들어, CSI는 기준 신호(들)와 연관된 CQI, PMI, RSRP 및/또는 SINR을 표시할 수 있다. 활동에서, UE는 CSI에 기초하여 BS와 통신할 수 있다. 예를 들어, BS는 CSI에 기초하여 UE와의 통신들을 위해 사용된 변조 및 코딩 스킴을 조정할 수 있다. 비-적응형 알고리즘은 그의 입력들의 함수로서 결정론적이다. 알고리즘이 상이한 시간들에서 정확히 동일한 입 력들에 직면하면, 그의 출력들은 정확하게 동일할 것이다. 적응형 알고리즘(예컨대, 머신 학습 또는 인공 지능)은 그의 과거 경험에 기초하여 그의 거동을 변경하는 알고리즘이다. 이것은, 적응형 알고리즘을 사용하는 상이한 디바이스들이 시간이 경과함에 따라 상이한 알고리즘들을 사용하게 될 수 있다는 것을 의미한다. 소정 양태들에 따르면, 채널 추정 및 CSI 피드백 절차들은 적응형 학습 기반 알고리즘(예컨대, 머신 학습 모듈 )을 사용하여 수행될 수 있다. 따라서, 시간이 지남에 따라, 채널 추정 및 CSI 피드백 알고리즘은 새로운학습에 기초하여 변경(예컨대, 적응 또는 업데이트)된다. 채널 추정 및 CSI 피드백 절차들은 송신 전력 제어, 변조 및 코딩 스킴(들), 코드 레이트, 서브캐리어 간격 등과 같은, UE와 네트워크 엔티티 사이의 통신 링크의 다양한 특성들을 적응시키기 위해 사용될 수 있다. 예를 들어, 적응형 학습은 본 명세서에서 설명된 송신 공간 정보에 기초하여 채널 추정 및/또는 CSI 피드백을 결정하는 데 사용될 수 있다. 적응형 학습은, UE가, 네트워 크 엔티티에서의 정확한 안테나 아키텍처를 알지 못하고, 안테나 엘리먼트들에 대한 TxRU 맵핑(예를 들어, 도 8 내지 도 10에 도시된 맵핑(들))에 기초하여 채널 추정 및/또는 CSI 피드백을 결정하는 것을 가능하게 할 수 있 다. 일부 예들에서, 적응형 학습 기반 CSI/채널 추정은 예측 모델과 같은 모델을 훈련시키는 것을 수반한다. 모델 은 네트워크 엔티티에 의해 표시된 송신 공간 정보(예컨대, 커버 코드 구성)에 기초하여 기준 신호들과 연관된 CSI/채널 추정을 결정하는 데 사용될 수 있다. 모델은, CSI/채널 추정과 연관된 피드백(예컨대, 기준 신호들의 측정치들)과 같은 피드백을 포함할 수 있는 훈련 데이터(예컨대, 훈련 정보)에 기초하여 훈련될 수 있다. 도 17은 예측 모델이 CSI/채널 추정을 결정하기 위해 사용되는 예시적인 네트워크화된 환경을 예시 한다. 도 17에 도시된 바와 같이, 네트워크화된 환경은 네트워크를 통해 통신가능하게 연결된 노 드, 훈련 시스템, 및 훈련 저장소를 포함한다. 노드는 (예컨대, 무선 통신 네트워크 의 UE와 같은) UE 또는 (예컨대, 무선 통신 네트워크의 BS와 같은) BS일 수 있다. 네트 워크는 무선 통신 네트워크와 같은 무선 네트워크일 수 있으며, 이는 5G NR 네트워크일 수 있다. 훈련 시스템, 노드, 및 훈련 저장소가 도 17에서 별개의 컴포넌트들로서 예시되어 있지만, 훈련 시스템, 노드, 및 훈련 저장소는 임의의 수의 컴퓨팅 시스템들 상에서, 하나 이상의 독 립형 시스템들로서 또는 분산 환경에서 구현될 수 있다는 것이 당업자에 의해 인식되어야 한다. 훈련 시스템은 대체적으로 예측 모델 훈련 관리자를 포함하며, 이는 훈련 데이터를 사용하여, 네트 워크 엔티티와 연관된 소정의 송신 공간 정보에 기초하여 채널 추정 및/또는 CSI를 결정하기 위한 예측 모델 을 생성한다. 예측 모델은 훈련 저장소 내의 정보에 기초하여 결정될 수 있다. 훈련 저장소는 노드의 배치 전 및/또는 후에 획득되는 훈련 데이터를 포함할 수 있다. 노드(172 0)는 노드의 배치 이전에 시뮬레이션된 통신 환경에서 (예컨대, 필드 테스트, 구동 테스트 등에서) 훈련 될 수 있다. 예를 들어, 다양한 CSI 및/또는 채널 추정들(예컨대, CQI, PMI, RSRP, SINR 등)은 다양한 시나리 오들에서, 예컨대 네트워크 엔티티에서의 상이한 안테나 아키텍처들, 네트워크 엔티티에서 사용된 상이한 TxRU 대 안테나 엘리먼트 맵핑들, 상이한 커버 코드들로, 상이한 UE 속력들에서, UE 정지상태로, UE의 다양한 회전들 에서, 다양한 BS 배치들/기하구조들 등으로 테스트되어, CSI/채널 추정 절차와 관련된 훈련 정보를 획득할 수 있다. 이러한 정보는 훈련 저장소에 저장될 수 있다. 배치 후에, 훈련 저장소는 노드에 의 해 수행된 CSI/채널 추정 절차들과 연관된 피드백을 포함하도록 업데이트될 수 있다. 훈련 저장소는 또한, 예 를 들어, 다른 BS들 및 다른 UE들에 의한 학습된 경험에 기초하여, 그들 BS들 및/또는 그들 UE들로부터의 정보 로 업데이트될 수 있으며, 이는 그들 BS들 및/또는 그들 UE들에 의해 수행되는 CSI/채널 추정 절차들과 연관될 수 있다. 예측 모델 훈련 관리자는 훈련 저장소 내의 정보를 사용하여, CSI/채널 추정을 위해 사용된 예측 모델(예컨대, 알고리즘)을 결정, 예컨대 CQI, PMI, RSRP, SINR 등을 결정할 수 있다. 본 명세서에서 더 상세히 논의되는 바와 같이, 예측 모델 훈련 관리자는 예측 모델을 형성하기 위해 머신 학습, 심층 학습, 강화 학습 등과 같은 다양한 상이한 타입들의 적응형 학습을 사용할 수 있다. 훈련 시스템은 시간 이 경과함에 따라 예측 모델을 적응(예컨대, 업데이트/개선)시킬 수 있다. 예를 들어, 훈련 저장소가 새 로운 훈련 정보(예컨대, 피드백)로 업데이트됨에 따라, 모델은 새로운 학습/경험에 기초하여 업데이트된 다. 훈련 시스템은 노드 상에, 네트워크 내의 BS 상에, 또는 예측 모델을 결정하는 상이한 엔티티 상에 위치될 수 있다. 상이한 엔티티 상에 위치되는 경우, 예측 모델은 노드에 제공된다. 훈련 저장소는 메모리와 같은 저장 디바이스일 수 있다. 훈련 저장소는 노드, 훈련 시스템 , 또는 네트워크 내의 다른 엔티티 상에 위치될 수 있다. 훈련 저장소는 클라우드 저장소 내에 있을 수 있다. 훈련 저장소는 노드, 네트워크 내의 엔티티들(예컨대, 네트워크 내의 BS들 또는 UE들), 클라우드, 또는 다른 소스들로부터 훈련 정보를 수신할 수 있다. 전술된 바와 같이, 노드에는 예측 모델이 제공된다(또는 예컨대, 훈련 시스템이 노드 에서 구현되는 경우, 이를 생성함). 예시된 바와 같이, 노드는 본 명세서에서 설명된 송신 공간 정보에 기초하여 CSI/채널 추정을 위해 예측 모델을 사용하도록 구성된 CSI/채널 추정 관리자를 포함할 수 있다. 일부 예들에서, 노드는 예측 모델을 활용하여 CSI를 생성하고, 그리고/또는 송신 공간 정보 에 기초하여 채널 추정을 결정한다. 예측 모델은, 훈련 시스템이 예측 모델을 새로운 학습 으로 적응시킴에 따라 업데이트된다. 따라서, 노드의, 예측 모델을 사용하는 CSI/채널 추정 알고리즘은 적응형 학습 기반인데, 이는, 노 드에 의해 사용된 알고리즘이, 노드가 배치 시나리오들에서 획득하는 경험/피드백에 기초하여 (그 리고/또는 다른 엔티티들에 의해 또한 제공된 훈련 정보로), 배치 후에도, 시간이 지남에 따라 변경되기 때문이 다. 소정 양태들에 따라, 적응형 학습은 임의의 적절한 학습 알고리즘을 사용할 수 있다. 상기 언급된 바와 같이, 학습 알고리즘은 (예컨대, 훈련 시스템과 같은) 훈련 시스템에 의해 사용되어, 본 명세서에서 설명된 송 신 공간 정보에 기초하여 CSI/채널 추정을 결정하기 위해 (예컨대, 노드와 같은) 디바이스에 의해 사용되 는 적응형 학습 기반 CSI/채널 추정 알고리즘을 위한 (예컨대, 예측 모델과 같은) 예측 모델을 훈련시킬 수 있다. 일부 예들에서, 적응형 학습 알고리즘은 적응형 머신 학습 알고리즘, 적응형 강화 학습 알고리즘, 적 응형 심층 학습 알고리즘, 적응형 연속 무한 학습 알고리즘, 또는 적응형 정책 최적화 강화 학습 알고리즘(예컨 대, PPO(proximal policy optimization) 알고리즘, 정책 그래디언트, TRPO(trust region policy optimization) 알고리즘 등)이다. 일부 예들에서, 적응형 학습 알고리즘은 부분적 관찰가능 마르코브 결정 프로세스 (partially observable Markov Decision Process, POMDP)로서 모델링된다. 일부 예들에서, 적응형 학습 알고 리즘은 인공 뉴럴 네트워크(예컨대, 하나 이상의 심층 뉴럴 네트워크(deep neural network, DNN)들을 포함하는 심층 Q 네트워크(deep Q network, DQN))에 의해 구현된다. 일부 예들에서, (예컨대, 훈련 시스템에 의해 사용되는) 적응형 학습은 뉴럴 네트워크를 사용하여 수행된 다. 뉴럴 네트워크는 다양한 연결 패턴으로 설계될 수 있다. 피드 포워드 네트워크(feed-forward network)들 에서, 정보는 하위 계층들로부터 상위 계층들로 전달되고, 주어진 계층의 각각의 뉴런은 상위 계층들의 뉴런들 과 통신한다. 계층적 표현은 피드 포워드 네트워크의 연속적인 계층들에 구축될 수 있다. 뉴럴 네트워크는 또 한 순환(recurrent) 또는 피드백(탑-다운식(top-down)이라고도 함) 연결을 가질 수 있다. 순환 연결 (recurrent connection)에서, 주어진 계층의 뉴런으로부터의 출력은 동일한 계층의 다른 뉴런으로 통신될 수 있 다. 순환 아키텍처는 시퀀스로 뉴럴 네트워크에 전달되는 입력 데이터 청크(input data chunk)들 중 하나 초과 에 걸쳐 있는 패턴들을 인식하는 데 도움이 될 수 있다. 주어진 계층의 뉴런으로부터 하위 계층의 뉴런으로의 연결은 피드백(또는 탑-다운식) 연결이라고 지칭된다. 많은 피드백 연결들을 갖는 네트워크는 하이 레벨 개념 의 인식이 입력의 특정 로우 레벨 특징들을 판별하는 것을 도울 수 있을 때 도움이 될 수 있다. 일부 예들에서, (예컨대, 훈련 시스템에 의해 사용되는) 적응형 학습은 심층 신뢰 네트워크(deep belief network, DBN)를 사용하여 수행된다. DBN들은 은닉 노드(hidden node)들의 다수의 계층들을 포함하는 확률론적 모델들이다. DBN들은 훈련 데이터 세트들의 계층적 표현을 추출하는 데 사용될 수 있다. DBN은 RBM(Restricted Boltzmann Machine)들의 계층들을 적층함으로써 획득될 수 있다. RBM은 입력들의 세트에 걸친 확률 분포를 학습할 수 있는 일 타입의 인공 뉴럴 네트워크이다. 각각의 입력이 카테고리화될 수 있는 클래스 에 관한 정보가 없을 시에 RBM들이 확률 분포를 학습할 수 있기 때문에, RBM들은 종종 비-지도 학습 (unsupervised learning)에서 사용된다. 하이브리드 비지도 및 지도 패러다임을 사용하면, DBN의 최하위 RBM들 은 비지도 방식으로 훈련될 수 있고, 특징 추출기들로서 역할을 할 수 있으며, 최상위 RBM은 (이전의 계층으로 부터의 입력들 및 타깃 클래스들의 공동 분포에 대해) 지도 방식으로 훈련될 수 있고, 분류기로서 역할을 할 수 있다. 일부 예들에서, (예컨대, 훈련 시스템에 의해 사용되는) 적응형 학습은 심층 콘볼루션 네트워크(deep convolutional network, DCN)를 사용하여 수행된다. DCN은 추가적인 풀링(pooling) 및 정규화 계층을 갖게 구 성되는, 콘볼루션 네트워크의 네트워크이다. DCN들은 많은 태스크들에 대해 최신 성능을 달성했다. DCN들은, 입력 및 출력 타깃들 둘 모두가 많은 표본들에 대해 알려져 있고 기울기 하강 방법들의 사용에 의해 네트워크의 가중치들을 수정하는 데 사용되는 지도 학습을 사용하여 훈련될 수 있다. DCN들은 피드 포워드 네트워크들일 수 있다. 추가로, 위에서 설명된 바와 같이, DCN의 제1 계층 내의 뉴런으로부터 다음 상위 계층 내의 뉴런들의 그룹으로의 연결들은 제1 계층 내의 뉴런들에 걸쳐 공유된다. DCN들의 피드 포워드 및 공유된 연결들은 빠른 프로세싱을 위해 활용될 수 있다. DCN의 컴퓨테이셔널 부담은, 예컨대 회귀 또는 피드백 연결들을 포함하는 유사한 크기의 뉴럴 네트워크보다 훨씬 적을 수 있다. 상호연결된 그룹의 인공 뉴런들(예컨대, 뉴런 모델들)로 구성될 수 있는 인공 뉴럴 네트워크는 컴퓨테이셔널 디 바이스이거나 컴퓨테이셔널 디바이스에 의해 수행되는 방법을 표현한다. 이러한 뉴럴 네트워크들은 IP(Internet Protocol) 카메라들, IoT 디바이스들, 자율 차량들, 및/또는 서비스 로봇들과 같은 다양한 애플리 케이션들 및/또는 디바이스들을 위해 사용될 수 있다. 인공 뉴럴 네트워크 내의 개별 노드들은 입력 데이터를 취하고 데이터에 대해 간단한 연산들을 수행함으로써 생물학적 뉴런들을 에뮬레이트할 수 있다. 입력 데이터에 대해 수행된 간단한 연산들의 결과들은 다른 뉴런들에 선택적으로 전달된다. 가중치 값들은 네트워크 내의 각 각의 벡터 및 노드와 연관되고, 이들 값들은 입력 데이터가 출력 데이터와 어떻게 관련되는지를 제약한다. 예 를 들어, 각각의 노드의 입력 데이터에 대응하는 가중치 값이 곱해지고, 산출물(product)이 합산될 수 있다. 곱들의 합은 선택적인 바이어스에 의해 조정될 수 있고, 활성화 함수가 결과에 적용되어, 노드의 출력 신호 또 는 \"출력 활성화\"를 산출할 수 있다. 가중치 값들은 초기에 네트워크를 통한 훈련 데이터의 반복적인 흐름에 의해 결정될 수 있다(예컨대, 가중치 값들은 네트워크가 전형적인 입력 데이터 특성들에 의해 특정 클래스들을 식별하는 방법을 학습하는 훈련 단계 동안 확립된다). 상이한 타입들의 인공 뉴럴 네트워크들이 RNN(recurrent neural network)들, MLP(multilayer perceptron) 뉴럴 네트워크들, 콘볼루션 뉴럴 네트워크(convolutional neural network, CNN)들 등과 같은 적응형 학습(예컨대, 훈련 시스템에 의해 사용됨)을 구현하는 데 사용될 수 있다. RNN은 계층의 출력을 저장하고 이 출력을 입력에 피드백하여 계층의 성과를 예측하는 것을 돕는 원리상에서 작동한다. MLP 뉴럴 네트워크들에서, 데이터 는 입력 계층에 공급될 수 있고, 하나 이상의 은닉 계층들은 데이터에 대한 추상화의 레벨들을 제공한다. 이어 서, 추상화된 데이터에 기초하여 출력 계층 상에서 예측들이 이루어질 수 있다. MLP들은 입력들에 클래스 또는 라벨이 할당되는 분류 예측 문제들에 특히 적합할 수 있다. 콘볼루션 뉴럴 네트워크(convolutional neural network, CNN)은 피드 포워드 인공 뉴럴 네트워크의 일 타입이다. 콘볼루션 뉴럴 네트워크들은, 수용 필드(예 컨대, 입력 공간의 공간적으로 국부화된 영역)를 각각 갖는 그리고 입력 공간을 집합적으로 타일링하는 인공 뉴 런들의 집합들을 포함할 수 있다. 콘볼루션 뉴럴 네트워크들은 많은 애플리케이션들을 갖는다. 특히, CNN들은 패턴 인식 및 분류의 영역에 광범위하게 사용되어 왔다. 계층화된 뉴럴 네트워크 아키텍처들에서, 인공 뉴런들 의 제1 계층의 출력은 인공 뉴런들의 제2 계층에 대한 입력이 되고, 인공 뉴런들의 제2 계층의 출력은 인공 뉴 런들의 제3 계층에 대한 입력이 되고, 등등이다. 콘볼루션 뉴럴 네트워크들은 특징들의 계층 구조(hierarchy) 를 인식하도록 훈련될 수 있다. 콘볼루션 뉴럴 네트워크 아키텍처들에서의 계산은 하나 이상의 계산 체인으로 구성될 수 있는 프로세싱 노드들의 모집단(population)에 걸쳐 분산될 수 있다. 이러한 다중 계층화된 아키텍 처는 한 번에 하나의 계층씩 훈련될 수 있고, 역 전파(back propagation)를 사용하여 미세 튜닝될 수 있다. 일부 예들에서, 적응형 머신 학습 알고리즘을 사용할 때, 훈련 시스템은 훈련 저장소 내의 정보로 부터 벡터들을 생성한다. 일부 예들에서, 훈련 저장소는 벡터들을 저장한다. 일부 예들에서, 벡터들은 하나 이상의 특징들을 라벨에 맵핑한다. 예를 들어, 특징들은 본 명세서에서 논의되는 다양한 배치 시나리오 패턴들, 예컨대 송신 공간 정보, 네트워크 엔티티에서의 안테나 아키텍처, 네트워크 엔티티에서 사용되는 TxRU 대 안테나 엘리먼트 맵핑들, 상이한 커버 코드들, UE 이동성, 속력, 회전, 채널 조건들, 네트워크에서의 BS 배 치/기하구조 등에 대응할 수 있다. 라벨은 CSI/채널 추정을 수행하기 위한 특징들(예컨대, 송신 공간 정보)과 연관된 CSI/채널 추정(예컨대, CQI, PMI, RSRP, SINR 등)에 대응할 수 있다. 예측 모델 훈련 관리자는 벡터들을 사용하여, 노드에 대한 예측 모델을 훈련시킬 수 있다. 상기에서 논의된 바와 같이, 벡 터들은 적응형 학습 알고리즘에서 가중치들과 연관될 수 있다. 학습 알고리즘이 적응(예컨대, 업데이트)됨에 따라, 벡터들에 적용되는 가중치들도 또한 변경될 수 있다. 따라서, CSI/채널 추정 절차가 다시 수행될 때, 동 일한 특징들 하에서(예컨대, 송신 공간 정보를 포함하는 동일한 조건들의 세트 하에서), 모델은 노드에 상이한 결과(예컨대, 상이한 CQI, PMI, RSRP, SINR 등)를 제공할 수 있다. 소정 양태들에 따라, 적응형 학습 기반 빔 관리는 계속적인 무한 학습을 허용한다. 일부 예들에서, 학습은 연 합 학습(federated learning)으로 증강될 수 있다. 예를 들어, 일부 머신 학습 접근법들은 단일 머신 상에서 또는 데이터 센터에서 중앙집중식 훈련 데이터를 사용하지만; 연합 학습으로, 학습은 예측 모델을 형성하기 위 해 다수의 디바이스들을 수반하여 협력적일 수 있다. 연합 학습으로, 다수의 디바이스들로부터의 협력적 학습 을 이용하여 디바이스 상에서 모델의 훈련이 수행될 수 있다. 예를 들어, 도 17을 다시 참조하면, 노드 는 다양한 상이한 디바이스들로부터 훈련 정보 및/또는 업데이트된 훈련된 모델들을 수신할 수 있다. 도 18은 본 개시내용의 소정 양태들에 따른, 무선 통신을 위한 예시적인 동작들을 예시하는 흐름도이다. 동작들은, 예를 들어, (무선 통신 네트워크에서의 UE와 같은) UE에 의해 수행될 수 있다. 동작들은 하나 이상의 프로세서들(예컨대, 도 2의 제어기/프로세서) 상에서 실행 및 작동되는 소프트 웨어 컴포넌트들로서 구현될 수 있다. 추가로, 동작들에서 UE에 의한 신호들의 송신 및 수신은, 예를 들 어, 하나 이상의 안테나들(예컨대, 도 2의 안테나들)에 의해 가능하게 될 수 있다. 특정 양태들에서, UE 에 의한 신호들의 송신 및/또는 수신은, 신호들을 획득 및/또는 출력하는 하나 이상의 프로세서들(예를 들어, 제어기/프로세서)의 버스 인터페이스를 통해 구현될 수 있다. 동작들은 선택적으로, 블록에서 시작할 수 있으며, 여기서 UE는 네트워크 엔티티(예컨대, BS(10 2))로부터, 네트워크 엔티티와 연관된 송신 공간 정보(예컨대, 송신 공간 정보)의 표시를 수신할 수 있다. 송신 공간 정보는 네트워크 엔티티와 연관된 안테나 아키텍처(예컨대, 안테나 어레이)의 하나 이상의 안테 나 엘리먼트들(예컨대, 안테나 엘리먼트들)에 대한 하나 이상의 TxRU들의 맵핑(예컨대, 도 8과 관련하여 본 명세서에 설명된 TxRU 맵핑)을 포함할 수 있다. 블록에서, UE는, 네트워크 엔티티로부터, 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호 (예컨대, 활동에서의 기준 신호(들))를 수신할 수 있다. 기준 신호는 본 명세서에 설명된 바와 같이, SSB, CSI-RS, TRS, QCL 기준 신호, 및/또는 훈련 데이터를 포함할 수 있다. 블록에서, UE는 수신된 기준 신호 및 송신 공간 정보에 기초하여 CSI(예컨대, CSI)를 네트워크 엔티 티로 송신할 수 있다. 예를 들어, CSI는 기준 신호(들)와 연관된 CQI, PMI, RSRP 및/또는 SINR을 표시할 수 있 다. 소정 양태들에서, 송신 공간 정보의 표시는, 예를 들어, 도 11과 관련하여 본 명세서에 설명된 바와 같이, 커버 코드 구성을 포함할 수 있다. 송신 공간 정보의 표시를 수신하기 위해, UE는 송신 공간 정보를 식별하는 커버 코드 구성(예컨대, 활동에서의 커버 코드 구성)을 수신할 수 있다. UE는 커버 코드 구성에 기초하여 기 준 신호를 수신할 수 있다. 예를 들어, UE는 TxRU 맵핑 및/또는 빔포밍이 기준 신호에 적용되고 커버 코드 구 성과 연관될 것으로 예상할 수 있다. 커버 코드 구성은 송신 공간 정보의 커버 코드(예컨대, 커버 코드 및/또는 커버 코드/빔포머)를 식별할 수 있다. 네트워크 엔티티에서의 안테나 아키텍처는 CSI-RS 포트 그 룹화(예컨대, CSI-RS 포트 그룹화)를 통해 표시될 수 있다. 송신 공간 정보는 그룹들(예컨대, CSI-RS 포 트들과 연관된 그룹(들))로 배열된 CSI-RS 포트들(예컨대, CSI-RS 포트들)에 대응하는 커버 코드를 식별할 수 있다. UE는 수신된 기준 신호 및 커버 코드에 기초하여 채널 추정을 결정하고, 그리고/또는 커버 코드 및/또는 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정할 수 있다. UE는 커버 코드 구성의 표 시를 사용하여 채널 추정 및/또는 CSI를 결정할 수 있다. 예를 들어, 커버 코드 구성의 표시는, 채널 추정 및/ 또는 CSI 피드백에 대해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있다. UE는 커버 코드 구성의 표시를 사용하 여 CSI 피드백을 결정할 수 있다. 예를 들어, 커버 코드 구성의 표시는, CSI 피드백에 대해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있다. 소정 양태들에서, 송신 공간 정보의 표시는, 예를 들어, 도 12와 관련하여 본 명세서에 설명된 바와 같이, 머신 학습 모듈의 표시를 포함할 수 있다. 송신 공간 정보의 표시를 수신하기 위해, UE는 송신 공간 정보와 연관된 또는 송신 공간 정보를 표시하는 커버 코드와 연관된 머신 학습 모듈을 표시하는 신호(예컨대, 활동에서 머신 학습 모듈들을 식별하는 표시)를 수신할 수 있다. 커버 코드는 네트워크 엔티티와 연관된 안테나 아키텍 처와 연관될 수 있다. 일부 경우들에서, 머신 학습 모듈의 표시는 커버 코드 구성을 통해 표시될 수 있다. UE 는 머신 학습 모델 및 커버 코드를 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하고, 그리고/또는 커버 코드 및/또는 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정할 수 있다. UE는 머신 학습 모듈의 표 시를 사용하여 채널 추정 및/또는 CSI를 결정할 수 있다. 예를 들어, 머신 학습 모듈의 표시는, 채널 추정 및/ 또는 CSI 피드백에 대해 어떤 AI/ML 모듈을 사용할지를 표시할 수 있다. 소정 경우들에서, UE는 머신 학습 모 듈 및 송신 공간 정보를 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하고, 그리고/또는 머신 학습 모듈 및 송신 공간 정보를 사용하여 CSI를 결정할 수 있으며, 여기서 CSI에 대한 머신 학습 모듈은 채널 추정 및/또는 수신된 기준 신호를 입력으로서 취할 수 있다. UE에서의 인공 지능 및/또는 머신 학습 모듈들은, 예를 들어, 도 5와 관련되어 본 명세서에 설명된 바와 같이, 입력 및/또는 출력을 위한 특정 포맷을 지원할 수 있다. 채널 추정 및/또는 CSI를 결정하기 위해, UE는 머신 학습 모듈을 사용하여 안테나 아키텍처와 연관된 복수의 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정 할 수 있으며, 머신 학습 모듈은 수신된 기준 신호를 입력으로서 취할 수 있다. 포트들 각각에 대한 주파수 도 메인 채널 추정치를 결정하기 위해, UE는, 머신 학습 모듈을 이용하여, 포트 인덱스, 리소스 블록 인덱스, 각각 의 리소스 블록의 기준 서브캐리어 인덱스, 서브캐리어 인덱스, 또는 심볼 인덱스에 기초한 순서로, 예를 들어,출력 순서에 따라 주파수 도메인 채널 추정치들을 출력할 수 있다. 포트들 각각에 대한 주파수 도메인 채 널 추정치를 결정하기 위해, UE는 서브캐리어 인덱스, 심볼 인덱스, 또는 수신 안테나 인덱스에 기초한 순서로, 예를 들어, 입력 순서에 따라 수신된 기준 신호를 머신 학습 모듈에 입력할 수 있다. 소정 경우들에서, UE는, 예를 들어, 도 12와 관련하여 본 명세서에 설명된 바와 같이, 네트워크 엔티티에 의해 지원된 머신 학습 모듈들의 목록으로 구성될 수 있다. UE는 복수의 머신 학습 모듈들(예컨대, 머신 학습 모듈 들의 목록)을 표시하고 복수의 커버 코드들 중의 커버 코드와 머신 학습 모듈들 각각 사이의 연관성을 표시하는 제1 신호를 수신할 수 있다. 송신 공간 정보의 표시를 수신하기 위해, UE는 송신 공간 정보를 표시하는, 커버 코드들 중 적어도 하나와 연관된 머신 학습 모듈들 중 적어도 하나를 식별하는 제2 신호를 수신할 수 있다. 송 신 공간 정보의 표시는, UE가 채널 추정 및/또는 CSI 피드백을 위해 머신 학습 모듈들 중 하나를 사용하도록 트 리거할 수 있다. UE는 본 명세서에서 설명된 바와 같이, 입력 및/또는 출력에 대한 포맷을 갖는 머신 학습 모 듈을 사용하여 채널 추정 및/또는 CSI 피드백을 결정할 수 있다. 소정 양태들에서, 송신 공간 정보의 표시는, 예를 들어, 도 13과 관련하여 본 명세서에 설명된 바와 같이, QCL 정보의 표시를 포함할 수 있다. QCL 정보는 송신 공간 정보와 연관된 QCL 기준 신호 및/또는 QCL 타입(예컨대, QCL-TypeE)의 표시를 포함할 수 있다. QCL 기준 신호는 TRS 또는 CSI-RS에 대한 패턴, 머신 학습 모듈에 대한 훈련 데이터, 또는 이들의 임의의 조합을 포함할 수 있다. QCL 기준 신호는 2개 이상의 포트들, 하나의 리소스 블록 내지 24개의 리소스 블록들의 대역, 및 주기성(예컨대, > 640개의 슬롯들 또는 640 밀리초(ms))을 포함한 다. 일부 경우들에서, 주기성은 10 ms, 40 ms, 80 ms, 160 ms, 640 ms 등을 포함할 수 있다. 소정 경우들에 서, 주기성은 10개의 슬롯들, 40개의 슬롯들, 80개의 슬롯들, 160개의 슬롯들, 640개의 슬롯들 등을 포함할 수 있다. 송신 정보의 표시를 수신하기 위해, UE는 기준 신호에 대한 QCL 구성(예컨대, QCL 구성)을 표시하는 신호 를 수신할 수 있다. QCL 구성은 송신 공간 관계 또는 파라미터를 기준 신호에 대한 QCL 타입(예컨대, QCL 타입 )으로서 식별할 수 있다. QCL 구성은 기준 신호와 QCL 관계를 갖는 QCL 기준 신호(예컨대, SSB 리소스 ID 및/또는 TRS 리소스 ID)를 식별할 수 있다. QCL 관계는 QCL 타입과 연관된 송신 공간 관계 또 는 파라미터일 수 있다. 블록에서 기준 신호를 수신하기 위해, UE는 QCL 기준 신호를 수신할 수 있다. 기준 신호는 QCL 기준 신호를 포함할 수 있다. 소정 경우들에서, UE는, 기준 신호가 송신 공간 관계의 QCL 타 입을 갖는 것에 응답하여 수신된 기준 신호에 기초하는 송신 공간 정보를 결정할 수 있다. UE는 QCL 기준 신호 의 공간 추적 루프에 기초하여 송신 공간 정보를 결정할 수 있다. 소정 양태들에서, QCL 정보는 머신 학습 모듈과 연관될 수 있다. 일부 경우들에서, UE는 QCL 정보에 기초하여 머신 학습 모듈을 훈련하거나 또는 선택할 수 있다. UE는 머신 학습 모델을 사용하는 수신된 기준 신호 및 송 신 공간 정보에 기초하여 채널 추정을 결정하고, 그리고/또는 송신 공간 정보 및/또는 채널 추정에 적어도 부분 적으로 기초하여 CSI를 결정할 수 있다. 일부 경우들에서, UE는 머신 학습 모듈을 사용하는 송신 공간 정보(예 컨대, QCL 기준 신호)에 적어도 부분적으로 기초하여 CSI를 결정할 수 있으며, 머신 학습 모듈은 QCL 기준 신호 및/또는 채널 추정을 입력으로서 취할 수 있다. UE는 QCL 구성에 응답하여 수신된 기준 신호의 측정된 송신 공 간 관계에 기초하여 복수의 머신 학습 모듈들 중의 머신 학습 모듈을 선택할 수 있다. 소정 양태들의 경우, 송신 공간 정보의 표시는, 예를 들어, 도 14 및 도 15와 관련하여 본 명세서에 설명된 바 와 같이, 분포 내 구성 및/또는 훈련 데이터의 표시를 포함할 수 있다. 송신 공간 정보의 표시를 수신하기 위 해, UE는, 기준 신호가 머신 학습 모듈에 대한 훈련 데이터(예컨대, 활동에서의 훈련 데이터)와 동일한 분포를 갖는 채널 또는 신호를 통해 전달된다는 것을 표시하는 분포 내 구성(예컨대, 활동(1418 또는 1516)에서 의 표시)을 수신할 수 있다. 훈련 데이터는 송신 공간 정보를 표시할 수 있다. UE는 머신 학습 모듈에 대한 훈련 데이터를 수신할 수 있다. 일부 경우들에서, 분포 내 구성은 머신 학습 모듈에 대해 사용할 훈련 데이터 를 표시할 수 있다. UE는 수신된 기준 신호 및 분포 내 구성에 기초하여 채널 추정을 결정하고, 그리고/또는 분포 내 구성 및/또는 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정할 수 있다. 일부 경우들에서, UE는 머신 학습 모듈을 사용하는 분포 내 구성에 적어도 부분적으로 기초하여 CSI를 결정할 수 있고, 머신 학습 모델 은 수신된 기준 신호 및/또는 채널 추정을 입력으로서 취할 수 있다. UE는 본 명세서에서 설명된 바와 같이, 입력 및/또는 출력에 대한 포맷을 갖는 머신 학습 모듈을 사용하여 채널 추정 및/또는 CSI 피드백을 결정할 수 있다. 도 19는 본 개시내용의 소정 양태들에 따른, 무선 통신을 위한 예시적인 동작들을 예시하는 흐름도이다. 동작들은, 예를 들어, (무선 통신 네트워크에서의 BS(110a)와 같은) 네트워크 엔티티에 의해 수행될수 있다. 동작들은 UE에 의해 수행되는 동작들에 상보적일 수 있다. 동작들은 하나 이상의 프로세서들(예컨대, 도 2의 제어기/프로세서) 상에서 실행 및 작동되는 소프트웨어 컴포넌트들로서 구현될 수 있다. 추가로, 동작들에서 네트워크 엔티티에 의한 신호들의 송신 및 수신은, 예를 들어, 하나 이상 의 안테나(예컨대, 도 2의 안테나들)에 의해 가능하게 될 수 있다. 특정 양태들에서, 네트워크 엔티티에 의한 신호들의 송신 및/또는 수신은 신호들을 획득하고/하거나 출력하는 하나 이상의 프로세서(예를 들어, 제어 기/프로세서)의 버스 인터페이스를 통해 구현될 수 있다. 동작들은 선택적으로, 블록에서 시작할 수 있으며, 여기서 네트워크 엔티티는 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 UE(예컨대, UE)로 출력(예컨대, 송신, 제공, 또는 전송)할 수 있다. 송 신 공간 정보는 네트워크 엔티티와 연관된 안테나 아키텍처(예컨대, 안테나 어레이)의 하나 이상의 안테나 엘리먼트들(예컨대, 안테나 엘리먼트들)에 대한 하나 이상의 TxRU들의 맵핑(예컨대, 도 8과 관련하여 본 명세서에 설명된 TxRU 맵핑)을 포함할 수 있다. 블록에서, 네트워크 엔티티는 송신 공간 정보에 기초하여 네트워크 엔티티로부터의 기준 신호를 UE로 출 력할 수 있다. 기준 신호는 본 명세서에 설명된 바와 같이, SSB, CSI-RS, TRS, QCL 기준 신호, 및/또는 훈련 데이터를 포함할 수 있다. 블록에서, 네트워크 엔티티는 기준 신호 및 송신 공간 정보에 기초하여 UE로부터 CSI를 획득(예컨대, 수 신)할 수 있다. 예를 들어, CSI는 기준 신호(들)와 연관된 CQI, PMI, RSRP 및/또는 SINR을 표시할 수 있다. 일부 경우들에서, 네트워크 엔티티는 CSI에 기초하여 UE에서의 구성을 조정할 수 있다. 예를 들어, 네트워크 엔티티는 CSI에 기초하여 UE에서 구성된 변조 및 코딩 스킴을 조정할 수 있다. 소정 양태들에서, 송신 공간 정보의 표시는, 예를 들어, 도 11과 관련하여 본 명세서에 설명된 바와 같이, 커버 코드 구성을 포함할 수 있다. 송신 공간 정보의 표시를 출력하기 위해, 네트워크 엔티티는 송신 공간 정보를 식별하는 커버 코드 구성을 UE로 출력할 수 있고, 네트워크 엔티티는 커버 코드 구성에 기초하여 기준 신호를 출력할 수 있다. 커버 코드 구성은 송신 공간 정보의 커버 코드를 식별할 수 있다. 송신 공간 정보는 그룹들 (예컨대, 소정의 CSI-RS 리소스 ID(들)과 연관된 그룹들)로 배열된 CSI-RS 포트들(예컨대, CSI-RS 포트들 )에 대응하는 커버 코드를 식별할 수 있다. 소정 양태들에서, 송신 공간 정보의 표시는, 예를 들어, 도 12와 관련하여 본 명세서에 설명된 바와 같이, 머신 학습 모듈의 표시를 포함할 수 있다. 송신 공간 정보의 표시를 출력하기 위해, 네트워크 엔티티는 송신 공간 정보를 표시하는 커버 코드와 연관된 머신 학습 모듈을 표시하는 신호를 UE로 출력할 수 있다. 커버 코드는 네 트워크 엔티티와 연관된 안테나 아키텍처와 연관될 수 있다. 소정 경우들에서, 네트워크 엔티티는, 예를 들어, 도 12와 관련하여 본 명세서에 설명된 바와 같이, 네트워크 엔티티에 의해 지원된 머신 학습 모듈들의 목록으로 UE를 구성할 수 있다. 네트워크 엔티티는, 복수의 머신 학 습 모듈들(예컨대, 머신 학습 모듈들의 목록)을 표시하고 복수의 커버 코드들 중의 커버 코드와 머신 학습 모듈 들 각각 사이의 연관성을 표시하는 제1 신호를 UE로 출력할 수 있다. 송신 공간 정보의 표시를 출력하기 위해, 네트워크 엔티티는 송신 공간 정보를 표시하는, 커버 코드들 중 적어도 하나와 연관된 머신 학습 모듈들 중 적 어도 하나를 식별하는 제2 신호를 출력할 수 있다. 소정 양태들에서, 송신 공간 정보의 표시는, 예를 들어, 도 13과 관련하여 본 명세서에 설명된 바와 같이, QCL 정보의 표시를 포함할 수 있다. QCL 정보는 송신 공간 정보와 연관된 QCL 기준 신호 및/또는 QCL 타입(예컨대, QCL-TypeE)의 표시를 포함할 수 있다. QCL 기준 신호는 TRS 또는 CSI-RS에 대한 패턴, 머신 학습 모듈에 대한 훈련 데이터, 또는 이들의 임의의 조합을 포함할 수 있다. QCL 기준 신호는 2개 이상의 포트들, 하나의 리소스 블록 내지 24개의 리소스 블록들의 대역, 및 주기성(예컨대, > 640개의 슬롯들)을 포함한다. 송신 공간 정보의 표시를 출력하기 위해, 네트워크 엔티티는 기준 신호에 대한 QCL 구성(예컨대, QCL 구성 )을 표시하는 신호를 출력할 수 있다. QCL 구성은 송신 공간 관계 또는 파라미터를 기준 신호에 대한 QCL 타입(예컨대, QCL 타입)으로서 식별할 수 있다. QCL 구성은 기준 신호와 QCL 관계를 갖는 QCL 기준 신호(예컨대, SSB 리소스 ID 및/또는 TRS 리소스 ID)를 식별할 수 있다. 기준 신호를 출력하기 위 해, 네트워크 엔티티는 QCL 기준 신호를 출력할 수 있다. 소정 양태들의 경우, 송신 공간 정보의 표시는, 예를 들어, 도 14 및 도 15와 관련하여 본 명세서에 설명된 바 와 같이, 분포 내 구성 및/또는 훈련 데이터의 표시를 포함할 수 있다. 송신 공간 정보의 표시를 출력하기 위 해, 네트워크 엔티티는, 기준 신호가 머신 학습 모듈에 대한 훈련 데이터와 동일한 분포를 갖는 채널 또는 신호를 통해 전달된다는 것을 표시하는 분포 내 구성을 출력할 수 있다. 훈련 데이터는 송신 공간 정보를 표시할 수 있다. 네트워크 엔티티는 머신 학습 모듈에 대한 훈련 데이터를 UE에 출력할 수 있다. 분포 내 구성은 머 신 학습 모듈에 대해 사용할 훈련 데이터를 추가로 표시할 수 있다. 예시적인 무선 통신 디바이스 도 20은 도 5 내지 도 18과 관련하여 도시되고 설명된 동작들과 같은, 본 명세서에 개시된 기법들에 대한 동작 들을 수행하도록 동작가능하거나, 구성되거나, 또는 적응된 다양한 컴포넌트들을 포함하는 예시적인 통신 디바 이스를 도시한다. 일부 예에서, 통신 디바이스는, 예를 들어, 도 1 및 도 2와 관련하여 설명된 바 와 같은 UE일 수 있다. 통신 디바이스는 트랜시버(예컨대, 송신기 및/또는 수신기)에 커플링된 프로세싱 시스템을 포함한다. 트랜시버는 본 명세서에 설명된 바와 같은 다양한 신호들과 같은, 안테나를 통한 통신 디바이스에 대한 신호들을 송신(또는 전송)하고 수신하도록 구성된다. 프로세싱 시스템은 통신 디 바이스에 의해 수신되고 그리고/또는 송신될 신호들을 프로세싱하는 것을 포함하여, 통신 디바이스(200 0)에 대한 프로세싱 기능들을 수행하도록 구성될 수 있다. 프로세싱 시스템은 버스를 통해 컴퓨터 판독가능 매체/메모리에 커플링된 하나 이상의 프로 세서들을 포함한다. 소정 양태들에서, 컴퓨터 판독가능 매체/메모리는 하나 이상의 프로세서들 에 의해 실행될 때, 하나 이상의 프로세서들로 하여금, 도 5 내지 도 18에 예시된 동작들, 또는 송 신 공간 정보를 표시하기 위한 본 명세서에 논의된 다양한 기법들을 수행하기 위한 다른 동작들을 수행하게 하 는 실행가능 명령들(예컨대, 컴퓨터 실행가능 코드)을 저장하도록 구성된다. 도시된 예에서, 컴퓨터 판독가능 매체/메모리는 수신하기 위한 코드, 송신하기 위한 코드, 결정하기 위한 코드, 입력하기 위한 코드, 출력하기 위한 코드, 및/또는 선택하기 위한 코드 를 저장한다. 도시된 예에서, 하나 이상의 프로세서들은, 수신하기 위한 회로부, 송신하기 위한 회로부, 결정하기 위한 회로부, 입력하기 위한 회로부, 출력하기 위한 회로부, 및/또는 선택하기 위 한 회로부를 포함하는, 컴퓨터 판독가능 매체/메모리에 저장된 코드를 구현하도록 구성된 회로부를 포함한다. 통신 디바이스의 다양한 컴포넌트들은, 도 5 내지 도 18과 관련되는 것을 포함하여, 본 명세서에서 설명 된 방법들을 수행하기 위한 수단을 제공할 수 있다. 일부 예들에서, 송신 또는 전송하기 위한 수단(또는 송신을 위해 출력하기 위한 수단)은 도 2에 예시된 UE(10 4)의 트랜시버들 및/또는 안테나(들), 및/또는 도 20의 통신 디바이스의 트랜시버 및 안 테나를 포함할 수 있다. 일부 예들에서, 수신하기 위한 수단(또는 획득하기 위한 수단)은 도 2에 예시된 UE의 트랜시버들 및/ 또는 안테나(들), 및/또는 도 20의 통신 디바이스의 트랜시버 및 안테나를 포함할 수 있다. 일부 경우들에서, 디바이스는, 예를 들어, 신호들 및/또는 데이터를 실제로 송신하기보다는, 송신을 위해 신호 들 및/또는 데이터를 출력하기 위한 인터페이스(출력하기 위한 수단)를 가질 수 있다. 예를 들어, 프로세서는 신호들 및/또는 데이터를, 버스 인터페이스를 통해, 송신을 위한 라디오 주파수(RF) 프론트 엔드로 출력할 수 있다. 유사하게, 디바이스는, 신호들 및/또는 데이터를 실제로 수신하기보다는, 다른 디바이스로부터 수신된 신호들 및/또는 데이터를 획득하기 위한 인터페이스(획득하기 위한 수단)를 가질 수 있다. 예를 들어, 프로세 서는 신호들 및/또는 데이터를, 버스 인터페이스를 통해, 수신을 위한 RF 프론트 엔드로부터 획득(또는 수신)할 수 있다. 다양한 양태들에서, RF 프론트 엔드는 도 2의 예들에 도시된 바와 같이, 송신 및 수신 프로세서들, 송신 및 수신 MIMO 프로세서들, 변조기들, 복조기들 등을 포함하여, 다양한 컴포넌트를 포함할 수 있다. 일부 예들에서, 수신하기 위한 수단, 송신하기 위한 수단, 결정하기 위한 수단, 입력하기 위한 수단, 출력하기 위한 수단, 및/또는 선택하기 위한 수단은, 수신 프로세서, 송신 프로세서, TX MIMO 프로세서, 및/또는 제어기/프로세서(송신 공간 정보 컴포넌트를 포함함)를 포함하여, 도 20에서의 하나 이상의 프로세서들, 또는 도 2에 도시된 UE의 양태들과 같은 다양한 프로세싱 시스템 컴포넌트들을 포함할 수 있다.특히, 도 20은 일례이고, 통신 디바이스의 많은 다른 예들 및 구성들이 가능하다. 도 21은, 도 5 내지 도 17 및 도 19와 관련하여 도시되고 설명된 동작들과 같은, 본 명세서에 개시된 기법들에 대한 동작들을 수행하도록 동작가능하거나, 구성되거나, 또는 적응된 다양한 컴포넌트들을 포함하는 예시적인 통신 디바이스를 도시한다. 일부 예들에서, 통신 디바이스는, 예를 들어, 도 1 및 도 2와 관련하 여 설명된 바와 같은 BS일 수 있다. 통신 디바이스는 트랜시버(예컨대, 송신기 및/또는 수신기) 및/또는 네트워크 인터페이스에 커플링된 프로세싱 시스템을 포함한다. 트랜시버는 본 명세서에 설명된 바와 같은 다양한 신호들 과 같은, 안테나를 통한 통신 디바이스에 대한 신호들을 송신(또는 전송) 및 수신하도록 구성된다. 네트워크 인터페이스는, 예컨대 도 4와 관련하여, 본 명세서에 설명된 바와 같은 백홀 링크, 미드홀 링크, 및/또는 프론트홀 링크와 같은 통신 링크(들)를 통해 통신 디바이스에 대한 신호들을 획득 및 전송 하도록 구성된다. 프로세싱 시스템은 통신 디바이스에 의해 수신되고 그리고/또는 송신될 신호들 을 프로세싱하는 것을 포함하여, 통신 디바이스에 대한 프로세싱 기능들을 수행하도록 구성될 수 있다. 프로세싱 시스템은 버스를 통해 컴퓨터 판독가능 매체/메모리에 커플링된 하나 이상의 프로 세서들을 포함한다. 소정 양태들에서, 컴퓨터 판독가능 매체/메모리는 하나 이상의 프로세서들 에 의해 실행될 때, 하나 이상의 프로세서들로 하여금 도 5 내지 도 17 및 도 19에 예시된 동작들, 또는 송신 공간 정보를 표시하기 위한 본 명세서에 논의된 다양한 기법들을 수행하기 위한 다른 동작들을 수행 하게 하는 실행가는 명령들(예컨대, 컴퓨터 실행가능 코드)을 저장하도록 구성된다. 도시된 예에서, 컴퓨터 판독가능 매체/메모리는 출력(예컨대, 송신, 전송, 또는 제공)하기 위한 코드 및/또는 획득하기 위한 코드를 저장한다. 도시된 예에서, 하나 이상의 프로세서들는 출력하기 위한 회로부 및/또는 획득하기 위한 회로부 를 포함하여, 컴퓨터 판독가능 매체/메모리에 저장된 코드를 구현하도록 구성된 회로부를 포함한다. 통신 디바이스의 다양한 컴포넌트들은, 도 5 내지 도 17 및 도 19와 관련되는 것을 포함하여, 본 명세서 에서 설명된 방법들을 수행하기 위한 수단을 제공할 수 있다. 일부 예들에서, 송신 또는 출력하기 위한 수단(또는 송신을 위해 출력하기 위한 수단)은 도 2에 예시된 BS(10 2)의 트랜시버들 및/또는 안테나(들), 및/또는 도 21의 통신 디바이스의 트랜시버 및 안 테나를 포함할 수 있다. 일부 예들에서, 수신하기 위한 수단(또는 획득하기 위한 수단)은 도 2에 예시된 기지국의 트랜시버들 및/ 또는 안테나(들), 및/또는 도 21의 통신 디바이스의 트랜시버 및 안테나를 포함할 수 있다. 일부 예들에서, 전송하기 위한 수단 및/또는 획득하기 위한 수단은, 수신 프로세서, 송신 프로세서, TX MIMO 프로세서, 및/또는 제어기/프로세서(송신 공간 정보 컴포넌트를 포함함)를 포함하여, 도 2에 도시된 BS의 양태들 또는 도 21의 하나 이상의 프로세서들과 같은 다양한 프로세싱 시스템 컴포넌트들을 포함할 수 있다. 특히, 도 21은 일례이고, 통신 디바이스의 많은 다른 예들 및 구성들이 가능하다. 예시적인 양태들 구현 예들이 다음의 넘버링된 조항들에서 기술된다: 양태 1: 무선 통신을 위한 장치로서, 메모리; 및 메모리에 커플링된 프로세서를 포함하고, 프로세서는, 네트워 크 엔티티와 연관된 송신 공간 정보의 표시를 수신하도록; 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호를 수신하도록; 그리고 수신된 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 네트 워크 엔티티로 송신하도록 구성되는, 장치. 양태 2: 양태 1에 있어서, 송신 공간 정보의 표시를 수신하고, 기준 신호를 수신하고, CSI를 송신하도록 구성된 트랜시버를 추가로 포함하고, 송신 공간 정보는 네트워크 엔티티와 연관된 안테나 아키텍처의 하나 이상의 안테 나 엘리먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 표시하는, 장치.양태 3: 양태 1 또는 양태 2에 있어서, 송신 공간 정보의 표시를 수신하기 위해, 프로세서는 송신 공간 정보를 식별하는 커버 코드 구성을 수신하도록 추가로 구성되고; 기준 신호를 수신하기 위해, 프로세서는 커버 코드 구 성에 기초하여 기준 신호를 수신하도록 추가로 구성되는, 장치. 양태 4: 양태 3에 있어서, 커버 코드 구성은 송신 공간 정보의 커버 코드를 식별하는, 장치. 양태 5: 양태 4에 있어서, 프로세서는, 수신된 기준 신호 및 커버 코드에 기초하여 채널 추정을 결정하는 것; 또는 커버 코드에 적어도 부분적으로 기초하여 CSI를 결정하는 것 중 적어도 하나를 하도록 추가로 구성되는, 장치. 양태 6: 양태 3 내지 양태 5 중 임의의 양태에 있어서, 송신 공간 정보는, 그룹들로 배열된 채널 상태 정보 기 준 신호(CSI-RS) 포트들에 대응하는 커버 코드를 식별하는, 장치. 양태 7: 양태 1 내지 양태 6 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 수신하기 위해, 프로세서는 송 신 공간 정보와 연관된 머신 학습 모듈을 표시하는 신호를 수신하도록 추가로 구성되는, 장치. 양태 8: 양태 7에 있어서, 머신 학습 모듈은 커버 코드 구성을 통해 표시되는, 장치. 양태 9: 양태 7 또는 양태 8에 있어서, 프로세서는, 머신 학습 모듈 및 송신 공간 정보를 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하는 것; 또는 송신 공간 정보 및 머신 학습 모듈을 사용하여 CSI를 결정하는 것 중 적어도 하나를 하도록 추가로 구성되는, 장치. 양태 10: 양태 9에 있어서, 채널 추정을 결정하기 위해, 프로세서는 머신 학습 모듈을 사용하여 안테나 아키텍 처와 연관된 복수의 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하도록 추가로 구성되고, 머신 학습 모듈의 입력은 수신된 기준 신호를 포함하는, 장치. 양태 11: 양태 1 내지 양태 10 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 수신하기 위해, 프로세서는 기준 신호에 대한 준 공동위치(QCL) 구성을 표시하는 신호를 수신하도록 추가로 구성되고, QCL 구성은 송신 공 간 관계를 기준 신호에 대한 QCL 타입으로서 식별하는, 장치. 양태 12: 양태 11에 있어서, 프로세서는, 기준 신호가 송신 공간 관계의 QCL 타입을 갖는 것에 응답하여 수신된 기준 신호에 기초하는 송신 공간 정보를 결정하도록 추가로 구성되는, 장치. 양태 13: 양태 11 또는 양태 12에 있어서, 프로세서는, 머신 학습 모듈 및 송신 공간 정보를 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하는 것; 또는 머신 학습 모듈을 사용하는 송신 공간 정보에 적어도 부 분적으로 기초하여 CSI를 결정하는 것 중 적어도 하나를 하도록 추가로 구성되는, 장치. 양태 14: 양태 13에 있어서, 프로세서는 수신된 기준 신호의 측정된 송신 공간 관계에 기초하여 복수의 머신 학 습 모듈들 중의 머신 학습 모듈을 선택하도록 추가로 구성되는, 장치. 양태 15: 양태 1 내지 양태 14 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 수신하기 위해, 프로세서는, 머신 학습 모듈에 대한 훈련 데이터와 동일한 분포를 갖는 채널을 통해 기준 신호가 전달된다는 것을 표시하는 분포 내 구성을 수신하도록 추가로 구성되고, 훈련 데이터는 송신 공간 정보를 표시하는, 장치. 양태 16: 양태 15에 있어서, 프로세서는 머신 학습 모듈에 대한 훈련 데이터를 수신하도록 - 분포 내 구성은 머 신 학습 모듈에 대해 사용할 훈련 데이터를 추가로 표시함 -; 훈련 데이터를 사용하여 머신 학습 모듈을 훈련하 도록; 그리고 훈련된 머신 학습 모듈을 사용하여 CSI를 결정하도록 추가로 구성되는, 장치. 양태 17: 무선 통신을 위한 장치로서, 메모리; 및 프로세서를 포함하고, 프로세서는, 장치와 연관된 송신 공간 정보의 표시를 출력하도록, 송신 공간 정보에 기초하여 기준 신호를 출력하도록, 그리고 기준 신호 및 송신 공 간 정보에 기초하여 채널 상태 정보(CSI)를 획득하도록 구성되는, 장치. 양태 18: 양태 17에 있어서, 송신 공간 정보의 표시를 출력하고, 기준 신호를 출력하고, CSI를 획득하도록 구성 된 트랜시버를 추가로 포함하고, 송신 공간 정보는 장치와 연관된 안테나 아키텍처의 하나 이상의 안테나 엘리 먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 표시하는, 장치. 양태 19: 양태 17 또는 양태 18에 있어서, 송신 공간 정보의 표시를 출력하기 위해, 프로세서는 송신 공간 정보 를 식별하는 커버 코드 구성을 출력하도록 추가로 구성되고; 기준 신호를 출력하기 위해, 프로세서는 커버 코드 구성에 기초하여 기준 신호를 출력하도록 추가로 구성되는, 장치.양태 20: 양태 19에 있어서, 커버 코드 구성은 송신 공간 정보의 커버 코드를 식별하는, 장치. 양태 21: 양태 19 또는 양태 20에 있어서, 송신 공간 정보는, 그룹들로 배열된 채널 상태 정보 기준 신호(CSI- RS) 포트들에 대응하는 커버 코드를 식별하는, 장치. 양태 22: 양태 17 내지 양태 21 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 출력하기 위해, 프로세서는 송신 공간 정보와 연관된 머신 학습 모듈을 표시하는 신호를 출력하도록 추가로 구성되는, 장치. 양태 23: 양태 22에 있어서, 머신 학습 모듈은 커버 코드 구성을 통해 표시되는, 장치. 양태 24: 양태 17 내지 양태 23 중 임의의 양태에 있어서, 프로세서는, 복수의 머신 학습 모듈들을 표시하고 복 수의 커버 코드들 중의 커버 코드와 머신 학습 모듈들 각각 사이의 연관성을 표시하는 제1 신호를 출력하도록 추가로 구성되고; 송신 공간 정보의 표시를 출력하기 위해, 프로세서는, 송신 공간 정보를 표시하는, 커버 코드 중 적어도 하나와 연관된 머신 학습 모듈들 중 적어도 하나를 식별하는 제2 신호를 출력하도록 추가로 구성되는, 장치. 양태 25: 양태 17 내지 양태 24 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 출력하기 위해, 프로세서는 기준 신호에 대한 준 공동위치(QCL) 구성을 표시하는 신호를 출력하도록 추가로 구성되고, QCL 구성은 송신 공 간 관계를 기준 신호에 대한 QCL 타입으로서 식별하는, 장치. 양태 26: 양태 17 내지 양태 25 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 출력하기 위해, 프로세서는, 머신 학습 모듈에 대한 훈련 데이터와 동일한 분포를 갖는 채널을 통해 기준 신호가 전달된다는 것 을 표시하는 분포 내 구성을 출력하도록 추가로 구성되고, 훈련 데이터는 송신 공간 정보를 표시하는, 장치. 양태 27: 양태 26에 있어서, 프로세서는 머신 학습 모듈에 대한 훈련 데이터를 출력하도록 추가로 구성되고, 분 포 내 구성은 머신 학습 모듈에 대해 사용할 훈련 데이터를 추가로 표시하는, 장치. 양태 28: 사용자 장비에 의한 무선 통신의 방법으로서, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 수 신하는 단계; 송신 공간 정보에 기초하여 네트워크 엔티티로부터 기준 신호를 수신하는 단계; 및 수신된 기준 신호 및 송신 공간 정보에 기초하여 채널 상태 정보(CSI)를 네트워크 엔티티로 송신하는 단계를 포함하는, 방법. 양태 29: 양태 28에 있어서, 송신 공간 정보는 네트워크 엔티티와 연관된 안테나 아키텍처의 하나 이상의 안테 나 엘리먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 포함하는, 방법. 양태 30: 양태 28 또는 양태 29에 있어서, 송신 공간 정보의 표시를 수신하는 단계는, 송신 공간 정보를 식별하 는 커버 코드 구성을 수신하는 단계를 포함하고; 기준 신호를 수신하는 단계는, 커버 코드 구성에 기초하여 기 준 신호를 수신하는 단계를 포함하는, 방법. 양태 31: 양태 30에 있어서, 커버 코드 구성은 송신 공간 정보의 커버 코드를 식별하는, 방법. 양태 32: 양태 31에 있어서, 수신된 기준 신호 및 커버 코드에 기초하여 채널 추정을 결정하는 단계; 또는 커버 코드에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 33: 양태 31에 있어서, 수신된 기준 신호 및 커버 코드에 기초하여 채널 추정을 결정하는 단계; 및 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 34: 양태 30 내지 양태 33 중 임의의 양태에 있어서, 송신 공간 정보는, 그룹들로 배열된 채널 상태 정보 기준 신호(CSI-RS) 포트들에 대응하는 커버 코드를 식별하는, 방법. 양태 35: 양태 28 내지 양태 34 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 수신하는 단계는, 송신 공 간 정보와 연관된 머신 학습 모듈을 표시하는 신호를 수신하는 단계를 포함하는, 방법. 양태 36: 양태 35에 있어서, 머신 학습 모듈은 커버 코드 구성을 통해 표시되는, 방법. 양태 37: 양태 35 또는 양태 36에 있어서, 머신 학습 모듈 및 송신 공간 정보를 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하는 단계; 또는 송신 공간 정보 및 머신 학습 모듈을 사용하여 CSI를 결정하는 단계 를 추가로 포함하는, 방법. 양태 38: 양태 35 또는 양태 36에 있어서, 머신 학습 모듈 및 송신 공간 정보를 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하는 단계; 및 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 39: 양태 37 또는 양태 38에 있어서, 채널 추정을 결정하는 단계는 머신 학습 모듈을 사용하여 안테나 아 키텍처와 연관된 복수의 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하는 단계를 포함하고, 머신 학 습 모듈은 수신된 기준 신호를 입력으로서 취하는, 방법. 양태 40: 양태 39에 있어서, 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하는 단계는, 머신 학습 모 듈을 이용하여, 포트 인덱스, 리소스 블록 인덱스, 각각의 리소스 블록의 기준 서브캐리어 인덱스, 서브캐리어 인덱스, 또는 심볼 인덱스에 기초한 순서로 주파수 도메인 채널 추정치들을 출력하는 단계를 포함하는, 방법. 양태 41: 양태 40에 있어서, 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하는 단계는, 서브캐리어 인 덱스 또는 심볼 인덱스에 기초한 순서로 머신 학습 모듈에 수신된 기준 신호를 입력하는 단계를 포함하는, 방법. 양태 42: 양태 28 내지 양태 41 중 임의의 양태에 있어서, 복수의 머신 학습 모듈들을 표시하고 복수의 머신 학 습 모듈들 각각과 복수의 커버 코드들 중의 커버 코드 사이의 연관성을 표시하는 제1 신호를 수신하는 단계를 추가로 포함하고, 송신 공간 정보의 표시를 수신하는 단계는, 송신 공간 정보를 표시하는, 커버 코드들 중 적어 도 하나와 연관된 머신 학습 모듈들 중 적어도 하나를 식별하는 제2 신호를 수신하는 단계를 포함하는, 방법. 양태 43: 양태 42에 있어서, 머신 학습 모듈들 중 적어도 하나 및 송신 공간 정보를 사용하는 수신된 기준 신호 에 기초하여 채널 추정을 결정하는 단계; 및 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하고, 채널 추정을 결정하는 단계는, 머신 학습 모듈들 중 적어도 하나를 사용하여 안테나 아키텍처 와 연관된 복수의 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하는 단계를 포함하고, 머신 학습 모듈 들 중 적어도 하나는 수신된 기준 신호를 입력으로서 취하고, 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하는 단계는: 머신 학습 모듈들 중 적어도 하나를 이용하여, 포트 인덱스, 리소스 블록 인덱스, 각각의 리 소스 블록의 기준 서브캐리어 인덱스, 서브캐리어 인덱스, 또는 심볼 인덱스에 기초한 순서로 주파수 도메인 채 널 추정치들을 출력하는 단계; 및 서브캐리어 인덱스 또는 심볼 인덱스에 기초한 순서로 머신 학습 모듈들 중 적어도 하나에 수신된 기준 신호를 입력하는 단계를 포함하는, 방법. 양태 44: 양태 28 내지 양태 43 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 수신하는 단계는, 기준 신 호에 대한 준 공동위치(QCL) 구성을 표시하는 신호를 수신하는 단계를 포함하고, QCL 구성은 송신 공간 관계를 기준 신호에 대한 QCL 타입으로서 식별하는, 방법. 양태 45: 양태 44에 있어서, QCL 구성은 기준 신호와 QCL 관계를 갖는 QCL 기준 신호를 식별하고; 기준 신호를 수신하는 단계는 QCL 기준 신호를 수신하는 단계를 포함하는, 방법. 양태 46: 양태 45에 있어서, QCL 기준 신호는, 추적 기준 신호 또는 CSI 기준 신호(CSI-RS)에 대한 패턴; 머신 학습 모듈에 대한 훈련 데이터; 또는 이들의 임의의 조합을 포함하는, 방법. 양태 47: 양태 45 또는 양태 46에 있어서, QCL 기준 신호는 2개 이상의 포트들, 하나의 리소스 블록 내지 24개 의 리소스 블록들의 대역, 및 주기성을 포함하는, 방법. 양태 48: 양태 45 내지 양태 47 중 임의의 양태에 있어서, QCL 기준 신호의 공간 추적 루프에 기초하여 송신 공 간 정보를 결정하는 단계를 추가로 포함하는, 방법. 양태 49: 양태 44 내지 양태 48 중 임의의 양태에 있어서, 기준 신호가 송신 공간 관계의 QCL 타입을 갖는 것에 응답하여 수신된 기준 신호에 기초하는 송신 공간 정보를 결정하는 단계를 추가로 포함하는, 방법. 양태 50: 양태 44 내지 양태 49 중 임의의 양태에 있어서, 머신 학습 모듈 및 송신 공간 정보를 사용하는 수신 된 기준 신호에 기초하여 채널 추정을 결정하는 단계; 또는 머신 학습 모듈을 사용하는 송신 공간 정보에 적어 도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 51: 양태 50에 있어서, 수신된 기준 신호의 측정된 송신 공간 관계에 기초하여 복수의 머신 학습 모듈들 중의 머신 학습 모듈을 선택하는 단계를 추가로 포함하는, 방법. 양태 52: 양태 28 내지 양태 51 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 수신하는 단계는, 머신 학 습 모듈에 대한 훈련 데이터와 동일한 분포를 갖는 채널을 통해 기준 신호가 전달된다는 것을 표시하는 분포 내 구성을 수신하는 단계를 포함하고, 훈련 데이터는 송신 공간 정보를 표시하는, 방법.양태 53: 양태 52에 있어서, 머신 학습 모듈에 대한 훈련 데이터를 수신하는 단계를 추가로 포함하고, 분포 내 구성은 머신 학습 모듈에 대해 사용할 훈련 데이터를 추가로 표시하는, 방법. 양태 54: 양태 52 또는 양태 53에 있어서, 수신된 기준 신호 및 분포 내 구성에 기초하여 채널 추정을 결정하는 단계; 또는 분포 내 구성에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 55: 양태 52 또는 양태 53에 있어서, 수신된 기준 신호 및 분포 내 구성에 기초하여 채널 추정을 결정하는 단계; 및 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 56: 양태 54 또는 양태 55에 있어서, 채널 추정을 결정하는 단계는, 머신 학습 모듈을 사용하여 안테나 아 키텍처와 연관된 복수의 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정하는 단계를 포함하고, 머신 학 습 모듈은 수신된 기준 신호 및 훈련 데이터를 입력으로서 취하는, 방법. 양태 57: 양태 56에 있어서, 안테나 아키텍처와 연관된 포트들 각각에 대한 주파수 도메인 채널 추정치를 결정 하는 단계는, 서브캐리어 인덱스 또는 심볼 인덱스에 기초한 순서로 머신 학습 모듈에 수신된 기준 신호 및 훈 련 데이터를 입력하는 단계; 및 머신 학습 모듈을 이용하여, 포트 인덱스, 리소스 블록 인덱스, 각각의 리소스 블록의 기준 서브캐리어 인덱스, 서브캐리어 인덱스, 또는 심볼 인덱스에 기초한 순서로 주파수 도메인 채널 추 정치들을 출력하는 단계를 포함하는, 방법. 양태 58: 양태 53 내지 양태 57 중 임의의 양태에 있어서, 훈련 데이터를 사용하여 머신 학습 모듈을 훈련시키 는 단계; 머신 학습 모듈을 사용하는 수신된 기준 신호에 기초하여 채널 추정을 결정하는 단계; 및 채널 추정에 적어도 부분적으로 기초하여 CSI를 결정하는 단계를 추가로 포함하는, 방법. 양태 59: 네트워크 엔티티에 의한 무선 통신의 방법으로서, 네트워크 엔티티와 연관된 송신 공간 정보의 표시를 출력하는 단계; 송신 공간 정보에 기초하여 기준 신호를 출력하는 단계; 및 기준 신호 및 송신 공간 정보에 기 초하여 채널 상태 정보(CSI)를 획득하는 단계를 포함하는, 방법. 양태 60: 양태 59에 있어서, 송신 공간 정보는 네트워크 엔티티와 연관된 안테나 아키텍처의 하나 이상의 안테 나 엘리먼트들에 대한 하나 이상의 트랜시버 유닛(TxRU)들의 맵핑을 포함하는, 방법. 양태 61: 양태 59 또는 양태 60에 있어서, 송신 공간 정보의 표시를 출력하는 단계는, 송신 공간 정보를 식별하 는 커버 코드 구성을 출력하는 단계를 포함하고, 기준 신호를 출력하는 단계는 커버 코드 구성에 기초하여 기준 신호를 수신하는 단계를 포함하는, 방법. 양태 62: 양태 61에 있어서, 커버 코드 구성은 송신 공간 정보의 커버 코드를 식별하는, 방법. 양태 63: 양태 61 또는 양태 62에 있어서, 송신 공간 정보는, 그룹들로 배열된 채널 상태 정보 기준 신호(CSI- RS) 포트들에 대응하는 커버 코드를 식별하는, 방법. 양태 64: 양태 59 내지 양태 63 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 출력하는 단계는, 송신 공 간 정보와 연관된 머신 학습 모듈을 표시하는 신호를 출력하는 단계를 포함하는, 방법. 양태 65: 양태 64에 있어서, 머신 학습 모듈은 커버 코드 구성을 통해 표시되는, 방법. 양태 66: 양태 59 내지 양태 65 중 임의의 양태에 있어서, 복수의 머신 학습 모듈들을 표시하고 복수의 커버 코 드들 중의 커버 코드와 머신 학습 모듈들 각각 사이의 연관성을 표시하는 제1 신호를 출력하는 단계를 추가로 포함하고, 송신 공간 정보의 표시를 출력하는 단계는, 송신 공간 정보를 표시하는, 커버 코드들 중 적어도 하나 와 연관된 머신 학습 모듈들 중 적어도 하나를 식별하는 제2 신호를 출력하는 단계를 포함하는, 방법. 양태 67: 양태 59 내지 양태 66 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 출력하는 단계는, 기준 신 호에 대한 준 공동위치(QCL) 구성을 표시하는 신호를 출력하는 단계를 포함하고, QCL 구성은 송신 공간 관계를 기준 신호에 대한 QCL 타입으로서 식별하는, 방법. 양태 68: 양태 67에 있어서, QCL 구성은 기준 신호와 QCL 관계를 갖는 QCL 기준 신호를 식별하고; 기준 신호를 출력하는 단계는 QCL 기준 신호를 출력하는 단계를 포함하는, 방법. 양태 69: 양태 68에 있어서, QCL 기준 신호는, 추적 기준 신호 또는 CSI 기준 신호(CSI-RS)에 대한 패턴; 머신 학습 모듈에 대한 훈련 데이터; 또는 이들의 임의의 조합을 포함하는, 방법. 양태 70: 양태 68 또는 양태 69에 있어서, QCL 기준 신호는 2개 이상의 포트들, 하나의 리소스 블록 내지 24개 의 리소스 블록들의 대역, 및 주기성을 포함하는, 방법. 양태 71: 양태 59 내지 양태 70 중 임의의 양태에 있어서, 송신 공간 정보의 표시를 출력하는 단계는, 머신 학 습 모듈에 대한 훈련 데이터와 동일한 분포를 갖는 채널을 통해 기준 신호가 전달된다는 것을 표시하는 분포 내 구성을 출력하는 단계를 포함하고, 훈련 데이터는 송신 공간 정보를 표시하는, 방법. 양태 72: 양태 71에 있어서, 머신 학습 모듈에 대한 훈련 데이터를 출력하는 단계를 추가로 포함하고, 분포 내 구성은 머신 학습 모듈에 대해 사용할 훈련 데이터를 추가로 표시하는, 방법. 양태 73: 장치로서, 메모리; 및 메모리에 커플링된 프로세서를 포함하고, 프로세서는 양태 28 내지 양태 72 중 임의의 양태에 따른 방법을 수행하도록 구성되는, 장치. 양태 74: 장치로서, 양태 28 내지 양태 72 중 임의의 양태에 따른 방법을 수행하기 위한 수단을 포함하는, 장치. 양태 75: 컴퓨터 실행가능 명령들을 포함하는 비일시적 컴퓨터 판독가능 매체로서, 컴퓨터 실행가능 명령들은, 프로세싱 시스템의 하나 이상의 프로세서들에 의해 실행될 때, 프로세싱 시스템으로 하여금, 양태 1 내지 양태 23 중 임의의 양태에 따른 방법을 수행하게 하는, 비일시적 컴퓨터 판독가능 매체. 양태 76: 양태 28 내지 양태 72 중 임의의 양태에 따른 방법을 수행하기 위한 코드를 포함하는 컴퓨터 판독가능 저장 매체 상에 구현된 컴퓨터 프로그램 제품. 추가적인 무선 통신 네트워크 고려사항 본 명세서에 기재된 기술 및 방법은 다양한 무선 통신 네트워크(또는 무선 광역 네트워크(wireless wide area network, WWAN)) 및 라디오 액세스 기술(radio access technology, RAT)에 대해 사용될 수 있다. 양태는 3G, 4G 및/또는 5G(예를 들어, 5G 뉴 라디오(NR)) 무선 기술과 대체적으로 연관된 용어를 사용하여 본 명세서에 기 술될 수 있지만, 본 개시내용의 양태는 마찬가지로 본 명세서에 명시적으로 언급되지 않은 다른 통신 시스템 및 표준에 적용가능할 수 있다. 5G 무선 통신 네트워크는 향상된 모바일 브로드밴드(enhanced mobile broadband, eMBB), 밀리미터파 (millimeter wave, mmWave), 머신 타입 통신(machine type communications, MTC) 및/또는 미션 크리티컬 타깃 팅 URLLC(ultra-reliable, low-latency communications)와 같은 다양한 진보된 무선 통신 서비스를 지원할 수 있다. 이러한 서비스 및 다른 서비스는 레이턴시 및 신뢰성 요건을 포함할 수 있다. 도 1로 돌아가면, 본 개시내용의 다양한 양태가 예시적인 무선 통신 네트워크 내에서 수행될 수 있다. 3GPP에서, 용어 \"셀\"은 그 용어가 사용되는 맥락에 의존하여, NodeB의 커버리지 영역 및/또는 이 커버리지 영역 을 서빙하는 협대역 서브시스템을 지칭할 수 있다. NR 시스템에서, \"셀\" 및 BS, 차세대 NodeB(gNB 또는 gNodeB), 액세스 포인트(AP), 분산형 유닛(DU), 캐리어, 또는 TRP라는 용어는 상호교환 가능하게 사용될 수 있 다. BS는 매크로 셀, 피코 셀, 펨토 셀 및/또는 다른 타입의 셀에 대한 통신 커버리지를 제공할 수 있다. 매크로 셀은 대체적으로, 비교적 넓은 지리적 영역(예를 들어, 반경 수 킬로미터)을 커버할 수 있고, 서비스 가 입을 한 UE에 의한 제한 없는 액세스를 허용할 수 있다. 피코 셀은 비교적 작은 지리적 영역(예를 들어, 운동 경기장)을 커버할 수 있고, 그리고 서비스 가입된 UE에 의한 제한 없는 액세스를 허용할 수 있다. 펨토 셀은 비교적 작은 지리적 영역(예를 들어, 집)을 커버할 수 있고, 펨토 셀과의 연관을 갖는 UE(예를 들어, 폐쇄 가입 자 그룹(Closed Subscriber Group, CSG) 내의 UE 및 집에 있는 사용자에 대한 UE)에 의한 제한된 액세스를 허 용할 수 있다. 매크로 셀에 대한 BS는 매크로 BS로 지칭될 수 있다. 피코 셀에 대한 BS는 피코 BS로 지칭될 수 있다. 펨토 셀에 대한 BS는 펨토 BS, 홈 BS, 또는 홈 NodeB로 지칭될 수 있다. 4G LTE(집합적으로 E-UTRAN(Evolved Universal Mobile Telecommunications System(UMTS) Terrestrial Radio Access Network)으로 지칭됨)에 대해 구성된 BS는 제1 백홀 링크(예를 들어, S1 인터페이스)를 통해 EPC와 인터페이싱할 수 있다. 5G(예컨대, 5G NR 또는 NG-RAN(Next Generation RAN))에 대해 구성된 BS들 은 제2 백홀 링크들을 통해 5GC와 인터페이싱할 수 있다. BS는 제3 백홀 링크(예를 들어, X2 인터페이스)를 통해 서로 직접 또는 간접적으로 (예를 들어, EPC 또는 5GC를 통해) 통신할 수 있다. 제3 백홀 링크는 대체적으로 유선 또는 무선일 수 있다. 소형 셀(102')은 면허 및/또는 비면허 주파수 스펙트럼에서 동작할 수 있다. 비면허 주파수 스펙트럼에서 동작 하는 경우, 소형 셀(102')은 NR을 사용할 수 있고, Wi-Fi AP에 의해 사용되는 것과 동일한 5 ㎓ 비면허 주파수 스펙트럼을 사용할 수 있다. 비면허 주파수 스펙트럼에서 NR을 사용하는 소형 셀(102')은 액세스 네트워 크에 대한 커버리지를 부스팅하고 그리고/또는 용량을 증가시킬 수 있다. BS(예를 들어, gNB)와 같은 일부 기지국들은 UE와 통신할 시에, 종래의 서브 6 ㎓ 스펙트럼에서, 밀 리미터파(mmWave) 주파수에서, 그리고/또는 근 mmWave 주파수에서 동작할 수 있다. BS가 mmWave 또는 근 mmWave 주파수에서 동작할 때, BS는 mmWave 기지국으로 지칭될 수 있다. BS와, 예를 들어, UE 사이의 통신 링크는 하나 이상의 캐리어를 통한 것일 수 있다. 예를 들어, BS 및 UE는, 각각의 방향으로의 송신을 위해 사용되는 총 Yx MHz(x개의 컴포넌트 캐리어)까지 의 캐리어 집성에서 할당된 캐리어당 Y MHz(예를 들어, 5, 10, 15, 20, 100, 400 및 기타 MHz)까지의 대역폭의 스펙트럼을 사용할 수 있다. 캐리어들은 서로 인접할 수 있거나 인접하지 않을 수 있다. 반송파들의 할당은 DL 및 UL에 대해 비대칭적일 수 있다(예컨대, UL보다 더 많거나 더 적은 반송파들이 DL에 대해 할당될 수 있 음). 컴포넌트 캐리어들은 1차 컴포넌트 캐리어 및 하나 이상의 2차 컴포넌트 캐리어들을 포함할 수 있다. 1 차 컴포넌트 캐리어는 1차 셀(PCell)로서 지칭될 수 있고, 2차 컴포넌트 캐리어는 2차 셀(SCell)로서 지칭될 수 있다. 무선 통신 네트워크는, 예를 들어, 2.4 ㎓ 및/또는 5 ㎓ 비면허 주파수 스펙트럼에서 통신 링크를 통 해 Wi-Fi 스테이션(station, STA)과 통신하는 Wi-Fi 액세스 포인트(AP: access point)를 더 포함한 다. 비면허 주파수 스펙트럼에서 통신할 때, STA/AP는 채널이 사용가능한지 여부를 결정하기 위해 통신하기 전에 CCA(clear channel assessment)를 수행할 수 있다. 특정 UE들은 디바이스-대-디바이스(D2D) 통신 링크를 사용하여 서로 통신할 수 있다. D2D 통신 링크 는 DL/UL WWAN 스펙트럼을 사용할 수 있다. D2D 통신 링크는 물리적 사이드링크 브로드캐스트 채널 (physical sidelink broadcast channel, PSBCH), 물리적 사이드링크 발견 채널(physical sidelink discovery channel, PSDCH), 물리적 사이드링크 공유 채널(physical sidelink shared channel, PSSCH), 및 물리적 사이드 링크 제어 채널(physical sidelink control channel, PSCCH)과 같은 하나 이상의 사이드링크 채널들을 사용할 수 있다. D2D 통신은 몇몇 옵션의 예를 들자면, IEEE 802.11 표준, 4G(예를 들어, LTE), 또는 5G(예를 들어, NR)에 기반하여, 예를 들어, FlashLinQ, WiMedia, Bluetooth, ZigBee, Wi-Fi와 같은 다양한 무선 D2D 통신 시 스템을 통할 수 있다. EPC는 이동성 관리 엔터티(mobility management entity, MME), 다른 MME, 서빙 게이트웨이 , 멀티미디어 브로드캐스트 멀티캐스트 서비스(multimedia broadcast multicast service, MBMS) 게이트웨 이, 브로드캐스트 멀티캐스트 서비스 센터(broadcast multicast service center, BM-SC) 및 패킷 데 이터 네트워크(packet data network, PDN) 게이트웨이를 포함할 수 있다. MME는 홈 가입자 서버 (Home Subscriber Server, HSS)와 통신할 수 있다. MME는 UE와 EPC 사이의 시그널링을 프로세싱하는 제어 노드이다. 대체적으로, MME는 베어러 및 연결 관리를 제공한다. 대체적으로, 모든 사용자 인터넷 프로토콜(Internet protocol, IP) 패킷은, 자체로 PDN 게이트웨이에 연결 된 서빙 게이트웨이를 통해 전송된다. PDN 게이트웨이는 UE IP 어드레스 할당뿐만 아니라 다른 기능 을 제공한다. PDN 게이트웨이 및 BM-SC는, 예를 들어, 인터넷, 인트라넷, IMS(IP multimedia subsystem), PS 스트리밍 서비스, 및/또는 다른 IP 서비스를 포함할 수 있는 IP 서비스에 연결된다. BM-SC는 MBMS 사용자 서비스 프로비저닝(provisioning) 및 전달을 위한 기능을 제공할 수 있다. BM- SC는 콘텐츠 제공자 MBMS 전송을 위한 엔트리 포인트로서 기능할 수 있고, PLMN(public land mobile network) 내의 MBMS 베어러 서비스를 인가 및 개시하기 위해 사용될 수 있으며, MBMS 전송을 스케줄링하기 위해 사용될 수 있다. MBMS 게이트웨이는, 특정한 서비스를 브로드캐스팅하는 MBSFN(Multicast Broadcast Single Frequency Network) 영역에 속하는 BS들에 MBMS 트래픽을 분배하는 데 사용될 수 있고, 그리고 세 션 관리(시작/중지), 및 eMBMS 관련 과금 정보의 수집을 담당할 수 있다. 5GC는 액세스 및 이동성 관리 기능(access and mobility management function, AMF), 다른 AMF, 세션 관리 기능(session management function, SMF) 및 사용자 평면 기능(user plane function, UPF)을 포함할 수 있다. AMF는 통합 데이터 관리(unified data management, UDM)와 통신할 수 있다. AMF는 대체적으로 UE와 5GC 사이의 시그널링을 처리하는 제어 노드이다. 대체적으로, AMF(19 2)는 QoS 흐름 및 세션 관리를 제공한다.모든 사용자 IP 패킷은, IP 서비스에 연결되고 UE IP 어드레스 할당뿐만 아니라 5GC에 대한 다른 기 능을 제공하는 UPF를 통해 전송된다. IP 서비스는 예를 들어, 인터넷, 인트라넷, IMS, PS 스트리밍 서비스 및/또는 다른 IP 서비스를 포함할 수 있다. 도 2로 돌아가면, 본 개시내용의 양태를 구현하는 데 사용될 수 있는 BS 및 UE(예를 들어, 도 1의 무 선 통신 네트워크)의 다양한 예시적인 컴포넌트가 도시되어 있다. BS에서, 전송 프로세서는 데이터 소스로부터의 데이터 및 제어기/프로세서로부터의 제어 정보를 수신할 수 있다. 제어 정보는 물리적 브로드캐스트 채널(physical broadcast channel, PBCH), 물리적 제어 포맷 표시자 채널(physical control format indicator channel, PCFICH), 물리적 하이브리드 ARQ 표시자 채널(physical hybrid ARQ indicator channel, PHICH), 물리적 다운링크 제어 채널(physical downlink control channel, PDCCH), 그룹 공통 PDCCH(group common PDCCH, GC PDCCH) 등에 관한 것일 수 있다. 일부 실시예에서, 데이터는 물리적 다운링크 공유 채널(physical downlink shared channel, PDSCH)에 관한 것일 수 있다. 매체 액세스 제어(MAC)-제어 엘리먼트(medium access control-control element, MAC-CE)는 무선 노드 사이의 제어 커맨드 교환을 위해 사용될 수 있는 MAC 계층 통신 구조이다. MAC-CE는 공유 채널, 이를테면, 물리적 다 운링크 공유 채널(PDSCH), 물리적 업링크 공유 채널(physical uplink shared channel, PUSCH) 또는 물리적 사 이드링크 공유 채널(PSSCH)에서 반송될 수 있다. 송신 프로세서는 데이터 및 제어 정보를 프로세싱(예컨대, 인코딩 및 심볼 맵핑)하여, 데이터 심볼들 및 제어 심볼들을 각각 획득할 수 있다. 송신 프로세서는 또한, 예컨대 일차 동기화 신호(primary synchronization signal, PSS), 2차 동기화 신호(secondary synchronization signal, SSS), PBCH 복조 기준 신 호(demodulation reference signal, DMRS) 및 채널 상태 정보 기준 신호(CSI-RS)에 대해 기준 심볼들을 생성할 수 있다. 송신(TX) 다중입력 다중출력(MIMO) 프로세서는, 적용가능하다면, 데이터 심볼, 제어 심볼 및/또는 기준 심 볼에 대해 공간 프로세싱(예를 들어, 프리코딩)을 수행할 수 있고, 출력 심볼 스트림을 트랜시버(232a 내지 232t) 내의 변조기(modulator, MOD)에 제공할 수 있다. 트랜시버(232a 내지 232t) 내의 각각의 변조기는 각각 의 출력 심볼 스트림을 (예를 들어, OFDM을 위해) 처리하여 출력 샘플 스트림을 획득할 수 있다. 각각의 변조 기는 출력 샘플 스트림을 추가로 프로세싱(예컨대, 아날로그로의 변환, 증폭, 필터링 및 상향변환)하여, 다운링 크 신호를 획득할 수 있다. 트랜시버(232a 내지 232t) 내의 변조기로부터의 다운링크 신호는 안테나(234a 내지 234t)를 통해 각각 전송될 수 있다. UE에서, 안테나(252a 내지 252r)는 BS로부터 다운링크 신호를 수신할 수 있고, 수신된 신호를 트랜시 버(254a 내지 254r) 내의 복조기(demodulator, DEMOD)에 각각 제공할 수 있다. 트랜시버(254a 내지 254r)의 각각의 복조기는 각자의 수신된 신호를 컨디셔닝(예컨대, 필터링, 증폭, 하향변환, 및 디지털화)하여, 입력 샘 플을 획득할 수 있다. 각각의 복조기는 입력 샘플을 (예를 들어, OFDM을 위해) 추가로 처리하여, 수신된 심볼 을 획득할 수 있다. MIMO 검출기는 트랜시버(254a 내지 254r) 내의 모든 복조기로부터의 수신된 심볼을 획득하고, 적용가능하 다면 수신된 심볼에 대해 MIMO 검출을 수행하고, 검출된 심볼을 제공할 수 있다. 수신 프로세서는 검출된 심볼들을 프로세싱(예컨대, 복조, 디인터리빙 및 디코딩)하고, UE에 대한 디코딩된 데이터를 데이터 싱크 에 제공하고, 디코딩된 제어 정보를 제어기/프로세서에 제공할 수 있다. 업링크 상에서, UE에서, 송신 프로세서가 데이터 소스로부터의 (예컨대, 물리적 업링크 공유 채 널(physical uplink shared channel, PUSCH)에 대한) 데이터 및 제어기/프로세서로부터의 (예컨대, 물리 적 업링크 공유 채널(physical uplink control channel, PUCCH)에 대한) 제어 정보를 수신하고 프로세싱할 수 있다. 송신 프로세서는 또한, 기준 신호에 대한(예컨대, 사운딩 기준 신호(sounding reference signal, SRS)에 대한) 기준 심볼들을 생성할 수 있다. 송신 프로세서로부터의 심볼은 적용가능하다면 TX MIMO 프 로세서에 의해 프리코딩되고, 트랜시버 내의 변조기(254a 내지 254r)에 의해 (예컨대, SC-FDM을 위해) 추 가로 프로세싱되고, BS에 전송될 수 있다. BS에서, UE에 의해 송신된 데이터 및 제어 정보에 대한 디코딩된 데이터 및 제어 정보를 획득하기 위 해, UE로부터의 업링크 신호는 안테나(234a 내지 234t)에 의해 수신되고, 트랜시버(232a 내지 232t) 내의 복조기에 의해 프로세싱되고, 적용가능하다면 MIMO 검출기에 의해 검출되고, 수신 프로세서에 의해추가로 처리될 수 있다. 수신 프로세서는 디코딩된 데이터를 데이터 싱크에 제공하고, 디코딩된 제 어 정보를 제어기/프로세서에 제공할 수 있다. 메모리들(242, 282)은 각각 BS 및 UE에 대한 데이터 및 프로그램 코드들을 저장할 수 있다. 스케줄러는 다운링크 및/또는 업링크 상에서 데이터 송신을 위해 UE들을 스케줄링할 수 있다. 5G는 업링크 및 다운링크 상에서 주기적 전치 부호(cyclic prefix, CP)를 갖는 직교 주파수 분할 다중화 (orthogonal frequency division multiplexing, OFDM)를 활용할 수 있다. 5G는 또한 시분할 듀플렉싱(time division duplexing, TDD)을 사용하여 하프-듀플렉스 동작을 지원할 수 있다. OFDM 및 단일 캐리어 주파수 분 할 다중화(single-carrier frequency division multiplexing, SC-FDM)는, 톤(tone) 및 빈(bin)으로 대체적으로 또한 지칭되는 다수의 직교 서브캐리어로 시스템 대역폭을 분할한다. 각각의 서브캐리어는 데이터와 변조될 수 있다. 변조 심볼은 OFDM에 의해 주파수 도메인에서 그리고 SC-FDM에 의해 시간 도메인에서 전송될 수 있다. 인접한 서브캐리어 사이의 간격은 고정될 수 있고, 서브캐리어의 총 수는 시스템 대역폭에 따라 달라질 수 있다. 일부 실시예에서 리소스 블록(resource block, RB)으로 지칭되는 최소 리소스 할당은 12개의 연속하는 서브캐리어일 수 있다. 시스템 대역폭은 또한 서브대역들로 분할될 수 있다. 예를 들어, 서브대역은 다수의 RB를 커버할 수 있다. NR은 15 ㎑의 기본 서브캐리어 간격(subcarrier spacing, SCS)을 지원할 수 있고, 다른 SCS가 기본 SCS에 대해 정의될 수 있다(예를 들어, 30 ㎑, 60 ㎑, 120 ㎑, 240 ㎑ 등). 상기와 같이, 도 3a, 도 3b, 도 3c, 및 도 3d는 도 1의 무선 통신 네트워크와 같은 무선 통신 네트워크에 대한 데이터 구조들의 다양한 예시적인 양태들을 도시한다. 다양한 양태에서, 5G 프레임 구조는 특정 세트의 서브캐리어(캐리어 시스템 대역폭)에 대해, 해당 세트의 서브 캐리어 내의 서브프레임이 DL 또는 UL 전용인 주파수 분할 듀플렉스(frequency division duplex, FDD)일 수 있 다. 5G 프레임 구조는 또한 특정 세트의 서브캐리어(캐리어 시스템 대역폭)에 대해, 해당 세트의 서브캐리어 내의 서브프레임이 DL 및 UL 둘 모두의 전용인 시분할 듀플렉스(time division duplex, TDD)일 수 있다. 도 3a 및 도 3c에 의해 제공된 예에서, 5G 프레임 구조는 TDD인 것으로 가정되며, 서브프레임은 (주로 DL에 대 해) 슬롯 포맷을 사용하여 구성되고, D는 DL이고, U는 UL이고, X는 DL/UL 사이에서의 사용을 위해 유연하며, 서브프레임은 (주로 UL에 대해) 슬롯 포맷을 사용하여 구성된다. 서브프레임들 3, 4가 각각 슬롯 포맷들 34, 28로 도시되어 있지만, 임의의 특정 서브프레임은 다양한 이용가능한 슬롯 포맷들 0 내지 61 중 임의의 것으로 구성될 수 있다. 슬롯 포맷(0, 1) 모두는 각각 DL, UL이다. 다른 슬롯 포맷(2 내지 61)은 DL, UL, 및 유연한 심볼의 혼합을 포함한다. UE들은 DCI(DL control information)를 통해 동적으로, 또는 라 디오 리소스 제어(radio resource control, RRC) 시그널링을 통해 반-정적으로/정적으로) 수신된 SFI(slot format indicator)를 통해 슬롯 포맷으로 구성된다. 하기 설명은 TDD인 5G 프레임 구조에 또한 적용됨을 주목 한다. 다른 무선 통신 기술은 상이한 프레임 구조 및/또는 상이한 채널을 가질 수 있다. 프레임(10 ms)은 10개의 동 일하게 사이징된 서브프레임들(1 ms)로 분할될 수 있다. 각각의 서브프레임은 하나 이상의 시간 슬롯들을 포함 할 수 있다. 서브프레임은 또한, 7개, 4개, 또는 2개의 심볼을 포함할 수 있는 미니 슬롯을 포함할 수 있다. 일부 실시예에서, 각각의 슬롯은 슬롯 구성에 따라 7개 또는 14개의 심볼을 포함할 수 있다. 예를 들어, 슬롯 구성 0에 대해, 각각의 슬롯은 14개의 심볼을 포함할 수 있고, 슬롯 구성 1에 대해, 각각의 슬 롯은 7개의 심볼을 포함할 수 있다. DL 상의 심볼은 CP-OFDM(cyclic prefix OFDM) 심볼일 수 있다. UL 상의 심볼은 (높은 스루풋 시나리오의 경우) CP-OFDM 심볼 또는 (전력이 제한된 시나리오의 경우; 단일 스트림 송신 으로 제한됨) 이산 푸리에 변환(discrete Fourier transform, DFT) 확산 OFDM(DFT-s-OFDM) 심볼(단일 캐리어 주파수 분할 다중 액세스(single carrier frequency-division multiple access, SC-FDMA) 심볼이라고도 칭함) 일 수 있다. 서브프레임 내의 슬롯의 수는 슬롯 구성 및 뉴머롤로지(numerology)에 기반한다. 슬롯 구성 0의 경우, 상이한 뉴머롤로지 μ 0 내지 5는 서브프레임마다 각각 1, 2, 4, 8, 16, 및 32개의 슬롯을 허용한다. 슬롯 구성 1의 경우, 상이한 뉴머롤로지 0 내지 2는 서브프레임마다 각각 2, 4 및 8개의 슬롯을 허용한다. 따라서, 슬롯 구성 0 및 뉴머롤로지 μ의 경우, 14개의 심볼/슬롯 및 2μ개의 슬롯/서브프레임이 존재한다. 서브캐리어 간격 및 심볼 길이/지속기간은 뉴머롤로지의 함수이다. 서브캐리어 간격은 2μ × 15와 동일할 수 있고, 여기서 μ는 뉴 머롤로지 0 내지 5이다. 따라서, 뉴머롤로지 μ=0은 15 ㎑의 서브캐리어 간격을 갖고, 뉴머롤로지 μ=5는 480 ㎑의 서브캐리어 간격을 갖는다. 심볼 길이/지속기간은 서브캐리어 간격과 역으로 관련된다. 도 3a, 도 3b,도 3c, 및 도 3d는 슬롯마다 14개의 심볼을 갖는 슬롯 구성 0 및 서브프레임마다 4개의 슬롯을 갖는 뉴머롤로지 μ=2의 예를 제공한다. 슬롯 지속기간은 0.25 ms이고, 서브캐리어 간격은 60 kHz이며, 심볼 지속기간은 대략 16.67 μs 이다. 리소스 그리드가 프레임 구조를 나타내기 위해 사용될 수 있다. 각각의 시간 슬롯은 12개의 연속하는 서브캐리 어들을 확장시키는 리소스 블록(RB)(또한 물리적 RB(PRB)들로 지칭됨)를 포함한다. 리소스 그리드는 다중의 리 소스 엘리먼트들(RE들)로 분할된다. 각각의 RE에 의해 반송되는 비트들의 수는 변조 방식에 의존한다. 도 3a에 도시된 바와 같이, RE 중 일부는 UE(예를 들어, 도 1 및 도 2의 UE)에 대한 기준(파일롯) 신호 (reference signal, RS)를 반송한다. RS는 UE에서의 채널 추정을 위해 복조 RS(demodulation RS, DM-RS)(하나 의 특정 구성에 대해 Rx로 표시됨, 여기서 100x는 포트 번호이지만, 다른 DM-RS 구성이 가능함) 및 채널 상태 정보 기준 신호(CSI-RS)를 포함할 수 있다. RS는 또한 BRS(Beam Measurement RS), BRRS(Beam Refinement RS) 및 PT-RS(Phase Tracking RS)를 포함할 수 있다. 도 3b는 프레임의 서브프레임 내의 다양한 DL 채널의 예를 도시한다. 물리적 다운링크 제어 채널(PDCCH)은 하 나 이상의 제어 채널 엘리먼트(control channel element, CCE) 내에서 DCI를 반송하며, 각각의 CCE는 9개의 RE 그룹(REG)을 포함하고, 각각의 REG는 OFDM 심볼에서 4개의 연속하는 RE를 포함한다. 1차 동기화 신호(primary synchronization signal, PSS)는 프레임의 특정한 서브프레임들의 심볼 2 내에 있을 수 있다. PSS는 서브프레임/심볼 타이밍 및 물리적 계층 ID를 결정하기 위해 UE(예를 들어, 도 1 및 도 2의 104)에 의해 사용된다. 2차 동기화 신호(SSS)는 프레임의 특정한 서브프레임들의 심볼 4 내에 있을 수 있다. SSS는 물리적 계층 셀 아 이덴티티 그룹 번호 및 라디오 프레임 타이밍을 결정하기 위해 UE에 의해 사용된다. 물리적 계층 아이덴티티 및 물리적 계층 셀 아이덴티티 그룹 번호에 기반하여, UE는 물리적 셀 식별자(physical cell identifier, PCI)를 결정할 수 있다. PCI에 기반하여, UE는 전술된 DM-RS의 위치를 결정할 수 있다. 마 스터 정보 블록(master information block, MIB)을 반송하는 물리적 브로드캐스트 채널(PBCH)은 동기화 신호 (synchronization signal, SS)/PBCH 블록을 형성하기 위해 PSS 및 SSS와 논리적으로 그룹화될 수 있다. MIB는 시스템 대역폭 내의 RB들의 수 및 시스템 프레임 번호(system frame number, SFN)를 제공한다. 물리적 다운링 크 공유 채널(PDSCH)은, 사용자 데이터, PBCH를 통해 송신되지 않는 브로드캐스트 시스템 정보, 이를테면 시스 템 정보 블록(system information block, SIB)들, 및 페이징 메시지들을 반송한다. 도 3c에 나타낸 바와 같이, 일부 RE는 기지국에서 채널 추정을 위해 DM-RS(특정 구성의 경우 R로 표시되지만 다 른 DM-RS 구성도 가능함)를 전달한다. UE는 물리적 업링크 제어 채널(physical uplinik control channel, PUCCH)에 대한 DM-RS 및 물리적 업링크 공유 채널(physical uplink shared channel, PUSCH)에 대한 DM-RS를 송 신할 수 있다. PUSCH DM-RS는 PUSCH의 처음 하나 또는 2개의 심볼들에서 송신될 수 있다. PUCCH DM-RS는, 짧 은 PUCCH가 송신되는지 또는 긴 PUCCH가 송신되는지 여부에 의존하여 그리고 사용된 특정한 PUCCH 포맷에 의존 하여 상이한 구성들로 송신될 수 있다. UE는 사운딩 기준 신호(SRS)를 송신할 수 있다. SRS는 서브프레임의 마지막 심볼에서 송신될 수 있다. SRS는 콤(comb) 구조를 가질 수 있으며, UE는 콤들 중 하나 상에서 SRS를 송 신할 수 있다. SRS는 UL 상에서의 주파수- 의존 스케줄링을 가능하게 하기 위한 채널 품질 추정을 위하여 기지 국에 의해 사용될 수 있다. 도 3d는 프레임의 서브프레임 내의 다양한 UL 채널의 예를 도시한다. PUCCH는 일 구성에서 표시된 바와 같이 위치될 수 있다. PUCCH는 업링크 제어 정보(UCI), 이를테면, 스케줄링 요청, 채널 품질 표시자(CQI), 프리코딩 매트릭스 표시자(PMI), 랭크 표시자(RI) 및 HARQ ACK/NACK 피드백을 반송한다. PUSCH는 데이터를 반송하며, 추 가적으로는, 버퍼 상태 보고(BSR), 전력 헤드룸 보고(PHR, 및/또는 UCI를 반송하기 위해 사용될 수 있다. 도 4를 참조하면, 각각의 유닛들, 예컨대, CU들, DU들, RU들뿐만 아니라 근-RT RIC들, 비 -RT RIC들 및 SMO 프레임워크는 하나 이상의 인터페이스들을 포함하거나, 또는 유선 또는 무선 송신 매체를 통해 신호들, 데이터, 또는 정보(집합적으로, 신호들)를 수신하도록 또는 송신하도록 구성된 하나 이상 의 인터페이스들에 커플링될 수 있다. 유닛들의 각각, 또는 유닛들의 통신 인터페이스들에 명령들을 제공하는 연관된 프로세서 또는 제어기는 송신 매체를 통해 다른 유닛들 중 하나 이상과 통신하도록 구성될 수 있다. 예 를 들어, 유닛들은, 다른 유닛들 중 하나 이상에 대한 유선 송신 매체 상으로 신호들을 수신 또는 송신하도록 구성된 유선 인터페이스를 포함할 수 있다. 추가적으로, 유닛들은 다른 유닛들 중 하나 이상에 대한 무선 송신 매체를 통해 신호들을 수신하거나 송신하거나 또는 둘 모두를 행하도록 구성된 수신기, 송신기 또는 트랜시버(예컨대, 라디오 주파수(RF) 트랜시버)를 포함할 수 있는 무선 인터페이스를 포함할 수 있다. 일부 양태들에서, CU는 하나 이상의 상위 계층 제어 기능들을 호스팅할 수 있다. 그러한 제어 기능들은 라디오 리소스 제어(RRC), 패킷 데이터 수렴 프로토콜(packet data convergence protocol, PDCP), 서비스 데이 터 적응 프로토콜(service data adaptation protocol, SDAP) 등을 포함할 수 있다. 각각의 제어 기능은, CU에 의해 호스팅되는 다른 제어 기능들과 신호들을 통신하도록 구성된 인터페이스로 구현될 수 있다. CU는 사용자 평면 기능성(즉, 중앙 유닛-사용자 평면(CU-UP)), 제어 평면 기능성(즉, 중앙 유닛-제어 평면 (CU-CP)), 또는 이들의 조합을 핸들링하도록 구성될 수 있다. 일부 구현들에서, CU는 하나 이상의 CU-UP 유닛들 및 하나 이상의 CU-CP 유닛들로 논리적으로 분할될 수 있다. CU-UP 유닛은, O-RAN 구성으로 구현될 때 E1 인터페이스와 같은 인터페이스를 통해 CU-CP 유닛과 양방향으로 통신할 수 있다. CU는 네트워크 제어 및 시그널링을 위해 필요에 따라 DU와 통신하도록 구현될 수 있다. DU는, 하나 이상의 RU들의 동작을 제어하기 위한 하나 이상의 기지국 기능들을 포함하는 논리 유닛에 대응할 수 있다. 일부 양태들에서, DU는 제3세대 파트너십 프로젝트(3GPP)에 의해 정의된 것들과 같은 기 능 분할에 적어도 부분적으로 의존하여, 라디오 링크 제어(RLC) 계층, 매체 액세스 제어(MAC) 계층, 및 하나 이 상의 높은 물리(PHY) 계층들(예컨대, FEC(forward error correction) 인코딩 및 디코딩, 스크램블링, 변조 및 복조 등을 위한 모듈들) 중 하나 이상을 호스팅할 수 있다. 일부 양태들에서, DU는 하나 이상의 낮은 PHY 계층들을 추가로 호스팅할 수 있다. 각각의 계층(또는 모듈)은, DU에 의해 호스팅된 다른 계층들(및 모듈 들)과, 또는 CU에 의해 호스팅된 제어 기능들과 신호들을 통신하도록 구성된 인터페이스로 구현될 수 있다. 하위 계층 기능성은 하나 이상의 RU들에 의해 구현될 수 있다. 일부 배치들에서, DU에 의해 제어되 는 RU는, 하위 계층 기능 분할과 같은 기능 분할에 적어도 부분적으로 기초하여 RF 프로세싱 기능들, 또는 낮은 PHY 계층 기능들(예컨대, 고속 푸리에 변환(FFT), iFFT(inverse FFT), 디지털 빔포밍, 물리적 랜덤 액세스 채널(PRACH) 추출 및 필터링 등을 수행함), 또는 둘 모두를 호스팅하는 논리 노드에 대응할 수 있다. 그러한 아키텍처에서, RU(들)는 하나 이상의 UE들과의 OTA(over the air) 통신을 핸들링하도록 구현될 수 있 다. 일부 구현들에서, RU(들)와의 제어 및 사용자 평면 통신의 실시간 및 비-실시간 양태들은 대응하는 DU에 의해 제어될 수 있다. 일부 시나리오들에서, 이러한 구성은 DU(들) 및 CU가 vRAN 아키텍 처와 같은 클라우드 기반 RAN 아키텍처로 구현될 수 있게 할 수 있다. SMO 프레임워크는 비-가상화된 및 가상화된 네트워크 엘리먼트들의 RAN 배치 및 프로비저닝을 지원하도록 구성될 수 있다. 비-가상화된 네트워크 엘리먼트들에 대해, SMO 프레임워크는, 동작들 및 유지보수 인터 페이스(예컨대, O1 인터페이스)를 통해 관리될 수 있는 RAN 커버리지 요건들에 대한 전용 물리적 리소스들의 배 치를 지원하도록 구성될 수 있다. 가상화된 네트워크 엘리먼트들에 대해, SMO 프레임워크는 클라우드 컴 퓨팅 플랫폼 인터페이스(예컨대, O2 인터페이스)를 통해 네트워크 엘리먼트 수명 사이클 관리를 수행하기 위해 (예컨대, 가상화된 네트워크 엘리먼트들을 인스턴스화하기 위해) 클라우드 컴퓨팅 플랫폼(예컨대, O-클라우드 (open cloud))과 상호작용하도록 구성될 수 있다. 그러한 가상화된 네트워크 엘리먼트들은 CU들, DU 들, RU들, 및 근-RT RIC들을 포함할 수 있지만 이들로 제한되지 않는다. 일부 구현들에서, SMO 프레임워크는 O1 인터페이스를 통해, O-eNB(open eNB)와 같은 4G RAN의 하드웨어 양태와 통신할 수 있다. 추가적으로, 일부 구현들에서, SMO 프레임워크는 O1 인터페이스를 통해 하나 이상의 RU들과 직접 통신할 수 있다. SMO 프레임워크는 또한 SMO 프레임워크의 기능성을 지원하도록 구성된 비-RT RIC를 포함할 수 있다. 비-RT RIC는 RAN 엘리먼트들 및 리소스들, 모델 훈련 및 업데이트들을 포함하는 인공 지능/머신 학습 (AL/ML) 워크플로우들, 또는 근-RT RIC에서의 애플리케이션들/특징들의 정책 기반 안내의 비-실시간 제어 및 최적화를 가능하게 하는 논리 함수를 포함하도록 구성될 수 있다. 비-RT RIC는 근-RT RIC에 커플 링되거나 또는 그와 (예컨대, A1 인터페이스를 통해) 통신할 수 있다. 근-RT RIC는, 하나 이상의 CU들 , 하나 이상의 DU들, 또는 둘 모두뿐만 아니라 O-eNB를 근-RT RIC와 연결시키는 인터페이스를 통한(예컨대, E2 인터페이스를 통한) 데이터 수집 및 액션들을 통해 RAN 엘리먼트들 및 리소스들의 근-실시간 제어 및 최적화를 가능하게 하는 논리 함수를 포함하도록 구성될 수 있다. 일부 구현들에서, 근-RT RIC에서 배치될 AI/ML 모델들을 생성하기 위해, 비-RT RIC는 외부 서버들로 부터 파라미터들 또는 외부 강화 정보를 수신할 수 있다. 그러한 정보는 근-RT RIC에 의해 활용될 수 있 고, 비-네트워크 데이터 소스들로부터 또는 네트워크 기능들로부터 SMO 프레임워크 또는 비-RT RIC에서 수신될 수 있다. 일부 예들에서, 비-RT RIC 또는 근-RT RIC는 RAN 거동 또는 성능을 튜닝하도록 구성될 수 있다. 예를 들어, 비-RT RIC는 성능에 대한 장기 추세들 및 패턴들을 모니터링하고, AI/ML 모 델들을 채용하여 (O1을 통한 재구성과 같은) SMO 프레임워크를 통해 또는 (A1 정책들과 같은) RAN 관리 정 책들의 생성을 통해 정정 액션들을 수행할 수 있다. 추가적인 고려사항들 이전의 설명은 통신 시스템들에서의 채널 추정 및/또는 채널 상태 정보 보고의 예들을 제공한다. 이전의 설명 은 임의의 당업자가 본 명세서에 설명된 다양한 양태들을 실시할 수 있게 하도록 제공된다. 본 명세서에서 논 의된 예들은 청구항들에서 제시된 범위, 적용가능성 또는 양태들의 제한이 아니다. 이들 양태들에 대한 다양한 수정들은 당업자에게 용이하게 자명할 것이며, 본 명세서에서 정의된 일반적인 원리들은 다른 양태들에 적용될 수 있다. 예를 들어, 본 개시내용의 범위를 벗어나지 않고서 논의되는 엘리먼트들의 기능 및 배열에 변경들이 이루어질 수 있다. 다양한 예들은 다양한 절차들 또는 컴포넌트들을 적절히 생략, 대체 또는 추가할 수 있다. 예를 들어, 설명된 방법들은 설명되는 것과 상이한 순서로 수행될 수 있고, 다양한 단계들이 추가, 생략 또는 조합될 수 있다. 또한, 일부 예들과 관련되어 설명된 특징들은 일부 다른 예들로 조합될 수 있다. 예를 들어, 본 명세서에 기재된 임의의 수의 양태들을 사용하여 장치가 구현될 수 있거나 방법이 실시될 수 있다. 또한, 본 개시내용의 범위는, 본 명세서에 기술된 본 개시내용의 다양한 양태들에 추가로 또는 그 이외의 다른 구조, 기능 또는 구조 및 기능을 사용하여 실시되는 이러한 장치 또는 방법을 커버하도록 의도된다. 본 명세서에 개 시된 본 개시내용의 임의의 양태가 청구범위의 하나 이상의 엘리먼트들에 의해 구현될 수 있다는 것이 이해되어 야 한다. 본 명세서에서 설명된 기법은, 5G(예컨대, 5G NR), 3GPP 롱 텀 에볼루션(Long Term Evolution, LTE), LTE-어드 밴스드(LTE-Advanced, LTE-A), 코드 분할 다중 액세스(code-division multiple access, CDMA), 시분할 다중 액 세스(time-division multiple access, TDMA), 주파수 분할 다중 액세스(frequency-division multiple access, FDMA), 직교 주파수 분할 다중 액세스(orthogonal frequency-division multiple access, OFDMA), 단일 반송파 주파수 분할 다중 액세스(SC-FDMA), 시분할 동기화 코드 분할 다중 액세스(time division synchronous code division multiple access, TD-SCDMA) 및 다른 네트워크와 같은 다양한 무선 통신 기술에 대해 사용될 수 있다. 용어 \"네트워크\" 및 \"시스템\"은 종종 상호교환 가능하게 사용된다. CDMA 네트워크는, 범용 지상 라디오 액세스(universal terrestrial radio access, UTRA), cdma2000 등과 같은 라디오 기술을 구현할 수 있다. UTRA는 광대역 CDMA(WCDMA), 및 CDMA의 다른 변형을 포함한다. cdma2000은 IS-2000, IS-95 및 IS-856 표준을 커버한다. TDMA 네트워크는 GSM(global system for mobile communications)과 같은 라디오 기술을 구현할 수 있다. OFDMA 네트워크는, NR(예를 들어, 5G RA), 이볼브드 UTRA(E-UTRA), UMB(Ultra Mobile Broadband), IEEE 802.11(Wi-Fi), IEEE 802.16(WiMAX), IEEE 802.20, 플래시-OFDMA 등과 같은 라디오 기술을 구현할 수 있다. UTRA 및 E-UTRA는 범용 이동 통신 시스템(universal mobile telecommunication system, UMTS)의 일부이다. LTE 및 LTE-A는 E-UTRA를 사용하는 UMTS의 릴리스이다. UTRA, E-UTRA, UMTS, LTE, LTE-A 및 GSM는 \"3세대 파 트너십 프로젝트(3GPP)\"로 명명된 조직으로부터 제공되는 문헌에 설명되어 있다. cdma2000 및 UMB는 \"3세대 파 트너십 프로젝트 2(3GPP2)\"로 명명된 조직으로부터의 문헌에 설명되어 있다. NR은 개발 중인 신흥 무선 통신 기술이다. 본 개시내용과 연관하여 기술되는 다양한 예시적인 논리 블록, 모듈, 및 회로는 범용 프로세서, DSP, ASIC, 필 드 프로그래밍가능 게이트 어레이(field programmable gate array, FPGA) 또는 다른 프로그래밍가능 로직 디바 이스(programmable logic device, PLD), 이산 게이트 또는 트랜지스터 로직, 이산 하드웨어 컴포넌트 또는 본 명세서에 기술된 기능을 수행하도록 설계된 이의 임의의 조합으로 구현 또는 수행될 수 있다. 범용 프로세서는 마이크로프로세서일 수 있지만, 대안으로 프로세서는 임의의 상업적으로 이용가능한 프로세서, 제어기, 마이크 로제어기 또는 상태 머신일 수 있다. 프로세서는 또한 컴퓨팅 디바이스의 조합, 예를 들어 DSP 및 마이크로프 로세서의 조합, 복수의 마이크로프로세서, DSP 코어와 조합된 하나 이상의 마이크로프로세서, SoC(system on a chip) 또는 임의의 다른 이러한 구성으로서 구현될 수 있다. 하드웨어로 구현되는 경우, 예시적인 하드웨어 구성은 무선 노드 내의 프로세싱 시스템을 포함할 수 있다. 프 로세싱 시스템은 버스 아키텍처로 구현될 수 있다. 버스는 프로세싱 시스템의 특정 애플리케이션 및 전체적인 설계 제약에 따라, 임의의 개수의 상호연결 버스 및 브리지를 포함할 수 있다. 버스는 프로세서, 머신 판독가 능 저장 매체, 및 버스 인터페이스를 포함하는 다양한 회로를 함께 연결시킬 수 있다. 버스 인터페이스는 무엇 보다도, 네트워크 어댑터를 버스를 통해 프로세싱 시스템에 연결하는 데 사용될 수 있다. 네트워크 어댑터는 물리적(PHY) 계층의 신호 프로세싱 기능을 구현하는 데 사용될 수 있다. (도 1의 예시적인 UE에서와같은) 사용자 장비의 경우에, 사용자 인터페이스(예컨대, 키패드, 디스플레이, 마우스, 조이스틱, 터치스크린, 생체인식 센서, 근접 센서, 발광 엘리먼트 등)는 또한 버스에 연결될 수 있다. 버스는 또한 타이밍 소스들, 주 변기기들, 전압 레귤레이터들, 전력 관리 회로들 등과 같은 다양한 다른 회로들을 링크시킬 수 있고, 이들은 당"}
{"patent_id": "10-2024-7029515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "해 기술분야에 잘 공지되어 있으므로, 더 이상 설명되지 않을 것이다. 프로세서는 하나 이상의 범용 및/또는 특수 목적 프로세서를 사용하여 구현될 수 있다. 예는 마이크로프로세서, 마이크로제어기, DSP 프로세서, 및 소프트웨어를 실행할 수 있는 다른 회로를 포함한다. 당업자는 전체 시스템에 부과된 전체 설계 제약 및 특정 애플리케이션에 따라 프로세싱 시스템에 대해 기술된 기능을 최상으로 구현하는 방법을 인식할 것이다. 소프트웨어로 구현되는 경우, 기능은 컴퓨터 판독가능 저장 매체 상에 하나 이상의 명령 또는 코드로서 저장되 거나 이를 통해 전송될 수 있다. 소프트웨어는, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 기술 언어로서 또는 이와 달리 언급되든지 간에, 명령, 데이터 또는 이의 임의의 조합을 의미하도록 넓게 해석될 것 이다. 컴퓨터 판독가능 저장 매체는, 일 장소에서 다른 장소로의 컴퓨터 프로그램의 전달을 용이하게 하는 임 의의 매체를 포함한 통신 매체 및 컴퓨터 저장 매체 둘 모두를 포함한다. 프로세서는, 머신 판독가능 저장 매 체에 저장된 소프트웨어 모듈의 실행을 포함하여, 버스의 관리 및 일반적 프로세싱을 담당할 수 있다. 컴퓨터 판독가능 저장 매체는, 프로세서가 저장 매체로부터 정보를 판독하고 저장 매체에 정보를 기록할 수 있도록 프 로세서에 커플링될 수 있다. 대안적으로, 저장 매체는 프로세서에 통합될 수 있다. 예를 들어, 머신 판독가능 저장 매체는 전송선, 데이터에 의해 변조된 캐리어, 및/또는 무선 노드와는 별개로 명령이 저장된 컴퓨터 판독 가능 저장 매체를 포함할 수 있고, 이들 모두는 버스 인터페이스를 통해 프로세서에 의해 액세스될 수 있다. 대안적으로 또는 추가적으로, 머신 판독가능 저장 매체, 또는 이의 임의의 부분은, 캐시 및/또는 범용 레지스터 파일에서 흔히 있듯이, 프로세서에 통합될 수 있다. 머신 판독가능 저장 매체의 예는, 예를 들어, 랜덤 액세스 메모리(random access memory, RAM), 플래시 메모리, 판독 전용 메모리(read only memory, ROM), 프로그래밍가 능 판독 전용 메모리(programmable read-only memory, PROM), 소거가능 프로그래밍가능 판독 전용 메모리 (erasable programmable read-only memory, EPROM), 전자적으로 소거가능 프로그래밍가능 판독 전용 메모리 (electrically erasable programmable read-only memory, EEPROM), 레지스터, 자기 디스크, 광학 디스크, 하드 드라이브, 또는 임의의 다른 적합한 저장 매체, 또는 이의 임의의 조합을 포함할 수 있다. 머신 판독가능 저장 매체는 컴퓨터 프로그램 제품에서 구체화될 수 있다. 소프트웨어 모듈은 단일 명령 또는 다수의 명령을 포함할 수 있고, 다수의 저장 매체에 걸쳐 상이한 프로그램 사이에서 몇몇 상이한 코드 세그먼트에 걸쳐 분산될 수 있다. 컴퓨터 판독가능 저장 매체는 다수의 소프트웨어 모듈을 포함할 수 있다. 소프트웨어 모듈은, 프로세서와 같은 장치에 의해 실행될 때, 프로세싱 시스템으로 하 여금 다양한 기능을 수행하게 하는 명령을 포함한다. 소프트웨어 모듈은 송신 모듈 및 수신 모듈을 포함할 수 있다. 각각의 소프트웨어 모듈은 단일 저장 디바이스에 상주할 수 있거나, 또는 다수의 저장 디바이스에 걸쳐 분산될 수 있다. 예를 들어, 소프트웨어 모듈은 트리거 이벤트가 발생하는 경우 하드 드라이브로부터 RAM으로 로딩될 수 있다. 소프트웨어 모듈의 실행 동안, 프로세서는 액세스 속도를 증가시키기 위해 캐시 내로 명령의 일부를 로딩할 수 있다. 이어서, 하나 이상의 캐시 라인은 프로세서에 의한 실행을 위해 범용 레지스터 파일로 로딩될 수 있다. 아래에서 소프트웨어 모듈의 기능을 참조할 때, 그러한 기능이 그 소프트웨어 모듈로부터의 명령을 실행할 때 프로세서에 의해 구현된다는 것이 이해될 것이다. 본 명세서에서 사용된 바와 같이, 한 목록의 아이템들 \"중 적어도 하나\"를 지칭하는 어구는 단일 멤버들을 포함 하여 그 아이템들의 임의의 조합을 지칭한다. 예로서, \"a, b 또는 c 중 적어도 하나\"는 a, b, c, a-b, a-c, b- c, 및 a-b-c뿐만 아니라 동일한 엘리먼트의 배수들과의 임의의 조합(예를 들어, a-a, a-a-a, a-a-b, a-a-c, a- b-b, a-c-c, b-b, b-b-b, b-b-c, c-c, 및 c-c-c 또는 a, b, 및 c의 임의의 다른 순서화)을 커버하도록 의도된 다. 본 명세서에 사용된 바와 같이, 용어 \"결정\"은 매우 다양한 액션을 포괄한다. 예를 들어, \"결정\"은 계산, 컴퓨 팅, 프로세싱, 유도, 검사, 검색(예컨대, 표, 데이터베이스 또는 다른 데이터 구조에서의 검색), 확인 등을 포 함할 수 있다. 또한, \"결정\"은 수신(예를 들어, 정보 수신), 액세스(예를 들어, 메모리 내의 데이터에 액세스) 등을 포함할 수 있다. 또한, \"결정\"은 해결, 선택, 선정, 설정 등을 포함할 수 있다. 본 명세서에서 개시된 방법들은 그 방법들을 달성하기 위한 하나 이상의 단계들 또는 액션들을 포함한다. 방법 단계 및/또는 동작은 청구범위의 범위를 벗어나지 않고 서로 교환될 수 있다. 즉, 단계 또는 동작의 특정한 순 서가 규정되지 않으면, 특정 단계 및/또는 동작의 순서 및/또는 사용은 청구범위의 범위를 벗어나지 않고 변형 될 수 있다. 추가로, 앞서 설명된 방법들의 다양한 동작들은 대응하는 기능들을 수행할 수 있는 임의의 적절한 수단에 의해 수행될 수 있다. 이 수단은, 회로, ASIC(application specific integrated circuit) 또는 프로세서를 포함하지만 이에 제한되지는 않는 다양한 하드웨어 및/또는 소프트웨어 컴포넌트(들) 및/또는 모듈(들)을 포함할 수 있다. 대체적으로, 도면에 도시된 동작이 존재하는 경우, 이 동작은 유사한 넘버링을 갖는 상응하는 대응 수단-및-기능(means-plus-function) 컴포넌트를 가질 수 있다. 다음의 청구항들은 본 명세서에 도시된 양태들로 제한되도록 의도되는 것이 아니라, 청구항들의 언어와 일치하 는 전체 범위에 부합할 것이다. 청구항 내에서, 단수의 엘리먼트에 대한 참조는, 구체적으로 그렇게 언급되지 않는 한, \"하나 및 단 하나\"를 의미하는 것으로 의도되는 것이 아니라, \"하나 이상\"을 의미하도록 의도된다. 구체적으로 달리 언급되지 않으면, 용어 \"일부\"는 하나 이상을 나타낸다. 구문 \"~하기 위한 수단\"을 사용하여 엘리먼트가 명시적으로 인용되지 않는 한, 또는 방법 청구항의 경우 구문 \"~하기 위한 단계\"를 사용하여 엘리먼 트가 인용되지 않는 한, 어떠한 청구항 엘리먼트도 35 U.S.C. §112(f) 조항들 하에서 해석되지 않아야 한다. 당업자들에게 공지되거나 추후 공지될 본 개시내용 전반에 걸쳐 설명되는 다양한 양태들의 엘리먼트들에 대한 모든 구조적 및 기능적 균등물들은 본 명세서에 참조로 명백하게 통합되어 있고 청구항들에 의해 포함되는 것으 로 의도된다. 또한, 본 명세서에 개시된 어떠한 것도, 이러한 개시내용이 청구항들에 명시적으로 인용되었는지 여부와 무관하게 대중에게 제공되도록 의도되지 않는다."}
{"patent_id": "10-2024-7029515", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부된 도면은 본 명세서에서 설명된 다양한 양태의 소정 특징을 도시하며, 본 개시내용의 범위를 제한하는 것으로 간주되지 않아야 한다. 도 1은 예시적인 무선 통신 네트워크를 개념적으로 예시하는 블록도이다. 도 2는 기지국 및 사용자 장비의 예시적인 양태를 개념적으로 예시하는 블록도이다. 도 3a, 도 3b, 도 3c, 및 도 3d는 무선 통신 네트워크에 대한 데이터 구조의 다양한 예시적인 양태를 도시한다. 도 4는 예시적인 디스어그리게이팅(disaggregate)된 기지국 아키텍처를 예시하는 도면을 도시한다. 도 5는 송신 공간 정보를 사용하는 예시적인 무선 통신 네트워크를 예시하는 도면이다. 도 6은 예를 들어, 채널 추정을 결정하기 위해 뉴럴 네트워크를 사용하는 예시적인 인공 지능 아키텍처를 예시 하는 도면이다. 도 7a는 사용자 장비 및 기지국 전체에 걸친 예시적인 채널 상태 정보 피드백 동작을 예시하는 도면이다. 도 7b는 예를 들어, 사용자 장비에서 채널 상태 정보를 인코딩하기 위해 뉴럴 네트워크를 그리고 채널 상태 정 보를 프리코더로 디코딩하기 위해 기지국에서 뉴럴 네트워크를 사용하는 예시적인 인공 지능 아키텍처를 예시하 는 도면이다. 도 8은 8×8 교차 편파 안테나 엘리먼트들을 갖는 안테나 아키텍처에 대한 예시적인 공간 상관관계를 예시하는 도면이다. 도 9는 4×16 교차 편파 안테나 엘리먼트들을 갖는 안테나 아키텍처에 대한 예시적인 공간 상관관계를 예시하는 도면이다. 도 10은 4×16 교차 편파 안테나 엘리먼트들을 갖는 안테나 아키텍처에 대한 다른 예시적인 공간 상관관계를 예 시하는 도면이다. 도 11은 커버 코드 구성(cover-code configuration)을 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널 링 흐름도이다. 도 12는 커버 코드와 연관된 머신 학습 모듈을 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름 도이다. 도 13은 준 공동위치(quasi co-location, QCL) 정보를 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널 링 흐름도이다. 도 14는 기지국과 연관된 머신 학습 모듈들에 대한 분포 내 구성(in-distribution configuration)을 통해 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름도이다. 도 15는 다수의 기지국들과 연관된 머신 학습 모듈들에 대한 분포 내 구성을 통해 송신 공간 정보를 표시하는 다른 예를 예시하는 시그널링 흐름도이다. 도 16은 송신 공간 정보를 표시하는 일례를 예시하는 시그널링 흐름도이다. 도 17은 예측 모델이 채널 추정 및/또는 채널 상태 정보 생성을 위해 사용되는 예시적인 네트워크화된 환경을 예시한다. 도 18은 예를 들어, 사용자 장비에 의한 무선 통신을 위한 예시적인 동작들을 예시하는 흐름도이다. 도 19는 예를 들어, 네트워크 엔티티에 의한 무선 통신을 위한 예시적인 동작들을 예시하는 흐름도이다. 도 20은 예시적인 통신 디바이스의 양태들을 도시한다. 도 21은 예시적인 통신 디바이스의 양태들을 도시한다."}
