{"patent_id": "10-2020-0047249", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0129377", "출원번호": "10-2020-0047249", "발명의 명칭": "플레이어와 연결된 보상 수단을 통해 보상을 제공하는 방법, 시스템, 및 컴퓨터 프로그램", "출원인": "라인플러스 주식회사", "발명자": "유형준"}}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨터 시스템에서 실행되는 보상 제공 방법에 있어서,상기 컴퓨터 시스템은 메모리에 포함된 컴퓨터 판독가능한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고,상기 보상 제공 방법은,상기 적어도 하나의 프로세서에 의해, 사용자의 전자 기기에 설치된 플레이어에 상기 사용자에 의해 등록된 복수 개의 보상 수단을 연결하는 단계;상기 적어도 하나의 프로세서에 의해, 상기 플레이어를 통한 컨텐츠 재생과 관련된 정보에 대한 분석 결과를 결정하는 단계; 및상기 적어도 하나의 프로세서에 의해, 분석 결과를 기초로 상기 복수 개의 보상 수단 중 상기 분석 결과에 대응되는 보상 수단을 통해 상기 컨텐츠 재생에 대한 보상을 제공하는 단계를 포함하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 연결하는 단계는,상기 플레이어 상에 상기 복수 개의 보상 수단을 등록하기 위한 UI를 표시하는 단계를 포함하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 연결하는 단계는,상기 복수 개의 보상 수단에 대해 용도 별 또는 컨텐츠 종류 별로 사용하기 위한 보상 수단을 설정하는 단계를 포함하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제공하는 단계는,상기 플레이어를 통해 재생된 컨텐츠의 종류를 기초로 상기 복수 개의 보상 수단 중 어느 하나의 보상 수단을통해 상기 보상을 제공하는 것을 특징으로 하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제공하는 단계는,상기 플레이어를 통해 재생된 컨텐츠의 메타 데이터를 분석한 결과를 기초로 상기 복수 개의 보상 수단 중 어느하나의 보상 수단을 통해 상기 보상을 제공하는 것공개특허 10-2021-0129377-2-을 특징으로 하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 보상 제공 방법은,상기 적어도 하나의 프로세서에 의해, 상기 플레이어를 통해 재생 가능한 컨텐츠를 발행하는 컨텐츠 제공자(content provider)를 대상으로 구매를 통한 포인트를 제공하는 단계를 더 포함하고,상기 제공하는 단계는,상기 플레이어를 통해 재생되는 컨텐츠에 대해 해당 컨텐츠 제공자가 구매한 포인트를 소비하여 상기 보상을 제공하는 것을 특징으로 하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 보상 제공 방법은,상기 적어도 하나의 프로세서에 의해, 상기 보상을 상기 컴퓨터 시스템과 관련된 플랫폼 내에서의 통화로 사용하는 단계를 더 포함하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 사용하는 단계는,상기 보상 중 적어도 일부를 상기 플랫폼에 참여하는 크리에이터(creator)로 전달하거나 상기 플랫폼 내에서의상품 구매를 위한 통화로 사용하는 것을 특징으로 하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 보상 제공 방법은,상기 적어도 하나의 프로세서에 의해, 상기 보상으로 제공받은 포인트에 따라 상기 사용자에게 상기 컴퓨터 시스템과 관련된 플랫폼에 참여하는 크리에이터로서 참여 가능한 권한을 부여하는 단계를 더 포함하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 보상 제공 방법은,상기 적어도 하나의 프로세서에 의해, 상기 사용자가 컨텐츠 시청을 원하는 타겟에 해당되는 경우 상기 분석 결과를 기초로 상기 사용자의 관심에 대응되는 컨텐츠를 제공하는 단계를 더 포함하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2021-0129377-3-제1항에 있어서,상기 전자 기기에 서브 프로그램으로서 상기 플레이어를 통한 컨텐츠 재생에 대해 보상을 제공하는 기능을 포함하는 SDK(software development kit)가 설치되고,상기 제공하는 단계는,상기 플레이어를 통해 컨텐츠가 재생되는 경우 상기 SDK에 의해 상기 복수 개의 보상 수단 중 적어도 하나를 통해 보상을 제공하는 것을 특징으로 하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 플레이어를 통해 제1 컨텐츠 플랫폼에 의해 제공되는 제1 컨텐츠가 재생되고,상기 플레이어를 통해 제2 컨텐츠 플랫폼에 의해 제공되는 제2 컨텐츠가 재생되고,상기 제공하는 단계는,상기 제2 컨텐츠의 재생에 대해, 상기 제1 컨텐츠가 재생됨에 따라 제공되는 보상과 동일한 보상 수단을 통해보상을 제공하는 것을 특징으로 하는 보상 제공 방법."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제12항 중 어느 한 항의 보상 제공 방법을 상기 컴퓨터 시스템에 실행시키기 위해 비-일시적인 컴퓨터 판독가능한 기록 매체에 저장되는 컴퓨터 프로그램."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨터 시스템에 있어서,메모리에 포함된 컴퓨터 판독 가능한 명령을 실행하도록 구현되는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는,사용자의 전자 기기에 설치된 플레이어에 상기 사용자에 의해 등록된 복수 개의 보상 수단을 연결하는 지갑 연결부;상기 플레이어를 통한 컨텐츠 재생과 관련된 정보에 대한 분석 결과를 결정하는 정보 결정부; 및분석 결과를 기초로 상기 복수 개의 보상 수단 중 상기 분석 결과에 대응되는 보상 수단을 통해 상기 컨텐츠 재생에 대한 보상을 제공하는 보상 제공부를 포함하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 지갑 연결부는,상기 플레이어 상에 상기 복수 개의 보상 수단을 등록하기 위한 UI를 표시하는 것을 특징으로 하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,공개특허 10-2021-0129377-4-상기 지갑 연결부는,상기 복수 개의 보상 수단에 대해 용도 별 또는 컨텐츠 종류 별로 사용하기 위한 보상 수단을 설정하는 것을 특징으로 하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에 있어서,상기 보상 제공부는,상기 플레이어를 통해 재생된 컨텐츠의 메타 데이터를 분석한 결과를 기초로 상기 복수 개의 보상 수단 중 어느하나의 보상 수단을 통해 상기 보상을 제공하는 것을 특징으로 하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제14항에 있어서,상기 적어도 하나의 프로세서는,상기 플레이어를 통해 재생 가능한 컨텐츠를 발행하는 컨텐츠 제공자를 대상으로 구매를 통한 포인트를 제공하고,상기 보상 제공부는,상기 플레이어를 통해 재생되는 컨텐츠에 대해 해당 컨텐츠 제공자가 구매한 포인트를 소비하여 상기 보상을 제공하는 것을 특징으로 하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에 있어서,상기 적어도 하나의 프로세서는,상기 보상을 상기 컴퓨터 시스템과 관련된 플랫폼 내에서의 통화로 사용하되 상기 보상 중 적어도 일부를 상기플랫폼에 참여하는 크리에이터로 전달하거나 상기 플랫폼 내에서의 상품 구매를 위한 통화로 사용하는 것을 특징으로 하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14항에 있어서,상기 전자 기기에 서브 프로그램으로서 상기 플레이어를 통한 컨텐츠 재생에 대해 보상을 제공하는 기능을 포함하는 SDK가 설치되고,상기 보상 제공부는,상기 플레이어를 통해 컨텐츠가 재생되는 경우 상기 SDK에 의해 상기 복수 개의 보상 수단 중 적어도 하나를 보상을 제공하는 것을 특징으로 하는 컴퓨터 시스템."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "플레이어와 연결된 보상 수단을 통해 보상을 제공하는 방법, 시스템, 및 컴퓨터 프로그램이 개시된다. 보상 제 공 방법은, 사용자의 전자 기기에 설치된 플레이어에 상기 사용자에 의해 등록된 복수 개의 보상 수단을 연결하 는 단계; 상기 플레이어를 통한 컨텐츠 재생과 관련된 정보에 대한 분석 결과를 결정하는 단계; 및 분석 결과를 기초로 상기 복수 개의 보상 수단 중 상기 분석 결과에 대응되는 보상 수단을 통해 상기 컨텐츠 재생에 대한 보 상을 제공하는 단계를 포함한다."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 설명은 컨텐츠 소비에 대한 보상을 제공하는 기술에 관한 것이다."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "초고속 통신망 이용자의 급격한 증가는 통신망을 통한 다양한 서비스의 개발 및 서비스 아이템의 다양화를 가능 하게 한다. 현재 대부분의 서비스들은 광고를 기반으로 수익을 내고 이러한 수익을 토대로 사용자에게 더 나은 서비스를 제 공하고 있다. 광고를 제공하는 기술의 일례로, 한국 공개특허공보 제10-2016-0004227호(공개일 2016년 01월 12일)에는 동영상 을 이용하여 광고를 제공하는 기술이 개시되어 있다. 광고를 제공하는 기술은 웹이 등장한 이후로 획기적인 발전 없이 여전히 1차원적으로 작동하고 있다. 이에 따 라, 사용자들은 싫증을 느끼고 서비스를 이탈하거나 인내심을 갖고 광고를 보며 자신에게 도움이 되는 서비스를 사용하고자 한다. 언론사나 미디어 매체는 사용자의 관심을 끌기 위해서 충격적이거나 자극적인 단어를 남발하면서 광고 클릭을 유도하고 있으며, 크리에이터(creator)가 자신의 컨텐츠를 보도록 유도하고 컨텐츠 재생 구간의 광고를 보도록 하기 위해서 자극적인 제목이나 썸네일을 만들어서 재생을 유도하기도 한다. 이와 같이 사용자의 관심을 끌기 위해서 비효율적인 광고 타겟팅 혹은 광고 노출 유도는 사용자에게 피로감만 주고 있다. 또한, 광고를 집행하는 광고주 또한 제대로 된 광고 타겟팅이 점점 더 어려워 지고 있으며, 서비스 운영에 참여하는 크리에이터 또는 퍼블리셔(publisher) 입장에서도 수익 창출을 위해서 비효율적인 방식으로 사 용자에게 컨텐츠를 소비하도록 강요하고 있다. 최근에는 기계 학습이나 인공지능(AI)을 통해서 광고 타겟팅을 높이고자 하는 노력을 하고 있지만, 근본적인 광 고의 패러다임은 여전히 1차원적인 구조에 머물러 있고 이를 해결하기 위해서는 서로에게 이득이 되는 경제적인 구조를 각자의 관심을 기반으로 제공될 필요가 있다."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "사용자의 관심을 기반으로 컨텐츠를 제공할 수 있고 사용자뿐만 아니라 플랫폼의 모든 참여자에게 사용자의 컨 텐츠 소비에 대한 보상을 제공할 수 있다. 사용자가 컨텐츠 소비를 통해 얻은 보상을 플랫폼 내에서 기부(donation) 또는 통화로서 사용할 수 있어 플랫폼 에 지속적인 참여를 유도할 수 있다. 사용자의 전자 기기에 설치된 플레이어에 컨텐츠 소비에 대한 보상을 받기 위한 복수의 보상 수단을 연결할 수 있다. 플레이어에 연결된 복수의 보상 수단 중 사용자가 소비한 컨텐츠의 메타 데이터를 기반으로 특정된 보상 수단으 로 보상을 제공할 수 있다. 사용자의 전자 기기에 보상을 위한 서브 프로그램을 설치하여 서로 다른 플랫폼의 컨텐츠에 대해 동일한 보상 수단을 이용하여 보상을 제공할 수 있다."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "컴퓨터 시스템에서 실행되는 보상 제공 방법에 있어서, 상기 컴퓨터 시스템은 메모리에 포함된 컴퓨터 판독가능 한 명령들을 실행하도록 구성된 적어도 하나의 프로세서를 포함하고, 상기 보상 제공 방법은, 상기 적어도 하나 의 프로세서에 의해, 사용자의 전자 기기에 설치된 플레이어에 상기 사용자에 의해 등록된 복수 개의 보상 수단 을 연결하는 단계; 상기 적어도 하나의 프로세서에 의해, 상기 플레이어를 통한 컨텐츠 재생과 관련된 정보에 대한 분석 결과를 결정하는 단계; 및 상기 적어도 하나의 프로세서에 의해, 분석 결과를 기초로 상기 복수 개의 보상 수단 중 상기 분석 결과에 대응되는 보상 수단을 통해 상기 컨텐츠 재생에 대한 보상을 제공하는 단계를 포함하는 보상 제공 방법을 제공한다. 일 측면에 따르면, 상기 연결하는 단계는, 상기 플레이어 상에 상기 복수 개의 보상 수단을 등록하기 위한 UI를 표시하는 단계를 포함할 수 있다. 다른 측면에 따르면, 상기 연결하는 단계는, 상기 복수 개의 보상 수단에 대해 용도 별 또는 컨텐츠 종류 별로 사용하기 위한 보상 수단을 설정하는 단계를 포함할 수 있다. 또 다른 측면에 따르면, 상기 제공하는 단계는, 상기 플레이어를 통해 재생된 컨텐츠의 종류를 기초로 상기 복 수 개의 보상 수단 중 어느 하나의 보상 수단을 통해 상기 보상을 제공할 수 있다. 또 다른 측면에 따르면, 상기 제공하는 단계는, 상기 플레이어를 통해 재생된 컨텐츠의 메타 데이터를 분석한 결과를 기초로 상기 복수 개의 보상 수단 중 어느 하나의 보상 수단을 통해 상기 보상을 제공할 수 있다. 또 다른 측면에 따르면, 상기 보상 제공 방법은, 상기 적어도 하나의 프로세서에 의해, 상기 플레이어를 통해 재생 가능한 컨텐츠를 발행하는 컨텐츠 제공자(content provider)를 대상으로 구매를 통한 포인트를 제공하는 단계를 더 포함하고, 상기 제공하는 단계는, 상기 플레이어를 통해 재생되는 컨텐츠에 대해 해당 컨텐츠 제공자 가 구매한 포인트를 소비하여 상기 보상을 제공할 수 있다. 또 다른 측면에 따르면, 상기 보상 제공 방법은, 상기 적어도 하나의 프로세서에 의해, 상기 보상을 상기 컴퓨 터 시스템과 관련된 플랫폼 내에서의 통화로 사용하는 단계를 더 포함할 수 있다. 또 다른 측면에 따르면, 상기 사용하는 단계는, 상기 보상 중 적어도 일부를 상기 플랫폼에 참여하는 크리에이 터(creator)로 전달하거나 상기 플랫폼 내에서의 상품 구매를 위한 통화로 사용할 수 있다. 또 다른 측면에 따르면, 상기 보상 제공 방법은, 상기 적어도 하나의 프로세서에 의해, 상기 보상으로 제공받은 포인트에 따라 상기 사용자에게 상기 컴퓨터 시스템과 관련된 플랫폼에 참여하는 크리에이터로서 참여 가능한 권한을 부여하는 단계를 더 포함할 수 있다. 또 다른 측면에 따르면, 상기 보상 제공 방법은, 상기 적어도 하나의 프로세서에 의해, 상기 사용자가 컨텐츠 시청을 원하는 타겟에 해당되는 경우 상기 분석 결과를 기초로 상기 사용자의 관심에 대응되는 컨텐츠를 제공하 는 단계를 더 포함할 수 있다. 또 다른 측면에 따르면, 상기 전자 기기에 서브 프로그램으로서 상기 플레이어를 통한 컨텐츠 재생에 대해 보상 을 제공하는 기능을 포함하는 SDK(software development kit)가 설치되고, 상기 제공하는 단계는, 상기 플레이 어를 통해 컨텐츠가 재생되는 경우 상기 SDK에 의해 상기 복수 개의 보상 수단 중 적어도 하나를 통해 보상을 제공할 수 있다. 또 다른 측면에 따르면, 상기 플레이어를 통해 제1 컨텐츠 플랫폼에 의해 제공되는 제1 컨텐츠가 재생되고, 상 기 플레이어를 통해 제2 컨텐츠 플랫폼에 의해 제공되는 제2 컨텐츠가 재생되고, 상기 제공하는 단계는, 상기 제2 컨텐츠의 재생에 대해, 상기 제1 컨텐츠가 재생됨에 따라 제공되는 보상과 동일한 보상 수단을 통해 보상을 제공할 수 있다. 상기 보상 제공 방법을 상기 컴퓨터 시스템에 실행시키기 위해 비-일시적인 컴퓨터 판독가능한 기록 매체에 저 장되는 컴퓨터 프로그램을 제공한다. 컴퓨터 시스템에 있어서, 메모리에 포함된 컴퓨터 판독 가능한 명령을 실행하도록 구현되는 적어도 하나의 프로 세서를 포함하고, 상기 적어도 하나의 프로세서는, 사용자의 전자 기기에 설치된 플레이어에 상기 사용자에 의 해 등록된 복수 개의 보상 수단을 연결하는 지갑 연결부; 상기 플레이어를 통한 컨텐츠 재생과 관련된 정보에 대한 분석 결과를 결정하는 정보 결정부; 및 분석 결과를 기초로 상기 복수 개의 보상 수단 중 상기 분석 결과 에 대응되는 보상 수단을 통해 상기 컨텐츠 재생에 대한 보상을 제공하는 보상 제공부를 포함하는 컴퓨터 시스 템을 제공한다."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 본 발명의 실시예들은 플레이어와 연결된 보상 수단을 통해 컨텐츠 소비에 대한 보상을 제공하는 기술에 관한 것이다. 본 명세서에서 구체적으로 개시되는 것들을 포함하는 실시예들은 사용자의 전자 기기에 설치된 플레이어에 보상 을 받기 위한 복수 개의 보상 수단을 연결할 수 있고 복수 개의 보상 수단 중 하나로 컨텐츠 소비에 대한 보상 을 제공할 수 있다. 본 명세서에서 컨텐츠는 광고와 같은 정보 데이터는 물론, 영화 정보, 뉴스, 동영상, 이미지, 커뮤니티 게시물 등 인터넷이나 컴퓨터 통신 등을 통하여 제공 가능한 모든 정보 데이터를 의미할 수 있다. 동영상의 경우 녹화 영상은 물론이고, 플레이어를 통한 스트리밍 영상을 포함할 수 있다. 다시 말해, 컨텐츠는 각종 광고 모델이 나 검색 엔진 등을 통해 사용자에게 제공 가능한 모든 대상이 포함될 수 있다. 이하에서는 컨텐츠의 일실시예로서 광고에 대하여 설명하고 있으나 이러한 것으로만 한정되지 않으며, 앞서 설 명한 바와 같이 플레이어에 삽입되는 컨텐츠 등을 포함하여 인터넷이나 컴퓨터 통신 등을 통하여 사용자에게 제 공 가능한 모든 컨텐츠를 적용할 수 있다. 그리고, 보상 수단은 컨텐츠 소비에 대한 보상을 사용자가 받기 위한 사용자 계좌로서 사용자의 전자 기기에 설 치된 컨텐츠 재생 수단인 플레이어와 연결되는 가상의 지갑(wallet)을 의미할 수 있다. 도 1은 본 발명의 일실시예에 있어서, 컨텐츠 제공 환경의 예를 설명하기 위한 도면이다. 이때, 도 1은 컨텐츠 제공자, 플랫폼, 퍼블리셔 및 사용자를 나타내고 있다. 여기서, 컨텐츠 제공자와 사 용자는 실질적으로는 컨텐츠 제공자나 사용자가 이용하는 PC나 스마트폰 등의 전자 기기를 의미 할 수 있다. 즉, 도 1에서 컨텐츠 제공자, 플랫폼, 퍼블리셔 및 사용자 간에 나타난 화살 표들은 컨텐츠 제공자가 이용하는 전자 기기, 플랫폼, 퍼블리셔 및 사용자가 이용하는 전 자 기기 간에 유무선 네트워크를 이용하여 데이터가 송수신될 수 있음을 의미할 수 있다. 플랫폼은 컨텐츠 제공자의 정보 데이터로서 제공되는 컨텐츠에 대한 입찰, 컨텐츠를 제공할 사용자에 대한 타겟팅 요소 간의 매칭, 컨텐츠의 정렬, 퍼블리셔로의 컨텐츠 제공 및 컨텐츠의 노출에 따른 컨텐츠 제공자로의 과금 등을 수행하는 시스템을 의미할 수 있다. 본 명세서에서 \"퍼블리셔\"라는 용어는 \"사이트\"라는 용어로 치환되어 사용될 수 있다. 다만, 사이트라는 용어 를 사용한 설명이, 전자 기기에서 실행되는 어플리케이션 화면 등, 일반적인 PC의 웹 사이트 접속이 아닌 환경 에서의 본 발명의 실시 가능성을 배제하는 것은 아니다. 역으로, \"사이트\"라는 용어는 퍼블리싱 사이트 또는 상술한 \"퍼블리셔\"라는 용어로 호환되어 사용될 수 있다. 다시 말해, 각각의 사이트는 퍼블리셔가 포함하 는 개별 퍼블리셔들(제1 퍼블리셔, 제2 퍼블리셔, ...)에 대응될 수 있다. 여기서 개별 퍼블리셔들 각각은 하 나 이상의 퍼블리셔 서버들로 구현될 수 있다. 이때, \"사이트\"라는 용어는 컨텐츠의 노출이 가능하고 유선 네 트워크 또는 무선 네트워크를 통해 사용자에게 제공 가능한 모든 종류의 웹 사이트를 포함할 수 있으며, 웹 사이트를 구성하는 하나의 웹 페이지를 의미할 수도 있다. 또한, 본 명세서에서 컨텐츠의 \"노출\"은 퍼블리셔를 통해 컨텐츠 제공자와 연관된 홍보성 컨텐츠, 즉 정보 데이터가 해당 사이트의 방문자에게 제공되는 것을 포함하도록 해석될 수 있다. 퍼블리셔는 자신의 사이트를 통해 제공하기 위한 컨텐츠들을 플랫폼으로부터 전송 받아 사용자 에게 제공할 수 있다. 예를 들어, 퍼블리셔는 사용자가 소비하는 비디오나 오디오, 사용자가 입력한 검색 질의나 메신저 등의 대화 데이터에 포함된 키워드, 혹은 다른 행동 분석 결과 등에 대응하는 부가 컨텐츠로서 정보 데이터를 플랫폼으로부터 전달 받아 사용자에게 제공할 수 있다. 이와 같이, 퍼블리셔는 사용자가 컨텐츠를 직접 제공 받는 경로를 제공할 수 있으며, 일반적인 온라 인 환경에서 컨텐츠들은 웹/모바일 사이트를 통해 제공될 수 있다. 여기서, 플랫폼이 포함하는 복수의 개 별 플랫폼들(제1 플랫폼, 제2 플랫폼, ...) 각각은 퍼블리셔가 포함하는 복수의 개별 퍼블리셔들(제1 퍼블리셔, 제2 퍼블리셔, ...) 중 적어도 하나의 개별 퍼블리셔를 통해 컨텐츠를 노출할 수 있다. 여기서 개별 플 랫폼들 각각은 하나 이상의 플랫폼 서버들로 구현될 수 있다. 도 1에서 파일 배포 시스템은 필요에 따라 선택적으로 이용될 수 있다. 예를 들어, 사용자가 전자 기기를 이용하는 경우, 파일 배포 시스템은 퍼블리셔와 연관된 어플리케이션을 전자 기기에 설치하기 위한 파일을 사용자에게 제공할 수 있다. 이를 위해, 파일 배포 시스템은 상술한 파일을 저장 및 유 지하는 파일 관리부와 사용자의 전자 기기의 요청에 따라 전자 기기로 상술한 파일을 전송하는 파일 전송 부를 포함할 수 있다. 전송된 파일을 이용하여 전자 기기에 어플리케이션이 설치될 수 있으며, 어플리케이션은 전자 기기가 본 발명의 일실시예에 따른 컨텐츠 제공을 위한 단계들을 수행하도록 전자 기기를 제어할 수 있다. 본 발명의 실시예에서는 도 1을 통해 설명한 컨텐츠 제공 환경을 적용할 수 있으며, 이때 플랫폼의 사업자 는 컨텐츠 제공자의 컨텐츠인 정보 데이터, 컨텐츠 별 키워드나 카테고리, 컨텐츠가 제공될 타겟팅 대상 (연령, 성별, 관심분야 등) 등을 컨텐츠 제공자가 선택 또는 입력할 수 있도록 플랫폼을 설계할 수 있다. 이에, 컨텐츠 제공자는 플랫폼으로 컨텐츠를 업로드 하고 비딩(bidding) 함으로써 플랫폼 상에 자신의 컨텐츠를 등록할 수 있다. 사용자가 이용하는 전자 기기에는 퍼블리셔와 연관된 프로그램이 설치될 수 있다. 예를 들어, 프로 그램은 어플리케이션의 형태 또는 플러그 인(plug-in) 형태로 사용자의 전자 기기에 설치될 수 있고, 퍼블 리셔에서 제공하는 정보가 출력되도록 사용자의 전자 기기이나 사용자의 전자 기기에 설치된 웹 브라우저를 제어할 수 있다. 도 2는 본 발명의 일실시예에 있어서 컴퓨터 시스템의 내부 구성의 일례를 설명하기 위한 블록도이다. 예를 들 어, 본 발명의 실시예들에 따른 컨텐츠 제공 시스템이 도 2의 컴퓨터 시스템을 통해 구현될 수 있다. 본 발명의 실시예들에서 설명하는 컨텐츠 제공 시스템은 실시예에 따라 도 1을 통해 상기에서 설명한 복수의 개별 플랫폼들 중 하나의 플랫폼을 구성하는 컴퓨터 시스템일 수 있다. 도 2에 도시한 바와 같이, 컴퓨터 시스템은 컨텐츠 제공 방법을 실행하기 위한 구성요소로서 프로세서 , 메모리, 영구 저장 장치, 버스, 입출력 인터페이스 및 네트워크 인터페이스를 포함할 수 있다. 프로세서는 명령어들의 시퀀스를 처리할 수 있는 임의의 장치를 포함하거나 그의 일부일 수 있다. 프로세 서는 예를 들어 컴퓨터 프로세서, 이동 장치 또는 다른 전자 장치 내의 프로세서 및/또는 디지털 프로세서 를 포함할 수 있다. 프로세서는 예를 들어, 서버 컴퓨팅 디바이스, 서버 컴퓨터, 일련의 서버 컴퓨터들, 서버 팜, 클라우드 컴퓨터, 컨텐츠 플랫폼, 이동 컴퓨팅 장치, 스마트폰, 태블릿, 셋톱 박스 등에 포함될 수 있 다. 프로세서는 버스를 통해 메모리에 접속될 수 있다. 메모리는 컴퓨터 시스템에 의해 사용되거나 그에 의해 출력되는 정보를 저장하기 위한 휘발성 메모리, 영구, 가상 또는 기타 메모리를 포함할 수 있다. 메모리는 예를 들어 랜덤 액세스 메모리(RAM: random access memory) 및/또는 동적 RAM(DRAM: dynamic RAM)을 포함할 수 있다. 메모리는 컴퓨터 시스 템의 상태 정보와 같은 임의의 정보를 저장하는 데 사용될 수 있다. 메모리는 예를 들어 컨텐츠 제 공을 위한 명령어들을 포함하는 컴퓨터 시스템의 명령어들을 저장하는 데에도 사용될 수 있다. 컴퓨터 시 스템은 필요에 따라 또는 적절한 경우에 하나 이상의 프로세서를 포함할 수 있다. 버스는 컴퓨터 시스템의 다양한 컴포넌트들 사이의 상호작용을 가능하게 하는 통신 기반 구조를 포함 할 수 있다. 버스는 컴퓨터 시스템의 컴포넌트들 사이에, 예를 들어 프로세서와 메모리 사이에 데이터를 운반할 수 있다. 버스는 컴퓨터 시스템의 컴포넌트들 간의 무선 및/또는 유선 통신 매체를 포함할 수 있으며, 병렬, 직렬 또는 다른 토폴로지 배열들을 포함할 수 있다. 영구 저장 장치는 (예를 들어, 메모리에 비해) 소정의 연장된 기간 동안 데이터를 저장하기 위해 컴 퓨터 시스템에 의해 사용되는 바와 같은 메모리 또는 다른 영구 저장 장치와 같은 컴포넌트들을 포함할 수 있다. 영구 저장 장치는 컴퓨터 시스템 내의 프로세서에 의해 사용되는 바와 같은 비휘발성 메 인 메모리를 포함할 수 있다. 영구 저장 장치는 예를 들어 플래시 메모리, 하드 디스크, 광 디스크 또는 다른 컴퓨터 판독 가능 매체를 포함할 수 있다. 입출력 인터페이스는 키보드, 마우스, 음성 명령 입력, 디스플레이 또는 다른 입력 또는 출력 장치에 대한 인터페이스들을 포함할 수 있다. 구성 명령들 및/또는 컨텐츠 제공과 관련된 입력이 입출력 인터페이스를통해 수신될 수 있다. 네트워크 인터페이스는 근거리 네트워크 또는 인터넷과 같은 네트워크들에 대한 하나 이상의 인터페이스를 포함할 수 있다. 네트워크 인터페이스는 유선 또는 무선 접속들에 대한 인터페이스들을 포함할 수 있다. 구성 명령들은 및/또는 컨텐츠 제공과 관련된 정보들은 네트워크 인터페이스를 통해 수신 또는 송신될 수 있다. 또한, 다른 실시예들에서 컴퓨터 시스템은 도 2의 구성요소들보다 더 많은 구성요소들을 포함할 수도 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 예를 들어, 컴퓨터 시스템 은 상술한 입출력 인터페이스와 연결되는 입출력 장치들 중 적어도 일부를 포함하도록 구현되거나 또 는 트랜시버(transceiver), GPS(Global Positioning System) 모듈, 카메라, 각종 센서, 데이터베이스 등과 같 은 다른 구성요소들을 더 포함할 수도 있다. 도 3은 본 발명의 일실시예에 있어서 사용자 관심 기반 광고 아키텍처의 일례를 설명하기 위한 예시 도면이다. 컴퓨터 시스템은 컨텐츠 제공자인 광고주(도시 부호 110)가 퍼블리셔에 대해 지불한 광고료 에 대응하여 광고 발행 포인트를 제공할 수 있다. 광고주는 퍼블리셔로부터 광고 발행 포인트를 취 득(구매)할 수 있으며, 광고 발행 포인트의 소비를 통해 타겟팅 광고를 발행할 수 있다. 컴퓨터 시스템은 광고주가 발행한 광고를 사용자가 시청할 때마다 퍼블리셔뿐만 아니 라 해당 광고와 함께 노출되는 컨텐츠의 크리에이터에게 광고 발행 포인트의 일정 비율을 배분할 수 있다. 컴퓨터 시스템은 사용자의 광고 시청 여부에 따라 광고를 시청하기 원하는 사용자를 대상으 로 광고주가 발행한 광고를 제공할 수 있으며, 이때 사용자에게 광고 시청에 따른 보상으로서 사용자 가 광고를 시청한 시간 또는 특정한 조건에 따라 일정 통화의 포인트로 지급할 수 있다. 사용자는 광고 시청 여부를 직접 선택하여 선택적인 광고 시청을 주도할 수 있다. 컴퓨터 시스템은 사용자가 보유한 포인트로 플랫폼 내 부가가치의 활용을 지원할 수 있다. 컴퓨 터 시스템은 사용자의 포인트를 플랫폼 내에서 통화로 사용 가능한 환경을 제공하는 것으로, 일례로 플랫폼 내의 스티커나 상품 등을 구매하는 기능, 플랫폼에 참여하는 크리에이터에게 기부하는 기능 등을 제공할 수 있다. 또한, 컴퓨터 시스템은 사용자가 보유한 포인트에 따라 사용자에게 플랫폼 상 의 영상 소비자이면서 동시에 컨텐츠 크리에이터로서 참여 가능한 권한을 부여할 수 있다. 크리에이터 또 한 사용자의 광고 시청으로 인해 획득한 포인트를 플랫폼 내에서의 통화로 사용할 수 있다. 상기한 광고 구조는 사용자의 서비스 이탈을 줄일 수 있어 퍼블리셔에게 이득이 되고 사용자 또 한 경제적인 보상을 받을 수 있다. 사용자의 관심에 따라 작동하는 광고 아키텍처를 통해 새로운 부가가 치를 창출할 수 있으며, 사용자의 광고 시청을 통해 얻은 보상은 플랫폼 내에서 기부 또는 통화로서 사용 될 수 있다. 광고주는 광고 신청을 원하는 사용자를 대상으로 광고를 노출하므로 광고 효과를 증대 시킬 수 있으며, 광고의 집행이나 타겟팅을 명확히 할 수 있다. 광고 신청을 원하는 사용자를 타겟팅 대상에 포함시켜 사용자가 데이터 주권을 가지는 구조로 광고 시스템을 구축할 수 있고, 광고 시장 참여자들, 즉 광고주, 퍼블리셔, 사용자, 크리에이터(16 0)는 각자의 시장에 대한 수요 및 공급 불균형을 해결할 수 있어 광고 시스템의 선순환을 만들 수 있다. 이하에서는 플레이어와 연결된 보상 수단을 통해 보상을 제공하는 방법 및 시스템의 구체적인 실시예를 설명하 기로 한다. 도 4는 본 발명의 일실시예에 따른 컴퓨터 시스템의 프로세서가 포함할 수 있는 구성요소의 예를 도시한 블록도 이고, 도 5는 본 발명의 일실시예에 따른 컴퓨터 시스템이 수행할 수 있는 방법의 예를 도시한 흐름도이다. 컴퓨터 시스템의 프로세서는 도 5에 따른 보상 제공 방법을 수행하기 위한 구성요소로서 도 4에 도시 된 바와 같이, 지갑 연결부, 정보 결정부, 및 보상 제공부를 포함할 수 있다. 실시예에 따라 프로세서의 구성요소들은 선택적으로 프로세서에 포함되거나 제외될 수도 있다. 또한, 실시예에 따 라 프로세서의 구성요소들은 프로세서의 기능의 표현을 위해 분리 또는 병합될 수도 있다. 이러한 프로세서 및 프로세서의 구성요소들은 도 5의 보상 제공 방법이 포함하는 단계들(S510 내지 S530)을 수행하도록 컴퓨터 시스템을 제어할 수 있다. 예를 들어, 프로세서 및 프로세서의 구 성요소들은 메모리가 포함하는 운영체제의 코드와 적어도 하나의 프로그램의 코드에 따른 명령(instruction)을 실행하도록 구현될 수 있다. 여기서, 프로세서의 구성요소들은 컴퓨터 시스템에 저장된 프로그램 코드가 제공하는 명령에 따라 프 로세서에 의해 수행되는 서로 다른 기능들(different functions)의 표현들일 수 있다. 예를 들어, 컴퓨터 시스템이 플레이어에 지갑을 연결하도록 상술한 명령에 따라 컴퓨터 시스템을 제어하는 프로세서 의 기능적 표현으로서 지갑 연결부가 이용될 수 있다. 프로세서는 컴퓨터 시스템의 제어와 관련된 명령이 로딩된 메모리로부터 필요한 명령을 읽어들 일 수 있다. 이 경우, 상기 읽어들인 명령은 프로세서가 이후 설명될 보상 제공 방법을 실행하도록 제어 하기 위한 명령을 포함할 수 있다. 이후 설명될 보상 제공 방법은 도시된 순서와 다른 순서로 수행될 수 있으 며, 보상 제공 방법이 포함하는 단계들(S510 내지 S530) 중 일부가 생략되거나 추가의 과정이 더 포함될 수 있 다. 도 5를 참조하면, 단계(S510)에서 지갑 연결부는 사용자의 전자 기기에 설치된 플레이어와 사용자 보 상 수단(이하, '지갑'이라 칭함)을 연결할 수 있다. 지갑 연결부는 전자 기기에 설치된 플레이어와 연동 하여 전자 기기에서 플레이어가 실행되는 경우 플레이어 상에 사용자의 지갑을 등록하기 위한 UI(user interface)를 표시할 수 있다. 지갑 연결부는 지갑 등록 UI를 통해 사용자 요청을 수신한 후 사용자 요청 에 포함된 계좌 정보를 플레이어와 연결함으로써 플레이어 상에 지갑을 등록할 수 있다. 지갑 연결부는 사용자 별로 플레이어 상에 복수 개의 지갑을 등록하여 연결할 수 있고, 사용자 요청에 따라 플레이어 상 에 연결된 지갑 중 적어도 하나를 보상을 지급받기 위한 보상 수단으로 활성화할 수 있다. 지갑 연결부는 플레이어 상에 연결된 지갑 각각에 대하여 사용자에 의해 용도를 구분하여 설정할 수 있다. 사용자는 플레이어 상에 복수 개의 계좌를 연결하여 계좌 별 용도, 예를 들어 광고 시청에 대한 보 상을 받기 위한 계좌는 물론이고, 현금 인출용 계좌, 유료 컨텐츠 시청용 계좌, 기부용 계좌 등을 설정할 수 있 다. 지갑 연결부는 컨텐츠의 카테고리(종류)에 따라 지갑을 매칭하여 설정하는 것 또한 가능하다. 예를 들어, 플레이어 상에 계좌 A, B, C가 연결된 경우 공익 캠페인 영상에 대한 시청 보상 수단은 계좌 A, 일반 광 고 영상에 대한 시청 보상 수단은 계좌 B, 정보 전달 영상에 대한 시청 보상 수단은 계좌 C를 설정할 수 있다. 따라서, 지갑 연결부는 플레이어 상에 연결된 복수 개의 지갑을 용도 별 혹은 컨텐츠의 종류 별로 매칭하 여 설정할 수 있다. 단계(S520)에서 정보 결정부는 플레이어를 통해 컨텐츠, 예를 들어 광고 영상이 재생되면 전자 기기에서의 광고 재생과 관련된 정보(이하, '재생 정보'라 칭함)에 대한 분석 결과를 결정할 수 있다. 정보 결정부는 전자 기기로부터 수신된 재생 정보를 직접 분석하거나 혹은 전자 기기로부터 재생 정보에 대해 전자 기기에서 분석된 결과를 수신함으로써 재생 정보에 대한 분석 결과를 결정할 수 있다. 일례로, 사용자의 전자 기기는 플레이어를 통해 광고가 재생되면 재생된 광고를 구분하기 위한 식별자, 플 레이어를 통해 광고가 실제 재생된 시간 등을 포함하는 재생 정보를 플랫폼(즉, 정보 결정부)으로 제공할 수 있다. 이에, 정보 결정부는 전자 기기로부터 수신된 재생 정보를 기초로 사용자가 시청한 광고의 종류, 사용자의 광고 시청 시간 또는 사용자의 광고 시청이 사전에 정해진 특정 조건에 부합하는지 등을 분석할 수 있다. 정보 결정부는 플레이어를 통해 재생되는 광고 영상을 중심으로 전자 기기의 사용자가 어떤 정보에 관심이 있는지 분석할 수 있고, 이러한 분석 결과를 기초로 사용자를 대상으로 사용자의 관심에 대응 되는 광고를 적절히 배치할 수 있다. 또한, 정보 결정부는 전자 기기로부터 수신된 재생 정보 중 적어도 일부를 해당 광고와 관련된 컨텐츠 제공자와 크리에이터 중 적어도 하나의 참여자에게 전달할 수 있 고, 이때 컨텐츠 제공자와 크리에이터는 전달받은 정보를 바탕으로 사용자의 관심을 분석하여 분석 결과를 광고 타겟팅이나 컨텐츠 생성에 활용할 수 있다. 단계(S530)에서 보상 제공부는 사용자의 재생 정보를 분석한 결과를 기초로 광고 재생에 대한 보상을 플레이어와 연결된 지갑을 통해 제공할 수 있다. 보상 제공부는 플레이어를 통한 광고 재생과 관련된 정 보를 바탕으로 사용자의 광고 시청 시간 또는 사용자가 시청한 광고가 특정한 조건에 부합되는 경우 에 사용자에게 보상을 지급할 수 있다. 예를 들어, 보상 제공부는 사용자가 광고를 전체 재생 시간 대비 일정 시간 혹은 일정 비율 이상 시청한 경우에만 보상을 지급할 수 있다. 보상 제공부는 사용자의 재생 정보에 대한 분석 결과를 기초로 플레이어와 연결된 복수 개의 지갑 중 분석 결과에 대응되는 지갑을 통해 사용자의 광고 재생에 대한 보상을 제공할 수 있다. 일례로, 보상 제공부는 플레이어와 연결된 복수 개의 지갑 중 플레이어를 통해 재생된 광고의 종류에 대해 사전 매칭된 지 갑을 통해 사용자의 광고 재생에 대한 보상을 제공할 수 있다. 정보 결정부는 플레이어를 통해 재생 된 광고의 메타 데이터를 기반으로 해당 광고의 종류를 분석할 수 있으며, 이에 보상 제공부는 플레이어와 연결된 지갑 중에서 사용자가 시청한 광고의 종류에 매칭된 지갑으로 해당 광고 시청에 따른 보상을 지급 할 수 있다. 예를 들어, 플레이어를 통해 컨텐츠가 재생된 후 재생된 컨텐츠의 메타 데이터에 기초하여 컨텐츠 가 공익 캠페인 영상에 해당하는 것으로 판단되면 공익 캠페인 영상에 대한 시청 보상 수단인 계좌 A로 해당 컨 텐츠에 대한 보상을 지급할 수 있다. 보상 제공부는 사용자가 광고 시청으로 획득한 보상 중 적어도 일부에 해당되는 포인트를 기부 형태 로 해당 사용자로부터 선택된 크리에이터로 전달할 수 있다. 기부는 정기 기부 방식과 일시 기부 방 식을 포함할 수 있으며, 정기 방식은 포인트를 반복 주기(월 단위, 분기 단위 등)에 따라 자동 집계하여 일정 비율 혹은 일정 포인트를 사용자가 선택한 크리에이터에게 부여할 수 있고, 일시 방식은 사용자(14 0)가 원하는 시점에 사용자가 원하는 포인트를 부여할 수 있다. 보상 제공부는 사용자가 광고 시청으로 획득한 보상을 이용하여 기부 이외에 플랫폼 내의 스티커나 상품 등에 대한 구매 기능을 제공할 수 있다. 기부나 상품 구매 이외에 많은 서비스 성격에 따라 부가가치 창 출이 가능하고, 서비스 성격과 무관하게 플랫폼에서는 공통적으로 사용자의 관심을 기반으로 보상을 제공 하여 사용자의 관심을 지속화할 수 있다. 이러한 관심 기반 구조를 통해 사용자의 이탈을 줄임에 따라 플랫폼에 참여하는 크리에이터가 늘어날 수 있고, 광고 타겟팅을 원하는 광고주의 수요 또한 증가할 수 있다. 플랫폼 입장에서는 불필요한 광고 트래픽을 감당하지 않아도 되므로 비용을 절감할 수 있고 트래픽 또한 예측 범위 내에서 증가할 수 있다. 컴퓨터 시스템은 서로 다른 컨텐츠 제공자에 의해 제공되는 컨텐츠에 대해서도 동일한 보상 수단을 이용하여 보상을 제공할 수 있다. 사용자의 전자 기기에 설치된 플레이어는 컴퓨터 시스템과 연관된 어플리케이션일 수도 있고, 컴퓨터 시스템과 다른 별개의 플랫폼과 연관된 어플리케이션일 수도 있다. 동일한 보상 수단을 이용하기 위해서는 사용자의 전자 기기에 컨텐츠 재생에 대한 보상을 제공하기 위한 서브 프로그램이 설치될 수 있다. 도 6을 참조하면, 사용자의 전자 기기에 설치된 플레이어 어플리케이션 이 컴퓨터 시스템의 플랫폼과 무관한 다른 플랫폼과 연관된 어플리케이션이더라도 컴퓨터 시스템 의 보상 기능을 포함하여 제작한 SDK(software development kit)가 설치된 상태에서 컴퓨터 시스템 과 다른 플랫폼에서 제공하는 컨텐츠를 재생하는 경우 동일한 보상 수단을 이용하여 컨텐츠 재생에 대한 보상을 제공할 수 있다. 일례로, SDK는 플러그 SDK 형태로 제공될 수 있으며 플레이어 어플리케이션 을 제작하는 과정에서 플러그 SDK를 이용하여 플레이어 어플리케이션에 인-앱(in-app) 형태로 구성하여 제 작할 수 있다. SDK가 설치된 플레이어 어플리케이션은 도 5를 통해 설명한 보상 기능을 포함할 수 있 다. 예를 들어, SDK가 설치된 플레이어 어플리케이션을 통해 컨텐츠 플랫폼 Ⅰ에 의해 제공되는 컨텐츠 A 가 재생된 이후, 컨텐츠 플랫폼 Ⅱ에 의해 제공되는 컨텐츠 B가 재생된 경우, 컨텐츠 B의 재생에 대한 보상을 컨텐츠 A가 재생됨에 따라 제공되는 보상과 동일한 보상 수단을 통해 제공할 수 있다. 따라서, 사용자가 컴퓨터 시스템과 다른 플랫폼의 컨텐츠를 시청하더라도 플레이어 어플리케이션 에 SDK가 설치되어 있으면 SDK를 통해 컴퓨터 시스템과 연동하여 본 발명의 실시예들에 따른 보상 기능을 동일하게 구현할 수 있다. 도 7 내지 도 10은 본 발명의 일실시예에 있어서 플레이어와 지갑을 연결하는 과정의 구체적인 예시를 설명하기 위한 도면이다. 도 7을 참조하면, 플레이어 화면에는 플레이어 상에 지갑을 생성하거나 생성된 지갑을 관리하기 위한 지갑 UI가 포함될 수 있다. 프로세서는 사용자가 플레이어 화면에서 지갑 UI를 입력하는 경우 사용자에 의해 생성된 지갑 정보를 포함한 보상 정보 화면을 제공할 수 있다. 프로세서는 사용자의 지갑 생성 여부를 판단하여 사용자가 지갑이 생성되지 않은 상태에서 지갑 UI를 입력하는 경우, 도 7에 도시한 바와 같이 가입 화면을 우선 제공하여 사용자의 계정 정보 를 이용한 가입 및 지갑 생성을 유도할 수 있다. 한편, 프로세서는 사용자가 지갑이 생성된 상태에서 지갑 UI를 입력하는 경우, 도 8에 도시한 바와 같이 사용자에 의해 생성된 지갑 정보를 포함한 보상 정보 화면을 제공할 수 있다. 보상 정보 화면은 다수의 페이지를 포함할 수 있으며, 다수의 페이지 중 하나인 지갑 정보 화면에는 사용자 의 지갑과 관련하여 해당 지갑의 자산 관리 사이트로 이동하기 위한 '지갑 사이트 이동' UI, 컨텐츠 소비에 따른 보상을 받기 위한 지갑으로 설정된 기본 계좌 정보, 용도나 컨텐츠 종류 별 지갑으로 설정된 기타 계좌 목록 등이 포함될 수 있다. 사용자는 지갑 정보 화면을 통해 보상 수단으로 이용 가 능한 지갑의 계좌 정보를 확인할 수 있다. 예를 들어, 사용자는 광고 시청에 대한 보상을 받기 위한 계좌 는 물론이고, 현금 인출용 계좌, 유료 컨텐츠 시청용 계좌, 기부용 계좌 등을 확인할 수 있다. 이외에도, 사용 자는 광고 시청에 대한 보상을 광고의 종류에 따라 구별하여 지급받기 위해 광고의 종류 별로 설정된 보상 계좌를 확인할 수 있다. 도 9를 참조하면, 보상 정보 화면에는 사용자의 계정 정보를 수정하기 위한 계정 수정 화면이 포함될 수 있다. 사용자는 계정 수정 화면을 통해 사용자의 지갑과 관련된 계정 정보나 계좌 정보 등을 수정할 수 있다. 도 10을 참조하면, 보상 정보 화면에는 보상과 관련된 옵션 정보를 설정하기 위한 옵션 설정 화면이 포함될 수 있다. 옵션 설정 화면에는 플레이어를 이용한 광고 시청 여부를 설정하기 위한 '광고 시청 옵 션 설정' UI, 유료 영상 시청 시 결제 수단으로 이용할 지갑을 설정하기 위한 '유료 영상 시청 옵션' UI 등이 포함될 수 있다. 이외에도, 옵션 설정 화면은 플레이어에 연결된 복수 개의 지갑을 대상으 로 지갑 별 용도나 컨텐츠 종류 등을 설정하기 위한 인터페이스를 포함할 수 있다. 사용자는 옵션 설정 화면을 통해 광고 시청 여부는 물론이고, 유료 영상 시청용 계좌, 현금 인출용 계좌, 기부 전용 계좌 등을 설정할 수 있고, 더 나아가 용도나 컨텐츠의 종류 별로 복수 개의 지갑을 설정할 수 있다. 이처럼 본 발명의 실시예들에 따르면, 사용자의 관심을 기반으로 컨텐츠를 제공하고 사용자뿐만 아니라 플랫폼 의 모든 참여자에게 사용자의 컨텐츠 소비에 대한 보상을 제공함으로써 플랫폼 부가가치를 증대할 수 있다. 특 히, 본 발명의 실시예들에 따르면, 사용자의 전자 기기에 설치된 플레이어에 보상을 받기 위한 복수 개의 보상 수단을 연결할 수 있고, 복수 개의 보상 수단 중 하나로 컨텐츠 소비에 대한 보상을 제공할 수 있으며, 사용자 가 컨텐츠 소비를 통해 얻은 보상을 플랫폼 내에서 기부 또는 구매 가능한 통화로서 사용할 수 있어 플랫폼에 지속적인 참여를 유도할 수 있다. 또한, 본 발명의 실시예들에 따르면, 사용자의 전자 기기에 보상을 위한 서 브 프로그램을 설치하여 서로 다른 플랫폼의 컨텐츠에 대해 동일한 보상 수단을 이용하여 보상을 제공할 수 있 다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 프로세서, 콘트롤 러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 컴퓨 터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분 산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 이때, 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는다운로드를 위해 임시 저장하는 것일 수도 있다. 또한, 매체는 단일 또는 수 개의 하드웨어가 결합된 형태의 다양한 기록수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트 워크 상에 분산 존재하는 것일 수도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같 은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체의 예시로, 어플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어 를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다."}
{"patent_id": "10-2020-0047249", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2020-0047249", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 있어서 컨텐츠 제공 환경의 예를 설명하기 위한 도면이다. 도 2는 본 발명의 일실시예에 있어서 컴퓨터 시스템의 내부 구성의 일례를 설명하기 위한 블록도이다. 도 3은 본 발명의 일실시예에 있어서 사용자 관심 기반 광고 아키텍처의 일례를 설명하기 위한 예시 도면이다. 도 4는 본 발명의 일실시예에 따른 컴퓨터 시스템의 프로세서가 포함할 수 있는 구성요소의 예를 도시한 도면이 다. 도 5는 본 발명의 일실시예에 따른 컴퓨터 시스템이 수행할 수 있는 방법의 예를 도시한 순서도이다. 도 6은 본 발명의 일실시예에 있어서 SDK를 이용하여 서로 다른 플랫폼의 컨텐츠에 대해 보상을 제공하는 환경의 예를 설명하기 위한 도면이다. 도 7 내지 도 10은 본 발명의 일실시예에 있어서 플레이어와 지갑을 연결하는 과정의 구체적인 예시를 설명하기 위한 도면이다."}
