{"patent_id": "10-2022-0169384", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0085274", "출원번호": "10-2022-0169384", "발명의 명칭": "배전계통의 디지털 계전기 및 이에 따른 고저항 사고 판별 방법", "출원인": "한국철도기술연구원", "발명자": "박종영"}}
{"patent_id": "10-2022-0169384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "배전계통의 디지털 계전기에 있어서,고저항 고장 사고를 판별하는 프로그램이 저장된 메모리 및상기 프로그램을 실행하는 프로세서를 포함하되,상기 프로그램은 입력 데이터를 기초로 배전계통의 차단기(CB)의 동작을 조절하고, 고저항 고장 판별 모델에 기초하여 배전계통에 대한 보호 기능을 수행하고,상기 고저항 고장 판별 모델은 CNN 학습 네트워크에 고저항 사고 또는 부하증가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학습 데이터로서 사용하여 구축된 것으로서, 고저항 사고를분류하도록 학습된 것인, 계전기."}
{"patent_id": "10-2022-0169384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 프로그램은 상기 입력 데이터인 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 이미지 데이터를 생성하고, 상기 이미지 데이터를 상기 고저항 고장 판별 모델에 입력하여, 고저항 사고 여부를 분류하도록 하는 것인,계전기."}
{"patent_id": "10-2022-0169384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 프로그램은 상기 고저항 고장 판별 모델로부터 상기 이미지 데이터가 고저항 사고인 것으로 출력되면, 상기 배전계통의 차단기를 동작하는 것인, 계전기."}
{"patent_id": "10-2022-0169384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "배전계통의 디지털 계전기에 의해 수행되는 고저항 사고 판별 방법에 있어서,(a) 입력 데이터를 기초로 배전계통의 차단기(CB)의 동작을 조절하는 단계; 및(b) 고저항 고장 판별 모델에 기초하여 배전계통에 대한 보호 기능을 수행하는 단계를 포함하되,상기 고저항 고장 판별 모델은 CNN 학습 네트워크에 고저항 사고 또는 부하증가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학습 데이터로서 사용하여 구축된 것으로서, 고저항 사고를분류하도록 학습된 것인, 고저항 사고 판별 방법."}
{"patent_id": "10-2022-0169384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기(b) 단계는상기 입력 데이터인 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 이미지 데이터를 생성하고, 상기 이미지데이터를 상기 고저항 고장 판별 모델에 입력하여, 고저항 사고 여부를 분류하도록 하는 것인, 고저항 사고 판공개특허 10-2024-0085274-3-별 방법."}
{"patent_id": "10-2022-0169384", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기(b) 단계는상기 고저항 고장 판별 모델로부터 상기 이미지 데이터가 고저항 사고인 것으로 출력되면, 상기 배전계통의 차단기를 동작하는 것인, 고저항 사고 판별 방법."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 배전계통의 디지털 계전기는 고저항 고장 사고를 판별하는 프로그램이 저장된 메모 리 및 프로그램을 실행하는 프로세서를 포함하되, 프로그램은 입력 데이터를 기초로 배전계통의 차단기(CB)의 동 작을 조절하고, 고저항 고장 판별 모델에 기초하여 배전계통에 대한 보호 기능을 수행하고, 고저항 고장 판별 모 델은 CNN 학습 네트워크에 고저항 사고 또는 부하증가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학습 데이터로서 사용하여 구축된 것으로서, 고저항 사고를 분류하도록 학습된다."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 배전계통의 디지털 계전기 및 이에 따른 고저항 사고 판별 방법에 관한 것이다."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "배전계통 내 고저항 사고(High Resistance Fault, HRF)는 배전선이 어떠한 원인 때문에 자갈, 모래, 수목 등 저 항이 큰 물질에 접촉하여 발생하는 사고이며, 단선지락사고가 배전계통 사고의 70% 이상을 차지한다. 이에 따라 고저항 사고도 다른 사고처럼 신뢰성 있는 검출 및 제거가 필요하다. 그러나 고저항 사고는 사고전류 증가량이 부하 전류에 비해 크지 않으며, 아크로 부하와 유사한 특성을 보여서 사고 판정이 어렵다는 문제가 있다. 즉 기존의 일반적인 과전류 계전기 등을 이용하여 고저항 사고를 검출하는 것이 어려우며, 검출을 위해 고저항 사고의 비선형, 시변적인 특성을 활용한 기법들이 연구되고 있다. 이와 같이, 배전망에 분산전원의 적용이 늘어 나고 있는데, 분산전원이 있는 배전계통에서 고장 발생이 발생하면 고장 위치와 분산전원 위치의 관계에 따라 전류 방향 등 고장전류의 양상이 달라진다. 특히, 배전계통 피더의 고장은 정확하고 신속하게 감지되고 제거되 어야 고장의 확산을 방지할 수 있다. 이와 관련하여, 단선지락사고에 대한 여러 가지 보호기법들이 제안되고 있다. 크게 세 가지로 분류하면 1) 정상 상태 신호 기반 분석, 2) 과도상태 신호 기반 분석, 3) IT융합 기술 기반 분석이 있다. 이 중 앞의 두 가지 방 법은 계통 구조나 사고가 복잡한 상황에 대해 한계가 있다. 최근에는 IT기술이 발전함에 따라 뉴럴 네트워크, 서포트 벡터 머신 유전알고리즘, 전문가 시스템, 퍼지 이론 등이 단선지락사고 보호기법들에 적용되고 있다. 일 예로, k-최근접 알고리즘을 이용한 회귀분석을 적용하여 단 선지락사고의 위치를 판정한 연구가 보고되고 있다. 나아가, 웨이블릿 변환과 베이시안 기법을 이용하여 고장 피더를 판별한 연구, 인공신경망(Artificial Neural Network, ANN)을 이용하여 사고 피더와 건전 피더를 판별하 는 연구도 보고되고 있다. 한편 신재생 발전 등 분산전원 증가나 전력변환장치 도입 등으로 인해 배전계통이 더욱 복잡해짐에 따라, 사고 발생시 고장전류의 양상이 복잡해지고 있다. 이에 따라 고장신호 처리에 적절한 방법을 찾기가 어려워지고 있다. 특히 배전계통에서 자주 발생하는 고저항 단선지락사고는 그 특성 때문에 그 판별이 더욱 쉽지 않다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2022-0059058호(발명의 명칭: 폐루프 배전계통의 보호장치 및 인공지 능 장치)"}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위하여, 웨이블릿 변환과 CNN을 활용하여 고저항 지락사고를 판별하는 배 전계통의 디지털 계전기 및 이에 따른 고저항 사고 판별 방법을 제공하는 데에 목적이 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기 술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기 는 고저항 고장 사고를 판별하는 프로그램이 저장된 메모리 및 프로그램을 실행하는 프로세서를 포함하되, 프로 그램은 입력 데이터를 기초로 배전계통의 차단기(CB)의 동작을 조절하고, 고저항 고장 판별 모델에 기초하여 배 전계통에 대한 보호 기능을 수행하고, 고저항 고장 판별 모델은 CNN 학습 네트워크에 고저항 사고 또는 부하증 가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학습 데이터로서 사용하여 구축된 것으로서, 고저항 사고를 분류하도록 학습된다. 또한, 본 발명의 다른 일 실시예에 따른 배전계통의 디지털 계전기에 의해 수행되는 고저항 사고 판별 방법은 (a) 입력 데이터를 기초로 배전계통의 차단기(CB)의 동작을 조절하는 단계; 및 (b) 고저항 고장 판별 모델에 기 초하여 배전계통에 대한 보호 기능을 수행하는 단계를 포함하되, 고저항 고장 판별 모델은 CNN 학습 네트워크에 고저항 사고 또는 부하증가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학습 데이터로서 사용하여 구축된 것으로서, 고저항 사고를 분류하도록 학습된다."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단에 의하면, 배전계통의 디지털 계전기에 의해 다양한 배전계통의 구조나 사고 상황에 따라 달라지는 고저항 지락사고를 판별할 수 있다. 또한, 본 발명에 따른 디지털 계전기는 혼잡한 철도에서 실시간으로 열차운행을 통제하는 열차 관제 시스템의 내부 모듈로 활용이 가능하다."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 이하의 실시예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아니다. 따라서 본 발명과 동일한 기능을 수행하는 동일 범위의 발명 역시 본 발명의 권리 범위에 속할 것이다. 이하 첨부된 도면을 참고하여 본 발명의 일 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 구성을 보여주는 도면이다. 도 1을 참조하면, 디지털 계전기는 통신 모듈, 메모리, 프로세서 및 데이터베이스를 포함한다. 예시적으로, 통신 모듈은 통신망과 연동하여 디지털 계전기에 계측기로부터 측정된 전압과 전류의 시 계열 데이터를 송수신할 수 있는 통신 인터페이스를 제공한다. 여기서, 통신 모듈은 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신하기 위해 필요한 하드웨어 및 소프트웨 어를 포함하는 장치일 수 있다. 메모리는 고저항 고장 사고를 판별하는 프로그램이 기록된다. 또한, 프로세서가 처리하는 데이터를 일시적 또는 영구적으로 저장하는 기능을 수행한다. 여기서, 메모리는 휘발성 저장 매체(volatile storage media) 또는 비휘발성 저장 매체(non-volatile storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한 정되는 것은 아니다. 메모리에는 고저항 고장 사고를 판별하는 프로그램이 저장된다. 이러한 메모리에는 배전계통의 계전 기의 구동을 위한 운영 체제나 고저항 고장 사고를 판별하는 프로그램의 실행 과정에서 발생되는 여러 종 류가 데이터가 저장된다. 프로세서는 메모리에 저장된 프로그램을 실행하되, 고저항 고장 사고를 판별하는 프로그램의 실행에 따라 다음과 같은 처리를 수행한다. 프로세서는 입력 데이터를 기초로 배전계통의 차단기(CB)의 동작을 조절하고, 고저항 고장 판별 모델에 기 초하여 배전계통에 대한 보호 기능을 수행한다. 이러한 프로세서가 수행하는 각각의 동작에 대해서는 추후 보다 상세히 살펴보기로 한다. 여기서, 프로세서는 데이터를 처리할 수 있는 모든 종류의 장치를 포함할 수 있다. 예를 들어 프로그램 내 에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어에 내 장된 데이터 처리 장치를 의미할 수 있다. 이와 같이 하드웨어에 내장된 데이터 처리 장치의 일 예로써, 마이 크로프로세서(microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 처리 장치를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 데이터베이스는 배전계통의 계전기를 통한 고저항 사고 판별 방법을 수행하기 위해 공동으로 필요한 데이 터를 유기적으로 결합하여 저장한 매체일 수 있다. 예컨대, 데이터베이스에는 고저항 사고 또는 부하증가 에 따른 전압 또는 전류 파형 데이터 및 이를 웨이블릿 변환한 이미지 데이터 등이 저장될 수 있다. 데이터베이 스는 메모리와는 별도의 구성 요소로서 포함되거나, 또는 메모리의 일부 영역에 구축될 수도 있 다. 도 2는 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 세부 모듈을 설명하기 위한 블록도이고, 도 3 은 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 고저항 고장 판별 방법을 설명하기 위한 도면이다. 도 2를 참조하면 프로세서는 메모리에 저장된 프로그램의 실행에 따라 다양한 기능을 수행하는 세부 모듈을 포함할 수 있다. 세부 모듈은 데이터 변환부 및 고저항 고장 판별 모델을 포함할 수 있다. 구체적으로 프로그램은 입력 데이터를 기초로 배전계통의 차단기(CB)의 동작을 조절하고, 고저항 고장 판별 모델에 기초하여 배전계통에 대한 보호 기능을 수행할 수 있다. 여기서, 입력 데이터는 전압 또는 전 류의 시계열 데이터로서 학습 데이터와 시험 데이터를 포함할 수 있다. 일 예로 학습 데이터는 고저항 지락 사 고 발생시의 파형 데이터와 정상 상태시의 파형 데이터를 포함할 수 있다.예시적으로 프로그램은 계측기로부터 측정된 전압 또는 전류 파형 데이터를 데이터 변환부에 입력 데이터 로서 입력하고 각 파형 데이터에 대한 웨이블릿 변환을 수행하여 이미지 데이터를 생성할 수 있다. 또한 프로그램은 이미지 데이터를 고저항 고장 판별 모델에 입력하여 고저항 사고 여부를 분류할 수 있다. 이하 도 4 내지 도 5d를 참조하여 다양한 파형 데이터에 대한 웨이블릿 변환하는 데이터 변환부에 대하여 설명 한다. 도 4는 본 발명의 일 실시예에 따른 데이터 변환부를 설명하기 위한 도면이고, 도 5a 내지 도 5d는 본 발명의 일 실시예에 따른 파형 데이터를 예를 도시한 것이다. 예시적으로 데이터 변환부는 전압 또는 전류 파형 데이터에 대한 웨이블릿 변환을 수행하여 이미지 데이터 를 생성할 수 있다. 데이터 변환부는 데이터의 시각화를 위해 웨이블릿 변환을 수행하였으며, 바람직하게 실수 모를렛 웨이블 릿의 모함수 등을 사용할 수 있다. 일 예로, 데이터 변환부는 변환 결과의 계수를 구하기 위해서 pywt 모듈의 pywt.cwt() 함수를 이용하였고, matplotlib.pyplot을 사용하여 계수들을 그래픽(이미지 데이터)으로 변환할 수 있다. 즉 상전류의 한 주기 데이 터에 모를렛 웨이블릿 변환(Morlet wavelet transform)을 적용하고, 그 계수에 대하여 이미지 데이터를 생성하 였다. 도 4에 도시된 것처럼 데이터 변환부는 전류 데이터인 입력 데이터를 이미지 데이터로 변환할 수 있다. 이때 변환하는 전류의 시계열 데이터의 개수는 한 주기에 해당하는 32개의 시계열 값이며, 모를렛 웨이블 릿 변환의 계수가 색으로 표현되어 32×48 픽셀의 시간-주파수 이미지 데이터로 구성될 수 있다. 도 5a 내지 도 5d는 고저항 사고시의 고장데이터 및 정상상태의 데이터이며, 전압과 전류의 시계열 데이터이다. 즉 시계열 데이터를 시각화하여 후술하는 고저항 고장 판별 모델에 학습 데이터로서 적용할 수 있다. 본 발명은 배전계통의 고장을 판별하는 일반적인 보호계전기와 같이 전류 분석을 통하여 고장 판별을 할 수 있 도록 전류의 시계열 데이터를 대상으로 분석하였다. 예를 들어 도 5a는 자갈에서 고저항 사고 실험을 통해 얻은 전류 파형을 보여주고 있으며, 증가 현상과 멈춤 현 상을 볼 수 있다. 도5b는 사고 발생 후 시간에 따른 전류 파형을 도시한 것으로 20주기와 40주기에서 전류 파형 을 비교해서 보여주고 있으며, 비선형성과 비대칭성이 사고 발생 후 모든 시간 영역에서 나타난다. 도 5c는 비 선형성과 비대칭성을 가진 고장 전류 파형의 예를 도시한 것이다. 즉 고조파 검출을 통하여 고저항 지락사고를 판별하는 중요한 특성은 이와 같은 비선형성과 비대칭성이므로 이 러한 특성을 나타내는 학습 데이터를 이용하여 고저항 고장 판별 모델을 학습할 수 있다. 한편 고저항 사고가 아닌 부하의 정상적인 증가 시에도 계전기가 측정하는 전류량이 커질 수 있다. 이는 고저항 고장이 발생하는 고장 전류의 양이 크지 않기 때문에 발생할 수 있다. 즉 단순한 전류 변화량 측정하는 기존의 계전기는 정상적인 부하 증가에 따라 늘어나는 전류와 고저항 사고의 전류 파형과 구별하기 어렵다는 문제가 있 다. 따라서 본 발명은 고저항 사고에 의한 고장 상황뿐 아니라 부하 증가에 대한 데이터(정상상태의 데이터)도 학습 데이터로서 이용하여 고저항 고장 판별 모델을 학습할 수 있다. 즉 도 5d에 도시된 것처럼 본 발명은 순간 적으로 부하가 증가할 때의 모선별 전압 변화를 나타내는 데이터(정상상태의 데이터)를 학습데이터로서 사용할 수 있다. 이처럼 프로그램은 상술한 고저항 사고시의 고장데이터 및 정상상태의 데이터를 포함한 파형 데이터를 웨이블릿 변환한 이미지 데이터를 학습 데이터로서 이용하여 고저항 고장 판별 모델을 학습할 수 있다. 도 6은 본 발명의 일 실시예에 따른 고저항 고장 판별 모델을 설명하기 위한 도면이고, 도 7은 본 발명의 일 실 시예에 따른 고저항 고장 판별 모델의 학습 데이터를 도시한 것이다. 도 6을 참조하면 고저항 고장 판별 모델은 CNN 학습 네트워크에 고저항 사고 또는 부하증가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학습 데이터로서 사용하여 구축된 것으로 서, 고저항 사고를 분류하도록 학습될 수 있다. 고저항 고장 판별 모델은 데이터 변환부로부터 변환된 각 이미지 데이터와 고저항 사고 또는 부하증 가 등의 정답이 라벨링된 학습 데이터에 기반하여 구축될 수 있다. 예를 들어 도 7을 참조하면 고저항 고장 판별 모델은 고저항 사고와 부하증가에 대한 훈련, 검증 및 테스 트 데이터를 이용하여 구축될 수 있다. 일 예로 고저항 고장 판별 모델은 CNN 학습 모델을 이용하여 고저항 사고 또는 부하증가를 구분할 수 있다. 도 8은 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 배전계통에 대한 보호 방법을 설명하기 위한 순서도이다. 도 8을 참조하면, 프로그램은 전압 또는 전류의 시계열 데이터를 측정한 계측기로부터 입력 데이터를 수신 할 수 있다(S110). 이어서, 기존 계전기의 고장 판별 알고리즘을 기초로 1차적으로 입력 데이터에 대한 정 상 및 고장(일반적인 사고)을 판별할 수 있다(S120). 다음으로, 실시간으로 수집되는 전류 또는 전압에 대한 입 력 데이터에 대해 데이터 변환부가 웨이블릿 변환을 적용하여 이미지 데이터를 생성하고, 고저항 고장 판별 모델이 2차적으로 입력된 이미지 데이터에 대한 정상(부하증가) 및 고장(고저항 사고 인지)를 분류할 수 있다(S130). 따라서 본 발명은 기존 계전기가 판별하기 어려운 고저항 고장 사고를 보다 정확하게 판별할 수 있다. 더불어, 전력계통에서 고장이 발생하였을 때 계통을 보호하기 위해서, 빠르게 고장 여부를 판단할 수 있다. 특히, 기존 의 일반 계전기가 두 주기 내에 판단할 수 있는 반면, 본 발명의 디지털 계전기는 한 주기의 전류 데이터를 사 용하여 한 주기 내에 판별할 수 있다. 이하에서는 상술한 도 1 내지 도 8에 도시된 구성 중 동일한 기능을 수행하는 구성의 경우 설명을 생략하기로 한다. 도 9는 본 발명의 다른 실시예에 따른 배전계통의 디지털 계전기를 통한 고저항 사고 판별 방법을 설명하기 위 한 순서도이다. 도 9를 참조하면 배전계통의 디지털 계전기에 의해 수행되는 고저항 사고 판별 방법은 입력 데이터를 기초 로 배전계통의 차단기(CB)의 동작을 조절하는 단계(S210) 및 고저항 고장 판별 모델에 기초하여 배전계통 에 대한 보호 기능을 수행하는 단계(S220)를 포함하되, 고저항 고장 판별 모델은 CNN 학습 네트워크에 고 저항 사고 또는 부하증가에 따른 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 생성한 이미지 데이터를 학 습 데이터로서 사용하여 구축된 것으로서, 고저항 사고를 분류하도록 학습될 수 있다. S220 단계는 입력 데이터인 전압 또는 전류 파형 데이터를 웨이블릿 변환하여 이미지 데이터를 생성하고, 이미지 데이터를 고저항 고장 판별 모델에 입력하여, 고저항 사고 여부를 분류하도록 할 수 있다. S220 단계는 고저항 고장 판별 모델로부터 이미지 데이터가 고저항 사고인 것으로 출력되면, 배전계통의 차단기를 동작할 수 있다. 이상에서 설명한 본 발명의 실시예에 따른 방법은, 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의 해 실행 가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 이러한 기록 매체는 컴퓨터 판독 가 능 매체를 포함하며, 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 포함하며, 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다."}
{"patent_id": "10-2022-0169384", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0169384", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 구성을 보여주는 도면이다. 도 2는 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 세부 모듈을 설명하기 위한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 고저항 고장 판별 방법을 설명하기 위한 도면 이다. 도 4는 본 발명의 일 실시예에 따른 데이터 변환부를 설명하기 위한 도면이다. 도 5a 내지 도 5d는 본 발명의 일 실시예에 따른 파형 데이터를 예를 도시한 것이다. 도 6은 본 발명의 일 실시예에 따른 고저항 고장 판별 모델을 설명하기 위한 도면이다. 도 7은 본 발명의 일 실시예에 따른 고저항 고장 판별 모델의 학습 데이터를 도시한 것이다. 도 8은 본 발명의 일 실시예에 따른 배전계통의 디지털 계전기의 배전계통에 대한 보호 방법을 설명하기 위한 순서도이다. 도 9는 본 발명의 다른 실시예에 따른 배전계통의 디지털 계전기를 통한 고저항 사고 판별 방법을 설명하기 위 한 순서도이다."}
