{"patent_id": "10-2022-0111264", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0032370", "출원번호": "10-2022-0111264", "발명의 명칭": "안면측정 방법, 안면측정장치, 기록매체", "출원인": "충남대학교병원", "발명자": "송승한"}}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내지 6중 선택된 어느 하나의 방법을 구현하는 안면측정장치."}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 연산단계 전, 안면의 실거리 및 위치를 보정하는 보정단계(S200);를 포함하는 안면치수 측정방법."}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 연산단계 전, 대상체의 안면 중 측정대상을 선정하는 선정단계(S300);를 포함하는 안면치수 측정방법."}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 출력단계 후, 연산결과를 비교정보와 대비하여 이상여부를 판정하는 판정단계(S600);를 포함하는 안면치수 측정방법."}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 촬영단계 전, 조도센서(510)에 의해 분위기 조도를 측정하는 분위기조도 측정단계(S910);상기 분위기조도 측정단계 후, 조명(520)의 작동을 제어하는 조명제어단계(S920);를 포함하는 안면치수 측정방법."}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서, 상기 촬영단계 전, 지지대(600)를 통해 안면을 고정하는 고정단계(S930);공개특허 10-2024-0032370-3-상기 고정단계 후, 촬영대상 설정단계(S940);를 포함하는 안면치수 측정방법."}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "안면측정장치에 있어서,"}
{"patent_id": "10-2022-0111264", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "안면측정방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독 가능 기록매체에 있어서, 상기 안면측정방법은 청구항 1 내지 6중 선택된 어느 하나의 방법을포함하는 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 안면을 측정하고 판단하여, 특이성을 분석하는 기술에 대한 것이며, 특히 안면의 특정부위를 집중적으 로 실시간 판독하는 기술에 대한 것이며, 본 기술을 통해 정확한 안면 생체정보 확보를 목적으로 한다. 구체적으 로, 안면측정방법에 있어서, 측정수단으로 대상체(P)의 안면을 촬영하는 촬영단계(S100); 촬영단계 후, 서 버에 의해 대상체의 안면정보를 계산하는 연산단계(S400); 연산단계 후, 연산결과를 단말기로 출력하 는 출력단계(S500);를 포함하는 구성으로 이루어진다."}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 안면을 측정하고 판단하여, 특이성을 분석하는 기술에 대한 것이며, 특히 안면의 특정부위를 집중적 으로 실시간 판독하는 기술에 대한 것이며, 본 기술을 통해 정확한 안면 생체정보 확보를 목적으로 한다."}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "특허발명 001 내지 004는 신체의 일부를 촬영하여, 신체정보를 활용하는 기술을 제시하고 있으므로, 본 발명과 는 기술적으로 유사한 목적을 가지고 있다. 구체적으로 특허발명 001은 “건강상태 측정장치 및 방법”에 대한 발명을 제시하며, 특허발명 002는 “악안면 비대칭 측정장치”에 대한 발명을 제시하며, 특허발명 003은 “안면인식 및 체온측정 출입통제장치”에 대한 발 명을 제시하며, 특허발명 004는“얼굴 정보를 이용한 ＢＭＩ 측정 장치 및 방법”에 대한 발명을 제시한다. 그러나 특허발명 001 내지 004는 본 발명에서 제시하는 촬영단계, 연산단계, 출력단계의 실시간 처리 및 안면전 체 촬영 후 특정부위만을 선정하여 판정하는 기술을 제시하고 있지 않다. 선행기술문헌 특허문헌 (특허문헌 0001) (특허발명 001) : KR 10-1009959 B1 (등록일자 2011년01월14일) (특허문헌 0002) (특허발명 002) : KR 10-2017-0124135 A (공개일자 2017년11월10일) (특허문헌 0003) (특허발명 003) : KR 10-2241527 B1 (등록일자 2021년04월12일) (특허문헌 0004) (특허발명 004) : KR 10-1331667 B1 (등록일자 2013년11월14일)"}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 안면을 측정하고 판단하여, 특이성을 분석하는 기술에 대한 것이며, 특히 안면의 특정부위를 집중적 으로 실시간 판독하는 기술에 대한 것이며, 본 기술을 통해 정확한 안면 생체정보 확보를 목적으로 한다."}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 안면측정방법에 대한 발명이며, 구체적으로 측정수단으로 대상체(P)의 안면을 촬영하는 촬영단 계(S100); 상기 촬영단계 후, 서버에 의해 대상체의 안면정보를 계산하는 연산단계(S400); 상기 연산단계 후, 연산결과를 단말기로 출력하는 출력단계(S500);를 포함하는 시계열적 단계로 이루어진다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 상기 연산단계 전, 안면의 실거리 및 위치를 보정하는 보정단계(S200);를 포함하는 시계열적 단계로 이루어진다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 상기 연산단계 전, 대상체의 안면 중 측정대상을 선정하는 선정단계(S300);를 포함하는 시계열적 단계로 이루어진다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 상기 출력단계 후, 연산결과를 비교정 보와 대비하여 이상여부를 판정하는 판정단계(S600);를 포함하는 시계열적 단계로 이루어진다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 상기 촬영단계 전, 조도센서에 의해 분위기 조도를 측정하는 분위기조도 측정단계(S910); 상기 분위기조도 측정단계 후, 조명의 작동을 제어하는 조명제어단계(S920);를 포함하는 시계열적 단계로 이루어진다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 상기 촬영단계 전, 지지대를 통 해 안면을 고정하는 고정단계(S930); 상기 고정단계 후, 촬영대상 설정단계(S940);를 포함하는 시계열적 단계로 이루어진다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 어느 하나의 방법을 구현하는 안면측 정장치를 포함한다. 본 발명은 안면측정방법에 대한 발명이며, 앞에서 제시한 발명에 있어서, 안면측정방법을 실행하기 위한 프로그 램을 포함하는 컴퓨터 판독 가능 기록매체에 있어서, 상기 안면측정방법은 앞에서 제시한 방법 중 선택된 어느 하나의 방법을 포함하는 컴퓨터 판독가능 기록매체를 포함한다."}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 안면의 촬영단계, 연산단계, 분석단계를 순차적으로 진행하며, 실시간으로 진행하는 효과를 가진다. 본 발명은 보정단계를 통해, 안면의 곡선 및 원근에 대한 보정을 가능하게 하므로 정확한 실측계산을 가능하게 한다. 본 발명은 서버의 정보와 촬영정보를 비교하므로 정확한 판단결과를 얻을 수 있다."}
{"patent_id": "10-2022-0111264", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있을 정도로 상 세히 설명하기 위하여, 본 발명의 가장 바람직한 실시예를 상세하게 설명한다. 아래의 실시예에서 인용하는 번호는 인용대상에만 한정되지 않으며, 모든 실시예에 적용될 수 있다. 실시예에서 제시한 구성과 동일한 목적 및 효과를 발휘하는 대상은 균등한 치환대상에 해당된다. 실시예에서 제시한 상위개 념은 기재하지 않은 하위개념 대상을 포함한다. [실시예 1-1] 본 발명은 안면측정방법에 대한 발명이며, 구체적으로 측정수단으로 대상체(P)의 안면을 촬 영하는 촬영단계(S100); 상기 촬영단계 후, 서버에 의해 대상체의 안면정보를 계산하는 연산단계(S400); 상기 연산단계 후, 연산결과를 단말기로 출력하는 출력단계(S500);를 포함한다. [실시예 1-2] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 안면은 얼굴전체;를 포함한 다. [실시예 1-3] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 안면은 얼굴의 일부분;을 포함한다. [실시예 1-4] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 측정수단은 카메라;를 포함한다. [실시예 1-5] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-4에 있어서, 상기 카메라는 하나 또는 복수로 형성되는 것;을 포함한다. [실시예 1-6] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 측정수단은 3차원스케너 ;를 포함한다. [실시예 1-7] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-6에 있어서, 상기 3차원 스캐너는 비접촉 스 캐너로 형성되는 것;을 포함한다. 본 발명(실시예 1-1 내지 1-7)은 대상체(사람 또는 동물)의 안면을 측정하여, 산업상 이용가능한 물건(보형물, 마스크, 안면 내외부 부착물)의 제작 등에 활용되거나 또한 출입시스템의 보안강화를 위해, 정확한 안면정보 확 보를 위한 목적으로 활용될 수 있다. 상기 대상체의 정확한 치수정보를 확보해야 되며, 이를 구현하기 위해, 앞에서 제시한 실시예의 단계로 절차를 진행한다. 특히, 대상체의 안면을 촬영하는 촬영단계, 촬영된 결과물을 이용하여, 안면의 전체 또는 일부 치수 를 계측하는 연산단계, 연산단계 후, 사용자에게 결과를 제시하는 출력단계로 이루어진다. 구체적으로 촬영단계는 대상체의 안면전체 또는 안면의 일부분을 촬영할 수 있다. 상기 안면의 일부분은 눈, 코, 입, 귀, 이마, 눈썹, 턱 등이 될 수 있다. 상기 측정수단은 접촉식 측정수단 및 비접촉식 측정수단이 활용 된다. 접촉식 측정수단은 캘리퍼스를 이용하여 직접 대상체의 안면을 측정할 수 있다. 비접촉식 측정수단은 카 메라를 이용하여 영상촬영후 촬영결과를 이용하여 측정할 수 있다. 촬영정보는 2차원 정보 또는 3차원 정보로 얻을 수 있다. 3차원 정보를 얻기 위해서는 2개 이상의 카메라를 사 용하거나, 3차원 스캐너를 사용할 수 있다. 상기 촬영단계, 연산단계, 출력단계는 서버에 의해 데이터가 수집되고, 서버의 프로그램으로 작동된다. 본 발명을 통해 안면전체 및/또는 특정부위를 실시간으로 정확하게 촬영할 수 있으며, 촬영결과물을 이용하여, 안면인식 정보로 활용하는 보안장치 데이터로 활용된다. [실시예 2-1] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 연산단계 전, 안면의 실거 리 및 위치를 보정하는 보정단계(S200);를 포함한다. [실시예 2-2] 본 발명은 안면측정방법에 대한 발명이며, 실시예 2-1에 있어서, 상기 보정단계는 대상체 및 측정 수단의 거리측정으로 환산하는 제1환산단계(S210);를 포함한다. [실시예 2-3] 본 발명은 안면측정방법에 대한 발명이며, 실시예 2-1에 있어서, 상기 보정단계는 대상체에 부착 된 마커 또는 대상체 주변 보조장치에 의해 환산하는 제2환산단계(S220);를 포함한다.[실시예 2-4] 본 발명은 안면측정방법에 대한 발명이며, 실시예 2-3에 있어서, 상기 마커는 보정자;를 포 함한다. 본 발명(실시예 2-1 내지)은 보정단계를 구체화한다. 상기 보정단계는 촬영 결과물에 대하여 실치수 확보 및 촬 영 결과물 위치의 정확성 확보를 목적으로 한다. 구체적으로 제1환산단계는 대상체와 촬영장비의 설정된 거리를 통해 대상체 정보의 치수를 확인할 수 있다. 다른 실시예로서, 제2환산단계가 사용될 수 있으며, 이는 대상체에 미리 부착된 마커를 통해 실측길이를 환산할 수 있다. 또는 안경 및 보조장비를 통해 실측길이를 환산할 수 있다. 상기 보조장비는 안경 또는 안면지지대로 사용될 수 있다. 상기 마커는 보정자로서 사용되며, 상기 마커는 정해진 길이의 선 및 도형을 포함할 수 있다. 상기 마커는 일면에 표시면을 가지며, 타면에 접착면을 가진다. 따라서, 상기 접착면을 대상체에 부착할 수 있다. 상기 마커는 도형의 형태를 취하며, 도형의 치수가 서버에 사전 입력되어 보정대상의 비교대상으로 사용될 수 있다. [실시예 3-1] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 연산단계 전, 대상체의 안 면 중 측정대상을 선정하는 선정단계(S300);를 포함한다. [실시예 3-2] 본 발명은 안면측정방법에 대한 발명이며, 실시예 3-1에 있어서, 상기 선정단계는 촬영결과로부터 안면의 눈, 코, 입, 이마, 두발, 눈썹, 인중의 구성을 확정하는 확정단계(S310); 상기 확정단계 후, 대상을 선 택하는 선택단계(S320);를 포함한다. [실시예 4-1] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 출력단계 후, 연산결과를 비교정보와 대비하여 이상여부를 판정하는 판정단계(S600);를 포함한다. 본 발명(실시예 3-1 및 실시예 3-2)은 대상체의 구체적 구성을 선정하는 것을 목적으로 하며, 본 발명(실시예 4-1)은 대상에 대하여 치수를 확인한 후, 판정하는 판정단계를 목적으로 한다. 동물 또는 사람은 안면을 가지며, 안면은 눈, 코, 입 등의 구성으로 이루어진다. 눈은 눈꺼풀, 각막, 홍채, 동 공, 결막, 눈썹 등의 구성으로 구체화된다. 상기 측정수단(카메라)는 안면 전체를 촬영할 수 있으나, 국부적으 로 눈 또는 눈의 주변만을 촬영할 수 있다. 서버에 의해 안면전체에 대한 치수를 환산할 수 있으나, 필요에 따라 필요대상을 선정하여 치수를 환산할 수 있 다. 예를 들면, 눈 및/또는 눈꺼풀 모양에 대한 치수를 얻고자 할 경우, 영상정보 중 눈 및/또는 눈꺼풀 정보를 집중적으로 분석하여 판단함이 바람직하다. 이는 서버의 프로그램에 의해 대상을 자동으로 선정함이 바람직하며, 인공지능 기법을 이용하여, 판단대상체 확 정이 바람직하다. 판단대상체 확정이후, 비교정보와 대비하여 이상여부를 판정하는 판정단계가 요구된다. 즉, 눈꺼풀 모양을 측정함에 있어서, 대상체의 눈과 주변을 촬영한 후, 눈꺼풀의 크기와 형성을 확정하며, 비교 정보와 대비하여, 눈꺼풀의 크기가 정상, 비정상 등의 결과로 판정할 수 있다. [실시예 5-1] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 촬영단계 전, 조도센서 에 의해 분위기 조도를 측정하는 분위기조도 측정단계(S910); 상기 분위기조도 측정단계 후, 조명의 작동을 제어하는 조명제어단계(S920);를 포함한다. 본 발명(실시예 5-1)은 촬영결과의 정확성 확보를 위해, 조도 조절 기술을 제시하고 있다. 촬영대상의 분위기 조도를 촬영하며, 이는 조도계에 의해 이루어진다. 또한 조도계에 의해 얻어진 정보를 이용하여, 분위기 조도를 일정하게 유지한다. 이후 촬영을 진행할 수 있다. 이는 조도제어기에 의해 자동으로 이루어지며, 촬영전부터 조 도를 유지하며, 촬영을 진행한다. 상기 조도제어기의 작동은 급격히 이루어지지 않으며, 일정한 시간을 통해 이루어짐이 바람직하다. 홍채는 조도의 변화에 따라 반응한다. 따라서, 일정한 조도를 일정시간 유지한후, 촬영단계를 진행함이 바람직하다. [실시예 6-1] 본 발명은 안면측정방법에 대한 발명이며, 실시예 1-1에 있어서, 상기 촬영단계 전, 지지대 를 통해 안면을 고정하는 고정단계(S930); 상기 고정단계 후, 촬영대상 설정단계(S940);를 포함한다. 본 발명(실시예 6-1)은 정확한 안면고정을 목적으로 한다. 촬영수단에 의해 촬영되므로 안면 움직임은 촬영과정 중 구속되어야 한다. 이를 구현하기 위해 지지대를 형성하며, 상기 지지대는 안면 및/또는 두부의 일부분 고정을 목적으로 설치된다. 구체적으로 턱 받침대, 두부받침대, 이마 받침대가 사용될 수 있으며, 상기 받침대들은 하나 또 는 복수의 조합으로 사용될 수 있다. 상기 받침대들은 센서를 내장하고 있으며, 센서에 의해 움직임을 감지한다. 즉, 움직임이 발생될 경우, 촬영되 지 않으나, 설정된 시간동안 움직임이 적정량 이하의 경우, 촬영을 진행한다. 이는 받침대 제어기에 의해 구현한다. [실시예 7-1] 본 발명은 안면측정장치에 대한 발명이며, 앞에서 제시한 실시예 중 선택된 어느 하나의 방법을 구현하는 안면측정장치를 포함한다. [실시예 8-1] 본 발명은 안면측정방법을 실행하기 위한 프로그램을 포함하는 컴퓨터 판독 가능 기록매체에 대한 발명이며, 앞에서 제시한 청구항 1 내지 6중 선택된 어느 하나의 방법을 포함하는 컴퓨터 판독가능 기록매체를 포함한다."}
{"patent_id": "10-2022-0111264", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 안면측정방법의 순서도. 도 2는 본 발명의 안면측정장치 개념도. 도 3은 본 발명의 안면형상보정을 위한 다양한 실시예. 도 4는 본 발명의 안면 일부분(눈)에 대한 판단 실시예. 도 5는 본 발명의 안면부착 마커 및 보조장치에 대한 실시예."}
