{"patent_id": "10-2023-0140256", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0057197", "출원번호": "10-2023-0140256", "발명의 명칭": "스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 및 그 방법", "출원인": "유비벨록스", "발명자": "문창국"}}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템에 있어서,잔디가 식재된 스포츠 경기장 내 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합을 수집하는 데이터 수집 모듈;상기 수집한 상기 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합과 기 구축되어 있는상기 특정 구역에 식재된 잔디 데이터를 참조하여 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측하는예측 모듈; 및상기 예측한 결과를 시각화하여 관리자 단말로 제공하는 예측결과 제공 모듈;을 포함하며,잔디의 생육 상태 및 병충해 발생 예측을 통해서 최적의 잔디 생육 환경 구축을 지원하는 것을 특징으로 하는잔디 관리 시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 영상 데이터는,상기 특정 구역에 설치한 복수의 카메라에서 각각 촬영한 정지 영상, 동영상, 열화상 또는 이들의 조합을 포함하며,상기 기상 데이터는,상기 특정 구역의 온도, 습도, 풍속, 풍향, 강우량, 일사량 또는 이들의 조합을 포함하며,상기 토양 데이터는,상기 특정 구역의 토양 종류, 산도, 전기전도도, pH, 양분 함량 또는 이들의 조합을 포함하며,상기 잔디 데이터는,스포츠 경기장 내의 각 지역에 식재된 잔디의 품종 및 특성을 포함하는 것을 특징으로 하는 잔디 관리 시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 예측 모듈은,상기 수집한 상기 특정 구역의 영상 데이터, 기상 데이터 및 토양 데이터와 상기 특정 구역에 식재된 잔디 데이터를 인공지능 모델에 입력하고, 상기 인공지능 모델을 통해 출력되는 잔디 생육 상태 및 병충해 발생에 대한확률값을 토대로 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측하는 것을 특징으로 하는 잔디 관리시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 예측 모듈은,공개특허 10-2025-0057197-3-상기 수집한 상기 특정 구역의 영상 데이터 중 상기 열화상을 사용하여 단위시간별 온도 변화에 대한 함수를 생성하고, 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초과하면 상기 특정 구역의잔디에 질병이 발생한 것으로 예측하는 것을 특징으로 하는 잔디 관리 시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 예측 모듈에서 예측한 결과를 토대로 상기 특정 구역의 잔디 생육 및 병충해 예방을 위한 관수, 비료 및농약 작업과 관련된 시점, 시간 및 투입량을 추출하며, 상기 추출한 결과를 상기 관리자 단말로 제공하는 잔디생육 정보 제공 모듈;을 더 포함하는 것을 특징으로 하는 잔디 관리 시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 관수, 비료 및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하는 것은,상기 예측 모듈에서 예측한 생육 상태 및 병충해 예측 결과를 기 구축되어 있는 관수 정보 생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델에 각각 입력하고, 상기 관수 정보 생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델을 통해 출력되는 확률값을 토대로 관수, 비료 및 농약 작업에 필요한 시점, 시간 및 투입량을 추출하는 것임을 특징으로 하는 잔디관리 시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,기상 및 토양 환경에 따른 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터에 병충해 발생 확률을 각각레이블링한 학습데이터를 학습하여 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하고, 상기 생성한생육 상태 및 병충해 발생 예측용 인공지능 모델을 데이터베이스에 저장하여 관리하는 학습 모듈;을 더 포함하는 것을 특징으로 하는 잔디 관리 시스템."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "잔디 관리 시스템에 의해 수행되는 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리방법에 있어서,잔디가 식재된 스포츠 경기장 내 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합을 수집하는 데이터 수집 단계;상기 수집한 상기 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합과 기 구축되어 있는상기 특정 구역에 식재된 잔디 데이터를 참조하여 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측하는예측 단계; 및상기 예측한 결과를 시각화하여 관리자 단말로 제공하는 예측결과 제공 단계;를 포함하며,잔디의 생육 상태 및 병충해 발생 예측을 통해서 최적의 잔디 생육 환경 구축을 지원하는 것을 특징으로 하는잔디 관리 방법."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2025-0057197-4-청구항 8에 있어서,상기 예측 단계는,상기 수집 단계를 통해 수집한 상기 특정 구역의 영상 데이터, 기상 데이터 및 토양 데이터와 상기 특정 구역에식재된 잔디 데이터를 인공지능 모델에 입력하는 단계; 및상기 인공지능 모델을 통해 출력되는 잔디 생육 상태 및 병충해 발생에 대한 확률값을 토대로 상기 특정 구역의잔디 생육 상태 및 병충해 발생을 예측하는 단계;를 포함하는 것을 특징으로 하는 잔디 관리 방법."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 예측 단계는,상기 수집 단계를 통해 수집한 상기 특정 구역의 영상 데이터 중 열화상을 사용하여 단위시간별 온도 변화에 대한 함수를 생성하는 단계;상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초과하는지를 판단하는 단계; 및상기 판단한 결과 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초과하면, 상기 특정 구역의 잔디에 질병이 발생한 것으로 예측하는 단계;를 포함하는 것을 특징으로 하는 잔디 관리 방법."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 8에 있어서,상기 예측 단계를 통해 예측한 결과를 토대로 상기 특정 구역의 잔디 생육 및 병충해 예방을 위한 관수, 비료및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하며, 상기 추출한 결과를 상기 관리자 단말로 제공하는 잔디 생육 정보 제공 단계;를 더 포함하는 것을 특징으로 하는 잔디 관리 방법."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 관수, 비료 및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하는 것은,상기 예측 단계를 통해 예측한 생육 상태 및 병충해 예측 결과를 기 구축되어 있는 관수 정보 생성용 인공지능모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델에 각각 입력하고, 상기 관수 정보생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델을 통해 출력되는확률값을 토대로 관수, 비료 및 농약 작업에 필요한 시점, 시간 및 투입량을 추출하는 것임을 특징으로 하는 잔디 관리 방법."}
{"patent_id": "10-2023-0140256", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 8에 있어서,기상 및 토양 환경에 따른 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터에 병충해 발생 확률을 각각레이블링한 학습데이터를 학습하여 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하고, 상기 생성한생육 상태 및 병충해 발생 예측용 인공지능 모델을 데이터베이스에 저장하여 관리하는 학습 단계;를 더 포함하는 것을 특징으로 하는 잔디 관리 방법."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 및 그 방법에 관한 것으로, 고해상도 영상, 열화상, 대기 정보 및 토양 특성을 연계한 인공지능 분석을 통해서 잔디의 생육 상태와 병충해 발생을 예측하고, 이에 대한 정보를 관리자에게 제공하여 최적의 잔디 생육 환경을 구현할 수 있는 스포 츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 및 그 방법에 관한 것으로, 더욱 상세하게는 고해상도 영상, 열화상, 대기 정보 및 토양 특성을 연계한 인공지능 분석을 통해서 잔 디의 생육 상태와 병충해 발생을 예측하고, 이에 대한 정보를 관리자에게 제공하여 최적의 잔디 생육 환경을 구 현할 수 있는 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 골프장, 축구장과 같은 천연 잔디가 구비되어 있는 스포츠 경기장은 다양한 품종의 잔디를 필드에 식재하고, 수년간의 경험과 풍부한 지식을 갖춘 잔디 관리 전문가가 현장에서 직접 육안으로 식물의 상태를 관 찰하고, 필요한 경우 수분 보충과 비료 살포 등의 생육관리 방식으로 운영하고 있다. 그러나, 이와 같은 전문가의 육안 확인을 통한 잔디 상태 분석, 관수 및 비료 제공 등의 잔디관리 방식은 친환 경적이지 못하고 비용이 과다하게 소요되는 문제가 있었다. 따라서 본 발명에서는 열화상을 포함한 영상, 대기 정보 및 토양 특성을 연계한 인공지능 분석을 통해서 잔디의 생육 상태와 병충해 발생을 예측하고, 관련 정보를 관리자에게 제공하여 최적의 잔디 생육 환경을 구현할 수 있 도록 함으로써, 전문 인력이 수행하던 잔디관리 업무를 대체할 수 있도록 하며, 소모비용을 획기적으로 절감할 수 있는 방안을 제시하고자 한다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 창작된 것으로서, 스포츠 경기장 곳곳에 구비된 카메라와 센서 를 통해 수집한 고해상도 영상과 열화상, 대기 정보 및 토양 특성을 연계하여 스포츠 경기장에 설치된 잔디의 생육 상태와 병충해 발생을 예측할 수 있는 시스템 및 그 방법을 제공하는 것을 목적으로 한다. 또한 본 발명은 잔디의 생육 상태 분석 결과 및 병충해 예측 결과를 잔디 관리자에게 제공하고, 관리자가 이를 통해 관수나 비료사용 등의 최적화된 관리를 수행하여 친환경적인 잔디관리를 수행할 수 있는 시스템 및 그 방 법을 제공하는 것을 다른 목적으로 한다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 은, 잔디가 식재된 스포츠 경기장 내 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합을 수집하는 데이터 수집 모듈; 상기 수집한 상기 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들 의 조합과 기 구축되어 있는 상기 특정 구역에 식재된 잔디 데이터를 참조하여 상기 특정 구역의 잔디 생육 상 태 및 병충해 발생을 예측하는 예측 모듈; 및 상기 예측한 결과를 시각화하여 관리자 단말로 제공하는 예측결과 제공 모듈;을 포함하며, 잔디의 생육 상태 및 병충해 발생 예측을 통해서 최적의 잔디 생육 환경 구축을 지원하 는 것을 특징으로 한다. 또한, 상기 영상 데이터는, 상기 특정 구역에 설치한 복수의 카메라에서 각각 촬영한 정지 영상, 동영상, 열화 상 또는 이들의 조합을 포함하며, 상기 기상 데이터는, 상기 특정 구역의 온도, 습도, 풍속, 풍향, 강우량, 일 사량 또는 이들의 조합을 포함하며, 상기 토양 데이터는, 상기 특정 구역의 토양 종류, 산도, 전기전도도, pH, 양분 함량 또는 이들의 조합을 포함하며, 상기 잔디 데이터는, 스포츠 경기장 내의 각 지역에 식재된 잔디의 품 종 및 특성을 포함하는 것을 특징으로 한다. 또한, 상기 예측 모듈은, 상기 수집한 상기 특정 구역의 영상 데이터, 기상 데이터 및 토양 데이터와 상기 특정 구역에 식재된 잔디 데이터를 인공지능 모델에 입력하고, 상기 인공지능 모델을 통해 출력되는 잔디 생육 상태 및 병충해 발생에 대한 확률값을 토대로 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측하는 것을 특 징으로 한다.또한, 상기 예측 모듈은, 상기 수집한 상기 특정 구역의 영상 데이터 중 상기 열화상을 사용하여 단위시간별 온 도 변화에 대한 함수를 생성하고, 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초 과하면 상기 특정 구역의 잔디에 질병이 발생한 것으로 예측하는 것을 특징으로 한다. 또한, 상기 예측 모듈에서 예측한 결과를 토대로 상기 특정 구역의 잔디 생육 및 병충해 예방을 위한 관수, 비 료 및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하며, 상기 추출한 결과를 상기 관리자 단말로 제공하는 잔디 생육 정보 제공 모듈;을 더 포함하는 것을 특징으로 한다. 이때, 상기 관수, 비료 및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하는 것은, 상기 예측 모듈에서 예 측한 생육 상태 및 병충해 예측 결과를 기 구축되어 있는 관수 정보 생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델에 각각 입력하고, 상기 관수 정보 생성용 인공지능 모델, 비 료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델을 통해 출력되는 확률값을 토대로 관수, 비 료 및 농약 작업에 필요한 시점, 시간 및 투입량을 추출하는 것임을 특징으로 한다. 또한, 기상 및 토양 환경에 따른 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터에 병충해 발생 확률을 각각 레이블링한 학습데이터를 학습하여 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하고, 상기 생 성한 생육 상태 및 병충해 발생 예측용 인공지능 모델을 데이터베이스에 저장하여 관리하는 학습 모듈;을 더 포 함하는 것을 특징으로 한다. 아울러, 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 방법은, 잔디가 식재된 스포츠 경기장 내 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조 합을 수집하는 데이터 수집 단계; 상기 수집한 상기 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합과 기 구축되어 있는 상기 특정 구역에 식재된 잔디 데이터를 참조하여 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측하는 예측 단계; 및 상기 예측한 결과를 시각화하여 관리자 단말로 제공하는 예측결 과 제공 단계;를 포함하며, 잔디의 생육 상태 및 병충해 발생 예측을 통해서 최적의 잔디 생육 환경 구축을 지 원하는 것을 특징으로 한다. 또한, 상기 예측 단계는, 상기 수집 단계를 통해 수집한 상기 특정 구역의 영상 데이터, 기상 데이터 및 토양 데이터와 상기 특정 구역에 식재된 잔디 데이터를 인공지능 모델에 입력하는 단계; 및 상기 인공지능 모델을 통 해 출력되는 잔디 생육 상태 및 병충해 발생에 대한 확률값을 토대로 상기 특정 구역의 잔디 생육 상태 및 병충 해 발생을 예측하는 단계;를 포함하는 것을 특징으로 한다. 또한, 상기 예측 단계는, 상기 수집 단계를 통해 수집한 상기 특정 구역의 영상 데이터 중 열화상을 사용하여 단위시간별 온도 변화에 대한 함수를 생성하는 단계; 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초과하는지를 판단하는 단계; 및 상기 판단한 결과 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초과하면, 상기 특정 구역의 잔디에 질병이 발생한 것으로 예측하는 단계;를 포함 하는 것을 특징으로 한다. 또한, 상기 예측 단계를 통해 예측한 결과를 토대로 상기 특정 구역의 잔디 생육 및 병충해 예방을 위한 관수, 비료 및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하며, 상기 추출한 결과를 상기 관리자 단말로 제공하 는 잔디 생육 정보 제공 단계;를 더 포함하는 것을 특징으로 한다. 이때 상기 관수, 비료 및 농약 작업과 관련된 시점, 시간 및 투입량을 추출하는 것은, 상기 예측 단계를 통해 예측한 생육 상태 및 병충해 예측 결과를 기 구축되어 있는 관수 정보 생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델에 각각 입력하고, 상기 관수 정보 생성용 인공지능 모델, 비 료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델을 통해 출력되는 확률값을 토대로 관수, 비 료 및 농약 작업에 필요한 시점, 시간 및 투입량을 추출하는 것임을 특징으로 한다. 또한, 기상 및 토양 환경에 따른 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터에 병충해 발생 확률을 각각 레이블링한 학습데이터를 학습하여 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하고, 상기 생 성한 생육 상태 및 병충해 발생 예측용 인공지능 모델을 데이터베이스에 저장하여 관리하는 학습 단계;를 더 포 함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같이 본 발명의 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템 및 그 방법에 따르면, 고해상도 영상, 열화상, 대기 정보 및 토양 특성을 연계한 인공지능 분석을 통해서 잔디의 생육 상태와 병충해 발생 예측 정보를 토대로 관리자가 최적의 잔디 생육 환경을 구현할 수 있도록 함으로써, 전문 인력이 수행하던 골프장, 축구장 등의 각종 스포츠 경기장의 잔디관리 업무를 전자화하여 대체 할 수 있고, 화학적 성분의 농약이나 비료의 사용량 절감을 통해서 친환경적인 잔디관리를 수행할 수 있으며, 잔디관리에 소모되는 비용을 절감할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다만, 본 발명의 효과가 상술한 효과들로 제한되는 것은 아니며, 언급되지 아니한 효과들은 본 명세서 및 첨부"}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 구체적인 실시예를 상세하게 설명한다. 다만, 본 발명의 사상은 제시되 는 실시예에 제한되지 아니하고, 본 발명의 사상을 이해하는 당업자는 동일한 사상의 범위 내에서 다른 구성요 소를 추가, 변경, 삭제 등을 통하여, 퇴보적인 다른 발명이나 본 발명 사상의 범위 내에 포함되는 다른 실시예 를 용이하게 제안할 수 있을 것이나, 이 또한 본원 발명 사상 범위 내에 포함된다고 할 것이다. 또한, 각 실시예의 도면에 나타나는 동일한 사상의 범위 내의 기능이 동일한 구성요소는 동일한 참조부호를 사 용하여 설명한다. 또한, 본 발명의 상세한 설명에 앞서, 본 발명에서는 골프장, 축구장 등의 각종 스포츠 경기장에 식재되어 있는 잔디의 생육 상태 분석 및 병충해 예측을 수행하는 것을 예로 하여 설명하지만, 스포츠 경기장 이외에 공원과 같이 잔디가 식재되어 있는 모든 장소에 적용하여 사용될 수 있음을 밝혀둔다. 도 1은 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템을 포함한 전체 구성을 개략적으로 나타낸 도면이다. 도 1에 도시된 바와 같이, 본 발명은 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템(100, 이하 잔디 관리 시스템이라 함), 복수의 카메라 및 측정센서, 데이터베이스, 관리 자 단말 등을 포함하여 구성된다. 상기 잔디 관리 시스템은 서버 컴퓨터, 플랫폼 등을 의미하며, 골프장, 축구장 등의 각종 스포츠 경기장에 식재되어 있는 잔디의 생육 상태나 병충해 발생 여부를 실시간으로 모니터링하고, 상기 모니터링한 결과에 따라 잔디 관리를 위한 정보를 생성하여 관리자 단말로 제공함으로써, 최적의 잔디 생육 환경을 구축할 수 있도 록 한다. 즉, 스포츠 경기장 곳곳에 조성되어 있는 잔디를 촬영한 고화질의 사진은 물론, 열화상 정보를 통해서 잔디의 변화, 특히 열 변화도를 수집하고, 상기 수집한 잔디의 변화에 따라 잔디의 현재 생육 상태가 어떠한지, 그리고 병충해가 발생하는지의 여부를 예측하고, 예측한 결과에 따른 관리 방안을 생성하여 제공함으로써, 해당 스포츠 경기장의 관리자가 상기 관리 방안에 따라 최적의 잔디 관리를 수행할 수 있도록 하는 것이다. 이때 상기 잔디 관리 시스템에서 상기 관리자 단말로 제공하는 관리 방안은 잔디의 생육 상태나 병충 해 발생 예측에 따른 관수(즉 물 공급) 작업, 비료나 농약 작업 등을 수행하여야 하는 시점, 시간, 투입량 등에 대한 정보일 수 있다.한편, 상기 잔디 관리 시스템은 복수의 카메라로 촬영한 고화질의 영상 및 열화상 데이터는 물론, 복 수의 측정센서를 통해 측정한 기상 데이터와 토양 데이터, 사전에 구축되어 있는 잔디의 품종이나 특성 정 보를 함께 이용하여 잔디의 생육 상태 및 병충해 발생 여부를 예측할 수 있다. 또한, 상기 잔디 관리 시스템에서 스포츠 경기장 내에 조성되어 있는 잔디의 생육 상태 분석이나 병충해 발생을 예측할 때, 인공지능 모델을 이용하여 수행하는 것이 가장 바람직하다. 상기 인공지능 모델의 생성 및 이용에 대해서는 도 2 및 도 3에서 보다 상세하게 설명하기로 한다. 하지만 이에 한정되는 것은 아니며, 그 이외에 소정 주기에 따라 촬영한 영상이나 소정 주기에 따라 측정한 대 기 및 토양의 변화량을 비교하고, 상기 비교한 변화량을 사전에 구축되어 있는 변화량 대비 생육 상태 및 병충 해 발생에 대한 데이터 정보를 참조하여, 잔디의 생육 상태나 병충해 발생을 예측하는 방식을 사용하는 것도 가 능할 것이다. 또한, 상기 잔디 관리 시스템은 상기 관리자 단말로 관수, 비료나 농약 작업 등의 관리 방안을 제공 할 때, 전체 스포츠 경기장 내의 잔디 상태를 시각적으로 그래픽 처리한 정보를 함께 제공함으로써, 관리자가 색상 비교를 통해 관리중인 잔디 상태를 직관적이고 일목요연하게 확인하도록 할 수 있다. 일 예로, 정상적인 잔디 구역은 녹색으로 표시하고, 생육 상태가 정상적이지 않거나 병충해가 발생된 것으로 예 측된 잔디 구역은 빨간색이나 노란색 등으로 시각화한 그래픽 정보를 제공하는 것이다. 이때 생육 상태 정도나 병충해 발생 예측 정도에 따라 복수의 단계로 나누어 색상 표시를 적용하는 것도 가능하다. 상기 카메라는 CCTV, 열화상 카메라 등으로서, 스포츠 경기장에 조성되어 있는 잔디를 촬영하기 적합한 위 치에 복수 개 설치되어 있으며, 사전에 정해진 스케줄에 따라 특정 잔디 구역을 촬영하며, 촬영한 고해상도의 영상 데이터, 열화상 데이터 등을 유무선 통신을 통해서 상기 잔디 관리 시스템으로 전송한다. 일 예로, 골프장의 경우, 각 홀의 티샷 위치, 페어웨이 위치, 홀 컵이 마련된 그린 주변 등과 같이 복수의 위치 에 각각 설치될 수 있다. 상기 측정센서는 온도, 습도, 풍속, 풍향, 강우량, 일사량 또는 이들의 조합을 포함한 기상 데이터는 물론, 토양 종류, 산도, 전기전도도, pH, 양분 함량 또는 이들의 조합을 포함한 토양 데이터를 측정할 수 있는 각종 센서이다. 이때 상기 측정센서는 상기 카메라의 부근이나 상기 카메라로 촬영하는 잔디 구역에 설치되어, 사전에 정해진 스케줄에 따라 잔디 구역의 기상 데이터 및 토양 데이터를 측정하며, 상기 측정한 기상 데이터 및 토양 데이터를 유무선 통신을 통해서 상기 잔디 관리 시스템으로 전송한다. 상기 데이터베이스는 상기 잔디 관리 시스템에서 사용하는 각종 동작프로그램이 설치되어 있으며, 관 리 대상의 각 스포츠 경기장에 조성된 잔디에 대한 정보(예: 품종, 특성 등)를 저장하여 관리한다. 특히, 상기 데이터베이스는 상기 카메라 및 측정센서를 통해 측정한 영상, 기상 및 토양 데이터 를 토대로 잔디의 생육 상태 분석 및 병충해 발생 여부 추정을 위한 인공지능 모델을 저장하여 관리한다. 또한, 상기 데이터베이스는 상기 인공지능 모델을 통해 예측한 잔디의 생육 상태 분석 및 병충해 발생 예 측결과를 토대로 관리자에게 제공될 관수 작업, 비료나 농약 작업 등을 수행하여야 하는 시점, 시간, 투입량 등 에 대한 관리 정보를 저장하여 관리한다. 상기 관리자 단말은 각 스포츠 경기장의 잔디 관리를 수행하는 관리자가 사용하는 스마트폰, 태블릿, 노트 북, PC 등의 통신기기로서, 상기 잔디 관리 시스템에서 제공하는 잔디 관리 방안을 수신하여 관리자가 확 인할 수 있도록 한다. 이때 상기 관리자 단말은 상기 잔디 관리 시스템으로부터 잔디 관리 방안을 제공받을 때, 전체 스포 츠 경기장 내의 잔디 상태를 시각적으로 그래픽 처리한 정보를 함께 제공받을 수 있다. 도 2는 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템의 구성을 보다 상세하게 나타낸 블록도이다. 도 2에 도시된 바와 같이, 상기 잔디 관리 시스템은 데이터 수집 모듈, 전처리 모듈, 예측 모듈 , 예측결과 제공 모듈, 잔디 생육 정보 제공 모듈, 학습 모듈 등을 포함하여 구성된다. 상기 데이터 수집 모듈은 영상 데이터 수집부, 기상 데이터 수집부 및 토양 데이터 수집부(11 3)로 구성되며, 스포츠 경기장 내의 잔디가 조성된 각각의 구역별 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합을 수집하여 전처리 모듈로 전달한다. 상기 영상 데이터는 잔디가 조성된 복수의 장소마다 설치되어 있는 상기 카메라에서 자신이 담당하는 특정 구역의 잔디를 촬영한 열화상 데이터이며, 정지 영상이나 동영상을 포함할 수 있다. 상기 특정 구역은 상기 잔디 관리 시스템에서 사전에 잔디가 조성된 지역 중 소정 크기로 구획한 어느 하 나의 구역으로서, 상기 카메라의 각도와 위치를 고정시켜 어느 하나의 구역만을 촬영하도록 구성할 수 있 으며, 그 이외에 상기 카메라의 각도와 위치를 조정하여 복수의 다른 구역을 순차적으로 촬영하도록 구성 할 수 있다. 상기 기상 데이터는 상기 카메라가 설치된 위치나 상기 카메라로 촬영하는 특정 구역에 설치된 측정 센서를 통해 측정한 온도, 습도, 풍속, 풍향, 강우량, 일사량 또는 이들의 조합을 포함할 수 있다. 상기 토양 데이터는 상기 기상 데이터와 마찬가지로 상기 카메라로 촬영하는 특정 구역에 설치된 측정센서 를 통해 측정한 해당 구역의 토양 종류, 산도, 전기전도도, pH, 양분 함량 또는 이들의 조합을 포함할 수 있다. 한편, 상기 데이터 수집 모듈은 상기 측정센서에서 측정한 현재의 기상 및 토양 데이터를 실시간으로 수집하는 방식 이외에, 해당 특정 구역의 과거 동일 시기의 기상 및 토양 데이터를 정부기관이나 공기관에서 직 접 운영하거나 위탁 운영하는 포털이나 데이터베이스 서버를 통해 수집할 수도 있다. 또한, 상기 데이터 수집 모듈은 잔디가 조성된 스포츠 경기장의 각 특정 구역별 잔디의 품종과 각 품종별 특성 정보 등을 포함한 잔디 데이터를 수집하고, 상기 수집한 잔디 데이터를 토대로 잔디의 질병 발생 종류를 정의하고, 이미지 학습과 지역 발발 상관관계 등을 통해 분석/예측이 가능한 항목 선별을 진행하고, 각 질병별 발생 조건, 관리 방법에 대한 매트릭스를 구성하여 관리자의 의사결정을 지원하고, 작업 권고 기능의 기준 데이 터로 활용하도록 할 수 있다. 상기 전처리 모듈은 상기 데이터 수집 모듈에서 수집한 잔디가 조성된 각각의 특정 구역별 영상 데이 터, 기상 데이터, 토양 데이터 또는 이들의 조합을 포함한 데이터를 상기 예측 모듈에 적용하기 위한 데이 터로 변환 및 편집하는 기능을 수행한다. 일 예로, 열화상 데이터의 경우 상기 예측 모듈에서의 데이터 처리를 위해 사전에 설정된 크기 및 해상도 로 변환 및 편집하는 전처리를 수행하고, 기상 데이터나 토양 데이터의 경우 상기 예측 모듈에서의 데이터 처리를 위해 사전에 설정된 단위나 변수로 변환 및 편집하는 전처리를 수행할 수 있다. 상기 예측 모듈은 상기 전처리 모듈에서 전처리된 각 특정 구역의 영상 데이터, 기상 데이터, 토양 데이터 또는 이들의 조합과 상기 데이터베이스에 구축되어 있는 상기 각 특정 구역에 식재된 잔디 데이터 (즉 잔디의 품종과 각 품종별 특성 정보 등)를 통해서 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측 하며, 상기 예측한 결과를 상기 예측결과 제공 모듈로 전달한다. 보다 구체적으로, 상기 예측 모듈을 통해 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측할 때, 본 발 명에서는 사전에 마련해둔 인공지능 모델(즉, 생육 상태 및 병충해 발생 예측용 인공지능 모델)에 상기 데이터 수집 모듈에서 수집한 특정 구역의 영상 데이터, 기상 데이터 및 토양 데이터와 상기 데이터베이스로 관리중인 상기 특정 구역에 식재된 잔디 데이터를 입력한 다음, 상기 인공지능 모델을 통해 출력되는 잔디 생육 상태 및 병충해 발생에 대한 확률값을 토대로 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측할 수 있 다. 즉, 잔디 품종 및 생육 관리의 지식 체계를 기반으로 정의한 발생 질병 종류, 수집된 생육 상태 정보 및 열화상 이미지에 대한 3D 교차분석으로 통해 잔디 질병 발생의 상관관계를 사전 예측할 수 있는 것이다. 또한, 본 발명에서는 인공지능 모델을 이용한 방식 이외에, 잔디의 열화상 데이터를 사용하여 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측하는 것도 가능하다. 즉, 상기 데이터 수집 모듈에서 수집한 특정 구역의 영상 데이터 중 열화상 데이터를 사용하여 단위시간별 온도 변화에 대한 함수를 생성한 다음, 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값 을 초과하는지를 판단하고, 상기 판단한 결과 온도 변화 감소량이 임계값을 초과하면 해당 특정 구역의 잔디에 질병이 발생한 것으로 예측하는 것이다.상기 예측결과 제공 모듈은 상기 예측 모듈에서 예측한 결과(즉, 잔디 생육 상태 및 병충해 발생 여 부에 대한 예측)를 시각화 처리하고, 이를 해당 지역의 잔디를 관리하는 관리자가 소지한 관리자 단말로 전송한다. 일 예로, 골프장의 1홀에 조성되어 있는 잔디 상태를 관리자에게 제공한다고 가정할 때, 상기 예측결과 제공 모 듈은 상기 예측 모듈에서 예측한 잔디 생육 상태 및 병충해 발생 여부에 따라 해당 1홀 전체의 잔디 중 생육 상태가 정상적이거나 병충해 발생이 예측되지 않은 특정 구역은 녹색으로 표시하고, 생육 상태가 저하 또는 불량하거나, 병충해 발생이 예측되는 특정 구역은 생육 상태나 발병 상태의 심각도에 따라 노란색, 주황색, 빨강색 등으로 색상을 다르게 구분하여 표시함으로써, 관리자가 잔디 상태를 직관적이고 일목요연하게 확인할 수 있도록 하는 것이다. 상기 잔디 생육 정보 제공 모듈은 상기 예측 모듈에서 예측한 결과를 토대로 각각의 구역별 잔디 생 육 및 병충해 예방에 필요한 관수, 비료 및 농약 작업을 위한 시점, 작업시간, 비료/농약 종류, 공급(투입)량 등의 정보를 추출하고, 상기 추출한 정보를 상기 관리자 단말로 전송한다. 이때 상기 관수, 비료 및 농약 작업을 위한 시점, 작업시간, 비료/농약 종류, 공급(투입)량 등을 추출할 때, 상 기 잔디 생육 정보 제공 모듈은 인공지능 모델을 활용할 수 있다. 일 예로, 상기 잔디 생육 정보 제공 모듈은 상기 예측 모듈로부터 제공되는 생육 상태 및 병충해 예 측 결과를 사전에 마련되어 있는 관수 정보 생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정 보 생성용 인공지능 모델에 각각 입력하고, 상기 관수 정보 생성용 인공지능 모델, 비료 정보 생성용 인공지능 모델 및 농약 정보 생성용 인공지능 모델을 통해 출력되는 확률값을 토대로 비료 및 농약 작업에 필요한 시점, 시간 및 투입량을 추출하고, 이를 관리자에게 제공할 수 있다. 또한, 상기 잔디 생육 정보 제공 모듈은 인공지능 모델을 이용하지 않고, 상기 예측 모듈을 통해 예 측되는 잔디의 생육 상태나 병충해 발생 예측값별로 사전에 결정된 관수, 비료 및 농약 작업을 위한 시점, 작업 시간, 비료/농약 종류, 공급(투입)량 등을 결정하여 관리자에게 제공하는 것도 가능하다. 이에 따라 관리자는 상기 예측결과 제공 모듈과 상기 잔디 생육 정보 제공 모듈로부터 제공받은 결과 를 참조하여, 적절한 시기 및 시간에 적정량의 관수, 비료 및 농약 작업을 수행할 수 있으므로, 최적의 잔디 생 육을 수행할 수 있게 된다. 상기 학습 모듈은 상기 예측 모듈에서 사용되는 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하고, 상기 생성한 생육 상태 및 병충해 발생 예측용 인공지능 모델을 상기 데이터베이스에 저장하여 관리한다. 또한, 상기 생육 상태 및 병충해 발생 예측용 인공지능 모델을 지속적으로 갱신하여 업데이트하여 관 리한다. 이때 상기 생육 상태 및 병충해 발생 예측용 인공지능 모델은 기상 및 토양 환경에 따른 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터에 병충해 발생 확률을 각각 레이블링한 학습데이터를 학습하여 생성할 수 있 다. 일 예로, 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터와 상기 영상 데이터를 촬영한 시점의 기상 데 이터 및 토양 데이터를 포함한 결합 데이터에 병충해 발생 확률을 레이블링한 학습데이터를 학습하여 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성할 수 있다. 즉, 스포츠 경기장별 토양 및 기후 데이터 변수와 잔 디 질병 종류, 이력 등을 융합하여 인공지능 기반의 분석 및 예측 모델을 설계할 수 있는 것이다. 특히, 열화상 데이터를 기반으로 상기 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하는 경우, 본 발 명에서는 카메라로 촬영된 복수의 열화상 데이터에 생육 상태 및 병충해 발생 확률을 각각 레이블링하여 학습데 이터를 구성하고, 이렇게 구성된 학습데이터를 학습함으로써, 열화상 기반의 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성할 수 있다. 즉, 상기 열화상 데이터를 통해 잔디의 온도, 수분함량 등을 확인할 수 있으므로, 본 발명에서는 잔디의 온도, 수분함량 등이 서로 다른 열화상 데이터별로 생육 상태 및 병충해 발생 확률을 레이블링하여 학습하는 것을 통 해서 상기 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하고, 실제 현장에 적용할 때 잔디 구역을 촬 영한 열화상 이미지를 상기 생육 상태 및 병충해 발생 예측용 인공지능 모델에 입력하여 해당 구역의 잔디 생육 상태 분석은 물론, 병충해 발생 여부를 예측할 수 있는 것이다. 도 3은 본 발명에 적용되는 잔디 생육 상태 및 병충해 발생 예측용 인공지능 모델의 학습구조를 설명하기 위한 도면이다. 도 3에 도시된 바와 같이, 상기 잔디 관리 시스템에 적용되는 잔디 생육 상태 및 병충해 발생 예측용 인공 지능 모델은 ANN(artificial neural network)의 학습방법을 통해 학습데이터를 학습하여 생성할 수 있다. 물론, 이는 하나의 예시일 뿐, CNN(convolution neural network) 등과 같이 다른 방식을 통해 생성할 수 있음을 밝혀 둔다. 일 예로, 상기 잔디 관리 시스템은 데이터세트(영상(열화상 포함), 기상 및 토양 데이터)와 해당 데이터세 트에 대한 잔디 생육 상태 및 병충해 발생을 매핑한 매핑테이블을 학습하여 특정 데이터세트에 대한 잔디 생육 상태 및 병충해 발생을 출력하기 위한 학습모델을 생성한다. 상기 ANN을 통해 학습데이터를 학습하여 학습모델을 생성하는 경우, 상기 ANN의 기계학습구조는 영상, 기상 및 토양 데이터가 입력되는 적어도 하나 이상의 입력 노드를 포함하는 입력 레이어, 적어도 하나 이상의 히든 노드 를 포함하는 히든 레이어 및 적어도 하나 이상의 출력 노드를 포함하는 출력 레이어를 포함하여 구성된다. 또한 입력 레이어는 영상, 기상 및 토양 데이터를 입력받으며, 히든 레이어는 상기 입력 레이어 및 출력 레이어 와 특정 가중치를 가지는 링크(link)를 통해 각각 연결된다. 또한 ANN은 상기 입력 레이어, 히든 레이어 및 출력 레이어를 각각 연결하는 링크의 가중치를 조정해가면서 주 어진 입력과 상기 주어진 입력에 대한 원하는 출력의 쌍(즉, 영상, 기상 및 토양 데이터와 생육 상태 및 병충해 발생 확률)을 기계학습함으로써, 기계학습되지 않은 영상, 기상 및 토양 데이터에 대해서도 잔디 생육 상태 및 병충해 발생 예측을 출력할 수 있도록 한다. 또한 링크의 가중치는 백프로퍼게이션(back propagation)방법을 통해 조정되며, 상기 조정을 통해 입력데이터에 대한 생육 상태 및 병충해 발생 확률이 정확하게 출력될 수 있도록 한다. 즉 ANN은 백프로퍼게이션 방법으로 상기 입력 레이어, 히든레이어 및 출력 레이어 간의 링크에 대한 가중치를 조정함으로써, 입력데이터를 기계학습한다. 이를 통해 특정 구역의 잔디 생육 상태 및 병충해 발생에 대한 최적 의 예측을 출력할 수 있다. 또한 출력 레이어는 적어도 하나 이상을 출력할 수 있으며, 상기 각각의 해결전략은 0 내지 1 사이의 확률값을 가지며, 상기 각각의 확률값을 모두 더하면 1이 된다. 도 4는 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템의 하드웨어 구조를 나타낸 도면이다. 도 4에 도시한 것과 같이, 상기 잔디 관리 시스템의 하드웨어 구조는, 중앙처리장치, 메모리, 사용자 인터페이스, 데이터베이스 인터페이스, 네트워크 인터페이스, 웹서버 등을 포 함하여 구성된다. 상기 사용자 인터페이스는 그래픽 사용자 인터페이스(GUI, graphical user interface)를 사용함으로써, 사용자에게 입력과 출력 인터페이스를 제공한다. 상기 데이터베이스 인터페이스는 데이터베이스와 하드웨어 구조 사이의 인터페이스를 제공한다. 상기 네 트워크 인터페이스는 사용자가 보유한 장치 간의 네트워크 연결을 제공한다. 상기 웹 서버는 사용자가 네트워크를 통해 하드웨어 구조로 액세스하기 위한 수단을 제공한다. 대부분의 사용자들은 원격에서 웹 서버로 접속하여 상기 잔디 관리 시스템을 사용할 수 있다. 상술한 구성 또는 방법의 각 단계는, 컴퓨터 판독 가능한 기록매체 상의 컴퓨터 판독 가능 코드로 구현되거나 전송 매체를 통해 전송될 수 있다. 컴퓨터 판독 가능한 기록매체는, 컴퓨터 시스템에 의해 읽혀질 수 있는 데이 터를 저장할 수 있는 데이터 저장 디바이스이다. 컴퓨터 판독 가능한 기록매체의 예로는 데이터베이스, ROM, RAM, CD-ROM, DVD, 자기 테이프, 플로피 디스크 및 광학 데이터 저장 디바이스가 있으나 이에 한정되는 것은 아니다. 전송매체는 인터넷 또는 다양한 유형의 통신 채널을 통해 전송되는 반송파를 포함할 수 있다. 또한 컴퓨터 판독 가능한 기록매체는, 컴퓨터 판독 가능 코드 가 분산 방식으로 저장되고, 실행되도록 네트워크 결합 컴퓨터 시스템을 통해 분배될 수 있다. 또한 본 발명에 적용된 적어도 하나 이상의 구성요소는, 각각의 기능을 수행하는 중앙처리장치(CPU), 마이크로 프로세서 등과 같은 프로세서를 포함하거나 이에 의해 구현될 수 있으며, 상기 구성요소 중 둘 이상은 하나의단일 구성요소로 결합되어 결합된 둘 이상의 구성요소에 대한 모든 동작 또는 기능을 수행할 수 있다. 또한 본 발명에 적용된 적어도 하나 이상의 구성요소의 일부는, 이들 구성요소 중 다른 구성요소에 의해 수행될 수 있다. 또한 상기 구성요소들 간의 통신은 버스(미도시)를 통해 수행될 수 있다. 다음에는, 이와 같이 구성된 본 발명에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔 디 관리 방법의 일 실시예를 도 5를 참조하여 상세하게 설명한다. 이때 본 발명의 방법에 따른 각 단계는 사용 환경이나 당업자에 의해 순서가 변경될 수 있다. 도 5는 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 방법의 동작과정을 상세하게 나타낸 흐름도이다. 도 5에 도시된 바와 같이, 상기 잔디 관리 시스템은 인공지능 모델을 생성하는데 필요한 잔디의 열화상 데 이터를 포함한 영상 데이터, 해당 영상 데이터가 확보된 장소의 기상 데이터 및 토양 데이터를 수집한다(S110). 이때 수집되는 열화상을 포함한 영상 데이터는 각각의 품종별 잔디의 정상적인 생육 과정은 물론, 생육 과정에 서 발생할 수 있는 각종 병충해 발생 영상을 포함할 수 있다. 상기 S110 단계를 통해 잔디 영상, 기상 및 토양 데이터를 수집한 이후, 상기 잔디 관리 시스템은 상기 수 집한 기상 및 토양 환경에 따른 각 품종별 잔디 생육 과정을 촬영한 복수의 영상 데이터에 병충해 발생 확률을 각각 레이블링한 학습데이터를 생성하고(S120), 상기 생성한 학습데이터를 학습하여 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하여 상기 데이터베이스에 저장하여 관리한다(S130). 이와 같이 생육 상태 및 병충해 발생 예측용 인공지능 모델을 생성하여 관리하는 상태에서, 상기 잔디 관리 시 스템은 스포츠 경기장 내에 설치된 카메라 및 측정센서를 통해 잔디 생육 상태 분석 및 병충해 발생을 예측하기 위한 특정 구역의 잔디 영상(특히, 열화상 데이터), 기상 및 토양 데이터를 수집한다(S140). 이때 수집되는 기상 및 토양 데이터는 실시간으로 확보하지 않고 해당 특정 구역의 과거 동일 시기의 정보를 활 용할 수 있음은 상기 설명한 바와 같다. 상기 S140 단계를 통해 잔디가 식재된 특정 구역의 열화상을 포함한 영상, 기상 및 토양 데이터를 수집되면, 상 기 잔디 관리 시스템은 상기 특정 구역의 잔디 영상, 기상 및 토양 데이터를 전처리하여 입력 데이터 세트 를 생성한다(S150). 즉, 상기 특정 구역의 잔디 영상, 기상 및 토양 데이터를 상기 데이터베이스에 저장하여 관리중인 생육 상 태 및 병충해 발생 예측용 인공지능 모델에 입력하기 위한 데이터로 가공하는 것이다. 이어서, 상기 잔디 관리 시스템은 상기 생성한 입력 데이터 세트와 상기 데이터베이스로 구축하고 있 는 상기 특정 구역의 잔디 데이터(즉 잔디 품종이나 특성)를 생육 상태 및 병충해 발생 예측용 인공지능 모델에 입력하고, 상기 인공지능 모델을 통해 출력되는 잔디 생육 상태 및 병충해 발생에 대한 확률값을 토대로 상기 특정 구역의 잔디 생육 상태 및 병충해 발생을 예측한다(S160). 또한, 상기 잔디 관리 시스템은 상기 예측한 결과를 시각화하고, 상기 예측한 결과를 참조하여 잔디의 생 육에 필요한 잔디 생육 정보를 생성한다(S170). 이때 상기 시각화는 전체 스포츠 경기장 내의 각 구역별 잔디 생육 상태 및 병충해 발생 예측 결과를 다양한 색 상으로 표시한 것이고, 상기 생육 정보는 해당 특정 구역의 잔디 생육 및 병충해 예방을 위한 관수, 비료 및 농 약 작업과 관련된 시점, 시간 및 투입량 등에 대한 정보이다. 이후 상기 잔디 관리 시스템은 상기 S170 단계를 통해 생성한 스포츠 경기장 내의 잔디가 식재된 각 구역 별 잔디 생육 상태 및 병충해 발생 여부에 대한 시각화 결과와 잔디 생육을 위한 정보를 해당 관리자 단말(50 0)로 제공하여, 최적의 잔디 생육 관리를 수행할 수 있도록 한다(S180). 한편, 상기 도 5에 도시하지는 않았지만, 상기 잔디 관리 시스템은 잔디 생육 상태 분석 및 병충해 예측을 인공지능 모델을 통해 수행하지 않고, 상기 특정 구역의 열화상을 사용하여 단위시간별 온도 변화에 대한 함수 를 생성한 다음, 상기 생성한 함수를 미분한 결과 온도 변화 감소량이 기 설정된 임계값을 초과하면 상기 특정 구역의 잔디에 질병이 발생한 것으로 예측하는 방식을 적용할 수 있다. 이처럼, 본 발명은 고해상도 영상, 열화상, 대기 정보 및 토양 특성을 연계한 인공지능 분석을 통해서 잔디의 생육 상태와 병충해 발생 예측 정보를 토대로 관리자가 최적의 잔디 생육 환경을 구현할 수 있으므로, 전문 인력이 수행하던 각종 스포츠 경기장의 잔디관리 업무를 전자화하여 대체할 수 있고, 친환경적인 잔디관리를 수행 할 수 있으며, 소모되는 비용을 절감할 수 있다. 첨부된 도면은 본 발명의 기술적 사상을 보다 명확하게 표현하기 위해, 본 발명의 기술적 사상과 관련성이 없거 나 떨어지는 구성에 대해서는 간략하게 표현하거나 생략하였다. 상기에서는 본 발명에 따른 실시예를 기준으로 본 발명의 구성과 특징을 설명하였으나 본 발명은 이에 한정되지"}
{"patent_id": "10-2023-0140256", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "않으며, 본 발명의 사상과 범위 내에서 다양하게 변경 또는 변형할 수 있음은 본 발명이 속하는 기술분야의 당 업자에게 명백한 것이며, 따라서 이와 같은 변경 또는 변형은 첨부된 특허청구범위에 속함을 밝혀 둔다."}
{"patent_id": "10-2023-0140256", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템을 포함한 전체 구성을 개략적으로 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템의 구성을 보다 상세하게 나타낸 블록도이다. 도 3은 본 발명에 적용되는 잔디 생육 상태 및 병충해 발생 예측용 인공지능 모델의 학습구조를 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 시스템의 하드웨어 구조를 나타낸 도면이다. 도 5는 본 발명의 일 실시예에 따른 스포츠 경기장 내 잔디의 생육 상태 및 병충해 발생을 예측하는 잔디 관리 방법의 동작과정을 상세하게 나타낸 흐름도이다."}
