{"patent_id": "10-2023-0068717", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0170734", "출원번호": "10-2023-0068717", "발명의 명칭": "노약자및 장애인 전동 보행 보조 기기", "출원인": "엄재혁", "발명자": "엄재혁"}}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "노약자및 장애인 전동 보행 보조 기기에 있어서경량의 금속이나 합성수지 또는 카본 보디 및 프레임으로 이루어진 본체(20)를 포함하고, 상기 보디 및 프레임의 상단에 하나 또는 한 쌍의 손잡이(60)가 설치되며, 의자(160)는 의자 시트(180)가 구성되어 보디 및 프레임중앙 또는 일측에 설치되고, 상기 의자 아래에 위치한 수납함(80)과 보행 보조 기기의 전방에 있는 장애물을 감지하는 역할을 하는 초음파 센서(520)와;보행 보조 기기의 주행 속도를 감지하는 역할을 하는 광센서(540)가 구성되며,상기 보조 기기 본체(20)에 설치된 수납함(80)은 수납함 개폐 부(100)와 수납부 잠금장치(120)와 수납부 경첩(140)으로 구성되고, 상기 기기 본체 하단에 주행하는 적어도 하나 이상의 바퀴 부(200)와 모터(310)가 구성되어 구동하며;상기 기기의 바퀴부(200)는 바퀴 고정장치(220)와 스프링 완충기(240)가 구성되며; 브레이크(260)와 브레이크레버(280), 브레이크 연결 와이어(300)로 제어되는 것을 포함하며;상기 보조 기기의 모터(310)는 속도센서(320)와 포텐샤 미터(340), 그리고 액셀러레이터 중(360) 적어도 하나이상의 부품으로 연동하여 작동되며 조그셔틀 조종기(380)및 트리거(400)로 제어되며:상기 기기의 배터리(420)는 보행 보조 기기의 동력원으로 사용되며 배터리 충전하는 충전부(480)가 함께 제공되며, 상기 프레임의 하단 전면 및 후면 일측에 적어도 하나 이상의 바퀴 부(200)가 형성되고 상기 바퀴 부(200)의 동작을 제어하는 제어부가 구비된 것을 특징으로 하는 노약자및 장애인 전동 보행 보조 기기."}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "노약자및 장애인 전동 보행 보조 기기에 있어서 상기 보조 기기는 보디 및 프레임(40)으로 구성되어 있으며, 의자(160) 시트와 함께 제공되며, 바퀴 부(200)와 연결되어 있으며, 바퀴 부는 바퀴 고정장치(220)와 스프링 완충기(240)로 구성되어 있고, 브레이크(260)와 브레이크 레버(280)와 브레이크 연결 와이어(300)로 제어되며, 적어도 하나 이상의 모터(310)와 이를 제어하는 속도센서와(320) 포텐샤 미터(340), 액셀러레이터(360), 조그셔틀 조종기(380), 트리거(400) 중 적어도 하나 이상의 수단으로 제어되며, 상기 모터를 구동하는 배터리(420)와배터리 상태를 나타내는 배터리 표시부(430)와, 어둠을 밝히는 헤드라이트(500)와 초음파 센서(520), 광센서(540), 라이다 센서(560), 자이로 센서(580), 조도 센서(600) 중 적어도 하나 또는 2개 이상의 부품으로 제어부(660)에 의해 제어되도록 하고, 배터리(420)와 충전부(480)가 함께 제공되며, 적어도 하나 이상의 모터(310)는조그셔틀 조종기(380)및 트리거(400)로 제어되며; 브레이크(260)와 내리막 감속기(640), 수동 전환 스위치(620), ESC (Electronic Speed Controller)(650)는 제어부(660)에 의해 제어되는 것을 특징으로 하는 노약자및장애인 전동 보행 보조 기기."}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "상기 보조 기기는 보디 및 프레임(40)으로 구성되어 있으며, 의자(160) 시트와 함께 제공되며, 바퀴 부(200)와연결되어 있으며, 바퀴 부는 바퀴 고정장치(220)와 스프링 완충기(240)로 구성되며;상기 보조 기기는 브레이크(260)와 브레이크 레버(280), 그리고 브레이크 연결 와이어(300)로 연결되어 제어되며, 일측에는 라이다 센서(560)와 초음파 센서(520), 광센서(540)와 모터(310)의 속도를 조절하는 내리막 감속기(640)와 수동 전환 스위치(620)와 ESC(650)가 구성되어 제어부(660)에 의해 작동하며;상기 보조 기기에 설치된 헤드라이트(500), 초음파 센서(520), 광센서(540), 라이다 센서(560), 자이로 센서(580), 조도 센서(600) 중 적어도 하나 이상의 부품이 제어부(660)에 의해 제어되며:상기 보조 기기는 수동 전환 스위치(620)를 통해 수동으로 전환 가능하며 내리막 감속기(640)를 포함하고, 오르공개특허 10-2024-0170734-3-막에서는 모타의 회전을 높여 출력을 강화 시키고내리막에서는 구동 모터(310)의 회전 출력을 감속하거나 브레이크(260)를 작동하여 안정성을 제공하며;경고 버저(440) 및 경적(460)이 부착되어 경고 및 신호용으로 사용되고 상기 보조 기기의 브레이크 시스템은 브레이크 레버(280)와 브레이크 연결 와이어(300)를 통해 조절할 수 있거나 또는 조그셔틀 조종기(380)를 사용하여 브레이크를 조절할 수 있는 것을 특징으로 하는 노약자및 장애인 전동 보행 보조 기기"}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "상기 보조 기기는 보디 및 프레임(40)으로 구성되어 있으며, 의자(160) 시트와 함께 제공되며, 바퀴부(200)와연결되어 있으며, 바퀴부는 바퀴 고정장치(220)와 스프링 완충기(240)로 구성되어 있고, 브레이크(260)와 브레이크 레버(280), 그리고 브레이크 연결 와이어(300) 또는 조그셔틀 조종기(380)로 속도가 제어되며, 라이다 센서(560)는 사용자가 손잡이를 잡고 주행 방향을 변경하면 이를 감지하여 모터(310)의 회전 방향을 변경하며;초음파 센서(520)는 전방에 있는 장애물과의 거리를 측정하여 일정 거리 이하일 경우 자동으로 멈추며, 광센서(540)는 주행 속도를 감지하여 모터(310)의 회전 속도를 제어하며, 스피드센서(320)는 보조 장치의 이동 속도를측정하고 속도 조절 기능을 수행하며, 포텐샤 미터(340)는 보조 장치의 속도를 표시하며;액셀러레이터(360) 또는 조그셔틀 조종기(380)는 속도를 조절하는 부품으로, 보조 장치가 앞으로 나아가는 속도를 증가시키거나 정지하며 상기 조그셔틀 조종기(380)는 노약자및 장애인 전동 보행 보조 기기를 전후좌우로 자유롭게 조절할 수 있고 제어부(660)와 연결되어 있으며, 제어부(660)는 다양한 센서들의 데이터를 처리하여 상기 보조기기의 속도, 방향 및 안전 기능을 제어하며, 자이로 센서(580)는 방향을 감지하고, 조도 센서(600)는조명을 제어하며 수동 전환 스위치(620)를 통해 모드를 변경할 수 있으며, 내리막 감속기(640)는 내리막에서의안전성을 높여주며 충전부(480)는 배터리를 충전하고, 헤드라이트(500)는 조도 센서(600)를 통해 어둠 시 자동으로 작동되는 것을 더 포함하는 것을 특징으로 하는 노약자및 장애인 전동 보행 보조 기기."}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 제1항 내지 4항 중 어느 한 항에 있어상기 노약자및 장애인 전동 보행 보조 기기는 충전기(480), 충전용 배터리(500), 모터(310), 액셀러레이터(360), 조그셔틀 조종기(380), 포텐샤 미터(340), 속도센서(320), 초음파 센서(520), 광센서(540), 자이로 센서(580), 조도 센서(600) 등을 포함한다.속도센서(320)는 전동 보조 기기의 속도를 측정하며, 제어부(660)에서 이 데이터를 활용하여 속도를 조절하며;.초음파 센서(520)는 전동 보조 기기 주변의 장애물을 탐지하며, 제어부(660)에서 이 데이터를 활용하여 사용자의 안전을 보장하기 위해 장애물을 회피한다.광센서(540)는 주변 환경의 밝기를 측정하며, 제어부(660)에서 이 데이터를 활용하여 전동 보조 기기의 조명을조절하며; 자이로 센서(580)는 전동 보조 기기의 방향을 감지하며, 사용자가 이동하고자 하는 방향을 감지하여전동 보조 기기를 조종한다.조도 센서(600)는 주변 환경의 밝기를 측정하며, 사용자가 이동하는 환경에 맞게 조명을 자동으로 조절하며; 스피드센서(320)와 초음파 센서(520) 또는 광센서(540)와 자이로 센서(580) 중 적어도 한 개 이상의 센서가 제어부(660)에 연결되어 사용자의 안전성과 편의성을 높이는 것을 특징으로 하는 노약자및 장애인 전동 보행 보조기기."}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 제1항 내지 5항 중 어느 한 항에 있어서상기 노약자및 장애인 전동 보행 보조 기기는 보디 및 프레임(40)으로 구성되며, 의자(160) 시트와 함께 제공되며; 바퀴부(200)와 연결되어 있으며, 바퀴부는 바퀴 고정장치(220)와 스프링 완충기(240)로 구성되어 있고, 브레이크(260)와 브레이크 레버(280)와 브레이크 연결 선 또(300)는 조그셔틀 조종기(380)로 속도가 제어되며, 상기 보조 기기는 보디 및 프레임(40)의 하단에 위치한 바퀴부(200)와 주차 또는 보관 시 사용하는 바퀴 고정장치(220)와 함께 구성되고, 스피드센서(320), 포텐샤 미터(340), 액셀러레이터(360), 조그셔틀 조종기(380), 트리거(400), 초음파 센서(520), 광센서(540), 라이다 센서(560), 자이로 센서(580), 조도 센서(600) 중 적어도 하나 또는 2개 이상의 센서가 컨트롤인 제어부(660)에 연결되어 있으며, 제어부(660)는 스피드 센서(320)로부터공개특허 10-2024-0170734-4-받은 데이터로 속도를 조절하고, 초음파 센서(520)와 광센서(540)로부터 받은 데이터로 장애물과 밝기를 감지하며, 자이로 센서(580)는 전동 보조 기기의 방향을 감지하여 제어부(660)와 협력하여 조종하며, 조도 센서(600)는 일몰에 따라 조명을 자동으로 조절하는 것을 특징으로 하는 노약자및 장애인 전동 보행 보조 기기."}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 제1항 내지 6항 중 어느 한 항에 있어서상기 노약자및 장애인 전동 보행 보조 기기는 보디 및 프레임(40)으로 구성되며, 의자(160) 시트와 함께 제공되어, 바퀴부(200)와 연결되어 있으며, 바퀴는 바퀴 고정장치(220)와 스프링 완충기(240)로 구성되어 있고, 브레이크(260)와 브레이크 레버(280), 그리고 브레이크 연결 와이어(300) 또는 조그셔틀 조종기(380)로 속도가 제어되며, 상기 보조 기기는 스피드센서(320), 포텐샤 미터(340), 액셀러레이터(360), 조그셔틀 조종기(380), 트리거(400), 초음파 센서(520), 광센서(540), 라이다 센서(560), 자이로 센서(580), 조도 센서(600) 중 적어도 2개 이상의 센서가 컨트롤인 제어부(660)에 연결되어 있으며, 제어부(660)는 스피드 센서(320)로부터 받은 데이터로 속도를 조절하고, 초음파 센서(520)와 광센서(540)로부터 받은 데이터로 장애물과 밝기를 감지하며, 자이로 센서(580)는 노약자및 장애인 전동 보행 보조 기기의 방향을 알아내어 제어부(660)와 협력하여 조종하며, 조도 센서(600)는 일몰에 따라 조명을 자동으로 바꾸며;상기 기기 본체에는 손잡이(60)와, 수납함 개폐 부(100)와 수납부 잠금장치(120), 수납부 경첩(140)으로 이루어지는 수납함(80)을 포함하는 것을 특징으로 하는 노약자및 장애인 전동 보행 보조 기기."}
{"patent_id": "10-2023-0068717", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "경량의 금속, 합성수지, 또는 카본 보디 및 프레임으로 이루어진 보조 기기 본체가 있으며 이 본체에는 상단에하나또는 한쌍의 손잡이(60)와 의자 (160)가 있다. 상기 의자는 의자 시트(180)로 구성되어 있으며 보디 및 프레임 중앙 또는 일측에 설치되며 또한, 상기 의자 아래에는 수납함 (80) 과 보행 보조 기기의 전방에 있는 장애물을 감지하는 역할을 하는 초음파 센서 (520) 와 보행 보조 기기의 주행 속도를 감지하는 역할을 하는 광센서(540)가 위치하며;.수납함 (80) 은 수납함 개폐 부 (100) 와 수납부 잠금장치 (120) 와 수납부 경첩 (140)으로 구성되되; 이 수납함은 보조 기기 본체 (20)에 설치되어 있다.상기 기기 하단에는 바퀴 부 (200) 와 모터 (310) 가 구성되어 구동하며, 바퀴 부 (200) 는 바퀴 고정장치(220) 와 스프링 완충기 (240) 가 구성되어 브레이크 (260)와 브레이크 레버 (280), 브레이크 연결 와이어(300)로 제어된다.상기 기기는 적어도 하나 이상의 모터와 이를 제어하는 속도센서와 포텐샤 미터, 액셀러레이터, 조그셔틀 조종기, 트리거 중 적어도 하나 이상의 수단으로 제어되며 모터 (310) 는 조그셔틀 조종기 (380) 및 트리거 (400)로 제어되며 배터리(420)를 사용하여 구동되며 배터리 충전하는 충전부 (480)를 포함한다.상기 프레임의 하단 전면 및 후면 양측에는 적어도 하나 이상의 바퀴 부 (200) 가 형성되고, 이 바퀴 부 (200)의 동작을 제어하는 제어부가 구비되며 상기 보조 기기는 보디 및 프레임으로 구성되어 있으며, 의자 시트와 함께 제공되며; 브레이크와 내리막 감속기, 수동 전환 스위치, ESC는 제어부에 의해 제어되는 것을 특징으로 하는노약자및 장애인 전동 보행 보조 기기."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 상기한바 대로 노약자들이 보행 시보다 안전하고 편리하게 이동할 수 있도록 도와주는 노약자및 장애 인 전동 보행 보조 기기에 관한 것이다. 이 장치는 스피드센서, 포텐샤 미터, 액셀러레이터, 조그셔틀, 트리거, 배터리 표시부, 버저, 경적, 충전부, 헤드라이트, 초음파 센서 등의 다양한 구성 요소로 구성된다. (뒷면에 계속)"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 보행이 어려운 사람들을 위한 보행 보조 장치를 제공함으로써, 보행의 자유를 증진시키기 위한 것이다. 이를 위해, 본 발명은 보행 보조 장치를 더욱 사용하기 쉽고 안전하게 만드는 방법을 제공한다. 다양한 센서로 구성된 노인과 장애인을 위한 노약자및 장애인 전동 보행 보조 기기전기는 인공지능(AI) 운전과 방향제어 시스템을 갖추고 있으며 라이다 센서를 이용해 주행 방향과 속도를 조절한다. 또한, 보행 중 힘이 들 면 휴식을 위한 의자좌석이 구비되며 기존 수동식 보행 보조기와 비교하여 기술적인 문제를 해결하기 위한 새로 운 발명이다. 또한, 지형 높이 차이에 대한 장애물 감지 및 미끄러짐 방지 기능이 있어 안전성을 강화하며 LED조명을 제어하기 위한 광센서의 사용과 보호회로와 충전장치를 포함한다. 또한, 수동 조작을 위한 조이스틱이 포함되어 있어 사용자에게 편리함을 제공하므로 기존 제품에 비해 발전한 기술로 따라서, 이 기술은 보행 보조 기 분야의 혁신적인 발전으로 평가될 수 있다."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 전술한바대로 보행에 어려움을 겪는 노인 및 장애인을 위한 노약자및 장애인 전동 보행 보조 기기에 관한 것으로, 안전성과 편의성을 고려하여 설계되었다. 특히, 본 발명은 보행 보조 기기에 의자 및 수납함을 포함하여 더욱 편리한 사용자 경험을 제공하는 것을 목적 으로 한다. 노인 인구의 증가로 인해 보행능력에 제한이 있는 사람들이 증가하고 있다. 이러한 분들이 일상생활에서 독립적 으로 활동할 수 있도록 보행 보조 기기기가 개발되어 사용되고 있지만, 보행 보조 기기기의 안전성 문제가 여전 히 존재한다. 특히, 경사진 지형에서 보행 보조 기기기의 안전 운전이 어렵다는 문제가 제기되어 이를 해결하기 위한 연구와 기술 개발이 필요하게 되었다. 본 발명은 근력이 저하된 노인이나 장애인을 위한 지능적인 전동 보행 보조기에 관한 것으로 이러한 문제를 해 결하기 위해 언덕 밀림 방지 및 장애물 감지 기능을 추가하여 안전한 운전을 보장하며 또한, 배터리 관리 기능 도 탑재하여 더욱 오랜 시간 사용할 수 있도록 설계되었다. 이러한 노약자및 장애인 전동 보행 보조 기기는 의자와 바퀴를 가진 타입으로 제조되며, 이를 통해 사용자들은 편안하게 이동할 수 있다. 이 장치는 전동 기능을 통해 사용자들이 불편 없이 이동할 수 있도록 지원하며, 추가 적인 기능으로 의자와 수납함 등을 포함하여 사용자의 편리성을 확대한다. 따라서, 본 발명은 노인 및 장애인을 위한 안전하고 편리한 노약자및 장애인 전동 보행 보조 기기로서, 이들이 일상생활에서 보다 독립적으로 활동할 수 있도록 돕는 역할을 수행한다."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한바 대로 노약자들이 보행 시보다 안전하고 편리하게 이동할 수 있도록 도와주는 노약자및 장애 인 전동 보행 보조 기기에 관한 것이다. 본원은 종래 수동으로 밀어 나가는 보행보조장치의 문제점을 개선하여 발명된 것으로 다음과같은 특징이 있다. 1, 센서를 활용하여 장애물 감지 및 자동 멈춤 기능을 구현한다. 초음파 센서, 광센서, 라이다 센서 등의 다양한 센서를 사용하여 보행 도중 장애물을 감지하고, 인식하여 자동 으로 멈추도록 구성하며 이를 위해 인공지능 기술을 활용하여 센서 데이터를 처리하고, 보행 보조 장치의 동작 을 제어한다. 2, 자이로 센서를 활용한 언덕 밀림 방지 기능을 실현한다. 자이로 센서를 사용하여 언덕을 감지하고, 사용자가 밀리는 것을 방지하는 기능을 구현한다. 이를 위해 센서 데 이터를 처리하여 보행 보조 장치의 속도를 조절하거나, 멈추도록 제어한다. 3, 의자 및 수납함 설계 보행하는 도중 휴식이 필요한 경우를 대비하여, 보행 보조 기기의 중앙이나 일측에 접이식 의자를 설치하여 사 용자가 지갑이나 휴대전화기와 같은 물건을 수납할 수 있는 수납함을 의자 밑에 설계하며 이를 위해 강도 있는 재질로 제작된 의자와 수납함을 설계하고, 보행 보조 장치의 안정성을 고려하여 위치와 크기를 결정한다. 4, LED 라이트 제어 기능과 배터리 제어를 활성화 한다. 조도 센서를 사용하여 주변 밝기를 감지하고, 이에 따라 LED 라이트의 밝기를 자동으로 조절하는 기능을 포함하 며 조도 센서 데이터를 처리하여 LED 라이트의 밝기를 제어한다, 그리고 배터리 잔량을 감지하여, 배터리의 사 용량을 최적화하는 기능을 포함한다. 이를 위해 배터리 잔량 데이터를 처리하여 배터리 사용량을 제어하고, 충 전 부분에서 사용자에게 배터리 잔량을 표시한다.5, 조이스틱 추가 기능 구현 사용자가 직접 조종할 수 있는 조이스틱을 추가하여, 수동으로 보행 보조 기기를 조종할 수 있는 기능을 포함한 다. 이를 위해 조이스틱과 보행 보조 기기를 제어하는 기능을 구현하며 인공지능 주행과 방향 조절 시스템은, 사용자의 목적지와 경로를 입력받아 자동으로 주행을 할 수 있도록 구성되어 있다. 이를 위해 GPS와 지도 정보, 카메라 등의 기술이 사용된다. 또한, 사용자가 주행 중에 방향을 조절할 수 있도록 조종 장치를 제공한다. 이러한 기능들을 통해 노약자들은 보다 안전하고 쾌적한 보행 환경을 경험할 수 있으며, 보행에 대해 부담을 줄 일 수 있다. 노약자및 장애인 전동 보행 보조 기기는 노인과 장애인 등의 보행에 어려움을 겪는 사람들의 삶의 질을 향상시키는데 큰 역할을 할 수 있으며, 더 나은 미래를 향한 기술 발전의 한 방향이 될 수 있다."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명에 따르면, 본원 과제를 해결하기 위해 다양한 수단을 활용할 수 있 다. 예를 들어, 보행 보조 기기의 중앙이나 일측에 접이식 의자를 설치하여 휴식이 필요한 경우에 대비할 수 있다. 또한, 초음파 센서, 광센서, 라이다 센서 등의 다양한 센서를 사용하여 장애물 감지 기능을 갖춘 노약자및 장애 인 전동 보행 보조 기기를 구성함으로써 보행 중 안전성을 높일 수 있다. 또한, 지형이 고도차이가 있을 경우 자이로 센서를 활용하여 계단 등의 지형 변화에서 노약자및 장애인 전동 보행 보조 기기가 밀려나지 않도록 방 지하는 기능을 갖추어 안전성을 높일 수 있다. 또한, 노약자및 장애인 전동 보행 보조 기기의 배터리를 보호하 기 위한 회로 및 충전부를 포함하여 배터리 관리 기능을 개선함으로써 배터리 수명을 연장할 수 있다. 또한, 사용자가 편리하게 조작할 수 있는 기능을 추가하여 사용성을 개선할 수 있다. 예를 들어, 조이스틱을 추 가하여 사용자가 원하는 방향 및 속도로 노약자및 장애인 전동 보행 보조 기기를 조작할 수 있도록 할 수 있다."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 상술한바 대로 보행에 어려움을 겪는 노인 및 장애인을 위한 노약자및 장애인 전동 보행 보조 기기에 관한 것으로, 안전성과 편의성을 고려하여 발명 되었다."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본원 발명의 효과로는 첫 번째, 센서 및 제어기능을 통해 운행 중 안전성이 향상됩니다. 예를 들어, 장애물이 감지되면 제동 기능이 작동하여 사고를 예방할 수 있다. 이러한 안전성 향상은 사용자의 안전을 도모할 뿐만 아니라, 보행기기를 사용 하는 다른 사람들의 안전도 증가시킨다. 두 번째로, 조이스틱 조작 및 자동 주행 기능 등을 통해 사용자의 운전 및 조작이 더욱 쉬워지며 이러한 사용성 개선은 사용자들이 보행기기를 보다 효율적으로 운전하며, 보행기기를 보다 쉽게 사용할 수 있도록 돕는다. 세 번째로, 전동 보행 기기는 추가적인 기능을 쉽게 추가 및 업그레이드할 수 기기, 향후 보행 보조 기능을 더 욱 향상시킬 수 있는 확장성이 강화된다. 이는 사용자들이 항상 최신 기능을 유지하며, 향상된 성능을 경험할 수 있도록 한다. 네 번째로, 배터리 관리 및 에너지 소비를 최적화하여 보행 거리를 더욱 늘릴 수 있는 에너지 효율성이 증가하 며 이는 사용자들이 더 오래 걷거나 더 먼 거리를 이동할 수 있도록 한다. 다섯 번째로, 전동 보행기기는 자이로 센서를 통해 경사로와 같은 지형에서도 안정성을 유지할 수 있으며 사용 자들이 보행기기를 사용하면서 안정적으로 이동할 수 있도록 돕는다."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 보행이 어려운 어르신이나 장애인이 자유롭게 이동할 수 있도록 도와주는 노약자및 장애인 전동 보행 보조 기기와 그 사용 방법에 관한 것이다. 본 발명의 목적은 보행 보조 장치를 더욱 쉽고 안전하게 사용할 수 있도록 하는 것이다. 본 발명의 구성은 다음과 같다. 이하 첨부된 도면에 따라서 본 발명의 전동 휠체어 및 주행 제어방법의 기술적 구성을 상세히 설명하면 다음과 같다 도 1 은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 종래의 핸들 일체형 수동식 보조 기기를 나타낸 그림이고 도 2는 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 종래의 핸들분리형 수동식 보조기기를 나타낸 그림이다. 도 3은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 일체형 핸들 노약자및 장애인 전 동 보행 보조 기기를 나타낸 그림으로 경량의 금속이나 합성수지 또는 카본 보디 및 프레임으로 이루어진 본체 를 포함하고, 상기 보디 및 프레임의 상단에 단일체로 이루어진 하나의 손잡이가 구성되거나 또는 한 쌍의 손잡이가 설치되게 된다. 그리고 보디 프레임 중앙부나 일측에 사용자가 운행하다 피로하면 쉬어갈 수 있는 의자가 구성되며 상기 의자의 시트 부는 푹신한 쿠션 감을 제공하는 방수재질의 의자 시트가 구성되 어 보디 및 프레임 중앙 또는 일측에 설치된다. 아울러 상기 의자 아래에는 수납함이 구성되어 사용자의 가방이나 스마트폰 기타 다른 물품을 수납할수있다. 그리고 보행 보조 기기의 전방에 있는 장애물을 감지하는 역할을 하는 초음파 센서와; 보행 보조 기기의 주행 속도를 감지하는 역할을 하는 광센서가 구성되며, 상기 보조 기기 본체에 설치된 수납함은 수납함 개폐 부와 수납부 잠금장치와 수납부 경첩으로 구성되고, 상기 기기 본체 하단에 주행하 는 적어도 하나 이상의 바퀴 부와 모터가 구성되어 구동하게 되는데 바람직하게는 상기 기기의 전면 에 한 쌍의 구동부를 구성함이 바람직하지만 후면에도 부착할수있고 구동부를 구성하는것에 제한이없다. 아울러 상기 기기의 바퀴부는 바퀴 고정장치와 스프링 완충기가 구성되며; 브레이크와 브 레이크 레버, 브레이크 연결 와이어로 제어되게 된다. 상기 보조 기기의 모터는 바퀴의 일측에 구동 기어부를 포함하여 설치되며 속도를 제어하는 기능을 하는 속도센서와 포텐샤 미터, 그리고 액셀러레이터 중 적어도 하나 이상의 부품으로 연동하여 작동 되며 조그셔틀 조종기및 트리거로 제어되게한다. 더불어 상기 기기의 배터리는 보행 보조 기기의 동력원으로 사용되며 배터리 충전하는 충전부가 함께 제공되며, 상기 프레임의 하단 전면 및 후면 일측에 적어도 하나 이상의 바퀴 부가 형성되고 상기 바퀴 부 의 동작을 제어하는 제어부가 구비되게되는 것이다. 도 4는 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 분리형 핸들 노약자및 장애인 전 동 보행 보조 기기를 나타낸그림으로 이를 간략하게 설명하면; 경량의 금속, 합성수지, 또는 카본 보디 및 프레임으로 이루어진 보조 기기 본체가 있으며 이 본체에는 상단에 하나 또는 한쌍의 손잡이와 의자 가 있다. 상기 의자는 의자 시트로 구성되어 있으며 보디 및 프레임 중앙 또는 일측에 설치되며 또한, 상기 의자 아 래에는 수납함 과 보행 보조 기기의 전방에 있는 장애물을 감지하는 역할을 하는 초음파 센서 와 상 기 보조 기기의 주행 속도를 감지하는 역할을 하는 광센서가 설치되게된다. 한편, 상기 수납함 은 수납함 개폐 부 와 수납부 잠금장치 와 수납부 경첩 으로 구성되 되; 이 수납 함은 보조 기기 본체 에 설치되어 있다. 상기 기기 하단에는 바퀴 부 와 모터 가 구성되어 구동하며, 바퀴 부 는 바퀴 고정장치 와 스프링 완충기 가 구성되어 브레이크 와 브레이크 레버 , 브레이크 연결 와이어 로 제어된다. 상기 기기는 적어도 하나 이상의 모터와 이를 제어하는 속도센서와 포텐샤 미터, 액셀러레이터, 조그셔틀 조종 기, 트리거 중 적어도 하나 이상의 수단으로 제어되며 모터 는 조그셔틀 조종기 및 트리거 로 제어되며 배터리를 사용하여 구동되며 배터리 충전하는 충전부 를 포함한다. 상기 프레임의 하단 전면 및 후면 양측에는 적어도 하나 이상의 바퀴 부 가 형성되고, 이 바퀴 부 의 동작을 제어하는 제어부가 구비되며 상기 보조 기기는 보디 및 프레임으로 구성되어 있으며, 의자 시트와 함 께 제공되며; 브레이크와 내리막 감속기, 수동 전환 스위치, ESC가 설치되는데 상기 ESC (Electronic Speed Controller)는 전동 모터의 속도와 회전을 제어하는 장치입니다. ESC는 RC 모델 (Remote Control Model) 및 드 론과 같은 제어 가능한 모델에 가장 많이 사용하며 ESC는 모터에서 나오는 전압과 전류를 제어하여 모터의 속 도와 회전을 조절한다. ESC는 모터의 회전 방향도 제어할 수 있으며, 모터의 회전 방향을 바꿀 때는 ESC의 출력 선을 바꿔주면 된다. ESC는 모터 제어뿐만 아니라, 전압 및 전류를 모니터링하여 안전한 운전을 보장하는 기능 도 가지는 ECS 부재를 설치하게 되며 제어부에 의해 제어되게되는것이다. 도 5는 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 구동부를 나타낸그림으로 이를 첨언하면; 상기 바퀴부는 바퀴 고정장치와 스프링 완충기로 구성되어 있고, 브레이크와 브레이크 레버 , 그리고 브레이크 연결 와이어 또는 조그셔틀 조종기로 속도가 제어되며, 라이다 센서는 사용자가 손잡이를 잡고 주행 방향을 변경하면 이를 감지하여 모터의 회전 방향을 변경하며; 초음파 센서는 전방에 있는 장애물과의 거리를 측정하여 일정 거리 이하일 경우 자동으로 멈추며, 광센서 는 주행 속도를 감지하여 모터의 회전 속도를 제어하며, 속도센서는 보조 장치의 이동 속도를 측정하고 속도 조절 기능을 수행하며, 포텐샤 미터는 보조 장치의 속도를 표시하며; 액셀러레이터 또는 조그셔틀 조종기는 속도를 조절하는 부품으로, 보조 장치가 앞으로 나아가는 속도 를 증가시키거나 정지하며 상기 조그셔틀 조종기는 노약자및 장애인 전동 보행 보조 기기를 전후좌우로 자 유롭게 조절할 수 있고 제어부와 연결되어 있으며, 제어부는 다양한 센서들의 데이터를 처리하여 상 기 보조기기의 속도, 방향 및 안전 기능을 제어하며, 자이로 센서는 방향을 감지하고, 조도 센서는 조명을 제어하며 수동 전환 스위치를 통해 모드를 변경할 수 있으며, 내리막 감속기는 내리막에서의 안전성을 높여주며 충전부는 배터리를 충전하고, 헤드라이트는 조도 센서를 통해 어둠 시 자동 으로 작동되는 것을 더 포함하는 것을 특징으로 하며 이를 도면으로 나타낸 것이다. 도 6은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 작동상태의 불록도로서 상기 노약자및 장애인 전동 보행 보조 기기는 보디 및 프레임으로 구성되며, 의자 시트와 함께 제공되어, 바퀴부와 연결되어 있으며, 바퀴는 바퀴 고정장치와 스프링 완충기 로 구성되어 있고, 브레이크와 브레이크 레버, 그리고 브레이크 연결 와이어 또는 조그셔 틀 조종기로 속도가 제어되며, 상기 보조 기기는 스피드센서, 포텐샤 미터, 액셀러레이터, 조그셔틀 조종기, 트리거, 초음파 센서, 광센서, 라이다 센서, 자이로 센서, 조도 센서 중 적어도 2개 이상의 센서가 컨트롤인 제어부에 연결되어 있다. 상기 제어부는 스피드 센서로부터 받은 데이터로 속도를 조절하고, 초음파 센서와 광센서 로부터 받은 데이터로 장애물과 밝기를 감지하며, 자이로 센서는 노약자및 장애인 전동 보행 보조 기기의 방향을 알아내어 제어부와 협력하여 조종하며, 조도 센서는 일몰에 따라 조명을 자동으로 바꾸는 기 능을 한다.도 7은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 경사로 주행의 블록도 이고 도 8은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의 한 노약자및 장애인 전동 보행 보조 기기의 경사 및 내리막의 작동 불록도를 나타낸 것으로 상기 보조 기기에 설치된 헤드라이트, 초음파 센서, 광센서, 라이다 센서, 자이로 센서, 조도 센서 중 적어도 하나 이상의 부품이 제어부에 의해 제어되게된다. 더불어 상기 보조 기기는 수동 전환 스위치를 통해 수동으로 전환 가능하며 내리막 감속기를 포함하 고, 오르막에서는 모터의 회전을 높여 출력을 강화시키고 내리막에서는 구동 모터의 회전 출력을 감속하거 나 브레이크를 작동하여 안정성을 제공하게된다. 더불어 본체 일측에는 경고 버저 및 경적이 부착되어 경고 및 신호용으로 사용되고 상기 보조 기기의 브레이크 시스템은 브레이크 레버와 브레이크 연결 와이어를 통해 조절할 수 있거나 또는 조그셔틀 조종기를 사용하여 브레이크를 조절할 수 있는 것을 블록도로 나타낸것이다. 본원은 이와 같이 노약자및 장애인 전동 보행 보조 기기 본체는 경량의 금속이나 합성수지 또는 카본 보디 및 프레임으로 이루어져 있으며 상기 보디 및 프레임의 상단에는 하나또는 한쌍의 손잡이가 설치되 어 있다. 수납 구에는 보디 및 프레임에 부착되어 있으며, 수납함 개폐부, 수납부 장금장치, 수납부 경첩으로 구성되어 있다. 의자는 보디 및 프레임의 중앙에 장착되어 있으며, 본 사용자가 운행중 쉴 수 있는 구조인 의자 가 구성되고 이 의자의 상단에는 쿠션 부재가 구성된 의자 시트가 부착되어 있다. 또한 바퀴부는 보디 및 프레임의 하단에 위치하며, 주차나 보관시 사용하는 바퀴 고정장치가 설 치되며 상기 바퀴부일측에는 지면의 요철이나 굴곡의 충격을 완화하는 스프링 완충기가 구성되어 상 기 보디 및 프레임과 연결되게 된다.. 본원의 브레이크 시스템은 브레이크, 브레이크 레버, 브레이크 연결 와이어로 이루어져 있고 브 레이크를 대신하여 조그셔틀 조종기을 사용하여도 무방하다. 한편, 본원의 노약자및 장애인 전동 보행 보조 기기를 제어하는 센서는 매우 다양한 센서로 이루어지는데 스피 드센서(Speed sensor320), 포텐셔미터(Potenti Accelerator, 340), 액셀러레이터(Accelerate, 360), 조그셔틀 조종기(Jog Shuttle Pilot, 380), 트리가 (Trigger, 400), 초음파 센서(Ultrasonic sensor, 520), 광센서(Optical sensor, 540), 라이다 센서(Rider sensor, 560), 자이로 센서(Gyro sensor, 580), 조도 센서(Illumination sensor,600)등이 컨트롤인 제어부 에 연결되어 본체에 설치되게된다. 상기 노약자및 장애인 전동 보행 보조 기기는 초음파 센서, 광센서, 라이다 센서, 자이로 센서 , 조도 센서, 수동 전환 스위치, 내리막 감속기 등의 다양한 센서를 활용하여 본원의 노약 자및 장애인 전동 보행 보조 기기의 인공지능 주행과 방향 조절 시스템을 갖추고 있다. 손잡이 회전바퀴와 모터는 주행 방향과 속도를 제어하며, 벨 소리, LED 경고등, 헤드라이트 등의 제 어 장치는 안전과 편의를 제공한다. 상기 라이다 센서는 사용자가 손잡이를 잡고 주행 방향을 바꾸면 이를 감지하여 모터의 회전 방향을 변경한다. 초음파 센서는 전방에 있는 장애물과의 거리를 측정하여 일정 이하일 경우 자동으로 멈춘다. 광 센서는 주행 속도를 감지하여 모터의 회전 속도를 제어한다. 이와 같은 센서들은 보행 보조 장치의 안전성과 편의성을 높인다. 상기 스피드센서는 보조 장치의 이동 속도를 측정하는 센서로, 속도 조절 기능을 수행한다. 상기 포텐샤 미터는 보조 장치의 속도를 표시하는 장치로, 숫자나 바늘 형태로 보여준다. 상기 액셀러레이터와 조 그셔틀 조종기는 속도를 조절하는 부품으로, 보조 장치가 앞으로 나아가는 속도를 증가시키는 역할을 하며 본원에 선택적으로 설치되게 된다. 상기 조그셔틀 조종기의 장점은 본원의 노약자및 장애인 전동 보행 보 조 기기를 전후좌우로 자유롭게 조절할 수 있는 장점이 있는데 연로하신 어르신이 잘못 조작할수도 있다는 것을 제고 하여야 한다. 노약자및 장애인 전동 보행 보조 기기 본체는 일련의 제어부와 연결되어 있다. 제어부는 상기 스 피드센서에서 받은 데이터를 기반으로 노약자및 장애인 전동 보행 보조 기기의 속도를 제어하게된다. 또한, 제어부는 상기 초음파 센서 및 광센서에서 수신된 데이터를 분석하여 장애물 탐지 및 밝 기 조절 기능을 제공한다. 자이로 센서는 노약자및 장애인 전동 보행 보조 기기의 방향을 감지하여 조종하 며, 조도 센서는 상황에 맞는 조명을 제공한다. 또한, 수동 전환 스위치를 통해 노약자및 장애인 전 동 보행 보조 기기의 모드를 변경할 수 있으며, 내리막 감속기는 내리막에서의 안정성을 제공한다. 충전부 는 노약자및 장애인 전동 보행 보조 기기의 배터리를 충전하고, 배터리 표시부는 배터리의 현재 수준 을 표시한다. 경고 버저(Warning buzzer, 440) 및 경적은 경고 및 신호용으로 사용된다. 제어부는 트 리거를 통해 작동되며, 배터리 표시부를 통해 전원 상태를 표시한다. 이와 같이, 노약자및 장애인 전 동 보행 보조 기기는 다양한 구성 요소와 기능을 가지고 있으며, 이들이 상호 연결되어 작동함으로써 보행 보조 및 안전성을 제공한다. 실 시 예 1 초음파 센서를 이용하여 거리를 측정하고, 거리에 따라 모터의 속도와 방향을 제어하며, LED도 제어하는 코드."}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위 코드는 초음파 센서를 이용하여 거리를 측정하고, 거리에 따라 모터의 속도와 방향을 제어하며, LED도 제어하는 간단한 예시이다. 코드는 명세서에 따라서 필요한 기능을 추가하거나 수정할 수 있다.실 시 예 2 라이다 센서 작동 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "// Ultrasonic sensor pin connections #define TRIGGER_PIN 13 #define ECHO_PIN 12 // Motor pin connections #define MOTOR_P IN1 5 #define MOTOR_P IN2 6 #define MOTOR_SPEED_PIN 9 // LED pin connections #define LED_PIN 3 void setup() { pin Mode(TRIGGER_PIN, OUTPUT); pin Mode(ECHO_PIN, INPUT); pin Mode(MOTOR_P IN1, OUTPUT); pin Mode(MOTOR_P IN2, OUTPUT); pin Mode(MOTOR_SPEED_PIN, OUTPUT); pin Mode(LED_PIN, OUTPUT); Serial.begin;} void loop() { // Read distance from ultrasonic sensor long duration, distance; digital Write(TRIGGER_PIN, LOW); delay Microseconds; digital Write(TRIGGER_PIN, HIGH); delay Microseconds; digital Write(TRIGGER_PIN, LOW); duration = pulse In(ECHO_PIN, HIGH); distance = duration / 58.2; // Control motor speed based on distance int speed = 0; if (distance < 30) { speed = 100; } else if (distance < 50) { speed = 50; } else if (distance < 100) { speed = 25; } analog Write(MOTOR_SPEED_PIN, speed); // Control motor direction based on distance if (distance < 30) { digital Write(MOTOR_P IN1, HIGH); digital Write(MOTOR_P IN2, LOW); } else { digital Write(MOTOR_P IN1, LOW); digital Write(MOTOR_P IN2, HIGH); } // Control LED based on distance if (distance < 30) { digital Write(LED_PIN, HIGH); } else { digital Write(LED_PIN, LOW); } // Print distance and motor speed to serial monitor Serial.print(\"Distance: \"); Serial.print(distance); Serial.print(\" cm, Speed: \"); Serial.print(speed); Serial.println(\"%\"); delay; } 실 시 예 3 다음은 초음파 센서 작동 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "// 초음파 센서 측정값 변수 선언 int distance = 0; int trig Pin = 3; int echo Pin = 4; void setup() { Serial.begin; pin Mode(trig Pin, OUTPUT); pin Mode(echo Pin, INPUT); } void loop() { // trig Pin으로 초음파 신호 발생 digital Write(trig Pin, LOW); delay Microseconds; digital Write(trig Pin, HIGH); delay Microseconds; digital Write(trig Pin, LOW); // 초음파 수신시간 측정 duration = pulse In(echo Pin, HIGH); // 거리 계산 distance = duration * 0.034 / 2; // 측정값 출력 Serial.print(\"Distance: \"); Serial.print(distance); Serial.println(\" cm\"); 실 시 예 4다음은 광센서 작동 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "// 광센서 측정값 변수 선언 int light Value = 0; int sensor Pin = A0; void setup() { Serial.begin; pin Mode(sensor Pin, INPUT); } void loop() { // 광센서 측정값 읽기 light Value = analog Read(sensor Pin); // 측정값 출력 Serial.print(\"Light Value: \"); Serial.println(light Value); 실 시 예 5다음은 모터 제어 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "// 모터 제어 핀 선언 int motorPin1 = 9; int motorPin2 = 10; int motor Speed = 100; void setup() { // 모터 제어 핀 설정 pin Mode(motorPin1, OUTPUT); pin Mode(motorPin2, OUTPUT); } void loop() { // 모터 회전 analog Write(motorPin1, motor Speed); digital Write(motorPin2, LOW); // 일정 시간대기 delay; // 모터 정지 digital Write(motorPin1, LOW); digital Write(motorPin2, LOW); // 일정 시간대기 delay; } 실 시 예 6 다음은 조도센서를 이용한 LED 라이트 제어 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "// 조도센서와 LED 라이트를 이용한 예제 코드 int led Pin = 13; // LED 라이트가 연결된 핀 int sensor Pin = A0; // 조도센서가 연결된 핀 void setup() { pin Mode(led Pin, OUTPUT); pin Mode(sensor Pin, INPUT); Serial.begin; // 시리얼 통신 초기화 } void loop() { int sensor Value = analog Read(sensor Pin); // 조도센서로부터 값을 읽어옴 Serial.print(\"조도 값: \"); Serial.println(sensor Value); if (sensor Value < 200) { // 조도 값이 200 미만인 경우 LED 라이트를 켬 digital Write(led Pin, HIGH); } else { // 조도 값이 200 이상인 경우 LED 라이트를 끔 digital Write(led Pin, LOW); } delay; // 0.1초 대기 } 위의 코드는 조도센서와 LED 라이트를 이용하여, 조도 값이 일정 수준 이하일 때 LED 라이트를 켜는 예제 코드 이다. 먼저 setup() 함수에서 led Pin과 sensor Pin의 모드를 설정한다. loop() 함수에서는 analog Read() 함 수를 이용하여 조도센서로부터 값을 읽어오고, 읽어온 값에 따라 digital Write() 함수를 이용하여 LED 라이트 를 제어한다. delay() 함수를 이용하여 일정 시간 동안 대기한다. 다음은 언덕 밀림 방지 기능을 위해 자이로 센서를 사용하는 코드 예시를 제공해드리겠습니다. 실 시 예 7 모터와 연동하는 자이로 센서 값"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "const int trig Pin = 9; // 초음파 센서 트리거 핀 const int echo Pin = 10; // 초음파 센서 에코 핀 const int motor Pin = 5; // DC 모터 핀 const int brake Distance = 10; // 제동 거리 (cm) const int max Speed = 255; // 최대 속도 const int min Speed = 150; // 최소 속도 void setup() { pin Mode(trig Pin, OUTPUT); pin Mode(echo Pin, INPUT); pin Mode(motor Pin, OUTPUT); Serial.begin; } void loop() { // 초음파 센서로 거리 측정 digital Write(trig Pin, LOW); delay Microseconds; digital Write(trig Pin, HIGH); delay Microseconds; digital Write(trig Pin, LOW); float duration = pulse In(echo Pin, HIGH); float distance = duration * 0.034 / 2; // 거리에 따른 제동 기능 실행 if (distance <= brake Distance) { digital Write(motor Pin, LOW); // DC 모터 멈춤 delay; // 1초 대기 digital Write(motor Pin, HIGH); // DC 모터 다시 가동 } else { // 거리에 따라 속도 조절 int speed = map(distance, brake Distance + 1, 50, max Speed, min Speed); analog Write(motor Pin, speed); } // 거리 출력 (디버깅용) Serial.print(distance); Serial.println(\" cm\"); } 상기 코드는 Ada fruit_L3 GD20_Unified 라이브러리를 이용해 자이로 센서 값을 읽어들인다. 센서 값으로부터 pitch 각도를 계산하여, 일정한 각도 이상의 기울기가 감지되면 모터)를 감속하거나 멈추도록 제어하고, 일정한 각도 이하의 기울기가 감지되면 모터를 가속하거나 일정한 속도로 동작하도록 제어하며 이를 통해 경사로 에서도 뒤로 밀리지 않고 내리막에서 빨리 나가지 않아 안정적인 주행을 도와준다. 실 시 예 8배터리 제어코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "int battery Pin = A0; // 배터리 전압 측정용 아날로그 핀 float voltage; // 배터리 전압 int led Pin = 12; // 배터리 부족 시 켜지는 LED 핀 int motor Pin = 3; // 모터 제어용 핀 void setup() { pin Mode(led Pin, OUTPUT); pin Mode(motor Pin, OUTPUT); Serial.begin; // 시리얼 통신 시작 } void loop() { // 배터리 전압 측정 voltage = analog Read(battery Pin) * 0.0049; // 아날로그 값 -> 전압 변환 Serial.print(\"Battery voltage: \"); Serial.print(voltage); Serial.println(\" V\"); // 배터리 부족 시 처리 if (voltage < 10.5) { // 배터리 전압이 10.5V 이하면 digital Write(led Pin, HIGH); // LED 켜기 digital Write(motor Pin, LOW); // 모터 멈추기 } else { // 배터리 전압이 정상이면 digital Write(led Pin, LOW); // LED 끄기 digital Write(motor Pin, HIGH); // 모터 작동 } delay; // 1초 딜레이 } 이 코드는 배터리의 전압 측정에 아날로그 핀 A0을 사용하고 있다. 전압 측정값을 1024단계(0~1023)로 읽어들인 후, 이를 전압 값으로 변환한다. 변환 공식은 0.0049(5/1024)를 곱한 값으로, 5V를 기준으로 계산한 것이다. 이 렇게 측정된 전압 값이 10.5V 이하이면, LED를 켜고 모터를 멈춘다. 수동 작동을 위한 코드는 다음과 같이 구성될 수 있다. 실 시 예 9이 코드는 수동 조종 입력 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "void manual Control() { // read inputs from manual control (e.g. joystick) int manual Speed = analog Read(manualSpeedPin); int manual Direction = analog Read(manualDirectionPin); // map input values to appropriate motor speed and direction int motor Speed = map(manual Speed, 0, 1023, 0, 255); int motor Direction = (manual Direction < 500) ? FORWARD : BACKWARD; // set motor speed and direction analog Write(motorSpeedPin, motor Speed); digital Write(motorDirectionPin, motor Direction); // read inputs from manual brake (e.g. button) int manual Brake = digital Read(manualBrakePin); // if manual brake is activated, stop the motor if (manual Brake == HIGH) { analog Write(motorSpeedPin, 0); } } 이 코드는 수동 조종 입력(예: 조이스틱)을 읽어서 모터의 속도와 방향을 조절한다. manualSpeedPin과 manualDirectionPin은 각각 속도와 방향을 조절하는 아날로그 입력 핀이다. 이 입력 값은 analog Read() 함수를 사용하여 읽어들이다. 입력 값은 모터의 속도와 방향으로 변환되고, analog Write()와 digital Write() 함수를 사용하여 모터를 제어한다. 수동 브레이크(예: 버튼) 입력도 읽어들여, 브레이크가 작동되면 모터 를 정지시킨다. 실 시 예 10 다음은 조이스틱 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "const int joystickPinX = A0; // 조이스틱 X 축 핀 번호 const int joystickPinY = A1; // 조이스틱 Y 축 핀 번호 int joystickValueX = 0; // 조이스틱 X 축 값 int joystickValueY = 0; // 조이스틱 Y 축 값 void read Joystick() { joystickValueX = analog Read(joystickPinX); joystickValueY = analog Read(joystickPinY); } void controlMotorsWithJoystick() { read Joystick(); int motor Speed = map(joystickValueY, 0, 1023, 0, 255); // 조이스틱 Y 축 값에 따라 모터 속도 결정 int turning = map(joystickValueX, 0, 1023, -100, 100); // 조이스틱 X 축 값에 따라 회전 결정 if (motor Speed < 50) { // 모터 속도가 일정 값 미만일 때는 정지 stop Motors(); } else if (turning < -10) { // 왼쪽으로 회전할 때는 왼쪽 모터 속도를 낮추고 오른쪽 모터 속도 를 높임 int leftMotorSpeed = motor Speed * (1.0 + turning / 100.0); int rightMotorSpeed = motor Speed * (1.0 - turning / 100.0); controlLeftMotor(leftMotorSpeed); controlRightMotor(rightMotorSpeed); } else if (turning > 10) { // 오른쪽으로 회전할 때는 오른쪽 모터 속도를 낮추고 왼쪽 모터 속도 를 높임 int leftMotorSpeed = motor Speed * (1.0 - turning / 100.0); int rightMotorSpeed = motor Speed * (1.0 + turning / 100.0); controlLeftMotor(leftMotorSpeed); controlRightMotor(rightMotorSpeed); } else { // 직진할 때는 두 모터 속도를 같게 설정 controlBothMotors(motorSpeed); } } 위 코드는 조이스틱을 사용하여 노약자및 장애인 전동 보행 보조 기기를 조작할 수 있는 코드이다. joystickPinX와 joystickPinY는 각각 조이스틱 X축과 Y축이 연결된 아날로그 핀 번호를 나타낸다. read Joystick() 함수는 analog Read() 함수를 이용하여 조이스틱의 값을 읽어온다. controlMotorsWithJoystick() 함수는 read Joystick() 함수를 호출하여 조이스틱 값을 읽어온 후, 해당 값을 이용하여 모터의 속도와 회 전을 결정한다. 다음은 핸들에 덜려있는 속도 조절 엑셀을 추가하기 위해 다음과 같은 코드를 사용할 수 있다. 실 시 예 11액셀러레이터 코드"}
{"patent_id": "10-2023-0068717", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "const int accelPin = A0; // 압력 센서 핀 번호 int accelValue = 0; // 압력 값 int motor Pin = 9; // 모터 핀 번호 int motor Speed = 0; // 모터 속도 void setup() { pin Mode(accelPin, INPUT); // 압력 센서 입력 설정 pin Mode(motor Pin, OUTPUT); // 모터 출력 설정 Serial.begin; // 시리얼 통신 시작 } void loop() { accelValue = analog Read(accelPin); // 압력 값을 읽음 motor Speed = map(accelValue, 0, 1023, 0, 255); // 압력 값을 모터 속도로 변환 analog Write(motor Pin, motor Speed); // 모터 속도 설정 Serial.print(\"Accel Value: \"); // 시리얼 모니터에 압력 값 출력 Serial.println(accelValue); delay; // 0.1초 딜레이 } 위 코드는 압력 센서를 이용하여 핸들을 눌렀을 때 압력 값을 읽어와 모터 속도로 변환하여 모터를 제어하 는 방식으로 동작하며 이를 통해 핸들 조작에 따라 노약자및 장애인 전동 보행 보조 기기 본체 속도를 조절할 수 있다. 노약자및 장애인 전동 보행 보조 기기 본체의 전원을 켜면, 제어부가 전원을 공급한다. 속도센서는 사용자의 이 동 속도를 감지하고, 조도 센서는 주변 환경의 조도를 감지한다. 자이로 센서는 기울기와 방향을 감지하고, 라이다 센서는 사용자의 움직임을 감지한다. 이 정보들은 제어부로 보내져서 사용자가 원하는 방향으로 노약자및 장애인 전동 보행 보조 기기를 조작할 수 있다. 한편, 수동 전환 스위치를 사용하면, 노약자및 장애인 전동 보행 보조 기기를 수동 모드로 전환할 수 있다. 수 동 모드에서는 사용자가 종래 기기처럼 직접 노약자및 장애인 전동 보행 보조 기기를 밀어서 이동해야 하며 속 도 조절을 위해 액셀러레이터와 브레이크를 사용한다. 상기 액셀러레이터는 노약자및 장애인 전 동 보행 보조 기기의 속도를 높이고, 브레이크는 속도를 감소시키며 브레이크 레버를 사용하여 브레 이크를 작동시키면, 브레이크 연결 와이어가 상기 브레이크를 작동시키도록 신호를 보낸다. 한편, 본원 일측에 설치된 수납함 개폐 부를 조작하여 수납함을 열거나 닫을 수 있다. 수납부 잠금장 치와 수납함 경첩은 수납함을 잠금 상태로 유지하며, 키나 버튼 등을 사용하여 잠금을 해제할 수 도 있다. 한편 헤드라이트는 어두운 환경에서 노약자및 장애인 전동 보행 보조 기기를 사용할 때 필요한 조명을 제 공한다. 초음파 센서는 주변 장애물을 감지하고, 광센서는 조명 상태를 감지한다. 경적은 사용 자에게 경고 신호를 보내어 안전을 유지할 수 있도록 한다. 아울러 배터리 표시부는 노약자및 장애인 전동 보행 보조 기기의 배터리 상태를 나타내며, 충전부 를 사용하여 배터리를 충전할 수 있다. 지금까지 본 발명에 따른 전동 휠체어 및 주행 제어방법은 도면에 도시된 실시 예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 당업자라면 누구든지 이로부터 다양한 변형 및 균등한 다른 실시 예가 가능하다는 점 을 이해할 것이다. 따라서, 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의하여 정해져야 할 것이다. 아울러 보행 보조 기기와 관련된 기술적 변형 및 개선, 대체 제품, 대체 구성 요소, 서비스에 대한 권리를 포함한다. 산업상 이용가능성 본 발명은 노인 및 장애인 등 보행에 어려움을 겪는 사람들을 위한 보행 보조 장치로, 이들의 삶의 질을 향상시 키는 역할을 할 것으로 예상되며 이는 노약자들이 일상적인 생활에서 더욱 자유롭게 이동하고 활동할 수 있도록 도와주며, 더 나은 삶의 질을 제공할 것이다. 또한, 이와 같은 보행 보조 장치는 병원이나 요양원 등에서 사용될 수 있을 뿐만 아니라 개인 사용자들에게도 인기가 많을 것으로 예상된다. 현재 노인 인구가 급격히 증가하면서, 노약자들을 위한 보행 보조 장치에 대한 수요도 증가하고 있기 때문이다. 이에 본 발명은 기존의 보행 보조 장치와 비교하여 차별화된 특징과 장점을 가지고 있다. 다양한 센서와 제어 장치를 활용하여 인공지능 주행과 방향 조절 시스템을 구현하고, 의자와 수납함을 통해 편의성을 높여 보다 편 리하게 사용할 수 있도록 설계되었다. 이와 같이 본 발명은 보행이 어려운 사람들을 위한 보행 보조 장치를 제공함으로써, 보행의 자유를 증진시키고, 보행 보조 장치를 더욱 사용하기 쉽고 안전하게 만드는 방법을 제공한다. 이는 보행에 어려움을 겪는 많은 사람 에게 큰 도움이 될 것으로 기대되며 기존의 보행 보조 장치에 비해 차별화된 특징과 장점을 가지고 있다.부호의 설명 20: 노약자및 장애인 전동 보행 보조 기기 본체 40: 보디 및 프레임 60: 손잡이 80: 수납함 100: 수납함 개폐부 120: 수납부장 금장치 140: 수납부 경첩 160: 의자 180: 의자 시트 200: 바퀴부 220: 바퀴 고정장치 240: 스프링 완충기 260: 브레이크 280: 브레이크 레버 300: 브레이크 연결 와이어 310: 모터 320: 속도센서 340: 포텐샤 미터 360: 액셀러레이터 380: 조그셔틀 400: 트리거 420;배터리 430: 배터리 표시부 440: 경고 버저 460: 경적 480: 충전부 500: 헤드라이트 520: 초음파 센서 540: 광센서 560: 라이다 센서 580: 자이로 센서 600: 조도 센서 620: 수동 전환 스위치 640: 내리막 감속기 650:ESC 660: 제어부"}
{"patent_id": "10-2023-0068717", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 종래의 핸들 일체형 수동식 보조 기기를 나타낸그림이다. 도 2는 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 종래의 핸들분리형 수동식 보조기 기를 나타낸그림이다. 도 3은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 일체형 핸들 노약자및 장애인 전 동 보행 보조 기기를 나타낸그림이다.도 4는 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 분리형 핸들 노약자및 장애인 전 동 보행 보조 기기를 나타낸그림이다 도 5는 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 구동부를 나타낸그림이다. 도 6은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 작동상태의 불록도. 도 7은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 경사로 주행의 불록도. 도 8은 본 발명의 노약자및 장애인 전동 보행 보조 기기의 일 실시 예에 의한 노약자및 장애인 전동 보행 보조 기기의 경사및 내리막의 작동 불록도."}
