{"patent_id": "10-2023-0061607", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0164688", "출원번호": "10-2023-0061607", "발명의 명칭": "실내 스크린 테니스 서비스 제공 시스템", "출원인": "송민주", "발명자": "송민주"}}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자로부터 연습모드 및 게임모드를 포함하는 적어도 하나의 플레이 모드를 입력받고, 상기 사용자의 실력을초급, 중급 및 고급을 포함하는 레벨로 입력받으며, 입력된 적어도 하나의 플레이 모드 및 레벨에 대응하도록볼 라운처(Ball Launcher)의 속도 및 방향을 조절하는 센터 단말; 및상기 센터 단말을 등록하는 등록부, 상기 연습모드 및 게임모드를 포함하는 적어도 하나의 플레이 모드를 설정하는 설정부, 상기 적어도 하나의 플레이 모드 및 적어도 하나의 레벨에 대응하는 상기 볼 라운처의 속도 및 방향을 세팅하는 세팅부, 상기 사용자 단말에서 상기 적어도 하나의 플레이 모드 및 레벨을 입력하는 경우, 상기적어도 하나의 플레이 모드 및 레벨에 대응하도록 상기 볼 라운처를 제어하는 제어부를 포함하는 테니스 서비스제공 서버;를 포함하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 테니스 서비스 제공 서버는,상기 볼 라운처의 방향이 상기 적어도 하나의 플레이 모드 및 레벨에 대응하도록 상하좌우 이동되도록 제어하는방향조절부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 테니스 서비스 제공 서버는,상기 볼 라운처의 상하좌우 이동에 따라 볼이 토출되는 홀(Hole)이 스크린에 대응되도록 생성되고, 상기 볼 라운처의 방향에 따라 상기 홀에 대응하는 위치에 스크린 테니스 콘텐츠의 상대방 객체가 위치하도록 설정하는 객체설정부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 테니스 서비스 제공 서버는,상기 사용자의 사용자 단말에서 O2O(Online to Offline) 대결을 요청하는 경우, 적어도 하나의 상대방 단말 중상기 사용자 단말과 대결에 응하는 상대방 단말을 추출하고, 상기 상대방 단말의 센터 단말과 상기 사용자 단말의 센터 단말을 연동하여 O2O 대결이 이루어지도록 연결하는 원격대진부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템.공개특허 10-2024-0164688-3-청구항 5 제 1 항에 있어서,상기 테니스 서비스 제공 서버는,상기 센터 단말로 가상 플레이어와 대결을 요청하는 이벤트가 입력된 경우, 기 구축된 인공지능 가상 플레이어를 스크린에 표시하고, 상기 인공지능 가상 플레이어와 대진을 하도록 시뮬레이션을 구동하는 인공지능대진부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 테니스 서비스 제공 서버는,상기 센터 단말로부터 적어도 하나의 카메라를 통하여 수집된 사용자의 플레이 데이터를 분석하고, 상기 플레이데이터에 대한 분석 결과를 사용자의 사용자 단말로 전송하는 분석결과제공부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 테니스 서비스 제공 서버는,상기 센터 단말에서 상기 사용자가 원하는 테니스장을 입력한 경우, 상기 테니스장의 풍향 데이터 및 풍속 데이터를 실시간으로 수집하고, 상기 센터 단말과 연동된 적어도 하나의 팬(Fan)을 구동시켜 상기 사용자가 선택한테니스장의 실외환경을 구현하는 팬구동부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 테니스 서비스 제공 서버는,상기 센터 단말에서 상기 사용자가 원하는 테니스장을 입력한 경우, 상기 테니스장의 광량 데이터를 실시간으로수집하고, 상기 센터 단말과 연동된 조명의 조도 및 휘도를 조절함으로써 상기 사용자가 선택한 테니스장의 실외환경을 구현하는 조명구동부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 테니스 서비스 제공 서버는,적어도 하나의 프로 테니스 플레이어의 경기 영상을 수집하여 각 선수별 타격 데이터를 패턴화하고, 상기 센터단말로 상기 사용자가 대진을 원하는 선수를 선택한 경우, 상기 타격 데이터에 대응하도록 상기 볼 라운처를 구동시키는 프로구현부;공개특허 10-2024-0164688-4-를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 테니스 서비스 제공 서버는,상기 타격 데이터를 패턴화할 때, 상기 선수의 상대방의 이전 타격 데이터와 상기 선수의 현재 타격 데이터를매칭하여 쌍을 이루도록 데이터셋을 구축하고, 상기 사용자의 타격 데이터가 상기 선수의 상대방의 이전 타격데이터와 기 설정된 유사도가 초과할 경우, 상기 선수의 상대방의 이전 타격 데이터와 매칭된 상기 선수의 현재타격 데이터에 대응하도록 상기 볼 라운처를 구동시키는 매칭부;를 더 포함하는 것을 특징으로 하는 실내 스크린 테니스 서비스 제공 시스템."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실내 스크린 테니스 서비스 제공 시스템이 제공되며, 사용자로부터 연습모드 및 게임모드를 포함하는 적어도 하 나의 플레이 모드를 입력받고, 사용자의 실력을 초급, 중급 및 고급을 포함하는 레벨로 입력받으며, 입력된 적어 도 하나의 플레이 모드 및 레벨에 대응하도록 볼 라운처(Ball Launcher)의 속도 및 방향을 조절하는 센터 단말 및 센터 단말을 등록하는 등록부, 연습모드 및 게임모드를 포함하는 적어도 하나의 플레이 모드를 설정하는 설정 부, 적어도 하나의 플레이 모드 및 적어도 하나의 레벨에 대응하는 볼 라운처의 속도 및 방향을 세팅하는 세팅부, 사용자 단말에서 적어도 하나의 플레이 모드 및 레벨을 입력하는 경우, 적어도 하나의 플레이 모드 및 레벨에 대응하도록 볼 라운처를 제어하는 제어부를 포함하는 테니스 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실내 스크린 테니스 서비스 제공 시스템에 관한 것으로, 실내 스크린 테니스의 공 라운처의 방향 및 속도를 적응적으로 제어함으로써 맞춤형 스포츠를 즐길 수 있도록 하는 시스템을 제공한다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4차 산업혁명시대가 도래됨에 따라 새로운 시장을 선점하기 위한 기업들의 경쟁이 치열해지고 있으며, 특히 ICT 기술과 전통산업과의 융합은 이미 일상생활의 전반적인 영역으로 확대되어 미래사회를 선도할 가장 핵심적인 성 장 동력으로 주목 되고 있다. 스포츠산업은 4차 산업과 스포츠융복합, 스포츠의 세계화, 경쟁의 심화 스포츠 용품 제조업의 스마트 팩토리화, 인터넷 사용자와 소셜네트워크 서비스의 확산, 고령화 사회(Aging Society)에 따른 생활체육 관심 증대 등으로 인해 지속적 성장세가 나타나고 있다. 스포츠융복합 분야는 기술의 우수함을 생생하게 표현해 줄 수 있으며, 오류가 발생하더라도 다른 산업 분야에 비해 덜 민감하기 때문에 스포츠 분야에 서도 이러한 변화의 흐름이 지속되고 있다. 정부는 모든 국민이 스포츠를 즐기는 활기찬 나라를 만들기 위해 정부 및 민간 영역의 역할분담을 재정립하고 스포츠산업을 통한 경제적 가치창출을 극대화를 위해 스포츠 산업 진흥 중장기 계획을 수립 및 발표했다. 스포츠융복합산업 활성화 방안을 마련하기 위하여, 스포츠산업의 일반 현황부터 정책까지 스포츠융복합산업과 관련된 전반적인 실태조사에 대한 필요성이 대두되고 있다. 이때, 스크린 테니스의 실재감을 높이기 위해 가상 시뮬레이션을 구동하거나 상대방 플레이어와 테니스를 하는 것과 같은 환경을 제공하는 방법이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국공개특허 제2019- 0031113호(2019년03월25일 공개) 및 한국등록특허 제10-1586462호(2016년01월19일 공고)에는, 스크린 테니스 환경에서 가상 테니스 시뮬레이션 방식으로 상대방 플레이어를 인공지능으로 구동하더라도 스크린 후면에 설치 된 볼 머신을 통하여 공의 발사와 대응되도록 구축하는 구성과, 플레이어가 타격한 볼에 대응되는 볼을 테니스 플레이트로 공급하도록 복수의 볼 공급장치를 구비하고, 연습모드나 게임모드를 제공하며, 플레이어가 타격한 볼에 대응되는 볼을 제공할 때 기 설정된 패턴으로 테니스 플레이트로 공급하도록 하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 볼 머신이 한 개이기 때문에 가상 플레이어를 제공한다고 할지라도 언제나 공이 나오는 방향 및 속도가 동일하여 실재감이 전혀 없다. 후자의 경우에도 볼 공급장치를 복수로 구비하지만 언제나 패턴이 정 해져 있기 때문에 실제 테니스를 칠 때의 상황과는 전혀 다른 연습만 하게 된다. 대부분의 실내스크린 테니스 장은 한 방향으로 등속으로 공이 출력되므로 단순하게 칠 수 밖에 없는 구조이기에, 초급, 중급 및 고급단계의 플레이어에 맞는 맞춤형 환경을 제공할 수 없고, 방향의 다양성 및 공 토출 속도의 다양성을 만족시키지 못하고 있다. 이에, 볼 라운처(Launcher)의 방향전환 및 속도제어를 통하여 실재감있는 스크린 테니스를 칠 수 있는 시스템의 연구 및 개발이 요구된다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 스크린 테니스장에 구비된 볼 라운처의 방향전환 및 속도제어를 통하여 초급에서 고급 까지 사용자의 실력에 맞춤형으로 플레이를 할 수 있도록 도와주고, 원격 플레이어와 연결을 통하여 원격지에 있는 상대방과 함께 O2O(Online to Offline)으로 게임을 즐길 수 있도록 하며, 인공지능 기반 가상 플레이어를 통하여 실제 상대방이 없더라도 상대방과 대전을 하는 것과 같은 실재감을 제공할 수 있는, 실내 스크린 테니스 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기 술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 사용자로부터 연습모드 및 게 임모드를 포함하는 적어도 하나의 플레이 모드를 입력받고, 사용자의 실력을 초급, 중급 및 고급을 포함하는 레 벨로 입력받으며, 입력된 적어도 하나의 플레이 모드 및 레벨에 대응하도록 볼 라운처(Ball Launcher)의 속도 및 방향을 조절하는 센터 단말 및 센터 단말을 등록하는 등록부, 연습모드 및 게임모드를 포함하는 적어도 하나 의 플레이 모드를 설정하는 설정부, 적어도 하나의 플레이 모드 및 적어도 하나의 레벨에 대응하는 볼 라운처의 속도 및 방향을 세팅하는 세팅부, 사용자 단말에서 적어도 하나의 플레이 모드 및 레벨을 입력하는 경우, 적어 도 하나의 플레이 모드 및 레벨에 대응하도록 볼 라운처를 제어하는 제어부를 포함하는 테니스 서비스 제공 서 버를 포함한다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 스크린 테니스장에 구비된 볼 라운처의 방향전환 및 속도제어를 통하여 초급에서 고급까지 사용자의 실력에 맞춤형으로 플레이를 할 수 있도록 도와주고, 원격 플레 이어와 연결을 통하여 원격지에 있는 상대방과 함께 O2O(Online to Offline)으로 게임을 즐길 수 있도록 하며, 인공지능 기반 가상 플레이어를 통하여 실제 상대방이 없더라도 상대방과 대전을 하는 것과 같은 실재감을 제공 할 수 있다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1 을 참조하면, 실내 스크린 테니스 서비스 제공 시스템은, 적어도 하나의 사용자 단말, 테니스 서비스 제공 서버, 적어도 하나의 상대방 단말, 적어도 하나의 센터 단말을 포함할 수 있다. 다만, 이 러한 도 1의 실내 스크린 테니스 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 테니스 서비스 제공 서버와 연 결될 수 있다. 그리고, 테니스 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말 , 적어도 하나의 상대방 단말, 적어도 하나의 센터 단말과 연결될 수 있다. 또한, 적어도 하나 의 상대방 단말은, 네트워크를 통하여 테니스 서비스 제공 서버와 연결될 수 있다. 그리고, 적 어도 하나의 센터 단말은, 네트워크를 통하여 적어도 하나의 사용자 단말, 테니스 서비스 제공 서버 및 적어도 하나의 상대방 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 실내 스크린 테니스 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 센터 단말과 연결되는 플레이어의 단말일 수 있다. 사용자 단말은 상대방 단 말로 대진요청을 전송할 수 있고, 스크린 테니스를 진행한 결과를 분석한 보고서를 테니스 서비스 제공 서버로부터 수신하여 출력하는 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 테니스 서비스 제공 서버는, 실내 스크린 테니스 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이 션을 제공하는 서버일 수 있다. 그리고, 테니스 서비스 제공 서버는, 적어도 하나의 센터 단말과 연 결되어 볼 라운처, 조명 및 팬(Fan) 등을 구동하는 서버일 수 있다. 또한, 테니스 서비스 제공 서버는, 적어도 하나의 플레이 모드 및 레벨에 따라 서로 다른 공의 방향, 속도 및 높이를 가지도록 볼 라운처를 제어하 거나 센터 단말을 통하여 볼 라운처를 제어하도록 하는 서버일 수 있다. 그리고, 테니스 서비스 제공 서 버는, 유명 프로 선수의 타격 데이터를 학습 및 검증함으로써 모델링하고, 사용자가 센터 단말로 원 하는 프로 선수를 입력한 경우, 프로 선수의 타격 데이터에 따라 볼 라운처를 구동시키는 서버일 수 있다. 여기서, 테니스 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 상대방 단말은, 실내 스크린 테니스 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 사용자 단말의 대진요청을 승낙하는 상대방의 단말일 수 있다. 여기서, 적어도 하나의 상대방 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 상대방 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 상대방 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 적어도 하나의 센터 단말은, 실내 스크린 테니스 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플 리케이션을 이용하여 테니스 서비스 제공 서버로부터 볼 라운처, 조명 및 팬 등의 제어 데이터를 수신하고 이에 대응하도록 각 구성요소를 제어하는 스크린 테니스 센터의 단말일 수 있다. 센터 단말은 각 테니스 코트마다 배치되어 사용자의 선택을 입력받는 단말일 수 있고, 선택에 따른 데이터를 테니스 서비스 제공 서버 로 업로드하고, 테니스 서비스 제공 서버로부터 제어 데이터를 수신하는 단말일 수 있다. 여기서, 적어도 하나의 센터 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 센터 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 센터 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다.도 2는 도 1의 시스템에 포함된 테니스 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 테니스 서비스 제공 서버는, 등록부, 설정부, 세팅부, 제어부, 방 향조절부, 객체설정부, 원격대진부, 인공지능대진부, 분석결과제공부, 팬구동부 , 조명구동부, 프로구현부 및 매칭부를 포함할 수 있다. 본 발명의 일 실시예에 따른 테니스 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 사용자 단말, 적어도 하나의 상대방 단말 및 적어도 하나의 센터 단말로 실내 스크린 테 니스 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 사용자 단말 , 적어도 하나의 상대방 단말 및 적어도 하나의 센터 단말은, 실내 스크린 테니스 서비스 애플 리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스 크립트를 이용하여 서비스 프로그램이 적어도 하나의 사용자 단말, 적어도 하나의 상대방 단말 및 적 어도 하나의 센터 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여 주는 프로그램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러(Explorer), 크롬(Chrome) 등을 포함한 다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의미하며, 예를 들어, 모바일 단말(스마트 폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 등록부는, 센터 단말을 등록할 수 있다. 이때, 센터 단말은 각 가맹점별로 위치한 중앙 키오스크나 POS 등의 단말일 수도 있고, 각 테니스 코트, 즉 스크린 테니스의 각 구역별로 배치된 키오스크 등의 장치일 수도 있다. 설정부는, 연습모드 및 게임모드를 포함하는 적어도 하나의 플레이 모드를 설정할 수 있다. 세팅부 는, 적어도 하나의 플레이 모드 및 적어도 하나의 레벨에 대응하는 볼 라운처의 속도 및 방향을 세팅할 수 있다. 테니스 훈련용 장치는 정지한 사용자에게 공을 서브하는 기능, 움직이는 사용자의 방향에 맞춰 공을 보 내거나, 반대 방향으로 공을 보내 운동 효과를 높이는 기능으로 구성될 수 있다. 볼 라운처는 크게 발사각도의 조절을 위한 팬 틸트 기능과, 공압 조절을 통한 발사 실린더, 공을 공급하는 호퍼 장치로 구성될 수 있다. 테 니스볼을 발사하여 목표 지점에 근접하게 하기 위해서는, 발사체인 테니스볼의 최종 발사 속도 및 각도 조절이 필수적이다. 이를 위해 좌우 및 상하 이동이 가능한 팬틸트 기반의 장치를 설계할 수 있다. 볼 라운처는 발사 체인 테니스볼의 질량이 약 56~ 59.4g의 표준을 따르고 있어 질량에 의한 부하가 적은 반면, 발사시 최대 시속 170km/h에 해당하여 발사 시의 충격량이 높은 특징을 갖는다. 목표 지점에 공을 떨어트리기 위해서 초기 발사 속도와 발사 각도로 거리가 결정되기 때문에, 각 파라미터에 대한 민감도는 이하의 수학식 1로 결정할 수 있다. 수학식 1"}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "거리 x는 시간 t에 대해 초기 발사속도 v0와 각도 θ로 표현하는 경우, 발사 속도는 거리와 선형적 관계이며, 발사각이 작을수록 사인 함수에 의해 거리에 대한 민감도가 증가하는 것을 의미한다. 이에 따라, 공압의 크기 를 조절하는 공압 레귤레이터의 해상도 한계 및 비선형성을 고려하여, 수학식 1과 같이 발사 거리 제어를 발사 각도에 초점을 맞추어 설계할 수 있다. <공압 기반의 발사 장치 및 속도 제어> 테니스 서브의 경우 최근 최대 시속 260km/h에 육박하고 있으나, 숙련자를 대상으로 고려하여 최대 시속 170km/h를 목표로 설정할 수 있고 이보다 더 낮게 설정할 수도 있다. 공압 실린더를 이용하여 두 개의 밸브를 제어하여, 입력 밸브, A를 열어 공기를 고압으로 투입하고 이후 밸브를 닫고 출력 밸브, B를 열어 역방향으로 실린더를 이송하는 방식을 이용할 수 있다. 두 개의 입출력 밸브 사이의 시간 조절을 통해, 공기 압축기의 압 력이 정압상태를 유지하는 동안 최대 1초에 2번 이상의 발사가 가능하도록 설계할 수 있다. 발사 속도의 제어 는 디지털 방식의 공압 레귤레이터를 통해 실린더 내부의 공기 압력량을 조절하고 압력에 따라 발사 속도를 제어하는 방식을 사용할 수 있다. 볼 라운처가 초당 최대 1~2회 발사가 가능하도록, 발사 대기 시의 정압 유지에 적합하도록 설계할 수 있다. 볼 라운처의 수행 태스크는 비교적 단순한 구조로 되어 있으나, 센터 단말과 연결되는 소프트웨어 구조는 전형적인 지능형 로봇의 개발 과정 및 구조와 동일하다. 센서에 의한 신호 검출 및 제어 과정을 처리하는 하드 웨어 계층, 영상을 이용하여 사용자 위치 검출 및 GMM(Gaussian Mixture Model, 칼만 필터 기반 연산을 수행하 는 서비스 계층, 사용자 상호작용을 위한 무선 단말 기반의 인터페이스 계층으로 구성될 수 있다. 볼 라운처의 경우, 물리적 구동에 따른 하드웨어 동작이 필수적이다. 각도 세팅을 위한 초기화, 발사 시 실린더 움직임이 이에 해당한다. 기능의 수정을 위해서는, 반복적인 초기화 및 내부 상태량의 복귀가 필요하나 이는 하드웨어의 재설정에 따른 반복된 물리적 구동에 따른 시간 소비가 매우 크다. 이에 따라, 볼 라운처의 하드웨어 상태량을 보존하는 하드웨어 계층과 서비스 계층을 분리하고, 서비스 계층의 잦은 기능 수정의 편의를 위해 온라인 상태 의 시스템 통합 방식을 이용할 수 있다. 해당 서비스 계층을 분리하여, 주요 태스크 처리를 위한 태스크 계층 과 임베디드 파이썬 기반의 스크립트처리 계층으로 구성할 수 있다. 임베디드 파이썬은 파이썬 코드의 수정 및 동작으로 구성된 인터프리터 기능을 기존 응용프로그램에 직접 탑재하는 방식을 말한다. 계층화 및 스크립트 기반의 온라인 시스템을 구성함에 따라 하드웨어 상태량이 유지한 상태로 스크립트를 수정가능하게 되어 제어 파라미터 수정, 위치 추적에 따른 로봇 반응 조절 등의 개발 편의성이 확보될 수 있다. 볼 라운처의 경우, 예 를 들어, 하드웨어 제어를 위해서 STM32기반의 마이크로프로세서를 이용할 수 있고, 영상 처리 및 파이썬 기반 운영은 소형 임베디드 보드인 Rapsberry Pi를 이용할 수 있다. 스크린 테니스 환경에서의 위치 추적 기능은, 카메라 위치를 변경하며 수행할 수 있다. 깊이 방향 변화에 따른 사용자 위치의 차이를 크게 하기 위해 카메라 의 위치를 낮게 변경하여 적용할 수 있다. 또한, 공과 실린더 사이의 유격에 따른 공압 누수와 발사 거리의 오 차 문제를 PID 제어를 통하여 해결할 수 있도록 한다. 제어부는, 사용자 단말에서 적어도 하나의 플레이 모드 및 레벨을 입력하는 경우, 적어도 하나의 플 레이 모드 및 레벨에 대응하도록 볼 라운처를 제어할 수 있다. 센터 단말은, 사용자로부터 연습모드 및 게임모드를 포함하는 적어도 하나의 플레이 모드를 입력받을 수 있고, 사용자의 실력을 초급, 중급 및 고급을 포함하는 레벨로 입력받을 수 있다. 또, 센터 단말은, 입력된 적어도 하나의 플레이 모드 및 레벨에 대응 하도록 볼 라운처(Ball Launcher)의 속도 및 방향을 조절할 수 있다. 방향조절부는, 볼 라운처의 방향이 적어도 하나의 플레이 모드 및 레벨에 대응하도록 상하좌우 이동되도록 제어할 수 있다. 상술한 팬틸트 기반의 상술한 볼 라운처 외의 다양한 볼 라운처를 이용할 수도 있다. 객체설정부는, 볼 라운처의 상하좌우 이동에 따라 볼이 토출되는 홀(Hole)이 스크린에 대응되도록 생성되 고, 볼 라운처의 방향에 따라 홀에 대응하는 위치에 스크린 테니스 콘텐츠의 상대방 객체가 위치하도록 설정할 수 있다. 더 나아가, 스크린에 표시되는 테니스 콘텐츠 내 상대방 객체가 볼을 추적하고 상대방 객체가 볼의 위치가 예측된 지점으로 이동하도록 하기 위해서는, 볼의 추적 및 볼 궤적의 예측이 요구된다. 이때, 스크린 테니스에서는 실제 테니스를 치는 것과 같이 상대방 객체가 볼을 따라가도록 공의 궤적을 분석 및 예측하지만, 이후 테니스 로봇이 출시되는 경우 공의 궤적을 분석 및 예측함으로써 실제 사람과 로봇 간 테니스 경기가 가능 해지게 되는 발판을 마련할 수 있게 된다. 이때, 테니스볼과 같이 작고 빠른 객체는 영상에서 왜곡이 발생하여 인공지능을 통한 객체 검출이 어렵기 때문에 배경제거 알고리즘을 더 이용할 수도 있다. 다만, 스크린 테니스 장에서는 적용하기 적당하겠지만 이후 로봇을 이용하여 실제 대진을 하는 경우 실제 테니스장에서는 다양한 이 동객체로 인하여 노이즈가 발생할 수 있으므로, 이러한 상황까지 고려하여 테니스볼을 추적하기 위해 배경이 제 거된 이미지에 모폴로지 연산을 적용하여 노이즈를 제거하고 YOLO와 무향칼만필터를 이용한 객체추적솔루션을 더 이용할 수도 있다. <객체추적> ① 배경제거 알고리즘은 영상에서 이전 프레임과 현재 프레임 간의 픽셀 명도 차이를 이용하여 변화가 있는 영 역을 얻는 알고리즘이다. 명도차이가 발생한 픽셀은 흰색으로 표현되고 차이가 없는 픽셀은 검정으로 표현되어 이진화 이미지를 얻는다. ② 그 다음은 모폴로지 연산 및 라벨링의 과정을 수행하는데, 이진화 이미지는 볼을 포함하여 다양한 이동객체의 픽셀 정보를 가지고 있다. 그 중 공을 추적하기 위해 공 이외의 다른 객체에 대한 픽셀은 제거하는 전처리가 필요한데, 모폴로지 침식(Erosion) 연산을 통해 불필요한 작은 픽셀을 제거하고 팽창 (Dilation) 연산을 사용하여 사람과 테니스볼의 픽셀을 팽창시킬 수 있다. 이후 인접한 픽셀을 하나의 그룹으 로 만들기 위해 연결요소 라벨링 알고리즘(Connected Component Labeling Algorithms)을 이용할 수 있다. 이 알고리즘은 각 픽셀에서 이웃한 8 개의 픽셀이 연결되어 있을 경우 하나의 라벨을 부여한다. 이 과정을 반복하여 다수의 픽셀 그룹이 생성되고, 이 그룹들을 볼의 후보군으로 정의한다. ③ YOLO(You Only Look Once) 알고리즘은 객체 탐지와 분류를 하나의 과정으로 동작하는 실시간 객체 인식 인공 신경망이다. 신경망 모델을 통해 이미지 그리드 셀로 분할하고 사전에 정의된 앵커 박스(Anchor Box)를 각 셀 마다 배치하여 객체 종류, 위치 그리고 경계 박스의 크기를 예측한다. 본 발명의 일 실시예에서는 YOLO를 통해 얻은 사람의 경계박스와 볼 후보 영역에 대해 IOU(Intersection Over Union)를 계산할 수 있다. IOU 는 이 미지에서 서로 다른 경계박스가 겹쳐진 영역과 두 박스의 전체 영역에 대한 비율이다. IOU 를 통해 테니스볼 후보에서 사람의 움직임으로 생성된 후보를 제외할 수 있다. 테니스볼 추적을 위해 ④ 무향칼만필터(Unscented Kalman Filter)를 이용할 수 있다. 무향칼만필터는 비선형 시스템에 측정값과 오차 공분산 행렬을 통해 다음 측정값을 추정하는 알고리즘이다. 측정값은 이미지에서 검출 된 공의 위치 값을 이용하고, 공분산 행렬은 이산 백색 소음과 대각 분산행렬을 이용할 수 있다. 무향칼만필터 시스템 모델의 상태 변수는 이미지에서 객체의 X 축과 Y 축의 위치와 속도로 정의하고 출력함수는 객체의 위치 값을 얻기 위해 정의할 수 있다. 무향칼만필터의 추정값을 현재 프레임에서 공의 위치로 추정한다. 만약 현재 프레임에서 다수의 공 후보가 검출될 경우 무향칼만필터의 추정값과 공 후보 사이의 거리를 계산한다. 이후 가 장 인접한 후보를 공으로 선정하고 나머지 후보는 제거한다. 이후 선정된 공의 위치를 무향칼만필터에 갱신하 여 다음 프레임에서 공의 위치를 추정한다. 이 과정을 반복하여 연속적으로 공을 추적할 수 있고, 이를 기반으 로 이후 로봇을 개발할 때 로봇이 객체추적기반으로 볼의 위치를 예측하여 사람과 테니스 경기를 펼칠 수 있게 된다. 원격대진부는, 사용자의 사용자 단말에서 O2O(Online to Offline) 대결을 요청하는 경우, 적어도 하 나의 상대방 단말 중 사용자 단말과 대결에 응하는 상대방 단말을 추출하고, 상대방 단말 의 센터 단말과 사용자 단말의 센터 단말을 연동하여 O2O 대결이 이루어지도록 연결할 수 있다. 예를 들어, 사용자 단말에서 요청하고 상대방 단말에서 승낙하는 경우, 사용자 단말과 연결되었 던 센터 단말과 상대방 단말에 연결되었던 센터 단말이 연동을 시작할 수 있다. 물론, 동일한 하드웨어 및 소프트웨어로 구비된 센터 단말, 즉 동일한 가맹점의 동일한 컴퓨팅 자원을 가진 것을 가정할 수 있다. 이때, 각 센터 단말에서 수집한 객체, 즉 사용자와 상대방의 움직임 데이터를 상술한 YOLO 등으 로 수집한 후 서로의 스크린에 객체 콘텐츠로 표시해주고, 사용자의 공의 궤적, 속도, 방향, 높이 등을 객체추 적으로 추적함으로써 상대방의 스크린에 표시해줌과 동시에 상대방의 센터 단말로 전달하여 센터 단말 과 연결된 볼 라운처에서 사용자가 친 것과 같은 공의 궤적 및 속도 등으로 볼이 나올 수 있도록 제어할 수 있다. 인공지능대진부는, 센터 단말로 가상 플레이어와 대결을 요청하는 이벤트가 입력된 경우, 기 구축된 인공지능 가상 플레이어를 스크린에 표시하고, 인공지능 가상 플레이어와 대진을 하도록 시뮬레이션을 구동할 수 있다. 이때, 인공지능 가상 플레이어는 다양한 스윙 동작, 타격 패턴 등을 미리 학습 및 검증한 인공지능 가상 플레이어로, 이에 대응하는 결과 동작은 볼 라운처로 최종적으로 구현되게 된다. 분석결과제공부는, 센터 단말로부터 적어도 하나의 카메라를 통하여 수집된 사용자의 플레이 데이터 를 분석하고, 플레이 데이터에 대한 분석 결과를 사용자의 사용자 단말로 전송할 수 있다. 이때, 플레이 데이터를 분석하고 그 결과를 제공하기 위해 테니스 동작을 신경망 기반으로 분석해줄 수 있다. 이러한 신경망 은 후술할 프로구현부에서도 이용되며, 프로선수의 테니스 동작을 그대로 구현하도록 볼 라운처를 제어하 는데 이용될 수 있다. 이를 위하여 신경망 알고리즘은 대표적인 딥러닝 모델 중 하나인 합성곱 신경망 (Convolutional Neural Network, CNN)을 기반으로 하는 경량화된 종단 간(End-to-End) 신경망을 기반으로 할 수 있다. 데이터셋은, 예를 들어, 7 가지의 테니스 동작(백핸드, 포핸드, 서브, 스매시, 슬라이스, 백핸드 발 리, 포핸드 발리) 데이터셋을 구축하여 이용할 수 있다. 데이터셋을 구축하기 위하여 각 프로선수 및 아마추어 선수를 대상으로 경기영상을 수집할 수 있다. 이때, 일 차원의 시계열 데이터인데, 7 가지의 테니스 동작에 대한 다양한 센서 데이터를 수집하기 위해 선수들의 양 손 목과 양 발목에 센서를 부착하여 수집할 수 있다. 부착된 센서는 ST 마이크로일렉트로닉스에서 개발된 STEVAL- STLKT01V1을 이용할 수 있는데, 해당 제품은 20 Hz의 샘플링률(Sampling Rate)를 가진다. 또한, 제품의 3축 (XYZ 축)의 가속도 센서(Accelerometer), 각가속도 센서(Gyroscope), 지자계 센서(Magnetometer)로부터 테니스 동작 데이터셋을 구축할 수 있다. 서로 다른 테니스 동작에 따라 동작 및 준비 과정이 상이하므로, 상대적으로 동작이 긴 테니스 동작(백핸드, 포핸드, 서브, 스매시, 슬라이스)들은 3.2초(64 샘플)의 데이터로 구성되며, 상 대적으로 동작이 짧은 테니스 동작(백핸드 발리, 포핸드 발리)들은 1.6초(32 샘플)의 데이터의 길이를 가질 수있다. 입력 데이터로 상이한 테니스 동작에 대한 여러 기준을 동일하게 구성하기 위해 선수들의 주 사용 손과 발에 대 해 센서들의 위치를 재정렬할 수 있다. 뿐만 아니라, 서로 다른 데이터 길이를 64 샘플로 동일하게 구성하기 위한 전처리 과정을 진행할 수 있고, 해당 전처리 과정은 제로패딩(Zero-padding)기법을 백핸드 발리와 포핸드 발리 동작에 적용하여 다양한 실험 결과를 도출함으로써 모델에 적절한 방법을 확인할 수 있다. 총 N 개의 센 서 특징 중 모델에 가장 적합한 특징을 선별하기 위해 3 축 센서들의 다양한 조합을 통해 실험을 진행할 수 있 다. 신경망 기반의 테니스 동작 분류 연구에서 FCN(Fully Convolutional Network)은 시계열 데이터 분류에 있 어서 강력한 분류 성능을 제공하지만, 높은 분류 성능을 위해 방대한 파라미터의 모델 구조로 설계되며, 이러한 구조는 엣지 컴퓨팅 환경과 같은 제한된 컴퓨팅 리소스에서 낮은 실용성을 가지고 있다. 이에 본 발명의일 실 시예에서는 실제 센터에 활용이 가능하면서도 높은 분류 성능을 유지하는 FCN 기반의 경량화된 신경망 구조를 이용할 수 있다. 컴퓨터 비전 분야에서는 방대한 신경망 모델들을 모바일과 같은 환경에서 구현하기 위해 다양 한 모델 경량화 연구들이 시도되고 있다. 대표적으로, MobileNetV2는 기존의 Convolution 연산을 Separable Convolution Block으로 대체함으로써 모델의 파라미터와 분류 성능의 두 가지 측면에서 모두 우수함을 입증했는데, 이에 기반하여 일반적인 FCN 구조에 Separable Convolution Block을 적용함으로써 모델의 경량화를 시도할 수 있다. 뿐만 아니라, 데이터 분석 측 면에서도 Separable Convolution Block을 활용하여 입력 데이터에서 센서 측면의 독립된 Convolution 연산을 수행하는 Depthwise Convolution 연산을 통해 효과적으로 센서별 특징을 추출할 수 있고, 그 후 Pointwise Convolution 연산을 통해 입력 데이터의 채널 차원에서의 선형 결합을 진행할 수 있다. 결과적으로 일반적인 Convolution 연산과 비교하여 연산 복잡도가 약 k2배 개선되는 결과를 볼 수 있다. 본 발명의 일 실시예에 따 른 신경망은 특징 추출을 위해 3 계층의 Separable Convolution Block으로 구성되고 각각의 컨볼루션 블록의 입 력 채널 수가 설정될 수 있고, Expansion Ratio와 커널 사이즈를 가질 수 있다. 그 뒤에 하나의 GAP(Global Average Pooling)와 전연결층(Fully Connected Layer)은 테니스 동작 분류를 위해 적용될 수 있다. 모델의 정 규화를 높이기 위해 추가적으로 Dropout과 Label Smoothing이 적용될 수 있다. 물론, 상술한 방법 이외에도 다 양한 방법으로 데이터셋을 구축하고 분석을 하며 후술할 프로선수의 타격과 동일한 타격을 가지는 동작과 같이 볼 라운처를 구동할 수 있음은 물론이라 할 것이다. 팬구동부는, 센터 단말에서 사용자가 원하는 테니스장을 입력한 경우, 테니스장의 풍향 데이터 및 풍 속 데이터를 실시간으로 수집하고, 센터 단말과 연동된 적어도 하나의 팬(Fan)을 구동시켜 사용자가 선택 한 테니스장의 실외환경을 구현할 수 있다. 조명구동부는, 센터 단말에서 사용자가 원하는 테니스장 을 입력한 경우, 테니스장의 광량 데이터를 실시간으로 수집하고, 센터 단말과 연동된 조명의 조도 및 휘 도를 조절함으로써 사용자가 선택한 테니스장의 실외환경을 구현할 수 있다. 예를 들어, 세렝게티 국립 공원, 탄자니아의 야외테니스장을 선택한 경우, 실시간 현지 날씨 데이터를 수집한 후, 풍속, 풍향, 자외선 지수, 광 량 등을 그대로 표현해줄 수 있다. 물론, 각 스크린 테니스장의 특성상 온도를 높이는 경우 그 옆 자리에까지 영향을 미칠 가능성이 크므로, 온도의 조절은 하지 않지만, 만약 각각의 구역이 막힌 스크린 테니스장의 경우 히터나 냉방기를 구비하여 온도 및 습도를 증감시킬 수도 있다. 습도는 가습기, 온도는 에어컨 및 히터를 이용 할 수 있다. 프로구현부는, 적어도 하나의 프로 테니스 플레이어의 경기 영상을 수집하여 각 선수별 타격 데이터를 패 턴화하고, 센터 단말로 사용자가 대진을 원하는 선수를 선택한 경우, 타격 데이터에 대응하도록 볼 라운처 를 구동시킬 수 있다. 매칭부는, 타격 데이터를 패턴화할 때, 선수의 상대방의 이전 타격 데이터와 선수 의 현재 타격 데이터를 매칭하여 쌍을 이루도록 데이터셋을 구축하고, 사용자의 타격 데이터가 선수의 상대방의 이전 타격 데이터와 기 설정된 유사도가 초과할 경우, 선수의 상대방의 이전 타격 데이터와 매칭된 선수의 현재 타격 데이터에 대응하도록 볼 라운처를 구동시킬 수 있다. 예를 들어 프로 A와 상대방 B가 대진하는 경기의 데이터셋을 구축한다고 가정하면, B의 타격, 즉 테니스볼을 치 는 방향, 속도, 궤적, 높이 등의 정보가 존재하고, 이에 대응하여 테니스볼을 치는 프로 A의 방향, 속도, 궤적, 높이 등의 정보가 존재할 수 있다. 이를, [이전 데이터-현재 데이터]로 저장하는데, [B의 타격 데이터-A의 타 격 데이터]로 매핑하여 저장함으로써, 사용자가 B의 타격 데이터와 유사한 방향, 속도, 높이 및 궤적의 타격 데 이터를 제공했다면, 즉 B와 유사하게 테니스볼을 쳤다면, 이에 대응하는 프로 A의 타격 데이터, 즉 방향, 속도, 높이 및 궤적으로 테니스볼이 출력되도록 볼 라운처를 구동할 수 있다. 이하, 상술한 도 2의 테니스 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설 명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3a를 참조하면, (a) 테니스 서비스 제공 서버는 게임 콘텐츠를 설정하고, 연습모드 및 게임모드를 포함 하는 적어도 하나의 플레이 모드와, 초급, 중급 및 고급을 포함하는 적어도 하나의 레벨에 따른 볼 라운처의 속 도 및 방향의 데이터를 각각 데이터베이스화할 수 있다. (b)와 같이 사용자가 센터 단말을 이용하여 원하 는 게임모드와 레벨을 설정하면 이에 대응하는 게임 콘텐츠와 볼 라운처의 제어 데이터를 추출하고, 이에 대응 하도록 볼 라운처를 제어하게 된다. (c)와 같이 원격의 상대방과 사용자가 서로 O2O로 대결을 펼칠 수도 있고 이를 위하여 각 센터 단말이 연동되어 각 센터 단말에서 상호 간의 볼의 궤적 및 속도를 실시간으로 예측하여 상호 간에 전달함으로써 볼 라운처가 상대방의 스윙과 같이 볼을 토출할 수 있도록 제어할 수 있다. (d)와 같이 인공지능 가상 플레이어를 이용하여 대결을 펼칠 수 있도록 볼 라운처를 제어할 수도 있고, 도 3b의 (a)와 같이 사용자가 원하는 테니스장의 환경을 그대로 재현해줄 수도 있으며, (b)와 같이 유명 프로선수의 타 격패턴을 수집, (c) 데이터셋 구축을 한 후 인공지능으로 학습 및 검증하도록 함으로써, (d)와 같이 사용자가 스윙을 하여 타격 데이터가 생성되면, 생성된 타격 데이터에 대응하는 프로선수의 타격 데이터와 같이 볼 라운 처가 볼을 토출할 수 있도록 제어할 수 있다. 도 4a는 기존의 1 개의 홀에서만 테니스볼이 토출되었지만, 본 발명의 일 실시예에서는 도 4b와 같이 다수의 홀을 형성시키고, 볼 라운처의 팬틸트 기능, 속도 제어 기능 등을 이용하여 상하좌우 방향전환, 높이증감, 궤적조정 및 속도제어를 수행할 수 있다. 이와 같은 도 2 내지 도 4의 실내 스크린 테니스 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 을 통해 실내 스크린 테니스 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 실내 스크린 테니스 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되 는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한"}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 테니스 서비스 제공 서버는, 센터 단말을 등록하고(S5100), 연습모드 및 게임모드를 포함하는 적어도 하나의 플레이 모드를 설정한다(S5200). 또, 테니스 서비스 제공 서버는, 적어도 하나의 플레이 모드 및 적어도 하나의 레벨에 대응하는 볼 라운처의 속도 및 방향을 세팅하고(S5300), 사용자 단말에서 적어도 하나의 플레이 모드 및 레벨을 입력하는 경우, 적어 도 하나의 플레이 모드 및 레벨에 대응하도록 볼 라운처를 제어한다(S5400). 상술한 단계들(S5100~S5400)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5400)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 실내 스크린 테니스 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4 를 통해 실내 스크린 테니스 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 실내 스크린 테니스 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플리 케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플 리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의 해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등 의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수 도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스 제공 방법은 단말 기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2023-0061607", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0061607", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 테니스 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 실내 스크린 테니스 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
