{"patent_id": "10-2020-0010347", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0096833", "출원번호": "10-2020-0010347", "발명의 명칭": "로라 통신망을 이용한 스마트팩토리 다중입출력 원격모니터링시스템", "출원인": "(주)다성테크", "발명자": "조영창"}}
{"patent_id": "10-2020-0010347", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 산업기계의 동작 상태를 나타내는 데이터 수집을 위해 다중 입출력포트가 구비되며, 수집된 데이터를 로라망 통신모듈을 통해 주기적으로 송신하는 적어도 하나 이상의 데이터수집 인터페이스 장치;상기 데이터수집 인터페이스 장치로부터 전송된 데이터를 취합하는 로라망 서버; 및상기 로라망 서버에 접속되어 데이터를 제공받으며, 상기 복수의 산업기계에 대한 동작 상태를 웹 페이지 형태로 제공하는 원격 모니터링 서버;를 포함하는 다중입출력 원격모니터링시스템."}
{"patent_id": "10-2020-0010347", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 데이터수집 인터페이스 장치는,아날로그 산업기기로부터 아날로그 데이터를 입력받기 위한 복수의 아날로그 입력포트;상기 복수의 아날로그 입력포트로 입력되는 데이터가 바이패스되어 출력되는 복수의 아날로그 출력포트;디지털 산업기기로부터 디지털 데이터를 입력받기 위한 복수의 디지털 입력포트;상기 복수의 디지털 입력포트로 입력되는 데이터가 바이패스되어 출력되는 복수의 디지털 출력포트;상기 복수의 아날로그 입력포트 및 상기 복수의 디지털 입력포트로부터 수신된 데이터를 임시저장한 후 상기 로라망 통신모듈 및 지그비 통신모듈 중 적어도 어느 하나의 통신모듈을 이용하여 전송하도록 제어하는 제어부;를포함하는 것을 특징으로 하는 다중입출력 원격모니터링시스템."}
{"patent_id": "10-2020-0010347", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터수집 인터페이스 장치는,상기 로라망 서버와 통신장애가 발생할 경우, 전송할 데이터를 임시저장한 후 통신장애 복구시 재전송하거나,이웃한 데이터수집 인터페이스 장치로 전송하는 것을 특징으로 하는 다중입출력 원격모니터링시스템."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "로라 통신망을 이용한 스마트팩토리 다중입출력 원격모니터링시스템은 복수의 산업기계의 동작 상태를 나타내는 데이터 수집을 위해 다중 입출력포트가 구비되며, 수집된 데이터를 로라망 통신모듈을 통해 주기적으로 송신하는 적어도 하나 이상의 데이터수집 인터페이스 장치와, 데이터수집 인터페이스 장치로부터 전송된 데이터를 취합하 는 로라망 서버와, 로라망 서버에 접속되어 데이터를 제공받으며, 복수의 산업기계에 대한 동작 상태를 웹 페이 지 형태로 제공하는 원격 모니터링 서버를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중입출력 원격모니터링시스템에 관한 것으로서, 더 상세하게는 로라(Long Range, LoRa) 통신망을 이용한 스마트팩토리 IoT용 다중입출력 원격모니터링시스템에 관한 것이다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "배경기술", "item": 1, "content": "도 1은 스마트 공장의 개념도이다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "배경기술", "item": 2, "content": "도 1을 참조하면, 스마트공장이란 제품의 전체 생산과정을 사물인터넷, 인공지능, 빅데이터 등 ICT(Information and Communication Technology)로 통합하여 자동화, 디지털화된 공장을 구현하는 기술분야이다. 최소비용 및 시간으로 고객맞춤형 제품을 생산하는 스마트 공장으로 공정자동화 및 다품종 생산에 대응하는 유 연생산체계 등을 통해 생산성향상, 에너지절감, 인간중심의 작업환경 등을 지향하고 있다. 스마트 공장은 제조 애플리케이션(MES, ERP, PLM, SCM등), 산업용 디바이스/네트워크(로봇, 센서, 3D프린팅 등), ICT 플랫폼(CPS, 빅데이터, 네트워크등) 분야 등으로 구분된다. 스마트공장 기능의 기술적 구성요소는 그 성격과 분야에 따라 크게 센서, 디바이스 및 정밀제어기기, 네트워크 플랫폼, 제조환경 애플리케이션 등으로 구분되는데, 각 분야에는 외산 제품 및 솔루션들이 대부분이며 국내업체 들은 주로 이러한 제품과 솔루션들을 도입하는 실정이다. 그러나 지방공업단지의 공장환경을 조사하여 분석한 결과, 일부 대기업을 제외한 중소기업의 경우 공장구성기계 장치의 대부분이 네트워크화가 되어있지 않는 노후기계장비로 실제적인 스마트공장의 실현이 불가능한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2019-0076544 A"}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 기술적 과제를 해결하기 위해 제안된 것으로, 네트워크 및 자동화 설비가 구현되지 않은 노후 공장의 스마트 공장실현에 기반을 둔 다중입출력 원격모니터링시스템을 제공한다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 문제점을 해결하기 위한 본 발명의 일 실시예에 따르면, 복수의 산업기계의 동작 상태를 나타내는 데이터 수집을 위해 다중 입출력포트가 구비되며, 수집된 데이터를 로라망 통신모듈을 통해 주기적으로 송신하는 적어 도 하나 이상의 데이터수집 인터페이스 장치와, 데이터수집 인터페이스 장치로부터 전송된 데이터를 취합하는 로라망 서버와, 로라망 서버에 접속되어 데이터를 제공받으며, 복수의 산업기계에 대한 동작 상태를 웹 페이지 형태로 제공하는 원격 모니터링 서버를 포함하는 다중입출력 원격모니터링시스템이 제공된다. 또한, 본 발명에 포함되는 데이터수집 인터페이스 장치는, 아날로그 산업기기로부터 아날로그 데이터를 입력받 기 위한 복수의 아날로그 입력포트와, 복수의 아날로그 입력포트로 입력되는 데이터가 바이패스되어 출력되는 복수의 아날로그 출력포트와, 디지털 산업기기로부터 디지털 데이터를 입력받기 위한 복수의 디지털 입력포트와, 복수의 디지털 입력포트로 입력되는 데이터가 바이패스되어 출력되는 복수의 디지털 출력포트와, 복수의 아날로그 입력포트 및 복수의 디지털 입력포트로부터 수신된 데이터를 임시저장한 후 로라망 통신모듈 및 지그비 통신모듈 중 적어도 어느 하나의 통신모듈을 이용하여 전송하도록 제어하는 제어부를 포함하는 것을 특징으로 한다. 또한, 본 발명에 포함되는 데이터수집 인터페이스 장치는, 로라망 서버와 통신장애가 발생할 경우, 전송할 데이 터를 임시저장한 후 통신장애 복구시 재전송하거나, 이웃한 데이터수집 인터페이스 장치로 전송하는 것을 특징 으로 한다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따른 다중입출력 원격모니터링시스템은, 네트워크 및 자동화 설비가 구현되지 않은 노후 공 장의 스마트 공장실현에 효과적인 시스템이다.즉, 아직 네트워크 및 자동화 설비가 구현되지 않은 공장기기(산업기계)에 데이터수집 인터페이스 장치를 적용 하여 스마트 공장화를 달성할 수 있다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 정도로 상세히 설명하기 위하여, 본 발명의 실시예를 첨부한 도면을 참조하여 설명하기로 한다. 도 1은 스마트 공장의 개념도이고, 도 2는 본 발명의 실시예에 따른 다중입출력 원격모니터링시스템의 개념 도이고, 도 3은 본 발명의 실시예에 따른 다중입출력 원격모니터링시스템의 구성도이고, 도 4는 데이터수집 인터페이스 장치의 예시도이고, 도 5는 원격 모니터링 서버에서 제공하는 웹 페이지 형태의 정보 예시도이고, 도 6은 다중입출력 원격모니터링시스템의 데이터 전송 예시도이다. 본 실시예에 따른 다중입출력 원격모니터링시스템은 제안하고자 하는 기술적인 사상을 명확하게 설명하기 위 한 간략한 구성만을 포함하고 있다. 도 1 내지 도 6을 참조하면, 다중입출력 원격모니터링시스템은 산업기계, 데이터수집 인터페이스 장치 , 로라망 서버, 원격 모니터링 서버, 단말기를 포함하여 구성된다. 참고적으로, 산업기계 및 데이터수집 인터페이스 장치는 공장의 규모에 따라 복수 개가 각각 설치될 수 있다. 상기와 같이 구성되는 다중입출력 원격모니터링시스템의 주요동작을 살펴보면 다음과 같다. 산업기계는 유압기, 사출기, 팬, 프레스 기계장비 등과 같이 산업 및 제품에 따라 다르지만 통상적으로 수 천만원에서 수억원에 해당하는 제품을 10년~20년의 사용연한을 두고 설비하여 공장을 가동하고 있다. 산업기계는 아날로그 산업기계 및 디지털 산업기기로 구분할 수 있는데, 각각의 산업기계는 동작상태에 대 한 신호를 내부적으로 송수신한다. 데이터수집 인터페이스 장치는 산업기계로부터 데이터를 전송받기 위한 다중 입출력포트가 구비되어 있어서, 입력포트를 통해 산업기계의 동작 상태를 나타내는 데이터 수집할 수 있다. 즉, 산업기계에 동작상태를 출력하는 출력단자가 있을 경우, 출력단자와 데이터수집 인터페이스 장치(20 0)의 입력포트가 서로 연결될 수 있다. 또한, 산업기계에 동작상태를 출력하는 출력단자가 구비되지 않을 경우, 산업기계의 내부단자와 데이 터수집 인터페이스 장치의 입력포트를 서로 연결한 후, 입력포트로 입력되는 데이터가 바이패스되어 출력 되는 데이터수집 인터페이스 장치의 출력포트를 통해 다시 산업기계의 내부단자로 데이터를 전달할 수 있다.이와 같이 다중입출력 원격모니터링시스템에는 적어도 하나 이상의 데이터수집 인터페이스 장치가 구비 될 수 있는데, 데이터수집 인터페이스 장치는 복수의 산업기계의 동작 상태를 나타내는 데이터 수집 을 위해 다중 입출력포트가 구비되며, 수집된 데이터를 로라망 통신모듈을 통해 주기적으로 송신한다. 로라망 서버는 데이터수집 인터페이스 장치로부터 전송된 데이터를 취합한다. 로라망 서버는 이동통신 회사가 구축한 저전력 광대역 통신망으로 정의될 수 있으며, 예를 들어 에스케이 텔레콤이 제공하는 “SKT Thing Plug“가 활용될 수 있다. 도 5는 원격 모니터링 서버에서 제공하는 웹 페이지 형태의 정보 예시도이다. 도 5에 도시된 바와 같이, 원격 모니터링 서버는 로라망 서버에 접속되어 데이터를 제공받으며, 복수 의 산업기계에 대한 동작 상태를 웹 페이지 형태로 제공한다. 단말기는 휴대폰, 스마트폰, 스마트 패드, 개인용 컴퓨터 등과 같은 네트워크 연결이 가능한 기기를 총칭 하는 것이며, 본 실시예에서는 스마트폰으로 구성된 단말기로 가정한다. 따라서 단말기를 이용하는 사용자가 원격 모니터링 서버에 접속하여 외부에서도 복수의 산업기계 에 대한 동작 상태를 웹 페이지에서 확인할 수 있다. 즉, 데이터수집 인터페이스 장치, 로라망 서버 및 원격 모니터링 서버를 이용하여 기존의 산업 기계의 동작상태를 외부에서 모니터링할 수 있는 스마트 공장화된 시스템이 구축되는 것이다. 한편, 도 4의 데이터수집 인터페이스 장치의 예시도를 참조하면, 데이터수집 인터페이스 장치는 복수의 아날로그 입력포트, 복수의 아날로그 출력포트, 복수의 디지털 입력 포트, 복수의 디지털 출력포트, 제어부를 포함하여 구성될 수 있다. 또한, 도면에 미도시되었으나, 지그비 통신모듈이 추가로 구비될 수 있다. 복수의 아날로그 입력포트는 아날로그 산업기기로부터 아날로그 데이터를 입력받기 위한 포트이고, 복수의 아날 로그 출력포트는 복수의 아날로그 입력포트로 입력되는 데이터가 바이패스되어 출력되는 포트이다. 또한, 복수의 디지털 입력포트는 디지털 산업기기로부터 디지털 데이터를 입력받기 위한 포트이고, 복수의 디지 털 출력포트는 복수의 디지털 입력포트로 입력되는 데이터가 바이패스되어 출력되는 포트이다. 제어부는 복수의 아날로그 입력포트 및 복수의 디지털 입력포트로부터 수신된 데이터를 임시저장한 후 로라망 통신모듈 및 지그비 통신모듈 중 적어도 어느 하나의 통신모듈을 이용하여 전송하도록 제어할 수 있다. 따라서 데이터수집 인터페이스 장치는 로라망 서버와 통신장애가 발생할 경우, 전송할 데이터를 임시 저장한 후 통신장애 복구시 재전송하거나, 이웃한 데이터수집 인터페이스 장치로 전송할 수 있다. 특히, 관리자의 단말기의 경우 웹 페이지를 통해 산업기계를 모니터링 하면서 모니터링에 대한 설정 데이터를 제어할 수 있다. 즉, LoRa 통신망을 이용하여 데이터수집 인터페이스 장치의 입력범위를 제어할 수 있다. 또한, 무선망을 통한 신호입력의 범위, 에러값, 이상데이터, 범위 외 데이터를 필터링하는 기능을 원격에서 제 어 가능하다. 또한, 옵션의 선택에 따른 다수의 센서의 입력이 가능하다. 제안된 다중입출력 원격모니터링시스템은 LoRa(원거리통신) 및 근거리통신(ZigBee) 모듈 탑재를 통한 다중연 결이 가능하다. 웹모니터링에서 1개의 LoRa 모듈을 이용하여 다수의 기기와 통신을 통한 모니터링이 가능하며, 코디네이터 기기 (데이터수집 인터페이스 장치) 자체에서 노드기기의 데이터를 저장하고 통신 이상시 이를 복원하여 원격모 니터링 프로그램에 전송하는 기능이 적용될 수 있다. 또한, 원격 모니터링 서버에서는 입력되는 데이터의 취합을 통한 전송 데이터의 상위/하위 레벨값의 자동 변위추출 및 이를 통한 자동설정방법의 적용될 수 있다. 또한, 상용무선통신망인 LoRa 서버(SKT Thing Plug)의 데이터 연속성을 위한 대다수의 기기는 30초 ~ 1분의 딜 레이를 갖는 반면 제안된 원격 모니터링 서버의 경우 데이터 수집시간을 시간대별 데이터 트래픽을 고려하 여 1초 ~ 30초내 SKT LoRa 서버(로라망 서버)와의 동기성을 유지하기위한 Thing Plug 서버 트래픽(전송속 도 모니터링)을 최소화 하는 알고리즘 적용될 수 있다. 즉, LoRa 서버(로라망 서버와의 싱크확인 더미데이 터를 통한 트래픽 감시를 하고, 기기와의 통신시 트래픽(서버딜레이)타임을 프로토콜에 추가할 수 있다. 도 6은 다중입출력 원격모니터링시스템의 데이터 전송 예시도이다. 도 6을 참조하면, 복수의 데이터수집 인터페이스 장치가 구비되어 있다고 가정한다. 각각의 데이터수집 인터페이스 장치는 지그비 통신모듈과, 로라망 통신모듈을 구비하고 있다. 기본적으로 각각의 데이터수집 인터페이스 장치는 자신의 로라망 통신모듈을 통해서 로라망 서버로 데이터를 독립적으로 전송한다. 한편, 원격 모니터링 서버의 관리자 설정 페이지에서 데이터 전송 방식을 변경할 수 는데, 설정방식에 따 라 이웃하는 데이터수집 인터페이스 장치끼리 지그비 통신모듈을 이용하여 상호 간에 데이터를 중계한 후, 가 장 마지막에 데이터를 전송받은 데이터수집 인터페이스 장치가 모든 데이터를 로라망 서버로 전송하 도록 동작할 수도 있다. 이때, 로라망 서버로 데이터를 전송하는 데이터수집 인터페이스 장치가 자동선정되는 방식은 다음과 같다. 우선, 모든 데이터수집 인터페이스 장치가 로라망 서버로 더미 데이터를 전송한 후, 가장 통신상태가 양호한 데이터수집 인터페이스 장치가 선정되고, 선정된 데이터수집 인터페이스 장치가 다른 데이터수집 인터페이스 장치의 데이터를 최종 취합하여 로라망 서버로 전송한다. 이때, 선정된 데이터수집 인터페이스 장치와 로라망 서버 사이의 데이터 전송속도가 설정된 속도 이 하일 경우, 두 번째로 통신상태가 양호한 데이터수집 인터페이스 장치가 데이터를 분산하여 로라망 서버 로 데이터를 전송할 수 있다. 한편, 데이터를 전송할 수 없는 산업기계의 데이터, 예를 들어 산업기계에 표시되는 아날로그 계측값을 측 정하기 위해 다중입출력 원격모니터링시스템에 카메라가 추가될 수 있다. 즉, 카메라에서 촬영된 촬영영상이 데이터수집 인터페이스 장치로 전달되고, 데이터수집 인터페이스 장치 에서 아날로그 계측값을 자동 판독한 후, 로라망 서버를 경유하여 원격 모니터링 서버로 전송될 수 있다. 카메라는 모터를 이용하여 회전(PAN), 방향기울기(TILT),줌(ZOOM) 조정이 가능한 카메라를 통칭한다. 카메라를 특정 각도 및 방향으로 회전시킬 수 있으므로, 복수의 계량기를 선택적으로 모니터링 할 수도 있다.즉, 계량기 하나당 하나의 카메라가 배치될 수도 있고, 하나의 카메라가 촬영방향을 조절하면서 복수의 계량기 를 담당할 수도 있다. 한편, 계량기는 아날로그 또는 디지털 방식으로 측정할 수 있는 기기를 통칭하는 것으로, 카메라가 계량기의 수 치값을 촬영하여 전송한다. 즉, 카메라는 디지털 계량기 경우 숫자영역을 촬영하여 전송하고, 아날로그 계량기의 경우 통상적으로 수치값이 표시되는 원형영역을 촬영하여 전송한다. 아날로그 계량기가 원형태가 아닌 다각형, 직선형 형태일 경우, 다각 형 영역, 직선형 영역을 촬영하여 전송하고 이를 인식하도록 동작한다. 데이터수집 인터페이스 장치가 촬영영상에서 계측값을 추출하는 과정은 다음과 같다. 계량기의 촬영영상 중 수치값이 표시되는 영역을 추출하는 영상추출단계와, 영상추출단계에서 추출된 영역을 정면에서 촬영된 영상으로 시점변환한 후 흔들리는 영상을 안정화시키고, 가변 이진화(Adaptive Thresholding)를 진행하는 전처리 단계와, 전처리 단계에서 처리된 영상에서 소정의 크기로 설정된 탐색 윈도우 내의 픽셀 값의 변화를 감지하여 수치값의 변화를 검출하는 측정단계를 통해서 진행된다. 특히, 측정단계에서는, 수치값을 검출할 때, 초기화가 되어 있으면 수치값을 계속해서 트레킹하고 트레킹이 성 공적일 때 계측 수치값을 최종 검출한다. 이와 달리, 초기화가 되어 있지 않으면 예측(Coarse Estimation) 상태에서 수치값을 트레킹하고 트레킹이 성공 적일 때 수치값을 최종 검출한다. 본 발명의 실시예에 따른 다중입출력 원격모니터링시스템은, 네트워크 및 자동화 설비가 구현되지 않은 노후 공 장의 스마트 공장실현에 효과적인 시스템이다. 즉, 아직 네트워크 및 자동화 설비가 구현되지 않은 공장기기(산업기계)에 데이터수집 인터페이스 장치를 적용 하여 스마트 공장화를 달성할 수 있다."}
{"patent_id": "10-2020-0010347", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이와 같이, 본 발명이 속하는 기술분야의 당업자는 본 발명이 그 기술적 사상이나 필수적 특징을 변경하지 않고 서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적인 것이 아닌 것으로서 이해해야만 한다. 본 발명의 범위는 상기 상세한 설 명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 등가개념으로 부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0010347", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 스마트 공장의 개념도 도 2는 본 발명의 실시예에 따른 다중입출력 원격모니터링시스템의 개념도 도 3은 본 발명의 실시예에 따른 다중입출력 원격모니터링시스템의 구성도 도 4는 데이터수집 인터페이스 장치의 예시도 도 5는 원격 모니터링 서버에서 제공하는 웹 페이지 형태의 정보 예시도 도 6은 다중입출력 원격모니터링시스템의 데이터 전송 예시도"}
