{"patent_id": "10-2023-0123188", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0040309", "출원번호": "10-2023-0123188", "발명의 명칭": "혼잡도 기반 매장 추천 장치 및 방법", "출원인": "건국대학교 글로컬산학협력단", "발명자": "정혜경"}}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "혼잡도 기반 매장 추천 방법에 있어서,사용자 단말로부터 선호 혼잡도를 포함하는 선호 매장 정보를 수신하는 단계;매장 별 소음도 정보를 기반으로 매장 별 혼잡도를 산출하는 단계;상기 매장 별 혼잡도를 기반으로 상기 선호 혼잡도를 충족하는 적어도 하나의 추천 매장을 선정하는 단계; 및 상기 적어도 하나의 추천 매장에 대한 정보를 상기 사용자 단말에 전송하는 단계,를 포함하는 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,매장 단말로부터 주문 정보를 수신하는 단계,를 더 포함하고, 상기 혼잡도를 산출하는 단계는,상기 주문 정보를 더 고려하여 상기 매장 별 혼잡도를 산출하는 것인, 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로부터 상기 복수의 매장 중 상기 복수의 이용객각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신하는 단계,를 더 포함하고,상기 혼잡도를 산출하는 단계는,상기 음향 데이터를 기반으로 상기 매장 별 소음도 정보를 생성하는 것인, 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 선호 매장 정보는,선호 무드 정보 및 조건 정보를 더 포함하는 것이고,상기 적어도 하나의 추천 매장을 선정하는 단계는,상기 선호 무드 정보 및 상기 조건 정보를 더 고려하여 상기 적어도 하나의 추천 매장을 선정하는 것인, 매장추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 적어도 하나의 추천 매장, 상기 사용자 단말에 대응하는 사용자의 방문 이력이 존재하는 방문 매장 및 상기 사용자 단말에 기 저장된 선호 매장 중 적어도 하나에 대한 매장 리스트를 표시하는 사용자 맞춤형 매장 맵을 생성하는 단계,공개특허 10-2025-0040309-3-를 더 포함하고,상기 사용자 단말에 전송하는 단계는,상기 사용자 맞춤형 매장 맵을 상기 사용자 단말을 통해 출력하는 것인, 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 사용자 맞춤형 매장 맵은,상기 매장 리스트에 포함된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사되는 메타버스 기반의 맵 형태로 생성되는 것이고,상기 사용자 맞춤형 매장 맵을 생성하는 단계는,상기 사용자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기반의 가상 객체를 상기 사용자 단말로 수신된 사용자 정보에 기초하여 생성하는 단계,를 포함하는 것인, 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 사용자 맞춤형 매장 맵을 생성하는 단계는,상기 매장 리스트에 포함되어 있는 복수의 매장에 대하여, 중요도를 기반으로 상기 복수의 매장에 따라 색상,형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이하게 설정하는 것인, 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하나의 매장을 상기 사용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단말 간의 소통 기능을 제공하는 커뮤니티를제공하는 단계,를 더 포함하는 매장 추천 방법."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "혼잡도 기반 매장 추천 장치에 있어서,사용자 단말로부터 선호 혼잡도를 포함하는 선호 매장 정보를 수신하는 수신부;매장 별 소음도 정보를 기반으로 매장 별 혼잡도를 산출하는 혼잡도 산출부;상기 매장 별 혼잡도를 기반으로 상기 선호 혼잡도를 충족하는 적어도 하나의 추천 매장을 선정하는 추천 매장선정부; 및상기 적어도 하나의 추천 매장에 대한 정보를 상기 사용자 단말에 전송하는 송신부,를 포함하는 매장 추천 장치."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 수신부는,매장 단말로부터 주문 정보를 수신하는 것이고,상기 혼잡도 산출부는,공개특허 10-2025-0040309-4-상기 주문 정보를 더 고려하여 상기 매장 별 혼잡도를 산출하는 것인, 매장 추천 장치."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 수신부는, 복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로부터 상기 복수의 매장 중 상기 복수의 이용객각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신하는 것이고, 상기 혼잡도 산출부는, 상기 음향 데이터를 기반으로 상기 매장 별 소음도 정보를 생성하는 것인, 매장 추천 장치."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 선호 매장 정보는,선호 무드 정보 및 조건 정보를 더 포함하는 것이고,상기 추천 매장 선정부는,상기 선호 무드 정보 및 상기 조건 정보를 더 고려하여 상기 적어도 하나의 추천 매장을 선정하는 것인, 매장추천 장치."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 적어도 하나의 추천 매장, 상기 사용자 단말에 대응하는 사용자의 방문 이력이 존재하는 방문 매장 및 상기 사용자 단말에 기 저장된 선호 매장 중 적어도 하나의 대한 매장 리스트를 표시하는 사용자 맞춤형 매장 맵을 생성하는 맵 생성부,를 더 포함하고,상기 송신부는,상기 사용자 맞춤형 매장 맵을 상기 사용자 단말을 통해 출력하는 것인, 매장 추천 장치."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 사용자 맞춤형 매장 맵은,상기 매장 리스트에 포함된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사되는 메타버스 기반의 맵 형태로 생성되는 것이고,상기 맵 생성부는,상기 사용자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기반의 가상 객체를 상기 사용자 단말로 수신된 사용자 정보에 기초하여 생성하는 것인, 매장 추천 장치."}
{"patent_id": "10-2023-0123188", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 맵 생성부는,상기 매장 리스트에 포함되어 있는 복수의 매장에 대하여, 중요도를 기반으로 상기 복수의 매장에 따라 색상,형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이하게 설정하는 것인, 매장 추천 장치.공개특허 10-2025-0040309-5-청구항 16 제13항에 있어서,상기 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하나의 매장을 상기 사용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단말 간의 소통 기능을 제공하는 커뮤니티를제공하는 커뮤니티 제공부,를 더 포함하는 매장 추천 장치."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "혼잡도 기반 매장 추천 방법에 관한 것이며, 혼잡도 기반 매장 추천 방법은 사용자 단말로부터 선호 혼잡도를 포 함하는 선호 매장 정보를 수신하는 단계, 매장 별 소음도 정보를 기반으로 매장 별 혼잡도를 산출하는 단계, 상 기 매장 별 혼잡도를 기반으로 상기 선호 혼잡도를 충족하는 적어도 하나의 추천 매장을 선정하는 단계 및 상기 적어도 하나의 추천 매장에 대한 정보를 상기 사용자 단말에 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 혼잡도 기반 매장 추천 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 국내 커피 소비 및 카페 소비가 증가하고 있으며, 이로 인해 커피 전문점 및 커피 메뉴를 판매하는 매장의 수도 증가하고 있다. 또한, 현대인에게 카페는 단순히 차를 마시는 공간을 넘어서, 여가 활동, 공부, 업무, 인 테리어 관람 및 새로운 식/음료 경험을 위한 공간으로 이용되고 있어, 카페 별 분위기 및 컨셉이 다양해지고 있 다. 한편, 사용자들은 카페의 방문 목적, 선호 취향 등에 따라 카페를 선택함에 있어, 수많은 카페의 존재와 부족한 카페에 대한 정보로 인해, 사용자 별 원하는 카페를 찾아 방문하는 것에 어려움이 있을 수 있다. 나아가, 인기 가 많은 카페의 경우 좌석이 부족할 수 있고, 사진 및 텍스트로만 이루어진 리뷰 정보만으로는 해당 카페의 혼 잡도를 파악하기 어려울 수 있어, 사용자가 원하는 카페를 탐색하여 방문하였다 하더라도 카페 이용을 못하거나 불만족스러운 이용을 할 수 있는 단점이 있을 수 있다. 또한, 프랜차이즈뿐 아니라 개인 사업자가 운영하는 중소규모의 카페도 함께 증가하고 있으며, 이러한 중소규모 의 카페의 경우, 비용 및 시간적 제약에 의해 카페에 대한 정보를 제공하기 위한 시스템을 구축하는데 어려움이 있다. 본원의 배경이 되는 기술은 한국공개특허공보 제10-2021-003706호에 개시되어 있다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 카페를 이용하는 이용객 단말을 통해 측정한 카 페의 소음도를 기반으로 카페의 혼잡도를 산출함으로써, 해당 매장의 혼잡도를 실시간에 가깝게 사용자에게 제 공할 수 있어, 사용자가 매장 방문 목적 및 선호 취향에 적합한 매장을 탐색 및 방문할 수 있도록 지원하는 혼 잡도 기반 매장 추천 장치 및 방법을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 추천 매장, 방문 매장 및 선호 매장 등의 매장 리스트를 포함하는 메타버스 기반의 사용자 맞춤형 매장 맵을 제공함으로써, 사용자 별 매장 리스트의 확인 및 관리를 용이하게 제공하는 혼잡도 기반 매장 추천 장치 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 방법 은, 사용자 단말로부터 선호 혼잡도를 포함하는 선호 매장 정보를 수신하는 단계, 매장 별 소음도 정보를 기반 으로 매장 별 혼잡도를 산출하는 단계, 상기 매장 별 혼잡도를 기반으로 상기 선호 혼잡도를 충족하는 적어도 하나의 추천 매장을 선정하는 단계 및 상기 적어도 하나의 추천 매장에 대한 정보를 상기 사용자 단말에 전송하는 단계를 포함할 수 있다. 본원의 일 실시예에 따르면, 매장 단말로부터 주문 정보를 수신하는 단계를 더 포함하고, 상기 혼잡도를 산출하 는 단계는, 상기 주문 정보를 더 고려하여 상기 매장 별 혼잡도를 산출하는 것일 수 있다. 본원의 일 실시예에 따르면, 복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로부터 상기 복수의 매장 중 상기 복수의 이용객 각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신하는 단계를 더 포함하고, 상기 혼잡도를 산출하는 단계는, 상기 음향 데이터를 기반으로 상기 매장 별 소음도 정보를 생성하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 선호 매장 정보는, 선호 무드 정보 및 조건 정보를 더 포함하는 것이고, 상기 적어도 하나의 추천 매장을 선정하는 단계는, 상기 선호 무드 정보 및 상기 조건 정보를 더 고려하여 상기 적어 도 하나의 추천 매장을 선정하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 적어도 하나의 추천 매장, 상기 사용자 단말에 대응하는 사용자의 방문 이력 이 존재하는 방문 매장 및 상기 사용자 단말에 기 저장된 선호 매장 중 적어도 하나에 대한 매장 리스트를 표시 하는 사용자 맞춤형 매장 맵을 생성하는 단계를 더 포함하고, 상기 사용자 단말에 전송하는 단계는, 상기 사용 자 맞춤형 매장 맵을 상기 사용자 단말을 통해 출력하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 사용자 맞춤형 매장 맵은, 상기 매장 리스트에 포함된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사되는 메타버스 기반의 맵 형태로 생성되는 것이고, 상기 사용자 맞춤형 매장 맵 을 생성하는 단계는, 상기 사용자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기반의 가상 객체를 상기 사용 자 단말로 수신된 사용자 정보에 기초하여 생성하는 단계를 포함하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 사용자 맞춤형 매장 맵을 생성하는 단계는, 상기 매장 리스트에 포함되어 있 는 복수의 매장에 대하여, 중요도를 기반으로 상기 복수의 매장에 따라 색상, 형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이하게 설정하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하나의 매장을 상기 사 용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단말 간의 소통 기능을 제공하는 커뮤니티를 제공하는 단계를 더 포함할 수 있다. 상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 장치 는, 사용자 단말로부터 선호 혼잡도를 포함하는 선호 매장 정보를 수신하는 수신부, 매장 별 소음도 정보를 기 반으로 매장 별 혼잡도를 산출하는 산출부, 상기 매장 별 혼잡도를 기반으로 상기 선호 혼잡도를 충족하는 적어 도 하나의 추천 매장을 선정하는 선정부 및 상기 적어도 하나의 추천 매장에 대한 정보를 상기 사용자 단말에 전송하는 송신부를 포함할 수 있다. 본원의 일 실시예에 따르면, 상기 수신부는, 매장 단말로부터 주문 정보를 수신하는 것이고, 상기 산출부는, 상 기 주문 정보를 더 고려하여 상기 매장 별 혼잡도를 산출하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 수신부는, 복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로부 터 상기 복수의 매장 중 상기 복수의 이용객 각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신 하는 것이고, 상기 혼잡도 산출부는, 상기 음향 데이터를 기반으로 상기 매장 별 소음도 정보를 생성하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 선호 매장 정보는, 선호 무드 정보 및 조건 정보를 더 포함하는 것이고, 상기 선정부는, 상기 선호 무드 정보 및 상기 조건 정보를 더 고려하여 상기 적어도 하나의 추천 매장을 선정하는 것 일 수 있다. 본원의 일 실시예에 따르면, 상기 적어도 하나의 추천 매장, 상기 사용자 단말에 대응하는 사용자의 방문 이력 이 존재하는 방문 매장 및 상기 사용자 단말에 기 저장된 선호 매장 중 적어도 하나의 대한 매장 리스트를 표시 하는 사용자 맞춤형 매장 맵을 생성하는 맵 생성부를 더 포함하고, 상기 송신부는, 상기 사용자 맞춤형 매장 맵 을 상기 사용자 단말을 통해 출력하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 사용자 맞춤형 매장 맵은, 상기 매장 리스트에 포함된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사되는 메타버스 기반의 맵 형태로 생성되는 것이고, 상기 맵 생성부는, 상기 사용 자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기반의 가상 객체를 상기 사용자 단말로 수신된 사용자 정보에기초하여 생성하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 맵 생성부는, 상기 매장 리스트에 포함되어 있는 복수의 매장에 대하여, 중요 도를 기반으로 상기 복수의 매장에 따라 색상, 형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이 하게 설정하는 것일 수 있다. 본원의 일 실시예에 따르면, 상기 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하나의 매장을 상기 사 용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단말 간의 소통 기능을 제공하는 커뮤니티를 제공하는 커뮤니티 제공부를 더 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 카페를 이용하는 이용객 단말을 통해 측정한 카페의 소음도를 기반으 로 카페의 혼잡도를 산출함으로써, 해당 매장의 혼잡도를 실시간에 가깝게 사용자에게 제공할 수 있어, 사용자 가 매장 방문 목적 및 선호 취향에 적합한 매장을 탐색 및 방문할 수 있도록 지원할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 추천 매장, 방문 매장 및 선호 매장 등의 매장 리스트를 포함하는 메 타버스 기반의 사용자 맞춤형 매장 맵을 제공함으로써, 사용자 별 매장 리스트의 확인 및 관리를 용이하게 제공 할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 혼잡도 기반 매장 추천 장치에 관한 것이다. 본원에서 설명하는 복수의 매장은 본원의 혼잡도 기반 매장 추천 장치와 연계된 복수의 가맹점을 의미하는 것일 수 있고, 본원에서 설명하는 매장은, 예시적으로 카페일 수 있으나, 이에 한정되는 것은 아니다. 도 1은 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 시스템(이하, '매장 추천 시스템'이 라 한다.)은, 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 장치(이하, '매장 추천 장치'라 한 다.), 사용자 단말, 이용객 단말 및 매장 단말을 포함할 수 있다. 매장 추천 장치, 사용자 단말, 이용객 단말 및 매장 단말 상호 간은 네트워크를 통해 통신 할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미 하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 유 무선 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스(Bluetooth) 네트워크, Wifi 네트워크, NFC(Near Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함될 수 있으나, 이에 한정된 것은 아니다. 또한, 본원의 실시예에 관한 설명에서 사용자 단말, 이용객 단말 및 매장 단말 등을 포함하는 단말은 네트워크를 통해 매장 추천 장치와 연동되는 디바이스로서, 예를 들면, 스마트폰(Smartphone), 스 마트패드(Smart Pad), 태블릿 PC, 웨어러블 디바이스 등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단 말기 같은 모든 종류의 무선 통신 장치 및 데스크탑 컴퓨터, 스마트 TV와 같은 고정용 단말기일 수도 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 사용자 단말로부터 선호 매장 정보를 수신하고, 선호 매장 정보에 기초하여 매장 별 혼잡도를 기반으로 추천 매장을 선정하여 사용자 단말에 제공할 수 있다. 이때, 매장 추천 장치는, 매장 별 이용객의 이용객 단말을 통해 측정된 음향 데이터를 기반으로 혼잡 도 산출에 이용되는 매장 별 소음도 정보를 생성하는 것일 수 있다. 즉, 이용객 단말에 대응되는 이용객 역시 본 매장 추천 장치를 사용하는 사용자일 수 있으나, 본원에 서는 설명의 편의를 위해 추천 매장을 제공 받는 사용자의 단말을 사용자 단말로 특정하고, 매장을 이용하 며 단말을 통해 음향 데이터를 측정하는 사용자(이용객)의 단말을 이용객 단말로 특정하는 것일 수 있다. 또한, 매장 추천 장치는, 매장 별 혼잡도를 산출할 때, 매장 단말로부터 수신되는 주문 정보를 고려 하여 매장 별 혼잡도를 산출하는 것일 수 있다. 이와 관련하여, 매장 추천 장치는, 매장 별 리뷰 정보를 고려하여 매장 별 혼잡도를 산출하는 것일 수도 있다. 또한, 매장 추천 장치는, 선정한 추천 매장을 포함하는 매장 리스트를, 각각의 매장에 대한 실제 환경 정 보를 바탕으로 가상으로 모사되는 메타버스 기반의 사용자 맞춤형 매장 맵에 표시하여, 사용자 단말에 제 공하는 것일 수 있다. 이하에서는, 도 2 내지 도 6을 참조하여 매장 추천 시스템을 통한 혼잡도 기반 사용자 맞춤형 매장 추천 프 로세스, 사용자 맞춤형 매장 맵 제공 프로세스 및 이와 관련한 부가 서비스 제공 프로세스에 대해 상세히 설명 하도록 한다. 도 2는 선호 매장 정보에 대한 사용자 입력이 인가되는 필터 선택 인터페이스를 예시적으로 나타낸 도면이다. 도 2를 참조하면, 매장 추천 장치는, 사용자 단말을 통해 선호 매장 정보에 대한 복수의 선택지를 표 시하고, 복수의 선택지 중 적어도 하나에 대한 선택 입력을 인가 받는 것일 수 있다. 다시 말해, 매장 추천 장 치는, 사용자 단말로부터 선호 매장 정보를 수신하는 것일 수 있다.이때, 선호 매장 정보는, 선호 혼잡도, 선호 무드 정보 및 조건 정보를 포함하는 것일 수 있다. 구체적으로, 선 호 혼잡도는, 도 2에 예시된 바와 같이 소음도로 표현되는 것일 수 있으나, 이에 한정되는 것은 아니며, 매장 추천 장치에서 임의로 분류된 단계적 혼잡도(예를 들어, 1단계, 2단계 등 또는 독서실 수준, 일반 대화 수 준, 도심지 거리 수준 등)로 표현되는 것일 수도 있다. 또한, 선호 무드 정보는, 모던한, 키치한, 앤틱한, 미니멀한, 빈티지한, 레트로한, 작업하기 좋은, 대화하기 좋 은 등을 포함할 수 있고, 조건 정보는, 디저트 맛집, 커피 맛집, 브런치 판매, 노키즈존, 예스키즈존, 펫 동반 가능, 펫 동반 금지 등을 포함할 수 있으나, 이에 한정되는 것은 아니며, 선호 무드 정보 및 조건 정보는 상기 예시 외 다양한 예시를 더 포함할 수 있고, 도 2에 예시된 바와 같이 선호 무드 정보 및 조건 정보는 서로 구분 없이 사용자 단말에 표시되는 것일 수도 있다. 도 2를 참조하면, 매장 추천 장치는, 도 2에 도시한 필터 선택 인터페이스를 통해 추천 매장에 대한 매장 리스트의 정렬 기준에 대한 선택지를 사용자 단말에 더 제공할 수 있다. 정렬 기준은, 도 2를 참조하여 예 시하면, 인기순, 산미 높은, 산미 낮은, 저가순, 리뷰 많은 순, 거리순, 추천순 등을 포함할 수 있고, 필터 기 준으로 영업중, 프랜차이즈인, 프랜차이즈가 아닌, 할인 행사 중인 등을 포함할 수 있다. 이때, 산미 높은, 산 미 낮은, 저가순 등은 매장이 카페일 때, 예시적으로 아메리카노를 대상으로 기준이 나뉘는 것일 수 있으나, 이 에 한정되는 것은 아니다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 사용자 단말로부터 수신한 선호 매장 정보를 고려하 여 복수의 매장 적어도 하나의 추천 매장을 선정할 수 있다. 이때, 매장 추천 장치는, 선호 매장 정보에 포함되는 선호 혼잡도에 충족하는 매장을 추천 매장으로 선정하기 위해, 복수의 매장 각각에 대한 매장 별 혼잡 도 정보를 산출할 수 있다. 도 3은 측정된 음향 데이터를 표시하는 소음도 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 3을 참조하면, 매장 추천 장치는, 복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로 부터 복수의 매장 중 복수의 이용객 각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신할 수 있 다. 구체적으로, 매장 추천 장치는, 이용객 단말에 매장의 음향 데이터를 측정을 실시하기 위한 입력이 인가 될 수 있는 아이콘을 제공하고, 아이콘에 대한 이용객의 입력이 수신되면, 이용객 단말을 통해 이용 객이 현재 방문한 매장에서의 음향 데이터를 획득하는 것일 수 있다. 이때, 매장 추천 장치는, 이용객 단말의 위치 정보를 고려하여 이용객이 실제로 해당 매장에 방문한 상태인지를 판단하고, 이용객의 위치가 해당 매장의 위치와 동일하면, 이용객 단말의 음향 데이터 측정을 허용하는 것일 수 있다. 또한, 매장 추천 장치는, 이용객 단말의 음향 데이터 측정이 허용되어 음향 데이터가 측정되면, 측정된 음향 데이터를 이용객 단말로부터 수신하는 것일 수 있다. 도 3를 참조하면, 매장 추천 장치는, 이용객 단말을 통한 음향 데이터의 측정 시, 음향 데이터를 측 정 중임을 알리는 인터페이스(도 3의 (a) 참조)를 이용객 단말에 제공할 수 있다. 또한, 매장 추천 장치 는, 측정된 음향 데이터(도 3을 참조하여 예시하면 데시벨(dB) 단위의 측정 결과 등) 및 측정된 음향 데이 터의 용이한 식별 및 정도 판단을 돕기 위한 측정된 음향 데이터에 대한 비교 생활 소음과 표정 아이콘을 함께 표시하는 인터페이스(도 3의 (b), (c) 및 (d) 참조)를 이용객 단말에 제공할 수 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 측정된 음향 데이터를 기반으로 매장 별 소음도 정보를 생 성할 수 있다. 구체적으로, 매장 추천 장치는, 이용객 단말을 통해 측정된 음향 데이터로부터 이용객 의 대화 소리를 제거하고, 측정 구간 중 매장 내의 소음도를 평가하기에 적합한 비대화 구간을 특정하여 특정된 비대화 구간에서의 음향 데이터를 이용하여 해당 매장의 소음도 정보를 생성하는 것일 수 있다. 일예로, 매장 추천 장치는, 이용객 단말을 이용하여, 기 설정되어 있는 측정 시간 동안 음향 데이터 를 측정하되, 측정된 전체 측정 구간의 음향을 분석하여, 이용객의 대화 소리 등의 노이즈 구간을 제거하고, 전 체 측정 구간 중 이용객의 대화 소리 및 이용객의 신체가 이용객 단말에 접촉함으로써 발생하는 노이즈 등 의 불필요한 음향 부분이 최소로 포함된 구간을 비대화 구간으로 특정하고, 특정한 비대화 구간의 음향 데이터 만을 이용하여 해당 매장에 대한 소음도 정보를 생성하는 것일 수 있다. 또 다른 예로, 매장 추천 장치는, 이용객 단말을 이용하여, 음향 데이터를 측정하되, 소음도 정보의 생성에 요구되는 최소 구간 이상의 비대화 구간이 측정될 때까지의 시간 동안 음향 데이터의 측정을 지속하고,최소 구간 이상의 비대화 구간이 측정되면 음향 데이터의 측정을 중지하는 것일 수도 있다. 다시 말해, 비대화 구간은, 소음도 정보의 생성에 요구되는 최소 구간 이상으로 긴 시간 동안의 구간일 수 있으 며, 이와 관련하여, 매장 추천 장치는, 비대화 구간이 길수록 정확한 소음도 정보를 생성하는 것일 수 있 다. 또한, 매장 추천 장치는, 이용객 단말뿐 아니라 매장 단말을 통해 음향 데이터를 획득할 수도 있다. 이때, 매장 단말은, 각각의 매장에 설치되어 있는 공유기, 키오스크 및 포스기 등을 포함하는 것일 수 있으나, 이에만 한정되는 것은 아니다. 구체적으로, 매장 추천 장치는, 이용객 단말을 통해 실시간으로 측정되는 음향 데이터의 데이터량 및 음향 데이터의 정확도 중 적어도 하나가 기 설정된 임계 정도에 도달하지 못한 경우, 추가적인 음향 데이터의 획득을 위해, 해당 매장의 매장 단말에 음향 데이터의 측정을 요청하는 요청 정보를 송신할 수 있다. 또한, 매장 추천 장치는, 매장 단말로부터 요청 정보에 대한 수락 입력을 수신하면, 매장 단말 을 통해 음향 데이터를 측정하는 것일 수 있다. 이에 따라, 매장 추천 장치는, 복수의 이용객 단말 각각으로부터 측정되는 각각의 음향 데이터를 이 용하여 복수의 제1소음도 정보를 생성하고, 매장 단말로부터 측정되는 음향 데이터를 이용하여 제2소음도 정보를 생성하며, 생성한 복수의 제1소음도 정보 및 제2소음도 정보를 조합하여 해당 매장에 대한 최종 소음도 정보를 생성하는 것일 수 있다. 이때, 각각의 소음도 정보를 생성하는 과정은 이용객 단말을 통해 측정된 음향 데이터에 대한 소음도 정보 생성 과정과 동일한 것일 수 있다. 또한, 최종 소음도 정보는, 생성된 복수의 제1소음도 정보 및 제2소음도 정보의 평균일 수 있으나, 이에 한정되는 것은 아니며, 각각의 정확도를 기반으로 각각의 가중치를 부여하여 생성되는 것일 수도 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 매장 별 소음도 정보를 기반으로 매장 별 혼잡도를 산출할 수 있다. 매장 추천 장치는, 매장 별 소음도 정보에 따른 소음도가 클수록 해당 매장의 혼잡도를 높은 것으로 산출할 수 있다. 또한, 매장 추천 장치는, 매장 단말로부터 주문 정보를 더 수신하고, 수신한 주문 정보를 더 고려하 여 매장 별 혼잡도를 산출하는 것일 수 있다. 이때, 주문 정보는, 시간대 별 총 주문량, 테이크아웃 주문량 및 매장 내 주문량 등을 포함하는 것일 수 있다. 매장 추천 장치는, 주문 정보를 더 고려하여 총 주문량이 많 을수록, 테이크아웃 주문량 대비 매장 내 주문량이 많을수록 해당 매장의 혼잡도를 높은 것으로 산출할 수 있다. 또한, 매장 추천 장치는, 산출되는 매장 별 혼잡도를 기록 및 저장할 수 있고, 시간대, 요일, 날씨 등 시 간적 요소를 기반으로 이전에 기록 및 저장되어 있는 혼잡도에 대한 통계 정보를 생성할 수 있다. 매장 추천 장 치는, 생성한 통계 정보를 더 고려하여 매장 별 혼잡도를 산출하되, 구체적으로, 혼잡도를 산출하는 현재 시간대와 대응되는 시간대에 대한 통계 정보에 기초하여, 해당 시간대의 평균적인 혼잡도를 획득하고, 획득한 해당 시간대의 평균적인 혼잡도를 고려하여 현재의 혼잡도를 산출하는 것일 수 있다. 또한, 전술한 바와 같이 생성되는 통계 정보는 사용자 단말 및 매장 단말에 제공될 수 있으며, 매장 추천 장치는, 사용자 단말에 대응되는 사용자 및 매장 단말에 대응되는 매장 직원이 시간대 별, 요일 별, 날씨 별 혼잡도가 높을 때와 낮을 때의 확인이 가능하도록 제공할 수 있고, 실시간으로 혼잡도의 산출 을 하지 않고도, 통계적인 측면에서 사용자가 현재의 매장 별 혼잡도를 예상할 수 있도록 지원할 수 있다. 또한, 매장 추천 장치는, 매장 별 리뷰 정보를 더 고려하여 매장 별 혼잡도를 산출할 수 있다. 구체적으로, 매장 추천 장치는, 매장 별 리뷰 정보를 수집하고, 수집한 리뷰 정보로부터 계절, 날짜, 시간, 매장 방문 목적, 이용객 수, 분위기, 매장 공간 크기 및 테이블 수 등에 대한 키워드를 포함하는 문장을 도출하고, 도출된 문장을 입력으로 예상 혼잡도를 산출하도록 학습된 학습 모델을 이용하여 혼잡도를 산출하는 것일 수 있다. 예시적으로, 매장 추천 장치는, 수집한 리뷰 정보로부터 '오늘은 오랜만에 카페에서 공부해서 그런지 공부 가 잘됐어요', '점심시간이 지난 이후라 사람이 너무 많아 주문하기가 좀 힘들었어요', '카페가 굉장히 넓어서 친구들과 부담없이 수다 떨고 놀기 좋았어요' 등의 문장을 도출하고, 학습 모델을 이용하여 해당 매장에 대한 시간대 별 혼잡도를 예상하거나, 해당 매장의 무드, 공간 크기 등을 추정하고 이를 더 고려하여 혼잡도를 예상 할 수 있으나, 이에 한정되는 것은 아니다.이러한 학습 모델은, 예시적으로, 딥러닝 모델, 기계학습(머신러닝) 모델, 신경망 모델(인공 신경망 모델), 뉴 로 퍼지 모델 등을 의미할 수 있다. 본원에서 고려되는 인공지능 모델로는, 컨볼루션 신경망(Convolution Neural Network, CNN, 합성곱 신경망), 순환신경망(RNN, Recurrent Neural Network), 딥 신경망(Deep Neural Network) 등과 같이 종래에 이미 공지되었거나 향후 개발되는 다양한 기계학습을 위한 신경망 모델이 적용될 수 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 매장 별 소음도 정보, 주문 정보, 통계 정보 및 리뷰 정보 각각의 정보량 및 정확도를 고려하여, 매장 별 소음도 정보, 주문 정보, 통계 정보 및 리뷰 정보 각각에 가중치 를 부여하여, 부여한 가중치를 기반으로 매장 별 혼잡도를 산출할 수 있다. 구체적으로, 매장 추천 장치는, 매장 별 소음도 정보, 주문 정보, 통계 정보 및 리뷰 정보 중 정보량이 많 고, 정확도가 높은 정보일수록 해당 정보에 높은 가중치를 부여하는 것일 수 있다. 예시적으로, 특정 매장에 대 하여, 음향 데이터의 측정량이 충분하지 않을 경우, 매장 별 소음도 정보 대비 주문 정보, 통계 정보 및 리뷰 정보에 더 높은 가중치를 부여하여 매장 별 혼잡도를 산출할 수 있고, 해당 매장에 대한 리뷰가 다수 존재하고, 각각의 리뷰 정보에 혼잡도 산출에 이용 가능한 키워드가 다수 포함되어 있는 경우, 리뷰 정보에 매장 별 소음 도 정보, 주문 정보 및 통계 정보 대비 높은 가중치를 부여하는 것일 수 있다. 상술한 바에 따르면, 매장 추천 장치는, 매장 별 소음도 정보를 고려하여 매장 별 혼잡도를 산출함으로써, 해당 매장의 혼잡도를 실시간에 가깝게 획득하여, 사용자 단말에 제공할 수 있으며, 상황에 따라 주문 정 보, 통계 정보 및 리뷰 정보를 더 고려하여 매장의 혼잡도를 산출함으로써, 매장 별 소음도 정보만을 고려하는 것 대비 산출되는 혼잡도의 정확도를 향상시킬 수 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 산출된 매장 별 혼잡도를 기반으로 사용자 단말로부 터 수신한 선호 혼잡도를 충족하는 적어도 하나의 추천 매장을 선정할 수 있다. 다만 이에 한정되는 것은 아니 며, 매장 추천 장치는, 매장 별 혼잡도, 리뷰 정보 및 주 이용객 정보를 더 고려하여, 선호 혼잡도, 선호 무드 정보 및 조건 정보를 포함하는 선호 매장 정보를 충족하는 적어도 하나의 추천 매장을 선정하는 것일 수 있다. 구체적으로, 매장 추천 장치는, 리뷰 정보에 포함되어 있는 매장 방문 목적, 이용객 수, 분위기, 매장 공 간 크기 및 테이블 수 등에 대한 키워드를 도출하여, 해당 매장이 사용자 단말로부터 수신한 선호 무드 정 보 및 조건 정보를 충족하는지 여부를 판단하여, 추천 매장으로의 선정 여부를 결정하는 것일 수 있다. 또한, 매장 추천 장치는, 이용객 단말 및 매장 단말로부터 주 이용객에 대한 연령, 성별, 직업, 이용 목적 등을 포함하는 주 이용객 정보를 더 수신하여, 해당 매장을 주로 이용하는 주 이용객들의 연령, 성별, 직업 및 이용 목적 등을 파악하고, 이를 고려하여 해당 매장에 대한 무드 또는 특징을 예측하는 것일 수 있다. 매장 추천 장치는, 예측된 매장 별 무드 또는 특징을 기반으로 해당 매장이 사용자 단말로부터 수신한 선호 무드 정보 및 조건 정보를 충족하는지 여부를 판단하여, 추천 매장으로의 선정 여부를 결정하는 것 일 수 있다. 이때, 특징은, 선호 매장 정보의 조건 정보에 대응되는 것으로, 디저트 맛집, 커피 맛집, 브런치 판매, 노키즈존, 예스키즈존, 펫 동반 가능, 펫 동반 금지 등을 포함하는 것일 수 있으나, 이에 한정되는 것은 아니다. 상술한 바에 따르면, 매장 추천 장치는, 카페를 이용하는 이용객 단말을 통해 측정한 카페의 소음도를 기 반으로 카페의 혼잡도를 산출함으로써, 해당 매장의 혼잡도를 실시간에 가깝게 사용자에게 제공할 수 있어, 사 용자가 매장 방문 목적 및 선호 취향에 적합한 매장을 탐색 및 방문할 수 있도록 지원할 수 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 선정한 적어도 하나의 추천 매장에 대한 정보를 사용자 단 말에 전송할 수 있다. 도 4는 메타버스 기반의 사용자 맞춤형 매장 맵을 표시하는 맵 표시 인터페이스 및 사용자 맞춤형 매장 맵에 표 시된 매장의 선택에 대한 사용자 입력이 인가되고, 사용자 입력에 따른 매장에 대한 정보를 표시하는 정보 제공 인터페이스를 예시적으로 나타낸 도면이다. 도 4를 참조하면, 매장 추천 장치는, 선정된 적어도 하나의 추천 매장에 대한 매장 리스트를 포함하는 메 타버스 기반의 사용자 맞춤형 매장 맵에 제공함으로써, 추천 매장에 대한 정보를 사용자 단말에 제공하는 것일 수 있다. 또한, 매장 추천 장치는, 추천 매장에 대한 매장 리스트뿐 아니라 사용자의 방문 이력이 존재하는 방문 매 장 및 사용자 단말에 기 저장된 선호 매장 등에 대한 매장 리스트 역시 사용자 단말에 제공 가능한 것일 수 있다. 다시 말해, 매장 추천 장치는, 적어도 하나의 추천 매장, 사용자의 방문 매장 및 선호 매장 중 적어도 하나에 대한 매장 리스트를 표시하는 사용자 맞춤형 매장 맵을 생성하고, 생성한 사용자 맞춤형 매장 맵을 사용자 단말을 통해 출력하는 것일 수 있다. 여기서, 사용자 맞춤형 매장 맵은, 매장 리스트에 포함 된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사되는 메타버스 기반의 맵 형태로 생성되는 것일 수 있 다. 구체적으로, 매장 추천 장치는, 사용자 단말을 통해 음향 데이터의 측정이 수행된 매장, 사용자가 방 문 후 리뷰를 작성했던 매장, 사용자가 매장 추천 장치와 연동되는 일련의 주문 및 결제 프로세스를 통해 주문을 했던 이력이 존재하는 매장 등을 방문 매장으로 판단하고, 이러한 방문 매장에 대한 매장 리스트를 사용 자 맞춤형 매장 맵에 표시할 수 있다. 또한, 도 4의 (a)에 도시한 바와 같이, 매장 추천 장치는, 사용자 단말로부터 복수의 매장 각각에 대 한 저장 입력을 수신할 수 있고, 수신된 저장 입력에 대응하는 해당 매장을 사용자의 선호 매장으로 판단하고, 이러한 선호 매장에 대한 매장 리스트를 사용자 맞춤형 매장 맵에 표시할 수 있다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 추천 매장, 방문 매장 및 선호 매장에 대한 각각의 매장 리스트를 표시하기 위한 항목 선택 아이콘을 제공할 수 있고, 사용자 단말로부터 항목 선택 아이콘 중 적 어도 하나에 대한 매장 리스트만을 사용자 맞춤형 매장 맵에 표시하는 것일 수도 있다. 이때, 매장 리스트의 항 목은 추천 매장, 방문 매장 및 선호 매장에 한정되는 것은 아니며, 사용자가 직접 설정한 추가 항목을 더 포함 하는 것일 수 있다. 구체적으로, 매장 추천 장치는, 사용자 단말로부터 사용자가 원하는 항목의 항목명 및 항목에 포함되 는 매장에 대한 추가 저장 입력을 수신하고, 수신한 항목명과 매장에 대한 추가 저장 입력을 기반으로 추가 항 목 매장에 대한 매장 리스트를 더 생성하여, 사용자 맞춤형 매장 맵에 표시하는 것일 수도 있다. 예를 들어, 사용자가 '디저트 맛집'에 대한 매장 리스트를 생성 및 표시하고자 할 때, 매장 추천 장치는, 사용자 단말로부터 '디저트 맛집'이라는 항목명과, 사용자가 직접 선정하는 특정 매장들에 대한 추가 저장 입력을 수신하고, 추가 저장 입력이 수신된 매장들을 포함하는 '디저트 맛집' 항목에 대한 매장 리스트를 생성 할 수 있다. 또한, 매장 추천 장치는, 새로 생성한 '디저트 맛집' 항목에 대한 항목 선택 아이콘을, 추천 매장, 방문 매장 및 선호 매장에 대한 각각의 항목에 대한 항목 선택 아이콘과 나란히 배치하여 사용자 단말 에 출력함으로써, 사용자가 용이하게 원하는 항목을 선택하여 사용자 맞춤형 매장 맵에 표시하도록 제공할 수 있다. 또한, 매장 추천 장치는, 매장 리스트에 포함되어 있는 복수의 매장에 대하여, 중요도를 기반으로 복수의 매장에 따라 색상, 형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이하게 설정할 수 있다. 이때, 중요도는, 매장 리스트에 대한 항목 별로 상이한 기준으로 설정되는 것일 수 있다. 예를 들어, 표시되는 항목이 추천 매장일 때, 매장 추천 장치는, 인기순 또는 추천순을 기준으로 중요도를 설정하는 것일 수 있고, 표시되는 항목이 방문 매장일 때, 매장 추천 장치는, 사용자의 방문 횟수를 기준 으로 중요도를 설정할 수 있으며, 표시되는 항목이 선호 매장이나, 별도로 추가 생성된 추가 항목 매장일 때, 매장 추천 장치는, 사용자가 설정한 선호도 등을 기준으로 중요도를 결정할 수 있다. 다만, 이에 한정되는 것은 아니며, 매장 추천 장치는, 사용자 단말에 인기순, 산미 높은, 산미 낮은, 저가순, 리뷰 많은 순, 거리순, 추천순 등의 다양한 기준을 제공하고, 제공된 기준에 대한 사용자 설정에 따라 항목 별 상이한, 혹 은 동일한 기준으로 각각의 항목 내의 매장들의 중요도를 결정하는 것일 수 있다. 또한, 매장 추천 장치는, 복수의 항목에 대한 매장 리스트를 사용자 맞춤형 매장 맵에 함께 표시할 수 있 고, 이러한 경우, 각각의 항목에 따라 매장 리스트에 포함되어 있는 복수의 매장의 표시 형태를 서로 상이하게 표시함으로써, 해당 매장이 어떠한 항목에 포함되어 있는지 여부를 사용자가 용이하게 확인할 수 있게 제공할 수 있다. 예시적으로, 매장 추천 장치는, 추천 매장들은 흰색 위치 포인트 형태로 표시하고, 방문 매장들 은 녹색 원형으로 표시하고, 선호 매장들은 황색 별 형태로 표시하는 것일 수 있으나, 이에 한정되는 것은 아니 다. 또한, 도 4의 (a)를 참조하면, 매장 추천 장치는, 사용자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기 반의 가상 객체를 사용자 단말로 수신된 사용자 정보에 기초하여 생성할 수 있다. 이때, 사용자 정보는, 사용자의 연령, 성별, 직업, 매장의 주 이용 목적 등을 포함하는 것일 수 있으며, 선호 매장 정보에 포함되는선호 혼잡도, 선호 무드 정보 및 조건 정보를 더 포함하는 것일 수도 있다. 본원의 일 실시예에 따르면, 가상 객체의 외형은, 사용자의 매장 소비 패턴 및 사용자 설정을 기반으로 설정되 는 것일 수 있다. 매장 추천 장치는, 사용자의 매장 방문 이력, 선호 매장 정보 및 사용자 맞춤형 매장 맵 에 표시하기 위해 생성한 추가 항목의 항목명 등을 고려하여 사용자의 매장 소비 패턴을 분석하고, 분석한 매장 소비 패턴에 기초하여 사용자에 대응되는 가상 객체의 외형을 설정하는 것일 수 있다. 또한, 매장 추천 장치는, 분석한 사용자의 매장 소비 패턴에 기초하여 가상 객체의 기본 외형을 설정하되, 사용자 설정을 더 고려하여 가상 객체의 외형을 기본 외형에서 일부 변형하는 것일 수도 있다. 구체적으로, 사 용자 설정은, 사용자의 연령, 성별, 직업, 매장의 주 이용 목적, 선호 혼잡도, 선호 무드 정보 및 조건 정보 등 을 포함하는 사용자 정보 중 가상 객체의 외형에 반영하고자 하는 정보의 선택에 대한 설정을 의미하는 것일 수 있다. 예시적으로, 매장 추천 장치는, 사용자가 가상 객체의 외형에 성별, 매장의 주 이용 목적 및 선호 무드 정보만을 가상 객체의 외형에 반영하는 것으로 설정한 경우, 사용자의 매장 소비 패턴에 따른 가상 객체의 기본 외형에 사용자의 성별, 매장의 주 이용 목적 및 선호 무드 정보를 반영하여, 가상 객체의 외형을 변경할 수 있다. 다만, 이에 한정되는 것은 아니다. 도 5의 (b) 및 (c)를 참조하면, 매장 추천 장치는, 사용자 단말로부터 사용자 맞춤형 매장 맵에 표시 된 매장 리스트에 포함된 매장 중 어느 하나의 매장에 대한 선택 입력을 수신하면, 선택된 매장에 대한 매장 정 보 및 리뷰 정보를 표시하는 인터페이스를 사용자 단말에 출력하여, 사용자에게 제공할 수 있다. 이때, 매 장 정보는, 매장명, 매장의 대표 무드, 최근 측정된 혼잡도 또는 소음도 정보 및 위치 정보 등을 포함하는 것일 수 있고, 매장의 대표 무드는, 매장 단말을 통해 수신된 것이나, 매장 추천 장치가 리뷰 정보를 기반 으로 분석 및 설정한 것일 수 있으나, 이에 한정되는 것은 아니다. 상술한 바에 따르면, 매장 추천 장치는, 추천 매장, 방문 매장 및 선호 매장 등의 매장 리스트를 포함하는 메타버스 기반의 사용자 맞춤형 매장 맵을 제공함으로써, 사용자 별 매장 리스트의 확인 및 관리를 용이하게 제 공할 수 있다. 또한, 도 4를 참조하면, 매장 추천 장치는, 특정 매장에 대한 정보를 제공하기 위한 검색 기능을 더 제공 하고, 사용자 단말로부터 특정 매장의 매장명을 검색 데이터로서 수신하면, 해당 매장의 위치를 사용자 맞 춤형 매장 맵 상에 표시하고, 해당 매장에 대한 매장 정보 및 리뷰 정보를 출력하여 사용자 단말에 제공하 는 것일 수 있다. 도 5는 원하는 커뮤니티의 선택을 위한 무드 정보 및 조건 정보에 대한 사용자 입력이 인가되는 커뮤니티 선택 인터페이스 및 사용자 별 사용 이력을 표시하는 사용자 정보 표시 인터페이스를 예시적으로 나타낸 도면이다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하나 의 매장을 사용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단 말 간의 소통 기능을 제공하는 커뮤니티를 제공할 수 있다. 매장 추천 장치는, 사용자 단말로부터 사용자가 사용자 맞춤형 매장 맵에 표시하여 공유하고자 하는 적어도 하나의 매장에 대한 선택 입력을 수신하고, 선택된 적어도 하나의 매장을 사용자 맞춤형 매장 맵에 표시 할 수 있다. 또한, 매장 추천 장치는, 적어도 하나의 매장이 표시된 사용자 맞춤형 매장 맵의 공유 여부에 대한 입력을 사용자 단말로부터 더 수신하고, 공유하는 것에 대한 입력을 수신하면, 적어도 하나의 매장이 표시된 사용자 맞춤형 매장 맵을 다수의 사용자 단말이 접속 가능한 커뮤니티 상에 업로드할 수 있다. 또한, 도 5의 (a)를 참조하면, 매장 추천 장치는, 커뮤니티에 검색 기능을 제공하고, 사용자 단말로 부터 공유된 매장 맵에 대한 무드 정보 및 조건 정보를 수신할 수 있다. 매장 추천 장치는, 수신한 무드 정보 및 조건 정보에 기초하여, 타 사용자들에 의해 커뮤니티에 공유되어 있는 복수의 공유 맵 중 적어도 하나 의 공유 맵을 검색하여 사용자 단말에 제공할 수 있다. 또한, 도 5의 (b)를 참조하면, 매장 추천 장치는, 사용자 단말에 제공된 적어도 하나의 공유 맵을 공 유한 타 사용자들 중 어느 하나의 타 사용자에 대한 선택 입력을 사용자 단말로부터 수신할 수 있고, 선택 된 타 사용자에 대한 사용자 정보를 사용자 단말에 일부 제공하는 것일 수 있다. 매장 추천 장치는, 사용자로 하여금 타 사용자에 대한 사용자 정보를 통해, 해당 타 사용자가 생성한 공유 맵에 대한 신뢰 정도를 판단할 수 있도록 제공하는 것일 수 있다. 다만, 타 사용자에 대한 사용자 정보는, 타 사용자 별로 정보의 공개 설정에 따라 해당 사용자에 대한 정보 중 적어도 일부의 정보만을 포함하는 것일 수있으나, 이에 한정되는 것은 아니다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 사용자가 자신의 선호 매장 정보 및 기록 정보를 확인할 수 있도록 '마이 페이지' 인터페이스를 사용자 단말에 더 제공할 수 있고, '마이 페이지' 인터페이스는, 상술한 타 사용자의 사용자 정보를 제공하는 도 5의 (b)와 유사한 레이아웃으로 제공되되, 타 사용자의 사용자 정보와 달리 사용자 단말의 사용자에 대한 모든 정보를 포함하는 것일 수 있다. 이때, 기록 정보는, 사용 자의 방문 이력이 있는 방문 매장, 사용자가 작성했던 리뷰에 대한 리뷰 정보 등을 포함하는 것일 수 있으나, 이에 한정되는 것은 아니다. 본원의 일 실시예에 따르면, 매장 추천 장치는, 매장에 대한 리뷰 작성, 매장에서의 음향 데이터 측정 및 직접 생성한 카페 맵의 공유 중 적어도 하나를 수행하는 사용자 단말에 포인트를 지급할 수 있다. 이와 관련하여, 매장 추천 장치는, 포인트를 지급함으로써, 사용자의 매장에 대한 리뷰 작성 및 매장에서 의 음향 데이터 측정을 유도할 수 있고, 리뷰 정보 및 음향 데이터의 정보량을 증가시켜 매장 별 소음도 생성 및 매장 별 혼잡도 산출의 정확도를 향상시킬 수 있다. 또한, 매장 추천 장치는, 포인트를 지급함으로써, 사용자 별 직접 생성한 카페 맵의 공유를 유도할 수 있고, 이를 통해 커뮤니티를 활성화시키고, 사용자들이 원 하는 카페에 대한 정보를 더욱 용이하게 획득할 수 있도록 도울 수 있다. 또한, 매장 추천 장치는, 지급한 포인트를 이용하여 참여할 수 있는 이벤트 및 할인 혜택을 제공할 수 있 다. 도 6은 이벤트 정보를 제공하는 이벤트 정보 표시 인터페이스 및 주문 정보를 제공하고 주문 정보에 대한 사용 자 입력이 인가되는 주문 정보 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 6의 (a)를 참조하면, 매장 추천 장치는, 매장 추천 장치와 연계된 복수의 매장에 대한 이벤트 정 보를 제공할 수 있다. 이벤트 정보는, 복수의 매장 각각에서 자체적으로 진행하고 있는 이벤트, 할인 행사 등에 대한 정보를 포함하는 것일 수 있고, 지급된 포인트를 이용하여 참여 가능한 이벤트, 할인 행사 등에 대한 정보 를 포함하는 것일 수도 있다. 예시적으로, 매장 추천 장치는, 매장의 메뉴 주문 및 결제 시 포인트를 이용한 결제 기능을 제공할 수 있 고, 포인트를 이용하여 참여할 수 있는 랜덤 쿠폰 뽑기, 직접 설정한 매장 맵 자랑하기 등의 이벤트를 제공할 수 있다. 또한, 매장 추천 장치는, 해당 이벤트를 통해 쿠폰 및 선물 등의 혜택을 제공할 수 있다. 이와 관련하여, 도 6의 (b) 및 (c)에 도시한 바와 같이, 매장 추천 장치는, 사용자 단말에 매장 추천 장치와 연계된 복수의 매장에 대한 주문 및 결제 기능을 더 제공할 수 있다. 매장 추천 장치는, 사용 자 단말로부터 적어도 하나의 매장과 적어도 하나의 메뉴에 대한 선택 입력을 수신하고, 선택된 매장 및 선택된 메뉴에 대한 결제 요청을 사용자 단말에 전송하되, 사용자가 해당 메뉴에 대한 결제를 수행할 때, 지급된 포인트 또는 포인트를 이용하여 참여한 이벤트를 통해 제공 받은 쿠폰 등을 이용하여 결제를 진행할 수 있도록 제공할 수 있다. 도 7은 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 장치의 개략적인 블록도이다. 도 7을 참조하면, 매장 추천 장치는, 수신부, 혼잡도 산출부, 추천 매장 선정부, 맵 생성 부, 송신부 및 커뮤니티 제공부를 포함할 수 있다. 본원의 일 실시예에 따르면, 수신부는, 사용자 단말로부터 선호 혼잡도를 포함하는 선호 매장 정보를 수신할 수 있다. 이때, 선호 매장 정보는, 선호 무드 정보 및 조건 정보를 더 포함하는 것일 수 있다. 또한, 수신부는, 매장 단말로부터 주문 정보를 수신할 수 있다. 또한, 수신부는, 복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로부터 복수의 매장 중 복수의 이용객 각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신하는 것일 수 있다. 본원의 일 실시예에 따르면, 혼잡도 산출부는, 음향 데이터를 기반으로 매장 별 소음도 정보를 생성하고, 매장 별 소음도 정보를 기반으로 매장 별 혼잡도를 산출할 수 있다. 또한, 혼잡도 산출부는, 주문 정보를 더 고려하여 매장 별 혼잡도를 산출하는 것일 수 있다. 본원의 일 실시예에 따르면, 추천 매장 선정부는, 매장 별 혼잡도를 기반으로 선호 혼잡도를 충족하는 적 어도 하나의 추천 매장을 선정할 수 있다. 또한, 추천 매장 선정부는, 선호 무드 정보 및 조건 정보를 더고려하여 적어도 하나의 추천 매장을 선정하는 것일 수 있다. 본원의 일 실시예에 따르면, 맵 생성부는, 적어도 하나의 추천 매장, 사용자 단말에 대응하는 사용자 의 방문 이력이 존재하는 방문 매장 및 사용자 단말에 기 저장된 선호 매장 중 적어도 하나에 대한 매장 리스트를 표시하는 사용자 맞춤형 매장 맵을 생성할 수 있다. 이때, 사용자 맞춤형 매장 맵은, 매장 리스트에 포함된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사 되는 메타버스 기반의 맵 형태로 생성되는 것일 있고, 맵 생성부는, 사용자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기반의 가상 객체를 사용자 단말로 수신된 사용자 정보에 기초하여 생성할 수 있다. 또한, 맵 생성부는, 매장 리스트에 포함되어 있는 복수의 매장에 대하여, 중요도를 기반으로 복수의 매장 에 따라 색상, 형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이하게 설정하는 것일 수 있다. 본원의 일 실시예에 따르면, 송신부는, 선정된 적어도 하나의 추천 매장에 대한 정보를 사용자 단말 에 전송할 수 있다. 또한, 송신부는, 맵 생성부에서 생성한 사용자 맞춤형 매장 맵을 사용자 단말 을 통해 출력하는 것일 수 있다. 본원의 일 실시예에 따르면, 커뮤니티 제공부는, 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하 나의 매장을 사용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단말 간의 소통 기능을 제공하는 커뮤니티를 제공할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 8은 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 방법에 대한 동작 흐름도이다. 도 8에 도시된 혼잡도 기반 매장 추천 방법은 앞서 설명된 혼잡도 기반 매장 추천 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 혼잡도 기반 매장 추천 장치에 대하여 설명된 내용은 혼잡도 기반 매장 추천 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 6을 참조하면, 단계 S11에서 수신부는, 사용자 단말로부터 선호 혼잡도를 포함하는 선호 매장 정 보를 수신할 수 있다. 이때, 선호 매장 정보는, 선호 무드 정보 및 조건 정보를 더 포함하는 것일 수 있다. 또 한, 단계 S11에서 수신부는, 매장 단말로부터 주문 정보를 더 수신할 수 있다. 다음으로, 단계 S12에서 수신부는, 복수의 매장을 이용하는 복수의 이용객의 이용객 단말 각각으로부 터 복수의 매장 중 복수의 이용객 각각이 현재 이용 중인 이용 매장에서 측정된 음향 데이터를 수신하는 것일 수 있다. 다음으로, 단계 S13에서 혼잡도 산출부는, 음향 데이터를 기반으로 매장 별 소음도 정보를 생성하고, 매장 별 소음도 정보를 기반으로 매장 별 혼잡도를 산출할 수 있다. 또한, 단계 S13에서 혼잡도 산출부는, 주문 정보를 더 고려하여 매장 별 혼잡도를 산출하는 것일 수 있다. 다음으로, 단계 S14에서 추천 매장 선정부는, 매장 별 혼잡도를 기반으로 선호 혼잡도를 충족하는 적어도 하나의 추천 매장을 선정할 수 있다. 또한, 단계 S14에서 추천 매장 선정부는, 선호 무드 정보 및 조건 정 보를 더 고려하여 적어도 하나의 추천 매장을 선정하는 것일 수 있다. 다음으로, 단계 S15에서 맵 생성부는, 적어도 하나의 추천 매장, 사용자 단말에 대응하는 사용자의 방문 이력이 존재하는 방문 매장 및 사용자 단말에 기 저장된 선호 매장 중 적어도 하나에 대한 매장 리스 트를 표시하는 사용자 맞춤형 매장 맵을 생성할 수 있다. 이때, 사용자 맞춤형 매장 맵은, 매장 리스트에 포함된 매장 각각의 실제 환경 정보를 바탕으로 가상으로 모사 되는 메타버스 기반의 맵 형태로 생성되는 것일 있고, 단계 S15에서 맵 생성부는, 사용자 맞춤형 매장 맵 상에서 이동 가능한 메타버스 기반의 가상 객체를 사용자 단말로 수신된 사용자 정보에 기초하여 생성할 수 있다. 또한, 단계 S15에서 맵 생성부는, 매장 리스트에 포함되어 있는 복수의 매장에 대하여, 중요도를 기반으로 복수의 매장에 따라 색상, 형상 및 크기 중 적어도 하나를 포함하는 표시 형태를 서로 상이하게 설정하는 것일 수 있다. 다음으로, 단계 S16에서 송신부는, 선정된 적어도 하나의 추천 매장에 대한 정보를 사용자 단말에 전 송할 수 있다. 또한, 단계 S16에서 송신부는, 맵 생성부에서 생성한 사용자 맞춤형 매장 맵을 사용자단말을 통해 출력하는 것일 수 있다. 다음으로, 단계 S17에서 커뮤니티 제공부는, 매장 리스트에 포함되어 있는 복수의 매장 중 적어도 하나의 매장을 사용자 맞춤형 매장 맵에 표시하여 타 사용자와 공유하고, 공유된 매장 맵에 대한 복수의 사용자 단말 간의 소통 기능을 제공하는 커뮤니티를 제공할 수 있다. 상술한 설명에서, 단계 S11 내지 S17은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시 예에 따른 혼잡도 기반 매장 추천 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그 램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명 령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가 능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같 은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의 해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 혼잡도 기반 매장 추천 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또 는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2023-0123188", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2023-0123188", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 시스템의 개략적인 구성도이다. 도 2는 선호 매장 정보에 대한 사용자 입력이 인가되는 필터 선택 인터페이스를 예시적으로 나타낸 도면이다. 도 3은 측정된 음향 데이터를 표시하는 소음도 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 4는 메타버스 기반의 사용자 맞춤형 매장 맵을 표시하는 맵 표시 인터페이스 및 사용자 맞춤형 매장 맵에 표 시된 매장의 선택에 대한 사용자 입력이 인가되고, 사용자 입력에 따른 매장에 대한 정보를 표시하는 정보 제공 인터페이스를 예시적으로 나타낸 도면이다. 도 5는 원하는 커뮤니티의 선택을 위한 무드 정보 및 조건 정보에 대한 사용자 입력이 인가되는 커뮤니티 선택 인터페이스 및 사용자 별 사용 이력을 표시하는 사용자 정보 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 6은 이벤트 정보를 제공하는 이벤트 정보 표시 인터페이스 및 주문 정보를 제공하고 주문 정보에 대한 사용 자 입력이 인가되는 주문 정보 표시 인터페이스를 예시적으로 나타낸 도면이다. 도 7은 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 장치의 개략적인 블록도이다. 도 8은 본원의 일 실시예에 따른 혼잡도 기반 매장 추천 방법에 대한 동작 흐름도이다."}
