{"patent_id": "10-2021-0174155", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0065113", "출원번호": "10-2021-0174155", "발명의 명칭": "복수의 레이어들을 포함하는 하우징 및 이를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "황한규"}}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "폴리머 재질을 포함하는 하우징에 있어서,상기 하우징의 외면의 적어도 일부 상에 배치되고, 난연제 및 디메틸실록산계 물질을 포함하는 제1 레이어; 및상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어; 를 포함하고,상기 난연제는,인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 디메틸실록산계 물질은,폴리디메틸실록산(PDMS, polydimethylsiloxane), 실리콘 고무(silicon rubber), 디메틸실리콘(dimethylsilicone), 시메티콘(simethicone), 메틸실리콘(methyl silicone), 디메티콘(dimethicone) 중 적어도 하나를포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 인계 물질은,적인(red phosphorus), 암모늄 포스페이트(ammonium phosphate), 트리메틸 포스페이트(TMP, trimethylphosphate), 암모늄 폴리포스페이트(APP, ammonium polyphosphate), 트리아릴 포스페이트(TAP,triallylphosphate), 트리페닐 포스페이트(TPP, triphenyl phosphate), 다이페닐 포스페이트(DPHP, diphenylphosphate), 다이메틸 메틸포스포네이트(DMMP, dimethyl methylphosphonate), 트리옥틸 포스페이트(TOP,trioctyl phosphate), 포스파젠(Phosphazene), 멜라민 폴리포스페이트(melamine polyphosphate), 트리크레질포스페이트(TCP, tricresyl phosphate), 트리크실레닐 포스페이트(TXP, trixylenyl phosphate) 및 인 비스(1,3-디클로로 프로필) 포스페이트(BDCPP) 중 적어도 하나를 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 불소계 물질은,폴리테트라플루오르에틸렌(PTFE, polytetrafluoroethylene)을 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 무기 난연제 물질은,공개특허 10-2023-0065113-3-수산화 알루미늄계 물질, 수산화 마그네슘계 물질 및 안티몬계 물질 중 적어도 하나를 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제1 레이어는,상기 제1 레이어의 전체 중량에 대해 5 wt% 이하의 상기 디메틸실록산계 물질을 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제1 레이어는,폴리메틸 메타아크릴레이트(PMMA, polymethyl methacrylate)를 포함하고,상기 제2 레이어는,폴리카보네이트(PC, poly carbonate)를 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 제1 레이어는,상기 하우징이 반투명 또는 불투명한 색상을 가지도록 컬러런트(colorant)를 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 하우징은, 디스플레이가 배치되는 전면, 상기 전면의 반대방향을 향하는 후면 및 상기 전면과 상기 후면 사이에 배치되어내부 공간을 형성하는 측면을 포함하고, 상기 후면과 상기 제1 레이어 사이에 배치되고, 불투명한 재질을 포함하는 차폐층; 을 더 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 차폐층과 상기 제1 레이어 사이에 배치되는 컬러 인쇄층; 을 더 포함하는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 제1 레이어는, UL 94에 의거하여 측정한 난연성이 V-1 또는 V-0 등급을 가지고, 상기 제2 레이어는, UL 94에 의거하여 측정한 난연성이 HB 등급을 가지는, 하우징.공개특허 10-2023-0065113-4-청구항 12 제1항에 있어서,상기 제1 레이어는,상기 제2 레이어의 두께보다 두꺼운 두께를 가지는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 제2 레이어의 경도는,상기 제1 레이어의 경도보다 높은,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 하우징은, 디스플레이가 배치되는 전면, 상기 전면의 반대방향을 향하는 후면 및 상기 전면과 상기 후면 사이에 배치되어내부 공간을 형성하는 측면을 포함하고, 상기 제1 레이어는, 상기 후면 및 측면 상에 배치되는,하우징."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "전자 장치에 있어서,디스플레이가 배치되는 전면, 상기 전면의 반대방향을 향하는 후면 및 상기 전면과 상기 후면 사이에 배치되어내부 공간을 형성하는 측면을 포함하는 하우징; 및상기 내부 공간에 배치되는, 배터리; 를 포함하고,상기 하우징은,상기 후면의 적어도 일부 상에 배치되고, 난연제 및 디메틸실록산계 물질을 포함하는 제1 레이어; 및상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어; 를 포함하고,상기 난연제는,인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함하는,전자 장치."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 후면을 수직으로 바라볼 때,상기 제1 레이어에 의해 커버되는 상기 후면의 영역은, 상기 후면 중 상기 배터리와 중첩되는 영역을 포함하는,전자 장치.공개특허 10-2023-0065113-5-청구항 17 제15항에 있어서,상기 디메틸실록산계 물질은,PDMS(polydimethylsiloxane)를 포함하는,전자 장치."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 제1 레이어는,상기 제1 레이어의 전체 중량에 대해 5 wt% 이하의 상기 디메틸실록산계 물질을 포함하는,전자 장치."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서,상기 제1 레이어는,폴리메틸 메타아크릴레이트(PMMA, polymethyl methacrylate)를 포함하고,상기 제2 레이어는,폴리카보네이트(PC, poly carbonate)를 포함하는,전자 장치."}
{"patent_id": "10-2021-0174155", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제15항에 있어서,상기 제1 레이어는, UL94에 의거하여 측정한 난연성이 V-1 또는 V-0 등급을 가지고, 상기 제2 레이어는, UL94에 의거하여 측정한 난연성이 HB 등급을 가지는, 전자 장치."}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "폴리머 재질을 포함하는 하우징은, 상기 하우징의 외면의 적어도 일부 상에 배치되고, 난연제 및 디메틸실록산계 물질을 포함하는 제1 레이어 및 상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어를 포함하고, 상기 난연제는, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함할 수 있다."}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은, 복수의 레이어들을 포함하는 하우징 및 이를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는, 전력 공급을 위한 배터리를 포함할 수 있다. 예를 들어, 모바일 장치는, 외관을 형성하는 하우징 및 하우징 내에 배치되는 충전 가능한 이차전지를 포함할 수 있다. 배터리는, 강한 충격을 받거나, 고온의 환경에 노출되는 경우, 발열 현상이 발생할 수 있다. 또는, 배터리는, 충전 용량을 초과하는 과충전 시, 발열 현상이 발생할 수 있다. 과도한 배터리의 발열은, 배터리의 발화를 야기 시킬 수 있다. 전자 장치의 하우징은, 배터리의 발화로 인한 전자 장치의 연소를 감소시키기 위해, 난연성 물질 을 포함할 수 있다. 예를 들어, 배터리를 향하는 하우징의 일 면에, 난연성 도료가 도포되거나, 또는, 난연성 시트가 부착될 수 있다. 전자 장치는, 딱딱한 물질과 접촉 시, 하우징에 흠집이 발생할 수 있다. 전자 장치의 하우징은, 흠집을 기"}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "위해, 외부를 향하는 일 면에 경도가 높은 물질을 포함할 수 있다. 발명의 내용"}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치의 외부를 향하는 일 면은, 흠집이 쉽게 발생할 수 있다. 상기 전자 장치의 일 면에 흠집이 발생한 경 우, 전자 장치의 사용에 불편함을 야기할 수 있다. 전자 장치의 외부를 향하는 일 면은, 경도가 높은 물질을 포 함할 것이 요구된다. 전자 장치의 내부를 향하는 일 면은, 내부에 배치된 배터리에 인접할 수 있다. 상기 전자 장치의 일 면은, 배터 리의 발화 시, 연소될 수 있으므로, 난연성 물질을 포함할 것이 요구된다. 본 발명의 다양한 실시예들은, 난연성 물질을 포함하는 레이어와, 경도가 높은 물질을 포함하는 레이어가 적층 된 구조를 포함하는 전자 장치의 하우징을 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른, 폴리머 재질을 포함하는 하우징은, 상기 하우징의 외면의 적어도 일부 상에 배치되고, 난연 제 및 디메틸실록산계 물질을 포함하는 제1 레이어 및 상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어를 포함하고, 상기 난연제는, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함할 수 있다. 일 실시예에 따른, 전자 장치는, 디스플레이가 배치되는 전면, 상기 전면의 반대방향 향하는 후면 및 상기 전면 과 상기 후면 사이에 배치되어 내부 공간을 형성하는 측면을 포함하는 하우징 및 상기 내부 공간에 배치되는, 배터리를 포함하고, 상기 하우징은, 상기 후면의 적어도 일부 상에 배치되고, 난연제 및 디메틸실록산계 물질을 포함하는 제1 레이어 및 상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어를 포함하 고, 상기 난연제는, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함할 수 있다."}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "복수의 레이어들을 포함하는 하우징 및 이를 포함하는 전자 장치는, 외부를 향하는 일 면에 경도가 높은 물질을 포함함으로써, 흠집의 발생을 감소시킬 수 있고, 내부를 향하는 일 면에 난연성 물질을 포함함으로써, 배터리 발화 시 하우징의 연소를 감소시킬 수 있다. 복수의 레이어들은 일체로 형성됨으로써, 실시예들에 따른 하우징 은, 난연제가 포함된 레이어가 접히거나 주름이 발생하는 현상을 감소시킴으로써, 연소를 억제할 수 있다. 난연 성 물질을 포함하는 레이어는, 하우징의 베이스 재질인 폴리머와 난연제의 혼합을 위한 디메틸실록산계 물질을 포함함으로써, 높은 강도를 확보할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0174155", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트 워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치 와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나 와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는, 일 실시예에 따른, 전자 장치를 나타내는 도면이고, 도 3은, 일 실시예에 따른, 전자 장치의 분해 사시 도이다. 도 2을 참조하면, 일 실시예에 따른 전자 장치는, 전자 장치의 외관을 형성하는 하우징을 포함 할 수 있다. 예를 들어, 하우징은 제1 면(또는 전면)(200A), 제2 면(또는 후면)(200C), 및 제1 면(200A) 및 제2 면(200C) 사이의 공간을 둘러싸는 제3 면(또는 측면)(200B)을 포함할 수 있다. 일 실시예에서, 하우징 은, 제1 면(200A), 제2 면(200C) 및/또는 제3 면(200B)들 중 적어도 일부를 형성하는 구조(예: 도 3의 프 레임 구조)를 지칭할 수도 있다. 일 실시예에 따른 전자 장치는, 실질적으로 투명한 전면 플레이트를 포함할 수 있다. 일 실시예에서, 전면 플레이트는 제1 면(200A)의 적어도 일부를 형성할 수 있다. 일 실시예에서, 전면 플레이트는, 예를 들어, 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트를 포함할 수 있으나, 이 에 제한되는 것은 아니다. 일 실시예에 따른 전자 장치는, 실질적으로 불투명한 후면 플레이트를 포함할 수 있다. 일 실시예에 서, 후면 플레이트는 제2 면(200C)의 적어도 일부를 형성할 수 있다. 일 실시예에서, 후면 플레이트 는 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시예에 따른 전자 장치는 측면 베젤 구조(또는 측면 부재)(예: 도 3의 프레임 구조의 측벽 )를 포함할 수 있다. 일 실시예에서, 측면 베젤 구조는 전면 플레이트 및/또는 후면 플레이트 와 결합되어, 전자 장치의 제3 면(200B)의 적어도 일부를 형성할 수 있다. 예를 들어, 측면 베젤 구 조는 전자 장치의 제3 면(200B)을 전부 형성할 수도 있고, 다른 예를 들어, 측면 베젤 구조는 전면 플레이트 및/또는 후면 플레이트와 함께 전자 장치의 제3 면(200B)을 형성할 수도 있다. 도시된 실시예와 달리, 전자 장치의 제3 면(200B)이 전면 플레이트 및/또는 후면 플레이트에 의 해 부분적으로 형성되는 경우, 전면 플레이트 및/또는 후면 플레이트는 그 가장자리에서 후면 플레이 트 및/또는 전면 플레이트를 향하여 휘어져 심리스하게(seamless) 연장되는 영역을 포함할 수 있다. 상기 전면 플레이트 및/또는 후면 플레이트의 상기 연장되는 영역은, 예를 들어, 전자 장치의 긴 엣지(long edge)의 양단에 위치할 수 있으나, 상술한 예에 의해 제한되는 것은 아니다. 일 실시예에서, 측면 베젤 구조는 금속 및/또는 폴리머를 포함할 수 있다. 일 실시예에서, 후면 플레이트 및 측면 베젤 구조는 일체로 형성될 수 있고, 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포함 할 수 있으나, 이에 제한되는 것은 아니다. 예를 들어, 후면 플레이트 및 측면 베젤 구조는 별개의 구성으로 형성되거나 및/또는 서로 상이한 물질을 포함할 수도 있다. 일 실시예에서, 전자 장치는 디스플레이, 오디오 모듈(203, 204, 207), 센서 모듈(미도시), 카메라 모듈(205, 212, 213), 키 입력 장치, 발광 소자(미도시), 및/또는 커넥터 홀 중 적어도 하나를 포함 할 수 있다. 다른 실시예에서, 전자 장치는, 상기 구성요소들 중 적어도 하나(예: 키 입력 장치 또는 발광 소자(미도시))를 생략하거나, 다른 구성요소를 추가적으로 포함할 수 있다. 일 실시예에서, 디스플레이(예: 도 1의 디스플레이 모듈는 전면 플레이트의 상당 부분을 통하여 시각적으로 노출될 수 있다. 예를 들어, 디스플레이의 적어도 일부는 제1 면(200A)을 형성하는 전면 플레 이트를 통하여 보일 수 있다. 일 실시예에서, 디스플레이는 전면 플레이트의 배면에 배치될 수있다. 일 실시예에서, 디스플레이의 외곽 형상은, 디스플레이에 인접한 전면 플레이트의 외곽 형상과 대체로 동일하게 형성될 수 있다. 일 실시예에서, 디스플레이가 시각적으로 노출되는 면적을 확장하기 위 하여, 디스플레이의 외곽과 전면 플레이트의 외곽 간의 간격은 대체로 동일하게 형성될 수 있다. 일 실시예에서, 디스플레이(또는 전자 장치의 제1 면(200A))은 화면 표시 영역(201A)을 포함할 수 있 다. 일 실시예에서, 디스플레이는 화면 표시 영역(201A)을 통해 사용자에게 시각적 정보를 제공할 수 있다. 도시된 실시예에서는, 제1 면(200A)을 정면으로 바라보았을 때, 화면 표시 영역(201A)이 제1 면(200A)의 외곽과 이격되어 제1 면(200A)의 내측에 위치하는 것으로 도시되었으나, 이에 제한되는 것은 아니다. 다른 실시 예에서, 제1 면(200A)을 정면으로 바라보았을 때, 화면 표시 영역(201A)의 가장자리의 적어도 일부는 제1 면 (200A)(또는 전면 플레이트)의 가장자리와 실질적으로 일치될 수도 있다. 일 실시예에서, 화면 표시 영역(201A)은 사용자의 생체 정보를 획득하도록 구성된 센싱 영역(201B)을 포함할 수 있다. 여기서, \"화면 표시 영역(201A)이 센싱 영역(201B)을 포함함\"의 의미는 센싱 영역(201B)의 적어도 일부가 화면 표시 영역(201A)에 겹쳐질 수 있는 것(overlapped)으로 이해될 수 있다. 예를 들어, 센싱 영역(201B)은 화 면 표시 영역(201A)의 다른 영역과 마찬가지로 디스플레이에 의해 시각 정보를 표시할 수 있고, 추가적으 로 사용자의 생체 정보(예: 지문)를 획득할 수 있는 영역을 의미할 수 있다. 다른 실시예에서, 센싱 영역(201 B)은 키 입력 장치에 형성될 수도 있다. 일 실시예에서, 디스플레이는 제1 카메라 모듈(예: 도 1의 카메라 모듈)이 위치하는 영역을 포 함할 수 있다. 일 실시예에서, 디스플레이의 상기 영역에는 개구부가 형성되고, 제1 카메라 모듈(예: 펀치 홀 카메라)은 제1 면(200A)을 향하도록 상기 개구부 내에 적어도 부분적으로 배치될 수 있다. 이 경우, 화 면 표시 영역(201A)은 상기 개구부의 가장자리의 적어도 일부를 둘러쌀 수 있다. 다른 실시예에서, 제1 카메라 모듈(예: 언더 디스플레이 카메라(under display camera, UDC))은 디스플레이의 상기 영역과 중첩되 도록 디스플레이 아래에 배치될 수 있다. 이 경우, 디스플레이는 상기 영역을 통해 사용자에게 시각 적 정보를 제공할 수 있고, 추가적으로 제1 카메라 모듈은 디스플레이의 상기 영역을 통해 제1 면 (200A)을 향하는 방향에 대응되는 이미지를 획득할 수 있다. 일 실시예에서, 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 일 실시예에서, 오디오 모듈(203, 204, 207)(예: 도 1의 오디오 모듈)은 마이크 홀(203, 204) 및 스피커 홀을 포함할 수 있다. 일 실시예에서, 마이크 홀(203, 204)은 제3 면(200B)의 일부 영역에 형성된 제1 마이크 홀 및 제2 면 (200C)의 일부 영역에 형성된 제2 마이크 홀을 포함할 수 있다. 마이크 홀(203, 204)의 내부에는 외부의 소리를 획득하기 위한 마이크(미도시)가 배치될 수 있다. 마이크는 소리의 방향을 감지할 수 있도록 복수개의 마이크를 포함할 수 있다. 일 실시예에서, 제2 면(200C)의 일부 영역에 형성된 제2 마이크 홀은, 카메라 모듈(205, 212, 213)에 인접 하도록 배치될 수 있다. 예를 들어, 제2 마이크 홀은 카메라 모듈(205, 212, 213)의 동작에 따라 소리를 획득할 수 있다. 다만 이에 제한되는 것은 아니다. 일 실시예에서, 스피커 홀은, 외부 스피커 홀 및 통화용 리시버 홀(미도시)을 포함할 수 있다. 외부 스피커 홀은 전자 장치의 제3 면(200B)의 일부에 형성될 수 있다. 다른 실시예에서, 외부 스피커 홀 은 마이크 홀과 하나의 홀로 구현될 수 있다. 도시되지 않았으나, 통화용 리시버 홀(미도시)은 제3 면(200B)의 다른 일부에 형성될 수 있다. 예를 들어, 통화용 리시버 홀은, 제3 면(200B)에서 외부 스피커 홀 의 반대편에 형성될 수 있다. 예를 들어, 도 2의 도시를 기준으로, 외부 스피커 홀은 전자 장치(20 0)의 하단부에 해당하는 제3 면(200B)에 형성되고, 통화용 리시버 홀은 전자 장치의 상단부에 해당하는 제 3 면(200B)에 형성될 수 있다. 다만 이에 제한되는 것은 아니며, 다른 실시예에서, 통화용 리시버 홀은 제3 면 (200B)이 아닌 위치에 형성될 수도 있다. 예를 들어, 통화용 리시버 홀은 전면 플레이트(또는, 디스플레이 )와 측면 베젤 구조 사이의 이격된 공간에 의해 형성될 수도 있다. 일 실시예에서, 전자 장치는 외부 스피커 홀 및/또는 통화용 리시버 홀(미도시)을 통해 하우징 의 외부로 소리를 출력하도록 구성되는 적어도 하나의 스피커(미도시)를 포함할 수 있다. 일 실시예에서, 센서 모듈(미도시)(예: 도 1의 센서 모듈)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 예를 들어, 센서 모듈은, 근접 센서, HRM 센서, 지문 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 카메라 모듈(205, 212, 213)(예: 도 1의 카메라 모듈)은, 전자 장치의 제1 면(200 A)을 향하도록 배치된 제1 카메라 모듈, 제2 면(200C)을 향하도록 배치되는 제2 카메라 모듈, 및 플 래시를 포함할 수 있다. 일 실시예에서, 제2 카메라 모듈은 복수의 카메라들(예: 듀얼 카메라, 트리플 카메라 또는 쿼드 카메라)를 포함할 수 있다. 다만, 제2 카메라 모듈이 반드시 복수의 카메라들을 포함하는 것으로 한정되는 것은 아니 며, 하나의 카메라를 포함할 수도 있다. 일 실시예에서, 제1 카메라 모듈 및 제2 카메라 모듈은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/ 또는 이미지 시그널 프로세서를 포함할 수 있다. 일 실시예에서, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 다른 실시예에서, 2개 이상의 렌즈들(적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시예에서, 키 입력 장치(예: 도 1의 입력 모듈)는 전자 장치의 제3 면(200B)에 배치될 수 있다. 다른 실시예에서, 전자 장치는 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고, 포 함되지 않은 키 입력 장치는 디스플레이 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 일 실시예에서, 커넥터 홀은 외부 장치의 커넥터가 수용될 수 있도록 전자 장치의 제3 면(200B)에 형 성될 수 있다. 커넥터 홀 내에는 외부 장치의 커넥터와 전기적으로 연결되는 연결 단자(예: 도 1의 연결 단자)가 배치될 수 있다. 일 실시예에 따른 전자 장치는 상기 연결 단자를 통해 송수신되는 전기적인 신호를 처리하기 위한 인터페이스 모듈(예: 도 1의 인터페이스)을 포함할 수 있다. 일 실시예에서, 전자 장치는 발광 소자(미도시)를 포함할 수 있다. 예를 들어, 상기 발광 소자(미도시)는 하우징의 제1 면(200A)에 배치될 수 있다. 상기 발광 소자(미도시)는 전자 장치의 상태 정보를 광 형 태로 제공할 수 있다. 다른 실시예에서, 상기 발광 소자(미도시)는 제1 카메라 모듈의 동작과 연동되는 광 원을 제공할 수 있다. 예를 들어, 상기 발광 소자(미도시)는, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 도 3은 일 실시예에 따른 전자 장치의 분해 사시도이다. 이하에서, 전술한 구성과 동일한 참조 부호를 갖는 구성에 대해 중복되는 설명은 생략한다. 도 3을 참조하면, 일 실시예에 따른 전자 장치는, 프레임 구조, 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 커버 플레이트, 및 배터리를 포함할 수 있다. 일 실시예에서, 프레임 구조는, 전자 장치의 외관(예: 도 2의 제3 면(200B))을 형성하는 측벽 및 상기 측벽으로부터 내측으로 연장되는 지지 부분을 포함할 수 있다. 일 실시예에서, 프레임 구조 는 디스플레이 및 후면 플레이트 사이에 배치될 수 있다. 일 실시예에서, 프레임 구조의 측벽은 후면 플레이트 및 전면 플레이트(및/또는 디스플레이) 사이의 공간을 둘러쌀 수 있 고, 프레임 구조의 지지 부분은, 상기 공간 내에서 측벽으로부터 연장될 수 있다. 일 실시예에서, 프레임 구조는 전자 장치에 포함된 다른 구성요소들을 지지하거나 수용할 수 있다. 예를 들어, 일 방향(예: +z 방향)을 향하는 프레임 구조의 일 면에는 디스플레이가 배치될 수 있고, 디스플레이는 프레임 구조의 지지 부분에 의해 지지될 수 있다. 다른 예를 들어, 프레임 구조 의 상기 일 방향과 반대 방향(예: -z 방향)을 향하는 타 면에는 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 배터리, 및 제2 카메라 모듈이 배치될 수 있다. 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 배터리 및 제2 카메라 모듈은 프레임 구조의 측벽 및/또는 지지 부분에 의해 정의되는 리세스에 각각 안착될 수 있다. 일 실시예에서, 제1 인쇄 회로 기판, 제2 인쇄 회로 기판 및 배터리는 프레임 구조와 각각 결합될 수 있다. 예를 들어, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은, 스크류(screw)와 같은 결 합 부재를 통해, 프레임 구조에 고정 배치될 수 있다. 예를 들어, 배터리는 접착 부재(예: 양면 테이 프)를 통해 프레임 구조에 고정 배치될 수 있다. 그러나, 상술한 예에 의해 제한되는 것은 아니다. 일 실시예에서, 커버 플레이트는 제1 인쇄 회로 기판 및 후면 플레이트 사이에 배치될 수 있다. 일 실시예에서, 제1 인쇄 회로 기판 상에는 커버 플레이트가 배치될 수 있다. 예를 들어, 커버 플레 이트는 제1 인쇄 회로 기판의 -z 방향을 향하는 면에 배치될 수 있다. 일 실시예에서, 커버 플레이트는, z 축을 기준으로, 제1 인쇄 회로 기판과 적어도 부분적으로 중첩될 수 있다. 일 실시예에서, 커버 플레이트는 제1 인쇄 회로 기판의 적어도 일부 영역을 덮을 수 있다. 이를 통해, 커버 플레이트는 제1 인쇄 회로 기판을 물리적인 충격으로부터 보호하거나, 제1 인쇄 회 로 기판에 결합된 커넥터(예: 도 3의 커넥터)의 이탈을 방지할 수 있다. 일 실시예에서, 커버 플레이트는, 결합 부재(예: 스크류)를 통해 제1 인쇄 회로 기판에 고정 배치되 거나, 또는 상기 결합 부재를 통해 제1 인쇄 회로 기판과 함께 프레임 구조에 결합될 수 있다. 일 실시예에서, 디스플레이는 프레임 구조 및 전면 플레이트 사이에 배치될 수 있다. 예를 들어, 디스플레이의 일 측(예: +z 방향)에는 전면 플레이트가 배치되고, 타 측(예: -z 방향)에는 프 레임 구조가 배치될 수 있다. 일 실시예에서, 전면 플레이트는 디스플레이와 결합될 수 있다. 예를 들어, 전면 플레이트 및 디스플레이는, 그 사이에 개재되는 광학용 접착 부재(예: optically clear adhesive(OCA) 또는 optically clear resin(OCR))를 통해 서로 접착될 수 있다. 일 실시예에서, 전면 플레이트는 프레임 구조와 결합될 수 있다. 예를 들어, 전면 플레이트는, z 축 방향으로 바라보았을 때, 디스플레이 바깥으로 연장되는 외곽부를 포함할 수 있고, 전면 플레이트 의 상기 외곽부와 프레임 구조(예: 측벽) 사이에 배치되는 접착 부재(예: 양면 테이프)를 통해, 프레임 구조와 접착될 수 있다. 다만 상술한 예에 의해 제한되는 것은 아니다. 일 실시예에서, 제1 인쇄 회로 기판 및/또는 제2 인쇄 회로 기판에는, 프로세서(예: 도 1의 프로세서 ), 메모리(예: 도 1의 메모리), 및/또는 인터페이스(예: 도 1의 인터페이스)가 장착될 수 있다. 프로세서는, 예를 들어, 중앙처리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프로세서, 센 서 허브 프로세서, 또는 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 메모리는, 예를 들어, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 인터페이스는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및/또는 오디오 인터페이 스를 포함할 수 있다. 인터페이스는 전자 장치를 외부 전자 장치와 전기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 일 실시예에서, 제1 인쇄 회 로 기판 및 제2 인쇄 회로 기판은 연결 부재(예: 연성 인쇄 회로 기판)를 통해 서로 작동적으로 또는 전기적으로 연결될 수 있다. 일 실시예에서, 배터리 는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 예를 들 면, 배터리는 재충전 가능한 2차 전지, 또는 연료 전지를 포함할 수 있다. 배터리의 적어도 일부는 제1 인쇄 회로 기판 및/또는 제2 인쇄 회로 기판과 실질적으로 동일 평면 상에 배치될 수 있다. 일 실시예에 따른 전자 장치는, 안테나 모듈(미도시)(예: 도 1의 안테나 모듈)를 포함할 수 있다. 일 실시예에서, 안테나 모듈은, 후면 플레이트와 배터리 사이에 배치될 수 있다. 안테나 모듈은, 예를 들어, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 안테나 모듈은, 예를 들어, 외부 장치와 근거리 통신을 하거나, 외부 장치와 전력을 무선으로 송수신 할 수 있다. 일 실시예에서, 제1 카메라 모듈(예: 전면 카메라)은 렌즈가 전면 플레이트(예: 도 2의 전면(200A)) 의 일부 영역(예: 카메라 영역)을 통해 외부 광을 수신할 수 있도록 프레임 구조의 적어도 일부(예: 지지 부분)에 배치될 수 있다. 일 실시예에서, 제2 카메라 모듈(예: 후면 카메라)은 프레임 구조 및 후면 플레이트 사이에 배 치될 수 있다. 일 실시예에서, 제2 카메라 모듈은 연결 부재(예: 커넥터)를 통해 제1 인쇄 회로 기판(25 0)에 전기적으로 연결될 수 있다. 일 실시예에서, 제2 카메라 모듈은 렌즈가 전자 장치의 후면 플레이트의 카메라 영역을 통해 외부 광을 수신할 수 있도록 배치될 수 있다. 일 실시예에서, 카메라 영역은 후면 플레이트의 표면(예: 도 2의 후면(200C))에 형성될 수 있다. 일 실시예에서, 카메라 영역은 제2 카메라 모듈의 렌즈로 외부의 광이 입사 될 수 있도록 적어도 부분적 으로 투명하게 형성될 수 있다. 일 실시예에서, 카메라 영역의 적어도 일부는 후면 플레이트의 상기 표면으로부터 소정의 높이로 돌출될 수 있다. 다만, 이에 한정되는 것은 아니며, 다른 실시예에서, 카메라 영역 은 후면 플레이트의 표면과 실질적으로 동일한 평면을 형성할 수도 있다. 일 실시예에서, 전자 장치의 하우징은, 전자 장치의 외관의 적어도 일부를 형성하는 구성 또는 구조를 의미할 수 있다. 이러한 점에서, 전자 장치의 외관을 형성하는 전면 플레이트, 프레임 구조 , 및/또는 후면 플레이트 중 적어도 일부는 전자 장치의 하우징으로 참조될 수 있다. 일 실시예에 따르면, 배터리는 전면 플레이트, 후면 플레이트 및 측면 베젤 구조에 의해 형성되는 공간에 배치될 수 있다. 배터리는, 전면 플레이트와 후면 플레이트의 사이에 배치될 수 있다. 일 실시예에 따르면, 전자 장치의 후면 플레이트를 z 축 방향으로 바라보았을 때, 후면 플레이트 는, 배터리의 일 면과 중첩되는 중첩 영역을 포함할 수 있다. 후면 플레이트는, 배터리 를 덮을 수 있다. 배터리가 하우징 내에 배치된 상태에서, 배터리는, 디스플레이 보 다 후면 플레이트에 가깝게 배치될 수 있다. 일 실시예에 따르면, 전면 플레이트는, 디스플레이를 보호하기 위해, 강화 유리와 같은, 불연성 재질 을 포함할 수 있다. 후면 플레이트는, 폴리머 재질을 포함할 수 있다. 전면 플레이트는,불연성 재질 을 포함하므로, 배터리의 발화 시, 연소되지 않을 수 있으나, 후면 플레이트는, 배터리의 발화 에 영향을 받을 수 있다. 예를 들어, 배터리가 강한 충격을 받거나, 배터리가 고온의 환경에 장시간 노출된 경우, 배터리가 발화될 수 있다. 배터리가 발화될 경우, 디스플레이보다 배터리에 더 가까운 후면 플레이트가 연소될 수 있다. 중첩 영역은, 후면 플레이트 전체 영역 중 배터리 와 직접 마주하는 영역이므로, 배터리의 발화 시 직접적인 영향을 받을 수 있다. 일 실시예에 따르면, 후면 플레이트는, 연소를 감소시키기 위한, 난연성 물질(flame retarding material)을 포함할 수 있다. 예를 들어, 후면 플레이트는, 연소를 억제하는, 난연제(flame retardant)를 포함할 수 있다. 전자 장치는, 사용 과정에서 하우징에 흠집(scratch)을 입을 수 있다. 예를 들어, 모바일 장치의 경 우, 모바일 장치를 휴대하는 중 또는 모바일 장치를 사용 중에, 하우징이 딱딱한 물건에 긁힘으로써, 흠집 을 입을 수 있다. 하우징이 흠집을 입은 경우, 전자 장치의 사용에 불편함을 야기시킬 수 있다. 하우 징은, 흠집을 감소시키기 위해, 경도가 높은 재질을 포함할 수 있다. 도 4는, 일 실시예에 따른, 하우징의 레이어 구조와 배터리의 개략도이다. 도 4를 참조하면, 일 실시예에 따른(according to an embodiment), 전자 장치(예: 도 2의 전자 장치)의 하우징은, 후면 플레이트(예: 도 2의 후면 플레이트), 제1 레이어 및 제2 레이어를 포함할 수 있다. 예를 들어, 난연성 물질을 포함하는 제1 레이어는 후면 플레이트 상에 적층될 수 있 다. 경도가 높은 물질을 포함하는 제2 레이어는 제1 레이어 상에 적층될 수 있다. 일 실시예에 따르면, 하우징은, 전자 장치의 부품들이 수용될 수 있는 공간을 제공할 수 있다. 일 실시예 에 따르면, 하우징은, 전면(예: 도 2의 제 1 면(200A)), 전면의 반대방향을 향하는 후면(예: 도 2의 제 2 면(200C)), 및 전면과 후면 사이에 배치되어 내부 공간을 형성하는 측면(예: 도 2의 측면(200B))을 포함할 수 있다. 상기 공간에는 전자 장치의 부품들로 전력을 공급하기 위한, 배터리가 배치될 수 있다. 예를 들어, 배터리는, 후면 플레이트에 대하여, 하우징이 전자 장치의 내부를 향하는 제1 방향 (예: +z 방향)에 위치될 수 있다. 제1 레이어는, 후면 플레이트 상에 상기 제1 방향(예: +z 방향)의 반대 방향인 제2 방향(예: -z 방향)으로 적층될 수 있다. 제2 레이어는, 제1 레이어 상에 상기 제2 방향(예: -z 방향)으로 적층될 수 있다.일 실시예에 따르면, 제1 레이어는, 하우징의 후면의 적 어도 일부 상에 배치될 수 있다. 예를 들면, 제1 레이어는, 하우징의 후면을 형성하는, 후면 플 레이트 상에 배치될 수 있다. 일 실시예에 따르면, 제2 레이어는, 제1 레이어 상에 배치될 수 있다. 예를 들어, 제1 레이어는, 후면을 형성하는 후면 플레이트의 후면 상에 배치될 수 있고, 제2 레이어는, 제1 레이어 상에 배치될 수 있다. 일 실시예에 따르면, 제1 레이어 및 제2레이어는, 실질적으로 후면 플레이트에 포함될 있다. 예를 들면, 제1 레이어 및 제2 레이어가 적층된 후면 플레이트는, 전자 장치의 후면을 형성할 수 있다. 일 실시예에 따르면, 제1 레이어 및 제2 레이어는 후면 플레이트로부터, 하우징의 외부를 향해 순차적으로 적층될 수 있다. 예를 들면, 제1 레이어는, 제2 레이어보다 배터리에 가깝게 배치될 수 있다. 제2 레이어는, 하우징의 외부를 향할 수 있다. 일 실시예에 따르면, 제1 레이어는, 난연제 및 디메틸실록산계 물질을 포함할 수 있다. 제1 레이어는, 제2 레이어보다 배터리에 가까우므로, 배터리의 발화에 직접적인 영향을 받을 수 있다. 예를 들어, 배터리의 발화 시, 배터리를 직접 마주하는 하우징의 중첩 영역부터 연소가 시작될 수 있다. 난연제를 포함하는 제1 레이어는, 후면 플레이트를 커버함으로써, 배터리 발화 시, 하우징의 연소를 감소시킬 수 있다. 일 실시예에 따른, 제1 레이어는, 중첩 영역 을 포함하는, 후면 전체를 커버할 수도 있다. 예를 들어, 후면을 수직으로 바라보았을 때, 제1 레이어에 의해 커버되는 후면의 영역은, 후면 중 배터리와 중첩되는 영역을 포함하는 영역을 커버할 수 있다. 일 실시예에 따르면, 제1 레이어는, 연소를 감소시킬 수 있는, 난연제를 포함할 수 있다. 하우징에 포함된 폴리머는, 대부분 탄소, 수소, 산소로 구성된 유기 물질이므로, 연소하기 쉬운 성질을 가질 수 있다. 제 1 레이어는, 난연제를 포함함으로써, 폴리머 재질로 형성된 하우징의 연소를 억제할 수 있다. 원재료 와 혼합되기 쉽고, 하우징의 기계적인 성질에 영향을 미치지 않으며, 연소 시 낮은 발연 및 독성 가스의 발생을 억제하는 난연제가 요구된다. 일 실시예에 따르면, 제1 레이어는, 난연제로서, 제1 물질 또는 제2 물질을 포함할 수 있다. 제1 물질은, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함할 수 있다. 제2 물질은, 무기 난연제 물질 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 하우징은, 제1 레이어의 난연제에 의해, 난연 성질을 가질 수 있다. 일 실시예 에 따른, 하우징은, 배터리의 발화 시, 연소되지 않음으로써, 전자 장치의 연소를 감소시킬 수 있다. 예를 들어, 배터리가 발화되더라도, 하우징은, 난연제에 의해 연소가 억제됨으로써, 전자 장치의 연 소를 감소시킬 수 있다. 일 실시예에 따르면, 제1 물질에 포함되는 인계 물질은, 인산염(phosphates) 화합물을 포함할 수 있다. 인계 물 질의 열분해 시, 폴리메타인산이 생성될 수 있다. 폴리메타인산은 보호층을 형성함으로써, 연소를 감소시킬 수 있다. 폴리메타인의 생성 시, 탈수작용에 의해 탄소피막이 형성될 수 있고, 상기 탄소피막이 산소를 차단함으로 써, 연소를 감소시킬 수 있다. 인계 물질은, 고체에서 난연 효과가 우수하며, 산소를 다량 함유하는 폴리머의 연소 감소에 탁월할 수 있다. 일 실시예에 따르면, 인계 물질은, 적인(red phosphorus), 암모늄 포스페이트(ammonium phosphate), 트리메틸 포스페이트(TMP, trimethyl phosphate), 암모늄 폴리포스페이트(APP, ammonium polyphosphate), 트리아릴 포스 페이트(TAP, triallyl phosphate), 트리페닐 포스페이트(TPP, triphenyl phosphate), 다이페닐 포스페이트 (DPHP, diphenyl phosphate), 다이메틸 메틸포스포네이트(DMMP, dimethyl methylphosphonate), 트리옥틸 포스 페이트(TOP, trioctyl phosphate), 포스파젠(Phosphazene), 멜라민 폴리포스페이트(melamine polyphosphate), 트리크레질 포스페이트(TCP, tricresyl phosphate), 트리크실레닐 포스페이트(TXP, trixylenyl phosphate) 및 인 비스(1,3-디클로로 프로필) 포스페이트(BDCPP) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 제1 물질에 포함되는 불소계 물질은, 탄소 간 결합(-CF2-)의 강한 결합력으로부터 난연성 을 가질 수 있다. 불소계 물질은, 브롬 또는 염소 화합물을 포함하지 않으므로, 연소 시 발생할 수 있는 유해 가스 발생 및 환경 오염을 감소시킬 수 있다. 불소계 물질은, 광학적으로 투명한 물질의 제조에 용이할 수 있고, 낮은 농도(예: 약 0.06 wt% 내지 0.10 wt%) 첨가되더라도 난연성을 가질 수 있다. 일 실시예에 따른, 제1 레이어는, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는, 제1 물질을 포함할 수 있다. 인계 물질은, 탄소 피막을 형성하여, 연소에 필요한 산소를 차단할 수 있다. 불소 계 물질은, 불똥이 튀는 것을 감소시킴으로써, 발화의 확산을 억제할 수 있다. 제1 물질은, 인계 물질 중 적어 도 하나 및 불소계 물질 중 적어도 하나를 포함함으로써, 연소를 감소시킬 수 있고, 발화를 억제할 수 있다. 일 실시예에 따르면, 불소계 물질은, 폴리테트라플루오르에틸렌(PTFE, polytetrafluoroethylene)을 포함할 수 있다. 이 외에도, 불소계 물질은, 분자 내 불소(fluorine)를 포함하는, 다양한 난연제를 포함할 수 있다. 일 실시예에 따르면, 제2 물질에 포함되는 무기 난연제 물질은, 수산화 알루미늄계 물질, 수산화 마그네슘계 물 질, 및 안티몬계 물질 중 적어도 하나를 포함할 수 있다. 예를 들어, 제1 레이어는, 제2 물질로서, 수산화 알루미늄(Al(OH)3) 및/또는 수산화 마그네슘(Mg(OH)2)을 포함할 수 있다. 수산화 알루미늄 및 수산화 마그네슘은, 흡열 반응에 의해, 물분자가 생성됨으로써(탈수반응), 발화를 지연시키고, 연소를 저지할 수 있다. 다른 예를 들어, 제1 레이어는, 제2 물질로서, 삼산화 안티몬(Sb2O3), 및 오산화 안티몬(Sb2O5)과 같은 안 티몬계 물질을 포함할 수 있다. 안티몬계 물질은, 연소 반응에 참가하는 라디칼을 흡수함으로써, 연소를 억제할 수 있다. 일 실시예에 따르면, 제1 레이어에 포함되는 난연제는, 상기 제1 물질 또는 상기 제2 물질을 포함할 수 있 다. 난연제를 포함하는 제1 레이어는, 하우징을 형성하는 레이어들 중 배터리에 가까우므로, 배 터리의 발화 시 하우징의 연소를 억제할 수 있다. 일 실시예에 따른, 제1 레이어는, 베이스 물 질로서의 폴리머에 난연제로서의 제1 물질 또는 제2 물질을 포함할 수 있다. 예를 들어, 제1 레이어는, 베 이스 물질로서의 폴리카보네이트(PC, polycarbonate)에, 제1 물질 또는 제2 물질이 첨가될 수 있다. 폴리머에 난연제를 첨가할 시, 폴리머와 난연제의 물리적, 화학적 차이때문에, 혼합이 잘 이루어지지 않을 수 있다. 난연제의 첨가량이 지나치게 많을 경우, 폴리머의 성형성, 난연제의 분산성이 저하됨으로써, 하우징(30 0)의 기계적 강도가 저하될 수 있다. 예를 들어, 폴리머의 용융 수지에 난연제를 첨가할 때, 폴리머 분자와 난 연제 분자가 서로 섞이지 않고, 각각의 분자끼리 서로 뭉쳐질 수 있다. 난연제가 폴리머에 제대로 혼합되지 않 은 경우, 하우징의 전체 영역의 강도가 균일하지 않을 수 있다. 예를 들어, 난연제가 뭉쳐있는 하우징 의 영역은, 폴리머의 물성이 약화됨으로써, 외부 충격에 의해 쉽게 깨질 수 있다. 하우징의 강도가 낮을 경우, 외부 충격 발생 시, 하우징이 쉽게 손상될 수 있다. 예를 들어, 폴리머와 난연제가 제대로 혼 합되지 않은 하우징은, 작은 충격을 받을 때에도 깨짐에 의한 크랙이 발생할 수 있다. 난연제가 폴리머와 혼합되지 않아, 일 영역에 많이 분포하는 경우, 난연제가 적게 분포하는 다른 영역의 난연 성능이 저하될 수 있 다. 일 실시예에 따른, 제1 레이어는, 제1 물질 또는 제2 물질과 폴리머의 혼합을 위해, 디메틸실록산계 물질 을 포함할 수 있다. 디메틸실록산계 물질은, 난연제가 첨가된 폴리머의 물성을 향상시킬 수 있다. 디메틸실록산 계 물질은, 제1 레이어의 연신율(elongation rate)을 높임으로써, 제1 레이어의 연질(softness)을 향상시킬 수 있다. 디메틸실록산계 물질은, 제1 레이어의 연질을 향상시킴으로써, 외부 충격으로부터 발생 될 수 있는 제1 레이어의 파손을 감소시킬 수 있다. 디메틸실록산계 물질은, 화학식 [-Si(CH3)2O-]n으로 표 현될 수 있는 물질을 의미할 수 있다. 디메틸실록산계 물질은, 주사슬의 Si-O 결합에 의해, 매우 낮은 유리전이 온도(glass transition temperature)를 가지고, 내열성, 전단 안정성을 가진다. 디메틸실록산계 물질은, 상기 특징들에 의해, 폴리머에 첨가되기에 적합할 수 있다. 디메틸실록산계 물질은, 폴리디메틸실록산(PDMS, polydimethylsiloxane), 실리콘 고무(silicon rubber), 디메틸실리콘(dimethyl silicone), 시메티콘 (simethicone), 메틸실리콘(methyl silicone), 디메티콘(dimethicone) 중 적어도 하나를 포함할 수 있다. 예를 들어, PDMS는, 폴리머에 첨가 시, 폴리머와 난연제를 고르게 혼합시킬 수 있다. 예를 들어, PDMS가 포함된 공중 합체(예: PDMS-TEOS(tetraethyl orthosilicate), PDMS-TES(tetrasilane)), 및/또는 블록 중합체를 난연제가 첨 가된 폴리카보네이트에 추가하여 하우징을 제작할 경우, 난연제와 폴리카보네이트가 고르게 혼합됨으로써, 하우징의 강도가 향상될 수 있다. PDMS는, 투명한 물질로서, 하우징의 소재로서 적합할 수 있다. 난연제인 제1 물질 및 제2 물질이 너무 많을 경우, 하우징의 강도가 낮아질 수 있고, 디메틸실록산계 물질 이 너무 많을 경우, 굴절률 차이로 인한 헤이즈(haze)가 심해질 수 있다. 제1 레이어의 강도 및 난연성을 확보하면서도, 디자인적 미감을 확보하기 위해, 제1 레이어는, 적절한 폴리머, 난연제, 및 디메틸실록산계 물질의 중량비를 포함할 것이 요구된다. 일 실시예에 따르면, 제1 레이어는, 제1 레이어의 전체 중량에 대해 약 5 wt% 이하의 디메틸 실록산 계 물질을 포함할 수 있다. 예를 들어, 제1 레이어는, 제1 레이어의 전체 중량에 대해 약 0.1 wt% 내 지 약 5.0 wt% 이하의 디메틸실록산계 물질을 포함할 수 있다. 제1 물질의 중량비가, 약 1.0 wt%를 초과하거나, 제2 물질의 중량비가, 약 5.0 wt%를 초과할 경우, 제1 레이어 의 강도가 낮아져 크랙이 쉽게 발생할 수 있다. 디메틸실록산계 물질의 중량비가, 약 5.0 wt%를 초과할 경 우, 헤이즈로 인해 하우징의 외관이 손상될 수 있다. 예를 들어, 일 실시예에 따른, 제1 레이어는,0.1 wt% 내지 1.0 wt%의 제1 물질, 0.1 wt% 내지 5.0 wt%의 디메틸실록산계 물질, 및 94.0 wt% 내지 99.8 wt% 의 폴리카보네이트를 포함할 수 있다. 다른 예를 들어, 일 실시예에 따른, 제1 레이어는, 0.1 wt% 내지 5.0 wt%의 제2 물질, 0.1 wt% 내지 5.0 wt%의 디메틸실록산계 물질, 및 90.0 wt% 내지 99.8 wt%의 폴리카보네 이트를 포함할 수 있다. 일 실시예에 따르면, 제2 레이어는, 제1 레이어 상에 배치될 수 있다. 제2 레이어는, 하우징 의 외부를 향하는 면에 배치되므로, 흠집의 발생을 감소시키기 위해, 경도가 높은 물질을 포함할 수 있다. 일 실시예에 따른, 제2 레이어는, 아크릴레이트계 물질을 포함할 수 있다. 예를 들어, 제2 레이어는, 폴리메틸 메타아크릴레이트(PMMA, polymethyl methacrylate)를 포함할 수 있다. 다른 예를 들어, 제2 레이어 는 PC/PMMA 블렌드를 포함할 수 있다. PMMA는, 투명 재질로서, 광학적 특성이 우수하고, 높은 경도를 가지 므로, 하우징의 흠집 발생을 감소시킬 수 있다. 아크릴레이트계 물질을 포함하는 제2 레이어의 경도 는, 제1 레이어의 경도보다 높을 수 있다. 제2 레이어는, 충분한 경도를 제공할 수 있는 두께를 가질 수 있다. 전자 장치의 하우징의 일 면에, 난연성 도료가 도포되는 경우, 도료의 부착력 저하로 인한 박리현상, 도장 공정의 추가로 인한 제조 공정이 추가될 수 있다. 전자 장치의 하우징의 일 면에, 난연성 시트가 부착된 경우, 부착을 위한 별도의 접착층이 요구되거나, 가장자리에 곡면을 가지는 하우징에서 난연성 시트가 접 히거나 주름이 발생하는 현상이 발생할 수 있다. 난연성 시트가 접히거나 주름이 발생할 경우, 접히거나 주름진 틈새가 발생할 수 있다. 배터리 발화 시, 상기 틈새를 통한 하우징의 연소가 발생할 수 있다. 일 실시예에 따른, 제2 레이어의 높은 취성에 따른, 파손을 감소시키기 위해, 제1 레이어와 제2 레이 어는 일체로 형성될 수 있다. 전자 장치의 하우징은, 일체로 형성된 제1 레이어 및 제2 레이어 를 포함할 수 있다. 예를 들어, 제1 레이어를 구성하는 물질 및 제2 레이어를 구성하는 물질이 각각 다른 압출기에서 용융되고, 용융된 수지를 적층한 후, 캐스팅하는 공압출(co-extrusion)에 의해, 하우징 은, 일체로 형성될 수 있다. 일 실시예에 따른, 전자 장치의 하우징은, 서로 다른 재질의 레이어들을 포함할 수 있다. 일 실시예에 따른, 전자 장치의 하우징은, 제1 레이어와 제2 레이어가 일체로 형성되므로, 높은 경도를 갖는 제1 레이어와 난연성을 갖는 제2 레이어의 부착력 저하가 발생하지 않 고, 접착층이 요구되지 않을 수 있다. 일 실시예에 따른, 전자 장치의 하우징은, 별도의 난연성 시트를 포 함하지 않으므로, 하우징의 가장자리에 곡면을 포함하더라도, 난연성을 갖는 제2 레이어가 접히지 않 을 수 있다. 예를 들어, 하우징의 제1 레이어 및 제2 레이어는, 후면 및 측면 상에 배치될 수 있다. 난연성을 가지는 제1 레이어가 후면 및 측면 상에 배치됨으로써, 제2 레이어가 접히거 나 주름이 발생하는 현상을 감소시킬 수 있다. 도 4를 참조하면, 일 실시예에 따른, 하우징은, 후면과 배터리 사이에 배치되는 불연성 시트 를 더 포함할 수 있다. 불연성 시트는, 제1 레이어와 배터리 사이에 배치될 수 있다. 불연 성 시트의 일 면은, 제1 레이어를 향할 수 있고, 상기 일 면을 마주하는 다른 일 면은, 후면을 향할 수 있다. 불연성 시트는, 전자 장치의 전체 중량에 크게 영향을 미치지 않기 위해, 얇은 두께를 가질 수 있다. 예를 들어, 불연성 시트는, 약 0.1 mm 내지 10.0 mm의 두께를 가질 수 있으나, 이에 제한되지 않 는다. 불연성 시트는, 불에 타지 않는 불연성 물질을 포함할 수 있다. 예를 들어, 불연성 시트는, 스 테인리스 로 이루어진 시트일 수 있다. 불연성 시트는, 배터리가 발화될 시, 불에 타지 않는 특 징에 의해, 하우징의 연소를 감소시킬 수 있다. 일 실시예에 따르면, 제1 레이어는, 제2 레이어의 두께보다 두꺼운 두께를 가질 수 있다. 제2 레이어 는, 경도가 높은 아크릴레이트계 물질을 포함하므로, 취성이 높을 수 있다. 제2 레이어의 두께가 너 무 두꺼울 경우, 하우징의 취성이 지나치게 높아짐으로써, 하우징은, 작은 충격을 입더라도 쉽게 손 상될 수 있다. 일 실시예에서, 제1 레이어의 두께(t1)는, 제2 레이어의 두께(t2)보다 두꺼울 수 있다. 예를 들어, 제1 레이어의 두께(t1)는 약 0.8t일 수 있고, 제2 레이어의 두께(t2)는, 약 0.2t 일 수 있다. 일 실시예에 따르면, 제1 레이어와 제2 레이어는 서로 상이한 난연성을 가질 수 있다. 일 실시예에 따르면, 제1 레이어는, 제2 레이어보다 우수한 난연성을 가질 수 있다. 제1 레이어 및 제2 레이 어의 난연성을 확인하기 위해, UL 94 연소 시험을 수행하였다. 이하 시험 결과를 통해, 일 실시예에 따른, 전자 장치의 하우징의 제1 레이어 및 제2 레이어의 난연성을 상세하게 설명한다. 단, 시험에 관 련된 실시예는, 일 실시예에 따른, 하우징을 예시하기 위한 것일 뿐, 일 실시예에 따른, 하우징의 범위가 실시예들에 한정되는 것은 아니다. 난연 특성 측정용 시편 제조 난연성 시험을 위해, 제1 레이어에 관한 제1 시편 및 제2 레이어에 관한 제2 시편을 준비하였다. 제1 시편은, 수산화 알루미늄 5.0 wt%, PDMS 5.0 wt%, 및 폴리카보네이트 90.0 wt%로 구성되도록 준비하고, 제2 시 편은, PMMA 100.0 wt%로 구성되도록 준비하였다. 제1 시편 및 제2 시편은 시험 전, 48시간 동안, 23℃ 및 50% 상대 습도에 방치하였다. UL 94 V test(vertical burning test) 제1 시편 및 제2 시편에 10초간 20mm 불꽃(flame)을 가한 후, 제1 시편 및 제2 시편의 연소 시간(t1)을 측 정한다. 다시 10초간 20mm 불꽃을 가한 후, 제1 시편 및 제2 시편의 연소 시간(t2) 및 불똥이 맺힌 시간(t3)을 측정 한다. t1, t2, t3 및 연소 양상(탈지면 발화 여부, 클램프까지의 연소 여부 등)에 기반하여, 등급을 산출한다. 시험결과 제1 시편 및 제2 시편의 UL 94 시험을 하기 [표 1]에 기재하였다. 표 1 기준 제1 시편 제2 시편 개별 연소 시간 (t1 또는 t2)7.5초 30초 초과 2차 연소 후 연소 및 불똥이 맺 힌 시간 (t2+t3)20초 60초 초과 불똥에 의한 탈지면 발화 발생하지 않음 발생 난연 등급 V-0 HB 상기 [표 1]을 참조하면, 제1 시편은, UL 94에 의거하여, 측정한 난연성이 V-0 등급을 가지고, 제2 시편은, UL 94에 의거하여, 측정한 난연성이 HB 등급을 가질 수 있다. 아크릴레이트계 물질을 포함하는 제2 레이어는, 잘 타는 성질을 가지며, 난연제를 포함하는 제1 레이어는, 난연성이 우수함을 확인할 수 있다. 일 실시예 에서, 제1 레이어는, UL 94에 의거하여 측정한 난연성이, V-1 또는 V-0 등급을 가질 수 있고, 제2 레이어 는, UL 94에 의거하여 측정한 난연성이, HB 등급을 가질 수 있다. 도 5a는, 폴리카보네이트의 FT-IR 분광법 측정 결과를 도시하고, 도 5b는, 일 실시예에 따른, 하우징의 FT-IR 분광법 측정 결과를 도시한다. 도 5a를 참조하면, 폴리카보네이트의 FT-IR 피크는, 카보네이트의 작용기에 연관되는 파수(wavenumber)에서 나 타날 수 있다. 폴리카보네이트는, 카보닐(carbonyl), 에터(ether), 페닐(phenyl) 작용기를 가지므로, 폴리카보 네이트는, 해당 작용기 각각에 연관되는 파수에서 FT-IR 피크를 형성할 수 있다. 도 5b는, 디메틸실록산계 물질로서, PDMS를 포함하는, 전자 장치의 하우징(예: 도 4의 하우징)에서 관찰할 수 있는 FT-IR 피크를 나타낸다. 도 5b를 참조하면, 일 실시예에 따른, 전자 장치의 하우징은, 디메틸실록산계 물질을 포함하므로, 폴리카보네이트의 FT-IR 피크와 상이한 FT-IR 피크를 나타낼 수 있다. 도 5b를 참조하면, 일 실시예에 따른 하우징의 FT-IR 피크는, PDMS가 포함되지 않은 폴리카보네이트의 FT-IR 피크에서 나타나지 않 던 Si-O-Si의 피크가 약 1000cm-1 내지 약 1100 cm-1 범위에서 나타날 수 있고, Si-CH3의 피크가 약 1200cm-1 내 지 약 1300cm-1 및 약 800cm-1 내지 약 900cm-1 범위에서 각각 나타날 수 있다. 도 6은, 비교예 1에 따른, 하우징에 대한 낙추 시험 결과를 나타내고, 도 7은, 일 실시예에 따른, 하우징의 낙 추 시험 결과를 나타낸다. 시험에 관련된 실시예는, 일 실시예에 따른, 하우징(예: 도 4의 하우징)을 예시 하기 위한 것일 뿐, 일 실시예에 따른, 하우징의 범위가 실시예들에 한정되는 것은 아니다. 도 6 및 도 7은, 비교예 1에 따른, 하우징과 일 실시예에 따른, 하우징의 물성을 비교하기 위한 낙추 시험 을 실시한 결과를 나타낸다. 비교예 1 비교예 1에 따른, 하우징은, 수산화 알루미늄 약 5.0 wt%, 및 폴리카보네이트 약 95 wt%를 포함한다. 일 실시예 일 실시예에 따른, 하우징은, 수산화 알루미늄 약 5.0 wt%, PDMS 약 5.0 wt%, 및 폴리카보네이트 약 90.0 wt%를 포함한다. 낙추 시험 일 실시예에 따른, 하우징을 수평면에 올려두고, 상기 수평면으로부터 50cm의 높이에서 질량 500g의 추를 자유낙하시켰다. 일 실시예에 따른, 하우징을 수평면에서 제거한 후, 비교예 1에 따른, 하우징을 수평면에 올려두고, 상기 수평면으로부터 50cm의 높이에서 질량 500g의 추를 자유낙하시켰다. 도 6을 참조하면, 비교예 1에 따른, 하우징의 낙추 시험 결과로부터, 크랙이 발생함을 확인할 수 있다. 폴리머 와 난연제를 포함하는 하우징은, 폴리머 분자와 난연제 분자가 고르게 혼합되지 못함으로써, 낮은 강도를 가짐 을 확인할 수 있다. 도 7을 참조하면, 일 실시예에 따른, 하우징의 낙추 시험 결과로부터, 크랙이 발생하지 않음을 확인할 수 있다. 비교예 1에 따른, 하우징은, 낙추 시험 결과 크랙의 발생을 확인할 수 있고, 일 실시예에 따른, 하우징 은, 낙추 시험 결과 크랙의 미발생을 확인할 수 있다. 폴리머, 난연제, 및 디메틸실록산계 물질(예: PDM S)을 포함하는 하우징은, 분자들이 고르게 혼합됨으로써, 높은 강도를 가짐을 확인할 수 있다. 낙추 시험 결과, 폴리카보네이트, 난연제, 및 디메틸실록산계 물질(예: PDMS)을 포함하는 하우징의 강도는 폴리카보네이트 및 난연제를 포함하는 하우징의 강도보다 높음을 확인할 수 있다. 폴리머, 난연제, 및 디메틸실 록산계 물질을 포함하는 하우징은, 충격으로부터 강한 내구성을 가질 수 있다. 디메틸실록산계 물질에 의 해, 폴리카보네이트와 난연제가 고르게 혼합됨으로써, 하우징의 물리적인 특성이 개선됨을 확인할 수 있다. 일 실시예에 따른, 전자 장치의 하우징은, 난연성을 갖는 제1 레이어와 높은 경도를 갖는 제2 레이어를 포함함으로써, 흠집의 발생을 감소시킬 수 있고, 배터리의 발화로부터 연소되지 않을 수 있 다. 일 실시예에 따른, 전자 장치의 하우징은, 난연제를 포함하는 제1 레이어에 디메틸실록산계 물질 을 포함함으로써, 높은 강도를 가질 수 있다. 도 8은, 일 실시예에 따른, 하우징의 레이어 구조와 배터리의 개략도이다. 도 8을 참조하면, 일 실시예에 따른, 전자 장치(예: 도 2의 전자 장치)의 하우징은, 제1 레이어 , 제2 레이어, 차폐층 및 컬러 인쇄층을 더 포함할 수 있다. 일 실시예에 따르면, 제1 레이어는 하우징의 후면의 적어도 일부 상에 배치될 수 있고, 제2 레 이어는, 제1 레이어 상에 배치될 수 있다. 제1 레이어는, 제2 레이어보다 배터리에 가깝게 배치될 수 있다. 제2 레이어는, 하우징의 외부를 향할 수 있다. 일 실시예에 따르면, 제1 레이어는, 난연제 및 디메틸실록산계 물질을 포함할 수 있다. 제1 레이어는, 난연제에 의해, 난연 특성을 가짐으로써, 배터리 발화 시, 하우징의 연소를 감소시킬 수 있다. 일 실시예에 따르면, 제2 레이어는, 아크릴레이트계 물질을 포함할 수 있다. 제2 레이어는, 높은 경 도를 가짐으로써, 하우징이, 흠집을 입는 것을 감소시킬 수 있다. 일 실시예에 따르면, 차폐층은, 후면과 제1 레이어 사이에 배치될 수 있다. 차폐층은, 실 질적으로 불투명한 재질을 포함하거나 또는 불투명한 색상을 갖도록 형성될 수 있다. 차폐층은, 전자 장치 (예: 도 2의 전자 장치)의 내부가 외부로 시인되는 빛샘 현상을 감소시킬 수 있다. 컬러 인쇄층은 차 폐층 상에 증착될 수 있고, 차폐층과 컬러 인쇄층 사이에 프라이머 층이 배치될 수 있다. 예를들어, 차폐층은, 약 3um 내지 약 20um의 두께를 가질 수 있다. 일 실시예에 따르면, 컬러 인쇄층은, 차폐층과 제1 레이어 사이에 배치될 수 있다. 예를 들어, 배터리는, 후면 플레이트에 대하여, 하우징이 전자 장치의 내부를 향하는 제1 방향(D1)에 위치 될 수 있다. 후면 플레이트 상에 상기 제1 방향(예: +z방향)의 반대 방향인 제2 방향(예: -z 방향)으로, 차폐층, 컬러 인쇄층, 제1 레이어 및 제2 레이어가 순차적으로 적층될 수 있다. 컬러 인쇄층은, TiSiCn, 및/또는 CrSiC를 포함할 수 있다. 컬러 인쇄층은, 전자 장치의 하우징 에 컬러감, 질감, 및/또는 입체 효과를 제공할 수 있다. 컬러 인쇄층은, 다양한 색상을 가질 수 있다. 예 를 들어, TiSiCN을 포함하는 컬러 인쇄층은, 검정색, 회색, 갈색, 또는 금색을 나타낼 수 있고, CrSiC를 포함하는 컬러 인쇄층은, 은색을 나타낼 수 있다. 컬러 인쇄층은, 하우징의 장식을 위한 패턴을 가질 수 있다. 예를 들어, 컬러 인쇄층은, 그라데이션(gradation) 무늬를 가질 수 있다. 다른 예를 들어, 컬러 인쇄층은, 영역에 따라 다른 명도와 채도의 색상을 가질 수 있다. 컬러 인쇄층은, 약 3um 내지 약 10 um의 두께를 가질 수 있다. 차폐층은, 컬러 인쇄층의 색상이 명확하게 시인될 수 있도록, 어두 운 색상일 수 있다. 예를 들어, 차폐층은, 하우징의 내부가 시인되지 않는 어두운 색상의 수지를 포 함할 수 있다. 차폐층은, 컬러 인쇄층과 중첩됨으로써, 컬러 인쇄층을 보호할 수 있다. 일 실시예에 따르면, 제1 레이어는, 하우징의 반투명 또는 불투명한 외면을 형성하는 컬러런트 (colorant)를 포함할 수 있다. 컬러런트는, 하우징의 외면의 색을 변화시키기 위해 첨가되는 물질을 의미 할 수 있다. 예를 들어, 제1 레이어는, 염료, 안료, 색소, 형광 물질 및/또는 안광 물질을 포함할 수 있다. 제1 레이어는, 컬러런트에 의해, 반투명 또는 불투명하게 형성될 수 있고, 제1 레이어 상에 배 치되는 차폐층, 컬러 인쇄층과 함께 하우징의 다양한 반투명 또는 불투명한 색상을 구현할 수 있다. 도 9는, 비교예 2에 따른, 하우징에 대한 낙추 시험 결과를 나타내고, 도 10은, 일 실시예에 따른, 하우징의 낙 추 시험 결과를 나타낸다. 도 9 및 도 10은, 비교예 2에 따른, 하우징과 일 실시예에 따른, 하우징(예: 도 4의 하우징)의 물성을 비 교하기 위한 낙추 시험을 실시한 결과를 나타낸다. 시험에 관련된 실시예는, 일 실시예에 따른, 하우징을 예시 하기 위한 것일 뿐, 일 실시예에 따른, 하우징의 범위가 실시예들에 한정되는 것은 아니다. 비교예 2 비교예 2에 따른 하우징은, 수산화 알루미늄 약 5.0 wt%, 및 폴리카보네이트 약 95 wt%를 포함하는 제1 레이어, 차폐층(예: 도 8의 차폐층), 및 컬러 인쇄층(예: 도 8의 컬러 인쇄층)을 포함한다. 일 실시예 일 실시예에 따른, 하우징은, 수산화 알루미늄 약 5.0 wt%, PDMS 약 5.0 wt%, 및 폴리카보네이트 약 90.0 wt%를 포함하는 제1 레이어(예: 도 4의 제1 레이어), 차폐층, 및 컬러 인쇄층(예: 도 8의 컬러 인쇄층 )을 포함한다. 낙추 시험 일 실시예에 따른, 하우징을 수평면에 올려두고, 상기 수평면으로부터 50cm의 높이에서 질량 500g의 추를 자유낙하시켰다. 일 실시예에 따른, 하우징을 수평면에서 제거한 후, 비교예 2에 따른, 하우징을 수평면에 올려두고, 상기 수평면으로부터 50cm의 높이에서 질량 500g의 추를 자유낙하시켰다. 도 9을 참조하면, 비교예 2에 따른, 낙추 시험 결과로부터, 크랙이 발생함을 확인할 수 있다. 폴리머와 난연제 를 포함하는 제1 레이어, 컬러 인쇄층, 차폐층 및 컬러 인쇄층을 포함하는 하우징은, 폴리머 분자와 난연제 분 자가 고르게 혼합되지 못함으로써, 낮은 강도를 가짐을 확인할 수 있다. 도 10을 참조하면, 일 실시예에 따른, 하우징의 낙추 시험 결과, 크랙이 발생하지 않음을 확인할 수 있다. 폴리머, 난연제, 및 디메틸실록산계 물질(예: PDMS)을 포함하는 제1 레이어, 차폐층, 및 컬러 인쇄층을 포함하 는 하우징은, 분자들이 고르게 혼합됨으로써, 높은 강도를 가짐을 확인할 수 있다. 낙추 시험 결과, 폴리카보네이트 및 난연제를 포함하는 제1 레이어, 차폐층, 및 컬러 인쇄층을 포함하는 하우징 의 강도보다, 폴리카보네이트, 난연제, 및 디메틸실록산계 물질(예: PDMS)을 포함하는 제1 레이어, 컬러 인쇄층, 및 차폐층을 포함하는 하우징의 강도가 높음을 확인할 수 있다. 디메틸실록산계 물질에 의해, 폴 리카보네이트와 난연제가 고르게 혼합됨으로써, 물리적인 특성이 개선됨을 확인할 수 있다. 일 실시예에 따른, 폴리머 재질을 포함하는 하우징은(예: 도 4의 하우징), 상기 하우징의 외면의 적어도 일부 상에 배치되고, 난연제 및 디메틸실록산계 물질을 포함하는 제1 레이어(예: 도 4의 제1 레이어) 및 상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어(예: 도 4의 제2 레이어)를 포함하고, 상기 난연제는, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함할 수 있다. 일 실시예에 따르면, 상기 디메틸실록산계 물질은, 폴리디메틸실록산(PDMS, polydimethylsiloxane), 실리콘 고 무(silicon rubber), 디메틸실리콘(dimethyl silicone), 시메티콘(simethicone), 메틸실리콘(methyl silicone), 디메티콘(dimethicone) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 인계 물질은, 적인(red phosphorus), 암모늄 포스페이트(ammonium phosphate), 트리 메틸 포스페이트(TMP, trimethyl phosphate), 암모늄 폴리포스페이트(APP, ammonium polyphosphate), 트리아릴 포스페이트(TAP, triallylphosphate), 트리페닐 포스페이트(TPP, triphenyl phosphate), 다이페닐 포스페이트 (DPHP, diphenyl phosphate), 다이메틸 메틸포스포네이트(DMMP, dimethyl methylphosphonate), 트리옥틸 포스 페이트(TOP, trioctyl phosphate), 포스파젠(Phosphazene), 멜라민 폴리포스페이트(melamine polyphosphate), 트리크레질 포스페이트(TCP, tricresyl phosphate), 트리크실레닐 포스페이트(TXP, trixylenyl phosphate) 및 인 비스(1,3-디클로로 프로필) 포스페이트(BDCPP) 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 불소계 물질은, 폴리테트라플루오르에틸렌(PTFE, polytetrafluoroethylene)을 포함할 수 있다. 일 실시예에 따르면, 상기 무기 난연제 물질은, 수산화 알루미늄계 물질, 수산화 마그네슘계 물질 및 안티몬계 물질 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, 상기 제1 레이어의 전체 중량에 대해 5 wt% 이하의 상기 디메틸실록산 계 물질을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, 폴리메틸 메타아크릴레이트(PMMA, polymethyl methacrylate)를 포함하 고, 상기 제2 레이어는, 폴리카보네이트(PC, poly carbonate)를 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, 상기 하우징이 반투명 또는 불투명한 색상을 가지도록 컬러런트 (colorant)를 포함할 수 있다. 일 실시예에 따르면, 상기 하우징은, 디스플레이(예: 도 2의 디스플레이)가 배치되는 전면(예: 도 2의 전 면(200A)), 상기 전면의 반대방향을 향하는 후면(예: 도 2의 후면(200C)) 및 상기 전면과 상기 후면 사이에 배 치되어 내부 공간을 형성하는 측면(예: 도 2의 측면(200B))을 포함하고, 상기 후면과 상기 제1 레이어 사이에 배치되고, 불투명한 재질을 포함하는 차폐층(예: 도 9의 차폐층)을 더 포함할 수 있다. 일 실시예에 따르면, 상기 차폐층과 상기 제1 레이어 사이에 배치되는 컬러 인쇄층(예: 도 9의 컬러 인쇄층 )을 더 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, UL 94에 의거하여 측정한 난연성이 V-1 또는 V-0 등급을 가지고, 상기 제2 레이어는, UL 94에 의거하여 측정한 난연성이 HB 등급을 가질 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, 상기 제2 레이어의 두께보다 두꺼운 두께를 가질 수 있다. 일 실시예에 따르면, 상기 제2 레이어의 경도는, 상기 제1 레이어의 경도보다 높을 수 있다. 일 실시예에 따르면, 상기 하우징은, 디스플레이가 배치되는 전면, 상기 전면의 반대방향을 향하는 후면 및 상 기 전면과 상기 후면 사이에 배치되어 내부 공간을 형성하는 측면을 포함하고, 상기 제1 레이어는, 상기 후면 및 측면 상에 배치될 수 있다. 일 실시예에 따르는, 전자 장치(예: 도 2의 전자 장치)는, 디스플레이(예: 도 2의 디스플레이)가 배 치되는 전면(예: 도 2의 전면(200A)), 상기 전면의 반대방향을 향하는 후면(예: 도 2의 후면(200C)) 및 상기 전면과 상기 후면 사이에 배치되어 내부 공간을 형성하는 측면(예: 도 2의 측면(200B))을 포함하는 하우징(예: 도 4의 하우징) 및 상기 내부 공간에 배치되는, 배터리(예: 도 4의 배터리) 를 포함하고, 상기 하우징은, 상기 후면의 적어도 일부 상에 배치되고, 난연제 및 디메틸실록산계 물질을 포함하는 제1 레이어(예: 도 4의 제1 레이어) 및 상기 제1 레이어 상에 배치되고, 아크릴레이트계 물질을 포함하는 제2 레이어(예: 도 4의 제2 레이어)를 포함하고, 상기 난연제는, 인계 물질 중 적어도 하나 및 불소계 물질 중 적어도 하 나를 포함하는 제1 물질 또는 무기 난연제 물질 중 적어도 하나를 포함하는 제2 물질을 포함할 수 있다. 일 실시예에 따르면, 상기 후면을 수직으로 바라볼 때, 상기 제1 레이어에 의해 커버되는 상기 후면의 영역은, 상기 후면 중 상기 배터리와 중첩되는 영역(예: 도 4의 중첩 영역)을 포함할 수 있다. 일 실시예에 따르면, 상기 디메틸실록산계 물질은, PDMS(polydimethylsiloxane)를 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, 상기 제1 레이어의 전체 중량에 대해 5 wt% 이하의 상기 디메틸실록산 계 물질을 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, 폴리메틸 메타아크릴레이트(PMMA, polymethyl methacrylate)를 포함하 고, 상기 제2 레이어는, 폴리카보네이트(PC, poly carbonate)를 포함할 수 있다. 일 실시예에 따르면, 상기 제1 레이어는, UL94에 의거하여 측정한 난연성이 V-1 또는 V-0 등급을 가지고, 상기 제2 레이어는, UL94에 의거하여 측정한 난연성이 HB 등급을 가질 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어쪠)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다."}
{"patent_id": "10-2021-0174155", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는, 일 실시예에 따른, 전자 장치를 나타내는 도면이다. 도 3은, 일 실시예에 따른, 전자 장치의 분해 사시도이다.도 4는, 일 실시예에 따른, 하우징의 레이어 구조와 배터리의 개략도이다. 도 5a는, 폴리카보네이트의 FT-IR 분광법 측정 결과를 도시한다. 도 5b는, 일 실시예에 따른, 하우징의 FT-IR 분광법 측정 결과를 도시한다. 도 6은, 비교예 1에 따른, 하우징에 대한 낙추 시험 결과를 나타낸다. 도 7은, 일 실시예에 따른, 하우징의 낙추 시험 결과를 나타낸다. 도 8은, 일 실시예에 따른, 하우징의 레이어 구조와 배터리의 개략도이다. 도 9는, 비교예 2에 따른, 하우징에 대한 낙추 시험 결과를 나타낸다. 도 10은, 일 실시예에 따른, 하우징의 낙추 시험 결과를 나타낸다."}
