{"patent_id": "10-2021-0136681", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0127685", "출원번호": "10-2021-0136681", "발명의 명칭": "빅데이터를 이용한 인공지능 기술 기반 이상징후 표적 감지 방법 및 그 시스템", "출원인": "주식회사 희망에어텍", "발명자": "황조연"}}
{"patent_id": "10-2021-0136681", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "바다를 항해하는 표적의 이상징후를 감지하기 위한 이상징후표적 감지 시스템에 있어서,항해표적을 탐지하여 항해표적 정보를 출력하는 레이더;기등록된 복수의 항해표적 각각에 대하여, 복수의 시각 각각에 대응하는 표적크기 정보, 표적위치 정보, 계획된이동경로 정보 및 이동속도 정보를 포함하는 저장표적 정보를 선박식별장치에게 전달하는 서버; 및상기 레이더로부터 탐지된 항해표적에 대한 항해표적 정보를 수신하고, 상기 탐지된 항해표적이 상기 저장표적 정보에 기등록된 복수의 표적에 포함되어 있지 않은 표적인 경우 상기항해표적을 제1 이상징후 표적으로 결정하고, 상기 탐지된 항해표적이 상기 저장표적 정보에 기등록된 복수의 표적에 포함된 표적인 경우 상기 항해표적 정보를 상기 저장표적 정보와 융합하여 표적크기 정보, 표적위치 정보, 이동경로 정보 및 이동속도 정보를 포함하는빅데이터 분석정보를 생성하고, 상기 생성된 빅데이터 분석정보를 상기 서버로 전송하는 선박식별장치; 를 포함하고,상기 서버는, 상기 선박식별장치로부터 수신된 빅데이터 분석정보를, 제1 가중치가 부여된 표적크기 정보, 제2 가중치를 부여된 표적위치 정보, 제3 가중치가 부여된 이동경로 정보및 제4 가중치가 부여된 이동속도 정보를 포함하는 분석정보를 학습 정보로 하여 이동 경로를 출력하도록 학습된 인공지능 모델에 입력하고, 상기 인공지능 모델을 통해 출력된 출력 정보를 기초로 상기 항해표적의 과거 이동경로 및 상기 항해표적의 미래 예측경로를 획득하고, 상기 항해표적의 과거 이동경로 및 상기 항해표적의 미래 예측경로를 상기 선박식별장치로 전송하고, 상기 선박식별장치는, 상기 서버로부터 수신한 과거 이동경로와 상기 저장표적 정보에 포함된 계획된 이동경로 정보 간의 오차에 대응하는 제1 오차 값 및 상기 서버로부터 수신한 미래 예측경로와 상기 저장표적 정보에 포함된 계획된 이동경로정보 간의 오차에 제5 가중치가 부여된 제2 오차값을 획득하고, 상기 제1 오차값 및 상기 제2 오차값 중 적어도 하나가 기설정된 임계 값 이상인 것으로 판단되면, 상기 항해표적을 제2 이상징후 표적으로 결정하는 것을 특징으로 하는, 이상징후표적 감지 시스템."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시(disclosure)의 다양한 실시 예들에 따르면, 바다를 항해하는 표적의 이상징후를 감지하기 위한 이상징후 표적 감지 시스템은, 항해 표적을 탐지하여 항해 표적 정보를 출력하는 레이더, 서버로부터 미리 등록된 표적들 에 대한 저장 표적 정보를 선박식별장치에게 전달하는 서버, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합 하여 상기 항해 표적의 이상징후 여부를 결정하고, 상기 이상징후 여부를 표시하는 선박식별장치를 포함할 수 있 다."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)는 레이더 표적 정보 및 선박 식별 장치의 표적 정보가 융합된 빅데이터를 이용한, 인공지 능 기술 기반 이상징후 표적 감지 방법 및 그 시스템에 관한 것이다."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 선박의 관제, 충돌 방지, 조난 수색 및 구조 등 안전 관리를 효과적으로 수행하기 위해, 또한 불법 행위가 의심되는 의심 선박에 대한 조치 및 적절한 운항지침과 정보를 제공하기 위해 해상에서 선박을 식별하고 추적하는 과정은 필수적이다. 그러나, 이러한 선박을 식별하고 추적하는 장비나 선박, 시스템이 부족하여 적절 한 대응을 하지 못하거나, 통항량이 많아져 의심 선박들을 인식하는데 어려움이 발생할 수 있다. 해상의 선박들의 위치를 능동적으로 추적할 수 있는 레이더나 AIS 등을 이용하여 위치를 추적할 수 있는 시스템을 통해서 선 박의 위치를 식별했다고 해도 수동으로 의심선박을 분석해야 하므로 이상징후 표적 선박을 식별해 내는 것에는 어려움이 따른다. 따라서, 선박을 추적하기 위한 레이더 등의 장치를 사용하여 항해 중인 표적의 정보 및 선박 식별 장치의 표적 정보에 기반한 인공지능 기술 기반 이상징후 표적 감지 시스템이 요구된다."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 논의를 바탕으로, 본 개시(disclosure)는 빅데이터를 이용한 인공지능 기술 기반 이상징후 표 적 감지를 수행하기 위한 것으로, 특히 선박의 상태 및 항로 등에 대한 기등록된 정보와 실제 선박 표적 정보를 융합하고 이들 데이터를 전처리 및 후처리하여 빅데이터로 저장하고, 저장된 빅데이터에 기반하여 선박의 이상 징후를 감지할 수 있는, 빅데이터를 이용한 인공지능 기술 기반 이상징후 표적 감지 방법 및 그 시스템에 관한 것이다."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시(disclosure)의 다양한 실시 예들에 따르면, 바다를 항해하는 표적의 이상징후를 감지하기 위한 이상징 후표적 감지 시스템은, 항해 표적을 탐지하여 항해 표적 정보를 출력하는 레이더, 서버로부터 미리 등록된 표적 들에 대한 저장 표적 정보를 선박식별장치에게 전달하는 서버, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 상기 항해 표적의 이상징후 여부를 결정하고, 상기 이상징후 여부를 표시하는 선박식별장치를 포함할 수 있다. 또한, 본 개시의 다양한 실시 예들에 따르면, 바다를 항해하는 표적의 이상징후를 감지하기 위한 이상징후표적 감지 시스템의 이상징후표적 감지 방법은, 항해 표적을 탐지하여 항해 표적 정보를 출력하는 과정과, 서버로부 터 미리 등록된 표적들에 대한 저장 표적 정보를 선박식별장치에게 전달하는 과정과, 상기 항해 표적 정보와 상 기 저장 표적 정보를 융합하여 상기 항해 표적의 이상징후 여부를 결정하는 과정을 포함할 수 있다."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시(disclosure)의 다양한 실시 예들에 따른 방법 및 그 시스템은, 레이더 표적과 선박식별장치 표적 정보 를 융합하여 빅데이터를 구성하고, 융합되어 있지 않은 레이더 표적이나, 융합되어 있더라도 인공지능 기술에 기반한 빅데이터 분석을 통해 해당 표적이 이상징후 확률 범위 내에 있다고 판단될 경우, 레이더 표적을 이상징 후표적으로 결정함으로써, 이상징후 표적의 감지 및 알림을 수행할 수 있다."}
{"patent_id": "10-2021-0136681", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시(disclosure)는 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지 를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 이하의 실시 예에서, 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하의 실시 예에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 다수의 표현을 포함한다. 이하의 실시 예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또 는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한 다. 본 발명의 실시 예들은 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블록 들은 특정 기능들을 실행하는 다양한 개수의 하드웨어 또는/및 소프트웨어 구성들로 구현될 수 있다. 예를 들어, 본 발명의 실시 예들은 하나 이상의 마이크로프로세서들의 제어 또는 다른 제어장치들에 의해서 다양한 기능들을 실행할 수 있는, 메모리, 프로세싱, 로직(logic), 룩업 테이블(look-up table) 등과 같은 직접 회로 구성들을 채용할 수 있다. 본 발명의 실시 예의 구성 요소들이 소프트웨어 프로그래밍 또는 소프트웨어 요소들 로 실행될 수 있는 것과 유사하게, 본 발명의 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래 밍 구성들의 조합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되 는 알고리즘으로 구현될 수 있다. 또한, 본 발명의 실시 예들은 전자적인 환경 설정, 신호 처리, 및/또는 데이 터 처리 등을 위하여 종래 기술을 채용할 수 있다. 매커니즘, 요소, 수단, 구성과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물리적인 구성들로서 한정되는 것은 아니다. 상기 용어는 프로세서 등과 연계하여 소프트웨 어의 일련의 처리들(routines)의 의미를 포함할 수 있다. 이하 설명에서 사용되는 데이터의 표시에 관련된 변수(예: 파라미터(parameter), 값)을 지칭하는 용어, 발명의 동작을 수행하는데 사용되는 객체(예: 전자 장치, 표시 장치, 디스플레이 장치 등)를 지칭하는 용어, 장치의 구 성요소를 지칭하는 용어(예: 회로, 모듈, 컨트롤러, 프로세서, 수집부, 예측부, 추론부, 지원부, 처리부, 표시 부, 센서 등) 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아 니며, 동등한 기술적 의미를 가지는 다른 용어가 사용될 수 있다. 본 개시에서, 인공지능(artificial intelligence, AI)은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구 하는 분야를 의미할 수 있고, 기계 학습(machine learning)은 인공지능 기술의 한 분야로서 컴퓨팅 장치가 데이 터를 통해 학습하여 특정 대상 혹은 조건을 이해할 수 있게 하거나 데이터의 패턴을 찾아내 분류하는 기술적 방 식으로써 컴퓨터가 데이터를 분석할 수 있게 하는 알고리즘일 수 있다. 본 발명에서 개시하는 기계 학습은 인공 지능 모델을 학습하기 위한 동작 방법을 포함하는 의미로서 이해될 수 있다. 도 1은 다양한 실시 예들에 따른, 빅데이터를 이용한 인공지능 기술 기반 이상징후 표적 감지 시스템의 예시적 인 블록도를 도시한다. 도 1을 참고하면, 빅데이터를 이용한 인공지능 기술 기반 이상징후 표적 감지 시스템 은 선박식별장치, 레이더 및 빅데이터 서버를 포함할 수 있다. 선박식별장치는 표적 식별부, 데이터 융합부 및 표시부를 포함할 수 있다. 선박식별장치는 레이더로부터 항해 표적(예: 선박)을 탐지하여 출력된 항해 표적 정보를 수신할 수 있고, 빅데이터 서버로부터 저장된 표적(예: 선박)들에 대한 저장 표적 정보를 수신할 수 있다. 선박식별 장치는 프로세서를 포함할 수 있고, 프로세서는 항해 표적 정보와 저장 표적 정보를 융합하여 항해 표적의 이상징후 여부를 결정하고, 이상징후 여부를 표시할 수 있다. 일 실시 예에서, 항해 표적 정보는 항해하는 표적 을 탐지하여 출력된 표적의 이동 경로, 계획된 이동 경로, 예측되는 이동 경로, 표적의 크기, 표적의 위치 정보를 포함할 수 있다. 일 실시 예에서, 저장 표적 정보는 선박식별장치에 기등록된 표적에 대한 표적의 과거 이동 경로, 계획된 이동 경로, 예측되는 이동 경로, 표적의 크기, 표적의 위치 정보를 포함할 수 있다. 일 실시 예에서, 선박식별장치는 항해 표적이 기등록된 표적이 아닌 경우, 이상징후 표적으로 결정할 수 있다. 다 른 실시 예에서, 선박식별장치는 항해 표적이 예측 경로를 기설정된 임계 값 이상 벗어나 이동하거나, 계 획된 항로를 기설정된 임계 값 이상 벗어나는 이동 경로로 이동한 경우 이상징후 확률 범위에 있는 것으로 결정 함으로써, 이상징후 표적으로 결정할 수 있다. 일 실시 예에서, 선박식별장치는 데이터 융합부가 항해 표적 정보와 저장 표적 정보를 융합하여 저장 한 빅데이터 분석 정보가 포함하는 각 정보 값들을 산출하고, 상기 각 정보 값들에 가중치를 부여함으로써, 상 기 항해 표적의 저장 표적 정보와 실제 항해 표적의 항해 표적 정보를 비교하고, 항해 표적이 이상징후 표적인 지 여부를 결정할 수 있다. 예를 들어, 빅데이터 분석 정보에 기반하여, 항해 표적의 과거 이동 경로보다 예측 되는 이동 경로 정보에 큰 가중치를 부여함으로써, 항해 표적의 과거 이동 경로가 계획된 이동 경로와 차이가 크더라도, 예측되는 이동 경로와 실제 이동 경로의 차이가 가중치에 기반한 임계 값 이상의 오차를 가질 경우, 상기 항해 표적을 이상징후 표적으로 결정할 수 있다. 일 실시 예에서, 선박식별장치는 항해 표적 정보와 저장 표적 정보가 결합된 빅데이터 분석 정보를 이용하여, 학습 모델을 기계학습함으로써 표적의 예측 경로 또 는 과거 이동 경로를 생성하는 데 있어, 분류 별(예: 표적의 크기 정보, 위치 정보, 속력 정보, 이동 경로 정보)로 서로 다른 가중치가 부여된 정보 값들을 포함하는 빅데이터 분석 정보를 입력 값으로 사용함으로써, 항 해 표적을 이상징후 표적으로 결정하는 데 있어 영향을 미칠 수 있는 정보 구성을 조정할 수 있다. 일 실시 예에서, 선박식별장치는 빅데이터 분석 정보가 포함하는 각 정보 값들을 시간대 별, 기상 상황 별, 계절 별, 어업 기간 별로 분류하여 산출하고, 상기 분류된 각 정보 값들에 따라, 상기 항해 표적의 저장 표 적 정보와 항해 표적 정보를 비교함으로써, 항해 표적이 이상징후 표적인지 여부를 결정할 수 있다. 일 실시 예 에서, 식별된 항해 표적에 대해, 여름에는 실제 항해 계획 경로로 이동하지 않는 것으로 가정한 경우, 봄, 가을, 겨울에 대응하는 정보 값들에 기반하여 이상징후 표적 여부를 결정할 수 있다. 일 실시 예에서, 선박식별 장치는 항해 표적 정보와 저장 표적 정보가 결합된 빅데이터 분석 정보를 이용하여, 학습 모델을 기계학습 함으로써 표적의 예측 경로 또는 과거 이동 경로를 생성하는 데 있어, 특정 시간대 별, 기상 상황 별, 계절 별 또는 어업 기간 별 빅데이터 분석 정보만을 입력 값으로 사용할 수 있다. 표적 식별부는 선박식별장치가 레이더로부터 수신한 항해 표적 정보와 빅데이터 서버로부 터 수신한 저장 표적 정보를 비교함으로써, 항해 표적을 식별할 수 있다. 예를 들어, 표적 식별부는 레이 더로부터 수신한 항해 표적 정보로부터 항해 표적의 크기, 위치, 이동 경로 및 예측 경로를 식별하고, 빅 데이터 서버로부터 수신한 저장 표적 정보로부터 저장 표적의 크기, 위치, 이동 경로 및 예측 경로를 식별 할 수 있다. 예를 들어, 표적 식별부는 항해 표적이 상기 저장 표적 정보가 포함하는 기등록된 표적들에 포함되어 있는 지 여부를 결정할 수 있고, 기등록된 표적이 아닌 경우 새로운 표적으로 결정할 수 있다. 일 실시 예에서, 표적 식별부는 항해 표적을 식별함으로써, 바다의 특정 영역을 항해하는 표적의 위치를 파악하여 표적의 이동 경로를 추적할 수 있다. 일 실시 예에서, 표적 식별부는 데이터 융합부가 저장한 빅데이터 분석 정보 에 기반하여 항해 표적을 이상징후 표적으로 결정할 수 있다. 예를 들어, 표적 식별부는 항해 표적이 빅데 이터 서버에서 수신한 저장 표적 정보가 포함하는 기등록된 표적들에 포함되어 있지 않으면 상기 항해 표 적을 이상징후 표적으로 결정할 수 있다. 다른 예를 들어, 항해 표적이 상기 저장 표적 정보가 포함하는 기등록 된 표적들에 포함되어 있으나, 항해 표적이 저장 표적 정보에 포함된 예측 경로를 기설정된 임계 값 이상 벗어 나 이동하거나, 계획된 항로를 기설정된 임계 값 이상 벗어나는 이동 경로로 이동한 경우 이상징후 확률 범위에 있는 것으로 결정함으로써, 이상징후 표적으로 결정할 수 있다. 데이터 융합부는 선박식별장치가 수신한 항해 표적 정보와 저장 표적 정보를 융합하고, 융합된 정보 를 빅데이터 서버에 전송할 수 있다. 일 실시 예에서, 데이터 융합부는 메모리를 포함할 수 있고. 레 이더로부터 출력되는 항해 표적 정보를 저장할 수 있고, 저장 표적 정보에 융합하여 저장할 수 있다. 일 실시 예에서, 데이터 융합부는 상기 항해 표적이 상기 저장 표적 정보가 포함하는 기등록된 표적들에 포함 되어 있으면, 동일 표적에 대한 항해 표적 정보를 상기 저장 표적 정보와 융합할 수 있다. 포함되어 있지 않으 면, 새로운 표적에 대한 항해 표적 정보를 상기 저장 표적 정보와 융합할 수 있다. 일 실시 예에서, 데이터 융 합부는 항해 표적 정보와 저장 표적 정보를 융합하는 것에 있어, 일반적인 방법으로 표적의 초기 위치를 설정하여 저장 등록한 후에, 선박식별장치가 레이더로부터 새로운 표적 정보를 수신할 때마다 상기 저장된 표적의 위치를 항해 표적 정보의 입수 시점에 동기화시켜서 예측하여 변경한 후, 항해 표적 정보와 예측변경된 선박의 위치 정보를 융합할 수 있다. 예를 들어, 데이터 융합부는 레이더로부터 입수되는 항 해 표적 정보들을 처리하여 표적의 초기 위치 정보를 계산하고 저장할 수 있다. 이 후에 새로운 항해 표적 정보 들이 입수될 때마다 저장된 표적의 위치 정보에 대해 시간 동기화를 수행함으로써, 저장된 표적의 위치 정보를 새로 입수되는 표적 정보의 입수 시점에 맞추어 예측하여 변경하고, 상기 예측 변경된 표적의 위치 정보를 다시 저장할 수 있다. 따라서, 데이터 융합부의 시간 동기화가 진행될 때마다 된 표적의 위치 정보는 상기 예측 변경된 위치 정보로써 갱신되어 융합될 수 있다. 일 실시 예에서, 데이터 융합부는 새로운 항해 표적 정보 가 입수되면, 저장된 표적의 위치가 설정된 시점과 새로운 표적 정보의 입수 시점 사이에는 시간적 차이가 존재 할 수 있으므로, 저장된 표적의 위치가 설정된 시점과 새로운 표적 정보의 입수시점 사이에 시간적 차이를 고려 하여 저장된 선박의 위치가 실제 어느 위치에 있었을 것인가를 예측하고, 예측된 위치로 선박의 위치를 변경하 여 위치 정보를 저장할 수 있다. 일 실시 예에서, 데이터 융합부는 선박식별장치가 레이더로부 터 수신한 항해 표적 정보를 저장 표적 정보와 융합하여 표적의 이동 경로 및 예측 경로 정보를 생성하고 융합 할 수 있다. 일 실시 예에서, 데이터 융합부는 저장 표적 정보와 항해 표적 정보를 융합하는 과정에 있어, 저장 표적 정보에 저장된 표적들 중 새로 입수된 항해 표적과 동일한 식별코드들 가진 것이 있는지를 검색할 수 있다. 검 색 결과 동일한 식별코드를 갖는 표적 정보가 존재하면, 저장된 표적의 위치를 상기 새로 입수되는 항해 표적의 입수 시점에 동기화시켜서 상기 선박의 위치를 예측 변경하고, 예측 변경된 표적의 위치를 중심으로 유효 영역 을 설정하여, 상기 새로 입수되는 항해 표적이 유효 영역 내에 위치하는지를 확인할 수 있다. 이 때, 상기 새로 입수되는 항해 표적이 상기 유효 영역 내에 위치하면, 상기 새로 입수되는 항해 표적 정보를 반영하여 저장 표 적 정보가 포함하는 상기 표적의 최종 위치를 갱신할 수 있다. 일 실시 예에서, 데이터 융합부는 저장 표 적 정보와 항해 표적 정보를 융합하는 과정에 있어, 저장 표적 정보에 항해 표적의 식별코드를 갖는 표적 정보 가 존재하지 않을 경우, 항해 표적에 새로운 식별 코드를 부여할 수 있다. 일 일시 예에서, 데이터 융합부(11 3)는 저장 표적 정보와 항해 표적 정보를 융합하는 과정에 있어, 새로운 식별 코드가 부여된 항해 표적 정보에 있어, 표적의 크기, 위치, 속력, 이동 경로 들을 고려하여 항해 표적과 유사한 저장 표적을 선택하고, 항해 표 적 정보에 선택된 표적의 표적 정보를 결합할 수 있다. 표시부는 선박식별장치의 항해 표적 정보와 저장 표적 정보가 융합된 빅데이터 분석 정보와 항해 표 적의 항해 표적 정보를 비교함으로써 생성된 항해 표적이 이상징후 표적인지 여부를 포함하는 정보를 표시할 수 있다. 표시부는 선박식별장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 표시부(11 5)는, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함 할 수 있다. 일 실시 예에 따르면, 표시부는 터치를 감지하도록 설정된 터치 회로(touch circuitry), 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 센서 회로(예: 압력 센서)를 포함할 수 있다. 레이더는 항해 표적을 탐지하여 항해 표적 정보를 출력하고, 출력된 항해 표적 정보를 선박식별장치 로 전송할 수 있다. 예를 들어, 레이더는 바다의 특정 영역에 위치한 모든 표적들에 전파를 발사하고, 상 기 표적들로부터 반사되는 반사파를 수신 및 추적 처리하여 항해 표적 정보들을 출력할 수 있다. 레이더가 선박식별장치로 전송하는 항해 표적 정보들은 표적들의 크기, 위치, 이동 경로, 예측 경로, 속력, 크기, 갱신 시간, 신뢰도(추정 오차 공분산) 정보 등을 포함할 수 있다. 일 실시 예에서, 레이더는 해안 감시 레 이더 기지에서 운용하는 레이더(예: GPS-98K, GPW-05K) 등을 포함할 수 있다. 일 실시 예에서, 레이더는 바다의 특정 영역을 항해하는 표적들을 탐지할 수 있도록 해안 근처의 육지에 설치될 수 있다. 빅데이터 서버는 저장 표적 정보를 저장할 수 있고, 저장 표적 정보를 선박식별장치에 전송할 수 있 다. 저장 표적 정보는 표적들의 크기, 위치, 이동 경로, 예측 경로를 나타내는 정보를 포함할 수 있다. 일 실시 예에서, 빅데이터 서버가 저장하는 저장 표적 정보는 미리 등록된 표적들에 대한 저장 표적 정보를 포함할 수 있다. 일 실시 예에서, 빅데이터 서버는 선박식별장치가 레이더로부터 수신한 항해 표적 정 보와 저장 표적 정보가 융합된 정보를 수신하여 저장함으로써, 등록되거나 등록되지 않은 표적들의 빅데이터 정 보를 갱신할 수 있다. 본 개시의 다양한 실시 예에 따르면, 바다를 항해하는 표적의 이상징후를 감지하기 위한 이상징후표적 감지 시 스템은, 항해 표적을 탐지하여 항해 표적 정보를 출력하는 레이더, 서버로부터 미리 등록된 표적들에 대한 저장 표적 정보를 선박식별장치에게 전달하는 서버, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 상기 항 해 표적의 이상징후 여부를 결정하고, 상기 이상징후 여부를 표시하는 선박식별장치를 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, 상기 항해 표적이 상기 저장 표적 정보가 포함하는 기등록된 표적들에 포함되어 있는지 여부를 결정하고, 포함되어 있으면, 상기 항해 표적 정보를 상기 저장 표적 정보와 융합하고, 포함되어 있지 않으면, 상기 항해 표적을 제1 이상징후 표적으로 결정하고, 상기 제1 이상징 후 표적을 표시할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는 상기 항해 표적 정보와 상기 저장 표적 정보를 융합 하여 선박의 위치 정보, 크기 정보, 이동 경로 정보, 예측 경로 정보 중 적어도 하나 이상을 포함하는 빅데이터 분석 정보를 생성하고, 상기 빅데이터 분석 정보와 상기 항해 표적 정보를 비교하고, 상기 비교에 기반하여 상 기 항해 표적이 이상징후 표적인지 여부를 결정할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, 상기 빅데이터 분석 정보가 포함하는 각 정보 값들 을 산출하고, 상기 각 정보 값들에 가중치를 부여함으로써, 상기 항해 표적의 정보와 실제 항해 표적의 항해 표 적 정보를 비교하고, 상기 비교에 기반하여 상기 항해 표적이 이상징후 표적인지 여부를 결정할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 빅데이터 분석 정보가 포함하는 정보들은 시간대 별, 기상상황 별, 계절 별, 어업 기간 별로 분류 가능할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합 하여 상기 항해 표적의 과거 이동 경로를 나타내는 이동 경로 정보를 생성하고, 상기 생성된 과거 이동 경로와 상기 항해 표적의 실제 경로를 비교하고, 상기 항해 표적의 과거 이동 경로와 상기 항해 표적의 실제 경로가 일 치하지 않으면 상기 항해 표적을 제2 이상징후 표적으로 결정하고, 상기 제2 이상징후 표적을 표시할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, 상기 항해 표적의 이동 경로와 상기 항해 표적의 실 제 경로가 기설정된 오차범위를 벗어나는 경우, 상기 항해 표적의 이동 경로와 상기 항해 표적의 실제 경로가 일치하지 않는 것으로 결정할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합 하여 상기 항해 표적의 예측 경로를 나타내는 예측 경로 정보를 생성하고, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로를 비교하고, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로가 일치하지 않 으면 상기 항해 표적을 제2 이상징후 표적으로 결정하고, 상기 제2 이상징후 표적을 표시할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실 제 경로가 기설정된 오차범위를 벗어나는 경우, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로가 일치하지 않는 것으로 결정할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 저장 표적 정보는 저장 표적들의 크기 정보, 위치 정보, 이동 경로 정보 또는 예측 경로 정보 중 적어도 하나 이상을 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, AIS(automatic identification system), V- PASS(vessel-pass) 또는 VHF-DSC(very high frequency-digital selective calling)일 수 있다. 본 개시의 다양한 실시 예에 따르면, 바다를 항해하는 표적의 이상징후를 감지하기 위해 컴퓨터에 의해 실행 가 능한 소프트웨어를 나타내는 데이터가 저장된 컴퓨터 판독 가능 저장 매체는 항해 표적을 탐지하여 항해 표적 정보를 출력하기 위한 명령들과, 서버로부터 미리 등록된 표적들에 대한 저장 표적 정보를 전달하기 위한 명령 들과, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 상기 항해 표적의 이상징후 여부를 결정하고, 상 기 이상징후 여부를 표시하기 위한 명령들을 포함할 수 있다. 도 2는 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템에서 이상징후 표적으로 판단되는 선박을 설명하기 위한 일 예를 도시한다. 도 2를 참고하면, 표적들(210, 220, 230, 240, 250)은 이상징후 표적 감지 시스템(10 0)의 레이더로부터 식별 요청 신호를 수신할 수 있고, 항해 표적 정보를 송신할 수 있다. 이 때, 이상징후 표적 감지 시스템의 선박식별장치는 표적들(210, 220, 230, 240, 250)의 항해 표적 정보를 수신함으 로써, 표적들을 식별할 수 있다. 선박식별장치는, 식별한 표적들에 기반하여, 이상징후 표적 감지 시스템 의 빅데이터 서버로부터 수신한 빅데이터 분석 정보에 등록되지 않은 표적을 이상징후 표적으로 결정할 수 있다. 도 3a 및 3b는 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템에서 이상징후 표적으로 판단되는 선박을 설명하기 위한 일 예를 도시한다. 도 3a를 참고하면, 표적은 빅데이터 분석 정보가 포함하는 계획된 이동 경로가 아닌 실제 과거 이동 경로로 이동함이 도시된다. 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보를 수 신함으로써 식별된 표적에 대해, 이상징후 표적 감지 시스템의 빅데이터 서버로부터 수신한 빅 데이터 분석 정보에 포함된 표적의 계획된 이동 경로와 표적이 송신한 항해 표적 정보에 포함된 표적의 실제 과거 이동 경로를 비교함으로써, 표적을 이상징후 표적으로 결정할 수 있다. 예를 들어, 선박식별장치는 표적의 계획된 이동 경로와 실제 과거 이동 경로가 일치하지 않으면 표적을 이상징후 표적으로 결정할 수 있다. 다른 예를 들어, 선박식별장치는 표적의 계획된 이 동 경로와 실제 과거 이동 경로의 차이가 기설정된 임계 값(예: 30% 오차)보다 크면 표적을 이 상징후 표적으로 결정할 수 있다. 일 실시 예에서, 표적이 빅데이터 분석 정보에 등록된 표적일 경우, 선 박식별장치는, 우선 표적을 빅데이터 서버로부터 수신한 빅데이터 분석 정보에 등록되어 있는 것으로 식별함으로써, 표적을 1차 이상징후 표적으로 결정하지 않고, 계획된 이동 경로와 실제 과거 이동 경로가 일치하지 않음을 결정함으로써, 표적을 이상징후 표적으로 결정할 수 있다. 도 3b를 참고하면, 표적은 빅데이터 분석 정보가 포함하는 예측된 이동 경로가 아닌 실제 이동 경로 로 이동함이 도시된다. 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보를 수신함 으로써 식별된 표적에 대해, 이상징후 표적 감지 시스템의 빅데이터 서버로부터 수신한 빅데이 터 분석 정보에 포함된 표적의 예측된 이동 경로와 표적이 송신한 항해 표적 정보에 포함된 표 적의 실제 이동 경로를 비교함으로써, 표적을 이상징후 표적으로 결정할 수 있다. 예를 들어, 선박식별장치는 표적의 예측된 이동 경로와 실제 과거 이동 경로가 일치하지 않으면 표적 을 이상징후 표적으로 결정할 수 있다. 다른 예를 들어, 선박식별장치는 표적의 예측된 이동 경 로와 실제 이동 경로의 차이가 기설정된 임계 값보다 크면 표적을 이상징후 표적으로 결정할 수 있다. 일 실시 예에서, 표적이 빅데이터 분석 정보에 등록된 표적일 경우, 선박식별장치는, 우선 표 적을 빅데이터 서버로부터 수신한 빅데이터 분석 정보에 등록되어 있는 것으로 식별함으로써, 표적 을 1차 이상징후 표적으로 결정하지 않고, 예측된 이동 경로와 실제 이동 경로가 일치하지 않음 을 결정함으로써, 표적을 이상징후 표적으로 결정할 수 있다. 도 4는 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 개략적으로 설명하 기 위한 순서도의 일 예를 도시한다. 도 4의 순서도 가 포함하는 과정은 이상징후 표적 감지 시스템이 포 함하는 구성 또는 선박식별장치(예: 선박식별장치 내 프로세서)에 의해 수행될 수 있다. 401 단계에서, 이상징후 표적 감지 시스템은 항해 표적을 탐지하여 항해 표적 정보를 출력 할 수 있다. 예를 들 어, 이상징후 표적 감지 시스템의 레이더는 바다를 항해하는 표적으로부터 항해 표적 정보를 수신할 수 있 다. 403 단계에서, 이상징후 표적 감지 시스템은 미리 등록된 표적들에 대한 저장 표적 정보를 전달할 수 있다. 예 를 들어, 이상징후 표적 감지 시스템의 빅데이터 서버는 지금까지 융합하여 저장된 항해 표적들의 저장 표 적 정보를 선박식별장치로 전송할 수 있다. 405 단계에서, 이상징후 표적 감지 시스템은 저장 표적 정보와 항해 표적 정보를 융합하여 항해 표적의 이상징 후여부를 결정 및 표시할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 레이더 로부터 수신한 항해 표적 정보와 빅데이터 서버으로부터 수신한 저장 표적 정보를 융합하고, 항해 표적의 이상징후 여부를 결정하고 표시할 수 있다. 일 실시 예에서, 항해 표적이 빅데이터 서버로부터 수신한 저 장 표적 정보에 융합되어 있지 않는 경우, 항해 표적은 이상징후 표적으로 결정할 수 있다. 도 5은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 5의 순서도 가 포함하는 과정은 이상징후 표적 감지 시스템이 포함하는 구성 또는 선박식별장치(예: 선박식별장치 내 프로세서)에 의해 수행될 수 있다. 501 단계에서, 이상징후 표적 감지 시스템은 항해 표적을 탐지하여 항해 표적 정보를 출력 할 수 있다. 예를 들 어, 이상징후 표적 감지 시스템의 레이더는 바다를 항해하는 표적으로부터 항해 표적 정보를 수신할 수 있 다. 503 단계에서, 이상징후 표적 감지 시스템은 미리 등록된 표적들에 대한 저장 표적 정보를 전달할 수 있다. 예 를 들어, 이상징후 표적 감지 시스템의 빅데이터 서버는 지금까지 융합하여 저장된 항해 표적들의 저장 표 적 정보를 선박식별장치로 전송할 수 있다. 505 단계에서, 항해 표적이 저장 표적 정보 내 등록된 표적들에 포함되어 있는지를 결정할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보가 포함하는 항해 표적의 식별코드가 저장 표 적 정보 내 등록된 표적들의 식별코드들 중에 포함되어 있는지 여부를 결정할 수 있다. 이상징후 표적 감지 시 스템의 선박식별장치는 항해 표적이 저장 표적 정보 내 등록된 표적들에 포함되어 있지 않는 것으로 결정 하면, 507 단계에서, 항해 표적을 이상징후 표적으로 결정할 수 있다. 도 6은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 6의 순서도 가 포함하는 과정은 이상징후 표적 감지 시스템이 포함하는 구성 또는 선박식별장치(예: 선박식별장치 내 프로세서)에 의해 수행될 수 있다. 601 단계에서, 이상징후 표적 감지 시스템은 항해 표적 정보와 저장 표적 정보를 융합하여 빅데이터 분석 정보 를 생성할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 레이더로부터 항해 표 적의 항해 표적 정보를 수신하고, 빅데이터 서버로부터 기등록된 표적들의 저장 표적 정보를 수신한 후, 항해 표적 정보와 저장 표적 정보를 결합하고, 결합된 정보를 빅데이터 분석하여 빅데이터 분석 정보를 생성할 수 있다. 예를 들어, 선박식별장치는 항해 표적 정보와 저장 표적 정보가 결합된 정보를 이용하여, 표적 이동 경로 예측 모델을 기계학습함으로써, 빅데이터 분석을 수행하고, 표적의 예측 경로를 생성할 수 있다. 일 실시 예에서, 이상징후 표적 감지 시스템의 선박식별장치는 빅데이터 분석 정보를 빅데이터 서버로 전송할 수 있고, 빅데이터 서버는 전송받은 빅데이터 분석 정보를 저장 표적 정보에 결합함으로써, 저장 표적 정보를 갱신할 수 있다. 일 실시 예에서, 빅 데이터 분석 정보는 항해 표적의 크기, 위치, 과거 이동 경로, 예측 경로 정보를 포함할 수 있다. 이후 이상징후 표적 감지 시스템의 선박 식별 장치는, 603 단계에서 빅데이터 분석 정보가 포함하는 항해 표적의 크기 정보와 항해 표적의 실제 크기를 비교하고, 605 단계에서 빅데이터 분석 정보가 포함하는 항해 표 적의 위치 정보와 항해 표적의 실제 위치 비교하고, 607 단계에서 빅데이터 분석 정보가 포함하는 항해 표적의 이동 경로와 항해 표적의 실제 이동 경로를 비교하고, 609 단계에서 빅데이터 분석 정보가 포함하는 항해 표적 의 예측 경로와 항해 표적의 실제 이동 경로를 비교할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 빅데 이터 서버에는 등록된 표적들의 크기, 위치, 과거 이동경로, 빅데이터 분석을 통해 생성된 항해 표적의 예 측 경로를 포함하는 정보가 누적적으로 저장되어 있으므로, 레이더로부터 수신한 항해 표적 정보를 기저장 되어 있는 저장 표적 정보와 비교할 수 있다. 611 단계에서, 이상징후 표적 감지 시스템은 빅데이터 분석 정보와 항해 표적의 항해 표적 정보 비교에 기반하 여 항해 표적이 이상징후 표적인지 여부를 결정 및 표시할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적이 빅데이터 분석 정보가 포함하는 기등록된 표적들에 포함되어 있지 않으면 상 기 항해 표적을 이상징후 표적으로 결정할 수 있고, 빅데이터 분석 정보에 포함된 예측 경로를 기설정된 임계 값 이상 벗어나 이동하거나, 계획된 항로를 기설정된 임계 값 이상 벗어나는 이동 경로로 이동한 경우 이상징후 확률 범위에 있는 것으로 결정함으로써 이상징후 표적으로 결정할 수 있다. 도 7은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 7의 순서도 가 포함하는 과정은 이상징후 표적 감지 시스템이 포함하는 구성 또는 선박식별장치(예: 선박식별장치 내 프로세서)에 의해 수행될 수 있다. 701 단계에서, 이상징후 표적 감지 시스템은 항해 표적을 탐지하여 항해 표적 정보를 출력할 수 있다. 예를 들 어, 이상징후 표적 감지 시스템의 레이더는 바다를 항해하는 표적으로부터 항해 표적 정보를 수신할 수 있 다. 703 단계에서, 이상징후 표적 감지 시스템은 미리 등록된 표적들에 대한 저장 표적 정보를 전달할 수 있다. 예 를 들어, 이상징후 표적 감지 시스템의 빅데이터 서버는 지금까지 융합하여 저장된 항해 표적들의 저장 표 적 정보를 선박식별장치로 전송할 수 있다. 705 단계에서, 이상징후 표적 감지 시스템은 항해 표적이 저장 표적 정보 내 등록된 표적들에 포함되어 있는지 여부를 결정할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보가 포함 하는 항해 표적의 식별코드가 저장 표적 정보 내 등록된 표적들의 식별코드들 중에 포함되어 있는지 여부를 결 정할 수 있다. 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적이 저장 표적 정보 내 등록된 표적 들에 포함되어 있지 않는 것으로 결정하면, 707 단계에서, 항해 표적을 제1 이상징후 표적으로 결정할 수 있고, 항해 표적이 저장 표적 정보 내 등록된 표적들에 포함되어 있는 것으로 결정하면 709 단계의 동작 과정을 수행 할 수 있다.709 단계에서, 이상징후 표적 감지 시스템은 항해 표적 정보와 저장 표적 정보를 융합하여 항해 표적의 이동 경 로 정보를 생성할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 레이더로부터 항해 표적의 항해 표적 정보를 수신하고, 빅데이터 서버로부터 기등록된 표적들의 저장 표적 정보를 수신 한 후, 항해 표적 정보와 저장 표적 정보를 결합하고, 결합된 정보를 빅데이터 분석하여 항해 표적의 이동 경로 정보를 포함하는 빅데이터 분석 정보를 생성할 수 있다. 일 실시 예에서, 저장 표적 정보는 등록된 항해 표적이 과거 항해 시 이동했던 이동 경로 정보를 포함하므로, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적이 과거 항해 시 이동 했던 이동 경로 정보를 포함하는 이동 경로 정보를 생성할 수 있다. 다른 실시 예에 서, 저장 표적 정보는 등록된 항해 표적의 계획된 이동 경로 정보를 포함하므로, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적이 이동하기로 했던 계획된 이동 경로를 포함하는 이동 경로 정보를 생성할 수 있다. 다른 실시 예에서, 저장 표적 정보는 등록된 항해 표적이 과거 항해 시 이동했던 이동 경로 정보를 포함 할 수 있고, 항해 표적 정보는 현재 항해에서 항해 표적이 이동했던 이동 경로 정보를 포함할 수 있고, 선박식 별장치는 항해 표적 정보와 저장 표적 정보가 결합된 정보를 이용하여, 표적 이동 경로 모델을 기계학습함 으로써, 빅데이터 분석을 수행하고, 현재 항해에서 항해 표적이 이동했어야 할 이동 경로 정보를 생성할 수 있 다. 711 단계에서, 이상징후 표적 감지 시스템은 생성된 항해 표적의 이동 경로와 실제 이동 경로와 일치하는지 여 부를 결정할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보와 저장 표 적 정보를 융합하여 생성된 표적의 이동 경로 정보와 항해 표적의 실제 이동 경로가 일치하는 지 여부를 결정할 수 있다. 일 실시 예에서, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적의 실제 이동 경로가 이 동 경로 정보가 포함하는 과거 이동 경로, 계획된 이동 경로 또는 이동했어야 할 이동 경로 대비 기설정된 임계 값 이상으로 벗어나는 것으로 결정한 경우, 이상징후 확률 범위에 있는 것으로 결정함으로써, 항해 표적의 이동 경로와 실제 이동 경로가 일치하지 않는 것으로 결정할 수 있다. 항해 표적의 이동 경로와 실제 이동 경로와 일 치하지 않는 것으로 결정한 경우, 713 단계에서, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 을 제2 이상징후 표적으로 결정할 수 있다. 도 8은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 8의 순서도 가 포함하는 과정은 이상징후 표적 감지 시스템이 포함하는 구성 또는 선박식별장치(예: 선박식별장치 내 프로세서)에 의해 수행될 수 있다. 801 단계에서, 항해 표적을 탐지하여 항해 표적 정보를 출력할 수 있다. 이상징후 표적 감지 시스템은 항해 표 적을 탐지하여 항해 표적 정보를 출력할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 레이더는 바다 를 항해하는 표적으로부터 항해 표적 정보를 수신할 수 있다. 803 단계에서, 미리 등록된 표적들에 대한 저장 표적 정보를 전달할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 빅데이터 서버는 지금까지 융합하여 저장된 항해 표적들의 저장 표적 정보를 선박식별장치 로 전송할 수 있다. 805 단계에서, 이상징후 표적 감지 시스템은 항해 표적이 저장 표적 정보 내 등록된 표적들에 포함되어 있는지 여부를 결정할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보가 포함 하는 항해 표적의 식별코드가 저장 표적 정보 내 등록된 표적들의 식별코드들 중에 포함되어 있는지 여부를 결 정할 수 있다. 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적이 저장 표적 정보 내 등록된 표적 들에 포함되어 있지 않는 것으로 결정하면, 807 단계에서, 항해 표적을 제1 이상징후 표적으로 결정할 수 있고, 항해 표적이 저장 표적 정보 내 등록된 표적들에 포함되어 있는 것으로 결정하면 809 단계의 동작 과정을 수행 할 수 있다. 809 단계에서, 이상징후 표적 감지 시스템은 항해 표적 정보와 저장 표적 정보 융합하여 항해 표적의 예측 경로 정보 생성할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 레이더로부터 항해 표적의 항해 표적 정보 를 수신하고, 빅데이터 서버로부터 기등록된 표적들의 저장 표적 정보를 수신한 후, 항해 표적 정보와 저 장 표적 정보를 결합하고, 결합된 정보를 빅데이터 분석하여 항해 표적의 이동 경로 정보를 포함하는 빅데이터 분석 정보를 생성할 수 있다. 일 실시 예에서, 저장 표적 정보는 등록된 항해 표적이 과거 항해 시 이동했던 이 동 경로 정보를 포함할 수 있고, 항해 표적 정보는 현재 항해에서 항해 표적이 이동했던 이동 경로 정보를 포함 할 수 있고, 선박식별장치는 항해 표적 정보와 저장 표적 정보가 결합된 정보를 이용하여, 표적 이동 경로 예측 모델을 기계학습함으로써, 빅데이터 분석을 수행하고, 현재 항해에서 항해 표적이 이동할 것으로 예측되는예측 경로 정보를 생성할 수 있다. 811 단계에서, 이상징후 표적 감지 시스템은 생성된 항해 표적의 예측 경로와 실제 이동 경로 일치하는지 여부 를 결정할 수 있다. 예를 들어, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적 정보와 저장 표적 정보를 융합하여 생성된 표적의 예측 경로 정보와 항해 표적의 실제 이동 경로가 일치하는 지 여부를 결정할 수 있다. 일 실시 예에서, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적의 실제 이동 경로가 예측 경로 정보가 포함하는 이동 경로 대비 기설정된 임계 값 이상으로 벗어나는 것으로 결정한 경우, 이상징후 확률 범위에 있는 것으로 결정함으로써, 항해 표적의 예측 경로와 실제 이동 경로가 일치하지 않는 것으로 결정할 수 있다. 항해 표적의 예측 경로와 실제 이동 경로와 일치하지 않는 것으로 결정한 경우, 813 단계에서, 이상징후 표적 감지 시스템의 선박식별장치는 항해 표적을 제2 이상징후 표적으로 결정할 수 있다. 본 개시의 다양한 실시 예에 따르면, 바다를 항해하는 표적의 이상징후를 감지하기 위한 이상징후표적 감지 시 스템의 이상징후표적 감지 방법은, 항해 표적을 탐지하여 항해 표적 정보를 출력하는 과정과, 서버로부터 미리 등록된 표적들에 대한 저장 표적 정보를 선박식별장치에게 전달하는 과정과, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 상기 항해 표적의 이상징후 여부를 결정하는 과정을 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 항해 표적이 상기 저장 표적 정보가 포함하는 기등록된 표적들에 포함되어 있는지 여부를 결정하는 과정과, 포함되어 있으면, 상기 항해 표적 정보 를 상기 저장 표적 정보와 융합하고, 포함되어 있지 않으면, 상기 항해 표적을 제1 이상징후 표적으로 결정하고, 상기 제1 이상징후 표적을 표시하는 과정을 더 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 선박의 위치 정보, 크기 정보, 이동 경로 정보, 예측 경로 정보 중 적어도 하나 이상을 포함하 는 빅데이터 분석 정보를 생성하고, 상기 빅데이터 분석 정보와 상기 항해 표적 정보를 비교하고, 상기 비교에 기반하여 상기 항해 표적이 이상징후 표적인지 여부를 결정하는 과정을 더 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 빅데이터 분석 정보가 포함하는 각 정보 값들을 산출하고, 상기 각 정보 값들에 가중치를 부여함으로써, 상기 항해 표적의 정보와 실제 항해 표적 의 항해 표적 정보를 비교하고, 상기 비교에 기반하여 상기 항해 표적이 이상징후 표적인지 여부를 결정하는 과 정을 더 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 빅데이터 분석 정보가 포함하는 정보들은 시간대 별, 기상상황 별, 계절 별, 어업 기간 별로 분류 가능할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 상기 항해 표적의 과거 이동 경로를 나타내는 이동 경로 정보를 생성하고, 상기 생성된 과거 이동 경로와 상기 항해 표적의 실제 경로를 비교하고, 상기 항해 표적의 과거 이동 경로와 상기 항해 표적의 실 제 경로가 일치하지 않으면 상기 항해 표적을 제2 이상징후 표적으로 결정하고, 상기 제2 이상징후 표적을 표시 하는 과정을 더 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 항해 표적의 이동 경로와 상기 항해 표적의 실제 경로가 기설정된 오차범위를 벗어나는 경우, 상기 항해 표적의 이동 경로와 상기 항해 표적의 실제 경로가 일치하지 않는 것으로 결정하는 과정을 더 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 항해 표적 정보와 상기 저장 표적 정보를 융합하여 상기 항해 표적의 예측 경로를 나타내는 예측 경로 정보를 생성하고, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로를 비교하고, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로가 일치하지 않으면 상기 항해 표적을 제2 이상징후 표적으로 결정하고, 상기 제2 이상징후 표적을 표시하는 과정 을 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 이상징후표적 감지 방법은, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로가 기설정된 오차범위를 벗어나는 경우, 상기 항해 표적의 예측 경로와 상기 항해 표적의 실제 경로가 일치하지 않는 것으로 결정하는 과정을 더 포함할 수 있다. 본 개시의 다양한 실시 예에 따르면, 상기 저장 표적 정보는 저장 표적들의 크기 정보, 위치 정보, 이동 경로 정보 또는 예측 경로 정보 중 적어도 하나 이상을 포함할 수 있다.본 개시의 다양한 실시 예에 따르면, 상기 선박식별장치는, AIS, V-PASS 또는 VHF-DSC일 수 있다. 본 개시에 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치 (예: 스마트 폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러 블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 개시의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“A 또는 B 중 적어도 하 나,”\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,”및 “A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소 와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어 와 함께 또는 이런 용어 없이, “커플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것 을 의미한다. 본 개시에서 사용된 용어 \"모듈\" 또는 “-부”는 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구 현될 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(read only memory, ROM), 전기적 삭제가능 프로그램가 능 롬(electrically erasable programmable read only memory, EEPROM), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(compact disc-ROM, CD-ROM), 디지털 다목적 디스크(digital versatile discs, DVDs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(local area network), WAN(wide area network), 또는 SAN(storage area network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근(access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별 도의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 개시에 포함되는 구성요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성요소에 제한되는 것은 아니며, 복수로 표현된 구성요소라 하더라도 단수로 구성되거나, 단수로 표현된 구성요소라 하더라도 복수로 구성될 수 있다. 이제까지 본 발명에 대하여 바람직한 실시 예를 중심으로 살펴보았다. 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자는 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 본 발명을 구현할 수 있 음을 이해할 것이다. 그러므로 상기 개시된 실시 예는 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으며, 특허청구범위에 의해 청구된 발 명 및 청구된 발명과 균등한 발명들은 본 발명에 포함된 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0136681", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예들에 따른, 빅데이터를 이용한 인공지능 기술 기반 이상징후 표적 감지 시스템의 예시적 인 블록도를 도시한다. 도 2는 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템에서 이상징후 표적으로 판단되는 선박을 설명하기 위한 일 예를 도시한다. 도 3a 및 3b는 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템에서 이상징후 표적으로 판단되는 선박을 설명하기 위한 일 예를 도시한다. 도 4는 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 개략적으로 설명하 기 위한 순서도의 일 예를 도시한다. 도 5은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 6은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 7은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서 도의 다른 예를 도시한다. 도 8은 다양한 실시 예들에 따른, 이상징후 표적 감지 시스템의 이상징후 표적 감지 방법을 설명하기 위한 순서도의 다른 예를 도시한다."}
