{"patent_id": "10-2023-0112847", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0033369", "출원번호": "10-2023-0112847", "발명의 명칭": "뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템", "출원인": "건양대학교산학협력단", "발명자": "천승철"}}
{"patent_id": "10-2023-0112847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신체착용 또는 의복부착을 위한 설치부(111)와, 전원부(112)와, 체온과 혈압 및 맥박과 심전도를 포함하는 생체신호를 측정하는 제1센서부(113)와, 설치부위의 움직임신호를 측정하는 제2센서부(114)와, 측정된 생체신호 및움직임신호를 송출하는 제1통신부(115)를 구비하는 착용모듈(110);상기 착용모듈(110)을 사용하는 사용자의 신장 및 체중과 성별 및 연령과 기초생체신호를 포함하는 신체정보와상기 착용모듈의 착용정보를 입력받는 입력부(121)와, 상기 제1통신부(115)와 연동하여 데이터를 중계하는 제2통신부(122)와, 상기 착용모듈(110)의 동작정보 및 판단정보를 출력하는 출력부(123)를 구비하는 단말모듈(120); 사용자 별로 측정된 생체신호 및 움직임신호를 수집하는 수집부(131)와, 수집된 생체신호 및 움직임신호를 각각신체정보 및 착용정보 별로 분류하는 정렬부(132)를 구비하는 데이터수집모듈(130);상기 데이터수집모듈(130)을 통해 수집 및 정렬된 데이터를 분석 및 학습하는 데이터분석모듈(140);상기 데이터분석모듈(140)의 분석 및 학습결과를 반영하여 기준신호를 생성 및 수정 관리하는 기준신호관리부(151)와, 측정되는 생체신호 및 움직임신호를 기준신호와 비교하며 뇌졸중 판단정보를 생성하는 판단부(152)를구비하는 판단모듈(150); 로 이루어지는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단을 위한 생체신호모니터링 시스템."}
{"patent_id": "10-2023-0112847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 단말모듈(120)은,시간 및 장소와 활동단위에 따라 이동, 운동, 일상, 수면을 포함하는 모드를 설정하여 설정된 모드별로 생체신호 및 움직임신호의 수집 및 분석이 이루어지도록 하는 모드설정부(124)를 더 포함하는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템."}
{"patent_id": "10-2023-0112847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,사용자가 생활하는 공간정보를 설정하는 공간설정부(161)와, 상기 제1통신부(115)와 연계하는 복수의 제3통신부(162)를 통해 공간 내 사용자의 위치정보를 생성하는 제3센서부(163)와, 생활공간에서 소요되는 전력과 수도 및공조계통과 연계하여 생활소비정보를 수집하는 연동부(164)를 구비하는 모니터링모듈(160); 을 더 포함하고,상기 데이터분석모듈(140)은 사용자별 생활소비정보를 분석 및 학습하며,상기 판단모듈(150)은, 분석 및 학습된 생활소비정보의 패턴변화를 상기 판단정보에 반영하는 정보지원부(153)를 더 포함하는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템."}
{"patent_id": "10-2023-0112847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 모니터링모듈(160) 및 단말모듈(120)과 선택적으로 연계하며, 설정된 연락처로 사용자의 신상정보 및 대응하는 판단정보를 송출하는 대응모듈(170); 을 더 포함하는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단공개특허 10-2025-0033369-3-을 위한 생체신호 모니터링 시스템."}
{"patent_id": "10-2023-0112847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 모니터링모듈(160)은,공간내 사용자의 행동을 촬영 및 인식하며 동작정보를 생성하는 동작분석부(165)와, 상기 동작정보를 움직임정보와 비교분석하며 시간 및 날짜에 따라 정렬하여 정형 및 비정형 패턴정보를 생성하는 패턴분석부(166)와, 상기 비정형 패턴정보를 분석하여 이상상황을 판단하는 상태분석부(167)를 더 포함하는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템."}
{"patent_id": "10-2023-0112847", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 출력부(123)를 통해 테스트동작 제시 후 대응하여 발생되는 움직임신호를 분석하여 매칭결과를 산출하는평가부(181)와, 매칭결과를 누적저장하여 동일 테스트동작에 따른 매칭결과의 비교정보를 생성하는 비교부(182)를 구비하는 평가모듈(180); 을 더 포함하는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템."}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 신체착용 또는 의복부착을 위한 설치부와, 전원부와, 체온과 혈압 및 맥박과 심전도를 포 함하는 생체신호를 측정하는 제1센서부와, 설치부위의 움직임신호를 측정하는 제2센서부와, 측정된 생 체신호 및 움직임신호를 송출하는 제1통신부를 구비하는 착용모듈; 상기 착용모듈을 사용하는 사 (뒷면에 계속)"}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템에 관한 것으로, 상세하게, 사용자 의 생체신호 및 움직임신호를 이용하되 인공지능 알고리즘에 기반한 프로세스를 이용하여 뇌졸중을 조기진단 가 능한, 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템에 관한 것이다."}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "뇌졸중(Stroke)은 뇌혈류 이상으로 인해 갑작스레 유발되는 국소적인 신경학적 결손 증상을 칭하는 것으로, 다 양한 원인으로 발생하고 전체 연령에 걸쳐 나타날 수 있는 증상이지만 특히 노년층에서의 발생이 많다. 뇌는 매우 중요하면서도 뇌졸중과 같은 증상에 취약한 기관으로, 혈액 공급이 30초 동안 차단되면 조직의 허혈 상태로 대사 과정에 이상이 오기 시작하고, 1분 동안 중단되면 뇌세포의 기능이 마비되며, 5분간 중단되면 불가 역성 변화로 신경세포의 괴사가 오게 되므로, 뇌졸중의 예방과 전조증상의 빠른 인지뿐 아니라 발생시 신속한 대응 및 치료가 무엇보다도 중요하다. 이러한 뇌졸중의 주요 증상은 의식장애, 반신 운동마비, 반신 감각마비, 언어 장애, 어지럼증, 갑작스런 두통과 구토, 시야 장애, 복시(1개의 물체가 2개로 보임), 삼키는 것의 장애 등이 알려졌으며, 뇌졸중의 발생을 의심하 게 하는 몇 가지 위험한 징후, 즉 전조증상으로는 몸의 한쪽이나 얼굴에 마비가 왔다가 풀림이나 힘이 빠짐, 감 각이 둔해짐, 갑자기 남의 말을 알아듣거나 말을 하기 어려움, 갑자기 시력이 떨어짐, 눈에 커튼을 친 것처럼 한쪽 시야가 어두움, 분명한 원인 없이 갑작스럽고 심하게 머리가 아픔, 갑자기 어지러워 서 있거나 걸을 수가 없음, 몸이 자꾸 한쪽으로 기울어 중심을 잡을 수 없는 증상 등이 알려져 있다. 하지만 평상시 관련 기저질환이나 관심이 없는 경우 이러한 전조증상에 대한 인지가 부족한 경우가 대부분일 뿐 아니라 민감하게 인식하지 못하고 일시적인 이상증상으로만 여겨 조치가 늦어져 상황이 악화되는 경우도 많은 실정이다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 공개특허 제10-2022-0075046호(2022.06.07)"}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 사용자의 신체에 착용하거나 의복에 부착함으로써 사용자의 생체신호 및 움직임신호를 측정하 되, 누적된 측정데이터의 분석 및 학습을 통해 완성된 조기진단 모델을 바탕으로 한, 뇌졸중 운동 이상증상 조 기진단을 위한 생체신호 모니터링 시스템을 제공하기 위한 것이다. 또한, 시간, 장소, 활동단위에 따른 모드 설정이 가능하며, 사용자의 생활 공간정보 및 생활소비정보 분석이 가 능하고 이를 바탕으로 한 동작 및 패턴정보 분석결과를 통해 이상상황을 판단 가능하도록 구성된, 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템을 제공하기 위한 것이다. 또한, 테스트동작에 대응하는 사용자의 움직임신호를 비교 분석 가능하도록 구성된, 뇌졸중 운동 이상증상 조기 진단을 위한 생체신호 모니터링 시스템을 제공하기 위한 것이다."}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은, 신체착용 또는 의복부착을 위한 설치부와, 전원부와, 체온과 혈압 및 맥박과 심전도를 포 함하는 생체신호를 측정하는 제1센서부와, 설치부위의 움직임신호를 측정하는 제2센서부와, 측정된 생체신호 및 움직임신호를 송출하는 제1통신부를 구비하는 착용모듈; 상기 착용모듈을 사용하는 사용자의 신장 및 체중과 성별 및 연령과 기초생체신호를 포함하는 신체정보와 상기 착용모듈의 착용정보를 입 력받는 입력부와, 상기 제1통신부와 연동하여 데이터를 중계하는 제2통신부와, 상기 착용모듈 의 동작정보 및 판단정보를 출력하는 출력부를 구비하는 단말모듈; 사용자 별로 측정된 생체신 호 및 움직임신호를 수집하는 수집부와, 수집된 생체신호 및 움직임신호를 각각 신체정보 및 착용정보 별 로 분류하는 정렬부를 구비하는 데이터수집모듈; 상기 데이터수집모듈을 통해 수집 및 정렬된 데이터를 분석 및 학습하는 데이터분석모듈; 상기 데이터분석모듈의 분석 및 학습결과를 반영하여 기 준신호를 생성 및 수정 관리하는 기준신호관리부와, 측정되는 생체신호 및 움직임신호를 기준신호와 비교 하며 뇌졸중 판단정보를 생성하는 판단부를 구비하는 판단모듈; 로 이루어지는 것을 특징으로 하는 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템을 제공한다. 일 양태에 따르면, 상기 단말모듈은, 시간 및 장소와 활동단위에 따라 이동, 운동, 일상, 수면을 포함하는 모드를 설정하여 설정된 모드별로 생체신호 및 움직임신호의 수집 및 분석이 이루어지도록 하는 모드설정부 를 더 포함할 수 있다. 일 양태에 따르면, 사용자가 생활하는 공간정보를 설정하는 공간설정부와, 상기 제1통신부와 연계하 는 복수의 제3통신부를 통해 공간 내 사용자의 위치정보를 생성하는 제3센서부와, 생활공간에서 소요 되는 전력과 수도 및 공조계통과 연계하여 생활소비정보를 수집하는 연동부를 구비하는 모니터링모듈 ; 을 더 포함하고, 상기 데이터분석모듈은 사용자별 생활소비정보를 분석 및 학습하며, 상기 판단모 듈은, 분석 및 학습된 생활소비정보의 패턴변화를 상기 판단정보에 반영하는 정보지원부를 더 포함할 수 있다. 일 양태에 따르면, 상기 모니터링모듈 및 단말모듈과 선택적으로 연계하며, 설정된 연락처로 사용자 의 신상정보 및 대응하는 판단정보를 송출하는 대응모듈; 을 더 포함할 수 있다. 일 양태에 따르면, 상기 모니터링모듈은, 공간내 사용자의 행동을 촬영 및 인식하며 동작정보를 생성하는 동작분석부와, 상기 동작정보를 움직임정보와 비교분석하며 시간 및 날짜에 따라 정렬하여 정형 및 비정형 패턴정보를 생성하는 패턴분석부와, 상기 비정형 패턴정보를 분석하여 이상상황을 판단하는 상태분석부 를 더 포함할 수 있다. 일 양태에 따르면, 상기 출력부를 통해 테스트동작 제시 후 대응하여 발생되는 움직임신호를 분석하여 매 칭결과를 산출하는 평가부와, 매칭결과를 누적저장하여 동일 테스트동작에 따른 매칭결과의 비교정보를 생 성하는 비교부를 구비하는 평가모듈; 을 더 포함할 수 있다."}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템은, 신체착용 또는 의복부착을 통해 측정된 사용자의 생체신호 및 움직임신호를 바탕으로 뇌졸중의 조기진단이 가능한 장점이 있다. 또한, 사용자의 생활패턴에 맞게 다양한 모드 설정이 가능하며, 사용자의 생활공간정보 및 생활소비정보 분석 결과를 바탕으로 한 동작 및 패턴정보 분석결과를 통해 이상상황 판단이 가능하므로 뇌졸증 조기진단의 민감도 와 정확도를 향상시키는 효과가 있다. 또한, 데스트동작 제시가 가능하여 이에 대응하는 사용자의 움직임신호 비교분석을 통한 뇌졸중 조기진단을 통 해 신뢰성을 높일 수 있게 된다."}
{"patent_id": "10-2023-0112847", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 특징과 장점은 첨부된 도면에 의하여 설명되는 실시 예에 의하여 보다 명확하게 이해될 수 있을 것이다. 본 발명의 실시 예에 기재되거나 도면에 도시된 구성요소들의 구성 및 배열에 의해 본 발명의 응용이 제한되는 것은 아니다. 본 발명은 다른 실시 예들로 구현될 수 있고, 다양한 방법으로 수행될 수 있다. 또한, 장치 또는 요소의 방향 등과 같은 용어들에 관하여 실시 예에 사용된 표현 및 술어는 단지 본 발명의 설명을 단순화하기 위해 사용되며, 관련된 장치 또는 요소가 단순히 특정 방향을 가져야 함을 나타내거나 의미하지 않는다. 예를 들면, \"제1\", \"제2\"와 같은 용어가 본 발명을 설명하는 실시 예와 청구항에 사용되는데, 이러한 용어가 상대적 인 중요성 또는 취지를 나타내거나 의미하는 것으로 의도되지 않는다. 또한, 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정하여 해석되어서는 아 니되며, 발명자가 발명의 용어와 개념을 가장 최선의 방법으로 설명하기 위하여 본 발명의 기술적 사상에 부합 하는 의미와 개념에 입각하여 기재한 것으로 해석하여야 한다. 따라서 본 발명은 제시되는 실시예에 한정되지 않으며, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자 에 의하여 본 발명의 기술 사상과 아래에 기재될 특허청구 범위에 기재된 기술상의 균등한 범위 내에서 다양한 수정 및 변경이 가능하다. <제1실시예> 먼저 본 발명에 따른 제1실시예에 대해 설명한다. 도 1은 본 발명에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템의 개략적인 개념도를 도시한 것이며, 도 2는 본 발명의 제1실시예에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템의 구성을 설명하기 위해 도시한 블록도를 나타낸 것이다. 도 1 및 도 2에 도시된 바와 같이, 본 발명의 제1실시예에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신 호 모니터링 시스템은 착용모듈, 단말모듈, 데이터수집모듈, 데이터분석모듈 및 판단모듈 를 포함하도록 구성된다. 착용모듈은 사용자의 각종 생체신호 및 움직임신호를 측정하고자 하는 신체부위에 부착되도록 구성된다. 이를 위해 상기 착용모듈은 설치부, 전원부, 제1센서부, 제2센서부 및 제1통신부 를 포함하도록 구성된다. 설치부는 착용모듈을 사용자의 신체에 착용하거나 의복에 부착함으로써 고정시키기 위한 것으로, 사 용자의 손목, 발목 등 신체부위에 착용 가능하거나 사용자의 바지, 상체 의복과 같은 의류에 부착 가능하도록 구성된다. 한편, 사용자의 보다 정확한 신호를 측정하기 위한 측면에서, 상기 설치부는 시계나 발찌 형태 로 사용자 신체에 직접 착용되는 것이 유리하다. 전원부는 착용모듈를 작동시키기 위한 에너지원을 제공하기 위한 것으로, 플렉서블 배터리를 포함하 도록 구성되는 것을 특징으로 할 수 있다. 이러한 플렉서블 배터리는 전극조립체 및 외장재를 포함하도록 구성 된다. 전극조립체는 외장재의 내부에 전해액과 함께 봉지되는 것으로 양극과 음극사이에 분리막이 형성된 형태를 가질 수 있다. 상기 양극은 양극집전체 및 양극활물질을 포함하고, 음극은 음극집전체 및 음극활물질을 포함하며, 분 리막은 부직포층의 일면 또는 양면에 나노섬유웹층을 포함하도록 구성된다. 이때 사용되는 집전체, 전극활물질, 부직포, 나노섬유 및 전해액의 구체적인 물질은 리튬 배터리 분야에서 통상적으로 사용되는 것이라면 특별히 한 정되지 않고 사용될 수 있으므로, 이에 대한 설명은 생략하도록 한다. 상기 외장재는 내부에 전극조립체 및 전해액을 수용함으로써 외력으로부터 전극조립체를 보호하기 위한 것으로, 한 쌍의 외장재로 구비되되, 테두리를 따라 접착제를 통해 밀봉되도록 구성된다. 이때 상기 외장재의 적어도 일 면에 밴딩 시 수축 및 이완을 위한 패턴이 구비되며, 상세하게, 외장재의 폭방향과 평행하게 형성된 산부와 골 부가 외장재의 길이방향을 따라 반복적으로 배열되도록 구성된다. 이에 따라 사용자의 손목 또는 발목 부위의 신전 및 굴곡이 이루어지는 부위에 부착 시 플랙시블 배터리의 수축 및 이완이 용이하게 이루어져 안정적인 전 원공급이 가능하게 된다. 한편, 상기 전극조립체 또한 상기 외장재에 형성되는 패턴과 동일한 패턴이 구비되는 것이 바람직하다. 제1센서부는 사용자의 기본 생체신호를 측정하기 위한 것으로, 사용자의 체온, 혈압, 맥박 및 심전도를 포 함하는 생체신호를 측정하도록 사용자의 손목에 위치하도록 구성된다. 제2센서부는 사용자의 움직임 정도를 나타내는 움직임신호를 측정하기 위한 것으로, 사용자의 손목, 발목 과 같이 신전(extension) 및 굴곡(flexion)이 이루어지는 사지의 말단부에 위치하도록 구성된다. 이때 상기 움 직임은 뇌로부터 기인하는 신호의 직접적인 결과로, 비자발적 근육 움직임 등은 제외된다. 한편, 뇌졸중의 초기 증상인 편마비 증상의 경우 사용자의 좌측과 우측 사지의 움직임 차이가 큰 특징을 가지므 로, 상기 제2센서부는 사용자의 좌측과 우측 사지의 말단부에 모두 위치하도록 구성되는 것이 바람직하다. 구체적인 움직임 정도 또는 좌우측 움직임 차이에 따른 뇌졸중 조기진단 기준에 대해서는 후술하도록 한다. 이러한 제2센서부를 통해 사용자의 신체 움직임을 감지하고 사지 말단부의 움직임에 따른 속도, 가속도, 이동거리 등 특성 값을 전기적 신호로 추출하게 된다. 이때 가속도는 단위시간당 움직이는 속도의 변화를 의미 하며, 이동거리는 속도와 시간을 이용하여 구할 수 있다. 제1통신부는 상기 제1센서부 및 제2센서부에 의해 측정된 사용자의 생체신호와 움직임신호를 후 술되는 단말모듈으로 전송하기 위한 것으로, 유선 또는 무선 송수신 모듈을 포함하도록 구성된다. 단말모듈은 상술된 착용모듈에 의해 전송된 사용자의 생체신호와 움직임신호를 포함하는 정보를 출력 하기 위한 것으로, 입력부, 제2통신부 및 출력부를 구비하도록 구성된다. 입력부는 상기 착용모듈을 사용하는 사용자의 신체정보와 상기 착용모듈의 착용정보를 입력하기 위한 것으로, 사용자의 신장, 체중, 성별과 연령; 및 혈액형 등 기초생체신호를 포함하는 신체정보와 상기 착용 모듈의 착용위치, 착용개수, 착용시간, 착용시간 등의 착용정보를 입력할 수 있도록 구성된다. 제2통신부는 상기 제1통신부와 연동되어 전송된 데이터를 중계하기 위한 것으로, 유선 또는 무선 모 듈을 구비하도록 구성된다. 출력부는 상기 착용모듈의 ON/OFF 동작정보 및 상기 측정된 생체신호와 움직임신호를 포함하는 판단 정보를 텍스트, 그래픽, 동영상 등으로 출력하기 위한 것으로, 액정표시장치(Light Crystal Display, LCD) 등의 표시장치로 구성될 수 있다. 즉, 제2통신부를 통해 수신된 사용자의 신체신호와 움직임신호는 상기 입력부에 입력받은 사용자의 신체정보, 착용모듈의 착용정보와 함께 상기 출력부에 표시되도록 함으로써 원거리에 있는 보호자 또는 의 료진에게 관련 정보를 전달할 수 있게 된다. 상기 단말모듈은, 사용자의 일상생활 환경변화에 따른 모드설정이 가능하도록 모드설정부를 더 포함 할 수 있다. 구체적으로, 시간 및 장소와 활동단위에 따라 이동, 운동, 일상, 수면을 포함하는 모드를 설정하여 설정된 모드별로 생체신호 및 움직임신호의 수집 및 분석이 이루어지도록 함으로써, 각 모드에 따른 빅데이터를 구축하여 뇌졸중 조기진단의 정확도를 향상시키게 된다. 데이터수집모듈은 상기 착용모듈 사용자의 각종 신호를 데이터로 수집하고 분류하여 모델 학습을 위 한 빅데이터를 구축하기 위한 것으로, 수집부 및 정렬부를 포함하도록 구성된다. 수집부는 상기 착용모듈에 의해 사용자 별로 측정된 생체신호 및 움직임신호를 실시간으로 수집함으 로써 빅데이터를 형성하고, 정렬부는 상기 수집된 생체신호 및 움직임신호를 각각 신체정보 및 착용정보 별로 분류하도록 구성된다. 데이터분석모듈은 상기 데이터수집모듈을 통해 수집 및 정렬된 데이터를 분석 및 학습하기 위한 것으 로, 인공지능 알고리즘에 기반한 프로세스를 이용하도록 구성된다. 즉, 상술한 수집 및 분류된 데이터를 입력 데이터로 하고, 뇌졸중 조기증상 발생여부를 기준으로 한 \"정상\" 또 는 \"이상\"결과를 출력 데이터로 하는 학습 데이터 세트를 기반으로 조기진단 모델을 학습시킨다. 이때 데이터분 석모듈은 심층 신경망(DNN)을 이용하여 모델을 학습시킬 수 있으며, 관련 사용자에 대한 빅데이터 학습을 통하여 모델의 신뢰성을 높일 수 있게 된다. 판단모듈은 상술된 데이터분석모듈에 학습 완료된 조기진단 모델을 바탕으로 사용자, 즉 분석 대상자 에 대한 현재의 신호에 대응하여 뇌졸중 전조증상 발생여부를 판단하기 위한 것으로, 기준신호관리부와 판 단부를 포함하도록 구성된다. 기준신호관리부는 상기 데이터분석모듈의 분석 및 학습결과를 반영하여 기준신호를 생성 및 수정 관 리하도록 구성된다. 이때 기준신호는 마비가 없는 정상상태에서 나타나는 생체신호 및 움직임신호를 의미한다. 즉, 기준신호 값 이내에서 발생하는 생체신호 및 움직임신호 값은 정상적인 상태를 의미하고, 기준신호 값을 벗 어나서 발생하는 각 신호 값은 해당 사용자에서 뇌졸중 전조증상이 발생하였음을 의미한다. 판단부는 전술된 착용모듈에 의해 측정되는 생체신호 및 움직임신호를 전달받아 각 신호 값의 기준신 호 값 초과여부를 판단하는 역할을 한다. 즉, 사용자의 생체신호 및 움직임신호에 기초하여, 착용모듈을 장착한 사용자가 뇌졸중의 전조증상, 예를 들면 편마비 증상이 발현되는지를 판별할 수 있게 된다. 본 발명의 제1실시예에 따르면, 사용자에 대응하여 수집된 현재의 임상 데이터를 기 학습된 조기진단 모델에 적 용하는 것을 통하여 뇌졸중 전조증상의 발생여부를 조기에 진단할 수 있게 된다. 아울러, 뇌졸중의 조기진단 결 과를 기반으로 의료진으로 하여금 사용자 별로 향후 치료/재활 프로그램의 계획을 보다 효율적으로 수립하고 병 증 악화에 대비할 수 있도록 함은 물론, 질병의 진행 억제 및 효율적 질병 관리가 가능하도록 한다. <제2실시예> 다음으로 본 발명에 따른 제2실시예에 대해 설명한다. 제2실시예에서는 제1실시예와 대응하는 구성요소에 대해 동일한 도면부호를 사용하기로 한다. 도 3은 본 발명의 제2실시예에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템의 구성을 설명하기 위해 도시한 블록도를 나타낸 것이다. 본 발명의 제2실시예에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템은 도 도 1 및 도 3에 도시된 바와 같이, 사용자의 생활소비정보 패턴변화를 반영하기 위한 모니터링모듈; 사용자의 판단정 보를 설정된 연락처로 송출하는 대응모듈; 및 테스트동작 제시에 따른 사용자의 움직임신호를 반영하기 위 한 평가모듈을 더 포함하도록 구성된 것으로, 뇌졸중 조기진단의 민감도 및 정확도가 향상되되 이상상황 또는 응급상황에 대한 신속한 대응이 가능하도록 구성된다. 모니터링모듈은 사용자의 생활 공간정보 및 생활소비정보를 반영하기 위한 것으로, 공간설정부, 제3 통신부, 제3센서부 및 연동부를 포함하도록 구성된다. 공간설정부는 사용자가 생활하는 공간정보를 설정하도록 구성된다. 비한정적인 예로, 사용자의 생활공간이 집 또는 마트, 병원 등 편의시설인지에 따라 \"홈 모드\" 또는 \"외출 모드\"를 설정 가능하도록 함으로써 사용자가 머무는 공간특성에 따른 추가 정보를 수집할 수 있게 된다. 일 예로, 상기 추가 정보는 \"홈 모드\"에서 사용자가 사용하는 전력소비량, 수도사용량 등 생활소비정보일 수 있다. 제3통신부는 상기 제1통신부와 연계되어 전송된 데이터를 중계하되, 사용자의 위치정보를 생성하도록 구성된다. 이를 위해 사용자가 머무는 공간 내 사용자의 위치정보를 생성하도록 제3센서부를 더 포함함으 로써 사용자의 비정상적인 움직임신호 등을 파악할 수 있게 된다. 일 예로, 사용자가 \"홈 모드\"에서 생성한 위 치정보가 화장실이고, 특정 기간 이상 사용자의 위치변화가 발생하지 않을 경우, 제1통신부에 의해 전송된 생체신호 및 움직임신호를 종합적으로 참조함으로써 사용자의 응급상황 등을 즉시 발견할 수 있게 된다. 연동부는 사용자가 생활공간에서 소요되는 전력과 수도 및 공조계통과 연계하여 생활소비정보를 수집하도 록 구성된다. 즉, 공간설정부에 의해 설정된 공간 내에서 제3통신부 및 제3센서부를 통해 생성 및 전달된 사 용자의 위치정보, 생체신호 및 움직임 신호, 그리고 연동부에 의해 수집되는 생활소비정보를 종합적으로 참조함으로써 보다 정교한 빅데이터를 구축할 수 있게 된다. 이를 위해 상기 데이터분석모듈은 사용자 별 생활소비정보를 분석 및 학습하도록 구성되며, 상기 판단모듈 은 분석 및 학습된 생활소비정보의 패턴변화를 상기 판단정보에 반영하는 정보지원부가 더 포함될 수 있다. 상술된 모니터링모듈 및 정보지원부를 더 포함함에 따라, 사용자의 착용모듈에 의해 측정된 생 체신호 및 움직임신호는 물론 특정 공간에서의 사용자의 위치정보와 생활소비정보를 모두 고려한 패턴변화를 반 영한 판단정보를 생성하도록 함으로써 보다 정확하게 뇌졸중의 조기진단에 응할 수 있다. 일 양태에 따르면, 상기 모니터링모듈은 동작분석부, 패턴분석부 및 상태분석부를 더 포함 함으로써 응급상황과 더불어 일정 기간 내 사용자의 동작정보 패턴변화에 따른 이상상황을 판단함으로써 사용자 를 둘러싼 문제 상황을 보다 민감하게 파악할 수 있게 된다. 동작분석부는 공간 내 사용자의 행동을 촬영 및 인식하며 동작정보를 생성하기 위한 것으로 사용자의 행동 변화에 대해 보다 직관적으로 파악할 수 있게 된다. 패턴분석부는 상기 동작정보를 움직임정보와 비교분석하며 시간 및 날자에 따라 정렬하여 정형 및 비정형 패턴정보를 생성하도록 구성된다. 이때 사용자의 동작정보를 일정 주기동안 비교분석 함으로써 전체적인 패턴에 있어 특이사항 발생여부를 미리 파악할 수 있도록 한다. 상태분석부는 상기 비정형 패턴정보를 분석하여 이상상황을 판단하도록 구성된다. 예를 들면, 좌측과 우측 의 사지 움직임 차이가 점차 커지거나, 사지의 움직임이 일정기간 동안 측정되지 않거나 하는 등 이상상황을 미 리 파악함으로써 뇌졸증 조기증상에 민감하게 즉시 대처할 수 있게 된다. 대응모듈은 이러한 위급상황 또는 비정상적인 상황을 설정된 연락처로 송출하기 위한 것으로, 상기 모니터 링모듈및 단말모듈과 선택적으로 연계되며, 설정된 연락처로 사용자의 신상정보 및 대응하는 판단정 보를 송출하도록 구성된다. 상기 연락처는 착용모듈 사용자의 보호자 또는 담당의사 또는 지정병원 의료진 의 연락처로 설정됨에 따라 사용자의 응급상황 발생 시 보다 신속하게 대처할 수 있게 된다. 평가모듈은 뇌졸중 조기진단 결과의 신뢰도를 향상시키기 위한 것으로, 사용자의 기본적인 움직임신호 외 에 특정 테스트동작 제시에 따른 평가모드를 실행 가능하도록 구성된다. 이를 위해 평가모듈은 평가부 , 및 비교부를 포함하도록 구성된다. 평가부는 상기 출력부를 통해 테스트동작 제시 후 대응하여 발생하는 움직임신호를 분석하여 매칭결 과를 산출하도록 구성된다. 상기 테스트동작은 전술한 바와 같이, 신전과 굴곡이 이루어지는 사지 말단부의 움 직임을 분석가능하도록 설계되는 것이 바람직하다. 비교부는 상기 매칭결과를 누적 저장하여 동일 테스트동작에 따른 매칭결과의 비교정보를 생성하도록 구성 된다. 즉, 상기 평가부에 의해 산출되는 매칭결과 및 상기 비교부에 의해 생성되는 기준정보를 바탕 으로 좌측과 우측 사지의 움직임 차이 또는 테스트동작 대비 유사도 등을 종합적으로 판단함으로써 뇌졸중의 초 기 증상인 편마비 증상을 발견할 수 있게 된다. 본 발명의 제2실시예에 따르면, 사용자의 서로 다른 생활공간에서의 각종 패턴변화를 반영하여 구축된 빅데이터 를 기반으로 함으로써 뇌졸중 조기진단의 정확도 및 민감도를 현저히 향상시킬 수 있게 된다. 또한, 테스트동작 제시에 따른 매칭결과 추가 반영을 통해 뇌졸중 조기진단의 신뢰도를 향상시켜 오진단에 따른 오류정보 전송 등 을 사전에 막을 수 있게 된다. 이상에서와 같이 본 발명의 권리는 위에서 설명된 실시예에 한정되지 않고 청구범위에 기재된 바에 의해 정의되 며, 본 발명의 분야에서 통상의 지식을 가진 자가 청구범위에 기재된 권리범위 내에서 다양한 변형과 개작을 할 수 있다는 것은 자명하다."}
{"patent_id": "10-2023-0112847", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템의 개략적인 개념도를 도시한 것이며, 도 2는 본 발명의 제1실시예에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템의 구성을 설명하기 위해 도시한 블록도를 나타낸 것이고, 도 3은 본 발명의 제2실시예에 따른 뇌졸중 운동 이상증상 조기진단을 위한 생체신호 모니터링 시스템의 구성을 설명하기 위해 도시한 블록도를 나타낸 것이다."}
