{"patent_id": "10-2023-0011282", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0118611", "출원번호": "10-2023-0011282", "발명의 명칭": "부동산 임대 관리 서비스를 제공하기 위한 방법, 시스템 및 비일시성의 컴퓨터 판독 가능한", "출원인": "주식회사 디엔코리아", "발명자": "샴파인 매튜 제프리"}}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부동산 임대 관리 서비스를 제공하기 위한 방법으로서,신용 평가 모델을 이용하여 임차인에 대한 신용 평가 정보를 결정하는 단계, 및상기 결정된 신용 평가 정보를 참조하여 상기 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로설정할 수 있도록 지원하는 단계를 포함하고,상기 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신상 정보, 소득 정보 및 연체 이력정보 중 적어도 하나를 참조하여 학습되는방법."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 부동산 풀은 적어도 하나의 임대인과 서비스 제공자 사이의 계약에 기초하여 형성되는방법."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 지원 단계에서, 상기 임차인의 신용 평가 정보가 신용 기준을 충족하는 것에 대응하여, 상기 임차인에게적용되는 보증금의 적어도 일부를 면제하는 계약 조건을 설정할 수 있도록 지원하는방법."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 지원 단계에서, 상기 임차인의 신용 평가 정보가 신용 기준을 충족하지 않는 것에 대응하여, 상기 임차인에게 적용되는 적어도 일부의 월세를 선납하는 계약 조건을 설정할 수 있도록 지원하는방법."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 지원 단계에서, 상기 임차인이 근로하는 대상 기업과 서비스 제공자 사이에서 상기 계약 조건을 설정할 수있도록 지원하는방법."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 따른 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 비일시성의 컴퓨터 판독 가능 기록 매체."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "부동산 임대 관리 서비스를 제공하기 위한 시스템으로서,신용 평가 모델을 이용하여 임차인에 대한 신용 평가 정보를 결정하는 신용 정보 결정부, 및공개특허 10-2024-0118611-3-상기 결정된 신용 평가 정보를 참조하여 상기 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로설정할 수 있도록 지원하는 계약 조건 관리부를 포함하고,상기 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신상 정보, 소득 정보 및 연체 이력정보 중 적어도 하나를 참조하여 학습되는시스템."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 부동산 풀은 적어도 하나의 임대인과 서비스 제공자 사이의 계약에 기초하여 형성되는시스템."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 계약 조건 관리부는, 상기 임차인의 신용 평가 정보가 신용 기준을 충족하는 것에 대응하여, 상기 임차인에게 적용되는 보증금의 적어도 일부를 면제하는 계약 조건을 설정할 수 있도록 지원하는시스템."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 계약 조건 관리부는, 상기 임차인의 신용 평가 정보가 신용 기준을 충족하지 않는 것에 대응하여, 상기 임차인에게 적용되는 적어도 일부의 월세를 선납하는 계약 조건을 설정할 수 있도록 지원하는시스템."}
{"patent_id": "10-2023-0011282", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 계약 조건 관리부는, 상기 임차인이 근로하는 대상 기업과 서비스 제공자 사이에서 상기 계약 조건을 설정할 수 있도록 지원하는시스템."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 태양에 따르면, 부동산 임대 관리 서비스를 제공하기 위한 방법으로서, 신용 평가 모델을 이용하여 임차인에 대한 신용 평가 정보를 결정하는 단계, 및 상기 결정된 신용 평가 정보를 참조하여 상기 임차인이 거주 할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도록 지원하는 단계를 포함하고, 상기 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신상 정보, 소득 정보 및 연체 이력 정보 중 적어도 하 나를 참조하여 학습되는 방법이 제공된다."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 부동산 임대 관리 서비스를 제공하기 위한 방법, 시스템 및 비일시성의 컴퓨터 판독 가능한 기록 매 체에 관한 것이다."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "부동산 산업에서 개발, 분양보다는 운영 관리가 본질적인 영역이라고 할 수 있다. 부동산의 개발 및 분양은 부 동산 사업 앞단의 일부분에서 이루어질 뿐이며, 대부분의 기간은 운영 관리 기간에 해당하기 때문에, 부동산 운 영 관리의 선진화, 효율화, 기업화가 부동산 산업 발전의 핵심적 과제라고 할 수 있다. 이에 따라 부동산 운영 관리의 활성화를 통해 부동산 산업의 발전을 도모하면서 전, 월세난을 해소하고자 국내에서는 2014년부터 주택 임대관리업이 법제화되었다. 한편, 부동산 임대관리업은 상업용 부동산 임대관리업과 주거용 부동산 임대관리업으로 구분된다. 국내에서 상 업용 부동산을 기업, 리츠, 부동산 펀드와 같은 대형 투자자나 기관들이 보유하고 있기 때문에, 부동산 매입이 나 자산 운용에 대하여 소유주들이 전문적인 자산 관리 회사(AMC; Asset Management Company)에 의뢰하는 형태 를 취하고 있다. 또한, 운영 관리 업무도 대부분 외부에 위탁하는 형태를 취하고 있다.상업용 부동산과 달리 주거용 부동산의 소유주는 대부분 개인 임대인으로 구성되어 있다. 월세계약인 경우 보 증금 규모가 크고, 월세가 적은 보증부 월세가 대부분이므로, 임대주택에서 임대료 현금흐름이 적기 때문에 수 익형 부동산으로 투자되기는 어려운 실정이다. 즉, 주거용 부동산의 경우, 임대 관리 수수료를 제대로 지급하 면서 임대 관리를 위탁하기 어려운 사업 구조를 지니고 있으므로 상업용 부동산에 비해 영세한 규모로 운영 관 리가 이루어지고 있다. 그러나, 주택임대관리업 제도의 도입 취지와 같이 시중의 여유 자금을 전, 월세 시장으로 유인해 전, 월세 물량 부족 현상을 해결하기 위해서는 주거용 임대관리업이 활성화될 필요성이 있다. 이에 본 발명자(들)는, 신용 평가 모델을 이용하여 임차인에 대한 신용 평가 정보를 결정하고, 결정된 신용 평 가 정보를 참조하여 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도록 지원하 는 기술을 제안하는 바이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2019-0043213호 (2019.04.26)"}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래 기술의 문제점을 모두 해결하는 것을 그 목적으로 한다. 또한, 본 발명은, 자체 구축된 신용 평가 모델을 활용하여 부동산 풀에 연관된 적어도 하나의 임차인에 대한 신 용 평가 정보를 결정함으로써, 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도 록 지원하는 것을 다른 목적으로 한다. 또한, 본 발명은, 대상 기업이 보증금 및 계약 기간의 부담 없이 대상 기업의 근로자에게 사택을 제공하는 사내 복지를 구현하는 것을 또 다른 목적으로 한다."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 대표적인 구성은 다음과 같다. 본 발명의 일 태양에 따르면, 부동산 임대 관리 서비스를 제공하기 위한 방법으로서, 신용 평가 모델을 이용하 여 임차인에 대한 신용 평가 정보를 결정하는 단계, 및 상기 결정된 신용 평가 정보를 참조하여 상기 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도록 지원하는 단계를 포함하고, 상기 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신상 정보, 소득 정보 및 연체 이력 정보 중 적 어도 하나를 참조하여 학습되는 방법이 제공된다. 본 발명의 다른 태양에 따르면, 부동산 임대 관리 서비스를 제공하기 위한 시스템으로서, 신용 평가 모델을 이 용하여 임차인에 대한 신용 평가 정보를 결정하는 신용 정보 결정부, 및 상기 결정된 신용 평가 정보를 참조하 여 상기 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도록 지원하는 계약 조건 관리부를 포함하고, 상기 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신상 정보, 소득 정보 및 연체 이력 정보 중 적어도 하나를 참조하여 학습되는 시스템이 제공된다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 비일시성의 컴퓨터 판독 가능한 기록 매체가 더 제공된다."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 자체 구축된 신용 평가 모델을 활용하여 부동산 풀에 연관된 적어도 하나의 임차인에 대한 신용 평가 정보를 결정함으로써, 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있 도록 지원할 수 있게 된다.또한, 본 발명에 의하면, 대상 기업이 보증금 및 계약 기간의 부담 없이 대상 기업의 근로자에게 사택을 제공하 는 사내 복지를 구현할 수 있는 있게 된다."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명 의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기 재되어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실 시예로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정 신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미로서 행하여지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 구성요소를 나타낸다."}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하에서는, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있도록 하 기 위하여, 본 발명의 여러 바람직한 실시예에 관하여 첨부된 도면을 참조하여 상세히 설명하기로 한다. 본 발명에서, 부동산 객체는 필지 등의 단위에 의하여 다른 부동산과 구분될 수 있는 부동산을 가리키는 것이며, 민법에서 정하는 토지 및 그 정착물(예를 들면, 건물 등)이라면 모두 본 발명에서 말하는 부동산 객체 가 될 수 있다. 본 발명의 일 실시예에 따르면, 부동산 객체는 디지털 지도상에 표시되어 서비스 이용자에 의 하여 선택될 수 있는 그래픽 객체에 대응되는 개념일 수 있으며, 이렇게 선택되는 부동산 객체는 등기부등본(또 는 부동산 고유번호)을 기준으로 할 때 하나의 부동산만을 포함하거나 둘 이상의 부동산을 포함할 수 있다. 본 발명에서, 대상 부동산 객체는 서비스 이용자에 의하여 특정되는 부동산 객체를 의미할 수 있다. 본 발명의 일 실시예에 따르면, 이러한 대상 부동산 객체는 서비스 이용자로부터 입력되는 특정 부동산 객체에 관한 식별 정보(예를 들면, 주소, 건물명 등)를 참조하여 특정될 수 있고, 디지털 지도 상에서 서비스 이용자에 의하여 선 택되는 부동산 객체가 대상 부동산 객체로서 특정될 수도 있다. 또한, 본 발명의 일 실시예에 따르면, 대상 부 동산 객체의 유형은 집합건물과 토지건물로 구분될 수 있다. 본 발명의 일 실시예에 따른 집합건물은 법률 상 '집합건물의 소유 및 관리에 관한 법률'의 적용 대상인 부동산으로서, 아파트, 구분상가, 오피스텔, 연립주택, 다세대주택 등을 의미할 수 있다. 본 발명의 일 실시예에 따른 토지건물은 '집합건물의 소유 및 관리에 관한 법률'의 적용 대상이 아닌 모든 부동산으로서, 토지, 상업용 부동산, 공업용 부동산, 농업용 부동산 등을 의미 할 수 있다. 전체 시스템의 구성 도 1은 본 발명의 일 실시예에 따라 부동산 임대 관리 서비스를 제공하기 위한 전체 시스템의 개략적인 구성을 나타내는 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 전체 시스템은 통신망, 서비스 제공 시스템 및 디바이스를 포함할 수 있다. 먼저, 본 발명의 일 실시예에 따른 통신망은 유선 통신이나 무선 통신과 같은 통신 양태를 가리지 않고 구 성될 수 있으며, 근거리 통신망(LAN; Local Area Network), 도시권 통신망(MAN; Metropolitan Area Network), 광역 통신망(WAN; Wide Area Network) 등 다양한 통신망으로 구성될 수 있다. 바람직하게는, 본 명세서에서 말 하는 통신망은 공지의 인터넷 또는 월드 와이드 웹(WWW; World Wide Web)일 수 있다. 그러나, 통신망 은, 굳이 이에 국한될 필요 없이, 공지의 유무선 데이터 통신망, 공지의 전화망 또는 공지의 유무선 텔레 비전 통신망을 그 적어도 일부에 있어서 포함할 수도 있다. 예를 들면, 통신망은 무선 데이터 통신망으로서, 와이파이(WiFi) 통신, 와이파이 다이렉트(WiFi-Direct) 통신, 롱텀 에볼루션(LTE; Long Term Evolution) 통신, 5G 통신, 블루투스 통신(저전력 블루투스(BLE; Bluetooth Low Energy) 통신 포함), 적외선 통신, 초음파 통신 등과 같은 종래의 통신 방법을 적어도 그 일부분 에 있어서 구현하는 것일 수 있다. 다른 예를 들면, 통신망은 광 통신망으로서, 라이파이(LiFi; Light Fidelity) 등과 같은 종래의 통신 방법을 적어도 그 일부분에 있어서 구현하는 것일 수 있다. 다음으로, 본 발명의 일 실시예에 따른 서비스 제공 시스템은 신용 평가 모델을 이용하여 임차인에 대한 신용 평가 정보를 결정하고, 결정된 신용 평가 정보를 참조하여 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도록 지원하는 기능을 수행할 수 있다. 본 발명에 따른 서비스 제공 시스템의 구성과 기능에 관하여는 이하의 상세한 설명을 통하여 자세하게 알 아보기로 한다. 다음으로, 본 발명의 일 실시예에 따른 디바이스는 서비스 제공 시스템에 접속한 후 통신할 수 있는 기능을 포함하는 디지털 기기로서, 스마트폰, 태블릿, 스마트 워치, 스마트 밴드, 스마트 글래스, 데스크탑 컴 퓨터, 노트북 컴퓨터, 워크스테이션, PDA, 웹 패드, 이동 전화기 등과 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기라면 얼마든지 본 발명에 따른 디바이스로서 채택될 수 있다. 특히, 디바이스는, 서비스 이용자가 서비스 제공 시스템으로부터 본 발명에 따른 서비스를 제공받을 수 있도록 지원하는 애플리케이션(미도시됨)을 포함할 수 있다. 이와 같은 애플리케이션은 서비스 제공 시스템 또는 외부의 애플리케이션 배포 서버(미도시됨)로부터 다운로드된 것일 수 있다. 한편, 이러한 애플리케 이션의 성격은 후술할 바와 같은 서비스 제공 시스템의 신용 정보 결정부, 계약 조건 관리부, 통신부 및 제어부와 전반적으로 유사할 수 있다. 여기서, 애플리케이션은 그 적어도 일부가 필요에 따라 그것과 실질적으로 동일하거나 균등한 기능을 수행할 수 있는 하드웨어 장치나 펌웨어 장치로 치환될 수도 있다. 서비스 제공 시스템의 구성 이하에서는, 본 발명의 구현을 위하여 중요한 기능을 수행하는 서비스 제공 시스템의 내부 구성과 각 구성 요소의 기능에 대하여 살펴보기로 한다. 도 2는 본 발명의 일 실시예에 따른 서비스 제공 시스템의 내부 구성을 상세하게 도시하는 도면이다. 도 2에 도시된 바와 같이, 본 발명의 일 실시예에 따른 서비스 제공 시스템은, 신용 정보 결정부, 계 약 조건 관리부, 통신부 및 제어부를 포함하여 구성될 수 있다. 본 발명의 일 실시예에 따르면, 신용 정보 결정부, 계약 조건 관리부, 통신부 및 제어부는 그 중 적어도 일부가 외부의 시스템(미도시됨)과 통신하는 프로그램 모듈일 수 있다. 이러한 프로그램 모듈은 운영 시스템, 응용 프 로그램 모듈 또는 기타 프로그램 모듈의 형태로 서비스 제공 시스템에 포함될 수 있고, 물리적으로는 여러 가지 공지의 기억 장치에 저장될 수 있다. 또한, 이러한 프로그램 모듈은 서비스 제공 시스템과 통신 가 능한 원격 기억 장치에 저장될 수도 있다. 한편, 이러한 프로그램 모듈은 본 발명에 따라 후술할 특정 업무를 수행하거나 특정 추상 데이터 유형을 실행하는 루틴, 서브루틴, 프로그램, 오브젝트, 컴포넌트, 데이터 구조 등 을 포괄하지만, 이에 제한되지는 않는다. 한편, 서비스 제공 시스템에 관하여 위와 같이 설명되었으나, 이러한 설명은 예시적인 것이고, 서비스 제 공 시스템의 구성요소 또는 기능 중 적어도 일부가 필요에 따라 디바이스 또는 서버(미도시됨) 내에 서 실현되거나 외부 시스템(미도시됨) 내에 포함될 수도 있음은 당업자에게 자명하다. 먼저, 본 발명의 일 실시예에 따른 신용 정보 결정부는, 신용 평가 모델을 이용하여 임차인에 대한 신용 평가 정보를 결정할 수 있다. 본 발명의 일 실시예에 따른 임차인에 대한 신용 평가 정보는 학습된 신용 평가 모델에 의해 결정되는 것으로서, 신용 평가 등급 또는 개인 신용 평점을 나타내는 정보를 의미할 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 신용 평가 정보는 임차인이 법인인 경우에는 신용 평가 등급에 관한 정보를 의미할 수 있고, 임 차인이 개인인 경우에는 개인 신용 평점에 관한 정보를 의미할 수 있다. 한편, 본 발명의 일 실시예에 따른 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신상 정 보, 소득 정보 및 연체 이력 정보 중 적어도 하나를 참조하여 학습될 수 있다.본 발명의 일 실시예에 따른 부동산 풀에 연관된 적어도 하나의 임차인은 부동산 풀에 포함된 대상 부동산 객체 에 과거에 거주하였거나, 현재 거주하거나, 미래에 거주할 예정인 임차인을 의미할 수 있다. 또한, 본 발명의 일 실시예에 따른 임차인에 관한 신상 정보는 대상 부동산 객체에 대한 임차인 투어(즉, 임차 인이 대상 부동산 객체에 대하여 현장 방문하는 과정)를 통해 획득될 수 있는 정보로서, 예를 들어, 성명, 성별, 주민등록번호, 주소, 직업 및 직장 등의 소재지, 연락처, 이메일, 신체 정보(예를 들어, 키, 몸무게 등), 동거인 수, 소유 차량의 등록 번호, 기존 주거형태(예를 들어, 위치, 자가, 전세, 월세, 계약 금액), 이사 이유 (예를 들어, 기존 계약의 만료, 자녀 학업, 이직 등), 자산 정보(예를 들어, 주택 보유 여부) 등에 관한 정보를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 임차인에 관한 소득 정보는 대상 부동산 객체에 대한 임차인 투어를 통해 획 득될 수 있는 정보로서, 예를 들어, 사업 소득, 근로 소득, 소득 수준, 대출 규모, 직업, 업종 등에 관한 정보 를 포함할 수 있다. 나아가, 본 발명의 일 실시예에 따른 임차인에 관한 소득 정보는 임차인의 신용 정보 제공 동의에 따라 발급되는 신용 평가 기관의 신용 분석 보고서를 참조하여 검증이 이루어질 수 있다. 또한, 본 발명의 일 실시예에 따른 임차인에 관한 연체 이력 정보는 부동산 풀에 포함된 대상 부동산 객체 및 이전의 거주지에 대한 주거 이력으로부터 획득되는 월세 체납 또는 연체 이력에 관한 정보를 의미할 수 있다. 이와 같이, 본 발명의 일 실시예에 따른 신용 평가 모델은 부동산 풀에 연관된 적어도 하나의 임차인에 관한 신 상 정보, 소득 정보 및 연체 이력에 관한 정보와 인공지능 알고리즘을 활용하여 학습되는 자동화된 신용 평가 모델을 의미할 수 있으며, 신용 평가 모델을 이용하여 임차인의 신용 평가 정보(예를 들어, 신용 평가 등급, 개 인 신용 평점 등에 관한 정보)가 결정될 수 있다. 특히, 본 발명의 일 실시예에 따른 신용 평가 모델의 학습 과정에서 부동산 풀에 포함된 대상 부동산 객체와 연관되는 체납 또는 연체 이력에 관한 정보는 타 정보에 비해 더 높은 가중치가 부여될 수 있고, 체납 또는 연체 이력에 관한 정보는 임차인의 신용 평가 정보를 결정하는 것 에 관한 영향력이 상대적으로 클 수 있다. 이를 통해, 자체 구축된 신용 평가 모델을 활용하여 부동산 풀에 연관된 적어도 하나의 임차인에 대한 신용 평 가 정보를 결정할 수 있게 되는 효과가 달성된다. 한편, 본 발명의 일 실시예에 따른 부동산 풀은 적어도 하나의 임대인과 서비스 제공자 사이의 계약에 기초하여 형성될 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 계약은 적어도 하나의 임대인과 서비스 제공자 사이의 임대차 계약, 관 리 계약, 위탁 계약 또는 사용 계약을 포함할 수 있다. 구체적으로, 본 발명의 일 실시예에 따른 계약은 서비스 제공자가 임대인으로부터 임대한 대상 부동산 객체(예 를 들어, 주거용 부동산)에 관하여 확정된 임대료를 임대인에게 정기적으로 송금한다는 내용을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 계약은 대상 부동산 객체의 공실, 임차료 미납 등의 위험을 서비스 제공자가 부담한다는 내용을 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 계약은 서비스 제공자가 대상 부동산 객체를 전대하는 것에 관한 임대인의 동의를 포함할 수 있다. 이를 통해, 임대인은 서비스 제공자로부터 대상 부동산 객체에 대해 확정된 임대 수익을 위험 부담 없이 안정적 으로 제공받을 수 있는 효과가 달성된다. 다만, 본 발명에 일 실시예에 따른 계약의 종류 및 내용은 위에서 설명된 것에 한정되지 않으며, 본 발명의 목 적을 달성할 수 있는 범위 내에서 다양하게 변경될 수 있다. 다음으로, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 결정된 신용 평가 정보를 참조하여 임차인이 거주할 대상 부동산 객체에 관한 계약 조건을 동적으로 설정할 수 있도록 지원할 수 있다. 구체적으로, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 임차인의 신용 평가 정보가 신용 기준을 충 족하는 것에 대응하여, 임차인에게 적용되는 보증금의 적어도 일부를 면제하는 계약 조건을 설정할 수 있도록 지원할 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 임차인의 신용 평가 등급이 AA 등급이고 A등 급 이상의 신용 기준을 충족하는 것에 대응하여, 임차인에게 적용되는 보증금의 90%를 면제하는 계약 조건을 설 정할 수 있도록 지원할 수 있다. 또한, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 임차인의 신용 평가 정보가 신용 기준을 충족하지 않는 것에 대응하여, 임차인에게 적용되는 적어도 일부의 월세를 선납하는 계약 조건을 설정할 수 있도록 지원 할 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 임차인의 개인 신용 평점이 하위 20%이고, 개인 신용 평점 상위 50%의 신용 기준을 충족하지 않는 것에 대응하여, 임차인에게 적용되는 12개월 분의 월세 또는 계약 기간에 관한 월세 전액을 선납하는 계약 조건을 설정할 수 있도록 지원할 수 있다. 또한, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 부동산 풀과 연관되는 적어도 하나의 임차인이 기 설정된 기간 동안 월세를 성실하게 납부하거나 고신용자의 지위(예를 들어, 일정 수준의 신용 평가 등급 또는 개인 신용 평점)를 유지하는 것에 대응하여, 임차인에게 적용되는 월세의 적어도 일부를 할인하거나 임차인에게 인센티브(예를 들어, 대상 부동산 객체의 유지, 관리 또는 보수에 관한 서비스에서 이용 가능한 포인트, 월세 할인을 위한 포인트)가 제공되는 계약 조건을 설정할 수 있도록 지원할 수 있다. 한편, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 임차인이 근로하는 대상 기업과 서비스 제공자 사 이에서 계약 조건을 설정할 수 있도록 지원할 수 있다. 예를 들어, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 대상 기업과 서비스 제공자 사이에서 계약 기간을 조정할 수 있도록 하는 계약 조건을 설정할 수 있도록 지원할 수 있다. 구체적으로, 본 발명의 일 실시 예에 따른 계약 조건 관리부는 대상 기업의 근로자인 임차인이 급작스럽게 퇴사할 경우를 대비하여, 대상 기업과 서비스 제공자 간 1+1 계약 기간을 설정하도록 하거나 기설정된 페널티를 지급하여 계약의 중도 해지가 가능하도록 하는 계약 조건을 설정할 수 있도록 지원할 수 있다. 다른 예를 들어, 본 발명의 일 실시예에 따른 계약 조건 관리부는, 대상 기업과 서비스 제공자 사이에서 계약 당사자의 명의 변경을 가능하게 하는 계약 조건을 설정할 수 있도록 지원할 수 있다. 구체적으로, 본 발 명의 일 실시예에 따른 계약 조건 관리부는 대상 기업의 근로자인 임차인이 급작스럽게 퇴사하였으나 대상 부동산 객체에 계속하여 거주하길 원하는 경우, 대상 기업에서 임차인으로의 계약 당사자에 관한 명의 변경을 가능하게 하는 계약 조건을 설정할 수 있도록 지원할 수 있다. 이를 통해, 본 발명의 일 실시예에 따른 대상 기업은 보증금 및 계약 기간의 부담 없이 대상 기업의 근로자에게 사택을 제공하는 사내 복지를 구현할 수 있는 효과가 달성된다. 다음으로, 본 발명의 일 실시예에 따른 통신부는 신용 정보 결정부 및 계약 조건 관리부로부터 의/로의 데이터 송수신이 가능하도록 하는 기능을 수행할 수 있다. 마지막으로, 본 발명의 일 실시예에 따른 제어부는 신용 정보 결정부, 계약 조건 관리부 및 통 신부 간의 데이터의 흐름을 제어하는 기능을 수행할 수 있다. 즉, 본 발명의 일 실시예에 따른 제어부 는 서비스 제공 시스템의 외부로부터의/로의 데이터 흐름 또는 서비스 제공 시스템의 각 구성요 소 간의 데이터 흐름을 제어함으로써, 신용 정보 결정부, 계약 조건 관리부 및 통신부에서 각각 고유 기능을 수행하도록 제어할 수 있다. 이상 설명된 본 발명에 따른 실시예는 다양한 컴퓨터 구성요소를 통하여 실행될 수 있는 프로그램 명령어의 형 태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프로그 램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨 어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디 스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프 로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령어의 예에는, 컴파일러에 의하여 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함된다. 하드웨어 장치는 본 발명에 따른 처리를 수행하기 위하여 하나 이 상의 소프트웨어 모듈로 변경될 수 있으며, 그 역도 마찬가지이다. 이상에서 본 발명이 구체적인 구성요소 등과 같은 특정 사항과 한정된 실시예 및 도면에 의하여 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위하여 제공된 것일 뿐, 본 발명이 상기 실시예에 한정되는 것은 아"}
{"patent_id": "10-2023-0011282", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "니며, 본 발명이 속하는 기술분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정과 변경을 꾀할 수 있다.따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2023-0011282", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따라 부동산 임대 관리 서비스를 제공하기 위한 전체 시스템의 개략적인 구성을 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 서비스 제공 시스템의 내부 구성을 상세하게 도시하는 도면이다."}
