{"patent_id": "10-2023-0117056", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0034732", "출원번호": "10-2023-0117056", "발명의 명칭": "열차의 가변궤간 선로 운행을 위한 견인 시스템 및 이를 이용한 견인 방법", "출원인": "한국철도기술연구원", "발명자": "문형석"}}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "구동 장치(110)를 통해 전후 방향 주행 및 방향 전환이 가능한 복수의 견인 유닛(100),각 견인 유닛(100) 상부에 장착되고 액추에이터의 작동에 의해 상측 방향으로 이동하여 차량 하부를 지지하여설정된 높이로 들어올리거나, 액추에이터의 작동에 의해 하측 방향으로 이동하여 차량 하부로부터 분리되는 리프팅 장치(120),각 견인 유닛(100)의 구동 장치(110) 및 리프팅 장치(120)의 액추에이터 작동을 개별 제어하는 제어 장치(130), 네트워크를 통해 제어 장치(130)와 연결되고 제어 장치(130)로 제어 신호를 전송하여 구동 장치 및 리프팅 장치의 작동을 통합 관제하는 관제부(1)를 포함하여 구성되되,선로의 궤간 간격 변화에 따라 차축 상에서 차량 폭 방향 내측 또는 외측을 향해 이동 가능한 차륜으로 이루어진 가변 윤축(200)이 장착된 차량이, 서로 다른 궤간을 가지는 제1 선로(10)와 제2 선로(20)간 연결부에 설치되어 제1 선로(10)에 대응하는 궤간 크기를 제2 선로(20)에 대응하는 궤간 크기로 변경하는 가변궤간 선로(30)로진입하기 전, 관제부(1)는 제1 선로(10) 상에서 기관차가 분리된 차량 하부로 복수의 견인 유닛(100)을 투입하여 제2 선로(20)를 향해 차량을 견인함으로써, 가변궤간 선로(30)를 통과하는 차량의 가변 윤축(200) 차륜간 거리 조정이이루어지며, 제2 선로(20) 상에 대기 중인 기관차와 견인된 차량이 연결되면 투입된 견인 유닛(100)을 철수시키는 것을 특징으로 하는 차량의 가변궤간 선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,각 견인 유닛(100)의 리프팅 장치(120)에는 하측 방향으로 작용하는 하중의 크기를 측정하는 하중 측정 장치(121)가 부가되며, 액추에이터의 작동에 의해 차량 하부를 지지하여 설정된 높이로 들어올릴 때 하중 측정 장치(121)를 통해 하중을 측정하되,측정된 하중 크기가 투입된 견인 유닛(100)의 허용 견인력을 초과하는 경우, 제어 장치(130)는 투입된 각 견인유닛(100)의 작동을 일시 중단하고 관제부(1)로 하중 초과 신호를 전송하여, 관제부(1)에서 해당 차량으로 견인유닛(100)을 추가 투입하거나,측정된 하중이 투입된 견인 유닛(100)의 허용 견인력 미만인 경우, 제어 장치(130)는 관제부(1)로부터 수신한제어 신호에 따라 차량을 제2 선로(20)로 견인하는 것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,각 견인 유닛(100)의 구동 장치(110)는, 견인 유닛(100) 본체에 장착되는 다수의 매커넘휠(mecanum wheel,111)과, 각 매커넘휠(111)에 연결되어 구동력을 개별적으로 제공하는 구동 모터로 구성되는 것을 특징으로 하는열차의 가변궤간 선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,관제부(1)는 서버로부터 차량에 탑승한 승객 또는 적재된 화물 정보를 수신하여 차량의 중량을 추정함으로써,공개특허 10-2025-0034732-3-차량 견인을 위해 투입되는 견인 유닛(100)의 초기 투입 수량을 결정하는 것을 특징으로 하는 열차의 가변궤간선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,관제부(1)의 제어 장치 제어는 기계 학습(machine learning)을 기반으로 하는 인공지능 알고리즘에 의해 자동으로 이루어지되,견인 유닛(100)의 제어 결과 획득한 결과 데이터는 인공지능 알고리즘으로 피드백되어, 인공지능 알고리즘의 재학습 데이터로 제공되는 것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,각 견인 유닛(100)의 본체에는 카메라, 라이다(LiDAR), 초음파 센서 중 어느 하나 또는 이들의 조합으로 이루어지는 센서 모듈(140)이 장착되며, 연산 장치(141)는 견인 유닛(100) 주행 중 센서 모듈(140)로부터 수신한 신호로부터 지형 및 장해물 데이터를 생성하여 충돌 사고 발생 위험 감지 시 제어 장치(130)로 구동 장치(110)의 회피 기동 데이터를 포함하는 긴급 회피 제어 신호를 발신하되, 연산 장치(141)의 제어 신호는 관제부(1)의 제어 신호보다 우선하는 제어 권한을 가지고 있어, 연산 장치(141)에서 수신된 회피 기동 데이터에 의해 견인 유닛(100)의 긴급 회피 기동이 이루어지고, 긴급 회피 기동 완료 후 긴급 회피 제어 신호 미수신 시 관제부(1)의 제어 신호에 의한 견인 유닛(100) 제어가재개되는 것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 가변 윤축(200)은, 차축(201) 상에 결합되는 고정캡(210), 고정캡(210)에 결합되어 차륜을 차량 횡 방향을따라 이동시키는 잠금기구(220), 잠금기구(220)의 잠금 및 풀림을 구속하는 플랜지(230), 고정캡(210) 단부에형성된 스프링 홀더(240)와 플랜지(230) 사이에 장착되는 스프링(250), 고정캡(210)에 설치되어 플랜지(230)의위치를 고정하는 플랜지 잠금구(260)로 구성되며,상기 가변궤간 선로(30)는, 제1,2 선로(10,20) 사이에 설치되는 궤간변환레일(31), 궤간변환레일(31)보다 높은높이를 이루도록 궤간변환레일(31) 내외측면을 따라 배치된 가이드 레일(32), 궤간변환레일(31) 사이에 형성되고 플랜지(230)와 접촉하는 횡 방향 폭이 증가 또는 감소하여 플랜지(230)의 횡 방향 이동에 따른 잠금기구(220)의 잠금 및 풀림을 제어하는 릴리스 레일(33)로 구성되는 것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서,하중 측정 장치(121)에서 측정된 하중이 투입된 견인 유닛(100)의 허용 견인력 미만이면, 관제부(1)는 차량 전후 방향 또는 폭 방향을 따라 배치된 각 견인 유닛(100)의 하중 측정 장치(121)로부터 측정된 하중 값을 수신하며, 각 견인 유닛(100)의 하중 측정 장치(121)에서 측정된 중량의 편차 크기가 설정된 값 이상인 경우, 투입된 견인유닛(100)을 이동시켜 하중 측정 장치(121)에서 측정된 중량의 편차 크기가 설정된 값 미만으로 형성되는 지점으로 차량 하부 지지 위치를 변경하는 것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,견인 유닛(100)에 의한 차량 이동 중 각 견인 유닛(100)의 하중 측정 장치(121)에서 중량 변화를 측정하며, 제어 장치(130)를 통해 각 액추에이터를 작동시켜 하중 측정 장치(121)에서 측정된 중량 변화가 감소되는 방향으공개특허 10-2025-0034732-4-로 각 견인 유닛(100)의 리프팅 장치(120)의 높이를 제어하는 것을 특징으로 하는 열차의 가변궤간 선로 운행을위한 견인 시스템."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 선로(10)를 따라 운행하는 차량의 기관차가 가변궤간 선로(30)로 진입하기 전 제1 선로(10) 상에서 정차하여 기관차를 분리하며, 분리된 기관차를 분기기를 통해 제1 선로(10)로부터 다른 선로로 이동시키는 기관차 분리 단계(S10);관제부(1)가 서버로부터 차량에 탑승한 승객 또는 적재된 화물 정보를 수신하여, 가변궤간 선로(30)를 통과하는차량 하부로 투입되는 견인 유닛(100)의 초기 투입 수량을 결정하며, 네트워크를 통해 견인 유닛(100)의 제어장치(130)로 구동 장치(110)를 제어하기 위한 제어 신호를 전송하여, 전후 방향 주행 및 방향 전환을 통해 복수의 견인 유닛(100)을 기관차가 분리된 차량 하부로 투입하는 견인 유닛 투입 단계(S20);관제부(1)에서 각 견인 유닛(100) 상부에 장착된 리프팅 장치(120)로 리프팅 장치(120)의 액추에이터가 상측 방향으로 이동하기 위한 제어 신호를 전송하며, 제어 신호에 따라 리프팅 장치(120)가 작동하여 차량 하부를 지지하면서 설정된 높이로 들어올리는 차량 지지 단계(S30);관제부(1)에서 각 견인 유닛(100)의 제어 장치(130)로 제어 신호를 전송하여, 견인 유닛(100)을 통해 차량을 제2 선로(20) 방향으로 견인하며, 선로의 궤간 간격 변화에 따라 차축 상에서 차량 폭 방향 내측 또는 외측을 향해 이동 가능한 차륜으로 이루어진 차량의 가변 윤축(200)이, 서로 다른 궤간 크기를 가지는 제1,2 선로(10,20)간 연결부에 설치된 가변궤간 선로(30)를 통과함으로써, 제2 선로(20) 궤간에 대응하는 크기로의 차량의 가변윤축(200) 차륜간 거리 조정이 이루어지는 차륜 거리 조정 단계(S40); 관제부(1)의 제어에 따른 견인 유닛(100)의 작동을 통해, 견인된 차량의 연결기를 제2 선로(20) 상에서 대기 중인 기관차의 연결기에 연결하는 기관차 연결 단계(S50); 관제부(1)에서 각 견인 유닛(100)의 액추에이터가 하측 방향으로 이동하기 위한 제어 신호를 전송하며, 제어 신호에 따라 리프팅 장치(120)가 하강하여 차량 하부로부터 분리되는 리프팅 장치 분리 단계(S60);관제부(1)에서 견인 유닛(100)의 제어 장치(130)로 제어 신호를 전송하여, 투입된 견인 유닛(100)을 철수시키는견인 유닛 철수 단계(S70);로 이루어지는 것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인 방법."}
{"patent_id": "10-2023-0117056", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,각 견인 유닛(100)의 리프팅 장치(120)에는 하측 방향으로 작용하는 하중의 크기를 측정하는 하중 측정 장치(121)가 부가되되,차량 지지 단계(S30)에서 리프팅 장치(120)를 통해 차량을 설정된 높이로 들어올릴 때, 하중 측정 장치(121)를 통해 측정된 하중 크기가 투입된 견인 유닛(100)의 허용 견인력을 초과하는 경우, 제어장치(130)는 투입된 각 견인 유닛(100)의 작동을 일시 중단하고 관제부(1)로 하중 초과 신호를 전송하여, 관제부(1)에서 해당 차량으로 견인 유닛(100)을 추가 투입하는 견인 유닛 추가 투입 단계(S31)가 수행되거나,또는 측정된 하중이 투입된 견인 유닛(100)의 허용 견인력 미만인 경우, 차륜 거리 조정 단계(S40)가 진행되는것을 특징으로 하는 열차의 가변궤간 선로 운행을 위한 견인 방법."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 구동 장치 및 액추에이터의 작동에 의해 차량 하측으로 투입되어 차량의 지지 및 견인이 가능한 복수 의 견인 유닛, 네트워크를 통해 견인 유닛의 구동 장치 및 리프팅 장치의 작동을 통합 관제하는 관제부로 구성되 어, 가변 윤축이 장착된 차량을 견인하여 서로 다른 궤간을 가지는 선로간 연결부에 설치된 가변궤간 선로를 통 과시킴으로써, 가변 윤축 차륜간 거리 조정을 수행하는 열차의 가변궤간 선로 운행을 위한 견인 시스템 및 이를 이용한 견인 방법에 관한 것이다."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 서로 다른 궤간을 가지는 선로간 연결부를 통과하는 열차로부터 기관차를 분리하여, 가변궤간 선로를 객차 또는 화차만이 통과할 수 있도록 함으로써, 가변궤간 선로의 내구 수명을 확보하는 견인 시스템이 관한 것으로, 보다 상세하게는 구동 장치 및 액추에이터의 작동에 의해 차량 하측으로 투입되어 차량의 지지 및 견인이가능한 복수의 견인 유닛, 네트워크를 통해 견인 유닛의 구동 장치 및 리프팅 장치의 작동을 통합 관제하는 관 제부로 구성되어, 가변 윤축이 장착된 차량을 견인하여 서로 다른 궤간을 가지는 선로간 연결부에 설치된 가변 궤간 선로를 통과시킴으로써, 가변 윤축 차륜간 거리 조정을 수행하는 열차의 가변궤간 선로 운행을 위한 견인 시스템 및 이를 이용한 견인 방법에 관한 것이다."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "철도 차량을 통한 운송은 선박 운송이나 항공 운송에 비해 높은 내륙 운송 접근성을 가지고, 악천후 발생 등 기 후의 영향을 거의 받지 않으며, 운송 거리가 증가할수록 비용이 감소하는 장점을 가지고 있어, 장거리 운송에 주로 사용된다. 그러나 우리 나라를 비롯한 대다수의 국가는 1435mm의 궤간 크기를 가지는 표준궤간 선로를 채택하고 있는 반면, 러시아나 인도 또는 스페인 등의 국가에서는 표준궤간보다 큰 궤간 크기를 가지는 광궤를 사용하거나, 표 준궤간보다 작은 궤간 크기를 가지는 협궤를 사용하고 있어, 국경 지대 통과 시 선로의 궤간 크기가 일치하지 않아 주행이 불가하게 된다. 따라서 서로 다른 궤간 크기를 가지는 선로를 채택한 국가의 국경을 통과하는 철도 차량은 선로의 궤간 변경 크 기에 맞춰 차량의 윤축 궤간을 조정하는 절차를 거칠 필요가 있으며, 서로 다른 궤간을 가지는 선로간 연결부에 는 차량의 윤축 궤간 조정이 이루어지는 선로인 궤간가변선이 설치된다. 차량의 윤축 궤간을 조정하기 위하여, 대한민국 등록특허공보 제10-0799338호(2008.01.23.등록)의 철도 차량용 궤간 가변 윤축시스템 및 궤간 가변 레일과 같이 차량의 윤축 궤간을 조정하는 궤간 가변 시스템이 적용되고 있 으며, 궤간 가변 윤축시스템이 장착된 철도 차량이 서로 다른 크기의 궤간을 가지는 두 선로 상에 설치된 궤간 가변 레일을 통과하면서 윤축의 궤간이 자동으로 조정된다. 궤간 가변 윤축시스템 및 궤간 가변 레일을 통해 윤축의 궤간 크기를 변경하는 작업은, 변경 전 퀘간 크기에 대 응하는 궤간을 가지는 기관차를 분리하여 열차 편성에서 제외하고, 변경 후 궤간 크기에 대응하는 궤간을 가지 는 기관차를 연결하여 열차 편성에 포함시키는 방식으로 이루어진다. 그러나 이와 같은 궤간 가변 레일은 레일의 궤간 크기가 변화하는 방향으로 궤간 가변 윤축에 횡 방향 힘을 가 하여 가변 윤축의 궤간 크기를 변경시키게 되므로, 궤간가변선의 선로는 일반 선로에 비해 내구 수명이 단축되 며, 특히 동력장치가 부가된 기관차의 경우 화차 때는 객차로 이루어진 일반 철도 차량 대비 선로 통과 과정에 서 매우 큰 축중을 가하게 된다. 궤간가변선을 통해 기관차를 투입하여 기관차가 분리된 열차와 연결한 후, 연결된 기관차를 통해 철도 차량 운 행을 재개하는 경우, 투입 및 견인 과정에서 2회의 궤간가변선상 기관차 출입이 이루어지게 되는데, 궤간가변선 으로의 잦은 기관차 출입은 궤간가변선의 내구 수명 감소를 가속화하는 원인이 된다. 따라서 궤간가변선 상으로의 기관차 출입 없이 철도 차량을 견인하여 궤간 가변 레일을 통과시켜 윤축의 궤간 크기를 변경함으로써, 궤간가변선의 내구 수명을 확보시킬 수 있는 가변궤간 선로 운행을 위한 견인 시스템을 개발할 필요성이 높아지고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-0799338호 (2008.01.23. 등록)"}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명에서는 궤간가변선을 통해 철도 차량의 윤축 궤간 크기를 변경되는 과정에서 상대적으로 무거운 축중을 가지는 기관차가 궤간가변선을 통과하지 않도록 함으로써, 궤간가변선의 내구 수명을 향상시킬 수 있는 열차의 가변궤간 선로 운행을 위한 견인 시스템을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 열차의 가변궤간 선로 운행을 위한 견인 시스템은, 구동 장치를 통해 전후 방향 주행 및 방향 전환이 가능한 복수의 견인 유닛, 각 견인 유닛 상부에 장착되고 액추에이터의 작동에 의해 상측 방향으로 이동 하여 차량 하부를 지지하여 설정된 높이로 들어올리거나, 액추에이터의 작동에 의해 하측 방향으로 이동하여 차 량 하부로부터 분리되는 리프팅 장치, 각 견인 유닛의 구동 장치 및 리프팅 장치의 액추에이터 작동을 개별 제 어하는 제어 장치, 네트워크를 통해 제어 장치와 연결되고 제어 장치로 제어 신호를 전송하여 구동 장치 및 리 프팅 장치의 작동을 통합 관제하는 관제부를 포함하여 구성되되, 선로의 궤간 간격 변화에 따라 차축 상에서 차 량 폭 방향 내측 또는 외측을 향해 이동 가능한 차륜으로 이루어진 가변 윤축이 장착된 차량이, 서로 다른 궤간 을 가지는 제1 선로와 제2 선로간 연결부에 설치되어 제1 선로에 대응하는 궤간 크기를 제2 선로에 대응하는 궤 간 크기로 변경하는 가변궤간 선로로 진입하기 전, 관제부는 제1 선로 상에서 기관차가 분리된 차량 하부로 복 수의 견인 유닛을 투입하여 제2 선로를 향해 차량을 견인함으로써, 가변궤간 선로를 통과하는 차량의 가변 윤축 차륜간 거리 조정이 이루어지며, 제2 선로 상에 대기 중인 기관차와 견인된 차량이 연결되면 투입된 견인 유닛 을 철수시킨다. 본 발명의 실시 예에 따르면 각 견인 유닛의 리프팅 장치에는 하측 방향으로 작용하는 하중의 크기를 측정하는 하중 측정 장치가 부가되며, 액추에이터의 작동에 의해 차량 하부를 지지하여 설정된 높이로 들어올릴 때 하중 측정 장치를 통해 하중을 측정하되, 측정된 하중 크기가 투입된 견인 유닛의 허용 견인력을 초과하는 경우, 제 어 장치는 투입된 각 견인 유닛의 작동을 일시 중단하고 관제부로 하중 초과 신호를 전송하여, 관제부에서 해당 차량으로 견인 유닛을 추가 투입하거나, 측정된 하중이 투입된 견인 유닛의 허용 견인력 미만인 경우, 제어 장 치는 관제부로부터 수신한 제어 신호에 따라 차량을 제2 선로로 견인한다. 본 발명의 실시 예에 따르면 각 견인 유닛의 구동 장치는, 견인 유닛 본체에 장착되는 다수의 매커넘휠과, 각 매커넘휠에 연결되어 구동력을 개별적으로 제공하는 구동 모터로 구성된다. 본 발명의 실시 예에 따르면 관제부는 서버로부터 차량에 탑승한 승객 또는 적재된 화물 정보를 수신하여 차량 의 중량을 추정함으로써, 차량 견인을 위해 투입되는 견인 유닛의 초기 투입 수량을 결정한다. 본 발명의 실시 예에 따르면 관제부의 제어 장치 제어는 기계 학습을 기반으로 하는 인공지능 알고리즘에 의해 자동으로 이루어지되, 견인 유닛의 제어 결과 획득한 결과 데이터는 인공지능 알고리즘으로 피드백되어, 인공지 능 알고리즘의 재학습 데이터로 제공된다. 본 발명의 실시 예에 따르면 각 견인 유닛의 본체에는 카메라, 라이다, 초음파 센서 중 어느 하나 또는 이들의 조합으로 이루어지는 센서 모듈이 장착되며, 연산 장치는 견인 유닛 주행 중 센서 모듈로부터 수신한 신호로부 터 지형 및 장해물 데이터를 생성하여 충돌 사고 발생 위험 감지 시 제어 장치로 구동 장치의 회피 기동 데이터 를 포함하는 긴급 회피 제어 신호를 발신하되, 연산 장치의 제어 신호는 관제부의 제어 신호보다 우선하는 제어 권한을 가지고 있어, 연산 장치에서 수신된 회피 기동 데이터에 의해 견인 유닛의 긴급 회피 기동이 이루어지고, 긴급 회피 기동 완료 후 긴급 회피 제어 신호 미수신 시 관제부의 제어 신호에 의한 견인 유닛 제 어가 재개된다. 본 발명의 실시 예에 따르면 상기 가변 윤축은, 차축 상에 결합되는 고정캡, 고정캡에 결합되어 차륜을 차량 횡 방향을 따라 이동시키는 잠금기구, 잠금기구의 잠금 및 풀림을 구속하는 플랜지, 고정캡 단부에 형성된 스프링 홀더와 플랜지 사이에 장착되는 스프링, 고정캡에 설치되어 플랜지의 위치를 고정하는 플랜지 잠금구로 구성되 며, 상기 가변궤간 선로는, 제1,2 선로 사이에 설치되는 궤간변환레일, 궤간변환레일보다 높은 높이를 이루도록 궤 간변환레일 내외측면을 따라 배치된 가이드 레일, 궤간변환레일 사이에 형성되고 플랜지와 접촉하는 횡 방향 폭 이 증가 또는 감소하여 플랜지의 횡 방향 이동에 따른 잠금기구의 잠금 및 풀림을 제어하는 릴리스 레일로 구성 된다. 본 발명의 실시 예에 따르면 하중 측정 장치에서 측정된 하중이 투입된 견인 유닛의 허용 견인력 미만이면, 관 제부는 차량 전후 방향 또는 폭 방향을 따라 배치된 각 견인 유닛의 하중 측정 장치로부터 측정된 하중 값을 수 신하며, 각 견인 유닛의 하중 측정 장치에서 측정된 중량의 편차 크기가 설정된 값 이상인 경우, 투입된 견인 유닛을 이동시켜 하중 측정 장치에서 측정된 중량의 편차 크기가 설정된 값 미만으로 형성되는 지점으로 차량 하부 지지 위치를 변경한다.본 발명의 실시 예에 따르면 견인 유닛에 의한 차량 이동 중 각 견인 유닛의 하중 측정 장치에서 중량 변화를 측정하며, 제어 장치를 통해 각 액추에이터를 작동시켜 하중 측정 장치에서 측정된 중량 변화가 감소되는 방향 으로 각 견인 유닛의 리프팅 장치의 높이를 제어한다. 본 발명에 따른 차량의 가변궤간 선로 운행을 위한 견인 방법은, 제1 선로를 따라 운행하는 차량의 기관차가 가 변궤간 선로로 진입하기 전 제1 선로 상에서 정차하여 기관차를 분리하며, 분리된 기관차를 분기기를 통해 제1 선로로부터 다른 선로로 이동시키는 기관차 분리 단계; 관제부가 서버로부터 차량에 탑승한 승객 또는 적재된 화물 정보를 수신하여, 가변궤간 선로를 통과하는 차량 하부로 투입되는 견인 유닛의 초기 투입 수량을 결정하 며, 네트워크를 통해 견인 유닛의 제어 장치로 구동 장치를 제어하기 위한 제어 신호를 전송하여, 전후 방향 주 행 및 방향 전환을 통해 복수의 견인 유닛을 기관차가 분리된 차량 하부로 투입하는 견인 유닛 투입 단계; 관제 부에서 각 견인 유닛 상부에 장착된 리프팅 장치로 리프팅 장치의 액추에이터가 상측 방향으로 이동하기 위한 제어 신호를 전송하며, 제어 신호에 따라 리프팅 장치가 작동하여 차량 하부를 지지하면서 설정된 높이로 들어 올리는 차량 지지 단계; 관제부에서 각 견인 유닛의 제어 장치로 제어 신호를 전송하여, 견인 유닛을 통해 차량 을 제2 선로 방향으로 견인하며, 선로의 궤간 간격 변화에 따라 차축 상에서 차량 폭 방향 내측 또는 외측을 향 해 이동 가능한 차륜으로 이루어진 차량의 가변 윤축이, 서로 다른 궤간 크기를 가지는 제1,2 선로간 연결부에 설치된 가변궤간 선로를 통과함으로써, 제2 선로 궤간에 대응하는 크기로의 차량의 가변 윤축 차륜간 거리 조정 이 이루어지는 차륜 거리 조정 단계; 관제부의 제어에 따른 견인 유닛의 작동을 통해, 견인된 차량의 연결기를 제2 선로 상에서 대기 중인 기관차의 연결기에 연결하는 기관차 연결 단계; 관제부에서 각 견인 유닛의 액추에 이터가 하측 방향으로 이동하기 위한 제어 신호를 전송하며, 제어 신호에 따라 리프팅 장치가 하강하여 차량 하 부로부터 분리되는 리프팅 장치 분리 단계; 관제부에서 견인 유닛의 제어 장치로 제어 신호를 전송하여, 투입된 견인 유닛을 철수시키는 견인 유닛 철수 단계;로 이루어진다. 본 발명의 실시 예에 따르면 각 견인 유닛의 리프팅 장치에는 하측 방향으로 작용하는 하중의 크기를 측정하는 하중 측정 장치가 부가되되, 차량 지지 단계에서 리프팅 장치를 통해 차량을 설정된 높이로 들어올릴 때, 하중 측정 장치를 통해 측정된 하중 크기가 투입된 견인 유닛의 허용 견인력을 초과하는 경우, 제어 장치는 투입된 각 견인 유닛의 작동을 일시 중단하고 관제부로 하중 초과 신호를 전송하여, 관제부에서 해당 차량으로 견인 유 닛을 추가 투입하는 견인 유닛 추가 투입 단계가 수행되거나, 또는 측정된 하중이 투입된 견인 유닛의 허용 견 인력 미만인 경우, 차륜 거리 조정 단계가 진행된다."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 열차가 서로 다른 규격의 선로를 연결하는 궤간가변선을 통과하는 과정에서, 견인 유닛을 통 해 기관차가 분리된 상태의 차량을 견인하여 궤간 간격이 변화된 선로 상에 대기 중인 다른 기관차에 연결하여, 상대적으로 무거운 축중을 가지는 기관차가 궤간가변선을 통과하지 않도록 함으로써, 궤간가변선의 내구 수명을 향상시킬 수 있는 효과가 있다. 본 발명에 따르면 견인 유닛을 통해 기관차가 분리된 차량을 견인하여 궤간가변선을 통과시키는 과정에서, 견인 유닛의 리프팅 장치를 통해 차량을 일정 높이만큼 들어올려 궤간가변선에 가해지는 차량의 축중을 경감시킴으로 써, 궤간가변선의 내구 수명을 보다 향상시킬 수 있는 효과가 있다. 본 발명에 따르면 견인 유닛을 통해 기관차가 분리된 차량을 견인하여 궤간가변선을 통과시킨 후 대기 중인 다 른 기관차에 차량을 연결함으로써, 궤간가변선에서 양측 차륜간 이격 간격 조정 작업 중 발생하는 시간 지연을 저감할 수 있는 효과강 있다."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예를 첨부된 도면을 참조하여 설명한다. 본 발명에 따른 동작 및 작용을 이해하는 데 필요한 부분을 중심으로 상세히 설명한다. 본 발명의 실시 예를 설명하면서, 본 발명이 속하는 기술 분야에 익히 알려졌고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더욱 명확히 전달하기 위함이다. 또한, 본 발명의 구성 요소를 설명하는 데 있어서, 동일한 명칭의 구성 요소에 대하여 도면에 따라 다른 참조부 호를 부여할 수도 있으며, 서로 다른 도면임에도 동일한 참조부호를 부여할 수도 있다. 그러나 이와 같은 경우라 하더라도 해당 구성 요소가 실시 예에 따라 서로 다른 기능을 갖는다는 것을 의미하거 나, 서로 다른 실시 예에서 동일한 기능을 갖는다는 것을 의미하는 것은 아니며, 각각의 구성 요소의 기능은 해 당 실시 예에서의 각각의 구성 요소에 대한 설명에 기초하여 판단하여야 할 것이다. 또한, 본 명세서에서 사용되는 기술적 용어는 본 명세서에서 특별히 다른 의미로 정의되지 않는 한 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의하여 일반적으로 이해되는 의미로 해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성요소들, 또는 여러 단계들 을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 본 발명에 따른 열차의 가변궤간 선로 운행을 위한 견인 시스템은, 도 1에서 도시하는 바와 같이 서로 다른 규 격의 선로가 서로 연결되면서 선로의 궤간 간격이 변화하는 궤간가변선을 통과하는 과정에서, 다수의 견인 유닛 이 기관차가 분리된 상태의 차량 하부에 투입되어 차량을 지지한 다음, 궤간 간격이 변화된 선로 상에 대 기 중인 기관차로 견인하여 연결함으로써, 궤간가변선에서 동력 부재 상태인 차량을 견인하여 새로운 선로 궤간 간격에 맞춰 차륜간 이격 간격을 조절하도록 한다. 이하 궤간가변선으로 차량이 진입하는 선로를 제1 선로, 제1 선로와 다른 궤간을 가지며 궤간가변선을 통과한 차량이 진출하는 선로를 제2 선로, 그리고 제1 선로와 제2 선로간 연결부에 설치되어 제1 선로에 대응하는 궤간 크기를 제2 선로에 대응하는 궤간 크기로 변경하는 선로를 가변궤간 선로로 정의하여 본 발명에 따른 견인 시스템 구성을 설명한다. 제1 선로 및 제2 선로는 각각 표준 궤간이나, 표준 궤간보다 궤간 크기가 작은 협궤, 또는 표준 궤간보 다 궤간 크기가 큰 광궤 중 어느 하나로 이루어질 수 있으며, 가변궤간 선로는 도 2에서 도시하는 바와 같 이 제1 선로 및 제2 선로 사이에는 제1,2 선로(10,20)의 궤간 크기에 맞춰 궤간의 크기가 점진적으로 변화하는 선로인 궤간변환레일이 설치된다. 궤간변환레일의 내외측면에는 궤간변환레일보다 높은 높이를 이루도록 한 쌍의 가이드 레일이 궤간 변환레일의 내외측면과 대향하도록 배치되며, 차량이 궤간변환레일을 따라 이동하면서 차량에 장착된 가변 윤축의 양측 차륜간 이격 간격이 변화하는 동안 차륜 내측면 또는 외측면이 가이드 레일에 의해 지지된다. 가이드 레일에 의해 가변 윤축의 양측 차륜간 이격 속도 및 간격 변화가 안내되면서, 차륜과 궤간변환 레일간 이탈 발생에 따른 차량의 탈선 사고를 방지할 수 있으며, 양측 궤간변환레일 사이에는 횡 방향 폭이 점차 증가하거나 또는 횡 방향 폭이 점차 감소하도록 상부 방향을 향해 일정 높이 돌출 형성된 릴리스 레 일이 배치된다. 도 3에서 도시하는 바와 같이 가변 윤축의 차축 상에는 고정캡이 결합되고, 고정캡에는 잠 금기구가 결합되어 차축 상에 연결된 차륜을 차량 횡 방향을 따라 이동시키며, 고정캡의 차륜반대측 단부에는 플랜지가 결합되어 잠금기구의 잠금 및 풀림을 구속한다. 고정캡의 차륜측 단부에는 스프링 홀더가 형성되고, 플랜지와 스프링 홀더간 대향하는 표 면에는 코일스프링으로 이루어지는 스프링이 장착된다. 고정캡에는 플랜지 잠금구가 설치되며, 플랜지 잠금구에는 걸림쇠와 걸림쇠 돌기가 형성되어, 걸림쇠 및 걸림쇠 돌기간 결합 또는 분리에 의해 플랜지의 위치를 고정하거나 플랜지의 위치 고정 상 태를 해제함으로써, 가변 윤축의 양측 차륜간 이격 간격 고정 또는 이격 간격 조정이 이루어지질 수 있도 록 한다. 릴리스 레일은 차량이 가변궤간 선로를 통과하는 과정에서 플랜지와 접촉하는 위치 상에 배치되어, 릴리스 레일과 접촉한 플랜지는 릴리스 레일의 횡 방향 폭 증가를 통해 형성된 경사면 에 의해 차축을 따라 외측으로 이동하여, 걸림쇠 및 걸림쇠 돌기간 풀림이 이루어지면서 잠금기구의 잠금 상태를 해제하며, 궤간변환레일 및 가이드 레일의 궤간 크기에 맞춰 가변 윤축의 양측 차륜 간 이격 간격이 변화하게 된다. 차량의 가변 윤축이 제2 선로에 근접하면 궤간변환레일 및 가이드 레일에 의한 궤간 변환이 완료되어 가변 윤축의 양측 차륜간 이격 간격 조정이 완료되며, 릴리스 레일은 제2 선로 근접하는 방향을 따라 횡 방향 폭이 감소하면서 형성된 역방향 경사면을 형성한다. 제2 선로 근접하는 방향에서 릴리스 레일이 형성하는 역방향 경사면에 의해 플랜지가 차축을 따라 외측 이동하게 되며, 이에 따라 걸림쇠 및 걸림쇠 돌기간 결합이 이루어지면서 잠금기구가 잠겨 가변 윤축의 양측 차륜간 이격 간격이 고정된다. 열차는 동력 장치를 포함하는 기관차에 동력 장치가 포함되지 않은 객차 또는 화차가 연결되어 구성되는데, 이 하 본 발명의 명세서에서 기재하는 차량은 기관차를 제외한 객차 또는 화차를 의미한다. 기관차는 차량 대비 윤축으로 작용하는 축중이 매우 크게 형성되기 때문에, 기관차의 빈번한 가변궤간 선로 출입은 가변궤간 선로의 내구 수명을 크게 단축시킬 수 있다. 따라서 본 발명에서는 제1 선로를 따라 주행하면서 차량을 견인하는 기관차가 가변궤간 선로에 진입하 기 전, 제1 선로 상에 정차하여 차량으로부터 기관차를 분리한 다음, 분기기를 통해 기관차의 진행 방향을 제1 선로와 연결되는 다른 선로로 전환하여 이동시킨 후, 분기기를 원상태로 조절하여 제1 선로를 가변 궤간 선로로 연결한다. 제2 선로에는 차량을 견인하기 위한 다른 기관차가 대기하며, 복수의 견인 유닛을 통해 기관차가 분리 된 차량을 견인하여 가변궤간 선로를 통해 제2 선로로 이동시킴으로써, 차량의 가변 윤축의 양측 차륜간 이격 간격을 제2 선로의 궤간에 맞춰 변경한다. 따라서 본 발명의 견인 시스템은 네트워크를 통해 각 견인 유닛과 연결되어 견인 유닛의 작동을 관제 하는 관제부와, 구동 장치를 통해 전후 방향 주행 및 방향 전환이 가능하도록 구성되어 관제부의 관 제에 의해 기관차가 분리된 차량을 제2 선로로 견인하여 이동시키는 다수의 견인 유닛으로 이루어진다. 견인 유닛의 구동 장치는 도 4에서 도시하는 바와 같이 견인 유닛 본체에 장착되는 4개 이상의 매커넘휠(mecanum wheel,111)과, 각 매커넘휠에 연결되어 구동력을 개별적으로 제공하는 구동 모터로 구성 된다. 매커넘휠의 외주면에는 다수의 원기둥 형상의 롤러가 매커넘휠의 중심축으로부터 45° 편향되도록 장 착되며, 구동 모터를 통해 각 매커넘휠의 회전 방향 및 회전 속도를 독립적으로 제어함으로써, 별도의 조 향축 없이 견인 유닛의 전후좌우 이동 방향 전환 및 제자리에서의 회전 기동이 가능하다. 매커넘휠이 적용된 구동 장치는 견인 유닛의 기동성 및 접근성을 향상시키며, 견인 대상인 차량 에 고중량의 화물이 적재되어 다수의 견인 유닛 투입 필요 시 차량 측면으로부터 차량 하부로 견인 유닛 의 진입이 가능하도록 하여, 견인 유닛의 운용이 보다 용이하게 이루어질 수 있도록 한다. 견인 유닛의 상부에는 리프팅 장치가 장착되며, 액추에이터의 작동에 의해 리프팅 장치의 승하 강 이동이 가능하도록 구성되어, 리프팅 장치를 상측 방향으로 이동시켜 차량 하부를 지지한 후 차량을 설 정된 높이로 들어올리거나, 리프팅 장치를 하측 방향으로 이동시켜 들어올린 차량을 원위치 시키고 차량하부로부터 분리될 수 있다. 각 견인 유닛의 구동 장치 및 리프팅 장치는 제어 장치에 의해 작동이 제어되며, 제어 장 치는 각 매커넘휠에 구동력을 제공하는 구동 모터의 회전 방향 및 회전 속도를 개별 제어하고, 리프 팅 장치에 연결된 액추에이터의 상측 또는 하측 이동 방향 및 이동 거리를 개별 제어한다. 관제부는 네트워크를 통해 제어 장치와 연결되어 견인 유닛을 통합 관제하며, 제어 장치는 관제부로부터 각 견인 유닛으로 전송된 제어 신호를 수신하여, 제어 신호에 따라 구동 장치 및 리 프팅 장치를 작동시킨다. 관제부에서 각 견인 유닛의 제어 장치로 발신되는 제어 신호는 컨트롤러에 의해 생성되며, 컨트롤 러는 견인 유닛 제어 담당 인력의 수동 조작 방식으로 구성되거나, 또는 인공 지능을 이용한 자동 조작 방 식으로 구성될 수 있다. 차량이 가변궤간 선로에 근접하여 제2 선로로 이동하기 전, 유휴상태인 견인 유닛은 제1 선로 근방에 위치하는 대기장소에서 대기하게 되며, 대기장소에는 견인 유닛의 구동 모터에 전원을 공급하는 배 터리 충전 시설이 마련될 수 있다. 견인 유닛의 배터리 잔량이 설정된 수준 이하로 떨어지는 경우, 해당 견인 유닛의 제어 장치에 서 관제부로 배터리 방전 경고 신호를 발신하며, 배터리 방전 경고 신호를 수신한 관제부는 컨트롤러를 통해 해당 견인 유닛을 배터리 충전 시설로 이동시켜 배터리를 충전시킨다. 또한, 관제부는 서버로부터 차량에 탑승한 승객의 수 또는 차량에 적재된 화물의 수량 및 중량 정보, 그리고 열차에 편성된 차량의 종류 및 유형에 따른 차량 크기와 공차 중량 등의 규격 정보를 수신하여 차량의 중량을 추정할 수 있으며, 각 견인 유닛이 안정적으로 차량을 견인할 수 있는 한계 하중인 허용 견인력의 크기를 고려하여, 차량의 견인을 수행할 견인 유닛의 초기 투입 수량을 결정한다. 그리고 각 견인 유닛의 리프팅 장치에는 리프팅 장치의 상부면에 하측 방향으로 작용하는 하중 의 크기를 측정하는 하중 측정 장치가 부가되어, 액추에이터의 작동에 의해 리프팅 장치가 상측으로 이동하면서 차량 하부를 지지하여 설정된 높이로 들어올릴 때, 각 견인 유닛으로 작용하는 하중을 측정할 수 있다. 견인 유닛의 허용 견인력을 초과하는 하중이 작용하는 상태에서 견인을 수행하는 경우, 구동 장치 또 는 리프팅 장치의 손상이 발생하거나 충분한 견인력을 발생시키지 못하여 견인이 제대로 이루어지지 못할 수 있다. 따라서 하중 측정 장치에서 측정된 하중 크기가 투입된 각 견인 유닛의 허용 견인력을 초과하는 경우, 허용 견인력을 초과하는 하중이 가해진 견인 유닛의 제어 장치는 투입된 각 견인 유닛의 작동을 일시 중단시킨 후, 관제부로 하중 초과 신호를 전송한다. 투입된 견인 유닛의 작동을 동시에 중단시키기 위하여, 견인 유닛 투입 시 투입된 견인 유닛의 제어 장치간 네트워크를 통해 서로 연결되는 동기화 작업이 이루어질 수 있다. 견인 유닛의 제어 장치로부터 하중 초과 신호를 수신한 관제부는 해당 차량으로 견인 유닛을 추가 투입하며, 하중 초과 신호에 포함된 초과된 하중의 크기 정보에 따라 추가 투입되는 견인 유닛의 수 량이 결정된다. 각 하중 측정 장치에서 측정된 하중 크기가 투입된 견인 유닛의 허용 견인력 미만인 경우, 제어 장치 는 관제부로부터 수신한 제어 신호에 따라 차량을 견인하여 가변궤간 선로를 통해 제2 선로로 이동시킨다. 또한, 투입된 모든 견인 유닛의 하중 측정 장치에서 측정된 하중이 허용 견인력 미만의 범위에 해당 하더라도, 차량 내에 적재된 화물의 배치 위치나 무게 중심 위치에 따라 차량 전후 방향 또는 차량 폭 방향 하 중 분포가 불균일하게 형성될 수 있다. 차량 전후 방향 또는 폭 방향을 따라 배치된 각 견인 유닛에 작용하는 하중의 편차가 크게 형성되는 경우, 각 견인 유닛의 이동 속도를 균일하게 유지하기 위해 구동 장치의 출력을 제어하는데 어려움이 발생 할 수 있다.따라서 관제부는 차량 전후 방향 또는 폭 방향을 따라 배치된 각 견인 유닛의 하중 측정 장치로부 터 측정된 하중 값을 수신하여, 각 견인 유닛의 하중 측정 장치에서 측정된 중량의 편차가 설정된 값 이상의 크기를 가지는 경우, 컨트롤러를 통해 제어 신호를 발신하여 투입된 견인 유닛을 이동시킴으로써, 하중 측정 장치에서 측정된 중량의 편차 크기가 설정된 값 미만으로 형성되는 지점으로 차량 하부 지지 위 치를 변경할 수 있다. 이때, 차량 내에 적재된 화물의 하중 분포 불균일성이 매우 크게 형성되어, 견인 유닛의 이동에 따른 차량 하부 지지 위치 변경 후에도 각 견인 유닛의 하중 측정 장치에서 측정된 중량의 편차가 설정된 값 미 만의 크기로 가감되지 않는 경우, 관제부는 하중이 집중되는 차량 전후 또는 폭 방향 위치로 견인 유닛(10 0)을 추가 투입함으로써, 각 견인 유닛에 작용하는 하중의 편차를 경감시킬 수 있다. 또한, 견인 유닛의 작동에 의한 차량 이동 시 차량의 가속 또는 감속에 의해 관성력이 작용하면서 견인 유 닛으로 작용하는 하중의 크기가 변화할 수 있으며, 하중 변화는 각 견인 유닛의 구동 장치 출력 제어에 어려움을 발생시킨다. 따라서 견인 유닛의 작동 중 하중 측정 장치를 통해 작용하는 중량 변화를 실시간으로 측정하여 관제 부로 전송하며, 관제부는 수신된 중량 변화 데이터를 기반으로 각 견인 유닛의 제어 장치로 액 추에이터를 작동시키는 제어 신호를 실시간으로 전송함으로써, 하중 측정 장치에서 측정되는 중량 변화가 감소되는 방향으로 각 견인 유닛의 리프팅 장치의 높이를 제어하게 된다. 이때, 하중 측정 장치에서 측정된 하중의 크기에 따른 견인 유닛의 추가 투입 수량 결정이나, 하중 측정 장치에서 측정된 하중의 편차에 따른 견인 유닛의 차량 하부 지지 위치 변경, 또는 견인 유닛 의 작동 중 하중 측정 장치에서 측정되는 중량 변화에 따른 리프팅 장치의 액추에이터 제어 작 업 수행은, 견인 유닛 제어 담당 인력이 수동 조작하는 방식을 적용하기에 부적합하므로, 관제부의 컨 트롤러는 인공 지능을 이용한 자동 조작 방식이 적용되는 것이 바람직하다. 관제부의 컨트롤러를 통한 제어 장치 제어는 기계 학습(machine learning)을 기반으로 하는 인공지능 알고리즘에 의해 자동으로 이루어지며, 견인 유닛의 구동 장치 및 리프팅 장치 운용을 통해 획 득한 견인 유닛의 차량 하부 지지 위치 변경에 따른 하중 측정 장치에서 측정된 하중의 편차나, 리프 팅 장치의 액추에이터 제어에 따른 하중 측정 장치에서 측정된 하중의 편차 변화 등의 제어 결과 데 이터는 인공지능 알고리즘으로 피드백되어, 인공지능 알고리즘의 재학습 데이터로 제공되어, 인공지능 알고리즘 의 제어 장치 제어 적확성을 향상시킬 수 있다. 그리고 다수의 열차가 통과하면서 기관차의 분리 및 연결 작업이 이루어지는 궤간가변선의 장소적 특성상, 견인 유닛 대기장소로부터 기관차가 분리된 차량으로 견인 유닛을 투입하는 과정 및 차량 견인을 완료한 견인 유닛을 대기장소로 철수하는 과정에서 다른 열차나 기관차, 또는 궤간가변선의 철도 시설과 충돌 사 고가 발생할 수 있는 위험이 있다. 견인 유닛의 충돌 사고 발생을 방지하기 위하여 각 견인 유닛의 본체에는 카메라, 라이다(LiDAR), 초 음파 센서 중 선택되는 어느 하나로 이루어지거나, 또는 이들의 조합으로 이루어지는 센서 모듈이 장착각 견인 유닛의 본체에는 카메라, 라이다(LiDAR), 초음파 센서 중 선택되는 어느 하나로 이루어지거나, 또는 이들의 조합으로 이루어지는 센서 모듈이 장착될 수 있다. 센서 모듈은 견인 유닛 주행 중 센서 모듈로부터 수신한 신호를 연산 장치로 전송하며, 연 산 장치는 센서 모듈로부터 수신한 신호로부터 지형 및 장해물 데이터를 생성하여, 각종 장해물과의 충돌 사고 발생 위험을 감지한다. 연산 장치에서 장해물과의 충돌 사고 발생 위험을 감지하면 연산 장치는 제어 장치로 긴급 회피 제어 신호를 발신하며, 긴급 회피 제어 신호에는 장해물과의 충돌을 피하기 위한 구동 장치 제어 신호로 이루어진 회피 기동 데이터가 포함되어, 제어 장치는 회피 기동 데이터에 따른 구동 장치 작동 제어 를 수행한다. 이때, 연산 장치의 긴급 회피 제어 신호에 포함된 제어 신호는, 관제부의 제어 신호보다 우선하는 제어 장치 제어 권한을 가지고 있어, 연산 장치에서 수신된 회피 기동 데이터에 의해 견인 유닛의 긴 급 회피 기동이 이루어진다. 긴급 회피 기동 완료 후 연산 장치에서 더 이상 장해물과의 충돌 사고 발생 위험을 감지하지 않아 긴급 회 피 제어 신호 발신이 중단되면, 긴급 회피 제어 신호 수신이 중단된 제어 장치는 관제부의 제어 신호에 따라 견인 유닛 제어를 재개한다. 이와 같이 구성되는 본 발명의 가변궤간 선로 운행을 위한 견인 시스템을 통한 견인 방법은 도 5에 도시된 흐름 도와 같은 단계로 이루어진다. 기관차 분리 단계(S10)에서는 제1 선로를 따라 운행하면서 차량을 견인하는 기관차가 가변궤간 선로로 진입하기 전 제1 선로 상에서 정차하며, 기관차와 차량간 연결기를 분리한 후 분기기 조정을 통해 가변궤간 선로에 연결된 제1 선로의 방향을 제1 선로 측면으로 연결되는 제3의 선로로 변경하여, 분리된 기 관차를 제3의 선로로 이동시킨다. 제1 선로에서 제3의 선로로의 기관차 이동이 완료되면, 분기기 방향을 원래대로 조정하여 제1 선로를 가변궤간 선로로 연결한다. 견인 유닛 투입 단계(S20)에서는 서버로부터 차량에 탑승한 승객의 수 또는 차량에 적재된 화물의 수량 및 중량 정보, 그리고 열차에 편성된 차량의 종류 및 유형에 따른 차량 크기와 공차 중량 등의 규격 정보를 수신한 관제 부에서 견인할 차량의 중량을 추정한 후, 각 견인 유닛이 안정적으로 차량을 견인할 수 있는 한계 하중 인 허용 견인력의 크기를 고려하여, 차량의 견인을 수행할 견인 유닛의 초기 투입 수량을 결정한다. 관제부에서 차량의 견인을 수행할 견인 유닛의 초기 투입 수량 결정이 완료되면, 제1 선로 근방에 위치하는 대기장소에서 대기 중인 유휴상태의 견인 유닛을 기관차가 분리되어 자력 주행이 불가능한 차량 으로 투입한다. 관제부의 컨트롤러는 네트워크를 통해 각 견인 유닛의 제어 장치와 연결되어 각 제어 장치로 구동 장치를 제어하기 위한 제어 신호를 개별적으로 전송하며, 제어 장치의 제어에 따른 견인 유닛 의 주행 및 방향 전환을 통해 견인 유닛이 기관차가 분리된 차량 하부로 진입하게 된다. 차량 지지 단계(S30)에서는 관제부에서 차량 하부로 진입한 각 견인 유닛으로 액추에이터 제어 신호를 전송하며, 제어 신호를 수신한 제어 장치는 액추에이터를 작동시켜 리프팅 장치를 상측 방향으로 이 동시킨다. 상측 방향으로 이동하는 리프팅 장치의 상부 끝단이 차량 하부면에 접촉하면서 차량을 지지한 상태에서, 리프팅 장치가 미리 설정된 높이만큼 추가 이동하면서 차량을 들어올리며, 리프팅 장치에 의해 들어 올려진 차량의 현가장치가 하측 방향으로 신장되면서 차량의 가변 윤축의 차륜과 제1 선로의 레일 표 면간 접촉 상태가 유지된다. 차량 지지 단계(S30)에서 리프팅 장치를 통해 차량을 설정된 높이로 들어올릴 때, 하중 측정 장치를 통해 측정된 하중 크기가 투입된 견인 유닛의 허용 견인력을 초과하는 경우 견인 유닛 추가 투입 단계 (S31)가 수행된다. 견인 유닛 추가 투입 단계(S31)에서는 제어 장치가 투입된 각 견인 유닛의 작동을 일시 중단하며, 관 제부로 하중 초과 신호를 전송한다. 관제부로 전송된 하중 초과 신호에는 측정된 하중 크기 데이터가 포함되며, 관제부는 초과된 하중의 크기 및 견인 유닛의 허용 견인력을 고려하여 견인 유닛을 추가 투입 수량을 결정한 후 해당 차량으로 견 인 유닛을 추가 투입한다. 그리고 견인 유닛의 하중 측정 장치에서 측정된 하중이 허용 견인력 미만의 범위에 해당하더라도, 차 량 전후 방향 또는 폭 방향을 따라 배치된 각 견인 유닛에 작용하는 하중의 편차가 크게 형성되며, 관제부 에서 수신한 각 견인 유닛의 하중 측정 장치에서 측정된 중량의 편차가 설정된 값 이상의 크기를 가지는 경우, 관제부는 컨트롤러를 통해 제어 신호를 발신하여 투입된 견인 유닛을 이동시켜 하중 측정 장치에서 측정된 중량의 편차 크기를 조정하는 견인 유닛 위치 재조정 단계(S32)가 추가적으로 수행될 수 있다. 차량 지지 단계(S30) 또는 견인 유닛 추가 투입 단계(S31)에서 하중 측정 장치를 통해 측정된 하중 크기가 투입된 견인 유닛의 허용 견인력 미만인 경우, 견인 유닛의 리프팅 장치를 통한 차량 하부 지지 작업이 완료되며, 차륜 거리 조정 단계(S40)가 진행된다.차륜 거리 조정 단계(S40)에서는 관제부에서 각 견인 유닛의 제어 장치로 제어 신호를 전송하여, 견인 유닛을 통해 차량을 제2 선로 방향으로 견인한다. 견인 유닛에 의해 견인되는 차량의 가변 윤축 차륜은 제1 선로로부터 가변궤간 선로로 진입 하게 되며, 가변 윤축의 플랜지가 횡 방향 폭이 증가하는 릴리스 레일의 경사면에 의해 차축 을 따라 외측으로 이동하면서 잠금기구의 잠금 상태가 해제된다. 가변 윤축 차륜은 궤간변환레일 표면을 따라 이동하면서 궤간변환레일의 궤간 변화에 맞춰 차륜간 이격 간격이 점진적으로 변화하게 되며, 제2 선로 궤간에 대응하는 크기로의 차량의 가변 윤축 차륜간 거리 조정이 완료되는 구간에 도달하면, 가변 윤축의 플랜지가 횡 방향 폭이 감소하는 릴리스 레일 의 경사면에 의해 차축을 따라 내측으로 이동하면서 잠금기구가 잠금 상태에 놓이면서 가변 윤축 차륜간 거리가 고정된다. 궤간변환레일에 의해 가변 윤축 차륜간 거리 조정이 이루어지는 동안, 궤간변환레일의 내외측면에 각각 형성된 한 쌍의 가이드 레일이 차륜 내측면 또는 외측면을 지지함으로써, 차륜과 궤간변환레일간 이탈 발생에 따른 차량의 탈선 사고를 방지한다. 이때, 리프팅 장치를 통해 차량을 일정 높이 들어올림으로써, 차량의 자중 및 차량에 적재된 화물의 무게 가 가변궤간 선로로 작용하는 하중의 크기를 경감시킬 수 있으며, 이는 차량에 비해 높은 축중을 가지는 기 관차가 가변궤간 선로 상에 진입하지 않는 견인 시스템 구성과 함께 가변궤간 선로의 내구 수명을 크게 향상시킬 수 있도록 한다. 또한, 차륜 거리 조정 단계(S40)에서 견인 유닛에 의한 차량 이동 중 차량의 가속 또는 감속에 의해 작용 하는 관성력에 의해 견인 유닛으로 작용하는 하중의 크기가 변화할 수 있으며, 견인 유닛에 작용하는 하중 변화는 각 견인 유닛의 구동 장치 출력 제어에 어려움을 발생시킬 수 있다. 따라서 차륜 거리 조정 단계(S40)에서 견인 유닛을 통한 차량 견인 중, 하중 측정 장치를 통해 각 견 인 유닛에 작용하는 중량 변화를 실시간으로 측정하여 관제부로 전송하며, 관제부는 수신된 중량 변 화 데이터를 기반으로 각 견인 유닛의 제어 장치로 액추에이터를 작동시키는 제어 신호를 생성하여, 하중 측정 장치에서 측정되는 중량 변화가 감소되는 방향으로 각 견인 유닛의 리프팅 장치의 높 이를 제어하는 하중 제어 단계(S41)가 부가될 수 있다. 견인 유닛의 견인 작동에 의해 차량이 가변궤간 선로를 통과하면서 가변 윤축 차륜간 거리 변경 이 완료되며, 기관차 연결 단계(S50)에서는 제2 선로에 진입한 차량을 제2 선로 상에서 대기 중인 기관 차로 견인하여, 차량의 연결기와 기관차의 연결기를 서로 연결한다. 차량 및 기관차간 상하 방향 연결기 연결 각도를 일치시키기 위하여, 기관차 연결 단계(S50)에서는 액추에이터 작동에 의한 리프팅 장치의 상하 방향 높이 조절이 이루어질 수 있으며, 차량 및 기관차간 연결이 완료되 면 견인 유닛의 견인 작동이 중단된다. 리프팅 장치 분리 단계(S60)에서는 관제부에서 각 견인 유닛의 액추에이터가 하측 방향으로 이동하기 위한 제어 신호를 전송하며, 제어 신호를 수신한 제어 장치가 액추이에터를 가동하여 리프팅 장치를 하강시킴으로써, 리프팅 장치를 차량 하부로부터 분리한다. 견인 유닛 철수 단계(S70)에서는 관제부에서 견인 유닛의 제어 장치로 제어 신호를 전송하여, 투 입된 견인 유닛을 제2 선로로부터 대기장소로 철수시키며, 연결된 기관차의 견인력에 의해 차량이 제2 선로를 따라 운행하게 된다."}
{"patent_id": "10-2023-0117056", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 내용을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술분야의 당업자는 본 발명이 그 기술적 사상이나 필수적 특징을 변경하지 않고 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적인 것이 아닌 것으로서 이해되어야 하고, 상기 상세한 설명에서 기술된 본 발명의 범위는 후술하는 특허청구범위에 의하여 나타나며, 특허 청구범 위의 의미 및 범위 그리고 그 등가 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포 함되는 것으로 해석되어야 한다.부호의 설명 l: 관제부 10: 제1 선로 20: 제2 선로 30: 가변궤간 선로 31: 궤간변환레일 32: 가이드 레일 33: 릴리스 레일 100: 견인 유닛 110: 구동 장치 111: 매커넘휠 120: 리프팅 장치 121: 하중 측정 장치 130: 제어 장치 140: 센서 모듈 141: 연산 장치 200: 가변 윤축 201: 차축 210: 고정캡 220: 잠금기구 230: 플랜지 240: 스프링 홀더 250: 스프링 260: 플랜지 잠금구"}
{"patent_id": "10-2023-0117056", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 열차의 가변궤간 선로 운행을 위한 견인 시스템의 구성을 간략화하여 나타내는 도면이다. 도 2는 본 발명에 따른 가변궤간 선로의 구조를 나타내는 도면이다. 도 3은 본 발명에 따른 가변 윤축의 구조와, 가변궤간 선로 상에서의 가변 윤축의 배치 구조를 나타내는 도면이 다. 도 4는 본 발명에 따른 견인 유닛의 구조를 나타내는 도면이다. 도 5는 본 발명에 따른 열차의 가변궤간 선로 운행을 위한 견인 시스템을 이용한 견인 방법의 순서도를 나타내는 도면이다."}
