{"patent_id": "10-2022-7030664", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0138396", "출원번호": "10-2022-7030664", "발명의 명칭": "골프 클럽 스윙 동작 추적 및 분석용 휴대용 장치, 방법 및 시스템", "출원인": "라임 인코포레이티드", "발명자": "윤 존"}}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "미니 카메라 장치로서, 상기 미니 카메라 장치는:오버 헤드 뷰에서 퍼팅 스트로크의 이미지를 스트리밍 및 레코딩 중 적어도 하나를 하기위한 미니 카메라; 및퍼팅 스트로크의 오버헤드 뷰를 위해 미니 카메라를 조준하도록 구성된 조인트를 통해 미니 카메라에 연결된 전기 모듈 - 상기 조인트는 퍼팅 스트로크에 대한 미니 카메라 뷰의 조준을 조정하도록 구성됨 -; 을 포함하는,미니 카메라 장치."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 부착 기구를 더 포함하고, 상기 부착 기구는 모자 클립인, 미니 카메라 장치."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 전기 모듈은 타이머, 푸시 버튼, 음성 명령, GPS 위치, 또는 모바일 장치로부터의 신호중 하나 이상으로부터의 트리거에 기초하여 온/오프 절환을 하게 구성된, 미니 카메라 장치."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 전기 모듈은 이미지 처리 알고리즘, 타이머, 푸시 버튼, 음성 명령, GPS 신호 및 모바일장치로부터의 신호 중 하나 이상으로부터의 트리거에 기초하여 이미지 스트리밍 및 레코딩 중 적어도 하나를 시작/중지 하게 구성된, 미니 카메라 장치."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 미니 카메라 장치는 퍼팅 기술에 대한 라이브 검토 또는 라이브 지침을 위해 골프 라운드동안 골프 코스에서 현장 사용을 위해 휴대 가능하고; 그리고상기 미니 카메라 장치는:신축자재 구조의 길이를 연장하고 미니 카메라의 위치를 조정할 수 있는, 미니 카메라의 하우징에 부착된 신축자재 구조;상기 미니 카메라 장치의 위치를 파악할 수 있는 GPS 수신기;타임스탬프 정보를 제공할 수 있는 디지털 시계; 그리고이미지 데이터를 모바일 장치에 무선으로 전송하기 위한 트랜시버 - 상기 이미지 데이터는 퍼팅 스트로크의 이미지를 가짐 -; 를 더 포함하는, 미니 카메라 장치."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "퍼팅 트레이닝 시스템으로서, 상기 퍼팅 트레이닝 시스템은:미니 카메라 장치 - 상기 미니 카메라 장치는:오버헤드 뷰에서 퍼팅 스트로크의 이미지를 스트리밍 및 레코딩 중 적어도 하나를 하기위한 미니 카메라;전기 모듈;퍼팅 스트로크의 오버 헤드 뷰를 위해서 미니 카메라를 이동 가능하게 조준하기 위해 미니 카메라와 전기 모듈을 연결하는 조인트; 및전기 모듈에 연결된 부착 기구 - 상기 부착 기구는 미니 카메라 장치를 골프 모자, 캡, 또는 바이저의 챙에 부착하도록 구성됨 -; 를 구비함 -;공개특허 10-2022-0138396-3-모바일 장치; 그리고서버; 를 포함하고;상기 전기 모듈은 부가로, 이미지 및 정보를 전송하기 위해 모바일 장치와 통신하도록 구성된 무선 통신 모듈을포함하며; 그리고 상기 모바일 장치는 통계, 분석 정보, 및 통지를 생성하도록 구성되는; 퍼팅 트레이닝시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 모바일 장치는, 현실적 뷰 및 증강 현실 뷰 모두의 이미지 및 정보를 디스플레이하고, 상기 미니 카메라 장치를 작동하고, 소셜 미디어 애플리케이션 인터페이스 및 클라우드 서버를 사용하여 상기 정보를 공유하도록 구성되는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 미니 카메라 장치는 관심 퍼팅 영역을 커버하기에 적절한 오버헤드 뷰를 제공하기 위해상기 미니 카메라 장치에 부착 및/또는 구비된 구성요소 및/또는 모듈을 더 포함하고; 상기 미니 카메라장치는:넓은 시야각을 제공하는 렌즈(들); 및/또는이미지를 보고 레코딩 할 때 줌 인/아웃(zoom in and out)하도록 구성된 줌 모듈 - 상기 줌 모듈은 렌즈 및 액츄에이터(들)를 가짐 -; 을 더 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 미니 카메라 장치는, 미니 카메라 장치의 작은 움직임으로 인한 이미지(들) 중 블러(blur) 이미지를 보정하도록 구성된 이미지 안정화 장치 및 시스템을 더 포함하고; 상기 이미지 안정화 장치 및시스템은:a. 자이로스코프,b. 액추에이터, 및c. 측정된 매개변수를 분석하여, 블러 이미지를 보정하기 위해 렌즈를 적절하게 이동하도록 액추에이터를 지시하는 코드를 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서, 상기 미니 카메라 장치는 다수의 미니 카메라 모듈을 더 포함하고, 상기 다수의 미니 카메라모듈 각각은 퍼팅 스트로크의 오버헤드 이미지를 캡처하도록 구성되며, 상기 시스템은: 줌 성능을 개선하고, 광각 뷰를 확보하고, 블러 배경 이미지를 향상하고, 고품질의 풀 컬러를 달성하고, 미니 카메라 장치와 골프 공사이의 거리를 측정하고, 및/또는 증강 현실 데이터를 향상하기 위해 복수의 미니 카메라 모듈 각각의 이미지를처리하기 위한 코드를 더 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서, 상기 미니 카메라 장치는, 사용자와 강사 간의 대화 내용을 가진, 오디오 정보를 녹음하게 구성되고, 요청 시 녹음된 오디오 정보를 재생하게 구성된 음성 레코딩 모듈을 더 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제6항에 있어서, 상기 미니 카메라 장치는, 상기 미니 카메라 장치를 온/오프 절환하여 미니 카메라 장치를 작동하기 위한 음성 명령을 인식하는 음성 인식 모듈 및 오디오 처리 알고리즘을 더 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제6항에 있어서, 상기 미니 카메라 장치는 휴대용 저장 매체에 물리적으로 연결하여 이미지 데이터 및 기타 수공개특허 10-2022-0138396-4-집된 정보를 저장하는 정보 저장 장치를 더 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제6항에 있어서, 상기 미니 카메라 장치는 미니 카메라 장치를 온/오프 할 수 있게 구성된 전기 드라이버를 포함하고, 상기 미니 카메라 장치는 필요할 때만 작동하여 배터리 전력을 절약하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제6항에 있어서, 상기 미니 카메라 장치는, 눈부심 및 반사를 감소시키고 밝은 태양광 및 임의의 바람직하지 않은 조명 조건 하에서 개선된 이미지 품질을 제공하도록 구성된, 미니 카메라 장치에 부착된 편광 필터를 더 포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제6항에 있어서, 상기 미니 카메라 장치는, 상기 미니 카메라 장치에 의해 획득된 데이터를 이용하여 3차원 증강 현실 프레젠테이션을 생성하고 퍼팅 그린의 경사 정보를 예시하기 위한 모바일 장치 애플리케이션 코드를 더포함하는, 퍼팅 트레이닝 시스템."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "골프 스윙에 대한 분석을 제공하는 방법으로서, 상기 방법은:모자에 부착된 미니 카메라 장치에서, 골프 스윙과 관련된 오버헤드 이미지 촬영을 시작하는 트리거를 수신하는단계;미니 카메라를 사용하여, 골프 스윙과 관련된 오버헤드 이미지의 스트리밍 및 레코딩 중 적어도 하나를 수행하는 단계;스트리밍/레코드 이미지를 트랜시버를 통해 모바일 장치로 전송하는 단계;컴퓨터 비전 기술을 사용하여 스트리밍/레코드 이미지를 분석하는 단계; 및골프 코스에 있는 동안 모바일 장치에 스트리밍/레코드 이미지를 이미지 처리에 기반한 골프 스윙의 분석을 제공하는 증강 디스플레이 정보와 함께 디스플레이하는 단계 - 상기 이미지 처리는 스트리밍/레코드 이미지에서볼 수 있는 객체의 알려진 측정값에 기초하고, 증강 디스플레이는 기계 학습 및 인공지능 방법으로 축적 데이터를 분석하여 도출된 통계 데이터 및 권장 사항의 프레젠테이션을 가짐 -; 를 포함하는, 방법."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 증강 디스플레이 정보와 관련된 거리, 위치, 크기, 속도 및 가속도 중 하나 이상의 결정은 스트리밍/레코드 이미지에서 볼 수 있는 골프공의 알려진 크기에 기초하는, 방법."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서, 기준 스탠스 라인과 스윙 동작 스탠스 라인 사이의 상대적 거리에 기초하여 클럽의 스윙 동작중 골퍼의 머리 움직임을 계산하는, 방법."}
{"patent_id": "10-2022-7030664", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17항에 있어서, 미니 카메라 장치는, 관심 객체의 상대적인 움직임을 결정하기 위해 일련의 이미지에 걸쳐,이미지의 한 객체의 상대적 위치 변화를 이미지의 다른 객체와 비교하는 데 이미지 처리 및 기계 학습 기술을사용하도록 구성되고; 상기 이미지 처리 및 기계 학습은 스트리밍/레코드 이미지에서 볼 수 있는 객체의 알려진측정값에 기초하는, 방법."}
{"patent_id": "10-2022-7030664", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본원은 오버 헤드 뷰에서 골프 클럽의 스윙 동작, 특히 골프 퍼팅 스트로크를 측정하고, 실제 골프 클럽의 이미 지에 중첩된 증강 현실을 이용하여 퍼팅 스트로크의 분석과 함께 현장에서 운동 트레이닝 및 지도를 제공할 수 있는 장치, 방법 및 시스템을 제공하는 것이다. 상기 시스템은 휴대용 장치, 모바일 장치 애플리케이션 인터페이 스, 이미지 처리 알고리즘 및 네트워크 서버를 포함한다. 휴대용 장치는 퍼팅 스트로크의 비디오 이미지를 캡처 하고 무선, Wi-Fi, 핫스팟 또는 블루투스를 통해 태블릿, 휴대폰 또는 랩탑과 같은 지정된 전자 디스플레이 장치 로 전송하기 위한 미니 카메라와 통신 모듈을 포함한다. 휴대용 장치는 골프 모자에 쉽게 끼워지는 고정 클립에 고정되어 퍼팅 스트로크의 오버헤드 뷰를 제공하고 실제 골프 코스의 이미지를 기록한다."}
{"patent_id": "10-2022-7030664", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 골프 스윙 동작, 특히 골프 퍼팅 동작 및 필드에서의 골프공 움직임을 오버헤드 뷰 이미지(overhead view image)로 제공하기 위한 휴대용 장치, 방법 및 시스템에 관한 것이며, 이러한 동작은 시야각을 조정할 수 있는 방식으로 골프 모자에 장착된 미니 카메라에 의해 캡처되고, 그리고 이미지는 효율적인 현장 트레이닝 또 는 지도를 하기 위한 이미지 처리 방법에 의해 골프 스윙 동작의 증강 분석(augmented analysis)을 위해 무선 방법을 통해 지정된 전자 디스플레이 장치로 전송된다."}
{"patent_id": "10-2022-7030664", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "골프 라운드에서 골프 샷의 약 43%가 퍼트로 구성된다. 따라서 퍼팅 수행은 플레이어의 골프 스코어를 최소화하 는 데 가장 중요한 요소로 여겨진다. 퍼팅 성능 피드백을 제공하기 위해서, 센서가 골퍼의 몸에 부착되거나 골 퍼의 움직임을 방해하는 복잡하고 고가의 시스템에서 퍼팅 스트로크의 특성을 측정하는 고급 센서가 사용되었다. 이러한 골프 동작 분석 시스템은 주로 초음파 방식, 가속도계 및 자이로스코프를 사용한다. 이들은 동작 기반 특성을 측정한다. 그러나 이러한 부착된 센서는 퍼팅 스트로크에 부정적인 영향을 줄 수 있다. 다른 실시예에서는, 골프 퍼팅 스트로크를 개선하기 위해 학생들에게 효과적인 지도를 제공할 목적으로 비디오 기록 및 컴퓨터 동작 분석 시스템이 개발되었다. 이미지 기초 정보는 골퍼의 학습 경험을 향상시키는 데 매우 효과적이다. 따라서, 카메라에 캡처된 이미지는 골퍼 및 강사가 퍼팅 스트로크를 향상시키기 위해 골퍼를 트레 이닝하거나 지도하는 데 선호되었다. 퍼팅 스트로크를 교시하고 분석하기 위한 다양한 특허 및 현재 제품으로 다음과 같은 것이 있다. 미국 특허 6,565,448 B2 및 7,283,647 B2는 실내 환경에서 케이블을 통해 컴퓨터에 연결된 비디오 카메라 레코 딩을 포함하는 장치, 방법 및 시스템을 개시했다. 퍼팅 스트로크의 분석은 컴퓨터 처리 환경에서 디스플레이 된 다. 사이언스 앤드 모션 퍼트 스튜디오(Science & Motion Putt Studio)는 실내 시설에 구축된 분석 및 트레이닝 시 스템을 제공한다. 이것은 매우 고가의 트레이닝 시스템이다. 옵티샷 푸어 골프 퍼팅 시뮬레이터(OptiShot Pure Golf Putting Simulator)는 일반적으로 골퍼 앞에서 퍼터를 향하고 지면에 배치되는 고속 카메라가 포함된 장치이다. 퍼팅 스트로크 동작을 측정하고, USB 케이블로 장치에 연결된 랩톱에서 시뮬레이션된 이미지로 분석 데이터를 제공한다. 블라스트 동작 골프 센서(Blast Motion Golf Sensor)는 퍼팅 스트로크 동작과 관련된 데이터를 얻기 위해 골프 클럽 그립의 버트(butt)에 부착된 센서를 포함한다. 분석은 모바일 앱 또는 클라우드 기반 컴퓨터 시스템을 사 용하여 컴퓨터 그래픽 이미지로 제공된다. 바이오메크(BioMech) 골프 퍼팅 센서는 퍼팅 스트로크 동작과 관련된 데이터를 수집하기 위해 골프 퍼터의 샤프 트에 부착된 센서로 구성된다. 분석은 모바일 앱 또는 클라우드 기반 컴퓨터 시스템을 사용하여 시뮬레이션된 그래픽 이미지로 제공된다."}
{"patent_id": "10-2022-7030664", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일반적으로 이러한 기존의 퍼팅 스트로크 분석 장치는 바람직하지 않으며, 골퍼에게 충분한 정보를 제공하지 못 했다. 첫째, 이러한 시스템 중 일부는 골퍼가 감당할 수 없을 정도로 고가의 것이다. 경우에 따라서는 값비싼 실내 시설 설치가 필요한 것이다. 또한 실내 셋업은 골퍼의 트레이닝 체험을 실제 환경이 아닌 시뮬레이션 환경 으로 제한한다. 다음으로, 퍼팅 스트로크 동작의 특성을 측정하기 위해 퍼터에 외부 장치(들)를 부착하는 것은 바람직하지 않다. 이러한 부착물은, 부착된 장치가 무게를 추가하고, 스트로크의 '느낌(feel)'을 변경하고, 타격의 운동량 을 변경하고, 골퍼가 퍼팅 스트로크 동작을 할 때 탑-다운 뷰(top-down view)에서 시선을 변경하기 때문에, 골 퍼의 트레이닝에 부정적인 영향을 미칠 수 있다. 게다가, 대부분의 공식 골프 조직의 규칙에 따르면, 골퍼는 골 프 경기 중에 퍼터에 장치를 부착하는 것이 허용되지 않는다. 따라서 골퍼는 공식 기록을 위해 수행 할 때 트레 이닝이나 연습과는 다른 느낌을 가질 것이다. 다른 단점으로, 동작 기반 매개변수를 측정하는 시스템(예: 가속도계 및/또는 자이로스코프 사용)은 종종 컴퓨 터 시뮬레이션 이미지를 사용하여 분석 결과를 디스플레이하므로, 골퍼가 필드에서 수행할 때 분석 프레젠테이션을 현실적 환경의 관점과 연관시키는 것이 어렵다. 따라서 개선된 퍼팅 트레이닝 및 분석 시스템이 매우 크게 필요한 실정이다."}
{"patent_id": "10-2022-7030664", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "요약 예시적인 실시예에서, 개시된 미니 카메라 장치는: 오버헤드 뷰에서 퍼팅 스트로크의 이미지를 레코드하기 위한 미니 카메라, 및 퍼팅 스트로크의 오버헤드 뷰를 위해 미니-카메라를 조준하도록 구성된 조인트를 통해 미니-카 메라에 연결된 전기 모듈을 포함하고, 조인트는 퍼팅 스트로크에 대한 미니 카메라 뷰의 조준을 조정하게 구성 된다. 다른 예시적인 실시예에서, 개시된 퍼팅 트레이닝 시스템은: 미니 카메라 장치를 포함하며, 상기 장치는: 오버 헤드 뷰로부터 퍼팅 스트로크의 이미지를 스트리밍 및 레코드하는 것 중 적어도 하나를 하기위한 미니 카메라; 전기 모듈; 퍼팅 스트로크의 오버 헤드 뷰를 위해 미니 카메라를 이동 가능하게 조준하기 위해 미니 카메라와 전기 모듈을 연결하는 조인트; 전기 모듈에 연결된 부착 기구; 를 구비하고, 상기 부착 기구는 미니 카메라 장 치를 골프 모자, 캡 또는 바이저의 챙에 부착하도록 구성되고, 상기 미니 카메라는 이미지를 레코드하도록 구성 된다. 퍼팅 트레이닝 시스템은 모바일 장치 및 서버를 더 포함하고, 상기 전기 모듈은 추가로 이미지 및 수집된 정보를 전송하기 위해 모바일 장치와 통신하도록 구성된 무선 통신 모듈을 포함하고; 그리고 상기 모바일 장치 는 통계, 정보 분석, 및 통지를 생성하도록 구성된다. 또 다른 예시적인 실시예에서, 골프 스윙에 대한 분석을 제공하는 방법은, 모자에 부착된 미니 카메라 장치로, 트리거를 수신하여 골프 스윙과 관련된 오버헤드 이미지의 레코드를 시작하는 단계; 미니 카메라를 사용하여 골 프 스윙과 관련된 오버헤드 이미지를 스트리밍 및 레코드 하는 것 중 적어도 하나를 이행하는 단계; 스트리밍/ 레코드 이미지를 트랜시버를 통해 모바일 장치로 전송하는 단계; 스트리밍/레코드 이미지를 분석하는 단계; 및 골프 코스에 있는 동안 모바일 장치에, 이미지 처리 및 기계 학습 기술(image processing and machine learning techniques)을 기반으로 하는 골프 스윙 분석을 제공하는 증강 디스플레이 정보와 함께 스트리밍/레코 드 이미지를 디스플레이하는 단계를 포함하며, 여기서 이미지 처리 및 기계 학습은 레코드 이미지에서 볼 수 있 는 물체의 알려진 측정치에 기초한다."}
{"patent_id": "10-2022-7030664", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상세한 설명 특정 실시예 및 예시적인 실시예가 아래에 개시되어 있지만, 본 발명은 본 발명이 구체적으로 개시된 실시예 및 /또는 발명의 용도 및 이의 명백한 변형 및 균등물을 넘어 확장된다는 것이 당업자에게는 이해될 수 있을 것이다. 따라서, 개시된 본 발명의 범위는 아래에서 설명되는 특정한 개시된 실시예에 의해 제한되어서는 안 되는 것으로 의도된 것이다. 다음의 상세한 설명에서, 본 명세서의 일부를 형성하고 이행될 수 있는 특정 실시예가 예시로서 도시된 첨부 도면을 참조한다. 이들 실시예는 당업자가 실시예를 실시할 수 있도록 충분히 상세하게 설명되며, 실시예의 범위를 벗어나지 않고 논리적, 기계적 및 기타 변경이 이루어질 수 있음을 이해해야 한다. 따라서 다음의 상세한 설명은 제한적인 의미로 받아들여서는 안 된다. 도 1 및 도 2에 도시된 하나의 예시적인 실시예에서, 클립-온 미니 카메라 장치는 미니 카메라 장치 및 모자 클립과 같은 부착 기구를 포함할 수 있다. 미니 카메라 장치는 미니 카메라 및 전기 모듈(1 3)을 포함할 수 있다. 예시적인 실시예에서, 미니 카메라의 조준은 퍼팅 스트로크 동작의 오버헤드 뷰 이미 지를 제공하도록 미니 카메라를 조준하기 위해 조인트를 사용하여 조정될 수 있다. 예시적인 실시예에서, 미니 카메라는 부착 기구(예를 들어, 모자 클립)에 연결된 전기 모듈에 연결된다. 미니 카메라 장 치는 원위치 골프 스윙을 하는 동안 골프 공을 내려다보는 골퍼의 머리의 유리한 지점에서 오버헤드 관점에 서 이미지를 라이브 스트리밍하거나 레코드하도록 구성된다. 라이브 스트림(live-stream) 기능은 예를 들어 골 프 프로 또는 관중이 골퍼의 관점에서 퍼트를 실시간으로 볼 수 있게 한다. 다양한 실시예에서, 이 설명에서 사용된 \"미니 카메라\" 또는 미니 카메라라는 용어는 이미지를 라이브 스트 리밍하고 레코드할 수 있는 Relohas HD 1080p 무선 미니 스파이 카메라와 같은 모든 소형 카메라를 지칭할 수 있다. 예를 들어, 미니 카메라 장치는 휴대폰 카메라, 컴팩트 디지털 카메라, 미니 스파이 카메라 등일 수 있다. 카메라 성능의 사양은 일반적으로 Full HD라고도 하는 1080p 및 초 당 30프레임이다. 그러나 적절한 사양 을 사용할 수 있다. 사양은 골프 스윙 동작, 예를 들어 퍼팅 스트로크 동작을 트레이닝, 분석 및 지도하기 위한 이미지 품질 요구 사항에 따라 결정된다. 따라서 픽셀 및 초 당 프레임에 대한 요구 사항은 그에 따라 감소하거 나 증가할 수 있다. 하나의 예시적인 실시예에서, 고속 동작이 라이브 스트리밍되거나 레코드되는 경우, 카메라 는 적어도 4K 해상도(즉, 2840 x 2160 픽셀)의 고속 카메라를 포함할 수 있지만, 임의의 적절한 해상도가 사용 될 수 있다. 미니 카메라 장치는 조인트를 더 포함할 수 있고, 그 시선은 사용자에게 탑-다운(top-down) 뷰를 제공 하도록 조정될 수 있다. 예시적인 실시예에서, 조인트는, 조인트에 의해 미니 카메라와 연결되고 부착 기구에 고정되는 베이스 또는 전기 모듈과 미니 카메라 사이의 바람직한 상대적 이동을 하게 구성된다. 예시적인 실시예에서, 미니 카메라는 카메라, 광학계, 및/또는 다른 전기 구성요소를 수용할 수 있다. 다른 예시적인 실시예에서, 전기 모듈은 전기 구성요소를 수용하도록 구성되고, 단순한 베이스 이상 의 역할을 한다. 전기 구성요소는 프로세서, 메모리, 및 트랜시버(예를 들어, 블루투스 가능 통신)와 같은 통신 전자장치를 다른 전기 구성요소 중에서 포함할 수 있고, 본원에 개시된 목적을 달성하기 위한 임의의 적절한 방 식으로 구성될 수 있다. 예시적인 실시예에서, 트랜시버는 이미지 데이터(예를 들어, 퍼팅 스트로크의 이미지) 를 모바일 장치에 무선으로 전송하도록 구성될 수 있다. 예시적인 실시예에서, 조인트는 미니 카메라와 전기 모듈 사이의 상대적 이동을 허용하는 임의의 운동학적 조인트를 포함할 수 있다. 다양한 예에서, 조인트는 하나 이상의 이동 자유도를 허용할 수 있다. 다양한 예에 따르면, 조인트는 힌지 또는 핀 조인트와 같은 회전 조인트, 또는 볼 또는 롤러 베어링과 같은 복합 조인트를 포함할 수 있다. 본 개시의 범위를 제한하지 않는, 예시적인 실시예에서, 조인트는 핀및 고정구를 포함한다. 이 예시적인 실시예에서, 고정구는 전기 모듈에 부착되고, 핀은 미니 카메라에 부착되고, 핀은 미니 카메라가 축을 중심으로 하나의 자유도로 회전하도록 허용하는 회전 축 을 중심으로 회전하도록 구성된다. 예시적인 실시예에서, 조인트는 미니 카메라와 전기 모듈 사이의 바람직한 상대적 이동을 하게 그 리고 원하는 포인팅이 달성될 때 전기 모듈에 대해 제자리에서 미니 카메라를 고정하도록 구성된다. 예 를 들어, 전기 장치는 전기 모듈에 대한 바람직한 위치에서 미니 카메라를 제자리에 고정하기 위한 잠 금 핀(도시되지 않음)을 포함할 수 있다. 또한, 적절한 잠금 기구를 사용하여 미니 카메라가 전기 모듈(1 3)에 대한 방향을 가리키게 조정하여 고정시킬 수 있다. 예시적인 실시예에서, 조인트는 미니 카메라의 조준을 조정하도록 구성된다. 조정은 장치가 모자에 부 착될 때 또는 사용 중에 빈번하게 이루어지는 수동 조정이 될 수 있다. 다른 예시적인 실시예에서, 조정은 모자 클립의 위치에 관계없이 퍼팅 스트로크의 오버헤드 뷰에 대해 미니 카메라의 조준이 똑바로 아래를 향 하게 하도록, 자동적으로 이루어질 수 있다. 다른 실시예에서, 미니 카메라 및 조인트는 골퍼의 움직임에 관계없이 미니 카메라가 원하는 방향 을 가리키도록 항상 자유롭게 회전하도록 구성된다. 하나의 예시적인 실시예에서, 원하는 방향은 직선 아래일 수 있다. 이 예시적인 실시예에서, 조인트는 전기 모듈에 대한 미니 카메라의 움직임을 자유롭게 허용하도록 구성될 수 있고, 미니 카메라는 중력이 조인트 상에서 직선 아래 포인트로 움직이도록 가중 될 수 있다. 다른 예시적인 실시예에서, 원하는 방향은 미니 카메라로부터 직선 아래로 수직선에 대한 일정 각도에 있을 수 있다. 예를 들어, 원하는 방향은 수직선으로부터 골퍼로부터 5도 떨어진 각도일 수 있다. 이것 은 중력으로 인해 5도 각도로 매달리도록 미니 카메라에 가중치를 주어 다시 이루어질 수 있다. 또한, 미니 카메라는 임의의 적절한 각도로 매달려 있을 수 있다. 다른 예시적인 실시예에서, 원하는 포인팅 방향은 자 이로스코프, 모터, 또는 임의의 적절한 조준 시스템에 의해 야기될 수 있다. 위에서 언급한 바와 같이, 예시적인 실시예에서, 미니 카메라 장치는 부착 기구를 더 포함한다. 부착 기구 는 미니 카메라 장치를 모자에 부착하도록 구성될 수 있다. 본 명세서에서 모자로 설명되었지만, 본 개시내 용은 바이저, 리드(lids), 캡, 헬멧, 헤드기어, 헤드피스, 헤드밴드 또는 골퍼의 머리에 적절하게 착용될 수 있 는 임의의 다른 물체로 확장된다는 것을 이해해야 한다. 부착 기구는 예시적인 실시예에서 모자 클립일 수 있다. 예시적인 실시예에서, 미니 카메라 장치는 접착제, 용접, 자석, 벨크로® 테이프, 나사, 또는 그와 같은 것을 사용하여 골프 모자 클립에 연결된다. 일 예시적인 실시예에서, 미니 카메라 장치는 안전한 부착을 위해 암수 나사를 사용하여 모자 클립에 부착된다. 미니 카메라 장치는 필요에 따라 쉽게 탈부 착이 가능한 것일 수 있다. 일 실시예에서, 자기 테이프 또는 기타 유사한 베이스 플레이트와 같은 자성 재료가 클립-온 미니 카메라 장치 의 상부 표면에 부착되고, 자기 골프 마커와 같은 골프 액세서리가 미니 카메라 장치에 부착될 수 있다. 본 명세서에서 골프 모자 클립과 관련하여 설명되었지만, 본 개시 내용은 조절 가능한 각도 메커니즘을 갖 는 미니 카메라 장치를 모자, 캡 또는 바이저에 부착할 수 있는 임의의 장치로 확장되는 것이다. 예시적인 실시예에서, 모자 클립은 PINMEI 자기 표준 골프공 마크와 같은 골프공 마크 모자 클립과 유사할 수 있다. 이 예시적인 실시예에서, 베이스 클립은 모자의 챙에 클립될 수 있고, 미니 카메라 장치는 모자 클립에 착탈 가능하게 자기적으로 연결될 수 있다. 도 3에 도시된 바와 같이, 예시적인 실시예에서, 클립-온 미니 카메 라 장치는 골프 모자에 클립된다. 골퍼는 모자 클립을 사용하여 클립-온 미니 카메라 장치가 고정된 골프 모자를 착용한다. 장치(1 6)의 조준은 조인트를 사용하여 미니 카메라 장치를 조준하여 퍼팅 스트로크 동작의 오버 헤드 뷰 이미 지를 제공하도록 조정된다. 클립-온 미니 카메라 장치를 착용함으로써, 골퍼는 클립-온 미니 카메라 장치 를 착용하여 골퍼는 어느 골프 코스나 스트림 중 적어도 하나에 어디든 가지고 갈 수 있어서, 골프 코스에 실제 퍼팅 그린 상에서 퍼팅 스트로크의 오버헤드 뷰를 레코드 할 수 있다. 도 4를 참조하면, 클립-온 미니 카메라 장치가 부착된 골프 모자를 착용한 골퍼가, 손으로 퍼 터를 잡고 퍼터 헤드를 옆에 골프공 옆에 위치시켜 퍼팅 스트로크를 위해 골프공 위로 구부린다. 골퍼는 퍼터 헤드와 골프공을 탑-다운 뷰, 즉 오버헤드 뷰에서 본다. 골퍼는 퍼팅 스트로크에 대한 원하는 오버헤드 뷰를 캡처하기 위해 미니 카메라를 조준하기 위해서 조인트를 사용함으로써 장치의 조준을 조정한다. 점선은 클립-온 미니 카메라 장치가 골퍼가 퍼팅 스트로크 동작을 볼 때 오 버헤드 뷰를 제공하는 것을 목표로 하는 것을 예시한다. 뷰는 골프 공과 퍼터 헤드를 볼 수 있다. 뷰는 또한 골퍼의 손, 퍼터 샤프트, 골퍼의 신발 중 하나 이상을 볼 수 있다. 이제 도 5를 참조하면, 시스템은 예시된 스크린과 같은 디스플레이 스크린을 더 포함할 수 있다. 시스템은 퍼터 헤드가 퍼팅 스트로크에서 골프공에 어드레스되는 순간에 구해진 도 4에 도시된 장치에 의해 이전에 캡처된 비디오로부터 오버헤드 뷰 정지 이미지를 스크린 상에 디스플레이하도록 구성될 수 있다. 예 시적인 실시예에서, 골프공 및 퍼터 헤드는 이미지 처리 기술을 사용하여 검출된다. 다른 예시적인 실 시예에서, 기계 학습 기술(machine learning techniques)이 골프 공 및 퍼터 헤드와 같은 관심 대상물 의 검출 및 추적의 자동화, 정확도, 및 속도를 개선하기 위해, 이미지 처리 방법에 추가로 사용된다. 이제 도 6을 참조하면, 시스템은 분석 정보에 대한 증강된 디스플레이를 스크린 상에 디스플레이하도록 추 가로 구성될 수 있다. 분석 정보는 관찰된 활동의 개선에 유용한 정보를 포함할 수 있다. 퍼팅의 맥락에서, 분 석 정보는 골퍼의 퍼팅 게임의 개선에 유용한 정보를 포함할 수 있다. 그러나 분석 정보는 관찰된 활동에 따라 다른 정보를 포함할 수 있다. 예를 들어, 관찰된 활동이 치핑, 드라이빙 또는 아이언 타격인 경우, 분석 정보는 골퍼의 게임의 해당 부분을 개선하는 정보를 포함할 수 있다. 관찰된 활동이 야구 방망이를 휘두르는 것이라면, 분석 정보는 야구 선수의 타율 향상과 관련된 정보를 포함할 수 있다. 관찰된 활동이 테니스 라켓을 휘두르는 것이라면, 분석 정보는 테니스 선수의 게임을 향상시키는 것과 관련된 정보를 포함할 수 있다. 관찰된 활동이 당구인 경우, 분석 정보는 당구 선수의 게임을 개선하는 것과 관련된 정보를 포함할 수 있고, 표준 당구공 크기 에 기초할 수 있다. 관찰된 활동이 탁구인 경우, 분석 정보는 탁구 선수의 게임을 개선하는 것과 관련된 정보를 포함할 수 있고, 표준 탁구공 크기에 기초할 수 있다. 또한, 장치는 표준 크기의 적어도 하나의 객체가 일 반적으로 오버헤드 뷰에서 이용 가능한 사람에 의해 수행된 정의된 활동의 오버헤드(탑-다운 관점) 뷰로부터 이 익을 얻는 임의의 활동에 대한 분석 정보를 제공하도록 구성될 수 있다. 계속해서 도 6을 참조하고, 관찰된 활동이 퍼팅인 예시적인 실시예에서, 스크린은 이미지(스트리밍 또는 퍼 팅 활동 이전에 촬영됨)를 디스플레이하고, 컴퓨터 비전 기술(또는 이미지 처리 기술)에 의해 획득된 분석 정보 를 디스플레이하여서 디스플레이를 증강하도록 구성된다. 예를 들어, 이미지에는 골퍼의 신발, 다리, 손, 퍼터 및 골프공이 포함될 수 있다. 이미지는 퍼팅면, 홀, 핀, 또는 미니 카메라 장치에 의해 레코드된 임의의 다 른 이미지를 더 포함할 수 있다. 일 실시예에서, 디스플레이되는 분석 정보는 기준선, 각도, 거리 등을 포함할 수 있다. 예를 들어, 골퍼의 두 신발의 토우(toe)에서 그려진 라인을 보여주는 기준선이 디스플레이될 수 있다. 기준선은 퍼터 페이스에 평행하 게 그려질 수 있고, 그리고 퍼터 페이스의 스위트 스폿, 센터, 또는 퍼터 페이스의 골프 공의 임팩트 지점 중 하나에서 퍼터 페이스에 대해 수직으로 그려질 수 있다. 다른 실시예에서, 기준선은 퍼터 페이스의 토우 또는 힐로부터 어느 한 방향으로 연장되는 퍼터 페이스에 수직으로 그려질 수 있다. 또한, 기준선은 임팩트 시 볼의 경로에 수직인 라인 및/또는 디스플레이된 이미지에 대한 상대적 거리 또는 각도를 나타내는 데 유용한 임의의 라인을 표시하여 그려질 수 있다. 예시적인 실시예에서, 분석 정보는 상기 기준선들 중 하나 이상 사이의 상대적 거리 또는 각도를 정량화하는 텍 스트/데이터를 더 포함할 수 있다. 예를 들어, 스크린은 임팩트 시 볼의 경로에 대한 퍼터 헤드의 각도 (임팩트의 포인트에서 퍼터 페이스에 수직인 라인에 대한 퍼터 페이스와 평행한 선)를 나타내고 정량화하는 증 강 분석 정보를 디스플레이 할 수 있다. 각도는 예를 들어 도(degree) 또는 라디안으로 표시될 수 있다. 도 6의 예시된 실시예에서, 스크린은 볼을 어드레스하는 지점에서 퍼터 각도를 3도로 표시한다. 더욱이, 증강 분석 정보는 실제 퍼터 페이스 방향(임팩트 시)이 원하는 퍼터 페이스 방향에 대해 얼마나 멀리 떨어져 있는지를 보 여주는 임의의 적절한 방식으로 디스플레이될 수 있다. 증강 분석 정보는 예를 들어, 임팩트 시 퍼터 헤드와 골프공 사이의 퍼터 페이스 상의 정확한 접촉 위 치를 디스플레이 할 수 있다. 예를 들어, 스크린은 임팩트 지점과 퍼터의 토우, 퍼터의 힐, 센터(퍼터의 토 우와 힐 사이의 중간, 및/또는 퍼터의 스위트 스폿) 사이의 거리를 디스플레이 할 수 있다. 도 6에 도시된 바와 같이, 스크린은 퍼터의 토우로부터 임팩트 지점까지의 거리를 5.9cm 로 디스플레이 한다. 또한, 증강 분석 정보는 골퍼가 퍼터의 임팩트 지점이 원하는 임팩트 지점으로부터 얼마나 멀리 떨어져 있는지(편차) 또는 퍼트 사이에 임팩트 지점의 변화가 얼마나 나가는지를 알 수 있도록 돕는 임의의 적절한 방식으로 디스플레이될 수 있다. 증강 분석 정보는 예를 들어 임팩트 시 골퍼의 신발에 대한 퍼터 헤드의 위치를 디스플레이 할 수 있다. 예 를 들어, 스크린은 퍼터 페이스가 골프공과 충돌하는 지점에서 퍼터의 힐과 골퍼의 신발의 토우 사이에 그 려진 라인 사이의 수직 거리를 디스플레이 할 수 있다. 도 6의 예시된 실시예에서, 스크린은 골퍼 신발의 토우에서 퍼터의 힐까지의 거리를 17.2cm 로 디스플레이 한다. 또한, 증강 분석 정보는 골퍼의 신발에 대한 골프 공의 위치, 및/또는 골퍼가 퍼트를 만들기 위해 얼마나 멀리 손을 뻗고 있는지를 보여주는 임의의 적 절한 방식으로 디스플레이 될 수 있다. 더욱이, 증강 분석 정보는 관찰된 활동을 개선, 논평, 공유, 비교 및/또는 분석하는데 유용한 정보를 제공하기 위한 임의의 적절한 그래픽 또는 텍스트를 포함할 수 있다. 예시적인 실시예에서, 증강 분석 정보는 기준선 및 그들 사이의 각도를 식별하기 위한 이미지 처리에 기초할 수 있다. 예시적인 실시예에서, 거리에 대한 증강 분석 정보는 물체의 크기 및/또는 이미지에서 캡처된 물체의 크기에 기 초한 기준선 또는 지점 사이의 거리(여기서 물체는 알려진 크기)를 결정하기 위해 스케일링을 추가로 사용하는 이미지 처리에 기초하여 결정될 수 있다. 예시적인 실시예에서, 이미지에는 알려진 크기의 적어도 하나의 객체 가 있다. 다른 예시적인 실시예에서, 알려진 크기의 객체는 스케일링이 여전히 적용 가능하도록 분석되는 이미 지에 시간상 비교적 가깝게 캡처된 다수의 이미지 중 적어도 하나의 이미지에서 캡처된다. 특히, 예시적인 실시 예에서, 알려진 크기의 객체는 골프공이다. USPGA는 모든 골프공이 직경이 42.67mm 와 같이 정해진 직경이어야 한다고 규정하고 있다. 이것은 변경될 가능 성이 낮지만, 다양한 예시적인 실시예에서, 알려진 물체의 크기는 임의의 적절한 크기일 수 있다. 다른 예시적 인 실시예에서, 퍼터의 제조사 및 모델이 알려진 경우, 퍼터 헤드의 크기는 분석을 위해 알려진 물체의 크기일 수 있다. 알려진 크기의 물체는 여기에서는 교정 물체(calibration object)로 지칭될 수 있다. 증강 분석 정보는 움직임에 대한 \"측정\" 매개변수를 가진 추가의 \"측정\" 매개변수를 더 포함할 수 있다. 이러한 움직임 매개변수는 예를 들어 이미지의 다중 프레임을 포함하는 이미지 처리 또는 비디오 처리에 의해 결정될 수 있다. 예를 들어, 시스템은 퍼팅 스트로크의 속도, 임팩트 후 공의 이동 방향, 및 임팩트 후 공의 이동 속도, 퍼터 경로, 골프공 가속도, 각가속도 및/또는 골프공의 속도, 골프공의 스핀, 퍼터 헤드 가속/감속, 운동 량 전달, 임팩트 시 퍼터 헤드와 공의 접촉 위치, 골퍼의 머리 움직임 각도 및 거리, 각도 및 골퍼의 머리 움직 임의 공간적 가속/감속, 골퍼의 손목 움직임의 각도, 골퍼의 퍼터 그립 위치, 골퍼의 발에 대한 골프 공의 위치 등을 분석하게 구성될 수 있다. 또한, 시스템은 처리되는 하나 이상의 이미지에서 캡처된 알려진 크기의 물체의 크기를 기초로 하는 이미지 처리 기술에 기반한 정보를 결정하도록 구성될 수 있다. 따라서, 골퍼 및/또는 강사는 디스플레이 스크린에 디스플레이된 카메라 이미지(들) 및/또는 증강 분석에 대한 검토를 통해 골퍼의 퍼팅을 분석할 수 있다. 하나의 예시적인 실시예에서, 골퍼 및/또는 강사는 퍼터 헤드 와 골프 공 사이의 임팩트 지점 전후의 오버헤드 뷰 스틸 이미지와 퍼팅 스트로크의 레코드된 비디오를 검토함으로써 퍼팅 스트로크 평면 또는 라인을 평가할 수 있다. 골프공에 대한 골퍼의 어드레스에서 오버헤 드 뷰 이미지가 검토될 때, 골퍼의 손의 그립과 퍼터 헤드의 위치가 평가될 수 있고, 퍼팅 스트로크의 이상적인 특성이 골퍼에 대해 결정될 수 있다. 퍼팅 어드레스에서 이미지의 오버헤드 뷰는 또한 공의 속도 및 경로와 같은 공의 움직임에 대한 분석을 용이하 게 할 수 있다. 예시적인 실시예에서, 시스템은 특정 골프 코스에 대한 하나 이상의 퍼팅 그린에 대한 가치 있 는 정보를 생성하도록 구성된다. 이 정보는 골프 코스에 있는 실제 퍼팅 그린의 특성을 배우는 데 유용하다. 예 시적인 실시예에서, 시스템은 그 스트로크에 대해 플레이되는 특정 그린의 맥락에서 및/또는 그 스트로크에 대 한 그린 상의 특정 위치의 맥락에서 퍼팅 스트로크 동작을 분석하도록 구성된다. 따라서 증강 디스플레이는 실 제 그린의 슬로프와 속도 및 해당 그린의 위치와 관련하여 골퍼의 스트로크를 향상시킬 수 있다. 따라서, 증강 디스플레이는 골퍼의 퍼팅 게임을 개선하고 궁극적으로 골프 스코어를 낮추기 위해 보다 완전하거나 전체적인 트레이닝 피드백을 제공하도록 구성될 수 있다. 증강된 디스플레이 정보를 사용하여 임의의 적절한 레슨을 지도할 수 있지만, 예시적인 일 실시예에서는 골퍼 가 퍼터 헤드의 \"임팩트 위치\"(퍼터 페이스의 토우와 힐 사이)에서 골퍼는 이전 퍼트와 비교하여, 이상적인 퍼트와 비교하여, 골퍼 자신이 선호하는 위치와 비교하여 공을 타격하는 위치를 시각적으로 볼 수 있다. 골퍼는 자신이 얼마나 피곤한지, 그린의 경사, 퍼트의 길이, 백 스윙의 거리, 또는 기타 요인에 기초 하여 임팩트 위치가 달라지는 경향이 있다는 것을 배울 수 있다. 따라서, 시스템은 골퍼가 임팩트 위치의 일관 성, 헤드 움직임 데이터(예: 속도, 각도, 가속도 및 헤드 이동량), 및/또는 이 정보를 기반으로 측정 가능한 개 선을 위한 작업을 정량화할 수 있도록 기계 학습 또는 데이터 과학 원리를 사용하여 구성될 수 있다.이 설명은 주로 이미지 처리 알고리즘에 기초하여 증강 디스플레이 정보를 획득하는 것을 논의하지만, 일부 예 시적인 실시예에서는 증강 디스플레이 정보가 GPS 데이터, 3D 슬로프 판독기, 가속도계, 센서 등에 의해 또는 이에 기초하여 획득될 수 있다. 다른 예시적인 실시예에서, 증강된 디스플레이 정보는 골퍼에 의해 입력되 거나 외부 소스로부터 수신된 데이터에 기초할 수 있다. 예를 들어, 골퍼는 골퍼의 퍼터 제조사 및 모델, 스윙 선호도 등에 관한 정보를 입력할 수 있다. 또는, 축적된 데이터를 이용하여 기계 학습 알고리즘을 통해 정 보를 구성할 수도 있다. 그런 다음, 증강된 디스플레이 정보는 골퍼의 입력 스윙 선호도 또는 골퍼의 골프 클럽 에 대한 데이터베이스에서 조회된 데이터를 기반으로 할 수 있다. 다양한 예시적인 실시예에서, 증강 디스플레 이 정보는 이들 정보 소스 중 둘 이상의 조합에 기초할 수 있다. 예시적인 실시예에서, 시스템은 사용자가 미니 카메라 레코딩을 보기 위한 디스플레이 옵션을 선택할 수 있도록 구성될 수 있다. 디스플레이 옵션은 예를 들어 줌 옵션, 녹화된 이미지를 프레임별로 보기, 퍼팅 스트로크의 비 디오 보기 또는 퍼팅 스트로크의 라이브-스트림 디스플레이를 포함할 수 있다. 이들 뷰잉 실시예 중 임의의 실 시예에서는, 증강 분석이 디스플레이에 포함될 수 있다. 예시적인 실시예에서, 이것은 연속성 등을 보장하기 위 한 수정과 함께 프레임을 스티칭함으로써 이루어진다. 이제 도 7을 참조하면, 하나의 예시적인 실시예에서, 미니 카메라 장치의 고정구는 연장 가능한 장치를 포함할 수 있다. 예를 들어, 연장 가능한 장치는 신축자재 구조일 수 있다. 예시적인 실시예에서, 연장 가 능한 장치는 신축자재 로드(telescopic rod)이다. 연장 가능한 장치는 미니 카메라와 전기 모듈 사이의 거리를 조절하여 미니 카메라의 위치를 조절하도록 구성될 수 있다. 연장 가능한 장치는 전기 모듈과 모자 클립 사이의 거리를 조절하여 미니 카메라의 위치를 조정하도록 구성될 수 있다. 또한, 연장 가능 한 장치는 골퍼의 형태, 크기, 태도 및 자세에 따라 퍼팅 스트로크 동작에 대한 원하는 오버헤드 뷰를 제공하도 록 구성된 임의의 적절한 구조일 수 있다. 따라서, 확장 가능한 장치는 퍼팅 스트로크 동작을 더 잘 캡처하기 위해 미니 카메라 장치의 유리한 지점을 변경할 수 있다. 이제 도 8을 참조하여, 미니 카메라 장치의 다양한 예시적인 구성요소를 설명한다. 이러한 예시적인 구성요 소 중 하나 이상은 실질적인 미니 카메라 장치의 일부를 포함할 수 있다. 예시적인 실시예에서, 미니 카메 라 장치는 본 명세서의 다른 곳에서 설명되는 미니 카메라를 포함한다. 다른 예시적인 실시예에서, 미 니 카메라는 퍼팅 스트로크 동작의 분석과 관련된 객체의 선명한 오버헤드 뷰 이미지를 생성하기 위해 이미 지(들)/비디오의 초점 길이를 조정하도록 구성된 줌 모듈을 포함한다. 이러한 관련 객체는 퍼터 헤드, 골프공, 퍼터 샤프트, 그린 그라운드 지면 등의 것 중 하나 이상을 포함할 수 있다. 줌 모듈은 클 립-온 미니 카메라 장치와 골프공 사이의 거리 변화에도 불구하고 이와 같은 선명한 이미지를 생성하도 록 구성될 수 있다. 이러한 변화는 골퍼의 키, 스탠스/자세, 퍼팅 그린 표면의 변조 및/또는 기타 이유로 인해 발생할 수 있다. 따라서 줌 모듈은 사용 중인 이미지 처리 알고리즘과 관련하여 필요한 이미지 품질에 따 라 퍼팅 스트로크 동작 및 공의 움직임에 대한 오버헤드 뷰 이미지를 캡처하기에 용이하게 하도록 구성될 수 있 다. 줌 모듈은 예를 들어 전자 줌 기술, 또는 이미지의 초점 거리를 조정하기 위한 줌 렌즈 및 액추에이터 와 같은 임의의 적절한 물리적 줌 부품을 사용하여 구현될 수 있다. 다양한 실시예에서, 미니 카메라 모듈에는 관심 영역을 캡처하기 위해 넓은 화각을 갖는 렌즈가 장착된다. 화각 은 명목상 140도이고, 퍼팅 스트로크 동작 분석의 범위 및 목표에 따라 조정된 값으로 설정될 수 있으며, 예를 들어 80도와 240도 사이, 다른 예에서는 50도와 240도 사이의 값이다. 일 실시예에서, 클립-온 미니 카메라 장치는 클립-온 미니 카메라 장치의 작은 움직임을 검출하고, 광 학 이미지 안정화(OIS) 기술을 이용하여 이미지의 임의의 블러(blur)를 보상하도록 구성된 모듈을 포함한 다. 예를 들어, OIS 모듈은 작은 움직임을 검출하는 자이로스코프 및 작은 움직임을 보상하기 위해 실시간으로 렌즈를 이동시키는 액추에이터를 포함할 수 있다. 또한, 이미지 품질을 향상시키기 위해 임의 의 적절한 OIS 기술을 사용할 수 있다. 도 8 및 도 9를 참조하면, 예시적인 실시예에서, 미니 카메라 장치는 배터리를 더 포함한다. 예를 들어, 미 니 카메라 장치는 예를 들어 포트를 통해 USB 케이블을 사용하여 재충전되는 내장 충전식 리튬 배터리 를 포함할 수 있다. 또한, 임의의 적절한 에너지 저장 장치가 사용될 수 있다. 예시적인 실시예에서, 클립-온 미니 카메라 장치는 GPS 모듈을 포함한다. GPS 모듈은 퍼팅 스트 로크가 수행된 위치를 검출하도록 구성될 수 있다. 예시적인 실시예에서, 도 8 및 도 10을 참조하면, 미니 카메라 장치는 무선 통신 모듈을 포함한다. 무 선 통신 모듈은 모바일 장치와 무선으로 통신하도록 구성될 수 있다. 모바일 장치는 애플 리케이션 서버 및/또는 클라우드 서버와 통신하도록 구성될 수 있다. 다른 예시적인 실시예에 따르면, 미니 카메라 장치는 미니 카메라 장치를 장치들 사이에서 데이터를 전송하고/하거나 미니 카메 라 장치를 충전하기 위한 모바일 장치, 태블릿, 및 컴퓨터와 연결하는 케이블(예를 들어, USB C-형 케 이블)을 사용하도록 구성된 통신 모듈을 포함할 수 있다. 일 실시예에서, 미니 카메라 장치는 가속도계 및 자이로스코프를 포함한다. 가속도계 및 자 이로스코프는 예를 들어 동작 기초(motion-based) 데이터를 생성하도록 구성될 수 있다. 여기서, 동작 기 초 데이터는 데이터가 이미지에서 파생되지 않았음을 의미한다. 오히려 동작 기초 데이터는 동작을 직접 측정하 는 센서에서 파생되었다. 동작 기초 데이터는 퍼팅 스트로크 어드레스 및 퍼팅 스트로크 전, 동안, 후에 퍼팅 스트로크 동작에 대한 속도, 가속도, 배향, 방향 등을 포함할 수 있다. 그러나 이미지 기초 데이터에는 속도, 가속도, 배향, 방향 등도 포함될 수 있지만, 이와 같이 다른 방식으로 파생될 수 있음에 유의한다. 일 실시예에서, 미니 카메라 장치는 거리계(rangefinder) 모듈을 포함한다. 거리계 모듈은 비행 시간(TOF: Time-of-Flight) 원리를 기반으로 클립-온 미니 카메라 장치와 하나 이상의 관심 객체(예를 들어, 골프 공, 그라운드 등)와의 사이의 거리를 측정하도록 구성될 수 있다. 거리계 모듈은 임의의 적절한 거리계 장치(예를 들어, 광학, 소나, 레이더, 라이더 등)를 포함할 수 있다. 예시적인 실시예에서, 거리 정보는 미니 카메라를 통해 보여지는 골프 공에 대한 미니 카메라 장치의 위치를 모니터링하기 위해 추 적된다. 일 실시예에서, 미니 카메라 장치는 야간 투시경 모듈을 포함한다. 야간 투시경 모듈은 센서 및 적외선(IR) 발광 다이오드(LED)를 사용하여 보고 녹화하도록 구성될 수 있다. 이 실시예에서, 야간 투시경 모듈은 야간 투시 기능을 자동으로 온/오프 하거나, 야간 투시 기능을 수동으로 온/오프 하거나, 기본 설 정에 의해 그렇게 하도록 구성될 수 있다. 따라서, 미니 카메라 장치는 골퍼가 해질녘, 초저녘 또는 새 벽에 퍼팅을 할 때 스크린에서 쉽게 인지할 수 있도록 퍼팅 스트로크의 이미지가 여전히 디스플레이되어 레 코드될 수 있도록 구성된다. 예시적인 실시예에서, 클립-온 미니 카메라 장치는 복수의 미니 카메라 모듈을 포함할 수 있고, 여기 서 상기 복수의 미니 카메라 모듈의 각각은 골프 스윙에 대한 오버헤드 이미지를 캡처하도록 구성된다. 이 예시 적인 실시예에서, 시스템은 몇 가지 예를 들면, 줌 성능을 개선하고, 광각 뷰를 달성하고, 배경이 흐려진 이미 지를 향상시키고, 풀 컬러의 고품질을 달성하고, 미니 카메라 장치와 골프공 사이의 거리를 측정하고, 및/또는 증강 실제 데이터를 향상하기 위해, 복수의 미니 카메라 모듈 각각으로부터 이미지를 처리하기 위 한 코드를 더 포함할 수 있다. 각각의 미니 카메라 모듈은 예를 들어 시스템 요구 사항에 따라 상이한 유 형의 광시야 렌즈, 줌 모듈 및 OIS 모듈을 이용하여 초 당 픽셀 및 프레임의 상이한 사양을 가질 수 있다. 예시적인 일 실시예에서, 클립-온 미니 카메라 장치는 마이크 및 음성 정보를 녹음하는 음성 녹음 모 듈을 포함한다. 이 정보는 골프를 치는 동안 골퍼에게 제공된 지시 또는 기타 바람직한 정보를 포함할 수 있다. 음성 정보는 녹음되어 나중에 재생할 수 있어서, 골퍼가 필드에서 강사와 논의한 정보에 용이하게 액 세스할 수 있다. 오디오 녹음은 미니 카메라 장치, 모바일 장치 또는 임의의 다른 적절한 장치에서 마이크 로부터 만들어질 수 있고, 오디오 녹음은 녹음 장치에서 다양한 장치로 전송될 수 있고, 다시 다양한 장치 에서 재생할 수 있다는 것에 유의 한다. 일 실시예에서, 클립-온 미니 카메라 장치는 사용자의 음성을 인식하고, 음성 명령을 처리하여, 이미지 녹 화, 음성 정보 녹음 및 동작 기초 데이터 수집을 구비하는 장치의 작동을 시작 및 중지하는 음성 인식 모듈 을 포함한다. 일 실시예에서, 클립-온 미니 카메라 장치는 스피커를 포함한다. 사용자는 인공지능(AI) 알고리즘과 같은 컴퓨터 코드 생성으로 또는 라이브 스트리밍 비디오 이미지를 원격으로 보고 있는 강사로부터 스피커(82 3)를 통해 지침을 들을 수 있다. 일 실시예에서, 클립-온 미니 카메라 장치는 이미지 녹화 및 데이터 수집을 개시하고 중지하기 위해 미리 프로그래밍된 동작 명령(들)을 검출하는 LED와 같은 적외선(IR) 광원 및 동작 검출 센서 모듈를 포함 한다. 동작 센서 및 IR 광원 검출기로 설명되었지만, 미리 프로그래밍된 동작 명령을 검출하는 데 적절한 임의 의 센서를 사용할 수 있다. 일 실시예에서, 도 8 및 도 11를 참조하면, 클립-온 미니 카메라 장치는 골퍼가 이를 눌러서 수동으로 온/오프하여 이미지 및 음성 데이터를 레코딩 하고 그리고 골프 데이터를 수집하 도록 구성된 푸시 버튼 스위치를 포함한다. 푸시 버튼 스위치는 박막 기반 버튼일 수 있고, 클립-온 미니 카메라 장치의 상부에 설치될 수 있다. 그러나, 임의의 적절한 스위치, 버튼 또는 수동 장치가 미니 카메라 장치의 다양한 기능의 시작 및 중지를 트리거하는 데 사용될 수도 있다. 또한, 예시적인 실시예에서, 미니 카메라 장치는 타이머 모듈을 포함할 수 있다. 타이머 모듈은 미리 프로그래밍된 타이머 설정에 따라 이미지 녹화 및 데이터 수집을 개시 및 중지하도록 구성될 수 있다. 예 를 들어, 타이머 모듈은 푸시 버튼 스위치가 눌려진 후, 5초 후에 이미지 녹화를 시작하도록 구성될 수 있다. 대안적인 실시예에서, 사용자는 모바일 장치에 대한 사용자 입력에 기초하여 레코딩의 시작 및 중지를 트리거하기 위해 모바일 장치 앱을 사용함으로써 타이머 기능을 작동한다. 다른 예시적인 실시예에서, 사용자는 미니 카메라 장치가 레코딩이 개시된 후, 사용자 입력 시간 길이동안 녹화한 다음 중지하도록, 레코딩 지속 시간을 입력할 수 있다. 또한, 타이머 모듈은 자동 또는 반자동 방식으로 이미지 녹화 및 데이터 수집을 개시/종료하도록 임의의 적절한 방식으로 구성될 수 있다. 예시적인 실시예에서, 타이머 모듈은 데이터 저 장 공간 및/또는 전력 소비를 절약할 뿐만 아니라, 장치를 온/오프 하는 편리한 방법을 제공하도록 구성된다. 다른 예시적인 실시예에서, 미니 카메라 장치는 이미지 처리 알고리즘에 기초하여 레코딩 및 데이터 수집을 온/오프 하도록 구성될 수 있다. 예를 들어, 코드는 골프공의 움직임이 프레임을 벗어날 수 있음을 예측하고, 그 예측을 사용하여 레코딩 및 데이터 수집을 중지하도록 구성될 수 있다. 다른 예시적인 실시예에서, 코드는 이미지의 프레임을 연속적으로 분석하고, 골프 공 또는 퍼터 헤드와 같은 관심 객체의 특정 움직임이 검출되기 전에 여러 프레임에서 획득된 이미지 및 데이터의 레코딩을 시작하도록 구성될 수 있다. 또한, 미니 카메라 장 치에 의해 수신된 이미지 및 데이터로부터 저장되어야 하는 이미지 및 데이터를 결정하기 위해 임의의 적절 한 인공지능 루틴이 사용될 수 있다. 일 실시예에서, 클립-온 미니 카메라 장치는 메모리 또는 정보 모듈을 포함할 수 있다. 정보 저장 모 듈은 이미지 및 수집된 데이터를 마이크로 SD 카드와 같은 메모리 매체에 저장 하고/하거나 루프 레코딩 모드를 자동으로 켜도록 구성될 수 있다. 예시적인 실시예에서, 미니 카메라 장치는 이미지 및 다른 수집된 정보를 저장하기 위해 휴대용 저장 매체에 물리적으로 연결하도록 구성될 수 있다. 예시적인 실시예에서, 휴대 용 저장 매체는 마이크로 SD 카드 등이 될 수 있다. 도 12를 참조하면, SD 카드 포트는 전기 모듈에 도시되어 있다. 도 8 및 도 13을 참조하면, 일 실시예에서, 클립-온 미니 카메라 장치는 가시 파장(예를 들 어, 400 nm 내지 740 nm)에서 광점(예를 들어, 적색 광점의 예시적인 예)을 비추어 퍼터 헤드, 골프 공 및 골퍼의 신발에 대한 골퍼의 머리 위치를 나타내는 데 사용되는 레이저 다이오드 또는 발광 다이 오드(LED)와 같은 적어도 하나의 광원을 포함한다. 골퍼는 퍼팅 그린 표면 상의 가시 광점을 보 고, 골퍼의 머리의 각도와 방향을 모니터링한다. 따라서, 예시적인 실시예에서, 가시 광점은 퍼팅 스트로 크 동안 안정되고, 움직이지 않는 머리를 유지하는 골퍼의 능력에 대한 실시간 피드백을 골퍼에게 제공한다. 퍼팅 스트로크 중에 촬영한 이미지에 광점이 기록될 수 있다. 예시적인 실시예에서, 디스플레이 는 증강 분석 정보의 일부로서 광점을 디스플레이하도록 구성된다. 골퍼는 광점이 스트로크 동안 이동하는지 또는 고정된 지점에서 안정적인지, 광점이 골프 공 또는 골프 공의 전방 또는 후방 위치와 같은 원하는 지점을 겨냥하는지의 여부를 볼 수 있다. 다른 실시예에서, 광원은 적외선 파장 범위(예를 들어, 741 nm 내지 1870 nm)를 사용하고, 카메라의 이미 지 센서는 적외선 광을 검출하도록 구성된다. 시스템은 또한 골퍼의 발, 클럽 헤드, 손 및 공과 같이 그 위에 디스플레이된 다른 객체에 대한 골퍼의 머리의 상대적 위치를 보여주기 위해 모바일 장치의 디스플레이에 스팟의 적외선 이미지를 디스플레이하도록 구성된다. 위에서 설명된 시각 표시기(visible indicator)와 별도로, 예시적인 실시예에서, 미니 카메라 장치는 이미 지 처리를 사용하여 퍼팅 스트로크 전, 동안 및/또는 후에 골퍼의 머리 움직임의 증강 분석을 생성하도록 구성 된다. 이 예시적인 실시예에서, 이제 도 16a, 도 16b, 도 16c, 및 도 16d를 참조하여 설명하면, 예시적인 실시 예에서, 시스템은 사용자가 모바일 장치의 터치 스크린을 통해 위치를 입력함으로써 수동으로 또는 AI(인 공 지능), 기계 학습 및 이미지 인식 기술과 같은 알고리즘을 사용하여 자동으로, 골퍼의 신발 팁을 검출하도록 구성된다. 도 16a 내지 도 16d는 퍼팅 스트로크의 시퀜스를 도시한다. 신발 팁 사이의 라인은 퍼팅 스트 로크의 어드레스에서 골퍼의 스탠스 라인을 정의한다(도 16a). 퍼팅 스트로크 동안, 각 비디오 프레임에서 스탠 스 라인이 추적된다. 기준 스탠스 라인은 골프공에 골퍼의 어드레스에서의 스탠스 라인으로 정의된다. 백 스윙, 골프공 타격, 마무리 동작(follow-through) 스윙과 같은 퍼팅 스트로크를 하는 동안, 골퍼가 자신의 발, 즉 자신의 스탠스 라인을 이동할 가능성은 매우 낮다. 따라서, 후속 프레임에서 스윙 스탠스 라인이 퍼팅스트로크 동안 기준 스탠스 라인에 대하여 변경된다면, 그 차이는 골퍼의 머리 움직임과 상관관계가 있 다. 또한, 골프 스윙 동안 다른, 일반적으로 정적인 물체의 상대적인 움직임은 골퍼의 머리 움직임을 나타낼 수 있다. 예시적인 실시예에서, 골퍼의 머리 움직임은 주어진 비디오 이미지 프레임에서 골프공과 퍼터 헤드의 상 대적인 위치의 변경을 야기할 수 있다. 다른 예시적인 실시예에서, 골퍼의 머리 움직임은 시선 라인을 변경할 수 있고, 이는 주어진 비디오 이미지 프레임에서 골프공과 퍼터 헤드의 상대적인 위치의 변경으로 이어진다. 분 석은 퍼팅 스트로크 전, 동안, 후에 골퍼의 머리 움직임 데이터, 예를 들어 머리 움직임 각도량, 머리 움직임 각속도, 머리 움직임 각가속도, 머리 움직임 거리 등의 증강 분석을 제시한다. 증강 분석 정보는, 예시적인 실 시예에서, (숫자 각도 또는 시각적 표현으로 디스플레이 하여) 골퍼의 머리 각도를 보여줄 수 있다. 보다 일반적으로, 미니 카메라 장치는 관심 대상물의 상대적인 움직임을 결정하기 위해 일련의 이미지에 걸 쳐서 이미지의 한 대상의 상대적 위치의 변화를 이미지의 다른 대상과 비교하는 데 이미지 처리를 사용하도록 구성될 수 있다. 다르게 말하면, 예시적인 실시예에서, 이미지 처리 알고리즘은, 골프공, 퍼터 헤드 페이스 라 인, 골퍼의 스탠스 라인, 골퍼의 손, 그리고 관심 대상의 움직임을 결정하기 위해 골프 공 근처의 볼 마커와 같 은 가시적인 물체 중에서, 이미지 프레임의 픽셀 단위 좌표점과 같은 상대 위치 데이터를 사용한다. 따라서, 손, 무릎 등의 움직임을 결정하기 위해 동일한 기술이 사용될 수 있다. 다양한 실시예에서, 도 8에 도시된 바와 같이, 클립-온 미니 카메라 장치는 도 8에 도시된 장치 및 모듈을 작동시키도록 구성된 전기 드라이버(81 9)를 포함한다. 전기 드라이버는 본 명세서에서 설명된 시스템을 구현하기 위한 임의의 적절한 하드웨어 및/또는 소프트웨어를 포함할 수 있다. 일 실시예에서, 전기 드라이버는 골프의 트레이닝 라운드 동안 항 상 온(on) 상태로 유지하는 대신, 장치가 작동하는 동안에만 장치를 온/오프 절환하는 시머(simmer) 작동을 하 게 구성될 수 있다. 이 기능은 미니 카메라 장치의 배터리 전원을 절약한다. 예시적인 일 실시예에서, 광학 편광 필터가 클립-온 미니 카메라 장치에 부착되어, 밝은 태양광 등으로부터 의 눈부심 및 반사를 감소시켜서, 예를 들어 밝은 태양광 아래에서 이미지 품질을 향상시킬 수 있다. 하나의 예시적인 실시예에서, 도 8 및 도 10에 도시된 바와 같이, 시스템은, Wi-fi, 무선 핫스팟, LTE, 블루투 스 등을 통해 미니 카메라 장치와 지정된 모바일 전자 장치 사이 및 모바일 장치와 애플리케이션 서버 및 클라우드 서버 중 하나 이상과의 사이에서 정보를 전송하는 무선 통신 모듈을 포함한다. 예시적인 실시예에서, 미니 카메라 장치로부터 모바일 장치 및/또는 애플리케이션 서버 및/또는 클라우드 서버로 통신되는 정보는: 비디오 스트리밍, 이미지, GPS 위치 정보, 가속도계 데 이터(예: 가속도 데이터), 자이로스코프 데이터(예: 방향, 각속도), 오디오 데이터, 조명 강도 데이터(모바일 장치 스크린에 온/오프 다크 모드), 및/또는 이와 유사한 것 중 하나 이상을 포함할 수 있다. 예시적인 실시예 에서, 애플리케이션 서버 및/또는 클라우드 서버 및/또는 모바일 장치로부터 미니 카메라 장치 로 통신되는 정보는: 비디오 녹화 온/오프 명령, 마이크 온/오프 명령, 레이저 포인터 온/오프 명령, 디지 털 줌 명령 등 중 하나 이상을 포함할 수 있다. 통신된 정보는: 미니 카메라에 의해 녹화된 이미지, GPS 모듈에 의해 획득된 위치 데이터, 가속도계 및/또는 자이로스코프에 의해 측정된 동작 기반 특성, 거리계 모듈에 의해 측정된 미니 카메라 와 골프공 사이의 거리 중 하나 이상을 포함할 수 있다. 또한, 정보는 미니 카메라 장치에 상이한 센서 및 장치를 사용하여 생성된 임의의 적절한 골프 퍼팅 특성을 포함할 수 있다. 다양한 예시적인 실시예에서, 본 명세서에서 설명된 기능을 구현하기 위해 수행되는 이미지 처리 및 분석은 모 바일 장치, 애플리케이션 서버, 클라우드 서버, 미니 카메라 장치, 및/또는 이러한 장치 중 2개 이상에 배분되어 실행된다. 다양한 실시예에서, 시스템은 하나의 장치 패키지 또는 여러 개별 패키지로 도 8에 도시된 바와 같이, 다양한 모듈의 전부 또는 임의의 조합을 포함한다. 도 8 및 도 10을 참조하면, 일 실시예는 모바일 앱을 사용하여 모바일 전자 장치에 링크된 클립-온 미니 카메라 장치를 도시한다. 예시적인 실시예에서, 시스템은 모바일 앱을 사용하여 단일 또는 다중 모바일 전자 장치(들)에 녹화된 이미지 및 수집된 데이터를 디스플레이하도록 구성된다. 예시적인 실시예 에서, 시스템은 녹화된 이미지와 수집된 데이터를 원격 애플리케이션 서버 및/또는 클라우드 서버로 전송하고, 저장하도록 구성된다. 예시적인 실시예에서, 시스템은 모바일 전자 장치 또는 원격 애플리케이 션 서버에서 통계 및 분석을 위해 녹화된 이미지 및 수집된 데이터를 처리하도록 구성된다. 예시적인 실시 예에서, 시스템은 추가로, 녹화된 이미지, 수집된 데이터, 통계 및 분석 정보를 사용자의 계정, 소셜 네트워크 사이트 등에 게시하도록 구성된다.다양한 실시예에서, 시스템은 골퍼 및/또는 동반한 강사에 의해 사용되는 모바일 장치에서 실행되는 모바일 장치 애플리케이션을 포함한다. 다른 예시적인 실시예에서, 시스템은 모바일 장치에서 실행되 는 웹 앱을 포함한다. 따라서 예시적인 실시예에서, 모바일 장치는 웹 앱 및/또는 모바일 장치 애플리케이 션을 사용하여 이미지 및 정보를 골퍼에게 디스플레이하도록 구성된다. 예시적인 실시예에서, 모바일 장치 애플 리케이션 또는 웹 앱은 다음의 전자 모듈/애플리케이션/코드 중 하나 이상을 포함한다: a. 클립-온 미니 카메라 장치로부터 전송된 이미지를 디스플레이하기 위한 코드, b. 온/오프 절환, 디지털 줌, 사진 촬영 등의 클립-온 미니 카메라 장치를 조작하기 위한 코드, c. 확대/축소, 슬로우 동작 재생, 고속 포워드 또는 백워드 재생, 모바일 장치 및/또는 서버에 각 프레임 또는 스트리밍 비디오 저장과 같은 클립-온 미니 카메라 장치에서 전송된 이미지를 처리하기 위한 코드, d. 클립-온 미니 카메라 장치 내의 다양한 센서로부터 수집된 데이터를 수신하여, 애플리케이션 서버 및/또는 클라우드 서버로 전송하기 위한 코드, e. 클립-온 미니 카메라 장치의 센서로부터 전송된 정보를 디스플레이하기 위한 코드, f. 퍼터 스트로크 동작과 공의 움직임을 분석하는데 필요한 정보에 대한 수동방식 입력 양식을 디스플레이하기 위한 코드, g. 비디오 이미지 프레임에 중첩된 테이블, 플롯 및/또는 그래픽 표현의 형태로 이미지 및 분석 정보를 디스플 레이하기 위한 코드, h. 클립-온 미니 카메라 장치와 애플리케이션 서버(또는 클라우드 서버) 사이에 송수신되거나, 애플리케이션 서버(또는 클라우드 서버)에 저장된 오디오 정보를 재생 및 녹음하기 위한 코드, i. 모바일 장치, 애플리케이션 서버 및 클라우드 서버 사이의 정보를 송수신하고, 관리하기 위 한 코드, j. 사용자 정보, 미니 카메라 장치의 이미지, 수집 데이터, 및 모바일 장치의 메모리 매체, 애플리케이션 서버, 클라우드 서버에 분석 정보를 저장 및 검색하기 위한 코드, k. 다수의 미니 카메라 모듈의 이미지를 디스플레이하기 위한 코드, l. 다수의 사용자가 다수의 인증된 모바일 장치에서, 이미지, 수집된 데이터, 통계, 분석 결과, 지침 등을 볼 수 있도록 하기 위한 코드, m. 프로필 정보, 퍼팅 스트로크 동작 데이터, 공 움직임 데이터, 분석, 지침, 머리 움직임 데이터, 관련 손의 위치 데이터, 관련 손의 그립 데이터 등을 포함하는 사용자 정보를 관리하는 회원 계정에 등록 및 로그인하기 위한 코드, n. 소셜 미디어 애플리케이션 프로그램 인터페이스를 사용하여 이미지, 오디오, 수집 데이터, 통계, 분석 결과, 지침 등을 공유하기 위한 코드, o. 소셜 미디어 애플리케이션 인터페이스를 사용하여 강사 또는 학생을 검색하기 위한 코드, p. 이미지, 오디오 및 이 둘의 조합으로 된 지침 정보를 사용자 계정에 게시하기 위한 코드, 및/또는 q. 미니 카메라 장치의 작은 움직임으로 인해 이미지가 흐려지는 현상을 보정하는 데 채택되는, 비디오 이미지 프레임을 안정화하기 위한 코드. 일 실시예에서, 도 14에 도시된 바와 같이(예를 들어, Golf Slope 제품의 디스플레이가 도 14에 도시됨), 모바 일 장치 앱은, 퍼팅 그린의 경사도 정보를 보여주는 3차원 증강현실 프레젠테이션과, 및 클립-온 미니 카 메라 장치와 그 안의 다양한 센서에 의해 획득된 데이터를 처리함으로써 주어진 퍼팅 스트로크에 대한 제안 된 예측 라인을 생성하기 위한 코드를 포함한다. 도 15는 클립-온 미니 카메라 장치와의 사용자의 상호작용의 기본 방법의 일 예시적인 실시예를 도시 한다. 이 예시적인 실시예에서, 골퍼와 동반 강사는 모두, 트레이닝 목적으로 골프 라운드를 나가서 골퍼 가 퍼팅 스트로크를 할 때의 정보를 얻는다. 이 예시적인 실시예에서, 골퍼는 클립-온 미니 카메라 장 치를 골퍼의 머리에 있는 모자에 클립하고, 조인트를 사용하여 탑-다운 뷰와 같은 임의의 원하는 관점 에서 카메라 뷰를 조정한다. 실시예에서, 골퍼 또는 강사는 모바일 장치 앱을 시작한다. 예시적인 실시예에서,골퍼 또는 강사는 클립-온 미니 카메라 장치를 온/오프 절환 한다. 예시적인 실시예에서 클립-온 미니 카메 라 장치는 모바일 장치 애플리케이션 인터페이스를 사용하여 온/오프 절환 할 수 있다. 예시적인 실시예에 서, 미니 카메라로부터의 이미지가 모바일 장치 스크린 상에 디스플레이 된다. 다른 예시적인 실시예에서, GPS 위치 및/또는 시간 정보가 또한 디스플레이 된다. 예시적인 실시예에서, 시스템은 현재 이미지를 녹화할지의 여부를 결정한다. 예시적인 일 실시예에서, 이미지 처리 알고리즘은 퍼팅 스트로크의 시작을 인식하여 골퍼의 스트로크 레코딩 개시를 트리거 한다. 예시적인 일 실시예에서, 미리 설정된 동작은 골퍼의 퍼팅 스트로크를 레코드하도록 트리거 한다. 다른 예시적인 실시예에서, 음성 명령은 골퍼의 퍼팅 스트로크를 레코드하도록 트리거 한다. 다른 예시적인 실시예에서, 모바 일 앱은 모바일 앱에서 실행되는 타이머에 기초하여 골퍼의 퍼팅 스트로크를 레코드하는 트리거를 기동 한 다. 다른 예시적인 실시예에서, 푸시 버튼 스위치는 푸시 버튼 스위치를 미리 누름으로써 타이머 기 능을 개시하는데 사용될 수 있다. 다른 예시적인 실시예에서, 수동 푸시 버튼 스위치는 모바일 앱 대 신에 또는 모바일 앱과 조합하여 골퍼의 퍼팅 스트로크를 레코드하도록 트리거를 기동할 수 있다. 예시적인 실시예에서, 시스템은 퍼팅 이미지의 레코드를 중지할 때를 결정한다. 이러한 결정은 예를 들어 이미 지 처리 알고리즘, 미리 설정된 동작, 음성 활성화 명령, 타이머 기능, 수동 스위치 또는 푸시 버튼으로, GPS 위치 정보 사용, 모바일 장치 앱 사용 및/또는 그와 같은 것을 사용하여 이루어질 수 있다. GPS 위치 정보와 관 련하여, 예시적인 실시예에서, 레코딩 시작/중지 동작은 골프 코스의 각 그린 영역의 경계와 같은 위치에 대한 가상경계(geofence)에 기초한다. 녹화된 이미지와 수집된 데이터는 모바일 장치 또는 애플리케이션 서버에서 처리된 다음, 분석 결과 가 생성된다. 분석 결과는 테이블 및/또는 플롯과 같은 데이터 시각화 형식 및 비디오 이미지 프레임에 증강 현 실 디스플레이의 형식으로 제공될 수 있다. 따라서, 예시적인 실시예에서, 시스템은 골퍼에게 이미지 처리 및 기계 학습에 기초한 임의의 이미지 및/또는 데이터를 디스플레이하고, 골퍼가 자신의 행동을 분석하는 것을 돕 도록 구성된다. 예시적인 실시예에서, 시스템은 하나 이상의 이미지에서 캡처된 객체(보정 또는 기준 객체)의 알려진 크기에 기 초하여 이미지 처리를 수행하도록 구성된다. 시스템은 이미지에서 보정 객체를 식별하도록 구성된다. 시스템은 객체의 크기를 측정하도록 구성된다(예를 들어, 물체의 직경(골프공의 직경) 측정, 물체의 길이(예를 들어, 퍼 터 헤드의 길이) 측정, 등). 예시적인 실시예에서, 시스템은 물체의 측정된 크기를 물체의 알려진 크기와 비교 하도록 구성된다. 이를 위해, 시스템은 데이터베이스에서 알려진 크기를 조회하거나, 알려진 크기가 시스템에 미리 프로그램되어 있을 수 있다. 예를 들어, 골프공의 크기는 직경이 42.67mm 인 것으로 알려져 있다. 비교는 이미지에 대한 스케일링 계수를 생성하는 데 사용될 수 있으며, 이 스케일링 계수는 이미지(들)의 다른 모든 측 정값이 실제 크기 측정값으로 변환될 수 있도록, 다른 모든 이미지 처리에 적용될 수 있다. 이러한 변환 또는 보정된 측정값에 기초하여, 시스템의 이미지 처리 알고리즘은 이미지에서 보이는 물체와 관련된 상대적 거리 및 각도를 결정하도록 구성될 수 있다. 예를 들어, 시스템은 골퍼의 토우가 골프 공으로부터 얼마나 멀리 떨어져 있는지, 골퍼의 스탠스 중심에서 골프 공으로부터 라인까지의 거리, 골퍼의 스탠스 너비, 몸에 대한 손의 위치, 퍼터에 대한 그립 위치, 및/또는 이와 유사한 것에 대한 이미지 처리를 사용하도록 구성될 수 있다. 모바일 장치는 분석 정보와 함께 이미지 및 수집된 매개변수를 그 자리에서(골프 게임 중, 실시간으로) 디 스플레이 한다. 따라서, 예시적인 실시예에서, 골퍼는 실시간으로 분석 정보를 사용할 수 있다. 이러한 분석 정 보는 이미지 및/또는 데이터에 대한 기계 학습 및/또는 인공지능 분석을 기반으로 빠르게 제공될 수 있다. 다른 예시적인 실시예에서, 골퍼와 강사는 정보를 함께 검토할 수 있고, 관련 지침이 논의된다. 그 결과, 골퍼 는 골프 코스에서 홀을 플레이하는 동안 및/또는 골프 라운드가 완료된 후에, 그 자리에서 강사로부터 임의 의 추가 피드백을 받을 수 있다. 이미지 및 동작 기반 매개변수 분석 외에도, 클립-온 미니 카메라 장치에서 GPS에 의해 획득된 특정 위치 정보는 골프 코스에서 퍼팅 그린의 특정 영역에서의 모든 단일 퍼팅 스트로크 동작에 링크될 수 있다. 골퍼(4 1)는 퍼팅 그린의 특정한 위치별로 직접적인 피드백을 얻는다. 퍼팅 스트로크가 각 퍼팅 그린의 특정 위치에서 고유한 것이기 때문에, 이 정보는 매우 큰 가치를 가질 수 있다. 오디오 녹음 기능을 사용하여 퍼팅 스트로크 동작마다 피드백을 현장에서 녹음할 수 있다. 골프 플레이어는 골프 트레이닝 라운드 후, 녹음된 오디오 정보를 재생하여, 리마인더 및 반복 학습 경험을 할 수 있다. 일 실시예에서, 골퍼는 스스로 골프 연습 라운드를 하고 이미지 및 기타 수집된 매개변수를 포함하는 데이 터를, 모바일 애플리케이션 인터페이스를 사용하여 원격에 있는 강사와 공유한다. 강사는 모바일 장치를 통해 녹화된 이미지, 수집된 데이터 및 분석 정보를 검토하고, 모바일 애플리케이션 인터페이스를 사용하여 골퍼와 피드백을 공유한다. 따라서, 골퍼는 골퍼와 골프 코스에 동행하지 않더라도, 골프 라 운드 중에 강사로부터 즉시 피드백을 받는다. 본 명세서에서는 골프 동작 및 퍼팅 스트로크 분석의 맥락에서 설명하지만, 본 개시 내용은 다른 골프 클럽(아 이언, 유틸리티 클럽, 페어 우드 및 퍼터 이외의 드라이버와의 동작)의 스윙 분석에도 적용되는 것이고, 야구 타격 스윙, 테니스 라켓 스윙, 폴로 스윙, 탁구 스트로크, 당구 스트로크 등과 같은 다른 스포츠의 스윙을 포함 하는 것으로 이해되어야 한다. 분석할 활동은, 각도 조절이 가능한 웨어러블 카메라와, 컴퓨터 비전, 기계 학습, 인공지능 알고리즘에 의해 동작 또는 활동의 오버헤드 뷰 이미지로 레코딩되어, 동작에 대한 이미지 처리 를 기반으로, 증강 현실 디스플레이에서 동작 및/또는 공의 움직임에 대한 분석을 제공할 수 있는 모든 활동일 수 있다. 또한, 동작이 고려되더라도, 단일 이미지와 정적 스탠스를 기반으로 분석할 수도 있다. 예를 들어, 분 석은 스트로크를 하기 전에 공을 어드레스 하는 스탠스 또는, 스트로크의 임의 지점에서의 스냅샷을 간단히 분 석할 수 있다. 물론, 고속 동작의 경우에 카메라는 대응하는 고속, 고해상도 카메라로 구성된다. 예시적인 실시예에서, 시스템은 태블릿과 같은 모바일 장치와 이미지 데이터를 수신하도록 구성된 웹 앱 또는 모바일 앱과 같은 코드를 포함하여, 표준 골프공의 알려진 크기를 기준으로 보정 없이, 퍼팅 스트로크의 오버헤 드 이미지와 관련된 상대적 크기, 거리, 각도를 처리하고, 퍼팅 스트로크의 증강 디스플레이를 생성한다. 예시적인 실시예: 예시적인 실시예에서, 미니 카메라 장치는, 모자 클립의 위치에 관계없이 퍼팅 스트로크의 오버헤드 뷰에 대해 미니 카메라가 수직으로부터 오프셋된 각도로 자동적으로 가리키도록 구성되는 조인트를 더 포함한다. 예시적인 실시예에서, 미니 카메라 장치는 광 빔을 생성하기 위한 빔 생성기를 더 포함하고, 여기서 광 빔은 가 시광선 또는 적외선일 수 있으며, 미니 카메라는 추가로 광 빔에 의해 생성된 스폿 광을 레코드 하게 구성된다. 예시적인 실시예에서, 미니 카메라 장치는 야간 투시 모듈을 더 포함하고, 상기 야간 투시 모듈은: a. 광의 밝기를 감지하게 구성된 센서, 및 b. 적외선 파장 범위의 광을 방출하도록 구성된 발광 다이오드(LED), 를 포함하며, 야간 투시 모드는 골퍼가 새벽, 초저녁 또는 황혼에 플레이할 때 사용자의 수동 선택, 광 감지 센 서 또는 사전 프로그래밍된 설정에 의해 온/오프 절환되고, 야간 투시 모드가 온(on)인 경우에는 적외선을 사용 하여 야간 투시 모드에서 이미지를 보고 레코드 한다. 예시적인 실시예에서, 미니 카메라 장치는 동작을 검출하도록 구성된 동작 검출 장치를 더 포함하고, 동작 검출 장치는 온/오프 절환, 이미지 녹화, 미리 프로그래밍된 동작에 따라 센서로부터 정보를 획득하는 동작을 구비한 미니 카메라 장치를 작동하도록 구성된다. 예시적인 실시예에서, 미니 카메라 장치는, 온/오프 절환, 이미지 녹화, 센서로부터 정보 획득 동작을 구비하는 미니 카메라 장치를 수동으로 작동하도록 구성된 스위치를 더 포함하고, 골퍼는 다른 사람이 작동할 수 없을 때 자신이 미니 카메라 장치를 수동으로 조작한다. 예시적인 실시예에서, 미니 카메라 장치는 다음 중 하나 또는 그 조합을 사용하여 관심 퍼팅 영역 상으로 빔을 방출하는 적어도 하나의 광원을 더 포함한다: a. 400 nm 내지 740 nm 범위의 가시 파장 레이저 다이오드 또는 LED(Light Emitting Diodes), b. 741 nm 내지 1800 nm 의 적외선 파장에 대한 레이저 다이오드 또는 LED(Light Emitting Diodes), 여기서 사용자는 다음 중 하나 또는 그 조합을 사용하여 광원을 온/오프 절환 한다. a. 미니 카메라 장치의 수동 스위치, b. 모바일 장치 애플리케이션. 예시적인 실시예에서, 미니 카메라 장치는, 자성 재료 및 비자성 재료 중 하나 이상의 사용을 통해 미니 카메라 장치의 상부에 볼 마커와 같은 골프 액세서리를 부착하도록 구성된 작은 베이스 플레이트를 더 포함한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16a 도면16b 도면16c 도면16d"}
{"patent_id": "10-2022-7030664", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는 유사한 참조 부호가 유사한 요소를 지칭하는 첨부 도면의 도면에서 제한적이지 않고, 예를 들어 기술 하는 방식으로 예시된다. 도 1은 골프 모자 클립에 부착된 예시적인 미니 카메라의 사시도이다. 도 2는 골프 모자 클립에 부착된 예시적인 미니 카메라의 저면도이다. 도 3은 예시적인 클립-온 미니 카메라 장치를 착용한 골퍼의 대각 측면도이다. 도 4는 미니 카메라의 각도를 조정함으로써 퍼팅 스트로크의 오버헤드 뷰를 캡처하는, 퍼팅 그린 상의 골프 공 을 조준하는 예시적인 클립-온 미니 카메라 장치를 착용한 골퍼의 측면도이다. 도 5는 퍼터 헤드, 골프 공, 골퍼의 손, 골퍼의 한 켤레 골프화 및 퍼팅 그린 표면을 보여주는, 예시적인 클립- 온 미니 카메라 장치로부터 촬영한 퍼팅 스트로크 동작의 오버헤드 뷰 이미지를 예시한 도면이다. 도 6은 퍼터 헤드의 각도 및 퍼터 헤드와 골프 공 사이의 임팩트 위치를 보여주는 퍼팅 스트로크 동작에 대한 분석의 예시적인 증강 디스플레이를 나타낸 도면이다. 도 7은 길이가 연장될 수 있는 예시적인 신축자재(telescopic) 장치를 예시한 도면이다. 도 8은 클립-온 미니 카메라 장치의 예시적인 실시예의 개략도이다. 도 9는 예시적인 클립-온 미니 카메라 장치에서 배터리를 재충전하기 위한 USB 포트를 도시한다. 도 10은 무선 신호를 통해, 모바일 장치에 연결된 예시적인 클립-온 미니 카메라 장치 및 서버 네트워크에 연결 된 모바일 장치를 도시한다. 도 11은 예시적인 박막 푸시 버튼 스위치를 도시한다.도 12는 정보를 저장하기 위한 예시적인 SD 카드 포트를 도시한다. 도 13은 예시적인 클립-온 미니 카메라 장치로부터 방출되고 퍼팅 스트로크 동작을 하는 동안 골퍼의 머리 조준 목표를 추적하는 적색 광점을 도시한다. 도 14는 계산된 퍼팅 그린의 경사의 예시적인 증강 디스플레이를 예시한다. 도 15는 시스템 사용 방법의 일례를 나타내는 흐름도이다. 도 16a 내지 도 16d는 스윙 동작 중 골퍼의 머리 움직임을 예시하기 위한 기준 스탠스 라인 및 스윙 동작 스탠 스 라인으로 퍼팅 스트로크의 단계를 도시한다."}
