{"patent_id": "10-2022-0161279", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0078771", "출원번호": "10-2022-0161279", "발명의 명칭": "EUV 설비 상태 진단 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "기완욱"}}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "EUV 설비 상태 진단 장치의 동작 방법에 있어서,복수의 센서들로부터 센서 데이터를 수집하는 단계;시방서로부터 도메인 지식 정보를 도출하는 단계;상기 센서 데이터 및 상기 도메인 지식 정보를 이용하여 초기 주요 센서를 도출하는 단계;상기 초기 주요 센서와 엔트로피를 이용하여 거동 특성이 유사한 센서들을 주요 센서로 도출하는 단계;상기 도메인 지식 정보를 참고하여 상기 주요 센서 외에 센서들을 결합함으로써 상기 주요 센서를 확장하는 단계;상기 확장된 주요 센서를 이용하여 설비 상태 진단 기준을 도출하는 단계; 및상기 설비 상태 진단 기준에 의거하여 EUV 설비 상태를 확인하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 주요 센서로 도출하는 단계는,상기 센서 데이터에서 중복, 결측, 혹은 반복된 데이터를 제거하는 단계; 및인지공학 알고리즘을 이용하여 상기 주요 센서를 도출하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 데이터를 제거하는 단계는,바이폴라 분포를 갖는 센서, 제로 분산 혹은 제로 근방 분산을 갖는 센서, 결정계수 값이 0.99 이상일 경우 1개를 제외한 나머지 센서, 혹은 다른 센서의 이용하여 재생산된 센서의 데이터를 제거하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 주요 센서로 도출하는 단계는,각 센서에 대한 센서 데이터와 정규 분포 사이에서 상대적인 엔트로피를 계산하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 주요 센서로 도출하는 단계는,기준 센서 데이터와 엔트로피 측면에서 거동 특성이 유사한 센서 집합을 확보하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 설비 상태 진단 기준을 도출하는 단계는,센서 집합으로부터 6개의 센서 조합을 만드는 단계; 및공개특허 10-2024-0078771-3-워킹 메모리를 생성하기 위하여 각각의 조합에 포함된 센서들의 상대적인 엔트로피를 우선순위에 따라 가중치를곱하는 단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 워킹 메모리는 0.00에서 0.20 까지의 값을 갖는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 설비 상태 진단 기준을 도출하는 단계는,6개의 워킹 메모리의 분포를 확률 질량 함수로 변환하는 단계; 및설비 상태 불안정성을 계산하기 위하여 상기 확률 질량 함수에 각 구간에서 확률 질량 함수의 변동 폭을 더하는단계를 더 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 EUV 설비 상태를 확인하는 단계는,동일한 설비의 2개 구간에서 추출한 센서 데이터를 이용하여 상기 설비 상태 불안정성을 계산할 경우, 특정 작업을 하기 전의 제 1 설비 상태 불안정성과 상기 특정 작업을 수행한 후의 제 1 설비 상태 불안정성을 비교하는단계를 포함하는 방법."}
{"patent_id": "10-2022-0161279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "EUV 설비 상태 진단 알고리즘을 저장하는 메모리 장치; 및상기 EUV 설비 상태 진단 알고리즘을 실행하는 프로세서를 포함하고,상기 EUV 설비 상태 진단 알고리즘은, 복수의 센서들로부터 센서 데이터를 수집하고; 시방서로부터 도메인 지식정보를 도출하고; 상기 센서 데이터 및 상기 도메인 지식 정보를 이용하여 초기 주요 센서를 도출하고; 상기 초기 주요 센서와 엔트로피를 이용하여 거동 특성이 유사한 센서들을 주요 센서로 도출하고; 상기 도메인 지식 정보를 참고하여 상기 주요 센서 외에 센서들을 결합함으로써 상기 주요 센서를 확장하고; 상기 확장된 주요 센서를 이용하여 설비 상태 진단 기준을 도출하고; 및 상기 설비 상태 진단 기준에 의거하여 EUV 설비 상태를 확인하도록, 상기 프로세서에서 실행되는 것을 특징으로 하는 컴퓨팅 장치."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 EUV 설비 상태 진단 장치의 동작 방법은, 복수의 센서들로부터 센서 데이터를 수집하는 단계, 시 방서로부터 도메인 지식 정보를 도출하는 단계, 상기 센서 데이터 및 상기 도메인 지식 정보를 이용하여 초기 주 요 센서를 도출하는 단계, 상기 초기 주요 센서와 엔트로피를 이용하여 거동 특성이 유사한 센서들을 주요 센서 로 도출하는 단계, 상기 도메인 지식 정보를 참고하여 상기 주요 센서 외에 센서들을 결합함으로써 상기 주요 센 서를 확장하는 단계, 상기 확장된 주요 센서를 이용하여 설비 상태 진단 기준을 도출하는 단계, 및 상기 설비 상 태 진단 기준에 의거하여 EUV 설비 상태를 확인 단계를 포함 수 있다."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 EUV 설비 상태 진단 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, LPP(Laser Produced Plasma) 방식의 EUV(Extreme Ultra-Violet) 설비는, 고출력 CO2 레이저를 주 석 드랍릿(tin droplet)에 집광함으로써 발생한 주석 플라즈마(tin plasma)로부터 EUV 광을 생성하고 있다. 주 석 드랍릿으로부터 생성된 EUV 광은 주석 드랍릿을 중심으로 사방으로 퍼져 나간다. 따라서, EUV 광을 반도체 노광 공정에 사용하기 위하여 EUV 광을 원하는 위치에 재집광(re-focusing)시켜주는 EUV 컬렉터(collector) 혹 은 반사경이 필수적이다. EUV 설비에서 EUV 컬렉터는 보통 재집광에 용이하도록 주석 드랍릿 주변에 위치하고 있다. 이에 주석 드랍릿이 기화 혹은 플라즈마화 되면서 생성되는 각종 부산물 혹은 플라즈마에 의해 EUV 컬렉 터의 표면이 오염될 수 있다. 표면이 오염된 EUV 컬렉터는 EUV 반사율을 떨어뜨려 EUV 설비의 생산성을 감소시"}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "키는 문제를 야기할 수 있다.발명의 내용"}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 반도체 설비의 결함 및 불안정 상태를 분류하는 EUV 설비 상태 진단 장치 및 방법을 제공하는 데 있다."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 동작 방법은, 복수의 센서들로부터 센서 데이터를 수집하 는 단계; 시방서로부터 도메인 지식 정보를 도출하는 단계; 상기 센서 데이터 및 상기 도메인 지식 정보를 이용 하여 초기 주요 센서를 도출하는 단계; 상기 초기 주요 센서와 엔트로피를 이용하여 거동 특성이 유사한 센서들 을 주요 센서로 도출하는 단계; 상기 도메인 지식 정보를 참고하여 상기 주요 센서 외에 센서들을 결합함으로써 상기 주요 센서를 확장하는 단계; 상기 확장된 주요 센서를 이용하여 설비 상태 진단 기준을 도출하는 단계; 및 상기 설비 상태 진단 기준에 의거하여 EUV 설비 상태를 확인 단계를 포함 수 있다. 실시 예에 있어서, 상기 주요 센서로 도출하는 단계는, 상기 센서 데이터에서 중복, 결측, 혹은 반복된 데이터 를 제거하는 단계; 및 인지공학 알고리즘을 이용하여 상기 주요 센서를 도출하는 단계를 포함할 수 있다. 실시 예에 있어서, 상기 데이터를 제거하는 단계는, 바이폴라 분포를 갖는 센서, 제로 분산 혹은 제로 근방 분 산을 갖는 센서, 결정계수 값이 0.99 이상일 경우 1개를 제외한 센서, 혹은 다른 센서의 이용하여 재생산된 센 서의 데이터를 제거하는 단계를 포함할 수 있다. 실시 예에 있어서, 상기 주요 센서로 도출하는 단계는, 각 센서에 대한 센서 데이터와 정규 분포 사이에서 상대 적인 엔트로피를 계산하는 단계를 포함할 수 있다. 실시 예에 있어서, 상기 주요 센서로 도출하는 단계는, 기준 센서 데이터와 엔트로피 측면에서 거동 특성이 유 사한 센서 집합을 확보하는 단계를 포함할 수 있다. 실시 예에 있어서, 상기 설비 상태 진단 기준을 도출하는 단계는, 센서 집합으로부터 6개의 센서 조합을 만드는 단계; 및 워킹 메모리를 생성하기 위하여 각각의 조합에 포함된 센서들의 상대적인 엔트로피를 우선순위에 따라 가중치를 곱하는 단계를 포함할 수 있다. 실시 예에 있어서, 상기 워킹 메모리는 0.00에서 0.20 까지의 값을 갖는 것을 특징으로 한다. 실시 예에 있어서, 상기 설비 상태 진단 기준을 도출하는 단계는, 6개의 워킹 메모리의 분포를 확률 질량 함수 로 변환하는 단계; 및 설비 상태 불안정성을 계산하기 위하여 상기 확률 질량 함수에 각 구간에서 확률 질량 함 수의 변동 폭을 더하는 단계를 더 포함할 수 있다. 실시 예에 있어서, 상기 EUV 설비 상태를 확인하는 단계는, 동일한 설비의 2개 구간에서 추출한 센서 데이터를 이용하여 상기 설비 상태 불안정성을 계산할 경우, 특정 작업을 하기 전의 제 1 설비 상태 불안정성과 상기 특 정 작업을 수행한 후의 제 1 설비 상태 불안정성을 비교하는 단계를 포함할 수 있다. 본 발명의 실시 예에 따른 컴퓨팅 장치는, EUV 설비 상태 진단 알고리즘을 저장하는 메모리 장치; 및 상기 EUV 설비 상태 진단 알고리즘을 실행하는 프로세서를 포함하고, 상기 EUV 설비 상태 진단 알고리즘은, 복수의 센서 들로부터 센서 데이터를 수집하고; 시방서로부터 도메인 지식 정보를 도출하고; 상기 센서 데이터 및 상기 도메 인 지식 정보를 이용하여 초기 주요 센서를 도출하고; 상기 초기 주요 센서와 엔트로피를 이용하여 거동 특성이 유사한 센서들을 주요 센서로 도출하고; 상기 도메인 지식 정보를 참고하여 상기 주요 센서 외에 센서들을 결합 함으로써 상기 주요 센서를 확장하고; 상기 확장된 주요 센서를 이용하여 설비 상태 진단 기준을 도출하고; 및 상기 설비 상태 진단 기준에 의거하여 EUV 설비 상태를 확인하도록, 상기 프로세서에서 실행되는 것을 특징으로 한다."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치 및 방법은, 거동 특성이 유사한 센서 집합에 대한 다변량 시계열 데이터의 엔트로피를 기반으로 설비 불안정 상태를 검출할 수 있다."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 도면들을 이용하여 본 발명의 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시 할 수 있을 정"}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "도로 본 발명의 내용을 명확하고 상세하게 기재할 것이다. 일반적으로 EUV(Extremely Ultra-Violet) 설비는, 노광에 필요한 극자외선 광원을 50kHz (1초에 50,000번) 주 기의 액상 주석 방울을 동일한 주기의 드라이브 레이저(Drive Laser)로 두 번 맞춰서 발생하는 플라즈마 (Plasma)를 통해서 생성하고 있다. 초당 50,000회를 27μm 직경의 주석 방울을 두 번이나 맞춰서 발생하는 플라 즈마에서 일정한 극 자외선 에너지를 출력하는 것은 매우 어렵다. 따라서 EUV 설비에서 노광 공정을 진행할 시, 설비의 상태를 계측하는 센서의 수는 5만 개가 넘는다. 이는 복잡 한 설비의 상태를 정확히 확인함으로써 공정에 악영향을 미치는 비정상 문제점을 찾고, 나아가 수율을 향상시키 기 위한 설비 운영 내 요소들을 찾아내기 위함이다. 현재는 단일 센서 데이터의 분석으로 EUV 설비의 정상 운영 을 기대하기는 힘든 상황이다. 예를 들어, EUV 설비의 컬렉터(Collector) 교체 시점에서의 파워 스펙은 300W지 만, 실제 양산 라인 내 설비들은 컬렉터를 교체함에도 불구하고 파워가 250W 부근에 머무르는 현상이 발생하고 있다. 최근에 단일 센서 데이터가 아닌 네트워크 학습(network learning) 기반의 인지 공학을 이용한 설비 상태 진단 알고리즘을 개발되고 있다. 종래의 설비들은 그 복잡도가 현저히 낮기 때문에 단일 센서 및 국부적인 부분의 기 계/소재 문제에서 설비의 상태를 확인할 수 있다. 하지만, 설비의 공정 난이도가 증가하고 제품에서 요구하는 스펙이 높아짐에 따라 기존 단일 센서 기반의 분석으로 EUV같은 복잡한 설비의 상태를 정확하기 파악하기 어렵 다. 이를 해결하기 위해 앵커(anchor)가 되는 주요 센서를 기준으로 연관성이 높은 센서들을 연결함으로써 네트워크 를 구성하고 정규분포 상 센서 값과의 위상 차이를 계산하여 엔트로피(entropy)라는 지표가 도출되고 있다. 이 러한 엔트로피를 이용하여 센서들 간 우선 순위에 따른 엔트로피 기하 평균값을 계산하는 대표 로직들을 개발함 으로써, 개별 설비에 최적화된 로직을 이용한 엔트로피 값들의 편차를 이용해 설비의 불안정성을 확인하는 방법 론이 개발되고 있다. 이러한 네트워크 학습 기법은 EUV 설비의 단일 센서로 파악하지 못했던 복잡한 설비들의 상태를 확인하여 설비가 불안정한 시기의 문제점들을 찾아내고 있다. 또한, 센서 데이터 확보가 가능한 EUV 설 비 외 다른 공정 설비에 적용이 가능하다. 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치 및 방법은, 라벨(label) 없는 시계열 데이터와 네트워크 학 습 방식으로 반도체 설비 결함 및 불안정 상태 분류할 수 있다. 이로써, 본 발명은 다변량 시계열 데이터의 불 확실성(entropy)을 기반으로 설비 불안정 상태를 검출할 수 있다. 일반적인 EUV 노광 설비의 상태 진단 방법은, 센서(sensor)의 반복되는 패턴을 기반으로 이상을 추정하고 있다. 하지만, EUV 노광 설비와 같이 복잡도가 높은 경우 각 센서 패턴으로 판단 불가능한 설비 불안정이 존재하다. 본 발명의 실시 예에 따른 EUV 노광 설비의 상태 진단 방법은 이상 검출을 위해 거동 특성이 유사한 센서 집합으로 정보 불확실성(Entropy)의 차이를 통하여 설비 상태 불안정을 검출할 수 있다. 도 1은 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 방법을 예시적으로 보여주는 흐름도이다. 도 1을 참조하면, EUV 설비 상태 진단 장치의 동작은 다음과 같이 진행될 수 있다. EUV 설비 상태 진단 장치는 EUV 설비의 복수의 센서들로부터 센서 데이터를 수집할 수 있다(S10). EUV 설비 상태 진단 장치는 문서로부터 도메인 지식 정보(Sensor Specification) 도출할 수 있다(S20). EUV 설비 상태 진단 장치는 주요 센서의 초기 씨드 키 인자들(Seed Key Factors; 다른 말로 초기 주요 센서들)를 도출할 수 있다(S30). 여기서 초기 씨드 키 인자들은 주요한 센서이다. EUV 설비 상태 진단 장치는 네트워크를 생성하기 위하여 인식 알고리즘을 실행함으 로써 엔트로피를 이용하여 거동 특성이 유사한 센서들을 확인할 수 있다(S40). 예를 들어, 정보 학습을 수행하 고, 엔트로피를 이용한 특징 정보를 찾고, 관련 씨드 키 인자들을 앵커 시킴으로써 네트워크가 구축될 수 있다. 이후에, EUV 설비 상태 진단 장치는 주요 센서를 확장할 수 있다. 주요 씨드 키 인자들(주요 센서) 외에 다른 센서들이 결합될 수 있다. 이후에 EUV 설비 상태 진단 장치는 주요 센서를 이용해 설비 상태 진단 기준(Working Memory)을 도출할 수 있다(S60). 즉, 결합된 센서들의 각각에 가중치가 부여될 수 있다. 여기서 설비 상태 진단 기준은 장비 위반 베이시스(basis)일 수 있다. 이후에, EUV 설비 상태 진단 장치는 설비 상태 확인할 수 있다 (S70). 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치는 5만여개의 초기 센서 데이터에서 중복, 결측, 반복된 데 이터를 제거한 후에, 인지공학 알고리즘을 사용하여 주요 센서를 기반으로 도메인 지식 정보를 참조 및 확장 시 킬 수 있다. 특정 설비의 주요 센서들이 확정된 이후의 과정은 데이터의 처리가 가능한 컴퓨터 혹은 기계장치에 의해 수행될 수 있다. 실시 예에 있어서, 각 센서에 대한 센서 데이터와 정규 분포 사이에서 상대적인 엔트로피 가 계산될 수 있다. 실시 예에 있어서, 기준 센서 데이터와 엔트로피 측면에서 거동 특성이 유사한 센서 집합이 확보될 수 있다. 실시 예에 있어서, 센서 집합으로부터 6개의 센서 조합을 만들고, 및 워킹 메모리를 생성하기 위하여 각각의 조합에 포함된 센서들의 상대적인 엔트로피를 우선순위에 따라 가중치를 곱함으로써 설비 상태 진단 기준이 도출될 수 있다. 실시 예에 있어서, 6개의 워킹 메모리의 분포를 확률 질량 함수로 변환하고 및 설 비 상태 불안정성을 계산하기 위하여 상기 확률 질량 함수에 각 구간에서 확률 질량 함수의 변동 폭을 더함으로 써, 설비 상태 불안정이 도출될 수 있다. 실시 예에 있어서, 동일한 설비의 2개 구간에서 추출한 센서 데이터를 이용하여 설비 상태 불안정성을 계산할 경우, 특정 작업을 하기 전의 제 1 설비 상태 불안정성과 상기 특정 작 업을 수행한 후의 제 1 설비 상태 불안정성이 비교될 수 있다. 도 2는 본 발명의 실시 예에 따른 설비 단계를 개념적으로 설명하는 도면이다. 도 2를 참조하면, 반도체 제품의 크기가 줄어들수록 반도체 노광 설비의 복잡도는 커지고 있다. 특히, EUV 광원을 사용한 반도체 노광 설비의 경 우, 제품 생산 과정 중 13.5nm의 빛을 직접적으로 사용하기 때문에 13.5nm보다 큰 파장의 빛의 사용하던 이전 세대의 노광 설비 대비 복잡도가 크다. 설비 복잡도의 상승은 생산과정에서 발생하는 문제 해결의 난이도를 상 승시키고 있다. 예를 들어, 엔지니어는 설비에 발생하는 문제를 1)센서를 통해 확인하고, 2)해당 센서와 연관된 개별 부품을 교체하는 등의 방법을 통해 문제를 해결하고 있다. 그런데 복잡도가 큰 설비의 경우, 문제를 야기 하는 센서를 특정하기 어려운 경우가 발생한다. 이는 설비 내 부품들의 교호작용으로 인한 emergent property에 의한 것으로 판단되고 있다. Emergent property는 설비가 3개 단계(설비-모듈-개별 부품)로 구성될 때, 개별 부 품/모듈 단계에서 확인할 수 없던 특성이 설비 단계에서 나타나는 것을 의미한다. 복잡도가 큰 설비일수록 emergent property가 발현될 가능성이 높다. 결론적으로 생산 설비의 상태를 판단하기 위해서 개별 부품 단계에서 측정되는 센서 데이터를 통해 직접적으로 문제를 해결하는 방법 외에 개별 부품의 교호작용으로 인해 발생하는 emergent property를 대변하는 설비 정보 를 통해 설비 상태를 판단하는 방법이 필요하다. 본 발명은 정보 이론(information theory)에서 사용하는 엔트 로피(entropy) 개념을 사용함으로써 설비 정보를 확보하고, 기존의 방법으로 판단하기 어려운 복잡한 설비의 상 태를 구분하게 한다. 도 3은 본 발명의 실시 예에 따른 설비 시계열 센서 데이터를 예시적으로 보여주는 도면이다. EUV 설비에서 생 성되는 센서(참고, 센서 이름은 \"S\" +\"숫자\"로 명명)는 시간에 따라 변동하지만, 단일 센서의 변동을 가지고 설 비 상태를 판단하는데 어려움이 있다. 본 발명의 EUV 설비 상태 진단 장치는 분석 대상 센서의 범위를 축소할 수 있다. 예를 들어, 다음과 같은 형태의 센서 데이터는 제거될 수 있다. 첫째, Bipolar distribution을 가지는 센서, 둘째, 제로 분산(Zero variance) 또는 제로 근방 분산(near-zero variance)를 가지는 센서, 셋째, R Square 값(결정계수로써 회귀 모델에서 독립 변수가 종속 변수를 얼만만큼 설명해 주는 지를 지시하는 지표)이0.99 이상일 경우 1개를 제외한 나머지 센서, 넷째, 다른 센서를 이용해 재생산된 센서(예를 들어, Sensor1 = 1/Sensor2)들이 있다. 도 4는 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치에서 상대적인 엔트로피를 계산하는 것을 보여주는 도면이다. 도 4에 도시된 바와 같이, 각 센서에 대하여 데이터가 기준값(예를 들어, 정규분포) 대비 얼마나 차 이가 있는지가 수치화 될 수 있다. 이로써, 상대적인 엔트로피(Relative Entropy; RE)가 계산될 수 있다. 예를 들어, 상대적인 엔트로피(RE)는 P(x)*log((P(x)/Q(x))로 계산될 수 있다. 여기서 P(x)는 x의 누적 분포 함수이 고, Q(x)는 TN의 누적 분포 함수이다. 여기서 TN는 x로서 정규 분포를 의미한다. 도 5는 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 네트워크 발생 과정을 예시적으로 보여주는 도면 이다. 도 5에 도시된 바와 같이, 기준 센서와 엔트로피 측면 거동 특성이 가장 유사한 센서 집합이 확보될 수 있다. 즉, 기준 데이터와 거동 특성이 유사한 센서 데이터가 선택될 수 있다. 상대적인 엔트로피(RE)와 초기 기준 센서 및 나머지 센서들이 입력 되고, 초기 기준 센서를 기준 센서들로 설정 하고, 기준 센서들의 각각의 상대적인 엔트로피(RE)는 기준 데이터로 설정될 수 있다. 이러한 기준 데이터와 가 장 유사한 거동 특성을 갖는 센서가 선택될 수 있다. 선택된 센서는 기준 센서들로 추가될 수 있다. (기준 데이 터*선택된 센서의 RE)1/2으로 기준 데이터가 새롭게 설정될 수 있다. 이러한 과정이 반복될 수 있다. 도 6는 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 설비 상태 계산 과정을 예시적으로 보여주는 도면 이다. 센서 집합(A0, S1, S2, S3, E1)으로부터 6개의 센서(Sensor) 조합 (예를 들어, 센서 조합 개수는 변동 가능)이 만들어질 수 있다. 예를 들어, (A0, S1, S2), (A0, S1, S3), (A0, S2, S3), (E1, A0, S1, S2), (E1, A0, S1, S3), (E1, A0, S2, S3)의 조합이 형성될 수 있다. 각각의 조합에 포함된 센서들의 상대적인 엔트로피를 우선순 위에 따라 가중치를 부여해서 곱함으로써, 워킹 메모리(Working memory)가 생성될 수 있다. 이렇게 생성된 6개 의 워킹 메모리는 최소 0.00부터 최대 0.20까지의 값을 가지게 된다. 6개의 워킹 메모리의 분포를 확률 질량 함 수(Probability Mass Function; PMF)로 변환하여, 각 구간에서 확률 질량 함수의 변동 폭을 더하면, 설비 상태 를 나타내는 불안정성이 계산될 수 있다. 도 7은 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 설비 상태를 예시적으로 비교한 도면이다. 도 7을 참조하면, 동일한 설비의 2개 기간에서 추출한 센서 데이터를 가지고 설비 상태 불안정성을 계산한 경우, 설비 에 특정 작업(예를 들어, 부품 교체)을 하기 전에 불안정성(제 1 설비 상태 불안정성)이 0.199로 높았다. 하지 만, 특정 작업 이후에 불안정성(제 2 설비 상태 불안정성)이 0.154로 낮아짐을 확인할 수 있다. 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치 및 방법은 종래 기술이 감지하지 못했던 복잡계(Complex System) 설비의 불안정성 확인할 수 있다. 또한, 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치 및 방법은, 종래 기술이 적용하지 못했던 네트워크 기반의 센서 데이터 분석 방법을 이용할 수 있다. 본 발명은 센 서 데이터가 존재하는 모든 설비에 적용이 가능하다. 또한, 본발명은 설비별 최적화 알고리즘 적용 가능하다. 본 발명은 초기 단계 이후에 기계적 방법으로 설비 상태 진단 자동화 가능하다. 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치 및 방법은 단순히 단일 센서 데이터에서 확인할 수 있는 허 용 범위 외 수치나 이상 패턴만이 아닌, 설비의 상태에 영향을 미치는 주요 센서들의 연결성을 통해서 센서들 간 거동의 편차를 통해 설비의 상태를 판단할 수 있다. 따라서, 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치 및 그것의 방법은 단일 센서 데이터 분석에서는 확인하지 못했던 복합 요인에 기인하는 설비 상태의 문제 점을 파악할 수 있다. 또한 본 발명은 연속된 시간 기준으로 발생되는 데이터와 단일 제품 생산 시 발생되는 데이터 모두 활용이 가능 하므로 다양한 공정을 순차적으로 수행하는 반도체 전 설비에 적합하다. 그리고 새로운 설비를 도입할 시 설비 의 도메인 정보와 센서 데이터 정보를 통한 주요 센서가 도출되면 기계적으로 설비 상태 진단이 가능하므로 추 가적인 공수 없이 유지보수가 용이하다. 본 발명은 EUV 설비 외 다른 공정 내 설비에서도 적용이 가능하다. 도 8은 본 발명의 실시 예에 따른 EUV 설비 상태 진단 알고리즘을 실행하는 컴퓨팅 장치를 예시적으로 보 여주는 도면이다. 도 8를 참조하면, 컴퓨팅 장치는 프로세서 및 메모리 장치를 포함할 수 있 다. 프로세서는 설비의 진단 상태를 점검하는 컴퓨팅 장치의 전반적인 동작을 제어하도록 구현될 수 있 다. 또한, 프로세서는 적어도 하나의 인스트럭션(instruction, 혹은 프로그램)을 실행하도록 구현될 수있다. 프로세서는 인스트럭션을 실행하고, 점검 주기를 컴퓨팅 장치를 제어할 수 있다. 실시 예에 있어서, 적어도 하나의 인스트럭션은, 인공지능(혹은, 머신 러닝)을 이용하여 설비 상태를 진단하기 위하여 설 비 점검 인공지능 알고리즘을 구동하도록, 적어도 하나의 프로세서에서 실행될 수 있다. 일반적으로 인공 지능을 구현하는 머신 러닝(machine learning)은, 크게 지도 학습(supervised learning), 비지도 학습 (unsupervised learning), 강화학습(reinforcement learning)으로 구분될 수 있다. 메모리 장치는 적어도 하나의 인스트럭션을 저장하도록 구현될 수 있다. 프로세서는 메모리 장치 에 저장된 적어도 하나의 인스트럭션이 적어도 하나의 프로세서에서 실행됨에 따라 앞서 언급된 동 작들을 수행할 수 있다. 실시 예에 있어서, 메모리 장치는 설비 상태 진단 알고리즘을 저장할 수 있다. 한편, 메모리 장치는 휘발성 메모리 혹은 비휘발성 메모리로 구현될 수 있다. 메모리 장치는 이용 자의 데이터를 저장하도록 저장 장치를 포함할 수 있다. 저장 장치는 eMMC(Embedded Multimedia Card), SSD(Solid State Drive), UFS(Universal Flash Storage) 등 일 수 있다. 저장 장치는 적어도 하나의 비휘발성 메모리 장치를 포함할 수 있다. 비휘발성 메모리 장치는, 낸드 플래시 메모리(NAND Flash Memory), 수직형 낸드 플래시 메모리(Vertical NAND; VNAND), 노아 플래시 메모리(NOR Flash Memory), 저항성 램(Resistive Random Access Memory: RRAM), 상변화 메모리(Phase-Change Memory: PRAM), 자기저항 메모리(Magnetoresistive Random Access Memory: MRAM), 강유전체 메모리(Ferroelectric Random Access Memory: FRAM), 스핀주입 자화반전 메모 리(Spin Transfer Torque Random Access Memory: STT-RAM) 등이 될 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/혹은 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시 예에서 설명된 장치 및 구성요소는, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 혹은 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 혹은 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접 근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명"}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 혹은 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로 세서 혹은 하나의 프로세서 및 하나의 제어기를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 혹은 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 혹은 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/혹은 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 혹은 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상장 치(virtual equipment), 컴퓨터 저장 매체 혹은 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연 결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다."}
{"patent_id": "10-2022-0161279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "한편, 상술된 본 발명의 내용은 발명을 실시하기 위한 구체적인 실시 예들에 불과하다. 본 발명은 구체적이고 실제로 이용할 수 있는 수단 자체뿐 아니라, 장차 기술로 활용할 수 있는 추상적이고 개념적인 아이디어인 기술 적 사상을 포함 할 것이다."}
{"patent_id": "10-2022-0161279", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하에 첨부되는 도면들은 본 실시 예에 관한 이해를 돕기 위한 것으로, 상세한 설명과 함께 실시 예들을 제공 한다. 도 1은 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 방법을 예시적으로 보여주는 흐름도이다. 도 2는 본 발명의 실시 예에 따른 설비 단계를 개념적으로 설명하는 도면이다. 도 3은 본 발명의 실시 예에 따른 설비 시계열 센서 데이터를 예시적으로 보여주는 도면이다. 도 4는 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치에서 상대적인 엔트로피를 계산하는 것을 보여주는 도면이다. 도 5는 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 네트워크 발생 과정을 예시적으로 보여주는 도면 이다. 도 6는 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 설비 상태 계산 과정을 예시적으로 보여주는 도면 이다. 도 7은 본 발명의 실시 예에 따른 EUV 설비 상태 진단 장치의 설비 상태를 예시적으로 비교한 도면이다. 도 8은 본 발명의 실시 예에 따른 설비 상태 진단 알고리즘을 실행하는 컴퓨팅 장치를 예시적으로 보여주 는 도면이다."}
