{"patent_id": "10-2022-0145704", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0064079", "출원번호": "10-2022-0145704", "발명의 명칭": "비전 인식 기반의 딥러닝 자동 학습 모델링 방법과, 이를 이용한 자동 정렬 기기 제어 시스템", "출원인": "주식회사 오픈시스넷", "발명자": "최성춘"}}
{"patent_id": "10-2022-0145704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "딥러닝 방식의 학습모델에 의해 기계 부품의 종류를 구분하여 이송하는 자동 정렬 기기; 및상기 자동 정렬 기기에 의해 이송된 기계 부품들을 수납하는 복수의 수납공간을 포함하는 부품 수납부; 를 포함하고, 상기 학습모델은 기계 부품을 촬영한 영상 정보에서 인식된 복수의 객체를 인공지능 모델 학습을 위한 학습 데이터를 자동으로구축하여 딥러닝 자동 학습을 수행하는 것; 을 특징으로 하는 비전 인식 기반의 딥러닝 자동 학습 모델을 이용한 자동 정렬 기기 제어 시스템."}
{"patent_id": "10-2022-0145704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 자동 정렬 기기는이송되는 기계 부품의 영상 정보를 생성하는 영상 정보 생성 모듈; 및 상기 학습모델과 기계 부품의 영상 정보를 비교하여 상기 기계 부품의 종류를 판단하는 판단 모듈;을 포함하는 비전 인식 기반의 딥러닝 자동 학습 모델을 이용한 자동 정렬 기기 제어 시스템."}
{"patent_id": "10-2022-0145704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 학습 데이터는상기 영상 정보에 포함된 기계부품의 크기와 각도와 타입과 X 좌표 및 Y좌표값 중 적어도 하나 이상을 포함하는것; 을 특징으로 하는 비전 인식 기반의 딥러닝 자동 학습 모델을 이용한 자동 정렬 기기 제어 시스템."}
{"patent_id": "10-2022-0145704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "기계 부품의 영상 정보를 생성하는 단계; 및 기계 부품의 영상 정보에 포함된 복수의 객체를 인식하여 딥러닝 자동 학습의 수행이 가능한 학습 모델을 구현하는 단계; 를 포함하고,상기 학습 모델은 상기 영상 정보에 포함된 기계부품의 크기와 각도와 타입과 X 좌표 및 Y좌표값 중 적어도 하나 이상을 포함하는학습 데이터로 구축되는 것; 을 특징으로 하는 비전 인식 기반의 딥러닝 자동 학습 모델링 방법."}
{"patent_id": "10-2022-0145704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "a)청구항 4의 학습모델을 자동 정렬 기기에 탑재 하는 단계; 및b)자동 정렬 기기에서 학습 모델을 이용하여 이송된 기계 부품을 분류 및 수납하는 단계; 를 포함하고,b)단계는상기 기계 부품의 영상 정보를 생성하는 단계; 상기 학습모델에 따라 상기 영상 정보에 포함된 복수의 객체를 인식 및 연산하는 단계; 및연산 결과에 따라 대상 기계 부품들을 분류하는 단계; 를 포함하는 비전 인식 기반의 딥러닝 자동 학습모델을이용한 자동 정렬 기기 제어 방법."}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "머신 비전을 이용하여 기계 부품을 판단하고, 판단 결과 해당 기계 부품에 대응하는 수납 공간에 이송시키는 비 전 인식 기반의 딥러닝 자동 학습 모델링 방법과, 이를 이용한 자동 정렬 기기 제어 시스템 및 방법이 개시된다. 본 발명은 기계 부품을 특정하고, 특정 결과를 이용하여 자동 정렬 기기가 해당 기계 부품을 수납 공간으로 이송 할 수 있도록 제어하는 효과가 있다."}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 자동 정렬 기기 제어 시스템 및 그 방법으로, 인공지능 인식을 이용하여 기계 부품을 판단하고 각도 를 계산한 후, 판단 결과에 따라 해당 기계 부품에 대응하는 수납공간에 이송시키는 비전 인식 기반의 딥러닝 자동 학습 모델링 방법과, 이를 이용한 자동 정렬 기기 제어 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정렬 로봇은 자동화 공급기 기능을 수행하는 로봇으로, 진동 정렬기 (Vibrator Feeder) 상에 놓인 부품을 인식 하고 일정한 방향으로 회전시켜 전용 트레이에 놓아 줌으로써 부품 조립 및 검사 등의 공장 자동화 작업을 수행 할 수 있도록 한다. 정렬 로봇이 동작하기 위해서는 부품 중앙 위치, 부품 면, 부품 각도를 인지해야 하며, 이를 위해서 일반적으로 비전 인식 기술이 사용되고 있다. 비전 인식 기술은 대표적으로 영상 분석 머신 비전 시스템을 적용하였고, 머신 비전 시스템은 카메라를 사용하 여 획득한 영상을 처리하여 의도하는 결과를 얻어내었다. 머신 비전 시스템은 기계에 시각을 부여하는 것으로, 사람에 의해 처리되던 다양한 일들을 자동화하여 기계가 처리하도록 할 수 있다. 따라서 머신 비전 시스템은 제 품의 불량 검사, 계수, 치수 측정, 바코드 인식, 문자인식 등 다양한 분야에서 활용되고 있다. 이러한 머신 비전 시스템과 관련하여, 대한민국 등록특허공보 제10-1190514호(2012.10.08. 등록)은 편광필름을 이용한 머신 비전 시스템을 개시하고 있다. 이와 같은 비전 인식 기술은 최근에 인공지능 기술이 적용되어 보다 널리 사용되고 있다. 하지만, 종래의 인공 지능 기술이 적용된 비전 인식 기술은 인공 지능 기술이 적용 시 다양한 부품에 대하여 학습 데이터를 구축하기 위한 시간 및 비용이 증가되는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1190514호(2012.10.08. 등록)"}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 이러한 문제점을 해결하기 위한 본 발명의 목적은 인공지능 기술을 적용 시에 학습 데이터를 확보하는 과정 및 시간을 절약할 수 있도록 비전 인식 기술을 통하여 학습 이미지 및 라벨을 자동으로 생성하고 해당 정 보를 기반으로 자동 모델 학습을 수행할 수 있는 비전 인식 기반의 딥러닝 자동 학습 모델링 방법을 제공함에 있다. 또한, 본 발명의 다른 목적은 비전 인식 기반의 인공지능 기술을 적용하여 기계 부품의 분류 및 수납을 보다 용 이하게 할 수 있는 비전 인식 기반의 딥러닝 자동 학습 모델을 이용한 자동 정렬 기기 제어 시스템 및 방법을 제공함에 있다."}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 기계 부품을 제공하는 진동 정렬부, 상기 기계 부품을 수납하는 수납 공간을 포함하는 부품 수납부 및 상기 진동 정렬부가 제공하는 상기 기계 부품의 종류를 판단하고, 판단 결과를 반영하여 상기 기계 부품을 상기 진동 정렬부에서 상기 기계 부품에 대응하는 상기 수납 공간으로 이송하는 자 동 정렬 기기를 포함하는 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 시스템을 제공한다. 상기 자동 정렬 기기는 상기 진동 정렬부가 제공하는 상기 기계 부품에 대한 영상 정보를 생성하는 영상 정보 생성 모듈을 포함할 수 있다.상기 자동 정렬 기기는 상기 기계 부품의 종류를 판단하는 판단 기준을 학습하는 기준 학습 모듈 및 상기 기준 학습 모듈이 학습한 상기 판단 기준을 이용하여, 상기 기계 부품의 종류를 판단하는 판단 모듈을 포함할 수 있 다. 또한, 상기 목적을 달성하기 위하여, 본 발명은 진동 정렬부가 기계 부품을 제공하는 단계, 자동 정렬 기기가 상기 진동 정렬부가 제공하는 상기 기계 부품의 종류를 판단하는 단계 및 상기 자동 정렬 기기가 판단 결과를 반영하여 상기 기계 부품을 상기 진동 정렬부에서 상기 기계 부품에 대응하는 수납 공간으로 이송하는 단계를 포함하는 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 방법을 제공한 다. 상기 진동 정렬부가 기계 부품을 제공하는 단계는 영상 정보 생성 모듈이 상기 진동 정렬부가 제공하는 상기 기 계 부품에 대한 영상 정보를 생성하는 단계를 포함할 수 있다. 상기 자동 정렬 기기가 상기 진동 정렬부가 제공하는 상기 기계 부품의 종류를 판단하는 단계는 기준 학습 모듈 이 상기 기계 부품의 종류를 판단하는 판단 기준을 학습하는 단계 및 판단 모듈이 상기 기준 학습 모듈이 학습 한 상기 판단 기준을 이용하여, 상기 기계 부품의 종류를 판단하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기에서 설명한 비전 인식 기반의 딥러닝 자동 학습 모델링 방법과, 이를 이용한 자동 정렬 기기 제어 시스템 및 방법에 의하면, 기계 부품의 위치, 크기, 각도, 타입 등을 고려하여 해당 기계 부품에 대한 학습 데이터 셋 을 구축하고, 구축한 학습 데이터 셋을 이용하여 딥러닝 모델 학습을 수행하고, 수행 결과 도출한 판단 기준을 이용해, 기계 부품을 특정하고, 특정 결과를 이용하여 자동 정렬 기기가 해당 기계 부품을 수납 공간으로 이송 할 수 있도록 제어하는 효과가 있다."}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정 해석되지 아니하며, 발명자 는 그 사용자의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 “포함”한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기 재된 “…부”, “…기”, “…단”, “모듈”, “장치” 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 및/또는 소프트웨어의 결합으로 구현될 수 있다. 본 발명의 실시 예에서 사용되는 용어에 대해 간략히 설명하고, 본 실시 예들에 대해 구체적으로 설명하기로 한 다. 본 발명의 실시 예에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 실시 예들의 설 명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 실시 예들에서 사용되는 용어는 단순한 용어의 명칭이아닌, 그 용어가 가지는 의미와 본 실시 예들의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 발명의 실시 예에서, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성 요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이 라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한 다. 또한, 본 발명의 실시 예에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한, 본 발명의 실시 예에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동 작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이 나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 또한, 본 발명의 실시 예에서, '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소 프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의'모듈' 혹은 복수의'부'는 특정한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일 체화되어 적어도 하나의 프로세서로 구현될 수 있다. 또한, 본 발명의 실시 예에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 이하, 본 발명의 실시 예를 첨부한 도면들을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예인 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 시스템의 개략적인 구성을 나타낸 도면이고, 도 2는 본 발명의 일 구성인 자동 정렬 기기의 개략적인 구성 을 나타낸 도면이며, 도 3은 본 발명의 일 구성인 부품 수납부의 개략적인 구성을 나타낸 도면이고, 도 4는 본 발명의 일 구성인 영상 정보 생성 모듈이 생성한 기계 부품에 대한 영상 정보를 나타낸 도면이고, 도 5는 본 발 명의 일 구성인 데이터 셋 구축 모듈이 데이터 셋 구축을 하는 방법을 설명하기 위한 도면이다. 도 1 내지 도 2를 참고하면, 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 시스템은 진동 정렬부, 부품 수납부, 자동 정렬 기기를 포함할 수 있고, 자동 정렬 기 기는 영상 정보 생성 모듈, 기준 학습 모듈, 판단 모듈, 데이터 셋 구축 모듈, 모델 경량화 모듈, 좌표 교정 모듈, 이송 모듈, 저장 모듈을 포함할 수 있다. 보다 구체적으로, 진동 정렬부는 기계 부품을 제공할 수 있다. 이러한 진동 정렬부는 기계 부품을 제공하는 트레이로 구현될 수 있다. 그리고 부품 수납부는 기계 부품을 수납하는 수납 공간을 포함할 수 있다. 여기서, 수납 공간의 크기는 대응하는 기계 부품의 크기에 상응하도록 설계될 수 있으며, 수납 공간은 복수로 구성될 수 있으며, 수납 공간의 형태는 특정 형태로 한정되지 않는다. 이러한 부품 수납부 및 수납 공간은 도 3을 참고하면 확인할 수 있다. 또한, 자동 정렬 기기는 진동 정렬부가 제공하는 기계 부품의 종류를 판단할 수 있고, 판단 결과를 반영하여 기계 부품을 진동 정렬부에서 기계 부품에 대응하는 수납 공간으로 이송할 수 있다. 그리고 자동 정렬 기기는 딥러닝 방식의 학습모델에 의해 기계 부품의 종류를 구분하여 이송할 수 있다. 여기서, 학습모델은 기계 부품을 촬영한 영상 정보에서 인식된 복수의 객체를 인공지능 모델 학습을 위한 학습 데이터를 자동으로 구축하여 딥러닝 자동 학습을 수행함으로써 구현될 수 있다. 또한, 여기서 학습 데이터는 영상 정보에 포함된 기계부품의 크기와 각도와 타입과 X 좌표 및 Y좌표값 중 적어 도 하나 이상을 포함할 수 있다. 보다 구체적으로, 영상 정보 생성 모듈은 진동 정렬부가 제공하는 기계 부품에 대한 영상 정보를 생 성할 수 있다. 그리고 영상 정보 생성 모듈은 이송되는 기계 부품의 영상 정보를 생성할 수 있다. 여기서, 영상 정보는 이미지 형식으로 구현될 수 있다. 또한, 영상 정보 생성 모듈은 진동 정렬부가 제공하는 기계 부품을 촬영할 수 있으며, 촬영 결과 영 상 정보를 생성할 수 있고, 영상 정보 생성 모듈이 생성한 기계 부품에 대한 영상 정보는 도 4를 통해 확 인할 수 있다. 그리고 기준 학습 모듈은 기계 부품의 종류를 판단하는 판단 기준을 학습할 수 있다. 보다 구체적으로, 기준 학습 모듈은 기계 부품의 종류를 판단하기 위하여, 영상 정보 생성 모듈이 생 성한 기계 부품에 대한 영상 정보를 분석할 수 있다. 그리고 기준 학습 모듈은 분석 결과, 진동 정렬부가 제공하는 기계 부품에 대한 영상 정보로부터 특 정 기계 부품에 대한 X축 좌표, Y축 좌표, 크기(가로 길이, 세로 길이), 각도, 종류를 확인할 수 있다. 여기서, 크기는 특정 기계 부품의 크기를 의미할 수 있으며, 각도는 특정 기계 부품이 진동 정렬부에 놓여 있는 각도를 의미할 수 있고, 종류는 특정 기계 부품의 종류를 의미할 수 있다. 그리고 데이터 셋 구축 모듈은 기준 학습 모듈이 분석한 분석 결과를 이용하여, 기준 학습 모듈(22 0)이 판단 기준을 학습할 수 있도록 하는 데이터 셋을 구축할 수 있다. 보다 구체적으로, 기준 학습 모듈은 영상 정보 생성 모듈이 생성한 영상 정보를 분석함으로써, 진동 정렬부가 제공하는 기계 부품에 대한 X축 좌표, Y축 좌표, 크기(가로 길이, 세로 길이), 각도, 종류를 확 인할 수 있다. 또한, 데이터 셋 구축 모듈은 기준 학습 모듈의 분석 결과, 확인할 수 있는 진동 정렬부가 제공 하는 기계 부품에 대한 X축 좌표, Y축 좌표, 크기(가로 길이, 세로 길이), 각도, 종류를 이용하여, 기준 학습 모듈이 판단 기준을 학습할 수 있도록 하는 데이터 셋을 구축할 수 있다. 그리고 도 5를 참고하면, 데이터 셋 구축 모듈은 기준 학습 모듈이 분석한 분석 결과를 통해, 진동 정렬부가 제공하는 기계 부품에 대한 영상 정보로부터 특정 기계 부품에 대한 X축 좌표, Y축 좌표, 크기 (가로 길이, 세로 길이), 각도, 종류에 대하여, 객체 식별자로서 클래스, 특정 기계 부품의 X축 좌표 및 Y축 좌 표, 특정 기계 부품의 가로 길이 및 세로 길이에 대하여 딥러닝 프레임워크가 인식할 수 있도록 이미지 및 라벨 을 생성할 수 있다. 즉, 데이터 셋 구축 모듈이 생성한 이미지 및 라벨은 데이터 셋으로서 기준 학습 모듈이 판단 기준 에 대한 딥러닝 모델 학습을 수행할 수 있다. 또한, 저장 모듈은 데이터 셋 구축 모듈이 생성한 이미지 및 라벨을 저장할 수 있다. 그리고 저장 모듈은 데이터 셋 구축 모듈이 구축한 데이터 셋을 저장할 수 있다. 또한, 저장 모듈은 기준 학습 모듈이 학습할 수 있는 기계 부품의 종류를 판단하는 판단 기준을 저장 할 수 있다. 그리고 기준 학습 모듈은 데이터 셋 구축 모듈이 구축한 데이터 셋을 이용하여 판단 기준에 대한 딥 러닝 모델 학습을 수행할 수 있다. 또한, 모델 경량화 모듈은 기준 학습 모듈이 수행하는 딥러닝 모델 학습의 과정에 대한 지식 증류를 수행할 수 있다. 보다 구체적으로, 모델 경량화 모듈은 저장 모듈이 저장한 기준 학습 모듈이 학습할 수 있는 기 계 부품의 종류를 판단하는 판단 기준을 대상으로 지식 증류(Knowledge Distillation)를 수행할 수 있다. 또한, 저장 모듈은 모델 경량화 모듈이 지식 증류를 수행한 판단 기준을 저장할 수 있다. 이를 통해 이송 모듈은 기계 부품을 이송하는 과정에서 사용될 수 있는 판단 기준을 지식 증류가 수행되기 전의 무거운 알고리듬이 아닌 지식 증류가 수행된 가벼운 알고리듬으로 설정하여 이송을 수행할 수 있으며, 이 는 이송 수행의 정확성 및 인식성 향상을 도모할 수 있도록 도와줄 수 있다.그리고 이송 모듈은 판단 기준을 이용하여, 진동 정렬부가 제공하는 기계 부품을 부품 수납부로 이송할 수 있다. 또한, 부품 수납부은 자동 정렬 기기에 의해 이송된 기계 부품들을 수납하는 복수의 수납공간을 포함 할 수 있다. 이러한 이송 모듈은 기계 부품을 흡착함으로써, 진동 정렬부에서 부품 수납부로 이송할 수 있으 며, 이송 방법은 제한되지 않는다. 보다 구체적으로, 이송 모듈은 판단 기준을 지식 증류가 수행되기 전의 무거운 알고리듬으로 설정하여 기 계 부품을 진동 정렬부에서 부품 수납부로 이송할 수 있다. 또한, 이송 모듈은 판단 기준을 지식 증류가 수행된 가벼운 알고리듬으로 설정하여 기계 부품을 진동 정렬 부에서 부품 수납부로 이송할 수 있다. 이는 관리자의 설정에 따라 선택할 수 있다. 그리고 이송 모듈은 저장 모듈이 저장하고 있는 부품 수납부의 수납 공간에 대한 정보를 이용하 여, 해당 수납 공간에 대응하도록 기계 부품을 회전시킨 뒤, 진동 정렬부에서 부품 수납부로 이송할 수 있다. 또한, 이송 모듈은 수납 공간에 대응하도록 기계 부품을 회전시키는 과정에서, 기준 학습 모듈이 확 인한 진동 정렬부가 제공하는 기계 부품에 대한 X축 좌표, Y축 좌표, 크기(가로 길이, 세로 길이), 각도, 종류를 이용할 수 있다. 그리고 좌표 교정 모듈은 이송 모듈이 특정 기계 부품을 이송하는 과정에서 발생할 수 있는 진동 정 렬부에 남아있는 기존 기계 부품의 위치 변경을 확인할 수 있고, 이를 통해 기준 학습 모듈이 분석한 결과, 진동 정렬부가 제공하는 기계 부품에 대한 영상 정보로부터 특정 기계 부품에 대한 확인할 수 있는 X축 좌표, Y축 좌표를 교정할 수 있다. 그리고 좌표 교정 모듈은 교정된 특정 기계 부품의 X축 좌표, Y축 좌표를 이송 모듈, 판단 모듈 및 저장 모듈 중 적어도 하나로 송신할 수 있다. 또한, 저장 모듈은 좌표 교정 모듈로부터 수신한 교정된 특정 기계 부품의 X축 좌표, Y축 좌표를 저 장할 수 있다. 그리고 판단 모듈은 좌표 교정 모듈로부터 수신한 교정된 특정 기계 부품의 X축 좌표, Y축 좌표를 이 용하여, 해당 위치에 있는 기계 부품의 종류를 판단할 수 있다. 그리고 판단 모듈은 학습모델과 기계 부품의 영상 정보를 비교하여 기계 부품의 종류를 판단할 수 있다. 이를 통해 이송 모듈의 이송 과정에서 이송하는 기계 부품이 아닌 진동 정렬부에서 제공하는 기계 부 품의 위치가 변경되더라도 변경된 위치를 빠르게 교정함으로써, 이후 이송 모듈의 기계 부품 이송의 정확 도를 유지할 수 있는 효과가 있다. 또한, 판단 모듈은 기준 학습 모듈이 학습한 판단 기준을 이용하여, 기계 부품의 종류를 판단할 수 있다. 보다 구체적으로, 판단 모듈은 판단 기준을 지식 증류가 수행되기 전의 무거운 알고리듬으로 설정하여 기 계 부품의 크기(가로 길이, 세로 길이), 각도, 종류를 판단할 수 있으며, 판단 모듈은 판단 기준을 지식 증류가 수행된 가벼운 알고리듬으로 설정하여 기계 부품의 크기(가로 길이, 세로 길이), 각도, 종류를 판단할 수 있다. 그리고 판단 모듈은 저장 모듈이 저장하고 있는 부품 수납부의 수납 공간에 대한 정보를 이용하 여, 이송 모듈이 진동 정렬부에서 부품 수납부의 수납 공간으로 기계 부품을 이송한 것이 정확 한 이송인지 여부를 판단할 수 있다. 또한, 판단 모듈은 이송 모듈의 이송이 정확한지 여부를 판단하여, 해당 내용을 기준 학습 모듈(22 0)로 송신할 수 있다. 그리고 기준 학습 모듈은 판단 모듈로부터 수신한 이송 모듈의 이송이 정확한지 여부에 대한 판 단 결과를 이용하여 학습한 판단 기준을 갱신할 수 있다. 이러한 과정을 통해 이송 모듈이 진동 정렬부로부터 제공 받은 기계 부품을 부품 수납부의 수납 공간으로 이송하는 과정에서 발생하는 다양한 정보를 이용하여 기준 학습 모듈은 판단 기준 학습의 정확도 및 인식도를 향상시킬 수 있는 효과가 있다. 도 6은 본 발명의 일 실시예인 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 방법의 개략적인 흐름을 나타낸 도면이다. 도 6을 참고하면, 진동 정렬부가 기계 부품을 제공할 수 있다.(S630) 또한, 영상 정보 생성 모듈은 진동 정렬부가 제공하는 기계 부품에 대한 영상 정보를 생성할 수 있다. 그리고 자동 정렬 기기는 진동 정렬부가 제공하는 기계 부품의 종류를 판단할 수 있다.(S631) 또한, 기준 학습 모듈은 기계 부품의 종류를 판단하는 판단 기준을 학습할 수 있다. 그리고 판단 모듈은 기준 학습 모듈이 학습한 판단 기준을 이용하여, 기계 부품의 종류를 판단할 수 있다. 또한, 자동 정렬 기기는 판단 결과를 반영하여 기계 부품을 진동 정렬부에서 기계 부품에 대응하는 수납 공간으로 이송할 수 있다.(S632) 보다 구체적으로, 비전 인식 기반의 딥러닝 자동 학습 모델링 방법은 기계 부품의 영상 정보를 생성할 수 있다. 그리고 기계 부품의 영상 정보에 포함된 복수의 객체를 인식하여 딥러닝 자동 학습의 수행이 가능한 학습 모델 을 구현할 수 있다. 또한, 여기서, 학습 모델은 영상 정보에 포함된 기계부품의 크기와 각도와 타입과 X 좌표 및 Y좌표값 중 적어도 하나 이상을 포함하는 학습 데이터로 구축될 수 있다. 그리고 비전 인식 기반의 딥러닝 자동 학습모델을 이용한 자동 정렬기기 제어 방법은 명세서 전체에서 설명한 학습 모델을 자동 정렬 기기에 탑재할 수 있다. 또한, 자동 정렬 기기에서 학습 모델을 이용하여 이송된 기계 부품을 분류 및 수납할 수 있다. 그리고 여기서, 기계 부품의 영상 정보를 생성할 수 있다. 또한, 학습 모델에 따라 영상 정보에 포함된 복수의 객체를 인식 및 연산할 수 있다. 그리고 연산 결과에 따라 대상 기계 부품들을 분류할 수 있다. 상기와 같이 본 발명의 실시 예에 따른 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 시스템 및 그 방법의 구성 및 동작이 이루어질 수 있으며, 한편 상기 본 발명의 설명에서는 구 체적인 실시 예에 관해 설명하였으나 여러 가지 변형이 본 발명의 범위를 벗어나지 않고 실시될 수 있다. 이상에서 본 발명은 비록 한정된 실시 예와 도면에 의해 설명되었으나, 본 발명은 이것에 의해 한정되지 않으며"}
{"patent_id": "10-2022-0145704", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 수정 및 변형이 가능함은 물론이다. 본 실시 예와 관련된 기술 분야에서 통상의 지식을 가진 자는 상기된 기재의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로 개시 방법들은 한정적인 관점이 아 니라 설명적인 관점에서 고려되어야 한다. 본 발명의 범위는 전술한 설명이 아니라 특허청구범위에 나타나 있으 며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0145704", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예인 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 시스템의 개략적인 구성을 나타낸 도면이다. 도 2는 본 발명의 일 구성인 자동 정렬 기기의 개략적인 구성을 나타낸 도면이다. 도 3은 본 발명의 일 구성인 부품 수납부의 개략적인 구성을 나타낸 도면이다. 도 4는 본 발명의 일 구성인 영상 정보 생성 모듈이 생성한 기계 부품에 대한 영상 정보를 나타낸 도면이다. 도 5는 본 발명의 일 구성인 데이터 셋 구축 모듈이 데이터 셋 구축을 하는 방법을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예인 비전 인식 기반 자동 딥러닝 학습 데이터 생성 및 학습을 이용한 자동 정렬 기기 제어 방법의 개략적인 흐름을 나타낸 도면이다."}
