{"patent_id": "10-2023-0022104", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0129644", "출원번호": "10-2023-0022104", "발명의 명칭": "AR VR 체험 전용버스 시스템", "출원인": "유한회사 브이아이피에어버스", "발명자": "이명호"}}
{"patent_id": "10-2023-0022104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "좌석, 천장면, 창문 및 승하차문을 포함하는 버스(Bus);적어도 하나의 프로세서, 메모리 및 상기 천장면의 일부 또는 전체에 구비되어 콘텐츠를 표시하는 천장 스크린을 포함하는 천장 스크린 장치;적어도 하나의 프로세서, 메모리 및 상기 창문과 승하차문의 일부 또는 전체에 구비되어 콘텐츠를 표시하는 문스크린을 포함하는 문 스크린 장치;적어도 하나의 프로세서, 메모리 및 상기 좌석의 일측에 구비되어 콘텐츠를 표시하는 좌석 스크린을 포함하는좌석 스크린 장치;상기 버스(Bus) 일측에 구비되어 GPS 기반으로 상기 버스(Bus)의 현재위치정보를 획득하는 위치정보 획득부; 및증강현실 기반의 AR 콘텐츠를 AR 데이터베이스에 저장하고, 인공지능 기술기반으로 상기 현재위치정보에 기초하여 AR 콘텐츠를 추천하는 콘텐츠 제공서버;를 포함하고,상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나는, 상기 콘텐츠 제공서버로부터제공된 어플리케이션이 설치됨으로써, 인터넷 네트워크를 기반으로 상기 AR 콘텐츠를 전송받아 천장 스크린, 문스크린 및 좌석 스크린 중 적어도 하나에 표시하는 것을 특징으로 하는 AR VR 체험 전용버스 시스템."}
{"patent_id": "10-2023-0022104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 콘텐츠 제공서버는,가상현실 기반의 VR 콘텐츠를 VR 데이터베이스에 저장하고, 인공지능 기술기반으로 상기 현재위치정보에 기초하여 상기 VR 콘텐츠를 추천하고,상기 천장 스크린 장치, 상기 문 스크린 장치 및 상기 좌석 스크린 장치 내 적어도 하나의 프로세서는,상기 AR 콘텐츠를 렌더링(Rendering) 하는 AR 렌더링부; 및각 장치 중 하나에 VR 기기 또는 XR 기기가 유선 또는 무선으로 연결되면 재생우선순위에 따라 VR 콘텐츠를 압축하여 재생하는 VR 재생부;를 포함하는 것을 특징으로 하는 AR VR 체험 전용버스 시스템."}
{"patent_id": "10-2023-0022104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 콘텐츠 제공서버는,인터넷 네트워크를 통해서 연결된 관리자 단말로부터 AR 콘텐츠와 VR 콘텐츠 중 적어도 하나가 가공될 수 있도록 3차원 모델링 저작도구를 제공하고, 가공된 AR 콘텐츠와 VR 콘텐츠 중 적어도 하나를 임의의 파일형식으로생성하는 콘텐츠 가공부;상기 관리자 단말로부터 AR 콘텐츠에 대한 AR 콘텐츠 위치정보와 AR 콘텐츠 시간정보와, VR 콘텐츠에 대한 VR콘텐츠 위치정보와 VR 콘텐츠 시간정보를 획득하는 콘텐츠 정보 획득부;상기 AR 콘텐츠 위치정보와 AR 콘텐츠 시간정보를 AR 콘텐츠에 매핑(Mapping)하여 저장하는 AR 데이터베이스;및상기 VR 콘텐츠 위치정보와 VR 콘텐츠 시간정보를 VR 콘텐츠에 매핑(Mapping)하여 저장하는 VR 데이터베이스;를포함하는 것을 특징으로 하는 AR VR 체험 전용버스 시스템.공개특허 10-2024-0129644-3-청구항 4 제3 항에 있어서,상기 콘텐츠 제공서버는,외부 서버로부터 현재시간정보를 획득하는 현재시간정보 획득부;를 더 포함함으로써, 인공지능 기술기반으로 상기 현재시간정보에 기초하여 AR 콘텐츠와 VR 콘텐츠 중 적어도 하나를 추천하는 것을특징으로 하는 AR VR 체험 전용버스 시스템."}
{"patent_id": "10-2023-0022104", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,버튼 형식 또는 레버 형식으로 상기 버스(Bus) 일측에 구비되어 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나를 동시에 또는 개별적으로 제어하는 제어부;를 포함하는 것을 특징으로 하는 ARVR 체험 전용버스 시스템."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 AR VR 체험 전용버스 시스템에 관한 것으로, 보다 구체적으로 좌석, 천장면, 창문 및 승하차문을 포함 하는 버스(Bus), 적어도 하나의 프로세서, 메모리 및 상기 천장면의 일부 또는 전체에 구비되어 콘텐츠를 표시하 는 천장 스크린을 포함하는 천장 스크린 장치, 적어도 하나의 프로세서, 메모리 및 상기 창문과 승하차문의 일부 (뒷면에 계속)"}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AR VR 체험 전용버스 시스템에 관한 것으로, 보다 구체적으로 버스 내에서 AR VR 기술기반으로 다양 한 콘텐츠를 제공할 수 있는 AR VR 체험 전용버스 시스템에 관한 것이다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "버스(Bus)는 여러 사람을 태울 수 있는 대형 승합자동차로, 정류장 마다 정차하는 마을버스 및 시내버스, 지역 간 이동하는 고속버스, 시외버스 및 관광버스 등 종류가 다양하면서 가장 보급 비중이 높은 대중교통수단이다. 외부는 직육면체 형상으로 구비되고, 직육면체의 옆면은 대부분 창문과 승하차문으로 구성되어 있다. 내부는 사 람들이 앉을 수 있는 다수 개의 의자, 사람들이 넘어지지 않도록 파지하는 다수 개의 손잡이, 사람들이 일측에 서 타측으로 이동할 수 있도록 구비된 공간인 통로로 구성되어 있다. 메타버스(Metaverse)는 현실에서의 상호작용을 가상공간에 구현한 여러 가지 형태나 콘텐츠를 통칭한다. 메타버 스는 가상의 공간을 구현하고 이를 넘어서서 사용자의 오감에 직접적으로 작용하여 실제에 근접한 공간적, 시간 적인 체험을 가능하게 하는 가상현실(Virtual Reality; VR), 현실 세계에 가상의 정보를 덧씌우는 증강현실 (Augmented Reality; AR), 가상현실(VR)과 증상 현실(AR)을 아우른 혼합 현실, 증강 가상을 포함할 수 있다. 최근에는 메타버스를 다양한 장소 및 분야에 활용하고 있다. 예컨대, 관련문헌 1과 같이 메타버스 기술로 고인 의 장례를 온라인으로 진행할 수 있도록 하거나, 관련문헌 2와 같이 메타버스 기술로 해양 양식장을 임대하여 가상으로 해삼을 기르는 해삼 양식장 체험이 가능하도록 한다. 대중교통은 시민들이 가장 많이 사용하는 대중교통수단이므로, 대중교통 분야에서도 마찬가지로 메타버스를 이 용하여 이동하는 동안 다양한 콘텐츠를 제공할 수 있는 기술이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허문헌 제10-2491285호 (특허문헌 0002) 대한민국 등록특허문헌 제10-2486494호"}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 사람들이 가장 많이 사용하고 접근하기 용이한 버스 (Bus) 교통수단에서 메타버스 형식의 다양한 콘텐츠를 제공할 수 있도록 버스(Bus) 내 천장 스크린 장치, 문 스 크린 장치 및 좌석 스크린 장치를 포함하고, 인공지능 기술기반으로 버스(Bus)의 현재위치정보에 기초하여 AR 콘텐츠와 VR 콘텐츠를 추천하고, 각 장치를 통해서 콘텐츠를 표시하는 AR VR 체험 전용버스 시스템을 얻고자 하 는 것을 목적으로 한다. 본 발명이 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 본 발명의 기재로부터 당해 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 AR VR 체험 전용버스 시스템은 좌석, 천장면, 창문 및 승하차문을 포 함하는 버스(Bus); 적어도 하나의 프로세서, 메모리 및 상기 천장면의 일부 또는 전체에 구비되어 콘텐츠를 표 시하는 천장 스크린을 포함하는 천장 스크린 장치; 적어도 하나의 프로세서, 메모리 및 상기 창문과 승하차문의 일부 또는 전체에 구비되어 콘텐츠를 표시하는 문 스크린을 포함하는 문 스크린 장치; 적어도 하나의 프로세서, 메모리 및 상기 좌석의 일측에 구비되어 콘텐츠를 표시하는 좌석 스크린을 포함하는 좌석 스크린 장치; 상기 버 스(Bus) 일측에 구비되어 GPS 기반으로 상기 버스(Bus)의 현재위치정보를 획득하는 위치정보 획득부; 및 증강현 실 기반의 AR 콘텐츠를 AR 데이터베이스에 저장하고, 인공지능 기술기반으로 상기 현재위치정보에 기초하여 AR 콘텐츠를 추천하는 콘텐츠 제공서버;를 제공한다. 또한, 본 발명의 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나는, 상기 콘텐츠 제공서버로부터 제공된 어플리케이션이 설치됨으로써, 인터넷 네트워크를 기반으로 상기 AR 콘텐츠를 전송받아 천장 스크린, 문 스크린 및 좌석 스크린 중 적어도 하나에 표시하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면 버스(Bus) 내 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치를 포함하 고, 인공지능 기술기반으로 버스(Bus)의 현재위치정보에 기초하여 AR 콘텐츠와 VR 콘텐츠를 추천하고, 각 장치 를 통해서 콘텐츠를 표시함으로써, 사람들이 가장 많이 사용하고 접근하기 용이한 버스(Bus) 교통수단에서 메타 버스 형식의 다양한 콘텐츠를 제공할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 상세한 설명 및 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 다르게 정의되지 않는 한 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반 적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 도 1은 AR VR 체험 전용버스 시스템의 구성도이다. 도 2는 본 발명의 일실시예에 따른 버스(Bus) 내부 전면도이다. 도 3은 본 발명의 일실시예에 따른 버스(Bus) 내부 후면도이다. 도 4는 본 발명의 일실시예에 따른 AR VR 체험 전용버스 시 스템의 증강현실(AR) 콘텐츠의 가공, 저장 및 추천 서비스를 제공하기 위한 흐름도이다. 도 5는 본 발명의 일실 시예에 따른 AR VR 체험 전용버스 시스템의 가상현실(VR) 콘텐츠의 가공, 저장 및 추천 서비스를 제공하기 위한 흐름도이다. 도 1 내지 도 3을 보면, 본 발명의 AR VR 체험 전용버스 시스템은 좌석, 천장면, 창문 및 승하 차문을 포함하는 버스(Bus), 적어도 하나의 프로세서, 메모리 및 상기 천장면의 일부 또는 전체에 구비되어 콘텐츠를 표시하는 천장 스크린을 포함하는 천장 스크린 장치, 적어도 하나의 프로세서, 메모리 및 상기 창문과 승하차문의 일부 또는 전체에 구비되어 콘텐츠를 표시하 는 문 스크린을 포함하는 문 스크린 장치, 적어도 하나의 프로세서, 메모리 및 상기 좌석 의 일측에 구비되어 콘텐츠를 표시하는 좌석 스크린을 포함하는 좌석 스크린 장치, 상기 버스 (Bus) 일측에 구비되어 GPS 기반으로 상기 버스(Bus)의 현재위치정보를 획득하는 위치정보 획득부 및 증강현실 기반의 AR 콘텐츠를 AR 데이터베이스에 저장하고, 인공지능 기술기반으로 상기 현재위 치정보에 기초하여 AR 콘텐츠를 추천하는 콘텐츠 제공서버를 포함하고, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나는, 상기 콘텐츠 제공서버로부터 제공된 어플 리케이션이 설치됨으로써, 인터넷 네트워크를 기반으로 상기 AR 콘텐츠를 전송받아 천장 스크린, 문 스크 린 및 좌석 스크린 중 적어도 하나에 표시하는 것을 특징으로 한다. 보다 구체적으로, 상기 버스(Bus)는 교통수단으로써, 많은 사람들을 공간에 태우고 이동하여 목적지에 내 려주게 되는데 운송 목적 등이 상이할 수 있다. 특정 목적으로 사용되는 것에 한정되지 않는다. 상기 버스 (Bus)는 출발지에서 목적지까지 이동하는 이동 상태이거나, 한 곳에 정차되어 있는 정차 상태일 수 있다. 그리고 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 안드로이드(Android) 및 IOS 등 운영체제가 설치될 수 있고, 인터넷 네트워크를 통해서 통신 가능하고, 운영체제 형식에 따른 어플리케 이션 설치가 가능하고, 어플리케이션을 통해서 제공된 제어신호에 따라 제어되고, 각 스크린을 통해서 콘텐츠를 표시할 수 있다. 즉, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 각각이 하 나의 컴퓨터일 수 있다. 한편, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 관리자 단말과 통신 가능하도록 연결되어 관리자 단말을 통해서 제어되거나, 각 스크린(230, 330, 430)이 사용자의 외력을 인 식하는 터치스크린 형식으로 구비되어 사용자의 입력에 따라 제어될 수 있다. 특히나, 상기 문 스크린 장치는 상기 버스(Bus)가 이동하는 상태라면 운전자가 외부를 살펴야 함으로 창은 반드시 투명 상태여야 하고, 상기 버스(Bus)가 정차하고 있는 상태라면 운전자가 외부를 살필 필요가 없고, 보다 몰입감 있는 콘텐츠를 제공하기 위해서 외부환경이 보이지 않도록 할 필요가 있다. 따라서 상기 문 스크린 장치는 투명에서 불투명으로 전환되거나 불투명에서 투명으로 전환되는 것을 특징으로 한다. 또한, 상기 문 스크린 장치는 투명 상태에서도 상기 AR 콘텐츠가 선명하게 표시될 수 있도록 특수도료가 시공되 거나, 특수재질로 제조되는 것을 특징으로 한다. 다음으로, 상기 위치정보 획득부는 GPS 인공위성과 통신하면서 현재 지구상에서 상기 버스(Bus)의 위치를 경도와 위도를 포함하는 현재위치정보를 제공받아 획득할 수 있다. 그리고 상기 위치정보 획득부는 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나와 통신 가능하도록 연 결되어 실시간으로 현재위치정보를 전송함으로써, 각 장치에 설치된 어플리케이션 상에서 활용될 수 있도록 한 다. 다음으로, 상기 콘텐츠 제공서버는 증강현실 기반의 AR 콘텐츠를 AR 데이터베이스에 저장하고, 인공 지능 기술기반으로 상기 현재위치정보에 기초하여 AR 콘텐츠를 추천한다. 그러면, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나는, 상기 콘텐츠 제공서버로부터 제공된 어 플리케이션이 설치됨으로써, 인터넷 네트워크를 기반으로 상기 AR 콘텐츠를 전송받아 천장 스크린, 문 스 크린 및 좌석 스크린 중 적어도 하나에 표시하는 것을 특징으로 한다.본 발명에서 언급하는 증강현실 기반의 AR 콘텐츠는 해당지역의 지자체에서 홍보하고자 하는 관광자원 등에 대 한 지역홍보영상, 특정 대상자를 타겟으로 정보를 제공하거나 교육하는 교육 영상, 명상 영상, 자연환경 영상, 체험 영상 등일 수 있고, 특정 분야의 영상에 한정되지 않는다. 그리고 상기 AR 콘텐츠는 QR코드, 3차원의 배경, 3차원의 아이템, 3차원의 아바타 등이 현실에 오버랩(Overlap) 되어 표시될 수 있다. 또한, 상기 AR 콘텐츠는 상기 천장 스크린 장치에만 개별적으로 표시될 수 있고, 일부 또는 전체에서 표시 될 수 있다. 또는, 상기 문 스크린 장치에만 개별적으로 표시될 수 있고, 일부 또는 전체에서 표시될 수 있다. 또는, 상기 좌석 스크린 장치에만 개별적으로 표시될 수 있고, 일부 또는 전체에서 표시될 수 있다. 또는, 상기 천장 스크린 장치, 상기 문 스크린 장치 및 상기 좌석 스크린 장치 중 적어도 하나 에 표시될 수 있다. 또는, 상기 AR 콘텐츠는 상기 천장 스크린, 문 스크린 및 좌석 스크린에 확 장되어 마치 하나의 큰 화면을 보는 것과 같이 표시될 수 있다. 즉, 상기 AR 콘텐츠는 특정 방식에 한정되어 각 스크린(230, 330, 430)에 표시되는 것이 아니다. 또한, 본 발명은 버튼 형식 또는 레버 형식으로 상기 버스(Bus) 일측에 구비되어 상기 천장 스크린 장치 , 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나를 동시에 또는 개별적으로 제어하는 제 어부를 포함하는 것을 특징으로 한다. 즉, 상기 제어부는 각 장치(200, 300, 400)를 운전자, 통솔자, 관리자 등에 의하여 수동으로 조작할 수 있도록 구비되는 것이다. 따라서 인터넷 네트워크가 잘 동작되지 않아 상기 관리자 단말을 통해서 제어하지 못하는 상태에서도 물리적으로 수동적으로 각 장치(200, 300, 400)의 스크린 표시 동작을 제어할 수 있는 현저한 효과가 있다. 따라서 본 발명은 사람들이 가장 많이 사용하고, 접하기 용이한 버스(Bus)라는 교통수단에서 증강현실 기 술로 구현된 AR 콘텐츠를 입체적으로 현실감 있게 제공할 수 있는 현저한 효과가 있다. 다음으로, AR 콘텐츠뿐만 아니라 VR 콘텐츠를 제공하기 위해서 상기 콘텐츠 제공서버는, 가상현실 기반의 VR 콘텐츠를 VR 데이터베이스에 저장하고, 인공지능 기술기반으로 상기 현재위치정보에 기초하여 상기 VR 콘텐츠를 추천할 수 있다. 또한, AR 콘텐츠와 VR 콘텐츠를 각 장치(200, 300, 400)를 통해서 표시될 수 있도록 상기 천장 스크린 장치 , 상기 문 스크린 장치 및 상기 좌석 스크린 장치 내 적어도 하나의 프로세서(210, 310, 410)는, 상기 AR 콘텐츠를 렌더링(Rendering) 하는 AR 렌더링부(211, 311, 411) 및 각 장치 중 하나에 VR 기기 또는 XR 기기가 유선 또는 무선으로 연결되면 재생우선순위에 따라 VR 콘텐츠를 압축하여 재생하 는 VR 재생부(212, 312, 412)를 포함하는 것을 특징으로 한다. 한편, 상기 천장 스크린 장치, 상기 문 스크린 장치 및 상기 좌석 스크린 장치 중 적어도 하나 에는 VR 기기 또는 XR 기기를 유선 연결할 수 있는 연결단자를 포함하거나 인터넷 네트워크, 와이 파이, 블루투스 등 무선 통신 방식으로 연결할 수 있다. 그러면, 연결된 장치는 각 스크린(230, 330, 430)으로 VR 콘텐츠를 표시하는 것이 아닌, VR 기기 또는 XR 기기로 VR 콘텐츠를 표시할 수 있다. 다음으로, AR 콘텐츠와 VR 콘텐츠를 가공 및 저장하기 위해서 상기 콘텐츠 제공서버는, 인터넷 네트워크를 통해서 연결된 관리자 단말로부터 AR 콘텐츠와 VR 콘텐츠 중 적어도 하나가 가공될 수 있도록 3차원 모델 링 저작도구를 제공하고, 가공된 AR 콘텐츠와 VR 콘텐츠 중 적어도 하나를 임의의 파일형식으로 생성하는 콘텐 츠 가공부, 상기 관리자 단말로부터 AR 콘텐츠에 대한 AR 콘텐츠 위치정보와 AR 콘텐츠 시간정보와, VR 콘텐츠에 대한 VR 콘텐츠 위치정보와 VR 콘텐츠 시간정보를 획득하는 콘텐츠 정보 획득부, 상기 AR 콘 텐츠 위치정보와 AR 콘텐츠 시간정보를 AR 콘텐츠에 매핑(Mapping)하여 저장하는 AR 데이터베이스 및 상기 VR 콘텐츠 위치정보와 VR 콘텐츠 시간정보를 VR 콘텐츠에 매핑(Mapping)하여 저장하는 VR 데이터베이스를 포함하는 것을 특징으로 한다. 또한, 상기 콘텐츠 제공서버는, 외부 서버로부터 현재시간정보를 획득하는 현재시간정보 획득부(75 0)를 더 포함함으로써, 인공지능 기술기반으로 상기 현재시간정보에 기초하여 AR 콘텐츠와 VR 콘텐츠 중 적어도 하나를 추천하는 것을 특징으로 한다. 즉, 상기 콘텐츠 제공서버는, 상기 위치정보 획득부로부터 획득한 현재위치정보와 상기 현재시간정보 획득부로부터 획득한 현재시간정보 중 적어도 하나를 기 학습된 신경망 네트워크를 갖는 AR 콘텐츠 추천모 델에 입력함으로써, 상기 AR 데이터베이스로부터 저장된 다수 개의 AR 콘텐츠 중 하나의 AR 콘텐츠를 출력 할 수 있다. 또는, 상기 콘텐츠 제공서버는, 상기 위치정보 획득부로부터 획득한 현재위치정보와 상 기 현재시간정보 획득부로부터 획득한 현재시간정보 중 적어도 하나를 기 학습된 신경망 네트워크를 갖는VR 콘텐츠 추천모델에 입력함으로써, 상기 VR 데이터베이스로부터 저장된 다수 개의 VR 콘텐츠 중 하나의 VR 콘텐츠를 출력할 수 있다. AR 콘텐츠 가공, 저장 및 추천 서비스 제공과정 도 4의 일실시예를 보면, 우선 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 인터넷 네트워크와 연결된 상태에서 상기 콘텐츠 제공서버로부터 제공된 어플리케이션이 설치될 수 있다. 관리자 단말도 마찬가지로 어플리케이션이 설치될 수 있다. 여기서, 관리자는 AR 콘텐츠를 가공하는 사람, 버스(Bus)를 관리하는 사람, 본 발명의 시스템 자체를 관리하는 사람, AR 콘텐츠를 본 발명의 시스템으로 표시하고자 하는 사람 등일 수 있다. 다음으로, 상기 콘텐츠 제공서버 내 콘텐츠 가공부는 어플리케이션 기반으로 3차원 모델링 저작도구 를 제공할 수 있다. 그러면, 상기 관리자 단말은 3차원 모델링 저작도구를 이용하여 3차원의 아이템, 아바 타 등을 제작하기 위한 입력신호를 전송할 수 있다. 상기 콘텐츠 제공서버는 3차원 모델링 저작도구를 이 용한 AR 콘텐츠를 임의의 파일 형식으로 최종적으로 생성할 수 있다. 예컨대, apk 확장자를 갖는 파일일 수 있 다. 그리고 상기 콘텐츠 제공서버 내 콘텐츠 정보 획득부는 상기 관리자 단말에 해당 AR 콘텐츠에 대한 AR 콘텐츠 위치정보와 AR 콘텐츠 시간정보를 입력할 수 있도록 양식을 제공할 수 있다. 그러면, 상기 관리 자 단말은 해당 양식에 따라 AR 콘텐츠 위치정보와 AR 콘텐츠 시간정보를 입력한 후 전송할 수 있다. 예컨 대, 별이 쏟아지는 AR 콘텐츠라면 천문대 A의 주소와 같은 위치정보가 입력될 수 있고, 22:00과 같은 시간정보 가 입력될 수 있다. 상기 콘텐츠 제공서버 내 AR 데이터베이스는 AR 콘텐츠 위치정보와 AR 콘텐츠 시 간정보를 매핑하여 저장할 수 있다. 다음으로, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 버스(Bus) 일측 에 구비된 위치정보 획득부로부터 버스(Bus)의 현재위치정보를 실시간으로 획득할 수 있다. 각 장치 (200, 300, 400)는 인터넷 네트워크를 통해서 현재위치정보를 콘텐츠 제공서버에 전송할 수 있고, 콘텐츠 제공서버는 현재위치정보를 획득할 수 있다. 다음으로, 상기 콘텐츠 제공서버는 AR 콘텐츠를 추천하는 시점의 현재시간을 확인할 수 있도록 외부 서버 로부터 현재시간정보를 획득할 수 있다. 상기 외부 서버는 Open API 기반으로 해당 지역의 실시간 시 간을 제공할 수 있다. 다음으로, 상기 콘텐츠 제공서버는 현재위치정보와 현재시간정보를 AR 콘텐츠 추천모델에 입력함으로써, AR 데이터베이스에 저장된 수많은 AR 콘텐츠 중에서 버스(Bus)의 위치와 추천시점에 가장 적합한 AR 콘텐츠를 출력할 수 있다. 출력되는 AR 콘텐츠는 하나 이상일 수 있고, 특정 숫자에 한정되지 않는 것이 가장 바람직하다. 또한, 상기 콘텐츠 제공서버는 기 학습된 AR 콘텐츠 추천모델일 수 있고, 현재위치정보와 현 재시간정보 중 적어도 하나를 입력변수로 한다. 그리고 상기 콘텐츠 제공서버는 어플리케이션 상에 출력된 AR 콘텐츠를 제공할 수 있다. 다음으로, 상기 관리자 단말은 각 장치(200, 300, 400)에 제어신호를 전송할 수 있다. 이때, 언급하는 제 어신호는 어떤 장치를 이용하여 어떻게 AR 콘텐츠를 표시할지에 대한 신호이다. 예컨대, 별이 쏟아지는 AR 콘텐 츠는 상기 천장 스크린 장치에서 표시되었을 때 가장 효과적일 것임으로, 상기 관리자 단말은 상기 천장 스크린 장치만 AR 콘텐츠를 표시할 수 있도록 어플리케이션 상에서 제어신호를 생성 및 전송할 수 있 다. 다음으로, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 내 천장 AR 렌더링부 , 문 AR 렌더링부 및 좌석 AR 렌더링부는 상기 콘텐츠 제공서버로부터 제공받은 AR 콘텐츠 를 렌더링(Rendering)할 수 있다. 본 발명에서 언급하는 렌더링은 3차원 화상을 만드는 과정으로, 구체적으로 각 장치(200, 300, 400)에서 끊김 없이 용이하게 표시될 수 있도록 AR 콘텐츠 내 구현되어야 하는 렌더링우선순 위에 따라 압축할 수 있다. 상기 렌더링우선순위는 AR 콘텐츠 가공 당시에 상기 관리자 단말 또는 상기 콘 텐츠 제공서버로부터 기 설정될 수 있다. 마지막으로, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나에 렌더링된 AR 콘텐츠가 표시될 수 있다. 따라서 본 발명은 AR 콘텐츠를 가공, 저장 및 추천하는 서비스 제공할수 있고, 이에 따라 가장 접하기 쉬운 교통수단인 버스에서 다수의 사람들이 보다 입체적이고 현실감 있는 다양 한 콘텐츠를 접할 수 있는 현저한 효과가 있다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "VR 콘텐츠 가공, 저장 및 추천 서비스 제공과정 도 5의 일실시예를 보면, 우선 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 인터넷 네트워크와 연결된 상태에서 상기 콘텐츠 제공서버로부터 제공된 어플리케이션이 설치될 수 있다. 관리자 단말도 마찬가지로 어플리케이션이 설치될 수 있다. 여기서, 관리자는 VR 콘텐츠를 가공하는 사람, 버스(Bus)를 관리하는 사람, 본 발명의 시스템 자체를 관리하는 사람, VR 콘텐츠를 본 발명의 시스템으로 표시하고자 하는 사람 등일 수 있다. 그리고 상기 XR 기기 및/또는 VR 기기는 상기 천장 스크린 장 치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나와 연결단자를 통해서 유선으로 연결되 거나, 인터넷 네트워크, 와이파이 및 블루투스 등의 무선연결 방식으로 연결될 수 있다. 이는, 가상현실을 표시 하기 위해서는 일반적인 스크린이 아닌, 보다 몰입감을 줄 수 있는 VR 스크린을 구비하는 장치가 별도로 필요하 기 때문이다. 다음으로, 상기 콘텐츠 제공서버 내 콘텐츠 가공부는 어플리케이션 기반으로 3차원 모델링 저작도구 를 제공할 수 있다. 그러면, 상기 관리자 단말은 3차원 모델링 저작도구를 이용하여 3차원의 아이템, 아바 타 등을 제작하기 위한 입력신호를 전송할 수 있다. 상기 콘텐츠 제공서버는 3차원 모델링 저작도구를 이 용한 VR 콘텐츠를 임의의 파일 형식으로 최종적으로 생성할 수 있다. 예컨대, apk 확장자를 갖는 파일일 수 있 다. 그리고 상기 콘텐츠 제공서버 내 콘텐츠 정보 획득부는 상기 관리자 단말에 해당 VR 콘텐츠에 대한 VR 콘텐츠 위치정보와 VR 콘텐츠 시간정보를 입력할 수 있도록 양식을 제공할 수 있다. 그러면, 상기 관리 자 단말은 해당 양식에 따라 VR 콘텐츠 위치정보와 VR 콘텐츠 시간정보를 입력한 후 전송할 수 있다. 예컨 대, 별이 쏟아지는 VR 콘텐츠라면 천문대 A의 주소와 같은 위치정보가 입력될 수 있고, 22:00과 같은 시간정보 가 입력될 수 있다. 상기 콘텐츠 제공서버 내 VR 데이터베이스는 VR 콘텐츠 위치정보와 VR 콘텐츠 시 간정보를 매핑하여 저장할 수 있다. 다음으로, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치는 버스(Bus) 일측 에 구비된 위치정보 획득부로부터 버스(Bus)의 현재위치정보를 실시간으로 획득할 수 있다. 각 장치 (200, 300, 400)는 인터넷 네트워크를 통해서 현재위치정보를 콘텐츠 제공서버에 전송할 수 있고, 콘텐츠 제공서버는 현재위치정보를 획득할 수 있다. 다음으로, 상기 콘텐츠 제공서버는 AR 콘텐츠를 추천하는 시점의 현재시간을 확인할 수 있도록 외부 서버 로부터 현재시간정보를 획득할 수 있다. 상기 외부 서버는 Open API 기반으로 해당 지역의 실시간 시 간을 제공할 수 있다. 다음으로, 상기 콘텐츠 제공서버는 현재위치정보와 현재시간정보를 VR 콘텐츠 추천모델에 입력함으로써, VR 데이터베이스에 저장된 수많은 VR 콘텐츠 중에서 버스(Bus)의 위치와 추천시점에 가장 적합한 VR 콘텐츠를 출력할 수 있다. 출력되는 VR 콘텐츠는 하나 이상일 수 있고, 특정 숫자에 한정되지 않는 것이 가장 바람직하다. 또한, 상기 콘텐츠 제공서버는 기 학습된 VR 콘텐츠 추천모델일 수 있고, 현재위치정보와 현 재시간정보 중 적어도 하나를 입력변수로 한다. 그리고 상기 콘텐츠 제공서버는 어플리케이션 상에 출력된 VR 콘텐츠를 제공할 수 있다. 다음으로, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 내 천장 VR 재생부 , 문 VR 재생부 및 좌석 VR 재생부는 상기 콘텐츠 제공서버로부터 제공받은 VR 콘텐츠를 재생할 수 있다. 각 VR 재생부(212, 312, 412)는 구체적으로 VR 기기 및/또는 XR 기기에서 끊김 없이 용이하게 표시될 수 있도록 VR 콘텐츠 내 구현되어야 하는 재생우선순위에 따라 압축할 수 있다. 상기 재 생우선순위는 VR 콘텐츠 가공 당시에 상기 관리자 단말 또는 상기 콘텐츠 제공서버로부터 기 설정될 수 있다. 마지막으로, 상기 천장 스크린 장치, 문 스크린 장치 및 좌석 스크린 장치 중 적어도 하나에 연결된 상기 VR 기기 및/또는 XR 기기는 압축 재생가능한 VR 콘텐츠를 전송받아 표시할 수 있다. 따라서 본 발명은 VR 콘텐츠를 가공, 저장 및 추천하는 서비스 제공할 수 있고, 이에 따라 가장 접하기 쉬운 교 통수단인 버스에서 다수의 사람들이 보다 입체적이고 현실감 있는 다양한 콘텐츠를 접할 수 있는 현저한 효과가있다. 실시예들은 하드웨어, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 기술 언어, 또는 이들의 임의의 조합에 의해 구현될 수 있다. 소프트웨어, 펌웨어, 미들웨어 또는 마이크로코드로 구현되는 경우, 필요한 작업 을 수행하는 프로그램 코드 또는 코드 세그먼트들은 컴퓨터 판독 가능 저장 매체에 저장되고 하나 이상의 프로 세서에 의해 실행될 수 있다. 그리고 본 명세서에 설명된 주제의 양태들은 컴퓨터에 의해 실행되는 프로그램 모듈 또는 컴포넌트와 같은 컴퓨 터 실행 가능 명령어들의 일반적인 맥락에서 설명될 수 있다. 일반적으로, 프로그램 모듈 또는 컴포넌트들은 특 정 작업을 수행하거나 특정 데이터 형식을 구현하는 루틴, 프로그램, 객체, 데이터 구조를 포함한다. 본 명세서 에 설명된 주제의 양태들은 통신 네트워크를 통해 링크되는 원격 처리 디바이스들에 의해 작업들이 수행되는 분 산 컴퓨팅 환경들에서 실시될 수도 있다. 분산 컴퓨팅 환경에서, 프로그램 모듈들은 메모리 저장 디바이스들을 포함하는 로컬 및 원격 컴퓨터 저장 매체에 둘 다에 위치할 수 있다."}
{"patent_id": "10-2023-0022104", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 으로 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달 성될 수 있다. 그러므로 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0022104", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 AR VR 체험 전용버스 시스템의 구성도이다. 도 2는 본 발명의 일실시예에 따른 버스(Bus) 내부 전면도이다. 도 3은 본 발명의 일실시예에 따른 버스(Bus) 내부 후면도이다. 도 4는 본 발명의 일실시예에 따른 AR VR 체험 전용버스 시스템의 증강현실(AR) 콘텐츠의 가공, 저장 및 추천 서비스를 제공하기 위한 흐름도이다. 도 5는 본 발명의 일실시예에 따른 AR VR 체험 전용버스 시스템의 가상현실(VR) 콘텐츠의 가공, 저장 및 추천 서비스를 제공하기 위한 흐름도이다."}
