{"patent_id": "10-2023-0010654", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0118936", "출원번호": "10-2023-0010654", "발명의 명칭": "실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템", "출원인": "호남대학교 산학협력단", "발명자": "정연철"}}
{"patent_id": "10-2023-0010654", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실내 자전거의 페달에 구비된 제1 센서부와, 상기 실내 자전거를 이용하는 사용자가 착용하는 웨어러블 기기에구비된 제2 센서부와, 상기 제1 센서부 및 제2 센서부에 연결되어 상기 제1 센서부 및 제2 센서부에 의하여 감지된 운동 데이터를 분석하여 사용자에게 제공하는 운동 서버를 포함하는 운동데이터 분석시스템이고,상기 운동 데이터를 기반으로 운동 분석 리포트와 5단계의 심박 구간 샘플링 가이드 정보를 생성하고,BMR(Basal Metabolic Rate) 및 MHR(Maximum Heart Rate) 추정값을 연산하며, 상기 생성 결과 및 연산 결과를이용하여 사용자에게 딥러닝 기반 추천 모델을 제공하는 것을 특징으로 하는 실내자전거를 사용하여 운동하는사용자를 위한 운동데이터 분석시스템."}
{"patent_id": "10-2023-0010654", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 센서부는 케이던스 센서를 포함하고,상기 제2 센서부는 심박 센서를 포함하는 것을 특징으로 하는 실내자전거를 사용하여 운동하는 사용자를 위한운동데이터 분석시스템."}
{"patent_id": "10-2023-0010654", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 운동 데이터는 csv, xml 형태의 파일로 구성된 후, 빅데이터 분석용 pandas 데이터로 변환되고, 데이터 학습을 위한 에너테이션(Annotation) 및 라벨링(Labeling) 과정을 거쳐 생성되는 것을 특징으로 하는 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템."}
{"patent_id": "10-2023-0010654", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 운동 분석 리포트는 미리 설정된 딥러닝 모델을 이용하여 상기 운동 데이터를 Map API 형태로 생성되는 것을 특징으로 하는 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템."}
{"patent_id": "10-2023-0010654", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 5단계의 심박 구간 샘플링 가이드 정보는 최대 심박수 대비 실제 심박수와 운동시간에 따른 트레이닝 효과정보를 제공하는 것을 특징으로 하는 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템."}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 서버-클라이언트 환경에서 실내자전거를 이용할 때 사용하는 케이던스 센서를 클라이언트로 지정하고, 케이던스 센서를 통하여 운동시 발생하는 페달 회전수를 측정하며, 케이던스 센서에 의하여 측정된 케이던스 데 이터를 서버로 전송하고, 웨어러블 기기인 심박센서를 클라이언트로 지정하여 심박 데이터를 측정 후 서버로 전 송하며, 서버에서 상기 케이던스 데이터와 심박 데이터를 사용하여 상기 케이던스 데이터와 심박 데이터를 사용 자의 실내 라이딩 운동데이터로 하여 5단계로 분석한 후 분석 결과를 사용자에게 제공하는 실내자전거를 사용하 여 운동하는 사용자를 위한 운동데이터 분석시스템에 관한 것으로, 사용자에게 보다 정확한 실내 라이딩 운동데 이터를 제공하여 효율적으로 운동할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템에 관한 것이다."}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "오늘날 현대인들에게 건강관리 및 몸매관리에 대한 관심이 증가되고 있다. 특히, 고령화 시대를 맞이하여 의료비용을 줄이기 위해 국가적인 차원에서 사회체육 보급에 관심을 가지고 있다. 이에 따라, 규칙적으로 운동하는 사람들이 증가하고 있으나, 바쁜 현대인들의 시간적, 공간적 제약으로 인해, 짧은 시간에 운동효과를 볼 수 있는 실내스포츠가 선호되는 경향이 있다. 이러한 실내스포츠는 실외에서 운동을 수행하므로 발생되는 계절적, 시간적 제약에 상관없이 수행할 수 있는 이 점을 갖고 있으며, 실내스포츠를 즐기는 사람의 증가에 따라 운동효과를 증대시킬 수 있는 실내운동기구가 다양 하게 개발되어 보급되고 있다. 예컨대, 자전거 타기는 무릎관절에 충격을 주지 않고 탁월한 운동효과를 제공하기 때문에 가장 보편화된 운동 중 하나로서, 최근에는 이러한 운동효과를 얻기 위해 실내 자전거 운동기구가 판매되고 있고, 대중 운동시설은 물론 일반 가정에 까지 보급되어 사용되고 있다. 그런데, 실내 자전거 운동기구는 고정형이기 때문에 운동 시 매우 단조로워 장시간 운동할 수 있는 욕구를 충족 시키지 못한다. 이에, 공개특허 제2010-0082823호에서는 실내 자전거 운동기구를 좌우로 기울일 수 있도록 하여 실제 자전거를 타는 듯한 느낌을 부여함으로써 호기심을 유발하고, 재미를 제공하며, 운동효과를 배가시키도록 한 예를 개시하 고 있다. 하지만, 개시된 공개특허의 경우는 단순히 핸들을 고정하는 포스트 부분이 피봇되어 있어 이 피봇을 중심으로 핸들 포스트가 수평방향으로 회전되면서 자전거 몸체를 기울이도록 구성된 구조여서 실제 자전거에서 안장에서 엉덩이를 띄우고 일어나서 페달을 밟을 때의 자전거 움직임과는 완전히 다르고, 운동효과도 전혀 달라 실제감이 떨어지는 한계를 안고 있다. 한편, 자전거 운동기구를 이용하는 사용자의 운동상황을 체계적으로 관리하면서 실제 자전거 타는 느낌을 줄 수 있도록 하는 자전거 운동기구들에 대한 개발이 지속적으로 이루어졌으며, 그 일환 중 하나로 가상현실 자전거 타기 운동기능을 구현한 공개특허 제2013-0090221호가 개시된 바 있다. 하지만, 상기 공개특허의 경우에는 저장된 경로에 따른 실제 물리적인 운동부하를 정밀하게 조절할 수 있는 기 능이 없고, 게임센터에서 사용할 수 있는 오토바이형 게임기구와 같은 흥미로운 게임기능에 한정되어 있어서 운 동효과에 한계를 가질 수 밖에 없으며, 개별 사용자 이력관리 기능이 없고, 일회성에 불과하여 체계적인 개인 운동관리가 어렵다는 단점이 있다. 특히, 초기에 저장된 경로 정보만을 가지고 자전거 주행을 하기 때문에 반복 사용에 따라 지루함을 느낄 수 있 고, 사용자가 자신의 운동정보를 다시 확인하고 활용하여 운동계획을 세우거나 할 수 있는 시스템이 제공되지 않아 편의성, 효율성, 사용성 측면에서 개선의 여지가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1388970호 (공고일자: 2014. 04. 24)"}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 개선하기 위한 본 발명 실시예들의 목적은 케이던스 데이터와 심박 데이터를 사용하여 사용자 의 실내 라이딩 운동데이터를 5단계로 분석하고, 분석 리포트를 사용자에게 제공하는 실내자전거를 사용하여 운 동하는 사용자를 위한 운동데이터 분석시스템을 제공하는 것이다."}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템은 실내 자전거의 페달에 구비된 제1 센서부와, 상기 실내 자전거를 이용하는 사용 자가 착용하는 웨어러블 기기에 구비된 제2 센서부와, 상기 제1 센서부 및 제2 센서부에 연결되어 상기 제1 센 서부 및 제2 센서부에 의하여 감지된 운동 데이터를 분석하여 사용자에게 제공하는 운동 서버를 포함하는 운동 데이터 분석시스템이고, 상기 운동 서버는 상기 운동 데이터를 기반으로 운동 분석 리포트와 5단계의 심박 구간 샘플링 가이드 정보를 생성하고, BMR(Basal Metabolic Rate) 및 MHR(Maximum Heart Rate) 추정값을 연산하며, 상기 생성 결과 및 연산 결과를 이용하여 사용자에게 딥러닝 기반 추천 모델을 제공하는 것을 특징으로 한다. 상기 제1 센서부는 케이던스 센서를 포함하고, 상기 제2 센서부는 심박 센서를 포함하는 것을 특징으로 한다. 상기 운동 데이터는 csv, xml 형태의 파일로 구성된 후, 빅데이터 분석용 pandas 데이터로 변환되고, 데이터 학 습을 위한 에너테이션(Annotation) 및 라벨링(Labeling) 과정을 거쳐 생성되는 것을 특징으로 한다. 상기 운동 분석 리포트는 미리 설정된 딥러닝 모델을 이용하여 상기 운동 데이터를 Map API 형태로 생성되는 것 을 특징으로 한다. 상기 5단계의 심박 구간 샘플링 가이드 정보는 최대 심박수 대비 실제 심박수와 운동시간에 따른 트레이닝 효과 정보를 제공하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템은 케이던스 데이터와 심박 데이터를 사용하여 사용자의 실내 라이딩 운동데이터를 5단계로 분석하고, 분석 리포트를 사용자 에게 제공함으로써, 사용자에게 보다 정확한 실내 라이딩 운동데이터를 제공하여 효율적으로 운동할 수 있다."}
{"patent_id": "10-2023-0010654", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "상기한 바와 같은 본 발명을 첨부된 도면들과 실시예들을 통해 상세히 설명하도록 한다. 본 발명에서 사용되는 기술적 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려 는 의도가 아님을 유의해야 한다. 또한, 본 발명에서 사용되는 기술적 용어는 본 발명에서 특별히 다른 의미로 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 의미로해석되어야 하며, 과도하게 포괄적인 의미로 해석되거나, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 기술적인 용어가 본 발명의 사상을 정확하게 표현하지 못하는 잘못된 기술적 용어일 때에 는, 당업자가 올바르게 이해할 수 있는 기술적 용어로 대체되어 이해되어야 할 것이다. 또한, 본 발명에서 사용 되는 일반적인 용어는 사전에 정의되어 있는 바에 따라, 또는 전후 문맥상에 따라 해석되어야 하며, 과도하게 축소된 의미로 해석되지 않아야 한다. 또한, 본 발명에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함한다. 본 발명에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 발명에 기재된 여러 구성 요소들, 또는 여러 단계를 반 드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 또한, 본 발명에서 사용되는 제 1, 제 2 등과 같이 서수를 포함하는 용어는 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되어서는 안 된다. 용어들은 하나의 구성 요소를 다른 구성 요소 로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성 요소는 제 2 구성 요소로 명명될 수 있고, 유사하게 제 2 구성 요소도 제 1 구성 요소로 명명될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동 일하거나 유사한 구성 요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 발명의 사상을 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 발명의 사상이 제한되는 것으로 해석되어서는 아니 됨을 유의해야 한다. 도 1은 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템을 개략적으로 나타내는 블록도이고, 도 2a 내지 2b는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하 는 사용자를 위한 운동데이터 분석시스템에서 운동데이터가 csv 및 gpx 파일로 생성되는 일 예를 나타내는 도면 이며, 도 3은 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스 템의 운동 서버에서 이루어지는 AI 알고리즘을 이용한 MLOps의 동작을 나타내는 도면이고, 도 4는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템의 운동 서버에서 생성되 는 운동 분석 리포트의 일 예를 나타내는 도면이며, 도 5는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템에 사용되는 케이던스 센서(Cadence)와 심박센서(heartrate)의 프로토콜을 설명하기 위한 도면이다. 도 1a에 도시된 바와 같이, 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데 이터 분석시스템은 케이던스 데이터와 심박 데이터를 사용하여 사용자의 실내 라이딩 운동데이터를 5단계로 분 석하고, 분석 리포트를 사용자에게 제공하는 시스템으로서, 제1 센서부, 제2 센서부 및 운동 서버 를 포함한다. 보다 상세하게는, 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석 시스템은 서버-클라이언트 환경에서 실내자전거를 이용할 때 사용하는 케이던스 센서를 클라이언트로 지정하고, 케이던스 센서를 통하여 운동시 발생하는 페달 회전수를 측정하며, 케이던스 센서에 의하여 측정된 케이던스 데 이터를 운동 서버로 전송하고, 웨어러블 기기인 심박 센서를 클라이언트로 지정하여 심박 데이터를 측정 후 운도 서버로 전송하며, 운동 서버에서 케이던스 데이터와 심박 데이터를 사용하여 케이던스 데이터와 심박 데이터를 사용자의 실내 라이딩 운동 데이터로 하여 5단계로 분석한 후 분석 결과를 사용자에게 제공한다. 이를 위하여, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스 템은 도 1b에 도시된 바와 같이, 사용자 운동 정보를 복수의 센서들, 즉 multimodal interaction(cadence, speed, heartrate)로부터 사용자 단말을 통하여 운동 서버로 전송(유저 운동 정보 데이터(센서), 유저 성향 데이터)한다. 이때, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템은 운 동 서버의 데이터베이스에 유저 DB와 콘텐츠 DB로 분류 저장하게 된다. 또한, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템은 운 동 서버를 통하여 데이터 마이닝/데이터 AI 학습/AI 학습결과를 도출후 사용자 단말로 전송(메타버스 자전거 투어 플레이어, 유저 운동 결과 정보 뷰어, AI 어시스턴트 추천결과 뷰어)하여 사용자에게 제공할 수 있다. 또한, 상기 운동 서버의 데이터베이스는 콘텐츠 서버로부터 메타버스 투어 콘텐츠(또는 스포츠 추천 콘텐츠)와 GPX 데이터 등을 제공받게 된다. 한편, 팬더스(pandas)는 파이썬 언어로 작성된 데이터를 분석 및 조작하기 위한 소프트웨어 라이브러리이다. 팬 더스는 수치형 테이블과 시계열 데이터를 조작하고 운영하기 위한 데이터를 제공하게 된다. 이하, 본 발명에서는 제1 센서부 및 제2 센서부가 유무선 통신을 통하여 운동 서버에 연결되는 것을 위주로 설명하고 있으나, 이에 한정하는 것은 아니고 실내 자전거를 이용하는 사용자가 구비하는 사용자 단말을 통하여 운동 서버와 연결되어 다양한 정보를 송수신할 수 있다. 상기 제1 센서부는 도 1a 및 도 5에 도시된 바와 같이, 실내 자전거의 페달에 구비된 센서로서, 사용자가 페달을 밟는 속도를 측정하는 케이던스 센서를 포함한다. 즉, 상기 제1 센서부는 사용자에 의하여 1분당 페달이 얼마나 회전(RPM)하는 지를 측정한다. 본 발명에서는 제1 센서부에 의하여 측정된 데이터를 케이던 스 데이터라 하기로 한다. 나아가, 상기 제1 센서부는 실내 자전거의 속도를 측정하는 속도 측정 센서를 더 포함할 수 있다. 상기 제2 센서부는 도 5에 도시된 바와 같이, 실내 자전거를 이용하는 사용자가 착용하는 웨어러블 기기에 구비된 센서로서, 사용자의 심박수를 측정하는 심박 센서를 포함한다. 이러한 제2 센서부는 사용자의 주관 적 운동 강도, 생체 상태를 측정하는 용도로 사용한다. 나아가, 상기 제2 센서부는 심박 센서 이외에 별도 의 생체 신호 센서를 구비할 수 있다. 상기 심박 센서는 사용자가 실내 자전거를 라이딩하는 도중에 실시간으로 심박수를 측정하는 장치로, 평소 심박 수와 최대 심박수를 측정하여 구간을 나눠 주행 훈련하거나 자신의 신체 상태를 확인할 수 있도록 하는 기능을 수행한다. 한편, 상기 웨어러블 기기(Wearable Device)는 클립 내지 밴드 타입 구조로 제작되어 사용자의 신체에 착용 또 는 사용자가 휴대하는 것으로, 자체적으로 또는 별도의 센서를 장착하여 사용자의 운동 실시에 따른 움직임이나 심박수를 감지하고 그에 따른 감지신호를 생성한다. 상기 웨어러블 기기는 운동 서버나 사용자 단말과의 무선 데이터 통신을 위한 통신모듈(미도시)이 구 비되어 사용자의 움직임에 따라 생성되는 감지신호를 운동 서버나 사용자 단말로 송신하도록 한다. 또한, 상기 웨어러블 기기는 선택적으로 적어도 하나 이상 구비될 수 있으며, 복수로 구성되는 경우에는 각각 고유의 일련번호를 갖는 바, 이러한 일련번호는 생성된 감지신호와 함께 운동 서버나 사용자 단말로 송신함으로써 운동 서버나 사용자 단말에서 각각의 웨어러블 기기를 식별하고 각 위치에서의 움직임 감지신호를 수신하여 분석할 수 있도록 한다. 상기 운동 서버나 사용자 단말과의 데이터 통신을 위한 통신모듈은 앞서 설명한 바와 같이 무선 통신 이 적용될 수 있는 바, 와이파이(Wi-Fi), 블루투스(bluetooth) 및 와이브로(Wibro) 등을 포함한 기존의 단말기 간 무선 통신 방식이 지원됨은 물론 운동이 실시되는 공간에서 USN(Ubiquitous Sensor Network) 망을 구축하여 상호 데이터 통신이 이루어질 수도 있다. 상기 운동 서버는 제1 센서부 및 제2 센서부에 연결되어 제1 센서부 및 제2 센서부에 의하여 감지된 운동 데이터를 분석하여 사용자에게 제공하는 장치로서, 제1 센서부 및 제2 센서부와 유무선 통신모듈을 통하여 연결되어 있는 서버 장치나 단말 장치를 포함한다. 이러한 운동 서버는 도 3에 도시된 바와 같이, 운동 데이터의 수집 및 분석을 위하여 AI 알고리즘을 이용한 MLOps 플랫폼 형태로 구현되어 서버 장치나 단말 장치에서 구현될 수 있다. 상기 운동 서버는 실내 자전거를 이용하는 사용자들의 운동 데이터를 수집한다. 상기 운동 데이터는 예를 들어, 사용자의 나이, 성별, 키, 몸무게 등뿐 만 아니라 사용자의 심박 데이터(심박수, 분당 호흡수 등을 포함함)를 포함하는 신체 데이터와 자전거 페달의 회전 속도를 의미하는 케이 던스 데이터를 포함할 수 있다. 또한, 상기 운동 데이터는 실시간으로 측정되나, 일(경기), 주, 월, 분기, 시즌, 총누적 기록 등 다양하게 수집 될 수도 있다. 예를 들어, 사용자가 실내 자전거를 라이딩할 때마다 운동 서버에 입력하는 경우, 일 단위 의 평가지표 별 개인기록이 수집될 수 있다. 일 실시예에 따르면, 상기 운동 서버는, 운동 서버에 등록된 사용자 단말의 입력에 따라 해당 사용자의 운동 데이터를 수집할 수 있다. 또는, 실내 자전거가 구비된 스포츠시설의 서버(미도시)와 연계하여 해당 스포츠시설에 가입된 사용자들의 데이터를 수집할 수도 있다. 일 실시예에 따르면, 상기 운동 서버는, 크롤링(crawling)을 수행하여 인터넷에 공유되는 사용자들의 운동 데이터를 자체적으로 수집할 수도 있다. 상기 운동 서버는 사용자의 운동 데이터를 기반으로 운동 분석 리포트와 5단계의 심박 구간 샘플링 가이드 정보를 생성한다. 여기서, 상기 운동 분석 리포트는 도 4에 도시된 바와 같이, 미리 설정된 딥러닝 모델을 이용하여 운동 데이터 를 Map API 형태로 생성될 수 있다. 또한, 상기 5단계의 심박 구간 샘플링 가이드 정보는 아래 표 1에서와 같이최대 심박수 대비 실제 심박수와 운 동시간에 따른 트레이닝 효과정보를 제공한다. 표 1 분류 심박 (최대심박대비)운동시간 트레이닝 효과 Z5 90~100% 5분 이하 효과: 최대한의 근력과 폐활량을 시도할 수 있음 느낌: 근육이 매우 피곤해지고, 숨쉬기가 힘듦 대상: 충분히 훈련을 많이 한 경우 하는 것이 좋으며, 5 분 이하로 짧게 인터발(interval) 형식으로 운동. 또는 2시간 이하의 라이딩 후 마무리 하기 전에 사용 Z4 80~90% 2~10분 효과: 빠른 속도를 유지하여 견디는 힘을 증가시킴 느낌: 근육이 뻐근하고, 숨쉬기가 벅참 대상: 장거리를 1년 이상 꾸준히 운동한 경우 효과적이 며, 시합이 시작되기 전 시즌에 중요하게 사용됨 Z3 70~80% 10~40분 효과: 일반적인 트레이닝 페이스(pace)를 향상시키고, 중간 정도의 힘이 필요한 운동의 효율을 높여줌 느낌: 빠르게 쉬는 숨을 꾸준히 이어갈 수 있음 대상: 운동 성능을 향상시키기에 좋고, 특히 장거리 라 이딩을 준비하는 데 도움이 됨 Z2 60~70% 40~80분 효과: 신체능력을 향상시켜 몸을 회복하는데 효과적임 느낌: 편안하고 쉬움. 근육을 조금 사용하고 심장이 조 금 뛰는 정도 대상: 트레이닝 시즌을 길게 가져갈 때 준비하는 것으로 좋고, 대회 등의 라이딩 후 회복할 때 사용함 Z1 50~60% 20~40분 효과: 워밍업 또는 운동 후 심박수를 낮추는데 효과적임 느낌: 매우 쉽고, 약간 긴장되는 정도 대상: 트레이닝을 하는 동안 몸을 회복하고, 운동 후 몸 을 식히는 쿨다운(cool down)에 사용됨 상기 운동 서버는 BMR(Basal Metabolic Rate) 및 MHR(Maximum Heart Rate) 추정값을 연산(아래 표2 참 조)하며, 상기 생성 결과 및 연산 결과를 이용하여 사용자에게 딥러닝 기반 추천 모델을 제공한다. 표 2 BMR Fomulas Man : 66.4730 + 13.7516 * w + 5.0033 * s - 6.7550 * a Woman : 655.0955 + 9.5634 * w + 1.8496 * s - 4.6756 * a w = weight, s = stature, a = age MHR Fomulas Man : 220 - (age * 0.8) Waman : 220 - (age * 0.7)한편, 상기 운동 데이터는 도 2a 내지 2b에 도시된 바와 같이, csv, xml 형태의 파일로 구성된 후, 빅데이터 분 석용 pandas 데이터로 변환되고, 데이터 학습을 위한 에너테이션(Annotation) 및 라벨링(Labeling) 과정을 거쳐 생성된다. 상기 운동 서버는 제1 센서부 및 제2 센서부에서 수집한 사용자 별 운동 데이터에 기초하여 운 동 분석 리포트, 즉 학습 데이터를 생성한다. 상기 운동 서버는 1 센서부 및 제2 센서부에서 수집된 로우 데이터(raw data) 또는 기 설정된 기준에 부합되어 추출된 데이터들(즉, 운동 데이터)을 학습에 최적화된 데이터로 가공할 수 있다. 즉, 상기 운동 서버 는 딥러닝을 위한 데이터 전처리를 수행할 수 있다. 예를 들어, 1차적으로 EDA(Exploratory data analysis)를 통해 노이즈를 제거하는 등 데이터 필터링을 수행하고, 2차적으로 데이터 범주화, 더미화, 정규화 등을 통해 필터링된 각 데이터가 포함하는 특징이 부각되도록 가공하거나 분류할 수 있다. 또한, 상기 운동 서버는 운동 데이터로부터 생성된 학습 데이터들을 각각 트레이닝셋(training set), 밸리 데이션셋(validation set) 및 테스트셋(test set)으로 구분하여 설정할 수 있다. 여기서, 각 셋이 구성되는 비 율은 운동 서버에 미리 설정된 비율일 수 있으며, 예로, 60: 20: 20의 비율로 설정될 수 있다. 트레이닝셋은, 딥러닝 모델에 의해 학습되는 데이터셋을 의미한다. 상기 운동 서버는 트레이닝셋을 이용하 여 복수의 운동분석 및 콘텐츠 추천 모델을 생성할 수 있다. 밸리데이션셋은, 학습에 관여하되 학습 오류를 파악하는 데 이용되는 데이터셋을 의미한다. 상기 운동 서버 는 밸리데이션셋을 이용하여 트레이닝셋을 통해 생성된 복수의 운동분석 및 콘텐츠 추천 모델 중 학습 오 류가 가장 적은 모델을 선정할 수 있다. 테스트셋은, 학습에 관여하지 않고, 학습이 완료된 후 선정된 모델에 대한 검증에 이용되는 데이터셋을 의미한 다. 상기 운동 서버는 테스트셋을 이용하여 밸리데이션셋을 통해 선정된 모델의 학습 오류를 보완할 수 있 다. 추가 실시예로서, 상기 운동 서버는 학습 데이터 중 가장 최근에 수집된 학습 데이터부터 역순으로 기 설 정된 범위(예로, 20%)에 해당하는 학습 데이터를 테스트셋으로 선정할 수 있다. 이 후, 나머지 학습 데이터를 나열하고 이들의 중간(평균)을 기준으로 기 설정된 범위(예로, 전체 중 평균 내외의 20%)에 해당하는 학습 데이 터를 밸리데이션셋으로 선정할 수 있다. 즉, 상기 운동 서버는 테스트셋을 제외한 학습 데이터들만 딥러닝 에 관여시키되, 이들의 평균을 나타내는 학습 데이터는 학습에 직접 이용하지 않고, 1차 딥러닝 검증에 이용할 수 있다. 이 후, 최신의 데이터인 테스트셋으로 2차 딥러닝 검증을 수행함으로써, 과적합을 방지하고 신뢰도를 높인 운동 분석 및 콘텐츠 추천 모델을 구축할 수 있다. 일 실시예에 따르면, 상기 운동 서버는 사용자 별로 수집된 각각의 개인기록 데이터를 통상 개인기록 데이 터와 시계열 개인기록 데이터로 가공하는 전처리를 수행할 수 있다. 여기서, 통상 개인기록 데이터는 기 설정된 평가지표 별로 전체기록의 평균에 대응하여 산출되는 것을 의미할 수 있다. 또한, 시계열 개인기록 데이터는 기 설정된 기간 동안의 기록 및 기록의 변화를 나타내는 추이 데이터를 포함할 수 있다. 또한, 추출한 기록의 추이를 나타내는 변화율 또는 그래프를 생성하여 이를 학습 데이터로 설정할 수 도 있다. 이러한 경우, 특징적인 개인기록은 충분히 학습에 반영되면서, 학습 데이터의 양은 최소화되어 처리 속도가 향상되는 효과가 도모될 수 있다. 일 실시예에 따르면, 이와 같이 설정된 통상 개인기록 데이터 및 시계열 개인기록 데이터는, 이동속도 예측 데 이터를 추출하는 딥러닝 모델을 구축하는 데 이용될 수 있다. 상기 운동 서버는 생성된 학습 데이터를 기 설정된 딥러닝 모델로 학습시켜 운동 분석 및 콘텐츠 추천 모 델을 구축한다. 여기서, 운동 분석 및 콘텐츠 추천 모델은, 입력되는 학습 데이터에 따라 유저 분석 데이터, 이 동속도 예측 데이터 및 콘텐츠 추천 데이터 중 적어도 하나의 데이터를 추출하도록 학습되는 분류 모델을 의미 한다. 일 실시예에 따르면, 운동 분석 및 콘텐츠 추천 모델은, 운동 데이터에 기초한 학습 데이터를 이용하여 분석 데 이터를 추출하도록 설계될 수 있다. 또한, 이는 CNN(Convolutional Neural Network) 모델로 설계되는 것이 바 람직하다.일 실시예에 따르면, 운동 분석 및 콘텐츠 추천 모델은, 신체 데이터, 통상 개인기록 데이터 및 시계열 개인기 록 데이터를 통해 이동속도 예측 데이터를 추출하도록 학습되는 것일 수 있다. 이러한 경우, 일 실시예에 따르 면, DNN(Deep Neural Network)모델 또는 LSTM(Long Short-Term Memory models)모델이 적용될 수 있다. 일 실시예에 따르면, 운동 분석 및 콘텐츠 추천 모델은, 운동 데이터를 기반으로 생성된 학습 데이터를 통해 콘 텐츠 추천 데이터를 추출하도록 학습되는 것일 수 있다. 이러한 경우, 일 실시예에 따르면, DNN모델 또는 LSTM 모델이 적용될 수 있다. 한편, 학습에 사용되는 데이터 중 개인기록은, 시간이 지나면서 계속 발생하는 데이터이므로, 학습이 진행되면 서 과부하가 걸리거나 일부 소실될 가능성이 높다. 특히, 경기, 일, 주 단위 등 단기로 수집되는 개인기록 데이 터인 경우, 더욱 문제가 될 수 있다. 이와 같은 문제점을 해결하고자, 본 발명의 일 실시예는 LSTM모델을 적용하여 운동 분석 및 콘텐츠 추천 모델을 구축한다. 이 때, 수집된 개인기록 데이터 중 기 설정된 기간 동안 수집된 데이터는 학습 과정 중에 소실되지 않고 계속적으로 학습에 사용될 수 있다. LSTM모델은 인공신경망의 장기 의존성 문제(Long-Term Dependency Problem)를 해결하기 위한 메모리를 포함한다. 즉, 입력되는 학습 데이터가 많아질수록 과거의 데이터가 마지막 층까지 전달되지 못하는 현상을 방 지하기 위하여, 이전 학습의 정보를 memory cell에 저장하고 다음 학습 단계로 전달한다. 여기서, 학습 시 과거의 데이터를 얼마나 활용할지는 망각 게이트(forget gate)에서 결정된다. 망각 게이트는, 현시점의 데이터와 과거의 데이터에 각각 가중치를 곱하고, 이들을 더한 후 시그모이드(sigmoid) 함수를 적용하 여 다음 단계로 전달할 과거의 데이터를 결정한다. 예를 들어, 상기 운동 서버는, 사용자 별로 수집된 개인기록 데이터 중 초반에 수집된 기록과 후반에 수집 된 기록을 제외한 기간에 수집된 데이터는 소실되지 않은 채 학습에 계속 활용되도록, 망각 게이트에 대한 가중 치를 결정할 수 있다. 이에 따르면, 개인기록 데이터의 양이 방대하더라도 유효한 표본의 개인기록은 유지됨에 따라, 과부하가 방지되되 정확한 학습 모델이 구축될 수 있다. 운동 분석 및 콘텐츠 추천 모델이 구축된 후, 상기 운동 서버는 사용자 또는 단말 장치로부터 입력 데이터 를 수신한다. 여기서, 입력 데이터는, 사용자의 신체 데이터, 운동 데이터 및 개인기록 데이터 중 적어도 하나 의 데이터를 포함할 수 있다. 상기 운동 서버는, 입력 데이터를 기초로 운동 데이터를 분석해주거나 향후 이동속도를 예측해주거나 적합 한 콘텐츠 정보를 추천해줄 수 있다. 즉, 수신한 입력 데이터를 운동 분석 및 콘텐츠 추천 모델에 적용하여 운 동분석 데이터, 이동속도 예측 데이터 및 콘텐츠 추천 데이터 중 적어도 하나의 데이터를 추출하고 사용자에게 제공할 수 있다. 상기와 같이 구성된 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분 석시스템의 동작의 일 예를 아래와 같이 간략하게 다시 설명하기로 한다. 우선, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템은 실 내 자전거를 이용하여 운동할 때 생성되는 GPX 파일을 분석한다. 이때, GPX(GPS Exchange Format)는 응용 소프트웨어의 공통 GPS 데이터 형식으로 설계된 XML 스키마이다. 구체적인 표현이나 개별적인 용도를 위해 웨이포인트(waypoint), 트랙(track) 및 루트(경로, route)를 기술하는 데 사용된다. 또한, 형식은 공개되어 있으며 라이센스 비용을 지불할 필요없이 사용할 수 있다. 위치 데이터(또는 선택적으로 고도, 시간 및 기타 정보)는 태그에 저장되며 GPS 장치와 소프트웨어간에 상호 교환될 수 있다. 데이터에 대한 일반적인 응용 소프트웨어에는 다양한 지도 소스에 투영된 트랙보기, 지도 주석 달기, 현위치에 서 찍은 시간을 기준으로 사진의 위치 정보 태그 지정 등이 포함된다. 그런 다음, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템 은 운동 서버를 통하여 GPX를 인공지능학습을 위해 Pandas 라이브러리를 활용하여 변환하게 된다. 그런 다음, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템 은 운동 서버를 통하여 인공지능 알고리즘을 이용하여 심박 데이터와 케이던스 데이터의 학습을 수행한다.마지막으로, 본 발명의 일 실시예에 의한 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스 템은 운동 서버를 통하여 분석된 운동 데이터 리포트를 클라이언트인 사용자에게 제공하게 된다. 상기 제1 센서부 및 제2 센서부의 외표면에는 내오염성을 향상시키기 위해 오염 방지 도포용 조성물 로 이루어진 내오염성 도포층이 도포될 수 있다. 상기 내오염성 도포용 조성물은 소듐설페이트 및 알킬 에톡실레이트 에테르가 1:0.01 ~ 1:2 몰비로 포함되어 있 고, 소듐설페이트 및 알킬 에톡실레이트 에테르의 총 함량은 전체 수용액에 대해 1 ~12 중량%이다. 상기 소듐설페이트 및 알킬 에톡실레이트 에테르는 몰비로서 1:0.01 ~ 1:2가 바람직한 바, 몰비가 상기 범위를 벗어나는 경우에는 오염 방지 도포용 조성물의 도포성이 저하되거나 도포 후에 표면의 수분흡착이 증가하여 도 포막이 제거되는 문제점이 있다. 상기 소듐설페이트 및 알킬 에톡실레이트 에테르는 전체 조성물 수용액 중 1 ~ 12 중량%가 바람직한 바, 1 중량 % 미만이면 오염 방지 도포용 조성물의 도포성이 저하되는 문제점이 있고, 12 중량%를 초과하면 도포막 두께의 증가로 인한 결정석출이 발생하기 쉽다. 한편, 본 내오염성 도포용 조성물을 제1 센서부 및 제2 센서부 상에 도포하는 방법으로는 스프레이법 에 의해 도포하는 것이 바람직하다. 또한, 상기 제1 센서부 및 제2 센서부 상의 최종 도포막 두께는 900 ~ 2300Å이 바람직하다. 상기 도포막의 두께가 900 Å미만이면 고온 열처리의 경우에 열화되는 문제점이 있 고, 2300 Å을 초과하면 도포 표면의 결정석출이 발생하기 쉬운 단점이 있다. 또한, 본 내오염성 도포용 조성물은 소듐설페이트 0.1 몰 및 알킬 에톡실레이트 에테르 0.05몰을 증류수 1000 ㎖에 첨가한 다음 교반하여 제조될 수 있다. 상기 구성 성분의 비율 및 도포막 두께를 상기와 같이 수치 한정한 이유는, 본 발명자가 수차례 실패를 거듭하 면서 시험결과를 통해 분석한 결과, 상기 비율에서 최적의 오염방지 도포 효과를 나타내었다. 상기 운동 서버에는 흡음층을 구성할 수 있다. 상기 흡음층으로는 천연섬유 부직포가 사용될 수 있다. 상기 흡음층의 두께는 0.7 ~ 16㎜인 것이 바람직하다. 상기 흡음층의 두께가 0.7㎜ 미만에서는 충분한 흡음 효 과가 얻어지지 않고, 16㎜를 초과하면 운동 서버와의 공간이 충분히 확보되지 않으므로 운동 서버의 온도를 높일 수 있는 단점이 되므로 바람직하지 않다. 상기 흡음층의 단위 무게는 15 ~ 700g/m2 로 하는 것이 바람직하다. 15g/m2 미만에서는 충분한 흡음효과가 얻어 지지 않고, 또한 700g/m2를 넘으면 서버의 경량성 등을 확보할 수 없으므로 바람직하지 않다. 상기 흡음층을 구성하는 섬유의 섬도는 0.7 ~ 23데시텍스의 범위인 것이 바람직하다. 0.7데시텍스 미만에서는 저주파 소음의 흡수가 어렵고 쿠션성도 저하되므로 바람직하지 않으며, 23데시텍스를 넘으면 고주파 소음의 흡 수가 어려우므로 바람직하지 않다. 상기 흡음층의 부직포의 인장강도는 9Kgf/㎠으로 형성되고, 소음감소계수(NRC)는 0,670으로 형성된다. 이러한 상기 흡음층이 운동 서버에 구비되므로 서버의 소음을 저감시킬 수 있다. 흡음층을 구성하는 부직포, 두께, 무게, 섬도 등의 구성 성분을 한정하고 구성비율의 수치를 한정한 이유는, 본 발명자가 수차례 실패를 거듭하면서 시험 결과를 통해 분석한 결과, 상기 구성 성분 및 수치 한정 비율에서 최 적의 흡음 효과를 나타내었다. 상기 사용자 단말의 표면에는 살균기능 및 사용자의 스트레스 완화 등에 도움이 되는 기능성 오일이 혼합 된 환경용 방향제 물질이 코팅될 수 있다. 방향제 물질과 기능성 오일의 혼합 비율은 상기 방향제 물질 95~97중량%에 상기 기능성 오일 3~5중량%가 혼합되 며, 기능성 오일은 타임오일(Thyme oil) 45중량%, 타라곤오일(Tarragon oil)55중량%로 이루어진다. 여기서 기능성 오일은 방향제 물질에 대해 3~5중량%가 혼합되는 것이 바람직하다. 기능성 오일의 혼합비율이 3 중량% 미만이면, 그 효과가 미미하며, 기능성 오일의 혼합비율이 3~5중량%를 초과하면 그 효과가 크게 향상되지 않는 반면에 경제성이 떨어진다. 타임오일(Thyme oil) 은 살균력이 강한 성분을 함유하고 있어 방부 등의 작용효과가 있으며, 타라곤오일(Tarragon oil)은 스트레스 완화 등에 좋은 효과가 있다. 따라서, 이러한 기능성 오 일이 혼합된 방향제 물질이 사용자 단말의 표면에 코팅됨에 따라, 사용자 단말의 표면을 살균 처리하 고 사용자의 스트레스 등을 경감시키는 등의 효과를 얻을 수 있다. 환경용 방향제 물질 및 기능성 오일에 대해 구성 성분을 한정하고 혼합 비율의 수치를 한정한 이유는, 본 발명 자가 수차례 실패를 거듭하면서 시험 결과를 통해 분석한 결과, 상기 구성 성분 및 수치 한정 비율에서 최적의 효과를 나타내었다. 이상에서는 본 발명에 따른 바람직한 실시예들에 대하여 도시하고 또한 설명하였다. 그러나 본 발명은 상술한 실시예에 한정되지 아니하며, 특허 청구의 범위에서 첨부하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형 실시가 가능할 것이다."}
{"patent_id": "10-2023-0010654", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a 내지 1b는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석 시스템을 개략적으로 나타내는 블럭도이다. 도 2a 내지 2b는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석 시스템에서 운동데이터가 csv 및 gpx 파일로 생성되는 일 예를 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템의 운동 서버에서 이루어지는 AI 알고리즘을 이용한 MLOps의 동작을 나타내는 도면이다. 도 4는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템의 운동 서버에서 생성되는 운동 분석 리포트의 일 예를 나타내는 도면이다. 도 5는 본 발명의 일 실시예에 따른 실내자전거를 사용하여 운동하는 사용자를 위한 운동데이터 분석시스템에 사용되는 케이던스 센서(Cadence)와 심박센서(heartrate)의 프로토콜을 설명하기 위한 도면이다."}
