{"patent_id": "10-2019-0096303", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0026043", "출원번호": "10-2019-0096303", "발명의 명칭": "인공지능 세탁기 및 인공지능 세탁기의 제어방법", "출원인": "엘지전자 주식회사", "발명자": "임명훈"}}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "세탁조가 가속 회전되는 중에 상기 세탁조를 회전시키는 모터에 인가되는 전류 값을 머신 러닝(machinelearning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 레이어(input layer)의 입력 데이터로하여 상기 인공신경망의 출력 레이어(output layer)에서의 출력으로 상기 세탁조에 수용된 포의 상태를 판단하는 제1 감지 단계;포의 마모도 또는 세탁강도를 고려하여 분류된 복수의 세탁모드 중 상기 포의 상태를 기초로 어느 하나의 세탁모드를 선택하는 단계; 및상기 선택된 세탁모드에 따라 세탁을 수행하는 세탁행정 단계를 포함하는 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 감지 단계는,상기 포의 상태를 포의 뻣뻣한 정도를 고려하여 분류된 복수의 포질 단계 중 어느 하나의 포질 단계로 판단하는단계를 포함하는 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 세탁모드는, 상기 포의 상태를 기초로 상기 세탁조의 회전속도가 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 세탁모드는 상기 포의 상태가 뻣뻣한 포일수록 상기 세탁조의 회전속도가 느리게 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 제1 감지 단계는,상기 전류 값을 상기 입력 데이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으로 상기 세탁조에 수용된포의 양을 구하는 단계를 포함하는 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 제1 감지 단계 전, 상기 세탁조에 수용된 포의 양을 구하는 포량감지 단계를 더 포함하는 세탁기의 제어방공개특허 10-2020-0026043-3-법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 세탁모드는, 상기 포의 상태 및 상기 포의 양을 기초로 상기 세탁조에 공급하는 세탁수의 양이 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 세탁모드는, 상기 포의 상태 및 포의 양을 기초로 상기 세탁행정 시간이 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 세탁모드는, 상기 포의 상태를 기초로 상기 세탁조에 공급된 세탁수의 온도가 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 세탁모드는, 상기 포의 상태를 기초로 세탁행정 시간에 대한 상기 세탁행정 중 상기 모터가 가동되는 시간의 비로 정의되는 세탁 실동율이 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1 항에 있어서,상기 세탁행정 단계는,세탁수를 순환시키는 펌프를 작동시켜 노즐을 통하여 상기 세탁조 내로 세탁수를 분사하는 단계를 포함하고,상기 세탁모드는, 상기 포의 상태를 기초로 상기 세탁행정 시간에 대한 상기 세탁행정 중 상기 펌프가 가동되는시간의 비로 정의되는 순환 실동율이 설정된 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 제1 감지 단계는,상기 세탁조를 가속 회전하는 제1 가속 단계;상기 세탁조가 가속 회전되는 제1 가속 구간에서 상기 모터에 인가되는 제1 전류 값을 구하는 단계; 및상기 제1 전류 값을 상기 입력 데이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으로 상기 포의 상태를판단하는 단계를 포함하는 세탁기의 제어방법.공개특허 10-2020-0026043-4-청구항 13 제 1 항에 있어서,상기 제1 감지 단계 후, 상기 인공신경망을 이용하여 상기 세탁조에 수용된 포의 상태를 재차 판단하는 제2 감지 단계를 더 포함하고,상기 제2 감지 단계는,상기 세탁조를 가속 회전하는 제2 가속 단계;상기 세탁조가 가속 회전되는 제2 가속 구간에서 상기 모터에 인가되는 제2 전류 값을 구하는 단계; 및상기 제2 전류 값을 상기 인공신경망의 입력 데이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으로 상기 포의 상태를 판단하는 단계를 포함하는 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제2 감지 단계 후, 상기 제1 감지 단계에서 판단한 포의 상태인 제1 포질과 상기 제2 감지 단계에서 판단한 포의 상태인 제2 포질을 바탕으로 상기 포의 상태를 구하는 단계를 더 포함하는 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 세탁모드를 선택하는 단계는, 상기 제1, 2 포질을 바탕으로 구한 포의 상태를 기초로 세탁모드를 선택하는세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "포가 투입된 세탁조를 가속하는 단계;상기 세탁조가 가속 회전되는 구간에서 상기 세탁조를 회전시키는 모터에 인가되는 전류 값을 구하는 단계;상기 전류 값을 머신 러닝(machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 레이어의 입력 데이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으로 상기 세탁조에 수용된 포의 상태를구하는 단계; 및상기 포의 상태를 기초로 구성된 세탁모드에 따라 세탁을 수행하는 세탁행정 단계를 포함하는 세탁기의 제어방법."}
{"patent_id": "10-2019-0096303", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 1 항 내지 제 16 항 중 어느 하나의 항에 따른 제어방법을 실시하는 세탁기."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 세탁조가 가속 회전되는 중에 상기 세탁조를 회전시키는 모터에 인가되는 전류 값을 머신 러닝 (machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 레이어(input layer)의 입력 데이터로 하여 상기 인공신경망의 출력 레이어(output layer)에서의 출력으로 상기 세탁조에 수용된 포의 상태를 판단하는 제1 감지 단계와, 포의 마모도 또는 세탁강도를 고려하여 분류된 복수의 세탁모드 중 상기 포의 상태를 기초로 어느 하나의 세탁모드를 선택하는 단계와, 상기 선택된 세탁모드에 따라 세탁을 수행하는 세탁행정 단계 를 포함하여, 상기 세탁조에 투입된 포의 특성에 따라 적합한 세탁을 수행하는 세탁기의 제어방법에 관한 것이다."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 세탁기 및 세탁기의 제어방법에 관한 것으로, 보다 상세하게는 머신 러닝(machine learning) 기반의 포량 및 포질 감지를 수행하는 세탁기 및 세탁기의 제어방법에 관한 것이다."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 세탁기는, 물과 세제의 화학적 분해 작용과 물과 세탁물 간의 마찰 등 물리적 작용 등을 이용하여, 의복, 침구 등(이하 '세탁물'이라 약칭함.)에 묻은 오염물질을 분리해내는 장치를 통칭하는 것이다. 세탁기는 크게 교반식, 와류식, 및 드럼식 세탁기로 구분된다. 이 중 드럼식 세탁기는 물이 담기는 저수조와, 상기 저수조 내에 회전 가능하게 구비되어 세탁물(이하, '포'라고도 함.)을 수용하는 세탁조를 포함한다. 상기 세탁조에는 물이 통과하는 다수의 통공이 형성된다. 세탁운전은 통상적으로 세탁행정, 헹굼행정 및 탈수행정으 로 구분된다. 세탁행정은 저수조에 저장된 물과 드럼에 저장된 세탁물의 마찰력, 물에 저장된 세제의 화학적 작용에 의해 세 탁물에 묻은 오염물질을 제거한다. 헹굼행정은 저수조내 내로 세제가 용해되지 않은 물을 공급하여, 포를 헹구는 것으로, 특히 세탁행정시 포에 흡 수된 세제가 제거된다. 헹굼행정시에는 물과 함께 섬유 유연제가 공급되기도 한다. 탈수행정은 헹굼행정이 완료된 이후에, 세탁조를 고속으로 회전시켜 포를 탈수시키는 것이다. 통상적으로 탈수 행정이 완료됨으로써 세탁기의 모든 운전이 종료되나, 건조 겸용 세탁기의 경우, 탈수행정 이후에 건조행정이 더 추가되기도 한다. 통상 세탁운전은 세탁조 내에 투입된 포의 양(이하, '포량'이라고도 함)에 따라 설정된다. 예를 들어, 포량에 따라 급수수위, 세탁간도, 배수시간 및 탈수시간 등이 설정된다. 세탁성능은 포량 뿐만 아니라 세탁물의 종류(이하, '포질'이라고도 함)에 따라서도 편차가 발생되는 것으로, 세 탁운전을 설정함에 있어서 포량만을 고려하는 경우에는 충분한 세탁성능을 기대할 수 없다. 또한, 세탁물은 종류에 따라 동일한 세탁운전에도 손상되는 정도가 다르고, 포량만을 고려하여 설정된 세탁운전 은 세탁물을 손상시키는 문제가 있다. 종래의 머신 러닝은 통계학 기반의 분류, 회귀, 군집 모델이 중심이었다. 특히, 분류, 회귀 모델의 지도 학습에 서는 학습 데이터의 특성과 이러한 특성을 기반으로 새로운 데이터를 구별하는 학습 모델을 사람이 사전에 정의 했다. 이와 달리, 딥러닝은 컴퓨터가 스스로 특성을 찾아내고 판별하는 것이다. 딥러닝의 발전을 가속화한 용인 중 하나로 오픈소스로 제공되는 딥러닝 프레임워크를 들 수 있다. 예를 들어, 딥러닝 프레임 워크로는 캐나다 몬트리올 대학교의 시아노(Theano), 미국 뉴욕 대학교의 토치(Torch), 캘리포니 아 버클리 대학교의 카페(Caffe), 구글의 텐서플로우(TensorFlow) 등이 있다. 딥러닝 프레임워크들의 공개에 따라, 효과적인 학습 및 인식을 위해, 딥러닝 알고리즘 외에 학습 과정, 학습 방 법, 학습에 사용하는 데이터의 추출 및 선정이 더욱 중요해지고 있다. 또한, 인공지능과 머신 러닝을 다양한 제품, 서비스에 이용하기 위한 연구가 증가하고 있다. 등록특허공보 10-1841248(이하 '선행기술'이라고도 함)는 머신 러닝으로 기 학습된 인공신경망의 입력 데이터로 모터의 속도를 사용하여 포량을 감지하는 제어방법을 개시하고 있다. 선행기술은 포량만을 감지하는 것으로, 전술한 세탁성능 및 세탁물 손상의 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 10-1841248"}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 첫째, 머신 러닝에 기반하여 포량 및/또는 포질을 빠르고 정확하게 감지할 수 있는 세탁기 및 그 제어방법을 제공하는 것이다.둘째, 포량/포질 판정에 사용되는 데이터를 효율적으로 처리함으로써, 판정에 소요되는 시간을 단축할 수 있는 세탁기 및 그 제어방법을 제공하는 것이다. 셋째, 포의 부드럽기/뻣뻣함, 함습율, 습포와 건포 간의 부피 차 등의 다양한 기준에 의해 포를 분류할 수 있는 세탁기 및 그 제어방법을 제공하는 것이다. 넷째, 포의 상태(포의 재질, 뻣뻣한 정도, 함습율, 포의 구성 등)를 고려하여, 포의 손상을 감소시키고, 세탁성 능은 향상시킨 세탁기 및 그 제어방법을 제공하는 것이다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위하여, 본 발명의 실시예에 따른 세탁기의 제어방법은, 세탁조에 수용된 포의 상태를 판 단하는 제1 감지 단계를 포함한다. 제1 감지 단계는 상기 세탁조가 가속 회전되는 중에 상기 세탁조를 회전시키는 모터에 인가되는 전류 값을 머신 러닝(machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 레이어(input layer)의 입력 데이터로 하여 상기 인공신경망의 출력 레이어(output layer)에서의 출력으로 상기 세탁조에 수용된 포의 상태를 판단한다. 상기 제1 감지 단계는, 상기 세탁조를 가속 회전하는 제1 가속 단계와, 상기 세탁조가 가속 회전되는 제1 가속 구간에서 상기 모터에 인가되는 제1 전류 값을 구하는 단계와, 상기 제1 전류 값을 상기 입력 데이터로 하여 상 기 인공신경망의 출력 레이어에서의 출력으로 상기 포의 상태를 판단하는 단계를 포함할 수 있다. 상기 제1 감지 단계는, 상기 포의 상태를 포의 뻣뻣한 정도를 고려하여 분류된 복수의 포질 단계 중 어느 하나 의 포질 단계로 판단하는 단계를 포함할 수 있다. 상기 제1 감지 단계는, 상기 전류 값을 상기 입력 데이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으 로 상기 세탁조에 수용된 포의 양을 구하는 단계를 포함할 수 있다. 상기 제1 감지 단계 후, 상기 인공신경망을 이용하여 상기 세탁조에 수용된 포의 상태를 재차 판단하는 제2 감 지 단계를 더 포함할 수 있다. 상기 제2 감지 단계는, 상기 세탁조를 재차 가속시켜, 상기 세탁조를 회전시키는 모터에 인가되는 전류 값을 상 기 인공신경망의 입력 레이어(input layer)의 입력 데이터로 하여 상기 인공신경망의 출력 레이어(output layer)에서의 출력으로 상기 세탁조에 수용된 포의 상태를 판단할 수 있다. 상기 제2 감지 단계는, 상기 세탁조를 가속 회전하는 제2 가속 단계와, 상기 세탁조가 가속 회전되는 제2 가속 구간에서 상기 모터에 인가되는 제2 전류 값을 구하는 단계와, 상기 제2 전류 값을 상기 인공신경망의 입력 데 이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으로 상기 포의 상태를 판단하는 단계를 포함할 수 있다. 제1, 2 감지 단계는, 상기 세탁조의 회전속도를 감지하는 단계를 더 포함할 수 있다. 상기 제1, 2 가속 단계는, 상기 세탁조의 회전속도를 제1 회전속도부터 상기 제1 회전속도보다 빠른 제2 회전속 도까지 가속하는 단계를 포함할 수 있다. 상기 제2 회전속도는 상기 포가 상기 세탁조와 일체로 회전하게 하는 회전속도일 수 있다. 상기 제2 회전속도는 상기 세탁조 내의 포가 상기 세탁조의 최고점에서도 낙하하지 않고 상기 세탁조에 달라붙은 상태로 회전하게 하 는 회전속도일 수 있다. 상기 제2 회전속도는, 상기 세탁조의 회전에 의해 상기 포에 작용하는 원심력이 상기 포에 작용하는 중력보다 크게 하는 회전속도일 수 있다. 상기 제2 회전속도는 60rpm 내지 80rpm일 수 있다. 상기 제1 회전속도는 10rpm 내지 20rpm일 수 있다. 상기 세탁조를 가속하는 단계는, 상기 모터의 회전속도를 제1 회전속도부터 제2 회전속도까지 일정한 가속도로 가속시키는 단계를 포함할 수 있다. 상기 제1, 2 감지 단계는, 상기 감지된 속도 값을 바탕으로, 상기 전류 값을 구하는 단계에서 구한 전류 값 중 상기 세탁조의 회전속도가 상기 제1 회전속도부터 상기 제2 회전속도까지 가속되는 구간에 해당하는 전류 값을 선택하는 단계와, 상기 선택된 전류 값을 상기 입력 데이터로 사용하는 단계를 포함할 수 있다. 상기 제1, 2 감지 단계는, 상기 세탁조의 회전속도가 제1 회전속도부터 상기 제1 회전속도보다 빠른 제2 회전속 도까지 가속되는 구간에서 상기 모터에 인가되는 전류 값을 상기 입력 데이터로 사용하는 단계를 포함할 수 있 다. 상기 제2 감지 단계 후, 상기 제1 감지 단계에서 판단한 포의 상태인 제1 포질과 상기 제2 감지 단계에서 판단 한 포의 상태인 제2 포질을 바탕으로 상기 포의 상태를 구하는 단계를 더 포함할 수 있다. 상기 제1 감지 단계 전, 상기 세탁조에 수용된 포의 양을 구하는 포량감지 단계를 더 포함할 수 있다. 본 발명의 실시예에 따른 세탁기의 제어방법은, 포의 상태를 기초로 구성된 세탁모드에 따라 세탁을 수행하는 세탁행정 단계를 포함한다. 본 발명의 실시예에 따른 세탁기의 제어방법은, 상기 포의 상태를 기초로 복수의 세탁모드 중 어느 하나의 세탁 모드를 선택하는 단계와, 상기 선택된 세탁모드에 따라 세탁을 수행하는 세탁행정 단계를 포함할 수 있다. 상기 복수의 세탁모드는 포의 마모도 및/또는 세탁강도를 고려하여 분류될 수 있다. 상기 세탁모드를 선택하는 단계는, 상기 제1, 2 포질을 바탕으로 구한 포의 상태를 기초로 세탁모드를 선택할 수 있다. 세탁모드는, 상기 포의 상태를 기초로 상기 세탁조의 회전속도가 설정될 수 있다. 상기 세탁모드는 상기 포의 상태가 뻣뻣한 포일수록 상기 세탁조의 회전속도가 느리게 설정될 수 있다. 상기 세탁모드는, 상기 포의 상태 및 상기 포의 양을 기초로 상기 세탁조에 공급하는 세탁수의 양이 설정될 수 있다. 상기 세탁행정 단계는, 상기 설정된 양의 세탁수를 상기 세탁조에 급수하는 급수 단계를 포함할 수 있다. 상기 설정된 세탁수의 양은, 상기 포의 양이 많을수록 많은 양으로 기 설정된 기준 급수량에 비해, 상기 포의 상태가 뻣뻣한 포일수록 적은 양으로 설정될 수 있다. 상기 세탁모드는, 상기 포의 상태 및 포의 양을 기초로 상기 세탁행정 시간이 설정될 수 있다. 상기 세탁행정 단계는, 상기 설정된 시간동안 세탁을 수행할 수 있다. 상기 세탁행정 시간은, 상기 포의 상태가 뻣뻣한 포일수 록 길게 설정될 수 있다. 상기 세탁모드는, 상기 포의 상태를 기초로 상기 세탁조에 공급하는 세탁수의 온도가 설정될 수 있다. 상기 세 탁조에 공급하는 세탁수의 온도는, 상기 포의 상태가 뻣뻣한 포일수록 높은 온도로 설정될 수 있다. 상기 세탁모드는, 상기 포의 상태를 기초로 세탁 실동율이 설정될 수 있다. 상기 세탁 실동율은 세탁행정 시간 에 대한 상기 세탁행정 중 상기 모터가 가동되는 시간의 비로 정의될 수 있다. 상기 세탁행정 단계는, 세탁수를 순환시키는 펌프를 작동시켜 노즐을 통하여 상기 세탁조 내로 세탁수를 분사하 는 단계를 포함할 수 있다. 상기 세탁모드는, 상기 포의 상태를 기초로 순환 실동율이 설정될 수 있다. 상기 순 환 실동율은, 상기 세탁행정 시간에 대한 상기 세탁행정 중 상기 펌프가 가동되는 시간의 비로 정의될 수 있다. 본 발명의 실시예에 따른 세탁기는 상기의 제어방법을 실시할 수 있다. 상기 세탁기는, 포를 수용하고 회전 가능하게 구비되는 세탁조와, 상기 세탁조를 회전시키는 모터와, 상기 세탁 조가 회전되도록 상기 모터를 제어하는 제어부와, 상기 모터에 인가되는 전류를 감지하는 전류 감지부를 포함한 다. 상기 제어부는, 상기 세탁조가 가속 회전되는 중에 상기 전류 감지부에 의해 감지된 전류 값을 인공신경망 (Artificial Neural Network)의 입력 레이어(input layer)의 입력 데이터로 하여 상기 인공신경망의 출력 레이 어(output layer)에서의 출력으로 포의 양 및 포의 상태를 구할 수 있다. 상기 인공신경망은 머신러닝(machine learning)으로 기학습될 수 있다. 상기 제어부는 인공신경망의 출력으로 구해진 상기 포의 양 및 포의 상태를 초로 세탁행정을 수행할 수 있다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 세탁기 및 그 제어방법은 머신 러닝 기반의 인공 신경망을 기반으로 모터의 전류 패턴을 분석할 수 있다. 특히, 이러한 전류 패턴은 세탁조 내에서 포의 상태에 따라 달라지는 것으로써, 포량, 포질, 포의 유동 등의 다양한 포의 특성이 반영된 것이다. 따라서, 상기 전류 패턴을 머신 러닝 기반의 학습을 통해 구축된 인공 신경망의 입력 데이터로 사용함으로써, 정확하고 신속하게 포를 분류할 수 있다. 특히, 이러한 포의 특성별 분류는 포량뿐만 아니라, 포의 재질, 함습율, 습포와 건포 간의 부피 등의 다양한 기 준에 의해 가능할뿐만 아니라, 머신 러닝의 트레이닝 데이터(모터 전류 데이터)가 누적될수록 그 정확도가 더 향상될 수 있다. 또한, 포의 마모도 및/또는 세탁강도를 고려하여 분류된 복수의 세탁모드 중 포의 상태를 기초로 어느 하나의 세탁모드를 선택하고, 상기 선택된 세탁모드에 따라 세탁을 진행하여 포의 손상을 감소시키고, 세탁성능은 향상 될 수 있다."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 그러나 본 발명이 이러한 실시예에 한정되는 것은 아니며 다양한 형태로 변형될 수 있음은 물론이다. 도면에서는 본 발명을 명확하고 간략하게 설명하기 위하여 설명과 관계없는 부분의 도시를 생략하였으며, 명세 서 전체를 통하여 동일 또는 극히 유사한 부분에 대해서는 동일한 도면 참조부호를 사용한다.한편, 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 단순히 본 명세서 작성의 용이함만 이 고려되어 부여되는 것으로서, 그 자체로 특별히 중요한 의미 또는 역할을 부여하는 것은 아니다. 따라서, 상 기 \"모듈\" 및 \"부\"는 서로 혼용되어 사용될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 세탁기를 도시한 단면도이다. 도 2는 본 발명의 일 실시예에 따른 세탁기의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 세탁기는, 외관을 형성하는 케이싱과, 케이싱 내에 배치되고 세탁수가 저장되는 저수조와, 저수조내에 회전 가능하도록 설치되어 세탁물이 투입되는 세탁조와, 세 탁조를 회전시키는 모터를 포함한다. 세탁조는, 세탁물의 입출을 위한 개구부가 형성된 전면 커버와, 대략 수평하게 배치되어 전단이 전면 커 버와 결합되는 원통형의 드럼과, 드럼의 후단에 결합되는 후면 커버를 포함한다. 모터의 회 전축은 저수조의 후벽을 통과하여 후면 커버와 연결될 수 있다. 세탁조와 저수조 사이에 물이 교 류될 수 있도록, 드럼에는 다수개의 통공이 형성될 수 있다. 세탁조는 수평한 축을 중심으로 회전된다. 여기서의 “수평”은 엄밀한 의미에서의 기하학적인 수평을 의미 하는 것은 아니고, 도 1에 도시된 바와 같이 수평에 대해 소정 각도로 기울어진 경우에도 수직보다는 수평에 가 까운 경우인 바, 세탁조가 수평한 축을 중심으로 회전된다고 하기로 한다. 케이싱의 전면에는 세탁물 투입구가 형성되고, 상기 세탁물 투입구를 개폐하는 도어가 케이싱에 회전 가능하게 구비된다. 케이싱의 내부에는 급수밸브, 급수관, 급수호스가 설치될 수 있다. 급수밸브 가 개방되어 급수가 이루어질 시, 급수관을 통과한 세탁수가 디스펜서에서 세제와 혼합된 다음, 급수 호스를 통하여 저수조로 공급될 수 있다. 펌프의 입력포트는 배출 호스에 의해 저수조와 연결되고, 펌프의 토출포트는 배수관과 연결 된다. 저수조로부터 배출 호스를 통해 배출된 물이 펌프에 의해 압송되어 배수관을 따라 유동된 후, 세탁기의 외부로 배출된다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 세탁기는, 세탁기의 전반적인 동작을 제어하는 제어부, 제어 부에 의해 제어되는 입력부, 모터 구동부, 출력부, 통신부, 속도 감지부, 전류 감지부 , 메모리를 포함할 수 있다. 제어부는 세탁, 헹굼, 탈수 및 건조의 일련의 세탁과정을 제어할 수 있다. 제어부는 입력부를 통해 사용자로부터 세탁, 헹굼, 탈수 및 건조의 일련의 세탁과정을 입력 받을 수 있다. 제어부는 미리 설정되어 있는 알고리즘에 따라, 세탁, 헹굼, 행정을 진행할 수 있고, 또한, 제어부는 상기 알고리즘에 따라 모터 구 동부를 제어할 수 있다. 모터 구동부는 제어부로부터 인가되는 제어신호에 대응하여, 모터의 구동을 제어할 수 있다. 제어신 호는 모터의 목표속도, 가속 기울기(또는, 가속도), 구동시간 등을 제어하는 신호일 수 있다. 모터 구동부는, 모터를 구동시키기 위한 것으로, 인버터(미도시), 및 인버터 제어부(미도시)를 포함할 수 있다. 또한, 모터 구동부는, 인버터에 입력되는 직류 전원을 공급하는, 컨버터 등을 더 포함하는 개념일 수 있다. 예를 들어, 인버터 제어부(미도시)가 펄스폭 변조(PWM) 방식의 스위칭 제어 신호를 인버터(미도시)로 출력하면, 인버터(미도시)는 고속 스위칭 동작을 하여, 소정 주파수의 교류 전원을 모터에 공급할 수 있다. 속도 감지부는 세탁조의 회전속도를 감지한다. 속도 감지부는 모터의 회전자의 회전속도를 감지 할 수 있다. 모터의 회전비를 변환시켜 세탁조를 회전시키는 유성 기어열이 구비된 경우, 세탁조의 회 전속도는 속도 감지부에 의해 감지된 상기 회전자의 회전속도를 상기 유성 기어열의 감속 또는 증속비를 고 려하여 변환한 값일 수 있다. 제어부는, 속도 감지부로부터 전달된 현재 속도를 피드백(feedback)으로 하여, 모터가 기 설정된 목 표속도를 추종하도록 모터 구동부를 제어할 수 있다. 전류 감지부는, 모터에 인가되는 전류(이하, 현재 전류라고 함.)를 감지하여 제어부로 전달하고, 제 어부는 수신된 현재 전류를 입력 데이터로 이용하여 포량과 포질을 감지할 수 있다. 이때, 상기 입력 데이터로써의 현재 전류 값들은 모터가 기 설정된 목표속도를 향해 가속되는 과정에서 구한 값들을 포함한다. 토크 전류와 자속 전류를 바탕으로 한 벡터 제어에 의해 모터의 회전이 제어되는 경우, 상기 현재 전류는 모 터 회로에 흐르는 전류의 토크축(q축) 성분, 즉, 토크 전류(Iq)일 수 있다. 출력부는 세탁기의 작동 상태를 출력하는 것이다. 출력부는 시각적 표시를 출력하는 LCD, LED 등의 화 상 출력장치 또는 음향을 출력하는 스피커 부져(buzzer) 등의 음향 출력장치일 수 있다. 제어부의 제어에 의해 출력부는 포량 또는 포질에 대한 정보를 출력할 수 있다. 메모리에는 프로그램된 인공신경망, 포량 별 및/또는 포질 별 전류 패턴들, 상기 전류 패턴을 바탕으로 머 신 러닝 기반의 학습을 통해 구축된 데이터 베이스(DB), 머신 러닝 알고리즘, 전류 감지부에 의해 감지된 현재 전류 값, 상기 현재 전류 값들을 평균한 값, 이들 평균한 값들을 파싱 룰(parsing rule)에 따라 처리한 값, 통신부를 통해 송수신되는 데이터 등이 저장될 수 있다. 뿐만 아니라, 메모리에는 세탁기의 동작 전반의 제어를 위한 각종 제어 데이터, 사용자가 입력한 세탁설정 데이터, 세탁설정에 따라 산출되는 세탁시간, 세탁 코스 등에 대한 데이터, 세탁기의 에러 발생 여부를 판단하 기 위한 데이터 등이 저장될 수 있다. 통신부는 네트워크에 연결된 서버와 통신할 수 있다. 통신부는 인터넷 모듈, 이동 통신 모듈 등 하나 이상의 통신 모듈을 구비할 수 있다. 통신부는 상기 서버로부터 학습 데이터, 알고리즘 업데이트 등의 각종 데이터를 수신할 수 있다. 제어부는 통신부를 통해 수신된 각종 데이터를 처리하여 메모리를 갱신할 수 있다. 예를 들어, 통 신부를 통해 입력된 데이터가 메모리에 기저장된 운전 프로그램에 대한 업데이트 데이터인 경우에는 이 를 이용하여 메모리에 업데이트시키고, 입력된 데이터가 신규한 운전 프로그램인 경우에는 메모리에 이 를 추가로 저장시킬 수 있다. 딥러닝(Deep Learning)은, 인공지능을 구성하기 위한 인공신경망(ANN)에 기반으로 해 컴퓨터에게 사람의 사고방 식을 가르치는 방법으로 사람이 가르치지 않아도 컴퓨터가 스스로 사람처럼 학습할 수 있는 인공지능 기술이다. 인공신경망(ANN)은 소프트웨어 형태로 구현되거나 칩(chip) 등 하드웨어 형태로 구현될 수 있다. 세탁기는, 머신 러닝(machine learning) 기반으로 전류 감지부에 의해 감지된 전류 값들을 처리하여 세탁조 내에 투입된 세탁물(포)의 특성(이하, 포 특성이라고 함.)을 파악할 수 있다. 이러한 포 특성은 포의 양과 포의 상태(이하, ‘포질’이라고도 함)을 예로 들 수 있으며, 제어부는 머신 러닝 기반으로 포량 별 포질을 판정할 수 있다. 예를 들어, 제어부는 포량을 구하고, 다시 포질에 따라 기 분류된 카테고리들 중 어느 것 에 속하는지를 판정할 수 있다. 이러한 포의 상태는 포의 재질, 부드러운 정도(예를 들어, 부드러운(soft) 포/ 뻣뻣한(hard) 포), 포가 물을 머금을 수 있는 능력(즉, 함습율), 건포와 습포 간의 부피 차, 포의 구성(즉, 부 드러운 포(Soft)와 뻣뻣한 포(Hard)의 혼합비) 등의 여러 요인들을 바탕으로 정의될 수 있다. 제어부는, 상기 목표속도에 도달하는 시점까지 전류 감지부에서 감지된 현재 전류 값을 머신 러닝 (machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 데이터(input data)로 사용 하여 포량을 감지할 수 있다. 도 3은 포질과 부하량(포량)에 따른 모터에 인가되는 전류 패턴을 도시한 것이다. 도 4는 포질별 전류 패턴을 도시한 것이다. 도 5는 모터의 속도를 기 설정된 방법으로 제어하면서, 부하별 전류 패턴을 도시한 것이다. 도 3에 도시된 각각의 그래프는, 세탁조를 기 설정된 목표 회전속도(예를 들어, 80rpm)까지 가속하면서 측정 한 현재 전류를 나타내고 있으며, 이들 그래프들은 포의 구성(즉, 부드러운 포(Soft)와 뻣뻣한 포(Hard)의 혼합 비)과 부하량을 달리하면서 측정되었다. 즉, 가로로 배열된 그래프들을 통해서는 부하량에 따른 패턴의 변화 추 이를 파악할 수 있다. 예를 들어, 같은 포 구성일 시, 부하량이 클수록 세탁조의 가속 초기에 현재 전류의 최고치가 큼을 알 수 있다. 따라서, 그래프의 초반부 데이터들이 부하량(포량)을 결정하는데 사용되는 것이 적 절하다고 할 수 있다. 세로로 배열된 그래프들을 통해서는 포 구성에 따른 패턴의 형태의 변화 추이를 파악할 수 있다. 예를 들어, 같 은 부하량일 시, 거친 포의 비율이 클수록 전류 값이 하향 이동됨을 알 수 있고, 세탁조의 가속 중후반 내지 중/후반부 내지 목표 회전속도 유지 구간에서 특히 그러함을 알 수 있다. 따라서, 앞서 포량을 결정하는데 사용 할 데이터가 구해진 구간 이후에서 포질을 구하는데 필요한 데이터를 취하는 것이 적절하다고 할 수 있다.도 4는 포 구성(포질)별 현재 전류의 패턴을 도시하고 있다. 도 4에서 C0.0은 부드러운 포 100%, C0.25, C0.5, C0.75은 차례로 부드러운 포 100%, 부드러운 포:뻣뻣한 포의 비율이 1:3, 1:1, 3:1, C1.0은 뻣뻣한 포 100%인 경우를 표시한 것이고, 각 경우에 있어서 부드러운 포와 뻣뻣한 포를 더한 전체 포량(부하량)은 일정하다. 그래프들은 포 구성이 달라지면 부하량이 같다고 하더라도, 현재 전류의 패턴이 다르다는 점을 보여주고 있다. 따라서, 전류 패턴을 머신 러닝한 것을 기반으로 하여 포구성(또는, 포질)에 따른 분류가 가능한 것이다. 이러한 포량/포질 감지는 복수회 반복될 수 있으며, 실시예에서는 3회 반복하였으나 그 횟수가 이에 한정되어야 하는 것은 아니다. 포량/포질 감지는 동일한 단계에서 복수회 반복될 수 있으며, 서로 다른 단계에서 복수회 반 복될 수도 있다. 제어부는 매 포량/포질 감지 결과에 따라 세탁 알고리즘을 설정 또는 설정을 변경할 수 있고, 설정된 바에 따라 세탁기의 작동을 제어할 수 있다. 도 5에 표시된 그래프 P1, P3, P5, P7, P9, P15는 각각 포량이 1, 3, 5, 7, 9, 15kg 일때를 나타낸다. 그래프 들은 전체적으로는 세탁조의 가속 초반에는 현재 전류 값이 어느 수준까지 급하게 상승하였다가 후반으로 가 면서 일정한 값을 수렴되는 형태이다. 특히, 포량에 따른 현재 전류 값의 편차는 세탁조의 가속 초반에 두드 러짐을 알 수 있다. 제어부는 포량/포질 학습모듈과 포량/포질 인식모듈을 포함할 수 있다. 포량/포질 학습모듈은, 전류 감지부에서 감지된 현재 전류 값 또는 상기 현재 전류 값을 처리한 값을 이용하여 머신 러닝을 할 수 있다. 이러한 머신 러닝을 통해, 포량/포질 학습모듈은 메모리에 저장된 데이터 베이스를 업데이트 할 수 있다. 포량/포질 학습모듈의 학습 방법으로는 자율학습(unsupervised learning)과 지도학습(supervised learning) 중 어느 것이나 사용될 수 있다. 포량/포질 인식모듈은 포량/포질 학습모듈에 의해 학습된 데이터에 기반하여 포량에 따른 레벨을 판정 할 수 있다. 포량의 판정은, 세탁조 안에 투입된 포를 무게(부하)에 따라 기 설정된 복수의 포량 레벨 (Level)로 분류하는 작업일 수 있다. 실시예에서 포량은 5단계(레벨)로 분류되며, 각 단계에 해당하는 부하량(kg)은 다음의 표 1과 같다. 또한, 표 1 은 한 가구에서 해당 포량을 세탁기에 투입하는 경우에 있어서의 그 가구를 구성하는 세대수를 통계적으로 보이 고 있기도 하다. 표 1 포량 (5단계) 부하량 세대 수 1 레벨 0 ~ 1kg 1인 2 레벨 1 ~ 3kg 1~2인 3 레벨 3 ~ 5kg 2인 4 레벨 5 ~ 6kg 3인 이상 5 레벨 6kg 이상 포질의 판정은, 세탁조에 투입된 포를 기 설정된 기준에 따라 분류하는 것으로써, 이러한 기준은 포의 재질, 부드럽거나 뻣뻣한 정도, 함습율, 건포와 습포 간의 부피 차 등일 수 있다. 포량/포질 인식모듈은 전류 감지부로부터 구해진 현재 전류 값을 바탕으로, 세탁조 내에 투입된 포 가 복수의 포량단계 중 어느 것에 해당하고, 이때의 포질은 어떤 분류에 해당하는지(즉, 포량별 포질)를 판정할 수 있다. 실시예에서 포질은 5단계(레벨)로 분류되며, 각 단계에 해당하는 종류는 다음의 표 2과 같고, 아래 표 2를 참고 하면, 부드럽고 내구성이 약한 옷 계열은 1 레벨(제1 포질 단계), 1 레벨의 옷 계열보다 강한 내구성을 갖는 옷 계열은 3 레벨(제3 포질 단계), 3 레벨의 옷 계열보다 강한 내구성을 갖고 뻣뻣한 옷 계열은 5 레벨(제5 포질 단계), 상기 1 레벨과 3 레벨의 옷 계열이 혼합된 경우 2 레벨(제2 포질 단계), 상기 3 레벨과 5 레벨의 옷 계 열이 혼합된 경우 4 레벨(제4 포질 단계)로 판단할 수 있다.표 2 포질 (5단계) 마모도/세탁강도 종류 1 레벨 마모도: 상 세탁강도: 하가볍고 부드러운 소재의 옷감, 섬세 한 소재(예를 들어 실크)의 속옷 2 레벨 1레벨, 3레벨 의류 혼합 3 레벨 마모도: 중 세탁강도: 중면방 겉옷, 면방/혼방 속옷 4 레벨 3레벨, 5레벨 의류 혼합 두꺼운 소재, 질긴 소재, 뻣뻣한 의 류(가을점퍼, 겨울점퍼, 작업복 등) 5 레벨 마모도: 하 세탁강도: 상 포량/포질 인식모듈은 머신 러닝(machine learning)으로 기학습된 인공신경망(Artificial Neural Networks, ANN)을 탑재할 수 있다. 이러한 인공신경망은 포량/포질 학습모듈에 의해 업데이트 될 수 있다. 포량/포질 인식모듈은 인공신경망을 기반으로 포량과 포질을 판정할 수 있다. 실시예에서와 같이, 포량의 단계가 5단계로 분류된 경우, 포량/포질 인식모듈은 전류 감지부가 감지한 현재 전류 값을 인공신경망 (ANN)의 입력 데이터로 사용하여 포량이 속한 단계를 판정할 수 있고, 더 나아가 포질이 속한 단계도 판정할 수 있다. 포량/포질 인식모듈은 포량과 포질을 각각 소정 기준에 따라 단계로 분류하도록 학습된 인공신경망(ANN)을 포함할 수 있다. 예를 들어, 포량 인식모듈은 딥러닝(Deep Learning)으로 학습된 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등의 심층신경망(Deep Neural Network, DNN)을 포함할 수 있다. RNN(Recurrent Neural Network)은, 자연어 처리 등에 많이 이용되고 있으며, 시간의 흐름에 따라 변하는 시계열 데이터(Time-series data) 처리에 효과적인 구조로 매 순간마다 레이어를 쌓아 올려 인공신경망 구조를 구성할 수 있다. DBN(Deep Belief Network)은 딥러닝 기법인 RBM(Restricted Boltzmann Machine)을 다층으로 쌓아 구성되는 딥 러닝 구조이다. RBM(Restricted Boltzmann Machine) 학습을 반복하여, 일정 수의 레이어가 되면 해당 개수의 레이어를 가지는 DBN(Deep Belief Network)를 구성할 수 있다. CNN(Convolutional Neural Network)은 사람이 물체를 인식할 때 물체의 기본적인 특징들을 추출한 다음 뇌 속에 서 복잡한 계산을 거쳐 그 결과를 기반으로 물체를 인식한다는 가정을 기반으로 만들어진 사람의 뇌 기능을 모 사한 모델이다. 한편, 인공신경망의 학습은 주어진 입력에 대하여 원하는 출력이 나오도록 노드간 연결선의 웨이트(weight)를 조정(필요한 경우 바이어스(bias) 값도 조정)함으로써 이루어질 수 있다. 인공신경망은 학습에 의해 웨이트 (weight) 값을 지속적으로 업데이트 시킬 수 있다. 인공신경망의 학습에는 역전파(Back Propagation) 등의 방법 이 사용될 수 있다. 포량/포질 인식모듈은 현재 전류 값을 입력 데이터로 하고, 심층신경망(DNN)에 포함된 노드들 사이의 가중 치(weight)들에 기초하여, 출력 레이어에서의 출력으로 세탁조에 투입된 포량과 포질 중 적어도 하나를 판정 할 수 있다. 도 7은 인공신경망의 일례를 도시한 개요도이다. 도 8은 모터의 현재 전류 값을 이용하여 포량 및 포질을 판단 하는 과정을 학습과정과 인식과정으로 구분하여 표시한 개요도이다. 이하, 도 7 내지 도 8을 참조한다. 머신 러닝(Machine Learning)의 일종인 딥러닝(Deep Learning) 기술은 데이 터를 기반으로 다단계로 깊은 수준까지 내려가 학습하는 것이다. 딥러닝(Deep learning)은 히든 레이어들을 차례로 거치면서 복수의 데이터들로부터 핵심적인 데이터를 추출하는 머신 러닝(Machine Learning) 알고리즘의 집합을 나타낼 수 있다. 딥러닝 구조는 인공신경망(ANN)을 포함할 수 있으며, 예를 들어 딥러닝 구조는 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경망(DNN)으로 구성될 수있다. 도 7을 참조하면, 인공신경망(ANN)은 입력 레이어(Input Layer), 히든 레이어(Hidden Layer) 및 출력 레이어 (Output Layer)를 포함할 수 있다. 다중의 히든 레이어(hidden layer)를 갖는 것을 DNN(Deep Neural Network) 이라고 한다. 각 레이어는 복수의 노드들을 포함하고, 각 레이어는 다음 레이어와 연관되어 있다. 노드들은 웨 이트(weight)를 가지고 서로 연결될 수 있다. 제1 히든 레이어(Hidden Layer 1)에 속한 임의의 노드로부터의 출력은, 제2 히든 레이어(Hidden Layer 2)에 속 하는 적어도 하나의 노드의 입력이 된다. 이때 각 노드의 입력은 이전 레이어의 노드의 출력에 웨이트(weight) 가 적용된 값일 수 있다. 웨이트(weight)는 노드간의 연결 강도를 의미할 수 있다. 딥러닝 과정은 적절한 웨이 트(weight)를 찾아내는 과정으로도 볼 수 있다. 딥러닝을 보다 잘 이해하기 위해, 잘 알려진 얼굴인식 과정을 살펴보면, 컴퓨터는 입력 영상으로부터, 픽셀의 밝기에 따라 밝은 픽셀과 어두운 픽셀을 구분하고, 테두리, 에지 등 단순한 형태를 구분한 후, 조금 더 복잡한 형태와 사물을 구분할 수 있다. 최종적으로 컴퓨터는 인간의 얼굴을 규정하는 형태를 파악할 수 있다. 이와 같 이 특징의 구체화(인간 얼굴 형태의 규정)는 중층의 히든 레이어들을 거쳐 최종적으로 출력 레이어에서 구해진 다. 메모리에는 포량 감지를 위한 입력 데이터, 심층신경망(DNN)을 학습하기 위한 데이터가 저장될 수 있다. 메 모리에는 속도 감지부가 획득하는 모터 속도 데이터 및/또는 속도 데이터들이 소정 구간별로 합산되거 나 연산 처리된 데이터들이 저장될 수 있다. 또한, 메모리에는 심층신경망(DNN) 구조를 이루는 웨이트 (weight), 바이어스(bias)들이 저장될 수 있다. 또는, 실시예에 따라, 심층신경망 구조를 이루는 웨이트(weight), 바이어스(bias)들은 포량/포질 인식모듈 의 임베디드 메모리(embedded memory)에 저장될 수 있다. 한편, 포량/포질 학습모듈은 전류 감지부를 통해 감지된 현재 전류 값을 트레이닝(training) 데이터로 사용하여 학습(learning)을 수행할 수 있다. 즉, 포량/포질 학습모듈은 포량 및/또는 포질을 인식 또는 판 정할 때마다 그 판정 결과를 데이터 베이스에 추가하여 웨이트(weight)나 바이어스 등의 심층신경망(DNN) 구조 를 업데이트(update)하거나, 소정 횟수의 트레이닝 데이터가 확보된 후에 확보된 트레이닝 데이터로 학습 과정 을 수행하여 웨이트(weight) 등 심층신경망(DNN) 구조를 업데이트할 수 있다. 본 발명의 실시예에 따른 세탁기는 통신부를 통하여 전류 감지부에서 획득한 현재 전류 데이터를 통신 망에 연결된 서버(미도시)로 전송하고, 상기 서버로부터 머신 러닝과 관련된 데이터를 수신할 수 있다. 이 경우 에, 세탁기는, 상기 서버로부터 수신된 머신 러닝과 관련된 데이터에 기초하여 인공신경망을 업데이트(update) 할 수 있다. 도 9는 전류 감지부에 의해 감지된 현재 전류 값을 도시한 그래프(a)와, 이동평균필터를 처리하여 구한 평균 값 들을 도시한 그래프(b)이다. 도 10은 전류 감지부에 의해 전류 값들을 도시한 그래프이다. 도 11은 도 10에 도 시된 그래프의 전류 값들을, 인공신경망의 입력 데이터로 사용하기 위해 처리한 값들을 도시한 그래프이다. 도 12는 본 발명의 일 실시예에 따른 세탁기의 제어방법을 도시한 순서도이다. 이하, 도 9 내지 도 12를 참조하여 포량 및 포질을 판단하는 방법을 설명한다. 제어부는 기 설정된 목표 회전속도로 모터가 회전되도록 제어한다(S1, S2, S3, S4, S5). 모터가 회전 되는 중에 속도 감지부에 의해 세탁조(또는, 모터)의 회전속도가 감지된다(S2). 상기 목표 회전속도는, 세탁조가 상기 목표 회전속도를 유지하며 1회전 이상을 일방향으로 연속하여 회전될 시, 포가 드럼에 달라붙은 상태를 유지할 수 있는 세탁조의 회전속도로 정해질 수 있다. 즉, 상기 목표 회전속도는 포가 드럼과 일체로 회전할 수 있는 세탁조의 회전속도로 정해질 수 있다. 세탁조가 목표 회전속도로 회전될 시, 세탁조의 회전에 의해 상기 포에 작용하는 원심력이 상기 포에 작용하는 중력보다 클 수 있다. 상기 목표 회전속도는 60 내지 80rpm일 수 있고, 바람직하게는 80rpm이다. 바람직하게는, 세탁조의 회전속도 가 상기 목표 회전속도에 도달하기 전의 상태에서는, 포가 드럼 내에서 유동된다. 즉, 포가 드럼의 회 전에 의해 소정 높이까지 상승하였다가 낙하된다. 한편, 상기 목표 회전속도는 저수조 내로 급수가 이루어져 세탁조가 부분적으로 물에 잠긴 상태를 기준으 로 정해질 수 있다. 즉, 세탁조가 부분적으로 물에 잠긴 상태에서 상기 목표 회전속도로 회전될 시 포가 유동될 수 있다. 다시 말해, 세탁조의 회전 중에 포가 드럼에 항시 달라붙어 있는 것이 아니라, 소정 높이 까지 상승하였다가 낙하될 수 있다. 포량과 포질을 판정하는데 사용되는 현재 전류 값들은, 세탁조의 회전 과정에서 포의 유동이 발생하는 구간 에서 취한 것들을 포함한다. 즉, 제어부는 속도 감지부에 의해 감지된 세탁조의 회전속도(또는, 모 터의 회전속도)를 바탕으로 필요한 현재 전류 값들을 취할 수 있다. 구체적으로, 제어부는 모터 구동부에 모터를 가속할 것을 지시한 후, 속도 감지부에 의해 감지 된 회전속도가 기 설정된 제1 회전속도(V1)에 이르면 그 때부터의 현재 전류 값을 메모리에 저장할 수 있다 (S3 내지 S4). 모터를 가속시키는 구간의 초기에는, 포가 세탁조 내에 자리잡은 위치 등 포량 및 포질 이외의 요인이 모 터에 인가되는 전류 값에 과도하게 반영될 수 있다. 따라서, 포량 및 포질을 판별하는 입력 데이터로써, 가 속구간의 초기 전류 값을 제외하는 것이 바람직하다. 즉, 모터의 회전속도(V)가 제1 회전속도(V1)에 도달하 기 전까지의 전류 값은 입력 데이터로 사용하지 않고, 제1 회전속도(V1)에 도달한 때부터 전류 값을 감지하여 입력 데이터로 사용할 수 있다. 제1 회전속도(V1)는 제2 회전속도(V2)보다 느리고, 세탁조 내에서 포가 유동하는 회전속도일 수 있다. 제1 회전속도(V1)는 10rpm 내지 20rpm일 수 있다. 세탁조의 회전속도(V)가 기 설정된 제2 회전속도(V2)에 도달하면, 제어부는 현재 전류 값을 더 이상 저 장하지 않고, 현재 전류 값의 가공을 실시할 수 있다(S5 내지 S6). 여기서, 제2 회전속도(V2)가 전술한 목표 회 전속도이다. 한편, 제1 회전속도(V1)로부터 제2 회전속도(V2)로 가속되는 구간에서의 가속 기울기는 일정할 수 있다. 전류 패턴 변화 감지의 신뢰성을 높이기 위해 가속 기울기는 일정하게 유지되는 것이 바람직하다. 세탁조 내에서의 포 유동의 변화 추이가 선명하게 보일 수 있도록, 가속 기울기는 너무 높지 않아야 한다. 상기 가속 기울기는 바람직하게는 1.5 내지 2.5rpm/s이고, 더 바람직하게는 2.0rpm/s이나, 반드시 이에 한정되 어야 하는 것은 아니다. 상기 가속 기울기는 제어부에 의해 제어가 가능한 범위 내에서 최대한 작은 값을 가질 수도 있다. 상기 현재 전류 값의 가공은, 도 6에 도시된 바와 같이, 기 설정된 시점들에서 구한 현재 전류 값들(Iq)을 정해 진 알고리즘에 따라 처리하여, 인공신경망의 입력 레이어(Input Layer)의 입력 데이터(In1, In2, In3, In4,...)를 생성하는 과정이다(S6). 이러한 과정은, 현재 전류 값(Iq)들의 평균을 구하는 단계와, 구해진 평균 값들을 기 설정된 파싱 룰(Parsing Rule)에 따라 가공하여 인공신경망의 입력 데이터들을 생성하는 단계를 포함할 수 있다. 특히, 상기 파싱 룰에 의해 가공된 입력 데이터들의 개수는 평균 값들의 개수보다 적다. 도 8을 참조하면, 제어부는 전류 감지부를 통해 일정한 시간 간격으로 전류 값을 획득할 수 있다. 실시 예에서는 세탁조의 회전속도가 제1 회전속도(V1)로부터 제2 회전속도(V2)로 가속되는 구간에서 일정한 시간 간격으로 총 545개의 현재 전류 값이 구해졌다. 제어부는 이렇게 구해진 현재 전류 값들을 일정한 시간 구간마다 평균할 수 있다. 이때, 제어부는 이동 평균필터(moving average filter)를 이용할 수 있다. 이동평균은 추세의 변동을 알 수 있도록 구간을 옮겨 가면 서 평균을 구하는 것이다. 예를 들어, 현재 전류 값들을 시계열적 순서에 따라 Iq1, Iq2, Iq2 ... Iqn이라고 할 시, Iq1 부터 Iql(l<n)까지를 평균하여 M1을 구하고, Iqm(m>l)부터 Iqm+s-1(s는 각 이동 평균을 구하는데 사용 되는 Iq의 개수)까지를 평균하여 M2를 구한다. 이러한 방식으로 계속하여 구간을 옮겨가면서 이동평균들이 구해 질 수 있다. 이동 평균이 구해지는 시간 구간들을 적절하게 설정함으로써, 이동평균값들(M1, M2, ...)의 개수를 전체 현재 전류(Iq)의 개수보다 작게 할 수 있다. 다만, 시간구간(윈도우)의 길이가 길수록 현재 전류의 변화 추세에 대한 해상도(resolution)는 낮아지기 때문에 적절하게 시간 구간의 길이를 선정하여야 한다. 실시예에서, 제어부(6 0)는 이동평균필터를 이용하여 545개의 현재 전류 값(Iq)으로부터 50개의 이동 평균들을 구하였다. 제어부는 현재 전류 값과 이동 평균들을 기 설정된 파싱 룰(Parsing Rule)에 따라 처리하여 입력 데이터 (In1, In2, In3, In4 ...)를 생성할 수 있다. 파싱 룰은 구하고자 하는 특징(포량/포질)이 잘 드러나도록 최종입력 데이터가 구해지는 구간을 선정하도록 구성될 수 있다. 도 10을 참조하면, 본 발명의 실시예에서는 총 14개의 입력 데이터를 생성하였으며, 상기 입력 데이터들은, 모 터의 가속 초반에 구해지는 9개의 현재 전류 값(16 ~ 24번째 현재 전류 값: DATA1 ~ DATA9)과, 그 이후의 구 간을 기 설정한 바에 따라 구분한 각 구간에서의 5개의 평균 값(DATA10 ~ DATA14)이다. 특히, 상기 5개의 평균 값을 앞서 구한 이동 평균들을 바탕으로 구함으로써, 각 구간에서의 현재 전류 값들을 합산한 것에 비해 보다 신속하게 연산을 처리할 수 있다. 한편, 이렇게 구한 입력 데이터(In1, In2, In3, In4, ... In14)는 입력 레이 어(Input Layer)의 각 노드의 입력 값이 된다. 인공신경망을 구성하는 노드들에 부여되는 가중치(weight)와 편향치(bias)는 머신 러닝을 통해 정해진 것이고, 이러한 머신 러닝은 전류 패턴 또는 현재 전류 값들을 바탕으로 반복된 것이다. 또한, 상기 전류 패턴(또는, 현 재 전류 값)은 전술한 바와 같이 포량 및/또는 포질에 대한 특성을 반영하고 있으므로, 정확한 결과(즉, 현재 세탁조에 투입된 정확한 포량과 포질)가 도출될 때까지 기 저장된 또는 세탁기의 운전에 의해 추가된 데이터 들을 머신 러닝을 수행함으로써 개선된, 또는 정확한 가중치와 편향치를 설정할 수 있다. 이러한 방식으로 구축된 인공 지능망에서, 출력 레이어의 출력은 포량-포질 정보를 반영하고 있을 것이며, 출력 레이어(Output Layer)의 노드들 중에서 가장 큰 값을 출력하는 노드를 바탕으로, 제어부는 포량 및/또는 포 질을 결정할 수 있다. 제어부는 S6단계에서 생성된 입력 데이터들을 인공신경망에 입력하여, 출력 레이어에서의 출력으로 포량 및 /또는 포질을 구할 수 있다(S7). 그리고, 제어부는 S7단계에서 구해진 포량 및/또는 포질을 바탕으로 세탁 알고리즘을 설정하고, 설정된 바에 따라 세탁기의 작동을 제어할 수 있다(S8). 상기 세탁 알고리즘은, 급수 수 위, 세탁, 헹굼, 탈수, 건조 등의 실행 시간, 각 행정에서의 모터의 구동 패턴(예를 들어, 회전 속도, 회전 시 간, 가속도, 제동) 등을 포함할 수 있다. 도 13은 본 발명의 제1 실시예에 따른 세탁기의 제어방법을 도시한 순서도이다. 도 14는 본 발명의 제2 실시예 에 따른 세탁기의 제어방법을 도시한 순서도이다. 도 15는 본 발명의 일 실시예에 따른 세탁기의 세탁행정시 진 행될 수 있는 세탁모션을 보여주는 개략도이다. 본 발명의 일 실시예에 따른 세탁기의 제어방법은, 인공신경망(Artificial Neural Network)을 이용하여 포의 상 태를 구하는 단계를 포함한다. 이러한 포의 상태는 포의 재질과 포의 구성(부드러운(soft) 포/ 뻣뻣한(hard) 포 의 혼합비)을 바탕으로 정의될 수 있다. 포의 재질은, 뻣뻣한 정도(예를 들어, 부드러운(soft) 포/ 뻣뻣한(hard) 포), 물을 머금을 수 있는 능력(즉, 함 습율), 건포와 습포 간의 부피차 등 포의 여러 특성을 포함하는 것으로 정의될 수 있다. 또한, 상기의 포의 여러 특성들은 서로 연관된다. 청바지, 외투와 같은 포는 상대적으로 뻣뻣하고, 함습율이 낮 고, 건포와 습포 간의 부피차가 적을 수 있다. 이와 반대로 실크, 면 소재의 포는 상대적으로 부드럽고, 함습율 이 높고, 건포와 습포 간의 부피차가 클 수 있다. 즉, 포가 뻣뻣한 포일수록 함습율이 낮고, 건포와 습포 간의 부피차가 적을 수 있다. 또한, 뻣뻣한 포일수록 세탁에 의한 손상 위험이 낮고, 부드러운 포일수록 세탁에 의한 손상 위험이 높다. 또한, 뻣뻣한 포일수록, 일반적으로 사용자가 다수회 착용한 뒤 세탁을 하는 경우가 많고, 이에 따라 오염도가 심할 수 있다. 예를 들어 설명하면, 일반적으로 청바지, 외투와 같은 옷은 사용자가 여러회 착용한 후 세탁을 하는 경우가 많고, 실크나 면으로 이루어진 속옷 등은 1회만 착용한 후 세탁을 하는 경우가 많다. 따라서, 포의 상태를 반영하여 세탁 알고리즘을 구성할 필요가 있다. 보다 구체적으로는 포가 상대적으로 부드 러운 포일수록 세탁성능보다 포의 손상이 적은 세탁모드에 따라 세탁을 진행하고, 상대적으로 뻣뻣한 포일수록 포의 손상보다 세탁성능에 중점을 둔 세탁모드에 따라 세탁을 진행하여, 포의 손상을 방지하고, 세탁 성능을 향 상시킬 수 있다. 이하 도 12, 도 13 및 도 15를 참조하여 본 발명의 제1 실시예에 따른 세탁기의 제어방법을 설명한다. 세탁기는 전원이 켜지면, 세탁코스를 입력 받을 수 있는 상태로 대기하고, 입력부(미도시)를 통하여 사용자로부 터 세탁코스를 입력 받을 수 있다. 세탁기는 상기 대기 상태에서, 입력부를 통하여 사용자로부터 세탁옵션을 입 력 받을 수 있다. 세탁기는, 세탁코스 입력 및 세탁옵션 입력 후, 세탁조에 수용된 포의 양을 구한다(S10, 포량감지 단계). 포량 감지 단계(S10)는, 종래의 건포의 포량을 감지하는 방법으로 포의 양을 구할 수 있다. 포의 양을 구한 후, 인공신경망을 이용하여 포의 상태를 구하기에 앞서, 제어부는 급수밸브를 조절하여 세탁조 내로 세탁수를 공급한다(S20, 급수 단계). 세탁조에 공급하는 세탁수의 양은 포량감지 단계(S10)에서 구한 포의 양을 기초로 설정될 수 있다. 즉 포의 양이 많을수록, 많은 양의 세탁수를 공급할 수 있다. 한편, 세탁조 내로 세탁수를 공급하는 단계는, 후술하는 포의 상태를 기초로 세탁모드를 선택하는 단계 후, 각각의 세탁모드에 따라 세탁을 진행하는 세탁행정 단계의 초기에 실행될 수 있다. 또는, 포량감지 단계(S10) 후 포의 양을 기초로 세탁수를 공급하고(제1 급수단계), 후술하는 포의 상태를 판단 하는 단계 후, 세탁행정 단계의 초기에 포의 양과 포의 상태를 모두 고려하여 세탁수를 공급(제2 급수단계)할 수 있다. 이 경우, 제2 급수 단계에서 급수할 세탁수의 양이, 포의 양과 포의 상태를 고려한 세탁수의 양보다 많은 경우 초과되는 양의 세탁수를 배수할 수 있고, 적은 경우 세탁수를 보충할 수 있다. 또는, 제1 급수 단계에서 급수한 세탁수를 모두 배수한 후, 제2 급수 단계에서 포의 양과 포의 상태를 고려한 양의 세탁수를 공급할 수 있다. 이러한 경우에는, 제1 급수 단계에서는 디스펜서에 수용된 세제가 세탁조에 투입되지 않고, 제2 급수 단계에서 디스펜서에 수용된 세제가 세탁조에 투입될 수 있다. 예를 들어, 세제가 투입되는 디스펜서는 두 개의 디스펜서를 포함하거나, 하나의 디스펜서에 둘 이상의 공간 으로 구획될 수 있다. 어느 한 디스펜서(또는 디스펜서의 하나의 공간)는 애벌세탁용 세제가 투입되는 디스펜서 이고, 다른 한 디스펜서(또는 디스펜서의 다른 하나의 공간)는 본 세탁용 세제가 투입되는 디스펜서일 수 있다. 제1 급수단계에서는 세탁수가 애벌세탁용 세제가 투입되는 디스펜서를 통과하여 세탁조에 공급될 수 있고, 제2 급수단계에서는 세탁수가 본 세탁용 세제가 투입되는 디스펜서를 통과하여 세탁조에 공급될 수 있다. 포의 상태를 구하는 단계 전 급수를 할 경우, 동일한 구성의 포를 투입할 때, 일관된 전류패턴이 도출되어, 포 의 상태를 보다 정확하게 판단할 수 있다. 세탁수를 공급한 후, 포를 적시는 포 적심 단계(S30)가 진행된다. 상기 포 적심 단계(S30)는 인공신경망을 이용 한 포질/포량 판단의 정확도를 높이기 위한 단계이다. 세탁조에 세탁수가 급수된 초기에는, 세탁조에 수 용된 포 중 일부는 과도하게 물을 머금고 있을 수 있고, 다른 일부는 물에 젖지 않은 상태일 수 있다. 이러한 상태에서 세탁조를 가속시키며 모터에 인가되는 전류 값(Iq)은 동일한 포량/포질이라 하더라도 측정하는 때에 따라 서로 다른 전류 값으로 감지될 수 있다. 따라서, 상기 포 적심 단계(S30)는 세탁조에 세탁수가 급수된 상태로 일정시간 대기하거나, 세탁조를 회 전시켜 포를 골고루 적실 수 있다. 또한, 세탁기가 저수조에 저장된 물을 순환시키는 순환펌프(미도시)와 순 환노즐(미도시)을 구비한 경우, 세탁수를 순환시켜 효율적으로 포를 적실 수 있다. 본 발명의 제1 실시예에 따른 세탁기의 제어방법은, 인공신경망을 이용하여 포의 상태를 구하는 제1 감지 단계 (S40~S70)를 포함한다. 제1 감지 단계(S40~S70)는 세탁조가 가속 회전되는 중에 세탁조를 회전시키는 모 터에 인가되는 전류 값(Iq)을 머신 러닝(machine learning)으로 기학습된 인공신경망(Artificial Neural Network)의 입력 레이어(Input layer, 도 7 참조)의 입력 데이터로 하여 상기 인공신경망의 출력 레이어(Output layer, 도 7 참조)에서의 출력으로 상기 포의 상태를 판단한다. 제1 감지 단계(S40~S70)는 상기 전류 값(Iq)을 상기 인공신경망의 입력 레이어의 입력 데이터로 하여 상기 인공 신경망의 출력레이어의 출력으로 세탁조에 수용된 포의 상태 및 포의 양을 구할 수 있다. 포 적심 단계(S30) 후, 도 12를 참조하여 설명한 S1 내지 S7과 동일한 S40 내지 S70 단계를 거쳐 포의 양과 포 의 상태를 구할 수 있다. 즉, S40은 S1, S2 및 S3를 포함하고, S50은 S4 및 S5를 포함하고, S60은 S6과 동일하 고, S70은 S7과 동일한 단계이다. 제1 감지 단계(S40~S70)는 세탁조(또는, 모터)를 가속하는 단계(S40, 제1 가속 단계)와, 세탁조가 가 속 회전되는 구간(제1 가속 구간)에서 모터에 인가되는 전류 값(Iq, 제1 전류 값)을 구하는 단계(S50)와, 상 기 전류 값(Iq)을 상기 인공신경망의 입력 레이어의 입력 데이터로 하여(S60) 상기 인공신경망의 출력 레이어에 서의 출력으로 포의 양 및 포의 상태를 판단하는 단계(S70)를 포함한다. 세탁조를 가속하는 단계(S40)는 모터(또는, 세탁조)의 회전속도(V)를 감지하는 단계를 포함한다. 상기 세탁조를 가속하는 단계(S40)는 세탁조를 제1 회전속도(V1)부터 상기 제1 회전속도(V1)보다 빠른 제2 회 전속도(V2)까지 가속 회전하는 단계를 포함한다. 세탁조를 가속하는 단계(S40)는 세탁조의 회전속도(V)를제1 회전속도(V1)부터 제2 회전속도(V2)까지 일정한 가속도로 가속시키는 단계를 포함할 수 있다. 즉, 제어부 는 모터를 제1 회전속도(V1)부터 제2 회전속도(V2)까지 가속할 때, 일정한 가속도로 가속시킬 수 있다. 상기 포의 양 및 포의 상태를 판단하는 단계는(S60, S70) 세탁조의 회전속도(V)가 제1 회전속도(V1)부터 제2 회전속도(V2)까지 가속되는 구간에서 모터에 인가되는 전류 값(Iq)을 인공신경망의 입력 레이어의 입력 데이 터로 사용하는 단계를 포함한다. 보다 구체적으로는, 포의 양 및 포의 상태를 구하는 단계(S60, S70)는, 상기 감지된 속도 값을 바탕으로 S70에서 구한 전류 값 중 모터의 회전속도(V)가 제1 회전속도(V1)부터 제2 회전속도 (V2)까지 가속되는 구간에 해당하는 전류 값을 선택하는 단계와, 상기 선택된 전류 값을 인공신경망의 입력 레 이어의 입력 데이터로 사용하는 단계를 포함할 수 있다. 본 발명의 제1 실시예에 따른 세탁기의 제어방법은, 제1 감지 단계(S40~S70) 후, 복수의 세탁모드 중 제1 감지 단계에서 구한 포의 상태를 기초로 어느 하나의 세탁모드를 선택하는 단계(S80)를 포함할 수 있다. 상기 세탁모 드를 선택하는 단계(S80)는 포의 상태 및 포의 양을 기초로 어느 하나의 세탁모드를 선택할 수 있다. 상기 포의 양은 포량감지 단계(S10)에서 구한 포량일 수 있다. 또는 상기 포의 양은 제1 감지 단계(S40~S70)에서 구한 포 량일 수도 있다. 상기 포의 상태는, 포의 뻣뻣한 정도를 고려하여 분류될 수 있다. 상기 제1 감지 단계는, 포의 상태를 포의 뻣 뻣한 정도를 고려하여 분류된 복수의 포질 단계(표 2 참조) 중 어느 하나의 포질 단계로 판단할 수 있다. 상기 복수의 세탁모드(S91 내지 S95)는, 포의 마모도(이하, 포의 손상이라고도 함) 및/또는 세탁 강도를 고려하 여 분류될 수 있다. 본 실시예에서 복수의 세탁모드는 전술한 제1 내지 제5 세탁모드(S91 내지 S95)를 포함할 수 있다. 제어부는 뻣뻣한 포일수록 세탁성능에 중점을 둔 세탁모드를 선택하고, 부드러운 포일수록 포의 손상이 적 은 세탁모드를 선택할 수 있다. 세탁성능 및 포 마모도에 영향을 미치는 인자(이하 '세탁영향인자' 라고 함)는 세탁조의 세탁 모션(또는 세탁조 의 회전속도), 급수량, 급수 온도, 세탁행정 시간, 세탁 실동율 및 순환 실동율을 포함할 수 있다. 이하, 세탁 모드에 따른 세탁행정시 세탁영향인자에 대하여 설명한다. 세탁행정시 세탁조의 회전속도는 30rpm 내지 60rpm의 범위 내일 수 있다. 세탁조의 회전속도가 너무 느리 면 세탁조의 회전에 따른 세탁물의 유동이 적어 만족할 만한 세탁성능을 얻을 수 없다. 또한, 세탁조의 회전속도를 높일수록 세탁물은 원심력에 의하여 드럼의 내측면에 붙어 점점 높은 위치에서 낙하하게 되고, 원심력이 중력보다 큰 회전속도에서는 드럼의 내측면에 붙어 낙하하지 않게 된다. 이를 필트레이션 모션이 라 한다. 세탁행정시 세탁조의 회전속도는 세탁물을 유동시켜 만족할 만한 세탁성능을 얻기 위해 적어도 30rpm 이상의 회전속도로 세탁조를 회전시킬 수 있다. 또한, 필트레이션 모션은 탈수행정에 적합한 모션으로, 세탁행정시에는 마찰, 굴신 및 낙하에 의한 기계력을 세 탁물에 충분히 전달하기 어렵다. 따라서 세탁행정시 필트레이션모션이 구현되는 회전속도보다 느리게 회전시켜 야 하고, 일반적으로 60rpm 이상의 회전속도에서 원심력이 중력보다 클 수 있다. 따라서 세탁행정시 세탁조 의 회전속도는 60rpm보다 작을 수 있다. 제어부는 포질 및/또는 포량에 따라 결정된 세탁모드에 따라 모터를 통하여 세탁조의 회전속도를 제 어할 수 있다. 제어부는 뻣뻣한 포일수록 세탁성능에 중점을 둔 세탁행정을 수행하고, 부드러운 포일수록 포의 손상이 적은 세탁모드를 수행하도록 세탁조의 회전속도를 세탁모드에 따라 제어할 수 있다. 도 15를 참조하여, 상기 세탁모드에 따른 세탁행정시 진행되는 세탁모션에 대하여 설명한다. 도 15(a)는 롤링모 션(rolling motion), 도 15(b)는 텀블링모션(tumbling motion), 도 15(c)는 스윙모션(swing motion)을 나타낸 다. 제어부는 모터(또는, 세탁조)의 회전속도 및 회전방향을 제어할 수 있다. 이를 통해 제어부는 세 탁행정 시 다양한 세탁모션을 구현할 수 있다. 상기 롤링모션은 세탁조가 일방향으로 회전하면서 드럼 내측면에 있는 포가 세탁조의 회전방향 약 90 도 미만의 위치에서 드럼의 최저점으로 낙하하는 모션이다. 상기 롤링모션은, 세탁조가 일방향으로 회전하고, 예를 들어 세탁조가 시계방향으로 회전될 시 포가 드럼 의 3사분면에서 지속적으로 구르는 형태의 유동을 하는 세탁모션이다. 상기 텀블링모션은 세탁조가 일방향으로 회전하면서 드럼 내측면에 있는 포가 세탁조의 회전방향 약 90도 내지 110도 위치에서 드럼의 최저점으로 낙하하는 모션이다. 상기 텀블링모션은 세탁조가 일방향으 로 회전하고, 예를 들어 세탁조가 시계방향으로 회전될 시 포가 드럼의 3사분면으로부터 2사분면으로 상승 한 뒤 드럼 내측면에서 벗어나 드럼의 최저점방향으로 낙하하고, 다시 상승한 후 낙하하는 유동을 지속 적으로 반복하는 세탁모션이다. 상기 텀블링 모션에서 세탁조의 회전속도는 상기 롤링모션에서 세탁조의 회전속도보다 빠른 속도이다. 따 라서, 포에 작용하는 원심력이 커지고, 보다 높은 위치에서 포가 낙하하게 된다. 상기 스윙모션은 세탁조가 양방향으로 회전(즉, 일방향 및 다른방향으로 교대로 회전)하면서, 드럼의 내 측면에 있는 포가 회전방향 약 90도 미만의 위치에서 낙하하는 모션이다. 보다 상세하게는, 세탁조가 반시계 방향으로 회전하다가 포가 드럼의 반시계방향 약 90도의 위치에 도달 하기 전 정지하고, 포는 드럼의 반시계방향 약 90도 미만의 위치에서 드럼의 최저점 방향으로 낙하한다. 이 후, 세탁조가 시계방향으로 회전하다가 포가 드럼의 시계방향 약 90도의 위치에 도달하기 전 정지하고, 포는 드럼의 시계방향 약 90도 미만의 위치에서 드럼의 최저점 방향으로 낙하한다. 세탁 조가 이러한 반시계방향 회전 및 시계방향 회전을 교대로 반복한다. 상기 스윙모션은 세탁조가 양방향으로 교대로 회전하여 포에 작용하는 힘의 방향이 지속적으로 변하고, 포가 유동하는 시간이 다른 모션에 비해 짧기 때문에 다른 세탁모션에 비해 포의 손상이 적다. 텀블링모션은 프론트 로드 타입의 세탁기의 세탁행정에서 일반적으로 사용되는 모션으로, 스윙모션에 비해 세탁 성능이 높고, 포의 손상 가능성도 높다. 한편, 일정범위의 회전속도 구간(예를 들어 30rpm 내지 60rpm)에서, 드럼이 회전함에 따라 포가 세탁조 내에서 유동하고, 포가 유동하며 세탁이 진행된다. 세탁을 위해 포에 작용하는 힘은, 포가 유동하면서 포가 접 혔다 펴지며 작용하는 굴신력, 포 상호간 또는 포와 드럼의 내측면 사이에 발생하는 마찰력 및 포가 상승하 였다가 낙하하면서 작용하는 충격력으로 대별된다. 롤링모션은 상기 마찰력 및 굴신력이 상기 충격력보다 크게 작용하고, 텀블링 모션은 상기 충격력이 상기 마찰 력 및 굴신력보다 크게 작용한다. 일반적으로, 충격력에 비해 마찰력 및 굴신력에 의한 세탁이 성능이 높다. 따라서, 롤링모션은 텀블링모션에 비해 세탁성능이 높다. 다만, 텀블링모션은 포가 상승 후 낙하하면서 섞이게 되는데 비해, 롤링모션은 포에 작용하는 힘의 방향이 한 방향으로 지속적으로 유지되어 스윙모션 및 텀블링 모 션에 비해 포의 손상 가능성 또한 높다. 세탁모드는, 포의 상태를 기초로 세탁조의 회전속도가 설정될 수 있다. 상기 세탁모드는, 상기의 세탁모션과 세 탁성능 및 포 마모도의 관계를 고려하여, 뻣뻣한 포일수록 세탁조의 회전속도를 느리게 설정하여 롤링모션을 진 행하고, 부드러운 포일수록 세탁조의 회전속도를 빠르게 설정하여 텀블링모션을 진행할 수 있다. 본 발명의 일 실시예에 따른 세탁기는, 저수조내에 저장된 물의 양을 감지하는 수위센서(미도시)를 포함할 수 있다. 제어부는 급수밸브를 조절하여 저수조내로 급수되는 물의 양을 제어할 수 있다. 저수조 내로 급수하는 물의 양은 수위로 판단할 수 있고, 상기 수위는 저수조에 구비된 수위센서로 판단할 수 있다. 수 위센서는 수위가 높을수록 낮은 주파수를 나타내며, 수위센서에 대한 기술은 이미 공지된 기술인바, 자세한 설 명은 생략하도록 한다. 일반적으로 세탁기는 세탁물의 양이 많을수록 세탁물이 충분히 적셔질 수 있도록 많은 양의 물을 급수한다. 따 라서, 메모리에는 세탁물의 양이 많을수록 저수조 내로 많은 양의 물을 급수하도록 기 설정된 기준 급수 량의 데이터가 저장될 수 있다. 포량뿐만 아니라 포질에 따라 세탁수위를 달리할 수 있다. 부드러운 옷감은 일반적으로 함습율이 높기 때문에 많은 양의 물을 급수할 필요가 있다. 또한 부드러운 옷감은 세탁물의 손상이 쉽게 일어나므로, 세탁할 경우 세 탁수위를 높게 하면 포와 드럼의 내측면 사이에 발생하는 마찰력을 줄일 수 있다. 따라서, 제어부는 포의 상태에 따라 급수량을 조절할 수 있고, 포가 뻣뻣한 포일수록 상기 기준 급수량보다 적은 양의 세탁수를 공급할 수 있다.이하, 표2 및 표3을 참조하여 예를 들어 설명한다. 상기 기준 급수량은 포량 단계가 1레벨에서 5레벨로 갈수록 많은 양으로 설정될 수 있다. 포질 단계가 1 레벨인 경우 세탁조에 급수하는 세탁수의 양은, 상기 기준급수 량의 급수를 한 경우보다 수위센서의 수위주파수가 제1 급수편차만큼 작게 감지되도록 상기 기준 급수량보다 많 은 양으로 급수량이 설정될 수 있다. 포질 단계가 2 레벨인 경우 상기 기준급수량의 급수를 한 경우 보다 상기 수위주파수가 제2 급수편차만큼 작게 감지되도록 상기 기준 급수량보다 많은 양으로 설정될 수 있다. 또한, 상기 제1 급수편차는 제2 급수편차보다 클 수 있다. 이와 반대로, 포질 단계가 4, 5레벨인 경우 세탁조 에 급수하는 세탁수의 양은, 기준 급수량을 급수한 때보다 각각 제4, 5 급수편차만큼 크게 감지되도록, 상기 기준 급수량보다 적게 설정될 수 있고, 상기 제4 급수 편차는 제5 급수편차보다 작을 수 있다. 또한, 포질 단계가 3레벨인 경우 세탁조에 급수하는 세탁수의 양은 기준급수량과 동일한 양으로 설정될 수 있다. 본 발명의 일 실시예에 따른 세탁기는, 저수조에 저장된 세탁수의 온도를 조절하는 히터(미도시)를 더 포함 할 수 있다. 제어부는 히터를 제어하여, 세탁수의 온도를 조절할 수 있다. 다르게는, 급수밸브는 외부수원으로부터 저수조로 냉수의 유입을 조절하는 냉수 급수밸브(미도시) 및 외 부수원으로부터 저수조로 온수의 유입을 조절하는 온수 급수밸브(미도시)를 포함할 수 있고, 제어부는 냉수 급수밸브(5a)와 온수 급수밸브(5b)를 조절하여 저수조 내로 급수되는 물의 온도를 제어할 수 있다. 제어부는 포의 상태를 기초로 저수조에 저장된 세탁수의 온도를 설정할 수 있다. 급수되는 물의 온도가 높을수록 세제의 화학작용에 유리하여 세탁성능이 향상될 수 있다. 다만, 부드러운 옷감의 경우 급수되는 물의 온도가 높을수록 포의 손상 위험이 클 수 있다. 따라서, 상기 세탁수의 온도는, 포의 상태가 뻣뻣한 포일수록 높은 온도로 설정될 수 있다. 세탁행정 시간은, 일반적으로 포량이 많을수록 길게 설정될 수 있다. 메모리에는 포량이 많을수록 길게 설 정된 기준 시간 데이터가 저장될 수 있다. 포량뿐만 아니라 포의 상태에 따라 세탁행정 시간을 달리할 수 있다. 세탁행정 시간이 길수록 포에 작용하는 마 찰력, 낙차에 의한 충격력 등 기계력이 많이 부여되고, 세탁성능이 좋아진다. 다만, 세탁행정 시간이 길수록 세 탁물에 가해지는 기계력에 의해 포 손상이 많이 일어난다. 따라서, 세탁행정 시간은 포의 상태가 뻣뻣한 포일수록 포의 양에 따라 설정된 기준 시간에 비해 길게 설정되고, 포의 상태가 부드러운 포일수록 상기 기준 시간에 비해 짧게 설정될 수 있다. 예를 들어, 포질 단계가 3레벨인 경우 세탁행정 시간은 포량을 기초로 설정된 기준 시간으로 설정되고, 포질 단 계가 1레벨인 경우 기준 시간보다 짧게 설정되고, 2레벨인 경우 기준 시간보다 짧게 설정되되, 기준 시간과의 편차는 1레벨인 경우에 비해 작게 설정될 수 있다. 포질 단계가 4레벨인 경우 기준 시간보다 길게 설정되고, 5 레벨인 경우 기준 시간보다 길게 설정되되, 기준 시간과의 편차는 4레벨인 경우에 비해 크게 설정될 수 있다. 모터의 운전이 오랜시간 지속될 경우, 과부하로 인하여 모터의 온도가 상승할 수 있고, 이는 모터의 수명 단 축을 야기할 수 있다. 또한, 세탁물에 지속적인 힘이 가해져 세탁물의 손상 정도가 심해질 수 있다. 따라서, 제 어부는 세탁행정이 진행되는 중, 모터의 운전을 소정시간 일시정지 시킨 후, 다시 운전되도록 제어할 수 있다. 제어부는 세탁레벨이 높은 레벨일수록 세탁 실동율이 커지도록 상기 모터를 제어할 수 있다. 실동율이라 함은, 모터의 운전시간 및 모터의 운전이 일시정지된 시간을 합한 시간에 대한 상기 모터의 운전시간 의 비율을 의미한다. 후술하는 순환 실동율과의 구별을 위해 이하 세탁 실동율이라 한다. 즉, 세탁 실동율은, 세탁행정 시간 대비 모터가 작동하는 시간의 비율을 의미하고, 순환 실동율은, 세탁행정 시간 대비 순환펌프가 작동하는 시간의 비율을 의미한다. 세탁 실동율이 클수록 동일한 세탁행정 시간 대비 세탁물에 마찰력, 낙차에 의한 힘등의 기계력을 부여하는 시 간이 길어지고, 따라서 세탁성능은 향상되고, 세탁물의 손상 정도는 심해질 수 있다. 따라서, 세탁모드는, 포의 상태가 뻣뻣한 포일수록 세탁 실동율이 크게 설정될 수 있다. 본 발명의 일 실시예에 따른 세탁기는, 저수조에 저장된 물이 순환되도록 물을 펌핑하는 펌프 및 상기 펌프에 의해 펌핑된 물을 세탁조내로 분사하도록 구성된 노즐(미도시)을 포함할 수 있다. 펌프는 배수관과 연결되어 배수펌프의 기능을 하고, 순환관을 통해 노즐과 연결되어 순환펌프의 기능을 할 수 있다. 제어부는 세탁행정 시 저수조로부터 배출된 물이 노즐을 통하여 세탁조 내로 분사되도록 펌프를 제어할 수 있다. 제어부는 세탁행정이 진행되는 중에 펌프가 운전 또는 정지되도록 제어할 수 있다. 순환 실동율이 높을 수록 세탁물이 세제가 용해된 물에 많이 적셔질 수 있고, 세제의 화학작용에 의해 세탁성능이 향상될 수 있다. 따라서, 세탁모드는, 포의 상태가 뻣뻣한 포일수록 순환 실동율이 크게 설정될 수 있다. 한편, 도 13을 참조하면, 본 발명의 제1 실시예에 따른 세탁기의 제어방법은, 선택된 세탁모드(S91 내지 S95 중 어느 하나)에 따라 세탁을 수행하는 세탁행정 단계(S90)를 포함한다. 제어부는 모터를 제어하여 각각의 세탁모드별로 설정된 세탁모션, 세탁조의 회전속도에 따라 세탁행정을 실행할 수 있다. 또한, 제어부는 모터, 급수밸브, 펌프를 제어하여, 세탁모드별로 설정된 세탁수 의 양, 급수되는 세탁수의 온도, 세탁행정 시간, 세탁 실동율 및 순환 실동율에 따라 세탁행정을 실행할 수 있 다. 전술한 세탁모드에 대한 설명은, 각각의 포량/포질 단계별로 서로 다른 알고리즘이 설정된 세탁모드를 예로 들 고 있다. 이와 달리, 일부 포량/포질 단계가 세탁모드를 공유하고, 다른 일부 포량/포질 단계는 다른 세탁모드 를 공유할 수도 있다. 이하, 표 3을 참조하여 포의 양 및 포의 상태를 기초로 세탁모드를 선택하고(S80), 선택 된 세탁모드에 따라 세탁을 수행(S90)하는 방법의 일 예를 설명한다. 표 3 포량 포질1 레벨 2 레벨 3 레벨 4 레벨 5 레벨 1 레벨 제1 세탁모드 제2 세탁모드 2 레벨 3 레벨 제3 세탁모드 제4 세탁모드 4 레벨 5 레벨 제5 세탁모드 표 1 내지 3을 참조하면, 포질이 1레벨(제1 포질 단계) 또는 2레벨(제2 포질 단계)이고, 포량이 1 내지 3 레벨 인 경우, 제어부는 제1 세탁모드(S91)를 선택할 수 있다. 또한, 포질이 1레벨 또는 2레벨이고, 포량이 4 내지 5 레벨인 경우, 제어부는 제2 세탁모드(S92)를 선택할 수 있다. 표 2를 참조하면, 포의 상태가 1, 2 레벨인 경우, 세탁조에 투입된 포는 세탁에 의해 마모되기 쉬운 부드러 운 소재의 옷감으로, 포가 손상되지 않는 세탁 알고리즘에 따라 세탁을 수행할 필요가 있다. 또한, 이러한 소재 의 옷감은 상대적으로 오염이 적은 경우가 많기 때문에 상대적으로 높은 세탁성능을 요구하지 않는다. 따라서, 제1 세탁모드(S91)는 다른 세탁모드와 비교할 때 상대적으로 세탁물 손상이 적은 세탁모션이 구현되는 회전속도로 세탁조를 회전시킬 수 있다. 또한, 제1 세탁모드(S91)는 상대적으로 낮은 세탁수의 온도, 짧은 세탁 행정 시간, 낮은 세탁 실동율 낮은 순환 실동율로 세탁 알고리즘이 설정될 수 있다. 상기 세탁 실동율은, 세탁 행정 시간 대비 모터가 작동하는 시간의 비율을 의미하고, 상기 순환 실동율은, 세탁행정 시간 대비 순환펌프가 작동하는 시간의 비율을 의미한다. 또한, 제1 세탁모드는, 포의 양에 따라 설정된 기준 급수량에 비해 더 많은 양의 세탁수를 공급하도록 설정될 수 있다. 제1 세탁모드가 선택되면, 제1 세탁모드의 알고리즘에 따라 세탁을 수행한다(S91). 포의 상태가 1, 2 레벨이나, 포의 양이 많은 경우(4, 5 레벨), 제어부는 제2 세탁모드(S92)를 선택할 수 있 다. 제2 세탁모드는 제1 세탁모드와 비교할 때, 많은 양의 포를 세탁하기에 적합한 알고리즘으로 설정될 수 있 다. 제2 세탁모드를 제1 세탁모드와 동일한 세탁 알고리즘으로 설정하여 세탁을 수행할 경우, 포의 양이 많아 세탁 성능이 떨어질 수 있다. 따라서, 제2 세탁모드는 제1 세탁모드에 비해 상대적으로 세탁성능이 높은 세탁모션이 구현되는 회전속도로 세탁조를 회전시킬 수 있다. 또한, 제2 세탁모드는 제1 세탁모드에 비해 상대적으로 높은 세탁수의 온도, 긴 세탁행정 시간, 높은 세탁 및 순환 실동율로 세탁 알고리즘이 설정될 수 있다. 제2 세탁모드는, 포의 양에 따라 설정된 기준 급수량에 비해 더 많은 양의 세탁수를 공급하도록 설정될 수 있다. 또한, 제2 세탁모드의 기준 급수량은 제1 세탁모드의 기준 급수량보다 많을 수 있고, 이에 따라, 제1 세 탁모드보다 많은 양의 세탁수를 공급하도록 설정될 수 있다. 제2 세탁모드가 선택되면, 제2 세탁모드의 알고리즘에 따라 세탁을 수행한다(S92). 포의 상태가 3, 4 레벨(제3, 4 포질 단계)인 옷감은 포의 상태가 1, 2 레벨인 옷감에 비하여 세탁에 의한 손상 우려가 적고, 상대적으로 오염이 심할 수 있다. 따라서, 제3 세탁모드는 제1, 2 세탁모드와 비교할 때 상대적으 로 세탁성능이 높은 세탁모션이 구현되는 회전속도로 세탁조를 회전시킬 수 있다. 또한, 제3 세탁모드는 제1, 2 세탁모드와 비교할 때 상대적으로 높은 세탁수의 온도, 긴 세탁행정 시간, 높은 세탁 및 순환 실동율로 세탁 알 고리즘이 설정될 수 있다. 또한, 제1 세탁모드에 비하여 더 적은 양의 세탁수를 공급하도록 알고리즘이 설정될 수 있다. 제3 세탁모드가 선택되면, 제3 세탁모드의 알고리즘에 따라 세탁을 수행한다(S93). 포의 상태가 3, 4 레벨이나, 포의 양이 많은 경우(4, 5 레벨), 제어부는 제4 세탁모드를 선택할 수 있다. 제4 세탁모드는 제3 세탁모드와 비교할 때, 많은 양의 포를 세탁하기에 적합한 알고리즘으로 설정될 수 있다. 제2 세탁모드에서 설명한 것과 동일한 이유로, 제4 세탁모드는 제3 세탁모드에 비해 상대적으로 세탁성능이 높 은 세탁모션이 구현되는 회전속도로 세탁조를 회전시킬 수 있다. 또한 제4 세탁모드는 제3 세탁모드에 비해 상 대적으로 높은 세탁수의 온도, 긴 세탁행정 시간, 높은 세탁 및 순환 실동율로 세탁 알고리즘이 설정될 수 있다. 또한, 제2 세탁모드에 비하여 더 적은 양의 세탁수를 공급하도록 알고리즘이 설정될 수 있다. 제4 세탁모드가 선택되면, 제4 세탁모드의 알고리즘에 따라 세탁을 수행한다(S94). 포의 상태가 5 레벨(제5 포질 단계)인 경우, 세탁조에 투입된 포는 세탁에 의한 포 손상을 우려하지 않아도 되는 질긴 소재의 옷감이다. 따라서, 포의 상태가 5 레벨인 경우, 제어부는 포량과 관계없이 제5 세탁모드 로 선택할 수 있다. 제5 세탁모드는 다른 세탁모드에 비해 세탁성능이 우수한 세탁 알고리즘이 설정될 수 있다. 제5 세탁모드는 다른 세탁모드에 비하여 세탁성능이 높은 세탁모션이 구현되는 회전속도로 세탁조를 회전시킬 수 있다. 또한, 제5 세탁모드는 다른 세탁모드에 비하여 높은 세탁수의 온도, 긴 세탁행정 시간, 높은 세탁 및 순환 실동율로 세탁 알고리즘이 설정될 수 있다. 또한, 기준 급수량에 비하여 적은 양의 세탁수를 공급하도록 설정될 수 있고, 기준 급수량과 공급하는 세탁수의 양의 차이가 다른 세탁모드에 비하여 더 크도록 알고리즘이 설정될 수 있다. 제5 세탁모드가 선택되면, 제5 세탁모드의 알고리즘에 따라 세탁을 수행한다(S150). 전술한 세탁모드에 대한 설명은 이해를 돕기 위한 일 예시이다. 선택된 세탁모드에 따른 세탁행정(S90)이 종료된 후, 세탁수의 배수(S100), 포량 및/또는 포의 상태를 기초로 행정시간이 설정된 헹굼행정(S110)과 탈수행정(S120)이 수행될 수 있다. 도 12, 도 14를 참조하여, 본 발명의 제2 실시예에 따른 세탁기의 제어방법을 설명한다. 본 발명의 제2 실시예에 따른 세탁기의 제어방법은, 전술한 제1 실시예에 따른 세탁기의 제어방법과 인공신경망 을 이용하여 포의 상태를 판단하는 단계를 복수회 실시하고, 복수회 판단한 포의 상태를 기초로 최종적으로 포 의 상태를 구하는 점에서 차이가 있다. 즉, 본 실시예에서 포량감지 단계(S210), 급수단계(S220) 및 포적심 단계(S230)은 각각 S10, S20 및 S30과 동일 하고, 제1 감지 단계(S240)는 S40 내지 S70단계와 동일하다. 본 발명의 제2 실시예에 따른 세탁기의 제어방법은, 제1 감지 단계(S240) 후, 인공신경망을 이용하여 세탁조 에 수용된 포의 상태를 재차 판단하는 제2 감지 단계(S250)를 더 포함한다. 제2 감지 단계(S250)는, 제1 감지 단계(S240) 후, 제1 감지 단계와 동일한 구성의 알고리즘에 따라 포의 상태를 재차 판단하는 단계이다. 즉, 제2 감지 단계(S250)는, 세탁조를 가속 회전하는 제2 가속 단계와, 상기 제2 가속 단계에서 세탁조가 가속회전되는 제2 가속 구간에서 상기 모터에 인가되는 제2 전류 값을 구하는 단 계와, 상기 제2 전류 값을 상기 인공신경망의 입력 데이터로 하여 상기 인공신경망의 출력 레이어에서의 출력으 로 상기 포의 상태를 판단하는 단계를 포함한다. 본 발명의 제2 실시예에 따른 세탁기의 제어방법은, 제2 감지 단계(S250) 후, 상기 제1 감지 단계(S240)에서 판 단한 포의 상태인 제1 포질과 상기 제2 감지 단계에서 판단한 포의 상태인 제2 포질을 바탕으로 상기 포의 상태 를 구하는 단계(S260)를 포함할 수 있다. 이하, 표 2 및 아래 표 4를 참조하여, 제1, 2 포질을 바탕으로 포의 상태를 구하는(S260) 방법을 설명한다. 표 4 포질 평균 1 1.52 2.53 3.54 4.55 최종 판단 1 1 2 2 3 3 4 5 5 제1 감지 단계에서 판단한 제1 포질이 1레벨(제1 포질 단계)이고, 제2 감지 단계에서 판단한 제2 포질이 1레벨 인 경우, 포질 평균은 1레벨이라할 수 있다. 제1 포질이 1레벨이고, 제2 포질이 2레벨(제2 포질 단계)인 경우, 포질 평균은 1.5레벨이라할 수 있다. 이와 같이 제1, 2 포질의 산술평균을 포질 평균으로 정의할 수 있다. 표 4를 참조하면, 포질 평균이 1.5레벨인 경우, 즉 한번의 감지 단계에서 포의 상태를 1레벨로 판단하고, 다른 한번의 감지 단계에서 포의 상태를 2레벨로 판단한 경우, 세탁조에 수용된 포는 세탁성능보다 포의 마모도에 중점을 두어야 하는 포이다. 따라서, 이러한 경우에는 최종적으로 제1 포질 단계로 판단한다. 이와 마찬가지로, 포질 평균이 2.5레벨인 경우 제2 포질 단계로 판단한다. 또한, 한번의 감지 단계에서 포의 상태를 2레벨로 판단하고, 다른 한번의 감지 단계에서 포의 상태를 5레벨로 판단할 경우, 포질 평균은 3.5레벨이다. 이러한 경우 중에는, 포의 상태는 2레벨인 경우가 있다. 이러한 포를 제5 포질 단계에 기초하여 설정된 세탁모드에 따라 세탁을 수행할 경우, 포가 손상될 수 있다. 세탁성능이 부족한 문제는 재 세탁을 통해 해결 가능하지만, 포가 손상되는 문제는 해결하기 쉽지 않다. 따라서, 포질 평균이 3.5레벨인 경우 제3 포질 단계로 판단한다. 한편, 포질 평균이 4.5레벨인 경우, 즉 한번의 감지 단계에서 포의 상태를 4레벨로 판단하고 다른 한번의 감지 단계에서 포의 상태를 5레벨로 판단한 경우, 세탁조에 수용된 포는 포의 마모도보다 세탁성능에 중점을 두어 야 포이다. 따라서, 이러한 경우에는 최종적으로 제5 포질 단계로 판단한다. 이러한 방식으로, 포의 마모도에 중점을 두어야 하는 경우 소수점을 버리고, 세탁성능에 중점을 두어야 하는 경 우 소수점을 올려 최종 포의 상태를 판단할 수 있다. 제1, 2 포질을 바탕으로 구한 포의 상태에 따라 세탁모드를 선택(S280)하고, 선택된 세탁모드에 따라 세탁을 수 행한다(S290). 선택된 세탁모드에 따른 세탁행정(S290)이 종료된 후, 세탁수의 배수(S300), 포량 및/또는 포의 상태를 기초로 행정시간이 설정된 헹굼행정(S310)과 탈수행정(S320)이 수행될 수 있다. 이상의 설명은 세탁조가 실질적으로 수평한 축을 중심으로 회전되는 프론트 로드(front load) 방식을 예로 든 것이나, 본 발명의 세탁기와 그의 제어방법은 탑 로드(top load) 방식에도 전용이 가능하다. 한편, 본 발명의 실시예에 따른 세탁기의 제어방법은, 프로세서가 읽을 수 있는 기록매체에 프로세서가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 프로세서가 읽을 수 있는 기록매체는 프로세서에 의해 읽힐 수 있는 데 이터가 저장되는 모든 종류의 기록장치를 포함한다. 프로세서가 읽을 수 있는 기록매체의 예로는 ROM, RAM, CD- ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있으며, 또한, 인터넷을 통한 전송 등과 같은 캐리 어 웨이브의 형태로 구현되는 것도 포함한다. 또한, 프로세서가 읽을 수 있는 기록매체는 네트워크로 연결된 컴 퓨터 시스템에 분산되어, 분산방식으로 프로세서가 읽을 수 있는 코드가 저장되고 실현될 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2019-0096303", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정되지 아니하며, 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에 서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다. 부호의 설명4 : 세탁조 5 : 급수밸브 9 : 모터 11 : 펌프 42 : 드럼 60 :제어부 61 : 포량/포질 학습모듈 62 : 포량/포질 인식모듈 71 : 모터구동부 74 : 속도감지부 75 : 전류감지부 76 : 메모리"}
{"patent_id": "10-2019-0096303", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 세탁기의 단면도이다. 도 2는 도 1의 세탁기의 주요 구성들 간의 제어 관계를 나타내는 블록도이다. 도 3은 포의 상태와 부하량(포량)에 따른 모터에 인가되는 전류 패턴을 도시한 것이다. 도 4는 포질별 전류 패턴을 도시한 것이다. 도 5는 모터의 속도를 기 설정된 방법으로 제어하면서, 부하별 전류 패턴을 도시한 것이다. 도 6은 전류 감지부에 의해 구해진 현재 전류 값들을 인공신경망의 입력 데이터로 처리하는 과정을 도시한 것이다. 도 7은 인공신경망의 일례를 도시한 개요도이다. 도 8은 모터의 현재 전류 값을 이용하여 포량 및 포질을 판단하는 과정을 학습과정과 인식과정으로 구분하여 표 시한 개요도이다. 도 9는 전류 감지부에 의해 감지된 현재 전류 값을 도시한 그래프(a)와, 이동평균필터를 처리하여 구한 평균 값 들을 도시한 그래프(b)이다. 도 10은 전류 감지부에 의해 감지된 전류 값들을 도시한 그래프이다. 도 11은 도 9에 도시된 그래프의 전류 값들을, 인공신경망의 입력 데이터로 사용하기 위해 처리한 값들을 도시 한 그래프이다. 도 12는 본 발명의 일 실시예에 따른 세탁기의 제어방법을 도시한 순서도이다. 도 13은 본 발명의 제1 실시예에 따른 세탁기의 제어방법을 도시한 순서도이다. 도 14는 본 발명의 제2 실시예에 따른 세탁기의 제어방법을 도시한 순서도이다. 도 15는 세탁행정시 진행될 수 있는 세탁모션을 보여주는 개략도이다."}
