{"patent_id": "10-2020-0042964", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0125356", "출원번호": "10-2020-0042964", "발명의 명칭": "전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "윤석훈"}}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,대기 상태에서 사운드 입력의 수신을 위해 전원이 공급되어 사운드 입력을 수신하는 제1사운드 수신부,상기 제1사운드 수신부로부터 수신된 사운드 입력이 트리거 워드에 대응하는지를 인식하는 트리거 워드 인식부,상기 트리거 워드 인식부에 의해 상기 트리거 워드가 인식됨에 따라 전원이 공급되어, 상기 사운드 입력을 수신하는 제2사운드 수신부,상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사운드 입력 신호를 출력하는 데이터 송수신부를 포함하는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 트리거 워드 인식부로부터 상기 트리거 워드가 인식되었음을 나타내는 제어 신호를 수신함에 따라, 상기제2사운드 수신부에 전원이 공급되도록 제어하는 전원제어부를 더 포함하는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 트리거 워드 인식부에 의해 상기 트리거 워드가 인식됨에 따라 전원이 공급되어, 상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사운드 입력 신호를 수신하고, 상기 제1사운드 입력 신호 및 상기 제2사운드 입력 신호를 처리하는 음성 신호 처리부를 더 포함하는, 전자장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 전원제어부는, 상기 트리거 워드 인식부로부터 상기 트리거 워드가 인식되었음을 나타내는 제어 신호를 수신함에 따라, 제2사운드 수신부에 전원이 공급되도록 제어하는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 음성 신호 처리부는, 상기 제1 사운드 입력 신호와 상기 제2 사운드 입력 신호를 믹싱하여 스테레오 신호를 생성하는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 전원제어부는, 음성 인식 기능을 요청하는 키 입력 신호를 수신함에 따라 상기 제2사운드 수신부에 전원을공급하고, 상기 제1사운드 수신부로의 전원 공급을 차단하고,상기 데이터 송수신부는, 제2사운드 수신부전원 공급에 따라 동작하는 상기 제2사운드 수신부로부터 상기 제2사운드 입력 신호를 수신하여 출력하는, 전자 장치. 공개특허 10-2021-0125356-3-청구항 7 제6항에 있어서,상기 데이터 송수신부는,상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호에, 상기 키 입력 신호에 따라서 출력되는 상기제2사운드 입력 신호를 상기 상기 트리거 워드 인식에 따라 출력되는 상기 제1 사운드 입력 신호 및 상기 제2사운드 입력 신호와 구별시키는 플래그를 삽입하여 출력하는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 플래그에 기반하여, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호는, 상기 트리거 워드인식에 따라 출력되는 상기 제1 사운드 입력 신호 및 상기 제2 사운드 입력 신호와 구별되는 음성 처리가 수행되는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 제2사운드 수신부에 연결된 스위치를 더 포함하고, 상기 스위치는, 상기 음성 인식 기능을 요청하는 키 입력 신호를 수신함에 따라 상기 제2사운드 수신부로부터공급되는 상기 제2사운드 입력 신호를 상기 데이터 송수신부로 전송하거나 또는 상기 트리거 워드 인식에 따라상기 제2사운드 입력 신호를 상기 제1사운드 입력 신호와의 처리를 수행하는 음성 신호 처리부로 전송하는, 전자 장치."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치의 동작 방법에 있어서,대기 상태에서 사운드 입력의 수신을 위해 전원이 공급되는 제1사운드 수신부에 의해 사운드 입력을 수신하는동작,상기 제1사운드 수신부로부터 수신된 사운드 입력이 트리거 워드에 대응하는지를 인식하는 동작,상기 트리거 워드가 인식됨에 따라 전원이 공급되는 제2사운드 수신부에 의해 상기 사운드 입력을 수신하는 동작, 및 데이터 송수신부에 의해 상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사운드 입력 신호를 출력하는 동작을 포합하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,전원제어부에 의해, 상기 트리거 워드가 인식되었음을 나타내는 제어 신호를 수신함에 따라, 상기 제2사운드 수신부에 전원이 공급되도록 제어하는 동작을 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 트리거 워드가 인식됨에 따라 전원이 공급된 음성 신호 처리부에 의해, 상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사운드 입력 신호를 수신하고, 상기제1사운드 입력 신호 및 상기 제2사운드 입력 신호를 처리하는 동작을 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,공개특허 10-2021-0125356-4-상기 음성 신호 처리부에 의해, 상기 제1 사운드 입력 신호와 상기 제2 사운드 입력 신호를 믹싱하여 스테레오신호를 생성하는 동작을 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 전원제어부에 의해, 음성 인식 기능을 요청하는 키 입력 신호를 수신함에 따라 상기 제2사운드 수신부에전원을 공급하고, 상기 제1사운드 수신부로의 전원 공급을 차단하는 동작, 및상기 데이터 송수신부에 의해, 상기 전원 공급에 따라 동작하는 상기 제2사운드 수신부로부터 상기 제2사운드입력 신호를 수신하여 출력하는 동작을 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 데이터 송수신부에 의해, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호에, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호를 상기 트리거 워드 인식에 따라 출력되는 상기 제1 사운드 입력 신호 및 상기 제2 사운드 입력 신호와 구별시키는 플래그를 삽입하여 출력하는 동작을 더 포함하는,전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 플래그에 기반하여, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호는, 상기 트리거 워드인식에 따라 출력되는 상기 제1 사운드 입력 신호 및 상기 제2 사운드 입력 신호와 구별되는 음성 처리가 수행되는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에 있어서,스위치에 의해, 상기 음성 인식 기능을 요청하는 키 입력 신호를 수신함에 따라 상기 제2사운드 수신부로부터공급되는 상기 제2사운드 입력 신호를 상기 데이터 송수신부로 전송하거나 또는 상기 트리거 워드 인식에 따라상기 제2사운드 입력 신호를 상기 제1사운드 입력 신호와의 처리를 수행하는 음성 신호 처리부로 전송하는 동작을 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예들에 따라, 전자 장치 및 그 동작 방법이 개시된다. 실시예들에 따른 전자 장치에 있어서, 대기 상태에서 사운드 입력의 수신을 위해 전원이 공급되어 사운드 입력을 수신하는 제1사운드 수신부, 상기 제1사운드 수신부 로부터 수신된 사운드 입력이 트리거 워드에 대응하는지를 인식하는 트리거 워드 인식부, 상기 트리거 워드 인식 부에 의해 상기 트리거 워드가 인식됨에 따라 전원이 공급되어, 상기 사운드 입력을 수신하는 제2사운드 수신부, 상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사 운드 입력 신호를 출력하는 데이터 송수신부를 포함한다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은 전자 장치 및 그 동작 방법에 관한 것으로, 보다 구체적으로는, 음성 인식 기능에 이용되는 음성 신호를 수신하고 처리하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래 들어 음성 인식 기능을 지원하는 다양한 기기가 보급화되고 있다. 음성 인식 기능은, 사용자의 발화 음성 을 인식하고, 인식된 발화 음성을 기초로 소정의 기능을 수행할 수 있도록 데이터 처리를 하는 기능을 의미할 수 있다. 또한 인공 지능과 결합된 음성 인식 기능을 구현한 기기는 비디오 오디오 등의 컨텐츠를 검색하거나, 상식이나 생활 정보 등을 검색하거나, 또는 특정한 어플리케이션 등을 실행하는 등의 다양한 기능을 수행할 수 있다. 이러한 음성 인식 기능은 스피커, TV, 스마트폰, OTT 박스 등 다양한 컴퓨팅 장치에서 구현될 수 있다. 그런데, 이러한 음성 인식 기능을 구현한 기기는, 그 음성 인식 기능의 특성으로 인해, 사용자의 발화 음성이 언제 수신되더라도, 수신된 발화 음성을 인식하는 기능을 수행할 준비 상태에 있어야 한다. 따라서, 이러한 음 성 인식을 위한 센서 및 음성 인식 처리 회로가 항상 파워 온 되어 있는 상태에 있어야 하므로, 배터리를 전원으로 이용하는 휴대용 기기에서는 음성 인식을 위한 센서 및 회로로 인한 전력 소모가 문제가 될 수 있다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "다양한 실시예들은, 배터리 소모를 감소시킬 수 있도록 음성 신호를 처리할 수 있는 모듈이 구현된 전자 장치 및 그 동작 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 전자 장치는, 대기 상태에서 사운드 입력의 수신을 위해 전원이 공급되어 사운드 입력을 수신 하는 제1사운드 수신부, 상기 제1사운드 수신부로부터 수신된 사운드 입력이 트리거 워드에 대응하는지를 인식 하는 트리거 워드 인식부,상기 트리거 워드 인식부에 의해 상기 트리거 워드가 인식됨에 따라 전원이 공급되어, 상기 사운드 입력을 수신하는 제2사운드 수신부, 상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사운드 입력 신호를 출력하는 데이터 송수신부를 포함한다. 일 실시예에 따라 전자 장치는, 상기 트리거 워드 인식부로부터 상기 트리거 워드가 인식되었음을 나타내는 제 어 신호를 수신함에 따라, 상기 제2사운드 수신부에 전원이 공급되도록 제어하는 전원제어부를 더 포함할 수 있 다. 일 실시예에 따라 전자 장치는, 상기 트리거 워드 인식부에 의해 상기 트리거 워드가 인식됨에 따라 전원이 공 급되어, 상기 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되 는 제2 사운드 입력 신호를 수신하고, 상기 제1사운드 입력 신호 및 상기 제2사운드 입력 신호를 처리하는 음성 신호 처리부를 더 포함할 수 있다. 일 실시예에 따라 상기 전원제어부는, 상기 트리거 워드 인식부로부터 상기 트리거 워드가 인식되었음을 나타내 는 제어 신호를 수신함에 따라, 제2사운드 수신부에 전원이 공급되도록 제어할 수 있다. 일 실시예에 따라 상기 음성 신호 처리부는, 상기 제1 사운드 입력 신호와 상기 제2 사운드 입력 신호를 믹싱하 여 스테레오 신호를 생성할 수 있다. 일 실시예에 따라 상기 전원제어부는, 음성 인식 기능을 요청하는 키 입력 신호를 수신함에 따라 상기 제2사운 드 수신부에 전원을 공급하고, 상기 제1사운드 수신부로의 전원 공급을 차단하고, 상기 데이터 송수신부는, 전 원 공급에 따라 동작하는 상기 제2사운드 수신부로부터 상기 제2사운드 입력 신호를 수신하여 출력할 수 있다. 일 실시예에 따라 상기 데이터 송수신부는, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호에, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호를 상기 상기 트리거 워드 인식에 따라 출력되 는 상기 제1 사운드 입력 신호 및 상기 제2 사운드 입력 신호와 구별시키는 플래그를 삽입하여 출력할 수 있다. 일 실시예에 따라 상기 플래그에 기반하여, 상기 키 입력 신호에 따라서 출력되는 상기 제2사운드 입력 신호는, 상기 트리거 워드 인식에 따라 출력되는 상기 제1 사운드 입력 신호 및 상기 제2 사운드 입력 신호와 구별되는 음성 처리가 수행될 수 있다. 일 실시예에 따라 상기 제2사운드 수신부에 연결된 스위치를 더 포함하고, 상기 스위치는, 상기 음성 인식 기능 을 요청하는 키 입력 신호를 수신함에 따라 상기 제2사운드 수신부로부터 공급되는 상기 제2사운드 입력 신호를 상기 데이터 송수신부로 전송하거나 또는 상기 트리거 워드 인식에 따라 상기 제2사운드 입력 신호를 상기 제1 사운드 입력 신호와의 처리를 수행하는 음성 신호 처리부로 전송할 수 있다. 일 실시예에 따른 전자 장치의 동작 방법은, 대기 상태에서 사운드 입력의 수신을 위해 전원이 공급되는 제1사 운드 수신부에 의해 사운드 입력을 수신하는 동작, 상기 제1사운드 수신부로부터 수신된 사운드 입력이 트리거 워드에 대응하는지를 인식하는 동작, 상기 트리거 워드가 인식됨에 따라 전원이 공급되는 제2사운드 수신부에 의해 상기 사운드 입력을 수신하는 동작, 및 데이터 송수신부에 의해 상기 제1사운드 수신부로부터 공급되는 제 1 사운드 입력 신호 및 상기 제2사운드 수신부로부터 공급되는 제2 사운드 입력 신호를 출력하는 동작을 포합한 다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시서의 다양한 실시예들에 따르면, 음성 인식 기능이 구현된 전자 장치에서, 음성 인식 기능을 수행하는 일부 구성 요소들을 트리거 워드가 인식된 경우에 전원 공급하여 동작시킴으로써 음성 인식 기능을 수행하는 모 든 구성 요소들을 항상 전원 공급할 필요가 없게 되므로 전력 소모를 감소시킬 수 있다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상세 히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지 는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 아래에서는 첨부한 도면을 참고하여 실시예들에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자 가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서의 실시예에서 \"사용자\"라는 용어는 제어 장치를 이용하여 컴퓨팅 장치 또는 전자 장치의 기능 또는 동작을 제어하는 사람을 의미하며, 시청자, 관리자 또는 설치 기사를 포함할 수 있다. 도 1은 다양한 실시예들이 적용되는 시스템의 개념을 설명하기 위한 참고도이다. 다양한 실시예들에 따른 음성 인식 기능을 위한 구성요소들은 다양한 전자기기에 적용될 수 있다. 도 1을 참조 하면, 다양한 실시예들에 따른 음성 인식 기능을 위한 구성 요소들은, 예를 들어, 텔레비전과 같은 디스플레이 장치 10, 스마트 폰 20, OTT 박스 30, 스피커 40, 리모트 콘트롤러 50와 같은 전자 기기에 적용될 수 있다. 음성 인식 기능은 예를 들어, 리모트 콘트롤러 50 등에 적용되어 디스플레이 장치 10를 제어하는데 이용될 수 있다. 예를 들어, 사용자는 리모트 콘트롤러 50를 향해 단순히 음성 발화를 시작함으로써 디스플레이 장치 10 를 제어할 수 있거나 또는 리모트 콘트롤러 50에 구비된 마이크 버튼 51을 누름으로써 음성 발화 수신을 마이크 를 동작하도록 트리거 할 수 있다. 음성 인식 기능은 음성 비서(어시스턴스) 서비스를 제공하도록 인공 지능 기술과 결합될 수 있다. 인공지능 시 스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템으로서 기계가 스스로 학습하고 판단하며, 사용할수록 인식 률이 향상되는 시스템이다. 인공지능 기술은 입력 데이터들의 특징을 스스로 분류/학습하는 알고리즘을 이용하는 기계학습(딥러닝) 기술 및 기계학습 알고리즘을 활용하여 인간 두뇌의 인지, 판단 등의 기능을 모사하는 요 소 기술들로 구성된다. 요소기술들은, 예로, 인간의 언어/문자를 인식하는 언어적 이해 기술, 사물을 인간의 시각처럼 인식하는 시각적 이해 기술, 정보를 판단하여 논리적으로 추론하고 예측하는 추론/예측 기술, 인간의 경험 정보를 지식데이터로 처리하는 지식 표현 기술 및 차량의 자율 주행, 로봇의 움직임을 제어하는 동작 제어 기술 중 적어도 하나를 포함할 수 있다. 일반적으로 각 음성 인식 기능 모듈은 고유의 트리거 워드나 웨이크업 워드를 수신하면 이를 인식하고, 사용자 90로부터 다음 발화 내용을 리스닝하는 상태로 진입한다. 예를 들어, 음성 인식 기능 모듈은 \"하이 빅스비\"라 는 트리거 워드에 의해 웨이크업 될 수 있다. 통상적으로 음성 인식 기능 모듈은 자신을 지칭하는 자신의 고유 트리거 워드를 인식하도록 학습되어 있지만, 반드시 이에 한정되는 것은 아니고 음성 인식 기능 모듈은 복수개의 트리거 워드를 인식하도록 학습될 수도 있 다. 사용자의 발화로 다양한 기기를 제어하는 음성 인식 기능은 버튼 입력을 트리거로 하는 근거리 음성 인식과 특 정 발화어를 트리거로 하는 원거리 음성 인식으로 구분될 수 있다. 근거리 음성 인식은 특정 기기를 소지해서 버튼을 누른 후 발화를 해야 하기 때문에 인터랙션에 한계가 있을 수 있다. 즉, 음성 인식을 기능을 이용하려 는 사용자는 전자 기기에 구비된 버튼을 눌러야 음성 인식 기능을 시작할 수 있으므로, 이러한 음성 인식 기능 을 이용하기 위해서는 항상 전자 기기를 소지해야 한다는 한계가 있다. 반면에, 특정 발화어로 음성인식을 하 는 원거리 음성 인식은 사용자가 원할 때 트리거 워드 발화만으로 일정 거리 내에서 기기를 제어할 수 있기 때 문에 좀더 음성 인식 기능을 편리하게 이용할 수 있기 때문에 이에 대한 필요성이 있다. 종래 원거리 음성 인식 기기의 경우, 사람이 언제 발화할 지를 모르기 때문에 음성 인식을 수행하기 위해 항상 마이크로폰에 전원을 공급해야만 했다. 따라서 전원 플러그를 연결할 수 있는 곳에 설치해야 하는 제약 사항이 발생하거나 또는 배터리를 내장하는 기기의 경우에도 사용시간이 하루 이하가 되어 자주 충전을 해야 하는 불편 함이 존재하였다. 즉, 기존의 원거리 음성인식의 경우, 사용자가 언제 트리거 워드를 발화할지 모르기 때문에 항상 사운드를 녹음 하고 이에 대한 분석을 진행되어야 했다. 이러한 이유로 마이크로폰 관련 블록의 소비 전류가 항상 발생하기 때문에, 원거리 음성 인식 모듈은 전원을 안정적으로 공급할 수 있는 기기에 적용되어야 했다. TV 리모트 콘트 롤러와 같은 디바이스의 경우, 일반 알카라인 건전지 (예를 들어, AA 사이즈 2개 또는 AAA 사이즈 2개)를 사용 하여 1년 정도 배터리 교체없이 사용해야 하는 저전력 기술이 필수적이므로, 버튼 타입의 Push to Talk 방식으 로 설계되어 졌다. 이러한 리모트 콘트롤러에 원거리 음성 인식을 적용할 경우, 사용자가 언제 발화할지 모르 기 때문에 마이크로폰 블록을 항상 인에이블시켜야 한다는 문제점이 발생한다. 따라서 대기전력이 많이 소모되 므로 큰 배터리 용량을 사용하거나 자주 배터리를 교체해야 하는 사용자의 불편함이 발생하게 될 수 밖에 없다. 따라서, 본 개시서에 개시된 실시예들은, 상시 전원 연결 없이 장시간 원거리 음성 인식 기능을 사용할 수 있도 록 하는 전자기기를 제공하고자 한다. 도 2는 일 실시예에 따른 전자 장치의 블록도의 일 예를 나타낸다. 도 2를 참조하면, 전자 장치 100는 사운드 수신부 110, 음성 처리부 120, 전원제어부 130, 데이터 송수신부 140, 및 제어부 180를 포함할 수 있다. 를 포함한다. 사운드 수신부 110, 음성 처리부 120, 전원제어부 130, 데 이터 송수신부 140, 및 제어부 180를 포함할 수 있다. 전자 장치 100의 적어도 일부 구성, 예를 들어 사운드 수 신부 110, 음성 처리부 120, 전원제어부 130, 데이터 송수신부 140, 제어부 180에 전기적으로 연결될 수 있다. 다양한 실시 예에서, 전자 장치 100는 컴퓨팅 장치, 원격 제어 장치로 명명될 수 있으며, 도 2에 도시된 구성요 소 외에 구성요소를 더 포함할 수 있거나, 일부 구성요소는 생략될 수 있다. 예를 들어, 전자 장치 100는 디스 플레이, 메모리, 스피커 등을 더 포함할 수도 있다. 제어부 180는 프로세서 등을 포함하여 사운드 수신부 110, 음성 처리부 120, 전원제어부 130, 데이터 송수신부 140 등을 전반적으로 제어할 수 있다. 사운드 수신부 110는 사운드 입력을 수신하는 제1사운드 수신부 111 및 제2사운드 수신부 112를 포함할 수 있다. 제1사운드 수신부 111 및 제2사운드 수신부 112는 마이크로폰 등을 구비하여 외부에서 나는 사운드 입력을 수신 하거나 저장할 수 있다. 제1사운드 수신부 111 및 제2사운드 수신부 112는 전자 장치 100와 일체형 뿐만 아니라분리된 형태로 구현될 수 있다. 분리된 사운드 수신부는 전자 장치 100과 유선 또는 무선 네트워크를 통해 연 결될 수 있다. 일 실시예에 따라 제1사운드 수신부 111은 항상 전원 공급을 수신하여 전자 장치 100 외부로부터 사운드 입력이 수신되는지를 검출할 수 있다. 즉, 제1사운드 수신부 111는 전자 장치 100의 대기 상태에서 사운드 입력의 수 신을 위해 전원이 공급되는 상태를 유지할 수 있다. 이때 사운드 수신부 111는 사용자의 음성 뿐만 아니라 다 양한 오디오 신호 예를 들어 실내 노이즈 같은 소음을 수신할 수 있다. 제1사운드 수신부 111은 수신된 사운드 의 크기가 이전에 입력된 사운드의 크기보다 기 설정된 값 이상으로 증가한 경우 사용자 음성이 입력된 것으로 감지할 수 있다. 이는 일반적인 가정환경이나 사무 환경에서는 사용자 음성을 제외한 다양한 오디오가 사운드 수신부를 통해 입력되기 때문이다. 이때 일반적인 가정환경이나 사무 환경에서 입력되는 노이즈는 일정한 크기 를 가지고 있으므로, 사운드 수신부는 현재 입력된 사운드 크기가 평소에 입력된 사운드 크기보다 기 설정된 값 이상 증가한 경우 사용자 음성이 입력된 것으로 감지할 수 있다. 예를 들어, 평소에 입력된 사운드 크기가 20dB 인 경우, 사운드 수신부는 평소에 입력된 사운드 크기보다 기 설정된 값 (예를 들어, 12dB) 이상인 오디오 만을 사용자 음성이라고 판단할 수 있다. 또는 예를 들어, 제1사운드 수신부 111은 항상 외부로부터 수신되는 사운드 입력을 녹음하고 녹음된 사운드 입 력이 미리 정한 임계치를 넘는지를 검출할 수 있다. 제1사운드 수신부 111은 검출 결과 녹음된 사운드 입력이 미리 정한 임계치를 넘지 않는 경우에, 해당 사운드 입력은 유효한 사운드가 아니라 소음이나 생활 잡음으로 판 단하여, 이에 대해 아무런 액션도 취하지 않을 수 있다. 제1사운드 수신부 111은 검출 결과 녹음된 사운드 입 력이 미리 정한 임계치를 넘는 경우, 해당 사운드 입력은 유효한 정보를 가진 사운드 인 것으로 판단할 수 있다. 제1사운드 수신부 111은 녹음된 사운드 입력이 유효한 사운드 인 것으로 판단한 경우, 이러한 유효한 사 운드가 트리거 워드에 대응하는 지를 판단될 수 있도록, 녹음된 사운드 입력을 트리거 워드 인식부 121로 전송 할 수 있다. 또한 제1사운드 수신부 111은 트리거 워드 인식부 121로부터 트리거 워드 인식 신호임을 나타내는 제어 신호를 수신하면, 사운드 입력의 음성 신호 처리를 위해, 수신되는 사운드 입력을 음성 신호 처리부 122로 전송할 수 있다. 즉, 트리거 워드 인식부 121에서 해당 사운드 입력이 트리거 워드에 대응되는 것으로 인식된 경우 전자 장치 100는 수신되는 사운드 입력을 음성 신호 처리되게 하기 위해 제1사운드 수신부 111은 사운드 입력을 음성 신호 처리부 122로 전송할 수 있다. 제2사운드 수신부 112는 평상시에는 전원이 공급되지 않아서 오프된 상태에 있을 수 있다. 제2사운드 수신부 112는 전원 제어부 130로부터 전원 제어 신호를 수신한 경우에 전원이 공급되어 파워 온 되어 동작을 할 수 있 는데, 제2사운드 수신부 112는 전원이 공급되는 경우 사운드 입력을 수신하고, 수신된 사운드 입력 신호를 음성 처리부 122로 전송할 수 있다. 이러한 전원 제어부 130로부터의 전원 제어 신호는 트리거 워드 인식부 121가 사운드 입력이 트리거 워드에 대응한다고 판단된 경우 전원 제어부 130가 제2사운드 수신부 112로 전송할 수 있 다. 이와 같이 수신된 사운드 입력이 트리거 워드에 해당하는 경우에 제2사운드 수신부 112로 전원이 공급되어, 제2사운드 수신부 112가 사운드 입력을 수신하는 동작을 수행하고, 평상시에는 제2사운드 수신부 112 는 전원이 공급되지 않는 상태를 유지하므로 전력 소모를 방지할 수 있다. 음성 처리부 120는 사운드 수신부 110로부터 수신된 사운드 입력 신호를 처리하는 블록으로서, 트리거 워드 인 식부 121과 음성 신호 처리부 122를 포함할 수 있다. 트리거 워드 인식부 121은 제1사운드 수신부 111로부터 사운드 입력을 수신하면, 수신된 사운드 입력이 미리 정 한 트리거 워드에 대응하는지를 검출할 수 있다. 일 실시예에 따라, 트리거 워드 인식부 121는 하나 이상의 트리거 워드를 음향 모델, 발음 기호 등을 이용하여 미리 학습시켜 놓음으로써 트리거 워드를 인식할 수 있다. 일 실시예에 따라 트리거 워드 인식부 121는 인식 스코어의 임계치를 이용하여, 어떤 트리거 워드의 인식 스코어가 임계치를 넘는 경우에 해당 트리거 워드를 인 식한 것으로 판단하고, 임계치를 넘지 않는 경우에 해당 트리거 워드를 인식하지 못한 것으로 판단할 수 있다. 트리거 워드 인식부 121은 검출 결과, 수신된 사운드 입력이 미리 정한 트리거 워드에 대응하지 않는다고 판단 된 경우에는 아무런 액션을 취하지 않을 수 있다. 트리거 워드 인식부 121은 검출 결과, 수신된 사운드 입력이 미리 정한 트리거 워드에 대응한다고 판단된 경우에는, 트리거 워드 인식후 후속 동작이 수행될 수 있도록 하기 위해 트리거 워드를 인식했음을 나타내는 제어 신호를 전원 제어부 130와 제1사운드 수신부 111로 전송할 수 있 다.음성 신호 처리부 122는 평상시에는 즉, 전자 장치 100의 대기 모드 상태에서는 전원이 공급되지 않아서 오프된 상태에 있을 수 있다. 음성 신호 처리부 122는 전원 제어부 130로부터 전원 제어 신호를 수신한 경우에 전원이 공급되어 파워 온 되어 동작을 할 수 있는데, 음성 신호 처리부 122는 전원이 공급되는 경우 제1사운드 수신부 로부터의 제1사운드 입력 및 제2사운드 수신부 112로부터의 제2사운드 입력을 수신하고, 제1사운드 입력 신호와 제2사운드 입력 신호를 믹싱하여 믹싱된 신호를 데이터 송수신부 140으로 전송할 수 있다. 이와 같은 제1사운 드 입력 신호 및 제2사운드 입력 신호를 믹싱함으로써 음성 신호 처리부 122는 스테레오 신호를 생성할 수 있다. 또한 음성 신호 처리부 122는 원거리 음성 인식을 위한 사운드 입력 신호를 수신하므로 노이즈가 섞일 가능성이 높으므로 노이즈 제거 등의 처리를 수행할 수도 있다. 전원 제어부 130로부터의 전원 제어 신호는 트 리거 워드 인식부 121가 사운드 입력이 트리거 워드에 대응한다고 판단된 경우 전원 제어부 130가 음성 신호 처 리부 122로 전송할 수 있다. 이와 같이 수신된 사운드 입력이 트리거 워드에 해당하는 경우에 음성 신호 처리 부 122로 전원이 공급되어, 음성 신호 처리부 122가 수신된 사운드 입력 신호에 대한 음성 처리를 수행하고, 평 상시에는 음성 신호 처리부 122는 전원이 공급되지 않는 상태를 유지하므로 전력 소모를 방지할 수 있다. 전원 제어부 130는 트리거 워드 인식부 121로부터 트리거 워드 인식 신호를 수신하면, 제2사운드 수신부 112와 음성 신호 처리부 122로의 전원 공급을 제어하기 위해, 제2사운드 수신부 112와 음성 신호 처리부 122로 전원 제어 신호를 전송할 수 있다. 전원 제어 신호의 전송에 따라 해당 구성요소에는 전원이 공급되어 구성요소가 동작을 수행할 수 있는 파워 온 상태가 될 수 있다. 데이터 송수신부 140는 수신된 데이터를 전달하는 역할을 하는 블록으로, 데이터 수신부 141과 데이터 송신부 142를 포함할 수 있다. 데이터 송수신부 140는 무선 인터넷 모듈이나 근거리 통신 모듈을 이용하여 데이터를 외 부에 송수신할 수 있다. 예를 들어, 무선 인터넷 모듈은 무선 인터넷 접속을 위한 모듈을 말하는 것으로, 무선 인터넷 기술로는 WLAN(Wireless LAN)(WiFi), Wibro(Wireless broadband), Wimax(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access) 등이 이용될 수 있다. 근거리 통신 모듈은 근 거리 통신을 위한 모듈을 말한다. 근거리 통신 기술로 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외선 통신(IrDA, infrared Data Association), UWB(Ultra Wideband), ZigBee 등이 이용될 수 있다. 데이터 수신부 141은 음성 신호 처리부 122로부터 신호 처리된 데이터를 수신하고, 이를 데이터 송신부 142로 전달할 수 있다. 데이터 송신부 142는 데이터 수신부 141로부터 수신된 데이터를 외부 장치로 전달할 수 있다. 예를 들어, 데이 터 송신부 142는 수신된 데이터를 통신 인터페이스를 통해서 외부 장치로 전송할 수 있다. 음성 인식(voice recognition)은 입력되는 음성의 형태에 따라, 각각의 단어를 구분하여 발화한 음성을 인식하 는 고립단어 인식(isolated word recognition), 연속단어, 연속문장 및 대화체 음성을 인식하는 연속 음성 인식 (continuous speech recognition) 및 고립단어 인식과 연속음성 인식의 중간형태로, 미리 정해진 핵심어를 검출 하여 인식하는 핵심어 검출(keyword spotting)으로 구분될 수 있다. 사용자 음성이 입력되는 경우, 입력된 음성 신호 내에서 사용자가 발화한 음성의 시작과 끝을 검출하여 음성 구간을 판단한다. 그리고, 입력된 음성 신호 의 에너지를 계산하고, 계산된 에너지에 따라 음성 신호의 에너지 레벨을 분류하여, 동적 프로그래밍을 통해 음 성 구간을 검출할 수 있다. 또한, 검출된 음성 구간 내의 음성 신호에서 음향 모델(Acoustic Model)을 기초로 음성의 최소 단위인 음소를 검출하여 음소 데이터를 생성한다. 그리고 나서, 생성된 음소 데이터에 HMM(Hidden Markov Model) 확률 모델을 적용하여 텍스트 정보를 생성한다. 이와 같은 음성 인식 동작을 수행하는 하나 이 상의 모듈은 전자 장치 100 의 내부에 포함될 수 있다. 이 경우, 음성인식 모듈은 음성 처리부 120로부터 출력 되는 신호를 수신하여 음성 인식 처리를 수행할 수 있다. 다른 예에 따라, 전자 장치 100는 음성 인식에 이용 되는 사운드 데이터를 획득하기만 하고 획득된 사운드 데이터를 통신 인터페이스 등을 통해 다른 장치로 전송할 수 있다. 예를 들어, 전자 장치 100가 리모트 콘트롤러로 구현되는 경우, 전자 장치 100의 데이터 송신부 142 는 수신된 데이터를 다양한 통신 방법을 이용하여 텔레비전 등의 디스플레이 장치로 전송할 수 있다. 도 2에 도시된 전자 장치 100에 따르면, 제2사운드 수신부 112와 음성 신호 처리부 122는 평상시에는 전원 공급 없이 파워 오프 상태로 있다가 트리거 워드 인식부 121에 의해 트리거 워드가 인식되면 전원이 공급되어 동작을 수행할 수 있다. 따라서, 제2사운드 수신부 112와 음성 신호 처리부 122는 동작 수행이 요구되는 시점에 전원 이 공급되어 동작하게 되므로 항상 전원 공급될 필요가 없으므로 전력 소모를 줄일 수 있다. 이러한 제2사운드 수신부 112와 음성 신호 처리부 122는 사운드 입력을 수신하여 처리할 데이터가 있을 때 동작 하게 되는 것이므로, 일단 전원 공급되어 파워 온 상태로 되었다 하더라도 더 이상 사운드 입력의 수신이 없으면 파워 오프 상태로 천이할 수 있다. 예를 들어 제2사운드 수신부 112는 외부로부터 사운드 입력이 수신되지 않는 시간이 일정 임계치를 넘어가면 파워 오프 상태로 진행할 수 있다. 또한 예를 들어 음성 신호 처리부 122 도 제1사운드 수신부나 제2사운드 수신부로부터의 사운드 입력 신호의 수신이 되지 않아서 처리할 데이터가 없 는 시간이 일정 임계치를 넘어가면 파워 오프 상태로 진행할 수 있다. 도 2에 도시된 실시예에 따르면 전자 장치 100의 대기 상태에서 두 개의 사운드 수신부 모두에 전원을 공급하 는 형태가 아닌, 한 개의 사운드 수신부 예를 들어, 제1사운드 수신부에 전원을 공급하고 제1사운드 수신부로부 터 수신된 사운드 입력으로 트리거 워드를 판단함으로써 배터리 수명을 확보할 수 있다. 그리고 제1사운드 수신부로부터 수신된 사운드 입력이 트리거 워드로 인식된 경우에 제2사운드 수신부에 전원을 공급함으로써, 제1사운드 수신부로부터 수신되는 제1사운드 입력신호와 함께 제2사운드 수신부로부터 수신되는 사운드 입력을 음성 처리에 이용함으로써 원거리 음성인식을 위한 신호 수집을 효율적으로 할 수 있다. 또한 트리거 워드 인식부와 음성 신호 처리부의 전원을 분리시킴으로써, 실제로 음성 신호 처리부의 동작이 요 구되는 경우에만 음성 신호 처리부에 전원을 공급함으로써 보다 전력 사용량을 최적화할 수 있다. 도 3a는 일 실시예에 따른 전자 장치의 블록도의 다른 예 100a를 나타낸다. 도 3a에 도시된 전자 장치 100a의 예에서는 키 입력 신호 수신에 의해 음성 인식 기능이 수행되는 구성을 추가 적으로 포함할 수 있다. 앞서 설명한 바와 같이 원거리 음성 인식에서는 단지 사용자가 발화를 함으로써 음성 인식 기능을 수행하도록 전자 장치를 트리거하였지만 근거리 음성 인식에서는 전자 장치 100에 구비된 버튼을 누름으로써 전자 장치가 음성 인식 기능을 수행하도록 트리거할 수 있다. 도 3a을 참조하면, 전자 장치 100a는 도 2에 도시된 사운드 수신부 110, 음성 처리부 120, 전원제어부 130, 데 이터 송수신부 140 외에 스위치 150, 사용자 입력부 160를 더 포함할 수 있다. 도 2에 도시된 구성요소와 동일한 참조번호에 대응하는 구성요소는 도 2에 도시된 구성요소와 실질적으로 동일 한 기능을 수행할 수 있다. 다만, 도 3a에 도시된 전자 장치 100는 버튼 누름에 의해 트리거되는 음성 인식 기 능을 위한 플로우를 위해 스위치 150를 더 포함할 수 있다. 사용자 입력부 160는 전자 장치 100a를 제어하기 위한 사용자 입력을 수신할 수 있다. 예를 들어, 사용자 입력 부 160는 전자 장치 100a의 외부에 배열된 하나 이상의 물리적 버튼을 포함하거나 또는 터치 입력 인터페이스 등을 포함할 수 있다. 사용자 입력부 160는 음성 인식 기능을 지시하는 사용자 입력 신호를 수신하면 이러한 사용자 입력 신호에 대응하는 제어 신호를 스위치 150과 전원제어부 130으로 전송될 수 있다. 이와 같이 음성 인식 기능을 지시하는 사용자 입력 신호에 대응하는 제어 신호는 간단히\"키 입력 신호\"로 언급될 수 있다. . 스위치 150는 키 입력 신호에 의해 트리거될 수 있다. 예를 들어, 스위치 150는 전자 장치 100에 구비된 음성 인식 기능 버튼이 눌려짐에 의해 발생하는 키 입력 신호에 따라 제어 신호를 수신할 수 있다. 스위치 150는 키 입력 신호에 따른 제어 신호를 수신한 경우에, 제2사운드 수신부 112로부터 수신되는 사운드 입력 신호를 바로 데이터 수신부 141로 전달할 수 있다. 즉, 키 입력 신호가 수신되었다는 것은 사용자로부터 전자 장치 100a를 쥐고, 전자 장치 100에 구비된 버튼을 누름으로써 음성인식 기능을 트리거하는 것을 의미하므로 전자 장치 100a 는 사용자에게 아주 근접하게 위치하고 있다는 것을 나타낼 수 있다. 따라서, 사운드 수신부 110에 포함된 사 운드 수신부 111, 112 모두를 이용하여 사운드 입력을 수신할 필요 없이 하나의 사운드 수신부 112만으로 사운 드 입력을 수신하는 것에 의해 음성 인식을 위한 데이터를 충분히 수집할 수 있다고 보므로, 스위치 150는 제2 사운드 수신부 112로부터 수신되는 제2사운드 입력 신호를 그대로 데이터 수신부 141로 전달하도록 동작할 수 있다. 전원 제어부 130는 키 입력 신호에 따른 제어 신호를 수신한 경우에, 제2사운드 수신부 112로 전원을 공급하기 위한 전원 제어 신호를 전송할 수 있다. 따라서 이러한 전원 제어 신호를 수신한 제2사운드 수신부는 전원이 공급되어 파워 온되고 사운드 입력을 수신하여, 수신된 사운드 입력을 스위치 150으로 전달할 수 있다. 일 실시예에 따라 전원 제어부 130는 키 입력 신호 수신에 의한 음성인식 기능(근거리 음성인식 기능)이 수행되 는 동안에는 트리거 워드 인식 동작은 불필요하므로, 키 입력에 의해 근거리 음성인식이 시작되면 제1사운드 수 신부 111에 전원 공급을 중단하고, 근거리 음성인식이 종료된 후 다시 제1사운드 수신부 111에 전원을 공급하도 록 제어할 수 있다. 일 실시예에 따라, 전원 제어부 130는 통상의 사용 상태에서는 사용자의 발화를 대상으로 음성 인식 기능을 수 행하는 원거리 음성 인식을 위해 제1사운드 수신부 111에는 항상 전원이 공급되도록 하고 제2사운드 수신부 112는 트리거 워드가 인식된 경우에 음성 처리를 위해 전원 공급되도록 제어할 수 있다. 일 실시예에 따라, 전원 제어부 130는 위와 같이 통상의 사용 상태에서는 원거리 음성 인식을 위해 제1사운드 수신부 111에는 항상 전원이 공급되도록 하지만, 키 입력 신호를 수신하여 근거리 음성 인식을 수행하는 경우에 는 제2사운드 수신부 112의 사운드 입력 수신으로 동작을 수행할 수 있으므로, 제1사운드 수신부 111에는 전원 공급을 중단함으로써 추가적인 저전력 소비를 구현할 수 있다. 그리고 제2사운드 수신부 112를 통한 근거리 음 성 인식 동작이 종료된 경우에 전원 제어부 130는 원거리 음성 인식 준비를 위해 제1사운드 수신부 111에 전원 공급을 재개하는 한편 제2사운드 수신부 112에는 전원공급을 중단할 수 있다. 도 3a에 도시된 예에서 원거리 음성 인식 기능을 수행하는 경우에는 도 2에서 설명한 바와 마찬가지의 동작이 수행될 수 있다. 다만, 이 경우에는 스위치 150는 제2사운드 수신부 112로부터 수신된 제2사운드 입력을 그대 로 데이터 수신부 141로 전달하는 것이 아니라, 음성 처리부 120의 음성 신호 처리부 122로 전달할 수 있다. 즉, 이와 같은 스위치 150에 의해 근거리 음성 인식 기능을 수행하는 경우 스위치 150는 제2사운드 수신부 112 에 의해 수신된 제2사운드 입력 신호를 그대로 데이터 수신부 141로 전달하고, 원거리 음성 인식 기능을 수행하 는 경우 스위치 150는 제2사운드 수신부 112에 의해 수신된 제2사운드 입력 신호를 제1사운드 입력 신호와의 믹 싱 작업을 위해 음성 신호 처리부 122로 전달할 수 있다. 도 3b는 일 실시예에 따른 전자 장치의 블록도의 또 다른 예 100b를 나타낸다. 도 3b에 도시된 전자 장치의 예에서는 키 입력 신호 수신에 의해 음성 인식 기능이 수행되는 구성을 추가적으로 포함할 수 있다. 도 3a에 도시된 예에서는, 근거리 음성 인식 기능의 경우, 사운드 수신부에 포함된 사운드 수신부들중 하나의 사운드 수신부를 이용하여 사운드 입력을 수신하고 이를 그대로 데이터 전달부로 전달하기 위한 스위치를 구비하였지만, 도 3b에 도시된 예에서는, 근거리 음성 인식 기능의 경우에도, 사운드 수신부에 포함된 사운드 수신부 2개 모두를 이용하여 음성 신호를 처리하는 예를 설명한다. 따라서, 키 입력 신호에 따른 제어 신호는 전원제어부 130 및 제1사운드 수신부 111로 전송될 수 있다. 제1사운드 수신부 111은 키 입력 신호에 따른 제어 신호를 수신한 경우, 제1사운드 수신부가 수신한 제1사운드 입력 신호를 음성 신호 처리부 122로 전달할 수 있다. 전원 제어부 130는 키 입력 신호에 따른 제어 신호를 수신한 경우에, 제2사운드 수신부 112 및 음성 신호 처리 부 122로 전원을 공급하기 위한 전원 제어 신호를 전송할 수 있다. 따라서 이러한 전원 제어 신호를 수신한 제 2사운드 수신부 112는 전원이 공급되어 파워 온되고 제2사운드 입력을 수신하여, 수신된 제2 사운드 입력을 음 성 신호 처리부 122로 전달할 수 있다. 또한 전원 제어 신호를 수신한 음성 신호 처리부 122는 전원이 공급되 어 파워 온되고, 제1사운드 수신부 111로부터 제1사운드 입력 신호 및 제2사운드 수신부 112로부터 제2사운드 입력 신호를 수신하고, 제1사운드 입력 신호와 제2사운드 입력 신호를 믹싱하여 데이터 송수신부 140로 출력할 수 있다. 즉, 전자 장치 100b에서 음성 인식 기능이 버튼 누름에 의해 시작되었다고 하더라도 음성 인식 기능이 시작된 이후에 사용자와 전자 장치 100b의 거리는 멀어질 수 있기 때문에, 전자 장치 100는 하나의 사운드 수신부만에 의해서가 아닌, 두개의 사운드 수신부인 제1사운드 수신부 111 및 제2사운드 수신부 112 모두에 의해 사운드 입 력을 수신하여 동작하도록 구현될 수 있다. 도 4는 일 실시예에 따라 전자 장치의 동작을 설명하기 위한 흐름도이다. 도 4를 참조하면, 동작 410에서, 전자 장치 100는 제1사운드 수신부로부터 수신된 사운드 입력이 트리거 워드에 대응하는지를 인식할 수 있다. 예를 들어, 전자 장치 100는 마이크로폰 등을 이용하여 지속적으로 외부로부터 수신되는 사운드를 녹음하고 녹 음된 사운드 중 유효한 사운드를 가진다고 판단될 때 녹음된 사운드가 트리거 워드에 대응하는지를 판단할 수 있다. 전자 장치 100는 녹음된 사운드를 미리 정해진 또는 미리 저장된 트리거 워드와 비교해보고, 비교결과 트리거 워드에 대응된다고 판단하는 기준이 되는 임계치를 넘는다면 트리거 워드로 인식하고, 비교 결과 트리거 워드에 대응된다고 판단하는 기준이 되는 임계치를 넘지 않는다면 트리거 워드가 아닌 것으로 인식할 수 있다. 동작 420에서, 전자 장치 100는 트리거 워드가 인식됨에 따라 제2사운드 수신부 및 음성 신호 처리부에 전원이 공급되도록 전원 제어 신호를 출력할 수 있다. 이와 같이 제2사운드 수신부에 전원 제어 신호가 수신되면 제2 사운드 수신부는 전원이 공급되어 파워 온 됨으로써, 외부로부터 사운드 입력을 수신하여 수신된 사운드 입력신호를 음성 신호 처리부에 전달할 수 있게 된다. 음성 신호 처리부에 전원 제어 신호가 수신되면 음성 신호 처리부는 전원이 공급되어 파워 온 됨으로써, 음성 신호 처리부가 수신하는 사운드 입력 신호를 처리할 수 있게 된다. 동작 430에서, 전자 장치 100는 전원이 공급된 음성 신호 처리부에 의해, 제1사운드 수신부로부터 공급되는 제1 사운드 입력 신호 및 제2사운드 수신부로부터 공급되는 제2사운드 입력 신호를 수신하고, 제1사운드 입력 신호 및 제2사운드 입력 신호를 믹싱하여 스테레오 사운드를 생성하고 생성된 스테레오 사운드를 출력할 수 있다. 도 5는 일 실시예에 따라 전자 장치에서 음성 인식 기능 동작의 구체적인 흐름도이다. 도 5를 참조하면, 동작 501에서 제1사운드 수신부 111는 외부로부터 사운드 입력을 지속적으로 수신할 수 있다. 예를 들어, 제1사운드 수신부 111는 외부로부터 수신되는 사운드 입력을 지속적으로 저장할 수 있다. 동작 502에서, 제1사운드 수신부 111는 저장된 사운드 입력이 유효한 사운드 정보를 가지는지를 판단할 수 있다. 예를 들어, 제1사운드 수신부 111는 저장된 사운드 입력이 유효한 사운드 정보를 가지는 지 아니면 일상 적인 소음 신호 만을 갖고 있는지 판단하기 위해 저장된 사운드 입력의 소정 특성이 미리 정한 임계치를 넘는지 를 판단할 수 있다. 제1사운드 수신부 111는 저장된 사운드 입력의 소정 특성이 미리 정한 임계치를 넘지 않는 다고 판단한 경우에, 이는 특정한 액션을 취할 필요가 없으므로 제1사운드 수신부 111는 별다른 동작을 수행하 지 않는다. 동작 503에서, 제1사운드 수신부 111는 저장된 사운드 입력의 소정 특성이 미리 정한 임계치를 넘는다고 판단한 경우, 이 사운드 입력이 트리거 워드에 대응하는지 알아보기 위해 저장된 사운드 입력을 트리거 워드 인식부 121로 전송할 수 있다. 동작 504에서, 제1사운드 수신부 111로부터 입력 사운드를 수신한 트리거 워드 인식부 121는 수신된 입력 사운 드가 트리거 워드에 대응하는지를 판단할 수 있다. 동작 505에서, 트리거 워드 인식부 121가 트리거 워드 인식 결과, 입력 사운드에서 트리거 워드를 인식했다고 판단한 경우, 트리거 워드 인식부 121는 트리거 워드가 인식되었음을 나타내는 트리거 워드 인식 신호를 제1사 운드 수신부 111로 전송할 수 있다. 동작 506에서, 트리거 워드 인식부 121는 트리거 워드 인식 신호를 전원 제어부 130으로 전송할 수 있다. 트리거 워드 인식 신호를 수신한 전원 제어부 130는 전원 제어 신호를 음성 신호 처리부 122로 전송하고 (동작 507), 전원 제어 신호를 제2사운드 수신부 112로 전송 (동작 508)할 수 있다. 음성 신호 처리부 122는 평상시 에는 전원 공급이 되지 않아 파워 오프 상태로 있다가 전원 제어부 130로부터 전원 제어 신호를 수신함에 따라 음성 신호 처리부 122는 이러한 전원 제어 신호에 의해 전원이 공급되어 파워 온 상태로 되고, 동작을 수행할 준비 상태에 들어가게 될 수 있다. 제2사운드 수신부 112 또한 평상시에는 전원 공급이 되지 않아 파워 오프 상태로 있다가 전원 제어부 130로부터 전원 제어 신호를 수신함에 따라 제2사운드 수신부 112는 이러한 전원 제 어 신호에 의해 전원이 공급되어 파워 온 상태로 되고, 동작을 수행할 준비 상태에 들어가게 될 수 있다. 동작 509에서, 전원이 공급된 제2사운드 수신부 112는 외부로부터 사운드 입력을 수신하여 수신된 사운드 입력 신호를 음성 신호 처리부 122로 전송할 수 있다. 즉, 전자 장치 100에서 트리거 워드가 인식 되기 전 까지는 제1사운드 수신부 111만 동작하여 트리거 워드를 담고 있는 사운드 입력을 수신할 때까지 사운드 입력을 모니터 링 하지만, 트리거 워드가 인식되고 나서는 제2사운드 수신부 112도 깨어나서 동작하게 되므로 제1사운드 수신 부 및 제2사운드 수신부 모두 사운드 입력을 수신하여 이를 음성 신호 처리부로 전송할 수 있다. 동작 510에서, 앞서 동작 505에서 트리거 워드 인식 신호를 수신한 제1사운드 수신부 111는 입력 사운드를 음성 신호 처리부 122로 전송할 수 있다. 즉, 트리거 워드 인식 전에는 제1사운드 수신부 111는 트리거 워드가 입력 사운드에 포함되었는지를 검출하기 위해 제1사운드 수신부 111는 입력 사운드를 트리거 워드 인식부 121로 전송 하는 역할을 하였지만, 트리거 워드 인식 후에 제1사운드 수신부 111는 수신되는 입력 사운드의 음성 처리를 위 해, 입력 사운드를 음성 신호 처리부 122로 전송할 수 있다. 동작 511에서, 음성 신호 처리부 122는 제1사운드 수신부 111로부터 수신된 제1사운드 입력 신호와 제2사운드 수신부 112로부터 수신된 제2사운드 입력 신호를 믹싱하여 음성 신호 처리할 수 있다. 동작 512에서, 음성 신호 처리부 122는 처리한 음성 신호를 데이터 송수신부 140으로 전송할 수 있다. 도 6은 일 실시예에 따라 전자 장치에서 음성 인식 기능 동작의 구체적인 흐름도이다. 도 6을 참조하면, 동작 601에서, 사용자 입력부 160는 음성 인식 기능을 지시하는 사용자 입력을 수신할 수 있 다. 예를 들어 음성 인식 기능을 지시하는 사용자 입력은 사용자 등에 의해 음성 인식 기능 버튼 누름 신호 등 을 포함할 수 있다. 동작 602에서, 사용자 입력부 160는 음성 인식 기능을 지시하는 사용자 입력에 대응하여 생성되는 키 입력 신호 를 전원 제어부 130에 전달할 수 있다. 동작 603에서, 전원 제어부 130는 키 입력 신호를 수신함에 따라 키 입력에 따른 음성 인식 기능을 위해 전원 제어 신호를 제2 사운드 수신부 112로 전송할 수 있다. 동작 604에서, 전원 제어부 130는 키 입력 신호를 수신함에 따라 키 입력에 따른 음성 인식 기능이 수행될 것이 고, 원거리 음성 인식을 위해 전원이 공급되고 있던 제1사운드 수신부 111는 키 입력에 따른 음성 인식 기능 수 행을 위해 제2사운드 수신부 112가 동작하는 동안 제1 사운드 수신부 111는 동작하지 않아도 될 수 있으므로, 제1사운드 수신부 111에는 전원 공급 차단을 위한 제어 신호를 전송할 수 있다. 동작 605에서, 평상시에는 전원 공급되지 않아서 파워 오프 상태에 있던 제2사운드 수신부 112는 전원제어부 130로부터 수신된 전원 제어 신호 에 의해 전원이 공급되어 파워 온 됨으로써 입력 사운드를 수신할 수 있다. 동작 606에서, 제2사운드 수신부 112는 수신된 입력 사운드를 데이터 송수신부 140으로 전송할 수 있다. 키 입력에 따라 음성 인식 기능을 수행하기 위한 사운드 입력이 제2사운드 수신부 112에서 더 이상 수신되지 않 는 경우에, 전원제어부 130는 전자 장치 100를 다시 대기 모드로 진입하게 하기 위해 제1사운드 수신부 111로는 전원을 공급하도록 하는 전원 제어 신호를 전송하고 제2사운드 수신부 112로는 전원공급을 차단하도록 하는 전 원 제어 신호를 전송할 수 있다. 도 7은 일 실시예에 따른 전자 장치의 또 다른 예를 나타낸다. 도 7을 참조하면, 또 다른 예에 따른 전자 장치 100c가 적용되는 시스템은, 디스플레이 장치 10, 전자 장치 100c 및 디스플레이 장치 10와 전자 장치 100c가 통신하는 네트워크 70를 포함할 수 있다. 일 실시예에 따라 전자 장치 100c는 사운드 수신부 110, 트리거 워드 인식부 121, 전원제어부 130, 데이터 송수 신부 140, 및 사용자 입력부 160, 제어부 180를 포함할 수 있다. 전자 장치 100c의 적어도 일부 구성, 예를 들 어 사운드 수신부 110, 트리거 워드 인식부 121, 전원제어부 130, 데이터 송수신부 140, 및 사용자 입력부 160 는 제어부 180에 전기적으로 연결될 수 있다. 도 7에 도시된 전자 장치 100c는 도 2에 도시된 전자 장치 100과 유사하지만, 음성 신호 처리부 122를 포함하지 않는 점에서 차이가 있다. 도 2에 도시된 전자 장치 100에서는 음성 신호 처리부 122가 제1사운드 수신부 111로부터의 제1사운드 입력 신 호 및 제2사운드 수신부 112로부터의 제2사운드 입력 신호를 믹싱하거나 필터링 과 같은 처리를 하고 믹싱된 신 호를 외부로 출력하였다. 그러나 도 7에 도시된 전자 장치 100c에서는 이러한 음성 신호 처리부는 전자 장치 100c에 포함되어 있지 않고, 디스플레이 장치 10가 음성 신호 처리부 역할을 하는 음성 신호 처리 모듈 16을 포 함한다. 따라서, 도 7에 도시된 전자 장치 100c는 수신한 제1사운드 입력 신호와 제2사운드 입력 신호에 대해 서 음성 신호 처리 없이 디스플레이 장치 10로 전송하면 디스플레이 장치 10는, 수신된 제1사운드 입력 신호와 제2사운드 입력 신호의 믹싱이나 필터링 처리를 할 수 있다. 도 7에 도시된 전자 장치 100c의 구성요소는 도 2에 도시된 전자 장치 100c의 동일 번호 참조된 구성요소와 동 일한 기능을 수행하므로 중복적인 설명은 생략하고, 도 2에 도시된 전자 장치 100의 구성요소의 동작과 차이가 있는 동작에 대해서 설명한다. 일 실시예에 따라, 대기 상태에서 전원이 공급되는 제1사운드 수신부 111로부터 사운드 입력 신호를 수신한 트 리거 워드 인식부 121는 수신된 사운드 입력 신호가 트리거 워드에 대응하는지를 인식하고, 트리거 워드에 대응 한다고 판단된 경우 전원제어부 130에 트리거 워드 인식 신호를 전송할 수 있다. 트리거 워드 인식 신호를 수 신한 전원제어부 130는 제2사운드 수신부 112에 전원을 공급하도록 제어함으로써 제2사운드 수신부 112가 사운 드 입력을 수신하도록 제어할 수 있다. 제1사운드 수신부 111에 의해 수신된 제1사운드 입력 신호와 제2사운드 수신부 112에 의해 수신된 제2사운드 입력 신호는 음성 신호 처리 없이 바로 데이터 송수신부 140로 전달되고 데이터 송수신부 140는 수신된 제1사운드 입력 신호 및 제2 사운드 입력 신호를 네트워크 70을 통해 디스플레이 장치 10로 전달할 수 있다. 일 실시예에 따라 사용자 입력부 160으로부터 키 입력 신호를 수신한 전원 제어부 130는 제2사운드 수신부 112 에 전원이 공급되도록 제어하여 제2사운드 수신부 112가 사운드 입력을 수신하도록 제어할 수 있다. 제2사운드 수신부 112에 의해 수신된 제2사운드 입력 신호는 바로 데이터 송수신부 140로 전달되고 데이터 송수신부 140는 수신된 제2사운드 입력 신호를 디스플레이 장치 10로 전송할 수 있다. 일 실시예에 따라 사용자 입력부 160으로부터 키 입력 신호를 수신한 전원 제어부 130가 제2사운드 수신부 112 에 전원이 공급되도록 제어할 때, 전원 제어부 130는 제1사운드 수신부 111로의 전원공급이 차단되도록 전원을 제어할 수 있다. 이와 같이 키 입력 신호에 따라 제2사운드 수신부 112로부터의 제2사운드 입력 신호만을 디스 플레이 장치 10로 전송하는 경우에는 제1사운드 수신부 112로부터의 전원 공급을 차단함으로써 추가적인 저전력 을 가능하게 할 수 있다. 또한 일 실시예에 따라 키 입력 신호에 따른 음성 수신이 종료된 경우 즉, 더 이상 제2사운드 수신부 112를 통해 사운드 입력이 수신되지 않는 경우, 전원제어부 130는 전자 장치 100c를 대기 상 태로 전환하기 위해 제2사운드 수신부 112로의 전원 공급을 중단하고 제1사운드 수신부 111로 전원 공급이 재개 되도록 전원을 제어할 수 있다. 일 실시예에 따라 디스플레이 장치 10은 디스플레이 11, 통신 인터페이스 12, 프로세서 13, 메모리 14, 및 음성 인식 모듈 15를 포함할 수 있다. 디스플레이 장치 10의 적어도 일부 구성, 예를 들어 디스플레이 11, 통신 인 터페이스 12, 메모리 14, 및 음성인식 모듈 15은 프로세서 13에 전기적으로 연결될 수 있다. 다양한 실시 예에 서, 디스플레이 장치 10는 전자 장치, 컴퓨팅 장치로도 명명될 수 있다. 디스플레이 장치 10는 도 7에 도시된 구성요소 외에 구성요소를 더 포함할 수 있거나, 일부 구성요소는 생략될 수 있다. 일 실시예에 따라 디스플레이 11는 이미지나 비디오, 및/또는 어플리케이션의 실행 화면을 표시할 수 있다. 일 실시 예에 따른 통신 인터페이스 12는 전자 장치 100c와 규정된 프로토콜(protocol)에 따른 유선 통신 또는 무선 통신을 수립할 수 있다. 통신 인터페이스 12는 상기 유선 통신 또는 무선 통신을 기반으로 전자 장치 100c 로부터 음성 인식에 이용될 사운드 입력 신호를 수신할 수 있다. 통신 인터페이스 12는 디스플레이 장치 10과 무선 통신 시스템 사이 또는 디스플레이 장치 10과 다른 전자 장치 가 위치한 네트워크 사이의 무선 통신을 가능하게 하는 하나 이상의 모듈을 포함할 수 있다. 예를 들어, 통신 인터페이스 12는 방송 수신 모듈, 이동통신 모듈, 무선 인터넷 모듈 및 근거리 통신 모듈을 포함할 수 있다. 통 신 인터페이스 12는 송/수신부로 호칭될 수 있다. 방송 수신 모듈은 방송 채널을 통하여 외부의 방송 관리 서버로부터 방송 신호 및/또는 방송 관련된 정보를 수 신한다. 이동통신 모듈은, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수 신한다. 무선 인터넷 모듈은 무선 인터넷 접속을 위한 모듈을 말하는 것으로, 무선 인터넷 기술로는 WLAN(Wireless LAN)(WiFi), Wibro(Wireless broadband), Wimax(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access) 등이 이용될 수 있다. 근거리 통신 모듈은 근거리 통신을 위한 모듈을 말한다. 근거리 통신 기술로 블루투스(Bluetooth), RFID(Radio Frequency Identification), 적외 선 통신(IrDA, infrared Data Association), UWB(Ultra Wideband), ZigBee 등이 이용될 수 있다. 일 실시예에 따라 메모리 14는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀 티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 일 실시 예에 따라 메모리 14는 복수의 어플리케이션을 저장할 수 있다. 메모리 14에 저장된 복수의 어플리케이 션은 사용자 입력에 따라 선택되어 실행되고 동작할 수 있다. 일 실시 예에 따라 메모리 14는 복수의 어플리케 이션을 저장하고, 복수의 어플리케이션은 프로세서 13에 로드되어 동작할 수 있다. 일 실시예에 따라, 프로세서 13는 디스플레이 장치 10의 전반적인 동작을 제어할 수 있다. 예를 들어, 프로세서 13는 메모리 14를 제어하여 필요한 정보를 불러오거나 저장할 수 있다. 일 실시 예에서, 프로세서13는 메모리14에 저장된 명령어들을 실행하여 컨텐츠 공유 어플리케이션을 구동시킬 수 있다. 본 발명의 다양한 실시 예에서 언급되는 여러 모듈들은 하드웨어, 소프트웨어 또는 하드웨어와 소프트 웨어의 결합으로 구현될 수도 있다. 일 실시예에 따라 음성 인식 모듈 15는 전자 장치 100c로부터 수신한 사운드 입력 신호를 기초로 음성 인식 기 능을 수행할 수 있다. 또한, 음성 인식 모듈 15는 음성 신호 처리 모듈 16을 포함할 수 있다. 음성 신호 처리 모듈 16은 전자 장치 100c로부터 원거리 음성 인식 기능에 따라 제1사운드 입력 신호와 제2사운드 입력 신호를 수신한 경우에, 이러한 제1사운드 입력 신호와 제2사운드 입력 신호를 믹싱하거나, 노이즈 제거 필터 처리 등을 할 수 있다. 이러한 음성 인식 모듈 15는 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 결합으로 구현 될 수 있다. 음성 신호 처리 모듈 16은 전자 장치 100c로부터 근거리 음서 인식 기능에 따라 제2사운드 입력 신호를 수신한 경우에, 이러한 제2사운드 입력 신호에 노이즈 제거 필터 처리 등을 할 수 있다. 원거리 음성 인식을 위한 사운드 입력 신호에 이용되는 노이즈 제거 필터 처리는 근거리 음성 인식을 위한 사운드 입력 신호 에 이용되는 노이즈 제거 필터 처리와 다르게 구현될 수 있다. 도 8은 일 실시예에 따른 전자 장치의 또 다른 예를 나타낸다. 도 8을 참조하면, 또 다른 예에 따른 전자 장치 100d가 적용되는 시스템은, 도 7에 도시된 시스템과 동일하다. 다만, 전자 장치 100d는 전자 장치 100c와 달리 플래그 삽입부 170룰 더 포함할 수 있다. 도 8에 도시된 전자 장치 100d는 음성 신호 처리부를 포함하지 않으므로, 트리거 워드 인식에 따라 수신된 제1 사운드 입력 신호와 제2사운드 입력 신호가 음성 신호 처리 없이 그대로 디스플레이 장치 10으로 전송되거나 또 는 키 입력 신호에 따라 제2사운드 입력 신호가 그대로 디스플레이 장치 10로 전송될 수 있다. 이 경우, 트리 거 워드 인식에 따라 전달되는 제1사운드 입력 신호와 제2사운드 입력 신호는 디스플레이 장치 10에서 하나의 신호로 믹싱하는 작업이 필요할 수 있다. 또는 트리거 워드 인식에 따라 전달되는 제1사운드 입력 신호와 제2 사운드 입력 신호는 키 입력 신호에 따라 전달되는 제2사운드 입력 신호에 이용되는 노이즈 제거 필터와는 다른 노이즈 제거 필터를 필요할 수 있다. 이를 위해서는 전자 장치에서 디스플레이 장치로 보내는 사운드 신호가 트리거 워드 인식에 따라 원거리 음성 인식을 위해 전송되는 신호인지, 키 입력 신호에 따라 근거리 음성 인식 을 위해 전송되는 신호인지를 구별하기 위한 플래그 정보를 부가함으로써, 디스플레이 장치에게 어떤 신호에 관 한 것인지를 알게 해주는 것이 바람직할 수 있다. 따라서, 도 8에 도시된 전자 장치 100d에서는 플래그 정보 추 가를 위한 플래그 삽입부 170을 더 포함할 수 있다. 일 실시예에 따라, 대기 상태에서 전원이 공급되는 제1사운드 수신부 111로부터 사운드 입력 신호를 수신한 트 리거 워드 인식부 121는 수신된 사운드 입력 신호가 트리거 워드에 대응하는지를 인식하고, 트리거 워드에 대응 한다고 판단된 경우 전원제어부 130 및 플래그 삽입부 170에 트리거 워드 인식 신호를 전송할 수 있다. 트리거 워드 인식 신호를 수신한 전원제어부 130는 제2사운드 수신부 112에 전원을 공급하도록 제어함으로써 제2사운드 수신부 112가 사운드 입력을 수신하도록 제어할 수 있다. 플래그 삽입부 170는 제1사운드 수신부 111에 의해 수신된 제1사운드 입력 신호와 제2사운드 수신부 112에 의해 수신된 제2사운드 입력 신호를 수신하고, 해당 신 호들을 데이터 송수신부 140에 전달하기 전에, 트리거 워드 인식에 따른 신호임을 나타내는 플래그를 삽입하고, 플래그가 삽입된 신호를 데이터 송수신부 140로 전달할 수 있다. 이와 같은 플래그가 삽입된 신호를 수신한 디 스플레이 장치 10의 음성 신호 처리 모듈 16은 수신된 신호를 파싱함으로써 플래그를 획득하고, 플래그에 따라 서 수신된 신호인 제1사운드 입력 신호와 제2사운드 입력 신호가 원거리 음성 인식을 위한 신호임을 확인하고, 그에 따라 제1사운드 입력 신호와 제2사운드 입력 신호를 믹싱 하는 처리 또는 원거리 음성 인식에 적합한 노이 즈 제거 필터 처리를 수행할 수 있다. 일 실시예에 따라 사용자 입력부 160가 키 입력을 수신한 경우 사용자 입력 인터페이스 150는 전원제어부 130 로 키 입력 신호를 전달할 뿐만 아니라 플래그 삽입부 170에 키 입력 신호를 전달할 수 있다. 키 입력 신호를 수신한 전원 제어부 130는 제2사운드 수신부 112에 전원이 공급되도록 제어하여 제2사운드 수신부 112가 사운드 입력을 수신하도록 제어할 수 있다. 제2사운드 수신부 112에 의해 수신된 제2사운드 입력 신호는 플래그 삽입 부 160에 전달되고, 플래그 삽입부 170는 사용자 입력부 160로부터 수신된 키 입력 신호에 기반하여, 근거리 음 성 인식을 위한 신호임을 나타내는 플래그를 삽입하고, 플래그가 삽입된 신호를 데이터 송수신부 140로 달할 수 있다. 이와 같은 플래그가 삽입된 신호를 수신한 디스플레이 장치 10의 음성 신호 처리 모듈 16은 수신된 신호 를 파싱함으로써 플래그를 획득하고, 플래그에 따라서 근거리 음성 인식에 적합한 노이즈 제거 필터 처리를 수 행할 수 있다. 위 설명에서는 트리거 워드 인식에 따라 보내지는 사운드 입력 신호들과 키 입력 신호에 따라 보내지는 사운드 입력 신호에 별도의 플래그를 삽입하는 방법을 설명하였지만, 실시예들은 이에 한정되지 않는다. 원거리 음성 인식을 위해 보내지는 신호와 근거리 음성 인식을 위해 보내지는 신호를 구별시킬 수 있는 플래그가 삽입되면 충분한다. 원거리 음성 인식을 위해 보내지는 신호와 근거리 음성 인식을 위해 보내지는 신호의 구별을 위해, 예를 들어, 제1사운드 입력 신호에 플래그를 삽입하는 방법도 고려할 수 있다. 위 설명된 예에서, 트리거 워드 인식에 따 라서는 제1사운드 입력 신호와 제2사운드 입력 신호를 함께 전달하고, 키 입력 신호에 따라서는 제2사운드 입력 신호를 전달하므로, 제1사운드 입력 신호에만 플래그를 삽입한다면, 디스플레이 장치 10는 제1사운드 입력 신호 에 삽입된 플래그를 참조하여, 원거리 음성 인식에 따른 음성 처리가 필요한 것으로 판단할 수 있다. 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기 록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매 체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매 체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리 형 및 비분리형 매체를 모두 포함한다. 개시된 실시예들은 컴퓨터로 읽을 수 있는 저장 매체(computer-readable storage media)에 저장된 명령어를 포 함하는 S/W 프로그램으로 구현될 수 있다. 컴퓨터는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 개시된 실시예에 따른 동작이 가 능한 장치로서, 개시된 실시예들에 따른 전자 장치를 포함할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서,'비 일시적'은 저장매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매 체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 개시된 실시예들에 따른 제어 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공 될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 S/W 프로그램, S/W 프로그램이 저장된 컴퓨터로 읽을 수 있는 저장 매체를 포함할 수 있다. 예를 들어, 컴퓨터 프로그램 제품은 디바이스의 제조사 또는 전자 마켓(예, 구글 플레이 스토어, 앱 스토 어)을 통해 전자적으로 배포되는 S/W 프로그램 형태의 상품(예, 다운로더블 앱)을 포함할 수 있다. 전자적 배포 를 위하여, S/W 프로그램의 적어도 일부는 저장 매체에 저장되거나, 임시적으로 생성될 수 있다. 이 경우, 저장 매체는 제조사의 서버, 전자 마켓의 서버, 또는 SW 프로그램을 임시적으로 저장하는 중계 서버의 저장매체가 될 수 있다. 컴퓨터 프로그램 제품은, 서버 및 디바이스로 구성되는 시스템에서, 서버의 저장매체 또는 디바이스의 저장매체 를 포함할 수 있다. 또는, 서버 또는 디바이스와 통신 연결되는 제 3 장치(예, 스마트폰)가 존재하는 경우, 컴 퓨터 프로그램 제품은 제 3 장치의 저장매체를 포함할 수 있다. 또는, 컴퓨터 프로그램 제품은 서버로부터 디바 이스 또는 제 3 장치로 전송되거나, 제 3 장치로부터 디바이스로 전송되는 S/W 프로그램 자체를 포함할 수 있다. 이 경우, 서버, 디바이스 및 제 3 장치 중 하나가 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방 법을 수행할 수 있다. 또는, 서버, 디바이스 및 제 3 장치 중 둘 이상이 컴퓨터 프로그램 제품을 실행하여 개시 된 실시예들에 따른 방법을 분산하여 실시할 수 있다. 예를 들면, 서버(예로, 클라우드 서버 또는 인공 지능 서버 등)가 서버에 저장된 컴퓨터 프로그램 제품을 실행 하여, 서버와 통신 연결된 디바이스가 개시된 실시예들에 따른 방법을 수행하도록 제어할 수 있다. 또 다른 예로, 제 3 장치가 컴퓨터 프로그램 제품을 실행하여, 제 3 장치와 통신 연결된 디바이스가 개시된 실 시예에 따른 방법을 수행하도록 제어할 수 있다. 제 3 장치가 컴퓨터 프로그램 제품을 실행하는 경우, 제 3 장 치는 서버로부터 컴퓨터 프로그램 제품을 다운로드하고, 다운로드 된 컴퓨터 프로그램 제품을 실행할 수 있다. 또는, 제 3 장치는 프리로드 된 상태로 제공된 컴퓨터 프로그램 제품을 실행하여 개시된 실시예들에 따른 방법 을 수행할 수도 있다. 또한, 본 명세서에서, \"부\"는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로세 서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2020-0042964", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 개시의 설명은 예시를 위한 것이며, 본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 본 개시 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 개시의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2020-0042964", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들이 적용되는 시스템의 개념을 설명하기 위한 참고도이다. 도 2는 일 실시예에 따른 전자 장치의 블록도의 일 예를 나타낸다. 도 3a는 일 실시예에 따른 전자 장치의 블록도의 다른 예를 나타낸다. 도 3b는 일 실시예에 따른 전자 장치의 블록도의 또다른 예를 나타낸다. 도 4는 일 실시예에 따라 전자 장치의 동작을 설명하기 위한 흐름도이다. 도 5는 일 실시예에 따라 전자 장치에서 음성 인식 기능 동작의 구체적인 흐름도이다. 도 6은 일 실시예에 따라 전자 장치에서 음성 인식 기능 동작의 구체적인 흐름도이다. 도 7은 일 실시예에 따른 전자 장치의 또 다른 예를 나타낸다. 도 8은 일 실시예에 따른 전자 장치의 또 다른 예를 나타낸다."}
