{"patent_id": "10-2023-0108795", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0028555", "출원번호": "10-2023-0108795", "발명의 명칭": "팝업 스토어 운영 장치 및 그의 동작 방법", "출원인": "(주)트레블씨투비", "발명자": "이정민"}}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메모리; 통신 회로; 및상기 메모리에 저장된 적어도 하나의 명령어를 실행하는 프로세서를 포함하고,상기 적어도 하나의 프로세서는복수의 사용자 단말 각각의 위치 및 팝업 대상 콘텐츠에 따라 서로 다른 지역에 생성되는 팝업 스토어의 위치에기반하여 상기 복수의 사용자 단말 중 일부에 대해 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스를 활성화시키고,상기 통신 회로를 통해, 상기 팝업 대상 콘텐츠와 관련된 상품 리스트를 상기 사용자 단말 각각에 제공하고,상기 통신 회로를 통해, 상기 복수의 사용자 단말로부터 상기 상품 리스트에 포함된 상품 중 선택된 관심 상품의 주문 정보를 수신하면, 상기 주문 정보를 수신한 순서에 따라 사용자 단말 각각에 대기 순번 정보를 제공하고, 상기 대기 순번 정보에 따라 판매 완료 정보를 수신하여, 상기 주문 정보에 대한 판매 절차를 종료하도록 설정된팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는상기 복수의 사용자 단말 각각의 위치와 미리 설정된 바운더리를 비교하고,상기 복수의 사용자 단말 중 상기 바운더리 내에 위치한 사용자 단말에 대하여 상기 팝업 스토어 서비스를 활성화시키는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 바운더리는상기 팝업 스토어의 위치를 기준으로 소정의 반경을 갖도록 설정된팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 적어도 하나의 프로세서는 공개특허 10-2025-0028555-3-상기 바운더리내에 위치한 사용자 단말 중 특정 주기의 시간에 선착순 또는 임의의 n명의 사용자 단말에 경품을제공하거나, 상기 상품 리스트에 포함된 상품의 할인 구매 기회를 제공하도록 설정된팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 적어도 하나의 프로세서는 상기 바운더리내에 위치한 사용자 단말 중 상기 팝업 스토어와의 거리가 가장 가까운 n명의 사용자 단말에 인기상품 리스트를 더 전송하도록 설정된팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 팝업 스토어의 위치는 상기 팝업 대상 콘텐츠의 종류 및 상기 팝업 대상 콘텐츠와 관련된 콘텐츠 일정에 따라 달라지는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는상기 통신 회로를 통해, 상기 사용자 단말로 제공되는 상기 팝업 대상 콘텐츠와 연관된 실행 화면 내에 포함되는 복수의 그래픽 오브젝트들의 상태를 활성화 상태로 제어 가능하도록 상기 팝업 스토어 서비스를 활성화시키는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 주문 정보는상기 상품의 선택 정보 및 결제 유형 정보를 포함하고,상기 프로세서는상기 결제 유형 정보가 카드 결제인 경우 상기 대기 순번 정보를 상품 픽업 대기 번호로 제공하고, 상기 결제 유형 정보가 현금 결제인 경우 상기 대기 순번 정보를 결제 대기 번호로 제공하는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,공개특허 10-2025-0028555-4-상기 프로세서는상기 대기 순번 정보를 제공할 때,주변 상점 정보, 상기 팝업 대상 콘텐츠에 대한 설문 정보, AR 홀로그램, 이벤트 확인 서비스 중 적어도 하나를포함하는 부가 정보를 함께 제공하는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 프로세서는특정 사용자의 대기 순번이 미리 설정된 순번 범위에 포함되면 상기 특정 사용자 단말로 결제 대기 알림 또는픽업 대기 알림과 함께 식별 정보를 전송하고, 상기 식별 정보에 대응하는 판매 완료 정보를 수신하여 상기 주문 정보에 대한 판매 절차를 종료하는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 프로세서는상기 판매 완료 정보를 수신한 뒤,상기 결제가 이루어진 관심 상품의 사용방법 안내 정보, 불량품 자가진단 정보 및 상기 팝업 대상 콘텐츠의 응원노래 정보 중 적어도 하나를 포함하는 상품 이용 정보를 상기 사용자 단말로 제공하는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 판매 완료 정보는 상기 사용자 단말에 표시된 식별 정보를 상기 팝업 스토어 내부에 구비된 식별 장치에 접촉하거나, 태깅(Tagging)하여 생성되는팝업 스토어 운영 장치."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 프로세서는상기 팝업 스토어 서비스를 활성화시키기 전, 상기 사용자 단말로부터 사용자 가입 정보를 수신하고, 상기 사용자 가입 정보에 기초하여 사용자 인증이 완료된 사용자 단말에 대해서만 상기 팝업 스토어 서비스를 활성화시키는 팝업 스토어 운영 장치.공개특허 10-2025-0028555-5-청구항 14 팝업 스토어 운영 장치의 동작 방법에 있어서,복수의 사용자 단말 각각의 위치 및 팝업 대상 콘텐츠에 따라 서로 다른 지역에 생성되는 팝업 스토어의 위치에기반하여 상기 복수의 사용자 단말 중 일부에 대해 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스를 활성화시키는 동작,상기 팝업 대상 콘텐츠와 관련된 상품 리스트를 상기 사용자 단말 각각에 제공하는 동작,상기 복수의 사용자 단말로부터 상기 상품 리스트에 포함된 상품 중 선택된 관심 상품의 주문 정보를 수신하면,상기 주문 정보를 수신한 순서에 따라 사용자 단말 각각에 대기 순번 정보를 제공하는 동작 및상기 대기 순번 정보에 따라 판매 완료 정보를 수신하면, 상기 주문 정보에 대한 판매 절차를 종료하는 동작을포함하는팝업 스토어 운영 장치의 동작 방법."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 팝업 스토어 서비스를 활성화시키는 동작은상기 복수의 사용자 단말 각각의 위치와 미리 설정된 바운더리를 비교하고,상기 복수의 사용자 단말 중 상기 바운더리 내에 위치한 사용자 단말에 대하여 상기 팝업 스토어 서비스를 활성화시키는 동작을 포함하는팝업 스토어 운영 장치의 동작 방법."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 바운더리는상기 팝업 스토어의 위치를 기준으로 소정의 반경을 갖도록 설정된팝업 스토어 운영 장치의 동작 방법."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 상품 리스트를 상기 사용자 단말 각각에 제공하는 동작은상기 바운더리내에 위치한 사용자 단말 중 특정 주기의 시간에 선착순 또는 임의의 n명의 사용자 단말에 경품을제공하거나, 상기 상품 리스트에 포함된 상품의 할인 구매 기회를 제공하는 동작을 더 포함하는팝업 스토어 운영 장치의 동작 방법."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 상품 리스트를 상기 사용자 단말 각각에 제공하는 동작은상기 바운더리내에 위치한 사용자 단말 중 상기 팝업 스토어와의 거리가 가장 가까운 n명의 사용자 단말에 인기공개특허 10-2025-0028555-6-상품 리스트를 더 전송하는 동작을 더 포함하는팝업 스토어 운영 장치의 동작 방법."}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에 있어서,상기 팝업 스토어의 위치는 상기 팝업 대상 콘텐츠의 종류 및 상기 팝업 대상 콘텐츠와 관련된 콘텐츠 일정에 따라 달라지는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14항에 있어서,상기 팝업 스토어 서비스를 활성화시키는 동작은상기 사용자 단말로 제공되는 상기 팝업 대상 콘텐츠와 연관된 실행 화면 내에 포함되는 복수의 그래픽 오브젝트들의 상태를 활성화 상태로 제어 가능하도록 상기 팝업 스토어 서비스를 활성화시키는 동작을 포함하는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제14항에 있어서,상기 주문 정보는상기 상품의 선택 정보 및 결제 유형 정보를 포함하고,상기 결제 유형 정보가 카드 결제인 경우 상기 대기 순번 정보는 상품 픽업 대기 번호이고, 상기 결제 유형 정보가 현금 결제인 경우 상기 대기 순번 정보는 결제 대기 번호인팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제14항에 있어서,사용자 단말 각각에 대기 순번 정보를 제공하는 동작은 주변 상점 정보, 상기 팝업 대상 콘텐츠에 대한 설문 정보, AR 홀로그램, 이벤트 확인 서비스 중 적어도 하나를포함하는 부가 정보를 함께 제공하는 동작을 포함하는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제14항에 있어서,상기 주문 정보에 대한 판매 절차를 종료하는 동작은특정 사용자의 대기 순번이 미리 설정된 순번 범위에 포함되면 상기 제어 모듈이 상기 특정 사용자 단말로 결제대기 알림 또는 픽업 대기 알림과 함께 식별 정보를 전송하고, 상기 식별 정보에 대응하는 판매 완료 정보를 수공개특허 10-2025-0028555-7-신하여 상기 주문 정보에 대한 판매 절차를 종료하는 동작을 포함하는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서,상기 판매 완료 정보를 수신한 뒤, 상기 제어 모듈이 상기 결제가 이루어진 관심 상품의 사용방법 안내 정보,불량품 자가진단 정보 및 상기 팝업 대상 콘텐츠의 응원노래 정보 중 적어도 하나를 포함하는 상품 이용 정보를상기 사용자 단말로 제공하는 동작을 포함하는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제14항에 있어서,상기 판매 완료 정보는 상기 사용자 단말에 표시된 식별 정보를 상기 팝업 스토어 내부에 구비된 식별 장치에 접촉하거나, 태깅(Tagging)하여 생성되는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제14항에 있어서,상기 팝업 스토어 서비스를 활성화시키기 전, 상기 사용자 단말로부터 사용자 가입 정보를 수신하고, 상기 사용자 가입 정보에 기초하여 사용자 인증이 완료된 사용자 단말에 대해서만 상기 팝업 스토어 서비스를 활성화시키는 동작을 더 포함하는팝업 스토어 운영 장치의 동작 방법"}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서는 팝업 스토어 운영 장치 및 그 동작 방법에 관한 것이다. 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치는 메모리, 통신 회로 및 적어도 하나의 명령어를 실행하는 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 복수의 사용자 단말 각각의 위치 및 팝업 대상 콘텐츠에 따라 서로 다른 지역에 생성되는 팝업 스토 어의 위치에 기반하여 상기 복수의 사용자 단말 중 일부에 대해 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스 를 활성화시키고 상기 팝업 대상 콘텐츠와 관련된 상품 리스트를 상기 사용자 단말 각각에 제공하고, 상기 복수 의 사용자 단말로부터 상기 상품 리스트에 포함된 상품 중 선택된 관심 상품의 주문 정보를 수신하면, 상기 주문 정보를 수신한 순서에 따라 사용자 단말 각각에 대기 순번 정보를 제공하고, 상기 대기 순번 정보에 따라 판매 완료 정보를 수신하여, 상기 주문 정보에 대한 판매 절차를 종료한다."}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 팝업 스토어 운영 장치 및 그의 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "팝업 스토어(Pop-up Store)는 짧은 기간 운영되는 일회성 오프라인 소매점을 의미한다. 팝업이 가진 '깜짝 놀라 게 하다'의 의미와 스토어가 가진 '상점'의 의미와 같이 팝업 스토어는 짧은 기간 동안만 운영하기 때문에, 고 정된 매장을 보유하지 않고 특정 장소를 임대하여 임시 매장 형태로 운영을 하다가 운영 기간이 끝나면 곧바로 철수를 한다. 도 1은 종래의 팝업 스토어 내부에 전시된 전시물을 나타낸 도면이고, 도 2는 종래의 팝업 스토어 운영 기간내 에 몰려든 인파를 나타낸 도면이다. 팝업 스토어는 상점이지만 상품만을 판매하는 것이 아니라 도 1과 같이 전시공간이나 체험관 등을 내부에 마련 하는 등 브랜드의 요소를 가미하여 운영되며, 온라인에서 많이 노출되는 드라마, 음악, 게임, 영화, 애니메이션, 아이돌과 같은 연예인 등의 관련 굿즈(Goods)나 기념품도 팝업 스토어에서 다양하게 판매된다. 이때, 팝업 스토어는 기존 매장과 차별점을 두기 위해 일반 매장에서는 구할 수 없는 특별판 내지 한정판을 판매 한다. 따라서, 팝업 스토어가 열리는 특정 장소와 운영 기간 및 팝업 스토어 대상 콘텐츠(예컨대, 아이돌 가수 등의 아티스트)는 팝업 스토어 별로 상이하며, 팝업 스토어의 운영 기간이 종료되면 해당 팝업 스토어에서 판매했던 상품과 동일한 상품을 구하기가 매우 어려우므로 도 2와 같이 팝업 스토어가 열리는 기간에는 매우 많은 인파가 몰리는 것이 일반적이다. 팝업 스토어는 한정된 기간 동안만 한시적으로 운영되므로 팝업 스토어 내부(a)뿐만 아니라 팝업 스토어 외부(b)까지도 상당한 대기줄이 형성된다. 도 3은 종래의 팝업 스토어에서 배포되는 상품 주문서를 나타낸 도면이고, 도 4는 종래의 팝업 스토어에서 사용 되는 상품 목록 배너를 나타낸 도면이고, 도 5는 종래의 팝업 스토어에서 상품 결제를 위해 사용되는 결제 시스 템을 나타내는 도면이다. 도 3을 참조하면, 종래의 팝업 스토어는 팝업 스토어에 방문한 이용자들을 대상으로 전 상품 목록이 표시된 상 품 주문서를 배포하고, 이용자들은 관심있는 상품 목록을 수기로 체크하여 상품을 주문한다. 이때, 상품 선택 시간 및 상품 주문서 작성 시간 등으로 인해 많은 시간이 소요되므로, 이와 같은 시간을 줄이기 위해 도 4와 같 이 상품 목록 배너를 팝업 스토어 입구에 배치하여 상품 목록을 사전에 확인하도록 하는 방법도 활용되고 있다. 이후, 이용자가 상품 주문서를 제출하면, 이용자는 대기 순번표를 부여받고, 대기 순번에 따라 주문한 상품을 픽업하는데, 종래의 팝업 스토어는 도 5에 도시된 바와 같이, 팝업 스토어 관리자가 직접 수기로 작성된 상품 주문서에 표시된 관심 상품을 수작업으로 바코드 스캐닝하여 결제 절차를 진행한다. 따라서, 종래의 팝업 스토어의 상품 결제 방식은 작업속도가 더디고, 결제 시간이 오래 걸릴뿐만 아니라 유사 상품간 중복 또는 누락이 발생할 가능성도 매우 높은 문제점이 있다. 또한, 다수의 이용자들로부터 받은 주문 수량과 팝업 스토어에서 보유한 상품의 재고수량이 일치하지 않아 일부 이용자는 오랜 시간을 줄서기하여 대기했음에도 재고부족으로 주문한 상품을 픽업하지 못하는 경우가 빈번하게 발생할 수 있다. 뿐만 아니라, 짧은 시간동안 팝업 스토어 내부에 다수의 이용자가 몰리게 되므로 혼잡도가 높고, 각종 도난 사 고나 이용객들 간의 다툼이 발생할 가능성이 매우 높은 문제점이 있다."}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 목적은 사용자 단말을 이용하여 사용자가 직접 상품 주문서를 작성하고, 상품 결제를 진행함으로써, 상품 누락 또는 중복을 방지하고, 신속한 팝업 스토어 운영을 할 수 있는 팝업 스토어 운영 장치 및 방법을 제공하는 것이다. 또한, 본 명세서의 목적은 실시간으로 주문 수량을 반영하여 재고 수량만큼만 판매함으로써, 상품 품절에 따른 사용자의 불필요한 대기 시간 낭비를 사전에 방지할 수 있는 팝업 스토어 운영 장치 및 방법을 제공하는 것이다. 또한, 본 명세서의 목적은 바운더리 내에 있는 사용자 단말로 팝업 스토어 서비스를 제공하여 팝업 스토어 방문 없이도 사용자가 상품 선택 및 결제를 진행하도록 함으로써, 팝업 스토어 내부의 혼잡도를 현저하게 감소시킬 수 있는 팝업 스토어 운영 장치 및 방법을 제공하는 것이다. 본 명세서의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 명세서의 다른 목적 및 장 점들은 하기의 설명에 의해서 이해될 수 있고, 본 명세서의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 명세서의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치는 메모리, 통신 회로 및 메모리에 저장된 적어도 하나의 명령어를 실행하는 프로세서를 포함하고, 적어도 하나의 프로세서는 복수의 사용자 단말 각각의 위치 및 팝업 대상 콘텐츠에 따라 서로 다른 지역에 생성되는 팝업 스토어의 위치에 기반하여 상기 복수의 사용자 단말 중 일 부에 대해 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스를 활성화시키고, 팝업 대상 콘텐츠와 관련된 상품 리 스트를 상기 사용자 단말 각각에 제공하고, 복수의 사용자 단말로부터 상기 상품 리스트에 포함된 상품 중 선택 된 관심 상품의 주문 정보를 수신하면, 상기 주문 정보를 수신한 순서에 따라 사용자 단말 각각에 대기 순번 정 보를 제공하고, 대기 순번 정보에 따라 판매 완료 정보를 수신하여, 상기 주문 정보에 대한 판매 절차를 종료하 도록 설정된다. 또한, 본 명세서의 일 실시예에서 상기 프로세서는 상기 복수의 사용자 단말 각각의 위치와 미리 설정된 바운더 리를 비교하고, 상기 복수의 사용자 단말 중 상기 바운더리 내에 위치한 사용자 단말에 대하여 상기 팝업 스토 어 서비스를 활성화시킨다. 또한, 본 명세서의 일 실시예에서 바운더리는 상기 팝업 스토어의 위치를 기준으로 소정의 반경을 갖도록 설정 된다. 또한, 본 명세서의 일 실시예에서 적어도 하나의 프로세서는 바운더리내에 위치한 사용자 단말 중 특정 주기의 시간에 선착순 또는 임의의 n명의 사용자 단말에 경품을 제공하거나, 상기 상품 리스트에 포함된 상품의 할인 구매 기회를 제공하도록 설정된다. 또한, 본 명세서의 일 실시예에서 적어도 하나의 프로세서는 바운더리내에 위치한 사용자 단말 중 상기 팝업 스 토어와의 거리가 가장 가까운 n명의 사용자 단말에 인기 상품 리스트를 더 전송하도록 설정된다. 또한, 본 명세서의 일 실시예에서 팝업 스토어의 위치는 팝업 대상 콘텐츠의 종류 및 상기 팝업 대상 콘텐츠와 관련된 콘텐츠 일정에 따라 달라진다. 또한, 본 명세서의 일 실시예에서 프로세서는 통신 회로를 통해, 상기 사용자 단말로 제공되는 상기 팝업 대상 콘텐츠와 연관된 실행 화면 내에 포함되는 복수의 그래픽 오브젝트들의 상태를 활성화 상태로 제어 가능하도록 상기 팝업 스토어 서비스를 활성화시킨다. 또한, 본 명세서의 일 실시예에서 상기 주문 정보는 상기 상품의 선택 정보 및 결제 유형 정보를 포함하고, 상 기 프로세서는 상기 결제 유형 정보가 카드 결제인 경우 상기 대기 순번 정보를 상품 픽업 대기 번호로 제공하 고, 상기 결제 유형 정보가 현금 결제인 경우 상기 대기 순번 정보를 결제 대기 번호로 제공한다. 또한, 본 명세서의 일 실시예에서 상기 프로세서는 상기 대기 순번 정보를 제공할 때, 주변 상점 정보, 상기 팝 업 대상 콘텐츠에 대한 설문 정보, AR 홀로그램, 이벤트 확인 서비스 중 적어도 하나를 포함하는 부가 정보를 함께 제공한다. 또한, 본 명세서의 일 실시예에서 상기 프로세서는 특정 사용자의 대기 순번이 미리 설정된 순번 범위에 포함되 면 상기 특정 사용자 단말로 결제 대기 알림 또는 픽업 대기 알림과 함께 식별 정보를 전송하고, 상기 식별 정 보에 대응하는 판매 완료 정보를 수신하여 상기 주문 정보에 대한 판매 절차를 종료한다. 또한, 본 명세서의 일 실시예에서 상기 프로세서는 상기 판매 완료 정보를 수신한 뒤, 상기 결제가 이루어진 관 심 상품의 사용방법 안내 정보, 불량품 자가진단 정보, 상기 팝업 대상 콘텐츠의 응원노래 정보 중 적어도 하나 를 포함하는 상품 이용 정보를 상기 사용자 단말로 제공한다. 또한, 본 명세서의 일 실시예에서 상기 판매 완료 정보는 상기 사용자 단말에 표시된 식별 정보를 상기 팝업 스 토어 내부에 구비된 식별 장치에 접촉하거나, 태깅(Tagging)하여 생성된다. 또한, 본 명세서의 일 실시예에서 상기 프로세서는 상기 팝업 스토어 서비스를 활성화시키기 전, 상기 사용자 단말로부터 사용자 가입 정보를 수신하고, 상기 사용자 가입 정보에 기초하여 사용자 인증이 완료된 사용자 단 말에 대해서만 상기 팝업 스토어 서비스를 활성화시킨다. 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치의 동작 방법은 복수의 사용자 단말 각각의 위치 및 팝업 대상 콘텐츠에 따라 서로 다른 지역에 생성되는 팝업 스토어의 위치에 기반하여 상기 복수의 사용자 단말 중 일 부에 대해 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스를 활성화시키는 동작, 상기 팝업 대상 콘텐츠와 관련 된 상품 리스트를 상기 사용자 단말 각각에 제공하는 동작, 상기 복수의 사용자 단말로부터 상기 상품 리스트에 포함된 상품 중 선택된 관심 상품의 주문 정보를 수신하면, 상기 주문 정보를 수신한 순서에 따라 사용자 단말 각각에 대기 순번 정보를 제공하는 동작, 상기 대기 순번 정보에 따라 판매 완료 정보를 수신하면, 상기 주문정보에 대한 판매 절차를 종료하는 동작을 포함한다. 또한, 본 명세서의 일 실시예에서 팝업 스토어 서비스를 활성화시키는 동작은 상기 복수의 사용자 단말 각각의 위치와 미리 설정된 바운더리를 비교하고, 상기 복수의 사용자 단말 중 상기 바운더리 내에 위치한 사용자 단말 에 대하여 상기 팝업 스토어 서비스를 활성화시키는 동작을 포함한다. 또한, 본 명세서의 일 실시예에서 상기 바운더리는 상기 팝업 스토어의 위치를 기준으로 소정의 반경을 갖도록 설정된다. 또한, 본 명세서의 일 실시예에서 상품 리스트를 상기 사용자 단말 각각에 제공하는 동작은 바운더리내에 위치 한 사용자 단말 중 특정 주기의 시간에 선착순 또는 임의의 n명의 사용자 단말에 경품을 제공하거나, 상기 상품 리스트에 포함된 상품의 할인 구매 기회를 제공하는 동작을 더 포함한다. 또한, 본 명세서의 일 실시예에서 상품 리스트를 상기 사용자 단말 각각에 제공하는 동작은 바운더리내에 위치 한 사용자 단말 중 상기 팝업 스토어와의 거리가 가장 가까운 n명의 사용자 단말에 인기 상품 리스트를 더 전송 하는 동작을 더 포함한다. 또한, 본 명세서의 일 실시예에서 팝업 스토어의 위치는 상기 팝업 대상 콘텐츠의 종류 및 상기 팝업 대상 콘텐 츠와 관련된 콘텐츠 일정에 따라 달라진다. 또한, 본 명세서의 일 실시예에서 팝업 스토어 서비스를 활성화시키는 동작은 통신 회로를 통해, 상기 사용자 단말로 제공되는 상기 팝업 대상 콘텐츠와 연관된 실행 화면 내에 포함되는 복수의 그래픽 오브젝트들의 상태를 활성화 상태로 제어 가능하도록 상기 팝업 스토어 서비스를 활성화시키는 동작을 포함한다. 또한, 본 명세서의 일 실시예에서 상기 주문 정보는 상기 상품의 선택 정보 및 결제 유형 정보를 포함하고, 상 기 결제 유형 정보가 카드 결제인 경우 상기 대기 순번 정보는 상품 픽업 대기 번호이고, 상기 결제 유형 정보 가 현금 결제인 경우 상기 대기 순번 정보는 결제 대기 번호이다. 또한, 본 명세서의 일 실시예에서 사용자 단말 각각에 대기 순번 정보를 제공하는 동작은 주변 상점 정보, 상기 팝업 대상 콘텐츠에 대한 설문 정보, AR 홀로그램, 이벤트 확인 서비스 중 적어도 하나를 포함하는 부가 정보를 함께 제공하는 동작을 포함한다. 또한, 본 명세서의 일 실시예에서 주문 정보에 대한 판매 절차를 종료하는 동작은 특정 사용자의 대기 순번이 미리 설정된 순번 범위에 포함되면 상기 제어 모듈이 상기 특정 사용자 단말로 결제 대기 알림 또는 픽업 대기 알림과 함께 식별 정보를 전송하고, 상기 식별 정보에 대응하는 판매 완료 정보를 수신하여 상기 주문 정보에 대한 판매 절차를 종료하는 동작을 포함한다. 또한, 본 명세서의 일 실시예에서 판매 완료 정보를 수신한 뒤, 상기 제어 모듈이 상기 결제가 이루어진 관심 상품의 사용방법 안내 정보, 불량품 자가진단 정보, 상기 팝업 대상 콘텐츠의 응원노래 정보 중 적어도 하나를 포함하는 상품 이용 정보를 상기 사용자 단말로 제공하는 동작을 포함한다. 또한, 본 명세서의 일 실시예에서 판매 완료 정보는 사용자 단말에 표시된 식별 정보를 상기 팝업 스토어 내부 에 구비된 식별 장치에 접촉하거나, 태깅(Tagging)하여 생성된다. 또한, 본 명세서의 일 실시예에서 팝업 스토어 서비스를 활성화시키기 전, 상기 제어 모듈이 상기 사용자 단말 로부터 사용자 가입 정보를 수신하고, 상기 사용자 가입 정보에 기초하여 사용자 인증이 완료된 사용자 단말에 대해서만 상기 팝업 스토어 서비스를 활성화시키는 동작을 더 포함한다."}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치 및 방법은 사용자 단말을 이용하여 사용자가 직접 상품 주문서를 작성하고, 상품 결제를 진행함으로써, 상품 누락 또는 중복을 방지하고, 신속한 팝업 스토어 운영을 할 수 있다. 또한, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치 및 방법은 실시간으로 주문 수량을 반영함으로써 재고 수량만큼만 판매하고, 상품 품절에 따른 이용자의 불필요한 대기 시간 소요를 사전에 방지할 수 있다. 또한, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치 및 방법은 바운더리 내에 있는 사용자 단말로 팝업 스토어 서비스를 제공하여 팝업 스토어 방문 없이도 사용자가 상품 선택 및 결제를 진행하도록 함으로써, 팝업 스토어 내부의 혼잡도를 현저하게 감소시킬 수 있다."}
{"patent_id": "10-2023-0108795", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 각 도면을 설명하면서 유사한 참조부호를 유사한 구성요소에 대해 사용하였다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어 들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있 고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항 목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 여기서, 이용자는 종래의 팝업 스토어를 이용하기 위해 방문한 사람을 의미하고, 사용자는 팝업 스토어 운영 장 치에서 제공하는 어플리케이션을 사용하는 사람을 의미하고, 관리자는 팝업 스토어 운영 장치를 이용하여 상품 판매 등의 팝업 스토어 서비스를 제공하는 사람을 의미한다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세하게 설명한다. 도 6은 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치의 구성도이다. 도면을 참조하면, 팝업 스토어 운영 장치는 팝업 스토어에서 제공하는 상품 판매 등 다양한 서비스를 사용 자에게 제공하기 위한 장치로써, 메모리, 통신 회로, 프로세서를 포함한다. 메모리는 런타임(runtime)에서 프로세서가 필요로 하는 인스트럭션들 및 데이터를 저장한다. 도 6에서 메 모리는 서버 내부에 위치한 것으로 표현되어 있으나, 반드시 이에 한정되는 것은 아니며 서버 외부에 위치할 수 있다. 통신 회로는 팝업 스토어 운영 장치가 네트워크 내에서 데이터를 송신 및 수신하는 것을 허용하도록 구성된다. 통신 회로는 예컨대, TCP/IP 계층의 통신 회로일 수 있으며, 외부 장치와 통신 연결이 가능하도 록 하나 이상의 네트워크 인터페이스 카드(Network Interface Card; NIC)를 포함할 수 있다. 이를 통해, 통신 회로는 외부 서버로부터 팝업 스토어 관련 정보 및 팝업 대상 콘텐츠 정보 등 각종 데이터를 수신할 수 있 다. 프로세서는 메모리와 같은 컴퓨터-판독 가능 매체 내에 저장되는 컴퓨터 명령어들을 실행하도록 구성된다. 프로세서는 적어도 하나 이상으로 구비될 수 있으며, 예컨대, 중앙 처리 장치(Central Processing Unit; CPU), 마이크로프로세서(Micro Processor; MPU), 그래픽 처리 장치(Graphical Processing Unit; GPU), AP(Application Processor) 또는 DSP(Digital Signal Processor)일 수 있으나, 이에 한정되는 것은 아니며, 컴 퓨터 명령어들을 실행할 수 있는 모든 처리 장치를 포함할 수 있다. 일 실시예에서, 프로세서는 사용자 정보 관리 모듈, 위치 추적 모듈, 연산 모듈 및 제어 모듈을 포함할 수 있다. 사용자 정보 관리 모듈은 사용자 단말을 통해 입력되는 사용자의 가입 정보를 관리한다. 여기서, 사용자는 팝업 스토어 운영 장치에서 제공하는 어플리케이션을 이용하는 이용자를 의미하며, 사용자 단말은 사진들, 비디오들, 문자들과 같은 콘텐트를 사용자에게 디스플레이하는 것이 가능한 여하한 컴퓨팅 디바이스일 수 있다. 예컨대, 사용자 단말은 랩톱 컴퓨터, 데스크톱 컴퓨터, 모바일 전화기, 개인 휴대 정보 단말기(Personal Digital Assistant; PDA), 태블릿 컴퓨터, 넷북, 물리적 머신(physical machine) 또는 가상 머신(virtual machine)일 수 있다. 또한, 가입 정보는 사용자의 선호 콘텐츠 정보, 취향, 참여 경험, 참여 횟수 등의 인적 정보 및 성별, 이름, 생 년월일, 핸드폰 번호, 국가, 이메일 주소 등의 개인 정보 중 적어도 하나를 포함할 수 있다. 사용자 정보 관리 모듈은 가입자의 가입 정보를 구매 이력 및 활동 이력과 매칭시켜 데이터 베이스화하고, 데이터 베이스화된 정보를 빅데이터로 활용하여 분석할 수 있도록 후술할 연산 모듈에 제공할 수 있다. 위치 추적 모듈은 사용자 단말의 위치를 추적한다. 위치 추적 모듈은 사용자 단말에 포함된 GPS(Global Positioning System) 모듈로부터 사용자 단말의 위치 신호를 수신하며, 수신한 사용자 단말의 위치 신호를 실시간으로 기록하여 사용자의 위치를 추적할 수 있다. 연산 모듈은 위치 추적 모듈을 통해 획득한 사용자 단말의 위치를 이용하여 사용자 단말이 미리 설정 된 바운더리 내에 위치하는지 여부를 판단한다. 연산 모듈은 덧셈, 뺄셈, 곱셈, 나눗셈 등의 산술연산, 논 리곱, 논리합, 부정 등의 논리연산을 수행하며, 데이터 분류/분석이 가능한 인공지능 모델을 포함할 수 있다. 또한, 연산 모듈은 연산에 필요한 데이터를 메모리에서 가져오고, 연산 결과를 다시 메모리로 보내서 저장한다. 제어 모듈은 팝업 스토어 운영 장치의 전반적인 동작을 제어한다. 연산 모듈 및 제어 모듈 의 세부 동작은 후술하여 상세히 설명하도록 한다. 도 7은 본 명세서의 일 실시에에 따른 팝업 스토어 운영 장치 및 외부 장치 간의 동작 흐름도이다. 도면을 참조하면, 팝업 스토어 운영 장치는 팝업 스토어 관련 정보 및 팝업 대상 콘텐츠를 이용하여 팝업 스토어의 위치(운영 장소)를 결정한다. 팝업 스토어의 위치는 팝업 대상 콘텐츠에 따라 특정 지역으로 결정될 수 있으며, 특정 지역은 팝업 대상 콘텐츠의 종류 및 팝업 대상 콘텐츠와 관련된 콘텐츠 일정에 따른 서로 다른 지역으로 결정될 수 있다. 여기서, 팝업 대상 콘텐츠는 팝업 스토어의 목적이 되는 콘텐츠이며(예를 들어, 아이돌이나 유명 연예인), 팝업 스토어 관련 정보는 팝업 대상 콘텐츠의 공연 일정 또는 공연 장소 등 팝업 스토어를 개설하기 위해 필요한 정 보일 수 있다. 일 실시예에서, 팝업 스토어 관련 정보 및 팝업 대상 콘텐츠 정보는 연예인 소속사 등의 외부 서버로부터 획득할 수 있다. 팝업 스토어의 위치가 결정되면, 팝업 스토어 운영 장치는 사용자 단말의 위치 및 팝업 스토어의 위치 에 기반하여 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스를 활성화시킬 수 있다. 이때, 팝업 스토어 서비스를 활성화시킨다는 것은 통신 회로를 통해, 사용자 단말로 제공되는 팝업 대상 콘텐츠 와 연관된 실행 화면 내에 포함되는 복수의 그래픽 오브젝트들의 상태를 활성화 상태로 제어 가능하도록 팝업 스토어 서비스를 활성화시키는 것을 의미할 수 있다. 구체적으로, 팝업 스토어 운영 장치는 사용자 단말로부터 사용자의 위치 정보를 수신하고, 팝업 스토어 의 위치를 확인한다. 이후, 팝업 스토어 운영 장치는 연산 모듈을 이용하여 사용자 단말의 위치와 미리 설정된 바운더리를 비교한다. 미리 설정된 바운더리는 팝업 스토어의 위치를 기준으로 소정의 반경을 갖도 록 설정된 범위일 수 있고, 바운더리는 팝업 스토어의 위치 및 팝업 대상 콘텐츠에 따라 달라질 수 있다. 사용자 단말은 복수일 수 있으며, 이 경우 연산 모듈은 복수의 사용자 단말 중 바운더리 내에 위 치한 사용자 단말에 대하여만 활성화 신호를 전송하여 팝업 스토어 서비스를 활성화시킬 수 있다. 이와 같이, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치는 바운더리 내에 있는 사용자 단말로 팝업 스 토어 서비스를 제공함으로써, 팝업 스토어 내부로 방문하거나 팝업 스토어 근처에 줄을 서지 않아도 사용자가 상품 선택 및 결제를 진행할 수 있고, 팝업 스토어 내부가 다수의 사용자로 인해 혼잡해지는 것을 방지할 수 있 다. 다른 실시예에서, 사용자 정보 관리 모듈은 사용자 단말로부터 위치 정보를 수신하기 전, 사용자 인증 절차를 수행할 수 있다. 즉, 사용자 단말로부터 사용자 가입 정보 및 로그인 정보를 수신하고, 로그인 정보를 사용자 가입 정보와 매칭함으로써, 사용자 인증 절차를 수행할 수 있다. 이때, 제어 모듈은 사용자 인증이 완료된 사용자 단말에 대해서만 팝업 스토어 서비스를 활성화시킬 수 있다. 한편, 제어 모듈은 활성화 신호를 사용자 단말에 전송하면서, 팝업 대상 콘텐츠와 관련된 상품 리스트를 사용자 단말에 제공할 수 있다. 상품 리스트는 팝업 대상 콘텐츠의 상품에 대한 이미지, 판매 가능 수량, 재고량, 판매 금액, 상품 설명 정보 중 적어도 하나를 포함할 수 있으며, 예컨대, 팝업 대상 콘텐츠가 유명 가 수 A인 경우 상품 리스트는 유명 가수 A의 음반, 응원봉, A의 캐리커쳐가 그려진 티셔츠 또는 바지 등일 수 있 다. 일 실시예에서, 팝업 스토어 운영 장치는 바운더리 내에 위치한 사용자들에게 위치 기반 차등 서비스를 제 공할 수 있다. 위치 기반 차등 서비스는 다양한 형태로 제공될 수 있으며, 예를 들어, 팝업 스토어 운영 장치 는 특정 주기의 시간에 선착순 또는 임의의 n명의 사용자 단말에 경품을 제공하거나, 상품 할인 구매 기회 를 제공하는 등의 특별 서비스를 제공할 수 있으며, 팝업 스토어와의 거리가 가장 가까운 n명의 사용자 단말에 만 인기 상품에 대한 인기 상품 리스트를 전송하여 인기 상품 우선 구매 기회를 제공할 수 있다. 복수의 사용자가 사용자 단말을 이용하여 상품 리스트에 포함된 상품 중 구매 의사가 있는 관심 상품을 각각 선 택하고, 팝업 스토어 운영 장치가 복수의 관심 상품이 포함된 주문 정보를 수신하면, 제어 모듈은 주 문 정보를 수신한 순서에 따라 사용자 단말 각각에 대기 순번 정보를 제공한다. 일 실시예에서, 제어 모듈은 대기 순번 정보를 제공할 때, 주변 상점 정보, 상기 팝업 대상 콘텐츠에 대한 설문 정보, AR 홀로그램, 이벤트 확인 서비스 중 적어도 하나를 포함하는 부가 정보를 함께 제공할 수 있다. 이와 같이, 부가 정보를 함께 제공함으로써, 대기 순번을 기다리는 동안 사용자가 다양한 활동을 하며, 지루하 지 않게 대기 시간을 보낼 수 있다. 또한, 주변 상점 정보를 통해 주변 상점을 함께 이용함으로써 주변 상권 활 성화에도 기여할 수 있으며, 팝업 스토어 운영 장치의 서비스 제공자는 주변 상권과의 협약을 통해 광고 수익을 창출할 수 있다. 한편, 주문 정보는 관심 상품 정보 및 결제 유형 정보를 포함하고, 결제 유형 정보는 카드 결제 및 현금 결제를 포함할 수 있다. 제어 모듈은 결제 유형 정보가 카드 결제인 경우 대기 순번 정보를 상품 픽업 대기 번호로 제공하고, 경제 유형 정보가 현금 결제인 경우 대기 순번 정보를 결제 대기 번호로 제공할 수 있다. 상품 픽업 대기 번호 및 결 제 대기 번호는 서로 다른 별개의 순번으로 생성되어 제공/관리될 수 있다. 이후, 제어 모듈은 대기 순번 정보에 따라 판매 완료 정보를 수신하여, 관심 상품에 대한 판매 절차를 종 료할 수 있다. 보다 상세하게, 제어 모듈은 특정 사용자의 대기 순번이 미리 설정된 순번 범위에 포함되면 상기 특정 사용자 단말로 결제 대기 알림 또는 픽업 대기 알림과 함께 식별 정보를 전송한다. 미리 설정된 순번 범위는 예컨대, 50 또는 100 등의 고정값으로 설정되거나, 대기 인원 비율에 비례하여 변동 가능한 변동값으로설정될 수 있다. 식별 정보는 사용자의 대기 순번을 확인할 수 있도록 임시 생성된 코드로 예컨대, QR코드일 수 있다. 사용자가 팝업 스토어 내부에 구비된 식별 장치에 식별 정보를 접촉하거나, 태깅(Tagging)하면 제어 모듈은 태깅된 식별 정보와 대기 순번 범위를 비교하고, 태깅된 식별 정보가 대기 순번 범위 이내이면, 판매 완료 정보를 생성 하여 주문 정보에 대한 판매 절차를 종료한다. 이때, 대기 순번 정보가 상품 픽업 대기 번호가 아닌 결제 대기 번호이면 제어 모듈은 식별 장치 태깅과 별도로 상품 결제를 통한 결제 완료 신호를 수신하여야 판매 완료 정보를 생성할 수 있다. 이와 같이, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치는 사용자 단말을 이용하여 사용자가 직접 상 품 주문 및 상품 결제를 진행함으로써, 상품 누락 또는 중복을 방지하고, 신속한 팝업 스토어 운영을 할 수 있 다. 또한, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치는 실시간으로 상품의 주문 수량을 반영하여 준비된 재고 수량과 비교함으로써, 상품 품절에 따른 사용자의 불필요한 대기 시간 낭비를 사전에 방지할 수 있다. 판매 완료 정보를 수신한 이후, 사용자 단말로부터 결제가 이루어진 관심 상품의 상품 이미지를 수신하면 제어 모듈은 사용자 단말로 상품 이용 정보를 전송할 수 있다. 상품 이용 정보는 결제가 이루어진 관심 상품의 사용방법 안내 정보, 불량품 자가 진단 정보, 팝업 대상 콘텐츠 의 응원노래 정보 중 적어도 하나를 포함할 수 있다. 도 8 내지 도 17은 본 명세서의 일 실시예에서 사용자 단말에 표시된 팝업 스토어 운영 장치의 어플리케이션 화 면을 나타낸 도면이다. 구체적으로, 도 8은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토 어 운영 장치의 로그인 및 사용자 가입 화면을 나타낸 도면이고, 도 9는 본 명세서의 일 실시예에서 사용자 단 말에 디스플레이된 팝업 스토어 운영 장치의 메인 화면을 나타낸 도면이고, 도 10은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 상품 리스트 화면을 나타낸 도면이고, 도 11은 본 명세서 의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 관심 상품 화면을 나타낸 도면이고, 도 12는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 주문 정보 화면을 나타 낸 도면이고, 도 13은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 주문 완료 화면을 나타낸 도면이고, 도 14는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운 영 장치의 부가 정보 화면을 나타낸 도면이고, 도 15는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 대기 순번 정보 화면을 나타낸 도면이고, 도 16은 본 명세서의 일 실시예에서 사용자 단말을 이용하여 구매한 관심 상품을 촬영하는 화면을 나타낸 도면이고, 도 17은 본 명세서의 일 실시예에서 사 용자 단말에 디스플레이된 팝업 스토어 운영 장치의 상품 이용 정보를 나타낸 도면이다. 이하, 도 8 내지 도 17 을 참조하여 사용자 단말에서의 팝업 스토어 운영 장치의 동작을 설명하도록 한다. 도 8을 참조하면, 사용자 단말에 디스플레이 되는 팝업 스토어 운영 장치의 어플리케이션 초기 화면(c) 및 사용 자의 가입 정보를 입력하는 가입 정보 입력 화면(d)을 나타낸다. 일 실시예에서 가입 정보는 사용자의 이름, 이 메일주소, 비밀번호, 전화번호, 국가 등이 있으며, 사용자 정보 관리 모듈은 입력된 사용자의 가입 정보를 데이터 베이스화하여 관리할 수 있다. 사용자 로그인에 성공하면 제어 모듈은 도 9와 같이 메인 화면을 제공하고, 메인 화면은 상품 구매 항목 , 주문 확인 항목, 기타 정보 항목, 대기 순번 확인 항목 등을 포함한다. 전술한 바와 같 이, 메인 화면의 각 항목은 사용자 단말의 위치가 미리 설정한 바운더리 이내이면 활성화될 수 있다. 도 10은 사용자가 상품 구매 항목을 선택하면, 디스플레이 되는 사용자 단말의 화면이다. 팝업 대상 콘텐 츠와 관련된 상품 리스트가 표시되며, 품절된 상품은 블록 처리된다. 상품 리스트 중 사용자가 구매 의사를 갖는 관심 상품(40, 50)을 선택하면, 제어 모듈은 도 11과 같이 관 심 상품의 수량 및 옵션을 선택할 수 있는 상세 페이지를 제공하며, 사용자가 적어도 하나의 관심 상품을 선택 하면 도 12와 같이 주문 정보를 생성한다. 주문 정보는 상품의 선택 정보 및 결제 유형 정보를 포함하고, 경제 유형 정보는 카드 결제(Card, 60) 및 현금 결제(Cash, 70)를 포함할 수 있다. 이하에서는 카드 결제를 전제로 하여 설명하도록 한다. 이후, 도 13과 같이 주문이 완료되면(g) 주문 정보 수신 순서에 따라 대기 순번 정보가 부여된다(h). 일 실시예에서, 제어 모듈은 대기 순번 정보를 사용자 단말로 전송할 때, 부가 정보를 함께 제공할 수 있 다. 부가 정보는 AR 홀로그램, 이벤트 확인 서비스 및 도 14의 (i)에 도시된 주변 상점 정보, 팝업 대상 콘텐츠 에 대한 설문 정보(j) 중 적어도 하나를 포함할 수 있다. 팝업 스토어 운영 장치는 수집된 설문 정보(j)에 대하여 분석 및 데이터 베이스화할 수 있고, 관리자는 데 이터 베이스의 축적을 통해 마련된 빅데이터를 이용하여 비즈니스 마케팅에 활용할 수 있다. 이후, 사용자의 대기 순번이 돌아오거나, 대기 순번이 미리 설정된 순번 범위에 포함되면 제어 모듈은 도 15와 같이 사용자 단말로 핍업 대기 알람과 함께 식별 정보를 전송한다(k). 식별 정보는 예컨대, QR코드일 수 있으며, 식별 정보를 팝업 스토어 내부에 구비된 식별 장치에 태깅함으로써 판매 완료 정보가 생성된다(l). 사용자가 도 16과 같이 사용자 단말을 이용하여 구매한 관심 상품을 촬영 또는 스캐닝하여 사진 이미지를 전송 하면, 제어 모듈은 결제가 이루어진 관심 상품에 대한 상품 이용 정보를 제공한다. 일 실시예에서, 관심 상품을 촬영 또는 스캐닝할 때, 사용자 단말의 화면를 통해 관심 상품 오브젝트 주변에 다 양한 이펙트가 디스플레이될 수 있다. 예컨대, 도 16에 도시된 것처럼 관심 상품이 응원봉이면, 관심 상품의 촬 영 또는 스캐닝에 따라 응원봉 헤드가 회전하거나, 응원봉 헤드 주변에서 반짝거리는 섬광효과가 사용자 단말 화면에 표시될 수 있다. 이와 같이, 다양한 이펙트를 통해 상품 동작의 이해도를 높이고, 상품 판매량을 증가시 킬 수 있다. 또한, 상품 이용 정보는 도 17의 관심 상품의 사용방법 안내 정보(m), 팝업 대상 콘텐츠의 응원노래 정보(n), 불량품 자가진단 정보(o) 중 적어도 하나를 포함할 수 있다. 이와 같이, 팝업 스토어 운영 장치는 사용자가 구매한 관심 상품에 대한 다양한 이용 정보를 사용자 단말로 즉시 제공함으로써 상품 문의 집중에 따른 공간 복잡도를 최소화할 수 있다. 또한, 팝업 스토어 운영 장치는 모바일을 통하여 결제 및 이용 정보 안내 서비스를 제공함으로써, 사용자 측면에서 장시간 줄서기에 대한 피로도를 감소시킬 수 있고, 실시간으로 상품 구매 가능 여부 및 수량 확인이 가능하다. 운영자 측면에서도 포스(pos)기의 임대 수량, 배너와 주문서 제작 비용 및 근로 인원을 줄이고, 팝업 스토어 운영 비용을 절감할 수 있다. 도 18 내지 도 26은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 어플리케 이션 화면을 나타낸 도면이다. 구체적으로, 도 18은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝 업 스토어 운영 장치의 회원 관리 화면을 나타낸 도면이고, 도 19는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 상품 관리 화면을 나타낸 도면이고, 도 20은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 상품 재고 화면을 나타낸 도면이고, 도 21은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 주문 내역 화면을 나타낸 도면이고, 도 22 는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 주문 관리 화면을 나타낸 도면이고, 도 23은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 대기 순번 정보 제공 화면을 나타낸 도면이고, 도 24는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토 어 운영 장치의 픽업 대기 중인 주문 목록 화면을 나타낸 도면이고, 도 25는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 픽업 완료된 주문 목록 화면을 나타낸 도면이고, 도 26은 본 명 세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 매출 관리 화면을 나타낸 도면이다. 이하, 도 18 내지 도 26을 참조하여 관리자 화면에서의 팝업 스토어 운영 장치의 동작을 설명하도록 한다. 도면을 참조하면, 도 18에는 사용자의 가입 정보가 저장되어 가입 정보 리스트를 확인할 수 있고, 도 19에는 관 리자가 팝업 대상 콘텐츠와 관련된 상품 리스트가 저장되어 있다. 상품 리스트 중 하나를 선택하면, 도 20과 같이 상품의 상세 내역이 표시되며, 사이즈 및 옵션 별로 입고 수량, 판매 수량, 재고 수량 및 불량 수량이 실시간으로 반영된다. 따라서, 상품 실 재고량과 관계없이 이용자들로부 터 상품 주문을 받음으로써 환불 절차와 함께 이용자들의 불만을 처리해야 했던 종래의 방식과는 달리, 사용자 들의 총 주문 수량이 재고 수량을 초과하면 품절 상태로 즉시 상태 변경하여 사용자의 상품 품절로 헛걸음하는 문제 및 이로 인해 발생하는 불만을 사전에 예방할 수 있다. 도 21을 참조하면, 사용자 단말로부터 수신한 주문 정보가 표시된다. 이와 같이 복수의 사용자 단말로부터 수신 한 주문 정보에 대하여 연산 모듈은 도 22와 같이 수신한 순서에 따라 대기 순번 정보를 부여한다. 이후, 제어 모듈은 사용자의 대기 순번이 미리 설정된 순번 범위에 포함되면 상기 특정 사용자 단말로 결 제 대기 알림 또는 픽업 대기 알림과 함께 식별 정보를 전송하고(도 23), 사용자가 식별 정보를 팝업 스토어 내 부에 구비된 식별 장치에 접촉하거나, 태깅하면 판매 완료 정보가 생성되며 판매 절차가 종료된다. 관리자 화면에는 도 24 및 도 25와 같이, 판매 완료 정보 수신 여부에 따라 대기 순번은 픽업 대기중(도 24) 또 는 픽업 완료(도 25)로 표시된다. 도 26에서 제어 모듈은 판매 완료 정보를 수집하여 일별/상품별/날짜별 매출, 판매량, 회원 가입 정보 등 을 제공한다. 이와 같이, 본 명세서의 팝업 스토어 운영 장치는 다양한 매출 데이터를 이용하여 빅데이터를 확 보 및 분석함으로써, 마케팅 및 향후 열릴 팝업 스토어에 활용할 수 있다. 도 27은 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치의 동작 방법 흐름도이다. 도면을 참조하면, 본 명세서의 팝업 스토어 운영 장치는 복수의 사용자 단말 각각의 위치 및 팝업 대상 콘텐츠 에 따라 서로 다른 지역에 생성되는 팝업 스토어의 위치에 기반하여 복수의 사용자 단말 중 일부에 대하여 팝업 대상 콘텐츠와 관련된 팝업 스토어 서비스를 활성화시키고(S110), 팝업 스토어 서비스가 활성화되면 팝업 대상 콘텐츠와 관련된 상품 리스트를 사용자 단말 각각에 제공한다(S120). 이후, 복수의 사용자 단말로부터 상품 리스트에 포함된 선택 상품의 구매 정보를 수신하면, 팝업 스토어 운영 장치는 구매 정보를 수신한 순서에 따라 각 사용자 단말로 대기 순번 정보를 제공한다(S130). 마지막으로, 팝업 스토어 운영 장치는 대기 순번 정보에 기초하여 판매 완료 정보를 수신하면, 상기 선택 상품 에 대한 판매 절차를 종료한다(S140). 이와 같이, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치 및 방법은 사용자 단말을 이용하여 사용자가 직접 상품 주문서를 작성하고, 상품 결제를 진행함으로써, 상품 누락 또는 중복을 방지하고, 신속한 팝업 스토 어 운영을 할 수 있다. 또한, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치 및 방법은 실시간으로 주문 수량을 반영함으로써 재고 수량만큼만 판매하고, 상품 품절에 따른 이용자의 불필요한 대기 시간 소요를 사전에 방지할 수 있다. 또한, 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치 및 방법은 바운더리 내에 있는 사용자 단말로 팝업 스토어 서비스를 제공하여 팝업 스토어 방문 없이도 사용자가 상품 선택 및 결제를 진행하도록 함으로써, 팝업 스토어 내부의 혼잡도를 현저하게 감소시킬 수 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24 도면25 도면26 도면27"}
{"patent_id": "10-2023-0108795", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 팝업 스토어 내부에 전시된 전시물을 나타낸 도면이다. 도 2는 종래의 팝업 스토어 운영 기간내에 몰려든 인파를 나타낸 도면이다. 도 3은 종래의 팝업 스토어에서 배포되는 상품 주문서를 나타낸 도면이다. 도 4는 종래의 팝업 스토어에서 사용되는 상품 목록 배너를 나타낸 도면이다. 도 5는 종래의 팝업 스토어에서 상품 결제를 위해 사용되는 결제 시스템을 나타내는 도면이다. 도 6은 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치의 블록도이다. 도 7은 본 명세서의 일 실시에에 따른 팝업 스토어 운영 장치 및 외부 장치 간의 동작 흐름도이다. 도 8은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 로그인 및 사용자 가 입 화면을 나타낸 도면이다. 도 9는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 메인 화면을 나타낸 도면이다. 도 10은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 상품 리스트 화면을 나타낸 도면이다. 도 11은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 관심 상품 화면을 나 타낸 도면이다. 도 12는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 주문 정보 화면을 나 타낸 도면이다. 도 13은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 주문 완료 화면을 나 타낸 도면이다. 도 14는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 부가 정보 화면을 나 타낸 도면이다. 도 15는 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 대기 순번 정보 화면 을 나타낸 도면이다. 도 16은 본 명세서의 일 실시예에서 사용자 단말을 이용하여 구매한 관심 상품을 촬영하는 화면을 나타낸 도면 이다. 도 17은 본 명세서의 일 실시예에서 사용자 단말에 디스플레이된 팝업 스토어 운영 장치의 상품 이용 정보를 나 타낸 도면이다. 도 18은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 회원 관리 화면을 나 타낸 도면이다. 도 19는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 상품 관리 화면을 나 타낸 도면이다. 도 20은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 상품 재고 화면을 나 타낸 도면이다. 도 21은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 주문 내역 화면을 나 타낸 도면이다. 도 22는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 주문 관리 화면을 나타낸 도면이다. 도 23은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 대기 순번 정보 제공 화면을 나타낸 도면이다. 도 24는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 픽업 대기 중인 주문 목록 화면을 나타낸 도면이다. 도 25는 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 픽업 완료된 주문 목 록 화면을 나타낸 도면이다. 도 26은 본 명세서의 일 실시예에서 관리자 화면에 디스플레이된 팝업 스토어 운영 장치의 매출 관리 화면을 나 타낸 도면이다. 도 27은 본 명세서의 일 실시예에 따른 팝업 스토어 운영 장치의 동작 방법 흐름도이다."}
