{"patent_id": "10-2023-0099279", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0018564", "출원번호": "10-2023-0099279", "발명의 명칭": "초고속 유무선 인터넷 기반의 HMD류 XR 멀티펑션 XR ATM", "출원인": "김준형", "발명자": "김준형"}}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "초고속 유무선 인터넷을 이용하여 양방향 IP 망을 활용하여 가상공간 상에서 멀티펑션 기능의 XR ATM(CAM)을 구현하는 방법에 대한 특허 청구항:1. 사용자가 가상현실 프로그램을 실행하여 가상환경에 진입하는 단계(300)으로, 사용자는 헤드셋이나 기타 가상현실 장치를 통해 가상 세계로 접속하며, 높은 품질의 가상현실 환경을 경험한다. 이 단계에서 사용자는 현실과 구분되는 가상 환경에 진입하게 된다.2. 사용자 인터페이스를 통해 거래를 시작하고 사용자의 요구 사항에 따라 ATM이 가상환경 내에서 실제 ATM 기기처럼 동작하는 단계(200)으로, 가상 ATM 인터페이스를 통해 사용자는 다양한 거래 유형을 선택할 수있습니다. 사용자의 동작, 제스처 또는 음성 명령을 감지하여 해당 거래를 시작하고, 가상 환경 상에서 현실과유사한 ATM 기기의 동작을 체험할 수 있다.3. 거래 요청 정보를 거래 처리 서버로 전달하고 거래를 시뮬레이션하여 처리하는 단계(202)으로, 사용자가 선택한 거래 유형과 관련된 정보는 거래 처리 서버로 전송된다. 이러한 거래 요청 정보는 가상현실 환경 내에서시뮬레이션되어 처리되며, 실제 금융 시스템과 연동되어 실시간으로 거래가 이루어진다.4. 거래 완료 알림을 사용자에게 전달하는 단계(500)으로, 사용자가 진행한 거래가 성공적으로 처리되면 가상현실 환경 내에서 거래 완료 알림이 표시된다. 이를 통해 사용자는 자신의 거래 상태를 확인하고, 필요한 경우 추가적인 거래를 시작할 수 있다.따라서, 본 청구항은 사용자들이 초고속 유무선 인터넷과 가상현실 기술을 통해 혁신적이고 다양한 기능을 갖춘가상현실 기반의 멀티펑션 XR ATM(CAM) 시스템을 이용하여 편리하고 안전한 거래를 할 수 있도록 하는 방법에대한 특허를 요구한다. 이를 통해 금융 기관과 사용자들은 더 나은 금융 경험을 제공하고 새로운 비즈니스 기회를 창출할 수 있다. 또한, 가상공간 상에서의 거래 과정에서 발생하는 이미지와 데이터를 보호하고, 사용자의거래 정보의 안전성을 보장하며 무결성을 유지하는 시간 개념 이미지 보안 기능을 활성화하여 더욱 높은 보안수준을 제공한다. 이로써 미래의 금융산업을 변화시키고 혁신을 이끌어내는데 기여할 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "가상현실 환경 내에서 실제 ATM 기기의 기능을 제공하는 과정에서 사용자의 생체 정보, 예를 들면 지문 정보와얼굴 특징을 활용하여 사용자 인증을 수행하는 단계를 포함하는 가상공간 상의 멀티펑션 XR ATM(CAM: CurrencyAccess Machine) 시스템에 대한 특허 청구항:1. 사용자가 가상현실 프로그램을 실행하여 가상환경에 진입하는 단계(300)으로, 사용자는 가상현실 장치를 통해 가상 세계로 접속하게 된다. 이 단계에서 사용자는 현실과 구분되는 가상 환경에 진입하게 된다.2. 사용자 인터페이스를 통해 거래를 시작하고 사용자의 요구 사항에 따라 ATM이 가상환경 내에서 실제 ATM 기기처럼 동작하는 단계(200)으로, 가상 ATM 인터페이스를 통해 사용자는 다양한 거래 유형을 선택할 수 있다. 사용자의 동작, 제스처 또는 음성 명령을 감지하여 해당 거래를 시작하고, 가상 환경 상에서 현실과 유사한 ATM기기의 동작을 체험할 수 있다.3. 거래 요청 정보를 거래 처리 서버로 전달하고 거래를 시뮬레이션하여 처리하는 단계(202)으로, 사용자가 선택한 거래 유형과 관련된 정보는 거래 처리 서버로 전송된다. 이러한 거래 요청 정보는 가상현실 환경 내에서시뮬레이션되어 처리되며, 실제 금융 시스템과 연동되어 실시간으로 거래가 이루어진다.4. 사용자의 생체 정보, 예를 들면 지문 정보와 얼굴 특징을 활용하여 사용자 인증을 수행하는 단계(400)로, 사용자가 거래를 시작하기 위해 생체 정보를 제공하면 해당 정보는 인증 서버로 전달되어 사용자의 신원을 확인한다. 이를 통해 사용자는 보다 안전하고 신뢰성 있는 거래를 할 수 있다.5. 거래 완료 알림을 사용자에게 전달하는 단계(500)으로, 사용자가 진행한 거래가 성공적으로 처리되면 가상현공개특허 10-2025-0018564-3-실 환경 내에서 거래 완료 알림이 표시된다. 이를 통해 사용자는 자신의 거래 상태를 확인하고, 필요한 경우 추가적인 거래를 시작할 수 있다.따라서, 본 청구항은 사용자들이 가상현실 기반의 멀티펑션 XR ATM(CAM) 시스템을 통해 생체 정보를 활용한 사용자 인증을 수행하며, 혁신적이고 다양한 기능을 갖춘 가상현실 환경에서 편리하고 안전한 거래를 할 수 있도록 하는 방법에 대한 특허를 요구한다. 이를 통해 사용자들은 더욱 높은 보안 수준의 거래를 경험하고, 금융 기관은 사용자들의 만족도를 높일 수 있다. 또한, 가상현실 기술과 생체 인증 기술의 융합으로 더욱 혁신적인 서비스를 제공할 수 있으며, 미래의 금융산업과 디지털 시대의 발전에 기여할 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "시뮬레이션된 가상현실 상의 ATM 환경에서 사용자의 거래 요청 정보를 분석하고, 거래 요청 정보에 따라 현실세계의 현금 인출 기능 뿐만 아니라 디지털 자산 관리 기능, 송금 기능, 입금 기능 등 다양한 기능을 가상적으로 제공하는 단계를 포함하는 가상공간 상의 멀티펑션 XR ATM(CAM: Currency Access Machine) 시스템에 대한특허 청구항:1. 사용자가 가상현실 프로그램을 실행하여 가상환경에 진입하는 단계(300)으로, 사용자는 가상현실 장치를 통해 가상 세계로 접속하게 됩니다. 이 단계에서 사용자는 현실과 구분되는 가상 환경에 진입하게 된다.2. 사용자 인터페이스를 통해 거래를 시작하고 사용자의 요구 사항에 따라 ATM이 가상환경 내에서 실제 ATM 기기처럼 동작하는 단계(200)으로, 가상 ATM 인터페이스를 통해 사용자는 다양한 거래 유형을 선택할 수 있다. 사용자의 동작, 제스처 또는 음성 명령을 감지하여 해당 거래를 시작하고, 가상 환경 상에서 현실과 유사한 ATM기기의 동작을 체험할 수 있다.3. 거래 요청 정보를 거래 처리 서버로 전달하고 거래를 시뮬레이션하여 처리하는 단계(202)으로, 사용자가 선택한 거래 유형과 관련된 정보는 거래 처리 서버로 전송된다. 이러한 거래 요청 정보는 가상현실 환경 내에서시뮬레이션되어 처리되며, 실제 금융 시스템과 연동되어 실시간으로 거래가 이루어진다.4. 현실 세계의 현금 인출 기능 뿐만 아니라 디지털 자산 관리 기능, 송금 기능, 입금 기능 등 다양한 기능을가상적으로 제공하는 단계(203)로, 사용자가 요청한 거래 유형에 따라 가상현실 환경 내에서 해당 기능들이 시뮬레이션되어 제공된다. 이를 통해 사용자들은 가상 환경 상에서 더욱 다양한 금융 거래를 자유롭게 체험할 수있다.5. 거래 완료 알림을 사용자에게 전달하는 단계(500)으로, 사용자가 진행한 거래가 성공적으로 처리되면 가상현실 환경 내에서 거래 완료 알림이 표시된다. 이를 통해 사용자는 자신의 거래 상태를 확인하고, 필요한 경우 추가적인 거래를 시작할 수 있다.따라서, 본 청구항은 시뮬레이션된 가상현실 상의 ATM 환경에서 사용자의 다양한 거래 요청 정보를 분석하여 현실 세계의 현금 인출 기능 외에도 디지털 자산 관리 기능, 송금 기능, 입금 기능 등 다양한 기능을 가상적으로제공하는 가상공간 상의 멀티펑션 XR ATM(CAM: Currency Access Machine) 시스템에 대한 특허를 요구한다. 이를 통해 사용자들은 더욱 편리하고 다양한 옵션을 가진 거래를 할 수 있으며, 금융 기관은 새로운 사업 기회를창출하고 사용자들의 만족도를 높일 수 있다. 또한, 가상현실 환경 내에서 다양한 기능을 제공함으로써 사용자들의 금융 거래 경험이 향상되고, 더욱 혁신적인 금융 서비스를 제공할 수 있게 될 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "사용자가 가상환경에서 실시간으로 거래를 시뮬레이션하며 이때 발생하는 거래 이미지와 데이터를 고유한 시간개념 이미지 보안 기능으로 보호하는 단계를 포함하는 가상현실 기반의 멀티펑션 XR ATM(CAM: Currency AccessMachine) 시스템에 대한 특허 청구항:1. 사용자가 가상현실 프로그램을 실행하여 가상환경에 진입하는 단계(300)으로, 사용자는 가상현실 장치를 통해 가상 세계로 접속하게 된다. 이 단계에서 사용자는 가상 ATM 인터페이스를 통해 거래를 시작할 수 있으며,가상환경 상에서 현실과 구분되는 거래 시뮬레이션을 시작한다.2. 사용자의 거래 요청 정보를 거래 처리 서버로 전달하고 거래를 시뮬레이션하여 처리하는 단계(202)으로, 사공개특허 10-2025-0018564-4-용자가 선택한 거래 유형과 관련된 정보는 거래 처리 서버로 전송된다. 이러한 거래 요청 정보는 가상현실 환경내에서 시뮬레이션되어 처리되며, 실제 금융 시스템과 연동되어 실시간으로 거래가 이루어진다.3. 발생하는 거래 이미지와 데이터를 고유한 시간 개념 이미지 보안 기능으로 보호하는 단계로, 시간 개념 이미지 보안 기능은 [504: 시간 개념 이미지 보안 기능] 사용자의 거래 과정에서 생성되는 이미지와 데이터를 안전하게 보호하고 무결성을 유지한다. 이로써 사용자의 거래 정보는 외부로부터 안전하게 보호되며, 불법적인 접근이나 변조를 방지할 수 있다.4. 가상현실 기반의 멀티펑션 XR ATM(CAM: Currency Access Machine) 시스템은 사용자가 거래를 실시간으로 시뮬레이션하는 동안 거래 이미지와 데이터의 보안을 유지하면서 다양한 금융 거래를 안전하게 체험할 수 있는 기능을 갖추고 있다. 이를 통해 사용자들은 가상 환경 상에서 더욱 다양한 금융 거래를 자유롭게 체험하며, 금융기관은 더 높은 보안 수준을 유지하면서 혁신적인 금융 서비스를 제공할 수 있게 될 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "가상환경 내에서 사용자의 동작, 제스처 또는 음성 명령 등을 인식하여 해당 명령에 따른 거래를 처리하는 인공지능 기반의 사용자 상호작용 시스템에 대한 특허 청구항:사용자 상호작용 시스템은 [500: 가상환경 내 사용자 상호작용 시스템]으로서, 가상현실 기술과 인공지능 기술을 융합하여 구성되며, 사용자가 가상환경 내에서 자연스러운 동작, 제스처, 또는 음성 명령 등을 통해 거래를시작하고 처리할 수 있는 기능을 제공한다.인공지능 기반의 사용자 상호작용 시스템은 [501: 사용자 동작 및 음성 인식 시스템]을 통해 사용자의 동작과음성을 실시간으로 인식하고 해석하여 해당 명령을 거래 처리 서버로 전달한다. 이를 통해 사용자는 별도의 키보드나 마우스를 사용하지 않아도 간편하게 거래를 진행할 수 있다.사용자 상호작용 시스템은 딥러닝과 같은 고급 인공지능 알고리즘을 활용하여 [502: 사용자 동작 및 음성 학습시스템]을 통해 사용자의 동작과 음성을 지속적으로 학습하고 개선한다. 이로써 사용자의 편의성과 사용자 경험을 높여준다.인식된 사용자의 명령에 따라 거래를 처리하는 과정에서 보안 측면에서도 유의미한 기능을 가지고 있다. 사용자의 신원 인증 및 보안 토큰 생성 등은 이미지와 데이터 보호 시스템과 함께 [503: 보안 기능 시스템]을 통해 안전하게 처리된다.이러한 인공지능 기반의 사용자 상호작용 시스템은 사용자들에게 더욱 직관적이고 편리한 거래 경험을 제공할수 있으며, 금융 기관은 사용자들과의 상호작용을 통해 보다 신속하고 정확한 거래 처리를 이룰 수 있게 된다.더불어 사용자 상호작용 시스템은 사용자의 동작과 음성을 기반으로 한 인증 방법을 제공하여 보다 안전하고 효과적인 거래 환경을 조성한다. 이를 통해 금융 거래의 안전성과 사용자의 신뢰도를 높일 수 있다.인공지능 기반의 사용자 상호작용 시스템은 미래의 금융 산업과 디지털 시대에 발맞춰 사용자들의 요구에 더욱부합하는 혁신적인 서비스를 제공할 것으로 기대된다. 이를 통해 금융 기관과 사용자들은 더 나은 금융 경험과혜택을 누릴 수 있을 것이다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "가상환경 상에서의 거래 과정 중 생성되는 이미지와 데이터를 보호하고, 사용자의 거래 정보의 안전성을 보장하며 무결성을 유지하는 시간 개념 이미지 보안 기능을 활성화하는 단계를 포함하는 가상현실 기반의 멀티펑션 XRATM(CAM: Currency Access Machine) 시스템에 대한 특허 청구항:시간 개념 이미지 보안 기능은 [600: 이미지와 데이터 보호 시스템]으로서, 사용자가 가상환경 상에서 거래를진행할 때 생성되는 이미지와 데이터를 안전하게 보호하기 위한 핵심적인 요소이다. 이 기능은 거래가 발생한시점에 따라 [601: 시간 개념 이미지 보안 토큰 생성 시스템]을 활성화하여 이미지와 데이터의 무결성과 보안성을 보장한다.사용자의 거래 정보는 [602: 시간 개념 이미지 보안 토큰을 활용한 암호화 시스템]을 통해 암호화되며, 이를 통공개특허 10-2025-0018564-5-해 무단 접근을 방지하고 거래 정보의 안전성을 확보한다.이미지와 데이터의 유효기간은 거래가 진행되는 동안 [603: 유효기간 갱신 시스템]을 통해 지속적으로갱신되며, 유효기간이 만료되면 해당 이미지와 데이터는 자동으로 파기되어 더 이상 접근할 수 없도록 한다.또한, 시간 개념 이미지 보안 기능은 [604: 무결성 유지 및 위조 방지 시스템]을 통해 거래 정보의 변경 여부를감지하여 무결성을 유지하고 데이터 위조를 방지하는 기능을 수행한다. 이를 통해 사용자는 신뢰성 있는 거래를보장받을 수 있으며, 금융 기관은 보안적으로 안정적인 거래 환경을 조성할 수 있다.시간 개념 이미지 보안 기능은 [605: 딥러닝 기반 고급 보안 알고리즘 시스템]과 같은 고급 보안 알고리즘을 활용하여 더욱 높은 수준의 보안성을 제공한다. 이러한 기술적인 측면에서의 안전성은 사용자들의 신뢰도를 높이고 금융 기관의 이미지를 더욱 강화할 것으로 기대된다.이러한 가상현실 기반의 멀티펑션 XR ATM 시스템은 사용자들에게 더욱 안전하고 신뢰성 있는 거래 환경을 제공할 뿐만 아니라, 금융 기관들이 더 나은 보안 수준을 유지할 수 있도록 돕는다. 따라서 이러한 기술적인 혁신은금융산업의 미래를 이끄는데 큰 역할을 할 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "거래 처리 서버에서 사용자의 요청을 빠르고 정확하게 분석하고 적절하게 처리하여 사용자가 원하는 거래를 간단한 터치로 쉽게 완료할 수 있도록 돕는 단계를 포함하는 가상공간 상의 멀티펑션 XR ATM(CAM: CurrencyAccess Machine) 시스템에 대한 특허 청구항:거래 처리 서버는 [700: 빠른 거래 처리 시스템]을 통해 사용자의 거래 요청을 빠르게 분석하여 요청된 거래 유형을 파악하고, 해당 거래를 신속하고 정확하게 처리하는 기능을 수행한다.사용자의 거래 요청은 다양한 방법으로 이루어질 수 있으며, 이에 대한 [701: 다양한 입력 방식 인식 시스템]을인공지능 기술을 활용하여 사용자의 터치, 음성 명령, 제스처 등을 인식하여 해당 거래를 적절히 처리한다.거래 처리 서버는 [702: 빠른 응답 시간 및 정확한 거래 처리 시스템]을 통해 빠른 응답 시간과 정확한 거래 처리를 제공하여 사용자들이 원하는 거래를 간편하고 신속하게 완료할 수 있도록 도와준다.이러한 빠르고 정확한 거래 처리 기능은 사용자들의 만족도를 높이고, 금융 기관들이 더욱 효율적인 서비스를제공할 수 있도록 [703: 금융 서비스 효율화 시스템]한다.또한, 인공지능 기반의 거래 처리 시스템은 [704: 학습과 경험을 통한 최적화 기술]을 통해 더욱 최적화된 거래처리 능력을 발휘하며, 사용자들의 거래 습관과 요구를 더욱 정확하게 파악하여 [705: 맞춤형 서비스 제공 시스템]을 제공할 수 있다.이러한 기술적 혁신은 금융 기관들이 경쟁력을 강화하고 미래의 금융 산업에서 [706: 선도적인 위치 차지 시스템]하는데 기여할 것으로 기대된다. 빠른 거래 처리와 간편한 사용 방법은 사용자들의 편의를 증진시키고, 더욱높은 수준의 서비스를 제공하는데 도움이 될 것이다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "가상공간 상에서 실제 ATM과 유사한 경험을 제공하며, 디지털 자산을 활용하고 통합된 서비스를 제공하는 기능을 갖춘 가상현실 기반의 멀티펑션 XR ATM(CAM: Currency Access Machine) 시스템에 대한 특허 청구항:CAM 시스템은 [100: 현실적인 ATM 경험 제공 시스템]을 통해 사용자들에게 현실적이고 생생한 ATM 경험을 제공한다. 사용자들은 가상환경 내에서 마치 실제 ATM을 사용하는 듯한 [101: 인터랙션 시스템]과 사용자 경험을 즐길 수 있다.CAM 시스템은 다양한 디지털 자산을 활용하여 사용자들에게 편의성과 다양성을 제공한다. 가상 환경 내에서 디지털 자산을 관리하고 이용할 수 있으며, 가상화폐와 실제 화폐를 통합적으로 관리하여 [200: 다양한 거래 시스템]을 유연하게 수행할 수 있다.사용자들은 CAM 시스템을 통해 화폐 단위 변환, 디지털 자산 입출금, 송금, 결제 등 다양한 [300: 금융 서비스공개특허 10-2025-0018564-6-제공 시스템]을 편리하게 이용할 수 있다. 이러한 통합된 서비스는 사용자들이 여러 플랫폼과 기기를 왔다갔다하지 않고도 원스톱으로 거래를 완료할 수 있도록 한다.가상현실 기반의 멀티펑션 XR ATM(CAM) 시스템은 다양한 기술과 서비스의 융합을 통해 사용자들에게 [400: 혁신적인 경험 제공 시스템]을 제공한다. 가상현실 기술, 디지털 자산 관리 기술, 인공지능 기술 등이 통합되어 혁신적이고 차별화된 서비스를 제공할 수 있다.이러한 기능과 서비스는 금융산업과 사용자들에게 더욱 편리하고 효율적인 [500: 금융 서비스 제공 시스템]을제공하며, 디지털 자산의 중요성이 더욱 높아지는 미래의 금융 생태계에 부합하는 시스템으로서 큰 가치를 갖는다.CAM 시스템은 미래의 금융산업을 선도하고, 사용자들에게 더 나은 경험과 혁신적인 서비스를 제공함으로써[600: 금융 산업 혁신 기여 시스템]으로 금융 산업과 사용자들에게 긍정적인 영향을 미칠 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "딥러닝, 생성적 적대 신경망, 컴퓨터 비전 기술을 이용하여 가상현실 기반의 멀티펑션 XR ATM(CAM) 작품에 적용하는 생명시간함수(유효기간) = A * sin(B * t) + C * exp(D * t) + E * log(F * t + G) + H를 생성하고, 이를통해 작품의 특성을 조절하고 다양한 효과를 표현하는 단계를 포함하는 특허 청구항:CAM 시스템은 [100: 딥러닝 적용 시스템], [101: 생성적 적대 신경망 적용 시스템], [102: 컴퓨터 비전 기술 적용 시스템] 등 다양한 인공지능 기술을 적용하여 작품에 생명시간함수를 적용한다. 이러한 기술들은 [200: 가상현실 환경 내의 ATM 작품 혁신적 표현 제공 시스템]을 제공하며, CAM 시스템의 작품을 더욱 혁신적이고 창의적으로 만들어주는 기반을 제공한다.생명시간함수인 유효기간(A * sin(B * t) + C * exp(D * t) + E * log(F * t + G) + H)는 [300: 작품 특성 조절 시스템]을 통해 사용된다. A, B, C, D, E, F, G, H와 같은 [301: 매개변수 조절 시스템]을 조절함으로써 작품의 모양, 색상, 텍스처 등 다양한 요소들을 조작할 수 있다.이러한 생명시간함수의 특성은 [400: 다양한 효과 표현 시스템]을 통해 사용자들에게 다양한 효과를 제공한다.시간에 따라 변화하는 작품의 모습은 사용자들에게 생동감과 신선한 경험을 선사하며, 색상의 변화, 움직임의흐름, 텍스처의 변동 등을 통해 작품의 느낌을 다채롭게 전달할 수 있다.딥러닝과 생성적 적대 신경망 등의 기술을 활용하여 생명시간함수를 CAM 시스템에 적용함으로써 [500: 흥미로운ATM 경험 제공 시스템]을 사용자들은 더욱 흥미로운 ATM 경험을 즐길 수 있다. 또한, 이러한 기술의 적용으로인해 CAM 시스템은 [501: 혁신적인 작품 제공 시스템]으로 더욱 예측 불가능하고 독창적인 작품을 제공할 수 있다.이러한 특허 청구항은 [600: 기술적인 독창성 강조 시스템]과 [601: 창의성 강조 시스템]을 강조하며, [602: 디지털 예술과 금융 기술 융합 기여 시스템]을 통해 미래의 금융 생태계와 예술적 경험을 새롭게 정의하고 이끌어내는데 기여할 것으로 기대된다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "보안 프로토콜과 강력한 암호화 알고리즘을 활용하여 데이터의 기밀성과 무결성을 보장하는 안전금고(hashvault)를 구현한 가상공간 상의 멀티펑션 기능의 XR ATM(CAM: Currency Access Machine) 시스템에 대한 특허청구항:CAM 시스템은 [100: 보안 프로토콜 활용 시스템]과 [101: 강력한 암호화 알고리즘 적용 시스템]을 활용하여[102: 데이터 기밀성 보장 시스템]과 [103: 데이터 무결성 보장 시스템]을 포함하는 안전금고(hash vault)를 구현한다. 이 안전금고는 사용자의 데이터와 거래 정보를 [200: 외부로부터의 침입과 공격으로부터 데이터 보호시스템]을 통해 안전하게 보호하며, 보안 프로토콜과 암호화 알고리즘을 통해 [201: 사용자 개인 정보 보호 시스템]과 [202: 금융 거래 정보 보호 시스템]을 보장한다.안전금고는 사용자의 [300: 생체 정보 인증 시스템]과 [301: 인증 토큰 인증 시스템], [302: 비밀번호 인증 시공개특허 10-2025-0018564-7-스템] 등 다양한 보안 수단을 활용하여 [303: 데이터 접근 제어 시스템]을 구성한다. 사용자 인증 절차를 통해[400: 안전금고 잠금 해제 시스템]을 통해 안전금고의 잠금을 해제할 수 있으며, 인증되지 않은 사용자는 [401:데이터 접근 차단 시스템]을 통해 데이터에 접근할 수 없다. 이를 통해 사용자들은 CAM 시스템을 통해 [500: 안전하고 신뢰성 있는 금융 거래 진행 시스템]을 경험하며, [501: 민감한 정보 안전 보호 시스템]을 통해 거래에대한 걱정 없이 자유롭게 서비스를 이용할 수 있다.이러한 보안적인 측면은 CAM 시스템을 더욱 [600: 신뢰성 있는 금융 서비스 제공자]로 만들어준다. 사용자들은CAM 시스템을 통해 [601: 믿을 수 있는 파트너로써] 더욱 [602: 편리하고 안전한 금융 거래]를 경험할 수 있으며, 디지털 금융 생태계에서 [603: 보안성 강화 시스템]과 [604: 사용자들의 신뢰 얻기 시스템]을 얻으며, 더욱[605: 넓은 범위로 발전]할 수 있도록 노력하겠다.본 청구항은 CAM 시스템의 [700: 보안적 기능 강조 시스템]을 강조하며, 디지털 금융 서비스 분야에서의 [701:뛰어난 기술력과 신뢰성 특허 보장 시스템]이다. 이러한 기술은 디지털 금융 생태계에서 [702: 보안성 강화 시스템]과 [703: 사용자들의 신뢰 얻기 시스템]을 얻으며, 더욱 [704: 넓은 범위로 발전]할 수 있도록노력하겠다."}
{"patent_id": "10-2023-0099279", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "가상현실 기반의 멀티펑션 XR ATM(CAM: Currency Access Machine) 시스템에 적용한 사용자의 디지털 자산과 거래 정보를 보호하는 시간적용 보안 시스템, 상기 CAM 시스템은:1. 시간 개념 이미지 보안 기능을 활용하여 실시간으로 거래를 시뮬레이션하고 발생하는 거래 이미지와 데이터를 안전하게 보호하는 단계를 포함한다. 사용자의 디지털 자산과 거래 정보는 딥러닝(100), 생성적 적대 신경망(101), 컴퓨터 비전 기술(102)을 활용하여 생성된 생명시간함수(유효기간)를 적용하여 안전성과 무결성을 강화한다.2. hashlib 라이브러리를 이용하여 SHA-256(200) 해시 함수를 적용하여 기기 정보를 해시값으로 변환하고, 해당해시값을 블록체인에 등록하여 CAM 시스템의 이미지웨어인 이미지를 무결성을 확보하는 단계를 포함한다.3. 보안 프로토콜(300)과 고급 암호화 알고리즘(301)을 사용하여 CAM 시스템이 데이터와 이미지를 보호하고 불법적인 접근이나 복사를 방지하여 보안성을 강화하는 단계를 포함한다.4. CAM 시스템은 사용자의 개인정보와 자산을 보호하며 디지털 자산 거래를 안전하게 처리할 수 있는 고도로 안전한 시스템 장치로, 사용자의 거래 정보의 안전성을 보장하고 무결성을 유지하여 사용자들에게 더욱 신뢰성 있고 안정적인 금융 서비스를 제공하는 단계를 포함한다.5. CAM 시스템의 보안적 기능과 기술은 디지털 금융 서비스 분야에서의 뛰어난 기술력과 신뢰성을 특허적으로보장하며, 사용자들은 CAM 시스템을 믿을 수 있는 파트너로써 더욱 편리하고 안전한 금융 거래를 경험할 수 있도록 하는 단계를 포함한다.6. 이러한 CAM 시스템의 특허는 금융 산업의 미래를 변화시키고 혁신을 이끌어낼 것으로 기대되며, 디지털 자산의 실시간 거래와 보안성을 고려한 금융 서비스에 기여하는 단계를 포함한다. 또한 CAM 시스템의 보안적 기능은다양한 분야에서 사용될 수 있도록 노력할 것이다.위의 특허 청구항들을 통해 사용자들은 더욱 편리하고 안전한 가상공간 상의 멀티펑션 XR ATM(CAM: CurrencyAccess Machine)을 이용할 수 있으며, 디지털 자산 관리와 금융 거래를 보다 효율적으로 수행할 수 있다. 이러한 첨단 기술들의 활용으로 인해 더욱 현실과 가상이 융합된 새로운 금융 경험을 제공할 수 있게 될 것이다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 금융산업과 디지털 시대에 발맞춰 새로운 패러다임을 제시합니다. XR 기술을 활용한 멀티펑션 XR ATM 인 CAM 시스템은 가상현실 환경에서 혁신적인 서비스와 기능을 제공하여 사용자들에게 더욱 편리하고 다양한 옵 션을 제공합니다. 이로 인해 금융 기관은 새로운 사업 기회를 창출하고 사용자들의 만족도를 크게 향상시킬 수 (뒷면에 계속)"}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 ICT 기술과 XR HMD(확장현실: Extended Reality)을 결합한 보안 방법을 통해 양방향 IP 망을 기반으 로 하는 초고속 유무선 인터넷을 이용한 멀티펑션 XR ATM(CAM: Currency Access Machine)을 구현하고 제어하는"}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "방법과 시스템에 관한 것이다. 이 기술분야는 다음과 같은 주요 요소들을 포함한다:1. 초고속 유무선 인터넷 기술: 사용자가 가상현실 환경으로 진입하고 실시간으로 거래를 처리할 수 있도록 초 고속의 무선 인터넷 기술이 활용된다. 이를 통해 사용자들은 높은 속도와 안정성을 보장하는 가상 환경에서 다 양한 금융 거래를 진행할 수 있다. 2. XR HMD 기술: XR HMD를 활용하여 사용자는 가상현실 환경에 직접적으로 참여하게 된다. 이를 통해 사용자들 은 실제 ATM 환경과 유사한 조건에서 거래를 진행할 수 있어 편리하고 직관적인 경험을 제공한다. 3. 보안 기술: 사용자의 거래 정보와 디지털 자산을 보호하기 위해 최신의 해시 함수 보안 기술이 활용된다. 생 체 인증, 시간 개념 이미지 보안, 그리고 딥러닝 기반의 인공지능 등이 통합적으로 사용되어 거래 정보의 안전 을 보장한다. 4. 다기능 ATM: CAM은 기존의 ATM에 비해 다양한 멀티펑션 기능을 제공한다. 가상현실 환경에서 디지털 자산 관 리, 송금, 입금 등 다양한 금융 거래가 가능하여 사용자에게 편리함과 다양한 선택 옵션을 제공한다. 5. 가상공간 상의 거래 처리: 사용자가 가상현실 환경에서 시작한 거래 정보는 거래 처리 서버로 전달되며, 각 자 다양한 특화된 기능의 서버와 최종 서버는 실제 금융 시스템과 연동된다. 이를 통해 사용자들은 가상환경에 서 실시간으로 실제 거래를 시뮬레이션하며, 실제 환경과 같은 거래 경험을 제공한다. 6. 미래 지향적 기술: 가상현실 기반의 멀티펑션 XR ATM 시스템은 미래의 금융 산업과 디지털 시대에 맞춘 혁신 적인 서비스를 제공한다. 이를 통해 금융 기관과 사용자들은 더 나은 금융 경험과 이점을 누릴 수 있다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 3, "content": "따라서, 본 기술분야는 초고속 유무선 인터넷과 가상현실 기술을 결합하여 혁신적이고 다기능을 갖춘 가상현실 기반의 멀티펑션 XR ATM 시스템을 구현하고, 사용자들에게 더욱 안전하고 다양한 옵션을 제공하는 금융 서비스 를 제공하기 위한 기술들을 포함한다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근의 기술 발전은 확장현실을 구현하는 기기들의 개발을 촉진시켰고, 이를 활용하는 콘텐츠와 프로그램들이 대중화되고 있다. XR 체험을 위한 HMD류의 기기와 설치 장치를 이용한 놀이기구와 게임, 여행체험, 운동체험, 음악 참여, 쇼핑 참여 등은 몰입형 경험에 대한 수요 증가로, 기업들은 XR 기술을 적용한 다양한 형태의 헤드 마운티드 디스플레이(HMD)류를 기반으로, 안경형, 공간형, 홀로그램형 등의 XR 몰입형 기기를 개발하고 제품화 하고 있다. 이에 따라, 몰입형 가상현실 시스템의 대중화와 관련된 플랫폼 개발에 큰 노력이 기울여지고 있다. 이러한 기술과 산업의 동향을 고려하여, 본 발명은 전통적인 ICT 기술과 확장현실 기술을 융합하여 멀티펑션 XR ATM을 적용한 새로운 몰입형 ATM 기기의 개발을 목표로 한다. 이 기술은 다양한 디지털 자산의 실시간 거래를 용이하게 한다. 이 기술은 다양한 금융 서비스를 제공하며, 고객에게 실시간으로 디지털 자산을 관리하고 이용할 수 있는 편리 한 서비스를 제공하고자 한다. 이를 통해, 사용자들은 금융 거래에 대한 다양한 접근의 방법과 기술을 접할 수 있다. 또한 XR의 몰입형 기기의 직관적인 이해와 사용자 경험을 향상시킬 수 있으며, 새로운 디지털 시대에 대 한 준비를 할 수 있을 것이다. 상기의 '몰입형 멀티펑션 XR ATM (CAM)'은 주로 세 가지 주요 기술 요소로 구성되어 있다. 1. ATM 장치와 관련한 기술: 이는 다양한 결제 방법을 지원하는 하드웨어와 소프트웨어로 구성되며, 다음과 같 은 하위 시스템으로 이루어져 있다. a. 사용자 인터페이스(UI): 사용자 인터페이스는 고객이 메뉴를 선택하고, 주문을 입력하고, 결제를 진행할 수 있도록 해주는 실제와 가상의 터치스크린을 의미한다. 이는 직관적이고 사용하기 쉬운 디자인으로, 고객이 원하 는 메뉴를 쉽게 찾고 선택할 수 있게 한다. b. 주문 처리 시스템: 주문 처리 시스템은 고객이 입력한 주문 정보를 처리하고, 주문 내역을 백엔드 서버로 전 송하는 역할을 한다. c. 결제 처리 시스템: 결제 처리 시스템은 고객의 결제 정보를 받아들이고, 결제 승인을 위해 이 정보를 결제 게이트웨이나 VAN(Value-Added Network), 기타 디시털자산 플랫폼 결제 서비스로 전송하는 역할을 한다. d. 백엔드 서버: 백엔드 서버는 유통 플랫폼, 금융 플랫폼 등의 주문 내역을 받아들이고, 이를 처리하여 POS(Point Of Sale) 시스템으로 전송한다. 또한, 메뉴 정보, 가격 정보 등 각 유형별 플랫폼의 데이터를 관리한 다. e. POS 시스템: 예를 들어 식당에서는, POS 시스템은 백엔드 서버로부터 주문 정보를 받아들이고, 이를 주방 등 에 전달하여 주문된 메뉴가 제작되도록 한다. 또한, 결제가 완료된 주문에 대한 영수증을 출력한다. 2. CAM 이미지웨어: 이미지웨어는 이미지와 소프트웨어를 합성하여 이미지 생성 결과물을 제어하는 기술 개념을 말한다. 이러한 기술적 배경은 주로 딥러닝과 컴퓨터 비전 기술로 이루어져 있다. a. 딥러닝: 딥러닝은 인공신경망을 기반으로 하는 기계학습의 한 분야로, 이미지 처리와 인식에 매우 효과적이 다. 딥러닝 알고리즘은 다층 신경망을 사용하여 이미지 데이터를 학습하고 분류, 생성, 변형 등의 작업을 수행 할 수 있다. b. 생성적 적대 신경망(GAN, Generative Adversarial Network): GAN은 딥러닝의 한 종류로, 이미지 생성에 사 용되는 강력한 알고리즘이다. GAN은 생성자(generator)와 판별자(discriminator)라는 두 개의 신경망을 경쟁시 키면서 이미지를 생성하는 방식이다. 생성자는 실제 이미지와 유사한 가짜 이미지를 생성하려고 하고, 판별자는 생성자가 만든 가짜 이미지와 실제 이미지를 구분하려고 한다. 이러한 경쟁을 통해 생성자는 점차 실제 이미지 와 구별하기 어려운 고품질 이미지를 생성할 수 있다. c. 컴퓨터 비전 기술: 컴퓨터 비전 기술은 이미지와 비디오 데이터를 분석하고 해석하는 기술을 말한다. 이미지 분류, 객체 검출, 세그멘테이션, 스타일 전이 등 다양한 기술이 이미지웨어에 사용될 수 있다. 컴퓨터 비전 기 술은 이미지의 특징을 추출하고, 패턴을 파악하여 이미지를 생성하거나 변형하는 데에 사용된다. d. 생명시간함수(life expectancy function): 사건이 발생할 때까지의 기대 시간을 나타내는 함수로서 딥러닝, 생성적 적대 신경망, 컴퓨터 비전 기술을 변수로 활용하여 이미지 생성을 하는데 사용한다. 이를 저작권 함수라 고도 할 수 있다. 이 함수는 작품의 유효 기간을 설명하고 변수들을 활용하여 조절할 수 있도록 설계되었다. 작 품의 주기성, 지속성, 성장과 감소 속도, 상세한 변화 등 다양한 특성을 반영할 수 있도록 변수들을 조절 할 수 있게 한 공식은, 생명시간함수(유효기간) = A * sin(B * t) + C * exp(D * t) + E * log(F * t + G) + H로 정의된다. 변수를 설명하면 ㆍB: 작품의 주기성과 변동성을 결정하는 주파수 상수 ㆍC: 작품의 지속성과 감쇠를 조절하는 상수 ㆍD: 작품의 성장과 감소 속도를 조절하는 지수 상수 ㆍE: 작품의 상세한 변화를 나타내는 로그 상수 ㆍF, G: 작품의 로그 함수의 인수를 결정하는 상수 ㆍH: 작품의 기본 수명을 결정하는 상수 ㆍA와 t는 각각 작품의 초기 수명과 시간을 나타낸다. 물론, 위 함수의 변수들은 사건의 특성, 상황, 필요성 등에 따라 적절하게 조절될 수 있다. 이는 본 발명의 중 요한 부분으로서, 특허 보호를 받아야 할 핵심적인 요소라고 볼 수 있다. 예시로, 작가 A가 자신의 작품에 이 공식을 사용해 보겠습니다. 작가 A는 A = 10, B = 0.5, C = 5, D = 0.1, E = 2, F = 2, G = 1, H = 100의 값들을 설정한다. 이 설정에 따라, 작품의 유효 기간은 사인 함수, 지수 함수, 로그 함수의 조합에 의해 변화하게 된다. 응용 예시는 다음과 같다: ㆍ응용 1: 작가 B는 작품의 유효 기간을 더 짧게 유지하고자 한다. 이를 위해 A의 값을 5로 줄여 초기 유효 기간을 축소하 였다. ㆍ응용 2: 작가 C는 작품의 주기성을 강조하고 싶다. 이를 위해 B의 값을 1로 설정하여 주파수를 증가시켰다. 결과적으로 작품의 주기성이 강조되며, 주기마다 유효 기간이 반복적으로 변화하게 된다. 이러한 예시들은 이 공식의 정의와 그 사용법, 그리고 응용 가능성을 시각적으로 보여준다. 작가들은 이 공식을 활용해 작품의 특성을 조절하고 다양한 효과를 표현할 수 있게 된다. 이러한 기술적 배경을 통해 이미지웨어는 이미지 생성 결과물을 소프트웨어로 제어하고 조작할 수 있게 된다. 딥러닝과 GAN을 활용하여 사실적이고 다양한 이미지를 생성하며, 컴퓨터 비전 기술을 사용하여 이미지를 분석하 고 가공함으로써 다양한 영상 처리 작업에 활용하고, 생명시간함수를 이용하여 기존의 DRM 기술로만 저작권을 보호하는 수동적 방법에서 벗어나 능동적으로 이미지를 생성할 수 있게 된다. 이러한 기술적 배경은 디지털 예술, 게임 개발, 콘텐츠 제작, 광고 등 다양한 분야에서 이미지 생성과 편집에 많은 도움을 제공하게 될 것이다. 특히, 이러한 기술은 CAM 장치와 연동하여 사용자가 현실과 가상 공간을 융합시켜 디지털 자산의 실시간 거래를 가능하게 하는 확장현실 소프트웨어로 활용될 수 있다. 3. CAM 시간적용 보안 시스템: 이 시스템은 OPT(Optical Physical Unclonable Function)의 시간 개념, DRM(Digital Rights Management) 이미 지의 유효기간 제어, 분산원장 기술을 활용하며, 해시함수를 이용하여 가상의 이미지금고에 이미지를 암호화할 수 있는 시간적용 키를 생성한다. 이로써 시스템화된 암호화와 복호화보안 시스템을 구현하게 된다. 이 시스템을 가능케 하는 기술적 배경은 다음과 같다. a. OPT 기술: OPT는 광학적으로 물리적 복제가 불가능한 함수를 사용하여 고유한 키를 생성하는 기술이다. OPT 를 기반으로 한 암호화 시스템은 물리적 특성을 이용하여 보안 키를 생성하고 관리함으로써 외부 해킹이나 침입 을 방지한다. b. DRM 기술: DRM은 디지털 콘텐츠의 저작권 보호와 사용 권한 관리를 위한 기술이다. DRM 이미지의 유효기간 설정을 통해 디지털 콘텐츠의 불법 복사나 무단 배포를 방지하며, 사용자의 권한을 제어하는데 활용된다. c. 시간 개념 적용: 시간 개념을 적용하여 암호화된 데이터나 이미지의 유효기간을 제어할 수 있다. 유효시간함 수와 DRM 기술을 활용하여 이미지를 특정 기간 동안만 열람하거나 사용하도록 설정하는 것이 가능하다. d. 보안 프로토콜: 암호화와 복호화에 사용되는 보안 프로토콜을 설계하고, 그에 적합한 해시함수(SHA-256, SHA-3, BLAKE2)로 구현된 안전금고(hash vault)를 구축함으로써 데이터의 안전한 전송과 저장을 보장한다. 고급 암호화 알고리즘과 키 관리 시스템을 통해 데이터의 기밀성과 무결성을 유지한다. e. 인증 및 권한 관리: 사용자 인증과 권한 관리 시스템을 통해 데이터나 이미지에 접근하는 사용자를 제한하고, 필요한 권한을 부여하여 보안을 강화한다. f. 보안 감지 및 대응 시스템: 악의적인 해킹이나 침입을 탐지하고 대응하는 보안 시스템을 도입하여 시스템의 안정성과 신뢰성을 높인다.위의 기술적 배경을 통해 CAM 시간적용 보안 시스템은 데이터와 이미지를 보호하고, 불법적인 접근이나 복사를 방지함으로써 보안성을 강화하는 중요한 역할을 한다. 이 시스템은 민감한 정보와 디지털 콘텐츠의 보안을 위해 다양한 분야에서 활용될 수 있다. 시간 개념을 포함한 이런 고도의 보안 시스템은 사용자의 개인정보와 자산 보호를 증진하며, 디지털 자산 거래를 안전하게 처리할 수 있도록 한다. 이러한 기술이 적용될 가상공간의 이미지를 이미지웨어의 기술로 생성된 이미지웨어(IMAGEWARE)인 XR CAM에 대 한 기기등록을 하여 기기와 시스템의 무결성을 확보할 수 있다. 본 발명을 실현할 수 있는 기술을 입증한 코드를 발명하였다. 아래의 코드는, 이 코드는 블록체인에 기반한 분산 시스템을 활용하여 기기 정보를 안전하게 등록하는 기술을 발명한 것이다. 이 코드는 블록체인 기술을 통해 기기 정보를 해시화하여 블록으로 생성하고, 분산된 네트워크에서 합의를 통해 체인 균형을 조정하며 채굴을 수행하는 과정을 보여주고 있다. 이 코드의 주요 발명 점은 다음과 같다: 분산 기술을 통한 안정성: 블록체인은 분산 기술을 기반으로 하여 중앙 집중형 서버 없이 여러 노드들이 P2P 네 트워크를 형성하여 데이터의 안정성과 무결성을 보장한다. 이를 통해 기기 정보를 분산 저장하고 네트워크 참여 자들과 합의를 이루어 체인 균형을 조정하는 과정에서 데이터의 변조나 위조를 방지할 수 있다. Proof of Work 채굴: 채굴 과정에서 Proof of Work 알고리즘을 사용하여 적절한 증명을 하도록 유도한다. 이를 통해 새로운 블록을 생성하는데 필요한 작업양(Proof of Work)을 검증하여 채굴자들이 경쟁적으로 새로운 블록 을 생성하고 체인에 추가할 수 있도록 한다. 채굴은 일정 시간마다 자동으로 반복되며, 올바른 증명을 하면 새 로운 블록을 생성하여 기기 정보를 블록체인에 영구적으로 기록한다. 기기 정보의 안전한 등록: 기기 정보는 SHA-256 해시 함수를 통해 해시값으로 변환되어 블록에 포함된다. 해시 값은 원본 데이터를 보호하면서 고유한 암호화 문자열로 변환되므로, 기기 정보를 안전하게 등록하고 변조를 방 지할 수 있다. 분산 네트워크와 합의 기능: 네트워크에 참여한 노드들과 합의를 이루어 가장 긴 체인을 유지하도록 조정하는 기능을 갖추고 있다. 이를 통해 분산 네트워크의 모든 참여자들이 동일한 블록체인을 유지하며 데이터의 정합성 을 보장한다. 위의 기술들을 결합하여 이 코드는 기기 정보를 안전하게 등록하고 관리하는 기능을 제공하며, 분산 시스템의 특성을 활용하여 중앙 집중형 서버의 취약점을 극복한다. 이러한 특징들은 기기 정보 관리의 보안성과 무결성을 높이고, 블록체인 기술을 발전시키는데 기여하는 혁신적인 발명으로 인정될 수 있다. import hashlib import time import threading class Blockchain: def __init__(self): self.chain = [] self.current_transactions = [] self.nodes = set() # 노드들의 집합 (P2P 네트워크를 위한 기능) # 제네시스 블록 생성 self.new_block(previous_hash='1', proof=100) def new_block(self, proof, previous_hash=None): # 새로운 블록 생성 block = { 'index': len(self.chain) + 1, 'timestamp': time.time(), 'transactions': self.current_transactions, 'proof': proof, 'previous_hash': previous_hash or self.hash(self.chain[-1]), } self.current_transactions = [] self.chain.append(block) return block def new_transaction(self, sender, recipient, amount): # 새로운 거래 생성 self.current_transactions.append({ 'sender': sender, 'recipient': recipient, 'amount': amount, }) return self.last_block['index'] + 1 @staticmethod def hash(block): # 블록을 해시하는 코드 (SHA-256 해시 함수 사용) block_string = str(block).encode() return hashlib.sha256(block_string).hexdigest() @property def last_block(self): # 체인의 마지막 블록 반환 return self.chain[-1] def register_node(self, address): # 새로운 노드 등록 (P2P 네트워크를 위한 기능) self.nodes.add(address) def consensus(self): # 다른 노드들과의 합의를 통한 체인 균형 조정 (P2P 네트워크를 위한 기능) longest_chain = self.chain for node in self.nodes: response = requests.get(f'http://{node}/chain') if response.status_code == 200: length = response.json()['length'] chain = response.json()['chain'] if length > len(longest_chain) and self.valid_chain(chain): longest_chain = chain if longest_chain != self.chain: self.chain = longest_chain return True return False def valid_chain(self, chain): # 체인의 유효성 검사 (P2P 네트워크를 위한 기능) last_block = chain[0] current_index = 1 while current_index < len(chain): block = chain[current_index] if block['previous_hash'] != self.hash(last_block): return False if not self.valid_proof(last_block['proof'], block['proof']): return False last_block = block current_index += 1 return True @staticmethod def valid_proof(last_proof, proof): # 올바른 증명인지 검증 guess = f'{last_proof}{proof}'.encode() guess_hash = hashlib.sha256(guess).hexdigest() return guess_hash[:4] == \"0000\" def proof_of_work(blockchain): # 채굴에 사용될 증명 (Proof of Work) last_block = blockchain.last_block last_proof = last_block['proof'] proof = 0 while not valid_proof(last_proof, proof): proof += 1 return proof def mining(): # 채굴을 수행하는 함수 global blockchain while True: time.sleep # 일정 시간마다 채굴 시도 proof = proof_of_work(blockchain) if blockchain.consensus(): # 합의를 통해 체인 균형 조정 blockchain.new_transaction(sender=\"System\", recipient=\"Miner\", amount=1) blockchain.new_block(proof) if __name__ == \"__main__\": import requests # 블록체인 객체 생성 blockchain = Blockchain() # 기기 정보 예시 (이 예시에서는 간단히 문자열로 표현) device_info = \"Device_123456789\" # 기기 등록 함수 호출 hashed_device_info, block = device_registration(device_info) print(\"해시된 기기 정보:\", hashed_device_info) print(\"등록된 블록:\", block) # 마이닝 쓰레드 시작 (다른 쓰레드에서 채굴을 병렬로 수행) mining_thread = threading.Thread(target=mining) mining_thread.start() 이미 보급된 ATM, KIOSK, PC, 템플릿 단말의 기술은 기존의 거래 처리에는 뛰어난 접근성과 활용성을 가지고 있 으며 비즈니스에 널리 활용된다. 그러나 이러한 기술들은 다양한 디지털 자산을 처리하기에는 기술적, 비용적으 로 한계가 있어 규모 있는 다양한 사업을 전개하는 데 어려움을 겪는다. 기술적 지원과 금융적 지원이 없는 경 우에는 다양한 사업의 목표에 맞게 거래 처리와 관련된 기술과 비용을 부담해야 하는 현실이 있다. 그러나 몰입형 멀티펑션 XR ATM (CAM) 기술은 CAM 장치와 CAM 이미지웨어를 통해 디지털 자산의 실시간 거래를 용이하게 하고, CAM 보안 시스템으로 사용자의 개인정보와 자산을 안전하게 보호한다. 이러한 기술은 높은 성능 을 가지고 있으며 사용자와 유통, 금융 플랫폼 사이의 거래 처리를 원활하게 하고, 또한 시스템에 전용 모듈을 사용하여 그 비용이 낮아지게 하여 일반인들에게 대량 보급이 될 수 있다는 장점이 있다. 선행 기술은 '몰입형 멀티펑션 XR ATM (CAM)'의 개념과 구성 요소를 구현하고 가능하게 하는 핵심 기술들을 의 미한다. 이에 따라 다음과 같은 기술들이 해당될 수 있다. 1. HMD (Head-Mounted Display): 사용자가 가상현실(VR)이나 증강현실(AR)과 상호작용하기 위해 머리에 착용하 는 디스플레이 기기로, 사용자에게 몰입형 경험을 제공하는 기술이다. 2. ATM (Automated Teller Machine): 자동화된 현금 입출금 기능뿐만 아니라, 계좌 조회, 송금, 입금 등 다양 한 금융 서비스를 제공하는 기기로, CAM의 기반이 되는 기술이다. 3. OTP (One-Time Password): 일회용 비밀번호로, 보안 강화를 위해 인증 절차에서 사용되는 기술로서, 사용자 의 신원 인증에 활용될 수 있다. 4. DRM (Digital Rights Management): 디지털 콘텐츠의 저작권 보호와 사용 권한 관리를 위한 기술로, CAM에서 디지털 자산의 거래 보안에 사용될 수 있다. 5. OAuth (Open Authorization): 웹 및 모바일 애플리케이션에서 제3자 서비스에 대한 접근 권한을 관리하기 위 한 개방형 표준 인증 프로토콜로, CAM에서 사용자 인증 및 권한 부여에 활용될 수 있다. 6. 디지털 결제 기술: 디지털 자산을 이용한 결제 및 거래를 가능케 하는 기술로, CAM의 핵심 기능 중 하나인 다양한 디지털 자산 거래를 지원한다. 7. 보안 기술: 암호화 기술, 인증 및 권한 관리 기술, 악성 코드 탐지 및 방어 기술 등 CAM의 보안성 강화에 기 여하는 다양한 보안 기술이 해당된다. 8. 네트워크 기술: 초고속 유무선 인터넷과 양방향 IP 망을 이용하여 가상공간 상에서 ATM 기능을 구현하기 위 한 네트워크 기술이 선행 기술에 포함된다. 위의 기술들은 '몰입형 멀티펑션 XR ATM (CAM)'의 선행 기술로서 해당 시스템을 구현하고 가능하게 하는 핵심 기술들이다. 이러한 선행 기술들의 융합과 발전을 통해 CAM은 다양한 디지털 자산의 실시간 거래를 용이하게 하 며, 높은 보안성과 사용자 경험을 제공할 수 있게 된다. 이러한 기술들은 '몰입형 멀티펑션 XR ATM (CAM)'의 핵심 구성 요소이며, CAM의 복잡한 기능을 가능하게 하는 기술적 바탕을 제공한다. 여기서 주목할 만한 점은, 이러한 선행 기술들은 각각 다른 분야에서 개발되었지만, CAM이라는 통합 플랫폼에서 함께 작동하여 사용자에게 더 나은 서비스를 제공하는 것이다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 XR ATM의 XR 환경에서의 구현과 관련한 산업의 문턱을 낮게 해야 한다는 상당한 이유가 있는 문제를 해결하기 위해 착수된 것으로, 다음과 같은 주요 과제들을 해결하고자 한다: 1. 물리적 제한 극복: 현존하는 ATM 시스템들이 주로 물리적 형태로 존재하며, 사용자의 위치에 국한된 이용이 가능하다는 한계를 극복하고, 산업관계자들이 산업의 목적에 효용에 접합하게 언제 어디서나 금융 거래 및 유통 거래 등을 수행할 수 있는 시스템을 구현하는 것이다. 2. 서비스 범위 확장: 현재 ATM 시스템이 제공하는 서비스는 제한적이다. 따라서 산업관련자들이 이러한 제한을 극복하기 위하여, 특히 '멀티펑션 XR ATM'인 'CAM(Currency Access Machine)'를 구현하여 더 다양한 금융 서비스 등을 제공하고 더 나아가서 다양한 사업에 혁신적인 기회를 제공 하고자 한다. 3. 디지털 자산의 접근성 개선: 디지털 자산의 활성화에 따라 이에 대한 접근성과 범위를 확장하는 것이다. 이 를 위해, 본 발명은 CAM 시스템을 통해 디지털 자산의 접근성을 개선하려 한다. 4. 보안성 강화: 실시간 금융 거래는 보안에 매우 민감하다. 본 발명은 시간 개념의 이미지웨어와 해시 기반 보 안 기술을 통해 거래 정보의 무결성을 유지하고 보안을 강화하려 한다. 5. 사용자 인증의 간소화: 복잡한 사용자 인증 절차는 사용자 경험을 해치며, 신속한 거래를 방해한다. 본 발명 은 사용자 인증 과정을 간소화하면서도 보안성을 유지하려는 목표를 가지고 있다. 따라서, 본 발명의 주요 과제는 상기의 문제들을 해결하고 사용자에게 효율적이며, 편리하고, 보안성이 높은 실 시간 금융 거래 경험을 제공하는 것이다. 이를 위해, 본 발명은 IP망을 기반으로 한 초고속 유무선 인터넷과 헤 드 마운트 디스플레이(HMD)류 등의 XR 환경에 적용하는 첨단 기술을 활용하여, 멀티펑션 XR ATM인 CAM (Currency Access Machine)을 구현하려 한다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 과제를 해결하기 위해, 본 발명의 실시예에 따른 IP망을 기반으로 하는 초고속 유무선 인터넷을 이용한 HMD류를 활용한 멀티펑션 XR ATM(약칭: CAM)의 구현과 기술이 포함된 방법 등에 관련된 것이다. 특히, 초고속 유무선 인터넷을 이용하여 제공되는 양방향 IP 망을 활용하여 가상공간 상에서 ‘멀티펑션 기능의 XR ATM(CAM: Currency Access Machine)을 구현하는 방법과 그 시스템을 제어하는 기술과 방법에 관한 것을 \"각 자의 특별한 서버를 포함한 프로그램과 보안함수\"로 해결하고자 하는 것이 목표이다. 도1 순서도는 사용자 인증부터 거래 완료 알림까지의 '전체 시스템 흐름'을 보여준다. 이 시스템은 사용자가 가 상 공간에서 실시간으로 안전하게 다양한 거래를 수행할 수 있도록 하는 것을 목표로 한다. 시작단계인 \"사용자 인증 시작 [100]\"에서 사용자는 CAM 장치를 통해 인증 과정을 시작한다. 사용자 인증 서버는 비밀번호, 얼굴 인식, 지문 인식 등 다양한 방법으로 사용자 인증을 수행한다. 인증이 완료되면 사용자는 해시함수 인증 토큰을 거래 요청 서버에 전달하게 된다(\"[200] 해시함수 인증 토큰을 거래 요청 서버에 전달\"). 거래 요청 서버에서 사용자는 이체, 인출, 결제 등 다양한 거래 유형을 선택한다. 이 정보를 CAM 이미지 웨어 액세스 서버에 전달하여 XR 환경의 가상 ATM 인터페이스를 제공받게 된다(\"[300] 거래 유 형 정보를 CAM 이미지 웨어 액세스 서버에 전달\"). 시간 개념 이미지 보안 작동 서버는 거래 과정 중에 CAM의 시간 개념 이미지 보안 기능을 활성화하여 거래 과정을 안전하게 보호하고 거래 정보의 무결성을 유지하는 역할을 한다(\"[400] 시간 개념 이미지 보안 작동 서 버에 거래 요청 정보 전달\"). 거래 처리 서버는 요청된 거래 유형에 따라 필요한 모든 작업을 수행하여 사용자에게 거래를 제공한다. 이 과정에서 거래 처리 결과를 거래 완료 알림 서버에 전달한다(\"[500] 거래 처리 서버에 보안 검사 결과 전달\"). 거래 완료 알림 서버는 거래가 성공적으로 완료되면 사용자에게 알림을 보내어 거래의 성공을 알린다. 사용자는 메시지, 이메일 등 자신이 설정한 방식으로 이 알림을 받을 수 있다(\"[600] 거래 결과를 사용자에 게 알림 전송\"). 이렇게 서로 다른 역할을 하는 여러 서버들이 협력하여 작동하면서 사용자는 CAM 장치를 통해 가상 공간에서 실 시간으로 다양한 거래를 수행할 수 있게 된다. 이 시스템은 초고속 유무선 인터넷을 이용하여 실시간 멀티펑션 XR ATM 기능을 가상 공간에서 제공하는 새로운 보안기술 및 이미지서비스를 구현하는 것이 목표이다. 도2 순서도는, 전술한 과제를 해결하기 위한, 사용자 인증 서버: 사용자가 HMD를 착용하고 물리적 CAM과 가상적 CAM을 시작하면, 사용자 인증 서버가 활성화된다. 이 서버는 사용자에게 비밀번호 입력, 얼굴 인 식, 홍체인식, 음성 또는 지문 인식 등의 방법으로 인증을 요청한다. 이 과정이 성공적으로 완 료되면, 사용자의 거래 유형 선택된다. 사용자 인증 서버는 해시함수 인증 토큰을 생성하고 이를 거래 요청 서버에 전달 하면서 사용자에게 가상 ATM 인터페이스가 제공된다.사용자가 네트워크 장비의 서비스 종료까지 거래완료 알림서버, 거래처리서버, 시간개념 이미지 보안 작동 서버 등, 각 서버들의 시스템이 서로 상호 포함되어 활성화 된다. 도3 순서도는, 전술한 과제를 해결하기 위한, 거래 요청 서버: 해시함수 인증 토큰을 받은 거래 요청 서버 는 인증시작을 포함하는 거래 요청 서버의 인증절차로 사용자에게 거래 유형 선택을 요청한다. (예: 이체, 인출, 결제 등). 사용자가 거래 유형을 선택하면, 거래 요청 서버는 이 정보를 CAM 이미지 웨어 액세스 서버에 전달한다. 해시함수 인증 토큰을 받은 거래 요청 서버가 거래유형 선택요청을 사용자에게 거래 유형을 선택 하도록 요청하고, 사용자의 선택을 CAM 이미지 웨어 액세스 서버에 전달하는 과정을 나타낸다. 이 과정은 사용자의 인증 후 거래를 진행하는 단계를 묘사하고 있다. 도4 순서도는, 전술한 과제를 해결하기 위한, CAM 이미지 웨어 액세스 서버: CAM 이미지 웨어 액세스 서버 는 사용자의 거래 유형이 포함된 사용자의 거래 요청 수신으로 사용자의 거래 요청을 받아서, 사용자 에게 XR 환경의 가상 ATM 인터페이스를 제공한다. 이 서버는 거래 요청을 사용자의 거래 유형이 포함된 시간 개념 이미지 보안 작동 서버에 전달한다.사 용자에게 XR 환경의 가상 ATM 인터페이스를 제공. 사용자의 거래 요청 정보를 받은 CAM 이미지 웨어 액세 스 서버가 가상 ATM 인터페이스를 제공하고, 이 정보를 사용자에게 XR 환경의 가상 ATM 인터페이스 제 공이 포함된 시간 개념 이미지 보안 작동 서버에 전달하는 과정을 보여준다. 상기는 거래 요청 후 가상 인터페이스를 통해 거래를 진행하는 과정을 설명하고 있다. 도5 순서도는, 전술한 과제를 해결하기 위한, 시간 개념 이미지 보안 작동 서버: 시간 개념 이미지 보안 작 동 서버의 이미지 보안 프로토콜이 활성화되고 거래 유효성 등이 포함된 거래요청 수신 등의 거래 요청 수 신[400]은 이미지 기반의 보안 프로토콜을 활성화한다. 이 프로토콜은 거래 요청의 유효성을 검사하고 , 그 결과를 거래 처리 서버에 전달하는 과정을 나타낸다. 이 과정은 거래 요청의 보안 검증과 그 결 과의 전달을 설명하고 있다.도6 순서도는, 전술한 과제를 해결하기 위한, 거래 처리 서버: 거래 처리 서버의 연동처리[500]는 거래 처리가 포함된 보안 프로토콜의 결과를 받아서, 요청된 거래를 처리한다. 예를 들어, 사용자가 인출을 요 청한 경우, 이 서버는 사용자의 계정에서 적절한 금액을 인출하고, 그 결과를 거래 완료 알림 서버에 전달 한다. 이는 거래 처리 과정과 그 결과를 사용자에게 알리는 과정을 설명하고 있다. 도7 순서도는, 전술한 과제를 해결하기 위한, 거래 완료 알림 서버: 거래 완료 알림 서버의 연동처리"}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "[600]는 거래 결과를 수신하여, 사용자에게 알림을 전송한다. 사용자는 이 알림을 메시지, 이메일 등의 방 식으로 받을 수 있는 선택을 할 수 있다. 이는 거래 완료를 사용자에게 알리는 마지막 과정을 설명하고 있 다. 전술한 과제를 해결하기 위한, 위의 각 과정들은 서로를 순차적으로 호출하고, 결과를 다음 서버에 전달하는 방 식으로 진행된다. 이 과정들은 사용자 인터페이스를 통해 사용자에게 시각적으로 표시되며, 사용자는 이 과정들 을 HMD를 통해 확인할 수 있다. 도 8은, 전술한 내용을 보다 구체적으로, 전술한 과제를 해결하기 위한 도2의 사용자 인증 서버를 설명하는 것으로 CAM 시스템 내부에 구성되는 하드웨어와 소프트웨어의 조합으로 구현된다. 일반적으로 구성하는 하드웨어 와 처리과정은 다음과 같다: 1. 하드웨어 구성: ㆍ서버 컴퓨터: 사용자 인증 서버는 서버 컴퓨터에 의해 구현된다. 이 컴퓨터는 사용자 인증 절차를 처 리하고 관리한다. ㆍ네트워크 장비 (70, 700): 서버 컴퓨터는 IP 망에 연결되어 있으며, 네트워크 장비를 통해 통신한다. 이 를 통해 CAM 장치와의 통신(71, 72, 73, 74 시스템)이 가능하다. ㆍ사용자 인증 장치 (10단위, 11단위, 12단위, 13단위, 14단위, 15단위 하부 연동 시스템): 사용자 인증 서버 는 다양한 인증 방법을 지원하기 위해 비밀번호 입력, 얼굴 인식, 지문 인식 등의 기능(11, 12, 13, 14, 15, 16 시스템)을 제공하는 사용자 인증 장치로 구성된다. 2. 처리과정: ㆍ사용자 요청 수신 (100단위, 101단위, 102단위, 103단위, 104단위, 105단위 처리): 서버 컴퓨터는 CAM 장치[10]로부터 사용자의 인증 요청을 수신한다. 이는 비밀번호 입력, 얼굴 인식, 지문 인식 등의 정보를 포함 할 수 있다. ㆍ사용자 인증 절차 (10단위, 11단위, 12단위, 13단위, 14단위, 15단위 처리): 서버 컴퓨터는 수신된 인증 요청을 처리하여 사용자의 신원을 확인하는 인증 절차를 수행한다. 이를 위해 사용자 입력 정보와 등록된 정보 를 비교하고, 얼굴 인식이나 지문 인식과 같은 생체 인증 기술을 활용할 수 있다. ㆍ인증 결과 반환 (106단위 처리): 인증 절차가 완료되면 서버 컴퓨터는 인증 결과를 CAM 장치[10]로 반환 한다. 이는 인증 성공 또는 실패에 대한 정보를 포함합니다. ㆍ거래 요청 처리 (20단위, 21단위, 22단위, 23단위 처리): 인증 결과에 따라 거래 요청을 수행할 수 있는 권한 을 가진 사용자에게 허용한다. 이를 통해 정당한 사용자만이 거래를 요청할 수 있게 된다. 이와 같이 사용자 인증 서버는 CAM 시스템[10] 내에서 사용자의 신원을 확인하고, 거래 요청을 처리하는 중 요한 역할을 담당하여 보안성과 사용자 경험을 제공하는데 중요한 기능을 수행한다. 도 9는, 전술한 과제를 해결하기 위한, 도3의 거래 요청 서버를 보다 더 구체적으로 설명을 하는 것이다. 전술한 과제를 해결하기 위한, 거래 요청 서버는 인증된 사용자가 CAM 장치[10]나 연결된 HMD[20] 디바이스 를 통해 다양한 거래를 요청할 수 있는 환경을 제공한다. 이를 위해 다음과 같은 기능과 처리과정이 포함된다: 1. 거래 선택 및 입력: ㆍCAM 장치[10] 또는 연결된 HMD[20] 디바이스의 사용자 인터페이스를 통해 사용자는 원하는 거래 유형 중 하나 를 선택할 수 있다[200]. ㆍ사용자는 선택한 거래 유형에 필요한 정보를 입력합니다(201, 202, 203). 예를 들어, 이체를 선택한 경우, 사 용자는 이체 금액과 수취인 계좌번호 등의 정보를 입력하게 된다. 2. 거래 요청 전송: ㆍ사용자가 거래 정보를 입력한 후, 이 정보는 거래 요청 서버로 전송된다[500]. 이 과정은 네트워크를 통 해 서버로 데이터를 전송하는 것을 포함한다[700]. 3. 거래 유효성 확인: ㆍ거래 요청 서버는 전송된 거래 정보를 검증하여 거래의 유효성을 확인한다. 이는 입력된 정보의 형식이 나 필수 항목의 완성 여부를 확인하는 과정을 포함할 수 있다. 4. 거래 처리: ㆍ거래 요청이 유효하다고 확인된 경우, 거래 요청 서버는 해당 거래 유형에 맞는 처리를 수행한다(501, 502, 503). 이 과정은 필요한 데이터베이스 접근, 계좌 이체, 결제 처리 등의 작업을 수행하는 것을 포함할 수 있다. 5. 거래 결과 반환: ㆍ거래 처리가 완료된 후, 거래 요청 서버는 사용자에게 거래 결과를 반환한다[600]. 이는 거래 성공 또는 실패 에 대한 정보를 포함하며, 사용자 인터페이스를 통해 사용자에게 결과가 표시된다. 이와 같이 거래 요청 서버는 사용자가 간편하고 편리하게 다양한 거래를 요청하고 처리할 수 있도록 돕는 중요 한 기능을 수행한다. 이를 통해 CAM 시스템은 다양한 디지털 자산을 처리하고 관리하며, 사용자에게 편의성과 안전성을 제공한다. 도 10은, 전술한 과제를 해결하기 위한, 도 5의 시간 개념 이미지보안 작동서버를 보다 더 구체적으로 설명을 하는 것이다. 전술한 과제를 해결하기 위한, 상기 시간 개념 이미지보안 작동서버[40]는 CAM의 독특한 시간 기반 이미지 보안 기능을 활성화하여 거래 과정의 보안성을 보장하고 거래 정보의 무결성을 유지하는 역할을 수행한다. 이를 위해, 서버는 다음과 같은 주요 기능과 처리 과정을 수행한다: 1. 이미지 보안 토큰 생성: ㆍ서버는 거래가 시작되는 시점의 시간을 기반으로 고유한 이미지 보안 토큰을 생성한다[41]. ㆍ이 토큰은 거래의 무결성 확인과 이미지 및 데이터 변경 여부 검증에 활용된다. 2. 이미지 및 데이터 보호: ㆍ서버는 거래 과정에서 생성된 이미지와 데이터를 안전하게 보호한다. ㆍ암호화, 디지털 서명 등의 방법을 이용하여 이미지와 데이터의 무결성 및 기밀성을 보장한다. 3. 시간 동기화: ㆍ거래 과정에서 생성되는 이미지와 데이터에 시간 정보를 포함시키기 위해 사용된다. ㆍ서버는 모든 관련 시스템의 시간을 동기화함으로써 거래의 시간 순서와 일관성을 보장한다. 4. 이미지 및 데이터 검증: ㆍ거래가 완료된 후, 서버는 이미지와 데이터의 무결성을 검증한다. ㆍ이때 이미지 보안 토큰과 시간 동기화 정보를 이용하여 이미지와 데이터의 변경 여부를 확인한다. 따라서, 시간 개념 이미지보안 작동서버는 거래 과정의 보안과 무결성을 유지하기 위해 여러 기능과 메커니 즘을 사용한다. 이 시스템은 시간의 개념을 활용하여 거래 정보를 보호하고, 거래의 무결성을 보장함으로써 사 용자의 신뢰도를 높이고 CAM 시스템의 보안을 강화한다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 본 발명은 IP 망을 활용하여 HMD 기반의 멀티펑션 XR ATM, 즉 CAM을 통해 가상현실 의 CAM 서비스를 제공한다. 이 혁신적인 서비스를 통해 사용자는 다음과 같은 장점을 누릴 수 있다: 1. 실감나는 경험: 본 발명은 가상현실 기술을 활용하여 사용자들에게 실감나는 경험을 제공한다. 사용자들은 CAM을 통해 가상현실의 멀티펑션 XR ATM 서비스를 이용함으로써 전통적인 ATM 이용과는 다른 색다른 경험을 얻 을 수 있다. 이는 사용자들에게 새로운 재미와 흥미로운 경험을 제공하여 ATM 서비스의 사용성과 만족도를 크게 향상시킨다. 2. 디지털 자산 통합: 본 발명은 물리적인 자산을 대체하는 다양한 디지털 자산을 효율적으로 관리하고 통합하 는 기능을 제공한다. 사용자들은 CAM을 통해 다양한 디지털 자산을 손쉽게 활용하고 관리할 수 있으며, 이를 통 해 자산의 통합성과 관리의 용이성이 증가한다. 3. 간소화된 접근성: 본 발명은 기존 ATM 서비스의 한계를 극복하고 새로운 멀티펑션 XR ATM 서비스를 간편하고 저렴하게 이용할 수 있도록 한다. CAM을 통해 사용자는 ATM의 다양한 부품 등을 이미지웨어화하고 물리적인 단 순한 지폐개수기만으로도 오프라인과 가상현실이 혼합된 새로운 ATM 서비스를 편리하게 이용할 수 있으며, 이를 통해 사용자들의 편의성이 증가하고 다양한 산업적 아이디어에 적용할 수 있다. 4. 비용 절감: 본 발명은 기존 ATM 시스템의 설치, 하드웨어, 연결된 네트워크, 제어 장치 등으로 인해 발생하 는 많은 비용과 설치에 따른 보안 및 복잡성을 크게 줄일 수 있다. CAM을 활용하는 것으로 충분한 시공간에 시 스템을 구축할 수 있으며, 이로 인해 기존 물리적인 ATM 시스템을 대신할 수 있는 이미지웨오로 훨씬 저렴한 비 용으로 서비스를 제공할 수 있다. 5. 산업 발전: 본 발명은 금융산업에 한정되지 않고 산업 전반에 걸쳐 발전을 촉진시킬 수 있다. CAM을 활용하 여 사용자들에게 다양한 금융 서비스를 제공하고 금융 편의성을 제공과 함께 관련한 산업의 확장을 극대화함으 로써 산업의 발전과 성장에 기여한다. 또한, 새로운 연관 기술과 서비스를 개발하고 적용하는 데에도 긍정적인 영향을 미친다."}
{"patent_id": "10-2023-0099279", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "설명에 앞서, 본 명세서에서 \"포함\"된다고 언급하는 구성요소는 다른 구성요소를 제외하지 않고 추가 구성요소 를 포함할 수 있다는 점을 명심해야 한다. 본 명세서에서 \"실시예\"라는 용어는 예시, 사례 또는 도해를 의미하지만, 발명의 범위는 이러한 예에 제한되지 않는다. 그리고 \"포함\"과 같은 용어는 청구범위에서 사용될 때 임의의 추가적인 또는 다른 구성요소를 배제하지 않는 개방적인 전환어로 해석된다. 또한, 본 명세서의 전반에 걸쳐 기재된 \"모듈(module)\", \"장치(device)\" 및 \"시스템(system)\" 등의 용어는 하나 이상의 기능이 조합된 동작을 처리하는 단위를 나타낸다. 이러한 단위는 하드웨어, 소프트웨어, 또는 그들의 결 합으로 구현될 수 있다. 또한, 각 장치에서 실행되는 프로그램은 \"모듈(module)\", \"장치(device)\" 및 \"시스템 (system)\" 단위로 구성될 수 있으며, 물리적 메모리에 기록되거나 분산된 메모리 또는 기록매체에 의해 읽기, 쓰기 및 지워질 수 있으며, 장치에 탑재된 마이크로 프로세서에 의해 실행된다. 본 명세서에 기술된 다양한 기법은 하드웨어 또는 소프트웨어와 함께 구현될 수 있으며, 필요에 따라 이들의 조 합으로 구현될 수 있다. 컴퓨터 관련 엔티티(Entity)인 \"모듈\", \"장치\", \"시스템\" 등의 용어는 하드웨어, 소프 트웨어, 또는 그들의 조합, 소프트웨어 또는 실행 시 소프트웨어와 동등하게 취급된다. 이러한 기술적인 접근 방식은 데이터 보안에 중요한 역할을 하며, 사용자들은 안전한 데이터 전송과 저장을 보장받을 수 있으며 기밀 성과 무결성을 유지하면서 안전하게 데이터를 관리할 수 있다. 또한, 본 명세서에 기술된 '생명시간함수'는 딥러닝, 생성적 적대 신경망, 컴퓨터 비전 기술을 변수로 활용하여 다양한 장치에서 이미지 생성에 사용되며, 작품(이미지 등)의 '유효 기간'을 설명하고, 작품의 특성에 따라 변 수를 활용해 조절하는 기능을 가진다. 이미지를 기반으로 하는 이 함수의 개념 공식은 생명시간함수(유효기간) = A * sin(B * t) + C * exp(D * t) + E * log(F * t + G) + H 이며, 각 변수는 작품 의 주기성, 지속성, 성장과 감소 속도, 상세한 변화 등을 반영한다. 작가들은 이 공식을 활용하여 작품의 특성을 조절하고 다양한 효과를 표현할 수 있다. 또한, 본 명세서에 기술된 보안 프로토콜은 암호화와 복호화에 사용되는 보안 프로토콜을 설계하고 그에 적합한 해시함수(SHA-256, SHA-3, BLAKE2)로 구현된 안전금고(hash vault:고급 암호화 알고리즘과 보안 프로토콜로 구 현된 데이터의 안전한 전송과 저장을 위한 시스템)를 구현함으로써 데이터의 안전한 전송과 저장을 보장할 수 있다. 고급 암호화 알고리즘과 키 관리 시스템을 활용하여 데이터의 기밀성과 무결성을 유지할 수 있다. 이와 같은 기술적인 접근 방식은 사용자들에게 안전하고 신뢰할 수 있는 가상공간 상의 멀티펑션 기능의 XR ATM(CAM: Currency Access Machine)을 제공하며, 데이터의 기밀성과 무결성을 보장하고, 안전한 데이터 전송과 저장을 가능하게 합니다. 이를 통해 사용자들은 편리하고 안전한 금융 거래와 서비스를 이용할 수 있다. 이하, 도면을 참조하여 본 발명의 바람직한 실시예에 따른 초고속 유무선 인터넷을 이용한 HMD류를 활용한 멀티 펑션 XR ATM (약칭: CAM)의 구현과 관련된 방법과 시스템을 설명한다. 도11은 본 발명의 실시예에 따른 IP 망을 이용하여 가상공간 상에서 '멀티펑션 기능의 XR ATM (CAM: Currency Access Machine)'을 구현하는 방법과 그 시스템의 전체 구조를 나타내는 도면이다. 도11을 참조하면, 초고속 유무선 인터넷을 이용한 HMD류를 활용한 멀티펑션 XR ATM (약칭: CAM)의 구현과 관련 된 방법과 시스템은 사용자의 요청으로부터 시작하여, 거래가 성공적으로 완료될 때까지의 모든 과정을 담고 있 는 IP 망을 이용한 가상공간 상에서 작동하는 '멀티펑션 기능의 XR ATM (CAM: Currency Access Machine)'의 전 체 시스템 구조를 보여준다. 도11을 참조하면, 본 발명의 실시예에 따른 초고속 유무선 인터넷을 이용한 HMD류를 활용한 멀티펑션 XR ATM (약칭: CAM)의 구현과 관련된 방법과 시스템은 크게 사용자 인증 서버, 거래 요청 서버, CAM 이미지 웨 어 액세스 서버, 시간 개념 이미지보안 작동서버, 거래 처리 서버, 거래 완료 알림 서버, 네트워크 장비, 사용자와 시스템 간의 인터랙션은 CAM 장치를 통해 단계별로 이루어진다. 첫 번째 단계인 '사용자 인증'은 사용자 인증 서버에서 시작된다. 사용자는 CAM 장치를 통해 인증 절 차(100단위)를 거치고, 이러한 인증 정보는 사용자 인증 서버에 의해 처리된다. 이 서버는 사용자의 인증이 성공적으로 이루어졌는지 확인하고, 해시함수 인증 토큰을 생성한다. 인증이 성공적으로 이루어진 후, 거래 요청 서버가 활성화된다. 사용자는 여기에서 원하는 거래 유형 을 선택하고, 필요한 정보를 입력한다. 입력이 완료되면, 이 정보는 거래 요청 서버에 의해 처리되고, CAM 이미지 웨어 액세스 서버로 전달된다. CAM 이미지 웨어 액세스 서버는 사용자를 XR 환경의 가상 ATM에 연결한다. 이 과정에서 사용자는 가상 ATM 인터페이스를 통해 거래를 진행한다. 거래가 시작되면, 시간 개념 이미지보안 작동서버로 거래 정보가 전달된다. 시간 개념 이미지보안 작동서버는 CAM의 시간 기반 이미지 보안 기능을 활성화하고, 거래 정보의 무결 성을 검증한다. 이러한 검증된 정보는 거래 처리 서버로 전달된다. 거래 처리 서버는 받은 정보를 바탕으로 거래를 실제로 처리한다. 이 과정에서, 서버는 사용자의 요청에 따 라 필요한 작업을 수행하고, 거래 결과를 생성한다. 이렇게 생성된 결과는 거래 완료 알림 서버로 전달된다. 마지막으로, 거래 완료 알림 서버는 거래 완료 알림을 사용자에게 전달한다. 사용자는 이 알림을 통해 거래 가 성공적으로 처리되었음을 확인할 수 있다. 이러한 모든 과정은 네트워크 장비를 통해 관리되며, 사용자와 시스템 간의 인터랙션은 CAM 장치를 통 해 이루어진다. 이렇게 각 요소와 과정이 서로 연결되어 있어, 사용자의 요청부터 최종 거래 완료까지 원활하게 이루어질 수 있다. 이렇게 각 서버는 특정 역할을 수행하고, 작업의 결과를 다음 서버로 전달하여 사용자의 거래 요청을 완벽하게 처리한다. 이 흐름을 도면으로 표현하면 사용자의 요청이 어떻게 처리되는지에 대한 더욱 명확한 이해를 얻을 수 있을 것이다. 도 12는 IP 네트워크를 사용하여 가상 공간에서 다기능 ATM(화폐 접근 기계, CAM)을 구현하는 방법과 시스템의 가상 현실 서버 구조를 설명하는 도면이다. 도 12를 참조하면, 사용자 요청 단계 , 거래 요청 처리 단계 , 가상 ATM 액세스 단계 , 거래 처 리 단계 , 거래 완료 알림 단계 을 통해 단계별로 이루어진다. 사용자 요청 단계 : 사용자가 CAM 장치나 HMD 디바이스를 통해 거래를 요청한다 (101: 사용자 요청). 먼저, 사용자 인증 서버에서 사용자의 신원을 확인한다 (102: 사용자 인증). 사용자 인증이 성공하면 거래 요청 이 거래 요청 서버로 전달된다 (103: 거래 요청 전달).거래 요청 처리 단계 : 거래 요청 서버에서 사용자의 요청을 분석하고, 사용자가 요청한 거래의 종류(예: 인출, 이체, 결제 등)와 필요한 정보를 취합한다 (201-203: 요청 분석, 거래 종류 확인, 정보 취합). 이 정보는 그 후 CAM 이미지 웨어 액세스 서버로 전달된다 (204: 정보 전달). 가상 ATM 액세스 단계 : CAM 이미지 웨어 액세스 서버에서는 사용자에게 가상환경에서의 ATM 액세스를 제 공한다 (301: 가상 ATM 액세스 제공). 거래가 시작되면, 동시에 시간 개념 이미지 보안 작동 서버에서는 거래 과정에서 발생하는 이미지와 데이터를 안전하게 관리하고 보호하는 역할을 시작한다 (302: 이미지 및 데이터 보 호). 거래 처리 단계 : 거래 요청이 거래 처리 서버로 전달된다 (401: 거래 요청 전달). 이 서버에서는 사용자 의 거래 요청을 처리하고, 필요한 모든 작업을 수행한다 (402-403: 거래 처리, 필요한 작업 수행). 거래 완료 알림 단계 : 거래가 성공적으로 처리되면, 거래 완료 알림 서버를 통해 사용자에게 거래 완료 알림이 전송된다 (501-502: 거래 완료, 사용자에게 알림 전송). 이 전체 흐름은 가상현실 서버에서 관리되며, 이를 통해 사용자는 가상공간에서 ATM 거래를 진행할 수 있다. 이 렇게 각 서버들이 서로 연계하여 작동함으로써, 사용자는 가상공간에서의 거래를 안전하고 편리하게 수행할 수 있다. 도 13은 IP 망을 이용하여 가상공간에서 멀티펑션 기능의 XR ATM (CAM: Currency Access Machine)을 구현하는 방법과 시스템의 터치스크린 가상 지폐개수기에 대한 설명을 담고 있다. 도 13을 참조하면, 터치스크린 지폐개수기 (71: CAM 장치, 710: 터치스크린 지폐개수기), 디스플레이 화면 (720: 디스플레이 화면), 터치스크린 패널 (730: 터치스크린 패널), 지폐 인식 기능 (740: 지폐 인식 기능), 인 증 기능 (750: 인증 기능), 시간 개념 이미지 보안 기능 (760: 이미지 보안 기능)을 통해 단계별로 이루어진다. 터치스크린 지폐개수기 (71: CAM 장치, 710: 터치스크린 지폐개수기): 이 지폐개수기는 CAM 시스템의 일부로 가 상현실 기술을 통해 사용자가 가상환경에서 실제 ATM과 유사한 경험을 할 수 있도록 한다 (300: 사용자에게 XR 환경의 가상 ATM 인터페이스 제공, 310: 사용자 경험 생성). 디스플레이 화면 (720: 디스플레이 화면): 터치스크린 지폐개수기의 중앙에는 디스플레이 화면이 위치하고 있다. 이 화면은 사용자에게 가상환경에서 ATM 서비스를 시각적으로 제공하며, 거래 정보와 옵션 등을 표시한다 (301: XR 환경 접속, 311: 가상 디스플레이 화면 제공). 터치스크린 패널 (730: 터치스크린 패널): 가상 디스플레이 화면 아래에는 터치스크린 패널이 있다. 사용자는 이 터치스크린 패널을 터치하여 거래를 요청하고 원하는 옵션을 선택할 수 있다 (200: 사용자의 거래 유형 선택, 210: 거래 옵션 제공). 지폐 인식 기능 (740: 지폐 인식 기능): 터치스크린 지폐개수기는 사용자가 지폐를 입력하면 해당 지폐를 인식 하여 개수를 계산한다. 이를 통해 사용자는 가상현실 상에서도 현실과 유사하게 지폐를 인식하고 거래를 진행할 수 있다 (202: 인출 선택, 212: 지폐 인식 및 계산).인증 기능 (750: 인증 기능): CAM 시스템의 사용자 인증 서버와 연동하여 사용자의 신원을 확인하고 정당한 사 용자만이 거래를 요청할 수 있도록 보장한다. 사용자는 비밀번호 입력, 얼굴 인식, 지문 인식 등의 인증 방법을 사용하여 인증을 수행한다 (100: 사용자 인증 시작, 110: 인증 방법 선택). 시간 개념 이미지 보안 기능 (760: 이미지 보안 기능): 터치스크린 지폐개수기는 거래 중에 CAM의 시간 개념 이 미지 보안 기능을 활성화하여 거래 과정의 안전성을 보호하고 거래 정보의 무결성을 유지한다 (400: 이미지 보 안 프로토콜 활성화, 410: 거래 유효성 검사). 터치스크린 지폐개수기는 사용자가 가상공간 상에서도 실제 ATM 과 비슷한 경험을 할 수 있도록 하며, CAM 시스템의 다양한 기능과 연동하여 편리하고 안전한 거래를 가능하게 한다. 터치스크린 지폐개수기는 사용자가 가상공간 상에서도 실제 ATM과 비슷한 경험을 할 수 있도록 하며, CAM 시스 템의 다양한 기능과 연동하여 편리하고 안전한 거래를 가능하게 한다. 도 14는 본 발명의 실시예에 따른 IP 망을 이용하여 가상공간 상에서 이미지화 된 ‘멀티펑션기능의 XR ATM(CAM: CURRENCY ACCESS MACHINE )을 구현하는 방법과 그 시스템의 가상현실 제공의 구조를 나타낸 것이다. 사용자가 가상현실 프로그램을 실행하고 가상환경에 진입하게 된다. 가상환경 내에서는 사용자가 다양한 요소들과 상호작용할 수 있습니다. 사용자가 선택한 거래는 가상현실 시뮬레이션을 통해 진행된다. 사용자는 실제 ATM이 제공하는 기능들을 가상 환경에서 체험하게 된다. 거래 과정 중에는 사용자의 입력 정보가 실시간으로 거래 처리 서버로 전송된다. 사용자는 가상환경에서 제공되는 사용자 인터페이스를 통해 이미지화된 멀티펑션 XR ATM을 선택하고, 원하는 거 래를 시작한다. 그 후, 사용자가 선택한 요구 사항에 따라 ATM이 가상환경 내에서 실제 ATM 기기처럼 동작 하기 시작한다. 이 때, 요청된 거래의 정보는 거래 처리 서버로 전달되며, 서버는 거래를 처리하고 결과를 사용자에게 피드백한다. 예를 들어, 사용자가 현금 인출을 선택한 경우, 거래 처리 서버는 사용자의 계정 에서 해당 금액을 차감하고, 가상환경에서의 ATM에서 현금이 인출되는 모습을 시뮬레이션한다. 가상환경에서의 거래가 이루어지는 동안, 시간 개념 이미지 보안 기능이 활성화된다. 이 기능은 거래 과정 중 생성되는 이미지와 데이터를 보호하며, 이를 통해 사용자의 거래 정보의 안전성을 보장하고 무결성을 유지한 다. 이 과정은 사용자가 보안이 유지되는 가상환경에서 거래를 수행할 수 있게 한다. 거래 처리가 완료되면, 거래 완료 알림 서버가 작동하여 사용자에게 거래 완료를 알린다. 사용자는 이 알 림을 통해 거래가 성공적으로 완료되었음을 확인할 수 있다. 사용자는 이후에도 가상환경에서 추가 거래를 진행 하거나, 프로그램을 종료하고 가상환경을 빠져나올 수 있다. 위의 과정을 통해 사용자는 가상공간에서도 실제 ATM과 유사한 경험을 할 수 있으며, 가상현실 프로그램의 다양 한 기능을 통해 편리하고 안전한 거래를 진행할 수 있다. 이렇게 구현된 멀티펑션 XR ATM(CAM)은 사용자에게 다 양한 디지털 자산을 활용하고 통합된 서비스를 제공하는 기능을 가지고 있다. 도 15, 도 16은 본 발명의 실시예에 따른 사용자가 IP 망을 이용하여 가상공간 상에서 이미지화 된 ‘멀티펑션 기능의 XR ATM(CAM: CURRENCY ACCESS MACHINE )'을 어떻게 이용하는지에 대한 이용행태를 예시한 이미지이다. Image 1. XR CAM 사용자가 HMD를 착용을 하게되면 현대적이고 스타일리시한 XR ATM(CAM: CURRENCY ACCESS MACHINE)'이 나타난다. 사용자 친화적인 인터페이스와 얼굴 인식 센서, 지문 인식 센서가 내장되어 있다. Image 2. 사용자 인증 과정 사용자는 카메라를 향해 웃으면서 인증 과정을 시작한다. 얼굴 특징과 지문 정보가 '인증 서버'로 전송되어 검 증된다. 인증에 성공하면 CAM은 환영 메시지와 사용자 이름을 화면에 표시하여 개인화된 서비스를 제공한다. Image 3. 거래 유형 선택 인증된 사용자는 CAM 장치의 화면에서 다양한 \"거래 유형\"을 선택할 수 있다. \"인출\"을 선택하면, XR과 3D 시각 효과가 적용된 \"ATM 환경\"으로 전환되고 가상 지폐와 디지털자산을 확인하고 선택할 수 있다. Image 4. 가상 지폐 인출 사용자가 지폐, 화폐, 디지털자산을 터치하면, CAM은 사용자의 동작을 인식하고 손가락으로 가상 상기 지폐 등 을 집어내는 느낌을 제공한다. 이러한 상호작용으로 직관적이고 즐거운 거래 경험을 제공하며, 동시에 높은 수 준의 실용성을 유지한다. Image 5. 시간 개념 이미지 보안 기능 CAM의 고유한 시간 개념 이미지 보안 기능이 거래 과정에서 활성화된다. 거래 정보와 이미지는 각각의 고유한 시간 정보와 연결되어 안전하게 관리되며, 거래의 무결성을 유지하고 추후 검증이 가능하게 한다. Image 6. 거래 요청 처리 사용자의 거래 요청이 CAM 시스템에 도달하면, 거래 처리 서버가 빠르고 정확하게 거래를 처리하여 사용자가 편 리하게 거래를 완료할 수 있도록 돕는다. Image 6. 거래 완료 알림 거래가 성공적으로 완료되면, CAM은 사용자에게 알림을 보내어 거래가 성공적으로 완료되었음을 알린다. 사용자 는 알림을 터치하여 거래 완료를 확인하고 만족스러운 서비스 경험을 마무리할 수 있다. 이렇게 각 단락별로 사용자가 CAM을 시작하고 끝날 때까지의 모습을 이미지로 설명한 것이다. 사용자 친화적인 인터페이스와 다양한 기능으로 사용자의 안전하고 편리한 디지털 자산 이용을 돕는 CAM의 특징들이 잘 드러나는 설명이다. 상기 도면에 대한 설명에 많은 사항이 구체적으로 기재되어 있으나 이것은 발명의 범위를 한정하는 것이 아니고 보다 바람직한 실시예의 예시로서 해석되어야 한다. 따라서, 발명은 설명된 실시예에 의하여 정할 것이 아니고 특허청구범위와 특허청구 범위에 균등한 것에 의하여 정하여 져야 한다. 산업상 이용가능성 XR 기술을 활용한 멀티펑션 XR ATM (CAM)의 구현은 다양한 산업 분야에서 혁신적인 이용 가능성을 제시한다. 아 래는 이러한 산업상 이용 가능성에 대한 몇 가지 예시이다: 1. 금융 서비스 산업: XR 환경으로 구현된 멀티펑션 XR ATM인 CAM은 기존의 ATM 시스템에서 제공되는 서비스 범 위를 확장시킬 수 있다. 가상 현실에서 디지털 자산 거래, 계좌 조회, 송금 등 다양한 금융 서비스를 제공하여 사용자들에게 더욱 다채로운 금융 경험을 제공할 수 있다. 2. 소매 산업: XR 기술을 적용한 멀티펑션 XR ATM은 소매 업체와의 협업을 통해 새로운 결제 및 구매 경험을 제 공할 수 있다. 가상 현실에서 상점과의 상호작용을 통해 실제 상품을 확인하고 구매할 수 있는 기능을 제공함으 로써 오프라인과 온라인 경계를 더욱 허물어 소비자들에게 더욱 편리하고 흥미로운 쇼핑 경험을 제공할 수 있다. 3. 교육 산업: XR 환경에서의 멀티펑션 XR ATM은 금융 교육에도 적용될 수 있다. 학습자들은 가상 현실에서 실 제 금융 거래를 시뮬레이션하고 금융 지식을 습득할 수 있으며, 금융 상식을 보다 실전적으로 학습할 수 있다. 4. 여가 및 엔터테인먼트 산업: XR 기술은 즐길거리와 엔터테인먼트를 제공하는 분야에서도 응용될 수 있다. 가 상 현실에서 다양한 체험과 게임을 제공함으로써 사용자들에게 재미와 즐거움을 제공할 수 있다. 5. 보안 산업: XR 환경에서의 멀티펑션 XR ATM은 보안 산업에도 이용 가능성을 제시한다. 가상 현실에서 실제 금융 거래를 처리하고 보안 기술을 적용함으로써 보다 안전한 거래 환경을 제공할 수 있다. 이처럼 XR 기술을 활용한 멀티펑션 XR ATM인 CAM의 핵심기술은 다양한 산업 분야에서 혁신적인 서비스와 경험을 제공할 수 있는 가능성을 가지고 있으며, 미래 산업의 발전과 혁신에 큰 기여를 할 수 있다."}
{"patent_id": "10-2023-0099279", "section": "도면", "subsection": "도면설명", "item": 1, "content": "상기 설명한 도1, 도2, 도3, 도4, 도5, 도6, 도7, 도8, 도9, 도10은 시스템의 작동과 처리에 관련되고 그 해결 할 과제에 대한 것이었다. 아래의 설명할 도면은 사용자가 XR환경에 적용하고 활용되는 하드웨어와 소프웨어, 그리고 보안과 이미지웨어의 작동 등의 보완 설명에 대한 것이다. 도 11은, 본 발명의 실시예에 따른 IP 망을 이용하여 가상공간 상에서 '멀티펑션 기능의 XR ATM (CAM: Currency Access Machine)'을 구현하는 방법과 그 시스템의 전체 구조를 나타내는 도면이다. 도 12는 본 발명의 실시예에 따른 IP 네트워크를 사용하여 가상 공간에서 다기능 ATM(화폐 접근 기계, CAM)을 구현하는 방법과 시스템의 가상 현실 서버 구조를 설명하는 도면이다. 도 13은 본 발명의 실시예에 따른 IP 망을 이용하여 가상공간 상에서 ‘멀티펑션기능의 XR ATM(CAM: CURRENCY ACCESS MACHINE )을 구현하는 방법과 그 시스템 의 터치스크린 가상 지페개수기에 대한 것이다. 도 14는 본 발명의 실시예에 따른 IP 망을 이용하여 가상공간 상에서 이미지화된 멀티펑션기능의 XR ATM(CAM: CURRENCY ACCESS MACHINE )을 구현하는 방법과 그 시스템의 가상현실 제공의 구조를 나타낸 것이다. 도 15, 도 16은 본 발명의 실시예에 따른 사용자가 IP 망을 이용하여 가상공간 상에서 이미지화 된 ‘멀티펑션 기능의 XR ATM(CAM: CURRENCY ACCESS MACHINE )을 어떻게 이용하는지에 대한 이용행태를 예시한 이미지이다."}
