{"patent_id": "10-2022-0077017", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0000258", "출원번호": "10-2022-0077017", "발명의 명칭": "사용자 맞춤형 자동차 서비스의 통합 제공 방법 및 장치", "출원인": "이연우", "발명자": "이연우"}}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 장치에 의해 수행되는 사용자 맞춤형 자동차 서비스의 통합 제공 방법으로서, 적어도 하나의 서버로부터 사용자의 사용자 정보를 획득하는 단계, 상기 사용자 정보를 기초로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수의 자동차 서비스들 중적어도 하나를 관심 서비스로 결정하는 단계, 및상기 관심 서비스에 관한 사용자 인터페이스를 사용자 단말 상에 디폴트 뷰로 디스플레이 하는 단계를 포함하는, 사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에서,상기 사용자 정보를 획득하는 단계는, 데이터 스크래핑(data scraping) 기법을 사용하여, 상기 사용자 정보를 수집 가능한 상기 적어도 하나의 서버로부터 상기 사용자 정보를 획득하는 단계를 포함하는,사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에서,상기 사용자 정보는,복수의 항목들로 구성되고,상기 복수의 항목들은,상기 사용자의 성별, 나이, 직업, 자산, 운전 성향, 결제 이력, 및 보험 이력 중 적어도 일부를 포함하는, 사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에서,상기 관심 서비스로 결정하는 단계는, 상기 복수의 항목들 중 적어도 하나와 상기 복수의 자동차 서비스들 중 적어도 하나를 매칭하여 기 구축 된 룰기반 알고리즘을 기초로, 상기 사용자 정보와 대응되는 자동차 서비스를 상기 관심 서비스로 자동 결정하는 단계를 포함하는,사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0000258-3-제 3항에서,상기 관심 서비스로 결정하는 단계는,상기 복수의 항목들을 튜플 형식으로 구성하여 상기 사용자에 관한 사용자 벡터를 생성하는 단계, 및상기 사용자 벡터를 기 학습된 인공지능 기반 분류 모델에 입력하여, 복수의 자동차 서비스들 중 상기 사용자벡터와 대응되는 자동차 서비스를 상기 관심 서비스로 자동 결정하는 단계를 포함하는,사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에서,상기 관심 서비스로 자동 결정하는 단계는, 상기 사용자 단말을 통해, 상기 사용자로부터 상기 복수의 자동차 서비스들 중 적어도 하나의 자동차 서비스에대한 선택을 입력 받는 단계, 및선택이 입력된 상기 적어도 하나의 자동차 서비스를 상기 관심 서비스로 결정하는 단계를 포함하는,사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에서,상기 구매 서비스는,신차 견적 서비스, 복수의 신차에 대한 비교 서비스, 신차 제원 안내 서비스, 신차 카탈로그 서비스, 중고차 검색 서비스, 차량 구매 요청 서비스, 및 차량 구매에 과한 금융 안내 서비스 중 적어도 일부를 포함하는,사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에서,상기 판매 서비스는,상기 사용자의 차량에 관한 중고 시세 예측 서비스, 및 상기 사용자의 차량에 관한 차량 판매 요청 서비스 중적어도 일부를 포함하는, 사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에서,상기 부가 서비스는,상기 사용자의 자동차에 관한 관리 서비스, 튜닝 서비스, 액세서리 서비스, 및 업체 추천 서비스 중 적어도 일부를 포함하는, 사용자 맞춤형 자동차 서비스의 통합 제공 방법.공개특허 10-2024-0000258-4-청구항 10 제 1항에서,상기 디폴트 뷰로 디스플레이 하는 단계는,상기 관심 서비스에 관한 사용자 인터페이스를 서비스 변경 엔티티와 함께 상기 사용자 단말 상에 상기 디폴트뷰로 디스플레이 하는 단계, 및상기 서비스 변경 엔티티에 대한 상기 사용자의 선택을 수신하는 경우, 상기 복수의 자동차 서비스들 중 상기사용자의 선택에 대응되는 자동차 서비스에 관한 사용자 인터페이스를, 상기 관심 서비스에 관한 사용자 인터페이스를 대체하여 상기 사용자 단말 상에 디스플레이 하는 단계를 포함하는,사용자 맞춤형 자동차 서비스의 통합 제공 방법."}
{"patent_id": "10-2022-0077017", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "하나 이상의 프로세서를 포함하는 사용자 맞춤형 자동차 서비스의 통합 제공 장치로서, 적어도 하나의 서버로부터 사용자의 사용자 정보를 획득하는, 사용자 정보 수집부,상기 사용자 정보를 기초로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수의 자동차 서비스들 중적어도 하나를 관심 서비스로 결정하는, 관심 서비스 결정부, 및상기 관심 서비스에 관한 사용자 인터페이스를 사용자 단말 상에 디폴트 뷰로 디스플레이 하는, 사용자 인터페이스 결정부를 포함하는, 사용자 맞춤형 자동차 서비스의 통합 제공 장치."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따라, 컴퓨팅 장치에 의해 수행되는 사용자 맞춤형 자동차 서비스의 통합 제공 방법으로 서, 상기 방법은, 적어도 하나의 서버로부터 사용자의 사용자 정보를 획득하는 단계, 상기 사용자 정보를 기초로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수의 자동차 서비스들 중 적어도 하나를 관심 서비스로 결정하는 단계, 및 상기 관심 서비스에 관한 사용자 인터페이스를 사용자 단말 상에 디폴트 뷰로 디스 플레이 하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 사용자 맞춤형 자동차 서비스의 통합 제공 방법 및 장치 에 관한 것이다."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자동차 서비스 업체 직원은 고객으로부터 차량 정보, 차량 구매와 관련된 금융상품정보, 기존에 소유 중인 차량 처분 의뢰, 자동차 액세서리 등 다양한 문의와 요구사항을 받는 것이 일반적이다. 자동차 서비스 업체 직원은 고객의 문의 또는 요구사항에 따라 자동차 제조사의 전산 또는 제조사에서 제공하는 자동차 카탈로그 등 다양한 채널을 통해 정보를 확인 및 취합한 후 고객에게 정보를 전달한다. 또한, 자동차 서 비스 업체 직원은 고객의 요청에 의해, 고객이 소유 중인 차량의 중고 시세를 확인하여야 하며, 이 때, 중고 견 적 서비스를 제공하는 별도의 어플리케이션 또는 별도의 웹사이트를 이용하여 중고 견적을 확인한 후 고객에게 전달한다. 자동차 서비스 업체 직원을 통하지 않을 경우, 사용자가 원하는 다양한 정보를 제공하는 채널은 개별적으로 운 영 및 제공되므로, 사용자는 상술한 다양한 정보들을 직접 수집하여야 하며, 이는 더욱 많은 시간과 번거로움을 야기하게 된다. 이에 따라, 정보 제공 방법을 개선하여 사용자가 자동차와 관련한 다양한 서비스를 통합적으로 제공받을 수 있 고, 한편 많은 정보를 직접 입력하는 번거로움 없이도 사용자의 현재 상황에 맞추어 선별된 서비스를 제공받을 수 있는 기술이 요구된다."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "해결하고자 하는 과제는, 자동차와 관련한 다수의 서비스를 자동으로 수집되는 사용자 정보를 기초로 사용자 맞 춤형으로 구성 및 제공하는 것이다. 이외에도 구체적으로 언급되지 않은 다른 과제를 달성하는 데 사용될 수 있 다."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 컴퓨팅 장치에 의해 수행되는 사용자 맞춤형 자동차 서비스의 통합 제공 방법으로 서, 상기 방법은, 적어도 하나의 서버로부터 사용자의 사용자 정보를 획득하는 단계, 상기 사용자 정보를 기초 로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수의 자동차 서비스들 중 적어도 하나를 관심 서 비스로 결정하는 단계, 및 상기 관심 서비스에 관한 사용자 인터페이스를 사용자 단말 상에 디폴트 뷰로 디스플 레이 하는 단계를 포함할 수 있다. 상기 사용자 정보를 획득하는 단계는, 데이터 스크래핑(data scraping) 기법을 사용하여, 상기 사용자 정보를 수집 가능한 상기 적어도 하나의 서버로부터 상기 사용자 정보를 획득하는 단계를 포함할 수 있다. 상기 사용자 정보는, 복수의 항목들로 구성되고, 상기 복수의 항목들은, 상기 사용자의 성별, 나이, 직업, 자산, 운전 성향, 결제 이력, 및 보험 이력 중 적어도 일부를 포함할 수 있다. 상기 관심 서비스로 결정하는 단계는, 상기 복수의 항목들 중 적어도 하나와 상기 복수의 자동차 서비스들 중 적어도 하나를 매칭하여 기 구축 된 룰 기반 알고리즘을 기초로, 상기 사용자 정보와 대응되는 자동차 서비스를 상기 관심 서비스로 자동 결정하는 단계를 포함할 수 있다. 상기 관심 서비스로 결정하는 단계는, 상기 복수의 항목들을 튜플 형식으로 구성하여 상기 사용자에 관한 사용 자 벡터를 생성하는 단계, 및 상기 사용자 벡터를 기 학습된 인공지능 기반 분류 모델에 입력하여, 복수의 자동 차 서비스들 중 상기 사용자 벡터와 대응되는 자동차 서비스를 상기 관심 서비스로 자동 결정하는 단계를 포함 할 수 있다. 상기 관심 서비스로 자동 결정하는 단계는, 상기 사용자 단말을 통해, 상기 사용자로부터 상기 복수의 자동차 서비스들 중 적어도 하나의 자동차 서비스에 대한 선택을 입력 받는 단계, 및 선택이 입력된 상기 적어도 하나 의 자동차 서비스를 상기 관심 서비스로 결정하는 단계를 포함할 수 있다. 상기 구매 서비스는, 신차 견적 서비스, 복수의 신차에 대한 비교 서비스, 신차 제원 안내 서비스, 신차 카탈로 그 서비스, 중고차 검색 서비스, 차량 구매 요청 서비스, 및 차량 구매에 과한 금융 안내 서비스 중 적어도 일 부를 포함할 수 있다. 상기 판매 서비스는, 상기 사용자의 차량에 관한 중고 시세 예측 서비스, 및 상기 사용자의 차량에 관한 차량 판매 요청 서비스 중 적어도 일부를 포함할 수 있다. 상기 부가 서비스는, 상기 사용자의 자동차에 관한 관리 서비스, 튜닝 서비스, 액세서리 서비스, 및 업체 추천 서비스 중 적어도 일부를 포함할 수 있다. 상기 디폴트 뷰로 디스플레이 하는 단계는, 상기 관심 서비스에 관한 사용자 인터페이스를 서비스 변경 엔티티 와 함께 상기 사용자 단말 상에 상기 디폴트 뷰로 디스플레이 하는 단계, 및 상기 서비스 변경 엔티티에 대한 상기 사용자의 선택을 수신하는 경우, 상기 복수의 자동차 서비스들 중 상기 사용자의 선택에 대응되는 자동차 서비스에 관한 사용자 인터페이스를, 상기 관심 서비스에 관한 사용자 인터페이스를 대체하여 상기 사용자 단말 상에 디스플레이 하는 단계를 포함할 수 있다. 본 발명의 실시예에 따라, 하나 이상의 프로세서를 포함하는 사용자 맞춤형 자동차 서비스의 통합 제공 장치로 서, 적어도 하나의 서버로부터 사용자의 사용자 정보를 획득하는, 사용자 정보 수집부, 상기 사용자 정보를 기 초로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수의 자동차 서비스들 중 적어도 하나를 관심 서비스로 결정하는, 관심 서비스 결정부, 및 상기 관심 서비스에 관한 사용자 인터페이스를 사용자 단말 상에 디폴트 뷰로 디스플레이 하는, 사용자 인터페이스 결정부를 포함할 수 있다. 상기 사용자 정보 수집부는, 데이터 스크래핑(data scraping) 기법을 사용하여, 상기 사용자 정보를 수집 가능 한 상기 적어도 하나의 서버로부터 상기 사용자 정보를 획득할 수 있다. 상기 사용자 정보는, 복수의 항목들로 구성되고, 상기 복수의 항목들은, 상기 사용자의 성별, 나이, 직업, 자산, 운전 성향, 결제 이력, 및 보험 이력 중 적어도 일부를 포함할 수 있다. 상기 관심 서비스 결정부는, 상기 복수의 항목들 중 적어도 하나와 상기 복수의 자동차 서비스들 중 적어도 하 나를 매칭하여 기 구축 된 룰 기반 알고리즘을 기초로, 상기 사용자 정보와 대응되는 자동차 서비스를 상기 관 심 서비스로 자동 결정할 수 있다. 상기 관심 서비스 결정부는, 상기 복수의 항목들을 튜플 형식으로 구성하여 상기 사용자에 관한 사용자 벡터를 생성하고, 상기 사용자 벡터를 기 학습된 인공지능 기반 분류 모델에 입력하여, 복수의 자동차 서비스들 중 상 기 사용자 벡터와 대응되는 자동차 서비스를 상기 관심 서비스로 자동 결정할 수 있다. 상기 관심 서비스 결정부는, 상기 사용자 단말을 통해, 상기 사용자로부터 상기 복수의 자동차 서비스들 중 적 어도 하나의 자동차 서비스에 대한 선택을 입력 받는 경우, 선택이 입력된 상기 적어도 하나의 자동차 서비스를 상기 관심 서비스로 결정할 수 있다. 상기 구매 서비스는, 신차 견적 서비스, 복수의 신차에 대한 비교견적 서비스, 신차 제원 안내 서비스, 신차 카 탈로그 서비스, 중고차 검색 서비스, 차량 구매 요청 서비스, 및 차량 구매에 과한 금융 안내 서비스 중 적어도 일부를 포함할 수 있다. 상기 판매 서비스는, 상기 사용자의 차량에 관한 중고 시세 예측 서비스, 및 상기 사용자의 차량에 관한 차량 판매 요청 서비스 중 적어도 일부를 포함할 수 있다. 상기 부가 서비스는, 상기 사용자의 자동차에 관한 관리 서비스, 튜닝 서비스, 액세서리 서비스, 및 업체 추천 서비스 중 적어도 일부를 포함할 수 있다. 상기 사용자 인터페이스 결정부는, 상기 관심 서비스에 관한 사용자 인터페이스를 서비스 변경 엔티티와 함께 상기 사용자 단말 상에 상기 디폴트 뷰로 디스플레이 하고, 상기 서비스 변경 엔티티에 대한 상기 사용자의 선 택을 수신하는 경우, 상기 복수의 자동차 서비스들 중 상기 사용자의 선택에 대응되는 자동차 서비스에 관한 사 용자 인터페이스를, 상기 관심 서비스에 관한 사용자 인터페이스를 대체하여 상기 사용자 단말 상에 디스플레이 할 수 있다."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 신차 구매에 필요한 정보, 보유 중인 차량의 처분을 위한 정보, 자동차 액세서리 구매와 관련된 정보 등 자동차와 관련한 다수의 정보 또는 다수의 서비스를 어플리케이션을 통해 통합 제공할 수 있다. 본 발명의 실시예에 따르면, 다수의 서비스 중 사용자가 직접 필요한 서비스를 탐색하거나, 혹은 사용자가 자신 의 정보를 직접 입력하는 번거로움 없이, 사용자 정보를 자동으로 수집하여 사용자의 관심도가 가장 높을 것으 로 예상되는 서비스를 선별하고 디스플레이 함으로써 사용자 경험을 향상시킬 수 있다."}
{"patent_id": "10-2022-0077017", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 네트워크를 구성하는 장치 들은 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 1은 본 개시의 몇몇 실시예에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치를 나타낸 블록도이다. 도 1을 참조하면, 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 사용자 정보 수집부 , 관심 서비스 결정부, 및 사용자 인터페이스 결정부를 포함할 수 있다. 다만 상술한 구성은 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치를 구현하는 데 필수적인 것은 아니어서, 사용 자 맞춤형 자동차 서비스의 통합 제공 장치는 열거된 구성보다 많거나 적은 구성들로 구현될 수 있다. 가령, 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 관심 서비스를 자동 결정하기 위 한 인공지능 모델을 학습시키기 위한 학습부(미도시) 및/또는 관심 서비스를 자동 결정하기 위한 인공지능 모델 이나 룰 기반 알고리즘을 저장하기 위한 저장부(미도시)를 더 포함할 수도 있다. 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 사용자 정보 수집을 위해 적어도 하나의 외부 서버(200a, 200b, 200c: 200)와 통신 가능하도록 연결될 수 있으며, 한편 본 개시의 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공 받고자 하는 적어도 하나의 사용자 단말과도 통신 가능하도록 연결될 수 있다. 도 1에서는 설명의 편의를 위해 사용자 맞춤형 자동차 서비스의 통합 제공 장치를 사용자 단말과 별 도의 장치로서 도시하였으나 이에 한정되는 것은 아니며, 사용자 맞춤형 자동차 서비스의 통합 제공 장치 는 사용자 단말과 단일한 장치로 구현될 수도 있다. 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치의 사용자 정보 수집부는, 적어도 하 나의 서버로부터 사용자의 사용자 정보를 획득할 수 있다. 구체적으로 사용자 정보 수집부는, 데이터 스크래핑(data scraping) 기법을 사용하여, 사용자 정보를 수집 가능한 적어도 하나의 서버로부터 사용자 정보를 획득할 수 있다. 데이터 스크래핑은, 사용자의 웹 브라우징 없이, 분산된 데이터들 중에서 서비스 제공에 필요한 데이터를 추출 해 사용자에게 제공하는 기술을 의미할 수 있다. 본 개시에 따른 데이터 스크래핑은 웹 스크래핑일 수 있다. 웹 스크래핑은 데이터 스크래핑의 한 방식으로, 디스플레이 장치를 통해 화면에 보여지는 데이터, 즉 일반적으로 웹사이트 등에 표시되는 정보를 수집하여 제공하는 것일 수 있다. 여기서 사용자 정보는 복수의 항목들로 구성될 수 있으며, 복수의 항목들은 예컨대 사용자의 성별, 나이, 직업, 자산, 운전 성향, 결제 이력, 및 보험 이력 중 적어도 일부를 포함할 수 있다. 예컨대 사용자의 운전 성향 항목의 경우, 사용자 단말에 설치되어 사용자가 소유한 차량의 정보를 실시간 으로 동기화 하는 애플리케이션에 의해 산출된 사용자의 운전 안전점수, 금융 관련 기관으로부터 스크래핑 된 사용자의 주유소 결제 주기나 결제 금액, 혹은 하이패스 결제 주기나 결제 금액, 또는 보험 관련 기관으로부터 스크래핑 된 사용자의 보험 처리 이력 등을 포함할 수 있다. 또는 사용자의 자금이나 결제 이력의 경우, 금융 관련 기관으로부터 스크래핑 될 수 있으며, 사용자의 유동 자 금 규모, 사용자의 자동차 구매 대금의 출금 또는 할부 결제 이력, 사용자의 자동차 판매 대금의 입금 또는 이 체 이력 등을 포함할 수 있다. 또는 사용자의 보험 이력의 경우, 하나 이상의 보험사, 한국 신용 정보원, 생명보험협회, 또는 손해보험협회 등 의 분산된 웹 사이트로부터 수집될 수 있으며, 사용자의 보험 계약 정보, 보험 처리 이력 등을 포함할 수 있다. 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치의 관심 서비스 결정부는, 사용자 정 보 수집부에서 수집된 사용자 정보를 기초로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수 의 자동차 서비스들 중 적어도 하나를 관심 서비스로 결정할 수 있다. 즉, 관심 서비스 결정부는 사용자 정보 수집부에서 수집된 사용자 정보를 기초로, 현재 사용자의 상 황에서 사용자가 가장 관심있어 할 만한 자동차 서비스를 관심 서비스로 결정할 수 있다. 예를 들어, 사용자 정보가 현재 사용자가 소유하고 있는 차량이 없으며, 사용자의 직업의 평균 소득이나 유동 자산이 동 나이대의 평균 이상이고 결제 이력 중 택시 이용 비율이 높음을 나타내는 경우, 사용자가 가장 관심 있어 할 만한 자동차 서비스는 구매 서비스일 수 있으며, 이에 따라 관심 서비스 결정부는 사용자 정보를 기초로 구매 서비스를 관심 서비스로 결정할 수 있다. 구매 서비스는, 사용자가 자동차를 구매하는 과정에서 필요로 하는 서비스로서, 신차 견적 서비스, 복수의 신차 에 대한 비교 서비스, 신차 제원 안내 서비스, 신차 카탈로그 서비스, 중고차 검색 서비스, 차량 구매 요청 서 비스, 및 차량 구매에 관한 금융 안내 서비스 중 적어도 일부를 포함할 수 있다. 신차 견적 서비스는, 사용자 단말을 통해 사용자로부터 자동차 제조사, 모델, 라인, 세부 모델, 색상, 옵 션, 할인 조건, 탁송비, 면세 조건, 차량 등록비용이나 부대비용(채권 매입, 채권할인, 증지대, 번호판대, 등록 대형료 등 다수) 등의 조건을 입력 받고, 입력 받은 조건을 기초로 견적을 산출하여 제공하는 서비스일 수 있다. 복수의 신차에 대한 비교 서비스는, 다수의 신차들의 견적을 비교할 수 있는 서비스로서, 사용자로부터 자동차 제조사, 모델, 라인, 세부 모델, 색상, 옵션, 탁송료 등의 조건을 입력 받고, 입력된 조건을 기초로 복수의 서 로 다른 신차들 각각에 대해 견적을 산출하여 비교 가능하도록 제공하는 서비스일 수 있다. 신차 제원 안내 서비스는, 신차의 세부적인 제원 및 사양을 안내하는 서비스일 수 있으며, 신차 카탈로그 서비 스는 신차의 제원과 사양, 가격 등이 표시된 카탈로그를 사용자 단말 상에 디스플레이 하거나 이 밖에 임 의의 방법(예를 들어, 사용자 단말에 다운로드 되거나 사용자의 이메일 계정으로 전송되는 등)으로 사용자 에게 제공하기 위한 서비스일 수 있다. 중고차 검색 서비스는, 사용자 단말을 통해 사용자로부터 구매하려는 중고차의 자동차 제조사, 모델, 라인, 세부 모델, 색상, 옵션, 연식, 주행 거리, 가격 등의 조건을 입력 받고, 입력 받은 조건을 기초로 거래 가능한 중고차 검색 결과를 제공하기 위한 서비스일 수 있다. 차량 구매 요청 서비스는, 신차 구매 혹은 중고차 구매를 위해 관련 딜러에게 상담 요청이나 구매 요청을 전송 하기 위한 서비스일 수 있다. 이를 위해 차량 구매 요청 서비스는, 사용자가 구매하려는 자동차의 제조사나 차 종, 사용자의 지역, 또는 딜러 평가 점수 등을 종합적으로 고려하여, 사용자가 적합한 딜러에게 요청을 전송할 수 있도록 상세 정보를 제공할 수 있다. 차량 구매에 관한 금융 안내 서비스는, 신차의 할부 구매, 렌트 구매, 리스 구매 등 구매 방법에 따른 월 납입 금, 상환 스케쥴 등을 계산하거나, 또는 제조사에서 제공되는 할인 조건(예를 들어, 할인 가능한 신용 카드, 포 인트 사용 가능한 신용 카드, 할인 혜택, 전시차 구매 시 혜택 여부 등)을 차종 별로 안내하기 위한 서비스일 수 있다. 또 다른 예로, 사용자 정보가 현재 사용자가 소유하고 있는 차량이 있으며, 유동 자산이 최근 큰 폭으로 감소하 였거나 주택 구매 등 차량 이외의 분야에 지출이 큰 폭으로 증가하였음을 나타내는 경우, 사용자가 가장 관심있 어 할 만한 자동차 서비스는 판매 서비스일 수 있으며, 이에 따라 관심 서비스 결정부는 사용자 정보를 기 초로 판매 서비스를 관심 서비스로 결정할 수 있다. 판매 서비스는, 사용자가 기 소유하고 있는 자동차를 판매하는 과정에서 필요로 하는 서비스로서, 중고 시세 예 측 서비스, 및 차량 판매 요청 서비스 중 적어도 일부를 포함할 수 있다. 중고 시세 예측 서비스는, 사용자가 기 소유하고 있는 자동차의 중고 시세정보 제공을 위한 서비스로서, 사용자 의 자동차에 관한 정보를 기초로 소매 시세정보나 낙찰 시세 정보를 사용자에게 제공할 수 있고, 또는 본 개시 에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 외부의 중고차 업체 서버(미도시)와 통신하여 해당 업체의 웹 화면을 사용자 단말 상에 디스플레이 되도록 할 수 있다. 차량 판매 요청 서비스는, 사용자가 기 소유하고 있는 자동차를 판매하기 위해 관련 딜러에게 상담 요청이나 판 매 요청을 전송하기 위한 서비스일 수 있다. 이를 위해 차량 판매 요청 서비스는, 사용자가 판매하려는 자동차 의 제조사나 차종, 시세, 사용자의 지역, 또는 딜러 평가 점수 등을 종합적으로 고려하여, 사용자가 적합한 딜 러에게 요청을 전송할 수 있도록 상세 정보를 제공할 수 있다. 또 다른 예로, 사용자 정보가 현재 사용자가 소유하고 있는 차량이 있으며, 사용자의 유동 자산에 큰 변화가 없 고, 한편 사용자의 운전 안전점수가 낮은 편이거나 주유 주기가 짧은 편임을 나타내는 경우, 사용자가 가장 관 심있어 할 만한 자동차 서비스는 관리 서비스나 튜닝 서비스 등의 부가 서비스일 수 있으며, 이에 따라 관심 서 비스 결정부는 사용자 정보를 기초로 부가 서비스를 관심 서비스로 결정할 수 있다. 부가 서비스는, 사용자가 기 소유하고 있는 자동차를 관리 및 활용하는 과정에서 필요로 하는 서비스로서, 자동 차에 관한 관리 서비스, 튜닝 서비스, 액세서리 서비스, 및 업체 추천 서비스 중 적어도 일부를 포함할 수있다. 관리 서비스는, 사용자가 기 소유하고 있는 자동차의 관리 이력, 연식, 주행 거리, 경고등 점등 여부 등을 고려 하여, 사용자의 자동차에 필요한 관리(정비, 세차, 주유, 소모품 교체 등)의 주기나 관리에 필요한 비용에 관한 정보를 제공하기 위한 서비스일 수 있다. 튜닝 서비스는, 사용자가 기 소유하고 있는 자동차에 관한 튜닝 가능 영역(법적으로 튜닝할 수 있는 영역으로서 앞범퍼, 그릴, 사이드미러, 배기, 뒷범퍼, 보닛, 휠, 스포일러 등)을 안내하고, 튜닝 비용, 등록 대행 비용 및 차량 구조 변경 검사 대행 비용 등 튜닝 비용에 관한 종합적인 정보를 제공하기 위한 서비스일 수 있다. 액세서리 서비스는, 사용자가 기 소유하고 있는 자동차의 액세서리 쇼핑을 위한 온라인 쇼핑몰 서비스를 포함할 수 있다. 예컨대 액세서리 서비스 메뉴가 선택되면, 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 외부의 쇼핑몰 서버(미도시)와 통신하여 해당 쇼핑몰의 웹 화면을 사용자 단말 상에 디스플레 이 되도록 할 수 있다. 업체 추천 서비스는, 사용자가 기 소유하고 있는 자동차를 사용하기 위해, 혹은 사용하는 과정에서 필요한 업체 들에 관한 추천 정보를 제공하는 서비스일 수 있으며, 예컨대 목적지 인근의 추천 주유소나 주차장, 또는 드라 이브 스루(drive through) 매장 정보 등을 제공하기 위한 서비스일 수 있다. 관심 서비스를 결정하는 구체적인 방법에 관하여, 일 실시예에서 관심 서비스 결정부는, 사용자 정보를 구 성하는 복수의 항목들 중 적어도 하나와 복수의 자동차 서비스들 중 적어도 하나를 매칭하여 기 구축된 룰 기반 알고리즘을 기초로, 사용자 정보 수집부에서 수집된 사용자 정보와 대응되는 자동차 서비스를 관심 서비스 로 자동 결정할 수 있다. 다른 일 실시예에서 관심 서비스 결정부는, 사용자 정보를 구성하는 복수의 항목들을 튜플 형식으로 구성 하여 사용자에 관한 사용자 벡터를 생성할 수 있으며, 사용자 벡터를 기 학습된 인공지능 기반 분류 모델에 입 력하여, 복수의 자동차 서비스들 중 사용자 벡터와 대응되는 자동차 서비스를 관심 서비스로 자동 결정할 수 있 다. 이 경우 기 학습된 인공지능 기반 분류 모델은, 사용자 벡터를 기초로 클러스터링을 수행하기 위한 SVM(Support vector machine) 알고리즘 기반의 모델이거나, 또는 이 밖에 GAN(enerative Adversarial Network) 등을 통해 학습된 분류기 모델일 수 있다. 다만 이에 한정되는 것은 아니다. 다른 일 실시예에서 관심 서비스 결정부는, 사용자 단말을 통해 사용자로부터 복수의 자동차 서비스 들 중 적어도 하나의 자동차 서비스에 대한 선택을 입력받을 수 있고, 선택이 입력된 적어도 하나의 자동차 서 비스를 관심 서비스로 결정할 수 있다. 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치의 사용자 인터페이스 결정부는, 관심 서비스 결정부에서 결정된 관심 서비스에 관한 사용자 인터페이스를 사용자 단말 상에 디폴트 뷰로 디스플레이 할 수 있다. 즉, 관심 서비스에 관한 사용자 인터페이스가, 사용자 단말 상에서 본 개시에 따 른 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공하기 위한 애플리케이션을 실행하는 경우에 첫 화면으 로 디스플레이 될 수 있다. 구체적으로 사용자 인터페이스 결정부는, 관심 서비스에 관한 사용자 인터페이스를 서비스 변경 엔티티와 함께 사용자 단말 상에 디폴트 뷰로 디스플레이 할 수 있다. 여기서 서비스 변경 엔티티는, 예컨대 햄버거 버튼 이나 드롭다운 메뉴 등의 형태를 가지며, 사용자 단말 상에 다른 자동차 서비스에 관한 사용자 인터페이스 가 디스플레이 되도록 하기 위해 사용되는 그래픽 아이콘 요소일 수 있다. 이에 따라 사용자 인터페이스 결정부는, 서비스 변경 엔티티에 대한 사용자의 선택을 수신하는 경우, 복수 의 자동차 서비스들 중 사용자의 선택에 대응되는 자동차 서비스에 관한 사용자 인터페이스를, 기 디스플레이 되던 관심 서비스에 관한 사용자 인터페이스를 대체하여 사용자 단말 상에 디스플레이 할 수 있다. 도 2는 본 개시의 몇몇 실시예에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 방법에 대한 순서도이다. 도 2를 참고하면, 먼저 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 적어도 하나의 서버로부터 사용자의 사용자 정보를 획득할 수 있다(S110). 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 적어도 하나의 서버로부터 사용자 의 사용자 정보를 획득할 수 있다. 구체적으로 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 데이터스크래핑(data scraping) 기법을 사용하여, 사용자 정보를 수집 가능한 적어도 하나의 서버로부터 사용자 정보를 획득할 수 있다. 데이터 스크래핑은, 사용자의 웹 브라우징 없이, 분산된 데이터들 중에서 서비스 제공에 필요한 데이터를 추출 해 사용자에게 제공하는 기술을 의미할 수 있다. 본 개시에 따른 데이터 스크래핑은 웹 스크래핑일 수 있다. 웹 스크래핑은 데이터 스크래핑의 한 방식으로, 디스플레이 장치를 통해 화면에 보여지는 데이터, 즉 일반적으로 웹사이트 등에 표시되는 정보를 수집하여 제공하는 것일 수 있다. 여기서 사용자 정보는 복수의 항목들로 구성될 수 있으며, 복수의 항목들은 예컨대 사용자의 성별, 나이, 직업, 자산, 운전 성향, 결제 이력, 및 보험 이력 중 적어도 일부를 포함할 수 있다. 예컨대 사용자의 운전 성향 항목의 경우, 사용자 단말에 설치되어 사용자가 소유한 차량의 정보를 실시간 으로 동기화 하는 애플리케이션에 의해 산출된 사용자의 운전 안전점수, 금융 관련 기관으로부터 스크래핑 된 사용자의 주유소 결제 주기나 결제 금액, 혹은 하이패스 결제 주기나 결제 금액, 또는 보험 관련 기관으로부터 스크래핑 된 사용자의 보험 처리 이력 등을 포함할 수 있다. 또는 사용자의 자금이나 결제 이력의 경우, 금융 관련 기관으로부터 스크래핑 될 수 있으며, 사용자의 유동 자 금 규모, 사용자의 자동차 구매 대금의 출금 또는 할부 결제 이력, 사용자의 자동차 판매 대금의 입금 또는 이 체 이력 등을 포함할 수 있다. 또는 사용자의 보험 이력의 경우, 하나 이상의 보험사, 한국 신용 정보원, 생명보험협회, 또는 손해보험협회 등 의 분산된 웹 사이트로부터 수집될 수 있으며, 사용자의 보험 계약 정보, 보험 처리 이력 등을 포함할 수 있다. 다음으로 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 사용자 정보를 기초로, 구매 서비스, 판매 서비스, 및 부가 서비스를 포함하는 복수의 자동차 서비스들 중 적어도 하나를 관심 서비스로 결 정할 수 있다(S120). 즉, 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 수집된 사용자 정보를 기초로, 현재 사용자의 상황 에서 사용자가 가장 관심있어 할 만한 자동차 서비스를 관심 서비스로 결정할 수 있다. 예를 들어, 사용자 정보가 현재 사용자가 소유하고 있는 차량이 없으며, 사용자의 직업의 평균 소득이나 유동 자산이 동 나이대의 평균 이상이고 결제 이력 중 택시 이용 비율이 높음을 나타내는 경우, 사용자가 가장 관심 있어 할 만한 자동차 서비스는 구매 서비스일 수 있으며, 이에 따라 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 사용자 정보를 기초로 구매 서비스를 관심 서비스로 결정할 수 있다. 구매 서비스는, 사용자가 자동차를 구매하는 과정에서 필요로 하는 서비스로서, 신차 견적 서비스, 복수의 신차 에 대한 비교 서비스, 신차 제원 안내 서비스, 신차 카탈로그 서비스, 중고차 검색 서비스, 차량 구매 요청 서 비스, 및 차량 구매에 관한 금융 안내 서비스 중 적어도 일부를 포함할 수 있다. 또 다른 예로, 사용자 정보가 현재 사용자가 소유하고 있는 차량이 있으며, 유동 자산이 최근 큰 폭으로 감소하 였거나 주택 구매 등 차량 이외의 분야에 지출이 큰 폭으로 증가하였음을 나타내는 경우, 사용자가 가장 관심있 어 할 만한 자동차 서비스는 판매 서비스일 수 있으며, 이에 따라 사용자 맞춤형 자동차 서비스의 통합 제공 장 치는 사용자 정보를 기초로 판매 서비스를 관심 서비스로 결정할 수 있다. 판매 서비스는, 사용자가 기 소유하고 있는 자동차를 판매하는 과정에서 필요로 하는 서비스로서, 중고 시세 예 측 서비스, 및 차량 판매 요청 서비스 중 적어도 일부를 포함할 수 있다. 또 다른 예로, 사용자 정보가 현재 사용자가 소유하고 있는 차량이 있으며, 사용자의 유동 자산에 큰 변화가 없 고, 한편 사용자의 운전 안전점수가 낮은 편이거나 주유 주기가 짧은 편임을 나타내는 경우, 사용자가 가장 관 심있어 할 만한 자동차 서비스는 관리 서비스나 튜닝 서비스 등의 부가 서비스일 수 있으며, 이에 따라 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 사용자 정보를 기초로 부가 서비스를 관심 서비스로 결정할 수 있다. 부가 서비스는, 사용자가 기 소유하고 있는 자동차를 관리 및 활용하는 과정에서 필요로 하는 서비스로서, 자동 차에 관한 관리 서비스, 튜닝 서비스, 액세서리 서비스, 및 업체 추천 서비스 중 적어도 일부를 포함할 수 있다. 관심 서비스를 결정하는 구체적인 방법에 관하여, 일 실시예에서 사용자 맞춤형 자동차 서비스의 통합 제공 장 치는, 사용자 정보를 구성하는 복수의 항목들 중 적어도 하나와 복수의 자동차 서비스들 중 적어도 하나를매칭하여 기 구축된 룰 기반 알고리즘을 기초로, 수집된 사용자 정보와 대응되는 자동차 서비스를 관심 서비스 로 자동 결정할 수 있다. 다른 일 실시예에서 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 사용자 정보를 구성하는 복수의 항 목들을 튜플 형식으로 구성하여 사용자에 관한 사용자 벡터를 생성할 수 있으며, 사용자 벡터를 기 학습된 인공 지능 기반 분류 모델에 입력하여, 복수의 자동차 서비스들 중 사용자 벡터와 대응되는 자동차 서비스를 관심 서 비스로 자동 결정할 수 있다. 이 경우 기 학습된 인공지능 기반 분류 모델은, 사용자 벡터를 기초로 클러스터링을 수행하기 위한 SVM(Support vector machine) 알고리즘 기반의 모델이거나, 또는 이 밖에 GAN(enerative Adversarial Network) 등을 통해 학습된 분류기 모델일 수 있다. 다만 이에 한정되는 것은 아니다. 다른 일 실시예에서 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 사용자 단말을 통해 사용자로 부터 복수의 자동차 서비스들 중 적어도 하나의 자동차 서비스에 대한 선택을 입력받을 수 있고, 선택이 입력된 적어도 하나의 자동차 서비스를 관심 서비스로 결정할 수 있다. 다음으로 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치는 관심 서비스에 관한 사용자 인 터페이스를 사용자 단말 상에 디폴트 뷰로 디스플레이 할 수 있다(S130). 즉, 관심 서비스에 관한 사용자 인터페이스가, 사용자 단말 상에서 본 개시에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공하기 위한 애플리케이션을 실행하는 경우에 첫 화면으로 디스플레이 될 수 있다. 구체적으로 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 관심 서비스에 관한 사용자 인터페이스를 서비스 변경 엔티티와 함께 사용자 단말 상에 디폴트 뷰로 디스플레이 할 수 있다. 여기서 서비스 변경 엔티티 는, 예컨대 햄버거 버튼이나 드롭다운 메뉴 등의 형태를 가지며, 사용자 단말 상에 다른 자동차 서비스에 관한 사용자 인터페이스가 디스플레이 되도록 하기 위해 사용되는 그래픽 아이콘 요소일 수 있다. 이에 따라 사용자 맞춤형 자동차 서비스의 통합 제공 장치는, 서비스 변경 엔티티에 대한 사용자의 선택을 수신하는 경우, 복수의 자동차 서비스들 중 사용자의 선택에 대응되는 자동차 서비스에 관한 사용자 인터페이스 를, 기 디스플레이 되던 관심 서비스에 관한 사용자 인터페이스를 대체하여 사용자 단말 상에 디스플레이 할 수 있다. 도 3은 본 개시의 몇몇 실시예에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공하는 컴퓨팅 장치 를 나타낸 블록도이다. 여기서 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공하는 컴퓨팅 장치는, 전술한 사용자 맞춤형 자동차 서비스의 통합 제공 장치이거나, 또는 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공하기 위해 사용자 맞춤형 자동차 서비스의 통합 제공 장치와 통신적으로 연결되는 적어도 하나의 서버 및/ 또는 사용자 단말일 수 있다. 다만 이에 한정되는 것은 아니다. 도 3을 참조하면, 본 개시에 따른 컴퓨팅 장치는 하나 이상의 프로세서, 프로세서에 의하여 수행되 는 프로그램을 로드하는 메모리, 프로그램 및 각종 데이터를 저장하는 스토리지, 및 통신 인터페이스 를 포함할 수 있다. 다만, 상술한 구성 요소들은 본 개시에 따른 컴퓨팅 장치를 구현하는데 있어서 필 수적인 것은 아니어서, 컴퓨팅 장치는 위에서 열거된 구성요소들 보다 많거나, 또는 적은 구성요소들을 가 질 수 있다. 예컨대 컴퓨팅 장치는 출력부 및/또는 입력부(미도시)를 더 포함하거나, 또는 스토리지가 생략될 수도 있다. 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 개시의 다양한 실시예에 따른 방법/동작을 수행 하게끔 하는 명령어들(instructions)을 포함할 수 있다. 즉, 프로세서는 명령어들을 실행함으로써, 본 개시 의 다양한 실시예에 따른 방법/동작들을 수행할 수 있다. 프로그램은 기능을 기준으로 묶인 일련의 컴퓨터 판독 가능 명령어들로 구성되고, 프로세서에 의해 실행되는 것을 가리킨다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 또 한, 프로세서는 본 개시의 다양한 실시예들에 따른 방법/동작을 실행하기 위한 적어도 하나의 애플리케이션또는 프로그램에 대한 연산을 수행할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 다양한 실시예들에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 하나 이상의 프로그램을 로드할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것이나, 본 개시의 기술적 범위는 이에 한정되지 않는다. 스토리지는 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 통신 인터페이스는 유/무선 통신 모 듈일 수 있다. 이상에서 설명한 본 개시의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 개시의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 개시의 실시예에 대하여 상세하게 설명하였지만 본 개시의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 개시의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 개시의 권리범위에 속하는 것이다."}
{"patent_id": "10-2022-0077017", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 몇몇 실시예에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 장치를 나타낸 블록도이다. 도 2는 본 발명의 몇몇 실시예에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 방법에 대한 순서도이다. 도 3은 본 개시의 몇몇 실시예에 따른 사용자 맞춤형 자동차 서비스의 통합 제공 방법을 제공하는 컴퓨팅 장치 를 나타낸 블록도이다."}
