{"patent_id": "10-2022-0066727", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0166585", "출원번호": "10-2022-0066727", "발명의 명칭": "펫의 체온 모니터링용 웨어러블 센서 장치", "출원인": "주식회사 맥스케이코리아", "발명자": "구 기번 맥스"}}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "펫의 체온을 모니터링하기 위한 웨어러블 센서 장치의 하부를 구성하는 베이스부;상기 베이스부와 결합되어 펫의 체온을 모니터링하기 위한 웨어러블 센서 장치를 보호하는 커버부; 및상기 펫의 체온을 측정하기 위한 온도센서를 장착하는 온도센서 포켓부;를 포함하며,상기 온도센서 포켓부는, 상기 온도센서가 펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록하부로 돌출되도록 구성되는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 온도센서 포켓부는,상기 웨어러블 센서 장치가 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서 열 전도성을 향상시켜 체온측정을 정확하게 수행할 수 있도록 열전도성 재질로 형성되는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 온도센서 포켓부는,상기 베이스부에 결합되어 외측으로 노출되며, 상기 웨어러블 센서 장치가 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서 열 전도성을 향상시켜 체온 측정을 정확하게 수행할 수 있도록 엠보싱부;를 더 포함하는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 베이스부는,상기 온도센서 포켓부를 펫의 피부가 있는 외부로 통과시켜 결합하기 위한 제1 결합홀;상기 온도센서 포켓부를 고정하기 위한 적어도 하나 이상의 제1 돌출 핀;상기 온도센서 포켓부의 위치를 잡아주는 가이드;상기 커버부를 결합시켜 고정시키기 위한 적어도 하나 이상의 나사 결합홀; 및상기 웨어러블 센서 장치에 벨트를 체결하기 위한 적어도 하나 이상의 제2 돌출 핀;을 포함하는 것을 특징으로하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 온도센서 포켓부는,상기 베이스부의 바닥면과 맞닿는 상판;상기 상판에 형성되며, 상기 베이스부의 제1 돌출 핀에 끼워서 접속되는 적어도 하나 이상의 제2 결합홀;상기 온도센서가 삽입되도록 상기 엠보싱부의 내부로 파인 온도센서 삽입구; 및공개특허 10-2023-0166585-3-상기 엠보싱부와 상기 온도센서의 완충을 위하여 상기 상판의 내부로 파인 완충부;를 포함하는 것을 특징으로하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 완충부는,상기 상판보다 낮게 파여진 형태로 형성되어 상기 온도센서가 결합된 FPCB의 단부가 상기 상판의 외측으로 돌출되지 않도록 하며, 원형의 골 테두리를 형성하여 상기 엠보싱부가 탄력과 강도를 유지하도록 구성되는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 펫의 체온 모니터링용 웨어러블 센서 장치는,충전용 배터리와 상기 충전용 배터리를 충전하는 배터리 충전모듈; 및상기 온도센서를 통해 측정한 펫의 체온을 사용자 단말이나 정보수집 서버로 전송하는 통신 및 프로세서 모듈;을 더 포함하며,상기 커버부는,상기 배터리 충전모듈과 상기 통신 및 프로세서 모듈이 설치되도록 내부에 공간이 형성되어 있는 캡;상기 캡의 하부에 상기 베이스부의 나사 결합홀의 대응되는 위치에 형성되어 상기 베이스부와 나사 결합되는 적어도 하나 이상의 나사 결합홈;상기 배터리 충전모듈과 상기 통신 및 프로세서 모듈을 상기 캡의 내부에 고정하기 위한 적어도 하나 이상의 고정홈;상기 캡의 일측에 형성되고, 배터리 충전을 위한 충전 케이블이 접속되는 충전포트;상기 충전포트의 외측에 구비되고, 배터리 충전시 오픈되는 덮개;상기 캡의 일측에 형성되어, 상기 웨어러블 센서 장치의 전원을 온 또는 오프하기 위한 전원 스위치; 및상기 웨어러블 센서 장치의 동작상태를 표시하기 위해 내부에 구비된 LED에서 방출되는 빛을 외부로 통과시키기위한 홀;을 포함하는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 펫의 체온 모니터링용 웨어러블 센서 장치는,상기 온도센서와 상기 통신 및 프로세서 모듈 간에는 FPCB로 연결되며,상기 FPCB는 전원라인과 신호라인이 형성되며,상기 통신 및 프로세서 모듈에는 근거리 무선통신을 위한 안테나와 무선 통신용 송수신부가 구비되는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서,상기 펫의 체온 모니터링용 웨어러블 센서 장치는,주변온도를 측정하는 적어도 하나 이상의 환경센서;를 더 포함하며,상기 온도센서로 측정한 펫의 체온과 상기 적어도 하나 이상의 환경센서로 측정한 주변온도를 독립변수로 하여공개특허 10-2023-0166585-4-상기 펫의 체온을 보정하며,상기 보정한 펫의 체온은, 사용자 단말로 직접 전송되거나, 정보수집 서버를 경유하여 상기 사용자 단말로 전송되거나, 상기 사용자 단말의 중계를 통해서 상기 정보수집 서버로 전송되고 상기 사용자 단말은 상기 정보수집서버로부터 수신함으로써, 사용자가 펫의 체온을 모니터링할 수 있도록 하는 것을 특징으로 하는 펫의 체온 모니터링용 웨어러블 센서 장치."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록 하부로 돌출되도록 구성되는 온도센서 포켓에 설치된 온도센서를 통해서 펫의 체온을 측정하는 단계;주변온도를 측정하는 적어도 하나 이상의 환경센서를 통해서 주변온도를 측정하는 단계; 및상기 온도센서로 측정한 펫의 체온과 상기 적어도 하나 이상의 환경센서로 측정한 대기 온도를 독립변수로 추가하여 상기 펫의 체온을 보정하는 체온 보정 단계;를 포함하며,상기 보정한 펫의 체온은, 사용자 단말로 직접 전송되거나, 정보수집 서버를 경유하여 상기 사용자 단말로 전송되거나, 상기 사용자 단말의 중계를 통해서 상기 정보수집 서버로 전송되고 상기 사용자 단말은 상기 정보수집서버로부터 수신함으로써, 사용자가 펫의 체온을 모니터링할 수 있도록 하는 것을 특징으로 하는 펫의 체온 모니터링 방법."}
{"patent_id": "10-2022-0066727", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 체온 보정 단계는,체온 측정치 및 주변 온도를 이용하여 중심온도 및 차온도를 산출한 다음 상기 체온 측정치에 상기 차온도와 중심온도의 차분을 더하여 보정하거나,상기 체온 측정치에 주변온도, 대기온도 또는 이들의 조합을 더 부가하여 온도보정 테이블을 도출한 다음 최소자승법을 적용하여 다중회귀방정식의 계수를 산출하여 체온을 추정하거나,상기 체온 측정치에 주변온도, 대기온도 또는 이들의 조합을 이용하여 인공지능 학습모델을 생성하고 상기 학습모델에 상기 체온 측정치에 주변온도, 대기온도 또는 이들의 조합을 입력 데이터로 적용하여 상기 체온을 추정하는 것을 포함하는 것을 특징으로 하는 펫의 체온 모니터링 방법."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 펫의 체온 모니터링용 웨어러블 센서 장치에 관한 것으로, 웨어러블 센서 장치를 펫의 신체에 착용하 여 체온을 측정하고, 상기 측정한 체온을 원격에서 수신하여 모니터링함에 있어서, 상기 웨어러블 센서 장치가 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서 열 전도성을 향상시켜 체온 측정을 정확하게 수행할 수 있도록 하는 펫의 체온 모니터링용 웨어러블 센서 장치에 관한 것이다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 펫의 체온 모니터링용 웨어러블 센서 장치에 관한 것으로, 더욱 상세하게는 웨어러블 센서 장치를 펫 의 신체에 착용하여 체온을 측정하고, 상기 측정한 체온을 원격에서 수신하여 모니터링함에 있어서, 상기 웨어 러블 센서 장치가 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서 열 전도성을 향상시켜 체온 측정을 정확하게 수행할 수 있도록 하는 펫의 체온 모니터링용 웨어러블 센서 장치에 관한 것이다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 생활수준이 향상되고, 핵가족화나 독신가구의 증가에 따른 정서적 요구의 증대 등의 다양한 이유로 펫(즉 애완동물)에 대한 수요가 크게 늘어가고 있으며, 그 종류도 전통적인 개나 고양이뿐만 아니라, 기타 다른 포유류는 물론 파충류나 양서류 등 사람들의 취향에 따라 매우 다양해지고 있다. 이러한 펫을 관리하는 방법에는 다양한 방법들이 존재하는데, 현재 제공중인 관리 방법으로는 주인이 외출하고 홀로 남겨진 펫을 위하여 소정 시간이 경과되면 먹이를 자동으로 배출하거나, 해당 펫의 주인 영상을 제공하는 것과 같은 단순 관리 기능에 그치고 있는 상황이다. 하지만 단순히 먹이를 제공하는 것이나 반복되는 영상에 대해 초기에는 해당 펫이 반응을 보일 수 있으나, 학습 이 되고 난 후에는 별다른 반응을 보이지 않아 펫의 관리를 위한 효과를 기대할 수 없었다. 또한 기존의 관리 방법으로는 펫의 건강 상태(예; 체온 등)를 정확하게 확인할 수 없었으며, 이에 따라 펫의 건 강 상태를 실시간으로 확인하는 모니터링이 필요한 실정이다. 즉 주인이 펫의 건강 상태를 바로 옆이나 원격지에서 스마트폰 등을 통해 수시로 확인하고, 상기 확인한 결과 이상 상태가 발견되는 즉시 적절한 대응 조치를 취할 수 있도록 하는 것이 필요한 상황이다. 따라서 본 발명에서는 펫의 피부에 접촉하여도 트러블이 생기지 않고, 열 전도성을 향상시켜 체온 측정을 정확 하게 수행할 수 있는 웨어러블 센서 장치를 통해 펫의 체온을 측정하고, 상기 측정한 체온정보를 원격에서 모니 터링할 수 있는 방안을 제시하고자 한다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다음으로 본 발명의 기술분야에 존재하는 선행발명에 대하여 간단하게 설명하고, 이어서 본 발명이 상기 선행발 명에 비해서 차별적으로 이루고자 하는 기술적 사항에 대해서 기술하고자 한다. 먼저 한국등록특허 제1775932호(2017.09.19.)는 반려동물 케어를 위한 멀티모달 시스템에 관한 것으로, 반려동 물의 심리 상황과 건강 상태 분석을 위한 멀티모달센서 및 홍채인식/생채 인식 센서를 통해 수집된 빅 데이터를 분석하고, 반려동물의 행동과 신호특성의 상관관계를 도출하여 반려동물의 신체적 상황 및 감성적 상황을 파악 하여 관리하기 위한 시스템 및 방법에 관한 선행발명이다. 즉, 상기 한국등록특허 제1775932호는 반려동물의 심박, 체온, 움직임, 생채인식 및 홍채인식 정보, 위치정보 등의 정보를 실시간으로 수집하고, 이를 빅 데이터 분석하여 반려동물과 사람과의 더 깊고 의미 있는 교감이 가 능하도록 하는 시스템 및 방법에 대해 기재하고 있다. 하지만, 본 발명은 펫의 피부에 접촉하여도 트러블이 생기지 않고, 열 전도성을 향상시켜 체온 측정을 정확하게 수행할 수 있는 웨어러블 센서 장치를 제공하고, 상기 웨어러블 센서 장치를 통해 펫의 체온을 측정하고, 상기 측정한 체온정보를 원격에서 모니터링할 수 있도록 하는 것이므로, 상기 한국등록특허 제1775932호와 본 발명은 현저한 구성상 차이점이 있다. 또한 한국공개특허 제2006-0106804호(2006.10.12.)는 동물용 목걸이를 이용한 건강 관리 방법 및 그 시스템에 관한 것으로, 동물의 건강 정보 및 위치 정보를 검출하여 상기 위치 정보가 사용자에 의해 설정된 지정 범위를 벗어나는 경우에 이동 단말기로 전송하며, 상기 건강 정보는 선택적으로 상기 이동 단말기로 전송하기 위한 동 물용 목걸이와; 상기 동물용 목걸이로부터 상기 위치 정보 및 건강 정보를 수신하는 경우 화면에 디스플레이 하 며, 상기 건강 정보, 및 상기 건강 정보를 표준 건강 정보와 비교한 비교 결과를 수신하여, 소정의 메모리에 저 장하기 위한 이동 단말기를 포함한 동물용 목걸이를 이용한 건강 관리 방법 및 그 시스템에 관한 선행발명이다. 즉, 상기 한국공개특허 제2006-0106804호는 동물의 건강 상태를 동물의 관리자가 알 수 있어, 응급 상황을 미연 에 방지하고 응답 상황에 대한 대처를 신속하게 하며, GPS 위성을 이용하여 통제가 불가능한 동물의 위치를 지 속적으로 감시할 수 있어 동물을 잃어버려 찾는 수고를 덜 수 있는 방법 및 그 시스템을 기재하고 있다. 반면에 본 발명은, 피부에 접촉하여도 별다른 트러블이 발생하지 않고, 열 전도성 향상을 통해 체온 측정을 정 확하게 수행하는 웨어러블 센서 장치를 펫의 신체 부위에 장착하고, 상기 웨어러블 센서 장치를 통해 측정한 펫 의 체온을 원격에서 실시간으로 모니터링하는 것이므로, 상기 한국공개특허 제2006-0106804호와 본 발명은 기술 적 구성의 차이점이 분명하다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 창작된 것으로서, 웨어러블 센서 장치를 펫의 신체에 착용하여 체온을 측정하고, 이를 원격에서 수신하여 모니터링할 수 있도록 하는 펫의 체온 모니터링용 웨어러블 센서 장 치를 제공하는 것을 목적으로 한다. 또한 본 발명은 웨어러블 센서 장치를 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서, 열 전도성을 향 상시켜 펫의 체온 측정을 정확하게 수행할 수 있도록 하는 펫의 체온 모니터링용 웨어러블 센서 장치를 제공하 는 것을 다른 목적으로 한다. 또한 본 발명은 다중회귀 방정식에 따라 온도센서로 펫의 체온을 측정한 결과를 보정하여 클라우드상의 서버로 전송하고, 상기 클라우드상의 서버에서 펫의 주인인 사용자의 휴대단말에 상기 측정한 체온정보를 제공하여 펫 의 체온을 모니터링할 수 있도록 하는 펫의 체온 모니터링용 웨어러블 센서 장치를 제공하는 것을 또 다른 목적 으로 한다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치는, 펫의 체온을 모니터링하기 위한 웨어 러블 센서 장치의 하부를 구성하는 베이스부; 상기 베이스부와 결합되어 펫의 체온을 모니터링하기 위한 웨어러 블 센서 장치를 보호하는 커버부; 및 상기 펫의 체온을 측정하기 위한 온도센서를 장착하는 온도센서 포켓부;를 포함하며, 상기 온도센서 포켓부는, 상기 온도센서가 펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록 하부로 돌출되도록 구성되는 것을 특징으로 한다. 또한 상기 온도센서 포켓부는, 상기 웨어러블 센서 장치가 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하 면서 열 전도성을 향상시켜 체온 측정을 정확하게 수행할 수 있도록 열전도성 재질로 형성되는 것을 특징으로 한다. 또한 상기 온도센서 포켓부는, 상기 베이스부에 결합되어 외측으로 노출되며, 상기 웨어러블 센서 장치가 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서 열 전도성을 향상시켜 체온 측정을 정확하게 수행할 수 있도 록 엠보싱부;를 더 포함하는 것을 특징으로 한다. 또한 상기 베이스부는, 상기 온도센서 포켓부를 펫의 피부가 있는 외부로 통과시켜 결합하기 위한 제1 결합홀; 상기 온도센서 포켓부를 고정하기 위한 적어도 하나 이상의 제1 돌출 핀; 상기 온도센서 포켓부의 위치를 잡아 주는 가이드; 상기 커버부를 결합시켜 고정시키기 위한 적어도 하나 이상의 나사 결합홀; 및 상기 웨어러블 센 서 장치에 벨트를 체결하기 위한 적어도 하나 이상의 제2 돌출 핀;을 포함하는 것을 특징으로 한다. 또한 상기 온도센서 포켓부는, 상기 베이스부의 바닥면과 맞닿는 상판; 상기 상판에 형성되며, 상기 베이스부의 제1 돌출 핀에 끼워서 접속되는 적어도 하나 이상의 제2 결합홀; 상기 온도센서가 삽입되도록 상기 엠보싱부의 내부로 파인 온도센서 삽입구; 및 상기 엠보싱부와 상기 온도센서의 완충을 위하여 상기 상판의 내부로 파인 완 충부;를 포함하는 것을 특징으로 한다. 또한 상기 완충부는, 상기 상판보다 낮게 파여진 형태로 형성되어 상기 온도센서가 결합된 FPCB의 단부가 상기 상판의 외측으로 돌출되지 않도록 하며, 원형의 골 테두리를 형성하여 상기 엠보싱부가 탄력과 강도를 유지하도 록 구성되는 것을 특징으로 한다. 또한 상기 펫의 체온 모니터링용 웨어러블 센서 장치는, 충전용 배터리와 상기 충전용 배터리를 충전하는 배터 리 충전모듈; 및 상기 온도센서를 통해 측정한 펫의 체온을 사용자 단말이나 정보수집 서버로 전송하는 통신 및 프로세서 모듈;을 더 포함하며, 상기 커버부는, 상기 배터리 충전모듈과 상기 통신 및 프로세서 모듈이 설치되 도록 내부에 공간이 형성되어 있는 캡; 상기 캡의 하부에 상기 베이스부의 나사 결합홀의 대응되는 위치에 형성 되어 상기 베이스부와 나사 결합되는 적어도 하나 이상의 나사 결합홈; 상기 배터리 충전모듈과 상기 통신 및 프로세서 모듈을 상기 캡의 내부에 고정하기 위한 적어도 하나 이상의 고정홈; 상기 캡의 일측에 형성되고, 배 터리 충전을 위한 충전 케이블이 접속되는 충전포트; 상기 충전포트의 외측에 구비되고, 배터리 충전시 오픈되 는 덮개; 상기 캡의 일측에 형성되어, 상기 웨어러블 센서 장치의 전원을 온 또는 오프하기 위한 전원 스위치; 및 상기 웨어러블 센서 장치의 동작상태를 표시하기 위해 내부에 구비된 LED에서 방출되는 빛을 외부로 통과시 키기 위한 홀;을 포함하는 것을 특징으로 한다. 또한 상기 펫의 체온 모니터링용 웨어러블 센서 장치는, 상기 온도센서와 상기 통신 및 프로세서 모듈 간에는 FPCB로 연결되며, 상기 FPCB는 전원라인과 신호라인이 형성되며, 상기 통신 및 프로세서 모듈에는 근거리 무선 통신을 위한 안테나와 무선 통신용 송수신부가 구비되는 것을 특징으로 한다. 또한 상기 펫의 체온 모니터링용 웨어러블 센서 장치는, 주변온도를 측정하는 적어도 하나 이상의 환경센서;를 더 포함하며, 상기 온도센서로 측정한 펫의 체온과 상기 적어도 하나 이상의 환경센서로 측정한 주변온도를 독 립변수로 하여 상기 펫의 체온을 보정하며, 상기 보정한 펫의 체온은, 사용자 단말로 직접 전송되거나, 정보수 집 서버를 경유하여 상기 사용자 단말로 전송되거나, 상기 사용자 단말의 중계를 통해서 상기 정보수집 서버로 전송되고 상기 사용자 단말은 상기 정보수집 서버로부터 수신함으로써, 사용자가 펫의 체온을 모니터링할 수 있 도록 하는 것을 특징으로 한다. 아울러 본 발명의 또 다른 일 실시예에 따른 펫의 체온 모니터링 방법은, 펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록 하부로 돌출되도록 구성되는 온도센서 포켓에 설치된 온도센서를 통해서 펫의 체온을 측정하는 단계; 주변온도를 측정하는 적어도 하나 이상의 환경센서를 통해서 주변온도를 측정하는 단계; 및 상기 온도센서로 측정한 펫의 체온과 상기 적어도 하나 이상의 환경센서로 측정한 대기 온도를 독립변수로추가하여 상기 펫의 체온을 보정하는 체온 보정 단계;를 포함하며, 상기 보정한 펫의 체온은, 사용자 단말로 직 접 전송되거나, 정보수집 서버를 경유하여 상기 사용자 단말로 전송되거나, 상기 사용자 단말의 중계를 통해서 상기 정보수집 서버로 전송되고 상기 사용자 단말은 상기 정보수집 서버로부터 수신함으로써, 사용자가 펫의 체 온을 모니터링할 수 있도록 하는 것을 특징으로 한다. 여기서 상기 체온 보정 단계는, 체온 측정치 및 주변 온도를 이용하여 중심온도 및 차온도를 산출한 다음 상기 체온 측정치에 상기 차온도와 중심온도의 차분을 더하여 보정하거나, 상기 체온 측정치에 주변온도, 대기온도 또는 이들의 조합을 더 부가하여 온도보정 테이블을 도출한 다음 최소자승법을 적용하여 다중회귀방정식의 계수 를 산출하여 체온을 추정하거나, 또는 상기 체온 측정치에 주변온도, 대기온도 또는 이들의 조합을 이용하여 인 공지능 학습모델을 생성하고 상기 학습모델에 상기 체온 측정치에 주변온도, 대기온도 또는 이들의 조합을 입력 데이터로 적용하여 상기 체온을 추정하는 것을 포함하는 것을 특징으로 한다. 아울러, 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치 구성 방법은, 펫의 체온을 모니 터링하기 위한 웨어러블 센서 장치의 하부 구조인 베이스부를 구성하는 단계; 상기 펫의 체온을 측정하기 위한 온도센서가 장착되는 온도센서 포켓부를 구성하는 단계; 상기 베이스부와 결합되어 펫의 체온을 모니터링하기 위한 웨어러블 센서 장치를 보호하는 커버부를 구성하는 단계; 배터리, 상기 배터리를 충전하는 배터리 충전모 듈, 및 상기 온도센서를 통해 측정한 펫의 체온을 근거리 무선통신을 통해 사용자의 휴대단말로 전송하고, 상기 온도센서로 펫의 체온을 측정한 결과를 보정하는 통신 및 프로세서 모듈을 포함하는 인쇄회로기판을 구성하는 단계; 및 상기 구성한 커버부의 내부 공간에 상기 인쇄회로기판을 설치하고, 상기 구성한 온도센서 포켓부를 상 기 구성한 베이스부에 결합함과 동시에 상기 베이스부의 양측에 벨트를 연결하고, 상기 커버부를 상기 베이스부 와 결합하여 웨어러블 센서 장치를 완성하는 단계;를 포함하며, 상기 온도센서 포켓부는, 상기 온도센서가 펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록 하부로 돌출되도록 구성되는 것을 특징으로 한 다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같이 본 발명의 펫의 체온 모니터링용 웨어러블 센서 장치에 따르면, 펫의 피부에 접촉하여도 트러 블이 생기지 않도록 하면서, 열 전도성을 향상시킬 수 있는 웨어러블 센서 장치를 통해 펫의 체온을 정확하게 측정할 수 있는 효과가 있다. 또한 본 발명은 사용자가 웨어러블 센서 장치에서 측정한 펫의 체온정보를 자신의 휴대단말로 수신하여 모니터 링할 수 있도록 함으로써, 사용자가 관리하고 있는 펫의 건강상태를 손쉽게 확인할 수 있고, 이상 발생시 즉각 적인 대응 조치를 취할 수 있는 효과가 있다. 또한 본 발명은 펫의 체온을 측정한 결과를 보정하여 클라우드상의 서버로 전송하고, 클라우드상의 서버에서 상 기 측정한 체온에 대한 결과를 사용자의 통신단말로 제공함으로써, 펫의 체온 측정에 대한 오류 발생을 최대한 방지하면서 펫의 건강상태를 정확하게 모니터링할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 펫의 체온 모니터링용 웨어러블 센서 장치에 대한 바람직한 실시 예를 상세히 설명한다. 각 도면에 제시된 동일한 참조부호는 동일한 부재를 나타낸다. 또한 본 발명의 실시 예들에 대해서 특정한 구조적 내지 기능적 설명들은 단지 본 발명에 따른 실시 예를 설명하기 위한 목적으로 예시된 것으로, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치 하는 의미를 가지는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하 게 형식적인 의미로 해석되지 않는 것이 바람직하다. 도 1은 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치를 포함한 전체 사시도이다. 도 1에 도시된 바와 같이, 본 발명은 펫의 체온 모니터링용 웨어러블 센서 장치(100, 이하 웨어러블 센서 장치 라 약칭함)와 벨트를 포함하여 구성된다. 이때 상기 웨어러블 센서 장치는 펫의 신체부위에 체결하여 사용할 수 있는 형태로 구성된다. 상기 웨어러블 센서 장치는 상기 펫의 목 부분에 체결하여 사용할 수 있는 목걸이 형태로 구성되는 것이 바람직하며, 그 이외에 다리 부분이나 배 부분 등 다양한 신체 부위에 체결하여 사용할 수 있다. 또한 상기 웨어러블 센서 장치는 상기 펫의 체온을 측정하고, 상기 측정한 체온에 대한 정보를 블루투스, 와이파이 등의 무선통신을 통해 원격의 서버나 상기 펫의 주인인 사용자의 휴대단말로 제공함으로써, 상기 펫의 건강상태를 실시간으로 모니터링할 수 있도록 한다. 이에 따라 사용자가 키우는 상기 펫의 건강상태를 손쉽게 확인할 수 있으며, 이상 발생시 동물병원에 데려가는 등의 즉각적인 대응 조치를 취할 수 있게 된다. 특히, 상기 웨어러블 센서 장치는 상기 펫의 피부에 직접 접촉하는 부분을 친환경 실리콘 등의 재질로 형 성함으로써, 상기 펫의 피부에 트러블이 생기지 않도록 하는 것은 물론, 열 전도성을 향상시켜 상기 펫의 체온 측정을 정확하게 측정하도록 할 수 있다. 또한 상기 웨어러블 센서 장치는 상기 펫의 체온을 측정한 결과를 보정하여 클라우드상의 서버로 전송할 수 있다. 예를 들어, 온도센서를 통해 측정한 상기 펫의 체온이 미리 설정되어 있는 측정범위(즉 펫에게서 측정 할 수 있는 체온의 범위)를 벗어나는 경우, 이를 필터링하여 펫의 체온 측정에 대한 오류 발생을 최대한 방지하 도록 하는 것이다. 이에 대한 상세한 설명은 도 2, 도 7 및 도 8을 참조하여 보다 상세하게 설명하기로 한다. 도 2는 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 측면도이다. 도 2에 도시된 바와 같이, 상기 웨어러블 센서 장치는 베이스부, 온도센서 포켓부, 커버부 , 배터리 충전모듈, 배터리, 통신 및 프로세서 모듈, 온도센서, FPCB(180, Flexible Print Circuit Board) 등을 포함하여 구성된다. 상기 베이스부는 상기 펫의 체온을 모니터링하기 위한 웨어러블 센서 장치의 하부를 구성하는 부분이 다. 이때 상기 베이스부의 상기 펫의 신체 부위에 닿는 부분은 유선형의 굽은 상태로 형성하는 것이 바람직하 다. 이는 상기 펫의 신체 굴곡에 따라 자연스럽게 상기 웨어러블 센서 장치를 체결할 수 있도록 하기 위함 이다. 상기 온도센서 포켓부는 상기 펫의 체온을 측정하기 위한 온도센서가 장착되는 부분으로서, 상기 베 이스부의 상부에서 하부 방향으로 결합된다. 특히, 상기 온도센서 포켓부는 상기 온도센서가 상기 펫의 피부에 직접적으로 닿지 않도록 하면서, 상기 펫의 체온을 상기 온도센서로 전달할 수 있도록 상기 베이스부의 하부로 돌출된 형태로 결합되 도록 구성된다. 또한 상기 온도센서 포켓부는 친환경 실리콘 재질로 형성하여, 상기 웨어러블 센서 장치가 상기 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하는 것은 물론, 열 전도성을 향상시켜 상기 온도센서에서 상기 펫의 체온을 정확하게 측정할 수 있도록 한다. 상기 커버부는 내부에 공간이 구비된 캡 형상으로 형성되어 상기 베이스부의 상부에 결합되며, 상기 펫의 체온을 모니터링하기 위한 웨어러블 센서 장치를 보호하는 기능을 수행한다. 즉 배터리 충전모듈, 배터리, 및 통신 및 프로세서 모듈을 포함한 인쇄회로기판을 상기 형성한 공간에 고정, 설치하며, 상기 통신 및 프로세서 모듈의 일측에 연결된 상기 FPCB를 통해 상기 온도센 서를 상기 온도센서 포켓부에 삽입하여 결합한다. 상기 배터리 충전모듈은 상기 커버부의 일측에 구비되어 있는 충전단자에 접속된 전원 케이블을 통해 외부로부터 제공되는 전원을 상기 배터리에 충전하도록 제어한다. 부호 141은 고정홀로서, 상기 배터리 충전모듈의 적어도 하나 이상의 부위에 관통되어 형성되며, 상기 배 터리 충전모듈을 상기 커버부의 내부 공간에 고정할 때, 나사가 체결되는 부분이다. 이때 상기 배터 리 충전모듈의 하부에 상기 배터리 및 상기 통신 및 프로세서 모듈이 함께 결합되므로, 상기 고 정홀은 상기 배터리 충전모듈에만 형성되면 충분하다. 상기 배터리는 상기 배터리 충전모듈의 제어에 따라 외부로부터 공급되는 전원을 충전하며, 상기 통 신 및 프로세서 모듈의 제어에 따라 상기 웨어러블 센서 장치의 구동에 필요한 각 구성 부분으로 충 전된 전압을 공급한다. 상기 통신 및 프로세서 모듈은 근거리 무선통신을 위한 안테나와 무선 통신용 송수신부가 구비되며, 상기 온도센서를 통해 측정한 펫의 체온을 상기 안테나를 통해 사용자의 휴대단말로 직접 전송하거나, 또는 상 기 무선 통신용 송수신부를 통해 클라우드의 서버로 전송하고, 상기 클라우드의 서버에서 상기 펫의 체온을 펫 의 주인인 사용자의 휴대단말로 전송할 수 있다. 또한 상기 통신 및 프로세서 모듈은 환경센서를 추가로 구비할 수 있다. 이때 상기 환경센서는 펫의 주변온도를 측정하는 기능을 수행한다. 또한 상기 통신 및 프로세서 모듈은 상기 환경센서 이외 에, 네트워크를 통해 기상청 서버로부터 수신한 대기온도를 추가로 반영하여 펫의 체온을 보정할 수도 있다. 예를 들어, 상기 통신 및 프로세서 모듈은 상기 온도센서로 측정한 펫의 체온과 상기 환경센서 로 측정한 펫의 주변온도 및 기상청 서버로부터 제공받은 대기온도를 참조하여 상기 펫의 체온을 보정하여 결정 할 수 있는 것이다. 이때 상기 보정하여 결정한 펫의 체온이 미리 설정된 범위를 벗어나는 경우, 해당 펫의 체 온정보는 필터링하여 반영하지 않도록 한다. 실제 계수의 값은 에러가 최소가 되도록 적응적으로 결정되도록 하 며, 인공지능, 최소자승법 등을 통해서 계수가 계산될 수 있다. 한편, 상기 배터리 충전모듈, 배터리 및 통신 및 프로세서 모듈은 하나의 인쇄회로기판 상에 구 성할 수 있다. 상기 온도센서는 상기 펫의 체온을 측정하는 센서로서, 상기 온도센서 소켓부에 구비된 온도센서 삽 입구에 삽입되어 설치되며, 실체 펫의 피부에 접촉하지 않은 상태로 상기 온도센서 소켓부를 통한 열 전달 에 의해 펫의 체온을 측정하고, 상기 측정한 펫의 체온에 대한 측정 데이터를 상기 통신 및 프로세서 모듈(16 0)로 제공한다. 상기 FPCB는 전원라인과 신호라인이 형성되어 있으며, 상기 온도센서와 상기 통신 및 프로세서 모듈 간에 접속된다. 도 3은 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 베이스부 구조를 상세하게 나 타낸 도면이다. 도 3에 도시된 바와 같이, 상기 베이스부는 제1 결합홀, 적어도 하나 이상의 제1 돌출 핀, 가이 드, 적어도 하나 이상의 나사 결합홀, 적어도 하나 이상의 제2 돌출 핀 등을 포함하여 구성된다. 상기 제1 결합홀은 상기 온도센서 포켓부를 펫의 피부가 있는 외부로 통과시켜 결합하기 위한 부분으 로서, 중앙부에 관통되어 형성되어 있다. 상기 제1 돌출 핀은 상기 제1 결합홀을 통해 상기 베이스부의 상부에서 하부 방향으로 결합되는 온도센서 포켓부를 고정하기 위해 바닥면으로부터 돌출 형성된 것으로서, 상기 제1 결합홀의 주변에적어도 하나 이상(예: 도 3의 (a)에서는 3개를 구비) 형성되어 있다. 상기 가이드는 상기 온도센서 포켓부가 상기 베이스부에 결합할 때, 그 위치를 잡아주는 역할을 수행하기 위해 바닥면으로부터 돌출 형성된 부분이다. 즉 상기 가이드는 상기 온도센서 포켓부가 상기 제1 돌출 핀에 각각 끼워져 결합할 때, 상기 온 도센서 포켓부가 움직이지 않도록 외곽 부분을 잡아주는 역할을 수행한다. 상기 나사 결합홀은 상기 베이스부를 상기 커버부에 결합하여 고정시키기 위한 부분으로서, 각 모서리마다 하나씩 관통되어 형성되는 것이 바람직하며, 나사(그 이외에 고정 역할을 수행할 수 있는 부품 사용 가능)로 체결되어 결합된다. 상기 제2 돌출 핀은 상기 도 3의 (a)에 나타낸 바와 같이 양 측면에서 벨트를 결합하기 위해 바닥면 으로부터 돌출되게 형성되어 있다. 이때 상기 제2 돌출 핀은 원 모양이나 편 모양으로 돌출 형성될 수 있 다. 도 4는 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 온도센서 소켓부 구조를 상세 하게 나타낸 도면이다. 도 4에 도시된 바와 같이, 상기 온도센서 소켓부는 엠보싱부, 상판, 적어도 하나 이상의 제2 결 합홀, 온도센서 삽입구, 완충부 등을 포함하여 구성된다. 상기 엠보싱부는 펫의 신체 부위에 직접 맞닿는 부분으로서, 하부가 둥그런 모양으로 형성되어, 상기 베이 스부의 내부로부터 외측으로 노출되게 결합된다. 이때 상기 엠보싱부와 상기 상판 사이에는 상기 도 4의 (b)에 나타낸 것처럼 가로 방향으로 안쪽으로 움푹 들어간 공간이 형성되어 있다. 상기 공간은 상기 엠보싱부가 상기 베이스부의 제1 결합홀 에 결합할 때, 상기 베이스부가 끼워지는 부분으로서, 상기 베이스부와 온도센서 소켓부의 결합 을 단단하게 유지하는 역할을 수행한다. 상기 상판은 상기 베이스부의 바닥면과 맞닿는 부분으로서, 상기 베이스부의 가이드의 내 부에 안착될 수 있는 형태로 형성된다. 상기 제2 결합홀은 상기 상판상의 상기 베이스부의 제1 돌출 핀의 대응되는 위치에 적어도 하나 이상 관통되어 형성되어 있으며, 상기 베이스부의 제1 돌출 핀에 끼워져 결합되는 부분이다. 상기 온도센서 삽입구는 상기 엠보싱부의 내측으로 깊게 파여 형성되며, 상기 온도센서가 삽입 된다. 즉 상기 온도센서를 상기 펫의 피부에 직접 닿지 않고, 열 전달 방식으로 펫의 체온을 전달받아 측 정할 수 있도록 하는 것이다. 상기 완충부는 상기 엠보싱부와 상기 온도센서간의 완충 작용을 위하여 상기 상판의 중앙 하부에 내부로 파인 구조로 형성된다. 즉 상기 완충부는 상기 상판의 높이보다 낮게 파여진 형태로 형성함으로써, 상기 온도센서가 결 합된 FPCB의 단부가 상기 상판의 외측으로 돌출되지 않도록 하는 역할을 수행한다. 또한 상기 완충부는 외곽에 원형의 골 테두리(125a)를 형성하고, 상기 온도센서 삽입구에서 상기 골 테두리(125a) 방향으로 갈수록 경사지게 형성하여, 상기 엠보싱부가 탄력과 강도를 유지하도록 할 수 있다. 도 5는 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 커버부 구조를 상세하게 나타 낸 도면이다. 도 5에 도시된 바와 같이, 상기 커버부는 캡, 적어도 하나 이상의 나사 결합홈, 적어도 하나 이 상의 고정홈, 충전단자, 덮개, 전원 스위치, 적어도 하나 이상의 홀 등을 포함하여 구성된다. 상기 캡은 상기 배터리 충전모듈, 배터리, 및 통신 및 프로세서 모듈을 포함하는 인쇄회로 기판이 설치되도록, 도 5의 (a)에서와 같이 내부에 공간이 형성되어 있다. 상기 나사 결합홈은 상기 캡의 하부에 적어도 하나 이상 구비되어있다. 이때 상기 나사 결합홈 은 상기 베이스부의 나사 결합홀의 대응되는 위치에 각각 형성되며, 상기 베이스부의 하부에서 나사를 통해 상기 나사 결합홀을 관통하여 상기 나사 결합홈에 체결되는 것을 통해 상기 베이스부 와 단단하게 고정, 결합된다. 상기 고정홈은 상기 배터리 충전모듈, 배터리, 및 상기 통신 및 프로세서 모듈을 상기 캡 의 내부에 고정하기 위한 부분으로서, 상기 도 2에 나타낸 고정홀의 대응되는 위치에 각각 형성된다. 상기 충전단자는 도 5의 (b)에 나타낸 것처럼 상기 캡의 일측에 형성되고, 배터리 충전을 위한 충전 케이블이 접속되는 부분이다. 상기 덮개는 상기 충전포트의 외측에 구비되고, 상기 충전단자가 외부로 노출되지 않도록 한다. 이때 상기 덮개의 외부 일측에는 손잡이가 형성되어 있고, 다른 일측은 고정된 상태로 형성된다. 그러므로 상기 배터리를 충전할 경우, 사용자는 상기 손잡이를 잡고 오픈시킨 다음, 상기 충전단자에 충전 케 이블을 연결하면 된다. 상기 전원 스위치는 도 5의 (c)에 나타낸 것처럼, 상기 캡의 상기 충전단자와 덮개가 형성 된 반대측에 형성되어, 상기 웨어러블 센서 장치의 전원을 온 또는 오프하기 위한 기능을 수행한다. 상기 홀은 상기 캡의 상부에 적어도 하나 이상 관통되어 형성되며, 상기 웨어러블 센서 장치의 동작상태를 표시하기 위해 내부에 구비된 LED(미도시)에서 방출되는 빛을 외부로 통과시키는 기능을 수행한다. 다음에는, 이와 같이 구성된 본 발명에 따른 펫의 체온 모니터링용 웨어러블 센서 장치 구성 방법의 일 실시예 를 도 6을 참조하여 상세하게 설명한다. 이때 본 발명의 방법에 따른 각 단계는 사용 환경이나 당업자에 의해 순서가 변경될 수 있다. 도 6은 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치 구성 방법의 동작과정을 상세하 게 나타낸 순서도이다. 도 6에 도시된 바와 같이, 펫의 체온 모니터링용 웨어러블 센서 장치를 생산하는 시스템(미도시)은, 먼저 상기 웨어러블 센서 장치의 하부 구조인 베이스부를 구성하는 단계를 수행한다(S10). 또한 상기 베이스부에 결합되고, 상기 펫의 체온을 측정하기 위한 온도센서가 내부에 삽입, 장착되는 온도센서 포켓부를 구성하는 단계를 수행한다(S20). 특히, 본 발명은 상기 온도센서 포켓부를 구성할 때, 상기 온도센서가 상기 펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록 하부로 돌출된 형태로 구성하고, 상기 하부로 돌출된 형태의 내부 공간에 상기 온도센서를 삽입하여 장착할 수 있는 구조를 만드는 것이 필요하다. 또한 상기 베이스부와 결합되어 펫의 체온을 모니터링하기 위한 웨어러블 센서 장치를 보호하는 커버 부를 구성하는 단계를 수행한다(S30). 또한 배터리, 상기 배터리를 충전하는 배터리 충전모듈, 및 상기 온도센서를 통해 측정한 펫의 체온을 근거리 무선통신(예: 블루투스)을 통해 사용자의 휴대단말로 전송하고, 상기 온도센서로 펫의 체온 을 측정한 결과를 보정하는 통신 및 프로세서 모듈을 포함하는 인쇄회로기판을 구성하는 단계를 수행한다 (S40). 이어서, 상기 S30 단계를 통해 구성한 상기 커버부의 내부 공간에 상기 S40 단계를 통해 구성한 인쇄회로 기판을 설치한 다음, 상기 S20 단계를 통해 구성한 상기 온도센서 포켓부를 상기 S10 단계를 통해 구성한 상기 베이스부에 결합함과 동시에 상기 베이스부의 양측에 벨트를 연결한다. 그리고 상기 커버 부를 상기 베이스부와 결합하여 상기 웨어러블 센서 장치의 구성을 완성한다(S50). 한편, 상기 S10 단계 내지 S30 단계를 통해 구성하는 베이스부, 온도센서 소켓부 및 커버부의 세부 구조는 상기 도 3 내지 도 5에 설명한 것과 동일하므로, 여기에서의 상세한 설명은 생략하기로 한다. 다음에는, 이와 같이 구성된 본 발명에 따른 펫의 체온 모니터링용 웨어러블 센서 장치에서 수행되는 펫의 체온 측정치 보정에 대하여 도 7과 도 8a 내지 도 8c를 참조하여 상세하게 설명한다. 도 7은 본 발명에 적용되는 펫의 체온 모니터링용 웨어러블 센서 장치에서의 펫의 체온 측정치를 보정하는 개념 을 나타낸 도면이며, 도 8a 내지 도 8c는 본 발명에 적용되는 펫의 체온 모니터링용 웨어러블 센서 장치에서의펫의 체온 측정치 보정 방법의 동작과정을 각 실시예별로 나타낸 순서도이다. 도 7에 도시된 바와 같이, 상기 웨어러블 센서 장치는 측정한 펫의 체온 측정치를 환경센서를 통해 측정한 펫의 주변온도(환경센서)는 물론, 상기 기상청 서버로부터 제공되는 대기온도를 참조하여 보정하고, 상기 보정한 펫의 체온정보를 사용자 단말로 제공할 수 있다. 이때 상기 보정한 펫의 체온정보는 네트워크를 통해 정보수집 서버를 경유하여 상기 사용자 단말로 제공할 수 있으며, 데이터베이스에 저장하여 관리할 수 있다. 상기 웨어러블 센서 장치에서는 3가지 방식을 적용하여 펫의 체온을 보정할 수 있는데, 그 구체적인 방식 에 대해서 설명하면 다음과 같다. 먼저, 상기 웨어러블 센서 장치는 상기 온도센서를 통해 측정한 펫의 체온에 상기 환경센서를 통해 측정한 펫의 주변온도를 반영하여 보정한 다음 체온 보정치를 상기 사용자 단말로 출력할 수 있다. 즉, 펫의 피부에 직접적으로 닿지 않도록 하면서 펫의 체온이 전달되도록 하부로 돌출되도록 구성되는 온도센서 포켓에 설치된 온도센서를 통해서 펫의 체온을 측정하고, 주변온도를 측정하는 적어도 하나 이상의 환경센서를 통해서 주변온도를 측정한 다음, 상기 온도센서로 측정한 펫의 체온과 상기 적어도 하나 이상의 환경센서로 측 정한 주변온도를 독립변수로 추가하여 상기 펫의 체온을 보정한다. 더욱 구체적으로는, 펫의 체온과 주변온도의 차이(DT)와 중심온도(MT)를 이용하여 보정온도를 구할 수 있다. 이 경우 보정된 온도는 상기 펫의 체온이 주변온도에 따라 보정되도록 함으로써, 실제 펫의 체온이 주변온도에 따 라 보정되어 안정적인 측정값이 되도록 한다. 주변온도는 비교적 정확한 값으로 그 영향이 적지만, 실제 펫의 체온은 주변온도에 영향을 받아 체온의 범위를 벗어날 수 있으므로, 실제 펫의 체온에 주변온도를 반영하여 보 정한 값으로 계산함으로써, 실제 체온이 정확하게 측정되도록 한다. 도 8a를 참조하여 보다 구체적으로 설명하면, 상기 웨어러블 센서 장치는 상기 온도센서와 환경센서 를 통해 펫의 체온 측정치(t1)와 펫의 주변온도(t2)를 각각 측정하고(S110), 상기 체온 측정치(t1)와 펫의 주변온도(t2)간의 중심값(절대값)을 산출하여 중심온도(MT)를 확인한다(S120). 이어서, 상기 웨어러블 센서 장치는 펫의 체온 측정치(t1)와 펫의 주변온도(t2)의 차온도(DT)를 산출하고 (S130), 상기 S130 단계에서 산출한 차온도(DT)에서 상기 S120 단계에서 산출한 중심온도(MT)를 차감한 값을 상 기 S110 단계에서 측정한 펫의 체온 측정치(t1)와 더하여 최종 보정온도(tb)를 산출한다(S140). 여기서 주변온 도는 적어도 하나 이상을 측정하여 사용할 수 있다. 복수의 주변온도에 대한 정보가 있을 경우, 이들에 대한 평 균, 중간값, 표준편, 분산 등을 활용할 수도 있다. 또한, 상기 웨어러블 센서 장치는 상기 온도센서를 통해 측정한 펫의 체온, 상기 환경센서를 통 해 측정한 펫의 주변온도 및 상기 기상청 서버로부터 제공받은 대기온도를 참조하여 상기 펫의 체온을 더 보정할 수 있다. 즉 상기 도 8a의 방식에 상기 기상청 서버로부터 수집한 대기온도를 바탕으로 보정을 한 번 더 수행한 다음, 펫의 체온 보정치를 출력할 수 있다. 도 8b를 참조하여 보다 구체적으로 설명하면, 상기 웨어러블 센서 장치는 상기 온도센서와 상기 환경 센서를 통해 측정한 펫의 체온 측정치(t1)와 펫의 주변온도(t2, t3, ...), 그리고 상기 기상청 서버 로부터 제공받은 대기온도(..., tn-1, tn)를 확인하고(S210), 이를 토대로 온도보정 테이블을 산출(도출)하여 저장한다(S220). 이후 상기 웨어러블 센서 장치는 상기 S220 단계에서 산출한 온도보정 테이블을 토대로 최소자승법(Least Square Method)을 이용하여 오차(에러)를 최소로 하는 다중회귀 방정식에 사용할 계수(예: a0, a1, a2, ..., ak)를 산출한다(S230). 수학식 1은 다중회귀방정식(multiple regression function)을 복수의 독립변수(t11, t12, ..., t1k, ..., tn k)와 오차항(e)의 선형함수로 나타낸 것이다. 여기서 계수(a0, a2, ..., ak)는 추정해야할 파라미터이다.[수학식 1]"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1은 다시 수학식 2와 같이 정리할 수 있으며, 수학식 2를 수식으로 간략화하면 수학식 3과 같이 되고, 에러항 E는 수학식 4와 같이 표시할 수 있다. [수학식 2]"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[수학식 3]"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "[수학식 4]"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, Tb는 체온 보정치이고, a는 계수, e는 오차, A는 a0 내지 ak에 대한 계수 집합을 나타내는 행렬, T는 t1 내지 tk에 대한 온도 집합을 나타내는 행렬, E는 e0 내지 en에 대한 에러(오차)의 집합을 나타내는 행렬이다. 다음은 최소자승법(Least Square Method)을 이용하여 오차(에러)를 최소화하는 과정을 수학식 4를 이용하여 에 러항을 최소로 하도록 수학식 5와 같이 전개할 수 있다. [수학식 5]"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 5를 편미분하여 0으로 두면 수학식 6과 같이 계수에 대한 추정치( )가 산출된다. [수학식 6]"}
{"patent_id": "10-2022-0066727", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "이어서, 상기 웨어러블 센서 장치는 다중회귀 방정식과 상기 S230 단계에서 산출한 계수를 적용하여 최종 적으로 체온을 추정한다(S240). 이때 상기 웨어러블 센서 장치는 펫의 체온에 대한 가능범위를 설정한 다음 그 범위를 벗어나면 노이즈로 간주하며, 체온의 변화가 기 설정한 수치보다 더 급격하게 변하는 경우 주변온도(t2) 및 대기온도(tn)에 의한 상승 혹은 감소로 보고, 해당 파라미터에 대한 가중치를 조정한다. 즉 다중회귀 방정식을 적용하여 오차(e)가 최소가 되는 계수를 산출하여 테이블로 저장하였다가 사용하고, 적응적으로 실시간 추정하여 온도보정을 실시하 는 것이다. 또한 주변온도가 갑자기 변하는 경우에도 이를 필터링하여 온도보정에 반영할 필요가 있다. 한편, 상기 웨어러블 센서 장치는 상기 도 8b에 나타낸 다중회귀 방정식과 최소자승법을 이용한 방식 이외 에, 인공지능 학습모델을 이용하여 펫의 체온을 보정할 수 있다. 즉 인공지능 알고리즘을 적용하여 오차가 최소 가 되도록 학습하여 추정함으로써, 펫의 온도에 대한 보정을 실시하는 것이다. 이때 인공지능 학습은 도 7의 정 보수집 서버에서 수행하는 것이 바람직하며, 온도보정을 위한 계수 추정은 상기 웨어러블 센서 장치 이외에, 사용자 단말에서 수행할 수도 있다. 도 8c를 참조하여 보다 구체적으로 설명하면, 상기 웨어러블 센서 장치는 상기 온도센서와 상기 환경 센서를 통해 측정한 펫의 체온 측정치(t1)과 펫의 주변온도(t2, t3, ...), 그리고 상기 기상청 서버 로부터 제공받은 대기온도(..., tn-1, tn)를 측정한다(S310). 이렇게 측정된 온도정보는 수집되어(S410), 인공 지능 학습모델을 생성할 때, 학습정보로 활용된다(S420). 이어서, 상기 S310 단계에서 측정하거나 확인한 온도 정보를 학습모델에 적용 가능하도록 전처리한다(S320). 또한 상기 웨어러블 센서 장치는 상기 S320 단계에서 전처리한 온도 정보를 기 생성된 학습모델에 적용하 고, 상기 학습모델로부터 체온 보정치를 추정하고(S330), 상기 추정한 체온 보정치 추정값을 출력한다(S340). 이처럼, 본 발명은 펫의 피부에 접촉하여도 트러블이 생기지 않도록 하면서, 열 전도성을 향상시킬 수 있는 웨 어러블 센서 장치를 통해 펫의 체온을 정확하게 측정할 수 있다. 또한 본 발명은 사용자가 웨어러블 센서 장치에서 측정한 펫의 체온정보를 자신의 휴대단말로 수신하여 모니터 링할 수 있으므로, 사용자가 관리하고 있는 펫의 건강상태를 손쉽게 확인할 수 있고, 이상 발생시 즉각적인 대 응 조치를 취할 수 있다. 또한 펫의 체온을 측정한 결과를 보정하여 클라우드상의 서버로 전송하고, 클라우드상의 서버에서 상기 측정한 체온에 대한 결과를 사용자의 통신단말로 제공하기 때문에, 펫의 체온 측정에 대한 오류 발생을 최대한 방지하 면서 펫의 건강상태를 정확하게 모니터링할 수 있다. 이상에서와 같이 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하 다는 점을 이해할 것이다. 따라서 본 발명의 기술적 보호범위는 아래의 특허청구범위에 의해서 판단되어야 할 것이다."}
{"patent_id": "10-2022-0066727", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치를 포함한 전체 사시도이다. 도 2는 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 측면도이다. 도 3은 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 베이스부 구조를 상세하게 나 타낸 도면이다. 도 4는 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 온도센서 소켓부 구조를 상세 하게 나타낸 도면이다. 도 5는 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치의 커버부 구조를 상세하게 나타 낸 도면이다. 도 6은 본 발명의 일 실시예에 따른 펫의 체온 모니터링용 웨어러블 센서 장치 구성 방법의 동작과정을 상세하 게 나타낸 순서도이다. 도 7은 본 발명에 적용되는 펫의 체온 모니터링용 웨어러블 센서 장치에서의 펫의 체온 측정치를 보정하는 개념 을 나타낸 도면이다.도 8a 내지 도 8c는 본 발명에 적용되는 펫의 체온 모니터링용 웨어러블 센서 장치에서의 펫의 체온 측정치 보 정 방법의 동작과정을 각 실시예별로 나타낸 순서도이다."}
