{"patent_id": "10-2023-0064389", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0166761", "출원번호": "10-2023-0064389", "발명의 명칭": "페로브스카이트 퀀텀닷 기반 포토닉 시냅스 트랜지스터 및 그 제조 방법", "출원인": "세종대학교산학협력단", "발명자": "임유승"}}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "게이트 전극층;상기 게이트 전극층상에 형성된 유전체층;상기 유전체층상에 IGZO(Indium gallium zinc oxide)로 형성된 채널층;상기 채널층상의 제1 영역에 형성된 소스 전극;상기 채널층상의 제2 영역에 형성된 드레인 전극-여기서, 상기 제1 영역은 상기 제2 영역과 중첩하지 않음; 및상기 소스 전극, 상기 드레인 전극 및 상기 소스 전극과 상기 드레인 전극 사이 채널층상에 형성된 페로브스카이트 퀀텀닷층을 포함하되,단일 가시광 펄스에 의해 PPC(Persistent Photoconductivity) 거동하며, 연속 가시광 펄스에 의해 PPF(Paired-Pulse Facilitation) 거동하는 포토닉 시냅스 트랜지스터."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 페로브스카이트 퀀텀닷층은 CsPbBr3 나노 입자로 형성되는, 포토닉 시냅스트랜지스터."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 페로브스카이트 퀀텀닷층은 녹색광에 반응하는, 포토닉 시냅스 트랜지스터."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 가시광 펄스의 인가 시간이 증가하면 LTP(long-term plasticity) 거동하는, 포토닉 시냅스트랜지스터."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 청구항 1에 있어서, 가시광 펄스를 인가한 후 음의 전압 스파이크를 인가하여 기억 과정을구현하며, 상기 가시광 펄스 인가 후 양의 전압 스파이크를 인가하여 망각 과정을 구현하는, 포토닉 시냅스 트랜지스터."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "포토닉 시냅스 트랜지스터를 제조하는 방법에 있어서,게이트 전극층 및 상기 게이트 전극층상에 형성된 유전체층으로 구성된 기판에 채널층을 증착하는 단계;상기 채널층의 제1 영역 및 제2 영역에 소스 전극 및 드레인 전극을 형성하는 단계-여기서, 상기 제1 영역은 상기 제2 영역과 중첩하지 않음; 및상기 채널층, 상기 소스 전극 및 상기 드레인 전극이 형성된 기판상에 페로브스카이트 퀀텀닷층을 형성하는 단계를 포함하는 포토닉 시냅스 트랜지스터 제조방법."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 페로브스카이트 퀀텀닷층은 CsPbBr3 나노 입자 용액을 스핀 코팅하여 형성되는, 포토닉 시냅스 트랜지스터 제조방법."}
{"patent_id": "10-2023-0064389", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서, 상기 채널층은 IGZO(Indium gallium zinc oxide)를 RF 마그네트론 스퍼터링하여 형성되는,공개특허 10-2024-0166761-3-포토닉 시냅스 트랜지스터 제조방법."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 측면에 따른 포토닉 시냅스 트랜지스터는 게이트 전극층, 상기 게이트 전극층상에 형성된 유전체층, 상기 유전체층상에 IGZO(Indium gallium zinc oxide)로 형성된 채널층, 상기 채널층상의 제1 영역에 형성된 소스 전극, 상기 채널층상의 제2 영역에 형성된 드레인 전극-여기서, 상기 제1 영역은 상기 제2 영역과 중첩하지 않음 및 상기 소스 전극, 상기 드레인 전극 및 상기 소스 전극과 상기 드레인 전극 사이 채널층상에 형 성된 페로브스카이트 퀀텀닷층을 포함할 수 있다."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 포토닉 시냅스 트랜지스터에 관한 것이다."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 기기에서 사용 중인 폰 노이만 구조는 컴퓨터 계산 역할의 CPU(중앙처리장치)와 데이터를 저장하는 메모리 가 분리된 구조이다. CPU와 메모리는 버스를 통해 연결되며, 컴퓨터 명령과 데이터의 교환은 버스를 통해 동시 에 이루어진다. CPU와 메모리는 직렬 연결된 버스를 동시에 이용하기 때문에, 최대 처리량 한계가 생기고 병목 현상이 발생한다. 한편, 병목 현상을 줄여 처리를 빠르게 하기 위해 칩 안에 많은 소자를 집적하게 될 경우에는 대량 열 발생이나 소자 사이 간섭 등의 물리적 문제를 극복하기 어려운 문제가 있다. 반면 생물의 뇌 구조에서 영감을 받은 뉴로모픽 소자는 CPU와 메모리가 분리돼 있지 않고, 뉴런 및 시냅스는 병 렬 구성된다. 따라서 명령어와 데이터 접근을 병렬로 처리하여 대량의 데이터를 고효율로 처리 및 저장할 수 있 어 저전력 동작이 가능하다. 더불어 생물의 뇌 구조를 모방하면 미리 정의된 모델이나 방식이 없는 비정형 데이 터 학습 및 처리에 유리하다. IGZO 채널층을 가진 시냅스 트랜지스터는 많은 연구가 진행돼 있으나, IGZO의 밴드갭은 약 3.1 eV로, 가시광 범 위 (3.1 < E < 1.63) 빛에 대한 반응성이 부족하다. 청색광까지는 미약한 반응성을 가지나 이보다 파장이 긴 가 시광에 대해서는 반응성을 전혀 가지지 않는다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 제10-2170605호"}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 자외선 범위 내로 국한돼 있던 광전자 수용 특성을 가시광 영역까지 가능하도록 수용 범위가 확장된 포토닉 시냅스 트랜지스터를 제공하고자 한다."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 포토닉 시냅스 트랜지스터는 게이트 전극층, 상기 게이트 전극층상에 형성된 유전체 층, 상기 유전체층상에 IGZO(Indium gallium zinc oxide)로 형성된 채널층, 상기 채널층상의 제1 영역에 형성된 소스 전극, 상기 채널층상의 제2 영역에 형성된 드레인 전극-여기서, 상기 제1 영역은 상기 제2 영역과 중첩하 지 않음 및 상기 소스 전극, 상기 드레인 전극 및 상기 소스 전극과 상기 드레인 전극 사이 채널층상에 형성된 페로브스카이트 퀀텀닷층을 포함할 수 있다. 포토닉 시냅스 트랜지스터는 단일 가시광 펄스에 의해 PPC(Persistent Photoconductivity) 거동하며, 연속 가시광 펄스에 의해 PPF(Paired-Pulse Facilitation) 거동 할 수 있다. 일 실시예로, 상기 페로브스카이트 퀀텀닷층은 CsPbBr3 나노 입자로 형성되는, 포토닉 시냅스 트랜지스터. 일 실시예로, 상기 페로브스카이트 퀀텀닷층은 녹색광에 반응하는, 포토닉 시냅스 트랜지스터. 일 실시예로, 가시광 펄스의 인가 시간이 증가하면 LTP(long-term plasticity) 거동하는, 포토닉 시냅스 트랜지 스터. 일 실시예로, 청구항 1에 있어서, 가시광 펄스를 인가한 후 음의 전압 스파이크를 인가하여 기억 과정을 구현하 며, 상기 가시광 펄스 인가 후 양의 전압 스파이크를 인가하여 망각 과정을 구현하는, 포토닉 시냅스 트랜지스터. 본 발명의 다른 측면에 따른 포토닉 시냅스 트랜지스터를 제조하는 방법은 게이트 전극층 및 상기 게이트 전극 층상에 형성된 유전체층으로 구성된 기판에 채널층을 증착하는 단계, 상기 채널층의 제1 영역 및 제2 영역에 소 스 전극 및 드레인 전극을 형성하는 단계-여기서, 상기 제1 영역은 상기 제2 영역과 중첩하지 않음 및 상기 채 널층, 상기 소스 전극 및 상기 드레인 전극이 형성된 기판상에 페로브스카이트 퀀텀닷층을 형성하는 단계를 포 함할 수 있다. 일 실시예로, 상기 페로브스카이트 퀀텀닷층은 CsPbBr3 나노 입자 용액을 스핀 코팅하여 형성될 수 있다. 일 실시예로, 상기 채널층은 IGZO(Indium gallium zinc oxide)를 RF 마그네트론 스퍼터링하여 형성될 수 있다."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 포토닉 시냅스 트랜지스터는 가시광 범위에서도 광전자를 수용할 수 있게 된다. 따 라서, 본 발명의 실시예에 따른 포토닉 시냅스 트랜지스터는 가시광에 대해 반응성을 가지게 되어 비접촉식 데 이터 입력이 가능해지며, 특히, 빛의 속도로 초고속 데이터 전파가 가능해져서, 전기적 신호만을 이용하는 종래 트랜지스터의 한계점인 좁은 대역폭을 확장할 수 있으며, 소자간 간섭 및 열 발생량을 낮추어 종래 트랜지스터 의 물리적 문제를 극복할 수 있다. 한편, 본 발명의 실시예에 따른 포토닉 시냅스 트랜지스터는 간단한 구조로 생물 뇌 구조를 모방 제작하여, 가 시광 및 전기적 스파이크와의 상호작용을 조절해 시냅스 가소성을 조절한 STDP(Spike-timing-dependent plasticity) 기반으로 생물학적 반응을 모방할 수 있다."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 이를 상세한 설명을 통해 상세히 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려 는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 층, 영역 또는 기판과 같은 요소가 다른 요소 \"위(on)\"에 존재하는 것으로 또는 \"위로(onto)\" 확장되는 것으로 기술되는 경우, 그 요소는 다른 요소의 직접 위에 있거나 직접 위로 확장될 수 있고, 또는 중간의 개입 요소가 존재할 수도 있다. 반면에, 하나의 요소가 다른 요소 \"바로 위(directly on)\"에 있거나 \"바로 위로(directly onto)\" 확장된다고 언급되는 경우, 다른 중간 요소들은 존재하지 않는다. 또한, 하나의 요소가 다른 요소에 \"연 결(connected)\"되거나 \"결합(coupled)\"된다고 기술되는 경우, 그 요소는 다른 요소에 직접 연결되거나 직접 결 합될 수 있고, 또는 중간의 개입 요소가 존재할 수도 있다. 반면에, 하나의 요소가 다른 요소에 \"직접 연결 (directly connected)\"되거나 \"직접 결합(directly coupled)\"된다고 기술되는 경우에는 다른 중간 요소가 존재 하지 않는다. \"아래의(below)\" 또는 \"위의(above)\" 또는 \"상부의(upper)\" 또는 \"하부의(lower)\" 또는 \"수평의(horizontal)\" 또는 \"측면의(lateral)\" 또는 \"수직의(vertical)\"와 같은 상대적인 용어들은 여기에서 도면에 도시된 바와 같이 하나의 요소, 층 또는 영역의 다른 요소, 층 또는 영역에 대한 관계를 기술하는데 사용될 수 있다. 이들 용어들 은 도면에 묘사된 방향(orientation)에 부가하여 장치의 다른 방향을 포괄하기 위한 의도를 갖는 것으로 이해되 어야 한다. 최근 인공지능 분야에서는 뉴로모픽 장치 개발이 큰 관심을 받고 있으며, 이는 기존의 디지털 컴퓨팅 기술에 한 계가 있어 새로운 접근법이 필요한 상황에서 중요한 응용 분야로 부상하고 있다. 신경 시스템을 모방한 하드웨 어는 전통적인 CMOS 기술과 비교해 전력 소비가 적고, 병렬 구성으로 고속 처리와 고밀도 연결성을 제공할 수 있다. 신경망 구성에서 시냅스는 핵심 요소이며, 인공 시냅스 중에서도 광 자극 시냅스 연구는 인간이 인간이 수용하는 정보 중 시각적 자극을 통해 약 70 % 이상 수용하기 때문에 필수적이다. 광시냅스는 광속을 이용해 신 호를 받기 때문에 전기적 시냅스보다 빠른 처리 속도를 제공하고, 광전기적 특성 이용으로 인해 에너지 효율성 이 대폭 향상된다. 이에 인공 광시냅스 연구는 매우 중요한 분야로 여겨졌다. 현재까지 보고된 광시냅스 사용 물질로 저차원 물질, 페로브스카이트, 유기 반도체 등 다양한 재료들이 제안되었다. 이 중 페로브스카이트는 다 른 재료들보다 높은 양자수율, 솔루션 가공성, 좁은 방출 스펙트럼 장점으로 인해 새로운 광전자공학 재료로서 높은 관심을 받았다. 하지만 비용 효율성과 상온의 대기 환경 조건을 견딜 수 있는 안정성 및 내구성 향상이 요 구돼 상용화가 어려운 상황이다. 이하에서 설명할 구조는 이러한 문제점을 해결함과 동시에 인공지능 하드웨어 로 많이 연구되고 있는 크로스바 형태 2단자 소자 문제점을 해결할 수 있다. 멤리스터는 높은 집적도와 연결성 뿐만 아니라 우수한 유연성으로 각광받고 있지만, sneak current 문제와 사이클 간 변동성(CCV)이 심해 기록량 이 증가할수록 데이터의 안정성이 감소하는 문제점이 지속적으로 나타나고 있기 때문이다. 이하에서 설명할 구조는 빛 흡수 및 방출 특성을 가진 CsPbBr3 양자점(QD)을 포함한 FET(Field effect transistor) 구조의 포토닉 시냅스 트랜지스터이다. 포토닉 시냅스 트랜지스터는 멤리스터보다 선형적인 전류- 전압 특성을 가지며 Sneak current 전류 문제를 해결할 수 있다. 또한 신호 전극과 학습 전극이 분리되어 있어 동시에 신호를 처리할 수 있다. 비정질 산화인듐갈륨주석(Amorphous indium gallium zinc oxide; a-IGZO)의 백 채널에 양자점을 결합하면 빛에 의해 생성되는 전자-정공 쌍을 효율적으로 분리할 수 있어 광전도도 변화에 효 율적으로 대응할 수 있다. 솔루션 기반 공정으로 합성한 퀀텀닷과 최소한의 레이어 구조로 만든 FET는 대기 환 경 내 제조하여, 특별한 합성 환경이 요구되지 않으며 저비용으로 제작할 수 있다. 더불어 안정적으로 전극 인 터페이스와 접촉하고 퀀텀닷의 열과 수분에 대한 높은 내구성으로 상온에서 심각한 열화 없이 동작한다. 이는 실용화가 어려웠던 기존 문제점을 해소할 수 있다. 도 1은 본 발명의 실시예에 따른 포토닉 시냅스 트랜지스터를 예시적으로 도시한 도면이다. 도 1을 참조하면, 포토닉 시냅스 트랜지스터는 게이트 전극층, 유전체층, 채널층, 소스/드 레인 전극 및 페로브스카이트 퀀텀닷층을 포함할 수 있다. 게이트 전극층은 P형 불순물 이온으로 도핑된 실리콘으로 형성되며, 유전체층은 예를 들어 PECVD에 의해 게이트 전극층상에 약 200nm 두께로 형성된 실리콘 산화물층(SiO2)일 수 있다. 유전체층은 SiO2 이외에 Si3N4, Al2O3로 형성될 수도 있다. 채널층은 게이트 전극층에 의해 유도된 전하가 소스/드레인 전극의 전압에 의해 흐를 수 있도록 하는 전하 수송층이다. 채널층은 전자 이동도 및 온 오프비가 높은 n형 a-IGZO를 물리적 기상 증착(PVD)에 의해 유전체층 상에 약 10nm 두께로 증착(TEM, Stylus profiler로 측정)하여 형성될 수 있다. 예를 들어, 2 인 치 고이동도 IGZO 단일 타겟을 사용해 RF Magnetron Sputtering 방법으로 IGZO를 증착할 수 있다. 채널층 형성 공정은 프리스퍼터링과 박막 증착 공정으로 구분될 수 있다. 프리스퍼터링은 아르곤(Ar) 가스만 약 48 sccm 주입하여 약 10 분간 진행하며, 산호 O2 가스를 약 8 sccm 추가 주입(Ar(g):O2(g) = 6:1, sccm (Standard Cubic Centimeter per Minute)하여 약 5 분간 진행할 수 있다. 박막 증착 공정은 아르곤과 산소의 혼합 분위기 (Ar(g) 48 sccm, O2(g) 8 sccm)에서, RF Power 40 W로 약 3 분 25초 동안 진행할 수 있다. 채널층은 별도 가스 환경 조성 없이 공기 상태 내 핫플레이트 상단에 배치하여, 약 250 ℃ 온도로 약 1 시간 동안 열처리할 수 있다. 소스/드레인 전극은 채널층 상면의 제1 영역 및 제2 영역에 각각 형성된다. 여기서, 제1 영역과 제2 영역 은 중첩하지 않는다. 소스/드레인 전극은 적층된 알루미늄(Al)층 및 금(Au)층으로 구성될 수 있다. 약 100nm 두께의 알루미늄층 및 약 40nm 두께의 금층은 Thermal evaporation 방법을 이용해서 증착 할 수 있다. 페로브스카이트 퀀텀닷층은 Pristine 트랜지스터 제작 후 최상단 전면 스핀 코팅하여 시냅스 트랜지스터 상에 형성되는 광전자 수용층이다. 측정 시에는 채널층과 소스/드레인 전극이 형성되지 않은 유전체 층의 영역에 형성된 페로브스카이트 퀀텀닷층을 다이아몬드 칼로 긁어 유전체층 및 페로브스카 이트 퀀텀닷층을 제거하여 게이트 전극층을 게이트로 사용하고 소스/드레인 전극에 소스/드레인 전압 을 인가한다. 페로브스카이트 퀀텀닷층은 퀀텀닷 나노 입자 용액을 사용하여 형성할 수 있다. 퀀텀닷 나노 입자는 전 무기질 CsPbBr3 나노 입자이며, 밴드갭은 약 2.26eV(548nm)이다. 퀀텀닷 나노 입자는 다음과 같이 합성할 수 있다. 우선, 약 3몰(= 약 1.101g)의 Lead(II) bromide (PbBr2), 약 6몰(= 약 3.282g)의 Tetraoctylammonium bromide (TOAB)과 약 30ml의 Toluene을 vial에 넣어 섞어서 Pb2+ precursor 용액을 제조한다. Pb2+ precursor 용액은 상온에서 약 2 시간 동안 섞는다. 한편, Cs- oleate precursor은 약 0.1g의 Cesium carbonate(Cs2CO3)와 약 3 ml의 Oleic acid(OA)를 다른 vial에 넣고 vial의 뚜 껑을 개방한 상태로 약 50℃에서 약 15분간 섞는다. 그리고 또 다른 vial에 약 0.1g의 Didodecyldimethylammonium bromide(DDAB)와 약 10ml의 Toluene을 넣고 상온에서 약 10분간 섞어 DDAB 용액을 준비한다. 약 9ml의 Pb2+ precursor 용액에 약 1ml의 Cs- oleate precursor 용액을 넣고 약 5분 동안 섞는다. 약 3ml의 DDAB 용액을 빠르게 주입한 뒤 약 10분 동안 섞는다. 그 후, 약 26ml의 Ethyl acetate(EtOAc)를 주입해 원심분 리기에서 약 10,000rpm으로 약 10분 동안 원액을 원심 분리시킨다. 가라앉은 퀀텀닷 나노 입자들만 남기고 EtOAc를 버린다. 그리고 퀀텀닷 나노 입자에 약 3ml의 Toluene, 약 6ml의 EtOAc를 넣어 간단히 섞은 후 원심분 리기에 넣고 다시 약 10,000rpm으로 약 10분 동안 원액을 원심 분리시킨다. 하층 퀀텀닷 나노 입자만 남기고 상 층액은 버린다. 합성한 CsPbBr3 나노 입자는 냉장 보관이 가능하며, n-Octane을 주입하여 퀀텀닷 나노 입자를 용액으로 만들어가 희석할 수 있다. 퀀텀닷 나노 입자 합성의 모든 공정은 공기 중의 Hot-plate 위에서 진행할 수 있다. 페로브스카이트 퀀텀닷층은 퀀텀닷 나노 입자 용액을 약 4,500 rpm으로 약 60초 동안 시냅스 트랜지스터 의 전면에 스핀 코팅 후 약 70°C의 핫플레이트에서 약 1분간 열처리하여 형성될 수 있다. 도 2a, 도 2b 및 도 2c는 포토닉 시냅스 트랜지스터에 적용한 페로브스카이트 퀀텀닷의 광 특성을 예시적으로 도시한 도면이다. 도 2a는 퀀텀닷 나노 입자로 형성된 페로브스카이트 퀀텀닷층의 흡광도(Absorbance) 및 광 발광도(PL, Photoluminescence)를 나타내고, 도 2b는 퀀텀닷 나노 입자로 형성된 페로브스카이트 퀀텀닷층의 투과도를 나타내며, 도 2c는 상온에서 퀀텀닷 나노 입자로 형성된 페로브스카이트 퀀텀닷층의 Tauc 곡선을나타낸다. 흡광도는 자외/가시선 분자 흡수 분광법을 통해 측정한 것으로 흡광도 피크 파장은 약 515nm, 광 발 광도 피크 파장은 약 518nm, Full Width at Half Maximum (FWHM)은 약 16nm에서 측정되었다. 광 발광도 곡선으 로부터, 페로브스카이트 퀀텀닷층은 녹색 가시광 빛을 발광함을 알 수 있다. 합성한 퀀텀닷 나노 입자로 형성된 페로브스카이트 퀀텀닷층은 녹색 가시광을 발광하기 때문에, 퀀텀닷 나노 입자의 밴드갭은 녹색광 파장 (570~500nm 해당하면 녹색광) 에너지보다 작은 밴드갭 값을 갖는다고 볼 수 있다. Tauc 곡선을 이용하여 수학식 1에 의해 산출한 퀀텀닷 나노 입자의 광학적 밴드갭이 약 2.26eV이므로, 페로브스카이트 퀀텀닷층 은 약 548.6nm(=2.26eV) 이상 에너지를 갖는 광에 반응한다고 볼 수 있다. 페로브스카이트 퀀텀닷층은 흡 광도 피크 파장 부근부터 투과도가 급격히 증가하여, 약 550nm이상의 파장에서 약 80%의 투과도를 가짐을 알 수 있다. 수학식 1"}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, E는 포톤에너지, h는 플랑크 상수, c는 빛의 속도, λ는 파장이다. 도 3은 기존 시냅스 트랜지스터와 포토닉 시냅스 트랜지스터의 밴드 다이어그램을 예시적으로 나타낸 도면이다. 도 3을 참조하면, 밴드 다이어그램에 표시된 대로 게이트 전극층에 양의 바이어스가 인가됐을 때, IGZO 채 널층의 백채널 내 산소 결함으로 인하여 형성된 얕은 억셉터 같은 트랩 상태가 산소 분자에 의한 전자를 IGZO 채널층/유전체 계면, 즉, 프론트 채널에서 포획한다. 이 상태에서, 입사된 약 530nm(=2.34 e V)의 녹색광은 Hetero junction에 흡수되지만, IGZO 채널층의 밴드갭이 약 3.53eV로 퀀텀닷 나노 입자의 밴드갭 2.26eV보다 넓어, 전자-정공쌍은 생성되지 않으며, 퀀텀닷 나노 입자는, 녹색광에 반응하는 흡광도(도 2a 참조)로 인해, 광 여기되어 전자가 전도대로 올라간다. 퀀텀닷 나노 입자의 작은 강한 흡수 계수 및 작은 엑 시톤 결합 에너지로 인해 페로브스카이트 퀀텀닷층과 IGZO 채널층의 계면(p-n interface)에서 분리된 exciton 전자가 IGZO 채널층과 유전체의 계면 트랩 상태에 포획되기 때문에 일어나는 결과이다. 도 4a, 도 4b 및 도 4c는 포토닉 시냅스 트랜지스터의 전류-전압 특성을 예시적으로 도시한 도면이다. 도 4a는 페로브스카이트 퀀텀닷층을 포함하지 않는 기존 시냅스 트랜지스터의 전류-전압 곡선이며, 도 4b 및 도 4c는 페로브스카이트 퀀텀닷층을 포함한 포토닉 시냅스 트랜지스터(Optical-Electrical Synaptic Transistor; O-E ST)의 전류-전압 곡선이다. 도 4a 내지 도 4c의 전류-전압은 기존 시냅스 트랜지스터와 포토닉 시냅스 트랜지스터에 가시광을 1회 조사한 후 연속 측정했으며, 기존 시냅스 트랜지스터는 빛에 반응하지 않고 안정적으로 동작함을 확인할 수 있고, 퀀텀닷층 있는 소자는 빛에 반응하여 동작 변화가 있음을 확인할 수 있다. 도 4a에서, 화살표는 스윕 방향을 나타내며, 기존 시냅스 트랜지스터에서는 스윕 방향에 따른 전압 차이가 상대 적으로 작은 반면, 포토닉 시냅스 트랜지스터에서는 스윕 방향에 따른 전압 차이가 상대적으로 크다. 기존 시냅스 트랜지스터에 가시광을 1회 조사한 후, 8번 스윕하면서 측정한 결과, 거의 비슷한 전압 차이가 유지되며, 각 스윕별로 측정한 전류-전압 곡선도 실질적으로 일치한다. 반면, 도 4b에서, 가시광을 조사하기 전의 전류-전압 곡선에 비해, 가시광을 조사한 후 첫 번째 스윕에서 측정 된 전류-전압 곡선은 좌측으로 쉬프트되며, 두 번째 스윕에서는 첫 번째 스윕보다 더욱 좌측으로 쉬프트된다. 한편, 도 4c에서, 전류-전압 곡선은 3번째 이후 스윕부터는 다시 우측으로 쉬프트되기 시작하며, 8번째 스윕시 측정된 전류-전압 곡선은 가시광을 인가하기 전과 실질적으로 동일해진다.표 1 구분 파장(nm)μsat(cm2/Vs)Ion/off S.S (V/dec)VTH(V)△VTH (V)△Hysteresis(V) 기존Dark 1.371.09X107 0.21 7.20 0.09 2.6 530 1.288.43X106 0.26 7.60 0.07 3.2 O-E STDark 2.039.40X106 0.13 6.91 -0.42 6.9 530 2.281.20X107 0.46 -0.47 0.27 17.3 표 2 구분 응답성(A/W) 검출성(Jones) Linear dynamic range(LDR, dB) EQE(%) 기존1.28 X10-61.62 X109 3.83 0 O-E ST4.621.83 X1016 149.803.4 X103 표 1 및 표 2는 기존 시냅스 트랜지스터와 포토닉 시냅스 트랜지스터 O-E ST를 측정하여 전기적 및 광학적 성능 을 나타낸다. 기존 시냅스 트랜지스터는 약 530nm 빛의 자극이 가해졌을 때 hysteresis가 암흑 상태보다 0.6V 증가하였고, 이외의 값은 모두 미세하게 감소하였기에 전기적 특성 차이를 거의 보이지 않는다고 할 수 있다. 반면, 포토닉 시냅스 트랜지스터 O-E ST는 빛을 비췄을 때 암흑상태보다 왼쪽으로 그래프가 확연히 이동했다가 돌아오며 hysteresis가 약 10.4V나 증가했다. 또한 빛을 가했을 때 on/off ratio가 약 120% 가량 증가하였으며, subthreshold swing(S.S)도 0.33 V·dec-1 증가했다. 캐리어 이동도는 0.25 cm2·V-1·s-1, 문턱 전압 변화도 차이는 0.69V이다. 더불어 광학적 성능 확인을 통하여 기존 시냅스 트랜지스터에 비해 포토닉 시냅 스 트랜지스터 O-E STs가 약 530nm 파장의 빛에 민감하게 반응한다는 것을 알 수 있다. 특히 External quantum efficiency (EQE, IPCE)는 최댓값이 100%를 초과하여, 포토닉 시냅스 트랜지스터의 높은 광효율을 보여 주었다. 응답성(Responsivity; R)과 External quantum efficiency(EQE)는 다음과 같이 정의할 수 있다. 수학식 2"}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, Ilight는 광전류(A)이고, IDark는 암흑전류(A)이고, A는 유효 면적(cm2)이며, Plight은 광 세기이다. 한편, λ는 파장(nm)이고, j(λ는 광전류 밀도(A/cm2)이며, I(λ는 광 강도 밀도(W/cm2)이다. 도 5a 및 도 5b는 포토닉 시냅스 트랜지스터의 노멀라이즈 과도 응답 특성을 예시적으로 도시한 도면이다. 도 5a 및 도 5b를 참조하면, 약 530nm 파장의 가시광 펄스를 약 205.26μW/cm2 세기로 기존 시냅스 트랜지스터 와 포토닉 시냅스 트랜지스터에 조사했을 때의 노멀라이즈 과도 응답 특성을 나타낸다. 드레인 전압 VD는 약 10V이며, 게이트-소스 전압 VGS는 약 -0.6V이다. 도 5a에 예시된 바와 같이, 기존 시냅스 트랜지스터는 약 1 초의 펄스 폭(pulse width; PW) 및 펄스 간격(pulse interval; PI)을 가진 가시광 펄스를 조사하더라도 흥분성 포스트-시냅틱 전류(Excitatory Post-Synaptic Current, EPSC)에 변화가 발생하지 않는다. 반면, 도 5b에 예시 된 바와 같이, 동일한 가시광 펄스를 포토닉 시냅스 트랜지스터에 조사하면, EPSC가 상승하여, 가시광에반응함을 확인할 수 있다. 이를 통해 포토닉 시냅스 트랜지스터의 페로브스카이트 퀀텀닷층이 가시광 선에 반응하여 광전자가 생성돼 전류가 발생하고, IGZO의 oxygen vacancies로 인한 Paired pulse facilitation (PPF) 현상에 의해 서서히 증가하는 것을 알 수 있다. 도 6a, 도 6b, 도 6c 및 도 6d는 포토닉 시냅스 트랜지스터의 PPC 및 PPF 거동을 예시적으로 도시한 도면이다. 도 6a를 참조하면, 단일 가시광 펄스에 의한 포토닉 시냅스 트랜지스터의 PPC(Persistent Photoconductivity) 거동을 나타낸다. 드레인 전압 VD는 약 10V이며, 게이트-소스 전압 VGS는 약 -1.7V이다. 약 530nm 파장의 가시광 펄스를 약 205.26μW/cm2 세기로 포토닉 시냅스 트랜지스터에 조사하면, 드레인 전류값인 EPSC가 약 1.95 x 10-9A까지 상승하며, 이후 가시광 조사를 멈추면, 이온화된 산소 결핍이 중성화되면서 전류가 감소하는 PPC 거 동 현상이 발생한다. 도 6b를 참조하면, 도 6a에서와 동일한 조건하에서 가시광 펄스의 PW를 조절하면서 측정한 EPSC를 나타낸다. 기 사광 펄스의 PW가 증가하면 EPSC 역시 증가하는 경향을 확인할 수 있다. 도 6c를 참조하면, 연속 가시광 펄스에 의한 광 자극 시 PPF(Paired-Pulse Facilitation) 거동을 나타낸다. 드 레인 전압 VD는 약 10V이며, 게이트-소스 전압 VGS는 약 -0.6V이다. 가시광 펄스의 파장은 약 530nm이며, 세기는 약 205.26μW/cm2 이다. 가시광 펄스를 조사하기 전 초기 전류값으로 돌아가기 전에 연속적으로 가시광 펄스를 조사하면, 포토닉 시냅스 트랜지스터의 EPSC는 첫 번째 가시광 펄스를 조사했을 때보다 증가하여, 학습 효 과가 강해짐을 확인할 수 있다. PPF 거동은 가시광 펄스의 PI가 증가하면 약해진다. 도 6d를 참조하면, 연속된 2개의 가시광 펄스에 의한 EPSC 피크 A1과 A2 비율을 나타낸다. 가시광 펄스 간격을 1, 2, 3초로 하여 측정하면, 가시광 펄스의 PI가 증가할수록 비율이 감소하여, PPF 거동이 약해짐을 확인할 수 있다. 도 7a 및 도 7b는 복수 펄스 광 자극에 대한 포토닉 시냅스 트랜지스터의 자극 지속 시간 및 EPSC 변화 특성을 예시적으로 도시한 도면이다. 도 7a를 참조하면, 자극 지속 시간, 즉, 가시광 펄스를 인가하는 시간을 1,5, 10, 20, 40, 80초로 증가시킬 때 의 EPSC를 나타낸다. 자극 지속 시간이 증가할수록 EPSC 피크가 증가하며, 일정 시간 이후에도 EPSC가 상대적으 로 높은 값으로 지속된다. 한편, 도 7b를 참조하면, 가시광 펄스의 수를 1,5, 10, 20, 40, 80회 인가했을 때의 EPSC를 나타낸다. 도 7a와 유사하게, 인가된 가시광 펄스의 수가 증가할수록, EPSC 피크가 증가하며, 일정 시간 이후에도 EPSC가 상대적으로 높은 값으로 지속된다. 정리하면, 자극 지속 시간 및 인가된 펄스 수 중 어느 하나 가 증가하면, 포토닉 시냅스 트랜지스터는 단기 기억인 STP(short-term plasticity) 거동에서 장기 기억인 LTP(long-term plasticity) 거동으로 변화함을 알 수 있으며, 이는 PPF 거동에 의한 것이다. 도 8은 포토닉 시냅스 트랜지스터에 광 자극과 전압 펄스를 인가한 후 PPC 거동을 예시적으로 도시한 도면이다. 도 8을 참조하면, 쓰기와 삭제를 통한 생물의 기억과 망각 학습 과정 구현하기 위해서, 초기에 가시광 펄스를 PW=1 초, PI=1 초로 15 초 동안 인가한 후 10 번의 (a) 음 전압 스파이크, (b) 양 전압 스파이크를 포토닉 시냅 스 트랜지스터의 게이트에 인가한 결과를 나타낸다. 여기서, 전압 스파이크의 PI와 PW는 0.1 초이다. (a)에서, 포토닉 시냅스 트랜지스터의 게이트에 1 V를 계속 걸어 주다가 -5 V로 급격히 하강시키는 음 전 압 스파이크(△= - 6 V)를 인가하면, 포스트-시냅틱 전류(Post-Synaptic Current, PSC)가 상승한 후 점차 PPC 거동을 통해 전류가 감소한다. 한편, (b)에서, 1 V로 계속 걸다가 10 V로 급격히 상승시키는 양 전압 스파이크 (△= + 9 V)를 가하면 PSC가 하강하며 망각 현상이 더해지는 결과를 확인할 수 있다. 도 9은 하드웨어적으로 에뮬레이션한 Habenula 프로젝트 결과를 예시적으로 도시한 도면이다. Habenula 프로젝트는 실험 쥐를 대상으로 하는 측생돌기에 관련된 뇌의 조절 기제 실험으로, 본 발명에서는 흥 분성과 억제성 신경전달물질을 광전하와 전하 펄스 신호 자극에 각각 대응시켜 에뮬레이션하였다. 실험 쥐에게 는 창문을 열면 무조건 먹이를 주어, 창문만 열었을 때도 먹이를 기대하는 실험 쥐의 도파민이 상승한다. 먹이 를 기대하는 실험 쥐를 이용해 프로젝트 진행 시, 창문을 열어 보상인 먹이를 주는 행동을 하면 도파민이 더욱 상승하고, 주먹이라는 처벌을 가하면 도파민이 처음보다 떨어진다. 처벌과 보상을 반복하여 훈련시키면, 보상을 받을수록 창문을 연 직후의 도파민이 점차 상승하고, 처벌을 받을수록 창문을 연 직후의 도파민이 점차 감소한 다.도 9을 참조하면, 가시광 펄스는 창문을 여는 것, 양 전압 펄스는 처벌을, 음 전압 펄스는 보상을 상징한다. (a)에서, 단일 전기 자극만으로는 PSC가 쥐가 반응을 표현하는 도파민 임계점 2.0 nA에 도달하지 못함을 알 수 있다. 한편, (b)는 창문을 연 후 먹이를 주는 보상 실험으로, 처음으로 가시광 펄스만 인가했을 때 초기 전류 값은 약 40 μA이었으나, 음 전압 펄스 자극을 함께 주면 임계점인 2.0 nA를 쉽게 넘어 6.0 nA까지 도달함을 확 인할 수 있다. 반면, (c)는 창문을 연 후 때리는 처벌 실험으로, 초기 전류 값이 보상 실험 때보다 높음에도 불 구하고 양 전압 펄스 처벌 시 전류 값이 떨어져 도파민 임계점에 도달하기 어려움을 확인할 수 있다."}
{"patent_id": "10-2023-0064389", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타나며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0064389", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하에서, 본 발명은 첨부된 도면에 도시된 실시예를 참조하여 설명된다. 이해를 돕기 위해, 첨부된 전체 도면 에 걸쳐, 동일한 구성 요소에는 동일한 도면 부호가 할당되었다. 첨부된 도면에 도시된 구성은 본 발명을 설명 하기 위해 예시적으로 구현된 실시예에 불과하며, 본 발명의 범위를 이에 한정하기 위한 것은 아니다. 특히, 첨 부된 도면들은, 발명의 이해를 돕기 위해서, 일부 구성 요소를 다소 과장하여 표현하고 있다. 도면은 발명을 이 해하기 위한 수단이므로, 도면에 표현된 구성 요소의 폭이나 두께 등은 실제 구현시 달라질 수 있음을 이해하여 야 한다. 한편, 발명의 상세한 설명 전체에 걸쳐서 동일한 구성 요소는 동일한 도면 부호를 참조하여 설명된다. 도 1은 본 발명의 실시예에 따른 포토닉 시냅스 트랜지스터를 예시적으로 도시한 도면이다. 도 2a 및 도 2b는 포토닉 시냅스 트랜지스터에 적용한 페로브스카이트 퀀텀닷의 광 특성을 예시적으로 도시한 도면이다. 도 4a, 도 4b 및 도 4c는 포토닉 시냅스 트랜지스터의 전류-전압 특성을 예시적으로 도시한 도면이다. 도 5a 및 도 5b는 포토닉 시냅스 트랜지스터의 노멀라이즈 과도 응답 특성을 예시적으로 도시한 도면이다. 도 6a, 도 6b, 도 6c 및 도 6d는 포토닉 시냅스 트랜지스터의 PPC(Persistent Photoconductivity) 및 PPF(Paired-Pulse Facilitation) 거동을 예시적으로 도시한 도면이다. 도 7a 및 도 7b는 복수 펄스 광 자극에 대한 포토닉 시냅스 트랜지스터의 자극 지속 시간 및 EPSC 변화 특성을 예시적으로 도시한 도면이다. 도 8은 포토닉 시냅스 트랜지스터에 광 자극과 전압 펄스를 인가한 후 PPC 거동을 예시적으로 도시한 도면이다. 도 9은 하드웨어적으로 에뮬레이션한 Habenula 프로젝트 결과를 예시적으로 도시한 도면이다."}
