{"patent_id": "10-2024-0022040", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038129", "출원번호": "10-2024-0022040", "발명의 명칭": "Non-3GPP Access 환경에서 L4S를 지원하기 위한 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "배재현"}}
{"patent_id": "10-2024-0022040", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "Non-3GPP Access 기반의 통신 시스템에서 네트워크 엔티티(N3IWF)에 의하여 수행되는 방법으로서, L4S 지원 지시자 정보를 NGAP 초기 컨텍스트 설정 응답 메시지 내에 포함하여 AMF로 송신하는 동작;상기 AMF로부터 L4S 지원 지시자 정보를 포함하는 N2 PDU 세션 요청 메시지를 수신하는 동작;상기 N2 PDU 세션 요청 메시지에 기초하여 IPsec Child SA의 개수를 결정하는 동작; 및상기 IPsec Child SA를 수립하는 동작을 포함하는,방법."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 Non-3GPP Access를 고려한 통신 시스템에서 L4S를 지원하기 위한 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 상술한 것과 이동통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 효 과적으로 제공하기 위한 방안이 요구되고 있다. L4S(low latency, low loss and scalable throughput) 서비스는 중간 노드들 간의 별도의 제어 평면의 호처리 신호가 필요 없이 기존의 프로토콜 상에서 인 밴드(in-band) 마킹으로 L4S (ECN (explicit congestion notification)) 지원 여부 및 혼잡을 지시하는 신호를 전달하게 되는 장점으로 인하여, 많은 기기들 및 서버들 에서 지원되고 있다. 메타버스 및 XR 애플리케이션에서는, 비교적 많은 양의 업 링크 데이터가 전송되어야 하며, 네트워크 혼잡이 발 생할 경우, 네트워크 혼잡을 고려하여 업 링크의 전송률을 조정하는 방식이 적용될 수 있다. 이러한 L4S를 지원 하는 서비스가 Non-3GPP Access 환경에서 제공되기 위하여, L4S 서비스 관련 정보의 전달 및 동작 방법에 대한 기술 개선의 필요성이 있다."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 일 측면은, Non-3GPP Access를 포함하는 통신 시스템에서 혼잡 정보를 제공할 수 있는 장치 및 방법 이 제공하는 것을 일 목적으로 할 수 있다. 본 개시의 일 측면은, Non-3GPP Access 기반의 통신 시스템에서 L4S (ECN) 지원 여부에 기반하여 혼잡 정보를 제공하는 장치 및 방법을 제공하는 것을 일 목적으로 할 수 있다."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면에 따르면, Non-3GPP Access 기반의 통신 시스템에서 N3IWF (Non 3GPP Interworking Function) 엔티티가 수행하는 방법으로서, L4S 지원 지시자 정보를 NGAP 초기 컨텍스트 설정 응답 메시지 내에 포함하여 AMF로 송신하는 동작과, AMF로부터 L4S 지원 지시자 정보를 포함하는 N2 PDU 세션 요청 메시지를 수신 하는 동작과, N2 PDU 세션 요청 메시지에 기초하여 IPsec Child SA의 개수를 결정하는 동작 및 IPsec Child SA 를 수립하는 동작을 포함하는 방법. 본 개시의 일 측면에 따르면, Non-3GPP Access 기반의 통신 시스템에서 N3IWF (Non 3GPP Interworking Function) 엔티티의 동작 방법이 제공되고, 동작 방법은, 단말과 Non-3GPP AP (Access Point), N3IWF 간의 IPsec Tunnel에서 S-RAN에서 L4S(low latency, low loss and scalable throughput) 서비스가 지원되는지 여부 와 관련되는 정보를 포함하는 메시지를 수신하는 동작, IPsec 보안 연결 (SA, Security Associations) 이후 5G시스템 상에 단말 등록 (Registration) 요청시 해당 IPsec 보안 연결 구간에서 ECN 마킹 지원 지시자 (ECN marking supporting indication in Non-3gpp AP or ECN marking supporting indication in IPsec SA) 정보를 AMF를 통해 SMF로 전달하는 동작, L4S 서비스 지원 지시자 메시지에 기반하여, 세션 관리 기능(session management function: SMF) 엔티티로 N3IWF에서 L4S 서비스가 지원되는지 여부와 관련되는 정보를 포함하는 프 로토콜 데이터 유닛(protocol data unit: PDU) 세션 관리(session management: SM) 업데이트 요청 메시지를 송 신하는 동작, 및 PDU 세션 SM 업데이트 요청 메시지에 대한 응답으로, SMF 엔티티로부터 PDU 세션 SM 업데이트 응답 메시지를 수신하는 동작을 포함한다. 본 개시의 일 측면에 따르면, 통신 시스템에서 액세스 및 이동성 관리 기능(access and mobility management function: AMF) 엔티티가 제공되고, AMF 엔티티는 송수신기, 및 적어도 하나의 프로세서를 포함하며, 적어도 하 나의 프로세서는, 송수신기를 통해, 단말과 연결된 N3IWF로부터 N3IWF에서 L4S(low latency, low loss and scalable throughput) 서비스가 지원되는지 여부와 관련되는 정보를 포함하는 메시지를 수신하고, 세션 관리 기 능(session management function: SMF) 엔티티로 S-RAN에서 L4S 서비스가 지원되는지 여부와 관련되는 정보를 포함하는 프로토콜 데이터 유닛(protocol data unit: PDU) 세션 관리(session management: SM) 업데이트 요청 메시지를 송신하고, 및 PDU 세션 SM 업데이트 요청 메시지에 대한 응답으로, 송수신기를 통해, SMF 엔티티로부 터 PDU 세션 SM 업데이트 응답 메시지를 수신하도록 구성된다."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시 예에 따르면, 단말이 Non 3GPP Access 기반의 기지국을 이용하기 위하여 N3IWF의 검색 및 단 말과 Non 3GPP AP, N3IWF간의 IPsec SA 과정을 수행 중 UE 및 Non 3GPP AP, N3IWF간의 ECN 마킹 및 L4S 지원 여부를 판단하여 해당 ECN/L4S capability 정보를 단말 등록 과정 중 AMF를 통해 전달하거나 PDU Session 연결 요청 시 세션 관리 기능(session management function: SMF) 엔티티로 전달할 수 있다. N3IWF는 AF 등으로부터 L4S 지원 지시자가 전달될 경우 해당 L4S 서비스 지원을 위한 ECN 마킹이 N3IWF에서 수행될 경우 상향 링크 패 킷의 경우 IPsec 패킷의 Outer header의 정보를 바탕으로 Non 3GPP AP의 혼잡 상황 정보를 바탕으로 ECN 마킹을 수행할 수 있다. 또한 하향 링크의 경우 Non 3GPP AP의 혼잡 상황을 파악하기 위해 UE에서도 outer header의 CE 정보를 바탕으로 혼잡 상황 정보를 AS로 리포트 할 수 있다. 기본적으로 Non-3gpp 접속을 이용한 5G 시스템 접속을 위해서는 UE와 N3IWF 간의 IPsec Tunneling을 수행하여 UE가 해당 N3IWF의 사용을 위한 인가 및 보안 절차를 수행할 수 있다. Non-3gpp Access에서 ECN 마킹은 상향 링 크일 경우 UE 및 하향 링크일 경우 N3IWF의 ECN 정보를 포함하는 Inner IP header내의 ECN 정보와 각 데이터 전 송 시 Non-3gpp AP의 혼잡상황을 알려주는 Outer header의 ECN 정보로 구분할 수 있다. 일반적으로 IPsec Tunnel mode에서는 ECN capable connection의 경우 보안상의 이유로 inner header의 정보만 활용하는 limited- functionality과 outer header 정보까지 고려하는 full functionality 두가지 동작 방식으로 전달할 수 있다. 본 개시의 예시와 같이 N3IWF를 이용한 Non-3gpp Access의 경우 기본적으로 IPsec SA를 동작 수행 시 IKEv2 기 반의 키 교환 프로토콜을 활용하게 되는데 IKEv2 기반의 프로토콜로 연결된 ECN을 지원하는 IPsec SA의 경우 IPsec Tunnel에서 ECN functionality 동작 방식을 Full functionality를 기본적으로 지원할 수 있다. N3IWF와의 혼잡 상황 발생 정보를 QoS 모니터링을 통하여 사용자 평면 기능(user plane function: UPF) 엔티티 에 전달하여 UPF 엔티티에서 L4S (ECN) 마킹을 수행한 후 인-밴드 시그널링을 통해 애플리케이션 서버 (application server: AS)에게 혼잡 상황이 발생함을 알려 줄 수 있다. 이경우 N3IWF는 IPsec packet 내의 outer header의 ECN bit 정보를 활용하여 이를 바탕으로 Non 3gpp AP의 혼잡 정보 (congestion information)를 생성 및 이를 GTP-U 확장 헤더를 통해 UPF로 전달할 수 있다. 또한 혼잡 정보는 Non-3GPP AP 뿐만 아니라 N3IWF 에서도 발생할 수 있다. 이 경우 혼잡 정보를 생성 시 해당 정보가 하향링크 데이터 패킷에 대한 ECN 마킹일 경 우 IPsec 패킷의 Inner header의 ECN bit 정보를 상향링크 데이터 패킷에 대한 ECN 마킹 정보일 경우 Outer header의 ECN bit 정보를 UPF로 전달할 수 있다. 만약 혼잡 상황이 두 네트워크 엔티티 (N3IWF 및 Non 3gpp AP)에서 모두 발생할 경우 해당 혼잡 정보 내에는 congestion information from N3IWF 와 congestion information from Non 3gpp AP로 각각 구분하여 각 네트워크 엔티티 별 혼잡 정보를 별도로 전달할 수 있다. 또한 N3IWF는 해당 IPsec SA 연결 후 단말에서 PDU session 연결 요청 (PDU session Establishment Request) 메시지를 수신 후 이를 AMF를 통해 SMF로 전달하여 QoS 프로화일 및 관련 QFI, PDU session ID 및/또는 PDU session Establishment Accept 메시지를 AMF를 통해 전달받을 수 있다. N3IWF는 해당 정보를 바탕으로 QoS 별 IPsec Child SA의 개수를 결정할 수 있다. 이 때, AMF로부터 수신한 QoS 플로어들 중 L4S 지원 요청이 있는 QoS 플로어가 존재할 경우, N3IWF는 이를 고려한 IPsec Child SA 생성을 결정할 수 있다. 만약 일반적인 QoS 플로어들이 9개이며 L4S 서비스의 제공이 필요한 QoS 프로어가 1개 있음의 정보를 AMF로부터 수신한 경우, N3IWF는 일 반적인 QoS 플로어들은 IPSEC child SA#1로 하나의 IPsec SA를 이용하여 UE와 N3IWF사이의 IPsec 터널을 이용 하여 서비스할 수 있으며, L4S 서비스의 제공이 필요한 QoS 플로어의 경우 IPsec Child SA#2로 일반적인 IPsec Child SA 채널과 별도의 채널의 생성을 통해 서비스 이용을 결정할 수 있다. 위 예시와 같이 N3IWF는 보안적인 이유로 UE의 선택 또는 서비스 사업자의 선택에 따라 Non 3gpp Access를 이용한 서비스 중 ECN을 이용한 서비스 를 제공하지 않을 수 있다. 이 경우 N3IWF는 동일 UE로 연결되는 IPsec child SA는 일반적인 QoS 플로어를 전송 하는 IPsec Child SA와 ECN 마킹을 통해 L4S 서비스를 지원하는 QoS 플로어 최소 두개 이상의 IPsec Child SA 의 연결을 결정할 수 있다. 본 개시의 일 실시 예에 따르면, Non-3GPP Access 기반의 통신 시스템에서 L4S (ECN) 지원 여부에 기반하여 혼 잡 정보를 제공함으로써, Non-3GPP Access 기반의 통신 시스템에서 L4S 서비스를 지원할 수 있다."}
{"patent_id": "10-2024-0022040", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일 실시예를 첨부된 도면을 참조하여 상세히 설명한다. 본 개시를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어들로서 이 는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내 용을 토대로 내려져야 할 것이다. 마찬가지 이유로 첨부된 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성 요 소에는 동일한 참조 번호를 부여하였다. 이하, 기지국(base station: BS)은 단말의 자원 할당을 수행하는 주체로서, gNode B, eNode B, Node B, (또는 xNode B (여기서 x는 g, e를 포함하는 알파벳)), 무선 접속 유닛, 기지국 제어기, 위성 (satellite), 비행체 (airborn), 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말(user equipment: UE)은 MS (Mobile Station), 차량 (Vehicular), 위성 (satellite), 비행체 (airborn), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기 능을 수행할 수 있는 멀티미디어 시스템을 포함할 수 있다. 본 개시에서 하향링크(Downlink, DL)는 기지국이 단 말에게 전송하는 신호의 무선 전송 경로이고, 상향링크(Uplink, UL)는 단말이 기국에게 전송하는 신호의 무선 전송 경로를 의미한다. 추가적으로 단말이 또 다른 단말에게 전송하는 신호의 무선 전송 경로를 의미하는 사이 드링크(sidelink, SL)가 존재할 수 있다. 또한, 이하에서 LTE, LTE-A 또는 5G 시스템을 일 예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널형 태를 갖는 여타의 통신시스템에도 본 개시의 실시예가 적용될 수 있다. 예를 들어 5G 이동통신 기술(혹은 new radio, NR) 이후에 개발되는 5G-Advance 또는 NR-Advance 또는 6세대 이동통신 기술(6G)이 이에 포함될 수 있 으며, 이하의 5G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들 을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~ 부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들 은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또 한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 셀룰러 이동통신 표준을 담당하는 3GPP는 4G LTE 시스템에서 5G 시스템으로의 진화를 꾀하기 위해 새로운 코어 네트워크 (Core Network) 구조를 5G Core (5GC) 라는 이름으로 명명하고 표준화를 진행하고 있다. 5GC는 4G를 위한 네트워크 코어인 진화된 패킷 코어 (Evolved Packet Core: EPC) 대비 다음과 같은 차별화된 기능을 지원한 다. 5GC에서는 네트워크 슬라이스 (Network Slice) 기능이 도입된다. 5G의 요구 조건으로, 5GC는 다양한 종류의 단 말 타입 및 서비스를 지원해야 한다; e.g., 초광대역 이동 통신(enhanced Mobile Broadband: eMBB), 초고신뢰 저지연 통신 (Ultra Reliable Low Latency Communications: URLLC), 대규모 사물 통신 (massive Machine Type Communications: mMTC). 이러한 단말/서비스는 각각 코어 네트워크에 요구하는 요구조건이 다르다. 예를 들면, eMBB 서비스인 경우에는 높은 데이터 전송 속도 (data rate)를 요구하고 URLLC 서비스인 경우에는 높은 안정성 과 낮은 지연을 요구할 수 있다. 이러한 다양한 서비스 요구조건을 만족하기 위해 네트워크 슬라이스 (Network Slice) 기술이 제안되었다. 네트워크 슬라이싱은 하나의 물리적인 네트워크를 가상화(virtualization)하여 여러 개의 논리적인 네트워크들 (예를 들어 네트워크 슬라이스들)을 만드는 방법을 의미할 수 있다. 활성화된 네트워크 슬라이스는 네트워크 슬 라이스 인스턴스라 칭할 수 있고, 각 네트워크 슬라이스 인스턴스(network slice instance: NSI)는 서로 다른특성을 가질 수 있다. 이동통신 사업자는 각 NSI마다 그 특성에 맞는 네트워크 기능(network function: NF)을 구성함으로써 단말/서비스에 따른 다양한 서비스 요구조건을 만족시킬 수 있다. 예를 들어 이동통신 사업자는 각 단말마다 요구하는 서비스의 특성에 맞는 NSI를 할당하여 여러 5G 서비스들(예를 들어 eMBB, URLLC, 또는 mMTC)을 효율적으로 지원할 수 있다. 5GC는 이동성 관리 기능(mobility management function)과 세션 관리 기능(session management function)의 분 리를 통해 네트워크 가상화 패러다임 지원을 수월하게 할 수 있다. 4G LTE에서 모든 단말들은 등록, 인증, 이동 성 관리 및 세션 관리 기능을 담당하는 이동성 관리 엔티티(mobility management entity: MME) 라는 단일 코어 엔티티와의 시그널링 교환을 통해서 네트워크로부터 서비스를 제공받을 수 있다. 5G에서는 단말들(예를 들어 MTC 단말들을 포함)의 수가 폭발적으로 늘어나고 단말들의 타입에 따라 지원해야 하는 이동성 및 트래픽/세션 특성이 세분화됨에 따라 단일 엔티티(예를 들어 MME)에서 모든 기능들을 지원하게 되면 필요한 기능별로 엔티티 를 추가하는 확장성(Scalability)이 떨어질 수밖에 없다. 따라서, 제어 평면을 담당하는 코어 엔티티의 기능/구 현 복잡도와 시그널링 부하 측면에서 확장성 개선을 위해 이동성 관리 기능과 세션 관리 기능을 분리하는 구조 를 기반으로 다양한 기능들이 개발되고 있다. 본 개시에 따른 실시예들은 UE에서 non 3gpp access point를 통한 5GC로의 연결 위하여 untrusted 또는 trusted non 3gpp access에서 단말의 PDU set 수립 요청 절차를 지원하기 위한 방법 및 관련 동작을 수행하는 과정을 나타낼 수 있다. 구체적으로, 본 개시에 따른 실시예들은 네트워크에서 혼잡 상황 발생시 해당 혼잡 상 황 정보를 AS 또는 UE로 전달하여 적절한 혼잡 상황 제어를 위한 L4S 기반의 서비스를 지원하기 위한 방법 및 관련 동작을 나타낼 수 있다. 단말(UE)은 non-3gpp access 환경에서 5GC를 통한 서비스 이용을 위하여 단말의 등록 절차를 수행하기 위하여 UE와 N3IWF 사이에 IPsec SA 연결 동작을 수행할 수 있다. UE와 N3IWF 사이에 IPsec SA 연결 수립 절차 중 해당 IPsec SA의 ECN/L4S 지원 여부를 함께 판단할 수 있으며 이를 단말의 5GC 등 록 과정에서 AMF로 전달할 수 있다. 예를 들어, 해당 UE와 N3IWF 사이의 IPsec SA 연결 수립 중 만약 non-3gpp AP (access point)에서 ECN 마킹을 지원할 경우 해당 non-3gpp access point를 통하여 연결된 UE는 L4S 기반의 서비스를 지원 가능하다는 정보를 네트워크에 전달할 수 있다. 특정 non-3gpp access point를 통한 UE와 N3IWF 사이의 IPsec SA가 ECN을 지원한다는 정보는 5GC에 등록 절차를 통해 AMF에 먼저 저장될 수 있다. 그리고, 이후 PDU 세션 수립 요청을 UE로부터 전달받을 경우, 해당 PDU 세션 수립 절차 도중 해당 정보가 AMF로부터 SMF로 전 달될 수 있다. 또는 N3IWF에서 별도의 등록 절차 중 해당 IPsec SA가 ECN 지원 여부에 대한 정보를 AMF로 전달 하지 않았을 경우 UE는 해당 IPsec SA의 ECN/L4S 지원 여부를 별도의 지시자 (L4S support indication for IPsec SA) 등을 통해 PDU 세션 수립 요청 메시지 내에 포함하여 전송할 수 있다. 위 과정을 통해 SMF는 특정 non-3gpp access point를 통하여 연결된 UE와 N3IWF 사이의 IPsec SA가 L4S 서비스를 지원할 수 있음을 인지할 수 있다. 이후 non-3GPP access를 통한 서비스 이용 도중 AF를 통해 특정 QoS 플로어에 대한 L4S 지원 요청 정 보가 PCF로 전달될 경우 PCF는 PCC 규칙 업데이트 과정을 통해 특정 QoS 플로어의 L4S 서비스 지원 요청 정보를 SMF에 전달할 수 있다. SMF는 특정 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부를 기 설정된 정책 또 는 PDU 세션 수립 과정 중에 전달된 정보를 바탕으로 판단할 수 있다. SMF는 PDU session 수립 과정에서 AMF 또 는 UE로부터 IPsec SA의 ECN 지원 여부 정보를 전달받을 수 있으며 이를 바탕으로 AF에서 전달되는 특정 UE의 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부를 결정할 수 있다. 또한 SMF에서 특정 QoS 플로어의 L4S 서비스 지원 여부는 non-3gpp access를 통해 서비스를 이용하고 있는 UE와 연결되어 있는 N3IWF에서 혼잡 상황 에 대한 정보를 IP headers 내의 ToS 필드에 ECN bit를 직접 마킹 할 수 있는 경우, 또는 N3IWF에서 GTP-U 확 장 헤더를 통해 UPF로 혼잡 정보 (congestion information)을 전달할 수 있도록 GTP-U 확장 헤더 내에 혼잡 정 보의 마킹을 지원할 수 있을 경우에 기초하여 판단될 수 있다. SMF는 N3IWF에서 위 두 가지의 혼잡 정보의 전달 을 위한 마킹 방법 중 한가지 이상을 지원할 경우 해당 N3IWF에서 L4S 서비스 지원이 가능하다 판단할 수 있다. N3IWF의 혼잡 정보 전달을 위한 ECN 마킹 동작 지원 여부에 대한 정보에 대하여 SMF는 PDU 세션 수립 과정 중 N3IWF로부터 지원 가능한 마킹 방법들에 대한 정보를 전달받으므로 알 수 있다. SMF는 N3IWF의 혼잡 정보 마킹 지원 동작 정보 및 해당 QoS 플로어를 이용하는 UE와 N3IWF간의 IPsec SA에서 ECN/L4S 마킹을 지원함을 사전에 인지할 수 있으며 이를 바탕으로 AF로부터 전달되는 특정 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부 를 판단할 수 있다. SMF는 N3IWF가 IP 헤더 내에 혼잡 정보 발생에 대한 ECN 마킹을 하지 못하는 경우 혼잡 정보를 GTP-U 확장 헤더 내에 포함하여 이를 UPF로 전달할 수 있다. 이 때, SMF는 UPF에서 ECN 마킹을 수행할 수 있는지 여부를 판단하 여 만약 해당 기능을 UPF에서 지원하지 않는 경우 ECN 마킹 동작을 지원하는 UPF로 변경을 결정할 수 있다. SMF는 N3IWF의 혼잡 정보 전달 방법에 따라 UPF의 동작 및 IPsec SA의 ECN 마킹 지원 여부에 기초하여 AF에서 요청하는 특정 QoS 플로어의 L4S 지원여부를 판단할 수 있다. L4S를 지원하지 않는다고 판단되면, SMF는 해당 QoS 플로어에서 L4S 기반의 서비스를 이용하지 못함을 AF로 알려줄 수 있다. 도 1은 본 개시의 일 실시 예에 따른 5G 시스템의 네트워크 구조 및 인터페이스를 도시한 도면이다. 도 1의 5G 시스템의 네트워크 구조에 포함된 네트워크 엔티티(entity)는 시스템 구현에 따라 네트워크 기능 (network function: NF)를 포함할 수 있다. 도 1을 참조하면, 5G 시스템의 네트워크 구조는 다양한 네트워크 엔티티들을 포함할 수 있다. 일 예로, 5G 시스템은 인증 서버 기능(authentication server function: AUSF) 엔티티, 액세스 및 이동성 관리 기능((core) access and mobility management function: AMF) 엔티티, 세션 관리 기능(session management function: SMF) 엔티티, 정책 제어 기능(policy control function: PCF) 엔티티, 애플리 케이션 기능(application function: AF) 엔티티, 통합된 데이터 관리(unified data management: UDM) 엔 티티, 데이터 네트워크(data network: DN), 네트워크 노출 기능(network exposure function: NEF) 엔티티, 네트워크 슬라이싱 선택 기능(network slicing selection function; NSSF) 엔티티, 에지 애 플리케이션 서비스 도메인 저장소(edge application service domain repository: EDR), 에지 애플리케이션 서 버(edge application server: EAS), EAS 디스커버리 기능(EAS discovery function: EASDF), 사용자 평면 기능 (user plane function: UPF) 엔티티, (무선) 액세스 네트워크((radio) access network: (R)AN), 및 단말, 일 예로, 사용자 장치(user equipment: UE)를 포함할 수 있다. 5G 시스템의 각 NF 엔티티들은 다음과 같은 기능을 지원한다. AUSF는 UE의 인증을 위한 데이터를 처리하고 저장한다. AMF는 UE 단위의 접속 및 이동성 관리를 위한 기능을 제공하며, 하나의 UE 당 기본적으로 하나의 AMF에 연 결될 수 있다. 구체적으로, AMF는 3GPP 액세스 네트워크들 간의 이동성을 위한 CN 노드 간 시그널링, 무선 액세스 네트워크(radio access network: RAN) CP 인터페이스(즉, N2 인터페이스)의 종단(termination), NAS(non access stratum) 시그널링의 종단(N1), NAS 시그널링 보안(NAS 암호화(ciphering) 및 무결성 보호 (integrity protection)), AS 보안 제어, 등록 관리(등록 영역(registration area) 관리), 연결 관리, 아이들 모드 UE 접근성(reachability) (페이징 재전송의 제어 및 수행 포함), 이동성 관리 제어(가입 및 정책), 인트라 -시스템 이동성 및 인터-시스템 이동성 지원, 네트워크 슬라이싱의 지원, SMF 선택, 합법적 감청(lawful intercept)(AMF 이벤트 및 LI 시스템으로의 인터페이스에 대한), UE와 SMF 간의 세션 관리(session management: SM) 메시지의 전달 제공, SM 메시지 라우팅을 위한 트랜스패런트 프록시(transparent proxy), 액 세스 인증(access authentication), 로밍 권한 체크를 포함한 액세스 허가(access authorization), UE와 SMSF 간의 SMS 메시지의 전달 제공, 보안 앵커 기능(security anchor function: SAF) 및/또는 보안 컨텍스트 관리 (security context management: SCM) 등의 기능을 지원한다. AMF 엔티티의 일부 또는 전체의 기능들은 하 나의 AMF 엔티티의 단일 인스턴스(instance) 내에서 지원될 수 있다. DN은 예를 들어, 운영자 서비스, 인터넷 접속 또는 서드파티(3rd party) 서비스 등을 의미한다. DN은 UPF 엔티티로 하향링크 프로토콜 데이터 유닛(protocol data unit: PDU)을 전송하거나, UE로부터 전 송된 PDU를 UPF 엔티티로부터 수신한다. PCF 엔티티는 애플리케이션 서버로부터 패킷 흐름에 대한 정보를 수신하여, 이동성 관리, 세션 관리 등의 정책을 결정하는 기능을 제공한다. 구체적으로, PCF 엔티티는 네트워크 동작을 통제하기 위한 단일화된 정 책 프레임워크 지원, 제어평면 기능 엔티티(들)(예를 들어, AMF 엔티티, SMF 엔티티 등)이 정책 규칙을 시행할 수 있도록 정책 규칙 제공, 사용자 데이터 저장소(user data repository: UDR) 내 정책 결정을 위해 관련된 가 입 정보에 액세스하기 위한 프론트 엔드(front end) 구현 등의 기능을 지원한다. SMF 엔티티는 세션 관리 기능을 제공하며, UE가 다수 개의 세션을 가지는 경우 각 세션 별로 서로 다 른 SMF 엔티티에 의해 관리될 수 있다. 구체적으로, SMF 엔티티는 세션 관리(예를 들어, UPF 엔티티 와 (R)AN 노드 간의 터널(tunnel) 유지를 포함하여 세션 확립, 수정 및 해지), UE IP 주소 할당 및 관리 (선택적으로 인증 포함), UP 기능의 선택 및 제어, UPF 엔티티에서 트래픽을 적절한 목적지로 라우팅하기 위한 트래픽 스티어링(traffic steering) 설정, 정책 제어 기능(policy control functions)를 향한 인터페이스 의 종단, 정책 및 QoS(quality of service)의 제어 부분 시행, 합법적 감청(lawful intercept)(SM 이벤트 및 LI 시스템으로의 인터페이스에 대한), NAS 메시지의 SM 부분의 종단, 하향링크 데이터 통지(downlink data notification), AN 특정 SM 정보의 개시자(AMF 엔티티를 경유하여 N2를 통해 (R)AN에게 전달), 세션의 SSC (session and service continuity) 모드 결정, 로밍 기능 등의 기능을 지원한다. SMF 엔티티의 일 부 또는 전체의 기능들은 하나의 SMF 엔티티의 단일 인스턴스(instance) 내에서 지원될 수 있다. UDM 엔티티는 사용자의 가입 데이터, 정책 데이터 등을 저장한다. UDM 엔티티는 2개의 부분, 즉 애플 리케이션 프론트 엔드(front end: FE)(미도시) 및 사용자 데이터 저장소(user data repository: UDR)(미도시) 를 포함한다. FE는 위치 관리, 가입 관리, 자격 증명(credential)의 처리 등을 담당하는 UDM FE와 정책 제어를 담당하는 PCF 엔티티를 포함한다. UDR은 UDM-FE에 의해 제공되는 기능들을 위해 요구되는 데이터와 PCF 엔티티에 의해 요구되 는 정책 프로필을 저장한다. UDR 내 저장되는 데이터는 가입 식별자, 보안 자격 증명(security credential), 액 세스 및 이동성 관련 가입 데이터 및 세션 관련 가입 데이터를 포함하는 사용자 가입 데이터와 정책 데이터를 포함한다. UDM-FE는 UDR에 저장된 가입 정보에 액세스하고, 인증 자격 증명 처리(authentication credential processing), 사용자 식별자 핸들링(user identification handling), 액세스 인증, 등록/이동성 관리, 가입 관 리, SMS 관리 등의 기능을 지원한다. UPF 엔티티는 DN으로부터 수신한 하향링크 PDU를 (R)AN을 경유하여 UE에게 전달하며, (R)AN을 경유하여 UE로부터 수신한 상향링크 PDU를 DN으로 전달한다. 구체적으로, UPF 엔티티 는 인트라(intra)/인터(inter) RAT 이동성을 위한 앵커 포인트, 데이터 네트워크(Data Network)로의 상호 연결(interconnect)의 외부 PDU 세션 포인트, 패킷 라우팅 및 포워딩, 패킷 검사(inspection) 및 정책 규칙 시 행의 사용자 평면 부분, 합법적 감청(lawful intercept), 트래픽 사용량 보고, 데이터 네트워크로의 트래픽 플 로우의 라우팅을 지원하기 위한 상향링크 분류자(classifier), 멀티-홈(multi-homed) PDU 세션을 지원하기 위한 브랜치 포인트(branching point), 사용자 평면을 위한 QoS 핸들링(handling)(예를 들어 패킷 필터링, 게이팅 (gating), 상향링크/하향링크 레이트 시행), 상향링크 트래픽 검증 (서비스 데이터 플로우(service data flow: SDF)와 QoS 플로우 간 SDF 매핑), 상향링크 및 하향링크 내 전달 레벨(transport level) 패킷 마킹, 하향링크 패킷 버퍼링 및 하향링크 데이터 통지 트리거링 기능 등의 기능을 지원한다. UPF 엔티티의 일부 또는 전체 의 기능들은 하나의 UPF의 단일 인스턴스(instance) 내에서 지원될 수 있다. AF 엔티티는 서비스 제공(예를 들어, 트래픽 라우팅 상에서 애플리케이션 영향, 네트워크 능력 노출 (network capability exposure)에 대한 접근, 정책 제어를 위한 정책 프레임워크와의 상호동작 등의 기능을 지 원)을 위해 3GPP 코어 네트워크와 상호 동작한다. (R)AN은 4G 무선 액세스 기술의 진화된 버전인 진화된 E-UTRA(evolved E-UTRA)와 새로운 무선 액세스 기 술(new radio: NR)(예를 들어, gNB)을 모두 지원하는 새로운 무선 액세스 네트워크를 총칭한다. gNB은 무선 자원 관리를 위한 기능들(즉, 무선 베어러 제어(radio bearer control), 무선 허락 제어(radio admission control), 연결 이동성 제어(connection mobility control), 상향링크/하향링크에서 UE에게 자원의 동적 할당(dynamic allocation of resources)(즉, 스케줄링)), IP(internet protocol) 헤더 압축, 사용자 데이 터 스트림의 암호화(encryption) 및 무결성 보호(integrity protection), UE에게 제공된 정보로부터 AMF로의 라우팅이 결정되지 않는 경우, UE의 어태치(attachment) 시 AMF의 선택, UPF(들)로의 사용자 평면 데이터 라우 팅, AMF로의 제어 평면 정보 라우팅, 연결 셋업 및 해지, 페이징 메시지의 스케줄링 및 전송(AMF로부터 발생 된), 시스템 브로드캐스트 정보의 스케줄링 및 전송(AMF 또는 운영 및 유지(operating and maintenance: O&M) 로부터 발생된), 이동성 및 스케줄링을 위한 측정 및 측정 보고 설정, 상향링크에서 전달 레벨 패킷 마킹 (transport level packet marking), 세션 관리, 네트워크 슬라이싱의 지원, QoS 흐름 관리 및 데이터 무선 베 어러로의 매핑, 비활동 모드(inactive mode)인 UE의 지원, NAS 메시지의 분배 기능, NAS 노드 선택 기능, 무선 액세스 네트워크 공유, 이중 연결성(dual connectivity), NR과 E-UTRA 간의 밀접한 상호동작(tight interworking) 등의 기능을 지원한다. UE는 사용자 기기를 의미한다. 사용자 장치는 단말(terminal), ME(mobile equipment), MS(mobile station) 등의 용어로 언급될 수 있다. 또한, 사용자 장치는 노트북, 휴대폰, PDA(personal digital assistant), 스마트폰, 멀티미디어 기기 등과 같이 휴대 가능한 기기일 수 있고, 또는 PC(personal computer), 차량 탑재 장치와 같이 휴대 불가능한 기기일 수도 있다. NEF는 3GPP 네트워크 기능들에 의해 제공되는, 예를 들어, 제3자(3rd party), 내부 노출(internal exposure)/재노출(re-exposure), 애플리케이션 기능, 에지 컴퓨팅(Edge Computing)을 위한 서비스들 및 능력들 을 안전하게 노출하기 위한 수단을 제공한다. NEF는 다른 NF(들)로부터 (다른 NF(들)의 노출된 능력(들)에기반한) 정보를 수신한다. NEF는 데이터 저장 네트워크 기능으로의 표준화된 인터페이스를 이용하여 구조 화된 데이터로서 수신된 정보를 저장할 수 있다. 저장된 정보는 NEF 엔티티에 의해 다른 NF 엔티티(들) 및 AF 엔티티(들)에게 재노출(re-expose)되고, 분석 등과 같은 다른 목적으로 이용될 수 있다. EASDF은 FQDN 별로, 단말의 DNS 요청을 포워딩할 DNS 서버의 주소, 단말의 DNS 요청을 포워딩할 때 추가해야하 는 IP 서브네트 주소로 표현될 수 있는 ECS option을 추가할 수 있는 NF이다. EASDF는 EDR로부터 EAS 도메인 설 정 정보를 수신 받고, 수신 받은 정보에 따라서, 단말로부터 수신한 DNS 요청 메시지에 대한 처리를 수행한다. 또한, EASDF는 SMF로부터 단말 IP 주소 및 단말의 3GPP 내에서의 위치 정보 및 DNS 메시지 처리 규칙 및 DNS 메시지 보고 규칙을 수신 받고, 단말로부터 수신한 DNS Query 메시지, DNS 서버로부터 수신한 DNS 응답 메 시지를 처리하고, DNS 메시지 보고 규칙에 따라서, SMF에게 DNS 메시지 내의 정보 및 이를 가공한 통계 정 보를 SMF에 전송하는 기능을 수행하는 NF이다. NRF는 서비스 디스커버리 기능을 지원한다. NF 인스턴스로부터 NF 디스커버리 요청 수신하고, 발견된 NF 인스턴 스의 정보를 NF 인스턴스에게 제공한다. 또한, 이용 가능한 NF 인스턴스들과 그들이 지원하는 서비스를 유지한 다. 한편, 도 1에서는 설명의 편의상 UE가 하나의 PDU 세션을 이용하여 하나의 DN에 엑세스하는 경우에 대한 참조 모델을 예시하나, 본 개시는 이에 한정되지 않는다. UE는 다중의 PDU 세션을 이용하여 2개의(즉, 지역적(local) 그리고 중심되는(central)) 데이터 네트워크에 동시에 액세스할 수 있다. 이때, 서로 다른 PDU 세션을 위해 2개의 SMF들이 선택될 수 있다. 다만, 각 SMF는 PDU 세션 내 지역적인 UPF 및 중심되는 UPF를 모두 제어할 수 있는 능력을 가질 수 있다. 또한, UE는 단일의 PDU 세션 내에서 제공되는 2개의(즉, 지역적인 그리고 중심되는) 데이터 네트워크에 동 시에 액세스할 수도 있다. 3GPP 시스템에서는 5G 시스템 내 NF들 간을 연결하는 개념적인 링크를 참조 포인트(reference point)라고 정의 한다. 일 예로, 도 1의 5G 시스템에 포함된 참조 포인트(들)은 다음과 같다. - N1: UE와 AMF간의 참조 포인트 - N2: (R)AN과 AMF간의 참조 포인트 - N3: (R)AN과 UPF간의 참조 포인트 - N4: SMF와 UPF간의 참조 포인트 - N5: PCF와 AF간의 참조 포인트 - N6: UPF와 DN간의 참조 포인트 - N7: SMF와 PCF간의 참조 포인트 - N8: UDM과 AMF간의 참조 포인트 - N10: UDM과 SMF간의 참조 포인트 - N11: AMF와 SMF간의 참조 포인트 - N12: AMF와 AUSF간의 참조 포인트 - N13: UDM과 AUSF간의 참조 포인트 - N14: 2개의 AMF들 간의 참조 포인트 - N15: 비-로밍 시나리오의 경우, PCF와 AMF간의 참조 포인트, 로밍 시나리오의 경우 방문 네트워크(visited network) 내 PCF와 AMF 간의 참조 포인트 - Nx: SMF와 EASDF간의 참조 포인트 - Ny: NEF(EDF)와 EASDF간의 참조 포인트 도 2는 본 개시의 일 실시 예에 따른 UE의 untrusted Non-3GPP Access를 통한 5GC 등록 과정을 나타낸다. 보다 상세하게는, 도 2는 5GC 등록 과정 중 UE와 N3IWF사이의 IPsec SA에서 ECN/L4S 지원 여부를 네트워크에 전달하 는 동작을 도시한다. 도2를 참조하면, N3IWF는 Non-3GPP access로 연결된 UE를 IKEv2/IPsec 프로토콜 및 N2 인터페이스 연동을 통하 여 5G Core Network에 연결되도록 할 수 있다. UE와 N3IWF 사이에는 별도의 보안 및 인증 절차를 통해 IPsec SA 연결 수립을 할 수 있다. 이 때 보안 및 인증 절차를 위해 사용하는 메시지 프로토콜이 IKE(Internet Key Exchange) v2 프로토콜이다. 기존의 UE와 NG-RAN 사이의 구조와 다르게 non-3gpp access에서는 UE와 N3IWF 사 이에는 Non-3gpp Access point(e.g. wifi)가 추가될 수 있다. UE는 N3IWF와의 Non-3gpp access point를 통해 데이터를 주고받을 수 있게 되는데, 이 때 IPsec의 구조에 따라 기존 N3IWF로 전달된 IP header 및 payload를 Inner IP packet으로 정의할 수 있다. IPsec Tunnel mode에서는 해당 Inner IP packet을 페이로드로 하는 추가 적인 outer IP packet을 정의할 수 있다. 즉, IPsec SA 구간에서는 outer IP packet을 생성하여 이를 non-3gpp access point를 통해 UE로 전달할 수 있다. 예를 들어, 상향링크일 경우 UE에서 전송하는 IP packet이 Inner IP packet으로 outer IP packet의 페이로드에 포함되어 전송될 수 있다. 이와 같이 non-3gpp AP는해당 non- 3gpp access 구간의 혼잡 상황 정보를 outer IP packet의 header를 통해 UE 또는 N3IWF로 전달할 수 있다. 이 와 같이 IPsec SA 연결 수립 과정 중 해당 UE 및 non-3gpp AP, N3IWF의 ECT (ECN Capable Transport) 정보를 IP header를 통해 주고받을 수 있고, 이를 바탕으로 해당 IPsec SA의 ECN marking 및 L4S 서비스 지원 여부가 SMF에서 판단될 수 있다. Non-3gpp access 기반의 IPsec SA는 IKEv2를 이용하여 인증 및 보안 메시지를 주고받 을 수 있다. 이때, IPsec SA에서 ECN 또는 L4S를 지원할 경우 이는 outer IP header에도 Non-3gpp access 구간 의 혼잡 정보를 추가할 수 있는 full-functionality를 지원할 수 있다. UE와 N3IWF 사이의 IPsec SA가 ECN을 지원한다는 정보는 5GC 등록 절차를 통해 AMF에 먼저 저장될 수 있고, 이 후 PDU 세션 수립 요청을 UE로부터 전달 받을 경우 해당 PDU 세션 수립 절차 중에 해당 정보가 AMF로부터 SMF로 전달될 수 있다. 또는 N3IWF에서 별도의 등록 절차 중 해당 IPsec SA가 ECN 또는 L4S 지원 여부에 대한 정보를 AMF로 전달하지 않았을 경우, UE는 해당 IPsec SA의 ECN/L4S 지원 여부에 대한 정보를 별도의 지시자 (L4S support indication for IPsec SA) 등을 통해 PDU 세션 수립 요청 메시지 내에 포함하여 SMF로 전송할 수 있다. SMF는 특정 non-3gpp AP를 통하여 연결된 UE와 N3IWF 사이의 IPsec SA를 통해 L4S 서비스를 지원할 수 있음을 인지할 수 있다. non-3GPP access를 통한 서비스 이용 도중 AF를 통해 특정 QoS 플로어에 대한 L4S 지원 요청 정보가 PCF로 전달 될 경우, PCF는 PCC 규칙 업데이트 과정을 통해 특정 QoS 플로어의 L4S 서비스 지원 요청 정보를 SMF에 전달할 수 있다. SMF는 특정 QoS 플로어의 L4S 서비스 지원 요청의 수락 여부를 기 설정된 정책 또는 PDU 세션 수립 과 정 중에 전달된 정보를 바탕으로 판단할 수 있다. SMF는 PDU session 수립 과정에서 AMF 또는 UE로부터 IPsec SA의 ECN 지원 여부 정보를 전달받을 수 있으며, 이를 바탕으로 AF에서 전달되는 특정 UE에 대한 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부를 결정할 수 있다. 또한 SMF는 특정 QoS 플로어의 L4S 서비스 지원 요 청에 대한 수락 여부에 대하여 N3IWF가 아래 조건을 만족하는지 여부에 기초하여 판단할 수 있다. N3IWF에서 혼 잡 상황에 대한 정보를 IP headers 내의 ToS 필드의 ECN bit 내 마킹 할 수 있거나, N3IWF에서 GTP-U 확장 헤 더내 혼잡 정보 (congestion information)를 마킹하여 UPF로 전달할 수 있다면, N3IWF는 L4S 서비스를 지원할 수 있다고 판단될 수 있다. 또한, non-3gpp access를 통한 서비스를 이용할 경우, SMF는 N3IWF가 혼잡 정보의 전달을 위한 마킹 방법 중 한가지 이상을 지원하고, 해당 N3IWF와 UE 사이의 IPsec SA 구간에서 ECN/L4S 서비스 지원 (ECN capable)이 가능할 때, non-3gpp access를 이용한 해당 QoS 플로어의 L4S 서비스 지원 요청에 대하 여 수락 여부를 판단할 수 있다. SMF에서 N3IWF의 혼잡 정보 전달을 위한 마킹 동작들 (IP header marking or GTP-U HE marking)에 대한 정보는 PDU 세션 수립 과정 중 N3IWF로부터 전달받을 수 있다. SMF는 N3IWF의 혼잡 정보 마킹 지원 동작 정보 및 혼잡 정보 마킹 지원 동작에 따른 UPF에서 IP header 내 ECN bit 마킹을 위한 동작 지원 여부, 해당 QoS 플로어에 대 하여 IPsec SA의 ECN/L4S 지원 여부에 대한 정보를 바탕으로 특정 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부를 결정할 수 있다. 도 3은 본 개시의 일 실시 예에 따른 AF에서 untrusted Non-3GPP Access를 통한 서비스 중인 QoS 플로어에 대 한 L4S 서비스 지원 요청에 따른 N3IWF의 동작을 도시한 도면이다.도2와 같이 UE와 N3IWF 사이의 IPsec SA 연결 수립 시 해당 IPsec SA에서 ECN/L4S를 지원할 수 있다는 정보는 UE의 N3IWF를 통한 5GC 등록 절차 중 AMF에 저장될 수 있다. 그리고, 이후 PDU 세션 수립 요청 과정 수행 중 AMF에 저장된 IPsec SA의 ECN/L4S의 지원 여부 정보가 SMF로 전달될 수 있다. 또는 IPsec SA의 ECN/L4S의 지원 여부 정보를 5GC 등록 절차를 통해 전달하지 않고, UE가 해당 IPsec SA의 ECN/L4S 지원 여부에 대한 별도의 지 시자 (L4S support indication for IPsec SA)를 PDU 세션 수립 요청 메시지 내에 포함하여 SMF로 전송할 수 있 다. 이를 통해 SMF는 특정 non-3gpp AP를 통한 UE와 N3IWF 사이의 IPsec SA를 통해 L4S 서비스를 지원할 수 있 음을 인지할 수 있다. non-3GPP access를 통한 서비스 이용 도중 AF를 통해 특정 QoS 플로어에 대한 L4S 지원 요청 정보가 PCF로 전달 될 경우, PCF는 PCC 규칙 업데이트 과정을 통해 특정 QoS 플로어의 L4S 서비스 지원 요청 정보를 SMF에 전달할 수 있다. SMF는 특정 QoS 플로어의 L4S 서비스 지원 요청의 수락 여부를 기 설정된 정책 또는 PDU 세션 수립 과 정 중에 전달된 정보를 바탕으로 판단할 수 있다. SMF는 PDU session 수립 과정에서 AMF 또는 UE로부터 IPsec SA의 ECN 지원 여부 정보를 전달받을 수 있으며, 이에 기초하여 AF에서 전달되는 특정 UE의 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부를 결정할 수 있다. 또한 SMF의 특정 QoS 플로어의 L4S 서비스 지원 요청에 대한 수락 여부는 N3IWF에서 아래 조건을 만족하는지 여부에 기초하여 판단될 수 있다. N3IWF에서 혼잡 상황에 대한 정보를 IP headers 내의 ToS 필드에 ECN bit내 직접 마킹 할 수 있거나, N3IWF에서 GTP-U 확장 헤더내 혼 잡 정보 (congestion information)를 마킹하여 UPF로 전달할 수 있는 경우, N3IWF는 L4S 서비스를 지원할 수 있다고 판단될 수 있다. 또한 non-3gpp access를 통한 서비스를 이용할 경우, SMF는 N3IWF에서 혼잡 정보의 전 달을 위한 마킹 방법 중 한가지 이상을 지원하는 동시에 해당 N3IWF와 UE 사이의 IPsec SA 구간에서도 ECN/L4S 서비스 지원 (ECN capable)이 가능할 때, non-3gpp access를 이용한 해당 QoS 플로어의 L4S 서비스 요청에 대 한 수락 여부를 판단할 수 있다. SMF는 N3IWF의 혼잡 정보 전달을 위한 마킹 동작들 (IP header marking or GTP-U HE marking)에 대한 정보에 대해 PDU 세션 수립 과정 중 N3IWF로부터 전달받을 수 있다. SMF는 N3IWF의 혼잡 정보 마킹 지원 동작 정보 및 혼잡 정보 마킹 지원 동작에 따른 UPF에서 IP header 내 ECN bit 마킹을 위한 동작 지원 여부 및/또는 해당 QoS 플로어에 대한 IPsec SA의 ECN/L4S 지원 여부에 대한 정보를 바탕으로 특정 QoS 플로어의 L4S 서비스 지원 요청 에 대한 수락 여부를 결정할 수 있다. SMF로부터 L4S 서비스 지원 지시자 (L4S support indication) 또는 L4S 서비스 지원을 위한 혼잡 정보 마킹 요 청 정보를 전달받은 N3IWF는 L4S 서비스 지원을 요청 받은 QoS 플로어가 어떤 IPsec child SA에 포함되어 있는 지를 파악한 뒤 해당 IPsec child SA가 ECN/L4S를 지원하도록 설정이 되어 있으면 현재의 IPsec child SA 상에 서 ECN/L4S 마킹을 통한 L4S 서비스 지원을 수행할 수 있다. 하지만 L4S 서비스 지원을 요청 받은 특정 QoS 플 로어가 ECN을 지원하지 않는 IPsec child SA에 포함되어 있으면, N3IWF는 해당 QoS 플로어를 위해 별도의 ECN을 지원하는 IPsec child SA가 있을 경우 해당 IPsec child SA로 이동하거나, 별도의 IPsec child SA가 없을 경우 IPsec child SA의 연결 요청을 UE에 전달하여 ECN을 지원하는 IPsec child SA을 새로 연결하는 동작을 수행하도 록 할 수 있다. N3IWF에서 L4S 서비스 지원을 위하여 QoS 플로어에 대해 별도의 IPsec child SA를 연결하는 동 작은, UE로부터 PDU 세션 수립 요청 시 PCF에서 특정 QoS 플로어 관련 기 설정된 파라미터에 기초하여 해당 동 작을 수행을 하거나 서비스 이용 도중 AF에서 별도로 특정 QoS플로어의 L4S 서비스 지원 지시자 정보 등을 포함 하는 PDU 세션 변경 요청에 따라 동작 여부를 결정할 수 있다. 이후, N3IWF는 ECN 지원을 위한 새로운 IPsec SA 연결을 수립한 이후 L4S 서비스의 지원을 요청 받은 QoS 플로 어를 해당 IPsec SA로 리소스를 이동시키고, 단말에서도 ECN/L4S 동작 수행이 필요함을 알려주기 위하여 L4S support indication 정보를 별도로 UE에게 전달하거나 새로운 IPsec SA 연결 수립 시 정책 정보를 UE에게 전달 할 수 있다. 도 4A 및 도4B는 본 개시의 일 실시 예에 따른 untrusted Non-3GPP Access를 통한 5GC 등록 및 PDU 세션 연결 과정 중 IPsec SA의 ECN capability 정보를 SMF에 전달하는 동작을 나타낸다. 동작 401에서, 단말은 N3WIF와 IPsec SA 연결 수립 및 5GC 등록을 위한 요청 메시지를 전송할 수 있다. UE는 untrusted non-3gpp Access network에서 수신한 정보를 바탕으로 N3IWF 및 관련 IP 주소 등을 포함하는 정보를 수신할 수 있다. 이후 UE는 untrusted non-3gpp access network에서 수신한 정보를 바탕으로 N3IWF를 선택 및 선택된 N3IWF의 IP 주소 정보를 얻을 수 있다. 이후 UE는 IKE 초기 교환을 시작하여 선택한 N3IWF와 IPsec 보안 연결(SA) 설정을 진행할 수 있다. 이후 모든 후속 IKE 메시지는 이 동작에서 설정된 IKE SA를 사용하여 암호화되고 무결성이 보호될 수 있다. UE는 IKE_AUTH 요청 메시지를 전송하여 IKE_AUTH 교환을 시작할 수 있다. N3IWF 는 EAP-Request/5G-Start 패킷을 포함하는 IKE_AUTH 응답 메시지로 응답할 수 있다. EAP-Request/5G-Start 패 킷은 UE에게 EAP-5G 세션을 시작하라고 알릴 수 있다. UE는 액세스 네트워크 매개변수(AN parameter) 및 등록 요청 메시지를 포함하는 EAP-Response/5G-NAS 패킷을 포함하는 IKE_AUTH 요청을 전송할 수 있다. AN 파라미터에 는 5G 코어 네트워크에서 AMF를 선택하기 위해 N3IWF에서 사용하는 정보가 포함될 수 있다. 이 정보에는 GUAMI, 선택된 PLMN ID, 요청된 NSSAI 및 Establishment cause 등이 포함될 수 있다. Establishment cause는 5GC와의 시그널링 연결을 요청하는 이유를 제공할 수 있다. UE가 요청된 NSSAI를 AN parameter의 일부로 포함하는지 여 부와 방법은 액세스 계층 연결 설정 NSSAI 포함 모드 파라미터의 값에 따라 다를 수 있다. 등록 요청은 UE가 untrusted non-3GPP access를 통해 사용하고자 하는 슬라이스에 기반하여 UE의 N3IWF 선택을 지원한다는 표시를 포함할 수 있다. N3IWF는 수신된 AN 파라미터 및 로컬 정책을 기반으로 AMF를 선택할 수 있다. 이후 N3IWF는 UE 로부터 받은 등록 요청을 N2 메시지를 통해 선택된 AMF로 전달할 수 있다. 선택된 AMF는 UE에게 NAS Identity Request 메시지를 전송하여 SUCI를 요청하기로 결정할 수 있다. 이 NAS 메시지와 모든 후속 NAS 메시지는 EAP/5G-NAS 패킷 내에 보호되어 UE로 전송될 수 있다. AMF는 AUSF를 이용하여 UE를 인증하기로 결정할 수 있다. AMF는 NAS 보안을 활성화하기 위해 NAS 보안 모드 명령 (NAS Security Mode Command) 을 UE로 전송할 수 있다. NAS 보안 모드 명령 메시지를 받은 N3IWF는 이를 EAP/5G-NAS 패킷 안에 포함하여 UE로 전달할 수 있다. UE는 EAP-AKA' 인증을 완료하고 NAS 보안 컨텍스트와 N3IWF 키를 생성하고 NAS 보안 모드 완료 메시지를 포함하는 EAP/5G-NAS 패킷을 전송할 수 있다. N3IWF는 NAS 보안 모드 완료 메시지를 AMF로 전달할 수 있다. AMF는 NAS 보안 모드 완료를 수신하면 N3IWF 키를 포함하는 NGAP 초기 컨텍스트 설정 요청 메시지를 N3IWF로 전송할 수 있 다. 이를 통해 N3IWF가 EAP-Success를 UE로 전송하도록 트리거하여 EAP-5G 세션을 완료하고 더 이상 EAP-5G 패 킷이 교환되지 않도록 할 수 있다. UE에서 생성되고 N3IWF가 수신한 공통 N3IWF 키를 사용하여 UE와 N3IWF 간에 IPsec SA가 수립될 수 있다. 시그널링 IPsec SA 수립 후, N3IWF는 NGAP 초기 컨텍스트 설정 응답을 AMF에 전송 (402 동작)하여 AN 보안을 포함하는 UE 컨텍스트(Context)가 생성되었음을 알릴 수 있다. 시그널링 IPsec SA는 터널 모드에서 작동하도록 구성되어야 하며 N3IWF는 UE에 \"내부 (Inner)\" IP 주소를 할당할 수 있다. UE와 N3IWF 간에 교환되는 모든 후속 NAS 메시지는 시그널링 IPsec SA를 통해 전송되고 TCP/IP를 통해 전달될 수 있 다. UE는 소스 주소가 UE의 \"내부\" IP 주소이고 대상 주소가 NAS_IP_ADDRESS인 TCP/IP 패킷 내에서 NAS 메시지 를 보낼 수 있다. 유사하게 N3IWF는 소스 주소가 NAS_IP_ADDRESS이고 대상 주소가 UE의 \"내부\" IP 주소인 TCP/IP 패킷 내에서 NAS 메시지를 보낼 수 있다. UE와 N3IWF 간의 신뢰할 수 있는 NAS 전송에 사용되는 TCP 연 결은 시그널링 IPsec SA가 설정된 직후 UE에 의해 시작될 수 있다. AMF는 가입된 S-NSSAI(들)에 의해 허용된 요 청된 NSSAI를 결정할 수 있다. AMF는 N3IWF로 전송되는 N2 메시지에 NAS 등록 승인 메시지를 전송할 수 있다. N2 메시지에는 UE의 액세스 유형에 대한 Allowed NSSAI가 포함될 수 있다. Allowed NSSAI는 선택한 N3IWF에서 지원하는 슬라이스의 일부일 수 있다. N3IWF는 시그널링 IPsec SA 통해 UE에게 NAS 등록 수락 메시지를 전달할 수 있다. 동작 402에서, N3IWF에서 IPsec SA 수립 과정 중 해당 IPsec SA의 ECN/L4S 지원 여부를 알 수 있을 경우 ECN/L4S 지원 지시자 정보를 NGAP 초기 컨텍스트 설정 응답 메시지 내에 포함하여 AMF로 전달할 수 있다. 동작 403에서, UE는 S-NSSAI(s), UE Requested DNN, PDU Session ID, Request type, Old PDU Session ID 및/ 또는 PDU Session Establishment Request를 포함하는 N1 SM container 등을 NAS 메시지를 이용하여 AMF로 전달 할 수 있다. PDU Session Establishment Request는 PDU session ID, 요청하는 PDU 세션 타입, 요청하는 SSC mode, 5GSM Capability, PCO, SM PDU DN Request Container 및/또는 L4S support indication 또는 ECN capable IPsec SA indication 정보 등을 포함할 수 있다. 만약 동작 402에서 5GC 등록 과정 중 N3IWF가 ECN 또 는 L4S 지원 지시자 정보를 AMF로 보냈을 경우 동작 403에서 별도의 ECN 또는 L4S 지원 지시자 정보를 포함하지 않을 수 있다. 동작 404 및 동작 405에서, AMF는 SMF를 선택 후 L4S support indication 또는 ECN capable IPsec SA indication 정보 등을 포함하는 PDU 세션 관련 세션 관리 컨텍스트 생성 요청 메시지 (Nsmf_PDUSession_CreateSMContext Request)를 SMF로 전송할 수 있다. 동작 406에서, SMF는 상기 동작 405를 통해 AMF로부터 수신한 L4S support indication 또는 ECN capable IPsec SA indication 정보 등을 포함하는 PDU 세션 관련 세션 관리 컨텍스트 생성 요청 메시지를 바탕으로 SM 컨텍스 트를 생성하고 SM 컨텍스트 ID를 PDU 세션 관련 세션 관리 컨텍스트 생성 요청 응답 (Nsmf_PDUSession_CreateSMContext Request response) 메시지를 통해 AMF로 전달할 수 있다. 동작 407에서 SMF는 SUPI 등의 정보를 바탕으로 PCF 선택 과정을 통해 PCF를 선택할 수 있다. 동작 408부터 동작 410에서 SMF는 PCF로부터 PDU 세션 관련 정책 정보(Npcf_SMPolicyControl_Create Respons e)를 수신할 수 있다. PCF로부터 SMF로 전달되는 정책 정보는 네트워크 사업자 설정 등에 따라 해당 PDU 세션 내 L4S 지원 지시자 정보를 포함하는 QoS 정보를 포함할 수 있다. 동작 411에서 SMF는 PCF로부터 수신한 정책 정보를 바탕으로 UPF 선택 동작을 수행할 수 있다. PCF에서 수신 한 정책 정보내에 L4S 서비스를 지원하는 QoS에 대한 정보가 있을 경우, SMF는 L4S 서비스 지원을 위한 UPF 동 작을 선택하여 해당 동작 정보를 N4 규칙으로 N4 세션 수립 요청 (N4 Session Establishment Request) 메시지 내에 포함하여 전송할 수 있다. 예를 들어, N3IWF가 혼잡 정보 마킹을 직접 IP 헤더에 마킹하지 못하지만 GTP-U 확장 헤더를 통해 이를 전송할 수 있을 경우, SMF는 혼잡 정보 수신을 위한 QoS 모니터링 동작 관련 요구사항을 N4 규칙 내에 포함하여 UPF로 전달할 수 있다. 또한 SMF는 만약 N3IWF가 혼잡 정보를 IP헤더에 마킹하지 못할 경우 이를 지원하는 UPF를 선택할 수 있다. 동작 412 및 413에서는 동작 411에서 SMF의 결정사항을 바탕으로 UPF의 패킷 검출 규칙, UPF에서 IP 헤더에 혼 잡 정보를 마킹하는 동작, QoS 모니터링을 통해 GTP-U 확장 헤더를 통해 혼잡 정보를 수신하는 동작 등을 포함 하는 N4 규칙을 N4 세션 수립 (N4 Session Establishment) 요청 메시지 내에 포함하여 UPF에 전송할 수 있다. 이후 UPF는 CN Tunnel Info 등을 포함하는 N4 세션 수립 요청 응답 메시지를 SMF로 전송할 수 있다. 동작 414에서는 SMF는 L4S 서비스 지원하는 QoS 정보 및 L4S 지원 지시자 정보를 포함한 N2 SM information 정 보를 AMF로 전달할 수 있다. 만약 동작 411에서 UPF를 선택하기 위한 정보를 생성 중 N3IWF에서 IP 헤더 내에 혼잡 정보를 직접 마킹하는 동작을 지원하지 않는다는 정보를 인지한 SMF는 L4S support indication 및 GTP-U 확장 헤더를 통한 혼잡 제어 정보 전달 동작 요청 정보를 N2 SM information 내 포함하여 Namf_Communication_N1N2MessageTransfer 메시지를 통해 AMF로 전달할 수 있다. 동작 415에서, AMF는 N2 PDU 세션 요청 메시지를 통해 PDU 세션 수립 관련 QoS 프로화일 및 관련 QFI, PDU session ID, PDU session Establishment Accept 및/또는 L4S 지원 지시자 등의 정보를 N3IWF에 전달할 수 있다. 동작 416에서, N3IWF는 AMF로부터 전달받은 정보를 바탕으로 UE와 N3IWF 사이의 IPsec Child SA의 개수를 결정 할 수 있다. 이 때, AMF로부터 수신한 PDU 세션 수립 관련 정보 중 L4S 서비스 지원이 필요한 QoS 플로어가 존 재할 경우, N3IWF는 L4S 서비스 지원이 필요한 QoS 플로어를 고려하여 IPsec Child SA 생성을 결정할 수 있다. N3IWF는 보안적인 이유로 UE의 선택 또는 서비스 사업자의 선택에 따라 Non 3gpp Access를 이용한 서비스 중 ECN을 이용한 서비스를 제공하지 않을 수 있다. 예를 들어, N3IWF는 일반적인 QoS 플로어들이 4개이며 L4S 서비스의 제공이 필요한 QoS 플로어가 1개 있음의 정 보를 AMF로부터 수신할 수 있다. N3IWF는 해당 정보를 바탕으로 일반적인 4개의 QoS 플로어들이 IPSEC child SA#1으로 하나의 IPsec SA를 이용하며, L4S 서비스의 제공이 필요한 1개의 QoS 플로어의 경우 IPsec Child SA#2로 별도의 IPsec SA채널을 통해 서비스를 이용하도록 결정할 수 있다. 이 경우 N3IWF는 동일 UE로 연결되는 일반적인 QoS 플로어를 전송하는 IPsec Child SA 및 ECN 마킹을 통해 L4S 서비스를 지원하는 QoS 플로어를 전송 하는 IPsec Child SA 등 최소 두 개 이상의 IPsec Child SA의 연결을 결정할 수 있다. 동작 417a 및 동작 417b에서, N3IWF는 2개의 IPsec child SA의 생성을 결정하였을 경우 IPsec child SA#1에 대 한 한 개 또는 한 개이상의 QFI, DSCP 값, 추가적인 QoS 정보 등을 UE로 전송하여 첫번째 IPsec SA 수립 동작을 수행할 수 있다. 이후 동작 417c 및 동작 417d에서 N3IWF는 추가적인 IPsec child 연결을 위한 한 개 또는 한 개이상의 QFI, DSCP 값, 추가적인 QoS 정보 등을 UE에게 전송하고 UE와 추가적인 IPsec SA를 수립할 수 있다. 추가적인 IPsec SA 와 연관된 QoS 플로어가 L4S 서비스를 지원하는 QoS 플로어일 경우, N3IWF는 L4S support indication 등의 정보를 추가적인 QoS 정보 내에 포함하여 UE로 전송하여 L4S 서비스를 지원하기 위한 동작 요청 정보를 전달할 수 있다. 동작 418에서, 모든 IPsec Child SA가 설정된 후 N3IWF는 동작 415에서 수신한 PDU 세션 설정 승인 메시지를 시 그널링 IPsec SA를 통해 UE에 전달할 수 있다. 동작 419에서, N3IWF는 AN Tunnel 정보를 포함하는 N2 SM information를 포함한 PDU 세션 응답 메시지를 AMF로 전송할 수 있다.동작 420부터 동작 423에서, AMF는 N3IWF로부터 전달받은 N2 SM information과 SM 컨텍스트 ID를 포함한 정보 를 PDU 세션 관련 SM 컨텍스트 업데이트 (Nsmf_PDUSession_UpdateSMContext Request) 메시지를 통해 SMF로 전 달할 수 있다. SMF는 AN tunnel 정보를 N4 세션 변경 (N4 Session Modification) 과정을 통해 UPF로 전달할 수 있다. 이후 UPF는 N4 세션 변경 응답 메시지를 SMF로 전달하며 SMF는 SM 컨텍스트 업데이트 요청의 응답 매시지 를 AMF로 전송할 수 있다. 도 5A는 본 개시의 일 실시 예에 따른 non-3gpp access 환경에서 AF로부터 L4S 서비스 지원 요청 정보를 수신 시 PDU 세션 수정 절차를 이용한 L4S 지원을 위한 QoS 플로어 업데이트 동작 및 방법을 설명하기 위한 순서도이 다. 동작 500에서, 단말(UE)은 N3WIF와 IPsec SA 연결 수립 및 5GC 등록을 위한 요청 메시지를 전송할 수 있다. UE 는 untrusted non-3gpp Access network에서 수신한 정보를 바탕으로 N3IWF 및 관련 IP 주소 등을 포함하는 정 보를 수신할 수 있다. 이후 UE는 untrusted non-3gpp access network에서 수신한 정보를 바탕으로 N3IWF를 선 택 및 선택된 N3IWF의 IP 주소 정보를 얻을 수 있다. 이후 UE는 IKE 초기 교환을 시작하여 선택한 N3IWF와 IPsec 보안 연결(SA) 설정을 진행할 수 있다. 이후 모든 후속 IKE 메시지는 이 동작에서 설정된 IKE SA를 사용 하여 암호화되고 무결성이 보호될 수 있다. UE는 IKE_AUTH 요청 메시지를 전송하여 IKE_AUTH 교환을 시작할 수 있다. N3IWF는 EAP-Request/5G-Start 패킷을 포함하는 IKE_AUTH 응답 메시지로 응답할 수 있다. EAP- Request/5G-Start 패킷은 UE에게 EAP-5G 세션을 시작하라고 알릴 수 있다. UE는 액세스 네트워크 매개변수(AN parameter) 및 등록 요청 메시지를 포함하는 EAP-Response/5G-NAS 패킷을 포함하는 IKE_AUTH 요청을 전송할 수 있다. AN 파라미터에는 5G 코어 네트워크에서 AMF를 선택하기 위해 N3IWF에서 사용하는 정보가 포함될 수 있다. 상기 정보에는 GUAMI, 선택된 PLMN ID, 요청된 NSSAI 및 Establishment cause 등이 포함될 수 있다. Establishment cause는 5GC와의 시그널링 연결을 요청하는 이유를 제공할 수 있다. UE가 요청된 NSSAI를 AN parameter의 일부로 포함하는지 여부와 방법은 액세스 계층 연결 설정 NSSAI 포함 모드 파라미터의 값에 따라 다를 수 있다. 등록 요청은 UE가 untrusted non-3GPP access를 통해 사용하고자 하는 슬라이스에 기반하여 UE의 N3IWF 선택을 지원한다는 표시를 포함할 수 있다. N3IWF는 수신된 AN 파라미터 및 로컬 정책을 기반으로 AMF를 선택할 수 있다. 이후 N3IWF는 UE로부터 받은 등록 요청을 N2 메시지를 통해 선택된 AMF로 전달할 수 있다. 선 택된 AMF는 UE에게 NAS Identity Request 메시지를 전송하여 SUCI를 요청하기로 결정할 수 있다. 이 NAS 메시 지와 모든 후속 NAS 메시지는 EAP/5G-NAS 패킷 내에 보호되어 UE로 전송된다. AMF는 AUSF를 이용하여 UE를 인증 하기로 결정할 수 있다. AMF는 NAS 보안을 활성화하기 위해 NAS 보안 모드 명령 (NAS Security Mode Command) 을 UE로 전송할 수 있다. NAS 보안 모드 명령 메시지를 받은 N3IWF는 이를 EAP/5G-NAS 패킷 안에 포함하여 UE로 전달할 수 있다. UE는 EAP-AKA' 인증을 완료하고 NAS 보안 컨텍스트와 N3IWF 키를 생성하고 NAS 보안 모드 완료 메시지를 포함하는 EAP/5G-NAS 패킷을 전송할 수 있다. N3IWF는 NAS 보안 모드 완료 메시지를 AMF로 전달할 수 있다. AMF는 NAS 보안 모드 완료를 수신하면 N3IWF 키를 포함하는 NGAP 초기 컨텍스트 설정 요청 메시지를 N3IWF로 전송할 수 있다. 이를 통해 N3IWF가 EAP-Success를 UE로 전송하도록 트리거하여 EAP-5G 세션을 완료하 여 더 이상 EAP-5G 패킷이 교환되지 않도록 할 수 있다. UE에서 생성되고 N3IWF가 수신한 공통 N3IWF 키를 사용 하여 UE와 N3IWF 간에 IPsec SA가 수립될 수 있다. 시그널링 IPsec SA 수립 후, N3IWF는 NGAP 초기 컨텍스트 설정 응답을 AMF에 전송하여 AN 보안을 포함하는 UE 컨텍스트(Context)가 생성되었음을 알릴 수 있다. 시그널링 IPsec SA는 터널 모드에서 작동하도록 구성되어야 하며 N3IWF는 UE에 \"내부 (Inner)\" IP 주소를 할당할 수 있다. UE와 N3IWF 간에 교환되는 모든 후속 NAS 메시지는 시그널링 IPsec SA를 통해 전송되고 TCP/IP를 통해 전 달될 수 있다. UE는 소스 주소가 UE의 \"내부\" IP 주소이고 대상 주소가 NAS_IP_ADDRESS인 TCP/IP 패킷 내에서 NAS 메시지를 보낼 수 있다. 유사하게 N3IWF는 소스 주소가 NAS_IP_ADDRESS이고 대상 주소가 UE의 \"내부\" IP 주 소인 TCP/IP 패킷 내에서 NAS 메시지를 보낼 수 있다. UE와 N3IWF 간의 신뢰할 수 있는 NAS 전송에 사용되는 TCP 연결은 시그널링 IPsec SA가 설정된 직후 UE에 의해 시작할 수 있다. AMF는 가입된 S-NSSAI(들)에 의해 허 용된 요청된 NSSAI를 결정할 수 있다. AMF는 N3IWF로 전송되는 N2 메시지에 NAS 등록 승인 메시지를 전송할 수 있다. N2 메시지에는 UE의 액세스 유형에 대한 Allowed NSSAI가 포함될 수 있다. Allowed NSSAI는 선택한 N3IWF에서 지원하는 슬라이스의 일부일 수 있다. N3IWF는 시그널링 IPsec SA 통해 UE에게 NAS 등록 수락 메시지 를 전달할 수 있다. 동작 500은 도 4A의 동작 401과 대응할 수 있다. 동작 501에서, AF는 non-3gpp access 기반의 서비스에서 L4S 서비스 지원 요청을 결정할 수 있다. 동작 502에서, AF는 L4S 지원 지시자 정보 등을 바탕으로 L4S Support indication for non-3gpp access 등 L4S 서비스 지원 요청 정보를 AFsessionWithQoS Update request 메시지를 통해 NEF로 전달할 수 있다. 동작 503에서, NEF는 PCF로 정책 승인 요청 과정을 통해 동작 502에서 AF 로부터 L4S 지원 요청, 혼잡 보고 요 청 등을 포함한 요청 정보를 수신한 뒤 다음과 같은 동작을 수행할 수 있다. NEF는 UDM에 AF의 요청에 대한 가입자 정보를 확인할 수 있다. NEF는 AF 요청에 포함된 가입자 정보가 GPSI(generic public subscription identifier)인 경우, 5GC 네트워크 내부에서 가입자를 지칭하기 위한 SUPI(subscription permanent identifier) 정보로 치환을 요청할 수 있다. NEF는 AF 요청에 포함된 가입자 정 보가 가입자 그룹 정보인 경우, 5GC 네트워크 내부에서 가입자 그룹정보를 5G 네트워크 내부의 그룹 식별자로 치환을 요청할 수 있다. NEF는 AF 요청에 포함된 가입자 정보가 가입자 그룹 정보이며, 복수의 가입자 정보의 목록으로 치환될 수 있는 경우, UDM 엔티티를 통하여 이러한 치환을 요청할 수 있다. NEF는 UDM 엔티티에 AF 식별자 및 AF에서 요청한 서비스에 대한 정보, 가입자 정보에 대하여 사업자의 가입 정 책에 부합하는 지를 확인하기 위하여 UDM 엔티티에 AF 요청에 대한 승인 요청을 수행할 수 있다. 동작 504에서, PCF는 AF로부터 전달받은 요청을 기반으로 L4S/ECN 혼잡 제어 정보를 포함하는 PCC 규칙 업데이 트를 결정할 수 있다. PCF가 사업자 정책에 따라서 L4S/ECN 서비스의 제공을 결정하면, PCF는 SM 정책 제어 업 데이트 통지 절차를 수행할 수 있다. PCF는 SM 정책 제어 업데이트 통지 요청 메시지에 L4S/ECN 관련 PCC(policy and charging control) 규칙을 포함하여 SMF에 전달할 수 있다. L4S/ECN 관련 PCC 규칙은 다음과 같은 정보를 포함할 수 있다. 서비스 데이터 플로우 정보 (SDF)는 L4S/ECN 이 적용될 서비스 플로우를 식별할 수 있는 정보이다. Service Data Flow Template으로 표현될 수 있다. IP 발신지/목적지 주소 혹은 범위, 발신/ 수신 포트 번호 혹은 범위로 표현될 수 있다. 또는 FQDN(fully qualified domain name)의 값 또는 FQDN 범위, 예를 들면, 정규 표현 방식으로 표현된 FQDN의 범위로 표현될 수 있다. L4S/ECN 마킹 관련 정보는 L4S/ECN 마킹 정책과 L4S/ECN 혼잡 경험 비트 마킹 정책을 포함할 수 있다. L4S/ECN 마킹 정책은 L4S/ECN 마킹 지원 여부, L4S/ECN 마킹 버전, 제어 평면의 정보를 이용한 L4S/ECN 마킹 지원을 포함하는 정책을 가질 수 있다. 동작 505에서, SMF는 L4S support indication 정보를 포함한 업데이트된 PCC 규칙을 전달받은 뒤 L4S 지원을 위한 동작 및 이를 제공할 NF의 선택에 대한 결정을 수행할 수 있다. L4S 지원을 위한 결정을 수행하기 위하여 SMF는 IPsec SA의 ECN/L4S 지원 여부 및 N3IWF에서 어떤 방식의 혼잡 정보 마킹 방식을 지원하는지를 PDU 세션 수립 과정 중 전달받았거나 네트워크 사업자의 설정에 따라 알고 있다고 가정될 수 있다. PCF에서 수신한 정책 정보내에 L4S 서비스를 지원하는 QoS에 대한 정보가 있을 경우, SMF는 L4S 서비스 지원을 위한 UPF 동작을 선택 하여 해당 동작 정보를 N4 규칙으로 N4 세션 수립 요청 (N4 Session Establishment Request) 메시지내에 포함 하여 전송할 수 있다. 예를 들어, N3IWF가 혼잡 정보 마킹을 직접 IP 헤더에 하지 못하지만 GTP-U 확장 헤더를 통해 이를 전송할 수 있을 경우 SMF는 혼잡 정보 수신을 위한 QoS 모니터링 동작 관련 요구사항을 N4 규칙 내에 포함하여 UPF로 전달할 수 있다. 또한 SMF는 N3IWF가 혼잡 정보를 IP헤더에 마킹하지 못할 경우 이를 지원하는 UPF를 선택할 수 있다. SMF는 PCF로부터 수신한 정책 정보를 바탕으로 UPF 선택 동작을 수행할 수 있다. SMF는 특정 QoS 플로어의 L4S 서비스 지원 요청의 수락 여부를 기 설정된 정책 또는 PDU 세션 수립 과정 중에 전달된 정보를 바탕으로 판단할 수 있다. SMF는 PDU session 수립 과정에서 AMF 또는 UE로부터 IPsec SA의 ECN 지원 여부 정보를 전달받을 수 있으며 이에 기초하여 AF에서 전달되는 특정 UE의 QoS 플로어에 대한 L4S 서비스 지원 요청에 대하여 수락 여부를 결정할 수 있다. 또한, SMF는 특정 QoS 플로어의 L4S 서비스 지원 요청의 수락 여부 는 N3IWF에서 아래 조건을 만족하는지에 기초하여 판단할 수 있다. N3IWF가 혼잡 상황에 대한 정보를 IP headers 내의 ToS 필드에 ECN bit내 직접 마킹 할 수 있거나, GTP-U 확장 헤더내 혼잡 정보 (congestion information)를 마킹하여 UPF로 전달할 수 있는 경우, N3IWF는 L4S 서비스를 지원할 수 있다고 판단될 수 있다. 또한 추가적으로 non-3gpp access를 통한 서비스를 이용할 경우 SMF는 N3IWF가 혼잡 정보의 전달을 위한 마킹 방법 중 한가지 이상을 지원하는 동시에 해당 N3IWF와 UE 사이의 IPsec SA 구간에서도 ECN/L4S 서비스 지원 (ECN capable)이 가능할 때 non-3gpp access를 이용한 해당 QoS 플로어의 L4S 서비스 요청에 대하여 수락 여부 를 판단할 수 있다. 동작 506에서는 SMF는 L4S 서비스 지원하는 QoS 정보 및 L4S 지원 지시자 정보를 포함한 N2 SM information 정 보를 AMF로 전달할 수 있다. 만약 동작 505에서 UPF를 선택하기 위한 정보를 생성 중 N3IWF에서 IP 헤더 내에 혼잡 정보를 직접 마킹하는 동작을 지원하지 않는다는 정보를 인지한 경우, SMF는 L4S support indication 및 GTP-U 확장 헤더를 통한 혼잡 제어 정보 전달 동작 요청 정보를 N2 SM information 내 포함하여 Namf_Communication_N1N2MessageTransfer 메시지를 통해 AMF로 전달할 수 있다. 동작 507에서, AMF는 N2 PDU 세션 요청(N2 PDU Session Request) 메시지를 통해 PDU 세션 수립 관련 QoS 프로 화일 및 관련 QFI, PDU session ID, PDU session Establishment Accept 및/또는 L4S 지원 지시자 등의 정보를 N3IWF에 전달할 수 있다.동작 508a 및 508b에서는 동작 505에서 SMF의 결정사항을 바탕으로, SMF는 UPF의 패킷 검출 규칙, UPF에서 IP 헤더에 혼잡 정보를 마킹하는 동작, QoS 모니터링을 통해 GTP-U 확장헤더를 통해 혼잡 정보를 수신하는 동작 등 을 포함하는 N4 규칙을 N4 세션 수립 (N4 Session Establishment) 요청 메시지 내에 포함하여 UPF에 전송할 수 있다. 이후 UPF는 CN Tunnel Info 등을 포함한 N4 세션 수립 요청 응답 메시지를 SMF로 전송할 수 있다. 동작 509에서, N3IWF는 AMF로부터 전달받은 정보를 바탕으로 UE와 N3IWF 사이의 IPsec Child SA의 업데이트를 결정할 수 있다. 기존 QoS 플로어들이 ECN/L4S를 지원하지 않는 IPsec SA를 통해 전달되고 있을 경우, N3IWF에 서 L4S 서비스 지원 요청을 받을 경우 해당 QoS 플로어를 위하여 ECN/L4S를 지원하는 새로운 IPsec SA 연결을 결정할 수 있다. 예를 들어, N3IWF에서 L4S를 서비스를 지원하지 않는 QoS 플로어들 5개가 1개의 IPsec SA#1로 전송되고 있을 때, 이중 한 개의 QoS 플로어가 L4S 서비스의 제공을 요청 받을 수 있다. N3IWF는 한 개의 L4S 서비스 지원을 위한 QoS 플로어를 위한 IPsec SA#2의 생성을 결정하고 기존 IPsec SA#1에서 IPsec SA#2로 해당 L4S 서비스 지원을 요청하는 QoS 플로어 정보의 업데이트를 수행할 수 있다. 이를 위해 N3WIF는 Child SA와 관 련된 QFI 및 Additional QoS 정보 등을 포함하는 정보 요청 메시지 (INFORMATIONAL request message)를 전송하 여 QoS 플로어 및 Child SA 매핑 정보를 업데이트할 수 있다. 동작 510에서, N3IWF는 새로운 IPsec child SA의 생성을 결정하였을 경우 IPSEC child SA에 대한 QFI, PDU 세 션 ID 등을 UE로 전송하여 L4S 서비스를 지원하는 새로운 IPsec SA 수립 동작을 수행할 수 있다. 동작 511에서, N2 세션 요청 사항을 바탕으로 L4S 서비스를 지원하는 새로운 IPsec Child SA가 설정된 경우 N3IWF는 해당 요청의 성공 여부를 AMF로 전달할 수 있다. 동작 512부터 동작 513에서, AMF는 L4S 서비스 지원을 위한 요청 정보의 성공 여부를 포함한 N2 SM 정보를 PDU 세션 관련 SM 컨텍스트 업데이트 (Nsmf_PDUSession_UpdateSMContext Request) 메시지를 통해 SMF로 전달할 수 있다. SMF는 Qos 플로어 정보 등이 업데이트된 경우 이를 N4 세션 변경 요청 동작을 통해 UPF로 전달할 수 있다. 동작 514에서, UE와 N3IWF 사이에는 Non-3gpp Access point(e.g. wifi)가 추가될 수 있다. UE는 N3IWF와의 Non-3gpp access point를 통해 데이터를 송수신할 수 있으며, 이때 IPsec의 구조와 관련하여 기존의 N3IWF로 전 달된 IP header 및 payload는 Inner IP packet으로 정의될 수 있다. IPsec Tunnel mode에서는 해당 Inner IP packet을 페이로드에 포함하는 추가적인 outer IP packet가 정의될 수 있다. 즉, IPsec SA 구간에서는 outer IP packet을 생성하여 이를 non-3gpp access point를 통해 UE로 전달할 수 있다. 동작 514a에서, 하향 링크 데이터가 N3IWF에 전달될 경우 N3IWF는 SMF를 통해 전달된 동작을 수행할 수 있다. N3IWF는 하향 링크 데이터가 UPF로부터 전달되었을 때 N3IWF에서 혼잡 상황이 발생하거나 또는 N3IWF 이전의 혼 잡이 발생시 Inner IP 헤더의 해당 ECN bit에 CE 마킹을 수행하거나 ECN bit에 CE가 마킹이 된 IP packet을 전 달받아 이를 Inner packet으로 UE에게 전송할 수 있다. 또한 N3IWF는 non-3gpp access network에서 혼잡이 발 생시 해당 혼잡 정보를 Outer packet 헤더 내 ECN bit에 마킹하여 UE에게 전달할 수 있다. 동작 514b에서, 해당 하향 링크 데이터를 수신한 UE는 해당 혼잡 상황이 어떤 구간 즉, Non-3gpp access 구간의 혼잡 상황인지 또는 5GC 내부에서 발생한 혼잡 상황인지에 대한 혼잡 정보를 구분하여 혼잡 정보를 생성할 수 있으며 이를 AS로 전달하여 각 상황에 맞는 Queue 관리를 수행할 수 있도록 할 수 있다. 동작 515에서, 상향 링크 데이터 전송 시 Non-3gpp access 구간의 혼잡 상황이 outer 헤더를 통해 마킹되어 전 달되었을 때, N3IWF는 해당 Non-3gpp access network에서 발생한 정보를 outer header의 헤더의 ECN bit 정보 를 바탕으로 혼잡 정보 생성을 결정하며 혼잡 정보를 어떤 방식으로 마킹하여 전송할지는 SMF에서 동작 505에서 결정사항을 바탕으로 전달할 수 있다. 도 5B는 본 개시의 일 실시 예에 따른 non-3gpp access 환경에서 AF로부터 L4S 서비스 지원 요청 정보를 수신 시 PDU 세션 수정 절차를 이용한 L4S 지원을 위한 QoS 플로어 업데이트 동작 및 방법을 설명하기 위한 순서도이 다. 동작 520에서, 단말(UE)은 N3WIF와 IPsec SA 연결 수립 및 5GC 등록을 위한 요청 메시지를 전송할 수 있다. UE 는 untrusted non-3gpp Access network에서 수신한 정보를 바탕으로 N3IWF 및 관련 IP 주소 등을 포함하는 정 보를 수신할 수 있다. 이후 UE는 untrusted non-3gpp access network에서 수신한 정보를 바탕으로 N3IWF를 선 택 및 선택된 N3IWF의 IP 주소 정보를 얻을 수 있다. 이후 UE는 IKE 초기 교환을 시작하여 선택한 N3IWF와IPsec 보안 연결(SA) 설정을 진행할 수 있다. 이후 모든 후속 IKE 메시지는 이 동작에서 설정된 IKE SA를 사용 하여 암호화되고 무결성이 보호될 수 있다. UE는 IKE_AUTH 요청 메시지를 전송하여 IKE_AUTH 교환을 시작할 수 있다. N3IWF는 EAP-Request/5G-Start 패킷을 포함하는 IKE_AUTH 응답 메시지로 응답할 수 있다. EAP- Request/5G-Start 패킷은 UE에게 EAP-5G 세션을 시작하라고 알릴 수 있다. UE는 액세스 네트워크 매개변수(AN parameter) 및 등록 요청 메시지를 포함하는 EAP-Response/5G-NAS 패킷을 포함하는 IKE_AUTH 요청을 전송할 수 있다. AN 파라미터에는 5G 코어 네트워크에서 AMF를 선택하기 위해 N3IWF에서 사용하는 정보가 포함될 수 있다. 상기 정보에는 GUAMI, 선택된 PLMN ID, 요청된 NSSAI 및 Establishment cause 등이 포함될 수 있다. Establishment cause는 5GC와의 시그널링 연결을 요청하는 이유를 제공할 수 있다. UE가 요청된 NSSAI를 AN parameter의 일부로 포함하는지 여부와 방법은 액세스 계층 연결 설정 NSSAI 포함 모드 파라미터의 값에 따라 다를 수 있다. 등록 요청은 UE가 untrusted non-3GPP access를 통해 사용하고자 하는 슬라이스에 기반하여 UE의 N3IWF 선택을 지원한다는 표시를 포함할 수 있다. N3IWF는 수신된 AN 파라미터 및 로컬 정책을 기반으로 AMF를 선택할 수 있다. 이후 N3IWF는 UE로부터 받은 등록 요청을 N2 메시지를 통해 선택된 AMF로 전달할 수 있다. 선 택된 AMF는 UE에게 NAS Identity Request 메시지를 전송하여 SUCI를 요청하기로 결정할 수 있다. 이 NAS 메시 지와 모든 후속 NAS 메시지는 EAP/5G-NAS 패킷 내에 보호되어 UE로 전송된다. AMF는 AUSF를 이용하여 UE를 인증 하기로 결정할 수 있다. AMF는 NAS 보안을 활성화하기 위해 NAS 보안 모드 명령 (NAS Security Mode Command) 을 UE로 전송할 수 있다. NAS 보안 모드 명령 메시지를 받은 N3IWF는 이를 EAP/5G-NAS 패킷 안에 포함하여 UE로 전달할 수 있다. UE는 EAP-AKA' 인증을 완료하고 NAS 보안 컨텍스트와 N3IWF 키를 생성하고 NAS 보안 모드 완료 메시지를 포함하는 EAP/5G-NAS 패킷을 전송할 수 있다. N3IWF는 NAS 보안 모드 완료 메시지를 AMF로 전달할 수 있다. AMF는 NAS 보안 모드 완료를 수신하면 N3IWF 키를 포함하는 NGAP 초기 컨텍스트 설정 요청 메시지를 N3IWF로 전송할 수 있다. 이를 통해 N3IWF가 EAP-Success를 UE로 전송하도록 트리거하여 EAP-5G 세션을 완료하 여 더 이상 EAP-5G 패킷이 교환되지 않도록 할 수 있다. UE에서 생성되고 N3IWF가 수신한 공통 N3IWF 키를 사용 하여 UE와 N3IWF 간에 IPsec SA가 수립될 수 있다. 시그널링 IPsec SA 수립 후, N3IWF는 NGAP 초기 컨텍스트 설정 응답을 AMF에 전송하여 AN 보안을 포함하는 UE 컨텍스트(Context)가 생성되었음을 알릴 수 있다. 시그널링 IPsec SA는 터널 모드에서 작동하도록 구성되어야 하며 N3IWF는 UE에 \"내부 (Inner)\" IP 주소를 할당할 수 있다. UE와 N3IWF 간에 교환되는 모든 후속 NAS 메시지는 시그널링 IPsec SA를 통해 전송되고 TCP/IP를 통해 전 달될 수 있다. UE는 소스 주소가 UE의 \"내부\" IP 주소이고 대상 주소가 NAS_IP_ADDRESS인 TCP/IP 패킷 내에서 NAS 메시지를 보낼 수 있다. 유사하게 N3IWF는 소스 주소가 NAS_IP_ADDRESS이고 대상 주소가 UE의 \"내부\" IP 주 소인 TCP/IP 패킷 내에서 NAS 메시지를 보낼 수 있다. UE와 N3IWF 간의 신뢰할 수 있는 NAS 전송에 사용되는 TCP 연결은 시그널링 IPsec SA가 설정된 직후 UE에 의해 시작할 수 있다. AMF는 가입된 S-NSSAI(들)에 의해 허 용된 요청된 NSSAI를 결정할 수 있다. AMF는 N3IWF로 전송되는 N2 메시지에 NAS 등록 승인 메시지를 전송할 수 있다. N2 메시지에는 UE의 액세스 유형에 대한 Allowed NSSAI가 포함될 수 있다. Allowed NSSAI는 선택한 N3IWF에서 지원하는 슬라이스의 일부일 수 있다. N3IWF는 시그널링 IPsec SA 통해 UE에게 NAS 등록 수락 메시지 를 전달할 수 있다. 동작 520은 도 4A의 동작 401과 대응할 수 있다. 동작 521에서, AF는 non-3gpp access 기반의 서비스에서 L4S 서비스 지원 요청을 결정할 수 있다. 동작 522에서, AF는 L4S 지원 지시자 정보 등을 바탕으로 L4S Support indication for non-3gpp access 등 L4S 서비스 지원 요청 정보를 AFsessionWithQoS Update request 메시지를 통해 NEF로 전달할 수 있다. 동작 523에서, NEF는 PCF로 정책 승인 요청 과정을 통해 동작 522에서 AF 로부터 L4S 지원 요청, 혼잡 보고 요 청 등을 포함한 요청 정보를 수신한 뒤 다음과 같은 동작을 수행할 수 있다. NEF는 UDM에 AF의 요청에 대한 가입자 정보를 확인할 수 있다. NEF는 AF 요청에 포함된 가입자 정보가 GPSI(generic public subscription identifier)인 경우, 5GC 네트워크 내부에서 가입자를 지칭하기 위한 SUPI(subscription permanent identifier) 정보로 치환을 요청할 수 있다. NEF는 AF 요청에 포함된 가입자 정 보가 가입자 그룹 정보인 경우, 5GC 네트워크 내부에서 가입자 그룹정보를 5G 네트워크 내부의 그룹 식별자로 치환을 요청할 수 있다. NEF는 AF 요청에 포함된 가입자 정보가 가입자 그룹 정보이며, 복수의 가입자 정보의 목록으로 치환될 수 있는 경우, UDM 엔티티를 통하여 이러한 치환을 요청할 수 있다. NEF는 UDM 엔티티에 AF 식별자 및 AF에서 요청한 서비스에 대한 정보, 가입자 정보에 대하여 사업자의 가입 정 책에 부합하는 지를 확인하기 위하여 UDM 엔티티에 AF 요청에 대한 승인 요청을 수행할 수 있다. 동작 524에서, PCF는 AF로부터 전달받은 요청을 기반으로 L4S/ECN 혼잡 제어 정보를 포함하는 PCC 규칙 업데이 트를 결정할 수 있다. PCF가 사업자 정책에 따라서 L4S/ECN 서비스의 제공을 결정하면, PCF는 SM 정책 제어 업데이트 통지 절차를 수행할 수 있다. PCF는 SM 정책 제어 업데이트 통지 요청 메시지에 L4S/ECN 관련 PCC(policy and charging control) 규칙을 포함하여 SMF에 전달할 수 있다. L4S/ECN 관련 PCC 규칙은 다음과 같은 정보를 포함할 수 있다. 서비스 데이터 플로우 정보 (SDF)는 L4S/ECN 이 적용될 서비스 플로우를 식별할 수 있는 정보이다. Service Data Flow Template으로 표현될 수 있다. IP 발신지/목적지 주소 혹은 범위, 발신/ 수신 포트 번호 혹은 범위로 표현될 수 있다. 또는 FQDN(fully qualified domain name)의 값 또는 FQDN 범위, 예를 들면, 정규 표현 방식으로 표현된 FQDN의 범위로 표현될 수 있다. L4S/ECN 마킹 관련 정보는 L4S/ECN 마킹 정책과 L4S/ECN 혼잡 경험 비트 마킹 정책을 포함할 수 있다. L4S/ECN 마킹 정책은 L4S/ECN 마킹 지원 여부, L4S/ECN 마킹 버전, 제어 평면의 정보를 이용한 L4S/ECN 마킹 지원을 포함하는 정책을 가질 수 있다. 동작 525에서, SMF는 L4S support indication 정보를 포함한 업데이트된 PCC 규칙을 전달받은 뒤 L4S 지원을 위한 동작 및 이를 제공할 NF의 선택에 대한 결정을 수행할 수 있다. 구체적으로 SMF는 네트워크 사업자의 정책 에 따라 L4S를 위한 ECN 마킹 동작을 지원하는 NF의 선택을 수행할 수 있으며, 이때 선택되는 NF는 NG-RAN 또는 UPF일 수 있다. 네트워크 사업자의 정책에 따라, SMF에서 L4S 서비스 지원을 위한 NF 엔티티를 UPF로 선택할 경 우, 해당 ECN 마킹 동작 정보를 N4 규칙으로 N4 세션 수립 요청 (N4 Session Establishment Request) 메시지내 에 포함하여 전송할 수 있다. 예를 들어, N3IWF가 혼잡 정보 마킹을 직접 IP 헤더에 하지 못하지만 GTP-U 확장 헤더를 통해 혼잡 정보를 UPF로 전송할 수 있을 경우 SMF는 혼잡 정보 수신을 위한 QoS 모니터링 동작 관련 요 구사항을 N4 규칙 내에 포함하여 UPF로 전달할 수 있다. SMF는 특정 QoS 플로어의 L4S 서비스 지원 요청의 수락 여부를 기 설정된 정책 또는 PDU 세션 수립 과정 중 NG-RAN으로부터 전달된 정보에 기초하여 판단할 수 있다. SMF는 PCF로부터 전달받은 ECN marking for L4S indicator 정보를 포함한 업데이트된 PCC 규칙을 바탕으로 L4S 를 위한 ECN 마킹 동작을 지원하는 NF의 선택을 수행할 수 있다. 이후 SMF는 PDU session 수립 또는 변경 과정 중 AMF를 통해 ECN marking for L4S indicator 또는 QoS monitoring configuration for congestion information를 포함하는 N2 정보를 N3IWF로 전달할 수 있다. N3IWF는 SMF로부터 전달받은 정보에 기초하여 N3IWF에서 ECN marking for L4S indicator 동작을 지원할 경우 established QoS Flows status (active) for ECN marking for L4S 의 정보를 AMF를 통해 SMF로 전달할 수 있다. N3IWF에서 ECN marking for L4S indicator 동작을 지원하지 않을 경우 N3IWF는 established QoS Flows status (inactive) for ECN marking for L4S 의 정 보를 AMF를 통해 SMF로 전달할 수 있다. 또한 N3IWF는 SMF로부터 전달받은 정보를 바탕으로 N3IWF에서 QoS monitoring configuration for congestion information 동작을 지원할 경우 established QoS Flows status (active) for QoS monitoring configuration for congestion information의 정보를 AMF를 통해 SMF로 전달할 수 있다. N3IWF에서 QoS monitoring configuration for congestion information 동작을 지원하지 않을 경우 N3IWF는 established QoS Flows status (inactive) for QoS monitoring configuration for congestion information의 정보를 AMF를 통해 SMF로 전달할 수 있다. N3IWF에서 QoS monitoring configuration for congestion information 동작 및 ECN marking for L4S을 지원하지 않을 경우 SMF는 해당 N3IWF를 이용하는 QoS 플로어는 L4S를 고려한 ECN 마킹 동작을 지원하지 않는다고 판단할 수 있다. SMF는 N3IWF 또는 UPF에서 전달되 는 L4S 지원 여부 상태 정보 (e.g. established QoS Flows status (active/inactive) for QoS monitoring configuration for congestion information or established QoS Flows status (active/inactive) for ECN marking for L4S)에 기초하여 AF에서 전달되는 특정 UE의 QoS 플로어에 대한 L4S 서비스 지원 요청에 대하여 수 락 여부를 결정할 수 있다. 동작 526에서는 SMF는 L4S 서비스 지원하기 위해 ECN 마킹 동작을 수행하는 NF 선택 결과에 따라 SMF에서 NG- RAN를 이용한 ECN 마킹 동작을 선택한 경우 L4S 서비스를 지원하는 QoS flow 정보 및 L4S 지원 지시자 정보 (ECN marking for L4S indicator)를 포함한 N2 SM information 을 AMF로 전달할 수 있다. 동작 525을 통해 SMF 에서 UPF를 이용한 ECN 마킹 동작을 선택한 경우 또는 N3IWF로부터 IP 헤더 내에 혼잡 정보를 직접 마킹하는 동 작을 지원하지 않는다는 정보를 수신한 경우, SMF는 L4S 서비스를 지원하는 QoS flow 정보 및 GTP-U 확장 헤더 를 통한 혼잡 정보의 수신을 위한 혼잡 정보 QoS 모니터링을 위한 설정 정보를 N2 SM information 내 포함하여 Namf_Communication_N1N2MessageTransfer 메시지를 통해 AMF로 전달할 수 있다. 동작 527에서, AMF는 N2 PDU 세션 요청(N2 PDU Session Request) 메시지를 통해 PDU 세션 수립 관련 QoS 프로 화일 및 관련 QFI, PDU session ID, PDU session Establishment Accept 및/또는 L4S 지원 지시자 등의 정보를 N3IWF에 전달할 수 있다. 동작 528a 및 528b에서, 동작 525에서 SMF의 결정에 기초하여 SMF는 UPF의 패킷 검출 규칙 등을 포함하는 N4 규 칙을 N4 세션 수립 (N4 Session Establishment) 요청 메시지 내에 포함하여 UPF에 전송할 수 있다. UPF는 CN Tunnel Info 등을 포함한 N4 세션 수립 요청 응답 메시지를 SMF로 전송할 수 있다. 동작 525에서 SMF가 UPF를이용한 L4S 서비스 지원을 결정한 경우, SMF는 ECN 마킹 동작 및 ECN 마킹을 위한 혼잡 정보를 NG-RAN으로부터 전달받기 위한 QoS 모니터링 설정 정보 등을 포함한 N4 규칙을 UPF로 전달할 수 있다. 동작 529a에서, N3IWF의 Capability 및/또는 SMF에서 요청하는 L4S 지원을 위한 동작 요청 메시지에 따라 N3IWF는 N3IWF에서 지원가능한 L4S 지원 동작을 선택할 수 있다. 동작 525에서 SMF가 NG-RAN을 이용한 L4S 서비 스를 지원하기 위한 ECN 마킹 동작의 수행을 결정하고 동작 526 및 동작 527을 통해 N3IWF로 전달된 N2 SM 정보 내에 ECN marking for L4S indicator만 포함된 경우, N3IWF는 해당 동작의 수락 여부에 따라 동작 529b의 수행 을 결정할 수 있다. 일 실시 예에서, 동작 525에서 SMF가 UPF를 이용한 4S 서비스를 지원하기 위한 ECN 마킹 동작의 수행을 결정하 고 동작 526 및 동작 527을 통해 N3IWF로 전달된 N2 SM 정보내에 QoS monitoring configuration for congestion information 가 포함된 경우, N3IWF는 해당 동작의 수락 여부에 따라 동작 529b의 수행을 결정할 수 있다. N3IWF에서 L4S 서비스를 지원하기 위한 혼잡 정보 모니터링 동작 및 ECN 마킹 동작을 모두 지원하지 않는 경우 동작 529b 및 동작 530 은 생략될 수 있다. 이후 동작 531 및 동작 532를 통해 N3IWF는 해당 QoS 플 로어에 대한 L4S 서비스를 지원하지 못함을 SMF로 전달할 수 있다. 동작 529b에서 N3IWF는 AMF로부터 전달받은 정보를 바탕으로 UE와 N3IWF 사이의 IPsec Child SA의 업데이트를 결정할 수 있다. 기존 QoS 플로어들이 ECN/L4S를 지원하지 않는 IPsec SA를 통해 전달되고 있을 경우, N3IWF에 서 L4S 서비스 지원 요청을 받을 경우 해당 QoS 플로어를 위하여 ECN/L4S를 지원하는 새로운 IPsec SA 연결을 결정할 수 있다. 예를 들어, N3IWF에서 L4S를 서비스를 지원하지 않는 QoS 플로어들 5개가 1개의 IPsec SA#1로 전송되고 있을 때, 이중 한 개의 QoS 플로어가 L4S 서비스의 제공을 요청 받을 수 있다. N3IWF는 한 개의 L4S 서비스 지원을 위한 QoS 플로어를 위한 IPsec SA#2의 생성을 결정하고 기존 IPsec SA#1에서 IPsec SA#2로 해당 L4S 서비스 지원을 요청하는 QoS 플로어 정보의 업데이트를 수행할 수 있다. 이를 위해 N3WIF는 Child SA와 관 련된 QFI 및 Additional QoS 정보 등을 포함하는 정보 요청 메시지 (INFORMATIONAL request message)를 전송하 여 QoS 플로어 및 Child SA 매핑 정보를 업데이트할 수 있다. 동작 530에서, N3IWF는 새로운 IPsec child SA의 생성을 결정하였을 경우 IPSEC child SA에 대한 QFI, PDU 세 션 ID 등을 UE로 전송하여 L4S 서비스를 지원하는 새로운 IPsec SA 수립 동작을 수행할 수 있다. 또한 동작 529a를 통해 N3IWF에서 L4S 서비스를 위한 동작을 지원할 수 있지만 N3IWF 내에 단말 및 Non 3gpp Access Network에서 L4S 서비스를 지원하는지 여부의 정보를 보유하지 않는 경우, 해당 단말 및 Non 3gpp Access에서 L4S 서비스를 지원하는지 여부를 확인하는 정보를 단말에게 전달할 수 있다. N3IWF에서 단말로 전송하는 L4S 서 비스를 지원하는지 여부를 확인하는 정보는 ECN marking for L4S indicator 등을 포함할 수 있다. 단말은 특정 QoS 플로어에 대한 L4S 지원 지시자를 N3IWF로부터 전달받은 경우, 단말 및 Non 3gpp access 사이 구간에서 L4S 를 지원하는지 여부 또는 L4S를 지원하는 IPsec child SA가 생성되어 있는지를 체크하고 별도의 L4S 지원 여부 를 판단할 수 없으면 상향링크 패킷 내 L4S 지원 여부를 체크하기 위한 동작을 수행할 수 있다. 동작 531(531a 및/또는 531b)에서, N2 세션 요청 사항을 바탕으로 L4S 서비스를 지원하는 새로운 IPsec Child SA가 설정된 경우 N3IWF는 해당 L4S 서비스를 지원하는 N3IWF 동작 요청의 수락 또는 지원 여부를 AMF로 전달할 수 있다. N3IWF는 SMF에서 L4S 서비스를 지원하기 위한 N3IWF 동작 요청의 수락 및 지원 여부를 established QoS Flows status (active/inactive) for QoS monitoring configuration for congestion information 또는 established QoS Flows status (active/inactive) for ECN marking for L4S 정보로 N2 SM 정보내에 포함하여 AMF로 전달할 수 있다. 동작 530을 통해 UE 또는 Non 3gpp Access network에서 L4S 서비스를 지원하는 IPsec Child SA의 생성을 지원하지 않거나 UE 또는 Non 3gpp Access network 중 적어도 하나 이상의 엔티티에서 L4S 기능을 지원하지 않을 경우, N3IWF는 L4S 서비스를 지원하기 위한 N3IWF 동작 요청의 거절 또는 지원하지 않음 을 포함하는 정보 (established QoS Flows status (inactive) for QoS monitoring configuration for congestion information 또는 established QoS Flows status (inactive) for ECN marking for L4S)를 포함하 는 N2 SM 정보를 AMF로 전달할 수 있다. 동작 532(532a 및/또는 532b)부터 동작 533(533a 및/또는 533b)에서, AMF는 L4S 서비스 지원을 위한 요청 정보 의 성공 여부를 포함한 N2 SM 정보를 PDU 세션 관련 SM 컨텍스트 업데이트 (Nsmf_PDUSession_UpdateSMContext Request) 메시지를 통해 SMF로 전달할 수 있다. SMF는 N2 SM 정보 내 Qos 플로어 정보 등이 업데이트된 경우 이 를 N4 세션 변경 요청 동작을 통해 UPF로 전달할 수 있다. 동작 532a를 통해 NG-RAN으로부터 전달받은 N2 SM 정 보 내에 N3IWF에서 L4S 서비스를 지원하기 위한 동작을 지원하지 않는다는 정보를 전달받은 SMF는 이를 PCF를 통해 AF로 전달할 수 있다. 동작 522 및 동작 523에서 AF에서 PCF로 전달되는 L4S 서비스 관련 요구사항 정보내에는 L4S 지원 지시자 정보 외에 L4S 서비스가 지원되지 않는다고 판단될 경우 해당 정보를 AF로 이벤트 리포 팅을 요청하는 요구사항 정보를 포함할 수 있다. 동작 524에서 PCF는 PCRT(Policy Control Request Trigger)를 통해 SMF가 N3IWF로부터 established QoS Flows status (inactive) for QoS monitoring configuration for congestion information 및/또는 established QoS Flows status (inactive) for ECN marking for L4S 정보를 수신하였을 경우, 해당 QoS 플로어의 L4S 서비스 지원이 되지 않음을 수신하였다면 이를 PCF로 보고하도록 SMF 에게 요청할 수 있다. 동작 534(534a 및/또는 534b)에서, SMF가 N3IWF로부터 전달받은 정보를 바탕으로 해당 QoS 플로어의 L4S 서비스 지원이 되지 않음을 N3IWF로부터 수신할 경우, SMF는 해당 QoS 플로어 관련 L4S 서비스 지원을 하지 않음을 이 벤트 리포팅을 통해 PCF로 전달할 수 있다. PCF는 SMF로부터 전달받은 이벤트 리포팅 메시지 바탕으로 AF 요청 에 따른 특정 QoS 플로어의 L4S 서비스 지원을 하지 않는다는 이벤트 리포팅 메시지를 AF로 전달할 수 있다. 동작 535에서, UE와 N3IWF 사이에는 Non-3gpp Access point(e.g. wifi)가 추가될 수 있다. UE는 N3IWF와의 Non-3gpp access point를 통해 데이터를 송수신할 수 있으며, 이때 IPsec의 구조와 관련하여 기존의 N3IWF로 전 달된 IP header 및 payload는 Inner IP packet으로 정의될 수 있다. IPsec Tunnel mode에서는 해당 Inner IP packet을 페이로드에 포함하는 추가적인 outer IP packet가 정의될 수 있다. 즉, IPsec SA 구간에서는 outer IP packet을 생성되어 non-3gpp access point를 통해 UE로 전달할 수 있다. 동작 535a에서, 하향 링크 데이터가 N3IWF에 전달될 경우 N3IWF는 SMF를 통해 전달된 동작을 수행할 수 있다. N3IWF는 하향 링크 데이터가 UPF로부터 전달되었을 때 N3IWF에서 혼잡 상황이 발생하거나 또는 N3IWF 이전의 혼 잡이 발생시 Inner IP 헤더의 해당 ECN bit에 CE 마킹을 수행하거나 ECN bit에 CE가 마킹이 된 IP packet을 전 달받아 이를 Inner packet으로 UE에게 전송할 수 있다. 또한 N3IWF는 non-3gpp access network에서 혼잡이 발 생시 해당 혼잡 정보를 Outer packet 헤더 내 ECN bit에 마킹하여 UE에게 전달할 수 있다. 동작 535b에서, 해당 하향 링크 데이터를 수신한 UE는 해당 혼잡 상황이 어떤 구간 즉, Non-3gpp access 구간의 혼잡 상황인지 또는 5GC 내부에서 발생한 혼잡 상황인지에 대한 혼잡 정보를 구분하여 혼잡 정보를 생성할 수 있으며 이를 AF로 전달하여 각 상황에 맞는 Queue 관리를 수행할 수 있도록 할 수 있다. 동작 536에서, 상향 링크 데이터 전송 시 Non-3gpp access 구간의 혼잡 상황이 outer 헤더를 통해 마킹되어 전 달되었을 때, N3IWF는 해당 Non-3gpp access network에서 발생한 정보를 outer header의 헤더의 ECN bit 정보 에 기초하여 혼잡 정보 생성을 결정할 수 있다. 혼잡 정보의 마킹 방식에 대하여, SMF가 동작 525에서 결정한 사항에 기초하여, N3IWF가 마킹을 수행할 수 있다. 또한, SMF가 동작 525에서 결정한 사항에 기초하여, N3IWF는 혼잡 정보를 UPF로 송신하고, UPF가 마킹을 수행할 수 있다. 도 6은 본 개시의 일 실시예에 따른 단말의 기능적 구조의 예를 도시한다. 이하 사용되는 '...부', '...기' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 6의 단말은 도 1 내지 도 5에서 표현된 UE(user equipment)와 대응할 수 있다. 도 6를 참조하면, 단말은 통신부, 저장부, 제어부를 포함할 수 있다. 통신부는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행할 수 있다. 예를 들어, 통신부는 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행할 수 있다. 예를 들어, 데이터 송신 시, 통신부는 송신 비트열을 부호화 및 변조함으로써 복소 심벌들을 생성할 수 있다. 또한, 데이터 수신 시, 통신부는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원할 수 있다. 또한, 통신부 는 기저대역 신호를 RF 대역 신호로 상향변환한 후 안테나를 통해 송신하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향변환 할 수 있다. 예를 들어, 통신부는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC, ADC 등을 포함할 수 있다. 또한, 통신부는 다수의 송수신 경로(path)들을 포함할 수 있다. 나아가, 통신부 는 다수의 안테나 요 소들로 구성된 적어도 하나의 안테나 어레이를 포함할 수 있다. 하드웨어의 측면에서, 통신부는 디지털 회 로 및 아날로그 회로(예: RFIC(radio frequency integrated circuit))로 구성될 수 있다. 여기서, 디지털 회로 및 아날로그 회로는 하나의 패키지로 구현될 수 있다. 또한, 통신부는 다수의 RF 체인들을 포함할 수 있다. 나아가, 통신부는 빔포밍을 수행할 수 있다. 통신부는 상술한 바와 같이 신호를 송신 및 수신할 수 있다. 이에 따라, 통신부의 전부 또는 일부는 '송신부', '수신부' 또는 '송수신부'로 지칭될 수 있다. 또한, 이하 설명에서 무선 채널을 통해 수행되는 송신 및 수신은 통신부에 의해 상술한 바와 같은 처리가 수행되는 것을 포함하는 의미로 사용된다. 저장부는 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장할 수 있다. 저장부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공할 수 있다. 제어부는 단말의 전반적인 동작들을 제어할 수 있다. 예를 들어, 제어부는 통신부를 통해 신호 를 송신 및 수신할 수 있다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽는다. 그리고, 제어부 는 통신 규격에서 요구하는 프로토콜 스택의 기능들을 수행할 수 있다. 이를 위해, 제어부는 적어도 하나의 프로세서 또는 마이크로(micro) 프로세서를 포함하거나, 또는, 프로세서의 일부일 수 있다. 또한, 통신 부 의 일부 및 제어부는 CP(communication processor)라 지칭될 수 있다. 다양한 실시예들에 따라, 제어부는 무선 통신망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 단말이 다양한 실시예들에 따른 동작들을 수행하도록 제어할 수 있다. 본 개시의 다양한 실시예들에 따라, 단말은 ME(mobile equipment)와 USIM(UMTS(universal mobile telecommunications service) subscriber identity module)으로 구성될 수 있다. ME는 MT(mobile terminal)와 TE(terminal equipment)를 포함할 수 있다. MT는 무선 접속 프로토콜이 동작하는 부분일 수 있고, TE는 제어 기 능이 동작하는 부분일 수 있다. 예를 들어, 무선 통신 단말(예: 이동전화)의 경우 MT와 TE는 통합되어 있을 수 있고, 노트북의 경우에는 MT와 TE가 분리되어 있을 수 있다. 본 개시는 각 구성의 동작에 따라, ME와 USIM을 구 분되는 엔티티로 표현할 수 있으나, 이에 제한되지 않고 ME와 USIM을 포함하여 단말(예: UE)이라고 표현되거나 ME가 단말이라고 표현되어 본 개시의 다양한 실시예들이 서술될 수 있다. 도 7은 본 개시의 일 실시예에 따른 네트워크 엔티티의 기능적 구조의 예를 도시한다. 본 개시의 다양한 실시예들에 따른 무선 통신 시스템에서 네트워크 엔티티의 구성요소를 도시한다. 이하 사용되는 '...부', '... 기' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 7의 네트워크 엔티티는 도 1 내지 도 5에서 설명 된 네트워크 엔티티(Network entity) 또는 네트워크 기능(Network function)들과 대응할 수 있다. 도 7을 참고하면, 본 개시의 일 실시예에 따른 네트워크 엔티티는 통신부, 저장부, 제어부(71 5)를 포함하여 구성될 수 있다. 통신부는 네트워크 내 다른 장치들과 통신을 수행하기 위한 인터페이스를 제공할 수 있다. 즉, 통신부 는 네트워크 엔티티에서 다른 장치로 송신되는 비트열을 물리적 신호로 변환하고, 다른 장치로부터 수신되 는 물리적 신호를 비트열로 변환할 수 있다. 즉, 통신부는 신호를 송신 및 수신할 수 있다. 이에 따라, 통 신부는 모뎀(modem), 송신부(transmitter), 수신부(receiver) 또는 송수신부(transceiver)로 지칭될 수 있다. 이때, 통신부는 네트워크 엔티티가 백홀 연결(예: 유선 백홀 또는 무선 백홀)을 거쳐 또는 네트워크 를 거쳐 다른 장치들 또는 시스템과 통신할 수 있도록 구성될 수 있다. 저장부는 코어 망 객체의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장할 수 있다. 저장부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성 될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공할 수 있다. 제어부는 네트워크 엔티티의 전반적인 동작들을 제어할 수 있다. 예를 들어, 제어부는 통신부를 통해 신호를 송수신할 수 있다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽을 수 있다. 이를 위 해, 제어부는 적어도 하나의 프로세서(processor)를 포함할 수 있다. 본 개시의 다양한 실시예들에 따라, 제어부는 무선 통신망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 코어 망 객체가 후술하는 다양한 실시예들에 따른 동작들을 수행하도록 제어할 수 있다. 본 개시의 일 실시예에 대한 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식 별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시가 용어들에 한정되는 것 은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예실시예들에 따른 방법들을 실행하게 하는 명령어(instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 복수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근 (access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치 는 외부 포트를 통하여 본 개시의 실시예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크 상의 별도의 저장 장치가 본 개시의 실시예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 본 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다."}
{"patent_id": "10-2024-0022040", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 5G 시스템의 네트워크 구조 및 인터페이스를 도시한 도면이다. 도 2는 본 개시의 일 실시 예에 따른 UE의 untrusted Non-3GPP Access를 통한 5GC 등록 과정을 도시한 도면이 다. 도 3은 본 개시의 일 실시 예에 따른 AF에서 untrusted Non-3GPP Access를 통한 서비스 중인 QoS 플로어에 대 한 L4S 서비스 지원 요청에 따른 N3IWF의 동작을 도시한 도면이다. 도 4A 및 도 4B는 본 개시의 일 실시 예에 따른 untrusted Non-3GPP Access를 통한 5GC 등록 및 PDU 세션 연결 과정 중 IPsec SA의 ECN capability 정보를 SMF에 전달하는 동작을 설명하기 위한 순서도이다. 도 5A는 본 개시의 일 실시 예에 따른 L4S 지원을 위한 QoS 플로어 업데이트 동작 및 방법을 설명하기 위한 순 서도이다. 도 5B는 본 개시의 일 실시 예에 따른 L4S 지원을 위한 QoS 플로어 업데이트 동작 및 방법을 설명하기 위한 순 서도이다. 도 6은 본 개시의 일 실시예에 따른 단말의 기능적 구조의 예를 도시한다. 도 7은 본 개시의 일 실시예에 따른 네트워크 엔티티의 기능적 구조의 예를 도시한다."}
