{"patent_id": "10-2025-7005794", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038790", "출원번호": "10-2025-7005794", "발명의 명칭": "방법, 리소그라피 마스크, 리소그라피 마스크의 사용, 및 처리 장치", "출원인": "칼 짜이스 에스엠티 게엠베하", "발명자": "리히노프, 다니엘"}}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내지 청구항 5 중 어느 한 항에 있어서, 결정된 상기 프로파일(VER, VER0, VER1)은 선택된 상기 에지(111 내지 113)의 복수의 실제 포지션을 포함하고, 상기 참조 프로파일(REF, REF0, REF1)은 복수의 대응하는 타겟 포지션을 포함하며,단계 d): 상기 수리 부분(121 내지 123)에서 선택된 상기 에지(111 내지 113)의 결정된 프로파일(VER, VER0,VER1)이 상기 참조 프로파일(REF, REF0, REF1)과 관련하여 미리 결정된 허용 범위 내에 위치하는지를 결정하는단계를 더 포함하며;단계 d)에서, 각각의 실제 포지션과 각각의 타겟 포지션 사이의 거리가 결정되며, 각각의 결정된 상기 거리는미리 결정된 허용 값과 비교되는, 리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 단계 c)는:상기 참조 프로파일(REF, REF0, REF1)을 결정된 상기 프로파일(VER, VER0, VER1) 상에 가상으로(virtually) 중첩하는 단계를 포함하며, 상기 참조 프로파일(REF, REF0, REF1)은 선택된 상기 에지(111 내지 113)에서 및/또는선택된 상기 에지(111 내지 113)에 바로 인접한 에지에서 및/또는 선택된 상기 에지(111 내지 113)에 0°와는상이한 각도로 연결되는 에지에서 및/또는 서로에 관해 0°와는 상이한 각도로 연장하는 선택된 상기 에지(111내지 113)의 부분들(112A, 112B) 사이의 코너에서 정렬되는, 리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 수리 부분(121 내지 123)을 벗어난 선택된 상기 에지(111 내지 113)의 하나 이상의 부분(112A, 112B, 113A, 113B)에서 상기 참조 프로파일(REF, REF0, REF1)을 정렬하는 단계를 포함하는, 리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1 내지 청구항 3 중 어느 한 항에 있어서, 상기 참조 프로파일(REF, REF0, REF1)을 결정하는 단계는:저역 필터 및/또는 피스와이즈(piecewise) 선형 회귀를 적용하여 상기 참조 프로파일(REF, REF0, REF1)을 평활화하는(smooth) 단계를 포함하는, 리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 내지 청구항 4 중 어느 한 항에 있어서, 상기 참조 프로파일(REF, REF0, REF1)을 결정하는 단계는:선택된 상기 에지(111 내지 113)에 대응하는 다수의 에지의 다수의 각각의 프로파일을 결정하는 단계, 및상기 참조 프로파일(REF, REF0, REF1)을 상기 다수의 프로파일의 평균으로서 결정하는 단계를 포함하는, 리소그라피 마스크 점검 방법.공개특허 10-2025-0038790-3-청구항 6"}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1 내지 청구항 6 중 어느 한 항에 있어서, 결정된 상기 프로파일(VER, VER0, VER1)은 선택된 상기 에지(111 내지 113)의 다수의 실제 포지션을 포함하며, 상기 실제 포지션의 분포이며, 단계 b) 다음에, 상기 분포의적어도 하나의 모멘트가 결정되며, 단계 b1, 단계 c) 및/또는 단계 d)가 상기 적어도 하나의 결정된 모멘트를기반으로 하여 수행되며, 단계 d)는: 상기 수리 부분(121 내지 123)에서 선택된 상기 에지(111 내지 113)의 결정된 프로파일(VER, VER0, VER1)이 상기 참조 프로파일(REF, REF0, REF1)과 관련하여 미리 결정된 허용 범위 내에 위치하는지를 결정하는 단계(S4)를 포함하는, 리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1 내지 청구항 7 중 어느 한 항에 있어서, 단계 c)에 따른 비교를 기반으로 및/또는 상기 적어도 하나의부분 영역에서 선택된 에지(111 내지 113)의 프로파일(VER, VER0, VER1)이 단계 d)에서 허용 범위를 벗어나 위치하는 것으로 결정된다면, 상기 수리 부분(121 내지 123)의 적어도 하나의 부분 영역에서 선택된 상기 에지(111 내지 113)에 대한 수리 공정을 수행하는 단계를 또한 포함하며, 단계 d)는: 상기 수리 부분(121 내지 123)에서 선택된 상기 에지(111 내지 113)의 결정된 프로파일(VER, VER0, VER1)이 상기 참조 프로파일(REF,REF0, REF1)과 관련하여 미리 결정된 허용 범위 내에 위치하는지를 결정하는 단계(S4)를 포함하는, 리소그라피마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서, 상기 수리 공정은 선택된 상기 에지(111 내지 113)의 결정된 프로파일(VER, VER0, VER1)과상기 참조 프로파일(REF, REF0, REF1) 사이의 차이를 기반으로 하여 수행되는, 리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8 또는 청구항 9에 있어서, 상기 수리 공정은 입자 빔-유도 에칭 공정 및/또는 퇴적 공정을 포함하는,리소그라피 마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 1 내지 청구항 10 중 어느 한 항에 있어서, 선택된 상기 에지(111 내지 113)에 대한 참조 프로파일(REF,REF0, REF1)은 상기 리소그라피 마스크(100)에 대한 마스크 설계를 기반으로 하여 또한 결정되는, 리소그라피마스크 점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1 내지 청구항 11 중 어느 한 항에 있어서, 단계 a)는:상기 리소그라피 마스크(100)의 전자 현미경 이미지 및/또는 상기 리소그라피 마스크(100)의 에어리얼 이미지및/또는 상기 리소그라피 마스크(100)의 원자력 현미경 이미지를 포착하는 단계를 포함하는, 리소그라피 마스크점검 방법."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 1 내지 청구항 12 중 어느 한 항에 기재된 방법을 사용하여 제조되는, 특히 EUV 리소그라피용 리소그라공개특허 10-2025-0038790-4-피 마스크(100)."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 기재된 리소그라피 마스크(100)의 리소그라피 장치에서의 사용."}
{"patent_id": "10-2025-7005794", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "리소그라피 마스크(100)를 점검하고 및/또는 수리하기 위한 처리 장치(200)로서, 상기 리소그라피 마스크(100)는 상기 리소그라피 마스크(100)의 부분 영역들 사이에 다수의 에지(110)를 가지며, 상기 처리 장치(200)는:선택된 에지(111 내지 113)의 수리 부분(121 내지 123)을 포함하는 상기 리소그라피 마스크(100)의 수리 영역(130)의 이미지 표현(IMG)을 포착하기 위한 포착 유닛(212),상기 수리 영역(130)의 포착된 이미지 표현(IMG)을 기반으로 하여 상기 수리 부분(121 내지 123)에서 선택된 상기 에지(111 내지 113)의 프로파일(VER, VER0, VER1)을 결정하기 위한 결정 유닛(218), 및선택된 상기 에지(111 내지 113)에 대응하는 에지(110, 110', 113A, 113B)의 프로파일을 기반으로 하여 참조 프로파일(REF, REF0, REF1)을 결정하기 위한 처리 유닛(220)으로서, 대응하는 상기 에지(110, 110', 113A, 113B)는 수리되지 않아야 하는 에지(110, 110') 또는 수리되지 않아야 하는 선택된 상기 에지(111 내지 113)의 부분(113A, 113B)이며, 대응하는 상기 에지(110, 110', 113A, 113B)는 상기 수리 영역(130)의 포착된 이미지 표현(IMG)을 기반으로 하여 결정되며, 상기 처리 유닛(220)은 결정된 상기 프로파일(VER, VER0, VER1)을 상기 참조 프로파일(REF, REF0, REF1)과 비교하도록 더 구성되는, 상기 처리 유닛(220)을 포함하는, 처리 장치."}
{"patent_id": "10-2025-7005794", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은, 리소그라피 마스크의 수리를 위해 리소그라피 마스크를 점검하기 위한 방법으로서, 리소그 라피 마스크는 리소그라피 마스크의 부분 영역들 사이에 다수의 에지를 가지며, 수리의 목적이 선택된 에지(111 내지 113)의 수리 부분(121 내지 123)에서 선택된 에지(111 내지 113)의 프로파일(VER, VER0, (뒷면에 계속)"}
{"patent_id": "10-2025-7005794", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은, 리소그라피 마스크를 점검하기 위한 방법, 이 방법을 사용하여 제조된 리소그라피 마스크, 그러한 리소그라피 마스크의 사용 및 리소그라피 마스크를 점검 및/또는 처리하기 위한 처리 장치에 관한 것이다."}
{"patent_id": "10-2025-7005794", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "우선 출원 DE 10 2022 118 920.1의 내용이 그 전체가 참조로서 인용된다. 마이크로리소그라피가 마이크로 구조의 구성요소 부품, 예컨대 집적회로의 제조에 사용된다. 마이크로리소그라 피 공정은, 조명 시스템과 투영 시스템을 갖는 리소그라피 장치를 사용하여 실행된다. 조명 시스템에 의해 조명 되는 마스크(레티클)의 이미지가 여기서 투영 시스템에 의해 기판, 예컨대 실리콘 웨이퍼 상에 투영되며, 이 웨 이퍼는 감광 층(포토레지스트)으로 코팅되며 투영 시스템의 이미지 평면에 배치되어 마스크 구조를 기판의 감광 코팅에 전사한다. 집적 회로의 제조 시 더욱더 소형의 구조에 대한 요구가 있어서, 0.1nm에서 30nm까지의 범위, 특히 13.5nm의 파 장을 갖는 광을 사용하는 EUV 리소그라피 장치가 현재 개발 중이다. 대부분의 소재가 이 파장의 광을 흡수하므 로, 그러한 EUV 리소그라피 장치에서 렌즈 요소라고 하는 - 앞서 기재한 바와 같이 - 굴절 광학기기 대신, 미러 라고 하는 반사성 광학기기를 사용하는 것이 필요하다. 마이크로 구조의 구성요소는 실리콘 웨이퍼와 같은 반도체 기판의 기반 상에, 특히 층별로(layer-by-layer) 제 조된다. 예컨대, 포토레지스트가 각각의 층을 제조할 목적으로 먼저 도포된다. 포토레지스트는 구조화된 방식으 로, 이를 위해 사용되는 리소그라피 마스크로 경화된다. 이 경우에, 리소그라피 마스크 상에 명기된 구조는 포 토레지스트를 가진 기판 상에 감소한 크기로 이미징된다. 포토레지스트는 고 조명 세기를 갖는 개소들 상에서 경화하지만, 저 조명 세기를 갖는 개소들 상에서는 그렇게 되지 않는다. 비-경화된 영역은 후속한 린싱 단계에 서 기판으로부터 제거될 수 있다. 그러므로 리소그라피 마스크의 구조는 경화된 포토레지스트의 형태로 기판에 전사된다. 이제, 에칭 단계 또는 퇴적 단계가 구현될 수도 있으며, 이들 단계는 포토레지스트가 존재하지 않는 자유(free) 영역에서만 기판에 영향을 미친다. 후속하여, 경화된 포토레지스트는 마찬가지로 제거될 수 있다. 마이크로 구조의 구성요소를 제조하기 위해, 복수의 층이 앞서 빈번하게 기재한 바와 같이 기판 상에서 위아래 로 제조될 필요가 있다. 이 경우에, 전용 리소그라피 마스크가 통상 각 층마다 필요하다. 각각의 리소그라피 마스크가 통상 매우 많은 수의 개별 구성요소, 예컨대 수천, 수만, 수십만 또는 심지어 수 백만개의 구성요소의 제조에 사용된다. 리소그라피 마스크가 결함을 갖는다면, 즉 리소그라피 마스크 상의 구조 가 상정된 영역 내에 배치되지 않는다면, 이 결함은 리소그라피 마스크를 사용한 각각의 노광 절차 동안, 포토 레지스트에 전사되며, 그리하여 기판에 전사된다. 그러한 리소그라피 마스크를 사용하여 제조된 마이크로 구조 의 구성요소는 결함이 있을 수도 있다. 그러므로 사용된 리소그라피 마스크가 결함이 없는 것이(defect-free) 매우 중요하다. 이러한 환경에서, 리소그라피 마스크의 점검 및 수리에 매우 노력을 기울이는 것은 가치가 있다. 알려진 수리 공정은 예컨대 입자 빔에 의해 의도적으로 고 분해능으로 실행될 수 있는 입자 빔-유도 에칭 또는 퇴적 공정을 기반으로 한다. 그러나 각각의 수리에 적절한 공정 설정을 결정하며 수리 다음에 수리된 영역의 품 질을 평가하는 것은 어려운 일이다. DE 10 2019 218 517A1은 마이크로리소그라픽 마스크를 점검하기 위한 방법을 개시하며, 여기서 마스크의 적어도 일부분의 에어리얼 이미지가 생성되며 포착 디바이스에 의해 포착되어 참조 이미지와 비교되며, 포착된 에어리 얼 이미지와 참조 이미지의 비교는 에어리얼 이미지와 참조 이미지에서 적어도 하나의 비교 라인을 따른 이미지 정보의 비교에 의해 구현되며, 이때 비교 라인은 마스크의 구조 요소의 적어도 하나의 경계 라인에 실질적으로 수직으로 연장한다."}
{"patent_id": "10-2025-7005794", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이러한 배경에 따라, 본 발명의 목적은 리소그라피 마스크를 점검하기 위한 개선된 방법을 제공하는 것이다."}
{"patent_id": "10-2025-7005794", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "제1 양상에 따라, 리소그라피 마스크의 수리를 위해 리소그라피 마스크를 점검하기 위한 방법이 제안된다. 리소 그라피 마스크는 리소그라피 마스크의 부분 영역 사이에 다수의 에지를 가지며, 수리의 목적이 선택된 에지의 수리 부분에서 이 선택된 에지의 프로파일의 조정에 놓인다. 이 방법은 다음의 단계: a) 선택된 에지의 수리 부분을 포함하는 리소그라피 마스크의 수리 영역의 이미지 표현을 포착하는 단계, b) 수리 영역의 포착된 이미지 표현을 기반으로 하여 수리 부분에서 선택된 에지의 프로파일을 결정하는 단계, c) 선택된 에지의 결정된 프로파일을 선택된 에지에 대한 참조 프로파일과 비교하는 단계, 및 d) 예컨대 결정된 프로파일의 참조 프로파일과의 비교를 기반으로 하여, 수리 부분에서 선택된 에지의 결정된 프로파일이 참조 프로파일과 관련하여 미리 결정된 허용 범위 내에 위치하는지를 결정하는 단계를 포함한다. 이 방법은 에지 자체의 프로파일이, 구현된 수리의 성공을 점검할 목적으로 또는 그 밖에 처리할 리소그라피 마 스크 상의 영역을 결정하기 위해, 리소그라피 마스크의 추가 에지와 독립적으로, 취해진다는 장점이 있다. 종래 기술에서, 수리 완료 다음에는, 통상 반대편 에지까지 수리된 에지에 의해 경계가 정해지는 구조의 폭의 결정이 오며, 이 폭은 (\"임계 치수\"로 알려진) 최대 폭과 비교된다. 그러나 이 알려진 방법에서의 결정은 또한 반대편 에지의 변동(variations)을 포함하며, 이런 이유로 수리의 평가가 부정확하며 아마도 심지어 흠결이 있다. 특히, 종래의 방법을 사용하여 성공적으로 수리된 것으로 결정된 수리된 에지가 사실 그 규격을 벗어나, 아마도 리소그라피 마스크를 사용하여 제조된 구성요소에 결함을 야기하는 상황이 발생할 수도 있다. 이 상황은 본 발 명을 사용하여 회피할 수 있으며, 이는, 본 발명에 따르면, 에지의 프로파일이 참조 프로파일과 비교되기 때문 이며, 그에 따라 반대편 에지의 변동은 평가에 포함되지 않는다. 제안된 방법은 수리 형상을 결정하는데 및 수리된 에지의 프로파일을 평가하는데 모두 사용될 수 있다. 리소그라피 마스크는, 에지에 의해 서로 분리되는 적어도 2개의 부분 영역을 포함한다. 이들 부분 영역은 또한 구조 요소로 지칭할 수도 있다. 예컨대, 흡수 마스크는 입사 광을 흡수하는 제1 부분 영역과, 입사 광을 실질적 으로 투과하는 제2 부분 영역을 갖는다. 흡수재 층이, 특히 제1 부분 영역에서 리소그라피 마스크 상에 존재하 는 반면, 리소그라피 마스크는 제2 부분 영역에서 투명 층으로 코팅되거나 코팅되지 않는다. 각각의 에지는 2개 의 부분 영역 사이에 경계를 형성한다. 리소그라피 마스크 기술에 의존하여, 이 리소그라피 마스크는 또한 위상 -시프트 부분 영역 및/또는 반사성 부분 영역을 포함할 수도 있다. 리소그라피 마스크의 품질을 평가할 때 1차적으로 중요한 것은, 각각의 에지의 프로파일이 미리 결정된 영역 내 에 위치한다는 점과, 각각의 에지가 가능한 \"경사져(steep)\" 있다는 점이다. 에지가 더 경사진다고 간주될수록, 에지 각은 90°에 더 가깝다. 경사진 에지는 각각의 부분 영역 사이에 고 콘트래스트 또는 급격한 전환을 초래 한다. 추가 품질 파라미터는 가능한 평활화된(smooth), 즉 프로파일의 평균 주변의 에지의 프로파일의 산란이 가능한 작은 에지의 프로파일을 포함한다. 리소그라피 마스크가 받게 되거나 받은 수리의 목적은, 선택된 에지가 미리 결정된 프로파일에 대응하는 방식으 로 이 에지의 프로파일을 변경하는 것이다. 예컨대, 미리 결정된 프로파일은 참조 프로파일에 의해 주어진다. 예컨대 수리 전 리소그라피 마스크가 결함을 갖는다고 말할 수 있을 것이며, 결함은 수리 부분에서 선택된 에지 의 에러 프로파일에 의해 특징화된다. 특히, 에러 프로파일은 에지가 지점들 또는 부분들에서 참조 프로파일 주 위의 허용 범위를 벗어나 연장할 때마다 주어진다. 특히, 선택된 에지는 결함을 갖는 에지이다. 에지 선택은 선행하는 검사 단계, 예컨대 리소그라피 마스크가 그 제조 다음의 결함이 없음(a lack of faults)에 대해 검사할 때 구현될 수 있거나, 이미 수행된 수리 공정의 범 위 내에서 구현될 수 있다. 예컨대, 선택된 에지, 특히 수리 부분의 위치가 리소그라피 마스크와 관련하여 좌표 에 의해 명시된다. 바람직하게도, 본 경우의 \"에지\"는 전체 에지나 에지의 부분만을 지칭한다. 이하에서 상세하게 기재될 수리 부분, 선택된 에지 및/또는 규칙적인 또는 대응하는 에지(들)가 리소그라피 마 스크(또는 임의의 다른 리소그라피 마스크)의 이미지 표현 또는 추가 이미지 표현에서 바람직하게는 에지 찾기 방법에 의해 선택될 수 있다. 이 경우, 선택된, 규칙적인 및/또는 대응하는 에지의 프로파일이 알려진 이미지 평가 방법에 의해, 예컨대 캐니(Canny) 연산자, 소벨(Sobel) 연산자, 라플라스 연산자, 스레시홀딩 연산자, 로 버츠(Roberts) 연산자 및/또는 프리윗(Prewitt) 연산자를 적용함으로써 이미지 표현 또는 추가 이미지 표현으로 부터 결정될 수 있다. 대안에서, 수리 부분은 또한 이미지 표현 또는 추가 이미지 표현에서 수동으로 선택될 수 있다. 추가 대안에서, 수리 부분은 리소그라피 마스크 또는 다른 리소그라피 마스크의 수리 공정으로부터의 포 지션 정보를 기반으로 하여 선택될 수 있다. 마찬가지로, 실시예는, 예컨대 리소그라피 마스크가 수리를 받았으며(선택된 에지는 아마도 여기서 찾는다) 수 리가 없었던(규칙적인 및/또는 대응하는 에지는 아마도 여기서 찾는다) 결함 지점을 앎으로써 리소그라피 마스 크로부터의 기하학적 정보를 기반으로 하여 선택될 선택된, 규칙적인 또는 대응하는 에지, 특히 선택된 에지의 수리 부분을 제공한다. 리소그라피 마스크의 수리 영역의 이미지 표현은 제1 단계 a)에서 포착된다. 수리 영역은 선택된 에지, 특히 선 택된 에지의 수리 부분을 포함한다. 그에 따라, 이미지 표현에서, 수리 영역은 바람직하게는 수리 부분보다 크 며 적어도 선택된 에지가 자리하는 영역에 표시한다. 수리 영역은 게다가 리소그라피 마스크의 추가 에지 및/또 는 에지 부분, 특히 수리될 필요가 없는 그러한 에지 및/또는 에지 부분을 포함할 수도 있다. 다시 말해, 수리 영역은 적어도 하나의 정상 또는 결함이 없는 에지를 가질 수도 있다. 수리 부분을 갖는 선택된 에지 외에, 하 나 이상의 추가 에지 - 그 각각의 참조 프로파일 주위에서 그 각각의 허용 범위 내에서 연장함 - 를 이미지 표 현에서 그에 따라 볼 수도 있다. 현재, 이들 에지는 또한 규칙적인 에지로 칭한다. 수리 부분에서 선택된 에지의 프로파일은 단계 b)에서 포착된 이미지 표현으로부터 결정된다. 특히, 이 단계는 이미지 처리 방법, 예컨대 이미지 표현의 변환(회전, 신장, 수정(rectification), 반사(reflection) 등) 및/또 는 이미지 표현의 전-처리(콘트래스트 증가, 분해능 변화, 특히 증가, 미리 결정된 콘볼루션 커넬(convolution kernel)로의 콘볼루션 등)를 포함한다. 이미지 처리 방법은 종래의 알고리즘을 기반으로 할 수도 있으며 및/또 는 또한 인공지능, 특히 신경망을 기반으로 할 수도 있다. 각각의 에지는 이미지 표현에서, 특히 변환된 및/또는 전-처리된 이미지 표현에서, 다른 이미지 영역에 비해 고 콘트래스트에 의해 표시된다. 그에 따라, 에지는 알려진 에지 검출 방법을 적용함으로써 이미지 표현으로부터 추출될 수 있다. 다수의 에지, 예컨대 선택된 에지 외에 추가 규칙적인 에지를 이미지 표현에서 볼 수 있다면, 이 선택된 에지가 위치한 이미지 표현의 수리 영역 또는 이미지 영역이 선택 단계에서 선택될 수 있다. 선택 단 계는 예컨대 선택된 에지의 위치의 명시된 좌표를 기반으로 하여 자동으로, 또는 그 밖에 운영자에 의해 수동으 로 구현될 수 있다. 이미지 표현이 픽셀 매트릭스를 갖는 디지털 이미지의 형태라면, 결정된 프로파일은 특히 픽셀의 세트를 포함한 다. 이것이 의미하는 점은 프로파일은 세트 내의 픽셀의 위치에 의해 결정된다는 점이다. 프로파일은 바람직하 게는 라인에 의해 명시된다. 예컨대, 라인은 평균을, 특히 픽셀을 기반으로 한 실행 평균(running mean)으로서, 계산함으로써 결정될 수 있다.선택적으로, 단계 b1)가 제공되며, 이 단계는: 선택된 에지에 대응하는 에지의 프로파일을 기반으로 하여 참조 프로파일을 결정하는 단계를 포함하며, 대응하는 에지는, 수리되지 않아야 하는 에지 또는 수리되지 않아야 하 는 선택된 에지의 부분이며, 대응하는 에지는 리소그라피 마스크 또는 추가 리소그라피 마스크의 포착된 이미지 표현 또는 추가 이미지 표현을 기반으로 하여 결정된다. 바람직하게도, 대응하는 에지의 프로파일은 참조 프로파일을 결정하기 위해 단계 b1)에서 사용된다. 대응하는 에지는, 규칙적인 에지, 앞서 기재한 바와 같이, 정상 또는 결함이 없는 에지이다. 이 에지는 바람직하게는 프 로파일 1을 가지며, 이 프로파일 1은 선택된 에지의 프로파일 2가 또한 정상 또는 결함이 없었다면 이 프로파일 2에 대응할 것이다. 이 경우, 바람직하게도 \"대응하는\"이 의미하는 점은 프로파일 1 및 프로파일 2가 기술적으 로 가능하거나 유리한 것 내에서 동일하다는 점이다. 대안적으로 또는 게다가, 이 경우에 \"대응하는\"이 의미하 는 점은 프로파일 1 및 프로파일 2가 단계 a) 내지 단계 c)에 따른 점검 방법이 DUV 또는 EUV 범위에 대해 허용 될 수 있는 에러를 겪는 범위에 대응한다는 점이다. \"동일한\" 및 \"대응하는\"은 각각의 에지 또는 각각의 에지 부분의 형상 및/또는 배향에 관련되지만, 리소그라피 장치 상의 그 각각의 포지션에는 관련되지 않으며, 이는 이 포지션이 일반적으로 상이하기 때문이다. 대응하는 에지를 찾기 위해, 규칙적인 에지 중 하나 이상이 동일할 수 있으며, 선택된 에지와, 특히 선택된 에 지의 하나 이상의 결함이 없는 부분과 또는 선택된 에지 및 다수(≥1)의 규칙적인 에지를 포함하는 수리 형상과 비교될 수 있다. 이것은 수동으로 또는 자동으로(에지 검출 또는 이미지 평가; 이하 참조) 구현될 수 있다. 충 분한 대응성이 결정되면, 대응하는 에지는 단계 b1)에서 참조 프로파일의 결정을 위한 근거로서 사용된다. \"리소그라피 마스크 또는 추가 리소그라피 마스크의 추가 이미지 표현\"은 바람직하게는 리소그라피 마스크 또는 선택된 에지의 수리 전에 기록된 리소그라피 마스크의 이미지 표현이다. 이미지 표현(또는 리소그라피 마스크 또는 다른 리소그라피 마스크의 추가 이미지 표현)을 포착하는 것은 특히 이미징 방법, 예컨대 전자 현미경, 특히 주사 전자 현미경을 사용하여 구현된다. 이미지 표현은 또한 리소그라 피 마스크 또는 수리 영역의 에어리얼 이미지로서 포착될 수 있다. 이를 위해, 웨이퍼 인쇄 또는 에어리얼 이미 지 측정 시스템, 예컨대 본 출원인의 AIMS 또는 WLCD 시스템이 사용될 수 있다. 이들 에어리얼 이미지 측정 시 스템에서, 검사할 리소그라피 마스크의 에어리얼 이미지가 생성되며, 그 동안, 이미징 설정은 투영 노광 장치에 서의 이미징 설정과 유사하거나 사실상 동일하다. 특히, 마스크가 사용되고자 하는 투영 노광 장치에서의 설정 들과 필적하는 리소그라피 마스크를 조명하기 위한 조명 시스템의 동일한 조명 설정 또는 적어도 유사한 조명 설정과 예컨대 편광 또는 개구수에 관해 투영 렌즈의 이미징 설정이, 리소그라피 마스크의 대응하는 이미징이 투영 노광 장치에서 어떻게 구현되는지를 가능한 한 정확히 또는 실제적으로 재현하기 위해 사용될 수 있다. 선택된 에지의 결정된 프로파일은 단계 c)에서 선택된 에지에 대한 참조 프로파일과 비교된다. 특히, 참조 프로 파일은 라인, 바람직하게는 수학적으로 정확히 규정된 라인이며, 이 라인은 예컨대 시작점과 끝점이 있는 직선 수학식에 의해 명시된다. 참조 프로파일은 기하학적 그림에 의해 명시될 수 있으며, 이 도면은 이미지 표현의 하나 이상의 지점에서 정렬된다. 예컨대, 기하학적 그림은 직선 또는 곡선 - 코너를 가질 수도 있음 - 이다. 기 하학적 그림은 또한 폐쇄된 형상, 예컨대 삼각형, 사각형, 직사각형, 원, 타원, 별 등을 형성할 수도 있다. 기 하학적 그림은 반드시 대칭 및/또는 규칙적일 필요는 없다. 선택적인 제4 단계 d)에서, 수리 부분에서의 선택된 에지의 결정된 프로파일이 예컨대 결정된 프로파일의 참조 프로파일과의 비교를 기반으로 하여 참조 프로파일에 관한 미리 결정된 허용 범위 내에 있는지의 결정이 있다. 특히, 허용 범위는 참조 프로파일 주위의 미리 결정된 영역이며, 이 영역 내에서, 선택된 에지는, 리소그라피 마스크를 사용하여 제조된 구조가 이 구조가 의도한 기능을 수행하기에 충분한 정확도로 반드시 배치되도록 연 장해야 한다. 허용 범위는, 예컨대 참조 프로파일과 관련하여 최대 허용 거리를 명시함으로써 참조 프로파일을 기반으로 하여 결정될 수 있다. 단계 b1), 단계 c) 다음에 또는 단계 d)에서, 첫째, 수리 방법 내에서 선택된 에지의 제1 또는 추가 처리가 필 요한지를 결정할 수 있다. 둘째, 구현된 수리 공정의 품질을 평가할 수 있다. 결국, 예컨대 또한 각각의 수리 공정에 대한 유리한 또는 매우 적절한 공정 설정에 대한 결론을 내릴 수 있으며, 결과적으로 각각의 수리 방법 은 시간이 지남에 따라 계속해서 개선되며 최적화된다. 방법의 실시예에 따라, 단계 c)는 선택된 에지에 대한 참조 프로파일을 결정된 프로파일 상에 가상으로 중첩하 는 단계를 포함하며, 참조 프로파일은 선택된 에지에서 및/또는 선택된 에지에 바로 인접한 에지에서 및/또는 선택된 에지에 0°와는 상이한 각도로 연결되는 에지에서 및/또는 서로에 관해 0°와는 상이한 각도로 연장하는선택된 에지의 부분들 사이의 코너에서 정렬된다. 특히, \"가상으로 중첩하는\"이 의미하는 점은 참조 프로파일과 결정된 프로파일이 조인트 다이어그램(joint diagram) 상에서 표시되며, 참조 프로파일이 하나 이상의 참조 포지션에서 결정된 프로파일에 관련하여 정렬된 다는 점으로 이해된다. 예컨대, 각각의 참조 포지션은 수리 부분에서 벗어난 선택된 에지의 포지션 및/또는 선 택된 에지에 인접한 에지의 포지션 및/또는 0°와 상이한 각도로 선택된 에지에 연결된 에지의 포지션이다. 미 리 결정된 프로파일에 관한 참조 프로파일의 정확한 정렬은 중요하며, 이는 허용 범위가 참조 프로파일에 관련 되기 때문이다. 예컨대, 참조 프로파일은 직선이다. 선택된 에지는 수리 부분에서 중단 및/또는 오프셋을 갖는다. 선택된 에지 의 프로파일은 바람직하게는 수리 부분 이전 및 이후이다. 이때, 참조 프로파일은 특히 수리 부분 이전 및 이후 선택된 에지의 프로파일에 정렬될 수 있다. 이를 위해, 에지의 프로파일의 각각의 피스와이즈 평균(piecewise mean)은 예컨대 수리 부분 이전 및 이후 결정될 수 있으며, 참조 프로파일은 각각의 평균에 정렬된다. 수리 부 분에서, 참조 프로파일은 그 후 대응하여 계속 연장한다. 또한, 수리 부분에서 선택된 에지가 참조 프로파일에 의해 보간(interpolate)된다고 할 수 있다. 본 방법의 추가 실시예에 따라, 방법은: 수리 부분을 벗어난 선택된 에지의 하나 이상의 부분에서 참조 프로파일을 정렬하는 단계를 포함한다. 본 방법의 추가 실시예에 따라, 단계 c)는: 수리 영역의 포착된 이미지 표현을 기반으로 한, 선택된 에지에 대응하는 에지의 프로파일을 기반으로 하여, 참 조 프로파일을 결정하는 단계를 포함한다. 특히, 선택된 에지에 대응하는 에지가, 선택된 에지가 가져야 하는 것과 동일한 프로파일을 갖는 규칙적인 에지 이다. 리소그라피 마스크는 종종 주기적 또는 반복적 구조를 가지며, 그런 이유로 그러한 대응하는 에지가 높은 확률로 포착된 이미지 표현에서 결정될 수 있다. 그러나 대응하는 에지는 리소그라피 마스크(또는 추가 리소그 라피 마스크)의 동일한 이미지 표현에서보다는 추가 이미지 표현 - 리소그라피 마스크의 추가 또는 상이한 영역 을 보여줌 - 에서 결정되게 될 수 있다. 이 실시예에서, 참조 프로파일은 이미지 표현으로부터 바로 결정되며, 규칙적인 에지의 프로파일이 이에 관해 근거로서 역할을 한다. 이점은, 포착된 이미지 표현과 별도로, 추가 규격 또는 정보가 이 방법을 수행하는데 필 요하지 않다는 이점이 있다. 참조 프로파일 결정의 근거가 되는 대응하는 에지는 선택된 에지의 부분일 수 있으며, 반드시 상이한 에지일 필 요는 없음을 알 수 있다. 이 방법의 추가 실시예에 따라, 참조 프로파일을 결정하는 단계는: 저역 필터 및/또는 피스와이즈 선형 회귀(piecewise linear regression)를 적용하여 참조 프로파일을 평활화하 는 단계를 포함한다. 리소그라피 마스크 상의 모든 실제 에지는 제조 공정에 의존하는 통계적 변동을 갖는다. 이것은 에지 폭의 변동 (측면 경사도의 변동(variation of a flank steepness) 및 에지 포지션의 변동에 관련된다. 이들 변동은, 참조 프로파일 결정의 근거가 되는 이미지 표현의 분해능에 의존하여 볼 수 있으며, 그러므로 참조 프로파일에 영향 을 미칠 수도 있다. 그러므로 참조 프로파일은 마찬가지로 원치 않는 통계적 변동을 가질 것이다. 특히, 참조 프로파일의 통계적 변동은 또한 결정된 프로파일의 평가에 포함될 것이다. 이것은 참조 프로파일의 결정 전에 포착된 이미지 표현에 (또는 그밖에 이미 결정된 참조 프로파일에) 적용되는 저역 필터에 의해 및/또는 선형 회 귀에 의해 피스와이즈 방식으로 결정된 참조 프로파일을 근사화함으로써 회피될 수 있다. 이 방법의 추가 실시예에 따라, 참조 프로파일을 결정하는 단계는: 선택된 에지에 대응하는 다수의 에지의 다수의 각각의 프로파일을 결정하는 단계; 및 참조 프로파일을 다수의 프로파일의 평균으로서 결정하는 단계를 포함한다. 이것은, 마스크 잡음으로서 또한 지칭되는 통계적 에러가 평균을 계산함으로써 감소할 수 있다는 점에서 유리하 다. 실시예에서, 각각의 참조 프로파일은 포착된 이미지 표현의 참조 영역을 기반으로 하여 결정된다. 참조 영역은 규칙적인 에지가 존재하는 이미지 표현의 영역이며, 이 에지의 프로파일은 특히 선택된 에지의 수리 부분에서 선택된 에지에 대응한다. 참조 프로파일에 대한 다수의 후보가 이미지 표현에 존재한다면, 다수의 참조 영역을 그에 따라 결정할 수 있다. 예컨대, 참조 영역이 수리 부분을 포함하는 이미지 표현의 섹션의 자체 상관에 의해 결정될 수 있다. 예컨대, 다수의 참조 프로파일은 그 후 특히 픽셀 단위로 계산되는 산술 평균에 의해 또는 그 밖에 픽셀 단위로 계산되는 중간 값에 의해 평균화될 수 있다. 이 경우에, 중간 값을 형성하는 것은 산술 평균 에 비해 유리할 수도 있다. 이 방법의 추가 실시예에 따라, 결정된 프로파일은 선택된 에지의 복수의 실제 포지션을 포함하며, 참조 프로파 일은 복수의 대응 타겟 포지션을 포함하며, 단계 d)에서, 각각의 실제 포지션과 각각의 타겟 포지션 사이의 거 리가 결정되며, 각각의 결정된 거리는 미리 결정된 허용 값과 비교된다. 이미 앞서 기재한 바와 같이, 각각의 에지는 특정한 폭을 가지며, 이 폭은 특히 에지의 공칭 프로파일에 수직으 로 측정된다. 만곡된 프로파일의 경우에, 공칭 프로파일은 예컨대 탄젠트에 의해 지점 단위로 결정될 수 있다. 이 경우에, 각각의 실제 포지션은 예컨대 실제 포지션에서 에지의 폭의 평균점으로서 결정된다. 또한, 결정된 프로파일이 지점 세트를 포함하며, 개별 지점은 각각의 실제 포지션이라고 할 수 있다. 실제 포지션과 타겟 포지션 사이의 거리는 하나를 다른 하나에서 뺌으로써 결정될 수 있다. 이 거리가 미리 결 정된 허용 값 미만이라면, 각각의 실제 포지션은 허용 범위 내에 있다. 복수의 실제 포지션 각각의 그 각각의 타겟 포지션으로부터의 각각의 거리가 미리 결정된 허용 값 미만이라면, 대응하는 에지는 전체가 허용 가능하며, 수리되거나 처리될 필요가 없다. 이 방법의 추가 실시예에 따라, 결정된 프로파일은 선택된 에지의 다수의 실제 포지션을 포함하며, 실제 포지션 의 분포이며, 단계 b) 다음에, 분포의 적어도 하나의 모멘트가 결정되며, 단계 c) 및 d)가 적어도 하나의 결정 된 모멘트를 기반으로 하여 수행된다. 예컨대, 분포의 이 모멘트는 평균이며, 게다가 평균의 분산 또는 표준 편차 등을 포함할 수 있다. 특히, 수리 공정 또는 에지의 품질을 평가하기 위한 품질 척도(quality measure), 예컨대 참조 프로파일로부터 의 모멘트의 거리가 또한 모멘트 및 참조 프로파일과의 그 비교를 기반으로 하여 명시될 수 있다. 모멘트는 일부 실시예에서 피스와이즈로 결정된다. 예컨대, 수리 모멘트는 2개 이상의 부분으로 나뉘며, 각각의 모멘트는 이들 부분 각각에 대해 결정된다. 이 실시예는 특히 상대적으로 큰 수리 부분 및/또는 만곡된 또는 구 부러진(kinked) 프로파일의 경우에 유리하다. 단계 c) 및 d)가 적어도 하나의 결정된 모멘트를 기반으로 하여 수행된다는 것이 의미하는 것은, 예컨대 모멘트 가 단계 c)에서 선택된 에지에 대한 참조 프로파일과 비교되며, 수리 부분에서의 모멘트가 참조 프로파일에 관 해 미리 결정된 허용 범위 내에 위치하는지에 대한 결정이, 모멘트의 참조 프로파일과의 비교를 기반으로 하여, 수행된다는 점으로 이해된다. 이 방법의 추가 실시예에 따라, 이 방법은: 선택된 에지의 프로파일이, 적어도 하나의 부분 영역에서, 허용 범위를 벗어나 위치하는 것으로 단계 d)에서 결 정된다면, 수리 부분의 적어도 하나의 부분 영역에서 선택된 에지에 대한 수리 공정을 수행하는 단계를 포함한 다. 이 방법의 추가 실시예에 따라, 수리 공정은 선택된 에지의 결정된 프로파일과 참조 프로파일 사이의 차이를 기 반으로 하여 수행된다. 이 실시예에서, 수리 마스크는, 특히 결정된 프로파일과 참조 프로파일 사이의 차이를 기반으로 하여 결정된다. 수리 마스크는, 수리 공정에서 처리되어야 하는 이미지 표현에서의 이들 영역을 차단(mask)하는 마스크이다. 특 히, 소재를 제거하기 위한 에칭 공정이나 소재를 도포하기 위한 퇴적 공정이 수리 공정 동안 차단된 영역에서 수행된다. 수리 마스크는 또한 수리 형상으로 지칭될 수도 있다. 이 방법의 추가 실시예에 따라, 수리 공정은 입자 빔-유도 에칭 공정 및/또는 퇴적 공정을 포함한다. 구조가 매우 고 정밀도로, 특히 고 공간 분해능으로 입자 빔-유도 공정에 의해 생성될 수도 있다. 그러므로 에 지는 매우 고 정밀도로 처리될 수 있다. 처리 정확도는 특히 원자 범위에 있으며, 이것이 의미하는 점은, 공정 의 공간 분해능이 옹스트롱 및 나노미터 범위에 있을 수 있다는 점이다. 예컨대, 1nm의 간격으로 에지를 생성할 수 있다. 이점은 특히 전자 빔-유도 공정(EBIP)에 의해 유리하게도 가능하다. 각각의 입자 빔-유도 공정은 바람직하게는 전구체 가스의 공급 하에서 수행된다. 이 경우에, 전구체 가스는 처리될 리소그라피 마스크 상의 포지 션에 공급되며, 입자 빔은 집속 방식으로 이 포지션 상에 방출되며, 전구체 가스를 여기 및/또는 분해하며, 여 기된 종 및/또는 분해 산물이 리소그라피 마스크의 표면의 퇴적 또는 에칭을 야기한다. 특히, 주족 원소(main group element), 금속 또는 전이 원소의 알킬 화합물은 퇴적 또는 높은 구조물의 성장에 적합한 전구체 가스로 간주될 수 있다. 이에 대한 예로는 사이클로펜타디에닐(트리메틸)플래티넘(CpPtMe3 Me = CH4), 메틸사이클로펜타디에닐(트리메틸)플래티넘(MeCpPtMe3), 테트라메틸주석(SnMe4), 트리메틸갈륨(GaMe3), 페 로센(Cp2Fe), 비스아릴크롬(Ar2Cr), 및/또는 주족 원소, 금속 또는 전이 원소의 카르보닐 화합물, 예를 들어, 크 롬 헥사카르보닐(Cr(CO)6), 몰리브덴 헥사카르보닐(Mo(CO)6), 텅스텐 헥사카르보닐(W(CO)6), 디코발트 옥타카르 보닐(Co2(CO)8), 트리루테늄 도데카카르보닐(Ru3(CO)12), 철 펜타카르보닐(Fe(CO)5), 및/또는 주족 원소, 금속 또 는 전이 원소의 알콕사이드 화합물, 예를 들어, 테트라에톡시실란(Si(OC2H5)4), 테트라이소프로폭시티타늄 (Ti(OC3H7)4), 및/또는 주족 원소, 금속 또는 전이 원소의 할라이드 화합물, 예를 들어, 텅스텐 헥사플루오라이 드(WF6), 텅스텐 헥사클로라이드(WCl6), 티타늄 테트라클로라이드(TiCl4), 붕소 트리플루오라이드(BCl3), 실리콘 테트라클로라이드(SiCl4), 및/또는 주족 원소, 금속 또는 전이 원소와의 복합체, 예를 들어, 구리 비스(헥사플 루오로아세틸아세토네이트)(Cu(C5F6HO2)2), 디메틸골드 트리플루오로아세틸아세토네이트(Me2Au(C5F3H4O2)), 및/또 는 일산화탄소(CO), 이산화탄소(CO2), 지방족 및/또는 방향족 탄화수소와 같은 유기 화합물, 및 더 많은 것들 (more of the same)이 있다. 예컨대, 에칭 반응을 위한 전구체 가스는 다음을 포함할 수 있다: 제논 디플루오라이드(XeF2), 제논 디클로라이 드(XeCl2), 제논 테트라클로라이드(XeCl4), 증기(H2O), 중수(D2O), 산소(O2), 오존(O3), 암모니아(NH3), 니트로실 클로라이드(NOCl) 및/또는 다음 할로겐화물 화합물 중 하나: XNO, XONO2, X2O, XO2, X2O2, X2O4, X2O6, 여기서 X는 할로겐화물이다. 퇴적된 테스트 구조 중 하나 이상을 에칭하기 위한 추가 에칭 가스는 출원인의 미국 특허 출원 번호 13/0 103 281에 명시되어 있다. 또한, 테스트 구조를 생성할 때 사용할 수 있는 추가 가스로는 예를 들어 과산화수소(H2O2), 산화이질소(N2O), 산화질소(NO), 이산화질소(NO2), 질산(HNO3) 및 추가 산소 함유 가스와 같은 산화 가스, 및/또는 염소(Cl2), 염 화수소(HCl), 불화수소(HF), 요오드(I2), 요오드화수소(HI), 브롬(Br2), 브롬수소(HBr), 삼염화인(PCl3), 오염화 인(PCl5), 삼불화인(PF3) 및 추가 할로겐 함유 가스와 같은 할로겐화물, 및/또는 수소(H2), 암모니아(NH3), 메탄 (CH4) 및 추가 수소 함유 가스와 같은 환원 가스가 있다. 이러한 추가 가스는 예를 들어 에칭 공정에, 버퍼 가 스로서, 패시베이팅 매체 등으로서 사용될 수 있다. 이 방법의 추가 실시예에 따라, 선택된 에지에 대한 참조 프로파일은 리소그라피 마스크에 대한 마스크 설계를 기반으로 하여 결정된다. 예컨대, 마스크 설계는 파일의 형태로 이용 가능하며, 이 파일로부터, 각각의 에지의 정확한 프로파일이 추출될 수 있다. 바람직하게도, 마스크 설계는 참조 프로파일을 검색할 목적으로 \"대응하는 에지\"에 추가하여 사용될 수 있다. 본 방법의 추가 실시예에 따라, 단계 a)는: 리소그라피 마스크의 전자 현미경 이미지 및/또는 리소그라피 마스크의 에어리얼 이미지 및/또는 리소그라피 마 스크의 원자력 현미경 이미지를 포착하는 단계를 포함한다. 가능한 높은 분해능을 갖는 2차원 이미지가 본 방법을 수행하는데 충분하며; 그러나 예컨대 원자력 현미경에 의 해 획득한 3차원 이미지가 또한 본 방법을 수행하는데 적절하다. 3차원 이미지에서, 각각의 에지의 경사도의 평 가는 특히 2차원 이미지를 사용하여 달성할 수 있는 것보다 양호하며; 이점은 특정 경우에 유리할 수도 있다. 제2 양상에 따라, 리소그라피 마스크, 특히 제1 양상에 따른 방법을 사용하여 제조되는 EUV 리소그라피용 리소 그라피 마스크가 제안된다. EUV 리소그라피용 마스크는 특히 반사성 마스크이다. 제3 양상에 따라, 리소그라피 장치에서 제2 양상에 따른 리소그라피 마스크의 사용이 제안된다. 특히, 리소그라피 장치는 EUV 리소그라피 장치이다. 제4 양상에 따라, 리소그라피 마스크를 점검하며 및/또는 수리하기 위한 처리 장치가 제안된다. 리소그라피 마 스크는 리소그라피 마스크의 부분 영역들 사이에 다수의 에지를 갖는다. 처리 장치는: 선택된 에지의 수리 부분을 포함하는 리소그라피 마스크의 수리 영역의 이미지 표현을 포착하기 위한 포착 유닛, 수리 영역의 포착된 이미지 표현을 기반으로 하여 수리 부분에서 선택된 에지의 프로파일을 결정하기 위한 결정 유닛, 및 결정된 프로파일을 선택된 에지에 대한 참조 프로파일과 비교하기 위한 처리 유닛을 포함하며, 결정 유닛은, 예컨대 결정된 프로파일과 참조 프로파일의 비교를 기반으로 하여, 수리 부분에서 선택된 에지의 결정된 프로파일이 참조 프로파일과 관련하여 미리 결정된 허용 범위 내에 위치하는지를 결정하도록 더 구성된 다. 특히, 이 처리 장치는 제1 양상에 따른 방법을 수행하도록 구성된다. 제1 양상에 따른 방법과 관련하여 명시한 특성과 실시예는 그에 따라 제안된 처리 장치에 적용되며 그 역도 가능하다. 리소그라피 마스크는 더 구체적으로는 EUV 리소그라피 마스크이다. 예컨대, 포착 유닛은 리소그라피 마스크의 에어리얼 이미지를 포착하기 위한 전자 현미경 및/또는 장치를 포함 한다. 결정 유닛과 처리 유닛은 하드웨어 및/또는 소프트웨어의 형태로 구현될 수 있다. 하드웨어의 형태로의 구현인 경우에, 각각의 유닛은 예컨대 컴퓨터로서 또는 마이크로프로세서로서 설계될 수도 있다. 소프트웨어의 형태의 구현인 경우에, 각각의 유닛은 컴퓨터 프로그램 제품으로서, 함수(funciton)로서, 루틴으로서, 알고리즘으로서, 프로그램 코드의 일부로서 또는 수행 가능한 오브젝트로서 설계될 수도 있다. 처리 장치는 바람직하게는 출력 유닛, 예컨대 시각적 디스플레이 유닛 또는 통신 인터페이스를 포함하여 포착된 이미지 표현, 결정된 프로파일, 참조 프로파일, 참조 프로파일과 프로파일의 비교 및/또는 허용 범위를 출력한 다. 나아가, 처리 장치는 바람직하게는 입력 유닛을 포함하며, 이 입력 유닛에 의해, 운영자는 입력을 구현할 수 있다, 예컨대 이미지 표현에서 결정된 영역을 수리 영역으로서 선택하고, 에지를 선택하고, 수리 부분을 선 택하고, 참조 프로파일을 입력하고 및/또는 선택하는 등을 할 수 있다. 원칙적으로, 이미지 표현에서의 수리 부 분은 또한 자동으로 선택될 수 있다. 예컨대, 이것은 이미지 평가 방법을 이미지 표현에 적용함으로써 구현될 수 있으며, 이것은 예컨대 수리가 발생하는 리소그라피 마스크의 지점 또는 지점들을 인식할 수 있게 하며, 그 리하여 이들 지점들을 각각의 수리 부분으로서 선택한다. 수리 영역은 바람직하게는 이미지 표현에서 결정되는 상대적으로 큰 이미지 부분에 의해 선택되고 및/또는 규정 되고 및/또는 결정되며, 수리 부분은 시작 점으로서 사용된다. 수리 영역의 각각의 크기는 바람직하게는 리소그 라피 마스크의 패터닝 및/또는 에지 프로파일을 기반으로 하여 선택될 수 있다. 예컨대, 수리 영역의 크기는 수 리 부분의 크기 상에서 자체를 순응시킬 수 있으며, 수리 부분의 크기를 시작 점으로서 사용하여 스케일링될 수 있다. 처리 장치의 실시예에 따라, 이 처리 장치는 입자 빔-유도 에칭 공정 및/또는 퇴적 공정을 수행하도록 구성되는 처리 유닛을 더 포함한다. 처리 유닛은: 집속된 입자 빔을 리소그라피 마스크 상의 처리 포지션 상에 방출하기 위한 입자 빔 생성 유닛, 및 전구체 가스를 처리 포지션에 공급하기 위한 가스 공급 유닛을 포함하며, 전구체 가스는 입자 빔에 의해 반응 형태로 간접 또는 직접적으로 변환할 수 있는 가스 종을 포함하며, 가스 종의 반응 형태는 리소그라피 마스크와 의 화학 반응의 결과로서 에칭 공정 또는 퇴적 공정을 실행한다. 결국, 리소그라피 마스크의 처리는, 선택된 에지의 결정된 프로파일이 부분적으로(in portions) 허용 범위를 벗 어나 위치하는 것으로 확인된다면, 처리 장치를 사용하여 수행될 수 있다. 본 경우에 \"단수 형태(A 또는 an)\"가 정확히 하나의 요소로 제한되는 것으로 반드시 이해되어서는 안 된다. 오 히려, 다수의 요소, 예컨대 2개, 3개 이상이 또한 제공될 수 있다. 본 명세서에서 사용된 임의의 다른 수치는 정확히 언급한 수의 요소로의 제한이 있다는 효과로 이해되어야 하는 것은 아니다. 대신, 달리 지시하지 않는다 면, 상방 및 하방 수치 편차가 가능하다. 본 발명의 추가 가능 구현은 또한 예시한 실시예에 관해 앞서 또는 이후 기재하는 특성 또는 실시예의 조합 - 명시적으로 언급하지 않음 - 을 포함한다. 이 경우에, 당업자는 또한 본 발명의 각각의 기본 형태에의 개선 또 는 보충으로서 개별 양상을 추가할 것이다. 본 발명의 추가 유리한 구성 및 양상은 이후에 기재할 종속항 및 또한 본 발명의 예시적인 실시예의 요지이다. 본 발명은 첨부한 도면을 참조하여 바람직한 실시예를 기반으로 하여 설명될 것이다."}
{"patent_id": "10-2025-7005794", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "달리 지시하지 않는다면, 동일하거나 기능적으로 동일한 요소는 도면들에서 동일한 참조부호로 제공된다. 또한, 도면들에서의 예시는 반드시 실제 축적대로는 아님을 주목해야 한다. 도 1은 리소그라피 마스크의 예의 개략도를 도시한다. 리소그라피 마스크는 기판을 포함하며, 이 기판 상에는, 에지가 배치된다(이들 에지 중 2개가 예컨대 각각의 참조부호로 제공되었다). 각각의 에지는 리소그라피 마스크의 표면 상의 2개의 부분 영역 사이의 전환을 표시하며, 부분 영역 은 입사 복사선에 대한 상이한 속성을 갖는다. 특히, 리소그라피 마스크의 기판은 제1 속성을 가지며, 예컨대 이 기판은 투명 또는 반사성이며, 상이한 속성(특히, 제2 속성)을 갖는 영역이 제2 소재, 특히 흡수재 또는 위상-시프트 소재의 산발적 도포에 의해 제공된다. 또한, 제2 소재로 만든 구조가 리소그라피 마스 크 상에 존재한다고 할 수 있다. 예컨대, EUV 리소그라피 마스크는 브레그(Bragg) 격자에 의해 제공되는 반사성 기판 표면을 포함하며, 이들 구조는 흡수재 소재로부터 제조한다. 결국, 입사 EUV 복사선은 공간적으로 변조되며, 이는 이 복사선이 구조가 배치되지 않는 지점들에서만 반사되기 때문이다. 그러므로 리소그라피 마스 크는 (적어도) 2개의 영역 - 구조를 갖는 영역과 구조를 갖지 않는 영역 - 으로 나뉘는 표면을 갖는다. 3개의 에지(111, 112, 113)를 도 1에서 개별적으로 도시한다. 이들 3개의 에지(111, 112, 113) 각각은 결함을 갖는 각각의 수리 부분(121, 122, 123)을 갖는다. 예컨대, 이들 3개의 에지(111, 112, 113) 각각은 선택된 에지 이다. 각각의 수리 부분(121, 122, 123)은 수동으로 또는 자동으로 선택될 수 있다. 선택된 에지는 예컨대 중단부를 가지며, 이 중단부는 수리 부분에서 이 포지션에 존재하지 않아야 한 다. 선택된 에지는 예컨대 수리 부분에서 과잉 소재를 갖는다. 선택된 에지는 예컨대 수리 부분 에서 에지의 흠결이 있는(flawed) 프로파일을 갖는다. 선택된 에지와 관련하여, 수리 영역은 또 한 개략적으로 도시되며, 그 이미지 표현이 이하에서 기재할 방법의 범위 내에서 포착된다. 도 2는 리소그라피 마스크의 수리 영역의 이미지 표현(IMG)의 예를 도시하며, 이것은 예컨대 도 1에 서 도시한 수리 영역과 관련된다. 이미지 표현(IMG)은 예컨대 전자 현미경을 사용하여 포착되었으며, 복수 의 픽셀(PIX)을 갖는다. 예컨대, 각각의 픽셀(PIX)은 x 및 y 방향에서 그 포지션에 의해(도 3 참조) 및 그레이 스케일 값에 의해 규정된다. 수리 영역에서, 리소그라피 마스크는 라인형 구조를 가지며, 에지 는 서로 실질적으로 평행하게 연장한다. 리소그라피 마스크의 각각의 부분 영역은 2개의 각각의 에지 사이에 위치하며, 더 밝은 영역이 예컨대 흡수재 소재로 만든 구조를 나타내며, 더 어두운 영역이 리소그라피 마스크의 기판 표면을 도시한다. 선택된 에지는 수리 부분을 가지며, 여기서 에지는 오프셋으로연장하며; 이것은 규격에 대응하지 않으며 리소그라피 마스크를 사용한 노광의 경우에 제조된 구조에서 결 함을 초래할 수도 있다. 2개의 선택 영역(SEL0, SEL1)이 이미지(IMG)에 도시된다. 이들 선택 영역(SEL0, SEL1)은, 선택된 에지가 위치하는(선택 영역(SEL0)) 및 선택된 에지의 수리 부분이 위치하는(선택 영역(SEL1)) 이미지 표현 (IMG)의 영역을 나타낸다. 선택 영역(SEL0, SEL1)을 근거로서 사용하여, 특히 선택된 에지에 할당된 이미 지 표현(IMG)에서 픽셀(PIX)에 걸친 평균을 계산함으로써 선택된 에지의 프로파일(VER)을 결정할 수 있다 (도 3 참조). 특정 픽셀(PIX)의 에지에의 할당은 특히 그 그레이스케일 값을 기반으로 하여 구현된다. 도 3에서, 평균은, x의 함수로서, 할당된 픽셀(PIX)의 y 포지션과 관련하여 계산된다. 선택 영역(SEL0, SEL1)은 예컨대 선택된 에지 및 수리 부분의 좌표를 기반으로 하여 자동으로 또는 그 밖에 수동으로 결정될 수 있다. 선택된 에지의 프로파일(VER)은 에지 검출을 선택 영역(SEL0)에 적용함 으로써 결정될 수 있다. 선택 영역(SEL1)으로 인해, 또한 결정된 프로파일(VER)에서 수리 부분을 표시할 수 있다. 도 3은 선택된 에지의 결정된 프로파일(VER)의 예를 도시한다. 도 3은 선택된 에지의 결정된 프로파일(VER)(도 1 또는 도 2 참조) 및 연관된 참조 프로파일(REF)을 갖는 예시적인 도면(DIAG)을 도시한다. 특히, 이것은 도 2에서 선택된 에지에 관련된다. 도면(DIAG)은 수평 축 (x)과 수직 축(y)을 갖는다. 이 예에서, x-축은 선택된 에지의 프로파일에 평행하고, y-축은 그에 수직이 다. x-축 및 y-축은 상이한 스케일링을 가지며, 그런 이유로 y-방향의 편차가 과장되어 있음이 준수되어야 한다. 규격에서의 에지의 편차는 리소그라피 마스크의 제조에 그 원인이 있으며, 사용된 기술에 의존하여 얼마간 두드러진다. 이것을 또한 \"마스크 잡음(mask noise)\"이라고 지칭한다. 특히, 마스크 잡음은 그 상정한 타겟 포 지션으로부터 각각의 에지의 포지션의 통계적 편차를 포함한다. 수리될 필요가 있는 각각의 에지의 결함은 특히 마스크 잡음에 의해 초래되기보다는 다른 제조 에러로 인해 발생함을 주목해야 한다. 선택된 에지에 대한 참조 프로파일(REF)은 도면(DIAG)에 도시되어 있다. 참조 프로파일(REF)은 이 예에서 직선이다. 허용 범위도 도시되며, 이 허용범위는 참조 프로파일(REF)로부터 미리 결정된 허용 간격으로 배치된 2개의 허용 라인(TOL)에 의해 경계가 정해진다. 도면(DIAG)은 x-축을 따라 3개의 부분(113A, 113B, 123)으로 세분된다. 이 경우에, 부분(113A, 113B)은, 선택 된 에지가 의도한 프로파일(또한 본 경우에 결함이 없는 \"수리될 필요가 없는 선택된 에지의 부분\")을 가 지며, 더욱 구체적으로는 참조 라인(REF)으로부터 허용 범위 내에서 연장하며, 그러므로 참조(결국, \"대응하는 에지\")로서 사용될 수 있는 부분이다. 부분(113A, 113B)이 의도한 프로파일을 갖는지의 결정은 예컨대 운영자에 의해, 이미지 또는 에지 검출 알고리즘에 의해 및/또는 설계 데이터(리소그라피 마스크를 제조하기 위한 CAD 데 이터세트 등)를 기반으로 하여 이뤄질 수 있다. 부분은 선택된 에지의 수리 부분이며, 이 부분 내에서, 에지는 오프셋을 가지며(또한, 도 2 참조), 허용 범위를 벗어나 산발적으로 연장한다. 결정된 프 로파일(VER)은 지점 세트인 것으로 고려될 수 있으며, 각각의 x-값에는 대응 y-값이 할당된다. 참조 프로파일(REF)은 상이한 방식으로 결정될 수 있다. 예컨대, 참조 프로파일(REF)은 부분(113A, 113B)에서 에지의 결정된 프로파일(VER)을 기반으로 하여 결정될 수 있다. 예컨대, 통계적 변동에 의해 악화된 실제 프로파일(VER)은 선형 회귀에 의해 직선으로 근사화될 수 있다. 0의 그레디언트가 직선에 대해 명시될 수도 있 으며, 이는 선택된 에지가 수평으로 연장하기 때문이다. 또한, y-값의 평균이 부분(113A, 113B)에서 결정 된다고 할 수 있다. 각각의 y-값은 실시예에서 개별 에러가 할당될 수 있으며, 이 에러는 선형 회귀를 수행할 때 또는 평균(가중 평균)을 결정할 때 고려된다. 대안적인 결정 방법은 예컨대 이미지 표현(IMG)에서(도 2 참조) 또는 이 또는 임의의 다른 리소그라피 마스크 의 추가 이미지 표현(미도시)에서 추가 에지(도 2 참조)의 프로파일을 기반으로 할 수 있다. 예컨대, 각각의 프로파일은 추가 에지 중 하나 이상에 대해 결정된다. 이들 에지는 수리 부분에서 에지 의 원하는 또는 의도한 프로파일(이 경우 수평 및 직선)을 가지며, 게다가 (또한, 여기서, 수리되지 않는 에지\"로 지칭되는) 규칙적인 에지인 것으로 고려되므로, 그 프로파일은 참조(및 결국 이것이 \"대응하는 에지 임)로서 사용될 수 있다. 그러나 규칙적인 에지는 또한 마스크 잡음을 보이므로, 이 경우에 특정 평균화 형태를 수행하는 것이 유리하다. 이것은 저잡음 필터링에 의해 달성될 수 있다. 이미지 표현(IMG)이 에어리얼 이미지로서 포착되어야 하므로, 이미지 표현은 이 방법 기저의 물리적 구조(the physics)로 인해 저역 필터링된 형태에서 이미 이용 가능하다. 대안적으로 또는 게다가, 다수의 규칙적인 에지의 프로파일은 결정될 수 있으며,이들 프로파일은 그 후 평균화될 수 있다. 대안적으로 또는 게다가, 선형 회귀가 실행될 수 있다. 추가 옵션은 수동으로 예컨대 운영자에 의해 참조 프로파일을 결정하는 단계로 구성된다. 추가 옵션은 리소그라 피 마스크의 설계로부터 참조 프로파일을 판독하는 단계로 구성된다. 도면(DIAG)을 기반으로 하여, 선택된 에지가 수리 부분에서 규격에서 벗어나는지를 - 수리가 필요하 므로 - 결정할 수 있다. 이미 한번 수리된 에지인 범위까지, 수행된 수리 공정에 대한 품질 특성, 예컨대 수리 부분에서의 수리된 에지의 평활도 및 참조 프로파일에 관한 남은 평균 오프셋을 유도할 수 있다. 더 나아가, 수리 공정에 대한 최적화된 공정 파라미터는 예컨대 결정 또는 유도될 수 있다. 제안된 방법은 특히 수리를 평가하기 위한 구조 치수(\"임계 치수\")의 결정과는, 구조 치수의 결정이 항상 수리 된 에지 및 반대편 에지의 마스크 잡음을 또한 포함하기 때문에, 상이함이 준수되어야 하며, 이점은 제안한 대 로 결정된 참조 프로파일(REF) 및 허용 범위의 사용에 의해 회피된다. 그러므로 제안된 방법은 더욱 정확하며 흠결이 적으며, 수리 공정에 대해 더욱 정확한 결론이 내려지게 한다. 도 4a 내지 도 4e는 에지를 수리하며 수리된 에지(112*)를 점검할 때 수행되는 단계에 대한 예를 도시한다. 예컨대, 이것은 도 1에서 리소그라피 마스크의 선택된 에지 - 수리 부분에서 광잉 소 재를 가짐 - 이다. 예컨대, 도 4a는 선택된 에지의 수리 전에 이 에지의 프로파일(VER0)을 도시한다. 이 예에서, 선택된 에지 는 정사각형 형상을 갖지만, L자 형상을 가져야 한다. 수리 부분은 점선 정사각형의 형태로 도시되어 있다. 그러므로 선택된 에지는, 특히 도 7을 기반으로 하여 기재되는 처리 장치를 사용하여 수리된다. 도 4b는 수리된 에지(112*)의 프로파일(VER1)을 도시하며, 여기서 과잉 소재가 수리 부분으로부터 제거되 어 수리된 에지(112*)의 프로파일(VER1)은 L자 형상을 갖는다. 수리된 에지(112*)의 프로파일(VER1)은 수리에 영향을 받지 않은 2개의 부분(112A, 112B)과, 수리의 결과로서 발생한 2개의 부분(112C, 112D)을 갖는다. 이 예 에서, 에지 부분(112C, 112D)은 에지(112*)의 남은 에지 부분보다 더 작은 변동(또는 더 낮은 마스크 잡음)을 가지며, 이는 예컨대 사용된 수리 공정이 원래의 리소그라피 마스크를 제조하는데 사용된 공정보다 더 높 은 공정 분해능을 제공하기 때문이다. 수리에 의해 형성된 프로파일(VER1)의 에지 부분(112C, 112D)이 정확한 포지션에 위치하는지에 대한 문제가 발생하며, 이점은 참조 프로파일(REF1)을 기반으로 하여 점검한다. 예컨대, 도 4c는, 선택된 에지(112*)에 대응하는 규칙적인 에지(도 1 참조)를 기반으로 하여 결정된 제1 참조 프로파일(REF0)을 도시한다. 이것이 의미하는 점은, 예컨대 도 1에서 선택된 에지 옆에 배치되며 원 하는 L자 형상을 갖는 규칙적인 에지(110')가 참조로서 사용된다는 (및 결국 \"대응하는 에지\"라는) 점이다. 예 컨대, 규칙적인 에지의 프로파일이 먼저 결정되며, 결정된 프로파일은 저역 필터링을 받아, 참조 프로파일 (REF0)이 획득된다. 참조 프로파일(REF0)은 결국 예컨대 피스와이즈 선형 함수에 의해 근사화되며(그에 맞춰지 며(fitted to)), 그 결과로, 도 4d에 도시한 이상적인 참조 프로파일(REF1)이 획득된다. 특히, 이상적인 참조 프로파일(REF1)은 마스크 잡음을 더는 갖지 않는다. 나아가, 더욱 구체적으로는, 참조 프로파일(REF0)의 피스와 이즈 저역 필터링이 선형 부분을 갖는 이상적인 참조 프로파일(REF1) 대신 최적화된 참조 프로파일을 결정하는 데 적절할 것임이 준수되어야 한다. 피스와이즈 평활화된 프로파일은 추가 저역 필터링에 의해 획득될 수 있으 며, 이 저역 필터링은 연속해서 복수회 적용될 수도 있다. 도 4e는 수리된 에지(112*)의 결정된 프로파일(VER1)의 참조 프로파일(REF1) 상의 가상적인 중첩을 도시한다. 이 경우에, 참조 프로파일(REF1)은 결정된 프로파일(VER1)에 관해 정확히 정렬되는 것이 중요하다. 이 예에서, 참조 프로파일(REF1)이 특히 수리에 의해 영향을 받지 않는 선택된 에지(112*)의 2개의 부분(112A, 112B) 및 그 코너에 관해 정렬된다. 이 정렬은 특히 이들 부분(112A, 112B)과 참조 프로파일(REF1) 사이의 편차가 이들 부분 에서 최소화됨으로써 구현된다. 이 중첩을 기반으로 하여, 수리된 에지(112*)가 원하는 프로파일을 갖는지, 특히 수리된 에지가 허용 범위 내에 있는지를 평가할 수 있다. 이것이 도 4f에 예시되어 있다. 허용 제한 라인(TOL: Tolerance Limit Lines)이 참조 프로파일(REF1)을 기반으로 하여 도 4f에 도시되어 있다. 도 4f에서, 이것은 수리 동안 생성된 에지 부분(112C, 112D)에 대해서만 도시된다. 허용 제한 라인(TOL)은 허용 범위를 형성한다. 각각의 허용 라인(TOL)은 참조 프로파일(REF1)로부터의 미리 결정된 거리를 갖는다. 허용 범위가 도시되면, 수리가 성공적이었는지, 즉 에지 부분(112C, 112D) 에서의 프로파일(VER1)이 허용 범위 내에 위 치하는지를 결정할 수 있다. 이것이 예시한 예의 경우이다. 에지 부분(112C, 112D)이 이 예에서 참조 프로파일 (REF1)로부터 눈에 띄게 및 체계적으로 편차가 있을지라도, 수리된 에지(112*)를 갖는 리소그라피 마스크 가 사용될 수 있으며, 이는 에지 부분(112C, 112D)이 미리 결정된 허용 범위 내에 있기 때문이다. 나아가, 에지 부분(112C, 112D)에 대한 품질 특성, 예컨대 각각의 에지 부분(112C, 112D)의 참조 프로파일(REF1)로부터의 체 계적 시프트 등이 도 4f를 기반으로 하여 결정될 수 있으며, 수리의 품질을 평가하기 위한 근거로서 사용될 수 있다. 수리가 실패했다면, 가능 원인에 대한 결론이 또한 이 평가를 기반으로 하여 내려질 수 있으며, 그러므로 미래의 수리 공정의 수리 품질을 개선할 수 있다. 제안된 방법이 특히, 수리를 평가하기 위해 구조 치수(\"임계 치수\") 예컨대 에지 부분(112A)으로부터 에지 부분 (112C)으로의 지점 방식의 거리의 결정 및 점검과 상이하며, 이는 구조 치수의 결정은 항상 수리된 에지와 참조 에지의 마스크 잡음을 또한 포함하기 때문이며, 이것이 제안된 바와 같이 결정된 참조 프로파일(REF, REF0, REF1)의 사용, 참조 프로파일(REF, REF0, REF1) 및 허용 범위의 정확한 정렬에 의해 회피됨을 준수해야 한다. 그러므로 제안된 방법은 더욱 정확하며 흠결이 적으며, 수리 공정에 대해 더욱 정확한 결론이 내려지게 한다. 도 5는 수리 영역의 이미지 표현(IMG)의 추가 예를 도시한다. 이 예에서, 수리 영역은 리소그라피 마 스크 상의 구조의 규칙적인 배열(도 1 참조)을 포함한다. 그러나 이 구조가 존재하지 않는 결함이 수리 영 역의 중심에 존재한다. 이 결함은 선택 영역(SEL1)에 의해 강조되어 있다. 참조 프로파일(REF, REF0, REF1)을 결정하기 위해(도 3 또는 도 4 참조), 선택 영역(SEL1)에 대응하며 결함을 갖지 않는(및 하나 이상의 \"대응하는 에지\"를 갖는) 이미지 표현(IMG)으로부터의 영역을 특히 사용할 수 있다. 다수의 그러한 영역이 선 택 영역(SEL0)으로서 점선 직사각형을 사용하여 도시된다(간략화를 이유로, 이들 선택 영역(SEL0) 중 하나만이 참조부호가 붙여져 있다). 예컨대, 이들 선택 영역(SEL0)은 자체 상관에 의해 선택 영역(SEL1)을 기반으로 하여 결정될 수 있다. 이 경우에, 예컨대, 선택 영역(SEL1)은 이미지 표현(IMG)에 걸쳐서 픽셀 단위로 스캐닝되며, 선택 영역(SEL1)과 기저의 영역의 유사성이 결정된다. 매우 높은 유사성(상관)이 선택 영역(SEL0)에서 존재하며, 이점이 그 선택의 기준이다. 특히, 선택 영역(SEL0)은 모두 참조 프로파일(REF, REF0, REF1)의 결정에 연합하여 사용될 수 있으며, (도 3과 관련하여 앞서 이미 기재한 바와 같이) 평균화, 예컨대 평균 또는 중간 값 계산이 구현되어 다수의 선택 영역 (SEL0)으로부터의 참조를 결정한다. 이점은 마스크 잡음의 영향을 최소화할 수 있으며, 이 마스크 잡음은 선택 영역(SEL0) 각각에서 존재한다. 그에 따라 획득한 참조를 기반으로 하여, 첫째, 수행될 수리 공정의 근거로서 역할을 할 수 있는 수리 형상을 결정할 수 있으며; 둘째, 참조 프로파일(REF, REF0, REF1)이 참조로부터 결정될 수 있다. 유리하게도, 그에 따라 결정된 참조 프로파일(REF, REF0, REF1)이 선택 영역(SEL1)을 기반으로 하여 정렬될 수 있으며, 선택 영역(SEL1)에 존재하는 규칙적인 에지(도 1 참조)가 정렬 특성으로서 역할을 한다. 수리 형상을 결정하기 위해, 결정된 참조가 예컨대 선택 영역(SEL1)에서 빼진다(여기서 도시되지 않음). 참조와 선택 영역(SEL1)은 특히 각각 픽셀 매트릭스로서 명시되며, 각각의 픽셀은 특정 값(그레이스케일 값)을 갖는다. 이 경우에, 리소그라피 마스크의 동일한 부분 영역은 특히 각각 유사한 그레이스케일 값을 갖는다. 그러므 로 참조가 선택 영역(SEL1)으로부터 빼지므로, 0에 가까운 차이 값이 동일 영역의 픽셀에 대해 획득된다. 상이 한 영역은 0과는 상당히 다른 값을 갖는다. 예컨대, 수리 형상은, 그 그레이스케일 값의 절댓값이 미리 결정된 스레시홀드 값을 초과하는 모든 픽셀에 의해 형성된다. 도 6은 리소그라피 마스크의 수리를 위해 리소그라피 마스크(도 1 참조)를 점검하기 위한 방법의 예 시적인 실시예의 개략적인 블록도를 도시한다. 리소그라피 마스크는 리소그라피 마스크의 부분 영역 사이에 다수의 에지(도 1 참조)를 가지며, 수리의 목적은 선택된 에지(111, 112, 113)의 수리 부분(121, 122, 123)(도 1, 도 2 또는 도 4a 참조)에서 선택된 에지(111, 112, 113(도 1, 도 2, 도 4a 참조)의 프로파일 (VER)(도 3 참조)을 적응시키는 것이다. 리소그라피 마스크의 선택된 에지(111, 112, 113)의 수리 부분 (121, 122, 123)을 포함하는 수리 영역(도 1, 도 2 또는 도 5 참조)의 이미지 표현(IMG)(도 2 또는 도 5 참조)이 제1 단계(S1)에서 포착된다. 수리 부분(121, 122, 123)은 바람직하게는 이미지 표현(IMG)에서 수동으로 또는 자동으로 선택되거나 표시될 수 있다. 운영자는 예컨대 입력 유닛에 의해 이미지 표현(IMG)에서 수리 부분 (121, 122, 123)을 선택할 수 있다. 대안적으로, 수리 부분(121, 122, 123)은 이미지 평가 방법에 의해 선택될 수 있으며, 이 평가 방법은 이미지 표현(IMG)에 적용된다. 예컨대, 이미지 표현(IMG)은 리소그라피 마스크(10 0)의 에어리얼 이미지로서 또는 전자 현미경 이미지로서 포착된다. 제2 단계(S2)에서, 수리 부분(121, 122,123)에서 선택된 에지(111, 112, 113)의 프로파일(VER, VER0, VER1)(도 3, 도 4a, 도 4b, 도 4e 또는 도 4f 참 조)이 수리 영역의 포착된 이미지 표현(IMG)을 기반으로 하여 결정된다. 예컨대, 이것은 도 2 내지 도 5를 기반으로 하여 설명된 바와 같이 구현되며, 특히 선택된 에지(111 내지 113)에 대응하는 에지(110, 110', 113A, 113B)의 프로파일을 기반으로 하여 참조 프로파일(REF, REF0, REF1)을 결정함으로써 구현되며, 대응하는 에지 (113A, 113B)는 수리되지 않아야 하는 에지(110, 110') 또는 수리되지 않아야 하는 선택된 에지(111 내지 113) 의 부분(113A, 113B)이며, 대응하는 에지(110, 110', 113A, 113B)는 수리 영역의 포착된 이미지 표현 (IMG)을 기반으로 하여 결정된다. 제3 단계(S3)에서, 선택된 에지(111, 112, 113)의 결정된 프로파일(VER, VER0, VER1)은 참조 프로파일(REF, REF0, REF1)과 비교된다. 특히, 이 비교는 가상의 중첩에 의해 그래픽 방식 으로 구현될 수 있다. 선택적 제4 단계(S4)에서, 수리 부분(121, 122, 123)에서 선택된 에지(111, 112, 113)의 결정된 프로파일(VER, VER0, VER1)이 참조 프로파일(REF, REF0, REF1)과 관련하여 미리 결정된 허용 범위 내에 위치하는지에 대한 결정이 (실시예에서, 결정된 프로파일(VER, VER0, VER1)의 참조 프로파일(REF, REF0, REF1) 과의 비교를 기반으로 하여) 있다. 이 방법의 결과에 의존하여, 선택된 에지(111, 112, 113)의 수리가 프롬프팅될 수 있으며, 구현된 수리에 대한 품질은 결정될 수 있으며 및/또는 수리 공정에 대한 적절한 공정 파라미터에 관한 결론이 내려질 수 있다. 선택 된 에지(111, 112, 113)의 수리가 프롬프팅된다면, 참조 프로파일(REF, REF0, REF1)이 특히 적절한 수리 형상을 결정하는데 사용될 수 있다. 제안된 방법은 바람직하게는 도 7을 기반으로 하여 이하에서 설명될 처리 장치를 사용하여 수행된다. 도 7은 처리 장치의 개략적인 예시적 실시예를 도시한다. 처리 장치는 리소그라피 마스크를 점 검하며 및/또는 수리하도록 구성된다. 예컨대, 리소그라피 마스크는 도 1을 기반으로 하여 설명된 형태를 가지며, 리소그라피 마스크의 부분 영역 사이에 다수의 에지(도 1 참조)를 갖는다. 처리 장치는, 리소그라피 마스크의 선택된 에지(111, 112, 113)(도 1, 도 2 또는 도 4a 참조)의 수리 부 분(121, 122, 123)(도 1 내지 도 4a 참조)을 포함하는 수리 영역(도 2 또는 도 5 참조)의 이미지 표현 (IMG)(도 2 또는 도 5 참조)을 포착하기 위한 포착 유닛을 포함한다. 이 예에서, 포착 유닛은 전자 현미경의 형태로 되어 있다. 처리 장치는, 수리 영역의 포착된 이미지 표현(IMG)을 기반으로 하여 수 리 부분(121, 122, 123)에서 선택된 에지(111, 112, 113)의 프로파일(VER, VER0, VER1)(도 3, 도 4a, 도 4b, 도 4e 또는 도 4f 참조)을 결정하기 위한 결정 유닛을 더 포함한다. 이 예에서, 결정 유닛은 처리 장 치에 대한 제어 컴퓨터를 형성한다. 더 나아가, 처리 장치는, 결정된 프로파일(VER, VER0, VER1)을 참조 프로파일(REF, REF0, REF1)(도 3, 도 4c 또는 도 4d 참조)과 비교하도록 구성되며 이 예에서 결정 유닛 의 구성 부분인 처리 유닛을 포함한다. 바람직하게도, 처리 유닛은, 선택된 에지(111 내지 11 3)에 대응하는 에지(110, 110', 113A, 113B)의 프로파일을 기반으로 하여 참조 프로파일(REF, REF0, REF1)을 결정하도록 구성되며, 대응하는 에지(110, 110', 113A, 113B)는 수리되지 않아야 하는 에지(110, 110') 또는 수 리되지 않아야 하는 선택된 에지(111 내지 113)의 부분(113A, 113B)이며, 대응하는 에지(110, 110', 113A, 113B)는 수리 영역의 포착된 이미지 표현(IMG)을 기반으로 하여 결정된다. 결정 유닛은 수리 부분 (121, 122, 123)에서 선택된 에지(111, 112, 113)의 결정된 프로파일(VER, VER0, VER1)이 참조 프로파일(REF, REF0, REF1)과 관련하여 미리 결정된 허용 범위 내에 위치하는지에 대해 (실시예에서, 결정된 프로파일(VER, VER0, VER1)의 참조 프로파일(REF, REF0, REF1)과의 비교를 기반으로 하여) 결정하도록 더 구성된다. 처리 장치는 결국 도 6을 기반으로 하여 설명한 방법을 수행하도록 구성된다. 나아가, 처리 장치는 도 2 내지 도 5를 기반으로 하여 설명한 처리 단계를 수행하도록 구성될 수 있다. 이를 위해, 처리 장치는, 진공 펌프에 의해, 특히 10-2mbar 내지 10-8mbar의 잔류 가스 압력으로 특정 진공에서 유지되는 내부를 갖는 진공 하우징을 또한 포함한다. 처리 장치는 리소그라피 마스크, 특히 EUV(\"극자외선\") 또는 DUV(\"심자외선\") 리소그라피용 리소그라피 마스크에 대한 검증 및/또는 수리 기구로서 설 계될 수 있다. 이 경우에, 분석되거나 처리될 리소그라피 마스크는 진공 하우징에서 샘플 스테이지 상에 장착된다. 처리 장치의 샘플 스테이지는 3개의 공간 방향에서 및 3개의 회전 축에서 정확 히 수 nm로 리소그라피 마스크의 포지션을 설정하도록 구성될 수 있다. 처리 장치는 더 나아가 전자 컬럼 형태의 제공 유닛을 포함한다. 제공 유닛은 전자 빔을 제공하기 위한 전자 소스를 포 함한다. 전자 현미경은 리소그라피 마스크로부터 다시 산란되는 전자를 검출한다. 도시한 전자 현미 경에 추가하여, 2차 전자를 위한 추가 검출기가 또한 구비될 수도 있다(여기서는 미도시). 전자 컬럼(20 6)은 진공 하우징 내에 전용 진공 하우징을 바람직하게는 갖는다. 진공 하우징은 예컨대 10-7mbar 내지 10-8mbar의 잔류 가스 압력으로 진공된다. 전자 소스로부터의 전자 빔은 진공 하우징(21 3)으로부터 그 밑면에서 방출되어 리소그라피 마스크 상에 입사될 때까지 이 진공을 통과한다. 전자 컬럼은, 공급된 처리 가스 - 가스 제공 유닛에 의해 외부로부터 가스 라인을 통해 리소그 라피 마스크 상에서 전자 빔의 초점 영역 내로 공급됨 - 와 상호동작하여 전자 빔-유도 처리(EBIP: Electron Beam-Induced Processing) 공정을 수행할 수 있다. 이것은 특히 리소그라피 마스크 상에서 소재 를 퇴적하는 것 및/또는 이로부터 소재를 에칭하는 것을 포함한다. 특히, 제어 컴퓨터는 전자 컬럼, 샘플 스테이지 및/또는 가스 제공 유닛을 적절히 제어하도록 구성된다. 그러므로 예시된 처리 장치는 리소그라피 마스크를 분석하며, 또한 점검하도록 구성되며, 동시에 또 한, 점검이 처리가 필요함을 나타낸다면, 리소그라피 마스크를 처리하도록 구성된다. 실시예에서, 처리 장 치는 이들 2개의 기능을 단일 장치에서 반드시 통합하는 것은 아님을 준수해야 한다. 대신, 리소그라피 마 스크는 제1 장치를 사용하여 점검할 수 있으며, 리소그라피 마스크의 수리나 처리는 제2 장치를 사용 하여 구현할 수 있다. 본 발명은 예시적인 실시예를 참조하여 기재하였지만, 여러 방식으로 변경할 수 있다."}
{"patent_id": "10-2025-7005794", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 리소그라피 마스크의 예의 개략도를 도시한다. 도 2는 리소그라피 마스크의 수리 영역의 이미지 표현의 예를 도시한다. 도 3은 선택된 에지의 프로파일과 참조 프로파일을 갖는 예시적인 도면을 도시한다. 도 4a 내지 도 4f는 에지를 수리하며 수리된 에지를 점검할 때 수행되는 단계에 대한 예를 도시한다. 도 5는 수리 영역의 이미지 표현의 추가 예를 도시한다. 도 6은 리소그라피 마스크를 점검하기 위한 방법의 예시적인 실시예의 개략적 블록도를 도시한다. 도 7은 처리 장치의 개략도를 도시한다."}
