{"patent_id": "10-2024-0123843", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0039298", "출원번호": "10-2024-0123843", "발명의 명칭": "텍스트 병렬 추출 시스템과 방법 및 이를 위한 컴퓨터 프로그램", "출원인": "주식회사 업템포글로벌", "발명자": "정승헌"}}
{"patent_id": "10-2024-0123843", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말을 통한 사용자 계정 생성을 지원하며, 상기 사용자 단말을 통한 로그인이 진행되도록 하는 로그인관리부(110);상기 사용자 단말을 통한 프로젝트 데이터 생성을 지원하며, 상기 텍스트 추출 대상이 되는 대상 이미지를 획득하는 대상 이미지 획득부(120);상기 대상 이미지 내 포함된 텍스트의 위치를 파악한 후 해당 텍스트가 포함된 영역을 전사(transcribe)하고,전사 영역 내 텍스트를 추출하는 텍스트 전사 진행부(130);추출된 상기 텍스트를 대형 언어 모델(LLM) 기반 번역엔진을 이용하여 실시간 번역을 진행하는 실시간 번역 진행부(140); 및번역 결과를 기 설정된 포멧의 데이터로 저장하여 제공하는 번역 데이터 제공부(150);를 포함하는,텍스트 병렬 추출 시스템."}
{"patent_id": "10-2024-0123843", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 대상 이미지 획득부(120)는,상기 대상 이미지를 획득하는 과정에서, 상기 사용자 단말로부터 PSD 포멧, 엑셀 포멧, 워드 포멧 또는 CSV 포멧 중 어느 하나의 포멧을 선택받은 후, 해당 선택된 포멧에 대한 대상 이미지를 입력하도록 하는 것인,텍스트 병렬 추출 시스템."}
{"patent_id": "10-2024-0123843", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 텍스트 전사 진행부(130)는,하나 이상의 텍스트로 구성된 텍스트 라인의 방향을 토대로 문장 영역을 파악하고, 상기 문장 영역의 방향을 따라 전사를 진행하여 텍스트를 추출하는 것인,텍스트 병렬 추출 시스템."}
{"patent_id": "10-2024-0123843", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 실시간 번역 진행부(140)는,추출된 상기 텍스트와 실시간 번역이 완료된 번역 결과가 상기 사용자 단말의 화면 상에 함께 표시되도록 하며,사용자 단말을 통해 특정 번역 결과가 선택되는 경우, 상기 대상 이미지 상에서 해당 선택된 번역 결과에 상응하는 텍스트의 위치가 자동으로 표시되도록 하고,추출된 상기 텍스트와 실시간 번역이 완료된 번역 결과가 상기 사용자 단말의 화면 상에 함께 표시되도록 하며,상기 사용자 단말을 통해 특정 번역 결과가 선택되는 경우, 해당 번역 결과에 대해 상기 사용자 단말을 통해 편집이 가능하도록 하며,메모리 상에 실시간 번역이 진행되는 프로젝트 데이터에 대한 번역 메모리 영역을 할당한 후, 실시간 번역이 진행되는 과정에서 추출된 텍스트 별로 생성된 번역 워딩을 모두 저장하여 동일한 텍스트가 재추출되는 경우 기저장된 번역 워딩으로 번역 결과가 통일되도록 하는 것인,공개특허 10-2025-0039298-3-텍스트 병렬 추출 시스템."}
{"patent_id": "10-2024-0123843", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "로그인 관리부를 통해, 사용자 단말을 통한 사용자 계정 생성을 지원하며, 상기 사용자 단말을 통한 로그인이진행되도록 하는 단계;대상 이미지 획득부를 통해, 상기 사용자 단말을 통한 프로젝트 데이터 생성을 지원하며, 상기 텍스트 추출 대상이 되는 대상 이미지를 획득하는 단계;텍스트 전사 진행부를 통해, 상기 대상 이미지 내 포함된 텍스트의 위치를 파악한 후 해당 텍스트가 포함된 영역을 전사(transcribe)하고, 전사 영역 내 텍스트를 추출하는 단계;실시간 번역 진행부를 통해, 추출된 상기 텍스트를 대형 언어 모델(LLM) 기반 번역엔진을 이용하여 실시간 번역을 진행하는 단계; 및번역 데이터 제공부를 통해, 번역 결과를 기 설정된 포멧의 데이터로 저장하여 제공하는 단계;를 포함하는,텍스트 병렬 추출 방법."}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 텍스트 병렬 추출 시스템과 방법 및 이를 위한 컴퓨터 프로그램에 관한 것으로서, 사용자 단말을 통한 로그인이 진행되도록 하는 로그인 관리부, 프로젝트 데이터 생성을 지원하며 대상 이미지를 획득하는 대상 이미 지 획득부, 대상 이미지 내 포함된 텍스트의 위치를 파악한 후 해당 텍스트가 포함된 영역을 전사(transcribe)하 고 전사 영역 내 텍스트를 추출하는 텍스트 전사 진행부, 추출된 텍스트를 실시간 번역을 진행하는 실시간 번역 진행부 및 번역 결과를 기 설정된 포멧의 데이터로 저장하여 제공하는 번역 데이터 제공부를 포함한다."}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 텍스트 병렬 추출 시스템과 방법 및 이를 위한 컴퓨터 프로그램에 관한 것으로서, 보다 구체적으로는, 웹툰이나 광고 등 이미지에 포함된 텍스트의 위치 파악을 통해 텍스트가 포함된 영역을 전사하고, 전사 영역 내 텍스트를 자동으로 추출 후 실시간으로 번역한 결과를 제공함으로써, 파일 종류에 관계 없이 이미지 내 텍스트를 신속하고 정확하게 추출 및 번역한 결과를 제공하는 텍스트 병렬 추출 시스템과 방법 및 이를 위한 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 웹툰 등 이미지의 현지화 작업을 위해서는 원본 웹툰을 번역 웹툰으로 번역하는 웹툰 번역 과정과 번역 웹툰을 제공하는 웹툰 서비스 과정을 별도로 분리하여 수행하게 된다. 이에 따라, 번역가가 모든 텍스트를 일일이 수작업으로 전사하는 과정에서 많은 시간과 비용이 발생되고 있으며, 텍스트 누락 등 휴먼 에러에 의한 정확성이 떨어지는 문제점도 발생되고 있다. 오늘날 인터넷 사용이 보편화되면서 사용자들은 인터넷 검색을 통하여 다양한 정보를 획득할 수 있으며, 사용 자들은 인터넷에 접속이 가능한 단말을 통해 인터넷 검색 사이트에 접속한 후, 뉴스, 지식, 게임, 커뮤니티 등 에 관련된 각종 컨텐츠 검색하며, 웹 페이지나 파일 등에 대한 정보를 획득할 수 있다. 이러한 정보 중 외국어 로 구성된 웹툰이나, 문자매체의 번역을 위해 PSD 파일의 텍스트를 직접 옮겨 적고 별도의 번역 작업을 통해 번 역이 진행되는 경우가 많으며, 이러한 과정에는 긴 시간이 소요되는 경우가 많다. 종래의 한국 공개 특허 제10-2022-0107717호는 문서로부터 정보를 추출하기 위한 장치의 동작 방법 및 그 장치 에 관한 것으로, 문서로부터 정보를 추출하기 위한 장치의 동작 방법을 제공하고 있으나, 문서의 유형에 대응하 여 미리 정의된 정의 단어를 검색하는 단계와 좌표를 비교하는 것을 통해 디지털 문서로 입력하는 단계를 포함 하고 있어, 이미지의 영역이나, 영상에 대한 텍스트에 대해 추출하는 구성에 대해서는 제시하지 않고 있다. 또한 종래의 한국 공개특허 제10-2022-0143538호는 반정형 문서로부터 정보를 추출하는 방법 및 시스템에 관한 것으로, 대상 문서에 대한 OCR을 수행하여 복수의 단어와 단어 각각에 대한 정보를 추출하는 단계를 포함하고 있으나, 이미지의 영역과 영상에 대한 텍스트에 대해 추출하는 구성을 제시하지 않고 있으며, 추가적으로 음성 에 대한 텍스트를 추출하는 구성에 대해서도 포함하지 않고 있다. 이에 웹툰이나 광고 등 이미지에 포함된 텍스트의 위치 파악을 통해 텍스트가 포함된 영역을 전사하고, 전사 영 역 내 텍스트를 자동으로 추출 후 실시간으로 번역한 결과를 제공함으로써, 파일 종류에 관계없이 이미지 내 텍 스트를 신속하고 정확하게 추출 및 번역한 결과를 제공하는 텍스트 병렬 추출 시스템과 방법 및 이를 위한 컴퓨 터 프로그램에 대한 필요성이 존재한다.선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2022-0107717호 (2022.08.02. 공개) (특허문헌 0002) 한국공개특허공보 제10-2022-0143538호 (2022.10.25. 공개) (특허문헌 0003) 한국공개특허공보 제10-2015-0111540호 (2015.10.06. 공개)"}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위한 것으로, 웹툰이나 광고 등 이미지에 포함된 텍스트의 위치 파악을 통 해 텍스트가 포함된 영역을 전사하고, 전사 영역 내 텍스트를 자동으로 추출 후 실시간으로 번역한 결과를 제공 함으로써, 파일 종류에 관계없이 이미지 내 텍스트를 신속하고 정확하게 추출 및 번역한 결과를 제공하는 텍스 트 병렬 추출 시스템과 방법 및 이를 위한 컴퓨터 프로그램을 제공하고자 한다."}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 텍스트 병렬 추출 시스템은 사용자 단말을 통한 사용자 계정 생성을 지원하며, 상 기 사용자 단말을 통한 로그인이 진행되도록 하는 로그인 관리부, 상기 사용자 단말을 통한 프로젝트 데이터 생 성을 지원하며, 상기 텍스트 추출 대상이 되는 대상 이미지를 획득하는 대상 이미지 획득부, 상기 대상 이미지 내 포함된 텍스트의 위치를 파악한 후 해당 텍스트가 포함된 영역을 전사(transcribe)하고, 전사 영역 내 텍스 트를 추출하는 텍스트 전사 진행부, 추출된 상기 텍스트를 대형 언어 모델(LLM) 기반 번역엔진을 이용하여 실시 간 번역을 진행하는 실시간 번역 진행부 및 번역 결과를 기 설정된 포멧의 데이터로 저장하여 제공하는 번역 데 이터 제공부를 포함할 수 있다. 본 발명의 일 실시예에 따른 상기 대상 이미지 획득부는 상기 대상 이미지를 획득하는 과정에서, 상기 사용자 단말로부터 PSD 포멧, 엑셀 포멧, 워드 포멧 또는 CSV 포멧 중 어느 하나의 포멧을 선택받은 후, 해당 선택된 포멧에 대한 대상 이미지를 입력하도록 할 수 있다. 본 발명의 일 실시예에 따른 상기 텍스트 전사 진행부는 하나 이상의 텍스트로 구성된 텍스트 라인의 방향을 토 대로 문장 영역을 파악하고, 상기 문장 영역의 방향을 따라 전사를 진행하여 텍스트를 추출할 수 있다. 본 발명의 일 실시예에 따른 상기 실시간 번역 진행부는 추출된 상기 텍스트와 실시간 번역이 완료된 번역 결과 가 상기 사용자 단말의 화면 상에 함께 표시되도록 하며, 사용자 단말을 통해 특정 번역 결과가 선택되는 경우, 상기 대상 이미지 상에서 해당 선택된 번역 결과에 상응하는 텍스트의 위치가 자동으로 표시되도록 할 수 있고, 추출된 상기 텍스트와 실시간 번역이 완료된 번역 결과가 상기 사용자 단말의 화면 상에 함께 표시되도록 하며, 상기 사용자 단말을 통해 특정 번역 결과가 선택되는 경우, 해당 번역 결과에 대해 상기 사용자 단말을 통해 편 집이 가능하도록 하며, 메모리 상에 실시간 번역이 진행되는 프로젝트 데이터에 대한 번역 메모리 영역을 할당 한 후, 실시간 번역이 진행되는 과정에서 추출된 텍스트 별로 생성된 번역 워딩을 모두 저장하여 동일한 텍스트 가 재추출되는 경우 기 저장된 번역 워딩으로 번역 결과가 통일되도록 할 수 있다. 본 발명의 다른 실시예에 따른 텍스트 병렬 추출 방법은 로그인 관리부를 통해, 사용자 단말을 통한 사용자 계 정 생성을 지원하며, 상기 사용자 단말을 통한 로그인이 진행되도록 하는 단계, 대상 이미지 획득부를 통해, 상 기 사용자 단말을 통한 프로젝트 데이터 생성을 지원하며, 상기 텍스트 추출 대상이 되는 대상 이미지를 획득하 는 단계, 텍스트 전사 진행부를 통해, 상기 대상 이미지 내 포함된 텍스트의 위치를 파악한 후 해당 텍스트가 포함된 영역을 전사(transcribe)하고, 전사 영역 내 텍스트를 추출하는 단계, 실시간 번역 진행부를 통해, 추출 된 상기 텍스트를 대형 언어 모델(LLM) 기반 번역엔진을 이용하여 실시간 번역을 진행하는 단계 및 번역 데이터 제공부를 통해, 번역 결과를 기 설정된 포멧의 데이터로 저장하여 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 방법 및 이를 위한 컴퓨터 프로그램에 관한 것으로서, 보다 구체적으로는, 웹툰이나 광고 등 이미지에 포함된 텍스트의 위치 파악을 통해 텍스트가 포함된 영역을 전사하고, 전사 영역 내 텍스트를 자동으 로 추출 후 실시간으로 번역한 결과를 제공함으로써, 파일 종류에 관계없이 이미지 내 텍스트를 신속하고 정확 하게 추출 및 번역한 결과를 제공할 수 있는 이점을 가진다. 또한 본 발명에 따르면, 텍스트가 포함된 영역 전사, 텍스트 추출 및 실시간 번역 등이 모두 자동화됨에 따라, 오번역 등 휴먼 에러 발생을 미연에 방지하여 번역 정확도를 획기적으로 높일 수 있는 이점을 가진다."}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시를 위한 구체적인 내용을 첨부된 도면을 참조하여 상세히 설명한다. 다만, 이하의 설명에 서는 본 발명의 요지를 불필요하게 흐릴 우려가 있는 경우, 널리 알려진 기능이나 구성에 관한 구체적 설명은 생략하기로 한다. 또한, 명세서에서 사용되는 '모듈' 또는 '부'라는 용어는 소프트웨어 또는 하드웨어 구성요소를 의미하며, '모 듈' 또는 '부'는 어떤 역할들을 수행한다. 그렇지만, '모듈' 또는 '부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '모듈' 또는 '부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고, 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서, '모듈' 또는 '부'는 소프트웨어 구성 요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로 세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 또는 변수들 중 적어도 하나를 포함할 수 있다. 구성요소들과 '모듈' 또는 '부'들은 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '모듈' 또는 '부'들로 결합되거나 추가적인 구성요소들과 '모듈' 또는 '부'들로 더 분리될 수 있다. 본 발명의 일 실시예에 따르면, '모듈' 또는 '부'는 프로세서 및 메모리로 구현될 수 있다. '프로세서'는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크로제어기, 상태 머신 등을 포함하도록 넓게 해석되어야 한다. 몇몇 환경에서, '프로세서'는 주문형 반도체(ASIC), 프로그램가능 로직 디바이스(PLD), 필드 프로그램가능 게이트 어레이(FPGA) 등을 지칭할 수도 있다. '프로세서'는, 예를 들어, DSP와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, DSP 코어와 결합한 하나 이상의 마 이크로프로세서들의 조합, 또는 임의의 다른 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수도 있다. 또한, '메모리'는 전자 정보를 저장 가능한 임의의 전자 컴포넌트를 포함하도록 넓게 해석되어야 한다. '메모리'는 임의 액세스 메모리(RAM), 판독-전용 메모리(ROM), 비-휘발성 임의 액세스 메모리(NVRAM), 프로그 램가능 판독-전용 메모리(PROM), 소거-프로그램가능 판독 전용 메모리(EPROM), 전기적으로 소거가능 PROM(EEPROM), 플래쉬 메모리, 자기 또는 광학 데이터 저장장치, 레지스터들 등과 같은 프로세서-판독가능 매체 의 다양한 유형들을 지칭할 수도 있다. 프로세서가 메모리로부터 정보를 판독하고/하거나 메모리에 정보를 기록할 수 있다면 메모리는 프로세서와 전자 통신 상태에 있다고 볼 수 있다. 또한, 프로세서에 집적된 메모리는 프 로세서와 전자 통신 상태에 있다고 볼 수 있다. 본 발명에서, '시스템'은 디바이스 관리 장치를 포함하는 컴퓨팅 장치, 서버 장치와 클라우드 장치 중 적어도 하나의 장치를 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 시스템은 하나 이상의 컴퓨팅 장치 또는 서버 장치로 구성될 수 있다. 다른 예로서, 시스템은 하나 이상의 클라우드 장치로 구성될 수 있다. 또 다 른 예로서, 시스템은 컴퓨팅 장치 또는 서버 장치와 클라우드 장치가 함께 구성되어 동작될 수 있다. 도 1은 본 발명의 일 실시예에 따른 텍스트 병렬 추출 시스템의 구성을 개략적으로 나타낸 도면이고, 도 2 는 도 1에 도시된 텍스트 병렬 추출 시스템을 이용하여 이미지 내에서 텍스트를 추출 후 실시간으로 번역 및 제공하는 전체적인 과정을 나타낸 개념도이다. 도 1 및 도 2를 함께 살펴보면, 본 발명의 일 실시예에 따른 텍스트 병렬 추출 시스템은 크게 로그인 관리 부, 대상 이미지 획득부, 텍스트 전사 진행부, 실시간 번역 진행부 및 번역 데이터 제공부 를 포함할 수 있다. 로그인 관리부는 사용자 단말을 통해 사용자 계정이 생성되도록 사용자 생성 기능을 지원하며, 사용자가 해당 생성된 계정의 아이디 및 비밀번호를 입력할 경우, 해당 아이디 및 비밀번호를 인증하여 사용자 단말을 확 인한 후 사용자 계정으로 접속되도록 할 수 있다. 대상 이미지 획득부는 계정 인증이 완료된 사용자 단말 상에 프로젝트 데이터 생성이 가능한 웹 환경의 웹 플랫폼이 출력되도록 하며, 해당 웹 플랫폼을 통해 프로젝트 데이터 생성이 가능하도록 지원한다. 이때, 대상 이미지 획득부는 사용자 단말로부터 다양한 데이터 포멧(예를 들어, PSD 포멧, 한글 포멧, SRT 포멧(자막), 엑셀 포멧, 워드 포멧, CSV 포멧, 동영상 포멧 등 다양한 포멧의 대상 이미지를 획득할 수 있다. 이를 위하여 대상 이미지 획득부는 ‘PSD File Convert’, ‘HWP File Convert’, ‘SRT File Convert’, ‘MP4 File Convert’ 등과 같이 사용자 단말을 통해 선택 가능한 다양한 프로젝트 데이터 생성용 선택 영역을 제공하며, 사용자 단말을 통해 특정 선택 영역이 선택된 경우, 해당 선택 영역에 대한 포멧의 이미지 업로드가 가능한 프로젝트 데이터가 생성되도록 한다. 일 실시예에서, 대상 이미지 획득부는 생성된 프로젝트 데이터에서 사용자 단말로부터 텍스트 추출 대상이 되는 대상 이미지 파일을 획득할 수 있다. 이때, 획득되는 대상 이미지 파일의 경우 사용자 단말을 통해 선택된 포멧의 데이터 형태로 입력될 수 있으며, 대상 이미지 파일은 사용자 단말을 통해 선택된 포멧의 형태에 맞게 자동 변환될 수 있다. 텍스트 전사 진행부는 대상 이미지 획득부를 통해 획득된 대상 이미지 내 포함된 텍스트들의 위치를 파악한 후, 텍스트가 포함된 영역을 전사(transcribe)하고, 전사 영역 내에서 텍스트를 추출할 수 있다. 보다 구체적으로, 텍스트 전사 진행부는 대상 이미지 내에서 하나 이상의 텍스트로 구성된 텍스트 라인을 우선 파악한 후, 텍스트 라인의 방향을 토대로 문장 영역을 파악할 수 있다. 이 과정에서, 텍스트 전사 진행부 는 인공지능 기반 텍스트 추출 및 전사 엔진을 이용하여 하나 이상의 텍스트로 구성된 텍스트 라인을 파악 할 수 있다. 예를 들어, 텍스트 전사 진행부는 대상 이미지에 대해 그레이스케일 변환, 노이즈 제거, 이진화 및 기하학 적 보정 등의 이미지 전처리르 진행하고, 컨볼루션 신경망(CNN) 기반 딥러닝 모델을 이용하여 대상 이미지 내에 서 텍스트가 포함된 영역(전사 영역)을 파악할 수 있다. 또한, 텍스트 전사 진행부는 CNN 기반 딥러닝 모 델 외에도, R-CNN, YOLO, SSD 등과 같은 객체 검출 모델을 이용하여 텍스트가 포함된 영역을 검출할 수 있다. 또한, 텍스트 전사 진행부는 텍스트가 포함된 전사 영역 검출이 완료되면, 해당 전사 영역 내에서 텍스트 로 이루어진 문장을 개별 문장, 단어, 글자단위 등의 소규모 단위로 분할할 수 있다. 이는 OCR 과정에서 각 글 자를 보다 정확하게 인식하기 위함이다. 이를 위하여, 텍스트 전사 진행부는 예를 들어, Connected Component Analysis 방식을 이용하여 대상 이미지 내에서 서로 연결된 텍스트 영역을 식별하여 분할할 수도 있 고, Canny Edge Detection 방식을 이용하여 텍스트의 윤곽선을 찾아 텍스트 영역을 식별할 수도 있다. 또한, 텍스트 전사 진행부는 전사 영역이 소규모 텍스트로 분할되고 나면, 딥러닝 기반의 CRNN (Convolutional Recurrent Neural Network) 모델을 이용하여 개별적인 텍스트를 인식할 수 있다. 이때, 텍스트전사 진행부는 CNN 모델을 통해 대상 이미지의 공간적 특징을 추출하고, 이를 통해 각 텍스트에 대한 특성 벡터를 생성하고, RNN 모델을 통해 연속된 텍스트들 간의 관계를 파악하여 문맥을 완성하여 더 정확한 텍스트 인식이 가능하도록 한다. 또한 텍스트 전사 진행부는 CTC 알고리즘을 통해 문자의 시작과 끝을 명확히 알 수 없을 때, 연속된 데이터에서 올바른 문자를 추출할 수 있다. 이 후, 텍스트 전사 진행부는 텍스트 인식 결과를 개선하기 위하여 사전(Dictionary)를 적용하여, 인식 결 과와 사전을 서로 대조하여 잘못 인식된 단어나 철자가 있는지 검사하고, 문법적 오류를 검출하며 검출된 문법 적 오류에 대해서는 자동 수정을 진행하여 자연스러운 텍스트로 변환되도록 한다. 또한, 일 실시예에서 텍스트 전사 진행부는 전사 영역을 설정하는 과정에서 대상 이미지 내 문장의 위치 (좌표값)를 기준으로 상단에서 하단 혹은 좌측에서 우측의 방향성을 토대로 전사를 진행할 수 있다. 또한, 이 과정에서 텍스트 전사 진행부는 대상 이미지 내 테스트의 언어에 따라 최적의 전사 방향을 결정할 수도 있 다. 예를 들어, 일본어의 경우 대체로 세로 방향으로 구성된 문장이 많기 때문에, 이 경우 텍스트 전사 진행부 는 세로 방향으로 전사 영역을 설정할 수 있다. 실시간 번역 진행부는 텍스트 전사 진행부를 통해 추출된 텍스트를 대형 언어 모델(LLM) 기반 번역엔 진을 이용하여 실시간으로 번역을 진행하고, 실시간 번역이 완료된 번역 결과와 해당되는 텍스트를 사용자 단말 의 화면 상에 함께 표시되도록 할 수 있다. 이 과정에서, 실시간 번역 진행부는 추출된 텍스트의 순서에 상응하도록 번역 결과를 순서대로 나열 배치 할 수 있으며, 이 중에서 만약 사용자 단말을 통해 특정 번역 결과가 선택되는 경우, 실시간 번역 진행부 는 해당 번역 결과에 상응하는 텍스트의 위치가 자동으로 표시되도록 할 수 있다. 이를 통해, 사용자는 해당 번 역 결과가 어떠한 텍스트에 대한 번역인지를 쉽게 파악할 수 있다. 또한, 실시간 번역 진행부는 해당 번역 결과에 상응하는 텍스트와 번역 결과를 함께 표시하는 과정에서, 사용자 단말을 통해 특정 번역 결과가 선택되는 경우, 해당 선택된 번역 결과에 대해 사용자 단말을 통해 직접 편집이 가능하도록 할 수도 있다. 이를 통해, 사용자는 해당 번역 결과에 오타가 있거나, 오역 혹은 의역이 있 을 경우, 직접 수동 타이핑을 통해 당 번역 결과를 원하는 내용으로 수정할 수 있게 된다. 또한, 실시간 번역 진행부는 대상 이미지의 실시간 번역을 진행하는 과정에서, 메모리 상에 실시간 번역이 진행되는 프로젝트 데이터에 대한 별도의 번역 메모리 영역을 할당한 후, 실시간 번역이 진행되는 과정에서 추 출된 텍스트 별로 생성된 번역 워딩을 모두 저장할 수 있다. 이 후, 만약 실시간 번역 과정에서 동일한 텍스트 가 재추출되는 경우, 실시간 번역 진행부는 해당 텍스트에 대해서는 번역 메모리 영역 내 저장된 번역 워 딩을 참고하여 동일한 번역 워딩이 되도록 함으로써 번역 결과를 통일시킬 수 있다. 또한, 일 실시예에서 실시간 번역 진행부는 번역 결과가 산출되고 난 이후, 하기의 수학식 1을 이용하여 번역 결과에 대한 정확도를 산출하여, 자체적으로 번역 결과에 대해 검증할 수 있다. [수학식 1]"}
{"patent_id": "10-2024-0123843", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기에서, Stotal은 각 텍스트에 대한 가중치 점수의 합이고, Si는 텍스트 Ti의 가중치가 반영된 점수이며, Ci 는 인식된 텍스트 Ti에 대한 신뢰도 값이고, Wi는 텍스트 Ti의 문맥적 중요도 값이며, Li는 인식된 텍스트로 이 루어진 문장 길이이다. 이때, Ci의 경우 0과 1사이에 해당하는 값으로서 1에 가까울수록 인식된 텍스트가 정확함을 의미할 수 있다. 또 한, Ti의 경우 사전 학습된 언어 모델이나 특정 규칙에 의해 정의될 수 있으며, 중요한 텍스트일수록 번역에서 해당 텍스트에 더 높은 비중을 두게 된다. 또한, Li의 경우 짧은 텍스트보다 긴 텍스트에 대해 번역 시 가중치 가 반영될 수 있다. 번역 데이터 제공부는 실시간 번역 진행부를 통해 번역이 완료된 번역 결과에 대해, 기 설정된 포멧 의 데이터로 이를 저장하여 사용자 단말에 다운로드 가능한 형태로 제공할 수 있다.예를 들어, 번역 데이터 제공부는 실시간 번역이 완료된 번역 결과에 대해, 사용자 단말로부터 번역 결과 를 제공받기 위한 포멧을 선택받을 수 있다. 이때, 포멧이라 함은 PSD, 엑셀, MS Word, MS Exel, CSV 등 다양한 포멧이 적용될 수 있으며, 번역 데이터 제공부는 이 중에서 아용자 단말을 통해 선택되는 포멧에 따라 번 역 결과를 번역 데이터로 변환하고, 이를 다운로드 가능한 형태로 제공할 수 있다. 다음으로는, 앞서 살펴본 로그인 관리부, 대상 이미지 획득부, 텍스트 전사 진행부, 실시간 번 역 진행부 및 번역 데이터 제공부를 통해 진행되응 데이터 처리 과정이 실제 사용자 단말의 화면 상 에서 어떻게 출력되는지를 살펴보기로 한다. 도 3은 로그인 관리부를 통해 사용자 단말의 로그인이 진행되는 상태를 나타낸 사용자 단말 화면이고, 도 4는 대상 이미지 획득부를 통해 생성된 프로젝트 데이터 상에 텍스트 추출 대상이 되는 대상 이미지가 업 로드 된 상태를 나타낸 사용자 단말 화면이며, 도 5는 대상 이미지의 전사 및 텍스트 추출 과정 이후, LLM 기반 번역엔진을 통해 실시간 번역이 진행된 번역 결과가 출력되는 상태를 나타낸 사용자 단말 화면이고, 도 6은 사 용자 단말을 통해 특정 번역 결과가 선택된 경우, 해당 선택된 번역 결과에 상응하는 텍스트의 위치가 자동으로 표시되는 상태를 나타낸 사용자 단말 화면이며, 도 7은 사용자 단말을 통해 선택된 특정 번역 결과에 대해 편집 이 진행되는 상태를 나타낸 사용자 단말 화면이고, 도 8은 번역 결과가 설정 포멧의 데이터로 제공되는 상태를 나타낸 사용자 단말 화면이다. 도 3을 살펴보면, 사용자 단말을 통해 사용자 계정의 아이디(혹은 이메일 주소 등)와 비밀번호가 입력됨으로써, 로그인 관리부에서는 해당 아이디 및 비밀번호를 인증하여 사용자 단말을 확인한 후 사용자 계정으로 접속 되도록 한다. 도 4를 살펴보면, 계정 인증이 완료된 사용자 단말 상에는 프로젝트 데이터 생성이 가능한 웹 환경의 웹 플랫폼 이 출력되며, 사용자 단말은 이 중에서 업로드 할 대상 이미지 파일의 포멧을 선택할 수 있다. 대상 이미지 획 득부는 사용자 단말을 통해 특정 선택 영역이 선택된 경우, 해당 선택 영역에 대한 포멧의 이미지 업로드 가 가능한 프로젝트 데이터가 생성되도록 한다. 또한, 사용자는 사용자 단말을 통해 선택된 포멧에 상응하는 대상 이미지 파일을 입력할 수 있고, 대상 이미지 획득부는 해당 입력된 대상 이미지 파일을 선택된 포멧의 형태에 맞게 자동 변환할 수 있다. 도 5를 살펴보면, 텍스트 전사 진행부는 획득된 대상 이미지 내 포함된 텍스트들의 위치를 파악한 후, 텍 스트가 포함된 영역을 전사하고, 전사 영역 내에서 텍스트를 추출하여, 텍스트와 실시간 번역이 완료된 번역 결 과가 사용자 단말의 화면 상에 함께 표시되도록 한다. 이를 통해, 사용자는 대상 이미지 내 텍스트와 실시간 번역이 완료된 번역 결과를 서로 비교해보면서 한눈에 파 악할 수 있게 된다. 도 6을 살펴보면, 사용자 단말을 통해 우측의 번역 결과들 중에서 특정 번역 결과(예를 들어, 'R', 'U', 'M', 'B', 'L', 'E')가 선택되는 경우, 사용자 단말의 좌측에 출력된 대상 이미지가 해당 번역 결과에 맞는 텍스트의 위치로 자동 스크롤 되면서, 번역 결과에 맞는 텍스트가 자동으로 표시될 수 있다. 이를 통해, 사용자는 해당 번역 결과가 어떠한 텍스트에 대한 번역 결과인지를 정확히 파악할 수 있게 된다. 도 7을 살펴보면, 사용자 단말을 통해 우측의 번역 결과들 중에서 특정 번역 결과(예를 들어, 'No')가 선택되는 경우, 사용자 단말의 좌측에 출력된 대상 이미지가 해당 번역 결과에 맞는 텍스트의 위치로 자동 스크롤 됨은 물론, 해당 번역 결과에 대해 사용자 단말을 통한 편집이 가능하도록 편집 기능이 실행될 수 있다. 이를 통해 사용자는 'No'의 번역 결과를 'Hello'와 같이 직접 원하는 텍스트로 편집할 수 있다. 도 8을 살펴보면, 번역 결과에 대해 사용자 단말을 통해 Expert(Excel)이 선택되는 경우, 번역 데이터 제공부 는 해당 번역 결과를 엑셀 데이터로 변환하여 다운로드 가능한 형태로 제공할 수 있다. 다운로드 된 엑셀 데이터는 사용자 단말 상에서 도 8(b)와 같이 실행될 수 있으며, 실시간 번역 진행부를 통해 진행된 번역 결과가 엑셀 데이터 상에서 텍스트 순서대로 나열 배치될 수 있다. 다음으로는, 앞서 살펴본 텍스트 병렬 추출 시스템을 통해 대상 이미지 내에서 텍스트를 자동 추출하고 실 시간 번역을 진행한 결과를 제공하는 방법을 살펴보기로 한다. 도 9는 본 발명의 일 실시예에 따른 텍스트 병렬 추출 방법을 일련의 순서대로 나타낸 순서도이다. 도 9를 살펴보면, 본 발명의 일 실시예에 따른 텍스트 병렬 추출 시스템의 로그인 관리부에서는 사용자 단말을 통한 사용자 계정 생성을 지원하며, 상기 사용자 단말을 통한 로그인이 진행되도록 한다(S901). 다음으로, 사용자 단말을 통해 입력된 아이디(혹은 이메일 주소)와 비밀번호의 인증이 완료되고 나면, 대상 이 미지 획득부에서는 사용자 단말의 화면 상에 프로젝트 데이터 생성을 위한 웹 플랫폼을 제공하고, 이를 통해 프 로젝트 데이터를 생성하고 텍스트 추출 대상이 되는 대상 이미지를 획득한다(S902). 다음으로, 텍스트 전사 진행부에서는 대상 이미지 내 포함된 텍스트의 위치를 파악한 후 해당 텍스트가 포함된 영역을 전사하고, 전사 영역 내 텍스트를 추출한다(S903). 다음으로, 실시간 번역 진행부에서는 추출된 텍스트를 대형 언어 모델(LLM) 기반 번역엔진을 이용하여 실시간 번역을 진행하며(S904), 대상 이미지의 텍스트와 번역 결과를 사용자 단말의 화면 상에 모두 표시되도록 한다. 다음으로, 번역 데이터 제공부는 사용자 단말을 통해 선택된 포멧 형태에 맞게 번역 결과를 번역 데이터로 변환 하고, 이를 사용자 단말에 다운로드 가능한 형태로 제공한다(S905). 상술한 방법은 컴퓨터에서 실행하기 위해 컴퓨터 판독 가능한 기록 매체에 저장된 컴퓨터 프로그램으로 제공될 수 있다. 매체는 컴퓨터로 실행 가능한 프로그램을 계속 저장하거나, 실행 또는 다운로드를 위해 임시 저장하는 것일수도 있다. 또한, 매체는 단일 또는 복수의 하드웨어가 결합된 형태의 다양한 기록 수단 또는 저장수단일 수 있는데, 어떤 컴퓨터 시스템에 직접 접속되는 매체에 한정되지 않고, 네트워크 상에 분산 존재하는 것일 수 도 있다. 매체의 예시로는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD 와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto optical medium), 및 ROM, RAM, 플래시 메모리 등을 포함하여 프로그램 명령어가 저장되도록 구성된 것이 있을 수 있다. 또한, 다른 매체 의 예시로, 애플리케이션을 유통하는 앱 스토어나 기타 다양한 소프트웨어를 공급 내지 유통하는 사이트, 서버 등에서 관리하는 기록매체 내지 저장매체도 들 수 있다. 본 발명의 방법, 동작 또는 기법들은 다양한 수단에 의해 구현될 수도 있다. 예를 들어, 이러한 기법들은 하드 웨어, 펌웨어, 소프트웨어 또는 이들의 조합으로 구현될 수도 있다. 본 발명의 개시와 연계하여 설명된 다양한 예시적인 논리적 블록들, 모듈들, 회로들, 및 알고리즘 단계들은 전자 하드웨어, 컴퓨터 소프트웨어 또는 양자 의 조합들로 구현될 수도 있음을 통상의 기술자들은 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 대 체를 명확하게 설명하기 위해, 다양한 예시적인 구성요소들, 블록들, 모듈들, 회로들, 및 단계들이 그들의 기능 적 관점에서 일반적으로 위에서 설명되었다. 그러한 기능이 하드웨어로서 구현되는지 또는 소프트웨어로서 구현 되는 지의 여부는, 특정 애플리케이션 및 전체 시스템에 부과되는 설계 요구사항들에 따라 달라진다. 통상의 기 술자들은 각각의 특정 애플리케이션을 위해 다양한 방식들로 설명된 기능을 구현할 수도 있으나, 그러한 구현들 은 본 발명의 범위로부터 벗어나게 하는 것으로 해석되어서는 안 된다. 하드웨어 구현에서, 기법들을 수행하는데 이용되는 프로세싱 유닛들은, 하나 이상의 ASIC들, DSP들, 디지털 신 호 프로세싱 디바이스들(digital signal processing devices; DSPD들), 프로그램가능 논리 디바이스들 (programmable logic devices; PLD들), 필드 프로그램가능 게이트 어레이들(field programmable gate arrays; FPGA들), 프로세서들, 제어기들, 마이크로제어기들, 마이크로프로세서들, 전자 디바이스들, 본 발명에 설명된 기능들을 수행하도록 설계된 다른 전자 유닛들, 컴퓨터 또는 이들의 조합 내에서 구현될 수도 있다. 따라서, 본 발명과 연계하여 설명된 다양한 예시적인 논리 블록들, 모듈들 및 회로들은 범용 프로세서, DSP, ASIC, FPGA나 다른 프로그램 가능 논리 디바이스, 이산 게이트나 트랜지스터 로직, 이산 하드웨어 컴포넌트들, 또는 본 발명에 설명된 기능들을 수행하도록 설계된 것들의 임의의 조합으로 구현되거나 수행될 수도 있다. 범 용 프로세서는 마이크로프로세서일 수도 있지만, 대안으로, 프로세서는 임의의 종래의 프로세서, 제어기, 마이 크로 제어기 또는 상태 머신 일 수도 있다. 프로세서는 또한, 컴퓨팅 디바이스들의 조합, 예를 들면, DSP와 마 이크로프로세서, 복수의 마이크로프로세서들, DSP 코어와 연계한 하나 이상의 마이크로프로세서들 또는 임의의 다 른 구성의 조합으로서 구현될 수도 있다. 펌웨어 및/또는 소프트웨어 구현에 있어서, 기법들은 랜덤 액세스 메모리(random access memory; RAM), 판독 전 용 메모리(read-only memory; ROM), 비휘발성 RAM(non-volatile random access memory; NVRAM), PROM(programmable read-only memory), EPROM(erasable programmable read-only memory), EEPROM(electrically erasable PROM), 플래시 메모리, 컴팩트 디스크(compact disc; CD), 자기 또는 광학 데이 터 스토리지 디바이스 등과 같은 컴퓨터 판독가능 매체 상에 저장된 명령들로써 구현될 수도 있다. 명령들은 하 나 이상의 프로세서들에 의해 실행 가능할 수도 있고, 프로세서로 하여금 본 발명에 설명된 기능의 특정 양태들 을 수행하게 할 수도 있다.소프트웨어로 구현되는 경우, 상기 기법들은 하나 이상의 명령들 또는 코드로서 컴퓨터 판독 가능한 매체 상에 저장되거나 또는 컴퓨터 판독 가능한 매체를 통해 전송될 수도 있다. 컴퓨터 판독가능 매체들은 한 장소에서 다 른 장소로 컴퓨터 프로그램의 전송을 용이하게 하는 임의의 매체를 포함하여 컴퓨터 저장 매체들 및 통신 매체 들 양자를 포함한다. 저장 매체들은 컴퓨터에 의해 액세스될 수 있는 임의의 이용 가능한 매체들일 수도 있다. 비제한적인 예로서, 이러한 컴퓨터 판독가능 매체는 RAM, ROM, EEPROM, CD-ROM 또는 다른 광학 디스크 스토리지, 자기 디스크 스토리지 또는 다른 자기 스토리지 디바이스들, 프로그램 코드를 명령들 또는 데이터 구 조들의 형태로 이송 또는 저장하기 위해 사용될 수 있으며 컴퓨터에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 또한, 임의의 접속이 컴퓨터 판독가능 매체로 적절히 칭해진다. 예를 들어, 소프트웨어가 동축 케이블, 광섬유 케이블, 연선, 디지털 가입자 회선(DSL) 또는 적외선, 마이크로 파와 같은 무선 기술들을 사용하여 웹사이트, 서버 또는 다른 원격 소스로부터 전송되면, 동축 케이블, 광섬유 케이블, 연선, 디지털 가입자 회선, 또는 적외선, 마이크로파와 같은 무선 기술들은 매체의 정의 내에 포함된다. 본 발명에서 사용된 디스크(disk)는, CD, 레이저 디스크, 광 디스크, DVD(digital versatile disc), 플로피디스크 및 블루레이 디스크를 포함하며, 여기서 디스크들(disks)은 보통 자기적으로 데이터를 재생하고, 반면 디스크들(discs)은 레이저를 이용하여 광학적으로 데이터를 재생한다. 위의 조합들도 컴퓨터 판독가능 매 체들의 범위 내에 포함되어야 한다. 소프트웨어 모듈은, RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터들, 하드 디스크, 이동식 디스크, CD-ROM 또는 공지된 임의의 다른 형태의 저장 매체 내에 상주할 수도 있다. 예시적인 저장 매체는, 프로세가 저장 매체로부터 정보를 판독하거나 저장 매체에 정보를 기록할 수 있도록, 프로세서에 연결될 수 있다. 대안으로, 저장 매체는 프로세서에 통합될 수도 있다. 프로세서와 저장 매체는 ASIC 내에 존재 할 수도 있다. ASIC은 유저 단말 내에 존재할 수도 있다. 대안으로, 프로세서와 저장 매체는 유저 단말에서 개 별 구성요소들로써 존재할 수도 있다. 이상 설명된 실시예들이 하나 이상의 독립형 컴퓨터 시스템에서 현재 개시된 주제의 양태들을 활용하는 것으로 기술되었으나, 본 발명은 이에 한정되지 않고, 네트워크나 분산 컴퓨팅 환경과 같은 임의의 컴퓨팅 환경과 연계 하여 구현될 수도 있다. 더 나아가, 본 발명에서 주제의 양상들은 복수의 프로세싱 칩들이나 장치들에서 구현될 수도 있고, 스토리지는 복수의 장치들에 걸쳐 유사하게 영향을 받게 될 수도 있다. 이러한 장치들은 PC들, 네트 워크 서버들 및 휴대용 장치들을 포함할 수도 있다. 한편 본 명세서에 개시된 기술에 관한 설명은 단지 구조적 내지 기능적 설명을 위한 실시예에 불과하므로, 개시 된 기술의 권리범위는 본문에 설명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가지 형태를 가질 수 있으므로 개시된 기술의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 또한, 개시된 기술에서 제시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이해되어서는 아니 될 것이다. 나아가 어떤 구성요소가 다른 구성요소에 “연결되어”있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결될 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요 소가 다른 구성요소에 “직접 연결되어”있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 “~사이에”와 “~사이에” 또 는 “~에 이웃하는”과 “~에 직접 이웃하는” 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, “포 함하다”또는 “가지다” 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또 는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다."}
{"patent_id": "10-2024-0123843", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 텍스트 병렬 추출 시스템의 구성을 개략적으로 나타낸 도면이다. 도 2는 도 1에 도시된 텍스트 병렬 추출 시스템을 이용하여 이미지 내에서 텍스트를 추출 후 실시간으로 번역 및 제공하는 전체적인 과정을 나타낸 개념도이다. 도 3은 로그인 관리부를 통해 사용자 단말의 로그인이 진행되는 상태를 나타낸 사용자 단말 화면이다. 도 4는 대상 이미지 획득부를 통해 생성된 프로젝트 데이터 상에 텍스트 추출 대상이 되는 대상 이미지가 업로 드 된 상태를 나타낸 사용자 단말 화면이다. 도 5는 대상 이미지의 전사 및 텍스트 추출 과정 이후, LLM 기반 번역엔진을 통해 실시간 번역이 진행된 번역 결과가 출력되는 상태를 나타낸 사용자 단말 화면이다. 도 6은 사용자 단말을 통해 특정 번역 결과가 선택된 경우, 해당 선택된 번역 결과에 상응하는 텍스트의 위치가 자동으로 표시되는 상태를 나타낸 사용자 단말 화면이다. 도 7은 사용자 단말을 통해 선택된 특정 번역 결과에 대해 편집이 진행되는 상태를 나타낸 사용자 단말 화면이 다. 도 8은 번역 결과가 설정 포멧의 데이터로 제공되는 상태를 나타낸 사용자 단말 화면이다. 도 9는 본 발명의 일 실시예에 따른 텍스트 병렬 추출 방법을 일련의 순서대로 나타낸 순서도이다."}
