{"patent_id": "10-2022-0022338", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0125575", "출원번호": "10-2022-0022338", "발명의 명칭": "카메라, 인공지능, 블록체인 기반 반려견 건강관리 서비스 제공 시스템 및 방법", "출원인": "디알케이 주식회사", "발명자": "김정태"}}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,반려견 건강관리 서비스 운영 서버는 상기 반려견 관리자 단말기를 이용하여 접속한 상기 반려견 관리자에게 반려견 관련 상품을 판매하는 온라인 쇼핑몰을 제공하며,상기 반려견 건강관리 서비스 운영 서버는 상기 반려견 관련 상품의 판매 대금으로 상기 반려견 관리 보상 블록체인 토큰을 지급받는,블록체인 기반 반려견 건강관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 반려견 건강관리 애플리케이션은 산책 시작 전 상기 반려견에 대한 사진 촬영을 요청하여 촬영된 반려견사진을 상기 반려견 건강관리 서비스 운영 서버로 전송하며,상기 반려견 건강관리 서비스 운영 서버는 상기 전송된 반려견 사진을 이용하여 상기 반려견의 정보를 인식한후 상기 반려견의 보행수를 산출하는,블록체인 기반 반려견 건강관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수가 토큰 지급 최소 보행수 이상인 경우에 상기반려견 관리 보상 블록체인 토큰을 지급하는,블록체인 기반 반려견 건강관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수에 비례하여 상기 반려견 관리 보상 블록체인토큰을 지급하는,블록체인 기반 반려견 건강관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수가 상한 보행수 이상인 경우에 상기 반려견 관리 보상 블록체인 토큰의 지급액이 일정하게 유지되는,블록체인 기반 반려견 건강관리 서비스 제공 시스템.공개특허 10-2023-0125575-3-청구항 6"}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 반려견 건강관리 운영 서버는, 동물병원 및 반려견 관광 상품의 후기확인 및 중개, 예약 서비스를 더 제공하고, 상기 중개 대금으로 상기 반려견 관리 보상 블록체인 토큰을 지급받는,블록체인 기반 반려견 건강관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 반려견 건강관리 서비스 운영 서버는 반려견 관련 상품에 대한 광고를 대행하며,상기 반려견 건강관리 서비스 운영 서버는 상기 광고 대행에 대한 대금으로 상기 반려견 관리 보상 블록체인 토큰을 지급받는,블록체인 기반 반려견 건강관리 서비스 제공 시스템."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "반려견을 관리하는 반려견 관리자가 사용하고 블록체인 네트워크에 통신 가능하게 연결되는 반려견 관리자 단말기에 설치되어서 상기 반려견의 건강관리를 위해 실행되는 반려견 건강관리 애플리케이션과, 상기 블록체인 네트워크에 통신 가능하게 연결되고 블록체인 기술에 기반하여 상기 반려견의 건강을 관리하는 반려견 건강관리서비스 운영 서버를 포함하는 블록체인 기반 반려견 건강관리 서비스 제공 시스템을 이용한 블록체인 기반 반려견 건강관리 서비스 제공 방법으로서,상기 반려견 건강관리 서비스 운영 서버가 상기 반려견 관리자와 함께 산책하는 산책 반려견을 확인하는 반려견확인 단계;상기 반려견 건강관리 서비스 운영 서버가 산책 시 상기 산책 반려견의 보행수를 확인하는 보행수 확인 단계;및상기 반려견 건강관리 서비스 운영 서버가 상기 반려견 건강관리 애플리케이션을 통해 상기 반려견 관리자에게상기 반려견의 보행수에 기초하여 반려견 관리 보상 블록체인 토큰을 지급하는 토큰 지급 단계를 포함하며,상기 보행수 확인 단계에서 상기 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수를 상기 반려견 관리자 단말기에 의해 측정되는 상기 반려견 관리자의 걸음수를 이용하여 산출하는,블록체인 기반 반려견 건강관리 서비스 제공 방법."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "에 있어서,상기 반려견 확인 단계에서 상기 반려견 건강관리 서비스 운영 서버는 상기 반려견 사진으로부터 인공지능 기능을 이용하여 상기 반려견의 정보를 인식하는,블록체인 기반 반려견 건강관리 서비스 제공 방법."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 9에 있어서,상기 토큰 지급 단계가 수행되기 전에, 상기 반려견 건강관리 서비스 운영 서버가 상기 반려견의 보행수가 토큰지급 최소 보행수 이상인지를 확인하는 토큰 지급 조건 만족 확인 단계를 더 포함하는,블록체인 기반 반려견 건강관리 서비스 제공 방법."}
{"patent_id": "10-2022-0022338", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 9에 있어서,상기 토큰 지급 단계에서 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수에 비례하여 반려견 관리보상 블록체인 토큰을 상기 반려견 관리자에게 지급하는,블록체인 기반 반려견 건강관리 서비스 제공 방법."}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 의하면, 반려견을 관리하는 반려견 관리자가 사용하고 블록체인 네트워크에 통신 가능하게 연결되는 반려견 관리자 단말기에 설치되어서 상기 반려견의 건강관리를 위해 실행되는 반려견 건강관리 애플리케이션; 및 상기 블록체인 네트워크에 통신 가능하게 연결되고 블록체인 기술에 기반하여 상기 반려견의 건강을 관리하는 반 (뒷면에 계속)"}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 건강관리 서비스 제공 기술에 관한 것으로서, 더욱 상세하게는 반려견의 건강관리를 위한 서비스 제 공 기술에 관한 것이다."}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "농림축산식품부에 따르면 2020년 기준 전국에서 약 638만 가구가 반려동물을 키우고, 약 1500만명이 반려동물과 함께 생활하는 것으로 추정되며, 반려견은 약 602만마리에 이르며 앞으로도 계속 늘어날 것으로 예상된다. 반려견의 건강관리를 위해서는 산책이 필수적이며, 독일에서는 법적으로 반려견을 1일 1회 이상 산책시키도록 규정하고 있으며, 이러한 반려견 관리 규정이 우리나라에도 도입되어서 운영될 가능성이 있다. 본 발명과 관련된 선행특허문헌으로서 등록특허 제10-2304691호에는, 블록체인 기반 반려동물 관리 시스템으로 서, 반려동물에 착용되는 복수의 센서를 통해 센싱된 데이터를 이용하여 반려동물의 운동량을 측정함으로써 반 려동물의 관리 상태를 분석하는 기술이 기재되어 있다. 하지만, 이러한 이러한 종래의 기술은 반려동물의 운동 량 측정을 위해 반려동물에 센서를 착용시켜야 하기 때문에, 불편이 따르게 된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 등록번호 제10-2304691호 (2021.09.24)"}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 카메라, 인공지능, 블록체인 기반 반려견 건강관리 서비스 제공 시스템 및 방법을 제공하는 것이다.본 발명의 다른 목적은 반려견의 산책 관리가 용이한 블록체인 기반 반려견 건강관리 서비스 제공 시스템 및 방 법을 제공하는 것이다."}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 본 발명의 목적을 달성하기 위하여, 본 발명의 일 측면에 따르면, 반려견을 관리하는 반려견 관리자가 사용하고 인공지능 데이터 네트워크 및 블록체인 네트워크에 통신 가능하게 연결되는 반려견 관리자 단말기에 설치되어서 상기 반려견의 건강관리를 위해 실행되는 반려견 건강관리 애플리케이션; 및 상기 인공지능 데이터 네트워크 및 상기 블록체인 네트워크에 통신 가능하게 연결되고 블록체인 기술에 기반하여 상기 반려견의 건강 을 관리하는 반려견 건강관리 서비스 운영 서버를 포함하며, 상기 반려견 건강관리 서비스 운영 서버는 상기 반 려견 건강관리 애플리케이션을 통해 반려견을 양욱하는데 필요한 수의학적 지식을 인공지능 챗봇의 형태로 제공 받으며, 상기 반려견을 산책시키는 상기 반려견 관리자에게 반려견 관리 보상 블록체인 토큰을 지급하며, 상기 반려견 건강관리 서비스 운영 서버는 상기 반려견 관리 보상 블록체인 토큰을 산책시 상기 반려견의 보행수에 기초하여 지급하며, 상기 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수를 상기 반려견 관리자 단 말기에 의해 측정되는 상기 반려견 관리자의 걸음수를 이용하여 산출하는, 블록체인 기반 반려견 건강관리 서비 스 제공 시스템이 제공된다. 상기한 본 발명의 목적을 달성하기 위하여, 본 발명의 다른 측면에 따르면, 반려견을 관리하는 반려견 관리자가 사용하고 블록체인 네트워크에 통신 가능하게 연결되는 반려견 관리자 단말기에 설치되어서 상기 반려견의 건강 관리를 위해 실행되는 반려견 건강관리 애플리케이션과, 상기 블록체인 네트워크에 통신 가능하게 연결되고 블 록체인 기술에 기반하여 상기 반려견의 건강을 관리하는 반려견 건강관리 서비스 운영 서버를 포함하는 블록체 인 기반 반려견 건강관리 서비스 제공 시스템을 이용한 블록체인 기반 반려견 건강관리 서비스 제공 방법으로서, 상기 반려견 건강관리 서비스 운영 서버가 상기 반려견 관리자와 함께 산책하는 산책 반려견을 확 인하는 반려견 확인 단계; 상기 반려견 건강관리 서비스 운영 서버가 산책 시 상기 산책 반려견의 보행수를 확 인하는 보행수 확인 단계; 및 상기 반려견 건강관리 서비스 운영 서버가 상기 반려견 건강관리 애플리케이션을 통해 상기 반려견 관리자에게 상기 반려견의 보행수에 기초하여 반려견 관리 보상 블록체인 토큰을 지급하는 토 큰 지급 단계를 포함하며, 상기 보행수 확인 단계에서 상기 반려견 건강관리 서비스 운영 서버는 상기 반려견의 보행수를 상기 반려견 관리자 단말기에 의해 측정되는 상기 반려견 관리자의 걸음수를 이용하여 산출하는, 블록 체인 기반 반려견 건강관리 서비스 제공 방법이 제공된다."}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 앞서서 기재한 본 발명의 목적을 모두 달성할 수 있다. 구체적으로, 산책 시 반려견의 보행수 가 반려견에 별도의 측정기를 부착할 필요없이 반려견 관리자의 걸음수를 이용하여 추정되므로, 반려견의 산책 에 대한 보상이 더욱 편리하게 이루어질 수 있다. 또한, 본 발명에 의하면, 반려견 산책 시 반려견의 사진이 촬영되어서 인공지능 인식 기능을 통해 반려견의 견 종 및 크기와 같은 반려견 정보가 확인되므로, 반려견 보행수 추정 정확도를 높일 수 있고, 다른 견종을 이용한 부정행위를 방지할 수 있다."}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예의 구성 및 작용을 상세히 설명한다. 도 1에는 본 발명의 일 실시예에 따른 블록체인 기반 반려견 건강관리 서비스 제공 시스템(이하, '반려견 건강 관리 서비스 제공 시스템'으로 약칭함)의 개략적인 구성이 도시한 블록도로서 도시되어 있다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 반려견 건강관리 서비스 제공 시스템은, 블록체인 네트워크와, 블록체인 네트워크에 통신 가능하게 연결되고 건강관리 대상인 반려견(D)을 관리하는 반려견 관리자(M)가 사용하는 반려견 관리자 단말기와, 블록체인 네트워크에 통신 가능하게 연결되고 반려견(D)의 관리에 필요한 상품 및 이에 대한 광고를 공급하는 상품 공급자가 사용하는 공급자 단말기와, 블록체인 네트워크에 통신 가능하게 연결되고 건강관리 대상인 반려견(D)을 위한 건강관리 정보를 생성하고 관리하며 반려견 관리자 (M)에게 반려견(D)의 건강을 관리하는 활동에 대한 대가로 반려견 관리 보상 블록체인 토큰(PHTE)을 지급하고 상품 공급자가 공급하는 상품에 대한 광고 대행으로 반려견 관리 보상 블록체인 토큰(PHTE)을 지급받으며 반려 견(D)의 관리에 필요한 상품을 판매하는 상품 판매 시스템을 제공하는 반려견 건강관리 서비스 운영 서버 와, 기부된 반려견 관리 보상 블록체인 토큰(PHTE)을 관리하는 기부조합에서 사용하는 기부조합 단말기와, 블록체인 네트워크에 통신 가능하게 연결되고 반려견 관리 보상 블록체인 토큰(PHTE)이 거래되는 토큰 거 래소에서 사용되는 거래소 단말기와, 블록체인 네트워크에 통신 가능하게 연결되고 반려견 관리 보상 블록체인 토큰(PHTE)에 투자하는 투자자가 사용하는 투자자 단말기를 포함한다. 블록체인 네트워크(blockchain network)는 통상적인 블록체인을 형성하도록 구성되는 것으로서, 복수개의 블록체인 노드들을 구비한다. 블록체인 네트워크에는 반려견 관리자 단말기, 반려견 건강관리 서비스 운영 서버, 공급자 단말기, 기부조합 단말기, 거래소 단말기 및 투자자 단말기 가 통신이 가능하게 연결된다. 블록체인 네트워크는 블록체인 기술에 기반하여 동작하는 복수개의 블 록체인 노드들을 의미하는 것이다. 블록체인 기술은 블록이 체인형태로 연결된 저장 구조를 사용하여, 정 보를 블록체인 네트워크를 구성하는 복수개의 블록체인 노드들에 각각 분산 저장하여 영구적으로 보 존한다. 분산된 조각의 분실을 막기 위해 블록체인 노드들은 검증된 분산 조각을 서로 미러링하여 복사한 뒤 저장하며, 블록체인 원장과 지속적으로 대조하여 위변조 및 오염된 분산 조각은 블록체인 네트워크에서 탈락시킨다. 정보가 저장될 수 있는 저장공간을 제공하는 복수개의 블록체인 노드들의 관리자는 블록체인 기술에 기반하여 반려견 관리 보상 블록체인 토큰(PHTE)을 포함하는 암호화폐 등으로 저장공간 제공에 대한 보 상을 받을 수 있다. 블록체인 네트워크는 반려견 관리자 단말기, 반려견 건강관리 서비스 운영 서버 , 공급자 단말기, 기부조합 단말기, 거래소 단말기 및 투자자 단말기로부터 전달된 트랜잭션(transaction)을 포함하는 데이터를 사전결정된 합의 알고리즘에 기초하여 블록 형태로 저장할 수 있다. 블록 형태로 저장되는 데이터는 블록체인 네트워크를 구성하는 복수개의 블록체인 노드들에 의 해 공유될 수 있다. 블록체인 노드는 데스크탑 컴퓨터, 노트북 컴퓨터, 태블릿 피씨, 모바일 기기의 저장공간을 포함한다. 복 수개의 블록체인 노드들 각각은 계층 구조에 따른 블록체인 코어 패키지에 의해 동작할 수 있다. 계층 구 조는, 블록체인 네트워크에서 관리되는 데이터의 구조를 정의하고 데이터를 관리하는 데이터 계층, 블록의 유효성을 검증하고 블록을 생성하는 마이닝(mining)을 수행하고 마이닝 과정에서 채굴자에게 지급되는 수수료의 처리를 담당하는 합의 계층, 스마트 컨트랙트(smart contract)를 처리 및 실행시키는 실행 계층, P2P 네트워크 프로토콜, 해시 함수(Kademlia 분산 해시 테이블), 전자서명, 인코딩 및 공통 저장소를 구현 및 관리하는 공통 계층, 및 다양한 애플리케이션이 생성, 처리 및 관리되는 응용 계층을 포함할 수 있다. 복수개의 블록체인 노드 들 각각은 반려견 관리자 단말기, 반려견 건강관리 서비스 운영 서버, 공급자 단말기, 기 부조합 단말기, 거래소 단말기 및 투자자 단말기로부터 트랜잭션을 포함하는 데이터를 수신할 수 있다. 이 경우, 블록체인 노드는 트랜잭션을 포함하는 데이터를 합의 알고리즘을 통해 검증하고, 블록 을 생성할 수 있다. 또한, 복수개의 블록체인 노드들 각각은 생성된 블록에 트랜잭션을 기록할 수 있다. 블록체인 네트워크는 구현 행태에 따라서 임의의 블록체인 노드들이 합의 동작을 수행하는 퍼블릭 (public) 블록체인 네트워크 또는 사전결정된 블록체인 노드들 만이 합의 동작을 수행하는 프라이빗 (private) 블록체인 네트워크를 포함할 수 있다. 블록체인 네트워크에서 수행되는 합의 알고리즘은, PoS(Proof of Stake) 알고리즘을 사용하며, 그 외에 PoW(Proof of Work) 알고리즘, DPoS(Delegated Proof of Stake) 알고리즘, PBFT(Practical Byzantine Fault Tolerance) 알고리즘, DBFT(Delegated Byzantine Fault Tolerance) 알고리즘, RBFT(Redundant Byzantine Fault Tolerance) 알고리즘, Sieve 알고리즘, Tendermint 알 고리즘, Paxos 알고리즘, Raft 알고리즘, PoA(Proof of Authority) 알고리즘 및/또는 PoET(Proof of Elapsed Tim) 알고리즘을 포함할 수 있다. 블록체인 기술의 합의 알고리즘에 의해 거래 정보를 포함하는 트랙잭션을 블록에 기록하기 때문에 정보의 위조 또는 변조를 방지할 수 있다. 블록체인 네트워크는 퍼블릭 형이거나 프라이빗 형일 수 있다. 블록체인 네트워크가 퍼블릭 형인 경 우에, 트랜잭션을 검증하기 위해서 모든 노드에 검증 작업을 수행해야 하므로 합의 시간, 트랜잭션의 처리 속도 및 컴퓨팅 리소스의 사용 효율성의 측면에서는 비효율적이라는 단점이 존재하지만, 임의의 노드 참여가 가능하 기 때문에 저장된 데이터의 투명성 및 무결성에 있어서 장점이 존재할 수 있다. 또한, 블록체인 네트워크 가 프라이빗 형(또는 컨소시움 형)인 경우에, 운영주체가 명확하기 때문에, 합의 시간, 트랜잭션 처리 속도 및 컴퓨팅 리소스의 사용 효율성의 측면에서는 효율적이라는 장점이 존재하지만, 트랜잭션 처리 과정 및 결과에 대 한 투명성의 측면에서는 단점이 존재할 수 있다. 본 실시예에서 반려견 관리 보상 블록체인 토큰은 블록체인 토큰의 일종으로서, 블록체인 토큰은 코인(coin), 가상화폐(virtual money), 암호화폐(crypto-currency) 등으로 불리는 블록체인 기반 플랫폼에서 거래될 수 있는 통화 또는 지불수단을 의미한다. 본 실시예에서 반려견 관리 보상 블록체인 토큰은 이더리움 블록체인 기반의 ERC-20과 ERC-721, 또는 바이낸스 체인 기반의 BEP-20과 BEP-721을 기반으로 만들어지며, 한국의 업비트, 홍콩 의 바이낸스 등의 암호화폐 거래소에 상장되어서 가격을 부여하는 것으로 설명하는데, 본 발명은 이에 제한되지 않는다. 반려견 관리자 단말기는 반려견(D)을 관리하는 반려견 관리자(M)가 반려견(D)의 관리를 위해 사용하는 단 말기이다. 본 실시예에서 반려견 관리자(M)는 반려견(D)의 주인(견주)뿐만 아니라 견주를 대리하여 반려견(D)을 관리하는 관리 대리인도 포함한다. 반려견 관리자 단말기는 블록체인 네트워크를 통해 반려견 건강관 리 서비스 제공 서버, 기부조합 단말기 및 거래소 단말기와 무선 통신 가능하게 연결된다. 반려 견 관리자 단말기는 스마트폰과 같이 휴대가 가능하고 반려견 건강관리를 위한 응용프로그램인 반려견 건 강관리 애플리케이션(application)이 설치되어서 실행될 수 있는 휴대형 정보 통신 기기이다. 반려견 관리자 (M)는 반려견 관리자 단말기에 설치된 반려견 건강관리 애플리케이션을 통해 반려견(M)을 건강을 관리하는 활동에 대한 대가로 반려견 관리 보상 블록체인 토큰을 지급받고, 공급자가 제공하는 광고를 확인할 수 있다. 반려견 관리자 단말기는 반려견 관리자(M)의 신체 활동을 측정하는 신체활동 측정부를 구비한다. 반려견 관리자 단말기의 신체활동 측정부는 자이로센서를 이용하여 반려견 관리자(M)의 걸음 수, 위치 정보를 이 용하여 반려견 관리자(M)의 이동 거리 등을 측정할 수 있고, 신체활동 측정부에 의해 측정된 신체 활동은 반려 견 건강관리 애플리케이션에 의해 자동으로 반려견 건강관리 서비스 운영 서버로 전송되어서 저장되거나 블록체인 기술에 기반하여 블록체인 네트워크의 블록체인 노드들에 분산 저장될 수 있다. 반려견 관리자 단말기는 사진 촬영을 위한 카메라를 구비한다. 반려견 관리자 단말기에 구비되는 카 메라에 의해 촬영된 반려견(D)을 포함하는 사진 정보는 반려견 관리자 단말기에 설치된 반려견 건강관리 애플리케이션에 의해 자동으로 반려견 건강관리 서비스 운영 서버로 전송되어서 저장되거나 블록체인 기술 에 기반하여 블록체인 네트워크의 블록체인 노드들에 분산 저장될 수 있다. 도시되지는 않았으나, 반 려견 관리자 단말기는 400 ~ 405nm 파장의 UV가 조사된 반려견의 이(teeth)에 대한 사진 정보를 전송할 수 있다. 이는 400 ~ 405nm 파장의 UV에 의해 변색된 반려견의 이의 사진을, 우식증(법랑질과 상아질이 손상되어서 충치가 생기는 질환)을 진단하기 위한 것이다. 이를 위하여, 특정 파장의 UV를 조사하는 장치(예를 들어, 등록 특허 제10-2248141호에 기재된 펜 라이트) 또는 특정 파장의 UV를 조사하는 발광부 및 카메라를 함께 구비하는 카메라 장치(예를 들어, 등록특허 제10-2262446호에 기재된 카메라 시스템)가 함께 사용될 수 있으며, 이 또한 본 발명의 범위에 속하는 것이다. 반려견 관리자 단말기에 설치된 반려견 건강관리 애플리케이션은 반려견 관리자(M) 및 반려견(D)에 대한 정보를 입력하기 위한 정보 입력 수단을 구비한다. 반려견 관리자(M)에 대한 정보는 성명과 연락처 등을 포함한 다. 반려견(D)에 대한 정보는 기본 정보와 이력 정보를 포함하는데, 기본 정보는 사진, 견종, 나이, 성별을 포 함하며, 이력 정보는 사료종, 급식 내역, 간식, 심장사상충 등 정기적 투약 및 병원 방문, 반려견 관리 비용을 포함한다. 정보 입력 수단을 통해 입력된 정보는 자동으로 반려견 건강관리 서비스 운영 서버로 전송되어 서 저장되거나 블록체인 기술에 기반하여 블록체인 네트워크의 블록체인 노드들에 분산 저장될 수 있 다. 반려견 관리자(M)는 반려견 관리자 단말기에 설치된 반려견 건강관리 애플리케이션을 통해 반려견 건강간 리 서비스 운영 서버가 제공하는 상품 구매 시스템에 접속하여 상품 공급자가 공급하는 상품에 대한 상품 구매 절차를 진행할 수 있으며, 이때 구매 대금은 반려견 관리 보상 블록체인 토큰(PHTE)으로 지급될 수 있다. 또한, 반려견 관리자(M)는 반려견 관리자 단말기를 이용하여 거래소 단말기에 접속하여 보유 중인 반려견 관리 보상 블록체인 토큰(PHTE)을 판매하여 수익을 창출할 수 있다. 그리고, 반려견 관리자(M)는 반려견 관리자 단말기를 이용하여 기부조합 단말기에 접속하여 보유 중인 반려견 관리 보상 블록체인 토큰 (PHTE)의 적어도 일부를 기부할 수 있다. 반려견 관리자(M)는 기부조합에 기부한 반려견 관리 보상 블록체인 토 큰(PHTE)의 양에 대응하여 NFT(Non-Fungible Tokens)을 기부조합 단말기로부터 되돌려받는다. 반려견 관리 자(M)는 NFT를 이용하여 상품 판매 시스템이 제공하는 온라인 쇼핑몰에 접속하여 NFT 아이템을 구매할 수 있고, NFT를 통해 본인 반려견(D)만의 NFT 굿즈를 만들거나 심화된 건강관리를 할 수 있다. 공급자 단말기는 블록체인 네트워크에 통신 가능하게 연결되고 반려견(D)의 관리에 필요한 상품 및 이에 대한 광고를 공급하는 상품 공급자가 사용하는 정보 통신 단말기이다. 공급자 단말기는 블록체인 네 트워크를 통해 반려견 건강관리 서비스 운영 서버 및 거래소 단말기와 통신 가능하게 연결된다. 공급자 단말기는 데스크탑 컴퓨터, 노트북 컴퓨터, 태블릿 피씨, 스마트폰 등 블록체인 네트워크에 통신 가능하게 연결될 수 있는 모든 정보 통신 기기를 포함한다. 공급자 단말기를 사용하는 상품 공급자가 공급하는 상품은 반려견(D)과 관련된 물품(사료, 간식, 의료기기, 굿즈 등) 및 반려견(D)의 관리에 필요한 서비 스(의료 서비스 등)를 포함한다. 상품 공급자가 공급하는 상품은 상품 판매 시스템이 제공하는 온라인 쇼핑몰에 서 판매되며, 판매 수수료로서 반려견 관리 보상 블록체인 토큰(PHTE)을 지급할 수 있다. 또한, 상품 공급자는 상품에 대한 광고 콘텐츠를 공급자 단말기를 통해 반려견 건강관리 서비스 운영 서버로 전송함으로써 광고 대행을 맡기며, 광고 대행 수수료로서 반려견 관리 보상 블록체인 토큰(PHTE)을 지급할 수 있다. 공급자 단말기를 통해 반려견 건강관리 서비스 운영 서버로 전송된 광고 콘텐츠는 반려견 관리자 단말기 로 전송된다. 또한, 상품 공급자는 공급자 단말기를 이용하여 거래소 단말기에 접속하여 반려견 관리 보상 블록체인 토큰(PHTE)을 구매하여 보유할 수 있다. 반려견 건강관리 서비스 운영 서버는 블록체인 기술에 기반하여 블록체인 네트워크를 통해 반려견 관 리자 단말기, 공급자 단말기 및 기부조합 단말기와 통신 가능하게 연결되어서, 건강관리 대상인 반려견(D)을 위한 건강관리 정보를 생성하고 관리하며, 반려견 관리자(M)에게 반려견(D)의 건강을 관리하는 활 동에 대한 대가로 반려견 관리 보상 블록체인 토큰(PHTE)을 지급하고, 상품 공급자가 공급하는 상품에 대한 광 고 대행으로 반려견 관리 보상 블록체인 토큰(PHTE)을 지급받는다. 도 2에는 반려견 건강관리 서비스 운영 서버 의 구성이 블록도로서 개략적으로 도시되어 있다. 도 2를 참조하면, 반려견 건강관리 서비스 운영 서버 는 제어부와, 반려견 관리자(M)에 의해 관리되는 반려견(D)과 관련된 정보가 저장되고 제어부와 통신 가능하게 연결되어서 데이터를 주고 받는 반려견 정보 데이터베이스와, 광고와 관련된 정보가 저장되 고 제어부와 통신 가능하게 연결되어서 데이터를 주고 받는 광고 정보 데이터베이스와, 상품과 관련 된 정보가 저장되고 제어부와 통신 가능하게 연결되어서 데이터를 주고 받는 상품 정보 데이터베이스(16 5)와, 반려견 관리 보상 블록체인 토큰과 관련된 정보가 저장되고 제어부와 통신 가능하게 연결되어서 데 이터를 주고 받는 토큰 정보 데이터베이스와, 제어부에 의해 제어되는 통신부를 구비한다. 제어부는 반려견 정보 데이터베이스와, 광고 정보 데이터베이스, 상품 정보 데이터베이스 및 토큰 정보 데이터베이스와 데이터를 주고 받고, 통신부를 통해 반려견 관리자 단말기, 공급 자 단말기 및 기부조합 단말기와 데이터를 주고 받으면서 반려견 건강관리 서비스 프로그램을 실행한 다. 하드웨어적으로 제어부는 메모리에 저장된 반려견 건강관리 서비스 프로그램이 실행되는 중앙처리장치 로 구성될 수 있다. 제어부는 블록체인 기술에 기반하여 반려견 건강관리 서비스 프로그램을 실행한다. 도 3에는 제어부의 구성이 블록도로서 개략적으로 도시되어 있다. 도 3을 참조하면, 제어부는 블록체인 토큰을 관리하는 토큰 관리부와, 반려견(D)의 활동을 확인하는 반려견 활동 확인부와, 공급자 단말기 를 통해 제공되는 광고를 관리하는 광고 관리부와, 상품 판매 시스템을 제공하고 관리하는 상품 판매 관리부와, 반려견(D)의 정보를 관리하는 반려견 정보 관리부를 구비한다. 토큰 관리부는 반려견 건강관리 서비스 제공 시스템에서 반려견 관리 보상 블록체인 토큰의 사용을 관리한다. 토큰 관리부는 반려견(D)의 활동이 토큰 지급 조건을 만족하는 경우에, 토큰 정보 데이터베이스 에 저장된 반려견 관리 보상 블록체인 토큰에 대한 정보에 기초하여 반려견 관리 보상 블록체인 토큰을 반 려견 관리자 단말기로 지급한다. 토근 관리부는 반려견 관리자 단말기로 지급된 반려견 관리 보 상 블록체인 토큰과, 반려견 관리자 단말기 및 공급자 단말기로부터 지급된 반려견 관리 보상 블록체 인 토큰을 반영하여 토큰 정보 데이터베이스를 업데이트한다. 토큰 관리부는 반려견 관리 보상 블록 체인 토큰 정보를 블록체인 네트워크의 블록체인 노드들에 분산 저장할 수도 있다. 토큰 관리부(15 2)는 토큰 지급 조건 만족 여부를 반려견 정보 관리부를 통해 확인한다. 반려견 활동 확인부는 반려견(D)의 활동을 확인한다. 본 실시예에서 반려견 활동 확인부에 의해 확인 되는 반려견(D)의 활동은 산책으로서, 구체적으로 산책에서 반려견(D)의 보행수인 것으로 설명한다. 반려견 활 동 확인부는 반려견 정보 데이터베이스에 저장된 블록체인 노드에 분산 저장된 반려견(D)의 활 동 정보에 기초하여 토큰 지급 조건 만족 여부를 확인하며, 토큰 지급 조건을 만족하는 경우에 토큰 관리부 에 이를 전송한다. 광고 관리부는 공급자 단말기를 통해 제공되는 광고 콘텐츠를 관리한다. 광고 관리부는 광고 정 보 데이터베이스에 저장된 광고 콘테츠들 중 사용자와 관련성이 높은 광고 콘텐츠를 선별한 후 반려견 관 리자 단말기로 전송하여 반려견 관리자(M)가 확인하도록 한다. 광고 관리부는 반려견 정보 데이터베 이스에 저장된 반려견(D)에 대한 정보에 기초하여 관련성이 높은 광고 콘텐츠를 선별한다. 상품 판매 관리부는 상품 판매 시스템을 제공하고 관리한다. 상품 판매 관리부는 온라인 쇼핑몰과 같 은 통상적인 상품 판매 시스템을 제공한다. 반려견 관리자(M)는 상품 판매 관리부가 제공하는 상품 판매 시스템을 이용하여 반려견(M)과 관련된 물품이나 서비스를 구매할 수 있다. 상품 판매 시스템에서는 상품 공급 자가 제공하는 상품(기프티콘, 반려견 의료기기, 간식, 굿즈 등)과 NFT 아이템이 판매된다. 본 실시예에서는 상 품 판매 시스템에서 거래는 반려견 관리 보상 블록체인 토큰(PHTE)이 사용되는 것으로 설명하지만, 이와는 달리 법정 화폐가 사용될 수도 있으며, 이 또한 본 발명의 범위에 속하는 것이다. 반려견 정보 관리부는 관리 대상인 반려견(D)에 대한 정보를 관리한다. 반려견 정보 관리부에서 관리 되는 반려견(D)에 대한 정보는 반려견 관리자(M)에 관한 정보도 포함하는 것이다. 반려견 정보 관리부는 반려견 정보 데이터베이스에 저장되거나 블록체인 네트워크의 블록체인 노드들에 분산 저장된 반려견 관리자(M) 및 반려견(D)에 대한 정보를 이용하여 신규 회원 가입, 기존 회원 탈퇴 및 기존 회원의 확인 등의 절차를 수행함으로써, 반려견 정보를 관리한다. 반려견 정보 관리부는 변경된 반려견 정보를 반려견 정보 데이터베이스에 저장하거나 블록체인 네트워크의 블록체인 노드들에 분산 저장한다. 제어부의 더욱 구체적인 내용은 반려견 건강관리 서비스 제공 시스템을 이용한 반려견 건강관리 서비 스 제공 방법이 순서도로서 도시된 도 4를 참조하여 상세하게 후술될 것이다. 도 2를 참조하면, 반려견 정보 데이터베이스는 하드웨어적으로 메모리장치로 구성되며, 제어부와 통 신 가능하게 연결된다. 반려견 정보 데이터베이스에는 반려견 관리자(M)에 의해 관리되는 반려견 정보가 저장된다. 반려견 정보 데이터베이스에 저장되는 반려견 정보는 반려견 관리자 단말기로부터 전송되 는 반려견(D)에 대한 기본 정보(견종, 사진, 성별, 나이 등) 및 이력정보(사료종, 급식 내역, 간식, 심장사상충 등 정기적 투약 및 병원 방문, 반려견 관리 비용 등)와, 반려견 관리자(M)의 걸음수와 같은 신체활동 정보, 반 려견 관리자(M)가 보상으로 지급받은 블록 체인 토큰 정보, 반려견 관리자(M)가 확인한 광고 정보를 포함한다. 반려견 정보 데이터베이스에 저장된 반려견 정보는 제어부로 제공되어서 반려견 건강관리 서비스 프 로그램의 실행에 활용된다. 광고 정보 데이터베이스는 하드웨어적으로 메모리장치로 구성되며, 제어부와 통신 가능하게 연결된다. 광고 정보 데이터베이스에는 광고와 관련된 정보가 저장된다. 광고 정보 데이터베이스에 저장되는 광고와 관련된 정보는, 광고 콘텐츠와, 광고 콘텐츠를 제공하는 공급자에 대한 정보(업체, 주소, 담당 자, 연락처를 포함)와, 반련견 관리자(M)로의 광고 콘텐츠 제공 정보와, 광고 콘텐츠에 대해 상품 공급자가 지 급하는 광고 대행 수수료 정보를 포함한다. 광고 정보 데이터베이스에 저장된 광고 관련 정보는 제어부 로 제공되어서 반려견 건강관리 서비스 프로그램의 실행에 활용된다. 상품 정보 데이터베이스는 하드웨어적으로 메모리장치로 구성되며, 제어부와 통신 가능하게 연결된다. 상품 정보 데이터베이스에는 온라인 쇼핑몰에서 판매되는 상품에 대한 정보가 저장된다. 상품 정보 데이터베이스에 저장된 상품 관련 정보는 제어부로 제공되어서 반려견 건강관리 서비스 프로그 램의 실행에 활용된다. 토큰 정보 데이터베이스은 하드웨어적으로 메모리장치로 구성되며, 제어부와 통신 가능하게 연결된다. 토큰 정보 데이터베이스에는 반려견 관리 보상 블록체인 토큰(PHTE)과 관련된 정보가 저장된다. 토큰 정보 데이터베이스에는 보유 중인 반려견 관리 보상 블록체인 토큰(PHTE)과, 외부로 지급된 반려견 관리 보상 블록체인 토큰(PHTE)에 대한 정보와, 외부로부터 지급된 반려견 관리 보상 블록체인 토큰(PHTE)에 대 한 정보를 포함한다. 통신부는 제어부에 의해 제어되어서 사용자 단말기 및 광고주 단말기와의 통신에 사용된다.기부조합 단말기는 반려견 관리자 단말기 또는 반려견 건강관리 서비스 운영 서버로부터 기부된 반려견 관리 보상 블록체인 토큰(PHTE)을 관리하는 기부조합에서 사용하는 정보 통신 단말기이다. 기부조합 단 말기는 블록체인 네트워크를 통해 반려견 관리자 단말기, 반려견 건강관리 서비스 운영 서버 및 거래소 단말기와 통신 가능하게 연결된다. 기부조합 단말기는 데스크탑 컴퓨터, 노트북 컴 퓨터, 태블릿 피씨, 스마트폰 등 블록체인 네트워크에 통신 가능하게 연결될 수 있는 모든 정보 통신 기기 를 포함한다. 기부조합은 기부조합 단말기를 이용하여 반려견 관리자로부터 기부된 반려견 관리 보상 블록 체인 토큰(PHTE)의 양에 대응하여 NFT를 되돌려줄 수 있다. 기부조합은 기부조합 단말기를 이용하여 거래 소 단말기에 접속하여 보유 중인 반려견 관리 보상 블록체인 토큰(PHTE)을 판매하여 수익을 창출할 수 있 다. 거래소 단말기는 반려견 관리 보상 블록체인 토큰(PHTE)이 거래되는 토큰 거래소에서 반려견 관리 보상 블 록체인 토큰(PHTE)의 거래를 위해 사용되는 정보 통신 단말기이다. 거래소 단말기는 블록체인 네트워크 를 통해 반려견 관리자 단말기, 공급자 단말기 및 기부조합 단말기 및 투자자 단말기(19 0)와 통신 가능하게 연결된다. 거래소 단말기는 데스크탑 컴퓨터, 노트북 컴퓨터, 태블릿 피씨, 스마트폰 등 블록체인 네트워크에 통신 가능하게 연결될 수 있는 모든 정보 통신 기기를 포함한다. 투자자 단말기는 반려견 관리 보상 블록체인 토큰(PHTE)에 투자하는 투자자가 사용하는 정보통신 단말기이 다. 투자자 단말기는 블록체인 네트워크를 통해 거래소 단말기와 통신 가능하게 연결된다. 투자 자 단말기는 데스크탑 컴퓨터, 노트북 컴퓨터, 태블릿 피씨, 스마트폰 등 블록체인 네트워크에 통신 가능하게 연결될 수 있는 모든 정보 통신 기기를 포함한다. 도 4에는 도 1에 도시된 반려견 건강관리 서비스 제공 시스템을 이용한 본 발명의 일 실시예에 따른 블록 체인 기반 반려견 건강관리 서비스 제공 방법을 설명하는 순서도가 도시되어 있다. 도 4를 참조하면, 본 발명의 일 실시예에 따른 블록체인 반려견 건강관리 서비스 제공 방법은 도 1에 도시된 반려견 건강관리 서비스 제공 시스템을 이용하는 것으로서, 관리 대상 반려견(D)이 확인되는 반려견 확인 단계(S10)와, 반려견 확인 단 계(S10)를 통해 확인된 반려견의 산책에 따른 보행수가 확인되는 보행수 확인 단계(S20)와, 반려견 관리자에 대 한 블록체인 토큰 지급 조건 만족 여부가 확인되는 토큰 지급 조건 만족 확인 단계(S30)와, 토큰 지급 조건 만 족 확인 단계(S30)에서 토큰 지급 조건을 만족하는 것으로 확인된 반려견 관리자에게 블록체인 토큰이 지급되는 토큰 지급 단계(S40)와, 반려견(D)의 활동 이력이 저장되는 이력 저장 단계(S50)를 포함한다. 반려견 확인 단계(S10)에서는 반려견 관리자(M)와 함께 산책하는 반려견(D)이 확인된다. 반려견 확인 단계(S1 0)를 통해 산책을 시작하기 전에 반려견 관리자(M) 및 반려견 관리자(M)와 함께 산책하는 반려견(D)이 인증된다. 반려견 확인 단계(S10)는 반려견 관리자(M)가 산책을 시작하기 전 설정된 시간 내에 야외에서 촬영된 반려견(D)의 사진을 반려견 건강관리 서비스 운영 서버로 전송하고, 반려견 건강관리 서비스 운영 서버 의 반려견 정보 관리부가 인공지능 기능을 이용하여 전송된 반려견(D)의 사진을 인식함으로써 수행된 다. 반려견 확인 단계(S10)를 통해 반려견(D)의 견종이 확인되고, 기 등록된 반려견(D)의 정보와도 비교되어서, 다른 견종을 이용한 부정행위를 방지한다. 반려견 확인 단계(S10)를 통해 반려견(D)이 확인된 후 변려견(D)의 산책이 시작된다. 보행수 확인 단계(S20)에서는 반려견 확인 단계(S10)를 통해 확인된 반려견의 산책에 따른 보행수가 확인된다. 보행수 확인 단계(S20)는 반려견 건강관리 서비스 운영 서버의 반려견 활동 확인부가 반려견(D)의 보 행수를 반려견 관리자(M)의 걸음수로부터 추정하여 산출함으로써 수행된다. 구체적으로, 반려견(D)의 산책 시 반려견(D)과 함께 산책하는 반려견 관리자(M)의 걸음수가 반려견 관리자 단말기에 의해 측정된다. 반려견 관리자 단말기에서 측정된 반려견 관리자(M)의 걸음수는 반려견 건강관리 서비스 운영 서버로 전송되 어서 반려견 정보 데이터베이스에 저장되며, 반려견 건강관리 서비스 운영 서버의 반려견 활동 확인 부는 반려견 관리자(M)의 걸음수로부터 반려견(D)의 보행수를 추정한다. 반려견 활동 확인부는 반려 견 확인 단계(S10)를 통해 확인된 반려견(D)의 견종, 나이, 성별을 포함하는 반려견 정보를 기초로 기 설정된 반려견 보행수와 사람 걸음수 사이의 관계식을 이용하여 반려견(D)의 보행수를 추정한다. 반려견(D)이 클수록 반려견 관리자(M)의 걸음수에 대한 반려견(D)의 보행수는 작아진다. 토큰 지급 조건 만족 확인 단계(S30)에서는 반려견 관리자(M)에 대한 블록체인 토큰 지급 조건 만족 여부가 확 인된다. 토큰 지급 조건 만족 확인 단계(S30)는 제어부의 반려견 활동 확인부가 보행수 확인 단계 (S20)에서 확인된 반려견(D)의 보행수가 토큰 지급 최소 보행수 이상인지를 확인함으로써 수행된다. 본 실시예 에서 토큰 지급 최소 보행수가 1일 5,000보인 것으로 예를 들어서 설명하는데, 본 발명은 이에 제한되지않는다. 토큰 지급 조건 만족 확인 단계(S30)에서 반려견(D)의 보행수가 토큰 지급 조건을 만족하는 것으로 확 인되는 경우에는 토큰 지급 단계(S40)가 수행되고, 토큰 지급 조건을 만족하지 않는 것으로 확인되는 경우에는 토큰 지급 단계(S40)가 수행되지 않고 이력 저장 단계(S50)가 수행된다. 토큰 지급 단계(S40)에서는 토큰 지급 조건 만족 확인 단계(S30)에서 토큰 지급 조건을 만족하는 것으로 확인된 반려견 관리자(M)에게 반려견 관리 보상 블록체인 토큰(PHTE)이 지급된다. 토큰 지급 단계(S40)는 제어부 의 토큰 관리부가 토큰 지급 조건에 따라 정해진 반려견 관리 보상 블록체인 토큰(PHTE)을 반려견 관리자 단말기로 지급함으로써 수행된다. 토큰 지급 단계(S40)에서 지급되는 반려견 관리 보상 블록체인 토큰 (PHTE)은 반려견 상한 보행수 내에서 반려견(D)의 보행수에 비례하여 지급될 수 있다. 본 실시예에서 반려견 상 한 보행수는 10,000보인 것으로 예를 들어서 설명하는데, 본 발명은 이에 제한되지 않는다. 즉, 반려견(D)의 보 행수 5,000보 내지 10,000보의 범위에서 반려견 관리 보상 블록체인 토큰(PHTE)이 반려견(D)의 보행수에 비례하 여 지급될 수 있다. 이력 저장 단계(S50)에서는 반려견(D)의 산책 보행수를 포함하는 활동 이력이 반려견 건강관리 서비스 운영 서 버의 반려견 정보 데이터베이스에 저장된다. 이상 실시예를 통해 본 발명을 설명하였으나, 본 발명은 이에 제한되는 것은 아니다. 상기 실시예는 본 발명의"}
{"patent_id": "10-2022-0022338", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "취지 및 범위를 벗어나지 않고 수정되거나 변경될 수 있으며, 본 기술분야의 통상의 기술자는 이러한 수정과 변 경도 본 발명에 속하는 것임을 알 수 있을 것이다."}
{"patent_id": "10-2022-0022338", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 블록체인 기반 반려견 건강관리 서비스 제공 시스템의 개략적인 구성을 도 시한 블록도이다. 도 2는 도 1에 도시된 블록체인 기반 반려견 건강관리 서비스 제공 시스템에서 반려견 건강관리 서비스 운영 서 버의 구성을 개략적으로 도시한 블록도이다. 도 3은 도 2에 도시된 반려견 건강관리 서비스 운영 서버에서 제어부의 구성을 개략적으로 도시한 블록도이다. 도 4는 도 1에 도시된 블록체인 기반 반려견 건강관리 서비스 제공 시스템을 이용한 블록체인 기반 반려견 건강 관리 서비스 제공 방법의 일 실시예를 설명하는 순서도이다."}
