{"patent_id": "10-2020-0072804", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0155505", "출원번호": "10-2020-0072804", "발명의 명칭": "이동 가능한 전자장치 및 그 제어방법", "출원인": "삼성전자주식회사", "발명자": "권진아"}}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이동가능한 전자장치에 있어서,디스플레이;복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식별하고,복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을상기 디스플레이에 표시하고,상기 전자장치가 상기 제1공간에서 제2공간으로 이동함을 식별하고,상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 프로세서를 포함하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 전자장치가 위치한 공간에 관한 정보를 획득하고,상기 획득된 정보 및 상기 복수의 공간에 대응하여 설정된 참조정보에 기초하여 상기 전자장치가 상기 제1공간에서 상기 제2공간으로 이동함을 식별하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 프로세서는,상기 디스플레이에 상기 참조정보를 설정할 수 있는 그래픽 유저 인터페이스(GUI; Graphic User Interface)를표시하도록 제어하고,상기 표시된 GUI에서 상기 참조정보를 설정하는 사용자입력을 수신하고,상기 수신한 사용자입력에 기초하여 상기 참조정보를 설정하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로세서는,복수의 사용자 중 상기 전자장치를 이용하는 사용자를 식별하고,상기 식별된 사용자에 대응하는 상기 컨텐츠 그룹을 식별하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프로세서는,상기 전자장치의 주변에 위치한 외부장치를 식별하고,상기 식별된 외부장치와 상기 복수의 공간 사이의 대응 관계에 기초하여, 상기 전자장치가 위치한 공간을 식별하는 전자장치.공개특허 10-2021-0155505-3-청구항 6 제1항에 있어서,상기 프로세서는,상기 전자장치의 이동 거리를 식별하고, 상기 식별된 이동 거리에 기초하여 상기 전자장치가 위치한 공간을 식별하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 디스플레이에 상기 복수의 공간 중 어느 하나를 선택할 수 있는 GUI를 표시하도록 제어하고,상기 표시된 GUI에서 상기 전자장치가 위치한 공간을 선택하는 사용자입력을 수신하고,상기 수신한 사용자입력에 기초하여 상기 전자장치가 위치한 공간을 식별하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 프로세서는,상기 복수의 공간 별로 기 정의된 컨텐츠의 우선순위에 기초하여 상기 식별된 공간에 대응하는 컨텐츠 그룹을식별하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는,상기 식별된 공간의 주변 환경을 식별하고,상기 식별된 주변 환경에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어하는전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는, 상기 식별된 주변 환경에 기초하여, 상기 공간에 마련된 외부장치의 설정을 변경하는 GUI를 제공하도록 상기 디스플레이를 제어하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 프로세서는,상기 전자장치의 사용이력을 식별하고,상기 식별된 전자장치의 사용이력에 기초하여 상기 식별된 공간에 대응하는 컨텐츠 그룹을 식별하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 프로세서는, 공개특허 10-2021-0155505-4-상기 복수의 공간 중 상기 전자장치가 위치한 것으로 식별된 제1공간에 기초하여 상기 복수의 컨텐츠 중 상기제1공간에 대응하는 제1컨텐츠의 영상을 표시하고, 상기 제1컨텐츠의 영상 표시 중 상기 전자장치가 제2공간에 위치하는 것으로 식별하면, 상기 제1컨텐츠 및 상기식별된 제2공간에 대응하는 제2컨텐츠 그룹의 영상이 표시되도록 상기 디스플레이를 제어하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 프로세서는,상기 식별된 공간 내 상기 전자장치와 사용자 간의 위치 관계를 식별하고,상기 식별된 전자장치 및 사용자 간의 위치 관계에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는,상기 전자장치와 상기 사용자 간의 거리에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어하는 전자장치."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "이동가능한 전자장치의 제어방법에 있어서,복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식별하는 단계;복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을디스플레이에 표시하는 단계;상기 전자장치가 상기 제1공간에서 제2공간으로 이동함을 식별하는 단계; 및상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계를 포함하는 전자장치의 제어방법."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 전자장치가 상기 제1공간에서 제2공간으로 이동함을 식별하는 단계는,상기 전자장치가 위치한 공간에 관한 정보를 획득하는 단계; 및상기 획득된 정보 및 상기 복수의 공간에 대응하여 설정된 참조정보에 기초하여 상기 전자장치가 상기 제1공간에서 상기 제2공간으로 이동함을 식별하는 단계를 포함하는 전자장치의 제어방법."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계는,상기 복수의 공간 별로 기 정의된 컨텐츠의 우선순위에 기초하여 상기 식별된 공간에 대응하는 컨텐츠 그룹을식별하는 단계를 포함하는 전자장치의 제어방법."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계는,공개특허 10-2021-0155505-5-상기 식별된 공간의 주변 환경을 식별하는 단계; 및상기 식별된 주변 환경에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어하는단계를 포함하는 전자장치의 제어방법."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제15항에 있어서,상기 적어도 하나의 컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계는,상기 제1컨텐츠의 영상 표시 중 상기 전자장치가 제2공간에 위치하는 것으로 식별하면, 상기 제1컨텐츠 및 상기식별된 제2공간에 대응하는 제2컨텐츠 그룹의 영상이 표시되도록 상기 디스플레이를 제어하는 단계를 포함하는전자장치의 제어방법."}
{"patent_id": "10-2020-0072804", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "컴퓨터가 읽을 수 있는 코드로서, 전자장치의 제어방법을 수행하는 코드를 포함하는 컴퓨터 프로그램이 저장된기록매체에 있어서, 상기 전자장치의 제어방법은, 복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식별하는 단계;복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을디스플레이에 표시하는 단계;상기 전자장치가 상기 제1공간에서 제2공간으로 이동함을 식별하는 단계; 및상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계를 포함하는 것을 특징으로 하는 컴퓨터가 읽을 수 있는 프로그램이 기록된 기록매체."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 이동가능한 전자장치에 있어서, 디스플레이; 복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식별하고, 복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함 하는 제1컨텐츠 그룹의 영상을 상기 디스플레이에 표시하고, 상기 전자장치가 상기 제1공간에서 제2공간으로 이 동함을 식별하고, 상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상 을 상기 디스플레이에 표시하는 프로세서를 포함할 수 있다."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 컨텐츠를 제공하는 전자장치 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래 전자장치의 경우, 선택된 컨텐츠만을 제공하거나, 지정된 배경화면을 표시할 뿐, 상황에 따라 다른 컨텐츠 를 제공하지 않았다. 또한, 복수의 전자장치가 존재하는 경우에도 장치 별로 다른 화면을 표시하고, 복수의 장 치간 컨텐츠 등을 호환하는 기능을 제공하지 않았다. 최근 스마트 전자장치와 관련된 기술로서 사용자를 인식하여 인식된 사용자에게 맞는 기능을 제공해 주거나, 복 수의 전자장치의 사용자가 서로 다르더라도 사용자에 맞게 변화하는 기능까지 제공해주는 전자장치가 개발되어 왔다. 보다 편리하고 유용한 컨텐츠 이용을 위해, 상황 별 컨텐츠를 제공할 수 있는 기술에 대한 니즈(needs)가 증가 됨에 따라, 사용자 별 컨텐츠를 제공하는 기능을 넘어서 보다 상황에 맞는 컨텐츠를 제공하는 기술에 대한 개발 이 필요하다."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 보다 상황에 맞게 컨텐츠를 제공하는 전자장치 및 그 제어방법에 관한 것이다."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 이동가능한 전자장치에 있어서, 디스플레이; 복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식별하고, 복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함 하는 제1컨텐츠 그룹의 영상을 상기 디스플레이에 표시하고, 상기 전자장치가 상기 제1공간에서 제2공간으로 이동함을 식별하고, 상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상 을 상기 디스플레이에 표시하는 프로세서를 포함할 수 있다. 상기 프로세서는, 상기 전자장치가 위치한 공간에 관한 정보를 획득하고, 상기 획득된 정보 및 상기 복수의 공 간에 대응하여 설정된 참조정보에 기초하여 상기 전자장치가 상기 제1공간에서 상기 제2공간으로 이동함을 식별 할 수 있다. 상기 프로세서는, 상기 디스플레이에 상기 참조정보를 설정할 수 있는 그래픽 유저 인터페이스(GUI; Graphic User Interface)를 표시하도록 제어하고, 상기 표시된 GUI에서 상기 참조정보를 설정하는 사용자입력을 수신하 고, 상기 수신한 사용자입력에 기초하여 상기 참조정보를 설정할 수 있다. 상기 프로세서는, 복수의 사용자 중 상기 전자장치를 이용하는 사용자를 식별하고, 상기 식별된 사용자에 대응 하는 상기 컨텐츠 그룹을 식별할 수 있다. 상기 프로세서는, 상기 전자장치의 주변에 위치한 외부장치를 식별하고, 상기 식별된 외부장치와 상기 복수의 공간 사이의 대응 관계에 기초하여, 상기 전자장치가 위치한 공간을 식별할 수 있다. 상기 프로세서는, 상기 전자장치의 이동 거리를 식별하고, 상기 식별된 이동 거리에 기초하여 상기 전자장치가 위치한 공간을 식별할 수 있다. 상기 프로세서는, 상기 디스플레이에 상기 복수의 공간 중 어느 하나를 선택할 수 있는 GUI를 표시하도록 제어 하고, 상기 표시된 GUI에서 상기 전자장치가 위치한 공간을 선택하는 사용자입력을 수신하고, 상기 수신한 사용 자입력에 기초하여 상기 전자장치가 위치한 공간을 식별할 수 있다. 상기 프로세서는, 상기 복수의 공간 별로 기 정의된 컨텐츠의 우선순위에 기초하여 상기 식별된 공간에 대응하 는 컨텐츠 그룹을 식별할 수 있다. 상기 프로세서는, 상기 식별된 공간의 주변 환경을 식별하고, 상기 식별된 주변 환경에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 식별된 주변 환경에 기초하여, 상기 공간에 마련된 외부장치의 설정을 변경하는 GUI를 제공하도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 전자장치의 사용이력을 식별하고, 상기 식별된 전자장치의 사용이력에 기초하여 상기 식 별된 공간에 대응하는 컨텐츠 그룹을 식별할 수 있다. 상기 프로세서는, 상기 복수의 공간 중 상기 전자장치가 위치한 것으로 식별된 제1공간에 기초하여 상기 복수의 컨텐츠 중 상기 제1공간에 대응하는 제1컨텐츠의 영상을 표시하고, 상기 제1컨텐츠의 영상 표시 중 상기 전자장 치가 제2공간에 위치하는 것으로 식별하면, 상기 제1컨텐츠 및 상기 식별된 제2공간에 대응하는 제2컨텐츠 그룹 의 영상이 표시되도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 식별된 공간 내 상기 전자장치와 사용자 간의 위치 관계를 식별하고, 상기 식별된 전자 장치 및 사용자 간의 위치 관계에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어할 수 있다. 상기 프로세서는, 상기 전자장치와 상기 사용자 간의 거리에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시 하도록 상기 디스플레이를 제어할 수 있다. 본 발명의 일 실시예에 따른 이동가능한 전자장치의 제어방법에 있어서, 복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식별하는 단계; 복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을 디스플레이에 표시하는 단계; 상기 전자장치가 상기 제1공간에서 제2공간으 로 이동함을 식별하는 단계; 및 상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐 츠 그룹의 영상을 상기 디스플레이에 표시하는 단계를 포함할 수 있다. 상기 전자장치가 상기 제1공간에서 상기 제2공간으로 이동함을 식별하는 단계는, 상기 전자장치가 위치한 공간 에 관한 정보를 획득하는 단계; 및 상기 획득된 정보 및 상기 복수의 공간에 대응하여 설정된 참조정보에 기초 하여 상기 전자장치가 상기 제1공간에서 상기 제2공간으로 이동함을 식별하는 단계를 포함할 수 있다. 상기 획득된 정보 및 상기 복수의 공간에 대응하여 설정된 참조정보에 기초하여 상기 전자장치가 상기 제1공간 에서 상기 제2공간으로 이동함을 식별하는 단계는, 상기 디스플레이에 상기 참조정보를 설정할 수 있는 GUI를표시하도록 제어하는 단계; 상기 표시된 GUI에서 상기 참조정보를 설정하는 사용자입력을 수신하는 단계; 및 상 기 수신한 사용자입력에 기초하여 상기 참조정보를 설정하는 단계를 포함할 수 있다. 상기 식별된 공간에 대응하는 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시 하는 단계는, 복수의 사용자 중 상기 전자장치를 이용하는 사용자를 식별하는 단계; 및 상기 식별된 사용자에 대응하는 상기 컨텐츠 그룹을 식별하는 단계를 포함할 수 있다. 본 발명의 일 실시예에 따른 전자장치의 제어방법에 있어서, 상기 전자장치의 주변에 위치한 외부장치를 식별하 는 단계; 및 상기 식별된 외부장치와 상기 복수의 공간 사이의 대응 관계에 기초하여, 상기 전자장치가 위치한 공간을 식별하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 전자장치의 제어방법에 있어서, 상기 전자장치의 이동 거리를 식별하는 단계; 및 상기 식별된 이동 거리에 기초하여 상기 전자장치가 위치한 공간을 식별하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 전자장치의 제어방법에 있어서, 상기 디스플레이에 상기 복수의 공간 중 어느 하나 를 선택할 수 있는 GUI를 표시하는 단계; 상기 표시된 GUI에서 상기 전자장치가 위치한 공간을 선택하는 사용자 입력을 수신하는 단계; 및 상기 수신한 사용자입력에 기초하여 상기 전자장치가 위치한 공간을 식별하는 단계를 더 포함할 수 있다. 상기 식별된 공간에 대응하는 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시 하는 단계는, 상기 복수의 공간 별로 기 정의된 컨텐츠의 우선순위에 기초하여 상기 식별된 공간에 대응하는 컨 텐츠 그룹을 식별하는 단계를 더 포함할 수 있다. 상기 식별된 공간에 대응하는 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시 하는 단계는, 상기 식별된 공간의 주변 환경을 식별하는 단계; 및 상기 식별된 주변 환경에 기초하여 상기 식별 된 컨텐츠 그룹의 영상을 표시하는 단계를 포함할 수 있다. 상기 식별된 주변 환경에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하는 단계는, 상기 식별된 주변 환경 에 기초하여, 상기 공간에 마련된 외부장치의 설정을 변경하는 GUI를 제공하도록 상기 디스플레이를 제어하는 단계를 포함할 수 있다. 상기 식별된 공간에 대응하는 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시 하는 단계는, 상기 전자장치의 사용이력을 식별하는 단계; 및 상기 식별된 전자장치의 사용이력에 기초하여 상 기 식별된 공간에 대응하는 컨텐츠 그룹을 식별하는 단계를 포함할 수 있다. 상기 적어도 하나의 컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계는, 상기 제1 컨텐츠의 영상 표시 중 상기 전자장치가 제2공간에 위치하는 것으로 식별하면, 상기 제1컨텐츠 및 상기 식별된 제2공간에 대응하는 제2컨텐츠 그룹의 영상이 표시되도록 상기 디스플레이를 제어하는 단계를 포함할 수 있다. 상기 식별된 공간에 대응하는 적어도 하나의 컨텐츠를 포함하는 컨텐츠 그룹의 영상을 상기 디스플레이에 표시 하는 단계는, 상기 식별된 공간 내 상기 전자장치와 사용자 간의 위치 관계를 식별하는 단계; 상기 식별된 전자 장치 및 사용자 간의 위치 관계에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상기 디스플레이를 제어하는 단계를 포함할 수 있다. 상기 식별된 전자장치 및 사용자 간의 위치 관계에 기초하여 상기 식별된 컨텐츠 그룹의 영상을 표시하도록 상 기 디스플레이를 제어하는 단계는, 상기 전자장치와 상기 사용자 간의 거리에 기초하여 상기 식별된 컨텐츠 그 룹의 영상을 표시하도록 상기 디스플레이를 제어하는 단계를 포함할 수 있다. 컴퓨터가 읽을 수 있는 코드로서, 전자장치의 제어방법을 수행하는 코드를 포함하는 컴퓨터 프로그램이 저장된 기록매체에 있어서, 상기 전자장치의 제어방법은, 복수의 공간 중에서 상기 전자장치가 제1공간에 위치함을 식 별하는 단계; 복수의 컨텐츠 중에서 상기 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을 디스플레이에 표시하는 단계; 상기 전자장치가 상기 제1공간에서 제2공간으로 이동함을 식별하는 단계; 및 상기 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 상기 디스플레이에 표시하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이동가능한 전자장치의 특성상 공간에 따라 자유자재로 변화하며 사용자에게 상황에 맞는 화면을 제공해 줄 수 있어, 사용자의 전자장치 활용성을 높일 수 있다."}
{"patent_id": "10-2020-0072804", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 발명의 실시예들을 상세히 설명한다. 도면에서 동일한 참조번호 또는 부호 는 실질적으로 동일한 기능을 수행하는 구성요소를 지칭하며, 도면에서 각 구성요소의 크기는 설명의 명료성과 편의를 위해 과장되어 있을 수 있다. 다만, 본 발명의 기술적 사상과 그 핵심 구성 및 작용이 이하의 실시예에 설명된 구성 또는 작용으로만 한정되지는 않는다. 본 발명을 설명함에 있어서 본 발명과 관련된 공지 기술 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명 을 생략하기로 한다. 본 발명의 실시예에서, 제1, 제2 등과 같이 서수를 포함하는 용어는 하나의 구성요소를 다른 구성요소로부터 구 별하는 목적으로만 사용되며, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 또한, 본 발명의 실시예에서, '구성되다', '포함하다', '가지다' 등의 용어는 하나 또는 그 이상의 다른 특징들 이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않 는 것으로 이해되어야 한다. 또한, 본 발명의 실시예에서, '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있으며, 적어 도 하나의 모듈로 일체화되어 구현될 수 있다. 또한, 본 발명의 실시예에서, 복수의 요소 중 적어도 하나(at least one)는, 복수의 요소 전부뿐만 아니라, 복수의 요소 중 나머지를 배제한 각 하나 혹은 이들의 조합 모두 를 지칭한다. 도 1은 본 발명의 일 실시예에 따른 전자장치를 도시한 도면이다. 도 1에서는 사용자가 전자장치를 들고 있는 모습이 도시되어 있다. 이 때, 전자장치는 이동 가능한 전자장치로써, 영상을 표시할 수 있는 디스플레이장치로 구현될 수 있다. 일 예로, 전자장치는 TV, 컴퓨터, 스마트 폰, 태블릿, 휴대용 미디어 플레이어, 웨어러블 디바이스, 비디오 월, 전자액자 등을 포함할 수 있다. 이동 가능한 장치인 바, 사용자가 전자장치를 들고 이동하는 등 전자장치가 위치한 공간에 변 화가 생기는 경우, 그 상황에 맞는 컨텐츠 등을 제공할 수 있다. 이하 자세한 내용은 후술한다. 도 2는 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 2에서는 네 곳의 서로 다른 공간에 전자장치가 위치하는 경우, 전자장치가 제공하는 컨텐츠 그룹 을 도시하고 있다. 컨텐츠 그룹은 이미지, 동영상, 어플리케이션 등의 컨텐츠 뿐 아니라, 이들을 선택할 수 있 는 아이콘, 사물인터넷(IoT; Internet of Things)이나 다른 외부장치를 제어할 수 있는 위젯(Widget), 일정이나 시간을 나타내는 위젯, 건강상태 등을 나타내는 위젯 등을 포함할 수 있으며, 어느 하나에 한정되는 것은 아니 다. 예컨대, 제1공간은 부엌이라고 가정해본다. 부엌에 전자장치가 놓인 경우, 전자장치는 부엌에서 아침을 준비하는 사용자에게 오늘 해야할 일 등 일정을 나타내는 스케줄표를 표시할 수 있다. 이 때, 전자장치 는 전자장치가 위치한 공간을 이미지센싱, GPS 신호, 초음파, 무선주파수(RF; Radio Frequency), 적 외선(IR; Infrared), 마이크로폰 등 다양한 방법으로 식별할 수 있다. 각 방법에 대한 자세한 내용은 후술 한다. 제2공간은 안방이고, 전자장치는 시간 및 날짜를 나타내는 위젯과 사용자의 수면시간 등 건강상태를 나타내는 위젯을 표시할 수 있다. 제3공간은 키즈룸이고, 키즈룸의 인테리어 색상에 맞추어 전자장치는 배경화면을 설정할 수 있다. 또 한, 사용자가 아이들이므로 아이들을 위한 영상이나 이미지를 볼 수 있는 아이콘이 표시될 수 있다. 제4공간은 거실이고, 거실 인테리어 색상에 맞추어 전자장치는 배경화면을 설정할 수 있다. 거실에서 는 사용자가 촬영한 사진을 볼 수 있는 앨범 어플리케이션이나, 방송을 실시간으로 시청할 수 있는 TV 어플리케 이션, 스트리밍 서비스와 관련된 어플리케이션이 표시될 수 있다. 따라서, 본 발명의 일 실시예에 따르면, 전자장치는 공간의 특성에 맞게 화면을 표시하고, 컨텐츠를 제공 할 수 있으므로 사용자의 이용편의성을 높여줄 수 있다. 도 3은 본 발명의 일 실시예에 의한 전자장치의 구성을 도시한 블록도이다. 도 3에 도시된 바와 같이, 전자장치는 인터페이스부를 포함할 수 있다. 인터페이스부는 유선 인 터페이스부를 포함할 수 있다. 유선 인터페이스부는 지상파/위성방송 등 방송표준에 따른 방송신호를 수신할 수 있는 안테나가 연결되거나, 케이블 방송표준에 따른 방송신호를 수신할 수 있는 케이블이 연결될 수 있는 커넥터 또는 포트를 포함한다. 다른 예로서, 전자장치는 방송신호를 수신할 수 있는 안테나를 내장할 수도 있다. 유선 인터페이스부는 HDMI 포트, DisplayPort, DVI 포트, 썬더볼트, 컴포지트(composite) 비 디오, 컴포넌트(component) 비디오, 슈퍼 비디오(super video), SCART 등과 같이, 비디오 및/또는 오디오 전송 표준에 따른 커넥터 또는 포트 등을 포함할 수 있다. 유선 인터페이스부는 USB 포트 등과 같은 범용 데이 터 전송표준에 따른 커넥터 또는 포트 등을 포함할 수 있다. 유선 인터페이스부는 광 전송표준에 따라 광 케이블이 연결될 수 있는 커넥터 또는 포트 등을 포함할 수 있다. 유선 인터페이스부는 외부 마이크 또는 마이크를 구비한 외부 오디오기기가 연결되며, 오디오기기로부터 오디오 신호를 수신 또는 입력할 수 있는 커넥 터 또는 포트 등을 포함할 수 있다. 유선 인터페이스부는 헤드셋, 이어폰, 외부 스피커 등과 같은 오디오 기기가 연결되며, 오디오기기로 오디오 신호를 전송 또는 출력할 수 있는 커넥터 또는 포트 등을 포함할 수 있 다. 유선 인터페이스부는 이더넷 등과 같은 네트워크 전송표준에 따른 커넥터 또는 포트를 포함할 수 있다. 예컨대, 유선 인터페이스부는 라우터 또는 게이트웨이에 유선 접속된 랜카드 등으로 구현될 수 있다. 유선 인터페이스부는 상기 커넥터 또는 포트를 통해 셋탑박스, 광학미디어 재생장치와 같은 외부기기, 또 는 외부 디스플레이장치나, 스피커, 서버 등과 1:1 또는 1:N(N은 자연수) 방식으로 유선 접속됨으로써, 해당 외 부기기로부터 비디오/오디오 신호를 수신하거나 또는 해당 외부기기에 비디오/오디오 신호를 송신한다. 유선 인 터페이스부는, 비디오/오디오 신호를 각각 별개로 전송하는 커넥터 또는 포트를 포함할 수도 있다. 그리고, 본 실시예에 따르면 유선 인터페이스부는 전자장치에 내장되나, 동글(dongle) 또는 모듈 (module) 형태로 구현되어 전자장치의 커넥터에 착탈될 수도 있다. 인터페이스부는 무선 인터페이스부를 포함할 수 있다. 무선 인터페이스부는 전자장치의 구 현 형태에 대응하여 다양한 방식으로 구현될 수 있다. 예를 들면, 무선 인터페이스부는 통신방식으로 RF(radio frequency), 지그비(Zigbee), 블루투스(bluetooth), 와이파이(Wi-Fi), UWB(Ultra WideBand) 및 NFC(Near Field Communication) 등 무선통신을 사용할 수 있다. 무선 인터페이스부는 와이파이(Wi-Fi) 방 식에 따라서 AP와 무선통신을 수행하는 무선통신모듈이나, 블루투스 등과 같은 1대 1 다이렉트 무선통신을 수행하는 무선통신모듈 등으로 구현될 수 있다. 무선 인터페이스부는 네트워크 상의 서버와 무선 통신함으로써, 서버와의 사이에 데이터 패킷을 송수신할 수 있다. 무선 인터페이스부는 적외선 통신표준에 따라 IR(Infrared) 신호를 송신 및/또는 수신할 수 있는 IR송신부 및/또는 IR수신부를 포함할 수 있다. 무선 인 터페이스부는 IR송신부 및/또는 IR수신부를 통해 리모컨 또는 다른 외부기기로부터 리모컨신호를 수신 또 는 입력하거나, 다른 외부기기로 리모컨신호를 전송 또는 출력할 수 있다. 다른 예로서, 전자장치는 와이 파이(Wi-Fi), 블루투스(bluetooth) 등 다른 방식의 무선 인터페이스부를 통해 리모컨 또는 다른 외부기기 와 리모컨신호를 송수신할 수 있다. 전자장치는 인터페이스부를 통해 수신하는 비디오/오디오신호가 방송신호인 경우, 수신된 방송신호를 채널 별로 튜닝하는 튜너(tuner)를 더 포함할 수 있다. 전자장치는 디스플레이부를 포함할 수 있다. 디스플레이부는 화면 상에 영상을 표시할 수 있는 디스플레이 패널을 포함한다. 디스플레이 패널은 액정 방식과 같은 수광 구조 또는 OLED 방식과 같은 자발광 구 조로 마련된다. 디스플레이부는 디스플레이 패널의 구조에 따라서 부가적인 구성을 추가로 포함할 수 있는 데, 예를 들면 디스플레이 패널이 액정 방식이라면, 디스플레이부는 액정 디스플레이 패널과, 광을 공급하 는 백라이트유닛과, 액정 디스플레이 패널의 액정을 구동시키는 패널구동기판을 포함한다. 전자장치는 사용자입력부를 포함할 수 있다. 사용자입력부는 사용자의 입력을 수행하기 위해 마 련된 다양한 종류의 입력 인터페이스 관련 회로를 포함한다. 사용자입력부는 전자장치의 종류에 따라 서 여러 가지 형태의 구성이 가능하며, 예컨대, 전자장치의 기계적 또는 전자적 버튼부, 전자장치와 분리된 리모트 컨트롤러, 전자장치와 연결된 외부기기에서의 입력부, 터치패드, 디스플레이부에 설치 된 터치스크린 등이 있다. 전자장치는 저장부를 포함할 수 있다. 저장부는 디지털화된 데이터를 저장한다. 저장부는 전원의 제공 유무와 무관하게 데이터를 보존할 수 있는 비휘발성 속성의 스토리지(storage)와, 프로세서에 의해 처리되기 위한 데이터가 로딩되며 전원이 제공되지 않으면 데이터를 보존할 수 없는 휘발성 속성의 메모리 (memory)를 포함한다. 스토리지에는 플래시메모리(flash-memory), HDD(hard-disc drive), SSD(solid-state drive) ROM(Read Only Memory) 등이 있으며, 메모리에는 버퍼(buffer), 램(RAM; Random Access Memory) 등이 있다. 전자장치는 마이크로폰을 포함할 수 있다. 마이크로폰은 사용자 음성을 비롯한 외부 환경의 소 리를 수집한다. 마이크로폰은 수집된 소리의 신호를 프로세서에 전달한다. 전자장치는 사용자 음성을 수집하는 마이크로폰을 구비하거나, 또는 인터페이스부를 통해 마이크로폰을 가진 리모트 컨 트롤러, 스마트폰 등의 외부장치로부터 음성신호를 수신할 수 있다. 외부장치에 리모트 컨트롤러 어플리케이션 을 설치하여 전자장치를 제어하거나 음성 인식 등의 기능을 수행할 수도 있다. 이와 같은 어플리케이션이 설치된 외부장치의 경우, 사용자 음성을 수신할 수 있으며, 외부장치는 전자장치와 Wi-Fi/BT 또는 적외선 등을 이용하여 데이터 송수신 및 제어가 가능한 바, 상기 통신 방식을 구현할 수 있는 복수의 인터페이스부 가 전자장치 내에 존재할 수 있다. 전자장치는 스피커를 포함할 수 있다. 스피커는 프로세서에 의해 처리되는 오디오 데이터 를 소리로 출력한다. 스피커는 어느 한 오디오 채널의 오디오 데이터에 대응하게 마련된 단위 스피커를 포 함하며, 복수 오디오 채널의 오디오 데이터에 각기 대응하도록 복수의 단위 스피커를 포함할 수 있다. 다른 실 시예로서, 스피커는 전자장치와 분리되어 마련될 수 있으며, 이 경우 전자장치는 오디오 데이터 를 인터페이스부를 통하여 스피커로 전달할 수 있다. 전자장치는 센서를 포함할 수 있다. 센서는 가속도 센서, 자이로 센서 등을 포함한다. 프로세서 는 전자장치를 이용한 외부장치에 대한 사용자 탭으로 정의된 센싱값을 저장부에 저장할 수 있 다. 추후, 사용자 이벤트가 감지되는 경우, 프로세서는 감지된 센싱값이 저장된 센싱값에 대응하는지 여부 에 기초하여 사용자 이벤트의 발생 여부를 식별할 수 있다. 전자장치는 카메라를 포함할 수 있다. 프로세서는 카메라를 통해 전자장치의 앞면 혹은 뒷 면에 위치하여 전자장치의 주변환경을 촬상할 수 있다. 전자장치는 프로세서를 포함할 수 있다. 프로세서는 인쇄회로기판 상에 장착되는 CPU, 칩셋, 버 퍼, 회로 등으로 구현되는 하나 이상의 하드웨어 프로세서를 포함하며, 설계 방식에 따라서는 SOC(system on chip)로 구현될 수도 있다. 프로세서는 전자장치가 디스플레이장치로 구현되는 경우에 디멀티플렉서,디코더, 스케일러, 오디오 DSP(Digital Signal Processor), 앰프 등의 다양한 프로세스에 대응하는 모듈들을 포 함한다. 여기서, 이러한 모듈들 중 일부 또는 전체가 SOC로 구현될 수 있다. 예를 들면, 디멀티플렉서, 디코더, 스케일러 등 영상처리와 관련된 모듈이 영상처리 SOC로 구현되고, 오디오 DSP는 SOC와 별도의 칩셋으로 구현되 는 것이 가능하다. 프로세서는 마이크로폰 등에 의해 사용자 음성에 대한 음성신호를 획득하면, 음성신호를 음성데이터 로 변환할 수 있다. 이 때, 음성데이터는 음성신호를 텍스트 데이터로 변환하는 STT(Speech-to-Text) 처리 과정 을 통해 얻어진 텍스트 데이터일 수 있다. 프로세서는 음성데이터가 나타내는 커맨드를 식별하고, 식별된 커맨드에 따라서 동작을 수행한다. 음성데이터 처리 과정과, 커맨드 식별 및 수행 과정은, 전자장치에서 모두 실행될 수도 있다. 그러나, 이 경우에 전자장치에 필요한 시스템 부하 및 소요 저장용량이 상대적으 로 커지게 되므로, 적어도 일부의 과정은 네트워크를 통해 전자장치와 통신 가능하게 접속되는 적어도 하 나의 서버에 의해 수행될 수 있다. 본 발명에 따른 프로세서는 전자장치와 같은 기기(Machine)가 읽을 수 있는 저장 매체(Storage Medium)에 저장된 소프트웨어의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 전자장치와 같은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영 되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(Non-transitory) 저장매체 의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장매체가 실재(tangible)하는 장치이고, 신호(예컨대, 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 한편, 프로세서는 복수의 공간 중에서 전자장치가 제1공간에 위치함을 식별하고, 복수의 컨텐츠 중에 서 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을 디스플레이에 표시 하고, 전자장치가 제1공간에서 제2공간으로 이동함을 식별하고, 식별된 제2공간에 대응하는 적어도 하나 의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 디스플레이에 표시하기 위한 데이터 분석, 처리, 및 결 과 정보 생성 중 적어도 일부를 규칙 기반 또는 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 일 예로, 프로세서는 학습부 및 인식부의 기능을 함께 수행할 수 있다. 학습부는 학습된 신경망 네트워크 를 생성하는 기능을 수행하고, 인식부는 학습된 신경망 네트워크를 이용하여 데이터를 인식(또는, 추론, 예측, 추정, 판단)하는 기능을 수행할 수 있다. 학습부는 신경망 네트워크를 생성하거나 갱신할 수 있다. 학습부는 신 경망 네트워크를 생성하기 위해서 학습 데이터를 획득할 수 있다. 일 예로, 학습부는 학습 데이터를 저장부 또는 외부로부터 획득할 수 있다. 학습 데이터는, 신경망 네트워크의 학습을 위해 이용되는 데이터일 수 있으며, 상기한 동작을 수행한 데이터를 학습데이터로 이용하여 신경망 네트워크를 학습시킬 수 있다. 학습부는 학습 데이터를 이용하여 신경망 네트워크를 학습시키기 전에, 획득된 학습 데이터에 대하여 전처리 작 업을 수행하거나, 또는 복수 개의 학습 데이터들 중에서 학습에 이용될 데이터를 선별할 수 있다. 일 예로, 학 습부는 학습 데이터를 기 설정된 포맷으로 가공하거나, 필터링하거나, 또는 노이즈를 추가/제거하여 학습에 적 절한 데이터의 형태로 가공할 수 있다. 학습부는 전처리된 학습 데이터를 이용하여 상기한 동작을 수행하도록 설정된 신경망 네트워크를 생성할 수 있다. 학습된 신경망 네트워크는, 복수의 신경망 네트워크(또는, 레이어)들로 구성될 수 있다. 복수의 신경망 네트워 크의 노드들은 가중치를 가지며, 복수의 신경망 네트워크들은 일 신경망 네트워크의 출력 값이 다른 신경망 네 트워크의 입력 값으로 이용되도록 서로 연결될 수 있다. 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN (Bidirectional Recurrent Deep Neural Network) 및 심층 Q-네 트워크 (Deep Q-Networks)과 같은 모델을 포함할 수 있다. 한편 인식부는 상기한 동작을 수행하기 위해, 타겟 데이터를 획득할 수 있다. 타겟 데이터는 저장부 또는 외부로부터 획득된 것일 수 있다. 타겟 데이터는 신경망 네트워크의 인식 대상이 되는 데이터일 수 있다. 인식 부는 타겟 데이터를 학습된 신경망 네트워크에 적용하기 전에, 획득된 타겟 데이터에 대하여 전처리 작업을 수 행하거나, 또는 복수 개의 타겟 데이터들 중에서 인식에 이용될 데이터를 선별할 수 있다. 일 예로, 인식부는 타겟 데이터를 기 설정된 포맷으로 가공하거나, 필터링 하거나, 또는 노이즈를 추가/제거하여 인식에 적절한 데 이터의 형태로 가공할 수 있다. 인식부는 전처리된 타겟 데이터를 신경망 네트워크에 적용함으로써, 신경망 네트워크로부터 출력되는 출력값을 획득할 수 있다. 인식부는 출력값과 함께, 확률값 또는 신뢰도값을 획득할 수 있다. 일 예로, 본 발명에 따른 전자장치의 제어방법은 컴퓨터 프로그램 제품 (Computer Program Product)에 포 함되어 제공될 수 있다. 컴퓨터 프로그램 제품은, 앞서 설명한, 프로세서에 의해 실행되는 소프트웨어의 명령어들을 포함할 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨 터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예컨대, CD-ROM)의 형태로 배포되거나, 또는 어플리케이션 스토어(예컨대, 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예컨대, 스마트폰들) 간에 직접, 온라인 으로 배포(예컨대, 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저 장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 도 4는 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따르면, 프로세서는 복수의 공간 중에서 전자장치(100가 제1공간에 위치함을 식별 할 수 있다(S410). 이 때, 제1공간, 제2공간 등과 같이 서수를 포함하는 용어는 하나의 구성요소를 다른 구성요 소로부터 구별하는 목적으로만 사용되며, 앞선 도 2에서 설명한 제1공간, 제2공간에 항상 대응하는 것은 아니다. 이 때, 프로세서는 전자장치가 위치한 공간에 관한 정보를 획득하고, 획득된 정보 및 복수의 공간에 대응하여 설정된 참조정보에 기초하여 전자장치가 위치한 공간을 식별할 수 있다. 프로세서는 디스플 레이부나 사용자입력부 등을 통해 전자장치가 위치한 공간에 관한 정보를 나타내는 사용자입력 을 수신하거나, 앞서 언급한 이미지센싱, GPS, 신호 세기, 무선주파수(RF; Radio Frequency), 적외선(IR; Infrared), 마이크로폰 등 다양한 방법으로 전자장치가 위치한 공간에 관한 정보를 획득할 수 있다. 이 때, 프로세서는 복수의 공간에 대응하여 설정된 참조정보에 기초하여 전자장치가 위치한 공간을 식별할 수 있는데, 참조정보란 상기 기술들을 이용하여 공간에 대해 미리 마련된 정보를 의미할 수 있다. 따라 서, 프로세서는 전자장치가 위치한 공간에 관한 정보를 획득하고, 이를 기 마련된 참조정보와 비교하 여 현재 전자장치가 위치한 공간을 식별할 수 있다. 예컨대, 이미지 센싱의 경우, 전자장치는 전자장치의 일 부분에 내장된 카메라, 전자장치 와 연결된 외장카메라를 이용할 수 있다. 프로세서는 카메라를 통해 전자장치 주변을 촬상하도록 제 어하고, 촬상된 이미지를 분석하여, 복수의 공간 중에서 전자장치가 위치한 공간을 식별할 수 있다. 보다 상세하게는, 각 공간에 위치한 가구나 외부장치 등을 참조정보로써 미리 설정하고, 촬상된 이미지에서 나타나는 가구나 외부장치 등을 참조정보와 비교하여 전자장치가 위치한 공간을 식별할 수 있다. 또는, 각 공간에서 가구배치나 벽지 색 등은 고정되어 있을 가능성이 높으므로, 공간 별로 미리 사진을 촬상하여 각 공간이 어디인 지를 지정하는 사용자입력을 수신할 수 있다. 따라서, 프로세서는 카메라를 이용하여 이미지를 촬상 하고, 촬상된 이미지를 기 촬상되어 저장된 이미지와 비교하여 현재 위치한 공간이 어디인지 식별할 수 있다. 또는, 프로세서는 촬상된 이미지에 나타나는 가구나 외부장치의 종류에 따라, 전자장치가 위치한 공 간을 식별할 수 있다. 예컨대, 프로세서는 촬상된 이미지에서 냉장고, 싱크대 등이 식별되는 경우 부엌이 라고 판단할 수 있고, TV, 소파 등이 식별되는 경우 거실이라고 판단할 수 있다. 프로세서는 전자장치의 위치를 확인하기 위하여, 예컨대, GPS (Global Positioning System)를 이용 할 수 있다. 이 경우, 각 공간의 GPS 좌표를 참조정보로서 등록하고, GPS 정보를 감지하여 현재 전자장치 가 위치한 공간을 식별할 수 있다. 다른 예로서, 프로세서는 와이파이(Wi-Fi) 공유기와 같은 AP(Access Point)를 이용할 수 있다. 예컨대, 프 로세서는 AP로 수신되는 Wi-Fi 신호 세기 정보를 각 공간마다 참조정보로서 등록하고, 수신되는 신호의 세 기에 기초하여 전자장치의 위치를 식별할 수 있다. 또는, 프로세서는 디스플레이에 참조정보를 설정할 수 있는 그래픽 유저 인터페이스(GUI; Graphic User Interface)를 표시하도록 제어하고, 표시된 GUI에서 참조정보를 설정하는 사용자입력을 수신하고, 수신한 사용자입력에 기초하여 참조정보를 설정할 수 있다. 전자장치가 위치하는 공간을 식별하는 다른 예로서, 프로세서는 전자장치의 주변에 존재하는 외 부장치의 위치가 식별되는 경우, 외부장치의 위치에 기초하여 전자장치가 존재하는 위치를 식별할 수 있다. 이를 구현하는 방법에는 다음과 같이 다양한 기술이 존재한다. 무선주파수의 경우, 프로세서는 센서를 통해 외부장치로부터 발생하는 신호를 감지하여, 감지된 신호 의 세기를 기준으로 외부장치와 전자장치 간의 거리 및 방향을 추정하여, 외부장치의 위치를 식별할 수 있 다. 프로세서는 참조정보에 기초하여 식별된 외부장치와 대응하는 위치 관계를 가지는 외부장치가 존재하 는 공간을 식별함으로써 전자장치가 위치한 공간을 식별할 수 있다. 이하, 설명하는 다른 기술의 경우에도, 외부장치의 위치를 식별함으로써 전자장치가 위치한 공간을 식별하는 것은 동일하게 적용될 수 있다. 적외선의 경우, 프로세서는 센서를 통해 방출된 적외선이 전자장치 주변에 위치한 외부장치에 반사되어 되돌아오는 양을 감지하여 외부장치와 전자장치 간의 거리 및 방향에 기초하여, 외부장치의 위치 를 식별할 수 있다. 마이크로폰을 통해 획득한 소리를 이용하는 경우, 소리가 발생한 방향을 추정하는 방법 중 하나로, 예컨대, 소리가 특정영역에 도달하는 시간의 차이를 통해 음원의 위치를 식별할 수 있다. 외부장치로부터 소리 가 발생하는 경우, 발생한 소리가 전자장치의 어느 두 지점에 각각 도달하는 시간은 차이가 존재하고, 프 로세서는 소리의 속도와 각 지점에 도달하는데 걸리는 시간을 이용하여 외부장치로부터 전자장치까지 의 거리를 추정하여 외부장치의 위치를 식별할 수 있다. 또한, 프로세서는 블루투스 모듈의 BLE 신호를 이용하는 경우, 예컨대, 전자장치 주변의 외부장치로 부터 어드버타이징 패킷(Undirected advertising packet)을 수신하는 경우, 패킷의 RSSI(Received Signal Strength Indicator) 값을 통해 전자장치와 해당 외부장치와의 거리를 판단하고, 이로부터 외부장치의 위 치를 식별할 수 있다. 프로세서는 복수의 컨텐츠 중에서 제1공간에 대응하는 적어도 하나의 제1컨텐츠를 포함하는 제1컨텐츠 그 룹의 영상을 디스플레이에 표시할 수 있다(S420). 프로세서는 전자장치가 제1공간에서 제2공간으로 이동함을 식별할 수 있다(S430). 앞서 설명한 바와 같이, 전자장치는 사용자가 손쉽게 이동이 가능한 크기로 제작되거나, 전자장치를 이동 가능하도록 구현된 장치, 예컨대, 바퀴가 달린 받침대 등이 장착되어 이동될 수 있다. 프로세서는 전자장치가 위치한 공간을 식별하는데 이용한 기술이나 참조정보를 이용하여 전자장치 의 이동거리를 식별할 수 있다. 예컨대, 프로세서는 일정 주기 등 기 정의된 기준에 기초하여 새로이 이미지 센싱을 하거나, GPS 정보를 감지하여 전자장치가 이동하는지 여부를 식별할 수 있다. 프로세서 는 Wi-Fi 공유기로부터 수신되는 신호의 세기가 변화하는 것에 기초하여 전자장치가 이동하는 것을 감지할 수 있고, 이동 후 전자장치의 위치를 식별할 수 있다. 또는, 프로세서는 전자장치의 이동 거리를 식별하고, 식별된 이동 거리에 기초하여 전자장치가 위치한 공간이 이동된 것을 식별할 수 있다. 프로세서는 식별된 제2공간에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 디 스플레이에 표시할 수 있다(S440). 본 발명의 일 실시예에 따르면, 전자장치가 위치한 공간에 따라 사용자가 자주 이용하거나, 이용가능성이 높은 컨텐츠 그룹을 표시함으로써 사용자의 전자장치 이용편의성을 높여줄 수 있고, 더욱이 전자장치가 위 치한 공간의 변화 또한 감지하여 유동적으로 컨텐츠 그룹을 제공할 수 있다. 도 5는 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 프로세서는 전자장치가 이동하는 것을 식별할 수 있다(S510). 전자장치가 이동함에 따라, 전자 장치가 위치한 공간이 변화하는 경우, 앞서 도 4에서 설명한 바와 같이 프로세서는 공간별로 다른 컨 텐츠 그룹을 제공(혹은 공간별로 다른 컨텐츠 그룹의 영상을 디스플레이에 표시)할 수 있다(S520). 프로세서 는 전자장치가 이동하기 전 공간에서 제공된 컨텐츠 그룹을 유지할 것인지 여부를 식별할 수 있다 (S530). 예컨대, 프로세서는 그래픽 유저 인터페이스 등으로 컨텐츠 그룹을 유지할 것인지에 대한 사용자 입력을 수신하거나, 사용이력 등에 기초하여 이를 판단할 수 있으며, 어느 하나에 한정되는 것은 아니다. 프로 세서는 컨텐츠 그룹을 유지하는 것으로 식별된 경우(S530의 Yes), 공간이 이동하더라도 컨텐츠 그룹을 변 경하지 않고 유지할 수 있다(S540). 프로세서는 컨텐츠 그룹을 유지하지 않는 것으로 식별된 경우(S530의 No), 공간에 따라 다른 컨텐츠 그룹을 제공하도록 컨텐츠 그룹을 변경할 수 있다(S550). 다만, 이하 실시예에서 는, 공간에 따라 다른 컨텐츠 그룹을 제공하는 것으로 가정하고 서술한다.본 발명에서는, 전자장치의 주변 상황이, 전자장치의 위치 변화와 함께 또는 별개로 사용자에 의해서 도 변동될 수 있다. 예컨대, 전자장치가 어느 한 공간에 위치해 있고, 전자장치를 사용하는 사용자가 변경되는 경우 또는 전자장치가 복수의 공간에 각각 존재하고, 사용자가 공간을 이동하는 경우 등 다양하 게 존재할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서는 공간과 사용자를 모두 고려하거나, 적어도 하나를 고려하여 그에 대응하는 컨텐츠 그룹을 제공할 수 있으며, 어느 하나에 한정되는 것은 아니다. 사용자의 변동에 관하여는 도 7 내지 도 9에서 상세히 설명한다. 도 6은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 본 도면에서는 전자장치가 위치한 공간이 변화된 경우, 프로세서가 이를 감지하거나, 공간의 변화에 대한 사용자입력을 수신하여 변 화된 공간에 대응하는 컨텐츠 그룹을 제공하는 것을 도시한다. 도 6에 도시된 바에 따르면, 전자장치는 제1공간인 부엌에 위치하고, 프로세서는 부엌에 대응하는 적 어도 하나의 컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을 표시하고 있다. 프로세서는 전자장치 가 제1공간에서 제2공간인 거실로 이동하는 것을 감지할 수 있다. 이 때, 프로세서는 앞서 도 4에서 설명한 기술을 이용하여 공간의 변화를 식별할 수 있다. 프로세서는 현재 전자장치가 위치한 장소가 어디인지 디스플레이에 복수의 공간 중 어느 하나를 선택 할 수 있는 그래픽 유저 인터페이스를 표시하도록 제어하고, 표시된 그래픽 유저 인터페이스를 이용 하여 전자장치가 위치한 공간을 선택하는 사용자입력을 수신할 수 있다. 프로세서는 수신한 사용자입 력에 기초하여 전자장치가 위치한 공간을 식별할 수 있다. 따라서, 프로세서는 전자장치가 이동 한 공간이 거실이라는 사용자입력을 수신한 경우, 거실에 대응하는 적어도 하나의 컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 제공할 수 있다. 또는, 프로세서는 전자장치가 이동한 공간이 침실이라는 사용자 입력을 수신한 경우, 침실에 대응하는 적어도 하나의 컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 프로세서가 정확히 이동한 공간이 어떤 공간인지 인식하기 어려운 경우 혹 은 인식하였더라도, 사용자입력을 통해 이를 명확히 할 수 있어 적절한 서비스를 제공할 수 있다. 또한, 프로세서는 제1공간에서 제2공간인 거실로 이동하는 것을 감지한 경우, 공간이 이동 중이라는 화면을 디스플레이에 표시할 수 있다. 프로세서는 거실로 공간이 이동됨을 식별한 것에 기초하여, 거 실에 대응하는 적어도 하나의 컨텐츠를 포함하는 제2컨텐츠 그룹의 영상을 제공할 수 있다. 이 때, 프로세서는 공간이 이동 중이라는 화면과 함께 공간 이동을 취소할 수 있는 취소아이콘을 표 시할 수 있다. 프로세서는 공간 이동을 취소하는 사용자입력을 수신한 경우, 전자장치의 공간 이동 감지가 잘못 인식되거나, 거실이 아닌 다른 공간으로 이동한 것으로 판단하고, 기존 부엌에 대응하는 적어도 하 나의 컨텐츠를 포함하는 제1컨텐츠 그룹의 영상을 제공할 수 있다. 이와 별개로, 본 발명의 다른 실시예에 따르면, 프로세서는 전자장치가 이동한 것은 감지되었으나, 공간 이동을 취소하는 사용자입력을 수신한 것에 기초하여, 이동된 공간을 잘못 식별한 것으로 인식하고, 이동 된 공간이 어디인지 선택할 수 있는 그래픽 유저 인터페이스를 다시 제공할 수 있다. 도 7 내지 도 9는 본 발명의 일 실시예에 따른 사용자별 컨텐츠 그룹을 제공하는 전자장치의 동작 흐름도를 도 시한 도면이다. 도 7의 경우, 전자장치의 개수 및 사용자의 수에 따라 컨텐츠 그룹을 제공하는 양상을 나타낸다. 전자장치 의 개수가 1대인 경우(S710의 1개), 프로세서는 복수의 사용자 중 전자장치를 이용하는 사용자 를 식별하고, 식별된 사용자에 대응하는 컨텐츠 그룹을 식별할 수 있다(S720). 즉, 전자장치는 사용자 별 컨텐츠 그룹을 제공할 수 있다. 전자장치가 2대 이상인 경우(S710의 2-N개), 사용자의 수에 따라 컨텐츠 그룹 제공의 양상이 달라질 수 있 다. 사용자가 1명인 경우(S730의 1명), 프로세서는 사용자가 이동함에 따라 각 공간별 전자장치가 온 /오프될 수 있으며, 다른 공간에 위치한 전자장치간의 설정과 연동할 수 있다(S740). 예컨대, 부엌과 거실 에 전자장치가 각각 설치되고, 부엌에서 전자장치를 이용하던 사용자가 거실로 이동하는 경우, 프로 세서는 거실에 위치한 전자장치는 부엌에 위치한 전자장치가 제공하고 있던 컨텐츠 그룹을 연동 하여 표시할 수 있다. 사용자가 2명이상인 경우(S730의 2-N명), 복수의 전자장치는 사용자 별로 설정된 컨텐츠 그룹을 변경하여 제공할 수 있다(S750). 즉, 프로세서는 복수의 사용자 중 전자장치를 이용하는 사용자를 식별하고, 식별된 사용자에 대응하는 컨텐츠 그룹을 식별할 수 있다. 도 8의 경우, 프로세서는 사용자가 공간 별로 이용할 컨텐츠 그룹을 미리 설정해 두었는지 식별할 수 있다 (S810). 프로세서는 공간 별 컨텐츠 그룹을 설정하는 사용자입력이나 정보를 수신하지 않은 경우(S810의 No), 전자장치가 위치한 공간을 식별하여 기본(Default)으로 제공되는 컨텐츠 그룹을 제공할 수 있다 (S820). 수신한 경우(S810의 Yes), 프로세서는 사용자가 설정해 둔 컨텐츠 그룹을 제공할 수 있다(S830). 도 9의 경우, 프로세서는 전자장치를 이용하는 사용자의 연령층을 식별하여(S910), 사용자가 아이인 경우(S910의 아이), 제공되는 컨텐츠 등의 연령대를 제한하는 등 키즈 모드(Kids Mode)를 적용할 수 있고 (S920), 사용자가 성인인 경우(S910의 성인), 기본으로 제공되는 컨텐츠 그룹을 제공할 수 있다(S930). 프로세 서는 사용자의 연령층을 식별하는 방법으로, 사용자 정보를 로그인 등을 통해 수집하거나, 이미지 센싱으 로 촬상된 이미지와 구축된 데이터를 비교하여 나이를 추정하는 등 다양한 방법을 이용할 수 있다. 도 7 내지 9의 경우, 공간에 기초한 상황 외에도 사용자 변동여부, 사용자 이동여부, 사용자 연령층 등 다양한 요소를 추가적으로 고려하여 전자장치가 상황에 더욱 적합한 컨텐츠 그룹을 제공할 수 있다. 도 10은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 프로세서는 복수의 공간 별로 기 정의된 컨텐츠 그룹의 우선순위에 기초하여 식별된 공간에 대응하는 컨텐츠 그룹을 식별할 수 있다. 우 선순위는 사용자가 해당 공간에서 선호하는 컨텐츠나 위젯 등을 지정하는 사용자입력을 수신하여 정하거나, 해 당 공간에서 다수 회 사용한 이력이나 최근 사용한 어플리케이션 등 사용이력에 기초하여 정할 수 있는 등 어느 하나에 한정되는 것은 아니다. 예컨대, 부엌의 경우, 프로세서는 외부장치들을 무선으로 제어할 수 있는 IoT 어플리케이션, 사용자 이력 에 기초하여 요리할 때 자주 사용하는 알람(타이머), 요리나 식사를 하면서 영상을 시청할 수 있도록 스트리밍 서비스를 제공하는 어플리케이션 순으로 컨텐츠 그룹을 화면에 나타나는 바와 같이 제공할 수 있다. 그리 고, 전자장치가 침실로 이동된 것으로 식별되는 경우, 기 정의된 컨텐츠 그룹의 우선순위에 기초하여, 프 로세서는 화면과 같이 컨텐츠 그룹의 순서를 알람, 스트리밍 서비스, IoT 순으로 재배열할 수 있다. 이 때, 프로세서는 화면과 같이 세 가지 중 가장 중요한 위젯인 알람 위젯의 크기를 크게 하여 사용 자의 이용에 편의성을 높여줄 수 있다. 이 외에도, 어플리케이션, 위젯 등을 추가, 삭제하는 등 다양하게 적용 될 수 있다. 프로세서는 식별된 공간의 주변 환경을 식별하고, 식별된 주변 환경에 기초하여 식별된 컨텐츠의 영상을 표시하도록 디스플레이를 제어할 수 있다. 예컨대, 프로세서는 부엌에서 전자장치의 화면을 선명한(vivid) 톤으로 표시하고, 침실로 이동 시 화면을 차분한(calm) 톤으로 변경할 수 있다. 이와 관련 하여서는 도 11에서 보다 상세하게 서술한다. 프로세서는 식별된 주변 환경에 기초하여, 공간에 마련된 외부장치의 설정을 변경하는 그래픽 유저 인터페 이스를 제공하도록 디스플레이를 제어할 수 있다. 예컨대, 기본으로 제공되는 화면이 도시되어 있고, 프 로세서는 전자장치가 화면(1031, 1032, 1033)과 같이 부엌인 경우 냉장고, 침실인 경우 무드등, 거실 인 경우 TV를 제어할 수 있는 IoT 어플리케이션을 디스플레이에 표시할 수 있다. 이 외에도 각 공간 별로 기 정 의된 컨텐츠 그룹의 우선순위에 기초하여 식별된 공간에 대응하는 컨텐츠 그룹을 재구성할 수 있다. 본 발명의 일 실시예에 따르면, 공간적 상황과 사용자의 상황을 함께 고려하고, 이를 반영하여 컨텐츠 그룹을 다양하게 재구성할 수 있으므로, 더욱 유용한 서비스를 제공할 수 있다. 도 11은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 프로세서는 식별된 공간의 주변 환경을 식별하고, 식별된 주변 환경에 기초하여 배경화면을 표시하도록 디스플레이부를 제어할 수 있 다. 예컨대, 프로세서는 카메라 또는 연결된 외장카메라를 통해 주변 환경을 촬상하여 획득한 이미지 를 이용하여, 이미지를 구성하는 대표적인 색상을 추출할 수 있다. 프로세서는 추출한 색상을 이용하여 배경화면을 화면과 같이 설정할 수 있다. 또는, 프로세서는 각 공간별 특성을 파악하고 태그를 이용하여 분류하고, 배경화면을 태그에 대응하는 색 상, 무늬, 이미지 등을 배경화면으로 변경해줄 수 있다. 예컨대, 침실의 경우, #Calm, #Comfortable, #Serene와 같은 태그로 분류될 수 있고, 그에 걸맞는 톤이나 무늬 등을 가지는 배경화면을 설정할 수 있다. 따라서, 도 10 의 화면(1010, 1011)과 같이, 공간이 이동되는 경우, 선명한(Vivid) 톤에서 차분한(Calm) 톤으로 변경할 수 있다. 본 발명의 일 실시예에 따르면, 컨텐츠나 위젯 뿐만 아니라 배경화면까지 전자장치의 주변 상황과 조화롭게 나 타낼 수 있으므로, 심미감을 높여줄 수 있다. 도 12는 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 프로세서는 전자장치(10 0)의 사용이력을 식별하고, 식별된 전자장치의 사용이력에 기초하여 식별된 공간에 대응하는 컨텐츠를 식 별할 수 있다. 도 12에 도시된 바에 따르면, 전자장치가 위치한 공간의 모습(1210, 1220, 1230)과 그에 대 응하는 전자장치의 화면이 도시되어 있다. 공간은 조명장치가 연결되어 있는 상태이고, 프로세서 는 조명장치를 제어할 수 있는 위젯을 화면에 표시할 수 있다. 이 때, 공간과 같이 조명장치가 꺼지 거나, 연결이 해제되는 등의 경우, 프로세서는 화면에서 조명장치의 위젯을 없애거나 축소하는 등 재구성 할 수 있다. 이후, 공간과 같이 조명장치가 다시 연결되는 경우, 프로세서는 조명장치를 제어할 수 있는 위젯을 화면에 표시할 수 있고, 연결된 조명장치가 이전에 연결된 이력이 있는 경우, 위젯을 클릭하게 되 면, 이전 기기의 설정 내용을 불러올 수 있다. 본 발명의 일 실시예에 따르면, 전자장치와 연결되는 외부장치를 제어할 수 있고, 이전 설정 이력까지 참 조할 수 있으므로 사용자 편의성을 높여줄 수 있다. 도 13은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 프로세서는 복수의 공간 중 전자장치가 위치한 것으로 식별된 제1공간에 기초하여 복수의 컨텐츠 중 제1공간에 대응하는 제1컨텐츠 의 영상을 표시하고, 제1컨텐츠의 영상 표시 중 전자장치가 제2공간에 위치하는 것으로 식별하면, 제1컨텐 츠 및 식별된 제2공간에 대응하는 제2컨텐츠의 영상이 표시되도록 디스플레이를 제어할 수 있다. 예컨대, 제1공간인 거실에서 사용자가 전자장치를 이용해 영상을 시청하고 있다고 가정해본다. 사용 자가 영상을 시청하는 도중, 전자장치를 들고 제2공간인 침실로 이동하게 되면, 프로세서는 전 자장치가 제1공간에서 제2공간으로 이동됨을 식별할 수 있다. 프로세서는 공간 이동에 따라 제2공간 에 대응하는 적어도 하나의 제2컨텐츠를 포함하는 제2컨텐츠 그룹을 디스플레이에 표시할 수 있고, 이 경우 제1공간에서 재생 중이던 영상을 함께 표시할 수 있다. 따라서, 경우에 따라 프로세서는 영 상을 계속 시청하기 위해 전체화면으로 전환하거나, 영상 시청을 중단하고 제2컨텐츠 그룹 중 하나를 선 택하는 사용자입력을 수신할 수 있다. 본 발명의 일 실시예에 따르면, 사용자가 전자장치를 이용하면서 공간을 이동하는 경우에도 적절한 컨텐츠 그룹 을 제공받을 수 있어 사용자의 편의성을 높여줄 수 있다. 도 14는 본 발명의 일 실시예에 따른 전자장치와 사용자 간의 위치를 도시한 도면이고, 도 15는 전자장치 및 사 용자간의 위치 관계에 기초하여 식별된 컨텐츠 그룹의 영상을 표시한 모습을 도시한 도면이다. 도 14에 따르면, 공간 내 전자장치, 사용자, 외부장치가 도시되어 있다. 프로세서는 공간 내 전자장치와 사용자 간의 위치 관계를 식별하고, 식별된 전자장치 및 사용자 간의 위 치 관계에 기초하여 식별된 컨텐츠의 영상을 표시하도록 디스플레이를 제어할 수 있다. 보다 상세하게는, 프로세서는 전자장치와 사용자 간의 거리에 기초하여 식별된 컨텐츠의 영상을 표시하도록 디스 플레이를 제어할 수 있다. 예컨대, 사용자가 전자장치와 기 정의된 거리보다 가까이 있는 경우, 프로세서는 도 15의 화면 과 같이 공간에 대응하는 컨텐츠 그룹을 표시할 수 있다. 도 15의 화면의 컨텐츠 그룹은 시 계 위젯과 건강상태를 나타내는 위젯을 포함한다. 그리고, 사용자가 외부장치 쪽으로 이동하여 전 자장치와 멀어지는 경우, 프로세서는 시계 위젯과 건강상태를 나타내는 위젯을 함께 표시하던 화면 에서 각 위젯을 전체화면으로 표시하고, 화면과 같이 화면을 전환하면서 하나씩 표시할 수 있다. 따라서, 프로세서는 사용자가 전자장치와 멀어지더라도 정보를 한눈에 확인할 수 있도록 전체 화면으로 전환시키면서 부가정보를 추가로 표시할 수 있다. 화면에서 각 위젯의 크기를 크게 표시하고, 보다 자세한 내용을 표시할 수 있다. 예컨대, 화면에서는 시계 위젯은 오로지 현재 시각만 표시하고 있었 던 반면, 화면에서는 날짜와, 나라, 초 단위 시간까지 추가로 표시할 수 있다. 또한, 건강상태를 나타나 는 위젯의 경우 화면에서는 총 수면시간과 수면 상태를 표시하고 있었던 반면, 화면에서는 어제 취 침시간을 추가로 표시할 수 있다. 이외에도, 프로세서는 이미지 센싱 등을 통해 사용자의 모습이 화면에 나타나지 않거나, 사용자의 시선이 전자장치를 주시하지 않는 경우 등을 식별하는 경우, 화면과 같이 전환할 수 있다. 나아가, 사용자가 해당 공간이 아닌, 다른 공간에 위치한 전자장치에서 감지되거나, 사용자가 해당 공간에서 감지되지 않는 경우, 프로세서는 절전모드(standby Mode)로 진입하여 화면을 표시하 고, 해당 상태가 지속되면 프로세서는 화면의 전원을 끌 수 있다. 본 발명의 일 실시예에 따르면, 전자장치는 사용자의 상태나 같은 공간 내에서의 위치, 전자장치를 사용하고자 하는 의도가 존재하는지 여부 등을 식별하고, 경우에 따라 전자장치의 동작을 제어하여 전력소 모를 줄이거나, 전자장치를 효율적으로 동작할 수 있다."}
{"patent_id": "10-2020-0072804", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 전자장치를 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 3은 본 발명의 일 실시예에 의한 전자장치의 구성을 도시한 블록도이다. 도 4는 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 5는 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 6은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 7은 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 8은 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 9는 본 발명의 일 실시예에 따른 전자장치의 동작 흐름도를 도시한 도면이다. 도 10은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 11은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 12는 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 13은 본 발명의 일 실시예에 따른 전자장치의 동작 모습을 도시한 도면이다. 도 14는 본 발명의 일 실시예에 따른 전자장치와 사용자 간의 위치를 도시한 도면이다. 도 15는 전자장치 및 사용자간의 위치 관계에 기초하여 식별된 컨텐츠 그룹의 영상을 표시한 모습을 도시한 도 면이다."}
