{"patent_id": "10-2021-0062579", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0037938", "출원번호": "10-2021-0062579", "발명의 명칭": "DMD를 구비한 3차원 이미지 장치 및 그 동작 방법", "출원인": "문명일", "발명자": "문명일"}}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "일정 파장의 변조된 광을 조사하며, 레이저 다이오드(LD, Laser Diode)를 포함하는 발광부;복수의 가로 셀과 복수의 세로 셀을 포함하는 2차원 어레이 구조로서 각 셀의 개별 어드레싱이 가능하며, 상기발광부에서 조사되는 레이저 광을 미리 설정된 순서에 따라 반사하는 DMD(Digital Micromirror Device);상기 DMD를 통해 반사되어 들어오는 동상(in phase) 및 역상(out of phase)의 광 신호를 검출하는 광검출기; 및상기 발광부, 상기 DMD 및 상기 광검출기와 연동하며, 수신되는 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하고, 상기 분석한 결과에 따라 DMD 컨트롤러를 통해 상기 DMD의 2차원 어레이 구조의 복수의 셀로 이루어진 영역별로 켜짐(On) 또는 꺼짐(Off) 상태로 스위칭되도록 제어하는 제어프로세서;를 포함하는 DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제어프로세서는,상기 광 신호에 3차원 이미지 프로세싱을 적용해 3차원 이미지 프로세싱을 통해 타겟을 분석하여 사람, 차선 또는 자동차 이미지를 판별하는 DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 제어프로세서는,상기 광 신호에 인공지능 알고리즘을 통한 3차원 이미지 프로세싱을 적용해 타겟을 분석하여 사람, 차선 또는자동차 이미지를 판별하는 DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 제어프로세서는,상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하여, DMD 컨트롤러를 제어하여 사람, 차선 또는자동차 이미지를 구성하는 복수의 셀로 이루어진 영역을 켜짐(On) 상태로, 사람, 차선 또는 자동차 이미지를 구성하는 복수의 셀로 이루어진 상기 영역 이외의 영역을 꺼짐(Off) 상태로 스위칭되도록 제어하는 DMD를 구비한3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 발광부, 상기 DMD 및 상기 광검출기와 연동하며 수신되는 상기 광 신호에 기초하여 3차원 이미지 프로세싱을 통해 타겟을 분석하고, 분석 결과로서 상기 타겟과의 거리를 측정하고 상기 타겟의 깊이지도를 생성하는 제어프로세서를 포함하는, DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 타겟과 마주하는 상기 DMD 전면 상에 배치되는 렌즈; 및공개특허 10-2022-0037938-3-상기 렌즈가 설치되는 일측 윈도우를 구비하고, 상기 발광부, 상기 DMD, 상기 광검출기, 및 상기 제어프로세서를 수용하는 하우징;을 더 포함하고,상기 발광부와 상기 광검출기는 서로 인접하게 배치되어 동일 마이크로미러에 대하여 광을 조사하거나 반사되는광을 수신하는, DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 제어프로세서는,상기 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 제1 모듈; 및상기 디지털 패턴에 기초하여 상기 타겟에 대한 거리 측정 및 깊이 지도를 계산하는 제2 모듈;을 구비하는, DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,상기 발광부는,레이저 다이오드(LD)를 포함하는 제1 발광부; 및레이저 다이오드(LD)를 포함하는 제2 발광부;를 포함하고,상기 광검출기는,상기 제1 발광부 또는 상기 제2 발광부 중에서 어느 하나로부터의 조사되어 상기 DMD에 반사되는 광 신호를 검출하는, DMD를 구비한 3차원 이미지 장치."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "레이저 다이오드(LD, Laser Diode)를 포함하는 발광부에서 변조된 광을 DMD(Digital Micromirror Device)로 조사하는 단계;상기 DMD에서 어레이 형태로 배열된 복수의 마이크로미러를 제어하는 단계;상기 DMD의 각 마이크로미러에서 반사되는 광 신호를 광 검출기에서 수신하는 단계;제어프로세서가 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하고, 상기 분석한 결과에 따라DMD 컨트롤러를 통해 상기 DMD의 2차원 어레이 구조의 복수의 셀로 이루어진 영역별로 켜짐(On) 또는 꺼짐(Off)상태로 스위칭되도록 제어하는 단계; 및상기 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 단계;를 포함하는 DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 제어하는 단계는,상기 제어프로세서가 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하여 사람, 차선 또는 자동차이미지를 판별하는 DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서,상기 제어하는 단계는,상기 제어프로세서가 상기 광 신호에 인공지능 알고리즘을 통한 3차원 이미지 프로세싱을 적용해 타겟을 분석하공개특허 10-2022-0037938-4-여 사람, 차선 또는 자동차 이미지를 판별하는 DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서,상기 제어하는 단계는,상기 제어프로세서가 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하여, DMD 컨트롤러를 제어하여 사람, 차선 또는 자동차 이미지를 구성하는 복수의 셀로 이루어진 영역을 켜짐(On) 상태로, 사람, 차선 또는자동차 이미지를 구성하는 복수의 셀로 이루어진 상기 영역 이외의 영역을 꺼짐(Off) 상태로 스위칭되도록 제어하는 DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 10에 있어서,상기 제어하는 단계는, 상기 발광부에서 조사되는 광이 외부의 타겟을 향하여 나가고 상기 타겟에서 반사되어되돌아오는 광이 상기 광 검출기를 향하여 들어가도록 미리 설정된 시간동안 특정 마이크로미러의 움직임 혹은위치를 제어하는,DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서,상기 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 단계; 및상기 디지털 패턴에 기초하여 상기 타겟에 대한 거리 측정 및 깊이 지도를 계산하는 단계;를 더 포함하는, DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 9에 있어서,상기 조사하는 단계는,복수개의 상기 발광부에서 광을 상기 DMD로 조사하고,상기 수신하는 단계는,복수개의 상기 발광부 중에서 어느 하나로부터의 조사되어 상기 DMD에 반사되는 광 신호를 상기 광 검출기가 수신하는 DMD를 구비한 3차원 이미지 장치의 동작 방법."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 DMD를 구비한 3차원 이미지 장치에 관한 것으로, 일정 파장의 변조된 광을 조사하며 레이저 다이오드 (LD, Laser Diode)를 포함하는 발광부; 복수의 가로 셀과 복수의 세로 셀을 포함하는 2차원 어레이 구조로서 각 셀의 개별 어드레싱이 가능하며, 상기 발광부에서 조사되는 레이저 광을 미리 설정된 순서에 따라 반사하는 DMD(Digital Micromirror Device); 상기 DMD를 통해 반사되어 들어오는 동상(in phase) 및 역상(out of phase) 의 광 신호를 검출하는 광검출기; 및 상기 발광부, 상기 DMD 및 상기 광검출기와 연동하며, 수신되는 상기 광 신 호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하고, 상기 분석한 결과에 따라 DMD 컨트롤러를 통해 상기 DMD 의 2차원 어레이 구조의 복수의 셀로 이루어진 영역별로 켜짐(On) 또는 꺼짐(Off) 상태로 스위칭되도록 제어하는 제어프로세서;를 포함하여 구성된다."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 3차원 이미지 장치에 관한 것으로서, 보다 상세하게는 디지털 마이크로미러 디바이스(digital micromirror device, DMD)를 이용하여 타겟 분석과 거리를 측정하는 3차원 이미지 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "광학 센서 중의 하나인 TOF 근접 거리 센서는 펄스가 방사된 기준 시점과 타겟으로부터 반사되어 되돌아오는 펄 스의 검출시점 사이의 시간차를 측정하여 거리와 깊이를 측정한다. TOF 근접 거리 센서는 레이저, 발광다이오드 (LED) 등의 이미터와 같은 변조된 광원과 단일 고속 포토다이오드 등의 수신기로 구성되며, TOF(Time-of- Flight)는 비행시간을 나타내는 것으로, 빛을 쏘아서 반사되어 오는 시간을 측정하여 거리를 계산하는 데 이용 된다. 이러한 TOF 센서는 수 m에서 수백 km의 원거리 영역에서도 거리 모호성(distance ambiguity) 없이 거리를 측정 할 수 있다는 장점이 있어 조선 산업, 항공 산업과 같은 거대 제조업 분야에서의 3차원 형상 측정을 비롯하여 토목, 건축, 도시개발에 필요한 지상기반(groundborne) 또는 비행체기반(airborne)의 측지측량(geodetic survey) 분야에 적용되고 있으며 특히 인공위성 레이저 추적 시스템(SLR), 레이저 고도계(laser altimeter) 및 인공위성 간의 거리측정과 같은 우주개발 분야에도 폭넓게 응용되고 있다. 그 중 깊이 지도의 생성을 위해 사용되는 TOF 센서는 빛을 조사하여 되돌아오는 거리를 측정하는 전통적인 TOF 카메라를 사용하는데 이는 깊이 측정을 위한 필수요소이지만 고가인 단점이 있다. 최근 마이크로소프트사에서는 키넥트(Kinect)라는 저가의 보급형 깊이 센서를 출시하여 3차원 영상 취득 장치에 많이 사용되고 있으나, 상기 키넥트 카메라는 원형 패턴을 가지는 구조광을 측정하고자 하는 객체에 투사하고 패턴의 왜곡 정도를 통하여 깊이 정도를 추정하는 것으로서, IR 프로젝터와 IR 카메라의 위치가 달라 발생하는 폐색 영역으로 인한 홀, 객체의 경계면과 IR 프로젝터가 수직일 경우 경계 주변에서의 잡음 등 카메라 내외의 문제점으로 인해 정확한 깊이 정보를 얻을 수 없는 문제점이 있다. 또한, TOF는 LIDAR(Light Detection And Ranging) 또는 LADAR(Laser Detection And Ranging)로 불리는 3차원 영상센서를 이용하여 목표물을 향해 펄스레이저 광를 방출한 후 목표물에 반사되어 돌아오는 빛 에너지를 광 수 신소자를 사용하여 포착하고 포착한 아날로그 신호를 디지털 신호로 변환하고 이를 분석함으로써 목표물까지의 거리나 목표물의 이동속도 등을 산출하는 시스템에도 이용되고 있다. 하지만, 이러한 TOF 근접 거리 센서는 용 량이 큰 회전모터를 통하여 기계적으로 광 송수신 모듈을 회전 구동시켜야 하는 구조적인 단점이 있다. 또한, 상술한 TOF 센서와 관련된 종래기술로서는 대한민국 공개특허공보 제10-2018-0012059(2018.02.05.)호의 라이다 장치 및 거리 측정 방법이 개시되어 있다. 이 종래기술은 레이저 펄스를 대상체에 조사하는 광원, 대상 체로부터 반사된 레이저 펄스를 수광하는 수광부, 광원이 레이저 펄스를 조사할 때 제1 주기파를 형성하고, 수 광부가 레이저 펄스를 수광할 때, 제1 주기파와 동일한 주파수의 제2 주기파를 형성하는 주기파 생성부, 및 주 기파 생성부로부터 생성된 제1 주기파와 제2 주기파의 위상을 서로 비교하는 비교부를 포함하고, 비교부에서 비 교된 위상을 바탕으로 타겟까지의 거리를 도출하는 방식을 개시하나, 이 종래기술 또한 레이저 펄스를 반사하는 단일 혹은 수 개의 미러를 사용하고, 아날로그 신호를 디지털 신호로 변환하므로 광원이나 미러의 회전과 신호 변환을 위한 수단과 과정을 포함하므로 그에 따른 낮은 신회성과 낮은 효율과 짧은 수명 등의 문제를 여전히 갖 고 있다."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 종래기술의 문제점을 해결하기 위해 도출된 것으로, 본 발명의 목적은, 디지털 마이크로미러 디바이스(digital micromirror device, DMD)를 이용하여 회전 광원이나 회전 미러를 생략하고 더욱이 디지털 검 출 신호를 이용하여 원거리 타겟 분석과 거리 측정을 효과적으로 수행할 수 있는 3차원 이미지 장치 및 그 동작 방법을 제공하는데 있다."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 해결하기 위한 본 발명의 일실시예에 따른 DMD를 구비한 3차원 이미지 장치는 일정 파장의 변조된 광을 조사하며, 레이저 다이오드(LD, Laser Diode)를 포함하는 발광부; 복수의 가로 셀과 복수의 세로 셀을 포함하는 2차원 어레이 구조로서 각 셀의 개별 어드레싱이 가능하며, 상기 발광부에서 조사되는 레이저 광 을 미리 설정된 순서에 따라 반사하는 DMD(Digital Micromirror Device); 상기 DMD를 통해 반사되어 들어오는 동상(in phase) 및 역상(out of phase)의 광 신호를 검출하는 광검출기; 및 상기 발광부, 상기 DMD 및 상기 광 검출기와 연동하며, 수신되는 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하고, 상기 분석한 결과에 따라 DMD 컨트롤러를 통해 상기 DMD의 2차원 어레이 구조의 복수의 셀로 이루어진 영역별로 켜짐(On) 또 는 꺼짐(Off) 상태로 스위칭되도록 제어하는 제어프로세서;를 포함하여 구성된다. 본 발명의 다른 일실시예에 따르면, 상기 제어프로세서는 상기 광 신호에 3차원 이미지 프로세싱을 적용해 3차 원 이미지 프로세싱을 통해 타겟을 분석하여 사람, 차선 또는 자동차 이미지를 판별할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제어프로세서는 상기 광 신호에 인공지능 알고리즘을 통한 3차원 이미 지 프로세싱을 적용해 타겟을 분석하여 사람, 차선 또는 자동차 이미지를 판별할 수 있다.본 발명의 다른 일실시예에 따르면, 상기 제어프로세서는 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟 을 분석하여, DMD 컨트롤러를 제어하여 사람, 차선 또는 자동차 이미지를 구성하는 복수의 셀로 이루어진 영역 을 켜짐(On) 상태로, 사람, 차선 또는 자동차 이미지를 구성하는 복수의 셀로 이루어진 상기 영역 이외의 영역 을 꺼짐(Off) 상태로 스위칭되도록 제어할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 발광부, 상기 DMD 및 상기 광검출기와 연동하며 수신되는 상기 광 신 호에 기초하여 3차원 이미지 프로세싱을 통해 타겟을 분석하고, 분석 결과로서 상기 타겟과의 거리를 측정하고 상기 타겟의 깊이지도를 생성하는 제어프로세서를 포함할 수 있다. 본 발명의 일실시예에 따르면, 상기 타겟과 마주하는 상기 DMD 전면 상에 배치되는 렌즈; 및 상기 렌즈가 설치 되는 일측 윈도우를 구비하고, 상기 발광부, 상기 DMD, 상기 광검출기, 및 상기 제어프로세서를 수용하는 하우 징;을 더 포함하고, 상기 발광부와 상기 광검출기는 서로 인접하게 배치되어 동일 마이크로미러에 대하여 광을 조사하거나 반사되는 광을 수신할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제어프로세서는 상기 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 제1 모듈; 및 상기 디지털 패턴에 기초하여 상기 타겟에 대한 거리 측정 및 깊이 지도를 계산하는 제2 모듈;을 구비할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 발광부는, 레이저 다이오드(LD)를 포함하는 제1 발광부; 및 레이저 다 이오드(LD)를 포함하는 제2 발광부;를 포함하고, 상기 광검출기는 상기 제1 발광부 또는 상기 제2 발광부 중에 서 어느 하나로부터의 조사되어 상기 DMD에 반사되는 광 신호를 검출할 수 있다. 본 발명의 일실시예에 따른 DMD를 구비한 3차원 이미지 장치의 동작 방법은 레이저 다이오드(LD, Laser Diode) 를 포함하는 발광부에서 변조된 광을 DMD(Digital Micromirror Device)로 조사하는 단계; 상기 DMD에서 어레이 형태로 배열된 복수의 마이크로미러를 제어하는 단계; 상기 DMD의 각 마이크로미러에서 반사되는 광 신호를 광 검출기에서 수신하는 단계; 제어프로세서가 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하고, 상기 분석한 결과에 따라 DMD 컨트롤러를 통해 상기 DMD의 2차원 어레이 구조의 복수의 셀로 이루어진 영역별로 켜짐(On) 또는 꺼짐(Off) 상태로 스위칭되도록 제어하는 단계; 및 상기 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 단계;를 포함한다. 본 발명의 다른 일실시예에 따르면, 상기 제어하는 단계는 상기 제어프로세서가 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하여 사람, 차선 또는 자동차 이미지를 판별할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제어하는 단계는 상기 제어프로세서가 상기 광 신호에 인공지능 알고 리즘을 통한 3차원 이미지 프로세싱을 적용해 타겟을 분석하여 사람, 차선 또는 자동차 이미지를 판별할 수 있 다. 본 발명의 다른 일실시예에 따르면, 상기 제어하는 단계는 상기 제어프로세서가 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하여, DMD 컨트롤러를 제어하여 사람, 차선 또는 자동차 이미지를 구성하는 복수 의 셀로 이루어진 영역을 켜짐(On) 상태로, 사람, 차선 또는 자동차 이미지를 구성하는 복수의 셀로 이루어진 상기 영역 이외의 영역을 꺼짐(Off) 상태로 스위칭되도록 제어할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 제어하는 단계는, 상기 발광부에서 조사되는 광이 외부의 타겟을 향하 여 나가고 상기 타겟에서 반사되어 되돌아오는 광이 상기 광 검출기를 향하여 들어가도록 미리 설정된 시간동안 특정 마이크로미러의 움직임 혹은 위치를 제어할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 단계; 및 상 기 디지털 패턴에 기초하여 상기 타겟에 대한 거리 측정 및 깊이 지도를 계산하는 단계;를 더 포함할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 조사하는 단계는 복수개의 상기 발광부에서 광을 상기 DMD로 조사하고, 상기 수신하는 단계는 복수개의 상기 발광부 중에서 어느 하나로부터의 조사되어 상기 DMD에 반사되 는 광 신호를 상기 광 검출기가 수신할 수 있다."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 DMD를 구비한 3차원 이미지 장치 및 그 동작 방법에 의하면, 디지털 마이크로미러 디바이스(digital micromirror device, DMD)를 이용하여 회전 광원이나 회전 미러를 생략하고 더욱이 디지털 검출 신호를 이용하 여 원거리 타겟 분석과 거리 측정을 효과적으로 수행할 수 있다.또한, 본 발명에 의하면, 광 신호를 이용해 타겟을 분석한 결과에 따라 DMD의 2차원 어레이 구조의 영역별로 켜 짐(On) 또는 꺼짐(Off) 상태로 스위칭되도록 하여, 보다 정확도 높은 타겟의 판별이 가능하다. 또한, 본 발명에 의하면, DMD의 스캔 속도와 틸트 각 및 On/Off 상태의 속도를 제어하여, DMD의 각 셀당 어드레 싱된 레이저 광의 반사 시간 및 입사 시간의 데이터를 통하여 타겟과의 거리를 측정하고 타겟에 대한 깊이 지도 를 생성함으로써, 용량이 큰 회전모터를 통하여 기계적으로 광 송수신 모듈을 회전 구동시켜야 하는 구조로 설 계되는 기존 기술의 단점을 보완하는 효과를 얻을 수 있다."}
{"patent_id": "10-2021-0062579", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는 바, 특정 실시 예들을 도면에 예시하 고 상세한 설명에서 이를 상세히 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해 되어야 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예들을 상세하게 설명하면 다음과 같다. 도 1은 본 발명의 일실시예에 따른 DMD(digital micromirror device)를 이용하는 3차원 이미지 장치의 구성을 나타내는 블록도이며, 도 2는 도 1의 3차원 이미지 장치에 채용할 수 있는 DMD 모듈에 대한 사시도이고, 도 3은 도 2의 DMD 모듈의 하우징 일부를 제거한 상태를 나타낸 사시도이고, 도 4는 도 1의 3차원 이미지 장치의 작동 원리를 설명하기 위한 도면이다. 도 1을 참조하면, 본 실시예에 따른 3차원 이미지 장치는, DMD 모듈, DMD 컨트롤러(DMD controller: 200), DMD 전압 공급부(DMD voltage supplies), 조명 구동부(illum. driver) 및 제어프로세서(control processor: 300)를 구비한다. 여기서, DMD 컨트롤러는 오실레이터(oscillator)에 의해 공급되는 기준 전 압에 기초하여 제어 신호를 생성할 수 있고, 직류 전원부(DC PWR)로부터 직류 전원을 공급받을 수 있다. DMD 전 압 공급부(DMD voltage supplies)와 조명 구동부(illum. driver)도 직류 전원부(DC PWR)로부터 직류 전원을 공 급받을 수 있다. 제어프로세서는 디지털 패턴 생성부(digital pattern creation)와, 거리 측정 및 깊이 지도 생성부 (distance measurement & depth map calculation)와, 시스템 제어부(system control)를 구비할 수 있다. 제어 프로세서는 I2C, USB 등의 인터페이스(interface)를 통해 DMD 컨트롤러에 제어신호를 전달하여 DMD 컨트롤 러의 동작을 제어할 수 있다. 또한, 제어프로세서는 하드웨어 트리거(hardware trigger)를 통해 DMD 컨트 롤러의 동작을 개시하거나 DMD 컨트롤러 내의 적어도 일부 수단이나 이에 대응하는 구성부를 활성화 시킬 수 있다. 디지털 패턴 생성부는 광검출기에 수신된 신호를 전달받아 디지털 패턴을 생성한다. 거리 측정 및 깊이 지도 생 성부는 디지털 패턴에 기초하여 타겟과의 거리 측정 및 타겟에 대한 깊이 지도를 계산한다. 시스템 제어부는 DMD 모듈, DMD 컨트롤러, DMD 전압 공급부, 조명 구동부, 및 오실레이터의 동작을 제어한다. DMD 전압 공급부는 DMD 모듈 내 DMD에 리셋 전압(VRST), 바이어스 전압(VBIAS), 오프 전압(VOFF) 등 의 제어 전압을 인가하고, DMD 모듈로부터 인에이블(EN) 응답 신호를 수신할 수 있다. 조명 구동부(illum. driver)는 제어프로세서의 제어에 따라 DMD 모듈 내 발광부, 광검출기 등에 구동 전압을 공급할 수 있다. DMD 컨트롤러는 DMD 모듈 내 DMD의 동작을 제어한다. DMD 모듈은 발광부, DMD, 광검출기, 렌즈 및 하우징을 포함한다. 발광부는 레이저 다이오드(LD, Laser Diode)를 포함하며, 예를 들어 905 내지 940nm에서 파동의 공간적 퍼 짐이 균일하고, 위상이 규칙성을 가지고 있는 레이저 광을 발광하는 레이저 다이오드를 포함할 수 있다. DMD는 디지털 마이크로미러 디바이스(Digital Micromirror Device)의 일종으로서, 표면상에 직사각형의 미 러들(mirrors)이 어레이 형태로 배열되어 복수의 가로 셀과 복수의 세로 셀로 이루어진 2차원 어레이 구조를 형 성하도록 이루어진다. 본 실시예에서, DMD는 가로 1024, 세로 768의 해상도를 지원하나, 해상도는 실시예에 따라 달라질 수 있으며 조절이 가능할 수 있다. DMD의 각각의 셀은 개별적으로 일정 기울기를 가지고 틸트 회동하여 켜짐(On) 또는 꺼짐(Off) 상태로 스위 칭될 수 있다. 틸트 각은 발광부의 조사광의 방출각과 광검출기로의 수신각에 따라 임의로 조정될 수 있다. DMD를 이용하면, 한 셀이 켜짐(On) 상태에서는 발광부에서 조사되는 레이저 광을 목표물(target)에 반 사하고, 목표물에서 수신되는 빛을 광검출기로 반사할 수 있다. 본 실시예의 DMD에 사용되는 마이크로미러는 단일(Single) 미러 또는 이중(Dual) 구조의 미러일 수 있 다. DMD의 각 셀은 각각 개별적으로 어드레싱 가능하게 대응할 수 있으며, 이는 DMD의 각 셀에서 반사 되고 수신되는 레이저 광의 정보를 데이터 처리하는데 이용될 수 있다. 발광부에서 조사된 레이저 광은 DMD의 특정 셀의 마이크로미러에 조사되고, 해당 마이크로미러(3 1)는 동작 상태 혹은 경사각에 따라 광을 반사하며, DMD는 셀 단위로 1 포인트(Point)씩 순차적으로 스캔되 듯이 반사 동작하게 되고, 그에 의해 렌즈를 통하여 광이 목표물(target)에 조사되거나 목표물로부터 반사 된 광을 수신할 수 있게 된다. 즉, 렌즈를 통과하여 DMD에 광이 입사되면, DMD는 수신된 광을 다시 각 셀 단위로 역으로 반사하여 광검출기에 제공할 수 있다. 전술한 스캔 방식은 DMD의 각 셀이 수평 라인으로 순차적으로 수평으로 진행되어 한 줄씩 아래로 내려가면 서 각 셀이 동작되는 순차주사(progressive scanning) 방식 또는 DMD 셀을 홀수와 짝수 가로줄로 나뉜 것을 번갈아가며 표시하는 비월 주사 방식(interlaced scanning)을 사용할 수 있다. 광검출기는 반도체 전자 장치의 광전 효과를 전력으로 변환하는 고감도 애벌런치 포토다이오드(APD, Avalanche photodiode), SiPM(Silicon Photomultiplier), SPAD(Single Photon Avalanche Diode)이나, 포토 셀 (photocell), 전하 결합 소자(CCD)와 같은 이미징 센서 및 유사한 포토다이오드 디바이스를 포함할 수 있다. 또한, 광검출기는 한 개 이상의 어레이 형태로 배열될 수 있으며, 광검출기들의 어레이는 시간에 따라 반사된 레이저 광 신호들을 통합하여 오차를 보정하거나 회절 및 산란 값을 보정할 수 있다. 일례로, 광검출기 는 목표물에서 반사되어 DMD의 각 셀과 역으로 동기화되어 입사되는 레이저 광을 검출하고, 검출된 레 이저 광을 제어프로세서에 전달할 수 있다. 이때 검출된 레이저 광은 변조된 디지털 형태의 신호일 수 있 다. 한편, 광검출기에서 나오는 신호가 아날로그 형태인 경우, 아날로그-디지털 컨버터(ADC, Analog to Digital Converter)에 의해서 디지털 신호로 변환할 수 있다. 제어프로세서에 입력된 광 신호는 제어프로세서의 3D 이미지 프로세싱을 통한 타겟 분석에 의해 목표 물과의 거리 측정과 목표물에 대한 깊이지도를 산출하는데 이용될 수 있다. 이러한 제어프로세서는 DMD 모 듈을 제어하고 3D 이미지 프로세싱을 지원할 수 있다. 제어프로세서의 시스템 제어부는 본 발명의 DMD 모듈를 이용하는 3차원 이미지 장치의 특정 하드웨어 나 구성 장치의 드라이버를 제어하기 위한 구동 프로그램 또는 구동 모듈을 포함할 수 있다. 또한, 시스템 제어부는 DMD 컨트롤러와 연동하여 DMD의 스캔 속도와 틸트 및 On/Off 상태의 속도를 제 어하며, 각 셀당 어드레싱된 레이저 광의 반사 시간 및 입사 시간에 따른 데이터를 수신할 수 있다. DMD 컨트롤러는 DMD를 직접 제어하기 위한 구동 디바이스로서, DMD의 구동 드라이버를 제어하고 환경설정(Configuration)을 세팅할 수 있다.제어프로세서는 발광부와 연동하고 이를 제어하여 레이저 광의 출력 상태를 제어하고, 광검출기에 서 검출된 광 신호를 입력으로 수신할 수 있으며, 이와 같이 수신한 광 신호에 상응하도록 DMD 컨트롤러를 통해 DMD를 제어할 수 있다. 상기 제어프로세서는 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하고, 상기 분석한 결과에 따 라 상기 DMD의 2차원 어레이 구조의 복수의 셀로 이루어진 영역별로 켜짐(On) 또는 꺼짐(Off) 상태로 스위 칭되도록 제어할 수 있다. 보다 구체적으로, 상기 제어프로세서는 상기 광 신호에 기초하여 3차원 이미지 프로세싱을 통해 타겟을 분 석하여 사람, 차선 또는 자동차 이미지를 판별할 수 있으며, 이때 인공지능 알고리즘을 통한 3차원 이미지 프로 세싱을 통해 타겟을 분석하여 사람, 차선 또는 자동차 이미지를 판별할 수 있다. 또한, 상기 제어프로세서는 상기 광 신호에 3차원 이미지 프로세싱을 적용해 타겟을 분석하여, DMD 컨트롤 러를 제어하여 사람, 차선 또는 자동차 이미지를 구성하는 복수의 셀로 이루어진 영역별로 켜짐(On) 또는 꺼짐(Off) 상태로 스위칭되도록 제어할 수 있다. 이와 같이 본 발명에 따르면 제어프로세서에서 광 신호를 이용해 타겟을 분석한 결과에 따라 DMD의 2차원 어레이 구조의 영역별로 켜짐(On) 또는 꺼짐(Off) 상태로 스위칭되도록 하여, 보다 정확도 높은 타겟의 판별이 가능하다. 거리 측정 및 깊이 지도 생성부는 DMD에 의해 조사되고, 목표물에서 반사되어 돌아오는 레이저 광에 대하여 DMD 각각의 셀에서 동기화된 데이터와 비교하여 목표물 이미지의 패턴을 분석하여 3D 이미지를 추출하고, 레이저 광이 발사된 기준 시점과 대상 목표물에서 반사되어 되돌아온 레이저 광의 검출시점 사이의 시간차를 비행시간 거리측정 방법으로 측정하고, 이에 기초한 목표물과의 거리를 측정하고 목표물에 대한 깊이 지도를 계산할 수 있다. 또한 제어프로세서는 레이저 광이 발사된 기준 시점과 대상 목표물에서 반사되어 되돌아온 레이저 광의 검 출시점 사이의 시간차와 광 신호 레벨에 근거하여 목표물까지의 거리 측정(distance measurement)에 대한 오차 를 보정하는 기능을 수행할 수 있다. 이를 위하여 제어프로세서는 메모리를 포함할 수 있으며, 메모리에는 레이저 광이 DMD에서 어드레싱된 각 셀에서 스캔되어 반사될 때의 시간 정보 및 목표물에서 반사되어 역으로 스캔될 시의 시간 정보들을 기록할 수 있다. 한편, 본 실시예에서 발광부와 광검출기는 서로 인접하게 배치되어 하나의 마이크로미러의 한 타임 의 온 동작 혹은 활성화된 동작 시간 동안에 광을 조사하거나 반사되는 광을 수신할 수 있다. 이를 위해 발광부 와 광검출기는 단일 하드웨어 모듈 구조로 일체로 형성될 수 있다. 예컨대, 발광부와 광검출기 는 단일 인쇄회로기판 상에 배치될 수 있다. 광검출기는 DMD를 통해 반사되어 들어오는 동상(in phase) 및 역상(out of phase)의 광 신호를 검출하는 적어도 두 개의 검출기 어레이 쌍을 구비할 수 있다. 또 한편으로, 전술한 광검출기의 위치는 발광부에 인접하게 배치되는 것이 바람직하나, 구현에 따라서 하우징 내 다양한 위치에 배치될 수 있다. 그 경우, 조사광을 반사한 마이크로미러는 단위 동작 시간에 2개 의 경사각을 순차적으로 갖도록 위치/틸트 제어될 수 있다. 전술한 3차원 이미지 장치의 작동 원리를 나타내면, 도 4에 도시한 바와 같다. 먼저, 제어프로세서의 제어신호가 조명 구동부에 인가되면, 전원 공급 상태인 조명 구동부는 발광부를 제 어하여 DMD에 광을 조사한다. 이와 동시에 제어프로세서의 제어신호가 3D 영상처리부(3D image processing)에 인가되면, 3D 영상 처리부는 DMD 컨트롤러와 시스템 제어 데이터(system control data)를 송수신하여 DMD 컨트롤러가 DMD을 제어할 수 있도록 동작한다. DMD 컨트롤러는 3D 영상 처리부로 부터의 시스템 제어 데이터에 기초하여 DMD을 제어하고, 그에 의해 DMD는 발광부의 조사광을 특정 마이크로미러에서 반사하여 타겟으로 전달하고, 타겟에서 돌아오는 반사광을 반사하여 광검출기에 전달 할 수 있다. 다음, 광검출기에서 검출된 신호들은 직접 혹은 아날로그 디지털 컨버터(ADC)를 통해 3D 영상처리부에 입력 되고, 3D 영상처리부는 입력되는 신호를 처리하여 타켓과의 거리를 측정하거나 타겟에 대한 깊이 지도를 계산하 고, 타겟에 대한 분석 결과를 출력할 수 있다. 이때, 3D 영상처리부는 광검출기에 수신된 신호를 받아 디지 털 패턴을 생성하고, 디지털 패턴에 기초하여 타겟에 대한 거리 측정 및 깊이 지도를 계산할 수 있다. 전술한 3D 영상처리부는 광 검출기에 수신된 신호를 받아 디지털 패턴을 생성하는 제1 모듈, 및 상기 디지털 패턴에 기초하여 상기 타겟에 대한 거리 측정 및 깊이 지도를 계산하는 제2 모듈을 포함할 수 있다. 제1 모듈은 디 지털 패턴 생성부에 대응하고, 제2 모듈은 거리 측정 및 깊이 지도 생성부에 대응할 수 있다. 한편, 전술한 실시예에 따른 3차원 이미지 장치는 발광부와 광검출기를 인접하게 배치하거나 단일 모듈 형태로 구성하는 것을 중심으로 설명하였지만, 본 발명은 그러한 구성으로 한정되지 않고, 빔스플리터 등을 사 용하여 광검출기를 하우징 내 임의의 위치에 배치하도록 구현될 수 있다. 도 5는 본 발명의 다른 실시예에 따른 3차원 이미지 장치의 작동 원리를 설명하기 위한 도면이다. 도 5를 참조하면, 본 실시예에 따른 3차원 이미지 장치는 레이저 다이오드(LD) 등으로 이루어지는 발광부와, DMD와, 애벌런치 포토다이오드(avalanche photodiode, APD) 등으로 이루어지는 광검출기 와, 빔스플리터(beam splitter, 80)와, 아날로그 디지털 컨버터(ADC)와, 조명 구동부(illum. driver)와, 전원 공급부(power supply)와, 3D 영상처리부(3D image processing)와, DMD 컨트롤러(DMD controller: 200)와, DMD 전압 공급부(DMD voltage supplies) 등을 포함할 수 있다. 특히, 본 실시예에 따른 3차원 이미지 장치는 빔스플리터를 통해 발광부의 광을 투과하여 DMD에 전달하 고, DMD으로부터의 광을 반사하여 광검출기에 전달하도록 이루어질 수 있다. 그 경우, 광검출기는 DMD 모듈의 하우징 내 임의 위치에 배치될 수 있어, 장치의 구조나 형태 등에 대한 설계 자유도를 높 일 수 있는 장점이 있다. 도 6은 본 발명의 다른 실시예에 따른 3차원 이미지 장치의 작동 원리를 설명하기 위한 도면이다. 도 6을 참조하면, 본 실시예에 따른 3차원 이미지 장치는 레이저 다이오드(LD)로 이루어지는 발광부(10, 15)와, DMD와, 애벌런치 포토다이오드(avalanche photodiode, APD) 등으로 이루어지는 광검출기와, 아날로그 디지털 컨버터(ADC)와, 조명 구동부(illum. driver)와, 전원 공급부(power supply)와, 3D 영상처리부(3D image processing)와, DMD 컨트롤러(DMD controller: 200)와, DMD 전압 공급부(DMD voltage supplies) 등을 포함할 수 있다. 이때, 상기 발광부는 레이저 다이오드(LD)를 포함하는 제1 발광부 및 레이저 다이오드(LD)를 포함하는 제2 발광부로 구성될 수 있다. 따라서, 제어프로세서의 제어신호가 조명 구동부에 인가되면, 전원 공급 상태인 조명 구동부는 제1,2 발광 부(10, 15)를 제어하여 DMD에 광을 조사하고, 상기 광검출기는 상기 제1 발광부 및 상기 제2 발광 부로부터의 조사되어 상기 DMD에 반사되는 광 신호를 검출할 수 있다. 즉, 도 6의 실시예에서는 복수개의 발광부(10, 15)를 사용하여 DMD에 반사되어 타겟으로 조사되는 광의 범 위를 확장함으로써, 보다 넓은 범위의 타겟의 분석이 가능하도록 할 수 있다.상기에서는 본 발명의 바람직한 실 시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 청구범위에 기재된 본 발명의 사상 및 영역 으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2021-0062579", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 DMD(digital micromirror device)를 이용하는 3차원 이미지 장치의 구성을 나타내는 블록도이며, 도 2는 도 1의 3차원 이미지 장치에 채용할 수 있는 DMD 모듈에 대한 사시도이고, 도 3은 도 2의 DMD 모듈의 하우징 일부를 제거한 상태를 나타낸 사시도이고, 도 4는 도 1의 3차원 이미지 장치의 작동 원리를 설명하기 위한 도면이다. 도 5는 본 발명의 다른 실시예에 따른 3차원 이미지 장치의 작동 원리를 설명하기 위한 도면이다. 도 6은 본 발명의 다른 실시예에 따른 3차원 이미지 장치의 작동 원리를 설명하기 위한 도면이다."}
