{"patent_id": "10-2023-0090253", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0010262", "출원번호": "10-2023-0090253", "발명의 명칭": "학습 모델을 이용하여 태양광 발전량을 산출하기 위한 장치 및 그 방법", "출원인": "한국에너지기술연구원", "발명자": "오명찬"}}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다수의 건물에 대한 미리 정해진 통계 정보를 수집하고, 상기 수집된 통계 정보를 기초로 학습용 빅데이터를 구축하는 데이터 구축부;상기 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시키는 모델 학습부; 및대상 지역에 대한 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량 및 태양광 발전량을산출하는 발전량 산출부를 포함하는, 태양광 발전량 산출 장치."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 발전량 산출부는,상기 학습용 빅데이터로부터 상기 대상 지역의 건물에 대한 통계 정보를 추출하고,상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량을 산출하고,상기 산출된 일사량을 이용하여 상기 대상 지역에 대한 태양광 발전량을 산출하는, 태양광 발전량 산출 장치."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 발전량 산출부는,상기 대상 지역을 미리 정해진 크기를 갖는 다수의 격자로 구획하고,상기 학습용 빅데이터로부터 상기 구획된 격자에 대한 통계 정보를 추출하여 상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 구획된 격자에 대한 일사량을 산출하고,상기 다수의 격자마다 산출된 일사량을 기초로 상기 대상 지역에 대한 태양광 발전량을 산출하는, 태양광 발전량 산출 장치."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 모델 학습부는,상기 구축된 학습용 빅데이터를 기초로 미리 정해진 크기를 갖는 격자에 대한 통계 정보와 일사량의 관계를 상기 학습 모델을 학습시키는, 태양광 발전량 산출 장치."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 대상 지역을 구획한 다수의 격자의 크기는 모두 동일한, 태양광 발전량 산출 장치."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 통계 정보는,건물 밀도, 건물 비율, 평균 건물 높이, 건물 높이 편차, 평균 건물 거리를 포함하는, 태양광 발전량 산출장치.공개특허 10-2025-0010262-3-청구항 7 다수의 건물에 대한 미리 정해진 통계 정보를 수집하고, 상기 수집된 통계 정보를 기초로 학습용 빅데이터를 구축하는 단계;상기 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시키는 단계; 및대상 지역에 대한 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량 및 태양광 발전량을산출하는 단계를 포함하는, 태양광 발전량 산출 방법."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 산출하는 단계는,상기 학습용 빅데이터로부터 상기 대상 지역의 건물에 대한 통계 정보를 추출하고,상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량을 산출하고,상기 산출된 일사량을 이용하여 상기 대상 지역에 대한 태양광 발전량을 산출하는, 태양광 발전량 산출 방법."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 산출하는 단계는,상기 대상 지역을 미리 정해진 크기를 갖는 다수의 격자로 구획하고,상기 학습용 빅데이터로부터 상기 구획된 격자에 대한 통계 정보를 추출하여 상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 구획된 격자에 대한 일사량을 산출하고,상기 다수의 격자마다 산출된 일사량을 기초로 상기 대상 지역에 대한 태양광 발전량을 산출하는, 태양광 발전량 산출 방법."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 학습시키는 단계는,상기 구축된 학습용 빅데이터를 기초로 미리 정해진 크기를 갖는 격자에 대한 통계 정보와 일사량의 관계를 상기 학습 모델을 학습시키는, 태양광 발전량 산출 방법."}
{"patent_id": "10-2023-0090253", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 대상 지역을 구획한 다수의 격자의 크기는 모두 동일한, 태양광 발전량 산출 방법."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예에 의한 태양광 발전량을 산출하기 위한 장치 및 그 방법이 개시된다. 상기 태양광 발전량 산출 장치는 다 수의 건물에 대한 미리 정해진 통계 정보를 수집하고, 상기 수집된 통계 정보를 기초로 학습용 빅데이터를 구축 하는 데이터 구축부; 상기 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시키는 모델 학습부; 및 대상 지역에 대한 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량 및 태양광 발전량을 산출하 는 발전량 산출부를 포함한다."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "실시예는 학습 모델을 이용하여 태양광 발전량을 산출하기 위한 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어, 기후협약변화, 이상기온현상 등 세계적으로 환경에 대한 문제가 심각하게 대두되면서 대체에너지 이 용에 관한 기술개발과 상용화가 다양하게 이루어지고 있다. 대체 에너지 중에서 태양 에너지는 무공해, 환경 친 화적 에너지로 각광받고 있으며, 선진국을 중심으로 설치 용량이 급속하게 증가되고 있는 추세에 있다. 태양광의 발전량은 일사량(solar radiation) 및 온도와 같은 기상 환경, 태양광 패널 설치 장소의 위치, 태양광 패널의 지향 각도 등에 영향을 받는다. 따라서, 태양광 패널을 설치할 때, 태양광 발전량에 영향을 주는 정보들 을 획득하는 기술 및 획득된 정보에 기초하여 태양광 발전량에 대한 예측을 수행하는 기술이 필요하다."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예는 학습 모델을 이용하여 태양광 발전량을 산출하기 위한 장치 및 그 방법을 제공한다. 실시예에서 해결하고자 하는 과제는 이에 한정되는 것은 아니며, 아래에서 설명하는"}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이나 실시 형태로부터 파악될 수 있는 목적이나 효과도 포함된다고 할 것이다."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "과제의 해결 수단 실시예에 따른 태양광 발전량 산출 장치는 다수의 건물에 대한 미리 정해진 통계 정보를 수집하고, 상기 수집된 통계 정보를 기초로 학습용 빅데이터를 구축하는 데이터 구축부; 상기 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시키는 모델 학습부; 및 대상 지역에 대한 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량 및 태양광 발전량을 산출하는 발전량 산출부를 포함할 수 있다. 상기 발전량 산출부는 상기 학습용 빅데이터로부터 상기 대상 지역의 건물에 대한 통계 정보를 추출하고, 상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량을 산출하고, 상기 산출된 일사량 을 이용하여 상기 대상 지역에 대한 태양광 발전량을 산출할 수 있다. 상기 발전량 산출부는 상기 대상 지역을 미리 정해진 크기를 갖는 다수의 격자로 구획하고, 상기 학습용 빅데이 터로부터 상기 구획된 격자에 대한 통계 정보를 추출하여 상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 구획된 격자에 대한 일사량을 산출하고, 상기 다수의 격자마다 산출된 일사량을 기초로 상기 대상 지역에 대한 태양광 발전량을 산출할 수 있다. 상기 모델 학습부는 상기 구축된 학습용 빅데이터를 기초로 미리 정해진 크기를 갖는 격자에 대한 통계 정보와 일사량의 관계를 상기 학습 모델을 학습시킬 수 있다. 상기 대상 지역을 구획한 다수의 격자의 크기는 모두 동일하다. 상기 통계 정보는 건물 밀도, 건물 비율, 평균 건물 높이, 건물 높이 편차, 평균 건물 거리를 포함할 수 있다. 실시예에 따른 태양광 발전량 산출 방법은 다수의 건물에 대한 미리 정해진 통계 정보를 수집하고, 상기 수집된 통계 정보를 기초로 학습용 빅데이터를 구축하는 단계; 상기 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시키는 단계; 및 대상 지역에 대한 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일 사량 및 태양광 발전량을 산출하는 단계를 포함할 수 있다. 상기 산출하는 단계는 상기 학습용 빅데이터로부터 상기 대상 지역의 건물에 대한 통계 정보를 추출하고, 상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 대상 지역에 대한 일사량을 산출하고, 상기 산출된 일사량 을 이용하여 상기 대상 지역에 대한 태양광 발전량을 산출할 수 있다. 상기 산출하는 단계는 상기 대상 지역을 미리 정해진 크기를 갖는 다수의 격자로 구획하고, 상기 학습용 빅데이 터로부터 상기 구획된 격자에 대한 통계 정보를 추출하여 상기 추출된 통계 정보를 상기 학습 모델에 입력하여 상기 구획된 격자에 대한 일사량을 산출하고, 상기 다수의 격자마다 산출된 일사량을 기초로 상기 대상 지역에 대한 태양광 발전량을 산출할 수 있다. 상기 학습시키는 단계는 상기 구축된 학습용 빅데이터를 기초로 미리 정해진 크기를 갖는 격자에 대한 통계 정 보와 일사량의 관계를 상기 학습 모델을 학습시킬 수 있다."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따르면, 대상 지역의 건물에 대한 통계 정보를 미리 학습시킨 학습 모델에 입력하여 대상 지역에 대한 일사량을 산출하되, 대상 지역을 다수의 격자로 구획하고 구획된 다수의 격자마다 일사량을 산출하여 산출된 일 사량을 기초로 대상 지역에 대한 태양광 발전량을 산출하도록 함으로써, 다양한 건물의 통계적 특성을 바탕으로 대상 지역의 일사량 및 태양광 발전량 산출이 가능할 수 있다. 본 발명의 다양하면서도 유익한 장점과 효과는 상술한 내용에 한정되지 않으며, 본 발명의 구체적인 실시형태를 설명하는 과정에서 보다 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 기술 사상은 설명되는 일부 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 기술 사상 범위 내에서라면, 실시 예들간 그 구성 요소들 중 하나 이상을 선택적으로 결합, 치환하여 사용할 수 있다. 또한, 본 발명의 실시예에서 사용되는 용어(기술 및 과학적 용어를 포함)는, 명백하게 특별히 정의되어 기술되"}
{"patent_id": "10-2023-0090253", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지 않는 한, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 일반적으로 이해될 수 있는 의미로 해 석될 수 있으며, 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥상의 의미를 고려 하여 그 의미를 해석할 수 있을 것이다. 또한, 본 발명의 실시예에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함할 수 있고, “A 및(와) B, C 중 적 어도 하나(또는 한 개 이상)”로 기재되는 경우 A, B, C로 조합할 수 있는 모든 조합 중 하나 이상을 포함할 수 있다. 또한, 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제1, 제2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등으로 한정되지 않는다. 그리고, 어떤 구성 요소가 다른 구성요소에 ‘연결’, ‘결합’ 또는 ‘접속’된다고 기재된 경우, 그 구성 요 소는 그 다른 구성 요소에 직접적으로 연결, 결합 또는 접속되는 경우뿐만 아니라, 그 구성 요소와 그 다른 구 성 요소 사이에 있는 또 다른 구성 요소로 인해 ‘연결’, ‘결합’ 또는 ‘접속’ 되는 경우도 포함할 수 있다. 또한, 각 구성 요소의 “상(위) 또는 하(아래)”에 형성 또는 배치되는 것으로 기재되는 경우, 상(위) 또는 하 (아래)는 두 개의 구성 요소들이 서로 직접 접촉되는 경우뿐만 아니라 하나 이상의 또 다른 구성 요소가 두 개 의 구성 요소들 사이에 형성 또는 배치되는 경우도 포함한다. 또한, “상(위) 또는 하(아래)”으로 표현되는 경 우 하나의 구성 요소를 기준으로 위쪽 방향뿐만 아니라 아래쪽 방향의 의미도 포함할 수 있다. 실시예에서는, 도심지 내 건물의 통계적 특성을 바탕으로 일사량과 태양광 발전량을 산출하고자 하는 것으로, 대상 지역의 건물에 대한 통계 정보를 미리 학습시킨 학습 모델에 입력하여 대상 지역에 대한 일사량을 산출하 되, 대상 지역을 다수의 격자로 구획하고 구획된 다수의 격자마다 일사량을 산출하여 산출된 일사량을 기초로 대상 지역에 대한 태양광 발전량을 산출하도록 한 새로운 방안을 제안한다. 도 1은 본 발명의 실시예에 따른 태양광 발전량을 산출하기 위한 장치를 나타내는 도면이다. 도 1을 참조하면, 본 발명의 실시예에 따른 태양광 발전량을 산출하기 위한 장치는 정보 수집부, 데이터 구축부, 모델 학습부, 지역 선정부, 제1 산출부, 제2 산출부를 포함할 수 있다. 정보 수집부는 다수의 건물에 대한 미리 정해진 통계 정보를 수집할 수 있다. 여기서 건물에 대한 통계 정 보는 건물 밀도, 건물 비율, 평균 높이, 높이 편차, 평균 거리 등을 포함할 수 있지만 반드시 이에 한정되지 않고 다양한 정보가 포함될 수 있다. 이러한 정보들은 예컨대, 각 건물이 날짜와 시간에 따라 주변에 위치하는 건 물들에 의해 그림자로 덮여지는 음영 부분을 도출하는데 이용될 수 있다. 이때, 건물에 대한 통계 정보는 외부 기기로부터 직접 입력받는 정보이거나 네트워크를 통해 연결된 외부 기기 로부터 입력받는 정보일 수 있지만 반드시 이에 한정되지 않는다. 데이터 구축부는 수집된 통계 정보를 기초로 학습용 빅데이터를 구축할 수 있다. 모델 학습부는 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시킬 수 있다. 여기서 학습 모델은 하나의 모델로 구현되어 대상 지역에 대한 통계 정보를 입력받아 대상 지역에 대한 일사량을 출력할 수 있다. 이때, 학습 모델은 하나로 구현되는 것에 한정되지 않고 다수의 모델로 구현될 수 있다. 예컨대, 학습 모델은 인공지능 모델, 머신 러닝 모델, 딥 러닝 모델을 포괄하는 개념일 수 있다. 지역 선정부는 태양광 발전량을 산출하고자 하는 대상 지역을 선정할 수 있다. 예컨대, 지역 선정부 는 사용자로부터 소정 크기의 대상 지역을 선정 받을 수 있다. 제1 산출부는 대상 지역이 선정되면 데이터 구축부로부터 선정된 대상 지역의 건물에 대한 통계 정보 를 추출하고, 추출된 통계 정보를 학습 모델에 입력하여 일사량을 산출할 수 있다. 제2 산출부는 산출된 일사량을 기초로 태양광 발전량을 출력할 수 있다. 이렇게 산출된 대상 지역에 대한 일사량과 태양광 발전량은 화면에 출력될 수 있다. 도 2는 본 발명의 실시예에 따른 태양광 발전량을 산출하기 위한 방법을 나타내는 도면이고, 도 3 내지 도 6은 실시예에 따른 일사량 산출 원리를 설명하기 위한 도면들이다. 도 2를 참조하면, 본 발명의 실시예에 따른 태양광 발전량을 산출하기 위한 장치(이하 산출 장치라고 한다)는 다수의 건물에 대한 미리 정해진 통계 정보를 수집하고(S100), 수집된 통계 정보를 기초로 학습용 빅데이터를 구축할 수 있다(S200). 이때, 실시예에서는 지형 및 건물에 대한 정보를 이용하지 않고 지형에 대한 정보를 제외하고 건물에 대한 정보 만을 이용하여 학습용 빅데이터를 구축하고자 한다. 따라서 실시예에서는 도 3과 같이 건물을 추출하여 수치 건 물 모형(Digital Buiding Model; DBM)인 학습용 빅데이터를 구축할 수 있다. 다음으로, 산출 장치는 구축된 학습용 빅데이터를 기초로 학습 모델을 미리 학습시킬 수 있다(S300). 이때, 학 습 모델의 입력 변수는 건물에 대한 통계 정보일 수 있고, 인공 지능 모델의 출력 변수는 일사량 및 태양광 발 전량일 수 있다. 다음으로, 산출 장치는 대상 지역이 지정되면, 지정된 대상 지역에 대한 통계 정보를 추출하고, 추출된 통계 정 보를 미리 학습시킨 학습 모델에 입력하여 그 결과로 대상 지역에 대한 일사량을 산출할 수 있다(S400). 구체적으로, 실시예에서는 대상 지역을 다수의 격자로 구획하고 구획된 격자마다 일사량을 산출하고자 한다. 예 컨대, 산출 장치는 대상 지역이 선정되면, 도 4 내지 도 5와 같이 선정된 대상 지역을 미리 정해진 크기를 갖는 다수의 격자로 구획할 수 있다. 여기서 격자의 크기는 필요에 따라 다양하게 변경되고, 모든 격자의 크기는 서 로 동일할 수 있다. 그리고나서 산출 장치는 구획된 다수의 격자마다 해당 격자의 건물에 대한 통계 정보를 추출하고, 추출된 통계 정보를 기초로 해당 격자에 대한 일사량을 산출할 수 있다. 예컨대, 산출 장치는 도 6과 같이 대상 구역 내 각 격자에 포함된 건물에 대한 통계 정보를 미리 구축된 학습용 빅데이터로부터 추출하고, 추출된 통계 정보를 이 용하여 해당 격자에 대한 일사량을 산출할 수 있다. 여기서 제시하는 도면은 본원 발명의 일 예를 설명하고 있 을 뿐 반드시 이에 한정되지 않는다. 여기서, 일사량은 건물의 옥상 및 벽면에 대한 일사량을 모두 포함할 수 있다. 다음으로, 산출 장치는 다수의 격자마다 산출된 일사량을 기초로 대상 지역에 대한 태양광 발전량을 산출할 수 있다. 도 7a 내지 도 7f는 건물의 통계 정보와 일사량의 관계를 보여주는 도면들이다. 도 7a 내지 도 7c를 참조하면, 건물 밀도와 전체 일사량의 관계, 평균 높이와 전체 일사량의 관계, 측면 방향 최빈값과 전체 일사량의 관계를 보여주고 있다. 건물 밀도가 높아지거나, 평균 높이가 높아지거나 측면 방향 최빈값이 높아지는 경우 전체 일사량이 낮아짐을 알 수 있다. 도 7d 내지 도 7f를 참조하면, 건물 밀도와 평균 일사량의 관계, 평균 높이와 평균 일사량의 관계, 측면 방향 최빈값과 평균 일사량의 관계를 보여주고 있다. 건물 밀도가 높아지거나, 평균 높이가 높아지거나 측면 방향 최 빈값이 높아지는 경우 평균 일사량이 낮아짐을 알 수 있다. 이러한 건물 통계 정보와 일사량의 관계 학습을 통해 일사량 산출이 가능할 수 있다. 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field-programmable gate array) 또는 ASIC과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드 웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2023-0090253", "section": "도면", "subsection": "도면설명", "item": 1, "content": "실시예에 따르면, 대상 지역의 건물에 대한 통계 정보를 미리 학습시킨 학습 모델에 입력하여 대상 지역에 대한 일사량을 산출하되, 대상 지역을 다수의 격자로 구획하고 구획된 다수의 격자마다 일사량을 산출하여 산출된 일 사량을 기초로 대상 지역에 대한 태양광 발전량을 산출하도록 함으로써, 다양한 건물의 통계적 특성을 바탕으로 대상 지역의 일사량 및 태양광 발전량 산출이 가능할 수 있다. 본 발명의 다양하면서도 유익한 장점과 효과는 상술한 내용에 한정되지 않으며, 본 발명의 구체적인 실시형태를 설명하는 과정에서 보다 쉽게 이해될 수 있을 것이다."}
