{"patent_id": "10-2023-0152907", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038112", "출원번호": "10-2023-0152907", "발명의 명칭": "안테나를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김재형"}}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에 있어서,상기 무선 통신 회로가 상기 측면 부재의 상기 제1 부분에 급전함에 따라 상기 제1 부분의 가장자리 및 상기 도전성 부분의 가장자리에는 상기 전기적 경로가 형성되고,상기 제1 부분의 상기 가장자리 및 상기 도전성 부분의 상기 가장자리는 전자기적으로 연결되도록 이격되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 홈의 제1 단(end)과 인접한 상기 측면 부재의 일 부분에서부터 상기 제1 단으로부터 상기 홈의 제2 단을향하는 방향으로 연장되는 제1 돌출부; 및상기 제1 돌출부와 상기 사이드 키의 상기 제1 도전성 연결 부재 사이에 배치되는 제2 도전성 연결 부재를 더포함하고,상기 무선 통신 회로는 상기 제1 도전성 연결 부재, 상기 제2 도전성 연결 부재 및 상기 제1 돌출부를 통해 상기 측면 부재의 상기 제1 부분에 급전하도록 설정되고,상기 제2 도전성 연결 부재는 C-클립(C-clip) 또는 도전성 가스켓 중 적어도 하나인, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 홈의 상기 제2 단과 인접한 상기 측면 부재의 일 부분에서부터 상기 제2 단으로부터 상기 제1 단을 향하는방향으로 연장되는 제2 돌출부;상기 제2 돌출부와 상기 사이드 키의 상기 제1 도전성 연결 부재 사이에 배치되는 제3 도전성 연결 부재; 및상기 제1 도전성 연결 부재 및 상기 제3 도전성 연결 부재를 통해 상기 제2 돌출부와 전기적으로 연결된 스위치회로를 더 포함하고,상기 제3 도전성 연결 부재는 C-클립 또는 도전성 가스켓 중 적어도 하나인, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 스위치 회로는 상기 무선 통신 회로가 배치된 인쇄 회로 기판에 포함된 그라운드와 전기적으로 연결되고공개특허 10-2025-0038112-3-적어도 하나의 럼프드 엘리먼트를 포함하고,상기 스위치 회로는 상기 적어도 하나의 럼프드 엘리먼트를 이용하여 상기 전기적 경로의 길이를 변경함으로써상기 지정된 주파수 대역을 조절하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,상기 무선 통신 회로는 상기 제1 도전성 연결 부재를 통해 상기 스위치 회로를 제어하기 위한 제어 신호를 송신하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 제1 도전성 연결 부재는 상기 제1 부분에 급전하기 위한 제1 도전성 경로(conductive path) 및 상기 사이드 키로부터 송신되는 신호를 전달하기 위한 제2 도전성 경로를 포함하고,상기 제1 도전성 연결 부재는 상기 제1 도전성 경로가 노출된 영역을 포함하고,상기 영역 상에서 상기 제1 도전성 경로는 상기 제2 도전성 연결 부재와 연결되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 사이드 키는 상기 도전성 부분의 가장자리를 따라 배치되는 비도전성 부분을 더 포함하고,상기 비도전성 부분은 상기 사이드 키의 상기 도전성 부분 및 상기 측면 부재의 상기 제1 부분 사이에배치되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서,도전성 물질을 포함하는 지지 부재를 더 포함하고,상기 지지 부재는 상기 홈 내에 배치되는 상기 사이드 키의 후면에 접하여(contact) 상기 사이드 키를 상기 홈내에 고정하는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 측면 부재는 도전성 물질을 포함하고, 심리스한(seamless) 루프 형상(loop shape)으로 상기 전자 장치의측면을 형성하고,상기 측면 부재의 상기 제1 부분 및 상기 사이드 키는 단차 없이(without steps) 상기 전자 장치의 일 측면을형성하는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서,상기 무선 통신 회로 및 상기 적어도 하나의 프로세서가 배치되는 인쇄 회로 기판을 더 포함하고,상기 적어도 하나의 프로세서는 상기 인쇄 회로 기판과 전기적으로 연결된 상기 제1 도전성 연결 부재를 통해상기 사이드 키에게 제어 신호를 송신하거나, 상기 제1 도전성 연결 부재를 통해 상기 사이드 키로부터 신호를수신하도록 설정되고,상기 제1 도전성 연결 부재는 상기 인쇄 회로 기판의 커넥터와 연결되는 제1 부분, 및 상기 제1 도전성 연결 부재의 상기 제1 부분과 연결되고 상기 사이드 키의 후면을 형성하는 제2 부분을 포함하는, 전자 장치.공개특허 10-2025-0038112-4-청구항 11"}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 1에 있어서,상기 측면 부재의 내측면에 형성되는 비도전성 부재 더 포함하고,상기 비도전성 부재에는 상기 홈과 적어도 일부가 중첩되는 개구가 형성되고,상기 개구는 상기 사이드 키가 상기 홈으로 인입되기 위한 것인, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서,상기 개구는 상기 홈과 중첩되는 제1 영역 및 상기 제1 영역으로부터 연장되며 상기 측면 부재와 중첩되는 제2영역을 포함하고,상기 무선 통신 회로와 상기 측면 부재를 연결하기 위한 제2 도전성 연결 부재는 상기 제2 영역을 통해 상기 측면 부재와 전기적으로 연결되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 1에 있어서,상기 제1 도전성 연결 부재는 FPCB(flexible printed circuit board), PCB, 상기 사이드 키에 포함된 터치 패널의 일부 또는 FRC(flexible RF cable) 중 적어도 하나인, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 1에 있어서,상기 사이드 키는 터치 패널을 포함하고,상기 사이드 키는: 상기 터치 패널에 대한 사용자의 터치 입력을 식별하거나 상기 터치 패널에 가해지는 압력을 식별하고.상기 적어도 하나의 프로세서에게 상기 터치 입력 또는 상기 압력에 기반하여 상기 사용자의 입력이 존재함을지시하는 신호를 송신하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치에 있어서,홈이 형성되고 상기 전자 장치의 측면을 형성하는 측면 부재;상기 홈 내에 배치되고 도전성 부분을 포함하는 사이드 키(side key);무선 통신 회로; 적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서 및 상기 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 포함하고,상기 무선 통신 회로는:공개특허 10-2025-0038112-5-상기 적어도 하나의 프로세서와 상기 사이드 키를 전기적으로 연결하는 상기 제1 도전성 연결 부재를 통해 상기홈의 가장자리를 둘러싸는 상기 측면 부재의 제1 부분에 급전하고,상기 측면 부재의 상기 제1 부분 및 상기 사이드 키의 상기 도전성 부분에 형성되는 전기적 경로에 기반하여 지정된 주파수 대역의 RF(radio frequency) 신호들을 송신 및/또는 수신하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서,상기 홈의 제1 단(end)과 인접한 상기 측면 부재의 일 부분에서부터 상기 제1 단으로부터 상기 홈의 제2 단을향하는 방향으로 연장되는 제1 돌출부; 및상기 제1 돌출부와 상기 사이드 키의 상기 제1 도전성 연결 부재 사이에 배치되는 제2 도전성 연결 부재를 더포함하고,상기 무선 통신 회로는 상기 제1 도전성 연결 부재, 상기 제2 도전성 연결 부재 및 상기 제1 돌출부를 통해 상기 측면 부재의 상기 제1 부분에 급전하도록 설정되고,상기 제2 도전성 연결 부재는 C-클립(C-clip) 또는 도전성 가스켓 중 적어도 하나인, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 17에 있어서,상기 홈의 상기 제2 단과 인접한 상기 측면 부재의 일 부분에서부터 상기 제2 단으로부터 상기 제1 단을 향하는방향으로 연장되는 제2 돌출부;상기 제2 돌출부와 상기 사이드 키의 상기 제1 도전성 연결 부재 사이에 배치되는 제3 도전성 연결 부재; 및상기 제1 도전성 연결 부재 및 상기 제3 도전성 연결 부재를 통해 상기 제2 돌출부와 전기적으로 연결된 스위치회로를 더 포함하고,상기 제3 도전성 연결 부재는 C-클립 또는 도전성 가스켓 중 적어도 하나인, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 18에 있어서, 상기 스위치 회로는 상기 무선 통신 회로가 배치된 인쇄 회로 기판에 포함된 그라운드와 전기적으로 연결되고적어도 하나의 럼프드 엘리먼트를 포함하고,상기 스위치 회로는 상기 적어도 하나의 럼프드 엘리먼트를 이용하여 상기 전기적 경로의 길이를 변경함으로써상기 지정된 주파수 대역을 조절하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 18에 있어서,상기 무선 통신 회로는 상기 제1 도전성 연결 부재를 통해 상기 스위치 회로를 제어하기 위한 제어 신호를 송신하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0152907", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시 예에 따르면, 전자 장치는 디스플레이, 후면 커버, 디스플레이 및 후면 커버 사이의 공간을 둘러싸고 홈 이 형성되는 측면 부재, 홈 내에 배치되고 도전성 부분을 포함하는 사이드 키, 무선 통신 회로, 적어도 하나의 프로세서, 및 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 포함할 수 있 다. 무선 통신 회로는 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 통해 홈의 가장자리를 둘러싸는 측면 부재의 제1 부분에 급전하고, 측면 부재의 제1 부분 및 사이드 키의 도전성 부분 에 형성되는 전기적 경로에 기반하여 지정된 주파수 대역의 RF(radio frequency) 신호들을 송신 및/또는 수신하 도록 설정될 수 있다."}
{"patent_id": "10-2023-0152907", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)는 안테나를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0152907", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통신 기술 발달에 따라 전자 장치는 다양한 RAT(radio access technology)들을 지원하기 위해 복수의 안테나들 을 포함할 수 있다. 예를 들어, 전자 장치는 LTE(long term evolution) 뿐만 아니라 5G 통신(또는, NR(new radio))을 지원하기 위한 안테나들을 포함할 수 있다.전자 장치는 소형화 및 경량화 추세에 따라 안테나의 실장 공간을 줄이거나 최소화하기 위해서 전자 장치의 측 면 부재를 안테나 방사체로 활용할 수 있다."}
{"patent_id": "10-2023-0152907", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따르면, 전자 장치는 디스플레이, 후면 커버, 디스플레이 및 후면 커버 사이의 공간을 둘러싸고 홈이 형성되는 측면 부재, 홈 내에 배치되고 도전성 부분을 포함하는 사이드 키, 무선 통신 회로, 적어도 하나 의 프로세서, 및 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 포함할 수 있다. 무선 통신 회로는 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재 를 통해 홈의 가장자리를 둘러싸는 측면 부재의 제1 부분에 급전하고, 측면 부재의 제1 부분 및 사이드 키의 도 전성 부분에 형성되는 전기적 경로에 기반하여 지정된 주파수 대역의 RF(radio frequency) 신호들을 송신 및/또 는 수신하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치는 홈이 형성되고 상기 전자 장치의 측면을 형성하는 측면 부재, 상기 홈 내에 배치되고 도전성 부분을 포함하는 사이드 키, 무선 통신 회로, 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서 및 상기 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 포함할 수 있다. 상기 무선 통신 회로는 상기 적어도 하나의 프로세서와 상기 사이드 키를 전기적으로 연결하는 상기 제1 도전성 연결 부재를 통 해 상기 홈의 가장자리를 둘러싸는 상기 측면 부재의 제1 부분에 급전하고, 상기 측면 부재의 상기 제1 부분 및 상기 사이드 키의 상기 도전성 부분에 형성되는 전기적 경로에 기반하여 지정된 주파수 대역의 RF(radio frequency) 신호들을 송신 및/또는 수신하도록 설정될 수 있다."}
{"patent_id": "10-2023-0152907", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 도 1은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통 신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치에는 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted Boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi 다이렉트(wireless fidelity direct) 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통 신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중 입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔포밍, 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 피크 데이터 레이트(peak data rate)(예: 20Gbps 이상), mMTC 실현을 위한 손실 커버리지(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 기판(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워 크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수 의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양 한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지 정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안 테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또 는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청 할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있 다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로 서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시 예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구 들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \" 제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시 예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포 함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circui t)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: CD-ROM(compact disc read only memory))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어™)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경 우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 추가적으로 또는 대체적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구 성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a는 일 실시 예에 따른 전자 장치를 나타내는 사시도이다. 도 2b는 도 2a의 전자 장치를 후면에서 바라본 모습을 나타내는 사시도이다. 도 2a 및 도 2b를 참고하면, 일 실시 예에 따른 전자 장치는 제1 면(또는 전면)(210A), 제2 면(또는 후 면)(210B), 및 제1 면(210A)과 제2 면(210B) 사이의 공간을 둘러싸는 측면(또는 측벽)(210C)을 포함하는 하우징 을 포함할 수 있다. 또 다른 예로서, 하우징은 도 2a 및 도 2b의 제1 면(210A), 제2 면(210B) 또는 측면 (210C)들 중 적어도 일부를 형성하는 구조로 참조될 수 있다. 일 실시 예에 따르면, 전자 장치의 제1 면(210A)은 적어도 일부분이 디스플레이에 의하여 형성될 수 있다. 본 개시의 도 2a 및 도 2b에서는 전면 플레이트 없이 디스플레이가 전자 장치의 전면을 형성하는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 전자 장치의 제1 면(210A)은 적어도 일부분이 실질 적으로 투명한 전면 플레이트(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트)에 의하여 형성될 수 있다. 일 실시 예에 따르면, 제2 면(210B)은 실질적으로 불투명한 후면 커버에 의하여 형성될 수 있다. 예를 들 어, 후면 커버는 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(stainlesssteel, STS), 또는 마그네슘), 또는 상술된 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 일 실시 예에 따르면, 전자 장치의 측면(210C)은 디스플레이 및 후면 커버와 결합할 수 있고, 금속 및/또는 폴리머를 포함하는 측면 부재에 의하여 형성될 수 있다. 또 다른 예를 들어, 후면 커버 및 측면 부재는 일체로 형성될 수 있고, 실질적으로 동일한 물질(예: 알루미늄과 같은 금속 물질)을 포함 할 수 있다. 일 실시 예에 따르면, 전자 장치는, 디스플레이, 오디오 모듈, 센서 모듈, 제1 카메라 모 듈, 사이드 키, 제1 커넥터 홀 또는 제2 커넥터 홀중 적어도 하나 이상을 포함할 수 있다. 또 다른 예를 들어, 전자 장치는 구성요소들 중 적어도 하나를 생략하거나 다른 구성요소를 추가적으로 포 함할 수 있다. 일 실시 예에 따르면, 디스플레이는 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센서, 및/ 또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 일 실시 예에 따르면, 오디오 모듈(예: 도 1의 오디오 모듈)은 마이크 홀, 적어도 하나의 스피커 홀 및 통화용 리시버 홀을 통해 음향을 출력하거나, 음향을 수신할 수 있다. 예를 들어, 마이크 홀 에는 외부의 소리를 획득하기 위한 오디오 모듈의 마이크가 내부에 배치될 수 있다. 예를 들어, 마이 크 홀에는 소리의 방향을 감지할 수 있도록 복수의 마이크들이 배치될 수 있다. 또 다른 예를 들어, 적어도 하나의 스피커 홀 및 통화용 리시버 홀은 마이크 홀과 하나의 홀로 구현되거나, 적어도 하나의 스피커 홀 및 통화용 리시버 홀 없이 스피커가 포함될 수 있다(예: 피에 조 스피커). 일 실시 예에서, 전자 장치는 센서 모듈을 포함할 수 있고, 전자 장치의 내부의 작동 상태, 또 는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 예를 들어, 센서 모듈은 하 우징의 제1 면(210A)에 배치된 근접 센서, 디스플레이에 통합된 또는 인접하게 배치된 지문 센서, 및 /또는 상기 하우징의 제2 면(210B)에 배치된 생체 센서(예: HRM 센서)를 더 포함할 수 있다. 예를 들어, 전자 장치는 도시되지 않은 센서 모듈(예: 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 및/또는 조도 센서)을 더 포함할 수 있다. 본 개시의 센서 모듈은 도 1의 센서 모듈에 대응할 수 있다. 예를 들어, 센서 모듈에 대한 설명 은 센서 모듈에 적용될 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 면(210B)에 배치되는 제2 카메라 모듈을 포함할 수 있다. 제1 카메라 모듈 및 제2 카메라 모듈은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 제2 면(210B)에는 도시되지 않은 플래시가 배치될 수 있다. 예를 들어, 플래시는 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 또 다른 예로서, 2개 이상의 렌즈들(적외선 카메 라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 일 면에 배치될 수 있다. 일 실시 예에 따르면, 사이드 키는 하우징의 측면(210C)에 배치될 수 있다. 예를 들어, 사이드 키 는 지문 센서 또는 터치 패널 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 커넥터 홀(208, 209)은 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터 (예: USB 커넥터)를 수용할 수 있는 제1 커넥터 홀, 및/또는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있는 제2 커넥터 홀(예를 들어, 이어폰 잭)을 포함할 수 있다. 도 2a 및 도 2b에서는 전자 장치는 바 타입(bar-type)에 해당하는 것으로 도시하였으나, 이는 일 예시일 뿐이고 실제로 전자 장치는 다양한 형태의 장치에 해당할 수 있다. 예를 들면, 전자 장치는 폴더블 (foldable) 장치, 슬라이더블(slidable) 장치 웨어러블(wearable) 장치(예: 스마트 워치, 또는 무선 이어폰) 또는 태블릿 PC에 해당할 수 있다. 따라서, 본 개시에 개시되는 기술 사상은 도 2a 및 도 2b에 도시된 바 타입 의 장치에 한정되지 않으며 다양한 형태들의 장치에 적용될 수 있다. 도 2a 및 도 2b에서는 접혀지지 않는 디스플레이가 도시되었으나 이는 일 예시일 뿐이다. 예를 들어, 디스 플레이는 제1 축(예: x 축)을 기준으로 접혀지거나 펼쳐지는 플렉서블 디스플레이일 수 있다. 도 2c는 일 실시 예에 따른 전자 장치의 측면 부재 및 사이드 키를 설명하는 도면이다. 도 2c를 참고하면, 일 실시 예에 따른 전자 장치는 측면(210C)의 적어도 일부를 형성하는 측면 부재 를 포함할 수 있다. 측면 부재는 제1 측면 부분, 제2 측면 부분, 제3 측면 부분 및/또는 제4 측면 부분을 포함할 수 있다. 일 실시 예에 따르면, 측면 부재는 전자 장치의 측면(210C)의 적어도 일부를 형성할 수 있다. 예를 들어, 제1 측면 부분은 전자 장치의 제1 측면의 적어도 일부를 형성할 수 있다. 제2 측면 부분 은 전자 장치의 제2 측면의 적어도 일부를 형성할 수 있다. 제3 측면 부분은 전자 장치 의 제3 측면의 적어도 일부를 형성할 수 있다. 제4 측면 부분은 전자 장치의 제4 측면 의 적어도 일부를 형성할 수 있다. 본 개시의 도 2c에서는 설명의 편의를 위해서 측면 부재에 포함된 측면 부분들(예: 제1 측면 부분)이 전자 장치의 측면(210C)을 형성하는 것으로 설명하였으나 이는 일 예시일 뿐이다. 예를 들어, 측면 부분들 의 정의없이 측면 부재가 전자 장치의 측면(210C)을 형성하는 것으로도 표현될 수 있다. 예컨대, 측 면 부재는 전자 장치의 제1 측면을 형성할 수 있다. 일 실시 예에 따르면, 측면 부재는 도전성 물질을 포함할 수 있다. 예를 들어, 측면 부재는 도전성 물질(예: 알루미늄)로 형성될 수 있다. 일 실시 예에 따르면, 측면 부재는 심리스한(seamless) 루프 형상을 가질 수 있다. 예를 들어, 측면 부재 는 심리스한 루프 형상으로 측면(210C)을 형성할 수 있다. 예를 들어, 측면 부재는 비도전성 물질(예: 사출 부재)을 포함하는 분절부 없이 루프 형상으로 형성될 수 있다. 예를 들어, 제1 측면 부분은 제2 측면 부분 및 제3 측면 부분과 연결될 수 있고, 제4 측면 부분은 제2 측면 부분 및 제 3 측면 부분과 연결될 수 있다. 결과적으로, 측면 부재는 심리스한 루프 형상을 가질 수 있다. 또 다른 예를 들어, 측면 부재는 연속적인 루프 형상을 가질 수 있다. 일 실시 예에 따르면, 제1 측면 부분은 제3 측면 부분과 실질적으로 평행할 수 있고, 제2 측면 부분 은 제4 측면 부분과 실질적으로 평행할 수 있다. 제1 측면 부분의 적어도 일부는 제2 측면 부분 및 제4 측면 부분과 실질적으로 수직할 수 있다. 제3 측면 부분의 적어도 일부는 제2 측면 부 분 및 제4 측면 부분과 실질적으로 수직할 수 있다. 일 실시 예에 따르면, 사이드 키는 사이드 키에 사용자나 객체(예: 펜)의 접촉이 있는 경우 접촉된 위치 및/또는 접촉이 있다는 정보를 식별하는 부품 또는 장치일 수 있다. 예를 들어, 사이드 키는 사용자 의 신체(예: 손가락)이 접촉하거나 사이드 키로부터 지정된 거리 내에 위치함을 식별할 수 있고, 프로세서 에게 사용자 입력(예: 터치 입력)을 식별했음을 지시하는(indicating) 신호 또는 정보를 송신할 수 있다. 일 실시 예에 따르면, 사용자 입력을 식별했음을 지시하는 신호는 전자 장치가 사이드 키의 도전성 부분과 측면 부재 사이의 홈을 포함하는 안테나 이외에 다른 안테나를 선택하여 무선 통신을 수행하 도록 하는 트리거 또는 이벤트일 수 있다. 예를 들어, 후술할 바와 같이 전자 장치는 홈이 형성된 측 면 부재 및 사이드 키의 도전성 부분 간의 전위 차를 이용하는 안테나(예: 도 5의 안테나)를 구 현할 수 있다. 예를 들어, 전자 장치가 안테나를 통해 지정된 주파수 대역의 무선 통신을 수행하는 도중에 사용자가 사이드 키에 신체의 일부(예: 손가락)을 근접시키는 경우, 전자 장치는 사용자 입력을 식별 했음을 지시하는 신호를 사이드 키로부터 식별할 수 있다. 이 경우, 전자 장치는 홈이 형성된 측면 부재 및 사이드 키를 이용하는 안테나 대신에 전자 장치 내 다른 안테나들을 이용하여 지 정된 주파수 대역의 무선 통신을 수행할 수 있다. 일 실시 예에 따르면, 사이드 키는 다양한 방식으로 구현될 수 있다. 예를 들어, 사이드 키는 투명 전극 층들을 이용하는 저항막 방식의 터치 패널을 포함할 수 있다. 예를 들어, 사이드 키는 전위차를 이용 하여 사용자 입력(예: 터치 입력)을 식별하는 정전 용량 방식의 터치 패널을 포함할 수 있다. 일 실시 예에 따 르면, 사이드 키는 측면 부재의 제1 측면 부분과 함께 제1 측면의 적어도 일부를 형성할 수 있다. 예를 들어, 사이드 키는 제1 측면 부분에 형성되는 홈 내에 배치될 수 있다. 홈 내에 배치된 사이드 키는 제1 측면 부분과 함께 제1 측면을 형성할 수 있다. 본 개시의 도 2c에서는 사이드 키가 키 버튼에 대응하는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예 를 들어, 사이드 키는 물리적인 압력에 기반하여 동작하는 키 버튼을 포함할 수 있다. 이 경우, 사이 드 키는 사용자가 사이드 키에 대해 신체의 일부(예: 손가락)을 이용하여 압력을 가하는 경우, 사이드 키의 전위차 뿐만 아니라 물리적인 압력의 유무에 기반하여 사용자 입력이 입력되었는지 식별할 수 있 다. 또 다른 예를 들어, 사이드 키 자체(itself)가 물리적인 압력에 기반하여 동작하는 키 버튼 기능을 수행할 수 있다. 예를 들어, 사용자가 신체의 일부(예: 손가락)을 이용하여 사이드 키에 압력을 가하는 경우, 사 이드 키는 전위차 뿐만 아니라 압력에 기반하여 사이드 키에 대한 사용자 입력을 식별할 수 있다. 일 실시 에에 따르면, 사이드 키는 터치 패널을 포함하고, 사이드 키는 터치 패널에 대한 사용자의 터치 입력을 식별하거나 상기 터치 패널에 가해지는 압력을 식별하고. 프로세서에게 터치 입력 또는 상기 압력에 기반하여 상기 사용자의 입력이 존재함을 지시하는 신호를 송신하도록 설정될 수 있다. 본 개시의 홈이라는 용어는 슬릿, 홀(hole), 개구부(opening portion), 개구(opening), 슬롯(slot) 또는 구멍 (pit)로 대체될 수 있다. 본 개시의 사이드 키라는 용어는 터치 패널(touch panel), 터치 스크린(touch screen), 터치 디스플레이, 또는 TSP(touch screen panel)로 대체될 수 있다. 본 개시의 측면 부재라는 용어는 측면을 형성하는 프레임, 측면을 형성하는 하우징 부분, 또는 도전성 측면 부 재라는 용어로 대체될 수 있다. 본 개시의 측면 부분이라는 용어는 측면 부재, 부분, 파트(part) 또는 도전성 부분으로 대체될 수 있다. 예를 들어, 제1 측면 부분은 제1 측면 부재, 제1 부분, 제1 파트, 제1 프레임 또는 제1 도전성 부분으로 대체될 수 있다. 본 개시의 전자 장치는 측면 부재를 물리적으로 분리하는 분절부 또는 비도전성 물질를 포함하지 않 는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 전자 장치는 적어도 하나의 분절부 또는 비도 전성 물질을 포함할 수 있고, 적어도 하나의 분절부 또는 비도전성 물질을 통해 측면 부재는 측면 부분들 로 구분될 수 있다. 예를 들어, 제1 측면 부분 및 제2 측면 부분 사이에는 비도전성 물질을 포함하는 제1 분절부가 배치될 수 있고, 제2 측면 부분 및 제3 측면 부분 사이에는 비도전성 물질을 포함하는 제2 분절부가 배치될 수 있다. 도 2d는 일 실시 예에 따른 전자 장치의 분해도이다. 도 2d를 참고하면, 일 실시 예에 따른 전자 장치는 후면 커버, 측면 부재, 사이드 키, 제1 인쇄 회로 기판, 제2 인쇄 회로 기판, 배터리 및/또는 디스플레이를 포함할 수 있다. 일 실시 예에 따르면, 측면 부재는 디스플레이 및 후면 커버 사이의 공간을 둘러쌀 수 있다. 예 를 들어, 측면 부재는 디스플레이 및 후면 커버에 결합함으로써 전자 장치의 내부 공간을 형성 또는 정의할 수 있다. 일 실시 예에 따르면, 측면 부재, 디스플레이(2010 및 후면 커버에 의해 형성 또는 정의되는 전자 장 치의 내부 공간에는 다양한 전자 부품들이 배치될 수 있다. 예를 들어, 제1 인쇄 회로 기판, 제2 인 쇄 회로 기판 및/또는 배터리는 전자 장치의 내부 공간에 배치될 수 있다. 일 실시 예에 따르면, 배터리는 전자 장치 내에 포함된 전자 부품들 중 적어도 일부에게 전력을 제공 할 수 있다. 예를 들어, 배터리는 후술된 무선 통신 회로(예: RFIC(radio frequency integrated circuit))을 위한 전력을 공급할 수 있다. 본 개시의 배터리는 도 1의 배터리에 대응할 수 있고, 따라서, 도 1의 배터리에 대한 설명은 배 터리에 적용될 수 있다. 일 실시 예에 따르면, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 배터리를 기준으로 다른 위 치에 배치될 수 있다. 예를 들어, 제1 인쇄 회로 기판은 배터리를 기준으로 윗 방향(upward direction)(예: +y 방향)에 배치될 수 있고, 제2 인쇄 회로 기판은 배터리를 기준으로 윗 방향과 반 대되는 아래 방향(downward direction)(예: -y 방향)에 배치될 수 있다. 또 다른 예를 들어, 제1 인쇄 회로 기판은 전자 장치의 상단부에 배치될 수 있고, 제2 인쇄 회로 기 판은 전자 장치의 하단부에 배치될 수 있다. 상단부는 배터리를 기준으로 위 방향(예: +y 방 향)에 위치한 전자 장치의 부분으로 참조될 수 있고, 하단부는 배터리를 기준으로 아래 방향(예: -y방향)에 위치한 전자 장치의 부분으로 참조될 수 있다. 일 실시 예에 따르면, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 물리적으로 분리되었으나 전기적 으로 연결될 수 있다. 예를 들어, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 도전성 부재(예: FPCB(flexible printed circuit board))를 통해서 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 전자 장치 내의 다양한 부 품들을 위한 전기적 연결 경로를 제공하거나, 다양한 부품들이 배치되기 위한 공간을 제공할 수 있다. 예를 들 어, 프로세서는 제1 인쇄 회로 기판 상에 배치될 수 있고 제1 인쇄 회로 기판은 사이드 키(21 7)와 프로세서를 전기적으로 연결하는 도전성 경로를 제공할 수 있다. 예를 들어, 전력 관리 모듈은 제1 인쇄 회로 기판 상에 배치될 수 있고, 제1 인쇄 회로 기판은 전력 관리 모듈과 배터리(32 0)를 전기적으로 연결하는 도전성 경로를 제공할 수 있다. 본 개시의 프로세서는 도 1에서 설명된 것과 같이 적어도 하나의 프로세서를 포함할 수 있다. 예를 들어, 프로세서는 AP(application processor) 및 CP(communication processor)를 포함할 수 있다. 또 다른 예를 들어, 프로세서는 AP만을 포함할 수 있다. 본 개시의 도 2d에서는 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판이 배터리를 기준으로 다른 위치에 배치되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제1 인쇄 회로 기판은 제2 인쇄 회로 기판에 적층될 수 있다. 이 경우, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 인터포저 를 통해 전기적으로 연결될 수 있다. 본 개시의 도 2d에서는 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판이 별도의 구성으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제1 인쇄 회로 기판 및 제2 인쇄 회로 기판은 하나의 인쇄 회로 기판으로 형성될 수 있다. 이 경우, 배터리는 하나의 인쇄 회로 기판의 -z 방향 또는 +z 방향에 위치 또는 배치될 수 있다. 도 3a는 일 실시 예에 따른 홈 내에 배치된 사이드 키와 연결된 무선 통신 회로 및 프로세서를 설명하는 도면이 다. 도 3a를 참고하면, 일 실시 예에 따른 전자 장치는 홈, 사이드 키, 제1 인쇄 회로 기판, 무선 통신 회로 및/또는 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 측면 부재 내에는 홈이 형성될 수 있다. 예를 들어, 측면 부재 중 제1 측 면 부분 내에 홈이 형성될 수 있다. 일 실시 예에 따르면, 홈은 다양한 형상을 가질 수 있다. 예를 들어, 측면 부재에 형성된 홈은 제3 방향(예: +y 방향)으로 길게 형성될 수 있다. 또 다른 예를 들어, 홈은 직사각형 형상, 타원 형상, 또 는 다각형상을 가질 수 있다. 예를 들어, 홈은 사이드 키에 대응하는 형상을 가질 수 있다. 일 실시 예에 따르면, 프로세서는 제1 인쇄 회로 기판 상에 또는 제1 인쇄 회로 기판 내에 배치 될 수 있다. 예를 들어, 프로세서는 AP를 포함할 수 있고, AP는 제1 인쇄 회로 기판 상에 배치될 수 있다. 또 다른 예를 들어, 프로세서는 AP 및 CP를 포함할 수 있고, AP 및 CP는 제1 인쇄 회로 기판 상에 배치될 수 있다. 다만, 도 3a에서는 프로세서가 제1 인쇄 회로 기판 상에 배치되는 것으로 설명되었으나 이는 예시일 뿐이고, 본 개시는 이에 한정되지 않는다. 예를 들어, 프로세서 중 AP는 제1 인쇄 회로 기판에 배치 될 수 있고, CP는 제2 인쇄 회로 기판에 배치될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제1 인쇄 회로 기판 상에 또는 제1 인쇄 회로 기판 내 에 배치될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 IFIC(intermediate frequency integrated circuit) 및/또는 RFIC 를 포함할 수 있다. 예를 들어, 무선 통신 회로는 FR1 주파수 대역(예: 7.125 GHz) 이하의 RF 신호들을 처 리할 수 있고, 이 경우 무선 통신 회로는 RFIC만을 포함할 수 있다. 일 예시에서, 무선 통신 회로의 RFIC는 프로세서 중 CP로부터 수신된 BB(baseband) 신호들을 RF 신호들로 변환하여 안테나 방사체(예: 측 면 부재)에 송신할 수 있다. 또 다른 예를 들어, 무선 통신 회로는 FR2 주파수 대역(예: 24.25 GHz) 이상의 RF 신호들을 처리할 수 있 고, 이 경우 무선 통신 회로는 IFIC 및 RFIC를 포함할 수 있다. 일 예시에서, 무선 통신 회로의 IFIC 는 프로세서 중 CP로부터 수신된 BB 신호들을 IF 신호들로 변환하여 RFIC로 전송할 수 있고, 무선 통신 회 로의 RFIC는 IF 신호들을 RF 신호들로 변환하여 안테나 방사체에 송신할 수 있다. 일 실시 예에 따르면, 사이드 키는 제1 도전성 연결 부재를 포함할 수 있다. 예를 들어, 제1 도전성 연결 부재는 사이드 키를 위한 신호를 전달하기 위한 배선들(wires)이 형성 또는 배치되는 구성일 수 있다. 일 예시에서, 사이드 키를 위한 신호는 사이드 키가 사용자 입력에 기반하여 프로세서에 게 송신하는 입력 신호 및/또는 프로세서가 사이드 키의 제어를 위해 사이드 키에게 송신하는 제어 신호를 포함할 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재에 포함된 배선들은 홈이 형성된 측면 부재에 급전 하기 위한 급전 라인으로 이용될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 홈 내에 배치된 사이드 키의 제1 도전성 연결 부재 와 전기적으로 연결될 수 있다. 예를 들어, 사이드 키는 제1 도전성 연결 부재를 포함할 수 있 고, 제1 인쇄 회로 기판에는 무선 통신 회로와 제1 도전성 연결 부재를 전기적으로 연결하는 제 1 도전성 라인(conductive line)이 형성될 수 있다. 예를 들어, 제1 도전성 라인은 제1 인쇄 회로 기판의 복수의 레이어들에 형성되는 도전성 연결 라인, 도전성 비아 또는 인터포저(interposer)를 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로가 제1 도전성 라인을 통해 제1 도전성 연결 부재와 전기 적으로 연결됨에 따라 무선 통신 회로는 제1 도전성 연결 부재를 통해 측면 부재에 급전할 수 있다. 예를 들어, 무선 통신 회로는 지정된 주파수 대역(예: 약 3 ~ 6 GHz)의 RF 신호들을 제1 도전성 연 결 부재를 통해 측면 부재에게 송신할 수 있다. 일 실시 예에 따르면, 프로세서는 홈 내에 배치된 사이드 키와 전기적으로 연결될 수 있다. 예 를 들어, 사이드 키는 제1 도전성 연결 부재를 포함할 수 있고, 제1 인쇄 회로 기판에는 프로세 서와 제1 도전성 연결 부재를 전기적으로 연결하는 제2 도전성 라인이 형성될 수 있다. 일 실시 예에 따르면, 프로세서가 제1 도전성 연결 부재를 통해 사이드 키와 전기적으로 연결됨 에 따라, 프로세서는 사이드 키를 제어하기 위한 제어 신호들을 사이드 키에게 송신할 수 있고, 사이드 키로부터 수신되는 입력 신호들을 수신할 수 있다. 일 예시에서, 입력 신호들은 사이드 키에 대한 사용자 입력(예: 터치 입력)에 기반하여 사용자 입력이 존재함을 지시하는(indicating) 신호들로 참조될 수 있다. 본 개시의 도 3a에서는 제1 도전성 연결 부재가 사이드 키에 포함되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제1 도전성 연결 부재는 사이드 키와 일체로 형성되지 않을 수 있고, 사 이드 키에 결합 가능한 별도의 구성(component)으로 설명될 수도 있다 본 개시에서는 무선 통신 회로 및 프로세서 간의 전기적 연결 관계가 도시되지 않았으나 무선 통신 회로 및 프로세서는 전기적으로 연결될 수 있다. 예를 들어, 프로세서는 CP를 포함할 수 있고, CP는 무선 통신 회로와 전기적으로 연결될 수 있다. 무선 통신 회로는 CP로부터 BB(baseband) 신호들 을 수신할 수 있고, BB 신호들을 RF 신호들로 업컨버트할 수 있다. 이 경우, 무선 통신 회로는 지원하는 주파수 대역에 따라 BB 신호들을 RF 신호들로 바로 컨버트할수도 잇고, BB 신호들을 IF 신호들로 컨버트한 후 IF 신호들을 RF 신호들로 컨버트할 수도 있다. 본 개시의 도 3a에서는 홈이 측면 부재 중 제1 측면 부분에 형성되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 홈은 측면 부재 중 제2 측면 부분, 제3 측면 부분 및/또는 제4 측면 부분에 형성될 수 있다. 본 개시의 도 3a에서는 사이드 키가 홈 내에 배치되는 것으로 설명되었으나 이는 다양한 표현으로 대 체될 수 있다. 예를 들어, 사이드 키가 홈 내에 인입되는(entered in) 것으로 표현될 수 있다. 예를 들어, 사이드 키가 홈에 결합되는(coupled with) 것으로 표현될 수 있다. 예를 들어, 사이드 키(21 7)가 홈에 고정되는(fixed to) 것으로 표현될 수 있다. 예를 들어, 사이드 키가 홈에 결착 (fastened)되는 것으로 표현될 수 있다. 예를 들어, 사이드 키가 홈에 접착(adhere to)되는 것으로 표현될 수 있다.도 3b는 일 실시 예에 따른 홈 내에 배치되는 사이드 키를 설명하는 도면이다. 도 3b를 참고하면, 일 실시 예에 따른 사이드 키는 홈의 폭 및 높이에 대응하는 폭 및 높이를 가질 수 있다. 예를 들어, 사이드 키는 홈 내에 배치되어야 하므로 홈의 폭보다 작거나 같은 제1 폭 (W1)을 가질 수 있다. 사이드 키는 홈의 높이보다 작거나 같은 제1 높이(H1)를 가질 수 있다. 일 실시 예에 따르면, 사이드 키는 제1 도전성 연결 부재를 포함할 수 있다. 예를 들어, 제1 도전성 연결 부재는 FPCB(flexible printed circuit board) 또는 FRC(flexible RF circuit)을 포함할 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재는 무선 통신 회로로부터 측면 부재에게 전달되는 RF 신호들을 위한 제1 도전성 경로를 포함할 수 있다. 예를 들어, 제1 도전성 연결 부재는 급전을 위 한 제1 도전성 경로를 포함할 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재는 프로세서로부터 사이드 키에게 전달되는 제어 신 호를 위한 제2 도전성 경로를 포함할 수 있고, 예를 들어, 제1 도전성 연결 부재는 제어 신호의 송신 및/또는 수신을 위한 제2 도전성 경로를 포함할 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재는 제1 연결 부분 및 제2 연결 부분을 포함할 수 있 다. 예를 들어, 제2 연결 부분은 사이드 키의 후면(217b)에 위치하는 부분일 수 있다. 예를 들어, 제 1 연결 부분은 제2 연결 부분으로부터 연장되어 제1 인쇄 회로 기판과 연결되는 부분일 수 있다. 예를 들어, 제1 연결 부분의 일 단은 제1 인쇄 회로 기판의 커넥터(예: 도 4b의 커넥터) 에 연결되고, 제1 연결 부분의 타 단은 제2 연결 부분과 연결될 수 있다. 또 다른 예를 들어, 제1 도전성 연결 부재의 제2 연결 부분은 제3 방향(예: +y 방향)으로 길게 연장 되는 부분일 수 있다. 제1 연결 부분은 제2 연결 부분으로부터 제1 방향(예: -x 방향)으로 연장되는 부분일 수 있다. 일 예시에서, 제1 방향(예: -x 방향)은 제3 방향(예: +y 방향)과 수직일 수 있다. 본 개시의 도 3b에서는 제1 도전성 연결 부재가 사이드 키에 포함되는 별도의 구성으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제1 도전성 연결 부재는 사이드 키의 일 부분으로 설명될 수 있 다. 본 개시에서 사이드 키의 전면(217a)은 전자 장치의 외부를 향하는 면이고, 사이드 키의 후면 (217b)은 전자 장치의 내부를 향하는 면일 수 있다. 다만, 이는 설명의 편의를 위한 정의로서 본 개시는 이에 한정되지 않는다. 예를 들어, 전면(217a)은 제1 면으로 정의되고, 후면(217b)은 제1 면과 반대되는 제2 면 으로 정의될 수 있다. 일 실시 예에 따르면, 사이드 키는 제1 도전성 경로(또는, 제1 급전 선로, 전송 선로)가 노출되는 제 1 필컷 영역(353a)(또는, 논-그라운드(non-grounded) 영역, 비도전성 영역)을 포함할 수 있다. 예를 들어, 제1 도전성 연결 부재의 제2 연결 부분은 제1 도전성 경로가 노출된 제1 필컷 영역(353a)을 포함할 수 있다. 일 예시에서, 제1 필컷 영역(353a)은 비도전성 영역으로서 급전을 위하여 비도전성 물질로 형성된 제1 도전성 연결 부재의 일부 층일 수 있다. 예를 들어, 제1 도전성 연결 부재가 PCB(printed circuit board)인 경우에 제1 레이어(또는, 상부 레이어) 및 제1 레이어에서부터 지정된 레이어(예: 제5 레이어)까지는 필컷 영역(353a)일 수 있고, 지정된 레이 어 아래의 레이어(예: 제6 레이어)부터 하부 레이어까지는 전송 라인들이 포함된 배선 레이어일 수 있다. 예를 들어, 제1 도전성 연결 부재의 제1 도전성 경로가 측면 부재와 전기적으로 연결되기 위해 서는 제1 도전성 연결 부재(예: FPCB)의 표면을 형성하는 도전성 레이어 중 일부가 제거되어 비도전성 물 질이 노출되고, 비도전성 물질 상에 도전성 경로가 배치될 수 있다. 예를 들어, 제1 도전성 연결 부재(예: FPCB, PCB 또는 디스플레이의 일부)는 비도전성 물질 상에 급전을 위한 제1 도전성 경로가 배치된 제1 필 컷 영역(353a)을 포함할 수 있고, 제1 필컷 영역(353a) 상에서 제1 도전성 경로가 노출됨에 따라 제1 도전 성 경로는 제2 도전성 연결 부재와 전기적으로 연결될 수 있다. 다만, 본 개시에서 설명의 편의를 위하여 제1 도전성 경로의 전기적 연결을 위하여 제1 도전성 경로 의 표면을 형성하는 도전성 레이어 중 일부가 제거되는 것으로 설명되었으나 이는 일 예시일 뿐이고 본 개시는 이에 한정되지 않는다. 예를 들어, 제1 도전성 경로의 전기적 연결을 위해서 제1 도전성 연결 부재의 표면에 위치한 비도전성 레이어 중 일부가 제거될 수 있다. 예를 들어, 제1 도전성 경로의 전기적 연결을 위해서 비도전성 레이어의 제거 없이 제1 도전성 경로의 제1 도전성 연결 부재의 표면까지 노출되도록 형성될 수 있다. 예를 들어, 제1 도전성 연결 부재가 PCB인 경우에 제1 도전성 경로는 직접 제1 도전성 연결 부재의 표면으로 노출되지 않고 PCB에 형성된 도전성 비아를 통해 측면 부재와 전기적으 로 연결될 수 있다. 일 실시 예에 따르면, 그라운드(예: 도전성 부분)를 포함하는 제1 도전성 연결 부재는 제1 인쇄 회로 기판 및/또는 제2 인쇄 회로 기판에 포함된 그라운드와 전기적으로 연결되거나, 전자 장치 내에 포함된 그라운드와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 제2 도전성 연결 부재를 포함할 수 있고, 제1 도전성 경로는 제1 필컷 영역(353a) 상에서 제2 도전성 연결 부재와 전기적으로 연결될 수 있다. 예를 들어, 제2 도전성 연결 부재는 제1 필컷 영역(353a) 상에 배치될 수 있다. 제1 도전성 경로는 제1 필컷 영역(353a)에서 제2 도전성 연결 부재와 접촉함으로써 제2 도전성 연결 부재와 전기적으로 연결될 수 있다. 예를 들 어, 제1 도전성 라인 및 제1 도전성 경로는 제1 측면 부분에 급전하기 위한 도전성 경로, 급전 선로 또는 전송 선로에 해당할 수 있다. 예컨대, 제1 도전성 라인 및 제1 도전성 경로는 제2 도전성 연결 부재(예: C-클립, 도전폼)와 연결되어 제1 측면 부분에 급전하기 위한 도전성 경로, 급전 선로 또는 전송 선로 중 적어도 일부를 형성할 수 있다. 예를 들어, 제1 도전성 라인 및 제1 도전성 경로 는 제2 도전성 연결 부재와 연결되어 무선 통신 회로가 무선 통신을 수행하도록 구성될 수 있다. 일 실시 예에 따르면, 제1 필컷 영역(353a)에서는 제1 도전성 연결 부재의 표면에 형성된 비도전성 물질 (또는, 유전체)의 적어도 일부가 제거됨에 따라 제1 도전성 경로가 외부로 노출될 수 있고, 제1 도전성 연 결 부재의 외부로 노출된 제1 도전성 경로는 제2 도전성 연결 부재와 전기적으로 연결될 수 있 다. 예를 들어, 제2 도전성 연결 부재는 C-클립(C-clip), 도전성 가스켓, 또는 포고 핀(pogo-pin)을 포함할 수 있다. 일 실시 예에 따르면, 사이드 키는 도전성 부분 및 도전성 부분의 가장자리를 따라 배치되는 비 도전성 부분을 포함할 수 있다. 예를 들어, 도전성 부분은 사이드 키가 사용자 입력(예: 터치 입력)을 식별하기 위한 기판(substrate) 또는 패널(panel)을 포함할 수 있다. 또 다른 예를 들어, 도전성 부분 은 사이드 키에 포함된 금속 레이어를 포함할 수 있다. 예를 들어, 비도전성 부분은 도전성 부분을 둘러싸도록 형성될 수 있다. 사이드 키가 홈 내에 배치되는 경우, 비도전성 부분은 측면 부재와 도전성 부분 사이에 위치할 수 있고, 측면 부재와 도전성 부분 간의 이격 거리가 확보될 수 있다. 예컨대, 비도전성 부분은 측면 부재 의 홈과 도전성 부분 간의 이격 거리를 확보하는데 이용될 수 있다. 일 실시 예에 따르면, 비도전성 부분은 접착 물질(예: 비도전성 접착 부재, 비도전성 접착 테이프)을 포함 할 수 있다. 일 실시 예에 따르면, 비도전성 부분의 접착 물질은 사이드 키를 홈에 고정할 수 있다. 예를 들 어, 비도전성 부분은 사이드 키가 홈 내에 인입되었을 때 제1 측면 부분과 접촉할 수 있고, 비도전성 부분의 접착 물질을 통해 사이드 키는 홈에 고정될 수 있다. 본 개시의 도 3b에서 설명된 제1 도전성 연결 부재의 제1 연결 부분 및 제2 연결 부분은 부분을 지칭하는 다양한 표현으로 대체될 수 있다. 예를 들어, 제1 연결 부분 및 제2 연결 부분 각각은 제1 부분(portion) 및 제2 부분으로 대체될 수 있다. 예를 들어, 제1 연결 부분 및 제2 연결 부분은 각각 제1 파트(part) 및 제2 파트로 대체될 수 있다. 본 개시의 필컷 영역이라는 용어는 커팅 영역(cutting area), 커팅 부분, 제거 부분, 제거 영역, 또는 필컷 영 역 중 하나로 대체될 수 있다. 본 개시의 도전성 경로(conductive path)라는 용어는 전송 선로(transmission line), 도전성 선로(conductive line) 또는 급전 경로(feeding path)라는 용어로 대체될 수 있다. 도 4a는 일 실시 예에 따른 전자 장치의 외부에서부터 홈 내로 인입되는 사이드 키를 설명하는 도면이다. 도 4a를 참고하면, 일 실시 예에 따른 전자 장치는 지지 부재, 커넥터, 및/또는 제1 돌출부 (protrusion)를 포함할 수 있다.일 실시 예에 따르면, 사이드 키는 전자 장치의 외부로부터 홈로 인입될 수 있고, 홈 내에 배치될 수 있다. 예를 들어, 전자 장치의 외부에 위치한 사이드 키는 제1 방향(예: -x 방향)으로 이 동하여 홈로 인입될 수 있고, 사이드 키는 홈과 결합되거나 홈에 고정될 수 있다. 일 예시 에서, 홈에 사이드 키가 인입된 후에 홈과 사이드 키의 도전성 부분 사이에는 비도전 성 부분이 배치될 수 있다. 본 개시에서는 홈에 사이드 키가 인입된 경우에 사이드 키의 도전성 부분과 홈과 사 이에는 비도전성 부분이 배치되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 홈의 테 두리 또는 가장자리를 따라 비도전성 영역이 형성 또는 구성될 수 있고, 이 경우 홈에 사이드 키가 인입된 경우에 홈의 비도전성 영역이 홈과 사이드 키의 도전성 부분 사이에 배치 또는 위 치될 수 있다. 또 다른 예를 들어, 전자 장치의 외부에 위치한 사이드 키는 전자 장치의 외부로부터 내부 공간 을 향하는 방향으로(in a direction from the outside of the electronic device to inner space) 이동하여 홈 로 인입될 수 있고, 사이드 키는 홈과 결합될 수 있다. 또 다른 예를 들어, 전자 장치의 외부에 위치한 사이드 키는 홈을 향하는 방향으로(in a direction toward to the opening) 이동하여 홈로 인입될 수 있고, 사이드 키는 홈과 결합될 수 있다. 일 실시 예에 따르면, 전자 장치는 지지 부재를 포함할 수 있다. 지지 부재는 홈 내에 인 입된 사이드 키를 지지하거나, 사이드 키를 홈에 고정시킬 수 있다. 예를 들어, 지지 부재(41 0)는 사이드 키의 후면(예: 도 3b의 후면(217b))에 접할 수 있고, 사이드 키를 지지하거나, 사이드 키를 홈에 고정시킬 수 있다. 일 실시 예에 따르면, 지지 부재는 제1 도전성 연결 부재의 제1 연결 부분이 인입되기 위한 홀 을 포함할 수 있다. 사이드 키가 홈 내로 인입하는 경우에 사이드 키의 제1 도전성 연결 부재는 홀에 인입할 수 있고, 커넥터와 연결될 수 있다. 일 실시 예에 따르면, 전자 장치는 커넥터를 포함할 수 있다. 예를 들어, 커넥터는 제1 인쇄 회 로 기판 상에 형성 또는 배치될 수 있다. 예를 들어, 커넥터는 사이드 키와 제1 인쇄 회로 기판 상에 배치된 부품들(예: 무선 통신 회로, 프로세서) 간의 전기적 연결을 제공하기 위한 구성일 수 있다. 일 실시 예에 따르면, 커넥터는 무선 통신 회로와 사이드 키를 전기적으로 연결할 수 있다. 예 를 들어, 무선 통신 회로는 제1 도전성 라인을 통해 커넥터와 전기적으로 연결될 수 있고, 사이 드 키는 제1 도전성 연결 부재를 통해 커넥터와 전기적으로 연결될 수 있다. 결과적으로, 무선 통신 회로 및 사이드 키는 제1 도전성 라인, 커넥터 및 제1 도전성 연결 부재를 통해 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 측면 부재는 제1 돌출부를 포함할 수 있다. 예를 들어, 측면 부재 중 제1 측면 부분은 제1 돌출부를 포함할 수 있다. 일 실시 예에 따르면, 제1 돌출부는 측면 부재로부터 지정된 길이만큼 연장되는 부분일 수 있다. 예 를 들어, 제1 돌출부는 측면 부재 중 제1 측면 부분으로부터 제1 방향(예: +y 방향)으로 연장되 는 부분일 수 있다. 예를 들어, 제1 돌출부는 홈의 제1 단과 인접한 측면 부재의 인접 부분 으로부터 지정된 길이만큼 연장되는 부분일 수 있다. 예를 들어, 제1 돌출부는 인접 부분으로부 터 홈의 제1 단(250a)으로부터 제2 단(250b)을 향하는 방향으로 연장되는 부분일 수 있다. 예를 들어, 제1 돌출부는 제1 측면 부분에 평행한 방향(예: +y 방향)으로 연장되는 부분일 수 있다. 본 개시에서 지지 부재라는 용어는 지지 플레이트, 지지 기판, 플레이트 또는 기판이라는 용어로 대체될 수 있다. 본 개시의 돌출부(protrusion)라는 용어는 돌출 부분(protruding portion), 연장부(extension), 또는 연장 부 분(extended portion)으로 대체될 수 있다. 본 개시의 전자 장치의 내부 또는 내부 공간은 디스플레이, 후면 커버 및 측면 부재에 의 해 둘러싸인 공간으로 참조될 수 있다. 또한, 전자 장치의 외부 또는 외부 공간은 디스플레이, 후면 커버 및 측면 부재에 의해 둘러싸인 공간 이외의 공간으로 참조될 수 있다.본 개시의 도 4a의 인접 부분이라는 용어는 측면 부재 중 홈과 인접한 부분을 지칭하는 다른 용 어들로 대체될 수 있다. 또한, 도 4a의 인접 부분의 크기 내지 형상은 설명의 편의를 위해 도시된 것이므 로 인접 부분의 크기 내지 형상은 달라질 수 있다. 도 4b는 일 실시 예에 따른 사이드 키가 홈에 인입된 경우에 제1 측면 부분에 급전하는 무선 통신 회로를 설명 하는 도면이다. 도 4b를 참고하면, 일 실시 예에 따른 전자 장치의 외부에 위치한 사이드 키는 제1 방향(예: -x 방향)으로 이동하여 홈 내로 인입될 수 있다. 예를 들어, 전자 장치의 외부에 배치된 사이드 키(21 7)는 홈을 향하는 방향(예: -x 방향)으로 이동하여 홈에 결합되거나 홈에 고정될 수 있다. 일 실시 예에 따르면, 사이드 키가 홈에 인입됨에 따라 제1 도전성 연결 부재의 제1 필컷 영역 (353a) 상에 위치한 제2 도전성 연결 부재는 제1 돌출부와 전기적으로 연결될 수 있다. 예를 들어, 사이드 키가 제1 방향(예: -x 방향)으로 이동함에 따라 제2 도전성 연결 부재는 제1 돌출부와 접촉할 수 있고, 제2 도전성 연결 부재는 제1 돌출부와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 사이드 키의 제1 도전성 연결 부재를 통해 제1 측면 부 분의 제1 지점(F1)에 급전할 수 있다. 예를 들어, 무선 통신 회로는 제1 도전성 라인 및 제1 도 전성 경로를 통해 제2 도전성 연결 부재(예: 도전성 가스켓)에 전기적으로 연결될 수 있다. 제2 도전 성 연결 부재는 제1 측면 부분의 제1 돌출부와 전기적으로 연결되므로, 결과적으로 무선 통신 회로는 제1 도전성 경로, 제2 도전성 연결 부재, 및 제1 돌출부를 통해 제1 지점(F1)에 급 전할 수 있다. 일 실시 예에 따르면, 제1 지점(F1)은 측면 부재 중 홈과 인접한 지점일 수 있다. 예를 들어, 제1 지 점(F1)은 제1 측면 부분 중 홈과 인접한 지점일 수 있다. 예를 들어, 제1 지점(F1)은 홈의 제1 단(250a)과 인접한 지점일 수 있다. 예를 들어, 제1 지점(F1) 도 5에서 후술되는 측면 부재의 제1 부분(예: 도 5의 제1 부분)에 포함될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제1 측면 부분의 제1 지점(F1)에 급전함으로써 홈에 대 응하는 측면 부재의 부분(예: 도 5의 제1 부분) 및 사이드 키의 도전성 부분(예: 도 3b의 도전 성 부분)에 형성되는 전기적 경로에 기반하여 지정된 주파수 대역(예: 약 3~6 GHz)의 RF 신호들을 송신 및 /또는 수신할 수 있다. 이하, 도 5에서는 홈 및 도전성 부분에 형성되는 전기적 경로가 설명된다. 본 개시의 지정된 주파수 대역은 다양한 주파수 대역을 포함할 수 있다. 예를 들어, 지정된 주파수 대역은 약 3~6 GHz 주파수 대역을 포함할 수 있다. 예를 들어, 지정된 주파수 대역은 FR1 대역(예: 약 7.125 GHz 이하)의 적어도 일부를 포함할 수 있다. 예를 들어, 지정된 주파수 대역은 FR2 대역(예: 약 24.25 ~ 약 52.6 GHz)의 적 어도 일부를 포함할 수 있다. 본 개시의 도 4b에서는 무선 통신 회로가 제1 측면 부분의 제1 지점(F1)에 급전하는 것으로 설명하였 으나 무선 통신 회로가 측면 부재의 제1 지점(F1)에 급전하는 것으로 표현될 수도 있다. 또한, 무선 통신 회로9321)는 제1 지점 이외의 제1 측면 부분의 다양한 지점에 급전할 수 있다. 도 5는 일 실시 예에 따른 무선 통신 회로가 측면 부재에 급전함에 따라 측면 부재 및 사이드 키의 도전성 부분 에 형성되는 전기적 경로를 설명하는 도면이다. 도 5를 참고하면, 일 실시 예에 따른 측면 부재는 도전성 물질을 포함하는 제1 부분을 포함할 수 있 다. 예를 들어, 측면 부재는 홈의 가장자리를 둘러싸는 제1 부분을 포함할 수 있다. 예를 들어, 측면 부재는 홈의 가장자리에 대응하거나 가장자리를 포함하는 제1 부분을 포함할 수 이다. 예 를 들어, 측면 부재는 홈을 포함하는 제1 부분을 포함할 수 있다. 예를 들어, 측면 부재는 홈이 형성되는 제1 부분을 포함할 수 있다. 예를 들어, 측면 부재는 홈과 인접한 제1 부분 을 포함할 수 있다. 예를 들어, 측면 부재는 급전을 위한 제1 지점(F1)을 포함하는 제1 부분을 포함할 수 있다. 예를 들어, 측면 부재는 홈의 가장자리를 따라 형성되는 전기적 경로를 포함하는 제 1 부분을 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 측면 부재의 제1 지점(F1)에 급전할 수 있다. 예를 들어, 무 선 통신 회로는 측면 부재의 제1 부분의 제1 지점(F1)에 급전할 수 있다. 본 개시의 제1 부분은 측면 부재 중 홈을 둘러싸는 영역(region) 내지 부분(portion)을 지칭하 기 위한 용어이며, 본 개시의 도 5에서 도시된 제1 부분의 크기 및 경계는 달라질 수 있다. 예를 들어, 제 1 부분은 도 5에 개시된 크기 및 경계와 다른 크기 및 경계를 가질 수 있다. 또 다른 예를 들어, 제1 부분 은 직사각형이 아닌 다양한 형상을 가질 수 있다. 일 실시 예에 따르면, 무선 통신 회로가 측면 부재의 제1 지점(F1)에 급전함에 따라 측면 부재 의 제1 부분에는 제1 전기적 경로가 형성될 수 있고, 사이드 키의 도전성 부분에는 제2 전 기적 경로가 형성될 수 있다. 예를 들어, 사이드 키가 홈에 안착되는 경우, 제1 측면 부분 및 도전성 부분 사이에 비도전성 부분이 형성될 수 있다. 비도전성 부분는 실질적으로 슬릿을 형성할 수 있다. 무선 통신 회로는 슬릿을 형성하는 비도전성 부분을 가로질러 제1 지점(F1)에 급전 함으로써 비도전성 부분 주위에 전기적 경로들이 형성될 수 있다. 일 예시에서, 제1 부분에는 제1 전 기적 경로가 형성될 수 있고, 도전성 부분에는 제2 전기적 경로가 형성될 수 있다. 이 경우, 제 1 부분 및 도전성 부분을 방사체로 포함하는 안테나(또는, 슬롯 안테나)는 제1 전기적 경로 및 제2 전기적 경로에 기반하여 동작할 수 있다. 예를 들어, 무선 통신 회로가 제1 부분의 제1 지점(F1)에 급전함에 따라 홈의 가장자리를 따라 제1 전기적 경로가 형성될 수 있고, 도전성 부분의 가장자리를 따라 제2 전기적 경로가 형성될 수 있다. 예를 들어, 무선 통신 회로가 제1 부분의 제1 지점(F1)에 급전하는 경우, 홈과 인접한 제1 지점 (F1)과 도전성 부분의 전위 차로 인해서 전류는 커플링 연결 또는 전자기적 연결을 통해 제1 부분에 서 도전성 부분으로 흐를 수 있다. 이에 따라, 제1 전기적 경로 및 제2 전기적 경로가 형성될 수 있다. 이하, 본 개시에서는 제1 전기적 경로 및 제2 전기적 경로에 기반하여 지정된 주파수 대역의 RF 신호 들을 송신 및/또는 수신하는 안테나 방사체는 안테나로 지칭된다. 즉, 이하에서부터 안테나는 측면 부재의 제1 부분 및 사이드 키의 도전성 부분을 포함하는 안테나 방사체를 포함할 수 이다. 또 다른 예로서, 안테나는 홈 및 도전성 부분을 포함하는 안테나 방사체를 포함할 수 있 다. 일 실시 예에 따르면, 측면 부재의 제1 부분과 도전성 부분은 사이드 키의 비도전성 부분 을 사이에 두고 이격될 수 있다. 예를 들어, 제1 부분과 도전성 부분은 전자기적 (electromagnetic) 연결이 가능하도록 이격될 수 있다. 예를 들어, 제1 부분과 도전성 부분은 정전압 적(capacitively) 연결이 가능하도록 지정된 거리만큼 이격될 수 있다. 예를 들어, 제1 부분과 도전성 부 분은 커플링 연결이 가능하도록 지정된 거리만큼 이격되게 배치될 수 있다. 일 실시 예에 따르면, 그라운드는 도전성 부분과 전기적으로 연결될 수 있다. 예를 들어, 그라운드 는 제1 인쇄 회로 기판 및/또는 전자 장치 내에 포함된 전자 부품(예: FPCB, FRC)에 포함될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 전기적 경로에 기반하여 또는 전기적 경로를 이용하여 RF 신호들을 송신 및/또는 수신할 수 있다. 예를 들어, 송신 및/또는 수신된 RF 신호들의 주파수 대역은 전기적 경로의 길이에 기반할 수 있다. 본 개시의 전기적 경로(electrical path)는 급전에 기반하여 형성되는 전류의 흐름 또는 전위차에 기반하여 형 성되는 전류의 흐름으로 이해될 수 있다. 본 개시의 도 5에서는 그라운드가 사이드 키의 도전성 부분에 전기적으로 연결되는 것으로 설명 되었으나 이는 일 예시일 뿐이다. 예를 들어, 그라운드는 도 8에 도시된 지점 이외의 도전성 부분에 연결될 수 있다. 예를 들어, 그라운드는 측면 부재의 제1 측면 부분 중 하나의 지점에 전기적으 로 연결될 수 있다. 본 개시의 도 5에서는 무선 통신 회로가 측면 부재의 제1 지점(F1)에 급전함에 따라 측면 부재 의 제1 부분에 제1 전기적 경로가 형성되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 측면 부재가 아닌 제1 측면 부분을 기준으로 설명될 수 있다. 예컨대, 무선 통신 회로가 제1 측면 부분의 제1 지점(F1)에 급전함에 따라 제1 측면 부분의 제1 부분에 제1 전기적 경로가 형성되는 것으로도 설명될 수 있다. 도 6은 일 실시 예에 따른 제1 부분의 A-A' 단면도이다. 도 6을 참고하면, 일 실시 예에 따른 제1 돌출부는 제1 측면 부분으로부터 제3 방향(예: +y 방향)으 로 연장되어 형성될 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재 중 제2 연결 부분에 형성된 제1 필컷 영역(353a) 상에는 제1 도전성 경로가 형성될 수 있다. 예를 들어, 제1 도전성 경로는 다른 연결 부재(예: 제2 도전성 연결 부재)와 접촉되도록 제1 필컷 영역(353a) 상에 배치 또는 형성될 수 있다. 일 실시 예에 따르면, 제1 돌출부 및 제2 연결 부분 사이에는 제2 도전성 연결 부재가 배치될 수 있다. 예를 들어, 제1 돌출부 및 제2 연결 부분의 제1 필컷 영역(353a) 사이에는 제2 도전성 연결 부재가 배치될 수 있다. 예를 들어, 제1 돌출부 및 제1 필컷 영역(353a)에 형성된 제1 도전성 경로 사이에는 제2 도전성 연결 부재가 배치될 수 있다. 또 다른 예를 들어, 제2 도전성 연결 부재는 제1 필컷 영역(353a)을 기준으로 제2 방향(예: +x 방향)에 위 치할 수 있다. 이 경우, 제1 돌출부는 제2 도전성 연결 부재를 기준으로 제2 방향(예: +x 방향)에 위 치할 수 있다. 일 실시 예에 따르면, 그라운드는 제1 인쇄 회로 기판에 형성될 수 있다. 예를 들어, 제1 인쇄 회로 기판은 교번하여 배치되는 복수의 도전성 레이어들 및 비도전성 레이어들을 포함할 수 있고, 복수의 도전 성 레이어들 중 적어도 일부는 그라운드에 해당할 수 있다. 본 개시의 도 6에서는 그라운드가 제1 인쇄 회로 기판에 형성되거나 제1 인쇄 회로 기판에 포함 되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 그라운드는 제2 인쇄 회로 기판에 형 성될 수 있다. 또 다른 예를 들어, 그라운드는 전자 장치 내에 포함된 다른 전기물들 또는 도전성 부 분에 형성될 수 있다. 일 실시 예에 따르면, 그라운드는 사이드 키와 제2 지점(G1)에서 연결될 수 있다. 예를 들어, 그라운 드는 사이드 키와 제3 도전성 경로를 통해 제2 지점(G1)에서 전기적으로 연결될 수 있다. 사이 드 키에서부터 그라운드까지의 전기적 경로는 실질적으로 사이드 키의 도전성 부분(예: 도 5의 도전성 부분)의 접지 경로일 수 있다. 일 실시 예에 따르면, 제1 측면 부분이 형성하는 제1 측면과 사이드 키의 전면(217a)은 실질적 으로 동일한 평면을 형성할 수 이다. 예를 들어, 제1 측면과 전면(217a)은 실질적으로 동일한 평면 상에 위치할 수 있다. 예를 들어, 제1 측면과 전면(217a)은 단차 없이(without steps) 실질적으로 동일한 면을 형성할 수 있다. 본 개시의 도 6의 제1 측면은 실질적으로 도 2c의 제1 측면에 대응할 수 있다. 또 다른 예를 들어, 전자 장치의 제1 측면과 사이드 키의 전면(217a)은 제1 인쇄 회로 기판 의 가장자리로부터 실질적으로 동일한 거리만큼 이격될 수 있다. 예컨대, 제1 측면은 제1 인쇄 회로 기판의 가장자리로부터 제1 거리(D1)만큼 이격될 수 있고, 전면(217a)은 제1 인쇄 회로 기판 의 가장자리로부터 제1 거리(D1)만큼 이격될 수 있다. 일 실시 예에 따르면, 제1 측면과 사이드 키의 전면(217a)이 단차 없이 심리스하게 동일 평면으로 형 성됨에 따라 전자 장치는 외부로부터 이물질(예: 물, 또는 먼지)이 전자 장치 내부로 인입되는 것을 방지하거나 줄일 수 있다. 도 7은 일 실시 예에 따른 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때 홈의 가장자리 및 사이드 키의 가장자리를 따라 형성되는 전류 분포를 도시한다. 도 7을 참고하면, 일 실시 예에 따른 무선 통신 회로는 홈을 포함하는 측면 부재에 급전할 수 있고, 급전에 기반하여 홈의 가장자리 및 사이드 키의 가장자리를 따라 전류가 형성될 수 있다. 무선 통신 회로는 홈의 가장자리 및 사이드 키의 가장자리를 따라 형성되는 전류에 기반하여 지 정된 주파수 대역의 RF 신호들을 송신 및/또는 수신할 수 있다. 도 8은 일 실시 예에 따른 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때의 방사 효율 그래프이다. 도 8을 참고하면, 일 실시 예에 따른 제1 그래프는 측면 부재의 제1 부분에 무선 통신 회로 가 급전했을 때 제1 부분 및 사이드 키의 도전성 부분을 포함하는 안테나의 방사 효 율 그래프이다. 일 실시 예에 따르면, 제1 그래프는 약 2.5 ~ 약 6 GHz의 주파수 대역에서 약 -15 dB 이상의 값을 도시한 다. 따라서, 무선 통신 회로는 제1 부분 및 도전성 부분을 포함하는 안테나를 이용하여 지 정된 값(예: 약 -15 dB) 이상의 방사 효율을 확보할 수 있다. 다만, 약 2.5 ~ 약 6GHz의 주파수 대역은 일 예시일 뿐이고, 안테나(5010의 동작 주파수 대역은 약 2.5 ~ 약 3GHz의 주파수 대역에 한정되지 않는다. 예를 들어, 무선 통신 회로가 제1 부분 및 도전성 부분(34 1)을 포함하는 안테나를 이용하여 송신 및/또는 수신하는 주파수 대역은 다양할 수 있다. 예를 들어, 무선 통신 회로는 약 2.5 GHz 이하의 주파수 대역의 RF 신호들을 송신 및/또는 수신할 수 있다. 예를 들어, 무 선 통신 회로는 약 6 GHz 이상의 주파수 대역의 RF 신호들을 송신 및/또는 수신할 수 있다. 도 9a는 일 실시 예에 따른 전자 장치의 내부에서 외부를 향하는 방향으로 홈에 결합되는 사이드 키를 설명하는 도면이다. 도 9a를 참고하면, 일 실시 예에 따른 사이드 키는 전자 장치의 내부에서 외부를 향하는 방향(예: +x 방향)으로 홈에 결합 또는 고정될 수 있다. 예를 들어, 전자 장치의 내부에 위치한 사이드 키는 제2 방향(예: +x 방향)으로 이동하여 홈에 인입될 수 있다. 또 다른 예를 들어, 전자 장치의 내부에 위치한 사이드 키는 홈을 향하는 방향(예: +x 방향)으로 이동하여 홈에 인입되거나 결합될 수 있다. 본 개시의 도 9의 실시 예에서는 도 4a의 실시 예와 달리 사이드 키가 전자 장치의 내부에서 홈(25 0)과 결합할 수 있다. 예를 들어, 도 4a의 실시 예에서는 사이드 키가 전자 장치의 외부에서, 제1 방 향(예: -x 방향)으로 이동하여 홈과 결합할 수 있다. 반면에, 도 9의 실시 예에서는 사이드 키가 전 자 장치의 내부에서, 제2 방향(예: +x 방향)으로 이동하여 홈과 결합할 수 있다. 일 실시 예에 따르면, 홈에 결합된 사이드 키의 도전성 부분은 홈과 지정된 거리만큼 이격 될 수 있다. 예를 들어, 사이드 키가 홈 내로 인입되어 홈과 결합하더라도 비도전성 부분 은 홈과 도전성 부분 사이에 배치될 수 있다. 이 경우, 비도전성 부분을 사이에 두고 비도전성 부분의 두께에 대응하는 거리만큼 도전성 부분과 제1 측면 부분은 이격될 수 있다. 도 9b는 일 실시 예에 따른 전자 장치의 내부에서 사이드 키가 홈에 결합되는 경우에 홈을 고정하기 위한 고정 부재를 설명하는 도면이다. 도 9b를 참고하면, 일 실시 예에 따른 전자 장치는 사출 부재를 포함할 수 있다. 예를 들어, 사출 부 재는 제1 측면 부분에 형성된 비도전성 물질일 수 있다. 예를 들어, 사출 부재는 제1 측면 부분 에 아노다이징(anodizing)된 부재일 수 있다. 예를 들어, 사출 부재는 이중 사출된 부재일 수 있다. 예를 들어, 사출 부재는 제1 측면 부분의 위치와 대응하는 위치에 형성될 수 있다. 예를 들어, 사출 부재는 적어도 일부가 제1 측면 부분과 접하도록 배치될 수 있다. 예를 들어, 사출 부재는 제1 측면 부분과 정렬되도록(aligned) 배치될 수 있다. 예를 들어, 사출 부재는 제1 측면 부분과 대 응하여 제3 방향(예: +y 방향)으로 길게 연장되어 형성될 수 있다. 일 실시 예에 따르면, 사출 부재는 제1 측면 부분에 형성된 홈과 적어도 일부가 중첩되는 개구 를 포함할 수 있다. 예를 들어, 사출 부재의 개구는 제1 영역 및 제2 영역을 포함할 수 있다. 제1 영역은 홈과 제1 방향(예: -x 방향)으로 중첩될 수 있고, 제2 영역은 제1 영역 으로부터 연장되며 홈과는 중첩되지 않을 수 있다. 예를 들어, 개구는 제1 영역으로부터 연장되며 제1 측면 부분과 중첩되는 제2 영역을 포함할 수 있다. 예를 들어, 제1 영역은 홈과 전자 장치의 내부에서 홈을 향하는 방향으로 중첩되는 영역일 수 있고, 제2 영역은 제1 영역으로부터 연장되며 홈과는 중첩되지 않는 영역일 수 있다. 또 다른 예를 들어, 제1 영역은 홈에 대응하도록 사출 부재에 형성되는 영역일 수 있고, 제2 영 역은 제1 영역에서 추가로 형성된 리세스(recess)일 수 있다. 일 실시 예에 따르면, 개구의 제1 영역은 사이드 키를 통과시키기 위한 영역일 수 있다. 예를 들어, 사이드 키는 사출 부재의 개구의 제1 영역을 통과하여 홈에 고정되거나 홈 에 결합될 수 있다. 일 실시 예에 따르면, 개구의 제2 영역은 제1 도전성 연결 부재의 제1 도전성 경로와 제1 측면 부분 간의 전기적 연결을 위한 영역일 수 있다. 예를 들어, 제2 영역이 형성됨에 따라 제4 도전 성 연결 부재(예: C-클립) 및 제1 측면 부분의 접촉이 가능할 수 있다. 예컨대, 제2 영역이 형 성되지 않는 경우에 사이드 키가 홈 내로 인입하더라도 사출 부재로 인해 제4 도전성 연결 부재 와 제1 측면 부분은 전기적으로 연결될 수 없다. 반면에, 일 실시 예에 따른 제2 영역이 형성됨 에 따라 제4 도전성 연결 부재는 제1 측면 부분과 전기적으로 연결될 수 있다. 즉, 제4 도전성 연결 부재는 제2 영역을 통해 측면 부재의 제1 측면 부분과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제4 도전성 연결 부재는 사이드 키의 제2 연결 부분으로부터 제4 방향(예: -y 방향)으로 길게 연장될 수 있고, 제1 측면 부분과 접촉할 수 있다. 본 개시의 도 9a 및 도 9b에서는 사출 부재가 제1 측면 부분에 형성되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제1 측면 부분에는 사출 부재가 형성되지 않을 수 있다. 예를 들어, 사출 부재는 생략될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제1 도전성 라인, 제1 도전성 경로, 및 제4 도전성 연 결 부재를 통해 제1 측면 부분에 급전할 수 있고, 지정된 주파수 대역의 RF 신호들을 송신 및/또는 수신할 수 있다. 도 10a는 일 실시 예에 따른 측면 부재의 B-B' 단면도이다. 도 10a를 참고하면, 일 실시 예에 따른 사이드 키는 제1 측면 부분에 형성된 홈 및 사출 부재 의 개구에 인입될 수 있다. 사이드 키의 적어도 일부가 개구에 인입됨에 따라 사출 부재 는 개구를 고정할 수 있다. 일 실시 예에 따르면, 전자 장치는 지지 부재를 포함할 수 있다. 예를 들어, 지지 부재는 사 이드 키의 후면(예: 도 3b의 후면(217b))과 접하도록 배치될 수 있고, 사이드 키를 홈 내에 고 정할 수 있다. 일 실시 예에 따르면, 지지 부재는 도전성 물질 및/또는 비도전성 물질을 포함할 수 있다. 예를 들어, 지 지 부재의 전부는 도전성 물질로 형성될 수 있다. 예를 들어, 지지 부재는 도전성 물질 및 비도전 성 물질을 포함할 수 있다. 예를 들어, 지지 부재의 전부는 비도전성 물질(예: 사출 부재)로 형성될 수 있다. 예를 들어, 지지 부재는 제1 비도전성 물질 및 제2 비도전성 물질을 포함할 수 있다. 제1 비 도전성 물질 및 제2 비도전성 물질은 사이드 키의 비도전성 부분에 대응하는 위치에 형 성될 수 있다. 예를 들어, 제1 비도전성 물질 및 제2 비도전성 물질은 사이드 키의 비도전성 부분을 기준으로 제1 방향(예: -x 방향)에 위치 또는 형성될 수 있다. 예를 들어, 제1 비도전성 물질 및 제2 비도전성 물질은 사이드 키의 비도전성 부분과 정렬되도록 위치 또는 형성될 수 있다. 도 10b는 일 실시 예에 따른 도 10a에 도시된 홈이 사이드 키로 인입되기 전과 인입된 후를 설명하는 도면이다. 도 10b를 참고하면, 일 실시 예에 따른 전자 장치의 내부에 배치된 사이드 키는 제2 방향(예: +x 방 향)으로 이동하여 홈 내로 인입될 수 있고, 홈과 결합할 수 있다. 도 10c는 일 실시 예에 따른 고정 부재가 제1 측면 부분 내에 형성되는 경우에 사이드 키가 홈에 인입되는 과정 을 설명하는 도면이다. 도 10c를 참고하면, 일 실시 예에 따른 전자 장치는 제1 측면 부분 내에 배치되는 비도전성 부재 를 포함할 수 있다. 예를 들어, 제1 측면 부분 내에는 리세스가 형성될 수 있고, 리세스 에는 비도전성 부재가 배치될 수 있다. 또 다른 예를 들어, 리세스에는 비도전성 부재 (예: 사출 부재)로 채워질 수 있다. 본 개시의 도 10c에서는 도 3b의 실시 예와 달리 사이드 키의 도전성 부분 및 제1 측면 부분 사 이에 배치되는 비도전성 부재가 제1 측면 부분 내에 형성될 수 있다. 예를 들어, 도 3b의 실시 예에서는 도전성 부분 및 제1 측면 부분 사이에 배치되는 비도전성 부분이 사이드 키에 포함될 수 있다. 반면에, 도 10c의 실시 예에서는 도전성 부분 및 제1 측면 부분 사이에 배치되는 비도전성 부재는 제1 측면 부분에 포함될 수 있다. 본 개시의 도 10c의 실시 예에서는 도 10a 및 도 10b의 실시 예와 달리 비도전성 부재가 제1 측면 부분 내에 배치될 수 있다. 예를 들어, 도 10a 및 도 10b의 실시 예에서는 비도전성 부분이 사이드 키 내에 배치되는데 반해서 도 10c의 실시 예에서는 비도전성 부재가 제1 측면 부분 내에 형성된 리세스 내에 배치될 수 있다. 즉, 도 10a 및 도 10b의 실시 예에서는 홈과 사이드 키 사이에 배치되는 비도전성 물질이 사이드 키의 비도전성 부분에 대응할 수 있고, 도 10c의 실시 예에서는 홈 과 사이드 키 사이에 배치되는 비도전성 물질이 비도전성 부재일 수 있다. 도 11은 일 실시 예에 따른 도 10a의 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때 홈의 가장자리 및 사이드 키의 가장자리를 따라 형성되는 전류 분포를 도시한다. 도 11을 참고하면, 일 실시 예에 따른 무선 통신 회로는 홈을 포함하는 측면 부재에 급전할 수 있고, 급전에 기반하여 홈의 가장자리 및 사이드 키의 가장자리를 따라 전류가 형성될 수 있다. 도 11에 도시된 전류 분포도를 참고하면, 도 7에 도시된 전류 분포도와 유사하게 홈 및 사이드 키의 가장자리들을 따라 전류가 형성됨이 확인된다. 따라서, 도 10a의 실시 예에서와 같이 사이드 키가 전자 장치의 내부에서 홈을 향해 이동하여 홈에 결합되는 경우에도 사이드 키가 전자 장치의 외부에서 홈을 향해 이동하여 홈에 결합되는 경우와 마찬가지로 홈이 형성된 제1 측면 부분 및 사이드 키의 가장자리들을 따라 전 류가 형성될 수 있다. 도 12는 일 실시 예에 따른 도 10a의 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때의 방사 효율 그 래프이다. 도 12를 참고하면, 일 실시 예에 따른 제1 그래프는, 사이드 키가 전자 장치의 내부에서 홈 과 결합된 경우에, 홈 및 사이드 키의 도전성 부분을 포함하는 안테나의 방사 효율 그래프이다. 일 실시 예에 따르면, 제1 그래프는 약 2.75 ~ 약 6 GHz의 주파수 대역에서 약 -15 dB 이상의 값을 도시 한다. 따라서, 무선 통신 회로는 홈 및 도전성 부분을 포함하는 안테나를 이용하여 지정된 값(예: 약 -15 dB) 이상의 방사 효율을 확보할 수 있다. 다만, 약 2.75 ~ 약 6GHz의 주파수 대역은 일 예시일 뿐이고, 본 개시를 한정하지 않는다. 무선 통신 회로(32 1)가 홈 및 도전성 부분을 포함하는 안테나를 이용하여 송신 및/또는 수신하는 주파수 대역은 다양할 수 있다. 예를 들어, 무선 통신 회로는 약 2.75 GHz 이하의 주파수 대역의 RF 신호들을 송신 및/또 는 수신할 수 있다. 예를 들어, 무선 통신 회로는 약 6 GHz 이상의 주파수 대역의 RF 신호들을 송신 및/또 는 수신할 수 있다. 도 13은 일 실시 예에 따른 제2 돌출부를 포함하는 전자 장치를 설명하는 도면이다. 도 13을 참고하면, 일 실시 예에 따른 전자 장치는 복수의 돌출부들을 포함할 수 있다. 예를 들어, 전자 장치는 홈의 제1 단(250a)과 인접한 측면 부재의 제1 인접 부분으로부터 연장되는 제1 돌출부를 포함할 수 있다. 예를 들어, 전자 장치는 홈의 제2 단(250b)과 인접한 측면 부재 의 제2 인접 부분으로부터 연장되는 제2 돌출부를 포함할 수 있다. 예를 들어, 본 개시의 도 13의 제1 인접 부분은 도 4a의 인접 부분에 대응할 수 있다. 일 실시 예에 따르면, 제1 돌출부는 무선 통신 회로가 측면 부재에 급전하기 위해 형성된 부분 일 수 있고, 제2 돌출부는 접지를 위해 형성된 부분일 수 있다. 본 개시의 도 13의 제1 돌출부는 도 4의 제1 돌출부에 대응할 수 있고, 도 4의 제1 돌출부에 대한 설명은 도 14의 제1 돌출부에 적용될 수 있다. 일 실시 예에 따르면, 제1 돌출부는 측면 부재의 제1 인접 부분으로부터 지정된 길이만큼 연 장되는 부분일 수 있다. 예를 들어, 제1 돌출부는 제1 인접 부분으로부터 제3 방향(예: +y 방향)으 로 연장되어 형성될 수 있다. 예를 들어, 제1 돌출부는 제1 인접 부분으로부터 홈의 제1 단(250a)에서부터 제2 단(250b)을 향하는 방향으로 연장되는 부분일 수 있다. 일 실시 예에 따르면, 제2 돌출부는 측면 부재의 제2 인접 부분으로부터 지정된 길이만큼 연 장된 부분일 수 있다. 예를 들어, 제2 돌출부는 제2 인접 부분으로부터 제4 방향(예: -y 방향)으로 연장되어 형성될 수 있다. 예를 들어, 제2 돌출부는 제2 인접 부분으로부터 홈의 제2 단 (250b)에서부터 제1 단(250a)을 향하는 방향으로 연장되는 부분일 수 있다. 본 개시의 도 13에서는 전자 장치가 측면 부재로부터 연장되는 제1 돌출부 및 제2 돌출부 를 포함하는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제1 돌출부 및 제2 돌출부 는 측면 부재에 포함되는 개념(concept)으로도 설명될 수 있다. 본 개시의 도 13의 제1 인접 부분 및 제2 인접 부분이라는 용어는 측면 부재 중 홈과 인 접한 부분을 지칭하는 다른 용어들로 대체될 수 있다. 또한, 도 13의 제1 인접 부분 및 제2 인접 부분 의 크기 내지 형상은 설명의 편의를 위해 도시된 것이며 제1 인접 부분 및 제2 인접 부분의 크기 내지 형상은 달라질 수 있다. 도 14는 일 실시 예에 따른 복수의 필컷 영역들을 포함하는 사이드 키와 복수의 돌출부들을 포함하는 측면 부재 를 설명하는 도면이다. 도 14를 참고하면, 일 실시 예에 따른 사이드 키는 제1 도전성 연결 부재를 포함할 수 있고, 제1 도 전성 연결 부재는 제1 필컷 영역(353a) 및 제2 필컷 영역(1413a)을 포함할 수 있다. 일 실시 예에 따르면, 제1 필컷 영역(353a) 상에서 제1 도전성 경로는 제2 도전성 연결 부재와 연결 될 수 있고, 제2 필컷 영역(1413a) 상에는 제3 도전성 연결 부재가 배치되어 제2 돌출부와 연결될 수 있다. 예를 들어, 제2 도전성 연결 부재 및/또는 제3 도전성 연결 부재는 도전성 가스켓, C-클립, 또는 포고-핀 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 사이드 키가 홈 내로 인입되는 경우 제2 도전성 연결 부재는 제1 돌출부 와 연결될 수 있고, 제3 도전성 연결 부재는 제2 돌출부와 연결될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제1 도전성 라인, 제1 도전성 경로, 제1 돌출부 및 제2 도전성 연결 부재를 통해 측면 부재의 제1 지점(F1)에 급전할 수 있다. 일 실시 예에 따르면, 그라운드는 제2 돌출부 및 제3 도전성 연결 부재를 통해 측면 부재 의 제3 지점(G2)에 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제4 도전성 경로는 스위치 회로와 무선 통신 회로를 전기적으로 연결할 수 있다. 예를 들어, 전자 장치는 제4 도전성 경로를 통해 무선 통신 회로와 연결되는 스위치 회로를 포함할 수 있다. 예를 들어, 스위치 회로는 사이드 키의 제2 연결 부분에 형성 또는 배치될 수 있다. 일 실시 예에 따르면, 무선 통신 회로 및/또는 프로세서는 제4 도전성 경로를 통해 스위치 회 로를 제어하기 위한 제어 신호를 송신할 수 있다. 예를 들어, 무선 통신 회로는 제4 도전성 경로 를 통해 스위치 회로와 연결될 수 있고, 제어 신호를 통해 스위치 회로를 온/오프하거나 스 위치 회로 내 적어도 하나의 럼프드 엘리먼트와 제1 측면 부분의 전기적 연결을 제어할 수 있다. 예 를 들어, 프로세서는 무선 통신 회로를 통하거나 프로세서가 스위치 회로에 직접 연결되 어 스위치 회로를 제어할 수 있다. 일 실시 예에 따르면, 스위치 회로는 적어도 하나의 럼프드 엘 리먼트(예: 캐패시터, 또는 인덕터)를 포함할 수 있고, 스위치 회로는 적어도 하나의 엘리먼트를 이용하 여 안테나(예: 도 5의 안테나)의 전기적 길이를 변경할 수 있다. 예를 들어, 스위치 회로는 제3 도 전성 연결 부재 및 제2 돌출부를 통해 제1 측면 부분에 제1 인덕턴스 값을 가지는 제1 인덕터 를 전기적으로 연결할 수 있고, 이 경우 제1 측면 부분을 포함하는 안테나의 전기적 길이는 제1 인덕 터가 연결되지 않는 경우에 비해 상대적으로 늘어날 수 있다. 예를 들어, 스위치 회로는 제1 측면 부분 에 제1 인덕턴스 값보다 큰 제2 인덕턴스 값을 가지는 제2 인덕터를 전기적으로 연결할 수 있고, 이 경우 제1 측면 부분을 포함하는 안테나의 전기적 길이는 제1 인덕터가 연결된 경우에 비해 상대적으로 늘 어날 수 있다. 예를 들어, 스위치 회로는 제1 측면 부분에 제1 캐패시턴스 값을 가지는 캐피시터를 연결할 수 있고, 이 경우 제1 측면 부분을 포함하는 안테나의 전기적 길이는 캐패시터가 연결되지 않은 경우에 비해 상대적으로 줄어들 수 있다.일 실시 예에 따르면, 스위치 회로가 온오프됨에 따라 전자 장치는 다양한 전기적 길이를 가지는 전 기적 경로들을 확보할 수 있고, 다중 주파수 대역의 RF 신호들을 송신 및/또는 수신할 수 있다. 예를 들어, 스 위치 회로가 오프되는 경우에는 제3 전기적 경로이 형성될 수 있다. 예를 들어, 스위치 회로(142 0)가 온되어서 그라운드가 제3 도전성 연결 부재 및 제2 돌출부를 통해 제1 측면 부분과 전기적으로 연결될 수 있고, 이 경우에 제4 전기적 경로가 형성될 수 있다. 안테나가 기반하는 전기 적 경로가 제3 전기적 경로에서 제4 전기적 경로로 변경됨에 따라 안테나가 기반하는 전기적 경로의 전기적 길이는 상대적으로 짧아질 수 있다. 전기적 길이가 짧아지는 경우에 RF 신호들의 공진 주파수는 상대적으로 높은 주파수 대역으로 천이될 수 있고, 전자 장치는 다중 주파수 대역을 구현할 수 있다. 예를 들어, 안테나의 전기적 길이가 변경되는 것은 안테나가 기반하는 제1 전기적 경로 또는 제 2 전기적 경로 중 적어도 하나의 길이가 변경되는 것으로 참조될 수 있다. 본 개시의 스위치 회로라는 용어는 매칭 회로, 매칭 소자 또는 스위칭 회로(switching circuit), 또는 스위치 모듈로 대체될 수 있다. 도 15는 일 실시 예에 따른 도 14의 측면 부재의 C-C' 단면도이다. 도 15를 참고하면, 일 실시 예에 따른 스위치 회로는 제3 도전성 경로 상에 형성 또는 배치될 수 있 다. 예를 들어, 스위치 회로는 제1 인쇄 회로 기판의 그라운드와 제3 도전성 연결 부재 를 전기적으로 연결하는 제3 도전성 경로 상에 형성될 수 있다. 본 개시의 도 15에서는 스위치 회로가 제3 도전성 경로 상에 형성되는 것으로 설명되었으나 이는 일 예시일 뿐이고, 다양한 표현으로 대체될 수 있다. 예를 들어, 스위치 회로는 제3 도전성 경로에 포 함되는 구성(component)일 수 있다. 또 다른 예를 들어, 스위치 회로는 제3 도전성 경로에 전기적으 로 연결되는 구성일 수 있다. 일 실시 예에 따르면, 제3 도전성 경로는 제2 필컷 영역(1413a)을 통해 제3 도전성 연결 부재와 전 기적으로 연결될 수 있고, 그라운드는 제3 도전성 경로, 스위치 회로, 및 제3 도전성 연결 부 재를 통해 측면 부재의 제3 지점(G3)과 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 도전성 경로는 제1 필컷 영역(353a)을 통해 제2 도전성 연결 부재와 전기 적으로 연결될 수 있고, 무선 통신 회로는 제1 도전성 라인, 제1 도전성 경로 및 제2 도전성 연 결 부재를 통해 측면 부재의 제1 지점(F1)에 급전할 수 있다. 도 16은 일 실시 예에 따른 제3 도전성 경로에 연결된 럼프드 엘리먼트에 따른 홈 및 사이드 키를 포함하는 안 테나의 방사 효율 그래프이다. 도 16을 참고하면, 일 실시 예에 따른 제1 그래프는 스위치 회로가 제2 돌출부를 그라운드 에 전기적으로 연결시키지 않은 경우에 홈 및 사이드 키를 포함하는 안테나의 방사 효율 그래프이다. 제2 그래프는 스위치 회로가 제1 인덕턴스 값(예: 약 3.9 nH)을 가지는 제1 인덕터를 통해 제2 돌출부를 그라운드에 전기적으로 연결된 경우에 홈 및 사이드 키를 포함하는 안 테나의 방사 효율 그래프이다. 제3 그래프는 스위치 회로가 제2 인덕턴스 값(예: 약 1nH)을 가지는 제2 인덕터를 통해 제2 돌출부를 그라운드에 전기적으로 연결된 경우에 홈 및 사이드 키를 포함하는 안테나의 방사 효율 그래프이다. 제1 그래프 및 제2 그래프를 비교하면, 제2 돌출부가 그라운드에 연결되지 않은 경우에 대응하는 제1 그래프에 비해서 제3 도전성 경로에 제1 인덕터가 전기적으로 연결된 경우에 대응하는 제2 그래프가 상대적으로 높은 주파수 대역에 도시되는 것이 확인된다. 예를 들어, 제1 그래프는 약 3 GHz 주파수에서 최대 방사 효율 값을 도시하는데 반해서 제2 그래프는 약 3.5 GHz 주파수에서 최대 방사 효율 값을 도시한다. 제1 그래프 및 제3 그래프를 비교하면, 제2 돌출부가 그라운드에 연결되지 않은 경우에 대응하는 제1 그래프에 비해서 제3 도전성 경로에 제2 인덕터가 전기적으로 연결된 경우에 대응하는 제3 그래프가 상대적으로 높은 주파수 대역에서 도시되는 것이 확인된다. 예를 들어, 제1 그래프는 약 3 GHz 주파수에서 최대 방사 효율 값을 도시하는데 반해서 제3 그래프는 약 4.5 GHz 주파수에서 최대 방사 효율 값을 도시한다. 예를 들어, 전자 장치는 스위치 회로에 포함된 럼프드 엘리먼트들과 제3 도전성 경로의 전기적 연결을 제어함(controlling)으로써 홈 및 사이드 키를 포함하는 안테나의 동작 주파수 대역을 조절할 수 있다. 예컨대, 스위치 회로는 안테나의 전기적 길이를 조절(adjusting)함으로써 안테나 의 동작 주파수 대역을 변경할 수 있다. 도 17은 일 실시 예에 따른 측면 부재와 무선 통신 회로를 연결하는 C-클립을 설명하는 도면이다. 도 17을 참고하면, 일 실시 예에 따른 전자 장치는 연결 구조(예: C-클립)을 포함할 수 있다. 예를 들어, 연결 구조는 제1 돌출부 및 사이드 키 사이에 배치될 수 있다. 일 실시 예에 따르면, 연결 구조는 측면 부재와 무선 통신 회로를 전기적으로 연결할 수 있다. 예를 들어, 연결 구조는 제1 돌출부와 사이드 키의 제1 도전성 경로를 전기적으로 연결할 수 있다. 제1 도전성 경로는 무선 통신 회로와 연결되므로 결과적으로 무선 통신 회로는 연결 구조를 통해 측면 부재의 제1 돌출부와 연결될 수 이다. 본 개시의 도 6에서는 제2 도전성 연결 부재(예: 도전성 가스켓)이 제1 돌출부와 제1 도전성 경로 를 연결하는데 반해서 본 개시의 도 17에서는 연결 구조(예: C-클립)가 제1 돌출부와 제1 도전 성 경로를 연결할 수 있다. 본 개시의 도 6 및 도 17에서는 제2 연결 부분 및 제1 돌출부 사이에 제2 도전성 연결 부재 또 는 연결 구조가 배치되는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 제2 도전성 연결 부재 또는 연결 구조는 생략될 수 있고, 제1 도전성 경로 및 제1 돌출부는 커플링 또는 전자기적으로 연결될 수 있다. 이 경우, 무선 통신 회로는 제1 도전성 경로 를 통해 제1 돌출부에 커플링 급전할 수 있다. 이 경우, 제1 도전성 경로 및 제1 돌출부 간의 간격이 커플링 연결이 가능한 거리보다 긴 경우에 제1 도전성 경로 및 제1 돌출부 사이에는 별 도의 커플러(coupler)가 배치될 수도 있다. 예를 들어, 제2 도전성 연결 부재 또는 연결 구조는 생략될 수 있고, 제1 도전성 경로 및 제1 돌출부는 초음파 융착을 통해서 직접 연결될 수 있다. 도 18은 일 실시 예에 따른 사이드 키를 지지하고, 도전성 물질을 포함하는 지지 부재를 설명하는 도면이다. 도 18을 참고하면, 일 실시 예에 따른 전자 장치는 지지 부재를 포함할 수 있다. 예를 들어, 지지 부재는 사이드 키의 후면(예: 도 3b의 후면(217b))과 접하도록 배치될 수 있고, 사이드 키를 홈 내에 고정할 수 있다. 일 실시 예에 따르면, 지지 부재는 도전성 물질을 포함할 수 있다. 예를 들어, 지지 부재의 전부는 도전성 물질로 형성될 수 있다. 일 실시 예에 따르면, 지지 부재는 제1 도전성 연결 부재의 제1 연결 부분이 인입되기 위한 홀 을 포함할 수 있다. 예를 들어, 사이드 키가 홈 내로 인입하는 경우에 사이드 키의 제1 도전성 연결 부재는 홀에 인입할 수 있고, 커넥터와 연결될 수 있다. 일 실시 예에 따르면, 지지 부재는 측면 부재와 일체로 형성되거나, 결합될 수 있다. 일 실시 예에 따르면, 지지 부재는 측면 부재와 적어도 일부 이격될 수 있으면, 지지 부재와 측면 부재 사이에는 비도전성 물질 또는 유전체가 위치될 수 있다. 도 19는 일 실시 예에 따른 도전성 물질을 포함하는 지지 부재의 홀에 인입되는 사이드 키를 설명하는 도면이다. 도 19를 참고하면, 일 실시 예에 따른 사이드 키는 제1 방향(예: -x 방향)으로 이동하여 홈에 결합될 수 있다. 홈 내에 배치된 사이드 키는 도전성 물질을 포함하는 지지 부재와 접할 수 있고, 지 지 부재에 의해 홈 내에서 고정될 수 있다. 예를 들어, 전자 장치에 외부로부터 충격이나 압력이 가해졌을 때 지지 부재가 사이드 키를 지 지함에 따라 사이드 키는 홈 내에 고정될 수 있다. 도 20은 도 19의 제1 측면 부분의 D-D' 단면도이다. 도 20을 참고하면, 일 실시 예에 따른 지지 부재는 사이드 키를 기준으로 제1 방향(예: -x 방향)에 위치할 수 있다. 일 실시 예에 따르면, 전자 장치는 고정 부재를 포함할 수 있고, 고정 부재는 지지 부재 를 기준으로 제1 방향(예: -x 방향)에 위치할 수 있다. 예를 들어, 고정 부재는 지지 부재를 지지하거나 홈 내에 배치된 사이드 키를 홈 내에 고정할 수 있다. 일 실시 예에 따르면, 고정 부재는 비도전성 물질을 포함할 수 있다. 예를 들어, 고정 부재는 사출 물질로 형성될 수 있다. 예를 들어, 고정 부재는 지지 부재 및 사이드 키를 고정할 수 있다. 본 개시의 도 20에서는 전자 장치가 지지 부재 및 고정 부재를 포함하는 것으로 설명되었으나, 이는 일 예시일 뿐이다. 지지 부재 및 고정 부재 각각은 제1 지지 부재 및 제2 지지 부재라는 용어로 대체될 수 있다. 또 다른 예를 들어, 지지 부재 및 고정 부재 각각은 제1 고정 부 재 및 제2 고정 부재라는 용어로 대체될 수 있다. 본 개시에서 지지 부재라는 용어는 지지 플레이트, 지지 기판, 플레이트 또는 기판이라는 용어로 대체될 수 있다. 도 21은 사이드 키가 홈에 인입되기 전과 인입된 후를 비교하는 도면이다. 도 21을 참고하면, 일 실시 예에 따른 지지 부재는 제1 파트(part) 및 제2 파트를 포함할 수 있다. 예를 들어, 제1 파트는 사이드 키의 후면(예: 예: 도 3b의 후면(217b))에 접촉하여 사이드 키 를 지지하는 부분일 수 있다. 제2 파트는 제1 파트에서부터 연장되어 제1 파트를 지지 하기 위한 부분일 수 있다. 예를 들어, 제1 파트는 사이드 키를 홈 내에 고정하는 부분일 수 있고, 제2 파트는 제1 파트가 제1 측면 부분과 결합될 수 있도록 제1 파트를 지지하는 부분일 수 있다. 일 실시 예에 따르면, 제2 파트에는 홀이 형성될 수 있다. 예를 들어, 지지 부재의 제2 파트 에는 제1 도전성 연결 부재의 제1 연결 부분이 인입되기 위한 홀을 포함할 수 있다. 도 22는 일 실시 예에 따른 제1 도전성 연결 부재가 아닌 연결 부재를 통해 사이드 키의 도전성 부분에 급전하 는 무선 통신 회로를 설명하는 도면이다. 도 22를 참고하면, 일 실시 예에 따른 전자 장치는 연결 부재, 및/또는 무선 통신 회로, 그라 운드를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 연결 부재를 포함할 수 있다. 예를 들어, 전자 장치는 제1 도전성 연결 부재 이외에 사이드 키와 전기적으로 연결되는 연결 부재를 포함할 수 있다. 예를 들어, 연결 부재는 FPCB, 인쇄 회로 기판, 또는 FRC 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 연결 부재는 제1 필컷 영역, 접지 연결부 , 제1 도전성 연결 경로 및/또는 제2 도전성 연결 경로를 포함할 수 있다. 예를 들어, 제1 필컷 영역 및 접지 연결 부는 연결 부재(예: FPCB)에 형성되는 도전성 라인들이 외부로 노출되는 영역일 수 있다. 예를 들 어, 제1 필컷 영역은 제1 도전성 연결 경로가 노출되는 영역일 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제1 필컷 영역을 통해서 사이드 키의 도전성 부분 에 급전할 수 있다. 예를 들어, 무선 통신 회로는 제1 필컷 영역 상에 노출된 제1 도전성 연 결 경로 및 연결 부재(예: C-클립)를 통해 사이드 키의 도전성 부분의 일 지점에 급전할 수 있다. 예를 들어, 제1 필컷 영역 상에는 제1 도전성 연결 경로가 노출될 수 있고, 제1 도전성 연결 경로는 연결 부재을 통해 도전성 부분에 연결될 수 있다. 이 경우, 무선 통신 회로 는 제1 도전성 연결 경로 및 연결 부재를 통해 도전성 부분에 급전하여 지정된 주파수 대역의 RF 신호들을 송신 및/또는 수신할 수 있다. 일 실시 예에 따르면, 그라운드는 접지 연결부를 통해서 측면 부재의 제4 지점(G4)에 전기적 으로 연결될 수 있다. 예를 들어, 그라운드는 접지 연결부 상에 노출된 제2 도전성 연결 경로 를 통해 측면 부재 중 제1 측면 부분의 제4 지점(G4)에 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 연결 부재 상에 또는 연결 부재 내에 배치될 수 있 다. 예를 들어, 무선 통신 회로는 연결 부재의 복수의 도전성 레이어들 중 하나에 배치될 수 있다. 다만, 무선 통신 회로가 배치되는 위치는 연결 부재 상으로 한정되지 않으며, 무선 통신 회로 는 연결 부재 외의 다른 부품(예: 제1 인쇄 회로 기판)에 배치될 수 있다. 일 실시 예에 따르면, 그라운드는 연결 부재 상에 또는 연결 부재 내에 형성될 수 있다. 예 를 들어, 무선 통신 회로는 연결 부재의 복수의 도전성 레이어들 중 적어도 하나에 형성될 수 있다. 다만, 그라운드가 형성되는 위치는 연결 부재에 한정되지 않으며, 그라운드는 전자 장치 내에 포함되는 다양한 전기물(예: 제1 인쇄 회로 기판)에 형성될 수 있다. 일 실시 예에 따르면, 무선 통신 회로가 사이드 키의 도전성 부분에 급전함에 따라 도전성 부 분 및 홈이 형성된 제1 측면 부분에는 전기적 경로가 형성될 수 있다. 무선 통신 회로는 전기적 경로에 기반하여 RF 신호들을 송신 및/또는 수신할 수 있다. 본 개시의 도 22에서는 무선 통신 회로가 도전성 부분에 급전하는 것으로 설명되었으나 이는 일 예 시일 뿐이다. 예를 들어, 무선 통신 회로는 제4 지점(G4)에 급전할 수 있고, 그라운드는 도전성 부 분에 전기적으로 연결될 수 있다. 도 23은 일 실시 예에 따른 제1 필컷 영역을 포함하는 제1 연결 부재 및 제2 필컷 영역을 포함하는 제2 연결 부 재를 설명하는 도면이다. 도 23을 참고하면, 일 실시 예에 따른 전자 장치는 제1 연결 부재, 제2 연결 부재(예: FPCB), 무선 통신 회로 및/또는 스위치 회로를 포함할 수 있다. 일 실시 예에 따르면, 제1 연결 부재는 제1 도전성 연결 경로 및/또는 제2 도전성 연결 경로(231 2)를 포함할 수 있다. 예를 들어, 제1 도전성 연결 경로는 무선 통신 회로가 사이드 키의 제5 지점(F2)으로 급전하기 위한 전기적 경로일 수 있다. 일 예시에서, 무선 통신 회로는 제1 도전성 연결 경 로를 통해 사이드 키의 도전성 부분의 일 지점(예: 제5 지점(F2))에 급전할 수 있다. 예를 들어, 제2 도전성 연결 경로는 프로세서가 사이드 키를 제어하기 위한 신호를 전달하기 위한 경로일 수 있다. 일 실시 예에 따르면, 전자 장치는 제3 도전성 연결 경로를 포함할 수 있다. 예를 들어, 제3 도전성 연결 경로는 사이드 키의 무선 통신 회로와 스위치 회로 간의 연결을 제공하기 위한 경 로일 수 있다. 예를 들어, 무선 통신 회로 및/또는 프로세서는 제3 도전성 연결 경로를 통해 스위치 회로를 제어하기 위한 신호를 송신할 수 있다. 일 실시 예에 따르면, 스위치 회로는 제1 도전성 부분 및 제1 측면 부분을 전기적으로 연결하 거나 전기적으로 차단할 수 있다. 예를 들어, 스위치 회로는 프로세서 및/또는 무선 통신 회로 의 제어를 통해 제1 도전성 부분 및 제1 측면 부분을 전기적으로 연결하거나, 전기적으로 차단 할 수 있다. 본 개시의 도 23에서는 스위치 회로가 인접한 그라운드(또는, 도전성 부분들)의 연결을 제공하거나 연결 을 차단하는 것으로 설명되었으나 이는 일 예시일 뿐이다. 예를 들어, 스위치 회로는 적어도 하나의 럼프 드 엘리먼트(예: 인덕터, 또는 캐패시터)를 포함할 수 있다. 예를 들어, 스위치 회로는 적어도 하나의 럼 프드 엘리먼트를 통해 제1 도전성 부분과 제1 측면 부분을 연결하거나 연결하지 않음으로써 무선 통 신 회로가 제5 지점(F2)으로 급전함에 따라 형성되는 전기적 경로(예: 도 5의 전기적 경로)의 길이 를 조절할 수 있다. 예를 들어, 스위치 회로는 제1 인덕턴스 값을 가지는 제1 인덕터를 통해 제1 도전성 부분과 제1 측면 부분을 연결할 수 있고, 이 경우 안테나의 전기적 길이는 제1 인덕터를 연결하 지 않은 경우에 비해 길어질 수 있다. 예를 들어, 스위치 회로는 제1 캐패시턴스 값을 가지는 제1 캐패시 터를 통해 제1 도전성 부분과 제1 측면 부분을 연결할 수 있고, 이 경우 안테나의 전기적 길이 는 제1 캐패시터를 연결하지 않은 경우에 비해 짧아질 수 있다. 일 실시 예에 따르면, 제1 연결 부재(예: FPCB)는 필컷 영역을 포함할 수 있고, 제1 도전성 연결 경로는 필컷 영역 상에서 도전성 연결 부재(예: C-클립, 도전성 가스켓)와 전기적으로 연결 될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 제1 도전성 연결 경로 및 도전성 연결 부재를 통해 사이드 키의 제5 지점(F2)에 급전할 수 있다. 본 개시의 도 23의 스위치 회로는 도 14의 스위치 회로에 대응할 수 있고, 도 14의 스위치 회로 에 대한 설명은 스위치 회로에 적용될 수 있다. 일 실시 예에 따르면, 전자 장치는 디스플레이, 후면 커버, 디스플레이 및 후면 커버 사이의 공간을 둘러싸고 홈이 형성되는 측면 부재, 홈 내에 배치되고 도전성 부분을 포함 하는 사이드 키, 무선 통신 회로, 적어도 하나의 프로세서, 및 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 포함할 수 있다. 무선 통신 회로는 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 통해 홈 의 가장자리를 둘러싸는 측면 부재의 제1 부분에 급전하고, 측면 부재의 제1 부분 및 사이드 키의 도전성 부분에 형성되는 전기적 경로에 기반하여 지정된 주파수 대역의 RF(radio frequency) 신호들을 송신 및/또는 수신하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치는 홈의 제1 단(250a)과 인접한 측면 부재의 일 부분에서부터 제1 단 (250a)으로부터 홈의 제2 단(250b)을 향하는 방향으로 연장되는 제1 돌출부 및 제1 돌출부와 사 이드 키의 제1 도전성 연결 부재 사이에 배치되는 제2 도전성 연결 부재를 더 포함할 수 있다. 무선 통신 회로는 제1 도전성 연결 부재, 제2 도전성 연결 부재 및 제1 돌출부를 통해 측 면 부재의 제1 부분에 급전하도록 설정되고, 제2 도전성 연결 부재는 C-클립(C-clip) 또는 도전 성 가스켓 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 전자 장치는 홈의 제2 단(250b)과 인접한 측면 부재의 일 부분에서부터 제2 단(250b)으로부터 제1 단(250a)을 향하는 방향으로 연장되는 제2 돌출부, 제2 돌출부와 사이드 키의 제1 도전성 연결 부재 사이에 배치되는 제3 도전성 연결 부재 및 제1 도전성 연결 부재 및 상기 제3 도전성 연결 부재를 통해 제2 돌출부와 전기적으로 연결된 스위치 회로를 더 포함할 수 있다. 제3 도전성 연결 부재는 C-클립 또는 도전성 가스켓 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 스위치 회로는 무선 통신 회로가 배치된 제1 인쇄 회로 기판에 포함된 그라운드와 전기적으로 연결되고 적어도 하나의 럼프드 엘리먼트를 포함하고, 스위치 회로는 적어도 하나의 럼프드 엘리먼트를 이용하여 전기적 경로의 길이를 변경함으로써 지정된 주파수 대역을 조절하도 록 설정될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 상기 제1 도전성 연결 부재를 통해 상기 스위치 회로를 제어 하기 위한 제어 신호를 송신하도록 설정될 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재는 제1 부분에 급전하기 위한 제1 도전성 경로 및 사이드 키로부터 송신되는 신호를 전달하기 위한 제2 도전성 경로를 포함하고, 제1 도전성 연결 부재 는 제1 도전성 경로가 노출된 필컷 영역(353a)을 포함하고, 필컷 영역(353a) 상에서 상기 제1 도전성 경로는 제2 도전성 연결 부재와 연결될 수 있다. 일 실시 예에 따르면, 사이드 키는 도전성 부분의 가장자리를 따라 배치되는 비도전성 부분을 더 포함하고, 비도전성 부분은 사이드 키의 도전성 부분 및 측면 부재의 제1 부분 사 이에 배치될 수 있다. 일 실시 예에 따르면, 전자 장치는 도전성 물질을 포함하는 지지 부재를 더 포함하고, 지지 부재 는 홈 내에 배치되는 사이드 키의 후면에 접하여(contact) 사이드 키를 상기 홈 내 에 고정할 수 있다. 일 실시 예에 따르면, 측면 부재는 도전성 물질을 포함하고, 심리스한(seamless) 루프 형상(loop shape)으 로 상기 전자 장치의 측면(210C)을 형성하고, 측면 부재의 제1 부분 및 사이드 키는 단차 없이(without steps) 상기 전자 장치의 일 측면을 형성할 수 있다. 일 실시 예에 따르면, 무선 통신 회로 및 적어도 하나의 프로세서가 배치되는 제1 인쇄 회로 기판 을 더 포함하고, 적어도 하나의 프로세서는 제1 인쇄 회로 기판과 전기적으로 연결된 제1 도전 성 연결 부재를 통해 사이드 키에게 제어 신호를 송신하거나, 제1 도전성 연결 부재를 통해 사 이드 키로부터 신호를 수신하도록 설정될 수 있다. 제1 도전성 연결 부재는 FPCB(flexible printed circuit board) 또는 FRC(flexible RF cable) 중 적어도 하나이고, 제1 도전성 연결 부재는 제1 인쇄 회로 기판의 커넥터와 연결되는 제1 연결 부분, 및 제1 도전성 연결 부재의 상기 제1 연결 부분과 연결되고 사이드 키의 후면(217b)을 형성하는 제2 연결 부분을 포함할 수 있다. 일 실시 예에 따르면, 무선 통신 회로가 측면 부재의 제1 부분에 급전함에 따라 홈의 가장 자리를 둘러싸는 제1 부분 및 사이드 키의 도전성 부분의 가장자리에는 전기적 경로가 형 성되고, 제1 부분 및 도전성 부분의 상기 가장자리는 전자기적으로 연결되도록 이격될 수 있다. 일 실시 에에 따르면, 측면 부재의 내측면에 형성되는 비도전성 부재 더 포함하고, 비도전성 부재에는 상 기 홈과 적어도 일부가 중첩되는 개구를 포함하고, 개구는 사이드 키가 상기 홈으로 인입 되기 위한 것일 수 있다. 일 실시 예에 따르면, 개구는 홈과 중첩되는 제1 영역 및 상기 제1 영역으로부터 연장되며 측면 부재와 중첩되는 제2 영역을 포함할 수 있다. 무선 통신 회로와 상기 측면 부재를 연결하기 위 한 제2 도전성 연결 부재는 상기 제2 영역을 통해 측면 부재와 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 제1 도전성 연결 부재는 FPCB(flexible printed circuit board), PCB, 상기 사이드 키에 포함된 터치 패널의 일부 또는 FRC(flexible RF cable) 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 사이드 키는 터치 패널을 포함하고, 사이드 키는 상기 터치 패널에 대한 사용 자의 터치 입력을 식별하거나 상기 터치 패널에 가해지는 압력을 식별하고. 상기 적어도 하나의 프로세서에게 상기 터치 입력 또는 상기 압력에 기반하여 상기 사용자의 입력이 존재함을 지시하는 신호를 송신하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치는 홈이 형성되고 상기 전자 장치의 측면을 형성하는 측면 부재 , 홈 내에 배치되고 도전성 부분을 포함하는 사이드 키, 무선 통신 회로, 적어도 하나의 프로세서 및 적어도 하나의 프로세서 및 상기 사이드 키를 전기적으로 연결하는 제1 도전성 연결 부재를 포함할 수 있다. 무선 통신 회로는 적어도 하나의 프로세서와 사이드 키를 전기적으로 연결하는 상기 제1 도 전성 연결 부재를 통해 상기 홈의 가장자리를 둘러싸는 상기 측면 부재의 제1 부분에 급전하고, 상기 측면 부재 의 상기 제1 부분 및 상기 사이드 키의 상기 도전성 부분에 형성되는 전기적 경로에 기반하여 지정된 주파수 대 역의 RF(radio frequency) 신호들을 송신 및/또는 수신하도록 설정될 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 홈의 제1 단(end)과 인접한 상기 측면 부재의 일 부분에서부터 상 기 제1 단으로부터 상기 홈의 제2 단을 향하는 방향으로 연장되는 제1 돌출부 및 상기 제1 돌출부와 상기 사이 드 키의 상기 제1 도전성 연결 부재 사이에 배치되는 제2 도전성 연결 부재를 더 포함하고, 무선 통신 회로 는 상기 제1 도전성 연결 부재, 상기 제2 도전성 연결 부재 및 상기 제1 돌출부를 통해 상기 측면 부재의 상기 제1 부분에 급전하도록 설정될 수 있다. 상기 제2 도전성 연결 부재는 C-클립(C-clip) 또는 도전성 가스켓 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 홈의 상기 제2 단과 인접한 상기 측면 부재의 일 부분에서부터 상기 제2 단으로부터 상기 제1 단을 향하는 방향으로 연장되는 제2 돌출부, 상기 제2 돌출부와 상기 사이드 키의 상기 제1 도전성 연 결 부재 사이에 배치되는 제3 도전성 연결 부재 및 상기 제1 도전성 연결 부재 및 상기 제3 도전성 연결 부재를 통해 상기 제2 돌출부와 전기적으로 연결된 스위치 회로를 더 포함할 수 있다. 상기 제3 도전성 연결 부재는 C- 클립 또는 도전성 가스켓 중 적어도 하나일 수 있다. 일 실시 예에 따르면, 상기 스위치 회로는 상기 무선 통신 회로가 배치된 인쇄 회로 기판에 포함된 그라운드와 전기적으로 연결되고 적어도 하나의 럼프드 엘리먼트를 포함하고, 상기 스위치 회로는 상기 적어도 하나의 럼프 드 엘리먼트를 이용하여 상기 전기적 경로의 길이를 변경함으로써 상기 지정된 주파수 대역을 조절하도록 설정 될 수 있다. 일 실시 예에 따르면, 무선 통신 회로는 상기 제1 도전성 연결 부재를 통해 상기 스위치 회로를 제어하기 위한 제어 신호를 송신하도록 설정될 수 있다.도면 도면1 도면2a 도면2b 도면2c 도면2d 도면3a 도면3b 도면4a 도면4b 도면5 도면6 도면7 도면8 도면9a 도면9b 도면10a 도면10b 도면10c 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23"}
{"patent_id": "10-2023-0152907", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도 2a는 일 실시 예에 따른 전자 장치를 나타내는 사시도이다. 도 2b는 도 2a의 전자 장치를 후면에서 바라본 모습을 나타내는 사시도이다. 도 2c는 일 실시 예에 따른 전자 장치의 측면 부재 및 사이드 키를 설명하는 도면이다. 도 2d는 일 실시 예에 따른 전자 장치의 분해도이다. 도 3a는 일 실시 예에 따른 홈 내에 배치된 사이드 키와 연결된 무선 통신 회로 및 프로세서를 설명하는 도면이 다. 도 3b는 일 실시 예에 따른 홈 내에 배치되는 사이드 키를 설명하는 도면이다. 도 4a는 일 실시 예에 따른 전자 장치의 외부에서부터 홈 내로 인입되는 사이드 키를 설명하는 도면이다. 도 4b는 일 실시 예에 따른 사이드 키가 홈에 인입된 경우에 제1 측면 부분에 급전하는 무선 통신 회로를 설명 하는 도면이다. 도 5는 일 실시 예에 따른 무선 통신 회로가 측면 부재에 급전함에 따라 측면 부재 및 사이드 키의 도전성 부분 에 형성되는 전기적 경로를 설명하는 도면이다. 도 6은 일 실시 예에 따른 제1 부분의 A-A' 단면도이다. 도 7은 일 실시 예에 따른 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때 홈의 가장자리 및 사이드 키의 가장자리를 따라 형성되는 전류 분포를 도시한다. 도 8은 일 실시 예에 따른 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때의 방사 효율 그래프이다. 도 9a는 일 실시 예에 따른 전자 장치의 내부에서 외부를 향하는 방향으로 홈에 결합되는 사이드 키를 설명하는 도면이다. 도 9b는 일 실시 예에 따른 전자 장치의 내부에서 사이드 키가 홈에 결합되는 경우에 홈을 고정하기 위한 고정 부재를 설명하는 도면이다.도 10a는 일 실시 예에 따른 측면 부재의 B-B' 단면도이다. 도 10b는 일 실시 예에 따른 도 10a에 도시된 홈이 사이드 키로 인입되기 전과 인입된 후를 설명하는 도면이다. 도 10c는 일 실시 예에 따른 고정 부재가 제1 측면 부분 내에 형성되는 경우에 사이드 키가 홈에 인입되는 과정 을 설명하는 도면이다. 도 11은 일 실시 예에 따른 도 10a의 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때 홈의 가장자리 및 사이드 키의 가장자리를 따라 형성되는 전류 분포를 도시한다. 도 12는 일 실시 예에 따른 도 10a의 무선 통신 회로가 홈을 포함하는 측면 부재에 급전했을 때의 방사 효율 그 래프이다. 도 13은 일 실시 예에 따른 제2 돌출부를 포함하는 전자 장치를 설명하는 도면이다. 도 14는 일 실시 예에 따른 복수의 필컷 영역들을 포함하는 사이드 키와 복수의 돌출부들을 포함하는 측면 부재 를 설명하는 도면이다. 도 15는 일 실시 예에 따른 도 14의 측면 부재의 C-C' 단면도이다. 도 16은 일 실시 예에 따른 제3 도전성 경로에 연결된 럼프드 엘리먼트에 따른 홈 및 사이드 키를 포함하는 안 테나의 방사 효율 그래프이다. 도 17은 일 실시 예에 따른 측면 부재와 무선 통신 회로를 연결하는 C-클립을 설명하는 도면이다. 도 18은 일 실시 예에 따른 사이드 키를 지지하고, 도전성 물질을 포함하는 지지 부재를 설명하는 도면이다. 도 19는 일 실시 예에 따른 도전성 물질을 포함하는 지지 부재의 홀에 인입되는 사이드 키를 설명하는 도면이다. 도 20은 도 19의 제1 측면 부분의 D-D' 단면도이다. 도 21은 사이드 키가 홈에 인입되기 전과 인입된 후를 비교하는 도면이다. 도 22는 일 실시 예에 따른 제1 도전성 연결 부재가 아닌 연결 부재를 통해 사이드 키의 도전성 부분에 급전하 는 무선 통신 회로를 설명하는 도면이다. 도 23은 일 실시 예에 따른 제1 필컷 영역을 포함하는 제1 연결 부재 및 제2 필컷 영역을 포함하는 제2 연결 부 재를 설명하는 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
