{"patent_id": "10-2024-0133378", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0151678", "출원번호": "10-2024-0133378", "발명의 명칭": "계측, 측량, 측정, 관측, 진단, 조사, 탐사, 관리, 감리, 모니터링을 하는 드론, 장비, 장치,", "출원인": "주식회사 한국산업기술원", "발명자": "정하익"}}
{"patent_id": "10-2024-0133378", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시설의 계측이나 모니터링에 이용되는 드론으로서, 상기 드론이 상기 시설의 주변에 거치되고, 상기 드론에 스캐너가 구비되고,상기 드론의 비행 중에 상기 스캐너에 의하여 상기 시설이 스캐닝되고,상기 스캐너에 이격되어 상기 드론에 게이지가 구비되고,상기 스캐닝의 후에 상기 드론이 비행하여 상기 게이지를 상기 시설에 접촉시키고, 상기 시설에 접촉된 게이지에 의하여 상기 시설의 균열 크기가 조사되고, 상기 게이지에 이격되어 상기 드론에 카메라가 구비되고,상기 드론의 비행 중에 상기 카메라에 의하여 상기의 시설, 스캐너, 게이지와 하기의 사운딩기, 슈미트해머, 틸트미터, 열화상기, 위성항법장치, 측정의 지점 및 측정의 장면이 촬영되고,상기 카메라에 이격되어 상기 드론에 사운딩기가 구비되고,상기 사운딩기에 센서가 장착되고,상기 센서는 강성을 측정하는 센서이고, 상기 드론이 비행하여 상기 사운딩기의 센서를 상기 시설에 접촉시키고, 상기 시설에 접촉된 센서에 의하여 상기 시설의 강성이 측정되고, 상기 사운딩기에 이격되어 상기 드론에 슈미트해머가 구비되고,상기 강성의 측정 후에 상기 드론이 비행하여 상기 슈미트해머를 상기 시설에 접촉시키고, 상기 시설에 접촉된 슈미트해머에 의하여 상기 시설의 강도가 계측되고, 상기 슈미트해머에 이격되어 상기 드론에 틸트미터가 구비되고,상기 강도 계측의 후에 상기 드론이 비행하여 상기 틸트미터를 상기 시설에 거치시키고, 상기 시설에 거치된 틸트미터에 의하여 상기 시설의 수직도가 관측되고, 상기 틸트미터에 이격되어 상기 드론에 열화상기가 구비되고,상기 드론의 비행 중에 상기 열화상기에 의하여 상기 시설의 열이 모니터링되고, 상기 열화상기에 이격되어 상기 드론에 위성항법장치가 구비되고,상기 위성항법장치에 의하여 상기 드론의 비행 중에 상기 시설의 위치가 탐사됨에 더하여, 상기 강성, 강도, 균열 크기, 수직도 및 열의 측정 중에 상기 강성 내지 열의 측정 지점에 대한 위치가 탐사되고,상기 스캐너, 게이지, 카메라, 사운딩기, 슈미트해머, 틸트미터, 열화상기, 위성항법장치의 기구에 전기를 공급하는 배터리가 상기 드론에 구비되고, 상기 드론을 조종하는 조종사에 조종기와 핸드폰이 구비되고,상기 계측이나 모니터링에 관련되는 작업자에 무전기와 스마트폰이 구비되고,상기 무전기에 마이크와 스피커가 포함되고, 상기 기구에 통신장치가 연계되고, 공개특허 10-2024-0151678-3-상기 통신장치를 통하여 상기 스캐닝, 조사, 촬영, 측정, 계측, 관측, 모니터링 및 탐사의 정보가 송신되고, 상기 통신장치에 통신망이 연계되고, 상기 통신망에 서버가 연계되고, 상기 서버에 단말기가 연계되고, 상기 서버와 단말기가 중앙관제센터에 구비되고, 상기 핸드폰에 핸드폰용 앱이 설치되고, 상기 스마트폰에 스마트폰용 앱이 설치되고, 상기 단말기에 단말기용 앱이 설치되고, 상기 핸드폰과 스마트폰과 상기 단말기는 상호 연계 또는 통화되고, 상기 작업자에 구비된 무전기와 상기 중앙관제센터에 구비된 무전기가 상호 연계 또는 통화되고, 상기 조종사와 작업자와 상기 중앙관제센터에 근무하는 관리자 간에 통화 시스템이 구축되고,상기 송신의 정보가 상기 서버, 핸드폰용 앱, 단말기용 앱, 스마트폰용 앱 및 중앙관제센터에 수신되고, 상기 수신된 정보가 상기 계측이나 모니터링에 이용되는 것을 특징으로 하는 드론"}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 a) 계측, 측량, 측정, 관측, 진단, 조사, 탐사, 관리, 감리, 모니터링; b) 이중 하나를 하는 방법, 장 비, 장치, 드론, 센서, 계측기, 시스템; c) 상기 장비 내지 시스템 등에 연계되는 비콘, 게이트웨이, 통신장치, 통신망, 서버, 처리장치, 단말기, 관제센터; d) 상기 방법 내지 관제센터 등에 이용되는 하드웨어, 소프트웨어, 어플리케이션; e) 상기 계측 내지 어플리케이션 등에 관련되는 방법, 공법, 시스템, 진단시스템, 작업시스템, 무 인시스템; 등에 관한 것이다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시설, 건물, 주택, 교량, 도로, 터널, 시설물, 구조물 등에 대하여 계측, 측량, 측정, 관측, 진단, 조사, 탐사, 관리, 감리, 작업, 모니터링 등을 하는 드론, 장비, 장치, 센서, 방법, 계측기, 시스템에 관한 것 이다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 상기 시설 내지 구조물 등에 대한 체계적이며 효과적인 안전관리가 무엇보다 중요하다. 상기 시설 내지 구조물 등에 내재되어 있는 다양한 환경으로 인해 사고 및 재해가 발생될 수 있다. 이의 발생을 저감시키 기 위해서는 상기 시설 내지 구조물 등에 대한 상기 계측 내지 모니터링 등이 필요하다. 최근 상기 계측 내지 모니터링 등에 있어서 무인화, 자동화, 기계화, 로봇화, 안전화, 시스템화, 자동제어, 원격제어, 오토메이션 등 이 요구되고 있다. 현재 각종 분야에서 IT, IC, AI, VR, AR, MR, 5G, ICT, IoT, IoE, BIM, LTE, WiFi, 융합기 술, 빅데이터, 클라우드, 웨어러블, 4차산업기술 등이 이용되고 있다. 이의 새로은 기술이 상기의 계측 내지 모 니터링 등에 이용된다면 매우 유익할 것이다. 이상의 문제점을 개선하기 위하여 안전, 사고방지, 재해방지, 안 전화, 무인화, 자동화, 기계화 등에 대한 관리, 대책, 대안, 기술, 방법, 공법, 방안, 시스템 등의 고안이 필요 한 실정이다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 일정수단, 안전수단, 필드수단, 웨어러블수 단, 드론, 장비, 장치, 센서, 계측기 등을 이용하여 상기 계측 내지 모니터링 등의 작업을 하는 방법, 공법, 시 스템의 구축을 목적으로 한다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여 본 발명에서는 a) 작업자와 관리자에 착용되는 웨어러블 수단; b) 작 업에 이용되는 드론, 항공기, 장치, 장비; c) 상기 시설 내지 구조물, 수단 내지 장비 등에 구비되는 센서, 카 메라, 무전기, 계측기; d) 상기 수단 내지 계측기 등에 연계되는 LTE, WiFi, 비콘, 게이트웨이, 통신장치, 통신 망, 서버, 클라우드, 처리장치, 단말기, 관제센터; e) 상기 수단 내지 관제센터 등에 이용되는 하드웨어, 소프트웨어, 어플리케이션; f) 상기 수단 내지 어플리케이션 등이 이용되는 상기 계측 내지 모니터링; g) 상기 수단 내지 모니터링 등에 관련되는 방법, 공법, 작업, 대책; h) 상기 수단 내지 대책 등이 반영되는 시스템, 진단시 스템, 안전관리시스템; 등을 고안하거나, 또는 등을 하고자 한다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서는 a) 일정 수단, 필드 수단, 웨어러블 수단, 드론, 장비, 장치, 센서, 카메라, 계측기, 통신장치, 통신망, 서버, 단말기, 클라우드, 빅데이터, 처리장치 등을 고안하고, b) 상기 수단 내지 처리장치 등에 의하여 상기 계측 내지 모니터링 등을 하고, c) 상기 수단 내지 처리장치, 계측 내지 모니터링 등에 의하여 사고방지, 재해방지, 무인화, 자동화, 시스템화 등을 하고, d) 최종적으로 효율적이고 체계적인 상기 수단 내지 안전관리 시스템 등을 구축하는 효과를 제공한다. 그리고 a) 최적의 작업 방법을 고안하고, b) 상기 IT 내지 4차산업기술 등을 적용하고, c) 상기 계측 내지 모니터링 등에 대한 적정의 관리, 대책, 대안, 기술, 방법, 공법, 작업, 방 안, 시스템 등을 제공하는 효과를 가진다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 청구항 1은 시설이나 시설물을 계측, 측량, 관측, 진단, 조사, 탐사, 관리, 감리, 안전, 작업, 모니 터링 등을 하는 또는 등에 이용되는 또는 등을 하게 하는 드론, 장비, 장치, 시스템, drone, 항공기, 비행기, 무인항공기, 소형항공기, 미니항공기, 소형무인항공기, 모빌리티 등에 관한 것이다. 상기 드론 내지 모빌리티 등이 상기 시설의 주변에 거치된다. 상기 시설의 주변에 드론이 거치된다. 상기 드론에 스캐너, 3D스캐너, 레이 저 스캐너 등이 구비된다. 상기 드론의 비행 중에 상기 스캐너; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등에 의하여 상기 시설이 스캐닝 또는 3차원 스캐닝된다. 상기 스캐너에 이격되어 상기 드론 에 게이지, gauge, 변형계, 변위계, 스트레스게이지, strain gauge, 스트레인게이지 등이 구비된다. 상기 스캐 닝의 후에 상기 드론이 비행이나 이동하여 상기 게이지; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등을 상기 시설에 상기 접촉 내지 압착 등을 시키고, 상기 시설에 접촉된 상기 게이지 내지 키트 등에 의하여 상기 시설의 균열, 크랙, 손상, 균열 크기, 크랙 크기, 손상 크기 등이 조사나 측정된다. 상기 게이지에 이격되어 상기 드론에 캠, 웹캠, 카메라, 사진기, 촬영기, CCTV, 무선카메라, LTE카메라 등이 구 비된다. 상기 드론의 비행 중에 상기 캠 내지 LTE카메라 등에 의하여 상기의 시설, 스캐너, 게이지와 하기의 사 운딩기, 슈미트해머, 틸트미터, 열화상기, 위성항법장치, 측정의 지점 및 측정의 장면이 촬영된다. 상기 카메라 에 이격되어 상기 드론에 사운딩기, Sounding Unit, 센서, 측정센서, 물리탐사기, 자기탐사기, 전자탐사기, 음 파탐지기, 초음파탐지기 등이 구비된다. 상기 드론이 비행이나 이동하여 상기 사운딩기; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등을 상기 시설에 접촉, 접근, 밀착, 위치, 거치, 정착, 밀착, 압 착 등을 시키고, 상기 시설에 접촉된 상기 사운딩기 내지 키트 등에 의하여 상기 시설의 강성이 측정이나 관측 된다. 상기의 예로는 드론에 사운딩기가 구비되고, 상기 사운딩기에 센서가 장착되고, 상기 센서는 강성을 측정 하는 센서이고, 상기 드론이 비행하여 상기 사운딩기의 센서를 상기 시설에 접촉시키고, 상기 시설에 접촉된 센 서에 의하여 상기 시설의 강성이 측정되는 것이다. 상기 사운딩기에 이격되어 상기 드론에 해머, 강도계, 슈미 트해머 등이 구비된다. 상기 강성의 측정 후에 상기 드론이 비행이나 이동하여 상기 슈미트해머; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등을 상기 시설에 상기 접촉 내지 압착 등을 시키고, 상기 시설에 접촉된 상기 슈미트해머 내지 키트 등에 의하여 상기 시설의 강도가 계측이나 측정된다. 상기 해머에 이격되어 상기 드론에 틸트미터, tilt meter, 인클리노미터, inclinometer, 경사계, 건물경사계, 건물기울계 등이 구비된다. 상기 균열 크기의 측정 후에 상기 드론이 비행이나 이동하여 상기 틸트미터; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등을 상기 시설에 상기 접촉 내지 압착 등을 시키 고, 상기 시설에 거치된 상기 틸트미터 내지 키트 등에 의하여 상기 시설의 수직도 또는 경사가 관측이나 측정 된다. 상기 틸트미터에 이격되어 상기 드론에 열화상기, 화상기, 열화상카메라 등이 구비된다. 상기 드론의 비 행 중에 상기 열화상기; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등에 의하여 상기 시설의 열이 모니터링되거나 측정된다. 상기 열화상기에 이격되어 상기 드론에 위성항법장치, 衛星航法裝置, GPS, GPS장치, GPS시스템, 위치추적장치, GPS추적기, global positioning system, 위성항법시스템 등이 구비된다. 상기 위성항법장치; 이의 칩, 핀, 침, 끌, 소자, 단자, 전극, 자침, 헤드, 센서, 키트; 등에 의하여 상기 드론의 비행 중에 상기 시설의 위치 또는 좌표가 탐사됨에 더하여, 상기 강성, 강도, 균열 크기, 수직도 및 열 의 측정 중에 상기 강성 내지 열의 측정 지점에 대한 위치 또는 좌표가 탐사나 측정된다. 상기 스캐너, 게이지, 카메라, 사운딩기, 슈미트해머, 틸트미터, 열화상기, 위성항법장치 등은 하기의 계측기에 속하고, 이의 계측기에는 하기의 센서가 속하기 때문에 상기 스캐너 내지 위성항법장치 등은 하기의 센서가 수 행할 수 있는 하기 위치 내지 복합 등을 측정, 센싱, 계측, 관측, 관찰, 탐지, 감지, 감식, 모니터링 등을 할 수가 있다. 드론에는 센서 또는 계측기가 구비될 수 있기 때문에 상기와 같이 드론에 상기 스캐너 내지 위성항 법장치 등이 구비되는 것이고, 드론에 구비된 상기 스캐너 내지 위성항법장치 등이 하기 위치 내지 복합 등을 측정, 센싱, 계측, 관측, 관찰, 탐지, 감지, 감식, 모니터링 등을 하는 것이다. 상기 스캐너, 게이지, 카메라, 사운딩기, 슈미트해머, 틸트미터, 열화상기, 위성항법장치의 기구에 전기를 공급하는 배터리가 상기 드론에 구 비된다. 상기 배터리는 상기 스캐너 내지 위성항법장치 등에 이격되어 상기 드론에 구비될 수 있다. 상기 기구 는 상기 스캐너 내지 위성항법장치가 해당된다. 상기 기구와 배터리 사이에 전선이 연결되고, 상기 배터리는 충 전기, 발전기 등에 연계될 수 있다. 상기 드론을 조종하는 조종사에 조종기와 핸드폰이 구비되고, 상기 계측이 나 모니터링에 관련되는 작업자에 무전기와 스마트폰이 구비된다. 상기 무전기에 마이크와 스피커가 포함된다. 상기 기구에 통신장치가 연계된다. 상기 통신장치에 LTE, WiFi, Bluetooth, 비콘(beacon), 게이트웨이 포함될 수 있다. 상기 통신장치를 통하여 상기 스캐닝, 조사, 촬영, 측정, 계측, 관측, 모니터링 및 탐사의 정보가 송 신된다. 상기 정보에 상기 스캐닝, 조사, 촬영, 측정, 계측, 관측, 모니터링, 탐사 등의 또는 관련 정보, 수치, 장면, 영상, 자료, 데이터 등이 포함될 수 있다. 상기 통신장치에 통신망이 연계되고, 상기 통신망에 서버가 연 계되고, 상기 서버에 단말기가 연계된다. 상기 단말기에 컴퓨터, 모니터, 스크린, 핸드폰, 태블릿 등이 포함될 수 있다. 상기 서버와 단말기가 중앙관제센터에 구비된다. 상기 핸드폰에 핸드폰용 앱이 설치되고, 상기 스마트 폰에 스마트폰용 앱이 설치되고, 상기 단말기에 단말기용 앱이 설치된다. 상기 핸드폰과 스마트폰과 상기 단말 기는 상호 연계 또는 통화되고, 상기 작업자에 구비된 무전기와 상기 중앙관제센터에 구비된 무전기가 상호 연 계 또는 통화된다. 상기 조종사와 작업자와 상기 중앙관제센터에 근무하는 관리자 간에 통화 시스템이 구축된다. 상기 송신의 정보가 상기 서버, 단말기, 핸드폰, 스마트폰, 핸드폰용 앱, 단말기용 앱, 스마트폰용 앱, 조종사, 작업자 및 중앙관제센터에 수신되고, 상기 수신된 정보가 상기 계측이나 모니터링에 이용된다. 본 발명은 일정의 수단, 필드수단, 웨어러블수단, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리, 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기, 드론, 장비, 장치, 로봇, 아바타, 청정기, 정화기, 살균기, 소독기, 방역기, 통신장치, 통신망, 서버, 처리장치, 단말기, 클 라우드, 어플, 사물, 만물, 물질, 재료, 자재, 에코재, 바이오재, 자동관리시스템, 환경관리시스템, 안전관리시 스템, 이중 둘 이상이 조합된 복합수단 등이 이용되는 a) 일, 작업, 업무, 제조, 생산, 공사, 건설, 안전, 제어, 케어, 사고방지, 재해방지, 안전화, 무인화, 자동화, 기계화, 로봇화, 고품질화, 청정, 정화, 살균, 소독, 방역, 방제; b) 이중 하나의 앱, 관리, 운영, 대책, 대안, 기술, 기법, 방법, 공법, 방안, 시스템, 플랫 폼, 제어기, 컨트롤러, 메타버스; 등에 관한 것이다. 본 발명은 a) 일정의 수단, 사람, 인간, 로봇, 동물, 작업자, 근로자, 출입자, 아바타, 장비, 삼각대, 거치대; b) 이중 하나에 착용된 필드수단, 웨어러블수단, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리; c) 상기 수단 내지 안전고리 등에 구비된 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기; d) 또는 현장, 공장, 농장, 가정, 작업장 등에 구비된 물질, 재료, 자재, 에코재, 바이 오재, 드론, 장비, 장치, 제품, 가전, 로봇, 청정기, 정화기, 살균기, 소독기, 방역기; e) 상기 사람 내지 방역 기 등에 연계되는 통신장치, 통신망, 서버, 처리장치, 단말기, 클라우드; f) 상기 수단 내지 클라우드 등에 설 치되는 앱, 어플; g) 상기 수단 내지 어플 등이 포함되는 사물, 만물; h) 상기 수단 내지 만물 등이 이용되는 일, 작업, 업무, 제조, 생산, 공사, 건설, 안전, 제어, 케어; i) 상기 수단 내지 케어 등에 의한 사고방지, 재 해방지, 안전화, 무인화, 자동화, 기계화, 로봇화, 고품질화, 청정, 정화, 살균, 소독, 방역, 방제; j) 상기 수 단 내지 방제 등을 제어하는 조종기, 제어기, 컨트롤러, 리모트컨트롤; k) 상기 수단 내지 리모트컨트롤 등에 관한 앱, 관리, 운영, 대책, 대안, 기술, 기법, 방법, 공법, 방안, 시스템, 플랫폼, 메타버스; ℓ) 상기 수단 내지 메타버스 등을 관리하는 관리시스템, 자동관리시스템, 품질관리시스템, 환경관리시스템, 안전관리시스템; m) 상기 수단 내지 안전관리시스템 중 둘 이상이 조합된 복합수단; 등에 관한 것이다. 본 발명에서는 1) 웨어러블 수단이 구비; 2) 상기 웨어러블 수단의 전면 또는 내부에 센서가 구비; 3) 상기 센서에 이격되면서 상기 전면에 SOS버튼이 구비; 4) 상기 버튼에 이격되면서 상기 전면에 랜턴(1 3)이 구비; 5) 상기 랜턴에 이격되면서 상기 전면에 카메라가 구비; 6) 상기 카메라에 이격되면서 상기 전면에 무전기가 구비; 7) 상기 무전기에 마이크와 스피커가 포함; 8) 상기 무전기에 이격되면서 상기 전면에 알림기가 구비; 9) 상기 알림기에 이격되면서 상기 전면에 계측기가 구비; 10) 상기 수단의 후면에 램 프가 구비; 11) 상기 램프에 이격되면서 상기 후면에 카메라'가 구비; 12) 상기 카메라에 이격되면서 상기 후면에 제어기가 구비; 13) 상기 수단이 작업자에 착용; 14) 상기 작업자에 스마트폰이 구 비; 15) 상기 센서, SOS버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기, 스마트폰 중에서 선택된 하나 이상의 기구에 전기를 공급하는 배터리가 구비; 16) 상기 배터리가 내장되는 포켓(20')이 상기 수 단에 형성; 17) 상기 기구와 배터리 사이에 전선이 연결; 18) 상기 작업자의 작업 시에 상기 센서가 작동; 19) 상기 작업 중에 상기 카메라에 의하여 작업 장면이 촬영; 20) 상기 SOS버튼은 비상 시에 상기 작업 자에 의하여 눌려짐; 21) 상기 기구에 통신장치가 연계; 22) 상기 통신장치에 LTE, WiFi, Bluetooth, 비콘(beacon), 게이트웨이 중에서 선택된 하나가 포함; 23) 상기 통신장치에 통신망이 연계; 24) 상기 통신 장치 또는 통신망에 서버가 연계; 25) 상기 서버 또는 통신망에 단말기가 연계; 26) 상기 단말기에 컴 퓨터, 모니터, 스크린, 핸드폰, 태블릿 중에서 선택된 하나가 포함; 27) 상기 서버와 단말기가 중앙관제센터 에 구비; 28) 상기 스마트폰에 스마트폰용 앱이 설치; 29) 상기 단말기에 단말기용 앱이 설치; 30) 상기 스마트폰과 상기 단말기는 상호 연계 또는 통화; 31) 상기 수단에 구비된 무전기와 상기 중앙관제센터 에 구비된 무전기가 상호 연계 또는 통화; 32) 상기 작업자와 상기 중앙관제센터에 근무하는 관리자 또는 총괄자 간에 통화 시스템이 구축; 33) 상기 수단 또는 기구에 자기장기가 구비; 34) 상기 자기장기에 의하여 상기 작업자에 자기장이 방사; 35) 상기 수단, 기구, 센터, 작업자 중 하나 이상이 소독; 36) 상기 수단 또는 기구 또는 센터에 오존기가 구비; 37) 상기 오존기에 의하여 오존이 발생; 38) 상기 오존기에 이격되면서 상기 수단 또는 기구 또는 센터에 음이온기가 구비; 39) 상기 음이온기에 의 하여 음이온이 발생; 40) 상기 음이온기에 이격되면서 상기 수단 또는 기구 또는 센터에 청정기가 구비; 41) 상 기 청정기는 상기 수단, 기구, 센터, 센터 내부, 현장, 공장, 가정, 작업장, 작업자, 사무실 등의 공기를 청정; 42) 상기 수단 또는 기구 또는 센터에 히터, 쿨러가 거치; 43) 상기 히터는 상기 수단 내지 사무실 등에 열 발 산; 44) 상기 쿨러는 상기 수단 내지 사무실 등의 열 식힘; 등이 가능하다. 본 발명의 수단, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리, 드론, 장치, 장비, 시설, 사물, 만물, 생물, 기(器), 기(機), 기기, 기구, 로봇, 동물, 공간, 세계, 작업, 업무, 공사, 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 포켓, 청정기, 정화기, 방역 기, 통신수단, 통신망, 서버, 처리장치, 단말기, 핸드폰, 스마트폰, 계측기, 디스플레이, 필드수단, 웨어러블수 단, 안전관리시스템 등은 수단, 헬멧(2, 21), 모자, 안경(2, 22), 고글, 완장(2, 23), 띠장, 의류, 의복, 조끼(2, 24), 멜빵(2, 25), 밴드, X밴드, 손목밴드(2, 26), 시계(2, 27), 워치, 안전화(2, 28), 작업화, 안전 고리(2, 29), 착용구(2, 10), 착용물(2, 10), 다바이스, 드론, 비행기, 장치, 장비, 시설, 설비, 사물, 만물, 생물, 사람, 인간, 물체, 물질, 재료, 자재, 기(器), 기(機), 기기, 기구, 로봇, 동물, 아 바타, 메타공간, 버스세계, 메타버스, 메타버스공간, 가상공간, 가상세계, 작업, 업무, 제 조, 생산, 공사, 건설, 건축, 시공, 센서(10, 11), 버튼(10, 12), 랜턴(10, 13), 카메라(10, 14), 무전기(10, 15), 알림기(10, 16), 램프(10, 17), 계측기(10, 18), 배터리(10, 19), 제어기(10, 20), 포켓(20'), 주머니, 청정기, 정화기, 살균기, 소독기, 방역기, 크리닝기, 통신수단, 통신망, 서버, 처리장치 , 단말기, PC, 컴퓨터, 모니터, 스크린, 핸드폰, 스마트폰, 계측기, 디스플레이, 필드수단 , 웨어러블수단, 안전관리시스템, 이중 둘 이상이 조합된 복합수단 등이 될 수 있다. 상기 수단 내지 안전관리시스템 등은 IT, 5G, 3D, 4D, Al, IC, VR, AR, MR, DX, ICT, NFT, IoT, IoE, AIoT, SNS, BIM, LTE, WiFi, 안전, 구호, 세이브, 세이프, 자동, 오토, 로봇, 모빌, 무인, 유인, 무선, 유선, 소자, 에코, 그린, 청정, 정화, 살균, 소독, 방역, 방제, 케어, 비콘, 전기, 전자, 통신, 정보, 만능, 원격, 리모트, 지능, 비트, 코드, 펄스, 신호, 필드, 측정, 제어, 계측, 화학, 물리, 생물, 헬스, 케어, 인공, 논리, 지식, 지 능, 나노, 칩, 센서, 소자, 진자, 기판, 모듈, 회로, 트윈, 스마트, 모바일, 포터블, 인터넷, 디지털, 딥러닝, 바이오, 미생물, 데이터, 반도체, 컴퓨터, 메모리, 실리콘, 웨이퍼, 컨트롤, 시스템, 웨어러블, 연성, 플렉시블, 메타, 버스, 메타버스, 아바타, 사이버, 인공지능, 프로세스, 마이크로, 로보틱스, 빅데이터, 클라우 드, 모니터링, 아날로그, 프로그램, 불록체인, 자율주행, 자동제어, 자동감시, 원격관리, 원격가동, 원격조정, 트랜지스터, 하이브리드, 인텔리전트, 리모트컨트롤, 텔레매틱스, 3차원, 4차원, telematics, meta, verse, save, safe, smart, safety, wearable, flexible, wearable technology, PTT(Push To Talk), Watcher, PIP(picture in picture), 융합기술, 생명공학, 생명기술, 4차산업기술 중에서 선택된 하나의 상기 수단 내지 안전관리시스템 등이 해당되거나, 또는 등이 될 수 있다. 상기 수단 내지 안전관리시스템 등은 상기 IT 내지 4 차산업기술 등의 기능 또는 성능을 가진 상기 수단 내지 안전관리시스템 등도 해당된다. 상기에 의거하여 상기IT 내지 4차산업기술 중 하나의 안전관리시스템, 상기 IT 내지 4차산업기술 중 하나 기반의 안전관리시스템, 상 기 IT 내지 4차산업기술 중 하나의 기능을 가진 안전관리시스템 등이 가능하다. 상기 수단 내지 안전관리시스템 등의 용어 앞에는 상기 IT 내지 4차산업기술 중 하나의 어미, 수식어, 접두어 등이 위치할 수 있다. 상기 IoT는 a) IoT, 사물인터넷, Internet of Things, 사물의 인터넷, 인터넷을 하는 사물, 인터넷 통신이 되는 사물, 인터넷 통신이 구비되는 사물, 무선통신을 하는 사물, 사물과 사물이 인터넷으로 대화를 나누는 것, 사물 끼리 인터넷으로 연결돼 정보를 주고받는 것, 스마트폰으로 제어하는 것, 사물끼리 대화를 나누는 것, 사물에 센서를 부착해 실시간으로 데이터를 인터넷으로 주고받는 기술이나 환경, NFC의 근거리 무선통신(Near Field Communication)를 활용한 가전제품, 가전이 실시간으로 온도를 점검을 하고 제품 진단과 절전 관리를 함, 건강 관리용 스마트 팔찌, 사물끼리 통신을 주고 받을 수 있는 통로, 사물끼리 공통적으로 사용할 수 있는 언어, 사 물끼리 통신할 수 있는 통로, 시설에 센서와 스피커를 탑재해 정보를 수집, 실시간으로 정보 데이터를 습득해 본사에게 정보를 알려줌, 사무실과 가전에 센서를 설치하고 인터넷에 연결, 쓰레기에 센서를 부착해 쓰레기의 이동경로 파악, 사물지능통신 기반, 창조엔진, 초연결사회의 기반 기술, 서비스이자 차세대 인터넷으로 사물 간 인터넷 혹은 개체 간 인터넷(Internet of Objects), 사물이 만들어낸 정보를 인터넷을 통해 공유하는 환경, USN(Ubiquitous Sensor Network), M2M(Machine to Machine), Intelligence Buildings, GSMA(Global System for Mobile Communications Association), 센서(sensor)가 이용되는 인터넷, 정보를 수집·처리·관리하고 정 보가 서비스로 구현되기 위한 환경을 지원, 인터넷에 연결된 기기가 상호 정보를 주고 받으며 대화를 나누는 것, 블루투스나 근거리무선통신(NFC), 센서데이터, 네트워크 등으로 자율적인 소통을 하는 것, 사물간 온도나 습도나 위치나 열 같은 정보를 주고받음, NFC칩이 탑재된 장비에 스마트폰을 갖다대면 장비 동작 상태나 오작동 여부를 확인; b) 센싱 기술, 유무선 통신 및 네트워크 인프라, IoT 서비스 인터페이스 기술; c) 근거리 통신기 술(WPAN, WLAN 등)이나 이동통신기술(2G, 3G, 4G 등)과 유선통신기술(이더넷, BcN 등) 같은 유·무선 통신 및 네트워크 인프라 기술; d) 센서에 의하여 빛, 소리, 온도, 화학물질 등 내외부에서 발생한 신호들을 수집하여 과학적인 방법으로 분석하여 내외부의 각종 상태를 파악하는 장치; e) 또는 열, 가스, 조도, 온도, 습도, 초음 파 센서부터 원격감지, SAR, 레이더, 위치, 모션, 영상센서 등 유형 사물과 주위 환경으로부터 정보를 바탕으로 사물 간 대화가 이루어짐 등이 해당된다. 상기 IoE는 만물인터넷, Internet of Everything 등이고, 이의 설명은 상기의 IoT와 유사하고 IoT의 things 대신에 IoE의 everything이 교체된 것이다. 상기 수단 내지 안전관리시스템 등에는 상기 IT 내지 4차산업기술 등이 이용될 수 있다. 상기 수단 내지 안전관 리시스템 등은 상기 IT 내지 4차산업기술 등의 용도로 이용될 수 있다. 상기 IT 내지 4차산업기술 등을 하는 또 는 상기 IT 내지 4차산업기술 등이 되는 상기 수단 내지 안전관리시스템 등도 가능하다. 본 발명의 a) 수단, 장치, 장비, 기기, 기구, 드론, 항공기, 트럭, 도져, 크레인, 포크레인, 타워크레 인, 물체, 물질, 재료, 자재, 부재, 사물, 만물, 생물, 몸, 사람, 신체, 몸체, 로봇, 동 물, 아바타, 공장, 현장, 공간, 지반, 지중, 지하, 사면, 법면, 터널, 도로, 옹벽, 교량, 항만, 지하철, 시설, 건물, 자재, 작업, 제조, 공사, 건설, 건축, 구조물, 근로자, 작업자, 관리자 , 총괄자, 이용자, 청정기, 정화기, 청소기, 세척기, 세정기, 분사기, 살균기, 소독기, 방역기, 방 제기, 오존기, 음이온기, 자기장기, 정화장치, 소독장치, 살균장치, 공사장비, 제조장비, 생산장비, 공장장비, 현장장비, 헬멧, 안경, 완장, 의류, 조끼, 밴드, 멜빵, 시계, 워치, 신발, 안전화, 안전고리, 착용구, 착용물, 장신구, 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 포켓, 통신수단, 통신망, 서버, 처리장치, 단말기, 핸드폰, 스마트폰, 계측기, 디스플레이, 본사, 지사, 사무실, 관제센터, 필 드수단, 웨어러블수단, 안전관리시스템; b) 상기 중 하나의 전(前), 후(後), 좌(左), 우(右), 상 (上), 중(中), 하(下), 문(門), 창(窓), 띠, 어깨띠, X띠, 대, 줄, 쫄대, 창문, 전면, 후면, 측면, 전방 , 후방, 측방, 중간, 내부, 외부, 내면, 외면, 일면, 양면, 일측, 양측, 상부, 하부, 상단, 하단, 선단, 연단, 일단, 타단, 양단, 포켓, 섬유, 재료, 인근, 근처, 현관, 대문, 입구, 출구, 출입구, 개찰구, 이격부, 접 촉부, 연결부, 결합부, 접속부, 주머니, 중공부, 테두리, 가장자리, 1개, 2개, 3개, 5개, 10개, 20개, 30개, 50 개, 100개, 다수개, 2개 이상, 1세트 이상, 1지점, 2지점, 3지점, 2지점 이상, 양지점, 다지점; 등에는 1) 센서 , 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기 , 포켓(20'), 기구, 소자, 스피커, 마이크, 계측기, 측정기, 측량기, 트래커, 헬멧, 안경 , 완장, 의류, 조끼, 밴드, 멜빵, 손목밴드, 워치, 안전화, 고리, 안전고리, 착용구, 착용물, 부착구, 부착물, 필드수단, 웨어러블수단, 에어백, 히터, 쿨러, 전선, 탄소선, 발열체, 열선, 발열선, 트래커, 플랫폼, 스마트폰, GPS, GIS, 카드, card, 태그, tag, ID카드 (identity card, identification card), ID태그, 신원카드, 통신기, 통신망, 서버, 처리장치, 인터페이스, 위치추적시스템, 원격통제시스템, 인증시스템, 단말기, PC, 컴퓨터, 모니터, 스크린, 핸드폰, 태블릿, 디스플레이; 2) 상기 수단 내지 안전관리시스템; 3) 상기 수단 내지 안전관리 시스템 중 둘 이상이 조합된 복합수단; 등의 이용, 사용, 적용, 구비, 구성, 거치, 설치, 위치, 착용, 정착, 장 착, 병합, 합체, 연결, 연계 등이 가능하다. 상기 수단 내지 안전관리시스템, 센서 내지 디스플레이 등은 1개, 2개, 3개, 다수개, 2개 이상 등으로 상기 이용 내지 연계 등이 가능하다. 상기 수단 내지 안전관리시스템 등에 착용되는 착용물 또는 부착되는 부착물은 상기 센서 내지 디스플레이 등이 가능하다. 상기 수단, 헬멧 내지 안전고리, 수단 내지 안전관리시스템 등에는 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 랜턴, 제어기, 배터리, 포켓(20'), 계측기 등의 구비가 가능하다. 상기 수단, 헬멧 내지 안전고리 등에는 일정의 센서, 계측기 등이 설치되어 상기 수단, 헬멧 내지 안전고리 등 의 착용 여부가 근로자, 작업자, 아바타, 출입자, 관리자, 총괄자, 이용자, 서버, 단말기, 스마트폰, 핸드폰 등 에 통지, 고지, 알림, 얼람 등이 될 수 있다. 이의 예로는 사람, 인간, 로봇, 동물, 손, 손목, 머리, 신체, 상 체 등에서 상기 수단, 헬멧 내지 안전고리 등이 탈착되는 경우 상기 수단, 헬멧 내지 안전고리 등에 설치된 센 서에 의하여 상기 탈착이 감지되어 상기 작업자 내지 핸드폰 등에 신호, 부저, 소리, 알림, 얼람 등이 전달되는 것이다. 이의 경우 상기 탈착 상태의 신호 또는 메세지가 작업자, 관리자, 총괄자 등에 통지되게 된다. 상기 탈 착 상태가 장기간 되는 경우 관리는 착용 요청에 관한 신호 또는 메세지를 작업자에게 통지하여 작업자는 재착 용하게 된다. 상기 착용, 탈착, 재착용 등의 때, 일시, 시간, 기간 등은 서버, 단말기 등에 저장, 기록 등이 된 다. 본 발명의 현장, 공장, 사람, 로봇, 장비, 드론, 지반, 지중, 시설, 건물, 작 업자, 아바타, 메타버스, 메타버스공간(100, 101, 110, 120), 상기 헬멧 내지 안전고리, 수단 내 지 안전관리시스템; 이중 하나의 상기 전(前) 내지 다지점; 등에는 센서 또는 감지기(10, 11), 버튼 또는 SOS버 튼(10, 12), 랜턴 또는 라이트(10, 13), 카메라 또는 CCTV(10, 14), 무전기 또는 마이크(10, 15), 알림기 또는 알림등(10, 16), 램프 또는 후방등(10, 17), 계측기 또는 모니터링장치(10, 18), 배터리 또는 태양전지(10, 19), 제어기 또는 컨트롤러(10, 20), 통신장치, 통신망, 서버, 처리장치, 단말기, 컴퓨터 , 모니터, 스크린, 핸드폰(35, 94, 95), 디스플레이, 플렛폼 등의 구비 또는 순차적 구비 가 가능하다. 상기 센서는 센서, 소자, 렌즈, 비콘, 키트, 전선, 계측기, 측정기, 센서폰, 폰센서, 케이블, 위치센서, 고도센 서, 위도센서, 경도센서, 기압센서, 모션센서, 생체센서, 헬스센서, 인체센서, 가스센서, 환경센서, 키트센서, 공기질센서, 전기센서, 전자센서, 통신센서, 무선센서, 유선센서, 압전센서, 측정센서, 계측센서, 광학센서, 전 선센서, 케이블센서, 휴대용센서, 무선측정센서, 유선측정센서, 칩, 센서칩, 센싱칩, 위치칩, 모션칩, 생체칩, 가스칩, 환경칩, 공기질칩, 센싱칩, 위치센싱칩, ID칩, GPS칩, 인식칩, 모션센싱칩, 생체센싱칩, 가스센싱칩, 환경센싱칩, 공기질센싱칩, 코드, 바코드, ID코드, 태그, tag, ID태그, 식별태그, 트래커, 트래커센서, 핸드폰, 핸드폰센서, sensor, multiple sensor, 게이지, gauge, 스트레스게이지, 스트레인게이지, ID센서, RFID센서, NFC센서, MEMS센서, IR센서, FOD센서, PIR센서, UWB센서, IMU, CMOS센서, IoT센서, ICT센서, GPS(global positioning system), INS(inertial navigation system), 바이오센서, 다종센서, 다중센서, 빛센서, 열센서, 광센서, 파센서, 자기센서, 발열센서, 감지센서, 누수감지센서, 진동센서, 가진센서, 농도센서, 발광센서, 광원 센서, 소자센서, 온도센서, 습도센서, 압력센서, 응력센서, 변형센서, 변위센서, 소리센서, 신호센서, 유량센서, 자기센서, 음향센서, 미각센서, 후각센서, 장치센서, 장비센서, 음파센서, 섬유센서, 광섬유센서, 적 외선센서, 원적외선센서, 열화상센서, 초음파센서, 카메라, 적외선센서, 근적외선센서, 자외선센서, 디지탈카메 라, 각종센서, CDS센서, 콤파스센서, 고도계센서, tilt sensor, triaxial tilt sensor, crack sensor, wire sensor, vibrating wire sensor, stress sensor, load sensor, millivolt sensor, displacement sensor, optical displacement sensor, 이중 둘 이상이 조합된 복합센서 등이 해당된다. 상기 센서는 센싱, 측정, 계측, 관측, 관찰, 감지, 감식, 모니터링, 원격센싱, 무선센싱, 무인센싱, 자동센싱, 리모트센싱 등을 하는 것이다. 그리고 상기 센서는 a) 위치, 고도, 높이, 위도, 경도, 심도, 깊이, 좌표, GPS, 기압, 경사, 모션, 행동, 현상, 이상, 이동, 운동, 거동, 동작, 추락, 낙하, 움직임, 쓰러짐, 신체, 생체, 건강, 헬스, 가스, 오염, 기름, 유류, 환경, 청정, 정화, 살균, 소독, 폭기, 반응, 응집, 침전, 여과, 농도, 오 염농도, 가스농도, pH, ORP, oxidation-reduction potential, 산화환원전위 酸化還元電位, 오염도, 빛, 열, 광, 파, 단파, 장파, 웨이브, 자기, 전기, 전원, 전압, 전류, 자기장, 소리, 신호, 음향, 음파, 영상, 촬영, 녹 화, 송신, 방송, 방영, 수신, 저장, 기록, 스캔, 입력, 출력, 무인, 유인, 발광, 광원, UV, 자외선, 적외선, 원 적외선, 소자, 미각, 후각, 냄새, 악취, 열화상, 초음파, 수질, 공기, 공기질, 위해성, 위험성, 기상, 기후, 대 기, 풍속, 풍향, 물, 유량, 수량, 누수, 누유, 누액, 차수, 방수, 관, 관로, 배관, 상수관, 관누수, 막누수, 관로누수, 차수막누수, 상수관누수, 온도, 습도, 체온, 수온, 수면, 수중, 수위, 전기전도도, 전기비저항, 오염농 도, 충격, 진동, 지진, 소음, 낙하, 힘, 무게, 중량, 하중, 응력, 압력, 압축, 강도, 강성, 인장, 인출, 인발, 열량, 체적, 길이, 면적, 변형, 변위, 경사, 경사도, 기울기, 시설 기울기, 건물 기울기, 기능, 성능, 물질, 재 료, 자재, 물체, 사물, 만물, 생물, 접근, 사람접근, 동물접근, 피로, 파괴, 파손, 손상, 훼손, 손괴, 낙하, 파 괴, 비파괴, 화재, 화염, 재난, 정전, 공조, 냉방, 난방, 속력, 속도, 가속도, 3축 가속도, 자이로, 뇌파, EEG(electroencephalogram), 체온, 호흡, 맥박, 혈압, 심박수, 박동수, 심질환, 심전도, 心電圖, ECG(electrocardiogram), 트래킹(tracking), 장비, 장치, 기구, 사람, 인간, 로봇, 동물, 작업자, 근로자, 출 입자, 일, 업무, 작업, 제조, 생산, 공사, 건설, 건축, 발파, 천공, 토공, 절토, 성토, 저장, 혼합, 가압, 펌핑, 분사, 타설, 주입, 포설, 포장, 다짐, 양생, 해체, 선별, 분리, 파쇄, 분쇄, 분별, 센싱, 계측, 관측, 측 정, 측량, 시험, 분석, 지반, 지하, 지중, 사면, 토지, 지형, 시설, 설비, 건물, 터널, 도로, 교량, 옹벽, 지하 철, 구조물, 앵커, 볼트, 록볼트, 네일링, 철근, 콘크리트, 보강재, 양, 수량, 용량, 업무량, 작업량, 제조량, 공사량, 토공량, 글로나스, 가스누출, 산소부족, 근로자쓰러짐, 헬멧, 조끼, 웨어러블수단, 안전모착용여부, 웨 어러블수단착용여부; b) 상기 위치 내지 웨어러블수단착용여부 중 하나의 양(量) 또는 정도; c) 상기 위치 내지 양(量) 중 둘 이상이 조합된 복합; 등을 측정, 센싱, 계측, 관측, 관찰, 탐지, 감지, 감식, 모니터링 등을 하는 것이다. 상기 트래커는 a) 트래커, tracker, 추적자, 사냥꾼, 위치추적기, 차량에 설치, 차량 운행정보 파악, 차량 위치 정보 파악, 차량 운행이력 모니터링, 과속 감지, 전복 감지, 3축 가속도 센서 내장, GNSS(Global Navigation Satellite System) 위치측위; b) 사람이나 차량 등에 설치되어 위치정보, 이동이력, 운행이력, 주행속도감지, 과속감지, 충돌감지, 전복감지, 사고감지, 과속경고음, 긴급호출, 차량속도 모니터링, 안전주행속도 유도 등을 하는 장치; c) 이중 둘 이상이 조합된 복합트래커; 등이 해당된다. 상기 카메라는 카메라, 사진기, 촬영기, 녹화기, 캠, 웹캠, 홈캠, 필드캠, 캠코더, 레코더, 방송기, 방송국, 핸 드폰, 핸드폰카메라, 펜카메라, 시계카메라, 미니카메라, 버튼카메라, 필드카메라, 필드CCTV, 필드촬영기, 웨어 러블 카메라, 웨어러블 CCTV, IP(internet protocol address) CCTV, LTE CCTV, CCTV카메라, 이동형카메라, 이 동형촬영기, 이동형CCTV, 이동방송기, 이동방송국, 모바일카메라, 모바일촬영기, 모바일방송기, 모바일방송국, LED카메라, LTE카메라, 이동형 LTE-CCTV, AI카메라, 스냅카메라, 무선카메라, camera, camcoder, recorder, wireless camera, 유선카메라, 비디오카메라, 디지털카메라, 아날로그카메라, 열화상카메라, 적외선카메라, 내 시경카메라, 연속촬영카메라, HD카메라, Full HD카메라, 회전카메라, 각도조절카메라, 각도회전카메라, 이중 둘 이상이 조합된 복합카메라 등이 해당된다. 상기 캠은 캠, cam, 손캠, 홈캠, 핸드캠, 필드캠, camera의 cam, 카메라의 약어 등이 해당된다. 본 발명의 센서, 렌즈, 카메라, 촬영기, 계측기, 시험기 등에는 통신장치, 통신망, 이동통신망, 방송사, 방송시 설, 이동방송국, 이동기지국, 서버, 단말기, PC, 컴퓨터, 모니터, 스크린, 핸드폰, 디스플레이 등이 연계되어 방송, 생방송, 동영상, 이동방송, 개인방송, 국내방송, 해외방송, 녹화방송, SNS방송, 실시간 방송, 라이브 스 트리밍, live streaming, 유투브방송, TouTube방송 등이 가능하다. 따라서 카메라 또는 촬영기에서 촬영된 영상, 정보, 작업, 공사, 정화, 방역, 방제, 사건, 사고, 안전, 현장영상, 사고영상, 방재영상, 안전대책 등이 실시간 적으로 서버, 단말기, PC, 컴퓨터, 모니터, 스크린, 핸드폰, 디스플레이 등에 생방송 또는 녹화방송이 가능하다. 상기 계측기는 a) 센서, 소자, 계측기, 측정기, 감지기, 측량기, 관측기, 탐사기, 탐지기, 광파기, 시험기, 기 록기, 기록계, 칩, 계측칩, 센싱칩, 측정칩, 응력계, 강도계, 하중계, load cell, 변형계, strain gauge, 변위 계, 속도계, 가속도계, 농도계, 오염농도계, 오염측정기, 앵커계측기, 인발계측기, 지반변위계, 지중변위계, 내 공변위계, 천단변위계, 다단변위계, 건물변위계, 건물기울계, 경사계, 인클리노미터, inclinometer, 틸트미터, tilt meter, 건물경사계, 지중경사계, 지하수계, 지하수위측정기, 광파측량기, 침하계, settlement gauge, 지반 침하계, 지중침하계, 다단침하계, 게이지, gauge, 스트레인게이지, 스트레스게이지, 망치, 해머, 슈미트해머, 천단침하계, 내공변위계, 락볼트응력계, 라이닝응력계, 핸드폰, 핸드폰계측기, 디스펜서, 스캐너, 3D스캐너, 레 이저 스캐너, 화상기, 열화상기, 비파괴 장치, 사운딩기, Sounding Unit, measuring instrument, 計測器, 물리 탐사기, 자기탐사기, 전자탐사기, 음파탐지기, 초음파탐지기, 누수감지기, 손상감지기, 유선계측기, 무선계측기, 자동계측기, 지진계측기, 진동계측기, 건물계측기, 교량계측기, 터널계측기, 사면계측기, 지반계측 기, 지중계측기, 바이오계측기, 흙막이계측기, 센서 이용 계측기, 센서 탑재 계측기; b) 상기 위치 내지 복합 등의 계측기, 상기 위치 내지 복합 등을 측정하는 계측기; c) 이중 둘 이상이 조합된 복합계측기; 등이 해 당된다. 상기 디스펜서는 디스펜서, dispensor, 콘크리트 속에 작은 기포를 일으키는 에이이제 용액의 부피와 무게를 재 는 장치, 펌프식의 리필용 용기, 약품을 담아두는 펌프식의 리필용 용기, 특정한 물건이나 물질을 사용할 때 버 튼이나 손잡이를 한 번 누르면 일정한 양이 공급되도록 고안된 도구나 장치 등이 해당된다. 상기 바이오계측기 는 바이오계측기, 바이오센서, 생물 이용 계측기, 바이오 이용 계측기, 미생물 계측기, 사람을 측정하는 계측기, 동물을 측정하는 계측기 등이 해당된다. 본 발명의 센서, 계측기, 시험기, 기록기, 기록계 등은 가스, 환경, 위치, 모션, 행동, 이동, 생체, 공기질, 충 격, 진동, 지진, 낙하, 힘, 무게, 중량, 응력, 강도, 변형, 변위, 지반, 토지, 지형, 건물, 구조물, 작업, 제조, 생산, 공사, 시공, 건설, 건축, 포장, 메타버스, 상기 위치 내지 복합 등의 측정, 센싱, 계측, 측량, 측 지, 관측, 시험, 매핑, mapping, 항공측량, 지상측량, 3차원화, 3차원도형화 등이 가능하다. 상기 매핑은 매핑, mapping, 지도 작업, 지도 제작 작업, 지도에 관한 작업, 지형 작업, 메타버스에 지형 작업, 지형을 도면화하는 작업, 3D 도면 제작, 3D 모델링을 할 때 모델에 텍스쳐를 펴 바르는 작업, 어떤 값을 다른 값에 대응시키는 과 정 등이 해당된다. 상기 센서, 계측기 등은 위험지역 접근 감지, 위험지역 접근 알림, 셀프 안전점검, 착용자가 위험지역 접근시 경고 알림, 위험지역 작업현황 모니터링, 위험상황 자동감지, 긴급구조요청, 유해가스 실시간 감지, 가스사고 실시간 감지, 낙상사고 실시간 감지, 착용자 사고감지시 자동알림, 착용자 사고감지시 구호요청 전송 등을 하거나, 또는 등에 이용될 수 있다. 상기 센서, 계측기, 기록기, 기록계 등은 인터넷, 통신장치, 통 신망, 통신모듈, 서버, 처리장치, 단말기, 플랫폼, 메타버스, 디스플레이 등에 연계되어 센셍 정보, 계측 정보 등이 전송, 무선전송, 수신, 저장, 처리, 읽기, 보기 등이 가능하다. 본 발명에서는 다양한 센싱, 계측, 시험, 실측, 관측, 검증, 감정, 인증, 조사, 검사, 측량, 측정 등이 수행될 수 있다. 상기 센싱 내지 측정 등의 항목 또는 대상으로는 물질, 재료, 자재, 품질, 소음, 진동, 먼지, 공기질, 수질, 토양, 지반, 토지, 대지, 지중, 지하, 시설, 건물, 구조물, 지하수, 먹는물, 폐기물, 강도, 전단, 압축, 인장, 신장, 비중, 밀도, 무게, 중량, 부피, 체적, 치수, 두께, 길이, 면적, 입도, 입경, 다짐, 투수, 차수, 압 밀, 정수위투수, 변수위투수, 들밀도, 재하, 정재하, 동재하, 평판재하, 말뚝재하, 지지력, 지내력, 관입, 콘관 입, 표준관입, 간극률, 공극비, 하중, 압력, 응력, 변형, 변위, 일축강도, 삼축강도, 전단강도, 부착강도, 인장 강도, 인장율, 신장율, 액성한계, 소상한계, 수축한계, 애터버그한계, 함수량, 함수비, 함유비, 함기비, 흡수율, 강열감량, 유기물함유, 마모, 안정성, 알카리, 활성도, 분말도, 비표면적, 안정도, 팽창도, 응결시간, 평탄성, 저항성, 미끄럼저항, 마샬안정도, 흐름값, 연소성, 열전도율, 전기전도도, 중금속, 용출, 오염용출, 상 기 위치 내지 복합 등이 가능하다. 상기 통신장치는 a) 통신기, 송신기, 전송기, 수신기, 발신기, 공유기, 인터넷, internet, 무선통신, wireless, 무선, 와이어리스통신, 통신모듈, 통신유닛, 통신수단, 통신장치, 통신장비, 인터넷공유기, 무선인터넷, 네트워 크, 무선네트워크, 통신시스템, 인테페이스, 통신인테페이스, 중계장비, 통신중계장비, 게이트웨이, 무선통신장 치, 유선통신장치, 송신유닛, 송신장치, 무선송신장치, 전송유닛, 전송장치, 무선전송장치, 핸드폰, 스마트폰, 스마트폰앱, 스마트폰 이용, 이어폰, 이어셋, 무선이어폰, 무선이어셋, 핸드폰통신장치, 스마트폰통신장치, 아 바타통신장치, 메타버스통신장치, 설치형 통신장비, 이동형 통신장비, 설치형 통신중계장비, 이동형 통신중계장 비, 와이파이, 엘티이, 비콘, 테더링, 핫스팟, 블루투스, 사물인터넷(IoT), 만물인터넷(IoE), 안테나, 통신안테 나, 무선안테나, USB안테나, 기업전용 LTE망, 블루투스를 지원하는 스마트폰, 블루투스를 지원하는 다양한 주변 기기, 게이트웨이, 모뎀, 웹, web, 웹사이트, SNS, gateway, WiFi, LTE, P-LTE(Private LTE), IMT, UWB, GSM, BLE, UDP, TCP, IP, USB, ZigBee, Beacon, Bluetooth, AP(access point), WiFi장치, LTE장치, IMT장치, Beacon장치, Bluetooth장치, AP장치, 비콘(beacon)장치, WIMAX(World Interoperability for Microwave Access), 태그(tag), 비콘태그, RFID태그(radio frequency identification); b) 또는 게이트웨이, 스마트폰, 근로자앱 등을 이용한 통신시스템; c) 이동통신망이 되는 현장에서 비콘, 스마트폰, 근로자앱 등을 이용한 통신시스템; 도 1 상부 그림 참조, d) 이동통신망이 되지 않는 현장에서 게이트웨이, 200∼300m 간격으로 게이트웨이 등을 이용한 통신시스템; 도 1 하부 그림 참조, e) 또는 상기 센서, 버튼 , 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 스마 트폰, 수단 내지 복합수단 등의 또는 등에서 발생되는 자료, 정보, 신호, 영상, 음성, 데이터 등을 통신, 송신, 공급 등을 하는 장치; 도 1 그림 참조, f) 상기 통신기 내지 RFID태그 등의 장치; g) 상기 통신기 내지 RFID태그 등을 이용하여 자료, 정보, 신호, 영상, 음성, 데이터 등을 통신, 송신, 전송, 수신, 송수신 등을 하 는 것; g) 이중 둘 이상이 조합된 복합통신장치; 등이 해당된다. 상기 서버는 서버, 수신기, 클라우드, 관제서버, 관리서버, 중앙서버, 호스트서버, 서버클라우드, 송신서버, 수신서버, 저장서버, 저장장치, 데이터 저장장치, 저장하드웨어, 데이터 베이스, 통신자서버, 112서버, 119서버, 관리자서버, 총괄자서버, 이용자서버, 현장서버, 본사서버, 중앙관제서버, 플랫폼서버, GIS서버, 빅테이터서버, 빅테이터저장, 인공지능서버, 클라우드서버, 인터넷 상의 서버, 클라 우드 네트워크, 네이버 클라우드, 네이버 MYBOX, 구글 드라이브, 클라이언트서버, 서버클라이언트, 빅데이터서 버, 아바타서버, 메타버스서버, 웹하드, 웹서버, 웹사이트, 하드웨어, 기억장치, 수신안테나, 수신기 구비 서버, DB, data base, cloud, server, cloud server 등이 해당된다. 상기 서버, 통신망, 단말기, 처리장치 등에는 PC, 컴퓨터, 하드웨어, hardware, 소프트웨어, software 등이 구비될 수 있다. 컴퓨터 또는 하드웨어는 도 8과 같이 중앙처리장치, 기억장치, 주기억장치, 보조기억장치, 입력장치, 출력장치 등 으로 구성된다. 여기서 하드웨어 장치간의 데이터 흐름과 제어신호 흐름은 도 8과 같으며, 중앙처리장 치의 제어신호에 따라 다른 장치들이 동작을 하게 된다. 상기 단말기는 a) 단말기, 端末機, 수신기, 착신기, 수신장치, 컴퓨터, PC(91, personal computer), TV(television), OTT(Over-The-Top), SNS(Social Network Service), 태블릿, 모니터, 스크린, 화면, 폰, 핸드폰, 스마트폰(94, smart phone), 태블릿, 태블릿(tablet)PC, 모바일 인터넷장치(MID, mobile internet device), 인터넷태블릿, IoT(internet of things)장치, IoE(internet of everything)장치, 데 스크탑컴퓨터(desktop computer), 랩탑(laptop)컴퓨터, 워크스테이션 컴퓨터, PDA(Personal Digital Assistant), Wibro(Wireless Broadband Internet)단말기, 영상장치, 디스플레이, 디스플레이기기, 텔레비젼, 보여주는 장치, 모바일기, 모바일기기 등이 해당된다. 본 발명에서는 a) 자화기, 자기장기, 진동기, 가진기, 오존기, 음이온기, 청정기, 정화기, 정수기, 연수기, 세정기, 세척기, 살균기, 소독기, 방역기, 방제기, 분해기, 전해기(전기분해기), 방전기 (전기방전기), 압전기(피에조기, 435), 열전기(펠티에기, 436), 배양기, 발효기, 가습기, 건조기, 가열기, 냉각 기, 냉온기, 연무기, 응축기, 전파기, 음파기, 초음파기, 인덕터, 펄스기, 폭기기, 임펄스기, 분사기, 와류기, 케비테이션기, 반응기, 응집기, 침전기, 여과기, 필터기, 데미스터, 엘리미네이터, 서미스터, 미스트기, 다이오 드, 웨이브기, 솔레노이드, 마그네트론기; b) 자화, 자기장발생, 진동, 가진, 오존살균, 음이온소독, 청정, 정화, 정수, 연수, 세정, 세척, 살균, 소독, 방역, 방제, 분해, 전해(전기분해), 방전 (전기방전), 압전, 열전, 배양, 발효, 가습, 건조, 가열, 냉각, 냉온, 연무발생, 응축, 전파발생, 음 파발생, 초음파진동, 전자기유도, 펄스발생, 폭기, 임펄스발생, 분사, 와류, 케비테이션, 반응, 응집, 침전, 여 과, 필터링, 수분제거, 먼지제거, 열가변저항발생, 미스트발생, 발광, 웨이브발생, 자기장발생, 마이크로파발생; c) 자화물, 자기장, 진동물, 가진물, 오존, 오존물, 음이온, 음이온물, 청정물, 정화물, 정수물, 연수물, 세정물, 세척물, 살균물, 소독물, 방역물, 방제물, 분해물, 전해물(전기 분해물), 방전물(전기방전물), 압전물, 열전물, 배양물, 발효물, 가습물, 건조물, 가열물, 냉각물, 냉온물, 연무, 응축물, 전파, 음파, 초음파, 전자기, 펄스, 폭기물, 임펄스, 분사물, 와류물, 케비테이션물, 반 응물, 응집물, 침전물, 여과물, 필터물, 수분, 물방울, 열가변저항(熱可變抵抗), 미스트, 발광물, 웨이브, 육각 물, 자기장물, 마이크로파; d) 처리, 자화처리, 자기장처리, 진동처리, 가진처리, 오존처리 , 음이온처리, 청정처리, 정화처리, 정수처리, 연수처리, 세정처리, 세척처리, 살균처리, 소독처리, 방역처리, 방제처리, 분해처리, 전해처리, 방전처리, 압전처리, 냉온처리, 배양처리, 발효처리, 가습 처리, 건조처리, 가열처리, 냉각처리, 냉온처리, 연무처리, 응축처리, 전파처리, 음파처리, 초음파처리, 전자기 처리, 펄스처리, 폭기처리, 임펄스처리, 분사처리, 와류처리, 케비테이션처리, 반응처리, 응집처리, 침전처리, 여과처리, 필터처리, 데미스터처리, 엘리미네이터처리, 열가변저항처리, 미스트처리, 발광처리, 웨이브처리, 자 기장처리, 마이크로파처리; e) 상기 중 둘 이상이 조합된 복합, 처리, 복합기, 복합작용, 복합물, 복 합처리; f) 상기 자화기 내지 복합처리 중 하나의 기능, 기능기, 기능물, 기능처리; 등 (430, 440)이 또는 등(430, 440)의 이용, 사용, 적용, 구비, 거치, 주입, 투입, 발생, 생성, 공급, 제공, 분사 등이 가능하다. 본 발명에서는 칩, 핀, 판, 팬, 침, 콘, 링, 망, 줄, 선, 실, 사, 솔, 빗, 캡, 알, 봉, 대, 폴, 틀, 붓, 볼, 삽, 끌, 톱, 칼, 날, 칼날, 구슬, 금속, 소자, 진자, 단자, 전지, 전극, 양극, 음극, 폴대, 자침, 코일, 나선, 노끈, 지퍼, 쟈크, 처크, 후크, 헤드, 테일, 센서, 기판, 키트, 모듈, 히터, 쿨러, 회로, 서버, 허브, 모뎀, 도 체, 드론, 로봇, 콘덴서, 트렌스, 스프링, 아바타, 반도체, 시스템, 이중 둘 이상이 조합된 복합요소 등의 이용이 가능하다. 그리고 상기 칩 내지 복합요소 등은 상기 수단, 센서 내지 제어기, 센서 내지 디스플레 이, 자화기 내지 기능기, 수단 내지 안전관리시스템 등에 구비, 거치, 사용, 적용, 장착 등이 가능하다. 그리고 상기 수단 내지 안전관리시스템 등에는 상기 칩 내지 복합요소 등의 구비가 가능하다. 상기 칩 내지 복 합요소 등은 상기 수단 내지 안전관리시스템 등의 부품으로 적용되거나, 상기 수단 내지 안전관리시스 템 등에 거치되어 적용되거나, 또는 하기에 기재되는 일정의 작용을 하거나, 또는 각각 가지고 있는 고유의 기능, 성능, 특징 등을 상기 수단 내지 안전관리시스템 등에 이용하려고 할때 적용될 수 있다. 본 발명에서는 상 기 칩 내지 복합요소 등의 상기 IT 내지 4차산업기술 등이 가능하다. 그리고 상기 IT 내지 4차산업기술 등의 상 기 칩 내지 복합요소 등이 가능하다. 본 발명에서는 일정의 기(器), 기(機), 차(車), 체(體), 물체, 기기, 기계, 수단, 센서, 측기, 장치, 장비, 사 물, 만물, 생물, 동물, 시설, 로봇, 설비, 부품, 제품, 물품, 상품, 용품, 폰, 전화, 서버, CPU, GPU, PIM, USB, GPS, GIS, CCTV, 카메라, 촬영기, 스캐너, 3D스캐너, 반도체, 녹화기, 추적기, 측정기, 인식기, 감지기, 벤츄리, 벤츄리관, 시스템, PC(personal computer), 컴퓨터, 노트북, 태블릿, 태블릿PC, SNS(social network service), SNS기기, 핸드폰, 모바일기(mobile kit), 무전기, 모니터, 스크린, 스마트폰, 드론, 모빌리티, 시스 템, 킥보드, 모바일기, 컴퓨터, 메모리, 프린터, 프로그램, 4G, 5G, 인공지능, 사물인터넷, 자율주행차, 가상현 실, LTE, WiFi, 메타버스, 미디버스, 앱, 어플, 어플리케이션, 스마트폰앱, 사이클론, 하드웨어, 소프트웨어, 네트워크, 이중 둘 이상이 조합된 복합 또는 복합기 등이 이용될 수 있다. 상기 기(器) 내지 복합기 등 은 상기 수단 내지 안전관리시스템 등에 구비, 거치, 사용, 적용, 장착 등이 가능하다. 상기 수단 내지 안전관리시스템 등에는 상기 기(器) 내지 복합기 등의 구비가 가능하다. 상기 기(器) 내지 복합기 등 은 상기 수단 내지 안전관리시스템 등의 부품으로 적용되거나, 상기 기(器) 내지 복합기 등에 거치되어 적 용되거나, 또는 하기에 기재되는 일정의 작용을 하거나, 또는 각각 가지고 있는 고유의 기능, 성능, 특징 등을 상기 기(器) 내지 복합기 등에 이용하려고 할때 적용될 수 있다. 상기 앱, 어플, 어플리케이션, 스마트폰앱 등은 앱, 어플, 어플리케이션, 애플리케이션, 폰앱, 전화앱, PC앱, 핸드폰앱, 스마트폰앱, 소프트웨어, 프로그램, 응용 프로그램, app, appl, application, 애플리케이션(혹은 어 플리케이션)을 약어 또는 줄임말, 스마트폰이나 스마트TV 같은 스마트 기기에서 돌아가는 프로그램 또는 응용 프로그램, 스마트폰이나 태블릿PC에 들어가는 프로그램 또는 응용 프로그램, 스마트TV용 응용프로그램, 휴대폰 이나 스마트폰 등에 다운받아 사용할 수 있는 프로그램 또는 응용프로그램 등이 해당된다. 상기 벤츄리, 벤츄리 관 등은 벤츄리, 벤츄리관, venturi, venturi pipe 등이 해당된다. 벤츄리관은 파이프, 축소부, 벤츄리, 확장부 등으로 구성될 수 있다. 상기 축소부, 벤츄리 등에는 이젝터, 인젝터, 체크밸브, 솔레노이드밸브 등의 구비가 가능하다. 상기 드론은 드론 1, 드론 2, 드론 3, 드론 4, 드론 5 등이다. 상기 드론 1은 드론, drone, 항공기, 비행기, 무 인항공기, 소형항공기, 미니항공기, 소형무인항공기, 無人航空機, 모빌리티, mobility, UAV(unmanned aerial vehicle), UAM, 도심항공교통, urban air mobility, 조종사(human pilot)가 탑승하지 않은 항공기, 헬리콥터 (heli copter), 멀티콥터(multi copter), 소형 멀티콥터로(mini multi copter), 고정익 항공기, 초경량비행장 치 등이다. 상기 드론 2는 a) 드론, 비행하는 드론, 무인비행하는 드론, 날개의 회전에 의하여 무인비행하는 드 론, 타설수단이 구비된 드론, 3D프린터형 드론, 비행하면서 타설하는 드론, 복수의 프로펠러가 구비된 본체와 상기 프로펠러에 회전력을 제공하는 모터와 상기 모터에 동력을 제공하는 배터리 또는 발전기가 구비되는 드론; b) 타설수단인 노즐, 호스, 분사기, 타설기, 타설구 중 하나 이상이 구비된 드론; c) 상기 자화 내지 복합 중 하나를 하는 드론, 상기 일 내지 복합 중 하나를 하는 드론, 상기 수단 내지 복합수단 중 하나가 이용되는 드론, 상기 수단 내지 복합수단 중 하나가 구비된 드론; d) 상기 수단 내지 복합수단 중 하나에 연계된 드론; e) 상기 저장고 내지 복합기 중 하나에 연계되어 비행하면서 상기 저장 내지 복합 등을 하는 드론; f) 센서가 장착되어 실시간 환경질을 측정하고 이의 측정치가 기준을 초과하면 자율비행하면서 소독 연무를 분사하여 방역 을 하고 살균제를 분사하는 드론; g) 자율비행하면서 공기 정화와 플라즈마 방식으로 세균과 바이러스를 살균하 고 LED 램프를 쬐어 소독하는 드론; 등이다. 상기 드론 3은 a) 우측에 센서, 좌측에 버튼, 전방에 랜턴, 전면에 카메라, 상부에 무전기, 하부에 알림기, 후방에 램프, 후면에 계측기, 측방에 제어기; b) 상기 중 하나 이상에 연계되는 통신장치, 통신망, 서버, 단말기, 컴퓨터, 모니터, 스크린, 핸드폰, 디스플레이; 등이 구비되거나, c) 상기 센서 내지 디스플레이 중 하나 이상이 포함되는 메타버스 등이 해당된다. 상기 드론 4는 a) 상기 또는 하 기의 수단 내지 복합수단; b) 이중 하나 이상에 연계되는 통신장치, 통신망, 서버, 단말기, 컴퓨터, 모니터, 스 크린, 핸드폰, 디스플레이; 등이 구비되거나, c) 상기 수단 내지 디스플레이 중 하나 이상이 포함되는 메타버스 등이 해당된다. 상기 드론 5는 a) 드론, 무인드론, 유인드론, 분사드론, 분무드론, 살수드론, 수중드론, 공중드론, 비행드론, 택배드론, 배달드론, 농약드론, 소독드론, 업무드론, 공사드론, 시공드론, 건설드론, 건축드론, 조경드론, 환경 드론, 청정드론, 재난드론, 구호드론, 측량드론, 측지드론, 무게 2kg 이하의 소형드론, 무게 2∼25kg의 중형드 론, 무게 25kg 이상의 대형드론, 외부에 cage가 구비된 케이지드론, 모빌리티, 발전을 하는 또는 발전기가 구비 된 발전드론, 태양발전을 하는 또는 태양발전기가 구비된 태양발전드론, 풍력발전을 하는 또는 풍력발전기가 구비된 풍력발전드론, 공기청정드론, 무인비행드론, 인공강우드론, 드론비행기, 드론비행선, 물건운반드론, 사람 운반드론, 사람구조드론, 인명구조드론, 사람탑승드론, 로봇탑승드론, 운전자탑승드론, 카메라 구비 드론, CCTV 구비 드론, 회전날개 구비 드론, 발전기 구비 드론, 태양 또는 풍력 발전기 구비 드론, 노즐 구비 드론, 분사기 구비 드론, 물질을 분사하여 해양오염 정화하는 드론, 물질을 분사하여 공기청정하는 드론, 분사기로 물을 분사 하여 공기청정하는 드론, 공중에 물질을 분사하여 인공강우를 생성하는 드론, 상기 자화 내지 복합 중 하나를 하는 드론; b) 몸체 또는 이의 측면에 연장되어 장착된 거치대에 거치된 회전날개가 구비된 드론; c) 복수의 프 로펠러가 구비된 본체와 상기 프로펠러에 회전력을 제공하는 모터와 상기 모터에 동력을 제공하는 배터리 또는 발전기가 구비되는 드론; d) 충전지와 상기 충전지를 통해 전력을 제공받는 모터와 상기 모터를 통해 회전하는 프로펠러에 의해 비행하는 드론; e) 제어부가 내장되면서 외부에 카메라가 설치된 몸체와 상기 몸체의 측면에 설치된 2개 이상의 거치대와 상기 거치대에 거치되는 모터와 상기 모터의 회전축에 연결되는 날개와 상기 모터 에 전력을 제공하는 동력수단으로 구성된 드론; f) 기체 또는 이의 측면에 연장되어 거치되는 거치대와 상기 기 체 또는 거치대에 장착되어 회전하면서 상기 기체에 양력을 제공하는 1개 이상의 프로펠러와 상기 프로펠러를 회전시키는 구동부와 상기 구동부의 동작을 제어하는 제어부와 상기 구동부에 동력을 제공하는 충전지를 구비하 여 비행하는 드론; g) 일정의 조명, 카메라, 통신기 중 하나 이상이 구비된 본체와 상기 본체를 비행하게 하는 날개와 상기 비행 동작을 제어하는 제어부와 상기 날개에 회전력을 제공하는 모터와 상기 모터에 동력을 제공하 는 배터리 또는 발전기로 구성된 드론; h) 상기 드론, 몸체, 거치대, 날개, 프로펠라, 카메라, 배터리, 발전기, 모터, 조명, 카메라, 통신기 중 하나 이상에 상기 자화기 내지 복합물 중 하나 이상이 이용되는, 또는 상기 드 론 내지 통신기 중 하나 이상이 상기 자화기 내지 복합물 중 하나 이상을 이용하는 상기 드론; 등이다. 상기 시설은 시설 1, 시설 2 등이다. 상기 시설 1은 집, 건물, 주택, 가옥, 주택, 단독주택, 공동주택, 조립주 택, 강철주택, 철골주택, 케노피건물, 케노피주택, 이동주택, 컨테이너주택, 한옥, 양옥, 황토방, 상가, 아파트, 오피스텔, 주상복합, 저층건물, 고층건물, 초고층건물, 하우스, 목조주택, 목조건물, 인공목조주택, 합 성목조주택, 황토주택, 기와집, 전통집, 한옥집, 토담집, 볏집, 전통건물, 문화재, 문화재건물, 지하실, 지하도, 지하건물, 수중건물, 지상건물, 공중건물, 부유건물, 식물공장, 도시농장, 농장건물, 식물농장건물, 식 물공장건물, 도시농장건물, 어번팜건물, 하우스, house, 비닐하우스, 유리하우스, 펜트하우스(Pent House), 플 라스틱하우스, 고분자합성재하우스, 목재하우스, 투명하우스, 반투명하우스, 불투명하우스, 농장하우스, 식물하 우스, 식물농장하우스, 에너지제로하우스, 메타버스, 메타버스공간, 메타버스하우스, 경작대, 경작판, 경작툴, 경작수단, 식물농장, 식물공장, 식물차량, 식물트럭, 식물농장컨테이너, 철재건물, 강재건물, 강철건물, 철근건 물, 철콘건물, 철골건물, 조립건물, 컨테이너, 컨테이너주택, 이중 둘 이상의 복합시설 등이다. 상기 펜트하우 스는 펜트하우스, Pent House, Penthouse; 또는 아파트, 호텔, 주상복합, 고층건물 등의 최고층, 맨위층, 상층 부, 고급스러운 주거공간; 등을 나타낸다. 그리고 강철주택, 철골주택, 컨테이너주택 등은 철, 강, 강척, 철골, 컨테이너 등이 이용 또는 포함되는 주택이다. 그리고 케노피건물, 케노피주택은 케노피가 있는 건물, 주택 등을 나타낸다. 상기 시설 2는 철탑, 기둥, 굴뚝, 울타리, 가로등, 터널, 도로터널, 철도터널, NATM터널, TBM터널, Shield터널, TBM-Shield수저터널, 수중터널, 수침터널, 침매터널, 윈드터널, 지하터널, 피암터널, 개착터널, 공중터널, 방음 벽, 방음터널, 도로, 차도, 보도, 인도, 철도, 궤도, 트랙, 포장, 포장체, 활주로, 운행로, 운항로, 도시, 안전, 구조, 지반, 기초, 다리, 교량, 도로교량, 철도교량, 육교, 교대, 교각, 윈드교량, 공중교량, 댐, 흙댐, 토사댐, 사력댐, 시멘트댐, 콘크리트댐, 아치댐, 사방댐, 제방, 흙제방, 토사제방, 사력제방, 시멘트재방, 콘크 리트재방, 하천제방, 하천, 해양, 항만, 해안, 호안, 호수, 수로, 안벽, 물양장, 하구언, 방파제, 방조제, 해양 구조물, 보, 수중보, 지상부, 수면보, 수상보, 하천보, 4대강보 등이다."}
{"patent_id": "10-2024-0133378", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하 도면을 참조하여 본 발명의 내용, 기술, 방법, 시스템, 청구항, 청구범위 등에 대하여 추가 설명하고자 한 다. 본 발명의 각 도면에 기재된 1, 2, 5, 10, 40, 420, 421, 430, 431, 432, 433, 434, 435, 436, 440, 441, 442, 443, 444, 445, 446 등의 부호는 상기 부호 1 내지 446 등에 해당하는 내용이 각 도면에 적용될 수 있다는 것을 나타낸다. 따라서 본 발명의 각 도면에는 또는 각 도면의 내용에는 상기 시스템, 웨어수단 , 수단 내지 복합수단, 사물, 만물, 웨어 장착 기구, 센서 내지 계측기, IT 내지 4차산업 기술, 자화기 내지 기능물(430, 440), 칩 내지 복합요소, 기(器) 내지 복합기 등의 이용이 가능하다. 도 1은 본 발명에 의한 시스템 또는 메타버스 또는 시스템이 구비된 메타버스를 나타내는 모식도이 다. 이는 a) 공장, 현장, 가정, 작업장, 현장 사무실; b) 이에 있는 사람, 로봇 , 근로자, 아바타, 필드수단, 장비, 트럭, 백호, 타워크레인, 드론, 가 전, 제품, 가전제품, 삼각대, 조립대; c) 상기 사람에 구비되는 스마트폰, 웨어러블수단; d) 상기 웨어러블수단에 속하는 헬멧(2, 21), 안경(2, 22), 완장(2, 23), 의류(2, 24), 의복, 조끼 (2, 24), 멜빵(2, 25), 밴드, 손목밴드(2, 26), 시계(2, 27), 안전화(2, 28), 안전고리(2, 29); e) 상기 공장 내지 안전고리 등에 구비된 기구; f) 상기 기구에 속하는 센서 또는 감지기(10, 11), 버튼 또는 SOS버 튼(10, 12), 랜턴 또는 라이트(10, 13), 카메라 또는 CCTV(10, 14), 무전기 또는 마이크(10, 15), 알림기 또는 알림등(10, 16), 램프 또는 후방등(10, 17), 계측기 또는 모니터링장치(10, 18), 배터리 또는 태양전지(10, 19), 제어기 또는 컨트롤러(10, 20); g) 상기 가전 또는 제품에 속하는 청정기, 정화기, 정수기, 청소 기, 살균기, 소독기, 방역기, TV, 세탁기, 냉장고, 가전제품; h) 상기 공장 내지 가전제품 등에 연 계되는 통신수단, 통신가능 스마트폰, 비콘, 게이트폰웨이, 통신망, 서버, 처리장치 , 단말기, 핸드폰, 플랫폼; i) 상기 서버, 단말기, 플랫폼 등에 연계된 통신망, 컨트롤러 , 핸드폰, 디스플레이; j) 또는 본사, 원거리, 관제센터, 관리자, 총괄자 등에 구비된 단말기, 제어기, 디스플레이, 핸드폰; k) 또는 이용자, 앱이용자, 앱가입자 등 에 구비된 컨트롤러, 핸드폰, 디스플레이; ℓ) 상기 서버, 단말기, 핸드폰, 제어기, 디스플레 이 등에 설치되는 어플; m) 상기 서버, 단말기, 핸드폰, 제어기, 디스플레이, 어플 등에 구현되는 플랫폼; n) 상기 공장 내지 플랫폼 등에 연계된 통신망, 컨트롤러, 핸드폰, 디스플레이; 등으로 구성되 는 시스템, 메타버스, 안전시스템, 자동시스템, 환경시스템, 안전관리, 원격관리, 방역관리, 안전관리시 스템, 원격관리시스템, 환경관리시스템, 홈오토메이션, 공장오토메이션, 현장오토메이션 등에 관한 것이다. 여기서 시스템은 사람, 작업자, 아바타, 장비, 계측기, 드론, 필드수단, 웨어 러블수단, 센서(10, 11) - 스마트폰, 비콘, 블루투스, 게이트웨이, 통신장치 - 통신망 - 서버 - 관리자 단말기, 총괄자 단말기, 컴퓨터, 모니터, 스크린, 종 합관제센터 - 통신망 - 이용자 단말기, 플랫폼, 메타버스 등으로 또는 등의 순으로 구성된다. 상기 통신장치에 있어서 현장에 인터넷 또는 이동통신망(LTE)이 되는 경우에는 근로자의 스마트 폰, 스마트폰앱, 비콘, 블루투스 등이 사용되고, 터널이나 지하철이나 지하공간과 같이 현장에 인 터넷 또는 이동통신망(LTE)이 되지 않는 경우에는 게이트웨이 등이 사용된다. 이 경우 게이트웨이는 200∼300m 간격으로 설치하는 것이 권장되고, 게이트웨이 간의 통신은 GHz RF(radio frequency, 無線周波數), Sub-GHz RF 통신기술 등으로 이루어질 수 있다. 본 발명에서는 상기의 반대 개념도 가능하다. 이는 a) 본사, 원거리, 관제센터, 관리자, 총 괄자 등에 구비된 단말기, 제어기, 디스플레이; b) 또는 이용자, 앱이용자, 앱가입자 등에 구비된 컨트롤러, 핸드폰, 디스플레이; 등을 이용하여 통신수단, 통신가능 스마트폰, 비콘 , 게이트폰웨이, 통신망, 서버, 처리장치 등을 통하여 공장, 현장, 가정, 작업장, 사람, 로봇, 근로자, 아바타, 장비, 드론, 가전, 제품, 가전제 품, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리 등에 구비된 상기 상기 사람 내지 가전제품, 센서 내지 계측기, 청정기 내지 가전제 품 등을 자율조정, 원격조정, 무선조정, 원격관리, 무선관리, 안전관리 등을 하는 것이다. 이에 의하여 메타버 스, 홈오토메이션, 공장오토메이션, 현장오토메이션 등이 구현된다. 본 발명에서는 센서 또는 감지기에 의한 각종 센싱(10, 11), 버튼 또는 SOS버튼에 의한 구조 요청(10, 12), 랜 턴 또는 라이트에 의한 조명(10, 13), 카메라 또는 CCTV에 의한 촬영(10, 14), 무전기 또는 마이크에 의한 연락 (10, 15), 알림기 또는 알림등에 의한 위험 알림(10, 16), 램프 또는 후방등에 의한 야간형광(10, 17), 계측기 또는 모니터링장치에 의한 계측(10, 18), 배터리 또는 태양전지에 의한 전원 공급(10, 19), 제어기 또는 컨트롤 러에 의한 장비 제어(10, 20), 제어기 또는 컨트롤러에 의한 상기 센서 내지 태양전지 제어(10, 20) 등이 가능 하다. 도 2는 본 발명에 의한 드론, 모빌리티, 장비, 시설, 필드수단, 메타버스 등을 나타낸 모 식도이다. 상기의 드론 내지 메타버스 등에는 a) 저장고, 호퍼, 혼합기, 회전날개 등이 구 비된 혼합기, 펌프 또는 가압기, 호스, 자기장이 발생되는 코일이 구비된 호스, 노즐 또는 분사기, 운반기, 이송기, 펄스기, 주입기, 주사기, 주유기, 타설기, 포설기, 포장기, 다짐기, 배양기, 발효기, 부숙기, 선별기, 파쇄기, 탈수기, 건조기, 폭기기, 반응기, 응집기, 여과기, 방류기, 집진기, 양생기, 면처리기; b) 이중 둘 이상이 조합된 복합기; 등이 순차적 또는 역순으로 구비될 수 있다. 본 발명의 장비, 공사장비, 제조장비 등은 상기 저장고 내지 복합기 등으로 구성될 수 있다. 상기 드론 내지 필드수단, 저 장고 내지 복합기 등에 의하여 일정의 물질, 재료, 자재 등이 a) 저장, 투입, 혼합, 펌핑, 가압, 분사, 운 반, 이송, 주입, 주사, 주유, 타설, 포설, 포장, 다짐, 배양, 발효, 부숙, 선별, 파쇄, 탈수, 건조, 폭기,반응, 응집, 여과, 방류, 집진, 양생, 면처리; b) 이중 둘 이상 복합; 등이 될 수 있다. 본 발명에서는 a) 상기 드론 내지 필드수단, 저장고 내지 복합기, 저장 내지 복합; b) 이중 하나 이상에 이용되는 상기 센서 내지 제어 기 등의 기구; c) 상기 드론 내지 기구 등에 연계되는 통신장비, 통신망, 서버, 처리장치, 단말기, 핸드폰, 플랫폼, 메타버스; d) 상기 저장 내지 복합 등의 영상이 방영되는 단말기 , 핸드폰, 플랫폼, 메타버스; 등이 이용 또는 적용 또는 연계될 수 있다. 본 발명에서 드론 또는 모빌리티는 상기 장비, 장치, 시설, 저장고 내지 복합기, 자화기 내지 복합기 등을 이동시키는, 또는 등이 장착되는, 또는 상기 장착에 의하여 상기 저장 내지 복합, 자화 내지 복합 등을 하는 드 론, drone, 무인드론, 모빌리티, 모빌리티기, 무인비행기 등이 해당될 수 있다. 본 발명의 드론 또는 모빌리티 예로는 a) 날개, 회전날개, 프로펠러, 4개 프로펠러, 다수 프로펠러 중 하나와 본체(530, 531)로 구 성된 드론 또는 모빌리티, b) 상부 날개 및 하부 본체로 구성된 드론 또는 모빌리티, c) 상기 본체 의 비행을 위한 추력을 위하여 아래 방향의 하향류, 뒤 방향의 배향류 등을 생성하는 날개, 프로펠라 등 구비 드론 또는 모빌리티, d) 상기 본체의 하부로 바람을 보내는 하향류에 의하여 상승 비행하는 드 론 또는 모빌리티, e) 상기 본체의 후방으로 바람을 보내는 배향류에 의하여 수평 비행하는 드론 또는 모빌리티, f) 상기 하향류, 배향류 등에 의하여 3차원 비행하는 드론 또는 모빌리티, g) 상기 날개, 프로펠러 등을 회전시키는 모터, 이에 연결된 전선, 이에 연계된 건전지, 충전기, 충전지, 충전카, 플러그, 콘 센트, 밧데리, 발전기, 태양전지, 태양발전기, 풍차, 풍력발전기 등 구비 드론 또는 모빌리티, h) 상기 프로펠 러에 구비된 거치대 구비 드론 또는 모빌리티, i) 상기 거치대에 연결되어 고정되는 본체 구비 드론 또는 모빌리티, j) 상기 본체, 프로펠러, 이중 하나 상부, 하부 중 하나 이상에 거치되면서 태양, 상 기 하향류, 배향류, 비행에 의한 바람 중 하나 이상에 의하여 j1) 전기를 생산하는 태양전지, j2) 회전하는 회 전체, 이의 회전력으로 전기를 생산하는 발전기 등 구비 드론 또는 모빌리티, k) 상기 발전기는 중심의 회전자 (전자석)와 외부를 감싸는 고정자(철심)에 의해 자기장을 형성하면서 전기를 생산하는 것인 드론 또는 모빌리티, ℓ) 상기 j2) 회전체에 연계되어 회전하는 상기 k) 회전자(전자석) 구비 드론 또는 모빌리티, m) 상 기 회전자(전자석)의 회전에 의하여 전기를 생산하는 상기 k) 발전기 구비 드론 또는 모빌리티, n) 상기 회전체, 이의 외주, 상부, 하부, 상부외주, 하부외주 중 하나 이상에 거치되면서 상기 하향류, 배향류, 바람 중 하나 이상을 유입, 유출, 유입유출 중 하나를 시키는 원추형 중공 가이드 구비 드론 또는 모빌리티, o) 상기 생 성 전기를 직류, 교류 등으로 변환시키는 인버터 구비 드론 또는 모빌리티, p) 상기 생성 전기를 공급하는 전선, 플러그, 콘센트, 파워서플라이어 등 구비 드론, q) 카메라, CCTV, 영상장치, 촬영장치, 모니터, 등, 전등, 등불, 점멸등, 라이트, 헤드라이트, 조명장치, 운전기, 조정기, 컨트롤러, 원격조정기, 리모트컨트롤러 등이 구비된 드론 또는 모빌리티 등이 해당된다. 상기 드론 또는 모빌리티의 예로는 a) 몸체 또는 저장고 또는 객실, 이의 측면에 지지대 중 하나 이상이 포함되는 본체부, 날개와 이를 회전시키는 모터가 포함되는 추진부, 다리와 바퀴가 포함되는 랜딩부, 상기 날개 또는 모터 또는 모빌리티를 조정하는 조정기 또는 원격조정기; b) 상기 몸체 또는 본체부에 구비되는 운전실, 탑승대, 탑승실, 객실, 여객실, 승객실; c) 상 기 몸체 내지 승객실 중 하나에 구비되는 운전대; d) 상기 몸체 내지 승객실 중 하나 이상에 구비되는 의자, 좌 석, 책상, 식당, 카페; e) 상기 몸체 내지 카페 중 하나 이상에 구비되는 로봇, 센서, 측정기, 카메라, CCTV, 조정기, 원격조정기, 화물실, 화물칸, 적재대, 적재함, 물품보관함, 배달물보관함, 택배물보관함; f) 상기 운전대 또는 조정기를 조작하는 사람, 로봇; g) 상기 수단 내지 복합수단 등이 구비된 상기 몸 체 내지 로봇; h) 상기 몸체 내지 로봇 등에 구비된 상기 수단 내지 복합수단; 등으로 이루어진 그룹에서 선택 되는 하나 이상이 구비되는 드론 또는 모빌리티이다. 이상에 기재 또는 설명된 내용, 용어, 단어, 숙어, 구절, 어구, 문구, 문장, 단락, 설명, 해설, 표현, 표기, 도 면, 그림, 청구항 내용 등은 본 발명의 청구 범위, 내용, 청구항 등에 포함될 수 있다. 이상은 본 발명에 의해 구현될 수 있는 내용, 청구항, 실시예 등의 일부에 관한 것으로, 주지된 바와 같이 본 발명의 범위는 위의 내용, 청구항, 실시예 등에 한정되어 해석되어서는 안 될 것이며, 위에서 설명된 본 발명의 기술적 사항과 그 근본을 함께 하는 기술적 사항은 모두 본 발명의 범위에 포함된다고 할 것이다."}
{"patent_id": "10-2024-0133378", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명에 의한 시스템을 나타내는 모식도 도 2는 본 발명에 의한 드론, 장비를 나타낸 모식도"}
