{"patent_id": "10-2022-0034123", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0136411", "출원번호": "10-2022-0034123", "발명의 명칭": "출입자의 이동경로 추적을 통한 능동형 공기청정시스템", "출원인": "주식회사 동서에코글로벌", "발명자": "우승헌"}}
{"patent_id": "10-2022-0034123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실내의 출입자의 이동경로 추적하면서 공기청정이 이루어지는 공기청정시스템으로서,상기 출입자의 실내 위치를 수신하는 위치 수신기;상기 위치 수신기로부터 수신되는 상기 출입자의 위치 정보를 누적시켜 상기 출입자의 이동경로로서 저장하는이동 경로 저장기; 및 상기 이동 경로 저장기에 저장된 상기 출입자의 이동 경로를 추적하면서 공기청정 모드를 실행하는 이동형 공기청정기를 포함하고, 상기 이동형 공기청정기는 감지 범위 내에서 상기 출입자의 존재 여부를 감지하여 재실자의 활동 공간을 파악하는 인체 감지부, 및상기 인체 감지부로부터의 정보에 근거하여 공기청정, 가습ㆍ제습, 및 항균 중 적어도 하나의 모드를 선택하는제어부를 포함하여 이루어진 것을 특징으로 하는 출입자의 이동경로 추적을 통한 능동형 공기청정시스템."}
{"patent_id": "10-2022-0034123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 이동형 공기청정기는, 상부에 도킹 장착부가 마련되고 상기 도킹 장착부에는 통신접점부가 마련되고 적어도 하나의 주행감지부와 주행을 위한 이동부가 마련된 이동모듈,상기 이동모듈이 진입되는 도킹 존이 마련된 도킹 베이, 및 상기 도킹 베이에 구비되고 상기 도킹존에 상기 이동모듈이 진입되면 상기 이동모듈의 상기 도킹 장착부가 결합되어 상기 통신접점부를 통해 전기적으로 연결되는 수용부가 마련되어 공기청정, 가습ㆍ제습, 및 항균 중 적어도 하나를 수행하는 다수의 모듈로 구성된 것을 특징으로 하는 출입자의 이동경로 추적을 통한 능동형 공기청정시스템."}
{"patent_id": "10-2022-0034123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 다수의 모듈은, 실내공기에 대한 공기청정 기능을 갖는 공기청정모듈,실내공기에 대한 가습 또는 제습 기능을 갖는 가습/제습모듈, 및 실내공기에 포함된 바이러스 또는 세균에 대한 항균 및 멸균 기능을 갖는 항균모듈인 것을 특징으로 하는 출입자의 이동경로 추적을 통한 능동형 공기청정시스템."}
{"patent_id": "10-2022-0034123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 제어부는,기설정된 N시간 동안 상기 인체 감지부에 의해 파악한 재실자의 활동 공간 정보를 기초로 최대 활동 공간을 산출하고, 상기 공기청정 모드를 선택하는 것을 특징으로 하는 출입자의 이동경로 추적을 통한 능동형 공기청정시스템.공개특허 10-2023-0136411-3-청구항 5 제1항 내지 제3항 중 어느 한 항에 있어서,상기 제어부는, 기설정된 N시간 동안 상기 인체 감지부에 의해 파악한 재실자의 활동 공간 정보를 기초로 재실자의 활동 공간을산출하고, 산출된 활동 공간 정보의 패턴에 따라 상기 이동형 공기청정기의 작동모드를 설정하는 것을 특징으로하는 출입자의 이동경로 추적을 통한 능동형 공기청정시스템."}
{"patent_id": "10-2022-0034123", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "출입자의 실내 위치를 수신하는 위치 수신 단계;상기 위치 수신 단계에서 수신되는 상기 출입자의 위치 정보를 누적시켜 상기 출입자의 이동경로로서 저장하는이동 경로 저장 단계; 및 상기 이동 경로 저장단계에서 저장된 상기 출입자의 이동 경로를 추적하면서 공기청정 모드를 실행하는 공기청정 단계를 포함하고, 상기 공기청정 단계는, 감지 범위 내에서 상기 재실자의 존재 여부를 감지하여 재실자의 활동 공간을 파악하는인체 감지 단계, 및 상기 인체 감지단계에서 취득한 정보에 근거하여 공기청정 모드를 설정하는 제어단계를 포함하여 이루어진 것을 특징으로 하는 출입자의 이동경로 추적을 통한 능동형 공기청정방법."}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 실내의 출입자의 이동경로 추적하면서 공기청정이 이루어지는 공기청정시스템으로서, 상기 출입자의 실내 위치를 수신하는 위치 수신기; 상기 위치 수신기로부터 수신되는 상기 출입자의 위치 정보를 누적시켜 상기 출입자의 이동경로로서 저장하는 이동 경로 저장기; 및 상기 이동 경로 저장기에 저장된 상기 출입자의 이동 경 로를 추적하면서 공기청정 모드를 실행하는 이동형 공기청정기를 포함하고, 상기 이동형 공기청정기는 감지 범위 내에서 상기 출입자의 존재 여부를 감지하여 재실자의 활동 공간을 파악하는 인체 감지부, 및 상기 인체 감지부 로부터의 정보에 근거하여 공기청정, 가습ㆍ제습, 및 항균 중 적어도 하나의 모드를 선택하는 제어부를 포함하여 이루어진 것을 특징으로 한다."}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공기청정시스템에 관한 것으로서, 더욱 상세하게는 출입자의 이동경로를 추적하여 능동적으로 공기청 정이 가능한 시스템에 관한 것이다."}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 미세먼지는 사람의 눈에 보이지 않을 정도로 작은 먼지 입자로서주로 연료를 태우는 등의 인위적인 원인으로 발생한다. 이러한 미세먼지는 호흡 과정에서 폐에 들어가 폐질환 등의 원인이 된다. 한편 미세먼지는 입자의 크기에 따라 미세먼지와 초미세먼지로 나누기도 한다. 미세 먼지의 원인으로는 중국의 영향이 크다. 중국의 산업화가 가속화되면서 석탄 사용량이 급증했기 때문이다. 이렇게 발생된 미세 먼지는 서풍이나 북서풍을 타고 국내로 유입되어 오염물질과 합쳐지고 축적되면서 황사현상 등을 야기한다. 최근 미세먼지 오염도가 증가하고, 초미세 먼지가 위험 수준을 보이는 날이 증가함에 따라, 사람들은 외부 활동 으로 미세먼지, 초 미세먼지, 세균, 기타 오염물질 등에 매우 쉽게 노출되고 있다. 이로 인해 실외 활동 이후 의복, 신발, 머리 등에 오염물질을 묻혀 그대로 실내로 들어오게 된다. 그로 인해 실 내 공기 청정기를 가동 하더라도 외부 오염물질 유입이 계속되는 상황에서는 공기 청정기의 효과가 떨어질 수 밖에 없다. 즉 미세먼지, 세균, 기타 오염물질 등은 실내에서 활동하는 사람들의 건강을 해칠 수 있으며, 특히 어린이, 노 약자, 환자 등과 같이 면역력이 상대적으로 약한 사람에게는 더욱 심각하다. 따라서 실내의 출입자에게 노출된 오염물질을 효과적으로 제거할 필요가 있다. <선행문헌 1> : 대한민국 공개특허 제2021-0002245호(공개일: 2021년 01월 07일)"}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 위와 같은 문제점을 해소하기 위해 창안된 것으로서, 실내의 출입자의 출입을 감지하고 출입자의 이 동경로를 추적하면서 출입자에 노출된 오염물질 등을 효과적으로 제거하여 능동적인 공기청정이 가능한 시스템 을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "위와 같은 목적을 달성하기 위한 본 발명의 일실시 형태에 따르면, 실내의 출입자의 이동경로 추적하면서 공기 청정이 이루어지는 공기청정시스템으로서, 상기 출입자의 실내 위치를 수신하는 위치 수신기; 상기 위치 수신기 로부터 수신되는 상기 출입자의 위치 정보를 누적시켜 상기 출입자의 이동경로로서 저장하는 이동 경로 저장기; 및 상기 이동 경로 저장기에 저장된 상기 출입자의 이동 경로를 추적하면서 공기청정 모드를 실행하는 이동형 공기청정기를 포함하고, 상기 이동형 공기청정기는 감지 범위 내에서 상기 출입자의 존재 여부를 감지하여 재실 자의 활동 공간을 파악하는 인체 감지부, 및 상기 인체 감지부로부터의 정보에 근거하여 공기청정, 가습ㆍ제습, 및 항균 중 적어도 하나의 모드를 선택하는 제어부를 포함하여 이루어진 출입자의 이동경로 추적을 통한 능동형 공기청정시스템이 제공된다. 상기 이동형 공기청정기는, 상부에 도킹 장착부가 마련되고 상기 도킹 장착부에는 통신접점부가 마련되고 적어 도 하나의 주행감지부와 주행을 위한 이동부가 마련된 이동모듈, 상기 이동모듈이 진입되는 도킹 존이 마련된 도킹 베이, 및 상기 도킹 베이에 구비되고 상기 도킹존에 상기 이동모듈이 진입되면 상기 이동모듈의 상기 도킹 장착부가 결합되어 상기 통신접점부를 통해 전기적으로 연결되는 수용부가 마련되어 공기청정, 가습ㆍ제습, 및 항균 중 적어도 하나를 수행하는 다수의 모듈로 구성된 것일 수 있다. 상기 다수의 모듈은, 실내공기에 대한 공기청정 기능을 갖는 공기청정모듈,실내공기에 대한 가습 또는 제습 기 능을 갖는 가습/제습모듈, 및 실내공기에 포함된 바이러스 또는 세균에 대한 항균 및 멸균 기능을 갖는 항균모 듈일 수 있다. 상기 제어부는, 기설정된 N시간 동안 상기 인체 감지부에 의해 파악한 재실자의 활동 공간 정보를 기초로 최대 활동 공간을 산출하고, 상기 공기청정 모드를 선택하는 것일 수 있다. 상기 제어부는, 기설정된 N시간 동안 상기 인체 감지부에 의해 파악한 재실자의 활동 공간 정보를 기초로 재실 자의 활동 공간을 산출하고, 산출된 활동 공간 정보의 패턴에 따라 상기 이동형 공기청정기의 작동모드를 설정 하는 것일 수 있다. 또한 본 발명은 출입자의 실내 위치를 수신하는 위치 수신 단계; 상기 위치 수신 단계에서 수신되는 상기 출입 자의 위치 정보를 누적시켜 상기 출입자의 이동경로로서 저장하는 이동 경로 저장 단계; 상기 이동 경로 저장단 계에서 저장된 상기 출입자의 이동 경로를 추적하면서 공기청정 모드를 실행하는 공기청정 단계를 포함하고, 상 기 공기청정 단계는, 감지 범위 내에서 상기 재실자의 존재 여부를 감지하여 재실자의 활동 공간을 파악하는 인 체 감지 단계와, 상기 인체 감지단계에서 취득한 정보에 근거하여 공기청정 모드를 설정하는 제어단계를 포함하 여 이루어진 능동형 공기청정방법이 제공된다."}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 실내의 출입자의 이동경로를 이동형 공기청정기가 추적하면서 능동적인 공기청정이 가능함으 써 실내로 유입되는 오염원에 대한 효과적인 공기청정이 가능한 효과가 있다."}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명을 더욱 상세하게 설명한다. 이에 앞서, 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정하여 해석되어서는 아니 되며, 발명자는 그 자신의 발명을 가 장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술 적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 또한, 사용되는 기술 용어 및 과학 용어에 있어서 다"}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "른 정의가 없다면, 이 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 갖는다. 하기의 설명 및 첨부 도면에서 본 발명의 요지를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 설명은 생략한다. 첨부된 도면들은 당업자에게 본 발명의 사상이 충분히 전달될 수 있도록 하기 위해 예로서 제 공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 형태로 구체화될 수도 있다. 또 한, 명세서 전반에 걸쳐서 동일한 참조번호들은 동일한 구성요소들을 나타낸다. 도면들 중 동일한 구성요소들은 가능한 한 어느 곳에서든지 동일한 부호들로 나타내고 있음에 유의해야 한다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 출입자의 이동경로를 따라 이동형 공기청정기가 추적하여 공기청정이 이루어지는 방식으로 능동형 공기청정시스템을 구한한다. 즉 실내의 출입자의 출입여부를 출입 검출 부(230a)를 통해 감지하고, 재실자의 이동경로(A2)를 분석하여 공기 오염원을 이동형 공기청정기가 추적하 면서 능동적인 공기청정기능을 구현할 수 있다. 도 3을 참조하면, 실내의 출입구 측에는 출입자의 출입 검출부(230a)가 설치되어 외부인의 출입여부를 출입 수 신부(230b)를 통해 제어부에 전송될 수 있다. 또한 실내에는 근접센서나 카메라와 같이 재실자의 위치를 검출할 수 있는 재실자 위치 검출부가 설치되고, 재실자 위치 검출부의 검출데이터는 재실 수신부 를 통해 제어부로 전송된다. 도 5 및 도 6을 참조하면, 실내의 출입구 측에는 출입감지센서가 설치되고, 실내에는 다수의 재실센서가 설치되 어 감지영역을 형성한다. 이들 센서들은 예를 들어 도 6과 같이 출입감지센서와 인체감지센서는 센서제어부를 통해 컨트롤이 될 수 있다. 여기서 센서들의 감지영역은 대략 1m이내로 설정하여 정밀도를 향상시킬 수 있다. 도 7을 참조하면, 본 발명의 이동형 공기청정기는 다수의 책상이 설치되어 있는 강의실(또는 다른 교육시설)에 서 다수의 출입자확인 센서와 재실센서들을 통해 출입자 및 재실자의 이동을 검출하고, 이 경로데이터에 근거하 여 이동형 공기청정기를 주행할 수 있다. 도 8을 참조하면, 비교적 협소한 공동거주시설에도 본 발명의 이동형 공기청정기는 다수의 센서를 통해 거주자 의 이동 경로를 추적하면서 능동적인 공기청정을 수행할 수 있다. 도 9를 참조하면, 이동형 공기청정기에는 인체 감지부가 설치되어 이동형 공기청정기의 주행 중 에 재실자의 분포도(활동공간)를 실시간으로 검출할 수 있다. 이와 같이 제어부는 출입 검출부(230a)와 재실자 위치 검출부 및 인체 감지부를 통해 실내에서 재실자의 동선 및 분포도를 산출하고 산출 데이터는 이동경로 저장부에 저장된다. 한편 이동경로 저장부에 저장된 산출 데이터에 기초하여 제어부는 이동모듈을 구동제어(주행경로 제어)하는 동시에 공기청정모듈을 구동시켜 재실자의 동선을 추적하면서 공기청정이 이루어질 수 있다(도 1참조). 이때 도 11과 같이 공기청정모듈(10A) 이외에 실내 바이러스 검출모듈을 동작시키거나 (자외선)살 균모듈을 구동시켜 바이러스에 대한 멸균기능도 실시할 수 있다(재실자 경로 및 분포에 따른 능동적 공기청정기 능). 한편 제어부는 이동경로 저장부에 저장된 이동경로에 근거하여, 제어부가 재실자 활동 분포도를 산출하여 집중 청정구역을 설정(인공지능(Ai)를 이용한 딥러닝 기반의 데이터 출력)할 수 있다. 이에 따라 이동 형 공기청정기의 집중케어모드를 실시할 수 있다(도 2 참조). 구체적으로, 본 발명의 공기청정시스템은 실내(예를 들어 문틀)에 출입자의 실내 위치를 수신하는 다수의 위치 수신기가 설치된다. 설치된 위치 수신기로부터 수신되는 출입자의 위치 정보를 누적시켜 도 1과 같이 출입자의 이동경로로서 이동 경로 저장부에 저장한다. 이동 경로 저장부에 저장된 출입자의 이동 경 로를 추적하면서 이동형 공기청정기의 공기청정 모드를 실행한다. 이때 공기청정 모드는 도11과 같이 이동 모듈에 도킹 베이(W)의 항균모듈(10C), 가습/제습모듈(10B), 및 공기청정모듈(10A)을 선택적으로 도킹하여 실시될 수 있다. 도 9 및 도 10을 참조하면, 본 발명의 이동형 공기청정기는 감지 범위 내에서 출입자의 존재 여부를 감지 하여 재실자의 활동 공간을 파악하는 인체 감지부가 설치된다. 또한 본 발명의 이동형 공기청정기는, 공기청정모듈 및 공기청정모듈을 이동시키기 위한 이동모듈 을 포함한다. 공기청정모듈은 본체(11a)에 실내 공기를 유입하기 위한 흡입부(12a)와 정화된 공기를 실내로 배기하기 위 한 토출부(12b)를 포함한다. 또한 본체(11a)의 상단에는 인체 감지부가 마련되고, 본체(11a)의 외부에는 각 종 데이터를 외부로 표시하는 표시부가 마련된다. 또한 실내의 각종 물체나 요소 등을 센싱하기 위한 감지 부가 마련될 수 있다. 이동모듈은 주행 중 장애물 등에 충돌되는 것을 방지하기 위한 충돌감지모듈이나 충격감지 모듈이 구비된다. 또한 모터의 구동력에 의해 자동으로 주행이 가능하도록 주행휠이 바닥에 설치된다. 여기서 주행 휠의 전방과 후방에는 각각 제1 보조휠(21a)과 제2 보조휠(21b)이 설치된다. 한편 도 11과 같이 공기청정모듈(10A) 이외에 가습ㆍ제습모듈(10B) 및 항균모듈(10C)을 선택적으로 이동모듈 에 도킹하여 사용할 수 있다. 이를 위해 실내의 일부 공간에는 도킹 베이(W)가 마련된다. 구체적으로 도킹 베이(W)에는 원형의 도킹존이 제공되고, 도킹존에는 평면상에서 원형으로 공기청정모 듈(10A), 가습ㆍ제습모듈(10B), 및 항균모듈(10C)이 배치된다. 이들 모듈(10A,10B,10C)들 중 하나에 이동모듈이 장착되는 구조는 도 10과 같다. 즉 예를 들어 공기청정모 듈에는 내부에 통신접점부(28b)가 마련된 수용부가 마련된다. 또한 이동모듈의 상부면에는 상부로 일정높이로 돌출된 형상으로 도킹 장착부가 형성된다. 이 도킹 장착부에는 통신 접점부(28a)가 마련된 다. 이에 따라 이동모듈이 공기청정모듈에 도킹된 상태를 이루면 공기청정 모듈의 통신접점부(28 b)와 이동모듈의 통신접점부(28a)가 전기적으로 연결된 상태를 이루게 된다. 한편 도킹존의 내부에는 경사면을 갖는 도킹 안내부재가 설치된다. 이에 따라 이동 모듈이 도킹존 으로 진입되면 이 도킹 안내부재의 경사면을 따라 이동하게 된다. 다음으로 도킹 베이(W)에 마련된 공 기청정모듈(10A; 10B 및 10C도 마찬가지)의 수용부에 이동모듈의 도킹 장착부가 인입됨으로써 도킹 이 이루어지게 된다. 이러한 도킹 방식으로 다른 가습ㆍ제습 모듈(10B)이나 항균모듈(10C)에 대한 도킹이 이루 어져 다양한 공기청정모드를 실행할 수 있다. 한편 본 발명에서 제어부는 기설정된 수시간 동안 인체 감지부에 의해 파악한 재실자의 활동 공간 정 보를 기초로 최대 활동 공간을 산출하고, 앞서 설명한 방식으로 공기청정 모드를 선택할 수 있다. 또한 다른 실시예로서 제어부는, 기설정된 수시간 동안 인체 감지부에 의해 파악한 재실자의 활동 공 간 정보를 기초로 재실자의 활동 공간을 산출하고, 산출된 활동 공간 정보의 패턴에 따라 이동형 공기청정기 의 작동모드를 설정하도록 실시될 수 있다. 도 4를 참조하면, 본 발명의 능동형 공기청정방법은 출입자의 실내 위치를 수신하는 위치 수신 단계(S10)와, 이 위치 수신 단계(S10)에서 수신되는 출입자의 위치 정보를 누적시켜 출입자의 이동경로로서 저장하는 이동 경 로 저장 단계(S20), 및 이 이동 경로 저장단계(S20)에서 저장된 출입자의 이동 경로를 추적하면서 공기청정 모드를 실행하는 공기청정 단계(S30)를 포함하여 이루어진다. 여기서 공기청정 단계(S30)는, 감지 범위 내에서 재실자의 존재 여부를 감지하여 재실자의 활동 공간을 파악하 는 인체 감지 단계(S35)와, 이 인체 감지단계(S35)에서 취득한 정보에 근거하여 앞서 설명한 공기청정 모드를 설정하는 제어단계(S36)를 포함하여 이루어진다. 이와 같이 구성된 본 발명의 출입자의 이동경로 추적을 통한 능동형 공기청정시스템은 실내의 출입자의 이동경 로를 이동형 공기청정기가 추적하면서 실내에 능동적인 공기청정이 가능함으써 외부에서 유입되는 오염원 (미세먼지나 세균ㆍ바이러스 등에 대한 효과적인 살균 및 공기청정이 가능한 이점이 있다. 이상에서는 본 발명을 특정의 실시예에 대해서 도시하고 설명하였지만, 본 발명은 상술한 실시예에만 한정되는"}
{"patent_id": "10-2022-0034123", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "것은 아니며, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면 이하의 청구범위에 기재된 본 발명의 기술적 사상의 요지를 벗어나지 않는 범위에서 얼마든지 다양하게 변경하여 실시할 수 있을 것이다."}
{"patent_id": "10-2022-0034123", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 출입자 이동경로에 대한 이동형 공기청정기의 추적경로를 보여주는 상태도, 도 2는 본 발명의 일 실시예에 따른 재실자의 최대 활동 공간에 대한 집중 청정구역을 설정한 상태를 보여주는 상태도, 도 3은 본 발명의 일 실시예에 따른 출입자의 이동경로 추적을 통한 능동형 공기청정시스템의 제어 블럭도, 도 4는 본 발명의 일 실시예에 따른 출입자의 이동경로 추적을 통한 능동형 공기청정시스템의 작동에 대한 플로 우 차트, 도 5는 본 발명의 일 실시예에 따른 출입자의 이동경로 추적을 통한 능동형 공기청정시스템의 재실자 센싱을 보 여주는 개략도, 도 6은 본 발명의 일 실시예에 따른 출입자의 이동경로 추적을 통한 능동형 공기청정시스템의 인체 감지센서부를 보여주는 구성도, 도 7은 교육시설에서 재실자 감지를 통한 출입자 이동경로에 대한 이동형 공기청정기의 추적경로를 보여주는 예 시도, 도 8은 공동주거시설에서 재실자 감지를 통한 출입자 이동경로에 대한 이동형 공기청정기의 추적경로를 보여주 는 예시도, 도 9는 본 발명의 일 실시예에 따른 출입자의 이동경로 추적을 통한 능동형 공기청정시스템의 이동형 공기청정 기의 구성도, 도 10은 본 발명의 일 실시예에 따른 이동형 공기청정기의 공기청정모듈과 이동모듈의 도킹상태를 보여주는 상 태도, 및 도 11은 본 발명의 일 실시예에 따른 이동형 공기청정기의 이동모듈이 도킹 베이에서 다양한 모듈에 선택적으로 도킹하는 상태를 보여주는 예시도이다."}
