{"patent_id": "10-2022-0071194", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0171490", "출원번호": "10-2022-0071194", "발명의 명칭": "메타버스 가상공간 기반의 무인상점 장치", "출원인": "주식회사 코아소프트", "발명자": "이정현"}}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메타버스 가상공간에 동기된 관리자의 가상 캐릭터를 동기 구동함으로써 무인으로 운영되는 오프라인 매장을 방문한 고객이 관리자 가상 캐릭터를 통해 고객 응대를 받을 수 있으며, 상기 오프라인 매장을 촬영한 오프라인매장 영상을 바탕으로 오프라인 매장 내의 매장 방문 고객 및 상품의 변화를 감지하는 오프라인 매장 단말부,상기 오프라인 매장 단말부로 상기 관리자 가상 캐릭터를 전송하고, 상기 오프라인 매장 단말부로부터 전송된상기 오프라인 매장 영상을 바탕으로 방문 고객의 가상 캐릭터를 생성하여 메타버스 가상공간에 동기 표시하고,상기 오프라인 매장 단말부로부터 전송된 매장 방문 고객의 대화를 분석하여 상기 메타버스 가상공간에 상기 관리자 가상 캐릭터의 대화와 동기 표시하는 메타버스 서버를 포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 메타버스 서버는,복수의 오프라인 매장을 각각 디지털 트윈하여 메타버스 가상공간에 오프라인 가상공간 매장을 분할 구획 표시하도록 제어함으로써 상기 관리자 가상 캐릭터가 메타버스 가상공간상에서 상기 복수의 오프라인 매장을 관리할수 있도록 하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 메타버스 서버는,상기 오프라인 매장 영상을 바탕으로 오프라인 매장 방문 고객의 행동을 분석한 데이터를 기초로 상기 오프라인가상공간 매장에 구현된 방문 고객의 가상 캐릭터에 상기 매장 방문 고객의 행동을 동일하게 묘사하도록 동기구현하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 메타버스 서버는,상기 오프라인 매장 영상을 바탕으로 진열 상품의 변화를 분석한 데이터를 기초로 상기 오프라인 가상공간 매장에 구현된 가상 진열 상품을 상기 진열 상품의 변화와 동일하게 묘사하도록 동기 구현하는 것을 특징으로 하는메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항 또는 제 4 항에 있어서,방문 고객의 가상 캐릭터와 가상 진열 상품은 분할 구획된 오프라인 가상공간 매장과 매칭되어 동기 구현되는것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치.공개특허 10-2023-0171490-3-청구항 6 제 1 항에 있어서,상기 오프라인 매장 단말부는,상기 메타버스 서버로부터 관리자 가상 캐릭터 및 관리자 고객 응대 대화 메시지를 전송받으며, 상기 메타버스서버로 상기 매장 방문 고객의 대화를 전송하는 메타버스 연동부,상기 메타버스 연동부로부터 상기 관리자 가상 캐릭터의 연동 데이터를 전송받아 오프라인 매장 내에 배치된 디스플레이부에 상기 관리자 가상 캐릭터를 상기 메타버스 서버와 연동 동기 표시하는 관리자 캐릭터 동기부,상기 메타버스 연동부로부터 상기 관리자 가상 캐릭터의 고객 응대 메시지를 전송받아 상기 매장 방문 고객의대화와 동기 표시하고, 상기 매장 방문 고객의 대화 메시지를 생성하여 상기 메타버스 연동부를 통해 상기 메타버스 서버로 전송하도록 하는 고객 응대 대화 동기부를 포함하는 것을 특징으로 하는 메타버스 가상공간 기반의무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 메타버스 서버는,메타버스 가상공간에 표현되는 관리자 가상 캐릭터의 행동을 추출하는 메타버스 관리자 캐릭터 행동 추출부,관리자 가상 캐릭터의 고객 응대 메시지를 생성하는 메타버스 관리자 캐릭터 대화 생성부,상기 관리자 가상 캐릭터의 행동 및 고객 응대 메시지를 수집하여 관리자 캐릭터 정보로 취합하여 메타버스 접속부를 통해 상기 오프라인 매장 단말부의 메타버스 연동부로 전송하는 메타버스 관리자 캐릭터 정보 전송부,상기 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송된 매장 방문 고객의 대화 메시지와 상기 메타버스 관리자 캐릭터 대화 생성부에서 생성한 관리자 가상 캐릭터의 고객 응대 메시지를 서로 동기시켜 연동 표시하도록 하는 메타버스 고객 응대 대화 동기부를 포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 메타버스 서버는,상기 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송된 매장 방문 고객의 대화 메시지를 메타버스접속부를 통해 수신하는 오프라인 고객 대화 수신부,수신된 매장 방문 고객의 대화 메시지를 추출하는 오프라인 고객 대화 추출부,상기 메타버스 고객 응대 대화 동기부의 제어에 따라 추출된 매장 방문 고객의 대화 메시지와 상기 관리자 가상캐릭터의 고객 응대 메시지를 연동하여 상기 메타버스 가상공간에 표시하는 오프라인 고객 대화 동기 표시부를포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 메타버스 가상공간에 표현되는 상기 관리자 가상 캐릭터는,오프라인에 위치하는 관리자의 행동 및 고객 응대 메시지를 동기 묘사하거나 상기 메타버스 서버에 의해 구현되공개특허 10-2023-0171490-4-는 인공지능 점원의 가상 캐릭터인 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 오프라인 매장 단말부는,오프라인 매장 내에 배치되어, 오프라인 매장을 촬영한 상기 오프라인 매장 영상을 생성하는 오프라인 매장 촬영부,상기 오프라인 매장 영상을 바탕으로 오프라인 매장을 방문한 고객의 매장 내의 행동의 변화를 감지하여 행동변화 데이터를 생성하는 고객 행동 감지부,상기 오프라인 매장 영상을 바탕으로 오프라인 매장을 방문한 고객의 매장 내의 위치 변화를 감지하여 위치 변화 데이터를 생성하는 고객 위치이동 감지부,상기 오프라인 매장 영상을 바탕으로 오프라인 매장에 진열된 진열 상품의 변화를 감지하여 진열 상품 변화 데이터를 생성하는 상품 변화 감지부,상기 행동 변화 데이터, 위치 변화 데이터 및 진열 상품 변화 데이터를 바탕으로 오프라인 매장의 변화를 기 설정된 기준 시점 이전과 상대적으로 비교하여 감지하고, 매장 변화 데이터를 생성하는 오프라인 매장변화 감지부를 포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 메타버스 서버는,전송된 상기 매장 변화 데이터를 바탕으로 상기 오프라인 매장 방문 고객의 행동 변화에 연동하여 상기 오프라인 가상공간 매장 내에 구현된 방문 고객의 가상 캐릭터를 동기 구현하도록 제어하고, 상기 오프라인 매장 내에진열된 진열 상품의 변화에 연동하여 상기 오프라인 가상공간 매장에 구현된 가상 진열 상품을 동기 구현하도록제어하는 오프라인 매장 변화 메타버스 구현부를 포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항에 있어서,상기 메타버스 서버는,오프라인 매장을 방문한 상기 방문 고객의 가상 캐릭터와 관리자 가상 캐릭터를 생성하며, 상기 방문 고객의 가상 캐릭터를 상기 오프라인 매장 변화 메타버스 구현부의 제어에 따라 메타버스 가상공간에 동기 구현하도록 하는 메타버스 가상 캐릭터 구동부,가상 캐릭터를 메타버스 가상공간에 동기 구현하고, 복수의 오프라인 매장을 디지털 트윈시켜 메타버스 가상공간에 구현하는 메타버스 가상공간 구현부,복수의 오프라인 매장의 디지털 트윈 데이터를 바탕으로 메타버스 가상공간에 오프라인 가상공간 매장을 분할구획하여 구현하도록 함으로써 메타버스 가상공간에 복수의 오프라인 가상공간 매장이 독립적으로 분할 구역화되도록 하는 메타버스 공간분할 구획부,독립적으로 분할 구역화된 복수의 오프라인 가상공간 매장을 그룹화하여 관리하는 메타버스 공간분할 관리부를포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치.공개특허 10-2023-0171490-5-청구항 13 제 12 항에 있어서,상기 메타버스 가상공간 구현부는,상기 방문 고객의 가상 캐릭터 및 가상 진열 상품을 상기 독립적으로 분할 구역화된 복수의 오프라인 가상공간매장과 매칭시켜 동기 구현하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치."}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 메타버스 가상공간 기반의 무인상점 장치에 관한 것으로서, 오프라인 무인 매장을 디지털 트윈시켜 메 타버스 가상공간에 구현하도록 하고, 오프라인 무인 매장을 방문한 고객의 행동이나 진열 상품의 상태 변화를 그 대로 메타버스 가상공간에 동기 묘사시키도록 하는 메타버스 가상공간 기반의 무인상점 장치에 관한 것이다. 이 (뒷면에 계속)"}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 메타버스 가상공간 기반의 무인상점 장치에 관한 것으로서, 보다 상세하게는 오프라인 무인 매장을 디지털 트윈시켜 메타버스 가상공간에 구현하도록 하고, 오프라인 무인 매장을 방문한 고객의 행동이나 진열 상 품의 상태 변화를 그대로 메타버스 가상공간에 동기 묘사시키도록 하는 메타버스 가상공간 기반의 무인상점 장 치에 관한 것이다."}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 전자 상거래의 확산으로 인한 쇼핑 방식의 변화로 인해 상품을 구매하고 소비하는 패턴이 달라지고 있는 현실이다. 이에 발맞추어 영업 및 판매직 등의 직원 상주없이 소비자가 직접 제품을 선택하고 구매하는 무인 소 매 산업은 지속적으로 성장하고 있는 현실이다. 한편, 무인 소매 판매점이라 하더라도 관리자가 정기적으로 매 장 내의 판매 상황을 관리하여야 하는 불편 등이 따른다. 이에 따라 오프라인의 무인 판매 매장을 메타버스 속에서 관리하고 통제할 수 있는 기술의 필요성이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2020-0022341"}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 전술한 바와 같은 문제점을 해결하기 위하여 창출된 것으로서, 오프라인 매장을 그대로 디지 털 트윈시켜 메타버스 가상공간에 구현하고, 오프라인 매장을 방문하는 고객을 메타버스 가상공간에 방문 고객 가상 캐릭터로 동기 구현시켜 관리자 가상 캐릭터와 대화를 하도록 함으로써 고객 응대가 가능하도록 하고, 디 지털 트윈된 오프라인 가상공간 매장의 상품 진열 상태가 오프라인 매장과 동일하게 동기 구현되도록 함으로써 관리자가 메타버스 가상공간에 참여하는 것만으로도 고객 응대 및 오프라인 매장을 메타버스 속에서 관리할 수 있는 발명을 제공하는데 그 목적이 있다. 그러나, 본 발명의 목적들은 상기에 언급된 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 본 발명의 목적은, 메타버스 가상공간에 동기된 관리자의 가상 캐릭터를 동기 구동함으로써 무인으로 운 영되는 오프라인 매장을 방문한 고객이 관리자 가상 캐릭터를 통해 고객 응대를 받을 수 있으며, 오프라인 매장 을 촬영한 오프라인 매장 영상을 바탕으로 오프라인 매장 내의 매장 방문 고객 및 상품의 변화를 감지하는 오프 라인 매장 단말부, 오프라인 매장 단말부로 관리자 가상 캐릭터를 전송하고, 오프라인 매장 단말부로부터 전송 된 오프라인 매장 영상을 바탕으로 방문 고객의 가상 캐릭터를 생성하여 메타버스 가상공간에 동기 표시하고, 오프라인 매장 단말부로부터 전송된 매장 방문 고객의 대화를 분석하여 메타버스 가상공간에 관리자 가상 캐릭터의 대화와 동기 표시하는 메타버스 서버를 포함하는 것을 특징으로 하는 메타버스 가상공간 기반의 무인상점 장치를 제공함으로써 달성될 수 있다. 또한, 메타버스 서버는 복수의 오프라인 매장을 각각 디지털 트윈하여 메타버스 가상공간에 오프라인 가상공간 매장을 분할 구획 표시하도록 제어함으로써 관리자 가상 캐릭터가 메타버스 가상공간상에서 복수의 오프라인 매 장을 관리할 수 있도록 한다. 또한, 메타버스 서버는 오프라인 매장 영상을 바탕으로 오프라인 매장 방문 고객의 행동을 분석한 데이터를 기 초로 오프라인 가상공간 매장에 구현된 방문 고객의 가상 캐릭터에 매장 방문 고객의 행동을 동일하게 묘사하도 록 동기 구현한다. 또한, 메타버스 서버는 오프라인 매장 영상을 바탕으로 진열 상품의 변화를 분석한 데이터를 기초로 오프라인 가상공간 매장에 구현된 가상 진열 상품을 진열 상품의 변화와 동일하게 묘사하도록 동기 구현한다. 또한, 방문 고객의 가상 캐릭터와 가상 진열 상품은 분할 구획된 오프라인 가상공간 매장과 매칭되어 동기 구현 된다. 또한, 오프라인 매장 단말부는 메타버스 서버로부터 관리자 가상 캐릭터 및 관리자 고객 응대 대화 메시지를 전 송받으며, 메타버스 서버로 매장 방문 고객의 대화를 전송하는 메타버스 연동부, 메타버스 연동부로부터 관리자 가상 캐릭터의 연동 데이터를 전송받아 오프라인 매장 내에 배치된 디스플레이부에 관리자 가상 캐릭터를 메타 버스 서버와 연동 동기 표시하는 관리자 캐릭터 동기부, 메타버스 연동부로부터 관리자 가상 캐릭터의 고객 응 대 메시지를 전송받아 매장 방문 고객의 대화와 동기 표시하고, 매장 방문 고객의 대화 메시지를 생성하여 메타 버스 연동부를 통해 메타버스 서버로 전송하도록 하는 고객 응대 대화 동기부를 포함한다. 또한, 메타버스 서버는 메타버스 가상공간에 표현되는 관리자 가상 캐릭터의 행동을 추출하는 메타버스 관리자 캐릭터 행동 추출부, 관리자 가상 캐릭터의 고객 응대 메시지를 생성하는 메타버스 관리자 캐릭터 대화 생성부, 관리자 가상 캐릭터의 행동 및 고객 응대 메시지를 수집하여 관리자 캐릭터 정보로 취합하여 메타버스 접속부를 통해 오프라인 매장 단말부의 메타버스 연동부로 전송하는 메타버스 관리자 캐릭터 정보 전송부, 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송된 매장 방문 고객의 대화 메시지와 메타버스 관리자 캐릭터 대화 생성부에서 생성한 관리자 가상 캐릭터의 고객 응대 메시지를 서로 동기시켜 연동 표시하도록 하는 메타버스 고 객 응대 대화 동기부를 포함한다. 또한, 메타버스 서버는 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송된 매장 방문 고객의 대화 메 시지를 메타버스 접속부를 통해 수신하는 오프라인 고객 대화 수신부, 수신된 매장 방문 고객의 대화 메시지를 추출하는 오프라인 고객 대화 추출부, 메타버스 고객 응대 대화 동기부의 제어에 따라 추출된 매장 방문 고객의 대화 메시지와 관리자 가상 캐릭터의 고객 응대 메시지를 연동하여 메타버스 가상공간에 표시하는 오프라인 고 객 대화 동기 표시부를 포함한다. 또한, 메타버스 가상공간에 표현되는 관리자 가상 캐릭터는 오프라인에 위치하는 관리자의 행동 및 고객 응대 메시지를 동기 묘사하거나 메타버스 서버에 의해 구현되는 인공지능 점원의 가상 캐릭터이다. 또한, 오프라인 매장 단말부는 오프라인 매장 내에 배치되어, 오프라인 매장을 촬영한 오프라인 매장 영상을 생 성하는 오프라인 매장 촬영부, 오프라인 매장 영상을 바탕으로 오프라인 매장을 방문한 고객의 매장 내의 행동 의 변화를 감지하여 행동 변화 데이터를 생성하는 고객 행동 감지부, 오프라인 매장 영상을 바탕으로 오프라인 매장을 방문한 고객의 매장 내의 위치 변화를 감지하여 위치 변화 데이터를 생성하는 고객 위치이동 감지부, 오 프라인 매장 영상을 바탕으로 오프라인 매장에 진열된 진열 상품의 변화를 감지하여 진열 상품 변화 데이터를 생성하는 상품 변화 감지부, 행동 변화 데이터, 위치 변화 데이터 및 진열 상품 변화 데이터를 바탕으로 오프라 인 매장의 변화를 기 설정된 기준 시점 이전과 상대적으로 비교하여 감지하고, 매장 변화 데이터를 생성하는 오 프라인 매장변화 감지부를 포함한다. 또한, 메타버스 서버는 전송된 매장 변화 데이터를 바탕으로 오프라인 매장 방문 고객의 행동 변화에 연동하여 오프라인 가상공간 매장 내에 구현된 방문 고객의 가상 캐릭터를 동기 구현하도록 제어하고, 오프라인 매장 내 에 진열된 진열 상품의 변화에 연동하여 오프라인 가상공간 매장에 구현된 가상 진열 상품을 동기 구현하도록 제어하는 오프라인 매장 변화 메타버스 구현부를 포함한다. 또한, 메타버스 서버는 오프라인 매장을 방문한 방문 고객의 가상 캐릭터와 관리자 가상 캐릭터를 생성하며, 방 문 고객의 가상 캐릭터를 오프라인 매장 변화 메타버스 구현부의 제어에 따라 메타버스 가상공간에 동기 구현하도록 하는 메타버스 가상 캐릭터 구동부, 가상 캐릭터를 메타버스 가상공간에 동기 구현하고, 복수의 오프라인 매장을 디지털 트윈시켜 메타버스 가상공간에 구현하는 메타버스 가상공간 구현부, 복수의 오프라인 매장의 디 지털 트윈 데이터를 바탕으로 메타버스 가상공간에 오프라인 가상공간 매장을 분할 구획하여 구현하도록 함으로 써 메타버스 가상공간에 복수의 오프라인 가상공간 매장이 독립적으로 분할 구역화 되도록 하는 메타버스 공간 분할 구획부, 독립적으로 분할 구역화된 복수의 오프라인 가상공간 매장을 그룹화하여 관리하는 메타버스 공간 분할 관리부를 포함한다. 또한, 메타버스 가상공간 구현부는 방문 고객의 가상 캐릭터 및 가상 진열 상품을 독립적으로 분할 구역화된 복 수의 오프라인 가상공간 매장과 매칭시켜 동기 구현한다."}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 바와 같은 본 발명에 의하면 오프라인 매장을 그대로 디지털 트윈시켜 메타버스 가상공간에 구현하고, 오프라인 매장을 방문하는 고객을 메타버스 가상공간에 방문 고객 가상 캐릭터로 동기 구현시켜 관리자 가상 캐 릭터와 대화를 하도록 함으로써 고객 응대가 가능하도록 하고, 디지털 트윈된 오프라인 가상공간 매장의 상품 진열 상태가 오프라인 매장과 동일하게 동기 구현되도록 함으로써 관리자가 메타버스 가상공간에 참여하는 것만 으로도 고객 응대 및 오프라인 매장을 메타버스 속에서 관리할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 바람직한 일실시예에 대해서 설명한다. 또한, 이하에 설명하는 일실시예는 특"}
{"patent_id": "10-2022-0071194", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "허청구범위에 기재된 본 발명의 내용을 부당하게 한정하지 않으며, 본 실시 형태에서 설명되는 구성 전체가 본 발명의 해결 수단으로서 필수적이라고는 할 수 없다. 또한, 종래 기술 및 당업자에게 자명한 사항은 설명을 생 략할 수도 있으며, 이러한 생략된 구성요소(방법) 및 기능의 설명은 본 발명의 기술적 사상을 벗어나지 아니하 는 범위내에서 충분히 참조될 수 있을 것이다. 본 발명의 일실시예에 따른 메타버스 가상공간 기반의 무인상점 장치는 도 1에 도시된 바와 같이 복수의 오프라 인 매장(101,….,103)을 디지털 트윈시켜 메타버스 가상공간에 오프라인 매장과 동일한 상태로 동기 구현하 고, 관리자는 메타버스 가상공간에서 오프라인 가상공간 매장을 관찰하며 매장을 관리하고, 오프라인 매장에 방 문한 고객을 응대하도록 하는 장치이다. 관리자는 메타버스 가상공간에 구현되는 오프라인 가상공간 매장이 여 럿인 경우 각 관리자(301,….,303)가 복수의 오프라인 가상공간 매장(11,….,14)을 각각 그룹화하여 담당 관리 할 수 있다. 즉, 제1 오프라인 매장 관리자는 10개의 오프라인 가상공간 매장을 그룹화하여 관리하도록 하고, 제2 오프라인 매장 관리자는 다른 10개의 오프라인 가상공간 매장을 그룹화하여 관리하도록 할 수 있 다. 이때, 메타버스 가상공간에 디지털 트윈되는 오프라인 가상공간 매장의 그룹화는 지역별, 매장 갯수별 또는 업종 종류별 등 다양한 방식으로 그룹화하여 관리할 수 있다. 디지털 트윈은 오프라인 매장을 그대로 메타버스 가상공간에 구현하도록 하는 기술로서 본 발명의 기술적 사상을 벗어나지 아니하는 범위내에서 디지털 트윈 기 술이 참조될 수 있다. 메타버스 가상공간 기반의 무인상점 장치는 대략적으로 오프라인 매장에 배치되는 오프라인 매장 단말부와 메타버스 가상공간을 구현 구동하는 메타버스 서버 및 관리자를 포함한다. 오프라인 매장 단말부는 도 1 내지 도 3에 도시된 바와 같이 메타버스 가상공간에 동기된 관리자의 가상 캐릭터를 오프라인 매장 내에 배치된 디스플레이부(110a)를 통해 동기 구동 표시하고, 오프라인 매장(10 1,….,103)을 방문한 고객이 관리자 가상 캐릭터를 통해 고객 응대를 받을 수 있도록 한다. 또한, 오프라인 매장을 촬영한 오프라인 매장 영상을 바탕으로 오프라인 매장 내의 매장 방문 고객 및 상품의 변화를 감지함으 로써 오프라인 매장 내의 변화와 동기되어 오프라인 가상공간 매장도 변화 표시되도록 한다. 이를 위해 오프라 인 매장 단말부는 디스플레이부(110a), 스피커부(110b), 오프라인 매장 촬영부(110c), 관리자 캐릭터 동기 부, 고객 응대 대화 동기부, 메타버스 연동부, 고객 행동 및 대화 감지부, 고객 위치이동 감지부, 상품 변화 감지부, 오프라인 매장변화 감지부를 대략적으로 포함한다. 관리자 가상 캐 릭터의 고객 응대 일예로서, '어서오세요. 머가 필요하세요. 이 옷이 손님에게 적당한 컬러일것 같습니다. 얼마입니다. 카드 꽂으세요.' 등을 순차적으로 고객과 상호작용하며 응대할 수 있다. 메타버스 연동부는 메타버스 관리자 캐릭터 정보 전송부로부터 관리자 가상 캐릭터 및 관리자 고객 응대 대화 메시지를 전송받는다. 전송받은 관리자 가상 캐릭터는 디스플레이부(110a)를 통해 동기 표시되며, 고 객 응대 대화 메시지는 스피커부(110b) 또는 디스플레이부(110a)를 통해 동기 표시된다. 메타버스 연동부 는 또한 메타버스 서버의 오프라인 고객 대화 수신부로 매장 방문 고객의 대화를 전송함으로써 동기 표시되도록 한다. 디스플레이부(110a)는 고객 응대 대화 메시지를 문자 메시지로 표시하며, 스피커부(110b)는 고객 응대 대화 메 시지를 음성으로 표시할 수 있다. 한편, 상술한 관리자 가상 캐릭터는 오프라인 가상공간 매장을 관리하는 관리 자의 캐릭터이거나 또는 메타버스 서버에 의해 구현되는 인공지능 가상 점원의 캐릭터 일 수 있다. 또한, 관리자 가상 캐릭터의 동기 표시의 의미는 일에로서 관리자가 어떠한 행동을 하는 경우 그 행동이 그대로 묘사 되어 메타버스 가상공간에 관리자 가상 캐릭터로 동기 묘사되고, 또한 동기 묘사된 관리자 가상 캐릭터가 오프 라인 매장 단말부에 연동되어 동기 묘사된다는 의미이다. 또한, 고객 응대 대화 메시지의 동기 표시의 의 미도 오프라인 매장을 방문한 고객의 대화 메시지와 메타버스 가상공간 속에서 고객 응대하는 관리자 가상 캐릭 터의 대화 메시지가 오프라인 매장 단말부와 메타버스 가상공간에서 서로 연동되어 동기 표시되는 것을 의 미한다. 관리자 캐릭터 동기부는 메타버스 연동부로부터 관리자 가상 캐릭터의 연동 데이터를 전송받아 오프라인 매장(101,….,103) 내에 배치된 디스플레이부(110a)에 관리자 가상 캐릭터를 메타버스 가상공간에 구현된 관리자 가상 캐릭터와 연동 동기 표시한다. 고객 응대 대화 동기부는 메타버스 연동부로부터 관리자 가상 캐릭터의 고객 응대 메시지를 전송 받아 매장 방문 고객의 대화와 디스플레이부(110a) 또는 스피커부(110b)를 통해 동기 표시한다. 또한, 매장 방 문 고객의 대화 메시지를 생성하여 메타버스 연동부를 통해 메타버스 서버의 오프라인 고객 대화 수 신부로 전송하도록 함으로써 오프라인 매장과 메타버스 가상공간에 고객 응대 메시지가 서로 연동되어 동 기 표시되도록 한다.오프라인 매장 촬영부(110c)는 오프라인 매장 내에 배치되어, 오프라인 매장을 촬영한 오프라인 매장 영상을 생 성한다. 오프라인 매장 영상은 오프라인 매장 내를 입장하는 고객의 행동 및 매장 내 위치이동 영상을 포함하며, 오프라인 매장 내에 배치된 진열 상품의 영상을 포함할 수 있다. 오프라인 매장 영상을 촬영하는 이 유는 고객의 매장 내 행동 및 위치이동 변화와 진열 상품의 변화를 파악하여 메타버스 가상공간에 동기 표시하 도록 하기 위함이다. 진열 상품의 변화의 일예로서 진열된 상품을 고객이 구매한 경우에 진열 상품의 갯수가 달 라질 수 있으며, 진열 상품의 위치가 변경되는 경우 등이 있을 수 있다. 따라서 오프라인 매장 촬영부(110c)는 고객의 행동 및 위치이동 변화를 감지하는 제1 카메라와 진열된 상품의 변화를 감지하는 제2 카메라로 분리될 수 있다. 고객 행동 감지부는 오프라인 매장 영상을 바탕으로 오프라인 매장을 방문한 고객의 매장 내의 행동의 변 화를 감지하여 행동 변화 데이터를 생성한다. 행동 변화 데이터의 일예로서 고객이 제자리에서 진열된 상품 중 어느 하나를 집으려 하거나 또는 고개를 돌리는 경우 등이 있을 수 있다. 고객 위치이동 감지부는 오프라인 매장 영상을 바탕으로 오프라인 매장을 방문한 고객의 매장 내의 위치 변화를 감지하여 위치 변화 데이터를 생성한다. 고객의 위치 변화 데이터의 일예로서 고객이 매장 내의 제1 위 치에서 제2 위치로 이동하는 경우 등이 될 수 있다. 상품 변화 감지부는 오프라인 매장 영상을 바탕으로 오프라인 매장에 진열된 진열 상품의 변화를 감지하여 진열 상품 변화 데이터를 생성한다. 진열 상품 변화 데이터의 일예로서 고객의 구매에 따라 진열 상품이 없어질 수 있으며, 또는 고객에 의해 진열 상품의 위치가 이동될 수도 있다. 오프라인 매장변화 감지부는 행동 변화 데이터, 위치 변화 데이터 및 진열 상품 변화 데이터를 바탕으로 오프라인 매장의 변화를 기 설정된 기준 시점 이전과 상대적으로 비교하여 감지하고, 매장 변화 데이터를 생성 한다. 즉, 오프라인 매장의 변화를 판단하는 판단 시점과 판단 시점 이전의 기준 시점을 서로 비교하여 매장의 변화를 감지한다. 판단 시점 및 기준 시점은 지속적으로 변경될 수 있다. 오프라인 실제 매장에서 변화가 발생 되면 오프라인 매장 변화 데이터가 생성된다. 생성된 오프라인 매장 변화 데이터를 오프라인 매장 변화 메타버 스 구현부로 전송하여 오프라인 매장의 변화와 동일하게 변화되어 표시되도록 메타버스 가상공간 속의 오 프라인 가상공간 매장을 구현한다. 메타버스 서버는 오프라인 매장 단말부의 메타버스 연동부로 관리자 가상 캐릭터를 전송한 다. 메타버스 서버는 오프라인 매장 단말부로부터 전송된 오프라인 매장 영상을 바탕으로 방문 고객 의 가상 캐릭터를 생성하여 메타버스 가상공간에 동기 표시하고, 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송된 매장 방문 고객의 대화를 분석하여 메타버스 가상공간에 관리자 가상 캐릭터의 대화와 동기 표시한다. 이를 위해 메타버스 서버는 메타버스 접속부, 메타버스 관리자 캐릭터 행동 추출부, 메타버스 관리자 캐릭터 대화 생성부, 메타버스 관리자 캐릭터 정보 전송부, 메타버스 고객 응대 대화 동기부를 포함한다. 메타버스 접속부는 오프라인 매장 단말부와 메타버스 서버 간을 네트웍 망을 통해 서로 연 결 접속시켜 데이터가 동기 구동되도록 한다. 메타버스 관리자 캐릭터 행동 추출부는 메타버스 가상공간에 표현되는 관리자 가상 캐릭터의 행동을 추출 한다. 관리자 가상 캐릭터는 매칭 연결된 관리자의 실제 행동과 연동되어 동기 묘사된다. 메타버스 관리자 캐릭터 대화 생성부는 관리자 가상 캐릭터의 고객 응대 메시지를 생성한다. 고객 응대 메 시지는 오프라인 매장을 방문한 방문 고객의 상품구매 관련 질문이나 상호간의 의사소통을 포함하는 메시지일 수 있다. 메타버스 관리자 캐릭터 정보 전송부는 관리자 가상 캐릭터의 행동 및 고객 응대 메시지를 메타버스 관리자 캐릭터 행동 추출부 및 메타버스 관리자 캐릭터 대화 생성부를 통해 수집하여 관리자 캐릭터 정보로 취합하여 메타버스 접속부를 통해 오프라인 매장 단말부의 메타버스 연동부로 전송한다. 전송된 관리자 캐릭터 정보는 관리자 캐릭터 동기부를 통해 관리자 가상 캐릭터가 동기 구현되며, 메타버 스 고객 응대 대화 동기부 및 고객 응대 대화 동기부를 통해 메타버스 가상공간과 오프라인 매장에서 상호 간의 대화가 동기 구현된다. 메타버스 고객 응대 대화 동기부는 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송 된 매장 방문 고객의 대화 메시지와 메타버스 관리자 캐릭터 대화 생성부에서 생성한 관리자 가상 캐릭터 의 고객 응대 메시지를 서로 동기시켜 연동 표시하도록 한다. 동기 표시된 메시지는 메타버스 가상공간에서 표시되도록 한다. 오프라인 고객 대화 수신부는 오프라인 매장 단말부의 고객 응대 대화 동기부로부터 전송된 매 장 방문 고객의 대화 메시지를 메타버스 접속부를 통해 수신한다. 오프라인 고객 대화 추출부는 오프라인 고객 대화 수신부에서 전송된 매장 방문 고객의 대화 메시지 를 분석하고, 동기 표시를 위해 대화 메시지를 추출한다. 오프라인 고객 대화 동기 표시부는 메타버스 고객 응대 대화 동기부의 제어에 따라 매장 방문 고객의 추출 대화 메시지와 관리자 가상 캐릭터의 고객 응대 메시지를 연동하여 메타버스 가상공간에 표시한다. 한편, 메타버스 서버는 오프라인 매장 영상을 바탕으로 오프라인 매장 방문 고객의 행동을 분석한 데이터 를 기초로 오프라인 가상공간 매장(11,….,14)에 구현된 방문 고객의 가상 캐릭터(21,….,23)에 매장 방문 고객 의 행동을 동일하게 묘사하도록 동기 구현한다. 또한, 메타버스 서버는 오프라인 매장 영상을 바탕으로 진 열 상품의 변화를 분석한 데이터를 기초로 오프라인 가상공간 매장(11,….,14)에 구현된 가상 진열 상품을 오프 라인 매장에 실제 진열된 진열 상품의 변화와 동일하게 묘사하도록 동기 구현한다. 메타버스 가상공간에 표 현되는 관리자 가상 캐릭터는 오프라인에 위치하는 관리자의 실제 행동 및 고객 응대 메시지를 동기 묘사한 가상 캐릭터이거나 또는 메타버스 서버에 의해 구현되는 인공지능 점원의 가상 캐릭터일 수 있다. 오프라인 매장 변화 메타버스 구현부는 오프라인 매장변화 감지부로부터 전송된 매장 변화 데이터를 바탕으로 오프라인 매장 방문 고객의 행동 변화 및 위치이동 변화에 연동하여 오프라인 가상공간 매장 내에 구 현된 방문 고객의 가상 캐릭터를 동기 구현하도록 제어한다. 또한, 오프라인 매장 변화 메타버스 구현부는 오프라인 매장 내에 실제 진열된 진열 상품의 변화에 연동하여 오프라인 가상공간 매장(11,….,14)에 구현된 가 상 진열 상품을 동기 구현하도록 제어한다. 메타버스 가상 캐릭터 구동부는 오프라인 매장(101,….,103)을 방문한 방문 고객의 가상 캐릭터와 관리자 가상 캐릭터를 생성하며, 방문 고객의 가상 캐릭터를 오프라인 매장 변화 메타버스 구현부의 제어에 따라 메타버스 가상공간에 동기 구현한다. 메타버스 가상공간 구현부는 메타버스 가상공간상에서 구현되는 모든 가상 캐릭터를 메타버스 가상공간에 동기 및 매칭 구현하고, 복수의 오프라인 매장(101,….,103)을 디지털 트윈시켜 메타버스 가상공간에 구현한다. 오프라인 매장의 디지털 트윈의 일예로서, 오프라인 매장이 의류 판매점인 경우 매장 내의 상품의 진열 위치 및 내부 인테리어 배치 등을 포함한 상점 내의 내부 공간을 그대로 메타버스 가상공간에 구현한다. 메타버스 가상공간 구현부는 방문 고객의 가상 캐릭터(21,….,23) 및 가상 진열 상품을 독립적으로 분할 구역화된 복수의 오프라인 가상공간 매장(101,….,103)과 매칭시켜 동기 구현한다. 즉, 제1 오프라인 매장이 디 지털 트윈되어 메타버스 가상공간에 구현된 경우, 제1 오프라인 매장에 입장하는 방문 고객의 가상 캐릭터를 제 1 오프라인 가상공간 매장의 메타버스 가상공간 내에 매칭시키면서 실제 매장의 고객 위치와 동일하게 매칭시켜 동기 구현한다. 메타버스 가상공간에 구현된 제1 오프라인 매장의 가상 진열 상품도 실제 매장의 진열 상품 의 상태와 동일하게 동기 묘사시킨다. 메타버스 서버는 복수의 오프라인 매장(101,….,103)을 각각 디지털 트윈하여 메타버스 가상공간에 오 프라인 가상공간 매장을 분할 구획 표시하도록 제어함으로써 관리자 가상 캐릭터가 메타버스 가상공간상에 서 복수의 오프라인 매장(101,….,103)을 관리할 수 있도록 한다. 이를 위해 메타버스 서버는 메타버스 공 간분할 구획부, 메타버스 공간분할 관리부를 포함한다. 메타버스 공간분할 구획부는 복수의 오프라인 매장(101,….,103)의 디지털 트윈 데이터를 바탕으로 메타버 스 가상공간에 오프라인 가상공간 매장(11,….,14)을 분할 구획하여 구현하도록 함으로써 메타버스 가상공 간에 복수의 오프라인 가상공간 매장(11,….,14)이 독립적으로 분할 구역화 되도록 한다. 즉, 도 6을 참조하면, 메타버스 가상공간에는 일예로서 4개의 오프라인 가상공간 매장(11,….,14)이 메타버 스 가상공간 구현부에 의해 디지털 트윈되어 구현된다. 다만, 4개의 오프라인 가상공간 매장(11,….,14)은 일예를 든 것이며 실제로 메타버스 가상공간에는 훨씬 많은 수의 매장이 디지털 트윈되며, 오프라인 가상공 간 매장 간에 인접하게 서로 붙어 있지 않고 떨어져 있거나 메타버스 가상공간 내에서 가상공간 매장 상가(디지 털 트윈된 메타버스 가상공간에는 체험 활동을 활 수 있는 다양한 가상공간이 구현됨)를 이루면서 디지털 트윈 될 수 있다. 도 6에 도시된 바와 같이, 오프라인 가상공간 매장 1에는 매장을 방문한 방문 고객의 가상 캐릭터가 실 제 오프라인 매장의 방문 고객의 위치 및 행동과 동일하게 동기 묘사되며, 오프라인 가상공간 매장 2에는 동일한 원리로 매장을 방문한 방문 고객의 가상 캐릭터가 실제 오프라인 매장의 방문 고객의 위치 및 행동 과 동일하게 동기 묘사된다 매장을 방문한 고객을 응대하기 위해 관리자는 메타버스 가상공간에 접속함으로써 자신의 가상 캐릭터(3 0)가 메타버스 가상공간상에 동기 구현된다. 도 6에 도시된 바와 같이 오프라인 가상공간 매장 3에 관리자 가상 캐릭터가 위치하며, 오프라인 가상공간 매장 3에 입장한 방문 고객의 가상 캐릭터를 응대할 수 있다. 관리자 가상 캐릭터는 오프라인 가상공간 매장 3에 입장한 방문 고객의 가상 캐릭터와의 고객 응대가 완료되면 인접한 오프라인 가상공간 매장으로 이동하여 매장을 방문한 고객을 응대하도록 한다. 관리자는 디지털 트윈된 오프라인 가상공간 매장의 수에 따라 여럿일 수 있다. 즉, 오프라인 가상공간 매 장의 수가 많은 경우에는 1명의 관리자가 모두를 관리할 수 없기 때문에 오프라인 가상공간 매장을 관리하는 관 리자를 복수로 둘 수 있다. 메타버스 공간분할 관리부는 독립적으로 분할 구역화된 복수의 오프라인 가상공간 매장을 그룹화하여 관리 한다. 오프라인 가상공간 매장은 신규로 생성되기도 하고, 기존 매장이 없어질 수도 있다. 따라서 메타버스 공 간분할 관리부는 신규 오프라인 매장의 디지? 트윈 데이터를 참고하여 메타버스 가상공간상에 신규로 오프 라인 가상공간 매장을 열도록 구획 관리한다. 즉, 신규로 오픈할 오프라인 가상공간 매장의 메타버스 가상공간 속 위치, 크기 등을 참고하여 적절하게 배치 관리한다. 이를 위해, 제1 공간분할 관리부 및 제2 공간분할 관리부를 포함한다. 제1,2 공간분할 관리부(261,262)는 메타버스 가상공간 속의 할당된 영역을 각각 관리 하며, 신규로 오픈하거나 없어지는 매장을 관리하여 메타버스 가상공간 구현부로 전송함으로써 메타버스가상공간의 매장이 업데이트 되도록 관리한다. 본 발명을 설명함에 있어 종래 기술 및 당업자에게 자명한 사항은 설명을 생략할 수도 있으며, 이러한 생략된 구성요소(방법) 및 기능의 설명은 본 발명의 기술적 사상을 벗어나지 아니하는 범위내에서 충분히 참조될 수 있 을 것이다. 또한, 상술한 본 발명의 구성요소는 본 발명의 설명의 편의를 위하여 설명하였을 뿐 여기에서 설명 되지 아니한 구성요소가 본 발명의 기술적 사상을 벗어나지 아니하는 범위내에서 추가될 수 있다. 상술한 각부의 구성 및 기능에 대한 설명은 설명의 편의를 위하여 서로 분리하여 설명하였을 뿐 필요에 따라 어 느 한 구성 및 기능이 다른 구성요소로 통합되어 구현되거나, 또는 더 세분화되어 구현될 수도 있다. 이상, 본 발명의 일실시예를 참조하여 설명했지만, 본 발명이 이것에 한정되지는 않으며, 다양한 변형 및 응용 이 가능하다. 즉, 본 발명의 요지를 일탈하지 않는 범위에서 많은 변형이 가능한 것을 당업자는 용이하게 이해 할 수 있을 것이다. 또한, 본 발명과 관련된 공지 기능 및 그 구성 또는 본 발명의 각 구성에 대한 결합관계에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는, 그 구체적인 설명을 생 략하였음에 유의해야 할 것이다."}
{"patent_id": "10-2022-0071194", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 다음의 도면들은 본 발명의 바람직한 일실시예를 예시하는 것이며, 발명의 상세한 설명과 함께 본 발명의 기술적 사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에 만 한정되어 해석 되어서는 아니 된다. 도 1은 본 발명의 일실시예에 따른 메타버스 가상공간 기반의 무인상점 장치의 대략적인 시스템 구성을 나타낸 도면이고, 도 2는 본 발명의 일실시예에 따른 메타버스 서버에서 오프라인 매장 단말부로 메타버스 관리자 캐릭터 정보를 전송하기 위한 도면이고, 도 3은 본 발명의 일실시예에 따른 오프라인 매장 단말부에서 메타버스 서버로 오프라인 매장을 방문한 방문 고 객의 대화 메시지를 전송하기 위한 도면이고, 도 4는 본 발명의 일실시예에 따른 오프라인 실제 매장에 위치한 고객의 행동, 위치이동, 상품 변화를 감지하여 메타버스 가상공간에 구현된 가상공간 매장에 그대로 동기 구현하기 위한 도면이고, 도 5는 본 발명의 일실시예에 따른 메타버스 가상공간의 공간을 분할 구획하고, 가상공간의 영역을 분할 관리하 는 것을 도시한 도면이고, 도 6은 본 발명의 일실시예에 따른 메타버스 가상공간에 구현된 오프라인 가상공간 매장과 매장을 방문한 고객 의 가상 캐릭터 및 관리자 가상 캐릭터를 도시한 도면이다."}
