{"patent_id": "10-2017-7022425", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0105054", "출원번호": "10-2017-7022425", "발명의 명칭": "임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템", "출원인": "위토우 테크놀로지", "발명자": "쉬, 지아키"}}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템에 관한 것으로 스마트 로봇에 적용되며,스크립트 해석 및 실행에 사용되는 가상 머신;저장 및 스크립트 연동 작업 중의 상기 가상 머신의 실시 예에 사용되는 스레드 풀;스레드 풀과 상기 가상 머신을 연동 시켜 상기 가상 머신이 전송받은 상기 스크립트로 인스턴스를 생성한 뒤 상기 스레드 풀에 저장하며 프리인스톨 전략에 의거 상기 스레드풀 중의 스레드에 대해 상응한 조정을 진행하는관리 유닛;상기 스레드 풀에 연결되어 모든 상기 관리 유닛의 조정 작업으로 인해 중단 된 스크립트 작업에 상응된 상기스레드의 식별 정보를 저장하는 전역 테이블; 및상기 관리 유닛과 상기 전역 테이블에 연결되어 해당 스크립트가 상기 전역 테이블에서 메칭되는 기록이 있는지를 조회하며 기록이 조회 되면 상기 관리 유닛에 신호를 보내 상기 기록중 상응되는 스레드 실행을 조정하는 매칭 유닛;을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 실행 유닛은 상기 스레드 풀에 연결되어 상기 관리 유닛에서 조정 실행하는 상기 스레드 풀과 상응 되는상기 스레드를 포함하는 것을 특징으로 하는 상기 시스템."}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,전송받은 스크립트 임무를 수행하는 스크립트 실행 유닛; 및상기 스크립트 실행 유닛과 상기 관리 유닛에 연결되어 상기 스크립트 임무를 상기 관리 유닛으로 전송하는 연동 유닛을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 스크립트 실행 유닛과 상기 연동 유닛은 JAVA가상 머신에서 실행되는 JAVA 네이티브 인터페이스로 형성된것을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 프리인스톨 전략에는 선입선출(FIFO) 처리방식과 선입후출(FILO) 처리방식을 포함하는 것을 특징으로 하는시스템."}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 전역 테이블은 해시 테이블(Hash table)을 사용하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2017-7022425", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2017-0105054-3-제2항에 있어서,상기 실행유닛이 실행하려고 하는 상기 스레드의 임무 정보와/혹은 집행 결과를 판독하며 리모트 서버에 전송하는 상기 실행 유닛에 연결되는 통신 모듈을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템에 관한 것으로 스마트 로봇에 적용되 며, 스크립트 해석 및 실행에 사용되는 가상 머신; 저장 및 스크립트 연동 작업 중의 상기 가상 머신의 실시 예 에 사용되는 스레드 풀; 스레드 풀과 상기 가상 머신을 연동 시켜 상기 가상 머신이 전송받은 상기 스크립트로 (뒷면에 계속)"}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 통신 기술 영역의 임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템에 관한 것이다."}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "로봇 응용 영역의 확대와 전자 기술의 고속 발전과 더불어 로봇의 생활 중의 응용도 점차적으로 증가하고 있으 며 전통적인 로봇도 일반적으로 절차 중심의 프로그래밍 발상으로 프로그래밍을 실행하고 있다. 절차중심이란 절차를 중심으로 하는 프로그래밍 발상을 의미하며 문제 해결에 필요한 절차를 분석한 뒤 함수를 이용하여 순차 적으로 실행하며 사용시 순차적으로 호출한다. 현재 응용 프로그램은 명령 인터페이스로부터 윈도우 인터페이스로 발전하였다. 응용 프로그램은 기본적으로 절 차 중심으로 개발되기 때문에 유연성이 떨어지며 유지보수가 어려운 등 문제가 존재한다. 전통적인 이미지 교류 방식은 윈도우의 전진 혹은 후퇴에 제한이 있으며 실행방식이 일정하다. 프로그램 실행 시 문맥상 관련성(문맥 상 관련성이란 교류시 사용자의 명령에 존재하는 문맥을 이른다.) 문제가 존재하며 프로그래머는 대량의 if… else…를 편집하여 문맥상 프로그램의 흐름을 판단하며 동일한 교류방식에 부동한 문맥 대응으로 인한 부동한 결과가 존재한다. 전통적인 프로그래밍 발상을 도입 할 경우 이러한 문맥은 대량의 객체 연결을 유발하며 객체 지향 프로그래밍의 장점을 파괴 할 수 있다. 이와 동시에 전통적인 임베디드 개발 흐름은 비교적 길며, 과정 프 로그래밍 완성 후 편역, 배치, 프로그래밍 등 과정을 걸쳐야 기능을 검증할 수 있으며 시스템이 복잡 할 경우 이러한 과정은 대량의 시간과 비용을 소모하게 된다. 상기 내용을 종합 해 보면 특정 임무 수행이 가능한 전통적인 프로그래밍 다용도 로봇은 기능이 제한되어 있으 며 유연성이 떨어지고 유지보수가 어려워 날로 등장하는 수요를 만족 시킬 수 없다. 선행기술문헌 (특허문헌) 중국 공개특허 CN 102402588호"}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에, 본 발명의 기술적 과제는 이러한 점에서 착안된 것으로 본 발명의 목적은 전통적인 임베디드 개발과정 중 에 존재하는 상기 문제를 해결하고자 일종의 직접 호출용 기능 유닛을 실현하기 위한 유연성이 강하고 독점성도 강하며 유지보수가 편리한 스마트 로봇 시스템에 적용되는 스크립트 작업 수행 시스템을 제공하는 것이다."}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 본 발명의 목적을 실현하기 위한 일 실시예에서, 임베디드 시스템의 프리인스톨 중의 스크립트 작업 수 행 시스템에 관한 것으로 스마트 로봇에 적용되며, 스크립트 해석 및 실행에 사용되는 가상 머신; 저장 및 스크 립트 연동 작업 중의 상기 가상 머신의 실시 예에 사용되는 스레드 풀; 스레드 풀과 상기 가상 머신을 연동 시 켜 상기 가상 머신이 전송받은 상기 스크립트로 인스턴스를 생성한 뒤 상기 스레드 풀에 저장하며 프리인스톨 전략에 의거 상기 스레드풀 중의 스레드에 대해 상응한 조정을 진행하는 관리 유닛; 상기 스레드 풀에 연결되어 모든 상기 관리 유닛의 조정 작업으로 인해 중단 된 스크립트 작업에 상응된 상기 스레드의 식별 정보를 저장하 는 전역 테이블; 및 상기 관리 유닛과 상기 전역 테이블에 연결되어 해당 스크립트가 상기 전역 테이블에서 메 칭되는 기록이 있는지를 조회하며 기록이 조회 되면 상기 관리 유닛에 신호를 보내 상기 기록중 상응되는 스레 드 실행을 조정하는 매칭 유닛;을 포함한다. 일 실시예에서, 상기 실행 유닛은 상기 스레드 풀에 연결되어 상기 관리 유닛에서 조정 실행하는 상기 스레드 풀과 상응 되는 상기 스레드를 포함할 수 있다. 일 실시예에서, 전송받은 스크립트 임무를 수행하는 스크립트 실행 유닛; 및 상기 스크립트 실행 유닛과 상기 관리 유닛에 연결되어 상기 스크립트 임무를 상기 관리 유닛으로 전송하는 연동 유닛을 포함할 수 있다. 일 실시예에서, 상기 스크립트 실행 유닛과 상기 연동 유닛은 JAVA가상 머신에서 실행되는 JAVA 네이티브 인터 페이스로 형성된 것을 포함할 수 있다. 일 실시예에서, 상기 프리인스톨 전략에는 선입선출(FIFO) 처리방식과 선입후출(FILO) 처리방식을 포함할 수 있 다. 일 실시예에서, 상기 전역 테이블은 해시 테이블(Hash table)을 사용할 수 있다. 일 실시예에서, 상기 실행유닛이 실행하려고 하는 상기 스레드의 임무 정보와/혹은 집행 결과를 판독하며 리모 트 서버에 전송하는 상기 실행 유닛에 연결되는 통신 모듈을 포함할 수 있다."}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 의하면, 스레드 풀을 통하여 스마트 로봇의 복잡한 환경중의 돌발 상황에 대한 완비성을 향상하며 전역 테이블을 사용하여 로봇과의 교류 중에 생기는 문맥상 문제를 해결하고 사용자의 문맥 궤적에 따 라 상응한 작업을 실행 할 수 있으며 관리 유닛을 사용하여 로봇의 독점성 하드웨어의 유지보수를 진행하여 스 크립트 임무 실행의 정확성을 확보하며 직접 호출용 기능 유닛은 유연성이 강하고 유지보수가 편리하다."}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 실시예들을 본문에 상세하게 설명하 고자 한다. 그러나 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유 사한 참조부호를 유사한 구성요소에 대해 사용하였다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 본 출원에서 사용한 용 어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또는 \"이루어진다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 도 1은 본 발명의 일 실시예에 의한 임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템이 스마트 로봇에 적용된 모듈도이다. 도 1에는 일종의 임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템에 관한 것으로 스마트 로봇에 적용되며, 스크립트 해석 및 실행에 사용되는 가상 머신; 저장 및 스크립트 연동 작업 중의 상기 가상 머신 의 실시예에 사용되는 스레드 풀; 스레드 풀과 상기 가상 머신을 연동 시켜 상기 가상 머신이 전송받은 상기 스크립트로 인스턴스를 생성한 뒤 상기 스레드 풀에 저장하며 프리인스톨 전략에 의거 상기 스레드 풀 중의 스레드에 대해 상응한 조정을 진행하는 관리 유닛; 상기 스레드 풀에 연결되어 모든상기 관리 유닛의 조정 작업으로 인해 중단 된 스크립트 작업에 상응된 상기 스레드의 식별 정보를 저장하는 전역 테이블; 상기 관리 유닛과 상기 전역 테이블에 연결되어 해당 스크립트가 상기 전역 테이블에 서 매칭되는 기록이 있는지를 조회하며 기록이 조회 되면 상기 관리 유닛에 신호를 보내 상기 기록 중 상응 되는 스레드 실행을 조정하는 매칭 유닛;이 포함된다. 관리 유닛이 스크립트 임무를 전송 받은 후 해당 스크립트 임무를 예시화 시킨뒤 스레드 풀에 저장하며 프리인스톨 전략에 의거 스레드 풀내의 스레드에 대해 상응한 조정을 진행한다. 현재 스크립트 임무의 우선순위가 스레드 풀의 기타 임무의 우선순위보다 높을 때 진행 중인 스크립트 임무 에 대응되는 스레드를 중단하고 해당 스레드의 상태는 스레드 풀에 저장되며 해당 스레드의 식별정보는 전역 테이블에 저장됨과 동시에 관리 유닛은 중단된 스크립트 임무를 저장하며 우선순위가 높은 스레드를 실행 한다. 프리인스톨의 시간간격으로 관리 유닛이 프리인스톨 시스템의 메세지를 접수 하였는지를 판단하며 프리인스 톨 시스템의 메세지는 시스템에 사전 설치한 약간의 우선순위가 높은 시스템 메세지이며 해당 시스템 메세지의 우선순위는 실행중인 스레드의 우선순위보다 높아야 하며 관리 유닛이 시스템 메세지를 받은 뒤 실행중인 스 크립트 임무에 대응되는 스레드를 중단 하여야 하며 해당 스레드의 상태는 스레드 풀에 저장되며 해당 스레 드의 식별 정보는 전역 테이블에 저장됨과 동시에 관리 유닛은 중단된 스크립트 임무를 저장하며 시스템 메세지를 실행 한다. 중단 된 해당 스크립트 임무가 재차 관리 유닛에 전송되며 매칭 유닛을 통하여 전역 테이블중에 해당 스크립트 임무와 매칭 되는 기록이 있는지를 조회하며 기록이 있을 경우 관리 유닛에 통지하여 기록 중의 상 응되는 스레드를 조정하여 실행 즉 중단된 상태를 회복하여 계속 실행 한다. 스마트 로봇의 하드웨어는 독점성 특징이 있기 때문에 관리 유닛은 스마트 로봇의 하드웨어 유지보수에 사용 될 수 있다. 예를 들면 기계구조, 이러한 하드웨어는 다수의 스크립트 임무의 동시 조정을 허용하지 않기 때문 에 이러한 행위를 방지하기 위하여 관리 유닛은 프로그램 흐름의 실행에 대해 조정을 진행한다. 관리 유닛 은 스마트로봇의 독점성 하드웨어의 유지보수를 진행하여 프로그램 실행의 정확성을 확보한다. 본 실시예 중 스레드 풀은 스마트 로봇의 복잡한 환경중의 돌발상황에 대한 완비성을 향상하며 전역 테이블 을 사용하여 로봇과의 교류 중에 생기는 문맥상 문제를 해결하고 사용자의 문맥 궤적에 따라 상응한 작업을 실행 할 수 있으며 관리유닛을 사용하여 로봇의 독점성 하드웨어의 유지보수를 진행하여 스크립트 임무 실행 의 정확성을 확보하며 직접적으로 기능 유닛을 호출 할 수 있다. 우선적으로 실시 예 중 에는 실행 유닛은 상기 스레드 풀에 연결되어 상기 관리 유닛에서 조정 실행하 는 상기 스레드 풀과 상응 되는 상기 스레드를 포함한다. 본 실시예 중 실행 유닛은 관리 유닛이 조정 실행한 상응한 스레드에 의거하여 스크립트 임무 실행의 정 확성을 확보한다. 우선적으로 실시예 중 에는 전송받은 스크립트 임무를 수행하는 스크립트 실행 유닛; 스크립트 실행 유닛 과 상기 관리 유닛에 연결되어 상기 스크립트 임무를 상기 관리 유닛으로 전송하는 연동 유닛을 포 함한다. 우선적으로 실시예 중 에는 스크립트 실행 유닛과 상기 연동 유닛은 JAVA가상머신에서 실행되는 JAVA 네이티브 인터페이스（Java Native Interface，JNI，JNI표준은 JAVA플랫폼의 일부분으로 되여 JAVA코드와 기타 언어로 편집한 코드의 상호 교류를 허용한다）로 형성한다. 본 실시 예 중에서 JAVA엔진은 스크립트 실행 유닛으로 될 수 있으며 JAVA 네이티브 인터페이스를 통해 스크 립트를 실행하며 이진법으로 된 실행이 가능한 파일을 로딩하며 스크립트 임무를 판독하여 관리 유닛에 로그 온하며 새로운 장면을 만들어 스크립트 임무의 실행 과정에 대해 관리 및 조정을 진행 한다. 우선적으로 실시 예 중의 프리인스톨 전략에는 선입선출(FIFO) 처리방식과 선입후출(FILO) 처리방식이 포함된다. 선입선출은 먼저 들어와서 먼저 서비스를 진행하는（First-in, First-service） 방식이다. 예를 들면 정열 방식 의 배열이다. 선입후출은 먼저 들어와서 나중에 서비스를 진행하는（First-in, Last-service）방식이다. 예를 들면 적재 방식의 배열이다. 스크립트 임무는 태그 설정으로 저장과 회복 포인트를 설정하며 조정이 발생할 경우 스크립트 임무는 무조건 태그중의 대응되는 프로그램 흐름에 대해 저장과 회복 작업을 진행한다. 이는 스마 트 로봇의 복잡한 환경중의 돌발상황에 대한 완비성을 향상시킬 수 있다. 우선적으로 실시예중의 전역 테이블은 해시 테이블(Hash table)을 사용한다. 본 실시예 중의 해시 테이블은 일종의 데이터 구조로 사용자의 실행 궤적을 기록하며 프로그램은 궤적에 따라 가장 근접한 문맥을 선택한다. 모든 중단된 스크립트 임무의 식별정보는 전부 해시 테이블에 기록되며 사용자가 여러개 기능중의 함수를 조정하였을 경우 해당 조정은 현재의 해시 테이블의 식별정보로 구체적으로 어느 기능 중의 함수를 조정 할 것인 가를 결정한다. 우선적으로 실시 예 중에는 실행 유닛이 실행하려고 하는 상기 스레드의 임무 정보와/혹은 집행 결과를 판독 하며 리모트 서버에 전송하는 상기 실행 유닛에 연결되는 통신 모듈을 포함한다. 현재 실행중인 스레드의 임무 정보와/혹은 실행 결과를 리모트 서버에 피드백 하는데 사용 된다. 본 실시 예 중의 스크립트 임무는 스크립트 프로그래밍 언어로 프로그래밍하며 스크립트의 프로그래밍 언어는 스택식 가상머신의 해석형 스크립트 언어이며 스크립트 프로그래밍 언어는 편역이 필요 없으며 해석기로 해 석한 뒤, 핫 스팟 코드로 로컬 머신 코드를 생성 한 뒤 직접 스마트 로봇의 임베티드 시스템에서 실행 한다. 스 크립트 프로그래밍 언어는 완전튜링（완전튜링이란 해당 언어가 완전히 튜링기능이 진행할 수 있는 모든 사항을 시뮬레이션 할 수 있으며 현재 계산할 수 있는 모든 문제를 해결하며 프로그래밍 면에서 전통적인 절차 중심의 소프트웨어 개발 기술과 객체 지향형 소프트웨어 개발 기술을 지지한다.）한 것이며 해당 언어는 스마트 로봇의 교류 환경에서 기능의 개발 방식을 채용한다. 객체 지향형 즉 언어내의 기본 유닛은 기능으로 이러한 기능 사이에는 상호 독립되어 있으며 이러한 독립된 기 초 기능 유닛으로 구체적이고 복잡한 장면을 설정 할 수 있다. 예를 들면 사용자는 수시로 로봇의 여러 개의 관 련이 없는 기능을 사용 할 수 있으며 이러한 기능 사이에는 연관성이 없다. 예를 들면 사용자는 로봇에게 음악 재생을 명령하였으나 그 다음에는 일기예보를 보고하도록 한다. 현존하는 조명, 음악 재생, 언어 교류, 미디어 재생, 기계 운동 등 기능을 보유하고 있는 로봇을 예로 들면, 로봇의 컨트롤 시스템은 안드로이드（Android） 스마트 컨트롤 시스템을 사용한다. 스크립트 실행 유닛은 스 크립트 임무와 안드로이드 시스템 사이의 련관성을 구축한다. 관리유닛은 스크립트 임무의 실행 흐름에 대한 관리와 조정을 책임진다. 실행 유닛은 관리유닛에 의거 스레드 풀 중의 상응한 스레드에 대해 조정 실 행을 한다. 이하 코드는 음악 재생 로직에 관한 구체적인 프로그램의 로직이다. \"//\"는 주석 기호이며 \"//\"뒤의 데이터는 해당 프로그램에 표출되지 않는다. //start enter(music, light) //음악과 조명기능에 진입 on //음악과 조명 상하문 중, 동시에 음악과 조명을 켠다. while { var ret = waitForCmd //사용자명령대기 ifend(ret) //해당 응용의 종료 여부를 판단 play (ret) //사용자가 필요로 하는 음악을 재생, light기능중의 함수도 같이 호출되여 음악과 함께 조명을 변 화 시킨다. } <onPause> save //상하문 보존, 상기 음악을 기억 off //기타 프로그램에 중단, 일시로 음악과 조명을 끈다. exit(music, light) //음악과 조명 기능을 종료 <onResume> enter(music, light) //음악과 조명 기능에 진입 resume //상하문 회복, 재차 상기 음악을 로딩 on //음악을 회복"}
{"patent_id": "10-2017-7022425", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 실시 예 중 스크립트 임무를 이용하여 전통적인 고급 언어의 편역, 배치, 프로그래밍 등 과정의 시간 문제를 해결 하였다. 스크립트 임무의 소스 코드를 스마트 로봇의 파일 시스템 안에 입력하면 바로 기능 검증을 실행 할 수 있다. 스크립트 임무를 통하여 시스템의 기능을 직접 프로그래머에게 노출시켜 프로그래머의 프로그램 개 발시의 부담을 덜어줄 수 있으며 스마트 로봇의 프로그램 개발 효율을 향상한다. 수시로 변화 할 수 있는 전역 테이블은 교류상의 문맥문제를 해결 하였으며 프로그래머는 전통 언어처럼 대량의 if…else…를 편집하여 문 맥상 프로그램의 흐름을 판단하지 않고 직접 기능 유닛을 조정할 수 있으며 이러한 기능은 전역 테이블에 따 라 실행 할 프로그램의 흐름을 판단 하기에 작업이 간단하며 편리하다. 본 실시 예를 스마트 로봇에 응용함으로서 로봇이 감지, 사유와 효능면에서 완전히 기계 시스템을 시뮬레이션 할 수 있게 되며 이는 고효율 지능 시스템 뿐만 아니라 인공지능 기술의 종합적인 표현이다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2017-7022425", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 임베디드 시스템의 프리인스톨 중의 스크립트 작업 수행 시스템이 스마트 로봇에 적용된 모듈도이다."}
