{"patent_id": "10-2023-0015015", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0122169", "출원번호": "10-2023-0015015", "발명의 명칭": "무선랜 환경에서의 화상회의 품질 관리 장치 및 시스템", "출원인": "주식회사 케이티", "발명자": "우영욱"}}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "화상회의 품질 관리 장치의 동작 방법으로서,AP(Access Point)별 상태 정보를 수집하는 단계,AP 상태 정보와, 해당 AP를 통해 전송되는 화상회의 품질의 관계를 학습한 인공지능 모델을 이용하여, 상기 AP별 상태 정보에 대해 AP별 화상회의 품질 정보를 예측하는 단계, 그리고화상회의 품질 정보가 기준 이하로 예측된 특정 AP를 탐지하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,각 AP에 접속한 단말들의 IP 정보와 화상회의 어플리케이션이 실행된 단말 IP 정보를 비교하여, 상기 화상회의어플리케이션을 실행한 단말들이 접속한 AP 정보를 관리하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 화상회의 어플리케이션이 실행된 단말 IP 정보는 해당 단말에 설치된 화상회의 품질 관리 어플리케이션을통해 획득되는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,단말들에 설치된 화상회의 품질 관리 어플리케이션을 통해, 상기 화상회의 어플리케이션이 실행된 단말 IP 정보그리고 접속한 AP 정보를 획득하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에서,상기 화상회의 어플리케이션을 실행한 단말들이 접속한 AP 정보를 기초로, 상기 특정 AP에 접속해서 화상회의어플리케이션을 실행 중인 특정 단말에게 화상회의 품질 정보를 제공하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서,상기 특정 AP의 화상 회의 품질이 기준 이하로 예측된 시점을 AP별 화상회의 품질 히스토리에 저장하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에서,상기 AP별 화상회의 품질 히스토리를 기초로, 임의 단말에게, 접속 가능한 AP별로 시간에 따른 화상회의 품질정보를 제공하는 단계공개특허 10-2024-0122169-3-를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에서,상기 AP 상태 정보는 링크 트래픽율, 간섭율, 채널사용율, 그리고 접속 단말 수 중 적어도 하나를 포함하는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에서,상기 AP 상태 정보는 해당 AP에 접속한 단말 수 중에서 화상회의 어플리케이션을 실행하여 화상회의에 참여 중인 단말 수를 더 포함하는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에서,상기 AP별 상태 정보를 수집하는 단계는 무선랜 컨트롤러를 통해 상기 AP별 상태 정보를 수집하거나, 네트워크 장치들을 관리하는 장치로부터 상기 AP별상태 정보를 수집하는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에서,상기 인공지능 모델은동일 시점에 획득된 AP 상태 정보 그리고 화상회의 트래픽의 품질 정보가 매핑된 훈련 데이터를 통해, 입력된AP 상태 정보로부터 정답인 화상회의 품질 정보를 추론하도록 훈련된 모델인, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "화상회의 품질 관리 장치의 동작 방법으로서,AP(Access Point)의 AP 상태 정보를 수집하는 단계,상기 AP에서 전송되는 패킷들 중에서 화상회의 데이터가 전송되는 패킷들을 추출하고, 적어도 하나의 실시간 전송 세션에서 발생한 패킷 손실율을 계산하는 단계, 그리고상기 패킷 손실율을 기초로 상기 AP에서의 화상회의 품질을 평가하고, 평가한 화상회의 품질 정보를 해당 시점에서 수집된 AP 상태 정보의 정답으로 레이블링하여 인공지능 모델의 훈련 데이터를 생성하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에서,상기 훈련 데이터를 기초로, 상기 인공지능 모델이 입력된 AP 상태 정보로부터 정답인 화상회의 품질 정보를 추론하도록 훈련시키는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에서,상기 AP 상태 정보는 링크 트래픽율, 간섭율, 채널사용율, 그리고 접속 단말 수 중 적어도 하나를 포함하는, 동작 방법.공개특허 10-2024-0122169-4-청구항 15 제14항에서,상기 AP 상태 정보는 상기 AP에 접속한 단말 수 중에서 화상회의 어플리케이션을 실행하여 화상회의에 참여 중인 단말 수를 더 포함하는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에서,상기 AP 상태 정보를 수집하는 단계는 무선랜 컨트롤러를 통해 상기 AP의 상태 정보를 수집하거나, 네트워크 장치들을 관리하는 장치로부터 상기 AP의상태 정보를 수집하는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "화상회의 품질 관리 장치와 연동하는 단말의 동작 방법으로서,AP(access point)에 접속한 상태에서 화상회의 어플리케이션이 실행되면, 상기 화상회의 품질 관리 장치로 화상회의 어플리케이션 실행을 보고하는 단계, 그리고상기 화상회의 품질 관리 장치로부터 상기 AP의 상태에 대해 예측된 화상회의 품질 정보를 수신하고, 화상회의품질 저하에 대한 알람을 표시하는 단계를 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에서,상기 보고는 상기 화상회의 어플리케이션의 종류, 단말 IP 정보, 또는 접속한 상기 AP 정보 중 적어도 하나를 포함하는, 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에서,현재 접속한 AP에서 화상회의 품질 저하가 예상되는 시간 정보를 화면에 표시하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에서,화상회의 예약 화면에서, 접속 가능한 AP별로 예측된 현재 화상회의 품질, 또는 시간에 따른 화상회의 품질 정보를 표시하는 단계를 더 포함하는 동작 방법."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "화상회의 품질 관리 장치의 동작 방법으로서, AP(Access Point)별 상태 정보를 수집하는 단계, AP 상태 정보와, 해당 AP를 통해 전송되는 화상회의 품질의 관계를 학습한 인공지능 모델을 이용하여, 상기 AP별 상태 정보에 대 해 AP별 화상회의 품질 정보를 예측하는 단계, 그리고 화상회의 품질 정보가 기준 이하로 예측된 특정 AP를 탐지 하는 단계를 포함한다."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 화상회의 품질 관리에 관한 것이다."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다양한 종류의 화상회의 솔루션들이 학교나 기업에서 사용되고 있다. 일반적으로 화상회의 어플리케이션이 패킷 손실, 지연 등의 품질저하를 판단하고, 고품질 화상회의를 진행하다가 네트워크 상황에 따라 전송률을 강제로낮추어서 화상회의가 끊김없이 진행될 수 있도록 조절하는 기능을 제공하기도 한다. 하지만, 다수가 접속 가능한 무선랜 환경에서 화상회의 어플리케이션을 사용하는 경우, 무선랜 환경의 특성 상, 화상회의 어플리케이션의 화질 조절 기능만으로 화상회의 품질을 유지하는데 한계가 있다. 예를 들어, 단말이 접속한 무선 AP(Access Point)에서 과도한 트래픽을 처리해야 하는 경우, 단말과 AP의 접속이 해제되어 화상회 의 접속이 끊기거나, 패킷 손실로 인해 화상이나 음성이 제대로 전달되지 않아서 정상적인 화상회의를 진행할 수 없게 될 수 있다. 무선 AP는 접속 단말이 많을수록 최대 처리 성능이 급격하게 떨어지는 문제가 있고, 이를 방지하기 위하여 AP에 접속 단말 수를 제한할 수 있다. 하지만, 사용자가 화상회의를 사용하지 않을 때에도 접속 단말 수가 제한되는 문제가 있고, 접속 단말 수 제한에 의해 AP를 추가적으로 설치하게 되어 투자비/운용비가 증가할 수 있다. 게다 가, AP 성능 저하는 접속 단말 수뿐만 아니라, 트래픽 처리량, 간섭에 의한 AP 부하 등 다양한 조건이 복합적으 로 작용하여 발생하기 때문에, 수동으로 접속 단말 수를 조절한다고 하여 AP 성능 저하를 막기 어렵다. 이처럼 화상회의 품질 저하가 발생했을 때, 사용자는 접속한 AP에 의한 문제인지, 화상회의 어플리케이션 문제 인지, 단말 성능 문제인지 알기 어려워서 화상회의 품질 저하의 원인을 알 수 없다. 화상회의 어플리케이션은 로컬 네트워크의 상황에 대하여 알기 어렵고, AP는 화상회의만을 위해 최적화된 네트워킹 기능을 제공하고 있지 않아서 화상회의 품질 저하의 원인을 파악하는 것이 쉽지 않다."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 무선랜 환경에서의 화상회의 품질 관리 방법 및 장치를 제공하는 것이다. 본 개시는 인공지능 기반으로 무선 AP에 의한 화상회의 품질 영향을 예측하고, 무선 AP에 접속하여 화상회의 어 플리케이션을 실행 중인 사용자에게 품질 정보를 제공하는 방법 및 장치를 제공하는 것이다."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시예에 따른 화상회의 품질 관리 장치의 동작 방법으로서, AP(Access Point)별 상태 정보를 수집하는 단계, AP 상태 정보와, 해당 AP를 통해 전송되는 화상회의 품질의 관계를 학습한 인공지능 모델을 이용하여, 상 기 AP별 상태 정보에 대해 AP별 화상회의 품질 정보를 예측하는 단계, 그리고 화상회의 품질 정보가 기준 이하 로 예측된 특정 AP를 탐지하는 단계를 포함한다. 상기 동작 방법은 각 AP에 접속한 단말들의 IP 정보와 화상회의 어플리케이션이 실행된 단말 IP 정보를 비교하 여, 상기 화상회의 어플리케이션을 실행한 단말들이 접속한 AP 정보를 관리하는 단계를 더 포함할 수 있다. 상기 화상회의 어플리케이션이 실행된 단말 IP 정보는 해당 단말에 설치된 화상회의 품질 관리 어플리케이션을 통해 획득될 수 있다. 상기 동작 방법은 단말들에 설치된 화상회의 품질 관리 어플리케이션을 통해, 상기 화상회의 어플리케이션이 실 행된 단말 IP 정보 그리고 접속한 AP 정보를 획득하는 단계를 더 포함할 수 있다. 상기 동작 방법은 상기 화상회의 어플리케이션을 실행한 단말들이 접속한 AP 정보를 기초로, 상기 특정 AP에 접 속해서 화상회의 어플리케이션을 실행 중인 특정 단말에게 화상회의 품질 정보를 제공하는 단계를 더 포함할 수 있다. 상기 동작 방법은 상기 특정 AP의 화상 회의 품질이 기준 이하로 예측된 시점을 AP별 화상회의 품질 히스토리에 저장하는 단계를 더 포함할 수 있다. 상기 상기 동작 방법은 상기 AP별 화상회의 품질 히스토리를 기초로, 임의 단말에게, 접속 가능한 AP별로 시간 에 따른 화상회의 품질 정보를 제공하는 단계를 더 포함할 수 있다. 상기 AP 상태 정보는 링크 트래픽율, 간섭율, 채널사용율, 그리고 접속 단말 수 중 적어도 하나를 포함할 수 있 다. 상기 AP 상태 정보는 해당 AP에 접속한 단말 수 중에서 화상회의 어플리케이션을 실행하여 화상회의에 참여 중 인 단말 수를 더 포함할 수 있다.상기 AP별 상태 정보를 수집하는 단계는 무선랜 컨트롤러를 통해 상기 AP별 상태 정보를 수집하거나, 네트워크 장치들을 관리하는 장치로부터 상기 AP별 상태 정보를 수집할 수 있다. 상기 인공지능 모델은 동일 시점에 획득된 AP 상태 정보 그리고 화상회의 트래픽의 품질 정보가 매핑된 훈련 데 이터를 통해, 입력된 AP 상태 정보로부터 정답인 화상회의 품질 정보를 추론하도록 훈련된 모델일 수 있다. 한 실시예에 따른 화상회의 품질 관리 장치의 동작 방법으로서, AP(Access Point)의 AP 상태 정보를 수집하는 단계, 상기 AP에서 전송되는 패킷들 중에서 화상회의 데이터가 전송되는 패킷들을 추출하고, 적어도 하나의 실 시간 전송 세션에서 발생한 패킷 손실율을 계산하는 단계, 그리고 상기 패킷 손실율을 기초로 상기 AP에서의 화 상회의 품질을 평가하고, 평가한 화상회의 품질 정보를 해당 시점에서 수집된 AP 상태 정보의 정답으로 레이블 링하여 인공지능 모델의 훈련 데이터를 생성하는 단계를 포함한다. 상기 동작 방법은 상기 훈련 데이터를 기초로, 상기 인공지능 모델이 입력된 AP 상태 정보로부터 정답인 화상회 의 품질 정보를 추론하도록 훈련시키는 단계를 더 포함할 수 있다. 상기 AP 상태 정보는 링크 트래픽율, 간섭율, 채널사용율, 그리고 접속 단말 수 중 적어도 하나를 포함할 수 있 다. 상기 AP 상태 정보는 상기 AP에 접속한 단말 수 중에서 화상회의 어플리케이션을 실행하여 화상회의에 참여 중 인 단말 수를 더 포함할 수 있다. 상기 AP 상태 정보를 수집하는 단계는 무선랜 컨트롤러를 통해 상기 AP의 상태 정보를 수집하거나, 네트워크 장 치들을 관리하는 장치로부터 상기 AP의 상태 정보를 수집할 수 있다. 한 실시예에 따라 화상회의 품질 관리 장치와 연동하는 단말의 동작 방법으로서, AP(access point)에 접속한 상 태에서 화상회의 어플리케이션이 실행되면, 상기 화상회의 품질 관리 장치로 화상회의 어플리케이션 실행을 보 고하는 단계, 그리고 상기 화상회의 품질 관리 장치로부터 상기 AP의 상태에 대해 예측된 화상회의 품질 정보를 수신하고, 화상회의 품질 저하에 대한 알람을 표시하는 단계를 포함할 수 있다. 상기 보고는 상기 화상회의 어플리케이션의 종류, 단말 IP 정보, 또는 접속한 상기 AP 정보 중 적어도 하나를 포함할 수 있다. 상기 동작 방법은 현재 접속한 AP에서 화상회의 품질 저하가 예상되는 시간 정보를 화면에 표시하는 단계를 더 포함할 수 있다. 상기 동작 방법은 화상회의 예약 화면에서, 접속 가능한 AP별로 예측된 현재 화상회의 품질, 또는 시간에 따른 화상회의 품질 정보를 표시하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시에 따르면, 실시간으로 RTP 패킷을 추출하여 패킷 손실율을 분석하지 않아도, AP 상태 정보만으로 화상 회의 품질 저하를 빠르고 정확히 예측할 수 있다. 본 개시에 따르면, 사용자는 AP에 의한 화상회의 품질 영향을 미리 고려하여 화상회의 일정을 결정할 수 있고, 화상회의 중에 AP에 의한 품질 저하가 예측되는 경우, 불필요한 트래픽 발생을 피하는 등의 조치를 취할 수 있 다. 본 개시에 따르면, 화상회의 품질 저하 원인이 AP인지 알 수 있어서, 사용자는 AP별 품질 저하 예측 빈도를 통 해 품질 저하 예측 빈도가 높은 AP 주변에 AP를 증설하는 등의 AP 운용 계획을 수립할 수 있어서, 불필요하고 비효율적인 네트워크 증설을 줄일 수 있다."}
{"patent_id": "10-2023-0015015", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 개시를 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 네트워크를 구성하는 장치 들은 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 서버 또는 단말을 포함하는 장치는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드 하는 메모리, 컴퓨터 프로그램 및 각종 데이터를 저장하는 저장 장치, 통신 인터페이스를 포함하는 컴퓨팅 장치 일 수 있다. 이외에도, 장치는 다양한 구성 요소가 더 포함될 수 있다. 프로세서는 장치의 동작을 제어하고, 컴 퓨터 프로그램에 포함된 명령어들을 처리하는 다양한 형태의 프로세서일 수 있고, 예를 들면, CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 메모 리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 동작을 실행하도록 기술된 명령어들이 프로세서에 의해 처리되도록 해당 컴퓨터 프로그램을 저장 장치로부터 로드할 수 있다. 메모리는 예를 들면, ROM(read only memory), RAM(random access memory) 등 일 수 있다. 저장 장치는 컴퓨터 프로그램, 각종 데이 터를 비임시적으로 저장할 수 있다. 저장 장치는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매 체를 포함하여 구성될 수 있다. 통신 인터페이스는 유/무선 통신을 지원하는 유/무선 통신 모듈일 수 있다. 컴 퓨터 프로그램은, 프로세서에 의해 실행되는 명령어들(instructions)을 포함하고, 비일시적-컴퓨터 판독가능 저 장매체(non-transitory computer readable storage medium)에 저장되며, 명령어들은 프로세서가 본 개시의 동 작을 실행하도록 만든다. 도 1은 한 실시예에 따른 화상회의 품질 관리 시스템의 구성도이다. 도 1을 참고하면, 화상회의 품질 관리 시스템은 화상회의 품질 관리 장치, 복수의 단말들(200; 200-1, 200-2, 200-3, 200-4, 200-5, 200-6, …)이 접속한 적어도 하나의 무선 접속 장치(Access Point, AP)(300; 300-1, 300-2, …)를 포함할 수 있다. 화상회의 품질 관리 시스템은 다수의 AP들에 연결되어, 집선된 AP들 의 트래픽을 송수신하는 네트워크 스위치를 더 포함할 수 있다. 설명에서, 화상회의는 둘 이상의 단말이 연결되어 비디오, 오디오, 문서 등의 미디어를 스트리밍하는 실시간 통신 서비스를 의미하고, 온라인 미팅, 온 라인 교육, 온라인 컨퍼런스 등의 실시간 서비스에 활용될 수 있다. 화상회의 데이터는 실시간 전송되고, 이를 위한 통신 프로토콜로서, 예를 들면, RTP(Real-time Transport Protocol)가 사용될 수 있다. 설명에서는 화상 회의 데이터가 RTP 패킷으로 전달되고, RTP 세션을 수립한다고 설명하나, 통신 프로토콜은 변경될 수 있다. 각 단말은 근처의 AP에 접속해서 인터넷 서비스를 이용할 수 있고, 다양한 어플리케이션이 실행되면 원격의 서 버에 접근함으로써 해당 서버에서 제공하는 화면을 표시할 수 있다. 설명에서 각 단말은 화상회의 어플리케이션 을 실행하여 화상회의 서버에 접속함으로써 화상회의 트래픽을 발생시키거나, 일반 콘텐츠 제공 서버에 접속하여 화상회의 트래픽 이외의 트래픽(일반 트래픽이라고 함)을 발생시키거나, 또는 별다른 트래픽 발생 없 이 AP와의 접속 상태를 유지할 수 있다. 화상회의 어플리케이션의 종류는 다양할 수 있다. 각 단말은 화상회의 품질 관리 장치와 통신하는 화상회의 품질 관리 어플리케이션을 탑재하고, 화상회의 품질 관리 어플리케이션을 통해 화상회의 품질 관리 장치로부터 제공된 화상회의 품질 정보를 표시할 수 있다. 화상회의 품질 관리 어플리케이션은 화상회의 어플리케이션과 연동해서, 화상회의 품질 정보에 따라 화상 회의 어플리케이션을 제어할 수 있다. 화상회의 품질 관리 어플리케이션은 화상회의 어플리케이션이 실행되면 화상회의 품질 관리 장치로 단말 IP 정보 그리고 접속한 AP 정보를 전송할 수 있다. AP는 근처의 단말들에게 무선랜 서비스를 제공한다. AP는 무선랜 컨트롤러에 의해 관리될 수 있다. 무선랜 컨트롤러는 네트워크 스위치에 구현되거나, 네트워크 스위치와 연동하도록 구현될 수 있다. 적어도 하나의 프로세서에 의해 동작하는 화상회의 품질 관리 장치는 AP를 통해 구축된 로컬 무선랜 환경에서, 훈련된 인공지능(Artificial Intelligence, AI) 모델 기반으로 AP에 의한 화상회의 품질 정보 를 예측할 수 있다. 이를 통해, 화상회의 품질 관리 장치는 화상회의 품질 저하가 예상되는 AP를 탐지하고, 해당 AP에 접속하여 화상회의 서비스를 이용 중인 단말에게 AP에 의한 화상회의 품질 정보를 제공함 으로써, 현재의 무선랜 환경을 고려하여 화상회의가 진행될 수 있도록 할 수 있다. 이외에도, 화상회의 품질 관 리 장치는 AP별 품질 히스토리에 기반하여, 시간에 따른 AP별 화상회의 품질 정보를 사용자에게 안내하여 접속할 AP를 추천하거나, 화상회의 일정 선택을 보조할 수 있다. 인공지능 모델은 별도의 장치에서 훈련될 수 있으나, 설명의 편의를 위해 화상회의 품질 관리 장치가 인공지능 모델의 훈련을 위한 훈련 데이터를 생성하고, 훈련 데이터를 기초로 인공지능 모델을 훈련 한 후, 훈련된 인공지능 모델을 사용하여 AP에 의한 화상회의 품질 정보를 실시간 예측한다고 가정한다. 인공지능 모델은 AP 상태 정보로부터 해당 AP에 접속한 단말에서의 화상회의 품질 정보를 예측하도록 훈련 된다. 여기서 AP 상태 정보는 다양한 파라미터들로 정의될 수 있는데, 예를 들면, 표 1과 같이 링크 트래픽율, 간섭율, 채널사용율, 접속 단말 수 중 적어도 하나를 포함할 수 있다. AP 상태 정보는 화상회의 참여 단말 수를 더 포함할 수 있다. 표 1 파라미터 설명 P1 링크 트래픽율(%) AP 주파수(예를 들면, 20MHz)에서의 트래픽 처리량에 대한 측 정 시점에서 발생하는 트래픽량의 비율 링크 트래픽율= 측정 트래픽량/주파수 트래픽 처리량 P2 간섭율(%) 주변 AP 등에 발생하는 주파수 간섭에 의해 주파수 트래픽 처 리량에서 영향받는 트래픽 비율 P3 채널사용율(%) 채널사용율 = 링크 트래픽율 + 간섭율 P4 접속 단말 수 AP에 접속된 단말 수 P5 화상회의 참여 단말 수AP에 접속된 단말들 중 화상회의 어플리케이션을 실행 중인 단말 수 링크 트래픽율이 높고 간섭율이 높고, 채널 사용율이 높을수록 AP의 가용 처리량이 줄어들어 화상회의 품질이 저하될 가능성이 높다. 접속 단말 수가 많을수록 Contention Overhead로 인하여 AP 가용 처리량이 줄어들어 화 상회의 품질이 저하될 가능성이 높다. 화상회의 참여 단말 수가 많을수록, 화상회의 품질이 저하될 가능성이 높 다. 먼저 화상회의 품질 관리 장치가 훈련 데이터를 생성하는 방법에 대해 설명한다. 훈련 데이터는 AP 상태 정보 그리고 정답인 화상회의 트래픽의 품질 정보로 구성될 수 있다. 정답인 화상회의 트래픽의 품질 정보는 AP 상태 정보와 동일 시점에, 해당 AP를 통해 전송되는 화상회의 트래픽(RTP 트래픽)의 품질 정보일 수 있다. 정답은 인공지능 모델로부터 예측하고자 하는 결과에 따라 다양하게 레이블링될 수 있다. 예를 들어, 인공지능 모델이 AP 상태 정보로부터 품질 정상 또는 품질 저하를 예측하고자 하는 경우, AP 상태 정보에 화상회의 품질 정상 또는 화상회의 품질 저하가 정답으로 레이블링될 수 있다. 또는 인공 지능 모델이 AP 상태 정보로부터 패킷 손실율을 예측하고자 하는 경우, AP 상태 정보에 화상회의 패킷 손 실율(RTP 패킷 손실율)이 정답으로 레이블링될 수 있다. 이외에도, 인공지능 모델이 AP 상태 정보로부터 화상회의 품질을 단계적으로 예측하고자 하는 경우, AP 상태 정보에 해당하는 품질 단계가 정답으로 레이블링될 수 있다. 화상회의 품질 관리 장치는 인공지능 모델의 입력 데이터인 AP 상태 정보를 수집한다. 화상회의 품질 관리 장치는 훈련 데이터 생성을 위해 주기적으로 또는 비주기적으로 AP들(300-1, 300-2, …)의 상태 정보 를 수집하고, AP 상태 정보에 수집 시점이 매핑될 수 있다. 화상회의 품질 관리 장치는 AP를 관리하는 무 선랜 컨트롤러를 통해 AP별 상태 정보를 획득하거나, AP들을 비롯한 네트워크 장치를 통합 관리하는 관리 장치, 예를 들면, EMS(Element Management System)로부터 AP별 상태 정보를 획득할 수 있다. AP 상태 정보는 예를 들 면, 링크 트래픽율, 간섭율, 채널사용율, 접속 단말 수 등을 포함할 수 있다. 화상회의 품질 관리 장치는 훈련 데이터의 정답값을 얻기 위해, 각 AP를 통해 전송되는 화상회의 트래픽의 품질을 평가한다. 화상회의 품질 관리 장치가 화상회의 트래픽의 품질을 평가하는 방법은 다양할 수 있다. 예를 들면, 화상회의 품질 관리 장치는 각 AP를 통해 전송되는 패킷들을 모니터링하고, 화상회의 데이터가전달되는 RTP 트래픽을 분리할 수 있다. 그리고, 화상회의 품질 관리 장치는 AP#1(300-1)에 연결된 단말들 중 RTP 트래픽이 발생한 특정 단말들(예를 들면, 200-1, 200-2, 200-3)에서의 패킷 손실을 획득할 수 있다. 예 를 들어, 화상회의 품질 관리 장치는 네트워크 스위치로부터 무선랜 컨트롤러와 접속된 포트 또는 인 터넷망과 연결된 포트를 미러링하여 각 AP에서 전송하는 패킷들을 수집할 수 있다. 한편, 화상회의 품질 관리 장치는 각 AP를 통해 접속한 단말들 중에서, 화상회의 어플리케이션을 실행한 단말 정보를 관리할 수 있다. 단말 정보는 AP별로 화상회의 어플리케이션을 실행한 단말 목록이나 단말 수, 해 당 단말의 IP 정보를 포함할 수 있다. 화상회의 참여 단말 수는 인공지능 모델의 입력 데이터에 포함될 수 있다. 이를 위해, 화상회의 품질 관리 장치는 화상회의 어플리케이션이 사용하는 IP 주소 대역 및 포트 대 역 정보를 사전에 저장하고, 각 AP에 접속한 단말의 IP 정보 및/또는 각 AP에서 일정 기간 수집된 패킷 헤더 정 보를 취합해서, AP별로 특정 시점마다 화상회의 어플리케이션을 실행한 단말 정보(단말 목록, 단말 수, 단말의 IP 정보 등)를 확인할 수 있다. 각 AP에 접속한 단말의 IP 주소 정보는 무선랜 컨트롤러로부터 제공될 수 있다. 여기서, 패킷 헤더 정보를 통해 소스 IP 주소, 소스 포트, 대국 IP 주소, 대국 포트 등의 IP 정보가 추출될 수 있다. 각 AP에서 일정 기간 수집된 트래픽의 헤더 정보는 네트워크 스위치로부터 미러링된 포트를 통해 확 인할 수 있다. 화상회의 품질 관리 장치는 특정 단말들에서 생성된 RTP 세션의 패킷 손실율을 기초로 AP#1(300-1)에서의 화상회의 품질을 평가하고, 평가한 화상회의 품질 정보를 해당 시점에서 수집된 AP 상태 정보의 정답으로 레이 블링할 수 있다. 정답은 인공지능 모델로부터 예측하고자 하는 결과에 따라 다양하게 레이블링될 수 있다. 예를 들어, 인공지능 모델이 AP 상태 정보로부터 품질 정상 또는 품질 저하를 예측하고자 하는 경우, 화상회의 품질 관리 장치는 패킷 손실율이 기준 이상인 시점의 AP 상태 정보에 품질 저하를 매핑 하고, 패킷 손실율이 기준 미만인 시점의 AP 상태 정보에 품질 정상을 매핑하여 훈련 데이터를 생성할 수 있 다. 한편, 화상회의 품질 관리 장치는 인공지능 모델의 훈련 데이터 생성을 위해 실시간으로 특정 단말들 에서 생성된 RTP 세션의 패킷 손실율을 계산하고, AP의 영향에 의한 화상회의 품질을 평가하기 때문에, 현재 화 상회의 품질 저하가 예상되는 AP를 알 수 있다. 따라서, 화상회의 품질 관리 장치는 훈련 데이터 생성 중 이라도, 현재 화상회의 품질 저하가 예상되는 AP에 접속해서 화상회의 어플리케이션을 실행 중인 단말에게 평가 한 화상회의 품질 정보를 제공할 수 있다. 화상회의 품질 관리 장치는 동일 시점에 획득된 AP 상태 정보 그리고 화상회의 트래픽의 품질 정보를 매핑 하여 훈련 데이터를 생성할 수 있다. 화상회의 품질 관리 장치는 훈련 데이터를 기초로, 인공지능 모델 이 입력된 AP 상태 정보로부터 정답인 화상회의 품질 정보를 추론하도록 훈련시킬 수 있다. 인공지능 모델 의 훈련 방법으로서, 지도 학습 등 다양한 방법이 사용될 수 있다. 예를 들면, 인공지능 모델은 링크 트래픽율, 간섭율, 채널사용율, 접속 단말 수로 구성된 벡터를 입력받고, 입력을 품질 정상 또는 품질 저하로 분류하는 태스크를 학습할 수 있다. 인공지능 모델은 LightGBM 등의 분류학습 모델로 구현될 수 있다. 인공지능 모델은 훈련 데이터를 기초로, AP의 링크 트래 픽율, 간섭율, 채널사용율, 접속 단말 수 등으로 정의된 AP 상태 정보와, 해당 AP를 통해 전송되는 화상회의 품 질의 관계를 학습할 수 있다. 이후, 화상회의 품질 관리 장치는 훈련된 인공지능 모델을 사용하여 각 AP에 의한 화상회의 품질 정 보를 예측할 수 있다. 화상회의 품질 관리 장치는 AP들을 관리하는 무선랜 컨트롤러 또는 AP들을 관리하는 관리 장치(예를 들면, EMS)와 연동하여, AP#1(300-1)의 상태 정보, AP#2(300-2)의 상태 정보를 계속해서 획득할 수 있다. AP 상태 정보는, 링크 트래픽율, 간섭율, 채널사용율, 접속 단말 수 등을 포함할 수 있다. 화상회의 품질 관리 장치는 훈련된 인공지능 모델을 이용하여, AP#1(300-1)의 상태 정보에 대해 추론 된 화상회의 품질 정보를 획득하고, AP#2(300-2)의 상태 정보에 대해 추론된 화상회의 품질 정보를 획득할 수 있다. 화상회의 품질 관리 장치는 인공지능 모델을 통해, 입력에 포함된 AP 상태 정보 중에서, 추론 된 화상회의 품질 정보에 중요한 영향을 준 파라미터(예를 들면, AP 접속 단말 수)를 획득하고, 이를 품질 저하 원인으로 결정할 수 있다. 예를 들어, 어느 시점에, AP#1(300-1)은 4대의 단말들과의 접속 링크가 형성되고 있고, 이 중 3대의 단말들 (200-1, 200-2, 200-3)이 화상회의 어플리케이션을 실행 중이고, AP#2(300-2)는 2대의 단말들과의 접속 링크가 형성되고 있고, 이 중 1대의 단말(200-5)이 화상회의 어플리케이션을 실행 중이라고 가정한다. 이러한 상황에서AP#1(300-1)의 상태 정보에 대해 추론된 화상회의 품질 정보는 품질 저하로 추론되고, AP#2(300-2)의 상태 정보 에 대해 추론된 화상회의 품질 정보는 품질 정상으로 추론될 수 있다. 그러면, AP#1(300-1)에 접속해서 화상회 의 어플리케이션을 실행 중인 단말들이 AP에 의해 품질 저하를 겪을 가능성이 있다. 따라서, 화상회의 품질 관 리 장치는 AP#1(300-1)에서의 화상회의 품질 저하를 탐지하고, AP#1(300-1)에 접속해서 화상회의 어플리케 이션을 실행 중인 단말들에게 예측한 화상회의 품질 정보를 제공할 수 있다. 화상회의 품질 관리 장치는 각 AP를 통해 접속한 단말들 중에서, 화상회의 어플리케이션을 실행한 단말 정 보를 관리하므로, 현재 화상회의 품질 저하가 예상되는 AP에 접속해서 화상회의 어플리케이션을 실행 중인 단말 로 예측한 화상회의 품질 정보를 전송할 수 있다. 화상회의 품질 관리 장치는 화상회의가 진행 중인 동안 주기적으로 예측한 화상회의 품질 정보를 전송할 수 있다. 인공지능 모델을 통해 화상회의 품질 저하가 예상되는 AP를 탐지할 수 있어서, 실시간으로 RTP 패킷을 추 출하여 패킷 손실율을 분석하지 않아도 AP 상태 정보만으로 화상회의 품질 저하를 빠르고 정확히 예측할 수 있 다. 한편, 단말들은 화상회의 품질 관리 장치와 통신하는 화상회의 품질 관리 어플리케이션을 탑재하고, 품질 관리 어플리케이션을 통해 화상회의 품질 관리 장치로부터 화상회의 품질 정보를 수신할 수 있다. 품질 관 리 어플리케이션은 화면에 화상회의 품질을 표시하여, 사용자가 AP에 의한 품질 영향을 알고 조치(예를 들면, 파일 업로드/다운로드를 하지 않음)하도록 할 수 있다. 화상회의 품질에 대한 알람은 다양하게 표시될 수 있는 데, 예를 들면, 팝업 등의 방식으로 제공될 수 있다. 이때, 접속된 AP 명칭, 알람 발생시점, 화상회의 품질 저 하 원인(예를 들면, 트래픽 사용율, AP 접속자수 등), 불필요한 다운로드/업로드에 대한 자제 요청 내용 등을 제공할 수 있다. 품질 관리 어플리케이션은 현재 접속한 AP에 의해 화상회의 품질이 영향받고 있으므로, 다른 AP에 접속하도록 안내할 수 있다. 이를 위해, 화상회의 품질 관리 장치는 AP#1(300-1)에서 화상회의 품질 저하가 예상되는 경우, AP 위치 정보를 기초로 AP#1(300-1) 근처의 AP#2(300-2)를 확인하고, AP#2(300-2)에서의 화상회의 품질 이 양호한 경우, AP#2(300-2)로의 접속을 안내할 수 있다. 화상회의 품질 관리 어플리케이션이 화상회의 어플리 케이션과 연동해서, 현재 AP의 상태에 맞게 해상도를 조절하는 등의 품질 관련 제어를 할 수 있다. 화상회의 품질 관리 장치는 AP별 품질 저하 예측 빈도를 통계적으로 관리하고, 화상회의 품질 관리 어플리 케이션을 통해 각 AP의 품질 히스토리에 기반한 화상회의 품질 정보를 제공할 수 있다. 예를 들어, 화상회의 품 질 관리 장치는 표 2와 같이, AP마다 요일별, 시간대별로 품질 저하 예측 빈도를 관리하고, 접속 가능한 AP들에서 화상회의 품질 저하가 예상되는 시간 정보나 화상회의 품질이 양호한 시간 정보를 사용자에게 제공할 수 있다. 화상회의 품질을 알 수 있는 정보는 화상회의 품질 저하 빈도이거나, 화상회의 품질을 나타내는 컬러 (예를 들면, 품질 정상이면 녹색, 품질 저하이면 빨강) 등일 수 있다. 표 2 AP #1(사무실 입구 AP) 월 화 수 목 금 8:00~9:00 0 0 0 0 0 9:00~10:00 1 0 0 0 0 10:00~11:00 12 0 5 10 0 11:00~12:00 1 0 0 0 0 ... ... ... ... ... ... 예를 들어, AP#1(300-1)에 접속한 단말은 화상회의 예약 화면에서, AP#1(300-1)의 화상회의 품질 저하가 예상되 는 시간 정보를 표시함으로써, 사용자는 화상회의 품질 저하가 예상되는 시간(예를 들면, 월요일, 수요일, 목요 일 10시)을 피해서 화상회의를 예약할 수 있다. 또한, 사용자는 AP별 품질 저하 예측 빈도를 통해 품질 저하 예 측 빈도가 높은 AP 주변에 AP를 증설하는 등의 AP 운용 계획을 수립할 수 있다.화상회의 품질 관리 장치는 사용자가 접속 가능한 AP별로 예측된 현재 화상회의 품질을 제공할 수 있다. 따라서, 단말은 화상회의 어플리케 이션이 실행되거나 화상회의 예약 시간이 도래하면, 현재 접속한 AP에서 예측된 화상회의 품질과 함께 이용 가 능한 AP들에서 예측된 화상회의 품질을 제공할 수 있다. 그러면, 사용자는 접속 가능한 AP들 중에서, 정해진 화 상회의 시간에 품질이 가장 양호한 AP를 확인하고, 접속 가능한 AP들 중에서 해당 AP를 선택하거나, AP가 위치 한 장소(예를 들면 회의실)로 이동하여 해당 AP에 접속할 수 있다. 도 2는 한 실시예에 따른 화상회의 품질 예측을 위한 인공지능 모델의 훈련 방법을 나타내는 흐름도이다. 도 2를 참고하면, 화상회의 품질 관리 장치는 AP별 상태 정보를 수집한다(S110). 화상회의 품질 관리 장치 는 훈련 데이터 생성을 위해 주기적으로 또는 비주기적으로 AP별 상태 정보를 수집하고, AP 상태 정보에 수집 시점이 매핑될 수 있다. 화상회의 품질 관리 장치는 AP를 관리하는 무선랜 컨트롤러를 통해 AP별 상 태 정보를 획득하거나, AP들을 비롯한 네트워크 장치를 통합 관리하는 관리 장치(예를 들면, EMS)로부터 AP별 상태 정보를 획득할 수 있다. AP 상태 정보는 예를 들면, 표 1과 같이 링크 트래픽율, 간섭율, 채널사용율, 접 속 단말 수 등을 포함할 수 있다. 화상회의 품질 관리 장치는 각 AP에서 전송되는 패킷들 중에서 화상회의 데이터가 전송되는 패킷들(RTP 패 킷들)을 추출한다(S120). 화상회의 품질 관리 장치는 AP들이 집선된 네트워크 스위치에서 미러링된 포트를 통해 각 AP에서 전송되는 패킷들을 수집할 수 있다. 한편, 화상회의 품질 관리 장치는 각 AP에서 전송되는 패킷들을 계속해서 모니터링하면서 RTP 패킷들을 추출하는 대신, 수집한 AP 상태 정보 중 적어도 하나 의 파라미터(예를 들면, 채널사용율 및 접속 단말 수)가 기준 이상인 경우, 해당 AP에서 전송되는 RTP 패킷들을 추출할 수 있다. 또한, AP에 접속된 모든 단말들의 트래픽을 미러링하면 부하가 클 수 있으므로, 화상회의 품질 관리 장치는 일정 수(예를 들면, 2~3개)의 단말들에 대한 RTP 패킷들을 추출할 수 있다. 이때, 화상회의 품질 관리 장치는 각 AP에서 전송되는 RTP 패킷들 기초로, 해당 AP에 접속해서 화상회의 어플리케이션을 이용 중인 단말 정보(단말 목록이나 단말 수, 해당 단말의 IP 정보 등)를 추출해서, 인공지능 모델의 입력 데이터에 포함되는 화상회의 참여 단말 수를 획득할 수 있다. 화상회의 품질 관리 장치는 AP별로, 적어도 하나의 실시간 전송 세션(RTP 세션)에서 발생한 패킷 손실율을 계산한다(S130). 화상회의 품질 관리 장치는 패킷 헤더에서 RTP 세션을 구분할 수 있는 식별자, 예를 들면 동기 발신 식별자(Synchronization SouRCe ID, SSRC ID)를 추출함으로써, RTP 세션마다 패킷 손실을 계산할 수 있다. 패킷 손실율은 전체 수신한 RTP 패킷 수에서 손실이 발생한 패킷 수의 비율로 정의될 수 있다. 화상회의 품질 관리 장치는 AP별로 계산된 패킷 손실율을 기초로 해당 AP에서의 화상회의 품질을 평가하고, 평가한 화상회의 품질 정보를 해당 시점에서 수집된 AP 상태 정보의 정답으로 레이블링한다(S140). 정답은 인공지능 모델로부터 예측하고자 하는 결과에 따라 다양하게 레이블링될 수 있다. 예를 들어, 인공 지능 모델이 AP 상태 정보로부터 품질 정상 또는 품질 저하를 예측하고자 하는 경우, 패킷 손실율을 기초 로 구분된 화상회의 품질 정상 또는 화상회의 품질 저하가 정답으로 레이블링될 수 있다. 또는 인공지능 모델 이 AP 상태 정보로부터 패킷 손실율을 예측하고자 하는 경우, AP 상태 정보에 화상회의 패킷 손실율(RTP 패킷 손실율)이 정답으로 레이블링될 수 있다. 이외에도, 인공지능 모델이 AP 상태 정보로부터 화상회의 품질을 단계적으로 예측하고자 하는 경우 패킷 손실율을 기초로 구분된 품질 단계가 정답으로 레이블링될 수 있 다. 화상회의 품질 관리 장치는 동일 시점에 획득된 AP 상태 정보 그리고 화상회의 트래픽의 품질 정보를 매핑 하여 훈련 데이터를 생성한다(S150). 화상회의 품질 관리 장치는 표 3과 같이, 동일 시점에 획득된 AP 상 태 정보 그리고 화상회의 트래픽의 품질 정보를 매핑하여 훈련 데이터를 생성할 수 있다. 표 3에서, P1은 링크 트래픽율이고, P2는 간섭율이고, P3는 채널 사용율이고, P4는 접속 단말 수이며, P5는 화상회의 참여 단말 수일 수 있다. 표 3 발생 시점 장비 P1P2 P3 P4 P5 패킷 손실 품질 정보 시점1AP #172%10%82% 15 14 23.1% 품질 저하 시점2AP #160%10%76% 17 13 12.2% 품질 저하 시점3AP #261%21%82% 16 0 - 품질 정상 시점4AP #161%10%71% 17 13 0.02% 품질 저하 시점5AP #261%21%82% 16 0 - 품질 정상 화상회의 품질 관리 장치는 훈련 데이터를 기초로, 인공지능 모델이 입력된 AP 상태 정보로부터 정답 인 화상회의 품질 정보를 추론하도록 훈련시킨다(S160). 인공지능 모델의 훈련 방법으로서, 지도 학습 등 다양한 방법이 사용될 수 있다. 한편, AP 상태 정보는 표 1과 같이, 화상회의 참여 단말 수를 더 포함할 수 있는데, 화상회의 참여 단말 수는 다음과 같이 계산될 수 있다. 화상회의 품질 관리 장치는 먼저, 각 화상회의 어플리케이션이 사용하는 IP 주소/포트 대역 정보를 저장할 수 있다. 예를 들면, 표 4와 같이, 화상회의 어플리케이션마다의 IP 주소 대역 및 포트 대역 정보가 사전에 저 장될 수 있다. 표 4 화상회의 어플리케이션 정보 값 화상회의 어플리케이션 ID 10 IP 주소 대역 200.200.200.10 - 200.200.200.20 포트 대역 9001 - 9005 화상회의 품질 관리 장치는 표 5와 같이, 일정 시간 간격마다 각 AP에 접속한 단말 IP 정보를 획득할 수 있다. 화상회의 품질 관리 장치는 무선랜 컨트롤러로부터 각 AP에 접속한 단말 IP 정보를 획득하거나, AP 로부터 접속한 단말 IP 정보를 획득하거나, 또는 EMS로부터 각 AP에 접속한 단말 IP 정보를 획득할 수 있다. 표 5 수집 시각 AP ID 단말 IP 2022-10-01 10:15:00 AP#1 10.10.10.10 2022-10-01 10:15:00 AP#1 10.10.10.11 2022-10-01 10:15:00 AP#2 10.10.10.12 2022-10-01 10:15:00 AP#1 10.10.10.13 … … … 화상회의 품질 관리 장치는 일정 시간(예를 들면 1분) 단위로, AP들에서 전송되는 패킷들을 수집할 수 있 다. 화상회의 품질 관리 장치는 AP들이 집선된 네트워크 스위치에서 미러링된 포트를 통해 AP들에서 전송되는 패킷들을 수집할 수 있다. 화상회의 품질 관리 장치는 수집한 패킷들의 헤더 정보를 통해 소스 IP 주소, 소스 포트, 대국 IP 주소, 대국 포트 등의 IP 정보를 추출할 수 있다. 화상회의 품질 관리 장치는 각 AP에 접속한 단말 IP 정보를 알 고 있으므로, 소스 IP 주소를 기초로 해당 소스 IP 주소에 해당하는 단말이 접속한 AP를 식별할 수 있다. 또한, 화상회의 품질 관리 장치는 화상회의 어플리케이션마다의 IP 주소 대역 및 포트 대역 정보를 알고 있으므 로, 대국 IP 주소 및 포트를 기초로 해당 패킷이 화상회의 트래픽인지 식별할 수 있다. 화상회의 품질 관리 장치는 표 6과 같이, 수집한 패킷의 IP 정보, 해당 패킷을 전송한 AP, 그리고 해당 패 킷이 화상회의 패킷인지 여부를 매핑할 수 있다. 표 6 수집 시각 소스 IP 소스 포트대국 IP 대국포트…접속 AP화상회 의 App ID 2022-10-01 10:15:0010.10.10.103001 200.200.200.10 9001…AP#110 2022-10-01 10:15:0010.10.10.113001 200.200.200.10 9002…AP#110 2022-10-01 10:15:0010.10.10.111002 100.100.100.100 7000…AP#1Null 2022-10-01 10:15:0010.10.10.121001 90.90.90.90 1000…AP#2Null 2022-10-01 10:15:0010.10.10.133001 200.200.200.10 9002…AP#110 … … … … … … … 이를 통해, 화상회의 품질 관리 장치는 표 7과 같이, 특정 시점에 AP별로 화상회의 참여 단말 수를 알 수 있다. 예를 들면, AP#1에 접속해서 화상회의 어플리케이션을 이용 중인 소스IP는 10.10.10.10, 10.10.10.11, 10.10.10.13이므로, 화상회의 참여 단말 수는 3이다. 표 7 수집 시각 접속 AP 화상회의 참여 단말 수 2022-10-01 10:15:00 AP#1 3 2022-10-01 10:15:00 AP#2 0 도 3은 한 실시예에 따른 무선랜 환경에서의 화상회의 품질 예측 방법의 흐름도이다. 도 3을 참고하면, 화상회의 품질 관리 장치는 AP별 상태 정보를 수집한다(S210). 화상회의 품질 관리 장치 는 AP를 관리하는 무선랜 컨트롤러를 통해 AP별 상태 정보를 획득하거나, AP들을 비롯한 네트워크 장치를 통합 관리하는 관리 장치(예를 들면, EMS)로부터 AP별 상태 정보를 획득할 수 있다. AP 상태 정보는 화상회의 품질을 예측하도록 훈련된 인공지능 모델의 입력 정보에 대응하도록 수집될 수 있다. 예를 들면, AP 상태 정보는 링크 트래픽율, 간섭율, 채널사용율, 접속 단말 수로 구성될 수 있고, 화상회의 참여 단말 수를 더 포함 할 수 있다. 화상회의 품질 관리 장치는 화상회의 어플리케이션을 실행한 단말들이 접속한 AP 정보를 관리한다(S220). 한 실시예에 따르면, 화상회의 품질 관리 장치는 표 5와 같이, AP별로 접속한 단말 IP 정보를 관리할 수 있는데, 무선랜 컨트롤러로부터 각 AP에 접속한 단말 IP 정보를 획득하거나, AP로부터 접속한 단말 IP 정보를 획득하거나, 또는 EMS로부터 각 AP에 접속한 단말 IP 정보를 획득할 수 있다. 그리고, 화상회의 품질 관리 장치 는 단말들에 설치된 화상회의 품질 관리 어플리케이션을 통해, 화상회의 어플리케이션이 실행된 단말 IP 정보를 획득함으로써, 화상회의 어플리케이션이 실행된 단말이 어느 AP에 접속한 것인지 식별할 수 있다. 다른 실시예에 따르면, 화상회의 품질 관리 장치는 단말들에 설치된 화상회의 품질 관리 어플리케이션을 통해, 화상회의 어플리케이션이 실행된 단말 IP 정보 그리고 접속한 AP 정보를 획득할 수 있다. 화상회의 품질 관리 장치는 훈련된 인공지능 모델을 이용하여, 수집한 AP별 상태 정보에 대해 AP별 화상회의 품질 정보를 예측한다(S230). 인공지능 모델은 훈련 데이터를 기초로, AP의 링크 트래픽율, 간섭 율, 채널사용율, 접속 단말 수 등으로 정의된 AP 상태 정보와, 해당 AP를 통해 전송되는 화상회의 품질의 관계 를 학습한 모델이다. 화상회의 품질 관리 장치는 화상회의 품질 정보가 기준 이하로 예측된 AP를 탐지하고, 탐지한 AP에 접속해 서 화상회의 어플리케이션을 실행 중인 단말에게 화상회의 품질 정보를 제공한다(S240). 화상회의 품질 정보는 단말에 설치된 화상회의 품질 관리 어플리케이션을 통해, 제공될 수 있다. 품질 관리 어플리케이션은 화면에 화 상회의 품질을 표시하여, 사용자가 AP에 의한 품질 영향을 알고 조치(예를 들면, 파일 업로드/다운로드를 하지 않음)하도록 할 수 있다. 화상회의 품질에 대한 알람은 다양하게 표시될 수 있는데, 예를 들면, 팝업 등의 방식 으로 제공될 수 있다. 이때, 접속된 AP 명칭, 알람 발생시점, 화상회의 품질 저하 원인(예를 들면, 트래픽 사용 율, AP 접속자수 등), 불필요한 다운로드/업로드에 대한 자제 요청 내용 등을 제공할 수 있다. 화상회의 품질 관리 장치는 화상회의 품질 정보가 기준 이하로 예측된 AP, 그리고 탐지 시점(예를 들면, 요일 및 시간대)을 각 AP의 품질 히스토리에 저장한다(S250). 화상회의 품질 관리 장치는 AP별 품질 저하 예측 빈도를 통계적으로 관리하고, 화상회의 품질 관리 어플리케이션을 통해 각 AP의 품질 히스토리에 기반한 화상회의 품질 정보를 제공할 수 있다. 도 4는 한 실시예에 따른 무선랜 환경에서의 화상회의 품질 제공 방법의 흐름도이다. 도 4를 참고하면, 단말은 화상회의 품질 관리 어플리케이션을 실행한다(S310). 단말은 현재 접속한 AP에서 화상회의 품질 저하가 예상되는 시간 정보를 화면에 표시한다(S320). 단말 은 요일별, 시간대별로 해당 AP의 화상회의 품질을 알 수 있는 정보를 표시할 수 있다. 화상회의 품질을 알 수 있는 정보는 화상회의 품질 저하 빈도이거나, 화상회의 품질을 나타내는 컬러(예를 들면, 품질 정상이면 녹색, 품질 저하이면 빨강) 등일 수 있다. 이를 통해, 사용자는 화상회의 품질 저하가 예상되는 시간(예를 들면, 월요일, 수요일, 목요일 10시)을 피해서 화상회의를 예약할 수 있다. 단말은 접속한 AP에서 예측되 는 현재 화상회의 품질(예를 들면, 품질 정상)을 표시할 수 있다. 단말은 화상회의 예약 화면에서, 접속 가능한 AP별로 예측된 현재 화상회의 품질, 또는 시간에 따른 화상 회의 품질 정보를 제공한다(S330). 접속 가능한 AP는 근처의 AP일 수 있고, 동일 주체에 의해 관리되는 AP들(예 를 들면, 기업 건물에 설치된 AP들)일 수 있다. 이후, 단말이 특정 AP에 접속한 상태에서, 화상회의 어플리케이션이 실행되면, 화상회의 품질 관리 장치 로 단말에서의 화상회의 어플리케이션 실행을 보고한다(S340). 보고 정보는 화상회의 어플리케이션의 종류, 단말 IP 정보 그리고 접속한 특정 AP 정보를 포함할 수 있다. 단말은 화상회의 품질 관리 장치로부터 화상회의 품질 정보를 수신하고, 화상회의 품질 저하에 대한 알람을 표시한다(S350). 이와 같이, 본 개시에 따르면, 실시간으로 RTP 패킷을 추출하여 패킷 손실율을 분석하지 않아도, AP 상태 정보 만으로 화상회의 품질 저하를 빠르고 정확히 예측할 수 있다. 본 개시에 따르면, 사용자는 AP에 의한 화상회의 품질 영향을 미리 고려하여 화상회의 일정을 결정할 수 있고, 화상회의 중에 AP에 의한 품질 저하가 예측되는 경우, 불필요한 트래픽 발생을 피하는 등의 조치를 취할 수 있 다. 본 개시에 따르면, 화상회의 품질 저하 원인이 AP인지 알 수 있어서, 사용자는 AP별 품질 저하 예측 빈도를 통 해 품질 저하 예측 빈도가 높은 AP 주변에 AP를 증설하는 등의 AP 운용 계획을 수립할 수 있어서, 불필요하고 비효율적인 네트워크 증설을 줄일 수 있다. 이상에서 설명한 본 개시의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 개시의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 개시의 실시예에 대하여 상세하게 설명하였지만 본 개시의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 개시의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 개시의 권리범위에 속하는 것이다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2023-0015015", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 화상회의 품질 관리 시스템의 구성도이다. 도 2는 한 실시예에 따른 화상회의 품질 예측을 위한 인공지능 모델의 훈련 방법을 나타내는 흐름도이다. 도 3은 한 실시예에 따른 무선랜 환경에서의 화상회의 품질 예측 방법의 흐름도이다 도 4는 한 실시예에 따른 무선랜 환경에서의 화상회의 품질 제공 방법의 흐름도이다."}
