{"patent_id": "10-2019-0137417", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0051751", "출원번호": "10-2019-0137417", "발명의 명칭": "능동 도로소음 제어 방법 및 장치", "출원인": "현대모비스 주식회사", "발명자": "장세영"}}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "V2X 통신을 이용하여 수신한 주변차량 소음정보 및 도로환경 소음정보로부터 도로 소음을 예측하는 단계;예측하여 도출된 상기 예측된 도로소음에 대해 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성하는 단계;소음측정부를 이용하여 주행도로 소음을 측정하는 단계;상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정도를 판단하는 단계;상기 정합 정도가 특정 임계치 이상이면 상기 예측소음 제어신호를 차량 내 스피커를 통해 출력하는 단계; 및상기 정합 정도가 상기 특정 임계치 미만이면 측정된 상기 주행도로 소음에 대해 상기 능동도로 소음제어 알고리즘을 적용하여 실측소음 제어신호를 생성하고 생성된 상기 실측소음 제어신호를 상기 스피커를 통해 출력하는단계를 포함하는 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 주변차량 소음정보는 전후방에 존재하는 차량으로부터의 소음정보 및 근접해오는 긴급차량으로부터의 경보소리정보 중 적어도 하나를 포함하는, 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 도로환경 소음정보는 상기 주행도로 상의 설치 시설로부터 유발되는 소음진동 정보, 상기 주행도로의 종류정보, 및 상기 주행도로에 대한 공사에 의해 유발되는 소음진동정보 중 적어도 하나를 포함하는, 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 예측소음 제어신호는 상기 예측된 도로소음을 상쇄하기 위한 신호이고, 상기 실측소음 제어신호는 상기 주행도로 소음을 상쇄하기 위한 신호인, 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 능동도로 소음제어 알고리즘은 FxLMS(Filtered-x Least Mean Square)인, 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 예측된 도로소음은 빅데이터 분석 및 인공지능 분석 중 적어도 하나를 이용해 생성되는, 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 정합 정도를 판단하는 단계는 상관함수를 이용하여 판단하는, 능동도로 소음제어 방법.공개특허 10-2021-0051751-3-청구항 8 V2X 통신을 이용하여 수신한 주변차량 소음정보 및 도로환경 소음정보에 기초하여 예측된 도로소음에 대해 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성하는 단계;소음측정부를 이용하여 측정된 주행도로 소음과 상기 예측된 도로소음 간의 정합 정도를 판단하는 단계;상기 정합 정도가 특정 임계치 이상이면 상기 예측소음 제어신호를 차량 내 스피커를 통해 출력하고 상기 정합정도가 상기 특정 임계치 미만이면 측정된 상기 주행도로 소음에 대해 상기 능동도로 소음제어 알고리즘을 적용하여 생성한 실측소음 제어신호를 상기 스피커를 통해 출력하는 단계;차내 잔여 소음을 측정하는 단계; 및측정된 상기 차내 잔여 소음을 상기 능동도로 소음제어 알고리즘에 적용하여 생성한 잔여소음 제어신호를 상기스피커를 통해 출력하는 단계를 포함하는 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 주변차량 소음정보는 전후방에 존재하는 차량으로부터의 소음정보 및 근접해오는 응급차량으로부터의 경보소리정보 중 적어도 하나를 포함하고,상기 도로환경 소음정보는 상기 주행도로 상의 설치 시설로부터 유발되는 소음진동 정보, 상기 주행도로의 종류정보, 및 상기 주행도로의 공사에 의해 유발되는 소음진동정보 중 적어도 하나를 포함하는, 능동도로 소음제어방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서, 상기 예측소음 제어신호는 상기 예측된 도로소음을 상쇄하기 위한 신호이고, 상기 실측소음 제어신호는 상기 주행도로 소음을 상쇄하기 위한 신호이고, 상기 잔여소음 제어신호는 상기 차내 잔여 소음을 상쇄하기 위한 신호인, 능동도로 소음제어 방법."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "주변차량으로부터의 주변차량 소음정보 및 기지국으로부터의 주행도로 환경 소음정보를 V2X통신을 이용하여 수신하는 통신부;상기 주변차량 소음정보 및 도로환경 소음정보로부터 도로소음을 예측하는 도로소음 예측부;주행도로 소음을 측정하는 도로소음 측정부;예측된 상기 도로소음에 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성하거나 상기 주행도로 소음에 상기 능동도로 소음제어 알고리즘을 적용하여 실측소음 제어신호를 생성하는 소음제어 신호 생성부;상기 예측된 도로소음과 상기 주행도로 소음 간의 정합 정도를 판단하는 정합판단부;상기 정합판단부에서의 상기 예측된 도로소음과 상기 주행도로 소음 간의 정합 정도에 대한 판단에 기초하여 상기 소음제어 신호 생성부를 통해 전달받은 상기 예측소음 제어신호를 출력하도록 하거나 상기 실측소음 제어신호를 출력하도록 하는 능동소음 제어부; 및상기 예측소음 제어신호 및 상기 실측소음 제어신호 중 적어도 하나를 출력하는 스피커를 포함하는 능동도로 소음제어 장치."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 능동소음 제어부는 상시 정합판단부에서의 상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정도가특정 임계치 이상이면 상기 예측소음 제어신호를 출력하도록 하고, 상기 정합 정도가 상기 특정 임계치 미만이면 상기 소음제어 신호 생성부에게 상기 실측소음 제어신호를 생성하게 하여 생성된 상기 실측소음 제어신호를공개특허 10-2021-0051751-4-전달받아 출력하도록 하는, 능동도로 소음제어 장치."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,차내 잔여 소음을 측정하는 차내소음 측정부를 더 포함하는 능동도로 소음제어 장치."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 소음제어 신호 생성부는 상기 차내소음 측정부에서 측정된 차내 잔여 소음에 상기 능동도로 소음제어 알고리즘을 적용하여 잔여소음 제어신호를 더 생성하는, 능동도로 소음제어 장치."}
{"patent_id": "10-2019-0137417", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 정합판단부는 상관함수를 이용하여 상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정도를판단하는, 능동도로 소음제어 장치."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "주행도로로부터의 소음을 제거하기 위한 능동도로 소음제어 방법이 개시된다. 본 발명에 따른 능동도로 소음제어 방법은 V2X 통신을 이용하여 수신한 주변차량 소음정보 및 도로환경 소음정보로부터 도로소음을 예측하는 단계, 상기 예측된 도로소음에 대해 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성하는 단계, 소음 측정부를 이용하여 주행도로 소음을 측정하는 단계, 상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정도 를 판단하는 단계, 상기 정합 정도가 특정 임계치 이상이면 상기 예측소음 제어신호를 차량 내 스피커를 통해 출 력하는 단계 및 상기 정합 정도가 상기 특정 임계치 미만이면 측정된 상기 주행도로 소음에 대해 상기 능동도로 소음제어 알고리즘을 적용하여 실측소음 제어신호를 생성하고 생성된 상기 실측소음 제어신호를 상기 스피커를 통해 출력하는 단계를 포함한다."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소음 제어 방법 및 장치에 관한 것으로, 상세하게는 차량 주행시 도로로부터의 소음을 제거하는 능동 도로소음 제어 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "쾌적한 차량 이용 경험을 운전자 및 탑승자에게 제공하기 위한 여러 방안들에 대한 연구가 활발하다. 그 중에서 도 정숙한 차량 운행을 위한 차량 내외부 발생 소음 차단 및 제거에 대해서도 많은 논의가 되고 있다. 이와 관 련하여 차량 주행시 발생하는 주행 소음을 저감하기 위해 종래에는 각종 흡차음제 부착 및 저소음 타이어 장착 과 같은 방법이 이용되었다. 이러한 방법의 경우 비용 증대의 문제뿐만이 아니라 차량 중량 증가로 인한 주행 연비 저하의 문제점이 있어 능동 소음 제거(ANC: active noise cancelling) 기법을 이용하여 차량 주행시의 소 음을 제거하는 방법이 개발 및 적용되고 있다. 그러나 종래 기술에 따른 능동 소음 제거 기법의 경우 소음원인 입력 신호의 분석 및 이를 제거하기 위한 알고 리즘 계산으로 인해 입력 신호가 차량에 입력된 시점과 해당 입력 신호에 대한 능동 소음 제거 알고리즘이 적용 된 입력신호의 출력 시점 간의 시간차가 길기 때문에 주행 환경이 급속도로 변하는 경우에는 운전자에게 최적의 주행 소음 제거 서비스를 제공할 수 없고, 또한 순간적인 큰 소음에 대해서도 신속하고 안정적인 주행 소음 제 거 서비스를 제공할 수 없는 문제가 있다."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은, V2X 통신을 이용해서 획득한 다양한 주변 차량 정보, 도로 환경 변화 정보 및 도로 인프라 정보에 기초해서 도로 주행시 발생 가능한 소음을 예측하여 실시간으로 제 어하기 위한 능동도로 소음 제어 방법 및 장치를 제공하는 데 있다."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 능동도로 소음 제어 방법은 V2X 통신을 이용하여 수신 한 주변차량 소음정보 및 도로환경 소음정보로부터 도로소음을 예측하는 단계, 상기 예측된 도로소음에 대해 능 동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성하는 단계, 소음측정부를 이용하여 주행도로 소 음을 측정하는 단계, 상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정도를 판단하는 단계, 상기 정합 정도가 특정 임계치 이상이면 상기 예측소음 제어신호를 차량 내 스피커를 통해 출력하는 단계 및 상기 정합 정도가 상기 특정 임계치 미만이면 측정된 상기 주행도로 소음에 대해 상기 능동도로 소음제어 알고리즘을 적용하 여 실측소음 제어신호를 생성하고 생성된 상기 실측소음 제어신호를 상기 스피커를 통해 출력하는 단계를 포함 한다. 또한, 상기 주변차량 소음정보는 전후방에 존재하는 차량으로부터의 소음정보 및 근접해오는 긴급차량으로부터 의 경보 소리정보 중 적어도 하나를 포함한다. 또한, 상기 도로환경 소음정보는 상기 주행도로 상의 설치 시설로부터 유발되는 소음진동 정보, 상기 주행도로 의 종류정보, 및 상기 주행도로에 대한 공사에 의해 유발되는 소음진동정보 중 적어도 하나를 포함한다. 또한, 상기 예측소음 제어신호는 상기 예측된 도로소음을 상쇄하기 위한 신호이고, 상기 실측소음 제어신호는 상기 주행도로 소음을 상쇄하기 위한 신호이다. 또한, 상기 능동도로 소음제어 알고리즘은 FxLMS(Filtered-x Least Mean Square)이다. 또한, 상기 예측된 도로소음은 빅데이터 분석 및 인공지능 분석 중 적어도 하나를 이용해 생성된다. 또한, 상기 정합 정도를 판단하는 단계는 상관함수를 이용하여 판단한다. 본 발명의 다른 실시예에 따른 능동도로 소음 제어 방법은 V2X 통신을 이용하여 수신한 주변차량 소음정보 및 도로환경 소음정보에 기초하여 예측된 도로소음에 대해 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어 신호를 생성하는 단계, 소음측정부를 이용하여 측정된 주행도로 소음과 상기 예측된 도로소음 간의 정합 정도를 판단하는 단계, 상기 정합 정도가 특정 임계치 이상이면 상기 예측소음 제어신호를 차량 내 스피커를 통해 출력 하고 상기 정합 정도가 상기 특정 임계치 미만이면 측정된 상기 주행도로 소음에 대해 상기 능동도로 소음제어 알고리즘을 적용하여 생성한 실측소음 제어신호를 상기 스피커를 통해 출력하는 단계, 차내 잔여 소음을 측정하 는 단계 및 측정된 상기 차내 잔여 소음을 상기 능동도로 소음제어 알고리즘에 적용하여 생성한 잔여소음 제어 신호를 상기 스피커를 통해 출력하는 단계를 포함한다. 또한, 상기 주변차량 소음정보는 전후방에 존재하는 차량으로부터의 소음정보 및 근접해오는 응급차량으로부터 의 경보 소리정보 중 적어도 하나를 포함하고, 상기 도로환경 소음정보는 상기 주행도로 상의 설치 시설로부터 유발되는 소음진동 정보, 상기 주행도로의 종류정보, 및 상기 주행도로의 공사에 의해 유발되는 소음진동정보 중 적어도 하나를 포함한다. 또한, 상기 예측소음 제어신호는 상기 예측된 도로소음을 상쇄하기 위한 신호이고, 상기 실측소음 제어신호는 상기 주행도로 소음을 상쇄하기 위한 신호이고, 상기 잔여소음 제어신호는 상기 차내 잔여 소음을 상쇄하기 위 한 신호이다. 본 발명의 일 실시예에 따른 능동도로 소음 제어 장치는 주변차량으로부터의 주변차량 소음정보 및 기지국으로 부터의 주행도로 환경 소음정보를 V2X통신을 이용하여 수신하는 통신부, 상기 주변차량 소음정보 및 도로환경 소음정보로부터 도로소음을 예측하는 도로소음 예측부, 주행도로 소음을 측정하는 도로소음 측정부, 상기 예측 된 도로소음에 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성하거나 상기 주행도로 소음에 상기 능동도로 소음제어 알고리즘을 적용하여 실측소음 제어신호를 생성하는 소음제어 신호 생성부, 상기 예측 된 도로소음과 상기 주행도로 소음 간의 정합 정도를 판단하는 정합판단부, 상기 정합판단부에서의 상기 예측된 도로소음과 상기 주행도로 소음 간의 정합 정도에 대한 판단에 기초하여 상기 소음제어 신호 생성부를 통해 전 달받은 상기 예측소음 제어신호를 출력하도록 하거나 상기 실측소음 제어신호를 출력하도록 하는 능동소음 제어 부, 및 상기 예측소음 제어신호 및 상기 실측소음 제어신호 중 적어도 하나를 출력하는 스피커를 포함한다. 또한, 상기 능동소음 제어부는 상시 정합판단부에서의 상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정 도가 특정 임계치 이상이면 상기 예측소음 제어신호를 출력하도록 하고, 상기 정합 정도가 상기 특정 임계치 미 만이면 상기 소음제어 신호 생성부에게 상기 실측소음 제어신호를 생성하게 하여 생성된 상기 실측소음 제어신 호를 전달받아 출력하도록 한다. 본 발명의 일 실시예에 따른 능동도로 소음 제어 장치는 차내 잔여 소음을 측정하는 차내소음 측정부를 더 포함 한다. 또한, 상기 소음제어 신호 생성부는 상기 차내소음 측정부에서 측정된 차내 잔여 소음에 상기 능동도로 소음제 어 알고리즘을 적용하여 잔여소음 제어신호를 더 생성한다. 또한, 상기 정합판단부는 상관함수를 이용하여 상기 예측된 도로소음과 상기 주행도로 소음간의 정합 정도를 판 단한다."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, V2X 통신을 이용해서 획득한 다양한 주변 차량 정보, 도로 환경 변화 정보 및 도로 인프라 정보에 기초해서 도로 주행시 발생되는 다양한 소음에 대해 신속히 예측 및 파악하여 실시간으로 해당 소음을 제어할 수 있어 차량 이용자에게 쾌적한 운전 환경을 제공할 수 있다."}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 몇몇 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 권리범위는 실시예들로부터 관념되는 본 발명의 기술적 사상에 속하는 모든 변경, 변형, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의 해 한정되어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된 다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급 된 때에만, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 본 출원에서 사용한 용어는 단지 제시되는 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 기술적이거나 과학적인 용어를 포함해서 본 명세서에서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있으며, 이상적이거나 과도 하게 축소된 형식적인 의미로 해석되지 않아야 할 것이며, 본 명세서에서 어떤 용어의 의미를 정의할 경우 해 용어는 그 정의된 대로 해석되어야 한다. 이하, 첨부한 도면들을 참조하여, 본 발명의 바람직한 실시예를 보다 상세하게 설명하고자 한다. 본 발명을 설 명함에 있어 전체적인 이해를 용이하게 하기 위하여 도면상의 동일한 구성요소에 대해서는 동일한 참조부호를 사용하고 동일한 구성요소에 대해서 중복된 설명은 생략한다. 도 1은 본 발명의 일 실시예에 따른 능동도로 소음제어 장치를 설명하는 구조도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 능동도로 소음제어 장치는 V2X 통신을 수행하는 통신부 , 주행도로로부터의 소음을 측정하는 도로소음 측정부, 측정된 도로소음을 이용하여 도로소음을 예측 하는 도로소음 예측부 , 예측된 도로소음에 대해 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신 호 및/또는 주행도로에 대한 실측 도로소음에 대해 능동도로 소음제어 알고리즘을 적용하여 실측소음 제어신호를 생성하는 소음 제어신호 생성부, 예측된 도로소음과 도로소음 측정부으로부터 전달된 실측 도로소 음과의 정합여부를 판단하는 정합판단부, 정합판단부의 정합판단 결과에 기초하여 예측소음 제어신호 또는 실측소음 제어신호를 출력하도록 결정하는 능동소음 제어부, 예측소음 제어신호 또는 실측소음 제어 신호를 출력하는 스피커를 포함한다. 또한 본 발명의 일 실시예에 따른 능동도로 소음제어 장치는 차 내 잔여소음을 측정하는 차내소음 측정부을 더 포함할 수 있다. 도 1에 도시된 본 발명의 일 실시예에 따른 능동도로 소음제어 장치는 통신부에서 V2X 통신 방식으로 수신된 주변차량 소음정보 및 주행중인 도로의 도로 환경에 대한 소음정보 등에 기초하여 도로소음 예측부(14 0)에서 예측된 도로소음과 도로소음 측정부에 의해 실제 도로로부터 획득된 실측 도로소음 간의 정합 정도 를 정합 판단부에서 판단하고, 그 판단결과에 대해 능동소음 제어부가 양 소음 간 정합 정도가 특정 임계치 이상이면 예측된 도로소음에 능동도로 소음제어 알고리즘을 적용하여 소음제어 신호 생성부에서 생 성한 예측소음 제어신호를 차량 내 스피커를 통해 출력하고, 양 소음간 정합 정도가 특정 임계치 미만이면 소음 제어 신호 생성부에서 실측 도로소음에 능동도로 소음제어 알고리즘을 적용하여 생성한 실측소음 제어신호 를 차량 내 스피커를 통해 출력하도록 하는 것을 요지로 한다. 다음으로 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 각 구성요소에 대해 상세히 설명한다(한 편 이하의 본 발명의 실시예들에서의 소음은 소리 및 진동으로 인해 유발되는 모든 소음을 포함한다). 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 통신부는 V2X(vehicle to everything) 통신 을 이용하여 주변 차량의 소음정보를 해당 주변 차량으로부터 전달받거나(이 경우는 V2V(vehicle to vehicle)을 이용) 주행도로 상의 고정 시설이나 임시 시설로부터 주변도로 환경에서 발생하는 소음이나 도로 공사로 인한 소음에 대한 정보(이를 도로환경 소음정보라 칭함)를 해당 시설로부터 전달받는다(이 경우는 V2I(vehicle to infrastructure)를 이용). 주변 차량의 소음정보는 도 2에 도시된 바와 같이 본 발명에 따른 능동도로 소음제어 장치가 탑재된 차량 의 전후좌우 등 주변에 위치한 차량으로부터의 소음정보나, 구급차, 견인차나 경찰차와 같이 차량의 전후 방이나 측면으로부터 다가오는 긴급차량으로부터의 소음정보를 포함한다. 도로환경 소음정보는 주행 중인 도로로부터 일정 거리 내의 도로나 도로주변 시설물로부터의 소음 정보(일례로 시멘트 도로와 같은 도로 종류에 대한 정보와 주변의 시위나 공사 정보 등)나 도로 공사 등에 의한 임시 시설물로부터의 소음정보를 포함한다. 도로환경 소음정보는 해당 시설물 주변이나 차량 주변의 V2X 지원 기지국으로부터 전달된다. 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 도로소음 예측부는 통신부로부터 주변차 량 소음정보 및/또는 도로환경 소음정보를 전달받아 도로소음을 예측한다. 도로소음의 예측은 빅데이터 분석이 나 인공지능 분석 기법을 이용하여 각종 소음유발 형태에 따라 도로소음을 예측할 수 있다. 또는 주변 차량이나 주변 시설물이 직접 소음의 형태를 지정하여 전달하거나 해당 소음을 V2X 통신을 이용하여 차량의 통신부 를 통해 도로소음 예측부에 직접 전달되도록 할 수 있다. 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 소음제어 신호 생성부는 본 발명의 일 실시예 에 따른 능동도로 소음제어 알고리즘을 이용하여 예측소음 제어신호를 생성한다. 능동도로 소음제어 알고리즘을 수행하는 소음제어 신호 생성부는 도 3에 도시된 바와 같은 능동소음 제어를 위한 구조를 가질 수 있다. 도 3을 참조하면, 마이크나 가속도 센서와 같은 소음센싱부로부터 주변소음에 대한 소음정보(진동포함)를 전달받은 소음분석 제어부는 해당 소음에 대한 크기 및 주파수를 분석하고 위상을 파악하여 전달받은 소음 정보를 상쇄하기 위한 역위상 신호를 생성하고, 그 생성된 역위상 신호를 사운드 믹싱부에서 소음제거가 되기를 원하는 음원신호(일례로 AVN으로부터의 음원신호)와 결합하여 주변소음이 제거된 합성신호를 생성 하여 스피커를 통해 출력하는 방식으로 주변소음을 제거하는 바, 본 발명의 일 실시예에 따른 능동도로 소 음제어 장치의 소음제어 신호 생성부도 도로소음 예측부로부터 전달된 예측된 도로소음에 대한 크기, 주파수, 및 위상을 분석하여 이를 상쇄하기 위한 역위상 신호에 해당하는 예측소음 제어신호를 생성할 수 있다. 구체적으로는 FxLMS(filtered-x least mean square) 방식을 이용하여 역위상 신호를 생성할 수 있다. 한편, 소음제어 신호 생성부에서는 소음 발생원과의 거리를 고려하여 소음 감쇠량을 반영한 예측소음 제어 신호를 생성할 수 있다. 또한 소음제어 신호 생성부에서는 후술할 도로소음 측정부로부터의 실측 도 로소음과 차내소음 측정부으로부터의 차내 잔여소음을 상쇄하기 위한 실측소음 제어신호와 잔여소음 제어 신호를 생성할 수 있다.본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 도로소음 측정부는 마이크나 가속도 센서에 해당하는 것으로서 실제 주행 중인 도로로부터의 소음(진동포함) 정보를 측정한다. 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 정합 판단부는 예측된 도로소음과 측정 도로 소음간의 정합 정도를 판단한다. 양 소음 간의 정합정도는 [수학식1]에 나타내어진 상관함수를 이용하여 판단할 수 있다. 수학식 1"}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정합 판단부는 양 소음에 대한 상관함수 출력값을 도출하여 양 소음에 대한 정합 정도에 대한 판단값을 후 술할 능동소음 제어부에 전달한다. 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 능동소음 제어부에서는 정합 판단부로부 터 전달받은 예측된 도로소음과 측정 도로소음 간의 정합 정도에 대한 판단값에 기초하여 예측소음 제어신호 또 는 실측소음 제어신호 중 어느 것을 출력할 지를 결정한다. 즉, 예측된 도로소음과 측정 도로소음 간의 정합 정 도에 대한 판단값이 특정 임계치(기준치라고도 칭함) 이상이면 양 소음 간의 정합성이 높다 판단하여 예측소음 제어신호를 출력할 것을 결정하고, 특정 임계치 미만이면 양 소음 간의 정합성이 낮다 판단하여 실측소음 제어 신호를 출력할 것을 결정한다. 한편, 능동소음 제어부과 소음제어 신호 생성부를 구별하여 설명하였 으나 양자를 하나의 모듈로 통합하여 기능을 수행하도록 구현될 수 있다. 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 차내소음 측정부는 차량 실내 소음을 측정한 다. 본 발명에 따른 능동도로 소음제어를 수행한 후에도 차량 실내에는 잔여소음이 남아 있을 수 있다. 그러므 로 이러한 잔여소음을 차내소음 측정부에서 측정해서 이를 소음제어 신호 생성부으로 전달하면 소음 제어 신호 생성부에서 본 발명에 따른 능동도로 소음제어 알고리즘을 적용하여 잔여소음 제어신호를 생성 하여 잔여소음을 상쇄할 수 있다. 본 발명의 일 실시예에 따른 능동도로 소음제어 장치의 스피커는 능동소음 제어부에 결정에 기 초하여 소음제어 신호 생성부으로 전달되는 예측소음 제어신호, 실측소음 제어신호, 또는 잔여소음 제어신 호를 출력한다. 도 1에 도시된 본 발명의 일 실시예에 따른 능동도로 소음제어 장치는 도 2에 도시된 바와 같은 구조로 표현될 수 있다. 즉, 주변차량, 긴급차량, 및 도로 주변 기지국으로부터 주변차량 소음정보 및/또는 도 로환경 소음정보를 V2X 통신부이 수신하고 도로소음 예측부 및 소음제어 신호 생성부를 포함하 는 ARNC 알고리즘 수행부에서 예측 알고리즘을 활용하여 도로소음을 예측하고 ARNC 알고리즘을 사용하여 예측소음 제어신호를 생성한다. 정합 판단부 및 능동소음 제어부를 포함하는 소음제어 신호출력부는 실측 도로소음과 예측된 도 로소음을 비교하여 양 소음 간 정합성 판단값이 특정 임계치보다 크면 예측소음 제어신호를 출력하여 도로소음 을 상쇄하고 정합성 판단값이 특정 임계치보다 작으면 실측소음 제어신호를 출력한다. 다음으로 전술한 능동도로 소음제어 장치를 이용한 능동도로 소음제어 방법에 대해 설명한다. 도 4는 본 발명의 일 실시예에 따른 능동도로 소음제어 방법을 설명하는 흐름도이다. 도 4에 도시된 본 발명의 일 실시예에 따른 능동도로 소음제어 방법은 도 1 내지 도 3에 도시된 본 발명의 실시 예들에 따른 능동도로 소음제어 장치를 이용한 능동도로 소음제어 방법에 대한 것이다.먼저 V2X 통신을 이용하여 주변차량 소음정보(V2V 이용) 및 도로환경 소음정보(V2I 이용)를 수신한다(S410). 주변차량 소음정보는 전술한 바와 같이 본 발명에 따른 능동도로 소음제어 장치가 탑재된 차량의 전후좌우 등 주변에 위치한 차량으로부터의 소음정보나, 구급차, 견인차나 경찰차와 같이 차량의 전후방이나 측면으 로부터 다가오는 긴급차량으로부터의 소음정보를 포함한다. 도로환경 소음정보는 주행 중인 도로로부터 일 정 거리 내의 도로나 도로주변 시설물로부터의 소음 정보나 도로 공사 등에 의한 임시 시설물로부터의 소음정보 를 포함한다. 수신한 주변차량 소음정보 및 도로환경 소음정보에 기초하여 도로소음을 예측한다(S420). 전술한 바와 같이 도 로소음의 예측은 빅데이터 분석이나 인공지능 분석 기법을 이용하여 각종 소음유발 형태에 따라 도로소음을 예 측할 수 있다. 또는 주변 차량이나 주변 시설물이 직접 소음의 형태를 지정하여 전달하거나 해당 소음을 V2X 통 신을 이용하여 차량의 통신부를 통해 도로소음 예측부에 직접 전달되도록 할 수 있다. 예측된 도로소음에 능동도로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성한다(S430). 구체적으로는 FxLMS(filtered-x least mean square) 방식을 이용해서 전달받은 예측된 도로소음에 대한 크기, 주파수, 및 위 상을 분석하여 이를 상쇄하기 위한 역위상 신호에 해당하는 예측소음 제어신호를 생성할 수 있다. 또한, 소음 발생원과의 거리를 고려하여 소음 감쇠량을 반영한 예측소음 제어신호를 생성할 수 있다. 다음으로 주행도로로부터의 소음을 측정한다(이와 같이 측정된 도로 소음을 측정 도로소음이라 칭함)(S440). 측 정 도로소음은 주행도로 노면으로부터 차량 실내로 유입되는 소음을 마이크나 가속도 센서 등을 이용하여 측정 한다. 이후 예측된 도로소음과 측정 도로소음간의 정합 정도에 대해 판단한다(S450). 양 소음간의 정합 정도에 대한 판단은 전술한 바와 같이 상관함수를 이용해 판단할 수 있다. 예측된 도로소음과 측정 도로소음 간의 정합 정도를 판단한 결과 특정 임계치 이상으로 양 소음간 정합 관계가 있는 것으로 판단되면(S460의 예) 예측소음 제어신호를 차량 내 스피커를 통해 출력한다(S470). 반면에, 예측된 도로소음과 측정 도로소음간의 정합 정도를 판단한 결과 특정 임계치 미만으로 양 소음간 정합 관계가 있는 것으로 판단되면(S460의 아니요) 측정 도로소음에 능동도로 소음제어 알고리즘을 적용하여 실측소 음 제어신호를 생성하고(S480), 생성된 실측소음 제어신호를 차량 내 스피커를 통해 출력한다(S490). 한편, 실 측소음 제어신호는 주행도로 소음 측정 후 즉시(또는 일정 시간 내) 생성되도록 구현될 수 있다. 이를 통해 더 욱 신속히 실측소음 제어신호를 출력하도록 구현될 수 있다. 다음으로 능동도로 소음제어 장치를 이용하여 차량 내 잔여소음을 제거하는 능동도로 소음제어 방법에 대해 설 명한다. 도 5는 본 발명의 다른 실시예에 따른 능동도로 소음제어 방법을 설명하는 흐름도이다. 도 5에 도시된 본 발명의 일 실시예에 따른 능동도로 소음제어 방법은 도 1 내지 도 3에 도시된 본 발명의 실시 예들에 따른 능동도로 소음제어 장치를 이용해서 주행도로로부터의 소음뿐만이 아니라 차량 내 잔여소음을 제거 하는 능동도로 소음제어 방법에 대한 것이다. 먼저 V2X 통신을 이용하여 주변차량 소음정보(V2V 이용) 및 도로환경 소음정보(V2I 이용)를 수신하고(S510), 그 수신한 주변차량 소음정보 및 도로환경 소음정보에 기초하여 도로소음을 예측하고 예측된 도로소음에 능동도 로 소음제어 알고리즘을 적용하여 예측소음 제어신호를 생성한다(S520). 다음으로 주행도로로부터의 소음을 측정(S530)하고 이와 예측된 도로소음 간의 정합 정도에 대해 판단한다 (S540). 양 소음간의 정합 정도에 대한 판단은 전술한 바와 같이 상관함수를 이용해 판단할 수 있다. 예측된 도로소음과 주행도로로부터 측정된 소음인 측정 도로소음 간의 정합 정도를 판단한 결과 특정 임계치 이 상으로 양 소음간 정합 관계가 있는 것으로 판단되면(S550의 예) 예측소음 제어신호를 차량 내 스피커를 통해 출력한다(S560). 반면에, 예측된 도로소음과 측정 도로소음간의 정합 정도를 판단한 결과 특정 임계치 미만으로 양 소음간 정합 관계가 있는 것으로 판단되면(S550의 아니요) 측정 도로소음에 능동도로 소음제어 알고리즘을 적용하여 실측소음 제어신호를 생성하고(S590), 생성된 실측소음 제어신호를 차량 내 스피커를 통해 출력한다 (S595)(실측소음 제어신호는 주행도로 소음 측정 후 즉시(또는 일정 시간 내) 생성되도록 구현될 수 있으며 이 를 통해 더욱 신속히 실측소음 제어신호를 출력하도록 구현될 수 있음). 이후 차내 잔여소음을 측정한다(S570). 차내 잔여소음은 운전석 및/또는 차량 내 다른 좌석의 헤드 부근에 설치 되는 마이크 및/또는 가속도 센서 등일 수 있으나 설치되는 위치나 설치 부품은 이에 한정되지 않는다. 차내 잔여소음이 측정되면 이를 능동도로 소음제어 알고리즘에 적용하여 차내 잔여소음을 상쇄하기 위한 잔여소 음 제어신호를 출력한다(S580). 한편, 전술한 각 구성은 각각이 별도의 장치로 설명되었으나, 이는 설명의 편의와 이해의 증진을 위한 예시적 설명에 불과한 것으로서, 본 발명의 기술적 사상의 범주 내에서 다양한 형태로 구현될 수 있음은 물론이다. 예 컨대, 정합판단부 및 능동소음 제어부는 하나의 모듈로 통합되어 구현될 수도 있고, 또는 둘이나 그 이상의 장치로 분할하여 구현될 수 있다. 본 발명에 따른 방법들은 다양한 컴퓨터 수단을 통해 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독 으로 또는 조합하여 포함할 수 있다. 컴퓨터 판독 가능 매체에 기록되는 프로그램 명령은 본 발명을 위해 특별 히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 판독 가능 매체의 예에는 롬(rom), 램(ram), 플래시 메모리(flash memory) 등과 같이 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러(compiler)에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터(interpreter) 등을 사용해서 컴퓨터에 의해 실 행될 수 있는 고급 언어 코드를 포함한다. 상술한 하드웨어 장치는 본 발명의 동작을 수행하기 위해 적어도 하 나의 소프트웨어 모듈로 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 컴퓨터 판독 가능 매체에 기록된 본 발명에 따른 실시예들은 컴퓨터 시스템에 적용될 수 있다. 상기 컴퓨터 시 스템은 하나 이상의 프로세서, 메모리, 사용자 입력 장치, 사용자 출력 장치 및 저장수단을 포함하며, 이들 각 각은 버스를 통해 통신한다. 또한 상기 컴퓨터 시스템은 네트워크에 연결된 네트워크 인터페이스를 포함할 수 있다. 상기 프로세서는 메모리 및/또는 저장 유닛에 저장된 처리 명령어를 실행하는 중앙 처리 유닛 또는 반도 체 장치일 수 있다. 상기 메모리 및 상기 저장 유닛은 휘발성 저장 매체 또는 비 휘발성 저장 매체를 포함할 수 있다. 예컨대, 상기 메모리는 ROM 및 RAM을 포함할 수 있다. 따라서, 본 발명의 실시예들은 컴퓨터로 구현하는 방법 또는 상기 컴퓨터상에 저장된 컴퓨터 실행 가능 명령어를 가진 비(non)-일시적 컴퓨터 판독 가능 매체로서 구현 될 수 있다. 본 발명의 일 실시예에서, 프로세서에 의해 실행될 때, 컴퓨터 판독 가능 명령은 본 발명의 적어도 한 양태에 따른 방법을 수행 할 수 있다. 이상, 본 발명의 바람직한 실시예를 통해 본 발명의 구성에 대하여 상세히 설명하였다. 그러나 전술한 실시예는"}
{"patent_id": "10-2019-0137417", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "예시에 불과한 것으로서, 본 발명의 권리범위를 제한하지 아니한다. 본 발명의 기술분야에 통상의 지식을 가진 자라면 본 명세서의 교시와 시사로부터 본 발명의 기술적 사상의 범주내의 다양한 변형과 변경이 가능할 것이다. 따라서, 본 발명의 보호범위는 이하의 특허청구범위의 기재에 의하여 정하여짐이 마땅하다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2019-0137417", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 능동도로 소음제어 장치를 설명하는 구조도. 도 2는 본 발명의 일 실시예에 따른 능동도로 소음제어 장치를 설명하는 개념도. 도 3은 본 발명의 다른 실시예에 따른 능동도로 소음제어 장치를 설명하는 구조도. 도 4는 본 발명의 일 실시예에 따른 능동도로 소음제어 방법을 설명하는 흐름도. 도 5는 본 발명의 다른 실시예에 따른 능동도로 소음제어 방법을 설명하는 흐름도."}
