{"patent_id": "10-2022-0163970", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0166761", "출원번호": "10-2022-0163970", "발명의 명칭": "라벨 추천 모델 훈련 방법 및 장치, 라벨 획득 방법 및 장치", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "뤄, 진창"}}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "라벨 추천 모델 훈련 방법에 있어서, 수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 단계 - 상기 훈련 소재는 취미 라벨을 포함함-; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하는 훈련시멘틱 벡터를 획득하는 단계; 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 단계; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를훈련하여, 라벨 추천 모델을 획득하는 단계; 를 포함하는,것을 특징으로 하는 라벨 추천 모델 훈련 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 훈련 소재는 행위 훈련 소재 및 업무 훈련 소재를 포함하고; 상기 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 취미 라벨을 포함하는 훈련시멘틱 벡터를 획득하는 단계는,상기 시멘틱 증강 표시 프레임을 기반으로, 상기 행위 훈련 소재를 부동한 길이의 훈련 행위 벡터로 표시하고,상기 업무 훈련 소재를 고정 길이의 훈련 업무 벡터로 표시하는 단계; 상기 훈련 행위 벡터의 평균을 구한 후, 상기 훈련 업무 벡터와 융합시켜, 훈련 시멘틱 벡터를 획득하는 단계;를 포함하는,것을 특징으로 하는 라벨 추천 모델 훈련 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 단계는,소셜 네트워크를 획득하고, 소셜 네트워크 사이의 친밀값을 결정하는 단계; 상기 친밀값을 행렬의 요소의 값으로 하여, 인접 행렬을 구축하는 단계; 상기 인접 행렬에서 각 행의 상기 요소의 가중치의 합이 1인 조건 하에, 상기 요소에 가중치를 할당하는 단계 -상기 인접 행렬의 대각선 요소에 할당된 가중치는 기타 요소에 할당된 가중치보다 큼 -; 및상기 인접 행렬의 각 요소에 대응되는 훈련 시멘틱 벡터를 획득하고, 그래프 컨볼루션 네트워크를 기반으로, 상기 훈련 시멘틱 벡터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 획득하는 단계;를 포함하는,것을 특징으로 하는 라벨 추천 모델 훈련 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를공개특허 10-2022-0166761-3-훈련하여, 라벨 추천 모델을 획득하는 단계는,상기 훈련 인코딩 벡터를 포워드 네트워크의 입력으로 하고, 상기 포워드 네트워크를 훈련하여, 새로운 훈련 인코딩 벡터를 획득하는 단계; 상기 새로운 훈련 인코딩 벡터를 다시 완전 연결 네트워크의 입력으로 하고, 상기 완전 연결 네트워크를 훈련하여, 훈련 라벨 벡터를 획득하는 단계; 및상기 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨을 출력으로 하여, 라벨 추천 모델을 획득하는 단계; 를 포함하는,것을 특징으로 하는 라벨 추천 모델 훈련 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨을 출력으로 하여, 라벨 추천 모델을 획득하는 단계는,액티브 함수를 통해 상기 훈련 라벨 벡터를 해석하여, 상기 훈련 라벨 벡터에 포함된 취미 라벨을 획득하는 단계; 상기 취미 라벨에서, 상기 취미 라벨에 대응되는 제1 취미 라벨을 결정하고, 상기 취미 라벨에서 상기 제1 취미라벨이 차지하는 비율을 계산하고, 라벨 추천 모델의 확률 역치를 결정하여, 출력 라벨 확률이 상기 확률 역치보다 크거나 같은 라벨 추천 모델을 획득하는 단계; 를 포함하는,것을 특징으로 하는 라벨 추천 모델 훈련 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "라벨 획득 방법에 있어서, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 단계; 시멘틱 증강 표시 프레임을 사용하여, 상기 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획득하는 단계; 소셜 네트워크를 상기 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 단계; 및 상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 단계; 를 포함하는,것을 특징으로 하는 라벨 획득 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 단계는, 상기 인코딩 벡터를 상기 라벨 추천 모델의 포워드 네트워크로 입력하여, 새로운 인코딩 벡터를 획득하는 단계; 상기 새로운 인코딩 벡터를 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득하는 단계; 및상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력하는 단계; 를 포함하는,것을 특징으로 하는 라벨 획득 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력하는 단계는,상기 라벨 추천 모델의 액티브 함수를 기반으로, 상기 라벨 벡터를 해석하여, 복수의 라벨을 획득하는 단계; 및공개특허 10-2022-0166761-4-상기 복수의 라벨에서 나타난 확률이 확률 역치보다 크거나 같은 라벨을, 취미 라벨로 결정하는 단계; 를 포함하는,것을 특징으로 하는 라벨 획득 방법."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "라벨 추천 모델 훈련 장치에 있어서,수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 획득 모듈 - 상기 훈련 소재는 취미 라벨을 포함함 -; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하는 훈련시멘틱 벡터를 획득하고, 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 처리 모듈; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를훈련하여, 라벨 추천 모델을 획득하는 훈련 모듈; 을 포함하는,것을 특징으로 하는 라벨 추천 모델 훈련 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 훈련 소재는 행위 훈련 소재 및 업무 훈련 소재를 포함하고; 상기 처리 모듈은,상기 시멘틱 증강 표시 프레임을 기반으로, 상기 행위 훈련 소재를 부동한 길이의 훈련 행위 벡터로 표시하고,상기 업무 훈련 소재를 고정 길이의 훈련 업무 벡터로 표시하고; 상기 훈련 행위 벡터의 평균을 구한 후, 상기 훈련 업무 벡터와 융합시켜, 훈련 시멘틱 벡터를 획득하는,것을 특징으로 하는 라벨 추천 모델 훈련 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 처리 모듈은 또한,소셜 네트워크를 획득하고, 소셜 네트워크 사이의 친밀값을 결정하고; 상기 친밀값을 행렬의 요소의 값으로 하여, 인접 행렬을 구축하고; 상기 인접 행렬에서 각 행의 상기 요소의 가중치의 합이 1인 조건 하에, 상기 요소에 가중치를 할당하며, 상기인접 행렬의 대각선 요소에 할당된 가중치는 기타 요소에 할당된 가중치보다 크고; 상기 인접 행렬의 각 요소에 대응되는 훈련 시멘틱 벡터를 획득하고, 그래프 컨볼루션 네트워크를 기반으로, 상기 훈련 시멘틱 벡터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 획득하는, 것을 특징으로 하는 라벨 추천 모델 훈련 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 훈련 모듈은,상기 훈련 인코딩 벡터를 포워드 네트워크의 입력으로 하고, 상기 포워드 네트워크를 훈련하여, 새로운 훈련 인코딩 벡터를 획득하고; 상기 새로운 훈련 인코딩 벡터를 다시 완전 연결 네트워크의 입력으로 하고, 상기 완전 연결 네트워크를 훈련하여, 훈련 라벨 벡터를 획득하고; 공개특허 10-2022-0166761-5-상기 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨을 출력으로 하여, 라벨 추천 모델을 획득하는,것을 특징으로 하는 라벨 추천 모델 훈련 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 훈련 모듈은,액티브 함수를 통해 상기 훈련 라벨 벡터를 해석하여, 상기 훈련 라벨 벡터에 포함된 취미 라벨을 획득하고; 상기 취미 라벨에서, 상기 취미 라벨에 대응되는 제1 취미 라벨을 결정하고, 상기 취미 라벨에서 상기 제1 취미라벨이 차지하는 비율을 계산하고, 화상 모델의 확률 역치를 결정하여, 출력 라벨 확률이 상기 확률 역치보다크거나 같은 라벨 추천 모델을 획득하는,것을 특징으로 하는 라벨 추천 모델 훈련 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "라벨 획득 장치에 있어서,수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 획득 모듈; 시멘틱 증강 표시 프레임을 사용하여, 상기 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획득하고, 소셜 네트워크를 상기 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 처리 모듈; 및상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 예측 모듈; 을 포함하는,것을 특징으로 하는 라벨 획득 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 예측 모듈은, 상기 인코딩 벡터를 상기 라벨 추천 모델의 포워드 네트워크로 입력하여, 새로운 인코딩 벡터를 획득하고; 상기 새로운 인코딩 벡터를 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득하고; 상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력하는,것을 특징으로 하는 라벨 획득 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 예측 모듈은,상기 라벨 추천 모델의 액티브 함수를 기반으로, 상기 라벨 벡터를 해석하여, 복수의 라벨을 획득하고; 상기 복수의 라벨에서 나타난 확률이 확률 역치보다 크거나 같은 라벨을, 취미 라벨로 결정하는,것을 특징으로 하는 라벨 획득 장치."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "전자 기기에 있어서,적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리; 를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서가 제1항 내지 제5항 중 어느 한 항의공개특허 10-2022-0166761-6-방법, 또는 제6항 내지 제8항 중 어느 한 항의 상기 방법을 수행하는,것을 특징으로 하는 전자 기기."}
{"patent_id": "10-2022-0163970", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체에 있어서, 상기 컴퓨터 명령은 컴퓨터가 제1항 내지 제5항 중 어느 한 항의 방법, 또는 제6항 내지 제8항 중 어느 한 항의방법을 수행하도록 하는,것을 특징으로 하는 비일시적 컴퓨터 판독 가능 저장 매체."}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 라벨 추천 모델 훈련 방법 및 장치, 라벨 획득 방법 및 장치를 제공하고, 데이터 처리"}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에 관 한 것으로, 특히 딥러닝, 클라우드 서비스, 콘테츠 검색 등 기술 분야에 관한 것이고, 구체적인 구현 수단은, 수 신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 단계 - 상기 훈련 소재는 취미 라벨을 포함함 -; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하는 훈련 시 멘틱 벡터를 획득하는 단계; 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 단계; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 단계; 를 포함한다. 본 발명을 통해 획득된 취미 라벨은 더 정확하 다. 대 표 도 - 도1"}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "공개특허10-2022-0166761 CPC특허분류 G06F 40/205 (2020.01) G06F 40/30 (2020.01) G06N 3/0445 (2013.01) G06V 10/764 (2022.01) 발명자 뿌, 쥔쟈오 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 10, 바이두 캠퍼스 2층 천, 쿤빈 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 10, 바이두 캠퍼스 2층허, 웨이 중국, 베이징 100085, 하이뎬 디스트릭트, 샹디 1 0번가, 10, 바이두 캠퍼스 2층명 세 서 청구범위 청구항 1 라벨 추천 모델 훈련 방법에 있어서, 수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 단계 - 상기 훈련 소재는 취미 라벨을 포함함 -; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하는 훈련 시멘틱 벡터를 획득하는 단계; 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 단계; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 단계; 를 포함하는, 것을 특징으로 하는 라벨 추천 모델 훈련 방법. 청구항 2 제1항에 있어서, 상기 훈련 소재는 행위 훈련 소재 및 업무 훈련 소재를 포함하고; 상기 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 취미 라벨을 포함하는 훈련 시멘틱 벡터를 획득하는 단계는, 상기 시멘틱 증강 표시 프레임을 기반으로, 상기 행위 훈련 소재를 부동한 길이의 훈련 행위 벡터로 표시하고, 상기 업무 훈련 소재를 고정 길이의 훈련 업무 벡터로 표시하는 단계; 상기 훈련 행위 벡터의 평균을 구한 후, 상기 훈련 업무 벡터와 융합시켜, 훈련 시멘틱 벡터를 획득하는 단계; 를 포함하는, 것을 특징으로 하는 라벨 추천 모델 훈련 방법. 청구항 3 제1항에 있어서, 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 단계는, 소셜 네트워크를 획득하고, 소셜 네트워크 사이의 친밀값을 결정하는 단계; 상기 친밀값을 행렬의 요소의 값으로 하여, 인접 행렬을 구축하는 단계; 상기 인접 행렬에서 각 행의 상기 요소의 가중치의 합이 1인 조건 하에, 상기 요소에 가중치를 할당하는 단계 - 상기 인접 행렬의 대각선 요소에 할당된 가중치는 기타 요소에 할당된 가중치보다 큼 -; 및 상기 인접 행렬의 각 요소에 대응되는 훈련 시멘틱 벡터를 획득하고, 그래프 컨볼루션 네트워크를 기반으로, 상 기 훈련 시멘틱 벡터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 획득하는 단계; 를 포함하는, 것을 특징으로 하는 라벨 추천 모델 훈련 방법. 청구항 4 제1항에 있어서, 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를훈련하여, 라벨 추천 모델을 획득하는 단계는, 상기 훈련 인코딩 벡터를 포워드 네트워크의 입력으로 하고, 상기 포워드 네트워크를 훈련하여, 새로운 훈련 인 코딩 벡터를 획득하는 단계; 상기 새로운 훈련 인코딩 벡터를 다시 완전 연결 네트워크의 입력으로 하고, 상기 완전 연결 네트워크를 훈련하 여, 훈련 라벨 벡터를 획득하는 단계; 및 상기 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨을 출력으로 하여, 라벨 추천 모델을 획득하는 단계; 를 포 함하는, 것을 특징으로 하는 라벨 추천 모델 훈련 방법. 청구항 5 제4항에 있어서, 상기 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨을 출력으로 하여, 라벨 추천 모델을 획득하는 단계는, 액티브 함수를 통해 상기 훈련 라벨 벡터를 해석하여, 상기 훈련 라벨 벡터에 포함된 취미 라벨을 획득하는 단 계; 상기 취미 라벨에서, 상기 취미 라벨에 대응되는 제1 취미 라벨을 결정하고, 상기 취미 라벨에서 상기 제1 취미 라벨이 차지하는 비율을 계산하고, 라벨 추천 모델의 확률 역치를 결정하여, 출력 라벨 확률이 상기 확률 역치 보다 크거나 같은 라벨 추천 모델을 획득하는 단계; 를 포함하는, 것을 특징으로 하는 라벨 추천 모델 훈련 방법. 청구항 6 라벨 획득 방법에 있어서, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 단계; 시멘틱 증강 표시 프레임을 사용하여, 상기 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획 득하는 단계; 소셜 네트워크를 상기 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 단계; 및 상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 단계; 를 포함하는, 것을 특징으로 하는 라벨 획득 방법. 청구항 7 제6항에 있어서, 상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 단계는, 상기 인코딩 벡터를 상기 라벨 추천 모델의 포워드 네트워크로 입력하여, 새로운 인코딩 벡터를 획득하는 단계; 상기 새로운 인코딩 벡터를 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득하는 단계; 및 상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력하는 단계; 를 포 함하는, 것을 특징으로 하는 라벨 획득 방법. 청구항 8 제7항에 있어서, 상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력하는 단계는, 상기 라벨 추천 모델의 액티브 함수를 기반으로, 상기 라벨 벡터를 해석하여, 복수의 라벨을 획득하는 단계; 및상기 복수의 라벨에서 나타난 확률이 확률 역치보다 크거나 같은 라벨을, 취미 라벨로 결정하는 단계; 를 포함 하는, 것을 특징으로 하는 라벨 획득 방법. 청구항 9 라벨 추천 모델 훈련 장치에 있어서, 수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 획득 모듈 - 상기 훈련 소재는 취미 라벨을 포 함함 -; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하는 훈련 시멘틱 벡터를 획득하고, 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 처 리 모듈; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 훈련 모듈; 을 포함하는, 것을 특징으로 하는 라벨 추천 모델 훈련 장치. 청구항 10 제9항에 있어서, 상기 훈련 소재는 행위 훈련 소재 및 업무 훈련 소재를 포함하고; 상기 처리 모듈은, 상기 시멘틱 증강 표시 프레임을 기반으로, 상기 행위 훈련 소재를 부동한 길이의 훈련 행위 벡터로 표시하고, 상기 업무 훈련 소재를 고정 길이의 훈련 업무 벡터로 표시하고; 상기 훈련 행위 벡터의 평균을 구한 후, 상기 훈련 업무 벡터와 융합시켜, 훈련 시멘틱 벡터를 획득하는, 것을 특징으로 하는 라벨 추천 모델 훈련 장치. 청구항 11 제9항에 있어서, 상기 처리 모듈은 또한, 소셜 네트워크를 획득하고, 소셜 네트워크 사이의 친밀값을 결정하고; 상기 친밀값을 행렬의 요소의 값으로 하여, 인접 행렬을 구축하고; 상기 인접 행렬에서 각 행의 상기 요소의 가중치의 합이 1인 조건 하에, 상기 요소에 가중치를 할당하며, 상기 인접 행렬의 대각선 요소에 할당된 가중치는 기타 요소에 할당된 가중치보다 크고; 상기 인접 행렬의 각 요소에 대응되는 훈련 시멘틱 벡터를 획득하고, 그래프 컨볼루션 네트워크를 기반으로, 상 기 훈련 시멘틱 벡터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 획득하는, 것을 특징으로 하는 라벨 추천 모델 훈련 장치. 청구항 12 제9항에 있어서, 상기 훈련 모듈은, 상기 훈련 인코딩 벡터를 포워드 네트워크의 입력으로 하고, 상기 포워드 네트워크를 훈련하여, 새로운 훈련 인 코딩 벡터를 획득하고; 상기 새로운 훈련 인코딩 벡터를 다시 완전 연결 네트워크의 입력으로 하고, 상기 완전 연결 네트워크를 훈련하 여, 훈련 라벨 벡터를 획득하고; 상기 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨을 출력으로 하여, 라벨 추천 모델을 획득하는, 것을 특징으로 하는 라벨 추천 모델 훈련 장치. 청구항 13 제12항에 있어서, 상기 훈련 모듈은, 액티브 함수를 통해 상기 훈련 라벨 벡터를 해석하여, 상기 훈련 라벨 벡터에 포함된 취미 라벨을 획득하고; 상기 취미 라벨에서, 상기 취미 라벨에 대응되는 제1 취미 라벨을 결정하고, 상기 취미 라벨에서 상기 제1 취미 라벨이 차지하는 비율을 계산하고, 화상 모델의 확률 역치를 결정하여, 출력 라벨 확률이 상기 확률 역치보다 크거나 같은 라벨 추천 모델을 획득하는, 것을 특징으로 하는 라벨 추천 모델 훈련 장치. 청구항 14 라벨 획득 장치에 있어서, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 획득 모듈; 시멘틱 증강 표시 프레임을 사용하여, 상기 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획 득하고, 소셜 네트워크를 상기 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 처리 모듈; 및 상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 예측 모듈; 을 포함하는, 것을 특징으로 하는 라벨 획득 장치. 청구항 15 제14항에 있어서, 상기 예측 모듈은, 상기 인코딩 벡터를 상기 라벨 추천 모델의 포워드 네트워크로 입력하여, 새로운 인코딩 벡터를 획득하고; 상기 새로운 인코딩 벡터를 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득하고; 상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력하는, 것을 특징으로 하는 라벨 획득 장치. 청구항 16 제15항에 있어서, 상기 예측 모듈은, 상기 라벨 추천 모델의 액티브 함수를 기반으로, 상기 라벨 벡터를 해석하여, 복수의 라벨을 획득하고; 상기 복수의 라벨에서 나타난 확률이 확률 역치보다 크거나 같은 라벨을, 취미 라벨로 결정하는, 것을 특징으로 하는 라벨 획득 장치. 청구항 17 전자 기기에 있어서, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리; 를 포함하고, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적 어도 하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서가 제1항 내지 제5항 중 어느 한 항의방법, 또는 제6항 내지 제8항 중 어느 한 항의 상기 방법을 수행하는, 것을 특징으로 하는 전자 기기. 청구항 18 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체에 있어서, 상기 컴퓨터 명령은 컴퓨터가 제1항 내지 제5항 중 어느 한 항의 방법, 또는 제6항 내지 제8항 중 어느 한 항의 방법을 수행하도록 하는, 것을 특징으로 하는 비일시적 컴퓨터 판독 가능 저장 매체. 발명의 설명 기 술 분 야 본 발명은 데이터 처리 기술 분야에 관한 것으로, 특히 딥러닝, 클라우드 서비스, 콘테츠 검색 등 기술 분야에 관한 것이고, 구체적으로 라벨 추천 모델 훈련 방법 및 장치, 라벨 획득 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "취미 화상은 규칙, 전통 모델을 기반으로 하는 2 가지 기술 수단을 포함한다. 속성 화상은 나이, 성별 등 고정 속성일 수 있고, 획득하는 데 간편하다. 취미 화상은 취미를 나타낸다. 예를 들면 선호, 기능, 습관 등을 나타 낸다. 2 가지 기술 수단의 특점은 특징이고, 흔히 텍스트로 특징을 나타낸다. 본 발명은 라벨 추천 모델 훈련 방법 및 장치, 라벨 획득 방법 및 장치를 제공한다. 본 발명의 제1 측면에 따르면, 라벨 추천 모델 훈련 방법을 제공하고, 상기 방법은, 수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 단계 - 상기 훈련 소재는 취미 라벨을 포함함 -; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하는 훈 련 시멘틱 벡터를 획득하는 단계; 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획 득하는 단계; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 단계; 를 포함한다. 본 발명의 제2 측면에 따르면, 라벨 획득 방법을 제공하고, 상기 방법은, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 단계; 시멘틱 증강 표시 프레임을 사용하여, 상기 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획득하는 단계; 소셜 네트워크 를 상기 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 단계; 및 상기 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득하는 단계; 를 포함한다. 본 발명의 제3 측면에 따르면, 라벨 추천 모델 훈련 장치를 제공하고, 상기 장치는, 수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 획득 모듈 - 상기 훈련 소재는 취미 라벨을 포 함함 -; 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재의 특징을 표시하므로, 상기 취미 라벨을 포함하 는 훈련 시멘틱 벡터를 획득하고, 소셜 네트워크를 상기 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획 득하는 처리 모듈; 및 상기 훈련 인코딩 벡터를 입력으로 하고, 상기 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 훈련 모듈; 을 포함한다. 본 발명의 제4 측면에 따르면, 라벨 획득 장치를 제공하고, 상기 장치는, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 획득 모듈; 시멘틱 증강 표시 프레임을 사 용하여, 상기 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획득하고, 소셜 네트워크를 상기 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 처리 모듈; 및 상기 인코딩 벡터를 사전 훈련된 라벨 추천 모 델로 입력하여, 취미 라벨을 획득하는 예측 모듈; 을 포함한다. 본 발명의 제5 측면에 따르면, 전자 기기를 제공하고, 상기 전자 기기는, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서에 통신 가능하게 연결되는 메모리; 를 포함하고, 상 기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행 가능한 명령이 저장되어 있고, 상기 명령이 상기 적어 도 하나의 프로세서에 의해 실행될 경우, 상기 적어도 하나의 프로세서가 제1 측면 또는 제2 측면의 방법을 수 행한다. 본 발명의 제6 측면에 따르면, 컴퓨터 명령이 저장되어 있는 비일시적 컴퓨터 판독 가능 저장 매체를 제공하고, 상기 컴퓨터 명령은 컴퓨터가 제1 측면 또는 제2 측면의 방법을 수행하도록 한다. 본 발명의 제7 측면에 따르면, 컴퓨터 프로그램을 제공하고, 상기 컴퓨터 프로그램이 프로세서에 의해 수행될 경우 제1 측면 또는 제2 측면의 방법이 구현된다."}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이해해야 할 것은, 본 발명의 내용 부분에서 설명하는 내용은 본 발명 실시예의 관건 또는 중요한 특징을 식별 하기 위한 것이 아니고, 본 발명의 범위를 한정하기 위한 것도 아니다. 본 발명의 기타 특징은 이하의 명세서를 통해 용이하게 이해된다."}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 도면과 결합하여 본 발명의 예시적인 실시예를 설명한다. 여기에는 이해를 돕기 위해 본 발명의 실시예의 다양한 세부 사항을 포함하고, 실시예들은 단지 예시적인 것으로 간주되어야 한다. 때문에 본 발명에 속하는 기 술 분야의 통상의 기술자는 본 발명의 범위 및 사상을 벗어나지 않고 실시예에 여러가지 변경과 수정을 할 수 있다는 것을 인식해야 한다. 동시에 정확성과 간결성을 위해 하기의 설명에서 공지 기능과 구조에 대한 설명은 생략한다. 라벨은 개인화 추천, 검색 및 광고 조회수 예측 등 다양한 제품에서 광범히 응용되고 있고, 취미 화상을 통해 정확한 취미 선호, 사용 습관 및 인구 속성 등을 획득할 수 있다. 화상을 통해 제품에 대한 사용자의 체험 및 수익을 향상시킬 수 있다. 일반적으로 라벨은 속성 라벨 및 취미 라벨로 나눌 수 있고, 속성 라벨은 나이, 성별, 졸업 학교 등 고정 속성 을 나타낸다. 취미 라벨은 선호, 구비한 기능 및 습관 등 다양한 측면을 포함할 수 있다. 그러나 취미 라벨은 광범히 응용될 뿐만 아니라, 각인각색의 효과를 구현하기도 하여, 서비스의 정확성을 향상시킨다. 그러나 실제 과정에서, 취미는 잠성적인 것이고, 통상적으로 수집하고 또는 규칙을 통해 예측하기 어렵고, 심지 어 사용자 자신도 자신의 취미를 정확히 설명할 수 없다. 당해 상황에서, 취미의 정확한 획득과 취미 라벨의 정확한 획득이 현재의 핵심적인 과제로 되었다. 관련 기술에서, 취미 라벨 획득 방법에서 일반 규칙 또는 전통 모델을 사용한다. 예를 들면, 일반 규칙에서, 인 위적으로 정의된 규칙을 통해, 사용자에 관련 라벨을 달고, 응용 장면이 기업 근무 장면인 것을 예로 들면, 사 용자의 작업 주간 보고에서 \"딥러닝\"이 여러번 언급되었을 경우, \"딥러닝\"이라는 취미 라벨을 달고; 사용자의 주요 업무가 제품 디자인 및 계획일 경우, \"프로덕트 매니저(Product Manager, PM)\"라는 라벨을 분배한다. 전통 모델을 기반으로 사용자의 취미 라벨을 획득할 경우, 전통 모델을 기반으로 하는 방법은 흔히 라벨 예측을 텍스 트의 다분류 태스크로 전환한다. 예를 들면, 사용자의 소재를 수집하고, 여기서 소재는 근무 장면에서 사용자의 작업 내용 및 작업 내용에 관련된 소재 또는 파일 등일 수 있다. 따라서 작업 내용, 작업 내용에 관련된 소재 또는 파일에서 사용자의 특징을 획득한다. 설명해야 할 것은, 상기 작업 내용은 모두 사용자의 허락 및 동의 하 에 획득된 것이다. 그다음 익스트림 그래디언트 부스팅(eXtreme Gradient Boosting, XGBoost), 서포트 벡터 머 신(Support Vector Machine, SVM) 등 분류 모델을 사용하여 분류하고, 여기서, 각 카테고리는 모두 취미 라벨일 수 있다."}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 방식에 설면된 바와 같이, 규칙 방법을 사용할 경우, 많은 인력 자원을 소비하여 규칙을 요약해야 하고, 통상적으로 간단한 규칙만 정리할 뿐, 잠성 매핑을 구현할 수 없다. 예를 들면, 사용자의 특징에 텍스트 분류, 정보 검색 및 데이터 마이닝의 상용 가중 기술(Term Frequency-Inverse Document Frequency, TF-IDF), ONE-HOT 인코딩 표시 등 키워드를 구비할 경우, 당해 사용자가 \"자연언어 처리\"에 대해 흥미를 느낀다고 결정할 수 있지 만, 특징과 라벨의 매핑 규칙을 총괄하기 어렵다. 정보의 끊임없는 변화와 시간의 흐름에 따라, 사용자의 취미 는 변화될 수 있고, 이때 규칙을 통한 방법은 흔히 시효성을 구비하지 않으므로, 효과가 차해진다. 전통 모델로 사용자 취미 화상을 획득할 경우, 직원에 대해 취미 라벨을 달 수 있지만, 효과가 좋지 않다. 원인 은 아래의 내지 을 포함한다. 전통 모델의 콜드부팅 문제가 심각함으로, 사용자 취미 화상의 예측 실패를 초래한다. 여기서 콜드부팅 문 제는 사용자의 소재가 비교적 결핍하여, 특징 표현 능력의 부족을 초래하고, 전통 모델의 효과가 비교적 차하다 는 것을 의미한다. 심지어 일부 사용자에서 소재를 전혀 수집하지 못한 경우도 존재하고, 이때 전통 모델은 완 전히 예측할 수 없다. 전통 모델에서, 통상적으로 one-hot 인코딩 또는 언어 모델 word2vec를 사용하여 사용자 특징을 표시한다. 그러나 당해 언어 표시 모델의 기술은 표면의 시멘틱 정보만 캐치 가능하므로, 흔히 모델 일반화 능력의 부족을 초래한다. 전통 모델에서, 전통 모델은 사용자 자신만의 특징을 입력으로 하고, 소셜 네트워크 등 여분의 정보를 포함 하지 않는다. 훈련 데이터 세트의 수집이 비교적 여려워, 훈련 데이터 세트가 매우 작은 경우를 초래하고, 전통 모델은 당해 요소에서, 오버 피팅되기 쉽다. 상기 관련 기술에 존재한 부족을 기반으로, 본 발명은 획득 방법을 제공하고, 사용자의 소셜 네트워크 및 그래 프 신경망 기술을 통해 사용자 취미 화상의 정확한 구축을 구현한다. 따라서 취미 화상을 정확히 획득할 수 있 는 모델을 결정한다. 아래의 실시예에서는 도면과 결합하여 본 발명을 설명한다. 도1은 본 발명의 실시예에 따른 라벨 추천 모델 훈련 방법의 개략적인 흐름도이고, 도1에 도시된 바와 같이, 당 해 방법은 단계S110 내지 단계S140을 포함할 수 있다. 단계S110에서, 수신된 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집한다. 본 발명의 실시예에서, 설명해야 할 것은, 훈련 소재는 역사 데이터이고, 훈련 소재는 취미 라벨을 더 포함한다. 본 발명에서 수집된 훈련 소재는 사용자와 관련된 소재일 수 있고, 물로 기타 소재일 수도 있고, 여 기서 구체적인 한정을 하지 않는다. 본 발명의 실시예에서, 훈련 소재는 클릭/즐겨찾기/읽었던 문장일 수 있다. 본 발명에서, 지식 추천 제품 및 제 품 검색의 행위 로그에서, 행위 훈련 소재를 수집할 수 있다. 근무 과정에서 작성/편집한 관련 문장에서, 업무 훈련 소재를 수집할 수도 있다. 근무 과정에서 작성/편집한 관련 문장은 주간 보고, 승진 재료, 프로젝트 총화 및 수요 파일 등일 수 있다. 여기서 업무 훈련 소재는 업무와 관련된 정보일 수 있다. 예를 들면, 작업 중에 제 출한 코드 분포(C++ 90%, Python 10%)일 수 있다. 여러 방법을 통해 소재를 수집함으로, 로그와 같은 잠성 피드백(즉, 행위 훈련 소재)을 획득할 수 있고, 근무 소재와 같이 진실하고 신뢰성이 있는 소재를 획득할 수 있고, 업무 훈련 소재을 획득할 수도 있음으로, 소재를 전면적으로 획득하고, 소재의 커버리지율 및 정확성을 효과적으로 보장하고, 소재 결핍 문제를 효과적으로 해결 하여; 후속에서 소재에 구비된 특징을 정확히 나타내는데 편리하다. 단계S120에서, 시멘틱 증강 표시 프레임을 사용하여, 훈련 소재를 표시하므로, 취미 라벨을 포함하는 훈련 시멘 틱 벡터를 획득한다. 본 발명의 실시예에서, 시멘틱 증강 표시 프레임은 지식 증강을 기반으로 하는 지속 학습 시멘틱 이해 프레임 (Enhanced Representation from kNowledge IntEgration, ERNIE)이다. ERNIE를 기반으로 훈련 소재에 대해 시멘 틱 표시를 한다. 취미 라벨을 포함하는 훈련 시멘틱 벡터를 획득한다. 설명해야 할 것은, 당해 프레임은 빅데이터 사전 훈련과 다원의 풍부한 지식을 결합하고, 지속 학습 기술을 통 해, 대량의 텍스트 데이터의 어휘, 구조, 시멘틱 등 측면의 지식을 받아들이고, 모델 효과의 끊임없는 진화를 구현한다. 단계S130에서, 소셜 네트워크를 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득한다. 본 발명의 실시예에서, 획득한 소셜 네트워크 관계, 소셜 관계는 친구일 수 있다, 네트워크에서 친구는 이웃으 로 불리울 수도 있다. 소셜 네트워크 관계를 훈련 시멘틱 벡터로 집합시키고, 훈련 시멘틱 벡터를 강화하여, 훈 련 인코딩 벡터를 획득한다. 단계S140에서, 훈련 인코딩 벡터를 입력으로 하고, 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조 를 훈련하여, 라벨 추천 모델을 획득한다. 본 발명의 실시예에서, 신경망은 심층 신경망(Deep Neural Networks, DNN)일 수 있고, 기타 신경망일 수도 있다. 본 발명에서, 신경망이 DNN인 것을 예로 들고, 2층 DNN 구조를 구축한다. 훈련 인코딩 벡터를 2층 DNN구조의 입력으로 하고, 취미 라벨을 2층 DNN 구조의 출력으로 하고, 2층 신경망 구 조를 훈려하여, 라벨 추천 모델을 획득한다. 본 발명의 실시예에서 제공되는 라벨 추천 모델 훈련 방법을 통해, ERNIE를 사용하여 훈련 소재에 대해 시멘틱 표시를 함으로, 훈련 소재에 구비된 특징 표시가 더 정확해지도록 한다. 2층 신경망 구조를 훈련함으로, 소재의 커버리지율을 증가하고, 취미 라벨을 획득하는 정확도를 향상시킬 수 있다. 본 발명의 아래 실시예는 시멘틱 증강 표시 프레임을 사용하여, 상기 훈련 소재를 표시하므로, 취미 라벨을 포 함하는 훈련 시멘틱 벡터를 획득하는 것에 대해 설명한다. 도2는 본 발명의 실시예에 따른 훈련 시멘틱 벡터 결정 방법의 개략적인 흐름도이고, 도2에 도시된 바와 같이, 당해 방법은 단계S210 내지 S220을 포함할 수 있다. 단계S210에서, 시멘틱 증강 표시 프레임을 기반으로, 행위 훈련 소재를 부동한 길이의 훈련 행위 벡터로 표시하 고, 업무 훈련 소재를 고정 길이의 훈련 업무 벡터로 표시한다. 상기 실시예에 설명된 바와 같이, 본 발명의 훈련 소재는 행위 훈련 소재 및 업무 훈련 소재를 포함한다. 본 발명의 실시예에서, 행위 훈련 소재를 구분성을 구비한 시멘틱 벡터으로 표시한다. 예를 들면, 취미와 유사 한 행위 훈련 소재를 거리가 상대적으로 작은 시멘틱 벡터로 표시하고, 취미와 유사하지 않는 행위 훈련 소재를 거리가 상대적으로 큰 시멘틱 벡터로 표시하여, 부동한 길이의 훈련 행위 벡터를 획득한다. 기타 훈련 소재를, 업무 훈련 소재와 같은 고정 길이의 훈련 업무 벡터로 표시한다. ERNIE를 통해 업무 훈련 소재에 대해 시멘틱 표시를 한다. 예를 들면, 코드 분포[0.9, 0.1, ...], 여기서, 벡터의 차원은 프로그래밍 언어 수량과 같고, 프 로젝트에서 10으로 설정될 수 있다. 단계S220에서, 훈련 행위 벡터의 평균을 구한 후, 훈련 업무 벡터와 융합시켜, 훈련 시멘틱 벡터를 획득한다. 본 발명의 실시예에서, 부동한 길이의 훈련 행위 벡터의 평균을 구한 후 훈련 업무 벡터와 스플라이싱하여, 훈 련 시멘틱 벡터를 획득한다. 예시적으로, 도 3은 본 발명의 실시예에 따른 시멘틱 벡터로 표시하는 개략도이고, 도3에 도시된 바와 같이, 클 릭된 타이틀, 검색된 로그 및 주간 보고 등을 입력층, 인코딩층, 취합층을 통해, 집합시킨 후 출력층에서 시멘틱 벡터를 출력하고, 코드로 표시한다. 본 발명의 실시예를 통해 훈련 행위 벡터 및 훈련 업무 벡터를 스플라이싱하여, 획득된 최종 훈련 시멘틱 벡터 는 고정적이고, 합리적인 길이를 구비하고, 신경망 모델의 일반화 능력을 향상시키는데 유리하다. 취미와 소셜 관계를 구비한 기타 취미가 유사하다는 구상을 기반으로, 소셜 네트워크를 인코딩한다. 예를 들면, 게임을 좋아하는 사용자일 경우, 게임을 좋아하는 기타 사용자가 있을 것이고, 그들 사이는 소셜 관계를 구비한 다. 결정된 시멘틱 벡터을 기반으로 인코딩하여, 인코딩 벡터를 획득한다. 본 발명의 아래 실시예는 소셜 네트 워크를 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 것에 대해 설명한다. 도4는 본 발명의 실시예에 따른 훈련 인코딩 벡터 결정 방법의 개략적인 흐름도이고, 도4에 도시된 바와 같이, 당해 방법은 단계S310 내지 단계S340을 포함할 수 있다. 단계S310에서, 소셜 네트워크를 획득하고, 소셜 네트워크 사이의 친밀값을 결정한다. 본 발명의 실시예에서, 소셜 네트워크는 사용자 사이의 소셜 상황일 수 있다. 예를 들면 사용자 사이의 인터랙 티브 상황일 수 있다. 사용자 사이의 소셜 네트워크에 따라 사용자 사이의 친밀값을 계산할 수 있고, 본 발명에 서 친밀값은 친밀도라고도 한다. 여기서, 친밀값의 범위는 (0~1.0)일 수 있다. 예를 들면 공식 score=(sigmoid (최근 소통 일수)+sigmoid(최근 소통 횟수))/2.0을 사용할 수 있다. 단계S320에서, 친밀값을 행렬의 요소의 값으로 하여, 인접 행렬을 구축한다. 본 발명의 실시예에서, 예시적으로, 사용자를 행렬의 요소로 하고, 계산된 사용자 사이의 친밀값에 따라, 각 행 은 1개의 사용자를 표시하고, 각 렬은 당해 사용자와 소셜 관계를 구비한 기타 사용자를 표시하고, 친밀값을 행 렬의 요소의 값으로 하며, 인접 행렬을 구축하고, 인접 행렬를 A로 표시한다. 단계S330에서, 인접 행렬에서 각 행의 상기 요소의 가중치의 합이 1인 조건 하에, 요소에 가중치를 할당한다. 여기서, 인접 행렬의 대각선 요소에 할당된 가중치는 기타 요소에 할당된 가중치보다 크다. 본 발명의 실시예에서, 자신의 정보를 기반으로, 인접 행렬의 대각선에 대해 5~10.0과 같은 비교적 큰 가중치를 설정한다. 마지막으로 아래의 공식을 통해, 인접 행렬의 가중치를 정규화시키고, 각 행의 합이 1로 되도록 한다."}
{"patent_id": "10-2022-0163970", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "공식에서, i는 인접 행렬의 행을 표시하고, j는 인접 행렬의 렬을 표시하고, 는 인접 행렬을 표시하고, 는 친밀도를 표시한다. 여기서, 인코딩 벡터는 로 표시한다. 는 인코딩 벡터를 표시하고, 는 벡터 행렬을 표 시한다. 단계S340에서, 인접 행렬의 각 요소에 대응되는 훈련 시멘틱 벡터를 획득하고, 그래프 컨볼루션 네트워크를 기 반으로, 훈련 시멘틱 벡터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 획득한다. 본 발명의 실시예에서, 구축된 인접 행렬의 기반에서, 그래프 컨볼루션 네트워크(Graph Convolutional Networks)를 기반으로, 인접 행렬의 각 친밀값 및 할당된 가중치에 따라, 훈련 시멘틱 벡터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 결정한다. 본 발명에서, 인접 행렬의 대각선을 비교적 큰 가중치로 설정함으로, 인코딩 후 형성된 벡터합은 사용자의 정보 에 더 많이 기울게된다. 소셜 관계로 인코딩함으로, 모델의 콜드부팅 문제를 해결하고, 심지어 소재를 수집하지 않은 특징을 캐치할 수도 있다. 아래의 실시예에서 훈련 인코딩 벡터를 입력으로 하고, 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 것에 대해 설명한다. 도5는 본 발명의 실시예에 따른 모델 훈련 방법의 개략적인 흐름도이고, 도5에 도시된 바와 같이, 당해 방법은 단계S410 내지 단계S430을 포함할 수 있다.단계S410에서, 훈련 인코딩 벡터를 포워드 네트워크의 입력으로 하고, 포워드 네트워크를 훈련하여, 새로운 훈 련 인코딩 벡터를 획득한다. 본 발명의 실시예에서, 본 발명은 Relu를 사용하여 포워드 네트워크의 액티브 함수로 하고, 는 신경망의 완전 연결 행렬을 표시하며, 신경망의 파라미터이고, 출력된 새로 운 훈련 인코딩 벡터는 집합된 후의 훈련 인코딩 벡터이다. 본 발명의 예시적인 일 실시예에서, 도6은 본 발명의 실시예에 따른 신경망의 개략도이다. 도6에 도시된 바와 같이, 도면의 A, B, C, D, E 및 F는 부동한 사용자를 표시한다. 여기서, 사용자 A와 소셜 관계를 구비하는 것은 사용자 B 및 사용자 C이다. 사용자 B와 소셜 관계를 구비하는 것은 사용자 A, 사용자 E 및 사용자 D이다. 사용 자 C와 소셜 관계를 구비하는 것은 사용자 A 및 사용자 F이다. 사용자 A가 타겟 사용자인 것을 예로 들면, 소셜 관계에 따라 사용자 A 및 사용자 A와 소셜 관계를 구비한 사용자 B의 훈련 인코딩 벡터 및 사용자 C의 훈련 인 코딩 벡터에 대해 제1 차 집합을 하고, 집합 이후 사용자 A의 훈련 인코딩 벡터 및 사용자 A와 소셜 관계를 구 비한 사용자 B의 훈련 인코딩 벡터 및 사용자 C의 훈련 인코딩 벡터를 획득한다. 단계S420에서, 새로운 훈련 인코딩 벡터를 다시 완전 연결 네트워크의 입력으로 하고, 완전 연결 네트워크를 훈 련하여, 훈련 라벨 벡터를 획득한다. 본 발명의 실시예에서, 새로운 훈련 인코딩 벡터 를 제2 층 완전 연결 네트워크의 입력으로 하고, 공식은 (AVW1)로 표시되고, 출력된 훈련 라벨 벡터를 로 기록한다. 도6에 도시된 바와 같이, 집합된 사용자 A의 훈련 인코딩 벡터 및 사용자 A와 소셜 관계를 구비한 사용자 B의 훈련 인코딩 벡터 및 사용자 C의 훈련 인코딩 벡터를 획득하고 다시 DNN 완전 연결 네트워크 에 입력하여, 새 로운 사용자 훈련 인코딩 벡터를 획득하고, 설명의 편리를 위해, 본 발명에서 를 V로 기록한다. 다시 사용자 A, 사용자 B 및 사용자 C 를 집합한 후의 훈련 인코딩 벡터를, 2층 신경망의 제2 층 신경망의 입력으로 하고, 다시 신경망의 완전 연결 네트워크로 입력하고, 공식은 (AVW1)로 표시되며, 라벨 벡터 를 획득한다. 즉 도6의 Y를 획득한다. 여기서, 이해해야 할 것은, 집합된 인코딩 벡터는 1개의 다차원 벡터이다. 예를 들면, 100차원의 벡터이고, 100 개의 라벨와 매핑된다. 즉, 각 차원은 1개의 라벨을 나타낸다. 본 발명은 2층 신경망 구조를 사용하고, 사용자 소셜 관계를 통해 사용자의 소재를 증가시키고, 사용자 소재 수 집의 범위를 확대함으로, 오버 피팅문제를 피한다. 단계S430에서, 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨로 출력하여, 라벨 추천 모델을 획득한다. 본 발명의 실시예에서, 훈련 라벨 벡터에 작용하는 함수를 통해, 훈련 라벨 벡터를 해석하고, 훈련 취미 라벨을 출력한다. 훈련 취미 라벨과 실제로 구비된 취미 라벨의 관계를 계산함으로, 라벨 추천 모델을 결정한다. 도7은 본 발명의 실시예에 따른 라벨 추천 모델 훈련 방법의 개략적인 흐름도이고, 도7에 도시된 바와 같이, 당 해 방법은 단계S510 내지 S520을 포함할 수 있다. 단계S510에서, 액티브 함수를 통해 훈련 라벨 벡터를 해석하여, 훈련 라벨 벡터에 포함된 취미 라벨을 획득한다. 본 발명의 실시예에서, 훈련 라벨 벡터에 작용하는 액티브 함수를 결정하고, 여기서, 액티브 함수는 sigmoid 함 수일 수 있다. 획득된 훈련 라벨 벡터를, 액티브 함수의 독립 변수로 하고, 액티브 함수를 통해 훈련 라벨 벡터 를 해석하여, 복수의 라벨을 획득한다. 즉, 복수의 훈련 취미 라벨을 획득한다. 단계S520에서, 취미 라벨에서, 취미 라벨에 대응되는 제1 취미 라벨을 결정하고, 취미 라벨에서 제1 취미 라벨 이 차지하는 비율을 계산하고, 라벨 추천 모델의 확률 역치를 결정하여, 출력 라벨이 확률 역치보다 크거나 같 은 라벨 추천 모델을 획득한다. 본 발명의 실시예의 복수의 라벨에서, 모든 라벨이 나타난 횟수에서 각 라벨이 나타난 횟수가 차지하는 비율을 계산한다. 모든 라벨이 나타난 횟수에서 취미 라벨에 대응되는 제1 취미 라벨이 나타난 횟수가 차지하는 확률을 계산함으로, 라벨 추천 모델의 확률 역치를 결정하고, 출력된 라벨 확률이 확률 역치보다 크거나 같은 라벨 추 천 모델을 획득한다. 동일/유사한 구상을 기반으로, 본 발명은 라벨 획득 방법을 제공한다. 도8은 본 발명의 실시예에 따른 라벨 획득 방법의 개략적인 흐름도이고, 도8에 도시된 바와 같이, 당해 방법은 단계S610 내지 단계S640을 포함할 수 있다. 단계S610에서, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득한다. 본 발명의 실시예에서, 취미 라벨 획득 지시를 수신한 경우, 당해 지시에 대응되는 소재를 획득한다. 상기 실시 예에 설명된 바와 같이, 소재는 행위 소재 및 업무 소재를 포함한다. 단계S620에서, 시멘틱 증강 표시 프레임을 사용하여, 소재의 특징을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획득한다. 본 발명의 실시예에서, 시멘틱 증강 표시 프레임으로 획득된 당해 행위 소재 및 업무 소재를 표시하여, 취미 라 벨을 포함하는 행위 벡터 및 업무 벡터를 획득한다. 단계S630에서, 소셜 네트워크를 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득한다. 본 발명의 실시예에서, 행위 벡터 및 업무 벡터를 상기 실시예에서 제공된 방법을 통해 융합하고, 그래프 컨볼 루션 네트워크를 사용하여 소셜 관계를 구비한 시멘틱 벡터를 인코딩한다. 그래프 컨볼루션 네트워크의 정의에 따르면, 인코딩 벡터가 사용자를 나타낼 경우, 사용자의 인코딩 벡터=친밀도*직원 친구 벡터이다. 즉, , X는 사용자의 벡터 행렬을 표시하고, 1개의 행은 1개의 사용자를 표시한다. 획득된 시멘틱 벡터를, 획득된 인접 행렬을 통해 당해 시멘틱 벡터와 융합시켜, 당해 인코딩 벡터를 획득한다. 단계S640에서, 인코딩 벡터를 사전 훈련된 라벨 추천 모델로 입력하여, 취미 라벨을 획득한다. 본 발명의 실시예에서, 획득된 인코딩 벡터를 훈련 완료된 라벨 추천 모델로 입력하고, 라벨 추천 모델은 당해 취미 라벨을 출력하고, 사용자의 취미 라벨을 획득한다. 본 발명에서 제공된 라벨 획득 방법을 통해, 사용자의 취미 라벨을 정확히 획득할 수 있으므로, 관련 재료를 정 확히 추천할 수 있다. 본 발명에서, 라벨 추천 모델을 사용하는 단계는 아래의 실시예를 참조할 수 있다. 도9는 본 발명의 실시예에 따른 라벨 추천 모델 사용 방법의 개략적인 흐름도이고, 도9에 도시된 바와 같이, 당 해 방법은 단계S710 내지 단계S730을 포함할 수 있다. 단계S710에서, 인코딩 벡터를 라벨 추천 모델의 포워드 네트워크로 입력하여, 새로운 인코딩 벡터를 획득한다. 본 발명의 실시예에서, 훈련 인코딩 벡터 결정 방법을 이용하여, 인코딩 벡터를 획득하고, 인코딩 벡터를 라벨 추천 모델의 포워드 네트워크로 입력하고, 당해 층의 모델의 완전 연결 네트워크를 통해, 새로운 인코딩 벡터를 획득한다. 단계S720에서, 새로운 인코딩 벡터를 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득한다. 본 발명의 실시예에서, 새로운 인코딩 벡터를 라벨 추천 모델에서의 제2 층의 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득한다. 예시적으로, 당해 라벨 벡터는 사용자의 특징을 포함한다. 예를 들면, 딥러닝, 아키텍처 기술, 클라우드 컴퓨팅, 자연언어 처리 등 특징을 포함한다. 단계S730에서, 라벨 벡터를 해석하고, 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출력한다. 본 발명의 실시예에서, sigmoid를 액티브 함수로 하므로, 라벨 벡터를 해석한다. 라벨 벡터에 구비된 특징을 통 해, 특징에 대응되는 취미 라벨을 획득함으로, 획득된 취미 라벨에서, 사용자에 구비된 취미 라벨을 결정한다. 예시적으로, 복수의 특징은 1개의 취미 라벨에 대응될 수 있다. 예를 들면, 구비된 텍스트 분류, TF-IDF 및 ONE-HOT 특징은 모두 \"자연언어 처리\"라는 라벨에 대응될 수 있다. 아래의 실시예에서 상기 라벨 벡터를 해석하고, 상기 라벨 추천 모델의 확률 역치를 기반으로, 취미 라벨을 출 력하는 것에 대해 설명한다. 도10은 본 발명의 실시예에 따른 라벨 획득 방법의 개략적인 흐름도이고, 도10에 도시된 바와 같이, 당해 방법 은 단계S810 내지 단계S820을 포함할 수 있다. 단계S810에서, 라벨 추천 모델의 액티브 함수를 기반으로, 라벨 벡터를 해석하여, 복수의 라벨을 획득한다. 상기 실시예에 따라 알 수 있는 바, 라벨 벡터는 로 표시된다. 여기서, 해석 함수는 Z=sigmoid(R)이다. 즉, 이다. 여기서, Z는 예측된 취미 라벨을 표시함으로, 복수의 라벨을 획득한다. 단계S820에서, 복수의 라벨에서 나타난 확률이 확률 역치보다 크거나 같은 라벨을, 취미 라벨로 결정한다. 본 발명의 실시예에서, 획득된 취미 라벨에서, 모든 취미 라벨이 나타난 횟수에서 각 취미 라벨이 나타난 횟수 가 차지하는 비율을 계산하고, 확률이 확률 역치보다 크거나 같은 취미 라벨을, 사용자에 구비된 취미 라벨로 결정한다. 예를 들면 확률 역치가 0.5일 경우, 해석된 차원 결과에서, 0.5보다 큰 예측값을 사용자에 구비된 취미 라벨로 결정한다. 본 발명의 실시예에서, 복수의 부동한 장면에 응용될 수 있고, 특히 기업 내부의 지식 관리에 적용된다. 예를 들면, 기업의 근무 장면에 적용된다. 본 발명은 기업의 근무 장면을 예로 들지만, 당해 장면에 한정되지 않는다. 기업의 근무 장면에서, 취미는 기능, 업무 및 직명 3가지 라벨로 나눌 수 있다. 기능은 딥러닝, 아키텍처 기술, 클라우드 컴퓨팅, 자연언어 등과 같은 지식 분류 시스템이고; 업무는 응용 A, 응용 B 등과 같은 직원이 참여하 는 제품 또는 프로젝트이고; 직명 라벨은 시퀀스라고도 하고, 구체적으로 연구 개발 엔지니어(Research and Development engineer, RD), 품질보증(Quality Assurance, QA), PM 및 운영자 또는 관리자(Operator, OP) 등과 같은 사용자의 역할를 나타낸다. 본 발명의 목표는 각 사용자의 취미 화상을 정확히 예측하는 것이다. 예를 들 면, 사용자 A의 라벨은, 경로 규획, 지도 기술 및 RD 등인 것이다. 본 발명에서 제공된 방법은, 회사 내부의 지식 추천 및 제품 검색에 응용될 수도 있고, 각인각색의 추천 효과 및 정확한 사람 검색 효과를 구현한다. 우선, 지식 추천 제품에서, 사용자 화상의 취미 라벨을 통해, 사용자 선 호를 정확히 이해할 수 있으므로, 사용자가 흥미를 느끼는 문장 및 비디오를 추천할 수 있고; 오직 인구 속성을 기반으로 하는 라벨에 대비해, 취미 라벨의 묘사 범위가 더 광번하고, 사용자 개인의 기호를 더 잘 구현할 수 있어, 추천 효과가 더 좋다. 사용자와 제품/프로젝트가 관련되므로, 제품/프로젝트를 검색할 경우, 관계자의 구 조화 정보를 직접 리턴할 수 있어, 사용자가 관계자 정보를 신속히 획득하도록 하고, 검색 원가를 저하시킨다. 사용자 화상의 정확한 예측을 구현하고, 추천 및 검색과 같은 하위 제품의 체험을 향상시키는데 유리하다. 도1에 도시된 방법과 같은 원리를 기반으로, 도11은 본 발명의 실시예에 따른 라벨 추천 모델 훈련의 개략적인 구조도이고, 도11에 도시된 바와 같이, 당해 장치은, 수신된 사용자 훈련 소재 수집 지시에 응답하여, 훈련 소재를 수집하는 획득 모듈; 시멘틱 증강 표시 프레 임을 사용하여, 훈련 소재를 표시하므로, 취미 라벨을 포함하는 훈련 시멘틱 벡터을 훈련하고, 소셜 네트워크를 훈련 시멘틱 벡터로 집합시켜, 훈련 인코딩 벡터를 획득하는 처리 모듈; 및 훈련 인코딩 벡터를 입력으로 하고, 취미 라벨을 출력으로 하는 것을 기반으로, 2층 신경망 구조를 훈련하여, 라벨 추천 모델을 획득하는 훈 련 모듈; 을 포함한다. 본 발명의 실시예에서, 훈련 소재는 행위 훈련 소재 및 업무 훈련 소재를 포함한다. 처리 모듈은, 시멘틱 증강 표시 프레임을 기반으로, 행위 훈련 소재를 부동한 길이의 훈련 행위 벡터로 표 시하고, 업무 훈련 소재를 고정 길이의 훈련 업무 벡터로 표시한다. 훈련 행위 벡터의 평균을 구한 후, 훈련 업 무 벡터와 융합시켜, 훈련 시멘틱 벡터를 획득한다. 처리 모듈은, 소셜 네트워크를 획득하고, 소셜 네트워크 사이의 친밀값을 결정한다. 친밀값을 행렬의 요소 의 값으로 하며, 인접 행렬을 구축한다. 인접 행렬에서 각 행의 요소의 가중치의 합이 1인 조건 하에, 요소에 가중치를 할당하고, 인접 행렬의 대각선 요소에 할당된 가중치는 기타 요소에 할당된 가중치보다 크다. 인접 행 렬의 각 요소에 대응되는 훈련 시멘틱 벡터를 획득하고, 그래프 컨볼루션 네트워크를 기반으로, 훈련 시멘틱 벡 터와 가중치 할당 후 각 요소값 사이의 승적을 계산하여, 훈련 인코딩 벡터를 획득한다. 훈련 모듈은, 훈련 인코딩 벡터를 포워드 네트워크의 입력으로 하고, 포워드 네트워크를 훈련하여, 새로운 훈련 인코딩 벡터를 획득한다. 새로운 훈련 인코딩 벡터를 다시 완전 연결 네트워크의 입력으로 하고, 완전 연 결 네트워크를 훈련하여, 훈련 라벨 벡터를 획득한다. 훈련 라벨 벡터를 독립 변수로 하고, 취미 라벨로 출력하 여, 라벨 추천 모델을 획득한다. 훈련 모듈은 또한, 액티브 함수를 사용하여 훈련 라벨 벡터를 해석하여, 훈련 라벨 벡터에 포함된 라벨을 획득한다. 라벨에서, 취미 라벨에 대응되는 제1 취미 라벨을 결정하고, 라벨에서 제1 취미 라벨이 차지하는 비 율을 계산하고, 라벨 추천 모델의 확률 역치를 결정하여, 출력 라벨 획률이 확률 역치보다 크거나 같은 라벨 추 천 모델을 획득한다. 도8에 도시된 방법과 같은 원리를 기반으로, 도12는 본 발명의 실시예에 따른 라벨 획득의 개략적인 구조도이고, 도12에 도시된 바와 같이, 당해 라벨 획득 장치은, 수신된 취미 라벨 획득 지시에 응답하여, 대응되는 소재를 획득하는 획득 모듈; 시멘틱 증강 표시 프레임 을 사용하여, 소재의 특징 라벨을 표시하므로, 취미 라벨을 포함하는 시멘틱 벡터를 획득하고, 소셜 네트워크를 시멘틱 벡터로 집합시켜, 인코딩 벡터를 획득하는 처리 모듈; 및 인코딩 벡터를 사전 훈련된 라벨 추천 모 델로 입력하여, 취미 라벨을 획득하는 예측 모듈; 을 포함한다. 처리 모듈은, 인코딩 벡터를 화상 모델의 포워드 네트워크로 입력하여, 새로운 인코딩 벡터를 획득한다. 새로운 인코딩 벡터를 완전 연결 네트워크로 입력하여, 라벨 벡터를 획득한다. 라벨 벡터를 해석하고, 화상 모 델의 확율 역치를 기반으로, 취미 라벨을 출력한다. 예측 모듈은, 화상 모델의 액티브 함수를 기반으로, 라벨 벡터를 해석하여, 복수의 라벨을 획득한다. 복수 의 라벨에서 나타난 확률이 확률 역치보다 크거나 같은 라벨을, 취미 라벨로 결정한다. 본 발명의 기술 수단에서, 언급된 사용자 퍼스널 정보의 획득, 저장 및 응용 등은, 모두 관련 법규의 규정에 해 당되고, 공서양속을 위배하지 않는다. 본 발명의 실시예에 따르면, 본 발명은 전자 기기, 판독 가능 저장 매체 및 컴퓨터 프로그램을 더 제공한다. 도13에 도시된 바와 같이, 도13은 본 발명의 실시예를 구현하는 전자 기기의 개략적인 블록도이다. 전자 기기는 다양한 형식의 디지털 컴퓨터를 표시한다. 예를 들면, 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크스테이션, 퍼 스널 정보 단말(PAD), 서버, 블레이드 서버, 메인 프레임 및 기타 적합한 컴퓨터일 수 있다. 전자 기기는 다양 한 형식의 모바일 장치를 표시한다. 예를 들면 퍼스널 정보 단말(PAD), 셀룰러 폰, 스마트 폰, 웨어러블 기기 및 기타 유사한 컴퓨팅 장치일 수 있다. 본 발명에 개시된 컴포넌트, 이들의 연결과 관계, 및 기능은 단지 예시 적인 것 뿐이며, 본 발명에서 설명 및/또는 요구한 본 발명의 구현을 한정하려는 것은 아니다. 도13에 도시된 바와 같이, 전자 기기는 컴퓨팅 유닛을 포함하고, 읽기 전용 메모리(ROM)에 저장 된 컴퓨터 프로그램 또는 저장 유닛에서 랜덤 액세스 메모리(RAM)에 로딩된 컴퓨터 프로그램에 따라, 각 적당한 조작 및 처리를 수행한다. RAM에서, 전자 기기의 조작에 수요되는 각 프로그램 및 데이터 를 저장할 수도 있다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력 I/O 인터페이스도 버스에 연결된다. 전자 기기의 복수의 컴포넌트는 I/O인터페이스에 연결되고, 복수의 컴포넌트는, 키보드, 마우스 등과 같은 입력 유닛; 다양한 유형의 모니터, 스피커 등과 같은 출력 유닛; 자기 디스크, 광 디스크 등과 같은 저장 유닛; 및 네트워크 카드, 모뎀 또는 무선 통신 송수신기 등과 같은 통신 유닛을 포함한다. 통신 유닛은 전자 기기가 인터넷과 같은 컴퓨터 네트워크 및/또는 각 전신 네트워크를 통해 기타 기 기와 정보/데이터를 교환할 수 있도록 허용한다. 컴퓨팅 유닛은 각 처리 및 계산 기능을 구비한 범용/전용 처리 컴포넌트일 수 있다. 컴퓨팅 유닛의 일부 예시는 중앙 처리 장치(CPU), 그래프 처리 장치(GPU), 각 전용 인공지능 계산 칩, 각 기계 학습 모델 알고 리즘을 운행하는 컴퓨팅 유닛, 디지털 신호 처리 장치(DSP), 임의의 적합한 프로세서, 제어기 및 마이크로 제어 기 등을 포함하나 이에 한정되지 않는다. 컴퓨팅 유닛은 상기 설명한 각 방법 및 처리를 수행한다. 예를 들면 라벨 추천 모델 훈련 방법 및 라벨 획득 방법을 수행한다. 예를 들면, 일 실시예에서, 라벨 추천 모델 훈 련 방법 및 라벨 획득 방법은 컴퓨터 소프트웨어 프로그램으로 구현될 수 있고, 유형적으로 저장 유닛과 같은 기계 판독 가능 매체에 포함된다. 일 실시예에서, 컴퓨터 프로그램의 일부 또는 전부는 ROM 및/또는 통신 유닛에 의해 전자 기기에 로딩 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되 고 컴퓨팅 유닛에 의해 수행될 경우, 상기 설명한 라벨 추천 모델 훈련 방법 및 라벨 획득 방법의 하나 또 는 복수의 단계를 수행할 수 있다. 대안적으로, 기타 실시예에서, 컴퓨팅 유닛은 기타 임의의 적합한 방식 (예를 들면, 펌웨어)으로 본 발명의 실시예에 따른 라벨 추천 모델 훈련 방법 및 라벨 획득 방법을 수행할 수 있도록 구성된다. 여기서 설명하는 시스템과 기술의 여러 가지 실시형태는 디지털 전자회로 시스템, 집적회로 시스템, 프로그래밍 가능 게이트 어레이(FPGA), 주문형 직접 회로(ASIC), 전용 표준 제품(ASSP), 칩상 시스템(SOC), 복합 프로그래 머블 논리 소자(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어 및/또는 이들의 조합에서 실현될 수 있다. 이러한 여러 가지 실시형태는 하나 또는 복수의 컴퓨터 프로그램에서 실시되는 것을 포함할 수 있고, 당해 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그래밍 가능 프로세서를 포함하는 프로그래밍 가능 시스템에서 실 행 및/또는 해석되며, 당해 프로그래밍 가능 프로세서는 전용 또는 일반 프로그래밍 가능 프로세서일 수 있으며, 저장 시스템, 적어도 하나의 입력 장치 및 적어도 하나의 출력 장치에서 데이터와 명령을 수신할 수 있 고, 데이터와 명령을 당해 저장 시스템, 당해 적어도 하나의 입력 장치 및 당해 적어도 하나의 출력 장치에 전 송할 수 있다. 본 발명의 방법을 수행하는 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 당해 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그래밍 가능한 데이터 처리 장치의 프로 세서 또는 제어기에 제공하여, 프로그램 코드가 프로세서 또는 제어기에 의해 수행될 경우 흐름도 및/또는 블록 도에서 규정한 기능/조작을 실시하게 된다. 프로그램 코드는 완전히 또는 부분적으로 기계에서 수행되고, 독립 소프트웨어 패키지로서 부분적으로 기계에서 수행하고 부분적으로 또는 완전히 원거리 기계 또는 서버에서 수행 된다. 본 발명의 콘텍스트에서, 기계 판독 가능 매체는 유형적인 매체일 수 있고, 명령 수행 시스템, 장치 또는 기기 가 사용하거나 명령 수행 시스템, 장치 또는 기기와 결합하여 사용하도록 제공하는 프로그램을 포함 또는 저장 할 수 있다. 기계 판독 가능 매체는 기계 판독 가능 신호 매체 또는 기계 판독 가능 저장 매체일 수 있다. 기계 판독 가능 매체는 전자, 자기, 광학, 전자기, 적외선 또는 반도체 시스템, 장치 및 기기, 또는 상기 내용의 임 의의 적합한 조합을 포함하나 이에 한정되지 않는다. 기계 판독 가능 저장 매체의 더 구체적인 예시는 하나 또 는 복수의 선을 기반으로 하는 전기 연결, 휴대용 컴퓨터 디스크, 하드 디스크, 랜덤 엑세스 메모리(RAM), 읽기 전용 메모리(ROM), 지울 수 있는 프로그래밍 가능한 읽기 전용 메모리(EPROM또는 플래시 메모리), 광섬유, 시디 롬(CD-ROM), 광학 저장 기기, 자기 저장 기기, 또는 상기 내용의 임의의 적합한 조합을 포함할 수 있다. 사용자와의 인터랙션을 제공하기 위해, 여기서 설명된 시스템 및 기술은 컴퓨터에서 구현할 수 있으며, 당해 컴 퓨터는 사용자에게 정보를 디스플레이하는 디스플레이 장치(예를 들면, CRT음극선관) 또는 LCD(액정 디스플레이)모니터); 및 키보드와 지향 장치(예를 들면, 마우스 또는 트랙볼)를 구비하고, 사용자는 당해 키보 드와 당해 지향 장치를 통해 컴퓨터에 입력을 제공할 수 있다. 기타 유형의 장치도 사용자와의 인터랙션에 사용 될 수 있는 바, 예를 들면 사용자에게 제공된 피드백은 임의의 형식의 감각 피드백(예를 들면, 시각적 피드백, 청각적 피드백 또는 촉각적 피드백)일 수 있고, 임의의 형식(음향 입력, 음성 입력 또는 촉각 입력)에 의해 사 용자로부터의 입력을 수신할 수 있다. 여기서 설명한 시스템과 기술을, 백그라운드 컴포넌트를 포함하는 컴퓨팅 시스템(예를 들면 데이터 서버), 또는 미들웨어 컴포넌트를 포함하는 컴퓨팅 시스템(예를 들면, 애플리케이션 서버), 또는 프론트 엔드 컴포넌트를 포 함하는 컴퓨팅 시스템(예를 들면, 그래픽 사용자 인터페이스 또는 네트워크 브라우저를 구비한 사용자 컴퓨터에 서 실시될 수 있고, 사용자는 당해 그래픽 사용자 인터페이스 또는 당해 네트워크 브라우저를 통해 여기서 설명 한 시스템과 기술의 실시형태와 인터랙션할 수 있다), 또는 이러한 백그라운드 컴포넌트, 미들웨어 컴포넌트 또 는 프론트 엔드 컴포넌트의 임의의 조합을 포함하는 컴퓨팅 시스템에서 실시될 수 있다. 임의의 형태 또는 매체 의 디지털 데이터 통신(예를 들면, 통신 네트워크)을 통해 시스템의 컴포넌트를 서로 연결할 수 있다. 통신 네트워크의 예시는 근거리 통신망 (LAN), 광역 통신망 (WAN) 및 네트워크를 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 떨어져 있으며, 통신 네트워크를 통해 서로 인터랙션한다. 대응하는 컴퓨터에서 운행되고 서로 클라이언트-서버 관계를 가지는 컴퓨터 프로그램에 의해 클라이언트와 서버의 관계를 생성한다. 서버는 클라우드 서버일 수 있고,분산식 시스템 의 서버 또는 블록 체인을 결합한 서버일 수도 있다. 이해해야 할 것은, 상기 복수 형식의 흐름에 의해, 단계를 재정열, 추가 또는 삭제할 수 있다. 예를 들면, 본 발명에 기재한 각 단계는 병행하여 또는 순차적으로 실행할 수도 있고, 서로 다른 순서로 실행할 수도 있다. 본 발명에서 개시한 기술적 수단이 원하는 결과만 구현할 수 있으면 본 발명에서는 이에 대해 한정하지 않는다. 상기 구체적인 실시 방식은 본 발명의 보호 범위를 한정하지 않는다. 본 발명이 속하는 기술 분야의 통상의 기 술자는 설계 요구 및 기타 요소에 의해 여러가지 수정, 조합, 서브 조합 및 대체가 이루어질 수 있음을 이해해 야 한다. 본 발명의 정신과 원칙 내에서 이루어진 모든 수정, 동등한 대체 및 개선은 모두 본 발명 보호 범위에 포함된다."}
{"patent_id": "10-2022-0163970", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면은 본 기술적 수단을 더 잘 이해하는데 사용되고, 본 발명을 한정하려는 것은 아니다. 도1은 본 발명의 실시예에 따른 라벨 추천 모델 훈련 방법의 개략적인 흐름도이다. 도2는 본 발명의 실시예에 따른 훈련 시멘틱 벡터 결정 방법의 개략적인 흐름도이다. 도3은 본 발명의 실시예에 따른 시멘틱 벡터로 표시하는 개략도이다. 도4는 본 발명의 실시예에 따른 훈련 인코딩 벡터 결정 방법의 개략적인 흐름도이다. 도5는 본 발명의 실시예에 따른 모델 훈련 방법의 개략적인 흐름도이다. 도6은 본 발명의 실시예에 따른 신경망의 개략도이다. 도7은 본 발명의 실시예에 따른 라벨 추천 모델 훈련 방법의 개략적인 흐름도이다. 도8은 본 발명의 실시예에 따른 라벨 획득 방법의 개략적인 흐름도이다. 도9는 본 발명의 실시예에 따른 라벨 추천 모델 사용 방법의 개략적인 흐름도이다. 도10은 본 발명의 실시예에 따른 라벨 획득 방법의 개략적인 흐름도이다. 도11은 본 발명의 실시예에 따른 라벨 추천 모델 훈련의 개략적인 구조도이다. 도12는 본 발명의 실시예에 따른 라벨 획득의 개략적인 구조도이다. 도13은 본 발명의 실시예를 구현하는 전자 기기의 블록도이다."}
