{"patent_id": "10-2019-0155440", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0066337", "출원번호": "10-2019-0155440", "발명의 명칭": "지정 차량을 모니터링하기 위한 주차장을 운영하는 방법 및 컴퓨터 판독가능 저장 매체", "출원인": "파킹클라우드 주식회사", "발명자": "신상용"}}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나 이상의 로컬 주차장 시스템과 상기 적어도 하나 이상의 로컬 주차장 시스템을 관리하도록구성되고, 외부 시스템 서버로부터 요청받은 지정차량에 대한 추적하기 위하여 주차장 중앙 관리 서버에서 수행되는 방법에 있어서, 상기 적어도 하나 이상의 로컬 주차장 시스템으로부터 입출차 차량에 대한 이미지를 수신하는 단계;상기 입출차 차량에 대한 이미지에 기초하여 입출차 차량 정보를 생성하는 단계;상기 외부 시스템 서버로부터 지정차량에 대한 정보를 수신하는 단계;상기 입출차 차량 정보 및 상기 지정차량에 대한 정보를 비교하는 단계; 상기 입출차 차량 정보 및 상기 지정차량에 대한 정보를 비교하여 상기 입출차 차량 정보 및 상기 지정차량에대한 정보 사이의 매칭률을 계산하는 단계;상기 계산된 매칭률이 미리 결정된 값보다 큰 경우, 상기 지정차량이 발견된 것으로 결정하고,상기 결정에 응답하여, 상기 지정차량이 발견된 사실을 포함하는 알림 메시지를 생성하는 단계; 및,상기 알림 메시지 및 상기 입출차 차량 정보를 상기 외부 시스템 서버에 송신하는 단계를 포함하는주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 입출차 차량 정보는 차량번호, 차종, 색상, 제조사, 차량 모델, 파손여부를 포함하는 적어도 하나 이상의항목을 포함할 수 있고,상기 입출차 차량 정보의 상기 적어도 하나 이상의 항목 중에서 상기 지정차량에 대한 정보에 대응하는 항목을구분하는 단계를 더 포함하는주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 입출차 차량 정보 및 상기 지정차량에 대한 정보를 비교하여 상기 입출차 차량 정보 및 상기 지정차량에대한 정보가 미리 결정된 기준 이상의 매칭률을 계산하는 단계는 상기 구분된 항목마다 미리 결정된 가중치에기초하여 매칭률을 계산하는 단계를 더 포함하는상기 주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 입출차 차량 정보 및 상기 지정차량에 대한 정보를 비교하여 상기 입출차 차량 정보 및 상기 지정차량에대한 정보 사이의 매칭률을 계산하는 단계는 수배위치에 기초하여 계산된 매칭률을 보정하는 단계를 더 포함하는주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2021-0066337-3-제1항에 있어서, 상기 계산된 매칭률이 미리 결정된 값보다 큰 경우, 상기 지정차량이 발견된 것으로 결정되는 경우, 상기 로컬주차장 시스템 또는 상기 외부 시스템 서버과 공중 교환 통신망을 통하는 통신 채널을 수립하는 단계를 더 포함하는 주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 차량번호는 상기 입출차 차량에 대한 이미지로부터 OCR(Optical Character Recognition) 엔진을 이용하여인식되는주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서, 상기 차종, 상기 색상, 상기 제조사, 상기 차량 모델, 상기 파손여부는 상기 입출차 차량에 대한 이미지로부터딥러닝 인공지능 기술을 이용한 이미지 인식 엔진을 이용하여 인식되는 주차장 중앙 관리 서버에서 수행되는 방법."}
{"patent_id": "10-2019-0155440", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "적어도 하나 이상의 로컬 주차장 시스템과 상기 적어도 하나 이상의 로컬 주차장 시스템을 관리하도록구성되고, 외부 시스템 서버로부터 요청받은 지정차량에 대한 추적을 위한 주차장 중앙 관리 서버에 포함된 컴퓨터 판독가능 기록 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 실행되면, 상기 주차장 중앙 관리 서버로 하여금,상기 적어도 하나 이상의 로컬 주차장 시스템으로부터 입출차 차량에 대한 이미지를 수신하고;상기 입출차 차량에 대한 이미지에 기초하여 입출차 차량 정보를 생성하고;상기 외부 시스템 서버로부터 지정차량에 대한 정보를 수신하고;상기 입출차 차량 정보 및 상기 지정차량에 대한 정보를 비교하고;상기 입출차 차량 정보 및 상기 지정차량에 대한 정보를 비교하여 상기 입출차 차량 정보 및 상기 지정차량에대한 정보가 미리 결정된 기준 이상의 매칭률을 계산하고;상기 계산된 매칭률이 미리 결정된 값보다 큰 경우, 상기 지정차량이 발견된 것으로 결정하고;상기 결정에 응답하여, 상기 지정차량이 발견된 사실을 포함하는 알림 메시지를 생성하고;상기 알림 메시지 및 상기 입출차 차량 정보를 상기 외부 시스템 서버에 송신하는 단계를 포함하게 하는 컴퓨터 판독가능 기록 매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 적어도 하나 이상의 로컬 주차장 시스템과 상기 적어도 하나 이상의 로컬 주차장 시스템을 관리하도록 구성되고, 외부 시스템 서버로부터 요청받은 지정차량에 대한 추적을 위한 주차장 중앙 관 리 서버에서 수행되는 방법에 있어서, 상기 적어도 하나 이상의 로컬 주차장 시스템으로부터 입출차 차량에 대한 (뒷면에 계속)"}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 지정 차량을 모니터링하기 위한 주차장을 운영하는 방법 및 컴퓨터 판독가능 저장 매체에 관한 것이다."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "여기에서 달리 언급하지 않으면 본 섹션에서 기술되는 내용은 본 출원에서의 청구범위의 선행 기술이 아니며, 본 섹션에 기재하였다는 이유로 선행 기술로 인정되어서는 안 된다. 국세청 또는 경찰청에서 수배차량을 검색하기 위해 운영되는 수배차량 검색시스템은 전국 도로에 설치된 CCTV를 사용해 차량을 조회 또는 판독할 수 있지만, CCTV의 개수가 적어 그 한계가 분명하다. 또한, 렌터카 사업체도 반납되지 않는 차량의 위치를 탐색하기 위하여 차량에 GPS를 기반으로 한 위치추적기를 이용한 위치추적 시스템 을 운영할 수 있으나 위치 추적의 신뢰성의 부족하고 위치 추적기를 차량마다 설치하는 데 막대한 비용이 투자 된다. 이와 같이, 수배차량 또는 반납되지 않은 렌터카와 같은 지정차량을 추적하기 위한 국세청 또는 경찰청 에서 운영하는 수배차량 검색시스템과 위치추적기를 이용한 위치 추적 시스템은 공통적으로 지정차량이 주차장 과 같이 독립적이고 고립된 공간에 진입하는 경우, 도로위의 CCTV에 의해 추적이 불가능하거나, GPS신호가 잡히 지 않아 지정차량에 대한 추적이 불가능해진다. 즉, 종래의 지정차량을 탐색하는 시스템에서, 지정차량이 독립적이고 고립된 주차장에 진입하는 경우에 추적이 불가능하다는 것이 공통된 맹점으로서 존재한다. 또한, 기존의 위치 추적 시스템은 CCTV를 이용하여 차량정보 를 획득하는 과정에서 차량정보의 미인식 또는 오인식의 발생률이 높아 신뢰도 높은 지정차량의 추적이 어렵다 는 문제점 또한 존재한다."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 논의를 바탕으로, 본 개시(disclosure)는, 지정차량이 주차장에 진입하는 경우에 이에 대한 신속한 추적을 가능케 하여 피의자 검거 및 피해자 구조, 또는 미반납 렌터카 회수가 신속하게 이뤄질 수 있는 지정차량을 모니터링하기 위한 주차장의 운영 방법을 제공하고자 한다. 또한, 본 개시 지정차량에 대한 정확한 차량정보가 부족한 상황이나, 지정차량인지 확인하기 위해 다른 차량의 차량정보를 획득하는 과정에서 일부 미인식 또는 오인식이 발생한 상황이더라도, 이를 보완하여 신뢰도 높은 지 정차량의 추적을 가능케하는 지정차량을 모니터링하기 위한 주차장의 운영 방법을 제공하고자 한다."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 적어도 하나 이상의 로컬 주차장 시스템과 상기 적어도 하나 이상의 로컬 주차 장 시스템을 관리하도록 구성되고, 외부 시스템 서버로부터 요청받은 지정차량에 대한 추적을 위한 주차장 중앙 관리 서버에서 수행되는 방법에 있어서, 상기 적어도 하나 이상의 로컬 주차장 시스템으로부터 입출차 차량에 대한 이미지를 수신하는 단계; 상기 입출차 차량에 대한 이미지에 기초하여 입출차 차량 정보를 생성하는 단계; 상기 외부 시스템 서버로부터 지정차량에 대한 정보를 수신하는 단계; 상기 입출차 차량 정보 및 상기 지정차량 에 대한 정보를 비교하는 단계; 상기 입출차 차량 정보 및 상기 지정차량 정보를 비교하여 상기 입출차 차량 정 보 및 상기 지정차량 정보가 미리 결정된 기준 이상의 매칭률을 계산하는 단계; 상기 계산된 매칭률이 미리 결 정된 값보다 큰 경우, 상기 지정차량이 발견된 것으로 결정하는 단계; 상기 결정에 응답하여, 상기 지정차량이 발견된 사실을 포함하는 알림 메시지를 생성하는 단계; 및 상기 알림 메시지 및 상기 입출차 차량 정보를 상기 외부 시스템 서버에 송신하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 입출차 차량 정보는 차량번호, 차종, 색상, 제조사, 차량 모델, 파손여부를 포함하는 적어도 하나 이상의 항목을 포함할 수 있고, 상기 입출차 차량 정보의 상기 적어도 하나 이상의 항목 중에서 상 기 지정차량 정보에 대응하는 항목을 구분하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 입출차 차량 정보 및 상기 지정차량 정보를 비교하여 상기 입출차 차량 정보 및 상기 지정차량 정보가 미리 결정된 기준 이상의 매칭률을 계산하는 단계는 상기 구분된 항목마다 미리 결정된 가중치 에 기초하여 매칭률을 계산하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 입출차 차량 정보 및 상기 지정차량 정보를 비교하여 상기 입출차 차량 정보 및 상기 지정차량 정보가 미리 결정된 기준 이상의 매칭률을 계산하는 단계는 수배위치에 기초하여 계산된 매칭률을 보 정하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 계산된 매칭률이 미리 결정된 값보다 큰 경우, 상기 지정차량이 발견된 것으로 결정 되는 경우, 상기 로컬 주차장 시스템 또는 상기 외부 시스템 서버와 공중 교환 통신망을 통하는 통신 채널을 수 립하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 차량번호는 상기 입출차 차량에 대한 이미지로부터 OCR(Optical Character Recognition) 엔진을 이용하여 인식될 수 있다. 일 실시예에 따르면, 상기 차종, 상기 색상, 상기 제조사, 상기 차량 모델, 상기 파손여부는 상기 입출차 차량 에 대한 이미지로부터 딥러닝 인공지능 기술을 이용한 이미지 인식 엔진을 이용하여 인식될 수 있다. 일 실시예에 따르면, 적어도 하나 이상의 로컬 주차장 시스템과 상기 적어도 하나 이상의 로컬 주차장 시스템을 관리하도록 구성되고, 외부 시스템 서버로부터 요청받은 지정차량에 대한 추적을 위한 주차장 중앙 관리 서버에 포함된 컴퓨터 판독가능 기록 매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그램은 실행되면, 상기 주차장 중앙 관리 서버로 하여금, 상기 적어도 하나 이상의 로컬 주차장 시스템으로부터 입출차 차량에 대한 이 미지를 수신하고; 상기 입출차 차량에 대한 이미지에 기초하여 입출차 차량 정보를 생성하고; 상기 외부 시스템 서버로부터 지정차량에 대한 정보를 수신하고; 상기 입출차 차량 정보 및 상기 지정차량 정보를 비교하고; 상기 입출차 차량 정보 및 상기 지정차량 정보를 비 교하여 상기 입출차 차량 정보 및 상기 지정차량 정보가 미리 결정된 기준 이상의 매칭률을 계산하고; 상기 계 산된 매칭률이 미리 결정된 값보다 큰 경우, 상기 지정차량이 발견된 것으로 결정하고; 상기 결정에 응답하여, 상기 지정차량이 발견된 사실을 포함하는 알림 메시지를 생성하고; 상기 알림 메시지 및 상기 입출차 차량 정보 를 상기 외부 시스템 서버에 송신하는 단계를 포함할 수 있다."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "이상의 간단한 요약 및 효과에 관한 설명은 단순히 예시적인 것으로서 본 개시에서 의도한 기술적 사항을 제한 하기 위한 것이 아니다. 이하의 상세한 설명과 첨부된 도면을 참고함으로써, 전술한 예시적인 실시예들과 기술 적 특징들에 더하여, 추가적인 실시예와 기술적 특징들이 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시에서 사용되는 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 개시에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 개시에 사용된 용어 들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 개시에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 개시에서 정의된 용어일지라도 본 개시의 실시예들을 배제하도록 해석될 수 없다. 앞서 설명한 본 개시의 특징들과 기타 추가적인 특징들에 대해서는 첨부된 도면을 참고하여 이하에서 자세하게 설명한다. 이러한 도면들은 본 개시에 따르는 단지 몇 가지의 실시예만을 도시한 것이며, 본 개시의 기술적 사상의 범위를 제한하는 것으로 간주되어서는 안 된다. 본 개시의 기술적 사상은 첨부된 도면을 사용하여 더 구 체적이고 상세하게 기술될 것이다. 도 1은 본 개시의 일 실시예에 따른 지정차량 모니터링 시스템을 나타낸 구성도이다. 도 1을 참고하면 지정차 량 모니터링 시스템은 주차장 중앙 관리 서버, 적어도 하나 이상의 외부 시스템, 및 적어도 하 나 이상의 로컬 주차장 시스템을 포함할 수 있다. 외부 시스템은 주차장 중앙 관리 서버와 상 호 통신할 수 있는 복수의 외부 시스템(120-1 …120-k)을 포함할 수 있으며, 로컬 주차장 시스템 또한 주 차장 중앙 서버와 상호 통신할 수 있는 복수의 로컬 주차장 시스템(130-1 …130-n)을 포함할 수 있다. 주차장 중앙 관리 서버는 복수의 로컬 주차장 시스템과 연결되고, 복수의 로컬 주차장 시스템을 관리하는 서버일 수 있다. 주차장 중앙 관리 서버는 '통합 서버', '종합 서버', CS(customer service) 서버', '메인 서버', 'LPR 서버', '지정차량 추적 시스템 서버' 또는 이와 동일한 의미를 가지는 다른 용어로 지칭될 수 있다. 적어도 하나 이상의 외부 시스템은 특정 차량을 추적할 필요가 있는 외부 단체가 운영하는 서버일 수 있다. 예를 들어, 외부 시스템은 경찰청, 국세청, 국토교통부, 외교부와 같은 공공기관 및 렌터카 사업체, 차량 공유 서비스 업체와 같은 민영기업을 포함할 수 있다. 외부 시스템을 운영하는 외부 주체와 주차장 중앙 관리 서버를 운영하는 주차장 관리 업체는 상호 지정차량 추적에 관한 업무협약(memorandum of understanding, MOU)을 체결할 수 있다. 적어도 하나 이상의 외부 시스템은 주차장 중앙 관리 서버에 지정차량에 대한 정보를 송신하고, 주차 장 중앙 관리 서버로부터 해당 지정차량이 발견되었다는 알림을 포함한 지정차량에 대한 정보를 제공받을 수 있다. 적어도 하나 이상의 로컬 주차장 시스템은 일정한 구역 내의 주차장을 관리하기 위해 일정한 지역 내의 주 차장 별로 구축된 시스템일 수 있다. 적어도 하나 이상의 로컬 주차장 시스템 각각은 주차장 중앙 관제 서버에 연결되고 주차장 중앙 관리 서버는 연결된 적어도 하나 이상의 로컬 주차장 시스템을 통 합하여 관리할 수 있다. 일 실시예에서 로컬 주차장 시스템 각각은 입출차 게이트 장치 및 주차장 제어 장치를 포함할 수 있다. 예를 들어, 로컬 주차장 시스템(130-1)에 포함된 입출차 게이트 장치는 주차장 내로 진입하는 차량을 관리하기 위한 것으로, 진입하거나 진출하는 차량의 번호판을 촬영하기 위한 촬영 장치와, 차량의 진입을 제어하기 위한 차단장치를 포함할 수 있다. 촬영 장치는 차량의 전면 및/또는 후면의 이미지(예: 스틸 이미지 또는 영상)를 촬영할 수 있다. 주차장 관리 장치는 주차장에 입출차하는 차량의 번호판을 촬영하는 촬영 장치와 차량 번호의 인식 여부에 기초하여 제어되는 차단장치를 제어하도록 구성될 수 있다. 예를 들어, 주차장 관리 장치는 촬영 장치 로부터 번호판이 포함된 차량 이미지를 획득하고, 획득된 이미지의 차량 번호판으로부터 차량 번호를 인식하고 인식 결과에 따라 차단장치를 제어하도록 구성될 수 있다. 일 실시예에서, 주차장 중앙 관제 서버는 외부 시스템으로부터 추적을 요청받은 지정차량이 로컬 주 차장 시스템에 진입 및/또는 진출하는지 모니터링하여, 로컬 주차장 시스템에 진입 및/또는 진출하는 경우 이를 외부 시스템에 알릴 수 있다. 다시 말하면, 주차장 중앙 관제 서버는 지정차량이 로컬 주 차장 시스템에 진입 및/또는 진출하는 경우 이를 알리는 알림 메시지를 외부 시스템에 송신할 수 있 다. 주차장 중앙 관제 서버는 지정차량에 대한 정보를 외부 시스템로부터 수신할 수 있고, 수신한 지정차 량에 대한 정보를 데이터베이스에 저장할 수 있다. 주차장 중앙 관제 서버는 로컬 주차장 시스템으 로부터 주차장에 진입 및/또는 진출하는 진출입 차량의 이미지를 수신할 수 있다. 주차장 중앙 관제 서버(11 0)는 로컬 주차장 시스템으로 수신된 이미지를 분석하여 진출입 차량에 대한 정보를 생성할 수 있다. 주 차장 중앙 관제 서버는 진출입 차량에 대한 정보와 지정차량에 대한 정보와 비교할 수 있다. 주차장 중앙 관제 서버는 진출입 차량에 대한 정보와 지정차량에 대한 정보를 비교한 결과, 진출입 차량이 지정차량인 것으로 확인되는 경우, 이러한 사실을 외부 시스템에 알릴 수 있다. 이상 주차장 차량 추적 시스템 에 포함된 엔티티(entity)들과 주차장 차량 추적 시스템에서 수행되는 기본적인 동작들에 대해서 설명하였 다. 도 2를 참고하여 주차장 차량 추적 시스템에서 수행되는 동작들에 대하여 보다 구체적으로 설명하기 로 한다. 도 2는 일 실시예에 따른 지정차량 추적 시스템에서 수행되는 프로세스를 개략적으로 도시한다. 주차장 지정차 량 추적 시스템은 주차장 중앙 관제 서버, 외부 시스템, 로컬 주차장 시스템을 포함할 수 있다. 일 실시예에 따르면, 주차장 중앙 관리 서버는 로컬 주차장 시스템에 진출입하는 차량의 주차 여부, 주차 시간, 주차 요금, 차량(주차장 사용자)의 멤버십 가입여부 확인, 로컬 주차장 시스템에 포함된 주차장 관 리 장치의 원격 제어 등 종합적인 주차장 서비스를 제공하기 위한 모든 동작과 외부 시스템으로부터 지정 차량의 추적을 요청받고 이에 대응하여 지정차량을 모니터링하는 모든 동작을 수행하도록 구성될 수 있다. 주차장 중앙 관리 서버는, 주차장 지정차량 추적 시스템에 포함된 각종 컴퓨팅 장치에서 동작하는 운 영 체제나 데이터베이스와 같은 시스템 프로그램과 통신할 수 있도록 구성된 적어도 하나의 프로그램 모듈 또는 루틴을 포함한 API(application programming interface), 주차장 중앙 관리 서버가 내부 또는 외부 의 구성과의 데이터 전송을 인식하고 처리하거나 전달할 수 있도록 구성된 노드(Node), 주차장 지정차량 시스템의 각종 콘텐츠를 저장하거나 처리하는 컴퓨터 또는 소프트웨어가 설치되는 웹서버(Web server)를 포함할 수 있다. 또한 주차장 중앙 관리 서버는 IP 사설교환기(Internet protocol private branch exchange, IP-PBX)를 더 포함할 수 있다. 추가 실시예에서, 로컬 주차장 시스템과 외부 시스템 은 각각의 장소에서 근무자들이 지정차량의 모니터링 상황을 파악할 수 있도록 로컬 상황실 및/또는 외부 상황실을 각각 더 포함할 수 있다. 이 경우에 IP 사설교환기는 공중 교환 전화망을 통해 복수 의 로컬 주차장 시스템의 로컬 상황실의 통화 장치와 연결될 수 있다. 또한, IP 사설교환기는 공중 교환 전화망을 통해 외부 시스템의 로컬 상황실의 통화장치와 연결될 수 있다. IP 사설교환기 는 통신 수요가 대량으로 발생하는 회사나 건물에 교환기를 설치하여 일정수의 국선을 내부의 모든 사용자 들이 공유하고, 내선에 연결되어 있는 내부 사용자들을 대상으로 내선 및 국선을 통한 전화 서비스를 제공해 주 기 위한 전화 교환 시스템으로, 이는 고객 서비스 센터의 모든 상담원들에게 일일이 일반 전화회선을 배정 하는 비용을 절감시켜 줄 수 있다. 주차장 중앙 관리 서버는 외부 시스템 서버으로부터 지정차량에 대한 추적을 요청받을 수 있다. 주 차장 중앙 관리 서버는 외부 시스템 서버로부터 지정차량에 대한 추적을 요청받을 경우, 지정차량에 대한 정보를 함께 수신할 수 있다. 따라서 주차장 중앙 관리 서버와 외부 시스템 서버는 공중 데이 터 교환망을 통해 연결될 수 있다. 또한, 주차장 중앙 관리 서버는 로컬 주차장 시스템에 포함된 주차장 관리 장치)로부터 차량 이 미지, 입차 시간, 출차 시간, 차량 번호 등 주차 관리에 필요한 정보를 수신받을 수 있다. 주차장 관리 장치 와 주차장 중앙 관리 서버는 공중 데이터 교환망을 통해 연결될 수 있다. 여기에서 주차장 중앙 관리 서버와 공중 데이터 교환망을 통해 연결되는 외부 시스템 및 로컬 주차장 시스템은 노드를 통해 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립하고 수립된 통신 채널 을 통해 데이터 및 신호를 전송하거나 수신할 수 있다. 이를 위하여 주차장 중앙 관리 서버, 외부 시스템 서버 및 주차장 관리 장치는 통신 모듈을 각각 포함할 수 있다. 통신 모듈은 컴퓨팅 장치에 포함된 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 IP 사설교환기(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 또한, 주차장 중앙 관리 서버, 외부 시스템 서버 및 주차장 관리 장치는 주변 기기들간 통신 방 식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 주차장 중앙 관리 서버는 외부 시스템으로부터 지정차량에 대한 정보를 제공받 을 수 있다. 지정차량에 대한 정보는 차량번호, 차종, 색상, 제조사, 수배위치, 긴급도, 매칭률 기준 중 적어 도 하나를 포함할 수 있다. 주차장 중앙 관리 서버는 외부 시스템으로부터 수신받은 지정차량에 대 한 정보를 데이터베이스에 저장할 수 있다. 다른 실시예에서, 주차장 중앙 관리 서버는 지정차량에 대한 정보에 대한 보안을 강화하기 위해 지정차량에 대한 정보를 외부의 보안 서버에 저장할 수 있다. 일 실시예에 따르면, 주차장 중앙 관리 서버는 로컬 주차장 시스템으로부터 로컬 주차장에 진입하거 나 진출하는 입출차 차량을 촬영한 입출차 차량 이미지를 수신받을 수 있다. 로컬 주차장 시스템은 입출차 차량 이미지를 촬영하는 시기 마다 주차장 중앙 관리 서버에 입출차 차량 이미지를 송신하거나, 또는 미리 정해진 시간 주기 마다, 촬영하여 저장해놓은 적어도 하나의 입출차 차량 이미지를 주차장 중앙 관리 서버 에 송신하도록 구성될 수 있다. 또한, 로컬 주차장 시스템은 로컬 주차장 시스템으로부터 입출 차 차량을 촬영한 입출차 차량 이미지와 함께 입출차 시간, 결제정보와 같은 부가정보를 주차장 중앙 관리 서버 에 더 송신할 수 있다. 일 실시예에 따르면, 주차장 중앙 관리 서버는 입출차 차량 이미지에 기초하여 촬영된 차량의 차량번호, 차종, 제조사, 색상과 같은 입출차 차량 정보를 인식할 수 있다. 도 3은 로컬 주차장 시스템에서 촬영한 입출 차 차량 이미지로부터 입출차 차량의 차량정보를 인식하는 일 예를 도시한다. 도 3를 참조하면, 주차장 중앙 관제 서버는 로컬 주차장 시스템로부터 수신한 입출차 차량 이미지 로부터 차량번호, 제조사, 차종 및 차량 모델을 인식할 수 있다. 예를 들어, 제1 이미지는 입출차 차량 이미지로부터 번호판 영역이 추출된 이미지 일 수 있다. 주차장 중앙 관제 서버는 번호판 영역 이 추출된 제1 이미지에서 OCR 엔진(예: Tesseract OCR Engine)을 이용하여 차량번호(예: 53하 6970)를 인식할 수 있다. 다른 예를 들어, 제2 이미지는 입출차 차량 이미지로부터 제조사 엠블럼이 추출된 이미지 일 수 있고, 제3 이미지는 입출차 차량 이미지로부터 차량의 전면 형태가 추출된 이미지일 수 있다. 주차장 중앙 관제 서버는 제2 이미지와 제3 이미지 중 적어도 하나를 이용하여 입출차 차량의 제조사, 차종 및 차량 모델을 인식할 수 있다. 이를 위하여 주차장 중앙 관제 서버는 인공지능(또 는, 기계학습, 딥러닝) 기술을 이용할 수 있다. 이는 입출차 차량 정보 중 일부를 인식하는 기본적인 과정을 예시할 뿐이며, 입출차 차량의 색상, 파손여부 등 을 더 감지할 수 있다. 또한 입출차 차량 정보를 인식하기 위해 영상처리 라이브러리 OpenCV를 활용한 특징점 검출, 매칭, 추적, 필터, 삼차원 투영변환 등 영상처리의 다양한 방법이 적용된 검출인식 알고리즘이 부가될 수 있다. 일 실시예에 따르면, 주차장 중앙 관리 서버는 지정차량 차량 정보와 입출차 차량 정보를 비교할 수 있다. 주차장 중앙 관리 서버는 지정차량 차량 정보와 입출차 차량 정보를 비교한 결과, 미리 결정된 정도 이상 으로 매칭률이 높은 것으로 판단되는 경우, 입출차 차량이 지정차량인 것으로 추정할 수 있다. 다시 말하면, 주차장 중앙 관리 서버는 지정차량 차량 정보와 입출차 차량 정보를 비교한 결과, 상호간 정보들이 일치하 는 정도가 미리 결정된 수준 이상인 것으로 판단된 경우, 지정차량이 로컬 주차장에서 발견한 것이라고 확인할 수 있다. 지정차량 차량 정보와 입출차 차량 정보를 비교하는 방법 및 기준에 대해서는 구체적으로 후술하기로 한다. 주차장 중앙 관리 서버는 입출차 차량이 지정차량인 것으로 추정되는 경우에, 외부 시스템에 이를 알 릴 수 있다. 예를 들어, 주차장 중앙 관리 서버는 외부 시스템에, 지정차량 정보, 입출차 차량 정보, 지정차량 정보와 입출차 차량 정보 사이의 일치하는 정도(이하, 매칭률로 지칭하기로 함)가 포함된 메세 지를 송신할 수 있다. 이를 통하여 지정차량이 주차장에 진입하는 경우에도 이에 대한 신속한 추적을 가능케 하여 피의자 검거 및 피해자 구조, 또는 미반납 렌터카 회수가 신속하게 이뤄질 수 있다. 추가 실시예에서, 주차장 중앙 관리 서버는 지정차량이 로컬 주차장에서 발견된 것이라고 확인하는 경우, 지정차량이 로컬 주차장을 벗어나지 못하도록 처리할 수 있다. 예를 들어 주차장 중앙 관리 서버는 로컬 주차장 시스템의 주차장 관리 장치에 지정차량이 주차장을 벗어나지 못하도록 차단장치를 내려 진출 입로를 차단하게 하는 신호(또는 명령어)를 로컬 주차장 시스템에 송신할 수 있다. 추가 실시예에서, 주차장 중앙 관리 서버는 지정차량이 로컬 주차장에서 발견된 것이라고 확인하는 경우, 이러한 사실을 로컬 주차장 시스템 및/또는 외부 시스템 각각의 상황실(222, 232)에서 근무하는 담당자와 실시 간으로 공유할 수 있는 통신 채널을 수립할 수 있다. 예를 들어, 주차장 중앙 관리 서버는 고객 서비스 (customer service, CS) 센터의 임의의 상담원의 컴퓨팅 장치에 지정차량에 관한 정보를 송신하여 상담원 으로 하여금 지정차량에 관한 정보들을 확인하게 할 수 있다. 또한, 주차장 중앙 관리 서버는 발견된 로 컬 주차장 시스템의 로컬 상황실과 통신 채널을 수립하여, 로컬 상황실의 담당자가 지정차량이 해당 로컬 주차장에서 발견되었다는 사실을 알게 하고 현재 로컬 주차장 상황에 대하여 실시간으로 공유할 수 있게 할 수 있다. 다른 예를 들어, 예를 들어, 주차장 중앙 관리 서버는 고객 서비스 센터와 지정차 량을 추적하도록 요청한 외부 시스템의 외부 상황실과 통신 채널을 수립하여, 로컬 상황실에서 근무하는 담당자와 지정차량이 해당 로컬 주차장에서 발견되었다는 사실을 알리고 현재 로컬 주차장의 상황에 대하여 실시간으로 공유할 수 있게 할 수 있다. 또한 다른 예를 들어, 주차장 중앙 관리 서버는 고객 서비스 센터 및 외부 시스템의 외부 상황실, 및 로컬 주차장 시스템의 로컬 상황실 사 이의 다중 통신 채널을 수립하여, 지정차량에 관련된 모든 사람이 현재 상황을 실시간으로 공유할 수 있도록 할 수 있다. 즉, 본 개시의 일 실시예에 따르는 주차장 지정차량 추적 시스템은 로컬 주차장에서 지정차량이 발견되는 경우, 로컬 주차장과 외부 시스템과의 실시간 통신 채널을 수립함으로써 어떠한 상황에서도 유연하게 대처할 수 있는 기회를 제공할 수 있다. 또한, 위 개시에서, 주차장 중앙 관리 서버, 외부 시스템 및 로컬 주차장 시스템은 본 개시에서 설명되는 기능 및 동작들을 수행하기 위하여, 어플리케이션 서버, 독립형 서버, 웹 서버 및 기타 데이터 송수신 기능, 데이터 식별 기능 및 데이터 처리 기능을 갖춘 임의의 컴퓨팅 장치로서 적어도 하나의 프로세서 및 프로 세서에 의해 상기 기능 및 동작들을 수행하도록 구성된 명령어(instruction)를 저장하는 메모리를 포함할 수 있 다. 도 4는 본 개시의 일 실시예에 따르는 주차장 지정차량 추적 시스템에 포함된 주차장 중앙 관리 서버에서 수행 되는 프로세스의 흐름도를 도시한다. 도 4의 흐름도가 나타내는 프로세스는 도 2에 예시된 주차장 중앙 관리 서버에 포함된 컴퓨팅 장치의 제어 하에서 수행될 수 있다. 프로세스는 단계 401에서 주차장 중앙 관리 서버가 외부 시스템으로부터 지정차량 정보를 수신하는 것에서 시작할 수 있다. 외부 시스템은 지정차량의 추적이 필요할 경우 해당 지정차량에 대한 정보를 주차장 중앙 관 리 서버에 송신할 수 있다. 이러한 지정차량에 대한 정보의 송신은 외부 시스템에 포함된 지정차량 데이터베이 스와 주차장 중앙 관리 서버에 포함된 지정차량 데이터베이스가 실시간으로 동기화 되는 것으로 이뤄질 수도 있 다. 지정차량에 대한 정보는 차량번호, 차종, 색상, 제조사, 수배위치, 긴급도 중 적어도 하나를 포함할 수 있 다. 단계 403에서 주차장 중앙 관리 서버는 로컬 주차장 시스템으로부터 입출차 차량 정보를 수신하는 것에 응답하 여, 지정차량 정보와 수신한 입출차 차량 정보를 비교할 수 있다. 다양한 실시예에서, 외부 시스템는 복수개 일 수 있고, 그로부터 수신되는 지정차량에 대한 정보 또한 복수개 일 수 있어서, 지정차량 정보와 수신한 입출 차 차량 정보를 비교하는 동작은, 입출차 차량 정보가 수신될 때 마다 데이터베이스에 저장되어 있는 복수의 입 출차 차량 정보 각각과 비교하는 동작을 포함할 수 있다. 그 다음 단계 405에서 주차장 중앙 관리 서버는 지정차량 차량 정보와 입출차 차량 정보를 비교한 결과, 그 매 칭률이 미리 결정된 수준 이상인 것으로 판단되는 경우, 지정차량이 로컬 주차장 시스템에서 발견한 것으로 결 정하고 단계 407로 진행될 수 있다. 이와 달리, 주차장 중앙 관리 서버는 지정차량 차량 정보와 입출차 차량 정보를 비교한 결과, 그 매칭률 미리 결정된 수준 이상이 아닌 것으로 판단되는 경우, 다시 단계 403으로 돌아 가, 로컬 주차장 시스템으로부터 새롭게 수신되는 입출차 차량 정보와 지정차량 정보를 비교할 수 있다. 단계 407에서 주차장 중앙 관리 서버는 로컬 주차장 시스템에서 지정차량이 발견된 것으로 판단되는 경우, 이를 해당 지정차량에 대한 추적을 요청한 외부 시스템에 지정차량이 발견된 사실을 알리는 신호를 외부 시스템에 송 신할 수 있다. 지정차량이 발견된 사실을 알리는 신호는 지정차량과 매칭된 입출차 차량 정보와 해당 로컬 주 차장 시스템의 정보(예를 들어, 로컬 주차장의 이름, 위치 등)와 함께 송신될 수 있다. 이에 따라, 경찰청, 국 세청, 렌터카 사업체, 및 차량 공유 서비스 업체 같은 외부 주체가 운영하는 외부 시스템은 주차장에 진입하는 지정차량을 신속하게 확인하고 처리할 수 있다. 일 실시예에서, 프로세스는 주차장 중앙 관리 서버와 연동되는 고객 서비스 센터와 로컬 주차장의 로컬 상 황실 및/또는 외부 시스템의 외부 상황실 사이의 (다중) 음성 통화를 위한 통신 채널을 수립하는 단계 409를 선 택적으로 더 포함할 수 있다. 이에 따라 본 개시의 일 실시예에 따른 주차장 지정차량 추적 시스템은 지정차량 에 대한 상황을 관련된 담당자들이 실시간으로 공유할 수 있도록 지원할 수 있다. 일 실시예에서, 주차장 중앙 관리 서버는 고객 서비스 센터의 복수의 상담원 중 대기중인 임의의 상담원을 지정하고, 지정된 상담원이 사용 하는 모니터링 장치에 지정차량에 관한 모든 정보를 제공할 수 있다. 지정된 상담원은 지정차량이 발견된 로컬 주차장의 로컬 상황실과 발견된 지정차량의 추적을 요청한 외부 시스템의 외부 상황실을 연결할 수 있다. 도 5는 본 개시의 일 실시예에 따르는 주차장 지정차량 추적 시스템에 포함된 주차장 중앙 관리 서버에서 입출 차 차량 정보와 지정차량 정보를 비교하는 프로세스의 구체적 흐름도를 도시한다. 도 5에 도시된 프로세는 도 4의 단계 403을 구체적으로 도시한 흐름도일 수 있다. 도 5를 참조하면, 단계 501에서 주차장 중앙 관리 서버는 적어도 하나 이상의 항목을 포함하는 입출차 차량 정 보 중에서 지정차량 정보와 대응되는 항목을 비교대상을 구분할 수 있다. 지정차량 정보와 입출차 차량 정보는 차량번호, 차종, 색상, 제조사, 수배위치, 긴급도 중 적어도 하나를 선택적으로 포함할 수 있다. 예를 들어, 지정차량 정보가 차량번호만을 포함하는 경우, 주차장 중앙 관리 서버는 차량번호, 차종, 색상 등을 포함하는 입출차 차량 정보 중에서 차량번호만을 비교대상으로 구분할 수 있다. 다른 예를 들면, 지정차량 정보가 차량 번호, 차종, 제조사를 포함하고, 입출차 차량 정보가 차량번호, 차종, 색상을 포함하는 경우, 주차장 중앙 관리 서버는 양 정보들 중에서 중첩되는 차량번호, 차종만을 비교대상으로 구분할 수 있다. 단계 503에서 주차장 중앙 관리 서버는 비교대상으로 구분된 항목들을 가중치에 기초하여 비교하고 매칭률을 계 산할 수 있다. 가중치는 항목들마다 달리 부여될 수 있다. 가중치는 항목들의 중요도에 따라 다른 값을 가질 수 있다. 일 실시예에서, 지정차량을 차량번호만을 가지고 추적하고 싶은 경우에는, 차량번호에 가중치 1을 부 여하고, 다른 항목들에는 가중치 0이 부여될 수 있다. 예를 들어, 차량번호 전체가 일치하는 경우 지정차량을 발견한 것으로 결정할 수 있지만, 차량번호 중 하나라도 불일치하는 경우에는 지정차량이 아닌 것으로 결정할 수 있다. 일 실시예에서, 프로세스는 선택적으로 수배위치에 기초하여 계산된 매칭률을 보정하는 단계를 선택적으로 더 포함할 수 있다. 예를 들어, 지정차량의 수배위치가 서울인 경우, 지정차량으로 추정되는 입출차 차량이 발 견된 로컬 주차장의 위치가 각각 대전, 대구, 부산인 경우, 거리별 위치 가중치가 달리 결정될 수 있다. 도 6 은 수배위치와 지정차량으로 추정되는 입출차 차량이 발견된 로컬 주차장의 위치에 따라 결정되는 위치 가중치 를 나타낸 도면이다. 도 6을 참조하면, 위지정차량 위치(또는 수배 요청위치, 지정차량의 마지막 위치)로부터 멀어짐에 따라 위치 가중치가 적어질 수 있다. 아래 표 1 및 2를 통해, 입출차 차량 정보와 지정차량 정보의 매칭률을 계산하는 경우를 구체적으로 살펴보기로 한다. 표 1 항목 가중치 지정차량 정보 입출차 차량 정보 항목별 매칭점수 차량번호 1 55거7516 54거1616 0.5 (1*3/6) (6개의 번호중 3개 일치) 차종 0.8 중형차 트럭 0(=0.8*0) 색상 0.6 회색 회색 0.6(0.6*1) 제조사 0.6 현데 불명 - 수배위치 - 서울시 마포구 경기도 수원시 거리 가중치 0.95 총 매칭률 (0.5+0+0.6)/(총가중치 2.4(제조사 제외))*100= 45.8% 위치정보 고려 45.8*0.95(거리별 가중치 계산)=43.51% 표 1이 나타내는 일 예는, 외부 시스템이가 송신한 지정차량의 정보 중 차량 번호는 “55거7516”차종은 '중형 차', 차종은 '회색', 제조사는 '현데'인 상황을 상정한다. 이 때, 로컬 주차장 시스템이 송신한 이미지로부터 인식된 입출차 차량 정보는 차량번호는 “54거1616”차종은 '트럭', 색상은 '회색', 제조사는 불명인 것을 가정 해보자. 먼저 차량번호를 비교하면, 지정차량 정보의 차량번호 “55거7516”중 일치하는 숫자는 3개에 불과하다. 따라 서, 6개의 번호 중 3개의 번호가 일치하므로 0.5의 점수가 부여될 수 있고, 가중치 1이 반영된다면, 차량번호 매칭점수는 0.5로 결정될 수 있다. 다른 실시예에서, 이러한 경우에 차량번호 전체가 일치하지 않으므로, 또는 6개의 차량번호중 4개 이상이 일치하지 않으므로 다른 항목을 비교할 것도 없이 지정차량이 아니라고 결정할 수 도 있다. 다음 항목으로 차종을 비교하면, 지정차량 정보의 차종은 중형(승용차)인데 입출차 차량 정보의 차종은 트럭으 로 인식된 경우에는, 트럭과 승용차는 완전히 다른 종류이기 때문에 차종 항목에 대한 매칭점수는 0점이 될 수 있다. 또다른 실시예에서, 지정차량 정보의 차종이 소형(승용차)이고 입출차 차량정보의 차종은 중형(승용차) 인 경우에 양 차종은 지정차량 정보의 신뢰성과 입출차 차량 정보의 인식률의 오차범위를 고려하여 일정 매칭점 수가 부여될수 도 있다. 다음 항목으로 차종을 비교하면, 지정차량 정보의 차종은 중형(승용차)인데 입출차 차량 정보의 차종은 트럭으 로 인식된 경우에는, 트럭과 승용차는 완전히 다른 종류이기 때문에 차종 항목에 대한 매칭점수는 0점이 될 수 있다. 다음 항목으로 색상을 비교하면, 지정차량 정보의 색상은 “회색”으로 주어지고, 입출차 차량 정보의 색상도 '회색'으로 인식된 경우, 매칭점수는 1점으로 될 수 있고, 가중치를 반영하면 0.6점이 될 수 있다. 위 항목들에 대한 매칭점수를 기초로 총 매칭률을 계산해보면, 차량번호의 매칭점수 0.5와 색상 매칭점수 0.6를 더한 총점에 총 가중치인 2.4를 나눠 매칭률을 계산할 수 있다. 이 경우 총 매칭률은 45.8%가 될 수 있다. 여기에 위치 가중치를 반영하여 매칭률을 계산하면, 지정차량 정보의 수배위치는 “서울시 마포구”이고 입출차 차량에 진입 또는 진출한 로컬 주차장 시스템의 위치는 “경기도 수원시”에 위치할 수 있다. 거리에 따른 위 치 가중치에 대한 기준은 미리 결정될 수 있고, 이 경우 위치 가중치는 0.95라고 가정한다. 따라서, 위에서 계 산된 총 매칭률 45.8%에 위치 가중치를 반영하면 거리 가중치를 반영한 총 매칭률은 43.51%가 될 수 있다. 표 2 항목 가중치 지정차량 정보 입출차 차량 정보 항목별 매칭점수 차량 번호1 55거*516 55거1576 0.8 (=1*4/5) (5개의 번호중 4개 일치) 차종 0.8 중형차 중형차 0.8(=0.8*1) 색상 0.6 회색 흰색 0.48(=0.6*0.8)(회색과 흰색의 유 사성 고려 0.8로 계산) 제조사 0.6 현데 현대 0.6(=0.6*1) 수배 위치- 서울시 마포구 강원도 씨마크씨마크 호 텔거리 가중치 0.7 총 매칭률 (0.8+0.8+0.48+0.6)/(총가중치 3)*100= 89.2% 수배위치 고려 89.2*0.7(거리별 가중치 계산)=62.3% 표 2가 나타내는 일 예는 표 1에서 설명한 바와 같이 계산하는 경우, 총 매칭률이 89.2%로 계산될 수 있다. 지 정차량 정보에 포함된 매칭률 기준이 85%인 경우, 입출차 차량이 지정차량인 것으로 결정할 수 있다. 다만 이 예에서 수배위치 가중치가 반영되는 경우, 62.3%가 되어 기준 매칭률에 미달하여 지정차량이 아닌 것으로 결정 될 수도 있다. 이상, 표 1 및 표 2를 통해 설명한 매칭률 계산은 본 개시의 일 예시에 불과하며, 복수의 항목에 가중치를 부여 하여 매칭률을 계산하는 모든 계산 방법이 본 개시의 일 실시예로 채용될 수 있음은 자명하다. 본 개시의 일 실시예에 따른 지정차량 추적 시스템은 하나 이상의 차량정보를 비교하여 결정하는 매칭률을 채택 함으로써, 지정차량에 대한 정확한 정보(예: 차량번호)가 부재하더라도 지정차량의 추적을 가능케하고, 입출차 차량의 차량정보를 획득하는 과정에서 미인식 또는 오인식이 발생하더라도 신뢰도 높은 지정차량의 추적을 가능 케할 수 있다. 도 7은 본 개시의 적어도 일부 실시예에 따라, 주차장 지정차량 추적 시스템에 포함된 엔티티(entity)에서 이용 될 수 있는 예시적인 컴퓨터 프로그램 제품을 도시한다. 예시적인 컴퓨터 프로그램 제품은 예컨대, 신호 포함 매체를 이용하여 제공된다. 일부 실시예에서, 하나 이상의 컴퓨터 프로그램 제품의 신호 포함 매체는 컴퓨터 판독 가능 매체, 기록 가능 매체 및/또는 통신 매체를 포함할 수 있다. 신호 포함 매체에 포함된 명령어(instructions)는, 예컨대, 도 2에 예시된, 주차장 중앙 관리 서버 , 외부 시스템 서버, 로컬 주차장 시스템의 주차장 관리 장치 및 고객 서비스 센터에 포함된 컴퓨팅 장치에 의해 실행될 수 있다. 명령어는 실행되면, 컴퓨팅 장치로 하여금 주차장 고객 응대 를 위한 동작들을 수행하게 할 수 있다."}
{"patent_id": "10-2019-0155440", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야 만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수도 있다. 이상, 본 개시에서 청구하고자 하는 대상에 대해 구체적으로 살펴보았다. 본 개시에서 청구된 대상은 앞서 기 술한 특정 구현예로 그 범위가 제한되지 않는다. 예컨대, 어떤 구현예에서는 장치 또는 장치의 조합 상에서 동 작 가능하게 사용되는 하드웨어의 형태일 수 있으며, 다른 구현예에서는 소프트웨어 및/또는 펌웨어의 형태로 구현될 수 있고, 또 다른 구현예에서는 신호 베어링 매체, 저장 매체와 같은 하나 이상의 물품을 포함할 수 있 다. 여기서, CD-ROM, 컴퓨터 디스크, 플래시 메모리 등과 같은 저장 매체는, 예컨대 컴퓨팅 시스템, 컴퓨팅 플 랫폼 또는 기타 시스템과 같은 컴퓨팅 장치에 의하여 실행될 때 앞서 설명한 구현예에 따라 해당 프로세서의 실 행을 야기시킬 수 있는 명령을 저장할 수 있다. 이러한 컴퓨팅 장치는 하나 이상의 처리 유닛 또는 프로세서, 디스플레이, 키보드 및/또는 마우스와 같은 하나 이상의 입/출력 장치, 및 정적 랜덤 액세스 메모리, 동적 랜덤 액세스 메모리, 플래시 메모리 및/또는 하드 드라이브와 같은 하나 이상의 메모리를 포함할 수 있다. 한편, 시스템을 하드웨어로 구현할 것인지 아니면 소프트웨어로 구현할 것인지는, 일반적으로 비용 대비 효율의 트레이드오프를 나타내는 설계상 선택 문제이다. 본 개시에서는 프로세스, 시스템, 기타 다른 기술들의 영향을 받을 수 있는 다양한 수단(예를 들어, 하드웨어, 소프트웨어 및/또는 펌웨어)이 있으며, 선호되는 수단은 프로 세스 및/또는 시스템 및/또는 다른 기술이 사용되는 맥락(context)에 따라 변경될 것이다. 예를 들어, 구현자 가 속도 및 정확성이 가장 중요하다고 결정한다면, 구현자는 주로 하드웨어 및/또는 펌웨어 수단을 선택할 수 있으며, 유연성이 가장 중요하다면, 구현자는 주로 소프트웨어 구현을 선택할 수 있으며; 또는, 다른 대안으로 서, 구현자는 하드웨어, 소프트웨어 및/또는 펌웨어의 어떤 결합을 선택할 수 있다. 전술한 상세한 설명에서는 블록도, 흐름도 및/또는 기타 예시를 통해 장치 및/또는 프로세스의 다양한 실시예를 설명하였다. 그러한 블록도, 흐름도, 및/또는 기타 예시는 하나 이상의 기능 및/또는 동작을 포함하게 되며, 당업자라면 블록도, 흐름도 및/또는 기타 예시 내의 각각의 기능 및/또는 동작이 하드웨어, 소프트웨어, 펌웨어, 또는 이들의 임의의 조합에 의해 개별적으로 혹은 집합적으로 구현될 수 있다는 점을 이해할 수 있을 것이다. 일 실시예에서, 본 개시에 기재된 대상의 몇몇 부분은 ASIC(Application Specific Integrated Circuit), FPGA(Field Programmable Gate Array), DSP(Digital Signal Processor) 또는 다른 집적의 형태를 통 해 구현될 수 있다. 이와 달리, 본 개시의 실시예의 일부 양상은 하나 이상의 컴퓨터 상에 실행되는 하나 이상 의 컴퓨터 프로그램(예를 들어, 하나 이상의 컴퓨터 시스템 상에 실행되는 하나 이상의 프로그램), 하나 이상의 프로세서 상에서 실행되는 하나 이상의 프로그램(예를 들어, 하나 이상의 마이크로프로세서 상에서 실행되는 하 나 이상의 프로그램), 펌웨어 또는 이들의 실질적으로 임의의 조합으로써 전체적으로 또는 부분적으로 균등하게 집적 회로에서 구현될 수도 있으며, 소프트웨어 및/또는 펌웨어를 위한 코드의 작성 및/또는 회로의 설계는 본 개시에 비추어 당업자의 기술 범위 내에 속하는 것이다. 또한, 당업자라면, 본 개시의 대상의 매커니즘들이 다 양한 형태의 프로그램 제품으로 분배될 수 있음을 이해할 것이며, 본 개시의 대상의 예시는 분배를 실제로 수행 하는 데 사용되는 신호 베어링 매체의 특정 유형과 무관하게 적용됨을 이해할 것이다. 특정 예시적 기법이 다양한 방법 및 시스템을 이용하여 여기에서 기술되고 도시되었으나, 당업자라면, 청구된 대상에서 벗어남이 없이, 다양한 기타의 수정 또는 등가물로의 치환 가능성을 이해할 수 있다. 추가적으로, 여 기에 기술된 중심 개념으로부터 벗어남이 없이 특정 상황을 청구된 대상의 교시로 적응시키도록 많은 수정이 이 루어질 수 있다. 따라서, 청구된 대상이 개시된 특정 예시로 제한되지 않으나, 그러한 청구된 대상은 또한 첨 부된 청구범위 및 그 균등의 범위 내에 들어가는 모든 구현예를 포함할 수 있음이 의도된다. 본 개시 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우 뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한, 본 개시 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경 우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 나아가, 본 개시 전체에서, 어떤 부분 이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본 개시에서 사용되는 정도의 용어 \"약,\" \"실질적 으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미 로 사용되고, 본원의 이해를 돕기 위해 정확하거나 절대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 개시의 범위는 전술한 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의 미 및 범위, 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2019-0155440", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 지정차량 모니터링 시스템을 나타낸 구성도이다. 도 2는 일 실시예에 따른 지정차량 추적 시스템에서 수행되는 프로세스를 개략적으로 도시한다. 도 3은 로컬 주차장 시스템에서 촬영한 입출차 차량 이미지로부터 입출차 차량의 차량정보를 인식하는 일 예를 도시한다. 도 4는 본 개시의 일 실시예에 따르는 주차장 지명 차량 추적 시스템에 포함된 주차장 중앙 관리 서버에서 수 행되는 프로세스의 흐름도를 도시한다. 도 5는 본 개시의 일 실시예에 따르는 주차장 지명 차량 추적 시스템에 포함된 주차장 중앙 관리 서버에서 입출 차 차량 정보와 지명 차량 정보를 비교하는 프로세스의 구체적 흐름도를 도시한다. 도 6은 수배위치와 지명 차량으로 추정되는 입출차 차량이 발견된 로컬 주차장의 위치에 따라 결정되는 위치 가 중치를 나타낸 도면이다. 도 6은 일 실시예에 따른 주차장 고객 응대를 위한 중앙 관제 시스템에서 로컬 주차장 시스템을 확인하는 프로 세스의 흐름도를 도시한다. 도 7은 본 개시의 적어도 일부 실시예에 따라, 주차장 지명 차량 추적 시스템에 포함된 엔티티(entity)에서 이 용될 수 있는 예시적인 컴퓨터 프로그램 제품을 도시한다."}
