{"patent_id": "10-2025-7003037", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038240", "출원번호": "10-2025-7003037", "발명의 명칭": "무선 통신 시스템에서의 엔티티 및 그에 의해 수행되는 방법", "출원인": "삼성전자주식회사", "발명자": "왕 얀루"}}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법에 있어서,적어도 하나의 정보를 보고하라는 요청 ― 상기 요청은 상기 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제2 엔티티에, 송신하는 단계; 및상기 요청에 기반하여, 상기 적어도 하나의 정보의 상기 보고에 관한 정보를 포함하는 응답을, 상기 제2 엔티티로부터, 수신하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 정보의 상기 보고에 관한 상기 정보는 보고될 수 없는 정보를 나타내는 제1 필드 또는 셀별로 보고될 수 없는 정보를 나타내는 제2 필드 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 응답은 상기 보고의 실패의 원인을 나타내는 원인 정보를 포함하는, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 엔티티 및 상기 제2 엔티티는 차세대-무선 액세스 네트워크(next generation-radio access network,NG-RAN) 노드들인, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법에 있어서,적어도 하나의 정보를 보고하라는 요청 ― 상기 요청은 상기 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제1 엔티티로부터, 수신하는 단계; 및상기 요청에 기반하여, 상기 적어도 하나의 정보의 상기 보고에 관한 정보를 포함하는 응답을, 상기 제1 엔티티에, 송신하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 적어도 하나의 정보의 상기 보고에 관한 상기 정보는 보고될 수 없는 정보를 나타내는 제1 필드 또는 셀별로 보고될 수 없는 정보를 나타내는 제2 필드 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 응답은 상기 보고의 실패의 원인을 나타내는 원인 정보를 포함하는, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 제1 엔티티 및 상기 제2 엔티티는 차세대-무선 액세스 네트워크(next generation-radio access network,공개특허 10-2025-0038240-3-NG-RAN) 노드들인, 방법."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 시스템에서의 제1 엔티티에 있어서,송수신부; 및상기 송수신부에 결합되는 프로세서;를 포함하며,상기 프로세서는,적어도 하나의 정보를 보고하라는 요청 ― 상기 요청은 상기 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제2 엔티티에, 송신하며; 및상기 요청에 기반하여, 상기 적어도 하나의 정보의 상기 보고에 관한 정보를 포함하는 응답을, 상기 제2 엔티티로부터, 수신하도록구성되는, 제1 엔티티."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 적어도 하나의 정보의 상기 보고에 관한 상기 정보는 보고될 수 없는 정보를 나타내는 제1 필드 또는 셀별로 보고될 수 없는 정보를 나타내는 제2 필드 중 적어도 하나를 포함하는, 제1 엔티티."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 응답은 상기 보고의 실패의 원인을 나타내는 원인 정보를 포함하는, 제1 엔티티."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 제1 엔티티 및 상기 제2 엔티티는 차세대-무선 액세스 네트워크(next generation-radio access network,NG-RAN) 노드들인, 제1 엔티티."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 시스템에서의 제2 엔티티에 있어서,송수신부; 및상기 송수신부에 결합되는 프로세서;를 포함하며,상기 프로세서는,적어도 하나의 정보를 보고하라는 요청 ― 상기 요청은 상기 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제1 엔티티로부터, 수신하며; 및상기 요청에 기반하여, 상기 적어도 하나의 정보의 상기 보고에 관한 정보를 포함하는 응답을, 상기 제1 엔티티에, 송신하도록구성되는, 제2 엔티티."}
{"patent_id": "10-2025-7003037", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 적어도 하나의 정보의 상기 보고에 관한 상기 정보는 보고될 수 없는 정보를 나타내는 제1 필드 또는 셀별로 보고될 수 없는 정보를 나타내는 제2 필드 중 적어도 하나를 포함하는, 제2 엔티티.공개특허 10-2025-0038240-4-청구항 15 제13항에 있어서,상기 응답은 상기 보고의 실패의 원인을 나타내는 원인 정보를 포함하는, 제2 엔티티."}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 LTE와 같은 4G 통신 시스템 후의 더 높은 데이터 전송 비율을 지원하기 위한 5G 또는 6G 통신 시스템 에 관한 것이다. 무선 통신 시스템에서의 엔티티와 그것에 의해 수행되는 방법을 제공한다. 본 개시의 실시예에 따른 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법이, 적어도 하나의 정보를 보고하라는 요청 ― 해당 요청은 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제2 엔티티에, 송신 하는 단계; 및 해당 요청에 기반하여, 적어도 하나의 정보의 보고에 관한 정보를 포함하는 응답을, 제2 엔티티로 부터, 수신하는 단계를 포함할 수 있다."}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신의 기술 분야에 관한 것이고, 더 구체적으로는, 무선 통신 시스템에서의 엔티티와 그에 의 해 수행되는 방법에 관한 것이다."}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 모바일 통신 기술들은 높은 전송 속도들 및 새로운 서비스들이 가능하도록 넓은 주파수 대역들을 정의하고, 3.5GHz와 같은 \"Sub 6GHz\" 대역들에서뿐 아니라 28GHz 및 39GHz를 포함하는 mmWave라고도 하는 \"Above 6GHz\" 대역들에서도 구현될 수 있다. 추가적으로, 5G 모바일 통신 기술들보다 50배 빠른 전송 속도들과 5G 모바일 통 신 기술들의 1/10인 초저 레이턴시들을 성취하기 위하여 테라헤르츠 대역들(예를 들어, 95GHz 내지 3THz 대역들)에서 6G 모바일 통신 기술들(Beyond 5G 시스템들이라고 함)을 구현하는 것이 고려되었다. 5G 모바일 통신 기술들의 개발의 초반에, 초광대역 서비스(enhanced Mobile BroadBand, eMMB), URLLC 고신뢰/ 초저지연 통신(Ultra Reliable Low Latency Communications, URLLC), 및 대규모 기계식 통신(massive Machine- Type Communications, mMTC)에 관련하여 서비스들을 지원하고 성능 요건들을 충족시키기 위하여, 초고주파 대역 에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), mmWave 자원들 및 슬롯 포맷들의 동적 운영을 효율적으로 이용하기 위한 (예를 들어, 여 러 부반송파(subcarrier) 공간(spacing)을 운영하는) 뉴머롤로지들의 지원, 멀티-빔 송신 및 광대역들을 지원하 기 위한 초기 액세스 기술들, BWP(BandWidth Part)의 정의 및 운용, 다량의 데이터 송신을 위한 LDPC(Low Density Parity Check) 코드와 제어 정보의 고도로 신뢰성 있는 송신을 위한 폴라 코드(Polar Code)와 같은 새 로운 채널 코딩 방법들, L2 프리-프로세싱, 및 특정 서비스에 특화된 전용 네트워크를 제공하기 위한 네트워크 슬라이싱에 관한 표준화가 진행중이다. 현재, 5G 모바일 통신 기술들에 의해 지원될 서비스들의 측면에서 초기 5G 모바일 통신 기술들의 개선 (improvement) 및 성능 향상(enhancement)에 관해 논의들이 진행중이고, 차량들에 의해 송신된 차량들의 위치들 및 상태들에 관한 정보에 기반하여 자율주행 차량들에 의한 주행 결정을 돕고 사용자 편의성을 향상시키기 위한 V2X(Vehicle-to-everything), 비면허 대역들에서 다양한 규제 관련 요건들에 부합하는 시스템 운용들을 목표로 하는 NR-U(New Radio Unlicensed), NR UE(User Equipment) 전력 절약, 지상 네트워크들과의 통신이 이용 불가 능한 영역에서 커버리지를 제공하기 위한 UE-위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 및 측위와 같은 기술들에 관한 물리 계층 표준화가 있다. 더구나, 다른 산업들과의 상호연동 및 융합을 통해 새로운 서비스들을 지원하는 지능형 공장(Industrial Internet of Things, IIoT), 무선 백홀 링크 및 액세스 링크를 통합된 방식으로 지원함으로써 네트워크 서비스 영역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상(mobility enhancement), 및 랜덤 액세스(random access) 절차들을 단순화하기 위한 2-스텝 랜덤 액세스(NR을 위한 2단계 RACH)와 같은 기술 들에 관해 에어 인터페이스 아키텍처/프로토콜에서 표준화가 진행되고 있다. 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정의 네트워킹(Software-Defined Networking, SDN) 기술들을 결합하기 위한 5G 베이스라인 아키텍처(예를 들어, 서비스 기반 아키텍처(Service based Architecture) 또는 서 비스 기반 인터페이스(Service based Interface)), 및 UE 위치들에 기반하여 서비스들을 수신하기 위한 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC)에 관해 시스템 아키텍처/서비스에서 또한 표준화가 진행되고 있다. 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이 며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상 된다. 이를 위해, 증강 현실 AR(Augmented Reality, AR), 가상 현실 VR(Virtual Reality, VR), 혼합 현실MR(Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실 XR(eXtended Reality, XR), 인공지능 (Artificial Intelligence, AI) 및 머신 러닝(Machine Learning, ML)을 이용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지원, 메타버스 서비스 지원, 및 드론 통신에 관련하여 새로운 연구가 예정되어 있다. 더욱이, 이러한 5G 모바일 통신 시스템들의 발전은 6G 모바일 통신 기술들의 테라헤르츠 대역들에서의 커버리지 를 제공하기 위한 신규 파형들, 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나들 및 대규 모 안테나들과 같은 멀티-안테나 송신 기술들, 테라헤르츠 대역 신호들의 커버리지를 개선하기 위한 메타물질 기반 렌즈들 및 안테나들, OAM(Orbital Angular Momentum)을 이용한 고차원 공간 다중화 기술, 및 RIS(Reconfigurable Intelligent Surface)뿐 아니라, 6G 모바일 통신 기술들의 주파수 효율을 증가시키고 시스 템 네트워크들을 개선하기 위한 전이중 기술, 위성들 및 AI(Artificial Intelligence)를 설계 단계에서부터 이 용하고 종단간(end-to-end) AI 지원 기능(function)들을 내재화하여 시스템 최적화를 구현하는 AI 기반 통신 기 술, 및 UE 운영 능력(capability)의 한계를 넘어서는 복잡도 수준들에서 서비스들을 초고성능 통신 및 컴퓨팅 자원들을 이용하여 구현하는 차세대 분산 컴퓨팅 기술 또한 개발하기 위한 기반으로서 역할을 할 것이다."}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시예들은 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법을 제공하며, 이 방법은, 적어도 하나의 정보를 보고하라는 요청 ― 요청은 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제2 엔티티에, 송신하는 단계; 및 해당 요청에 기반하여, 적어도 하나의 정보의 보고에 관한 정 보를 포함하는 응답을, 제2 엔티티로부터, 수신하는 단계를 포함한다. 본 개시의 실시예들은 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법을 제공하며, 이 방법은, 적어도 하나의 정보를 보고하라는 요청 ― 요청은 적어도 하나의 정보의 예측이 적용되는 시점을 나타내는 시간 정보를 포함함 ― 을, 제1 엔티티로부터, 수신하는 단계; 및 해당 요청에 기반하여, 적어도 하나의 정보의 보고에 관한 정보를 포함하는 응답을, 제1 엔티티에, 송신하는 단계를 포함한다. 본 개시의 실시예들은 무선 통신 시스템에서의 제1 엔티티를 제공하며, 이는, 송수신부; 및 송수신부에 결합되 는 프로세서를 포함하고 해당 프로세서는 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제1 엔티티에 의 해 수행되는 방법들을 수행하도록 구성된다. 본 개시의 실시예들은 무선 통신 시스템에서의 제2 엔티티를 제공하며, 이는, 송수신부; 및 송수신부에 결합되 는 프로세서를 포함하고 해당 프로세서는 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제2 엔티티에 의 해 수행되는 방법들을 수행하도록 구성된다."}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부 도면들을 참조한 다음의 설명은 청구항들 및 그것들의 동등물들에 의해 정의된 바와 같은 본 개시의 다양 한 실시예들의 포괄적인 이해를 돕기 위해 제공된다. 해당 이해를 돕기 위한 다양한 특정 세부사항들이 포함되"}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "지만 이들 세부사항들은 단지 예시적인 것으로 간주되어야 한다. 따라서, 본 기술분야의 통상의 기술자들은 본 개시에서 설명되는 다양한 실시예들의 다양한 변경들 및 수정들이 본 개시의 범위 및 정신으로부터 벗어남 없이 이루어질 수 있다는 것을 인식할 것이다. 추가적으로, 널리 공지된 기능들 및 구성들의 설명들은 명료함 및 간 결함을 위해 생략될 수 있다. 다음의 설명 및 청구항들에서 사용되는 용어들 및 단어들은 서지적 의미로 제한되지 않고, 본 개시의 명확하고 일관된 이해를 가능하게 하기 위해 발명자에 의해 사용될 뿐이다. 따라서, 본 개시의 다양한 실시예들의 다음의 설명이 예시 목적만으로 제공되고 첨부의 청구항들 및 그것들의 동등물들에 의해 정의된 바와 같이 본 개시를"}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "제한할 목적이 아님은 본 기술분야의 통상의 기술자들에게 명백해야 한다. \"a\", \"an\", 및 \"the\"의 사용에 해당하는 단수형들은 그렇지 않다고 분명히 알려주지 않는 한 복수 언급들을 포 함한다는 것이 이해되어야 한다. 따라서, 예를 들어, \"구성요소 표면\"에 대한 언급은 하나 또는 이상의 이러한 표면들의 언급을 포함한다. \"포함한다\" 또는 \"포함할 수 있다\"라는 용어는 본 개시의 여러 실시예들에서 사용될 수 있는 해당하는 개시된 기능, 동작 또는 구성요소의 존재를 의미하고 하나 이상의 추가적인 기능, 동작, 또는 구성요소를 제한하지 않 는다. \"포함한다\" 및/또는 \"갖는다\"와 같은 용어들은 특정한 특성, 수, 단계, 동작, 구성 요소, 컴포넌트 또는 그것들의 조합을 나타내는 것으로 해석될 수 있지만, 하나 이상의 다른 특성, 숫자, 단계, 동작, 구성 요소, 컴 포넌트 또는 그 조합들의 존재 또는 추가의 가능성을 배제하는 것으로 해석될 수 없다. 본 개시의 여러 실시예들에서 사용되는 \"또는\"이란 용어는 나열된 단어들의 임의의 또는 모든 조합들을 포함한 다. 예를 들어, \"A 또는 B\"라는 표현은 A를 포함할 수 있거나, B를 포함할 수 있거나, 또는 A 및 B 둘 다를 포 함할 수 있다. 다르게 정의되지 않는 한, 기술적 용어들 또는 과학적 용어들을 포함하는 본 개시에서 사용되는 모든 용어들은,"}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "본 개시가 속하는 본 기술분야의 통상의 기술자에 의해 이해되는 바와 동일한 의미를 가진다. 일반적으로 사용 되는 사전에서 정의된 것들과 같은 이러한 용어들은 관련 기술 분야에서의 맥락상 의미와 동일한 의미를 갖는 것으로 해석되어야 하고, 본 개시에서 명확하게 정의되지 않는 한 이상적이거나 과도하게 형식적인 의미를 갖는 것으로 해석되지 않아야 한다. 4G 통신 시스템의 전개 이후로 무선 데이터 통신 서비스들에 대한 증가하는 수요를 충족시키기 위하여, 개선된 5G 또는 pre-5G 통신 시스템을 개발하기 위한 노력들이 이루어졌다. 그러므로, 5G 또는 pre-5G 통신 시스템은 \"4G 이후(beyond) 네트워크\" 또는 \"포스트(post) LTE 시스템\"이라 또한 지칭된다. 무선 통신이 현대 역사적으로 가장 성공적인 혁신들 중 하나이다. 최근에, 무선 통신 서비스들의 가입자들의 수 가 오십억을 초과하였고, 계속 빠르게 성장하고 있다. 소비자들 및 기업들에서 스마트 폰들 및 다른 모바일 데 이터 디바이스들(이를테면 태블릿 컴퓨터들, 노트북 컴퓨터들, 넷북들, 전자책 리더들 및 머신-유형 디바이스들)의 인지도가 증가함에 따라 무선 데이터 서비스들에 대한 수요가 빠르게 증가하고 있다. 모바일 데 이터 서비스들의 급속한 성장을 충족시키고 새로운 애플리케이션들 및 전개들을 지원하기 위하여, 무선 인터페 이스들의 효율 및 커버리지를 개선하는 것이 매우 중요하다. NR-U(new radio-unlicensed)에서, LBT(Listen BeforeTalk)의 경쟁 메커니즘이 각 자원 청크 및/또는 채널에 채 택된다. 본 개시에서, 자원 청크가 20MHz 시간-주파수 자원이라고 할 수 있다. 기지국이 노드들의 부하 정보를 상호작용시킴으로써 모바일 부하 균형의 의사 결정을 보조하기 위해 참조 정보 를 제공할 수 있다. 기지국은 사용자 무선 링크 관련 정보 및/또는 사용자들의 보고들을 수집하고 및/또는 상호작용하여 모바일 강 건한 최적화의 의사 결정을 보조하기 위해 참조 정보를 제공할 수 있다. 본 개시의 실시예들은 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법을 제공하며, 이 방법은, LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보, 신호 강도 및/또는 신호 품질에 관련된 정보, 비면 허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보, LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과 및 LBT 실패 정보에 관련된 정보 중 적어도 하나의 정보 피스를 제2 엔티티로부터 수신하는 단계, 및/또는 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 정보를 제2 엔티티에 송신하는 단계를 포함하며, 여기서 적어도 하나의 정보 피스는 제2 엔티티와 제1 엔티티 및 제2 엔티티를 제외한 다른 엔티티들 중 적어도 하나와 연관된다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 LBT 에너지 검출 임계 값 수집 및/또는 보고 설정을 포함하는 제1 정보를 제2 엔티티에 송신하는 단계를 더 포함하며, 여기서 LBT 에 너지 검출 임계값에 관련된 정보는 제1 정보에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신되며, 제1 정보는, 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 에너지 검출 임계값 보고 지시, 에너지 검출 임계값 보고 모드, 에너지 검출 임계값 보고 간격, 에너지 검출 임계값 보고 시간, 에너지 검출 임계값 수집 간격, 에너지 검출 임계값 수집 시간, 에너지 검출 임계값 측정 간격, 에너지 검출 임계값 측 정 시간, 에너지 검출 임계값 보고 시작 지시, 에너지 검출 임계값 보고 종료 및/또는 중지 지시, 에너지 검출 임계값 보고 트리거 이벤트, 최대 에너지 검출 임계값 보고 지시, 최대 에너지 검출 임계값 보고 모드, 최대 에 너지 검출 임계값 보고 간격, 최대 에너지 검출 임계값 보고 시간, 최대 에너지 검출 임계값 수집 간격, 최대 에너지 검출 임계값 수집 시간, 최대 에너지 검출 임계값 측정 간격, 최대 에너지 검출 임계값 측정 시간, 최대에너지 검출 임계값 보고 시작 지시, 최대 에너지 검출 임계값 보고 종료 지시 및 최대 에너지 검출 임계값 보 고 트리거 이벤트 다음 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 제2 엔티티로부터 제3 정보를 수신하는 단계를 더 포함하며, 여기서 제3 정보는 제2 엔티티가 제1 정보에 기반하여 LBT 에너지 검출 임계값에 관련된 정보를 제1 엔티티에 송신할 수 없음을 나타내는 정보를 포함하며, 제3 정보는 사용자 장비 식 별, 송신 엔티티 식별, 수신 엔티티 식별, 에너지 검출 임계값이 보고될 수 없다는 지시, 최대 에너지 검출 임 계값이 보고될 수 없다는 지시, 에너지 검출 임계값 및/또는 최대 에너지 검출 임계값이 보고될 수 없는 원인 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 신호 강도 및/또는 신 호 품질 수집 및/또는 보고 설정을 포함하는 제4 정보를 제2 엔티티에 송신하는 단계를 더 포함하며, 여기서 신 호 강도 및/또는 신호 품질에 관련된 정보는 제4 정보에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신되며, 제4 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 채널 점유(channel occupancy) 임계값, 수집된 샘플 수, 최대 수집된 샘플 수, 최소 수집된 샘플 수, 샘플 수집 시간 간격, 최대 샘플 수집 시간 간격 및 최소 샘플 수집 시간 간격 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청을 포함하는 제6 정보를 제2 엔티티에 송신하는 단계와, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에 대한 응답을 포함하는 제7 정보를 제2 엔티티로부터 수신하는 단계를 더 포함하며, 여기서 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/ 또는 부하 상황 요청은 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보의 요청이며, 제6 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 신호 강도 및/또는 신호 품질 보고 요청, 채널 점유 임계값, 수집된 샘플 수, 최대 수집된 샘플 수, 최소 수집된 샘플 수, 샘플 수집 시간 간 격, 최대 샘플 수집 시간 간격, 최소 샘플 수집 시간 간격, 서비스 자원 스테이터스 및/또는 부하 보고 요청, 서비스 지시, 요청된 보고 범위, 데이터 볼륨 보고 요청, 데이터 볼륨 보고에 상응하는 시간 정보, 데이터 볼륨 측정에 상응하는 시간 정보, 보고 콘텐츠의 측정 시간 정보, 보고 콘텐츠, 예측 사용자 장비 식별, 비면허 대역 예측 식별, 예측 등록 요청, 요청된 예측을 위한 시간 간격, 요청된 예측 콘텐츠에 대한 적용 가능한 시간, 요 청된 예측에 대한 범위, 예측 콘텐츠, 예측 보고 기간, 결과 및/또는 예측 모델의 정확도가 보고될 필요가 있다 는 지시, 부분적 보고의 지원 식별, 보고 필요성 지시, 보고를 트리거하는 조건 및/또는 이벤트 중 하나 이상을 포함하고, 제7 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 예측 요청 확인, 하나씩 예측 요청 콘텐츠 확인, 보고가능 콘텐츠, 비-보고가능 콘텐츠, 보고가능 콘텐츠 범위, 비-보고가능 콘텐츠 범위, 요 청 실패 원인, 예측 신뢰도, 및 요청 실패 지시 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 정보는 제9 정보에 포 함되며, 제9 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 신호 강도 및/또는 신호 품질 임 계값, 및 채널 바쁨 백분율 임계값 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 LBT 실패 검출 설정을 포함하는 제10 정보를 제2 엔티티에 송신하는 단계를 더 포함하며, 여기서 LBT 실패 검출 정보 및/또는 LBT 실 패 검출 결과에 관련된 정보는 제10 정보에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송 신되며, 제10 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, LBT 실패 검출 타이머 및 최대 LBT 실패 인스턴스 카운트 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 LBT 실패 정보 요청에 관련된 정보를 제2 엔티티에 송신하는 단계를 더 포함하며, 여기서 LBT 실패 정보 요청에 관련된 정보는 제13 정보에 포함되며, 제13 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, LBT 실패 정보 요청, LBT 실패 보고 요청, 연속 LBT 실패 정보 요청 및 연속 LBT 실패 보고 요청 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제1 엔티티에 의해 수행되는 방법은 LBT 실패 정보가 이용 가능하다는 지시를 포함하는 제12 정보를 제2 엔티티로부터 수신하는 단계를 더 포함하며, 여기서 LBT 실패 정 보 요청에 관련된 정보는 제12 정보에 기반하여 제1 엔티티에 의해 제2 엔티티에 송신되며, 제12 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, LBT 실패 정보 이용 가능함, LBT 실패 보고 이용 가능함, 연 속 LBT 실패 정보 이용 가능함, 및 연속 LBT 실패 보고 이용 가능함 중 하나 이상을 포함한다.본 개시의 실시예들에 따르면, LBT 실패 정보는 제14 정보에 포함되며, 여기서 제14 정보는 제2 엔티티에 의해 자율적으로 송신되거나 또는 LBT 실패 정보 요청에 관련된 수신된 정보에 기반하여 제2 엔티티에 의해 송신된다. 본 개시의 실시예들에 따르면, 적어도 하나의 정보 피스는 제1 엔티티 및 제2 엔티티 중 적어도 하나가 네트워 크 자체 최적화 결정을 내리는데 사용되며, 여기서 네트워크 자체 최적화 결정은 네트워크 에너지 절약, 부하 균형, 커버리지 최적화, 이동성 최적화 및 관리, 네트워크 구성 공식화 및/또는 네트워크 설정 업데이팅 중 적 어도 하나를 포함한다. 본 개시의 실시예들에 따르면, LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보는 제2 정보이며, 여 기서 제2 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 에너지 검출 임계값, 에너지 검출 임 계값에 대한 보고 모드, 에너지 검출 임계값에 대한 수집 시간, 에너지 검출 임계값 보고를 트리거하는 이벤트, 최대 에너지 검출 임계값, 최대 에너지 검출 임계값에 대한 보고 모드, 최대 에너지 검출 임계값에 대한 수집 시간 및 최대 에너지 검출 임계값 보고를 트리거하는 이벤트 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 신호 강도 및/또는 신호 품질에 관련된 정보는 제5 정보에 포함되며, 여기서 제5 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 사용되는 채널 점유 임계값, 사용되는 수집된 샘플 수, 최대 수집된 샘플 수, 최소 수집된 샘플 수, 사용되는 샘플 수집 시간 간격, 최대 샘플 수집 시간 간 격, 최소 샘플 수집 시간 간격, 신호 강도 및/또는 신호 품질, 채널 점유 시간 백분율, 및 보고 실패의 원인 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보는 제8 정보에 포함되며, 여기서 제8 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 신호 강도 및/또는 신호 품질, 사용되는 채널 점유 임계값, 채널 바쁨 백분율, 자원 백분율, 최대 에너지 검출 임계 값, 보고된 정보에 해당하는 서비스 지시, 보고 콘텐츠, 보고 콘텐츠에 대한 적용 가능한 시간, 보고 콘텐츠에 해당하는 범위, 보고를 트리거하는 조건 및/또는 이벤트, 예측 콘텐츠 예측 식별, 예측 콘텐츠에 대한 적용 가 능한 시간, 자원 스테이터스 및/또는 부하의 보고된 정보, 예측 결과, 예측 결과에 해당하는 범위 및 예측 신뢰 도 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보는 제11 정보에 포함되며, 여기서 제11 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 서빙 셀 식별, 채널 식 별, LBT 실패 검출 타이머, 최대 LBT 실패 인스턴스 카운트, 다운링크 LBT 실패 지시, 업링크 LBT 실패 지시 및 LBT 실패 지시 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 제14 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 수신 신호 강도 지시자(received signal strength indicator, RSSI), 채널 점유 시간 백분율, LBT 실패 횟수, LBT의 성공 률 또는 실패율, LBT 성공 후의 평균 전송 지속 시간, LBT 실패 검출 타이머, 최대 LBT 실패 인스턴스 카운트, LBT 실패 검출의 시간 길이, LBT 실패 인스턴스 카운트, 다운링크 LBT 실패 지시, 업링크 LBT 실패 지시, LBT 실패 지시, LBT 실패가 발생하는 대역폭(BWP), LBT 실패에 해당하는 자원 설정, LBT 실패에 해당하는 자원 활성 화 설정, LBT 실패에 대응하는 RSSI, LBT 실패에 대응하는 검출된 에너지, LBT 실패에 대응하는 에너지 검출 임 계값, LBT 실패에 대응하는 최대 에너지 검출 임계값, LBT 실패부터 보고까지의 시간 정보, LBT 실패 시간, 셀 식별, 셀이 위치된 노드의 식별, 빔 식별, 슬라이스 식별, 공공 육상 이동 네트워크 식별 및 대역 정보 지시 중 하나 이상을 포함한다. 본 개시의 실시예들은 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법을 제공하며, 이 방법은, LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보, 신호 강도 및/또는 신호 품질에 관련된 정보, 비면 허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보, LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과 및 LBT 실패 정보에 관련된 정보 중 적어도 하나의 정보 피스를 제1 엔티티에 송신하는 단 계, 및/또는 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 정보를 제1 엔티티로부터 수신하는 단계 를 포함하며, 여기서 적어도 하나의 정보 피스는 제2 엔티티와, 제1 엔티티 및 제2 엔티티를 제외한 다른 엔티 티들 중 적어도 하나와 연관된다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 LBT 에너지 검출 임계 값 수집 및/또는 보고 설정을 포함하는 제1 정보를 제1 엔티티로부터 수신하는 단계를 더 포함하며, 여기서 LBT 에너지 검출 임계값에 관련된 정보는 제1 정보에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신되며, 제1 정보는, 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 에너지 검출 임계값 보고 지시, 에너지 검출 임계값 보고 모드, 에너지 검출 임계값 보고 간격, 에너지 검출 임계값 보고 시간, 에너지 검출 임계값 수집 간격, 에너지 검출 임계값 수집 시간, 에너지 검출 임계값 측정 간격, 에너지 검출 임계값 측 정 시간, 에너지 검출 임계값 보고 시작 지시, 에너지 검출 임계값 보고 종료 및/또는 중지 지시, 에너지 검출 임계값 보고 트리거 이벤트, 최대 에너지 검출 임계값 보고 지시, 최대 에너지 검출 임계값 보고 모드, 최대 에 너지 검출 임계값 보고 간격, 최대 에너지 검출 임계값 보고 시간, 최대 에너지 검출 임계값 수집 간격, 최대 에너지 검출 임계값 수집 시간, 최대 에너지 검출 임계값 측정 간격, 최대 에너지 검출 임계값 측정 시간, 최대 에너지 검출 임계값 보고 시작 지시, 최대 에너지 검출 임계값 보고 종료 지시 및 최대 에너지 검출 임계값 보 고 트리거 이벤트 다음 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 제1 엔티티에 제3 정 보를 송신하는 단계를 더 포함하며, 여기서 제3 정보는 제2 엔티티가 제1 정보에 기반하여 LBT 에너지 검출 임 계값에 관련된 정보를 제1 엔티티에 송신할 수 없음을 나타내는 정보를 포함하며, 제3 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 에너지 검출 임계값이 보고될 수 없다는 지시, 최대 에너지 검출 임계값이 보고될 수 없다는 지시, 에너지 검출 임계값 및/또는 최대 에너지 검출 임계값이 보고될 수 없는 원인 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 신호 강도 및/또는 신 호 품질 수집 및/또는 보고 설정을 포함하는 제4 정보를 제1 엔티티로부터 수신하는 단계를 더 포함하며, 여기 서 신호 강도 및/또는 신호 품질에 관련된 정보는 제4 정보에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신되며, 제4 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 채널 점유 임계값, 수집된 샘플 수, 최대 수집된 샘플 수, 최소 수집된 샘플 수, 샘플 수집 시간 간격, 최대 샘플 수집 시 간 간격 및 최소 샘플 수집 시간 간격 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청을 포함하는 제6 정보를 제1 엔티티로부터 수신하는 단계 와, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청 요청에 대한 응답을 포함하는 제7 정보를 제1 엔티티에 송신하는 단계를 더 포함하며, 여기서 비면허 대역 및/또는 면허 대역의 자원 스테이 터스 및/또는 부하 상황 요청은 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보에 대한 요청이며, 제6 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 신호 강도 및/또는 신호 품질 보고 요청, 채널 점유 임계값, 수집된 샘플 수, 최대 수집된 샘플 수, 최소 수집된 샘플 수, 샘플 수 집 시간 간격, 최대 샘플 수집 시간 간격, 최소 샘플 수집 시간 간격, 서비스 자원 스테이터스 및/또는 부하 보 고 요청, 서비스 지시, 요청된 보고 범위, 데이터 볼륨 보고 요청, 데이터 볼륨 보고에 상응하는 시간 정보, 데 이터 볼륨 측정에 상응하는 시간 정보, 보고 콘텐츠의 측정 시간 정보, 보고 콘텐츠, 예측 사용자 장비 식별, 비면허 대역 예측 식별, 예측 등록 요청, 요청된 예측을 위한 시간 간격, 요청된 예측 콘텐츠에 대한 적용 가능 한 시간, 요청된 예측에 대한 범위, 예측 콘텐츠, 예측 보고 기간, 결과 및/또는 예측 모델의 정확도가 보고될 필요가 있다는 지시, 부분적 보고의 지원 식별, 보고 필요성 지시, 보고를 트리거하는 조건 및/또는 이벤트 중 하나 이상을 포함하고, 제7 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 예측 요청 확인, 하나씩 예측 요청 콘텐츠 확인, 보고가능 콘텐츠, 비-보고가능 콘텐츠, 보고가능 콘텐츠 범위, 비-보고가능 콘 텐츠 범위, 요청 실패 원인, 예측 신뢰도, 및 요청 실패 지시 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 정보는 제9 정보에 포 함되며, 제9 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 신호 강도 및/또는 신호 품질 임 계값, 및 채널 바쁨 백분율 임계값 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 LBT 실패 검출 설정을 포함하는 제10 정보를 제1 엔티티로부터 수신하는 단계를 더 포함하며, 여기서 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보는 제10 정보에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신되며, 제10 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, LBT 실패 검출 타이머 및 최대 LBT 실패 인스턴스 카운트 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 LBT 실패 정보 요청에 관련된 정보를 제1 엔티티로부터 수신하는 단계를 더 포함하며, 여기서 LBT 실패 정보 요청에 관련된 정보는 제 13 정보에 포함되며, 제13 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, LBT 실패 정보요청, LBT 실패 보고 요청, 연속 LBT 실패 정보 요청 및 연속 LBT 실패 보고 요청 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 무선 통신 시스템에서 제2 엔티티에 의해 수행되는 방법은 LBT 실패 정보가 이용 가능하다는 지시를 포함하는 제12 정보를 제1 엔티티에 송신하는 단계를 더 포함하며, 여기서 LBT 실패 정보 요 청에 관련된 정보는 제12 정보에 기반하여 제1 엔티티에 의해 제2 엔티티에 송신되며, 제12 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, LBT 실패 정보 이용 가능함, LBT 실패 보고 이용 가능함, 연속 LBT 실패 정보 이용 가능함, 및 연속 LBT 실패 보고 이용 가능함 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, LBT 실패 정보는 제14 정보에 포함되며, 여기서 제14 정보는 제2 엔티티에 의해 자율적으로 송신되거나 또는 LBT 실패 정보 요청에 관련된 수신된 정보에 기반하여 제2 엔티티에 의해 송신된다. 본 개시의 실시예들에 따르면, 적어도 하나의 정보 피스는 제1 엔티티 및 제2 엔티티 중 적어도 하나가 네트워 크 자체 최적화 결정을 내리는데 사용되며, 여기서 네트워크 자체 최적화 결정은 네트워크 에너지 절약, 부하 균형, 커버리지 최적화, 이동성 최적화 및 관리, 네트워크 구성 공식화 및/또는 네트워크 설정 업데이팅 중 적 어도 하나를 포함한다. 본 개시의 실시예들에 따르면, LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보는 제2 정보이며, 여 기서 제2 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 에너지 검출 임계값, 에너지 검출 임 계값에 대한 보고 모드, 에너지 검출 임계값에 대한 수집 시간, 에너지 검출 임계값 보고를 트리거하는 이벤트, 최대 에너지 검출 임계값, 최대 에너지 검출 임계값에 대한 보고 모드, 최대 에너지 검출 임계값에 대한 수집 시간 및 최대 에너지 검출 임계값 보고를 트리거하는 이벤트 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 신호 강도 및/또는 신호 품질에 관련된 정보는 제5 정보에 포함되며, 여기서 제5 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 사용되는 채널 점유 임계값, 사용되는 수집된 샘플 수, 최대 수집된 샘플 수, 최소 수집된 샘플 수, 사용되는 샘플 수집 시간 간격, 최대 샘플 수집 시간 간 격, 최소 샘플 수집 시간 간격, 신호 강도 및/또는 신호 품질, 채널 점유 시간 백분율, 및 보고 실패의 원인 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보는 제8 정보에 포함되며, 여기서 제8 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 신호 강도 및/또는 신호 품질, 사용되는 채널 점유 임계값, 채널 바쁨 백분율, 자원 백분율, 최대 에너지 검출 임계 값, 보고된 정보에 해당하는 서비스 지시, 보고 콘텐츠, 보고 콘텐츠에 대한 적용 가능한 시간, 보고 콘텐츠에 해당하는 범위, 보고를 트리거하는 조건 및/또는 이벤트, 예측 콘텐츠 예측 식별, 예측 콘텐츠에 대한 적용 가 능한 시간, 자원 스테이터스 및/또는 부하의 보고된 정보, 예측 결과, 예측 결과에 해당하는 범위 및 예측 신뢰 도 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보는 제11 정보에 포함되며, 여기서 제11 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 서빙 셀 식별, 채널 식 별, LBT 실패 검출 타이머, 최대 LBT 실패 인스턴스 카운트, 다운링크 LBT 실패 지시, 업링크 LBT 실패 지시 및 LBT 실패 지시 중 하나 이상을 포함한다. 본 개시의 실시예들에 따르면, 제14 정보는 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 수신 신호 강도 지시자 (RSSI), 채널 점유 시간 백분율, LBT 실패 횟수, LBT의 성공률 또는 실패율, LBT 성공 후의 평균 전송 지속 시간, LBT 실패 검출 타이머, 최대 LBT 실패 인스턴스 카운트, LBT 실패 검출의 시간 길이, LBT 실패 인스턴스 카운트, 다운링크 LBT 실패 지시, 업링크 LBT 실패 지시, LBT 실패 지시, LBT 실패가 발생하는 대역폭 (BWP), LBT 실패에 해당하는 자원 설정, LBT 실패에 해당하는 자원 활성화 설정, LBT 실패에 대응하는 RSSI, LBT 실패에 대응하는 검출된 에너지, LBT 실패에 대응하는 에너지 검출 임계값, LBT 실패에 대응하는 최대 에너 지 검출 임계값, LBT 실패부터 보고까지의 시간 정보, LBT 실패 시간, 셀 식별, 셀이 위치된 노드의 식별, 빔 식별, 슬라이스 식별, 공공 육상 이동 네트워크 식별 및 대역 정보 지시 중 하나 이상을 포함한다. 본 개시의 실시예들은 무선 통신 시스템에서의 제1 엔티티를 제공하며, 이는, 신호들을 송수신하도록 구성되는 송수신부; 및 송수신부에 결합되는 프로세서를 포함하고, 프로세서는 본 개시의 실시예들에 따른 무선 통신 시 스템에서의 제1 엔티티에 의해 수행되는 방법들을 수행하도록 구성된다. 본 개시의 실시예들은 무선 통신 시스템에서의 제2 엔티티를 제공하며, 이는, 신호들을 송수신하도록 구성되는 송수신부; 및 송수신부에 결합되는 프로세서를 포함하고, 프로세서는 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제2 엔티티에 의해 수행되는 방법들을 수행하도록 구성된다. 본 개시의 실시예들은 프로세서에 의해 실행될 때, 본 개시의 실시예들에 따른 무선 통신 시스템에서 제1 엔티 티 및/또는 제2 엔티티에 의해 수행되는 방법들을 구현하는 컴퓨터 판독가능 명령어들을 저장하는 컴퓨터 판독 가능 매체를 제공한다. 본 개시에서 설명되는 엔티티들 또는 노드들은 gNB, gNB 중앙 유닛(gNB-CU), gNB 분산 유닛(gNB-DU), gNB 중앙 유닛 제어 평면(gNB CU-CP), gNB 중앙 유닛 사용자 평면(gNB CU-UP), en-gNB, eNB, ng-eNB, UE, 액세스 및 이 동성 관리 기능부(AMF), 세션 관리 기능부(SMF), 이동성 관리 엔티티(mobility management entity, MME) 및 다 른 네트워크 엔티티들 또는 네트워크 로직 유닛들을 포함할 수 있다. 본 개시에서 설명되는 신호 강도 및/또는 신호 품질은 수신 신호 강도 지시자(RSSI), 참조 신호 수신 전력 (Reference Signal Receiving Power, RSRP), 참조 신호 수신 품질(RSRQ), 신호 대 간섭 더하기 잡음 비(SINR) 등일 수 있다. 아래에서 논의되는 도 1 내지 도 12와 이 특허 문서에서 본 개시의 원리들을 설명하기 위한 다양한 실시예들은"}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "예시만을 위한 것이고 본 개시의 범위를 어떤 식으로라도 제한하는 것으로 해석되지 않아야 한다. 본 기술분야 의 통상의 기술자들은 본 개시의 원리들이 임의의 적절히 배열된 시스템 또는 디바이스로 구현될 수 있다는 것 을 이해할 것이다. 도 1은 시스템 아키텍처 진화(SAE)의 예시적인 시스템 아키텍처이다. 사용자 장비(UE)는 데이터를 수 신하기 위한 단말 디바이스이다. E-UTRAN(evolved universal terrestrial radio access network)이 라디 오 액세스 네트워크이며, 이는 무선 네트워크에 액세스하기 위한 인터페이스들을 UE에게 제공하는 매크로 기지 국(eNodeB/NodeB)을 포함한다. 이동성 관리 엔티티(MME)가 이동성 콘텍스트, UE의 세션 컨텍스트 및 보안 정보를 관리하는 것을 담당한다. 서빙 게이트웨이(serving gateway, SGW)는 사용자 평면의 기능들을 주로 제공하고, MME와 SGW는 동일한 물리적 엔티티에 있을 수 있다. 패킷 데이터 네트워크 게이트웨이 (packet data network gateway, PGW)가 과금, 합법적인 차단 등의 기능들을 담당하고, SGW와 동일한 물리적 엔티티에 있을 수 있다. 정책 및 과금 규칙 기능 엔티티(policy and charging rules function entity, PCRF)가 서비스 품질(quality of service, QoS) 정책들 및 과금 기준들을 제공한다. 일반 패킷 무선 서비 스 지원 노드(SGSN)가 유니버셜 이동 통신 시스템(universal mobile telecommunications system, UMTS)에 데이터 송신을 위한 라우팅을 제공하는 네트워크 노드 디바이스이다. 홈 가입자 서버(home subscriber server, HSS)가 UE의 홈 서브시스템이고, 사용자 장비의 현재 위치, 서빙 노드의 주소, 사용자 보안 정보, 및 사용 자 장비의 패킷 데이터 컨텍스트 등을 포함하는 사용자 정보를 보호하는 것을 담당한다. 도 2는 본 개시의 다양한 실시예들에 따른 예시적인 시스템 아키텍처이다. 시스템 아키텍처의 다른 실시예들이 본 개시의 범위로부터 벗어남 없이 사용될 수 있다. 사용자 장비(UE)는 데이터를 수신하기 위한 단말 디바이스이다. 차세대 무선 액세스 네트워크(next generation radio access network, NG-RAN)가, 무선 네트워크에 액세스하기 위한 인터페이스들을 UE에게 제공하는 기지국(5G 코어 네트워크(5GC)에 연결된 gNB 또는 eNB이며, 5GC에 연결된 eNB는 또한 ng-gNB라 불리움)을 포함하는 무선 액세스 네트워크이다. 액세스 제어 및 이동성 관리 기능 엔티티(access control and mobility management function entity, AMF)가 UE의 이동성 컨텍스트 및 보안 정보를 관리하는 것을 담당 한다. 사용자 평면 기능 엔티티(user plane function entity, UPF)가 주로 사용자 평면의 기능들을 제공 한다. 세션 관리 기능 엔티티(session management function entity, SMF)가 세션 관리를 담당한다. 데이 터 네트워크(data network, DN)가, 예를 들어, 오퍼레이터들의 서비스들, 인터넷의 인터넷 및 서드 파티들 의 서비스를 포함한다. 다음으로, 도 3은 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제1 엔티티에 의해 수행되는 방법의 흐름도를 예시한다. 도 3에 도시된 바와 같이, 단계 S301에서, 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제1 엔티티에 의 해 수행되는 방법은, LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보, 신호 강도 및/또는 신호 품질에 관련된 정보, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보, LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보 및 LBT 실패 정보 중 적어도 하나의 정보 피스를 제 2 엔티티로부터 수신하는 단계, 및/또는 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 정보를 제2 엔티티에 송신하는 단계를 포함할 수 있다. 일부 실시예에서, 적어도 하나의 정보 피스는 제2 엔티티와 제2 엔티티를 제외한 임의의 다른 엔티티 중 적어도 하나와 연관될 수 있다. 예를 들어, 제2 엔티티로부터 수신되는 LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보는 LBT 프로세스에서의 제2 엔티티의 에너지 검출 임 계값 정보 또는 임의의 방식으로 제2 엔티티에 의해 수집 또는 획득되는 LBT 프로세스에서의 임의의 다른 엔티 티의 에너지 검출 임계값 정보일 수 있다. 위에서 설명된 다른 정보는 동일한 의미를 갖고, 여기서 반복되지 않 을 것이다. 부가적으로 또는 대안적으로, 방법은 LBT 에너지 검출 임계값 수집 및/또는 보고 설정을 포함하는 제1 정 보를 제2 엔티티에 송신하는 단계를 더 포함할 수 있다. 일부 실시예에서, 위에서 설명된 LBT 에너지 검출 임계 값에 관련된 정보는 제1 정보에 포함되는 LBT 에너지 검출 임계값 수집 및/또는 보고 설정에 기반하여 제2 엔티 티에 의해 획득되고/획득되거나 제1 엔티티에 송신될 수 있다. 부가적으로 또는 대안적으로, 방법은 제3 정보를 제2 엔티티로부터 수신하는 단계를 더 포함할 수 있으며, 제3 정보는 제1 정보에 기반하여 LBT 에너지 검출 임계값에 관련된 정보를 제1 엔티티에 송신할 수 없음을 나타 내는 정보를 포함할 수 있다. 부가적으로 또는 대안적으로, 이 방법은 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정을 포함하는 제4 정보를 제2 엔티티에 송신하는 단계를 더 포함할 수 있다. 일부 실시예에서, 위에서 설명된 신호 강도 및/ 또는 신호 품질에 관련된 정보는 제4 정보에 포함되는 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신할 수 있다. 부가적으로 또는 대안적으로, 방법은 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상 황 요청을 포함하는 제6 정보를 제2 엔티티에 송신하는 단계와, 비면허 대역 및/또는 면허 대역의 자원 스테이 터스 및/또는 부하 상황 요청에 대한 응답을 포함하는 제7 정보를 제2 엔티티로부터 수신하는 단계를 더 포함할 수 있다. 일부 실시예에서, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청은 비면 허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보에 대한 요청일 수 있다. 부가적으로 또는 대안적으로, 방법은 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 제9 정보를 제2 엔티티에 송신하는 단계를 더 포함할 수 있다. 부가적으로 또는 대안적으로, 방법은 LBT 실패 검출 설정을 포함하는 제10 정보를 제2 엔티티에 송신하는 단계를 더 포함할 수 있다. 일부 실시예에서, 위에서 설명된 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보는 제10 정보에 포함된 LBT 실패 검출 설정에 기반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신될 수 있다. 부가적으로 또는 대안적으로, 방법은 LBT 실패 정보가 이용 가능하다는 지시를 포함하는 제12 정보를 제2 엔티티로부터 수신하는 단계와, LBT 실패 정보 요청에 관련된 정보를 제2 엔티티에 송신하는 단계를 더 포함할 수 있다. 일부 실시예에서, LBT 실패 정보 요청에 관련된 정보는 제12 정보에 포함되는 LBT 실패 정보가 이용 가능하다는 지시에 기반하여 제1 엔티티에 의해 제2 엔티티에 송신될 수 있다. 도 4는 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제2 엔티티에 의해 수행되는 방법의 흐름도를 예시한다. 도 4에 도시된 바와 같이, 단계 S401에서, 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제2 엔티티에 의 해 수행되는 방법은, LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보, 신호 강도 및/또는 신호 품질에 관련된 정보, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보, LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보 및 LBT 실패 정보 중 적어도 하나의 정보 피스를 제 1 엔티티에 송신하는 단계, 및/또는 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 정보를 제1 엔티 티로부터 수신하는 단계를 포함할 수 있다. 위에서 설명된 바와 같이, 일부 구현예에서, 적어도 하나의 정보 피 스는 제2 엔티티와 제2 엔티티를 제외한 임의의 다른 엔티티 중 적어도 하나와 연관될 수 있다. 예를 들어, 제2 엔티티로부터 수신되는 LBT(Listen BeforeTalk) 에너지 검출 임계값에 관련된 정보는 LBT 프로세스에서의 제2 엔티티의 에너지 검출 임계값 정보 또는 임의의 방식으로 제2 엔티티에 의해 수집 또는 획득되는 LBT 프로세스 에서의 임의의 다른 엔티티의 에너지 검출 임계값 정보일 수 있다. 위에서 설명된 다른 정보는 동일한 의미를 갖고, 여기서 반복되지 않을 것이다. 부가적으로 또는 대안적으로, 방법은 LBT 에너지 검출 임계값 수집 및/또는 보고 설정을 포함하는 제1 정 보를 제1 엔티티로부터 수신하는 단계를 더 포함할 수 있다. 일부 실시예에서, 위에서 설명된 LBT 에너지 검출 임계값에 관련된 정보는 제1 정보에 포함되는 LBT 에너지 검출 임계값 수집 및/또는 보고 설정에 기반하여 제2엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신될 수 있다. 부가적으로 또는 대안적으로, 방법은 제3 정보를 제1 엔티티에 송신하는 단계를 더 포함할 수 있으며, 제3 정보는 제1 정보에 기반하여 LBT 에너지 검출 임계값에 관련된 정보를 제1 엔티티에 송신할 수 없음을 나타내는 정보를 포함할 수 있다. 부가적으로 또는 대안적으로, 이 방법은 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정을 포함하는 제4 정보를 제1 엔티티로부터 수신하는 단계를 더 포함한다. 일부 실시예에서, 위에서 설명된 신호 강도 및/또 는 신호 품질에 관련된 정보는 제4 정보에 포함되는 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정에 기 반하여 제2 엔티티에 의해 획득되고/획득되거나 제1 엔티티에 송신될 수 있다. 부가적으로 또는 대안적으로, 이 방법은 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청을 포함하는 제6 정보를 제1 엔티티로부터 수신하는 단계와, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청 요청에 대한 응답을 포함하는 제7 정보를 제1 엔티티에 송신하는 단계를 더 포함한다. 일부 실시예에서, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청은 비면 허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 관련된 정보에 대한 요청일 수 있다. 부가적으로 또는 대안적으로, 방법은 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 제9 정보를 제1 엔티티로부터 수신하는 단계를 더 포함할 수 있다. 부가적으로 또는 대안적으로, 방법은 LBT 실패 검출 설정을 포함하는 제10 정보를 제1 엔티티로부터 수신 하는 단계를 더 포함할 수 있다. 일부 실시예에서, 위에서 설명된 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 관련된 정보는 제10 정보에 포함된 LBT 실패 검출 설정에 기반하여 제2 엔티티에 의해 획득되고/획득되 거나 제1 엔티티에 송신될 수 있다. 부가적으로 또는 대안적으로, 방법은 LBT 실패 정보가 이용 가능하다는 지시를 포함하는 제12 정보를 제1 엔티티에 송신하는 단계와, LBT 실패 정보 요청에 관련된 정보를 제1엔티티로부터 수신하는 단계를 더 포함할 수 있다. 일부 실시예에서, LBT 실패 정보 요청에 관련된 정보는 제12 정보에 포함되는 LBT 실패 정보가 이용 가능하다는 지시에 기반하여 제1 엔티티에 의해 제2 엔티티에 송신될 수 있다. 위에서 설명된 본 개시의 실시예들에 따른 방법 및 방법의 다양한 단계들은 개별적으로 또는 임의의 조합으로 공동으로 수행될 수 있고, 임의의 순서로, 예를 들어, 동시에 또는 나열된 순서의 역 순서로 수행될 수 있다. 덧붙여서, 위에서 설명된 다양한 단계들 및 다양한 정보는 특정 예들과 조합하여 아래에서 추가로 설 명될 것이다. 이하에서, 본 개시의 실시예들에 따른 무선 통신 시스템에서 제1 엔티티 및/또는 제2 엔티티에 의해 수행되는 방법들은 특정 예들과 조합하여 다양한 양태들로부터 설명될 것이다. 더 일반적으로, 본 개시의 실시예들에 따 른 무선 통신 시스템에서 제1 엔티티 및/또는 제2 엔티티에 의해 수행되는 방법들은 또한 무선 통신 네트워크의 자체 최적화를 지원하는 방법들이라고 지칭될 수 있다. 예 1 본 개시의 제1 양태는 무선 통신 네트워크의 자체 최적화를 지원하는 방법을 제안하는데, 이 방법은 제1 엔티티 가 LBT 에너지 검출(ED) 임계 수집 및/또는 보고 설정을 포함하는 제1 정보를 제2 엔티티에 송신하는 것을 포함 할 수 있어, 제2 엔티티는 제1 정보에 포함된 설정에 따른 LBT 프로세스에서 에너지 검출 임계값 정보를 수집할 수 있고 해당 정보를 제1 엔티티에 보고할 수 있다. 그러므로, 제1 엔티티는 LBT 프로세스에서 제2 엔티티의 에 너지 검출 임계값 정보를 획득하고 후속 부하 정보 교환 및 최대 에너지 검출 임계값 업데이팅을 위한 참조 정 보를 제공함으로써, 부하 균형 결정을 위한 참조 정보를 제공하고 LBT 전송 메커니즘의 강건성을 개선할 수 있 다. 위에서 설명된 바와 같이, 일부 구현예에서, LBT 에너지 검출 임계값 정보는 LBT 프로세스에서 제2 엔티티 의 에너지 검출 임계값 정보 또는 임의의 방식으로 제2 엔티티에 의해 수집 또는 획득되는 LBT 프로세스에서의 임의의 다른 엔티티의 에너지 검출 임계값 정보일 수 있다. 일부 실시예에서, 제1 정보는 무선 자원 제어(RRC)의 새 무선 보고 설정(reportConfigNR), 이벤트 트리거 설정 (EventTriggerConfig) 및/또는 reportConfigNR에서의 주기적 보고 설정(PeriodicalReportConfig); 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지 중 하나 이상에 포 함될 수 있다.일부 실시예에서, 제1 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: LBT 에너지 검출 임계값 수집 및/또는 보고가 트리거되는 UE의 식별을 나타내기 위해 사용 된다. - 송신 엔티티 식별: 제1 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제1 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 에너지 검출 임계값 보고 지시: 에너지 검출 임계값이 보고되도록 요구됨을 나타내기 위해 사용된다. 이 지시 는 단일 비트에 의해 표현될 수 있으며, 예를 들어, 비트가 1일 때, 이는 에너지 검출 임계값이 보고될 필요가 있음을 의미하고, 비트가 0일 때, 이는 에너지 검출 임계값이 보고될 필요가 없음을 의미한다. 대안적으로, 비 트가 1일 때, 이는 에너지 검출 임계값이 보고될 필요가 없음을 의미하고, 비트가 0일 때, 이는 에너지 검출 임 계값이 보고될 필요가 있음을 의미한다. - 에너지 검출 임계값 보고 모드: 에너지 검출 임계값의 보고 모드를 나타내기 위해 사용된다. 보고 모드는 주 기적 유형, 온디멘드 유형, 단일 보고 유형, 이벤트 트리거 유형 등을 포함할 수 있다. - 에너지 검출 임계값 보고 간격: 에너지 검출 임계값이 보고될 필요가 있는 시간 간격을 나타내기 위해 사용된 다. - 에너지 검출 임계값 보고 시간: 에너지 검출 임계값이 보고될 필요가 있는 시점 및/또는 시구간을 나타내기 위해 사용된다. 이 시간은 타이머, 시점, 시구간, 시작 시간, 종료 시간, 시점 및 시구간의 조합 등 중 하나 이 상에 의해 나타내어질 수 있다. - 에너지 검출 임계값 수집 간격: 에너지 검출 임계값이 수집될 필요가 있는 시간 간격을 나타내기 위해 사용된 다. - 에너지 검출 임계값 수집 시간: 에너지 검출 임계값이 수집될 필요가 있는 시점 및/또는 시구간을 나타내기 위해 사용된다. 이 시간은 타이머, 시점, 시구간, 시작 시간, 종료 시간, 시점 및 시구간의 조합 등 중 하나 이 상에 의해 나타내어질 수 있다. - 에너지 검출 임계값 측정 간격: 에너지 검출 임계값이 측정될 필요가 있는 시간 간격을 나타내기 위해 사용된 다. - 에너지 검출 임계값 측정 시간: 에너지 검출 임계값이 측정될 필요가 있는 시점 및/또는 시구간을 나타내기 위해 사용된다. 이 시간은 타이머, 시점, 시구간, 시작 시간, 종료 시간, 시점 및 시구간의 조합 등 중 하나 이 상에 의해 나타내어질 수 있다. - 에너지 검출 임계값 보고 시작 지시: 에너지 검출 임계값 보고의 시작을 나타내기 위해 사용된다. 이 지시는 단일 비트에 의해 표현될 수 있으며, 비트가 1일 때, 이는 에너지 검출 임계값 보고가 시작됨을 의미하고, 비트 가 0일 때, 이는 에너지 검출 임계값 보고가 필요하지 않고 그리고/또는 에너지 검출 임계값 보고가 종료된다는 것을 의미한다. 대안적으로, 비트가 0일 때, 이는 에너지 검출 임계값 보고가 시작됨을 의미하고, 비트가 1일 때, 이는 에너지 검출 임계값 보고가 필요하지 않고 그리고/또는 에너지 검출 임계값 보고가 종료된다는 것을 의미한다. - 에너지 검출 임계값 보고 종료 및/또는 중지 지시: 에너지 검출 임계값 보고의 종료 및/또는 중지를 나타내기 위해 사용된다. 이 지시는 단일 비트에 의해 표현될 수 있으며, 비트가 1일 때, 이는 에너지 검출 임계값 보고 가 종료 및/또는 중지됨을 의미하고, 비트가 0일 때, 이는 에너지 검출 임계값 보고가 계속될 필요가 있고 그리 고/또는 에너지 검출 임계값 보고가 시작된다는 것을 의미한다. 대안적으로, 비트가 0일 때, 이는 에너지 검출 임계값 보고가 종료 및/또는 중지됨을 의미하고, 비트가 1일 때, 이는 에너지 검출 임계값 보고가 계속될 필요 가 있고 그리고/또는 에너지 검출 임계값 보고가 시작된다는 것을 의미한다. - 에너지 검출 임계값 보고 트리거 이벤트: 에너지 검출 임계값 보고를 트리거할 수 있는 이벤트를 나타내기 위 해 사용된다. 이 이벤트는 최대 에너지 검출 임계값 설정이 업데이트되며, 에너지 검출 임계값이 변경되며, 에 너지 검출 임계값과 이전의 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이상 및/또는 미 만 및/또는 이하이며, 에너지 검출 임계값과 특정 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임 계값 이상 및/또는 미만 및/또는 이하이고, 에너지 검출 임계값과 최대 에너지 검출 임계값 사이의 차이가 임계 값을 초과 및/또는 임계값 이상 및/또는 미만 및/또는 이하 등인 것일 수 있다. 이 필드는 다음 중 하나 이상을포함할 수 있다: o 임계값, 이를테면 위에서 설명된 다양한 임계값들 중 하나 이상. o 트리거 시간: 측정 보고를 트리거하기 위해, 트리거 이벤트의 특정 조건이 충족되는 시간. - 최대 에너지 검출 임계값 보고 지시: 최대 에너지 검출 임계값이 보고될 필요가 있음을 나타내기 위해 사용된 다. 이 지시는 단일 비트에 의해 표현될 수 있으며, 예를 들어, 비트가 1일 때, 이는 최대 에너지 검출 임계값 이 보고될 필요가 있음을 의미하고, 비트가 0일 때, 이는 최대 에너지 검출 임계값이 보고될 필요가 없음을 의 미한다. 대안적으로, 비트가 1일 때, 이는 최대 에너지 검출 임계값이 보고될 필요가 없음을 의미하고, 비트가 0일 때, 이는 최대 에너지 검출 임계값이 보고될 필요가 있음을 의미한다. - 최대 에너지 검출 임계값 보고 모드: 최대 에너지 검출의 보고 모드를 나타내기 위해 사용된다. 보고 모드는 주기적 유형, 온디멘드 유형, 단일 보고 유형, 이벤트 트리거 유형 등을 포함할 수 있다. - 최대 에너지 검출 임계값 보고 간격: 최대 에너지 검출 임계값이 보고될 필요가 있는 시간 간격을 나타내기 위해 사용된다. - 최대 에너지 검출 임계값 보고 시간: 최대 에너지 검출 임계값이 보고될 필요가 있는 시점 및/또는 시구간을 나타내기 위해 사용된다. 이 시간은 타이머, 시점, 시구간, 시작 시간, 종료 시간, 시점 및 시구간의 조합 등 중 하나 이상에 의해 나타내어질 수 있다. - 최대 에너지 검출 임계값 수집 간격: 최대 에너지 검출 임계값이 수집될 필요가 있는 시간 간격을 나타내기 위해 사용된다. - 최대 에너지 검출 임계값 수집 시간: 최대 에너지 검출 임계값이 수집될 필요가 있는 시점 및/또는 시구간을 나타내기 위해 사용된다. 이 시간은 타이머, 시점, 시구간, 시작 시간, 종료 시간, 시점 및 시구간의 조합 등 중 하나 이상에 의해 나타내어질 수 있다. - 최대 에너지 검출 임계값 측정 간격: 최대 에너지 검출 임계값이 측정될 필요가 있는 시간 간격을 나타내기 위해 사용된다. - 최대 에너지 검출 임계값 측정 시간: 최대 에너지 검출 임계값이 측정될 필요가 있는 시점 및/또는 시구간을 나타내기 위해 사용된다. 이 시간은 타이머, 시점, 시구간, 시작 시간, 종료 시간, 시점 및 시구간의 조합 등 중 하나 이상에 의해 나타내어질 수 있다. - 최대 에너지 검출 임계값 보고 시작 지시: 최대 에너지 검출 임계값 보고의 시작을 나타내기 위해 사용된다. 이 지시는 단일 비트에 의해 표현될 수 있으며, 비트가 1일 때, 이는 최대 에너지 검출 임계값 보고가 시작됨을 의미하고, 비트가 0일 때, 이는 최대 에너지 검출 임계값 보고가 필요하지 않고 그리고/또는 최대 에너지 검출 임계값 보고가 종료된다는 것을 의미한다. 대안적으로, 비트가 0일 때, 이는 최대 에너지 검출 임계값 보고가 시작됨을 의미하고, 비트가 1일 때, 이는 최대 에너지 검출 임계값 보고가 필요하지 않고 그리고/또는 최대 에 너지 검출 임계값 보고가 종료된다는 것을 의미한다. - 최대 에너지 검출 임계값 보고 종료 지시: 최대 에너지 검출 임계값 보고의 종료를 나타내기 위해 사용된다. 이 지시는 단일 비트에 의해 표현될 수 있으며, 비트가 1일 때, 이는 최대 에너지 검출 임계값 보고가 중지됨을 의미하고, 비트가 0일 때, 이는 최대 에너지 검출 임계값 보고가 계속될 필요가 있고 그리고/또는 최대 에너지 검출 임계값 보고가 시작된다는 것을 의미한다. 대안적으로, 비트가 0일 때, 이는 최대 에너지 검출 임계값 보 고가 중지됨을 의미하고, 비트가 1일 때, 이는 최대 에너지 검출 임계값 보고가 계속될 필요가 있고 그리고/또 는 최대 에너지 검출 임계값 보고가 시작된다는 것을 의미한다. - 최대 에너지 검출 임계값 보고 트리거 이벤트: 최대 에너지 검출 임계값 보고를 트리거할 수 있는 이벤트를 나타내기 위해 사용된다. 이벤트는 최대 에너지 검출 임계값이 변경되며, 최대 에너지 검출 임계값과 이전의 최 대 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이상 및/또는 미만 및/또는 이하이고, 최 대 에너지 검출 임계값과 특정 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이상 및/또는 미만 및/또는 이하인 것일 수 있다. 이 필드는 다음 중 하나 이상을 포함할 수 있다: o 임계값, 이를테면 위에서 설명된 다양한 임계값들 중 하나 이상. o 트리거 시간: 측정 보고를 트리거하기 위해, 트리거 이벤트의 특정 조건이 충족되는 시간. 일부 실시예에서, 제2 엔티티는 자신의 상황 및/또는 수신된 제1 정보에 따라 LBT 에너지 검출(ED) 임계값 결과 를 포함하는 제2 정보를 제1 엔티티에 송신할 수 있어, 제1 엔티티는 LBT 프로세스에서 제2 엔티티의 에너지 검 출 임계값 정보를 획득하고, 후속 부하 정보 교환, 최대 에너지 검출 임계값 업데이팅 등을 위한 참조 정보를 제공함으로써, 부하 균형 결정을 위한 참조 정보를 제공하고 LBT 전송 메커니즘의 강건성을 개선할 수 있다. 일부 실시예에서, 제2 정보는 RRC의 측정 결과(MeasResults), 측정 보고(MeasurementReport); 또는 다른 및/또 는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지 중 하나 이상에 포함될 수 있다. 일부 실시예에서, 제2 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 보고된 LBT 에너지 검출 임계값 결과에 대응하는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제2 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제2 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 에너지 검출 임계값: 보고된 에너지 검출 임계값을 나타내기 위해 사용된다. 이 값은 실제 수집 값 또는 시구 간에 걸친 평균값일 수 있다. - (또는 현재) 에너지 검출 임계값에 대한 보고 모드: 에너지 검출 임계값을 위해 사용되는 보고 모드를 나타내 기 위해 사용된다. 보고 모드는 주기적 유형, 온디멘드 유형, 단일 보고 유형, 이벤트 트리거 유형 등을 포함할 수 있다. - 에너지 검출 임계값에 대한 수집 시간: 보고된 에너지 검출 임계값에 대응하는 수집 시점 및/또는 수집 시간 간격을 나타내기 위해 사용된다. - 에너지 검출 임계값 보고를 트리거링하는 이벤트: 에너지 검출 임계값 보고를 트리거하는 이벤트를 나타내기 위해 사용된다. 이 이벤트는 최대 에너지 검출 임계값이 설정되며, 에너지 검출 임계값이 변경되며, 에너지 검 출 임계값과 이전의 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이상 및/또는 미만 및/또 는 이하이며, 에너지 검출 임계값과 특정 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이 상 및/또는 미만 및/또는 이하이고, 에너지 검출 임계값과 최대 에너지 검출 임계값 사이의 차이가 임계값을 초 과 및/또는 임계값 이상 및/또는 미만 및/또는 이하인 것일 수 있다. 이 필드는 다음 중 하나 이상을 포함할 수 있다: o 임계값, 이를테면 위에서 설명된 다양한 임계값들 중 하나 이상. o 트리거 시간: 측정 보고를 트리거하기 위해, 트리거 이벤트의 특정 조건이 충족되는 시간. - 최대 에너지 검출 임계값: 보고된 최대 에너지 검출 임계값을 나타내기 위해 사용된다. 이 값은 실제 수집 값 또는 시구간에 걸친 평균값일 수 있다. - 최대 에너지 검출 임계값에 대한 보고 모드: 최대 에너지 검출 임계값을 위해 사용되는 보고 모드를 나타내기 위해 사용된다. 보고 모드는 주기적 유형, 온디멘드 유형, 단일 보고 유형, 이벤트 트리거 유형 등을 포함할 수 있다. - 최대 에너지 검출 임계값에 대한 수집 시간: 보고된 최대 에너지 검출 임계값에 대응하는 수집 시점 및/또는 수집 시간 간격을 나타내기 위해 사용된다. - 최대 에너지 검출 임계값 보고를 트리거링하는 이벤트: 최대 에너지 검출 임계값 보고를 트리거하는 이벤트를 나타내기 위해 사용된다. 이벤트는 최대 에너지 검출 임계값이 변경되며, 최대 에너지 검출 임계값과 이전의 최 대 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이상 및/또는 미만 및/또는 이하이고, 최 대 에너지 검출 임계값과 특정 에너지 검출 임계값 사이의 차이가 임계값을 초과 및/또는 임계값 이상 및/또는 미만 및/또는 이하인 것일 수 있다. 이 필드는 다음 중 하나 이상을 포함할 수 있다: o 임계값, 이를테면 위에서 설명된 다양한 임계값들 중 하나 이상. o 트리거 시간: 측정 보고를 트리거하기 위해, 트리거 이벤트의 특정 조건이 충족되는 시간. 일부 실시예에서, 제2 엔티티가 수신된 제1 정보에 따라 LBT 에너지 검출(ED) 임계값 결과를 포함하는 제2 정보 를 제1 엔티티에 송신할 수 없다면, 제2 엔티티는 에너지 검출 임계값 결과가 보고될 수 없다는 제3 정보를 제1엔티티에 송신할 수 있어, 제1 엔티티는 제2 엔티티가 설정에 따라 보고할 수 없음을 알 수 있으며, 따라서 불 필요한 대기를 피할 수 있다. 일부 실시예에서, 제3 정보는 RRC의 측정 결과(MeasResults), 측정 보고(MeasurementReport); 또는 다른 및/또 는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지 중 하나 이상에 포함될 수 있다. 일부 실시예에서, 제3 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 자신의 에너지 검출 임계값 결과를 보고할 수 없는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제3 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제3 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 에너지 검출 임계값이 보고될 수 없다는 지시: 에너지 검출 임계값이 설정에 따라 보고될 수 없음을 나타내기 위해 사용된다. - 최대 에너지 검출 임계값이 보고될 수 없다는 지시: 최대 에너지 검출 임계값이 설정에 따라 보고될 수 없음 을 나타내기 위해 사용된다. - 원인: 에너지 검출 임계값 및/또는 최대 에너지 검출 임계값이 보고될 수 없는 원인을 나타내기 위해 사용된 다. 그 원인은 다음 중 하나 이상을 포함할 수 있다: 에너지 검출 임계값이 없다, 최대 에너지 검출 임계값이 없다, 비면허 대역 액세스 능력이 없다, 이용 가능한 비면허 대역 자원들이 없다, 수집될 수 없는 LBT 프로세스 에너지 검출 임계값이 없다 그리고 최대 에너지 검출 임계값이 수집될 수 없다. 예 2 본 개시의 제2 양태는 무선 통신 네트워크의 자체 최적화를 지원하는 방법을 제안하는데, 이 방법은 제1 엔티티 가 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정을 포함하는 제4 정보를 제2 엔티티에 송신하는 단계를 포함할 수 있어, 제2 엔티티는 제4 정보에 포함된 설정에 따라 신호 강도 및/또는 신호 품질의 관련 정보를 수 집 및/또는 보고할 수 있고, 제1 엔티티는 제1 엔티티가 자원 설정을 수행하기 위한 참조 정보를 제공하기 위해 서 제2 엔티티에 의해 수집된 신호 강도 및/또는 신호 품질의 관련 정보를 획득할 수 있다. 신호 강도 및/또는 신호 품질은 수신 신호 강도 지시자(RSSI), 참조 신호 수신 전력(RSRP), 참조 신호 수신 품질(RSRQ), 신호 대 간섭 더하기 잡음 비(SINR) 등일 수 있다. 일부 실시예에서, 제4 정보는 다음 중 하나 이상에 포함될 수 있다: RRC의 측정 RSSI-보고 설정(MeasRSSI- ReportConfig), 새 무선 보고 설정(reportConfigNR), 이벤트 트리거 설정(EventTriggerConfig) in reportConfigNR 및/또는 주기적 보고 설정(PeriodicalReportConfig); 또는 다른 및/또는 새로 정의된 RRC 및/ 또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제4 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 신호 강도 및/또는 신호 품질 수집 및/또는 보고가 트리거되는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제4 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제4 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 채널 점유 임계값: 채널 점유 평가를 위한 신호 강도 및/또는 신호 품질의 임계값을 나타낸다. - 수집된 샘플 수: 채널 점유 평가를 위해 요구된 신호 강도 및/또는 신호 품질의 수집된 샘플 수를 나타낸다. - 최대 수집된 샘플 수: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 최대 수집된 샘플 수 를 나타낸다. (실제) 수집된 샘플 수는 최대 수집된 샘플 수 미만 및/또는 이하일 수 있다. - 최소 수집된 샘플 수: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 최소 수집된 샘플 수 를 나타낸다. (실제) 수집된 샘플 수는 최소 수집된 샘플 수 초과 및/또는 이하일 수 있다. - 샘플 수집 시간 간격: 채널 점유 평가를 위해 사용되는 신호 강도 및/또는 신호 품질의 샘플들을 수집하기 위 한 시간 간격을 나타낸다.- 최대 샘플 수집 시간 간격: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 샘플들을 수집하 기 위한 최대 시간 간격을 나타낸다. 수집을 위한 (실제) 시간 간격은 최대 샘플 수집 시간 간격 미만/이상일 수 있다. - 최소 샘플 수집 시간 간격: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 샘플들을 수집하 기 위한 최소 시간 간격을 나타낸다. 수집을 위한 (실제) 시간 간격은 최소 샘플 수집 시간 간격 초과/이상일 수 있다. 일부 실시예에서, 제2 엔티티는 신호 강도 및/또는 신호 품질을 포함하는 제5 정보를 자신의 상황 및/또는 수신 된 제4 정보에 따라 제1 엔티티에 송신함으로써, 제1 엔티티가 자원 설정을 수행하기 위한 참조 정보를 제공할 수 있다. 신호 강도 및/또는 신호 품질은 수신 신호 강도 지시자(RSSI), 참조 신호 수신 전력(RSRP), 참조 신호 수신 품질(RSRQ), 신호 대 간섭 더하기 잡음 비(SINR) 등일 수 있다. 일부 실시예에서, 제5 정보는 RRC의 측정 결과(MeasResults), 측정 보고(MeasurementReport); 또는 다른 및/또 는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지 중 하나 이상에 포함될 수 있다. 일부 실시예에서, 제5 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 보고된 신호 강도 및/또는 신호 품질에 대응하는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제5 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제5 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 사용되는 채널 점유 임계값: 채널 점유 평가를 위해 사용되는 채널 점유 임계값, 예를 들어, 신호 강도 및/또 는 신호 품질 임계값을 나타낸다. - 사용되는 수집된 샘플 수: 채널 점유 평가를 위해 수집된 신호 강도 및/또는 신호 품질의 수집된 샘플 수를 나타낸다. - 최대 수집된 샘플 수: 채널 점유 평가를 위한 신호 강도 및/또는 신호 품질의 최대 수집된 샘플 수를 나타낸 다. (실제) 수집된 샘플 수는 최대 수집된 샘플 수 미만 및/또는 이하일 수 있다. - 최소 수집된 샘플 수: 채널 점유 평가를 위한 신호 강도 및/또는 신호 품질의 최소 수집된 샘플 수를 나타낸 다. (실제) 수집된 샘플 수는 최소 수집된 샘플 수 초과 및/또는 이하일 수 있다. - 사용되는 샘플 수집 시간 간격: 채널 점유 평가를 위해 사용되는 신호 강도 및/또는 신호 품질의 샘플들을 수 집하기 위한 시간 간격을 나타낸다. - 최대 샘플 수집 시간 간격: 채널 점유 평가를 위한 신호 강도 및/또는 신호 품질의 샘플들을 수집하기 위한 최대 시간 간격을 나타낸다. 수집을 위한 (실제) 시간 간격은 최대 샘플 수집 시간 간격 미만/이상일 수 있다. - 최소 샘플 수집 시간 간격: 채널 점유 평가를 위한 신호 강도 및/또는 신호 품질의 샘플들을 수집하기 위한 최소 시간 간격을 나타낸다. 수집을 위한 (실제) 시간 간격은 최소 샘플 수집 시간 간격 초과/이상일 수 있다. - 신호 강도 및/또는 신호 품질: 신호 강도 및/또는 신호 품질의 수치 값을 나타내기 위해 사용된다. 신호 강도 및/또는 신호 품질은 수신 신호 강도 지시자(RSSI), 참조 신호 수신 전력(RSRP), 참조 신호 수신 품질(RSRQ), 신호 대 간섭 더하기 잡음 비(SINR) 등일 수 있다. - 채널 점유(CO) 시간 백분율: 임계값을 초과 및/또는 임계값 이상의 신호 강도 및/또는 신호 품질의 백분율 및 /또는 임계값 미만 및/또는 이하의 신호 강도 및/또는 신호 품질의 백분율을 나타내기 위해 사용된다. 임계값은 채널 점유 임계값일 수 있다. - 보고 실패에 대한 원인: 수집 실패, 불충분한 표본의 수 등 예 3 본 개시의 제3 양태가 무선 통신 네트워크의 자체 최적화를 지원하는 방법을 제안하며, 이 방법은, 제1 엔티티 가 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황의 정보가 제1 엔티티에 피드백될 필요 가 있음을 제2 엔티티에게 알리기 위해서, 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상 황 요청을 포함하는 제6 정보를 제2 엔티티에 송신하여서, 제1 엔티티가 제2 엔티티 및/또는 다른 엔티티들의비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 획득함으로써, 제1 엔티티가 자체 최적 화 결정을 내리기 위한 참조 정보를 제공할 수 있다. 본 개시에서, 데이터 볼륨의 보고는 데이터 볼륨 예측 및/ 또는 트래픽 예측을 위한 데이터 수집, 예를 들어, 훈련 데이터의 수집, 예측 데이터의 수집, 및/또는 피드백 데이터의 수집 등에 사용될 수 있다. 피드백 데이터는 성능 평가, 예를 들어, 예측 정확도 및/또는 신뢰도 평가 를 위해, 그리고 모델이 계속 적용 가능한지 여부를 결정하기 위해 사용될 수 있다. 예를 들어, 예측의 정확도 가 임계값보다 낮을 때, 모델이 계속 적용될 조건을 충족하지 못하고, 노드들 및/또는 엔티티들이 모델을 업데 이트할 수 있다. 일부 실시예에서, 제6 정보는 다음 중 하나 이상일 수 있다: X2 또는 Xn 또는 F1 또는 E1의 RESOURCE STATUS REQUEST 메시지; 또는 X2의 EN-DC RESOURCE STATUS REQUEST 메시지; 또는 다른 및/또는 새로 정의된 RRC 및/또 는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제6 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에 수반되는 UE 의 식별 및/또는 식별 목록을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제6 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제6 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 신호 강도 및/또는 신호 품질 보고 요청: 신호 강도 및/또는 신호 품질의 정보가 보고되도록 요청됨을 나타내 기 위해 사용된다. 신호 강도 및/또는 신호 품질은 수신 신호 강도 지시자(RSSI), 참조 신호 수신 전력(RSRP), 참조 신호 수신 품질(RSRQ), 신호 대 간섭 더하기 잡음 비(SINR) 등일 수 있다. - 채널 점유 임계값: 채널 점유 평가를 위한 신호 강도 및/또는 신호 품질의 임계값을 나타낸다. - 수집된 샘플 수: 채널 점유 평가를 위해 요구된 신호 강도 및/또는 신호 품질의 수집된 샘플 수를 나타낸다. - 최대 수집된 샘플 수: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 최대 수집된 샘플 수 를 나타낸다. (실제) 수집된 샘플 수는 최대 수집된 샘플 수 미만 및/또는 이하일 수 있다. - 최소 수집된 샘플 수: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 최소 수집된 샘플 수 를 나타낸다. (실제) 수집된 샘플 수는 최소 수집된 샘플 수 초과 및/또는 이하일 수 있다. - 샘플 수집 시간 간격: 채널 점유 평가를 위해 사용되는 신호 강도 및/또는 신호 품질의 샘플들을 수집하기 위 한 시간 간격을 나타낸다. - 최대 샘플 수집 시간 간격: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 샘플들을 수집하 기 위한 최대 시간 간격을 나타낸다. 수집을 위한 (실제) 시간 간격은 최대 샘플 수집 시간 간격 미만/이상일 수 있다. - 최소 샘플 수집 시간 간격: 채널 점유 평가를 위해 요구되는 신호 강도 및/또는 신호 품질의 샘플들을 수집하 기 위한 최소 시간 간격을 나타낸다. 수집을 위한 (실제) 시간 간격은 최소 샘플 수집 시간 간격 초과/이상일 수 있다. - 서비스 자원 스테이터스 및/또는 부하 보고 요청: 단일 및/또는 여러 서비스들의 자원 스테이터스 및/또는 부 하 정보의 보고 요청을 나타내기 위해 사용되며, 여기서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리 오들 등일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통신(mMTC) 등. - 서비스 지시: 보고될 서비스의 유형을 나타내기 위해 사용되며, 이유형은 단일 서비스 또는 여러 서비스들(이 를테면 서비스 목록)일 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이 트 등 중 하나 이상을 포함할 수 있으며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바 일 광대역(eMBB), 대규모 머신 유형 통신(mMTC) 등. - 요청된 보고에 대한 범위: 보고를 위해 요청된 범위를 나타내기 위해 사용되며, 여기서 범위는 다음 중 하나 이상의 것의 식별들 및/또는 식별 목록들일 수 있다: 노드, UE, 셀, 슬라이스, 빔, 서비스, 채널, 프로토콜 데 이터 단위 세션, 데이터 무선 베어러들(DRB), QoS 흐름, QoS 레벨 등. 셀이 하나 이상의 셀 식별에 의해 식별될 수 있다. 슬라이스가 하나 이상의 단일 네트워크 슬라이스 선택 지원 정보(Single Network Slice Selection Assistance Information, S-NSSAI)에 의해 식별될 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품 질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비 스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별 자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통신(mMTC) 등. 채널이 채널 식별에 의해 식별될 수 있다. - 데이터 볼륨 보고 요청: 데이터 볼륨의 정보가 보고되도록 요청됨을 나타내기 위해 사용된다. - 데이터 볼륨 보고에 해당하는 시간 정보: 데이터 볼륨 보고의 시간 정보를 나타내기 위해 사용된다. 이 정보 는 다음 중 하나 이상일 수 있다: 보고 시점, 보고 시간 간격, 보고 시구간 등. 시간 간격이 타이머, 시작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시간 간격의 조합 등에 의해 표현될 수 있다. - 데이터 볼륨 측정에 해당하는 시간 정보: 데이터 볼륨 측정의 시간 정보를 나타내기 위해 사용된다. 이 정보 는 다음 중 하나 이상일 수 있다: 측정 시점, 측정 시간 간격, 측정 시구간 등. 시간 간격이 타이머, 시작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시간 간격의 조합 등에 의해 표현될 수 있다. - 보고 콘텐츠의 측정 시간 정보: 보고될 필요가 있는 파라미터들의 측정 시간 정보를 나타내기 위해 사용된다. 이 정보는 다음 중 하나 이상일 수 있다: 측정 시점, 측정 시간 간격, 측정 시구간 등. 시간 간격이 타이머, 시 작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시간 간격의 조합 등에 의해 표현될 수 있다. - 보고 콘텐츠: 보고될 필요가 있는 파라미터들을 나타내기 위해 사용된다. 보고 예측 파라미터들은 다음 중 하 나 이상을 포함한다: 전송 네트워크 계층(Transport Network Layer, TNL) 용량 지시자, 무선 자원 스테이터스, 복합 가용 용량 그룹, 복합 가용 자원 그룹, 활성 UE 수, 무선 자원 제어(RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시자, ABS(Almost Blank Subframe) 스테 이터스, 참조 신호 수신 전력(RSRP) 측정 보고 목록, 참조 신호 수신 품질(RSRQ) 측정 보고, 신호 대 간섭 더하 기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시자, 채널 점유 시간 백분율, 에너지 검출 임계값, 신호 강도 및/또는 신호 품질, 채널 바쁨 백분율, 데이터 볼륨, 및 다양한 콘텐츠 파라미터들의 지터 등. 본 개시에서 지터는 파라미터의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신의 인스턴스들, 이 웃 셀의 인스턴스들, 다른 공존 기술들(예를 들어, 무선 국부 영역 네트워크(WLAN), 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평 균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스턴스들일 수 있다. 일부 실시예에서, 제6 정보는 자원 스테이터스 및/또는 부하 상황의 예측 정보를 또한 포함할 수 있다. 더 구체 적으로, 제6 정보는 다음 필드들 또는 중 하나 이상 또는 관련 정보를 또한 포함할 수 있다: - 예측 사용자 장비 식별: 자원 스테이터스 및/또는 부하 상황 예측에 수반되는 UE의 식별을 나타내기 위해 사 용된다. - 비면허 대역 예측 식별: 비면허 대역의 자원 스테이터스 및/또는 부하 상황의 예측을 위한 요청을 나타내기 위해 사용된다. - 예측 등록 요청: 예측의 시작, 종료 및 추가를 나타내기 위해 사용된다. - 요청된 예측을 위한 시간 간격: 예측을 위한 시점 및/또는 시간 간격을 나타내기 위해 사용된다. 시간은 상대 시간 또는 절대 시간일 수 있다. 시간 간격이 타이머, 시작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시 간 간격의 조합 등에 의해 표현될 수 있다. 시간 간격이라면, 이는 2*n개 비트에 의해 표현될 수 있으며, 예를 들어, 처음 n개 비트는 예측 시작 시간을 나타내고 마지막 n개 비트는 예측 종료 시간을 나타낸다. 이는 다음중 하나 이상을 포함하는, 별개의 필드들에 의해 또한 표현될 수 있다: o 예측 시작 시간: 예측의 시작 시간을 나타내기 위해 사용된다. 시작 시간은 상대 시간 또는 절대 시간일 수 있다. o 예측 종료 시간: 예측의 종료 시간을 나타내기 위해 사용된다. 종료 시간은 상대 시간 또는 절대 시간일 수 있다. - 요청된 예측 콘텐츠에 대한 적용 가능한(또는 유효성) 시간: 예측 콘텐츠에 대응하는 예측 시점 및/또는 예측 시간 간격을 나타내기 위해 사용된다. 시간은 상대 시간 또는 절대 시간일 수 있다. 시간 간격이 타이머, 시작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시간 간격의 조합 등에 의해 표현될 수 있다. 시간 간격이라면, 이는 2*n개 비트에 의해 표현될 수 있으며, 예를 들어, 처음 n개 비트는 시작 시간을 나타내고 마 지막 n개 비트는 종료 시간을 나타낸다. 이는 다음 중 하나 이상을 포함하는, 별개의 필드들에 의해 또한 표현 될 수 있다: o 시작 시간: 적용 가능한(또는 유효성) 시간의 시작 시간을 나타내기 위해 사용된다. 시작 시간은 상대 시간 또는 절대 시간일 수 있다. o 종료 시간: 적용 가능한(또는 유효성) 시간의 종료 시간을 나타내기 위해 사용된다. 종료 시간은 상대 시간 또는 절대 시간일 수 있다. - 요청된 예측에 대한 범위: 예측 위해 요청된 범위를 나타내기 위해 사용되며, 여기서 범위는 다음 중 하나 이 상의 것의 식별들 및/또는 식별 목록들일 수 있다: 노드, UE, 셀, 슬라이스, 빔, 서비스, 채널, 프로토콜 데이 터 단위 세션, 데이터 무선 베어러들(DRB), QoS 흐름, QoS 레벨 등. 셀이 하나 이상의 셀 식별에 의해 식별될 수 있다. 슬라이스가 하나 이상의 단일 네트워크 슬라이스 선택 지원 정보(S-NSSAI)에 의해 식별될 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으 며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통 신(mMTC) 등. 채널이 채널 식별에 의해 식별될 수 있다. - 예측 콘텐츠: 예측될 필요가 있는 파라미터들을 나타내기 위해 사용된다. 예측 파라미터들은 다음 중 하나 이 상을 포함한다: 전송 네트워크 계층(TNL) 용량 지시자, 무선 자원 스테이터스, 복합 가용 용량 그룹, 복합 가용 자원 그룹, 활성 UE 수, 무선 자원 제어(RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시자, ABS(Almost Blank Subframe) 스테이터스, 참조 신호 수신 전력(RSRP) 측정 보고 목록, 참조 신호 수신 품질(RSRQ) 측정 보고, 신호 대 간섭 더하기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시자, 채널 점유 시간 백분율, 에너지 검출 임계값, 신호 강도 및/또는 신호 품질, 채널 바쁨 백분율, 데이터 볼륨, 및 다양한 콘텐츠 파라미터들의 지터 등. 본 개시에서 지터는 파라미터 의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신의 인스턴스들, 이웃 셀의 인스턴스들, 다른 공존 기술들(예를 들어, 무선 국부 영역 네트워크(WLAN), 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스턴스들일 수 있다. - 예측 보고 기간: 예측 콘텐츠의 주기적 보고를 위한 간격을 나타내기 위해 사용된다. 보고 기간은 또한 보고 된 데이터의 예측 시간일 수 있다. 이 필드에 콘텐츠이 없다면, 이는 단일 보고가 적합하고, 단일 보고의 예측 시간이 예측 시작 시간부터 예측 종료 시간까지임을 의미한다. - 결과 및/또는 예측 모델의 정확도가 보고될 필요가 있다는 지시: 예측 결과들 및/또는 예측 모델들의 정확도 가 보고될 필요가 있다는 지시를 나타낸다. 본 개시에서 정확도는 정확도, 신뢰도 등일 수 있다. - 부분적 보고의 지원의 식별: 요청된 콘텐츠의 일부 보고만 허용하는지 여부를 나타내기 위해 사용된다. 이 필 드는 단일 비트에 의해 표현될 수 있으며, 예를 들어, 비트가 1일 때, 이는 부분적 보고가 허용됨을 의미하고, 비트가 0일 때, 이는 부분적 보고가 허용되지 않음을 의미하며; 대안적으로, 비트가 0일 때, 이는 부분적 보고 가 허용됨을 의미하고, 비트가 1일 때, 이는 부분적 보고가 허용되지 않음을 의미한다. 이 식별은 다음 중 하나 이상에 관한 것일 수 있다: 측정 결과들 및/또는 콘텐츠들, 예측 결과들 및/또는 콘텐츠들, 비-예측 결과들 및/또는 콘텐츠들 등. - 보고 필요성의 지시: 보고 요청된 콘텐츠 및/또는 예측 콘텐츠의 보고 필요성을 나타내기 위해 사용되며, 예 를 들어, 이는 콘텐츠의 일부가 보고되어야 하는지 여부를 나타낼 수 있다. 이 지시는 다음 중 하나 이상을 포 함할 수 있다: 보고해야 한다, 보고할 수 있다, 보고할 필요가 있다 등. 필요성의 정도는 숫자들로 표현될 수 있다. 이 지시는 보고 요청되는 전체 콘텐츠 및/또는 예측 콘텐츠를 목표로 할 수 있거나, 또는 그 중 하나 이 상의 특정 보고 파라미터 및/또는 예측된 파라미터를 목표로 할 수 있다. 필요성은 중요해질 수 있다. 보고 필 요성은 또한 콘텐츠의 중요도일 수 있다. - 보고를 트리거하는 조건 및/또는 이벤트: 보고 조건 및/또는 이벤트가 충족될 때, 보고는 트리거된다. 보고 조건 및/또는 이벤트는 파라미터 및/또는 예측 파라미터가 특정한 임계값을 초과 및/또는 특정한 임계값 이상 및/또는 미만 및/또는 이하이거나, 또는 신뢰도가 특정한 임계값을 초과 및/또는 특정한 임계값 이상 및/또는 미만 및/또는 이하인 것일 수 있다. 파라미터 및/또는 예측 파라미터는 보고 콘텐츠 및/또는 예측 콘텐츠에서의 파라미터일 수 있다. 보고는 예측 콘텐츠의 보고 또는 비-예측 콘텐츠의 보고일 수 있다. 비-예측 콘텐츠는 위 에서 언급된 보고 콘텐츠일 수 있다. 일부 실시예에서, 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에 대한 응답을 포함하는 제7 정보를 위에서 설명된 바와 같은 제6 정보에 포함된 요청 정보에 따라 제1 엔티티에 송신함으로써, 제1 엔티티에 보고될 수 있는지 여부를 피드백할 수 있다. 일부 실시예에서, 제7 정보는 다음 중 하나 이상에 포함될 수 있다: X2 또는 Xn 또는 F1 또는 E1의 RESOURCE STATUS RESPONSE 메시지 또는 RESOURCE STATUS FAILURE 메시지; 또는 X2의 EN-DC 자원 스테이터스 응답 메시지 또는 EN-DC 자원 스테이터스 FAILURE 메시지; 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또 는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제7 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에 대한 응답에 수반되는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제7 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제7 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 예측 요청 확인: 이는 예측 자원 정보가 송신될 수 있는지 여부를 식별하기 위한 단일 비트일 수 있다. 예를 들어, 1은 예측 자원 정보가 송신될 수 있음을 나타내고, 0은 예측 자원 정보가 송신될 수 없음을 나타낸다. 대 안적으로, 0은 예측 자원 정보가 송신될 수 있음을 나타내고, 1은 예측 자원 정보가 송신될 수 없음을 나타낸다. - 하나씩 예측 요청 콘텐츠 확인: 이는 각각의 비트가 하나의 예측 내용에 해당하는 비트맵의 형태일 수 있다. 예를 들어, 비트가 1일 때, 이는 해당 예측 콘텐츠의 예측 자원 정보가 송신될 수 있음을 의미하며, 비트가 0일 때, 이는 해당 예측 콘텐츠의 예측 자원 정보가 송신될 수 없음을 의미한다. 이는 또한 상이한 예측 콘텐츠 확 인을 지시하기 위한 별개의 필드들일 수 있다. - 보고가능 콘텐츠: 보고될 수 있는 콘텐츠 및/또는 콘텐츠 목록을 나타내며, 여기서 콘텐츠는 실제 콘텐츠 또 는 예측 콘텐츠일 수 있고, 다음 중 하나 이상을 포함한다: 전송 네트워크 계층(TNL) 용량 지시자, 무선 자원 스테이터스, 복합 가용 용량 그룹, 복합 가용 자원 그룹, 활성 UE 수, 무선 자원 제어(RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시자, ABS(Almost Blank Subframe) 스테이터스, 참조 신호 수신 전력(RSRP) 측정 보고 목록, 참조 신호 수신 품질(RSRQ) 측정 보고, 신 호 대 간섭 더하기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시자, 채널 점유 시간 백분 율, 에너지 검출 임계값, 신호 강도 및/또는 신호 품질, 채널 바쁨 백분율, 데이터 볼륨, 및 다양한 콘텐츠 파 라미터들의 지터 등. 본 개시에서 지터는 파라미터의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신 의 인스턴스들, 이웃 셀의 인스턴스들, 다른 공존 기술들(예를 들어, WLAN, 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스 턴스들일 수 있다. 그 콘텐츠는 또한 전체적으로 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전체적으로 보고될 수 있음을 의미하며, 비트가 0일 때, 이는 부분적으로 보고될 수 있고 그리고/또는 전혀 보고될 수 없음을 의미한다. 그 콘텐츠는 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전혀 보고될 수 없음을 의미하고, 비트가 0일 때, 이는 부분적으로 및/또는 전체적으로 보고될 수 있음을 의미한다. - 비-보고가능 콘텐츠: 보고될 수 없는 콘텐츠 및/또는 목록을 나타내며, 여기서 콘텐츠는 실제 콘텐츠 또는 예 측 콘텐츠일 수 있고, 다음 중 하나 이상을 포함한다: 전송 네트워크 계층(TNL) 용량 지시자, 무선 자원 스테이 터스, 복합 가용 용량 그룹, 복합 가용 자원 그룹, 활성 UE 수, 무선 자원 제어(RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시자, ABS(Almost Blank Subframe) 스테이터스, 참조 신호 수신 전력(RSRP) 측정 보고 목록, 참조 신호 수신 품질(RSRQ) 측정 보고, 신 호 대 간섭 더하기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시자, 채널 점유 시간 백분 율, 에너지 검출 임계값, 신호 강도 및/또는 신호 품질, 채널 바쁨 백분율, 데이터 볼륨, 및 다양한 콘텐츠 파 라미터들의 지터 등. 본 개시에서 지터는 파라미터의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신 의 인스턴스들, 이웃 셀의 인스턴스들, 다른 공존 기술들(예를 들어, WLAN, 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스 턴스들일 수 있다. 그 콘텐츠는 또한 전체적으로 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전체적으로 보고될 수 있음을 의미하며, 비트가 0일 때, 이는 부분적으로 보고 될 수 있고 그리고/또는 전혀 보고될 수 없음을 의미한다. 그 콘텐츠는 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전혀 보고될 수 없음을 의미하고, 비트가 0일 때, 이는 부분적으로 및/또는 전체적으로 보고될 수 있음을 의미한다. - 보고가능 콘텐츠 범위: 보고가능 콘텐츠들의 범위를 나타내기 위해 사용되며, 여기서 범위는 다음 중 하나 이 상의 것의 식별들 및/또는 식별 목록들일 수 있다: 노드, UE, 셀, 슬라이스, 빔, 서비스, 채널, 프로토콜 데이 터 단위 세션, 데이터 무선 베어러들(DRB), QoS 흐름, QoS 레벨 등. 셀이 하나 이상의 셀 식별에 의해 식별될 수 있다. 슬라이스가 하나 이상의 단일 네트워크 슬라이스 선택 지원 정보(S-NSSAI)에 의해 식별될 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으 며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통 신(mMTC) 등. 채널이 채널 식별에 의해 식별될 수 있다. 그 콘텐츠는 또한 전체적으로 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전체적으로 보고될 수 있음을 의미하며, 비트가 0일 때, 이는 부분적으로 보고될 수 있고 그리고/또는 전혀 보고될 수 없음을 의미한다. 그 콘텐츠는 보 고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전혀 보고될 수 없음을 의미하고, 비트가 0일 때, 이는 부분적으로 및/또는 전체적으로 보고될 수 있음을 의미한다. - 비-보고가능 콘텐츠 범위: 비-보고가능 콘텐츠들의 범위를 나타내기 위해 사용되며, 여기서 범위는 다음 중 하나 이상의 것의 식별들 및/또는 식별 목록들일 수 있다: 노드, UE, 셀, 슬라이스, 빔, 서비스, 채널, 프로토 콜 데이터 단위 세션, 데이터 무선 베어러들(DRB), QoS 흐름, QoS 레벨 등. 셀이 하나 이상의 셀 식별에 의해 식별될 수 있다. 슬라이스가 하나 이상의 단일 네트워크 슬라이스 선택 지원 정보(S-NSSAI)에 의해 식별될 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함 할 수 있으며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다 음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통신(mMTC) 등. 채널이 채널 식별에 의해 식별될 수 있다. 그 콘텐츠는 또한 전체적으로 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전체적으로 보고될 수 있 음을 의미하며, 비트가 0일 때, 이는 부분적으로 보고될 수 있고 그리고/또는 전혀 보고될 수 없음을 의미한다. 그 콘텐츠는 보고될 수 있는지 여부를 하나의 비트에 의해 나타낼 수 있다. 예를 들어, 비트가 1일 때, 이는 전 혀 보고될 수 없음을 의미하고, 비트가 0일 때, 이는 부분적으로 및/또는 전체적으로 보고될 수 있음을 의미한 다. - 원인: 요청 실패 원인을 나타내기 위해 사용되며, 예를 들어, 이는 다음 중 하나 이상을 포함할 수 있다: 자 원 스테이터스 및/또는 부하 상황 예측 실패, 비면허 대역의 자원 스테이터스 및/또는 부하 상황 예측 실패, 자 원 스테이터스 및/또는 부하 상황의 예측 능력 없음, 비면허 대역의 자원 스테이터스 및/또는 부하 상황의 예측 능력 없음, 데이터 볼륨 정보 없음, 데이터 볼륨 예측 능력 없음, 전체적 보고 실패, 요청된 예측 콘텐츠의 예 측 능력 없음, 인공지능 및/또는 기계 학습 능력 없음, 그리고 예측 신뢰도 및/또는 정확도가 요건을 충족할 수 없음. - 예측 신뢰도: 예측 결과 및/또는 예측 모델의 신뢰도 및/또는 정확도를 나타낸다. - 요청 실패 지시: 요청이 실패했음을 나타내기 위하여 사용된다. 예를 들어, 이 지시는 한 비트에 의해 나타내 어질 수 있다. 비트가 1일 때, 이는 요청이 실패했음을 의미하며, 비트가 0일 때, 이는 보고가 이루어질 수 있 음을 의미하거나; 또는 비트가 0일 때, 이는 요청이 실패했음을 의미하고, 비트가 1일 때, 이는 보고가 이루어 질 수 있음을 의미한다. 요청 실패는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요 청이 실패했음을 나타낼 수 있다. 일부 실시예에서, 제6 정보에서의 부분적 보고의 지원 식별이 부분적 보고가 지원되지 않음을 나타낼 때, 제2 엔티티가 모든 요청된 콘텐츠들을 보고할 수 없을 때, 제2 엔티티는 요청 실패를 포함하는 제7 정보의 메시지를 제1 엔티티에 송신하며; 제6 정보에서의 부분적 보고의 지원 식별이 부분적 보고가 지원됨을 나타낼 때, 제2 엔 티티가 모든 요청된 콘텐츠들을 보고할 수 있을 때, 제2 엔티티는 제7 정보를 통해 보고 가능한 콘텐츠들을 제1 엔티티에게 알린다. 이 구현예는 제2 엔티티가 모든 요청된 콘텐츠들을 보고할 수 없다는 문제를 유연하게 해설 할 수 있고, 이는 제1 엔티티의 지시에 따른 상황에 따라 보고 가능한 콘텐츠들을 보고할 수 있거나, 또는 요청 실패를 포함하는 정보를 송신함으로써, 요청된 콘텐츠들 중 하나 이상이 보고될 수 없음으로 인해 모든 요청된 콘텐츠들이 보고될 수 없는 것을 피할 수 있다. 일부 실시예에서, 제6 정보에서의 보고 필요성 지시가 콘텐츠가 보고되어야 함을 지시할 때, 요청된 엔티티(예 를 들어, 제2 엔티티)는 콘텐츠를 보고해야 한다. 보고될 수 없다면, 요청된 엔티티는 요청 실패를 포함하는 제 7 정보를 요청 엔티티(예를 들어, 제1 엔티티)에 송신한다. 제6 정보에서의 보고 필요성 지시가 콘텐츠가 보고 될 수 있는 콘텐츠임을 나타날 때, 요청된 엔티티는 보고될 수 있는 콘텐츠를 요청 엔티티에 제7 정보를 통해 보고할 수 있고 그리고/또는 관련 콘텐츠를 자신의 상황에 따라 제8 정보를 통해 송신할 수 있다. 예를 들어, 자신의 상황은 예측을 수행할 수 있는지 여부, 해당 정보의 일부를 갖는지 여부 등을 포함할 수 있다. 이 구현 예는 제2 엔티티가 모든 요청된 콘텐츠들을 보고할 수 없는 문제를 유연하게 해결할 수 있어, 요청된 콘텐츠들 중 하나 이상이 보고될 수 없음으로 인해 모든 요청된 콘텐츠들이 보고될 수 없는 것을 피할 수 있다. 제2 엔티 티는 또한 자신의 보고된 콘텐츠들을 보고 필요성에 따라 합리적으로 배열할 수 있으며, 예를 들어, 이는 필요 성이 높은 콘텐츠를 선택할 수 있다. 일부 실시예에서, 예를 들어, 보고되도록 요청되는 예측 콘텐츠의 일부만 이 컴퓨팅 전력의 제한으로 인해 예측될 수 있다면, 제2 엔티티는 필요성이 높은 콘텐츠를 선택하여 필요성에 따라 예측하고 보고할 수 있다. 일부 실시예에서, 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 포함하 는 제8 정보를 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에서의 설정에 따라 및/또는 제2 엔티티의 상황(예를 들어, 자원 스테이터스 및/또는 부하 상황이 너무 높거나 너무 낮음)에 따라 자율적으로 제1 엔티티에 송신할 수 있어, 제1 엔티티는 제2 엔티티 및/또는 다른 엔티티들의 비면허 대역 및/ 또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 획득함으로써, 제1 엔티티가 자체 최적화 결정을 내리 기 위한 참조 정보를 제공할 수 있다. 일부 실시예에서, 제8 정보는 다음 중 하나 이상에 포함될 수 있다: X2 또는 Xn 또는 F1 또는 E1의 RESOURCE STATUS UPDATE 메시지; 또는 X2의 EN-DC 자원 스테이터스 UPDATE 메시지; 또는 F1의 EN-DC RESOURCE STATUS UPDATE 지시 메시지; 또는 E1의 gNB-CU-UP STATUS INDICATION 메시지; 또는 다른 및/또는 새로 정의된 RRC 및/ 또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제8 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황에 수반되는 UE의 식 별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제8 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제8 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 신호 강도 및/또는 신호 품질: 신호 강도 및/또는 신호 품질의 수치 값을 나타내기 위해 사용된다. 신호 강도 및/또는 신호 품질은 수신 신호 강도 지시자(RSSI), 참조 신호 수신 전력(RSRP), 참조 신호 수신 품질(RSRQ), 신호 대 간섭 더하기 잡음 비(SINR) 등일 수 있다. - 사용되는 채널 점유 임계값: 채널 점유 평가를 위해 사용되는 채널 점유 임계값, 예를 들어, 신호 강도 및/또 는 신호 품질 임계값을 나타낸다. - 채널 바쁨 백분율: 임계값을 초과 및/또는 임계값 이상의 신호 강도 및/또는 신호 품질의 백분율 및/또는 임 계값 미만 및/또는 이하의 신호 강도 및/또는 신호 품질의 백분율을 나타내기 위해 사용된다. 임계값은 채널 점 유 임계값일 수 있다. 위의 파라미터들은 자신의 인스턴스들, 이웃 셀의 인스턴스들, 다른 공존 기술들(예를 들 어, WLAN, 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴 스들, 그리고 업링크 및 다운링크를 위한 인스턴스들일 수 있다. - 자원 백분율: 채널 자원들에 대한 모니터링된 및/또는 사용된 및/또는 할당된 자원들의 백분율을 나타내기 위 해 사용된다. 채널 자원들은 비면허 대역의 자원들, 예를 들어, 20MHz 자원 청크일 수 있다. - 최대 에너지 검출 임계값: 특정 자원에서 사용되는 최대 에너지 검출 임계값을 나타내기 위해 사용된다. 예를 들어, 특정 자원은 하나 이상의 채널, 또는 하나 이상의 자원 청크 등일 수 있다. - 보고된 정보에 대응하는 서비스 지시: 보고된 자원 스테이터스 및/또는 부하 정보에 대응하는 서비스 유형을 나타내기 위해 사용되며, 이 유형은 단일 서비스 또는 여러 서비스들(이를테면 서비스 목록)일 수 있다. 본 개 시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보 이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있 다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유 형 통신(mMTC) 등. - 보고 콘텐츠: 자원 스테이터스 및/또는 부하 상황을 나타내기 위해 사용되는 파라미터. 이 파라미터는 다음 중 하나 이상을 포함한다: 전송 네트워크 계층(TNL) 용량 지시자, 무선 자원 스테이터스, 복합 가용 용량 그룹, 복합 가용 자원 그룹, 활성 UE 수, 무선 자원 제어(RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시 자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시자, ABS(Almost Blank Subframe) 스테이터스, 참조 신호 수신 전력(RSRP) 측정 보고 목록, 참조 신호 수신 품질(RSRQ) 측정 보고, 신호 대 간섭 더하기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시자, 채널 점유 시간 백분율, 에너지 검출 임계값, 신호 강도 및/ 또는 신호 품질, 채널 바쁨 백분율, 데이터 볼륨, 및 다양한 콘텐츠 파라미터들의 지터 등. 본 개시에서 지터는 파라미터의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신의 인스턴스들, 이웃 셀의 인스턴스들, 다 른 공존 기술들(예를 들어, WLAN, 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스턴스들일 수 있다. - 보고 콘텐츠에 대한 적용 가능한(또는 유효성) 시간: 보고 콘텐츠의 적용 가능한(또는 유효성) 시점 및/또는 시간 간격을 나타내기 위해 사용된다. 시간은 상대 시간 또는 절대 시간일 수 있다. 시간 간격이 타이머, 시작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시간 간격의 조합 등에 의해 표현될 수 있다. 시간 간격이라면, 이는 시작 시간과 종료 시간을 포함할 수 있으며, 이는 2*n개 비트에 의해 나타내어질 수 있다. 예 를 들어, 처음 n개 비트는 시작 시간을 나타내고 마지막 n개 비트는 종료 시간을 나타낸다. 이는 다음 중 하나 이상을 포함하는, 별개의 필드들에 의해 또한 표현될 수 있다: o 보고 콘텐츠에 대한 적용 가능한 시작 시간: 자원 스테이터스 및/또는 부하 정보에 적용 가능한 시작 시간을 나타내기 위해 사용된다. 시작 시간은 상대 시간 또는 절대 시간일 수 있다. o 보고 콘텐츠에 대한 적용 가능한 종료 시간: 자원 스테이터스 및/또는 부하 정보에 적용 가능한 종료 시간을 나타내기 위해 사용된다. 종료 시간은 상대 시간 또는 절대 시간일 수 있다. - 보고 콘텐츠에 대응하는 범위: 보고 콘텐츠에 대응하는 범위를 나타내기 위해 사용되며, 여기서 범위는 다음 중 하나 이상의 식별들 및/또는 식별 목록들일 수 있다: 노드, UE, 셀, 슬라이스, 빔, 서비스, 채널, 프로토콜데이터 단위 세션, 데이터 무선 베어러(DRB), QoS 흐름, QoS 레벨 등. 셀이 하나 이상의 셀 식별에 의해 식별될 수 있다. 슬라이스가 하나 이상의 단일 네트워크 슬라이스 선택 지원 정보(S-NSSAI)에 의해 식별될 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으 며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통 신(mMTC) 등. 채널이 채널 식별에 의해 식별될 수 있다. - 보고를 트리거하는 조건 및/또는 이벤트: 보고를 트리거하는 조건 및/또는 이벤트. 보고 조건 및/또는 이벤트 는 파라미터 및/또는 예측 파라미터가 특정한 임계값을 초과 및/또는 특정한 임계값 이상 및/또는 미만 및/또는 이하이거나, 또는 신뢰도가 특정한 임계값을 초과 및/또는 특정한 임계값 이상 및/또는 미만 및/또는 이하인 것 일 수 있다. 파라미터 및/또는 예측 파라미터는 보고 콘텐츠 및/또는 예측 결과에서의 파라미터일 수 있다. 보 고는 예측 콘텐츠의 보고 또는 비-예측 콘텐츠의 보고일 수 있다. 비-예측 콘텐츠는 위에서 언급된 보고 콘텐츠 일 수 있다. 일부 실시예에서, 제8 정보는 자원 스테이터스 및/또는 부하에 대한 예측 정보를 포함할 수 있고, 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 예측 콘텐츠 예측 식별: 자원 스테이터스 및/또는 부하 정보가 예측 콘텐츠인지 여부를 나타내기 위해 사용된 다. 이 필드는 단일 비트에 의해 나타내어질 수 있으며, 예를 들어, 1은 해당 정보가 예측 콘텐츠임을 나타내고 0은 해당 정보가 실제 스테이터스 콘텐츠임을 나타낸다. - 예측 콘텐츠에 대한 적용 가능한(또는 유효성) 시간: 자원 스테이터스 및/또는 부하 정보의 예측 적용 가능한 (또는 유효성) 시점 및/또는 시간 간격을 나타내기 위해 사용된다. 시간은 상대 시간 또는 절대 시간일 수 있다. 시간 간격이 타이머, 시작 시간 및 종료 시간의 조합, 그리고 시작 시간 및 시간 간격의 조합 등에 의해 표현될 수 있다. 시간 간격이라면, 이는 시작 시간과 종료 시간을 포함할 수 있으며, 이는 2*n개 비트에 의해 나타내어질 수 있다. 예를 들어, 처음 n개 비트는 시작 시간을 나타내고 마지막 n개 비트는 종료 시간을 나타낸 다. 이는 다음 중 하나 이상을 포함하는, 별개의 필드들에 의해 또한 표현될 수 있다: o 예측 콘텐츠에 대한 적용 가능한 시작 시간: 자원 스테이터스 및/또는 부하 정보에 적용 가능한 시작 시간을 나타내기 위해 사용된다. 시작 시간은 상대 시간 또는 절대 시간일 수 있다. o 예측 콘텐츠에 대한 적용 가능한 종료 시간: 자원 스테이터스 및/또는 부하 정보에 적용 가능한 종료 시간을 나타내기 위해 사용된다. 종료 시간은 상대 시간 또는 절대 시간일 수 있다. - 자원 스테이터스 및/또는 부하의 보고된 정보: 보고된 자원 스테이터스 및/또는 부하의 정보를 나타내기 위해 사용된다. 자원 스테이터스 및/또는 부하의 정보는 다음 중 하나 이상을 포함한다: 전송 네트워크 계층(TNL) 용 량 지시자, 무선 자원 스테이터스, 복합 가용 용량 그룹, 복합 가용 자원 그룹, 활성 UE 수, 무선 자원 제어 (RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시 자, ABS(Almost Blank Subframe) 스테이터스, 참조 신호 수신 전력(RSRP) 측정 보고 목록, 참조 신호 수신 품 질(RSRQ) 측정 보고, 신호 대 간섭 더하기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시 자, 채널 점유 시간 백분율, 에너지 검출 임계값, 신호 강도 및/또는 신호 품질, 채널 바쁨 백분율, 데이터 볼 륨, 및 다양한 콘텐츠 파라미터들의 지터 등. 본 개시에서 지터는 파라미터의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신의 인스턴스들, 이웃 셀의 인스턴스들, 다른 공존 기술들(예를 들어, WLAN, 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스 의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스턴스들일 수 있다. - 예측 결과: 요청된 예측 파라미터들의 예측 결과들을 나타내기 위해 사용된다. 예측 결과들은 다음 중 하나 이상을 포함한다: 전송 네트워크 계층(TNL) 용량 지시자, 무선 자원 스테이터스, 복합 가용 용량 그룹, 복합 가 용 용량 그룹, 활성 UE 수, 무선 자원 제어(RRC) 연결 수, 슬라이스 가용 용량, 하드웨어(HW) 용량 지시자, S1 TNL 부하 지시자, 하드웨어(HW) 부하 지시자, ABS(Almost Blank Subframe) 스테이터스, 참조 신호 수신 전력 (RSRP) 측정 보고 목록, 참조 신호 수신 품질(RSRQ) 측정 보고, 신호 대 간섭 더하기 잡음 비(SINR) 측정 보고, 채널 상태 정보(CSI) 보고, 셀 보고 지시자, 채널 점유 시간 백분율, 에너지 검출 임계값, 신호 강도 및/또는신호 품질, 채널 바쁨 백분율, 데이터 볼륨, 및 다양한 콘텐츠 파라미터들의 지터 등. 본 개시에서 지터는 파라 미터의 분산 또는 표준 편차일 수 있다. 위의 파라미터들은 자신의 인스턴스들, 이웃 셀의 인스턴스들, 다른 공 존 기술들(예를 들어, WLAN, 블루투스 등)의 인스턴스들, 자신의 인스턴스 및 이웃 셀의 인스턴스의 합, 또는 자신의 인스턴스 및 이웃 셀의 인스턴스의 평균일 수 있다. 위의 파라미터들은 업링크를 위한 인스턴스들, 다운 링크를 위한 인스턴스들, 그리고 업링크 및 다운링크를 위한 인스턴스들일 수 있다. - 예측 결과에 대응하는 범위: 예측 결과에 대응하는 범위를 나타내기 위해 사용되며, 여기서 범위는 다음 중 하나 이상의 식별들 및/또는 식별 목록들일 수 있다: 노드, UE, 셀, 슬라이스, 빔, 서비스, 채널, 프로토콜 데 이터 단위 세션, 데이터 무선 베어러들(DRB), QoS 흐름QoS 레벨 등. 셀이 하나 이상의 셀 식별에 의해 식별될 수 있다. 슬라이스가 하나 이상의 단일 네트워크 슬라이스 선택 지원 정보(S-NSSAI)에 의해 식별될 수 있다. 본 개시에서 서비스들은 서비스 유형들, 서비스 품질(QoS), 시나리오들일 수 있다. 본 개시에서 서비스 유형들은 보이스 서비스, 비디오 서비스, 가상 현실 서비스, 증강 현실 서비스, 호 서비스 등 중 하나 이상을 포함할 수 있다. 서비스 품질은 지연, 스루풋, 신뢰, 패킷 손실 레이트, 데이터 레이트 등 중 하나 이상을 포함할 수 있으 며, 이는 5G QoS 식별자(5QI), QoS 클래스 식별자(QCI) 등에 의해 식별될 수 있다. 시나리오들은 다음 중 하나 이상을 포함할 수 있다: 초고신뢰 저 레이턴시 통신(URLLC), 향상된 모바일 광대역(eMBB), 대규모 머신 유형 통 신(mMTC) 등. 채널이 채널 식별에 의해 식별될 수 있다. - 예측 신뢰도: 예측 결과 및/또는 예측 모델의 신뢰도 및/또는 정확도를 나타낸다. 예 4 본 개시의 제4 양태가 무선 통신 네트워크의 자체 최적화를 지원하는 방법을 제안하며, 이 방법은 다음을 포함 할 수 있다: 제1 엔티티는 채널 바쁨 스테이터스 체크를 위한 조건 설정을 포함하는 제9 정보를 제2 엔티티에 송신함으로써, 제2 엔티티가 채널 바쁨 스테이터스에서 셀로 전환하여 성능에 영향을 미치는 것을 방지하고, 제 2 엔티티가 조건부 핸드오버를 성공적으로 수행하는 것을 가능하게 하는 등을 할 수 있다. 일부 실시예에서, 제9 정보는 다음 중 하나 이상에 포함될 수 있다: RRC의 CondTriggerConfig, ReportConfigNR, ReportConfig, ReportConfigToAddMod, ReportConfigToAddModList; 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제9 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 채널 바쁨 스테이터스 체크를 위한 조건 설정에 수반되는 UE의 식별을 나타내기 위해 사용 된다. - 송신 엔티티 식별: 제9 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제9 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 신호 강도 및/또는 신호 품질 임계값: 이 임계값은 검출된 신호 강도 및/또는 신호 품질이 조건을 충족하는지 여부를 결정하기 위해 사용된다. 예를 들어, 검출된 신호 강도 및/또는 신호 품질이 임계값을 초과 및/또는 임 계값 이상일 때, 또는 검출된 신호 강도 및/또는 신호 품질이 임계값 미만 및/또는 이하일 때, 조건은 충족된다 고 결정된다. 임계값은 하나 또는 여러 개일 수 있다. 여러 임계값이 있는 경우, 임계값들 중 하나가 충족될 때 또는 여러 임계값이 동일한 시간에 충족될 때 조건은 충족된다고 결정될 수 있다. 일부 실시예에서, 예를 들어, 이는 RSSI의 임계값일 수 있고, 검출된 RSSI가 임계값 미만 및/또는 이하일 때, 후속 동작들은 트리거될 수 있 으며, 예를 들어, 조건부 핸드오버는 트리거될 수 있다. 예를 들어, RSRP 및/또는 RSRQ 및/또는 SINR이 임계값 을 초과하며 및/또는 임계값 이상일 때, 그리고/또는 검출된 RSSI가 임계값 미만 및/또는 임계값 이하일 때, 후 속 동작들은 트리거될 수 있으며, 예를 들어, 조건부 핸드오버는 트리거될 수 있다는 것일 수 있다. - 채널 바쁨 백분율 임계: 이 임계는 검출된 채널 바쁨 백분율이 조건을 충족하는지 여부를 결정하기 위해 사용 된다. 예를 들어, 검출된 채널 바쁨 백분율이 임계값을 초과 및/또는 임계값 이상일 때, 또는 검출된 채널 바쁨 백분율이 임계값 미만 및/또는 이하일 때, 조건은 충족된다고 결정된다. 임계값은 하나 또는 여러 개일 수 있다. 여러 임계값이 있는 경우, 임계값들 중 하나가 충족될 때 또는 여러 임계값이 동일한 시간에 충족될 때 조건은 충족된다고 결정될 수 있다. 일부 실시예에서, 예를 들어, 미리 결정된 임계값보다 큰 RSSI의 백분율이 채널 바쁨 백분율일 수 있고, 검출된 채널 바쁨 백분율이 임계값 미만 및/또는 이하일 때, 후속 동작들은 트리 거될 수 있으며, 예를 들어, 조건부 핸드오버는 트리거될 수 있다. 예를 들어, RSRP 및/또는 RSRQ 및/또는 SINR 이 임계값을 초과 및/또는 임계값 이상일 때, 그리고/또는 미리 결정된 임계값을 초과하는 RSSI의 백분율이 채널 바쁨 백분율이고 검출된 채널 바쁨 백분율이 임계값 미만 및/또는 이하일 때, 후속 동작들은 트리거될 수 있 으며, 예를 들어, 조건부 핸드오버는 트리거될 수 있다는 것일 수 있다. 예 5 본 개시의 제5 양태는 무선 통신 네트워크의 자체 최적화를 지원하는 방법을 제안하며, 이 방법은 다음을 포함 할 수 있다: 제1 엔티티가 LBT 실패 검출 설정을 포함하는 제10 정보를 to 제2 엔티티에 송신하여서, 제2 엔티 티는 LBT 실패가 설정에 따라 발생할지 여부를 검출할 수 있으며, 따라서 제1 엔티티는 LBT 실패 검출 결과를 획득할 수 있고, 제1 엔티티는 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등과 같은 최적화 결정들 을 내릴 수 있다. 일부 실시예에서, 제10 정보는 다음 중 하나 이상에 포함될 수 있다: F1의 UE CONTEXT MODIFICATION REQUEST 메시지, gNB-CU CONFIGURATION UPDATE 메시지; 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/ 또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제10 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별 - 송신 엔티티 식별: 제10 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제10 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - LBT 실패 검출 타이머: 연속 LBT 실패 검출에 사용되는 타이머. 예를 들어, 타이머의 가동시간 동안, 연속 LBT 실패가 발생할지 여부가 검출된다. 타이머는 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다. - 최대 LBT 실패 인스턴스 카운트: LBT 실패 횟수를 결정하기 위해 사용되며, 이 수에 도달될 때, 후속 프로세 스, 이를테면 LBT 실패 복구, LBT 실패 보고, 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등이 활성 화된다. 최대 카운트는 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다. 일부 실시예에서, 제2 엔티티는 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과들을 포함하는 제11 정보를 자 신의 상황에 따라(예컨대, 자율적으로) 및/또는 LBT 실패 검출 설정 정보에 따라 제1 엔티티에 송신할 수 있어 서, 제1 엔티티는 LBT 실패 검출 정보 및/또는 결과들을 획득할 수 있고, 제1 엔티티는 자원 설정 업데이팅, 이 동성 최적화(예컨대, 핸드오버) 등과 같은 최적화 결정들을 내릴 수 있다. 일부 실시예에서, 제11 정보는 다음 중 하나 이상에 포함될 수 있다: F1의 UE CONTEXT MODIFICATION RESPONSE 메시지, UE CONTEXT MODIFICATION REQUIRED 메시지, 및 gNB-DU CONFIGURATION UPDATE; 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제11 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 보고된 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 대응하는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제11 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제11 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - 서빙 셀 식별: 보고된 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 대응하는 서빙 셀의 식별을 나타내 기 위해 사용된다. - 채널 식별: 보고된 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과에 대응하는 채널의 식별을 나타내기 위해 사용된다. - LBT 실패 검출 타이머: 연속 LBT 실패 검출에 사용되는 타이머. 예를 들어, 타이머의 가동시간 동안, 연속 LBT 실패가 발생할지 여부가 검출된다. 타이머는 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다. - 최대 LBT 실패 인스턴스 카운트: LBT 실패 횟수를 결정하기 위해 사용되며, 이 수에 도달될 때, 후속 프로세 스, 이를테면 LBT 실패 복구, LBT 실패 보고, 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등이 활성 화된다. 최대 카운트는 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다.- 다운링크 LBT 실패 지시: 다운링크 LBT 실패의 발생을 나타내기 위해 사용된다. 이는 단일 비트에 의해 나타 내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 다운링크 LBT 실패가 발생하였음을 의미하며, 비트가 0일 때, 이는 다운링크 LBT 실패가 발생하지 않았음을 의미한다. - 업링크 LBT 실패 지시: 업링크 LBT 실패의 발생을 나타내기 위해 사용된다. 이는 단일 비트에 의해 나타내어 질 수 있다. 예를 들어, 비트가 1일 때, 이는 업링크 LBT 실패가 발생하였음을 의미하며, 비트가 0일 때, 이는 업링크 LBT 실패가 발생하지 않았음을 의미한다. - LBT 실패 지시: LBT 실패의 발생을 나타내기 위해 사용된다. 위의 LBT 실패는 연속 LBT 실패일 수 있다. 본 개시에서 LBT 실패 검출 정보는 예를 들어, 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 서빙 셀 식별, 채널 식별, LBT 실패 검출 타이머, 최대 LBT 실패 인스턴 스 카운트 등을 포함하는 제11 정보의 모든 필드들 및/또는 부분적 필드들을 지칭할 수 있다. 본 개시에서 LBT 실패 검출 결과는, 예를 들어, 사용자 장비 식별, 송신 엔티티 식별, 수신 엔티티 식별, 서빙 셀 식별, 채널 식 별, 다운링크 LBT 실패 지시, 업링크 LBT 실패 지시, LBT 실패 지시 등을 포함하는 제11 정보의 모든 필드들 및 /또는 부분적 필드들을 지칭할 수 있다. 예 6 본 개시의 제6 양태는 무선 통신 네트워크의 자체 최적화를 지원하는 방법을 제안하며, 이 방법은 다음을 포함 할 수 있다: 제2 엔티티가 LBT 실패 정보를 포함하는 제12 정보를 제1 엔티티에 송신함으로써, 제2 엔티티가 LBT 실패 관련 정보를 가짐을 제1 엔티티에게 알려서, 제1 엔티티는 정보를 획득할지 여부를 선택할 수 있다. 일부 실시예에서, 제12 정보는 다음 중 하나 이상에 포함될 수 있다: RRC의 UE-MeasurementsAvailable, RRCSetupComplete, RRCReestablishmentComplete, RRCReconfigurationComplete, 및 RRCResumeComplete; 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제12 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: 가용 LBT 실패 정보에 대응하는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제12 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제12 정보를 수신하는 엔티티의 식별을 나타내기 위해 사용된다. - LBT 실패 정보 이용 가능함: LBT 실패 정보가 이용 가능함을 나타내기 위해 사용된다. 이 필드는 단일 비트에 의해 나타내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 LBT 실패 정보가 이용 가능함을 의미하며, 비트가 0 일 때, 이는 LBT 실패 정보가 이용 가능하지 않음을 의미한다. - LBT 실패 보고 이용 가능함: LBT 실패 보고가 이용 가능함을 나타내기 위해 사용된다. 이 필드는 단일 비트에 의해 나타내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 LBT 실패 보고가 이용 가능함을 의미하고, 비트가 0 일 때, 이는 LBT 실패 보고가 이용 가능하지 않음을 의미한다. - 연속 LBT 실패 정보 이용 가능함: 연속 LBT 실패 정보가 이용 가능함을 나타내기 위해 사용된다. 이 필드는 단일 비트에 의해 나타내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 연속 LBT 실패 정보가 이용 가능함을 의미하며, 비트가 0일 때, 이는 연속 LBT 실패 정보가 이용 가능하지 않음을 의미한다. - 연속 LBT 실패 보고 이용 가능함: 연속 LBT 실패 보고가 이용 가능함을 나타내기 위해 사용된다. 이 필드는 단일 비트에 의해 나타내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 연속 LBT 실패 보고들이 이용 가능함을 의미하며, 비트가 0일 때, 이는 연속 LBT 실패 보고들이 이용 가능하지 않음을 의미한다. 일부 실시예에서, 제1 엔티티는 LBT 실패 정보 요청을 포함하는 제13 정보를 자신의 상황에 따라 (예를 들어, 자율적으로) 및/또는 LBT 실패 정보 이용 가능함의 수신된 정보에 따라 제2 엔티티에 송신할 수 있어서, 제1 엔 티티는 LBT 실패 정보를 획득할 수 있고 자체 최적화 결정들을 내릴 수 있다. 일부 실시예에서, 제13 정보는 다음 중 하나 이상에 포함될 수 있다: RRC의 UEInformationRequest; 또는 다른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 일부 실시예에서, 제13 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 사용자 장비 식별: LBT 실패 정보 요청에 대응하는 UE의 식별을 나타내기 위해 사용된다. - 송신 엔티티 식별: 제13 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - 수신 엔티티 식별: 제13 정보를 송신하는 엔티티의 식별을 나타내기 위해 사용된다. - LBT 실패 정보 요청: LBT 실패 정보를 요청하기 위해 사용된다. 이 필드는 단일 비트에 의해 나타내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 LBT 실패 정보가 요청됨을 의미하며, 비트가 0일 때, 이는 LBT 실패 정 보가 요청되지 않음을 의미한다. - LBT 실패 보고 요청: LBT 실패 보고들을 요청하기 위해 사용된다. 이 필드는 단일 비트에 의해 나타내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 LBT 실패 보고가 요청됨을 의미하며, 비트가 0일 때, 이는 LBT 실패 보 고가 요청되지 않음을 의미한다. - 연속 LBT 실패 정보 요청: 연속 LBT 실패 정보를 요청하기 위해 사용된다. 이 필드는 단일 비트에 의해 나타 내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 연속 LBT 실패 정보가 요청됨을 의미하며, 비트가 0일 때, 이 는 연속 LBT 실패 정보가 요청되지 않음을 의미한다. - 연속 LBT 실패 보고 요청: 연속 LBT 실패 보고를 요청하기 위해 사용된다. 이 필드는 단일 비트에 의해 나타 내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 연속 LBT 실패 보고가 요청됨을 의미하며, 비트가 0일 때, 이 는 연속 LBT 실패 보고가 요청되지 않음을 의미한다. 일부 실시예에서, 제2 엔티티는 LBT 실패 정보를 포함하는 제14 정보를 자신의 상황에 따라 (예를 들어, 자율적 으로) 및/또는 LBT 실패 정보 요청에 따라 제1 엔티티에 송신함으로써, 제1 엔티티가 자체 최적화 결정을 내리 기 위한 참조 정보들을 제공할 수 있다. 일부 실시예에서, 제14 정보는 다음 중 하나 이상에 포함될 수 있다: RRC의 UEInformationResponse, SCGFailureInformation, 및 MCGFailureInformation; Xn의 FAILURE INDICATION 메시지, HANDOVER REPORT 메시 지, ACCESS AND MOBILITY INDICATION 메시지, S-NODE MODIFICATION REQUEST 메시지, SgNB MODIFICATION REQUEST 메시지, SCG FAILURE INFORMATION REPORT 메시지, RRC TRANSFER 메시지; F1의 ACCESS AND MOBILITY 지 시 메시지; NG의 업링크 RAN 설정 TRANSFER 메시지 및 DOWNLINK RAN CONFIGURATION TRANSFER 메시지; 또는 다 른 및/또는 새로 정의된 RRC 및/또는 Xn 및/또는 X2 및/또는 F1 및/또는 E1 및/또는 NG 메시지. 제14 정보는 또 한 보고에 포함될 수 있으며, 여기서 보고는 연결 성립 실패(Connection Establishment Failure, CEF) 보고, 랜덤 액세스 보고, 성공적인 핸드오버 보고, 무선 링크 실패(RLF) 보고, 측정 보고, 또는 무선 연결에 관련된 다른 보고들일 수 있다. 보고는 또한 새로운 보고일 수 있으며, 예를 들어, 이는 다음 중 하나 이상일 수 있다: LBT 실패 보고, LBT 보고, 연속 LBT 실패 보고, 비면허 대역 액세스 보고, 비면허 대역 보고, 비면허 대역 액세 스 실패 보고, 비면허 대역 실패 보고, 공유된 스펙트럼 액세스 보고, 공유된 스펙트럼 실패 보고 등. 일부 실시예에서, 제14 정보는 다음 필드들 중 하나 이상 또는 관련 정보를 포함할 수 있다: - 수신 신호 강도 지시자(RSSI) - 채널 점유(CO) 시간 백분율 - LBT 실패 횟수 - LBT의 성공률 또는 실패율 - LBT 성공 후의 평균 전송 지속 시간 - LBT 실패 검출 타이머: 연속 LBT 실패 검출에 사용되는 타이머. 예를 들어, 타이머의 가동시간 동안, 연속 LBT 실패가 발생할지 여부가 검출된다. 타이머는 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다. - 최대 LBT 실패 인스턴스 카운트: LBT 실패 횟수를 결정하기 위해 사용되며, 이 수에 도달될 때, 후속 프로세 스, 이를테면 LBT 실패 복구, LBT 실패 보고, 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등이 활성 화된다. 최대 카운트는 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다. - LBT 실패 검출의 시간 길이: LBT 실패 검출에 사용되는 시간 길이인, LBT 실패 검출의 시작부분부터 LBT 실패 검출의 종료까지일 수 있는 시간 길이 및/또는 LBT 실패 확인. 시간 길이는 업링크, 다운링크, 업링크 및 다운 링크, 업링크 또는 다운링크 등을 위한 것일 수 있다.- LBT 실패 인스턴스 카운트: LBT 실패 검출에 사용되는 카운트이며, 이는 LBT 실패 검출의 시작부분부터 LBT 실패 검출의 종료까지 카운트된 LBT 실패 횟수 및/또는 LBT 실패 확인일 수 있다. 이 카운트는 업링크, 다운링 크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 위한 것일 수 있다. - 다운링크 LBT 실패 지시: 다운링크 LBT 실패의 발생을 나타내기 위해 사용된다. 이는 단일 비트에 의해 나타 내어질 수 있다. 예를 들어, 비트가 1일 때, 이는 다운링크 LBT 실패가 발생하였음을 의미하며, 비트가 0일 때, 이는 다운링크 LBT 실패가 발생하지 않았음을 의미한다. - 업링크 LBT 실패 지시: 업링크 LBT 실패의 발생을 나타내기 위해 사용된다. 이는 단일 비트에 의해 나타내어 질 수 있다. 예를 들어, 비트가 1일 때, 이는 업링크 LBT 실패가 발생하였음을 의미하며, 비트가 0일 때, 이는 업링크 LBT 실패가 발생하지 않았음을 의미한다. - LBT 실패 지시: LBT 실패의 발생을 나타내 위해 사용된다. - LBT 실패가 발생하는 대역폭 부분(BWP): 중심 주파수, 대역폭, 채널 지시 등을 포함한다. - LBT 실패에 대응하는 자원 설정: 중심 주파수, 대역폭, 채널 지시 등을 포함한다. - LBT 실패에 대응하는 자원 활성화 설정: 중심 주파수, 대역폭, 채널 지시, 활성화 표시 등을 포함한다. - LBT 실패에 대응하는 RSSI: LBT가 실패할 때 검출된 RSSI를 나타낸다. - LBT 실패에 대응하는 검출된 에너지: LBT가 실패할 때 검출된 에너지를 나타낸다. 검출된 에너지는 LBT가 실 패할 때의 해당 검출된 에너지, 검출된 에너지의 최대 값, 검출된 에너지의 최소 값, 검출된 에너지의 평균값, 최신 검출된 에너지, 검출된 에너지와 적용된 ED 임계값 사이의 차이, 또는 검출된 에너지와 최대 ED 임계값 사 이의 차이 등일 수 있다. 이 차이는 최대 값, 최소 값, 최신 값, 또는 차이의 평균값 등일 수 있다. 검출된 에 너지는 또한 평균값, 최대 값, 최소 값, 또는 검출된 에너지의 최신 값 등일 수 있다. 적용된 ED 임계값은 적용 된 ED 임계값, 적용된 ED 임계값의 최대 값, 적용된 ED 임계값의 최소 값 등일 수 있다. 이 정보는 해당 노드들 및/또는 엔티티들에 제공될 수 있고, 노드들 및/또는 엔티티들은 이 정보, 예를 들어, 최대 ED 임계값의 설정 등에 기반하여 LBT 설정을 조정함으로써, 사용자의 LBT 성공률을 개선한다. 구현예에서, 최대 ED 임계값은 LBT 실패에 대응하는 검출된 에너지의 최소 값 미만 및/또는 최소 값이 되도록 설정될 수 있다. - LBT 실패에 해당하는 ED 임계값: LBT가 실패할 때 적용되는 ED 임계값을 나타낸다. 해당 ED 임계값은 적용된 ED 임계값, 적용된 최신 ED 임계값, 적용된 최대 ED 임계값, 적용된 최소 ED 임계값, 또는 LBT가 실패할 때의 적용된 ED 임계값의 평균값일 수 있다. 이 정보는 해당 노드들 및/또는 엔티티들에 제공될 수 있고, 노드들 및/ 또는 엔티티들은 이 정보, 예를 들어, 최대 ED 임계값의 설정에 기반하여 LBT 설정을 조정함으로써, 사용자의 LBT 성공률을 개선한다. - LBT 실패에 대응하는 최대 ED 임계값: LBT가 실패할 때 적용되는 최대 ED 임계값을 나타낸다. - LBT 실패부터 보고까지의 시간 정보: LBT 실패부터 보고까지의 시간을 나타낸다. - LBT 실패 시간: LBT가 실패할 때의 시간을 나타내며, 이는 상대 시간 또는 절대 시간일 수 없다. - 사용자 장비 식별: LBT 실패에 대응하는 UE의 식별을 나타내기 위해 사용된다. - 셀 식별: LBT 실패에 대응하는 셀의 식별을 나타내기 위해 사용된다. - 셀이 위치되는 노드의 식별: LBT 실패에 대응하는 셀이 위치되는 노드의 식별을 나타내기 위해 사용된다. - 빔 식별: LBT 실패에 대응하는 빔의 식별을 나타내기 위해 사용된다. - 슬라이스 식별: LBT 실패에 대응하는 슬라이스의 식별을 나타내기 위해 사용된다. - PLMN 식별: LBT 실패에 대응하는 PLMN의 식별을 나타내기 위해 사용된다. - 대역 정보 지시: 업링크 및/또는 다운링크에 사용되는 대역 정보를 나타낸다. 대역 정보는 다음 중 하나 및/ 또는 그 이상을 포함할 수 있다: o 전송 방향 지시: 업링크, 다운링크, 업링크 및 다운링크, 업링크 또는 다운링크 등을 포함한다. o 대역 유형: 면허 대역과 비면허 대역을 포함한다. o 비면허 대역 사용 지시: 단일 비트에 의해 나타내어지며, 예를 들어, 비트가 1일 때, 이는 비면허 대역을 나 타내며, 비트가 0일 때, 이는 면허 대역을 나타낸다. 대안적으로, 비트가 0일 때, 이는 비면허 대역을 나타내고, 비트가 1일 때, 이는 면허 대역을 나타낸다. o 면허 대역 지시: 단일 비트에 의해 나타내어지며, 예를 들어, 비트가 1일 때, 이는 면허 대역을 나타내며, 비 트가 0일 때, 이는 비면허 대역을 나타낸다. 대안적으로, 비트가 0일 때, 이는 면허 대역을 나타내고, 비트가 1 일 때, 이는 비면허 대역을 나타낸다. o 업링크에 대한 면허 대역을 사용하는 그리고 다운링크에 대한 비면허 대역을 사용하는 지시: 단일 비트에 의 해 나타내어진다. 예를 들어, 비트가 1일 때, 이는 면허 대역이 업링크를 위해 사용되고 비면허 대역이 다운링 크를 위해 사용됨을 의미하며; 비트가 0일 때, 이는 면허 대역이 업링크를 위해 사용되고 비면허 대역이 다운링 크를 위해 사용되는 경우가 아님을 의미한다. 대안적으로, 비트가 0일 때, 이는 면허 대역이 업링크를 위해 사 용되고 비면허 대역이 다운링크를 위해 사용됨을 의미하며; 비트가 1일 때, 이는 면허 대역이 업링크를 위해 사 용되고 비면허 대역이 다운링크를 위해 사용되는 경우가 아님을 의미한다. 본 개시의 실시예들에 따라 무선 통신 시스템에서 제1 엔티티 및/또는 제2 엔티티에 의해 수행되는 방법은 네트 워크 자체 최적화 결정에 사용될 수 있다. 본 개시에서 언급된 네트워크 자체 최적화 결정은 네트워크 에너지 절약, 부하 균형, 커버리지 최적화, 이동성 최적화 및/또는 관리, 네트워크 구성 공식화 및/또는 네트워크 설정 업데이팅 등을 포함할 수 있다. 더욱이, 본 개시에서, 결과들 및 보고들은 서로를 참조할 수 있다. 결과들, 보고들 및 콘텐츠들은 서로를 참조 할 수 있다. 추가적으로, 본 개시에서, 데이터 볼륨은 다음 중 하나 이상일 수 있다: 데이터 사용량, 트래픽, 및 사용 카운 트. 데이터 볼륨은 또한 데이터 특성들을 포함할 수 있으며, 예를 들어, 다음 중 하나 이상을 포함할 수 있다: 데이터 도착 속도, 데이터 전송 속도, 패킷 크기, 데이터 서비스 유형 등. 더욱이, 본 개시에서, 신뢰도 및 정확도는 서로 참조할 수 있다. 더욱이, 본 개시에서, 에너지 검출(ED) 임계값이 설정된 최대 에너지 검출 임계값 또는 적용된 에너지 검출 임 계값일 수 있다. 적용된 에너지 검출 임계값은 다음 중 하나 이상을 포함할 수 있다: 적용된 ED 임계값, 최신 적용된 ED 임계값, 최대 적용된 ED 임계값, 최소 적용된 ED 임계값, 적용된 ED 임계값의 평균값, 검출된 에너지 상황 등. 더욱이, 본 개시에서, 검출된 에너지의 상황은 다음 중 하나 이상을 포함할 수 있다: 검출된 에너지, 검출된 에 너지의 최대 값, 검출된 에너지의 최소 값, 검출된 에너지의 평균값, 최신 검출된 에너지, 검출된 에너지와 적 용된 ED 임계값 사이의 차이, 검출된 에너지와 최대 ED 임계값 사이의 차이 등. 이 차이는 최대 값, 최소 값, 최신 값, 또는 차이의 평균값 등일 수 있다. 검출된 에너지는 또한 평균값, 최대 값, 최소 값, 또는 검출된 에 너지의 최신 값 등일 수 있다. 적용된 ED 임계값은 적용된 ED 임계값, 적용된 ED 임계값의 최대 값, 적용된 ED 임계값의 최소 값 등일 수 있다. 더욱이, 본 개시에서, 시간은 다음 중 하나 이상에 의해 나타내어질 수 있다: 타임스탬프, 시점, 시간 간격, 타 이머, 시구간, 시간 길이, 시구간/주기, 시간 간격 등. 본 개시에서, 시간 길이는 특정한 시점부터의 시간의 길 이일 수 있으며, 이는 현재 시간일 수 있다. 시간은 상대 시간 또는 절대 시간일 수 있다. 더욱이, 본 개시에서, 데이터 볼륨은 또한 다음 중 하나 이상을 지칭할 수 있다: 데이터 양, 데이터 카운트, 데 이터의 도착 속도, 데이터 볼륨 및/또는 데이터 버스트 시간, 데이터 QoS 요건, 데이터 도착 간격, 데이터 도착 모드. 본 개시에서, 데이터 도착 모드는 주기적 도착, 간접 도착 등을 포함할 수 있다. QoS 요건은 신뢰도, 지 연, 스루풋, 패킷 손실률 등을 포함할 수 있다. 더욱이, 본 개시에서, 필드들 및/또는 정보는 정보의 실제 값들, 평균값들, 최신 값들, 최대 값들, 최소 값들 등일 수 있다. 더욱이, 본 개시에서, 필드들 및/또는 정보는 실제 값들, 예측된 값들, 추정된 값들 등일 수 있다. 본 개시의 예시적인 실시예들은 첨부 도면들을 참조하여 아래에서 더 상세히 설명된다. 텍스트 및 도면들은 본 개시를 이해하는 것을 돕는 예들로서만 제공된다. 그것들은 본 개시의 범위를 임의의 방 식으로 제한하는 것으로서 해석되지 않아야 한다. 특정한 실시예들 및 예들이 본 개시에서 개시된 개시내용에기반하여 제공되었지만, 본 개시의 범위로부터 벗어남 없이 예시된 실시예들 및 예들에 대해 변경들이 이루어질"}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "수 있다는 것이 본 기술분야의 통상의 기술자들에게는 명백하다. 도 5a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 5a는 두 개의 엔티티들 사이의 LBT 에너지 검출 임계값을 교환하는 프로세스를 예시 하여서, 제1 엔티티는 LBT 프로세스에서 제2 엔티티의 에너지 검출 임계값 정보를 획득하고 후속 부하 정보 교 환 및 최대 에너지 검출 임계값 업데이팅을 위한 참조 정보를 제공함으로써, 부하 균형 결정을 위한 참조 정보 를 제공하고 LBT 전송 메커니즘의 강건성을 개선할 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 501A: 제1 엔티티는 에너지 검출 임계값 수집 및/또는 보고 설정을 제2 엔티티에 송신한다. 에너지 검출 임계값 수집 및/또는 보고 설정은 전술한 제1 정보일 수 있다. 단계 502A: 제2 엔티티는 에너지 검출 임계값을 수집한다. 단계 503A: 제2 엔티티는 에너지 검출 임계값을 제1 엔티티에 보고한다. 에너지 검출 임계값은 전술한 제2 정보 일 수 있다. 제2 엔티티가 단계 501A에서의 설정에 따라 에너지 검출 임계값을 보고할 수 없다면, 제2 엔티티는 제1 엔티티에 보고될 수 없는 에너지 검출 임계값 결과를 포함하는 정보를 송신할 수 있으며, 이 정보는 전술한 제3 정보일 수 있다. 단계 504A: 제1 엔티티는 수집된 에너지 검출 임계값 결과들에 기반하여 설정 결정 및/또는 네트워크 자체 최적 화 결정 세팅을 내리며 그리고/또는 이를 다른 엔티티들에 포워딩한다. 단계 501A의 설정 정보가 제2 엔티티가 주기적으로 보고할 것을 요구한다면, 단계 502A 및/또는 단계 503A는 주 기적으로 수행된다. 도 5b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 5b는 두 개의 엔티티들 사이의 LBT 에너지 검출 임계값을 교환하는 프로세스를 예시 하여서, 제1 엔티티는 LBT 프로세스에서 제2 엔티티의 에너지 검출 임계값 정보를 획득하고 후속 부하 정보 교 환 및 최대 에너지 검출 임계값 업데이팅을 위한 참조 정보를 제공함으로써, 부하 균형 결정을 위한 참조 정보 를 제공하고 LBT 전송 메커니즘의 강건성을 개선할 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 501B: 제2 엔티티는 에너지 검출 임계값을 수집한다. 단계 502B: 제2 엔티티는 에너지 검출 임계값을 제1 엔티티에 보고한다. 에너지 검출 임계값은 전술한 제2 정보 일 수 있다. 단계 503B: 제1 엔티티는 수집된 에너지 검출 임계값 결과들에 기반하여 설정 결정 및/또는 네트워크 자체 최적 화 결정 세팅을 내리며 그리고/또는 이를 다른 엔티티들에 포워딩한다. 도 6a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 6a는 두 개의 엔티티들 사이의 신호 강도 및/또는 신호 품질을 교환하는 프로세스를 예시하는데, 제1 엔티티는 제2 엔티티에 의해 수집된 신호 강도 및/또는 신호 품질의 관련 정보를 획득할 수 있 고, 제1 엔티티가 자원 설정을 수행하기 위한 참조 정보를 제공할 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 601A: 제1 엔티티는 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정을 제2 엔티티에 송신한다. 신호 강도 및/또는 신호 품질 수집 및/또는 보고 설정은 전술한 제4 정보일 수 있다. 단계 602A: 제2 엔티티는 신호 강도 및/또는 신호 품질을 수집한다. 단계 603A: 제2 엔티티는 신호 강도 및/또는 신호 품질을 제1 엔티티에 보고한다. 신호 강도 및/또는 신호 품질 은 전술한 제5 정보일 수 있다. 단계 604A: 제1 엔티티는 수집된 신호 강도 및/또는 신호 품질에 기반하여 설정 결정 및/또는 네트워크 자체 최 적화 결정 세팅을 내리며 그리고/또는 이를 다른 엔티티들에 포워딩한다. 단계 601A의 설정 정보가 제2 엔티티가 주기적으로 보고할 것을 요구한다면, 단계 602A 및/또는 단계 603A는 주 기적으로 수행된다. 도 6b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 6b는 두 개의 엔티티들 사이의 신호 강도 및/또는 신호 품질을 교환하는 프로세스를 예시하는데, 제1 엔티티는 제2 엔티티에 의해 수집된 신호 강도 및/또는 신호 품질의 관련 정보를 획득할 수 있 고, 제1 엔티티가 자원 설정을 수행하기 위한 참조 정보를 제공할 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 601B: 제2 엔티티는 신호 강도 및/또는 신호 품질을 수집한다. 단계 602B: 제2 엔티티는 신호 강도 및/또는 신호 품질을 제1 엔티티에 보고한다. 신호 강도 및/또는 신호 품질 은 전술한 제5 정보일 수 있다. 단계 603B: 제1 엔티티는 수집된 신호 강도 및/또는 신호 품질에 기반하여 설정 결정 및/또는 네트워크 자체 최 적화 결정 세팅을 내리며 그리고/또는 이를 다른 엔티티들에 포워딩한다. 도 7a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로는, 도 7a는 두 개의 엔티티들 사이의 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 교환하는 프로세스를 예시하여서, 제1 엔티티는 제2 엔티티 및/또는 다른 엔티티들의 비면 허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 획득함으로써, 제1 엔티티가 자체 최적화 결정을 내리기 위한 참조 정보를 제공할 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 701A: 제1 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청을 제2 엔 티티에 송신한다. 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청은 전술한 제6 정 보일 수 있다. 단계 702A: 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에 대한 응 답을 제1 엔티티에 송신한다. 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황 요청에 대 한 응답은 전술한 제7 정보일 수 있다. 단계 703A: 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 수집하며 그 리고/또는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 예측한다. 단계 704A: 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 제1 엔티티에 송신한다. 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황은 전술한 제8 정보일 수 있다. 단계 704A: 제1 엔티티는 비면허 대역 및/또는 면허 대역의 수집된 자원 스테이터스 및/또는 부하 상황에 기반 하여 네트워크 자체 최적화 결정 세팅을 내리며 그리고/또는 이를 다른 엔티티들에 포워딩한다. 단계 701A의 요청 정보가 제2 엔티티가 주기적으로 보고할 것을 요구한다면, 단계 703A 및/또는 단계 704A는 주 기적으로 수행된다. 도 7b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로는, 도 7b는 두 개의 엔티티들 사이의 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 교환하는 프로세스를 예시하여서, 제1 엔티티는 제2 엔티티 및/또는 다른 엔티티들의 비면 허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 획득함으로써, 제1 엔티티가 자체 최적화 결정을 내리기 위한 참조 정보를 제공할 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 701B: 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 수집하며 그 리고/또는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 예측한다. 단계 702B: 제2 엔티티는 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황을 제1 엔티티에 송신한다. 비면허 대역 및/또는 면허 대역의 자원 스테이터스 및/또는 부하 상황은 전술한 제8 정보일 수 있다. 단계 703B: 제1 엔티티는 비면허 대역 및/또는 면허 대역의 수집된 자원 스테이터스 및/또는 부하 상황에 기반 하여 네트워크 자체 최적화 결정 세팅을 내리며 그리고/또는 이를 다른 엔티티들에 포워딩한다. 도 8은 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 8은 제1 엔티티가 채널 바쁨 스테이터스 체크를 위한 조건 설정을 제2 엔티티에 설정 하고, 제2 엔티티가 후속 프로세스를 트리거할지 여부를 결정하기 위한 설정에 따라 조건이 충족되는지 여부를 체크함으로써, 제2 엔티티가 채널 바쁨 스테이터스에서 셀로 핸드오버되어 성능에 영향을 미치는 것을 방지하고, 제2 엔티티가 조건부 핸드오버를 성공적으로 수행하는 것을 가능하게 하는 등을 할 수 있다는 것을 예시한다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 801: 제1 엔티티는 채널 바쁨 스테이터스 체크를 위한 조건 설정을 제2 엔티티에 송신한다. 채널 바쁨 스 테이터스 체크를 위한 조건 설정은 전술한 제9 정보일 수 있다. 단계 802: 제2 엔티티는 조건이 충족되는지 여부를 검출한다. 단계 803: 조건이 충족된다면, 조건부 핸드오버와 같은 후속 프로세스가 트리거된다. 도 9a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 9a는 두 개의 엔티티들 사이의 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과들을 교환하는 프로세스를 예시하여, 제1 엔티티는 LBT 실패 검출 정보 및/또는 결과들을 획득할 수 있고, 제1 엔티 티는 can make 최적화 결정들, 이를테면 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등을 내릴 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 901A: 제1 엔티티는 LBT 실패 검출 설정을 제2 엔티티에 송신한다. LBT 실패 검출 설정은 전술한 제10 정 보일 수 있다. 단계 902A: 제2 엔티티는 LBT 실패 검출을 수행하며 그리고/또는 다른 엔티티들로부터 LBT 실패 검출 결과들을 수집한다. 단계 903A: 제2 엔티티는 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과를 제1 엔티티에 보고한다. LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과는 전술한 제11 정보일 수 있다. 단계 904A: 제1 엔티티는 수집된 LBT 실패 검출 정보 및/또는 결과에 기반하여, 최적화 결정들, 이를테면 자원 설정 업데이팅 및 이동성 최적화(예컨대, 핸드오버)를 내릴 수 있다. 도 9b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 9b는 두 개의 엔티티들 사이의 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과들을 교환하는 프로세스를 예시하여, 제1 엔티티는 LBT 실패 검출 정보 및/또는 결과들을 획득할 수 있고, 제1 엔티 티는 can make 최적화 결정들, 이를테면 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등을 내릴 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 901B: 제2 엔티티는 LBT 실패 검출을 수행하며 그리고/또는 다른 엔티티들로부터 LBT 실패 검출 결과들을 수집한다. 단계 902B: 제2 엔티티는 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과를 제1 엔티티에 보고한다. LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과는 전술한 제11 정보일 수 있다. 단계 903B: 제1 엔티티는 수집된 LBT 실패 검출 정보 및/또는 결과에 기반하여, 최적화 결정들, 이를테면 자원 설정 업데이팅 및 이동성 최적화(예컨대, 핸드오버)를 내릴 수 있다. 도 9c는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 9c는 두 개의 엔티티들 사이의 LBT 실패 검출 정보 및/또는 LBT 실패 검출 결과들을 교환하는 프로세스를 예시하여, 제1 엔티티는 LBT 실패 검출 정보 및/또는 결과들을 획득할 수 있고, 제1 엔티 티는 can make 최적화 결정들, 이를테면 자원 설정 업데이팅, 이동성 최적화(예컨대, 핸드오버) 등을 내릴 수 있다. 일부 실시예에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 UE일 수 있다. 다른 구현예들에서, 예를 들어, 제1 엔티 티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구 현예들에서, 예를 들어, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 901C: 제2 엔티티는 LBT 실패 검출 정보를 제1 엔티티에 보고한다. LBT 실패 검출 정보는 전술한 제11 정 보일 수 있다. 여기서, LBT 실패 검출 정보는 제2 엔티티 자체가 획득하였고 및/또는 현재 사용중인 LBT 실패 검출 정보일 수 있다. 단계 902C: 제2 엔티티는 LBT 실패 검출을 수행하며 그리고/또는 다른 엔티티들로부터 LBT 실패 검출 결과들을 수집한다. 단계 903C: 제2 엔티티는 LBT 실패 검출 결과 및/또는 LBT 실패 검출 정보를 제1 엔티티에 보고한다. LBT 실패 검출 결과는 전술한 제11 정보일 수 있다. 단계 904C: 제1 엔티티는 수집된 LBT 실패 검출 정보 및/또는 결과에 기반하여, 최적화 결정들, 이를테면 자원 설정 업데이팅 및 이동성 최적화(예컨대, 핸드오버)를 내릴 수 있다. 도 10a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10a는 두 개의 엔티티들 사이에 LBT 실패 정보를 교환하는 프로세스를 예시하며, 그 래서 제1 엔티티는 LBT 실패 정보를 획득하고 자체 최적화 결정들을 내릴 수 있다. 일부 실시예에서, 예를 들어, 제2 엔티티는 UE일 수 있고, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 다른 구현예들에서, 예를 들어, 제2 엔티 티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있 고, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제1 엔 티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 1001A: 제2 엔티티는 LBT 실패 정보를 제1 엔티티에 보고한다. LBT 실패 정보는 전술한 제14 정보일 수 있 다. 단계 1002A: 제1 엔티티는 수집된 LBT 실패 정보에 기반하여 자체 최적화 결정들 등을 내린다. 도 10b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10b는 두 개의 엔티티들 사이에 LBT 실패 정보를 교환하는 프로세스를 예시하며, 그 래서 제1 엔티티는 LBT 실패 정보를 획득하고 자체 최적화 결정들을 내릴 수 있다. 일부 실시예에서, 예를 들어, 제2 엔티티는 UE일 수 있고, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 다른 구현예들에서, 예를 들어, 제2 엔티 티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있 고, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제1 엔 티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 1001B: 제1 엔티티는 LBT 실패 정보 요청을 제2 엔티티에 송신하여 제2 엔티티가 LBT 실패 정보를 보고하 도록 요청한다. LBT 실패 정보 요청은 전술한 제13 정보일 수 있다. 단계 1002B: 제2 엔티티는 LBT 실패 정보를 제1 엔티티에 보고한다. LBT 실패 정보는 전술한 제14 정보일 수 있 다. 단계 1003B: 제1 엔티티는 수집된 LBT 실패 정보에 기반하여 자체 최적화 결정들 등을 내린다. 도 10c는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10c는 두 개의 엔티티들 사이에 LBT 실패 정보를 교환하는 프로세스를 예시하며, 그 래서 제1 엔티티는 LBT 실패 정보를 획득하고 자체 최적화 결정들을 내릴 수 있다. 일부 실시예에서, 예를 들어, 제2 엔티티는 UE일 수 있고, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 다른 구현예들에서, 예를 들어, 제2 엔티 티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있 고, 제1 엔티티는 gNB 또는 gNB-CU 또는 gNB-DU 또는 gNB CU-CP 또는 gNB CU-UP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제2 엔티티는 AMF 또는 SMF 또는 MME일 수 있고, 제1 엔 티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있다. 또 다른 구현예들에서, 예를 들어, 제2 엔티티는 gNB 또는 gNB-CU 또는 gNB CU-CP 또는 en-gNB 또는 eNB 또는 ng-eNB일 수 있고, 제1 엔티티는 AMF 또는 SMF 또는 MME일 수 있다. 단계 1001C: 제2 엔티티는 LBT 실패 정보가 이용 가능함을 포함하거나 지시하는 정보를 제1 엔티티에 송신함으 로써, 제1 엔티티에게 제2 엔티티가 LBT 실패 정보를 가짐을 알릴 수 있다. LBT 실패 정보가 이용 가능함을 포 함하거나 지시하는 정보는 전술한 제12 정보일 수 있다. 단계 1002C: 제1 엔티티는 LBT 실패 정보 요청을 제2 엔티티에 송신하여 제2 엔티티가 LBT 실패 정보를 보고하 도록 요청한다. LBT 실패 정보 요청은 전술한 제13 정보일 수 있다. 단계 1003C: 제2 엔티티는 LBT 실패 정보를 제1 엔티티에 보고한다. LBT 실패 정보는 전술한 제14 정보일 수 있 다. 단계 1004C: 제1 엔티티는 수집된 LBT 실패 정보에 기반하여 자체 최적화 결정들 등을 내린다. 도 10d는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10d는 UE, 노드 및 마지막 서빙 노드 간에 LBT 실패 정보를 교환하는 프로세스를 예 시하며, 그래서 마지막 서빙 노드는 LBT 실패 정보를 획득할 수 있음으로써, 마지막 서빙 노드는 설정 조정을 할 수 있고 자체 최적화 결정들을 내릴 수 있다. 위에서 설명된 바와 같이, 노드는 기지국일 수 있으며, 이는 중앙 유닛(CU)과 분산 유닛(DU)을 포함할 수 있고, CU는 사용자 평면(UP)과 제어 평면(CP)을 더 포함할 수 있다. 단계 1001D: 마지막 서빙 노드(또는 마지막 서빙 노드의 CU)는 RRCReconfiguration 메시지일 수 있는 LBT- FailureRecoveryConfig를 UE에 송신한다. 단계 1002D: UE는 LBT 실패를 검출한다. 단계 1003D: UE는 RRCReestablishmentRequest를 노드(또는 노드의 CU)에 송신한다. 단계 1004D: 노드(또는 노드의 CU)는 RRCSetup 메시지를 UE에 송신한다. 단계 1005D: UE는 LBT 실패 정보를 포함하는 정보를 노드(또는 노드의 CU)에 송신하여 노드(또는 CU of 노드)에 게 UE가 LBT 실패 정보를 가짐을 알린다. LBT 실패 정보가 이용 가능함을 포함하는 정보는 전술한 제12 정보일수 있다. LBT 실패 정보가 이용 가능함을 포함하는 정보는 RRCSetupComplete 메시지에 의해 송신될 수 있다. 단계 1006D: 노드(또는 노드의 CU)는 LBT 실패 정보 요청을 UE에 송신하여 UE에게 LBT 실패 정보를 보고할 것을 요청한다. LBT 실패 정보 요청은 전술한 제13 정보일 수 있다. LBT 실패 정보 요청은 UEInformationRequest 메 시지에 의해 송신될 수 있다. 단계 1007D: UE는 LBT 실패 보고를 노드(또는 노드의 CU)에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 UEInformationResponse 메시지를 통해 송신될 수 있다. 단계 1008D: 노드(또는 노드의 CU)는 LBT 실패 보고를 마지막 서빙 노드(또는 마지막 서빙 노드의 CU)에 송신한 다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1007D에서의 모든 정보 및/또는 정보 의 일부를 포함할 수 있다. LBT 실패 보고는 실패 지시/핸드오버 보고 및/또는 액세스 및 이동성 지시 메시지에 의해 송신될 수 있다. 단계 1009D: 마지막 서빙 노드의 CU는 LBT 실패 보고를 마지막 서빙 노드의 DU에 송신한다. LBT 실패 보고는 전 술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1008D에서의 모든 정보 및/또는 정보의 일부를 포함할 수 있 다. LBT 실패 보고는 액세스 및 이동성 지시 메시지를 통해 송신될 수 있다. 마지막 서빙 노드(또는 마지막 서빙 노드의 CU 또는 마지막 서빙 노드의 CU)는 자체 최적화 결정들을 내릴 수 있고 및/또는 수신된 LBT 실패 보고에 기반하여 설정을 업데이트할 수 있다. 도 10e는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10e는 이중-연결의 경우에 세컨더리 노드에 의해 설정된 자원들에서 LBT 실패가 발생 할 때 UE, 마스터 노드 및 세컨더리 노드 간에 LBT 실패 정보를 교환하는 프로세스를 예시하며, 그래서 세컨더 리 노드는 LBT 실패 정보를 획득할 수 있어, 세컨더리 노드는 설정 조정을 내릴 수 있고 자체 최적화 결정들을 내릴 수 있다. 단계 1001E: 세컨더리 노드(이는 또한 세컨더리 노드의 CU일 수 있음)는 LBT 실패 복구 설정을 UE에 송신하는데, 이는 RRCReconfiguration 메시지일 수 있다. 단계 1002E: UE는 LBT 실패를 검출한다. 단계 1003E: UE는 LBT 실패 보고를 마스터 노드(또는 마스터 노드의 CU)에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 SCGFailureInformation 메시지에 의해 송신될 수 있다. 단계 1004E: 마스터 노드(이는 또한 마스터 노드의 CU일 수 있음)는 LBT 실패 보고를 세컨더리 노드(이는 또한 세컨더리 노드의 CU)에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1003E에 서의 모든 정보 및/또는 정보의 일부를 포함할 수 있다. LBT 실패 보고는 SgNB 수정 요청 및/또는 SCG 실패 정 보 보고 메시지를 통해 송신될 수 있다. 단계 1005E: 세컨더리 노드의 CU는 LBT 실패 보고를 세컨더리 노드의 DU에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1004E에서의 모든 정보 및/또는 정보의 일부를 포함할 수 있다. LBT 실패 보고는 액세스 및 이동성 지시 메시지를 통해 송신될 수 있다. 마스터 노드(이는 또한 마스터 노드의 CU일 수 있음)와 세컨더리 노드(이는 또한 세컨더리 노드의 CU 또는 세컨 더리 노드의 CU일 수 있음)는 수신된 LBT 실패 보고에 기반하여 자체 최적화 결정들을 내릴 수 있고 및/또는 설 정들을 업데이트할 수 있다. 도 10f는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10f는 이중-연결의 경우에 마스터 노드에 의해 설정된 자원들에서 LBT 실패가 발생할 때 UE, 마스터 노드 및 세컨더리 노드 간에 LBT 실패 정보를 교환하는 프로세스를 예시하며, 그래서 마스터 노 드는 LBT 실패 정보를 획득할 수 있어, 마스터 노드는 설정 조정을 내릴 수 있고 자체 최적화 결정들을 내릴 수 있다. 단계 1001F: 마스터 노드(또는 마스터 노드의 CU)는 LBT 실패 복구 설정을 UE에 송신하며, 이는 RRCReconfiguration 메시지일 수 있다. 단계 1002F: UE는 LBT 실패를 검출한다. 단계 1003F: UE는 LBT 실패 보고를 세컨더리 노드(이는 또한 세컨더리 노드의 CU일 수 있음)에 보고한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 마스터 셀 그룹 실패 정보(MCGGailureInformation) 메시지를 통해 송신될 수 있다. 단계 1004F: 세컨더리 노드(이는 또한 세컨더리 노드의 CU일 수 있음)는 LBT 실패 보고를 마스터 노드(이는 또 한 마스터 노드의 CU)에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1003F 에서의 모든 정보 및/또는 정보의 일부를 포함할 수 있다. LBT 실패 보고는 RRC 전달 메시지에 의해 송신될 수 있다. 단계 1005F: 마스터 노드의 CU는 LBT 실패 보고를 마스터 노드의 DU에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1004F에서의 모든 정보 및/또는 정보의 일부를 포함할 수 있다. LBT 실 패 보고는 액세스 및 이동성 지시 메시지를 통해 송신될 수 있다. 마스터 노드(또는 마스터 노드의 CU 또는 마스터 노드의 CU)는 자체 최적화 결정들을 내릴 수 있고 및/또는 수 신된 LBT 실패 보고에 기반하여 설정을 업데이트할 수 있다. 도 10g는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시한다. 구체적으로, 도 10g는 UE, 노드, 마지막 서빙 노드 및 AMF 간에 LBT 실패 정보를 교환하는 프로세스 를 예시하며, 그래서 마지막 서빙 노드는 LBT 실패 정보를 획득할 수 있음으로써, 마지막 서빙 노드는 설정 조 정을 할 수 있고 자체 최적화 결정들을 내릴 수 있다. 단계 1001G: 마지막 서빙 노드(또는 마지막 서빙 노드의 CU)는 RRCReconfiguration 메시지일 수 있는 LBT 실패 복구 설정을 UE에 송신한다. 단계 1002G: UE는 LBT 실패를 검출한다. 단계 1003G: UE는 RRCReestablishmentRequest를 노드(또는 노드의 CU)에 송신한다. 단계 1004G: 노드(또는 노드의 CU)는 RRCSetup 메시지를 UE에 송신한다. 단계 1005G: UE는 LBT 실패 정보 이용 가능함을 포함하는 정보를 노드(또는 노드의 CU)에 송신하여 노드(또는 노드의 CU)에게 UE가 LBT 실패 정보를 가짐을 알린다. LBT 실패 정보 이용 가능함을 포함하는 정보는 전술한 제 12 정보일 수 있다. LBT 실패 정보 이용 가능함을 포함하는 정보는 RRCSetupComplete 메시지에 의해 송신될 수 있다. 단계 1006G: 노드(또는 노드의 CU)는 LBT 실패 정보 요청을 UE에 송신하여 UE에게 LBT 실패 정보를 보고할 것을 요청한다. LBT 실패 정보 요청은 전술한 제13 정보일 수 있다. LBT 실패 정보 요청은 UEInformationRequest 메 시지에 의해 송신될 수 있다. 단계 1007G: UE는 LBT 실패 보고를 노드(또는 노드의 CU)에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 UEInformationResponse 메시지를 통해 송신될 수 있다. 단계 1008G: 노드(또는 노드의 CU)는 LBT 실패 보고를 AMF에 송신한다. LBT 실패 보고는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1007G에서의 모든 정보 및/또는 정보의 일부를 포함할 수 있다. LBT 실패 보고는 업링크 RAN 설정 전달 메시지를 통해 송신될 수 있다. 단계 1009G: AMF는 LBT 실패 보고를 마지막 서빙 노드(또는 마지막 서빙 노드의 CU)에 송신한다. LBT 실패 보고 는 전술한 제14 정보일 수 있다. LBT 실패 보고는 단계 1008G에서의 모든 정보 및/또는 정보의 일부를 포함할 수 있다. LBT 실패 보고는 다운링크 RAN 설정 전달 메시지를 통해 송신될 수 있다. 마지막 서빙 노드의 CU는 정보의 모두 및/또는 일부를 수신된 LBT 실패 보고로 마지막 서빙 노드의 DU에 포워딩 할 수 있다. 마지막 서빙 노드(또는 마지막 서빙 노드의 CU 또는 마지막 서빙 노드의 CU)는 자체 최적화 결정들을 내릴 수 있고 및/또는 수신된 LBT 실패 보고에 기반하여 설정을 업데이트할 수 있다. 다음으로, 도 11은 본 개시의 실시예들에 따른 제1 엔티티의 개략도를 예시한다. 도 11에 보인 바와 같이, 본 개시의 실시예들에 따른 제1 엔티티는 송수신부와 프로세서를 포함할 수 있다. 송수신부는 신호들을 송수신하도록 구성될 수 있다. 프로세서는 송수신부에 결합될 수 있고 본 개시의 실시예들에 따른 제1 엔티티에 의해 수행되는 방법들을 수행하도록(예컨대, 송수신부를 제어하도록) 구성될 수 있다. 도 12는 본 개시의 실시예들에 따른 제2 엔티티의 개략도를 예시한다. 도 12에 보인 바와 같이, 본 개시의 실시예들에 따른 제2 엔티티는 송수신부와 프로세서를 포함할 수 있다. 송수신부는 신호들을 송수신하도록 구성될 수 있다. 프로세서는 송수신부에 결합될 수 있고 본 개시의 실시예들에 따른 제2 엔티티에 의해 수행되는 방법들을 수행하도록(예컨대, 송수신부 를 제어하도록) 구성될 수 있다. 프로세서는 또한 제어기라고 지칭될 수 있다. 본 개시의 실시예들은 또한, 프로세서에 의해 실행될 때, 본 개시의 실시예들에 따른 임의의 방법을 이행하는 컴퓨터 판독가능 명령어들을 저장하는 컴퓨터 판독가능 매체를 제공한다. 본 개시에 의해 제공되는 무선 통신 시스템에서 제1 엔티티 및/또는 제2 엔티티에 의해 수행되는 방법들은 제1 엔티티 및/또는 제2 엔티티가 모바일 부하 균형의 의사 결정 및 모바일 강건한 최적화의 의사 결정과 같은 네트 워크 자체 최적화 결정을 내리기 위한 보조 정보를 효율적으로 획득하는 것을 가능하게 할 수 있다. 본 개시의 다양한 실시예들은 특정 관점에서 컴퓨터 판독가능 기록매체 상에 수록되는 컴퓨터 판독가능 코드들 로서 구현될 수 있다. 컴퓨터 판독가능 기록 매체는 컴퓨터 시스템에 의해 판독 가능한 데이터를 저장할 수 있 는 임의의 데이터 저장 디바이스이다. 컴퓨터 판독가능 기록 매체의 예들은 판독전용 메모리(read-only memory, ROM), 랜덤 액세스 메모리(random access memory, RAM), 콤팩트 디스크 판독전용 메모리(compact disk read- only memory, CD-ROM), 자기 테이프, 플로피 디스크, 광학적 데이터 저장 디바이스, 반송파(예컨대, 인터넷을 통한 데이터 전송) 등을 포함할 수 있다. 컴퓨터 판독가능 기록 매체는 네트워크를 통해 연결되는 컴퓨터 시스 템들에 의해 배포될 수 있고, 따라서 컴퓨터 판독가능 코드들은 분산 방식으로 저장되고 실행될 수 있다. 더욱 이, 본 개시의 다양한 실시예들을 구현하기 위한 기능성 프로그램들, 코드들, 및 코드 세그먼트들은 본 개시의"}
{"patent_id": "10-2025-7003037", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "실시예들이 적용되는 기술분야의 통상의 기술자들에 의해 쉽사리 설명될 수 있다. 본 개시의 실시예들은 하드웨어, 소프트웨어, 또는 하드웨어 및 소프트웨어의 조합으로 구현될 수 있다는 것이 이해될 것이다. 소프트웨어는 프로세서 상에서 실행 가능한 프로그램 명령들 또는 컴퓨터 판독가능 코드들로서 비일시적 컴퓨터 판독가능 매체 상에 저장될 수 있다. 비일시적 컴퓨터 판독가능 기록 매체의 예들은 자기 저장 매체(이를테면, ROM, 플로피 디스크, 하드 디스크 등)와 광학적 기록 매체(이를테면, CD-ROM, 디지털 비디오 디 스크(digital video disk)(DVD) 등)를 포함한다. 비일시적 컴퓨터 판독가능 기록 매체는 또한 네트워크에 의해 커플링되는 컴퓨터 시스템들 전체에 걸쳐 분산될 수 있어서, 컴퓨터 판독가능 코드들은 분산 방식으로 저장되고 실행된다. 매체는 컴퓨터에 의해 판독, 메모리에 저장, 프로세서에 의해 실행될 수 있다. 다양한 실시예들은 제 어기와 메모리를 포함하는 컴퓨터 또는 휴대용 단말에 의해 구현될 수 있고, 메모리는 본 개시의 실시예들을 구 현하기 위한 명령어들을 갖는 프로그램(들)을 저장하기에 적합한 비일시적 컴퓨터 판독가능 기록 매체의 일 예 일 수 있다. 본 개시는 머신(또는 컴퓨터) 판독가능 저장 매체에 저장되는, 청구범위에서 기재되는 장치 및 방 법을 구체적으로 구현하기 위한 코드를 갖는 프로그램에 의해 실현될 수 있다. 프로그램은 유선 또는 무선 연결 을 통해 송신되는 통신 신호와 같은 임의의 매체 상에서 전자적으로 운반될 수 있고, 본 개시는 그것의 동등물 들을 적절히 포함한다. 위에서 설명된 것은 본 개시의 특정 구현예일 뿐이고, 본 개시의 보호 범위는 그것으로 제한되지 않는다. 이 기 술 분야에 정통한 임의의 사람은 본 개시에 개시되는 기술적 범위 내에서 다양한 변경들 또는 치환들을 할 수 있고, 이들 변경들 또는 치환들은 본 개시의 보호 범위 내에 포함되어야 한다. 그러므로, 본 개시의 보호 범위 는 청구항들의 보호 범위에 기반해야 한다.도면 도면1 도면2 도면3 도면4 도면5a 도면5b 도면6a 도면6b 도면7a 도면7b 도면8 도면9a 도면9b 도면9c 도면10a 도면10b 도면10c 도면10d 도면10e 도면10f 도면10g 도면11 도면12"}
{"patent_id": "10-2025-7003037", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 특정한 실시예들의 상기 및 다른 양태들, 특징들 및 장점들은 첨부 도면들과 연계하여 취해지는 다음 의 설명으로부터 더 명백하게 될 것이며, 도면들 중: 도 1은 시스템 아키텍처 진화(System Architecture Evolution, SAE)의 예시적인 시스템 아키텍처이며; 도 2는 본 개시의 다양한 실시예들에 따른 예시적인 시스템 아키텍처이며; 도 3은 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제1 엔티티에 의해 수행되는 방법의 흐름도를 예시하며; 도 4는 본 개시의 실시예들에 따른 무선 통신 시스템에서의 제2 엔티티에 의해 수행되는 방법의 흐름도를 예시하며; 도 5a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 5b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 6a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며;도 6b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 7a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 7b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 8은 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 9a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 9b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 9c는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10a는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10b는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10c는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10d는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10e는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10f는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 10g는 본 개시의 실시예들에 따른 무선 통신 네트워크의 자체 최적화를 지원하는 방법의 일 양태의 개략도를 예시하며; 도 11은 본 개시의 실시예들에 따른 제1 엔티티의 개략도를 예시하며; 그리고 도 12는 본 개시의 실시예들에 따른 제2 엔티티의 개략도를 예시한다."}
