{"patent_id": "10-2020-0022538", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0107473", "출원번호": "10-2020-0022538", "발명의 명칭": "창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템", "출원인": "김세중", "발명자": "김세중"}}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이야기 콘텐츠를 제공하고, 제공된 이야기 콘텐츠의 저작권료 및 2차적저작물에 대한 수익을 분배받는 창작자단말;상기 이야기 콘텐츠 내에 포함된 텍스트를 번역하고, 번역된 이야기 콘텐츠가 소비되면서 발생하는 광고수익을분배받는 번역가 단말;상기 번역가 단말에서 번역된 텍스트 중 일부 또는 전부를 수정하고, 수정된 비율에 비례하도록 상기 광고수익을 분배받는 수정 단말; 및상기 창작자 단말로부터 수신된 이야기 콘텐츠와 상기 창작자 단말을 매핑하여 데이터베이스화하는 저장부, 상기 이야기 콘텐츠를 기 저장된 실시간 번역 프로그램을 이용하여 각 국가의 언어로 번역 및 배포하는 인공지능번역부, 상기 인공지능 번역부에서 번역된 이야기 콘텐츠 또는 상기 저장부의 이야기 콘텐츠를 상기 번역가 단말에서 번역하는 경우 상기 번역가 단말과 번역 텍스트를 매핑하여 저장하는 관리부, 상기 수정 단말에서 상기인공지능 번역부에서 번역된 이야기 콘텐츠 또는 상기 번역 텍스트를 수정하는 경우, 수정된 비율에 비례하여수익분배를 실행하는 분배부를 포함하는 콘텐츠 플랫폼 서비스 제공 서버;를 포함하는 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 콘텐츠 플랫폼 서비스 제공 서버는,상기 번역가 단말 또는 수정 단말에서 번역 또는 수정한 이야기 콘텐츠의 번역 또는 수정에 대한 추천수 및 비추천수를 카운트하고, 상기 카운트된 추천수 및 비추천수에 기반하여 상기 번역가 단말 또는 수정 단말로 등급을 부여하고, 부여된 등급에 기반하여 수익분배를 실행하는 등급부;를 더 포함하는 것을 특징으로 하는 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 콘텐츠 플랫폼 서비스 제공 서버는,상기 수정 단말에서 수정된 수정 텍스트에, 상기 번역가 단말에서 번역된 번역 텍스트 및 원문 텍스트를 오버레이하여 표시하는 표시부;를 더 포함하는 것을 특징으로 하는 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 콘텐츠 플랫폼 서비스 제공 서버는,공개특허 10-2021-0107473-3-상기 번역가 단말 또는 수정 단말에서 번역 또는 수정한 이야기 콘텐츠에 대한 추천수 및 비추천수를 카운트하고, 상기 카운트된 추천수 및 비추천수에 기반하여 상기 창작자 단말로 등급을 부여하여 관리하는 창작부;를 더 포함하는 것을 특징으로 하는 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 콘텐츠 플랫폼 서비스 제공 서버는,상기 이야기 콘텐츠가 영화, 드라마, 애니메이션, 동화 및 소설 중 어느 하나로 제작 또는 출판되거나, 캐릭터사업, 완구 및 게임으로 2차적저작물이 파생되는 경우 상기 제작, 출판, 파생된 저작물 또는 2차적저작물에 대한 저작권료 및 수익 중 기 설정된 퍼센트를 상기 창작자 단말, 번역가 단말 및 수정 단말로 배분하는 배분부;를 더 포함하는 것을 특징으로 하는 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 인공지능 번역부는,신경망을 이용한 기계번역(Neural Machine Translation) 모델 또는 기 저장된 말뭉치(Corpus) 기반 통계기계번역(Statistical Machine Translation) 모델을 이용하여 실시간으로 번역하는 것을 특징으로 하는 창작자 및다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 인공지능 번역부는,상기 신경망을 이용한 기계번역 모델을 이용할 때, 다중언어(Multi-lingual) 말뭉치를 학습 과정에 이용하고,구어체 번역(Spoken Language Translation) 도메인에서 제 1 언어를 제 2 언어로 번역하는 것을 특징으로 하는창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법이 제공되며, 이야기 콘텐츠 를 제공하고, 제공된 이야기 콘텐츠의 저작권료 및 2차적저작물에 대한 수익을 분배받는 창작자 단말, 이야기 콘 텐츠 내에 포함된 텍스트를 번역하고, 번역된 이야기 콘텐츠가 소비되면서 발생하는 광고수익을 분배받는 번역가 (뒷면에 계속)"}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템에 관한 것으로, 창작자 뿐만 아니라 이야기 콘텐츠를 전세계 이용자가 소비할 수 있는 형태로 가공한 번역가 및 검토자 에게도 광고수익 및 2차적저작물에 대한 수익을 분배할 수 있는 플랫폼을 제공한다."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "뉴미디어 기반의 디지털 플랫폼이 발전하면서 콘텐츠 산업의 가치사슬 체계 또한 변화하고 있다. 그 결과로 다 양한 분야의 1인 크리에이티브, 1인 미디어 형태의 콘텐츠 창작자의 위상이 높아지고 있으며, MCN(Multi channel Network) 사업자와 같이 소비자, 창작자, 광고사들을 뉴미디어 플랫폼에서 연계하는 중계 사업자도 나 타나고 있다. 이러한 변화는 소비자들의 콘텐츠 이용 미디어가 유튜브, 소셜플랫폼, 넷플리스 등 동영상 플랫 폼, 모바일 미디어를 중심으로 다변화하면서 새로운 형식의 콘텐츠가 나타나고 있기 때문이다. 한국에서도 콘 텐츠 비지니스 관점에서 MCN 모델에 관한 연구들이 이루어지고 있는데, 일례로, 유투브에 의존하는 MCN 모델이수익을 창출하는데 한계가 있기 때문에 수익 다변화를 위한 다중플랫폼 네트워크(Multi Platform Network)를 구 축할 필요성이 있다고 지적하는 견해도 있다. 이때, 디지털 저작물에 대한 저작 및 수익 분배 방법이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국 공개특허 제2019-0075722호(2019년07월01일 공개)에는, 디지털 저작물의 제작에 참여할 참여자들이 디지털 저작 물의 제작에 기여한 정도를 나타내는 기여도를 결정하는 구성, 결정된 기여도에 기반하여 완성된 디지털 저작물 을 소비자에게 서비스하는 구성, 서비스된 디지털 저작물에서 발생하는 수익을 기여도에 기반하여 참여자들에게 분배하는 구성을 포함하고, 참여자들은 원저작물의 작가 및 번역가, 원저작물로부터 음원 파일을 생성하는 성우, 음원 파일에 백그라운드뮤직을 삽입하는 백그라운드뮤직 기사, 음원 파일에 효과음을 삽입하는 효과음 기 사, 디지털 저작물의 거래 플랫폼을 제공하는 플랫폼 제공자, 디지털 저작물이 소비자의 단말기로 다운로드되도 록 하는 다운로드 서비스 제공자, 디지털 저작물이 소비자의 단말기로 스트리밍되도록 하는 스트리밍 서비스 제 공자, 및 디지털 저작물을 마케팅하는 마케팅 서비스 제공자를 포함하는 구성이 개시되어 있다. 다만, MCN 비즈니스는, 창작자 중심의 비정형 디지털 콘텐츠 비즈니스로 개인 창작자들을 네트워크로 묶고 이들 에게 제작에 필요한 다양한 지원을 제공하며 창작자콘텐츠를 활용하여 수익을 발생시키는 사업으로 성격을 규정 하고 있으나, 1인 미디어 크리에이터의 광고수입이 지속적으로 콘텐츠 제작에 재투자할 만큼 크지 않고, 초기 크리에이터들이 체계적으로 콘텐츠를 제작하고 채널 영향력을 키워 나기기 위해서는 크리에이터를 중요한 산업 분야로 인식하고, 이에 대한 정책적 접근과 인프라 구축이 필요하다. 또, MCN은, 크리에이터의 콘텐츠 기획, 제작, 마케팅, 저작권, 유통 및 사업의 전반적인 또는 일부를 제공하는 사업자로 정의하는 경우, MCN을 가치 창 출 관점에서 고객개발, 프로모션, 브랜딩 전략 개발, 수익 창출, 콘텐츠 제작, 디지털 저작권 관리 및 법적 서 비스, 협업 등이 전제되어야 한다. 이에, 다중협업자가 참여하면서 수익을 분배하는 플랫폼의 연구 및 개발이 요구되고 있다."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 남녀노소 그 누구라도 이야기 플랫폼에 자신의 이야기를 업로드 및 공유할 수 있고, 이 야기 텍스트에 대한 실시간 인공지능 번역을 제공하여 각국의 구독자가 전 세계의 이야기를 접할 수 있도록 하 며, 이야기를 각국의 언어로 번역하는 번역가에 의해 이야기 콘텐츠가 직접 번역되거나 또는 인공지능 번역으로 단순 기계적 치환으로 어색한 표현을 수정자에 의해 수정이 되는 방식으로 공유되도록 함과 동시에, 번역 및 수 정에 대한 리뷰나 평점으로 등급을 부여하고 번역 및 수정에 대한 기여도에 기반하여 수익을 분배하고, 이야기 콘텐츠가 제작 또는 출판되거나 2차적저작물로 파생될 경우 이에 대한 수익도 다중참여자에게 모두 분배함으로 써 원저작권자 뿐만 아니라 흥행에 도움을 준 번역자나 수정자까지도 함께 공정하게 수익분배를 받을 수 있으며, 적극적인 번역 및 수정을 유도할 수 있는, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같 은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 이야기 콘텐츠를 제공하고, 제공된 이야기 콘텐츠의 저작권료 및 2차적저작물에 대한 수익을 분배받는 창작자 단말, 이야기 콘텐츠 내에 포 함된 텍스트를 번역하고, 번역된 이야기 콘텐츠가 소비되면서 발생하는 광고수익을 분배받는 번역가 단말, 번역 가 단말에서 번역된 텍스트 중 일부 또는 전부를 수정하고, 수정된 비율에 비례하도록 광고수익을 분배받는 수 정 단말 및 창작자 단말로부터 수신된 이야기 콘텐츠와 창작자 단말을 매핑하여 데이터베이스화하는 저장부, 이 야기 콘텐츠를 기 저장된 실시간 번역 프로그램을 이용하여 각 국가의 언어로 번역 및 배포하는 인공지능 번역 부, 인공지능 번역부에서 번역된 이야기 콘텐츠 또는 저장부의 이야기 콘텐츠를 번역가 단말에서 번역하는 경우 번역가 단말과 번역 텍스트를 매핑하여 저장하는 관리부, 수정 단말에서 인공지능 번역부에서 번역된 이야기 콘 텐츠 또는 번역 텍스트를 수정하는 경우, 수정된 비율에 비례하여 수익분배를 실행하는 분배부를 포함하는 콘텐 츠 플랫폼 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 남녀노소 그 누구라도 이야기 플랫폼에 자신의 이야 기를 업로드 및 공유할 수 있고, 이야기 텍스트에 대한 실시간 인공지능 번역을 제공하여 각국의 구독자가 전세계의 이야기를 접할 수 있도록 하며, 이야기를 각국의 언어로 번역하는 번역가에 의해 이야기 콘텐츠가 직접 번역되거나 또는 인공지능 번역으로 단순 기계적 치환으로 어색한 표현을 수정자에 의해 수정이 되는 방식으로 공유되도록 함과 동시에, 번역 및 수정에 대한 리뷰나 평점으로 등급을 부여하고 번역 및 수정에 대한 기여도에 기반하여 수익을 분배하고, 이야기 콘텐츠가 제작 또는 출판되거나 2차적저작물로 파생될 경우 이에 대한 수익 도 다중참여자에게 모두 분배함으로써 원저작권자 뿐만 아니라 흥행에 도움을 준 번역자나 수정자까지도 함께 공정하게 수익분배를 받을 수 있으며, 적극적인 번역 및 수정을 유도할 수 있다."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1개의 유닛이 2개 이상의 하드웨어를 이용하여 실현되어도 되 고, 2개 이상의 유닛이 1개의 하드웨어에 의해 실현되어도 된다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템은, 적어도 하나의 창작자 단말, 콘텐츠 플랫폼 서비스 제공 서버 , 적어도 하나의 번역가 단말, 적어도 하나의 수정 단말을 포함할 수 있다. 다만, 이러한 도 1의 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 창작자 단말은 네트워크를 통하여 콘텐츠 플랫폼 서비스 제공 서버 와 연결될 수 있다. 그리고, 콘텐츠 플랫폼 서비스 제공 서버는, 네트워크를 통하여 적어도 하 나의 창작자 단말, 적어도 하나의 번역가 단말, 적어도 하나의 수정 단말과 연결될 수 있다. 또한, 적어도 하나의 번역가 단말은, 네트워크를 통하여 콘텐츠 플랫폼 서비스 제공 서버와 연 결될 수 있다. 그리고, 적어도 하나의 수정 단말은, 네트워크를 통하여 적어도 하나의 창작자 단말 , 콘텐츠 플랫폼 서비스 제공 서버 및 적어도 하나의 번역가 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 RF, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5GPP(5th Generation Partnership Project) 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스 (Bluetooth) 네트워크, NFC 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 창작자 단말은, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 이야기 콘텐츠를 업로드하는 단말일 수 있 다. 그리고, 적어도 하나의 창작자 단말은, 이야기 콘텐츠에 대한 저작권료 또는 수익을 콘텐츠 플랫폼 서비스 제공 서버로부터 정산 또는 분배받는 단말일 수 있다. 적어도 하나의 창작자 단말은, 콘텐츠 플랫폼 서비스 제공 서버의 플랫폼 내에서 추천 또는 비추천과 같은 평점이나, 리뷰 등에 의해 등급이나 레벨이 부여되는 단말일 수 있다. 여기서, 적어도 하나의 창작자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 창작자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 창작자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 콘텐츠 플랫폼 서비스 제공 서버는, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서 비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 제공하는 서버일 수 있다. 그리고, 콘텐츠 플랫폼 서비스 제공 서버는, 적어도 하나의 창작자 단말로부터 이야기 콘텐츠를 수집하고, 창작자 단말(10 0)과 매핑하여 저장하는 서버일 수 있다. 그리고, 콘텐츠 플랫폼 서비스 제공 서버는, 기 저장된 인공지 능 번역 프로그램으로 실시간 각국 언어로 번역하여 이야기 콘텐츠를 업로드하는 서버일 수 있다. 또한, 콘텐 츠 플랫폼 서비스 제공 서버는, 적어도 하나의 번역가 단말에서 이야기 콘텐츠를 번역하는 경우, 번 역된 이야기 콘텐츠를 업로드하고, 추천 또는 비추천 등의 평점이나 리뷰를 로그로 저장하는 서버일 수 있다. 그리고, 콘텐츠 플랫폼 서비스 제공 서버는, 적어도 하나의 수정 단말에서 번역된 이야기 콘텐츠에 대한 수정 작업이 이루어진 경우, 수정을 반영한 최종본을 업로드하고, 수정된 이야기 콘텐츠에 대한 추천 또는 비추천 등의 평점이나 리뷰를 로그로 저장하는 서버일 수 있다. 또한, 콘텐츠 플랫폼 서비스 제공 서버는, 번역 또는 수정에 대한 평점이나 리뷰에 근거하여 번역 및 수정에 대한 등급을 부여하고, 기여도 에 기반하여 수익을 분배하는 서버일 수 있다. 그리고, 콘텐츠 플랫폼 서비스 제공 서버는, 이야기 콘텐츠가 출판 또는 제작되거나 2차적저작물로 파생된 경우, 수익을 분배하여 정산하는 서버일 수 있다. 여기서, 콘텐츠 플랫폼 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트 북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 번역가 단말은, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하는 번역가의 단말일 수 있다. 이때, 적어도 하나의 번역가 단말은, 콘텐츠 플랫폼 서비스 제공 서버에서 제공된 이야기 콘텐츠를 직접 번역하거 나, 또는 기 저장된 인공지능 번역 프로그램으로 번역된 이야기 콘텐츠를 재번역하는 번역가의 단말일 수 있다. 그리고, 번역가 단말은, 번역된 이야기 콘텐츠의 리뷰 또는 평점에 의해 번역가 등급을 콘텐츠 플랫폼 서 비스 제공 서버로부터 부여받는 단말일 수 있다. 여기서, 적어도 하나의 번역가 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 번역가 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 번역가 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 적어도 하나의 수정 단말은, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 관 련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 인공지능 프로그램으로 번역된 이야기 콘텐 츠나 번역가 단말에서 번역한 이야기 콘텐츠를 수정하는 단말일 수 있다. 그리고, 적어도 하나의 수정 단 말은 수정된 비율, 즉 기여도에 따라 수익을 분배받을 수 있고, 리뷰나 평점에 의해 등급을 부여받을 수 있는 단말일 수 있다. 수익을 분배받는 비율은 기여도일 수도 있지만, 수정된 텍스트의 비율이나 평점 등과 복 합적으로 계산된 결과에 따를 수도 있다. 여기서, 적어도 하나의 수정 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 수정 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 수정 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 콘텐츠 플랫폼 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3은 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 콘텐츠 플랫폼 서비스 제공 서버는, 저장부, 번역부, 관리부, 분배부 , 등급부, 표시부, 창작부 및 배분부를 포함할 수 있다. 본 발명의 일 실시예에 따른 콘텐츠 플랫폼 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하나의 창작자 단말, 적어도 하나의 번역가 단말, 및 적어도 하나의 수정 단말로 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이 지 등을 전송하는 경우, 적어도 하나의 창작자 단말, 적어도 하나의 번역가 단말, 및 적어도 하나의 수정 단말은, 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 애플리케이션, 프 로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나의 창작자 단말, 적어도 하나의 번역가 단말, 및 적어도 하나의 수정 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: world wide web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(hyper text mark-up language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그 램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러(Explorer), 크롬(chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실 행되는 앱(app)을 포함한다. 도 2를 참조하면, 저장부는, 창작자 단말로부터 수신된 이야기 콘텐츠와 창작자 단말을 매핑하 여 데이터베이스화할 수 있다. 이때, 저장부는, 이야기 콘텐츠를 콘텐츠 플랫폼 서비스 제공 서버에 서 제공하는 페이지 상에 업로드할 수 있다. 이때, 창작자 단말은, 이야기 콘텐츠를 제공하고, 제공된 이 야기 콘텐츠의 저작권료 및 2차적저작물에 대한 수익을 분배받을 수 있다. 인공지능 번역부는, 이야기 콘텐츠를 기 저장된 실시간 번역 프로그램을 이용하여 각 국가의 언어로 번역 및 배포할 수 있다. 이때, 인공지능 번역부는, 사용자나 이용자의 각각의 단말에서 자국의 언어로 실시간 번역되도록 가상화 서비스를 더 제공할 수 있다. 예를 들어, 컴퓨터 가상화 및 클라우드를 이용하여 부족한 인 프라를 보충해줄 수도 있다. 첫 번째는, Iaas(Infrastructure as a Service)로 서버 운영에 필요한 서버자원, IP, Network, Storage, 전력 등 여러 인프라 자원을 탄력적이고 빠르게 제공할 수 있다. Iaas는 자원을 쉽게 추가하거나 제거할 수 있으며 운영체제를 제공하므로 친숙한 환경이 주어질 수 있다. 두 번째는, Paas(Platform as a Service)로 서비스를 제공할 수 있는데, 안정적인 환경과 그 환경을 이용하는 응용 프로그 램을 개발할 수 있는 API까지 제공하는 서비스이다. Paas는 간편하게 원시코드를 빌드 및 배포할 수 있으며 사 용량에 따라 scale out을 하기 용이하다. 세 번째는, Saas(Software as a Service)는 클라우드 환경에서 동작 하는 응용프로그램을 사용자에게 제공 하는 서비스이다. Saas는 인터넷 어디에서든 쉽게 이용할 수 있고, 웹브 라우저만 있으면 어디서든 접근할 수 있다. 이때, 공장의 요구사항에 따라 Baas(Backend as a Service)를 더 추가할 수도 있다. Baas는 모바일 애플리케이션에 특화된 서비스로 모바일 애플리케이션에서 처리하기 힘든 회 원관리 및 푸시, 파일 처리 등 서버 측 애플리케이션을 제공할 수 있다. Paas의 플랫폼을 이용할 수 있고 제공 되는 백앤드 모듈을 REST API나 라이브러리 CALL을 통해 바로 사용할 수 있도록 구성될 수도 있다. 이때, 인공지능 번역부는, 신경망을 이용한 기계번역(Neural Machine Translation) 모델 또는 기 저장된 말뭉치(Corpus) 기반 통계기계 번역(Statistical Machine Translation) 모델을 이용하여 실시간으로 번역할 수 있다. 여기서, 인공지능 번역부는, 신경망을 이용한 기계번역 모델을 이용할 때, 다중언어((Multi- lingual) 말뭉치를 학습 과정에 이용하고, 구어체 번역(Spoken Language Translation) 도메인에서 제 1 언어를 제 2 언어로 번역할 수 있다. 이를 위하여, 첫 번째로 전처리 과정이 실행되는데, 각국 언어 특성에 맞는 단어 분석기를 사용하여 단어 분리 (Word Segmentation) 처리를 진행할 수 있다. 예를 들어, 한국어 문장은, Komoran 형태소 분석기, 영어 문장은 Moses Tokenizer, 일본어 문장은 Mecab 일본어 형태소 분석기, 중국어 문장은 Stanford Chinese Word Segmenter를 이용할 수 있지만 이에 한정되지는 않는다. 또한, 영어 문장의 경우 학습 말뭉치로 Moses True- casing 모델을 학습하여 모든 문장에 대하여 True-casing(대소문자 정규화)를 진행할 수 있다. 다중-언어 자원 을 이용하기 위하여 소스 문장의 시작부에 타깃 언어 토큰을 추가할 수도 있는데, 예를 들어, 한국어-일본어 병 렬 데이터를 사용할 수도 있다. 두 번째는, 서브단어(Subword)를 표현하는 단계이다. NMT 모델은 일반적으로 고정 사이즈의 단어 사전을 사용 하는데, 기계번역이 이름, 숫자, 날짜 등 형식으로 인한 오픈 사전 문제(Open Vocabulary Problem)임을 고려 할 때 고정 사이즈 단어 사전을 사용하는 것은 대량의 OOV(Out-of-vocabulary) 단어들을 표현할 수 없다. 이러한 OOV 문제를 완화하기 위한 방법으로 단어를 더 작은 단위, 서브단어로 표현하여 사전을 구축할 수 있다. 서브 단어의 표현 방법은, 예를 들어, BPE(Byte-pair Encoding)와, WPM(Word-piece Model) 등을 사용할 수 있으나 이에 한정되지는 않는다. 이렇게 전처리 및 표현이 완료되었으면, 세 번째로, 학습 및 평가를 수행해야 하는데, 기 저장된 한국어-영어 병렬 말뭉치나, 한국어-중국어 병렬 말뭉치, 한국어-일어 병렬 말뭉치 등으로 학습 데이터와 평가 데이터를 구 성할 수 있다. 이때, 데이터는 적어도 하나의 강연에서 사용하는 다양한 주제를 내포하고 있는 강연자의 스크 립트(Script)를 사용할 수 있다. 강연자는 구어체로 이야기를 하기 때문에 더 자연스러운 구어체 번역이 가능 하다. 물론, 뉴스와 같은 문어체를 이용할 수도 있고, 이때에는 구어체로 번역하는 것보다는 정형화된 데이터 를 사용할 수 있으므로 번역 난이도가 더 낮다. 한편, 상술한 강연 데이터 이외에도, 번역 모델의 성능을 향상시키기 위하여, 다른 말뭉치를 더 이용할 수도 있으나 그 종류는 한정하지 않기로 한다. 또, 상술한 번역 모델 이외에도 다양한 번역 모델이 이용될 수 있으므로 상술한 번역 모델에 한정하지 않고, 열거되지 않은 이유로 배 제되지 않는다. 관리부는, 인공지능 번역부에서 번역된 이야기 콘텐츠 또는 저장부의 이야기 콘텐츠를 번역가 단말에 서 번역하는 경우 번역가 단말과 번역 텍스트를 매핑하여 저장할 수 있다. 이때, 번역가 단말은, 이 야기 콘텐츠 내에 포함된 텍스트를 번역하고, 번역된 이야기 콘텐츠가 소비되면서 발생하는 광고수익을 분배받 을 수 있다. 수익분배근거는 분배부에서 후술하기로 한다. 분배부는, 수정 단말에서 인공지능 번역부에서 번역된 이야기 콘텐츠 또는 번역 텍스트를 수정하는 경우, 수정된 비율에 비례하여 수익분배를 실행할 수 있다. 수정 단말은, 번역가 단말에서 번역된 텍스트 중 일부 또는 전부를 수정하고, 수정된 비율에 비례하도록 광고수익을 분배받을 수 있다. 이때, 수익은 광고수익일 수 있으나 이에 한정되지 않고 후술될 2차적저작물에 대한 수익일 수도 있다. 또, 분 배부는, 번역가 단말의 번역 및 수정 단말의 수정된 이야기 콘텐츠가 소비되는 일단위 또는 실 시간 로그를 수집하고, 저작물이 온라인에서 판매될 때마다 발생하는 로그도 수집하며, 최종이용자가 저작물을 이용할시 발생하는 로그를 표준화함으로써 정산 및 분배를 검증할 수 있다. 예를 들어, 서비스 사업자와 저작 권대리·중개업자 그리고 저작권집중관리단체 등의 권리자 및 업체별로 사용하는 로그의 포맷 등이 상이하여 상 호간에 해당 로그를 통하여 정산 및 분배에 대한 검증을 위해서는 상당한 비용과 시간이 소요됨에 따라 이를 해 결하기 위해서는 로그를 표준화하고, 해당 로그를 통한 정산검증을 위해서 표준화된 로그를 통합하고 분석하는 로그를 활용한 시스템으로 해결될 수 있다. 이러한 통합로그 시스템은 저작물을 소비 또는 거래함에 있어 실제 로 발생할 수 있는 뷰(View) 로그, 업로드 로그, 판매내역로그, 실거래내역 데이터베이스 그리고 정산로그 등을 실시간으로 자동 수집하여 분석하여 정산서와 실질적으로 비교분석을 통하여 해당 정산에 대한 신뢰를 제고함으 로써 해결될 수 있다. 이외에도 정산누락 등이 발생할 경우 정산누락 등의 원인이 되는 비제휴, 필터링 미호출, 고의누락 등을 실시간 으로 집계하여 이를 분석하고 기록함으로써 정산을 투명화 하는데 상당한 정보 등을 제공함으로써 음악저작물이 이용된 경우 정산 및 분배에 대해 검증시스템의 부재로 인해 정산의 신뢰부족을 해결하기 위한 방안으로서 빅데 이터를 통한 정산 분석 서비스를 통하여 정산 검증이 가능하다. 분배부는, 이용자 단말의 이용 상황을 모니터링하여 저작권 이용료를 산출하고 수익을 분배 및 정산할 때, 이용 상황을 구성하는 적어도 하나의 팩터(Factor)에 기반하여 저작권 이용료를 산출하고 저작재산권의 종류, 적어도 하나의 팩터, 및 저작권 이용료를 히스토리 로그로 저장할 수 있다. 또한, 분배부는, 저작물이 애 니메이션 저작물인 경우, 업로드 판매내역 로그, 필터링 로그, 실거래내역 로그, 실시간 정산 로그, 및 비제휴 모니터링 로그를 포함한 실시간 로그를 자동으로 수집하고, 수집된 데이터를 기준으로 식별자를 기준으로 정리 하여 매칭하며 자동으로 수집된 실시간 로그와 공유 플랫폼(미도시)에서 정산된 내역을 비교하여 정산 누락 건 수를 실시간 집계하고 항목별 자동으로 로그를 분석할 수 있다. 오류가 발생되거나 누락된 건수는 다시 각 당 사자에게 전송하여 피드백을 요청함으로써 상호 간의 신뢰를 구축할 수 있다. 이때, 공유 플랫폼(미도시)에서 자동수집되는 실시간 로그는, 업로드 판매내역 로그, 필터링 로그, 실거래내역 로그, 실시간 정산 로그, 비제휴 모니터링 채증 로그 등 실시간 수집 로그들을 자동으로 수집하고 수집된 데이 터를 유일키 기준으로 정리하여 실시간 자동 매칭할 수 있다. 실시간 로그를 분석하기 위해서는, 각 로그의 특 성을 고려하여 미리 설계된 로직에 따라 비제휴 원인분석결과, 필터링 미호출, 고의 누락, 미제휴 다운로드 건 수, 정산누락 건수 등이 실시간 집계되며 항목별 자동으로 로그를 분석하는 방법이 이용될 수 있다. 그리고, 정산 데이터를 수집하는데, 기존 매월 또는 실시간으로 전달되는 정산데이터 로그를 자동으로 저장하고 공유 플 랫폼의 데이터와 비교분석되는 값으로 이용될 수 있다. 물론, 수집되는 로그나 기준값 그리고 비교값은 상술한 로그로 한정되는 것은 아니고 계약의 종류나 사인 간의 자유로운 의사 또는 실시예에 따라 변경될 수 있음은 자 명하다 할 것이다. 등급부는, 번역가 단말 또는 수정 단말에서 번역 또는 수정한 이야기 콘텐츠의 번역 또는 수정 에 대한 추천수 및 비추천수를 카운트하고, 카운트된 추천수 및 비추천수에 기반하여 번역가 단말 또는 수 정 단말로 등급을 부여하고, 부여된 등급에 기반하여 수익분배를 실행할 수 있다. 여기서, 추천수 및 비 추천수는 정량 데이터를 분석하기에는 좋지만, 정성 데이터를 분석하기에는 적합하지 않다. 예를 들어, A 번역 가가 자국언어에 맞게 정확하게 번역을 한 경우와, 기계번역에 가까운 수준으로 번역을 한 경우는 각각 추천과 비추천 하나씩이 부여된다. 그런데, 그 정도에 있어서 등급을 부여하기 위해서는 어느 정도로 엉망으로 번역이되었는지, 어느 정도로 잘 번역이 되었는지는 리뷰를 보면 파악할 수 있는데, 이를 위하여, 전처리된 데이터를 오피니언 마이닝(Opinion Mining)을 적용하여 감성 점수를 계산할 수 있고, 이때 형태소 분석기(Lexical Analyzer)와 머신러닝을 통해 비속어, 은어, 줄임말을 분석하여 사전을 구축하는 감성 사전 구축기(Sentiment Dictionary Builder)를 사용할 수 있다. 이를 기반으로 감성분석(Sentiment Analysis)을 진행하게 되는데, 이 과정에서 감성을 세부적으로 분석하기 위한 세부 분석 알고리즘을 추가할 수도 있다. 온라인 리뷰는 텍스트, 이미지, 비디오 등과 같은 멀티미디어 형태로 생성되는데, 텍스트 내의 중요한 단어를 선택하기 위해 머신러닝을 이용한 속성선택(Feature Selection)을 이용할 수도 있다. FS는 불필요한 단어를 걸 러내고 중요한 단어를 선택에 분류성능을 높일 수 있다. 또는, 감성분석을 위한 효과적인 오피니언 마이닝 모 델을 위하여, 학습 분류기와 속성선택 방법인 FS의 조합을 이용할 수도 있다. 여기서, FS는, CFS(Correlation based Feature Selection), IG(Information gain) 등일 수 있고, 분류에 사용한 분류기는 로지스틱 회귀 (Logistic Regression), 의사결정 트리(Decision Tree), 신경망(Neural Network), 서포트 벡터 머신(Support Vector Machine), 나이브 베이지안 네트워크(Naive Bayesian Network), 랜덤 포레스트(Random Forest), 배깅 (Bagging), ㅅ스스태킹(Stacking), 랜덤 부분공간(Random Subspace) 중 어느 하나 또는 적어도 하나의 조합일 수 있다. FS는, 수십만 개의 속성을 포함하는 데이터 세트의 출현으로 나타난 것으로, 데이터 생성 및 관리의 프로세스를 모델링하고 변수를 확보할 수 있는데, 머신러닝 알고리즘의 관점에서 속성 선택은 차원수를 줄이면서 알고리즘 의 성능을 유지하거나 성능을 향상시키는 방법이다. 속성 선택을 위해서는, 데이터의 일반적인 속성에 의존하 고 유도 알고리즘이 독립적인 전처리 단계로 학습하는 필터(Filter) 학습, 알고리즘을 블랙박스로 간주하여 사 용하며, 예측 성능을 사용하여 변수 하위 집합의 상대적 유용성을 평가하고, 속성 선택 알고리즘을 호출하여 각 피쳐(특징)의 서브 세트를 평가하는 서브 루틴으로서 학습 방법을 사용하는 래퍼(Wrapper) 학습, 교육과정에서 FS를 수행하며 대게 지정된 학습 시스템에 적용되어 최적의 하위 집합이 분류 기준 구성에 포함되어 표시되고, 속성의 부분집합과 가설의 결합된 공간에서 검색하고 종속성을 찾을 수 있는 임베딩(Embedding)을 포함할 수 있 다. IG는, 평가 속성의 단일 변수 방법 중 하나이다. 이 방법은 정보획득에 따라 기능을 평가하고 한 번에 하나의 기능만 고려하는데, 엔트로피 측정은 이하 수학식 1과 같다. 수학식 1"}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, p(y)는 확률변수(Y)에 대한 한계확률 밀도 함수이다. 학습 데이터 세트인 S에서 관측된 Y 값이 두 번 째 속성인 X 값에 따라 분할될 경우, X에 의해 유도된 파티션에 대해 Y의 엔트로피가 나누어지기 이전의 Y의 엔 트로피보다 작다면, X와 Y의 특징 사이에 관계가 있다. 이때, X를 관찰한 후에 Y는 이하 수학식 2와 같다. 수학식 2"}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, p(y|x)는 주어진 x의 조건부 확률이다. 엔트로피가 훈련 집합 S에서 불순물을 기준으로 주어지면, Y의 엔트로피가 감소하는 양을 나타내는 X에 의해 제공된 Y에 관한 추가 정보를 반영하는 측정을 정의할 수 있다. 이 측정은 X와 Y 사이의 종속성을 나타내는 지표로, IG라 하고, 이에 따른 수학식은 이하 수학식 3과 같다. 이 때, 모든 속성의 규칙적인 분류를 제공하고, 얻어진 순서에 따라 속성의 수를 선택하기 위한 임계값이 미리 설 정될 수도 있다. 수학식 3 CFS는, 상관관계 기반 휴리스틱 평가 함수에 따라 속성 서브 세트를 랭킹하는 다변수 필터 알고리즘이다. 이는 포함된 속성들 간에 부분 집합이 서로 상관관계가 있는지 혹은 없는지에 대한 오류를 평가하는 방법이다. 휴리 스틱 평가는 목표 변수에 대한 분류의 성능을 저해시키는 관련성이 낮은 변수를 다룬다. 관련성이 낮은 속성은 클래스와 상관관계가 낮기 때문에 배제한다. 속성선택은 독립적으로 수행될 수 있다. 로지스틱 회귀는, 선형 또는 비선형 형태의 분류를 목적으로 사용되는 회귀 분석 방법이다. 이 방법은 각 클래 스에 속한 트레이닝 인스턴스의 출력을 1로 설정하고 비 소속 인스턴스의 출력을 0으로 설정하여 클래스에 대해 회귀를 수행한다. 이러한 결과로 선형 방정식이 도출되는데, 그 다음에 미지의 클래스 검증을 할 때, 각 선형 방정식의 결과를 계산하고 가장 큰 값을 선택하는 방법으로 분류하는 분류기이다. 나이브 베이지안은, 클래스 정보가 포함되어 있는 트레이닝 인스턴스를 학습시켜 테스트 인스턴스의 클래스를 정확하게 예측하는 것이 목표 이다. 이때, 나이브 베이지안은, 두 가지 중요한 단순화 가정에 의존하기 때문에 베이지안 네트워크가 나이브 의 형태로 특화할 수 있다. 특히, 예측 속성은 주어진 클래스 별로 조건적으로 독립적이라고 가정하고, 파악된 속성 또는 잠재된 속성은 예측 프로세스에 영향을 미친다. 신경망은, 인간 뇌의 뉴런을 모방한 알고리즘으로, 다층 신경망(Multilayer Perceptron)으로 입력층(Input Layer), 은닉층(Hidden Layer), 출력층(Output Layer)로 구성되는데, 입력층에서는 각 변수에 대응하는 노드 (Node)들로 구성되어 있다. 다음 은닉층은 입력층으로부터 전달되는 변수 값들을 비선형함수로 처리하여 출력 층에 전달한다. 출력층은 목표변수에 대응하는 노드를 갖게 된다. 렌덤 포레스트는, 회귀 및 기타 작업을 수 행하기 위한 앙상블 학습 방법으로, 훈련 기간 동안 다수의 의사결정 나무가 구성되며, 분류 모드 또는 개별 트 리의 평균 예측인 클래스 출력에 의해 작동될 수 있다. 랜덤 포레스트는, 텍스트 분류의 많은 중첩 값으로 인해 다양한 앙상블 분류기와 비교할 때, 정서 분류에 더 적 합한 분류기이므로, 감정 분류에 적합하다. 무작위 공간에서 교육 데이터 세트는 배깅(Bagging)과 같은 알고리 즘을 사용하여 수정될 수 있는데, 이때 수정은 인스턴스 공간이 아닌 속성 공간에서 진행될 수 있다. 랜덤 포 레스트는, 기본 분류기를 구성하고 집계하기 위해 임의의 부분 공간을 사용할 수 있으며, 데이터 집합에 다수의 중복 또는 관련이 없는 속성이 있는 경우 원래의 기능 공간과 비교하여 임의의 부분 공간에서 보다 효과적인 기 본 분류기를 선택할 수 있다. 이 기본 분류기의 결합된 결정은 전체 속성 세트의 학습 데이터 세트에서 작성된 단일 분류기 보다 성능이 좋을 수 있다. 의사결정 트리는, 분류 또는 회귀작업에 적용할 수 있는 비모수적 방법이다. 종속 변수를 예측하기 위해 입력 공간이 지역 영역으로 분리되는 감독학습을 위한 계층적 데이터 구조인데, 유한한 비공유 노드 집합과 모서리 집합으로 구성된 그래프일 수 있다. 서포트 벡터 머신은, 분류 작업을 해결하기 위한 최적의 분리 초평면 상태 를 제공한다. 수리적 분석은 높은 차원의 분리된 초평면에서 선형문제로 입력 공간과 관련된 비선형 문제를 나 타낼 수 있고다. 배깅은, Bootstrap aggregating의 약자로 균일한 확률 분포에 따라 반복적으로 샘플링을 한 후, 의사 결정트리 모형을 조합하여 투표(Voting)에 따라서 분류 예측을 한다. 배깅은 주로 회귀분석에서 사용되며 안정성과 정확 도를 향상시키고 분산을 줄일 수 있다. 스태킹은, 동일한 타입의 모델을 조합하는 배깅과는 달리, 다양한 학습 알고리즘을 학습하여 다른 여러 알고리즘의 예측을 결합하는 작업이다. 특히, 메타 학습기를 이용해서 어떤 분 류기를 신뢰할 수 있는지를 성능을 추정 후 최고의 성능을 내는 분류기를 찾아내서 조합할 수 있다. 표시부는, 수정 단말에서 수정된 수정 텍스트에, 번역가 단말에서 번역된 번역 텍스트 및 원문 텍스트를 오버레이하여 표시할 수 있다. 번역된 부분과 원분 텍스트를 별도로 표시해주지 않는 경우, 구독자나 이용자는 어떠한 부분의 번역이 잘못된 것인지, 수정이 잘못된 것인지를 판단할 수 없고, 이를 양쪽에 나열한다 고 할지라도 두 개를 계속 번갈아가면서 보아야 하기 때문에 편의성이 떨어진다. 이에 따라, 어떠한 부분이 어 떻게 수정이 되었는지, 어떠한 원문이 자국어로 어떻게 수정이 되었는지 직관적으로 알 수 있도록, 각 단어, 구, 절 단위로 마우스 오버 또는 터치 시에 원문, 번역본 및 수정본이 각각 표시될 수 있도록 한다. 또, 이용 자가 수정을 원할 시에는 수정을 할 수 있도록 구성될 수도 있으며, 전문가가 아니더라도 일반인의 참여를 유도 할 수도 있다. 창작부는, 번역가 단말 또는 수정 단말에서 번역 또는 수정한 이야기 콘텐츠에 대한 추천수 및 비추천수를 카운트하고, 카운트된 추천수 및 비추천수에 기반하여 창작자 단말로 등급을 부여하여 관리할 수 있다. 이때, 등급은 정량적인 요소로, 정성분석에 대해서는 상술한 오피니언 마이닝에 해당하므로 이에 대 한 중복된 설명은 생략하기로 한다.배분부는, 이야기 콘텐츠가 영화, 드라마, 애니메이션, 동화 및 소설 중 어느 하나로 제작 또는 출판되거 나, 캐릭터 사업, 완구 및 게임으로 2차적저작물이 파생되는 경우 제작, 출판, 파생된 저작물 또는 2차적저작물 에 대한 저작권료 및 수익 중 기 설정된 퍼센트를 창작자 단말, 번역가 단말 및 수정 단말로 배 분할 수 있다. 또한, 여기서, 저작재산권은, 복제권, 공연권, 방송권, 전송권, 전시권, 배포권, 및 원저작물을 번역ㆍ편곡ㆍ변형ㆍ각색ㆍ영상제작 그 밖의 방법으로 작성한 창작물인 2차적저작물을 포함할 수 있으나 나열된 것들로 한정되지는 않는다. 또, 저작물은, 소설ㆍ시ㆍ논문ㆍ강연ㆍ연설ㆍ각본 그 밖의 어문저작물, 음악저작물, 연극 및 무용ㆍ무언극 그 밖의 연극저작물, 회화ㆍ서예ㆍ조각ㆍ판화ㆍ공예ㆍ응용미술저작물 그 밖 의 미술저작물, 건축물ㆍ건축을 위한 모형 및 설계도서 그 밖의 건축저작물, 사진저작물, 영상저작물, 지도ㆍ도 표ㆍ설계도ㆍ약도ㆍ모형 그 밖의 도형저작물, 컴퓨터프로그램저작물을 포함할 수 있으나, 나열된 것들로 한정되 지 않는다. 이하, 상술한 도 2의 콘텐츠 플랫폼 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상 세히 설명하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자 명하다 할 것이다. 도 3을 참조하면, (a) 콘텐츠 플랫폼 서비스 제공 서버는 창작자 단말로부터 이야기 콘텐츠를 수신하 는 경우, 이를 콘텐츠 플랫폼 서비스 제공 서버에서 제공하는 웹페이지, 앱페이지, 애플리케이션 또는 프 로그램에 업로드하고, (b) 적어도 하나의 이용자 단말(미도시)로부터 추천 또는 비추천 등의 리뷰나 평점을 수 신한다. 또한, 번역가 단말에서 이야기 콘텐츠를 번역하여 타 국가의 페이지 또는 동일한 플랫폼 내 다른 페이지 또는 동일 페이지인데 언어만 다르게 선택한 경우, 해당 국가의 이용자 단말로부터 추천 또는 비추천을 받는다. 이때, 내용 자체, 즉 이야기 콘텐츠 자체에 대한 추천 및 비추천과, 번역에 대한 추천 및 비추천은 별 도로 구비되어 이야기 자체가 나쁜 것인지, 번역이 나쁜 것인지를 구분할 수 있도록 한다. 또한, 번역본 또는 기계번역에 대한 수정이 가해질 경우, 상술한 바와 마찬가지로, (c) 수정 자체에 대한 추천 및 비추천 등의 리뷰나 평점을 수신하고, 수신된 리뷰나 평점에 의해 수정자의 등급이나 레벨을 부여하도록 한 다. 등급이나 레벨이 부여되는 것은 번역가나 창작자에게도 마찬가지로 적용될 수 있다. 또, 광고수익이 발생 할 경우, 콘텐츠 플랫폼 서비스 제공 서버는, 창작자 단말, 번역가 단말 및 수정 단말로 각각의 기여도에 따라 수익을 배분하고, 2차적저작물이 파생될 경우, 이에 대한 수익도 분배할 수 있다. 도 4a 를 참조하면, 번역 프로그램, 실시간 번역 프로그램이 이용될 수 있고, 창작자와 번역가 및 수정번역가는 각각 의 기여도에 따라 수익배분을 받을 수 있는 플랫폼 구조가 도시된다. 또, 도 4b에는 어떠한 종류의 수익을 누 구에게 분배할 것인지에 대한 수익구조가 도시된다. 다만, 광고수익배분이나 상품수익분배는 계약 당사자 간의 합의대상에 불과하므로 상술한 수익분배구성에 한정하지는 않는다. 또, 상술한 구조에 한정되지는 않고 다양한 구조 및 단계적 흐름이 가능할 수 있다. 이와 같은 도 2 내지 도 4의 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방 법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐 츠 플랫폼 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하게 유추 가능하므 로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5 를 통해 각 구성들 상호간에 데이터가 송수신되는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한 실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이"}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 콘텐츠 플랫폼 서비스 제공 서버는, 창작자 단말로부터 수신된 이야기 콘텐츠와 창작자 단말 을 매핑하여 데이터베이스화하고(S5100), 이야기 콘텐츠를 기 저장된 실시간 번역 프로그램을 이용하여 각 국가 의 언어로 번역 및 배포한다(S5200). 콘텐츠 플랫폼 서비스 제공 서버는, 인공지능 번역부에서 번역된 이야기 콘텐츠 또는 저장부의 이야기 콘텐츠를 번역가 단말에서 번역하는 경우 번역가 단말과 번역 텍스트를 매핑하여 저장하고(S5300), 수정 단말에서 인공지 능 번역부에서 번역된 이야기 콘텐츠 또는 번역 텍스트를 수정하는 경우, 수정된 비율에 비례하여 수익분배를 실행한다(S5400). 상술한 단계들(S5100~S5400)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5400)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령 어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있 는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령 어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리 케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법은 단말기에 기본적으로 설 치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2020-0022538", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4a 도면4b 도면5"}
{"patent_id": "10-2020-0022538", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 콘텐츠 플랫폼 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 창작자 및 다중참여자에게 수익을 분배하는 이야기 콘텐츠 플랫폼 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
