{"patent_id": "10-2022-0029831", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0132947", "출원번호": "10-2022-0029831", "발명의 명칭": "중도 탈락 예측 장치 및 중도 탈락 예측 방법", "출원인": "주식회사 인튜브", "발명자": "이대현"}}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "중도 탈락 예측 장치에 있어서,학습자의 개인 정보 및 학습 정보를 수집하는 정보 수집 모듈;상기 개인 정보 및 상기 학습 정보를 분석하여 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하고, 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률에 관해 설정한 목표 정보와 상기 학습자의 제1목표 정보를 비교하고,상기 제1목표 정보가 기 정의된 값 이상인 경우, 상기 학습자의 학습 패턴 정보와 학습 성취 정보에 기초하여상기 학습자의 중도 탈락 확률을 식별하는 정보 분석 모듈;을 포함하는 중도 탈락 예측 장치."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 정보 분석 모듈은,상기 개인 정보 및 상기 학습 정보에 포함된 키워드를 추출하고,상기 키워드에 따라 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 연산하도록 학습된 제1모델에 기초하여상기 개인 정보 및 상기 학습 정보를 분석하는 중도 탈락 예측 장치."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 정보 분석 모듈은,상기 학습자의 학습 패턴 정보와 학습 성취 정보를 상기 학습자가 수강하는 복수의 강의 별로 분석하는 중도 탈락 예측 장치."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 정보 분석 모듈은,상기 학습 패턴 정보와 학습 성취 정보에 따라 중도 탈락 확률을 연산하도록 학습된 제2모델에 기초하여 상기학습자의 중도 탈락 확률을 식별하는 중도 탈락 예측 장치."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 시각화 모듈을 더 포함하고,상기 시각화 모듈은,상기 학습자의 개인 정보, 상기 학습자의 학습 정보, 상기 학습자의 학습 패턴 정보, 상기 학습자의 학습 성취정보, 및 상기 학습자의 중도 탈락 확률에 관한 정보 중 적어도 어느 하나를 포함하는 중도 탈락 예측 정보를표시하는 디스플레이를 포함하는 중도 탈락 예측 장치."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,공개특허 10-2023-0132947-3-상기 정보 분석 모듈로부터 식별된 상기 학습자의 중도 탈락 확률에 관한 정보를 외부에 전송하는 결과 송출 모듈을 더 포함하는 중도 탈락 예측 장치."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "중도 탈락 예측 방법에 있어서,중도 탈락 예측 장치가 학습자의 개인 정보 및 학습 정보를 수집하는 단계;상기 중도 탈락 예측 장치가 상기 개인 정보 및 상기 학습 정보를 분석하여 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하는 단계;상기 중도 탈락 예측 장치가 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률에 관해 설정한 목표 정보와 상기 학습자의 제1목표 정보를 비교하는 단계;상기 중도 탈락 예측 장치가 상기 제1목표 정보가 기 정의된 값 이상인 경우, 상기 학습자의 학습 패턴 정보와학습 성취 정보에 기초하여 상기 학습자의 중도 탈락 확률을 식별하는 단계를 포함하는 중도 탈락 예측 방법."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하는 단계는,상기 개인 정보 및 상기 학습 정보에 포함된 키워드를 추출하는 단계;상기 키워드에 따라 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 연산하도록 학습된 제1모델에 기초하여상기 개인 정보 및 상기 학습 정보를 분석하는 단계를 포함하는 중도 탈락 예측 방법."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하는 단계는,상기 학습자의 학습 패턴 정보와 학습 성취 정보를 상기 학습자가 수강하는 복수의 강의 별로 분석하는 단계를포함하는 중도 탈락 예측 방법."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 학습자의 중도 탈락 확률을 식별하는 단계는,상기 학습 패턴 정보와 학습 성취 정보에 따라 중도 탈락 확률을 연산하도록 학습된 제2모델에 기초하여 상기학습자의 중도 탈락 확률을 식별하는 단계를 포함하는 중도 탈락 예측 방법."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서, 상기 학습자의 개인 정보, 상기 학습자의 학습 정보, 상기 학습자의 학습 패턴 정보, 상기 학습자의 학습 성취정보, 및 상기 학습자의 중도 탈락 확률에 관한 정보 중 적어도 어느 하나를 포함하는 중도 탈락 예측 정보를표시하는 단계를 더 포함하는 중도 탈락 예측 방법."}
{"patent_id": "10-2022-0029831", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 식별된 상기 학습자의 중도 탈락 확률에 관한 정보를 외부에 전송하는 단계를 더 포함하는 중도 탈락 예측방법."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 중도 탈락 예측 장치에 있어서, 학습자의 개인 정보 및 학습 정보를 수집하는 정보 수집 모듈; 상기 개인 정보 및 상기 학습 정보를 분석하여 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식 별하고, 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률에 관해 설정한 목표 정보와 상기 학습자의 제1 목표 정보를 비교하고, 상기 제1목표 정보가 기 정의된 값 이상인 경우, 상기 학습자의 학습 패턴 정보와 학습 성취 정보에 기초하여 상기 학습자의 중도 탈락 확률을 식별하는 정보 분석 모듈;을 포함한다."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 중도 탈락 예측 장치 및 중도 탈락 예측 방법에 관한 것이다."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "국내 대학들은 입시기간에 신입생을 유치하기 위하여 적극적인 홍보를 기울이고 있다. 그러나 이러한 신입생 유 치에 비하여, 재학생을 유지하는 데는 상대적으로 관심이 부족하다. 재학생의 이탈을 방지하기 위해 다양한 연구가 이루어지고 있으나 명확한 원인을 제시하지는 못하고 있으며, 재 학생의 이탈을 유발하는 원인에 대하여 제각기 제시하고 있는 실정이다. 2021년 한국콘텐츠학회 논문지에 게재된 \"대학 신입생 중도 탈락 예측 요인 분석: S대학 사례를 중심으로\" 논문 에 따르면 대학생활적응 요인 6개 변수, 교육만족요인 12개 변수, 총 18개 변수를 투입하였다. 분석결과, 정서 안정성, 경제적 여건, 전공진로에 대한 확신, 대학 선택 만족도, 교육 내용의 체계성, 전공 교육 내용의 효과성 이 중도 탈락을 예측하는 중요도 상위 6개 변수인 것으로 확인되었다. 2019년 한국빅데이터학회지 제4권 제2호 논문지에 게재된 \"학생 중도 탈락 예측지수에 관한 사후검증 연구\"에 의하면 분석에 사용한 데이터는 학습자의 총 학습시간, 강의접속 수, 총 수강차시, 중간고사 응시정보와 이수학 점 수, 평균 평점, 휴학 횟수이다. 중도 탈락을 예측하는 알고리즘은 중도 탈락 예측의 정확도가 높도록 도와주는데 그 목적이 있으며, 발생하는 데이터를 활용하여 알고리즘을 정교화 하는 노력이 필요하다."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 보다 정확하게 중도 탈락을 예측하는 중도 탈락 예측 장치 및 중도 탈락 예측 방법을 제공하 는 것이다. 본 발명의 목적은 선재적으로 학습자의 중도 탈락을 방지하는 중도 탈락 예측 장치 및 중도 탈락 예측 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 중도 탈락 예측 장치에 있어서, 학습자의 개인 정보 및 학습 정보를 수집하는 정보 수집 모듈; 상기 개인 정보 및 상기 학습 정보를 분석하여 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하고, 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률에 관해 설정한 목표 정보와 상기 학습자의 제1목표 정보를 비교하고, 상기 제1목표 정보가 기 정의된 값 이상인 경우, 상기 학습자의 학습 패턴 정보와 학 습 성취 정보에 기초하여 상기 학습자의 중도 탈락 확률을 식별하는 정보 분석 모듈;을 포함한다. 상기 정보 분석 모듈은, 상기 개인 정보 및 상기 학습 정보에 포함된 키워드를 추출하고, 상기 키워드에 따라 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 연산하도록 학습된 제1모델에 기초하여 상기 개인 정보 및 상기 학습 정보를 분석할 수 있다. 상기 정보 분석 모듈은, 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 상기 학습자가 수강하는 복수의 강 의 별로 분석할 수 있다. 상기 정보 분석 모듈은, 상기 학습 패턴 정보와 학습 성취 정보에 따라 중도 탈락 확률을 연산하도록 학습된 제 2모델에 기초하여 상기 학습자의 중도 탈락 확률을 식별할 수 있다. 상기 예측 장치는 시각화 모듈을 더 포함하고, 상기 시각화 모듈은, 상기 학습자의 개인 정보, 상기 학습자의 학습 정보, 상기 학습자의 학습 패턴 정보, 상기 학습자의 학습 성취 정보, 및 상기 학습자의 중도 탈락 확률에 관한 정보 중 적어도 어느 하나를 포함하는 중도 탈락 예측 정보를 표시하는 디스플레이를 포함할 수 있다. 상기 예측 장치는 상기 정보 분석 모듈로부터 식별된 상기 학습자의 중도 탈락 확률에 관한 정보를 외부에 전송 하는 결과 송출 모듈을 더 포함할 수 있다. 본 발명의 일 실시예에 따른 중도 탈락 예측 방법에 있어서, 중도 탈락 예측 장치가 학습자의 개인 정보 및 학 습 정보를 수집하는 단계; 상기 중도 탈락 예측 장치가 상기 개인 정보 및 상기 학습 정보를 분석하여 상기 학 습자의 학습 패턴 정보와 학습 성취 정보를 식별하는 단계; 상기 중도 탈락 예측 장치가 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률에 관해 설정한 목표 정보와 상기 학습자의 제1목표 정보를 비교하는 단계; 상 기 중도 탈락 예측 장치가 상기 제1목표 정보가 기 정의된 값 이상인 경우, 상기 학습자의 학습 패턴 정보와 학 습 성취 정보에 기초하여 상기 학습자의 중도 탈락 확률을 식별하는 단계를 포함한다. 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하는 단계는, 상기 개인 정보 및 상기 학습 정보에 포함 된 키워드를 추출하는 단계; 상기 키워드에 따라 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 연산하도록 학습된 제1모델에 기초하여 상기 개인 정보 및 상기 학습 정보를 분석하는 단계를 포함할 수 있다. 상기 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하는 단계는, 상기 학습자의 학습 패턴 정보와 학습 성 취 정보를 상기 학습자가 수강하는 복수의 강의 별로 분석하는 단계를 포함할 수 있다. 상기 학습자의 중도 탈락 확률을 식별하는 단계는, 상기 학습 패턴 정보와 학습 성취 정보에 따라 중도 탈락 확 률을 연산하도록 학습된 제2모델에 기초하여 상기 학습자의 중도 탈락 확률을 식별하는 단계를 포함할 수 있다. 상기 예측 방법은 상기 학습자의 개인 정보, 상기 학습자의 학습 정보, 상기 학습자의 학습 패턴 정보, 상기 학 습자의 학습 성취 정보, 및 상기 학습자의 중도 탈락 확률에 관한 정보 중 적어도 어느 하나를 포함하는 중도 탈락 예측 정보를 표시하는 단계를 더 포함할 수 있다. 상기 예측 방법은 상기 식별된 상기 학습자의 중도 탈락 확률에 관한 정보를 외부에 전송하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 중도 탈락 예측의 정교화를 통해 학교 시스템에 정확도 높은 예측 결과를 제공 할 수 있다. 본 발명의 일 실시예에 따르면, 정확도 높은 예측 결과의 제공을 통해 학습자가 학습 목표, 직업적 목표, 삶의 목표를 재설정 및 정비할 수 있도록 지원하여 중도 탈락의 방지 등 선재관리가 가능해진다. 본 발명의 일 실시예에 따르면, 학교의 관리적 시점에서도 중도 탈락에 대한 예측을 통해 재정적인 문제와 학교 의 인지도 향상을 선재적으로 관리하여 중도 탈락에 대한 대책을 미리 마련할 수 있다."}
{"patent_id": "10-2022-0029831", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략할 수 있고, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 대해서는 동일한 참조 부 호를 사용할 수 있다. 또한, 본 발명의 실시예에서, 제1, 제2 등과 같이 서수를 포함하는 용어는 하나의 구성요 소를 다른 구성요소로부터 구별하는 목적으로만 사용되며, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다.도 1은 본 발명의 일 실시예에 따른 중도 탈락 예측 시스템을 도시한 도면이다. 본 발명의 일 실시예에 따르면, 중도 탈락 예측 시스템(이하 예측 시스템이라 한다.)은 중도 탈락 예측 장치(이하, 예측 장치라고도 한다.), 복수의 학교 시스템, 복수의 학습자 단말를 포함한다. 본 발명에서의 중도 탈락이란 학교에 입학한 학생이 자퇴, 퇴학, 장기간 휴학 등 기타 사유로 인한 제적, 전과 등으로 인해 졸업하지 못하고 중도에 탈락하는 상황을 의미한다. 본 발명의 일 실시예에 따른 중도 탈락 예측 장치는 학습자의 중도 탈락 확률을 예측하고, 중도 탈락 확률 에 관한 정보를 학교 시스템에 제공하는 장치로써, 컴퓨터, 서버 등으로 구현될 수 있다. 본 발명의 일 실시예에 따른 학교 시스템은 학습자의 개인 정보, 학습자의 학습 정보 등 학습자의 중도 탈 락을 예측하는데 필요한 정보, 강의 계획서, 전공 커리큘럼 등을 저장, 관리하는 등 학습자의 교육 과정 전반을 관리하는 시스템을 의미한다. 학교 시스템은 학교 별로 존재하며, 컴퓨터, 서버 등으로 구현될 수 있다. 학교 시스템은 교육 과정 전반에서 발생하는 정보들을 예측 장치로 전송하고, 예측 장치가 식별 한 학습자의 중도 탈락 확률에 관한 정보를 예측 장치로부터 수신할 수 있다. 본 발명의 일 실시예에 따른 학습자 단말은 학습자가 온라인 강의를 수강하거나, 강의 평가를 수행하는 등 학습을 수행하기 위한 단말로써 컴퓨터, 노트북, 휴대폰 등으로 구현될 수 있다. 학습자 단말은 학습자의 개인 정보를 입력하는 사용자 입력을 수신하고, 학습자의 학습 정보를 생성하여 예측 장치나 학교 시스템 으로 개인 정보 및 학습 정보를 전송할 수 있다. 본 발명의 일 실시예에 따른 예측 시스템은 학교 시스템과 학습자 단말로부터 중도 탈락 예측 장 치가 수집한 학습자의 개인 정보 및 학습 정보를 분석하여 학습자의 중도 탈락의 가능성을 분석하고, 학교 시스템은 예측 장치가 분석한 정보를 수신하여 학습자 개개인의 중도 탈락을 예방, 방지하는 프로세 스에 활용할 수 있다. 이하 본 발명에서는, 중도 탈락을 예측하는 예측 장치의 구성 및 동작에 관하여 보다 자세하게 설명한다. 도 2는 본 발명의 일 실시예에 따른 중도 탈락 예측 장치의 구성을 도시한 블럭도이다. 본 발명의 일 실시예에 따른 예측 장치는 정보 수집 모듈, 시각화 모듈, 결과 송출 모듈, 정보 입력 모듈, 정보 분석 모듈을 포함한다. 본 발명의 일 실시예에 따른 정보 수집 모듈은 중도 탈락을 예측하기 위한 제반 정보를 수집하는 모듈로써, 제반 정보를 수신하기 위해 학교 시스템, 학습자 단말 등 외부장치와의 통신을 수행할 수 있다. 이를 위해, 정보 수집 모듈은 5G(5th generation communication), LTE-A(long term evolution- advanced), LTE(long term evolution), Wi-Fi(wireless fidelity) 등의 통신을 수행할 수 있다. 본 발명에서 중도 탈락을 예측하기 위한 제반 정보란 본 명세서에 걸쳐 중도 탈락을 예측하기 위해서 필요한 정보로 서술된 모든 정보를 포함한다. 정보 수집 모듈은 수집한 제반 정보, 예측 장치의 동작 프로그램들을 저장할 수 있다. 따라서, 정보 수집 모듈은 전원의 제공 유무와 무관하게 데이터(정보)를 보존할 수 있는 비휘발성 속성의 스토리지 (storage)와, 정보 분석 모듈에 의해 처리되기 위한 데이터가 로딩되며 전원이 제공되지 않으면 데이터를 보존할 수 없는 휘발성 속성의 메모리(memory)를 포함한다. 스토리지에는 플래시메모리(flash-memory), HDD(hard-disc drive), SSD(solid-state drive) ROM(Read Only Memory) 등이 있으며, 메모리에는 버퍼 (buffer), 램(RAM; Random Access Memory) 등이 있다. 정보 수집 모듈은 외부장치로부터 수신한 제반 정보 등을 저장할 수 있다. 또한, 정보 수집 모듈은 키워드에 따라 학습자의 학습 패턴 정보와 학습 성취 정보를 연산하도록 학습된 제1모델에 관한 정보, 학습 패 턴 정보와 학습 성취 정보에 따라 중도 탈락 여부를 연산하도록 학습된 적어도 하나의 제2모델에 관한 정보를 저장할 수 있다. 본 발명의 일 실시예에 따른 시각화 모듈은 예측 장치의 동작에 따른 표시 데이터를 표시한다. 동작 에 따른 표시데이터란, 예를 들어, 입력데이터를 입력하기 위한 화면, 학습자의 개인 정보, 학습 정보를 표시하 는 화면, 학습자의 개인 정보 및 학습 정보를 분석하여 획득한 학습 패턴 정보, 학습 성취 정보를 표시하는 화 면, 학습자의 중도 탈락 확률에 관한 정보를 표시하는 화면 등 중도 탈락 예측과 관련된 표시데이터라면 제한없이 적용 가능하다. 시각화 모듈은 표시데이터를 표시하는 디스플레이를 포함한다. 본 발명의 일 실시예에 따른 디스플레이는 액정 디스플레이(LCD; liquid crystal display), 발광 다이오드(LED; light emitting diode) 디스플레이, 유기 발광 다이오드(OLED; organic LED) 디스플레이, 마이크로 전자기계 시스템(MEMS; micro electro mechanical systems) 디스플레이 및 전자 종이(electronic paper) 디스플레이를 포함한다. 시각화 모듈는 입력 수단과 결합되어 터치 스크린(touch screen)으로 구현될 수 있다. 시각화 모듈은 정보 수집 모듈이나 정보 분석 모듈로부터 수신한 정보들을 단순히 표시할 뿐 아 니라, 수신한 정보들을 다양한 방식으로 시각화할 수 있다. 따라서, 시각화 모듈을 통해 사용자들은 중도 탈락에 관한 결과 데이터를 한눈에 확인할 수 있다. 보다 자세한 시각화 모습은 도 4 내지 도 8을 통해 설명한 다. 본 발명의 일 실시예에 따르면, 결과 송출 모듈은 정보 분석 모듈이 식별한 학습자의 중도 탈락 확률 에 관한 정보를 외부에 전송할 수 있다. 본 발명의 일 실시예에 따른 결과 송출 모듈은 중도 탈락 확률에 관한 정보를 외부에 송출하는 모듈로써, 학교 시스템, 학습자 단말 등 외부장치와의 통신을 수행할 수 있다. 이를 위해, 결과 송출 모듈(13 0)은 5G(5th generation communication), LTE-A(long term evolution-advanced), LTE(long term evolution), Wi-Fi(wireless fidelity) 등의 통신을 수행할 수 있다. 이때, 다른 실시예로써, 정보 수집 모듈의 통신 기능과 결과 송출 모듈의 통신 기능은 둘 중 어느 하나의 구성에서 수행 및 공유될 수 있다. 본 발명의 일 실시예에 따른 결과 송출 모듈은 중도 탈락 확률에 관한 정보뿐 아니라, 정보 분석 모듈 이 분석한 정보를 기초로 시각화 모듈이 시각화한 정보들을 시각화 모듈로부터 수신하여 외부로 송출할 수 있다. 본 발명의 일 실시예에 따르면, 정보 입력 모듈은 예측 장치의 사용자 입력에 대응하여 입력데이터를 발생시킨다. 본 발명의 사용자 입력은 중도 탈락 예측을 수행하기 위한 학습자의 개인 정보 입력 등 중도 탈락 을 예측하기 위해 관련된 모든 사용자 입력을 포함한다. 정보 입력 모듈은 적어도 하나의 입력수단을 포함한다. 정보 입력 모듈은 키보드(key board), 키패드 (key pad), 돔 스위치(dome switch), 터치패널(touch panel), 터치 키(touch key), 마우스(mouse), 메뉴 버튼 (menu button) 등을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 프로그램 등 소프트웨어를 실행하여 예측 장치의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 본 발명의 일 실시예에 따른 정보 분석 모듈은 정보 수집 모듈로부터 수집된 개인 정보 및 학습 정보 를 분석하여 학습자의 학습 패턴 정보와 학습 성취 정보를 식별하고, 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률에 관해 설정한 목표 정보와 학습자의 제1목표 정보를 비교하고, 제1목표 정보가 기 정의된 값 이상인 경우, 학습자의 학습 패턴 정보와 학습 성취 정보에 기초하여 학습자의 중도 탈락 확률을 식별할 수 있 다. 이때, 정보 분석 모듈은 학교 시스템이나 학습자 단말로부터 학습자의 개인 정보 및 학습 정보 를 수집하도록 정보 수집 모듈을 제어할 수 있다. 정보 분석 모듈은 학교 시스템이나 학습자 단 말로부터 수집한 정보를 저장하도록 정보 수집 모듈을 제어할 수 있다. 정보 분석 모듈은 예측 장치의 동작에 따른 표시 데이터를 표시하도록 시각화 모듈을 제어할 수 있고, 정보 분석 모듈 로부터 식별된 학습자의 중도 탈락 확률에 관한 정보를 외부에 전송하도록 결과 송출 모듈을 제어할 수 있 다. 한편, 프로세서는 상기 동작들을 수행하기 위한 데이터 분석, 처리, 및 결과 정보 생성 중 적어도 일부를 규칙 기반 또는 인공지능(Artificial Intelligence) 알고리즘으로서 기계학습, 신경망 네트워크(neural network), 또는 딥러닝 알고리즘 중 적어도 하나를 이용하여 수행할 수 있다. 신경망 네트워크의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network)과 같은 모델 을 포함할 수 있다.도 3은 본 발명의 일 실시예에 따른 중도 탈락 예측 장치의 동작 흐름도를 도시한 도면이다. 본 발명의 일 실시예에 따르면, 정보 수집 모듈은 학습자의 개인 정보 및 학습 정보를 수집할 수 있다 (S10). 앞서 서술한 바와 같이, 정보 수집 모듈은 학교 시스템, 학습자 단말 등 외부장치로부터 학습자 의 개인 정보 및 학습 정보를 수집할 수 있다. 본 발명에서 학습자의 개인 정보는 학습자의 나이, 성별, 주소, 학교, 입학 유형, 학과, 학년, 소득, 소득분위, 거주 지역, 학력, 직업 등을 포함한다. 본 발명에서 학습자의 학습 정보는 학습자가 수강한 강의명, 강의 코드 등을 포함하는 강의 목록, 각 과목별 성 적, 각 과목별 출석률, 출석 수강 시간대, 결석 수강 시간대, 학습자가 제출한 과제, 강의 평가 문항 및 답변, 강의 계획서, 학업 계획서, 입학 정보, 장학 정보, 학습자가 수강한 강의 평가 결과, 자기소개서, 학습자의 학 업, 진학, 심리 등 관련한 상담 내용이 기록된 정보 등을 포함할 수 있다. 이때, 정보가 수집되는 경로나 수집되는 정보의 내용은 본 발명을 한정하지 않는다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 개인 정보 및 학습 정보를 분석하여 학습자의 학습 패턴 정보와 학습 성취 정보를 식별할 수 있다(S20). 본 발명의 일 실시예에 따르면, 학습자의 학습 패턴 정보는 학습자의 개인 성향, 학습자의 학습 유형에 따른 참 여도, 강의별 이탈 여부 등을 포함할 수 있다. 이때, 학습 유형이란 오프라인 강의, 온라인 강의, 개별 과제, 조별 과제, 퀴즈, 시험, 실습 등을 의미할 수 있다. 본 발명의 일 실시예에 따르면, 학습자의 학습 성취 정보는 학습자의 강의별 수강 만족도, 학습자의 전공 만족 도, 학습자 심리 안정도, 학습자의 학교 생활 만족도 등을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 학습 정보에 포함된 키워드를 추출하고, 키워드에 따라 학습자의 학습 패턴 정보와 학습 성취 정보를 연산하도록 학습된 제1모델에 기초하여 학습 정보를 분석할 수 있 다. 특히, 학습자의 학습 정보 중 학습자의 강의에 대한 평가, 자기 소개서, 상담 내용이 기록된 정보 등의 비정형 텍스트의 경우, 이를 기초로 학습 패턴 정보와 학습 성취 정보를 분석하기 위해 정형화할 필요가 있다. 따라서, 정보 분석 모듈은 자연언어처리(NLP; Natural Language Processing) 모델을 이용하여 학습 정보 를 분석할 수 있다. 이때, 제1모델은 자연언어처리 모델을 의미할 수 있고, 하기 예시별로 각각의 제1모델들이 생성되거나, 각 정보가 종합적으로 처리되는 하나의 제1모델로 수행될 수 있으며 어느 하나에 한정되지 않는다. 이때, 제1모델의 학습 과정에서 복수의 다른 학습자들의 개인 정보 및 학습 정보를 분석한 정보들이 이용될 수 있다. 본 발명의 정보 분석 모듈이 제1모델을 이용하여 학습 패턴 정보와 학습 성취 정보를 분석하는 예시들은 다음과 같다. 예를 들어, 정보 분석 모듈은 학습자의 개인 정보 및 학습자의 자기 소개서로부터 키워드들을 추출하고, 추출된 키워드에 기초하여 학습자의 개인 성향을 식별할 수 있다. 다른 예로, 정보 분석 모듈은 학습자의 개인 성향과 학습자의 전공에 관해 설명한 정보, 예를 들어, 강의 계획서나 전공 커리큘럼 등으로부터 키워드들을 추출하고, 키워드에 기초하여 학습자의 전공에 대한 만족도를 분석할 수 있다. 보다 구체적으로 학습자의 개인 성향과 학습자의 전공에 관해 설명한 정보를 각각 벡터로 임베딩하여, 벡터 간 의 코사인 각을 이용한 벡터 간 유사도를 의미하는 코사인 유사도(cosine similarity)를 계산한 후, 양자 간 얼 마나 관련성이 높은지 여부를 판단할 수 있다. 다른 예로, 정보 분석 모듈은 학습자의 강의에 대한 평가로부터 키워드를 추출하고, 키워드에 기초하여 학 습자의 강의별 수강 만족도를 분석할 수 있다. 이때, 제1모델은 학습자의 강의별 수강 만족도를 0에서 1사이의 값으로 산출할 수 있다. 다른 예로, 정보 분석 모듈은 상담 내용이 기록된 정보로부터 키워드를 추출하고, 키워드에 기초하여 학습 자 심리 안정도, 학습자의 학교 생활 만족도 등을 분석할 수 있다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확 률에 관해 설정한 목표 정보와 상기 학습자의 제1목표 정보를 비교할 수 있다(S30). 본 발명의 일 실시예에 따르면, 목표 정보란 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률의 정확도 를 의미하는 정보이다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 S20에서 분석한 학습 패턴 정보와 학습 성취 정보를 통 합하여 하나의 결과 데이터를 생성하며, 제1목표 정보가 설정한 목표 정보에 가까운 결과를 획득하도록 반복적 으로 분석을 진행할 수 있다. 이를 통해 정보 분석 모듈은 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률의 정확도를 일정 수준 이상으로 높임으로써 예측 결과를 정교화할 수 있다. 따라서, 정보 분석 모듈은 학습자의 제1목표 정보가 기 정의된 값 미만인 경우, 분석에 필요한 정보를 추 가하거나, 제1모델의 반복 학습 등을 통해 보다 정교한 분석이 되도록 할 수 있다. 예를 들어, 정보 분석 모듈 은 학교 시스템이나 학습자 단말로부터 정보들을 업데이트하도록 정보 수집 모듈을 제어할 수 있다. 이때, 정보 분석 모듈은 복수의 다른 학습자의 목표 정보에 기초하여 목표 정보를 설정할 수 있 다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 제1목표 정보가 기 정의된 값 이상인 경우, 상기 학습자 의 학습 패턴 정보와 학습 성취 정보에 기초하여 상기 학습자의 중도 탈락 확률을 식별할 수 있다(S40). 이때, 정보 분석 모듈은 학습자의 학습 패턴 정보와 학습 성취 정보를 학습자가 수강하는 복수의 강의 별 로 분석하고, 복수의 강의에 대해 분석한 학습 패턴 정보와 학습 성취 정보에 기초하여 학습자의 중도 탈락 확 률을 식별할 수 있다. 정보 분석 모듈은 학습 패턴 정보와 학습 성취 정보에 따라 중도 탈락 여부를 연산하도록 학습된 제2모델 에 기초하여 학습자의 중도 탈락 확률을 식별할 수 있다. 제2모델은 랜덤 포레스트(random forest) 모델, 선형 회귀(logistic regression), 경사하강법(SGD; Stochastic Gradient Descent) 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 이때, 제2모델은 상기와 같은 모델들이 하나 이상 조합되어 생성되거나, 각 모델들로부터 도출된 결과들을 종합 하여 중도 탈락 확률을 다각적으로 검토할 수 있다. 정보 분석 모듈은 복수의 다른 학습자의 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률과 학습 자의 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률을 비교하여 종합적으로 중도 탈락에 대한 예측 결과를 생성할 수 있다. 본 발명의 일 실시예에 따르면, 중도 탈락 예측의 정교화를 통해 학교 시스템에 정확도 높은 예측 결과를 제공할 수 있다. 본 발명의 일 실시예에 따르면, 정확도 높은 예측 결과의 제공을 통해 학습자가 학습 목표, 직업적 목표, 삶의 목표를 재설정 및 정비할 수 있도록 지원하여 중도 탈락의 방지 등 선재관리가 가능해진다. 본 발명의 일 실시예에 따르면, 학교의 관리적 시점에서도 중도 탈락에 대한 예측을 통해 재정적인 문제와 학교 의 인지도 향상을 선재적으로 관리하여 중도 탈락에 대한 대책을 미리 마련할 수 있다. 이하, 도 4 내지 도 8에서는 정보 분석 모듈이 식별한 학습자의 중도 탈락에 관한 정보를 시각화 모듈 에 의해 표시되는 제1화면 내지 제5화면을 도시한다. 도 4는 본 발명의 제1실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 4는 학습자의 중도 탈락에 관한 정보를 표시한 제1화면을 도시한다. 제1화면은 학습 몰입도 차트를 표시하는 화면으로, 학습 몰입도 차트는 방사형 차트와 라 인형 차트를 포함한다. 본 발명의 일 실시예에 따른 학습 몰입도 차트는 데이터 베이스 개론 과목에 관한 것으로, 과목에 관 한 정보 이외에 학습자의 개인 정보를 추가로 표시할 수 있다. 이하 과목에 관한 정보는 도 5 및 도 6에도 적용할 수 있음은 물론이다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 학습자가 제출한 과제, 각 과목별 출석률, 출석 수강 시 간대, 결석 수강 시간대 등 학습 정보를 통해 학습자의 학습 유형에 따른 참여도 등 학습 패턴 정보를 식별할 수 있다. 앞서 서술한 바와 같이, 학습 유형이란 오프라인 강의, 온라인 강의, 개별 과제, 조별 과제, 퀴즈, 시 험, 실습 등을 의미할 수 있다. 시각화 모듈은 정보 분석 모듈이 분석한 학습 패턴 정보를 통해 카테고리별 참여도를 방사형 차트 로 나타내거나, 주차별 활동 횟수를 라인형 차트로 나타낼 수 있다. 이때, 카테고리의 종류나 활동 횟수, 활동 주기 등은 이에 한정되지 않는다. 또한, 학습 몰입도 차트는 같은 과목을 수강한 다른 복수의 학습자의 참여도를 함께 표시할 수 있다. 본 발명의 일 실시예에 따르면, 학습자의 학습 패턴 정보를 시각화 함으로써 한눈에 학습자의 참여도를 파악할 수 있고, 이를 다른 복수의 학습자와 함께 표현하여 다른 학습자의 참여도와 비교할 수 있다. 도 5는 본 발명의 제2실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 5는 학습자의 중도 탈락에 관한 정보를 표시한 제2화면을 도시한다. 제2화면은 주차별 활동을 표시하는 화면으로, 주차별 활동은 요일별 학습 시간대 및 활동 횟수 를 나타내는 막대 차트를 포함한다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 각 과목별 출석률, 출석 수강 시간대, 결석 수강 시간대, 각 시간대별 확인되는 활동 등 학습 정보를 통해 학습자의 참여도 등 학습 패턴 정보를 식별할 수 있다. 시각화 모듈은 정보 분석 모듈이 분석한 학습 패턴 정보를 통해 요일별 학습 시간대 및 활동 횟수를 막대 차트로 나타낼 수 있다. 이때, 활동 횟수, 활동 주기 등은 이에 한정되지 않고, 이를 나타내는 방식 또한 막대 차트 이외에 다른 방식을 채용할 수 있다. 또한, 주차별 활동은 같은 과목을 수강한 다른 복수 의 학습자의 참여도를 함께 표시할 수 있다. 본 발명의 일 실시예에 따르면, 제1화면, 제2화면과 같이 학습자의 참여도를 다각적으로 표시할 수 있고, 이러한 학습 패턴 정보를 학습자의 강의별 수강 만족도, 학습자의 전공 만족도, 학습자 심리 안정도, 학 습자의 학교 생활 만족도 등 학습자의 학습 성취 정보를 식별하는데 이용할 수 있다. 도 6은 본 발명의 제3실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 6은 학습자의 중도 탈락에 관한 정보를 표시한 제3화면을 도시한다. 제3화면은 진도율을 표시하는 화면으로, 진도율은 카테고리별 진도율 차트를 포함한다. 본 발명의 일 실시예에 따른 진도율은 데이터 베이스 개론 과목에 관한 것으로, 과목에 관한 정보 이외에 학습자의 개인 정보를 추가로 표시할 수 있다. 본 발명의 일 실시예에 따르면, 정보 분석 모듈은 학습자가 제출한 과제, 각 과목별 출석률, 출석 수강 시 간대, 결석 수강 시간대 등 학습 정보를 통해 학습자의 학습 유형에 따른 참여도 등 학습 패턴 정보를 식별할 수 있다. 시각화 모듈은 정보 분석 모듈이 분석한 학습 패턴 정보를 통해 카테고리별 진도율 차트로 나타 낼 수 있다. 진도율 차트는 주별로 나타낼 수 있고, 이를 통합한 전체 진도율 차트를 나타낼 수 있다. 이때, 카테고리의 종류는 이에 한정되지 않는다. 도 4 내지 도 6에 도시된 바와 같이, 정보 분석 모듈은 학습자의 학습 패턴 정보와 학습 성취 정보를 학습 자가 수강하는 복수의 강의 별로 분석하여, 추후 학습자의 중도 탈락 확률을 식별하는 경우, 특정 과목의 중도 탈락에 대한 기여율을 파악할 수 있다. 도 7은 본 발명의 제4실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 7은 학습자의 중도 탈락에 관한 정보를 표시한 제4화면을 도시한다. 제4화면은 학습자의 개인 정보, 정보 분석 모듈이 식별한 학습자의 중도 탈락 확률에 관한 정보 를 총체적으로 도시한 도면이다. 학습자의 중도 탈락 확률에 관한 정보는 앞서 도 4 내지 도 6에서 식별된 정보, 정보 분석 모듈을 통 해 식별된 학습 패턴 정보, 학습 성취 정보에 기초하여 분석한 정보이다. 앞서, 도 3의 S40과 관련하여 서술한 바와 같이, 정보 분석 모듈은 학습 패턴 정보와 학습 성취 정보에 따 라 중도 탈락 여부를 연산하도록 학습된 제2모델에 기초하여 학습자의 중도 탈락 확률을 식별할 수 있다. 학습 자의 중도 탈락 확률에 관한 정보는 제2모델별 실제 상태와 예측 상태를 비교하여 학습자가 해당하는 영역 을 표시하거나, 제2모델별 중도 탈락 확률을 0에서 1사이의 숫자로 나타낼 수 있다. 이때, 정보 분석 모듈은 복수의 다른 학습자의 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률과 학습자의 학습 패턴 정보와 학습 성취 정보에 따른 중도 탈락 확률을 비교하여 종합적으로 중도 탈락에 대한 예 측 결과를 생성할 수 있다. 도 8은 본 발명의 제5실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 8은 복수의 학습자의 중도 탈락에 관한 정보를 표시한 제5화면을 도시한다. 제5화면은 예측 장치에서 분석된 복수의 학습자의 거주지 분포도, 성비, 학부 및 학과 비율, 중도 탈 락 비율, 중도 탈락이자 리스트 등을 종합적으로 도시한다. 제5화면에 도시되는 정보들은 정보 수집 모듈이 수집한 정보, 정보 분석 모듈이 분석한 정보를 모두 포함할 수 있다. 또한, 복수의 학교 시스템으로부터 수집한 정보들을 기초로 학습 패턴 정보, 학습 성취 정보 및 나아가 이들의 중도 탈락 확률을 식별하므로 보다 정교하게 학습자들의 중도 탈락 확률을 식별할 수 있을 것이다."}
{"patent_id": "10-2022-0029831", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 중도 탈락 예측 시스템을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 중도 탈락 예측 장치의 구성을 도시한 블럭도이다. 도 3은 본 발명의 일 실시예에 따른 중도 탈락 예측 장치의 동작 흐름도를 도시한 도면이다. 도 4는 본 발명의 제1실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 5는 본 발명의 제2실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 6은 본 발명의 제3실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 7은 본 발명의 제4실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다. 도 8은 본 발명의 제5실시예에 따른 중도 탈락 예측 장치의 동작 모습을 도시한 도면이다."}
