{"patent_id": "10-2021-0028242", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0124510", "출원번호": "10-2021-0028242", "발명의 명칭": "AI 비서 에뮬레이터를 이용한 다자 영상 회의 서비스를 제공하는 방법 및 그 장치", "출원인": "주식회사 케이티", "발명자": "최지수"}}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 동작하는 다자 영상 회의 플랫폼 장치의 동작 방법으로서,복수의 단말로 구성된 다자 영상 회의 그룹을 위한 다자 영상 회의 세션을 설립하는 단계, 상기 복수의 단말 중 제1 단말로부터 인공지능 비서 할당 요청을 수신하는 단계,상기 인공지능 비서에 해당하는 에뮬레이터를 실행시키는 단계,상기 에뮬레이터와 상기 다자 영상 회의 세션을 연결하는 단계, 상기 에뮬레이터를 통하여, 상기 제1 단말로부터 상기 인공지능 비서를 호출하여 특정 서비스를 요청하는 음성명령을 감지하는 단계, 그리고상기 음성 명령에 따른 특정 서비스 실행 결과를 상기 복수의 단말에게 공유하는 단계를 포함하는, 동작 방법."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 음성 명령을 감지하는 단계 이후,상기 인공지능 비서에 대한 제어권을 상기 제1 단말로 할당하고 락(Lock) 상태로 설정하는 단계, 그리고상기 제1 단말 이외의 단말들에서 상기 인공지능 비서를 호출하여 특정 서비스를 요청하는 음성 명령을 감지하면, 감지한 음성 명령을 차단하고 상기 제1 단말의 음성 명령을 우선 처리하도록 제어하는 단계 를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 공유하는 단계 이후,상기 인공지능 비서에 대한 제어권을 언락(Unlock) 상태로 설정하는 단계를 더 포함하고,상기 언락 상태는,상기 다자 영상 회의 그룹의 단말들에서 발생하는 음성 명령에 대한 실행을 허용하게 하는, 동작 방법."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,상기 공유하는 단계는,인공지능 서비스 서버에게, 상기 음성 명령으로부터 변환된 텍스트 명령과 상기 음성 명령이 생성된 제1 단말의정보를 포함하는 AI 서비스 요청을 전송하는 단계,상기 인공지능 서비스 서버로부터, 상기 텍스트 명령에 대응하는 특정 서비스 실행 결과를 수신하는 단계, 그리고상기 특정 서비스 실행 결과를 나타내는 다자 영상 회의 화면을 상기 복수의 단말에게 공유하는 단계를 포함하는, 동작 방법.공개특허 10-2022-0124510-3-청구항 5 제1항에서,상기 공유하는 단계 이후, 상기 제1 단말 또는 상기 복수의 단말로부터 인공지능 비서 해제 요청을 수신하는 단계, 그리고상기 에뮬레이터와 연결된 상기 다자간 영상 회의 세션을 해제시키고, 상기 에뮬레이터의 실행을 종료하는 단계를 더 포함하는, 동작 방법."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서,상기 감지하는 단계는,상기 에뮬레이터의 백그라운드 모니터링 기능을 통하여, 상기 다자간 영상 회의 세션에서 발생하는 음성 신호를수집하는 단계, 그리고수집한 음성 신호를 해석하여 상기 음성 명령을 감지하는 단계를 포함하는, 동작 방법."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "영상 회의 제어 프로그램 및 에뮬레이터 제어 프로그램을 저장하는 메모리, 그리고상기 프로그램들을 실행하는 적어도 하나의 프로세서를 포함하고,상기 프로세서는,다자 영상 회의 그룹을 구성하는 복수의 단말과 다자 영상 회의 세션을 설립하고, 상기 복수의 단말 중에서 제1 단말로부터 인공지능 비서 할당 요청을 수신하면, 상기 인공지능 비서에 대응하는에뮬레이터를 상기 다자 영상 회의 그룹에 할당하고, 상기 에뮬레이터를 실행하여 상기 에뮬레이터를 상기 다자 영상 회의 세션에연결시키고 상기 다자 영상 회의 그룹에서 인공지능 비서의 호출 음성이 발생하는지 감지하여, 상기 호출 음성에 따른 특정 서비스 실행 결과를 상기 복수의 단말에게 공유하는, 컴퓨팅 장치."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에서,상기 프로세서는,상기 호출 음성을 발생시킨 제1 단말에게 상기 인공지능 비서 제어권을 할당하고 상기 제어권을 락(Lock) 상태로 설정하며,상기 제어권이 락 상태로 설정된 경우에 상기 제1 단말을 제외한 나머지 단말들의 인공지능 비서 호출을 차단하는, 컴퓨팅 장치."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에서,상기 프로세서는,상기 제1 단말의 호출 음성에 따른 특정 서비스 실행이 완료되면, 상기 제어권을 언락(Unlock) 상태로전환하고,상기 제어권이 언락 상태로 설정된 경우에 상기 복수의 단말의 인공지능 비서 호출을 허용하는, 컴퓨팅 장치.공개특허 10-2022-0124510-4-청구항 10 제7항에서,인공지능 서비스 서버와 데이터를 송수신하는 통신 인터페이스를 더 포함하고,상기 프로세서는,상기 제1 단말의 식별 정보 및 상기 호출 음성으로부터 해석된 명령 내용을 포함하는 인공지능 서비스 요청을상기 인공지능 서비스 서버로 전송하고, 상기 인공지능 서비스 서버로부터 상기 특정 서비스 실행 결과를 수신하며,상기 특정 서비스 실행 결과를 포함하는 화면을 상기 복수의 단말에게 공유시키는, 컴퓨팅 장치."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에서,상기 프로세서는,상기 에뮬레이터가 상기 다자간 영상 회의 세션에서 발생하는 음성 신호를 백그라운드 방식으로 모니터링하고, 상기 모니터링 결과를 토대로, 상기 인공지능 비서 호출 여부를 감지하며, 상기 인공지능 비서 호출이감지되면, 호출된 음성을 해석하고, 상기 해석에 따른 특정 서비스 동작을 실행하는 명령어들을 포함하는, 컴퓨팅 장치."}
{"patent_id": "10-2021-0028242", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에서,상기 프로세서는,상기 복수의 단말 중 하나의 단말로부터 인공지능 비서 해제 요청을 수신하면, 상기 에뮬레이터의 실행을 종료하고 상기 에뮬레이터와 상기 다자 영상 회의 세션 간의 연결을 해제하는, 컴퓨팅 장치."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "AI 비서 에뮬레이터를 이용한 다자 영상 회의 서비스를 제공하는 방법 및 그 장치가 제공된다. 이 방법은 적어도 하나의 프로세서에 의해 동작하는 다자 영상 회의 플랫폼 장치의 동작 방법으로서, 복수의 단말로 구성된 다자 영상 회의 그룹를 위한 다자 영상 회의 세션을 설립하는 단계, 상기 복수의 단말 중 제1 단말로부터 인공지능 비 서 할당 요청을 수신하는 단계, 상기 인공지능 비서에 해당하는 에뮬레이터를 실행시키는 단계, 상기 에뮬레이터 와 상기 다자 영상 회의 세션을 연결하는 단계, 상기 에뮬레이터를 통하여, 상기 제1 단말로부터 상기 인공지능 비서를 호출하여 특정 서비스를 요청하는 음성 명령을 감지하는 단계, 그리고 상기 음성 명령에 따른 특정 서비 스 실행 결과를 상기 복수의 단말에게 공유하는 단계를 포함한다."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AI 비서 에뮬레이터를 이용한 다자 영상 회의 서비스를 제공하는 방법 및 그 장치에 관한 것으로서, AI 비서 에뮬레이터가 참여한 다자 영상 회의 서비스를 제공하는 기술에 관한 것이다."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 세계적인 Covid-19 사태로 재택 근무 시행에 따른 화상 회의, 웨비나(Web+Seminar) 교육 플랫폼을 통한 비 대면 화상 교육, 비대면 세일즈를 위한 카드사의 화상 영업 및 마케팅, 온라인 스트리머/공연용 화상 솔루션 등 과 같이 고객 요구 사항들이 보다 다양해지고, 이를 해결 가능한 영상 협업 솔루션이 각광받고 있는 추세이다. 그러나 현재 영상 협업 솔루션의 문제들은, 참여자를 구분하지도 않고, 단순히 음성/텍스트 입력에 대한 1차원 적인 응답만 제공하고 있어, 다자간 영상 회의에 맞는 서비스를 제공하기에는 한계가 존재한다."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "해결하고자 하는 과제는 다자간 영상 회의에 에뮬레이터로 구현된 AI 비서가 회의 구성원으로 참여하여 다른 참 여자들의 음성 요구를 해석하고 해석 결과에 따른 응답을 제공하는 다자 영상 회의 서비스 방법 및 그 장치를 제공하는 것이다."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 특징에 따르면, 적어도 하나의 프로세서에 의해 동작하는 다자 영상 회의 플랫폼 장치의 동작 방법으로서, 복수의 단말로 구성된 다자 영상 회의 그룹을 위한 다자 영상 회의 세션을 설립하는 단계, 상기 복수의 단말 중 제1 단말로부터 인공지능 비서 할당 요청을 수신하는 단계, 상기 인공지능 비서에 해당하는 에뮬레이터를 실행 시키는 단계, 상기 에뮬레이터와 상기 다자 영상 회의 세션을 연결하는 단계, 상기 에뮬레이터를 통하여, 상기 제1 단말로부터 상기 인공지능 비서를 호출하여 특정 서비스를 요청하는 음성 명령을 감지하는 단계, 그리고 상 기 음성 명령에 따른 특정 서비스 실행 결과를 상기 복수의 단말에게 공유하는 단계를 포함한다. 상기 음성 명령을 감지하는 단계 이후, 상기 인공지능 비서에 대한 제어권을 상기 제1 단말로 할당하고 락 (Lock) 상태로 설정하는 단계, 그리고 상기 제1 단말 이외의 단말들에서 상기 인공지능 비서를 호출하여 특정 서비스를 요청하는 음성 명령을 감지하면, 감지한 음성 명령을 차단하고 상기 제1 단말의 음성 명령을 우선 처 리하도록 제어하는 단계를 더 포함할 수 있다. 상기 공유하는 단계 이후, 상기 인공지능 비서에 대한 제어권을 언락(Unlock) 상태로 설정하는 단계를 더 포함 하고, 상기 언락 상태는, 상기 다자 영상 회의 그룹의 단말들에서 발생하는 음성 명령에 대한 실행을 허용하게 할 수 있다. 상기 공유하는 단계는, 인공지능 서비스 서버에게, 상기 음성 명령으로부터 변환된 텍스트 명령과 상기 음성 명 령이 생성된 제1 단말의 정보를 포함하는 AI 서비스 요청을 전송하는 단계, 상기 인공지능 서비스 서버로부터, 상기 텍스트 명령에 대응하는 특정 서비스 실행 결과를 수신하는 단계, 그리고 상기 특정 서비스 실행 결과를 나타내는 다자 영상 회의 화면을 상기 복수의 단말에게 공유하는 단계를 포함할 수 있다. 상기 공유하는 단계 이후, 상기 제1 단말 또는 상기 복수의 단말로부터 인공지능 비서 해제 요청을 수신하는 단 계, 그리고 상기 에뮬레이터와 연결된 상기 다자간 영상 회의 세션을 해제시키고, 상기 에뮬레이터의 실행을 종 료하는 단계를 더 포함할 수 있다. 상기 감지하는 단계는, 상기 에뮬레이터의 백그라운드 모니터링 기능을 통하여, 상기 다자간 영상 회의 세션에 서 발생하는 음성 신호를 수집하는 단계, 그리고 수집한 음성 신호를 해석하여 상기 음성 명령을 감지하는 단계 를 포함할 수 있다. 다른 특징에 따르면, 컴퓨팅 장치는 영상 회의 제어 프로그램 및 에뮬레이터 제어 프로그램을 저장하는 메모리, 그리고 상기 프로그램들을 실행하는 적어도 하나의 프로세서를 포함하고, 상기 프로세서는, 다자 영상 회의 그 룹을 구성하는 복수의 단말과 다자 영상 회의 세션을 설립하고, 상기 복수의 단말 중에서 제1 단말로부터 인공 지능 비서 할당 요청을 수신하면, 상기 인공지능 비서에 대응하는 에뮬레이터를 상기 다자 영상 회의 그룹에 할 당하고, 상기 에뮬레이터를 실행하여 상기 에뮬레이터를 상기 다자 영상 회의 세션에연결시키고 상기 다자 영상 회의 그룹에서 인공지능 비서의 호출 음성이 발생하는지 감지하여, 상기 호출 음성에 따른 특정 서비스 실행 결 과를 상기 복수의 단말에게 공유한다. 상기 프로세서는, 상기 호출 음성을 발생시킨 제1 단말에게 상기 인공지능 비서 제어권을 할당하고 상기 제어권 을 락(Lock) 상태로 설정하며, 상기 제어권이 락 상태로 설정된 경우에 상기 제1 단말을 제외한 나머지 단말들 의 인공지능 비서 호출을 차단할 수 있다. 상기 프로세서는, 상기 제1 단말의 호출 음성에 따른 특정 서비스 실행이 완료되면, 상기 제어권을 언락 (Unlock) 상태로 전환하고, 상기 제어권이 언락 상태로 설정된 경우에 상기 복수의 단말의 인공지능 비서 호출 을 허용할 수 있다. 상기 컴퓨팅 장치는, 인공지능 서비스 서버와 데이터를 송수신하는 통신 인터페이스를 더 포함하고, 상기 프로 세서는, 상기 제1 단말의 식별 정보 및 상기 호출 음성으로부터 해석된 명령 내용을 포함하는 인공지능 서비스 요청을 상기 인공지능 서비스 서버로 전송하고, 상기 인공지능 서비스 서버로부터 상기 특정 서비스 실행 결과 를 수신하며, 상기 특정 서비스 실행 결과를 포함하는 화면을 상기 복수의 단말에게 공유시킬 수 있다. 상기 프로세서는, 상기 에뮬레이터가 상기 다자간 영상 회의 세션에서 발생하는 음성 신호를 백그라운드 방식으 로 모니터링하고, 상기 모니터링 결과를 토대로, 상기 인공지능 비서 호출 여부를 감지하며, 상기 인공지능 비 서 호출이 감지되면, 호출된 음성을 해석하고, 상기 해석에 따른 특정 서비스 동작을 실행하는 명령어들을 포함 할 수 있다. 상기 프로세서는, 상기 복수의 단말 중 하나의 단말로부터 인공지능 비서 해제 요청을 수신하면, 상기 에뮬레이 터의 실행을 종료하고 상기 에뮬레이터와 상기 다자 영상 회의 세션 간의 연결을 해제할 수 있다."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따르면, 다자 영상 회의 그룹 마다 AI 비서 에뮬레이터를 참여자로 참가시키고, AI 비서 에뮬레이터로 하여금 참여자들이 필요로 하는 정보 및 또는 기능을 음성 인식하고 그 결과를 다자 영상 회의 화면에 공유시킴 으로써, 다자 영상 회의 업무의 효율성을 극대화할 수 있다."}
{"patent_id": "10-2021-0028242", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였 다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재된 \"…부\", \"…기\", \"…모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 본 발명에서 설명하는 장치들은 적어도 하나의 프로세서, 메모리 장치, 통신 장치 등을 포함하는 하드웨어로 구 성되고, 지정된 장소에 하드웨어와 결합되어 실행되는 프로그램이 저장된다. 하드웨어는 본 발명의 방법을 실행 할 수 있는 구성과 성능을 가진다. 프로그램은 도면들을 참고로 설명한 본 발명의 동작 방법을 구현한 명령어 (instructions)를 포함하고, 프로세서와 메모리 장치 등의 하드웨어와 결합하여 본 발명을 실행한다. 본 명세서에서 \"전송 또는 제공\"은 직접적인 전송 또는 제공하는 것 뿐만 아니라 다른 장치를 통해 또는 우회 경로를 이용하여 간접적으로 전송 또는 제공도 포함할 수 있다. 본 명세서에서 단수로 기재된 표현은 \"하나\" 또는 \"단일\" 등의 명시적인 표현을 사용하지 않은 이상, 단수 또는 복수로 해석될 수 있다. 본 명세서에서 도면에 관계없이 동일한 도면번호는 동일한 구성요소를 지칭하며, \"및/또는\" 은 언급된 구성 요 소들의 각각 및 하나 이상의 모든 조합을 포함한다. 본 명세서에서, 제1, 제2 등과 같이 서수를 포함하는 용어들은 다양한 구성요소들을 설명하는데 사용될 수 있지 만, 상기 구성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요 소로부터 구별하는 목적으로만 사용된다. 예를들어, 본 개시의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 본 명세서에서 도면을 참고하여 설명한 흐름도에서, 동작 순서는 변경될 수 있고, 여러 동작들이 병합되거나, 어느 동작이 분할될 수 있고, 특정 동작은 수행되지 않을 수 있다. 도 1은 실시예에 따른 AI(Artificial Intelligence) 비서 에뮬레이터를 이용한 다자 영상 회의 서비스 시스템의 구성도이다. 도 1을 참조하면, 다자 영상 회의 서비스 시스템은 AI 비서 에뮬레이터가 참여자로 참가하는 다자 영상 회의 서 비스를 제공하기 위한 명령 제어와 관계된 구성만을 간략히 도시하였다. 따라서, 일반적인 다자 영상 회의에 필요한 구성들은 생략되었지만, 본 발명의 실시예 범주에 포함되는 것임은 자명하다. 더불어, 도 1에 도시한 구성으로 본 발명의 실시예가 제한되는 것은 아니다. 다자 영상 회의 서비스 시스템은 다자 영상 회의 플랫폼, 그리고 AI 서비스 서버를 포함하고, 다자 영상 회의 플랫폼 및 AI 서비스 서버는 네트워크를 통해 복수의 영상 회의 그룹 단말과 연 결된다. 다자 영상 회의 플랫폼 및 AI 서비스 서버는 별개의 독립된 서버 장치로 구현될 수 있다. 복수의 영 상 회의 그룹 단말은 복수의 이종 단말로서 단말 기종, OS(Operating system) 등이 다른 단말이다. 예를들 어, 복수의 영상 회의 그룹 단말은 기가지니 보이스 커맨드 디바이스, 기가지니 테이블 TV, 모바일 단말, 노트북 등을 포함할 수 있다. 복수의 영상 회의 그룹 단말이 접속하는 화면은 각 단말의 기종에 맞게 다자 영상 회의 플랫폼 에 의해 구성되어 제공될 수 있다. 다자 영상 회의 그룹은 복수개 형성될 수 있으며, 각 다자 영상 회의 그룹은 복수의 참여자로 구성된다. 이때, 복수의 참여자는 사용자들과 AI 비서를 포함한다. AI 비서는 에뮬레이터로 구현되나 일반 사용자와 같은 참여자처럼 다자 영상 회의 그룹에 참가한다. 에뮬레이터는 AI 비서 기능을 구현하는 프로그램이다. 다자 영상 회의 플랫폼은 영상 회의 제어 장치 및 AI 비서 제어 장치를 포함한다. 영상 회의 제 어 장치 및 AI 비서 제어 장치는 물리적인 하나의 장치 내에 구현될 수도 있고, 독립된 별개의 서버 장치로 구현될 수도 있다. 영상 회의 제어 장치는 하나의 다자 영상 회의 그룹에 소속된 복수의 영상 회의 그룹 단말 및 AI 비 서 제어 장치 간의 다자간 영상 회의 세션을 제어한다. AI 비서 제어 장치는 영상 회의 제어 장치에서 개설되는 영상 회의 그룹 별로 AI 비서를 할당하고, AI 비서를 에뮬레이션하며, AI 비서에 대한 제어권한을 관리한다. AI 비서 제어 장치는 각 다자 영상 회의 그룹 별로 에뮬레이터 형태의 AI 비서를 구현한다. AI 비서 제어 장치는 AI 비서에 대한 다자 영상 회의 참여자 권한 관리, AI 비서 기능 해제에 따른 에뮬레이터 세션 해 제 등을 수행한다. AI 비서 제어 장치는 AI 비서 기능을 구현하는 에뮬레이터를 실제 통화 참여자와 같이 영상 회의 제어 장 치와 연동하여, 다자간 영상 회의 세션에 참여시킨다. AI 비서 제어 장치는 다자간 영상 회의 세션이 설정된 상태에서, 다자간 영상 회의 세션 참여자인 영상 회 의 그룹 단말에 의해 AI 비서 할당이 요청되면, 에뮬레이터를 할당하고 할당한 에뮬레이터로부터 제공받은 정보를 토대로 에뮬레이터를 다자간 영상 회의 세션에 연결할 수 있다. AI 비서 제어 장치는 다자간 영상 회의 세션 참여자인 영상 회의 그룹 단말에 의해 AI 비서 해제가 요청되면, 에뮬레이터와 영상 회의 제어 장치 간의다자간 영상 회의 세션 연결을 해제하고 에뮬레이터 실 행을 종료한다. AI 비서 제어 장치는 AI 비서 에뮬레이터 별로 각 AI 비서 에뮬레이터가 소속된 영상 회의 그룹에서 발생 하는 영상 회의음성 데이터를 수집하고, 영상 회의수집한 음성 데이터를 텍스트 변환하며, 변환된 텍스트를 해 석하여 AI 비서 호출 여부를 판단한다. AI 비서 제어 장치는 AI 서비스 서버와 연동하여 영상 회의 그룹에서 호출된 기능을 수행한다. AI 비서 제어 장치는 AI 비서 기능에 대한 영상 회의 참여자 권한 관리를 수행한다. AI 비서 제어 장치 는 AI 비서 기능이 호출된 경우, 다른 참여자의 호출을 차단하고 AI 비서 기능이 처리된 이후, 다른 참여 자의 호출을 허용한다. 이와 같이, 영상 회의 그룹에 소속된 참여자들은 영상 회의 그룹 마다 AI 비서를 할당하도록 요청할 수 있다. 할당된 AI 비서는 영상 회의 그룹 내 에뮬레이터를 통해서 영상 회의 그룹에 직접 참여하면서 참여자들이 필요로 하는 정보 및/또는 기능을 다자 영상 회의 화면에 디스플레이할 수 있다. AI 비서는 참여자 별로 요청사항을 구별하여 응답하고, 응답에 따른 영상, 음성, 텍스트 등을 참여자들에게 모두 공유한다. 따라서, 참여자들은 다 자 영상 회의에서 쇼핑, 결제, 정보확인, 검색공유 등 다양한 생산적인 활동이 가능하다. 또한, 참여자들간에 AI 비서 기능을 제어권을 가지고 조작하면서 업무 효율성을 극대화할 수 있다. AI 비서 에뮬레이터가 참여자로 참가하는 다자 영상 회의 서비스를 제공하는 과정은 다음과 같다. 도 2는 한 실시예에 따른 다자 영상 회의 서비스 방법을 나타낸 흐름도로서, 다자 영상 회의 세션에 AI 비서가 참가하는 과정을 설명한다. 도 2를 참조하면, 영상 회의 그룹 단말이 영상 회의 제어 장치와 영상 회의 세션이 설립된다(S101). S101은 영상 회의 그룹에 소속된 모든 영상 회의 그룹 단말에 대하여 이루어진다. 영상 회의 그룹 내 임의의 영상 회의 그룹 단말은 영상 회의 제어 장치에게 AI 비서 참여 요청을 전 달한다(S103). AI 비서 참여 요청은 영상 회의 그룹 정보를 포함한다. 영상 회의 제어 장치는 AI 비서 제어 장치에게 S103에서 수신한 영상 회의 그룹 정보를 전달하면서, 에뮬레이터 할당 요청을 전송한다(S105). AI 비서 제어 장치는 영상 회의 그룹에 AI 비서 역할을 수행할 에뮬레이터를 할당한다(S107). AI 비서 제어 장치는 AI 서비스 서버에게 AI 서비스 세션 연동을 요청한다(S109). AI 서비스 서버는 AI 서비스 제공 환경을 세팅한다(S111). AI 서비스 서버는 AI 비서 에뮬레이터 별 로 요청받는 요구 사항에 대한 서비스를 제공해야한다. 이에 AI 서비스 세션이 형성된 AI 비서 에뮬레이터에게 서비스를 제공하기 위한 환경을 세팅한다. AI 서비스 서버는 AI 비서 제어 장치에게 세팅 완료 정보를 포함하는 AI 서비스 세션 연동 응답을 전 달한다(S113). AI 비서 제어 장치와 AI 서비스 서버 간에 AI 서비스 세션을 연결한다(S115). AI 비서 제어 장치는 S115에서 AI 서비스 세션 연결이 완료되면, 영상 회의 제어 장치에게 AI 비서 참여 요청을 전달한다(S117). S117은 AI 비서 제어 장치가 AI 비서의 환경 세팅이 완료되어 AI 비서를 다 자 영상 회의에 참여시켜도 된다는 \"AI 비서 참여 요청\"을 영상 회의 제어 장치에 전송한다. 영상 회의 제어 장치는 AI 비서 참여를 허가하는 AI 비서 참여 응답을 전송한다(S119). 즉, 영상 회의 제 어 장치는 AI 비서 참여 허가 메시지를 AI 비서 제어 장치에 전송하여 AI 비서가 구현된 에뮬레이터 를 다자 영상 회의에 참여시킨다. 영상 회의 제어 장치는 영상 회의 그룹 단말의 영상 회의 세션에 AI 비서 에뮬레이터를 참여시킨다 (S121). 이때, 영상 회의 그룹에 새로운 구성원을 참여시키는 일련의 과정은 공지된 다자간 영상 회의 서비스 기술을 사용할 수 있다. 도 3은 다른 실시예에 따른 다자 영상 회의 서비스 방법을 나타낸 흐름도로서, AI 비서를 해제하는 과정을 설명 한다. 도 3을 참조하면, 영상 회의 그룹 단말은 영상 회의 제어 장치에게 영상 회의 그룹 정보가 포함된 AI 비서 해제 요청을 전달한다(S201). 여기서, AI 비서 해제 요청은 AI 비서 할당을 요청한 영상 회의 그룹 단말 A일 수도 있고, 동일한 영상 회 의 그룹 내 다른 참가자 단말일 수도 있다. 영상 회의 제어 장치는 AI 비서 제어 장치에게 영상 회의 그룹 정보가 포함된 AI 비서 에뮬레이터 해 제 요청을 전송한다(S203). AI 비서 제어 장치는 AI 서비스 서버에게 AI 서비스 연동 해제 요청을 전송한다(S205). AI 서비스 서버는 AI 비서 에뮬레이터로부터 발생할 요청에 대한 서비스 제공 환경을 해제(S207)한 후, AI 비서 제어 장치에게 AI 서비스 연동 해제 응답을 전송한다(S209). 여기서, S207은 환경 해제는 AI 서비스서버-에뮬레이터 사이의 세션을 종료하고, 에뮬레이터에 대한 정보를 제거하는 일련의 과정으로서, 예컨대 AI 서비스 서버의 자원 관리 차원에서 현재 사용되지 않는 할당되었던 자원에 대해 회수하는 과정을 포함한다. AI 비서 제어 장치는 영상 회의 제어 장치에게 AI 비서 퇴장 요청을 전송한다(S211). 영상 회의 제어 장치는 AI 비서 제어 장치에게 AI 비서 퇴장을 허가하는 AI 퇴장 응답을 전송한다 (S213). AI 비서 제어 장치는 AI 비서 에뮬레이터를 종료(S215)하고, 이를 영상 회의 세션에 반영한다(S217). 즉, AI 비서 에뮬레이터와 연결된 다자 영상 회의 세션은 종료하고, 다자 영상 회의 세션은 AI 비서 에뮬레이터를 제외한 나머지 참가자들로 재구성된다. 이러한 재구성 과정은 공지된 다자간 영상 회의 기술에서 참조될 수 있 다. 도 4는 또 다른 실시예에 따른 다자 영상 회의 서비스 방법을 나타낸 흐름도로서, AI 비서 제어 장치가 AI 비서 호출을 감지하는 일련의 과정을 설명한다. 도 4를 참조하면, AI 비서 제어 장치와 AI 서비스 서버 간에 AI 서비스 세션이 연결되어 있다(S301). 또한, 영상 회의 제어 장치는 AI 비서 제어 장치, 영상 회의 그룹 단말 A, 영상 회의 그룹 단말 B과 다자 영상 회의를 위한 세션이 연결되어 있다(S303, S305, S307). 이때, 영상 회의 그룹 단말 A, 영상 회의 그룹 단말 B은 동일한 영상 회의 그룹에 속한 사용자 단말을 의미한다. 이처럼, 영상 회의 그룹 단말들(401, 403), 영상 회의 제어 장치, AI 비서 제어 장치 간에 AI 비서가 참여한 영상 회의 세션이 설립되고, AI 비서 제어 장치와 AI 서비스 서버 간에 AI 서비스 세션이 설 립된다. AI 비서 제어 장치는 영상 회의 그룹에서 발생하는 AI 비서 호출에 대한 백그라운드 모니터링을 수행한다. 즉, 영상 회의 그룹 단말 A, 영상 회의 그룹 단말 B은 각각 입력받은 음성을 영상 회의 제어 장치 를 거쳐 AI 비서 제어 장치로 전달한다(S309, S311, S313, S315). AI 비서 제어 장치는 S311, S315에서 수집한 음성을 해석하여 AI 비서 호출 여부를 판단한다(S317). S317 에서 음성은 STT(Speech-to-Text) 과정을 거쳐 텍스트로 변환되어 해석된다. 도 5는 또 다른 실시예에 따른 다자 영상 회의 서비스 방법을 나타낸 흐름도로서, 다자간 영상 회의 중에 AI 비 서 호출 서비스를 제공하는 일련의 과정을 설명한다. 도 5를 참조하면, 영상 회의 그룹 단말 A가 AI 비서를 호출하는 음성 명령을 생성(S401)한다. S401은 영상 회의 그룹 단말 A가 외부로부터 사용자가 AI 비서를 호출하는 음성을 입력받는 과정에 해당한다. 영상 회의 그룹 단말 A는 AI 비서 호출 음성 명령을 영상 회의 제어 장치로 전송한다(S403). 영상 회의 제어 장치는 S403에서 수신한 AI 비서 호출 음성 명령을 AI 비서 제어 장치로 전달한다 (S405). AI 비서 제어 장치는 S405에서 수신한 AI 비서 호출 음성 명령을 해석하고 이를 토대로 AI 비서 호출을 감 지한다(S407). AI 비서 제어 장치는 다자 영상 회의 세션에서 AI 비서 호출 음성 명령을 처음 전송한 영상 회의 그룹 단 말 A에게 AI 비서 제어권을 할당하고, AI 비서 제어권을 락(Lock) 상태로 설정한다(S409). 즉, AI 서비스 서버가 영상 회의 그룹 단말 A의 AI 비서 호출을 처리하는 중에는 영상 회의 그룹 단말 B가 AI 비서 호출을 요청하더라도 이를 처리하지 않도록 AI 비서 에뮬레이터에 대한 제어권을 영상 회의 그룹 단말 A에게 할당하고 락 처리한다(S409). AI 비서 제어권의 락 상태는 AI 비서 호출에 대한 결과가 영상 회의 그룹 내 단말들에게 공유된 후 언락 상태로 변경된다. AI 비서 제어 장치는 영상 회의 그룹 단말 A의 요구 사항을 전달하기 위한 AI 서비스 연결 요청을 AI 서비스 서버에게 전송한다(S411). S411은 도 4의 AI 서비스 세션에서 영상 회의 그룹 단말 A의 요구사항을 전달하고 응답받기 위한 채널을 형성하는 과정에 해당한다. AI 비서 제어 장치는 AI 서비스 서버로부터 AI 서비스 연결 수락 응답을 수신한다(S413). AI 비서 제어 장치는 AI 비서 음성 멘트를 생성하고, 이를 영상 회의 제어 장치를 통해 영상 회의 그 룹 단말 A에게 송출한다(S415).영상 회의 그룹 단말 A는 AI 비서에게 특정 서비스를 요청하는 음성 명령을 생성한다(S417). 예를들어, S417은 단말 A 사용자가 \"지니야\"와 같은 AI 비서를 호출하는 음성을 제공하 고 이에 대한 AI 비서의 응답 음성이 수신(S415)된 이후에, \"XXX 검색해줘\"와 같은 검색 서비스 요청 음성을 외 부에서 입력받는 과정에 해당한다. 영상 회의 그룹 단말 A는 S417에서 입력받은 서비스 요청 음성 명령을 영상 회의 제어 장치를 통하여 AI 비서 제어 장치에게 전달한다(S419). AI 비서 제어 장치는 S419에서 수신한 서비스 요청 음성 명령을 STT 변환한다(S421). AI 비서 제어 장치는 참여자 정보 및 명령 내용을 포함하는 AI 서비스 요청을 AI 서비스 서버에게 전 송한다(S423). 여기서, 참여자 정보는 영상 회의 그룹 단말 A를 식별할 수 있는 정보를 포함한다. 명령 내 용은 S421에서 변환된 서비스 요청 음성 명령의 텍스트를 포함한다. AI 서비스 서버는 요청된 AI 서비스가 가능한지, 즉, S423에서 수신한 명령 내용을 실행 가능한지 판단한 다(S425). AI 서비스 서버는 S425에서 AI 서비스 불가로 판단되면, AI 서비스 제공 불가를 나타내는 AI 서비스 응답 을 AI 비서 제어 장치에게 리턴한다(S427). 그러면, AI 비서 제어 장치는 AI 서비스 제공 불가를 안 내하는 AI 비서 음성 멘트를 영상 회의 제어 장치를 통하여 영상 회의 그룹 단말 A에게 전송한다 (S429). 반면, S425에서 AI 서비스 가능으로 판단되면, AI 서비스 제공 가능을 나타내는 AI 서비스 응답을 AI 비서 제어 장치에게 리턴한다(S431). AI 비서 제어 장치는 AI 서비스 서버에게 AI 서비스 실행을 요청한다(S433). 그러면, AI 서비스 서버 는 요청된 AI 서비스를 실행한 후, 그 결과를 리턴한다(S435). AI 비서 제어 장치는 S435에서 리턴받은 AI 서비스 실행 결과 화면을 영상 회의 그룹내 모든 단말들(401, 403)에게 공유한다(S437, S439). S437, S439의 화면 공유는 영상 회의 제어 장치를 통해 이루어진다. AI 비서 제어 장치는 AI 서비스 실행이 완료되면, 영상 회의 그룹 단말 A에게 할당한 AI 비서 제어권 을 락 상태에서 언락(Unlock) 상태로 전환한다(S441). 도 6은 또 다른 실시예에 따른 영상 회의 서비스 방법을 나타낸 흐름도로서, 도 5에서 영상 회의 그룹 단말 A에 의해 AI 비서 제어권이 할당된 상태에서 영상 회의 그룹 단말 B로부터 AI 비서 호출이 이루어진 경우 AI 비서 제어권을 제어하는 과정에 대해 설명한다. 도 6을 참조하면, 영상 회의 그룹 단말 B는 AI 비서를 호출하는 음성 명령을 생성(S501)한다. 즉, 영상 회 의 그룹 단말 B는 외부에서 사용자의 AI 비서 호출 음성을 입력받는다. 영상 회의 그룹 단말 B는 영상 회의 제어 장치에게 AI 비서 호출 음성 명령을 전달한다(S503). 영상 회의 제어 장치는 S503에서 수신한 AI 비서 호출 음성 명령을 AI 비서 제어 장치로 전달한다 (S505). AI 비서 제어 장치는 영상 회의 그룹 참여자의 AI 비서 호출 음성을 감지(S507)한다. AI 비서 제 어 장치는 AI 비서 제어 권한이 영상 회의 그룹 단말 A에게 할당되어 락 상태임을 확인(S509)한다. 따라서, AI 비서 제어 장치는 영상 회의 그룹 단말 B에게 다른 참여자가 이용중이므로 대기하라는 AI 비서 제공 불가 안내 음성을 송출한다(S511). 도 1 ~ 도 6에서, AI 비서는 일반 참가자와 마찬가지로 다자 영상 회의 세션에 참가하므로, AI 비서 제어 장치 가 실행하는 AI 비서의 서비스 결과는 영상 회의 그룹내 모든 참여자 단말들에 공유된다. 예를들어, 동일한 영상 회의 그룹에 소속된 참여자 A가 요청한 상품 화면, 참여자 B가 요청한 결제 화면은 참여자 A와 참 여자 B 뿐만 아니라 영상 회의 그룹 내 모든 참여자들에게 화면 공유된다. 또한, 도 1 ~ 도 6에서 AI 비서 제어 장치가 송출하는 AI 비서 음성 멘트 역시 영상 회의 그룹내 모든 참 여자 단말들에 공유된다. 한편, 전술한 AI 비서가 참여하는 다자 영상 회의 서비스는 다양한 시나리오로 구현될 수 있다. 한 실시예에 따르면, AI 비서가 참여하는 다자 영상 회의 서비스는 교육/세미나 시나리오에서 학생이 궁금증을 질문하고 선생님이 관련 영상을 공유하는 서비스로 구현될 수 있다. 이러한 서비스는 표 1과 같은 단계로 구현 될 수 있다. 표 1 단계 참가자 설명 1 학생 AAI 비서 호출 (ㅇㅇ야) 2 AI 비서 호출 응답 (네 A님) 3 학생 A음성 명령(조선 건국이 언제지?) 4 AI 비서 응답 및 결과 공유 (네 실행하겠습니다. 1392년입니다.) 5 교사 음성 멘트: 맞아요 여러분 이야기 나온 김에 참고영상도 볼까요? 6 교사 AI 비서 호출 (ㅇㅇ야) 7 AI 비서 호출 응답 (네 B님) 8 교사 AI 비서 요청 (조선 건국 관련 영상 좀 검색해줘) 9 AI 비서 응답 및 결과 공유 (네 실행하겠습니다.) 10 교사 검색된 결과 기반, 조작을 통해 영상 실행 이와 같이, 온라인 수업 중에 온라인 수업 참가자들은 AI 비서를 호출하여 다양한 기능을 호출하고 이를 다른 수업 참가자들과 공유할 수 있다. 또한, AI 비서는 호출자가 학생 A인지 교사인지를 구분하여 응답한다. AI 비서가 참여하는 다자 영상 회의 서비스는 교육/세미나 시나리오 이외에도 팀원이 업무 관련 뉴스를 공유하 고, 팀장은 뉴스에 따른 주식 변동을 즉각 확인하는 기업 업무 시나리오, 자녀가 어머니와 같이 쇼핑/구매하고 어머니가 결제하는 가정/친척 시나리오, 조직원이 날씨를 검색하고 리더가 모임을 가질 맛집을 정하는 모임/동 아리 시나리오 등으로 구현될 수 있으며, 이외에도 다양한 시나리오로 구현될 수 있다. 도 7은 실시예에 따른 컴퓨팅 장치의 하드웨어 구성도이다. 도 7을 참고하면, 도 1 ~ 도 6에서 설명한 영상 회의 제어 장치, AI 비서 제어 장치, AI 서비스 서버 중 적어도 하나는 컴퓨팅 장치로 구현될 수 있고, 본 개시의 동작을 실행하도록 기술된 명령들 (instructions)이 포함된 컴퓨터 프로그램을 실행할 수 있다. 컴퓨팅 장치의 하드웨어는 적어도 하나의 프로세서, 메모리, 스토리지, 통신 인터페이스 를 포함할 수 있고, 버스를 통해 연결될 수 있다. 컴퓨팅 장치는 컴퓨터 프로그램을 구동할 수 있는 운영 체제를 비롯한 각종 소프트웨어가 탑재될 수 있다. 프로세서는 컴퓨팅 장치의 동작을 제어하는 장치로서, 컴퓨터 프로그램에 포함된 명령들을 처리하는 다양한 형태의 프로세서일 수 있고, 예를 들면, CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 등 일 수 있다. 또한, 프로세서는 위에서 설 명한 방법을 실행하기 위한 프로그램에 대한 연산을 수행할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 동작을 실행하도록 기술 된 명령들이 프로세서에 의해 처리되도록 해당 컴퓨터 프로그램을 저장 장치로부터 로드할 수 있다. 메모리는 예를 들면, ROM(read only memory), RAM(random access memory) 등 일 수 있다. 저장 장치(65 0)는 본 개시의 동작을 실행하는데 요구되는 각종 데이터, 컴퓨터 프로그램 등을 저장할 수 있다. 컴퓨터 프로 그램은 영상 회의 제어 프로그램, AI 비서 제어 프로그램, AI 서비스 프로그램 중 적어도 하나를 포함할 수 있 다. 스토리지는 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 비휘발성 메모리로 구현될 수 있다. 통신 인터페이스는 통신 기능을 수행하며, 통신 규격은 다양한 타입이 적용될 수 있다. 이상에서 설명한 본 발명의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 발명의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2021-0028242", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 실시예에 따른 AI(Artificial Intelligence) 비서 에뮬레이터를 이용한 다자 영상 회의 서비스 시스템의 구성도이다. 도 2는 한 실시예에 따른 다자 영상 회의 서비스 방법을 나타낸 흐름도이다. 도 3은 다른 실시예에 따른 다자 영상 회의 서비스 방법을 나타낸 흐름도이다. 도 4는 또 다른 실시예에 따른 영상 회의 서비스 방법을 나타낸 흐름도이다. 도 5는 또 다른 실시예에 따른 영상 회의 서비스 방법을 나타낸 흐름도이다. 도 6은 또 다른 실시예에 따른 영상 회의 서비스 방법을 나타낸 흐름도이다. 도 7은 실시예에 따른 컴퓨팅 장치의 하드웨어 구성도이다."}
