{"patent_id": "10-2023-0081977", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0000297", "출원번호": "10-2023-0081977", "발명의 명칭": "SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템", "출원인": "주식회사 텐원더스", "발명자": "이정훈"}}
{"patent_id": "10-2023-0081977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템에 있어서,상기 커머스 시스템은,인플루언서의 SNS 채널, 상기 인플루언서를 통해 유입된 고객들의 정보 및 상기 고객들이 구매한 상품에 관한특징 정보를 집계 분석함에 따라 판매하고자 하는 상품별 SNS 노출에 따른 구매전환율을 산출하고,상기 산출된 상품별 SNS 노출에 따른 구매전환율에 기초하여, 판매하고자 하는 특정 상품과 상기 특정 상품에대한 SNS 광고를 수행한 인플루언서의 조합을 도출하는 것을 특징으로 하는,SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템."}
{"patent_id": "10-2023-0081977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 커머스 시스템은,SNS 서버로부터 수집되는 복수의 소셜 데이터와 다수의 인플루언서들에 관한 정보를 학습 데이터로 하여 머신러닝 기반의 학습 방법에 따라 학습된 인공지능 모델을 이용하여, 상기의 SNS 인플루언서 구독자 집계분석 알고리즘을 수행함에 따라 최적의 인플루언서-상품 조합을 도출하는 것을 특징으로 하는,SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템."}
{"patent_id": "10-2023-0081977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 커머스 시스템은,상기 SNS 인플루언서 구독자 집계분석 알고리즘을 통해, 특정 인플루언서의 SNS 채널에 게시된 콘텐츠들의유형, 특정 인플루언서의 SNS 채널에 게시된 콘텐츠들의 반응률, 특정 인플루언서의 SNS 채널을 구독한 구독자중 유효 구독자에 관한 정보, 특정 인플루언서의 SNS 채널을 통해 상품의 결제 페이지로 유입된 소비자들의 행동 분석 결과를 분석하여 특정 인플루언서의 SNS 채널을 통해 특정 상품을 광고했을 때의 구매 전환율을 도출하는 것을 특징으로 하는,SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템."}
{"patent_id": "10-2023-0081977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 커머스 시스템은,상기 SNS 인플루언서 구독자 집계분석 알고리즘을 통해, 인플루언서의 개인 채널 구독자 데이터를 집계하고, 구독자 데이터를 바탕으로 유효 팔로워와 비유효 팔로워를 분류하며, 인플루언서의 개인 채널에 대한 영향력을 분석하여 이를 기반으로 인플루언서의 영향력을 분석하는 것을 특징으로 하는,SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템."}
{"patent_id": "10-2023-0081977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 커머스 시스템은,공개특허 10-2025-0000297-3-인플루언서의 SNS 채널로부터 정보를 수집하되, 수집되는 정보는 성별, 국적, 지역, 연령 및 학력과 같은 SNS에공개된 기본정보, 좋아요 수, 댓글 수, 공유 수와 같은 인플루언서에 대한 충성도 정보, 특정 브랜드가 속한 제품군 및 유사 브랜드 콘텐츠에 대한 키워드 및 반응 정보, 인플루언서의 SNS 채널이 보유한 팔로워의 채널에 공개된 기본 정보 중 적어도 하나를 포함하는 것을 특징으로 하는,SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템이 제공된다. 상기 SNS 인플루언서 구독자 집 계분석 알고리즘을 활용한 커머스 시스템은 인플루언서의 SNS 채널, 상기 인플루언서를 통해 유입된 고객들의 정 보 및 상기 고객들이 구매한 상품에 관한 특징 정보를 집계 분석함에 따라 판매하고자 하는 상품별 SNS 노출에 따른 구매전환율을 산출하고, 상기 산출된 상품별 SNS 노출에 따른 구매전환율에 기초하여, 판매하고자 하는 특 정 상품과 상기 특정 상품에 대한 SNS 광고를 수행한 인플루언서의 조합을 도출하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템에 관한 것으로, 보다 구체적으로, SNS 인플루언서에 대한 정보와 해당 인플루언서를 구독한 구독자들에 관한 정보를 집게 분석 하고, 이러한 분석 결과를 기반으로 최적의 상품-인플루언서 조합을 도출함으로써, 인플루언서 마케팅의 효과를 극대화할 수 있는 SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템에 관한 것이다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인플루언서 마케팅은 인플루언서의 영향력을 활용하여 브랜드의 메시지를 콘텐츠로써 고객들에게 전달하는 것을 말한다. 과거의 마케팅은 주로 연예인들의 방송 속 이미지를 통해 일방적 메시지를 전달했다. 반면 소셜 미디어 의 등장과 함께 부상한 인플루언서 마케팅은 온라인에서의 적극적인 활동을 통해 타인들과 연결되어 있고, 이를 통해 영향을 끼치는 개인(indivisual)들을 통해 진정성(authenticity)과 소통형 메시지를 전달한다. 인플루언서 마케팅은 기업 입장에서는 다른 마케팅에 비해 저렴한 가격과 빠른 진행으로 시의성을 가진 마케팅 을 하는 것이 가능하다. 또한, 기존의 다른 미디어에 비해 높은 가성비와 가심비(가격 대비 만족도와 가치)를 가진다. 많은 브랜드가 빠르게 성장하고 있는 소셜 미디어 플랫폼 시장에서 비즈니스 목표를 달성하기 위한 효 과적인 방법과 광고 채널로서 인플루언서들을 찾는 사례는 계속 증가하고 있다. 종래의 인플루언서 마케팅의 경우 영향력 있는 인플루언서를 찾기 위해 단지 추종자의 수로 영향력을 평가하였 다. 따라서, 인플루언서의 활동에서 실제 조회수, 댓글 수, 긍정 댓글 수, 부정 댓글 수 등 해당 인플루언서의 활동 에 따른 영향력 평가가 이루어지지 않았고 부정적인 영향을 미치더라도 사전에 파악하지 못하여 광고가 부정적 인 효과를 일으키더라도 사전에 파악하지 못하였다. 또한 인플루언서 마케팅이 활성화됨에 프로그램을 사용하여 추종자를 비정상적인 방법으로 늘리거나, 자극적인 컨텐츠만 개시하여 추종자를 올리는 등의 문제가 발생하고 있어 단지 추종자 만으로 인플루언서의 영향력을 평 가하면 정확도가 떨어진다. 따라서, 인플루언서뿐 아니라 그의 추종자를 분석하여 비정상적인 인플루언서를 배제시키고 인플루언서의 실제 활동에 따른 인플루언서의 영향력을 좀더 정확하게 수치로 산출하는 기술이 필요하다 또한, 광고에서 광고주의 영향력 또한 큰 변수로 작용하기 때문에, 광고주의 영향력을 분석하고 인플루언서의 영향력과 결합하여 광고주에게 광고 캠페인에 적당한 인플루언서를 제공하고, 해당 인플루언서를 통해 어느 정 도의 파급력을 가지는지, 수치를 산출하여 제공할 수 있는 기술의 개발이 요구된다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 소셜 광고 중개 서비스를 제공하는 방법을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 SNS 인플루언서 구독자 집계분석 알고리즘을 활용한 커머스 시스템은 인플루언서의 SNS 채널, 상기 인플루언서를 통해 유입된 고객들의 정보 및 상기 고객들이 구매 한 상품에 관한 특징 정보를 집계 분석함에 따라 판매하고자 하는 상품별 SNS 노출에 따른 구매전환율을 산출하 고, 상기 산출된 상품별 SNS 노출에 따른 구매전환율에 기초하여, 판매하고자 하는 특정 상품과 상기 특정 상품 에 대한 SNS 광고를 수행한 인플루언서의 조합을 도출하는 것을 특징으로 한다. 다양한 실시예에서, 상기 커머스 시스템은, SNS 서버로부터 수집되는 복수의 소셜 데이터와 다수의 인플루언서 들에 관한 정보를 학습 데이터로 하여 머신러닝 기반의 학습 방법에 따라 학습된 인공지능 모델을 이용하여, 상 기의 SNS 인플루언서 구독자 집계분석 알고리즘을 수행함에 따라 최적의 인플루언서-상품 조합을 도출하는 것을 특징으로 한다. 다양한 실시예에서, 상기 커머스 시스템은, 상기 SNS 인플루언서 구독자 집계분석 알고리즘을 통해, 특정 인플 루언서의 SNS 채널에 게시된 콘텐츠들의 유형, 특정 인플루언서의 SNS 채널에 게시된 콘텐츠들의 반응률, 특정 인플루언서의 SNS 채널을 구독한 구독자 중 유효 구독자에 관한 정보, 특정 인플루언서의 SNS 채널을 통해 상품 의 결제 페이지로 유입된 소비자들의 행동 분석 결과를 분석하여 특정 인플루언서의 SNS 채널을 통해 특정 상품 을 광고했을 때의 구매 전환율을 도출하는 것을 특징으로 한다. 다양한 실시예에서, 상기 커머스 시스템은, 상기 SNS 인플루언서 구독자 집계분석 알고리즘을 통해, 인플루언서 의 개인 채널 구독자 데이터를 집계하고, 구독자 데이터를 바탕으로 유효 팔로워와 비유효 팔로워를 분류하며, 인플루언서의 개인 채널에 대한 영향력을 분석하여 이를 기반으로 인플루언서의 영향력을 분석하는 것을 특징으 로 한다. 다양한 실시예에서, 상기 커머스 시스템은, 인플루언서의 SNS 채널로부터 정보를 수집하되, 수집되는 정보는 성 별, 국적, 지역, 연령 및 학력과 같은 SNS에 공개된 기본정보, 좋아요 수, 댓글 수, 공유 수와 같은 인플루언서 에 대한 충성도 정보, 특정 브랜드가 속한 제품군 및 유사 브랜드 콘텐츠에 대한 키워드 및 반응 정보, 인플루 언서의 SNS 채널이 보유한 팔로워의 채널에 공개된 기본 정보 중 적어도 하나를 포함하는 것을 특징으로 한다. 상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따르면, 소셜 광고 중개 서비스를 제공하는 방법으로서, 서버가 복수의 인플루언서 각각에 대해, 게시물 평가 정보(구독자수, 팔로워수, 조회수, 댓글수, 추천수, 공감 수 등)에 기초한 인플루언서 본인 영향력 지수와 상기 인플루언서를 SNS 상에서 구독하는 구독자에 관한 구독자 영향력 지수가 가산된 인플루언서 영향력 지수를 산출하는 단계를 포함하며, 구독자 영향력 지수는 구독자 성향 점수, 구독자 영향력 점수, 및 구독자 충성도 점수를 포함하는 것을 특징으로 하는 소셜 광고 중개 서비스 제공 방법이 제공된다. 상기 방법은, 상기 서버가 복수의 광고주 각각에 대해, 광고주 상품의 쇼핑몰 점유율 및 광고주의 브랜드 이미 지 평가값을 이용하여 상기 광고주에 대한 광고주의 영향력 지수를 산출하는 단계를 더 포함하고, 이때, 상기 광고주 계정의 영향력 지수는 광고주 본인의 영향력 지수와 상기 광고주를 SNS 상에 구독하는 구독자 영향력지 수를 이용하여 산출하고, 상기 광고주의 브랜드 이미지 평가값은 일정기간동안의 광고주 관련기사와 게시글 총 수, 상기 기사 및 게시물의 평가정보(구독자수, 팔로워수, 조회수, 댓글수, 추천수, 공감수 등)를 이용하여 산 출될 수 있다. 상기 방법은, 상기 산출된 인플루언서의 영향력 지수와 상기 광고주의 영향력 지수 간의 비율값에 인플루언서의 광고 영향력 정도에 대응하는 가중치를 부여하여 상기 하나 이상의 인플루언서와 상기 광고주 매칭에 따른 광고 파급력 지수를 산출하는 단계; 및 상기 산출된 광고 파급력 지수에 대한 정보를 상기 광고주에게 제공하여, 상 기 광고주로부터 선택된 인플루언서와 소셜 포스트를 인플루언서의 소셜 네트워크 서비스 계정에 해당 소셜 포 스트를 업로드 하는 단계를 더 포함할 수 있다. 상기 인플루언서 영향력 지수를 수치화하여 산출하는 단계는, 추종자의 영향력 지수를 수치화하여 산출하는 단 계를 포함할 수 있다. 상기 인플루언서 영향력 지수를 수치화하여 산출하는 단계는, 부정 인플루언서를 찾아내는 단계를 포함할 수 있 다. 상기 인플루언서 영향력 지수를 수치화하여 산출하는 단계는, 유효하게 판단되는 인자를 포함 또는 배제할 수 있다. 상기 광고주의 영향력을 평가하는 단계는 유효하게 판단되는 인자를 포함 또는 배제할 수 있다. 상기 광고주의 영향력을 평가하는 단계는 광고주 계정의 영향력 지수를 산출하는 단계가 배제될 수 있다. 상기 광고주의 영향력을 평가하는 단계는 광고주 상품의 쇼핑몰 점유율을 산출하는 단계가 배제될 수 있다. 상기 산출된 광고 파급력 지수에 대한 정보를 상기 광고주에게 제공하는 단계는 광고주가 인플루언서를 선택하 는 단계를 포함할 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 광고주에게 인플루언서 마케팅을 제공함에 있어, 기존의 인플루언서 마케팅 방법보다 좀 더 정확한 정보로 광고주에게 인플루언서를 제공할 수 있다. 또한, 인플루언서의 영향력을 추종자 수만 이용해 수치화 하는 방법의 문제인 비정상적인 방법을 통한 부정 인 플루언서를 미리 배제할 수 있다. 또한, 인플루언서의 영향력에 추종자들의 영향력 또한 포함하여 추종자 수가 적어도 실제 강력한 영향력을 가진 인플루언서를 찾아 광고주에게 제공할 수 있다. 또한, 광고주의 브랜드 인지도와, 영향력, 제품의 시장 점유율 또한 인플루언서 마케팅에 큰 영향을 미치는 요 인으로써, 인플루언서의 영향력과 결합하여 해당 광고 캠페인이 어느 정도의 파급력을 가지는지 수치화 시켜 광 고주에게 최적의 인플루언서와 소셜 포스트를 제공할 수 있다. 따라서, 광고주가 인플루언서를 선택하고, 광고주에게 인플루언서를 제공해주는 일련의 과정에 좀 더 객관적이 고, 수치화된 정보를 제공할 수 있다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “모 듈”은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라 이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤 집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 본 명세서에서 설명되는 각 단계들은 컴퓨터에 의하여 수행되는 것으로 설명되나, 각 단계의 주체는 이에 제한 되는 것은 아니며, 실시 예에 따라 각 단계들의 적어도 일부가 서로 다른 장치에서 수행될 수도 있다. 인플루언서 마케팅은 인플루언서의 영향력을 활용하여 브랜드의 메시지를 콘텐츠로써 고객들에게 전달하는 것을 말한다. 과거의 마케팅은 주로 연예인들의 방송 속 이미지를 통해 일방적 메시지를 전달했다. 반면 소셜 미디어 의 등장과 함께 부상한 인플루언서 마케팅은 온라인에서의 적극적인 활동을 통해 타인들과 연결되어 있고, 이를 통해 영향을 끼치는 개인(indivisual)들을 통해 진정성(authenticity)과 소통형 메시지를 전달한다. 인플루언서 마케팅은 기업 입장에서는 다른 마케팅에 비해 저렴한 가격과 빠른 진행으로 시의성을 가진 마케팅 을 하는 것이 가능하다. 또한, 기존의 다른 미디어에 비해 높은 가성비와 가심비(가격 대비 만족도와 가치)를 가진다. 많은 브랜드가 빠르게 성장하고 있는 소셜 미디어 플랫폼 시장에서 비즈니스 목표를 달성하기 위한 효 과적인 방법과 광고 채널로서 인플루언서들을 찾는 사례는 계속 증가하고 있다. 인플루언서(Influencer)란 ‘영향력 있는 사람’이란 뜻으로, 인스타그램, 유튜브 등 SNS에서 수십만 명의 구독 자(팔로워)를 보유한 ‘SNS 유명인’을 말한다(출처: 한경 경제용어사전). 충성도 높은 팔로워들을 보유한 그들 은 본인의 플랫폼 속에서 본인이 만든 경쟁력 있는 콘텐츠를 직접 유통하며 막강한 영향력을 행사하고 있다. 이 들은 콘텐츠 제작부터 유통까지 모든 과정을 총괄하며, 그 과정에 정보, 재미, 감동, 공감 등의 친밀한 감정을 팔로워들과 공유하고 친밀하게 소통한다. 과거 연예인들이 가까이할 수 없는 신비로운 존재였다면, 인플루언서 는 일상적인 삶을 친근하게 나눠, 강한 감정적 유대 관계를 형성할 수 있어 이제는 연예인보다 더 큰 영향력을 끼치는 존재가 되었다. 마케팅적으로 인플루언서의 의미를 조금 더 정리해보자면, ‘디지털에서 잘 소비되는 콘텐츠 제작자이자 충성도 높은 팔로워를 보유한 유명인이며, 이들이 보유한 플랫폼(채널)을 통해 자신의 메시지를 직접 유통하는’ 이들 을 말한다. 일반 대중에게 영향력 있는 인플루언서의 한마디가 상품의 닉네임이 되어 바이럴이 되고, 그들의 콘셉트가 브랜 드가 되어간다. 그렇기 때문에 기업이 말하고자 하는 스토리를 전달하는 커뮤니케이터 역할을 인플루언서에게 맡기는 경우가 많다. 대중은 이제 기업이나 다소 거리감이 느껴지는 전통적인 미디어 스타보다 편안하게 느껴지 는 인플루언서의 이야기를 더 신뢰한다. 그들이 콘텐츠 형태로 이야기를 시작할 때, 사람들은 좀 더 편하게 이 야기를 경청한다. 그런 이유로 기업은 자사의 이야기를 브랜디드 콘텐츠로 소비자와 기업의 소통을 돕는 조력자 역할을 인플루언서에게 맡길 것이다.인플루언서 마케팅 장점은 광고 차단 기술의 영향을 받지 않는 것이다. 플랫폼을 유료로 이용하면서까지 광고를 보고 싶어 하지 않는 이용자가 늘고 있고, 웹사이트에서 광고를 차단하는 기술의 사용 또한 이전부터 빠르게 증 가하고 있다. 인플루언서 마케팅은 광고 차단 기술에 영향을 받지 않기 때문에 전통적인 광고 캠페인 대신 인플 루언서 마케팅이 적극적으로 활용되고 있다. 인플루언서 마케팅의 다른 장점은 모든 산업 분야에 적합하다는 것이다. 영양 보충제 판매, 소프트웨어 디자인, 차량 판매, 컨설팅 서비스 등 모든 업종에 인플루언서가 있다. 인플루언서 마케팅은 당신이 알고 있는 모든 사 업에 영향력을 미칠 수 있으며 업종, 사업 규모에 상관없이 좋은 기회를 제공한다. 인플루언서 마케팅의 또 다른 장점은 높은 타겟 트래픽을 얻을 수 있다는 것이다. 인플루언서 마케팅은 우리 브 랜드에 부합한 인플루언서의 마케팅 채널을 활용하기 때문에 웹사이트로 타겟 트래픽을 분명하게 유도할 수 있 다. 우리 웹사이트를 방문하는 사람들은 이미 우리의 제품 또는 서비스에 관심을 가지고 있다. 이는 웹사이트 검색 결과 노출 순위에도 긍정적인 영향을 미친다. 인플루언서 마케팅의 또 다른 장점은 브랜드의 권위와 인지도를 높일 수 있다는 것이다. 기본적으로 팔로워들은 인플루언서를 신뢰한다. 인플루언서가 자신의 채널에 브랜드와 관련된 콘텐츠를 게시하면 팔로워가 해당 브랜드 의 제품이나 서비스를 신뢰하게 된다. 이후 팔로워들은 자신의 소셜 미디어 계정에 콘텐츠를 공유하기 시작한다. 결과적으로 추가 비용 없이 인지도 향상과 더 많은 트래픽을 유도할 수 있다. 인플루언서 마케팅의 또 다른 장점은 구글 검색 결과 노출 순위에 긍정적인 영향을 준다는 것이다. 인플루언서 마케팅은 높은 가치의 백링크를 제공한다. 인플루언서가 우리 브랜드의 제품이나 서비스에 관련된 콘텐츠를 게 시할 때 웹사이트 주소를 함께 남긴다. 이것은 우리 웹사이트에 대한 백링크로 간주한다. 고품질의 백링크는 웹 사이트의 구글 검색 결과 노출 순위를 높일 수 있다. 백링크 전략과 관련된 자세한 내용은 효과적인 백링크 구 축 전략 글을 통해 확인할 수 있다. 한편, 인플루언서 마케팅 단점은 과도한 광고 비용이 소요된다는 것이다. 마케팅업체 미디어킥스에 따르면 1만 명 정도의 팔로워를 가진 ‘나노 인플루언서’는 게시물 1건당 최대 500달러를, 팔로워 5만~50만명을 거느린 ‘ 미드티어 인플루언서’는 1건당 2000~1만달러를 광고비로 받고 있다. 팔로워가 수백만 명 이상인 인기 연예인의 경우 게시물 1건의 가치는 50만달러(약 5억8500만원)에 달한다. 인플루언서 마케팅의 다른 단점은 객관적 검증이 어렵다는 것이다. 인플루언서의 광고 게시물이 많은 사람에게 노출돼도 실제 구매로 이어지지는 않는 경우가 많다. 일부 인플루언서들은 실체가 없는 가짜 팔로워 계정을 사 기도 한다. ‘클릭팜(Click Farm)’으로 불리는 전문업체들이 인플루언서들에게 가짜 계정을 판매하는데 유튜브 가짜 구독자 1000명이 최소 49달러에 거래되는 것으로 나타났다. 마케팅 분석회사 하이프오디터가 184만개의 인 스타그램 계정을 분석한 결과 절반 이상이 팔로워 수를 부풀리기 위해 업체를 거친 것으로 드러났다. 인플루언서 마케팅의 또 다른 단점은 신뢰 관계가 한순간에 무너질 수 있다는 것이다. 인플루언서가 인기를 얻 게 된 이유는 이웃집 언니, 오빠, 형, 누나의 친근한 이미지를 바탕으로 과장되지 않은 있는 그대로의 정보 전 달이 컸다. 인플루언서가 전하는 진정성 어린 정보는 소비자를 현혹하기 위해 과장된 기업 광고와는 차별된 장 점으로 여겨졌기 때문이다. 하지만 최근에는 몇몇 인플루언서의 허위, 과장 광고와 함께 심할 경우 사용해보지 도 않은 제품을 소개하는 경우까지 발생하고 있다. 이에 본 발명의 다양한 실시예에 따른 소셜 광고 중개 서비스를 제공하는 방법은 SNS 인플루언서 구독자 집계분 석 알고리즘을 통해 상품과 해당 상품을 광고할 최적의 인플루언서 조합을 결정함으로써, 상술된 바와 같은 인 플루언서 마케팅의 장점을 극대화함과 동시에 인플루언서 마케팅의 단점을 최소화할 수 있는 것이다. 도 1은 본 발명의 일 실시예에 따라 소셜 광고 중개 서비스를 제공하는 방법을 설명하기 위한 도면이다. 이하의 설명에서, \"서버\"는 소셜 광고 중개 서비스 업자가 운영하는 서버를 의미할 수 있다. 본 발명의 실시예 에 따르면, 광고주는 소셜 광고 중개 서비스 업자가 운영하는 서버로 광고 캠페인 브리프를 제공할 수 있고, 상 기 서버는 광고주의 캠페인 브리프 정보에 대응하는 소셜 포스트를 하나 이상의 인플루언서로부터 수신하여 상 기 광고주에게 제공할 수 있다. 소셜 포스트는 인플루언서가 직접 서버로 제공하고, 서버가 광고주에게 해당 소셜 포스트를 제공할 수도 있고, 소셜 광고 중개 서비스 업자가 직접 광고주의 캠페인 브리프 정보에 대응하는 임의의 인플루언서 소셜 포스트를찾아 광고주에게 제공할 수도 있다. 도 1에 도시된 각 단계는 서버에 의해 수행되는 단계로 이해되어야 할 것이다. 도 1을 참조하면, 먼저, 서버는 수신된 소셜 포스트에 대응하는 하나 이상의 인플루언서에 대한 인플루언서 영 향력 지수를 산출한다(S110). 이는 상기 수신된 소셜 포스트에 대응하는 하나 이상의 인플루언서 각각에 대해, 게시물 평가정보(좋아요, 조회 수, 댓글수, 추천수)에 기초한 인플루언서 본인 영향력 지수와 상기 인플루언서를 SNS상에서 구독하는 구독자에 관한 구독자 영향력 지수가 가산된 인플루언서 영향력 지수를 산출하는 단계를 포함한다. 구독자는 팔로워 (follower)의 개념을 포함하는 것으로, 이하에서는, 설명의 편의를 위해 구독자 및 팔로워를 \"구독자\"로 통칭하 기로 한다. 인플루언서의 영향력을 평가함에 있어서는, 인플루언서의 소셜 네트워크 계정의 구독자 수, 조회수, 공감 수 및 댓글 수가 기반이 될 수 있다. 또한, 인플루언서의 게시물 중 하나의 게시물만으로 영향력을 판단할 수 없기 때문에, 서버는 인플루언서의 일 정기간 동안의 게시물에 대한 조회수, 공감 수, 및 댓글 수를 기초로 하여 영향력을 판단할 수 있다. 또한, 인플루언서의 활동 중 광고주의 광고 희망 제품 또는 관련 제품에 대한 부정적인 활동과 긍정적인 활동을 분석하여 해당 인플루언서의 제품에 대한 영향력을 파악할 수 있다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, 서버는 인플루언서의 일정기간 게시물 중 해당 제품과 관련된 게시물의 부정적인 활동과 긍정적인 활 동을 수집하여 분석하고 영향력 파악에 활동할 수 있다. 또한, 인플루언서의 영향력에 해당 인플루언서를 구독하는 구독자에 대한 영향력을 파악하고 인플루언서의 영향 력에 영향을 주는 요소로 첨가하기 위하여, 구독자의 영향력 또한 산출한다. 여기서, 구독자 영향력 지수는 상기 인플루언서의 영향력 지수를 산출하는 것과 동일한 방식으로 산출될 수 있 다. 인플루언서 영향력 지수는 수학식 1에 의해 산출될 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "ISNS = 인플루언서의 최종 영향력 지수 Ir = 인플루언서 개인의 영향력 지수 Ir 은 다음의 수학식 2에 의해 산출된다. [수학식 2]"}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "FIr(i) = 구독자 개인의 영향력 지수 Ti = 인플루언서의 일정 시간 게시물 수 Fi = 인플루언서의 팔로어(구독자) 수 Ia(i) = 게시물의 좋아요 수 Ib(i) = 게시물의 조회 수 Ic(i) = 게시물의 댓글 수 Id(i) = 게시물의 추천 수 α = 보정 계수 (성별, 나이, 소득, 직업 등 외생 변수로 인해 발생할 수 있는 오차를 바로잡기 위해 적용된 수 로서, 자동 또는 수동으로 적절히 선택될 수 있다.) 또한, FIr(i) 는 다음의 수학식 3에 의해 산출될 수 있다. [수학식 3]"}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "x = 구독자 성향 점수 y = 구독자 영향력 점수 z = 구독자 충성도 Tf = 구독자의 일정 시간 게시물 수 Ff = 구독자의 팔로워 수 Ha(i) = 게시물의 해쉬태그 수 Hb(i) = 카테고리와 연관된 게시물의 해쉬태그 수 Fa(i) = 인플루언서의 일정기간 게시물 중 팔로어(구독자)의 좋아요 수 Fb(i) = 인플루언서의 일정기간 게시물 중 팔로어(구독자)의 댓글 수 Fc(i) = \"인플루언서의 일정기간 게시물 중 팔로어(구독자)의 \" 추천\" 수\" Ya(i) = 게시물의 좋아요 수 Yb(i) = 게시물의 조회 수 Yc(i) = 게시물의 댓글 수 Yd(i) = 게시물의 추천 수 β = 보정 계수 (성별, 나이, 소득, 직업 등 외생 변수로 인해 발생할 수 있는 오차를 바로잡기 위해 적용된 수 로서, 자동 또는 수동으로 적절히 선택될 수 있다.) 인플루언서의 영향력 지수 중, 구독자의 영향력 지수 FIr(i)는 인플루언서의 영향력 지수를 계산하는 방법과 동 일하며 추가적으로 수식1의 x, y, z를 활용하여 FIr(i)를 구하여 합산한 후 구독자의 수로 나누어 평균값을 구 한다.또한, 구독자의 영향력 지수는 해당 구독자를 구독하는 구독자 수와 구독자의 성향 점수, 구독자의 영향력 점수, 및 구독자의 충성도 점수를 포함하며 구독자의 영향력은 이상의 요인 외 유효하다고 판단되는 요인을 가 중치로 포함할 수 있다. 또한, 구독자의 영향력 지수 중, 구독자의 성향 점수는 구독자의 일정 기간 게시물의 모든 해시태그 중 해당 광 고 캠페인의 제품 카테고리와 관련된 해시태그의 비율로 해당 광고 캠페인의 제품 카테고리와의 성향 점수를 계 산한다. 또한, 구독자의 영향력 지수 중, 구독자의 영향력 점수는 인플루언서의 영향력 지수를 수치화하는 상기의 수학 식과 동일한 수식을 사용하되, 구독자의 영향력 점수를 파악하는 부분을 제외하고 계산하여 구독자의 영향력 점 수를 계산한다. 또한, 구독자의 영향력 지수 중, 구독자의 충성도 점수는 구독자가 해당 인플루언서의 게시물에 얼마나 반응을 하는지에 대한 점수로 해당 구독자가 해당 인플루언서의 일정기간 게시물 중 구독자가 실행한 좋아요 수, 댓글 수, 추천 수로 계산하여 구독자의 충성도 점수를 계산한다. 또한, 결과로 나온 Ir을 한번 더 보정하여 인플루언서의 영향력 지수 ISNS 을 산출한다. 단계 S110에서 인플루언서의 영향력 지수를 산출한 후, 서버는 광고주에 대한 광고주 영향력을 지수로 산출한다 (S120). 산출된 광고주 영향력 지수는 인플루언서의 영향력 지수와 결합되어 해당 광고 캠페인과 인플루언서간의 매칭으 로 인한 광고의 파급력 산출에 활용된다. 광고주 영향력 지수는 다음의 수학식 4에 의해 산출된다. [수학식 4]"}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "Ad = 광고주 영향력 지수 Ta = 광고주 계정의 영향력 지수 (수학식 1 내지 3과 동일한 방식으로 산출됨) Tb = 광고주 상품의 쇼핑몰 점유율 Tc = 광고주의 브랜드 이미지 평가값 Qa = 온라인 마켓 내 동일 카테고리 총 제품 수 Qb = 온라인 마켓 내 동일 카테고리 중 광고주의 제품 수 Na = 일정기간 광고주 관련 기사, 게시글 총 수 Nb(i) = 기사&게시물의 조회 수 Nc(i) = 기사&게시물의 댓글 수 Nd(i) = 기사&게시물의 긍정 댓글 수 Ne(i) = 기사&게시물의 부정 댓글 수 α = 보정 계수 (성별, 나이, 소득, 직업 등 외생 변수로 인해 발생할 수 있는 오차를 바로잡기 위해 적용된 수 로서, 자동 또는 수동으로 적절히 선택될 수 있다.) 상기 게시물은, 상기 광고주와 관련된 SNS 계정 또는 다른 미디어 공간에 개시된 해당 광고주 또는 광고 대상 제품과 관련된 게시물일 수 있다. 광고주에 대한 영향력 지수는 현재 광고주의 브랜드 인지가 부정적인지, 긍정적인지 여부에 상관없이 대중의 영 향 정도만을 나타낸다. 그 이유는 해당 광고주가 부정적인 영향이 강하더라도 대중에 대한 인식이 높다면 제품 에 대한 인식 또한 높기 때문이다. 따라서, 해당 광고주의 영향력이 부정적이더라도 대중에게 많이 알려진 상태라면 해당 광고에 대한 파급력 또한 높기 때문에 광고주에 대한 영향력 지수는 긍정, 부정에 대한 구분을 하지 않도록 상기 수학식을 제안한다. 그리고, 인플루언서의 영향력 지수와 광고주에 대한 광고주 영향력 지수가 산출이 완료되면 인플루언서의 영향 력 지수와 광고주에 대한 광고주 영향력 지수를 활용하여 인플루언서와 광고주의 광고 캠페인의 매칭에 따른 해 당 광고 캠페인의 광고 파급력 지수를 산출한다(S130). 광고의 파급력 지수는 다음의 수학식에 의해 산출될 수 있다. [수학식 5]"}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "ISNS = 인플루언서의 최종 영향력 지수 Ad = 광고주 영향력 지수 산출된 인플루언서 영향력 지수와 광고주 영향력 지수를 이용하여 광고 파급력 지수를 산출하는 과정에서는, 유 효한 인자를 추가적인 가중치로 포함할 수 있다. 상기 수학식 5에서, a, b1, b2, b3, b4, e가 광고의 파급력 지수에 영향을 미치는 인자 또는 가중치인데, 이는 인플루언서의 특징 (ex. 인지도, 성별, 나이, 소득, 직업 등) 및 광고주의 특징 (ex. 인지도, 과거 성과 등) 에 따라 달라질 수 있는 값이다. 일 실시예에 따르면, 인플루언서의 광고 계약 건수를 이용한 함수 값, 인플루언서의 일정 기간 광고매출액을 이 용한 함수 값, 인플루언서의 광고 건 당 매출 신장률을 이용한 함수 값, 인플루언서의 광고 건 당 평균 보상액 을 이용한 함수 값, 광고주의 광고 캠페인의 주 광고 대상 계층별(나이, 성별, 직업 등) 광고 반응 점수를 이용 한 함수 값 등이 가중치로 활용될 수 있다. 또한, 가중치의 경우 인플루언서의 영향력, 광고주의 영향력과는 별개로 인플루언서의 이전 광고 캠페인 진행에 관한 인플루언서의 광고 캠페인 수행 능력과 관련된 데이터나 해당 인플루언서에 기반하여 진행한 캠페인이 존 재하지 않는다면 가중치가 존재하지 않을 수 있도 있음은 물론이다. 또한, 가중치는 인플루언서의 광고 캠페인 수행 능력만으로 제한하지 않는다. 따라서, 파급력 지수를 산출하는 과정에서, 파급력 지수에 영향을 미칠 수 있는 유효한 인자를 포함하여 가중치 로 사용 할 수 있으며, 유효한 인자는 인플루언서가 활동하는 소셜 네트워크에서 제공하는 요소를 포함 할 수도 있다. 또한, 유효한 인자는 소셜 네트워크에서 제공하는 요소만으로 한정하지 않으며, 소셜 네트워크가 추가적으로 제 공하는 기능이나, 노출되는 정보에 따라 인자가 변경될 수 있으며, 유효한 인자로써 추가적인 가중치로 포함될 수도 있다. 광고 파급력 지수 산출이 완료되면, 서버는 광고주에게 인플루언서 정보와 광고 파급력 지수를 제공한다(S140). 광고주에게 복수의 인플루언서 정보 및 각각의 광고 파급력 지수가 제공되면, 광고주는 소셜 광고 중개 서비스 업자에 의해 관리되는 서버로부터 제공된 정보를 토대로 적절한 인플루언서를 선정하게 되고, 광고주는 본인의 단말기를 통해 서버에 선정된 인플루언서 정보 및 업로드될 소셜 포스트에 대한 정보를 전송한다(S150). 그후, 광고주로부터 선택된 인플루언서의 소셜 네트워크 계정에 선택된 소셜 포스트를 업로드한다(S160). 이 과정에서 서버는 선정된 인플루언서에게 해당 광고주의 광고 캠페인에 대한 상세 내용을 전달하고, 인플루언 서의 의견을 광고주에게 전달하는 광고주와 인플루언서의 중개 과정을 더 제공할 수 있다. 광고주와 인플루언서의 협의가 완료되면, 해당 광고 캠페인은 인플루언서에 의해 본인의 소셜 네트워크에 업로 드될 수 있다. 업로드는, 인플루언서가 활동하는 소셜 네트워크에서 지원하는 기능으로 이루어질 수도 있지만, 광고주가 제시 하거나 소셜 광고 중개 서비스 업자가 제시하는 방법으로 이루어질 수도 있다. 마지막으로, 광고주로부터 제공받은 해당 광고 캠페인에 대한 보상은 소셜 광고 중개 서비스 업자와 광고 캠페 인을 진행한 인플루언서 간에 분배될 수도 있다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다."}
{"patent_id": "10-2023-0081977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2023-0081977", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따라 소셜 광고 중개 서비스를 제공하는 방법을 설명하기 위한 도면이다."}
