{"patent_id": "10-2020-0052601", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0135171", "출원번호": "10-2020-0052601", "발명의 명칭": "의료 영상에서 악성의심 병변을 구별하는 방법, 이를 이용한 의료 영상 판독 방법 및 컴퓨팅", "출원인": "주식회사 루닛", "발명자": "김효은"}}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서에 의해 동작하는 컴퓨팅 장치가 입력 영상을 판독하는 방법으로서,입력 영상에서 검출된 병변을 악성의심(suspicious) 또는 비-악성의심(non-suspicious)으로 분류하고, 악성의심조건에서 상기 입력 영상에서 검출된 병변을 악성, 또는 악성의심되지만 양성인 악성의심-양성으로 분류하도록학습된 인공지능 모델을 저장하는 단계,분석 대상 영상을 입력받는 단계,상기 인공지능 모델을 이용하여, 상기 분석 대상 영상에서 검출된 타겟 병변의 분류 클래스를 획득하고, 상기분류 클래스가 상기 악성의심인 경우, 상기 타겟 병변에 대한 악성의심 확률, 악성의심-양성 확률 그리고 악성확률 중 적어도 하나를 획득하는 단계, 그리고상기 타겟 병변에 대해 획득한 적어도 하나의 확률을 포함하는 판독 결과를 출력하는 단계를 포함하는, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서,상기 인공지능 모델은 상기 입력 영상의 특징을 출력하도록 학습된 특징 추출 모델, 상기 입력 영상의 특징을 상기 악성의심 또는 상기 비-악성의심으로 분류하도록 학습된 제1 브랜치 분류 모델, 그리고 상기 악성의심 조건에서 상기 입력 영상의 특징을 상기 악성 또는 상기 악성의심-양성으로 분류하도록 학습된 제2 브랜치 분류 모델을 포함하며,상기 제2 브랜치 분류 모델의 분류 결과는 상기 제1 브랜치 분류 모델의 분류 결과에 따라 선택적으로 상기 판독 결과에 반영되는, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 제1 브랜치 분류 모델은학습용 의료 영상의 특징을 해당 학습용 의료 영상이 속하는 그룹으로 분류하는 태스크를 학습한 분류모델이고,상기 그룹은 비-악성의심 그룹과 악성의심 그룹인, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에서,상기 제2 브랜치 분류 모델은상기 악성의심 그룹에 속하는 학습용 의료 영상의 특징을 해당 학습용 의료 영상에 어노테이션된 레이블로 분류하는 태스크를 학습한 분류 모델이고,상기 레이블은 상기 악성 또는 상기 악성의심-양성인, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에서,상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류 모델은 독립적으로 학습되는, 판독 방법.공개특허 10-2020-0135171-3-청구항 6 제1항에서,상기 판독 결과를 출력하는 단계는상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성의심-양성인 경우, 상기 타겟 병변이악성의심-양성이라는 표시 정보, 그리고 상기 악성의심-양성 확률을 포함하는 판독 결과를 출력하고,상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성인 경우, 상기 타겟 병변이 악성이라는 표시 정보, 그리고 상기 악성 확률을 포함하는 판독 결과를 출력하는, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에서,상기 악성의심 확률은, 상기 인공지능 모델에서 상기 타겟 병변이 상기 악성의심으로 분류된 확률이고,상기 악성의심-양성 확률은, 상기 인공지능 모델에서 상기 타겟 병변이 상기 악성의심 조건에서 상기 악성의심-양성으로 분류된 확률과, 상기 악성의심 확률의 곱으로 계산되며,상기 악성 확률은, 상기 인공지능 모델에서 상기 타겟 병변이 상기 악성의심 조건에서 상기 악성으로 분류된 확률과 상기 악성의심 확률의 곱으로 계산되는, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에서,상기 비-악성의심으로 분류된 병변을 정상 또는 양성으로 분류하도록 추가 학습된 상기 인공지능 모델을 에서상기 타겟 병변의 분류 클래스가 상기 비-악성의심인 경우, 상기 타겟 병변에 대한 비-악성의심 확률, 양성 확률 그리고 정상 확률 중 적어도 하나를 획득하는 단계를 더 포함하는 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "적어도 하나의 프로세서에 의해 동작하는 컴퓨팅 장치가 입력 영상을 판독하는 방법으로서,분석 대상 영상을 입력받는 단계,상기 제1 브랜치 분류 모델을 이용하여 상기 분석 대상 영상에서 검출된 병변을 악성의심(suspicious) 또는 비-악성의심(non-suspicious)으로 분류하고, 상기 병변이 상기 악성의심으로 분류된 확률을 계산하는 단계,상기 제2 브랜치 분류 모델을 이용하여 상기 병변을 악성, 또는 악성의심되는 병변이나 양성인 악성의심-양성으로 분류하고, 상기 병변이 악성의심 조건에서 상기 악성 또는 상기 악성의심-양성으로 분류된 확률을 계산하는단계, 그리고상기 병변이 상기 제1 브랜치 분류 모델에서 상기 악성의심으로 분류된 경우, 상기 제2 브랜치 분류 모델의 분류 결과를 이용하여 생성한 판독 결과를 출력하는 단계를 포함하며,상기 판독 결과는 상기 병변이 악성이라는 표시 정보 및 악성 확률을 포함하거나, 상기 병변이 양성이라는 표시정보 및 양성 확률을 포함하는 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에서,상기 양성 확률은 상기 병변이 상기 악성의심으로 분류된 확률과 상기 병변이 상기 악성의심 조건에서 상기 악성의심-양성으로 분류된 확률의 곱으로 계산되는, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2020-0135171-4-제9항에서,상기 악성 확률은상기 병변이 상기 악성의심으로 분류된 확률과 상기 병변이 상기 악성의심 조건에서 상기 악성으로 분류된 확률의 곱으로 계산되는, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에서,상기 병변이 상기 악성의심으로 분류된 확률을 계산하는 단계는학습용 의료 영상의 특징을 해당 학습용 의료 영상이 속하는 그룹으로 분류하는 태스크를 학습한 상기 제1 브랜치 분류 모델을 이용하여, 상기 병변의 1차 분류 클래스 및 상기 악성의심으로 분류된 확률을 획득하고, 상기 그룹은 비-악성의심 그룹과 악성의심 그룹인, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에서,상기 병변이 악성의심 조건에서 상기 악성 또는 상기 악성의심-양성으로 분류된 확률을 계산하는 단계는상기 악성의심 그룹에 속하는 학습용 의료 영상의 특징을 해당 학습용 의료 영상에 어노테이션된 레이블로 분류하는 태스크를 학습한 상기 제2 브랜치 분류 모델을 이용하여, 상기 병변의 2차 분류 클래스, 그리고 상기 악성의심 조건에서 상기 악성 또는 상기 악성의심-양성으로 분류된 확률을 획득하고,상기 레이블은 상기 악성 또는 상기 악성의심-양성인, 판독 방법."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "컴퓨팅 장치로서,입력 영상에서 검출된 병변을 악성의심(suspicious) 또는 비-악성의심(non-suspicious)으로 분류하고, 악성의심조건에서 상기 입력 영상에서 검출된 병변을 악성, 또는 악성의심되지만 양성인 악성의심-양성으로 분류하는 인공지능 모델을 저장하는 메모리, 그리고상기 인공지능 모델을 이용하여, 분석 대상 영상에서 검출된 타겟 병변의 분류 클래스를 확인하고, 상기 분류클래스가 상기 악성의심인 경우, 상기 타겟 병변에 대한 악성의심 확률, 악성의심-양성 확률 그리고 악성 확률중 적어도 하나를 획득하며, 상기 타겟 병변에 대해 획득한 적어도 하나의 확률을 포함하는 판독 결과를 출력하는 프로세서를 포함하는 컴퓨팅 장치."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에서,상기 인공지능 모델은 상기 입력 영상에서 병변을 검출하기 위한 특징을 출력하도록 학습된 컨볼루션 신경망 기반의 특징 추출 모델, 상기 입력 영상의 특징을 상기 악성의심 또는 상기 비-악성의심으로 분류하도록 학습된 제1 브랜치 분류 모델,그리고 상기 입력 영상의 특징을 상기 악성 또는 상기 악성의심-양성으로 분류하도록 학습된 제2 브랜치 분류 모델을 포함하며,상기 제2 브랜치 분류 모델의 분류 결과는 상기 제1 브랜치 분류 모델의 분류 결과에 따라 선택적으로 상기 판독 결과에 반영되는, 컴퓨팅 장치."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2020-0135171-5-제15항에서,상기 제1 브랜치 분류 모델은상기 악성의심 또는 상기 비-악성의심으로 그룹핑된 의료 영상들을 이용하여, 입력 영상을 상기 악성의심 또는상기 비-악성의심으로 분류하는 태스크를 학습한 분류 모델이고,상기 제2 브랜치 분류 모델은상기 악성의심으로 그룹핑된 의료 영상들과 해당 의료 영상에 어노테이션된 레이블을 이용하여, 입력 영상을 상기 악성 또는 상기 악성의심-양성으로 분류하는 태스크를 학습한 분류 모델이며,상기 어노테이션된 레이블은 상기 악성 또는 상기 악성의심-양성인, 컴퓨팅 장치."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에서,상기 프로세서는상기 인공지능 모델을 구성하는 상기 특징 추출 모델의 출력을 상기 제1 브랜치 분류 모델과 상기 제2 브랜치분류 모델로 분기하여 입력하고, 학습 데이터를 이용하여 상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류모델을 독립적으로 학습시키는, 컴퓨팅 장치"}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에서,상기 프로세서는학습 완료된 상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류 모델을 상기 특징 추출 모델에 병렬로 연결하여 상기 인공지능 모델을 생성하고, 상기 특징 추출 모델에서 출력된 특징에 대한 상기 제1 브랜치 분류 모델의분류 클래스가 상기 악성의심인 경우, 상기 제2 브랜치 분류 모델의 분류 결과를 사용하여 상기 판독 결과를 생성하는, 컴퓨팅 장치."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에서,상기 프로세서는상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성의심-양성인 경우, 상기 타겟 병변이악성의심-양성이라는 표시 정보, 그리고 상기 악성의심-양성 확률을 포함하는 판독 결과를 출력하고, 상기 악성의심-양성 확률은, 상기 인공지능 모델에서 상기 검출 병변이 상기 악성의심 조건에서 상기 악성의심-양성으로 분류된 확률과, 상기 악성의심으로 분류된 확률의 곱으로 계산되는, 컴퓨팅 장치."}
{"patent_id": "10-2020-0052601", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14항에서,상기 프로세서는상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성인 경우, 상기 타겟 병변이 악성이라는 표시 정보, 그리고 상기 악성 확률을 포함하는 판독 결과를 출력하고, 상기 악성 확률은, 상기 인공지능 모델에서 상기 검출 병변이 상기 악성의심 조건에서 상기 악성으로 분류된 확률과 상기 악성의심으로 분류된 확률의 곱으로 계산되는, 컴퓨팅 장치."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "적어도 하나의 프로세서에 의해 동작하는 컴퓨팅 장치가 입력 영상을 판독하는 방법으로서, 입력 영상에서 검출 된 병변을 악성의심(suspicious) 또는 비-악성의심(non-suspicious)으로 분류하고, 악성의심 조건에서 상기 입력 영상에서 검출된 병변을 악성, 또는 악성의심되지만 양성인 악성의심-양성으로 분류하도록 학습된 인공지능 모델 을 저장하는 단계, 분석 대상 영상을 입력받는 단계, 상기 인공지능 모델을 이용하여, 상기 분석 대상 영상에서 검출된 타겟 병변의 분류 클래스를 획득하고, 상기 분류 클래스가 상기 악성의심인 경우, 상기 타겟 병변에 대한 악성의심 확률, 악성의심-양성 확률 그리고 악성 확률 중 적어도 하나를 획득하는 단계, 그리고 상기 타겟 병변 에 대해 획득한 적어도 하나의 확률을 포함하는 판독 결과를 출력하는 단계를 포함한다."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능 기반 의료 영상 판독 기술에 관한 것이다."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "딥러닝(deep-learning)으로 대표되는 기계학습(machine-learning) 기술은 영상, 음성, 텍스트 등 다양한 형태의 데이터 분석에서 기존 방법의 성능을 뛰어 넘는 결과를 제공하고 있다. 또한, 기계학습 기술은 기술 자체에 내 재된 확장성 및 유연성으로 인해 다양한 분야에 적용되고 있고, 다양한 종류의 신경망(neural network)이 공개 되고 있다. 이렇게, 기계학습 기반의 인공지능(Artificial Intelligence, AI) 기술은 의료 분야에서 활발히 도입되고 있다. 이전에는 CAD(Computer Aided Detection) 장치가 룰 기반(rule based)으로 병변을 검출하거나, 의료 영상에서 설정된 후보 영역에서 병변을 검출하였다면, 최근의 AI 기반 의료 영상 판독 기술은 의료 영상 전체를 AI 알고 리즘으로 분석하고, 이상(abnormality) 병변을 시각적으로 제공할 수 있다. 의료진은 AI 기반 의료 영상 판독 기술이 구현된 진단 보조 시스템으로부터 의료 영상에 포함된 악성 병변 정보 를 제공받고, 이를 참고하여 진단할 수 있다. 이때, 의료진이 영상 판독했을 때 악성으로 의심되는 병변이 있는 데, 진단 보조 시스템은 양성 병변이라서 화면에 표시를 하지 않을 수 있다. 그러면, 의료진은 진단 보조 시스 템의 판단이 틀린 것인지, 양성이라서 표시하지 않은 것인지 알 수 없다. 결국, 진단 보조 시스템은 악성의심 병변이 양성이라서 표시하지 않았음에도 불구하고, 의료진은 악성의심 병변을 제대로 검출하지 못한 것으로 오 해할 수 있고, 결과적으로 진단 보조 시스템의 신뢰도가 하락하게 되는 문제가 발생한다."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "해결하고자 하는 과제는 의료 영상의 판독 결과로서, 양성(benign)인 악성의심 병변(suspicious lesion)에 대한 정보를 제공하는 방법, 그리고 이를 구현한 컴퓨팅 장치를 제공하는 것이다. 해결하고자 하는 과제는 학습 데이터를 이용하여, 의료 영상에서 악성의심 병변을 구별하고, 악성의심 병변을 악성 또는 양성으로 분류하는 인공지능 모델을 학습시키는 방법, 그리고 이를 구현한 컴퓨팅 장치를 제공하는 것이다. 해결하고자 하는 과제는 학습된 인공지능 모델을 이용하여, 의료 영상에서 양성인 악성의심 병변과 악성 병변을 분류하고, 양성인 악성의심 병변 또는 악성 병변의 정보를 포함하는 판독 결과를 제공하는 방법, 그리고 이를 구현한 컴퓨팅 장치를 제공하는 것이다."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "한 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 컴퓨팅 장치가 입력 영상을 판독하는 방법으로서, 입력 영상에서 검출된 병변을 악성의심(suspicious) 또는 비-악성의심(non-suspicious)으로 분류하고, 악성의심 조건에서 상기 입력 영상에서 검출된 병변을 악성, 또는 악성의심되지만 양성인 악성의심-양성으로 분류하도록 학습된 인공지능 모델을 저장하는 단계, 분석 대상 영상을 입력받는 단계, 상기 인공지능 모델을 이용하여, 상 기 분석 대상 영상에서 검출된 타겟 병변의 분류 클래스를 획득하고, 상기 분류 클래스가 상기 악성의심인 경우, 상기 타겟 병변에 대한 악성의심 확률, 악성의심-양성 확률 그리고 악성 확률 중 적어도 하나를 획득하는 단계, 그리고 상기 타겟 병변에 대해 획득한 적어도 하나의 확률을 포함하는 판독 결과를 출력하는 단계를 포함 한다. 상기 인공지능 모델은 상기 입력 영상의 특징을 출력하도록 학습된 특징 추출 모델, 상기 입력 영상의 특징을 상기 악성의심 또는 상기 비-악성의심으로 분류하도록 학습된 제1 브랜치 분류 모델, 그리고 상기 악성의심 조 건에서 상기 입력 영상의 특징을 상기 악성 또는 상기 악성의심-양성으로 분류하도록 학습된 제2 브랜치 분류 모델을 포함할 수 있다. 상기 제2 브랜치 분류 모델의 분류 결과는 상기 제1 브랜치 분류 모델의 분류 결과에 따라 선택적으로 상기 판독 결과에 반영될 수 있다. 상기 제1 브랜치 분류 모델은 학습용 의료 영상의 특징을 해당 학습용 의료 영상이 속하는 그룹으로 분류하는 태스크를 학습한 분류 모델일 수 있다. 상기 그룹은 비-악성의심 그룹과 악성의심 그룹일 수 있다. 상기 제2 브랜치 분류 모델은 상기 악성의심 그룹에 속하는 학습용 의료 영상의 특징을 해당 학습용 의료 영상 에 어노테이션된 레이블로 분류하는 태스크를 학습한 분류 모델일 수 있다. 상기 레이블은 상기 악성 또는 상기악성의심-양성일 수 있다. 상기 판독 방법은 상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류 모델은 독립적으로 학습될 수 있다. 상기 판독 결과를 출력하는 단계는 상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성 의심-양성인 경우, 상기 타겟 병변이 악성의심-양성이라는 표시 정보, 그리고 상기 악성의심-양성 확률을 포함 하는 판독 결과를 출력하고, 상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성인 경우, 상기 타겟 병변이 악성이라는 표시 정보, 그리고 상기 악성 확률을 포함하는 판독 결과를 출력할 수 있다. 상기 악성의심 확률은, 상기 인공지능 모델에서 상기 타겟 병변이 상기 악성의심으로 분류된 확률일 수 있다. 상기 악성의심-양성 확률은, 상기 인공지능 모델에서 상기 타겟 병변이 상기 악성의심 조건에서 상기 악성의심- 양성으로 분류된 확률과, 상기 악성의심 확률의 곱으로 계산될 수 있다. 상기 악성 확률은, 상기 인공지능 모델 에서 상기 타겟 병변이 상기 악성의심 조건에서 상기 악성으로 분류된 확률과 상기 악성의심 확률의 곱으로 계 산될 수 있다. 상기 판독 방법은 상기 비-악성의심으로 분류된 병변을 정상 또는 양성으로 분류하도록 추가 학습된 상기 인공 지능 모델을 에서 상기 타겟 병변의 분류 클래스가 상기 비-악성의심인 경우, 상기 타겟 병변에 대한 비-악성의 심 확률, 양성 확률 그리고 정상 확률 중 적어도 하나를 획득하는 단계를 더 포함할 수 있다. 한 실시예에 따라 적어도 하나의 프로세서에 의해 동작하는 컴퓨팅 장치가 입력 영상을 판독하는 방법으로서, 분석 대상 영상을 입력받는 단계, 상기 제1 브랜치 분류 모델을 이용하여 상기 분석 대상 영상에서 검출된 병변 을 악성의심(suspicious) 또는 비-악성의심(non-suspicious)으로 분류하고, 상기 병변이 상기 악성의심으로 분 류된 확률을 계산하는 단계, 상기 제2 브랜치 분류 모델을 이용하여 상기 병변을 악성, 또는 악성의심되는 병변 이나 양성인 악성의심-양성으로 분류하고, 상기 병변이 악성의심 조건에서 상기 악성 또는 상기 악성의심-양성 으로 분류된 확률을 계산하는 단계, 그리고 상기 병변이 상기 제1 브랜치 분류 모델에서 상기 악성의심으로 분 류된 경우, 상기 제2 브랜치 분류 모델의 분류 결과를 이용하여 생성한 판독 결과를 출력하는 단계를 포함한다. 상기 판독 결과는 상기 병변이 악성이라는 표시 정보 및 악성 확률을 포함하거나, 상기 병변이 양성이라는 표시 정보 및 양성 확률을 포함한다. 상기 양성 확률은 상기 병변이 상기 악성의심으로 분류된 확률과 상기 병변이 상기 악성의심 조건에서 상기 악 성의심-양성으로 분류된 확률의 곱으로 계산될 수 있다. 상기 악성 확률은 상기 병변이 상기 악성의심으로 분류된 확률과 상기 병변이 상기 악성의심 조건에서 상기 악 성으로 분류된 확률의 곱으로 계산될 수 있다. 상기 병변이 상기 악성의심으로 분류된 확률을 계산하는 단계는 학습용 의료 영상의 특징을 해당 학습용 의료 영상이 속하는 그룹으로 분류하는 태스크를 학습한 상기 제1 브랜치 분류 모델을 이용하여, 상기 병변의 1차 분 류 클래스 및 상기 악성의심으로 분류된 확률을 획득할 수 있다. 상기 그룹은 비-악성의심 그룹과 악성의심 그 룹일 수 있다. 상기 병변이 악성의심 조건에서 상기 악성 또는 상기 악성의심-양성으로 분류된 확률을 계산하는 단계는 상기 악성의심 그룹에 속하는 학습용 의료 영상의 특징을 해당 학습용 의료 영상에 어노테이션된 레이블로 분류하는 태스크를 학습한 상기 제2 브랜치 분류 모델을 이용하여, 상기 병변의 2차 분류 클래스, 그리고 상기 악성의심 조건에서 상기 악성 또는 상기 악성의심-양성으로 분류된 확률을 획득할 수 있다. 상기 레이블은 상기 악성 또 는 상기 악성의심-양성일 수 있다. 한 실시예에 따른 컴퓨팅 장치로서, 입력 영상에서 검출된 병변을 악성의심(suspicious) 또는 비-악성의심(non- suspicious)으로 분류하고, 악성의심 조건에서 상기 입력 영상에서 검출된 병변을 악성, 또는 악성의심되지만 양성인 악성의심-양성으로 분류하는 인공지능 모델을 저장하는 메모리, 그리고 상기 인공지능 모델을 이용하여, 분석 대상 영상에서 검출된 타겟 병변의 분류 클래스를 확인하고, 상기 분류 클래스가 상기 악성의심인 경우, 상기 타겟 병변에 대한 악성의심 확률, 악성의심-양성 확률 그리고 악성 확률 중 적어도 하나를 획득하며, 상기 타겟 병변에 대해 획득한 적어도 하나의 확률을 포함하는 판독 결과를 출력하는 프로세서를 포함한다. 상기 인공지능 모델은 상기 입력 영상에서 병변을 검출하기 위한 특징을 출력하도록 학습된 컨볼루션 신경망 기 반의 특징 추출 모델, 상기 입력 영상의 특징을 상기 악성의심 또는 상기 비-악성의심으로 분류하도록 학습된 제1 브랜치 분류 모델, 그리고 상기 입력 영상의 특징을 상기 악성 또는 상기 악성의심-양성으로 분류하도록 학습된 제2 브랜치 분류 모델을 포함할 수 있다. 상기 제2 브랜치 분류 모델의 분류 결과는 상기 제1 브랜치 분류 모델의 분류 결과에 따라 선택적으로 상기 판독 결과에 반영될 수 있다. 상기 제1 브랜치 분류 모델은 상기 악성의심 또는 상기 비-악성의심으로 그룹핑된 의료 영상들을 이용하여, 입 력 영상을 상기 악성의심 또는 상기 비-악성의심으로 분류하는 태스크를 학습한 분류 모델일 수 있다. 상기 제2 브랜치 분류 모델은 상기 악성의심으로 그룹핑된 의료 영상들과 해당 의료 영상에 어노테이션된 레이블을 이용 하여, 입력 영상을 상기 악성 또는 상기 악성의심-양성으로 분류하는 태스크를 학습한 분류 모델일 수 있다. 상 기 어노테이션된 레이블은 상기 악성 또는 상기 악성의심-양성일 수 있다. 상기 프로세서는 상기 인공지능 모델을 구성하는 상기 특징 추출 모델의 출력을 상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류 모델로 분기하여 입력하고, 학습 데이터를 이용하여 상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류 모델을 독립적으로 학습시킬 수 있다. 상기 프로세서는 학습 완료된 상기 제1 브랜치 분류 모델과 상기 제2 브랜치 분류 모델을 상기 특징 추출 모델 에 병렬로 연결하여 상기 인공지능 모델을 생성하고, 상기 특징 추출 모델에서 출력된 특징에 대한 상기 제1 브 랜치 분류 모델의 분류 클래스가 상기 악성의심인 경우, 상기 제2 브랜치 분류 모델의 분류 결과를 사용하여 상 기 판독 결과를 생성할 수 있다. 상기 프로세서는 상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성의심-양성인 경우, 상기 타겟 병변이 악성의심-양성이라는 표시 정보, 그리고 상기 악성의심-양성 확률을 포함하는 판독 결과를 출 력할 수 있다. 상기 악성의심-양성 확률은, 상기 인공지능 모델에서 상기 검출 병변이 상기 악성의심 조건에서 상기 악성의심-양성으로 분류된 확률과, 상기 악성의심으로 분류된 확률의 곱으로 계산될 수 있다. 상기 프로세서는 상기 타겟 병변의 분류 클래스가 상기 악성의심의 하위 분류 클래스인 악성인 경우, 상기 타겟 병변이 악성이라는 표시 정보, 그리고 상기 악성 확률을 포함하는 판독 결과를 출력할 수 있다. 상기 악성 확률 은, 상기 인공지능 모델에서 상기 검출 병변이 상기 악성의심 조건에서 상기 악성으로 분류된 확률과 상기 악성 의심으로 분류된 확률의 곱으로 계산될 수 있다."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예에 따르면 컴퓨팅 장치는 의료 영상에서 악성으로 의심되는 병변을 검출하고, 악성의심 병변을, 추가 검 사(예를 들면, biopsy)에서 양성으로 판단될 병변과 악성으로 판단될 병변으로 분류해 주기 때문에, 의료진이 컴퓨팅 장치에서 악성의심 병변을 놓치지 않고 분석하였음을 알게 되어, 컴퓨팅 장치의 판독 결과를 신뢰할 수 있다. 실시예에 따르면 컴퓨팅 장치는 의료 영상에서 악성의심 병변으로 판독되지만 추가 검사에서 양성으로 판단될 병변을 구별해 주므로, 양성인 악성의심 병변에 대한 불필요한 영상 촬영이나 조직 검사 등의 추가 검사를 줄일 수 있다. 실시예에 따르면 인공지능 모델이 의료 영상의 병변에 대해, 정상(normal), 명백한 양성(benign-easy), 악성의 심이나 양성(benign-hard), 악성(cancer)으로 구별할 수 있어서, 판독 결과에 대해 설명 가능한 AI(eXplainable AI, XAI)를 제공할 수 있다. 실시예에 따르면 인공지능 모델의 분류 모델들을 독립적으로 학습시키기 때문에 분류 클래스에 따라 학습 난이 도가 다른 경우 발생할 수 있는 학습 편차를 해소할 수 있고, 상위 계층의 분류 결과에 따라 하위 계층의 분류 결과를 선택적으로 적용하여 판독 결과를 생성하므로 분류 모델들의 예측 확률을 충돌 없이 제공할 수 있다."}
{"patent_id": "10-2020-0052601", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구 성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재된 \"… 부\", \"…기\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 명세서에서, 태스크(task)란, 기계 학습을 통해 해결하고자 하는 과제 또는 기계 학습을 통해 수행하고자 하는 작업을 지칭한다. 예를 들어, 의료 영상(medical image)으로부터 인식, 분류, 예측 등을 수행한다고 할 때, 인 식, 분류, 예측 각각이 개별 태스크에 대응될 수 있다. 본 발명의 인공지능 모델은 적어도 하나의 태스크를 학 습하는 모델로서, 컴퓨팅 장치에서 실행되는 소프트웨어/프로그램으로 구현될 수 있다. 프로그램은 저장 매체 (non-transitory storage media)에 저장되고, 프로세서에 의해 본 발명의 동작을 실행하도록 기술된 명령들 (instructions)을 포함한다. 프로그램은 네트워크를 통해 다운로드되거나, 제품 형태로 판매될 수 있다. 본 개시는 다양한 모달리티(modality)로 촬영된 다양한 부위의 의료 영상에 대해 적용될 수 있고, 예를 들면, 의료 영상의 모달리티는 엑스레이(X-ray), MRI(magnetic resonance imaging), 초음파(ultrasaound), CT(computed tomography), MMG(Mammography), DBT(Digital breast tomosynthesis) 등과 같이 다양할 수 있다. 먼저, 병원에서 의료 영상을 판독하고, 악성 병변을 검출하는 방법에 대해 살펴본다. 예를 들어, 유방촬영영상 에서 악성으로 의심되는 병변이 판독되면, 의사는 환자에 대한 추가 검사(recall)(예를 들면, 유방 초음파, MRI, biopsy)를 통해 악성의심 병변이 악성인지 확인하고, 조직 검사에서 악성의심 병변이 악성이면, 수술 및 치료를 진행한다. 한편, 유방촬영영상에서 악성으로 의심되는 병변이 판독되었지만, 조직 검사 (biopsy)에서 양성으로 판별(false positive)될 수 있다. 이 경우, 환자는 양성 판별에 안도할 수 있지만 양성 확진 전까지 심리적으로 불안한 상 태에 놓이게 되고, 영상촬영이나 조직 검사 등의 추가 검사에 비용을 지출하게 된다. 따라서, 환자를 위해 정확 한 영상 판독이 중요한데, 숙련된 의사라고 할지라도 영상에서 악성의심 병변을 추가 검사 없이 양성으로 판독 하는 것이 쉽지 않다. 하지만, 실제 학계 보고에 따르면, 유방촬영술의 경우, 영상 판독에서 악성으로 의심되는 병변에 대한 추가 검사에서, 약 90~95% 정도가 false positive라는 보고가 있는 점으로 볼 때, 악성의심 병변을 악성 또는 양성으로 잘 구별하는 것이 필요하다. 최근에, 의사는 AI 기반 의료 영상 판독 기술이 구현된 진단 보조 시스템으로부터 의료 영상에 포함된 악성 병 변 정보를 제공받고, 이를 참고하여 진단할 수 있다. 딥러닝 기반의 Mammography CAD(computer aided detection/diagnosis)는 점차 악성 병변을 검출하는 성능이 향상되어 false positive rate를 낮출 수 있다. 한편, 지금까지의 진단 보조 시스템은 악성 병변을 검출하도록 학습되기 때문에, 악성 병변 검출 성능이 향상되 고 있지만, 악성이 아니라고 판단한 병변 정보를 제공하지 않아서 다음과 같이 새로운 문제점이 대두되고 있다. 의사는 의료 영상에서 악성으로 의심되는 병변이 보이지만, 진단 보조 시스템에서는 악성으로 검출되지 않은 경 우, 의사는, 진단 보조 시스템이 악성 병변을 제대로 검출하지 못한 것인지, 양성이라서 악성으로 검출하지 않 은 것인지 알 수 없다. 특히, 숙련도가 낮은 의사이거나, 해당 분야의 판독의가 아닌 경우, 추가 검사를 통해 양성으로 진단될 병변을 악성으로 의심할 가능성이 더 높아져, 진단 보조 시스템이 악성 병변을 제대로 검출하 지 못한 것으로 오해할 수 있다. 이러한 문제는 현재 AI 기반 의료 영상 판독 제품의 활용에 장애가 될 수 있어 서, 의료진이 판독 결과를 신뢰할 수 있는 새로운 인공지능 모델이 필요하다. 이러한 문제를 해결하기 위해, 악성으로 의심되는 병변이지만, 영상 판독으로 양성 병변과 악성 병변을 구별하 도록 인공지능 모델을 학습시키고, 추가검사 없이도 인공지능 모델을 이용하여 양성인 악성의심 병변에 대한 정보를 판독 결과로 제공하는 방법에 대해 다음에서 자세히 설명한다. 도 1은 한 실시예에 따른 인공지능 모델의 훈련 데이터를 설명하는 도면이다. 도 1을 참고하면, 인공지능 모델은 학습 데이터를 기초로, 분류 클래스에 해당하는 의료 영상의 특징을 학습하 고, 특징을 기초로 병변/질병을 복수의 클래스들로 분류하는 태스크에 대해 학습한다. 복수의 클래스들은 그룹화가 가능하고, 계층 관계에 따라 분류될 수 있는 종류의 분류 클래스들이면 된다. 다음 에서 복수의 클래스들로서 병변에 대한 분류 클래스를 예로 들어 설명하고, 구체적으로 비-악성의심(non- suspicious), 악성의심(suspicious)되나 양성(악성의심-양성)(benign-hard), 그리고 악성(cancer, malignant) 을 포함한다고 가정한다. 악성의심-양성(benign-hard)과 악성(cancer)은 악성의심(suspicious) 클래스에 속하고, 악성의심(suspicious)의 하위 계층에 해당한다. 정상(normal)과 명백한 양성(benign-easy)은 비-악성의 심(non-suspicious) 클래스에 속하고, 비-악성의심(non-suspicious)의 하위 계층에 해당한다. 한편, 인공지능 모델은, 정상(normal)과 명백한 양성(benign-easy)을 구분하지 않고, 이들을 비-악성의심 클래스로 분류할 수 있다. 추가적으로, 인공지능 모델은, 의료 영상을 악성(cancer)과 비-악성으로 분류하거나, 의료 영상을 양성 (benign)과 비-양성으로 분류할 수 있다. “benign-hard”와 “benign-easy”는 양성(benign)으로의 판독 난이 도를 나타낸 것으로서, 악성의심-양성과 명백한 양성을 구분하기 위해 필요 시 영어 병기한다. 악성은 설명의 편의를 위해 “cancer”로만 영어 병기한다. 여기서, 명백한 양성(benign-easy) 병변은 영상 판독에서 악성으로 의심되지 않아서 양성으로 판독하기 쉬운 양 성 병변을 의미한다. 악성의심-양성(benign-hard) 병변은 영상 판독에서 악성으로 의심되지만 추가 검사에서 양 성으로 진단될 병변으로서, 양성으로 판독하기 어려운 양성 병변을 의미한다. 악성 병변은 영상 판독에서 악성 으로 의심되고 추가 검사에서 악성으로 진단될 병변을 의미한다. 이하, 설명에서 클래스 구분에 대해 분류로 표현하나, 구분은 구별 또는 분류로 표현될 수도 있다. 따라서, “ 구분”, “구별”, “분류”는 혼용될 수 있고, 서로 치환될 수 있다. 인공지능 모델을 학습시키기 위한 학습 데이터는 각 의료 영상과 이의 분류 클래스가 어노테이션된 레이블 (label)로 구성된다. 예를 들어, 학습 데이터는 정상(normal), 명백한 양성(benign-easy), 악성의심-양성 (benign-hard), 악성(cancer)이 어노테이션된 의료 영상들일 수 있다. 이때, 정상(normal)이 어노테이션된 영상 과 명백한 양성(benign-easy)이 어노테이션된 영상에 비-악성의심(non-suspicious)이 추가로 어노테이션될 수 있다. 악성의심-양성(benign-hard)이 어노테이션된 영상과 악성(cancer)이 어노테이션된 영상에 악성의심 (suspicious)이 추가로 어노테이션될 수 있다. 정상(normal)인 영상은, 영상 판독에서 정상으로 판독된 영상으로서, 정확성을 높이기 위해, 일정 시간(예를 들 면, 1년) 이후에 촬영된 영상에서도 정상으로 확인된 환자들의 영상들이 학습 데이터로 수집될 수 있다. 명백한 양성(benign-easy)인 영상은, 영상 판독에서 양성으로 판독된 영상으로서, 정확성을 높이기 위해, 일정 시간(예를 들면, 1년) 이후에 촬영된 영상에서도 여전히 양성으로 확인된 환자들의 영상들이 학습 데이터로 수 집될 수 있다. 악성의심-양성(benign-hard)인 영상은, 영상 판독에서 악성의심되어 추가검사(예를 들면, 조직검사)를 진행했으 나 최종 양성으로 진단된 영상이다. 악성(cancer)인 영상은, 영상 판독에서 악성의심되어 추가검사를 진행한 결과, 최종 악성으로 진단된 영상이다. 한편, 정상(normal), 명백한 양성(benign-easy), 악성의심-양성(benign-hard), 악성(cancer)이 어노테이션된 의료 영상들이 학습 데이터로 수집된다고 하더라도, 알려진 일반적인 분류(classification) 모델로는 의료 영상 에서 양성인 악성의심 병변(benign-hard)과 악성 병변(cancer)을 구별하는 것이 쉽지 않다. 예를 들어, 분류 모델이, 입력 영상을 비-악성의심(non-suspicious), 악성의심-양성(benign-hard), 그리고 악성 (cancer)으로 분류하는 태스크에 대해 학습하는 경우, 악성의심-양성(benign-hard)/악성(cancer)과 비-악성의심 (non-suspicious)을 구별하는 것에 비해, 악성의심-양성(benign-hard)과 악성(cancer)을 구별하는 것이 훨씬 어렵다. 따라서, 분류 모델이 악성의심-양성(benign-hard)과 악성(cancer)을 분류하는 학습을 잘 하지 못하고, 비-악성의심(non-suspicious)을 분류하는 학습에만 집중할 수 있다. 또는 분류 모델이 입력 영상을 비-악성의심(non-suspicious)과 악성의심(suspicious)으로 분류하는 모델, 그리 고 입력 영상을 악성(cancer)와 비악성(non-cancer)으로 분류하는 모델로 구성될 수 있다. 이 분류 모델은 입력영상에 대해 두 모델에서 각각 분류된 결과를 출력하는데, 악성의심 확률과 악성 확률이 상관관계없이 독립적으 로 계산되므로, 두 모델의 예측 결과가 충돌될 수 있다. 예를 들어, 입력 영상에 대한 악성의심 확률이 0.1인데 악성 확률이 0.9로 예측되는 경우, 혼란스러운 판독 결과가 나올 수 있다. 이러한 문제를 해결하기 위해, 본 개시는, 정상(normal), 명백한 양성(benign-easy), 악성의심-양성(benign- hard), 악성(cancer)이 어노테이션된 의료 영상들을 상위 분류 클래스인 악성의심(suspicious)과 비-악성의심 (non-suspicious)으로 그룹핑한 후, 계층적으로 그룹핑된 학습 데이터를 인공지능 모델의 분류 모델들 학습에 사용한다. 이때, 인공지능 모델의 분류 모델들 각각은 분류 클래스에 적합하게 그룹핑된 학습 데이터를 독립적으로 학습하 여, 학습 난이도가 다른 분류 클래스에 의해 발생할 수 있는 학습 편차를 해소할 수 있다. 그리고, 독립적으로 학습된 분류 모델들은 계층 관계가 있어서, 상위 분류 모델의 분류 결과에 따라 하위 분류 모델의 분류 결과가 판독 결과에 반영되므로, 독립적으로 동작하는 분류 모델들의 예측 확률을 충돌 없이 제공할 수 있다. 다음에서, 학습 데이터를 이용하여, 의료 영상에서 악성으로 의심되는 병변을 구별하고, 악성의심 병변을 악성 또는 양성으로 구별하는 인공지능 모델, 인공지능 모델을 학습시키는 방법, 그리고 이를 구현한 컴퓨팅 장치에 대해 자세히 설명한다. 도 2는 한 실시예에 따른 인공지능 모델을 학습시키는 방법을 설명하는 개념도이고, 도 3은 한 실시예에 따른 인공지능 모델의 독립적 학습을 설명하는 도면이다. 도 2를 참고하면, 컴퓨팅 장치는 학습 데이터를 이용하여, 인공지능 모델을 구성하는 특징 추출 모델(Feature extractor) 및 브랜치 분류 모델들(130, 150, 170)을 분류 태스크에 따라 독립적으로 학습 시킨다. 학습 데이터는 정상(normal), 명백한 양성(benign-easy), 악성의심-양성(benign-hard), 악성 (cancer)이 어노테이션된 의료 영상들을 포함하고, 이들은 상위 분류 클래스인 비-악성의심(non-suspicious)과 악성의심(suspicious)으로 그룹핑되어 있다. 의료 영상들에 비-악성의심(non-suspicious)과 악성의심 (suspicious)이 레이블로 어노테이션되어 있을 수 있다. 브랜치 분류 모델들의 수는 분류 클래스, 모델 설계 중 적어도 하나에 따라 다양하게 선택될 수 있다. 특징 추출 모델은 입력 영상의 특징을 추출하는 신경망 모델로서, 컨볼루션 신경망(Convolutional Neural Network, CNN) 모델을 포함할 수 있다. 특징 추출 모델은 입력 영상에서 다양한 종류의 병변을 검출하도록 학습될 수 있다. 예를 들면, 특징 추출 모델은 입력 영상에서, 병변을 검출하기 위한 특징을 추출하도록 학습될 수 있고, 입력 영상에서 병변을 검출하기 위한 특징을 추출할 수 있다. 브랜치-1(branch-1) 분류 모델은 전체 학습 데이터를 이용하여, 입력 영상 특징을 악성의심과 비-악성 의심으로 분류하는 태스크를 학습한다. 예를 들면, 브랜치-1 분류 모델은 특징 추출 모델이 추출한 특징을 기초로, 입력 영상의 특징을 악성의심과 비-악성의심으로 분류하는 태스크를 학습할 수 있다. 브랜치-1 분류 모델은 입력 영상 특징의 악성의심 확률 p(suspicious)를 출력할 수 있다. 브랜치-1 분류 모델 은 입력 영상 특징을 완전 연결하는 레이어(Fully-connected layer)(512x1)와 악성의심 확률 p(suspicious)을 출력하는 활성 함수(예를 들면, sigmoid function)로 구성될 수 있다. 브랜치-2(branch-2) 분류 모델은 전체 학습 데이터 중 악성의심 레이블을 가진 영상들을 이용하여, 입 력 영상 특징을 악성과 악성의심-양성으로 분류하는 태스크를 학습한다. 예를 들면, 브랜치-2 분류 모델은 특징 추출 모델이 추출한 특징을 기초로, 입력 영상의 특징을 악성과 악성의심-양성으로 분류하는 태스크 를 학습할 수 있다. 브랜치-2 분류 모델은 입력 영상 특징을 완전 연결하는 레이어(Fully-connected layer)(512x1), 그리고 활성 함수(예를 들면, sigmoid function)로 구성될 수 있다. 브랜치-1 분류 모델 및 브랜치-2 분류 모델 이외에도, 컴퓨팅 장치가 적어도 하나의 추가 브랜 치 분류 모델을 학습시킬 수 있다. 추가 브랜치 분류 모델에 대해서는 이하 설명한다. 도 3을 참고하면, 컴퓨팅 장치는, 브랜치-1 분류 모델, 브랜치-2 분류 모델, 그리고 추가 브랜치 분류 모델 각각이 특징 추출 모델에 연결된 신경망 모델을 학습시킨다. 즉, 학습 시, 특징 추출 모델 의 컨볼루션 레이어들은 공유되고, 특징 추출 모델에서 출력된 특징들은 분기되어 각 태스크를 수행 하는 브랜치 분류 모델로 입력된다. 각 브랜치 분류 모델의 학습은 입력되는 학습 데이터의 레이블에 따라 진행 된다.특징 추출 모델는 입력 영상의 특징을 추출하는 태스크를 학습하고, 추출된 특징을 출력한다. 입력 영상의 특징은 입력 영상에서 병변을 검출하기 위한 특징일 수 있다. 추출된 특징은 브랜치 분류 모델들(130, 150, 170)로 입력된다. 이때, 입력 영상의 레이블에 따라 학습하는 브랜치 분류 모델이 달라질 수 있다. 전체 학습 데이터의 특징들과 레이블(suspicious, non-suspicious)은, 입력 영상 특징을 악성의심과 비-악성의심으로 분류하는 태스크를 학습하는 브랜치-1 분류 모델로 입력되고, 브랜치-1 분류 모델은 각 특징에 매핑 된 레이블(suspicious, non-suspicious)을 출력하는 분류 학습을 한다. 전체 학습 데이터 중 악성의심 그룹 의 특징들과 레이블(benign-hard, cancer)은, 입력 영상 특징을 악성의심-양성과 악성으로 분류하는 태스크를 학습하는 브랜치-2 분류 모델로 입력되고, 브랜치-2 분류 모델은 각 특징에 매핑된 레이블(benign- hard, cancer)을 출력하는 분류 학습을 한다. 구체적으로, 인공지능 모델을 구성하는 특징 추출 모델, 브랜치 분류 모델들(130, 150, 170)은 컴퓨 팅 장치에 의해 다음과 같이 학습될 수 있다. 특징 추출 모델는 입력 영상의 특징을 추출하는 컨볼루션 레이어들로 구성된 신경망 모델이고, 전체 학습 데이터를 이용하여, 영상에서 병변을 검출하기 위한 특징을 추출하는 학습을 한다. 특징 추출 모델는 예를 들면, CNN 기반의 ResNet으로 구현될 수 있고, 출력되는 특징 맵의 차원은 512일 수 있다. 브랜치-1 분류 모델은 전체 학습 데이터의 영상들과 레이블을 이용하여, 입력 영상을 비-악성의심 (non-suspicious)과 악성의심(suspicious)으로 분류하는 학습을 한다. 학습 데이터는 비-악성의심(non- suspicious)이 어노테이션된 영상들과 악성의심(suspicious)이 어노테이션된 영상들일 수 있다. 즉, 브랜치-1 분류 모델은 전체 학습 데이터를 이용하여 상위 클래스의 분류 태스크를 학습한다. 브랜치-1 분류 모델은 악성의심(suspicious)에 해당하는 분류 결과를 POSITIVE로 출력할 수 있고, 악성의 심 확률 p(suspicious)을 출력할 수 있다. 브랜치-1 분류 모델은 입력 영상 특징을 완전 연결하는 레이어 (Fully-connected layer)(512x1)와 악성의심 확률 p(suspicious)을 출력하는 활성 함수(예를 들면, sigmoid function)로 구성될 수 있다. 브랜치-2 분류 모델은 전체 학습 데이터 중 악성의심 그룹의 영상들과 레이블을 이용하여, 입력 영상 을 악성(cancer)과 악성의심-양성(benign-hard)으로 분류하는 학습을 한다. 악성의심 그룹은 악성의심-양성 (benign-hard) 또는 악성(cancer)이 어노테이션된 영상들일 수 있다. 즉, 브랜치-2 분류 모델은 전체 학습 데이터 중에서, 악성의심으로 분류된 영상들만을 이용하여 하위 클래스의 분류 태스크를 학습한다. 브랜치-2 분류 모델은 악성에 해당하는 분류 결과를 POSITIVE로 출력할 수 있다. 브랜치-2 분류 모델(15 0)은 입력 영상 특징을 완전 연결하는 레이어(Fully-connected layer)(512x1), 그리고 활성 함수(예를 들면, sigmoid function)로 구성될 수 있다. 이때, 브랜치-2 분류 모델은 악성의심 그룹에서 악성을 분류한 것이 므로, 활성 함수는 악성의심이라는 가정에서 악성인 조건부 확률 p(cancer|suspicious)을 출력할 수 있다. 추가 브랜치 분류 모델는 전체 학습 데이터 중에서 분류 태스크에 따라 선택된 영상들과 레이블을 이 용하여, 해당 분류 태스크를 학습할 수 있다. 예를 들면, 추가 브랜치 분류 모델는 전체 학습 데이터 중 정상(normal) 또는 명백한 양성(benign-easy)이 어노테이션된 영상들을 이용하여, 입력 영상을 정상(norma l)과 명백한 양성(benign-easy)으로 분류하는 학습을 할 수 있다. 또는 추가 브랜치 분류 모델는 전체 학 습 데이터 중 양성(benign-easy, benign-hard)과 기타(정상 또는 악성)가 어노테이션된 영상들을 이용하여, 입력 영상에서 양성 병변을 분류하는 학습을 할 수 있다. 추가 브랜치 분류 모델 역시, 입력 영상 특징을 완전 연결하는 레이어, 그리고 활성 함수로 구성될 수 있다. 이와 같이, 인공지능 모델을 구성하는 브랜치 분류 모델들(130, 150, 170) 각각은 해당 분류 태스크에 적 합한 학습 데이터를 통해 독립적으로 학습한다. 따라서, 인공지능 모델을 학습시킬 때, 더 쉬운 태스크로 학습이 집중되지 않고, 브랜치-1 분류 모델과 브랜치-2 분류 모델 각각이 해당 태스크를 균형적으로 학습할 수 있다. 독립적으로 학습된 브랜치 분류 모델들은 검출된 병변에 대한 악성의심 확률 p(suspicious), 악성으로 분류된 확률 p(cancer|suspicious) 등을 출력하는데, 상위 분류 모델인 브랜치-1 분류 모델의 분류 결과에 따라, 하위 분류 모델인 브랜치-2 분류 모델이나 추가 브랜치 분류 모델의 분류 결과가 판독 결과에 반영되 거나 반영되지 않을 수 있다. 이러한 계층적 분류를 통해 인공지능 모델은 입력된 의료 영상의 병변을 다 양한 클래스들로 구별할 수 있다. 도 4는 한 실시예에 따른 인공지능 모델을 이용한 계층적 분류 방법을 설명하는 개념도이다. 도 4를 참고하면, 인공지능 모델은, 분류 클래스에 맞게 선택된 분류 모델들이 조합된 구조로 구현될 수 있다. 예를 들면, 인공지능 모델은 입력된 의료 영상의 특징을 추출하는 특징 추출 모델, 특징 추출 모델 에서 추출된 특징을 비-악성의심(non-suspicious)과 악성의심(suspicious)으로 분류하는 브랜치-1 분류 모 델, 그리고 특징 추출 모델에서 추출된 특징을 악성의심-양성(benign-hard)과 악성(cancer)으로 분류 하는 브랜치-2 분류 모델을 포함한다. 이외에도, 인공지능 모델은 특징 추출 모델에서 추출된 특징을 정상(normal)과 명백한 양성(benign-easy)으로 분류하는 추가 브랜치 분류 모델(미도시)을 더 포함할 수 있다. 특징 추출 모델는 입력 영상에서 병변을 검출하기 위한 특징을 추출하도록 학습된 신경망 모델로서, 입력 영상의 특징을 출력한다. 신경망 모델은 컨볼루션 신경망(CNN) 모델일 수 있고, 예를 들면, CNN 기반의 ResNet 으로 구현될 수 있다. 브랜치-1 분류 모델은 입력 영상 특징을 악성의심(suspicious)과 비-악성의심(non-suspicious)으로 분류하 는 태스크로 학습된 모델로서, 악성의심(suspicious)으로 분류된 경우 분류 결과를 POSITIVE로 출력할 수 있고, 악성의심 확률 p(suspicious)을 출력할 수 있다. 브랜치-2 분류 모델은 입력 영상 특징을 악성(cancer)과 악성의심-양성(benign-hard)으로 분류하는 태스크 로 학습된 모델로서, 악성으로 분류된 경우 분류 결과를 POSITIVE로 출력할 수 있다. 이때, 브랜치-2 분류 모델 은 악성의심으로 분류된 학습 영상들에서 악성 병변을 분류하도록 학습되었으므로, 브랜치-2 분류 모델 에서 출력되는 확률은 입력 영상이 악성의심이라는 가정에서 악성으로 분류된 조건부 확률 p(cancer|suspicious)을 출력할 수 있다. 추가적으로 인공지능 모델이 브랜치-1 분류 모델의 하위에 비-악성의심(non-suspicious)으로 분류된 특징을 정상(normal)과 명백한 양성(benign-easy)으로 분류하는 추가 브랜치 분류 모델(미도시)을 더 포함할 수 있다. 이와 같이, 인공지능 모델은 분류 클래스에 맞게 선택된 분류 모델들(130, 150)로 구성되고, 각 분류 모델 에서 입력 영상에 대한 분류 결과를 출력한다. 분류 결과는 병변에 대한 POSITIVE/NEGATIVE, 그리고 POSITIVE 확률/NEGATIVE 확률 등을 포함할 수 있다. 컴퓨팅 장치는 인공지능 모델에서 출력된 분류 결과를 이용하여, 입력 영상에서 검출된 병변이 악성의 심인지 확인하고, 악성의심으로 분류된 경우, 양성인지 악성인지 순차적으로 판단한다. 즉, 브랜치-1 분류 모델 의 분류 결과가 악성의심이면, 컴퓨팅 장치는 브랜치-2 분류 모델의 분류 결과를 확인해서 악성 또는 양성인지 판단한다. 만약, 브랜치-1 분류 모델의 분류 결과가 비-악성의심이면, 컴퓨팅 장치는 브랜치-2 분류 모델의 분류 결과를 확인할 필요 없이, 비-악성의심 확률을 출력한다. 브랜치-1 분류 모델 의 분류 결과가 악성의심이면, 브랜치-2 분류 모델의 분류 결과가 유효하게 판독 결과에 반영되지만, 브랜치-1 분류 모델의 분류 결과가 비-악성의심이면, 브랜치-2 분류 모델의 분류 결과가 판독 결과에 반영되지 않는다. 이러한 계층적 분류를 통해 컴퓨팅 장치는 입력 영상에서 검출된 병변이 악성의심인지 아닌지를 구별한 판 독 결과, 그리고 악성의심인 경우, 추가 검사에서 양성일 악성의심-양성인지, 악성인지를 구별한 판독 결과를 출력할 수 있다. 설명의 편의 상, 컴퓨팅 장치가 인공지능 모델을 학습시키고, 학습된 인공지능 모델 을 이용하여 분석 대상 영상에 대한 판독 결과를 출력하는 것으로 설명한다. 하지만, 인공지능 모델 을 학습시키는 컴퓨팅 장치와 학습된 인공지능 모델을 이용하여 판독 결과를 출력하는 컴퓨팅 장치는 다른 장치일 수 있다. 컴퓨팅 장치는 브랜치-1 분류 모델에서 악성의심으로 분류되고, 브랜치-2 분류 모델에서 악성으 로 분류된 병변에 대해서, 표 1과 같이 계산된 병변의 악성의심 확률, 악성 확률을 포함하는 판독 결과를 출력 할 수 있다. 컴퓨팅 장치는 브랜치-1 분류 모델에서 악성의심으로 분류되고, 브랜치-2 분류 모델(15 0)에서 악성의심-양성으로 분류된 병변에 대해서, 표 1과 같이 계산된 병변의 악성의심 확률, 악성의심-양성 확 률을 포함하는 판독 결과를 출력할 수 있다. 악성의심 확률 p(suspicious)은 브랜치-1 분류 모델에서 획득 될 수 있다. 악성의심 조건에서 악성으로 분류된 조건부 확률 p(cancer|suspicious)은 브랜치-2 분류 모델에서 획득될 수 있다. 판독 결과에서, 악성의심-양성 확률은 간단히 양성 확률로 표시될 수 있다. 표 1 판독 결과 정보 확률값 계산 악성의심 확률 p(suspicious) 악성 확률 p(suspicious)* p(cancer|suspicious) 악성의심-양성 확률 p(suspicious)* (1-p(cancer|suspicious)) 이처럼, 인공지능 모델의 브랜치-2 분류 모델은 브랜치-1 분류 모델과 독립적으로 학습하고 분 류 결과를 출력하지만, 브랜치-1 분류 모델의 분류 결과에 의존하여 분류 결과가 판독 결과에 반영된다. 특히, 브랜치-2 분류 모델에서 출력되는 POSITIVE 확률은, 악성의심이라는 가정에서 악성인 조건부 확률이 라서, 악성 확률은 악성의심 확률 p(suspicious)보다 작거나 같은 값을 가진다. 예를 들어, 악성의심 확률이 0.7 일 경우, 악성 확률은 0.7* p(cancer|suspicious)이므로, 반드시 0.7이하가 된다. 따라서, 병변에 대한 악 성의심 확률과 악성 확률이 충돌하지 않는다. 이외에도, 컴퓨팅 장치는 추가 브랜치 분류 모델을 통해, 입력 영상에 포함된 병변이 비-악성의심인 경우, 명백한 양성인지, 정상인지를 구별한 판독 결과를 출력할 수 있다. 컴퓨팅 장치는 브랜치-1 분류 모델(13 0)에서 비-악성의심으로 분류되고, 추가 브랜치 분류 모델에서 명백한 양성 또는 정상으로 분류된 병변에 대해 서, 표 2와 같이 계산된 병변의 비-악성의심 확률, 양성 확률, 명백한 양성 확률을 포함하는 판독 결과를 출력 할 수 있다. 판독 결과에서, 명백한 양성 확률은 간단히 양성 확률로 출력될 수 있다. 표 2 판독 결과 정보 확률값 계산 비-악성의심 확률 1-p(suspicious) 명백한 양성 확률 (1-p(suspicious))* p(benign|non-suspicious) 정상 확률 (1-p(suspicious))* (1-p(benign|non-suspicious)) 이와 같이 학습된 인공지능 모델을 통해 입력 영상의 판독 결과를 제공하는 컴퓨팅 장치는 악성 병변 뿐만 아니라, 악성의심 병변이지만 추가 검사에서 양성일 것으로 예측되는 병변(악성의심-양성)까지 판독 결과 로 제공한다. 이외에도 분류 클래스에 맞게 선택된 분류 모델들이 조합된 인공지능 모델을 통해, 컴퓨팅 장치는 분류 모델들의 분류 결과들 중에서, 분류 클래스의 계층에 따라 유효한 분류 결과를 획득하고, 유효 한 분류 결과들을 이용하여 입력 영상에 대한 다양한 판독 결과를 제공할 수 있다. 따라서, 악성의심-양성을 비롯한 다양한 분류 클래스를 판독 결과로 제공하는 컴퓨팅 장치는 악성의심 병변 을 놓치지 않고 분석하였음을 표시하여 판독 결과의 신뢰성을 높일 수 있다. 또한, 환자는 양성인 악성의심 병 변에 대한 추가 검사를 하지 않아도 된다. 도 5는 한 실시예에 따른 의료 영상에서 악성의심 병변을 구별하는 인공지능 모델을 학습시키는 방법의 흐름도 이다. 도 5를 참고하면, 컴퓨팅 장치는 병변에 대한 상위 및 하위 분류 클래스를 레이블로 가지는 의료 영상들을 학습 데이터로 저장한다(S110). 병변에 대한 하위 분류 클래스는, 예를 들면, 정상(normal), 명백한 양성 (benign-easy), 악성의심-양성(benign-hard), 악성(cancer)일 수 있다. 상위 분류 클래스는 악성의심 (suspicious)과 비-악성의심(non-suspicious)일 수 있고, 정상(normal) 및 명백한 양성(benign-easy)의 하위 분류 클래스가 어노테이션된 영상들은 비-악성의심(non-suspicious) 클래스로 그룹핑된다. 악성의심-양성 (benign-hard) 및 악성(cancer)의 하위 분류 클래스가 어노테이션된 영상들은 악성의심(suspicious) 클래스로 그룹핑된다. 컴퓨팅 장치는 복수의 브랜치 분류 모델들의 계층적 분류 태스크들에 따라 학습 데이터를 구분한다(S120). 복수의 브랜치 분류 모델들은 인공지능 모델의 특징 추출 모델에 병렬 연결되고, 계층적 분류 태스크들은 다양하게 설정될 수 있다. 컴퓨팅 장치는 입력 영상의 레이블에 따라 복수의 브랜치 분류 모델들 중 적어도 하나의 브랜치 분류 모델 을 독립적으로 학습시킨다(S130). 컴퓨팅 장치는, 특징 추출 모델에서 출력된 특징들이 분기되어 복수의 브랜치 분류 모델들 각각으로 입력되는 모델을 구성하여, 특징 추출 모델 및 복수의 브랜치 분류 모델들을 학습시 킬 수 있다. 입력 영상을 비-악성의심과 악성의심으로 분류하는 태스크의 학습 데이터로서 전체 학습 데이터가 사용되고, 상 위 분류 클래스에 해당하는 레이블이 지도학습에 이용될 수 있다. 따라서, 컴퓨팅 장치는 도 3과 같이 특징 추출 모델에서 출력된 전체 학습 데이터의 특징을 브랜치-1 분류 모델로 분기하여, 브랜치-1 분류 모 델이 입력 특징을 해당 레이블(비-악성의심, 악성의심)로 분류하도록 학습시킬 수 있다. 입력 영상을 악성과 악성의심-양성으로 분류하는 태스크의 학습데이터로서, 전체 학습 데이터 중 악성의심 그룹 의 영상들이 사용되고, 병변에 대한 분류 클래스(하위 클래스)에 해당하는 레이블이 지도학습에 이용될 수 있다. 따라서, 컴퓨팅 장치는 특징 추출 모델에서 출력된 전체 학습 데이터의 특징 중 악성의심 그룹 의 특징을 브랜치-2 분류 모델로 분기하여, 브랜치-2 분류 모델가 입력 특징을 해당 레이블(악성의심 -양성, 악성)로 분류하도록 학습시킬 수 있다. 입력 영상을 정상과 명백한 양성으로 분류하는 태스크의 학습데이터는 전체 학습 데이터 중 비-악성의심 그룹의 영상들이고, 병변에 대한 분류 클래스(하위 분류 클래스)에 해당하는 레이블이 지도학습에 이용될 수 있다. 따 라서, 컴퓨팅 장치는 특징 추출 모델에서 출력된 전체 학습 데이터의 특징 중 비-악성의심 그룹의 특 징을 추가 브랜치 분류 모델로 분기하여, 추가 브랜치 분류 모델가 입력 특징을 해당 레이블(정상, 명백한 양성)으로 분류하도록 학습시킬 수 있다. 인공지능 모델을 구성하는 복수의 브랜치 분류 모델들이 학습 완료되면, 분류 클래스에 맞게 선택된 분류 모델들이 조합된 구조로 인공지능 모델이 구현될 수 있다. 도 6은 한 실시예에 따른 인공지능 모델을 이용하여 의료 영상의 판독 결과를 제공하는 방법의 흐름도이다. 도 6을 참고하면, 컴퓨팅 장치는, 입력 영상에서 검출된 병변(타겟 병변)이 악성의심 병변인지 판단하고, 악성의심 병변을 악성 또는 양성으로 분류하도록 학습된 인공지능 모델을 저장한다(S210). 인공지능 모델 은 예를 들면, 도 4와 같이, 특징 추출 모델, 특징 추출 모델에서 출력된 입력 영상 특징을 입 력받고 이를 비-악성의심과 악성의심으로 분류하는 브랜치-1 분류 모델, 입력 영상 특징을 입력받되 이를 악성의심 조건에서 악성의심-양성과 악성으로 분류하는 브랜치-2 분류 모델를 포함할 수 있다. 컴퓨팅 장치는 분석 대상 영상을 입력받는다(S220). 컴퓨팅 장치는 복수의 분류 모델들이 병렬로 구성된 인공지능 모델을 이용하여, 분석 대상 영상에서 검출된 병변의 정보(위치 등), 검출 병변에 대한 상위 분류 결과(악성의심/비-악성의심) 및 하위 분류 결과(악 성의심-양성/악성)를 획득한다(S230). 컴퓨팅 장치는 인공지능 모델에서 획득한 상위 분류 결과가 악성의심인지 판단한다(S240). 컴퓨팅 장 치는 인공지능 모델을 구성하는 복수의 분류 모델들 중에서, 상위 분류 클래스를 출력하는 분류 모델 의 결과를 먼저 확인한다. 컴퓨팅 장치는 상위 분류 결과가 악성의심인 경우, 표 1과 같이 악성의심 확률과 하위 분류 결과(악성의심- 양성/악성)를 이용하여 검출 병변에 대한 악성의심-양성 확률/악성 확률을 계산한다(S250). 컴퓨팅 장치는 분석 대상 영상에서 검출된 병변의 정보, 분류 클래스, 검출 병변에 해당하는 악성의심-양성 확률/악성 확률을 포함하는 판독 결과를 생성한다(S252). 판독 결과는 악성의심 확률을 더 포함할 수 있다. 분 류 클래스는 계층별 분류 클래스를 포함할 수 있고, 예를 들면, 상위 계층(제1 계층)의 분류 클래스인 “악성의 심”, 이의 하위 계층(제2 계층)의 분류 클래스인 “약성의심-양성” 또는 “악성”을 포함할 수 있다. 컴퓨팅 장치는 상위 분류 결과가 비-악성의심인 경우, 비-악성의심 확률을 획득하고, 분석 대상 영상에서 검출된 병변의 정보, 분류 클래스, 비-악성의심 확률을 포함하는 판독 결과를 생성한다(S260). 분류 클래스는 “비-악성의심”일 수 있다. 만약, 인공지능 모델이 비-악성의심의 하위 분류를 수행하는 추가 브랜치 모 델을 더 포함하는 경우, 비-악성의심 병변에 대해 제공되는 판독 결과는 비-악성의심의 하위 분류 결과를 더 포 함할 수 있다. 컴퓨팅 장치는 검출 병변의 정보, 검출 병변의 분류 클래스, 검출 병변의 분류 확률(예를 들면, 악성의심 확률, 악성의심-양성 확률, 악성 확률, 비-악성의심 확률 중 적어도 하나)을 포함하는 판독 결과를 화면에 출력 한다(S270). 컴퓨팅 장치는 검출 병변이 악성으로 분류되면, 악성 병변 위치와 악성 확률을 판독 결과로 제공할 수 있다. 또한, 컴퓨팅 장치는 검출 병변이 양성이지만 악성의심 병변에 속하면, 검출 병변이 악성의 심-양성 병변이라는 표시 정보, 악성의심 확률, 악성의심-양성 확률을 판독 결과로 제공할 수 있다. 컴퓨팅 장 치는 검출 병변이 비-악성의심 병변에 속하면, 검출 병변이 비-악성의심 병변이라는 표시 정보, 비-악성의 심 확률을 판독 결과로 제공할 수 있다. 만약, 분석 대상 영상에서 검출된 병변이 없는 경우, 컴퓨팅 장치 는 이에 대한 판독 결과를 제공할 수 있다. 이와 같이, 컴퓨팅 장치는 판독 결과 화면에서, 검출 병변을 분류 클래스별로 구분하여 표시할 수 있다. 특 히, 검출 병변이 악성으로 의심되나 양성인 악성의심-양성으로 분류된 경우, 컴퓨팅 장치는 해당 병변에 대 해 악성의심-양성 또는 양성이라는 표시를 제공할 수 있다. 도 7은 한 실시예에 따른 컴퓨팅 장치의 구성도이다. 도 7을 참고하면, 컴퓨팅 장치는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 프로그램을 로드하는 메모리, 프로그램 및 각종 데이터를 저장하는 스토리지, 통신 인터페이스, 그리고 이들을 연결하는 버스를 포함할 수 있다. 이외에도, 컴퓨팅 장치는 다양한 구성 요소가 더 포함될 수 있다. 프 로그램은 메모리에 로드될 때 프로세서로 하여금 본 개시의 다양한 실시예에 따른 방법/동작을 수행하 도록 하는 명령어들(instruction)을 포함할 수 있다. 즉, 프로세서는 명령어들을 실행함으로써, 본 개시의 다양한 실시예에 따른 방법/동작들을 수행할 수 있다. 프로그램은 기능을 기준으로 묶인 일련의 컴퓨터 판독가 능 명령어들로 구성되고, 프로세서에 의해 실행되는 것을 가리킨다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 개시의 기술 분야에 잘 알려진 임의의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 또 한, 프로세서는 본 개시의 다양한 실시예들에 따른 방법/동작을 실행하기 위한 적어도 하나의 애플리케이션 또는 프로그램에 대한 연산을 수행할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 개시의 다양한 실시예들에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 하나 이상의 프로그램을 로드할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것이나, 본 개시의 기술적 범위는 이에 한정되지 않는다. 스토리지는 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 개시가 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 통신 인터페이스는 컴퓨팅 장치의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인터 넷 통신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 개시의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 버스는 컴퓨팅 장치의 구성 요소 간 통신 기능을 제공한 다. 버스는 주소 버스(Address Bus), 데이 터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 이상에서 설명한 본 발명의 실시예는 장치 및 방법을 통해서만 구현이 되는 것은 아니며, 본 발명의 실시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2020-0052601", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 한 실시예에 따른 인공지능 모델의 학습 데이터를 설명하는 도면이다. 도 2는 한 실시예에 따른 인공지능 모델을 학습시키는 방법을 설명하는 개념도이다. 도 3은 한 실시예에 따른 인공지능 모델을 독립적으로 학습시키는 방법을 설명하는 도면이다. 도 4는 한 실시예에 따른 인공지능 모델을 이용한 계층적 분류 방법을 설명하는 개념도이다. 도 5는 한 실시예에 따른 의료 영상에서 악성의심 병변을 구별하는 인공지능 모델을 학습시키는 방법의 흐름도 이다.도 6은 한 실시예에 따른 인공지능 모델을 이용하여 의료 영상의 판독 결과를 제공하는 방법의 흐름도이다. 도 7은 한 실시예에 따른 컴퓨팅 장치의 구성도이다."}
