{"patent_id": "10-2020-0090466", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0011487", "출원번호": "10-2020-0090466", "발명의 명칭": "배터리 상태를 식별하기 위한 방법, 이를 위한 전자 장치 및 저장 매체", "출원인": "삼성전자주식회사", "발명자": "이상헌"}}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,배터리; 적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 작동적으로 연결된 메모리를 포함하며,상기 메모리는, 실행 시에, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 획득하고,복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하고,상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하도록 하는 인스트럭션들을 저장하는 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 복수의 배터리 상태들과 관련된 확률 참조 정보는, 입력된 충전 상태, 전압 및 전류에 대하여 배터리 상태별 가능도 값들을 출력하는 복수의 확률 분포 함수들을포함하는, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 상기 복수의 확률 분포 함수들을 이용하여 가능도행렬로 변환하도록 설정된, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 전체 충전 상태 중 상기 배터리의 충전 동안의 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 이용하여 학습 모델에 의해상기 배터리 상태를 식별하도록 설정된, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0011487-3-제4항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 상기 복수의 배터리 상태들과 관련된 확률 참조 정보에 적용한 결과를 이용하여 학습 모델에 의해 상기 배터리 상태를 식별하도록 설정된, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 복수의 배터리 상태들은,정상 상태, 스웰링 상태, 고온 가속 상태, 벤딩 상태, 눌림 상태 중 적어도 하나를 포함하는, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 복수의 가능도 값들의 적어도 일부를 이용하여 배터리 건전 지표를 획득하고, 상기 획득된 배터리 건전 지표에 근거하여, 상기 배터리의 이상 유무를 식별하도록 설정된, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 획득된 배터리 건전 지표를 미리 설정된 임계치와 비교하여, 상기 임계치 이하인 경우 상기 배터리의 이상을 식별하도록 설정된, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 임계치 이하인 경우 상기 배터리의 이상을 식별하여, 상기 배터리의 이상에 대한 사전 알림을 제공하도록설정된, 전자 장치."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에서 배터리 상태를 식별하기 위한 방법에 있어서, 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 획득하는 동작;복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작; 및상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작을 포함하는,배터리 이상 상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 복수의 배터리 상태들과 관련된 확률 참조 정보는, 입력된 충전 상태, 전압 및 전류에 대하여 배터리 상태별 가능도 값들을 출력하는 복수의 확률 분포 함수들을포함하는, 배터리 이상 상태를 식별하기 위한 방법.공개특허 10-2022-0011487-4-청구항 13 제12항에 있어서, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작은,상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 상기 복수의 확률 분포 함수들을 이용하여 가능도행렬로 변환하는 동작을 포함하는, 배터리 이상 상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작은,전체 충전 상태 중 상기 배터리의 충전 동안의 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작을 포함하는, 배터리 이상 상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작은,상기 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 이용하여 학습 모델에 의해상기 배터리 상태를 식별하는 동작을 포함하는, 배터리 이상 상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작은,상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 상기 복수의 배터리 상태들과 관련된 확률 참조 정보에 적용한 결과를 이용하여 학습 모델에 의해 상기 배터리 상태를 식별하는 동작을 포함하는, 배터리 이상 상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 복수의 배터리 상태들은,정상 상태, 스웰링 상태, 고온 가속 상태, 벤딩 상태, 눌림 상태 중 적어도 하나를 포함하는, 배터리 이상 상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작은,복수의 가능도 값들의 적어도 일부를 이용하여 배터리 건전 지표를 획득하는 동작; 및상기 획득된 배터리 건전 지표에 근거하여, 상기 배터리의 이상 유무를 식별하는 동작을 포함하는, 배터리 이상상태를 식별하기 위한 방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 획득된 배터리 건전 지표를 미리 설정된 임계치와 비교하는 동작; 상기 임계치 이하인 경우 상기 배터리의 이상을 식별하는 동작; 및공개특허 10-2022-0011487-5-상기 배터리의 이상에 대한 사전 알림을 제공하는 동작을 더 포함하는, 배터리 이상 상태를 식별하기 위한방법."}
{"patent_id": "10-2020-0090466", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도 하나의동작은,배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 획득하는 동작;복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작; 및상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작을 포함하는,저장 매체."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는, 배터리, 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서와 작동적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행 시에, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시의 충전 상태별 전 압 및 전류 정보를 획득하고, 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정 보에 대한 복수의 가능도 값들을 획득하고, 상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하도록 하는 인스트럭션들을 저장할 수 있다. 그 밖에 다양한 실시 예가 제공될 수 있다."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시 예는 배터리 상태를 식별하기 위한 방법, 이를 위한 전자 장치 및 저장 매체에 관한 것이다."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 폰, 태블릿 PC, 웨어러블 디바이스 등과 같은 휴대가 용이한 전자 장치의 사용이 증가하고 있으며, 전자 장치의 사용이 급증함에 따라 사용 시간을 늘이기 위한 고성능 배터리에 대한 연구가 활발히 진행되고 있다. 또 한, 배터리는 이동 환경에서 모바일 기기와 같은 전자 장치뿐만 아니라 전기 자동차(EV: electric vehicle), 로 봇과 같은 다양한 장치들에 사용되고 있다. 이러한 배터리의 일 예로, 이차전지(secondary batteries)의 일종인 리튬 이온 배터리(lithium ion batteries; LIB)는 충/방전이 가능한 구조 및 높은 에너지 밀도와 상대적으로 높 은 전압 출력 등의 장점을 바탕으로 휴대용 전자 장치를 구동하기 위한 에너지 저장 장치로 널리 이용되고 있다."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "하지만, 리튬 이온 배터리는 그 활용 용도 상 경질의 물체에 의한 눌림(dent) 혹은 관통(penetration), 외력에 의한 휘어짐(bending), 고온고습 조건 혹은 과충전/과방전과 같은 가혹 환경에 노출되었을 때 리튬을 저장하는 활물질(active material)의 구조 붕괴와 이에 수반되는 가스의 발생으로부터 기인하는 스웰링(swelling), 반복 되는 충/방전에 의한 활물질 손실과 고체전해질피막(solid electrolyte interphase layer) 과대 형성에 의해 발생하는 급격한 전압 강하와 같은 다양한 이상 상태에 노출될 수 있다. 이 중 일부는 단지 리튬 이온 배터리를 포함하는 전자 장치의 사용성, 예컨대 사용 시간의 감소, 전압 감소로 인한 성능 저하 수준의 결과를 초래할 뿐이나, 양극과 음극을 전기적으로 분리하는 분리막(separator)이 배터리 의 물리적 손상으로 혹은 리튬 수지상(dendrite) 형성에 의해 관통되는 등의 기계적/화학적 손상을 입는 경우에 는 배터리가 저장하고 있던 고밀도의 에너지가 짧은 시간 동안 격렬한 발열 반응과 함께 방출되면서 발화로 인 한 배터리 소손을 유발할 수 있다. 따라서 배터리의 안전성을 확보하기 위해 배터리 내부에서 발생하는 다양한 이상 상태를 즉시 또는 사전에 식별 할 필요가 있다."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시 예에 따르면, 전자 장치는, 배터리, 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서와 작 동적으로 연결된 메모리를 포함하며, 상기 메모리는, 실행 시에, 상기 적어도 하나의 프로세서가, 상기 배터리 의 충전 시의 충전 상태별 전압 및 전류 정보를 획득하고, 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하고, 상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하도록 하는 인스트럭션들을 저장할 수 있다. 다양한 실시 예에 따르면, 전자 장치에서 배터리 상태를 식별하기 위한 방법은, 배터리의 충전 시의 충전 상태 별 전압 및 전류 정보를 획득하는 동작, 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작 및 상기 복수의 가능도 값들에 근거하여, 상기 배터 리의 이상 유무 또는 배터리 상태를 식별하는 동작을 포함할 수 있다. 다양한 실시 예에 따르면, 명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서 에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로 서, 상기 적어도 하나의 동작은, 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 획득하는 동작, 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획 득하는 동작 및 상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작을 포함할 수 있다."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시 예에 따르면, 실제 전자 장치의 다양한 충/방전 패턴으로부터 배터리 이상을 식별할 수 있으며, 만충전 /만방전이 아닌 일부 충전 심도 구간의 데이터만으로도 배터리 이상 상태를 실시간으로 감시할 수 있다. 일 실시 예에 따르면, 과충전에 의한 스웰링 혹은 기계적 눌림 등 다양한 배터리 이상 상태 발생 및 진행 여부 를 실시간으로 감지함으로써 과도한 스웰링 진행 혹은 배터리 발화로 이어지는 배터리 손상을 사전에 방지할 수 있다. 일 실시 예에 따르면, 배터리의 수명과 다양한 환경에 대응하는 배터리 이상 상태를 실시간으로 감시하고, 이상 이 발생하기 전에 이를 표시함으로써 사용자 입장에서는 배터리 문제 상황을 한 눈에 확인할 수 있을 뿐만 아니 라 이를 사전에 인지할 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서에서 사용된 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한 정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통 상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전 에 정의된 용어들은 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시 예들을 배제하도록 해석될 수 없다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 일 실시 예에 따른 전자 장치는, 만충전/만방전이 아니더라도 일부 충전 상태 구간의 전압 및 전류 데이터를 확 률 참조 정보에 적용한 결과에 기반하여 배터리의 상태를 추정할 수 있다. 다른 실시 예에서는, 일부 충전 상태 구간의 전압 및 전류 데이터를 확률 참조 정보에 적용한 결과를 확률 분포(또는 확률 밀도, 이하 확률 분포라고 통칭함) 모델을 학습하는데 활용함으로써, 실제 충전 시 학습된 모델을 기반으로 배터리의 정상 또는 이상 상태 를 식별할 수 있다. 이에 따라 전자 장치는 실제 충전 또는 방전 시 더 빠르고 정확한 배터리 상태 식별이 가능 할 수 있으며, 게다가 배터리에 대해 발생하는 다양한 이상 상태를 즉시 또는 사전에 식별(또는 진단)할 수 있 어, 배터리의 안전성을 확보할 수 있다. 한편, 배터리는 전자 장치에 대한 사용자의 사용 패턴을 비롯하여 전기적, 화학적, 환경적 요소에 모두 영향을 받기 때문에 실제 충/방전 시의 배터리 상태를 식별하는 방법이 필요하다. 이러한 배터리 이상 상태를 식별하기 위한 방법들 중의 하나로 배터리 셀 열화도를 이용한 상태 식별 방법이 있는데, 이러한 상태 식별 방법의 경우 충전 또는 방전 중이 아닌 상태의 배터리를 식별 대상으로 하기 때문에 실제 전자 장치에 장착되는 배터리에 대 한 이상 상태를 식별하는데 있어 한계가 있을 수 있다. 또한 다른 방법으로 전압-용량 곡선의 일계도 함수가 갖 는 극대/극소점을 기준치로 하여 배터리의 이상 상태를 식별하는 방법이 있을 수 있다. 하지만, 극대점과 극소점을 특정하기 위해서는 만충전 및 만방전 데이터가 확보되어 있어야 할 뿐만 아니라 다 양한 충전 상황을 반영하지 못한 만충전 및 만방전 데이터로 인해 실제 충전 동안에는 상태 식별이 어려울 수 있다. 또 다른 방법으로 신뢰도 및 표준 편차를 이용한 배터리 상태 식별 방법이 있을 수 있는데, 이러한 상태 식별방법은 충전 시의 전압이 정규 분포를 따를 것이라는 가정 하에서 동작하므로, 실제 충전 시의 전자 장치에 적용하여 배터리 이상 상태를 식별하기에는 어려울 수 있다. 따라서 배터리 이상 상태 식별 시, 배터리를 다양한 속도로 충전하는 경우, 다양한 충전 어댑터를 사용하는 경 우, 다양한 배터리 손상 및 발화 케이스, 스로틀링(throttling) 발생 시 발열 억제를 위한 충전 전류량을 조절 하는 경우, 전자 장치에 대한 사용 패턴으로 인한 충/방전 프로파일에 차이가 발생하는 경우와 같이 다양한 충 전 시나리오를 고려할 필요가 있다. 일 실시 예에 따른 전자 장치는, 만충전/만방전이 아니더라도 일부 충전 상태 구간의 데이터를 기반으로 배터리 이상 상태를 식별하거나, 이를 확률 분포 모델의 학습 데이터로 활용하여, 실제 충전 시 학습된 모델을 기반으 로 배터리의 정상 또는 이상 상태를 식별할 수 있다. 이에 따라 전자 장치에서는 일부 충전 상태 구간의 데이터 만으로도 더 빠르고 정확한 상태 식별이 가능할 수 있으며, 배터리 내부에서 발생하는 다양한 이상 상태를 즉시 또는 사전에 식별할 수 있어, 배터리의 안전성을 확보할 수 있다. 이하, 일부 충전 상태 구간의 데이터를 이용한 배터리 상태를 식별하는 방법과 이를 위한 전자 장치의 실시 예 들을 도면들을 참고하여 자세히 설명하기로 한다. 도 2는 일 실시 예에 따르면 배터리 이상 상태를 식별하기 위한 전자 장치를 나타내는 블럭도이다. 도 2를 참조하면, 전자 장치는 충방전 회로, 프로세서, 메모리, 센서 모듈, 전력 관 리 회로 및 배터리를 포함할 수 있다. 여기서, 프로세서는 도 1의 프로세서일 수 있다. 또 는 프로세서는 도 1의 프로세서와 별도로 구현된 센서 프로세서일 수 있다. 전자 장치는 배터리 셀이 하나의 팩(pack)으로 형성된 배터리를 포함할 수 있다. 여기서, 배터리 팩 은, 배터리 셀을 격납하는 하우징을 포함하는 제품일 수 있다. 배터리 팩은, 전자 장치의 스펙에 따라서, 전자 장치에 탈부착이 가능할 수도 있으며, 또는 전자 장치와 일체형으로 전자 장치 내에 격납 될 수도 있다. 일 실시 예에 따르면, 배터리는 예를 들면, 배터리 셀이라고도 불릴 수 있으며, 충전 전류가 공급됨에 따 라 충전될 수 있고, 충전된 전력을 전자 장치에 제공함으로써 방전될 수 있다. 배터리는 전자 장치 의 본체로 전력을 공급하거나 또는 외부 충전기를 통해 전원을 충전하는 역할을 수행할 수 있다. 예를 들 어, 배터리는 약 3.3 V 내지 4.3 V 범위의 전압을 출력할 수 있다. 이에 따라 완전 충전 시에는 배터리 는 약 4.3 V의 전압을 출력하고, 완전 방전 시에는 약 3.3 V의 전압을 출력할 수 있다. 일 실시 예에 따르면, 배터리는 배터리 보호 회로(protection circuit module(PCM))를 포함할 수 있다. 배터리 보호 회로는 배터리의 성능 저하 또는 소손을 방지하기 위한 다양한 기능(예: 사전 차단 기능)들 중 하나 이상을 수행할 수 있다. 배터리 보호 회로는, 추가적으로 또는 대체적으로, 셀 밸런싱, 배터리의 용량 측정, 충방전 횟수 측정, 온도 측정, 또는 전압 측정을 포함하는 다양한 기능들을 수행할 수 있는 배터리 관리 시스템(battery management system(BMS))의 적어도 일부로서 구성될 수 있다. 일 실시 예에 따르면, 배터리의 사용 상태 정보 또는 충전 상태 정보의 적어도 일부는 센서 모듈 중 해당하는 센서(예: 전류 센서, 전압 센서, 온도 센서), 또는 전력 관리 회로를 이용하여 측정될 수 있다. 일 실시 예에 따르면, 상기 센서 모듈 중 상기 해당하는 센서(예: 전류 센서, 전압 센서, 온도 센서)는 배 터리 보호 회로의 일부로 포함되거나, 또는 이와는 별도의 장치로서 배터리의 인근에 배치될 수 있다. 일 실시 예에 따르면, 충방전 회로는 배터리에 대한 충전 동작을 수행하는 충전부와 배터리 에 대한 방전 동작을 수행하는 방전부를 포함할 수 있다. 충방전 회로는 배터리에 대한 충 전 동작 및 방전 동작을 선택적으로 실행하도록 구성될 수 있다. 충전부는 외부 충전기를 통해 공급되는 전력을 배터리에 요구되는 형태로 변환한 후 배터리에 공급할 수 있다. 방전부는 배터리로 부터 공급되는 전력을 전자 장치의 본체 예컨대, 각 구성 요소들로 공급할 수 있다. 일 실시 예에 따르면, 충방전 회로는 전력 관리 회로 또는 프로세서로부터 출력되는 제어 신호에 따라 배터리에 전력을 공급하거나 배터리로부터 공급되는 전압 또는 전류를 조절 가능하도록 스위칭 소자를 포함할 수 있 다. 일 실시 예에 따르면, 센서 모듈은 배터리에 대한 전압 및 전류를 측정하도록 구성될 수 있으며, 그 구현에 따라 배터리의 온도 또는 내부 저항을 추가적으로 측정하도록 구성될 수 있다. 일 실시 예에 따르 면, 센서 모듈은 배터리에 공급되는 충전 전류를 측정하는 전류 센서, 배터리의 양극과 음극 사 이의 단자 전압을 측정하는 전압 센서, 배터리의 온도를 측정하는 온도 센서를 포함할 수 있다. 센서 모듈 은 배터리의 전류, 전압 및 온도를 실시간으로 또는 주기적으로 반복적으로 측정할 수 있으며, 이들 중 어느 하나에 대한 측정 주기는 나머지에 대한 측정 주기와 동일 또는 상이할 수 있다. 일 실시 예에 따르면, 전력 관리 회로 및/또는 프로세서는 예를 들어, 센서 모듈을 이용하여 배 터리의 상태(예: 전압, 전류 및 온도)를 실시간 또는 주기적으로 모니터링하여, 배터리의 상태에 따 라 충방전 회로에 의해 실행 가능한 동작들을 개별적으로 제어할 수 있다. 일 실시 예에 따르면, 전력 관 리 회로 및/또는 프로세서는 배터리의 상태를 측정한 정보에 적어도 일부 기반하여 배터리(28 9)의 충전과 관련된 충전 상태 정보(예: 수명, 과전압, 저전압, 과전류, 과충전, 과방전(over discharge), 과열, 단락, 또는 스웰링(swelling))를 결정할 수 있다. 일 실시 예에 따르면, 전력 관리 회로 및/또는 프로세서는 상기 결정된 충전 상태 정보에 적어도 일 부 기반하여 배터리의 정상 또는 이상 여부를 판단할 수 있다. 배터리의 상태가 이상으로 판단되는 경우, 전력 관리 모듈 및/또는 프로세서는 배터리에 대한 충전을 조정(예: 충전 전류 또는 전압 감소, 또는 충전 중지)할 수 있다. 일 실시 예에 따르면, 전력 관리 모듈의 기능들 중 적어도 일부 기능은 외부 제어 장치(예: 프로세서)에 의해 또는 외부 제어 장치와 함께 수행될 수 있다. 일 실시 예에 따르면, 프로세서는 배터리의 전압, 전류, 온도 측정을 비롯하여 다양한 상태 정보를 획득하기 위한 동작을 제어할 수 있다. 일 실시 예에 따르면, 프로세서는 배터리에 대한 충전 상태 (SOC: state of charge) 연산, 셀 밸런싱, 과충전, 과방전, 스웰링, 내부 단락(internal short), 급방전, 고온 가속, 벤딩, 하단 눌림 중 적어도 하나를 판정하기 위한 소프트웨어를 실행할 수 있다. 일 실시 예에 따르면, 프로세서는 충전 또는 방전 시 배터리 내부에서 발생하는 다양한 배터리 이상 상태를 사전에 식별하기 위한 동작을 수행할 수 있다. 또한, 프로세서는 충전 또는 방전 시 배터리에 대한 벤딩(bending), 경질의 물체에 의한 눌림(dent)과 같은 외력에 의한 이상 상태를 식별하는 동작을 수행할 수도 있다. 일 실시 예에 따르면, 복수의 배터리 이상 상태들은 급방전, 스웰링, 내부 단락, 벤딩, 눌림과 같은 배터리 이 상 상태들을 포함할 수 있으며, 이에 한정되는 것은 아닐 수 있다. 예를 들어, 배터리 이상 상태들 중 내부 단락 상태는 사용자가 전자 장치를 떨어뜨리거나 외부 물리적 힘에 의 해 큰 충격이 가해진 경우 발생하는 현상일 수 있다. 또한, 배터리 이상 상태들 중 스웰링(swelling) 상태는 배터리 셀 내부의 압력이 급격히 증가하게 되어 캔이 부 풀어 오르는 현상일 수 있다. 이러한 스웰링 상태는 리튬 이온 배터리 셀 전극의 발열이나 발화로 인해 가스가생성되거나, 또는 과전압에 의한 전해액의 분해로 인하여 가스가 생성되는 경우와 같이 주로 셀 내부의 가스 생 성으로 인해 발생할 수 있다. 게다가 이러한 스웰링 상태는 배터리 팩의 폭발을 야기할 수 있어 배터리 팩과 배 터리 팩이 부착된 장치를 파괴할 수 있는데, 스웰링 현상이 발생한 후 높은 충전 전류를 배터리 셀로 계속 인가 하는 경우에는 배터리 팩 폭발이 발생할 수 있다. 또한, 배터리 이상 상태 중 급방전 상태는 충전 또는 방전 동안에 급격하게 높은 출력값(또는 저항값)이 발생하 는 상태이며, 충전과 방전이 교차하는 순간에 발생하는 현상일 수 있다. 일 실시 예에 따르면, 프로세서는 충전 또는 방전 시 배터리 상태를 모니터링하면서 과충전에 의한 스웰링 현상과 같은 다양한 배터리 상태를 실시간으로 감지하고 이를 통보할 수 있다. 일 실시 예에 따르면, 프 로세서는 다양한 배터리 이상 상태를 사전에 식별하여 배터리 상태 식별 결과를 표시함으로써 사용자 입장 에서는 배터리 문제 상황을 한 눈에 확인할 수 있을 뿐만 아니라 이를 사전에 인지할 수 있다. 게다가 사용자 입장에서는 배터리 이상 상태에 따라 다르게 조치를 취할 수 있어, 더욱 효과적으로 배터리의 안전성을 확보할 수 있다. 이러한 사전 조치에 따라 스웰링의 진행을 막고 배터리 발화로 이어지는 배터리 소손을 사전에 방지할 수 있다. 일 실시 예에 따르면, 프로세서는 정상 상태 및 적어도 하나의 이상 상태 하에 놓인 배터리들이 전자 장치 에 탑재되는 경우 출력될 수 있는 전압 및 전류 데이터와 관련된 확률 참조 정보를 배터리 충전 상태별로 구성하여 미리 메모리에 저장해놓을 수 있다. 일 실시 예에 따르면, 프로세서는 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 로부터 확률 참조 정보를 수신할 수 있다. 일 실시 예에 따르면, 확률 참조 정보는 전압 및 전류 데이터와 관련된 확률 분포/밀도 함수(probability distribution/density function: 이하, PDF)를 포함하거나, 전압 및 전류 데이터와 관련된 확률 분포/밀도 데 이터(또는 확률 분포/밀도 테이블)를 포함할 수 있다. 일 실시 예에 따르면, 프로세서는 미리 구성해놓은(또는 미리 저장해놓은) 충전 상태별 전압 및 전류 데이 터의 확률 참조 정보를 기초로, 실제 배터리가 전자 장치에 탑재된 상태로 충전 시에 따른 일부 데이터를 확률 참조 정보에 적용하여, 배터리 이상 상태를 판단할 수 있다. 여기서, 배터리의 충전 상태(state of charge; SOC)는 배터리의 충전 상태를 포함할 수 있다. 또한, 배터리의 충전 상태는 배터리의 현재 충전량, 충전 정도, 충전 레벨과 같은 용어로도 대체될 수 있다. 예를 들어, 상기 충전 상태라 함은 배터리 내부에 충전된 전하(charge)량을 의미할 수 있다. 예를 들어, 배터리의 충전 상태는 배터리의 만충전 용 량(full charge capacity: FCC)에 대한 잔량을 백분율로 표시하는 형태를 가질 수 있다. 일 실시 예에 따르면, 프로세서는 부분 충전 상태 구간에 대한 전류 및 전압 데이터를 확률 참조 정보에 적용하여 배터리 이상 상태를 식별하기 위한 학습 모델의 학습 데이터로서 이용할 수 있다. 여기서, 상기 부분 충전 상태 구간에 대한 전류 및 전압 데이터는 실제 충전 시 배터리에 대한 센싱 결과로서 획득되는 충전 상태에 대한 전류 및 전압 데이터일 수 있다. 일 실시 예에 따르면, 프로세서는 부분 충전 상태 구간에 대한 전류 및 전압 데이터를 가능도 행렬(또는 복수의 가능도 값들)로 변환한 후, 가능도 행렬의 데이터를 학습 모델의 학습 데이터로서 이용할 수 있다. 일 실시 예에 따르면, 프로세서는 부분 충전 상태 구간에 대한 전류 및 전압 데이터를 확률 참조 정보에 적용하여 가능도 행렬을 획득한 후, 가능도 행렬을 학습 모델의 학습 데이터로서 이용할 수 있다. 일 실시 예에 따르면, 메모리는 배터리 이상 상태를 식별하는 데 필요한 각종 데이터들, 명령어 및 소프트웨어를 저장할 수 있다. 일 실시 예에 따르면, 메모리는 복수의 배터리 상태 각각에 대한 충전 상태 별 확률 참조 정보를 저장할 수 있다. 일 실시 예에 따르면, 복수의 배터리 상태 각각에 대한 충전 상태별 확률 참조 정보는 실제 충전 시의 획득되는 일부 충전 상태 구간의 데이터를 비교하거나 적용하는데 이용될 수 있으며, 비교/적용 결과는 배터리 이상 상태 를 식별하는데 이용될 수 있다. 일 실시 예에 따르면, 메모리는 복수의 배터리 상태 각각에 대해 충전 상태별 전류 및 전압 데이터와 관련 된 확률 참조 정보를 저장할 수 있다. 예를 들어, 메모리는 배터리 정상 상태에서의 충전 상태별(예: 0% ~ 100%) 전류 및 전압 데이터와 관련된 확률 참조 정보, 배터리 이상 상태에서의 충전 상태별(예: 0% ~ 100%) 전류 및 전압 데이터와 관련된 확률 참조 정보를 저장할 수 있다. 일 실시 예에 따르면, 확률 참조 정보는 전압 및 전류 데이터와 관련된 확률 분포 함수를 포함하거나, 전압 및 전류 데이터와 관련된 확률 분포 데이터를 포함할 수 있다. 일 실시 예에 따르면, 각 충전 상태에 대응하는 확률 분포 함수는 전압에 대한 확률 분포 함수 및/또는 전류에 대한 확률 분포 함수를 포함할 수 있다. 여기서, 복수의 배터리 이상 상태들은 급방전, 스웰링, 내부 단락, 벤 딩, 눌림 중 적어도 하나를 포함할 수 있다. 따라서 메모리는 n 가지의 배터리 상태(예컨대, 정상 상태, 제1 이상 상태, … , 제 n-1 이상 상태)에 대해 충전 상태별 확률 분포 함수(또는, 전압 PDF 및 전류 PDF)를 저 장할 수 있다. 일 실시 예에 따르면, 메모리는 배터리 이상 상태를 식별하기 위한 상태 식별 프로그램을 저장할 수 있다. 일 실시 예에 따르면, 상기 상태 식별 프로그램은 학습 모델이라고 칭할 수 있으며, 상기 학습 모델은 일부 충 전 상태 구간의 전압 및 전류 데이터(또는 가능도 행렬/데이터/정보) 또는 복수의 배터리 상태 각각에 대한 충 전 상태별 전압 및 전류 데이터(또는 가능도 행렬/데이터/정보)를 통해 학습하고 식별 결과물을 만들어내는 알 고리즘일 수 있다. 일 실시 예에 따르면, 프로세서는 배터리의 충전 시 배터리의 현재 전류, 전압과 같은 배터리 상태 정보를 수집하고, 충전 시 시간에 대응하는 전류 및 전압의 변화를 모니터링한 결과를 획득할 수 있다. 예를 들 어, 프로세서는 전력 관리 회로로부터 실제 충전 시 상기 배터리 상태 정보를 획득할 수 있다. 여기 서, 실제 충전 시 배터리 상태 정보는 일부 충전 상태 구간의 전압 및 전류 데이터일 수 있다. 이에 따라 프로세서는 메모리에 저장된 복수의 배터리 상태들 중 정상 상태 및 적어도 하나의 이상 상태에서의 충전 상태별 전압 및 전류 확률 분포 함수와, 실제 충전 시의 충전 상태 구간에 대한 전압 및 전류 데이터에 기반하여 배터리 이상 상태 여부를 판단할 수 있다. 일 실시 예에 따르면, 프로세서는 일부 충전 상태 구간의 전압 및 전류 데이터(또는 가능도 행렬/데이터/정보)를 이용하여 실시간으로 또는 미리 설정된 주 기마다 배터리 이상 상태를 식별할 수 있다. 다른 일 실시 예에 따르면, 프로세서는 일부 충전 상태 구간의 전압 및 전류 데이터(또는 가능도 행렬/데 이터)를 이용하여 학습 모델을 학습하고, 학습된 모델을 이용하여 실제 충전 시의 일부 충전 상태 구간의 전압 및 전류 데이터(또는 가능도 행렬/데이터)를 기반으로 배터리의 정상 또는 이상 상태를 식별할 수 있다. 여기서, 학습 모델에 대한 설명은 도 4에서 보다 구체적으로 설명하기로 한다. 일 실시 예에 따르면, 전자 장치(예: 도 1의 전자 장치, 도 2의 전자 장치)는, 배터리, 적어도 하나의 프로세서 및 상기 적어도 하나의 프로세서와 작동적으로 연결된 메모리를 포함하며, 상 기 메모리는, 실행 시에, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시의 충전 상태 별 전압 및 전류 정보를 획득하고, 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들(또는 가능도 정보/행렬)을 획득하고, 상기 복수의 가능도 값들(또는 가능 도 정보/행렬)에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하도록 하는 인스트럭션들을 저장 할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 복수의 가능도 값들 또 는 이들로부터 유도되는 이차 변수들에 근거하여 상기 배터리의 이상 유무 또는 배터리 상태를 식별할 수 있다. 일 실시 예에 따르면, 상기 복수의 배터리 상태들과 관련된 확률 참조 정보는, 입력된 충전 상태, 전압 및 전류 에 대하여 배터리 상태별 가능도 값들을 출력하는 복수의 확률 분포 함수들을 포함할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시 의 충전 상태별 전압 및 전류 정보를 상기 복수의 확률 분포 함수들을 이용하여 가능도 행렬로 변환하도록 설정 될 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 전체 충전 상태 중 상기 배 터리의 충전 동안의 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하도 록 설정될 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 적어도 일부의 충전 상 태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 이용하여 학습 모델에 의해 상기 배터리 상태를 식별하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 배터리의 충전 시 의 충전 상태별 전압 및 전류 정보를 상기 복수의 배터리 상태들과 관련된 확률 참조 정보에 적용한 결과를 이 용하여 학습 모델에 의해 상기 배터리 상태를 식별하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 복수의 배터리 상태들은, 정상 상태, 스웰링 상태, 고온 가속 상태, 벤딩 상태, 눌 림 상태 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 복수의 가능도 값들의 적어도 일부를 이용하여 배터리 건전 지표를 획득하고, 상기 획득된 배터리 건전 지표에 근거하여, 상기 배터리 의 이상 유무를 식별하도록 설정될 수 있다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 획득된 배터리 건전 지 표를 미리 설정된 임계치와 비교하여, 상기 임계치 이하인 경우 상기 배터리의 이상을 식별하도록 설정될 수 있 다. 일 실시 예에 따르면, 상기 인스트럭션들은, 상기 적어도 하나의 프로세서가, 상기 임계치 이하인 경우 상 기 배터리의 이상을 식별하여, 상기 배터리의 이상에 대한 사전 알림을 제공하도록 설정될 수 있다. 도 3a는 다양한 충전 패턴에 따른 데이터 변화를 설명하기 위한 도면(300a)이며, 도 3b는 실제 충전 시 데이터 변화를 설명하기 위한 도면(300b)이다. 도 3a는 다양한 충전 패턴을 적용하여 동일한 배터리를 충전하는 상황에서, 충전 패턴 별로 충전 용량에 따른 배터리의 전압 증가 양상을 나타내는 그래프를 예시하고 있다. 도 3a에서는 일 예로, 세 가지의 서로 다른 정전 류-정전압(CC-CV) 충전 패턴을 도시하고 있다. 여기서, 정전류-정전압 충전 패턴이란, 배터리 셀의 전압(예: 320A, 330A, 340A)이 미리 설정된 임계값에 도달하기 전까지는 일정한 크기의 전류를 배터리에 인가하고, 배터리 셀의 전압이 임계값에 도달한 이후로는 해당 전압 레벨을 유지하기 위하여, 인가하는 전류의 크기를 점 진적으로 낮추도록 설정된 충전 시나리오를 의미할 수 있다. 이때, 배터리 셀에는 내부 저항이 존재하므로, 배터리 셀에 큰 전류가 인가될수록, 배터리에 인가되는 실제 전 압은 내부 저항과 전류 세기의 곱인 전압 상승 값만큼 증가할 수 있다. 이에 따라 도 3a에 도시된 바와 같이, 정전류-정전압 충전 패턴들에서 인가 전류의 세기가 큰 순서(320B, 330B, 340B)로 배터리 전압(320A, 330A, 340A)도 높게 나타날 수 있다. 한편, 다양한 충전 패턴에 대해 도 3a에서와 같은 충전 패턴 별로 충전 용량에 따른 배터리의 전압 증가 양상을 나타내는 배터리에 대해, 도 3b는 해당 배터리를 실제로 전자 장치에 탑재시켰을 경우 상기 전자 장치를 충전하 면서 얻을 수 있는 실제 충전 패턴의 형태 중 가능한 일 예를 도시하고 있다. 실제로 전자 장치에 탑재된 배터리에 대한 충전 패턴은 도 3a에 도시된 바와 같이 곡선 형태로 균일하게 충전되 는 것이 아니라, 도 3b에 도시된 바와 같이 매우 불규칙한 충전 패턴(350A, 350B)을 나타낼 수 있다. 예를 들어, 전자 장치의 사용자가 배터리 충전 시 서로 다른 세기의 출력을 가지는 충전기로 충전을 하는 경우, 충전 중 어플리케이션 프로세서(application processor; AP)의 과열로 스로틀링이 발생하는 경우에 강제로 충전 전류 량을 낮추도록 하는 충전 시나리오를 탑재한 경우와 같이 사용자의 충전/방전 특성 혹은 전자 장치 자체의 특성 에 의하여 다양한 충전 패턴들이 가변적으로 적용될 수 있기 때문에 불규칙한 충전 패턴이 나타낼 수 있다. 이 와 같이 배터리 충전 시 항상 동일한 충/방전 시나리오가 아닌 다양한 충/방전 시나리오가 가변적으로 적용되기 때문에, 학습을 통해 다양한 충/방전 시나리오를 적용하여 배터리 이상 상태를 식별하는 방식에 대한 신뢰성을 높일 필요가 있다. 도 4는 일 실시 예에 따른 배터리 이상 상태를 식별하기 위한 학습 과정을 설명하기 위한 블록도이다. 도 4를 참조하면, 전자 장치(예: 도 1의 전자 장치, 도 2의 전자 장치, 프로세서)는 부분 충전 데이터 획득 모듈, 가능도 행렬 변환 모듈, 학습 모듈 및 배터리 상태 식별 모듈을 포함할 수 있다. 일 실시 예에 따르면, 상기 각 모듈(410, 420, 430, 440)에서의 동작은 도 2의 프로세서 에 의해 수행될 수도 있다. 일 실시 예에 따른 부분 충전 데이터 획득 모듈은 배터리에 대한 데이터를 획득할 수 있다. 일 실시 예에 서, 부분 충전 데이터 획득 모듈은 하나의 배터리에 대한 데이터 또는 정상 상태 및 적어도 하나의 이상상태 하에 놓인 복수 개의 배터리들이 전자 장치에 탑재되었을 때 출력되는 전압 및 전류 분포와 관련된 데이터를 획득할 수 있다. 일 실시 예에 따르면, 충/방전 시의 배터리에 대한 전압 및 전류와 관련된 데이터는 사전에 다양한 배터리 실험을 통해 획득되어 확률 참조 정보로서 미리 저장된 것일 수 있다. 일 실시 예에 따른 부분 충전 데이터 획득 모듈은 전자 장치에 탑재된 배터리에 대한 전압 및 전류를 실시간으로 측정하여 전압 및 전류 분포와 관련된 데이터를 획득할 수 있다. 또한, 부분 충전 데이터 획득 모듈 은 배터리 충전이 시작되면, 메모리(예: 도 2의 메모리)에 미리 저장된 복수의 배터리 상태 각각에 대해 충전 상태별로 구성한 전압 및 전류와 관련된 데이터를 메모리로부터 가져올 수 있다. 여기서, 상기 미리 저장된 배터리에 대한 데이터를 실제 충전 시의 데이터와의 비교를 위한 비교 데이터 또는 샘플 데이터라고 칭 할 수 있다. 일 실시 예에 따르면, 상기 샘플 데이터는 정상 상태 및 적어도 하나의 이상 상태 하에 놓인 복수 개의 배터리 들이 전자 장치에 탑재되었을 때 상기 다양한 배터리 상태를 미리 실험한(또는 시뮬레이션한) 데이터에 대 응할 수 있다. 예를 들어, 샘플 데이터는 다양한 상황에 놓인 배터리를 100 %까지 충전하는 동안의 상기 배터리 에 대한 전압 및 전류를 실험을 통해 실시간으로 측정한 데이터를 포함할 수 있다. 이와 같이 샘플 데이터는 정 상 상태 배터리 또는 이상 상태 배터리로부터 개별적으로 획득될 수 있으며, n 가지의 서로 다른 배터리 상태 (예컨대, 정상 상태, 제1 이상 상태, … , 제 n-1 이상 상태)에 대해 충전 상태별 전압 및 전류와 관련된 데이 터를 포함할 수 있다. 일 실시 예에 따르면, 부분 충전 데이터 획득 모듈은 n 가지의 서로 다른 배터리 상태에 대해 전압 및 전 류 분포 특성을 기술하는 함수족 {Fs}0 ≤ s ≤ 100 을 각각 구성할 수 있다. 예를 들어, 설명의 편의를 위해 이하에 서는 n 가지의 서로 다른 배터리 상태(예컨대, 정상 상태, 제1 이상 상태, … , 제 n-1 이상 상태)의 경우들에 대하여 각각 함수족 {Fs,j} 0 ≤ s ≤ 100를 구성한 경우를 예로 들어 설명하기로 한다. 여기서, 함수족 {Fs,j} 0 ≤ s ≤ 100 의 아래 첨자 j는 주어진 함수족이 어떤 이상 상태에 놓인 배터리로부터 얻어진 전압-전류 순서쌍 집합으로부 터 구성되었는가를 나타내기 위한 것으로서, 상기 j 는 n 이하의 자연수일 수 있다. 일 실시 예에서, 정상 상태는 손상을 입지 않은 출고 상태의 배터리 또는 열화되지 않은 BoL(beginning of life) 상태의 배터리 상태일 수 있으며, 복수의 이상 상태는 고온/고습 환경에서 스웰링 현상에 의해 변형이 발 생한 배터리 상태, 고율 충전의 반복에 의하여 내부 저항의 급격한 증가가 발생한 배터리 상태, 내부 단락에 의 하여 발열 및 용량 손실이 발생한 배터리 상태를 포함할 수 있으며, 이외에도 다양한 이상 상태 하에 놓인 배터 리 셀/팩들을 나타내는 배터리 상태를 더 포함할 수 있다. 일 실시 예에 따르면, 부분 충전 데이터 획득 모듈은 전자 장치에 실제 탑재된 배터리를 충전(또는 방전)하는 동안 상기 배터리에 대한 전압 및 전류를 실시간으로 측정하여 전압 및 전류 분포와 관련된 데이터를 획득할 수 있다. 여기서, 부분 충전 데이터 또는 충전 데이터는 배터리가 일정 구간의 충전 상태들을 거치며 충 전되는 동안의 획득되는 충전 상태, 전류 및 전압 쌍에 대응할 수 있다. 예를 들어, 부분 충전 데이터는 배터리 를 일정 %까지 충전하는 동안 획득되는 m개의 충전 상태, 전류 및 전압 쌍을 하나의 행으로 하는 행렬을 나타낼 수 있으며, 부분 충전 곡선이라고 칭할 수 있다. 예를 들어, 20 %까지 충전하는 동안 5% 충전 상태 단위로 전류 및 전압을 측정한 경우, 부분 충전 데이터 획득 모듈은 5 % 의 충전 상태일 경우의 전류 및 전압 데이터, 10 % 의 충전 상태일 경우의 전류 및 전압 데이터, 15 % 의 충전 상태일 경우의 전류 및 전압 데이터, 20 %의 충전 상태일 경우의 전류 및 전압 데이터와 같이 총 m개 즉, 4개의 충전 상태, 전류 및 전압 쌍을 획득할 수 있 다. 한편, 충/방전 시의 배터리에 대한 전압 및 전류 데이터로부터 확률 분포 함수를 획득한다는 것은, 정상 상태 또는 복수의 이상 상태 하에 놓인 배터리들을 전자 장치에 탑재한 상태로 충전 또는 방전하였을 때 얻어지는 충 전 상태별 전압 및 전류의 히스토그램으로부터 확률 밀도 함수의 성질(예: F(V, I) >= 0, ∬F(V, I)dVdI = 1)을 만족하는 함수 F를 결정하는 것을 의미할 수 있다. 여기서, 함수 F 는 PDF를 나타내며,‘dV'는 모든 전압을 나 타내며, ‘dI'는 모든 전류를 나타내며, 상기 ‘∬F(V, I)dVdI = 1’는 확률 총합이 1(예: 100 %)을 넘을 수 없 음을 의미할 수 있다. 한편, 사용자 시나리오에 따라 단일한 전자 장치일지라도 시간에 따라 서로 다른 충전 패턴(또는 충전 프로파일)이 적용될 수 있다. 이러한 상황에서는 충전 상태별 전압/전류가 단순한 단봉형(unimodal) 정규 분포 를 이룰 것이라고 가정할 수 없으므로, 일 실시 예에 따라 커널 밀도 추정(kernel distribution estimation)을 적용함으로써, 부분 충전 데이터 획득 모듈은 다양한 충전 패턴들로부터 얻어진 전압/전류 분포 실측치를반영한 충전 상태별 전압/전류와 관련된 데이터를 획득할 수 있다. 여기서, 커널 밀도 추정 방식을 간략하게 설명하면, n개의 변량으로 구성된 데이터 집합 {xi}1 ≤ i ≤ n 의 분포를 기술하는 확률 밀도 함수 f 를 얻기 위하여, 각 변량 xi 를 중심치로 하는 n개의 국소 분포 함수를 커널 함수를 이용하여 구한 뒤 이들을 모두 합산하는 방식을 취할 수 있다. 구체적으로, 커널 함수를 'K'라고 할 경우 하기 수학식 1을 만족해야 하며, 하기 수학식 1은 커널 함수 K가 만 족하여야 하는 특성 조건을 나타내고 있다. 수학식 1"}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 수학식 1에서는, 커널 함수 K(x)는 정의역(domain) 전체에서 양수인 우함수(또는 대칭함수)여야 한다는 조 건을 나타내고 있다. 가우시안(Gaussian), 양수 a에 대하여 폐구간 [-a/2, a/2]에서 함숫값 a로 정의된 상수함 수 등 다양한 적분 가능함수가 상기 조건을 만족시킬 수 있다. 본 발명에서 추후 상술할 실시예들의 경우 특별 한 언급이 없는 한 대칭 이파네치니코브(Epanechnikov) 함수를 커널 함수로 사용하고 있으나, 이러한 사실이 본 발명에서 사용 가능한 커널 함수를 이에 제한하는 것은 아니다. 상기 수학식 1의 조건을 만족하여 얻어지는 최종 확률 밀도 함수 f 의 형태는 하기 수학식 2와 같을 수 있다. 하기 수학식 2는 커널 밀도 추정에 의해 계산된 단일변량 {xi}1 ≤ i ≤ n 의 확률 밀도 함수 f 를 나타내고 있다. 수학식 2"}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 수학식 2에서 변수 h는 커널 함수의 대역폭(bandwidth) 값으로, 이 수치가 0에 근접할수록 커널 함수는 델 타 함수(delta function)에 가까운 형태가 될 수 있다. 상기 수학식 2를 이용하면, 충전 상태 s에서 전압-전류 변량의 순서쌍 ns개의 집합 {Vs,i, I s,i}1 ≤ i ≤ ns 이 주어 졌을 때, 이를 독립된 전압 변량의 집합 {Vi}1 ≤ i ≤ ns 과 전류 변량의 집합 {Ii}1 ≤ i ≤ ns으로 분리하여, 이들 각 각에 대한 확률 밀도 함수 fvoltage,s 와 fcurrent,s 를 구성할 수 있다. 예를 들어, 함수 fvoltage,s 는 전압과 관련된 데이터, 전압 데이터와 관련된 확률 분포/밀도 함수(또는 전압 PDF)라고 칭할 수 있으며, 함수 fcurrent,s 는 전류 와 관련된 데이터, 전류 데이터와 관련된 확률 분포/밀도 함수(또는 전류 PDF)라고 칭할 수 있다. 상기와 같은 방식으로 충전 상태 s에 대해 전압 및 전류에 관련된 확률 분포 함수를 획득할 수 있다. 일 실시 예에 따른 가능도 행렬 변환 모듈은 상기 부분 충전 데이터 획득 모듈로부터 획득되는 데이 터를 길이 n인 가능도(likelihood) 벡터로 변환 및 적층하여, 최종적으로 m × n 크기의 가능도 행렬 또는 정규 화된 가능도 행렬을 구성할 수 있다. 예를 들어, 부분 충전(예: ~ %까지의 충전) 동안 m 개의 충전 상태-전압-전류 쌍을 획득할 수 있을 때 정상 상 태에 대해 정상 상태 × m 개의 데이터를 획득할 수 있으며, 제1 이상 상태에 대해서는 제1 이상 상태 × m 개 의 데이터를 획득할 수 있다. 이에 따라 n 가지의 배터리 상태에 대해서는 총 m × n 개의 데이터를 획득할 수 있다. 이러한 m × n 개의 데이터를 가능도 행렬 데이터라고 칭할 수 있다. 일 실시 예에 따르면, 이러한 가능 도 행렬 데이터의 일부 또는 전체를 이용한다면 배터리 이상 여부를 식별할 수 있다.구체적으로, 상기 수학식 2를 통해 충전 상태 s에 대해 전압 및 전류와 관련된 확률 분포 함수를 획득하게 되면, 이를 이용하여 전체 충전 상태(예: 0% ~ 100%)별 전압 및 전류 확률 분포 함수 간의 관계를 나타내는 함 수 F를 구할 수 있다. 여기서, 함수 F는 배터리 상태에 대한 충전 상태별 전압 및 전류와 관련된 확률 분포 함 수의 집합으로, 복수의 배터리 상태들과 관련된 확률 참조 정보라고 칭할 수 있다. 이러한 함수 F를 이용한다면 실제 충전 시 획득되는 일부 충전 상태 구간에 대한 전압 및 전류와 관련된 데이터 가 어느 배터리 상태에 속하는지를 식별할 수 있다. 예를 들어, 함수 F는 충전 상태 s일 경우의 전압 및 전류와 관련된 데이터를 복수의 배터리 상태 각각에 대한 충전 상태별 전압 및 전류 확률 분포 함수에 적용하여, 특정 배터리 상태에 속할 가능성을 수치화하는 역할을 할 수 있다. 복수의 배터리 상태들 중 어느 한 상태에 속할 가능성을 수치화하는 역할을 하는 함수 F를 하기 수학식 3와 같 이 구할 수 있다. 수학식 3"}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "상기 수학식 3은, 전압 및 전압에 대한 집합 {Vs,i, I s,i}1 ≤ i ≤ ns 의 분포를 기술하는 확률 밀도 함수 F 의 표 현식일 수 있다. 구체적으로, 상기 수학식 3에서 함수 Fs 는 충전 상태 s에서 배터리 전압 값이 V 이고, 전류 값이 I 일 점확률 (point probability) 혹은 가능도 수치를 반환하는 함수이다. 상기 수학식 3에서 fvoltage,s 는 충전 상태 s에서 얻어진 ns개 전압 값의 집합 {Vs,i} 1 ≤ i ≤ ns 을 대상으로 대역폭 hvoltage의 커널 분포 추정을 상기 수학식 2에 따 라 적용하여 얻어진, 전압 분포에 대한 확률 밀도 함수(또는 전압 PDF)일 수 있다. 또한 상기 수학식 3에서 fcurrent,s 는 충전 상태 s에서 얻어진 ns개 전류 값의 집합 {Is,i} 1 ≤ i ≤ ns 을 대상으로 대역폭 hcurrent의 커널 분포 추정을 상기 수학식 2에 따라 적용하여 얻어진, 전류 분포에 대한 확률 밀도 함수(또는 전류 PDF)이다. 한편, fvoltage,s 와 fcurrent,s 는 각각 커널 분포 추정에 의하여 얻어진 함수로서 확률 밀도 함수의 기본 성질을 만 족하므로, {Fs} 0 ≤ s ≤ 100는 각 충전 상태 s에서 2차원 확률 밀도 함수의 기본 성질 (F(V, I) >= 0, ∬F(V, I)dVdI = 1)을 만족하는 함수들의 집합(또는 함수족)이 될 수 있다. 여기서, 상기 수학식 3에서 함수 Fs 의 아 래 첨자 s는 배터리의 충전 상태로서 배터리의 만충전 용량에 대한 잔량을 백분율로 표시하는 형태를 가질 수 있다. 이에 따라 아래첨자 s의 범위는 100 이하의 자연수 또는 0일 수 있으나, 충전 상태의 범위가 반드시 0 - 100으로 정해지는 것은 아니다. 실제 전자 장치에 탑재된 배터리 충전 동안에 상기 배터리에 대한 부분 충전 데이터를 획득하였을 때, 가능도 행렬 변환 모듈은 획득된 부분 충전 데이터를 이용하여 가능도 행렬을 구성할 수 있다. 예를 들어, 충전이 시작되어 충전이 이루어지는 시간 동안 배터리에 대한 전류 및 전압과 관련된 데이터를 획득할 수 있는데, 이를 부분 충전 데이터라고 칭할 수 있으며, 다르게는 부분 충전 곡선이라고 칭할 수도 있다. 만일, 배터리를 충전하는 동안에 배터리에 대한 전류 및 전압 측정에 대한 결과로 부분 충전 곡선 C 를 획득한 경우를 예로 들어 설명해보면, 부분 충전 곡선 C 는 일정 시간 구간 동안 전자 장치가 획득한 m개의 충전 상태- 전압-전류 쌍들로 구성된 집합 {si, Vi, Ii}1 ≤ i ≤ m 를 의미할 수 있다. 만일 3가지 경우(예컨대, 정상 상태, 제 1 이상 상태, 제2 이상 상태)의 배터리 상태 각각에 대한 충전 상태별 전류 및 전압 확률 분포 함수가 미리 저장된 상태인 경우, 상기 부분 충전 곡선 C 는 m Х 3 크기의 행렬 혹은 배열로 취급될 수 있다. 일 실시 예에 따른 가능도 행렬 변환 모듈은 전자 장치에 미리 저장해놓은 충전 상태별 전류 및 전압 확률 분포 함수 예컨대, 0부터 100 이내의 충전 상태에 대한 함수족 {Fs,j} 0 ≤ s ≤ 100을 참조하여 C 를 가능도 행렬 LC 로 변환할 수 있다. 상기 가능도 행렬 LC는 하기 수학식 4와 같이 표현될 수 있다. 수학식 4"}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "상기 수학식 4에서, 상기 si는 충전 상태값(예: SOC 값)을 나타내며, j는 복수의 배터리 상태들 중 어느 하나의 이상 상태를 나타낼 수 있다. 예를 들어, 상기 수학식 4와 같은 가능도 행렬 LC는 부분 충전 곡선 C = {si, Vi, Ii}1 ≤ i ≤ m 을 확률 분포 함수족 {Fs,j} 0 ≤ s ≤ 100, 0 ≤ j ≤ n에 의해 변환하여 획득한 것일 수 있다. 상기 수학식 4에서의 분자는 입력된 충전 상태-전압-전류 순서쌍(si, Vi, Ii)가 이상 상태 j에 속할 가능도를 나 타낼 수 있다. 또한, 상기 수학식 4에서의 분자는 동일한 순서쌍이 각 이상 상태에 속할 가능도를 각각 구하여 그 합을 구한 것이다. 따라서 상기 수학식 4에서의 Lc(i,j)는 주어진 충전 상태-전압-전류 순서쌍(si, Vi, Ii)이 복수의 배터리 상태들 중 특정한 상태 j에 속할 가능성을 수치화하는 하나의 방식을 제공하는 역할을 할 수 있 다. 일 실시 예에 따르면, 상기 수학식 4에서의 분모 항 없이도 충전 상태-전압-전류 순서쌍(si, Vi, Ii)이 복수의 배터리 상태(예컨대, 정상 상태, 제1 이상 상태, … , 제 n-1 이상 상태) 중 어느 배터리 상태에 속할지에 대한 가능성을 수치화할 수 있다. 따라서 상기 수학식 4에서의 분모 항은 생략될 수 있으나, 상기 가능도 행렬은 학 습 모델을 학습시키는 데 있어 학습 효율의 향상을 위해 이용될 수 있다는 점을 고려하여 상기 분모 부분이 추 가된 것일 수 있다. 따라서 가능도 행렬을 구성하는 방법이 이에 한정되는 것은 아니며, 가능도 행렬의 각 구성 요소는 다양한 형태로 변형될 수 있다. 예를 들어, 부분 충전 곡선의 각 순서쌍과 확률 분포 함수족 {Fs,j} 0 ≤ s ≤ 100, 0 ≤ j ≤ n 을 이용하여 어떠한 배터리 상태에 해당하는지를 수치화할 수 있는 것이라면 가능도 행렬의 각 구 성요소는 다양한 형태로 변형되는 것이 가능할 수 있다. 일 실시 예에 따르면, 다양한 배터리 상태에 대해 충전 상태별 전압-전류 분포를 나타내는 확률 분포 함수족 {Fs,j} 0 ≤ s ≤ 100, 0 ≤ j ≤ n 은 복수의 배터리 상태 각각에 대해 충전 상태별로 구성한 전압 및 전류와 관련된 데이 터로서 미리 구성되어 메모리에 저장된 것일 수 있다. 한편, 일 실시 예에 따른 학습 모듈은 배터리 이상 상태를 식별하기 위한 학습 모델을 학습시킬 수 있다. 일 실시 예에 따르면, 학습 모듈은 부분 충전 데이터 획득 모듈로부터 획득되는 부분 충전 데이터(예: 부분 충전 곡선 C)를 학습을 위한 입력 데이터로 이용할 수 있다. 다른 실시 예에 따르면, 학습 모 듈은 가능도 행렬 변환 모듈로부터 획득되는 가능도 행렬의 일부 또는 전체 데이터(예: Lc(i,j))를 기반으로 상기 학습 모델을 학습할 수 있다. 예를 들어, 학습 모듈은 기계학습 모델로, 다층 퍼셉트론 (MLP), 랜덤포레스트와 같은 학습 모델을 통해 딥러닝을 수행할 수 있다. 일 실시 예에 따른 배터리 상태 식별 모듈은 다양한 배터리 상태에 대해 학습 모듈에 의한 학습 결과 에 기반하여 실제 충전 동안의 배터리에 대한 이상 상태 여부를 식별할 수 있다. 일 실시 예에 따른 배터리 상태 식별 모듈은 학습 모듈에서의 학습 모델을 이용하여 배터리 상태를 식별할 수 있는데, 상기 학습 모델은 사전에 학습된 것일 수 있다. 예를 들어, 배터리 상태 식별 모듈은 하나의 배터리 또는 복수의 배터리에 대한 다양한 부분 충전 곡선에 기반하여 생성된 가능도 행렬에 의해 사전학습된 기계학습 모형을 이용하여 배터리의 이상 상태에 대한 식별을 할 수 있다. 일 실시 예에 따르면, 가능도 행렬의 데이터가 학습 모듈의 입력 데이터로 이용되는 경우, 배터리 상태 식 별 모듈은 배터리가 정상 상태에 있는지 또는 특정 상태의 이상이 발생하였는지를 학습 모듈의 출력 으로부터 제공받을 수 있다. 이에 따라 배터리 상태 식별 모듈은 이러한 학습을 통해 일부 충전 상태 구간 에서의 배터리 관련 데이터(예: 부분 충전 곡선 C)만으로도 충분히 전자 장치에 탑재된 배터리가 이상 상태에 놓여졌는지를 즉시 또는 사전에 식별할 수 있을 뿐만 아니라 어떠한 형태의 이상 상태인지도 구분할 수 있어, 빠르고 정확한 식별이 가능할 수 있다. 다른 실시 예에 따른 배터리 상태 식별 모듈은 충전 시 배터리에 대한 가능도 행렬의 일부 또는 전체 데이 터를 이용하여 배터리 건전 지표(health index)를 산출할 수 있다. 배터리 상태 식별 모듈은 상기 가능도 행렬로부터 산출된 배터리 건전 지표를 이용하여 배터리 이상 여부를 식별할 수 있다. 예를 들어, 배터리 상태 식별 모듈은 충전 도중에 배터리 건전 지표가 미리 설정된 임계치 이하에 도달할 경우 배터리에 이상이 있 다고 식별할 수 있다. 일 실시 예에 따르면, 배터리 이상 상태가 발생하기 전 사용자가 이를 인지하거나 조치를 취할 수 있도록 상기 임계치가 미리 정해질 수 있다. 이하, 배터리 건전 지표를 이용한 배터리 이상 상태에 대한 식별 방법을 설명하기로 한다. 일 실시 예에 따르면, 다양한 배터리 상태에 대해 충전 상태별 전압-전류 분포를 나타내는 확률분포함수족 {Fs,j} 0 ≤ s ≤ 100, 0 ≤ j ≤ n 이 이미 구성되어 저장되어 있다고 가정해보면, 실제 충전에 대응하여 배터리에 대한 부분 충전 곡선 C가 획득되었을 때 가능도 행렬은 상기 수학식 4에 기반하여 획득될 수 있다. 따라서 가능도 행 렬 변환 모듈에서 부분 충전 곡선 C에 대해 가능도 행렬 LC를 구할 수 있다. 이에 대응하여, 배터리 상태 식별 모듈은 가능도 행렬 변환 모듈에 의해 산출된 가능도 행렬 LC를 이용하여 배터리 건전 지표를 결정할 수 있다. 예를 들어, 부분 충전 곡선 C가 배터리 상태 j 하에 있을 가능성을 배터리 건전 지표를 이용하 여 나타낼 수 있다. 일 실시 예에 따르면, 배터리 상태 식별 모듈은 하기 수학식 5에 기반하여 상기 가능도 행렬 LC를 배터리 건전 지표로 변환할 수 있다. 수학식 5"}
{"patent_id": "10-2020-0090466", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상기 수학식 5는, 배터리 상태 j에 대한 배터리 건전 지표 HIj 를 나타내며, 상기 HIj는 부분 충전 곡선 C가 배 터리 상태 j에 속할 가능성을 나타내는 값일 수 있다. 상기 수학식 5에 따르면, 배터리 상태 식별 모듈은 부분 충전 곡선 C에 대해 총 m개의 가능도 행렬 LC를 구할 수 있으며, 이를 그 개수 m개로 나누어 평균값을 구 함으로써 배터리 정상 상태인지 이상 상태인지를 식별할 수 있다. 만일 상기 수학식 5를 통해 결정된 배터리 건전 지표가 이상상태 j에 대한 임계치 Tj 이하인 경우, 배터리 상태 식별 모듈은 사용자에게 배터리가 이상 상태 j에 놓인 것을 알릴 수 있다. 여기서, 임계치 Tj는 실제 이상 상태 j에 놓인 배터리를 탑재한 전자 장치로부터 획득한 n 개의 부분 충전 곡선 데이터 {Ck}1 ≤ k ≤ N 들로부터 각 각 계산된 배터리 건전 지표들의 평균 혹은 배터리 건전 지표들의 값들 중 하한값에서 정해질 수 있다. 한편, 배터리 상태 식별 모듈은 충전 도중에 배터리 건전 지표가 미리 설정된 임계치 이하에 도달할 경우 배터리에 이상이 있다고 식별할 수 있다. 일 실시 예에서, 상기 수학식 5의 배터리 건전 지표는 배터리의 소손 징후를 사전에 감지하기 위하여 사용될 수 있으며, 이에 대한 구체적으로 설명은 도 7에서 후술하기로 한다. 도 5는 일 실시 예에 따른 충전 상태별 전압 및 전압에 대한 확률 밀도 함수를 예시한 도면이다. 도 5를 참조하면, 제1 그래프는 배터리에 대한 충전 상태에 따른 전압의 변화를 예시적으로 나타내고 있으 며, 제2 그래프는 배터리에 대한 충전 상태에 따른 전압의 변화를 예시적으로 나타내고 있다. 제1 그래프 에서 가로축은 전압을 나타내고, 세로축은 충전 상태(SOC)를 나타내고 있다. 여기서, 제1 그래프에서 는 0 ~ 100 %의 충전 상태들 중 충전 상태 5% 단위로 전압 데이터를 예시하고 있는데, 굵은 선(예: 560)은 이상 상태에 해당하는 배터리에 대한 충전 상태 5 % 마다의 전압의 변화를 예시하고 있는 것이며, 가는 선(예: 550) 은 정상 상태에 해당하는 배터리에 대한 충전 상태 5 % 마다의 전압의 변화를 예시하고 있다. 또한 제2 그래프에서 가로축은 전류를 나타내고, 세로축은 충전 상태(SOC)를 나타내고 있다. 제1 그래프 에서와 같은 방식으로, 제2 그래프에서도 굵은 선은 이상 상태에 해당하는 배터리에 대한 충전 상태 5 % 마다의 전류의 변화를 예시하고 있는 것이며, 가는 선은 정상 상태에 해당하는 배터리에 대한 충전 상태 5 % 마다의 전류의 변화를 예시하고 있다. 제2 그래프를 참조하면, 배터리에 대한 정상적인 충전 상태의 경우에는 배터리에 대한 전류는 대체적으로 예컨대, 3A(Ampere)에 가깝게 측정될 수 있다. 반면, 배터리 발열과 같은 이유로 발열을 낮추는 충전 상태의 경 우에는 배터리에 대한 전류는 대체적으로 1.3A에 가깝게 측정될 수 있다. 도 5에 도시된 바와 같이 제1 그래프는 정상 배터리와 특정 이상 상태 하에 놓인 배터리에 대해 커널 분포 추정법으로 얻어진 전압 분포 함수 fvoltage,s 와 전류 분포 함수 fcurrent,s 를 다양한 충전 상태 s(예: 충전 상태 5 % 단위로)에 대해 도시하고 있다. 도 5를 참조하면, 제2 그래프에서와 같이 배터리 이상 상태와 배터리 정상 상태의 경우 전류 분포 특성의 차이가 거의 없으나, 전압의 경우에는 제1 그래프에서와 같이 배터리 이상 상태의 전압 분포와 배터리 정 상 상태의 전압 분포가 달라질 수 있다. 여기서, 도 5에서는 정상 상태와 1 개의 이상 상태의 배터리에 대한 전 압 및 전류 변화를 예시하고 있으나, 예를 들어, 복수의 이상 상태 각각의 전압 분포는 정상 상태의 전압 분포 와는 다를 수 있으며, 설명의 편의를 위해 도 5에서는 정상 상태와 1개의 이상 상태를 예로 들어 설명하였을 뿐, 이에 한정되는 것은 아닐 수 있다. 이와 같이 배터리 상태(예: 정상 상태, 이상 상태)는 충전 상태-전류 분포 특성-전압 분포 특성으로 이루어지는 한 쌍과 높은 상관 관계를 가짐을 알 수 있다. 따라서 일 실시 예에 따른 배터리 이상 상태를 식별하기 방법은, 충전이 진행됨에 따라 예컨대, 충전 상태가 0 %에서 100 %으로 증가할 경우 배터리의 상태에 대해 전류 분포는 일정한 특성을 가지는 반면 전압 분포는 배터리 상태별로 달라지는 특성을 이용할 수 있다. 따라서 전자 장치에 서 배터리 이상 상태 식별을 위해 실제 충전 시 충전 상태, 충전 상태에 대한 전류 데이터 및 전압 데이터를 획 득한 후, 상기 특성을 이용한다면 어떠한 배터리 상태에 속하는지를 식별할 수 있다. 도 5에 도시된 바와 같이 이상 상태 배터리의 분포 함수가 정상 상태 배터리의 분포 함수로부터 전압 혹은 전류 축에서 편이(shift)를 일으키는 것을 확인할 수 있으며, 이러한 특성은 분포함수 F를 이용한다면 배터리 이상 상태를 식별할 수 있는 근거가 될 수 있다. 도 6은 일 실시 예에 따른 전자 장치에서 배터리 이상 상태를 식별하기 위한 동작 흐름도이다. 도 6을 참조하면, 동작 방법은 610 내지 620 동작들을 포함할 수 있다. 동작 방법의 각 단계/동작은, 전자 장치 (예: 도 1 및 도 2의 전자 장치(101 또는 201)), 전자 장치의 적어도 하나의 프로세서(예: 도 1 및 도 2의 프로 세서(120, 220)) 중의 적어도 하나에 의해 수행될 수 있다. 일 실시 예에서, 610 내지 620 동작들 중 적어도 하 나가 생략되거나, 일부 동작들의 순서가 바뀌거나, 다른 동작이 추가될 수 있다. 610 동작에서 전자 장치(예: 도 1 및 도 2의 전자 장치(101 또는 201), 또는 프로세서)는 배터리(예: 도 2 의 배터리)의 충전 시의 충전 상태별 전압 및 전류 정보를 획득할 수 있다. 예를 들어, 전자 장치에 장착 된 배터리에 대한 충전이 시작되면, 충전이 진행됨에 따라 실시간으로 또는 주기적으로 충전 상태별 전압 및 전 류 정보를 획득할 수 있다. 예를 들어, 전자 장치는 충전 시 배터리에 대한 충전 상태 정보를 센서 모듈(예: 도 2의 센서 모듈) 중 해당하는 센서(예: 전류 센서, 전압 센서), 또는 전력 관리 회로(예: 도 2의 전력 관리 회로)를 이용하여 측정함으로써 획득할 수 있다. 이와 마찬가지로 일 실시 예에서는 충전 시의 충전 상태 별 전압 및 전류 정보를 획득하는 경우를 예로 들어 설명하나, 방전 시에는 배터리의 사용 상태 정보를 측정함 으로써 방전 상태별 전압 및 전류 정보를 획득할 수 있으므로, 이하의 동작들은 방전 시에도 동일하게 적용될 수 있다. 615 동작에서 전자 장치는 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보 에 대한 복수의 가능도 값들을 획득할 수 있다. 일 실시 예에 따르면, 상기 복수의 배터리 상태들과 관련된 확률 참조 정보는, 입력된 충전 상태, 전압 및 전류 에 대하여 배터리 상태별 가능도 값들을 출력하는 복수의 확률 분포 함수들을 포함할 수 있다. 일 실시 예에 따르면, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작은, 상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 상기 복수의 확률 분포 함수들을 이용하여 가능도 행렬로 변환하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작은, 전체 충전 상태 중 상기 배터리의 충전 동안의 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 획 득하는 동작을 포함할 수 있다. 620 동작에서 전자 장치는 상기 복수의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별할 수 있다. 일 실시 예에 따르면, 전자 장치는, 상기 복수의 가능도 값들 또는 이들로부터 유도되는 이차 변수들에 근거하 여 상기 배터리의 이상 유무 또는 배터리 상태를 식별할 수 있다. 일 실시 예에 따르면, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작은, 상기 적어도 일부의 충전 상태별 전압 및 전류 정보에 대한 복수의 가능도 값들을 이용하여 학습 모델에 의해 상기 배터리 상태를 식별하 는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작은, 상기 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 상기 복수의 배터리 상태들과 관련된 확률 참조 정보에 적용한 결과를 이용하 여 학습 모델에 의해 상기 배터리 상태를 식별하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작은, 복수의 가능도 값들의 적 어도 일부를 이용하여 배터리 건전 지표를 획득하는 동작 및 상기 획득된 배터리 건전 지표에 근거하여, 상기 배터리의 이상 유무를 식별하는 동작을 포함할 수 있다. 일 실시 예에 따르면, 상기 방법은, 상기 획득된 배터리 건전 지표를 미리 설정된 임계치와 비교하는 동작, 상 기 임계치 이하인 경우 상기 배터리의 이상을 식별하는 동작 및 상기 배터리의 이상에 대한 사전 알림을 제공하 는 동작을 더 포함할 수 있다. 일 실시 예에 따르면, 상기 복수의 배터리 상태들은, 정상 상태, 스웰링 상태, 고온 가속 상태, 벤딩 상태, 눌 림 상태 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르면, 전자 장치는 상기 배터리의 이상 유무 또는 배터리 상태를 식별한 경우, 배터리 이상 상 태에 관련된 알림을 제공할 수 있다. 예를 들어, 전자 장치는 시각적 피드백, 청각적 피드백 및 촉각적 피드백 중 적어도 하나를 이용하여, 배터리 이상 상태가 발생하거나 발생할 수 있음을 나타내는 알림을 출력할 수 있다. 도 7은 일 실시 예에 따른 충전 패턴의 변화와 건전 지표 간의 관계를 나타낸 도면이다. 도 7에서는 배터리 충전 동안에 가해지는 부하(load)에 대해 전압 및 전류가 불규칙한 패턴으로 나타나며, 이에 대응하여 변하는 건전 지표를 예시하고 있다. 예를 들어, 충전 패턴의 변화와 건전 지표 간의 관계를 살펴보기 위해 도 7을 참조할 수 있다. 도 7에서는 배터리에 대한 인위적인 압력 예컨대, 전자 장치의 배터리 셀의 상단 탭 영역에 환봉에 의한 점증 압력을 가하는 동안 출력되는 데이터들 간의 관계를 도시하고 있다. 배터리 충전 동안에 가해지는 압력(예: Load)이 점증적으로 증가하는 동안 전자 장치는 배터리에 대한 전류 및 전압의 불규칙한 패턴에 해당하는 부분 충전 데이터(또는 부분 충전 곡선)를 획득할 수 있으며, 부분 충전 데이 터로부터 상기 수학식 5을 통해 건전 지표를 산출할 수 있다. 도 7에 도시된 바와 같이 점증적인 압력이 가해짐에 따라 도면번호 710에 의해 지시되는 부분 이후에는 발화가 발생할 수 있다. 예를 들어, 배터리 테스트 결과, 환봉에 의한 점증 압력에 의해 1000초간 최대 137N의 하중에 노출된 후 발화를 일으켜 배터리가 소손되었으며, 상기 도 7에 따르면 배터리의 소손은 1000초간의 점증 하중 노출 이후 발생하였으나 부분 충전 데이터로부터 계산된 건전지표(HI0)는 소손 발생 이전에 시작값(예: 1 값)부 터 점차 감소하여 최소값(예: 0.652 값)을 갖는 형태로 나타남을 알 수 있다. 따라서 전자 장치는 건전 지표를 이용한다면 배터리 이상 상태를 사전에 식별할 수 있으며, 건전 지표가 임계치 이하로 떨어지는 시점을 기준으로 배터리 이상 상태가 발생하기 전에 사용자에게 배터리 소손 가능성에 대한 알 림을 제공할 수 있다. 예를 들어, 전자 장치는 충전 동안의 건전지표 HI0의 최소값(예: 0.652 값)에 대응 하여 임계치 T0 (예: 0.8값)를 설정하여 미리 저장해놓을 수 있으며, 배터리 손상 상태에 대해 적어도 손상이 발생하기 전에 건전 지표의 임계치 이하 급락을 근거로 전자 장치용 배터리의 이상 상태에 대한 식별 정보를 사 전에 제공할 수 있다. 도 8은 일 실시 예에 따른 배터리 이상 상태와 관련된 정보를 제공하기 위한 화면 예시도이다. 도 8은 배터리 이상 상태를 배터리 건전 지표를 이용하여 나타낸 화면을 예시하고 있다. 도 8에서와 같이 전자 장치는 배터리 이상 상태를 사용자에게 통지할 수 있다. 예를 들어, 도 8에 도시된 바와 같이 전자 장치는 배터 리의 충전 상황 정보와 함께 다양한 배터리 이상 상태와 관련한 정보를 화면에 표시할 수 있다. 예를 들어, 전 자 장치는 사용자가 배터리 이상 상태를 인지하여 조치를 취할 수 있도록 내부 단락, 스웰링, 급방전과 같은 다 양한 배터리 이상 상태에 대한 가이드를 표시할 수 있다. 예를 들어, 전자 장치는 즉시 충전을 중단하도록 경고, 배터리 상태가 불안정한 상태임을 통지하는 경고와 같이 배터리 이상 상태를 복수의 단계로 구분하여 통 지할 수도 있다. 예를 들어, 배터리 상태에 대한 건전 지표가 임계치 이하로 급락한 경우 실제 배터리 손상이 발생하기 미리 설 정된 시간 전(예: 십분 전)에 사용자에게 배터리 소손 가능성에 대한 알림을 제공할 수 있다. 이와 같은 알림 방식으로 사용자에게 배터리 이상 상태에 대한 식별 정보를 사전에 제공할 수 있다. 도 9a 및 도 9b는 일 실시 예에 따른 부분 충전 상태에 대한 데이터 및 가능도 행렬을 나타낸 도면(900a. 900 b)이다. 도 9a를 참조하면, 전자 장치(예: 도 1의 전자 장치, 도 2의 전자 장치 또는 프로세서)는 실제 충전 시 제1 상태(예: 정상 상태)의 배터리에 대한 부분 충전 데이터를 획득할 수 있다. 도 9a에서 예컨대, 일정 시간 충전 시 m 개의 충전 상태-전압-전류 쌍으로 이루어진 부분 충전 데이터를 획득할 수 있다. 또한, 일 실시 예에 따르면 전자 장치는 상기 부분 충전 데이터를 기반으로 한 배터리 이상 상태를 식별하기 위 해, 부분 충전 데이터를 가능도 행렬로 변환할 수 있다. 예를 들어, 전자 장치는 상기 부분 충전 데 이터를 전자 장치 내에 미리 저장되어 있는 확률 분포 함수족 {Fs,j}을 참조하여 가능도 행렬 LC로 변 환할 수 있다. 이에 따라 전자 장치는 부분 충전 데이터를 가능도 행렬로 변환했을 때, 복수의 배터 리 상태들과 관련된 확률 정보(921, 922, 923, 924, 925)에 기반하여 어느 배터리 상태에 속하는지를 식별할 수 있다. 예를 들어, 전자 장치는 부분 충전 데이터를 기반으로 모든 가능한 배터리 상태들 중 정상 상태에 속할 가능도가 높게 나왔을 경우 충전 중인 배터리는 정상 상태라고 식별할 수 있다. 도 9b를 참조하면, 전자 장치는 실제 충전 시 제2 상태(예: 스웰링 상태)의 배터리에 대한 부분 충전 데이터 를 획득하면, 실제로 상기 배터리가 스웰링 상태인지를 식별하기 위해 상기 부분 충전 데이터를 전자 장치 내에 미리 저장되어 있는 확률 분포 함수족 {Fs,j}을 참조하여 가능도 행렬 LC로 변환할 수 있으며, 복수의 배터리 상태들과 관련된 확률 정보(941, 942, 943, 944, 945)에 기반하여 어느 배터리 상태에 속하는지 를 식별할 수 있다. 예를 들어, 전자 장치는 부분 충전 데이터를 기반으로 모든 가능한 배터리 상태들 중 스웰링 상태에 속할 가능도가 높게 나왔을 경우 충전 중인 배터리는 스웰링 상태라고 식별할 수 있다. 도 10은 일 실시 예에 따른 배터리 이상 상태를 식별하는 학습 모듈을 설명하기 위한 도면이다. 도 10에서는 실제 부분충전 곡선에 대한 가능도 행렬 계산 결과와 신경망에 의한 이상 상태 판정 과정을 예시하 고 있다. 도 10을 참조하면, 충전이 시작됨에 따라 전자 장치(예: 도 1의 전자 장치, 도 2의 전자 장치 또는 프로세서)는 부분 충전 데이터(또는 부분 충전 곡선C)가 획득되었을 때 기계학습 모델을 이용하여 배터리 이상 상태를 식별할 수 있다. 예를 들어, 전자 장치는 기계학습 모델에 의해 배터리 정상 상태 또는 스 웰링 상태와 같이 이상 상태로 구분하여 식별할 수 있다. 상기 기계학습 모델의 일 예로, 도 10에서는 다층 퍼셉트론 분류기를 예시하고 있으나, 이외에도 랜덤포레스트 분류기와 같이 다양한 학습 모델이 적용될 수 있다. 상기와 같은 기계학습 모델에 대한 학습은 제품 출시 이전에 배터리에 대한 사전 실험 결과에 기반하여 수행될 수 있다. 예를 들어, 전자 장치는 복수의 부분 충전 데이터(또는 부분 충전 곡선)와 배터리 상태의 순서쌍 {Ck, jk}1 ≤ k ≤ N 이 주어졌을 때, 이들로부터 획득된 가능도 행렬의 집합 {LC,k}1 ≤ k ≤ N 과 배터리 상태 레이블 벡터 {jk}1 ≤ k ≤ N 를 이용하여 학습 모델(예: 기계학습 모델 M)에 대한 교사학습(supervised learning)을 수행할 수 있으며, 학습 에 사용되지 않은 부분 충전 곡선 Cunknown이 주어졌을 때 입력 Cunknown에 대한 학습 모델의 출력을 이용함으로써 배터리 이상 상태를 식별할 수 있다. 예를 들어, 기계학습 모델 M은, 정상 상태의 배터리를 탑재한 전자 장치와 스웰링이 발생한 전자 장치로부터 획 득한 부분충전곡선 집합 {Ck}1 ≤ k ≤ N (예: N = 118,000)을 정상 상태 배터리에 대한 충전 상태별 전압/전류 분 포함수족 {Fs,0} 0 ≤ s ≤ 100과 스웰링 상태 배터리에 대한 충전 상태별 전압/전류 분포함수족 {Fs,1} 0 ≤ s ≤ 100을 이 용하여 학습할 수 있다. 또한, 다층 퍼셉트론 분류기와 같은 기계학습 모델의 경우에는 각 배터리 상태에 대한 충전 상태별 전압/전압 분포함수족 예컨대, {Fs,0} 0 ≤ s ≤ 100과 {Fs,1} 0 ≤ s ≤ 100을 이용하여 변환한 가능도 행렬 집합 {LC,k}1 ≤ k ≤ N 을 벡터화한 후, 이를 입력 레이어(input layer)로 하고, 입력된 벡터가 3개의 은닉층 (hidden layer)을 거쳐, 식별 결과를 출력할 수 있다. 예를 들어, 다층 퍼셉트론 분류기는 정상 상태 배터리인 경우 1, 스웰링 발생한 배터리인 경우 0을 출력할 수 있다. 이에 따라 전자 장치는 기계학습 모델에서의 출력 결과에 따라 배터리 이상 유무뿐만 아니라 어떠한 배터리 이상 상태인지를 구분할 수 있다. 만일 학습을 통해 트레이닝된 다층 퍼셉트론 분류기에 학습에 사용되지 않은 부분 충전 데이터가 입력으로 들어오게 되면, 상기 다층 퍼셉트론 분류기는 식별 결과를 출력할 수 있으며, 전자 장치 는 식별 결과 기반하여 상기 입력된 부분 충전 데이터가 정상 상태에 속하는지 또는 이상 상태에 속하는지를 판 단할 수 있다. 한편, 학습을 통해 다층 퍼셉트론 분류기를 트레이닝하는 동작을 살펴보면, 하기와 같을 수 있다. 참고로, 학습상의 편의를 위하여, 입력 벡터는, 벡터화된 가능도 행렬의 말단에, 부분 충전곡선 데이터의 충전 상태 열(column)을 전치(transpose)한 벡터를 덧붙인(append) 형태로 구성된 경우를 전제로 할 수 있다. 예를 들어, 부분 충전 데이터(예: 118,000개)로부터 얻어진 학습 케이스 벡터(예: 118,000개)와, 각 학습 케이 스 벡터가 어떤 이상 상태에 놓인 배터리로부터 얻어졌는지를 나타내는 정답 레이블 집합(예: 118,000개)을 이 용하여 다층 퍼셉트론 분류기를 트레이닝한 결과, 트레이닝에 이용된 부분 충전 데이터(예: 118,000개)에 대해서는 실험 결과 99.6% 판정 정확도를 얻을 수 있다. 예를 들어, 도 9a의 부분 충전 데이터(예: 215,000 개)에 대해서는 다층 퍼셉트론 분류기에 의해 208,804개를 정상 상태로 판정하여 실험 결과 97.12% 의 판정 정확도를 얻을 수 있다. 또한 도 9b의 부분 충전 데이터(예: 40,000개)에 다층 퍼셉트론 분류기 에 의해 37,605개를 스웰링 상태로 판정하여 실험 결과 94.01%의 판정 정확도를 얻을 수 있다. 이와 같이 학습을 통해 트레이닝된 다층 퍼셉트론 분류기를 이용함으로써 매우 높은 판정 정확도를 얻을 수 있다. 도 11은 일 실시 예에 따른 부분 충전 상태에 대한 데이터를 이용한 학습 결과와 가능도 행렬을 이용한 학습 결 과를 비교한 그래프이다. 도 11을 참조하면, 전자 장치로부터 획득한 배터리의 부분 충전 곡선 데이터 즉, 부분 충전 상태 구간에서의 전 류 및 전압 분포도를 이용하여 배터리 상태를 판정하는 학습 모델을 학습시킬 수 있다. 예를 들어, 학습 모델은 기계학습 모델로, 다층 퍼셉트론(multilayer perceptron), 랜덤포레스트 (random forest)와 같은 교사 학습 모 델일 수 있다. 일 실시 예에 따르면, 다층 퍼셉트론 분류기를 학습하는 데 있어, 배터리의 부분 충전 곡선 데이터를 직접 학습 을 위한 입력 데이터로 사용하거나, 또는 부분 충전 곡선 데이터를 확률 밀도 함수(PDF)에 의하여 변환한 가능 도 행렬을 학습을 위한 입력 데이터로 사용할 수 있다. 도 11에 도시된 바를 참조하면, 부분 충전 곡선 데이터를 직접 사용한 학습 진행 시 동일 학습 횟수(예: 70 회 반복(iteration)) 후에는 학습 정확도(validation score)가 약 70%에 도달하는 것을 나타내고 있으며, 가능도 행렬을 학습 데이터로 이용하는 경우 동일 학습 횟수에서 학습 정확도가 약 90%까지 향상되는 경 우를 나타내고 있다. 여기서, 학습 손실(training loss)은 학습 모델과 학습 데이터간 오차 수치를 나타낼 수 있다. 이와 같이 학습 모델을 기반으로 배터리 이상 상태를 식별할 경우, 전자 장치는 실제 충전 또는 방전 시 더 빠르고 정확한 배터리 상태 식별이 가능할 수 있으며, 배터리에 대해 발생하는 다양한 이상 상태를 즉시 또는 사전에 식별할 수 있어, 배터리의 안전성을 확보할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치)에 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.명령들을 저장하고 있는 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상 기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도 하나의 동작은, 배터리의 충전 시의 충전 상태별 전압 및 전류 정보를 획득하는 동작, 복수의 배터리 상태들과 관련된 확률 참조 정보에 근거하여, 상기 전압 및 전류 정보에 대한 복수의 가능도 값들을 획득하는 동작 및 상기 복수 의 가능도 값들에 근거하여, 상기 배터리의 이상 유무 또는 배터리 상태를 식별하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 발명된 본 발명의 실시 예들은 본 발명의 실시 예에 따른 기술 내용을 쉽게 설명하 고 본 발명의 실시 예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시 예의 범위를 한정하 고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시 예의 범위는 여기에 발명된 실시 예들 이외에도 본 발명 의 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시 예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0090466", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예에 따른 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2는 일 실시 예에 따르면 배터리 이상 상태를 식별하기 위한 전자 장치를 나타내는 블럭도이다. 도 3a는 다양한 충전 패턴에 따른 데이터 변화를 설명하기 위한 도면이다. 도 3b는 실제 충전 시 데이터 변화를 설명하기 위한 도면이다. 도 4는 일 실시 예에 따른 배터리 이상 상태를 식별하기 위한 학습 과정을 설명하기 위한 블록도이다. 도 5는 일 실시 예에 따른 충전 상태별 전압 및 전압에 대한 확률 분포 함수를 예시한 도면이다. 도 6은 일 실시 예에 따른 전자 장치에서 배터리 이상 상태를 식별하기 위한 동작 흐름도이다. 도 7은 일 실시 예에 따른 충전 패턴의 변화와 건전 지표 간의 관계를 나타낸 도면이다. 도 8은 일 실시 예에 따른 배터리 이상 상태와 관련된 정보를 제공하기 위한 화면 예시도이다. 도 9a 및 도 9b는 일 실시 예에 따른 부분 충전 상태에 대한 데이터 및 가능도 행렬을 나타낸 도면들이다. 도 10은 일 실시 예에 따른 배터리 이상 상태를 식별하는 학습 모듈을 설명하기 위한 도면이다. 도 11은 일 실시 예에 따른 부분 충전 상태에 대한 데이터를 이용한 학습 결과와 가능도 행렬을 이용한 학습 결 과를 비교한 그래프이다."}
