{"patent_id": "10-2022-0063199", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0163653", "출원번호": "10-2022-0063199", "발명의 명칭": "인공지능 기반 뷰티 제품 리뷰 키워드 도출 플랫폼 서비스 제공 방법, 장치 및 시스템", "출원인": "우보람", "발명자": "우보람"}}
{"patent_id": "10-2022-0063199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "장치에 의해 수행되는 방법에 있어서,텍스트 리뷰 수집부 및 이미지 리뷰 수집부 중 하나 이상에 의해 특정 웹 사이트에 게시되어 있는 특정 화장품물품에 대한 복수 개의 리뷰를 1차 수집하는 단계;1차 수집된 상기 리뷰에서 이미지 정보는 이미지 리뷰 분석부에 의해 적어도 발색, 제품 용기, 포장을 포함하는카테고리로 구분하여 수치화하고, 텍스트 정보는 텍스트 리뷰 분석부에 의해 적어도 긍정, 부정을 포함하도록구분하여 수치화하는 1차 분석 단계;리뷰 비교부에 의해 수치화된 상기 이미지 정보와 수치화된 상기 텍스트 정보 중에서 수치가 높은 우선 노출 대상 리뷰를 선정하는 단계; 및리뷰 재배치부에 의해 상기 우선 노출 대상 리뷰가 사용자에게 먼저 보여 지거나 다른 리뷰에 비해 상대적으로더 큰 비중으로 보여 지도록 상기 특정 웹 사이트에 게시되어 있는 상기 특정 화장품에 대한 리뷰를 재배치하는단계를 포함하는인공지능 기반 뷰티 제품 리뷰 키워드 도출 플랫폼 서비스 제공 방법, 장치 및 시스템."}
{"patent_id": "10-2022-0063199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,텍스트 리뷰 수집부 및 이미지 리뷰 수집부 중 하나 이상에 의해 상기 특정 웹 사이트에 게시되어 있는 상기 특정 화장품에 대한 복수 개의 리뷰를 2차 수집하는 단계;상기 2차 수집된 리뷰가 포함하고 있는 텍스트 정보를 데이터베이스에 저장하고, 텍스트 리뷰 분석부에 의해 저장된 데이터를 분석하여 텍스트 정보로부터 적어도 긍정, 부정을 포함하도록 구분하여 수치화하는 2차 분석 단계; 및리뷰 비교부에 의해 상기 1차 분석 단계에서 얻어진 텍스트 정보의 수치화된 결과값과 상기 2차 분석 단계에서얻어진 텍스트 정보의 수치화된 결과값을 비교하여 상기 특정 웹 사이트의 관리자에게 제공하는 단계를 더 포함하는인공지능 기반 뷰티 제품 리뷰 키워드 도출 플랫폼 서비스 제공 방법, 장치 및 시스템."}
{"patent_id": "10-2022-0063199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,텍스트 정보를 수치화하는 단계는,텍스트 리뷰 분석부에 의해 텍스트 정보에 대해 형태소 분석을 하고, 추출된 단어 또는 구문과 사용자 사전에저장된 단어 또는 구문을 매칭시켜, 매칭되는 단어 또는 구문을 긍정, 부정을 포함하도록 구분하는 단계;텍스트 리뷰 분석부에 의해 형태소 분석을 통해 추출된 단어들에 품사를 부여하는 단계;텍스트 리뷰 분석부에 의해 추출된 품사들에 대해 기 설정된 가중치를 부여하는 단계;텍스트 리뷰 분석부에 의해 추출된 품사별 가중치와 문자 수를 곱한 값을 더하여 상기 텍스트 정보를 수치화 하는 단계를 포함하고,공개특허 10-2023-0163653-3-이미지 정보를 수치화하는 단계는,이미지 리뷰 분석부에 의해 상기 이미지 정보 중 발색 카테고리에 가장 높은 가중치를 부여하고, 제품 용기 카테고리에 두번째 높은 가중치를 부여하고, 포장 카테고리에 가장 낮은 가중치를 부여하는 단계; 및이미지 리뷰 분석부에 의해 수집된 이미지 정보를 발색 카테고리, 제품 용기 카테고리, 포장 카테고리 중 하나로 분류하고, 분류된 카테고리 이미지의 추론율에 카테고리별 상기 가중치를 곱하여 상기 이미지 정보를 수치화하는 단계를 포함하는인공지능 기반 뷰티 제품 리뷰 키워드 도출 플랫폼 서비스 제공 방법, 장치 및 시스템."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일실시예에 따른 장치는 텍스트 리뷰 수집부 및 이미지 리뷰 수집부 중 하나 이상에 의해 특정 웹 사이트에 게시 되어 있는 특정 화장품 물품에 대한 복수 개의 리뷰를 1차 수집하고, 1차 수집된 리뷰에서 이미지 정보는 이미지 리뷰 분석부에 의해 적어도 발색, 제품 용기, 포장을 포함하는 카테고리로 구분하여 수치화하고, 텍스트 정보는 텍스트 리뷰 분석부에 의해 적어도 긍정, 부정을 포함하도록 구분하여 수치화하는 1차 분석하고, 리뷰 비교부에 의해 수치화된 이미지 정보와 수치화된 텍스트 정보 중에서 수치가 높은 우선 노출 대상 리뷰를 선정하고, 리뷰 재배치부에 의해 우선 노출 대상 리뷰가 사용자에게 먼저 보여 지거나 다른 리뷰에 비해 상대적으로 더 큰 비중 으로 보여 지도록 특정 웹 사이트에 게시되어 있는 특정 화장품에 대한 리뷰를 재배치할 수 있다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래 실시예들은 인공지능 기반의 뷰티 제품 리뷰 키워드 도출 플랫폼 서비스를 제공하는 기술에 관한 것이다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "미용에 관한 관심이 증대됨에 따라 다양한 화장품에 대한 소비가 증가하고 있다. 또한, 전자상거래의 발전으로 온라인 상에서 화장품을 구매하는 수요가 증가하고 있다. 그런데 화장품은 사용자의 신체에 직접 바르면서 사용하는 상품이라는 특성이 있고, 사용 시 외모에 직/간접적 인 영향을 미치는바, 온라인상에서 화장품을 구매하고자 하는 수요자는 화장품을 구매하기 전 화장품에 대한 리 뷰를 참고하여 구매 결정을 내리는 경향이 있다. 그러나, 종래의 인터넷 상에 업로드 된 리뷰는 반복되는 표현이 많고, 리뷰의 질에 상관없이 최근 업로드된 순 서로 보여지기 때문에 제품 정보 파악 또는 제품 구매에 도움이 될 수 있는 리뷰를 찾기까지 오랜 시간이 걸린 다는 단점이 있었다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 인공지능을 기반으로 뷰티 제품 리뷰 키워드를 도출하는 플랫폼 서비스 제공하고자 한다. 실시예들은 인터넷을 통해 수집된 화장품 리뷰 정보를 분석하여 개선된 리뷰 정보를 사용자에게 제공하고자 한 다. 실시예들은 양질의 고품질 리뷰를 고객에게 제공함으로써, 고객의 서비스 이용 경험을 향상시키고, 궁극적으로 판매자의 매출 향상에 기여하고자 한다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일실시예에 따르면, 장치에 의해 수행되는 방법에 있어서, 텍스트 리뷰 수집부 및 이미지 리뷰 수집부 중 하나 이상에 의해 특정 웹 사이트에 게시되어 있는 특정 화장품 물품에 대한 복수 개의 리뷰를 1차 수집하는 단계; 1 차 수집된 상기 리뷰에서 이미지 정보는 이미지 리뷰 분석부에 의해 적어도 발색, 제품 용기, 포장을 포함하는 카테고리로 구분하여 수치화하고, 텍스트 정보는 텍스트 리뷰 분석부에 의해 적어도 긍정, 부정을 포함하도록 구분하여 수치화하는 1차 분석 단계; 리뷰 비교부에 의해 수치화된 상기 이미지 정보와 수치화된 상기 텍스트 정보 중에서 수치가 높은 우선 노출 대상 리뷰를 선정하는 단계; 및 리뷰 재배치부에 의해 상기 우선 노출 대상 리뷰가 사용자에게 먼저 보여 지거나 다른 리뷰에 비해 상대적으로 더 큰 비중으로 보여 지도록 상기 특정 웹 사이트에 게시되어 있는 상기 특정 화장품에 대한 리뷰를 재배치하는 단계를 포함할 수 있다. 상기 장치에 의해 수행되는 방법에 있어서, 텍스트 리뷰 수집부 및 이미지 리뷰 수집부 중 하나 이상에 의해 상 기 특정 웹 사이트에 게시되어 있는 상기 특정 화장품에 대한 복수 개의 리뷰를 2차 수집하는 단계; 상기 2차 수집된 리뷰가 포함하고 있는 텍스트 정보를 데이터베이스에 저장하고, 텍스트 리뷰 분석부에 의해 저장된 데이 터를 분석하여 텍스트 정보로부터 적어도 긍정, 부정을 포함하도록 구분하여 수치화하는 2차 분석 단계; 및 리뷰 비교부에 의해 상기 1차 분석 단계에서 얻어진 텍스트 정보의 수치화된 결과값과 상기 2차 분석 단계에서 얻 어진 텍스트 정보의 수치화된 결과값을 비교하여 상기 특정 웹 사이트의 관리자에게 제공하는 단계를 더 포함할 수 있다. 상기 텍스트 정보를 수치화하는 단계는, 텍스트 리뷰 분석부에 의해 텍스트 정보에 대해 형태소 분석을 하고, 추출된 단어 또는 구문과 사용자 사전에 저장된 단어 또는 구문을 매칭시켜, 매칭되는 단어 또는 구문을 긍정, 부정을 포함하도록 구분하는 단계; 텍스트 리뷰 분석부에 의해 형태소 분석을 통해 추출된 단어들에 품사를 부 여하는 단계; 텍스트 리뷰 분석부에 의해 추출된 품사들에 대해 기 설정된 가중치를 부여하는 단계; 및 텍스트 리뷰 분석부에 의해 추출된 품사별 가중치와 문자 수를 곱한 값을 더하여 상기 텍스트 정보를 수치화 하는 단계 를 포함할 수 있다. 상기 이미지 정보를 수치화하는 단계는, 이미지 리뷰 분석부에 의해 상기 이미지 정보 중 발색 카테고리에 가장 높은 가중치를 부여하고, 제품 용기 카테고리에 두번째 높은 가중치를 부여하고, 포장 카테고리에 가장 낮은 가 중치를 부여하는 단계; 및 이미지 리뷰 분석부에 의해 수집된 이미지 정보를 발색 카테고리, 제품 용기 카테고 리, 포장 카테고리 중 하나로 분류하고, 분류된 카테고리 이미지의 추론율에 카테고리별 상기 가중치를 곱하여 상기 이미지 정보를 수치화 하는 단계를 포함할 수 있다. 일실시예에 따른 장치는 하드웨어와 결합되어 상술한 방법들 중 어느 하나의 항의 방법을 실행시키기 위하여 매 체에 저장된 컴퓨터 프로그램에 의해 제어될 수 있다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들은 인공지능을 기반으로 뷰티 제품 리뷰 키워드를 도출하는 플랫폼 서비스 제공할 수 있다. 실시예들은 인터넷을 통해 수집된 화장품 리뷰 정보를 분석하여 개선된 리뷰 정보를 사용자에게 제공할 수 있다. 실시예들은 양질의 고품질 리뷰를 고객에게 제공함으로써, 고객의 서비스 이용 경험을 향상시키고, 궁극적으로 판매자의 매출 향상에 기여할 수 있다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 실시예들을 상세하게 설명한다. 그러나, 실시예들에는 다양한 변경이 가해 질 수 있어서 특허출원의 권리 범위가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 실시예들에 대한 모든 변경, 균등물 내지 대체물이 권리 범위에 포함되는 것으로 이해되어야 한다. 실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 실시될 수 있다. 따라서, 실시예들은 특정한 개시형태로 한정되는 것이 아니며, 본 명세서의 범 위는 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 실시예에서 사용한 용어는 단지 설명을 목적으로 사용된 것으로, 한정하려는 의도로 해석되어서는 안된다. 단 수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시예가 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조부호를 부여 하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적 인 설명이 실시예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 실시예들은 퍼스널 컴퓨터, 랩톱 컴퓨터, 태블릿 컴퓨터, 스마트 폰, 텔레비전, 스마트 가전 기기, 지능형 자동 차, 키오스크, 웨어러블 장치 등 다양한 형태의 제품으로 구현될 수 있다. 도 1은 일실시예에 따른 시스템의 구성을 설명하기 위한 도면이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 시스템은 사용자 단말기와 웹 서버와 리뷰 분석 유닛 을 포함할 수 있다. 여기서, 웹 서버와 리뷰 분석 유닛은 하나의 물리적인 장치로 구성될 수 있고, 서로 독립적인 장치로 제공되어 직접 데이터 통신 가능하게 제공되거나 통신망을 통해 데이터 통신 가능하 게 구성될 수도 있다. 본 실시예에서는, 웹 서버와 리뷰 분석 유닛은 별개의 독립적인 서버로 운영되는 것을 예로 들어 설명 한다. 또한, 리뷰 분석 유닛이 별개의 독립적인 서버로 운영되는 경우 리뷰 분석 유닛은 리뷰 분석 결 과를 판매자에게 제공하는 장치로 이해될 수 있다. 사용자 단말기와 웹 서버와 리뷰 분석 유닛은 통신망을 통해 서로 데이터를 송수신 할 수 있게 연결될 수 있다. 일실시예에 따르면, 시스템은 상품을 구매하려는 사용자에게 상품과 관련된 고품질의 리뷰를 제공할 수 있고, 판매자에게 리뷰 분석 결과를 시각화하여 제공할 수 있으며, 이와 같은 기능은 리뷰 분석 유닛에 의 해 구현될 수 있다. 예를 들어, 복수의 사용자가 사용자 단말기를 통해 화장품을 판매하는 웹 서버의 웹 사이트에 리뷰를 업로드 하는 경우, 리뷰 분석 유닛은 웹 사이트에 업로드 된 리뷰를 1차 수집 및 분석하여 고품질의 리뷰를 재배치하여 사용자에게 보여줄 수 있다. 그 후, 기 설정된 조건을 만족하는 경우(예를 들어, 기 설정된 시간이 경과하거나 또는 기 설정된 리뷰 개수가 웹 서버에 업로드 된 후), 리뷰 분석 유닛은 웹 사이트에 업로 드 된 리뷰를 2차 수집 및 분석하여 1차 수집된 리뷰와 2차 수집된 리뷰의 비교 결과를 판매자에게 시각화하여 제공할 수 있다. 사용자 단말기는 사용자가 화장품에 대한 리뷰를 입력할 수 있도록 제공되는 장치로서, 컴퓨팅 장치로 구현 되는 고정형 단말이거나 이동형 단말일 수 있다. 예를 들어, 사용자 단말기는 컴퓨터, 노트북, 태블릿 PC, 스마트폰, 휴대폰, 웨어러블 기기 등일 수 있다. 다만 이러한 예에 한정되지 않으며, 사용자 단말기는 사용 자가 리뷰 작성에 필요한 정보를 입력할 수 있고, 리뷰를 사용자에게 표시할 수 있는 기능을 갖는 임의의 단말 일 수 있다. 웹 서버는 화장품을 판매하는 웹 사이트를 제공할 수 있으며, 웹 서버는 판매하는 화장품 상품 정보를 저장하고, 상품 정보를 사용자에게 제공할 수 있다. 또한, 사용자 단말기를 통해 사용자가 화장품에 대한 리뷰를 입력하는 경우, 화장품에 대한 리뷰는 웹 서버 에 별도로 마련된 데이터베이스(도면 미도시)에 저장될 수 있고, 후술하는 리뷰 분석 유닛의 데이터베 이스에 저장될 수도 있다. 도 2는 일실시예에 따른 리뷰 분석 유닛을 설명하기 위한 구성도 도면이다. 도 2를 참조하면, 리뷰 분석 유닛은 입출력 인터페이스, 메모리, 프로세서, 통신 모듈(40 0)을 포함할 수 있다.프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리 또는 통신 모듈로부터 프로세서로 제공될 수 있다. 그 외에 명 령은 리뷰 분석 유닛을 구성하는 각각의 구성요소들 간의 통신 채널인 버스(bus)를 통해서도 프로세서(30 0)로 제공될 수 있다. 또한, 메모리에는 고품질의 리뷰를 재배치하고, 리뷰들의 비교 결과를 판매자에게 시각화하여 제공하기 위 해 필요한 데이터를 저장할 수 있는 데이터베이스가 제공될 수 있다. 즉, 메모리는 데이터베이스 를 포함하는 것으로 이해될 수 있다. 데이터베이스는 소프트웨어적으로 독립적으로 구축된 데이터베이스뿐만 아니라, 데이터를 저장할 수 있는 임의의 형태의 저장소일 수 있다. 통신 모듈은 통신망을 통해 리뷰 분석 유닛과 사용자 단말기 또는 리뷰 분석 유닛과 웹 서버가 서로 통신하기 위한 기능을 제공할 수 있다. 입출력 인터페이스는 사용자 또는 관리자로부터 리뷰에 관련된 데이터를 입력 받거나, 프로세서나 메 모리, 통신 모듈 등으로부터 제공되는 데이터를 사용자 또는 관리자에게 출력하는 구성요소로서, 물 리적 측면의 하드웨어 인터페이스 및 논리적 측면의 소프트웨어 인터페이스를 모두 포함하는 것으로 이해될 수 있다. 예를 들어, 입출력 인터페이스는 입력 장치로서 키보드, 마우스, 마이크 등의 장치를 포함하고, 출력 장치 로서 디스플레이, 스피커 등과 같은 장치를 포함할 수 있다. 다른 예로서, 입출력 인터페이스는 터치스크 린과 같이 입력과 출력이 하나로 통합된 장치, 터치 펜 등의 입력 도구를 포함할 수도 있다. 도 3은 일실시예에 따른 리뷰 분석 유닛을 이용한 개선된 리뷰 정보를 사용자에게 제공하는 방법을 설명하기 위 한 순서도이다. 도 3을 참조하면, 먼저 S10 단계에서, 사용자 단말기를 통해 화장품에 대한 리뷰가 입력되면, 텍스트 리뷰 수집부와 이미지 리뷰 수집부에 의해 리뷰의 텍스트 정보와 이미지 정보가 구분되어 1차 수집 및 저 장될 수 있다. 예를 들어, 사용자 단말기로부터 이미지와 텍스트가 혼합된 리뷰가 입력되는 경우, 텍스트 리뷰 수집부 는 입력된 리뷰 중 텍스트 정보만을 수집 및 저장하고, 이미지 리뷰 수집부는 입력된 리뷰 중 이미지 정보만을 수집 및 저장할 수 있다. S20 단계에서, 텍스트 리뷰 분석부는 텍스트 리뷰 수집부에 의해 1차수집된 텍스트 정보를 분석하고, 이미지 리뷰 분석부는 이미지 리뷰 수집부에 의해 1차 수집된 이미지 정보를 분석할 수 있다. 구체적으로, 텍스트 리뷰 분석부에 의해 수집된 텍스트 정보는 감정 처리 단계를 포함할 수 있으며, 감정 처리 단계는 수집된 텍스트 정보를 긍정과 부정으로 판별하는 과정 및 수집된 텍스트 정보를 수치화하는 과정 중 적어도 하나를 포함할 수 있으며, 이에 대한 자세한 설명은 후술한다. 여기서, 감정 처리 단계는 텍스트 정 보에서 특수 문자와 같은 불필요한 문자를 제거하고 띄어쓰기 처리하는 전처리 과정을 거친 후, 감정 분류 알고 리즘을 적용(예를 들어, 하이브리드 방식)하는 것으로 이해될 수 있다. 감정 분류 알고리즘은 전처리 과정을 거 친 텍스트 정보를 동의어 사전을 이용한 동의어 처리 및 사용자 사전을 이용한 형태소 분석 과정을 거쳐 품사별 가중치를 부여하여 텍스트 정보를 수치화하는 것으로 이해될 수 있다. 한편, 발색 카테고리로 분류되는 이미지 정보는 사용자의 피부에 화장료가 도포된 이미지일 수 있다. 예를 들어, 발색 카테고리로 분류되는 이미지 정보는 입술 발색, 아이섀도우 발색, 블러셔 발색을 포함하는 리뷰일 수 있다. 제품 용기 카테고리로 분류되는 이미지 정보는 제품 용기에 대한 이미지 일 수 있다. 예를 들어, 제품 용기 카 테고리로 분류되는 이미지 정보는 립제품, 아이섀도우 제품, 블러셔 제품을 포함하는 리뷰일 수 있다. 포장의 카테고리로 분류되는 이미지 정보는 제품 용기를 포장하는 상자에 대한 이미지 일 수 있다. 예를 들어, 포장 카테고리로 분류되는 이미지 정보는 상자, 택배 상자, 화장품 박스의 이미지 정보를 포함하는 리뷰일 수 있다. S30 단계에서, 텍스트 리뷰 분석부와 이미지 리뷰 분석부에 의해 텍스트 정보와 이미지 정보가 수치 화 된 경우, 리뷰 비교부에 의해 수치화된 이미지 정보와 텍스트 정보 중에서 수치가 높은 우선 노출 대상리뷰가 선정될 수 있다. 예를 들어, 리뷰 비교부에 의해 텍스트 정보 또는 이미지 정보의 수치 수치가 1000 이상이면 우수 리뷰로 분류되어, 우선 노출 대상 리뷰로 선정될 수 있다. 이미지 정보의 경우 발색 이미지일 추론 확률이 100% 일 때 1000으로 수치화 될 수 있어, 우선 노출 대상 리뷰로 선정될 수 있다. S40 단계에서, 리뷰 재배치부에 의해 우선 노출 대상 리뷰가 사용자에게 먼저 보여 지거나 다른 리뷰에 비 해 상대적으로 더 큰 비중으로 보여 지도록 특정 웹 사이트에 게시되어 있는 특정 화장품에 대한 리뷰가 재배치 될 수 있다. S50 단계에서, 우선 노출 대상 리뷰가 웹 서버의 웹 사이트상에서 재배치된 후, 기 설정된 시간이 경과하거 나 또는 기 설정된 리뷰 개수가 웹 서버에 업로드되는 경우, 텍스트 리뷰 수집부와 이미지 리뷰 수집 부에 의해 리뷰의 텍스트 정보와 이미지 정보가 구분되어 2차 수집 및 저장될 수 있다. S60 단계에서, 텍스트 리뷰 분석부는 텍스트 리뷰 수집부에 의해 2차수집된 텍스트 정보를 분석하고, 이미지 리뷰 분석부는 이미지 리뷰 수집부에 의해 2차 수집된 이미지 정보를 분석할 수 있다. 구체적으로, 텍스트 리뷰 분석부에 의해 2차 수집된 텍스트 정보는 감정 처리 단계를 거쳐 수치화되고, 이 미지 리뷰 분석부는 2차 수집된 이미지 정보를 발색, 제품 용기, 포장의 카테고리로 구분하여, 각 카테고 리별 등급을 구분하여 수치화 할 수 있다. 도 4는 일실시예에 따른 장치의 구성의 예시도이다. 일실시예에 따른 장치는 프로세서 및 메모리를 포함한다. 일실시예에 따른 장치는 상술한 서버 또는 단말일 수 있다. 프로세서는 도 1 내지 도 3을 통하여 전술한 적어도 하나의 장치들을 포함하거나, 도 1 내지 도 3을 통하여 전술한 적어도 하나의 방법을 수행할 수 있다. 메모리는 상술한 방법과 관련된 정보를 저장하거나 상술한 방법이 구현된 프로그램을 저장할 수 있다. 메모리는 휘발성 메모리 또는 비휘 발성 메모리일 수 있다. 프로세서는 프로그램을 실행하고, 장치를 제어할 수 있다. 프로세서에 의하여 실행되는 프로그 램의 코드는 메모리에 저장될 수 있다. 장치는 입출력 장치(도면 미 표시)를 통하여 외부 장치(예를 들어, 퍼스널 컴퓨터 또는 네트워크)에 연결되고, 데이터를 교환할 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터 를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다."}
{"patent_id": "10-2022-0063199", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 상기를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다."}
{"patent_id": "10-2022-0063199", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일실시예에 따른 시스템의 구성을 설명하기 위한 도면이다. 도 2는 일실시예에 따른 리뷰 분석 유닛을 설명하기 위한 구성도 도면이다. 도 3은 일실시예에 따른 리뷰 분석 유닛을 이용한 개선된 리뷰 정보를 사용자에게 제공하는 방법을 설명하기 위 한 순서도이다. 도 4는 일실시예에 따른 장치의 구성의 예시도이다."}
