{"patent_id": "10-2023-0197113", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0120646", "출원번호": "10-2023-0197113", "발명의 명칭": "팔꿈치 측면 엑스레이 영상과 인공지능 모델을 이용한 사춘기 팔꿈치 골연령 평가 방법 및 장", "출원인": "고려대학교 산학협력단", "발명자": "최가영"}}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "골연령 평가 장치에서 수행되는 골연령 평가 방법에 있어서,(a) 팔꿈치 측면의 엑스레이 영상을 획득하는 단계;(b) 상기 엑스레이 영상에서 팔꿈치머리 영역을 분할하는 단계;(c) 상기 분할한 팔꿈치머리 영역에서 팔꿈치머리 골화중심의 형태적 특징을 분석하는 단계; 및(d) 상기 분석한 형태적 특징을 기초로 골연령을 판정하는 단계를 포함하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 (b) 단계는,상기 엑스레이 영상에서 뼈 영역을 픽셀 단위로 예측하는 단계; 및상기 픽셀 단위로 예측한 결과에 따라 상기 엑스레이 영상에서 팔꿈치머리에 해당하는 영역을 분할하는 단계를포함하는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 (c) 단계는,상기 팔꿈치머리 영역에서 팔꿈치머리 골화중심에 대한 영역을 결정하는 단계; 및상기 팔꿈치머리 골화중심의 형태적 특징을 판단하는 단계를 포함하는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 (d) 단계는,상기 팔꿈치머리 골화중심의 형태적 특징을 기초로 기설정된 연령별 팔꿈치머리 특성 기준에 따라 팔꿈치머리골연령을 분류하는 단계를 포함하는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 기설정된 연령별 팔꿈치머리 특성 기준은,여아인 경우에는 9.5세부터 13세까지 6개월 단위로 설정되고, 남아인 경우에는 11.5세부터 15세까지 6개월 단위로 설정되는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 기설정된 연령별 팔꿈치머리 특성 기준은,상기 여아인 경우 11.25세 및 상기 남아인 경우 13.25세에 대한 팔꿈치머리 특성 기준이 더 설정되는 것을 특징으로 하는 골연령 평가 방법.공개특허 10-2024-0120646-3-청구항 7 제4항에 있어서, 상기 기설정된 연령별 팔꿈치머리 특성 기준은,상기 팔꿈치머리의 골화중심과 부골화중심의 융합 순서에 따라 제1 골화 과정 및 제2 골화 과정으로 분류되는것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 제1 골화 과정은,팔꿈치머리 몸통의 높이가 20% 이상 및 50% 미만인 작은 팔꿈치머리 골화중심 단계, 팔꿈치머리 몸통의 높이가50% 이상인 확대된 팔꿈치머리 골화중심 단계, 부골화중심의 출현 단계, 팔꿈치머리 골화중심과 부골화중심의융합 단계, 융합된 골화중심의 확대 단계, 팔꿈치머리 뼈돌기의 50% 미만 부분적 융합 단계, 팔꿈치머리 뼈돌기의 50% 이상 부분적 융합 단계, 및 팔꿈치머리 뼈돌기의 완전한 융합 단계로 구성되는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 팔꿈치머리 골화중심과 부골화중심의 융합 단계와 융합된 골화중심의 확대 단계의 사이에 팔꿈치머리 골화중심과 부골화중심의 융합 이후에 다른 부골화중심의 출현 단계를 더 포함하는 것을 특징으로 하는 골연령 평가방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 제2 골화 과정은,팔꿈치머리 몸통의 높이가 20% 이상 및 50% 미만인 작은 팔꿈치머리 골화중심 단계, 팔꿈치머리 몸통의 높이가50% 이상인 확대된 팔꿈치머리 골화중심 단계, 부골화중심의 출현 단계, 부골화중심과 팔꿈치머리 몸통의 융합단계, 융합된 부골화중심-팔꿈치머리 몸통과 융합되지 않은 팔꿈치머리 골화중심의 확대 단계, 팔꿈치머리 골화중심과 융합된 부골화중심-팔꿈치머리 몸통의 50% 미만 부분적 융합 단계, 팔꿈치머리 뼈돌기의 50% 이상 부분적 융합 단계, 및 팔꿈치머리 뼈돌기의 완전한 융합 단계로 구성되는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 부골화중심과 팔꿈치머리 몸통의 융합 단계와 융합된 부골화중심-팔꿈치머리 몸통과 융합되지 않은 팔꿈치머리 골화중심의 확대 단계의 사이에 팔꿈치머리 골화중심과 부골화중심의 융합 이후에 다른 부골화중심의 출현단계를 더 포함하는 것을 특징으로 하는 골연령 평가 방법."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "팔꿈치 측면의 엑스레이 영상을 획득하는 영상 획득부;상기 엑스레이 영상에서 팔꿈치머리 영역을 분할하는 영역 분할부;상기 분할한 팔꿈치머리 영역에서 팔꿈치머리 골화중심의 형태적 특징을 분석하는 형태 분석부; 및공개특허 10-2024-0120646-4-상기 분석한 형태적 특징을 기초로 골연령을 판정하는 골연령 판정부를 포함하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 영역 분할부는,상기 엑스레이 영상에서 뼈 영역을 픽셀 단위로 예측하고, 상기 픽셀 단위로 예측한 결과에 따라 상기 엑스레이영상에서 팔꿈치머리에 해당하는 영역을 분할하는 것을 특징으로 하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 형태 분석부는,상기 팔꿈치머리 영역에서 팔꿈치머리 골화중심에 대한 영역을 결정하고, 상기 팔꿈치머리 골화중심의 형태적특징을 판단하는 것을 특징으로 하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 골연령 판정부는,상기 팔꿈치머리 골화중심의 형태적 특징을 기초로 기설정된 연령별 팔꿈치머리 특성 기준에 따라 팔꿈치머리골연령을 분류하는 것을 특징으로 하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 기설정된 연령별 팔꿈치머리 특성 기준은,여아인 경우에는 9.5세부터 13세까지 6개월 단위로 설정되고, 남아인 경우에는 11.5세부터 15세까지 6개월 단위로 설정되는 것을 특징으로 하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 기설정된 연령별 팔꿈치머리 특성 기준은,상기 여아인 경우 11.25세 및 상기 남아인 경우 13.25세에 대한 팔꿈치머리 특성 기준이 더 설정되는 것을 특징으로 하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서, 상기 기설정된 연령별 팔꿈치머리 특성 기준은,상기 팔꿈치머리의 골화중심과 부골화중심의 융합 순서에 따라 제1 골화 과정 및 제2 골화 과정으로 분류되는것을 특징으로 하는 골연령 평가 장치."}
{"patent_id": "10-2023-0197113", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "컴퓨터 판독 가능 매체에 저장되어 있는 컴퓨터 프로그램에 있어서,상기 컴퓨터 프로그램의 명령이 실행될 경우, 제1항 내지 제11항 중 어느 한 항에 따른 방법이 수행되는 것을특징으로 하는 컴퓨터 판독 가능 매체에 저장되어 있는 컴퓨터 프로그램.공개특허 10-2024-0120646-5-"}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 골연령 평가 장치에서 수행되는 골연령 평가 방법으로서, (a) 팔꿈치 측면의 엑스레이 영상을 획득하 는 단계, (b) 상기 엑스레이 영상에서 팔꿈치머리 영역을 분할하는 단계, (c) 상기 분할한 팔꿈치머리 영역에서 팔꿈치머리 골화중심의 형태적 특징을 분석하는 단계, 및 (d) 상기 분석한 형태적 특징을 기초로 골연령을 판정 하는 단계를 포함한다."}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 골연령 평가 기술에 관한 것으로서, 보다 상세하게는, 사춘기 소아의 팔꿈치 측면 엑스레이 영상을 이용한 골연령 평가 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소아 청소년의 골연령 평가는 환아의 신체적 성숙도를 정확히 평가하는데 중요하며 환아의 역연령과는 차이가 있을 수 있다. 골연령 평가를 위해 가장 널리 이용되는 방법은 수골 골연령 판정법이지만 이 방법은 사춘기 시 기에는 부정확하고 판정 연령의 간격이 커서 임상 적용에도 제한이 있는 단점이 있다. 따라서 사춘기 시기 소아 청소년의 골연령 평가에는 팔꿈치 엑스레이 영상을 이용하는 방법이 널리 이용되고 있다. 사춘기 중 초기 2년은 가속 단계(acceleration phase)로 급성장(growth spurt)을 보이고 사춘기 기간 중 키가 가장 많이 크는 시기인 신장최대속도(peak height velocity; PHV)와 태너 스테이지 2(Tanner stage 2)의 성성 숙도가 그 시작을 알리는 지표이다. 이 시기 동안 팔꿈치머리 뼈돌기의 골화 과정은 매우 특징적인 형태학적 변 화를 보이고, 팔꿈치머리 뼈돌기의 골화 과정이 완료되면서 초기 사춘기인 가속 단계가 종료되고, 후기 사춘기 인 감속 단계(deceleration phase)가 시작된다. 따라서 급격하게 변화하는 팔꿈치머리 뼈돌기의 골화 과정을 이 용하여 골연령을 판정하면 급성장을 보이는 초기 사춘기 시기의 정확한 평가가 가능하다. 팔꿈치머리 뼈돌기의 골화 과정을 이용한 기존의 팔꿈치 골연령 평가 방법으로는 Sauvegrain et al. 방법과 Dimeglio et al. 방법이 있다. Sauvegrain et al.의 방법이 가장 전통적으로 많이 사용되고 있으나 팔꿈치 전후 와 측면에 해당하는 2장의 엑스레이 영상을 필요로 하므로 방사선 노출량이 많고, 팔꿈치를 구성하는 각 부위의 형태를 평가하여 점수의 합으로 골연령을 판정하므로 판독법이 복잡하다는 단점이 있다. Dimeglio et al. 방법 은 팔꿈치 측면에 해당하는 1장의 엑스레이 영상만을 필요로 하나 팔꿈치머리 뼈돌기 골화 과정의 다양성을 반 영하지 못해 실제 임상에 적용하기에는 제한점이 많고 부정확하다는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2019-0142234호"}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 사춘기 시기동안 팔꿈치 측면 엑스레이에서 확인할 수 있는 팔꿈치머리 뼈돌기의 성숙 과정에 서 보이는 골화중심 생성 및 융합 단계를 형태학적으로 세분화하고 다양하고 특징적인 변화과정을 반영하는 골 연령 평가 방법 및 장치를 제공하는데 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 제1 측면은, 골연령 평가 장치에서 수행되는 골연령 평가 방법으로서, (a) 팔꿈치 측면의 엑스레이 영상을 획득하는 단계, (b) 상기 엑스레이 영상에서 팔꿈치머리 영역을 분할하는 단계, (c) 상기 분할한 팔꿈치머리 영역에서 팔꿈치머리 골화중심의 형태적 특징을 분석하는 단계, 및 (d) 상기분석한 형태적 특징을 기초로 골연령을 판정하는 단계를 포함한다. 바람직하게, 상기 (b) 단계는, 상기 엑스레이 영상에서 뼈 영역을 픽셀 단위로 예측하는 단계, 및 상기 픽셀 단 위로 예측한 결과에 따라 상기 엑스레이 영상에서 팔꿈치머리에 해당하는 영역을 분할하는 단계를 포함할 수 있 다. 바람직하게, 상기 (c) 단계는, 상기 팔꿈치머리 영역에서 팔꿈치머리 골화중심에 대한 영역을 결정하는 단계, 및 상기 팔꿈치머리 골화중심의 형태적 특징을 판단하는 단계를 포함할 수 있다. 바람직하게, 상기 (d) 단계는, 상기 팔꿈치머리 골화중심의 형태적 특징을 기초로 기설정된 연령별 팔꿈치머리 특성 기준에 따라 팔꿈치머리 골연령을 분류하는 단계를 포함할 수 있다. 바람직하게, 상기 기설정된 연령별 팔꿈치머리 특성 기준은, 여아인 경우에는 9.5세부터 13세까지 6개월 단위로 설정되고, 남아인 경우에는 11.5세부터 15세까지 6개월 단위로 설정될 수 있다. 바람직하게, 상기 기설정된 연령별 팔꿈치머리 특성 기준은, 상기 여아인 경우 11.25세 및 상기 남아인 경우 13.25세에 대한 팔꿈치머리 특성 기준이 더 설정될 수 있다. 바람직하게, 상기 기설정된 연령별 팔꿈치머리 특성 기준은, 상기 팔꿈치머리의 골화중심과 부골화중심의 융합 순서에 따라 제1 골화 과정 및 제2 골화 과정으로 분류될 수 있다. 바람직하게, 상기 제1 골화 과정은, 팔꿈치머리 몸통의 높이가 20% 이상 및 50% 미만인 작은 팔꿈치머리 골화중 심 단계, 팔꿈치머리 몸통의 높이가 50% 이상인 확대된 팔꿈치머리 골화중심 단계, 부골화중심의 출현 단계, 팔 꿈치머리 골화중심과 부골화중심의 융합 단계, 융합된 골화중심의 확대 단계, 팔꿈치머리 뼈돌기의 50% 미만 부 분적 융합 단계, 팔꿈치머리 뼈돌기의 50% 이상 부분적 융합 단계, 및 팔꿈치머리 뼈돌기의 완전한 융합 단계로 구성될 수 있다. 바람직하게, 상기 팔꿈치머리 골화중심과 부골화중심의 융합 단계와 융합된 골화중심의 확대 단계의 사이에 팔 꿈치머리 골화중심과 부골화중심의 융합 이후에 다른 부골화중심의 출현 단계를 더 포함할 수 있다. 바람직하게, 상기 제2 골화 과정은, 팔꿈치머리 몸통의 높이가 20% 이상 및 50% 미만인 작은 팔꿈치머리 골화중 심 단계, 팔꿈치머리 몸통의 높이가 50% 이상인 확대된 팔꿈치머리 골화중심 단계, 부골화중심의 출현 단계, 부 골화중심과 팔꿈치머리 몸통의 융합 단계, 융합된 부골화중심-팔꿈치머리 몸통과 융합되지 않은 팔꿈치머리 골 화중심의 확대 단계, 팔꿈치머리 골화중심과 융합된 부골화중심-팔꿈치머리 몸통의 50% 미만 부분적 융합 단계, 팔꿈치머리 뼈돌기의 50% 이상 부분적 융합 단계, 및 팔꿈치머리 뼈돌기의 완전한 융합 단계로 구성될 수 있다. 바람직하게, 상기 부골화중심과 팔꿈치머리 몸통의 융합 단계와 융합된 부골화중심-팔꿈치머리 몸통과 융합되지 않은 팔꿈치머리 골화중심의 확대 단계의 사이에 팔꿈치머리 골화중심과 부골화중심의 융합 이후에 다른 부골화 중심의 출현 단계를 더 포함할 수 있다. 상기 목적을 달성하기 위한 본 발명의 제2 측면은, 골연령 평가 장치로서, 팔꿈치 측면의 엑스레이 영상을 획득 하는 영상 획득부, 상기 엑스레이 영상에서 팔꿈치머리 영역을 분할하는 영역 분할부, 상기 분할한 팔꿈치머리 영역에서 팔꿈치머리 골화중심의 형태적 특징을 분석하는 형태 분석부, 및 상기 분석한 형태적 특징을 기초로 골연령을 판정하는 골연령 판정부를 포함한다. 바람직하게, 상기 영역 분할부는, 상기 엑스레이 영상에서 뼈 영역을 픽셀 단위로 예측하고, 상기 픽셀 단위로 예측한 결과에 따라 상기 엑스레이 영상에서 팔꿈치머리에 해당하는 영역을 분할할 수 있다. 바람직하게, 상기 형태 분석부는, 상기 팔꿈치머리 영역에서 팔꿈치머리 골화중심에 대한 영역을 결정하고, 상 기 팔꿈치머리 골화중심의 형태적 특징을 판단할 수 있다. 바람직하게, 상기 골연령 판정부는, 상기 팔꿈치머리 골화중심의 형태적 특징을 기초로 기설정된 연령별 팔꿈치 머리 특성 기준에 따라 팔꿈치머리 골연령을 분류할 수 있다. 상기 목적을 달성하기 위한 본 발명의 제3 측면은 컴퓨터 판독 가능 매체에 저장되어 있는 컴퓨터 프로그램에 있어서, 상기 컴퓨터 프로그램의 명령이 실행될 경우, 골연령 평가 방법이 수행되는 것을 특징으로 한다."}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이 본 발명에 의하면, 팔꿈치 측면에 해당하는 1장의 엑스레이 영상을 이용하므로 검사시 노출되 는 방사선 피폭을 줄일 수 있는 효과가 있고, 판정 가능한 연령의 범위가 넓고 세분화할 수 있는 효과가 있다. 또한, 팔꿈치 측면 엑스레이 영상에서 관찰할 수 있는 팔꿈치머리 뼈돌기의 특징적인 형태변화를 반영하여 분류 하므로, 사춘기 시기의 소아 청소년 골연령 판정시 다양한 임상 증례에서 보다 정확하게 골연령을 평가할 수 있 는 효과가 있다. 또한, 정확한 사춘기 골연령 평가를 통해 환아의 근골격계 성숙도를 평가하고 다양한 내분비계질환, 저신장, 골 절, 척추측만증, 또는 하지길이 불일치 등의 진단 및 치료 시기를 결정하는데 핵심적인 역할을 할 수 있는 효과 가 있다. 또한, 영상의학과 의사의 업무 과정을 개선하여 보다 간단하고 직관적인 판정을 가능하게 하고, AI 프로그램을 활용하여 영상의학과, 소아청소년과, 또는 정형외과 의사의 업무 보조와 신속한 판독을 가능하게 하는 효과가 있다."}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있 는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니 라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이"}
{"patent_id": "10-2023-0197113", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. \"및/또는\"은 언급된 아이템들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 제1, 제2 등이 다양한 소자, 구성요소 및/또는 섹션들을 서술하기 위해서 사용되나, 이들 소자, 구성요소 및/또는 섹션들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 소자, 구성요소 또 는 섹션들을 다른 소자, 구성요소 또는 섹션들과 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 소자, 제1 구성요소 또는 제1 섹션은 본 발명의 기술적 사상 내에서 제2 소자, 제2 구성요소 또는 제2 섹션 일 수도 있음은 물론이다. 또한, 각 단계들에 있어 식별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기 된 순서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시 에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 “포함한다 (comprises)\" 및/또는 “포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다 른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 또한, 본 발명의 실시예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달 라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 도 1은 본 발명의 바람직한 실시예에 따른 골연령 평가 장치를 나타내는 블록도이다. 골연령 평가 장치는 본 발명에 따른 골연령 평가 방법을 수행하기 위한 장치로서, 팔꿈치 측면 부분의 엑 스레이(X-ray) 영상을 입력 받아 뼈의 형상을 분석하여 골연령을 평가한다. 즉, 골연령 평가 장치는 사춘 기 첫 2년에 해당하는 가속 단계(acceleration phase) 동안 특징적인 팔꿈치머리 골화 과정(olecranon ossification process)의 특성을 이용하여 사춘기 소아 청소년의 골연령을 평가하는 것이다. 바람직하게, 골연령 평가 장치는 컴퓨터로서 골연령 평가 방법을 수행하기 위한 어플리케이션 또는 프로그 램을 설치하여 실행할 수 있고, 사용자 인터페이스(User Interface)를 구비하여 데이터의 입출력이 제어될 수 있다. 여기에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로 이해될 수 있다. 예를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애플리 케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 도 1을 참조하면, 골연령 평가 장치는 영상 획득부, 영역 분할부, 형태 분석부, 골연령 판 정부, 및 제어부를 포함한다. 여기에서, 제어부는 영상 획득부, 영역 분할부, 형태 분석부, 및 골연령 판정부의 동작 및 데이터의 흐름을 제어한다. 영상 획득부는 엑스레이 영상을 획득한다. 바람직하게, 엑스레이 영상은 골연령 평가 장치와 유선 또 는 무선으로 연결된 별도의 촬영 장치로부터 촬영되어 골연령 평가 장치로 전송될 수 있고, 또는 골연령 평가 장치에 구비된 촬영 장치로부터 촬영되어 영상 획득부로 엑스레이 영상이 전달될 수 있다. 영역 분할부는 영상 획득부에서 획득한 엑스레이 영상에서 골연령을 판정하는데 필요한 부분의 영역 인 팔꿈치머리 영역을 분할한다. 바람직하게, 팔꿈치머리 영역을 분할하는 방법에는 다양한 딥러닝 알고리즘이 적용될 수 있다. 형태 분석부는 팔꿈치머리 영역에서 뼈의 형태학적 특징을 분석한다. 바람직하게, 형태 분석부는 딥 러닝 알고리즘을 이용하여 팔꿈치머리 골화중심에 대한 영역을 결정하여 팔꿈치머리 골화중심을 구성하는 각 뼈 의 형태적 특징을 분석할 수 있다. 골연령 판정부는 뼈의 형태학적 특징을 기초로 골연령을 판정한다. 바람직하게, 골연령 판정부는 기 설정된 뼈의 형태학적 특징과 골연령이 매칭되어 있는 골연령 판정 기준에 따라 골연령을 판정할 수 있다. 도 1에 도시된 골연령 평가 장치의 각 구성을 통하여 수행되는 동작은 이하 도 2를 참조하여 상세하게 설 명한다. 도 2를 참조하여 설명될 각 단계는 서로 다른 구성에 의하여 수행되는 것으로 기재하였으나 이에 제한 되는 것은 아니며, 실시예에 따라 각 단계들의 적어도 일부는 서로 동일하거나 다른 구성에서 수행될 수도 있다. 도 2는 일 실시예에 따른 골연령 평가 방법을 나타내는 흐름도이다. 도 2를 참조하면, 영상 획득부는 팔꿈치 측면의 엑스레이 영상을 획득한다(단계 S210). 바람직하게, 영상 획득부는, 도 3을 참조하면, 엑스레이 영상을 전처리(Pre-processing)할 수 있다. 즉, 영상 획득부는 엑스레이 영상에 대해 불필요한 영역을 제외시키고(Excluded), 측면이미지 (Lateral view) 인지를 인식하여 선 택하고, 정규화(Normalization)할 수 있다. 영역 분할부는 엑스레이 영상에서 팔꿈치머리 영역을 분할한다(단계 S220). 바람직하게, 영역 분할부(12 0)는 엑스레이 영상에 딥러닝 알고리즘을 적용하여 뼈 영역을 픽셀 단위로 예측하고, 픽셀 단위로 예측한 결과 에 따라 엑스레이 영상에서 팔꿈치머리에 해당하는 영역을 분할할 수 있다. 보다 구체적으로서, 도 3을 참조하 면, 영역 분할부는 입력 이미지인 엑스레이 영상에 딥러닝 알고리즘에 해당하는 YOLOv5를 적용하여 팔꿈치 머리에 해당하는 뼈 부분을 검출할 수 있다. 영역 분할부는 YOLOv5 네트워크를 적용하여 엑스레이 영상에 서 팔꿈치머리 영역에 대해 자동으로 영상을 크롭(cropping)하고, 크롭한 팔꿈치머리 영역에 대한 영상을 관심 영역(ROI; Region of interest)으로 결정할 수 있다. 예를 들어, 도 4를 참조하면, 도 4의 (a)는 엑스레이 영 상 원본에 해당하고 (b)는 팔꿈치머리 영역에 대해 분할된 영상에 해당하는 것으로서, 영역 분할부는 (a) 와 같은 엑스레이 영상에 캐스케이드 모델의 첫 단계인 YOLOv5를 적용하여 팔꿈치머리에 해당하는 뼈 부분을 검 출하고 (b)와 같이 팔꿈치머리에 해당하는 영역만 분할하여 영상을 획득할 수 있다. 즉, 영역 분할부는 YOLOv5 네트워크를 통해 엑스레이 영상에서 팔꿈치머리 영역 부분만 크롭하여 관심 영역으로 추출하는 것이다. 여기에서 추출된 관심 영역을 기초로 이하에서 설명할 단계 S230이 수행될 수 있다. 일 실시예에서, 영역 분할부는 입력 이미지인 엑스레이 영상에 YOLOv5를 적용하여 팔꿈치머리에 해당하는 영역을 검출하고, EfficientDet을 이용하여 팔꿈치머리에 해당하는 영역을 분할할 수 있다. 여기에서, EfficientDet은 EfficientNet 모델의 백본을 기반으로 변형된 딥러닝 알고리즘으로서 분할 레이어 (segmentation layer)가 추가되어 영역 분할부에서 팔꿈치머리 영역을 분할할 때 사용될 수 있다. 형태 분석부는 분할한 팔꿈치머리 영역에서 팔꿈치머리 골화중심(olecranon ossification center)의 형태 적 특징을 분석한다(단계 S230). 바람직하게, 형태 분석부는 팔꿈치머리 영역에 딥러닝 알고리즘을 적용하 여 팔꿈치머리 골화중심에 대한 영역을 결정하고, 팔꿈치머리 골화중심의 형태적 특징을 판단할 수 있다. 도 3 을 참조하면, 형태 분석부는 캐스케이드 학습된 딥러닝 알고리즘인 EfficientDet을 이용하여 팔꿈치머리 골화중심의 형태적 특징을 분류할 수 있다. 즉, 형태 분석부는 분할한 팔꿈치머리 영역에 EfficientDet을 적용하여 팔꿈치머리 영역과 뼈돌기의 분류를 수행한다. 여기에서, EfficientDet은 깊이, 너비, 및 해상도를 동 시에 조정하는 복합 스케일링을 사용하여 높은 효율성과 정확도를 달성하는 네트워크로서 사람마다 상이한 팔꿈 치 모양에 대해 정교하게 객체를 파악하는데 유리하다. 예를 들어, 도 5를 참조하면, 도 5의 (a)는 영역 분할부 를 통해 획득한 팔꿈치머리 영역에 해당하고, 도 5의 (b)는 팔꿈치머리 골화중심의 형태적 특징을 판단하 는데 기준이 되는 팔꿈치머리 골화중심에 대한 영역에 해당하는 것으로서, 형태 분석부는 (a)와 같은 팔꿈 치머리 영역에 딥러닝 알고리즘에 해당하는 EfficientDet을 적용하여 (b)와 같은 팔꿈치머리 영역 부분의 팔꿈 치머리 골화중심에 대한 영역을 결정하고 팔꿈치머리 골화중심에 대한 영역에 대해 형태적 특징을 판단할 수 있 다. 즉, 딥러닝 알고리즘인 EfficientDet은 도 5의 (b)에 도시된 하이라이트된 영역을 기초로 형태적 특징을 분 석하는 것이다. 보다 구체적으로, 영역 분할부, 형태 분석부, 및 이하에서 설명될 골연령 판정부에 적용되는 딥 러닝 알고리즘인 EfficientDet은 EfficientNet 모델의 백본(backbone)을 가져와 본 발명에 적합하도록 설정한 것으로서, 도 6에 도시된 바와 같이, 왼쪽에 위치한 Efficient-Net가 백본(backbone)으로 사용되고 백본의 EfficientNet은 b4로 적용되며(즉, EfficientNet-b4) 마지막 단에 피처 네트워크(feature network)로 4개의 Bi-directional Feature Pyramid Network(BiFPN) layer가 적용되고, 객체의 클래스를 분류하는 클래스 네트워 크 및 객체의 위치와 크기를 결정하는 바운딩 박스를 생성하는 박스 네트워크 구성에서 박스 네트워크가 제거되 고 분할(segmentation)하는 레이어가 추가된 구성이다. 여기에서, EfficientNet-b4의 b4는 ,b1, b2, 또는 b4와 같이 레이어(layer)의 깊이에 따라 숫자가 적용되는 것으로서 레이어의 깊이는 다양하게 적용되거나 변동될 수 있다. 이러한 딥러닝 알고리즘은 엑스레이 영상을 픽셀 단위로 예측하는 분할 예측 로짓(segmentation prediction logit)이 추가된 것으로서, 분할 예측 로짓은 엑스레이 영상에서 뼈(Bone) 영역을 픽셀 단위로 예측 할 수 있다. 이와 같은 변형된 EfficientDet을 이용하면 에러의 발생율이 낮아지고 박스를 각각 체크하지 않아 도 되므로 계산 속도가 더 빠르게 처리될 수 있는 이점이 있다. 도 7을 참조하면, EfficientDet의 백본으로 포함되는 구조로서, 백본(backbone) 네트워크로 사용되는 Efficient-Net은 여러개의 Convolution(Conv) layer, MBconv 블록, conv 1x1, 및 pooling & FC(Fully Connected) layer로 구성된다. Conv 3x3에서 32개의 채널을 사용하는 3x3커널과 하나의 Conv layer가 쌓이고, 그 후 3x3커널과 16채널을 사용하는 MBConv1 블록 1개, 3x3커널과 24채널을 사용하는 MBConv6 블록 2개, 5x5커 널과 40채널을 사용하는 MBConv6 블록 2개, 3x3커널과 80채널을 사용하는 MBConv6 블록 3개가 연결된다. 여기에 서, MBConv6은 MBconv에서 깊이별 배치 정규화(batch normalization) 및 스위치 프로세스(swish process)를 다 시 수행하는 것이다. 마지막으로 1x1커널을 사용하는 Conv layer, pooling layer, dense layer인 fully connected layer가 쌓이게 된다. 딥러닝 알고리즘에 입력되는 데이터가 3d의 z축으로 깊이 있는 영상이 아닌 2d엑스레이(X-ray) 영상이므로 이런 방식으로 4개 단위로 Input-> P1/2-> P2/4-> P3/8-> P4/16-> P5/32까지 층 (layer)을 쌓고, BiFPN layer를 통해 특징의 다양한 스케일을 통합하여 객체 탐지의 정확도가 향상될 수 있다. BiFPN layer를 통과하는 layer에 분할 로짓(segmentation logits)을 붙여 팔꿈치(Elbow) 영역에 대한 분할 (segmentation)과 그 부위에 대해 최종단에서 분류(classification)가 수행되는 네트워크 구조에 해당한다. 이 때 필요에 따라 층(layer)은 더 깊게 쌓을 수 있다. 여기에서, 분할(segmentation)은 영역 분할부를 통해 수행되는 팔꿈치머리 영역의 정확한 경계를 식별하고 해당 영역을 다른 영역과 구분하는 분할에 해당하는 것으 로서 영역 분할부는 EfficientDet을 이용하여 팔꿈치머리 영역의 분할을 수행할 수도 있고, 분류 (classification)는 이하에서 설명할 골연령 판정부를 통해 수행되는 골연령을 판정하는 것에 해당한다. 골연령 판정부는 단계 S230에서 분석한 팔꿈치머리 골화 중심의 형태적 특징을 기초로 골연령을 판정한다 (단계 S240). 바람직하게, 골연령 판정부는 딥러닝 알고리즘인 EfficientDet을 적용하여 팔꿈치머리 골화 중심의 형태적 특징을 기초로 기설정된 연령별 팔꿈치머리 특성 기준에 따라 팔꿈치머리 골연령을 분류할 수 있 다. 여기에서, 딥러닝 알고리즘은 단계 S230에서 적용되는 알고리즘과 동일하다. 바람직하게, 기설정된 연령별 팔꿈치머리 특성 기준은 여아인 경우에는 9.5세부터 13세까지 6개월 단위로 설정 되고, 남아인 경우에는 11.5세부터 15세까지 6개월 단위로 설정될 수 있다. 여기에서, 여아 11세와 11.5세 사이 구간인 11.25세 및 남아 13세와 13.5세 사이 구간인 13.25세에 대한 팔꿈치머리 특성 기준이 더 설정될 수 있다. 도 8을 참조하면, 기설정된 연령별 팔꿈치머리 특성 기준표로서, 여아(F)의 연령과 남아(M)의 연령별 팔 꿈치머리 특징과 형상이 설정된 것을 볼 수 있다. 여아 11세와 남아 13세, 여아 11.5세와 남아 13.5세, 및 여아 12세와 남아 14세에서는 각각 D단계 및 D'단계, L단계 및 L'단계, G단계 및 G'단계에 해당하는 두가지 형태가 나타날 수 있는데 이는 골화 과정에서의 융합 순서에 따라 나타날 수 있는 형태에 해당한다. 보다 구체적으로, 기설정된 연령별 팔꿈치머리 특성 기준은 팔꿈치머리의 골화중심과 부골화중심의 융합 순서에 따라 제1 골화 과정 및 제2 골화 과정으로 분류될 수 있다. 즉, 골화 과정에서 부골화중심의 출현 이후 팔꿈치 머리의 골화중심과 부골화중심이 먼저 융합되면 제1 골화 과정으로 진행될 수 있고, 부골화중심과 팔꿈치머리 몸통이 먼저 융합되면 제2 골화 과정으로 진행될 수 있다. 먼저, 도 9를 참조하면, 제1 골화 과정은, - 여아 9.5세 및 남아 11.5세에 해당하는 O2 단계 [팔꿈치머리 몸통의 높이가 20~50%인 작은 팔꿈치머리 골화중 심 단계(A small ossification center (20~50% height of olecranon body)] - 여아 10세 및 남아 12세에 해당하는 O3단계 [팔꿈치머리 몸통의 높이가 50% 이상인 확대된 팔꿈치머리 골화중 심 단계 (An enlarged olecranon ossification center (>50% height of olecranon body))], - 여야 10.5세 및 남아 12.5세에 해당하는 B단계 [부골화중심의 출현 단계(Appearance of an accessory ossification center (two ossification centers))] - 여아 11세 및 남아 13세에 해당하는 D단계 [팔꿈치머리 골화중심과 부골화중심의 융합 단계(반달 모 양)(Fusion of two ossification centers (a half-moon shape))], - 여아 11.5세 및 남아 13.5세에 해당하는 L단계 [융합된 골화중심의 확대 단계(직사각형 모양)(Enlargement of fused ossification centers (a rectangular shape))], - 여아 12세 및 남아 14세에 해당하는 G단계 [팔꿈치머리 뼈돌기의 50% 미만 부분적 융합 단계(Partial fusion (<50%) of olecranon apophysis)], - 여아 12.5세 및 남아 14.5세에 해당하는 H단계 [팔꿈치머리 뼈돌기의 50% 이상 부분적 융합 단계(Partial fusion (>50%) of olecranon apophysis)], 및 - 여아 13세 및 남아 15세에 해당하는 F단계 [팔꿈치머리 뼈돌기의 완전한 융합 단계(Complete fusion of olecranon apophysis)]로 구성될 수 있다. 다음으로, 도 9를 참조하면, 제2 골화 과정은, - 여아 9.5세 및 남아 11.5세에 해당하는 O2 단계 [팔꿈치머리 몸통의 높이가 20~50%인 작은 팔꿈치머리 골화중 심 단계(A small ossification center (20~50% height of olecranon body)]- 여아 10세 및 남아 12세에 해당하는 O3단계 [팔꿈치머리 몸통의 높이가 50% 이상인 확대된 팔꿈치머리 골화중 심 단계(enlarged olecranon ossification center (>50% height of olecranon body))], - 여야 10.5세 및 남아 12.5세에 해당하는 B단계 [부골화중심의 출현 단계(Appearance of an accessory ossification center (two ossification centers))], - 여아 11세 및 남아 13세에 해당하는 D'단계 [부골화중심과 팔꿈치머리 몸통의 융합 단계(Fusion of accessory ossification center and olecranon body), - 여아 11.5세 및 남아 13.5세에 해당하는 L'단계 [융합된 부골화중심-팔꿈치머리 몸통과 융합되지 않은 팔꿈치 머리 골화중심의 확대 단계(Enlargement of unfused olecranon ossification center and fused accessory ossification center-olecranon body)], - 여아 12세 및 남아 14세에 해당하는 G'단계 [팔꿈치머리 골화중심과 융합된 부골화중심-팔꿈치머리 몸통의 50% 미만 부분적 융합 단계(Partial fusion (<50%) of fused accessory ossification center-olecranon body and olecranon ossification center)] - 여아 12.5세 및 남아 14.5세에 해당하는 H단계 [팔꿈치머리 뼈돌기의 50% 이상 부분적 융합 단계(Partial fusion (>50%) of olecranon apophysis)], 및 - 여아 13세 및 남아 15세에 해당하는 F단계 [팔꿈치머리 뼈돌기의 완전한 융합 단계(Complete fusion of olecranon apophysis)]로 구성될 수 있다. 여기에서, 제1 골화 과정의 D단계 및 L단계 사이와 제2 골화 과정의 D'단계 및 L'단계 사이에 여아 11.25세 및 남아 113.25세에 해당하는 BD단계 [팔꿈치머리 골화중심과 부골화중심의 융합 이후에 다른 부골화중심의 출현 단계(Appearance of another accessory ossification center (after fusion of previous ossification centers; a half-moon shape+additional accessory ossification center))]가 더 포함될 수 있다. 즉, 골연령 판정부는 형태 분석부를 통해 획득된 팔꿈치머리 골화 중심의 형태적 특징이 기설정된 연 령별 팔꿈치머리 특성 기준의 각 단계 중 매칭되는 단계에 해당하는 연령으로 골연령을 판정하는 것이다. 도 10은 일 실시예에 따른 골연령 평가 방법의 성능을 설명하기 위한 도면이다. 도 10을 참조하면, 두 명의 소아 영상의학 전문의에 해당하는 관찰자간 일치도를 나타낸 것으로서, 본 발명에 따른 골연령 평가 방법(Novel classification 및 Olecranon BA(Olecranon Bone Age))을 적용한 경우가 기존의 팔꿈치머리 골연령 평가 방법인 Elbow BA_Dimeglio 및 Elbow BA_Sauvegrain 보다 높은 것을 볼 수 있다. 여기 에서, Novel classification은 02 내지 F로 표현되는 단계를 기준으로 분석한 결과를 나타내고 Olecranon BA는 연령을 기준으로 분석한 결과를 나타내는 것으로서, D단계와 D'단계, L단계와 L'단계, 및 G단계와 G'단계는 각 각 골 연령은 동일하나 단계가 다르게 분류되므로 구분하여 분석된 것이다. 또한, 아래의 [표 1]을 참조하면, 본 발명에 따른 골연령 평가 방법은 기존의 팔꿈치 골연령 평가 방법인 Sauvegrain(Elbow BA_Sauvegrain) 및 Dimeglio(Elbow BA_Dimeglio)와 기존 수골 골연령 평가 방법인 Greulich- Pyle and Tanner-Whitehouse hybrid(Hand BA_GP/TW3) 및 한국인 소아 표준 골연령(Hand BA_KS)과 비교시 높은 신뢰도를 보임을 알 수 있다. 표 1 Girls Boys ICC 95% CI ICC 95% CI Olecranon BA vs. Elbow BA_ Sauvegrain0.9650.962-0.9680.9660.957-0.974 Olecranon BA vs.Elbow BA_Dimeglio0.9780.976-0.9800.9780.971-0.983 Olecranon BA vs. Hand BA_GP/TW3 0.8250.811-0.8390.8870.860-0.910 Olecranon BA vs. Hand BA_KS 0.8910.883-0.8990.9150.891-0.931 Elbow BA_Sauvegrainvs. Elbow BA_ Dimeglio0.9270.919-0.9350.9430.923-0.958이에 더하여, 본 발명에 따른 골연령 평가 방법에 적용되는 딥러닝 알고리즘인 AI 모델은 높은 정확도와 낮은 에러율을 보인다. 구체적으로, Novel classification의 내부 데이터세트의 경우에는 정확도(accuracy) 0.96, 민감도(sensitivity) 0.80, 및 특이도(specificity) 0.98을 나타내고, 외부 데이터세트의 경우에는 정확도 (accuracy) 0.87, 민감도(sensitivity) 0.76, 및 특이도(specificity) 0.91을 나타낸다. 또한 팔꿈치머리 골 연령(Olecranon bone age)의 경우 내부 검증의 경우에는 MSE 0.088 및 RMSE 0.296을 나타내고, 외부 검증의 경 우에는 MSE 0.125, RMSE 0.398을 나타낸다. 여기에서, 내부 검증은 골연령 평가 방법을 수행하기 위해 적용되는 알고리즘 모델 또는 분류 방법이 학습 데이터에 얼마나 잘 맞는지를 평가하기 위한 용도이고, 외부 검증은 알고 리즘 모델 또는 분류 방법이 새로운 데이터에 얼마나 잘 일반화되는지를 평가하기 위한 용도이다. 한편, 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드 웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모 듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시예는 데이터구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조합 으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 전술한 본 발명에 따른 골연령 평가 방법 및 장치에 대한 바람직한 실시예에 대하여 설명하였지만, 본 발명은 이에 한정되는 것이 아니고 특허청구범위와 발명의 상세한 설명 및 첨부한 도면의 범위 안에서 여러가지로 변형 하여 실시하는 것이 가능하고 이 또한 본 발명에 속한다."}
{"patent_id": "10-2023-0197113", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 골연령 평가 방법에 대한 블록도이다. 도 2는 일 실시예에 따른 골연령 평가 방법을 나타내는 흐름도이다. 도 3은 일 실시예에 따른 골연령 평가 방법을 설명하기 위한 예시도이다. 도 4는 일 실시예에 따른 팔꿈치머리 영역의 분할을 설명하기 위한 예시도이다. 도 5는 일 실시예에 따른 골화중심의 형태적 특징의 분석을 설명하기 위한 예시도이다. 도 6 및 도 7은 일 실시예에 따른 딥러닝 알고리즘을 설명하기 위한 예시도이다. 도 8 및 도 9는 일 실시예에 따른 골연령의 판정을 설명하기 위한 예시도이다. 도 10은 일 실시예에 따른 골연령 평가 방법의 성능을 설명하기 위한 도면이다."}
