{"patent_id": "10-2022-0013609", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0116547", "출원번호": "10-2022-0013609", "발명의 명칭": "게임 서비스를 제공하는 방법 및 장치", "출원인": "주식회사 넥슨코리아", "발명자": "심진경"}}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계;상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계; 및필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하는단계;를 포함하는,게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계는,상기 이미지에서 특징점을 감지하고, 상기 특징점을 변경하는 단계;상기 이미지에 시각적 효과를 추가하는 단계;상기 이미지에 다른 이미지를 오버레이하는 단계; 또는상기 이미지에서 사용자의 이미지를 감지하고, 상기 사용자의 이미지를 제외한 배경을 변경하는 단계;중 적어도 하나를 포함하는, 게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 이미지는 실시간 동영상 이미지이고,상기 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계는, 상기 동영상 이미지에 실시간으로 상기 필터를 적용하여, 변경된 동영상 이미지를 생성하는 단계를 포함하는, 게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 방법은, 상기 이미지에 기초하여 필터를 생성하는 단계를 더 포함하는,게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 필터를 생성하는 단계는,인공지능 모델을 이용하여, 상기 이미지에서 특징점을 감지하는 단계;상기 감지된 특징점에 기초하여 필터를 자동 생성하는 단계; 및를 포함하는, 공개특허 10-2023-0116547-3-게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 필터를 생성하는 단계는,상기 생성된 필터를 상기 사용자의 입력에 의해 변경하는 단계를 더 포함하는, 게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 필터 정보는, 상기 이미지를 포함하지 않는 것을 특징으로 하고,상기 필터 정보는, 상기 이미지에서 변경되는 부분을 지정하는 특징점 정보 또는 위치 정보 및 상기 변경되는부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함하는,게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 게임 활동 정보는, 상기 사용자의 캐릭터 정보, 상기 사용자와 다른 사용자 간의 관계에 관한 정보, 상기사용자가 소유한 게임 내 재화 정보, 및 상기 사용자가 게임을 플레이하여 생성한 컨텐츠 정보 중 적어도 하나를 포함하는, 게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 방법은, 상기 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데이트된 사용자의 게임 활동 정보를 포함하는 NFT를 생성하는 단계를 더 포함하는, 게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 방법은, 상기 NFT의 소유자가 다른 사용자로 변경됨에 기초하여, 상기 NFT에 포함된 정보에 기초하여 상기다른 사용자의 아바타를 생성하는 단계; 를 더 포함하고,상기 다른 사용자의 아바타를 생성하는 단계는,상기 NFT에 저장된 필터 정보에 기초하여, 상기 다른 사용자의 이미지에 필터를 적용하는 단계; 및상기 NFT에 저장된 게임 활동 정보에 기초하여, 상기 다른 사용자의 게임 활동 정보를 업데이트하는 단계; 를 포함하는,게임 제공 방법."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인스트럭션들을 저장하는 메모리; 및상기 메모리와 기능적으로 결합되는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,공개특허 10-2023-0116547-4-사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하고,상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하고,필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하도록 설정되는, 게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계는,상기 이미지에서 특징점을 감지하고, 상기 특징점을 변경하는 동작;상기 이미지에 시각적 효과를 추가하는 동작;상기 이미지에 다른 이미지를 오버레이하는 동작; 또는상기 이미지에서 사용자의 이미지를 감지하고, 상기 사용자의 이미지를 제외한 배경을 변경하는 동작;중 적어도 하나를 포함하는, 게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 이미지는 실시간 동영상 이미지이고,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,상기 동영상 이미지에 실시간으로 상기 필터를 적용하여, 변경된 동영상 이미지를 생성하도록 설정되는,게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,상기 이미지에 기초하여 필터를 생성하도록 더 설정되는,게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,인공지능 모델을 이용하여, 상기 이미지에서 특징점을 감지하고,상기 감지된 특징점에 기초하여 필터를 자동 생성하도록 설정되는,게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,상기 생성된 필터를 상기 사용자의 입력에 의해 변경하도록 더 설정되는, 공개특허 10-2023-0116547-5-게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 필터 정보는, 상기 이미지를 포함하지 않는 것을 특징으로 하고,상기 필터 정보는, 상기 이미지에서 변경되는 부분을 지정하는 특징점 정보 또는 위치 정보 및 상기 변경되는부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함하는,게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11항에 있어서,상기 게임 활동 정보는, 상기 사용자의 캐릭터 정보, 상기 사용자와 다른 사용자 간의 관계에 관한 정보, 상기사용자가 소유한 게임 내 재화 정보, 및 상기 사용자가 게임을 플레이하여 생성한 컨텐츠 정보 중 적어도 하나를 포함하는, 게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,상기 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데이트된 사용자의 게임 활동 정보를 포함하는NFT를 생성하도록 더 설정되는, 게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,상기 NFT의 소유자가 다른 사용자로 변경됨에 기초하여, 상기 NFT에 포함된 정보에 기초하여 상기 다른 사용자의 아바타를 생성하도록 더 설정되고,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,상기 NFT에 저장된 필터 정보에 기초하여, 상기 다른 사용자의 이미지에 필터를 적용하고,상기 NFT에 저장된 게임 활동 정보에 기초하여, 상기 다른 사용자의 게임 활동 정보를 업데이트함으로써, 상기다른 사용자의 아바타를 생성하도록 설정되는,게임 제공 장치."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "인스트럭션들을 저장하는 메모리; 및상기 메모리와 기능적으로 결합되는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하고,상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하고,필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하도록 설정되는, 공개특허 10-2023-0116547-6-사용자 단말."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "인스트럭션들을 저장하는 메모리; 및상기 메모리와 기능적으로 결합되는 적어도 하나의 프로세서를 포함하고,상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여,사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하고,상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하고,필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하도록 설정되는, 서버."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계;상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계; 및필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하는단계;를 포함하는, 게임 제공 방법을 하드웨어와 결합되어 실행시키기 위하여 매체에 저장되는 컴퓨터 프로그램."}
{"patent_id": "10-2022-0013609", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계;상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계; 및필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하는단계;를 포함하는, 게임 제공 방법을 컴퓨터상에서 실행하는 프로그램이 수록된 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계; 상기 변경된 이미 지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계; 및 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하는 단계를 포함하는, 게임 제공 방법 및 장치를 제안한다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 게임 서비스를 제공하는 방법 및 장치에 관한 것이다. 보다 구체적으로는, 사용자 이미지에 필터를 적용하여 아바타를 생성하고, 아바타를 대체불가능 토큰(Non-fungible Token, NFT)화시키는 방법 및 장치에 관 한 것이다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "컴퓨팅 디바이스 및 네트워크 환경의 발달에 따라 다양한 유무선 통신 기기를 이용한 온라인 기반의 게임을 즐 기는 사용자들이 크게 증가하고 있다. 온라인 게임들은 사용자를 대표하고 게임 내에서 사용자가 직접 조작 가 능한 아바타를 제공함으로써 사용자의 게임에 대한 흥미를 유발한다. 일반적으로 게임 서비스 제공자는 사용자가 아바타의 외형을 선택할 수 있는 시스템을 제공한다. 예를 들어, 게임 서비스 제공자는 2D 또는 3D 그래픽으로 아바타를 생성하되, 사용자가 아바타의 성별, 얼굴 생김새, 신체 유형, 머리카락의 색/스타일, 피부 톤, 및 의상 등을 선택하여 아바타를 커스터마이즈하게끔 할 수 있다. 그 러나 이러한 수동적인 커스터마이징에는 시간이 많이 소비되며, 선택할 수 있는 옵션이 한정되어 있어, 사용자 가 원하는 외형의 아바타를 생성하기 어렵다. 한편, 사용자들은 게임을 플레이함으로서 게임 내에서 자산을 축적할 수 있다. 사용자가 생성한 아바타의 외형, 사용자가 게임을 플레이함으로써 획득한 게임 내 재화, 및 사용자가 게임 내에서 경험한 컨텐츠나 달성한 목표등이 가치있는 게임 내 자산이 될 수 있다. 그러나 일반적으로 사용자들 간에 거래될 수 있는 것은 게임 내 재 화의 일부분에 불과하며, 아바타 자체는 다른 사용자에게 양도될 수 없는 것으로 여겨진다. 따라서 사용자가 게임을 그만두는 경우, 사용자가 축적한 게임 내 자산 대부분은 가치를 잃어버리게 된다. 종래에 사용자들은 아바타를 다른 사람에게 양도하기 위해서 그 아바타가 포함되어 있는 사용자 계정 자체를 넘 겨주는 비정상적인 방법을 사용하여 왔다. 그러나 이 경우 안전한 거래가 보장되기 어려우며, 또한 거래 과정에 서 개인정보가 유출되는 문제도 발생한다. 따라서, 사용자가 게임 아바타를 거래하기 위한 보다 개선된 방법이 요구된다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시에서는 사용자 이미지에 필터를 적용하여 아바타를 생성하고, 아바타를 NFT화하여 거래하는 방법 및 장 치를 제공한다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따르면, 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경 하는 단계; 상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계; 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하는 단계를 포함하는, 게임 제공 방법이 제공된다. 일 실시예에 따르면, 상기 이미지에 필터를 적용하여 상기 이미지를 변경하는 단계는, 상기 이미지에서 특징점 을 감지하고, 상기 특징점을 변경하는 단계; 상기 이미지에 시각적 효과를 추가하는 단계; 상기 이미지에 다른 이미지를 오버레이하는 단계; 또는 상기 이미지에서 사용자의 이미지를 감지하고, 상기 사용자의 이미지를 제외 한 배경을 변경하는 단계; 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 의상 텍스처를 추출하는 단계는, 상기 이미지는 실시간 동영상 이미지이고, 상기 이 미지에 필터를 적용하여 상기 이미지를 변경하는 단계는, 상기 동영상 이미지에 실시간으로 상기 필터를 적용하 여, 변경된 동영상 이미지를 생성하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 방법은, 상기 이미지에 기초하여 필터를 생성하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 필터를 생성하는 단계는, 인공지능 모델을 이용하여, 상기 이미지에서 특징점을 감지 하는 단계; 및 상기 감지된 특징점에 기초하여 필터를 자동 생성하는 단계를 포함할 수 있다. 일 실시예에 따르면, 상기 필터를 생성하는 단계는, 상기 생성된 필터를 상기 사용자의 입력에 의해 변경하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 필터 정보는, 상기 이미지를 포함하지 않는 것을 특징으로 하고, 상기 필터 정보는, 상기 이미지에서 변경되는 부분을 지정하는 특징점 정보 또는 위치 정보 및 상기 변경되는 부분을 어떻게 변경 할 것인지를 지정하는 변경사항 정보를 포함할 수 있다. 일 실시예에 따르면, 상기 게임 활동 정보는, 상기 사용자의 캐릭터 정보, 상기 사용자와 다른 사용자 간의 관 계에 관한 정보, 상기 사용자가 소유한 게임 내 재화 정보, 상기 사용자가 게임을 플레이하여 생성한 컨텐츠 정 보 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 방법은, 상기 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데이트된 사용자의 게임 활동 정보를 포함하는 NFT를 생성하는 단계를 더 포함할 수 있다. 일 실시예에 따르면, 상기 방법은, 상기 NFT의 소유자가 다른 사용자로 변경됨에 기초하여, 상기 NFT에 포함된 정보에 기초하여 상기 다른 사용자의 아바타를 생성하는 단계; 를 더 포함하고, 상기 다른 사용자의 아바타를 생성하는 단계는, 상기 NFT에 저장된 필터 정보에 기초하여, 상기 다른 사용자의 이미지에 필터를 적용하는 단 계; 및 상기 NFT에 저장된 게임 활동 정보에 기초하여, 상기 다른 사용자의 게임 활동 정보를 업데이트하는 단 계를 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 인스트럭션들을 저장하는 메모리; 및 상기 메모리와 기능적으로 결합되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 사용자의얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하고, 상기 변경된 이미지를 이용하여, 상기 사 용자가 게임을 플레이하기 위한 아바타를 생성하고, 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대 체불가능 토큰(non-fungible token, NFT)을 생성하도록 설정되는, 게임 제공 장치가 제공된다. 일 실시예에 따르면, 상기 이미지에 필터를 적용하여 상기 이미지를 변경하는 동작은, 상기 이미지에서 특징점 을 감지하고, 상기 특징점을 변경하는 동작; 상기 이미지에 시각적 효과를 추가하는 동작; 상기 이미지에 다른 이미지를 오버레이하는 동작; 또는 상기 이미지에서 사용자의 이미지를 감지하고, 상기 사용자의 이미지를 제외 한 배경을 변경하는 동작 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 이미지는 실시간 동영상 이미지이고, 상기 적어도 하나의 프로세서는 상기 인스트럭 션들을 실행하여, 상기 동영상 이미지에 실시간으로 상기 필터를 적용하여, 변경된 동영상 이미지를 생성하도록 설정될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 인공지능 모델을 이용하여, 상기 이미지에서 특징점을 감지하고, 상기 감지된 특징점에 기초하여 필터를 자동 생성하도록 설정될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 상기 생성된 필터를 상기 사용자의 입력에 의해 변경하도록 더 설정될 수 있다. 일 실시예에 따르면, 상기 필터 정보는, 상기 이미지를 포함하지 않는 것을 특징으로 하고, 상기 필터 정보는, 상기 이미지에서 변경되는 부분을 지정하는 특징점 정보 또는 위치 정보 및 상기 변경되는 부분을 어떻게 변경 할 것인지를 지정하는 변경사항 정보를 포함할 수 있다. 일 실시예에 따르면, 상기 게임 활동 정보는, 상기 사용자의 캐릭터 정보, 상기 사용자와 다른 사용자 간의 관 계에 관한 정보, 상기 사용자가 소유한 게임 내 재화 정보, 상기 사용자가 게임을 플레이하여 생성한 컨텐츠 정 보 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 상기 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데이트된 사용자의 게임 활동 정보를 포함하는 NFT를 생성하도록 더 설 정될 수 있다. 일 실시예에 따르면, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 상기 NFT의 소유자가 다른 사용자로 변경됨에 기초하여, 상기 NFT에 포함된 정보에 기초하여 상기 다른 사용자의 아바타를 생성하도록 더 설정되고, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 상기 NFT에 저장된 필터 정보에 기초 하여, 상기 다른 사용자의 이미지에 필터를 적용하고, 상기 NFT에 저장된 게임 활동 정보에 기초하여, 상기 다 른 사용자의 게임 활동 정보를 업데이트함으로써, 상기 다른 사용자의 아바타를 생성하도록 설정될 수 있다. 본 개시의 다양한 실시예들에 따르면, 인스트럭션들을 저장하는 메모리; 및 상기 메모리와 기능적으로 결합되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하고, 상기 변경된 이미지를 이용하여, 상기 사 용자가 게임을 플레이하기 위한 아바타를 생성하고, 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대 체불가능 토큰(non-fungible token, NFT)을 생성하도록 설정되는, 사용자 단말이 제공된다. 본 개시의 다양한 실시예들에 따르면, 인스트럭션들을 저장하는 메모리; 및 상기 메모리와 기능적으로 결합되는 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 상기 인스트럭션들을 실행하여, 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경하고, 상기 변경된 이미지를 이용하여, 상기 사 용자가 게임을 플레이하기 위한 아바타를 생성하고, 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대 체불가능 토큰(non-fungible token, NFT)을 생성하도록 설정되는, 서버가 제공된다. 본 개시의 다양한 실시예들에 따르면, 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경 하는 단계; 상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계; 및 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성 하는 단계를 포함하는, 게임 제공 방법을 하드웨어와 결합되어 실행시키기 위하여 매체에 저장되는 컴퓨터 프로 그램이 제공된다. 본 개시의 다양한 실시예들에 따르면, 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이미지를 변경 하는 단계; 상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하는 단계;및 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성 하는 단계를 포함하는, 게임 제공 방법을 컴퓨터상에서 실행하는 프로그램이 수록된 컴퓨터 판독가능 기록매체 가 제공된다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따른 장치 및 방법은, 사용자의 이미지로부터 사용자가 원하는 외형의 아바타를 생성할 수 있게 하며, 사용자의 아바타를 NFT화 할 수 있도록 한다. 이에 따라, 사용자가 축적한 게임 내 자산 을 보호하며 다른 사용자와 안전하게 거래할 수 있다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들에 기재된 내용들을 참조하여 본 발명에 따른 예시적 실시예를 상세하게 설명한다. 또한, 첨부된 도면들에 기재된 내용들을 참조하여 본 발명의 실시예에 따른 전자 장치를 구성하고 사용하는 방법을 상 세히 설명한다. 각 도면에서 제시된 동일한 참조번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또 는 구성요소를 나타낸다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 구성 요소들 은 용어들에 의해 한정되지는 않는다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있 고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 항목들의 조합 또는 복수의 관련된 항목들 중의 어느 하나의 항목을 포함한다. 본 명세서에서 사용한 용어는 실시예를 설명하기 위해 사용된 것으로, 본 발명을 제한 및/또는 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원서에서, 포함하다 또는 가지다 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 명세서 전체에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아 니라, 그 중간에 다른 소자를 사이에 두고 전기적으로 연결되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 포함한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다 른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 이하의 본 개시에서 게임 제공 장치는 게임 서버, 사용자 단말, 게임 서버 및 사용자 단말을 포함하는 게임 시 스템 또는 독립적인 하나의 장치일 수 있다. 이하의 본 개시에서, 서버가 사용자 단말을 제어한다는 의미는 서버가 사용자 단말과의 통신을 통해 사용자 단 말에서의 출력(화면 표시, 음향 출력, 진동 출력, 램프 발광 등 사용자 단말에서의 모든 출력 장치) 및 사용자 단말이 소정의 동작을 수행하기 위한 데이터를 제공하는 것을 의미할 수 있다. 물론 사용자 단말이 기저장된 데이터를 이용하여 사용자 단말에서의 출력을 제어할 수도 있으며, 상기 예시에 제한되지 않는다. 이하의 본 개시에서 사용자(또는 사용자 계정)와 정보 또는 데이터를 송수신한다는 의미는 사용자(또는 사용자 계정)와 대응 또는 연동된 디바이스(또는 사용자 단말)과 정보 또는 데이터를 송수신한다는 의미를 포함할 수 있다. 이하의 본 개시에서 사용자 단말과 대응되는 사용자 계정이란 사용자 단말을 통해 서비스에 로그인 또는 접속한 사용자 계정 및 사용자 단말이 정보를 저장하고 있는 사용자 계정을 포함할 수 있다. 또한 사용자 계정의 사용 자 단말이란 사용자 계정이 로그인 되거나, 사용자 계정 정보가 저장되거나, 사용자 계정이 접속한 사용자 단말 을 의미할 수 있다. 이하의 본 개시에서, 유저, 플레이어, 사용자, 사용자 계정, 게이머는 동일한 의미로 사용될 수 있다. 본 개시 에서 사용자 단말은 문맥에 따라 유저, 플레이어, 사용자, 사용자 계정, 게이머를 가리키거나, 그들에 의해 사 용되는 장치를 가리킬 수 있음이 이해되어야 한다. 본 개시에서 유저, 플레이어, 사용자, 사용자 계정, 게이머 는 문맥에 따라 그들이 조작하는 아바타나 캐릭터를 가리키거나 그들에 의해 사용되는 장치를 가리킬 수 있음이 이해되어야 한다. 이하의 본 개시에서, 블록체인 네트워크는 블록체인 기술을 이용하는 네트워크일 수 있다. 블록체인 기술은 분 산 컴퓨팅 기술 기반의 데이터 위변조 방지 기술을 의미할 수 있다. 구체적으로, 블록체인 기술은 P2P 방식을 기반으로 하여, 소규모 데이터들이 체인 형태로 연결되어 형성된 '블록'이라는 분산 데이터 저장 환경에, 관리 의 대상이 되는 데이터를 저장함으로써, 누구도 임의로(즉, 권한 없이) 저장된 데이터를 수정할 수 없고, 누구 나 변경의 결과를 열람할 수 있게 만드는 기술을 의미할 수 있다. 블록에는, 해당 블록이 발견되기 이전에 사용자들에게 전파되었던 모든 데이터가 기록되어 있고, 이것은 P2P 방식으로 모든 사용자에게 똑같이 전송된다. 따라서, 사용자는 데이터를 임의로 수정하거나 누락시킬 수 없다. 블록은 발견된 날짜와 이전 블록에 대한 연결고리를 가지고 있으며, 이러한 블록들의 집합을 블록체인이라고 칭 할 수 있다. 즉, 블록체인 기술은 수많은 기록을 한 묶음처럼 만드는 기술이다. 블록은 데이터를 저장하는 단위로서, 바디(body)와 헤더(header)로 구분된다. 바디에는 거래 내용이, 헤더에는 머클해시(머클루트)나 넌스(nounce, 암호화와 관련되는 임의의 수) 등의 암호 코드가 담길 수 있다. 예를 들어, 블록은 약 10분을 주기로 생성될 수 있다. 블록은 거래 기록을 끌어 모아 신뢰성을 검증하면서 생성되고, 생성된 블록이 이전 블록에 연결됨으로써 블록체 인의 형태가 될 수 있다. 다른 예를 들어, 명세서에서 블록체인 상에 전파되는 임의 데이터들은 일정 양이 누 적되면 블록 데이터를 형성하고, 형성된 블록 데이터는 블록체인 내 노드들에 의해 검증된 후 앞선 블록 데이터 에 연결될 수 있다. 블록체인은 중앙 집중형 서버에 거래 기록을 보관, 관리하지 않고 거래에 참여하는 개개인의 서버들이 모여 네 트워크를 유지 및 관리할 수 있다. 이 개개인의 서버, 즉 참여자를 노드(node)라고 한다. 본 개시에서는 게임 제공 장치, 사용자 단말, 또는 서버가 노드 중 하나에 해당할 수 있다. 중앙 관리자가 없기 때문에 블록체인 네트워크에서는 블록을 배포하는 노드의 역할이 중요하며, 참여하는 노드 들 가운데 절반 이상의 동의가 있어야 새 블록이 생성된다. 노드들은 블록체인을 컴퓨터에 저장해 놓고 있는데, 일부 노드가 해킹을 당해 기존 내용이 틀어져도 다수의 노드에게 데이터가 남아 있어, 계속적으로 데이터를 보 존할 수 있다. 또한 본 명세서에서 블록체인에 전파된 임의 데이터들은 블록체인 참가 노드들에 저장되며, 주기적/비주기적으 로 각 참가노드들의 데이터를 비교하여 데이터의 위변조 여부를 검증할 수 있다.본 개시에서 대체불가능 토큰(Non-Fungible Token, NFT)은 일 실시예에 따라 이더리움(ERC-721) 기반의 블록체 인을 적용한 스마트 컨트랙트 기술을 이용하여, 대체 불가하며 여러 차례의 거래 이후에도 고유 식별 코드가 변 하지 않고 식별될 수 있도록 콘텐츠에 고유 아이디와 메타데이터 정보를 할당한 자산일 수 있다. 비트코인, 이더리움과 같은 기존의 가상자산들은 코인들이 일반적인 화폐와 같이 차별화되지 않으므로, 등가로 교환할 수 있다. 반면 NFT 자산은 각 토큰마다 고유한 정보와 속성을 가지고, 발행 이후 각 토큰마다 NFT가 발 행된 상품 고유의 이름, 고유 기호, 소유자, 메타데이터 정보 중 적어도 하나의 정보가 담겨 보유자의 이력이 트래킹(tracking) 되는 등 전혀 다른 내용의 토큰이 된다. 따라서 NFT 자산은 시각적으로 구현되는 형태가 동일 하더라도 동일한 가치를 지닌 것이라고 볼 수 없다. 본 개시에서 NFT화(Minting)란 디지털 자산을 NFT 자산으로 발행하는 과정을 의미할 수 있다. NFT화된 디지털 자산은 대체 불가하며, 거래 이후에도 고유 식별 코드가 변하지 않고 식별될 수 있도록 고유의 ID와 메타데이터 정보를 포함할 수 있다. 도 1은 본 개시의 다양한 실시예들에 따른 서버 및 사용자 단말을 포함하는 게임 제공 시스템을 도시한다. 본 개시의 게임 제공 시스템은 서버와 적어도 하나의 사용자 단말(110 내지 160)을 포함할 수 있다. 서버는 네트워크 망을 통해 다양한 온라인 활동을 제공할 수 있다. 서버는 적어도 하나의 사용자 단 말(110 내지 160)에게 동시에 온라인 활동을 제공할 수 있다. 본 개시의 일 실시예에 따르면, 서버라 함은, 단일 서버, 서버의 집합체, 클라우드 서버 등을 포함할 수 있으며, 상기 예시에 제한되지 않는다. 서버는 다양한 온라인 활동을 제공하며, 온라인 활동을 위한 데이 터를 저장하는 데이터베이스를 포함할 수 있다. 또한 서버는 결제 이벤트를 생성 및 처리하는 결제 서버 를 포함할 수도 있다. 앞서 설명한 바와 같이 서버는 게임 제공 장치일 수 있다. 본 개시의 일 실시예에 따르면 네트워크란 모든 통신 방식을 이용하여 설립(또는 형성)된 연결을 의미하며, 단 말과 단말간의 또는 단말과 서버간의 데이터를 송수신하는, 모든 통신 방식을 통해 연결된 통신망을 의미할 수 있다. 모든 통신 방식이라 함은 소정의 통신 규격, 소정의 주파수 대역, 소정의 프로토콜 또는 소정의 채널을 통한 통 신 등 모든 통신 방식을 포함할 수 있다. 예를 들면, 블루투스, BLE, Wi-Fi, Zigbee, 3G, LTE, 초음파를 통한 통신 방식 등을 포함할 수 있으며, 근거리 통신, 원거리 통신, 무선 통신 및 유선 통신을 모두 포함할 수 있다. 물론 상기 예시에 제한되지 않는다. 본 개시의 일 실시예에 따르면 근거리 통신 방식이라 함은, 통신을 수행하는 디바이스(단말 또는 서버)가 소정 의 범위 내에 있을 때에만 통신이 가능한 통신 방식을 의미할 수 있으며, 예를 들어, 블루투스, NFC 등을 포함 할 수 있다. 원거리 통신 방식이라 함은, 통신을 수행하는 디바이스가 거리와 관계 없이 통신이 가능한 통신 방식을 의미할 수 있다. 예를 들면, 원거리 통신 방식은 AP와 같은 중계기를 통해 통신을 수행하는 두 디바이 스가 소정의 거리 이상일 때에도 통신할 수 있는 방식을 의미할 수 있으며, SMS, 전화와 같은 셀룰러 네트워크 (3G, LTE)를 이용한 통신 방식을 포함할 수 있다. 물론 상기 예시에 제한되지 않는다. 네트워크 망을 이용하 여 온라인 활동을 제공받는다는 의미는 모든 통신 방식을 통해 서버와 단말 간의 통신이 수행될 수 있다는 의미 를 포함할 수 있다. 명세서 전체에서 적어도 하나의 사용자 단말(110 내지 160)이라 함은 퍼스널 컴퓨터(Personal Computer), 태블릿(Tablet), 휴대폰(Cellular Phone), 노트북, 스마트 폰, TV 뿐만 아니라, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 네비게이션, MP3 플레이어, 디지털 카 메라, 냉장고, 세탁기, 청소기 등의 다양한 전자 디바이스를 포함할 수 있고, 상기 예시에 제한되지 않는다. 앞서 설명한 바와 같이 적어도 하나의 사용자 단말(110 내지 160)은 게임 제공 장치일 수 있다. 본 개시의 일 실시예에 따르면, 온라인 활동은 온라인 게임, 포털 서비스, SNS(Social Network Service)를 포함 할 수 있으며, 상기 예시에 제한되지 않는다. 또한 온라인 게임은 스포츠, MMORPG, AOS, FPS, TCG, CCG 등 다 양한 장르를 포함할 수 있다. 또한 온라인 게임은 사용자와 사용자간의 대결 방식의 게임일 수도 있고, 사용자 와 컴퓨터(예를 들면, 인공지능)과의 대결 방식일 수도 있다. 또한 대결 방식이 아닌 건설 또는 꾸밈 방식의 게임일 수도 있다. 물론 상기 예시에 제한되지 않으며 온라인 게임의 형태에는 제한이 없다. 본 개시의 다양한 실시예들에 따르면, 게임 제공 시스템은 사용자의 얼굴을 포함하는 이미지에 필터를 적 용하여 이미지를 변경할 수 있다. 게임 제공 시스템은 변경된 이미지를 이용하여, 사용자가 게임을 플레이하기 위한 아바타를 생성할 수 있다. 게임 제공 시스템은 필터 정보 및 상기 사용자의 게임 활동 정보 를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성할 수 있다. 이는 이하에서 보다 자세히 설명한 다. 도 2는 본 개시의 다양한 실시예들에 따른, 게임 제공 방법을 설명하기 위한 도면이다. 도 2를 참조하면, 게임 제공 장치는 사용자의 얼굴을 포함하는 이미지를 획득할 수 있다. 사용자의 이미 지는 사용자의 실사 사진 또는 사용자로 식별할 수 있는 객체를 포함하는 드로잉을 포함할 수 있다. 일 실시예에서, 사용자의 이미지는 동영상 이미지일 수 있다. 예를 들어, 사용자의 이미지는 카메라를 통해 촬영되는 실시간 동영상 이미지일 수 있다. 게임 제공 장치는 사용자의 이미지에 필터를 적용하여, 사용자의 이미지를 변경할 수 있다. 필터는 소정의 규칙에 따라 이미지의 일부 또는 전부를 변경하는 효과를 가질 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에서 특징점을 감지하고, 특징점을 변경하는 효과를 가 질 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에 시각적 효과를 추가하는 효과를 가질 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에 다른 이미지를 오버레이하는 효과를 가질 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에 포함된 사용자의 이미지를 제외한 배경을 변경 하는 효과를 가질 수 있다. 다양한 실시예들에서, 사용자의 이미지에는 복수의 필터들이 적용될 수 있다. 다시 말해, 사용자의 이미 지에 적용되는 필터는 복수의 필터들의 조합으로 구성될 수 있다. 예를 들어, 사용자는 다양한 필터들 중 이미지에 적용될 필터를 하나 이상 선택하여 조합함으로써 이미지를 변경할 필터를 생성할 수 있다. 다양한 실시예들에서, 사용자의 이미지가 동영상 이미지인 경우, 게임 제공 장치는 동영상 이미지에 필터 를 적용하여 변경된 동영상 이미지를 생성할 수 있다. 예를 들어, 사용자의 이미지가 실시간 동영상 이미 지인 경우, 게임 제공 장치는 동영상 이미지에 실시간으로 필터를 적용하여 변경된 동영상 이미지를 생성할 수 있다. 일 실시예에서, 이미지에 적용될 필터는 미리 만들어져 사용자에게 제공될 수 있다. 게임 제공 장치는 사용자의 입력에 따라 사용자의 이미지에 필터를 적용할 수 있다. 예를 들어, 사용자는 제공되는 다양한 필터들 중 이미지에 적용될 필터를 선택할 수 있다. 다른 실시예에서, 이미지에 적용될 필터는 이미지로부터 생성될 수 있다. 이에 대하여는 도 6을 참조하여 자세 히 설명한다. 게임 제공 장치는 변경된 이미지를 이용하여, 사용자가 게임을 플레이하기 위한 아바타를 생성할 수 있다. 일 실시예에서, 아바타는 게임 내에서 사용자를 대표하는 이미지로서 사용될 수 있다. 일 실시예에서, 아 바타는 게임 내에서 사용자가 제어 가능한 오브젝트, 즉 캐릭터로 사용될 수 있다. 예를 들어, 아바타 는 변경된 이미지를 이용하여 생성된 2D 또는 3D 캐릭터일 수 있고, 사용자의 조작에 따라 게임 공간 상에 서 움직이거나, 게임 오브젝트와 상호작용하는 캐릭터일 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자의 아바타를 생성하기 위해 사용된 필터에 관한 정보를 저장할 수 있다. 일 실시예에서, 필터 정보는 사용자의 이미지를 포함하지 않고, 사용자의 이미지를 변경하기 위하여 사용된 필터에 관한 정보만을 포함할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자가 아바타를 이 용하여 게임을 플레이한 내역 및 결과를 게임 활동 정보로서 저장할 수 있다. 본 개시의 게임 제공 장치는 블록체인 네트워크와 통신할 수 있다. 블록체인 네트워크는 블록체인 기 술을 이용하는 네트워크일 수 있다. 블록체인 네트워크는 전적으로 하드웨어이거나, 또는 부분적으로 하 드웨어이고 부분적으로 소프트웨어일 수 있고, 하나 이상의 서버 또는 컴퓨터, 단말기 등으로 구성될 수 있다. 게임 제공 장치는 블록체인 네트워크와 통신하여, 아바타를 NFT화 할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자의 아바타를 생성하는 데 사용된 필터 정보와, 사용자의 게임 활동 정보를 포함하는 아 바타 NFT를 생성할 수 있다. NFT화된 아바타는 대체 불가하며, 거래 이후에도 고유 식별 코드가 변 하지 않고 식별될 수 있도록 고유의 ID와 메타데이터 정보를 포함할 수 있다. NFT화된 아바타는 오직 하 나의 사용자에 의해서만 게임 플레이에 사용될 수 있다. 다양한 실시예들에서, 아바타 NFT는 다른 사용자에게 거래될 수 있다. 이에 대하여는 도 9를 참조하여 자세히 설명한다. 도 3는 본 개시의 다양한 실시예들에 따른, 게임 제공 시스템의 블록도이다. 도 3을 참조하면, 게임 제공 시스템은 사용자 단말(110, 120, 130), 게임 서버, 및 블록체인 네트워크 를 포함할 수 있다. 사용자 단말(110, 120, 130)은 게임의 구동이 가능한 전자 장치로서 도 1의 사용자 단말(110 내지 160)에 대응될 수 있다. 게임 서버는 게임 서비스를 제공하는 서버 장치로서 도 1의 서버 에 대응될 수 있다. 사용자 단말(110, 120, 130) 및 게임 서버는 블록체인 네트워크와 통신할 수 있다. 다만, 도 3에 도시된 구성 요소가 모두 게임 제공 시스템의 필수 구성 요소인 것은 아니다. 도 3에 도시된 구 성 요소보다 많은 구성 요소에 의해 게임 제공 시스템이 구현될 수도 있고, 도 3에 도시된 구성 요소보다 적은 구성 요소에 의해 게임 제공 시스템이 구현될 수 있다. 예를 들어, 사용자 단말이 본 개시의 다양한 실시 예들에 따른 게임 서버의 기능을 수행할 수도 있다. 다양한 실시예들에서, 사용자 단말은 게임 클라이언트, 아바타 생성부, NFT 관리부를 포함 할 수 있다. 게임 클라이언트는 게임 서버의 게임 인터페이스와 통신하여, 사용자 단말에 게임 서비스를 제공할 수 있다. 아바타 생성부는 사용자의 얼굴을 포함하는 이미지를 획득할 수 있다. 사용자 이미지는 사용자의 실사 사 진 또는 사용자로 식별할 수 있는 객체를 포함하는 드로잉을 포함할 수 있다. 일 실시예에서, 사용자 이미지는 동영상 이미지일 수 있다. 예를 들어, 사용자 이미지는 카메라를 통해 촬영되는 실시간 동영상 이미지일 수 있 다. 일 실시예에서, 사용자 이미지는 게임 제공 장치에 포함된 카메라(미도시)를 통해 촬영된 것일 수 있다. 일 실 시예에서, 사용자 이미지는 게임 제공 장치의 메모리(미도시)에 저장된 것일 수 있다. 일 실시예에서, 사용자 이미지는 통신망을 통해 외부 장치로부터 전송된 것일 수 있다. 아바타 생성부는 사용자 이미지에 필터를 적용하여 변경된 이미지를 생성할 수 있다. 필터는 소정의 규칙 에 따라 이미지의 일부 또는 전부를 변경하는 효과를 가질 수 있다. 다양한 실시예들에서, 아바타 생성부(32 0)는 이미지에서 특징점을 감지하고, 특징점을 변경할 수 있다. 다양한 실시예들에서, 아바타 생성부는 이 미지에 시각적 효과를 추가할 수 있다. 다양한 실시예들에서, 아바타 생성부는 이미지에 다른 이미지를 오버레이할 수 있다. 다양한 실시예들에서, 아바타 생성부는 이미지에 포함된 사용자의 이미지를 제외한 배경을 변경하는 효과를 가질 수 있다. 다양한 실시예들에서, 아바타 생성부는 사용자 이미지에 복수의 필터들을 적용할 수 있다. 다양한 실시예들에서, 사용자 이미지가 동영상 이미지인 경우, 아바타 생성부는 동영상 이미지에 필터를 적용하여 변경된 동영상 이미지를 생성할 수 있다. 일 실시예에서, 필터는 미리 생성되어 게임 제공 장치에 저장되어 있을 수 있다. 아바타 생성부는 사용자 의 입력에 따라 저장된 필터를 사용자 이미지에 적용할 수 있다. 다른 실시예에서, 이미지에 적용될 필터는 이 미지로부터 생성될 수 있다. 아바타 생성부는 변경된 이미지에 기초하여 사용자가 게임을 플레이하기 위한 아바타를 생성할 수 있다. 일 실시예에서, 아바타 생성부는 변경된 이미지를 이용하여 2D 또는 3D 캐릭터를 생성할 수 있다. 일 실시예에서, 생성된 아바타는 게임 클라이언트를 통해 사용자 단말에서 게임을 플레이하는 동안 디스플 레이될 수 있다. 일 실시예에서, 아바타의 정보는 게임 클라이언트를 통해 게임 서버에 전송되고, 게임 데이터베이스(DB)에 저장될 수 있다. 저장되는 아바타의 정보는 사용자의 아바타를 생성하기 위해 사용된 필터 정보와, 사용자가 아바타를 이용하여 게임을 플레이한 내역 및 결과를 나타내는 게임 활동 정보를 포함할 수 있다. NFT 관리부는 사용자가 소유한 NFT를 관리할 수 있다. 일 실시예에서, NFT 관리부는 블록체인 네트 워크와 통신하여, 사용자가 소유한 NFT의 정보를 저장하고 업데이트할 수 있다. 예를 들어, NFT 관리부 는 사용자와 다른 사용자와의 사이에서 NFT의 거래가 이루어질 경우, NFT의 소유자를 변경할 수 있다. 일 실시예에서, NFT 관리부는 스마트 컨트랙트를 실행함으로써, NFT의 발행, 삭제, 또는 거래를 수행할 수 있 다.일 실시예에서, NFT 관리부는 아바타 NFT에 포함된 정보에 기초하여 아바타를 생성하기 위하여, 아바타 NFT에 포함된 정보, 예를 들어 필터 정보 및 게임 활동 정보를 아바타 생성부로 출력할 수 있다. 일 실시 예에서, 아바타 생성부는 NFT 관리부로부터 획득한 정보에 기초하여 아바타를 생성할 수 있다. 예를 들어, 아바타 생성부는 NFT에 포함된 필터 정보를 이용하여, 사용자 이미지에 필터를 적용하여 변경된 이 미지를 생성하고, 변경된 이미지에 기초하여 아바타를 생성할 수 있다. 예를 들어, 아바타 생성부는 NFT 에 포함된 게임 활동 정보에 기초하여 사용자의 게임 활동 정보를 업데이트 할 수 있다. 다양한 실시예들에서, 게임 서버는 게임 인터페이스, 게임 데이터베이스(DB), 및 NFT 생성부 를 포함할 수 있다. 게임 인터페이스는 사용자 단말의 게임 클라이언트와 통신하여, 사용 자에게 게임 서비스를 제공할 수 있다. 게임 DB는 게임 인터페이스가 게임을 제공하기 위한 데이터들을 저장하고 관리할 수 있다. 도 3에서 는 게임 DB가 게임 서버에 포함되는 것으로 도시되었으나, 다른 실시예에 따르면, 게임 DB는 게 임 서버와 서로 구분되는 별도의 서버 장치에 저장되고, 게임 서버와 상호 연동될 수 있다. 다양한 실시예들에서, 게임 DB는 사용자의 아바타를 생성하기 위해 사용된 필터에 관한 정보를 저장할 수 있다. 일 실시예에서, 필터 정보는 사용자의 이미지를 포함하지 않고, 사용자의 이미지를 변경하기 위하여 사 용된 필터에 관한 정보만을 포함할 수 있다. 예를 들어, 필터 정보는 이미지에서 변경되는 부분을 지정하는 특 징점 정보 또는 위치 정보와, 상기 변경되는 부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함할 수 있다. 다양한 실시예들에서, 게임 DB는 사용자가 아바타를 이용하여 게임을 플레이한 기록을 게임 활동 정보로서 저장할 수 있다. 일 실시예에서, 게임 활동 정보는 사용자의 캐릭터 정보를 포함할 수 있다. 예를 들어, 게임 활동 정보는 캐릭터의 레벨, 등급, 속성, 능력치, 스킬, 누적 플레이 시간, 칭호, 업적, 경험한 또는 완료한 컨 텐츠, 최고 기록 등을 포함할 수 있다. 일 실시예에서, 게임 활동 정보는 사용자와 다른 사용자 간의 관계에 관한 정보를 포함할 수 있다. 예를 들어, 게임 활동 정보는 사용자의 친구 목록, 차단 목록, 인기도, 참여한 길드/클랜/파티 정보, 대화 내역 등을 포함할 수 있다. 일 실시예에서, 게임 활동 정보는 사용자가 소유한 게 임 내 재화에 관한 정보를 포함할 수 있다. 예를 들어, 게임 활동 정보는 사용자가 소지한 게임 화폐 및 아이 템에 관한 정보를 포함할 수 있다. 일 실시예에서, 게임 활동 정보는 사용자가 게임을 플레이하여 생성한 컨텐 츠 정보를 포함할 수 있다. 예를 들어, 게임 활동 정보는 게임 플레이 스크린샷 또는 영상 클립 등을 포함할 수 있다. 물론 상기 예시에 제한되지 않는다. 일 실시예에서, 게임 DB에 저장된 게임 활동 정보는, 사용자가 게임을 플레이함에 따라 업데이트될 수 있 다. 일 실시예에서, 게임 DB에 저장된 필터 정보 및 게임 활동 정보는, 아바타 NFT에 기초하여 아바타를 생성함에 따라 업데이트될 수 있다. NFT 생성부는 블록체인 네트워크와 통신하여, 사용자의 아바타를 NFT화 할 수 있다. 다양한 실 시예들에서, 게임 제공 장치는 사용자의 아바타를 생성하는 데 사용된 필터 정보와, 사용자의 게임 활동 정보를 포함하는 아바타 NFT를 생성할 수 있다. 일 실시예에서, NFT 생성부는 NFT화할 아바타의 정보(필터 정보 및 게임 활동 정보)를 결정하여, 온라인 상에 업로드할 수 있다. 일 실시예에서, NFT 생성부는 업로드된 아바타의 정보를 적어도 한 명의 채굴자 (miner)에게 전송할 수 있다. 채굴자란 새로운 블록을 생성하거나 기존의 블록을 제어하고 그 대가로 암호 화폐 를 지급받는 블록 제어권자일 수 있다. 전송된 아바타의 정보는 채굴자에 의하여 NFT화 되어 블록체인 상에 추 가될 수 있다. 일 실시예에서, NFT 생성부는 NFT화에 성공한 채굴자에게 수수료를 지급할 수 있다. 일 실 시예에서, NFT 생성부는 NFT화가 완료되는 경우, NFT화된 아바타에 대한 고유의 NFT 자산 ID를 획득할 수 있다. 일 실시예에서, NFT 생성부가 블록 제어권을 가진 경우 NFT 생성부는 직접 NFT화를 수행할 수 도 있다. 일 실시예에서, NFT 생성부는 아바타 NFT가 생성되면, NFT의 소유자(일반적으로 아바타의 사용자)의 사용 자 단말에 생성된 NFT의 정보를 전송할 수 있다. 일 실시예에서, NFT 생성부는 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데이트된 사용자 의 게임 활동 정보를 포함하는 NFT를 생성할 수 있다. 즉, 아바타 NFT가 생성된 후, 사용자가 해당 아바타를 사용하여 게임을 플레이함으로써 게임 활동 정보가 업데이트되면, NFT 생성부는 업데이트된 정보를 NFT에 반영하여 새로운 NFT를 생성할 수 있다. 도 4는 본 개시의 다양한 실시예들에 따른, 게임 제공 방법의 흐름도이다. 도 4에 도시된 동작들은 도 1에 도시 된 사용자 단말(110 내지 160) 및 서버, 도 10에 도시된 게임 제공 장치 또는 게임 제공 장치(100 0)의 프로세서, 도 11에 도시된 서버 또는 서버의 프로세서, 또는 도 12에 도시된 사 용자 단말 또는 사용자 단말의 프로세서에 의해 수행될 수 있다. 도 4를 참조하면, 단계 S410에서, 게임 제공 장치는 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여, 이미 지를 변경할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 이미지에서 특징점을 감지하고, 특징점을 변경 할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 이미지에 시각적 효과를 추가할 수 있다. 다양한 실시예 들에서, 게임 제공 장치는 이미지에 다른 이미지를 오버레이할 수 있다. 다양한 실시예들에서, 게임 제공 장치 는 이미지에 포함된 사용자의 이미지를 제외한 배경을 변경하는 효과를 가질 수 있다. 다양한 실시예들에서, 사용자 이미지가 동영상 이미지인 경우, 게임 제공 장치는 동영상 이미지에 필터를 적용 하여 변경된 동영상 이미지를 생성할 수 있다. 단계 S420에서, 게임 제공 장치는 변경된 이미지에 기초하여 사용자가 게임을 플레이하기 위한 아바타를 생성할 수 있다. 일 실시예에서, 게임 제공 장치는 변경된 이미지를 이용하여 2D 또는 3D 캐릭터를 생성할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자의 아바타를 생성하기 위해 사용된 필터에 관한 정보를 저장할 수 있다. 일 실시예에서, 필터 정보는 사용자의 이미지를 포함하지 않고, 사용자의 이미지를 변경하기 위하여 사용된 필터에 관한 정보만을 포함할 수 있다. 예를 들어, 필터 정보는 이미지에서 변경되는 부분을 지정하는 특징점 정보 또는 위치 정보와, 상기 변경되는 부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함 할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자가 아바타를 이용하여 게임을 플레이한 내역 및 결과를 게임 활 동 정보로서 저장할 수 있다. 일 실시예에서, 게임 활동 정보는, 사용자의 캐릭터 정보, 사용자와 다른 사용자 간의 관계에 관한 정보, 사용자가 소유한 게임 내 재화 정보, 사용자가 게임을 플레이하여 생성한 컨텐츠 정보 중 적어도 하나를 포함할 수 있다. 단계 S430에서, 게임 제공 장치는 필터 정보와, 사용자의 게임 활동 정보를 포함하는 NFT를 생성할 수 있다. 게임 제공 장치는 블록체인 네트워크와 통신하여, 필터 정보 및 게임 활동 정보를 포함하는 아바타 정보를 NFT 화할 수 있다. 일 실시예에서, 게임 제공 장치는 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데 이트된 사용자의 게임 활동 정보를 포함하는 NFT를 생성할 수 있다. 도 5는 본 개시의 다양한 실시예들에 따른, 사용자 이미지에 필터를 적용하는 방법을 설명하기 위한 도면이다. 게임 제공 장치는 사용자의 이미지에 필터를 적용하여, 사용자의 이미지를 변경할 수 있다. 필터는 소정의 규칙 에 따라 이미지의 일부 또는 전부를 변경하는 효과를 가질 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에서 특징점을 감지하고, 특징점을 변경하는 효과를 가 질 수 있다. 일 실시예에서, 특징점은 사용자의 이미지에 포함된 사용자의 얼굴 랜드마크일 수 있다. 예를 들 어, 특징점은 사용자의 얼굴에서 눈썹, 눈, 코, 입, 턱, 머리카락, 수염, 의상, 장신구 등에 해당하는 부분 또 는 위치일 수 있다. 일 실시예에서, 특징점은 이미지의 특정 좌표에 해당하는 부분 또는 위치일 수 있다. 물론 상기 예시에 제한되지 않는다. 일 실시예에서, 이미지에 적용되는 필터는 감지된 특징점의 크기, 위치, 색조, 또는 형태 중 적어도 하나를 변 경할 수 있다. 예를 들어, 게임 제공 장치는 사용자 이미지에 필터를 적용하여, 신체 부위의 크기 또는 위치를 변경하거나 신체 부위의 모양을 변형시킬 수 있다. 다른 예를 들어, 게임 제공 장치는 사용자 이미지에 필터를 적용하여, 눈동자, 머리카락, 피부, 의상 등의 색깔을 변경할 수 있다. 다른 예를 들어, 게임 제공 장치는 사 용자 이미지에 필터를 적용하여, 얼굴 표정을 변경시킬 수 있다. 다른 예를 들어, 게임 제공 장치는 사용자 이 미지에 필터를 적용하여, 사용자의 얼굴에 화장 또는 페이스페인팅을 한 것과 같은 효과를 줄 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에 시각적 효과를 추가하는 효과를 가질 수 있다. 예를 들어, 이미지에 적용되는 필터는 이미지에 노이즈를 추가하거나, 이미지를 선명하게 또는 흐리게 만들거나, 이 미지를 왜곡하거나, 이미지에 텍스처를 부가하거나, 또는 이미지의 색조, 밝기, 또는 채도를 변경하는 효과 중 적어도 하나를 가질 수 있다. 물론 상기 예시에 제한되지 않는다. 일 실시예에서, 이미지에 적용되는 필터는 이미지의 일부분 또는 전부에 시각적 효과를 추가할 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에 다른 이미지를 오버레이하는 효과를 가질 수 있다. 일 실시예에서, 오버레이되는 다른 이미지의 위치는 이미지에서 감지된 특징점에 대응될 수 있다. 예를 들어, 게임 제공 장치는 사용자 이미지에 필터를 적용하여, 얼굴 장식 또는 머리 장식을 추가할 수 있다. 다른 예를 들어, 게임 제공 장치는 사용자 이미지에 필터를 적용하여, 스티커, 이모티콘, 텍스트 메시지, 파티클, 오브젝 트 등을 추가할 수 있다. 물론 상기 예시에 제한되지 않는다. 일 실시예에서, 오버레이되는 다른 이미지는 애 니메이션을 포함할 수 있다. 다양한 실시예들에서, 이미지에 적용되는 필터는 이미지에 포함된 사용자의 이미지를 제외한 배경을 변경하는 효과를 가질 수 있다. 일 실시예에서, 게임 제공 장치는 이미지에서 사용자의 이미지에 해당하는 부분을 감지 하여 추출할 수 있다. 게임 제공 장치는 추출된 부분을 배경 이미지와 합성하여 변경된 이미지를 생성할 수 있 다. 일 실시예에서, 배경 이미지는 사용자가 플레이하는 게임의 게임 공간에 대응되는 이미지일 수 있다. 예 를 들어, 배경 이미지는 아바타가 위치한 게임 공간의 배경 그래픽 이미지와 동일한 이미지일 수 있다. 다양한 실시예들에서, 사용자 이미지에는 복수의 필터들이 적용될 수 있다. 다시 말해, 사용자 이미지에 적용 되는 필터는 복수의 필터들의 조합으로 구성될 수 있다. 예를 들어, 사용자는 다양한 필터들 중 이미지에 적용 될 필터를 하나 이상 선택하여 조합함으로써 이미지를 변경할 필터를 생성할 수 있다. 도 5를 참조하면, 다양한 실시예들에서, 필터 정보는 사용자 이미지에서 변경되는 부분을 지정하는 특징점 정보 또는 위치 정보와, 상기 변경되는 부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함 할 수 있다. 예를 들어, 사용자 이미지에서 헤어스타일을 변경하는 필터는, 사용자 이미지에 오버레이될 헤어 스타일 이미지와, 상기 헤어스타일 이미지의 위치의 기준이 되는 특징점으로서 얼굴 윤곽의 위치를 포함할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자 이미지에 필터를 적용하기 위해, 필터 정보에 포함된 특징점 정보 또는 위치 정보에 대응되는 사용자 이미지의 특징점 또는 위치를 인식할 수 있다. 다양한 실 시예들에서, 게임 제공 장치는 사용자 이미지에서 인식한 특징점을 필터 정보에 포함된 변경사항 정 보에 따라 변경하여 변경된 이미지를 생성할 수 있다. 일 실시예에서, 게임 제공 장치는 사용자 이미지에서 인식한 특징점의 위치와, 필터 정보에 의해 지 정된 특징점의 위치가 일치하도록, 필터에 의해 변경되는 부분의 위치를 조정하거나 형태를 변형할 수 있 다. 예를 들어, 게임 제공 장치는 필터에 의해 오버레이되는 이미지의 위치를 조정하거나 형태를 변형할 수 있 다. 다른 예를 들어, 게임 제공 장치는 필터에 의해 추가되는 시각적 효과의 위치를 조정하거나 형태를 변형할 수 있다. 도 6은 본 개시의 다양한 실시예들에 따른, 사용자 이미지로부터 필터를 생성하는 방법을 설명하기 위한 도면이 다. 게임 제공 장치는 미리 만들어진 필터를 사용자 이미지에 적용하는 것 외에, 사용자 이미지로부터 새로운 필터 를 생성할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자 이미지에서 특징적인 부분을 감지하여, 감 지된 특징을 추출하여 다른 이미지에 적용할 수 있는 필터를 생성할 수 있다. 도 6을 참조하면, 단계 610에서, 게임 제공 장치는 필터를 생성하기 위한 사용자 이미지를 획득할 수 있다. 사용자 이미지는 사용자의 실사 사진 또는 사용자로 식별할 수 있는 객체를 포함하는 드로잉을 포함할 수 있다. 일 실시예에서, 사용자 이미지는 동영상 이미지일 수 있다. 예를 들어, 사용자 이미지는 카메라를 통해 촬영되 는 실시간 동영상 이미지일 수 있다. 일 실시예에서, 사용자 이미지는 게임 제공 장치에 포함된 카메라를 통해 촬영된 것일 수 있다. 일 실시예에서, 사용자 이미지는 게임 제공 장치의 메모리에 저장된 것일 수 있다. 일 실시예에서, 사용자 이미지 는 통신망을 통해 외부 장치로부터 전송된 것일 수 있다. 단계 620에서, 게임 제공 장치는 사용자 이미지에서 특징적인 부분을 감지할 수 있다. 일 실시예에서, 특징적 인 부분은 사용자의 이미지에 포함된 사용자의 얼굴 랜드마크일 수 있다. 예를 들어, 특징적인 부분은 사용자의 얼굴에서 눈썹, 눈, 코, 입, 턱, 머리카락, 수염, 의상, 장신구 등에 해당하는 부분일 수 있다. 일 실시예에서, 게임 제공 장치는 인공지능 모델을 사용하여, 사용자 이미지에서 특징적인 부분을 감지할 수 있다. 예를 들어, 도 6에 도시된 예시적인 사용자 이미지에서, 게임 제공 장치는 안경과 수염을 특징적인 부분으로 판 단하고, 안경 및 수염에 해당하는 부분을 판단할 수 있다. 예를 들어, 게임 제공 장치는 얼굴 랜드마크의 위치 를 기준으로 특징적인 부분의 위치 정보를 획득할 수 있다. 단계 630에서, 게임 제공 장치는 사용자 이미지에서 감지한 특징적인 부분을 추출하여 필터를 생성할 수 있다. 예를 들어, 게임 제공 장치는 사용자 이미지에서 특징적인 부분을 추출하여, 필터를 적용하였을 때 오버레이될 이미지를 추출할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 이미지에서 변경되는 부분을 지정하는 특징 점 정보 또는 위치 정보 및 상기 변경되는 부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함하는 필터 정보를 저장할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 사용자 이미지에서 생성된 필터를 사용자의 입력에 의해 변경할 수 있 다. 예를 들어, 게임 제공 장치는 사용자의 입력에 의해, 사용자 이미지에서 특징적인 부분을 추가로 감지하여 추출할 수 있다. 예를 들어, 게임 제공 장치는 사용자의 입력에 의해, 사용자 이미지에서 추출된 특징적인 부 분을 삭제할 수 있다. 예를 들어, 게임 제공 장치는 사용자의 입력에 의해, 생성된 필터에 미리 만들어진 필터 를 추가로 조합할 수 있다. 다양한 실시예들에서, 생성된 필터는 미리 만들어진 필터들과 마찬가지로 이미지에 적용되어 아바타를 생성하기 위해 사용될 수 있다. 일 실시예에서, 생성된 필터는 다른 필터들과 함께 조합되어 사용될 수 있다. 다양한 실시예들에서, 게임 제공 장치는 생성된 필터가 사용자들에 의해 사용될 수 있도록 관리할 수 있다. 일 실시예에서, 게임 제공 장치는 생성된 필터를 데이터베이스에 등록할 수 있다. 일 실시예에서, 등록된 필터는 필터를 생성한 사용자뿐 아니라, 다른 사용자들에 의해서도 사용될 수 있다. 예를 들어, 등록된 필터는 게임 내에서 사용자들 간에 거래되도록 설정될 수 있다. 도 7은 본 개시의 다양한 실시예들에 따른, 게임 제공 장치가 사용자 이미지로부터 필터를 생성하기 위해 이용 하는, 복수 개의 계층 구조를 갖는 인공 신경망을 개략적으로 도시한 도면이다. 인공지능 학습 모델은 사용자의 얼굴이 포함된 이미지를 입력받고, 이미지로부터 특징적인 부분을 식별하는 기 능을 제공할 수 있다. 인공지능 학습 모델은 특징적인 부분의 분리된 이미지를 출력하는 기능을 제공할 수 있 다. 다양한 실시예들에서, 인공지능 학습 모델은, 인공지능 알고리즘으로서, 기계학습, 신경망, 유전자, 딥러 닝, 분류 알고리즘 중 적어도 하나를 이용하여 학습된 학습 모델일 수 있다. 도 7을 참고하면, 인공지능 학습 모델을 구성하는 인공 신경망은, 입력 레이어, 적어도 하나의 히든 레이 어(720, 730) 및 출력 레이어를 포함할 수 있다. 또한, 인공 신경망을 통한 연산은 게임 제공 장치 내의 프로세서에서 수행될 수 있다. 또한, 히든 레이어(720, 730)에서 수행된 학습 및 훈련을 통해 각 레이어와 노 드 사이의 가중치가 학습될 수 있다. 예를 들면, 게임 제공 장치 내의 프로세서는 반복적인 학습을 통하여, 2D 이미지에서 특징적인 부분을 식별하는 데 영향을 미치는 요소들의 가중치의 값들을 획득할 수 있다. 예를 들어, 게임 제공 장치 내의 프로세서는 특 징적인 부분을 식별하는 데 이용되는 이미지 내의 특징점들의 가중치의 값들을 획득할 수 있다. 또한, 게임 제 공 장치는 획득된 가중치의 값이 학습 모델에 반영되도록, 훈련된 인공 신경망에서 학습 모델을 재학습 할 수 있다. 도 8은 본 개시의 다양한 실시예들에 따른, NFT를 거래하는 방법을 나타내는 흐름도이다. 일 실시예에서, NFT를 구매하고자 하는 사용자는 코인 거래소에서 원화 등의 명목 화폐를 이더리움이나 비트코 인 등의 암호화폐로 환전한 후(S810), 환전한 이더리움 또는 비트코인을 이용하여 다시 NFT 거래소에서 원하는 NFT를 구매할 수 있다(S820). NFT 자산 거래소에서 NFT에 대한 소유권 이전이 발생하는 경우, 소유권 이전에 관한 모든 내용은 블록체인 상에 기록된다(S830). 이 과정에서 사용자는 거래시 마다 블록체인 상에 기록하기 위하여 수수료인 GAS 및 transction fee를 지불할 수 있다. 일 실시예에서, 소유권 이전이 발생하는 경우 NFT는 매도자의 전자지갑에서 매수자의 전자지갑으로 이전될 수 있다. 사용자는 본인의 전자지갑을 직접 생성하고, 전자지갑에 보유한 NFT 자산을 직접 관리하고 판매할 수 있 다. 일 실시예에서, 소유한 디지털 자산을 매도하는 경우 사용자는 NFT 거래소에서 NFT를 매도한 후, 대가로 받은 이더리움이나 비트코인 등의 암호 화폐를 코인 거래소에서 다시 명목 화폐로 환전할 수 있다(S840). 도 9는 본 개시의 다양한 실시예들에 따른, 다른 사용자가 아바타 NFT를 이용하는 방법을 설명하기 위한 도면이 다. 도 9를 참조하면, 아바타 NFT는 사용자의 아바타를 생성하는 데 사용된 필터 정보, 사용자의 게임 활 동 정보, 및 NFT의 소유자 정보를 포함할 수 있다. 예를 들어, 제1 사용자에 의해 아바타가 생성되어 게임 플레이에 이용되다가, 제1 사용자의 아바타가 NFT화 될 수 있다. 이 경우 제1 사용자의 아바타를 생 성하는 데 사용된 필터 정보 및 제1 사용자의 게임 활동 정보가 NFT에 저장된다. 제2 사용자로 NFT의 소유자가 변경되면, 제2 사용자는 NFT에 포함된 정보에 기초하여 아바타를 생성 할 수 있다. 다양한 실시예들에서, 게임 제공 장치는 NFT에 저장된 필터 정보에 기초하여, 제2 사용 자의 이미지에 필터를 적용하여 제2 사용자의 이미지를 변경시킬 수 있다. 즉, 제1 사용자의 아바타 를 생성하기 위해 제1 사용자의 이미지를 변경한 것과 동일한 필터가 제2 사용자의 이미지에 적용될 수 있 다. 다양한 실시예들에서, 게임 제공 장치는 NFT에 저장된 게임 활동 정보에 기초하여, 제2 사용자의 게 임 활동 정보를 업데이트할 수 있다. 즉, 제1 사용자가 아바타를 이용하여 게임을 플레이한 내역이 제2 사용자의 아바타로 이전될 수 있다. 다양한 실시예들에서, 생성된 제2 사용자의 아바타는 게임 내에서 사용자를 대표하는 이미지 또는 게임 내 에서 사용자가 제어 가능한 오브젝트, 즉 캐릭터로 사용될 수 있다. 일 실시예에서, 게임 제공 장치는 NFT의 소유자가 아닌 사용자가 동일한 아바타로 게임을 플레이할 수 없도록 설정할 수 있다. 예를 들어, 게임 제공 장치는 사용자가 NFT화된 아바타를 양도하였을 경우 해당 아바타로 게 임을 플레이할 수 없도록 설정할 수 있다. 예를 들어, 제1 사용자가 아바타를 NFT화한 후 제2 사용자에게 양도 한 경우, 게임 제공 장치는 제1 사용자의 사용자 계정에서 양도된 아바타를 삭제하거나, 또는 게임 플레이에 이 용할 수 없도록 제한을 가할 수 있다. 도 10는 본 개시의 다양한 실시예들에 따른 게임 제공 장치의 세부적인 구성을 설명하기 위한 도면이다. 도 10에 도시된 바와 같이 일부 실시예에 따른 게임 제공 장치는 적어도 하나의 프로세서, 통신부 , 및 메모리를 포함할 수 있다. 그러나 도 10에 도시된 구성 요소가 모두 게임 제공 장치의 필수 구성 요소인 것은 아니다. 도 10에 도시된 구성 요소보다 많은 구성 요소에 의해 게임 제공 장치가 구현될 수도 있고, 도 10에 도시된 구성 요소보다 적은 구성 요소에 의해 게임 제공 장치가 구현될 수 있 다. 게임 제공 장치는 사용자 단말일 수도 있고 서버일 수도 있고, 게임 네트워크 시스템일수도 있고, 별도의 장치일 수도 있다. 본 개시의 일 실시예에 따르면, 프로세서는 통상적으로 게임 제공 장치의 전반적인 동작을 제어한 다. 예를 들어, 프로세서는 메모리에 저장된 프로그램을 실행함으로써, 통신부 및 메모리 등을 전반적으로 제어할 수 있다. 프로세서는, 통신부 및 메모리 등을 제어함으로써, 본 명세서에서의 게임 제공 장치의 동작을 제어할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이 미지를 변경하고, 상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하고, 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하도 록 설정될 수 있다. 일 실시예에 따르면, 상기 이미지에 필터를 적용하여 상기 이미지를 변경하는 동작은, 상기 이미지에서 특징점 을 감지하고, 상기 특징점을 변경하는 동작; 상기 이미지에 시각적 효과를 추가하는 동작; 상기 이미지에 다른 이미지를 오버레이하는 동작; 또는 상기 이미지에서 사용자의 이미지를 감지하고, 상기 사용자의 이미지를 제외 한 배경을 변경하는 동작 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 상기 이미지는 실시간 동영상 이미지이고, 프로세서는 상기 동영상 이미지에 실시간 으로 상기 필터를 적용하여, 변경된 동영상 이미지를 생성하도록 설정될 수 있다. 일 실시예에 따르면, 프로세서는 인공지능 모델을 이용하여, 상기 이미지에서 특징점을 감지하고, 상기 감지된 특징점에 기초하여 필터를 자동 생성하도록 설정될 수 있다. 일 실시예에 따르면, 프로세서는 상기 생성된 필터를 상기 사용자의 입력에 의해 변경하도록 더 설정될 수 있다. 일 실시예에 따르면, 프로세서는 상기 사용자의 게임 활동 정보가 업데이트됨에 기초하여, 상기 업데이트 된 사용자의 게임 활동 정보를 포함하는 NFT를 생성하도록 더 설정될 수 있다. 일 실시예에 따르면, 프로세서는 상기 NFT의 소유자가 다른 사용자로 변경됨에 기초하여, 상기 NFT에 포 함된 정보에 기초하여 상기 다른 사용자의 아바타를 생성하도록 더 설정되고, 프로세서는 상기 NFT에 저 장된 필터 정보에 기초하여, 상기 다른 사용자의 이미지에 필터를 적용하고, 상기 NFT에 저장된 게임 활동 정보 에 기초하여, 상기 다른 사용자의 게임 활동 정보를 업데이트함으로써, 상기 다른 사용자의 아바타를 생성하도 록 설정될 수 있다. 본 개시의 일 실시예에 따르면, 통신부는 프로세서의 제어에 의해 외부 장치와 통신을 수행할 수 있다. 예를 들어, 통신부는 프로세서의 제어에 의해 결제 서버, 인증 서버와 같은 외부 장치와 통 신을 수행할 수 있다. 또한 통신부는 외부 인터페이스와의 통신을 통해 사용자 정보 또는 사용자 입력을 획득할 수도 있다. 메모리는 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 게임 제공 장치로 입 력되거나 게임 제공 장치로부터 출력되는 데이터를 저장할 수도 있다. 본 개시의 일 실시예에 따르면 메 모리는 사용자 계정에 관한 정보, 게임 관련 정보를 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 사용자의 아바타를 생성하기 위해 사용된 필터에 관한 정보를 저장할 수 있다. 일 실시예에서, 필터 정보는 사용자의 이미지를 포함하지 않고, 사용자의 이미지를 변경하기 위하여 사용된 필터에 관한 정보만을 포함할 수 있다. 일 실시예에서, 필터 정보는 이미지에서 변경되는 부분 을 지정하는 특징점 정보 또는 위치 정보와, 상기 변경되는 부분을 어떻게 변경할 것인지를 지정하는 변경사항 정보를 포함할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 사용자가 아바타를 이용하여 게임을 플레이한 기록을 게임 활동 정보로서 저장할 수 있다. 일 실시예에서, 게임 활동 정보는 사용자의 캐릭터 정보, 상기 사용자와 다른 사용 자 간의 관계에 관한 정보, 상기 사용자가 소유한 게임 내 재화 정보, 상기 사용자가 게임을 플레이하여 생성한 컨텐츠 정보 중 적어도 하나를 포함할 수 있다. 본 개시의 일 실시예에 따르면, 메모리에 저장된 프로그램을 이용하여 프로세서는 게임 제공 방법 을 실행할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한 본 개시의 일 실시예에 따르면, 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있다. 본 개시의 일 실시예에 따르면, 게임 제공 방법은 게임 제공 장치에서 수행되거나, 서버 또는 사용자 단 말에서 수행될 수도 있으며, 또한 게임 제공 장치가 포함하는 적어도 하나의 구성은 앞선 도 1 내지 도 9 에서 설명한 실시예들을 수행할 수 있다. 또한 게임 제공 방법은 서버와 사용자 단말이 개별적으로 또는 함께 수행할 수도 있다. 서버 및 사용자 단말의 구성은 이하 도 11 및 도 12에서 더 자세히 설명한다. 도 11은 본 개시의 다양한 실시예들에 따른 게임 제공 장치의 세부적인 구성을 설명하기 위한 도면이다. 도 11에 도시된 바와 같이 일부 실시예에 따른 서버는 적어도 하나의 프로세서, 통신부, 및 메모리를 포함할 수 있다. 그러나 도 11에 도시된 구성 요소가 모두 서버의 필수 구성 요소인 것 은 아니다. 도 11에 도시된 구성 요소보다 많은 구성 요소에 의해 서버가 구현될 수도 있고, 도 11에 도 시된 구성 요소보다 적은 구성 요소에 의해 서버가 구현될 수 있다. 서버는 사용자 단말일 수도 있고 서버일 수도 있고, 게임 네트워크 시스템일수도 있고, 별도의 장치일 수도 있다. 본 개시의 일 실시예에 따르면, 프로세서는 통상적으로 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는 메모리에 저장된 프로그램을 실행함으로써, 통신부 및 메모리 등을 전반적으로 제어할 수 있다. 프로세서는, 통신부 및 메모리 등을 제어함으로써, 본 명세서에서의 서버의 동작을 제어할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이 미지를 변경하고, 상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하고, 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하도 록 설정될 수 있다. 본 개시의 일 실시예에 따르면, 프로세서의 동작은 도 10에서 설명한 게임 제공 장치의 프로세서 의 동작과 대응될 수 있으므로, 자세한 설명은 생략한다. 통신부는 프로세서의 제어에 따라 사용자 단말에게 질의를 제공하고, 질의에 대한 응답 정보 를 수신할 수 있다. 또한 본 개시의 일 실시예에 따르면, 통신부는 사용자 단말과 데이터를 송수신 할 수 있으며, 사용자 단말과 송수신하는 데이터에는 사용자 단말 또는 사용자 단말 내에 포 함된 프로그램을 제어하는 제어 데이터를 포함할 수 있다. 메모리는 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 서버로 입력되거나 서버로부터 출력되는 데이터를 저장할 수도 있다. 본 개시의 일 실시예에 따르면 메모리는 사용자 계정에 관한 정보, 게임 관련 정보를 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 사용자의 아바타를 생성하기 위해 사용된 필터에 관한 정보를 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 사용자가 아바타를 이용하여 게임을 플레이 한 기록을 게임 활동 정보로서 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리에 저장된 프로그램을 이용하여 프로세서는 게임 제공 방법 을 실행할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한 본 개시의 일 실시예에 따르면, 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있다. 또한 본 개시의 일 실시예에 따르면, 게임 제공 방법은 서버와 사용자 단말이 나누어 수행할 수도 있고, 서버와 사용자 단말이 개별적으로 수행할 수도 있고, 게임 제공 장치에서 수행될 수도 있다. 도 12는 본 개시의 다양한 실시예들에 따른 사용자 단말의 세부적인 구성을 설명하기 위한 도면이다. 도 12에 도시된 바와 같이 일부 실시예에 따른 사용자 단말은 적어도 하나의 프로세서, 통신부 , 메모리, 및 사용자 인터페이스를 포함할 수 있다. 그러나 도 12에 도시된 구성 요소가 모 두 사용자 단말의 필수 구성 요소인 것은 아니다. 도 12에 도시된 구성 요소보다 많은 구성 요소에 의해 사용자 단말이 구현될 수도 있고, 도 11에 도시된 구성 요소보다 적은 구성 요소에 의해 사용자 단말 이 구현될 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 통상적으로 사용자 단말의 전반적인 동작을 제어한다. 예를 들어, 프로세서는 메모리에 저장된 프로그램을 실행함으로써, 통신부, 메모리, 및 사용자 인터페이스 등을 전반적으로 제어할 수 있다. 프로세서는, 통신부, 메모리 , 및 사용자 인터페이스 등을 제어함으로써, 본 명세서에서의 사용자 단말의 동작을 제어할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 사용자의 얼굴을 포함하는 이미지에 필터를 적용하여 상기 이 미지를 변경하고, 상기 변경된 이미지를 이용하여, 상기 사용자가 게임을 플레이하기 위한 아바타를 생성하고, 필터 정보 및 상기 사용자의 게임 활동 정보를 포함하는 대체불가능 토큰(non-fungible token, NFT)을 생성하도 록 설정될 수 있다. 본 개시의 일 실시예에 따르면, 프로세서의 동작은 도 10에서 설명한 게임 제공 장치의 프로세서 의 동작과 대응될 수 있으므로, 자세한 설명은 생략한다. 통신부는 프로세서의 제어에 따라 서버에게 질의를 제공하고, 질의에 대한 응답 정보를 수신 할 수 있다. 또한 본 개시의 일 실시예에 따르면, 통신부는 서버와 데이터를 송수신할 수 있으며, 서버와 송수신하는 데이터에는 사용자 단말 또는 사용자 단말 내에 포함된 프로그램을 제어 하는 제어 데이터를 포함할 수 있다. 본 개시의 일 실시예에 따르면, 통신부는 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 자기장 통신부(Near Field Communication), WLAN(와이파이) 통신부, 지그비(Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등 을 포함할 수 있으나, 이에 한정되는 것은 아니다. 또한 본 개시의 일 실시예에 따르면, 통신부는 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미 디어 메시지 송수신에 따른 다양한 형태의 데이터를 포함할 수 있다. 메모리는 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 사용자 단말로 입력 되거나 사용자 단말로부터 출력되는 데이터를 저장할 수도 있다. 본 개시의 일 실시예에 따르면 메모리 는 사용자 계정에 관한 정보, 게임 관련 정보를 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 사용자의 아바타를 생성하기 위해 사용된 필터에 관한 정보를 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 사용자가 아바타를 이용하여 게임을 플레이 한 기록을 게임 활동 정보로서 저장할 수 있다. 본 개시의 일 실시예에 따르면, 메모리에 저장된 프로그램을 이용하여 프로세서는 게임 제공 방법 을 실행할 수 있다. 본 개시의 일 실시예에 따르면, 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 또한 본 개시의 일 실시예에 따르면, 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있다. 본 개시의 일 실시예에 따르면, 사용자 인터페이스는 다양한 인터페이스를 포함할 수 있다. 예를 들면, 사용자 인터페이스는 키 패드(key pad), 돔 스위치(dome switch), 음성 입력 인터페이스, 지문 입력 인터 페이스, 터치 입력 인터페이스(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전 도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 카메라, 조그 휠, 조그 스위치 등 다양한 인터페이스 를 포함할 수 있으며, 가속도 센서, 위치 센서, 온도 센서, 광센서 등 다양한 센서를 사용자 인터페이스와 연동 할 수도 있다. 물론 상기 예시에 제한되는 것은 아니다. 또한 본 개시의 일 실시예에 따르면, 사용자 인터페이스는 출력부(미도시)를 더 포함할 수도 있다. 출력 부는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor- liquid crystal display), 유기 발광 다이오드(organic light-emitting diode), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나 를 포함할 수 있다. 디스플레이와 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디스플레 이는 출력 장치 이외에 입력 장치로도 사용될 수 있다. 또한 출력부(미도시)는 LED 램프, 진동 모터, 스피커, 플래쉬 등을 포함할 수 있으며, 상기 예시에 제한되지 않는다. 또한 본 개시의 일 실시예에 따르면, 사용자 인터페이스는 게임 정보에 대한 알림을 이미지, 동영상, 소 리, 진동, 램프 등으로 출력할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 운영 체제 상에서 수행되는 하나 이상의 소 프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된"}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 포함할 수 있다. 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구 성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨 어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0013609", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다. 도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12"}
{"patent_id": "10-2022-0013609", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 다양한 실시예들에 따른, 서버 및 사용자 단말을 포함하는 게임 제공 시스템을 도시한다. 도 2는 본 개시의 다양한 실시예들에 따른, 게임 제공 방법을 설명하기 위한 도면이다. 도 3은 본 개시의 다양한 실시예들에 따른, 게임 제공 시스템의 블록도이다. 도 4는 본 개시의 다양한 실시예들에 따른, 게임 제공 방법의 흐름도이다. 도 5는 본 개시의 다양한 실시예들에 따른, 사용자 이미지에 필터를 적용하는 방법을 설명하기 위한 도면이다. 도 6은 본 개시의 다양한 실시예들에 따른, 사용자 이미지로부터 필터를 생성하는 방법을 설명하기 위한 도면이 다. 도 7은 본 개시의 다양한 실시예들에 따른, 게임 제공 장치가 사용자 이미지로부터 필터를 생성하기 위해 이용 하는, 복수 개의 계층 구조를 갖는 인공 신경망을 개략적으로 도시한 도면이다. 도 8은 본 개시의 다양한 실시예들에 따른, NFT를 거래하는 방법을 나타내는 흐름도이다. 도 9는 본 개시의 다양한 실시예들에 따른, 다른 사용자가 NFT를 이용하는 방법을 설명하기 위한 도면이다. 도 10은 본 개시의 다양한 실시예들에 따른 게임 제공 장치의 세부적인 구성을 설명하기 위한 도면이다. 도 11은 본 개시의 다양한 실시예들에 따른 서버의 세부적인 구성을 설명하기 위한 도면이다. 도 12는 본 개시의 다양한 실시예들에 따른 사용자 단말의 세부적인 구성을 설명하기 위한 도면이다."}
