{"patent_id": "10-2021-0119269", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0036427", "출원번호": "10-2021-0119269", "발명의 명칭": "스마트 공항 관제 시스템 및 방법", "출원인": "인천국제공항공사", "발명자": "홍서연"}}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "계류장내 항공기(110)를 포함하는 이동 객체를 센싱하여 센싱 정보를 생성하는 센서계(120);상기 센싱 정보를 기반으로 상기 이동 객체를 분석하여 분석 제공 정보를 생성하고 다수의 감시 장비로부터 상기 항공기에 대한 비행정보를 획득하는 관리 서버(140); 및 상기 분석 제공 정보와 상기 비행정보를 이용하여 뷰정보(351,352,353)를 생성하고, 상기 뷰정보(351,352,353)를 관제사에게 제공하는 관제탑 서버(150);상기 뷰정보는 상기 관제탑의 관제석에서 보이는 외부 뷰보다 상부에 위치한 디스플레이를 통해 전시됨으로써,상기 관제사의 헤드업(Head-Up) 상태를 유지하는 것을 특징으로 하는 스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 관제탑 서버(150)는,상기 분석 제공 정보와 상기 비행정보를 이용하여 운항 상황 정보를 생성하는 처리부(320); 및상기 운항 상황 정보를 그래픽으로 보여주는 뷰정보를 생성하는 뷰생성부(330);를 포함하는 것을 특징으로 하는스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 관제탑 서버(150)는,상기 운항 상황 정보에 따라 상기 항공기(110) 및 상기 이동 객체에 알림 정보를 전송하도록 상기 관제사의 모션 또는 음성을 입력 명령 정보로 변환하는 입력부(310);를 포함하는 것을 특징으로 하는 스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 분석 제공 정보는 상기 이동 객체의 움직임 및 위치를 포함하며,상기 뷰정보(351,352,353)는 개별 카메라 영상을 합성한 관제권역 전체의 단일뷰를 출력하는 파노라마뷰(351),시야차폐 주기장에 대한 모니터링을 가능하게 하는 뷰를 출력하는 주기장뷰(352), 및 3D 가상공간을 이용하여게이트 전체 항공기 표출 상태를 보여주는 뷰를 출력하는 어라운드뷰(353)를 포함하는 것을 특징으로 하는 스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 처리부(320)는 상기 이동 객체의 움직임 및 위치를 상기 운항 정보에 결합하여 항공기(110)의 상기 운항공개특허 10-2023-0036427-3-상황 정보를 예측하는 것을 특징으로 하는 스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기 처리부(320)는 상기 항공기(110)의 이동 경로상에 있는 물리적인 장애물로 인한 시야차폐를 극복하기 위해디지털 트윈 기술을 활용하여 3D 모델링 오브젝트(710)를 생성하는 것을 특징으로 하는 스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 3D 모델링 오브젝트(710)는 3D 지도상에 모델링된 상기 이동 객체의 외곽선을 결합한 것을 특징으로 하는스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 2 항에 있어서,상기 처리부(320)는 상기 항공기(110)의 현재 진행 경로와 미리 예정된 이동 경로가 서로 상이하면 경고 정보를생성하며, 상기 미리 예정된 이동 경로는 인공지능 분석 엔진을 이용하여 산출되고, 상기 현재 진행 경로는 상기 센서계(120) 중 카메라를 통해 촬영된 영상의 분석을 통해 산출되는 것을 특징으로 하는 스마트 공항 관제시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 2 항에 있어서,상기 처리부(320)는 상기 센서계(120) 중 카메라를 이용하여 상기 항공기(110)의 착륙에서부터 촬영된 영상을분석하여 생성되는 분석 결과 정보와 다수의 상기 감시 장비를 이용하여 획득되는 상기 항공기(110)의 예정 경로를 분석하여 생성되는 예측 결과 정보가 서로 상이하면 경고 정보를 생성하며, 상기 분석 결과 정보는 상기항공기(110)의 항공사, 기종, 시간, 및 위치를 포함하며, 상기 예측 결과 정보는 상기 항공기(110)의 도착예정항공기, 위치추적, 및 확인가능 유도로 도착 예측 시각을 포함하는 것을 특징으로 하는 스마트 공항 관제 시스템."}
{"patent_id": "10-2021-0119269", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "(a) 센서계(120)가 계류장내 항공기를 포함하는 이동 객체를 센싱하여 센싱 정보를 생성하는 단계;(b) 관리 서버(140)가 상기 센싱 정보를 기반으로 상기 이동 객체를 분석하여 분석 제공 정보를 생성하고 다수의 감시 장비로부터 상기 항공기에 대한 비행정보를 획득하는 단계; 및 (c) 관제탑 서버(150)가 상기 분석 제공 정보와 상기 비행정보를 이용하여 뷰정보(351,352,353)를 생성하고, 상기 뷰정보(351,352,353)를 관제사에게 제공하는 단계;를 포함하되, 상기 뷰정보는 상기 관제탑의 관제석에서 보이는 외부 뷰보다 상부에 위치한 디스플레이를 통해전시됨으로써, 상기 관제사의 헤드업(Head-Up) 상태를 유지하는 것을 특징으로 하는 스마트 공항 관제 방법."}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "관제사의 상황 인지력을 극대화할 수 있도록 하는 스마트 공항 관제 시스템이 개시된다. 상기 스마트 공항 관제 시스템은, 계류장내 항공기를 포함하는 이동 객체를 센싱하여 센싱 정보를 생성하는 센서계, 상기 센싱 정보를 기반으로 상기 이동 객체를 분석하여 분석 제공 정보를 생성하고 다수의 감시 장비로부터 상기 항공기에 대한 비 행정보를 획득하는 관리 서버, 및 상기 분석 제공 정보와 상기 비행정보를 이용하여 뷰정보를 생성하고, 상기 뷰 정보를 관제사에게 제공하는 관제탑 서버를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 공항 관제 지원 기술에 관한 것으로서, 더 상세하게는 관제사의 전방 주시 및 상황 인지력을 극대화할 수 있는 스마트 공항 관제 시스템 및 방법에 대한 것이다."}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "항공기간의 충돌방지, 항공기와 장애물간의 충돌방지, 항공교통흐름의 촉진을 위해 관제탑(비행장관제업무), 접 근 관제소(접근관제업무) 및 지역 관제소(지역관제업무)에 의해 행해지는 항공기간의 분리, 레이더유도, 항공교 통 관제허가 발부 등의 항공교통관제업무가 수행되고 있다. 특히, 비행장 관제 업무중 계류장 구역내에서 이동하는 항공기에 제공되는 항공 교통관제 업무가 있다. 계류장 을 관리하기 위해 계류장 관제탑이 구성되며, 계류장 내에서 항공기의 엔진 시동 및 후방견인허가, 항공기 이동 허가, 주 관제탑에 관제권 이양, 제방빙 지원, 견인 통제 및 지원 등의 업무를 수행한다. 그런데, 공항의 지속적인 확장으로 관제사 1인당 평균 감시구역은 축구장 약 180개 크기로 전 지역의 모든 항공 기의 움직임을 실시간 감시하기에는 물리적인 어려움이 존재한다. 또한, 항공기간의 충돌, 항공기와 차량간의 충돌, 항공기의 유도로 오진입 및 관제지시 위반 등과 같은 비정상 상황 발생 시 이를 자동으로 알려주는 경보 시스템이 구축되어 있지 않아 관제사의 육안 관측 및 조종사의 보고 에만 의존하게 됨으로써 비정상 상황의 알림 시스템이 미비하다는 문제점이 있다. 또한, ICAO(International Civil Aviation Organization) 규정에 따라 항공기, 차량 및 인원과 공항 주변에서 비행 중인 항공기에 대하여 육안관측을 우선으로 감시하여야 하나 감시구역 전반에 걸쳐 건물 등에 의한 차폐구 역이 발생하며 물리적인 거리에 따른 육안관측의 한계가 명확하다는 단점이 있다. 또한, 관제사의 업무 수행 시 안개, 강우, 강설 및 미세먼지 등과 같은 여러 가지 기상현상으로 관제사의 육안 관측에 어려움 발생한다는 단점이 있다. 또한, 관제업무 수행에 필요한 다수의 데이터는 텍스트 또는 다양한 형태의 모양과 색상을 가지며, 이 데이터들 은 다수의 디스플레이에 2차 평면상에 탑다운뷰(Top-Down View)로 표출되며 관제사의 주시 방위와 차이가 있는 방위로 표출된다. 또한, 관제사의 관제탑 외부 시야는 3차원의 Bird's-Eye View로 시각적 정보를 수집하게 되며 이 두 View의 차 이로 관제사는 지속적인 방위 및 차원 인지 부조화(Orientational Difference와 Dimensional Difference)상황 하에서 관제업무를 수행해야 된다. 이는 관제사의 상황 인지력에 악영향을 미침과 동시에 관제사 워크로드 증가 로 이어지게 되며 결국 관제업무 효율에 큰 영향을 미친다는 점이다. 또한, 관제사의 관제업무 수행 시 비행 데이터 획득 및 항공기 이동 감시에 필요한 다양한 데이터는 평균 약 7 개 이상의 디스플레이를 통해 제공되며, 이를 조작하기 위해 유사한 수의 입력장치(마우스 및 키보드)를 사용해 야 한다. 따라서, 데이터 취득 및 조작 과정에서 장비의 설치 위치로 인해 헤드다운 타임(Head-Down Time) 발생 은 필연적이며 이는 관제사의 육안감시능력에 영향을 미침과 동시에 주의력 분산을 야기한다. 또한, 기존의 관제 시스템의 경우, 키보드, 마우스로 제어, 입력 가능하나 이는 관제사의 헤드다운(Head- Down)을 유발하여 상황인식 저해 및 다수의 제어장치로 인한 인적오류를 유발한다는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국등록특허번호 제10-2063158호(등록일자: 2019년12월31일)"}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 위에서 제시된 과제를 달성하기 위해, 관제사의 상황 인지력을 극대화할 수 있도록 하는 스마트 공항 관제 시스템 및 방법을 제공하는데 그 목적이 있다. 또한, 본 발명은 컴퓨터 비전 기술, 음성 인식 기술등을 활용한 비행정보의 획득을 통한 감시 및 비정상 상황 경고 알고리즘을 구축할 수 있는 스마트 공항 관제 시스템 및 방법을 제공하는데 다른 목적이 있다. 또한, 본 발명은 컴퓨터 비전(computer vision), 가상 현시 증강 기술로 차폐 지역의 시야를 확보할 수 있게 하 는 스마트 공항 관제 시스템 및 방법을 제공하는데 또 다른 목적이 있다. 또한, 본 발명은 딥러닝 기술을 활용하여 운항 상황을 예측할 수 있는 스마트 공항 관제 시스템 및 방법을 제공 하는데 또 다른 목적이 있다. 또한, 본 발명은 모션제어, 음성제어 방식을 적용하여 특정 모션과 음성만으로 주요 관제 기능의 입력, 수정 및 제어할 수 있는 스마트 공항 관제 시스템 및 방법을 제공하는데 또 다른 목적이 있다."}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 위에서 제시된 과제를 달성하기 위해, 관제사의 상황 인지력을 극대화할 수 있도록 하는 스마트 공항 관제 시스템을 제공한다. 상기 스마트 공항 관제 시스템은, 계류장내 항공기를 포함하는 이동 객체를 센싱하여 센싱 정보를 생성하는 센서계; 상기 센싱 정보를 기반으로 상기 이동 객체를 분석하여 분석 제공 정보를 생성하고 다수의 감시 장비로부터 상 기 항공기에 대한 비행정보를 획득하는 관리 서버; 및 상기 분석 제공 정보와 상기 비행정보를 이용하여 뷰정보를 생성하고, 상기 뷰정보를 관제사에게 제공하는 관제 탑 서버;를 포함하는 것을 특징으로 한다. 또한, 상기 관제탑 서버는, 상기 분석 제공 정보와 상기 비행정보를 이용하여 운항 상황 정보를 생성하는 처리 부; 및 상기 운항 상황 정보를 그래픽으로 보여주는 뷰정보를 생성하는 뷰생성부;를 포함하는 것을 특징으로 한 다. 또한, 상기 관제탑 서버는, 상기 운항 상황 정보에 따라 상기 항공기 및 상기 이동 객체에 알림 정보를 전송하 도록 상기 관제사의 모션 또는 음성을 입력 명령 정보로 변환하는 입력부;를 포함하는 것을 특징으로 한다. 또한, 상기 분석 제공 정보는 상기 이동 객체의 움직임 및 위치를 포함하는 것을 특징으로 한다. 또한, 상기 뷰정보는 개별 카메라 영상을 합성한 관제권역 전체의 단일뷰를 출력하는 파노라마뷰, 시야차폐 주 기장에 대한 모니터링을 가능하게 하는 뷰를 출력하는 주기장뷰, 및 3D 가상공간을 이용하여 게이트 전체 항공 기 표출 상태를 보여주는 뷰를 출력하는 어라운드뷰를 포함하는 것을 특징으로 한다. 또한, 상기 처리부는 상기 이동 객체의 움직임 및 위치를 상기 운항 정보에 결합하여 항공기의 상기 운항 상황 정보를 예측하는 것을 특징으로 한다. 또한, 상기 처리부는 상기 항공기의 이동 경로상에 있는 물리적인 장애물로 인한 시야차폐를 극복하기 위해 디 지털 트윈 기술을 활용하여 3D 모델링 오브젝트를 생성하는 것을 특징으로 한다. 또한, 상기 3D 모델링 오브젝트는 3D 지도상에 모델링된 상기 이동 객체의 외곽선을 결합한 것을 특징으로 한다. 또한, 상기 처리부는 상기 항공기의 현재 진행 경로와 미리 예정된 이동 경로가 서로 상이하면 경고 정보를 생 성하며, 상기 미리 예정된 이동 경로는 인공지능 분석 엔진을 이용하여 산출되고, 상기 현재 진행 경로는 상기 센서계 중 카메라를 통해 촬영된 영상의 분석을 통해 산출되는 것을 특징으로 한다. 이와 달리, 상기 처리부는 상기 센서계 중 카메라를 이용하여 상기 항공기의 착륙에서부터 촬영된 영상을 분석 하여 생성되는 분석 결과 정보와 다수의 상기 감시 장비를 이용하여 획득되는 상기 항공기의 예정 경로를 분석 하여 생성되는 예측 결과 정보가 서로 상이하면 경고 정보를 생성하며, 상기 분석 결과 정보는 상기 항공기의 항공사, 기종, 시간, 및 위치를 포함하며, 상기 예측 결과 정보는 상기 항공기의 도착예정 항공기, 위치추적, 및 확인가능 유도로 도착 예측 시각을 포함하는 것을 특징으로 한다. 다른 한편으로, 본 발명의 다른 일실시예는, (a) 센서계가 계류장내 항공기를 포함하는 이동 객체를 센싱하여 센싱 정보를 생성하는 단계; (b) 관리 서버가 상기 센싱 정보를 기반으로 상기 이동 객체를 분석하여 분석 제공 정보를 생성하고 다수의 감시 장비로부터 상기 항공기에 대한 비행정보를 획득하는 단계; 및 (c) 관제탑 서버가 상기 분석 제공 정보와 상기 비행정보를 이용하여 뷰정보를 생성하고, 상기 뷰정보를 관제사에게 제공하는 단계;를 포함하는 것을 특징으로 하는 스마트 공항 관제 방법을 제공한다. 뷰정보는 상기 관제탑의 관제석에서 보이는 외부 뷰보다 상부에 위치한 디스플레이를 통해 전시됨으로서, 상기 관제사의 헤드업(Head-Up) 상태를 유지할 수 있다."}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 다수의 디지털 카메라와 열화상 카메라에 의한 초고해상도 전방위 영상촬영 및 주기장별 개 별 디지털 카메라 및 열화상 카메라에 의한 영상 촬영으로 영상 수집하고, 해당 영상 데이터를 합성 기술 활용 해 파노라마 뷰(Panoramic View), 게이트 뷰(Gate View) 및 어라운드 뷰(Around View)로 가공하여 다수의 패널 로 구성된 울트라 와이드(Ultra Wide) 디스플레이를 관제탑 관제석 상단에 표출해 담당 관제구역 내 감시능력 강화로 상황 인지력의 극대화를 구현할 수 있다. 또한, 본 발명의 다른 효과로서는 영상 촬영으로 생성된 초고해상도 영상 데이터를 기반으로 컴퓨터비전 영상인 식 기술을 활용해 항공기를 포함한 다수의 이동물체 인식, 분석 및 추적하며 이를 기반으로 분석된 데이터를 다 양한 기존의 감시장비(ASR(Airport Surveillance Radar), ASDE(Airport Surface Detection Equipment), MLAT(Multilateration), ADS-B(Automatic Dependent Surveillance-Broadcast))에서 획득한 비행정보와 혼합 표 출하여 관제사에게 제공함으로써 정보 인지력 향상에 기여할 수 있다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과로서는 합성 가공된 Panoramic View, Gate View 및 Around View 영상을 컴퓨터비 전 영상인식 기술 기반으로 분석 후 다양한 알고리즘을 적용하여 경고 시스템을 구축해 관제사 담당 구역 내 비 정상상황 대응 능력 향상에 기여한다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과로서는 공항 건물 등과 같은 물리적인 장애물로 인한 LOS(Line of Sight) 시야 차 폐와 기상현상(안개, 강우 및 강설 등)으로 인한 시야 차폐를 AI(Computer Vision)기술을 활용한 대상 인식 및 분석과 AR(Augmented Reality)기술 및 디지털트윈 기술을 활용한 가상 오브젝트 생성(윤곽선 또는 오브젝트 3D 모델링 등)으로 관제사 시야차폐 극복 할 수 있다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과로서는 조종사-관제사간 음성 교신을 실시간으로 분석하여 비정상상황 감지, 조종 사의 복명복창 일치 여부 판별, 관제지시와 등화 점등 검증, 항공기 이동상황 검증 및 통합 경고 시스템을 구축 하여 운항안전 확보에 기여할 수 있다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과로서는 합성 가공된 게이트뷰(Gate View) 영상을 컴퓨터비전 영상인식 기술 기반 으로 게이트내의 다양한 물체(항공기, 견인트럭, 터그카, 달리, ULD(Unit Load Device), GPU(Ground Power Unit), 화물, 급수트럭, 오수트럭, 케이터링트럭, 쓰레기차, 카고로더, 사다리, 스텝카 등)의 움직임 및 존재 유무를 해당 항공편 운항 데이터와 결합하여 분석 및 학습함으로서 운항 상황을 예측 하며 이를 A-CDM((Airport Collaborative Decision Making)과 연계하여 정시성 달성에 기여할 수 있다는 점을 들 수 있다. 또한, 본 발명의 또 다른 효과로서는 기존의 제어장치와 더불어 영상인식기술을 활용한 모션제어, 음성제어 방 식을 적용하여 관제사가 Head-up을 유지한 상태에서 특정 모션과 음성으로 주요 관제시스템의 기능을 입력, 수 정, 제어하는 방식으로 개선한다는 점을 들 수 있다."}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속"}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발 명은 청구항의 범주에 의해 정의될 뿐이다. 도면에서 표시된 구성요소의 크기 및 상대적인 크기는 설명의 명료 성을 위해 과장된 것일 수 있다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭하며, “및/또는”은 언급된 아이템들의 각각 및 하나 이상의 모든 조합을 포함한다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 “포함한다 ” 및/또는 “구성된다”는 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 구성요소, 단계, 동 작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 비록 제1, 제2 등의 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 대해 제한 되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소와 구별하기 위하여 사용되는 것이다. 따라서, 이하 에서 언급되는 제 1 구성요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않은 한 이상적으로 또는 과도하게 해 석되지 않는다. 이하 첨부된 도면을 참조하여 본 발명의 일실시예에 따른 스마트 공항 관제 시스템 및 방법을 상세하게 설명하 기로 한다. 도 1은 본 발명의 일실시예에 따른 스마트 공항 관제 시스템의 구성 블럭도이다. 도 1을 참조하면, 스마트 공항 관제 시스템은 센서계. 통신망, 관리 서버, 관제탑 서버 등을 포함하여 구성될 수 있다. 센서계는 제 1 내지 제 n 센서(120-1 내지 120-n)로 구성된다. 제1 내지 제 n 센서(120-1 내지 120-n)는 항공기뿐만 아니라 게이트 내의 다양한 물체(항공기, 견인트럭, 터그카, 달리, ULD(Unit Load Device), GPU(Ground Power Unit), 화물, 급수트럭, 오수트럭, 케이터링트럭, 쓰레기차, 카고로더, 사다리, 스텝카 등)의 움직임 및/또는 존재 유무, 조종사의 복명복창 등을 감지하는 기능을 수행한다. 이를 위해 제 1 내지 제 n 센서(120-1 내지 120-n)는 디지털 카메라, CCTV(Closed Circuit Television), 음성 센서, 적외선 카메라, 열화상 센서, 위치 센서 등이 될 수 있다. CCTV(Closed Circuit Television)는 고정형 CCTV, 열화상 CCTV, 하이브리드 PTZ(Pan-Tilt-Zoom) 카메라등이 될 수 있다. 고정형 CCTV는 관제사 시야와 동 일한 View 구성, 360° 파노라마 영상 구성, AR 통한 관제정보 제공, 주기장 감시 영상 제공 등을 위해 사용될 수 있다. 열화상 CCTV는 저시정 상황 시 시야 재현, 360° 파노라마 영상 구성, AR 통한 관제정보 제공 등을 위 해 사용될 수 있다. 하이브리드 PTZ(Pan-Tilt-Zoom) 카메라는 대상 추적 영상 제공, 실화상 및 열화상 전환을 위해 사용될 수 있다. 물론, 제 1 내지 제 n 센서(120-1 내지 120-n)는 일부 블럭으로 구성될 수도 있다. 통신망은 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 공중교환 전화망(PSTN), 공중교환 데이터망(PSDN), 종합정보통신망(ISDN: Integrated Services Digital Networks), 광대역 종합 정보 통신망(BISDN: Broadband ISDN), 근거리 통신망(LAN: Local Area Network), 대도시 지역망(MAN: Metropolitan Area Network), 광역 통신망(WLAN: Wide LAN) 등이 될 수 있다, 그러나, 본 발명은 이에 한정되지는 않으며, 무선 통신망인 CDMA(Code Division Multiple Access), WCDMA(Wideband Code Division Multiple Access), Wibro(Wireless Broadband), WiFi(Wireless Fidelity), HSDPA(High Speed Downlink Packet Access) 망, 블루투쓰(bluetooth),NFC(Near Field Communication) 네트워 크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 될 수 있다. 또는, 이들 유선 통신망 및 무선 통신망의 조합일 수 있다. 관리 서버는 통신망에 연결되는 센서계, 단말, 서버들로부터 음성 정보, 영상 정보, 기상 정보, 운항 정보, 항공기 정보 등을 수집하여 데이터베이스에 저장하고, 다수의 이동객체 인식, 분석 및 추적하 며 이를 기반으로 데이터를 분석하여 분석 제공 정보를 생성하는 기능을 수행한다. 여기서, 이동 객체는 물체뿐만 아니라 사람을 포함할 수 있는 개념이다. 또한, 운항 정보, 항공기 정보 등은 항 공기 자체의 정보, 항공기의 동작, 이동 경로 등을 나타내는 비행 정보에 포함될 수 있다. 특히, 관리 서버는 기존의 감시장비(ASR(Airport Surveillance Radar), ASDE(Airport Surface Detection Equipment), MLAT(multilateration), ADS-B(Automatic Dependent Surveillance-Broadcast))에서 비행 정보를 획득할 수도 있다. 물론, 도 1에서는 관리 서버를 관제탑 서버와 분리하여 구성하였으나, 관리 서버를 관제탑 서버 에 병합하여 구성하는 것도 가능하다. 관제탑 서버는 계류장(Apron)내에서 항공기의 엔진 시동, 후방견인 허가, 항공기 이동허가, 주 관제 탑에 관제권 이양, 제방빙 지원, 견인 통제 및 지원 등의 업무를 수행하기 위한 뷰정보를 제공한다. 따라서, 관 제탑 서버는 각 계류장마다 설치될 수도 있고, 하나의 관제탑 서버로 여러개의 계류장을 관리할 수도 있다. 관제탑 서버가 서버 이중화 구조로 이루어질 수 있다. 서버 이중화는 물리적 또는 논리적인 서버(또 는 LAPR) 등을 구성하여 하나의 서비스에 장애가 발생하는 경우 다른 서버를 통해 서비스를 지속가능하게 한다. 계류장은 공항내에서 여객 승하기, 화물, 우편물의 적재 및 적하, 급유, 주기, 제방빙(항공기 표면의 눈, 얼음 및 서리를 제거하고 생성을 방지하는 작업) 또는 정비 등의 목적으로 항공기가 이용할 수 있도록 설정된 구역을 말한다. 후방견인은 출발 항공기를 견인 차량으로 뒤로 밀어 유도로 상에 위치시키는 작업을 말한다. 관제탑 서버는 관리 서버로부터 전송되는 분석 제공 정보와 비행정보를 이용하여 생성된 운항 상황 정보에 기반한 뷰정보를 관제사에게 제공한다. 운항 상황 정보는 분석 제공 정보와 비행정보를 병합하여 항공기 의 위치, 이동 경로, 상태 등을 보여준다. 이러한 운항 상황 정보를 합성 기술 활용해 파노라마뷰(Panoramic View), 게이트뷰(Gate View) 및 어라운드뷰 (Around View)로 가공하여 다수의 패널로 구성된 울트라 와이드(Ultra Wide) 디스플레이에 출력한다. 따라서, 관제사로 하여금 관제업무수행시 담당 관제구역내 감시 능력의 강화로 상황 인지력을 극대화시킨다. 도 2는 도 1에 도시된 관리 서버의 세부 구성도이다. 도 2를 참조하면, 관리 서버는 통신부, 수 집부, 분석부, 분석 제공 정보 생성부, 출력부 등을 포함하여 구성될 수 있다. 통신부 는 통신망과 통신 연결을 수행하는 기능을 수행한다. 이를 위해, 통신부는 랜카드, 모뎀 등을 포함하여 구성될 수 있다. 수집부는 통신부를 통해 통신망과 연결되는 단말, 서버들로부터 데이터(즉 정보)를 수집하는 기 능을 수행한다. 수집되는 데이터로는 음성 정보, 영상 정보, 기상 정보, 운항 정보, 항공기 정보, 비행정보 등 이 될 수 있으며, 수집부는 이러한 수집 데이터를 데이터베이스에 저장한다. 데이터베이스는 관리 서버 자체내에 구성될 수도 있고, 별도의 데이터베이스 서버로 구성될 수도 있 다. 수집 데이터는 공항에서 생성, 수집되는 항공정보와 상호 연계된다. 이들 데이터로는 영상자료, 항적 데이 터, 비행 및 공항 자원 데이터, AFL(AirField Lighting) 데이터, 기상 데이터, 음성 통신 데이터 등이 될 수 있 다. - 영상자료 : 다수의 초고해상도 360도 광학 이미지 합성, 다기능 고배율 카메라 사용 - 항적 데이터 : 계류장 관제 플랫폼, ASDE(Airport Surface Detection Equipment), ADS-B(Automatic Dependent Surveillance-Broadcast)), MLAT(multilateration), 레이저 거리측정기(LASER RANGE FINDER), ASDE-EFS(Electronic Flight Strip), ASDE-EFS는 항공기 운항 관제정보, 항공기 출발 도착 정보, 특정지점 항 공기 시간정보 등을 포함한다. - 비행 및 공항자원 데이터 : 계류장 관제 플랫폼, IIS(Integrated Information System), FDT(Flight Data Terminal), 항공고시보(NOTAM:Notice to Airman), ATFM(Air Traffic Flow Management and Airspace Management), IIS는 일일운항편, 출발/도착 램프 출입시간, 출발 및 도착편 운항, A-CDM(Airport Collaborative Decision Making) 정보, 활주로 마찰계수, 탑승구 ON/OFF, 이동지역 차량, 이동지역 작업계획, 운항 스케쥴 등을 들 수 있다. - 항공등화(AFL: AirField Lighting) 데이터 : A-SMGCS(Advanced-Surface Movement Guidance and Control System) - 기상 데이터 : 공항 기상 관측 장비(Aerodrome Meteorological Observation System, AMOS), 저고도 윈드시어 경보시스템(Low Level Windshear Alert System, LLWAS, 공항기상 레이더(Terminal Doppler Weather Radar, TDWR) - 음성통신 데이터 : VCCS(Voice Communication Control System) 분석부는 수집된 수집 데이터를 분석하여 이동 물체의 종류, 움직임, 위치 등의 정보를 추출한다. 분석부 는 실시간으로 수집부로부터 수집 데이터를 전송받을 수 있으며, 데이터베이스로부터 해당 데이 터를 검색하여 획득할 수도 있다. 분석 제공 정보 생성부는 분석부에 생성된 분석 정보를 바탕으로 관제탑 서버에 제공할 분석 제 공 정보를 생성한다. 즉, 이동 객체의 움직임 및 위치를 포함하는 분석 제공 정보를 생성한다. 출력부는 처리중인 정보를 표시하거나 설정 메뉴, 입력 메뉴 등을 나타내는 화면을 표시하는 기능을 수행 한다. 이를 위해, 출력부는 디스플레이, 사운드 시스템 등을 포함하여 구성될 수 있다. 디스플레이는 LCD(Liquid Crystal Display), LED(Light Emitting Diode) 디스플레이, PDP(Plasma Display Panel), OLED(Organic LED) 디스플레이, 터치 스크린, CRT(Cathode Ray Tube), 플렉시블 디스플레이, 마이크로 LED, 미 니 LED 등이 될 수 있다. 이때, 터치 스크린의 경우, 입력 수단으로도 사용될 수 있다. 도 2에 도시된 수집부, 분석부, 분석 제공 정보 생성부는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미 하며, 이는 소프트웨어 및/또는 하드웨어로 구현될 수 있다. 하드웨어 구현에 있어, 상술한 기능을 수행하기 위 해 디자인된 ASIC(application specific integrated circuit), DSP(digital signal processing), PLD(programmable logic device), FPGA(field programmable gate array), 프로세서, 마이크로프로세서, 다른 전자 유닛 또는 이들의 조합으로 구현될 수 있다. 소프트웨어 구현에 있어, 소프트웨어 구성 컴포넌트(요소), 객체 지향 소프트웨어 구성 컴포넌트, 클래스 구성 컴포넌트 및 작업 구성 컴포넌트, 프로세스, 기능, 속성, 절 차, 서브 루틴, 프로그램 코드의 세그먼트, 드라이버, 펌웨어, 마이크로 코드, 데이터, 데이터베이스, 데이터 구조, 테이블, 배열 및 변수를 포함할 수 있다. 소프트웨어, 데이터 등은 메모리에 저장될 수 있고, 프로세서에 의해 실행된다. 메모리나 프로세서는 당업자에게 잘 알려진 다양한 수단을 채용할 수 있다. 도 3은 도 1에 도시된 관제탑 서버의 세부 구성도이다. 도 3을 참조하면, 관제탑 서버는, 입력부 , 처리부, 뷰생성부, 저장부, 통신부 등을 포함하여 구성될 수 있다. 입력부는 관제사의 명령을 입력하는 기능을 수행한다. 따라서 입력부는 마우스, 키보드, 마이크, 모 션 센서 등이 될 수 있다. 따라서, 관제사는 마우스, 키보드 등을 이용하지 않고, 음성, 모션 등을 통해서도 명 령을 입력할 수 있다. 일반적으로, 관제사는 헤드 다운, 헤드 업 등으로 모니터를 확인하고 마우스 클릭 및/또 는 키보드 조작을 통해 결과를 확인하는 방식이었다. 이 경우, 관제사의 주시 방위와 차이가 있는 방위로 표출 됨에따라 관제사는 지속적인 방위 및 차원 인지 부조화(Orientational Difference와 Dimensional Difference) 상황 하에서 관제업무를 수행해야 한다. 이는 관제사의 상황 인지력에 악영향을 미침과 동시에 관제사 워크로드 증가로 이어지게 되며 결국 관제업무 효율에 큰 영향을 미친다. 본 발명의 일실시예에서는 마우스, 키보드 등을 사용하지 않고 관제사의 모션(제스처를 포함함), 음성 등을 통 해 명령을 입력할 수 있다. 따라서, 관제사가 Head-up을 유지한 상태에서 특정 모션과 음성으로 주요 관제시스 템의 기능을 입력, 수정, 제어할 수 있다. 처리부는 통신부를 통해 전달된 분석 제공 정보와 비행정보를 이용하여 운항 상황을 예측하는 기능을 수행한다. 뷰생성부는 운항 상황을 그래픽(영상을 포함할 수 있음)으로 보여주는 뷰정보를 생성하는 기능을 수행한다. 뷰정보는 파노라마뷰, 주기장뷰, 어라운드뷰, 추적용 CCTV뷰 등을 포함하여 구 성될 수 있다. 뷰정보는 실제 촬영된 영상, 가상 영상 등을 이용한 가상 현실(VR: Virtual Reality), 증강 현실 (AR: augmented reality), 가상현실과 증강현실을 혼합한 혼합 현실(MR: Mixed Reality)로 표현될 수 있다. 실 제 촬영된 영상은 FHD(Full High Definition) 이상의 해상도를 보유한 다수의 실화상 카메라 및 열화상 카메라 를 사용해 획득된 초고해상도 전방위 비디오 기반 감시(Video-Based Surveillance) 영상이될 수 있다. 이를 이용하여 다음과 같이 표출될 수 있다. - 전방위 합성 영상 및 다양한 영상에 각종 데이터 오버레이 형식으로 표출 - 항공기를 포함하여 움직이는 이동 객체의 탐지 및 트래킹 - 실제 탐지 및 트래킹 데이터와 각종 데이터 연동해 실시간 표출 - 기상 데이터(풍향 및 풍속, 활주로 가시거리(RVR: Runway Visual Range), 윈드시어, 마이크로버스트 경고 등) 표출 - 시야제한 상황 발생시 열영상 활용 및 가상항적 표출 - 게이트 정보 및 A-CDM((Airport Collaborative Decision Making) (TTOT(Target Take Off Time), TSAT(Target Start Up Approval Time)) 관련 정보 표출 - 관제용 주파수 설정값 및 송출여부 표출 - 개별 라우팅 정보(INDIVIDUAL ROUTING)를 포함하는 각종 등화 표출 - CPDLC(Controller Pilot Data Link Communications) 데이터 표출 - 각 게이트별 CCTV 영상 표출 또한, 뷰정보는 고해상도 CCTV에서 획득한 영상과 기존 관제 시스템을 통한 다양한 항공 정보를 AI(컴퓨터비 전), AR 및 영상 합성 기술을 적용하여 통합 표출한다. 관제사뷰인 파노라마뷰는 개별 카메라(즉 CCTV) 영 상을 합성한 관제권역 전체의 단일뷰이며, 증강현실을 이용하여 가독성을 높일 수 있다. 주기장뷰는 시야 차폐 주기장에 대한 모니터링을 가능하게 하는 뷰이며, 항공기 상황별 필요 정보를 제공할 수 있으며, AI(Artificial Intelligence) 기술을 적용한 푸시백 상황 모니터링 및 알림이 가능하다. 어라운드뷰인 계류장뷰는 3D 가상공간을 이용하여 게이트 전체 항공기 표출 상태를 보여주는 뷰이며, 항공 기의 이동경로를 표출하고, 게이트별 스케쥴 및 상태 정보를 보여줄 수 있다. 추적용 CCTV뷰는 입항중인 항공기를 자동으로 추적하여 보여주는 뷰이며, 상황인지 대상에 대한 영상 자동 추적을 보여주고, 관제사의 필요에 의한 계류장 영상을 보여줄 수 있다. 저장부는 분석 제공 정보와 비행정보를 이용하여 운항 상황을 예측하는 알고리즘을 갖는 프로그램, 소프트 웨어, 데이터 등을 저장하는 기능을 수행한다. 저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD(Secure Digital) 또는 XD(eXtreme Digital) 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬 (Read Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read Only Memory), PROM(Programmable Read Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매 체를 포함할 수 있다. 또한, 인터넷(internet)상에서 저장 기능을 수행하는 웹 스토리지(web storage), 클라우 드 서버와 관련되어 동작할 수도 있다. 도 3을 계속 참조하면, 통신부는 통신망과 통신 연결을 수행하는 기능을 수행한다. 이를 위해, 통신 부는 랜카드, 모뎀 등을 포함하여 구성될 수 있다. 도 4는 도 3에 도시된 처리부의 세부 구성도이다. 도 4를 참조하면, 처리부는 데이터 인식 모듈 , 데이터 분석 모듈, 운항 상황 정보 생성 모듈 등을 포함하여 구성될 수 있다.데이터 인식 모듈은 관리 서버로부터 전송된 데이터에 대해(분석 제공 정보, 비행정보 등을 들 수 있 음)에 대해 음성 인식, 영상 인식, 상황 인지 등을 수행한다. 음성 인식으로는 VCCS 및 TRS 음성정보의 TEXT 정 보 전환, 호출부호(Callsign) 식별을 통한 통신대상 식별, 관제지시와 복명복창의 일치여부 판독이 될 수 있다. 호출부호(Callsign)는 항공기와 관제소간에 교신을 할 때 그 항공기의 소속 항공사와 편명을 명확하게 알리기 위한 호출부호이다. 부연하면, 관제통신서버(VCCS)에서 실시간 교신 내용을 수집하여 잡음을 제거하고, 특징을 추출하고, 추출된 특징의 패턴을 비교하여 텍스트화한다. 또한, 관제 지시에 대한 구문을 분석한다. 복명복창의 일치여부는 관제사와 조종사간 리드백을 통해 이루어지며 다음과 같다. 표 1"}
{"patent_id": "10-2021-0119269", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "음성 인식의 경우, 다음과 같은 절차가 수행된다. - 관제사 개인별 음성인식 및 식별 후 HMI(Human Machine Interface) 자동 로그인/아웃 - 관제용어 음성인식 후 각종 항공기 정보 및 기타 운항정보 제공 - 관제용어 음성인식의 경우 항공교통관제 용어와 절차를 분석 및 파악하여 텍스트로 변환작업을 거치고, 관제 사와 조종사간의 교신 음성 내용을 분석 및 일치여부 확인 - 관제 교신 중 복명복창(리드백(Read Back)) 절차를 거쳐 인식된 항공기 정보를 토대로 현재 교신 중인 항공기 정보를 AR 모니터에서 표출 가능 - AR 내에서 해당 3D 모델링 된 항공기 하단에 항공기 정보 표출 영상 인식으로는 수신되는 영상에서 확인 가능한 항공기 및 차량에 대한 정보 식별, 계류장내 비정상 상황에 대 한 인지 등이 될 수 있다. 상황 인지로는 충돌예측 인지 및 알림, 비정상 상황 인지 및 알림, 관제지시 불이행 인지 및 알림 등이 될 수 있다. 모션 인식은 손관절(Hand Tracking)을 통해 이루어질 수 있다. 즉, 주먹, 손가락 개수, 움직임이 될 수 있다. 따라서, 미리 정해진 손 모양으로 명령어를 전달한다. 예를 들면, 주먹을 쥐면 화면 이동 중단이 수행되고, 손 가락 방향(검지)에 따라 AR 위치를 이동시킨다. 손바닥을 펴면 화면을 확대하고 모으면 축소된다. 데이터 분석 모듈은 데이터 인식 모듈에 의해 식별된 데이터를 이용하여 분석을 수행한다. 부연하면, 분석을 통해, 운항 상황 정보를 생성한다. 이 경우, 지도맵 정보와 운항 상황 정보를 합성한다. 또한, 데이터 분석 모듈은 조종사-관제사간 음성 교신을 실시간으로 분석하여 비정상 상황 감지, 조종사의 복명복창 일치 여부 판별, 관제지시와 등화 점등 검증, 및 항공기 이동상황 검증 등을 수행한다. 또한, 데이터 분석 모듈은 공항 건물 등과 같은 물리적인 장애물로 인한 LoS(Line of Sight) 시야 차폐, 기상현상(안개, 강우 및 강설 등)으로 인한 시야 차폐를 AI(Computer Vision)기술을 활용한 대상 인식 및 분석, AR(Augmented Reality)기술 및 디지털 트윈 기술을 활용한 가상 오브젝트(윤곽선 또는 오브젝트 3D 모델링 등) 를 생성한다. 따라서, 관제사 시야차폐를 극복할 수 있다. 디지털 트윈 기술은 컴퓨터에 현실속 사물의 쌍둥이를 만들고, 현실에서 발생할 수 있는 상황을 컴퓨터로 시뮬 레이션함으로써 결과를 미리 예측하는 기술이다. 또한, 데이터 분석 모듈은 합성 가공된 Gate View 영상을 컴퓨터비전 영상인식 기술 기반으로 게이트 내의 다양한 물체(항공기, 견인트럭, 터그카, 달리, ULD, GPU. 화물, 급수트럭, 오수트럭, 케이터링트럭, 쓰레기차, 카고로더, 사다리, 스텝카 등)의 움직임 및 존재 유무를 해당 항공편 운항 데이터와 결합하여 분석 및 학습함으 로써 운항 상황을 예측하며 이를 A-CDM과 연계한다. 학습은 일반적으로 딥러닝 기술을 이용하나, 이에 한정되는 것은 아니고 머신 러닝도 사용될 수 있다.운항 상황 정보 생성 모듈은 데이터 분석 모듈에 의해 생성된 데이터를 이용하여 운항 상황 정보를 생성하는 기능을 수행한다. 부연하면, 계류장 관제사의 시야와 각종 시스템 데이터 간 차원 차이로 발생하는 인 지 부조화, 다수의 독립된 장비와 개별 입력 장비조작에 따른 헤드다운(Head-Down)에 기인한 인적오류, 공항 내 터미널 등 물리적인 구조물에 의한 시야차폐, 기상(안개, 강우, 강설)현상으로 인한 시야 제한 상황등을 극복하 기 위해 공항 내의 주요 관제 시스템과 운항 정보 시스템의 정보를 통합한다. 통합된 정보는 AI, AR 기반 컴퓨 터비전 영상인식 및 음성인식 기술을 융합하여 계류장관제사의 전면 시야에 다중화면으로 구성된 텔레스코픽 디 스플레이에 표시된다. 따라서, 실시간 통합 정보화면 제공, 각종 알림, 경고 시스템 도입, 비접촉(Touch-less) 제어 방식 적용, 단순 ·직관적인 인터페이스등이 적용될 수 있다. 도 4에 도시된 데이터 인식 모듈, 데이터 분석 모듈, 운항 상황 정보 생성 모듈은 적어도 하나 의 기능이나 동작을 처리하는 단위를 의미하며, 이는 소프트웨어 및/또는 하드웨어로 구현될 수 있다. 하드웨어 구현에 있어, 상술한 기능을 수행하기 위해 디자인된 ASIC(application specific integrated circuit), DSP(digital signal processing), PLD(programmable logic device), FPGA(field programmable gate array), 프로세서, 마이크로프로세서, 다른 전자 유닛 또는 이들의 조합으로 구현될 수 있다. 소프트웨어 구현에 있어, 소프트웨어 구성 컴포넌트(요소), 객체 지향 소프트웨어 구성 컴포넌트, 클래스 구성 컴포넌트 및 작업 구성 컴 포넌트, 프로세스, 기능, 속성, 절차, 서브 루틴, 프로그램 코드의 세그먼트, 드라이버, 펌웨어, 마이크로 코드, 데이터, 데이터베이스, 데이터 구조, 테이블, 배열 및 변수를 포함할 수 있다. 소프트웨어, 데이터 등은 메모리에 저장될 수 있고, 프로세서에 의해 실행된다. 메모리나 프로세서는 당업자에게 잘 알려진 다양한 수단 을 채용할 수 있다. 도 5는 본 발명의 일실시예에 따른 경로가 상이할 경우, 알림 정보를 제공하는 과정을 보여주는 흐름도이다. 일 반적으로 항공기와 지상 이동 물체의 근접 조우는 주로 기동지역과 이동지역의 경계인 관제 이양 지점에서 주로 발생한다. 활주로 착륙 후 유도로로 개방하여 계류장 지역에 입항하는 항공기를 여러 항적 데이터와 영상 데이터를 합성하 여 인식 후 해당 항공기의 이동 예정 경로를 A-SMGCS(Advance-Surface Movement Guidance and Control System) 개별등화 데이터와 연동하여 추정 가능하다. 따라서, 관제탑 서버는 경로 데이터베이스로부터 호출부호(CallSign) 및 게이트 번호를 확인하여 항 공기가 사전 정의된 이동 경로로 이동하도록 안내한다(단계 S510,S580). 부연하면, 화면에 AR 등으로 현재 항공기의 이동 진행 영상이 출력된다. 이후, 입항 항공기의 관제 이양 지점 통과가 예상되는 경우 해당 관제 이양 지점에 존재하는 GSE(Aircraft(Ground Support Equipment)도로의 이동물체를 사전에 지속 추적 및 식별하여, 항공기가 관 제통신으로 식별된 이동경로로 이동하도록 확인한다(단계 S520,S530). GSE 도로는 공항과 항공사 운영을 지원하 는 활동을 수행하기 위하여 계류장과 항공기에 출입하도록 설치된 도로이다. 이후, 입항 항공기가 예정된 경로를 이탈하는지를 확인한다(단계 S540,S550). 부연하면, 센서계를 통한 센 싱 데이터를 분석하여 항공기의 현재 이동 경로와 미리 예정된 이동 경로를 비교하여 이탈여부를 확인한다. 미리 예정된 이동 경로는 AI 분석 엔진을 이용하여 산출된다. 물론, 현재 이동 경로는 센서계 중 CCTV 영상 분석을 통하여 산출될 수 있다. 판단 결과, 단계 S550에서, 항공기의 현재 이동 경로와 미리 예정된 이동 경로가 서로 상이하면 경고 정보 (Notification)를 생성하여 화면에 표시한다(단계 S570). 부연하면, 항공기가 이동 경로를 이탈하면, 관제 탑 서버는 관제사가 확인할 수 있도록 경고 정보를 화면에 표시할 수 있다. 한편, 입항 항공기의 관제 이양 지점 통과 근접 시점에 항공기와 근접하는 물체가 발생하는 경우 이를 인식하여 근접조우가 예상될 경우에 화면에 이를 경고로 표출하는 것도 가능하다. 또한, 항공기와 이동물체의 근접조우 경고 발생 시 필요한 경우 팬틸트줌 카메라의 동작 지시 명령으로 해당 위치를 사전에 설정된 Pan/Tilt/Zoom 설 정 값으로 변경하여 즉각적인 확인 및 항공기와 근접조우 이동물체의 근접상황을 기록 및 보관할 수도 있다. 근 접조우 해제 시 관제사에게 이를 알려주어 신속한 항공기의 정상운항을 위한 정보 제공할 수도 있다. 또한, 공항 이동지역(Airside)은 공사로 인한 항공기의 이동이 제한되는 금지구역 및 항공기 기종 또는 다양한 운항 제한 상황으로 인해 이동이 제한되는 구역이 존재할 수 있다. 이를 항적 데이터와 영상데이터를 혼합하여다양한 기법으로 화면에 표출하며 해당 영상 분석을 통해 제한구역을 침범하는 물체에 대한 감시 및 경고 기능 을 구성할 수 있다. 공항은 운영 상황, 점검 및 공사 상황에 따라 활주로 또는 유도로 폐쇄 및 금지구역 설정 상황이 빈번히 발생한 다. 이런 금지구역에 항공기 등이 실수로 진입하게 되는 경우 대형사고로 발전 가능하며 이는 인명손실과 재산 피해 및 공항운영에 큰 차질을 일으킬 수 있으므로 영상인식 기술을 활용하여 이를 예방하는 기능이 중요한 역 할을 수행할 수 있다. 금지구역은 실화상으로 촬영된 영상에 좌표(WGS-84)체계로 구성된 색상 및 두께 조정이 가능한 외곽선과 투명도 와 색상 조절 또는 채움(Hatching)이 가능한 다각형으로 표출할 수 있다. 해당 금지구역은 관제사의 인지력 향 상을 위해 다각형 구성 요소의 세부 항목 조절 기능을 포함하며 접근 감지를 위한 외부 버퍼존 설정 기능을 포 함할 수 있다. 항공기의 해당 금지구역 근접 예상 시 관제화면 상에 경고 메시지 및 이미지를 생성해 관제사에 게 인지를 시켜주어 즉각적인 대처가 가능하게 지원할 수 있다. 도 6은 도 5의 증강 현실에 따른 항공기의 이동 경로 및 목적지 게이트를 표시하는 예이다. 도 6을 참조하 면, 단계 S580에서 화면상에 목적지 게이트 및 이동 경로가 표시된다. 도 7은 본 발명의 일실시예에 따른 시각적 제한을 보완하기 위해 항공기 및 이동물체의 항적 데이터를 연동하여 3D 모델링 오브젝트를 생성하여 표출하는 개념도이다. 도 7을 참조하면, 3D 지도에 이동 객체의 외곽선을 결합 하여 생성된 3D 모델링 오브젝트, 위치, 운항 정보, ASDE등의 센싱 정보를 연동하여 항공기의 운항 상황 정보가 산출된다. 고해상도 계류장지역 고해상도-지도(HD-Map) 데이터를 가공 혼합, AR형식의 항공기 외곽선 표출, 항적 데이터 혼합 및 개별 영상 오버레이 기법 표출, 실화상/열영상 선택 표출 등을 통해 계류장 관제사의 시야차폐 극복과 저시정 환경 항공기 식별 능력 및 상황 인지력을 향상시킨다. 또한, 실시간 표출 영상에서 차폐지역은 HD-Map 데이터 혼합 표출로 재구성할 수 있다. 필요하면 항공기 및 이 동 물체의 항적 데이터를 연동하여 3D 모델링 오브젝트로 생성해 표출한다. 또한, 기존 실시간 영상에서 차폐지역은 AR 기술을 적용하여 건물을 투영하여 차폐지역에 가려진 실제상황을 현 시하도록 구현하므로 3D 모델링은 일부 적용한다. 또한, 저시정시, 일반 시각 및 카메라가 감지하기 어려운 상황을 열화상 카메라를 통해 세밀한 온도의 차이를 이용하여 영상을 표현함으로써 저시정에 따른 여러 가지 시각적인 제한사항을 극복하고 상황에 적합한 영상을 표출할 수 있다. 도 8은 본 발명의 일실시예에 따른 주기장 뷰 개념도이다. AR기술로 항공기 윤곽선, 건물 단면, 유도로, 타겟(Target) 정보를 표시하고, 영상 오버레이 기법으로 차폐지역의 주기장 영상 혹은 저시정 열화상 영상 표출 하여 전체 계류장에 대한 시각적인 모니터링을 개선한다. 관제탑 내부벽면의 상단에 관제사 뷰(파노라마 뷰)를 다수의 디스플레이를 연결하여 합성 영상을 표출한다. 기본 전체 화면에 항공기 위치정보(ASDE, MLAT)와 항공기 운항스케줄 정보(IIS, Flight Plan)를 통합하여 실제 항공기 영상에 각 항공기별 필요정보(편명, 기종, 활주로, 주기장 등)를 사용자의 사전 선택에 따라 AR기술로 데이터 블록 형태로 표출한다. 화면 상단 좌측은 무선 음성 교신 시스템(VCCS) 운영현황, 항공기 출발, 도착, 소산 견인 항공기 운항스케줄정 보(IIS, Flight Plan)를 표출한다. 실제 개별 주기장별 촬영 영상을 분석하여 처리한 정보를 제공하며 해당 화 면 제어 및 통제기능과 개별 영상을 관제사에게 제공한다. 해당 화면에는 주기장 번호의 색상, 깜박임, 방향표시 등으로 항공기의 출발/도착 지상조업 준비 상태를, 출발 허가(ATC Clearance) 획득여부, 조종사(견인운전자의)의 주기장 출발을 위한 후방견인 허가요청 여부, 실제 항 공기 이동 여부, 항공기 후방견인 방향 일치 여부를 관제사가 단순/직관적으로 인식할 수 있도록 제공한다. 합성 가공된 주기장 뷰 영상을 컴퓨터비전 영상인식 기술 기반으로 게이트 내의 다양한 물체(항공기, 견인트럭, 터그카, 달리, ULD, GPU. 화물, 급수트럭, 오수트럭, 케이터링트럭, 쓰레기차, 카고로더, 사다리, 스텝카 등)의 움직임 및 존재 유무에 따른 센싱 데이터를 해당 항공기의 비행 정보와 결합하여 분석 및 학습 한다. 해당 학습을 통해 운항 상황 예측이 가능하며 준비상태 분석결과 지연이 예상되는 경우, 출발허가 미 획득 상황 으로 지연이 예상되는 경우, 실제 지연이 발생되는 경우 이를 A-CDM과 연계하여 목표이륙시간(TTOT)에 따른 목 표푸시백승인시간(TSAT) 지연 여부를 판단 가능하며 해당 사항을 관제사에게 경고 표출한다. 도 9는 본 발명의 일실시예에 따른 어라운드 뷰의 예시이다. 도 9를 참조하면, VR기술과 디지털 트윈 기술을 활 용하여 위에서 내려다 본(Top-Down View) 계류장 전체화면에 항공기 운항단계/상태별 정보(항공기 준비상태, 기 종, 출발예정시각, 사용 활주로, 후방견인방향 및 지점)를 계류장 관제사가 전체를 직관적으로 파악할 수 있게 제공한다. 주기장 번호, 항공기 편명 등의 색상, 깜박임 등으로 운항단계를 구분하여 확인할 수 있으며, 주기장 뷰에 적용된 기준과 통일하여 관제사의 상황인식 및 대응 속도를 개선을 도모할 수 있다. 도 10은 본 발명의 다른 일실시예에 따른 예정된 시각에 예정된 지점이 불일치할 경우, 알람 정보를 제공하는 과정을 보여주는 흐름도이다. 도 10을 참조하면, 항공기의 항공사 및 기종 확인이 가능한 지점에 도 달함에따라 관제탑 서버는 센서계 중 카메라를 이용하여 항공기 착륙에서부터 촬영된 영상을 분석하 여 분석 결과 정보를 생성한다(단계 S1010). 이때, ASDE 정보와 추적용 카메라를 이용하여 입항 항공기에 대한 트랙킹 기능을 파노라마뷰를 통해 제공한다. 한편, 분석 결과 정보는 항공사, 기종, 시간, 위치 등을 포함 할 수 있다. 한편, 관제탑 서버는 항공기의 예정 경로를 분석하여 예측 결과 정보를 생성한다(단계 S1020). 예측 결과는 도착예정 항공기, 위치추적, 확인가능 유도로 도착 예측 시각을 들 수 있다. 관제탑 서버는 예정된 시간에 예정된 지점의 항공기를 식별하여 불일치하면 경고 정보를 생성한다(단계 S1030,S1040). 또한, 여기에 개시된 실시형태들과 관련하여 설명된 방법 또는 알고리즘의 단계들은, 마이크로프로세서, 프로세 서, CPU(Central Processing Unit) 등과 같은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태 로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 (명령) 코드, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 (명령) 코드는 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소 프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프 등과 같은 자기 매체(magnetic media), CD-ROM, DVD, 블루레이 등과 같 은 광기록 매체(optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 (명령) 코드를 저장하 고 수행하도록 특별히 구성된 반도체 기억 소자가 포함될 수 있다. 여기서, 프로그램 (명령) 코드의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프 리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가 지이다."}
{"patent_id": "10-2021-0119269", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 스마트 공항 관제 시스템의 구성 블럭도이다. 도 2는 도 1에 도시된 관리 서버의 세부 구성도이다. 도 3은 도 1에 도시된 관제탑 서버의 세부 구성도이다. 도 4는 도 3에 도시된 처리부의 세부 구성도이다. 도 5는 본 발명의 일실시예에 따른 경로가 상이할 경우, 알림 정보를 제공하는 과정을 보여주는 흐름도이다. 도 6은 도 5의 증강 현실에 따른 항공기의 이동 경로 및 목적지 게이트를 표시하는 예이다. 도 7은 본 발명의 일실시예에 따른 시각적 제한을 보완하기 위해 항공기 및 이동물체의 항적 데이터를 연동하여3D 모델링 오브젝트를 생성하여 표출하는 개념도이다. 도 8은 본 발명의 일실시예에 따른 주기장 뷰 개념도이다. 도 9는 본 발명의 일실시예에 따른 어라운드 뷰의 예시이다. 도 10은 본 발명의 다른 일실시예에 따른 예정된 시각에 예정된 지점이 불일치할 경우, 알람 정보를 제공하는 과정을 보여주는 흐름도이다."}
