{"patent_id": "10-2023-0180044", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0127865", "출원번호": "10-2023-0180044", "발명의 명칭": "이진 신경망 하드웨어 장치", "출원인": "한국전자통신연구원", "발명자": "황성민"}}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비트라인의 비트라인 전압과 기 설정된 기준 전압을 비교하는 감지 증폭기;상기 비트라인 전압을 상기 감지 증폭기에 입력하는 입력부; 및 상기 비트라인을 통해 인공지능 이진 시냅스와 연결되어 상기 비트라인 전압을 다단계로 변화시키는 문턱전압조절기를 포함하는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 입력부는 상기 인공지능 이진 시냅스의 시냅스 출력과 전압을 분배하여 상기 비트라인 전압을 상기 감지 증폭기에 입력하는 저항을 포함하는 전압 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 문턱전압 조절기는 컨덕턴스를 다단계로 가변시켜 상기 인공지능 이진 시냅스와의 합성 컨덕턴스를 변화시키는 멀티레벨 시냅스를포함하는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 멀티레벨 시냅스는 컨덕턴스 가변 소자인 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 멀티레벨 시냅스는 기판; 상기 기판에 도포되는 게이트 전극; 상기 기판과 상기 게이트 전극 상에 도포되는 Al2O3 층; 상기 Al2O3 층에 도포되는 TiO2 층; 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 소스 전극; 및상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 드레인 전극을 포함하고, 상기 소스 전극과 상기 드레인 전극은 이격되며, 상기 게이트 전극에 인가되는 게이트 전압을 제어하여 상기 TiO2 층과 상기 Al2O3 층 사이의 계면에 트랩된 전자와 홀을 토대로 컨덕턴스를 변화시키는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 멀티레벨 시냅스의 컨덕턴스는 상기 게이트 전극에 프로그램용 (+) 펄스가 가해지면 감소하고, 상기 게이트 전극에 이레이저용 (-) 펄스가 가해지면 증가하는 이진 신경망 하드웨어 장치.공개특허 10-2024-0127865-3-청구항 7 컨덕턴스를 다단계로 가변시켜 인공지능 이진 시냅스와의 합성 컨덕턴스를 변화시키는 멀티레벨 시냅스를 포함하고, 상기 멀티레벨 시냅스는, 기판; 상기 기판에 도포되는 게이트 전극; 상기 기판과 상기 게이트 전극 상에 도포되는 Al2O3 층; 상기 Al2O3 층에 도포되는 TiO2 층; 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 소스 전극; 및상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 드레인 전극을 포함하고, 상기 소스 전극과 상기 드레인 전극은 이격되며, 상기 게이트 전극에 인가되는 게이트 전압을 제어하여 상기 TiO2 층과 상기 Al2O3 층 사이의 계면에 트랩된 전자와 홀을 토대로 컨덕턴스를 다단계로 가변시키는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 멀티레벨 시냅스의 컨덕턴스는 상기 게이트 전극에 프로그램용 (+) 펄스가 가해지면 감소하고, 상기 게이트 전극에 이레이저용 (-) 펄스가 가해지면 증가하는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "비트라인의 비트라인 전압과 기 설정된 기준 전압을 비교하는 감지 증폭기; 상기 비트라인을 통해 인공지능 이진 시냅스와 연결되어 상기 비트라인 전압을 다단계로 변화시키는 문턱전압조절기; 및 상기 인공지능 이진 시냅스의 시냅스 출력 전류를 축적하여 상기 비트라인 전압을 검출하는 적분기를 포함하는이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 적분기는 일측이 상기 비트라인에 연결되고 타측이 접지에 연결되어 상기 인공지능 이진 시냅스의 시냅스 출력 전류를 축적하는 커패시터; 및상기 커패시터를 방전시키는 리셋 스위치를 포함하는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 문턱전압 조절기는 컨덕턴스를 다단계로 가변시켜 상기 인공지능 이진 시냅스와의 합성 컨덕턴스를 변화시키는 멀티레벨 시냅스를포함하는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 멀티레벨 시냅스는 컨덕턴스 가변 소자인 이진 신경망 하드웨어 장치. 공개특허 10-2024-0127865-4-청구항 13 제11항에 있어서, 상기 멀티레벨 시냅스는 기판; 상기 기판에 도포되는 게이트 전극; 상기 기판과 상기 게이트 전극 상에 도포되는 Al2O3 층; 상기 Al2O3 층에 도포되는 TiO2 층; 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 소스 전극; 및상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 드레인 전극을 포함하고, 상기 소스 전극과 상기 드레인 전극은 이격되며, 상기 게이트 전극에 인가되는 게이트 전압을 제어하여 상기 TiO2 층과 상기 Al2O3 층 사이의 계면에 트랩된 전자와 홀을 토대로 컨덕턴스를 변화시키는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 멀티레벨 시냅스의 컨덕턴스는 상기 게이트 전극에 프로그램용 (+) 펄스가 가해지면 감소하고, 상기 게이트 전극에 이레이저용 (-) 펄스가 가해지면 증가하는 이진 신경망 하드웨어 장치."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 이진 신경망 하드웨어 장치에 관한 것으로, 이진 신경망 하드웨어 장치는 비트라인의 비트라인 전압과 기 설정된 기준 전압을 비교하는 감지 증폭기; 비트라인 전압을 감지 증폭기에 입력하는 입력부; 및 비트라인을 통해 인공지능 이진 시냅스와 연결되어 비트라인 전압을 다단계로 변화시키는 문턱전압 조절기를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이진 신경망 하드웨어 장치에 관한 것이다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 다양한 산업 분야에서 인공 신경망의 활용도가 증가하는 가운데 이미지 분류, 자연어 처리, 자율 주행 등 에서는 전례 없는 최고의 성능을 보여주고 있다. 그러나 인공 신경망 모델이 점점 복잡해짐에 따라 학습과 추론 동작을 위해 요구되는 소모전력 및 프로세싱 칩 등의 연산 자원이 막대하게 증가하고 있다. 이를 해결하기 위해 가중치와 활성함수의 출력 값을 +1 또는 -1로 제한하여 구현하는 이진 신경망(Binary Neural Network, BNN)에 대한 연구가 최근 활발히 진행되고 있다. 이진 신경망은 기존 소프트웨어 기반의 인공신경망에 비해 분류 정확도는 약간 낮지만 소모 전력과 메모리 등 컴퓨팅 자원을 큰 폭으로 감축할 수 있어 향후 하드웨어 기반의 인공 신경망 연구 분야에서도 많은 관심을 끌고 있다. 이진 신경망의 학습 안정성과 속도를 향상시키기 위해서는 학습 과정에서 각 층(layer)의 데이터를 통계 적으로 정규화 하는 배치정규화(Batch Normalization, BN) 적용이 필수적이다. 배치정규화는 학습 과정에서 mini-batch별 연산 결과를 평균(μ)과 표준편차(σ)로 정규화하고, 스케일 인자인 감마(γ)와 베타(β) 값을 이용해 scale 및 shift시키는 방식으로 작동한다. 이러한 통계적 제어를 통해 계층별 입력 데이터 분포가 연동해서 틀어지는 Internal Covariate Shift 현상을 막아줄 수 있기 때문에 학습 가속화와 일반화 성능의 향상이라는 장점을 갖게 된다. 그러나, 배치정규화 기능을 하드웨어로 구현하려면 매우 복잡한 회로가 필요하다. 즉, 하드웨어 배치정규화를 구현하기 위해서는 뉴런에 연결된 시냅스 소자 수와 동일한 개수의 이진 시냅스들이 기존 회로에 추가되어야 하 기 때문에 칩 면적과 에너지 효율이 크게 저하되며 시냅스 출력을 읽어내는 방식 때문에 경우에 따라 에러율이 증가하는 결과를 야기하게 된다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 발명의 배경기술은 대한민국 공개특허공보 10-2023-0080303호(2023.06.07)에 개시되어 있다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "발명의 내용"}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 하나의 시냅스를 이용하여 이진 신경망 뉴런에 다단계 가중치를 부여하여 배치정규화 기능을 구현하 는 이진 신경망 하드웨어 장치를 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일부 실시 예에 따른 이진 신경망 하드웨어 장치는 비트라인의 비트라인 전압과 기 설정된 기준 전압 을 비교하는 감지 증폭기; 상기 비트라인 전압을 상기 감지 증폭기에 입력하는 입력부; 및 상기 비트라인을 통 해 인공지능 이진 시냅스와 연결되어 상기 비트라인 전압을 다단계로 변화시키는 문턱전압 조절기를 포함하는 것을 특징으로 한다. 본 발명의 상기 입력부는 상기 인공지능 이진 시냅스의 시냅스 출력과 전압을 분배하여 상기 비트라인 전압을 상기 감지 증폭기에 입력하는 저항을 포함하는 것을 특징으로 한다. 본 발명의 상기 문턱전압 조절기는 컨덕턴스를 다단계로 가변시켜 상기 인공지능 이진 시냅스와의 합성 컨덕턴 스를 변화시키는 멀티레벨 시냅스를 포함하는 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스는 컨덕턴스 가변 소자인 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스는 기판; 상기 기판에 도포되는 게이트 전극; 상기 기판과 상기 게이트 전극 상 에 도포되는 Al2O3 층; 상기 Al2O3 층에 도포되는 TiO2 층; 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 소 스 전극; 및 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 드레인 전극을 포함하고, 상기 소스 전극과 상 기 드레인 전극은 이격되며, 상기 게이트 전극에 인가되는 게이트 전압을 제어하여 상기 TiO2 층과 상기 Al2O3 층 사이의 계면에 트랩된 전자와 홀을 토대로 컨덕턴스를 변화시키는 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스의 컨덕턴스는 상기 게이트 전극에 프로그램용 (+) 펄스가 가해지면 감소하고, 상기 게이트 전극에 이레이저용 (-) 펄스가 가해지면 증가하는 것을 특징으로 한다. 본 발명의 다른 측면에 따른 이진 신경망 하드웨어 장치는 컨덕턴스를 다단계로 가변시켜 인공지능 이진 시냅스 와의 합성 컨덕턴스를 변화시키는 멀티레벨 시냅스를 포함하고, 상기 멀티레벨 시냅스는, 기판; 상기 기판에 도 포되는 게이트 전극; 상기 기판과 상기 게이트 전극 상에 도포되는 Al2O3 층; 상기 Al2O3 층에 도포되는 TiO2 층; 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 소스 전극; 및 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도 포되는 드레인 전극을 포함하고, 상기 소스 전극과 상기 드레인 전극은 이격되며, 상기 게이트 전극에 인가되는 게이트 전압을 제어하여 상기 TiO2 층과 상기 Al2O3 층 사이의 계면에 트랩된 전자와 홀을 토대로 컨덕턴스를 다 단계로 가변시키는 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스의 컨덕턴스는 상기 게이트 전극에 프로그램용 (+) 펄스가 가해지면 감소하고, 상기 게이트 전극에 이레이저용 (-) 펄스가 가해지면 증가하는 것을 특징으로 한다 본 발명의 또 다른 측면에 따른 이진 신경망 하드웨어 장치는 비트라인의 비트라인 전압과 기 설정된 기준 전압 을 비교하는 감지 증폭기; 상기 비트라인을 통해 인공지능 이진 시냅스와 연결되어 상기 비트라인 전압을 다단 계로 변화시키는 문턱전압 조절기; 및 상기 인공지능 이진 시냅스의 시냅스 출력 전류를 축적하여 상기 비트라 인 전압을 검출하는 적분기를 포함하는 것을 특징으로 한다. 본 발명의 상기 적분기는 일측이 상기 비트라인에 연결되고 타측이 접지에 연결되어 상기 인공지능 이진 시냅스 의 시냅스 출력 전류를 축적하는 커패시터; 및 상기 커패시터를 방전시키는 리셋 스위치를 포함하는 것을 특징 으로 한다. 본 발명의 상기 문턱전압 조절기는 컨덕턴스를 다단계로 가변시켜 상기 인공지능 이진 시냅스와의 합성 컨덕턴 스를 변화시키는 멀티레벨 시냅스를 포함하는 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스는 컨덕턴스 가변 소자인 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스는 기판; 상기 기판에 도포되는 게이트 전극; 상기 기판과 상기 게이트 전극 상 에 도포되는 Al2O3 층; 상기 Al2O3 층에 도포되는 TiO2 층; 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 소스 전극; 및 상기 TiO2 층과 상기 Al2O3 층에 이격되게 도포되는 드레인 전극을 포함하고, 상기 소스 전극과 상 기 드레인 전극은 이격되며, 상기 게이트 전극에 인가되는 게이트 전압을 제어하여 상기 TiO2 층과 상기 Al2O3 층 사이의 계면에 트랩된 전자와 홀을 토대로 컨덕턴스를 변화시키는 것을 특징으로 한다. 본 발명의 상기 멀티레벨 시냅스의 컨덕턴스는 상기 게이트 전극에 프로그램용 (+) 펄스가 가해지면 감소하고, 상기 게이트 전극에 이레이저용 (-) 펄스가 가해지면 증가하는 것을 특징으로 한다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 이진 신경망 하드웨어 장치는 하나의 시냅스를 이용하여 이진 신경망 뉴런에 다단계 가중치를 부여하여 배치정규화 기능을 구현하고, 칩 면적을 줄이면서 에너지 효율도 개선할 수 있다. 본 발명에 따른 이진 신경망 하드웨어 장치는 에러율을 일정하게 유지하여 초소형, 초저전력, 고성능 하드웨어 기반의 이진 신경망 서비스를 제공할 수 있도록 한다."}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 본 발명의 일 실시 예에 따른 이진 신경망 하드웨어 장치의 실시 예를 설명한다. 이 과정에서 도면 에 도시된 선들의 두께나 구성요소의 크기 등은 설명의 명료성과 편의상 과장되게 도시되어 있을 수 있다. 또한, 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 1용어들로서 이는 사용자, 운용자의 의도 또는 관례에 따라 달라질 수 있다. 그러므로, 이러한 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내 려져야 할 것이다. 도 1은 배치정규화 구현이 가능한 이진 신경망 하드웨어 장치의 구성도이고, 도 2는 도 1에서의 1-컬럼의 구성 도이다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시 예에 따른 이진 신경망 하드웨어 장치는 배치정규화가 가능한 이 진 신경망 추론 장치로서, 고품위로 학습된 가중치를 하드웨어 칩에 전사하여 서버와의 연결 없이도 고성능을 발휘할 수 있는 에지(edge) 디바이스용 off-chip 추론 장치일 수 있다. 본 발명의 일 실시 예에 따른 이진 신경망 하드웨어 장치는 문턱전압 조절기, 프리 시냅틱(pre-synaptic) 뉴런, 포스트 시냅틱(post-synaptic) 뉴런, 인공지능 이진 시냅스, 감지 증폭기(Sense Amplifier), 및 입력부를 포함할 수 있다. 프리 시냅틱 뉴런의 입력 x, 가중치 w, 바이어스 b 일 때 포스트 시냅틱 뉴런에 입력되는 가중치 합 s는 아래의 수학식 1과 같이 표현될 수 있다.수학식 1"}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "학습을 통해 확보된 평균 μ, 표준편차 σ, 스케일 인자 γ, β 등의 배치정규화 파라미터를 적용하면 배치정규 화 계층의 출력 BN(x)는 아래의 수학식 2와 같은 방식으로 동작하게 된다. 수학식 2"}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이진 신경망에서 포스트 시냅틱 뉴런의 출력 ab는 출력 BN(x)이 0 이상인 경우, +1의 값을 보이고, 그 외 에는 -1의 값을 보일 수 있다. 이는 아래의 수학식 3과 같다. 수학식 3"}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이를 수학식 2와 수학식 3의 결합을 통해 간략화면, 상기한 배치정규화 파라미터들은 아래의 수학식 4와 같이 포스트 시냅틱 뉴런의 문턱전압(Nth)으로 표현될 수 있다. 수학식 4"}
{"patent_id": "10-2023-0180044", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "따라서, 본 실시 예의 이진 신경망 하드웨어 장치는 배치정규화 가중치로 작동하는 off-chip 추론 장치 구현을 위해, 다단계 컨덕턴스(conductance) 가변 특성을 갖는 반도체 소자를 사용함으로써, 포스트 시냅틱 뉴런 의 문턱전압(Nth)에 대한 다중 조절이 가능하도록 한다. 인공지능 이진 시냅스는 이진 신경망 구현을 위해 2-레벨의 컨덕턴스 상태로만 활용될 수 있으며, 두 개의 시냅스 소자를 하나의 시냅스 페어로 할 경우 양의 가중치와 음의 가중치 모두 구현 가능하다( ). 도 2에서, 인공지능 이진 시냅스와 문턱전압 조절기는 플래시 메모리, RRAM(Resistive Random Access Memory), MRAM(Magnetoresistive Random Access Memory), PRAM(Phase Change Random Access Memory) 등 다양한 비휘발성 메모리가 적용될 수 있다. 문턱전압 조절기는 멀티레벨의 컨덕턴스 조절이 가능한 소자일 수 있다. 도 2에는, 이진 신경망에서 포스트 시냅틱 뉴런의 역할을 감지 증폭기에 인공지능 이진 시냅스 가 연결된 하나의 컬럼(column) 구성이 도시된다. 감지 증폭기는 2개의 입력 전압 크기를 비교하여 하이(high) 또는 로우(low)를 출력할 수 있다. 도 2에서, 감지 증폭기의 출력은 비트라인 전압(VBL)과 기준 전압(Vref) 간의 대소에 따라 결정될 수 있다. 비트라인 전압(VBL)은 인공지능 이진 시냅스의 시냅스 출력과 저항(RS)의 분배 전압이다. 입력부는 비트라인 전압(VBL)을 감지 증폭기에 입력하는 입력할 수 있다. 입력부는 인공지능 이진 시냅스의 시냅스 출력과 전압을 분배하여 비트라인 전압을 출력하는 저항 (RS)을 포함할 수 있다. 저항(RS)은 인공지능 이진 시냅스의 컬럼과 직렬 연결될 수 있다. 저항(RS)과 인공지능 이진 시냅스 사이의 노드가 감지 증폭기의 입력과 연결될 수 있다. 따라서, 도 2의 기준 전압(Vref)을 수학식 4의 문턱전압(Nth)에 연동시키면 배치정규화가 구현될 수 있다. 그러나, 인공 신경망은 각 단마다 독자적인 문턱전압(Nth)을 가질 뿐만 아니라 문턱전압(Nth)에 대응되는 감지 증 폭기의 입력전압 생성을 위해 정밀한 DAC(digital to analog converter) 회로가 필요하므로, 칩의 면적과 전력 소모가 크게 증가하게 된다. 이에 본 실시 예에서는 감지 증폭기의 ±1 판단이 이루어지는 각 단계에서 비트라인 전압(VBL)을 변화시킴 으로써 기준 전압(Vref)을 문턱전압(Nth)에 연동시킨다. 도 3은 문턱전압 조절기에 의한 배치정규화 회로이다. 도 3을 참조하면, 배치정규화 회로에서, 하나의 포스트 시냅틱 뉴런에는 적어도 하나의 멀티레벨 시냅스 가 연결될 수 있다. 멀티레벨 시냅스는 상기한 바와 같이 문턱전압(Nth)을 조절할 수 있다. 문턱전압을 조절하기 위해 하나의 멀티레벨 시냅스를 이용하므로, 칩 면적과 문턱전압조절용 시냅스 구동 을 위한 전력 소모를 크게 줄일 수 있다. 멀티레벨 시냅스는 다단계의 컨덕턴스 상태를 가지므로 인공지능 이진 시냅스의 웨이트(컨덕턴스)가 정해 진 상태에서 문턱전압(Nth)을 다단계로 변화시켜 고정된 기준 전압(Vref)에 대해 출력 값을 조절할 수 있다. 즉, 비트라인 전압(VBL)의 전압 곡선과 기준 전압(Vref)와의 교점, 즉 문턱전압(Nth)을 다단계로 바꿀 수 있어 수 학식 4와 같은 배치정규화를 구현할 수 있게 된다. 도 3에서, 인공신경망 이진 시냅스는 컨덕턴스 웨이트를 저장할 수 있다. 인공신경 이진 시냅스는 복수 개의 메모리 소자들과 트랜지스터들을 포함할 수 있다. 메모리 소자는 저항성 메모리 소자일 수 있다. 트랜지스터는 비트라인과 메모리 소자를 연결할 수 있다. 트랜지스터의 드레인단은 메모리 소자와 연결되 고, 소스단은 접지와 연결되며, 게이트단이 입력단에 연결될 수 있다. 이에 따라, 메모리 소자는 트랜지스터의 소스와 비트라인 사이에 연결되며, 트랜지스터의 게이트 신호에 따라 비트라인과 연결됨으로써, 전압(Vmax)로부터 메모리 소자를 통해 접지와 연결되는 회로가 형성될 수 있다. 여기서, 상기한 입력은 워드라인을 통해 상보적인 신호가 게이트 신호로 입력될 수 있다. 이러한 인공지능 이진 시냅스의 회로에 따라 출력된 신호는 중첩되어 비트라인을 통해 출력될 수 있 다. 한편, 멀티레벨 시냅스는 비트라인에 연결될 수 있다. 따라서, 비트라인 전압(VBL)은 멀티레벨 시냅스의 컨덕턴스와 인공지능 이진 시냅스의 컨덕턴스의 합 성 컨덕턴스, 및 저항(RS)의 전압 분배에 의해 결정될 수 있다. 이 경우, 멀티레벨 시냅스는 다단계의 컨덕턴스 상태를 가질 수 있으므로, 멀티레벨 시냅스의 컨덕턴 스를 조절함으로써, 비트라인 전압(VBL)이 조절될 수 있다. 멀티레벨 시냅스는 다단계의 컨덕턴스 상태를 가질 수 있으므로, 2-레벨 이진 시냅스로도 사용될 수 있다. 멀티레벨 시냅스로 사용 가능한 소자는 컨덕턴스 가변 소자일 수 있다. 컨덕턴스 가변소자는 RRAM(resistive RAM), PRAM(phase change RAM), FeRAM(ferroelectric RAM), Flash memory, 산화물 기반 소자, 이온 소자일 수 있다. 멀티레벨 시냅스의 종류는 특별히 한정되는 것은 아니다. 멀티레벨 시냅스의 상태수는 소자 종류와 재질에 따라 달라질 수 있다. 도 4는 산화물 기반 멀티레벨 시냅스의 구조도이다. 도 4는 멀티레벨 시냅스의 일 예로서, 산화물 기반의 멀티레벨 시냅스이다. 산화물 기반의 멀티레벨 시냅스는 CMOS(Complementary Metal-Oxide Semiconductor) 호환공정으로 제작 가 능한 3단자 트랜지스터 구조일 수 있다. 산화물 기반의 멀티레벨 시냅스에 있어서, 기판 상에 게이트 전극가 도포될 수 있다. 기판과 게이트 전극 상에는 Al2O3 층이 도포되고, Al2O3 층에는 TiO2 층이 일부 도포 될 수 있다. 소스 전극과 드레인 전극이 상기한 TiO2 층과 Al2O3 층에 도포되며, 소스 전극과 드레 인 전극는 서로 이격된다. 이러한 산화물 기반의 멀티레벨 시냅스는 TiO2 층을 따라 소스와 드레인 전극 사이에 흐르 는 전류가 게이트 전압으로 제어될 수 있다. TiO2와 Al2O3 사이의 계면에 트랩된 전자와 홀에 따라 다 양한 컨덕턴스 상태를 가질 수 있다. 멀티레벨 시냅스의 컨덕턴스는 게이트 전극에 설정 크기 이상의 제어 펄스를 입력하여 조절될 수 있 다. 즉, 멀티레벨 시냅스의 컨덕턴스는 소스 전극과 드레인 전극을 접지한 상태에서 게이트 전 극에 프로그램용 (+) 펄스를 가하면 TiO2와 Al2O3 사이의 계면에 전자가 트랩되어 감소하고, 반 대로 게이트 전극에 이레이저용 (-) 펄스를 가하면 전자가 방출되거나 홀이 트랩되어 컨덕턴스가 증가할 수 있다. 도 5는 게이트 전압에 따른 시냅스 소자 I-V 곡선이다. 도 5에는 소스-드레인 사이에 1V를 인가하고 게이트에 0V~7V 사이의 전압을 인가하면서 시냅스 전류를 측정한 I-V 곡선 예시이다. 도 5의 (a)에 도시된 2-레벨 시냅스는 게이트 전압에 대해 두 가지 전류값이 가능하다. 이는 2-레벨 시냅스의 컨덕턴스 상태수가 2개임을 나타낸다. 반면에, 도 5의 (b)에 도시된 멀티레벨 시냅스는 게이트 전압에 대해 27개의 전류값을 보인다. 이는 멀티 레벨 시냅스의 컨덕턴스 상태수가 27개임을 나타낸다. 이를 통해, 멀티레벨 시냅스의 컨덕턴스 상태수가 2-레벨 컨덕턴스 상태수에 비해 더 많음을 알 수 있다. 도 6은 펄스 인가에 의한 시냅스 소자의 컨덕턴스 변화를 나타낸 도면이다. 도 6을 참조하면, x축은 컨덕턴스 변화를 위해 시냅스 소자에 가하는 펄스 수를 표시하고 y축은 컨덕턴스를 표 시한다. 컨덕턴스는 게이트 전압을 예를 들어 5V로 고정하고 전류를 측정한 것이다. 이 경우, 2-레벨 시냅스는 하이 또는 로우 상태만 보인다. 반면에, 멀티레벨 시냅스는 이레이즈 펄스와 프 로그램 펄스의 개수에 비례하여 컨덕턴스가 증가하고 감소하는 다단계 양상을 보임을 알 수 있다. N개의 2-레벨 시냅스를 사용하면 N+1개의 상태수를 구현할 수 있으므로 문턱 전압 조절 측면에서 동등한 성능을 위한 멀티레벨 시냅스는 N+1개의 컨덕턴스 상태수를 구현해야 한다. 실제 인공지능망 연산에 필요한 컨덕 턴스 상태수를 추정하기 위해 많이 사용되는 인공지능망의 예를 살펴보면 다음과 같다. 도 7은 MNIST 인공지능 이미지 분류 테스트를 위한 데이터 셋 일부를 나타낸 도면이다. 도 7을 인공지능 이미지 분류 테스트에 사용되는 MNIST(Modified National Institute of Standards and Technology database) 데이터 셋의 일부이다. 각 데이터는 784(=28x28) 픽셀 이미지로서 이를 이진 신경망으로 분류하려면 제일 앞 단에 필요한 인공지능 이 진시냅스 수는 784(N)이며 문턱전압 조절을 위해 필요한 2-레벨 시냅스(추가시냅스) 수 또한 784개이다. 그러므 로 785(N+1)개의 컨덕턴스 상태수를 갖는 1개의 멀티레벨 시냅스를 사용해야 동일한 성능이 구현될 수 있 다. 도 8은 멀티레벨 시냅스의 컨덕턴스 상태수 비교 결과이다. 도 8을 참조하면, 본 실시 예의 컨덕턴스 상태수 (a)는 2000개 정도로서, 기존 방식의 컨덕턴스 상태수인 (b), (c) 및 (d)에 비해 크게 증가함을 알 수 있다. 이를 토대로 이진 신경망 하드웨어 장치의 성능이 크게 개선될 수 있다. 다른 실시 예로, 비트라인 전압(VBL)을 검출하기 위해 적분기가 이용될 수 있다. 도 9는 시냅스 출력 전류를 적분하여 감지 증폭기에 입력하는 배치정규화 회로이고, 도 10은 적분기 사용시 리 셋후 Δt 경과 직후 이진시냅스 가중치 합과 문턱전압조절기의 컨덕턴스에 따른 비트라인 전압 곡선 변화를 나 타낸 도면이다. 도 9를 참고하면, 적분기는 비트라인에 설치되어 문턱전압 시냅스와 인공지능 이진 시냅스(40 0)의 출력을 검출할 수 있다. 적분기를 이용한 실시 예에서, 멀티레벨 시냅스와 인공지능 이진 시냅스는 비트라인과 전 원전압(Vdd)을 인가하는 전원전압 라인 사이에 연결될 수 있다. 인공지능 이진 시냅스는 트랜지스터와 메모리 소자를 포함할 수 있다. 메모리 소자는 트랜지스터의 드레인과 비트라인 사이에 연결될 수 있다. 인공지능 이진 시냅스 내 트랜지스터의 드레인은 메모리 소자와 연결되고, 소스는 전원전압 라인에 연결되 며, 게이트는 입력단에 연결될 수 있다. 이에 따라, 메모리 소자는 트랜지스터의 드레인과 비트라인 사이에 연결되며, 트랜지스터의 게이트 신호에 따라 비트라인과 연결될 수 있다. 멀티레벨 시냅스는 비트라인과 전원전압 라인 사이에 연결될 수 있다. 멀티레벨 시냅스는 트랜지스터와 메모리 소자를 포함할 수 있다. 메모리 소자는 트랜지스터의 드레인단과 비트라인 사이에 연결될 수 있다. 멀티레벨 시냅스 내 트랜지스터의 드레인단은 메모리 소자와 연결되고, 소스단은 전원전압 라인에 연결되 며, 게이트단이 입력단에 연결될 수 있다. 이에 따라, 메모리 소자는 트랜지스터의 소스와 비트라인 사이 연결되며, 트랜지스터의 게이트 신호에 따 라 비트라인과 연결될 수 있다. 적분기는 인공지능 이진 시냅스의 출력 전류를 내부의 커패시터(Cint)에 일정 시간 동안 축적시켜 비 트라인 전압(VBL)을 결정할 수 있다. 적분기는 커패시터(Cint), 및 리셋 스위치(SR)를 포함할 수 있다. 커패시터(Cint)는 일측이 비트라인에 연결되고 타측이 접지에 연결되어 시냅스 출력 전류를 축적할 수 있다. 시냅스 출력 전류가 커패시터(Cint)에 축적됨에 따라, 비트라인 전압(VBL)은 상승할 수 있다. 리셋 스위치(SR)는 적분기를 리셋시킬 수 있다. 리셋 스위치(SR)에 의해 리셋되면, 커패시터(Cint)는 완전 방전되고, 비트라인 전압(VBL)은 0V가 된다. 적분기의 동작 과정은 다음과 같다. 먼저, 리셋 스위치(SR)에 리셋 펄스가 입력된 커패시터(Cint)는 완전 방전되고 비트라인 전압(VBL)은 0V가 된다. 리셋 종료 후, 게이트 신호( )가 입력되면 되면, 시냅스 출력 전류가 커패시터(Cint)에 축적되어 비트라 인 전압(VBL)이 상승한다. 이때 시냅스 가중치 합(Weighted-sum)이 클수록 출력 전류가 크다. 비트라인 전압 (VBL)의 크기는 가중치 합에 비례하게 된다. 문턱전압 조절기의 컨덕턴스를 최소 상태에서 점점 증가시킴에 따라, 도 10에 도시된 바와 같이 이진 시냅 스의 가중치합에 따른 비트라인 전압 곡선은 위로 상승하며 비트라인 전압 곡선과 기준전압 곡선의 교점인 문턱 전압(Nth)은 오른쪽에서 왼쪽으로 이동하게 된다. 적분기에서는 커패시터(Cint)에 입력되는 전류 외에 시간 경과에 따라서도 비트라인 전압 곡선이 바뀌므로 비트라인 전압(VBL)을 읽는 시간을 하나로 고정해야 한다. 이를 위해 멀티레벨 시냅스의 컨덕턴스 제어에 의해 교점이 최대값에서 최소값 사이 전체를 이동할 수 있 도록 리셋 후 비트라인 전압(VBL)를 읽는 시간(Δt)이 결정될 수 있다. 리셋 후 시간(Δt) 경과 후에 비트라인 전압 곡선과 기준전압 곡선의 교점이 인공지능망 학습에서 구한 문턱전 압(Nth)과 일치하도록 문턱전압 조절기의 컨덕턴스가 조정된다. 리셋 후 시간(Δt)이 경과후에 감지 증폭기를 인에이블시켜 감지 증폭기가 출력 전압(Vout)을 출력함 에 따라 배치정규화가 구현된다. 도 10에 도시된 바와 같이, 적분기는 문턱전압조절기의 컨덕턴스 조절에 의해 비트라인 전압 곡선을 이동 시킬 때 기울기를 동일하게 유지할 수 있도록 하므로, 기울기가 감소하는 전압 분배 방식과 달리 노이즈에 따른 에러 발생율이 증가하지 않도록 한다. 이와 같이, 본 발명의 일 실시 예에 따른 이진 신경망 하드웨어 장치는 하나의 시냅스를 이용하여 이진 신경망 뉴런에 다단계 가중치를 부여하여 배치정규화 기능을 구현하고, 칩 면적을 줄이면서 에너지 효율도 개선할 수 있다. 또한, 본 발명의 일 실시 예에 따른 이진 신경망 하드웨어 장치는 에러율을 일정하게 유지하여 초소형, 초저전 력, 고성능 하드웨어 기반의 이진 신경망 서비스를 제공할 수 있도록 한다. 본 발명은 도면에 도시된 실시 예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속 하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 이해 할 것이다. 따라서 본 발명의 기술적 보호범위는 아래의 특허청구범위에 의해서 정하여져야 할 것이다."}
{"patent_id": "10-2023-0180044", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 배치정규화 구현이 가능한 이진 신경망 하드웨어 장치의 구성도이다. 도 2는 도 1에서의 1-컬럼의 구성도이다. 도 3은 문턱전압 조절기에 의한 배치정규화 회로이다. 도 4는 산화물 기반 멀티레벨 시냅스의 구조도이다. 도 5는 게이트 전압에 따른 시냅스 소자 I-V 곡선이다. 도 6은 펄스 인가에 의한 시냅스 소자의 컨덕턴스 변화를 나타낸 도면이다. 도 7은 MNIST 인공지능 이미지 분류 테스트를 위한 데이터 셋 일부를 나타낸 도면이다. 도 8은 제어 펄스 인가에 따른 멀티레벨 시냅스의 컨덕턴스 상태수 비교 예이다. 도 9는 시냅스 출력 전류를 적분하여 감지 증폭기에 입력하는 배치정규화 회로이다. 도 10은 적분기 사용시 리셋후 Δt 경과 직후 이진시냅스 가중치 합과 문턱전압조절기의 컨덕턴스에 따른 VBL 곡 선 변화를 나타낸 도면이다."}
