{"patent_id": "10-2023-0038002", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0144551", "출원번호": "10-2023-0038002", "발명의 명칭": "손떨림을 이용한 파킨슨병 질병의 진단 방법", "출원인": "주식회사 지오멕스소프트", "발명자": "김백섭"}}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자가 수집모드에 따라 손에 사용자 단말을 파지하여 상기 사용자가 측정용 이미지를 촬영한 영상 데이터를생성하는 제1 단계;상기 사용자 단말에서 생성된 영상 데이터에 기초하여 상기 사용자가 상기 사용자 단말을 파지한 손의 궤적을추적하여 신호를 생성하는 제2 단계;상기 사용자 단말이 상기 신호에서 복수의 떨림 특징을 추출하는 제3 단계; 및진단수단이 상기 복수의 떨림 특징에 기초하여 상기 사용자의 파킨슨병 질병을 진단하는 제4 단계;를 포함하는것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 사용자 단말은상기 영상 데이터를 생성하기 위한 카메라를 포함하고, 파킨슨병 질병을 진단하기 위한 어플리케이션이 내장된스마트폰이고, 상기 어플리케이션은 상기 진단수단을 포함하는 것을 특징으로 하는 손떨림을 이용한 파킨슨병질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 수집모드는상기 사용자 단말이 상기 사용자의 한 손에 파지되어 정지하였을 때 상기 영상 데이터를 수집하는 한손 정지 모드;상기 사용자 단말이 상기 사용자의 한 손에 파지되어 수직으로 움직일 때 상기 영상 데이터를 수집하는 한손 수직 모드;상기 사용자 단말이 상기 사용자의 한 손에 파지되어 수평으로 움직일 때 상기 영상 데이터를 수집하는 한손 수평 모드;상기 사용자 단말이 상기 사용자의 양손에 파지되어 정지할 때 상기 영상 데이터를 수집하는 양손 정지 모드;상기 사용자 단말이 상기 사용자의 양손에 파지되어 수직으로 움직일 때 상기 영상 데이터를 수집하는 양손 수직 모드; 및상기 사용자 단말이 상기 사용자의 양손에 파지되어 수평으로 움직일 때 상기 영상 데이터를 수집하는 양손 수평 모드; 중 적어도 어느 하나인 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 제2 단계는상기 영상 데이터에서 각각의 프레임에 대한 이미지를 추출하는 단계;상기 추출된 이미지에 대해 모서리 추정을 수행하여 인접한 프레임 사이에 상기 모서리의 대응점을 구하는단계; 및호모그래피 매트릭스의 병진 구성요소에서 궤적을 추적하는 단계;를 포함하는 것을 특징으로 하는 손떨림을 이공개특허 10-2024-0144551-3-용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 제3 단계는상기 신호를 고역통과 필터 및 저역통과 필터를 포함하는 대역통과 필터에 통과시켜 고역통과 필터링된 신호와저역통과 필터링된 신호가 생성되는 제3-1 단계;상기 고역통과 필터링된 신호에서 동질성, 피치, 전력 및 엔트로피 중 적어도 하나를 포함하는 떨림 특징이 추출되는 제3-2 단계; 및상기 고역통과 필터링된 신호와 상기 저역통과 필터링된 신호에서 각도, 속도 및 코사인 중 적어도 하나를 포함하는 떨림 특징이 추출되는 제3-3 단계;를 포함하는 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 각도는궤적의 방향을 측정하기 위해 xy좌표에서 고유 벡터를 얻는 단계;상기 고유 벡터의 x축과 y축 중 고유값이 더 큰 축을 주축(Principal Axis)으로 하는 단계; 및상기 xy좌표와 상기 주축에 기초하여 상기 각도가 계산되는 단계;를 포함하여 생성되는 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서,상기 동질성은이동방향의 일관성을 측정하기 위해 상기 복수의 고유값들을 이용하여 하기 수학식 1에 기초하여 계산되는 것을특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법.[수학식 1]상기 수학식 1에서, λ1은 x축 고유값 및 y축 고유값 중 더 큰 값이고, λ2는 x축 고유값 및 y축 고유값 중 작은값이다."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 5 항에 있어서,상기 피치는상기 고역통과 필터링된 신호의 복수의 xy좌표값들을 상기 주축에 투영하여 1차원 신호를 생성하하는 단계; 및자기 상관에 기초한 방법으로 생성된 상기 1차원 신호의 기본 주파수의 피치인 상기 피치를 생성하는 단계;를포함하여 생성되는 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 5 항에 있어서,상기 전력은상기 1차원 신호를 푸리에 변환하여 전력 스팩트럼을 생성하는 단계; 및 상기 전력 스팩트럼의 합산값인 상기공개특허 10-2024-0144551-4-전력을 생성하는 단계;를 포함하여 생성되는 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 5 항에 있어서,상기 엔트로피는상기 신호의 주파수 성분 양을 나타내는 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 5 항에 있어서,상기 속도는상기 영상 데이터의 인접한 서로 다른 두 프레임의 대응점의 위치 차이를 상기 두 프레임이 생성되는 시간 간격으로 나눈 값인 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 5 항에 있어서,상기 코사인 떨림 특징은상기 고역통과 필터링된 신호와 상기 주축 또는 상기 저역통과 필터링된 신호와 상기 주축의 내적으로 계산되는것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,상기 진단수단은인공지능 학습 알고리즘을 이용하여 파킨슨병 질병을 판단하는 것을 특징으로 하는 손떨림을 이용한 파킨슨병질병의 진단 방법."}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 해결하고자 하는 과제는 떨림 측정 을 위한 어플리케이션이 내장된 스마트폰으로 촬영한 영상 데이터를 이용하여 떨림의 움직임을 분석하여 파킨슨 병 질병을 진단하는 손떨림을 이용한 파킨슨병 질병의 진단 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 손떨림을 이용한 파킨슨병 질병의 진단 방법에 관한 것으로, 보다 상세하게는 떨림 측정을 위한 어플 리케이션이 내장된 스마트폰으로 촬영한 영상 데이터를 이용하여 떨림의 움직임을 분석하여 파킨슨병 질병을 진 단하는 손떨림을 이용한 파킨슨병 질병의 진단 방법에 관한 것이다."}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "떨림은 비자발적 움직임의 가장 빈번한 형태 중 하나이다. 떨림은 상호 신경분포된 근육의 교대 또는 동시 수축 에 의해 생성된 신체 부분의 비자발적 진동을 포함한다. 떨림은 일반적으로 임상 상황에 따라 달라지는 정도의 변동 경향이 있다. 스트레스와 불안은 떨림을 유발하는 경향이 있는 반면 편안한 조건은 떨림의 정도를 감소시 킬 수 있다. 떨림의 임상적인 분류는 떨림의 빈도, 떨림이 유발되는 조건, 추가 의료 정보, 가족력 및 신경학적 검사 소견을 기반으로 한다. 최근에는 임상적인 특징(과거력 특징, 떨림 특징, 동반진단 및 검사실 검사)과 병인에 기초하여 떨림의 분류에 대한 새로운 기준이 제시되었다. 검사실 검사에는 전기생리검사, 구조영상검사, 수용체영상검사, 대사혈액검사, 감염검사 및 유전자검사 등이 있다. 임상 측정 및 생체 역학적 방법은 떨림에 대한 정량 분석 방법으로 적용될 수 있으며, 임상 상황에서 중증도 또는 치료 반응을 평가할 수 있다. 전기생리학적 검사로는 근전도검사 (EMG:Electromyography), 가속도계 검사 등이 있다. 전기생리학적 검사의 전기적 특성은 병력 및 신체 검사 외 에도 유용한 정보를 제공할 수 있다. 떨림의 전기생리학적 특성 분석은 떨림의 기계적, 기계적 반사 또는 중심 요소의 존재 뿐만 아니라 떨림 빈도에 대한 정고를 제공할 수 있다. 떨림 분석은 폭주시간, 진폭, 주파수 등이 기본적인 측정치이다.떨림 분석은 객관적이고 재현이 가능하며 진단 가능한 떨림의 중요한 정보를 제공한다. 떨림 형태의 분석은 본 태떨림과 파킨슨병의 진단적 접근에 매우 중요하다. 따라서, 지난 수십년 동안 가속도계, EMG, 디지털 태블릿 카메라, 광학 장치 등을 포함하는 떨림 분석 장치를 개발하려는 여러 시도가 있었지만, 여전히 움직임의 완벽한 매개 변수를 반영하기 어려운 문제점이 있었다. 예를 들면, 1축 가속도계는 움직임의 모든 매개변수를 포함할 수 없으며, 움직임이 일어나는 운동축의 부착 위치에 따라 결과가 다를 수 있었다. 그리고, 표면 EMG는 움직임 자체가 아닌 근육계의 전기적 신호로 제시되는 근육 활동에 사용되었다. 영상 기술과 장비의 발달로 떨림 등의 이상 운동 증상에 대한 형상을 언제 어디서나 임상 현장에서 기록할 수 있게 되어, 향후 영상 기술과 장비가 주요 떨림 분석 도구가 될 것으로 예상된다. 특히, 스마트폰에 내장된 카 메라를 이용한 영상녹화 기술의 발전은 의심할 여지 없이 매우 빠르게 발전하고 있다. 따라서, 스마트폰을 이용 한 사람의 떨림 인식이 떨림 분석의 새로운 대안이 될 가능성이 있다. 생체 신호의 디지털 변환으로 스마트폰에 서 생성된 비디오 이미지는 객관적인 떨림 움직임에 대한 소스를 제공할 수 있다. 최근 인공지능(AI) 기술을 의학 연구 분야에 적용하는 사례가 증가하고 있다. 의학에서 인공지능은 컴퓨터 알고 리즘을 사용하여 광범위하게 관련 정보를 발견하고 임상 의사 결정을 지원한다. 멀티플레이어 퍼셉트론(MLP)은 피드포워드 인공 신경만(ANN) 중 하나로 선형적으로 분리할 수 없는 데이터를 구별하기 위해 구현할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2068836 B1 2020.01.15"}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로, 본 발명의 해결하고자 하는 과제는 떨림 측정 을 위한 어플리케이션이 내장된 스마트폰으로 촬영한 영상 데이터를 이용하여 떨림의 움직임을 분석하여 파킨슨 병 질병을 진단하는 손떨림을 이용한 파킨슨병 질병의 진단 방법을 제공하는 것이다. 다만, 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하"}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 기술적 과제를 달성하기 위하여, 본 발명에 의한 손떨림을 이용한 파킨슨병 질병의 진단 방법은 사용자 가 수집모드에 따라 손에 사용자 단말을 파지하여 상기 사용자가 측정용 이미지를 촬영한 영상 데이터를 생성하 는 제1 단계; 상기 사용자 단말에서 생성된 영상 데이터에 기초하여 상기 사용자가 상기 사용자 단말을 파지한 손의 궤적을 추적하여 신호를 생성하는 제2 단계; 상기 사용자 단말이 상기 신호에서 복수의 떨림 특징을 추출 하는 제3 단계; 및 진단수단이 상기 복수의 떨림 특징에 기초하여 상기 사용자의 파킨슨병 질병을 진단하는 제4 단계;를 포함하는 것을 특징으로 하는 손떨림을 이용한 파킨슨병 질병의 진단 방법이 제공된다. 또한 바람직하게는 상기 사용자 단말은 상기 영상 데이터를 생성하기 위한 카메라를 포함하고, 파킨슨병 질병을 진단하기 위한 어플리케이션이 내장된 스마트폰이고, 상기 어플리케이션은 상기 진단수단을 포함하는 것을 특징 으로 한다. 또한 바람직하게는 상기 수집모드는 상기 사용자 단말이 상기 사용자의 한 손에 파지되어 정지하였을 때 상기 영상 데이터를 수집하는 한손 정지 모드; 상기 사용자 단말이 상기 사용자의 한 손에 파지되어 수직으로 움직일 때 상기 영상 데이터를 수집하는 한손 수직 모드; 상기 사용자 단말이 상기 사용자의 한 손에 파지되어 수평으 로 움직일 때 상기 영상 데이터를 수집하는 한손 수평 모드; 상기 사용자 단말이 상기 사용자의 양손에 파지되 어 정지할 때 상기 영상 데이터를 수집하는 양손 정지 모드; 상기 사용자 단말이 상기 사용자의 양손에 파지되 어 수직으로 움직일 때 상기 영상 데이터를 수집하는 양손 수직 모드; 및 상기 사용자 단말이 상기 사용자의 양 손에 파지되어 수평으로 움직일 때 상기 영상 데이터를 수집하는 양손 수평 모드; 중 적어도 어느 하나인 것을특징으로 한다. 또한 바람직하게는 상기 제2 단계는 상기 영상 데이터에서 각각의 프레임에 대한 이미지를 추출하는 단계; 상기 추출된 이미지에 대해 모서리 추정을 수행하여 인접한 프레임 사이에 상기 모서리의 대응점을 구하는 단계; 및 호모그래피 매트릭스의 병진 구성요소에서 궤적을 추적하는 단계;를 포함하는 것을 특징으로 한다. 또한 바람직하게는 상기 제3 단계는 상기 신호를 고역통과 필터 및 저역통과 필터를 포함하는 대역통과 필터에 통과시켜 고역통과 필터링된 신호와 저역통과 필터링된 신호가 생성되는 제3-1 단계; 상기 고역통과 필터링된 신호에서 동질성, 피치, 전력 및 엔트로피 중 적어도 하나를 포함하는 떨림 특징이 추출되는 제3-2 단계; 및 상 기 고역통과 필터링된 신호와 상기 저역통과 필터링된 신호에서 각도, 속도 및 코사인 중 적어도 하나를 포함하 는 떨림 특징이 추출되는 제3-3 단계;를 포함하는 것을 특징으로 한다. 또한 바람직하게는 상기 각도는 궤적의 방향을 측정하기 위해 xy좌표에서 고유 벡터를 얻는 단계; 상기 고유 벡 터의 x축과 y축 중 고유값이 더 큰 축을 주축(Principal Axis)으로 하는 단계; 및 상기 xy좌표와 상기 주축에 기초하여 상기 각도가 계산되는 단계;를 포함하여 생성되는 것을 특징으로 한다. 또한 바람직하게는 상기 동질성은 이동방향의 일관성을 측정하기 위해 상기 복수의 고유값들을 이용하여 하기 수학식 1에 기초하여 계산되는 것을 특징으로 한다. [수학식 1] λ1/(λ2+λ1) (상기 수학식 1에서, λ1은 x축 고유값 및 y축 고유값 중 더 큰 값이고, λ2는 x축 고유값 및 y축 고유값 중 작 은 값이다.) 또한 바람직하게는 상기 피치는 상기 고역통과 필터링된 신호의 복수의 xy좌표값들을 상기 주축에 투영하여 1차 원 신호를 생성하하는 단계; 및 자기 상관에 기초한 방법으로 생성된 상기 1차원 신호의 기본 주파수의 피치인 상기 피치를 생성하는 단계;를 포함하여 생성되는 것을 특징으로 한다. 또한 바람직하게는 상기 전력은 상기 1차원 신호를 푸리에 변환하여 전력 스팩트럼을 생성하는 단계; 및 상기 전력 스팩트럼의 합산값인 상기 전력을 생성하는 단계;를 포함하여 생성되는 것을 특징으로 한다. 또한 바람직하게는 상기 엔트로피는 상기 신호의 주파수 성분 양을 나타내는 것을 특징으로 한다. 또한 바람직하게는 상기 속도는 상기 영상 데이터의 인접한 서로 다른 두 프레임의 대응점의 위치 차이를 상기 두 프레임이 생성되는 시간 간격으로 나눈 값인 것을 특징으로 한다. 또한 바람직하게는 상기 코사인 떨림 특징은 상기 고역통과 필터링된 신호의 상기 주축과 상기 저역통과 필터링 된 신호와 상기 주축의 내적으로 계산되는 것을 특징으로 한다. 또한 바람직하게는 상기 진단수단은 인공지능 학습 알고리즘을 이용하여 파킨슨병 질병을 판단하는 것을 특징으 로 한다."}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일실시예에 따르면, 떨림 측정을 위한 어플리케이션이 내장된 스마트폰으로 촬영한 영상 데이터를 이 용하여 떨림의 움직임을 분석하여 파킨슨병 질병을 진단할 수 있다. 다만, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효"}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "과들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명에 관한 설명은 구조적 내지 기능적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설명된 실시예에 의하여 제한되는 것으로 해석 되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가지 형태를 가질 수 있으므로 본 발명의 권리 범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 또한, 본 발명에서 제시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미는 아 니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해되어서는 아니 될 것이다. 본 발명에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에 는, 그 다른 구성요소에 직접적으로 연결될 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어 야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\" 또는 \"가지다\" 등의 용어는 설시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관 련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한 이 상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. 도 1은 본 발명에 따른 손떨림을 이용한 파킨슨병 질병의 진단 방법을 도시한 순서도이고, 도 2는 본 발명에 따 른 손떨림을 이용한 파킨슨병 질병의 진단 방법의 제1 단계를 도시한 도면이고, 도 3은 본 발명에 따른 손떨림 을 이용한 파킨슨병 질병의 진단 방법의 사용자 단말을 도시한 도면이다. 도 1 내지 도 3을 참조하면, 제1 단계(S100)는 사용자가 벽면에 마련된 측정용 이미지에서 바람직하게 는 1.5m 떨어진 위치에서 의자에 앉아 수집모드에 따라 사용자 단말을 이용하여 측정용 이미지를 촬영 하여 영상 데이터를 생성할 수 있다. 이때, 측정용 이미지는 바람직하게는 복수의 흰색과 검정색의 정사각 형이 교차로 위치되어 전체적으로 체스판의 형태일 수 있다. 그리고, 사용자 단말은 영상 데이터를 생성하 기 위한 카메라(미도시)를 포함하고, 파킨슨병 질병을 진단하기 위한 어플리케이션(미도시)이 내장된 스마트폰 일 수 있다. 또한, 수집모드는 사용자 단말이 사용자의 한 손에 파지되어 정지하여 영상 데이터를 수집 하는 한손 정지 모드; 사용자 단말이 사용자의 한 손에 파지되어 수직으로 움직이며 영상 데이터를 수집하는 한손 수직 모드; 사용자 단말이 사용자의 한 손에 파지되어 수평으로 움직이며 영상 데이터를 수집하는 한손 수평 모드; 사용자 단말이 사용자의 양손에 파지되어 정지하여 영상 데이터를 수집하는 양손 정지 모드; 사용자 단말이 사용자의 양손에 파지되어 수직으로 움직이며 영상 데이터를 수집하는 양손 수직 모드; 및 사용자 단말이 사용자의 양손에 파지되어 수평으로 움직이며 영상 데이터를 수집하 는 양손 수평 모드; 중 어느 하나일 수 있다. 제2 단계(S200)는 영상 데이터에서 각각의 프레임에 대한 이미지를 추출하고, 추출된 이미지에 대해 모서리 추 정을 수행하여 인접한 프레임 사이에 상기 모서리의 대응점을 구하며, 호모그래피 매트릭스의 병진 구성요소에 서 궤적을 추적할 수 있다. 여기서, 한 평면을 다른 평면에 투영시켰을때 투영된 대응점들 사이에서 일정한 변 환관계가 성립하는데, 이 변환관계를 호모그래피라 부른다. 그리고, 호모그래피는 3×3 행렬로 표현되며, 대응 점들의 동차좌표 표현에 대해 성립하는 변환관계로, 한 평면 위의 점들이 다른 평면 위의 점들로 각각 투영되는 경우 이들 대응점들 사이에서는 유일한 호모그래피 메트릭스가 존재할 수 있다. 제3 단계(S300)는 신호를 복수의 대역통과 필터에 통과시켜 고역통과 필터링된 신호에서 각도, 동질성, 피치, 전력, 엔트로피 및 속도를 포함하는 떨림 특징이 추출되고, 저역통과 필터링된 신호에서 각도 떨림 특징이 추출 되며, 고역통과 필터링된 신호와 저역통과 필터링된 신호에 기초하여 코사인 떨림 특징이 추출될 수 있다. 여기 서, 고역통과 필터는 바람직하게는 4Hz의 하이컷 필터이고, 저역통과 필터는 바람직하게는 4Hz의 로우컷 필터일 수 있다. 그리고, 떨림 특징 중 각도는 궤적의 방향을 측정하기 위해 xy좌표에서 고유 벡터를 얻고, x축과 y축 중 고유값이 큰 축을 주축으로 하며, xy좌표와 상기 주축에 기초하여 계산되는 떨림 특징이고, 동질성은 이동방 향의 일관성을 측정하기 위해 상기 x축의 고유값 및 상기 y축의 고유값을 이용하여 하기 수학식 1에 기초하여 계산되는 떨림 특징이이다. 수학식 1"}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(상기 수학식 1에서, λ1은 고유값 중 큰 값이고, λ2는 고유값 중 작은 값이다.) 그리고, 피치는 상기 x축의 신호와 상기 y축의 신호를 상기 주축에 투영하여 1차원 신호를 생성하고, 자기 상관 에 기초한 방법으로 생성된 상기 1차원 신호의 기본 주파수를 생성하는 떨림 특징이고, 전력은 하기 수학식 2에 기초하여 상기 신호를 푸리에 변환하여 전력 스팩트럼을 생성하고, 생성된 상기 전력 스팩트럼을 합하여 상기 전력을 생성하는 떨림 특징이며, 엔트로피는 혼합된 주파수 성분의 양을 나타내는 떨림 특징이고, 속도는 상기 영상 데이터의 인접한 서로 다른 두 프레임의 대응점의 위치 차이인 떨림 특징이며, 코사인은 상기 고역통과 필 터링된 신호와 상기 주축 또는 상기 저역통과 필터링된 신호와 상기 주축의 내적으로 계산되는 떨림 특징일 수 있다. 수학식 2"}
{"patent_id": "10-2023-0038002", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "(상기 수학식 2에서, Pi는 i번째 주파수에서의 전력이고, P는 모든 주파수에서의 전력의 합이다.) 본 발명에 의한 파킨슨병 질병의 진단 방법의 성능을 검증하기 위해 테스트를 진행하였다. 실험예 1: 파킨슨병 환자의 떨림 동작 파킨슨병 환자의 떨림 동작을 흰색과 검은색의 복수의 10cm×10cm 정사각형이 체스판 형태로 교차되어 마련된 가로 1.5m, 세로 1m의 측정용 이미지로부터 1.5m 거리에 떨어진 거리에서 1220만 화소 카메라가 내장된 삼성 갤 럭시 S20을 이용하여 30fps로 측정용 이미지를 촬영하여 각각의 수집모드에 대한 떨림 신호를 생성하여 파킨슨 병 질병을 진단해 보았다. 이때, 파킨슨병 환자의 수는 55명이며, 대조군은 48명이다. 각 환자에 대해서 왼손, 오른손 각각 정지모드, 수직모드, 수평모드로 영상 데이터를 수집하였다. 영상 데이터에서 각각의 프레임에 대한 이미지를 추출하고, 추출된 이미지에 대해 모서리 추정을 수행하여 인접 한 프레임 사이에 상기 모서리의 대응점을 구한다. 대응점들로부터 인접한 프레임 사이에서 호모그래피 매트릭 스를 구한다. 여기서, 한 평면을 다른 평면에 투영시켰을때 투영된 대응점들 사이에서 일정한 변환관계가 성립 하는데, 이 변환관계를 호모그래피라 부른다. 그리고, 호모그래피는 3×3 행렬로 표현되며, 대응점들의 동차좌 표 표현에 대해 성립하는 변환관계로, 한 평면 위의 점들이 다른 평면 위의 점들로 각각 투영되는 경우 이들 대 응점들 사이에서는 유일한 호모그래피 메트릭스가 존재할 수 있다. 호모그래피 메드릭스는 영상의 이동 정보를 포함하고 있으므로 두 프레임사이에 카메라가 움직인 궤적을 구한다. 도 4는 손 궤적을 추적한 신호를 도시한 그래프이다. 도 4를 참조하면, 임의의 수직모드를 프레임율을 30fps로 약 12초 촬영한 영상 데이터에 대해 궤적을 추출한 결 과를 확인 할 수 있다. 여기서, 검은색과 회색 실선은 각각 궤적의 x, y 좌표의 움직임을 나타낸다. 도 5는 손 궤적을 추적한 신호를 xy좌표계에 도시한 그래프이다. 도 5를 참조하면, 동그란 점은 각 프레임에서의 손 궤적을 추적한 산호의 xy위치를 나타내고 인접한 프레임 사 이는 직선으로 연결하였다. 여기서, 회색 직선은 상기 방법으로 계산된 주축을 나타낸다. 도 6은 고역통과 필터링된 손 궤적을 추적한 신호를 도시한 그래프이다. 도 6을 참조하면, 검은색과 회색 실선은 각각 고역통과 필터링된 손 궤적을 추적한 신호의 x, y 좌표의 움직임 을 나타낸다. 도 7은 고역통과 필터링된 손 궤적을 추적한 신호를 xy좌표계에 도시한 그래프이다. 도 7을 참조하면, 동그란 점은 각 프레임에서의 고역통과 필터링된 손 궤적을 추적한 신호의 x, y 좌표를 나타 내며 인접된 프레임사이의 점은 직선으로 연결하였다. 회색 직선은 상기 방법으로 구한 주축이다. 동질성은 상 기 수학식 1에 기초하여 계산하는데 이 경우 0.89가 된다. 저역통과 필터링을 통한 신호에서도 마찬가지 방법으 로 주축을 구할 수 있으므로, 코사인 특징은 이 주축과 상기 고역통과 필터링 신호에서 구한 주축과 사이의 내 적으로 계산한다. 도 8은 고역통과 필터링된 손 궤적을 추적한 신호를 주축으로 투영한 1차원 신호를 도시한 그래프이다. 도 8을 참조하면, 자기상관 방법으로 구해지는 피치는 5.2Hz이다. 도 9는 전력 스팩트럼을 도시한 그래프이다. 도 9를 참조하면, 피치를 푸리에 변환하여 구해지는 전력 스팩트럼은 4.7이다. 정상과 파킨슨 환자를 구별하는 랜덤포리스트 모델을 10-폴드 교차검증 방법으로 학습하고 시험하였다. 수집 모 드에 따라 정확도는 달라지는데, 정지모드로 수집한 데이터에 대한 진단 정확도는 83.5% 이동모드(수직모드와 수평모드를 합한 것)의 정확도는 73.8%이며 모든 모드를 사용한 경우 85.4%이다. 도 10은 본 발명에 따른 손떨림을 이용한 파킨슨병 질병의 진단 방법의 진단정확도를 도시한 ROC(Receiver Operating Curve)이다. 도 10을 참조하면, 정지모드(도 16의 HD), 이동모드(MOV), 모든 모드(Combi) 각각의 ROC에 대한 AUC(Area Under Curve)는 각각 0.887, 0.835, 0.908이다. 상술한 바와 같이 개시된 본 발명의 바람직한 실시예들에 대한 상세한 설명은 당업자가 본 발명을 구현하고 실 시할 수 있도록 제공되었다. 상기에서는 본 발명의 바람직한 실시예들을 참조하여 설명하였지만, 해당 기술 분 야의 숙련된 당업자는 본 발명의 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시 킬 수 있음을 이해할 수 있을 것이다. 예를 들어, 당업자는 상술한 실시예들에 기재된 각 구성을 서로 조합하는 방식으로 이용할 수 있다. 따라서, 본 발명은 여기에 나타난 실시형태들에 제한되려는 것이 아니라, 여기서 개 시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다. 본 발명은 본 발명의 정신 및 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있다. 따 라서, 상기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서 의 모든 변경은 본 발명의 범위에 포함된다. 본 발명은 여기에 나타난 실시형태들에 제한되려는 것이 아니라, 여기서 개시된 원리들 및 신규한 특징들과 일치하는 최광의 범위를 부여하려는 것이다. 또한, 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함할 수 있다."}
{"patent_id": "10-2023-0038002", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에서 첨부되는 다음의 도면들은 본 발명의 바람직한 실시예를 예시하는 것이며, 후술하는 발명의 상세 한 설명과 함께 본 발명의 기술사상을 더욱 이해시키는 역할을 하는 것이므로, 본 발명은 그러한 도면에 기재된 사항에만 한정되어서 해석되어서는 아니 된다. 도 1은 본 발명에 따른 손떨림을 이용한 파킨슨병 질병의 진단 방법을 도시한 순서도.도 2는 본 발명에 따른 손떨림을 이용한 파킨슨병 질병의 진단 방법의 제1 단계를 도시한 도면. 도 3은 본 발명에 따른 손떨림을 이용한 파킨슨병 질병의 진단 방법의 진단수단을 도시한 도면. 도 4는 손 궤적을 추적한 신호를 도시한 그래프. 도 5는 손 궤적을 추적한 신호를 xy좌표계에 도시한 그래프. 도 6은 고역통과 필터링된 손 궤적을 추적한 신호를 도시한 그래프. 도 7은 고역통과 필터링된 손 궤적을 추적한 신호를 xy좌표계에 도시한 그래프. 도 8은 고역통과 필터링된 손 궤적을 추적한 신호를 주축으로 투영한 1차원 신호를 도시한 그래프. 도 9는 전력 스팩트럼을 도시한 그래프. 도 10은 본 발명에 따른 손떨림을 이용한 파킨슨병 질병의 진단 방법의 진단정확도를 도시한 ROC(Receiver Operating Curve)."}
