{"patent_id": "10-2023-7016870", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0091953", "출원번호": "10-2023-7016870", "발명의 명칭": "무선 통신 시스템에서 자발적 트래픽을 위한 데이터 유닛 전송 방법 및 장치", "출원인": "엘지전자 주식회사", "발명자": "이선영"}}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 제1 논리 채널 및 제2 논리 채널로 구성된 무선 노드에 의한 데이터 전송 수행을 위한 방법에 있어서, 상기 방법은:상기 제1 논리 채널의 제1 상향링크 데이터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계;피어 무선 노드로부터 상향링크 자원을 수신하는 단계;상기 제2 상향링크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단계; 및상기 상향링크 자원을 기반으로 하여 상기 피어 무선 노드로 상기 MAC PDU를 전송하는 단계를 포함하고,상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함하는, 방법."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 임계치보다 작은 상기 제1 논리 채널의 BS를 기반으로 하여, 상기 MAC PDU가 생성되어상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 모두를 포함하는, 방법."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 상기 제2 상향링크 데이터의 우선권은 상기 제1 상향링크 데이터의 우선권보다 낮은, 방법."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 제2 상향링크 데이터는 인공지능 (AI) 알고리즘 업데이트를 위해 사용될 훈련데이터 세트에 대한 데이터를 포함하는, 방법."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 무선 노드는 AI 알고리즘 업데이트를 위해 사용될 훈련 데이터 세트에 대한 제3 상향링크 데이터를 나르는 제3 논리 채널로 더 구성되고,제3 상량링크 데이터와 관련된 임계치는 상기 제2 상향링크 데이터와 관련된 상기 임계치와는 별도로 구성되는,방법."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "무선 통신 시스템에서 무선 노드에 있어서, 상기 무선 노드는 제1 논리 채널 및 제2 논리 채널로 구성되고, 상기 무선 노드는:적어도 하나의 송수신기;적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 동작 가능하게 연결되고, 실행될 때 상기 적어도 하나의 프로세서로 하여금 동작들을 수행하도록 하는 명령어들을 저장하는 적어도 하나의 컴퓨터 메모리를 포함하고, 상기 동작들은:상기 제1 논리 채널의 제1 상향링크 데이터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계;피어 무선 노드로부터 상향링크 자원을 수신하는 단계;상기 제2 상향링크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단계; 및공개특허 10-2023-0091953-3-상기 상향링크 자원을 기반으로 하여 상기 피어 무선 노드로 상기 MAC PDU를 전송하는 단계를 포함하고,상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함하는, 상기 무선 노드."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제61 항에 있어서, 상기 임계치보다 작은 상기 제1 논리 채널의 BS를 기반으로 하여, 상기 MAC PDU가 생성되어상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 모두를 포함하는, 상기 무선 노드."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서, 상기 제2 상향링크 데이터의 우선권은 상기 제1 상향링크 데이터의 우선권보다 낮은, 상기 무선 노드."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6 항에 있어서, 상기 제2 상향링크 데이터는 인공지능 (AI) 알고리즘 업데이트를 위해 사용될 훈련데이터 세트에 대한 데이터를 포함하는, 상기 무선 노드."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4 항에 있어서, 상기 무선 노드는 AI 알고리즘 업데이트를 위해 사용될 훈련 데이터 세트에 대한 제3 상향링크 데이터를 나르는 제3 논리 채널로 더 구성되고,제3 상량링크 데이터와 관련된 임계치는 상기 제2 상향링크 데이터와 관련된 상기 임계치와는 별도로 구성되는,상기 무선 노드."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 논리 채널 및 제2 논리 채널로 구성된 무선 노드를 위한 장치에 있어서, 상기 장치는:적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 동작 가능하게 연결되고, 실행될 때 상기 적어도 하나의 프로세서로 하여금 동작들을 수행하도록 하는 명령어들을 저장하는 적어도 하나의 컴퓨터 메모리를 포함하고, 상기 동작들은:상기 제1 논리 채널의 제1 상향링크 데이터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계;피어 무선 노드로부터 상향링크 자원을 수신하는 단계;상기 제2 상향링크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단계; 및상기 상향링크 자원을 기반으로 하여 상기 피어 무선 노드로 상기 MAC PDU를 전송하는 단계를 포함하고,상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함하는, 상기 장치."}
{"patent_id": "10-2023-7016870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "컴퓨터 판독가능한 저장 매체에 있어서, 상기 컴퓨터 판독가능한 저장 매체는 적어도 하나 이상의 프로세서에의해 실행될 때 상기 적어도 하나 이상의 프로세서로 하여금 제1 논리 채널 및 제2 논리 채널로 구성된 무선 노드를 위한 동작들을 수행하도록 하는 명령어들을 포함하는 적어도 하나 이상의 컴퓨터 프로그램을 저장하며, 상기 동작들은:상기 제1 논리 채널의 제1 상향링크 데이터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계;피어 무선 노드로부터 상향링크 자원을 수신하는 단계;상기 제2 상향링크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단계; 및공개특허 10-2023-0091953-4-상기 상향링크 자원을 기반으로 하여 상기 피어 무선 노드로 상기 MAC PDU를 전송하는 단계를 포함하고,상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함하는, 상기 컴퓨터 판독가능한 저장 매체."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 무선 통신 시스템에서 제1 논리 채널 및 제2 논리 채널로 구성된 무선 노드에 의한 데이터 전송 수행 을 위한 방법에 관한 것이다. 특히, 방법은 상기 제1 논리 채널의 제1 상향링크 데이터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계, 피어 무선 노드로부터 상향링크 자원을 수신하는 단계, 상기 제2 상향링 크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나 를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단계, 및 상기 상향링크 자원을 기반 으로 하여 상기 피어 무선 노드로 상기 MAC PDU를 전송하는 단계를 포함하고, 상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어 상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함한다."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무선 통신 시스템에 관한 것으로, 보다 상세하게는 무선 통신 시스템에서 자발적 트래픽을 위한 데이 터 유닛 전송 방법 및 이를 위한 장치에 관한 것이다."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "새로운 무선 통신 기술의 도입에 따라, 기지국이 소정 자원영역에서 서비스를 제공해야 하는 UE들의 개수가 증 가할 뿐만 아니라, 상기 기지국이 서비스를 제공하는 UE들과 전송/수신하는 데이터와 제어정보의 양이 증가하고 있다. 기지국이 UE(들)과의 통신에 이용 가능한 무선 자원의 양은 유한하므로, 기지국이 유한한 무선 자원을 이 용하여 상/하향링크 데이터 및/또는 상/하향링크 제어정보를 UE(들)로부터/에게 효율적으로 수신/전송하기 위한 새로운 방안이 요구된다. 특히, 딜레이/지연에 따라 성능이 중대하게 좌우되는 어플리케이션들이 증가하고 있다. 따라서 기존 시스템에서보다 딜레이/지연을 줄이기 위한 방안이 요구된다."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 무선 통신 시스템에서 자발적 트래픽을 위한 데이터 유닛 전송 방법 및 이를 위한 장치를 제 공하는 것을 목적으로 한다."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 대한 기술적 과제는 무선 통신 시스템에서 제1 논리 채널 및 제2 논리 채널로 구성된 무선 노드에 의 한 데이터 전송 수행을 위한 방법은 상기 제1 논리 채널의 제1 상향링크 데이터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계, 피어 무선 노드로부터 상향링크 자원을 수신하는 단계, 상기 제2 상향링크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단계, 및 상기 상향링크 자원을 기반으 로 하여 상기 피어 무선 노드로 상기 MAC PDU로 전송하는 단계를 포함하고, 상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어 상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함한다. 또한, 무선 통신 시스템에서 무선 노드가 제안되며, 상기 무선 노드는 제1 논리 채널 및 제2 논리 채널로 구성 되고, 상기 무선 노드는 적어도 하나의 송수신기; 적어도 하나의 프로세서, 및 상기 적어도 하나의 프로세서와 동작 가능하게 연결되고, 실행될 때 상기 적어도 하나의 프로세서로 하여금 동작들을 수행하도록 하는 명령어들 을 저장하는 적어도 하나의 컴퓨터 메모리를 포함하고, 상기 동작들은 상기 제1 논리 채널의 제1 상향링크 데이 터 및 상기 제2 논리 채널의 제2 상향링크 데이터를 획득하는 단계, 피어 무선 노드로부터 상향링크 자원을 수 신하는 단계, 상기 제2 상향링크 데이터와 관련된 임계치에 기반하여, 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 중 적어도 하나를 포함하는 매체 접속 제어 (MAC) 프로토콜 데이터 유닛 (PDU)을 생성하는 단 계, 및 상기 상향링크 자원을 기반으로 하여 상기 피어 무선 노드로 상기 MAC PDU로 전송하는 단계를 포함하고, 상기 임계치와 같거나 큰 상기 제1 논리 채널의 버퍼 사이즈 (BS)를 기반으로 하여, 상기 MAC PDU가 생성되어 상기 제2 상향링크 데이터 없이 상기 제1 상향링크 데이터를 포함한다. 바람직하게는, 상기 임계치보다 작은 상기 제1 논리 채널의 BS를 기반으로 하여, 상기 MAC PDU가 생성되어 상기 제1 상향링크 데이터 및 상기 제2 상향링크 데이터 모두를 포함한다. 바람직하게는, 상기 제2 상향링크 데이터의 우선권은 상기 제1 상향링크 데이터의 우선권보다 낮다. 바람직하게는, 상기 제2 상향링크 데이터는 인공지능 (AI) 알고리즘 업데이트를 위해 사용될 훈련데이터 세트에 대한 데이터를 포함한다. 더욱 바람직하게는, 상기 무선 노드는 AI 알고리즘 업데이트를 위해 사용될 훈련 데이터 세트에 대한 제3 상향 링크 데이터를 나르는 제3 논리 채널로 더 구성되고, 제3 상량링크 데이터와 관련된 임계치는 상기 제2 상향링 크 데이터와 관련된 상기 임계치와는 별도로 구성된다."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 실시예들에 따르면, UE가 원할 때만 자발적인 데이터 전송을 허용하는 것은 풍부한 정보가 알 고리즘 개선의 핵심 성과 지표(KPI)인 인공 지능을 활용하는 영역에서 더 많은 비즈니스 기회를 허용하는 것일 수 있다. 본 발명에서 얻을 수 있는 효과는 상술한 효과에 의해 제한되지 않을 수 있다. 그리고, 언급되지 않은 다른 효 과들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 하기의 설명으로부터 명확하게 이해될 수 있다."}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세의 예시적인 구현들을 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 서술될 상세한 설명은 본 명세의 예시적인 구현들을 설명하고자 하는 것이며, 본 명세에 따라 실시될 수 있는 유일한 구현 형태들을 나타내고자 하는 것이 아니다. 이하의 상세한 설명은 본 명세의 완전한 이해를 제공하기 위해서 구체적 세부사항들을 포함한다. 그러나 당업자에게 본 명세가 이러한 구체적 세부사항 없이도 실시될 수 있음이 명백할 것이다. 이하의 기술은 CDMA(code division multiple access), FDMA(frequency division multiple access), TDMA(time division multiple access), OFDMA(orthogonal frequency division multiple access), SC-FDMA(single carrier frequency division multiple access) 등과 같은 다양한 무선 통신 시스템에 사용될 수 있다. CDMA는 UTRA(universal terrestrial radio access)나 CDMA2000과 같은 무선 기술로 구현될 수 있다. TDMA는 GSM(global system for mobile communications)/GPRS(general packet radio service)/EDGE(enhanced data rates for GSM evolution)와 같은 무선 기술로 구현될 수 있다. OFDMA는 IEEE(institute of electrical and electronics engineers) 802.11(Wi-Fi), IEEE 802.16(WiMAX), IEEE 802-20, E-UTRA(evolved UTRA) 등과 같은 무선 기술로 구현될 수 있다. IEEE 802.16m은 IEEE 802.16e의 진화로, IEEE 802.16e에 기반한 시스템과의 하위호환성(backward compatibility)를 제공한다. UTRA는 UMTS(universal mobile telecommunications system)의 일 부이다. 3GPP(3rd generation partnership project) LTE(long term evolution)은 E-UTRA(evolved-UMTS terrestrial radio access)를 사용하는 E-UMTS(evolved UMTS)의 일부로써, 하향링크에서 OFDMA를 채용하고 상 향링크에서 SC-FDMA를 채용한다. LTE-A(advanced)는 3GPP LTE의 진화이다. 설명의 편의를 위하여, 본 명세의 구현들은 주로 3GPP 기반 무선 통신 시스템에 관하여 설명된다. 그러나. 본 명세의 기술적인 특징들은 이에 한정되지 않는다. 예를 들어, 다음의 상세한 설명은3GPP 기반 무선 통신 시스템 에 대응하는 이동 통신 시스템에 기초하여 서술되지만 3GPP 기반 무선 통신 시스템에 한정되지 않는 본 명세의 양상들은 다른 이동 통신 시스템들에 적용될 수 있다. 본 명세에서 사용된 용어 및 기술 중에서 특별히 언급되 지 않은 용어 및 기술에 대하여는 본 명세가 공개되기 전의 무선 통신 표준 문서를 참고할 수 있다. 예를 들어, 다음의 문서가 참고될 수 있다. 3GPP LTE - 3GPP TS 36.211: Physical channels and modulation - 3GPP TS 36.212: Multiplexing and channel coding - 3GPP TS 36.213: Physical layer procedures - 3GPP TS 36.214: Physical layer; Measurements - 3GPP TS 36.300: Overall description - 3GPP TS 36.304: User Equipment (UE) procedures in idle mode - 3GPP TS 36.314: Layer 2 - Measurements - 3GPP TS 36.321: Medium Access Control (MAC) protocol - 3GPP TS 36.322: Radio Link Control (RLC) protocol - 3GPP TS 36.323: Packet Data Convergence Protocol (PDCP) - 3GPP TS 36.331: Radio Resource Control (RRC) protocol 3GPP NR - 3GPP TS 38.211: Physical channels and modulation - 3GPP TS 38.212: Multiplexing and channel coding - 3GPP TS 38.213: Physical layer procedures for control - 3GPP TS 38.214: Physical layer procedures for data - 3GPP TS 38.215: Physical layer measurements - 3GPP TS 38.300: Overall description - 3GPP TS 38.304: User Equipment (UE) procedures in idle mode and in RRC inactive state - 3GPP TS 38.321: Medium Access Control (MAC) protocol - 3GPP TS 38.322: Radio Link Control (RLC) protocol - 3GPP TS 38.323: Packet Data Convergence Protocol (PDCP) - 3GPP TS 38.331: Radio Resource Control (RRC) protocol - 3GPP TS 37.324: Service Data Adaptation Protocol (SDAP) - 3GPP TS 37.340: Multi-connectivity; Overall description 본 명세에 있어서, UE는 고정되거나 이동성을 가질 수 있으며, 기지국(base station, BS)과 통신하여 사용자데 이터 및/또는 각종 제어정보를 송수신하는 각종 기기들이 이에 속한다. UE는 (Terminal Equipment), MS(Mobile Station), MT(Mobile Terminal), UT(User Terminal), SS(Subscribe Station), 무선기기(wireless device),PDA(Personal Digital Assistant), 무선 모뎀(wireless modem), 휴대기기(handheld device) 등으로 불릴 수 있 다. 또한, 본 명세에 있어서, BS는 일반적으로 UE 및/또는 다른 BS와 통신하는 고정국(fixed station)을 말하며, UE 및 타 BS와 통신하여 각종 데이터 및 제어정보를 교환한다. BS는 ABS(Advanced Base Station), NB(Node-B), eNB(evolved-NodeB), BTS(Base Transceiver System), 접속 포인트(Access Point), PS(Processing Server) 등 다른 용어로 불릴 수 있다. 특히, UMTS의 BS는 NB라 하고, EPC/LTE의 BS는 eNB라 하고, NR(new radio) 시스템의 BS는 gNB이라 한다. 본 명세에서 노드(node)라 함은 UE와 통신하여 무선 신호를 전송/수신할 수 있는 고정된 지점(point)을 말한다. 다양한 형태의 eNB 들이 그 명칭에 관계없이 노드로서 이용될 수 있다. 예를 들어, BS, NB, eNB, 피코-셀 eNB(PeNB), 홈 eNB(HeNB), 릴레이(relay), 리피터(repeater) 등이 노드가 될 수 있다. 또한, 노드는 eNB 가 아 니어도 될 수 있다. 예를 들어, 무선 리모트 헤드(radio remote head, RRH), 무선 리모트 유닛(radio remote unit, RRU)가 될 수 있다. RRH, RRU 등은 일반적으로 eNB의 전력 레벨(power level) 더욱 낮은 전력 레벨을 갖 는다. RRH 혹은 RRU 이하, RRH/RRU)는 일반적으로 광 케이블 등의 전용 회선(dedicated line)으로 eNB에 연결 되어 있기 때문에, 일반적으로 무선 회선으로 연결된 eNB 들에 의한 협력 통신에 비해, RRH/RRU 와 eNB에 의한 협력 통신이 원활하게 수행될 수 있다. 일 노드에는 최소 하나의 안테나가 설치된다. 상기 안테나는 물리 안테 나를 의미할 수도 있으며, 안테나 포트, 가상 안테나, 또는 안테나 그룹을 의미할 수도 있다. 본 명세에서, \"셀\"이라는 용어는 하나 이상의 노드가 통신 시스템을 제공하는 지리적 영역을 지칭하거나, 혹은 무선 자원을 지칭할 수 있다. 지리적 영역의 \"셀\"은 노드가 반송파를 사용하여 서비스를 제공할 수 있는 커버리 지로 이해될 수 있으며 무선 자원(예를 들어, 시간-주파수 자원)으로서 \"셀\"은 반송파에 의하여 설정 (configure)되는 주파수 범위인 대역폭(BW)과 연관된다. 무선 자원과 연관된 \"셀\"은 하향링크 자원 및 상향링크 자원의 조합, 예를 들어 하향링크(DL) 구성 반송파 (component carrier, CC) 및 상향링크(UL) CC의 조합에 의 해 정의된다. 셀은 하향링크 자원에 의해서만 설정될 수 있거나 하향링크 자원과 상향링크 자원에 의해 설정될 수 있다. 노드가 유효한 신호를 전송할 수 있는 범위인 하향링크 커버리지와 UE로부터 유효한 신호를 수신할 수 있는 범위인 상향링크 커버리지는 해당 신호를 나르는 반송파에 의해 의존하므로 노드의 커버리지는 상기 노드 가 사용하는 무선 자원들의 \"셀\"의 커버리지와 연관되기도 한다. 따라서 \"셀\"이라는 용어는 때로는 노드에 의한 서비스의 커버리지를, 때로는 무선 자원들을, 때로는 상기 무선 자원들을 이용한 신호들 유효한 세기로 도달할 수 있는 범위를 의미하는 데 사용될 수 있다. 본 명세에서 물리 하향링크 제어 채널(physical downlink control channel, PDCCH) 및 물리 하향링크 공유 채 널(physical downlink shared channel, PDSCH)은 각각 하향링크 제어 정보(downlink control information, DCI)를 나르는 시간-주파수 자원들 또는 자원 요소(resource element, RE)들의 집합, 및 하향링크 데이터를 나 르는 시간-주파수 자원들 또는 RE들의 집합을 의미한다. 또한, 물리 상향링크 제어 채널(physical uplink control channel, PUCCH), 물리 상향링크 공유 채널(physical uplink shared channel, PUSCH) 및 물리 임의 접 속 채널(physical random access channel, PRACH)은 각각 상향링크 제어 정보(uplink control information, UCI)를 나르는 시간-주파수 자원들 또는 RE들의 집합, 상향링크 데이터를 나르는 시간-주파수 자원들 또는 RE들 의 집합 및 임의 접속 신호를 나르는 시간-주파수 자원들 또는 RE들의 집합을 의미한다. 반송파 집성(carrier aggregation, CA)에서, 두 개 이상의 CC가 집성된다. UE는 그 능력에 따라 하나 또는 다수 의 CC를 동시에 수신 또는 전송할 수 있다. CA가 연속 CC와 비 연속 CC 모두에 대해 지원된다. CA가 구성되면 UE만이 네트워크와 하나의 무선 자원 제어(radio resource control, RRC) 연결을 가진다. RRC 연결 수립/재 수 립/핸드오버에서, 하나의 서빙 셀은 비-접속 층(non-access stratum, NAS) 이동성 정보를 제공하고, RRC 연결 재수립/핸드오버에서 하나의 서빙 셀은 보안 입력을 제공한다. 이 셀을 1차 셀(primary cell, PCell)이라고 한 다. PCell은 1차 주파수에서 동작하는 셀이며, 이 주파수에서 UE는 초기 연결 수립 절차를 수행하거나 연결 재 수립 절차를 개시한다. UE 능력에 따라, 2차 셀(secondary cell, SCell)이 PCell과 함께 서빙 셀 세트를 형성 하도록 설정될 수 있다. SCell은 특수 셀에 더하여 추가의 무선 자원을 제공하는 셀이다. 따라서, UE에게 설정 된 서빙 셀 세트는 항상 하나의 PCell 및 하나 이상의 SCell로 구성된다. 듀얼 연결성(dual connectivity) 동작 을 위해, 특수 셀(special cell, SpCell)이라는 용어는 마스터 셀 그룹(master cell group, MCG)의 PCell 또는 2차 셀 그룹(secondary cell group, SCG)의 PSCell을 지칭한다. SpCell은 PUCCH 전송 및 경쟁 기반 임의의 접 속을 지원하며 항상 활성화된다. MCG는 마스터 노드와 관련된 서빙 셀 그룹으로서, SpCell (PCell) 및 선택적으 로 하나 이상의 SCell을 포함한다. SCG는 2차 노드와 관련된 서빙 셀의 서브 세트로서, 듀얼 연결성(dual connectivity, DC)로 설정된 UE에 대하여 PSCell 및 0개 이상의 SCell로 이루어진다. CA/DC로 설정되지 않은 RRC_CONNECTED의 UE에 대해서는 PCell로 이루어진 하나의 서빙 셀만이 존재한다. CA/DC로 설정된RRC_CONNECTED의 UE에 대해, \"서빙 셀\"이라는 용어는 SpCell(들) 및 모든 SCell들로 이루어진 셀 세트를 나타내 는 데 사용된다. MCG는 적어도 S1-MME를 종결(terminate)하는 마스터 BS와 연관된 서빙 셀들의 그룹이고, SCG는 UE를 위해 추가 적인 무선 자원을 제공하지만 마스터 BS는 아닌 2차 BS와 연관된 서빙 셀들의 그룹이다. SCG는 1차 SCell(primary Scell, PSCell)과 선택적으로 하나 이상의 SCell로 구성된다. DC에서, 2개의 MAC 엔티티, 즉 MCG를 위한 MAC 엔티티와 SCG를 위한 MAC 엔티티가 UE에서 설정된다. 각 MAC 엔티티는 PUCCH 전송 및 경쟁 기반 임의접속을 지원하는 서빙 셀로 RRC에 의해 설정된다. 본 명세에서, SpCell이라는 용어는 그러한 셀을 지칭하는 반면, SCell이라는 용어는 다른 서빙 셀들을 지칭한다. SpCell이라는 용어는 MAC엔티티가 MCG 또는 SCG에 각각 연관되는지 여부에 따라 MCG의 PCell 또는 SCG의 PSCell을 나타낸다. 본 명세서에서, 채널 모니터링은 채널의 복호 시도를 의미한다. 예를 들어, PDCCH 모니터링은 PDCCH(들) (또는 PDCCH 후보들)의 복호 시도를 의미한다. 본 명세서에서, \"C-RNTI\"는 셀 cell RNTI를 지칭하고, \"SI-RNTI\"는 시스템 정보 RNTI를 지칭하고, \"P-RNTI\"는 페이징 RNTI를 지칭하고, \"RA-RNTI\"는 임의 접속 RNTI를 지칭하고, \"SC-RNTI\"는 단일 셀 RNTI를 지칭하고, \"SL-RNTI\"는 사이드링크 RNTI를 지칭하고, \"SPS C-RNTI\"는 반-지속적(semi-persistent) 스케줄링 C-RNTI를 지 칭하고, \"CS-RNTI\"는 설정된(configured) 스케줄링 RNTI를 지칭한다. 도 1은 본 발명에 적용되는 통신 시스템을 예시한다. 5G의 세 가지 주요 요구 사항 영역은 개선된 모바일 광대역 (Enhanced Mobile Broadband, eMBB) 영역, 다량의 머신 타입 통신 (massive Machine Type Communication, mMTC) 영역 및 초-신뢰 및 저 지연 통신 (Ultra-reliable and Low Latency Communications, URLLC) 영역을 포함한다. 일부 사용 예(Use Case)는 최적화를 위해 다수의 영역들이 요구될 수 있고, 다른 사용 예는 단지 하나의 핵심 성능 지표 (Key Performance Indicator, KPI)에만 포커싱될 수 있다. 5G는 이러한 다양한 사용 예들을 유연하 고 신뢰할 수 있는 방법으로 지원하는 것이다. eMBB는 기본적인 모바일 인터넷 액세스를 훨씬 능가하게 하며, 풍부한 양방향 작업, 클라우드 또는 증강 현실에 서 미디어 및 엔터테인먼트 애플리케이션을 커버한다. 데이터는 5G의 핵심 동력 중 하나이며, 5G 시대에서 처음 으로 전용 음성 서비스를 볼 수 없을 수 있다. 5G에서, 음성은 단순히 통신 시스템에 의해 제공되는 데이터 연 결을 사용하여 응용 프로그램으로서 처리될 것이 기대된다. 증가된 트래픽 양(volume)을 위한 주요 원인들은 콘 텐츠 크기의 증가 및 높은 데이터 전송률을 요구하는 애플리케이션 수의 증가이다. 스트리밍 서비스 (오디오 및 비디오), 대화형 비디오 및 모바일 인터넷 연결은 더 많은 장치가 인터넷에 연결될수록 더 널리 사용될 것이다. 이러한 많은 응용 프로그램들은 사용자에게 실시간 정보 및 알림을 푸쉬하기 위해 항상 켜져 있는 연결성이 필 요하다. 클라우드 스토리지 및 애플리케이션은 모바일 통신 플랫폼에서 급속히 증가하고 있으며, 이것은 업무 및 엔터테인먼트 모두에 적용될 수 있다. 그리고, 클라우드 스토리지는 상향링크 데이터 전송률의 성장을 견인 하는 특별한 사용 예이다. 5G는 또한 클라우드의 원격 업무에도 사용되며, 촉각 인터페이스가 사용될 때 우수한 사용자 경험을 유지하도록 훨씬 더 낮은 단-대-단(end-to-end) 지연을 요구한다. 엔터테인먼트 예를 들어, 클라 우드 게임 및 비디오 스트리밍은 모바일 광대역 능력에 대한 요구를 증가시키는 또 다른 핵심 요소이다. 엔터테 인먼트는 기차, 차 및 비행기와 같은 높은 이동성 환경을 포함하는 어떤 곳에서든지 스마트폰 및 태블릿에서 필 수적이다. 또 다른 사용 예는 엔터테인먼트를 위한 증강 현실 및 정보 검색이다. 여기서, 증강 현실은 매우 낮 은 지연과 순간적인 데이터 양을 필요로 한다. 또한, 가장 많이 예상되는 5G 사용 예 중 하나는 모든 분야에서 임베디드 센서를 원활하게 연결할 수 있는 기능 즉, mMTC에 관한 것이다. 2020년까지 잠재적인 IoT 장치들은 204 억 개에 이를 것으로 예측된다. 산업 IoT는 5G 가 스마트 도시, 자산 추적(asset tracking), 스마트 유틸리티, 농업 및 보안 인프라를 가능하게 하는 주요 역 할을 수행하는 영역 중 하나이다. URLLC는 주요 인프라의 원격 제어 및 자체-구동 차량(self-driving vehicle)과 같은 초 신뢰 / 이용 가능한 지 연이 적은 링크를 통해 산업을 변화시킬 새로운 서비스를 포함한다. 신뢰성과 지연의 수준은 스마트 그리드 제 어, 산업 자동화, 로봇 공학, 드론 제어 및 조정에 필수적이다. 5G는 초당 수백 메가 비트에서 초당 기가 비트로 평가되는 스트림을 제공하는 수단으로 FTTH (fiber-to-the- home) 및 케이블 기반 광대역 (또는 DOCSIS)을 보완할 수 있다. 이러한 빠른 속도는 가상 현실과 증강 현실뿐 아니라 4K 이상(6K, 8K 및 그 이상)의 해상도로 TV를 전달하는데 요구된다. VR(Virtual Reality) 및AR(Augmented Reality) 애플리케이션들은 거의 몰입형(immersive) 스포츠 경기를 포함한다. 특정 응용 프로그램 은 특별한 네트워크 설정이 요구될 수 있다. 예를 들어, VR 게임의 경우, 게임 회사들이 지연을 최소화하기 위 해 코어 서버를 네트워크 오퍼레이터의 에지 네트워크 서버와 통합해야 할 수 있다. 자동차(Automotive)는 차량에 대한 이동 통신을 위한 많은 사용 예들과 함께 5G에 있어 중요한 새로운 동력이 될 것으로 예상된다. 예를 들어, 승객을 위한 엔터테인먼트는 동시의 높은 용량과 높은 이동성 모바일 광대역을 요구한다. 그 이유는 미래의 사용자는 그들의 위치 및 속도와 관계없이 고품질의 연결을 계속해서 기대하기 때 문이다. 자동차 분야의 다른 활용 예는 증강 현실 대시보드이다. 이는 운전자가 앞면 창을 통해 보고 있는 것 위에 어둠 속에서 물체를 식별하고, 물체의 거리와 움직임에 대해 운전자에게 말해주는 정보를 겹쳐서 디스플레 이 한다. 미래에, 무선 모듈은 차량들 간의 통신, 차량과 지원하는 인프라구조 사이에서 정보 교환 및 자동차와 다른 연결된 디바이스들(예를 들어, 보행자에 의해 수반되는 디바이스들) 사이에서 정보 교환을 가능하게 한다. 안전 시스템은 운전자가 보다 안전한 운전을 할 수 있도록 행동의 대체 코스들을 안내하여 사고의 위험을 낮출 수 있게 한다. 다음 단계는 원격 조종되거나 자체 운전 차량(self-driven vehicle)이 될 것이다. 이는 서로 다 른 자체 운전 차량들 사이 및 자동차와 인프라 사이에서 매우 신뢰성이 있고, 매우 빠른 통신을 요구한다. 미래 에, 자체 운전 차량이 모든 운전 활동을 수행하고, 운전자는 차량 자체가 식별할 수 없는 교통 이상에만 집중하 도록 할 것이다. 자체 운전 차량의 기술적 요구 사항은 트래픽 안전을 사람이 달성할 수 없을 정도의 수준까지 증가하도록 초 저 지연과 초고속 신뢰성을 요구한다. 스마트 사회(smart society)로서 언급되는 스마트 도시와 스마트 홈은 고밀도 무선 센서 네트워크로 임베디드될 것이다. 지능형 센서의 분산 네트워크는 도시 또는 집의 비용 및 에너지-효율적인 유지에 대한 조건을 식별할 것이다. 유사한 설정이 각 가정을 위해 수행될 수 있다. 온도 센서, 창 및 난방 컨트롤러, 도난 경보기 및 가전 제품들은 모두 무선으로 연결된다. 이러한 센서들 중 많은 것들이 전형적으로 낮은 데이터 전송 속도, 저전력 및 저비용이다. 하지만, 예를 들어, 실시간 HD 비디오는 감시를 위해 특정 타입의 장치에서 요구될 수 있다. 열 또는 가스를 포함한 에너지의 소비 및 분배는 고도로 분산화되고 있어, 분산 센서 네트워크의 자동화된 제어 가 요구된다. 스마트 그리드는 정보를 수집하고 이에 따라 행동하도록 디지털 정보 및 통신 기술을 사용하여 이 런 센서들을 상호 연결한다. 이 정보는 공급 업체와 소비자의 행동을 포함할 수 있으므로, 스마트 그리드가 효 율성, 신뢰성, 경제성, 생산의 지속 가능성 및 자동화된 방식으로 전기와 같은 연료들의 분배를 개선하도록 할 수 있다. 스마트 그리드는 지연이 적은 다른 센서 네트워크로 볼 수도 있다. 미션 크리티컬 애플리케이션(mission critical application)(예,e-건강(e-health))은5G사용 시나리오들 중 하 나이다. 건강 부문은 이동 통신의 혜택을 누릴 수 있는 많은 응용 프로그램을 보유하고 있다. 통신 시스템은 멀 리 떨어진 곳에서 임상 진료를 제공하는 원격 진료를 지원할 수 있다. 이는 거리에 대한 장벽을 줄이는데 도움 을 주고, 거리가 먼 농촌에서 지속적으로 이용하지 못하는 의료 서비스들로의 접근을 개선시킬 수 있다. 이는 또한 중요한 진료 및 응급 상황에서 생명을 구하기 위해 사용된다. 이동 통신 기반의 무선 센서 네트워크는 심 박수 및 혈압과 같은 파라미터들에 대한 원격 모니터링 및 센서들을 제공할 수 있다. 무선 및 모바일 통신은 산업 응용 분야에서 점차 중요해지고 있다. 배선은 설치 및 유지 비용이 높다. 따라서, 케이블을 재구성할 수 있는 무선 링크들로의 교체 가능성은 많은 산업 분야에서 매력적인 기회이다. 그러나, 이 를 달성하는 것은 무선 연결이 케이블과 비슷한 지연, 신뢰성 및 용량으로 동작하는 것과, 그 관리가 단순화될 것이 요구된다. 낮은 지연과 매우 낮은 오류 확률은 5G로 연결될 필요가 있는 새로운 요구 사항이다. 물류(logistics) 및 화물 추적(freight tracking)은 위치 기반 정보 시스템을 사용하여 어디에서든지 인벤토리 (inventory) 및 패키지의 추적을 가능하게 하는 이동 통신에 대한 중요한 사용 예이다. 물류 및 화물 추적의 사 용 예는 전형적으로 낮은 데이터 속도를 요구하지만 넓은 범위와 신뢰성 있는 위치 정보가 필요하다. 도 1을 참조하면, 통신시스템은 무선 기기, 기지국(BS) 및 네트워크를 포함한다. 비록 도. 도 1은 통신시스 템의 네트워크의 일 예로서 5G 네트워크를 도시하고 있지만, 본 명세의 구현들은 5G 시스템에 한정되지 않고, 5G 시스템을 넘어 차세대 통신시스템에 적용될 수 있다. BS 및 네트워크는 무선 기기로 구현될 수 있고, 특정 무선 기기(200a)는 다른 무선 기기들에 대해 BS/네트워크 노드로 동작할 수 있다. 무선 기기는 무선 접속 기술(radon access technology, RAT) (예, 5G NR(new RAT), LTE)을 이용하여 통신을 수 행하는 기기를 의미하며, 통신/무선/5G 기기로 지칭될 수 있다. 이로 제한되는 것은 아니지만, 무선 기기는 로 봇(100a), 차량(100b-1, 100b-2), 확장 현실(extended reality, XR) 기기(100c), 휴대 기기(hand-helddevice)(100d), 가전(100e), 사물 인터넷(Internet of things, IoT) 기기(100f), 인공 지능(artificial intelligence, AI)기기/서버를 포함할 수 있다. 예를 들어, 차량은 무선 통신 기능이 구비된 차량, 자율 주행 차량, 및 차량간 통신을 수행할 수 있는 차량을 포함할 수 있다. 여기서, 차량은 무인 항공기(unmanned aerial vehicle, UAV)(예, 드론)를 포함할 수 있다. XR 기기는 증강 현실(augmented reality, AR)/가상 현실 (virtual reality, VR)/혼합 현실(mixed reality, MR) 기기를 포함할 수 있으며, 헤드 마운트 디스플레이 (head-mounted device, HMD), 차량에 구비된 헤드업 디스플레이(head-up display, HUD), 텔레비전, 스마트폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지(signage), 차량, 로봇 등의 형태로 구현될 수 있다. 휴대 기기는 스마트폰, 스마트패드, 웨어러블 기기(예, 스마트워치, 스마트글래스), 및 컴퓨터(예, 노트북)를 포함할 수 있다. 가전은 TV, 냉장고, 및 세탁기를 포함할 수 있다. IoT 기기는 센서 및 스마트미터를 포함할 수 있다. 본 명세에서, 무선 기기(100a~100f)는 UE로 지칭될 수 있다. UE는, 예를 들어, 휴대폰, 스마트 폰, 노트북 컴퓨 터, 디지털 방송용 단말기, 개인 정보 단말기(personal digital assistant, PDA), 휴대용 멀티미디어 플레이어 (portable multimedia player, PMP), 네비게이션, 슬레이트 PC(slate PC), 태블릿 PC, 울트라북, 차량, 자율주 행 기능을 탑재한 차량, 커넥티드카, UAV, AI 모듈, 로봇, AR 기기, VR 기기, MR 기기, 홀로그램 기기, 공공 안 전 기기, MTC 기기, IoT 기기, 의료 기기, 핀테크 기기(또는 금융 기기), 보안 기기, 기후/환경 기기, 5G 서비 스와 관련된 기기, 또는 4차 산업 혁명 분야와 관련된 기기를 포함할 수 있다. UAV는, 예를 들어, 사람이 타지 않고 무선 제어 신호에 의해 비행하는 비행체일 수 있다. VR 기기는, 예를 들어, 가상 세계의 객체 또는 배경을 구현하는 기기를 포함할 수 있다. AR 기기는, 예를 들어, 현실 세계의 객체 또는 배경에 가상 세계의 객체 또는 배경을 연결하여 구현되는 기기를 포함할 수 있다. MR 기기는, 예를 들어, 현실 세계의 객체 또는 배경에 가상 세계의 객체 또는 배경을 융합하여 구현되는 기기를 포함할 수 있다. 홀로그램 기기는, 예를 들어, 홀로그래피 라는 두 개의 레이저 광이 만나서 발생하는 빛의 간섭현상을 활용하여, 입체 정보를 기록 및 재생하여 360도 입 체 영상을 구현하는 기기를 포함할 수 있다. 공공 안전 기기는, 예를 들어, 영상 중계 기기 또는 사용자의 인체 에 착용 가능한 영상 기기를 포함할 수 있다. MTC 기기 및 IoT 기기는, 예를 들어, 사람의 직접적인 개입이나 또는 조작이 필요하지 않는 기기들 일 수 있다. 예를 들어, MTC 기기 및 IoT 기기는 스마트 미터, 벤딩 머신, 온도계, 스마트 전구, 도어락 또는 각종 센서를 포함할 수 있다. 의료 기기는, 예를 들어, 질병을 진단, 치료, 경감, 처치 또는 예방할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 상해 또는 장애를 진단, 치료, 경감 또는 교정할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 구조 또는 기능을 검사, 대체 또는 변형할 목적으로 사용되는 기기일 수 있다. 예를 들어, 의료 기기는 임신을 조절할 목적으로 사용되 는 기기일 수 있다. 예를 들어, 의료 기기는 진료용 기기, 수술용 기기, (체외) 진단용 기기, 보청기 또는 시술 용 기기를 포함할 수 있다. 보안 기기는, 예를 들어, 발생할 우려가 있는 위험을 방지하고, 안전을 유지하기 위 하여 설치한 기기일 수 있다. 예를 들어, 보안 기기는 카메라, CCTV, 녹음기(recorder) 또는 블랙박스일 수 있 다. 핀테크 기기는, 예를 들어, 모바일 결제와 같은 금융 서비스를 제공할 수 있는 기기일 수 있다. 예를 들어, 핀테크 기기는 결제 기기 또는 POS(point of sales)를 포함할 수 있다. 기후/환경 기기는, 예를 들어, 기후/환 경을 모니터링 또는 예측하는 기기를 포함할 수 있다. 무선 기기(100a~100f)는 BS을 통해 네트워크와 연결될 수 있다. 무선 기기(100a~100f)에는 AI 기술 이 적용될 수 있으며, 무선 기기(100a~100f)는 네트워크를 통해 AI 서버와 연결될 수 있다. 네트워크 는 3G 네트워크, 4G(예, LTE) 네트워크, 5G(예, NR) 네트워크 및 비욘드(beyond) 5G 네트워크를 이용하여 구성될 수 있다. 무선 기기(100a~100f)는 BS/네트워크를 통해 서로 통신할 수도 있지만, BS/네트워크 를 통하지 않고 직접 통신(e.g. 사이드링크 통신)할 수도 있다. 예를 들어, 차량들(100b-1, 100b-2)은 직접 통 신(e.g. V2V(vehicle-to-vehicle)/V2X(vehicle-to-everything) 통신)을 할 수 있다. 또한, IoT 기기(예, 센 서)는 다른 IoT 기기(예, 센서) 또는 다른 무선 기기(100a~100f)와 직접 통신을 할 수 있다. 무선 기기(100a~100f)/BS-BS 간에는 무선 통신/연결(150a, 150b)이 이뤄질 수 있다. 여기서, 무선 통신/연결은 상향링크/하향링크 통신(150a)과 사이드링크 통신(150b)(또는, D2D 통신)과 같은 다양한 RAT(예, 5G NR)를 통해 이뤄질 수 있다. 무선 통신/연결(150a, 150b)을 통해 무선 기기와 BS/무선 기기는 서로 무선 신 호들을 전송/수신할 수 있다. 예를 들어, 무선 통신/연결(150a, 150b)은 다양한 물리채널을 통해 신호들을 전송 /수신할 수 있다. 이를 위해, 본 명세의 다양한 제안들에 기반하여, 무선 신호들의 전송/수신을 위한 다양한 설 정 정보 구성 과정, 다양한 신호 처리 과정(예, 채널 인코딩/디코딩, 변조/복조, 및 자원 매핑/디매핑) 및 자원 할당 과정 중 적어도 일부가 수행될 수 있다. 도 2는 본 명세에 따른 방법을 수행할 수 있는 통신 기기들의 예들을 도시하는 블록도이다. 도 2를 참조하면, 제1 무선 기기와 제2 무선 기기는 다양한 RAT(예, LTE, NR)을 통해 무선 신호를 외 부 기기로/로부터 전송/수신할 수 있다. 도 2에서, {제1 무선 기기 및 제2 무선 기기}은 도 1의 {무 선 기기(100a~100f) 및 BS} 및/또는 {무선 기기(100a~100f) 및 무선 기기(100a~100f)}에 대응할 수 있다. 제1 무선 기기는 하나 이상의 프로세서 및 하나 이상의 메모리를 포함하며, 추가적으로 하나 이 상의 송수신기 및/또는 하나 이상의 안테나을 더 포함할 수 있다. 프로세서(들)는 메모리 (들) 및/또는 송수신기(들)를 제어하며, 본 명세에서 설명한 기능들, 절차들 및/또는 방법들을 구현 하도록 구성될 수 있다. 예를 들어, 프로세서(들)는 메모리(들) 내의 정보를 처리하여 제1 정보/신호 들을 생성한 뒤, 송수신기(들)을 통해 제1 정보/신호들을 포함하는 무선 신호들을 전송할 수 있다. 또한, 프로세서(들)는 송수신기를 통해 제2 정보/신호들을 포함하는 무선 신호들을 수신한 다음, 제2 정보/ 신호들을 처리하여 얻은 정보를 메모리(들)에 저장할 수 있다. 메모리(들)는 프로세서(들)와 연 결될 수 있고, 프로세서(들)의 동작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리(들)(10 4)는 프로세서(들)에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나 본 명세에서 설명한 절차 들 및/또는 방법들을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 여기서, 프로세서 (들)와 메모리(들)는 RAT(예, LTE, NR)를 구현하도록 설계된 통신 모뎀/회로/칩의 일부일 수 있다. 송수신기(들)는 프로세서(들)와 연결될 수 있고, 하나 이상의 안테나를 통해 무선 신호들을 전 송 및/또는 수신할 수 있다. 송수신기(들)의 각각은 전송기 및/또는 수신기를 포함할 수 있다. 송수신기 (들)는 무선 주파수(radio frequency, RF) 유닛(들)과 혼용될 수 있다. 본 발명에서 무선 기기는 통신 모 뎀/회로/칩을 의미할 수도 있다. 제2 무선 기기는 하나 이상의 프로세서, 하나 이상의 메모리를 포함하며, 추가적으로 하나 이상 의 송수신기 및/또는 하나 이상의 안테나를 더 포함할 수 있다. 프로세서(들)는 메모리 (들) 및/또는 송수신기(들)를 제어할 수 있으며, 본 명세에서 설명한 기능들, 절차들 및/또는 방법들 을 구현하도록 구성될 수 있다. 예를 들어, 프로세서(들)는 메모리(들) 내의 정보를 처리하여 제3 정 보/신호들을 생성한 뒤, 송수신기(들)를 통해 제3 정보/신호들을 포함하는 무선 신호들을 전송할 수 있다. 또한, 프로세서(들)는 송수신기(들)를 통해 제4 정보/신호들을 포함하는 무선 신호들을 수신한 뒤, 제4 정보/신호들을 처리하여 얻은 정보를 메모리(들)에 저장할 수 있다. 메모리(들)는 프로세서 (들)와 연결될 수 있고, 프로세서(들)의 동작과 관련한 다양한 정보를 저장할 수 있다. 예를 들어, 메모리(들)는 프로세서(들)에 의해 제어되는 프로세스들 중 일부 또는 전부를 수행하거나 본 명세에 서 설명한 절차들 및/또는 방법들을 수행하기 위한 명령들을 포함하는 소프트웨어 코드를 저장할 수 있다. 여기 서, 프로세서(들)와 메모리(들)는 RAT(예, LTE, NR)를 구현하도록 설계된 통신 모뎀/회로/칩의 일부 일 수 있다. 송수신기(들)는 프로세서(들)와 연결될 수 있고, 하나 이상의 안테나를 통해 무선 신호들을 전송 및/또는 수신할 수 있다. 송수신기(들)의 각각은 전송기 및/또는 수신기를 포함할 수 있다. 송수신기(들)는 RF 유닛과 혼용될 수 있다. 본 발명에서 무선 기기는 통신 모뎀/회로/칩을 의미할 수도 있 다. 이하, 무선 기기(100, 200)의 하드웨어 요소에 대해 보다 구체적으로 설명한다. 이로 제한되는 것은 아니지만, 하나 이상의 프로토콜 계층이 하나 이상의 프로세서(102, 202)에 의해 구현될 수 있다. 예를 들어, 하나 이상의 프로세서(102, 202)는 하나 이상의 계층(예, 물리(physical, PHY) 계층, 매체 접속 제어(medium access control, MAC) 계층, 무선 링크 제어(radio link control, RLC) 계층, 패킷 데이터 수렴 프로토콜(packet data convergence protocol, PDCP) 계층, 무선 자원 제어(radio resource control, RRC)계층, 서비스 데이터 적응 프로토콜(service data adaption protocol, SDAP)와 같은 기능적 계층)을 구현할 수 있다. 하나 이상의 프로세 서(102, 202)는 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들에 따라 하나 이상의 프로토콜 데이터 유닛(protocol data unit, PDU) 및/또는 하나 이상의 서비스 데이터 유닛(service data unit, SDU)을 생성할 수 있다. 하나 이상의 프로세서(102, 202)는 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들에 따라 메시지, 제어정보, 데이터 또는 정보를 생성할 수 있다. 하나 이상의 프로세서(102, 202)는 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들에 따라 PDU, SDU, 메시지, 제어정보, 데이터 또는 정보를 포함하는 신 호들(예, 기저대역(baseband) 신호들)을 생성하여, 하나 이상의 송수신기(106, 206)에게 제공할 수 있다. 하나 이상의 프로세서(102, 202)는 하나 이상의 송수신기(106, 206)로부터 신호들(예, 기저대역 신호들)을 수신할 수 있고, 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들에 따라 PDU, SDU, 메시지, 제어정보, 데이터 또는 정보를 획득할 수 있다. 하나 이상의 프로세서(102, 202)는 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 또는 마이크로 컴퓨터로 지칭될 수 있다. 하나 이상의 프로세서(102, 202)는 하드웨어, 펌웨어, 소프트웨어, 또는 이들의 조합에 의해 구현될 수 있다. 일 예로, 하나 이상의 ASIC(application specific integrated circuit), 하나 이상의 DSP(digital signal processor), 하나 이상의 DSPD(digital signal processing device), 하나 이상의 PLD(programmable logic device) 또는 하나 이상의 FPGA(field programmable gate arrays)가 하나 이상의 프로 세서(102, 202)에 포함될 수 있다. 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들은 펌웨어 또는 소 프트웨어를 사용하여 구현될 수 있고, 펌웨어 또는 소프트웨어는 모듈들, 절차들 혹은 기능들을 포함하도록 구 현될 수 있다. 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들을 수행하도록 설정된 펌웨어 또는 소 프트웨어는 하나 이상의 프로세서(102, 202)에 포함되거나, 하나 이상의 메모리(104, 204)에 저장되어 하나 이 상의 프로세서(102, 202)에 의해 구동될 수 있다. 본 명세에 개시된 기능들, 절차들, 제안들 및/또는 방법들은 코드, 명령들 및/또는 명령들의 집합 형태로 펌웨어 또는 소프트웨어를 사용하여 구현될 수 있다. 하나 이상의 메모리(104, 204)는 하나 이상의 프로세서(102, 202)와 연결될 수 있고, 다양한 형태의 데이터, 신 호들, 메시지들, 정보, 프로그램들, 코드, 지시들 및/또는 명령들을 저장할 수 있다. 하나 이상의 메모리(104, 204)는 ROM(read-only memory), RAM(random access memory), EPROM(Electrically erasable programmable read-only memory), 플래시 메모리, 하드 드라이브, 레지스터, 캐쉬 메모리, 컴퓨터 판독 저장 매체 및/또는 이 들의 조합으로 구성될 수 있다. 하나 이상의 메모리(104, 204)는 하나 이상의 프로세서(102, 202)의 내부 및/또 는 외부에 위치할 수 있다. 또한, 하나 이상의 메모리(104, 204)는 유선 또는 무선 연결과 같은 다양한 기술을 통해 하나 이상의 프로세서(102, 202)와 연결될 수 있다. 하나 이상의 송수신기(106, 206)는 하나 이상의 다른 기기에게 본 명세의 방법들 및/또는 동작 순서도들에서 언 급되는 사용자 데이터, 제어 정보, 및/또는 무선 신호들/채널들을 전송할 수 있다. 하나 이상의 송수신기(106, 206)는 하나 이상의 다른 기기로부터 본 명세에 개시된 기능들, 절차들, 제안, 방법들 및/또는 동작 순서도들에 서 언급되는 사용자 데이터, 제어 정보, 및/또는 무선 신호들/채널들을 수신할 수 있다. 예를 들어, 하나 이상 의 송수신기(106, 206)는 하나 이상의 프로세서(102, 202)와 연결될 수 있고, 무선 신호들을 전송 및/또는 수신 할 수 있다. 예를 들어, 하나 이상의 프로세서(102, 202)는 하나 이상의 송수신기(106, 206)가 하나 이상의 다 른 기기에게 사용자 데이터, 제어 정보 또는 무선 신호들을 전송하도록 제어할 수 있다. 또한, 하나 이상의 프 로세서(102, 202)는 하나 이상의 송수신기(106, 206)가 하나 이상의 다른 기기로부터 사용자 데이터, 제어 정보 또는 무선 신호들을 수신하도록 제어할 수 있다. 또한, 하나 이상의 송수신기(106, 206)는 하나 이상의 안테나 (108, 208)와 연결될 수 있고, 하나 이상의 송수신기(106, 206)는 하나 이상의 안테나(108, 208)를 통해 본 명 세에 개시된 기능들, 절차들, 제안들, 방법들 및/또는 동작 순서도들에서 언급되는 사용자 데이터, 제어 정보, 및/또는 무선 신호들/채널들을 전송 및/또는 수신하도록 설정될 수 있다. 본 명세에서, 하나 이상의 안테나는 복수의 물리 안테나이거나, 복수의 논리 안테나(예, 안테나 포트)일 수 있다. 하나 이상의 송수신기(106, 206) 는 수신된 사용자 데이터, 제어 정보, 무선 신호들/채널들 등을 하나 이상의 프로세서(102, 202)를 이용하여 처 리하기 위해, 수신된 무선 신호들/채널들 등을 RF 대역 신호들에서 기저 대역 신호들로 변환할 수 있다. 하나 이상의 송수신기(106, 206)는 하나 이상의 프로세서(102, 202)를 이용하여 처리된 사용자 데이터, 제어 정보, 무선 신호들/채널들 등을 기저 대역 신호들로부터 RF 대역 신호들로 변환할 수 있다. 이를 위하여, 하나 이상의 송수신기(106, 206)는 (아날로그) 오실레이터들 및/또는 필터들을 포함할 수 있다. 예를 들어, 송수신기(106, 206)는 프로세서(102, 202)의 제어 하에 송수신기의 (아날로그) 오실레이터들 및/또는 필터들에 의해 OFDM 기저 대역 신호들을 반송파 주파수로 상향 변환하고, 반송파 주파수에서 상향 변환된 OFDM 신호들을 전송할 수 있다. 송수신기(106, 206)는 반송파 주파수에서 OFDM 신호들을 수신하고 송수신기(102, 202)의 제어하에 송수신기의 (아날로그) 오실레이터들 및/또는 필터들에 의해 OFDM 신호들을 OFDM 기저 대역 신호들로 하향 변환할 수 있다. 본 명세의 구현들에서, UE는 상향링크에서 송신기기로서, 하향링크에서 수신 기기로서 동작할 수 있다. 본 명세 의 구현들에서, BS은 상향링크에서 수신 기기로서, 하향링크 에서 송신 기기로서 동작할 수 있다. 이하에서는, 설명의 편의를 위해, 별도의 언급 또는 설명이 없는 한, 제1 무선기기가 UE로 동작하고, 제2 무선기기 가 BS으로 동작하는 것으로 주로 가정한다. 예를 들어, 제1 무선 기기에 연결되거나 탑재되거나 론칭 되는 프로세서(들)는 본 명세의 구현에 따른 UE 동작을 수행하도록 구성되거나 본 명세의 구현에 따른 UE 동작을 수행하도록 송수신기를 제어하도록 구성될 수 있다. 제2 무선 기기에 연결되거나 탑재되거나 론칭되는 프로세서(들)는 본 명세의 구현에 따른 BS 동작을 수행하도록 구성되거나 본 명세의 구현에 따른 BS 동작을 수행하도록 송수신기(들)를 제어하도록 구성될 수 있다. 본 명세에서, 적어도 하나의 메모리(예, 104 또는 204)는 실행될 때 그에 작동가능하게 연결된 적어도 하나의 프로세서로 하여금 본 명세의 몇몇 실시예 또는 구현들에 따른 동작을 수행하게 하는 지시들 또는 프로그램들을저장할 수 있다. 본 명세에서, 컴퓨터 판독가능한 저장 매체는 적어도 하나의 프로세서에 의해 실행될 때 적어도 하나의 프로세 서로 하여금 본 명세의 몇몇 실시예 또는 구현들에 따른 동작을 수행하게 하는 적어도 하나의 지시 또는 컴퓨터 프로그램을 저장한다. 본 명세에서, 처리 기기 또는 장치는 적어도 하나의 프로세서, 및 적어도 하나의 프로세서에 연결가능한, 그리 고, 실행될 때, 적어도 하나의 프로세서로 하여금 본 명세의 몇몇 실시예 또는 구현들에 따른 동작을 수행하게 하는 지시들을 저장한, 적어도 하나의 컴퓨터 메모리를 포함할 수 있다. 도 3은 본 발명의 구현들을 수행할 수 있는 무선 기기의 다른 예를 도시한 것이다. 무선 기기는 사용 예(use case)/서비스에 따라 다양한 형태로 구현될 수 있다(도 1 참조). 도 3을 참조하면, 무선 기기(100, 200)는 도 2의 무선 기기(100, 200)에 대응하며, 다양한 요소(element), 성 분(component), 유닛(unit)/부(portion), 및/또는 모듈(module)들로 구성될 수 있다. 예를 들어, 무선 기기 (100, 200) 각각은 통신부, 제어부, 메모리부 및 추가 성분을 포함할 수 있다. 통신부는 통신 회로 및 송수신기(들)을 포함할 수 있다. 예를 들어, 통신 회로는 도 2의 하나 이상의 프 로세서(102, 202) 및/또는 도2의 하나 이상의 메모리(104, 204)를 포함할 수 있다. 예를 들어, 송수신기 (들)는 도 2의 하나 이상의 송수신기(106, 206) 및/또는 도2의 하나 이상의 안테나(108, 208)를 포함할 수 있다. 제어부는 통신부, 메모리부 및 추가 성분과 전기적으로 연결되며 무선 기기들의 제 반 동작을 제어한다. 예를 들어, 제어부는 메모리부에 저장된 프로그램들/코드/명령들/정보에 기반하 여 무선 기기의 전기적/기계적 동작을 제어할 수 있다. 또한, 제어부는 메모리부에 저장된 정보를 통 신부을 통해 외부(예, 다른 통신 기기)로 무선/유선 인터페이스를 통해 전송하거나, 통신부를 통해 외부(예, 다른 통신 기기)로부터 무선/유선 인터페이스를 통해 수신된 정보를 메모리부에 저장할 수 있다. 추가 성분은 무선 기기의 종류에 따라 다양하게 구성될 수 있다. 예를 들어, 추가 성분은 파워 유닛/ 배터리, 입출력부(input/output (I/O)부)(예, 오디오 I/O 포트, 비디오 I/O 포트), 구동부, 및 연산 (computing)부 중 적어도 하나를 포함할 수 있다. 이로 제한되는 것은 아니지만, 무선 기기는 로봇(도1의 100a), 차량(도1의 100b-1, 100b-2), XR 기기(도1의 100c), 휴대 기기(도1의 100d), 가전(도1의 100e), IoT 기 기(도1의 100f), 디지털 방송용 단말기, 홀로그램 기기, 공공 안전 기기, MTC 기기, 의료 기기, 핀테크 기기(또 는 금융 기기), 보안 기기, 기후/환경 기기, AI 서버/기기(도1의 400), BS(도1의 200), 네트워크 노드 등의 형 태로 구현될 수 있다. 무선 기기는 사용-예/서비스에 따라 이동 가능하거나 고정된 장소에서 사용될 수 있다. 도 3에서 무선 기기(100, 200) 내의 다양한 요소, 성분, 유닛/부, 및/또는 모듈은 전체가 유선 인터페이스를 통 해 상호 연결되거나, 적어도 일부가 통신부를 통해 무선으로 연결될 수 있다. 예를 들어, 무선 기기(100, 200) 각각에서 제어부와 통신부는 유선으로 연결되며, 제어부와 제1 유닛(예, 130, 140)은 통신 부를 통해 무선으로 연결될 수 있다. 또한, 무선 기기(100, 200) 내의 각 요소, 성분, 유닛/부, 및/또는 모듈은 하나 이상의 요소를 더 포함할 수 있다. 예를 들어, 제어부는 하나 이상의 프로세서의 집합으로 구 성될 수 있다. 예를 들어, 제어부는 통신 제어 프로세서, 어플리케이션 프로세서, 전자 제어부(electronic control unit, ECU), 그래픽 처리 유닛, 및 메모리 제어 프로세서의 집합으로 구성될 수 있다. 다른 예로, 메모 리부는 RAM, DRAM(dynamic RAM), ROM, 플래시 메모리(flash memory), 휘발성 메모리(volatile memory), 비-휘발성 메모리(non-volatile memory) 및/또는 이들의 조합으로 구성될 수 있다. 도 4는 3GPP 기반 무선 통신 시스템에서 프로토콜 스택의 예를 도시한다. 특히, 도 4(a)는 단말(UE)과 기지국(BS) 간의 무선 인터페이스 사용자 평면 프로토콜 스택을 예시하고, 도 4 (b)는 UE와 BS 간의 무선 인터페이스 제어 평면 프로토콜 스택을 예시한다. 제어 평면은 UE와 네트워크가 호 (call)를 관리하기 위해서 사용하는 제어 메시지가 전송되는 통로를 의미한다. 사용자 평면은 애플리케이션 계 층에서 생성된 데이터, 예를 들어, 음성 데이터 또는 인터넷 패킷 데이터가 전송되는 통로를 의미한다. 도 4 (a)를 참조하면, 사용자 평면 프로토콜 스택은 제1 계층(계층 1)(즉, 물리(PHY) 계층)과 제2 계층(계층 2)으로 나뉠 수 있다. 도 4(b)를 참조하면, 제어 평면 프로토콜 스택은 계층 1(즉, PHY 계층), 계층 2, 계층 3(예를 들 어, 무선 자원 제어(radio resource control, RRC) 계층 및 비-접속 층(non-access stratum, NAS) 계층으로 나 뉠 수 있다. 계층 1, 계층 2 및 계층 3을 접속 층(access stratum, AS)이라고 지칭한다. NAS 제어 프로토콜은 네트워크측상의 접속 관리 기능(access management function, AMF)에서 종결되며 인증, 이동성 관리, 보안 제어 등을 수행한다.3GPP LTE 시스템에서, 계층 2는 다음과 같은 하위 계층들로 분할된다: 매체 접속 제어(medium access control, MAC), 무선 링크 제어(radio link control, RLC) 및 패킷 데이터 컨버전스 프로토콜(packet data convergence protocol, PDCP). 3GPP NR (New Radio) 시스템에서 계층 2는 다음과 같은 하위 계층들로 분할된다: MAC, RLC, PDCP 및 서비스 데이터 적응 프로토콜(service data adaptation protocol, SDAP). PHY 계층은 MAC 서브계층에 전송 채널을 제공하고, MAC 서브계층은 RLC 서브계층에 논리 채널을 제공하고, RLC 서브계층은 PDCP 서브계층에 RLC 채널을 제공하며, PDCP 서브계층은 SDAP 서브계층에 무선 베어러를 제공한다. SDAP 서브계층은 5G 코어 네 트워크에 QoS 플로우 (flow) 를 제공한다. 3GPP NR 시스템에서, SDAP의 주요 서비스 및 기능은 다음을 포함한다: QoS 플로우와 데이터 무선 베어러 간의 매핑; DL 및 UL 패킷 모두에서 QoS 플로우 ID(QoS flow ID, QFI)의 마킹. SDAP의 단일 프로토콜 엔티티가 각 개별 PDU 세션에 대해 설정된다. 3GPP NR 시스템에서, RRC 서브계층의 주요 서비스 및 기능은 다음을 포함한다: AS 및 NAS와 관련된 시스템 정보 의 브로드캐스트; 5GC 또는 NG-RAN에 의해 개시된 페이징; UE와 NG-RAN 간의 RRC 연결의 수립, 유지 및 해제; 키 관리를 포함한 보안 기능; 시그널링 무선 베이러(signaling radio bearer, SRB) 및 데이터 무선 베어러 (data radio bearer, DRB)의 수립, 설정, 유지 및 해제; (핸드오버 및 컨텍스트 전달; UE 셀 선택 및 재선택 및 셀 선택 및 재선택의 제어; RAT 간 이동성을 포함하는) 이동성 기능; QoS 관리 기능, UE 측정 보고 및 보고 의 제어; 무선 링크 실패의 검출 및 무선 링크 실패로부터 복구; UE로부터 NAS로 및 NAS로부터 UE로의 NAS 메시 지 전달. 3GPP NR 시스템에서, 사용자 평면을 위한 PDCP 서브계층의 주요 서비스 및 기능은 다음을 포함한다: 시퀀스 넘 버링; 헤더 압축 및 압축-해제 (강인한 헤더 압축(robust header compression, ROHC)의 경우만); 사용자 데이 터 전달; 재배열(reordering) 및 복제 검출(duplicate detection); 순차적인 전송; PDCP PDU 라우팅 (스플릿 베어러(split bearer)의 경우); PDCP SDU의 재전송; 암호화(ciphering), 해독화(deciphering) 및 무결성 보호 (integrity protection); PDCP SDU 폐기; RLC AM를 위한 PDCP 재확립 및 데이터 복구(recovery); RLC AM를 위 한 PDCH 상태 보고; PDCP PDU의 복제 및 하위 계층으로의 복제 폐기 지시. 제어 평면을 위한 PDCP 서브계층의 주요 서비스 및 기능은 다음을 포함한다: 시퀀스 넘버링; 암호화(ciphering), 해독화(deciphering) 및 무결성 보호(integrity protection); 제어 평면 데이터 전달; 재배열 및 복제 검출; 순차적인 전송; PDCP PDU의 복제 그리고 하위 계층으로의 복제 폐기 지시. 3GPP NR 시스템에서, RLC 서브계층은 3가지의 전송 모드, 즉, 트랜스패런트 모드(transparent mode, TM), 비확 인 모드(unacknowledged mode, UM), 확인 모드(acknowledged mode, AM)를 지원한다. RLC 설정은 뉴머로롤지 및 /혹은 전송 구간에 좌우되지 않고 논리 채널 별로 적용될 수 있다. 3GPP NR 시스템에서, RLC 서브계층의 주요 서비스 및 기능은 전송모드에 좌우되며, 상위 계층 PDU의 전달; PDCP에서의 넘버링과는 독립적인 시퀀스 넘버링 (UM 및 AM의 경우); ARQ(automatic repeat request)를 통한 에러 정정 (AM의 경우만); RLC SDU의 분할 (segmentation)(UM 및 AM의 경우) 및 재분할(re-segmentation)(AM의 경우만); SDU의 재결합(reassembly)(UM 및 AM의 경우); RLC SDU 폐기(discard)(UM 및 AM의 경우); RLC 재수립(re-establishment); 프로토콜 에러 검출(AM 의 경우만)을 포함한다. 3GPP NR 시스템에서, MAC 서브계층의 주요 서비스 및 기능은 다음을 포함한다: 논리 채널과 전송 채널 간의 매 핑; 전송 채널을 통해 PHY 계층으로/으로부터 전달되는 수송 블록(transport block, TB)으로/으로부터 하나 또 는 상이한 논리 채널에 속하는 MAC SDU의 다중화(multiplexing)/역다중화(demultiplexing); 스케줄링 정보 보 고; HARQ (hybrid automatic repeat request)(CA의 경우 셀당 하나의 HARQ 엔티티)를 통한 에러 정정; 동적 (dynamic) 스케줄링을 이용한 UE 간의 우선순위 핸들링; 논리 채널 우선순위를 이용한 하나의 UE의 논리 채널 간의 우선순위 핸들링; 패딩(padding). 단일의 MAC 엔티티는 다중의 뉴머롤로지, 전송 타이밍 및 셀을 지원할 수 있다. 논리 채널 우선순위에서 매핑 제약은 논리 채널이 어떤 뉴멀로롤지(들), 셀(들) 및 전송 타이밍(들) 사용할 수 있는지 제어한다. 서로 다른 타입의 데이터 전송 서비스가 MAC에 의해 제공된다. 서로 다른 타입의 데이터 전송 서비스를 수용하기 위하여, 다수의 논리 채널 타입들, 즉, 각각이 특정 타입의 정보의 전송을 지원 하는 논리 채널 타입들이 정의된다. 각 논리 채널 타입은 어떠한 타입의 정보가 전달되는지에 의하여 정의된다. 논리 채널은 두 개의 그룹, 즉, 제어 채널 및 트래픽 채널로 분류된다. 제어 채널은 제어 평면 정보만을 전달하 기 위하여 사용되며 트래픽 제어 채널은 사용자 평면 정보만을 전달하기 위하여 사용된다. 브로드캐스트 제어 채널(broadcast control channel, BCCH)은 시스템 제어 정보를 브로드캐스팅하기 위한 하향링크 논리 채널이며, 페이징 제어 채널(paging control channel, PCCH)는 페이징 정보, 시스템 정보 변경 통지 및 진행중인 PWS 브 로드캐스트의 지시를 전달하는 하향링크 논리 채널이며, 공통 제어 채널(common control channel, CCCH)은 UE와네트워크 간의 제어 정보를 전송하기 위한 논리 채널로서. 네트워크와 RRC 연결을 가지지 않는 UE을 위해 사용 되는 채널이며, 전용 제어 채널(dedicated control channel, DCCH)은 UE와 네트워크 간에 전용 제어 정보를 전 송하는 점-대-점(point-to-point) 양방향 논리 채널로서, RRC 연결을 가지는 UE에 의해 사용되는 체널이다. 전 용 트래픽 채널(dedicated traffic channel, DTCH)은 사용자 정보를 전달하기 위한, 단일의 UE에게 전용되는, 점-대-점 논리 채널이다. DTCH는 상향링크 및 하향링크 모두에서 존재할 수 있다. 하향링크에서, 논리 채널과 전송 채널 간의 연결은 다음과 같다: BCCH는 BCH에 매핑될 수 있다; BCCH는 하향링크 공유 채널(downlink shared channel, DL-SCH)에 매핑될 수 있다; PCCH는 PCH에 매핑될 수 있다; CCCH는 DL-SCH에 매핑될 수 있다; DCCH는 DL-SCH에 매핑될 수 있다; DTCH는 DL-SCH에 매핑될 수 있다. 상향링크에서, 논리 채널과 전송 채널 간의 연결은 다음과 같다: CCCH는 상향링크 공유 채널(uplink shared channel, UL-SCH)에 매핑될 수 있다; DCCH는 UL-SCH에 매핑될 수 있다; DTCH는 UL-SCH에 매핑될 수 있다. 도 5는 3GPP 기반 무선 통신 시스템에서 프레임 구조의 예를 도시한다. 도 5의 프레임의 구조는 예시에 불과하고, 프레임에서 서브프레임의 수, 슬롯의 수 및/또는 심볼의 수는 다양하 게 변경될 수 있다. 3GPP 기반 무선 통신 시스템에서는 하나의 UE에 대해 집성되는 복수의 셀 간에 OFDM 뉴머롤 로지(numerology)(예, 부반송파 간격 (subcarrier spacing, SCS), 전송 시간 간격 (transmission time interval, TTI) 구간)가 상이하게 설정될 수 있다. 예를 들어, UE가 셀에 대해 집성된 셀들에 대하여 서로 다른 SCS로 설정되면, 동일한 개수의 심볼로 구성된 시간 자원(예, 서브프레임, 슬롯 또는 TTI)의 (절대 시간) 구간 은 집성된 셀 간에 서로 다를 수 있다. 여기서, 심볼은 OFDM 심볼(혹은, CP-OFDM 심볼), SC-FDMA 심볼(혹은, DFT-s-OFDM(discrete Fourier transform-spread-OFDM) 심볼)을 포함할 수 있다. 도 5를 참조하면, 상향링크 및 하향링크 전송은 프레임들로 구조화(organize)된다. 각 프레임은 Tf = 10ms의 구 간을 가지며 각각 5ms의 구간인 2개의 하프-프레임(half-frame)으로 나뉜다. 각 하프-프레임은 5개의 서브프레 임으로 구성되며, 각 서브프레임의 구간(Tsf)은 1ms이다. 각 서브프레임은 슬롯으로 나뉘고, 서브프레임 내 슬롯 의 개수는 부반송파 간격에 따라 다르다. 각 슬롯은 순환 프리픽스(cyclic prefix, CP)에 기초하여 14개 혹은 12개 OFDM 심볼로 구성된다. 일반(normal) CP에서는 각 슬롯은 14개 OFDM 심볼로 구성되며, 확장(extended) CP 의 경우에는 각 슬롯은 12개 OFDM 심볼로 구성된다. 뉴머롤로지는 지수적으로 스케일링 가능한 부반송파 간격 (△f = 2u*15 kHz)에 기초한다. 다음 표는 부반송파 간격(△f = 2u*15 kHz)에 따라, 일반 CP에 대하여, 슬롯 당 OFDM 심볼의 개수, 프레임 당 슬롯의 개수 및 서브프레임 당 슬롯의 개수를 나타낸 것이다. 표 1 u Nslot symb Nframe,u slot Nsubframe,u slot 0 14 10 1 1 14 20 2 2 14 40 4 3 14 80 8 4 14 160 16 다음 표는 부반송파 간격(△f = 2u*15 kHz)에 따라, 확장 CP에 대하여, 슬롯 당 OFDM 심볼들의 개수, 프레임 당 슬롯의 개수 및 서브프레임 당 슬롯의 개수를 나타낸 것이다. 표 2 u Nslot symb Nframe,u slot Nsubframe,u slot 2 12 40 4 슬롯은 시간 도메인에서 복수(예, 14개 또는 12개)의 심볼을 포함한다. 각 뉴머롤로지(예, 부반송파 간격) 및 반송파에 대해, 상위 계층 시그널링(예, 무선 자원 제어(radio resource control, RRC) 시그널링)에 의해 지시 되는 공통 자원 블록(common resource block, CRB)(Nstart,u grid)에서 시작하는, Nsize,u grid,x*NRB sc개의 부반송파 및Nsubframe,u symb개의 OFDM 심볼의 자원 격자가 정의된다. 여기서 Nsize,u grid,x은 자원 격자 내 자원 블록(resource block, RB)의 개수이고, 아래 첨자 x는 하향링크에 대해서는 DL이고 상향링크에 대해서는 UL이다. NRB sc는 RB 당 부반송파의 개수이다. 3GPP 기반 무선 통신 시스템에서, NRB sc는 일반적으로 12이다. 주어진 안테나 포트(p), 부 반송파 간격 설정(configuration)(u) 및 전송 방향(DL 또는 UL)에 대해 하나의 자원 격자가 존재한다. 부반송파 간격 설정(u)에 대한 반송파 대역폭(Nsize,u grid)은 상위 계층 파라미터(예, RRC 파라미터)에 의해 주어진다. 안테 나 포트(p) 및 부반송파 간격 설정(u)에 대한 자원 격자 내 각각의 요소는 자원 요소(resource element, RE)로 지칭되며, 각 자원 요소에는 하나의 복소 심볼이 매핑될 수 있다. 자원 격자 내 각 자원 요소는 주파수 도메인 내 인덱스(k) 및 시간 도메인에서 참조 포인트에 대해 상대적인 심볼 위치를 표시하는 인덱스(l)에 의해 고유하 게 식별된다. 3GPP 기반 무선 통신 시스템에서, RB는 주파수 도메인에서 12개의 연속하는 부반송파에 의하여 정 의된다. 3GPP NR 시스템에서, RB는 공통 자원 블록(CRB)과 물리 자원 블록(physical resource block, PRB)으로 분류된 다. CRB는 부반송파 간격 설정(u)에 대한 주파수 도메인에서 0부터 증가하는 방향으로 넘버링된다. 부반송파 간 격 설정(u)에 대한 CRB 0의 부반송파 0의 중심은 자원 블록 격자에 대한 공통 참조 포인트인 '포인트 A'와 일치 한다. 3GPP NR 시스템에서, PRB는 대역폭 파트(bandwidth part, BWP) 내에서 정의되고, 0부터 Nsize BWP,i-1까지 넘 버링된다. 여기에서, i는 상기 대역폭 파트의 번호이다. 대역폭 파트(i) 내 물리 자원 블록(nPRB)과, 공통 자원 블록(nCRB) 간의 관계는 다음과 같다: nPRB = nCRB + Nsize BWP,i. 여기서 Nsize BWP,i는 상기 대역폭 파트가 CRB 0에 대해 시작하는 공통 자원 블록이다. BWP는 주파수 도메인에서 복수의 연속하는 RB를 포함한다. 반송파는 최대 N개(예, 5개)의 BWP를 포함할 수 있다. UE는 주어진 구성 반송파에서 하나 이상의 BWP로 설정될 수 있다. UE에 대하여 설정된 BWP중에서 단지 하나의 BWP만이 한번에 활성화될 수 있다. 활성화된 BWP는 셀의 동작 대역폭 내 에서 UE의 동작 대역폭을 정의한다. NR 주파수 대역들은 2가지 타입의 주파수 범위들인 FR1 및 FR2로 정의된다. FR2는 밀리미터 파(millimeter wave, mmW)로도 불린다. NR이 동작할 수 있는 주파수 범위들을 표3에 서술된 바와 같이 구별된다. 표 3 Frequency Range designationCorresponding frequency range Subcarrier Spacing FR1 450MHz - 7125MHz 15, 30, 60kHz FR2 24250MHz - 52600MHz 60, 120, 240kHz 도 6은 3GPP NR 시스템에서 데이터 플로우의 예를 도시한다.. 도 6에서 \"RB\"는 무선 베어러를 나타내고, \"H\"는 헤더를 나타낸다. 무선 베어러는 사용자 평면 데이터용 데이터 무선 베어러(data radio bearer, DRB)와 제어 평면 데이터용 신호 무선 베어러(signaling radio bearer, SRB) 의 두 그룹으로 분류된다. MAC PDU는 무선 자원을 이용하여 PHY 계층을 통해 외부 기기와 송수신된다. MAC PDU 는 수송 블록 형태로 PHY 계층에 도달한다. PHY 계층에서, 상향링크 수송 채널인 UL-SCH 및 RACH는PUSCH 및 PRACH에 각각 매핑되고, 하향링크 수송 채널인 DL-SCH, BCH 및 PCH는 PDSCH, 물리 방송 채널(physical broadcast channel, PBCH) 및 PDSCH에 각각 매핑된다. PHY 계층에서, 상향링크 제어 정보(uplink control information, UCI)는 PUCCH에 매핑되고, 하향링크 제어 정 보(downlink control information, DCI)는 PDCCH에 매핑된다. UL-SCH와 관련된 MAC PDU는 상향링크 그랜트에 기초하여 PUSCH를 통해 UE에 의하여 전송되고, DL-SCH와 관련된 MAC PDU는 하향링크 배정에 기초하여 PDSCH를 통해 BS에 의하여 전송된다. UL-SCH를 통해 본 명세의 데이터 유닛(들)을 전송하기 위해, UE는 UE가 이용가능한 상향링크 자원을 가져야 한 다. DL-SCH를 통해 본 명세의 데이터 유닛(들)을 수신하기 위해, UE는 UE가 이용가능한 하향링크 자원을 가져야 한다. 자원 할당은 시간 도메인 자원 할당과 주파수 도메인 자원 할당을 포함한다. 본 명세에서, 상향링크 자원 할당을 상향링크 그랜트라고도 지칭되며, 하향링크 자원 할당을 하향링크 배정이라고도 지칭된다. 상향링크 그랜트는 임의 접속 응답내에서 PDCCH를 통해UE에 의해 동적으로 수신되거나, RRC에 의해 UE에 반-지속적으로 설 정된다. 하향링크 배정은 PDCCH를 통해 UE에 의해 동적으로 수신되거나 BS로부터 RRC 시그널링에 의해 UE에게 반-지속적으로 구성된다. 상향링크에서, BS는 PDCCH(들)상에서 셀 무선 네트워크 임시 식별자 (cell radio network temporary identifier; C-RNTI)를 통해 UE에 자원을 동적으로 할당할 수 있다. UE는 UE의 하향링크 수신이 인에이블될 때 (설정시 불연속 수신(discontinuous reception, DRX)에 의해 통제되는 활동(activity)) 상향링크 전송에 대한 가능한 그랜트를 찾기 위해 항상 PDCCH(들)를 모니터링한다. 또한, 설정된 그랜트를 사용하여 BS는 초기 HARQ 전송을 위한 상향링크 자원을 UE에게 할당할 수 있다. 두 가지 타입의 설정된 상향링크 그랜트가 정의된다: 즉, 타입 1과 타입2. 타입 1의 경우 RRC가 (주기를 포함한) 설정된 상향링크 그랜트를 직접 제공한다. 타입 2의 경 우 RRC는 설정된 스케쥴링 RNTI(configured scheduling RNTI, CS-RNTI)에 어드레스된 PDCCH가 설정된 상향링크 그랜트를 시그널링 및 활성화하거나 혹은 활성해제를 할 수 있는 동안에는 설정된 상향링크 그랜트의 주기를 정 의한다. 즉, CS-RNTI에 어드레스된 PDCCH는, 상향링크 그랜트가 활성해제될 때까지 상향링크 그랜트가 RRC에 의 해 정의된 주기에 따라 암묵적으로 재사용될 수 있음을 나타낸다. 하향링크에서, BS는 PDCCH(들)상에서 C-RNTI를 통해 자원을 UE에게 동적으로 할당할 수 있다. UE는 UE의 하향링 크 수신이 인에이블될 때(설정시 DRX에 의해 통제되는 활동) 가능한 그랜트를 찾기 위해 항상 PDCCH(들)를 모니 터링한다. 또한, 반-지속적 스케쥴링(semi-persistent scheduling, SPS)을 사용하여 BS는 초기 HARQ 전송을 위 한 하향링크 자원을 UE에게 할당할 수 있다. RRC는 CS-RNTI에 어드레스된 PDCCH가 설정된 하향링크 배정을 시그 널링 및 활성화하거나 혹은 활성해제를 할 수 있는 동안에는 설정된 하향링크 배정의 주기를 정의한다. 즉, CS- RNTI에 어드레스된 PDCCH는, 하향링크 배정이 비활성화될 때까지 하향링크 배정이 RRC에 의해 정의된 주기에 따 라 암묵적으로 재사용될 수 있음을 나타낸다. <PDCCH에 의한 자원 할당(즉, DCI에 의한 자원 할당)> PDCCH는 PDSCH 상의 하향링크 전송 및 PUSCH 상의 상향링크 전송을 스케줄링하는 데 사용될 수 있으며, 여기서 PDCCH 상의 DCI는: DL-SCH와 관련된, 변조 및 코딩 포맷(예, 변조 및 코딩 방식(modulation and coding scheme, MCS) 인덱스 (MCS index, IMCS)), 자원 할당 및 하이브리드 ARQ 정보를 적어도 포함하는 하향링크 배 정; 혹은 UL-SCH와 관련된, 변조 및 코딩 포맷, 자원 할당 및 하이브리드 ARQ 정보를 포함하는 상향링크 스케줄 링 그랜트를 포함한다. 하나의 PDCCH에 의하여 운반되는 DCI의 크기와 용도는 DCI 포맷에 따라 다르다. 예를 들 어, 3GPP NR 시스템에서 DCI 포맷 0_0 또는 DCI 포맷 0_1은 하나의 셀에서 PUSCH의 스케줄링을 위해 사용되고, DCI 포맷 1_0 또는 DCI 포맷 1_1은 하나의 셀에서 PDSCH의 스케줄링을 위해 사용된다. 도 7은 PDCCH에 의한 PDSCH 시간 도메인 자원 할당의 예와 PDCCH에 의한 PUSCH 시간 자원 할당의 예를 도시한 것이다. PDSCH 또는 PUSCH를 스케줄링하기 위해 PDCCH에 의하여 운반되는DCI는 PDSCH 또는 PUSCH에 대한 할당 테이블에 대하여 행(row) 인덱스 m+1에 대한 값 m을 포함한다. 기정의된 디폴트 PDSCH 시간 도메인 할당 A, B 또는 C가 PDSCH에 대한 할당 테이블로 적용되거나, RRC 설정된 pdsch-TimeDomainAllocationList가 PDSCH에 대한 할당 테 이블로 적용된다. 기정의된 디폴트 PUSCH 시간 도메인 할당 A가 PUSCH에 대한 할당 테이블로 적용되거나, RRC 설정된 pusch-TimeDomainAllocationList가 PUSCH에 대한 할당 테이블로 적용된다. 어떤 PDSCH 시간 도메인 자 원 할당 설정을 적용하고 어떤 PUSCH 시간 도메인 자원 할당 테이블을 적용할지는 고정된/기정의된 규칙(예, 3GPP TS 38.214 v15.3.0의 표 5.1.2.1.1-1, 3GPP TS 38.214 v15.3.0의 표 6.1.2.1.1-1)에 따라 결정된다. PDSCH 시간 도메인 할당 설정에서 각 인덱스된 행은 슬롯 오프셋 K0, 시작 및 길이 지시자 SLIV 또는 직접으로 시작 심볼 S 및 할당 길이 L, 그리고 PDSCH 수신에서 가정할 PDSCH 매핑 타입을 정의한다. PUSCH 시간 도메인 할당 설정에서 각 인덱스된 행은 슬롯 오프셋 K2, 시작 및 길이 지시자 SLIV 또는 직접적으로 시작 심볼 S 및 할당 길이 L, 그리고 PUSCH 수신에서 가정할 PUSCH 매핑 타입을 정의한다. PDSCH에 대한 K0 또는 PUSCH에 대한 K2는 PDCCH가 있는 슬롯과 PDCCH에 대응하는 PDSCH 또는 PUSCH가 있는 슬롯 간의 타이밍 차이이다. SLIV는 PDSCH 또는 PUSCH가 있는 슬롯의 시작에 대한 시작 심볼 S 및 심볼 S로부터 카운팅한 연속적 심볼들의 개수 L의 조인트 지시이다. PDSCH/PUSCH 매핑 타입의 경우 두 가지 매핑 타입이 있다: 하나는 매핑 RRC 시그널링에 따라 복조 참조 신호(demodulation reference signal, DMRS)가 슬롯의 3번째 또는 4번째 심볼에 위치하는 매핑 타입 A이고, 다른 하나는 DMRS가 첫 번째 할당된 심볼에 위치하는 매핑 타입 B이다. 스케줄링 DCI는 PDSCH 또는 PUSCH를 위해 사용되는 자원 블록에 관한 배정 정보를 제공하는 주파수 도메인 자원 배정 필드를 포함한다. 예를 들어, 주파수 도메인 자원 배정 필드는 PDSCH 또는 PUSCH 전송을 위한 셀에 관한 정보, PDSCH 또는 PUSCH 전송을 위한 대역폭 파트에 관한 정보, PDSCH 또는 PUSCH 전송을 위한 자원 블록에 관 한 정보를 UE에게 제공할 수 있다. < RRC에 의한 자원 할당> 앞서 언급된 바와 같이, 상향링크에서, 동적 그랜트가 없는 2가지 타입의 전송, 즉 설정된 그랜트 타입 1 및 설 정된 그랜트 타입2이 존재한다. 설정된 그랜트 타입 1의 경우 상향링크 그랜트가 RRC에 의해 제공되어 설정된 그랜트로서 저장된다. 설정된 그랜트 타입 2의 경우, 상향링크 그랜트가 PDCCH에 의해 제공되며 설정된 상향링 크 그랜트 활성화 또는 활성해제를 지시하는 L1 시그널링을 기반으로 설정된 상향링크 그랜트로서 저장 또는 제 거(clear)된다. 타입 1 및 타입 2는 서빙 셀 별 및 BWP별로 RRC 시그널링에 의해 설정된다. 다수의 설정들이 서 로 다른 서빙 셀들 상에서만 동시에 활성화될 수 있다. 타입 2의 경우 활성화 및 활성해제는 서빙 셀들 간에 독 립적이다. 동일한 서빙 셀에 대해 MAC 엔티티가 타입 1 혹은 타입 2로 설정된다. 설정된 그랜트 타입 1이 설정될 때 UE는 적어도 다음의 파라미터들을 RRC 시그널링을 통하여BS로부터 제공받는 다: - 재전송을 위한 CS-RNTI인cs-RNTI; - 설정된 그랜트 타입 1의 주기를 제공하는periodicity; - 시간 도메인에서 시스템 프레임 번호(system frame number, SFN) = 0에 대한 자원의 오프셋을 나타내는 timeDomainOffset; - 시작 심볼 S, 길이 L 및 PUSCH 매핑 타입의 조합을 나타내는, 할당 표를 자리키는 행 인덱스 m+1을 제공하는 timeDomainAllocation 값 m; - 주파수 도메인 자원 할당을 제공하는frequencyDomainAllocation; 및 - 변조 차수, 타겟 코드 레이트 및 수송 블록 크기를 나타내는 IMCS를 제공하는mcsAndTBS. RRC에 의해 서빙 셀 을 위한 설정된 그랜트 타입 1의 설정 시, UE는 RRC에 의해 제공되는 상향링크 그랜트를 지시된 서빙 셀을 위한 설정된 상향링크 그랜트로서 저장하고, timeDomainOffset 및 (SLIV로부터 유도되는) S에 따른 심볼에서 설정된 상향링크 그랜트가 시작하도록 그리고 주기적으로 재발생하도록 설정된 상향링크 그랜트를 초기화 또는 재-초기 화한다. 상향링크 그랜트가 설정된 그랜트 타입 1을 위해 설정된 후에, UE는 상향링크 그랜트가 다음을 만족하 는 각 심볼과 연관되어 재발한다고 간주한다: [(SFN * numberOfSlotsPerFrame (numberOfSymbolsPerSlot) + (slot number in the frame Х numberOfSymbolsPerSlot) + symbol number in the slot] = (timeDomainOffset * numberOfSymbolsPerSlot + S + N * periodicity) modulo (1024 * numberOfSlotsPerFrame * numberOfSymbolsPerSlot), for all N >= 0. 설정된 그랜트 타입 2가 설정될 때 UE는 적어도 다음과 같은 파라미터들을 RRC 시그널링을 통해 BS로부터 제공 받는다: - 활성화, 활성해제, 및 재전송을 위한 CS-RNTI인cs-RNTI; 및 -설정된 그랜트 타입 2의 주기를 제공하는periodicity. 실제 상향링크 그랜트는 (CS-RNTI로 어드레스된) PDCCH 에 의해 UE에게 제공된다. 상향링크 그랜트가 설정된 그랜트 타입 2에 대해 설정된 후에, UE는 상향링크 그랜트 가 다음을 만족하는 각 심볼과 연관되어 재발한다고 간주한다: [(SFN * numberOfSlotsPerFrame * numberOfSymbolsPerSlot) + (slot number in the frame * numberOfSymbolsPerSlot) + symbol number in the slot] = [(SFNstart time * numberOfSlotsPerFrame * numberOfSymbolsPerSlot + slotstart time * numberOfSymbolsPerSlot + symbolstart time) + N * periodicity] modulo (1024 Х numberOfSlotsPerFrame * numberOfSymbolsPerSlot), for all N >= 0, 여기서 SFNstart time, slotstart time, 및 symbolstart time은 설정된 그랜트 가 (재)초기화된, PUSCH의 첫 번째 전송 기회의 SFN, 슬롯, 심볼을 각각 나타낸다. numberOfSlotsPerFrame 및 numberOfSymbolsPerSlot은 프레임별 연속한 슬롯의 개수 및 슬롯별 연속한 OFDM 심볼의 개수를 각각 나타낸다. 설정된 상향링크 그랜트에 대하여, 상향링크 전송의 첫번째 심볼과 연관된 HARQ 프로세스 ID는 다음과 같은 수 식으로부터 유도된다: HARQ Process ID = [floor(CURRENT_symbol/periodicity)] modulo nrofHARQ-Processes 여기서. CURRENT_symbol = (SFN Х numberOfSlotsPerFrame Х numberOfSymbolsPerSlot + slot number in the frame Х numberOfSymbolsPerSlot + symbol number in the slot) 이며, numberOfSlotsPerFrame 및 numberOfSymbolsPerSlot은TS 38.211에 명시된 바와 같이 프레임별 연속한 슬롯의 개수 및 슬롯별 연속한 심볼의 개수를 각각 나타낸다. CURRENT_symbol은 발생되는 반복 번들의 첫번째 전송 기회의 심볼 인덱스를 나타낸다. HARQ 프로세스는 만일 설정된 상향링크 그랜트가 활성화되는 경우 설정된 상향링크 그랜트에 대하여 설정되며, 연관된 HARQ 프로세스 ID는 nrofHARQ-Processes 보다 작다. 하향링크의 경우, UE는 BS로부터 RRC 시그널링에 의해 서빙 셀별 및 BWP별로 SPS를 가지고 설정될 수 있다. 다 수의 설정들이 서로 다른 서빙 셀 상에서 동시에 활성화될 수 있다. 하향링크 SPS의 활성화 또는 활성해제는 서 빙 셀들 간에 독립적이다. 하향링크 SPS의 경우, 하향링크 배정이 PDCCH에 의하여 UE에게 제공되며, SPS 활성화 또는 활성해제를 지시하는 L1 시그널링을 기반으로 저장 또는 제거된다. SPS가 설정될 때 UE는 다음과 같은 파 라미터들을 RRC 시그널링을 통해 BS로부터 제공받는다: - 활성화, 활성해제, 및 재전송을 위한 CS-RNTI인cs-RNTI; - SPS를 위한 설정된 HARQ 프로세스의 개수를 제공하는 nrofHARQ-Processes; - SPS를 위한 설정된 하향링크 배정의 주기를 제공하는 periodicity. SPS가 상위 계층에 의하여 해제되면, 모든 해당 설정들은 해제되어야 한다. SPS에 대해 하향링크 배정이 설정된 후, UE는 N번째 하향링크 배정이 다음을 만족하는 슬롯에서 순차적으로 발 생한다고 간주할 수 있다: (numberOfSlotsPerFrame * SFN + slot number in the frame) = [(numberOfSlotsPerFrame * SFNstart time + slotstart time) + N * periodicity * numberOfSlotsPerFrame / 10] modulo (1024 * numberOfSlotsPerFrame), 여기서 SFNstart time and slotstart time 설정된 하향링크 배정이 (재)초기 화된, PDSCH의 첫 번째 전송의 SFN, 슬롯, 심볼을 각각 나타낸다. 설정된 하향링크 배정에 대하여, 하향링크 전송이 시작하는 슬롯과 연관된 HARQ 프로세스 ID는 다음과 같은 수 식으로부터 유도된다: HARQ Process ID = [floor (CURRENT_slot Х 10 / (numberOfSlotsPerFrame Х periodicity))] modulo nrofHARQ-Processes 여기서, CURRENT_slot = [(SFN Х numberOfSlotsPerFrame) + slot number in the frame] 이고 numberOfSlotsPerFrame은TS 38.211에 명시된 바와 같이 프레임별 연속한 슬롯의 개수를 나타낸다. 해당 DCI 포맷의 순환 리던던시 검사(cyclic redundancy check, CRC)가 RRC 파라미터 cs-RNTI에 의해 제공된 CS-RNTI를 가지고 스크램블되어 있고 인에이블된 수송 블록을 위한 새로운 데이터 지시자 필드가 0으로 세팅되 어 있으면, UE는, 스케줄링 활성화 또는 스케줄링 해제를 위해, 하향링크 SPS 배정 PDCCH 또는 설정된 상향링크 그랜트 타입 2 PDCCH를 유효하다고 확인한다. DCI 포맷에 대한 모든 필드들이 표 4 또는 표 5에 따라 세팅되어 있으면 상기 DCI 포맷의 유효 확인이 달성된다. 표 4는 하향링크 SPS 및 상향링크 그랜트 타입 2 스케줄링 활성 화 PDCCH 유효 확인을 위한 특정 필드들을 예시하고, 표5는 하향링크 SPS 및 상향링크 그랜트 타입 2 스케줄링 해제 PDCCH 유효 확인을 위한 특정 필드들을 예시한다. 표 4 DCI format 0_0/0_1 DCI format 1_0 DCI format 1_1 HARQ process number set to all '0's set to all '0's set to all '0's Redundancy version set to '00' set to '00' For the enabled transport block: set to '00' 표 5 DCI format 0_0 DCI format 1_0 HARQ process number set to all '0's set to all '0's Redundancy version set to '00' set to '00' Modulation and coding schemeset to all '1's set to all '1'sResource block assignmentset to all '1's set to all '1's 실제 하향링크 배정 및 실제 상향링크 그랜트, 그리고 해당 변조 및 코딩 방식은 하향링크 SPS 또는 상향링크 그랜트 타입 2 스케줄링 활성화 PDCCH에 의해 운반되는 DCI 포맷 내 자원 배정 필드들(예, 시간 도메인 배정 값 m을 제공하는 시간 도메인 자원 배정 필드, 주파수 자원 블록 할당을 제공하는 주파수 도메인 자원 배정 필드, 변조 및 코딩 방식 필드)에 의해 제공된다. 유효 확인이 달성되면, UE는 DCI 포맷 내 정보를 하향링크 SPS 또는 설정된 상향링크 그랜트 타입 2의 유효한 활성화 또는 유효한 해제인 것으로 간주한다. 상향링크의 경우, 본 명세의 프로세서(들)은 UE가 이용가능한 상향링크 그랜트에 기초하여 본 명세의 데이 터 유닛을 송신(또는 송신하도록 송수신기(들)를 제어)할 수 있다. 본 명세의 프로세서(들)는 UE가 이용가능한 상향링크 그랜트에 기초하여 본 명세의 데이터 유닛을 수신(또는 수신하도록 송수신기(들)을 제어)할 수 있다. 하향링크의 경우, 본 명세의 프로세서(들)은 UE가 이용가능한 하향링크 배정에 기초하여 본 명세의 하향링 크 데이터를 수신(또는 수신하도록 송수신기(들)을 제어)할 수 있다. 본 명세의 프로세서(들)는 UE가 이용가능한 하향링크 배정에 기초하여 본 명세의 하향링크 데이터를 송신(또는 송신하도록 송수신기(들)을 제어)할 수 있다. 본 발명의 데이터 유닛(들)은 무선 인터페이스를 통해 전송되기 전에는 송신측에서 물리 계층 처리가 수행되며, 본 발명의 데이터 유닛(들)을 운반하는 무선 신호들은 수신측에서 물리 계층 처리가 수행된다. 예를 들어, 본 명세에 따른 PDCP PDU를 포함하는 MAC PDU는 다음과 같이 물리 계층 처리가 수행될 수 있다. 도 8은 송신측에서의 물리 계층 처리의 예를 도시한다. 다음 표는 수송 채널(transport channel, TrCH) 및 제어 정보를 해당 물리 채널에 매핑하는 것을 나타낸다. 특 히, 표 6은 상향링크 수송 채널을 해당 물리 채널에 매핑하는 것을 나타내며, 표 7은 상향링크 제어 채널 정보 를 해당 물리 채널에 매핑하는 것을 나타내며, 표 8은 하향링크 수송 채널을 해당 물리 채널에 매핑하는 것을 나타내며, 표 9는 하향링크 제어 채널 정보를 해당 물리 채널에 매핑하는 것을 나타낸다. 표 6 TrCH Physical Channel UL-SCH PUSCH RACH PRACH 표 7 Control information Physical Channel UCI PUCCH, PUSCH 표 8 TrCH Physical Channel DL-SCH PDSCH BCH PBCH PCH PDSCH 표 9 Control information Physical Channel DCI PDCCH <인코딩> MAC 계층으로부터/으로의 데이터 및 제어 스트림은 인코딩되어 PHY 계층에서 무선 전송 링크를 통해 수송 및 제 어 서비스를 제공한다. 예를 들어, MAC 계층으로부터의 수송 블록은 송신측에서 코드워드로 인코딩된다. 채널 코딩 방식은 오류 감지, 오류 정정, 레이트 매칭, 인터리빙 및 물리 채널에 매핑되거나 물리 채널에서 분할되는 수송 채널 또는 제어 정보의 조합이다. 3GPP NR 시스템에서 서로 다른 타입의 TrCH 및 서로 다른 제어 정보 타입에 대해 다음과 같은 채널 코딩 방식이 사용된다. 표 10 TrCH Coding scheme UL-SCH LDPC DL-SCH PCH BCH Polar code 표 11 Control Information Coding scheme DCI Polar code UCI Block code Polar code 하향링크 수송 블록(즉, DL MAC PDU) 또는 상향링크 수송 블록(즉, UL MAC PDU)의 전송을 위해, 수송 블록 CRC 시퀀스가 부착되어 수신측에 대한 오류 검출을 제공한다. 3GPP NR 시스템에서 통신 기기는 UL-SCH 및 DL-SCH를 인코딩/디코딩할 때 저밀도 패리티 검사 (low density parity check, LDPC) 코드를 사용한다. 3GPP NR 시스템 은 두 개의 LDPC 기본 그래프(즉, 두 개의 LDPC 기본 행렬)를 지원한다: 즉, 작은 수송 블록에 최적화된 LDPC 기본 그래프 1과 더 큰 수송 블록에 최적화된 LDPC 기본 그래프 2. LDPC 기본 그래프 1 또는 2는 수송 블록의 크기 및 코딩 레이트 R에 기초하여 선택된다. 코딩 레이트 R은 MCS 인덱스(IMCS)에 의하여 지시된다. MCS 인덱 스는, 상향링크 설정된 그랜트 2 또는 하향링크 SPS를 활성화 또는 (재)초기화하는 PDCCH에 의해 UE에 제공되거 나, 상향링크 설정된 그랜트 타입1에 관련된 RRC 시그널링에 의해 UE에게 제공되는, PUSCH 또는 PDSCH를 스케줄 링화는 PDCCH에 의해 UE에 동적으로 제공된다. CRC 부착된 수송 블록이 선택된 LDPC 기본 그래프에 대한 최대 코드 블록 크기보다 큰 경우, CRC 부착된 수송 블록은 코드 블록들로 분할될 수 있으며, 각 코드 블록에는 추가 CRC 시퀀스가 부착된다. LDPC 기본 그래프 1 및 LDPC 기본 그래프 2의 최대 코드 블록 크기는 각각 8448비트 및 3480비트이다. CRC 부착된 수송 블록이 선택된 LDPC 기본 그래프에 대한 최대 코드 블록 크기보다 크지 않은 경 우, CRC 부착된 수송 블록은 선택된 LDPC 기본 그래프를 사용하여 인코딩된다. 수송 블록의 각 코드 블록은 선 택된 LDPC 기본 그래프를 사용하여 인코딩된다. 그런 다음, LDPC 코딩된 블록들은 개별적으로 레이트 매칭된다. 코드 블록 연접이 수행되어 PDSCH 또는 PUSCH 상에서 전송을 위한 코드워드를 생성한다. PDSCH의 경우 최대 2개 의 코드워드(즉, 최대 2개의 전송 블록)가 PDSCH상에서 동시에 전송될 수 있다. PUSCH는 UL-SCH 데이터 및 레이 어 1/2 제어 정보의 전송에 사용될 수 있다. 도 8에 도시되지는 않았지만. 레이어 1/2 제어 정보는 UL-SCH 데이 터에 대한 코드워드와 다중화될 수 있다. <스크램블링 및 변조> 코드워드의 비트들은 스크램블링 및 변조되어 복소수 값 변조 심볼들의 블록을 생성한다. <레이어 매핑> 코드워드의 복소수 값 변조 심볼들은 하나 이상의 다중 입력 다중 출력(multiple input multiple output MIMO) 계층에 매핑된다. 코드워드는 최대 4개의 레이어에 매핑될 수 있다. PDSCH는 2개의 코드워드를 전달할 수 있으 므로 PDSCH는 최대8-계층 전송을 지원할 수 있다. PUSCH는 단일 코드워드를 지원하므로 PUSCH는 최대 4-계층 전 송을 지원할 수 있다. <변환 프리코딩(transform precoding)> 하향링크 전송 파형은 순환 전치(cyclic prefix, CP)를 사용하는 종래의 OFDM이다. 하향링크의 경우 변환 프리 코딩(즉, 이산 후리에 변환(discrete Fourier transform, DFT))이 적용되지 않는다. 상향링크 전송 파형은 디스에이블 또는 인에이블될 수 있는 DFT 확산을 수행하는 변환 프리코딩 기능이 있는 CP 를 사용하는 종래의 OFDM이다. 3GPP NR 시스템에서 상향링크의 경우 변환 프리코딩은 인에이블되는 경우 선택적 으로 적용될 수 있다. 변환 프리코딩은 상향링크 데이터를 특별한 방식으로 확산하여 파형의 피크 대 평균 전력 비(peak-to-average power ratio (PAPR)를 줄이는 것이다. 변환 프리코딩은 DFT의 한 형태이다. 즉, 3GPP NR 시스템은 상향링크 파형에 대해 두 가지 옵션을 지원한다: 즉, 하나는 (하향링크 파형과 동일한) CP-OFDM이고 다른 하나는 DFT-s-OFDM이다. UE가 CP-OFDM을 사용해야 하는지 DFT-s-OFDM을 사용해야 하는지는 RRC 파라미터를 통해 BS에 의해 설정된다. <부반송파 매핑> 레이어는 안테나 포트에 매핑된다. 하향링크에서는 레이어-안테나 포트 매핑에 대해 투명한 방식(비-코드북 기 반) 매핑이 지원되며 빔포밍 또는 MIMO 프리코딩이 어떻게 수행되는지는 UE에게 투명한다. 상향링크에서는 레이 어-안테나 포트 매핑에 대해 비-코드북 기반 매핑과 코드북 기반 매핑 둘 다 지원된다. 물리 채널(예, PDSCH, PUSCH)의 전송을 위하여 사용되는 각 안테나 포트(즉, 계층)에 대해, 복소수 값 변조 심 볼들은 물리 채널에 할당된 자원 블록들에서 부반송파들에 매핑된다. < OFDM 변조> 송신 측에서의 통신 기기는 CP를 추가하고 역 고속 푸리에 변환(inverse fast Fourier transform, IFFT)을 수 행하여 물리 채널에 대한 TTI에서 OFDM 심볼 l에 대한 안테나 포트 p 및 부반송파 간격 설정 u에서 시간 연속 OFDM 기저대역 신호를 생성한다. 예를 들어, 각 OFDM 심볼에 대해 송신측에서의 통신 기기는 해당 OFDM 심볼에 서 자원 블록에 매핑되는 복소수 값 변조 심볼에 대해 IFFT를 수행할 수 있으며 IFFT된 신호에 CP를 추가하여 OFDM 기저대역 신호를 생성할 수 있다. <상향 변환 (up-conversion> 송신 측에서의 통신 기기는 안테나 포트 p, 부반송파 간격 설정 u 및 OFDM 심볼 l에 대한 OFDM 기저대역 신호를 물리 채널이 할당되는 셀의 반송파 주파수 f0로 상향 변환한다. 도 2에서 프로세서(102, 202)는 도 2는 인코딩, 스크램블링, 변조, 계층 매핑, (상향링크용) 변환 프리코딩, 부 반송파 매핑 및 OFDM 변조를 수행하도록 구성될 수 있다. 프로세서(102, 202)는 프로세서(102, 202)에 연결된 송수신기(106, 206)를 제어하여 OFDM 기저대역 신호를 반송파 주파수로 상향 변환하여 무선 주파수 (radio frequency, RF) 신호를 발생할 수 있다. 무선 주파수 신호는 안테나(108, 208)를 통해 외부 기기로 전송된다. 도 9는 수신측에서의 물리 계층 처리의 예를 도시한다. 수신측에서의 물리 계층 처리는 송신측에서의 물리 계층 처리와 기본적으로 역 처리이다. <주파수 하향 변환 (down-conversion)> 수신 측에서의 통신 기기는 안테나를 통하여 반송파 주파수에서 RF 신호를 수신한다. 반송파 주파수에서 RF 신 호를 수신하는 송수신기(106, 206)는RF 신호의 반송파 주파수를 기저대역으로 하향 변환하여 OFDM 기저대역 신 호를 획득한다. < OFDM 복조> 수신측에서의 통신 기기는 CP 분리(detachment) 및 FFT를 통해 복소수 값 변조 심볼들을 얻는다. 예를 들어, 각 OFDM 심볼에 대해 수신 측에서 통신 기기는 OFDM 기저대역 신호로부터 CP를 제거하고 CP-제거된 OFDM 기저대역 신호에 대해 FFT를 수행하여 안테나 포트 p, 부반송파 간격 u 및 OFDM 심벌 l에 대한 복소수 값 변조 심볼들을 얻는다. <부반송파 디매핑> 복소수 값 변조 심볼들에 대해 부반송파 디매핑을 수행하여 해당 물리 채널의 복소수 값 변조 심볼들을 획득한 다. 예를 들어, 프로세서(들)는 BWP에서 수신되는 복소수 값 변조 심볼들 중에서 PDSCH에 속하는 부반송파 들에 매핑되는 복소수 값 변조 심볼들을 획득할 수 있다. 또 다른 예로서, 프로세서(들)는 BWP에서 수신되 는 복소수 값 변조 심볼들 중에서 PUSCH에 속하는 부반송파들에 매핑되는 복소수 값 변조 심볼들을 획득할 수있다. <변환 디프리코딩> 변환 디프리코딩(예, IDFT)은 상향링크 물리 채널에 대해 변환 프리코딩이 인에이블되어 있는 경우 상향링크 물 리 채널의 복소수 값 변조 심볼에 대해 수행된다. 하향링크 물리채널 및 변환 프리코딩이 디스에이블되어 있는 상향링크 물리채널에 대해서는 변환 디프리코딩이 수행되지 않는다. <레이어 디매핑> 복소수 값 변조 심볼들은 하나 또는 두 개의 코드워드로 디맵핑된다. <복조 및 디스크램블링> 코드워드의 복소수 값 변조 심볼들은 코드워드의 비트들로 복조되고 디스크램블링된다. <디코딩> 코드워드는 수송 블록으로 디코딩된다. UL-SCH 및 DL-SCH에 대해 LDPC 기본 그래프 1 또는 2가 수송 블록의 크 기 및 코딩 레이트 R에 기초하여 선택된다. 코드워드는 하나 또는 복수의 코딩된 블록들을 포함할 수 있다. 각 코딩된 블록은 선택된 LDPC 기본 그래프를 사용하여 CRC 부착된 코드 블록 또는 CRC 부착된 수송 블록으로 디코 딩된다. 송신측에서 CRC가 부착된 수송 블록에 대해 코드 블록 분할을 수행하는 경우, CRC 시퀀스가 CRC 부착된 코드 블록들의 각각으로부터 제거되어 코드 블록들이 획득된다. 코드 블록들은 CRC 부착된 수송 블록으로 연접 된다. 수송 블록 CRC 시퀀스가 CRC 부착된 수송 블록으로부터 제거되어 수송 블록이 얻어진다. 수송 블록은 MAC 계층으로 전달된다. 상술한 송신측 및 수신측에서의 물리계층 처리에서, 부반송파 매핑, OFDM 변조 및 주파수 상향/하향 변환과 관 련된 시간 및 주파수 도메인 자원들(예: OFDM 심볼, 부반송파, 캐리어 주파수)은 자원 할당(예, 상향링크 그랜 트, 하향링크 배정)을 기반으로 결정될 수 있다. 상향링크 데이터 전송을 위해, 본 명세의 프로세서(들)는 송신측에서의 전술한 물리 계층 처리를 본 명세 의 데이터 유닛에 적용(또는 적용하도록 송수신기(들)을 제어)하여 데이터 유닛을 무선으로 송신할 수 있 다. 하향링크 데이터 수신을 위해, 본 명세의 프로세서(들)는 수신측에서의 전술한 물리 계층 처리를 수신 된 무선 신호들에 적용(또는 적용하도록 송수신기(들)을 제어)하여 본 명세의 데이터 유닛을 획득할 수 있 다. 하향링크 데이터 전송을 위해, 본 명세의 프로세서(들)는 송신측에서의 전술한 물리 계층 처리를 본 명세 의 데이터 유닛에 적용(또는 적용하도록 송수신기(들)을 제어)하여 데이터 유닛을 무선으로 송신할 수 있 다. 상향링크 데이터 수신을 위해, 본 명세의 프로세서(들)는 수신측에서의 전술한 물리 계층 처리를 수신 된 무선 신호들에 적용(또는 적용하도록 송수신기(들)을 제어)하여 본 명세의 데이터 유닛을 획득할 수 있 다. 도 10은 본 명세의 구현들에 기반한 무선 기기들의 동작들을 도시한다. 도 2의 제1 무선기기는 본 명세에서 설명된 기능들, 절차들 및/또는 방법들에 따라 제1 정보/신호들을 생 성한 다음, 제1 정보/신호들을 포함하는 무선 신호들을 도 2의 제2 무선 기기로 무선으로 전송할 수 있다 (S10). 제1 정보/신호들은 본 명세의 데이터 유닛(들)(예, PDU, SDU, RRC 메시지)을 포함할 수 있다. 제1 무선 기기는 제2 무선 기기로부터 제2 정보/신호들을 포함하는 무선 신호들을 수신한 다음(S30), 제2 정보 /신호들에 기초하여 또는 따라 동작들을 수행할 수 있다(S50). 제2 정보/신호들은 제1 정보/신호들에 응답하여 제2 무선 기기에 의해 제1 무선 기기로 전송될 수 있다. 제2 정보/신호들은 본 명세의 데이터 유닛 (들)(예, PDU, SDU, RRC 메시지)을 포함할 수 있다. 제1 정보/신호들은 컨텐츠 요청 정보를 포함할 수 있고, 제 2 정보/신호들은 제1 무선 기기의 용도에 특정한 컨텐츠를 포함할 수 있다. 무선 기기(100, 200)의 용도에 특정한 동작들의 일부 예가 이하에 설명될 것이다. 일부 시나리오에서, 제1 무선 기기는 본 명세에서 설명된 기능들, 절차들, 및/또는 방법들을 수행하는 도 1의 휴대 기기(100d)일 수 있다. 휴대 기기(100d)는 사용자에 의해 입력된 정보/신호들(예, 터치, 텍스트, 음성, 이미지, 또는 비디오)를 획득하고, 획득된 정보/신호들을 제1 정보/신호들로 변환할 수 있다. 휴대 기기 (100d)는 제1 정보/신호들을 제2 무선 기기로 전송할 수 있다(S10). 제2 무선 기기는 도 1의 무선 기 기(100a 내지 100f) 중 어느 하나이거나 BS일 수 있다. 휴대 기기(100d)는 제2 무선 기기로부터 제2 정보/신호들을 수신하고(S30), 제2 정보/신호들에 기초한 동작을 수행할 수 있다(S50). 예를 들어, 휴대 기기(100d) 는 제2 정보/신호들의 내용을 휴대 기기(100d)의 I/O 유닛을 통해 사용자에게 (예, 텍스트, 음성, 이미지, 비디 오 또는 햅틱의 형태로) 출력할 수 있다. 일부 시나리오에서, 제1 무선 기기는 본 명세에서 설명된 기능들, 절차들 및/또는 방법들을 수행하는 차량 또는 자율 주행 차량(100b)일 수 있다. 차량(100b)은 신호들(예, 데이터 및 제어 신호들)을 통신부(예, 도 1C의 통신부)를 통하여 다른 차량, BS(예, gNB 및 도로변 기기), 서버와 같은 외부 기기로 및 외부기기로부터 송신(S10) 및 수신(S30)할 수 있다. 차량(100b)은 구동부를 포함할 수 있고, 구동부는 차량(100b)이 도로상에서 주행하도록 할 수 있다. 차량(100b)의 구동부는 엔진, 모터, 파워트레인, 바퀴, 브레이크, 조향 기기 등을 포함 할 수 있다. 차량(100b)은 차량 상태, 주변 환경 정보, 사용자 정보 등을 획득하기 위한 센서부를 포함할 수 있 다. 차량(100b)은 제1 정보/신호들을 생성하여 제2 무선 기기로 전송할 수 있다(S10). 제1 정보/신호들은 차량 상태 정보, 주변 환경 정보, 사용자 정보 등을 포함할 수 있다. 차량(100b)은 제2 무선 기기로부터 제2 정보/신호들을 수신할 수 있다(S30). 제2 정보/신호들은 차량 상태 정보, 주변 환경 정보, 사용자 정보 등 을 포함할 수 있다. 차량(100b)은 제2 정보/신호들에 기초하여 도로를 주행하거나, 정지하거나, 속도를 조절할 수 있다(S50). 예를 들어, 차량(100b)은 외부 서버로부터 지도 데이터 및 교통 정보 데이터 등을 포함하는 제2 정보/신호들을 수신할 수 있다(S30). 차량(100b)은 제2 정보/신호들에 기초하여 자율 주행 경로 및 주행 계획을 생성하고, 주행 계획에 따른 (예, 속도/방향 제어) 자율 주행 경로를 따라 이동할 수 있다(S50). 다른 예로, 차 량(100b)의 제어부 또는 프로세서(들)는 차량(100b)의 GPS 센서를 통해 획득한 지도 정보, 교통 정보 및 차량 위치 정보에 기초하여 가상 객체를 생성할 수 있으며 차량(100b)의 I/O부는 생성된 가상 객체를 차량 (100b)의 윈도우에 표시할 수 있다(S50). 일부 시나리오에서, 제1 무선 기기는, 본 명세에서 설명된 기능들, 절차들 및/또는 방법들을 수행하는 도 1의 XR 기기(100c)일 수 있다. XR 기기(100c)는 통신부(예, 도1C의 통신부)을 통하여 다른 무선 기기, 휴 대 기기 또는 미디어 서버와 같은 외부 기기로 및 외부기기로부터 신호들(예, 미디어 데이터 및 제어 신호)을 송신(S10) 및 수신(S30)할 수 있다. 예를 들어, XR 디바이스(100c)는 컨텐츠 요청 정보를 다른 기기 또는 미디 어 서버로 전송하고(S10), 다른 기기 또는 미디어 서버로부터 영화나 뉴스와 같은 컨텐츠를 다운로드/스트리밍 하고(S30), 무선으로 수신한 제2 정보/신호들에 기초하여, XR 기기의 I/O부를 통해 XR 객체(예, AR/VR/MR 객 체)를 생성, 출력 또는 디스플레이한다(S50). 일부 시나리오에서, 제1 무선 기기는 본 명세에서 설명된 기능들, 절차들 및/또는 방법들을 수행하는 도 1 의 로봇(100a)일 수 있다. 로봇(100a)은 사용 목적이나 분야에 따라 산업용 로봇, 의료용 로봇, 가정용 로봇, 군사용 로봇 등으로 분류될 수 있다. 로봇(100a)은 통신부(예, 도 1C의 통신부)를 통해 다른 무선 기기, 다른 로봇 또는 제어 서버와 같은 외부 기기로 및 외부기기로부터 신호들(예: 주행 정보 및 제어 신호들)을 송 신(S10) 및 수신(S30)할 수 있다. 제2 정보/신호들은 로봇(100a)에 대한 구동 정보 및 제어 신호들을 포함할 수 있다. 로봇(100a)의 제어부 또는 프로세서(들)는 제2 정보/신호들에 기초하여 로봇(100a)의 움직임을 제어할 수 있다. 일부 시나리오에서, 제1 무선 기기는 도 1의 AI 기기일 수 있다. AI 기기는 TV, 프로젝터, 스마트폰, PC, 노트북, 디지털 방송 단말, 태블릿 PC, 웨어러블 기기, 셋톱 박스(set-top box, STB), 라디오, 세탁기, 냉 장고, 디지털 사이니지, 로봇, 차량 등과 같은 고정 기기 또는 모바일 기기에 의하여 구현될 수 있다. AI 기기 는 유무선 통신 기술을 사용하여 다른 AI 기기(예, 도 1의 100a,쪋, 100f, 200 혹은 400) 또는 AI 서버 (예, 도 1의 400)와 같은 외부 기기로 및 외부기기로부터. 유무선 신호들(예, 센서 정보, 사용자 입력, 학습 모 델 또는 제어 신호)를 송신(S10) 및 수신(S30)할 수 있다. AI 기기의 제어부 또는 프로세서(들)는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 이용하여 결정되거나 생성된 정보에 기초하여 AI 기기의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. AI 기기는 다른 AI 기기나 AI 서버와 같은 외부 기기에게 센 서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 AI 기기에 제공하도록 요청할 수 있다(S10). AI 기기 는 제2 정보/신호들(예, 센서 정보, 사용자 입력, 학습 모델 또는 제어 신호)을 수신할 수 있고(S30), AI 기기는 제2 정보/신호들에 기초하여 예측한 동작 혹은 적어도 하나의 실행 가능한 동작 중에서 선호하는 것으로 결정된 동작을 수행할 수 있다(S50). 이하에서는 NR 시스템에서 버퍼 상태 보고 (BSR)에 대해 설명한다. BSR 절차는 서빙 gNB에게 MAC 엔터티의 상향링크 데이터 볼륨에 대한 정보를 제공하기 위해 사용된다. RC는 BSR을 제어하기 위해 다음과 같은 파라미터를 구성한다: - periodicBSR-Timer; - retxBSR-Timer; - logicalChannelSR-DelayTimerApplied; - logicalChannelSR-DelayTimer; - logicalChannelSR-Mask; - logicalChannelGroup. 각 논리 채널은 logicalChannelGroup을 사용하여 LCG에 할당될 수 있다. 최대 LCG 수는 8이다. MAC 엔터티는 3GPP TS 38.322 및 3GPP TS 38.323의 데이터 볼륨 계산 절차에 따라 논리 채널에 대해 사용 가능한 상향링크 데 이터의 양을 결정한다. BSR은 다음 1) 내지 4)의 이벤트가 발생하면 트리거될 것이다: 1) LCG에 속하는 논리 채널에 대한 상향링크 데이터는 MAC 엔터티가 사용할 수 있게 된다; 이 상향링크 데이터 는 임의의 LCG에 속하는 이용 가능한 상향링크 데이터를 포함하는 임의의 논리 채널의 우선 순위보다 더 높은 우선 순위를 갖는 논리 채널에 속하거나 LCG에 속하는 논리 채널 중 어떤 것도 이용 가능한 상향링크 데이터를 포함하지 않는다. 이때 BSR은 이하에서 '일반 BSR'이라 한다; 2) UL 자원이 할당되고 패딩 비트의 수는 버퍼 상태 보고(BSR) MAC CE에 서브헤더를 더한 크기보다 크거나 같으 며, 이 경우 BSR은 이하 '패딩 BSR'로 지칭된다; 3) retxBSR-Timer 가 만료되고 LCG에 속하는 논리 채널 중 적어도 하나는 상향링크 데이터를 포함하며, 이 경우 BSR은 아래에서 '일반 BSR'이라고 한다; 4) periodicBSR-Timer 가 만료되는 경우 BSR은 아래에서 '주기적 BSR'이라고 한다. 특히, 다수의 논리 채널에 대해 일반 BSR 트리거링 이벤트가 동시에 발생하는 경우, 각각의 논리 채널은 하나의 별도의 일반 BSR을 트리거링한다. 일반 BSR의 경우, MAC 엔티티는 상위 계층에 의해 logicalChannelSR-DelayTimerApplied가 설정된 논리 채널에 대해 BSR이 트리거되면 logicalChannelSR-DelayTimer를 시작하거나 재시작해야 한다. 그렇지 않으면, logicalChannelSR-DelayTimer 가 실행 중일 때 MAC 엔티티는 logicalChannelSR-DelayTimer를 중지해야 한다. 일반 및 주기적 BSR의 경우, MAC 엔티티는 BSR을 포함하는 MAC PDU가 구축될 때 하나 이상의 LCG가 전송 가능한 데이터를 가지고 있는 경우 전송 가능한 데이터가 있는 모든 LCG에 대해 Long BSR을 보고해야 한다. 그렇지 않 으면 MAC 엔티티는 Short BSR을 보고해야 한다. 패딩 BSR의 경우, 패딩 비트의 수가 Short BSR에 서브헤더를 더한 크기 이상이고 Long BSR에 서브헤더를 더한 크기보다 작은 경우, 하나 이상의 LCG에 BSR이 구축될 때 전송에 사용할 수 데이터가 있는 경우, 그리고 패딩 비트 수가 Short BSR와 서브헤더를 더한 크기와 같은 경우, MAC 엔티티는 전송 가능한 데이터를 가진 우선 순위 가 가장 높은 논리 채널을 가진 LCG의 Short Truncated BSR을 보고해야 한다. 그러나, 패딩 비트의 수가 Short BSR와 서브헤더를 더한 크기가 같지 않은 경우, MAC 엔티티는 이러한 LCG(들) 각각에서 가장 높은 우선 순위 논 리 채널(전송에 사용 가능한 데이터 포함하거나 포함하지 않음)에서 내림차순으로 전송에 사용 가능한 데이터를 갖는 논리 채널을 가진 LCG(들)의 Long Truncated BSR을 보고해야 하는데, 우선 순위가 동일한 경우 LCGID의 오 름차순으로 한다. 또한, BSR이 구축될 때 하나 이상의 LCG가 전송 가능한 데이터를 가지고 있지 않다면, MAC 엔티티는 Short BSR 을 보고해야 한다. 마지막으로, 패딩 비트의 수가 Long BSR와 해당 서브헤더를 더한 크기와 같거나 크면 MAC 엔 티티는 전송할 수 있는 데이터가 있는 모든 LCG에 대해 Long BSR을 보고해야 한다. retxBSR-Timer 만료에 의해 트리거된 BSR의 경우, MAC 엔티티는 BSR을 트리거한 논리 채널이 BSR이 트리거된 시 간에 전송 가능한 데이터를 가진 가장 높은 우선순위 논리 채널이라고 간주한다. 버퍼 상태 보고 절차가 적어도 하나의 BSR이 트리거되고 취소되지 않은 것으로 판단하고, 논리 채널 우선순위의 결과, UL-SCH 자원이 새로운 전송을 위해 사용 가능하고 UL-SCH 자원이 BSR MAC CE와 그 서브헤더를 수용할 수 있는 경우, MAC 엔티티는 다중화 및 조립 절차에 BSR MAC CE(들)을 생성하도록 지시하고, 생성된 모든 BSR이long 또는 short Truncated BSR인 경우를 제외하고 periodicBSR-Timer를 시작(또는 재시작)하고 retxBSR-Timer 를 시작(또는 재시작)한다. 단, 일반 BSR이 트리거되었고 logicalChannelSR-DelayTimer가 실행되지 않는다면, 새로운 전송에 사용할 수 있는 UL-SCH 자원이 없거나 설정된 상향링크 그랜트(들)로 MAC 엔티티가 구성되고 logicalChannelSR-Mask가 false로 설정된 논리 채널에 대하여 일반 BSR 트리거된 경우; 또는 새로운 전송에 사 용할 수 있는 UL-SCH 자원이 BSR을 트리거한 논리 채널에 대해 구성된 LCP 매핑 제한을 충족하지 않는 경우, MAC 엔티티는 스케줄링 요청을 트리거해야한다. MAC 엔티티가 설정된 상향링크 그랜트 유형에 대한 활성 구성을 가지고 있거나, MAC 엔티티가 동적 상향링크 그 랜트를 수신했거나, 이 두 조건이 모두 충족되는 경우 UL-SCH 자원이 사용 가능한 것으로 간주된다. MAC 엔티티 가 주어진 시점에서 UL-SCH 자원이 이용 가능하다고 결정했다면, 이는 그 시점에서 UL-SCH 자원이 이용 가능하 다는 것을 의미할 필요는 없다. 여러 이벤트가 BSR을 트리거한 경우에도 MAC PDU는 최대 하나의 BSR MAC CE를 포함해야 한다. 일반 BSR과 주기 적 BSR은 패딩 BSR보다 우선해야 한다. MAC 엔티티는 임의의 UL-SCH에서 새로운 데이터 전송에 대한 그랜트를 수신하면 retxBSR-Timer를 재시작해야 한 다. 모든 트리거된 BSR은 상향링크 그랜트(들)가 전송에 이용 가능한 모든 보류 데이터를 수용할 수 있지만 BSR MAC CE와 그 서브헤더를 추가로 수용하기에 충분하지 않을 때 취소될 수 있다. MAC PDU 조립 이전에 트리거된 모든 BSR은 MAC PDU가 전송될 때 취소되어야 하며 이 PDU에는 MAC PDU 조립 이전에 BSR을 트리거한 마지막 이벤트까 지 (포함하는) 버퍼 상태를 포함하는 Long 또는 Short BSR MAC CE가 포함된다. MAC PDU 조립은 상향링크 그랜트 수신과 해당 MAC PDU의 실제 전송 사이의 어느 시점에서나 일어날 수 있다. BSR 및 SR은 BSR MAC CE를 포함하는 MAC PDU의 조립 후 이 MAC PDU의 전송 전에 트리거될 수 있다. 또한 BSR 및 SR은 MAC PDU 조립도중에 트리거될 수 있다. 이하, BSR MAC CE에 관하여 설명한다. BSR MAC CE는 Short BSR 포맷 (고정 크기) 또는 Long BSR 포맷(가변 크기) 또는 Short Truncated BSR 포맷 (고 정 크기) 또는 Long Truncated BSR 포맷 (가변 크기)로 구성된다. BSR 포맷은 LCID가 있는 MAC PDU 서브헤더로 식별된다. BSR MAC CE의 필드는 다음과 같다: i) LCG ID: 논리 채널 그룹 ID 필드는 버퍼 상태가 보고되는 논리 채널 그룹을 식별한다. 필드의 길이는 3비트 이다; ii) LCGi: Long BSR 포맷의 경우, 이 필드는 논리 채널 그룹 i에 대한 버퍼 크기 필드의 존재를 나타낸다. \"1\" 로 설정된 LCGi 필드는 논리 채널 그룹 i에 대한 버퍼 크기 필드가 보고됨을 나타낸다. \"0\"으로 설정된 LCGi필 드는 논리 채널 그룹 i에 대한 버퍼 크기 필드가 보고되지 않음을 나타낸다. Long Truncated BSR 포맷의 경우, 이 필드는 논리 채널 그룹 i에 사용 가능한 데이터가 있는지 여부를 나타낸다. \"1\"로 설정된 LCGi 필드는 논리 채널 그룹 i에 사용 가능한 데이터가 있음을 나타낸다. \"0\"으로 설정된 LCGi 필드는 논리 채널 그룹 i에 사용 가능한 데이터가 없음을 나타낸다; iii) Buffer Size: Buffer Size 필드는 MAC PDU가 구축된 후 (즉, Buffer Size 필드의 값을 0으로 설정하는 논 리 채널 우선 순위 지정 절차 후) 논리 채널 그룹의 모든 논리 채널에서 데이터 볼륨 계산 절차에 따라 사용 가 능한 총 데이터 양을 식별한다. 데이터의 양은 바이트 수로 표시된다. RLC 및 MAC 헤더의 크기는 버퍼 크기 계 산에서 고려되지 않는다. Short BSR 포맷 및 Short Truncated BSR 포맷에 대한 이 필드의 길이는 5비트이다. Long BSR 포맷 및 Long Truncated BSR 포맷에 대한 이 필드의 길이는 8비트이다. 5비트 및 8비트 Buffer Size 필드의 값은 각각 표 1과 2에 나와 있다. Long BSR 포맷 및 Long Truncated BSR 포맷의 경우, Buffer Size 필드가 LCGi를 기준으로 오름 차순으로 포함된다. Long Truncated BSR 포맷의 경우, 포함된 Buffer Size 필드의 수가 최대화되지만 패딩 비트 수를 초과하지 않는다. Long BSR 및 Long Truncated BSR 포맷의 Buffer Size 필드의 수는 0이 될 수 있다. MAC 버퍼 상태 보고의 목적으로, UE는 아직 RLC 데이터 PDU에 포함되지 않은 RLC SDU 및 RLC SDU 세그먼트, 초 기 전송을 위해 보류 RLC 데이터 PDU, 및 재전송을 위해 보류 RLC 데이터 PDU (RLC AM)를 RLC 데이터 볼륨으로 간주하여야 한다: 또한, STATUS PDU가 트리거되었고 t-StatusProhibit이 실행 중이 아니거나 만료된 경우, UE는 다음 전송 기회에 전송할 STATUS PDU의 크기를 추정하고 이를 RLC 데이터 볼륨의 일부로 고려해야 한다. 이하에서는 NR 시스템에서 논리 채널 우선순위를 설명한다. 논리적 채널 우선 순위 절차는 새로운 전송이 수행될 때 적용된다. RRC는 각 논리 채널에 대한 시그널링을 통해 상향링크 데이터의 스케줄링을 제어한다: 우선 순위 값이 증가할수록 우선 순위 수준이 낮아짐을 나타내는 priority, PBR (Prioritized Bit Rate)을 설정하는 prioritisedBitRate, BSD (Bucket Size Duration)를 설정 하는 bucketSizeDuration. MAC 엔티티는 각 논리 채널 j에 대해 변수 Bj를 유지해야 한다. Bj는 관련 논리 채널이 구축될 때 0으로 초기화 되고 각 TTI에 대한 PBR × TTI 기간의 곱으로 증가하는데, 여기서 PBR은 논리 채널 j의 우선 순위 비트 전송률 이다. 단, Bj 값은 절대 버킷 크기를 초과할 수 없으며, Bj의 값이 논리 채널 j의 버킷 크기보다 크면 버킷 크 기로 설정해야 한다. 논리 채널의 버킷 크기는 PBR × BSD과 동일하며, 여기서 PBR과 BSD는 상위 계층에서 구성 된다. 새로운 전송이 진행될 때 MAC 엔티티는 다음의 논리 채널 우선순위 절차를 수행하여야 한다: - MAC 엔티티는 이하 단계 1 내지 3에서 자원들을 논리 채널들로 할당하여야 한다: 단계 1: Bj > 0인 모든 논리 채널은 내림차순으로 자원이 할당된다. 논리 채널의 PBR이 \"무한대\"로 설정되면 MAC 엔티티는 낮은 우선 순위 논리 채널의 PBR을 충족하기 전에 논리 채널에서 전송에 사용할 수 있는 모든 데 이터에 대한 자원을 할당해야 한다; 단계 2: MAC 엔티티는 단계 1에서 논리 채널 j로 서비스되는 MAC SDU의 총 크기만큼 Bj를 감소시켜야 한다. 특 히, Bj의 값은 음수가 될 수 있다. 단계 3: 자원이 남아 있으면 해당 논리 채널에 대한 데이터 또는 상향링크 그랜트 중 먼저 오는 것이 소진될 때 까지 모든 논리 채널이 엄격한 내림차순 우선 순위(Bj 값에 관계없이)로 서비스된다. 동일한 우선 순위로 설정 된 논리 채널은 동일하게 서비스되어야 한다. - UE는 또한 위의 스케줄링 절차 중에 아래 규칙 내지 를 따라야 한다. UE는 전체 SDU (또는 부분 전송된 SDU 또는 재전송된 RLC PDU)가 연관된 MAC 엔티티의 남은 자원에 맞는 경 우 RLC SDU (또는 부분 전송된 SDU 또는 재전송된 RLC PDU)를 분할하지 않아야 한다. UE가 논리 채널에서 RLC SDU를 분할하는 경우, 관련된 MAC 엔티티의 그랜트를 최대한 많이 채우기 위해 분 할 크기를 최대화해야 한다. UE는 데이터 전송을 최대화해야 한다. MAC 엔티티에 데이터를 전송할 수 있는 동안 4바이트 이상의 UL 그랜트 크기가 주어지면 MAC 엔티티는 패딩 BSR 및/또는 패딩만 전송하지 않는다 (UL 그랜트 크기가 7바이트 미만인 경우 및 AMD PDU 세그먼트를 전송해야 하는 경우 제외). 프레임 구조 유형 3에 따라 동작하는 서빙 셀에서의 전송을 위해, MAC 엔티티는 laa-UL-Allowed가 설정된 논리 채널만을 고려할 것이다. MAC 엔티티는 중단된 무선 베어러에 해당하는 논리적 채널에 대한 데이터를 전송하지 않는다. MAC PDU가 패딩 BSR에 대한 MAC CE만을 포함하거나 제로 MAC SDU를 갖는 주기적 BSR을 포함하고 이러한 TTI"}
{"patent_id": "10-2023-7016870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[2]에 대해 요청된 비주기적 CSI가 존재하지 않는다면, MAC 엔티티가 skipUplinkTxDynamic로 구성되고 HARQ 엔 티티로 표시된 그랜트가 C-RNTI로 어드레스된 경우 또는 MAC 엔티티가 skipUplinkTxSPS로 구성되고 HARQ 엔티티 로 표시된 그랜트가 설정된 상향링크 그랜트인 경우, MAC 엔티티는 HARQ 엔티티에 대한 MAC PDU를 생성하지 않 는다. 논리 채널 우선 순위 절차에 대해, MAC 엔티티는 내림차순으로 다음과 같은 상대적 우선 순위를 고려해야 한다: a) C-RNTI 또는 UL-CCCH로부터의 데이터를 위한 MAC 제어 요소; b) DPR를 위한 MAC 제어 요소; c) SPS 확인을 위한 MAC 제어 요소; d) 패딩을 위해 포함된 BSR을 제외한 BSR를 위한 MAC 제어 요소; e) PHR, 확장 PHR 또는 이중 연결 PHR을 위한 MAC 제어 요소; f) 패딩을 위해 포함된 사이드링크 BSR을 제외한 사이드링크를 위한 MAC 제어 요소; g) UL-CCCH로부터의 데이터를 제외한 임의의 논리채널로부터의 데이터; h) 권장 비트 전송률 쿼리에 대한 MAC 제어 요소; i) 패딩을 위해 포함된 BSR을 위한 MAC 제어 요소; j) 패딩을 위해 포함된 사이드링크 BSR을 위한 MAC 제어 요소. 한편, UE가 상향링크로 전송할 때, UE는 전술한 바와 같이 논리 채널 우선순위 (LCP) 메커니즘을 이용하여 MAC PDU를 생성한다. LCP는 우선순위가 낮은 논리채널보다 우선순위가 높은 논리채널의 데이터를 우선 순위화하면서 논리 채널(PBR)로부터 최소한의 데이터 전송을 보장함으로써 스케줄링의 공평성을 주기 위해 설계된다. 각 논리 채널의 우선 순위 결정은 네트워크에 달려 있으며 네트워크는 우선 순위를 결정할 때 각 논리 채널의 트래픽 특 성, 예, 대기 시간, 트래픽의 목적 (예: 공공 비상 사태)을 고려할 수 있다. 종래 기술의 기본 가정은 (업링크에서) UE로 오는 모든 데이터를 곧 네트워크로 전송하여야 한다는 것이다. 다 시 말하면, UE가 네트워크로 전송하도록 허용되거나 허용되지 않는 데이터가 없다는 것이다. 그러나, 미래에는 UE가 수집할 수 있는 방대한 양의 데이터에 의해 개선/학습될 수 있는 일부 알고리즘이 네트 워크 측에 있을 것으로 예상된다. 이 경우, UE가 원한다면 그러한 데이터를 네트워크에 공급할 수 있는 옵션을 갖도록 하는 것은 UE에게 매력적일 수 있다. 이는 UE가 상향링크 데이터 중 일부만 가지고 있어도 상향링크 데이터를 전송하지 않을 수 있음을 의미한다. 예 를 들어, 네트워크가 인공 지능(AI) 알고리즘을 실행하여 네트워크 배포/스케줄링을 향상시키거나 스마트 카메 라 또는 보안 장치와 같은 특정 애플리케이션을 위해 네트워크가 가능한 한 많은 정보를 (예: UE로부터) 수집해 야 한다. 그러나, UE 관점에서, 그러한 정보의 전송은 특히 전송할 UL 데이터가 있을 때 바람직하지 않은 전력/자원 상황 에 UE를 놓을 수 있다. 한편, UE가 이러한 정보의 전송으로 인해 피해를 입지 않을 것으로 예상되는 경우 UE는 해당 정보를 전송하는 데 자원할 수 있다. 네트워크의 관점에서 중요한 것은 가능한 한 많은 정보를 수집하는 것이지만 그러한 정보에 대해 요구되는 대기 시간은 훈련 데이터이기 때문에 그다지 길지 않을 수 있으며 네트워크 알고리즘은 훈련데이터에도 포함되어 있 는 시간 정보를 고려할 수 있다. 따라서, UE가 자신의 데이터 전송에 바쁘지 않을 때 UE가 자발적으로 일부 데이터를 보낼 수 있는 방법이 있어 야 한다. UE가 제2 데이터 전송에 바쁜 경우 UE가 제1 데이터를 전송하지 않도록 하기 위해, UE는 제2 데이터의 버퍼 크 기에 기초하여 제1 데이터를 전송할지 여부를 결정하고, 여기서 제1 데이터 및 제2 데이터는 동일한 논리 채널 또는 동일한 논리 채널 그룹에서 유래된 것이 아니다. 이를 위해, UE는 네트워크로부터 제1 논리 채널 또는 제1 논리 채널 그룹의 지시를 수신하여 제1 논리 채널 또 는 제1 논리 채널 그룹으로 구성된다. 예를 들어, 제1 논리 채널 또는 제1 논리 채널 그룹의 지시는 제1 논리 채널의 논리 채널 식별자, 제1 논리 채 널 그룹의 논리 채널 그룹 ID, 논리 채널이 제1 논리 채널인지 여부를 나타내는 지시, 및 논리 채널 그룹이 제1 논리 채널 그룹인지 여부를 나타내는 지시 중 적어도 하나를 포함할 수 있다. 암시적으로, 상기 지시는 논리 채널 또는 논리 채널 그룹이 각각 제1 논리 채널 또는 제1 논리 채널 그룹인 경 우에만 수신될 수 있다. 논리 채널 또는 논리 채널 그룹에 대한 지시가 수신되지 않으면 논리 채널은 제1 논리 채널이 아니며 논리 채널 그룹은 제1 논리 채널 그룹이 아니다, 즉, 논리 채널은 제2 논리 채널이거나 제2 논리채널 그룹이다; UE는 또한 버퍼 크기 또는 제2 데이터의 양을 나타내는 임계치 X로 설정된다. 상기 임계치는 제2 데이터와 관련된다. 즉, 상기 임계치는 버퍼 크기 또는 제2 데이터의 양을 의미하며, 제2 논 리 채널 또는 제2 논리 채널 그룹의 데이터이다. 상기 임계치는 논리 채널 또는 논리 채널 그룹별로 구성될 수 있으며, 상기 논리 채널 및/또는 논리 채널 그룹은 제2 데이터를 포함한다. 다수의 제2 논리 채널 또는 다수의 제2 논리 채널 그룹이 있을 수 있다. 이 경우, 상기 임계치는 제2 논리 채널 또는 제2 논리 채널 그룹별로 다르게 구성할 수 있다. 임계치가 제2 논리 채널 또는 제2 논리 채널 그룹별로 적용된다면, 제1 데이터 및 제2 데이터 간에 매핑이 있을 수 있다. 예를 들면, 제1 논리 채널 및 제2 논리 채널 간 또는 제1 논리 채널 그룹 및 제2 논리 채널 그룹 간에 매핑이 있을 수 있다. 이는 UE가 제1 데이터를 전송할 지 여부를 결정할 때, UE는 제1 데이터에 매핑된 제2 데 이터의 양 또는 버퍼 사이즈를 측정한다는 것을 의미한다. 대안적으로, 상기 임계치는 MAC 또는 UE별로 구성될 수 있다. 상기 임계치가 MAC 또는 UE별로 구성된다면, UE가 제2 데이터의 버퍼 사이즈 또는 양을 측정할 때, 모든 제2 논리 채널 또는 모든 제2 논리 채널 그룹을 고려한다. 이는 UE가 제1 데이터를 전송할 지 결정할 때, 모든 제2 논리 채널 또는 모든 제2 논리 채널 그룹으 로부터 유래된 모든 제2 데이터의 버퍼 사이즈 또는 양을 측정한다는 것을 의미한다. UE에 제1 데이터가 있는 동안, UE는 상향링크 데이터 전송을 위해 상향링크 자원을 요청하고, 네트워크로부터 상향링크 자원을 수신한다. 수신된 상향링크 자원은 제1 데이터 및 제2 데이터의 전송을 위해 허용된다. UE는 상향링크 자원으로 전송할 MAC PDU를 다음과 같이 생성한다: - UE는 제2 데이터의 버퍼 사이즈 또는 양을 측정한다 (B2); - UE는 B2를 임계치 X와 비교한다; - 비교 결과에 기초하여, UE는 제1 데이터를 MAC PDU에 포함시킬지 여부를 결정한다. 구체적으로, - B2가 X와 같거나 크다면, UE는 제1 데이터를 MAC PDU에 포함시키지 않는다. 제1 논리 채널의 우선순위가 제2 논리 채널의 우선순위보다 높더라도, UE는 제1 데이터를 MAC PDU에 포함시키지 않는다. 대안적으로, MAC PDU에 모든 제2 데이터를 포함시킨 후에만 MAC PDU를 위한 나머지 상향링크 자원이 있는 경우, UE는 제1 데이터를 MAC PDU에 포함시킬 수 있다. - B2가 X보다 작은 경우, UE는 MAC PDU에 제1 데이터를 포함시킨다. MAC PDU에 제1 데이터와 제2 데이터를 포함 하는 양 및/또는 순서는 3GPP 표준에 명시되어 있다 (예, 3GPP TS38.321). 마지막으로, UE는 상향링크 자원을 이용하여 MAC PDU를 전송한다. 도 11은 본 개시에 따른 자발적 트래픽을 위한 MAC PDU 전송의 예를 도시한다. 도 11에서, UE가 두개의 논리 채 널로 구성된다는 것을 가정한다. S10에서, 제1 기기 (예, UE)는 제2 기기 (예, 네트워크)으로부터 논리 채널 구성을 수신한다. 제1 논리 채널 LCH1은 제1 데이터의 전송을 위한 것이고, 제2 논리 채널 LCH2은 제2 데이터의 전송을 위한 것이다. 제1 데이터의 예는 네트워크 측에서 실행되는 AI 알고리즘을 위해 설정된 훈련 데이터이다. 제2 데이터의 예는 제1 데이터가 아닌 일반 UE 트래픽이다. UE 또한 LCH2에 대한 버퍼 사이즈인 X 바이트로 임계치로 구성된 다. S20에서, UE가 LCH1에서 유래된 데이터를 가지는 동안, UE는 BSR, SR, 또는 RA 절차를 통하여 네트워크에 상향 링크 자원을 요청한다. 그후, S30에서, UE는 제1 데이터 및 제2 데이터의 전송을 허용하는 네트워크로부터 상향링크 그랜트를 수신한다. S40에서, 수신된 상량링크 그랜트의 전송을 위하여, UE는 LCH2에 대한 버퍼 사이즈를 측정하고 (BS) 측정한 BS 와 임계치 X를 비교한다. S50에서, BS가 임계치 X가 크지 않다면 (즉, 임계치 X와 같거나 작다면), UE는 가능한 경우 LCH2뿐만 아니라 LCH1의 데이터를 포함하여 수신된 UL 그랜트로 전송될 MAC PDU를 생성한다. 이는 LCH2로부터 데이터가 없으면, UE는 LCH1로부터의 데이터만을 MAC PDU에 포함시킨다는 것을 의미한다. S60에서, BS가 임계치보다 크다면, UE는 LCH2의 데이터만 포함하여, 즉 LCH1의 데이터를 포함하지 않고 수신한 상향링크 그랜트로 전송할 MAC PDU를 생성한다. 즉, UE는 LCH1의 우선순위가 LCH2의 우선순위보다 높더라도 제1 데이터를 포함하지 않는다는 것을 의미한다. 마지막으로, S70에서, UE는 수신된 상향링크 그랜트를 이용하여 생성된 MAC PDU를 전송한다. 도 12는 본 개시에 따라 자발적 트래픽을 위한 MAC PDU 전송에 대한 순서도이다. 유사하게, 도 12에서도, UE가 제1 논리 채널 및 제2 논리 채널로 구성된다는 것을 가정한다. 도 12를 참조하면, S1201에서, UE는 제1 논리 채널의 제1 상향링크 데이터 및 제2 논리 채널의 제2 상향링크 데 이터를 획득할 수 있다. S1203에서 피어 무선 노드로부터 상향링크 자원을 수신하면, UE는 제2 상향링크 데이터와 관련된 임계치를 기반 으로 제1 상향링크 데이터 및 제2 상향링크 데이터 중 적어도 하나를 포함하는 MAC PDU를 생성할 수 있다. 특히, 제1 논리 채널의 버퍼 사이즈(BS)가 임계치와 같거나 크다면, MAC PDU가 생성되어 제2 상향링크 데이터 없이 제1 상향링크 데이터를 포함한다. 반면, 제1 논리 채널의 BS가 임계치보다 작으면, MAC PDU가 생성되어 제 1 상향링크 데이터 및 제2 상향링크 데이터 모두 포함한다. 마지막으로, S1207에서, 상향링크 자원을 기반으로 피어 무선 노드로 MAC PDU가 전송된다. 전술한 본 발명의 실시예들에 따르면, UE가 원할 때만 자발적인 데이터 전송을 허용하는 것은 풍부한 정보가 알 고리즘 개선의 핵심 성과 지표(KPI)인 인공 지능을 활용하는 영역에서 더 많은 비즈니스 기회를 허용하는 것일 수 있다."}
{"patent_id": "10-2023-7016870", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 이해를 더욱 돕기 위해 포함되는 첨부 도면은 본 발명의 실시예들을 예시하며, 상세한 설명과 함께 본 발명의 원리를 설명한다: 도 1은 본 명세의 구현들이 적용되는 통신 시스템의 예를 도시한 것이며; 도 2는 본 명세에 따른 방법을 수행할 수 있는 통신 기기들의 예들을 도시하는 블록도이며; 도 3은 본 발명의 구현들을 수행할 수 있는 무선 기기의 다른 예를 도시한 것이며; 도 4는 3GPP (third generation partnership project) 기반 무선 통신 시스템에서 프로토콜 스택 들의 예를 도 시한 것이며; 도 5는 3GPP 기반 무선 통신 시스템에서 프레임 구조의 예를 도시한 것이며; 도 6은3GPP NR(new radio) 시스템에서 데이터 플로우 예를 도시한 것이며; 도 7은 PDCCH에 의한 PDSCH 시간 도메인 자원 할당의 예와 PDCCH에 의한 PUSCH 시간 자원 할당의 예를 도시한 것이며; 도 8은 송신측에서의 물리 계층 처리의 예를 도시한 것이며; 도 9는 수신측에서의 물리 계층 처리의 예를 도시한 것이며; 도 10은 본 명세의 구현들에 기반한 무선 기기들의 동작들을 도시한 것이며; 도 11은 본 개시에 따른 자발적 트래픽을 위한 MAC PDU 전송의 예를 도시하며; 도 12는 본 개시에 따라 자발적 트래픽을 위한 MAC PDU 전송에 대한 순서도이다."}
