{"patent_id": "20-2021-0000461", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "20-2022-0001537", "출원번호": "20-2021-0000461", "출원인": "기가 바이트 테크놀러지 컴퍼니 리미티드"}}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "호스트에 전기적으로 연결되는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치로서,디스플레이 패널;상기 디스플레이 패널의 디스플레이 화면을 제어하는 디스플레이 컨트롤러;상기 디스플레이 장치의 하우징에 설치되어 로컬 사용자가 내는 음성 신호를 취하여 각각 제1 오디오 신호와 제2 오디오 신호를 생성하는 제1 마이크와 제2 마이크;상기 제1 오디오 신호와 제2 오디오 신호에 빔포밍 처리를 수행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩;상기 제3 오디오 신호에 오디오 노이즈 감소 처리를 수행하여 노이즈 감소된 음성 신호를 생성하는 제2 오디오노이즈 감소 칩; 및상기 노이즈 감소된 음성 신호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이 장치의 범용 직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향효과 처리 칩을 포함하는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 제1 마이크와 상기 제2 마이크는 모두 지향성 마이크 또는 전방향성 마이크인, 자동 노이즈 감소 기능을가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 제1 오디오 노이즈 감소 칩은 상기 제1 오디오 신호와 상기 제2 오디오 신호에 따라 상기 로컬 사용자가내는 상기 음성 신호의 소스 방위를 계산하고, 제1 인공지능 모델을 이용하여 상기 소스 방위에 대해 상기 빔포밍 처리를 수행하며,상기 제2 오디오 노이즈 감소 칩은 제2 인공지능 모델을 이용하여상기 제3 오디오 신호에 대해 상기 오디오 노이즈 감소 처리를 수행하여 상기 제3 오디오 신호 중의 잡음과 환경 소음을 필터링하여 상기 노이즈 감소된 음성 신호를 생성하는, 자동 노이즈 감소 기능을 가지는 디스플레이장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 오디오 입력 인터페이스를 더 포함하고, 상기오디오 입력 인터페이스는 외부 마이크가 상기 오디오 입력 인터페이스에 삽입되었는지 여부를 감지하여 삽입판단 신호를 생성하고,상기 오디오 입력 인터페이스에서 상기 외부 마이크가 상기 오디오 입력 페이스에 삽입되었음이 감지되지 않을공개실용신안 20-2022-0001537-3-경우, 상기 삽입 판단 신호는 하이 로직 상태에 있게 되는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서, 상기 호스트는 네트워크를 통하여 상기 인코딩된 오디오 신호를 다른 호스트로 전송하여, 오디오 디코딩이 수행됨으로써 상기 노이즈 감소된 음성 신호가 획득되어 브로드캐스팅이 수행되는, 자동 노이즈 감소 기능을 가지는디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "호스트에 전기적으로 연결되는, 자동 노이즈 감소 기능을 가지는디스플레이 장치로서,디스플레이 패널;상기 디스플레이 패널의 디스플레이 화면을 제어하는 디스플레이컨트롤러;상기 디스플레이 장치의 하우징에 설치되어 상기 디스플레이 장치의환경 소음을 취하여 각각 제1 오디오 신호와 제2 오디오 신호를 생성하는제1 마이크와 제2 마이크;로컬 사용자가 내는 음성 신호를 취하여 외부 오디오 신호를 생성하는 외부 마이크에 전기적으로 연결되는, 오디오 입력 인터페이스;상기 제1 오디오 신호와 제2 오디오 신호에 빔포밍 처리를 수행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩;상기 외부 오디오 신호에서 상기 제3 오디오 신호를 감산하여 제4 오디오 신호를 얻고 상기 제4 오디오 신호에오디오 노이즈 감소 처리를 수행하여 노이즈 감소된 음성 신호를 얻는 제2 오디오 노이즈 감소 칩; 및상기 노이즈 감소된 음성 신호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이의 범용 직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향 효과처리 칩을 포함하는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 제1 마이크와 상기 제2 마이크는 모두 지향성 마이크 또는 전방향성 마이크인, 자동 노이즈 감소 기능을가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6 항에 있어서, 상기 제1 오디오 노이즈 감소 칩은 상기 제1 오디오 신호와 상기 제2 오디오 신호에 따라 상기 로컬 사용자가내는 상기 음성 신호의 소스 방위를 계산하고, 제1 인공지능 모델을 이용하여 상기 소스 방위에 대해 상기 빔포밍 처리를 수행하며,상기 제2 오디오 노이즈 감소 칩은 제2 인공지능 모델을 이용하여 상기 제3 오디오 신호에 대해 상기 오디오 노공개실용신안 20-2022-0001537-4-이즈 감소 처리를 수행하여 상기 제3 오디오 신호 중의 잡음과 환경 소음을 필터링하여 상기 노이즈 감소된 음성 신호를 생성하는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6 항에 있어서, 상기 오디오 입력 인터페이스가 상기 외부 마이크가 상기 오디오 입력 인터페이스에 삽입되어 있음을 감지하는경우, 상기 오디오 입력 인터페이스가 생성한 삽입 판단 신호는 로우 로직 상태에 있게 되는, 자동 노이즈 감소기능을 가지는 디스플레이 장치."}
{"patent_id": "20-2021-0000461", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6 항에 있어서, 상기 호스트가 네트워크를 통하여 상기 인코딩된 오디오 신호를 다른 호스트로 전송하여, 오디오 디코딩이 수행됨으로써 상기 노이즈 감소된 음성 신호가 획득되는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치.고안의 설명기 술 분 야본 고안은 디스플레이 장치에 관한 것으로서, 특히 자동 노이즈 감소 기능을 가지는 디스플레이 장치에 관한 것 [0001]이다.배 경 기 술컴퓨터 게임 플레이어들이 헤드폰과 마이크를 끼고 길드원과 상호작용할 때, 플레이어와 길드원은 종종 환경 소 [0002]음으로 인한 어려움을 겪고, 플레이어는 길드원이 대화를 명확하게 들을 수 있도록 비교적 큰 음량을 켜야 하는경우가 있으므로 헤드폰의 볼륨을 높여야 하나, 이를 장기간 사용했을 경우 귀의 불편함과 청력 손실을 야기할우려가 있다. 현재 시판되는 디스플레이 장치의 기능이 점점 다양해지고, 플레이어가 외부 마이크를 삽입할 수있게 되었으나, 전통적인 디스플레이 장치는 플레이어가 내는 음성 신호를 호스트에 직접 전달할 수 있을 뿐 환경 소음을 개선하는 데에 기여할 수는 없다.따라서, 전술한 문제를 해결하기 위하여 자동 노이즈 감소 기능을 가지는 디스플레이 장치가 필요하다. [0003]고안의 내용해결하려는 과제과제의 해결 수단본 고안은 자동 노이즈 감소 기능을 가지며 호스트에 전기적으로 연결되는 디스플레이 장치를 제공한다. 상기 [0004]디스플레이 장치는 디스플레이 패널; 상기 디스플레이 패널의 디스플레이 화면을 제어하는 디스플레이컨트롤러; 상기 디스플레이 장치의 하우징에 설치되어 로컬 사용자가 내는 음성 신호를 취하여 각각 제1 오디오신호와 제2 오디오 신호를 생성하는 제1 마이크와 제2 마이크; 상기 제1 오디오 신호와 제2 오디오 신호에 빔포밍 처리를 수행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩; 상기 제3 오디오 신호에 오디오노이즈 감소 처리를 수행하여 노이즈 감소된 음성 신호를 생성하는 제2 오디오 노이즈 감소 칩; 및 상기 노이즈감소된 음성 신호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이의 범용직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향 효과 처리 칩을 포함한다.공개실용신안 20-2022-0001537-5-일부 실시예에서, 상기 제1 마이크와 상기 제2 마이크는 모두 지향성 마이크 또는 전방향성 마이크이다. [0005]일부 실시예에서, 상기 제1 오디오 노이즈 감소 칩은 상기 제1 오디오 신호와 상기 제2 오디오 신호에 따라 상 [0006]기 로컬 사용자가 내는 상기 음성 신호의 소스 방위를 계산하고, 제1 인공지능 모델을 이용하여 상기 소스 방위에 대해 상기 빔포밍 처리를 수행하며, 상기 제2 오디오 노이즈 감소 칩은 제2 인공지능 모델을 이용하여 상기제3 오디오 신호에 대해 상기 오디오 노이즈 감소 처리를 수행하여 상기 제3 오디오 신호 중의 잡음과 환경 소음을 필터링하여 상기 노이즈 감소된 음성 신호를 생성한다.일부 실시예에서, 상기 디스플레이 장치는 오디오 입력 인터페이스를 더 포함하고, 상기 오디오 입력 인터페이 [0007]스는 외부 마이크가 상기 오디오 입력 인터페이스에 삽입되었는지 여부를 감지하여 삽입 판단 신호를 생성한다.상기 오디오 입력 인터페이스에서 상기 외부 마이크가 상기 오디오 입력 페이스에 삽입되었음이 감지되지 않을경우, 상기 삽입 판단 신호는 하이 로직 상태에 있게 된다.일부 실시예에서, 상기 호스트는 네트워크를 통하여 상기 인코딩된 오디오 신호를 다른 호스트로 전송하여, 오 [0008]디오 디코딩이 수행됨으로써 상기 노이즈 감소된 음성 신호가 획득되어 브로드캐스팅이 수행된다.본 고안은 호스트에 전기적으로 연결되는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치를 추가적으로 제공 [0009]하며, 상기 디스플레이 장치는 디스플레이 패널; 상기 디스플레이 패널의 디스플레이 화면을 제어하는 디스플레이 컨트롤러; 상기 디스플레이 장치의 하우징에 설치되어 상기 디스플레이 장치의 환경 소음을 취하여 각각 제1오디오 신호와 제2 오디오 신호를 생성하는 제1 마이크와 제2 마이크; 로컬 사용자가 내는 음성 신호를 취하여외부 오디오 신호를 생성하는 외부 마이크에 전기적으로 연결되는, 오디오 입력 인터페이스; 상기 제1 오디오신호와 제2 오디오 신호에 빔포밍 처리를 수행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩; 상기 외부 오디오 신호에서 상기 제3 오디오 신호를 감산하여 제4 오디오 신호를 얻고 상기 제4 오디오 신호에 오디오 노이즈 감소 처리를 수행하여 노이즈 감소된 음성 신호를 얻는 제2 오디오 노이즈 감소 칩; 및 상기 노이즈 감소된 음성 신호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이의범용 직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향 효과 처리 칩을포함한다.도면의 간단한 설명도 1은 본 고안의 일 실시예에 따른 디스플레이 시스템의 기능을 나타내는 블록도이다. [0010]도 2a는 본 고안의 일 실시예에 따른 제1 시나리오에서의 디스플레이 장치의 배치를 나타낸 도면이다.도 2b는 본 고안의 일 실시예에 따른 제2 시나리오에서의 디스플레이 장치의 배치를 나타낸 도면이다.고안을 실시하기 위한 구체적인 내용이하의 설명은 본 고안의 비교적 바람직한 실시 형태를 완성하기 위한 것으로서, 본 고안의 기본적 사상을 설명 [0011]하기 위한 것이며 본 고안을 제한하지 아니한다. 실제의 고안 내용에 대해서는 후술된 특허청구범위를 참고하기바란다.본 명세서에서 사용된 \"포함하다\" 등의 단어는 특정한 기술적 특징, 수치, 방법이나 단계, 작업이나 처리, 부품 [0012]및/또는 구성요소가 존재함을 나타내는 것이지 보다 많은 기술적 특징, 수치, 방법이나 단계, 작업이나 처리,부품, 구성요소 또는 이의 임의의 조합을 배제하는 것이 아님이 이해되어야 한다.청구항에 사용된 \"제1\", \"제2\", \"제3\" 등의 용어는 청구항 내의 요소를 수식하기 위한 것으로서 그 사이에 다른 [0013]우선권 순서, 선행 관계가 있거나 하나의 요소가 다른 하나의 요소보다 우선하거나 또는 방법이나 단계를 진행할 때의 시간적 선후 순서를 나타내기 위함이 아니며, 동일한 명칭을 가진 요소를 구별하기 위해서만 사용된다.도 1은 본 고안의 일 실시예에 따른 디스플레이 시스템을 나타내는 블록도이다. [0014]도 1에 도시된 바와 같이, 디스플레이 시스템(1)은 호스트(100)와 디스플레이 장치(200)를 포함한다. 호스트 [0015](100)는 예컨대 PC 또는 서버일 수 있다. 호스트(100)는 예컨대 처리 유닛(110), 그래픽 처리 유닛(GPU) (120),메모리 유닛(130), 스토리지 장치(140), 전송 인터페이스(150, 151) 및 네트워크 인터페이스(170)를 포함한다.처리 유닛(110), 그래픽 처리 유닛(120), 메모리 유닛(130), 스토리지 장치(140), 전송 인터페이스(150) 및 네트워크 인터페이스(170)는 시스템 버스(111)를 통하여 서로 커플링된다. 유닛(110)은 예를 들어 중앙처리장치(CPU), 범용 프로세서(general-purpose processor) 등일 수 있으나, 본 고안은 이에 제한되지 아니한다. 그래공개실용신안 20-2022-0001537-6-픽 처리 유닛(120)은 예컨대 디스플레이 카드 상의 그래픽 처리 유닛 또는 처리 유닛(110) 내에 조합되는 그래픽 처리 유닛일 수 있다.메모리 유닛(130)은 동적 랜덤 액세스 메모리(dynamic random access memory; DRAM) 또는 정적 랜덤 액세스 메 [0016]모리(static random access memory; SRAM)와 같은 랜덤 액세스 메모리일 수 있으나, 본 고안은 이에 제한되지아니한다. 스토리지 장치(140)는 예컨대 하드 디스크 드라이브(hard disk drive), 솔리드 스테이트 디스크(solid-state disk), 플래시 메모리(flash memory), 판독 전용 기억 장치(read-only memory)와 같은 비휘발성메모리(non-volatile memory)일 수 있으나, 본 고안은 이에 제한되지 아니한다.예컨대, 스토리지 장치(140)는 어플리케이션(141), 운영 체제(142)(예컨대 Window, Linux, MacOS 등)을 저장할 [0017]수 있고, 처리 유닛(110)은 어플리케이션(141)과 운영 체제(142)를 메모리 유닛(130)으로 읽어들여 실행할 수있다. 어플리케이션(141)은 예컨대 음성 통신 기능을 구비할 수 있으며, 네트워크(30)를 통하여 다른 호스트의사용자와 음성 통신을 수행할 수 있다.그래픽 처리 유닛(120)은 처리 유닛(110)이 수행한 어플리케이션의 그림을 처리하여 하나 이상의 이미지를 포함 [0018]하는 이미지 신호를 생성할 수 있고, 전송 인터페이스를 통하여 이미지 신호를 디스플레이 장치(200)의 전송 인터페이스(251)로 전송할 수 있다. 여기서 전송 인터페이스(151, 251) 사이의 경로는 이미지 전송 경로로 칭할수 있다. 전송 인터페이스(151, 251)는 유선 전송 인터페이스 및/또는 무선 전송 인터페이스일 수 있으며, 이중 유선 전송 인터페이스는 고화질 멀티미디어 인터페이스(High Definition Multimedia Interface, HDMI), 디스플레이 포트(DisplayPort, DP) 인터페이스, 임베디드 디스플레이 포트(embedded DisplayPort, eDP), 저전압차등 시그널링(low voltage differential signaling, LVDS) 인터페이스, 범용 직렬 버스(Universal SerialBus, USB) 인터페이스, USB C형 인터페이스, 썬더볼트(Thunderbolt) 인터페이스, 디지털 비주얼 인터페이스(Digital Visual Interface), 비디오 그래픽 어레이(video graphics array, VGA) 인터페이스, 다용도 입출력(general-purpose input/output, GPIO) 인터페이스, 범용 비동기화 송수신기(universal asynchronousreceiver/transmitter) 인터페이스, 직렬 주변 장치 인터페이스(Serial Peripheral Interface), 아이스퀘어드시(inter-intergrated circuit, I2C) 인터페이스 또는 그 조합을 포함할 수 있으며, 무선 전송 인터페이스는 블루투스, 와이파이, 근거리통신(Near Field Communication, NFC) 인터페이스 등을 포함할 수 있으나, 본 고안은이에 제한되지 않는다.또한, 처리 유닛(110)은 예컨대 전송 인터페이스(150)를 통하여 자료를 디스플레이 장치(200)의 전송 인터페이 [0019]스(250)로 전송할 수 있고, 이 때 전송 인터페이스(150, 250)는 예컨대 USB 인터페이스 또는 USB C형 인터페이스일 수 있으며, USB 3.1 및/또는 USB 2.0 프로토콜을 지원할 수 있다.전송 인터페이스(150, 250) 사이의 경로는 데이터 전송 경로로 칭할 수 있다.디스플레이 장치(200)는 호스트(100)에 전기적으로 연결된다. 디스플레이 장치(200)는 디스플레이 컨트롤러 [0020](210), 디스플레이 모듈(220), 스토리지 유닛(230), 이미지 버퍼(240), 전송 인터페이스(250~251), 오디오 입력인터페이스(255), 입력 인터페이스(260), USB 허브(270), 마이크(281L, 281R), 오디오 노이즈 감소 칩(282,283) 및 음향 효과 처리 칩(285)을 포함한다.디스플레이 컨트롤러(210)는 예컨대 주문형 집적회로(application-specific integrated circuit), 시스템온칩 [0021](System-on-chip), 프로세서, 또는 마이크로컨트롤러(microcontroller)일 수 있으나, 본 고안은 이에 제한되지아니한다.디스플레이 모듈(220)은 예컨대 액정(liquid display) 패널, 발광 다이오드(light-emitting diode) 패널, 유기 [0022]발광 다이오드(organic light-emitting diode) 패널, 음극선관(cathode ray tube), 전자 잉크(E-ink) 디스플레이 모듈, 전계 발광(electroluminescent) 디스플레이 모듈, 플라즈마(plasma) 디스플레이 모듈, 프로젝션(projection) 디스플레이 모듈, 양자점(Quantom Dot) 디스플레이 모듈일 수 있으나, 본 고안은 이에 제한되지아니한다.스토리지 유닛(230)은 예컨대 판독 전용 메모리(read-only memory, ROM), 소거 가능 프로그램 가능 판독 전용 [0023]메모리(erasable programmable read-only memory, EPROM), 전기적 소거 가능 프로그램 가능 판독 전용 메모리(electrically erasable PROM, EPROM)와 같은 비휘발성 메모리일 수 있다. 스토리지 유닛(230)은 디스플레이장치(200)와 관련된 펌웨어(231)를 저장하는 역할을 한다. 스토리지 유닛(230)은 예컨대 디스플레이 컨트롤러(210)의 외부에 존재하거나, 또는 디스플레이 컨트롤러(210) 내에 조합될 수 있다.펌웨어(230)는 예컨대 디스플레이 장치(200)의 온 스크린 디스플레이 인터페이스의 디스플레이 설정 및 확장된 [0024]공개실용신안 20-2022-0001537-7-디스플레이 식별 데이터(Extended Display Identification Data, EDID), 디스플레이 설정 및 하나 이상의 온스크린 디스플레이 인터페이스(on-screen-display (OSD) interface) (232)를 포함한다. 확장된 디스플레이 식별 데이터는 예컨대 디스플레이 장치(200)의 제조업체, 제품 명칭, 해상도, 초당 디스플레이되는 프레임 수 등을 포함한다. 디스플레이 설정은 예컨대 디스플레이 장치(200)의 밝기, 대비, 선명도, 색온도 등의 설정을 포함한다. 그 밖에도, 펌웨어(231)는 디스플레이 장치(200)의 온-스크린 디스플레이(on-screen display, OSD) 인터페이스(232)를 제어하는 역할을 한다.일 실시예에서, 디스플레이 컨트롤러(210)는 버스(예컨대 I2C 버스)를 통하여 스토리지 유닛(230)에 저장된 펌 [0025]웨어(231) 및 OSD 인터페이스(232)의 프로그램 코드를 독출하고 이에 근거하여 관련된 디스플레이 매개변수를설정할 수 있다. 그 밖에도, 디스플레이 컨트롤러(210)는 전송 인터페이스(250 또는 251)(예컨대 각각 이미지전송 경로 또는 데이터 전송 경로)를 통하여 호스트(100) 내의 처리 유닛(110)과 그래픽 처리 유닛(120)이 출력하고자 하는 영상 신호의 해상도 및 이와 관련된 동기 신호를 결정하도록 디스플레이 장치(200)의 확장된 디스플레이 식별 데이터를 호스트(100)로 전송한다. 온 스크린 디스플레이(232)는 예컨대 온 스크린 디스플레이 메뉴(OSD)및 그 옵션, 정보 디스플레이 인터페이스(information dashboard), 타이머, 카운터, 십자선(crosshair), 특정 부호, 특정 색상, 특정 텍스트, 또는 그 조합을 포함하지만, 본 고안은 이에 제한되지 아니한다. 일부 실시예에서, 온 스크린 디스플레이 메뉴는 오디오 노이즈 기능 메뉴를 포함할 수 있다.이미지 버퍼(240)는 예컨대 디스플레이 모듈(220) 상에서 플레이하고자 하는 출력 이미지를 저장하는 휘발성 메 [0026]모리(예컨대 동적 랜덤 액세스 메모리) 또는 비휘발성 메모리(예컨대 플래시 메모리)일 수 있으며, 호스트(100)또는 디스플레이 컨트롤러(210)는 호스트(100)가 생성한 온 스크린 디스플레이 인에이블 신호에 따라 하나 이상의 온 스크린 디스플레이 인터페이스(232)로 이미지 버퍼에 저장된 이미지 신호의 특정 영역을 덮어 출력 영상을 생성한다.입력 인터페이스(260)는 디스플레이 장치(200)의 온 스크린 디스플레이 메뉴를 제어하는 역할을 한다. 입력 인 [0027]터페이스(20)는 5방향 제어 레버(262) 또는 5개의 실체 버튼(261)으로 구현될 수 있으며, 이로써 상, 하, 좌,우 및 확인 등의 명령을 구현한다. 호스트(100)는 전송 인터페이스(150, 250)(예컨대 USB 인터페이스)를 통하여USB 허브를 경유해 데이터를 디스플레이 컨트롤러(210)로 전송할 수 있다. 또한 디스플레이 컨트롤러(210)는 이와 마찬가지로 전송 인터페이스(150, 250)를 통하여 USB 허브를 경유해 데이터를 호스트(100)로 전송할 수있다.도 2a는 본 고안의 일 실시예에 따른 제1 시나리오에서의 디스플레이 장치의 배치를 나타낸 도면이다. [0028]도 1과 도 2a를 함께 참조한다. 예를 들면, 마이크(281L, 281R)는 디스플레이 장치(200)의 하우징 상에 설치될 [0029]수 있으며, 두 개의 마이크는 도 2a에 도시된 바와 같이 일정한 거리만큼 서로 이격될 수 있다(예컨대 4 cm, 6cm 또는 10 cm이나, 이에 한정되지 아니함). 마이크(281L, 281R)는 오디오 노이즈 감소 칩(282)에 전기적으로연결되고, 마이크(281L, 281R)는 모두 지향성(directional) 마이크일 수 있으며, 범위(50) 내에서 비교적 우수한 감도(sensitivity)를 갖는다. 일부 실시예에서, 마이크(281L, 281R)는 모두 전방향성(omnidirectional) 마이크일 수 있으며, 동일한 마이크 모듈에 조합될 수 있다.제1 시나리오에서, 마이크(20)는 디스플레이 장치(200)의 오디오 입력 인터페이스(255)에 연결되지 않는다. 오 [0030]디오 입력 인터페이스(255)는 예컨대 3. 5 mm의 삽입공일 수 있으며, 마이크가 오디오 입력 인터페이스(255)에삽입되었는지 여부를 감지하기 위한 감지 회로(256)를 포함할 수 있다. 감지 회로(256)에서 마이크가 오디오 입력 인터페이스(255)에 삽입되었음이 감지되지 않을 경우, 감지 회로(256)가 출력한 삽입 판단 신호(17)는 예컨대 하이 로직 상태(high logic state)일 수 있다. 감지 회로(256)가 마이크가 오디오 입력 인터페이스(255)에삽입되었음을 감지했을 경우, 감지 회로(256)가 출력한 삽입 판단 신호(17)는 예컨대 로우 로직 상태(low logicstate)일 수 있다.마이크(281L, 281R)은 각각 로컬 사용자(60)가 내는 오디오 신호를 수신하여 제1 오디오 신호(11)와 제2 오디오 [0031]신호(12)를 생성할 수 있고, 제1 오디오 신호(11)와 제2 오디오 신호(12)를 오디오 노이즈 감소 칩(282)으로 전송할 수 있다. 제1 시나리오에서, 삽입 판단 신호(17)가 하이 로직 상태이므로, 오디오 노이즈 감소 칩(282,283)은 제1 노이즈 감소 모드에 진입하고, 제1 인공지능 모델(Artificial Intelligence (AI) model)을 사용하여 제1 오디오 신호(11)와 제2 오디오 신호(12)에 빔 포밍 처리(beamforming) 처리를 수행하여 제3 오디오 신호(13)를 생성하고, 상기 빔 포밍 처리에는 예컨대 제1 매개변수 집합을 이용할 수 있다.예컨대, 로컬 사용자(60)가 내는 음성 신호가 마이크(281L, 281R)에 도달하는 시간에는 미세한 차이가 [0032]공개실용신안 20-2022-0001537-8-있으므로, 오디오 노이즈 감소 칩(282)은 제1 매개변수 집합을 사용하여 로컬 사용자(60)가 내는 음성 신호의소스 방위(orientation)을 계산할 수 있으며, 상기 소스 방위에서 빔 포밍 처리를 수행할 수 있다. 즉, 상기 소스 방위 외의 기타 방위의 오디오 신호(잡음과 환경 소음 포함)는 모두 필터링되거나 또는 사운드 게인이 매우적음을 의미한다. 빔포밍 처리 후 생성된 제3 오디오 신호(13)는 여전히 상기 소스 방위의 환경 소음 및 소음을포함함에 주의하기 바란다.다음으로, 오디오 노이즈 감소 칩(283)은 제2 인공지능 모델을 이용하여 제3 오디오 신호(13)에 오디오 노이즈 [0033]감소(audio noise reduction) 처리를 수행하여 노이즈 감소된 음성 신호(14)를 생성할 수 있으며, 이 때 상기제1 인공지능 모델과 제2 인공지능 모델은 예컨대 완전히 연결된 (full connected) 상이한 심층 신경망(deepnueral network, DNN)일 수 있다.마이크(281L, 281R)가 생성한 제1 오디오 신호(11)와 제2 오디오 신호(12)는 일반적으로 로컬 사용자(60)의 음 [0034]성과 환경 소음/잡음을 포함하는데, 이는 오디오 노이즈 감소 칩(282, 283)에 극히 대량의 음성 데이터 샘플을설치하여 머신 러닝을 수행하기 때문이다. 따라서, 심층 신경망을 통하여 각 단계의 오디오 신호에 가장 적합한모델 매개변수를 찾을 수 있는데, 예컨대 각종 잡음 시나리오를 능동적으로 식별할 수 있고, 또한 오디오 신호내의 잡음과 환경 소음을 제거함으로써 음성 신호를 보존하여 가장 바람직한 노이즈 감소 효과를 달성할 수 있다(예컨대, 신호대잡음비(signal to noise ratio, SNR)를 대폭 향상시킬 수 있다). 일부 실시예에서, 오디오 노이즈 감소 칩(282, 283)은 예컨대 동일한 하나의 오디오 노이즈 감소 칩(284)에 조합될 수 있지만, 본 고안은이에 제한되지 아니한다.따라서, 제1 시나리오에서, 디스플레이 장치(200)는 마이크(281L, 281R)가 생성한 제1 오디오 신호(11) 및 제2 [0035]오디오 신호(12)를 이용하여 전술한 빔포밍 처리와 오디오 노이즈 감소 처리를 수행할 수 있으며, 오디오 노이즈 감소 칩(283)이 생성한 노이즈 감소 음성 신호(14)는 버스(예컨대 I2S 버스)를 경유하여 음향 효과 처리 칩(285)으로 전송되어 오디오 인코딩 처리를 수행함으로써 인코딩된 오디오 신호(15)를 생성할 수 있고, 인코딩된오디오 신호(15)를 USB 허브(270)를 통하여 호스트(100)로 전송할 수 있으며, 호스트(100)는 상기 네트워크 인터페이스(170)를 통하여 인코딩된 오디오 신호(15)를 네트워크(30) 상의 다른 호스트로 전송하여 오디오 디코딩처리가 수행될 수 있다. 따라서, 다른 호스트의 사용자는 디스플레이 장치(200)의 로컬 사용자로부터의 음성을분명하게 들을 수 있다.도 2b는 본 고안의 일 실시예에 따른 제2 시나리오에서의 디스플레이 장치의 배치를 나타낸 도면이다. [0036]도 1과 도 2b를 동시에 참조한다. 도 2b는 도 2a와 유사하나, 그 차이점은 제2 시나리오에서 마이크(20)가 디스 [0037]플레이 장치(200)의 오디오 입력 인터페이스(255)에 연결된다는 것이다. 예컨대, 마이크(20)는 디스플레이 장치(200)의 외부 마이크, 예를 들면 로컬 사용자(60)가 착용하는 헤드폰 마이크로 간주될 수 있고, 또는 별도 설치된 마이크로 간주될 수도 있다.제2 시나리오에서, 로컬 사용자(60)는 주로 마이크(20)를 사용하여 음성 신호를 입력하고, 마이크(20)는 로컬 [0038]사용자(60)가 내는 음성 신호를 취한 후 외부 오디오 신호(16)를 생성하며, 오디오 입력 인터페이스(255)를 통하여 외부 오디오 신호(16)를 오디오 노이즈 감소 칩(283)으로 전송한다. 그 밖에도, 마이크(281L, 281R)는 주로 디스플레이 장치(200)의 환경 소음을 감지하여 제1 오디오 신호(11)와 제2 오디오 신호(12)를 생성하고, 제1오디오 신호(11)와 제2 오디오 신호(12)를 오디오 노이즈 감소 칩(282)으로 전송한다.제2 시나리오에서, 삽입 판단 신호(17)가 로우 로직 상태이므로, 오디오 노이즈 감소 칩(282, 283)은 제2 노이 [0039]즈 감소 모드에 진입하고, 제1 인공지능 모델(AI model)을 사용하여 제1 오디오 신호(11)와 제2 오디오 신호(12)에 대하여 로컬 사용자(60)의 소스 방위에서 빔포밍(beamforming) 처리를 수행하여 제3 오디오 신호(13)를생성하며, 이 때 상기 빔포밍 처리는 예컨대 제2 매개변수 집합을 사용하는 것일 수 있고, 제2 매개변수 집합은제1 매개변수 집합과 상이할 수 있다. 일부 실시예에서, 제1 매개변수 집합과 제2 매개변수 집합은 오디오 노이즈 감소 칩(282, 283) 내의 비휘발성 메모리(예컨대 플래시 메모리) 내에 저장되며, 오디오 노이즈 감소 칩(282, 283) 내의 연산 유닛(도시되지 않음)은 삽입 판단 신호의 로직 상태에 따라 비휘발성 메모리로부터 제1매개변수 집합 또는 제2 매개변수 집합을 독출할 수 있다.예컨대, 오디오 노이즈 감소 칩(282)은 제2 매개변수 집합을 이용하여 로컬 사용자(60)의 소스 방위 [0040](orientation)을 계산하고 빔포밍 처리를 수행할 수 있다. 즉, 상기 소스 방위를 제외한 기타 방위의 잡음과 환경 소음은 모두 필터링되거나 또는 사운드 게인이 매우 적음을 의미한다.다음으로, 오디오 노이즈 감소 칩(283)은 먼저 외부 오디오 신호(16)에서 제3 오디오 신호(13)를 감산하여 제4 [0041]공개실용신안 20-2022-0001537-9-오디오 신호를 획득한다. 제2 시나리오에서의 제3 오디오 신호(13)가 주로 환경 소음이므로, 외부 오디오 신호(16)로부터 제3 오디오 신호(13)를 감산한 후 획득한 제4 오디오 신호에 주된 음성 성분을 보존할 수 있다. 이때, 오디오 노이즈 감소 칩(283)은 제2 인공지능 모델을 다시 이용하여 제4 오디오 신호에 오디오 노이즈 감소처리를 수행하여 노이즈 감소 음성 신호(14)를 생성할 수 있으며, 또한 노이즈 감소 음성 신호(14) 중의 잡음/환경 소음 성분을 제거할 수 있다.마이크(281L, 281R)가 생성한 제1 오디오 신호(11)와 제2 오디오 신호(12)는 일반적으로 로컬 사용자(60)의 음 [0042]성과 환경 소음/잡음을 포함하는데, 이는 오디오 노이즈 감소 칩(282, 283)에 극히 대량의 음성 데이터 샘플을설치하여 머신 러닝을 수행하기 때문이다. 따라서, 심층 신경망을 통하여 각 단계의 오디오 신호에 가장 적합한모델 매개변수를 찾을 수 있는데, 예컨대 각종 잡음 시나리오를 능동적으로 식별할 수 있고, 또한 오디오 신호내의 잡음과 환경 소음을 제거함으로써 음성 신호를 보존하여 가장 바람직한 노이즈 감소 효과를 달성할 수 있다(예컨대, 신호대잡음비(signal to noise ratio, SNR)를 대폭 향상시킬 수 있다).따라서, 제2 시나리오에서, 디스플레이 장치(200)는 마이크(281L, 281R)가 생성한 제1 오디오 신호(11)와 제2 [0043]오디오 신호(12)를 사용하여 상기 빔포밍 처리를 수행할 수 있다. 오디오 노이즈 감소 칩(283)은 외부 오디오신호(16)로부터 제3 오디오 신호(13)를 감산하여 제4 오디오 신호를 얻은 후 다시 제4 오디오 신호에 오디오 노이즈 감소 처리를 수행하여 노이즈 감소 음성 신호(14)를 얻을 수 있다. 오디오 노이즈 감소 칩(283)은 버스(예컨대 I2S 버스)를 경유하여 노이즈 감소 오디오 신호(14)를 음향 효과 처리 칩(285)으로 전송하여 오디오 인코딩 처리를 수행함으로써 인코딩된 오디오 신호(15)를 생성하고, 인코딩된 오디오 신호(15)를 USB 허브(270)를통하여 호스트(100)로 전송하며, 호스트(100)는 그 네트워크 인터페이스(170)를 통하여 인코딩된 오디오 신호(15)를 네트워크(30) 상의 다른 호스트로 전송하여, 오디오 디코딩 처리가 수행될 수 있다. 따라서, 다른 호스트의 사용자는 디스플레이 장치(200)의 로컬 사용자(60)로부터의 음성을 분명하게 들을 수 있다.상기한 바를 종합하면, 제1 시나리오와 제2 시나리오 모두에서, 본 고안의 디스플레이 장치(200)는 모두 오디오 [0044]노이즈 감소 처리를 수행하여 품질이 비교적 우수한 음성 신호를 얻음으로써 로컬 사용자(60)와 네트워크(30)상의 기타 사용자들이 음성 통신을 수행하고 사용자 경험을 향상시키는 데에 유리할 수 있다.다시 도 1을 참조하면, 일부 실시예에서, 스토리지 장치(140)는 노이즈 감소 설정 프로그램(143)을 더 [0045]포함하며, 로컬 사용자(60)는 호스트(100)에서 노이즈 감소 설정 프로그램(143)을 수행하여 사용자 인터페이스를 디스플레이할 수 있다. 따라서, 로컬 사용자(60)는 상기 사용자 인터페이스에서 대응되는 옵션을 선택하여디스플레이 장치(200)의 오디오 노이즈 감소 강도를 조절할 수 있고, 마이크(20)의 마이크 거리에 따라 상이한노이즈 설정을 선택하거나 또는 디스플레이 장치(20)의 노이즈 감소 기능을 켜거나 끌 수 있다. 예를 들면, 호스트(100)는 노이즈 감소 설정 프로그램(143)의 사용자 인터페이스 상에서 선택한 옵션에 대응되는 제어 신호를데이터 전송 경로(31)를 통하여 디스플레이 장치(200)로 전송할 수 있으므로, 오디오 노이즈 감소 칩(282, 283)은 이와 관련된 노이즈 설정을 조절할 수 있다. 일부 실시예에서, 로컬 사용자(60)는 디스플레이 장치(200)의OSD 인터페이스(232) 내의 오디오 노이즈 감소 메뉴를 통하여 상기 노이즈 설정을 조절할 수 있다.전술한 내용을 종합하면, 본 고안은 외부의 마이크가 삽입 또는 삽입되지 않은 상태에서 모두 자동 노이즈 감소 [0046]기능을 제공할 수 있는 디스플레이 장치를 제공한다. 그 밖에도, 디스플레이 장치 내의 오디오 노이즈 감소 칩은 인공지능 모델을 이용하여 빔포밍 처리와 오디오 노이즈 감소 처리를 수행할 수 있으므로, 디스플레이 장치의 잡음과 환경 소음을 추가적으로 감소시키면서, 음성 통화의 품질을 향상시켜 사용자 경험을 증가시킬 수 있다.비교적 바람직한 실시예를 중심으로 본 고안을 상기와 같이 개시하였으나, 이는 본 고안의 범위를 제한하기 위 [0047]함이 아니며, 본 분야의 통상적 지식을 갖춘 자는 본 고안의 사상과 범위를 벗어나지 않으면서 다양한 변경과수정을 실시할 수 있음을 이해할 것이다. 따라서, 본 고안의 보호범위는 후술된 특허청구범위에 의하여 정해져야 할 것이다.부호의 설명1: 디스플레이 시스템 [0048]11: 제1 오디오 신호12: 제2 오디오 신호13: 제3 오디오 신호공개실용신안 20-2022-0001537-10-14: 음성 신호15: 인코딩된 오디오 신호16: 외부 오디오 신호17: 삽입 판단 신호20: 마이크30: 네트워크31: 이미지 전송 경로32: 데이터 전송 경로50: 범위60: 로컬 사용자100: 호스트110: 처리 유닛111: 시스템 버스120: 그래픽 처리 유닛130: 메모리 유닛140: 스토리지 장치141: 어플리케이션142: 작업 시스템143: 소음 감소 설정 프로그램150, 151: 전송 인터페이스160: 주변장치170: 네트워크 인터페이스200: 디스플레이 장치210: 디스플레이 컨트롤러211: 이미지 스케일러212: 타이밍 컨트롤러220: 디스플레이 모듈230: 스토리지 유닛231: 펌웨어232: 온 스크린 디스플레이 인터페이스240: 이미지 버퍼255: 오디오 입력 인터페이스256: 감지 회로260: 입력 인터페이스261: 실체 버튼262: 5방향 제어 레버공개실용신안 20-2022-0001537-11-270: USB 허브281L, 281R: 마이크282, 283, 284: 오디오 노이즈 감소 칩285: 음향 효과 처리 칩도면도면1공개실용신안 20-2022-0001537-12-도면2a공개실용신안 20-2022-0001537-13-도면2b공개실용신안 20-2022-0001537-14-"}
{"patent_id": "20-2021-0000461", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "자동 노이즈 감소 기능을 가지며 호스트에 전기적으로 연결되는 디스플레이 장치가 제공된다. 디스플레이 장치는 상기 디스플레이 장치의 하우징에 설치되어 로컬 사용자가 내는 음성 신호를 취하여 각각 제1 오디오 신호와 제2 오디오 신호를 생성하는 제1 마이크와 제2 마이크; 상기 제1 오디오 신호와 제2 오디오 신호에 빔포밍 처리를 수 행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩; 상기 제3 오디오 신호에 오디오 노이즈 감소 처 리를 수행하여 노이즈 감소된 음성 신호를 생성하는 제2 오디오 노이즈 감소 칩; 및 상기 노이즈 감소된 음성 신 호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이의 범용 직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향 효과 처리 칩을 포함한다."}
{"patent_id": "20-2021-0000461", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 고안은 디스플레이 장치에 관한 것으로서, 특히 자동 노이즈 감소 기능을 가지는 디스플레이 장치에 관한 것 이다."}
{"patent_id": "20-2021-0000461", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "컴퓨터 게임 플레이어들이 헤드폰과 마이크를 끼고 길드원과 상호작용할 때, 플레이어와 길드원은 종종 환경 소 음으로 인한 어려움을 겪고, 플레이어는 길드원이 대화를 명확하게 들을 수 있도록 비교적 큰 음량을 켜야 하는 경우가 있으므로 헤드폰의 볼륨을 높여야 하나, 이를 장기간 사용했을 경우 귀의 불편함과 청력 손실을 야기할 우려가 있다. 현재 시판되는 디스플레이 장치의 기능이 점점 다양해지고, 플레이어가 외부 마이크를 삽입할 수 있게 되었으나, 전통적인 디스플레이 장치는 플레이어가 내는 음성 신호를 호스트에 직접 전달할 수 있을 뿐 환 경 소음을 개선하는 데에 기여할 수는 없다. 따라서, 전술한 문제를 해결하기 위하여 자동 노이즈 감소 기능을 가지는 디스플레이 장치가 필요하다. 고안의 내용"}
{"patent_id": "20-2021-0000461", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 고안은 자동 노이즈 감소 기능을 가지며 호스트에 전기적으로 연결되는 디스플레이 장치를 제공한다. 상기 디스플레이 장치는 디스플레이 패널; 상기 디스플레이 패널의 디스플레이 화면을 제어하는 디스플레이 컨트롤러; 상기 디스플레이 장치의 하우징에 설치되어 로컬 사용자가 내는 음성 신호를 취하여 각각 제1 오디오 신호와 제2 오디오 신호를 생성하는 제1 마이크와 제2 마이크; 상기 제1 오디오 신호와 제2 오디오 신호에 빔포 밍 처리를 수행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩; 상기 제3 오디오 신호에 오디오 노이즈 감소 처리를 수행하여 노이즈 감소된 음성 신호를 생성하는 제2 오디오 노이즈 감소 칩; 및 상기 노이즈 감소된 음성 신호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이의 범용 직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향 효과 처리 칩을 포함 한다.공개실용신안 20-2022-0001537 -5-일부 실시예에서, 상기 제1 마이크와 상기 제2 마이크는 모두 지향성 마이크 또는 전방향성 마이크이다. 일부 실시예에서, 상기 제1 오디오 노이즈 감소 칩은 상기 제1 오디오 신호와 상기 제2 오디오 신호에 따라 상 기 로컬 사용자가 내는 상기 음성 신호의 소스 방위를 계산하고, 제1 인공지능 모델을 이용하여 상기 소스 방위 에 대해 상기 빔포밍 처리를 수행하며, 상기 제2 오디오 노이즈 감소 칩은 제2 인공지능 모델을 이용하여 상기 제3 오디오 신호에 대해 상기 오디오 노이즈 감소 처리를 수행하여 상기 제3 오디오 신호 중의 잡음과 환경 소 음을 필터링하여 상기 노이즈 감소된 음성 신호를 생성한다. 일부 실시예에서, 상기 디스플레이 장치는 오디오 입력 인터페이스를 더 포함하고, 상기 오디오 입력 인터페이 스는 외부 마이크가 상기 오디오 입력 인터페이스에 삽입되었는지 여부를 감지하여 삽입 판단 신호를 생성한다. 상기 오디오 입력 인터페이스에서 상기 외부 마이크가 상기 오디오 입력 페이스에 삽입되었음이 감지되지 않을 경우, 상기 삽입 판단 신호는 하이 로직 상태에 있게 된다. 일부 실시예에서, 상기 호스트는 네트워크를 통하여 상기 인코딩된 오디오 신호를 다른 호스트로 전송하여, 오 디오 디코딩이 수행됨으로써 상기 노이즈 감소된 음성 신호가 획득되어 브로드캐스팅이 수행된다. 본 고안은 호스트에 전기적으로 연결되는, 자동 노이즈 감소 기능을 가지는 디스플레이 장치를 추가적으로 제공 하며, 상기 디스플레이 장치는 디스플레이 패널; 상기 디스플레이 패널의 디스플레이 화면을 제어하는 디스플레 이 컨트롤러; 상기 디스플레이 장치의 하우징에 설치되어 상기 디스플레이 장치의 환경 소음을 취하여 각각 제1 오디오 신호와 제2 오디오 신호를 생성하는 제1 마이크와 제2 마이크; 로컬 사용자가 내는 음성 신호를 취하여 외부 오디오 신호를 생성하는 외부 마이크에 전기적으로 연결되는, 오디오 입력 인터페이스; 상기 제1 오디오 신호와 제2 오디오 신호에 빔포밍 처리를 수행하여 제3 오디오 신호를 생성하는 제1 오디오 노이즈 감소 칩; 상 기 외부 오디오 신호에서 상기 제3 오디오 신호를 감산하여 제4 오디오 신호를 얻고 상기 제4 오디오 신호에 오 디오 노이즈 감소 처리를 수행하여 노이즈 감소된 음성 신호를 얻는 제2 오디오 노이즈 감소 칩; 및 상기 노이 즈 감소된 음성 신호에 오디오 인코딩 처리를 수행하여 인코딩된 오디오 신호를 생성하고, 상기 디스플레이의 범용 직렬 버스(USB) 허브를 통하여 상기 인코딩된 오디오 신호를 상기 호스트로 전송하는 음향 효과 처리 칩을 포함한다."}
