{"patent_id": "10-2023-0019628", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0114233", "출원번호": "10-2023-0019628", "발명의 명칭": "인공지능 모델의 트레이닝을 위한 이미지를 제공하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "박병주"}}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(101, 108)의 동작 방법에 있어서,제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작;제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하는 동작; 및상기 제 1 이미지의 상기 적어도 하나의 제 1 영역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작은,상기 제 1 이미지에 대응하는 활성화 맵을 확인하는 동작; 및상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작을 포함하는 전자 장치의 동작방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항 내제 제 2 항 중 어느 하나에 있어서,상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작은,상기 활성화 맵 중 특징 중요도(feature importance)가 지정된 제 1 조건을 만족하는 적어도 하나의 영역을 확인하는 동작; 및상기 활성화 맵의 상기 적어도 하나의 영역에 대응하는, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역을확인하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항 내제 제 3 항 중 어느 하나에 있어서,상기 활성화 맵 중 특징 중요도가 상기 지정된 제 1 조건을 만족하는 상기 적어도 하나의 영역을 확인하는 동작은, 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항 내제 제 4 항 중 어느 하나에 있어서,상기 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 동작은,상기 지정된 임계 특징 중요도 미만인 상기 활성화 맵의 나머지 영역을 블랭크(blank) 처리하는 동작;상기 블랭크 처리된 활성화 맵에 대한 적어도 하나의 윤곽선을 설정하는 동작; 및상기 적어도 하나의 윤곽선에 기반하여 상기 화성화 맵의 상기 적어도 하나의 영역을 확인하는 동작공개특허 10-2024-0114233-3-을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항 내제 제 5 항 중 어느 하나에 있어서,상기 AI 모델의 출력 레이어 및 상기 AI 모델의 적어도 하나의 피처 맵에 기반하여 적어도 하나의 기여도를 확인하는 동작; 및상기 적어도 하나의 기여도 및 상기 피처맵에 기반하여, 상기 활성화 맵의 복수 개의 특징 중요도를 확인하는동작을 더 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항 내제 제 6 항 중 어느 하나에 있어서,상기 적어도 하나의 기여도를 확인하는 동작은, 수학식 1에 의하여 수행되며,상기 수학식 1은, 이며,상기 활성화 맵의 상기 복수 개의 특징 중요도를 확인하는 동작은, 수학식 2에 의하여 확인되고,상기 수학식 2는, 이며,상기 c는 상기 AI 모델의 상기 출력 레이어의 클래스이며, 상기 k는 상기 적어도 하나의 피처 맵의 인덱스이며,상기 z는 상기 적어도 하나의 피처 맵의 매트릭스의 행과 열의 곱이며, 상기 i, j는 상기 매트릭스 내의 i, j번째의 엘리먼트인 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항 내제 제 7 항 중 어느 하나에 있어서,상기 적어도 하나의 제 1 영역을 확인하는 동작은,상기 활성화 맵의 상기 적어도 하나의 영역이 적어도 하나의 제 2 조건을 만족함에 기반하여, 상기 적어도 하나의 영역에 대응하는 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역을 확인하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항 내제 제 8 항 중 어느 하나에 있어서,상기 활성화 맵의 상기 적어도 하나의 영역의 크기가 지정된 임계 크기 이상임에 기반하여 상기 적어도 하나의제 2 조건이 만족된 것으로 판단하는 동작을 더 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항 내제 제 9 항 중 어느 하나에 있어서,상기 활성화 맵의 상기 적어도 하나의 영역의 개수가 지정된 임계 개수 이상임에 기반하여 상기 적어도 하나의제 2 조건이 만족된 것으로 판단하는 동작을 더 포함하는 전자 장치의 동작 방법.공개특허 10-2024-0114233-4-청구항 11 제 1 항 내제 제 10 항 중 어느 하나에 있어서,상기 활성화 맵의 상기 적어도 하나의 영역 사이의 겹침 정도가 임계 겹침 정도 이하임에 기반하여 상기 적어도하나의 제 2 조건이 만족된 것으로 판단하는 동작을 더 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1 항 내제 제 11 항 중 어느 하나에 있어서,상기 적어도 하나의 영역이 상기 적어도 하나의 제 2 조건을 만족하지 않음에 기반하여, 상기 적어도 하나의 영역의 적어도 일부의 형상, 크기, 및/또는 위치를 조정하는 동작을 더 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항 내제 제 12 항 중 어느 하나에 있어서,상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작은,상기 제 1 이미지에 대한 전처리를 수행하는 동작; 및상기 전처리된 제 1 이미지 및 상기 제 1 AI 모델을 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1 항 내제 제 13 항 중 어느 하나에 있어서,상기 제 1 이미지에 대한 전처리를 수행하는 동작은,상기 제 1 이미지의 크기를 변환하는 동작; 및상기 변환된 제 1 이미지에 대한 블러링을 수행하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1 항 내제 제 14 항 중 어느 하나에 있어서,상기 변환된 제 1 이미지에 대한 블러링을 수행하는 동작은,상기 제 1 이미지에 포함된 적어도 하나의 텍스트의 속성에 기반하여 블러링 정도를 결정하여, 상기 결정된 블러링 정도에 기반하여 상기 블러링을 수행하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치(101,108)에 있어서,메모리(130); 및적어도 하나의 프로세서(120)를 포함하고,상기 메모리(130)는, 상기 적어도 하나의 프로세서(120)에 의하여 실행되는 경우, 상기 전자 장치(101,108)로하여금:제 1 씬 식별자에 대응하는 제 1 이미지를 확인하고,제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하고,공개특허 10-2024-0114233-5-상기 제 1 이미지의 상기 적어도 하나의 제 1 영역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하도록 야기하도록 설정된 적어도 하나의 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 제 1 AI 모델 및 상기제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서,상기 제 1 이미지에 대응하는 활성화 맵을 확인하고,상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하도록 야기하는 전자 장치."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 16 항 내제 제 17 항 중 어느 하나에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵에 기반하여,상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서,상기 활성화 맵 중 특징 중요도(feature importance)가 지정된 제 1 조건을 만족하는 적어도 하나의 영역을 확인하고,상기 활성화 맵의 상기 적어도 하나의 영역에 대응하는, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역을확인하도록 야기하는 전자 장치."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 16 항 내제 제 18 항 중 어느 하나에 있어서,상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵 중 특징 중요도가 상기 지정된 제 1 조건을 만족하는 상기 적어도 하나의 영역을 확인하는 동작의 적어도 일부로서, 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하도록 야기하는 전자 장치."}
{"patent_id": "10-2023-0019628", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 동작 방법에 있어서,제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작;컨볼루션 뉴럴 네트워크 기반의 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하는 활성화 맵을 확인하는 동작;상기 활성화 맵의 상기 특징 중요도가 지정된 조건을 만족하는 적어도 하나의 제 1 영역을 확인하는 동작; 및상기 적어도 하나의 제 1 영역에 대응하는 상기 제 1 이미지의 영역을 블랙 처리함으로써, 상기 제 1 AI 모델을위한 트레이닝 데이터를 확인하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포함 할 수 있다. 상기 전자 장치의 동작 방법은, 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지 가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 상기 전자 장치의 동작 방법은, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함할 수 있다. 그 밖의 다양한 실시예가 가능하다."}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공지능(artificial intelligence model, AI) 모델의 트레이닝을 위한 이미지를 제공하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는, 현재 상태(예를 들어, 디스플레이의 출력에 대한 FPS(frame per second), 및/또는 온도일 수 있지 만 제한이 없음)에 기반하여 전자 장치의 성능(예를 들어, 전자 장치 내의 CPU 클럭일 수 있지만 제한이 없음)을 조정할 수 있다. 전자 장치는, 현재 상태에 기반하여 성능 제어를 위한 정책(policy)을 선택할 수 있으며, 선택된 정책에 기반하여 성능을 제어할 수 있다. 예를 들어, 과온도 상태인 경우, 전자 장치는 CPU 클럭을 감 소시키는 정책을 선택할 수 있으며, 선택된 정책에 기반하여 전자 장치의 성능을 제어할 수 있다. 전자 장치는, 특정 어플리케이션(예를 들어, 게임 어플리케이션)을 실행하는 경우, 해당 어플리케이션에서 요구되는 지표가 만족되는지 여부를 확인할 수 있다. 만약, 해당 어플리케이션에서 요구되는 지표가 만족되지 않는 경우 에는, 전자 장치는 정책을 변경함으로써, 성능을 제어할 수 있다. 특정 어플리케이션에서 요구되는 지표가 만 족되는지 여부를 정확하게 판단하기 위하여, 보다 정확한 현재 상태의 모니터링이 요구될 수 있다."}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포 함할 수 있다. 상기 전자 장치의 동작 방법은, 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미 지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 상기 전자 장치의 동작 방법은, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치는, 메모리 및 적어도 하나의 프로세서를 포함할 수 있다. 상기 메모리는, 적어 도 하나의 인스트럭션을 저장할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치로 하여금, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어 도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프 로세서에 의하여 실행되는 경우, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하도록 야기하도록 야기할 수 있다. 일 실시예에 따라서, 컴퓨터로 독출 가능한 적어도 하나의 인스트럭션을 저장하는 저장 매체에 있어서, 상기 적 어도 하나의 인스트럭션은 전자 장치의 적어도 하나의 프로세서에 의하여 실행 시에, 상기 전자 장치로 하여금 적어도 하나의 동작을 수행하도록 야기할 수 있다. 상기 적어도 하나의 동작은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포함할 수 있다. 상기 적어도 하나의 동작은, 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하 는 동작을 포함할 수 있다. 상기 적어도 하나의 동작은, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터 를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포 함할 수 있다. 전자 장치의 동작 방법은, 컨볼루션 뉴럴 네트워크 기반의 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하는 활성화 맵을 확인하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은, 상기 활성화 맵의 상기 특징 중요도가 지정된 조건을 만족하는 적어 도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은, 상기 적어도 하나의 제 1 영역에 대응하는 상기 제 1 이미지의 영역을 블랙 처리함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치는, 메모리 및 적어도 하나의 프로세서를 포함할 수 있다. 상기 메모리는, 적어 도 하나의 인스트럭션을 저장할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치로 하여금, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치로 하여금, 컨볼루션 뉴럴 네트워크 기반의 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하는 활성화 맵을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치로 하여금, 상기 활성화 맵의 상기 특징 중요도가 지정된 조건을 만족하는 적어도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치 로 하여금, 상기 적어도 하나의 제 1 영역에 대응하는 상기 제 1 이미지의 영역을 블랙 처리함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하도록 야기할 수 있다. 일 실시예에 따라서, 컴퓨터로 독출 가능한 적어도 하나의 인스트럭션을 저장하는 저장 매체에 있어서, 상기 적 어도 하나의 인스트럭션은 전자 장치의 적어도 하나의 프로세서에 의하여 실행 시에, 상기 전자 장치로 하여금 적어도 하나의 동작을 수행하도록 야기할 수 있다. 상기 적어도 하나의 동작은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포함할 수 있다. 상기 적어도 하나의 동작은, 컨볼루션 뉴럴 네트워크 기반의 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하 는 활성화 맵을 확인하는 동작을 포함할 수 있다. 상기 적어도 하나의 동작은, 상기 활성화 맵의 상기 특징 중 요도가 지정된 조건을 만족하는 적어도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 상기 적어도 하나 의 동작은, 상기 적어도 하나의 제 1 영역에 대응하는 상기 제 1 이미지의 영역을 블랙 처리함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함할 수 있다."}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 일 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워 크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치 와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신 할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모 듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 AI 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. AI 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. AI 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q- networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. AI 모델은 하드웨 어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 일 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안 테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배치되고 지 정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안 테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예:스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 실시예와의 비교를 위한 비교예에 따른 전자 장치의 동작 방법을 설명하기 위한 도면이다. 도 2의 비교 예에 따른 전자 장치에 의하여 수행되는 동작들 중 적어도 일부는, 실시예에 따라서 수행될 수도 있음을 당업자는 이해할 것이다. 도 2의 실시예는, 도 3a 내지 도 3f를 참조하여 설명하도록 한다. 도 2를 참조하면, 전자 장치(예를 들어, 프로세서)는, 제 1 상태 정보에 기반하여, 정책 결정을 수행할 수 있다. 하나의 에에서, 전자 장치는, 정책 결정을 위한 적어도 하나의 룰(rule)을 저장할 수 있으며, 저장된 적어도 하나의 룰에 기반하여 제 1 상태 정보에 대응하는 제 1 정책을 결정할 수 있다. 하 나의 예에서, 전자 장치는, 정책 결정을 위한 적어도 하나의 AI 모델을 저장할 수 있으며, 적어도 하 나의 AI 모델에 제 1 상태 정보 중 적어도 일부를 입력함으로써, 제 1 상태 정보에 대응하는 제 1 정책을 결정 할 수 있다. 상술한 바와 같이, 전자 장치는, 룰-기반, 및/또는 AI 모델을 이용하여, 제 1 상태 정보에 대응하는 제 1 정책을 결정할 수 있으나, 이는 예시적인 것으로 제 1 정책을 결정하는 방식에는 제한이 없다. 예를 들어, 상태 정보는, FPS, 전자 장치의 적어도 일부에서 측정된 적어도 하나의 온도 값, 과온도율 (overheat rate), CPU 클럭, CPU 부하, GPU 부하, GPU 클럭, 네트워크 관련 정보(예를 들어, I/O(입력/출력 관 련 정보), 종류, 및/또는 로드(load)), 해상도, 주사율, 및/또는 디스플레이 모듈의 밝기를 포함할 수 있 으나, 그 종류에는 제한이 없다. 상태 정보는, 하나의 예에서는 지정된 기간 동안 측정된 값들에 대한 통계값 (예를 들어, 평균값 및/또는 중위값일 수 있으나 제한이 없음)에 기반하여 설정될 수 있다. 예를 들어, 상태 정보는, 제 1 기간 동안 측정된 복수 개의 FPS들의 평균값일 수 있으나 제한은 없다. 한편, 통계값은 단순히 예시적인 것으로, 전자 장치는 실시간적으로 상태값에 대응하여 정책을 조정하도록 설정될 수도 있다. 예 를 들어, 정책은, CPU 클럭 및/또는 GPU 클럭을 포함할 수 있으나, 그 종류에는 제한이 없다. 예를 들어, 전자 장치는, 실행 중인 어플리케이션에서 요구하는 타겟 FPS가 만족되는지 여부를 확인할 수 있다. 예를 들어, 게임 어플리케이션이, 타겟 FPS로서 60fps를 요구하는 것을 상정하도록 한다. 전자 장치 는, 제 1 상태 정보로서 제 1 FPS(예를 들어, 60fps)를 확인할 수 있다. 전자 장치는, 제 1 FPS(예 를 들어, 60fps)가 타겟 FPS(예를 들어, 60fps)를 만족함에 기반하여, 현재 정책(예를 들어, 현재 CPU 클럭 및/ 또는 GPU 클럭)을 유지할 수 있다. 예를 들어, 전자 장치는, 제 2 상태 정보로서 제 2 FPS(예를 들어, 30fps)를 확인할 수 있다. 전자 장치는, 제 2 FPS(예를 들어, 30fps)가 타겟 FPS(예를 들어, 60fps)를 만족하지 못함에 기반하여, 정책을 변경할 것을 결정할 수 있다. 예를 들어, 전자 장치는, 현재 CPU 클럭 및/또는 현재 GPU 클럭보다 상대적으로 높은 CPU 클럭 및/또는 GPU 클럭을 포함하는 정책을 선택할 수 있다. 전자 장치는, 선택된 정책을 적용(예를 들어, CPU 클럭 및/또는 GPU 클럭의 증가)을 수행할 수 있으며, 이 에 따라 FPS가 증가할 수 있다. 한편, 어플리케이션은, 복수 개의 타입의 씬을 포함할 수 있다. 예를 들어, 게임 어플리케이션의 경우에는, 게 임 플레잉을 위한 적어도 하나의 오브젝트가 포함된 씬(scene)(예를 들어, 플레잉-중(in-play)의 씬 식별자를 가지는 씬)이 존재할 수 있다. 또는, 게임 어플리케이션의 경우에는, 게임 플레잉이 아닌 다른 화면(예를 들어, 온라인 게임의 대기 방(waiting room)을 표현하는 화면, 게임 로딩 중을 나타내는 화면일 수 있으나 제한 이 없음)의 씬(예를 들어, 플레잉 아님(not in-play)의 씬 식별자를 가지는 씬)이 존재할 수 있다. 게임 어플 리케이션이 실행되는 동안, 씬의 타입에 따라서 전자 장치의 상태가 상이하게 관찰될 수 있다. 예를 들어, 도 3a는, 플레잉-중(in-play)의 씬 및 플레잉 아님의 씬 동안 관찰되는 FPS 및 온도를 도시한다. 도 3a를 참조하면, FPS는 예를 들어 플레잉 아님의 씬 동안에는 예를 들어 30fps에 가깝게 유지되며, 플레 잉-중의 씬 동안에는 예를 들어 60fps에 가깝게 유지됨을 확인할 수 있다. 아울러, 온도는, 예를 들어 플 레잉 아님의 씬 동안에는 감소할 수 있으며, 플레잉-중의 씬 동안에는 증가함을 확인할 수 있다. 도 3b는, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 FPS 평균값 및 플레잉 중의 씬만을 고려한 경우의 FPS 평균값을 도시한다. 예를 들어, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 FPS 평균값은 44.53일 수 있으며, 플레잉 중의 씬만을 고려한 경우의 FPS 평균값은 59.83일 수 있다. 도 3a에서 설명한 바와 같이, 플레잉 아님의 씬에서는 예를 들어 30fps에 가깝게 FPS가 유지됨 을 확인할 수 있다. 이에 따라, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 FPS 평균값이 59.83보다 낮은 44.53일 수 있다. 한편, 전자 장치는, 씬의 타입을 고려하지 않은 경우에는, 59.83이 아 닌 44.53의 fps를 상태 정보로서 확인하여, 이에 대응하는 정책을 조정할 수 있다. 플레잉 중의 씬만을 고려한 59.83 fps가 타겟 FPS(예를 들어, 60fps)을 만족함으로써 정책을 조정할 필요가 없음에도 불구하고, 전자 장치 는, 44.53의 fps를 상태 정보로서 확인함에 따라 불필요하게 CPU 클럭 및/또는 GPU 클럭을 증가시킬 가능성이 있다. 이에 따라, 전자 장치는, 어플리케이션에서 요구하는 지표에 대응하는 씬(예를 들어, 도 3a의 실시예에서는 플레잉 중의 씬) 동안의 상태 정보만을 고려하여, 정책을 결정할 필요가 있다. 한편, 도 3c는, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 FPS 변동값 및 플레잉 중의 씬 만을 고려한 경우의 FPS 변동값을 도시한다. 변동값들(321,322)에 차이가 있음을 확인할 수 있으며, 이에 따라 전자 장치는 어플리케이션에서 요구하는 지표에 대응하는 씬(예를 들어, 도 3a의 실시예에서는 플레 잉 중의 씬) 동안의 상태 정보만을 고려하여, 정책을 결정할 필요가 있음을 확인할 수 있다. 한편, 도 3d는, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 온도 평균값 및 플레잉 중의 씬만을 고려한 경 우의 온도 평균값을 도시한다. 평균 온도들(331,332)에 차이가 있음을 확인할 수 있으며, 이에 따라 전자 장치는 어플리케이션에서 요구하는 지표에 대응하는 씬(예를 들어, 도 3a의 실시예에서는 플레잉 중의 씬) 동안의 상태 정보만을 고려하여, 정책을 결정할 필요가 있음을 확인할 수 있다. 상술한 바와 같이, 전자 장치는, 어플리케이션이 요구하는 지표에 대응하는 타입의 씬 동안의 상태 정보에 기반하여 정책을 결정할 필요가 있다. 이에 따라, 어플리케이션이 요구하는 지표에 대응하는 타입의 씬의 인식 정확도가 높아질수록, 더욱 정확한 정책 결정이 가능할 수 있다. 전자 장치는, 예를 들어 어플리케이션 화면을 구성하는 이미지를 AI 모델에 입력함으로써, AI 모델로부터 출력되는 씬 식별자를 확인할 수 있다. AI 모델은, 이미지를 입력값으로하고, 씬 식별자를 출력값으로 하도록 트레이닝될 수 있다. 한편, AI 모델을 전자 장치의 타입 별로 트레이닝시킨 경우에는, 전자 장치별로 정확도 차이가 발생할 수 있다. 도 3e 및 3f는 상이한 전자 장치 타입별 AI 정확도를 도시할 수 있다. 예를 들어, AI 모델이 제 1 타입의 전자 장치를 위하여 트레이닝될 수 있다. 도 3e는, 해당 AI 모델이 제 1 타입의 전자 장치에서 이용된 경우의 씬 예측 정확 도 및 ROC(receiver operating characteristic) 커브를 도시한다. 씬 예측 정확도 및 ROC 커 브가 상대적으로 높은 수준임을 확인할 수 있다. 한편, 도 3f는, 해당 AI 모델이 제 1 타입과 상이한 다 른 타입의 전자 장치에서 이용된 경우의 씬 예측 정확도 및 ROC 커브를 도시한다. 씬 예측 정확도 및 ROC 커브가 상대적으로 낮은 수준임을 확인할 수 있다. 이에 따라, 어플리케이션 별로 AI 모델 을 정교하게 트레이닝할 것이 요구될 수 있다. 도 4a는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 4a의 실시예는, 도 4b를 참조하여 설명하도록 한다. 도 4b는, 일 실시예에 따른 정책 결정을 설명하기 위한 도면이다. 도 4a 및 도 4b를 함께 참조하면, 일 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 401 동작 에서, 어플리케이션의 실행을 확인할 수 있다. 전자 장치는, 403 동작에서, 어플리케이션에 대응하는 제 1 AI 모델을 확인할 수 있다. 예를 들어, 전자 장치는, 포어 그라운드에서 실행되는 어플리케이션에 대응하는 제 1 AI 모델을 확인할 수 있으나, 이는 예시적인 것으로 포어 그라운드에서의 실행 또는 백 그 라운드에서의 실행에는 제한이 없다. 전자 장치는, 예를 들어, 적어도 하나의 어플리케이션 각각에 대응 하는 적어도 하나의 AI 모델을 저장할 수 있다. 전자 장치에는, 특정 어플리케이션에 대응하는 AI 모델이 저장될 수도 있지만, 경우에 따라 AI 모델이 저장되지 않을 수도 있다. 이 경우에는, 전자 장치는, AI 모 델(또는, AI 모델과 연관된 정보)을 서버로 요청할 수도 있으며, 이에 대하여서는 후술하도록 한다. 본 실시예에서, 전자 장치는, 실행된 어플리케이션에 대응하는 제 1 AI 모델(또는, 제 1 AI 모델과 연관 된 정보)을 저장하는 것을 상정하도록 한다. 전자 장치는, 적어도 하나의 어플리케이션 및 적어도 하나의 AI 모델 사이의 연관 정보에 기반하여 실행된 어플리케이션에 대응하는 AI 모델을 확인할 수 있으나, 이는 예시 적인 것으로 확인 방식에는 제한이 없다. 전자 장치는, 405 동작에서, 어플리케이션에 대응하는 제 1 AI 모델에 제 1 이미지(예를 들어, 어플 리케이션의 실행 화면 중 적어도 일부의 이미지)를 입력할 수 있다. 제 1 이미지는, jpeg, jfif, exif, gif, png, ppm, pgm, pbm, pnm, hdr, 및/또는 bmp의 포맷을 가질 수 있으나, 이는 예시적인 것으로 그 포맷에는 제 한이 없다. 전자 장치는, 어플리케이션으로부터 제공된 이미지의 포맷을 변경하지 않고 그대로 이용할 수 있거나, 또는 제공된 이미지의 포맷을 다른 포맷으로 변경할 수도 있다. 여기에서, 제 1 AI 모델은, 이 미지를 입력받아, 씬 식별자를 출력하도록 트레이닝될 수 있다. 제 1 AI 모델은, DNN, CNN, RNN, LSTM, RBM, DBN, BRDNN, 및/또는 심층 Q-네트워크의 구조를 가질 수 있으나, 이는 예시적인 것으로 제 1 AI 모델(41 0)의 구조에는 제한이 없다. 제 1 AI 모델은, 제 1 이미지를 입력받아, 제 1 이미지에 대응하는 제 1 씬 식별자(또는, 복수 개의 씬 식별자 각각의 확률)를 제공할 수 있다. 여기에서, 제 1 씬 식별자는, 예를 들어 플레잉-중(in play)의 식별자이거나, 또는 플레잉 아님(not in-play)의 씬 식별자 중 어느 하나일 수 있다. 한 편, 상술한 두 가지 타입의 씬 식별자는 단순히 예시적인 것으로, 제 1 AI 모델은, 3가지 이상의 타입의 씬 식별자 중 어느 하나를 결정하도록(또는, 각 타입별 확률을 제공하도록) 하는 구조를 가지도록 구현될 수도있다. 예를 들어, 표 1은 씬 식별자의 예시이다. 표 1 씬 식별자 씬 관련 정보 0 디폴트 씬 1 게임 시작 중 2 게임 업데이트 중 3 사용자 접속 중 4 대기 방에 있는 경우 5 게임을 위한 씬 로딩 중(사용자 로딩 중) 6 게임을 위한 씬 로딩 중(다른 사용자 로딩 중) 7001게임 플레잉 중(씬#1: NPC와 대화중) 7002게임 플레잉 중(씬#2: 제1캐릭터와 제1장소에서 전투 중) 7003게임 플레잉 중(씬#3: 제2캐릭터와 제2장소에서 전투 중) ...... 8 관전 모드 9 게임 종료 예를 들어, 표 1에서와 같이 플레잉-중에 대한 복수의 예시들 및/또는 플레잉 아님에 대한 복수의 예시들 각각 에 대하여 씬 식별자가 세부적으로 부여될 수도 있으며, 씬 식별자의 종류 및/또는 분류 기준에 대하여서는 제 한이 없다. 전자 장치는, 407 동작에서, 제 1 AI 모델로부터 출력되는 제 1 씬 식별자를 확인할 수 있다. 전자 장치는, 409 동작에서, 제 1 씬 식별자 및 제 1 상태 정보에 기반하여, 제 1 정책을 적용할 수 있다. 도 4b에서와 같이, 전자 장치는, 제 1 상태 정보뿐만 아니라, 제 1 씬 식별자를 함께 이용하여 정책 결정 을 수행할 수 있다. 전자 장치는, 시간의 흐름에 따른 복수 개의 이미지들(예를 들어, 시간의 흐름 에 따른 복수 개의 어플리케이션 실행 화면)을, 제 1 AI 모델로 입력할 수 있다. 전자 장치는, 이에 따라 시간의 흐름에 따른 씬 식별자를 확인할 수 있다. 전자 장치는, 어플리케이션이 요구하는 지표에 대 응하는 씬 식별자에 대응하는 상태 정보를 정책 결정에 이용하고, 나머지 씬 식별자에 대응하는 상태 정보는 정 책 결정에 이용하지 않을 수 있다. 예를 들어, 어플리케이션이 요구하는 지표에 대응하는 씬 식별자가 플레잉- 중의 씬 식별자인 것을 상정하도록 한다. 이 경우, 전자 장치는, 예를 들어 플레이-중의 씬 식별자에 대 응하는 구간 동안의 상태 정보를 이용하여, 제 1 정책을 결정할 수 있다. 전자 장치는, 예를 들어, 플레 잉-아님의 씬 식별자에 대응하는 구간 동안의 상태 정보는, 제 1 정책의 결정에 이용하지 않을 수 있다. 전자 장치는, 플레이-중의 씬 식별자에 대응하는 구간 동안의 상태 정보에 대응하는 통계값(예를 들어, 평균값 및/또는 중간값일 수 있지만 제한은 없음)을 이용하여, 제 1 정책을 결정할 수 있다. 이에 따라, 필요없는 상 태 정보(예를 들어, 플레잉-아님의 씬 식별자에 대응하는 구간 동안의 상태 정보)가 정책 결정에서 배제될 수 있다. 상술한 바와 같이, 예를 들어, 실행 중인 어플리케이션이 요구하는 타겟 FPS가 60fps인 것을 상정하도록 한다. 이 경우, 도 3b에서 설명된 바와 같이, 플레잉-중의 씬 식별자에 대응하는 구간에서는 FPS가 59.83fps를 유지할 수 있지만, 전체 구간에서는 FPS의 평균값이 44.53임을 확인할 수 있다. 전자 장치는, 플레잉-중 의 씬 식별자에 대응하는 구간에서의 상태 정보인 59.83fps를 이용하여 정책을 결정할 수 있다. 예를 들어, 전 자 장치는, 플레잉-중의 씬 식별자에 대응하는 구간에서의 상태 정보인 59.83fps가 타겟 FPS인 60fps를 만 족하는 것으로 확인하여 기존 정책을 유지할 수 있다. 이에 따라, 전자 장치가 요구되지 않는 구간(예를 들어, 플레잉 아님의 씬 식별자에 대응하는 구간)에서의 상태 정보까지 고려된 44.53 fps를 이용하여, 성능(예 를 들어, CPU 및/또는 GPU의 클럭)을 불필요하게 증가시킴이 방지될 수 있다. 한편, 도 4a 및/또는 도 4b에서는, 제 1 AI 모델의 inference 및/또는 정책 결정이 전자 장치 에 의하여 수행됨이 설명되었지만, 이는 예시적인 것이다. 제 1 AI 모델의 inference 및/또는 정책 결정 은, 예를 들어 전자 장치에 대한 외부 전자 장치(예를 들어, 서버일 수 있으나 제한은 없음)에 의하여 수행될 수도 있으며, 수행 결과가 전자 장치로 제공될 수도 있음을 당업자는 이해할 것이다. 도 5는 일 실시예에 따른 AI 모델의 트레이닝 방법을 설명하기 위한 흐름도이다. 실시예에 따라서, 적어도 하 나의 AI 모델의 트레이닝은, 트레이너(trainer)에 의하여 수행될 수 있다. 트레이닝은, 예를 들어 서버 (또는, 다른 컴퓨팅 장치일 수도 있음)에 의하여 수행되거나, 및/또는 AI 모델을 실행하는 전자 장치에 의 하여 수행될 수도 있다. 본 개시에서의 트레이너에 의하여 수행되는 동작은, 전자 장치(또는, 프로세서) 및/또는 서버(예: 서버에 포함된 프로세서(미도시))에 의하여 수행되는 것으로 이해될 수 있 다. 일 실시예에 따라서, 트레이너는, 501 동작에서, 제 1 어플리케이션에 대응하는 적어도 하나의 트레이닝 데이터 를 획득할 수 있다. 여기에서, 적어도 하나의 트레이닝 데이터는, 예를 들어 제 1 어플리케이션의 적어도 하나 의 실행 화면일 수 있으나 제한은 없다. 상술한 바와 같이, 트레이닝 데이터의 포맷은 jpeg일 수 있으나 제한 이 없으며, 트레이닝 데이터는, 어플리케이션의 실행 화면의 포맷과 동일하거나, 또는 포맷 변환에 따라 상이할 수도 있다. 예를 들어, 트레이닝 데이터는 씬 식별자가 레이블링된 데이터일 수 있다. 레이블 정보는, 예를 들어 이미지 별로 할당될 수 있으며, 그 표현 방식에는 제한이 없으며, 이미지 및 레이블의 쌍(pair)를 표현하 는 방식 및/또는 표현을 위한 프로그램에도 제한이 없다. 예를 들어, 적어도 하나의 트레이닝 데이터는, 제 1 씬 식별자(예를 들어, 플레잉-중의 씬 식별자)에 대응하는 적어도 하나의 제 1 어플리케이션 실행 화면을 포함 할 수 있으며, 해당 실행 화면에는 제 1 씬 식별자가 레이블링될 수 있다. 예를 들어, 적어도 하나의 트레이닝 데이터는, 제 2 씬 식별자(예를 들어, 플레잉-아님의 씬 식별자)에 대응하는 적어도 하나의 제 1 어플리케이션 실행 화면을 포함할 수 있으며, 해당 실행 화면에는 제 2 씬 식별자가 레이블링될 수 있다. 트레이너는, 503 동작에서, 제 1 어플리케이션에 대응하는 제 1 AI 모델을 적어도 하나의 트레이닝 데이터를 이용하여 트레이닝 할 수 있다. 예를 들어, 트레이너는, 적어도 하나의 레이블링된 제 1 어플리케이션의 실행 화면을 이용하여, 제 1 AI 모델을 트레이닝시킬 수 있다. 예를 들어, 트레이너는, 기 존재하는 제 1 AI 모델을 트레이닝 시킬 수 있다. 예를 들어, 트레이너는, 제 1 AI 모델을 생성하고, 생성된 제 1 AI 모델을 트레이닝 시킬 수 있다. 한 편, 제 1 AI 모델의 트레이닝 방식 및/또는 손실 함수(loss function)의 종류에는 제한이 없다. 트레이너는, 505 동작에서, 트레이닝된 제 1 AI 모델과 연관된 정보를, 제 1 AI 모델을 inference하는 장치(예를 들어 전자 장치이지만 제한이 없음)로 송신할 수 있다. 여기에서, 제 1 AI 모델을 송신하는 것은, 제 1 AI 모델을 표현하기 위한 정보 전체를 송신하는 것뿐만 아니라, 제 1 AI 모델을 표현하기 위한 정보 중 일부(예를 들어, 노드 별 가중치 및/또는 바이어스일 수 있지만 제한이 없음)을 송신하는 것을 의미할 수도 있다. 예를 들어, 트레이너는, 장치(예를 들어 전자 장치이지만 제한이 없음)로부터의 요청에 기반하여 제 1 AI 모델을 송신 할 수 있다. 예를 들어, 트레이너는, 어플리케이션의 인스톨이 확인된 경우, 제 1 AI 모델을 송신할 수 있다. 예를 들어, 트레이너는, 어플리케이션(또는, 어플리케이션 패키지)의 송신시, 제 1 AI 모델을 송신할 수 있다. 예를 들어, 트레이너는, 제 1 AI 모델이 업데이트되는 경우, 제 1 AI 모델을 송신할 수 있다. 한편, 제 1 AI 모델의 송신을 위한 이벤트에는 제한이 없다. 예를 들어, 트레이너는, 트레이닝된(또는, 업데이팅된) AI 모델 의 성능(예를 들어, ROC 스코어 등일 수 있으나 제한이 없음)이 기존의 AI 모델의 성능보다 우수한 경우에, 해 당 AI 모델로 업데이트할 수 있다. AI 모델의 호출은 Lambda에 기반하여 수행될 수 있으나, 제한은 없다. 업 데이트된 AI 모델은 inference 장치로 제공될 수 있다. 도 6a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 6a의 실시예는, 도 6b를 참조하여 설명하도록 한다. 도 6b는, 일 실시예에 따른 트레이닝 데이터의 생성을 설명하기 위한 도면이 다. 한편, 도 6a 및 도 6b의 실시예에서는, 트레이닝 데이터의 생성이 트레이너에 의하여 수행될 수 있음이 설 명되었지만, 이는 예시적인 것이며 그 수행 주체에는 제한이 없다. 예를 들어, 트레이너와, 트레이닝 데이터를 관리하는 주체가 상이하게 구현될 수도 있으며, 이 경우에는 트레이닝 데이터를 관리하는 장치가, 트레이닝 데 이터를 생성할 수 있다. 또는, 트레이닝 데이터의 생성은, AI 모델을 inference 하는 장치에 의하여 수행될 수 도 있음을 당업자는 이해할 것이다. 한편, 트레이너에 의하여 수행되는 동작들 중 적어도 일부가, 트레이닝 데 이터 관리 장치 및/또는 AI 모델의 inference 장치에 의하여 수행될 수 있음은 본 실시예뿐만 아니라, 본 개시 의 다른 실시예에도 적용될 수도 있다. 도 6a 및 도 6b를 함께 참조하면, 일 실시예에 따라서, 트레이너는, 601 동작에서, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인할 수 있다. 도 6b에서와 같이, 제 1 이미지는, 적어도 하나의 비쥬얼 오브젝트 (621,622,623,624,625,626,627)를 포함할 수 있다. 도 6b에서의 적어도 하나의 비쥬얼 오브젝트 (621,622,623,624,625,626,627)는, 다양한 형상의 도형으로 표현되어 있으나 이는 설명의 편의를 위한 것이며, 이미지에 포함되는 비쥬얼 오브젝트의 형상, 색상, 크기, 및/또는 속성에는 제한이 없다. 만약, 제 1 이미지 가 게임 어플리케이션의 실행 화면인 경우에는, 제 1 이미지에는 게임 캐릭터에 대응하는 비쥬얼 오 브젝트, 게임 배경에 대응하는 비쥬얼 오브젝트, 게임 캐릭터의 조작을 위한 비쥬얼 오브젝트, 게임 캐릭터의 속성을 위한 비쥬얼 오브젝트, 게임 진행 상황(예를 들어, 스테이지 관련 정보)을 위한 비쥬얼 오브젝트를 포함 할 수 있으나, 그 종류에는 제한이 없으며, 게임 어플리케이션 이외에도 다양한 타입의 어플리케이션이 가능할 수도 있다.트레이너는, 603 동작에서, 제 1 AI 모델 및 제 1 이미지를 이용하여, 제 1 이미지가 제 1 씬 식별자로 분류되는데 기여하는 적어도 하나의 제 1 영역, 예를 들어 비쥬얼 오브젝트(626,627)를 포함하는 영역 을 확인할 수 있다. 예를 들어, 트레이너는, 제 1 씬 식별자로 분류되는데 기여하는 영역을 판단하기 위한 조 건을 저장 및/또는 로드할 수 있다. 후술할 것으로, 조건은, 특징 중요도(feature importance)에 기반하여 설 정될 수 있다. 트레이너는, 제 1 이미지에 대응하는 활성화 맵(activation map)을 확인할 수 있으며, 활 성화 맵은 특징 중요도에 기반하여 표현될 수 있다. 트레이너는, 특징 중요도가 지정된 임계 특징 중요도 이상 인 영역(또는, 특징 중요도가 임계 특징 중요도 이상인 비율이 임계 비율 이상인 영역)을, 제 1 이미지가 제 1 씬 식별자로 분류되는데 기여하는 영역으로서 확인할 수 있다. 일 실시예에서, 트레이너는, LIME(Local Interpretable Model-agnostic Explanation)에 기반하여, 제 1 이미지 가 제 1 씬 식별자로 분류되는데 기여하는 영역을 확인할 수 있다. 예를 들어, 트레이너는, 제 1 이미지 를 해석 가능한 요소로 분할할 수 있다. 트레이너는, 분할된 요소 중 적어도 일부를 처리(예를 들어, 회 색 처리일 수 있지만 제한이 없음)하여 AI 모델을 트레이닝할 수 있다. 이후, 학습 성능이 기존에 비하여 저하 되는 경우, 트레이너는 해당 영역을 제 1 씬 식별자로 분류되는데 기여하는 영역으로서 확인할 수 있다. 일 실 시예에서, 트레이너는, Unpooling and Deconvolution에 기반하여, 제 1 이미지가 제 1 씬 식별자로 분류 되는데 기여하는 영역을 확인할 수 있다. 예를 들어, CNN은 특정 결과를 예측할 수 있도록 이미지를 압축하는 구조일 수 있다. 이에 따라, CNN의 최종 레이어에는 결과 예측에 상대적으로 기여를 크게 한 부분에 대한 가중 치가 상대적으로 클 수 있다. 해당 레이어를 다시 Deconvolution함으로써, 기존 이미지에 가중치가 상대적으로 큰 부분이 확인될 수 있다. 트레이너는, 해당 부분을, 제 1 씬 식별자로 분류되는데 기여하는 영역으로서 확인 할 수 있다. 일 실시예에서, 트레이너는, CAM(class activation map)에 기반하여 제 1 이미지가 제 1 씬 식별자로 분류되는데 기여하는 영역을 확인할 수 있다. CAM은 변화량 측정을 위해 중간에 global average pooling을 포함할 수 있다. 트레이너는, Guided Backpropagation에 기반하여 제 1 이미지가 제 1 씬 식 별자로 분류되는데 기여하는 영역을 확인할 수 있다. guided backpropagation은 피처 맵(feature map)을 사전 에 전처리하여 이용하는 방법일 수 있다. 한편, 상술한 제 1 이미지가 제 1 씬 식별자로 분류되는데 기여 하는 영역의 확인 방식은 예시적인 것으로 제한이 없다. 트레이너는, 605 동작에서, 제 1 이미지의 제 1 영역, 예를 들어 비쥬얼 오브젝트(626,627)를 포함하는 영 역의 적어도 일부의 픽셀 값을 변경하기 위한 제 1 처리를 수행함으로써, 제 1 AI 모델을 위한 트레이닝 데이터 를 확인할 수 있다. 여기에서의 픽셀 값의 변경은, 예를 들어 픽셀 값을 블랙에 대응하는 값으로 변경하 는 블랙 처리를 포함할 수 있으나, 변경 이후의 픽셀 값 및/또는 픽셀 값의 패턴에는 제한이 없음을 당업자는 이해할 것이다. 제 1 AI 모델을 위한 트레이닝 데이터는, 예를 들어 블랙 처리된 영역(636,637)을 포함할 수 있다. 제 1 영역, 예를 들어 비쥬얼 오브젝트(626,627)를 포함하는 영역에 대한 제 1 처리(예를 들어, 블랙 처리)가 수행됨에 따라, 제 1 AI 모델을 위한 트레이닝 데이터가 제공될 수 있으나, 블랙 처리는 단순히 예시적인 것으로 그 처리 방식에는 제한이 없다. 예를 들어, 제 1 AI 모델은, 제 1 이미지의 비쥬얼 오브젝트(626,627)에 기반하여, 제 1 이미지에 대응하는 씬 식별자를 제 1 씬 식별자로 확인할 수 있다. 한편, 씬 식별자로 분류될 가능성을 증가시킬 수 있는 비쥬얼 오브젝트가 포함되지 않는 이미지가, 해당 씬 식 별자로 분류되지 않을 가능성이 있다. 예를 들어, 비쥬얼 오브젝트(626,627)가 포함되지 않는 이미지에 대응하 는 씬 식별자를 제 1 씬 식별자가 아닌 다른 씬 식별자로 분류하도록 제 1 AI 모델이 트레이닝될 가능성이 존재할 수 있다. 트레이너는, 제 1 씬 식별자로 분류하도록 상대적으로 큰 기여를 한 비쥬얼 오브젝트 (626,627)를 배제한 트레이닝 데이터를 생성할 수 있다. 트레이너는, 트레이닝 데이터를 이용하여 제 1 AI 모델을 트레이닝할 수 있다. 이에 다라, 제 1 AI 모델은, 제 1 씬 식별자로 분류하도록 상 대적으로 큰 기여를 한 비쥬얼 오브젝트(626,627) 이외의 다른 오브젝트(예를 들어, 621,622,623,624,625 중 적 어도 일부)를 포함한 이미지 또한 제 1 씬 식별자로 분류되도록 제 1 AI 모델을 트레이닝시킬 수 있다. 이에 따라, 다양한 비쥬얼 오브젝트에 기반하여 제 1 AI 모델이 트레이닝될 수 있으며, 일부 비쥬얼 오브 젝트에 대하여 오버피팅되지 않을 수 있다. 도 6c는 일 실시예에 따른 블랙 처리에 따른 트레이닝 데이터의 생성을 설명하기 위한 도면이다. 일 실시예에 따라서, 트레이너는, 제 1 이미지를 획득할 수 있다. 제 1 이미지에 대하여서는 제 1 씬 식별자라 레이블링될 수 있다. 트레이너는, 제 1 이미지에 대응하는 활성화 맵을 획득할 수 있다. 여기에서, 활성화 맵 내의 픽셀(또는, 서브 영역) 각각은, 특징 중요도(feature importance)로 표 현될 수 있으며, 활성화 맵의 생성 과정에 대하여서는 후술하도록 한다. 활성화 맵의 제 1 영역 은, 제 1 활성화 맵과 같이 표현될 수 있다. 제 1 활성화 맵 내의 각각의 픽셀(또는, 서브 영역)은, 특징 중요도로 표현될 수 있다. 특징 중요도는, 예를 들어 0 이상 1 이하의 값으로 표현될 수 있으나, 그 표현 방식에는 제한이 없다. 트레이너는, 예를 들어 특징 중요도가 0.8 미만인 영역을 블랭크(blank) 처리 할 수 있으며, 블랭크 처리된 제 1 활성화 맵이 확인될 수 있으며, 0.8의 수치는 예시적인 것으로 제한이 없다. 트레이너는, 예를 들어 특징 중요도가 0.8 이상인 영역에 대한 윤곽선(또는, 컨투어(contour))를 설정할 수 있으며, 0.8의 수치는 예시적인 것으로 제한이 없다. 윤곽석이 표현된 제 1 활성화 맵를 포함한 전체 이미지가 도 6c에 도시될 수 있다. 트레이너는, 윤곽선 및 윤곽선 내부의 영역을 블랙 처리한 활성화 맵을 확인할 수 있다. 트레이너는, 블랙 처리된 활성화 맵에 대응하여 블랙 처리된 영역을 포함한 이미지를, 트레이닝 데이터로서 확인할 수 있다. 한편, 도 6c의 과정에 따른 처리 과정 및 /또는 처리 과정은 단순히 예시적인 것으로, 특정 씬 식별자로 분류되는 데 상대적으로 큰 기여를 한(또는, 분 류와 연관된 조건을 만족하는) 영역을 배제하는 방식에는 제한이 없다. 도 7a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 7a의 실시예는, 도 7b 및 도 7c를 참조하여 설명하도록 한다. 도 7b 및 도 7c는, 다양한 실시예들에 따른 AI 모델의 구조를 설명 하기 위한 도면이다. 일 실시예에 따라서, 트레이너는, 701 동작에서, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인할 수 있다. 트레이너는, 703 동작에서, 예를 들어, 도 7b와 같은 CNN 기반의 제 1 AI 모델 및 제 1 이미지를 이용하여, 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하는 활성화 맵을 확인할 수 있다. 예를 들어, 도 7b 및 도 7c를 참조하면, 제 1 AI 모델은, 컨볼루션 레이어를 포함할 수 있다. 컨볼루션 레이어를 구성 하는 피처(feature)의 크기 및/또는 종류에는 제한이 없다. 제 1 이미지는, 입력 레이어으로 제공될 수 있다. 입력 레이어는, 예를 들어 제 1 이미지에 대응하는 복수 개의 채널 별 이미지들에 기반할 수 있다. 입력 레이어는, 컨볼루션 레이어로 연결될 수 있다. 컨볼루션 레이어는 적어도 하나의 피처 맵 을 출력할 수 있다. 제 1 AI 모델은 적어도 하나의 피처 맵을 평탄화(flatten)하도록 하는 구조를 포함할 수 있다. 피처 맵은, 평탄화된 레이어는, 예를 들어 매트릭스 형태의 피처 맵에 대응될 수 있다. 한편, 매트릭스 형태의 적어도 하나의 피처 맵 각각의 Ak i,j로 표기될 수 있다. 평탄화된 레이어 는 완전히 연결된 레이어(fully connected layer)로 연결될 수 있다. 완전히 연결된 레이어는, 출력 레이어로 연결될 수 있다. 출력 레이어는, 예를 들어 두 개의 출력 파라미터 (S1,S2)를 포함할 수 있다. 예를 들어, 제 1 출력 파라미터(S1)는 제 1 씬 식별자(예를 들어, 플레이-중의 씬 식별자)일 확률에 대응할 수 있으며, 제 2 출력 파라미터(S2)는 제 2 씬 식별자(예를 들어, 플레이 아님의 씬 식별자)일 확률에 대응할 수 있다. 예를 들어, AI 모델이 inference 되는 경우에는, 양 파라미터들(S1,S2) 중 높은 값에 대응하는 씬 식별자가 제 1 이미지에 대응하는 씬 식별자로 결정될 수 있다. 한편, 출력 레이어 는, yc 로 표현될 수 있다. 제 1 AI 모델에 대한 역전파에 기반하여 활성화 맵이 생성될 수 있다. 예를 들어, 활성화 맵은 수학식 1 및 수학식 2에 기반하여 결정될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2023-0019628", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1 및 수학식 2에서, c는 클래스를 나타낼 수 있으며, 예를 들어 \"1\"은 플레이-중의 씬 식별자에 대응할 수 있으며, \"0\"은 플레이-아님의 씬 식별자에 대응할 수 있다. k는 피처 맵(예를 들어, 매트릭스)에 대한 인덱 스일 수 있다. z 는 매트릭스의 행과 열의 곱일 수 있다. i, j는 매트릭스 내의 i, j번째의 엘리먼트일 수 있다. 수학식 1 및 수학식 2과 같은 역전파(back propagation)에 따라서, 피처 맵과, 편미분 값에 기반한 기여도 의 곱에 기반하여 활성화 맵(Lc)가 결정될 수 있으나, 이는 예시적인 것으로 활성화 맵(Lc)의 확인 방식에는 제 한이 없다. 상술한 바에 기반하여, 활성화 맵이 확인될 수 있다. 트레이너는, 705 동작에서, 활성화 맵의 특징 중요도가 지정된 조건을 만족하는 적어도 하나의 제 1 영역을 확인할 수 있다. 지정된 조건은, 예를 들어 특징 중요도가 임계 특징 중요도(예를 들어, 0.8) 이상인 조건일 수 있으나 제한은 없다. 트레이너는, 707 동작에서, 적어도 하나의 제 1 영역을 블랙 처리함으로써, 제 1 AI 모델을 위한 트레이닝 데이터를 확인할 수 있다. 예를 들어, 도 6c의 실시예를 참조하여 설명된 바와 같이, 트레이너는, 특징 중요도가 임계 특징 중요도 미만인 부분에 대 한 블랭크 처리를 수행할 수 있다. 트레이너는, 블랭크 처리된 활성화 맵에서의 윤곽선을 확인할 수 있다. 트 레이너는, 윤곽선에 의하여 정의된 영역을 확인할 수 있다. 트레이너는, 윤곽선에 의하여 정의된 영역에 대한 블랙 처리를 수행할 수 있다. 이에 따라, 트레이너는, 블랙 처리된 활성화 맵을 확인할 수 있다. 트레이너는, 활성화 맵에서 블랙 처리된 영역에 대응하는 제 1 이미지의 픽셀들에 대하여 블랙 처리를 수행함으로써, 트레이 닝 데이터를 확인할 수 있으나, 상술한 과정은 단순히 예시적인 것으로 제한이 없다. 도 8a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 트레이너는, 801 동작에서, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인할 수 있다. 트레이너는, 803 동작에서, 제 1 AI 모델 및 제 1 이미지를 이용하여, 제 1 이미지가 제 1 씬 식별자로 분류되 는데 기여하는 적어도 하나의 제 1 영역을 확인할 수 있다. 트레이너는, 805 동작에서, 제 1 이미지의 제 1 영 역에 대한 제 1 처리를 수행함으로써, 제 1 AI 모델을 위한 트레이닝 데이터를 확인할 수 있다. 801 동작, 803 동작, 및 805 동작에 기반한 트레이닝 데이터의 확인은, 도 6a, 도 6b, 및/또는 도 6c를 참조하여 설명하였으므 로, 여기에서의 상세한 설명은 반복되지 않는다. 일 실시예에 따라서, 트레이너는, 807 동작에서, 트레이닝 데이터가 지정된 조건을 만족하는지 여부를 확인할 수 있다. 하나의 예에서, 트레이너는, 특징 중요도가 지정된 조건을 만족(예를 들어, 0.8 이상인)하는 영역이 전체 활성화 맵에서 차지하는 비율이 임계 비율(예를 들어, 0.25) 이상인지 여부를, 지정된 조건이 만족하는지 여부로서 확인할 수 있다. 하나의 예에서, 트레이너는, 특징 중요도가 지정된 조건을 만족(예를 들어, 0.8 이 상인)하는 영역의 개수 임계 개수(예를 들어, 3개) 이상인지 여부를, 지정된 조건이 만족하는지 여부로서 확인 할 수 있다. 하나의 예에서, 트레이너는, 특징 중요도가 지정된 조건을 만족(예를 들어, 0.8 이상인)하는 영역 의 크기가, 활성화 맵의 크기의 1/N배보다 큰지 여부를, 지정된 조건이 만족하는지 여부로서 확인할 수 있다. 하나의 예에서, 트레이너는, 특징 중요도가 지정된 조건을 만족(예를 들어, 0.8 이상인)하는 영역들끼리 서로 겹치는 정보다 임계 정도(예를 들어, 0.5) 이상인지 여부를, 지정된 조건이 만족하는지 여부로서 확인할 수 있 다. 한편, 상술한 지정된 조건에는 제한이 없다. 만약 트레이닝 데이터가 지정된 조건을 만족하지 않는 경우(807-아니오), 트레이너는, 809 동작에서, 트레닝 데 이터에 대한 추가 조정을 수행할 수 있다. 하나의 예에서, 트레이너는, 확인된 영역의 형상의 변경을, 추가 조 정으로서 수행할 수 있다. 예를 들어, 확인된 영역은, 예를 들어 직사각형의 형태를 가질 수 있으나, 최초의 확인된 영역 별 형태가 직사각형인 것은 단순히 예시적인 것으로 그 형태에는 제한이 없다. 트레이너는, 직사 각형의 형태를 다른 도형(예를 들어, 삼각형, 원, 다이아몬드일 수 있으나, 제한이 없음)으로 변경할 수 있다. 하나의 예에서, 트레이너는, 확인된 영역의 크기 변경을, 추가 조정으로서 수행할 수 있다. 하나의 예에서, 트 레이너는, 확인된 영역의 이동을, 추가 조정으로서 수행할 수 있다. 예를 들어, 트레이너는, 지정된 조건이 만 족될 때까지, 추가 조정을 반복적으로 수행할 수 있다. 또는, 트레이너는, 추가 조정을 지정된 횟수 수행한 이 후에도 지정된 조건이 만족되지 않으면, 해당 트레이닝 데이터는 폐기할 수도 있다. 지정된 조건이 만족되면 (807-예), 트레이너는, 811 동작에서 트레이닝 데이터를 이용하여 제 1 AI 모델을 트레이닝할 수 있다. 만약, 도 8a의 동작들이, 트레이닝 데이터 관리 장치에 의하여 수행되는 경우에는, 관리 장치는, 811 동작을 대체하여, 트레이닝 데이터를 출력(또는, 생성, 제공, 및/또는 저장)할 수도 있다. 상술한 바에 따라서, AI 모 델의 성능을 향상시키는 효과가 상대적으로 낮은 트레이닝 데이터가 제공되지 않거나, 및/또는 AI 모델의 성능 을 향상시키는 효과가 상대적으로 큰 트레이닝 데이터가 제공될 수 있다. 한편, 도 8b는 일 실시예에 따른 트 레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 8b에서의 821 동작, 823 동작, 825 동작, 및 829 동작에 대하여서는, 도 8a를 참조하여 설명하였으므로, 여기에서의 상세한 설명은 반복되지 않는다. 한편, 트 레이닝 데이터가 지정된 조건을 만족하지 않는 경우(827-아니오), 트레이너는, 831 동작에서, 해당 트레이닝 데 이터를 폐기할 수도 있다. 예를 들어, 트레이너는, 도 8a의 실시예에서와 같이 트레이닝 데이터에 대한 추가조정을 수행하지 않고, 트레이닝 데이터를 폐기할 수도 있다. 예를 들어, 트레이너는 트레이닝 데이터를 메모리 (예: 도 1의 메모리)에서 삭제할 수 있다. 도 8c는 일 실시예에 따른 트레이닝 데이터의 지정된 조건의 만족 여부 판단을 설명하기 위한 도면이다. 일 실시예에 따라서, 생성된 트레이닝 데이터에는, 복수 개의 블랙 처리된 영역들(842,843)이 포함될 수 있다. 한편, 도 8c의 실시예는, 트레이닝 데이터에서 지정된 조건의 만족 여부를 판단하는 것과 같이 설명되지 만, 이는 예시적인 것으로 지적된 조건의 만족 여부는 트레이닝 데이터뿐만 아니라 활성화 맵 레벨에서도 수행 될 수도 있음을 당업자는 이해할 것이다. 도 8c에서와 같이, 블랙 처리된 영역들(842,843)은 서로 겹칠 수도 있다. 이 경우, 전체 영역(예를 들어, 영역 및/또는 영역)에 대한 겹치는 영역의 비율이 임계 비율보다 작은 경우에는, 지정된 조건이 만족되지 않은 것으로 판단될 수 있다. 예를 들어, 제 1 영역이 제 2 영역에 실질적으로 포함되는 경우에는, 트레이너는 제 1 영역을 배제하고 제 2 영역만이 포함된 이미지를 트레 이닝 데이터로서 확인할 수 있다. 또는, 지정된 조건이 만족되지 않는 경우, 트레이너는, 영역에 대한 변경, 및/또는 이동의 추가 조정을 수행할 수도 있으며, 제한이 없다. 도 9는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 901 동작에서, 전자 장치의 상태 정보 를 확인할 수 있다. 도 9의 예시에서, 상태 정보에는, 예를 들어 전자 장치와 연관된 적어도 하나의 온도 가 포함될 수 있다. 전자 장치는, 903 동작에서, 상태 정보에 기반하여, 전자 장치의 현재 상태가 과온도 상태에 있는지 여부를 확인할 수 있다. 예를 들어, 온도가 임계 온도 이상인지 여부에 따라, 현재 상태 가 과온도 상태에 있는지 여부가 결정될 수 있으나, 과온도 상태를 결정하기 위한 조건에는 제한이 없다. 현재 상태가 과온도 상태에 있는 경우(903-예), 전자 장치는 905 동작에서, 과온도 상태에 대응하는 정책을 적 용할 수 있다. 과온도 상태에 대응하는 정책은, 예를 들어 온도 하강을 위한 성능 제한(예를 들어, CPU 클럭 감소 및/또는 GPU 클럭 감소)일 수 있으나 제한은 없다. 현재 상태가 과온도 상태가 아닌 것으로 확인되면 (903-아니오), 전자 장치는, 907 동작에서, AI 모델을 이용하여 씬 식별자를 확인할 수 있다. 상술한 바 와 같이, 전자 장치는, 예를 들어 포어 그라운드에서 실행 중인 어플리케이션에 대응하는 AI 모델에, 어플 리케이션 실행 화면을 입력함으로써, 어플리케이션 실행 화면에 대응하는 씬 식별자를 확인할 수 있다. 전자 장치는, 909 동작에서, 씬 식별자 및 상태 정보를 이용하여 정책을 적용할 수 있다. 전자 장치는, 911 동작에서, 정책 적용 이전과 비교하여, 성능이 개선되었는지 여부를 확인할 수 있다. 성능 개선 여부를 확 인하기 위한 파라미터는, 예를 들어, FPS의 평균, 변동값, 발열(overheat ratio)일 수 있으나, 그 종류에는 제 한이 없다. 성능이 개선되지 않은 것으로 확인되면(911-아니오), 전자 장치는, 913 동작에서, 서버 에 AI 모델 트레이닝을 요청할 수 있다. 예를 들어, 성능이 개선되지 않음은, AI 모델의 분류 오류에서 기인한 것일 수 있으며, 이에 따라 서버는 기존 AI 모델에 대한 추가적인 트레이닝을 수행하거나, 및/또는 AI 모 델을 교체할 수 있다. 아울러, 도시되지는 않았지만, 전자 장치는, 성능이 개선되지 않은 것으로 확인되 면, 이전 정책을 다시 적용할 수도 있다. 성능이 개선된 것으로 확인되면(911-예), 전자 장치는, 915 동 작에서, 어플리케이션 실행이 유지되는지 여부를 확인할 수 있다. 어플리케이션이 종료되면(915-아니오), 전자 장치는, 예를 들어 AI 모델을 더 이상 참조하지 않을 수도 있다. 도 10a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 10a의 실시예는, 도 10b를 참조하여 설명하도록 한다. 도 10b는, 일 실시예에 따른 가우시안 필터의 적용을 설명하기 위한 도면이 다. 일 실시예에 따라서, 트레이너는, 1001 동작에서, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인할 수 있다. 트레이너는, 1003 동작에서, 제 1 이미지의 크기를 변환할 수 있다. 예를 들어, 트레이너는, N X M의 크기로 제 1 이미지를 축소시킬 수 있으나, 변환된 이미지의 크기에는 제한이 없으며, 확대될 수도 있다. 트레이너는, 1005 동작에서, 변환된 제 1 이미지에 대하여 가우시안 필터링을 수행할 수 있다. 도 10b에서와 같이, 제 1 이 미지에 대하여 다양한 블러링 정도로 가우시안 필터링이 적용된 블러된 이미지들(1032,1033,1034)이 생성 될 수 있다. 가우시안 필터링이 수행됨에 따라서, 제 1 이미지에 포함된 텍스트가 블러처리될 수 있다. 트레이너는, 예를 들어 제 1 이미지 내의 텍스트의 속성(예를 들어, 크기, 컬러, 및/또는 품질일 수 있지 만 제한이 없음)에 기반하여 블러링 정도(예를 들어, 가우시안 필터링의 σ 값으로 0 내지 8 중 결정될 수 있음)를 결정할 수 있으나, 제한은 없다. 한편, 가우시안 필터링은 단순히 예시적인 것으로, 블러를 위한 방식 에는 제한이 없다. 트레이너는, 제 1 이미지 전체에 대하여 블러링을 수행할 수 있거나, 또는 일부 영역 (예를 들어, 텍스트가 포함된 영역)에만 블러링을 수행하도록 설정될 수도 있다. 트레이너는, 1007 동작에서,필터링된 이미지 및 제 1 AI 모델을 이용하여, 제 1 이미지가 제 1 씬 식별자로 분류되는데 기여하는 적어도 하 나의 제 1 영역을 확인할 수 있다. 트레이너는, 1009 동작에서, 제 1 이미지의 제 1 영역에 대한 제 1 처리를 수행함으로써, 제 1 AI 모델을 위한 트레이닝 데이터를 확인할 수 있다. 제 1 씬 식별자로 분류되는데 기여하 는 적어도 하나의 제 1 영역의 확인 방식 및/또는 제 1 영역에 대한 제 1 처리에 대하여서는 상술하였으므로, 여기에서의 설명은 반복되지 않는다. 도 11은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 1101 동작에서, 제 1 어플리케이션을 실행 할 수 있다. 전자 장치는, 1103 동작에서, 제 1 어플리케이션에 대응하는 제 1 AI 모델에 기반하여 정책 을 적용할 수 있다. 상술한 바와 같이, 전자 장치는, 어플리케이션에 대응하는 AI 모델을 확인할 수 있으 며, 이에 따라 제 1 어플리케이션에 대응하는 제 1 AI 모델을 확인할 수 있다. 전자 장치는, 제 1 AI 모 델을 이용하여, 제 1 어플리케이션의 실행 화면에 대응하는 씬 식별자를 확인할 수 있다. 전자 장치는, 확인된 씬 식별자 및 상태 정보에 기반하여, 정책을 결정하여 적용할 수 있다. 전자 장치는, 1105 동작 에서, 포어 그라운드에서 실행되는 어플리케이션이 변경되는지 여부를 확인할 수 있다. 포어 그라운드에서 실 행되는 어플리케이션이 변경되지 않는 경우(1105-아니오), 전자 장치는, 제 1 AI 모델에 기반하여 정책을 적용할 수 있다. 포어 그라운드에서 실행되는 어플리케이션이 변경되는 경우(1105-예), 전자 장치는, 1107 동작에서, 포어 그라운드에서 실행되는 제 2 어플리케이션을 확인할 수 있다. 전자 장치는, 1109 동 작에서, 제 2 어플리케이션에 대응하는 AI 모델이 확인되는지 여부를 확인할 수 있다. 전자 장치는, 예를 들어 제 2 어플리케이션의 타입이 지정된 타입(예를 들어, 게임)인 경우에, AI 모델이 확인되는지 여부를 확인 할 수 있다. 전자 장치는, 제 2 어플리케이션의 타입이 지정된 타입인지 여부를 서버로 문의하여 확 인할 수도 있다. 어플리케이션 별로 AI 모델이 전자 장치에 저장될 수도 있거나, 또는 저장되지 않을 수 도 있다. 제 2 어플리케이션에 대응하는 제 2 AI 모델이 확인되는 경우(1109-예), 전자 장치는, 1111 동 작에서, 제 2 어플리케이션에 대응하는 제 2 AI 모델에 기반하여 정책을 적용할 수 있다. 전자 장치는, 제 2 AI 모델을 이용하여, 제 2 어플리케이션의 실행 화면에 대응하는 씬 식별자를 확인할 수 있다. 전자 장치 는, 확인된 씬 식별자 및 상태 정보에 기반하여, 정책을 결정하여 적용할 수 있다. 만약, 제 2 어플리케 이션에 대응하는 제 2 AI 모델이 확인되지 않는 경우(1109-아니오), 전자 장치는, 1113 동작에서, 기본 정 책을 적용할 수 있다. 또는, 전자 장치는, 제 2 어플리케이션에 대응하는 제 2 AI 모델이 확인되지 않는 경우, 제 2 어플리케이션에 대응하는 제 2 AI 모델을 서버로 요청할 수도 있다. 서버로부터 제 2 어 플리케이션에 대응하는 제 2 AI 모델이 수신되면, 전자 장치는, 제 2 어플리케이션에 대응하는 제 2 AI 모 델에 기반하여 정책을 적용할 수 있다. 전자 장치는, 서버로부터 제 2 어플리케이션에 대응하는 제 2 AI 모델이 수신되지 않으면, 기본 정책을 적용할 수도 있다. 도 12는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 일 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 1201 동작에서, 제 1 어플리케이션을 실행 할 수 있다. 전자 장치는, 1203 동작에서, 제 1 어플리케이션에 대응하는 AI 모델이 확인되는지 여부를 확인할 수 있다. 예를 들어, 전자 장치에는, 제 1 어플리케이션에 대응하는 AI 모델이 저장될 수도 있거 나, 또는 저장되지 않을 수도 있다. 만약, 제 1 어플리케이션에 대응하는 AI 모델이 확인되는 경우(1203-예), 전자 장치는, 1205 동작에서, 제 1 어플리케이션에 대응하는 AI 모델에 기반하여 정책을 적용할 수 있다. 전자 장치는, 제 1 AI 모델을 이용하여, 제 1 어플리케이션의 실행 화면에 대응하는 씬 식별자를 확인할 수 있다. 전자 장치는, 확인된 씬 식별자 및 상태 정보에 기반하여, 정책을 결정하여 적용할 수 있다. 만약, 제 1 어플리케이션에 대응하는 AI 모델이 확인되지 않는 경우(1203-아니오), 전자 장치는, 1207 동 작에서, 제 1 어플리케이션에 대응하는 AI 모델을 AI 모델 관리 장치(예를 들어, 서버)에 요청할 수 있다. 전자 장치는, 1209 동작에서, 제 1 어플리케이션에 대응하는 AI 모델이 AI 모델 관리 장치(예를 들어, 서 버)로부터 수신되는지 여부를 확인할 수 있다. 모델 관리 장치(예를 들어, 서버)는, 전자 장치(10 1)로부터의 요청에 기반하여, 제 1 어플리케이션에 대응하는 AI 모델이 존재하는 경우에, 전자 장치로 AI 모델(또는, AI 모델과 연관된 정보)를 제공할 수 있다. 전자 장치는, 모델 관리 장치(예를 들어, 서버 )로부터 AI 모델이 수신되면(1209-예), 1211 동작에서, 제 1 어플리케이션에 대응하는 AI 모델에 기반하여 정책을 적용할 수 있다. 전자 장치는, 제 1 AI 모델을 이용하여, 제 1 어플리케이션의 실행 화면에 대응 하는 씬 식별자를 확인할 수 있다. 전자 장치는, 확인된 씬 식별자 및 상태 정보에 기반하여, 정책을 결 정하여 적용할 수 있다. 전자 장치는, 모델 관리 장치(예를 들어, 서버)로부터 AI 모델이 수신되지 않으면(1209-아니오), 1213 동작에서, 기본 정책을 적용할 수 있다.도 13은 일 실시예에 따른 전자 장치 및 서버를 설명하기 위한 도면이다. 일 실시예에 따라서, 전자 장치는, 어플리케이션, 정책 적용 튜너, 및/또는 에이전트를 저장 및/또는 실행할 수 있다. 어플리케이션, 정책 적용 튜너, 및/또는 에이전트에 의하여 수행되는 동작들 중 적어도 일부는, 전자 장치의 프로세서에 의하여, 또는 프로세서의 제어에 따른 다른 하드웨어에 의하여 수행될 수 있다. 서버는, 프로세서, 메모리, 및/또는 통신 모듈을 포함할 수 있다. 서버는, 메타데이터 크롤러, AI 모델 생성기, 분석기를 저장 및/또는 실행할 수 있다. 메타데이터 크롤러, AI 모델 생성기, 분석기에 의하여 수행되는 동작들 중 적어도 일부는, 서버의 프로세서에 의하여, 또는 프로세서의 제어에 따른 다른 하드웨어에 의하여 수행될 수 있다. 데이터베이스은, 예를 들어 서버의 메모리에 저장될 수 있다. 일 실시예에 따라서, 정책 적용 튜너는, 전자 장치의 정책을 적용할 수 있다. 또는, 전자 장치(10 1)는, 서버로부터 정책을 수신할 수도 있으며, 수신된 정책을 적용할 수도 있다. 정책 적용 튜너는, 정책 결정에 요구되는 씬 식별자에 대응하는 기간 동안의 상태 정보를 수집, 저장 및/또는 관리 할 수 있다. 일 실시예에 따라서, 에이전트는, 전자 장치의 상태 정보를 모니터링할 수 있다. 에이전트는, 신규 설치되는 어플리케이션이 AI 모델에 기반한 정책 결정이 필요한 타입(예를 들어, 게 임)인지 여부를 확인할 수 있다. 에이전트는, 게임 관련 데이터를 서버로 송신할 수도 있다. 에이 전트는, 특정 어플리케이션에 대응하는 AI 모델이 서버에 존재하는지 문의할 수 있다. 에이전트 는, 상태 정보를 서버로 송신할 수 있다. 에이전트는, AI 모델을 이용하여, 씬 식별자를 확 인할 수 있다. 에이전트는, 씬 식별자에 기반하여, 전체 상태 정보 중 정책 결정에 이용할 상태 정보를 확인할 수 있다. 에이전트는, AI 모델을 이용하여 씬 식별자를 확인할 수 있다. AI 모델은, 이미지를 입력받아 씬 식별자를 출력할 수 있다. 상술한 바와 같이, 전자 장치는, AI 모델에서 출력되는 씬 식별자 에 기반하여 정책 결정에 이용할 상태 정보를 확인할 수 있다. 일 실시예에 따라서, 메타데이터 크롤러는, 적어도 하나의 어플리케이션 스토어에 저장된 어플리케이션의 정보, 예를 들어 지정된 타입의 어플리케이션의 정보를 크롤링할 수 있다. 예를 들어, 어플리케이션이 지정된 타입(예를 들어, 게임)인지 여부를 나타내는 정보가 크롤링될 수 있지만, 제한은 없다. 메타데이터 크롤러 는, 예를 들어 패키지 식별 정보(예를 들어, package_name)가 특정 타입(예를 들어, 게임)인지 여부의 확 인이 요청될 때, 특정 타입인지 여부를 확인하지 못할 수 있다. 이 경우, 메타데이터 크롤러는, API(IS- GAME)를 호출할 수 있다. API에 기반하여, API 게이트웨이를 통한 Lambda가 호출될 수 있다. Lambda는, 적어 도 하나의 어플리케이션 스토어에 대하여 파서(parser) 함수를 호출함으로써, 특정 패키지 식별 정보(예를 들어, package_name)가 특정 타입(예를 들어, 게임)인지 여부를 확인할 수 있다. 해당 결과는 데이터베이스 (예를 들어, DynamoDB(TB_GAMEPKG))에 저장될 수 있다. 추후, 전자 장치로부터 특정 패키지 식별 정보(예를 들어, package_name)가 특정 타입(예를 들어, 게임)인지 여부인지 확인 요청이 수신될 수 있다. 서 버는, 데이터베이스(예를 들어, DynamoDB(TB_GAMEPKG))를 참조하여, 특정 패키지 식별 정보(예를 들어, package_name)가 특정 타입(예를 들어, 게임)인지 여부를 확인하며, 확인 결과를 전자 장치로 리턴 할 수 있다. 서버는, 특정 타입인지 여부뿐만 아니라, 기본 정책(설정 기본 값으로 명명될 수 있음), 및/ 또는 AI 모델(또는, AI 모델과 연관된 정보)를 전자 장치로 제공할 수도 있다. AI 모델(또는, AI 모델과 연관된 정보)는, 예를 들어, 데이터베이스(DynamoDBTB_CLASSIFIER)를 참조하여 확인될 수도 있다. 일 실시예에 따라서, AI 모델 생성기는, 씬 식별자를 판단하기 위한 AI 모델을 생성할 수 있다. 예를 들 어, AI 모델은, 이미지를 입력받아 씬 식별자를 출력할 수 있다. 상술한 바와 같이, inference 장치는, AI 모 델에서 출력되는 씬 식별자에 기반하여 정책 결정에 이용할 상태 정보를 확인할 수 있다. AI 모델 생성기 는, 추가적인 트레이닝을 수행할 수도 있다. AI 모델 생성기에 의하여 생성된 AI 모델(또는, AI 모델과 연관된 정보)는, 데이터베이스에 저장될 수도 있다. 한편, 서버가 AI 모델을 저장하지 않은 경우에는, AI 모델 생성을 위한 어플리케이션 실행 화면을 요청할 수도 있다. 일 실시예에 따라서, 분석기는, 상태 정보 및 씬 식별자를 이용하여, 전자 장치의 정책(또는, 설정 값으로 명명될 수도 있음)을 결정할 수 있다. 예를 들어, 분석기는, AI 모델을 inference하여 씬 식별자 를 확인할 수도 있다. 분석기는, 전자 장치의 정책을 결정하여, 전자 장치로 제공할 수도 있 다. 일 실시예에 따라서, 데이터베이스에는, 게임 성능과 연관된 데이터가 저장될 수도 있다. 게임 성능과 연관된 데이터는, UUID(사용자 구분 정보), 보고 시간(reporting time), 지속 기간(duration), FPS 평균 값, FPS 중위값, FPS 변동값, 타겟 FPS 변동값, 플레이-중의 FPS 평균값, 플레이 중의 FPS 변동값, 및/또는 타겟 플 레이 중의 FPS 변동값을 포함할 수 있으나 제한은 없다. 도 14는, 일 실시예에 따른 웨어러블 전자 장치, 전자 장치, 및 서버의 동작을 설명하기 위한 도면이다. 일 실시예에 따라서, 웨어러블 전자 장치는, 전자 장치와 인터랙션할 수 있으나, 이와 같은 NSA(non-stand alone) 모드는 예시적인 것으로, 웨어러블 전자 장치는 서버와 직접 통신을 수행할 수도 있다. 웨어러블 전자 장치 및/또는 전자 장치는, 웨어러블 전자 장치를 위한 어플리케 이션(예를 들어, AR 게임일 수 있지만 제한이 없음)을 실행할 수 있다. 웨어러블 전자 장치에는, 어플리 케이션 실행 화면이 표시될 수 있다. 전자 장치 및/또는 웨어러블 전자 장치는, 웨어러블 전자 장 치에서 표시되는(또는, 전자 장치로부터 웨어러블 전자 장치로 송신되는) 이미지를, AI 모델 로 입력할 수 있다. 전자 장치 및/또는 웨어러블 전자 장치는, AI 모델로부터 출력되는 씬 식별자 를 확인할 수 있다. 전자 장치 및/또는 웨어러블 전자 장치는, 씬 식별자에 기반하여, 전체 상태 정 보 중, 정책 결정에 이용할 상태 정보를 확인할 수 있다. 일 실시예에 따라서, 전자 장치(101, 108)의 동작 방법은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포함할 수 있다. 상기 전자 장치의 동작 방법은, 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하는 동작을 포함 할 수 있다. 상기 전자 장치의 동작 방법은, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역에 대한 제 1 처 리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확 인하는 동작은, 상기 제 1 이미지에 대응하는 활성화 맵을 확인하는 동작을 포함할 수 있다. 일 실시예에 따라 서, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작은, 상 기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작은, 상기 활성 화 맵 중 특징 중요도(feature importance)가 지정된 제 1 조건을 만족하는 적어도 하나의 영역을 확인하는 동 작을 포함할 수 있다. 일 실시예에 따라서, 상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인 하는 동작은, 상기 활성화 맵의 상기 적어도 하나의 영역에 대응하는, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 활성화 맵 중 특징 중요도가 상기 지정된 제 1 조건을 만족하는 상기 적어도 하나의 영역을 확인하는 동작은, 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인할 수 있다. 일 실시예에 따라서, 상기 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 동작은, 상기 지정된 임계 특징 중요도 미만인 상기 활성화 맵의 나머지 영역을 블랭크(blank) 처리하는 동작을 포함할 수 있 다. 일 실시예에 따라서, 상기 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 동작은, 상기 블랭크 처리된 활성화 맵에 대한 적어도 하나의 윤곽선을 설정하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 동작은, 상기 적어도 하나 의 윤곽선에 기반하여 상기 화성화 맵의 상기 적어도 하나의 영역을 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 상기 AI 모델의 출력 레이어 및 상기 AI 모델의 적어도 하나의 피처 맵에 기반하여 적어도 하나의 기여도를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치 의 동작 방법은, 상기 적어도 하나의 기여도 및 상기 피처맵에 기반하여, 상기 활성화 맵의 복수 개의 특징 중 요도를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 기여도를 확인하는 동작은, 수학식 1에 의하여 수행될 수 있다. 상기 수학식 1은, 일 수 있다. 상기 활성화 맵의 상기 복수 개의 특징 중 요도를 확인하는 동작은, 수학식 2에 의하여 확인될 수 있다. 상기 수학식 2는,일 수 있다. 상기 c는 상기 AI 모델의 상기 출력 레이어의 클래스이며, 상기 k는 상기 적어도 하나의 피처 맵의 인덱스이며, 상기 z는 상기 적어도 하나의 피처 맵의 매트 릭스의 행과 열의 곱이며, 상기 i, j는 상기 매트릭스 내의 i, j번째의 엘리먼트일 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 제 1 영역을 확인하는 동작은, 상기 활성화 맵의 상기 적어도 하나의 영역이 적어도 하나의 제 2 조건을 만족함에 기반하여, 상기 적어도 하나의 영역에 대응하는 상기 제 1 이미지 의 상기 적어도 하나의 제 1 영역을 확인할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 상기 활성화 맵의 상기 적어도 하나의 영역의 크기가 지정된 임 계 크기 이상임에 기반하여 상기 적어도 하나의 제 2 조건이 만족된 것으로 판단하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 상기 활성화 맵의 상기 적어도 하나의 영역의 개수가 지정된 임 계 개수 이상임에 기반하여 상기 적어도 하나의 제 2 조건이 만족된 것으로 판단하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 상기 활성화 맵의 상기 적어도 하나의 영역 사이의 겹침 정도가 임계 겹침 정도 이하임에 기반하여 상기 적어도 하나의 제 2 조건이 만족된 것으로 판단하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치의 동작 방법은, 상기 적어도 하나의 영역이 상기 적어도 하나의 제 2 조건을 만 족하지 않음에 기반하여, 상기 적어도 하나의 영역의 적어도 일부의 형상, 크기, 및/또는 위치를 조정하는 동작 을 포함할 수 있다. 일 실시예에 따라서, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확 인하는 동작은, 상기 제 1 이미지에 대한 전처리를 수행하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상 기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작은, 상기 전 처리된 제 1 이미지 및 상기 제 1 AI 모델을 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작을 포함 할 수 있다. 일 실시예에 따라서, 상기 제 1 이미지에 대한 전처리를 수행하는 동작은, 상기 제 1 이미지의 크기를 변환하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 제 1 이미지에 대한 전처리를 수행하는 동작은, 상기 변환 된 제 1 이미지에 대한 블러링을 수행하는 동작을 포함할 수 있다. 일 실시예에 따라서, 상기 변환된 제 1 이미지에 대한 블러링을 수행하는 동작은, 상기 제 1 이미지에 포함된 적어도 하나의 텍스트의 속성에 기반하여 블러링 정도를 결정하여, 상기 결정된 블러링 정도에 기반하여 상기 블러링을 수행할 수 있다. 일 실시예에 따라서, 전자 장치(101,108)는, 메모리 및 적어도 하나의 프로세서를 포함할 수 있다. 상기 메모리는, 적어도 하나의 인스트럭션을 저장할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적 어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치(101,108)로 하여금, 제 1 씬 식별자에 대 응하는 제 1 이미지를 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프 로세서에 의하여 실행되는 경우, 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 이미지가 상기 제 1 씬 식별자로 분류되는 데 기여하는 적어도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 제 1 이미지의 상기 적 어도 하나의 제 1 영역에 대한 제 1 처리를 수행함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하 도록 야기하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부 로서, 상기 제 1 이미지에 대응하는 활성화 맵을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이용 하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서, 상기 활성화 맵에 기반하여, 상기 적 어도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서, 상기 활성화 맵 중특징 중요도(feature importance)가 지정된 제 1 조건을 만족하는 적어도 하나의 영역을 확인하도록 야기할 수 잇다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵에 기반하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서, 상기 활성화 맵의 상기 적어도 하나의 영역에 대응하는, 상기 제 1 이미지의 상기 적어도 하나의 제 1 영역을 확인하도록 야 기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵 중 특징 중요도가 상기 지정된 제 1 조건을 만족하는 상기 적어도 하나의 영역을 확인하는 동작의 적 어도 일부로서, 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 지정된 임계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 동작의 적어도 일부로서, 상기 지정된 임 계 특징 중요도 미만인 상기 활성화 맵의 나머지 영역을 블랭크(blank) 처리하도록 야기할 수 있다. 일 실시예 에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 지정된 임 계 특징 중요도 이상인 상기 적어도 하나의 영역을 확인하는 동작의 적어도 일부로서, 상기 블랭크 처리된 활성 화 맵에 대한 적어도 하나의 윤곽선을 설정하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 지정된 임계 특징 중요도 이상인 상기 적어 도 하나의 영역을 확인하는 동작의 적어도 일부로서, 상기 적어도 하나의 윤곽선에 기반하여 상기 화성화 맵의 상기 적어도 하나의 영역을 확인하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 AI 모델의 출력 레이어 및 상기 AI 모델의 적어도 하나의 피처 맵에 기반하여 적어도 하나의 기여도를 확인하도 록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치 (101,108)로 하여금, 상기 적어도 하나의 기여도 및 상기 피처맵에 기반하여, 상기 활성화 맵의 복수 개의 특징 중요도를 확인하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 기여도를 확인하는 동작은, 수학식 1에 의하여 수행될 수 있다. 상기 수학식 1은, 일 수 있다. 상기 활성화 맵의 상기 복수 개의 특징 중 요도를 확인하는 동작은, 수학식 2에 의하여 확인될 수 있다. 상기 수학식 2는, 일 수 있다. 상기 c는 상기 AI 모델의 상기 출력 레이어의 클래스이며, 상기 k는 상기 적어도 하나의 피처 맵의 인덱스이며, 상기 z는 상기 적어도 하나의 피처 맵의 매트 릭스의 행과 열의 곱이며, 상기 i, j는 상기 매트릭스 내의 i, j번째의 엘리먼트일 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서, 상기 활성화 맵의 상기 적어도 하나의 영역이 적 어도 하나의 제 2 조건을 만족함에 기반하여, 상기 적어도 하나의 영역에 대응하는 상기 제 1 이미지의 상기 적 어도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵의 상기 적어도 하나의 영역의 크기가 지정된 임계 크기 이상임에 기반하여 상기 적어도 하나의 제 2 조건이 만족된 것으로 판단하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵의 상기 적어도 하나의 영역의 개수가 지정된 임계 개수 이상임에 기반하여 상기 적어도 하나의 제 2 조건이 만족된 것으로 판단하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵의 상기 적어도 하나의 영역 사이의 겹침 정도가 임계 겹침 정도 이하임에 기반하여 상기 적어도 하나 의 제 2 조건이 만족된 것으로 판단하도록 야기할 수 있다.일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 적어도 하나의 영역이 상기 적어도 하나의 제 2 조건을 만족하지 않음에 기반하여, 상기 적어도 하나의 영역의 적어도 일부의 형상, 크기, 및/또는 위치를 조정하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부 로서, 상기 제 1 이미지에 대한 전처리를 수행하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나 의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 제 1 AI 모델 및 상기 제 1 이미지를 이 용하여, 상기 적어도 하나의 제 1 영역을 확인하는 동작의 적어도 일부로서, 상기 전처리된 제 1 이미지 및 상 기 제 1 AI 모델을 이용하여, 상기 적어도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 제 1 이미지에 대한 전처리를 수행하는 동작의 적어도 일부로서, 상기 제 1 이미지의 크기를 변환하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여 금, 상기 제 1 이미지에 대한 전처리를 수행하는 동작의 적어도 일부로서, 상기 변환된 제 1 이미지에 대한 블 러링을 수행하도록 야기할 수 있다. 일 실시예에 따라서, 상기 적어도 하나의 인스트럭션은, 실행 시에, 상기 전자 장치(101,108)로 하여금, 상기 변환된 제 1 이미지에 대한 블러링을 수행하는 동작의 적어도 일부로서, 상기 제 1 이미지에 포함된 적어도 하 나의 텍스트의 속성에 기반하여 블러링 정도를 결정하여, 상기 결정된 블러링 정도에 기반하여 상기 블러링을 수행하도록 야기할 수 있다. 일 실시예에 따라서, 전자 장치(101, 108)의 동작 방법은, 제 1 씬 식별자에 대응하는 제 1 이미지를 확인하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은, 컨볼루션 뉴럴 네트워크 기반의 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하는 활성화 맵을 확인하 는 동작을 포함할 수 있다. 전자 장치의 동작 방법은, 상기 활성화 맵의 상기 특징 중요도가 지정된 조건을 만 족하는 적어도 하나의 제 1 영역을 확인하는 동작을 포함할 수 있다. 전자 장치의 동작 방법은, 상기 적어도 하 나의 제 1 영역에 대응하는 상기 제 1 이미지의 영역을 블랙 처리함으로써, 상기 제 1 AI 모델을 위한 트레이닝 데이터를 확인하는 동작을 포함할 수 있다. 일 실시예에 따라서, 전자 장치(101,108)는, 메모리 및 적어도 하나의 프로세서를 포함할 수 있다. 상기 메모리는, 적어도 하나의 인스트럭션을 저장할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적 어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치(101,108)로 하여금, 제 1 씬 식별자에 대 응하는 제 1 이미지를 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프 로세서에 의하여 실행되는 경우, 상기 전자 장치(101,108)로 하여금, 컨볼루션 뉴럴 네트워크 기반의 제 1 AI 모델 및 상기 제 1 이미지를 이용하여, 상기 제 1 AI 모델에 대한 역전파에 기반하여 특징 중요도를 포함하 는 활성화 맵을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서 에 의하여 실행되는 경우, 상기 전자 장치(101,108)로 하여금, 상기 활성화 맵의 상기 특징 중요도가 지정 된 조건을 만족하는 적어도 하나의 제 1 영역을 확인하도록 야기할 수 있다. 상기 적어도 하나의 인스트럭션은, 상기 적어도 하나의 프로세서에 의하여 실행되는 경우, 상기 전자 장치(101,108)로 하여금, 상기 적어도 하나의 제 1 영역에 대응하는 상기 제 1 이미지의 영역을 블랙 처리함으로써, 상기 제 1 AI 모델을 위한 트레이 닝 데이터를 확인하도록 야기할 수 있다. 본 문서에 개시된 일 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는 다. 본 문서의 일 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정하 려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면 의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개 를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또 는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해 당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 일 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모 듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 일 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium) (예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프 로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저 장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것 은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드 를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포 함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으 로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 일 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 일 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수 의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 일 실시예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프 로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 일 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면3d 도면3e 도면3f 도면4a 도면4b 도면5 도면6a 도면6b 도면6c 도면7a 도면7b 도면7c 도면8a 도면8b 도면8c 도면9 도면10a 도면10b 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2023-0019628", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 일 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 실시예와의 비교를 위한 비교예에 따른 전자 장치의 동작 방법을 설명하기 위한 도면이다. 도 3a는, 플레잉-중(in-play)의 씬 및 플레잉 아님의 씬 동안 관찰되는 FPS 및 온도를 도시한다. 도 3b는, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 FPS 평균값 및 플레잉 중의 씬만을 고려한 경우의 FPS 평균값을 도시한다. 한편, 도 3c는, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 FPS 변동값 및 플레잉 중의 씬만을 고려한 경우의 FPS 변동값을 도시한다. 도 3d는, 플레잉 중의 씬 및 플레잉 아님의 씬을 모두 고려한 경우의 온도 평균값 및 플레잉 중의 씬만을 고려 한 경우의 온도 평균값을 도시한다. 도 3e 및 3f는 상이한 전자 장치 타입별 AI 정확도를 도시할 수 있다. 도 4a는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 4b는, 일 실시예에 따른 정책 결정을 설명하기 위한 도면이다. 도 5는 일 실시예에 따른 AI 모델의 트레이닝 방법을 설명하기 위한 흐름도이다. 도 6a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 6b는, 일 실시예에 따른 트레이닝 데이터의 생성을 설명하기 위한 도면이다. 도 6c는 일 실시예에 따른 블랙 처리에 따른 트레이닝 데이터의 생성을 설명하기 위한 도면이다. 도 7a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 7b 및 도 7c는, 다양한 실시예들에 따른 AI 모델의 구조를 설명하기 위한 도면이다. 도 8a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 8b는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 8c는 일 실시예에 따른 트레이닝 데이터의 지정된 조건의 만족 여부 판단을 설명하기 위한 도면이다. 도 9는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 10a는 일 실시예에 따른 트레이너의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 10b는, 일 실시예에 따른 가우시안 필터의 적용을 설명하기 위한 도면이다. 도 11은 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다. 도 12는 일 실시예에 따른 전자 장치의 동작 방법을 설명하기 위한 흐름도를 도시한다.도 13은 일 실시예에 따른 전자 장치 및 서버를 설명하기 위한 도면이다. 도 14는, 일 실시예에 따른 웨어러블 전자 장치, 전자 장치, 및 서버의 동작을 설명하기 위한 도면이다."}
