{"patent_id": "10-2023-0041877", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0147809", "출원번호": "10-2023-0041877", "발명의 명칭": "금속 3D 프린터의 분말 평탄도 검사 방법 및 이를 위한 장치", "출원인": "주식회사 이즈랩", "발명자": "정지훈"}}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "금속 3D 프린터의 분말 평탄도 검사 방법에 있어서,상기 금속 3D 프린터의 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사하는 단계;상기 분말층을 상부 카메라로 촬영하여 모아레(moire) 이미지를 획득하는 단계;상기 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비교한 비교 결과 및 상기 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 상기 분말층의 평탄도를 추정하는 단계; 및상기 추정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 금속 3D 프린터의 작동을 중단하거나사용자에게 알림을 제공하는 단계;를 포함하는 분말 평탄도 검사 방법."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 추정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 분말층의 형성 및 평탄화 작업을 수행하는 블레이드를 하부 카메라로 촬영하여 상기 블레이드의 손상 여부를 판단하는 단계;를 더 포함하는 것을특징으로 하는 분말 평탄도 검사 방법."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 블레이드가 손상되었다고 판단되면, 상기 블레이드의 손상된 부위를 상기 추정된 상기 분말층의 비평탄 영역의 위치와 비교하여 상기 분말층의 평탄도와의 상관도를 분석하는 단계; 및상기 분석된 상관도에 따라 상기 블레이드의 교체 필요 여부에 대한 알림을 상기 사용자에게 제공하는 단계;를더 포함하는 것을 특징으로 하는 분말 평탄도 검사 방법."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 블레이드가 손상되지 않았다고 판단되면, 상기 블레이드의 하부 카메라에 의한 촬영 이미지에 기초하여 상기 블레이드의 기울기 이상 여부를 검출하는 단계;를 더 포함하는 것을 특징으로 하는 분말 평탄도 검사 방법."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 블레이드의 기울기 이상 여부를 검출하는 단계는,상기 블레이드에 표시된 복수의 얼라인(align) 마크를 인식하고, 상기 인식된 얼라인 마크의 정렬오차가 기 설정된 임계치를 초과하면 상기 블레이드의 기울기에 이상이 있다고 판단하고, 상기 블레이드의 기울기 이상에 대한 알림을 상기 사용자에게 제공하는 것을 특징으로 하는 분말 평탄도 검사 방법."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 분말층의 평탄도를 추정하는 단계는,복수의 모아레 이미지 및 평탄도 데이터가 학습된 인공지능 신경망 모델에 기반하여, 상기 획득된 모아레 이미지로부터 상기 분말층의 평탄도를 추정하는 것을 특징으로 하는 분말 평탄도 검사 방법.공개특허 10-2024-0147809-3-청구항 7 금속 3D 프린터에 있어서,분말층이 형성되는 챔버;상기 분말층의 형성 및 평탄화 작업을 수행하는 블레이드;상기 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사하는 광 조사부;상기 분말층을 촬영하여 모아레(moire) 이미지를 획득하는 상부 카메라;사용자에게 알림을 제공하는 알림부; 및상기 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비교한 비교 결과 및 상기 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 상기 분말층의 평탄도를 추정하고, 상기 추정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 금속 3D 프린터의 작동을 중단하거나 상기 알림부를 통해 상기 사용자에게 알림을 제공하도록 제어하는 프로세서;를 포함하는 금속 3D 프린터."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 블레이드를 촬영하는 하부 카메라;를 더 포함하고,상기 프로세서는,상기 추정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 하부 카메라에 의해 획득된 상기 블레이드의 촬영 이미지에 기초하여 상기 블레이드의 손상 여부를 판단하는 것을 특징으로 하는 금속 3D 프린터."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는,상기 블레이드가 손상되었다고 판단되면, 상기 블레이드의 손상된 부위를 상기 추정된 상기 분말층의 비평탄 영역의 위치와 비교하여 상기 분말층의 평탄도와의 상관도를 분석하고, 상기 분석된 상관도에 따라 상기 블레이드의 교체 필요 여부에 대한 알림을 상기 사용자에게 제공하도록 상기 알림부를 제어하는 것을 특징으로 하는 금속 3D 프린터."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 프로세서는,상기 블레이드가 손상되지 않았다고 판단되면, 상기 블레이드의 촬영 이미지에 기초하여 상기 블레이드의 기울기 이상 여부를 검출하는 것을 특징으로 하는 금속 3D 프린터."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 프로세서는,상기 블레이드의 촬영 이미지로부터 상기 블레이드에 표시된 복수의 얼라인(align) 마크를 인식하고, 상기 인식된 얼라인 마크의 정렬오차가 기 설정된 임계치를 초과하면 상기 블레이드의 기울기에 이상이 있다고 판단하고,상기 블레이드의 기울기 이상에 대한 알림을 상기 사용자에게 제공하도록 상기 알림부를 제어하는 것을 특징으로 하는 금속 3D 프린터."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,공개특허 10-2024-0147809-4-상기 프로세서는,복수의 모아레 이미지 및 평탄도 데이터가 학습된 인공지능 신경망 모델에 기반하여, 상기 획득된 모아레 이미지로부터 상기 분말층의 평탄도를 추정하는 것을 특징으로 하는 금속 3D 프린터."}
{"patent_id": "10-2023-0041877", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항 내지 제6항 중 어느 한 항의 분말 평탄도 검사 방법을 실행시키는 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "금속 3D 프린터의 분말 평탄도 검사 방법이 개시된다. 본 발명의 분말 평탄도 검사 방법은 금속 3D 프린터의 챔 버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사하는 단계, 분말층을 상부 카메라로 촬 영하여 모아레(moire) 이미지를 획득하는 단계, 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비 교한 비교 결과 및 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 분말층의 평탄도를 추정하는 단계 및, 추정된 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 금속 3D 프린터의 작동을 중단하거나 사용자에게 알림을 제공하는 단계를 포함한다."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 분말 평탄도 검사 방법에 관한 것으로, 더욱 상세하게는 금속 3D 프린터의 분말 평탄도 검사 방법 및 이를 위한 장치에 관한 것이다."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "금속을 이용한 3D 프린팅 기술 중 파우더 베드 용융(Powder Bed Fusion) 방식은 일정한 두께의 금속 분말층이 형성되도록 금속 분말을 도포한 상태에서 특정 위치에 레이저 등을 이용한 열원을 조사하여 금속 분말을 용해 및 응고하여 2차원 부품을 제조하는 작업을 반복적으로 수행하여 3차원의 물건을 제조하는 방식이다. 파우더 베드 용융 방식의 금속 3D 프린터는 균일한 두께의 금속 분말을 경화된 레이어 상에 적층하기 위해, 일 정량의 금속 분말을 밀어가면서 소량의 금속분말을 경화된 레이어 상에 도포하고 적층시켜 다음 레이어를 형성 하는 기능을 수행한다. 이와 같은 작업을 위해, 금속 3D 프린터는 금속 분말 입자의 밀도가 각 부위에서 균일하도록 금속 분말을 도포 하여 레이어를 형성하는 것이 필요하다. 현재는 블레이드가 챔버 내에서 직선 왕복 운동을 수행하면서 분말층을 형성하고 평탄화 작업을 수행하는 역할 을 하는데, 블레이드는 쉽게 마모되거나 파손되어 손상되는 재질을 가지는 소모품으로서, 손상 시 오히려 분말 층의 불균일성을 증가시켜 제조되는 3차원 물건의 형상을 왜곡시키게 되므로 주기적인 교체가 필요하다. 그러나, 금속 3D 프린터의 사용자가 블레이드의 손상 여부를 육안으로 판단하는 것은 쉽지 않아, 블레이드의 교 체 시기를 판단하기 쉽지 않다는 문제가 있다."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제를 해결하기 위한 것으로, 본 발명의 목적은 금속 3D 프린터의 분말 평탄도를 보다 효율 적으로 검사함으로써 블레이드의 교체 여부에 대한 판단을 빠르게 수행할 수 있도록 하는 금속 3D 프린터의 분 말 평탄도 검사 방법 및 이를 위한 장치를 제공하는 데에 있다."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 일 실시 예에 따른 금속 3D 프린터의 분말 평탄도 검사 방법은 금속 3D 프린터의 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사하는 단계, 상기 분말층을 상부 카메라로 촬영하여 모아레(moire) 이미지를 획득하는 단계, 상기 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비교한 비교 결과 및 상기 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 상 기 분말층의 평탄도를 추정하는 단계 및, 상기 추정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 금속 3D 프린터의 작동을 중단하거나 사용자에게 알림을 제공하는 단계를 포함한다. 이때, 상기 분말 평탄도 검사 방법은 상기 추정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 분말층의 형성 및 평탄화 작업을 수행하는 블레이드를 하부 카메라로 촬영하여 상기 블레이드의 손상 여부를 판 단하는 단계를 더 포함할 수 있다. 또한, 상기 분말 평탄도 검사 방법은 상기 블레이드가 손상되었다고 판단되면, 상기 블레이드의 손상된 부위를 상기 추정된 상기 분말층의 비평탄 영역의 위치와 비교하여 상기 분말층의 평탄도와의 상관도를 분석하는 단계및, 상기 분석된 상관도에 따라 상기 블레이드의 교체 필요 여부에 대한 알림을 상기 사용자에게 제공하는 단계 를 더 포함할 수 있다. 또한, 상기 분말 평탄도 검사 방법은 상기 블레이드가 손상되지 않았다고 판단되면, 상기 블레이드의 하부 카메 라에 의한 촬영 이미지에 기초하여 상기 블레이드의 기울기 이상 여부를 검출하는 단계를 더 포함할 수 있다. 또한, 상기 블레이드의 기울기 이상 여부를 검출하는 단계는 상기 블레이드에 표시된 복수의 얼라인(align) 마 크를 인식하고, 상기 인식된 얼라인 마크의 정렬오차가 기 설정된 임계치를 초과하면 상기 블레이드의 기울기에 이상이 있다고 판단하고, 상기 블레이드의 기울기 이상에 대한 알림을 상기 사용자에게 제공할 수 있다. 또한, 상기 분말층의 평탄도를 추정하는 단계는 복수의 모아레 이미지 및 평탄도 데이터가 학습된 인공지능 신 경망 모델에 기반하여, 상기 획득된 모아레 이미지로부터 상기 분말층의 평탄도를 추정할 수 있다. 한편, 본 발명의 일 실시 예에 따른 금속 3D 프린터는 분말층이 형성되는 챔버, 상기 분말층의 형성 및 평탄화 작업을 수행하는 블레이드, 상기 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사하 는 광 조사부, 상기 분말층을 촬영하여 모아레(moire) 이미지를 획득하는 상부 카메라, 사용자에게 알림을 제공 하는 알림부 및, 상기 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비교한 비교 결과 및 상기 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 상기 분말층의 평탄도를 추정하고, 상기 추정된 상 기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 금속 3D 프린터의 작동을 중단하거나 상기 알림부를 통해 상기 사용자에게 알림을 제공하도록 제어하는 프로세서를 포함한다. 이때, 상기 금속 3D 프린터는 상기 블레이드를 촬영하는 하부 카메라를 더 포함하고, 상기 프로세서는 상기 추 정된 상기 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 상기 하부 카메라에 의해 획득된 상기 블레이드의 촬영 이미지에 기초하여 상기 블레이드의 손상 여부를 판단할 수 있다. 또한, 상기 프로세서는 상기 블레이드가 손상되었다고 판단되면, 상기 블레이드의 손상된 부위를 상기 추정된 상기 분말층의 비평탄 영역의 위치와 비교하여 상기 분말층의 평탄도와의 상관도를 분석하고, 상기 분석된 상관 도에 따라 상기 블레이드의 교체 필요 여부에 대한 알림을 상기 사용자에게 제공하도록 상기 알림부를 제어할 수 있다. 또한, 상기 프로세서는 상기 블레이드가 손상되지 않았다고 판단되면, 상기 블레이드의 촬영 이미지에 기초하여 상기 블레이드의 기울기 이상 여부를 검출할 수 있다. 또한, 상기 프로세서는 상기 블레이드의 촬영 이미지로부터 상기 블레이드에 표시된 복수의 얼라인(align) 마크 를 인식하고, 상기 인식된 얼라인 마크의 정렬오차가 기 설정된 임계치를 초과하면 상기 블레이드의 기울기에 이상이 있다고 판단하고, 상기 블레이드의 기울기 이상에 대한 알림을 상기 사용자에게 제공하도록 상기 알림부 를 제어할 수 있다. 또한, 상기 프로세서는 복수의 모아레 이미지 및 평탄도 데이터가 학습된 인공지능 신경망 모델에 기반하여, 상 기 획득된 모아레 이미지로부터 상기 분말층의 평탄도를 추정할 수 있다."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 발명의 다양한 실시 예에 따르면, 금속 3D 프린터의 사용자가 블레이드의 손상 여부를 쉽게 파 악하고, 블레이드의 교체 여부에 대한 판단을 빠르게 수행할 수 있도록 함으로써, 금속 3D 프린터로부터 제조되 는 3차원 물건의 높은 퀄리티를 지속적으로 유지할 수 있도록 할 수 있다."}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 발명의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당 분야에 종사하는 기술자의 의도나 법률적 또는 기술적 해 석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어일 수 있 다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조 번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명하도록 한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성 요소를 모두 도시 하고 있다고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 '제1', '제2' 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성 요소들을 서로 구별하기 위하여 사용하는 것이며, 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안될 것이다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한 해석되어서는 안된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다름을 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, '포함하다' 또는 '구성하다' 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구 성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한 다. 또한, 본 발명의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한 어떤 부분이 어떤 구성 요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있다 는 것을 의미한다. 이하, 첨부된 도면을 참조하여 본 발명을 더욱 구체적으로 설명하기로 한다. 도 1은 본 발명의 일 실시 예에 따른 금속 3D 프린터 장치의 구성을 간략히 나타낸 블록도이다. 본 발명의 금속 3D 프린터 장치는 광 조사부, 상부 카메라, 알림부, 하부 카메라 및 프로세서를 포함한다. 광 조사부는 미리 결정된 패턴을 갖는 패턴 이미지를 광선으로 변환하여 조사하는 구성이다. 예를 들어, 도 2에 도시된 바와 같이 광 조사부는 프로젝터(projector)에 입력된 패턴 이미지를 광선으로 변환하여 금속 3D 프린터 장치의 챔버 내부에 형성된 분말층의 표면에 조사할 수 있다. 이와 같이 패턴 이미지를 광선 형태로 변환하는 방법을 이용함으로써, 다양한 형상 및 선 간격을 가지는 광선을 조사할 수 있다. 일 예로, 패턴 이미지는 일정한 간격을 가지는 복수 개의 선으로 이루어진 패턴을 가질 수 있다. 또는 패턴 이미지는 격자 형상일 수 있다. 즉, 패턴 이미지는 서로 교차하는 복수 개의 선들로 이루어지며, 선 들의 교차점에서 만들어지는 점, 및 교차하는 선들로 둘러싸인 정사각형 또는 직사각형 형태의 면(즉, 격자의 셀(cell))을 포함하는 패턴을 가질 수 있다. 또한, 패턴 이미지는 복수 개의 점 및/또는 복수 개의 선을 포함하는 다른 상이한 형상일 수도 있다. 예를 들어, 패턴 이미지는 하나 이상의 원, 타원 등의 폐곡선, 또는 하나 이상의 다각형을 포함하는 형상일 수 있다. 또한, 패턴 이미지는 복수 개의 동심원 또는 중심이 동일하며 크기가 상이한 복수 개의 다각형을 포함하는 형상 일 수도 있다. 이와 같은 패턴 이미지가 변환된 광선이 조사되는 분말층은 블레이드에서 분사된 금속 분말이 겹겹이 레이어를 형성한 구조를 가진다.분말이 금속 분말인 경우, 분말은 철(Fe), 니켈(Ni), 크롬(Cr), 코발트(Co), 티타늄(Ti), 알루미늄(Al), 구리 (Cu), 금(Au), 은(Ag), 백금(Pt), 팔라듐(Pd), 몰리브덴(Mo), 마그네슘(Mg), 아연(Zn), 납(Pb), 주석(Sn), 베 릴륨(Be) 및 텅스텐(W)으로 이루어진 군에서 선택되는 어느 하나의 금속으로 이루어진 분말이거나 둘 이상의 금 속으로 이루어진 합금의 분말일 수 있다. 본 발명의 설명에서는, 분말이 한정된 종류의 금속 또는 합금으로 이루어진다고 설명하고 있으나, 반드시 이에 한정되는 것은 아니고, 다양한 금속 또는 합금으로 이루어질 수 있다. 상부 카메라는 챔버 내부의 공간 중 상부에 위치하여 하부를 바라보도록 배치되며, 광선이 조사되는 분말층을 촬영하여 모아레(moire) 이미지를 획득하는 구성이다. 상부 카메라는 렌즈를 통해 들어온 빛을 전기적/디지털 신호로 변환해주는 이미지 센서를 포함할 수 있다. 여기서, 모아레 이미지는 이미지 센서의 샘플링 주파수 성분과 촬영 대상의 주파수 성분으로 발생하는 간섭 현 상인 모아레(moire) 현상이 발생한 이미지를 의미한다. 이를 위해, 광 조사부에서 조사되는 광선이 가지는 패턴 이미지는 모아레 현상이 발생할 수 있도록 조밀한 패턴을 가지도록 설정될 수 있다. 알림부는 사용자에게 다양한 정보를 포함하는 알림을 제공하는 구성이며, 디스플레이, LED 모듈, 스피커 또는 통신 모듈 등으로 구현될 수 있다. 알림부가 디스플레이로 구현되는 경우, 디스플레이는 프로세서의 제어에 따라 사용자에게 필요한 각 종 정보를 표시할 수 있다. 디스플레이는 LCD(Liquid Crystal Display Panel), OLED(Organic Light Emitting Diodes), 투명 디스플레이 (Transparent Display) 및 플렉서블 디스플레이(Flexible Display) 등으로 구현될 수 있으나, 이에 한정되는 것은 아니다. 또한, 디스플레이 내에는 a-si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 또한, 알림부가 통신 모듈로 구현되는 경우, 통신 모듈은 이동통신을 위한 기술표준들 또는 통신방식(예를 들어, GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EVDO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등)에 따라 구축된 이동 통신망 상 에서 기지국, 금속 3D 프린터의 제어를 위한 사용자 단말 등 외부의 단말과 무선 신호를 송수신할 수 있다. 또한, 통신 모듈은 무선 인터넷 기술, 예를 들어, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi- Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등의 무선 인터넷 기술에 따라 사용자 단말 등과 데이터를 송수신할 수 있다. 하부 카메라는 분말층의 형성 및 평탄화 작업을 수행하는 블레이드를 촬영하기 위한 구성이다. 이 를 위해, 하부 카메라는 도 4에 도시된 바와 같이 챔버 내부의 공간 중 하부에 위치하여 상부를 바라 보도록 배치될 수 있다. 프로세서는 금속 3D 프린터의 전반적인 동작을 제어하기 위한 구성이다. 구체적으로, 프로세서는 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조 사하도록 광 조사부를 제어하고, 분말층을 촬영하여 모아레(moire) 이미지를 획득하도록 상부 카메라 를 제어할 수 있다. 또한, 프로세서는 모아레 이미지가 획득되면, 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지 와 비교한 비교 결과 및 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 분말층의 평탄도를 추정할 수 있다. 도 3의 (a)는 기준 모아레 이미지, (b)는 상부 카메라에 의해 획득된 모아레 이미지를 나타낸 것이다. 도 3에 도시된 바와 같이, 광 조사부에서 조사되는 광의 패턴 이미지는 일정 간격을 가지는 복수의 선이 배치되는 형태를 가질 수 있다. 본 발명의 일 실시 예에 따른 기준 모아레 이미지는 도 3의 (a)에 도시된 바와 같이, 패턴 원본 이미지 혹은 패 턴 이미지가 왜곡되지 않은 모아레 이미지로, 분말층이 균일하게 평평하게 도포된 상태에서 광이 조사된 상 황을 가정하여 상부 카메라에 의해 획득된 모아레 이미지를 나타낸 것이다. 또한, 본 발명의 다른 실시 예에 따른 기준 모아레 이미지는 기 수집된 특정 평탄도 데이터 별로 대응되는 적어 도 하나의 모아레 이미지일 수 있다. 구체적으로, 프로세서는 상부 카메라를 통해 획득된 모아레 이미지를 기준 모아레 이미지와 비교하여 분말층 표면의 비균일 영역의 위치 및 형상을 예측할 수 있는 평탄도를 산출할 수 있다. 이때, 프로세서는 복수의 모아레 이미지 및 그에 대응되는 평탄도 데이터가 학습된 인공지능(artificial intelligence, AI) 신경망 모델에 기반하여, 상부 카메라를 통해 획득된 모아레 이미지로부터 분말층 표면의 평탄도를 추정할 수 있다. 예를 들어, 복수의 모아레 이미지 및 그에 대응되는 평탄도 데이터의 학습 및 분류는 CNN(Convolutional Neural Network) 모델에 기반할 수 있다. 구체적으로, 프로세서는 외부 서버 등으로부터 수집된 복수의 모아레 이미지로부터 복수의 특징 벡터들을 추출하고, CNN 모델을 기반으로 모아레 이미지의 평탄도와 관련된 데이터의 분류 및 평탄도 데이터 기반의 학습 을 수행할 수 있다. 한편, 본 발명의 일 실시 예에 따르면, 프로세서는 추정된 분말층의 평탄도가 기 설정된 임계치 미만 인 경우, 하부 카메라에 의해 획득된 블레이드의 촬영 이미지에 기초하여, 블레이드의 손상 여부 를 판단할 수 있다. 즉, 프로세서는 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 블레이드에 그 원인이 있다는 가정 하에 블레이드에 이상이 있는지 여부를 검사하게 된다. 블레이드는 도 4에 도시된 바와 같이 금속 3D 프린터의 챔버에 내 프레임과 결합되어 직선 왕복 운동 가능하게 구비되는 본체부과, 본체부의 하단에 결합되어 분말층 표면을 균일화하는 평탄화부 를 포함하여 구성될 수 있다. 평탄화부는 본체부 하단에서 수직으로 결합되어 분말층 표면을 평탄화하기 위해 내측 하방 경사면 을 구비할 수 있다. 평탄화부의 단면은 내측 하방 경사면을 구비한 역삼각형 형태를 가질 수 있다. 프로세서는 블레이드가 직선 왕복 운동하면서 하부 카메라의 촬영 영역 내에 진입한 경우, 블레 이드를 인식하고, 인식된 블레이드를 촬영하도록 하부 카메라를 제어할 수 있다. 프로세서는 하부 카메라를 통해 촬영된 블레이드의 촬영 이미지를 분석하여 평탄화부가 마모, 손상되었는지 여부 또는 이물질이 부착되었는지 여부 등을 판단할 수 있다. 예를 들어, 프로세서는 블레이드의 촬영 이미지에서 경계선을 인식하고, 인식된 경계선의 내부에서 화 소 값을 비교하고, 그 차이 값에 따라 평탄화부가 마모, 손상되었는지 여부 또는 이물질이 부착되었는지 여 부 등을 판단할 수 있다. 또한, 프로세서는 블레이드의 촬영 이미지와 기 저장된 블레이드 이미지를 비교하고, 그 비교 결과에 따라 평탄화부가 마모, 손상되었는지 여부 또는 이물질이 부착되었는지 여부 등을 판단할 수도 있다. 프로세서는 블레이드가 손상되었다고 판단되면, 블레이드의 손상된 부위를 추정된 분말층의 비평탄 영역의 위치와 비교하여 분말층의 평탄도와의 상관도를 분석할 수 있다. 프로세서는 분석된 상관도에 따라 블레이드의 교체 필요 여부에 대한 알림을 사용자에게 제공하도록 알림부를 제어할 수 있다. 구체적으로, 프로세서는 하부 카메라를 통해 검출된 블레이드의 손상 부위와 상부 카메라를 통해 검출된 분말층의 비평탄 영역의 위치를 비교하여, 그 비교 결과에 따라 블레이드의 손상 부위에 의해 비평탄 영역이 발생되었는지 여부를 판단하는 상관도 분석을 수행할 수 있다. 프로세서는 상관도가 있다고 판단되는 경우, 블레이드의 교체가 필요하다는 알림을, 상관도가 없다고 판단되는 경우, 블레이드가 손상되었다는 단순 알림을 사용자에게 제공하도록 알림부를 제어할 수 있 다. 한편, 프로세서는 블레이드가 손상되지 않았다고 판단되면, 하부 카메라에 의해 획득된 블레이드 의 촬영 이미지에 기초하여 블레이드의 기울기 이상 여부를 검출할 수 있다. 이때, 프로세서는 블레이드의 촬영 이미지로부터 블레이드의 일부에 표시된 복수의 얼라인(align) 마크를 인식할 수 있다. 프로세서는 인식된 얼라인 마크의 정렬오차가 기 설정된 임계치를 초과하는 경우 블레이드의 기울기에 이상이 있다고 판단할 수 있다. 이 경우, 프로세서는 블레이드의 기울기 이상에 대한 알림을 사용자에게 제공하도록 알림부를 제 어할 수 있다. 도 5는 본 발명의 일 실시 예에 따른 금속 3D 프린터 장치의 제어 방법을 간략히 설명하기 위한 흐름도이다. 먼저, 금속 3D 프린터의 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사한다(S510). 이후, 분말층을 상부 카메라로 촬영하여 모아레 이미지를 획득한다(S520). 이후, 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비교한 비교 결과 및 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 분말층의 평탄도를 추정한다(S530). 이때, 복수의 모아레 이미지 및 평탄도 데이터가 학습된 인공지능 신경망 모델에 기반하여, 획득된 모아레 이미 지로부터 분말층의 평탄도를 추정할 수 있다. 이후, 추정된 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 금속 3D 프린터의 작동을 중단하거나 사용자에 게 알림을 제공한다(S540). 이때, 분말층의 형성 및 평탄화 작업을 수행하는 블레이드를 하부 카메라로 촬영하여 블레이드의 손상 여부를 판단할 수 있다. 이때, 블레이드가 손상되었다고 판단되면, 블레이드의 손상된 부위를 추정된 분말층의 비평탄 영역의 위치와 비 교하여 분말층의 평탄도의 상관도를 분석하고, 분석된 상관도에 따라 블레이드의 교체 필요 여부에 대한 알림을 사용자에게 제공할 수 있다. 블레이드가 손상되지 않았다고 판단되면, 블레이드의 하부 카메라에 의한 촬영 이미지에 기초하여 블레이드의 기울기 이상 여부를 검출할 수 있다. 구체적으로, 블레이드에 표시된 복수의 얼라인(align) 마크를 인식하고, 인식된 얼라인 마크의 정렬오차가 기 설정된 임계치를 초과하면 블레이드의 기울기에 이상이 있다고 판단하며, 블레이드의 기울기 이상에 대한 알림 을 사용자에게 제공할 수 있다. 한편, 도 6은 본 발명의 다른 실시 예에 따른 금속 3D 프린터 장치의 제어 방법을 간략히 설명하기 위한 흐름도 이다. 먼저, 금속 3D 프린터의 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사한 후, 촬영 하여 분말층 표면의 모아레 이미지를 획득한다(S605). 이후, 획득된 모아레 이미지를 적어도 하나의 기준 모아레 이미지와 비교하여 분말층 표면의 평탄도를 측정한다 (S610). 측정된 평탄도가 기 설정된 임계치 미만인 불량이라고 판단되는 경우(S615:예), 금속 3D 프린터의 작동을 중단 하거나, 사용자에게 알림을 제공할 수 있다(S620). 이때, 사용자에게 제공되는 알림은 평탄도가 불량이라는 정 보 내지는 금속 3D 프린터의 작동을 중단할 것을 권하는 알림 정보를 포함할 수 있다. 측정된 평탄도가 기 설정된 임계치 이상이어서 불량이 아닌 정상이라고 판단되는 경우(S615:아니오), 금속 3D 프린터의 이후 프린트 동작을 계속적으로 진행할 수 있다. 작동 중단 또는 알림이 제공된 후에는 블레이드를 촬영하여 블레이드의 촬영 이미지를 획득할 수 있다(S625). 블레이드의 촬영 이미지로부터 블레이드가 손상되었다고 판단되는 경우(S630:예), 손상부위와 평탄도의 상관성 여부를 판단한다(S635).손상부위와 평탄도의 상관성이 있다고 판단되는 경우에는(S635:예), 사용자에게 블레이드의 교체가 필요하다는 알림을 제공할 수 있다(S640). 이때, 금속 3D 프린터의 작동이 중단되지 않은 상태라면 작동이 중단될 수 있다. 한편, 블레이드의 촬영 이미지로부터 블레이드가 손상되지 않았다고 판단되는 경우(S630:아니오)나, 손상부위와 평탄도의 상관성이 없다고 판단되는 경우에는(S635:아니오), 블레이드의 기울기에 이상이 있는지 여부를 판단할 수 있다(S645). 블레이드의 기울기에 이상이 있다고 판단되는 경우(S645:예), 사용자에게 블레이드의 기울기에 이상이 있다는 알림을 제공할 수 있다(S650). 이때, 금속 3D 프린터의 작동이 중단되지 않은 상태라면 작동이 중단될 수 있다. 블레이드의 기울기에 이상이 없다고 판단되는 경우(S645:아니오), 사용자에게평탄도 불량에 대한 원인이 불명이 라는 알림을 제공할 수 있다. 이때, 금속 3D 프린터의 작동이 중단되지 않은 상태라면 작동이 중단될 수 있다. 이상과 같은 본 발명의 다양한 실시 예에 따르면, 금속 3D 프린터의 사용자가 블레이드의 손상 여부를 쉽게 파 악하고, 블레이드의 교체 여부에 대한 판단을 빠르게 수행할 수 있도록 함으로써, 금속 3D 프린터로부터 제조되 는 3차원 물건의 높은 퀄리티를 지속적으로 유지할 수 있도록 할 수 있다. 한편, 상술한 다양한 실시 예에 따른 금속 3D 프린터의 분말 평탄도 검사 방법은 프로그램으로 구현되어 다양한 기록 매체에 저장될 수 있다. 즉, 각종 프로세서에 의해 처리되어 상술한 분말 평탄도 검사 방법을 실행할 수 있는 컴퓨터 프로그램이 기록 매체에 저장된 상태로 사용될 수도 있다. 일 예로, ⅰ) 금속 3D 프린터의 챔버 내부에 형성된 분말층에 기 설정된 패턴 이미지가 변환된 광선을 조사하는 단계, ⅱ) 분말층을 상부 카메라로 촬영하여 모아레(moire) 이미지를 획득하는 단계, ⅲ) 획득된 모아레 이미지 를 적어도 하나의 기준 모아레 이미지와 비교한 비교 결과 및 기준 모아레 이미지에 대응되는 평탄도 데이터에 기초하여, 분말층의 평탄도를 추정하는 단계 및, ⅳ) 추정된 분말층의 평탄도가 기 설정된 임계치 미만인 경우, 금속 3D 프린터의 작동을 중단하거나 사용자에게 알림을 제공하는 단계를 수행하는 프로그램이 저장된 비일시적 판독 가능 매체(non-transitory computer readable medium)가 제공될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0041877", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0041877", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 일 실시 예에 따른 금속 3D 프린터 장치의 구성을 간략히 나타낸 블록도, 도 2는 본 발명의 일 실시 예에 따른 챔버 내 분말층의 모아레 이미지를 촬영하는 모습을 나타낸 정면도, 도 3은 본 발명의 일 실시 예에 따른 모아레 이미지를 나타낸 도면, 도 4는 본 발명의 일 실시 예에 따른 챔버 내 블레이드의 손상 여부를 검사하는 모습을 나타낸 정면도, 도 5 및 6은 본 발명의 다양한 실시 예에 따른 금속 3D 프린터 장치의 제어 방법을 간략히 설명하기 위한 흐름도이다."}
