{"patent_id": "10-2020-0128870", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0045798", "출원번호": "10-2020-0128870", "발명의 명칭": "빅데이터와 인공지능을 이용한 치아교정방법 및 치아교정시스템", "출원인": "주식회사 뷰티스", "발명자": "정중희"}}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "치아를 촬영하여 치아데이터를 생성하는 치아데이터생성단계; 및치아데이터를 이용하여 생성된 가상의 치아에 일측과 타측에 복수개의 홀이 형성된 교정브라켓을 가상으로 부착하고, 기저장된 교정데이터를 이용하여 상기 가상의 교정브라켓의 복수개의 홀을 관통하도록 가상으로 와이어를결속하여 치아의 교정정도를 연산하는 교정연산단계를 포함하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 교정브라켓은정면이 개구되고, 양측면에 적어도 두 개 이상의 홀이 형성된 것을 특징으로 하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 교정연산단계에서는상기 가상의 교정브라켓이 상기 치아데이터의 치아에 부착되는 위치와 상기 가상의 교정브라켓을 관통하는 가상의 와이어의 연결상태를 변경하며, 치아의 교정정도를 연산하는 것을 특징으로 하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 치아 교정 방법은상기 교정브라켓이 치아에 부착되는 위치와 상기 교정브라켓을 관통하여 결속될 상기 와이어의 연결상태가 연산되면, 상기 치아데이터의 치아와 동일한 형태의 치아를 커버할 수 있으며, 일측에는 상기 교정브라켓이 가이드되며 상기 치아에 위치될 수 있도록 상기 교정브라켓의 위치를 가이드하는 가이드홀이 형성된 가이드틀을 설계제조장치를 이용하여 생성하는 가이드틀생성단계를 더 포함하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 치아 교정 방법은상기 교정연산단계 이후에,상기 치아의 교정정도에 따라 상기 치아데이터의 가상의 치아를 교정한 수정치아데이터를 생성하는 수정치아데이터생성단계를 더 포함하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 수정치아데이터생성단계 이후에,공개특허 10-2022-0045798-3-상기 수정치아데이터의 교정된 가상의 치아에 끼워질 수 있으며, 치아를 당기고 밀어서 교정하는 교정부와 이동된 치아와 맞닿으며 형태를 유지하는 유지부를 포함하는 교정장치를 가상으로 생성하는 가상교정장치생성단계를 더 포함하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 교정장치는상기 교정부의 폭과 단면은 상기 유지부의 폭과 단면보다 작게 형성되는 것을 특징으로 하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 교정장치의 탄성부에는설정된 형태의 절개부가 형성되는 것을 특징으로 하는 치아 교정 방법."}
{"patent_id": "10-2020-0128870", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "치아 일측에 부착되어 치열을 교정하는 치열교정시스템에 있어서,치아가 인입될 수 있도록 일측에 개구부가 형성되고, 전면에는 가이드홀이 형성된 가이드틀; 및측면에는 두 개 이상의 홀이 형성되어 와이어가 인입될 수 있으며, 상기 가이드홀에 위치되어 상기 가이드틀에의하여 가이드되며 치아에 부착될 수 있는 교정브라켓을 포함하는 치아교정시스템."}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "치아를 촬영하여 치아데이터를 생성하는 치아데이터생성단계 및 치아데이터의 가상의 치아에 일측과 타측에 복수 개의 홀이 형성된 교정브라켓을 가상으로 부착하고, 기저장된 교정데이터를 이용하여 상기 가상의 교정브라켓의 복수개의 홀을 관통하도록 가상으로 와이어를 결속하여 치아의 교정정도를 연산하는 교정연산단계를 포함하는 치 아 교정 방법이 개시된다."}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 치아교정방법 및 치아교정시스템에 관한 것이다. 특히, 빅데이터, 인공지능을 이용하여, 시술을 수행하여, 시술을 정확하고 편하게 할 수 있는 치아교정방법 및 치아교정시스템에 관한 것이다."}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능의 등장은 우리 생활 전반을 바꾸고 있다. 인공지능은 인간의 지능적인 행동을 모방할 수 있으므로, 그 발전 가능성은 아직도 가늠할 수 없다. 처음에 로봇이 등장하였을 때, 로봇으로 인하여 인간은 단순 노동에서 벗어날 수 있었다. 그 후 인공지능이 발 전함에 따라, 인간은 일부 고도화된 노동에서 벗어날 수 있었다. 그러나 인공지능이 노하우는 대체될 수 없다는 의견이 지배적이었다. 이는 노하우가 경험에 기반을 두고 있기 때문이다. 노하우란 기술적 비결로, 어떤 지식과 기술을 가진 자가 특정한 환경에서 이끌어 낼 수 있는 최적의 결과를 의 미한다. 이 노하우는 단순 지식, 단순 행동으로 가능한 것이 아니라, 다양한 지식, 다양한 경험, 다양한 경험적 행동이 축척되어 가능한 것이다. 그러기에 경험을 하지 못하는 로봇은 노하우적 행동을 하지 못할 것으로 생각 되었다. 한편, 노하우에 의존하는 분야는 치아 교정 분야이다. 치아 교정은 단순히 비뚤어진 치아를 가지런히 하는 것뿐만 아니라 성장과정에서 발생할 수 있는 여러 가지 골 격적 부조화를 바로잡아 정상적인 기능을 발휘할 수 있도록 해주는 일련의 시술로, 다양한 치아의 배열을 교정한 경험이 기반이 되어야만 좋은 결과를 이끌어 낼 수 있다. 그러기에 치아 교정은 교정을 수행하는 시술수행자 의 시술 능력에 따라 그 결과가 상이하였다. 그러나 최근에는 노하우의 영역도 대체 가능하다고 판단되는데, 이와 같은 판단의 근거는 빅데이터 기술의 발전 이다. 빅데이터는 방대한 데이터를 처리, 가공하여, 유의미한 결과를 낼 수 있는 기술이다. 빅데이터 기술의 발전은 기존 로봇에 없던 경험을 부여하게 되었다. 즉, 로봇(인공지능)도 경험을 가질 수 있게 되었다. 이에 따라 인공 지능도 데이터 기반에 의거하여 다양한 환경에 대응할 수 있게 되었다. 즉, 빅데이터와 인공지능이 결합되어 인간의 성역인 노하우도 대체될 수 있게 될 것으로 예측되며, 이는 치아 교정 분야에도 마찬가지이다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내 등록특허 등록번호 10-1212556 (특허문헌 0002) 국내 등록특허 등록번호 10-1930062"}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 빅데이터와 인공지능을 활용하여 시술을 수행하는 시술수행자의 실력과 상관없이 최적의 치아 교정 결과를 낼 수 있는 치아교정방법 및 치아교정시스템을 제공하는 데 목적이 있다."}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명인 치아 교정 방법은 치아를 촬영하여 치아데이터를 생성하는 치아데이터생성단계 및 치아데이터를 이용 하여 생성된 가상의 치아에 일측과 타측에 복수개의 홀이 형성된 교정브라켓을 가상으로 부착하고, 기저장된 교 정데이터를 이용하여 상기 가상의 교정브라켓의 복수개의 홀을 관통하도록 가상으로 와이어를 결속하여 치아의 교정정도를 연산하는 교정연산단계를 포함한다. 상기 교정브라켓은 정면이 개구되고, 양측면에 적어도 두 개 이상의 홀이 형성된 것을 특징으로 한다. 상기 교정연산단계에서는 상기 가상의 교정브라켓이 상기 치아데이터의 치아에 부착되는 위치상태와 상기 가상 의 교정브라켓을 관통하는 가상의 와이어의 연결상태를 변경하며, 치아의 교정정도를 연산하는 것을 특징으로 한다. 상기 교정브라켓이 치아에 부착되는 위치와 상기 교정브라켓을 관통하여 결속될 상기 와이어의 연결상태가 연산 되면, 상기 치아데이터의 치아와 동일한 형태의 치아를 커버할 수 있으며, 일측에는 상기 교정브라켓이 가이드 되며 상기 치아에 위치될 수 있도록 상기 교정브라켓의 위치를 가이드하는 가이드홀이 형성된 가이드틀을 생성 하는 가이드틀생성단계를 더 포함한다. 상기 치아 교정 방법은 상기 교정연산단계 이후에, 상기 치아의 교정정도에 따라 상기 치아데이터의 치아의 상 태를 수정한 수정치아데이터를 생성하는 수정치아데이터생성단계를 더 포함하는 한다. 상기 수정치아데이터생성단계 이후에, 상기 수정치아데이터의 교정된 가상의 치아가 끼워지되, 치아를 당기고 밀어서 교정하는 교정부와 이동된 치아와 맞닿으며 형태를 유지하는 유지부를 포함하는 교정장치를 가상으로 생 성하는 가상교정장치생성단계를 더 포함한다. 상기 교정장치는 상기 교정부의 폭과 단면은 상기 유지부의 폭과 단면보다 작게 형성되는 것을 특징으로 한다. 상기 교정장치의 탄성부에는 설정된 형태의 절개부가 형성되는 것을 특징으로 한다. 본 발명인 치아교정시스템은 치아 일측에 부착되어 치열을 교정하는 치열교정시스템에 있어서, 치아가 인입될 수 있도록 일측에 개구부가 형성되고, 전면에는 가이드홀이 형성된 가이드틀 및 측면에는 두 개 이상의 홀이 형성되어 와이어가 인입될 수 있으며, 상기 가이드홀에 위치되어 상기 가이드틀에 의하여 가이드되며 치아에 부착 될 수 있는 교정브라켓을 포함한다."}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명은 빅데이터를 이용하여 기저장된 교정데이터를 활용하여 시술대상자의 치아에 최적의 교정 브라켓 부착 위치와, 최적의 와이어 연결 방향과 위치 등을 연산하여, 보다 정확한 치아 교정 시술을 가능하게 할 수 있다. 또한, 본 발명은 가상의 시술을 실제 시술대상자에 시술 시, 가이드틀을 활용하여 교정브라켓의 부착 위치를 가 이드하여 정확한 위치에 교정브라켓이 부착될 수 있도록 하여, 보다 정확한 치아 교정 시술을 가능하게 할 수 있다. 또한, 본 발명은 복수의 홀이 형성된 교정브라켓을 활용하여 가는 와이어를 활용할 수 있고, 치아에 힘을 가하 는 교정장치의 탄성부의 폭과 단면을 작게 형성하여, 교정 진행 시 적은 힘을 지속적으로 적용함으로써 시술대 상자의 고통을 절감할 수 있다."}
{"patent_id": "10-2020-0128870", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일실시예를 예시적인 도면을 통해 상세하게 설명한다. 그러나 이는 본 발명의 범위를 한정하려 고 의도된 것은 아니다. 각 도면의 구성요소들에 참조부호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시 되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련 된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세 한 설명은 생략한다. 또한, 도면에 도시된 구성요소의 크기나 형상 등은 설명의 명료성과 편의상 과장되게 도시될 수 있다. 또한, 본 발명의 구성 및 작용을 고려하여 특별히 정의된 용어들은 본 발명의 실시예를 설명하기 위한 것일 뿐이고, 본 발명의 범위를 한정하는 것이 아니다. 도 1은 본 발명인 치아 교정 방법의 순서도이다. 도 2a는 본 발명에서 이용되는 교정브라켓의 제1사시도이다. 도 2b는 본 발명에서 이용되는 교정브라켓의 제2사시도이다. 도 2c는 본 발명에서 이용되는 교정브라켓의 저면사시도이다. 도 3은 본 발명에서 이용되는 가이드틀과 가이드틀이 결합된 치아의 정면도이다. 도 4a는 본 발명에서 이용되는 가이드틀과 가이드틀이 결합된 치아에 교정브라켓을 부착하는 상태의 정면도이다. 도 4b는 본 발명에서 제1시술단계와 제2시술단계가 중첩으로 시행되는 상태의 정면도이다. 도 5는 본 발명에서 이용되는 교정장치가 장착된 치아의 단면도이다. 도 6은 본 발명에서 이용되는 교정장치의 사시도이다. 도 7은 본 발명인 치아교정시스템의 구성들의 블록도이다. 본 발명은 치아 교정 방법과 치아 교정 시스템으로 먼저 치아 교정 방법에 대하여 기술하도록 하겠다. 치아 교정 방법은 치아데이터생성단계(S100), 교정연산단계(S200), 가이드틀데이터생성단계(S300), 가이드틀생 성단계(S400), 제1시술단계(S500), 수정치아데이터생성단계(S600), 가상교정장치데이터생성단계(S700), 교정장 치생성단계(S800), 제2시술단계(S900)를 포함한다. 치아데이터생성단계(S100)는 시술 전 시술대상자의 치아를 촬영 또는 스캔하여 치아데이터를 생성하는 단계이다. 여기서, 치아데이터를 생성하는 것은 촬영된 데이터를 수신한 관리자단말기 또는 관리서버일 수 있다. 보다 정확한 시술대상자의 치아를 촬영하기 위하여 기설정된 위치에서 시술대상자의 치아를 촬영할 수 있다. 그 렇지 않으면 시술대상자의 치아를 기준 위치에서 촬영하고, 이 촬영된 치아를 기준으로 다양한 위치에서 촬영된 치아의 수치, 위치 등을 보정할 수 있다. 교정연산단계(S200)는 본 발명의 특징인 교정브라켓을 모사한 가상의 교정브라켓을 치아데이터에 연산하여 가상의 치아에 부착하고, 가상의 교정브라켓에 가상의 와이어를 관통시켜 치아 위치 교정을 가상으로 연산하여 수행하는 단계이다. 전술한 관리단말기에는 기설정된 교정데이터가 저장되어 있다. 교정데이터는 기준이 되는 데이터로, 기존에 수 행된 다양한 시술대상자의 교정데이터가 저장되어 있다. 즉, 다양한 시술대상자의 치아의 배열 상태, 각각 치아 에 인입된 교정브라켓, 그리고 각각의 교정브라켓의 홀을 관통하여 결속된 와이어 등에 대한 정보이다. 당연하 게도 이러한 시술을 수행한 결과도 저장되어 있다. 이러한 교정데이터를 기준으로 관리단말기는 치아데이터의 치아 상태에 최적의 교정브라켓의 위치인 위치 상태와 교정브라켓에 결속되는 와이어의 연결 위치인 연결상태를 연산하여 추천할 수 있다. 일례로, 도 3에서 도시된 바와 같이, 도 3과 같은 시술대상자의 치아 배열 상태를 촬영하고, 이에 대한 치아데 이터를 생성하였다고 가정하겠다. 여기서, 시술대상자의 어느 하나의 치아는 치축이 뒤틀려 있어 이를 교정할 필요가 있다. 관리단말기는 교정데이터를 통하여 시술대상자의 치아 상태에 그에 따라 교정브라켓이 어느 위치에 부착되 어야 치축을 정위치로 회전시킬 수 있는지 연산할 수 있다. 여기서 교정브라켓의 위치는 인접한 치아의 상 태를 고려하여 설정된다. 즉, 연산의 대상이 되는 치아에 교정브라켓의 부착위치는 상측에 위치된다고 관리단말기는 교정데이터를 통하여 연산할 수 있을 것이다. 그러나 연산의 대상이 되는 치아에 위치되는 교정브라켓은 인접한 교정브 라켓이 도 4에서 도시된 바와 같이 뒤틀려 있으므로 이 교정브라켓과의 관계를 고려 시 제일 처음 연 산된 위치보다 하측으로 설정된 각도로 비틀려 부착되어야 한다고 연산될 수 있을 것이다. 또한, 관리단말기는 교정데이터를 이용하여 와이어의 연결상태도 연산할 수 있다. 여기서 본 발명인 교정 브라켓은 멀티홀을 가져서 와이어의 연결상태를 다양하게 할 수 있다. 교정브라켓을 보다 정확하게 살펴보면, 교정브라켓은 몸체부, 몸체부의 양측면에 하나 이 상 형성된 홀, 몸체부의 하측에 위치되어 치아와 강력하게 부착되는 연결부를 포함한다. 몸체부 는 설정된 형태로 형성되어 일측에 개구부가 형성되어 있다. 몸체부는 설정된 도형의 단면(일례로 사 각형)을 가질 수 있으며, 설정된 높이를 가져서 와이어가 관통될 수 있는 홀이 측면에 형성될 수 있 다. 홀은 몸체부의 측면에 대칭되는 위치에 형성되며, 적어도 두 개 이상으로 구성된다. 따라서 와이어 는 일측에 위치된 홀을 통과하고, 경우에 따라 일측의 홀과 대칭되는 위치의 타측의 홀을 관통하도록 결속될 수 있으며, 경우에 따라서는 일측의 홀의 대각 방향에 위치되는 타측의 홀을 관통 하도록 결속될 수 있다. 물론 와이어가 전술한 일측과 타측의 홀을 반대로 관통하는 경우도 가능할 것이다. 본 발명의 관리단말기는 교정데이터를 이용하여, 교정브라켓에 결속되는 와이어의 연결상태도 연산할 수 있다. 한편, 교정연산단계(S200)는 시술수행자가 교정브라켓의 부착 위치를 지정할 수 있다. 즉, 전술한 바와 같이 관리단말기가 교정데이터를 이용하여 교정브라켓의 위치, 와이어의 연결 위치 등을 연산하여 최적의 위치를 연산할 수 있지만, 시술수행자가 직접 교정브라켓의 위치, 와이어의 연 결 위치 등을 설정할 수 있다. 이 경우 관리단말기는 교정데이터와 시술수행자가 입력한 교정브라켓의 위치상태, 와이어의 연결상태 와 비교하여, 교정정도를 연산하여 출력한다. 여기서, 시술수행자가 입력한 교정브라켓의 위치상태, 와이어의 연결상태와 교정데이터에 기저장된 최적의 교정브라켓의 위치상태, 와이어의 연결상태의 차이는 육안으로 쉽게 확인할 수 있게 %로 표시 될 수 있다. 즉, 전술한 치아데이터, 가상의 교정브라켓, 가상의 와이어, %는 디스플레이에 표시되어 시술수행자가 육안으로 확인할 수 있다. 이와 같이 시술대상자의 치아에 교정브라켓의 위치상태, 와이어 연결상태가 결정되 면 가이드틀데이터생성단계(S300)가 수행될 수 있다. 가이드틀데이터생성단계(S300)는 가상으로 치아데이터의 가상의 치아에 인입될 수 있는 가상의 가이드틀에 대한 데이터인 가이드틀데이터를 생성하는 단계이다. 가이드틀은 일측에 개구부가 형성되어 치아가 인입될 수 있으며, 전면에는 가이드홀이 형성될 수 있다. 여기서 가이드홀의 형상은 교정브라켓의 연결부 의 형상과 대응될 수 있다. 여기서 가이드틀은 시술대상자의 치아에 인입되는 것이므로, 시술대상자의 치아의 상태에 따라 다양한 형 태로 형성될 수 있고, 가이드홀은 전술하여 설정된 교정브라켓의 위치상태에 따라서 다양한 방향으로 형성될 수 있다. 일례로 도 3에서 도시된 바와 같이, 어느 하나의 가이드홀은 설정된 각도로 뒤틀리도록 형성될 수 있으며, 다른 가이드홀은 그렇지 않을 수 있다. 가이드틀생성단계(S400)는 전술한 가상의 가이드틀데이터에 따라 가이드틀을 생성하는 단계이다. 여 기서, 가이드틀은 3D 프린트를 이용하여 인쇄를 통하여 제조되거나, CAD/CAM으로 설계 후, 정밀 가공 등을 통하여 제조될 수 있다. 가이드틀이 제조되면, 그 후 시술수행자는 가이드틀, 교정브라켓, 와이어를 직접 시술대상 자에 시술하는 제1시술단계(S500)를 수행할 수 있다. 제1시술단계(S500)는 가이드틀을 시술대상자의 치아에 삽입하고, 가이드틀에 형성된 전면의 가이드홀 을 통하여 교정브라켓을 위치시킨다. 여기서 교정브라켓의 연결부에 인체에 무해한 접착제 를 도포하고 가이드홀에 의하여 교정브라켓을 치아의 정위치에 부착하고, 와이어를 각각의 교정 브라켓에 연결할 수 있다. 또한, 본 발명은 수정치아데이터생성단계(S600)를 포함할 수 있다. 수정치아데이터생성단계(S600)는 전술한 치아데이터의 가상의 치아가 전술한 교정연산단계(S200)에 의하여 시술 이 완료 경우의 가상의 치아데이터이다. 즉, 제1시술단계(S500)에 의하여 실제 시술이 수행된 경우, 치아를 촬 영하여 치아데이터를 생성하면 이 치아데이터는 수정치아데이터와 일치할 수 있다. 본 발명은 가상교정장치데이터생성단계(S700)를 포함할 수 있다. 교정장치는 교정브라켓과는 다르게 시술대상자가 장착하는 장치로, 탄성부가 치아에 미세한 힘 을 지속 인가하여 치아의 위치를 교정할 수 있다. 교정장치에 대하여 우선 설명하자면, 교정장치는 일측에 절개부가 형성되어 있으며, 제1시술단 계(S500)에 의하여 시술이 된 치아에 인입되어 치아의 이동(근원심 이동, 압하 이동, 정출이동 등)을 가능하게 할 수 있다. 교정장치는 도 4b에서 도시된 바와 같이 치아의 상태에 따라 제1시술단계(S500)에 중첩되어 사용 될 수 있 다. 교정장치는 탄성부, 유지부를 포함한다. 여기서, 탄성부는 교정장치의 일측, 유지부 는 교정장치의 타측에 위치될 수 있다. 그리고 교정장치는 치아에 인입되어 치아를 이동시키므 로, 탄성부와 유지부 사이에는 치아의 이동을 위한 공간이 형성될 수 있다. 탄성부의 폭과 단면은 유지부의 폭과 단면보다 작게 형성된다. 그러므로 인하여 탄성부는 치아 에 미세한 힘을 인가하여 치아를 이동시키므로 시술대상자가 느끼는 고통을 줄일 수 있다. 탄성부에는 절 개부가 형성될 수 있다. 절개부는 탄성부를 보조하기 위하여 고안된 구성으로 치아의 이동 방향, 그리고 탄성부가 치아와 맞닿는 위치를 교정한다. 여기서 절개부는 교정력이 가해지지 않거나 교정력을 방해할 수 있는 부분에 형성되어 치아의 위치(협측, 설측, 절단부, 치은부, 근심부, 원심부)를 고려하여 교정력에 필요한 부분에 탄성력을 주기 위하여 고안된 것으 로, 치아의 이동을 방해하거나, 삽입이 어려운 부분들을 고려하여 형성된다. 따라서 절개부는 시술대상자 의 치아 상태에 따라 다양한 형태를 가질 수 있다. 유지부는 탄성부와 대응되는 위치에 형성되어, 치아 이동의 기준점을 제공한다. 여기서, 탄성부 , 절개부, 유지부의 형태는 시술대상자의 치아 상태에 따라서 대응되게 변형될 수 있다. 가상교정장치데이터생성단계(S700)는 이후 생성될 교정장치가 수정치아데이터와 일치되는 형태의 치아에 인입될 수 있는 지와 치아가 교정될 수 있는지를 연산하여 가상의 교정장치를 생성하는 단계이다. 관리단말기의 교정데이터에는 다양한 시술대상자의 치아 상태에 다양한 형태의 교정장치가 부착 또는 인입 된 경우 이에 대한 교정 결과가 기저장되어 있을 수 있다. 따라서 가상으로 생성된 교정장치를 치아에 인 입 시, 치아가 교정되는 정도를 시술수행자는 미리 알 수 있다. 여기서, 시술수행자는 전술한 입력신호를 인가 하여 교정장치의 탄성부, 유지부의 폭, 절개부의 위치 및 형태 등을 수정할 수 있다. 이 경우 관리단말기는 기저장된 교정데이터와 시술수행자가 수정한 교정장치를 비교하여 교정정도를 %로 나타낼 수 있다. 가상교정장치데이터생성단계(S700)를 통하여 생성될 교정장치의 형태가 설정되면 교정장치생성단계(S800) 를 수행한다. 이 단계에서 생성되는 교정장치는 전술한 단계인 가상교정장치데이터생성단계(S700)에서 형 상이 결정된 가상교정장치와 대응되는 형상의 교정장치로, CAD/CAM에 의해 밀링머신으로 제작되거나 3D프린트에 의해 제작 또는 필요한 영역만 합성수지로 제작될 수도 있다. 교정장치가 생성되면 제2시술단계(S900)를 수행한다. 제2시술단계(S900)는 생성된 교정장치를 시술대상자에게 시술하는 단계로 시술대상자는 교정장치를 지속적 착용 또는 필요에 따라 착용하여 치아를 교정할 수 있다. 여기서, 필요에 따라서 시술이 종료될 때까지 전술한 각 단계를 수행할 수 있으며, 특히, 수정치아데이터생성단 계(S600), 가상교정데이터생성단계, 교정장치생성단계(S800)는 시술이 종료될 때까지 반복 수행될 수 있다. 즉, 시술수행자는 교정장치에 의하여 교정된 치아의 정렬 상태를 촬영하여 수정치아데이터를 재생산하고, 가상 교정장치데이터생성단계(S700)를 통하여 가상으로 교정장치를 생성한 후, 최종적으로 교정장치생성단계(S800)를 수행하여 교정장치를 재생산하여 시술대상자에게 시술할 수 있다. 본 발명인 치아교정시스템은 관리단말기, 설계제조장치를 포함할 수 있다. 관리단말기는 촬영부(A100), 저장부(A200), 연산부(A300), 치아데이터생성부(A400), 수정치아데이터생성부 (A700), 가이드틀데이터생성부(A600), 수정치아데이터생성부(A700), 가상교정장치데이터생성부(A800), 입력부 (A900)를 포함한다. 촬영부(A100)는 시술대상자의 치아를 촬영 또는 스캔을 수행하여, 시술대상자의 치아의 상태를 촬영한다. 촬영 부(A100)는 촬영데이터를 치아데이터생성부(A400), 수정치아데이터생성부(A700)로 송신할 수 있다. 저장부(A200)는 기설정된 교정데이터가 저장되어 있다. 또한, 저장부(A200)에는 가상의 교정브라켓, 가상의 와 이어, 가상의 교정장치에 관한 데이터가 저장되어 있을 수 있다. 교정데이터는 빅데이터를 가공하여 다양한 치아의 형태에 부착 또는 인입된 다양한 교정브라켓의 위치, 와 이어의 연결상태 등이 저장되어 있으며 그에 따라 시술의 결과에 대한 데이터도 저장되어 있다. 교정데이 터는 기준데이터가 된다. 연산부(A300)는 다양한 연산을 수행한다. 기본적으로는 각종 생성되는 데이터와 교정데이터를 비교하여, 시술의 결과에 대한 데이터를 출력한다. 입력부(A900)는 시술수행자가 터치 또는 그 이외의 동작을 통하여 생성된 입력신호를 각각의 구성에 전달하여 입력신호에 따라 결과가 수정되도록 할 수 있다. 치아데이터생성부(A400)는 촬영부(A100)가 생성한 치아데이터를 수신하여 그에 대응되는 치아데이터를 생성한다. 따라서 전술한 치아데이터생성단계(S100)는 촬영부(A100), 치아데이터생성부(A400)를 통하여 구현될 수 있다. 가이드틀데이터생성부(A600)는 가상의 가이드틀데이터를 생성한다. 여기서, 가이드틀데이터생성단계(S30 0)는 치아데이터생성부(A400)가 생성한 치아데이터와 연산부(A300), 저장부(A200)가 실행되어 동작될 수 있다. 한편, 본 발명인 관리단말기와 설계제조장치는 연결되어 데이터를 송수신할 수 있다. 설계제조장치는 일례로 3D프린터기, CAD/CAM을 구비한 단말기와 그와 연결된 밀링머신 등일 수 있다. 따라서 가이드틀데이터생성부(A600)에 의하여 생성된 가이드틀데이터는 설계제조장치로 송신될 수 있 으며, 이에 따라 설계제조장치는 동작되어 가이드틀을 생성할 수 있다. 따라서 전술한 가이드틀데이터생성단계(S300)는 치아데이터생성부(A400), 가이드틀데이터생성부(A600), 설계제 조장치의 동작으로 수행될 수 있다. 시술수행자는 생성된 가이드틀, 교정브라켓, 와이어를 통하여 시술대상자의 치아에 가이드틀 , 교정브라켓, 와이어 등을 시술할 수 있다. 여기서, 시술이 종료되면 시술수행자는 가이드틀 을 제거할 수 있다. 수정치아데이터생성부(A700)는 전술한 수정치아데이터생성단계(S600)의 수정치아데이터를 생성하는 구성으로 전 술한 바와 같이, 제1시술단계(S500)의 수행으로 시술된 치아의 배열을 가상의 데이터로 생성한다. 한편, 여기서 촬영부(A100)가 보조할 수 있음은 전술한 바와 같다. 따라서 수정치아데이터생성단계(S600)는 수정치아데이터생성부(A700), 저장부(A200), 연산부(A300), 또는 촬영 부(A100) 등의 동작 수행으로 가능할 수 있다. 가상교정장치데이터생성부(A800)는 가상의 교정장치를 생성하는 것으로 가상의 교정장치는 수정치아 데이터에 대응되는 치아에 인입될 수 있는 형상으로 제조될 수 있다. 전술한 가상교정데이터생성단계는 가상교정장치데이터생성부(A800), 저장부(A200), 연산부(A300) 등이 동작되어 수행될 수 있다. 여기서 생성된 가상교정장치데이터는 설계제조장치로 송신될 수 있으며, 설계제조장치는 가상교 정장치데이터에 대응되는 형태의 교정장치를 제조할 수 있다. 시술수행자는 제조된 교정장치를 이용하여 시술대상자에게 착용하도록 하여 시술대상자의 치아를 교정할 수 있다. 본 발명은 특정한 실시 예에 관련하여 도시하고 설명하였지만, 이하의 특허청구범위에 의해 제공되는 본 발명의 기술적 사상을 벗어나지 않는 한도 내에서, 본 발명이 다양하게 개량 및 변화될 수 있다는 것은 당 업계에서 통 상의 지식을 가진 자에게 있어서 자명할 것이다."}
{"patent_id": "10-2020-0128870", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명인 치아 교정 방법의 순서도이다. 도 2a는 본 발명에서 이용되는 교정브라켓의 제1사시도이다. 도 2b는 본 발명에서 이용되는 교정브라켓의 제2사시도이다. 도 2c는 본 발명에서 이용되는 교정브라켓의 저면사시도이다. 도 3은 본 발명에서 이용되는 가이드틀과 가이드틀이 결합된 치아의 정면도이다. 도 4a는 본 발명에서 이용되는 가이드틀과 가이드틀이 결합된 치아에 교정브라켓을 부착하는 상태의 정면도이다. 도 4b는 본 발명에서 제1시술단계와 제2시술단계가 중첩으로 시행되는 상태의 정면도이다. 도 5는 본 발명에서 이용되는 교정장치가 장착된 치아의 단면도이다. 도 6은 본 발명에서 이용되는 교정장치의 사시도이다. 도 7은 본 발명인 치아교정시스템의 구성들의 블록도이다."}
