{"patent_id": "10-2021-0071119", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0162548", "출원번호": "10-2021-0071119", "발명의 명칭": "이미지의 노이즈 제거를 위한 인공지능 학습 방법 및 장치", "출원인": "성균관대학교산학협력단", "발명자": "추현승"}}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "입력 이미지에 대해서 2회의 연속적인 컨볼루션 연산을 수행하여, 제1 특징맵 및 제2 특징맵을 연속적으로 추출하는 제1 연속 특징값 추출 모듈(CFE1);상기 제2 특징맵에 기초하여 심층 특징맵들을 추출하고, 상기 심층 특징맵들을 연결(concatenation)하여 제3 특징맵을 추출하는 심층 특징맵 추출 모듈(DFE);상기 제1 특징맵과 상기 제3 특징맵을 가산하여 제4 특징맵을 출력하는 광역 숏컷 연결 모듈(GSC);상기 제4 특징맵에 대해서 연속적인 컨볼루션 연산을 수행하여, 제5 및 제6 특징맵을 추출하는 제2 연속 특징값추출 모듈(CFE2); 및상기 입력 이미지에서 상기 제2 연속 특징값 추출 모듈의 출력값을 감산하여 보정 이미지를 생성하는 광역 잔상맵핑 모듈(GRM);을 포함하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 연속 특징값 추출 모듈은 상기 입력 이미지에 대한 컨볼루션 연산을 수행하여, 상기 제1 특징맵을 추출하는 제1 컨볼루션 레이어; 및상기 제1 특징맵에 대한 컨벌루션 연산을 수행하여, 상기 제2 특징맵을 추출하는 제2 컨볼루션 레이어;를 포함하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,심층 특징맵 추출 모듈은 심층 신경망 기반으로 이미지에서 노이즈를 검출하며, 각각이 상기 심층 특징맵을 출력하는 경량 잔상 블록(LRB)들; 및상기 경량 잔상 블록들이 출력하는 상기 심층 특징맵들의 개수를 조절하는 1×1 컨볼루션 레이어;를 포함하는것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 경량 잔상 블록들 중에서 제i(i는 자연수) 경량 잔상 블록은, 제(i-1) 경량 잔상 블록이 출력하는 제(i-1) 상기 심층 특징맵을 입력받아서, 제(i+1) 경량 잔상 블록으로 상기심층 특징맵을 출력하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,공개특허 10-2022-0162548-3-상기 제i 경량 잔상 블록은 정류화 선형 유닛 및 3×3 컨볼루션 레이어를 포함하는 컨벌루션 모듈이 복수 개로구성되고, 각각의 상기 정류화 선형 유닛 및 3×3 컨볼루션 레이어는,상기 각각의 컨벌루션 모듈은 제(i-1) 경량 잔상 블록이 출력한 심층 특징맵 및 이전 상기 컨벌루션 모듈이 출력한 특징을 결합하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 심층 특징맵 추출 모듈은 복수의 상기 경량 잔상 블록들이 출력하는 각각의 상기 심층 특징맵을 컨켓테네이션(concatenation) 방식으로결합하여 상기 1×1 컨볼루션 레이어로 제공하는 컨켓테네이션 레이어를 더 포함하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 심층 특징맵 추출 모듈은 유클리드 거리 손실함수 및 SSIM 손실함수의 합으로 정의되는 손실함수에 기초하여 상기 심층 특징맵을 출력하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 장치."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "입력 이미지에 대해서 2회의 연속적인 컨볼루션 연산을 수행하여, 제1 특징맵 및 제2 특징맵을 연속적으로 추출하는 단계;상기 제2 특징맵에 기초하여 심층 특징맵들을 추출하고, 상기 심층 특징맵들을 연결(concatenation)하여 제3 특징맵을 추출하는 단계;상기 제1 특징맵과 상기 제3 특징맵을 가산하여 제4 특징맵을 출력하는 단계;상기 제4 특징맵에 대해서 연속적인 컨볼루션 연산을 수행하여, 제5 및 제6 특징맵을 추출하는 단계; 및상기 입력 이미지에서 상기 제2 연속 특징값 추출 모듈의 출력값을 감산하여 보정 이미지를 생성하는 단계를 포함하는 노이즈 제거를 위한 이미지 학습 방법."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 제2 특징맵을 연속적으로 추출하는 단계는상기 입력 이미지에 대한 컨볼루션 연산을 수행하여, 상기 제1 특징맵을 추출하는 단계; 및상기 제1 특징맵에 대한 컨벌루션 연산을 수행하여, 상기 제2 특징맵을 추출하는 단계를 포함하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 방법."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0162548-4-제 8 항에 있어서,상기 제3 특징맵을 추출하는 단계는심층 신경망 기반으로 상기 입력 이미지에서 노이즈를 검출하여 복수의 심층 특징맵들을 순차적으로 출력하며,1×1 컨볼루션 레이어에 기초하여 상기 심층 특징맵들의 개수를 조절하는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 방법."}
{"patent_id": "10-2021-0071119", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,각각의 제i 심층 특징맵은 정류화 선형 유닛 및 3×3 컨볼루션 레이어에 기반하여 단계별로 추출되되, j 번째상기 심층 특징맵은 초기 심층 특징맵 및 j-1 번째 심층 특징맵이 결합되어 생성되는 것을 특징으로 하는 노이즈 제거를 위한 이미지 학습 방법."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 노이즈 제거를 위한 이미지 학습 장치에 관한 것으로, 입력 이미지에 대해서 2회의 연속적인 컨볼루션 연산을 수행하여, 제1 특징맵 및 제2 특징맵을 연속적으로 추출하는 제1 연속 특징값 추출 모듈(CFE1); 제2 특징 맵에 기초하여 심층 특징맵들을 추출하고, 심층 특징맵들을 연결(concatenation)하여 제3 특징맵을 추출하는 심 층 특징맵 추출 모듈(DFE); 제1 특징맵과 제3 특징맵을 가산하여 제4 특징맵을 출력하는 광역 숏컷 연결 모듈 (GSC); 제4 특징맵에 대해서 연속적인 컨볼루션 연산을 수행하여, 제5 및 제6 특징맵을 추출하는 제2 연속 특징 값 추출 모듈(CFE2); 및 입력 이미지에서 제2 연속 특징값 추출 모듈의 출력값을 감산하여 보정 이미지를 생성하 는 광역 잔상 맵핑 모듈(GRM);을 포함한다."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이미지의 노이즈 제거를 위한 인공지능 학습 방법 및 장치에 관한 것으로, 이미지를 인식하는 속도 및 이미지를 인식하는 성능을 향상시키기 위한 것이다."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "CCTV는 물리적 보안, 안전 그리고 범죄 예방에 많은 도움을 준다. 또한Dash Cam는 차량의 필수적인 부품이다. 게다가, 자율 주행 차량에서는 카메라 센서가 주변 도로와 물체 등 환경을 감지하는 운전자의 눈 역할을 하기 때문에 중요하다. 디지털 영상기기들은 일상생활에서 흔하기 때문에 영상 품질을 향상시키는 것에 대해 관심이 집중되고 있다. 하지만 영상 내에서 artifact의 존재는 이미지 손상으로 이어지며 image quality는 저하된다. 특히, 빗줄기와 같은 예측할 수 없는 artifacts는 object detection과 face detection과 같은 컴퓨터 비전의 성능을 떨어뜨린다. 이러한 이유로, 불필요한 artifacts를 제거하는 알고리즘을 개발할 필요가 있다. 본 논문에 서 악천후에서 가시성을 확보하기 위해 우리는 single image rain removal problem를 다룬다."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이미지 인식 성능을 높일 수 있는 노이즈 제거를 위한 이미지 학습 방법 및 장치를 제공하기 위한 것 이다. 본 발명은 이미지 인식 속도를 높일 수 있는 노이즈 제거를 위한 이미지 학습 방법 및 장치를 제공하기 위한 것 이다."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 의한 노이즈 제거를 위한 이미지 학습 장치에 관한 것으로, 입력 이미지에 대해서 2회의 연속적인 컨 볼루션 연산을 수행하여, 제1 특징맵 및 제2 특징맵을 연속적으로 추출하는 제1 연속 특징값 추출 모듈(CFE1); 제2 특징맵에 기초하여 심층 특징맵들을 추출하고, 심층 특징맵들을 연결(concatenation)하여 제3 특징맵을 추 출하는 심층 특징맵 추출 모듈(DFE); 제1 특징맵과 제3 특징맵을 가산하여 제4 특징맵을 출력하는 광역 숏컷 연 결 모듈(GSC); 제4 특징맵에 대해서 연속적인 컨볼루션 연산을 수행하여, 제5 및 제6 특징맵을 추출하는 제2 연속 특징값 추출 모듈(CFE2); 및 입력 이미지에서 제2 연속 특징값 추출 모듈의 출력값을 감산하여 보정 이미지 를 생성하는 광역 잔상 맵핑 모듈(GRM);을 포함한다."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 훈련 시간을 줄이면서 이미지 인식 처리 속도를 향상시킬 수 있다. 본 발명은 계층적으로 특징값을 추출함에 따라 이미지 인식 품질을 향상시킬 수 있다."}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실 시예들을 참조하면 명확해질 것이다. 그러나 본 명세서는 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 명세서의 개시가 완전하도록 하며, 본 명세서 가 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 명세서는 청구항의 범주에 의해 정의될 뿐이다. 본 명세서의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하고, 기술 적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적으로 실시 가능할 수도 있고 연관 관계로 함께 실시할 수도 있다. 도 1은 본 발명의 실시 예에 따른 이미지의 노이즈 제거를 위한 인공지능 학습 시스템을 나타내는 도면이다. 도 1을 참조하면, 본 발명의 실시 예에 따른 이미지의 노이즈 제거를 위한 인공지능 학습 시스템은 제1 연속 특 징값 추출 모듈, 심층 특징맵 추출 모듈, 광역 숏컷 연결 모듈, 제2 연속 특징값 추출 모듈 , 및 광역 잔상 맵핑 모듈을 포함한다. 제1 연속 특징값 추출 모듈(Consecutive Feature Extraction; 이하, CFE)은 입력 이미지에 대해서 2회의 연속적인 컨볼루션 연산을 수행하여, 제1 특징맵 및 제2 특징맵을 연속적으로 추출한다. 심층 특징맵 추출 모듈(Dep Feature Extraction; 이하, DFE)은 제2 특징맵에 기초하여 심층 특징맵들을 추출하고, 심층 특징맵들을 연결(concatenation)하여 제3 특징맵을 추출한다. 이를 통해서, DFE는 입력 이미지(IMG)에서 빗줄기 등의 노이즈를 제거할 수 있다. 광역 숏컷 연결 모듈(Global Shortcut Connection; 이하, GSC)은 제1 특징맵과 제3 특징맵을 가산하여 제 4 특징맵을 출력한다. 제2 CFE는 제4 특징맵에 대해서 연속적인 컨볼루션 연산을 수행하여, 제5 및 제6 특징맵을 추출한다. 광역 잔상 맵핑 모듈(Global Residual Maping; 이하, GRM)은 입력 이미지에서 제2 연속 특징값 추출 모듈 의 출력값을 감산하여 보정 이미지를 생성한다. 도 2는 본 발명의 실시 예에 의한 이미지의 노이즈 제거를 위한 인공지능 학습 방법을 나타내는 순서도이다. 도 2를 참조하면, 이미지의 노이즈 제거를 위한 인공지능 학습 방법은 제1 단계(S210)에서, 제1 CFE는 입 력 이미지에 대해서 2회의 연속적인 컨볼루션 연산을 수행하여, 제1 특징맵 및 제2 특징맵을 연속적으로 추출한 다. 이를 위해서, 제1 CFE는 제1 및 제2 컨볼루션 레이어들(110,120)을 포함한다. 제1 컨볼루션 레이어는 입력 이미지(IMG)에 대한 컨볼루션 연산을 수행하여, 제1 특징맵(F1)을 추출한다. 본 명세서에서, 제1 컨볼루셔 레이어가 제1 특징맵(F1)을 추출하는 연산은 다음의 [수학식 1]과 같이 정의 하기로 한다. [수학식 1]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "제2 컨볼루션 레이어는 제1 특징맵(F1)에 대한 컨볼루션 연산을 수행하여, 제2 특징맵(F2)을 추출한다. 본 명세서에서, 제2 컨볼루셔 레이어가 제2 특징맵(F2)을 추출하는 연산은 다음의 [수학식 2]와 같이 정의 하기로 한다. [수학식 2]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "제1 특징맵(F1)의 개수 및 제2 특징맵(F2)의 개수는 서로 다를 수 있다. 제2 단계(S220)에서, DFE들은 제2 특징맵(F2)에 기초하여 심층 특징맵들(DF1~DF5)을 추출하고, 심층 특징 맵들(DF1~DF5)을 연결(concatenation)하여 제3 특징맵(F3)을 추출한다. 이를 위해서, DFE는 복수의 경량 잔상 블록(Light Residual Block; 이하, LRB)들(LRB1~ LRBn)(n은 자연수) 및 1×1 컨볼루션 레이어를 포함한다. LRB들(LRB1~ LRBn)은 제2 특징맵(F2)을 입력받아서 심층적인 특징을 추출한다. 제1 LRB(LRB1)는 제2 특징맵 (F2)을 입력받아서 제1 심층 특징맵(DF1)을 추출한다. 제i (i는 2 이상 n이하의 자연수)LRB는 제(i-1) LRB가 출력하는 제(i-1) 심층 특징맵(DF[i-1])을 입력받아서 제i 심층 특징맵(DFi)을 출력한다. 이를 위해서, LRB들 각각은 도 3에 도시된 바와 같이, 정류화 선형 유닛(Rectified Linear Unit; 이하, ReLU) 및 3×3 컨볼루션 레이어를 포함하는 컨벌루션 모듈이 복수 개로 구성된다. 또한 컨켓테네이션(concatenation) 레이어는 LRB들 각각이 출력하는 심층 특징맵들을 컨켓테네이션 (concatenation) 방식으로 결합하고, 결합된 결과를 1×1 컨볼루션 레이어로 제공한다. 1×1 컨볼루션 레이어는 DFE가 최종적으로 출력하는 제3 특징맵(F3)의 개수를 조절한다. 본 명세서에서, 제3 특징맵(F3)을 산출하는 과정은 다음의 [수학식 3]과 같이 정의하기로 한다. [수학식 3]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이때, 은 제3 특징맵(F3)의 개수를 조절하기 위해서 사용되는 1×1 컨볼루션 레이어를 지칭한다. DFE는 계층적으로 특징을 추출할 뿐만 아니라 DFE에서 사용되는 심도 연결(dense connection)에 의해서 모든 계 층에서 생성된 심층 특징맵들을 연결한다. 모든 층의 output이 연결되기 때문에 L-layer 네트워크에서는 \"{L(L+1)}/2\" 개의 연결을 갖게 되어 학습 파라미 터가 증가한다. 학습 파라미터가 증가하는 것을 보완하기 위해, 제i LRB는 초기 정보( )를 각 계층의 출력에 연결하여 필요한 최소 계층을 제(i+1) LRB의 입력으로 연결한다. 본 명세서에서 LRB들 간의 연결은 [수학식 4]로 정의하기로 한다. [수학식 4]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "이때, 는 LRB의 3×3 컨볼루션 레이어와 ReLU를 결합한 복합 함수(composite function)이다. 는 과 초기 정보( ) 간의 연결(concatenation)을 의미한다. LRB는 연산의 효율성을 위해서 심층 특징맵의 개수를 줄이는 것이 중요하고, 따라서 LRB들의 출력에 해당하는 \" \"는 1×1 컨볼루션 레이어의 입력에 해당한다. 또한, 기울기 소멸(gradient vanishing) 현상을 방지하기 위해서, 최단 연결(shortcut connection)을 이용한다. 최단 연결은 다음의 [수학식 5]로 정의될 수 있다. [수학식 5]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "기울기 소멸 현상은 네트워크의 깊이가 깊어질수록 미분 연산이 증가하고, 이에 따라 미분값이 작아지면서 출력 에 영향을 주는 가중치(weight)의 크기가 작아지는 현상을 지칭한다. 본 명세서에서는 최단 연결 방식을 이용 함으로써 기울기 소멸 현상을 개선할 수 있다. LRB의 손실함수(Loss function)는 다음의 [수학식 6]과 같이 정의될 수 있다. [수학식 6]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "이때, 는 유클리드 거리 손실(Euclidean distance loss)을 지칭하며, 두 픽셀 간의 거리를 측정하기 위해서 다음과 같은 [수학식 7]을 바탕으로 산출될 수 있다. [수학식 7]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "이때, R은 잔차 함수(residual function)이고, n은 패치 이미지(patch image)의 개수를 지칭한다. I는 입력, 는 훈련을 위한 지상 실측(ground truth) 내의 패치 이미지을 지칭하며, 는 LRB로부터의 평가 패치 이미지를 지칭한다. 또한, SSIM은 최대값이 1이며 크기가 클 수록 두 이미지 간의 유사도가 높은 것을 나타낸 다. 따라서, 은 1-SSIM으로 정의될 수 있다. 제3 단계(S230)에서, GSC는 제1 특징맵(F1)과 제3 특징맵(F3)을 가산하여 제4 특징맵을 출력한다. 제4 단계(S240)에서, 제2 CFE는 제4 특징맵(F4)에 대해서 연속적인 컨볼루션 연산을 수행하여, 제5 및 제6 특징맵들(F5,Ic)을 추출한다. 제2 CFE는 제1 CFE(100동일한 구조로 이루어질 수 있다. 제5 단계(S250)에서, GRM입력 이미지에서 제2 연속 특징값 추출 모듈의 출력값을 감산하여 보정 이미지를 생성한다. 이를 통해서, GRM은 입력 이미지에서 빗줄기 등의 노이즈가 제거된 보정 이미지를 생성할 수 있다. 본 발명에 의한 인공지능 학습 장치를 이용한 실험 결과를 살펴보면 다음과 같다. 도 4는 실험 결과에 활용된 이미지를 나타내는 도면이다. 도 4의 (a)는 가상의 빗줄기를 포함하는 이미지를 나타내는 도면이고, 도 4의 (b)는 빗줄기가 제거된 이미지를 나타내는 도면이다. 도 4의 (c)는 원본 이미지를 나타내는 도면이다. 도 4에 도시된 각각의 이미지들은 16x16 크기의 패치 유닛(patch unit)으로 선택하고, 패치 유닛 내에서 128개 의 패치를 랜덤하게 채택하여 본 발명에 의한 인공지능 학습 장치를 이용하여 훈련되었다. 실험 환경은 tensorflow 2 framework를 사용하여 Intel® Core™ i7-1070K and 2080 Super GPU를 사용한 PC에서 실험을 시 행되었다. 이미지 품질을 정량적으로 평가하기 위하여 Peak Signal to Noise Ratio (PSNR)과 SSIM의 지표가 사용되었다. 아래의 [표 1]에서와 같이, 빗줄기 이미지와 빗줄기가 없는 원본 이미지 간의 PSNR이 18.722, SSIM이 0.7140이 다. 그리고 빗줄기가 제거된 이미지와 빗줄기가 없는 원본 이미지 간의 PSNR이 31.158이 SSIM이 0.9363이다. [표 1]"}
{"patent_id": "10-2021-0071119", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "[표 1]과 같은 실험결과에서 알 수 있듯이, 빗줄기 등의 노이즈는 도 4의 (a)이미지로부터 잘 제거되었으며, 본 발명에 의한 인공지능 학습 장치로부터 도출된 도 4의(b)에 도시된 빗줄기가 제거된 이미지는 도 4의 (c)에 도 시된 원본 이미지와 유사함을 알 수 있다. 즉, 본 발명의 실시 예에 의하면 빗줄기가 포함된 이미지에서 빗줄 기를 효과적으로 제거할 수 있다. 도 5는 본 발명의 실시 예에 의한 노이즈 제거 시뮬레이션 결과를 나타내는 도면이다. 도 5의 (a)는 가상의 눈(snow)을 포함하는 이미지이다. 도 5의 (b)는 본 발명의 실시 예를 바탕으로, 도 5의 (a)에서 눈을 제거한 이미지이다. 도 5의 (c)는 가상의 눈이 추가되지 않은 상태의 원본 이미지이다. 도 5를 참조하면, 본 발명의 실시 예에 의하면, 눈과 같은 노이즈 또한 효율적으로 제거됨을 알 수 있다. 즉, 본 발명의 실시 예에 의하면, 빗줄기, 눈 등의 노이즈나 아티팩트들도 효율적으로 제거할 수 있다. 이상 설명한 내용을 통해 당업자라면 본 명세서의 기술사상을 일탈하지 아니하는 범위에서 다양한 변경 및 수정 이 가능함을 알 수 있을 것이다. 따라서, 본 명세서의 기술적 범위는 명세서의 상세한 설명에 기재된 내용으로 한정되는 것이 아니라 특허 청구의 범위에 의해 정하여져야만 할 것이다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2021-0071119", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시 예에 의한 이미지의 노이즈 제거를 위한 인공지능 학습 시스템을 나타내는 도면이다. 도 2는 본 발명의 실시 예에 의한 이미지의 노이즈 제거를 위한 인공지능 학습 방법을 나타내는 순서도이다. 도 3은 본 발명의 실시 예에 의한 심층 특징맵 추출 모듈을 나타내는 도면이다. 도 4 및 도 5는 실험 결과에 활용된 이미지를 나타내는 도면이다."}
