{"patent_id": "10-2022-0056744", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0157132", "출원번호": "10-2022-0056744", "발명의 명칭": "시계열 데이터를 활용한 인공지능 데이터 기계독해 정확도 향상 방법 및 장치", "출원인": "주식회사 웨이커", "발명자": "황규종"}}
{"patent_id": "10-2022-0056744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터를 가지고 있는 문서를 전처리하는 단계; 상기 전처리된 문서와 답을 얻고자 하는 데이터 및 해당 데이터의 시계열 데이터를 신경망 모델에 입력하는 단계; 및 상기 신경망 모델로부터 문서 내에 있는 질문의 답을 추출하는 단계를 포함하는,시계열 데이터를 활용한 데이터 기계독해 방법."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 시계열 데이터를 활용하여 데이터 기계독해를 수행하는 전자 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시계열 데이터를 활용하여 데이터 기계독해를 수행하는 전자 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 원문의 내용을 이해 하기 위해 기계독해가 많이 활용되고 있다. 이에 따라 기계독해의 정확성을 높이기 위 한 시도 및 연구들이 진행되고 있다."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "기계독해 수행시 시계열적인 특성을 지닌 데이터를 함께 처리하여 기계독해의 정확도를 높이고자 한다."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "시계열 데이터를 활용한 데이터 기계독해 방법은 데이터를 가지고 있는 문서를 전처리하는 단계; 상기 전처리된 문서와 답을 얻고자 하는 데이터 및 해당 데이터의 시계열 데이터를 신경망 모델에 입력하는 단계; 및 상기 신 경망 모델로부터 문서 내에 있는 질문의 답을 추출하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 데이터가 들어 있는 문서에서 기계독해를 수행할 때 추가적인 정보인 과거 시계열 데이터 및 질문을 함께 모델에 입력 값으로 넣음으로써 기계독해의 정확도를 높일 수 있다."}
{"patent_id": "10-2022-0056744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 시계열 데이터를 활용하여 데이터 기계독해를 수행하는 전자 장치및 방법에 관한 것이다. 일 실시예에 따르면, 본 발명은 시계열 데이터를 활용한 데이터 기계독해 방법은 데이터를 가지고 있는 문서를 전처리하는 단계; 상기 전처리된 문서와 답을 얻고자 하는 데이터 및 해당 데이터의 시계열 데이터를 신경망 모 델에 입력하는 단계; 및 상기 신경망 모델로부터 문서 내에 있는 질문의 답을 추출하는 단계를 포함할 수 있다. 상기 장치는 데이터가 들어 있는 문서에서 기계독해를 할 때, 추가적인 정보인 과거 시계열 데이터도 질문과 함 께 모델에 입력값으로 넣음으로써 기계독해의 정확도를 높일 수 있다. 도 1은 본 발명의 실시예에 따른 문서내 표가 텍스트로 변환되는 과정을 도시한 것이다. 도 1을 참조하면, 입력 된 문서문서는 표 제목과 표로 분류하는 전처리를 거치게 되고 표는 텍스트로 변환될 수 있다. 이를 통해 데이 터 종류, 과거 시계열 데이터, 표제목 및 표가 모두 텍스트 형태를 띠게 될 수 있다. 상기 텍스트 형태를 띤 데 이터는 모델에 입력값으로 들어갈 수 있다. 도 2은 본 발명의 실시예에 따른 텍스트 및 표로부터 질문에 대한 답을 얻는 과정을 도시한 것이다. 도 2을 참 조하면 신경망 모델은 질문을 통해 정답이 있는 표의 위치를 찾아낼 수 있고, 질문과 과거 시계열 데이터 값을 기반으로 해당 표에서 정답 값의 위치를 찾아내어 정답의 시작점과 끝점을 태깅할 수 있다. 이후 상기 태깅된 결과를 통해 최종적으로 질문에 대한 답이 있는 표의 위치를 파악하여 질문에 대한 답을 도출해 낼 수 있다. 상기 신경망 모델에 학습되는 시계열 데이터는 정답 값의 특성에 대한 학습을 바탕으로 정확도를 향상 시키며, 입력된 문서의 특징에 기반하여 정답 값의 근거를 추론할 수 있다. 일례로, 금융데이터는 시계열적인 특성을 가지고 있다. 재무데이터의 경우, 회사 설립 이후부터 축적된 수년 치 의 데이터가 쌓여 있다. 또한, 재무 데이터가 공개되는 사업보고서 등 공시 자료에는 지난 회계 결산기의 재무 데이터를 비교하여 작성한다. 이러한 특성에 맞춰 특정 금융 데이터를 추출하기 위해 기계독해를 할 경우 해당 금융 데이터의 과거 정보와 특정 금융데이터와 관계된 상위 혹은 하위 계정 과목의 금융데이터를 같이 제공해줌 으로써 기계독해의 정확도를 향상시킬 수 있다."}
{"patent_id": "10-2022-0056744", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 문서내 표가 텍스트로 변환되는 과정을 도시한 것이다. 도 2은 본 발명의 실시예에 따른 텍스트 및 표로부터 질문에 대한 답을 얻는 과정을 도시한 것이다. 도 3은 본 발명의 실시예에 따른 질문에 대한 답의 도출에 대한 흐름도를 도시한 것이다."}
