{"patent_id": "10-2023-0160244", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0163968", "출원번호": "10-2023-0160244", "발명의 명칭": "인공지능 기반의 혈당 예측 시스템 및 방법", "출원인": "주식회사 동운아나텍", "발명자": "장인수"}}
{"patent_id": "10-2023-0160244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 혈당변동성 추론 모델을 학습시키고, 타액당과 혈당 사이의 상관 관계를 상기 혈당변동성을 고려하여 추론하도록 혈당 추론 모델을 학습시키는 학습 모델링부; 대상자의 신체 지표와 타액당을 획득하는 대상자 정보 획득부; 상기 대상자의 신체 지표를 입력 파라미터로 상기 혈당변동성 추론 모델을 이용하여 상기 대상자의 혈당변동성을 추정하는 혈당변동성 추정부; 및 상기 대상자의 타액당과 추정된 혈당변동성을 입력 파라미터로 상기 혈당 추론 모델을 이용하여 상기 대상자의혈당을 예측하는 혈당 예측부를 포함하고, 상기 학습 모델링부는, 인슐린 저항성 및 인슐린 분비능과 상기 혈당변동성 사이의 상관 관계를 추론하여, 상기 혈당 추론 모델을 학습시키는 것을 특징으로 하는 혈당 예측 시스템."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "혈당 예측 시스템 및 그 방법이 개시된다. 일 실시예에 따르면 혈당 예측 시스템은, 신체 지표와 혈당변동성 사 이의 상관 관계를 추론하도록 혈당변동성 추론 모델을 학습시키고, 타액당과 혈당 사이의 상관 관계를 상기 혈당 변동성을 고려하여 추론하도록 혈당 추론 모델을 학습시키는 학습 모델링부; 대상자의 신체 지표와 타액당을 획 득하는 대상자 정보 획득부; 상기 대상자의 신체 지표를 입력 파라미터로 상기 혈당변동성 추론 모델을 이용하여 상기 대상자의 혈당변동성을 추정하는 혈당변동성 추정부; 및 상기 대상자의 타액당과 추정된 혈당변동성을 입력 파라미터로 상기 혈당 추론 모델을 이용하여 상기 대상자의 혈당을 예측하는 혈당 예측부를 포함할 수 있다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "아래의 실시예들은 타액당으로부터 혈당을 예측하는 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "당뇨병의 진단을 위한 지표로는 혈중의 포도당 농도인 혈당 또는 요당이 일반적으로 이용되고 있다. 그러나 요당 검사로는, 당뇨병 환자와 건강한 사람과의 경계형인 내당능이상자가 당뇨병 환자로 분류되기 때문 에, 당뇨병 진단의 정확도가 저하되는 문제를 갖는다. 이에, 당뇨병 진단의 정확도를 보장하는 혈당이 주요하게 이용되고 있다. 하지만, 이러한 혈당을 측정하기 위 해서는 혈액을 침습적인 방법으로 채취할 수 밖에 없는 한계가 존재하는 바, 혈액 채취의 번거로움 및 통증 등 의 단점이 발생된다. 따라서, 설명된 혈당 측정의 한계를 극복하고 단점을 해결하기 위한 기술이 제안될 필요가 있다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 실시예들은 혈당 측정이 갖는 혈액을 침습적인 방법으로 채취할 수 밖에 없는 한계를 극복하고 혈액 채취의 번거로움 및 통증 발생 등의 단점을 해결하고자, 타액당으로부터 혈당을 예측하는 시스템 및 그 방법을 제안한 다. 보다 상세하게, 일 실시예들은 타액당과 혈당 사이의 상관 관계를 추론하는 실험들을 인공지능 기반으로 학습하 여 구축된 혈당 추론 모델을 이용함으로써 타액당으로부터 혈당을 예측하는 시스템 및 그 방법을 제안한다. 특히, 일 실시예들은 타액당과 혈당 사이의 상관 관계에 영향을 미치는 요인인 혈당변동성을 고려하여 혈당 추 론 모델을 구축하는 시스템 및 그 방법을 제안한다.이 때, 일 실시예들은 혈당변동성 측정의 번거로움 및 복잡함의 단점을 해결하고자, 대상자의 신체 지표와 혈당 변동성 사이의 상관 관계를 추론하는 실험들을 인공지능 기반으로 학습하여 구축된 혈당변동성 추론 모델을 이 용함으로써 신체 지표로부터 혈당변동성을 추정하는 시스템 및 그 방법을 제안한다. 다만, 본 발명이 해결하고자 하는 기술적 과제들은 상기 과제로 한정되는 것이 아니며, 본 발명의 기술적 사상 및 영역으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따르면, 혈당 예측 시스템은, 신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 혈당변동성 추론 모델을 학습시키고, 타액당과 혈당 사이의 상관 관계를 상기 혈당변동성을 고려하여 추론하도록 혈당 추론 모델을 학습시키는 학습 모델링부; 대상자의 신체 지표와 타액당을 획득하는 대상자 정보 획득부; 상기 대상자 의 신체 지표를 입력 파라미터로 상기 혈당변동성 추론 모델을 이용하여 상기 대상자의 혈당변동성을 추정하는 혈당변동성 추정부; 및 상기 대상자의 타액당과 추정된 혈당변동성을 입력 파라미터로 상기 혈당 추론 모델을 이용하여 상기 대상자의 혈당을 예측하는 혈당 예측부를 포함할 수 있다. 일 측에 따르면, 상기 학습 모델링부는, 상기 신체 지표와 HOMA-IR및 HOMA β-cell 사이의 상관 관계를 추론하 고, 상기 HOMA-IR및 HOMA β-cell과 상기 혈당변동성 사이의 상관 관계를 추론하도록 상기 혈당변동성 추론 모 델을 학습시키는 것을 특징으로 할 수 있다. 다른 일 측에 따르면, 상기 학습 모델링부는, 상기 HOMA-IR및 HOMA β-cell로 계산되는 인슐린 저항성 및 인슐 린 분비능과 상기 혈당변동성 사이의 상관 관계를 추론하도록 상기 혈당변동성 추론 모델을 학습시키는 것을 특 징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 학습 모델링부는, 상기 신체 지표와 상기 혈당변동성 사이의 상관 관계를 추론하 는 실험들을 인공지능 기반으로 학습하여 상기 혈당변동성 추론 모델을 구축하고, 상기 타액당과 상기 혈당 사 이의 상관 관계를 상기 혈당변동성을 고려하여 추론하는 실험들을 인공지능 기반으로 학습하여 상기 혈당 추론 모델을 구축하는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 대상자의 신체 지표는, 상기 대상자의 체질량지수(BMI) 및 허리 둘레를 포함하는 것을 특징으로 할 수 있다. 일 실시예에 따르면, 혈당 예측 방법은, 대상자의 신체 지표와 타액당을 획득하는 단계; 상기 대상자의 신체 지 표를 입력 파라미터로 혈당변동성 추론 모델-상기 혈당변동성 추론 모델은 신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 학습됨-을 이용하여 상기 대상자의 혈당변동성을 추정하는 단계; 및 상기 대상자의 타액당과 추정된 혈당변동성을 입력 파라미터로 혈당 추론 모델-상기 혈당 추론 모델은 타액당과 혈당 사이의 상관 관계 를 상기 혈당변동성을 고려하여 추론하도록 학습됨-을 이용하여 상기 대상자의 혈당을 예측하는 단계를 포함할 수 있다. 일 측에 따르면, 상기 혈당변동성 추론 모델은, 상기 신체 지표와 HOMA-IR및 HOMA β-cell 사이의 상관 관계를 추론하고, 상기 HOMA-IR및 HOMA β-cell과 상기 혈당변동성 사이의 상관 관계를 추론하도록 학습되는 것을 특징 으로 할 수 있다. 다른 일 측에 따르면, 상기 혈당변동성 추론 모델은, 상기 HOMA-IR및 HOMA β-cell로 계산되는 인슐린 저항성 및 인슐린 분비능과 상기 혈당변동성 사이의 상관 관계를 추론하도록 학습되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 혈당 예측 방법은, 상기 신체 지표와 상기 혈당변동성 사이의 상관 관계를 추론 하는 실험들을 인공지능 기반으로 학습하여 상기 혈당변동성 추론 모델을 구축하는 단계; 및 상기 타액당과 상 기 혈당 사이의 상관 관계를 상기 혈당변동성을 고려하여 추론하는 실험들을 인공지능 기반으로 학습하여 상기 혈당 추론 모델을 구축하는 단계를 더 포함하는 것을 특징으로 할 수 있다. 일 실시예에 따르면, 혈당변동성 추정 시스템은, 신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 혈당 변동성 추론 모델을 학습시키는 학습 모델링부; 대상자의 신체 지표를 획득하는 대상자 정보 획득부; 및 상기 대상자의 신체 지표를 입력 파라미터로 상기 혈당변동성 추론 모델을 이용하여 상기 대상자의 혈당변동성을 추 정하는 혈당변동성 추정부를 포함할 수 있다.일 측에 따르면, 상기 학습 모델링부는, 상기 신체 지표와 HOMA-IR및 HOMA β-cell 사이의 상관 관계를 추론하 고, 상기 HOMA-IR및 HOMA β-cell과 상기 혈당변동성 사이의 상관 관계를 추론하도록 상기 혈당변동성 추론 모 델을 학습시키는 것을 특징으로 할 수 있다. 다른 일 측에 따르면, 상기 학습 모델링부는, 상기 HOMA-IR및 HOMA β-cell로 계산되는 인슐린 저항성 및 인슐 린 분비능과 상기 혈당변동성 사이의 상관 관계를 추론하도록 상기 혈당변동성 추론 모델을 학습시키는 것을 특 징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 학습 모델링부는, 상기 신체 지표와 상기 혈당변동성 사이의 상관 관계를 추론하 는 실험들을 인공지능 기반으로 학습하여 상기 혈당변동성 추론 모델을 구축하는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 상기 대상자의 신체 지표는, 상기 대상자의 체질량지수(BMI) 및 허리 둘레를 포함하는 것을 특징으로 할 수 있다. 일 실시예에 따르면, 혈당변동성 추정 방법은, 대상자의 신체 지표를 획득하는 단계; 및 상기 대상자의 신체 지 표를 입력 파라미터로 혈당변동성 추론 모델-상기 혈당변동성 추론 모델은 신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 학습됨-을 이용하여 상기 대상자의 혈당변동성을 추정하는 단계를 포함할 수 있다. 일 측에 따르면, 상기 혈당변동성 추론 모델은, 상기 신체 지표와 HOMA-IR및 HOMA β-cell 사이의 상관 관계를 추론하고, 상기 HOMA-IR및 HOMA β-cell과 상기 혈당변동성 사이의 상관 관계를 추론하도록 학습되는 것을 특징 으로 할 수 있다. 다른 일 측에 따르면, 상기 혈당변동성 추론 모델은, 상기 HOMA-IR및 HOMA β-cell로 계산되는 인슐린 저항성 및 인슐린 분비능과 상기 혈당변동성 사이의 상관 관계를 추론하도록 학습되는 것을 특징으로 할 수 있다. 또 다른 일 측에 따르면, 혈당변동성 추정 방법은, 상기 신체 지표와 상기 혈당변동성 사이의 상관 관계를 추론 하는 실험들을 인공지능 기반으로 학습하여 상기 혈당변동성 추론 모델을 구축하는 단계를 더 포함하는 것을 특 징으로 할 수 있다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시예들은 타액당으로부터 혈당을 예측하는 시스템 및 그 방법을 제안함으로써, 혈당 측정이 갖는 혈액을 침습적인 방법으로 채취할 수 밖에 없는 한계를 극복하고 혈액 채취의 번거로움 및 통증 발생 등의 단점을 해결 할 수 있다. 보다 상세하게, 일 실시예들은 타액당과 혈당 사이의 상관 관계를 추론하는 실험들을 인공지능 기반으로 학습하 여 구축된 혈당 추론 모델을 이용함으로써 타액당으로부터 혈당을 예측하는 시스템 및 그 방법을 제안할 수 있 다. 특히, 일 실시예들은 타액당과 혈당 사이의 상관 관계에 영향을 미치는 요인인 혈당변동성을 고려하여 혈당 추 론 모델을 구축하는 시스템 및 그 방법을 제안할 수 있다. 이 때, 일 실시예들은 대상자의 신체 지표와 혈당변동성 사이의 상관 관계를 추론하는 실험들을 인공지능 기반 으로 학습하여 구축된 혈당변동성 추론 모델을 이용함으로써 신체 지표로부터 혈당변동성을 추정하는 시스템 및 그 방법을 제안하고, 이를 통해 혈당변동성 측정의 번거로움 및 복잡함의 단점을 해결할 수 있다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "다만, 본 발명의 효과는 상기 효과들로 한정되는 것이 아니며, 본 발명의 기술적 사상 및 영역으로부터 벗어나 지 않는 범위에서 다양하게 확장될 수 있다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 그러나 본 발명이 실시예들에 의해 제 한되거나 한정되는 것은 아니다. 또한, 각 도면에 제시된 동일한 참조 부호는 동일한 부재를 나타낸다. 또한, 본 명세서에서 사용되는 용어(Terminology)들은 본 발명의 바람직한 실시예를 적절히 표현하기 위해 사용 된 용어들로서, 이는 시청자, 운용자의 의도 또는 본 발명이 속하는 분야의 관례 등에 따라 달라질 수 있다. 따라서, 본 용어들에 대한 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 예컨대, 본 명세 서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 또한, 본 명세서에서 사용되는 \"포함 한다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 또한, 본 명세서에서 제1, 제2 등의 용어가 다양한 영역, 방향, 형상 등을 기술하기 위해서 사용되었지만, 이들 영역, 방향, 형상이 이 같은 용어들에 의해서 한정되어서는 안 된다. 이들 용어들은 단지 어느 소정 영역, 방향 또는 형상을 다른 영역, 방 향 또는 형상과 구별시키기 위해서 사용되었을 뿐이다. 따라서, 어느 한 실시예에서 제1 부분으로 언급된 부분 이 다른 실시예에서는 제2 부분으로 언급될 수도 있다. 또한, 본 발명의 다양한 실시 예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조 및 특성은 일 실시예에 관련하여 본 발명의 기술적 사상 및 범위를 벗어 나지 않으면서 다른 실시 예로 구현될 수 있다. 또한, 제시된 각각의 실시예 범주에서 개별 구성요소의 위치, 배치, 또는 구성은 본 발명의 기술적 사상 및 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 이하, 타액당은 타액에 포함된 포도당(Glucose)을 의미하며, 혈당은 혈액에 포함된 포도당을 의미한다. 또한, 이하 타액당을 획득한다는 것은 타액당에 대한 정보(예컨대 타액당의 농도, 지수, 수치 등)를 획득하는 것을 의 미하며, 혈당을 예측한다는 것은 혈당에 대한 정보(예컨대 혈당의 농도, 지수, 수치 등)을 예측하는 것을 의미 한다. 도 1은 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 도 1의 네트워크 환경은 복수의 전자 기기들 (110, 120, 130, 140, 150), 서버 및 네트워크를 포함하는 예를 나타내고 있다. 이러한 도 1은 발 명의 설명을 위한 일례로 전자 기기의 수나 서버의 수가 도 1과 같이 한정되는 것은 아니다. 복수의 전자 기기들(110, 120, 130, 140, 150)은 검체 대상자들이 각각 소지한 단말들로서, 복수의 전자 기기들 (110, 120, 130, 140, 150) 각각은, 대상자의 타액당을 채취하는 검체 측정 시스템으로서 채취 장치, 바이 오센서 및 측정 장치를 포함할 수 있다. 채취 장치는 검체(예컨대, 타액)를 수집하기 위한 장치로 검체 수집부, 필터 및 압축 튜브(compression tube)를 포함할 수 있다. 검체가 타액인 경우 채취 장치는 수집된 타액으로부터 압축 튜브 내에서 필터를 통해 간섭 물질을 제거하고, 간섭 물질이 제거된 타액을 외부 즉, 바이오 센서로 제공할 수 있다. 바이오센서는 채취 장치에 의해 채취된 검체(예컨대 타액)가 채취 장치를 통해 삽입되는 경우 간섭 물질이 제거된 검체로부터 측정하고자 하는 정보(예컨대, 포도당(Glucose))을 센싱하는 기능을 수행하는 구성요소로서, 측정 장치에 바이오센서 스트립이 삽입되고 측정 장치로부터 수신되는 검체인식신호에 기초하여 검체를 인식하고, 검체인식신호와 별도로 인가되는 검체측정신호를 통해 검체에 포함된 포도당에 대한 응답신호를 측정장치로 제공할 수 있다. 측정 장치는 바이오센서가 삽입되는 것을 인식하여 바이오센서에 검체인식신호를 제공함으로써, 바이오센서에 검체가 접촉되었는지 판단한 후 검체가 접촉된 것으로 판단되면, 검체측정신호를 제공하여측정하고자 하는 검체의 응답신호를 수신하고 검체를 측정할 수 있다. 그리고, 측정 장치는 네트워크를 통해 서버와 통신할 수 있도록 통신 모듈을 포함할 수 있다. 그러나 측정 장치를 각각 포함하는 복수의 전자 기기들(110, 120, 130, 140, 150)은 직접적으로 네트워크 에 접속하여 서버와 통신하는 대신에, 대상자가 소지한 단말(예컨대, 스마트폰(smart phone), 휴대폰, 태블릿 PC, 내비게이션, 컴퓨터, 노트북, 디지털방송용 단말, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player) 등)을 경유하여 네트워크에 접속하여 서버와 통신하도록 구성될 수 있다. 통신 방식은 제한되지 않으며, 네트워크가 포함할 수 있는 통신망(일례로, 이동통신망, 유선 인터넷, 무선 인터넷, 방송망)을 활용하는 통신 방식뿐만 아니라 기기들간의 근거리 무선 통신 역시 포함될 수 있다. 예를 들어, 네트워크는, PAN(personal area network), LAN(local area network), CAN(campus area network), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷 등의 네트워크 중 하나 이상의 임의의 네트워크를 포함할 수 있다. 또한, 네트워크는 버스 네트워크, 스타 네트워크, 링 네트워크, 메쉬 네트워크, 스타-버스 네트워크, 트리 또는 계층적(hierarchical) 네트워크 등을 포함하는 네트 워크 토폴로지 중 임의의 하나 이상을 포함할 수 있으나, 이에 제한되지 않는다. 이상 복수의 전자 기기들(110, 120, 130, 140, 150) 각각이 채취 장치, 바이오센서 및 측정 장치 를 포함하는 것으로 설명되었으나, 이에 제한되거나 한정되지 않고, 대상자의 신체 지표 및 타액당과 관련 된 정보를 저장하고 있는 단말(예컨대, 스마트폰(smart phone), 휴대폰, 태블릿 PC, 내비게이션, 컴퓨터, 노트 북, 디지털방송용 단말, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player) 등)일 수도 있 다. 서버는 복수의 전자 기기들(110, 120, 130, 140, 150)과 네트워크를 통해 통신하여 복수의 전자 기기 들(110, 120, 130, 140, 150) 각각의 측정 장치로부터 측정된 검체(타액)에 대한 정보를 수신하고, 수신된 검체(타액)에 대한 정보에 기초하여 대상자의 혈당을 예측하는 혈당 예측 서비스를 제공하는 컴퓨터 장치 또는 복수의 컴퓨터 장치들로 구현될 수 있다. 즉, 복수의 전자 기기들(110, 120, 130, 140, 150) 각각은, 기 설치된 운영체제(Operating System, OS)나 적어 도 하나의 프로그램(일례로 브라우저나 상기 설치된 어플리케이션)의 제어에 따라 서버에 접속하여 서버 가 제공하는 혈당 예측 서비스를 제공받을 수 있다. 도 2는 일 실시예에 따른 전자 기기 및 서버의 내부 구성을 설명하기 위한 블록도이다. 도 2에서는 혈당 예측 서비스를 제공받는 대상자가 소지한 전자 기기에 대한 예로서 제1 전자 기기, 그리고 제1 전자 기기 와 통신하여 혈당 예측 서비스를 제공하는 주체인 서버의 내부 구성을 설명한다. 이하, 제1 전자 기기 에 대한 설명의 편의를 위해 제1 전자 기기에 포함되는 채취 장치, 바이오센서 및 측정 장 치를 생략된다. 제1 전자 기기와 서버는 메모리(211, 221), 프로세서(212, 222), 통신 모듈(213, 223) 그리고 입출 력 인터페이스(214, 224)를 포함할 수 있다. 메모리(211, 221)는 컴퓨터에서 판독 가능한 기록 매체로서, RAM(random access memory), ROM(read only memory) 및 디스크 드라이브와 같은 비소멸성 대용량 기록장치 (permanent mass storage device)를 포함할 수 있다. 또한, 메모리(211, 221)에는 운영체제나 적어도 하나의 프로그램 코드(일례로 제1 전자 기기에 설치되어 구동되는 어플리케이션 등을 위한 코드)가 저장될 수 있 다. 이러한 소프트웨어 구성요소들은 메모리(211, 221)와는 별도의 컴퓨터에서 판독 가능한 기록 매체로부터 로딩될 수 있다. 별도의 컴퓨터에서 판독 가능한 기록 매체는 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 컴퓨터에서 판독 가능한 기록 매체를 포함할 수 있다. 다른 실시예에서 소프트웨 어 구성요소들은 컴퓨터에서 판독 가능한 기록 매체가 아닌 통신 모듈(213, 223)을 통해 메모리(211, 221)에 로 딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 네트워크를 통해 제공하는 파일들에 의해 설치되는 프로그램(일례로 상술한 어플리케 이션)에 기반하여 메모리(211, 221)에 로딩될 수 있다. 프로세서(212, 222)는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하 도록 구성될 수 있다. 명령은 메모리(211, 221) 또는 통신 모듈(213, 223)에 의해 프로세서(212, 222)로 제공 될 수 있다. 예를 들어 프로세서(212, 222)는 메모리(211, 221)와 같은 기록 장치에 저장된 프로그램 코드에따라 수신되는 명령을 실행하도록 구성될 수 있다. 통신 모듈(213, 223)은 네트워크를 통해 제1 전자 기기와 서버가 서로 통신하기 위한 기능을 제 공할 수 있으며, 다른 전자 기기(일례로 제2 전자 기기, 제3 전자 기기, 제4 전자 기기, 제5 전 자기기 등) 또는 다른 서버와 통신하기 위한 기능을 제공할 수 있다. 일례로, 제1 전자 기기의 프로 세서가 메모리와 같은 기록 장치에 저장된 프로그램 코드에 따라 생성한 요청(예컨대 혈당 예측 서비 스 요청)이 통신 모듈의 제어에 따라 네트워크를 통해 서버로 전달될 수 있다. 역으로, 서버 의 프로세서의 제어에 따라 제공되는 제어 신호나 명령, 콘텐츠, 파일 등이 통신 모듈과 네트워 크를 거쳐 제1 전자 기기의 통신 모듈을 통해 제1 전자 기기로 수신될 수 있다. 예를 들 어 통신 모듈을 통해 수신된 서버의 제어 신호나 명령 등은 프로세서나 메모리로 전달될 수 있고, 콘텐츠나 파일 등은 제1 전자 기기가 더 포함할 수 있는 저장 매체로 저장될 수 있다. 입출력 인터페이스는 입출력 장치와의 인터페이스를 위한 수단일 수 있다. 예를 들어, 입력 장치는 키보드 또는 마우스 등의 장치를, 그리고 출력 장치는 어플리케이션의 통신 세션을 표시하기 위한 디스플레이와 같은 장치를 포함할 수 있다. 다른 예로 입출력 인터페이스는 터치스크린과 같이 입력과 출력을 위한 기 능이 하나로 통합된 장치와의 인터페이스를 위한 수단일 수도 있다. 보다 구체적인 예로, 제1 전자 기기 의 프로세서는 메모리에 로딩된 컴퓨터 프로그램의 명령을 처리함에 있어서 서버나 제2 전자 기 기가 제공하는 데이터를 이용하여 구성되는 서비스 화면이나 콘텐츠가 입출력 인터페이스를 통해 디 스플레이에 표시될 수 있다. 입출력 인터페이스 또한 마찬가지로 서버의 프로세서가 메모리 에 로딩된 컴퓨터 프로그램의 명령을 처리함에 있어 서버가 제공하는 데이터를 이용하여 구성되는 정 보를 출력할 수 있다. 또한, 다른 실시예들에서 제1 전자 기기 및 서버는 도 2의 구성요소들보다 더 많은 구성요소들을 포 함할 수도 있다. 그러나, 대부분의 종래기술적 구성요소들을 명확하게 도시할 필요성은 없다. 이하에서는 혈당 예측 서비스를 제공하는 혈당 예측 방법 및 시스템의 구체적인 실시예를 설명하기로 한다. 도 3은 일 실시예에 따른 서버의 프로세서에 구현되는 혈당 예측 시스템의 예를 도시한 블록도이고, 도 4는 일 실시예에 따른 혈당 예측 방법을 도시한 플로우 차트이며, 도 5는 일 실시예에 따른 혈당 예측 방법에서 이용하 는 혈당변동성 추론 모델을 설명하기 위한 개념도이다. 일 실시예에 따른 서버에는 컴퓨터로 구현되는 혈당 예측 시스템이 구성될 수 있다. 서버는 클라이 언트(Client)인 복수의 전자 기기들(110, 120, 130, 140, 150)을 대상으로 혈당 예측 서비스를 제공하는 주체로 서, 도 4에 도시된 단계들(S410 내지 S430)을 수행함으로써 혈당 예측 서비스를 복수의 전자 기기들(110, 120, 130, 140, 150) 각각에 제공할 수 있다. 서버가 도 4에 따른 혈당 예측 방법을 수행할 수 있도록, 서버의 프로세서는 구성요소로서 도 3 에 도시된 바와 같이, 학습 모델링부, 대상자 정보 획득부, 혈당변동성 추정부 및 혈당 예측부 를 포함할 수 있다. 실시예에 따라 프로세서의 구성요소들은 선택적으로 프로세서에 포함되거 나 제외될 수도 있다. 또한, 실시예에 따라 프로세서의 구성요소들은 프로세서의 기능의 표현을 위 해 분리 또는 병합될 수도 있다. 예컨대, 프로세서의 구성요소들 중 적어도 일부는 제1 대상자의 단말인 제1 전자 기기에 포함되는 프로세서에 구현되거나, 제2 대상자의 단말인 제2 전자 기기에 포함 되는 프로세서에 구현될 수 있다. 이러한 프로세서 및 프로세서의 구성요소들은 도 4의 혈당 예측 방법이 포함하는 단계들(S410 내지 S430)을 수행하도록 서버를 제어할 수 있다. 예를 들어, 프로세서 및 프로세서의 구성요소들은 메모리가 포함하는 운영체제의 코드와 적어도 하나의 프로그램의 코드에 따른 명령(instruction)을 실행하 도록 구현될 수 있다. 여기서, 프로세서의 구성요소들은 서버에 저장된 프로그램 코드가 제공하는 명령에 따라 프로세서 에 의해 수행되는 프로세서의 서로 다른 기능들(different functions)의 표현들일 수 있다. 예를 들 어, 대상자의 혈당을 예측하는 프로세서의 기능적 표현으로서 혈당 예측부가 이용될 수 있다. 프로세서는 단계(S410) 이전에, 서버의 제어와 관련된 명령이 로딩된 메모리로부터 필요한 명령 을 읽어드릴 수 있다(도면 상 별도의 단계로 도시되지 않음). 이 경우, 상기 읽어드린 명령은 프로세서가이후 설명될 단계들(S410 내지 S430)을 실행하도록 제어하기 위한 명령을 포함할 수 있다. 또한, 단계(S410) 이전에 학습 모델링부는, 신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 혈당 변동성 추론 모델을 학습시켜 미리 구축해두고, 타액당과 혈당 사이의 상관 관계를 혈당변동성을 고려하여 추론 하도록 혈당 추론 모델을 학습시켜 미리 구축해둘 수 있다. 타액당과 혈당 사이의 상관 관계는 혈당변동성에 의해 영향을 받는다. 따라서, 타액당과 혈당 사이의 상관 관 계가 정확하게 추론 및 정의되기 위해서는 혈당변동성이 고려되어야 한다. 한편, 신체 지표인 체질량지수(BMI)와 허리 둘레는 HOMA-IR및 HOMA β-cell과 상관 관계를 갖는다(이하, 신체 지표는 체질량지수(BMI)와 허리 둘레를 대표적으로 포함함). 또한, 인슐린 저항성 및 인슐린 분비능은 HOMA-IR 및 HOMA β-cell로부터 계산될 수 있으며, 인슐린 저항성 및 인슐린 분비능은 혈당변동성과 상관 관계를 갖는다. 이러한 특성을 이용하여, 학습 모델링부는 타액당과 혈당 사이의 상관 관계를 혈당변동성을 고려하여 추론 하는 실험들을 인공지능 기반으로 학습하여 혈당 추론 모델을 구축하는 가운데, 혈당 추론 모델에 반영할 혈당 변동성을 추론하는 혈당변동성 추론 모델도 구축할 수 있다. 예를 들어, 학습 모델링부는 도 5에 도시된 바와 같이 신체 지표와 HOMA-IR및 HOMA β-cell 사이의 상관 관계를 추론하고, HOMA-IR및 HOMA β-cell로 계산되는 인슐린 저항성 및 인슐린 분비능과 혈당변동성 사이의 상관 관계를 추론하는 혈당변동성 추론 모 델을 실험들을 통해 학습시켜 구축할 수 있다. 즉, 학습 모델링부는 신체 지표와 혈당변동성 사이의 상관 관계를 추론하는 실험들을 인공지능 기반으로 학습하여 혈당변동성 추론 모델을 구축할 수 있으며, 타액당과 혈당 사이의 상관 관계를 혈당변동성을 고려하여 추론하는 실험들을 인공지능 기반으로 학습하여 혈당 추론 모델을 구축할 수 있다. 이와 같은 혈당변동성 추론 모델 및 혈당 추론 모델 각각의 학습 과정에는 공지된 다양한 기계학습 알고리즘이 사용될 수 있다. 단계(S410)에서 대상자 정보 획득부는, 대상자의 신체 지표와 타액당을 획득할 수 있다. 예컨대, 대상자 정보 획득부는 전술된 바와 같이 복수의 전자 기기들(110, 120, 130, 140, 150) 각각의 측정 장치를 통해 측정된 타액에 대한 정보를 수신하여 획득할 수 있으며, 복수의 전자 기기들(110, 120, 130, 140, 150) 각 각으로부터 대상자들 각각의 신체 지표를 입력 받아 획득할 수 있다. 단계(S420)에서 혈당변동성 추정부는, 대상자의 신체 지표를 입력 파라미터로 혈당변동성 추론 모델을 이 용하여 대상자의 혈당변동성을 추정할 수 있다. 단계(S430)에서 혈당 예측부는, 대상자의 타액당과 추정된 혈당변동성을 입력 파라미터로 혈당 추론 모델 을 이용하여 대상자의 혈당을 예측할 수 있다. 예측된 대상자의 혈당은, 대상자에 대응하는 전자 기기로 제공 될 수 있다. 이처럼 일 실시예에 따른 혈당 예측 시스템 및 방법은, 혈당 추론 모델을 이용하여 타액당으로부터 혈당을 예측 함으로써 혈액을 침습적인 방법으로 채취할 수 밖에 없는 한계를 극복하고 혈액 채취의 번거로움 및 통증 발생 등의 단점을 해결할 수 있으며, 혈당 추론 모델에서 혈당변동성을 고려함으로써 혈당 예측의 정확도를 향상시킬 수 있다. 또한, 일 실시예에 따른 혈당 예측 시스템 및 방법은, 혈당 추론 모델에 입력 파라미터로 사용할 혈당변동성을 혈당변동성 추론 모델을 통해 추정함으로써 혈당변동성 측정의 번거로움 및 복잡함의 단점을 해결할 수 있다. 이상, 혈당 예측 시스템 및 그 방법이 설명되었으나, 본 발명은 혈당변동성 추정만을 독립적으로 응용하여 사용 할 수 있다. 이에 대한 상세한 설명은 도 6 내지 7을 참조하여 기재하기로 한다. 또한, 이상 타액당으로부터 혈당을 예측하는 것이 설명되었으나, 혈당으로부터 타액당을 예측하는 것 역시 일 실시예에 따른 혈당 예측 시스템을 통해 가능할 수 있다. 이러한 경우 대상자 정보 획득부가 타액당 대신 에 혈당을 획득함에 응답하여 혈당 예측부에서는, 획득된 혈당으로부터 타액당을 예측할 수 있다. 도 6은 일 실시예에 따른 서버의 프로세서에 구현되는 혈당변동성 추정 시스템의 예를 도시한 블록도이고, 도 7 은 일 실시예에 따른 혈당변동성 추정 방법을 도시한 플로우 차트이다.도 6 내지 7을 참조하면, 일 실시예에 따른 서버에는 컴퓨터로 구현되는 혈당변동성 추정 시스템이 구성될 수 있다. 서버는 클라이언트(Client)인 복수의 전자 기기들(110, 120, 130, 140, 150)을 대상으로 혈당 변동성 추정 서비스를 제공하는 주체로서, 도 7에 도시된 단계들(S710 내지 S720)을 수행함으로써 혈당 추정 서 비스를 복수의 전자 기기들(110, 120, 130, 140, 150) 각각에 제공할 수 있다. 서버가 도 7에 따른 혈당변동성 추정 방법을 수행할 수 있도록, 서버의 프로세서는 구성요소로 서 도 6에 도시된 바와 같이, 학습 모델링부, 대상자 정보 획득부 및 혈당변동성 추정부를 포함 할 수 있다. 실시예에 따라 프로세서의 구성요소들은 선택적으로 프로세서에 포함되거나 제외될 수 도 있다. 또한, 실시예에 따라 프로세서의 구성요소들은 프로세서의 기능의 표현을 위해 분리 또는 병합될 수도 있다. 예컨대, 프로세서의 구성요소들 중 적어도 일부는 제1 대상자의 단말인 제1 전자 기기 에 포함되는 프로세서에 구현되거나, 제2 대상자의 단말인 제2 전자 기기에 포함되는 프로세서 에 구현될 수 있다. 이러한 프로세서 및 프로세서의 구성요소들은 도 7의 혈당변동성 추정 방법이 포함하는 단계들(S710 내지 S720)을 수행하도록 서버를 제어할 수 있다. 예를 들어, 프로세서 및 프로세서의 구성요 소들은 메모리가 포함하는 운영체제의 코드와 적어도 하나의 프로그램의 코드에 따른 명령(instruction)을 실행하도록 구현될 수 있다. 여기서, 프로세서의 구성요소들은 서버에 저장된 프로그램 코드가 제공하는 명령에 따라 프로세서 에 의해 수행되는 프로세서의 서로 다른 기능들(different functions)의 표현들일 수 있다. 예를 들 어, 대상자의 혈당변동성을 추정하는 프로세서의 기능적 표현으로서 혈당변동성 추정부가 이용될 수 있다. 프로세서는 단계(S710) 이전에, 서버의 제어와 관련된 명령이 로딩된 메모리로부터 필요한 명령 을 읽어드릴 수 있다(도면 상 별도의 단계로 도시되지 않음). 이 경우, 상기 읽어드린 명령은 프로세서가 이후 설명될 단계들(S710 내지 S720)을 실행하도록 제어하기 위한 명령을 포함할 수 있다. 또한, 단계(S710) 이전에 학습 모델링부는, 신체 지표와 혈당변동성 사이의 상관 관계를 추론하도록 혈당 변동성 추론 모델을 학습시켜 미리 구축해둘 수 있다. 신체 지표인 체질량지수(BMI)와 허리 둘레는 HOMA-IR및 HOMA β-cell과 상관 관계를 갖는다(이하, 신체 지표는 체질량지수(BMI)와 허리 둘레를 대표적으로 포함함). 또한, 인슐린 저항성 및 인슐린 분비능은 HOMA-IR및 HOMA β-cell로부터 계산될 수 있으며, 인슐린 저항성 및 인슐린 분비능은 혈당변동성과 상관 관계를 갖는다. 이러한 특성을 이용하여, 학습 모델링부는 혈당변동성을 추론하는 혈당변동성 추론 모델을 구축할 수 있다. 예를 들어, 학습 모델링부는 도 5에 도시된 바와 같이 신체 지표와 HOMA-IR및 HOMA β-cell 사이의 상관 관계를 추론하고, HOMA-IR및 HOMA β-cell로 계산되는 인슐린 저항성 및 인슐린 분비능과 혈당변동성 사이의 상관 관계를 추론하는 혈당변동성 추론 모델을 실험들을 통해 학습시켜 구축할 수 있다. 즉, 학습 모델링부는 신체 지표와 혈당변동성 사이의 상관 관계를 추론하는 실험들을 인공지능 기반으로 학습하여 혈당변동성 추론 모델을 구축할 수 있다. 이와 같은 혈당변동성 추론 모델의 학습 과정에는 공지된 다양한 기계학습 알고리즘이 사용될 수 있다. 단계(S710)에서 대상자 정보 획득부는, 대상자의 신체 지표를 획득할 수 있다. 예컨대, 대상자 정보 획득 부는 복수의 전자 기기들(110, 120, 130, 140, 150) 각각으로부터 대상자들 각각의 신체 지표를 입력 받아 획득할 수 있다. 단계(S720)에서 혈당변동성 추정부는, 대상자의 신체 지표를 입력 파라미터로 혈당변동성 추론 모델을 이 용하여 대상자의 혈당변동성을 추정할 수 있다. 이처럼 일 실시예에 따른 혈당변동성 추정 시스템 및 방법은, 혈당변동성을 혈당변동성 추론 모델을 통해 추정 함으로써 혈당변동성 측정의 번거로움 및 복잡함의 단점을 해결할 수 있다. 설명된 바와 같이 추정된 혈당변동성은 전술된 혈당 추정 시스템 및 그 방법에서 활용될 뿐만 아니라, 다양한 작업 및 분야에서 활용될 수 있다.이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로 세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크로컴 퓨터, FPA(field programmable array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령 (instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상 의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치 는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치에 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터 는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등 을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판 독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도 록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다."}
{"patent_id": "10-2023-0160244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2023-0160244", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 도 2는 일 실시예에 따른 전자 기기 및 서버의 내부 구성을 설명하기 위한 도면이다.도 3은 일 실시예에 따른 서버의 프로세서에 구현되는 혈당 예측 시스템의 예를 도시한 블록도이다. 도 4는 일 실시예에 따른 혈당 예측 방법을 도시한 플로우 차트이다. 도 5는 일 실시예에 따른 혈당 예측 방법에서 이용하는 혈당변동성 추론 모델을 설명하기 위한 개념도이다. 도 6은 일 실시예에 따른 서버의 프로세서에 구현되는 혈당변동성 추정 시스템의 예를 도시한 블록도이다. 도 7은 일 실시예에 따른 혈당변동성 추정 방법을 도시한 플로우 차트이다."}
