{"patent_id": "10-2023-0118730", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0036351", "출원번호": "10-2023-0118730", "발명의 명칭": "CA-TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법", "출원인": "(주)바이브컴퍼니", "발명자": "안요셉"}}
{"patent_id": "10-2023-0118730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "딥러닝 프로그램을 포함하는 정보시스템이 상기 딥러닝 프로그램을 이용하여 지하 공동구 내에서 탐지되는 실제데이터와 유사한 데이터를 생성해내는 방법으로서,입력되는 시계열 데이터에 대하여 CNN과 어텐션을 거치도록 하여 특성 데이터를 추출한 후, 상기 특성 데이터에대하여 하나 이상의 GRU계층과 완전 연결층을 거치도록 하여 시간 정보를 포함하는 시계열 데이터를 출력하는입력 시계열특성 추출단계;상기 시간 정보를 포함하는 시계열 데이터를 임베딩 계층에 입력하여 시·공간적 중요 특성을 추출한 후 잠재공간에 사영시키고, 상기 잠재공간에 사영된 데이터에 대하여 복구함수를 이용하여 원래 데이터로 복구하는 과정을 반복하는 오토 인코더 학습단계;상기 임베딩 계층에 입력된 시계열 데이터와 같은 차원의 확률변수를 생성기에 입력하여 출력값을 생성시킨 후,상기 출력값을 상기 잠재공간을 거치도록 함으로써 상기 시·공간적 중요 특성을 반영시키고, 판별기에 입력하여 실제 데이터인지 생성된 데이터인지 분류하는 분류모델 학습단계; 및상기 오토인코더 학습단계에서 학습된 상기 복구함수가, 상기 확률변수를 상기 생성기에 입력하여 출력시킨 잠재변수를 이용하여 실제 데이터와 근사한 분포의 시계열 데이터를 출력해내는 생성기-복구함수 결합 학습단계;를 포함하는 것을 특징으로 하는, Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법."}
{"patent_id": "10-2023-0118730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서상기 정보시스템은, 상기 오토인코더 학습단계, 상기 분류모델 학습단계 및 상기 생성기-복구함수 결합 학습단계를 반복하여 수행하면서 상기 입력되는 시계열 데이터에 대한 확률분포와 상기 생성기-복구함수 결합 학습단계에서 출력된 시계열 데이터의 확률분포의 차이를 최소화하는 근사함수를 찾는 것을 특징으로 하는,Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법."}
{"patent_id": "10-2023-0118730", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서상기 근사함수는 아래 식과 같으며,상기 근사함수에서 은 상기 입력되는 시계열 데이터에 대한 확률분포이며, 은 상기 생성기-복구함수 결합 학습단계에서 출력된 시계열 데이터의 확률분포인 것을 특징으로 하는, ConvolutionalAttention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법에 관한 것이다. 지하 공동구는 도시 운영에 필수적인 국가 중요시설인 반면 화재나 침수, 침하 등 재난 발생 시 대형 재난으로 번지고 이로 인하여 재산 및 인명피해를 유발할 뿐만 아니라 시민들의 생활은 물론 산업 전반에 큰 영향을 끼친 다. 따라서 딥러닝을 이용하여 지하 공동구에서 감지되는 센서 데이터들을 분석하고 재난 발생을 감시하는 연구 들이 진행되고 있다. 그러나, 지하 공동구의 재난 발생에 따른 실제 데이터가 없기 때문에 딥러닝 시스템들을 학 습시키기가 어렵다는 문제가 있다. 따라서, 본 발명에서는 CA-TimeGAN 모델을 이용하는 딥러닝 프로그램으로 지 하 공동구 내에서 탐지될 수 있는 재난 상황의 실제 데이터와 유사한 데이터를 생성해내는 방법을 제공한다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법에 관한 것이다. 지하 공동구는 도시 운영에 필수적인 국가 중요시설인 반면 화재나 침수, 침하 등 재난 발생 시 대형 재난으로 번지고 이로 인하여 재산 및 인명피해를 유발할 뿐만 아니라 시민들의 생활은 물론 산업 전반에 큰 영향을 끼친 다. 따라서 딥러닝을 이용하여 지하 공동구에서 감지되는 센서 데이터들을 분석하고 재난 발생을 감시하는 연구 들이 진행되고 있다. 그러나, 지하 공동구의 재난 발생에 따른 실제 데이터가 없기 때문에 딥러닝 시스템들을학습시키기가 어렵다는 문제가 있다. 따라서, 본 발명에서는 CA-TimeGAN 모델을 이용하는 딥러닝 프로그램으로 지하 공동구 내에서 탐지될 수 있는 재난 상황의 실제 데이터와 유사한 데이터를 생성해내는 방법을 제공한다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지하 공동구는 통신, 전력, 수도와 같은 라이프 라인을 공동으로 수용하여 도시 미관 개선 및 도시관리의 효율 성을 증대하는 역할을 하는 국가 중요시설물이다. 따라서 지하 공동구에서 재난이 발생하면 시민의 생활과 산업 에 막대한 피해와 혼란을 초래한다. 지하 공동구에서 발생할 수 있는 재난은 다양한 형태로 발생될 수 있는데, 화재를 비롯하여 침수, 지반침하, 지진, 불법적인 침입 등이 있다. 그중 화재는 지하 공동구에서 발생할 수 있는 대표적인 사고 유형으로서, 전기 절연부 또는 접속부 등의 과열 등으로 인하여 발생할 수 있다. 지하 공동구에 부설된 전력·통신 케이블의 외장재료는 폴리에틸렌, PVC 및 합 성고무 등을 사용하기 때문에 화재 발생 시 농연 및 유독성 가스의 원인이 된다. 따라서 지하 공동구에서 화재 가 발생하는 경우 짙은 연기와 유독가스로 인한 상황파악 지연과 좁은 진입로로 인한 진입의 어려움 등이 발생 할 수 있다. 또한, 화재 진압 후에도 소화를 위한 용수 피해 등으로 인한 시설물 복구로 인한 비용 등이 발생할 수 있다. 화재로 인한 전산망 및 통신망 마비, 전력케이블 소실 등으로 인해 지역사회와 경제에 혼란을 초래할 수 있다. 최근 ‘안전하고 편리한 사회’에 대한 기대와 동시에, 각종 재난, 재해 등을 실시간으로 파악하여 신속히 대응 하는 체계의 구축 필요성이 제기되고 있다. 또한, 인적 오류로 인한 재난관리 실패를 줄이는 동시에 재난관리 시스템의 효율성을 높이기 위해, AI, IoT 센서, 디지털 트윈 등의 최첨단 기술을 융합하여 실시간으로 화재, 지 진, 침수 또는 지반침하 등에 대한 감시를 할 수 있는 재난 관리체계에 관한 연구가 활발히 진행 중이다. 하지만 지하 공동구 재난의 예측·관리체계의 기반이 될 인공지능 학습을 위해서는 해결해야 할 문제가 있다. 첫 번째로, 지하공동구 내 화재 등 재난발생 상황의 데이터 수집의 어려움이다. 데이터 수집을 위해 지하공동구 내에서 실제로 불을 내는 등의 재난을 발생시키는 것은 사회·경제적 피해가 초래되기 때문에 불가능하다. 두 번째로, 재난 시뮬레이션을 통한 데이터 수집의 한계점이 존재한다. 지하 공동구와 유사한 가상 환경에서 시 뮬레이션을 통해 재난 데이터를 수집하는 것이 현실적인 수단이다. 하지만 각종 재난의 발생 원인과 환경 조건 등 다양한 요소에 의해 크기와 양상 등이 달라지기 때문에 시뮬레이션만으로 재난 데이터를 풍부하게 모으는 것 은 한계가 있다. 특히, 화재의 경우 그 특성상 잠재적으로 매우 복잡한 움직임을 띄기 때문에, 같은 조건의 화 재도 다른 양상을 가질 수 있다. 세 번째로, 전통적인 방식으로 데이터를 증강(data augmentation)한다고 하더라도, 재난의 특성 정보를 추출하 여 반영하는지 검증하기 어렵다. 기존 데이터 증강 방식은 시계열 데이터인 재난 데이터의 시간 정보를 왜곡하 거나 기존 데이터와는 전혀 다른 양상의 데이터로 만들 가능성이 있다. 반대로 기존의 데이터를 단지 복제하는 것에 가깝게 데이터를 만들 수도 있기 때문에, 재난 관리에 활용하는 데 한계점이 있다. 선행기술문헌 비특허문헌 (비특허문헌 0001) H. Kim, J. Lim and K. Park, “Examination of Fire Vulnerability and Improvement Methods in Underground Facility for Public Utilities”, Proc. of SAREK Conference 2019, pp. 814-817, 2019. (in Korean) (비특허문헌 0002) B. Lee, C. Park, M. Lee and W. Jung, “Development of a Acoustic Acquisition Prototype device and System Modules for Fire Detection in the Underground Utility Tunnel”, Journal of IIBC, Vol. 22, No. 5, pp. 7-15, Oct. 2022. (비특허문헌 0003) M. Lee, W. Jung and E. Kim, “A Study on the Disaster Safety Management Method of Underground Lifelines based on Digital Twin Technology”, Journal of KIISE, Vol. 39, No.2, pp. 16-24, Feb. 2021. (비특허문헌 0004) H. Kim and J. Im, “Adoption of IoT for Risk Management : focusing on issues in infrastructure and human errorsproof technology”, Journal of KIISE, Vol.32, No.6, pp. 51-56, Jun. 2014. (비특허문헌 0005) J. Yoo, C. Han and H. Shin, “A Methodology for Realty Time-series Generation Using Generative Adversarial Network”, Journal of KCONS, Vol.12, No,10, pp. 9-17, Oct. 2021. (비특허문헌 0006) O. Mogren, “C-RNN-GAN: Continuous recurrent neural networks with adversarial training.” arXiv preprint arXiv:1611.09904, Nov. 2016. (비특허문헌 0007) M. Leznik, P. Michalsky, P. Willis, B. Schanzel, P. Ostberg and J.Domaschka, “ Multivariate time series synthesis using generative adversarial networks”, In Proceedings of the ACM/SPEC International Conference on Performance Engineering, pp. 43-50, April. 2021. (비특허문헌 0008) B. Xiong, L. Lou, X. Meng, X. Wang, H. Ma and Z. Wang, “Short-term wind power forecasting based on Attention Mechanism and Deep Learning”, Electric Power Systems Research, Vol. 206, Article. 107776. May. 2022. (비특허문헌 0009) M. Corbetta and G. Shulman, “Control of goal-directed and stimulus-driven attention in the brain”, Nature reviews neuroscience, Vol. 3, No. 3, pp. 201-215, Mar. 2002. (비특허문헌 0010) M. Luong, H. Pham and C. Manning, “Effective approaches to attention-based neural machine translation”, arXiv preprint arXiv:1508.04025, Sep. 2015. (비특허문헌 0011) J. Chung, C. Gulcehre, K. Cho and Y. Bengio “Empirical evaluation of gated recurrent neural networks on sequence modeling”, arXiv preprint arXiv:1412.3555, Dec. 2014. (비특허문헌 0012) J. Yoon, D. Jarrett and M. Schaar, “Time-series generative adversarial networks”, Advances in neural information processing systems, Vol. 32, 2019. (비특허문헌 0013) J. Dannenberg, “Time Series Synthesis using Generative Adversarial Networks”, 2021. (비특허문헌 0014) Y. Chen, G. Liu and H. Gao. “Research and Analysis on Fire Simulation of Underground Pipe Gallery Based on Pyrosim Software”, In Journal of Physics: Conference Series, Vol. 2185, No. 1, pp. 012069, Feb. 2022. (비특허문헌 0015) C. Guo, Q. Guo, T. Zhang, W. Li, H. Zhu and Z. Yan, “Study on real-time heat release rate inversion for dynamic reconstruction and visualization of tunnel fire scenarios”, Tunnelling and Underground Space Technology, Vol. 122, Article. 104333, Apr. 2022. (비특허문헌 0016) A. H. Buchanan, . “Fire engineering design guide” Centre for Advanced Engineering, University of Canterbury. (비특허문헌 0017) D. Jeon and S. Lee, “Light-weight Classification Model for Android Malware through the Dimensional Reduction of API Call Sequence using PCA”, Journal of KSCI, Vol. 27, No. 11, pp. 123- 130, Nov. 2022. (비특허문헌 0018) L. Maaten, and G. Hinton, “Visualizing data using t-SNE”, Journal of machine learning research, Vol. 9, No. 11, Dec. 2008."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "시계열 데이터 증강에 대하여 설명한다. 전통적으로 데이터 증강 기법이 주로 사용되는 분야는 이미지 혹은 텍 스트 데이터 분야인데, 재조정(re-scaling), 변환(transforming)이나 왜곡(distorting) 등을 활용하였다. 학습 데이터의 부족으로 발생하는 과적합 문제를 해결하기 위해서 부트스트랩(Bootstrap) 혹은 리샘플링(Resampling) 등과 같은 방식으로 원본 데이터와 유사한 증강 데이터를 생성하기도 한다. 하지만 단순히 원본 데이터를 반복 추출하는 방식은 복제에 가깝다. 최근 GAN을 통해 데이터 증강의 문제점을 개선하기 위한 연구가 활발히 진행되어 왔다. GAN 기반 데이터 증강은 실제 데이터의 확률분포를 기반으로 데이터를 생성하기 때문에 전통적 방식의 데이터 증강의 한계점을 극복할 수 있다. 하지만 기존의 GAN 기반 데이터 생성 알고리즘은 시계열 데이터 보다는 이미지 등의 특정 시점 데이터 위주로 연구되어 왔다. 여전히 시계열의 시간적 정보를 효율적으로 포착하여 생성과정에 반영하는 데 한계가 존 재했다. 시계열 데이터 생성은 시간 정보의 역동성(temporal dynamics)을 보존하면서, 시간의 흐름에 따른 변수간 관계 들의 특징을 효과적으로 추출하여 반영해야 한다. 기존 GAN 기반 시계열 데이터 생성 연구에서는 RCGAN, C-RNN- GAN 등이 제안되었으나, 시계열이 아닌 다른 도메인에서 사용하는 GAN의 손실함수를 그대로 반영하여 시계열 데 이터를 생성하였다. 기존 접근방식의 GAN 학습은 판별자의 피드백이 오로지 실제 데이터인지 생성된 데이터인지 를 분류하는 결과만 반영되기 때문에, 시계열 데이터의 시간적 상관성을 반영하지 못하는 한계점이 존재했다. 상술한 문제점을 해결하기 위하여 창안된 본 발명은, 지하 공동구의 재난상황에서 수집될 수 있는 재난 데이터 의 특성과 시간적 정보가 반영된 데이터 생성모델을 제공함으로써, 현실적인 지하 공동구 재난 예방 및 관리체 계 구현에 기여하는 것을 목적으로 한다. 이를 위해 본 발명은 전통적 데이터 증강 방식에서 탈피하여, 재난의 중요특성을 확률분포 공간에 반영하여 데이터를 생성하는 모델을 제공하게 된다. 또한, CNN과 어텐션 매커니즘을 결합하여 집중해야 할 부분에 선택적으로 집중하여 생성 데이터와 실제 데이터 의 유사도를 향상시키는 Convolutional Attention TimeGAN(CA-TimeGAN) 모델을 제공하는 것을 목적으로 한다. 본 발명이 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이와 같은 목적을 달성하기 위하여 본 발명은, 딥러닝 프로그램을 포함하는 정보시스템이 상기 딥러닝 프로그램 을 이용하여 지하 공동구 내에서 탐지되는 실제 데이터와 유사한 데이터를 생성해내는 방법으로서, 입력되는 시 계열 데이터에 대하여 CNN과 어텐션을 거치도록 하여 특성 데이터를 추출한 후, 상기 특성 데이터에 대하여 하 나 이상의 GRU계층과 완전 연결층을 거치도록 하여 시간 정보를 포함하는 시계열 데이터를 출력하는 입력 시계 열특성 추출단계; 상기 시간 정보를 포함하는 시계열 데이터를 임베딩 계층에 입력하여 시·공간적 중요 특성을 추출한 후 잠재공간에 사영시키고, 상기 잠재공간에 사영된 데이터에 대하여 복구함수를 이용하여 원래 데이터 로 복구하는 과정을 반복하는 오토 인코더 학습단계; 상기 임베딩 계층에 입력된 시계열 데이터와 같은 차원의 확률변수를 생성기에 입력하여 출력값을 생성시킨 후, 상기 출력값을 상기 잠재공간을 거치도록 함으로써 상기 시·공간적 중요 특성을 반영시키고, 판별기에 입력하여 실제 데이터인지 생성된 데이터인지 분류하는 분류모델 학습단계; 및 상기 오토인코더 학습단계에서 학습된 상기 복구함수가, 상기 확률변수를 상기 생성기에 입력하여 출력시킨 잠재변수를 이용하여 실제 데이터와 근사한 분포의 시계열 데이터를 출력해내는 생성기-복구함수 결합 학습단계;를 포함하는 것을 특징으로 하는, Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지 데이터 생성방법으로 하는 것이 바람직하다. 본 발명은 또한, 상술한 특징들에 더하여, 상기 정보시스템은, 상기 오토인코더 학습단계, 상기 분류모델 학습 단계 및 상기 생성기-복구함수 결합 학습단계를 반복하여 수행하면서 상기 입력되는 시계열 데이터에 대한 확률 분포와 상기 생성기-복구함수 결합 학습단계에서 출력된 시계열 데이터의 확률분포의 차이를 최소화하는 근사함 수를 찾는 것을 특징으로 하는, Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성 방법으로 하거나 이에 더하여 상기 근사함수는 아래 식과 같으며,"}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "상기 근사함수에서 은 상기 입력되는 시계열 데이터에 대한 확률분포이며, 은 상 기 생성기-복구함수 결합 학습단계에서 출력된 시계열 데이터의 확률분포인 것을 특징으로 하는, Convolutional Attention TimeGAN 모델을 이용한 지하 공동구 탐지데이터 생성방법으로 하는 것도 바람직하다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "재난은 발생환경과 다양한 변수의 영향으로 비선형성을 가진다. 그러나 본 발명에서는 각종 시나리오를 바탕으 로 지하 공동구 환경 내 역동 시뮬레이션(Fire Dynamic Simultor)을 통해 온도, 이산화탄소, 산소 및 열 방출률(HRR) 등의 다변량 데이터를 수집하여 정확한 이상치 탐지 모델링을 수행할 수 있게 하는 효과가 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 상술한 목적과 특징이 분명해지도록 본 발명을 상세하게 설명할 것이며, 이에 따라 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 또한 본 발 명을 설명함에 있어서 본 발명과 관련한 공지기술 중 이미 그 기술 분야에 익히 알려져 있는 것으로서, 그 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에 그 상세한 설명을 생략하기로 한다. 아울러, 본 발명에서 사용되는 용어는 가능한 한 현재 널리 사용되는 일반적인 용어를 선택하였으나, 특정한 경 우는 출원인이 임의로 선정한 용어도 있으며 이 경우는 해당되는 발명의 설명부분에서 상세히 그 의미를 기재하 였으므로, 단순한 용어의 명칭이 아닌 용어가 가지는 의미로서 본 발명을 파악하여야 함을 밝혀두고자 한다. 실 시 예들에 대한 설명에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 실시 예들을 한 정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 실시 예들은 여러 가지 형태로 변경을 가할 수 있고 다양한 부가적 실시 예들을 가질 수 있는데, 여기에서는 특 정한 실시 예들이 도면에 표시되고 관련된 상세한 설명이 기재되어 있다. 그러나 이는 실시 예들을 특정한 형태 에 한정하려는 것이 아니며, 실시 예들의 사상 및 기술 범위에 포함되는 모든 변경이나 균등물 내지 대체물을 포함하는 것으로 이해되어야 할 것이다. 다양한 실시 예들에 대한 설명 가운데 “제1”, “제2”, “첫째” 또는“둘째”등의 표현들이 실시 예들의 다 양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들은 해당 구 성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소와 구분 짓 기 위해 사용될 수 있다. 이하에서는 본 발명을 설명한다. 본 발명에서는 CA-TimeGAN은 CNN과 어텐션을 결합하여 데이터의 공간적 특성을 추출하고. 이를 GRU에 입력하여 실제 데이터와 유사한 데이터를 생성한다. CA-TimeGAN은 총 3개의 네트워크의 결합을 통해 학습하게 되는데, 각 네트워크는 잠재공간에 실제 데이터의 중요 특성을 반영하고, 가우시안 분포 같은 확률분포를 통해 얻어낸 입력값에 중요 특성이 결합된 데이터를 생성하게 된다. 먼저 본 발명에 포함되는 CNN(Convolution Neural Network)에 대하여 살펴보면, CNN은 효과적으로 데이터의 공 간적 특성을 포착하는 동시에 파라미터를 최소화하여 학습과 추론에 활용될 수 있다. CNN은 특정 크기의 필터를이용해 데이터의 지역적 특성을 추출하며, 평행 이동 불변성(Translation Invariant)의 특성을 가지고 있어 데 이터의 여러 특성을 효과적으로 추출한다. 또한, 다변량 데이터의 다양한 특성 간 상호의존성(Interdependenc e)을 학습할 수 있으며, 다음 식 과 같이 지역적 특성을 추출할 수 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 g(*)는 ReLU(Rectified Linear Unit)와 같은 비선형 활성화 함수를 의미하고, 는 합성곱 연산 (Convolution Operation)을 나타낸다. 는 입력시계열 데이터이며, 와 는 학습을 통해 업데이트되는 가 중치와 편향을 의미한다. 그리고 어텐션 매커니즘(Attention Mechanism)에 대하여 살펴본다. 어텐션 매커니즘은 필요에 따라 중요하지 않 은 부분은 무시하고, 중요한 부분을 선택적으로 인식하는 인간의 뇌구조를 모사한 방식이다. 어텐션 매커니즘은 기존 RNN의 장기 의존성 문제를 해결하고, 전체 정보를 참고하여 기억해야 할 중요 정보에 가중치를 더 크게 부 여함으로써 예측력 향상에 기여한다. 입력 데이터는 다변량 데이터로 여러 특성을 가지고 있으며, 지하공동구 화재 온도 예측에 따른 중요도를 가지 고 있다. 어텐션은 중요 특성에는 가중치를 더 부여하여 예측력을 높이는데 사용하게 된다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "위의 식 는 어텐션 함수를 표현한 것이다. Q는 현재 t 시점의 은닉층, K와 V는 모든 시점의 은닉층을 의미한 다. 여기서 은닉층이란 신경망의 출력값을 의미한다. 어텐션 함수는 주어진 Q에 대해 모든 K와의 유사도를 구하 고, K와 맵핑 되어있는 각각의 V에 유사도를 반영한다. 그리고 V를 모두 결합하여 출력하는 것을 어텐션 값이라 고 한다. 그리고 식 은 어텐션 스코어 함수이고, 와 는 식 의 Q와 K를 의미한다. 는 와 모든 은닉 상태의 어 텐션 스코어를 모은 값이다. 식 의 는 에서 로 구한 어텐션 분포를 의미한다. 값이 클수록 해당 지점 의 어텐션 값이 증가하며, 예측에 중요한 역할을 하게 된다. 식 의 는 컨텍스트 벡터라고 하며, i번째 V 에 대해 식의 를 가중합(Weighted sum)하여 구한 결과이다. 는 중요한 정보에 집중하도록 계산된 새 로운 특성값을 의미한다. 다음으로 GRU(Gated Recurrent Unit)를 살펴본다. GRU는 RNN(Recurrent Neural Network)의 문제점을 보완할 대 안으로 제안되었다. RNN은 기울기 소실 혹은 폭주로 인해 입력 시계열 데이터가 길어질수록 과거의 정보를 소실 하는 장기 의존성(Long-term Dependency)이라는 한계를 지니고 있다. GRU는 게이트라는 매커니즘을 적용하여 기 억해야 할 정보를 선택하고, 더욱 빠르게 수렴하는 특징을 가지고 있다. 도 1에는 GRU의 구조가 도시되어 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "GRU는 업데이트 및 리셋 게이트(Update and Reset Gate)의 2개의 게이트로 구성된다. 도 1의 파란색 화살표는 업데이트 게이트로써 LSTM의 망각 게이트와 입력 게이트의 역할을 담당한다. 식 과 식 은 업데이트 게이 트로써 어텐션 가중치가 부여된 입력값 와 에서 이전 정보를 얼마나 기억해야 하는 지 비율을 결정하고, 는 현재 정보의 비율을 의미한다. 식 는 리셋 게이트로써 도 1의 노란색 화살표를 의미하며 이전 정보에서 얼마나 잊어야 하는 지의 양을 결정한다. 식 과 식 는 업데이트 게이트와 리셋 게이트를 모두 적용하여 출력할 은닉 상태(Hidden state)를 계산한다. 는 이전은닉 상태( )와 리셋 게이트( )를 곱하여 이전 정보 중 출력할 정보를 선별한 후, tanh를 통과하여 -1과 1사이의 값으로 바꿔준다. 결과적으로 는 이전 정보에서 어떤 정보를 기억할 것인지를 결정하는 단계라고 할 수 있다. 업데이트 게이트에서 구한 현재 정보 비율( )과 를 곱하여 현재 정보 중 내보낼 정보를 계산 한다. 이전 정보 비율( )에 이전 은닉상태( )를 곱하여 이전 정보 중 내보낼 값을 계산한 후, 현재 정보 중 내보낼 값( )과 더하여 최종적으로 출력값을 결정하게 된다. 다음으로 TimeGAN을 살펴본다. TimeGAN은 지도 학습 방식과 비지도 GAN 학습 방식을 결합하여 시간 정보를 효과 적으로 추출하고, 반영하는 시계열 데이터 생성 프레임 워크로 제안되었다. TimeGAN 의 목적은 다변량 시계열 데이터 의 조건분포(conditional distribution) 에 근사한 확률분포를 찾아 내는 것이다. TimeGAN은 정적 특성(Static features) 및 시계열 특성(temportal features)의 2개 특성 값이 입력된다. 정적 특성은 성별 등과 같은 시간이 지나도 변하지 않는 특성을 의미하며, 시계열 정보는 시간의 흐름에 따라 발생하 는 특성을 의미한다. 정적 특성을 S, 시계열 특성을 X 라고 할 때, S와 X는 각 각 랜덤 벡터 S, X에 속한다. S 와 X는 결합분포(Joint Distribution) ( )로 가정할 때, X는 T 길이 만큼의 확률변수이다. 학습 입력 데 이터는 이다. TimeGAN의 목표는 실제 확률분포 에 최적으로 근사한 를 찾는 것이다. 하지만 데이터의 길이, 차원, 분포 등에 따라 기존 GAN연구로는 최적화하기 어려운 한계가 있기 때문에, 결합분포의 자기회귀 분 해(Autoregressive decomposition)를 통해 인 조건분포를 가정하고 이를 바탕으로 을 학습한다. 결과적으로 실제 데이터의 분포와 학습을 통해 근사한 확률분포 간의 차 이를 최소화하는 것이 TimeGAN의 학습 목표라고 할 수 있다. 도 2에는 TimeGAN 블록 다이어그램이 도시되어 있다. 도 2에서 보는 바와 같이 TimeGAN은 4가지 신경망으로 구 성되어 적대적으로 시계열 데이터의 특징을 학습한다. 각 구성요소는 임베딩 함수(embedding function), 복구 함수(recovery function), 생성기(sequence generator) 및 판별기(sequence discriminator)로 구성된다. 임베 딩 함수는 잠재 공간을 학습하며, 적대적 신경망은 잠재공간에서 작동한다. 한편, 도 3에는 TimeGAN의 학습 단계도가 도시되어 있다. 도 3에서 보는 바와 같이 TimeGAN 생성모델의 첫 번째 학습 단계는 임베딩 및 복구 함수를 통해 입력 시계열 데이터의 시간적 정보를 학습하고, 이를 잠재 공간에 중 요 특성을 맵핑하는 것이다. 를 특성 S, X를 사영한 잠재벡터 공간이라고 할 때, 임베딩 함수와 잠재 공 간에 사영된 정적( ) 및 시계열( ) 특성 잠재변수를 아래 수식으로 표현할 수 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "는 정적변수 S를 잠재변수 로 사영하는 정적 임베딩 신경망이고, 는 시계열 변수 X를"}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "(여기서 는 시계열 변수 시점의 잠재변수)로 하여 로 사영하는 시계열 임베딩 신경망이다. 여기서잠재 변수 와 를 S와 X로 복구하는 신경망을 복구함수 r로 정의할 수 있다. 복구함수 r과 복구된 S와 X를 아래 수식으로 나타낼 수 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "와 는 정적 및 시간적 임베딩을 복구하는 신경망이다. 임베딩 및 복구 함수는 직렬 적으로 연산되며, 각 함수의 구조는 상황에 맞게 선택할 수 있다. 두 번째 학습 단계는 생성기와 판별기를 학습하는 것으로 임베딩 및 복구 함수와 유사한 방식으로 작동한다. 생 성기는 가우시안 분포와 같이 사전에 정의된 확률분포를 통해 생성한 확률 변수인 를 임베딩 잠재공간에 입력하여 와 를 생성한다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "는 정적 변수 생성기 신경망이며, 는 시계열 변수 생성기 신경망이다. 의 는 시계열 변수의 t-1시점의 잠재변수를, 우변의 는 t시점의 잠재 변수를 의미한다. 판별기 함수는 생성기를 통해 출력된 잠재 변수를 실제 값인지, 생성된 값인지 분류한다. 판 별기 공식은 아래 수식과 같이 설명할 수 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서 는 실제데이터( ) 혹은 생성데이터( )인지를 의미하며, 는 실제( ) 혹은 생성( )인지를 분류한 결과값을 의미한다. 와 로 전방 및 후방 은닉상태를 의미한다. , 는 순환함수(recurrent function)로 데이터를 임베딩하는 함수이고, 는 최종결과물의 진위를 가리는 분류함수이다. TimeGAN의 학습은 1)임베딩·복구 함수, 2)생성기·판별기 및 3)두 학습 네트워크들을 결합하여 학습을 진행하 게 되는데, 각 과정에 따라 다른 손실함수를 갖게 된다. 먼저 임베딩 및 복구함수를 통해 입력 시계열 데이터를 인코딩 및 디코딩을 거치며 재현(representation)을 하게 된다. 이때 사용되는 목적함수가 재구성 손실함수 (reconstruction loss)이다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "두 번째로 생성기 및 판별기를 통해 실제 혹은 생성된 데이터인지를 분류하게 된다. 목적함수는 비지도 손실 (unsupervised loss)이라고 하며, 생성기의 최대 우도 함수를 최소화 하거나 판별기의 최대 우도 함수를 최대화 한다. 생성기로부터 출력된 잠재변수를 바탕으로 실제인지 생성된 데이터인지를 분류하는 데 사용된다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "하지만 시계열 데이터를 생성하기 위해서는 판별기의 이진 피드백으로는 시간 정보 분포를 잡아내기에는 충분하 지 않다. 이에 임베딩 함수를 통해 산출된 실제 데이터의 잠재공간 분포( )와 생성기를 통해 생성된 데이터의 잠재공간 분포( )의 차이를 계산하는 학습 손실(supervised loss)을 추가한다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 12, "content": "도 4에는 본 발명에 의한 CA-TimeGAN의 구조가 도시되어 있다. 본 발명에 의한 CA-TimeGAN은 입력값이 CNN을 통 과하며 출력된 값에 어텐션 메커니즘을 반영하여 중요정보를 기억한다. 어텐션 스코어가 적용되어, 중요한 부분 에 가중치가 높게 반영된 결과값을 GRU에 입력하여 실제 시계열 데이터의 특성을 효과적으로 추출하고, 이를 TimeGAN 네트워크 반영하여 시계열 데이터를 생성하는 알고리즘이다. CA-TimeGAN를 통한 시계열 데이터 생성 학습은 4단계로 이루어진다. 첫 번째로 입력 시계열 값의 특성을 추출하 는 단계이다. 입력값은 CNN과 어텐션을 거치며 새롭게 추출된 특성 데이터가 GRU계층을 거치며 시간 정보를 포 함하는 값을 출력한다. 추출 데이터는 완전연결층을 거치며 학습 신경망의 입력값으로 활용된다. 두 번째로, 도 4의 ①번 화살표에 표시된 임베딩-복구 신경망으로 구성된 오토인코더 학습이다. 특정 길이의 시 계열 데이터가 입력되면, 임베딩을 거치며 시·공간적 특성을 추출하여 중요 잠재 공간에 반영한다. 복구 함수 는 잠재공간에 사영된 데이터를 바탕으로 원래 데이터로 복구하는 과정을 반복한다. 위 그림에서 빨간색 화살표 가 첫 번째 학습 과정이다. 세 번째는 위 그림에서 ②번 보라색 화살표로 그려진 과정으로, 생성기-판별기 신경망으로 구성된 분류 모델 학 습이다. 임베딩 계층에 입력된 시계열과 같은 차원의 확률변수가 생성기를 거치면서 시·공간 정보를 추출하여 잠재공간에 반영된 중요 특성이 생성기의 출력값에 반영된다. 이 출력값은 판별기에 입력되어 실제 데이터인지 생성된 데이터인지 분류하게 된다. 마지막으로 생성기-복구 함수 결합 학습(Joint training)이다. 확률변수가 생성기를 통해 입력되어 출력된 잠재 변수가 복구 함수를 통해 새롭게 데이터를 생성하는 과정이다. 앞서 임베딩-복구 신경망 학습에서 학습된 복구 함수는 생성기를 통해 입력된 잠재변수를 실제 데이터와 근사한 분포의 시계열 데이터를 출력하게 된다. 결론적으로, 세 단계의 학습이 차례대로 반복하면서 실제 시계열 데이터의 분포를 최대한 근사하는 함수를 찾는 것이 목표이다. CA-TimeGAN 최종 식은 아래 식과 같이 정의할 수 있다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "와 은 은 각각 실제 시계열 데이터 분포와 데이터 생성 모델을 통해 생성된 데이 터 확률분포를 의미한다. 두 확률 분포간 차이를 최소화하는 근사함수를 찾는 것이 제안된 모델의 목표이며, 이 때, 형태는 쿨백-라이블러 발산으로 계산된다. 도 5에는 본 발명에 의한 CA-TimeGAN 모델이 수행되는 과정이 도시되어 있다. 이하에서는 도 5를 참조하여 본 발명을 설명한다. 상술한 바와 같이 본 발명은, 딥러닝 프로그램을 포함하는 정보시스템이 상기 딥러닝 프로그 램을 이용하여 지하 공동구 내에서 탐지되는 실제 데이터와 유사한 데이터를 생성해내는 방법이다. 이를 위하여 먼저, 입력되는 시계열 데이터에 대하여 CNN과 어텐션을 거치도록 하여 특성 데이터를 추출한 후, 상기 특성 데이터에 대하여 하나 이상의 GRU계층과 완전 연결층을 거치도록 하여 시간 정보를 포함하는 시계열 데이터를 출력하는 입력 시계열특성 추출단계(s110)를 수행한 후, 상기 시간 정보를 포함하는 시계열 데이터를 임베딩 계층에 입력하여 시·공간적 중요 특성을 추출한 후 잠재공간에 사영시키고, 상기 잠재공간에 사영된 데 이터에 대하여 복구함수를 이용하여 원래 데이터로 복구하는 과정을 반복하는 오토 인코더 학습단계(s120)를 수 행하도록 하는 것이 바람직하다. 그리고, 상기 임베딩 계층에 입력된 시계열 데이터와 같은 차원의 확률변수를 생성기에 입력하여 출력값을 생성 시킨 후, 상기 출력값을 상기 잠재공간을 거치도록 함으로써 상기 시·공간적 중요 특성을 반영시키고, 판별기 에 입력하여 실제 데이터인지 생성된 데이터인지 분류하는 분류모델 학습단계(s130)를 수행하고, 상기 오토인코 더 학습단계에서 학습된 상기 복구함수가, 상기 확률변수를 상기 생성기에 입력하여 출력시킨 잠재변수를 이용 하여 실제 데이터와 근사한 분포의 시계열 데이터를 출력해내는 생성기-복구함수 결합 학습단계(s140)를 수행하 도록 하는 것이 바람직하다.여기서, 상기 정보시스템은, 상기 오토인코더 학습단계, 상기 분류모델 학습단계 및 상기 생성기-복구함수 결합 학습단계를 반복하여 수행하면서 상기 입력되는 시계열 데이터에 대한 확률분포와 상기 생성기-복구함수 결합 학습단계에서 출력된 시계열 데이터의 확률분포의 차이를 최소화하는 근사함수를 찾도록 하는 것이 바람직한데, 상기 근사함수는 아래 식(식 26과 동일)과 같게 하는 것이 더욱 바람직하다."}
{"patent_id": "10-2023-0118730", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "상기 근사함수에서 은 상기 입력되는 시계열 데이터에 대한 확률분포이며, 은 상 기 생성기-복구함수 결합 학습단계에서 출력된 시계열 데이터의 확률분포이다. 이하에서는 실험예를 통하여 본 발명을 보다 상세하게 설명한다. 이하에서 설명되는 실험예는 본 발명의 이해를 돕기 위하여 개시된 것이며, 본 발명은 여기서 설명되는 실험예와 다르게 다양하게 변형되어 실시될 수 있음이 이해되어야 할 것이다. 이같이 본 발명의 범주 및 기술사상 범위 내에서 다양한 변경 및 수정이 가능함은 본 기 술분야에서 통상의 지식을 가진 자에게 있어서 명백한 것이며, 이러한 변형 및 수정이 첨부된 특허청구범위에 속하는 것도 당연한 것이다. <실험 예> 1. 실험개요 실험의 목적은 CA-TimeGAN을 통해 생성된 데이터의 품질을 검증하는 것이다. 이를 위해 기존 TimeGAN과 CA- TimeGAN이 각각 생성한 데이터의 품질을 양적·질적으로 비교 검증한다. 또한 각 모델의 학습 반복 수에 따른 생성 데이터 품질을 비교함으로써, 최적의 모델 학습 반복 수를 찾는 것을 목표로 한다. 상기 목표를 달성하기 위한 검증 방법은 4가지이다. 첫 번째로, 모델을 통해 생성된 데이터와 실제 데이터의 확 률분포 유사도를 측정한다. 두 번째로, 제안된 생성모델을 통해 생성된 데이터를 바탕으로 분류기를 만들어 실 제 데이터인지 생성 데이터인지 분류하는 판별점수(discriminative score)를 평가한다. 세 번째로, 생성 데이터 는 본질적으로 시계열의 특성을 포함하고 있다. 예측기에서도 동일한 성능향상이 있는지 예측 점수((predictive score)를 평가한다. 예측성능을 평가하기 위해 화재 시뮬레이션 데이터로만 학습한 모델과 생성 데이터를 섞은 데이터로 학습한 모델의 성능을 평가한다. 네 번째로, CA-TimeGAN을 통해 생성된 데이터분포 특성을 시각화하여 질적 평가를 수행한다. 2. 실험 데이터 최근 지하 공동구 화재·재난의 효율적인 관리를 위한 IoT 및 디지털 트윈 기술을 적용한 연구가 활발하게 진행 중이다. 지난 2020년에는 디지털 트윈 기반 화재·재난 지원 통합플랫폼 기술 개발 시범 적용 대상지로 충북 청 주시 오창 지하 공동구가 선정되었다. 재난 데이터 수집을 위해 지하 공동구 시설 내에 재난을 발생시키는 경우 막대한 사회·경제적 비용을 초래할 수 있다. 현실적으로 지하 공동구 시설과 유사한 가상 환경을 조성하여 데 이터를 수집하는 것이 현실적인 대안이다. 본 연구에서는 오창 지하 공동구의 일부 구간을 FDS(Fire Dynamics Simulator) 소프트웨어인 Pyrosim을 이용하 여 도 6과 같이 시뮬레이션 환경을 모델링하고, 화재 발생 시 온도, 이산화탄소, 산소 및 열 방출률(HRR) 등의 센서 데이터를 수집하였다. 화재 시뮬레이션 가상 환경의 폭과 높이는 각각 3m, 길이는 총 200m이다. 화재 시뮬 레이션 모니터링을 위해 10m 당 센서를 부착하여 온도, 이산화탄소, 산소, 일산화탄소 등의 데이터를 수집하였 다. 70m 당 환기구를 설치하여 환경 내 풍향을 조절하고, 벽면은 콘크리트로 설정하였다. 시뮬레이션 환경의 지 하 공동구 내에는 전력 및 통신선, 상수도 및 하수도 등이 수용되어 있다. 도 7에는 지하 공동구 내 시뮬레이션 환경 변수(표 1) 및 화재 시뮬레이션 환경 변수(표 2)가 도시되어 있다. 다양한 화재 상황을 상정하기 위해 열 방출률, 화재 강도(Fire growth coefficient), 발화지점, 풍속 등의 환경 변수를 조합하여 시나리오를 구성하였다. 지하 공동구 가상 환경 내 설비된 통신 및 전력 케이블의 물질을 PVC 로 가정하여 열 방출률은 1.5MW와 3MW로 설정하였다. 화재 강도는 화재 안전 공학 가이드의 열 방출률에 따른 화재 강도를 고려하였다. 발화지점은 가장자리(10m), 환기구가 없는 지점(50m), 중앙(100m) 등으로 설정하고, 풍속은 풍량이 없는 경우, 1m/s인 경우를 고려하였다. 각 화재 시뮬레이션 시간은 1800초이며, 화재 발생 시나 리오는 총 36개이다.3. 확률분포 유사도 CA-TimeGAN은 실제 데이터의 중요 특성을 확률분포 공간에 사영하여 생성 데이터에 반영한다. CA-TimeGAN은 실 제 데이터의 확률분포를 근사(approximation)하여 데이터를 생성한다. 즉, 실제 데이터와 생성 데이터 간 유사 도를 비교하기 위해서는 확률분포 유사도를 비교할 수 있다. 데이터의 확률분포 유사도 비교를 위해 쿨백-라이 블러 발산(Kullback-Libler Divergence)을 사용하였다. 분포 유사도가 높을수록 쿨백-라이블러 발산 점수는 낮 게 계산된다. 도 8은 TimeGAN과 CA-TimeGAN으로 각각 생성한 데이터와 실제 데이터 간 분포 유사도를 비교한 그래프이다. CA- TimeGAN으로 생성한 데이터 분포가 TimeGAN보다 실제 데이터 분포와 유사도가 높은 것으로 분석되었다. 연구범 위인 모델 학습 25,000번 이내에서는 CA-TimeGAN 10,000번, TimeGAN의 경우 25,000번에서 유사도가 가장 높았 으며, 두 분포를 비교한 결과 CA-TimeGAN 유사도가 약 29.7% 향상된 것으로 분석되었다. 4. 판별 점수 데이터 생성 모델의 목적은 생성 데이터가 실제 데이터와 유사도가 높은 데이터를 생성하는 것이다. 이를 검증 하기 위해 시계열 분류 알고리즘을 통해 실제 데이터를 0으로, 생성 데이터를 1로 라벨링하여 판별점수를 실험 하였다. 판별 점수(Discriminative score)는 분류모델 성능지표 중 정확도(Accuracy) 지표이며, 생성 데이터가 실제 데이터와 유사도가 높을수록 판별점수가 낮을 것으로 가정한다. 도 9는 생성 데이터의 판별점수를 평가하기 위한 시계열 분류 알고리즘 구성도이다. 각각 은닉층 100개, 100개 의 LSTM을 이중으로 쌓고, 마지막 완전연결층에서 진위여부를 판별하는 구조로 구성되었다. 학습을 위해 사용된 최적화 함수는 Adam, 손실 함수는 Binary Crossentropy, 학습오차로는 정확도를 사용하였으며, 학습반복 (Epochs)은 100번으로 설정하였다. 판별점수는 낮을수록 실제와 생성 데이터가 유사한 것으로 판단할 수 있다. 도 10은 TimeGAN과 CA-TimeGAN의 판별점수 결과이며, 각 모델이 달성한 최저 판별점수는 0.5이다. TimeGAN의 경 우 학습 반복 수가 증가할수록 판별점수가 증가하는 경향이 있었으나, 25,000번에서 0.5의 판별점수를 달성하였 다. CA-TimeGAN은 5,000번의 학습에서는 0.8535이었으나, 학습 반복이 10,000번 이후로 판별점수가 0.5로 유지 하다가 25,000에서 판별 점수가 증가했다. 판별점수 분석 결과 TimeGAN과 CA-TimeGAN이 달성한 판별 점수는 비 슷한 수준이었다. 또한, 학습 반복이 증가한다고 해서 판별 점수가 개선되지 않는 것으로 분석되었다. 5. 예측 점수 제안된 CA-TimeGAN은 시간적 정보를 내포하고 있는 시계열 데이터를 생성하는 모델이다. 생성 데이터가 실제 데 이터의 시간 정보를 잘 반영하고 있다면, 예측 모델에 기존 시계열 데이터에 생성된 데이터를 추가했을 때 예측 력이 증가할 것으로 가정할 수 있다. 이에, 실제 데이터만으로 구축한 예측 모델 성능과 실제 데이터에 생성 데 이터를 혼합한 데이터 셋으로 구축한 예측 모델 성능을 비교하였다. 도 11은 시계열 예측 모델 구조이다. 입력값으로 128초의 시계열 데이터를 입력하면, 32초의 시계열 데이터를 예측한다. 각각 은닉층 100개, 100개의 LSTM을 이중으로 쌓고, 마지막 완전연결층에서 32초의 시계열을 예측하 도록 구성되었다. 총 학습 반복은 100번이며, 최적화 함수는 Adam, 학습 손실은 MAE(Mean Absolute Error), 학 습오차는 MSE(Mean Square Error)로 학습하였다. 도 12는 기존 데이터로만 학습한 예측모델 성능과 생성 데이터를 혼합하여 학습한 예측 모델 성능을 비교한 그 래프이다. 그래프의 녹색 선은 실제 데이터로만 학습한 모델의 예측 점수이며, 생성 모델로 생성한 데이터를 포 함하여 학습한 경우 예측 점수가 모두 향상되는 것으로 확인되었다. 전체적으로 CA-TimeGAN으로 생성한 데이터 를 포함하여 학습한 경우, TimeGAN 생성 데이터 포함 예측 모델보다 성능이 향상되었다. CA-TimeGAN을 통해 생 성한 데이터를 포함하여 학습한 예측 모델의 최저 예측점수는 0.016675이다. 기존 데이터로만 학습한 예측모델 성능은 0.049134, TimeGAN은 0.021649으로 각각 약 66.1%, 22.9%의 예측력이 향상되었다. 6. t-SNE 및 PCA를 통한 시각화 생성된 데이터의 분포를 질적으로 평가하기 위해 PCA와 t-SNE를 이용하여 시각화하였다. PCA는 고차원 데이터 특성 왜곡을 최소화하면서 축소할 수 있으며, 데이터 분산을 가장 잘 설명하는 사전에 설정한 주성분의 수만큼 추출한다. 학습 및 생성 데이터는 시·공간적 정보를 포함하고 있는 고차원 데이터로써 각 데이터를 벡터화하고, 이를 사영(projection)하여 데이터의 분산을 보존한다. 결과적으로 PCA로 축소한 차원은 기존 데이 터의 특성을 최대한 반영하고 있기 때문에, 학습 데이터와 생성 데이터의 특성 간 유사도를 파악하기에 적절하다. 그래프의 파란색 점은 화재 시뮬레이션으로 수집한 학습 데이터이며 본 연구에서는 실제 화재 데이터로 간주한 다. 붉은색 점이 생성된 데이터의 분포이다. 도 13의 왼쪽 녹색박스 (a)에서 (d)까지는 학습 반복이 많아질수록 실제 데이터 분포 범위 안에서 넓게 퍼지는 것으로 확인되었다. 도 13의 오른쪽 하늘색박스의 CA-TimeGAN의 경 우 학습이 반복될수록 생성 데이터가 실제 데이터 분포의 좁은 범위로 수렴하는 것으로 확인 되었다. t-SNE(t-Stochastic Neighboring Embedding)은 차원의 데이터 특성을 저차원으로 축소하여 시각화하는 알고리 즘이다. t-SNE는 데이터를 저차원으로 축소한 후, 거리 개념을 데이터 셋 밀도 변화에 적용한다. 고차원의 데이 터가 밀집되어 있는 경우 t-SNE로 축소했을 때 확장되는 효과가 있다. 이 때, 고차원 상의 데이터 간 거리를 최 대한 유지하면서 저차원으로 맵핑시키기 때문에, 데이터간 분포를 효과적으로 비교할 수 있다. 도 14는 TimeGAN과 CA-TimeGAN으로 생성된 데이터와 실제 데이터의 분포를 t-SNE로 계산한 결과이다. TimeGAN과 CA-TimeGAN으로 각각 생성한 데이터는 실제 데이터 범위 내에서 크게 벗어나지 않고 분포하는 것으로 분석 되었 다. 하지만 도 14의 왼쪽 녹색박스의 (b), (d)와 오른쪽 하늘색 박스의 (e) 같은 경우 실제 데이터 분포와 생성 데이터 분포가 나뉘는 것으로 분석되었다. 7. CA-TimeGAN의 최적 학습 수 최적의 CA-TimeGAN 모델 학습 수는 확률분포 유사도, 판별점수 및 예측점수에서 가장 낮은 학습 수를 종합적으 로 평가하였다. CA-TimeGAN은 확률분포 유사도, 판별점수, 예측점수에서 학습 반복수가 10,000번일 때 가장 낮 은 점수를 보였다. 결과적으로, 지하 공동구 화재 데이터 생성을 위한 최적의 CA-TimeGAN 모델 학습 수는 10,000번으로 분석되었다. 8. 결론 지하 공동구는 도시민의 삶의 질 향상과 산업 발전에 직결된 국가 중요시설이다. 지하 공동구 화재로 인한 피해 를 최소화하기 위해서는 첨단 기술을 기반으로 관리체계를 구축해야 한다. 화재 예측 및 탐지 등의 인공지능 학 습을 위해 지하공동구 내에서 직접 화재를 내는 것은 불가능하기 때문에, 화재 시뮬레이션(FDS)을 통해 화재 데 이터를수집하는 것이 현실적이다. 그러나 환경, 화재 강도, 시설물 등 각종 조건에 따라 다양한 양상으로 화재가 변화하기 때문에, FDS만으로 수 집한 데이터로 학습을 하는 것은 다양한 화재 상황을 학습하는 데 한계가 있다. 이에 재난 데이터 생성모델을 통해 다양한 재난 데이터 수집을 통해 재난 모니터링 체계 구현을 현실화해야 한다. 본 발명에서는 어텐션 매커 니즘, CNN 및 GRU를 결합하여 시·공간적 특성을 확률분포 공간에 반영하여 재난 데이터를 생성하는 CA-TimeGAN 을 제안하였다. 실험을 통해 CA-TimeGAN 기반 생성 데이터의 실제 데이터와의 유사도를 측정하고, 예측 모델 등 다른 모델에서 활용할 수 있는 지를 검증하였다. 또한 GRU로 시간정보만 반영한 기존의 TimeGAN과의 모델 성능을 비교하였다. 첫 번째로, 생성 데이터와 실제 데이터의 확률 분포 유사도를 측정했을 때, CA-TimeGAN으로 생성한 데이터의 경 우 TimeGAN보다 확률분포 유사도가 약 29.7% 향상된 것으로 분석되었다. 두 번째로, 분류모델을 이용하여 실제 데이터와 생성 데이터를 분류하여 판별점수를 측정하였다. CA-TimeGAN과 TimeGAN 모두 달성한 최저 판별점수는 0.5였다. 세 번째로, 예측 모델의 예측력 향상에 생성 데이터가 영향이 있는 지 확인하였다. CA-TimeGAN로 생성한 데이터를 포함하여 학습한 예측 모델의 성능은 0.016675으로, 실제 데이터로만 학습한 예 측 모델의 예측력은 0.049134, TimeGAN은 0.021649이었으며, 예측력이 각각 약 66.1%, 22.9% 향상 된 것을 확 인하였다. 네 번째로, PCA와 t-SNE로 차원을 축소하고, 데이터 분포를 시각화하여 질적 평가를 하였다. PCA분석을 통해서는 TimeGAN 생성 데이터의 경우 실제 데이터 분포 범위 내에서 넓게 분포하였으나, CA-TimeGAN 의 경우 특정 구간 내에서 분포하는 것으로 확인되었다. 3차원 t-SNE 분석에서는 실제 데이터와 생성 데이터 분 포가 유사하게 형성되었으나, 특정 학습 반복 수에서는 데이터가 분리되어 분포하는 경우도 확인되었다. 결론적으로, CA-TimeGAN으로 생성된 데이터는 기존 TimeGAN보다 향상된 품질의 데이터를 생성할 수 있을 것으로 기대된다. 또한, 생성 데이터를 기반으로 화재 예측 모델의 예측력을 향상하고, 다양한 상황의 화재 탐지 모델 등에도 반영하여 활용할 수 있을 것으로 기대된다. 지하 공동구 재난 데이터 수집이 불가한 상황에서, 재난 관 리 체계 구축을 위한 인공지능 학습을 위한 현실적인 대안이 될 수 있다.상술한 여러 가지 예로 본 발명을 설명하였으나, 본 발명은 반드시 이러한 예들에 국한되는 것이 아니고, 본 발 명의 기술사상을 벗어나지 않는 범위 내에서 다양하게 변형 실시될 수 있다. 따라서 본 발명에 개시된 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 예들에 의하여 본 발명의 기 술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0118730", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 GRU의 구조를 도시한 것이다. 도 2는 TimeGAN의 블록 다이어그램을 도시한 것이다. 도 3은 TimeGAN의 학습 단계도를 도시한 것이다. 도 4는 본 발명에 의한 CA-TimeGAN의 구조를 도시한 것이다. 도 5는 본 발명에 의한 CA-TimeGAN 모델이 수행되는 과정에 대한 절차흐름도이다. 도 6은 본 발명에의 실험에 사용된 오창 지하공동구 시뮬레이션 환경을 도시한 것이다. 도 7은 본 발명에의 실험에 사용된 시뮬레이션 환경 변수를 도시한 것이다. 도 8은 본 발명의 실험에서 생성한 데이터와 실제 데이터 간 분포 유사도를 비교한 그래프이다. 도 9는 본 발명의 실험에서 생성 데이터의 판별점수를 평가하기 위한 분류 알고리즘 구성도이다. 도 10은 본 발명의 실험에서 TimeGAN과 CA-TimeGAN의 판별점수 결과이다 도 11은 본 발명의 실험에서 시계열 예측 모델 구조이다 도 12는 본 발명의 실험에서 예측 점수를 도시한 것이다. 도 13은 본 발명의 실험에서 TimeGAN과 CA-TimeGAN으로 생성한 PCA 결과이다. 도 14는 본 발명의 실험에서 생성된 데이터와 실제 데이터의 분포를 t-SNE로 계산한 결과이다."}
