{"patent_id": "10-2022-0034625", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0137030", "출원번호": "10-2022-0034625", "발명의 명칭": "캠핑장 예약 서비스 제공 방법 및 플랫폼 장치", "출원인": "박준성", "발명자": "박준성"}}
{"patent_id": "10-2022-0034625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 캠핑장 단말로부터 날짜별 사용자가 이용 가능한 캠핑 장소에 대한 캠핑장 정보를 수신하는 단계;사용자 단말로부터 사용자가 캠핑장을 이용하고자 하는 지역 및 기간 정보를 포함하는 예약 문의 정보를 수신받는 단계;상기 캠핑장 정보 및 상기 예약 문의 정보를 기반으로 상기 사용자 단말에 예약 가능한 적어도 하나 이상의 캠핑장 리스트를 제공하는 단계;상기 사용자 단말로부터 상기 캠핑장 리스트 중 어느 하나의 캠핑장에 대한 예약 요청 정보를 수신하는 단계;및상기 캠핑장에 대한 예약 과정을 실행하는 단계를 포함하는 것을 특징으로 하는 캠핑장 예약 서비스 제공 방법."}
{"patent_id": "10-2022-0034625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 캠핑장 정보를 수신하는 단계는,상기 캠핑장별 캠핑장소에 대한 360도 뷰를 촬영한 캠핑장 영상 정보를 수신하는 것을 특징으로 하는 캠핑장 예약 서비스 제공 방법."}
{"patent_id": "10-2022-0034625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 캠핑장 리스트를 제공하는 단계는,상기 캠핑장의 지역, 이름, 가격, 평수, 이용 가능 물품 중 적어도 하나에 관한 정보와 상기 캠핑장 영상 정보를 함께 제공하는 것을 특징으로 하는 캠핑장 예약 서비스 제공 방법."}
{"patent_id": "10-2022-0034625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 사용자 단말로부터 실시간 캠핑장 영상 정보 요청을 수신하는 단계;상기 요청에 대응하여 상기 캠핑장에 구비된 적어도 하나의 카메라를 통해 획득한 실시간 영상 정보를 상기 캠핑장 단말로부터 수신받는 단계; 및상기 사용자 단말로 상기 실시간 영상 정보를 전송하는 단계를 더 포함하는 것을 특징으로 하는 캠핑장 예약 서비스 제공 방법."}
{"patent_id": "10-2022-0034625", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "복수의 캠핑장 단말로부터 날짜별 사용자가 이용 가능한 캠핑 장소에 대한 캠핑장 정보를 수신하는 캠핑장 정보수신부;사용자 단말로부터 사용자가 캠핑장을 이용하고자 하는 지역 및 기간 정보를 포함하는 예약 문의 정보를 수신받는 예약 문의 수신부;상기 캠핑장 정보 및 상기 예약 문의 정보를 기반으로 상기 사용자 단말에 예약 가능한 적어도 하나 이상의 캠핑장 리스트를 제공하는 캠핑장 리스트 제공부;상기 사용자 단말로부터 상기 캠핑장 리스트 중 어느 하나의 캠핑장에 대한 예약 요청 정보를 수신하는 예약 요공개특허 10-2023-0137030-3-청 수신부; 및상기 캠핑장에 대한 예약 과정을 실행하는 예약 정보 전달부를 포함하는 것을 특징으로 하는 캠핑장 예약 서비스 제공 플랫폼 장치."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 캠핑장 예약 서비스 제공 방법 및 플랫폼 장치에 관한 것으로, 더욱 상세하게는 이용자들에게 캠핑장 예약 전에 캠핑장의 실시간 영상 정보를 제공함으로써 신뢰성 있는 캠핑장 안내 서비스를 통해 고객 만족을 높일 수 있는 캠핑장 예약 서비스 제공 방법 및 플랫폼 장치에 관한 것이다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 캠핑장 예약 서비스 제공 방법 및 플랫폼 장치에 관한 것으로, 더욱 상세하게는 이용자들에게 캠핑장 예약 전에 캠핑장의 실시간 영상 정보를 제공함으로써 신뢰성 있는 캠핑장 안내 서비스를 통해 고객 만족을 높 일 수 있는 캠핑장 예약 서비스 제공 방법 및 플랫폼 장치에 관한 것이다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 많은 사람들이 여가를 즐기기 위해 캠핑장을 이용하고 있다. 캠핑이 새로운 트렌드로 자리잡으면서 국내에는 1900여개가 넘는 캠핑장이 운영되고 있으며 캠핑인구도 600만명 을 넘어서고 있다. 캠핑 산업은 매년 20~30%의 높은 성장률을 보이며 2조 넘는 시장을 형성하고 있다. 종래의 캠핑장을 예약하는 방법으로는, 서비스 이용자가 이용을 희망하는 캠핑장으로 전화를 하여 희망 시간에 예약이 가능한지 여부를 확인하여 예약을 하는 방법, 컴퓨터 예약 시스템을 이용하여 예약을 하는 방법 등이 있 다. 이 중에서, 인터넷 기술의 발달과 통신 단말기의 보급에 따라 컴퓨터 예약 시스템을 이용하는 방법이 널리 사용 되고 있다. 하지만, 캠핑장 예약자들은 막상 실제 캠핑장에 가서 캠핑장을 보면 제공된 사진의 모습과는 많이 달라서 실망 하는 일이 많고, 예약을 취소하기에는 위약금을 거의 100% 물어야 하거나, 예약 취소가 아예 불가능하는 등 서 비스 이용자의 불만이 야기되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-2246586호"}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 상술한 바와 같은 문제점을 해결하기 위하여 제안된 것으로, 이용자들에게 캠핑장 예약 전에 캠핑장의 실시간 영상 정보를 제공함으로써 신뢰성 있는 캠핑장 안내 서비스를 통해 고객 만족을 높일 수 있는 캠핑장 예약 서비스 제공 방법 및 플랫폼 장치를 제공하는데 목적이 있다. 본 발명의 목적은 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 실시예에 따른 캠핑장 예약 서비스 제공 방법은 복수의 캠핑장 단 말로부터 날짜별 사용자가 이용 가능한 캠핑 장소에 대한 캠핑장 정보를 수신하는 단계; 사용자 단말로부터 사 용자가 캠핑장을 이용하고자 하는 지역 및 기간 정보를 포함하는 예약 문의 정보를 입력받는 단계; 상기 캠핑장 정보 및 상기 예약 문의 정보를 기반으로 상기 사용자 단말에 예약 가능한 적어도 하나 이상의 캠핑장 리스트를 제공하는 단계; 상기 사용자 단말로부터 상기 캠핑장 리스트 중 어느 하나의 캠핑장에 대한 예약 요청 정보를 수신하는 단계; 및 상기 캠핑장에 대한 예약 과정을 실행하는 단계를 포함한다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 이용자들에게 캠핑장 예약 전에 캠핑장의 실시간 영상 정보를 제공함으로써 신뢰성 있는 캠핑장 안내 서비스를 통해 고객 만족을 높일 수 있다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 이상에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로부 터 본 발명이 속하는 기술 분야의 통상의 지식을 가진 자에게 명확히 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 목적 및 효과, 그리고 그것들을 달성하기 위한 기술적 구성들은 첨부되는 도면과 함께 상세하게 후술 될 실시 예들을 참조하면 명확해질 것이다. 본 발명을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리 고 뒤에 설명되는 용어들은 본 발명에서의 구조, 역할 및 기능 등을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있"}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다. 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 오로지 특허청구범위에 기재된 청구항의 범주에 의하여 정의될 뿐이다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하에서는 첨부한 도면을 참조하며, 본 발명의 바람직한 실시예들을 보다 상세하게 설명하기로 한다. 한편, 본 발명의 실시 예에 있어서, 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수도 있다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터, 휴 대용 노트북 컴퓨터, 네트워크 컴퓨터 등 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 장치 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스 트럭션들이 아래에서 설명할 블록도의 각 블록 또는 흐름도의 각 단계에서 설명된 기능들을 수행하는 수단을 생 성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 장치 또는 기 타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 장치에 이용 가능한 메모리 또는 컴퓨터 판 독 가능 메모리에 저장되는 것도 가능하므로, 블록도의 각 블록 또는 흐름도 각 단계에서 설명된 기능을 수행하 는 인스트럭션 수단을 내포하는 제조물을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 장 치 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 장치 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되기 위한 프로세스를 생성하여 블록 도의 각 블록 및 흐름도의 각 단계에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록 또는 각 단계는 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들 을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 블록들 또 는 단계들에서 언급된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시 되어 있는 두 개의 블록들 또는 단계들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들 또는 단계들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이하에서는 본 발명에 따른 소규모 태양광 전력 거래 지원 시스템, 서버 및 방법에 대하여 첨부된 도면을 참고 하여 보다 구체적으로 설명하기로 한다.도 1은 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 플랫폼 시스템의 구성을 도시하는 블록도이고, 도 2는 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 장치의 구성을 도시하는 블록도이며, 도 3은 본 발명 의 일 실시예에 따른 캠핑장 예약 서비스 제공 애플리케이션의 실행화면의 일 예를 도시한다. 본 발명에 따른 캠핑장 예약 서비스 제공 플랫폼 시스템은 복수의 캠핑장 각각의 단말, 사용자 단말 및 캠핑장 예약 서비스 제공 장치를 포함한다. 복수의 캠핑장 단말 각각은 캠핑장 예약 서비스 제공 장치로 날짜별 사용자들이 이용 가능한 캠핑 장 소에 대한 캠핑장 정보를 전송한다. 일 실시예로, 상기 캠핑장 정보는 날짜별 사용자들이 이용 가능한 캠핑 장 소(방, 테크, 텐트 등), 인원 수, 이용 가능한 장치, 이용 가능한 시설 및 장비들에 관한 정보 중 적어도 하나 를 포함하고, 특히 캠핑 장소에 대한 360도 뷰를 촬영한 캠핑장 영상 정보를 더 포함할 수 있다. 구체적으로, 캠핑장 영상 정보는 캠핑장의 다중 위치에서 촬영된 복수의 360도 비디오 촬영 정보를 포함할 수 있다. 이를 위해, 캠핑장의 곳곳에는 복수의 IP 카메라가 설치되어 있으며, 예를 들어 고성능의 사양을 적용하여 영상 송수신시 발생하는 딜레이를 최소화하면서 촬영한 영상 데이터를 중계기와 연결된 캠핑장 단말 장치(미도시)를 통해 NVR로 전송하여 저장할 수 있다. 본 발명의 일 실시예에서는 IP 카메라로서 360도 동영상을 촬영할 수 있 는 장치를 채용할 수 있고, IP 카메라를 중심으로 360도의 화각으로 동영상을 촬영할 수 있다. 사용자 단말은 사용자 단말의 소지자인 사용자가 캠핑장을 이용하고자 하는 지역 및 기간 정보를 포함하는 예약 문의 정보를 캠핑장 예약 서비스 제공 장치로 전송할 수 있다. 일 예로, 사용자 단말은 스마트폰 등 이동 통신 단말기, 개인용 컴퓨터, 노트북, PDA, 태블릿, IPTV 등을 위한 셋톱박스, 인공지능 스피커 또는 네트워크 서버 등 임의의 컴퓨팅 장치일 수 있다. 예를 들어, 캠핑장 예약 서비스 제공 장치는 사용자 단말 상에서 실행되는 애플리케이션(또는 앱)의 동작을 가능하게 하는 애플리케이션 서비스 서버일 수 있다. 또는, 캠핑장 예약 서비스 제공 장치는 사용자 단말 상에서 실행되는 웹 브라우저에 의하여 접근 가 능한 웹 페이지를 제공하는 웹 서버일 수도 있다. 그러나 이는 예시적인 것으로서, 다른 실시예에서는 캠핑장 예약 서비스 제공 장치는 자체가 서버가 아니라 스마트폰 등 사용자 단말의 형태로 구현될 수도 있다. 본 명세서에 기재된 장치들은 전적으로 하드웨어이거나, 또는 부분적으로 하드웨어이고 부분적으로 소프트웨어 인 측면을 가질 수 있다. 예컨대, 캠핑장 단말, 사용자 단말, 캠핑장 예약 서비스 제공 장치는 특정 형식 및 내용의 데이터를 전자통신 방식으로 주고받기 위한 장치 및 이에 관련된 소프트웨어를 통칭할 수 있다. 본 명세서에서 \"부(unit)\", \"모듈(module)\", \"서버\", \"시스템\", \"플랫폼\", \"장치\" 또는 \"단말\" 등의 용 어는 하드웨어 및 해당 하드웨어에 의해 구동되는 소프트웨어의 조합을 지칭하는 것으로 의도된다. 예를 들어, 여기서 하드웨어는 CPU 또는 다른 프로세서(processor)를 포함하는 데이터 처리 기기일 수 있다. 또한, 하드웨 어에 의해 구동되는 소프트웨어는 실행중인 프로세스, 객체(object), 실행파일(executable), 실행 스레드 (thread of execution), 프로그램(program) 등을 지칭할 수 있다. 캠핑장 예약 서비스 제공 장치는 도 2에 도시된 바와 같이, 캠핑장 정보 수신부, 예약 문의 수신부 , 캠핑장 리스트 제공부, 예약 요청 수신부 및 예약 정보 전달부를 포함한다. 캠핑장 정보 수신부는 복수의 캠핑장 단말로부터 날짜별 사용자들이 이용 가능한 캠핑 장소에 대한 캠핑장 정보를 수신한다. 일 실시예로, 상기 캠핑장 정보는 날짜별 사용자들이 이용 가능한 캠핑 장소(방, 테크, 텐트 등), 인원 수, 이용 가능한 장치, 이용 가능한 시설 및 장비들에 관한 정보 중 적어도 하나를 포함 하고, 특히 캠핑 장소에 대한 360도 뷰를 촬영한 캠핑장 영상 정보를 더 포함할 수 있다. 구체적으로, 캠핑장 영상 정보는 캠핑장의 다중 위치에서 촬영된 복수의 360도 비디오 촬영 정보를 포함할 수 있다. 이를 위해, 캠핑장의 곳곳에는 복수의 IP 카메라가 설치되어 있으며, 예를 들어 고성능의 사양을 적용하여 영상 송수신시 발생하는 딜레이를 최소화하면서 촬영한 영상 데이터를 중계기와 연결된 캠핑장 단말 장치를 통해 NVR로 전송하여 저장할 수 있다. 본 발명의 일 실시예에서는 IP 카메라로서 360도 동영상을 촬영할 수 있는 장치를 채용할 수 있고, IP 카메라를 중심으로 360도의 화각으로 동영상을 촬영할 수 있다. 예약 문의 수신부는 사용자 단말로부터 예약 문의 정보를 수신할 수 있다. 여기서, 예약 문의 정보는 사용자가 캠핑하고자 하는 날짜, 인원수, 애완 동물 유무에 관한 정보 등을 포함할 수 있다. 캠핑장 리스트 제공부는 상기 예약 문의 정보에 기초하여, 상기 예약 문의 정보에 포함된 조건에 부합하는 적어도 하나 이상의 캠핑장들에 관한 정보를 검출하고, 검출된 적어도 하나 이상의 캠핑장에 관한 정보를 캠핑 장 리스트로 사용자 단말에 전송할 수 있다. 그리고, 예약 요청 수신부는 사용자 단말에 캠핑장 정보를 제공한 이후, 사용자 단말로부터 어 느 하나의 캠핑장에 대한 예약 요청 정보를 수신할 수 있다. 이에, 예약 정보 전달부는 예약 요청 정보에 따라 해당 캠핑장의 캠핑장 단말 장치로 예약 정보를 전달함으로써, 예약 과정을 진행시킬 수 있다. 즉, 캠핑장 예약 서비스 제공 장치는 해당 캠핑장에 구비된 캠핑장 단말 장치로 해당 캠핑장 식별 정보와 예약 정보를 전송하고, 이에 캠핑장 단말 장치는 사용자 단말로 예약안내정보를 전송하며, 사용자가 선택 한 캠핑장 정보와 예약날짜와 전체 이용자 정보가 입력되면 이를 저장할 수 있다. 도 4는 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 방법을 설명하기 위한 흐름도이다. 본 실시예에 따른 캠핑장 예약 서비스 제공 방법은, 도 2의 장치와 실질적으로 동일한 구성에서 진행될 수 있다. 따라 서, 도 2의 장치와 동일한 구성요소는 동일한 도면부호를 부여하고, 반복되는 설명은 생략한다. 또한, 본 실시예에 따른 캠핑장 예약 서비스 제공 방법은 캠핑장 정보 제공 및 예약을 수행하기 위한 소프트웨 어(어플리케이션)에 의해 실행될 수 있다. 캠핑장 예약 서비스 제공 장치가 복수의 캠핑장 단말로부터 날짜별 사용자가 이용 가능한 캠핑 장소에 대 한 캠핑장 정보를 수신하는 단계(S210), 사용자 단말로부터 사용자가 캠핑장을 이용하고자 하는 지역 및 기간 정보를 포함하는 예약 문의 정보를 수신받는 단계(S220), 상기 캠핑장 정보 및 상기 예약 문의 정보를 기반으로 상기 사용자 단말에 예약 가능한 적어도 하나 이상의 캠핑장 리스트를 제공하는 단계(S230), 상기 사용자 단말 로부터 상기 캠핑장 리스트 중 어느 하나의 캠핑장에 대한 예약 요청 정보를 수신하는 단계(S240) 및 상기 캠핑 장에 대한 예약 과정을 실행하는 단계(S250)를 포함할 수 있다. 여기서, S210 단계에서 상기 캠핑장 정보는 상기 캠핑장별 캠핑장소에 대한 360도 뷰를 촬영한 캠핑장 영상 정 보를 포함할 수 있다. 그리고, S230 단계에서 상기 캠핑장 리스트를 제공할 때, 상기 캠핑장의 지역, 이름, 가격, 평수, 이용 가능 물 품 중 적어도 하나에 관한 정보와 상기 캠핑장 영상 정보를 함께 제공할 수 있다. 한편, 캠핑장 예약 서비스 제공 방법은, 상기 사용자 단말로부터 실시간 캠핑장 영상 정보 요청을 수신하는 단 계, 상기 요청에 대응하여 상기 캠핑장에 구비된 적어도 하나의 카메라를 통해 획득한 실시간 영상 정보를 상기 캠핑장 단말로부터 수신받는 단계 및 상기 사용자 단말로 상기 실시간 영상 정보를 전송하는 단계를 더 포함할 수 있다. 본 발명의 실시예에 따르면, 이용자들에게 캠핑장 예약 전에 캠핑장의 실시간 영상 정보를 제공함으로써 신뢰성 있는 캠핑장 안내 서비스를 통해 고객 만족을 높일 수 있다. 이상, 본 발명의 특정 실시예에 대하여 상술하였다. 그러나, 본 발명의 사상 및 범위는 이러한 특정 실시예에 한정되는 것이 아니라, 본 발명의 요지를 변경하지 않는 범위 내에서 다양하게 수정 및 변형이 가능하다는 것을 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이해할 것이다."}
{"patent_id": "10-2022-0034625", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "따라서, 이상에서 기술한 실시예들은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이므로, 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 하 며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2022-0034625", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 플랫폼 시스템의 구성을 도시하는 블록도이다. 도 2는 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 장치의 구성을 도시하는 블록도이다. 도 3은 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 애플리케이션의 실행화면의 일 예를 도시한다. 도 4는 본 발명의 일 실시예에 따른 캠핑장 예약 서비스 제공 방법을 설명하기 위한 흐름도이다."}
