{"patent_id": "10-2023-0102427", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0020987", "출원번호": "10-2023-0102427", "발명의 명칭": "인공지능 기반 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법 및 장치", "출원인": "김규한", "발명자": "김규한"}}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받는 단계;상기 관리 대상 항목 중에서 사유 발생일을 포함하는 변경 대상 항목을 추출하는 단계;상기 변경 대상 항목의 사유 발생일을 기초로 상기 변경 대상 항목의 변경 기한일 및 알림 기한일을 산출하는단계; 및상기 알림 기한일이 도래하면 상기 변경 대상 항목에 대한 알림 메시지를 상기 사용자 단말에 전송하는 단계를포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 알림 메시지는상기 변경 대상 항목, 상기 변경 기한일, 상기 변경 대상 항목과 연관된 준비 사항 정보, 상기 변경 대상 항목관련 법령 정보, 상기 변경 기한일 도과에 따른 과태료 정보, 상법 제635조 과태료에 처할 행위(비송사건절차법제248조) 제①항 및 제②항, 제③항, 제④항에 규정된 항목, 고용 노동 분야에서 건설근로자의 고용 개선 등에관한 법률(제26조)을 포함하는 26개 법률에 규정된 항목, 보건 안전 분야에서 감염병의 예방 및 관리에 관한 법률(제83조)을 포함하는 115개 법률에 규정된 항목, 교육 과학기술 분야에서 상표법(제237조)을 포함하는 81개법률에 규정된 항목, 안보 경찰 분야에서 병역법(제95조)를 포함하는 14개 법률에 규정된 항목, 국토 교통 분야에서 개발이익환수에관한법률(제29조)를 포함하는 91개 법률에 규정된 항목, 환경 분야에서 먹는물관리법(제61조)을 포함하는 50개 법률에 규정된 항목, 산업 분야에서 소상공인보호및지원에관한법률(제30조) 을 포함하는52개 법률에 규정된 항목, 금융재정 분야에서 소득세법(제177조)을 포함하는 50개 법률에 규정된 항목, 농림 축산 분야 에서 농수산물의원산지표시에관한법률(제18조)를 포함하는 50개 법률에 규정된 항목, 문화 체육 분야에서 공연법(제39조)을 포함하는 35개 법률에 규정된 항목 중 적어도 하나를 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 사용자 단말에 상기 알림 메시지를 전송한 이후 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하는 단계;상기 과태료 방지 행위 진행 요청 메시지에 기초하여 상기 변경 대상 항목에 대한 변경 등기 신청을 위한 변경신청 서식을 생성하는 단계; 및상기 변경 신청 서식을 관할관청 서버에 전송하여 변경 등기를 신청하는 단계를 더 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2025-0020987-3-제3항에 있어서,상기 변경 등기 신청이 완료된 이후 상기 관할관청 서버에 상기 변경 등기의 완료 여부에 대한 확인을 요청하는단계; 및상기 변경 등기가 완료된 것으로 확인되면 상기 사용자 단말에 변경 등기 완료 메시지를 전송하는 단계를 더 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 변경 기한일이 경과할 때까지 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하지 못한 경우 상기 사용자 단말에 등기 과태 알림 메시지를 전송하는 단계를 더 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받는 입력부;상기 관리 대상 항목 중에서 사유 발생일을 포함하는 변경 대상 항목을 추출하고, 상기 변경 대상 항목의 사유발생일을 기초로 상기 변경 대상 항목의 변경 기한일 및 알림 기한일을 산출하는 일정 관리부; 및상기 알림 기한일이 도래하면 상기 변경 대상 항목에 대한 알림 메시지를 상기 사용자 단말에 전송하는 알림부를 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 알림 메시지는상기 변경 대상 항목, 상기 변경 기한일, 상기 변경 대상 항목과 연관된 준비 사항 정보, 상기 변경 대상 항목관련 법령 정보, 상기 변경 기한일 도과에 따른 과태료 정보, 상법 제635조 과태료에 처할 행위(비송사건절차법제248조) 제①항 및 제②항, 제③항, 제④항에 규정된 항목, 고용 노동 분야에서 건설근로자의 고용 개선 등에관한 법률(제26조)을 포함하는 26개 법률에 규정된 항목, 보건 안전 분야에서 감염병의 예방 및 관리에 관한 법률(제83조)을 포함하는 115개 법률에 규정된 항목, 교육 과학기술 분야에서 상표법(제237조)을 포함하는 81개법률에 규정된 항목, 안보 경찰 분야에서 병역법(제95조)를 포함하는 14개 법률에 규정된 항목, 국토 교통 분야에서 개발이익환수에관한법률(제29조)를 포함하는 91개 법률에 규정된 항목, 환경 분야에서 먹는물 관리법(제61조)을 포함하는 50개 법률에 규정된 항목, 산업 분야에서 소상공인보호및지원에관한법률(제30조) 을 포함하는52개 법률에 규정된 항목, 금융재정 분야에서 소득세법(제177조)을 포함하는 50개 법률에 규정된 항목, 농림 축산 분야 에서 농수산물의원산지표시에관한법률(제18조)를 포함하는 50개 법률에 규정된 항목, 문화 체육 분야에서 공연법(제39조)을 포함하는 35개 법률에 규정된 항목 중 적어도 하나를 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,공개특허 10-2025-0020987-4-상기 사용자 단말에 상기 알림 메시지를 전송한 이후 상기 입력부가 상기 사용자 단말로부터 과태료 방지 행위진행 요청 메시지를 수신하면, 상기 과태료 방지 행위 진행 요청 메시지에 기초하여 상기 변경 대상 항목에 대한 변경 등기 신청을 위한 변경 신청 서식을 생성하고, 상기 변경 신청 서식을 관할관청 서버에 전송하여 변경등기를 신청하는 등기 및 납부 관리부를 더 포함하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 등기 및 납부 관리부는상기 변경 등기 신청이 완료된 이후 상기 관할관청 서버에 상기 변경 등기의 완료 여부에 대한 확인을요청하고, 상기 변경 등기가 완료된 것으로 확인되면 상기 사용자 단말에 변경 등기 완료 메시지를 전송하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치."}
{"patent_id": "10-2023-0102427", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 알림부는상기 변경 기한일이 경과할 때까지 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하지 못한 경우 상기 사용자 단말에 등기 과태 알림 메시지를 전송하는법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치."}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법 및 장치에 관한 것이다. 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법은, 사용자 단말로부터 각각의 관리 대상 항목 에 대응되는 등기 데이터를 입력받는 단계, 상기 관리 대상 항목 중에서 사유 발생일을 포함하는 변경 대상 항목 (뒷면에 계속)"}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "에서 상표법(제237조)을 포함하는 81개 법률에 규정된 항목, 안보 경찰 분야에서 병역법(제95조)를 포함하는 14개 법률에 규정된 항목, 국토 교통 분 야에서 개발이익환수에관한법률(제29조)를 포함하는 91개 법률에 규정된 항목, 환경 분야에서 먹는물관리법(제 61조)을 포함하는 50개 법률에 규정된 항목, 산업 분야에서 소상공인보호및지원에관한법률(제30조) 을 포함하는 52개 법률에 규정된 항목, 금융재정 분야에서 소득세법(제177조)을 포함하는 50개 법률에 규정된 항목, 농림 축 산 분야 에서 농수산물의원산지표시에관한법률(제18조)를 포함하는 50개 법률에 규정된 항목, 문화 체육 분야에 서 공연법(제39조)을 포함하는 35개 법률에 규정된 항목 중 적어도 하나를 포함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법. 청구항 3 제1항에 있어서, 상기 사용자 단말에 상기 알림 메시지를 전송한 이후 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시 지를 수신하는 단계; 상기 과태료 방지 행위 진행 요청 메시지에 기초하여 상기 변경 대상 항목에 대한 변경 등기 신청을 위한 변경 신청 서식을 생성하는 단계; 및 상기 변경 신청 서식을 관할관청 서버에 전송하여 변경 등기를 신청하는 단계를 더 포함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법. 청구항 4 제3항에 있어서, 상기 변경 등기 신청이 완료된 이후 상기 관할관청 서버에 상기 변경 등기의 완료 여부에 대한 확인을 요청하는 단계; 및 상기 변경 등기가 완료된 것으로 확인되면 상기 사용자 단말에 변경 등기 완료 메시지를 전송하는 단계를 더 포 함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법. 청구항 5 제1항에 있어서, 상기 변경 기한일이 경과할 때까지 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하지 못 한 경우 상기 사용자 단말에 등기 과태 알림 메시지를 전송하는 단계를 더 포함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법. 청구항 6 사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받는 입력부; 상기 관리 대상 항목 중에서 사유 발생일을 포함하는 변경 대상 항목을 추출하고, 상기 변경 대상 항목의 사유 발생일을 기초로 상기 변경 대상 항목의 변경 기한일 및 알림 기한일을 산출하는 일정 관리부; 및 상기 알림 기한일이 도래하면 상기 변경 대상 항목에 대한 알림 메시지를 상기 사용자 단말에 전송하는 알림부 를 포함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치. 청구항 7 제6항에 있어서, 상기 알림 메시지는 상기 변경 대상 항목, 상기 변경 기한일, 상기 변경 대상 항목과 연관된 준비 사항 정보, 상기 변경 대상 항목 관련 법령 정보, 상기 변경 기한일 도과에 따른 과태료 정보, 상법 제635조 과태료에 처할 행위(비송사건절차법 제248조) 제①항 및 제②항, 제③항, 제④항에 규정된 항목, 고용 노동 분야에서 건설근로자의 고용 개선 등에 관한 법률(제26조)을 포함하는 26개 법률에 규정된 항목, 보건 안전 분야에서 감염병의 예방 및 관리에 관한 법 률(제83조)을 포함하는 115개 법률에 규정된 항목, 교육 과학기술 분야에서 상표법(제237조)을 포함하는 81개 법률에 규정된 항목, 안보 경찰 분야에서 병역법(제95조)를 포함하는 14개 법률에 규정된 항목, 국토 교통 분 야에서 개발이익환수에관한법률(제29조)를 포함하는 91개 법률에 규정된 항목, 환경 분야에서 먹는물 관리법(제 61조)을 포함하는 50개 법률에 규정된 항목, 산업 분야에서 소상공인보호및지원에관한법률(제30조) 을 포함하는 52개 법률에 규정된 항목, 금융재정 분야에서 소득세법(제177조)을 포함하는 50개 법률에 규정된 항목, 농림 축 산 분야 에서 농수산물의원산지표시에관한법률(제18조)를 포함하는 50개 법률에 규정된 항목, 문화 체육 분야에 서 공연법(제39조)을 포함하는 35개 법률에 규정된 항목 중 적어도 하나를 포함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치. 청구항 8 제6항에 있어서,상기 사용자 단말에 상기 알림 메시지를 전송한 이후 상기 입력부가 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하면, 상기 과태료 방지 행위 진행 요청 메시지에 기초하여 상기 변경 대상 항목에 대 한 변경 등기 신청을 위한 변경 신청 서식을 생성하고, 상기 변경 신청 서식을 관할관청 서버에 전송하여 변경 등기를 신청하는 등기 및 납부 관리부를 더 포함하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치. 청구항 9 제8항에 있어서, 상기 등기 및 납부 관리부는 상기 변경 등기 신청이 완료된 이후 상기 관할관청 서버에 상기 변경 등기의 완료 여부에 대한 확인을 요청하고, 상기 변경 등기가 완료된 것으로 확인되면 상기 사용자 단말에 변경 등기 완료 메시지를 전송하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치. 청구항 10 제8항에 있어서, 상기 알림부는 상기 변경 기한일이 경과할 때까지 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하지 못 한 경우 상기 사용자 단말에 등기 과태 알림 메시지를 전송하는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치. 발명의 설명 기 술 분 야 본 명세서는 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "통상적으로 법인은 법인의 소재지 변경, 상호 변경, 신규임원의 취임, 임원의 해임 등과 같은 변동 사항이 발생 하였을 때, 소재지 관할관청에 변경등기를 제출하여야 하며, 이러한 특별한 변동 사항이 없더라도 3년마다 임원 의 중임등기를 하여야 한다. 기한 내에 변경등기를 하지 않을 경우에는 과태료를 내야 하는 등의 불이익을 받게 된다. 또한 상법, 비송사건절차법, 상법상과태료부과기준지침, 민사집행법, 민법, 부동산등기법, 행정절차법, 질서위 반행위규제법 등 법인사무 중 변경사항 발생으로 과태료에 처할 행위 등 기한 내에 변경사무를 하지 않을 경우 에도 과태료를 내야 하는 등 불이익을 받게 된다. 회사에 법인 변경등기 업무를 담당하는 직원이 없는 중소기업의 경우에는, 변경등기 기한을 해태하여 변경등기 를 기한 내에 하지 못하는 경우가 비일비재하며, 법인사무 중 변경사항 발생으로 과태료에 처할 행위 등 기한 내에 변경사무를 하지 않을 경우에도 과태료를 내야 하는 등 불이익을 받게 된다. 이로 인해 행정청이나 법원으로부터 과태료 부과 처분 등의 불이익을 받게 된다. 또한, 법인의 임원이 빈번하게 변경되는 경우에도 그 취임 이후의 중임등기, 퇴임등기 사항을 일일이 확인하여 기한 내에 변경등기를 하지 못 하는 경우가 종종 발생한다. 그러나, 일반적인 법률사무소의 경우 의뢰 법인의 변경등기 기한을 체크해주고 있지 않으며 법인 스스로가 기한 을 체크하여야 하기 때문에 법인은 변경등기 기한을 종종 해태하게 된다. 또한, 법인이 법률사무소에 변경등기 업무를 위임하려면 해당 법률사무소를 방문하여 필요한 서류를 작성하여야 한다. 즉, 자신이 직접 관할관청에 가지 않고 법률사무소에 위임을 하더라도 법률사무소를 직접 방문하여 필요한 서류를 구비하여야 하기 때문에 시간을 많이 소모하며, 찾아가는 수고로움이 발생한다."}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서의 목적은 과태료가 부과될 수 있는 법률 위반 행위가 발생하거나 변경 기한일이 도래하기 전에 사용 자에게 미리 변경 등기에 대한 알림 정보를 제공함으로써, 규정된 기한 내에 변경 등기 등록사항 관련 신청의무 를 수행하지 않을 경우 행정청이나 법원에 의해서 부과될 수 있는 과태료나 범칙금 및 분쟁을 미연에 방지할 수 있는 효과가 있다. 본 명세서의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 명세서의 다른 목적 및 장점 들은 이하에서 기술되는 본 명세서의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 명세서의 목적 및 장점들은 청구범위에 기재된 구성요소들 및 그 조합에 의해 실현될 수 있다."}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법은, 사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받는 단계, 상기 관리 대상 항목 중에서 사유 발생일을 포함하는 변경 대상 항목을 추출하는 단계, 상기 변경 대상 항목의 사유 발생일을 기초로 상기 변경 대상 항목의 변경 기 한일 및 알림 기한일을 산출하는 단계 및 상기 알림 기한일이 도래하면 상기 변경 대상 항목에 대한 알림 메시 지를 상기 사용자 단말에 전송하는 단계를 포함할 수 있다. 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치는, 사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받는 입력부, 상기 관리 대상 항목 중에서 사유 발생일을 포함하 는 변경 대상 항목을 추출하고, 상기 변경 대상 항목의 사유 발생일을 기초로 상기 변경 대상 항목의 변경 기한 일 및 알림 기한일을 산출하는 등기 및 납부 관리부 및 상기 알림 기한일이 도래하면 상기 변경 대상 항목에 대 한 알림 메시지를 상기 사용자 단말에 전송하는 알림부를 포함할 수 있다."}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 따르면, 과태료가 부과될 수 있는 법률 위반 행위가 발생하거나 변경 기한일이 도래하기 전에 사용 자에게 미리 변경 등기에 대한 알림 정보를 제공함으로써, 규정된 기한 내에 변경 등기 등록사항 관련 신청의무 를 수행하지 않을 경우 행정청이나 법원에 의해서 부과될 수 있는 과태료나 범칙금 및 분쟁을 미연에 방지할 수 있는 효과가 있다."}
{"patent_id": "10-2023-0102427", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 명세서가 속하는 기술 분야에서 통상의 지식을 가진 자가 본 명세서의 실시예들을 용이하게 실시할 수 있을 것이다. 본 명세서를 설명 함에 있어서 본 명세서와 관련된 공지 기술에 대한 구체적인 설명이 본 명세서의 요지를 불필요하게 흐릴 수 있 다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 명세서의 바람직한 실시예 를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리킨다. 도 1은 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치의 구성도이다. 도 1을 참조하면, 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치는 입력부 , 일정 관리부, 알림부를 포함할 수 있다. 입력부는 사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받을 수 있다. 일 실시예에서, 관리 대상 항목은 법인명, 회계 결산월, 임원의 취임일, 임원직 명칭, 임원 성명, 임원 주소, 상호 목적 공고방법 변경사항(상호변경, 목적변경, 공고방법변경), 상호 목적 공고방법 변경일, 본점이전 변경 사항[관내 이전등기(이사회 결의), 관외 이전등기(정관 변경)], 본점이전 변경사항 발생일, 수권자본 및 발행주 식 변경사항(수권자본 변경, 발행주식 변경), 수권자본 및 발행주식 변경사항 발생일, 기타 변경사항[존립기간 (해산사유)변경], 기타 변경사항 발생일 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 관리 대상 항목은 상법 제635조 과태료에 처할 행위(비송사건절차법 제248조) 제①항 및 제②항, 제③항, 제④항에 규정된 항목 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 관리 대상 항목은 고용 노동 분야에서 건설근로자의 고용 개선 등에 관한 법률(제26조)을 포함 하는 26개 법률에 규정된 항목, 보건 안전 분야에서 감염병의 예방 및 관리에 관한 법률(제83조)을 포함하는 115개 법률에 규정된 항목, 교육 과학기술 분야에서 상표법(제237조)을 포함하는 81개 법률에 규정된 항목, 안 보 경찰 분야에서 병역법(제95조)를 포함하는 14개 법률에 규정된 항목, 국토 교통 분야에서 개발이익환수에관 한법률(제29조)를 포함하는 91개 법률에 규정된 항목, 환경 분야에서 먹는물 관리법(제61조)을 포함하는 50개 법률에 규정된 항목, 산업 분야에서 소상공인보호및지원에관한법률(제30조) 을 포함하는 52개 법률에 규정된 항 목, 금융재정 분야에서 소득세법(제177조)을 포함하는 50개 법률에 규정된 항목, 농림 축산 분야 에서 농수산물 의원산지표시에관한법률(제18조)를 포함하는 50개 법률에 규정된 항목, 문화 체육 분야에서 공연법(제39조)을 포함하는 35개 법률에 규정된 항목 중 적어도 하나를 포함할 수 있다. 일정 관리부는 관리 대상 항목 중에서 사유 발생일을 포함하는 변경 대상 항목을 추출하고, 변경 대상 항목 의 사유 발생일을 기초로 변경 대상 항목의 변경 기한일 및 알림 기한일을 산출할 수 있다. 일 실시예에서, 일정 관리부는 사용자 단말이나 적어도 하나의 외부 장치로부터 사용자가 속하는 기업의 기업정보를 수집할 수 있다. 일정 관리부는 텍스트 마이닝(text mining)을 통해 관리 대상 항목과 대응되는 법령정보에 포함된 규정 정보를 수집할 수 있다. 여기서 규정 정보는 법령규정, 정책자료, 판례정보 및 심의결 과정보를 포함할 수 있다. 일정 관리부는 기 설정된 항목을 기반으로 수집된 규정 정보를 분류할 수 있다. 일정 관리부는 인공지능 기반 사전 학습모델을 이용하여, 분류된 규정 정보 중 수집된 기업정보와 관련이 있는 규정을 매칭할 수 있다. 일정 관리부는 관련 규정에 대한 적어도 하나의 정보를 포함하는 규정 안내 정보를 생성하여 사용자 단말에 제공할 수 있다. 일 실시예에서, 일정 관리부는 사용자 단말에 의해 지정된 특정 규정 또는 이전에 매칭된 관련규정에 대 한 변동사항이 발생했는지 여부를 확인하고, 변동사항이 발생하면 변동정보를 포함하는 업데이트된 규정 안내 정보를 사용자 단말로 전송할 수 있다. 일 실시예에서, 규정 안내 정보는 규정 위반 여부, 규정 위험 지수 정보, 규정 당국 정보, 규정 관련 법령 정보, 법률 변경 정보 및 관련 법 조항을 포함할 수 있다. 일 실시예에서, 일정 관리부는 미리 정해진 다수의 기준 지수를 이용하여 각 기업의 규정 위반 위험도 지수 를 산출할 수 있다. 일 실시예에서, 미리 정해진 다수의 기준 지수는 수집된 기업정보 및 관련 규정 간의 관련 성을 나타내는 수치인 제1 지수, 기업이 해당 규정의 영향을 받을 확률을 나타내는 수치인 제2 지수를 포함할 수 있다. 제1 지수 및 제2 지수는 각 기업 별로 미리 정해진 값일 수 있다. 일 실시예에서, 일정 관리부는 상기 제1 지수 및 상기 제2 지수를 곱한 값을 미리 정해진 제3 지수로 나눈 값을 상기 규정 위반 위험도 지수로서 산출할 수 있다. 여기서 상기 제3 지수는 각 기업의 존속 기간을 각 기업 의 규정 위반 횟수로 나눈 값이다.일정 관리부는 규정 위반 위험도 지수를 기초로 각 기업의 규정 위반 가능성을 확인할 수 있다. 일정 관리 부는 사용자 단말에 규정 위반 위험도 지수를 제공할 수 있다. 알림부는 알림 기한일이 도래하면 변경 대상 항목에 대한 알림 메시지를 상기 사용자 단말에 전송할 수 있다. 일 실시예에서, 알림 메시지는 상기 변경 대상 항목, 상기 변경 기한일, 상기 변경 대상 항목과 연관된 준비 사 항 정보, 상기 변경 대상 항목 관련 법령 정보, 상기 변경 기한일 도과에 따른 과태료 정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치는 상기 사용자 단말에 상기 알림 메시지를 전송한 이후 상기 입력부가 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지 를 수신하면, 상기 과태료 방지 행위 진행 요청 메시지에 기초하여 상기 변경 대상 항목에 대한 변경 등기 신청 을 위한 변경 신청 서식을 생성하고, 상기 변경 신청 서식을 관할관청 서버에 전송하여 변경 등기를 신청하 는 등기 및 납부 관리부를 더 포함할 수 있다. 일 실시예에서, 등기 및 납부 관리부는 상기 변경 등기 신청이 완료된 이후 상기 관할관청 서버에 상기 변 경 등기의 완료 여부에 대한 확인을 요청하고, 상기 변경 등기가 완료된 것으로 확인되면 상기 사용자 단말 에 변경 등기 완료 메시지를 전송할 수 있다. 일 실시예에서, 알림부는 상기 변경 기한일이 경과할 때까지 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하지 못한 경우 상기 사용자 단말에 등기 과태 알림 메시지를 전송할 수 있다. 일 실시예에서, 일정 관리부는 규정 위반 위험도 지수를 기초로 알림 기한일 및 알림 횟수를 조절할 수 있 다. 일 실시예에서, 일정 관리부는 규정 위반 위험도 지수가 높을수록 변경 기한일과 알림 기한일 간의 차 이를 증가시킬 수 있다. 일 실시예에서, 일정 관리부는 규정 위반 위험도 지수가 높을수록 사용자 단말 에 대한 알림 횟수를 증가시킬 수 있다. 도 2는 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법의 흐름도이다. 또한 도 3은 일 실시예에서 입력부를 통해서 입력되는 등기 데이터의 예시를 나타내고, 도 4는 일 실시예에서 알림부를 통해서 사용자 단말에 제공되는 등기 과태 알림 메시지의 예시를 나타낸다. 도 1 및 도 2를 참조하면, 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치의 입력부는 사용자 단말로부터 각각의 관리 대상 항목에 대응되는 등기 데이터를 입력받을 수 있다(S31). 일 실시예에서, 관리 대상 항목은 법인명, 회계 결산월, 임원의 취임일, 임원직 명칭, 임원 성명, 임원 주소, 상호 목적 공고방법 변경사항(상호변경, 목적변경, 공고방법변경), 상호 목적 공고방법 변경일, 본점이전 변경 사항[관내 이전등기(이사회 결의), 관외 이전등기(정관 변경)], 본점이전 변경사항 발생일, 수권자본 및 발행주 식 변경사항(수권자본 변경, 발행주식 변경), 수권자본 및 발행주식 변경사항 발생일, 기타 변경사항[존립기간 (해산사유)변경], 기타 변경사항 발생일 중 적어도 하나를 포함할 수 있다. 도 3에는 입력부를 통해서 입력되는 등기 데이터의 예시가 나타나 있다. 도 3에 도시된 바와 같이, 사용자 (예컨대, 특정 법인의 담당자)는 사용자 단말을 통해서 법인명, 회계 결산월, 임원의 취임일, 임원직 명칭, 임원 성명, 임원 주소, 비고, 담당자 정보를 각각 입력할 수 있다. 사용자가 이러한 등기 데이터를 입력하면 등 기 데이터가 입력된 날짜가 업데이트 일로서 입력될 수 있다. 등기 데이터가 입력되면, 일정 관리부는 등기 데이터에 포함된 관리 대상 항목 중에서 사유 발생일을 포함 하는 변경 대상 항목을 추출할 수 있다(S32). 예컨대 일정 관리부는 A 법인의 등기 데이터에 포함된 관리 대상 항목 중에서 성명이 B인 임원의 취임일(예 컨대, 2023년 1월 1일)을 확인하고, B 임원의 성명, 임원직 명칭, 취임일을 각각 변경 대상 항목으로서 추출할 수 있다. 이어서 일정 관리부는 변경 대상 항목의 사유 발생일을 기초로 변경 대상 항목의 변경 기한일 및 알림 기한 일을 산출할 수 있다(S33). 예컨대 B 임원의 취임일(예컨대, 2023년 1월 1일)로부터 3년이 경과하면 상법 상 B 임원의 임기가 만료되므로, B 임원의 취임일로부터 3년 14일을 더한 날짜(예컨대, 2026년 1월 15일)까지 변경 등기(중임 등기 또는 퇴임 등 기)가 이루어져야 한다. 따라서 일정 관리부는 앞서 추출된 변경 대상 항목(B 임원의 성명, 임원직 명칭,취임일) 중에서 B 임원의 취임일(예컨대, 2023년 1월 1일)을 획득하고, B 임원의 취임일로부터 미리 정해진 법 정 기간을 더한 날짜(예컨대, 2026년 1월 15일), 즉 임기 만료일을 변경 기한일로서 산출할 수 있다. 또한 일정 관리부는 앞서 산출된 사유 발생일로부터 미리 정해진 알림 기간(예컨대, 3개월)을 뺀 날짜(예컨 대, 2025년 10월 15일)를 알림 기한일로서 산출할 수 있다. 예컨대 B 임원의 취임일로부터 3년 14일을 더한 날 짜(예컨대, 2026년 1월 15일)가 도래하기 3개월 전부터 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치는 사용자 단말을 통해서 사용자(A 법인의 담당자)에게 B 임원의 임기 만료로 인한 변경 등기가 필요 함을 알릴 수 있다. 알림부는 알림 기한일이 도래하면 변경 대상 항목에 대한 알림 메시지를 상기 사용자 단말에 전송할 수 있다. 일 실시예에서, 알림 메시지는 상기 변경 대상 항목, 상기 변경 기한일, 상기 변경 대상 항목과 연관된 준비 사 항 정보, 상기 변경 대상 항목 관련 법령 정보, 상기 변경 기한일 도과에 따른 과태료 정보 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 알림 메시지는 상법 제635조 과태료에 처할 행위(비송사건절차법 제248조) 제①항 및 제②항, 제③항, 제④항에 규정된 항목 중 적어도 하나를 포함할 수 있다. 일 실시예에서, 알림 메시지는 고용 노동 분야에서 건설근로자의 고용 개선 등에 관한 법률(제26조)을 포함하는 26개 법률에 규정된 항목, 보건 안전 분야에서 감염병의 예방 및 관리에 관한 법률(제83조)을 포함하는 115개 법률에 규정된 항목, 교육 과학기술 분야에서 상표법(제237조)을 포함하는 81개 법률에 규정된 항목, 안보 경찰 분야에서 병역법(제95조)를 포함하는 14개 법률에 규정된 항목, 국토 교통 분야에서 개발이익환수에관한법률 (제29조)를 포함하는 91개 법률에 규정된 항목, 환경 분야에서 먹는물관리법(제61조)을 포함하는 50개 법률에 규정된 항목, 산업 분야에서 소상공인보호및지원에관한법률(제30조) 을 포함하는 52개 법률에 규정된 항목, 금 융재정 분야에서 소득세법(제177조)을 포함하는 50개 법률에 규정된 항목, 농림 축산 분야 에서 농수산물의원산 지표시에관한법률(제18조)를 포함하는 50개 법률에 규정된 항목, 문화 체육 분야에서 공연법(제39조)을 포함하 는 35개 법률에 규정된 항목 중 적어도 하나를 포함할 수 있다. 도 4에는 일 실시예에서 알림부를 통해서 사용자 단말에 제공되는 등기 과태 알림 메시지의 예시가 나타나 있다. 도 4에 도시된 바와 같이, 알림부는 알림 메시지를 수신할 법인의 명칭, 변경 등기가 필요한 임원의 취임일, 임기 만료일, 임원직 명칭 및 임원 성명, 임원 주소, 변경 기한일, 변경 대상 항목 관련 법령 정보, 변 경 기한일 도과에 따른 과태료 정보가 포함된 등기 과태 알림 메시지를 자동으로 작성하고, 작성된 알림 메시지 를 사용자 단말에 제공할 수 있다. 일 실시예에서, 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치의 등기 및 납부 관리부는 상기 사용자 단말에 상기 알림 메시지를 전송한 이후 상기 입력부가 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하면, 상기 과태료 방지 행위 진행 요청 메시지에 기초하여 상기 변경 대상 항목에 대한 변경 등기 신청을 위한 변경 신청 서식을 생성하고, 상기 변경 신청 서식을 관할관청 서버에 전 송하여 변경 등기를 신청할 수 있다. 예컨대 도 4와 같은 메시지를 수신한 사용자가 사용자 단말을 통해서 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치에 과태료 방지 행위 진행 요청 메시지를 전송할 수 있다. 과태료 방지 행위 진행 요 청 메시지는 사용자가 변경 등기를 신청하고자 하는 관리 대상 항목이 포함된 등기 데이터를 포함할 수 있다. 등기 및 납부 관리부는 등기 데이터에 포함된 관리 대상 항목을 추출하고, 사용자가 요청한 변경 등기와 대 응되는 미리 저장된 변경 등기 서식 및 등기 데이터에 포함된 관리 대상 항목을 이용하여 변경 등기 신청을 위 한 서류를 자동으로 작성할 수 있다. 등기 및 납부 관리부는 작성된 서류를 관할관청 서버에 전송하여 사용자가 요청한 변경 등기를 신청할 수 있다. 일 실시예에서, 등기 및 납부 관리부는 상기 변경 등기 신청이 완료된 이후 관할관청 서버에 변경 등기 의 완료 여부에 대한 확인을 요청하고, 변경 등기가 완료된 것으로 확인되면 사용자 단말에 변경 등기 완료 메시지를 전송할 수 있다. 일 실시예에서, 알림부는 상기 변경 기한일이 경과할 때까지 상기 사용자 단말로부터 과태료 방지 행위 진행 요청 메시지를 수신하지 못한 경우 상기 사용자 단말에 등기 과태 알림 메시지를 전송할 수 있다. 사용 자가 변경 기한일이 경과할 때까지 변경 등기를 신청하지 않으면 관련 법령에 따라서 변경 기한일 도과에 따른 과태료가 부과될 수 있다. 따라서 알림부는 관련 법령 정보 및 과태료 정보를 포함하는 등기 과태 알림 메시지를 사용자 단말에 전송하여 과태료 납부 의무가 발생하였음을 알릴 수 있다. 실시예에 따라서는 등기 및 납부 관리부가 사용자 단말의 요청에 따라서 변경 기한일 도과에 따른 과태 료를 관할관청 서버에 납부하고, 사용자 단말의 요청에 따라서 전술한 바와 같은 변경 등기 신청 및 확인 과정을 수행할 수도 있다. 이상과 같이 본 명세서에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시예와 도면 에 의해 본 명세서가 한정되는 것은 아니며, 통상의 기술자에 의해 다양한 변형이 이루어질 수 있을 것이다. 아 울러 앞서 본 명세서의 실시예를 설명하면서 본 명세서의 구성에 따른 효과를 명시적으로 기재하여 설명하지 않 았을지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 한다."}
{"patent_id": "10-2023-0102427", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 장치의 구성도이다. 도 2는 일 실시예에 따른 법률 위반 행위 및 변경 등기 알림 및 관리 서비스 제공 방법의 흐름도이다. 도 3은 일 실시예에서 입력부를 통해서 입력되는 등기 데이터의 예시를 나타낸다. 도 4는 일 실시예에서 알림부를 통해서 사용자 단말에 제공되는 등기 과태 알림 메시지의 예시를 나타낸다."}
