{"patent_id": "10-2020-0166720", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0077611", "출원번호": "10-2020-0166720", "발명의 명칭": "하우징을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김성현"}}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,금속 영역 및 수지 영역을 포함하는 하우징;상기 하우징 상에 배치된 디스플레이; 및상기 하우징 내에 배치된 배터리를 포함하고,상기 금속 영역은,상기 배터리를 지지하는 제1 금속 영역, 및상기 전자 장치의 측면의 적어도 일부를 형성하는 적어도 하나의 제2 금속 영역으로서, 상기 제1 금속 영역을향해 돌출된 돌출 구조를 포함하는 적어도 하나의 제2 금속 영역을 포함하고,상기 수지 영역은 상기 제1 금속 영역과 상기 제2 금속 영역 사이에 배치되고,상기 돌출 구조는 상기 수지 영역과 대면하는 제1 면 및 상기 전자 장치의 내부를 향하는 제2 면을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 수지 영역은 상기 적어도 하나의 제2 금속 영역 사이에 위치하고, 상기 전자 장치의 외부로 노출된 제3 면을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 하우징은 상기 수지 영역 및 상기 제2 금속 영역에 형성된 리세스를 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 수지 영역은 상기 리세스의 적어도 일부를 형성하는 제4 면, 상기 제4 면과 대면하는 제5 면, 및 상기 제4면과 상기 제5 면 사이의 일부를 둘러싸는 제6 면을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 제2 면은, 상기 제6 면에서 연장되어 상기 제6 면과 실질적으로 동일한 면을 형성하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0077611-3-제1 항에 있어서,상기 수지 영역은,상기 제1 금속 영역과 연결된 제1 수지 영역, 및상기 제1 수지 영역에서 연장되고, 상기 제2 금속 영역과 연결된 제2 수지 영역을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 제2 금속 영역은, 이격된 제2-1 금속 영역, 제2-2 금속 영역, 및 제2-3 금속 영역을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 제2 금속 영역과 연결된 안테나 모듈을 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 하우징은, 상기 제1 금속 영역에 형성되고, 상기 수지 영역과 대면하는 아노다이징 층을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1 항에 있어서,상기 돌출 구조는 보스 홀을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 제1 금속 영역과 상기 제2 금속 영역은 이격된 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1 항에 있어서,상기 제2 금속 영역은, 전방 제2 금속 영역 및 상기 전방 금속 영역과 이격된 후방 제2 금속 영역을 포함하고,상기 수지 영역은, 전방 제2 금속 영역과 제1 금속 영역 사이에 배치된 전방 수지 영역 및 후방 제2 금속 영역과 제1 금속 영역 사이에 배치된 후방 수지 영역을 포함하는 전자 장치."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자 장치의 제조 방법에 있어서,하우징의 금속 영역을 절단하여, 제1 금속 영역, 상기 하우징의 테두리의 적어도 일부를 형성하는 복수의 제2공개특허 10-2022-0077611-4-금속 영역들, 상기 복수의 제2 금속 영역들과 연결된 제1 브릿지 구조, 및 상기 제1 금속 영역과 상기 복수의제2 금속 영역들 중 적어도 일부와 연결된 제2 브릿지 구조를 형성하는 제1 절단 공정; 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들 사이에 위치하고, 상기 제1 브릿지 구조를 둘러싸도록 수지재를 배치하여 수지 영역을 형성하는 사출 공정; 및상기 제1 브릿지 구조 및 상기 수지 영역을 절단하여, 상기 수지 영역과 대면하는 제1 면 및 상기 전자 장치의내부로 노출된 제2 면을 포함하는 돌출 구조를 형성하는 제2 절단 공정을 포함하는 전자 장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 제2 금속 영역과 함께 상기 수지 영역을 절단하여, 상기 전자 장치의 외부로 노출된 상기 수지 영역의 제3면을 형성하는 제3 절단 공정을 더 포함하는 전자 장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13 항에 있어서,상기 제2 절단 공정에서, 상기 제2 브릿지 구조는 절단되고, 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들은 이격되는 전자 장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13 항에 있어서,상기 제1 절단 공정은, 상기 제1 브릿지 구조에 의해 적어도 일부가 둘러싸이고, 상기 수지 영역의 안착을 위한수용 홈을 상기 복수의 제2 금속 영역들의 적어도 일부에 형성하는 전자 장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14 항에 있어서,상기 제3 절단 공정은, 상기 제2 금속 영역을 절단하여, 키 입력 구조를 상기 제2 금속 영역에 형성하는 전자장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13 항에 있어서,상기 제1 절단 공정은, 상기 브릿지 구조에 보스 홀을 형성하는 전자 장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13 항에 있어서,상기 제2 절단 공정은, 리세스를 상기 수지 영역 및 상기 제2 금속 영역에 형성하는 전자 장치의 제조 방법."}
{"patent_id": "10-2020-0166720", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공개특허 10-2022-0077611-5-제19 항에 있어서,상기 수지 영역은 상기 리세스의 적어도 일부를 형성하는 제4 면, 상기 제4 면과 대면하는 제5 면, 및 상기 제4면과 상기 제5 면 사이의 일부를 둘러싸는 제6 면을 포함하고,상기 제2 면은, 상기 제6 면에서 연장되어 상기 제6 면과 실질적으로 동일한 면을 형성하는 전자 장치의 제조방법."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따르면, 전자 장치는, 금속 영역 및 수지 영역을 포함하는 하우징, 상기 하우징 상 에 배치된 디스플레이 및 상기 하우징 내에 배치된 배터리를 포함하고, 상기 금속 영역은, 상기 배터리를 지지하 는 제1 금속 영역, 및 상기 전자 장치의 측면의 적어도 일부를 형성하는 적어도 하나의 제2 금속 영역으로서, 상 기 제1 금속 영역을 향해 돌출된 돌출 구조를 포함하는 적어도 하나의 제2 금속 영역을 포함하고, 상기 수지 영 역은 상기 제1 금속 영역과 상기 제2 금속 영역 사이에 배치되고, 상기 돌출 구조는 상기 수지 영역과 대면하는 제1 면 및 상기 전자 장치의 내부를 향하는 제2 면을 포함할 수 있다."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 하우징을 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신 기술과 반도체 기술의 발전으로 인하여 하나의 휴대용 전자 장치에 다양한 기능이 통합되고 있다. 예 를 들면, 전자 장치는 통신 기능뿐만 아니라, 게임과 같은 엔터테인먼트 기능, 음악/동영상 재생과 같은 멀티미 디어 기능, 모바일 뱅킹을 위한 통신 및 보안 기능, 일정 관리 및/또는 전자 지갑의 기능을 구현할 수 있다. 이 러한 전자 장치는 사용자가 편리하게 휴대할 수 있도록 소형화되고 있다. 최근, 소형화된 전자 장치에서 외부의 전자 장치와 효율적으로 통신을 수행하면서, 전자 장치의 내구성을 유지 할 수 있는 안테나 구조에 대한 연구가 지속적으로 진행되고 있다."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치(예를 들어, 휴대 단말기 또는 타블렛)는, 하우징의 일부를 안테나로 사용할 수 있다. 예를 들어, 수 지 영역으로 인하여 분리된 하우징의 금속 영역이 안테나로 사용될 수 있다. 전자 장치의 크기가 증대됨에 따라, 안테나로 사용되는 하우징의 금속 영역의 길이 및/또는 개수가 증가되고, 하우징의 금속 영역의 길이 및/또는 개수가 증가됨에 따라, 기계적인 안정성을 확보하는데 어려움이 따를 수 있 다. 예를 들어, 전자 장치의 제조 공정(예: 절단 공정, 후공정) 중 금속 영역에 가해지는 부하로 인하여 전자 장치는 휘어질 수 있다. 본 개시의 다양한 실시예들에 따르는 전자 장치는, 전자 장치의 제조 공정 중 가해지는 부하로 인한 전자 장치 의 휘어짐을 감소시키기 위하여, 안테나로 사용되기 위한 금속 영역들을 연결하는 브릿지 구조에서 절단되어 형 성된 돌출 구조를 제공할 수 있다. 본 개시의 다양한 실시예들에 따르는 전자 장치의 제조 방법은, 금속 영역들을 안테나로 사용하기 위하여 브릿 지 구조 및 사출 영역을 함께 절단하여 안테나로 사용되기 위한 금속 영역들을 분리하는 공정을 제공할 수 있다. 다만, 본 개시에서 해결하고자 하는 과제는 상기 언급된 과제에 한정되는 것이 아니며, 본 개시의 사상 및 영역 으로부터 벗어나지 않는 범위에서 다양하게 확장될 수 있을 것이다."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따르면, 전자 장치는, 금속 영역 및 수지 영역을 포함하는 하우징, 상기 하우징 상에 배치된 디스플레이 및 상기 하우징 내에 배치된 배터리를 포함하고, 상기 금속 영역은, 상기 배터리를 지 지하는 제1 금속 영역, 및 상기 전자 장치의 측면의 적어도 일부를 형성하는 적어도 하나의 제2 금속 영역으로 서, 상기 제1 금속 영역을 향해 돌출된 돌출 구조를 포함하는 적어도 하나의 제2 금속 영역을 포함하고, 상기 수지 영역은 상기 제1 금속 영역과 상기 제2 금속 영역 사이에 배치되고, 상기 돌출 구조는 상기 수지 영역과 대면하는 제1 면 및 상기 전자 장치의 내부를 향하는 제2 면을 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치의 제조 방법은, 하우징의 금속 영역을 절단하여, 제1 금속 영 역, 상기 하우징의 테두리의 적어도 일부를 형성하는 복수의 제2 금속 영역들, 상기 복수의 제2 금속 영역들과 연결된 제1 브릿지 구조, 및 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들 중 적어도 일부와 연결된 제2브릿지 구조를 형성하는 제1 절단 공정, 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들 사이에 위치하고, 상기 제1 브릿지 구조를 둘러싸도록 수지재를 배치하여 수지 영역을 형성하는 사출 공정 및 상기 제1 브릿지 구 조 및 상기 수지 영역을 절단하여, 상기 수지 영역과 대면하는 제1 면 및 상기 전자 장치의 내부로 노출된 제2 면을 포함하는 돌출 구조를 형성하는 제2 절단 공정을 포함할 수 있다."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예들에 따르면, 전자 장치는 안테나로 사용되기 위한 금속 영역들을 사출 공정 이후의 절 단 공정까지 연결하는 브릿지 구조를 이용하여, 전자 장치의 제조 공정 중 발생될 수 있는 전자 장치의 휘어짐 이 감소될 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치의 제조 방법은 사출 공정 이후의 절단 공정에서 안테나로 사용 되기 위한 금속 영역들을 연결하는 브릿지 구조 및 안테나의 분절부로 사용되는 사출 영역을 함께 절단하는 공 정을 포함할 수 있다. 브릿지 구조로 인하여 전자 장치의 제조 공정 중 발생되는 휘어짐이 감소되고, 브릿지 구 조가 절단되어 안테나로 사용되는 금속 영역들이 이격됨으로써, 안테나의 기능이 확보될 수 있다."}
{"patent_id": "10-2020-0166720", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 개시의 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)을 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서), 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 또는 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구 현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성 요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프 로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지 능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈는, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치) (예: 스피커 또는 헤드폰))를 통 해 소리를 출력할 수 있다.센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치이 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자은, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있 다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)으로 통합되거나, 또는 서로 별도의 복수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다.안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어 진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워 크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수 의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈 과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104 또는 108) 중 하나 이상의 외부 장치들에서 실행될 수 있다. 예 를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반 응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적 으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있 다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내 에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 본 개시의 다양한 실시예들에 따른, 전자 장치의 평면도이다. 도 3a 및 도 3b는 본 개시의 다양한 실시 예들에 따른, 하우징의 평면도이다. 도 4는 본 개시의 다양한 실시예들에 따른, 하우징의 금속 영역의 정면도이 다. 도 2 내지 도 4를 참조하면, 전자 장치는 휴대용 전자 장치(예: 타블렛)일 수 있다. 전자 장치는 금 속 영역, 및 수지 영역을 포함하는 하우징을 포함할 수 있다. 다양한 실시예들에 따르면, 하우징은 전면(200a), 후면(200b), 및 전면(200a)과 후면(200b) 사이의 공간을 둘러싸는 측면(200c)을 포함할 수 있다. 일 실시예에 따르면, 전면(200a)은 적어도 일부분이 실질적으로 투명한 전면 플레이트일 수 있다. 예를 들어, 하우징의 전면(200a)은 다양한 코팅 레이어들을 포함하는 글라스 플 레이트 또는 폴리머 플레이트를 포함할 수 있다. 일 실시예에 따르면, 후면(200b) 및/또는 측면(200c)은 금속으 로 형성될 수 있다. 일 실시예에 따르면, 하우징의 전면(200a), 후면(200b), 및/또는 측면(200c)은 전자 장치의 전면(200a), 후면(200b), 및/또는 측면(200c)으로 해석될 수도 있다. 다양한 실시예들에 따르면, 금속 영역은 제1 금속 영역 및 제2 금속 영역을 포함할 수 있다. 일 실시예에 따르면, 금속 영역은 알루미늄, 스테인리스 스틸, 또는 마그네슘 중 적어도 하나를 포함할 수 있 다. 일 실시예에 따르면, 제2 금속 영역은 제1 금속 영역에 이격될 수 있다. 다양한 실시예들에 따르면, 제1 금속 영역은, 전자 장치의 부품(예: 배터리(도 1의 배터리), 디 스플레이 모듈)을 지지할 수 있다. 일 실시예에 따르면, 제1 금속 영역은, 전자 장치의 테두리 의 적어도 일부를 형성할 수 있다. 예를 들어, 제1 금속 영역은 후면(200b) 및 측면(200c)의 적어도 일부 를 형성할 수 있다. 다양한 실시예들에 따르면, 제2 금속 영역은 안테나 기능을 수행할 수 있다. 예를 들어, 제2 금속 영역 은 안테나 모듈(예: 도 1의 안테나 모듈)과 전기적으로 연결되어 전자기파를 송신 또는 수신할 수 있 다. 다양한 실시예들에 따르면, 제2 금속 영역은, 전자 장치의 테두리의 적어도 일부를 형성할 수 있다. 예를 들어, 제2 금속 영역은 하우징의 측면(200c)의 적어도 일부를 형성할 수 있다. 다양한 실시예들에 따르면, 제2 금속 영역은 복수개로 형성될 수 있다. 일 실시예에 따르면, 제2 금속 영 역은, 하우징의 전방 및 후방에 위치할 수 있다. 예를 들어, 제2 금속 영역은 하우징의 전 방에 위치한 전방 제2 금속 영역(220-1) 및 상기 전방 제2 금속 영역(220-1)과 이격된 후방 제2 금속 영역(220- 2)을 포함할 수 있다. 다양한 실시예들에 따르면, 제2 금속 영역은 수지 영역으로 인해 분절된 복수의 제2 금속 영역들을 포함할 수 있다. 예를 들어, 제2 금속 영역의 전방 제2 금속 영역(220-1) 및 후방 제2 금속 영역(220-2)은 안테나 기능을 수행하기 위하여, 복수의 안테나로 분리될 수 있다. 일 실시예에 따르면, 전방 제2 금속 영역(220-1)은 제2-1 금속 영역(222-1), 제2-2 금속 영역(224-1), 제2-3 금속 영역(226-1), 또는 제2-4 금속 영역 (228-1) 중 적어도 하나를 포함하고, 후방 제2 금속 영역(220-2)은 제2-5 금속 영역(222-2), 제2-6 금속 영역 (224-2), 제2-7 금속 영역(226-2), 또는 제2-8 금속 영역(228-2) 중 적어도 하나를 포함할 수 있다. 다양한 실시예들에 따르면, 수지 영역은 제1 금속 영역과 제2 금속 영역을 연결할 수 있다. 일 실시예에 따르면, 수지 영역의 적어도 일부는 제1 금속 영역과 제2 금속 영역 사이에 배치될 수 있다. 일 실시예에 따르면, 수지 영역은 하우징의 후면(200b)의 적어도 일부 및/또는 측면(200c)의 적어도 일부를 형성할 수 있다. 다양한 실시예들에 따르면, 복수의 제2 금속 영역들은 수지 영역에 의하여 전기적으로 분리될 수 있다. 예 를 들어, 수지 영역은 제2 금속 영역을 분리시키는 분절부일 수 있다. 일 실시예에 따르면, 수지 영 역은 절연성 물질로 제작될 수 있다. 일 실시예에 따르면, 수지 영역의 전기 전도성은 금속 영역 의 전기 전도성보다 낮을 수 있다.일 실시예에 따르면, 전방 제2 금속 영역(222-1, 224-1, 226-1, 228-1) 또는 후방 제2 금속 영역(222-2, 224-2, 226-2, 228-2)은 각각 수지 영역 상에 배치될 수 있다. 다양한 실시예들에 따르면, 수지 영역은 복수개로 형성될 수 있다. 일 실시예에 따르면, 수지 영역은 하우징의 전방 및 후방에 위치할 수 있다. 예를 들어, 수지 영역은 전방 제2 금속 영역(220-1)과 제1 금속 영역 사이에 배치된 전방 수지 영역(230-1) 및 후방 제2 금속 영역(220-2)과 제1 금속 영역 사 이에 배치된 후방 수지 영역(230-2)을 포함할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 디스플레이, 키 입력 구조, 오디오 모듈(203, 204), 발 광 소자(미도시), 카메라 모듈, 커넥터 홀, 및/또는 센서 모듈(미도시)을 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 구성요소들 중 적어도 하나(예: 커넥터 홀)을 생략하거나 다른 구성요소를 추 가로 포함할 수 있다. 다양한 실시예들에 따르면, 디스플레이(예: 도 1의 디스플레이 모듈)는, 터치 감지 회로, 터치의 세 기(압력)를 측정할 수 있는 압력 센서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되 거나 인접하여 배치될 수 있다. 일 실시예에 따르면, 디스플레이는 하우징의 전면(200a)을 통하여 시 각적으로 노출될 수 있다. 일 실시예에 따르면, 키 입력 구조(예: 도 1의 입력 모듈 또는 센서 모듈)는 하우징의 측 면(200c)에 배치될 수 있다. 다른 실시 예에서는, 전자 장치는 상기 언급된 키 입력 구조 중 적어도 일부를 포함하지 않을 수 있고 포함되지 않은 키 입력 구조는 디스플레이 상에 소프트 키와 같은 다 른 형태로 구현될 수 있다. 다양한 실시예들에 따르면, 발광 소자(미도시)는, 예를 들어, 하우징의 전면(200a) 및/또는 후면(200b)에 배치될 수 있다. 발광 소자(미도시)는, 예를 들어, 전자 장치의 상태 정보를 광 형태로 제공할 수 있다. 다른 실시 예에서, 발광 소자(미도시)는, 예를 들어, 전면 카메라 모듈(미도시) 또는 후면 카메라 모듈의 동작과 연동되는 광원을 제공할 수 있다. 발광 소자(미도시)는, 예를 들어, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 다양한 실시예들에 따르면, 카메라 모듈(예: 도 1의 카메라 모듈)은 하나 또는 복수의 렌즈들, 이미 지 센서, 이미지 시그널 프로세서, 및/또는 플래시를 포함할 수 있다. 플래시는, 예를 들어, 발광 다이오드 또 는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실시예에서는, 2개 이상의 렌즈들 (적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 일 실시예에 따르면, 전자 장치 는 전자 장치의 전면(200a)에 배치된 전면 카메라 모듈(미도시) 및 전자 장치의 후면(200b)에 배치된 후면 카메라 모듈을 포함할 수 있다. 다양한 실시예들에 따르면, 커넥터 홀(예: 도 1의 연결 단자)은, 예를 들면, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터(예: USB 커넥터)를 수용하거나, 외부 전자 장치와 오디오 신호를 송 수신하기 위한 커넥터(예: 이어폰 잭)를 수용할 수 있다. 다양한 실시예들에 일 실시예에 따르면, 센서 모듈(예: 도 1의 센서 모듈)은, 예를 들면, 전자 장치 의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모 듈(미도시)은, 예를 들어, 하우징의 전면(200a)에 배치된 제1 센서 모듈(미도시)(예: 근접 센서) 및/또는 제2 센서 모듈(미도시)(예: 지문 센서), 및/또는 상기 하우징의 후면(200b)에 배치된 제3 센서 모듈(미도 시)(예: HRM 센서) 및/또는 제4 센서 모듈(미도시)(예: 지문 센서)을 포함할 수 있다. 어떤 실시예에서(미도시), 상기 지문 센서는 하우징의 전면(200a)(예: 디스플레이)뿐만 아니라 후면(200b)에 배치될 수 있다. 전자 장치는, 도시되지 않은 센서 모듈, 예를 들어, 제스처 센서, 자이로 센서, 기압 센 서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서(미도시) 중 적어도 하나를 더 포함할 수 있다. 도 5는 비교예에 따른, 전자 장치의 휘어짐을 설명하기 위한 도면이다. 도 5를 참조하면, 전자 장치는 두께 방향(예: Z축 방향)으로 휘어질 수 있다. 예를 들어, 안테나 사용을 위하여, 제2 금속 영역의 개수 또는 길이가 증대되어, 전자 장치는 두께 방향(Z축 방향)으로의 외부 의 충격에 취약할 수 있다. 도 5의 전자 장치, 제2 금속 영역, 및 수지 영역은 도 2 내지 도 4 의 전자 장치, 제2 금속 영역, 및 수지 영역의 구성과 전부 또는 일부가 동일할 수 있다. 다양한 실시예들에 따르면, 전자 장치의 제2 금속 영역은 안테나로 사용되기 위하여 이격된 복수의 제2 금속 영역들(222, 224, 226, 228)(예: 도 4의 제2-1 금속 영역(222-1), 제2-2 금속 영역(224-1), 제2-3 금 속 영역(226-1), 제2-4 금속 영역(228-1))을 포함할 수 있다. 수지 영역은 복수의 제2 금속 영역들(222, 224,226, 228)사이에 배치되고, 복수의 제2 금속 영역들(222, 224, 226, 228) 수지 영역에 의하여 이격될 수 있다. 다양한 실시예들에 따르면, 수지 영역의 형상은 변경될 수 있다. 일 실시예에 따르면, 금속 영역(예: 도 4 의 금속 영역) 또는 수지 영역을 절단하는 공정, 후공정(예: 연마 공정(버핑(buffing) 공정 또는 샌 드 블라스트를 이용하는 샌딩 공정)), 또는 사출 후 수지 영역의 수축 중 적어도 하나에 기초하여, 수지 영역의 형상이 변경될 수 있다. 예를 들어, 디스플레이(예: 도 2의 디스플레이)가 위치한 전자 장치 의 전면(200a)의 제1 길이(l1)는 전자 장치의 후면(200b)의 제2 길이(l2) 보다 짧을 수 있다. 일 실 시예에 따르면, 본 발명의 돌출 구조(예: 도 6의 돌출 구조)를 포함하지 않는 하우징의 제1 길이(l1)는 제 2 길이(l2)보다 짧을 수 있다. 예를 들어, 돌출 구조(예: 도 6의 돌출 구조)를 포함하지 않는 하우징의 제 1 길이(l1)는 제2 길이(l2)보다 0.05mm 내지 0.07mm 짧을 수 있다. 돌출 구조에 관하여는 아래에서 설명한 다. 도 6은 본 개시의 다양한 실시예들에 따르는, 하우징의 내부가 투영된 도면이다. 도 7은 본 개시의 다양한 실시 예들에 따르는 하우징의 사시도이다. 도 8a는 도 7의 A-A`선의 단면도이고, 도 8b는 도 7의 B-B`선의 단면도이 다. 도 6, 도 7, 도 8a, 및 도 8b를 참조하면, 전자 장치의 제2 금속 영역은 전자 장치의 제조 공정 및/또는 공정 후의 전자 장치의 휘어짐을 감소 또는 방지하기 위한 돌출 구조를 포함할 수 있다. 도 6, 도 7, 도 8a, 및 도 8b의 전자 장치, 제1 금속 영역, 제2 금속 영역, 및 수지 영역의 구성은 도 2 내지 도 4의 전자 장치, 제1 금속 영역, 제2 금속 영역, 및 수지 영역의 구성 과 전부 또는 일부가 동일할 수 있다. 다양한 실시예들에 따르면, 제2 금속 영역은 적어도 하나의 돌출 구조를 포함할 수 있다. 돌출 구조 는 제2 금속 영역에서 제1 금속 영역 또는 전자 장치의 내부를 향해 연장될 수 있다. 일 실시예에 따르면, 돌출 구조는 전자 장치의 측면(200c)을 형성하는 제2 금속 영역에서 전면(예: 도 2의 전면(200a)) 또는 후면(예: 도 2의 후면(200b))과 평행한 방향으로 연장될 수 있다. 다양한 실시예들에 따르면, 돌출 구조는 수지 영역과 제2 금속 영역 사이의 결합력을 증대시킬 수 있다. 수지 영역은 돌출 구조의 적어도 일부와 결합될 수 있다. 예를 들어, 돌출 구조는 수 지 영역과 대면하는 제1 면(240a)을 포함할 수 있다. 상기 제1 면(240a)는 제1 금속 영역을 향하도록 배치될 수 있다. 다양한 실시예들에 따르면, 돌출 구조의 일부는 전자 장치의 내부로 노출될 수 있다. 일 실시예에 따 르면, 돌출 구조는 전자 장치의 내부를 향하는 제2 면(240b)을 포함할 수 있다. 일 실시예에 따르면, 제2 면(240b)은 수지 영역과 함께 절단되어, 상기 제2 면(240b)은 수지 영역에 의하여 덮이지 않을 수 있다. 일 실시예에 따르면, 제2 면(240b)은 전자 장치 또는 하우징의 측면(200c)의 반대를 향할 수 있다. 예를 들어, 제2 면(240b)은 제1 금속 영역을 향할 수 있다.다양한 실시예들에 따르면, 돌출 구조는 제2 금속 영역과 일체로 형성될 수 있다. 일 실시예에 따르 면, 돌출 구조는 제1 브릿지 구조(예: 도 10a의 제1 브릿지 구조)에서 절단되어 형성될 수 있다. 예 를 들어, 돌출 구조는 제2 금속 영역의 상기 제1 브릿지 구조가 컴퓨터 수치제어(computer numerical control, CNC))를 이용하여 절단된 구성일 수 있다. 다양한 실시예들에 따르면, 돌출 구조는 보스 홀을 포함할 수 있다. 일 실시예에 따르면, 보스 홀 은 링크 홀로서, 전자 장치의 부품을 수용할 수 있다. 일 실시예에 따르면, 보스 홀은 전자 장 치의 두께 방향으로 돌출 구조를 관통할 수 있다. 다양한 실시예들에 따르면, 수지 영역은 제1 금속 영역과 제2 금속 영역을 연결할 수 있다. 일 실시예에 따르면, 수지 영역은 제1 금속 영역과 연결된 제1 수지 영역 및 제1 수지 영역에 서 연장되고, 제2 금속 영역과 연결된 제2 수지 영역을 포함할 수 있다. 일 실시예에 따르면, 제1 수 지 영역은 제2 수지 영역에서 전자 장치의 측면(200c)을 향해 연장된 영역일 수 있다. 다양한 실시예들에 따르면, 수지 영역은 안테나의 분절부로 기능할 수 있다. 일 실시예에 따르면, 수지 영 역은 전자 장치의 외부로 노출된 제3 면(230a)을 포함할 수 있다. 상기 제3 면(230a)은 전자 장치 의 측면(200c)의 적어도 일부를 형성하고, 적어도 하나의 제2 금속 영역 사이에 배치될 수 있다. 예 를 들어, 제3 면(230a)은 복수의 제2 금속 영역들(예: 제2-1 금속 영역(222-1), 제2-2 금속 영역(224-1), 제2- 3 금속 영역(226-1), 및 제2-4 금속 영역(228-1)들 중 적어도 두 개) 사이에 위치할 수 있다. 일 실시예에 따르 면, 상기 제1 수지 영역은 제3 면(230a)을 포함할 수 있다. 일 실시예에 따르면, 제2 수지 영역은 전 자 장치의 후면(예: 도 2의 후면(200b))을 형성할 수 있다. 다양한 실시예들에 따르면, 하우징은 수지 영역 및 제2 금속 영역에 형성된 리세스를 포함 할 수 있다. 일 실시예에 따르면, 리세스는 티 컷(T-cut) 절단 공정을 이용하여 제2 금속 영역 및 수 지 영역에 형성된 홈(groove)일 수 있다. 예를 들어, 제2 금속 영역 및 수지 영역은 함께 절단 되고, 제2 금속 영역의 일부(예: 제2 면(220b))은 전자 장치의 내부로 노출될 수 있다. 다양한 실시예들에 따르면, 수지 영역은 리세스의 적어도 일부를 형성할 수 있다. 예를 들어, 수지 영역은 제4 면(230b), 상기 제4 면(230b)과 대면하는 제5 면(230c), 및 상기 제4 면(230b)과 상기 제5 면 (230c) 사이의 일부를 둘러싸는 제6 면(230d)을 포함할 수 있다. 돌출 구조의 제2 면(240b)은 상기 제6 면 (230d)와 실질적으로 동일한 면을 형성할 수 있다. 예를 들어, 상기 제2 면(240b)와 상기 제6 면(230d)은 동일 한 절단 공정(예: 도 10d의 제2 절단 공정)을 통해 형성될 수 있다. 예를 들어, 상기 제2 면(240b)과 상기 제6 면(230d)은 실질적으로 동일한 곡률을 포함한 면을 형성할 수 있다. 다양한 실시예들에 따르면, 하우징은 제1 금속 영역에 형성된 아노다이징(anodizing) 층을 포함 할 수 있다. 상기 아노다이징 층은 제1 금속 영역의 적어도 일부가 양극 산화된 층일 수 있다. 일 실 시예에 따르면, 아노다이징 층의 적어도 일부는 수지 영역과 대면할 수 있다. 도 9는 본 개시의 다양한 실시예들에 따르는, 전자 장치의 제조 방법을 설명하기 위한 도면이다. 도 10a는 본 개시의 다양한 실시예들에 따르는, 제1 절단 공정을 설명하기 위한 도면이다. 도 10b는 본 개시의 다양한 실시 예들에 따르는, 사출 공정을 설명하기 위한 도면이다. 도 10c는 본 개시의 다양한 실시예들에 따르는, 제3 절단 공정을 설명하기 위한 도면이다. 도 10d는 본 개시의 다양한 실시예들에 따르는, 제2 절단 공정을 설명하기 위 한 도면이다. 도 11은 본 개시의 다양한 실시예들에 따르는, 전자 장치의 제조 방법을 설명하기 위한 흐름도이 다. 도 9, 도 10a, 도 10b, 도 10c, 도 10d, 및 도 11을 참조하면, 전자 장치의 제조 방법은 금속 영역 을 절단하는 제1 절단 공정, 수지 영역을 배치하는 사출 공정, 제2 금속 영역 및 수지 영 역을 절단하는 제3 절단 공정, 제1 브릿지 구조 및 수지 영역을 절단하는 제2 절단 공정 을 포함할 수 있다. 도 9, 도 10a, 도 10b, 도 10c, 도 10d, 및 도 11의 전자 장치, 금속 영역 , 제1 금속 영역, 제2 금속 영역, 수지 영역, 및 돌출 구조의 구성은 도4, 도 6 및/ 또는 도 7의 전자 장치, 금속 영역, 제1 금속 영역, 제2 금속 영역, 수지 영역, 및 돌출 구조의 구성과 전부 또는 일부가 동일할 수 있다. 다양한 실시예들에 따르면, 전자 장치의 제조 방법은, 하우징의 금속 영역을 절단하여, 제1 금 속 영역, 및 상기 하우징의 테두리(200d)의 적어도 일부를 형성하는 복수의 제2 금속 영역들을 형성하는 제1 절단 공정을 포함할 수 있다. 상기 제1 절단 공정은 수지 영역이 전자 장치 에 사출되기 전에 금속 영역을 절단하는 공정일 수 있다. 일 실시예에 따르면, 제1 절단 공정은 컴퓨 터 수치 제어(computer numerical control, CNC), 다이아컷, 폴리싱과 같은 적어도 하나의 절삭 기계를 이용하 여 금속 재료를 지정된 형상으로 절단하는 공정일 수 있다. 상기 제1 절단 공정을 이용하여 금속 영역 의 구성들의 적어도 일부는 형성 될 수 있다. 일 실시예에 따르면, 복수의 제2 금속 영역들과 연결된 제1 브릿지 구조는 제1 절단 공정을 이용하여 형성될 수 있다. 일 실시예에 따르면, 제1 금속 영역 과 복수의 제2 금속 영역들 중 적어도 일부와 연결된 제2 브릿지 구조는 제1 절단 공정을 이용하여 형성될 수 있다. 다양한 실시예들에 따르면, 제1 브릿지 구조는 전자 장치의 제조 중에, 복수의 제2 금속 영역들 을 연결할 수 있다. 예를 들어, 제2 절단 공정 전까지, 복수의 제2 금속 영역들은 제1 브릿지 구조 를 이용하여 연결되고, 공정 중 가해지는 전자 장치의 외력에 의한 전자 장치의 휨은 감소 또는 방지 될 수 있다. 다양한 실시예들에 따르면, 제2 브릿지 구조는 전자 장치의 제조 중에, 제1 금속 영역과 복수의 제2 금속 영역들 중 적어도 일부를 연결할 수 있다. 예를 들어, 제3 절단 공정전까지 제1 금속 영역 과 제2 금속 영역은 제2 브릿지 구조를 이용하여 연결되고, 공정 중 가해지는 전자 장치의 외력 에 의한 전자 장치의 휨은 감소 또는 방지될 수 있다. 다양한 실시예들에 따르면, 제1 절단 공정은 제1 브릿지 구조에 의해 적어도 일부가 둘러싸이는 수용 홈을 형성하는 공정을 포함할 수 있다. 상기 수용 홈은 제2 금속 영역에 형성된 홈 또는 리세스 일 수 있다. 일 실시예에 따르면, 수용 홈은 수지 영역을 수용할 수 있다. 예를 들어, 수지 영역 은 수용 홈내에 배치될 수 있다. 다양한 실시예들에 따르면, 제1 절단 공정은 제1 브릿지 구조에 보스 홀을 형성하는 공정을 포 함할 수 있다. 다양한 실시예들에 따르면, 전자 장치의 제조 방법은 제1 금속 영역과 제2 금속 영역 사이에 위 치하고, 제1 브릿지 구조를 둘러싸도록 수지재를 배치하여 수지 영역을 형성하는 사출 공정을 포함할 수 있다. 상기 사출 공정은 수지재를 가열하여 금속 영역에 투입하는 성형(molding) 공정일 수 있다. 예를 들어, 사출 공정은 금형 내에 준비된 금속 부품에 고온에서 융해시킨 수지재(예: 합성 수지)를 사출하여 수지재와 금속을 접합시키는 방식으로 성형하는 공정일 수 있다. 일 실시예에 따르면, 상기 수지재는 합성 레진(예: 플라스틱) 또는 천연 레진으로서, 유기화합물 및 그 유도체로 이루어진 비결정성 고체 또는 반고체일 수 있다. 다양한 실시예들에 따르면, 수지 영역은 사출 공정을 이용하여, 제1 금속 영역과 제2 금속 영역 사이의 공간에 위치할 수 있다. 일 실시예에 따르면, 수지 영역은 제1 금속 영역과 제2 금속 영역의 형상에 대응되도록 형성될 수 있다. 예를 들어, 수지 영역은 수용 홈 내에 배치되고, 제 1 브릿지 구조 및 제2 브릿지 구조의 적어도 일부를 둘러쌀 수 있다. 다양한 실시예들에 따르면, 전자 장치의 제조 방법은 제2 금속 영역과 함께 수지 영역을 절단하 여, 전자 장치(예: 도 2의 전자 장치)의 외부로 노출된 수지 영역의 제3 면(230a)을 형성하는 제3 절 단 공정을 포함할 수 있다. 상기 제3 절단 공정은 수지 영역이 전자 장치에 사출된 후 금 속 영역 및/또는 수지 영역을 절단하는 공정일 수 있다. 상기 제3 절단 공정을 이용하여 전자 장치의 구성들의 적어도 일부가 형성될 수 있다. 다양한 실시예들에 따르면, 전자 장치의 측면(200c)의 적어도 일부는 제3 절단 공정을 통해 형성될 수 있다. 예를 들어, 제3 절단 공정은 제2 금속 영역 및 수지 영역의 테두리를 절단함으로써, 전자 장치의 측면(200c)을 형성할 수 있다. 상기 제3 절단 공정을 통하여, 수용 홈에 위치한 수 지 영역의 적어도 일부(예: 제3 면(230a))는 하우징의 외부로 시각적으로 노출될 수 있다. 다양한 실시예들에 따르면, 키 입력 구조(예: 도 2의 키 입력 구조)는 제3 절단 공정을 통하여 형성 될 수 있다. 예를 들어, 제3 절단 공정은, 제2 금속 영역을 절단하여, 상기 키 입력 구조를 상 기 제2 금속 영역에 형성하는 공정을 포함할 수 있다. 다양한 실시예들에 따르면, 전자 장치의 제조 방법은 제1 브릿지 구조 및 수지 영역을 절단하여, 수지 영역과 대면하는 제1 면(240a) 및 상기 전자 장치의 내부로 노출된 제2 면(240b)을 포함하는 돌출 구조를 형성하는 제2 절단 공정을 포함할 수 있다. 상기 제2 절단 공정은 수지 영역이 전자 장치에 사출된 후 금속 영역 및/또는 수지 영역을 절단하는 공정일 수 있다. 일 실시예(예: 도 11)에 따르면, 제2 절단 공정은 제3 절단 공정 이후에 수행될 수 있다. 다른 실시 예(미도시)에 따르면, 제2 절단 공정은 제3 절단 공정 이전에 수행될 수 있다. 다양한 실시예들에 따르면, 돌출 구조는 제2 절단 공정을 이용하여 형성될 수 있다. 일 실시예에 따 르면, 제2 절단 공정은 제1 브릿지 구조 및 수지 영역을 함께 절단하고, 하나의 제1 브릿지 구 조는 두개의 돌출 구조로 변경될 수 있다. 제1 브릿지 구조의 절단된 면은 돌출 구조의 제 2 면(240b)이고, 수지 영역의 절단된 면은 제6 면(230d)일 수 있다. 일 실시예에 따르면, 제1 브릿지 구조 의 두 개의 보스 홀 사이에 위치한 부분이 제2 절단 공정에서 절단될 수 있다. 다양한 실시예들에 따르면, 리세스는 제2 절단 공정을 이용하여 형성될 수 있다. 예를 들어, 리세스 는 제2 절단 공정에서 제2 금속 영역의 제1 브릿지 구조 및 수지 영역에 형성된 홈 또는 리세스일 수 있다. 다양한 실시예들에 따르면, 제2 절단 공정은, 티 컷(T-cut) 또는 언더 컷(under-cut) 공정일 수 있다. 예 를 들어, 제2 절단 공정은 전자 장치의 디스플레이(예: 도 2의 디스플레이)와 실질적으로 평행 한 방향(예: XY 평면)으로 재료를 절삭할 수 있는 공구를 사용한 절단 공정일 수 있다. 일 실시예에 따르면, 제1 절단 공정 및 제3 절단 공정의 절삭 방향은 제2 절단 공정의 절삭 방 향과 상이할 수 있다. 예를 들어, 제1 절단 공정 및 제3 절단 공정은 전자 장치의 디스플레이 (예: 도 2의 디스플레이)와 실질적으로 수직한 방향(예: Z축 방향)으로 재료를 절삭할 수 있는 공구를 사 용한 절단 공정일 수 있다. 다양한 실시예들에 따르면, 제2 브릿지 구조는 제2 절단 공정을 이용하여 절단될 수 있다. 예를 들어, 제2 절단 공정은 제1 금속 영역과 제2 금속 영역을 연결하는 제2 브릿지 구조를 절 단하는 공정을 포함할 수 있다. 전자 장치의 제조 방법은 절단된 제1 금속 영역에 아노다이징 (anodizing) 층을 형성하는 코팅 공정을 더 포함할 수 있다. 예를 들어, 제1 금속 영역의 일부는 산 화될 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치(예: 도 2의 전자 장치)는 금속 영역(예: 도 3a의 금속 영 역) 및 수지 영역(예: 도 3a의 수지 영역)을 포함하는 하우징(예: 도 3a의 하우징), 상기 하우 징 상에 배치된 디스플레이(예: 도 2의 디스플레이) 및 상기 하우징 내에 배치된 배터리(예: 도 1의 배터 리)를 포함하고, 상기 금속 영역은, 상기 배터리를 지지하는 제1 금속 영역(예: 도 4의 제1 금속 영역 ), 및 상기 전자 장치의 측면(예: 도 2의 측면(200c))의 적어도 일부를 형성하는 적어도 하나의 제2 금속 영역(예: 도 4의 제2 금속 영역)으로서, 상기 제1 금속 영역을 향해 돌출된 돌출 구조(예: 도 6의 돌출 구 조)를 포함하는 적어도 하나의 제2 금속 영역(예: 도 4의 제2 금속 영역)을 포함하고, 상기 수지 영 역은 상기 제1 금속 영역과 상기 제2 금속 영역 사이에 배치되고, 상기 돌출 구조는 상기 수지 영역과 대면하는 제1 면(예: 도 8a의 제1 면(240a)) 및 상기 전자 장치의 내부를 향하는 제2 면(예: 도 8b의 제2 면(240b))을 포 함할 수 있다. 다양한 실시예들에 따르면, 상기 수지 영역은 상기 적어도 하나의 제2 금속 영역 사이에 위치하고, 상기 전자 장치의 외부로 노출된 제3 면(예: 도 7의 제3 면(230a))을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 하우징은 상기 수지 영역 및 상기 제2 금속 영역에 형성된 리세스(예: 도 7의 리세스)를 포함할 수 있다. 다양한 실시예들에 따르면, 상기 수지 영역은 상기 리세스의 적어도 일부를 형성하는 제4 면(예: 도 7의 제4 면 (230b)), 상기 제4 면과 대면하는 제5 면(예: 도 7의 제5 면(230c)), 및 상기 제4 면과 상기 제5 면 사이의 일 부를 둘러싸는 제6 면(예: 도 7의 제6 면(230d))을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 제2 면은, 상기 제6 면에서 연장되어 상기 제6 면과 실질적으로 동일한 면을 형성할 수 있다. 다양한 실시예들에 따르면, 상기 수지 영역은, 상기 제1 금속 영역과 연결된 제1 수지 영역(예: 도 8a의 제1 수 지 영역) 및 상기 제1 수지 영역에서 연장되고, 상기 제2 금속 영역과 연결된 제2 수지 영역(예: 도 8b의 제2 수지 영역)을 포함하는 전자 장치. 다양한 실시예들에 따르면, 상기 제2 금속 영역은, 이격된 제2-1 금속 영역(예: 도 4의 제2-1 금속 영역(222- 1)), 제2-2 금속 영역(예: 도 4의 제2-2 금속 영역(224-1)), 및 제2-3 금속 영역(예: 도 4의 제2-3 금속 영역 (226-1))을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 전자 장치는 상기 제2 금속 영역과 연결된 안테나 모듈(예: 도 1의 안테나 모 듈)을 더 포함할 수 있다. 다양한 실시예들에 따르면, 상기 하우징은, 상기 제1 금속 영역에 형성되고, 상기 수지 영역과 대면하는 아노다 이징 층(예: 도 7의 아노다이징 층)을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 돌출 구조는 보스 홀(예: 도 6의 보스 홀)을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 제1 금속 영역과 상기 제2 금속 영역은 이격될 수 있다. 다양한 실시예들에 따르면, 상기 제2 금속 영역은, 전방 제2 금속 영역(예: 도 4의 전방 제2 금속 영역(220-1)) 및 상기 전방 금속 영역과 이격된 후방 제2 금속 영역(예: 도 4의 후방 제2 금속 영역(220-2))을 포함하고, 상 기 수지 영역은, 전방 제2 금속 영역과 제1 금속 영역 사이에 배치된 전방 수지 영역 및 후방 제2 금속 영역과 제1 금속 영역 사이에 배치된 후방 수지 영역을 포함할 수 있다. 본 개시의 다양한 실시예들에 따르면, 전자 장치의 제조 방법(예: 도 11의 전자 장치의 제조 방법)에 있어 서, 하우징(예: 도 9의 하우징)의 금속 영역(예: 도 9의 금속 영역)을 절단하여, 제1 금속 영역(예: 도 10a의 제1 금속 영역), 상기 하우징의 테두리(예: 도 9의 테두리(200d))의 적어도 일부를 형성하는 복 수의 제2 금속 영역(예: 도 10a의 제2 금속 영역)들, 상기 복수의 제2 금속 영역들과 연결된 제1 브릿지 구조(예: 도 10a의 제1 브릿지 구조), 및 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들 중 적어도 일부와 연결된 제2 브릿지 구조(예: 도 10a의 제2 브릿지 구조)를 형성하는 제1 절단 공정(예: 도 10a의 제1 절단 공정), 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들 사이에 위치하고, 상기 제1 브릿지 구조를 둘러싸도록 수지재를 배치하여 수지 영역(예: 도 10b의 수지 영역)을 형성하는 사출 공정(예: 도 10b의 사출 공정), 상기 제1 브릿지 구조 및 상기 수지 영역을 절단하여, 상기 수지 영역과 대면하는 제1 면(예: 도 8a의 제1 면(240a)) 및 상기 전자 장치의 내부로 노출된 제2 면(예: 도 10d의 제2 면(240b))을 포함 하는 돌출 구조(예: 도 10d의 돌출 구조)를 형성하는 제2 절단 공정(예: 도 10d의 제2 절단 공정)을 포함할 수 있다. 다양한 실시예들에 따르면, 상기 전자 장치의 제조 방법은 상기 제2 금속 영역과 함께 상기 수지 영역을 절단하 여, 상기 전자 장치의 외부로 노출된 상기 수지 영역의 제3 면(예: 도 10c의 제3 면(230a))을 형성하는 제3 절 단 공정(예: 도 10c의 제3 절단 공정)을 더 포함할 수 있다. 다양한 실시예들에 따르면, 상기 제2 절단 공정에서, 상기 제2 브릿지 구조는 절단되고, 상기 제1 금속 영역과 상기 복수의 제2 금속 영역들은 이격될 수 있다. 다양한 실시예들에 따르면, 상기 제1 절단 공정은, 상기 제1 브릿지 구조에 의해 적어도 일부가 둘러싸이고, 상 기 수지 영역의 안착을 위한 수용 홈(예: 도 10a의 수용 홈)을 상기 복수의 제2 금속 영역들의 적어도 일 부에 형성할 수 있다. 다양한 실시예들에 따르면, 상기 제3 절단 공정은, 상기 제2 금속 영역을 절단하여, 키 입력 구조(예: 도 2의 키 입력 구조)를 상기 제2 금속 영역에 형성할 수 있다. 다양한 실시예들에 따르면, 상기 제1 절단 공정은, 상기 브릿지 구조에 보스 홀(예: 도 10a의 보스 홀)을 형성할 수 있다. 다양한 실시예들에 따르면, 상기 제2 절단 공정은, 리세스를 상기 수지 영역 및 상기 제2 금속 영역에 형성할 수 있다. 다양한 실시예들에 따르면, 상기 수지 영역은 상기 리세스의 적어도 일부를 형성하는 제4 면(예: 도 7의 제4 면 (230b)), 상기 제4 면과 대면하는 제5 면(예: 도 7의 제5 면(230c)), 및 상기 제4 면과 상기 제5 면 사이의 일 부를 둘러싸는 제6 면(예: 도 7의 제6 면(230d))을 포함하고, 상기 제2 면은, 상기 제6 면에서 연장되어 상기 제6 면과 실질적으로 동일한 면을 형성할 수 있다.부호의 설명 101: 전자 장치 200: 하우징 201: 디스플레이 210: 제1 금속 영역 220: 제2 금속 영역 230: 수지 영역 232: 제1 수지 영역 234: 제2 수지 영역 240: 돌출 구조 242: 보스 홀 250: 제1 브릿지 구조 260: 제2 브릿지 구조도면 도면1 도면2 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8a 도면8b 도면9 도면10a 도면10b 도면10c 도면10d 도면11"}
{"patent_id": "10-2020-0166720", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 본 개시의 다양한 실시예들에 따른, 전자 장치의 평면도이다. 도 3a 및 도 3b는 본 개시의 다양한 실시예들에 따른, 하우징의 평면도이다. 도 4는 본 개시의 다양한 실시예들에 따른, 하우징의 금속 영역의 정면도이다. 도 5는 비교예에 따른, 전자 장치의 휘어짐을 설명하기 위한 도면이다. 도 6은 본 개시의 다양한 실시예들에 따르는, 하우징의 내부가 투영된 도면이다. 도 7은 도 6의 A영역의 사시도이다. 도 8a는 도 7의 A-A`선의 단면도이고, 도 8b는 도 7의 B-B`선의 단면도이다. 도 9는 본 개시의 다양한 실시예들에 따르는, 전자 장치의 제조 방법을 설명하기 위한 도면이다. 도 10a는 본 개시의 다양한 실시예들에 따르는, 제1 절단 공정을 설명하기 위한 도면이다. 도 10b는 본 개시의 다양한 실시예들에 따르는, 사출 공정을 설명하기 위한 도면이다. 도 10c는 본 개시의 다양한 실시예들에 따르는, 제3 절단 공정을 설명하기 위한 도면이다. 도 10d는 본 개시의 다양한 실시예들에 따르는, 제2 절단 공정을 설명하기 위한 도면이다. 도 11은 본 개시의 다양한 실시예들에 따르는, 전자 장치의 제조 방법을 설명하기 위한 흐름도이다."}
