{"patent_id": "10-2018-0149952", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0063796", "출원번호": "10-2018-0149952", "발명의 명칭": "딥러닝 학습이미지 저장 및 처리방법", "출원인": "주식회사 지노바이오", "발명자": "이재구"}}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 이미지를 캡쳐하여 저장하는 제1 단계;상기 저장된 이미지로부터 대표값을 추출하는 제2 단계; 및상기 추출된 대표값을 배열하여 학습이미지를 생성하는 제3 단계;를 포함하는 것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제1 단계는,상기 이미지가 현미경을 통해 수집한 현미경이미지, 형광염색시약을 통해 형광물질로 염색된 형광염색이미지 및의료기기의 의료영상을 캡쳐한 의료이미지 중 적어도 하나인 것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 제2 단계는,상기 저장된 이미지를 적어도 하나의 이미지영역으로 나누는 제2-1 단계; 및상기 이미지영역을 특정코딩으로 치환하여 상기 대표값을 추출하는 제2-2 단계;를 포함하는 것을 특징으로 하는딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제2-1 단계는,상기 저장된 이미지의 비트 수를 균일한 픽셀 수로 구분하여 상기 이미지영역으로 나누는 것을 특징으로 하는딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 특정코딩은,상기 이미지영역마다 상기 대표값을 2자리 수 또는 4자리 수로 특정하는 것을 특징으로 하는 딥러닝 학습이미지저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 3 항에 있어서,상기 2-2 단계는,상기 이미지영역으로부터 2n을 통해 상기 대표값을 추출하며,상기 n은 치환된 이미지의 비트 수인 것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법.공개특허 10-2020-0063796-3-청구항 7 제 6 항에 있어서,상기 제2-2 단계는,인접한 상기 이미지영역으로부터 추출되는 인접한 상기 대표값이 서로 중복되지 않도록 하는 것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 제2 단계는,상기 저장된 이미지를 구성하는 픽셀 중 앞의 2자리이면서, 상기 저장된 이미지의 전체 비트 수의 절반 이하인픽셀을 대표값으로 추출하는 것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 제3 단계는,상기 학습이미지를 생성할 때, 발생되는 빈 공간을 채우거나 제거 또는 상기 빈 공간에 이미지 정보를 추가하는것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 이미지 정보는,상기 이미지에 형광 수가 포함된 정도를 포함하는 정보인 것을 특징으로 하는 딥러닝 학습이미지 저장 및 처리방법."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 딥러닝 학습이미지 저장 및 처리방법을 개시한다. 본 발명의 일 실시예에 따른 딥러닝 학습이미지 저 장 및 처리방법은, 적어도 하나의 이미지를 캡쳐하여 저장하는 제1 단계; 저장된 이미지로부터 대표값을 추출하 는 제2 단계; 및 추출된 대표값을 배열하여 학습이미지를 생성하는 제3 단계;를 포함한다."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 딥러닝 학습이미지를 저장 및 처리방법에 관한 것이다."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(Artificial Intelligence, AI) 시스템은 인간 수준의 지능을 구현하는 컴퓨터 시스템이며, 기존 Rule 기반 스마트 시스템과 달리, 기계가 스스로 학습하고 판단하면서 똑똑해지는 시스템이다. 이러한 인공지능 시스 템은 사용할수록 인식률이 향상되며 사용자 취향을 보다 정확하게 이해할 수 있게 되어, 기존 Rule 기반 스마트 시스템은 전차 딥러닝 기반의 인공지능 시스템으로 대체되고 있다. 인공지능 기술은 딥러닝(기계학습 또는 심층학습) 및 딥러닝을 이용한 요소 기술들로 구성된다. 이러한 딥러닝(심층학습 또는 기계학습, deep learning)은 여러 비선형 변환기법의 조합을 통해 높은 수준의 추"}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "상화(abstraction, 다량의 데이터나 복잡한 자료들 속에서 특징, 핵심적인 내용 또는 기능을 요약하는 작업)를 시도하는 기계학습(machine learning) 알고리즘의 집합으로 정의될 수 있으며, 사람의 사고방식을 컴퓨터에게 가르치는 기계학습의 한 분야이다. 이러한 딥러닝은 기계로부터 만들어진 지능을 의미하는 인공지능과 함께 산 업 전반에 사용되고 있다. 한편, 멀티미디어 기술 및 컴퓨터 기술이 발전함에 따라, 사용자는 전자장치를 이용하여 다양한 서비스를 제공 받게 되었다. 특히, 이미지 처리 기술이 점차 발전함에 따라, 사용자는 이미지 처리장치를 이용하여 다양한 고 화질 이미지를 제공받을 수 있게 되었다. 하지만, 종래에는 전자장치의 기계학습을 통해 고화질의 이미지를 처리할 때, 고화질 이미지의 용량이 지나치게 커서, 불필요하게 많은 시간 및 하드웨어적 자원이 소모되었다. 뿐만 아니라, 시간 및 하드웨어적 자원의 소모 에 비해 기계학습 속도가 현저히 떨어지는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국공개특허 제10-2018-0004898호 (특허문헌 0002) 대한민국공개특허 제10-2018-0092494호"}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 안출된 것으로서, 본 발명은 용량이 큰 이미지를 콤팩트하게 재 처리하여 딥러닝 학습이미지 처리장치의 딥러닝 학습속도를 개선할 수 있는 있는 딥러닝 학습이미지 저장 및 처 리방법을 제공하는데 그 목적이 있다. 한편, 본 발명에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급하지 않"}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명 확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 기술적 방법으로서, 본 발명의 일 실시예에 따른 딥러닝 학습이미지 저장 및 처리방 법은, 적어도 하나의 이미지를 캡쳐하여 저장하는 제1 단계; 저장된 이미지로부터 대표값을 추출하는 제2 단계; 및 추출된 대표값을 배열하여 학습이미지를 생성하는 제3 단계;를 포함한다. 일 실시예에서, 제1 단계는, 이미지가 현미경을 통해 수집한 현미경이미지, 형광염색시약을 통해 형광물질로 염 색된 형광염색이미지 및 의료기기의 의료영상을 캡쳐한 의료이미지 중 적어도 하나이다. 일 실시예에서, 제2 단계는, 저장된 이미지를 적어도 하나의 이미지영역으로 나누는 제2-1 단계; 및 이미지영역 을 특정코딩으로 치환하여 대표값을 추출하는 제2-2 단계;를 포함한다. 일 실시예에서, 제2-1 단계는, 저장된 이미지의 비트 수를 균일한 픽셀 수로 구분하여 이미지영역으로 나눈다. 일 실시예에서, 특정코딩은, 이미지영역마다 대표값을 2자리 수 또는 4자리 수로 특정한다. 일 실시예에서, 2-2 단계는, 이미지영역으로부터 2n을 통해 상기 대표값을 추출하며, n은 치환된 비트 수이다. 일 실시예에서, 제2-2 단계는, 인접한 이미지영역으로부터 추출되는 인접한 대표값이 서로 중복되지 않도록 한 다. 일 실시예에서, 특정코딩은, 인접한 이미지영역으로부터 추출되는 인접한 대표값이 서로 중복되지 않도록 특정 한다. 일 실시예에서, 2-2 단계는, 이미지영역으로부터 2n을 통해 상기 대표값을 추출하며, n은 치환된 이미지의 비트 수이다. 다른 실시예에서, 제2 단계는, 저장된 이미지를 구성하는 픽셀 중 앞의 2자리이면서, 저장된 이미지의 전체 비 트 수의 절반 이하인 픽셀을 대표값으로 추출한다. 다른 실시예에서, 제3 단계는, 학습이미지를 생성할 때, 발생되는 빈 공간을 채우거나 제거 또는 빈 공간에 이 미지 정보를 추가한다. 다른 실시예에서, 이미지 정보는, 이미지에 형광 수가 포함된 정도를 포함하는 정보이다."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 이미지로부터 대표값을 추출하여 이미지를 재처리하고, 추출된 대표값을 딥러닝 학습이미지로 생성함으로써, 이미지에 대한 딥러닝 학습속도를 향상시킬 수 있다. 한편, 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과"}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다. 이하의 상세한 설명은 본 발명의 완전한 이해를 제공하기"}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "위해서 구체적 세부사항을 포함한다. 그러나, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명 이 이러한 구체적 세부사항 없이도 실시될 수 있음을 안다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소 를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제 외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 본 발명의 실시예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경 우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 딥러닝 학습이미지 저장 및 처리장치의 구성 도 1은 본 발명의 제1 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치의 개략적인 구성을 나타내는 블록도 이며, 도 2는 본 발명의 제2 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치의 개략적인 구성을 나타내는 블록도이다. 이하에서는, 도 1 내지 도 2를 참조하여 본 발명의 제1 실시예와 제2 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치의 개략적인 구성을 살펴보도록 하겠다. 즉, 본 발명의 제1, 2 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치는 도 1 내지 도 2에 도시된 개략적인 구성 외에도 추가적으로 필요한 구성이 마련될 수 있는 것으로 이해되는 것이 바람직할 것이다. <제1 실시예> 본 발명의 제1 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치는 도 1을 참조하여 살펴보면, 메모리부, 이미지영역 생성부, 대표값 추출부 및 학습이미지 생성부를 포함하여 구성된다. 메모리부는 딥러닝 학습을 위한 이미지가 저장된다. 이러한 메모리부는 다양한 방식으로 생성된 이미지 를 저장하게 된다. 구체적인 예를 들면, 메모리부에 저장된 이미지는 현미경을 통해 수집한 현미경 이미지, 형광염색시약을 통 해 형광물질로 염색된 형광염색이미지 및 의료기기의 의료영상을 캡쳐한 의료이미지 중 적어도 하나일 수 있다. 이미지영역 생성부는 메모리부에 저장된 이미지로부터 적어도 하나의 영역을 생성한다. 일 예로, 이미 지영역 생성부는 이미지의 비트 수와 픽셀 수를 이용하여 적어도 하나의 이미지영역을 생성한다. 더 구체적 인 예를 들면, 이미지영역 생성부는 이미지의 비트수를 균일한 픽셀 수로 구분하여 적어도 하나의 이미지영 역을 생성한다. 대표값 추출부는 이미지영역 생성부에 의해 나누어진 이미지영역을 특정코딩으로 치환하여 이미지영역 으로부터 대표값을 추출한다. 이러한 대표값 추출부는 특정코딩으로 치환된 이미지영역의 비트 수를 이용하 여 대표값을 추출한다. 더 구체적인 예를 들면, 대표값 추출부는 이미지영역으로부터 2n을 통해 대표값을 추 출한다. 여기서, n은 치환된 이미지의 비트 수이다. 즉, 치환된 이미지의 비트 수(n)가 2비트라면, 대표값 추출 부는 이미지영역으로부터 4개의 대표값을 추출하는 것이다. 이와 같이, 대표값 추출부가 대표값을 추출하기 위해, 이미지영역 생성부는 추출될 대표값과 동일 또는 추출될 대표값 보다 많게 이미지영역을 생성하는 것이 바람직할 것이다. 여기서, 대표값이라 함은, 대표값 추출부를 통해 이미지영역으로부터 추출된 이미지의 대표값으로, 후술될 딥러닝 학습이미지 저장 및 처리과정을 통해 학습이미지로 생성될 이미지의 정보값을 의미한다. 일 예로, 대표값 추출부는 이미지영역의 대표값을 2자리 수 또는 4자리 수로 추출한다. 또한, 대표값 추출부는 인접한 이미지영역 간의 대표값이 서로 중복되지 않도록 대표값을 추출한다. 구체적 인 예를 들면, 대표값 추출부는 첫 번째의 이미지영역으로부터 대표값을 2자리 수인 '01'으로 추출할 때, 첫 번째 이미지영역과 인접한 두 번째의 이미지영역에서는 대표값이 '01'이 아닌 다른 2자리 수로 추출한다. 학습이미지 생성부는 대표값 추출부에 의해 추출된 대표값을 배열하여 딥러닝 학습을 위한 학습이미지 를 생성한다. 일 예로, 학습이미지 생성부는 이미지영역의 순으로 대표값을 배열하여 학습이미지를 생성한 다. 구체적인 예를 들면, 학습이미지 생성부는 대표값 추출부가 첫 번재 이미지영역으로부터 2자리 수 인 '01', 두 번째 이미지영역으로부터 2자리 수인 '10'으로 대표값을 추출할 때, 이미지영역 순으로 대표값을 배열하여 '0110' 값의 학습이미지를 생성한다. <제2 실시예> 본 발명의 제2 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치는 도 2를 참조하여 살펴보면, 메모리부, 픽셀 추출부, 대표값 추출부, 학습이미지 생성부를 포함하여 구성된다. 여기서, 메모리부는 제1 실시예의 메모리부와 동일한 구성이므로, 이에 대한 자세한 설명은 생략하도록 하겠다. 픽셀 추출부는 종래의 RGB 시스템과 다르게 메모리부에 저장된 이미지로부터 적어도 하나의 픽셀을 추 출한다. 구체적으로, 종래의 RGB 시스템은 적색(red), 녹색(green), 청색(blue)의 색상을 이용하여 이미지로부 터 픽셀을 추출한 반면, 픽셀 추출부는 메모리부에 저장된 이미지의 형광파장대별로 픽셀을 추출한다. 이러한 픽셀 추출부는 종래의 RGB 시스템보다 이미지로부터 더 많은 픽셀을 추출하는 것이 가능하다. 대표값 추출부는 픽셀 추출부가 추출한 픽셀을 확대한 후에, 대표값을 추출한다. 일 예로, 대표값 추출 부가 픽셀을 확대하게 되면, 픽셀은 복수(예: 8개)의 픽셀정보를 포함할 수 있다. 그 후, 대표값 추출부 는 설정된 조건부에 따라 픽셀 중 앞의 2자리이면서 메모리부에 저장된 이미지의 전체 비트 수의 절반 이하인 픽셀을 대표값으로 추출한다. 학습이미지 생성부는 대표값 추출부에 의해 추출된 대표값을 배열하여 딥러닝 학습을 위한 학습이미지 로 생성한다. 일 예로, 학습이미지 생성부는 이미지의 형광파장대 순으로 대표값을 배열하여 학습이미지를 생성할 수 있다.딥러닝 학습이미지 저장 및 처리방법 도 3은 본 발명의 제1, 2 실시예에 따른 딥러닝 학습이미지 저장 및 처리방법의 단계흐름도이며, 도 4는 본 발 명의 제1 실시예에 따른 대표값 추출 단계의 세부 단계흐름도이고, 도 5는 본 발명의 제1 실시예에 따른 이미지 영역 생성 단계의 이미지 영역 생성과정과 특정코딩 치환 기반의 대표값 추출 단계의 대표값 추출과정을 설명하 기 위한 도면이며, 도 6은 본 발명의 제2 실시예에 따른 대표값 추출 단계의 세부 단계흐름도이고, 도 7은 본 발명의 제2 실시예에 따른 픽셀 추출 단계에서 형광파장대별로 이미지의 픽셀을 추출하는 과정을 설명하기 위한 도면이며, 도 8은 본 발명의 제2 실시예에 따른 조건부 대표값 추출 단계의 대표값 추출 방식과 대표값 배열 단 계의 대표값 배열과정을 설명하기 위한 도면이고, 도 9는 본 발명의 제2 실시예에 따른 대표값 배열 단계를 통 해 생성된 빈 공간이 포함되는 대표값을 설명하기 위한 도면이다. 이하에서는, 도 3 내지 도 5를 참조하여 본 발명의 제1 실시예에 따른 딥러닝 학습이미지 저장 및 처리방법을 설명하도록 하겠으며, 도 3 및 도 6 내지 도 9를 참조하여 본 발명의 제2 실시예에 따른 딥러닝 학습이미지 저 장 및 처리방법을 설명하도록 하겠다. <제1 실시예> 먼저, 메모리부는 딥러닝 학습을 위한 이미지를 저장한다(S10). 이러한 메모리부에 저장된 이미지는 상술한 바와 같이, 현미경을 통해 수집한 현미경 이미지, 형광염 색시약을 통해 형광물질로 염색된 형광염색이미지 및 의료기기의 의료영상을 캡쳐한 의료이미지 중 적어도 하나 일 수 있다. 이미지 저장단계(S10) 후, 이미지영역 생성부는 메모리부에 저장된 이미지에 이미지영역을 생성하 며, 대표값 추출부는 구분된 이미지영역으로부터 대표값을 추출한다(S20). 이러한 대표값 추출단계(S20)는 도 4를 참조하여 살펴보면, 이미지영역 생성부가 이미지영역을 생성하는 단 계(S21)와 대표값 추출부가 이미지영역을 특정코딩으로 치환하여 대표값을 추출하는 단계(S22)로 세분화된 다. 이미지영역 생성단계(S21)는 도 5를 참조하여 살펴보면, 이미지영역 생성부가 메모리부에 저장된 이미 지의 비트수를 균일한 픽셀 수로 구분하여 이미지영역(100a, 100b, 100c, 100d)을 생성한다. 여기서, 이미 지영역(100a, 100b, 100c, 100d)은 도시된 것보다 더 많게 생성되거나 적게 생성될 수 있다. 대표값 추출단계(S22)는 도 5를 참조하여 살펴보면, 대표값 추출부가 이미지영역(100a, 100b, 100c, 100d) 을 특정코딩으로 치환하여 이미지영역으로부터 대표값을 추출한다. 이러한 대표값 추출부는 상술한 바 와 같이 2n을 통해 대표값을 추출하며, 여기서, n은 상술한 바와 같이 치환된 이미지의 비트 수이다. 또한, 대표값 추출부는 대표값을 2자리 수 또는 4자리 수로 추출하며, 인접한 이미지영역(100a, 100b, 100c, 100d) 간의 대표값은 서로 중복되지 않도록 한다. 이러한 대표값 추출단계(S22)의 일 예로, 치환된 이미지의 비트 수(n)가 2비트일 경우, 대표값 추출부(3 0)는 2n이 4이므로, 제1, 2, 3, 4 이미지영역(100a, 100b, 100c, 100d)으로부터 대표값을 추출할 수 있다. 그리 고 대표값 추출부가 2자리 수로 대표값을 추출하는 경우, 대표값 추출부는 제1 이미지영역(100a)으로부 터 '00', 제2 이미지영역(100b)으로부터 '01', 제3 이미지영역(100c)으로부터 '10', 제4 이미지영역(100d)으로 부터 '11'로 대표값을 추출할 수 있다. 대표값 추출단계(S22) 후, 학습이미지 생성부는 대표값을 배열하여 학습이미지를 생성한다(S30). 이러한 학 습이미지 생성부는 상술한 바와 같이 일 예로, 이미지영역(100a, 100b, 100c, 100d)의 순으로 대표값을 배 열하여 학습이미지를 생성할 수 있다. 지금까지 상술한 본 발명의 제1 실시예에 따른 딥러닝 학습이미지 저장 및 처리방법을 통해 본 발명의 제1 실시 예에 따른 딥러닝 학습이미지 저장 및 처리장치는 기존의 이미지보다 용량이 감소된 학습이미지를 통해 딥러닝 학습을 수행함으로써, 딥러닝 학습속도가 크게 개선될 수 있다. <제2 실시예> 먼저, 메모리부는 딥러닝 학습을 위한 이미지를 저장한다(S10). 한편, 제2 실시예의 이미지는 제1 실시예의 이미지와 부호만 다를 뿐, 동일한 종류의 이미지를 뜻한 다. 이미지 저장단계(S10) 후, 픽셀 추출부는 메모리부에 저장된 이미지의 픽셀을 추출하며, 대표값 추출부는 설정된 조건부에 따라 픽셀로부터 대표값을 추출한다(S20). 이러한 대표값 추출단계(S20)는 도 6을 참조하여 살펴보면, 픽셀 추출부가 메모리부에 저장된 이미지 로부터 픽셀을 추출하는 단계(S23)와 대표값 추출부가 설정된 조건부에 따라 픽셀로부터 대표값을 추 출하는 단계(S24)로 세분화된다. 픽셀 추출단계(S23)는 도 7을 참조하여 살펴보면, 픽셀 추출부가 메모리부에 저장된 이미지를 형 광파장대별로 분류한다. 일 예로, 이미지는 픽셀 추출부에 의해 제1 이미지(200a), 제2 이미지(200b), 제3 이미지(200c), 제4 이미지(200d)로 분류된다. 이때, 제1 이미지(200a)는 적색파장, 제2 이미지(200b)는 녹 색파장, 제3 이미지(200c)는 청색파장, 제4 이미지(200d)는 자색파장일 수 있다. 그 후, 픽셀 추출부는 분류된 제1 이미지(200a)로부터 제1 픽셀, 제2 이미지(200b)로부터 제2 픽셀 , 제3 이미지(200c)로부터 제3 픽셀, 제4 이미지(200d)로부터 제4 픽셀을 각각 추출한다. 여기 서, 픽셀 추출부가 추출한 제1, 2, 3, 4 픽셀(201, 202, 203, 204)은 제1, 2, 3, 4 이미지(200a, 200b, 200c, 200d)를 구성하는 1개의 픽셀을 의미한다. 이러한 제1, 2, 3, 4 픽셀(201, 202, 203, 204)은 확대하면 복수개(예: 8개)의 픽셀정보로 구성될 수 있다. 픽셀 추출단계(S23) 후, 조건부 대표값 추출단계(S24)는 도 8을 참조하여 살펴보면, 대표값 추출부가 설정 된 조건부에 따라 제1 픽셀로부터, 제1 대표값(201a), 제2 픽셀로부터 제2 대표값(202a), 제3 픽셀 로부터 제3 대표값(203a), 제4 픽셀로부터 제4 대표값(204a)을 각각 추출한다. 여기서, 대표값 추출의 조건부라 함은, 픽셀 중 앞의 2자리이면서 메모리부에 저장된 이미지의 전체 비트 수의 절반 이하인 픽셀을 대표값으로 추출하는 조건부를 의미한다. 조건부 대표값 추출단계(S24) 후, 학습이미지 생성부는 대표값 추출부가 추출한 대표값을 배열하여 학 습이미지를 생성한다(S30). 구체적으로, 학습이미지 생성부는 형광파장대 순으로 제1 대표값(201a), 제2 대표값(202a), 제3 대표값(203a), 제4 대표값(204a)을 배열하여 학습이미지를 생성할 수 있다. 한편, 학습이미지 생성단계(S30)는 도 9을 참조하여 살펴보면, 학습이미지 생성부가 대표값을 배열하여 학 습이미지를 생성할 때, 학습이미지에 빈 공간이 발생될 수 있다. 이때, 학습이미지 생성부 는 빈 공간을 채우거나 제거 또는 빈 공간에 이미지 정보를 추가한다. 여기서, 이미지 정보라 함은, 이미지에 형광 수가 포함된 정도를 포함하는 정보일 수 있다. 지금까지 상술한 본 발명의 제2 실시예에 따른 딥러닝 학습이미지 저장 및 처리방법을 통해 본 발명의 제2 실시 예에 따른 딥러닝 학습이미지 저장 및 처리장치는 본 발명의 제1 실시예와 마찬가지로, 기존의 이미지보다 용량 이 감소된 학습이미지를 통해 딥러닝 학습을 수행함으로써, 딥러닝 학습속도가 크게 개선될 수 있다."}
{"patent_id": "10-2018-0149952", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2018-0149952", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치의 개략적인 구성을 나타내는 블록도 이다. 도 2는 본 발명의 제2 실시예에 따른 딥러닝 학습이미지 저장 및 처리장치의 개략적인 구성을 나타내는 블록도 이다. 도 3은 본 발명의 제1, 2 실시예에 따른 딥러닝 학습이미지 저장 및 처리방법의 단계흐름도이다. 도 4는 본 발명의 제1 실시예에 따른 대표값 추출 단계의 세부 단계흐름도이다. 도 5는 본 발명의 제1 실시예에 따른 이미지영역 생성 단계의 이미지 영역 생성과정과 특정코딩 치환 기반의 대 표값 추출 단계의 대표값 추출과정을 설명하기 위한 도면이다. 도 6은 본 발명의 제2 실시예에 따른 대표값 추출 단계의 세부 단계흐름도이다. 도 7은 본 발명의 제2 실시예에 따른 픽셀 추출 단계에서 형광파장대별로 이미지의 픽셀을 추출하는 과정을 설 명하기 위한 도면이다. 도 8은 본 발명의 제2 실시예에 따른 조건부 대표값 추출 단계의 대표값 추출 방식과 대표값 배열 단계의 대표 값 배열과정을 설명하기 위한 도면이다. 도 9는 본 발명의 제2 실시예에 따른 대표값 배열 단계를 통해 생성된 빈 공간이 포함되는 대표값을 설명하기 위한 도면이다."}
