{"patent_id": "10-2022-0035107", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0137570", "출원번호": "10-2022-0035107", "발명의 명칭": "마이크로 디스플레이용 색 변환층 소재", "출원인": "한국생산기술연구원", "발명자": "최준"}}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "하기 화학식 1로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료:[화학식 1]여기서,상기 R1 및 R2는 각각 H 또는 Cl임."}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "하기 화학식 2로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료:[화학식 2].공개특허 10-2023-0137570-3-청구항 3 i) 하기 화학식 3 또는 4로 표시되는 화합물 중 어느 하나의 화합물에 리튬 1,1,2,3,3-헥사플루오로프로판-1,3-디슬폰이미드(1,1,2,3,3-hexafluoropropane-1,3-disulfonimide; Li-HFPSI) 및 용매를 혼합한 후 교반하는단계;[화학식 3];[화학식 4]ii) 상기 혼합물로부터 유기층을 추출하는 단계; 및iii) 상기 유기층을 건조시키는 단계;를 포함하는, 하기 화학식 1로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료의 제조 방법:[화학식 1].공개특허 10-2023-0137570-4-청구항 4 i) 에틸 바이올렛(Ethyl Violet; EV)에 리튬 1,1,2,3,3-헥사플루오로프로판-1,3-디슬폰이미드(1,1,2,3,3-hexafluoropropane-1,3-disulfonimide; Li-HFPSI) 및 용매를 혼합한 후 교반하는 단계;ii) 상기 혼합물로부터 유기층을 추출하는 단계; 및iii) 상기 유기층을 건조시키는 단계;를 포함하는, 하기 화학식 2로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료의 제조방법:[화학식 2]."}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 제1항의 염료, 청구항 제2항의 염료, 또는 상기 두 염료의 혼합물을 포함하는 청색 컬러레지스트 제형."}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 제5항에 있어서,상기 혼합물은 청구항 제1항의 염료 및 청구항 제2항의 염료를 1 : 1로 혼합하는 것을 특징으로 하는 청색 컬러레지스트 제형."}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 제5항에 있어서,프로필렌 글리콜 메틸 에테르 아세테이트(Propylene glycol methyl ether acetate; PGMEA) 및 아크릴 고분자(acrylic polymer) 바인더를 더 포함하는 것을 특징으로 하는 청색 컬러레지스트 제형."}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 제5항의 청색 컬러레지스트를 코팅하여 제조된 필름."}
{"patent_id": "10-2022-0035107", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 제8항에 있어서,공개특허 10-2023-0137570-5-청색 컬러레지스트를 기판에 스핀코팅하여 도포한 후, 사전 및 사후 베이킹하여 제조하는 것을 특징으로 하는필름."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 마이크로 디스플레이용 청색 컬러레지스트 염료 및 이를 합성하는 방법에 관한 것으로, 구체적으로 본 발명에 따른 하기 화학식 1로 표시되는 화합물을 포함하는 DTPM1-HFPSI 또는 DTPM1-Cl-HFPSI 염료, 상기 염료에 EV-HFPSI 염료 및 바인더를 포함하는 청색 컬러레지스트, 및 상기 청색 컬러레지스트를 코팅한 필름에 관한 것이 (뒷면에 계속)"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 마이크로 디스플레이용 청색 컬러레지스트 염료 및 이를 합성하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능(Artificial intelligence; AI), 5세대 이동통신(5th generation mobile telecommunication; 5G) 기술 을 기반으로 급속도로 성장하는 메타버스(metaverse) 기술의 수요가 증가함에 따라 해당 소프트웨어 기술을 구 현해 줄 하드웨어 기술이 필요하다. 4차 산업 혁명에서 가상현실(virtual reality; VR) 및 증강현실(augmented reality; AR) 기술은 독립적으로 발달한 기술들의 초융합을 구현할 주요한 폼팩터이며, 인간의 느끼는 감각 중 약 80%를 차지하는 시각에 있어서 게임, 교육, 쇼핑, 여행 등의 일상 환경과, 의료, 과학, 군사 등의 특수환경 에서 다양하고 새로운 가치를 창출할 수 있을 것으로 기대되고 있다. 그러므로 VR 및 AR 기기는 최대 지향점은 생동감 넘치는 시각정보의 제공이다. 이 장비의 핵심 부품은 약 1인치 크기의 고휘도 고해상도 마이크로디스플 레이 패널이다. 최근 10년간 완성형 VR 및 AR 기기는 대부분 두부 장착 형 또는 안경형 타입으로 출시됐다. 따 라서 무게는 가벼워야 하며, 사용자의 눈 가까이에서 패널에서 출력된 이미지를 보기 때문에 화질이 매우 우수 해야 한다. VR 기기에 있어서 초기 형태는 스마트폰 커넥트형 또는 유리기판과 박막 트랜지스터(thin film transistor; TFT) 기반의 4 ~ 6인치 크기의 디스플레이 패널이 장착된 헤드 마운트 디스플레이(head mounted display; HM D)를 사용했다. 따라서 부피와 무게가 커지는 문제를 발생시켰으며, 이러한 VR 기기는 몰입감을 위해 HMD 내부 광학계를 통해 확대한 이미지를 보여주기 때문에 디스플레이 패널의 픽셀(pixel) 간격 사이 검은 부분이 확대되 어 보이는 스크린도어 효과(screen door effect)가 발생하여 몰입도가 떨어지고, 눈의 피로도가 증가하는 문제 가 발생한다. AR 기기는 안경형 타입으로 개발되어 왔다. 그러므로 장착되는 디스플레이 패널은 부피와 무게가 작은 마이크로 디스플레이 패널만이 부피가 한정적인 안경에 장착될 수 있다. 일반적으로 이러한 AR 기기에서 디스플레이 패널 은 측면에 위치하게 되며 복잡한 광학계를 통해 출력되는 이미지가 눈 앞에 보여지게 된다. AR 기기는 패널에서 출력되는 이미지와 주변 자연환경의 백그라운드 이미지가 합쳐져 이질감 없이 보여져야 한다. 즉, 패널에서 이 미지로 출력되는 빛의 세기는 자연광만큼 또는 그 이상의 휘도를 확보해야 한다. 따라서 광학계를 구성함에 있 어서 광 손실을 최소화 할 수 있도록 최적화하는 연구와 더불어 고휘도 마이크로디스플레이 패널에 대한 연구가 필요하다. 그러므로 VR 및 AR 기기용 디스플레이패널 모두 무게와 부피가 작고 고휘도 및 고해상도를 동시에 만족하는 마 이크로디스플레이 패널이 적합하다. 이 모든 조건을 만족하는 마이크로디스플레이 기술 중 하나는 백색 유기발 광다이오드(White Organic Light Emitting Diode; WOLED) 기술을 이용한 실리콘의 유기발광다이오드(Organic Light Emitting Diode on Silicon; OLEDoS)가 있다. OLEDoS는 Si water에 적용한 마이크로디스플레이로서 기존 OLED 디스플레이와 동작원리 및 구조는 유사하다. 기판이 Si wafer이기 때문에 배면발광(bottom-emission)방식 이 아닌 전면발광(top-emission)방식으로 설계되어 높은 개구율을 특징으로 고휘도 디스플레이패널을 제작하기 에 적절하다. 일반적으로 R/G/B OLED 방식과 White OLED 방식으로 구분되지만 R/G/B OLED 방식은 Red, Green, Blue sub pixel 발광층을 형성하기 위해 파인메탈마스크(fine metal mask; FMM)를 통한 정교한 sub pixel 정렬 기술이 필요하다. 하지만 4000 ppi 급의 초고해상도를 구현해야 함에 있어서 기존 FMM 방법은 FMM의 금속소재의 물성의 한계로 인해 마스크의 처짐 현상이 발생하여 R/G/B sub pixel 발광층 형성이 쉽지 않다. 반면, White OLED 방식은 하나의 white 발광층을 형성하기 때문에 FMM 방법에 제한 받지 않는 특징이 있다. RGB 서브픽셀을 구현하는 방법은 유리기판에 컬러필터(color filter)를 구현하고 White OLED가 형성된 기판과 합치는 합착법과 White OLED 발광층 형성 이후 도입되는 봉지박막 층 위에 직접 컬러필터를 형성하는 적층법이 있다. 합착법은 기존 TV 및 스마트폰 용 패널 제작방식에는 적합하지만 초고해상도 마이크로디스플레이의 경우매우 정교한 정렬 및 합착 기술이 필요하고 WOLED 층과 컬러필터층 사이 간격이 넓을 경우 광학적 크로스-토크 (cross-talk) 현상이 발생할 수 있다. 반면, 발광층 위 봉지박막 층 위에 직접 컬러필터를 형성하는 적층법의 경우 위와 같은 현상을 방지할 수 있다. 하지만, 부분 픽셀(sub pixel)을 구성하는 단계에서 하부 발광층의 열 화(degradation)를 최소화 할 수 있도록 컬러필터를 이루는 컬러레지스트의 최적화가 필요하다. 컬러필터를 형성하는 방법은 일반적으로 안료분산법, 염색법, 프린팅, 전착법 중 가장 일반적인 방법은 안료 분 산법이다. 안료분산법이란 안료를 미세하게 분쇄한 후 균일하게 분산한 컬러레지스트(color resist) 조성물을 사용하여 포토리소그래피에 의해 RGB 패턴을 형성하는 방법이다. 안료 분산법은 내구성과 신뢰성이 높아 널리 사용되고 있다. 그러나 안료는 입자 크기가 크기 때문에 투과율의 감소가 일어나며, 또한 빛의 산란이 발생하여 색 순도와 휘도가 낮아지는 문제점이 있다. 그리고 안료입자의 미세화를 위해 사용되는 분산제, 시너지스트와 같은 각종 첨가제는 완전한 분산 및 색상 조절을 위해 추가적인 최적화 과정이 필요하며, 색 순도의 감소와 가 격상승 등의 문제를 야기하며 지르코니아 비드(zirconia bead)를 사용한 볼밀링 방법의 제조공정으로 인해 많은 시간과 에너지를 소모하게 된다. 반면, 염료로 제조된 컬러레지스트(color resist)는 안료로 제조된 컬러레지스트에 비해 많은 장점이 있다. 일 반적으로 염료는 용매에 대한 높은 용해도로 인해 추가 분산공정이 필요하지 않다. 또한 염료는 안료보다 입자 크기가 작고 sharp한 흡수대역을 가지고 있기 때문에 높은 투과도와 높은 색 순도를 나타낸다. 따라서 고휘도 OLEDoS 마이크로디스플레이 패널의 제작 목적에 적합한 RGB 서브픽셀 패턴을 구현할 수 있다. 또한 안료분산법 으로 제작된 컬러필터 보다 박막화를 이루는데 더 용이하다. 하지만, 안료 기반 컬러레지스트에 비해 염료 기반 컬러레지스트는 낮은 열 및 광 안정성이 단점이기 때문에 이것을 보완할 수 있는 방법이 필요하다. 일반적으로 착색에 사용되는 색소물질로는 용제에 가용성인 염료(dye) 또는 불용성 특성을 가진 안료(pigment) 가 사용되고 있다. 여기서, 염료는 용제에 용해되는 특성을 가지며, 이로 인해 에너지 소모적인 분산과정의 단 순화를 이룰 수 있다. 또한, 이를 통해 제조된 착색제는 색소분자사이 응집이 적기 때문에 구현되는 색의 투명 성 및 선명성이 우수하다는 이점이 있다. 반면, 안료는 용제에 녹지 않는 특성으로 인해 복잡한 분산과정을 통해 용제에 분산되어있는 미립자 상태로 제 조한다. 이로인해 공정복잡도의 상승을 야기하고. 또한, 이를 통해 제조된 착색제는 시간이 지남에 따라 안료 입자끼리 응집되어 응집체를 형성한다. 이 경우 착색제는 점도의 변화가 발생하여 저장 안정성 및 저장 안정성 이 낮아진다. 최근에는 액정표시장치 또는 유기발광소자 표시장치와 같은 기존 평판디스플레이 장치 및 고밀도 고집적화된 분 야인 마이크로디스플레이 및 이미지센서 분야에 있어서, 표시 또는 촬영되는 상의 색을 구현하기 위해 색변환층 을 사용하고 있으며, 색변환층은 적색, 녹색, 그리고 청색에 대응하는 적절한 색소 입자를 바인더 수지를 포함 하는 용제에 분산시켜 설계된 위치에 도막을 형성함으로써 착색된 경화막 형태로 제공된다. 여기서, 컬러필터용 청색 색소로는 예를 들어, C.I. 피그먼트 블루(이하, PB로 기재한다)15, PB15:1, PB15:2, PB15:3, PB15:4, PB15:6 등 프탈로시아닌계 화합물 기반의 안료를 주로 사용되고 있다. 이러한 안료를 구성하는 안료 입자는 입자간 응집성이 강하기 때문에 시간이 지남에 따라 용제 중 안료 입자가 서로 응집되어 종래에는 안료 입자가 고르게 분산되지 않은 안료 분산체가 얻어지는 문제가 있다. 이와 같이 용제 내 안료 입자의 분산 상태가 불량한 안료 분산체를 사용하여 색변환층용 착색 경화막을 제조할 경우, 광 투과율이 저하함이 알려져 있으며, 마이크로디스플레이 및 이미지센서와 같은 고밀도 고집적도 색변환 층을 구현함에 있어서 픽셀화(pixelation)의 국부적 불균형이 발생할 수 있다. 예를 들어 마이크로디스플레이 분야에서 약 2,490 ppi의 해상도를 0.8 인치 마이크로디스플레이패널에 구현하기 위해서는 적,녹,청의 보조화소(subpixel)의 너비는 약 3.6 마이크로미터, 보조화소간 간격은 약 200 nm 로 픽셀 구성이 고밀도 및 고집적화 된다. 따라서 안정적인 전,녹,청 보조화소의 설계를 위해서는 입자 크기가 작은 색 재료가 필요함이 타당하다(Chan-mo Kang, et al., JOURNAL OF INFORMATION DISPLAY, 2021, VOL. 22, NO. 3, 163-171). 상술한 문제를 해결하기 위해 안료 유도체를 안료의 분산제로 첨가하거나, 안료를 화학적 개질을 통해 안료표면 과 분산제사이 매개체 역할을 하는 시너지스트 물질을 도입하여 안료 입자간 응집성을 억제하는 방법 등이 제안 되고 있다.예를 들어, C.I. 피그먼트 옐로우150 등과 같은 아조계 화합물을 이용하는 경우 안료 시너지스트로서 아조 유도 체를 이용하는 방법이 제안된 바 있다(Yeonkyu Jeong, et al., MOLECULAR CRYSTALS AND LIQUID CRYSTALS, 2018, VOL. 662, 109-113). 또한, 안료로서, C.I 피그먼트 레드60 등과 같은 안트라퀴논계 화합물을 이용하는 경우 안료 시너지스트로서 안 트라퀴논 유도체를 이용하는 방법 역시 제안된 바 있다(Chun Yoon, et al., Mol. Cryst. Liq. Cryst., Vol. 533: pp. 102-112, 2010). 하지만, 지금 까지 제안된 방법들로는 안료 입자간 응집을 완벽히 억제하기 어려울 뿐만 아니라 본래 안료의 색 특성이 저하되는 문제등 다양한 부수적 문제들도 발생하였다. 이에 본 발명자들은 청색 컬러레지스트용 염료로 5종의 염료를 설계 및 합성하였다. 청색 컬러레지스트용 염료 로 모체염료 DTPM1으로 결정하였는데, 이는 기하학적 최적화(Geometry optimization) 결과에 따라서 두 외부이 면각이 70°정도로 거의 동일하므로 전체 공액 시스템(conjugated system)의 변형이 가장 적을 것으로 예상되며 DTPM 계열 중 가장 광안정성이 우수했기 때문이다. 또한, 적절한 광학적 특성을 얻는 것과 동시에 용해도 및 광 안정성을 향상시키기 위해 모체 염료 골격에 염소화(Chlorination) 및 최소배위음이온(Weakly coordinating anion)인 HFPSI를 도입하였다. DTPM1-HFPSI의 경우 부피가 큰(bulky)한 HFPSI 상대 음이온(counter anion)에 의한 입체장애 효과를 기대하였으며, HFPSI를 구성하는 전기음성도가 큰 플루오린(Fluorine) 원소에 의해 모체 염료의 퀜칭 부위(quenching site)인 양이온 자리로 접근하는 퀜차(quencher)의 접근의 억제를 유도하여 염료의 용해도와 광학 안정성, 그리고 흡수능력의 상승을 기대하였다. DTPM1-Cl-HFPSI의 경우 염소(chlorine) 원소를 치환함으로써 모체 염료의 흡수대를 심색효과(bathochromic effect)를 일으켜 적색영역을 흡수하도록 유도하였 다. 동시에 HFPSI를 도입하여 용해도의 상승 및 광학안정성, 주요 흡광능력의 상승을 기대하였다. 그리고 최적 의 청색 색 특성을 얻기 위해 그린(Green) 영역을 흡수해줄 보정염료를 값싼 상용염료인 에틸 바이올렛(Ethyl Violet)으로 정하였으며 마찬가지로 HFPSI를 도입했다. 이를 통해 모체염료 DTPM 1의 염소화(Chlorination) 및 상대 음이온(Counter anion)의 도입을 통해 청색영역의 투과도를 향상시킬 수 있었으며, 상용염료와의 배합을 통해 최적의 마이크로 디스플레이용 청색 컬러레지스트를 개발할 수 있었다."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 모체염료 DTPM1에 염소화(Chlorination) 및 최소배위음이온(Weakly coordinating anion)인 HFPSI를 도입하여, 용해도, 열적 안정성 및 광학적 안정성을 향상시킨 청색 컬러레지스트 염료를 제공하는 것이다. 본 발명의 또다른 목적은 모체염료 EV에 최소배위음이온(Weakly coordinating anion)인 HFPSI를 도입하여, 용해 도, 열적 안정성 및 광학적 안정성을 향상시킨 청색 컬러레지스트 염료를 제공하는 것이다. 본 발명의 다른 목적은 상기 본 발명에 따른 염료들인 DTPM1-HFPSI, DTPM1-Cl-HFPSI 또는 EV-HFPSI의 합성 방 법을 제공하는 것이다. 본 발명의 다른 목적은 상기 본 발명에 따른 염료들인 DTPM1-HFPSI, DTPM1-Cl-HFPSI 또는 EV-HFPSI 중 어느 하 나 또는 둘 이상을 포함하는 청색 컬러레지스트를 제공하는 것이다. 본 발명의 다른 목적은 상기 본 발명에 따른 청색 컬러레지스트를 포함하는 필름을 제공하는 것이다. 본 발명의 다른 목적은 상기 본 발명에 따른 청색 컬러레지스트를 포함하는 마이크로 디스플레이를 제공하는 것 이다."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 하기 화학식 1로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료를 제공한다: 화학식 1"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "여기서, 상기 R1 및 R2는 각각 H 또는 Cl임. 또한, 본 발명은 하기 화학식 2로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료를 제공한다: 화학식 2"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "또한, 본 발명은 i) 하기 화학식 3 또는 4로 표시되는 화합물 중 어느 하나의 화합물에 리튬 1,1,2,3,3-헥사플루오로프로판-1,3- 디슬폰이미드(1,1,2,3,3-hexafluoropropane-1,3-disulfonimide; Li-HFPSI) 및 용매를 혼합한 후 교반하는 단계;화학식 3"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 4, "content": "화학식 4"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 5, "content": "ii) 상기 혼합물로부터 유기층을 추출하는 단계; 및 iii) 상기 유기층을 건조시키는 단계;를 포함하는, 상기 [화학식 1]로 표시되는 화합물을 포함하는 청색 컬러레 지스트 염료의 제조 방법을 제공한다. 또한, 본 발명은 i) 에틸 바이올렛(Ethyl Violet; EV)에 리튬 1,1,2,3,3-헥사플루오로프로판-1,3-디슬폰이미드(1,1,2,3,3- hexafluoropropane-1,3-disulfonimide; Li-HFPSI) 및 용매를 혼합한 후 교반하는 단계; ii) 상기 혼합물로부터 유기층을 추출하는 단계; 및 iii) 상기 유기층을 건조시키는 단계;를 포함하는, 상기 [화학식 2]로 표시되는 화합물을 포함하는 청색 컬러레 지스트 염료의 제조방법을 제공한다. 또한, 본 발명은 상기 본 발명에 따른 [화학식 1]로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료, [화학식 2]로 표시되 는 화합물을 포함하는 청색 컬러레지스트 염료, 또는 이들 두 염료의 혼합물을 포함하는 청색 컬러레지스트 제 형을 제공한다. 또한, 본 발명은 상기 본 발명에 따른 [화학식 1]로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료, [화학식 2]로 표시되 는 화합물을 포함하는 청색 컬러레지스트 염료, 또는 이들 두 염료의 혼합물 중 어느 하나에 추가적으로 프로필 렌 글리콜 메틸 에테르 아세테이트(Propylene glycol methyl ether acetate; PGMEA) 및 아크릴 고분자(acrylicpolymer) 바인더를 더 포함하는 청색 컬러레지스트 제형을 제공한다. 아울러, 본 발명은 상기 본 발명에 따른 청색 컬러레지스트를 코팅하여 제조된 필름을 제공한다."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서는 WOLED 기반 고휘도, 고해상도 마이크로 디스플레이 패널 기술을 위한 청색 칼라 레지스트를 제조 하기 위해, 이합체 트리페닐메탄(dimeric triphenylmethane) 2종의 염료 설계 및 합성하고, 이들로부터 간단한 상대이온(counterion) 교환반응을 통해 2종의 용매성 이량체 트리페닐메탄(solvent-soluble dimeric triphenylmethane)을 합성했다. 또한, 본 발명에서는 합성된 염료의 구조를 가우스 16 소프트웨어(gaussian 16 software)를 사용한 컴퓨터 계산 (Computational calculation)을 통해 염료의 기하학적, 분광학적 특성을 연구했다. 합성된 염료의 염소처리 (Chlorination)는 모체염료의 추가적인 용해도 상승과 열적 안정성을 부여하지만, 광학적 안정성은 감소시키는 것으로 나타났다. 상대적으로 큰 분자량과 약한 친핵성을 띄는 HFPSI 상대이온(Counterion)의 도입은 분자의 내 열성을 상승시키며, 염료분자 극성의 비편재화를 유도하며, 크고 활성 감소제(quencher)의 접근을 막는 입체적 인 구조는 용해도의 상승과 더불어 양이온성 염료의 광안정성을 향상시켰다. 또한, 본 발명에서는 이러한 구조설계 및 개질 전략을 통해 합성된 DTPM1-Cl-HFPSI 염료의 특성을 분석한 결과, 우수한 열적, 광학적 특성을 나타냈으며, 청색 컬러레지스트를 위한 적합한 색 재료로서 특성화하였다. 또한, 본 발명에서는 최적의 청색 마이크로 디스플레이 색변환층 구현을 위해 적절한 파장의 바이올렛 상용염료 를 사용하여 이온교환(ion exchange) 개질을 통해 보정염료 EV-HFPSI를 합성했다. 결과적으로 합성된 DTPM1-Cl- HFPSI 염료와 EV-HFPSI의 조합을 통해 최적의 청색 컬러레지스트를 배합하였으며, 마이크로디스플레이 기술을 위한 고휘도 청색 컬러 색 변환층를 제작하여 우수한 광학적 특성 및 내구성을 확인하였다."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명을 상세하게 설명한다. 본 발명을 설명함에 있어서 관련된 공지 구성 또는 기능에 대한 상세한 설명은 생략할 수 있다. 본 명세서 및 특허청구범위에 사용된 용어나 단어는 통상적이거나 사전적 의미로 한정되어 해석되지 아니하며, 본 발명의 기 술적 사항에 부합하는 의미와 개념으로 해석되어야 한다. 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 바람직한 실시예이며, 본 발명의 기술적 사상을 모두 대변하는 것이 아니므로, 본 출원 시점에서 이 들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있다. 본 발명은 하기 화학식 1로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료를 제공한다. [화학식 1]"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, 상기 R1 및 R2는 각각 H 또는 Cl임. 또한, 본 발명은 하기 화학식 2로 표시되는 화합물을 포함하는 청색 컬러레지스트 염료를 제공한다. [화학식 2] . 또한, 본 발명은 i) 하기 화학식 3 또는 4로 표시되는 화합물 중 어느 하나의 화합물에 리튬 1,1,2,3,3-헥사플루오로프로판-1,3- 디슬폰이미드(1,1,2,3,3-hexafluoropropane-1,3-disulfonimide; Li-HFPSI) 및 용매를 혼합한 후 교반하는 단계; [화학식 3] ; [화학식 4]"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "ii) 상기 혼합물로부터 유기층을 추출하는 단계; 및 iii) 상기 유기층을 건조시키는 단계;를 포함하는, 상기 화학식 1로 표시되는 화합물을 포함하는 청색 컬러레지 스트 염료의 제조 방법을 제공한다.또한, 본 발명은 i) 에틸 바이올렛(Ethyl Violet; EV)에 리튬 1,1,2,3,3-헥사플루오로프로판-1,3-디슬폰이미드(1,1,2,3,3- hexafluoropropane-1,3-disulfonimide; Li-HFPSI) 및 용매를 혼합한 후 교반하는 단계; ii) 상기 혼합물로부터 유기층을 추출하는 단계; 및 iii) 상기 유기층을 건조시키는 단계;를 포함하는, 상기 화학식 2로 표시되는 화합물을 포함하는 청색 컬러레지 스트 염료의 제조방법을 제공한다. 또한, 본 발명은 상기 화학식 1로 표시되는 화합물을 포함하는 염료, 상기 화학식 2로 표시되는 화합물을 포함하는 염료, 또는 상기 두 염료의 혼합물을 포함하는 청색 컬러레지스트 제형을 제공한다. 상기 청색 컬러레지스트 제형은 상기 화학식 1로 표시되는 화합물을 포함하는 염료 및 상기 화학식 2로 표시되 는 화합물을 포함하는 염료를 1 : 1로 혼합하여 사용하는 것이 바람직하다. 상기 청색 컬러레지스트 제형은 상기 염료 외에 프로필렌 글리콜 메틸 에테르 아세테이트(Propylene glycol methyl ether acetate; PGMEA) 및 아크릴 고분자(acrylic polymer) 바인더를 더 포함하는 것이 바람직하다. 아울러, 본 발명은 상기 본 발명에 따른 청색 컬러레지스트를 코팅하여 제조된 필름을 제공한다. 상기 필름은 상기 본 발명에 따른 청색 컬러레지스트를 기판에 스핀코팅하여 도포한 후, 사전 및 사후 베이킹하 여 제조하는 것이 바람직하다. 이하, 실시예 및 실험예를 통하여 본 발명을 보다 상세히 설명하기로 한다. 이들 실시예 및 실험예는 오로지 본 발명을 보다 구체적으로 설명하기 위한 것으로, 본 발명의 요지에 따라 본 발명의 범위가 이들 실시예 및 실험예에 의해 제한되지 않는다는 것은 당 업계에서 통상의 지식을 가진 자에게 있어서 자명한 것이다. <실시예 1> DTPM 1의 합성 4,4'-비스(디에틸아미노)-벤조페논(4,4′ -bis(diethylamino)-benzophenone)(3.0g, 9.3mmol)(TCI에서 구입), 톨루엔(toluene)(30mL)(Sigma-Aldrich에서 구입), 인(V)옥시클로라이드(phosphorus (V) oxychloride)(4.2mL, 15.2mmol)(Sigma-Aldrich 구입)의 혼합물을 25℃에서 1시간 동안 격렬하게 교반하였다. 이어서, 1,1'-디나프틸 아민(1,1′ - dinaphthylamine)(1.0g, 3.7mmol)(TCI에서 구입)을 혼합물에 첨가하였다. 생성된 용액을 105℃에 서 24시간 동안 교반한 다음, 실온으로 냉각시켰다. 이어서, 침전된 혼합물을 DCM 및 NaCl 염수를 사용하여 추 출하였다. 수집된 유기층을 무수 MgSO4로 건조하고 증발시켰다. 조 염료 혼합물을 80℃에서 3시간 동안 아세톤/ 에틸아세테이트(acetone/ethyl acetate)(1:3, v/v) 2원 용매 중에서 환류시켰다. 최종 고체 생성물을 여과하고 진공 하에 1일 동안 80℃에서 건조시켰다. 염료의 1H 핵 자기 공명(NMR) 스펙트럼은 DMSO(디메틸 설폭사이드)-d6를 용매로 사용하여 500MHz에서 Bruker Avance 500 분광계에서 기록했다. 염료의 원소 분석 측정은 Thermo Scientific Flash EA 1112 원소 분석기를 사용하여 수행했다. 매트릭스 보조 레이저 탈착/이온화 비행 시간(MALDI-TOF) 질량 스펙트럼은 매트릭스로 α- 시아노-4-하이드록시신남산을 사용하는 Voyager-DE STR 생체 분광 측정 워크스테이션에서 수집되었다. 수율: 2.61g, 73.9%; 1H NMR(DMSO d6, ppm): δ = 9.70(1H, s), 8.72(2H, d), 7.28(26H, m), 3.61(16H, d), 1.20(24H, t); 13C NMR (DMSO D6, PPM) : δ = 12.61, 44.95, 126.27, 125.63, 126.27, 126.64, 126.25, 126.64, 126.27, 126.71, 132.79, 132.16, 132.35, 135.52, 135.94, 137.72, 138.69 , 139.51, 154.06,172.71, 174.08; MALDI-TOF MS: m/z 882.57(100%, [M + H]+); 원소 분석: Calcd. C62H69N5Cl2의 경우: C,77.96; H, 7.28; 아니오, 7.33%. 발견: C, 77.81; H, 7.33; N, 7.41. <실시예 2> DTPM 1-Cl의 합성 1구 플라스크에 DTPM 1(0.95g, 1.00mmol), 메탄올(30mL) 및 농축된 HCl(0.20g, 2.0mmol)(Sigma-Aldrich 구입) 의 혼합물을 50℃에서 10분 동안 격렬하게 교반하였다. 그런 다음 플라스크에 농축된 H2O2(0.1 mL, 1.00 mmol) 를 주사기를 사용하여 10분 동안 천천히 주입하였다. 2시간 후, 혼합물을 DCM 및 탈이온수를 사용하여 추출하였 다. 수집된 유기층을 무수 MgSO4로 건조하고 증발시켰다. 최종 고체 생성물을 60℃에서 진공 하에 8시간 동안 건조시켰다. 수율: 0.86g, 83.8%; 1H NMR(DMSO d6, ppm): δ = 9.70(1H, s), 8.72(2H, d), 7.28(26H, m), 3.61(16H, d), 1.20(24H, t); 13C NMR (DMSO D6, PPM) : δ = 12.61, 44.95, 126.27, 125.63, 126.27, 126.64, 126.25, 126.64, 126.27, 126.71, 132.79, 132.16, 132.35, 135.52, 135.94, 137.72, 138.69 , 139.51, 154.06, 172.71, 174.08; MALDI-TOF MS: m/z 882.57(100%, [M + H]+); 원소 분석: Calcd. C62H69N5Cl2의 경우: C,77.96; H, 7.28; 아니오, 7.33%. 발견: C, 77.81; H, 7.33; N, 7.41. <실시예 3> DTPM 1-HFPSI의 합성 1구 플라스크에 DTPM 1(0.5g, 0.52mmol), Li-HFPSI(lithium 1,1,2,3,3-hexafluoropropane-1,3- disulfonimide)(0.34g, 1.09mmol)(TCI에서 구입) 및 메탄올(30mL)의 혼합물을 25℃에서 3시간 동안 격렬하게 교반하였다. 이어서, 혼합물을 DCM 및 탈이온수를 사용하여 추출하였다. 수집된 유기층을 무수 MgSO4로 건조하 고 증발시켰다. 최종 고체 생성물을 60℃에서 진공하에 8시간 동안 건조시켰다. <실시예 4> DTPM 1-Cl-HFPSI의 합성 1구 플라스크에 DTPM 1-Cl(0.5g, 0.49mmol), Li-HFPSI(0.31g, 1.03mmol) 및 메탄올(30mL)의 혼합물을 25℃에서 3시간 동안 격렬하게 교반하였다. 이어서, 혼합물을 DCM 및 탈이온수를 사용하여 추출하였다. 수집된 유기층을 무수 MgSO4로 건조하고 증발시켰다. 최종 고체 생성물을 60℃에서 진공하에 8시간 동안 건조시켰다. <실시예 5> EV-HFPSI의 합성 1구 플라스크에 EV(basic violet 4; ethyl violet)(1g, 1.78mmol)(TCI에서 구입), Li-HFPSI(0.59g, 1.96mmol) 및 메탄올(30mL)의 혼합물을 25℃에서 3시간 동안 격렬하게 교반하였다. 이어서, 혼합물을 DCM 및 탈이온수를 사용하여 추출하였다. 수집된 유기층을 무수 MgSO4로 건조하고 증발시켰다. 최종 고체 생성물을 60℃에서 진공하 에 8시간 동안 건조시켰다. <실시예 6> 블루 레지시트 제형 단일 염료로서 컬러레지스트(Color resist)의 배합은 각 염료와 PGMEA 그리고 PGMEA가 포함되어 있는 아크릴 고 분자(acrylic polymer) 바인더(Mw = 16,000 g/mol)(NDM, Inc.)를 사용하여 PGMEA : Binder : dye = 3.36 : 2.74 : 0.13의 비율로 배합되었다. 이때 염료의 양은 충분한 분광 특성을 얻기 위해 resist에 포함된 PGMEA에 대해 3 wt%가 녹도록 혼합하였다. 최적의 청색 색 특성을 얻기 위해 염료 EV-HFPSI와 DTPM1-Cl-HFPSI의 혼합형 컬러레지스트의 배합은 각 염료의 몰흡광계수를 고려하여 앞서 언급한 조건으로 배합한 EV-HFPSI 레지스트와 PGMEA : Binder : dye = 4 : 0.5 : 0.2 의 비율로 배합한 DTPM1-Cl-HFPSI 레지스트를 1:1의 질량 비로 혼합시킨 최적화된 레지스트(optimized resist)를 조성하였다. DTPM1-Cl-HFPSI 독립 레지스트에서 바인더(binder)는 비율이 증가할 수록 약한 노란색을 띄기 때문에 양이 증가하면 최종 resist에서 청색영역의 투과율에 영향을 줄 수 있으므로 양을 줄여 최적화시켰 다. <실시예 7> 스핀 코팅 필름의 제조 제조된 레지스트를 MIDAS System SPIN-1200D 스핀코터를 이용하여 투명한 유리기판(NTP, Inc.)에 도포하였다. 그런 다음 레지스트 코팅된 유리를 100℃에서 100초 동안 사전 베이킹하고 150℃에서 1시간 동안 사후 베이킹했 습니다. Post-baking 후, 스핀코팅된 유리의 투과율과 좌표값을 측정하였다. <실험예 1> 합성 염료의 설계 마이크로 디스플레이분야 컬러 레지스트용 염료는 적절한 용해도와 높은 열적 광학적 안정성 그리고 우수한 흡 광도를 갖추어야 한다. 트리페닐메탄(Triphenylmethane) 발색단은 일반적으로 높은 색강도를 가지고 있지만, 현 저히 낮은 열 적, 광학적 안정성으로 인해 컬러레지스트용 염료로서 사용이 제한되었다. 따라서 합성된 DTPM1 염료는 이량체화와 HFPSI 음이온을 도입함으로써 열적, 광학적 안정성의 상승과 더불어 공정용매인 PGMEA에 대 하여 용해도를 상승시키는 전략으로 합성되었다. Gaussian 16 pakage를 사용하여 수행된 염료의 구조의 B3lyp/6-31g (d, p) 수준의 밀도함수이론(density functional theory) 계산을 통해 최적화된 분자의 구조와 정 전기전위매핑(Electrostatic potential mapping; ESP mapping)을 도 2에 나타내었다. DTPM1은 중심 아민을 기준으로 127.5°의 각도를 나타낸다. 또한, 좌우 말단 트리페닐메탄을 구성하는 벤젠 골 격과 나프탈렌(naphthalene) 골격 사이 이면각이 약 70°를 나타내고 있다. 이것은 합성된 DTPM1 염료가 입체적 인 분자골격을 특징으로 향상된 용해성을 나타낼 것으로 예측할 수 있다. 하지만 염료의 양이온성 염료의 일반 적 특징인 이온성으로 인해 유기용매인 PGMEA에 대해 낮은 용해도를 나타낼 것으로 예측되었다. 따라서 합성된 DTPM1 염료의 이온성과 극성을 줄이기 위해 약한 배위 음이온(weakly coordinating anion)인 HFPSI를 도입하였 다. 일반적으로 WCA는 대부분의 음이온 종 보다 낮은 친핵성을 가진 것으로 알려져 있으며, 불안정한 양이온의 높은 반응성 또는 친전자성을 안정화시키는 것으로 알려져 있다. HFPSI는 전기음성도가 큰 질소, 산소, 불소가 포함된 6각 고리구조로 imide 질소 원자가 -0.671로 가장 낮은 음전하를 가지고 있다. 따라서 HFPSI의 배위 결 합을 통해 DTPM1 분자의 극성을 비편재화 하여 분자의 이온성을 줄여 합성된 DTPM1-HFPSI의 solubility 향상되 는 효과를 기대하였다. 또한 상대적으로 크기가 작은 Cl- 이온 보다 부피가 큰 HFPSI의 특징으로 인해 분자간 패킹 밀도를 낮춤으로 더욱 향상된 용해도를 나타낼 것으로 예측되었다. 한편, 이량체화(dimerization)를 통해 분자골격의 입체적 변화를 유도하여 용해도를 높인 DTPM1은 용매가 포함 되어 있는 액상 레지스트를 제조함에 있어서 좋은 전략이 될 수 있지만, 분자의 크기와 비표면적이 증가하게 된 다. 그러므로 경화 과정을 통해 용매가 증발되어 필름으로 변함에 따라 염료의 재응집(re-aggregation)이 발생 하여 녹아 있던 염료분자의 응집이 발생할 수 있다. 응집은 투과되는 백색광의 산란을 통해 필름의 투과율 감소 를 야기한다. 이 문제를 해결하기 위해 DTPM1 염료 골격에 큰 크기와 전기음성도를 가진 Cl 원자를 치환한 DTPM1-Cl을 합성하였다. Cl 원자의 도입은 염료 분자간의 응집을 제어하는데 용이할 것으로 기대되었으며, 가시 광선 최대 흡수점의 심색 효과(bathochromic effect)를 통해 700 nm이하의 적색 파장영역의 흡수까지 확장하도 록 설계되었다. 또한 염료의 안정성 및 용해도의 개선을 위해 HFPSI를 도입한 DTPM1-Cl-HFPSI 염료를 합성하였 다. 더 나아가 보다 정확한 청색 블루 변환 층을 제조하기 위해서 500 nm 에서 650 nm 가시부 파장 영역을 강하 게 흡수 하는 상용염료 에틸바이올렛(Ethyl violet; EV)을 보정염료로 선택하였으며, HFPSI 음이온을 도입하여 안정성 및 충분한 용해도를 갖도록 설계했다. <실험예 2> 합성 염료의 분광 특성 DTPM1 시리즈의 UV-Vis 흡수 스펙트럼(absorption spectral) 특성은 메틸렌 클로라이드(methylene chloride) 용매에서 10-5 M 조건으로 측정되었다. 염료의 흡수 스펙트럼은 Scinco Mega-800 자외선-가시광선(UV-Vis) 분광계를 사용하여 측정되었다. 합성된 염료 시리즈의 UV-Vis 흡수 스펙트럼 특성을 도 3에 나타내었으며, 상응하는 데이터는 표 1에 나타내었다. 표 1 합성된 염료의 UV-Vis 흡수 및 용해도 데이터 염료 실험 λmax (nm)εmax (L / mol·cm)Solubility in PGMEA (wt %) DTPM1 621 90,600 0.54 DTPM1-HFPSI 621 103,200 7.3 DTPM1-Cl 634 84,700 1.3 DTPM1-Cl-HFPSI 634 91,800 8.7 EV 590 113,900 0.33 EV-HFPSI 590 143,400 3.5 모체염료 DTPM1은 90,600의 몰흡광계수를 나타내었으며 최대흡광도는 621 nm에 위치하였다. DTPM1-Cl은 84,700 의 몰흡광계수를 나타내었으며 최대흡광도는 634 nm에서 나타났다. 염소원자가 치환됨에 따라 bathochromic effect와 hypochromic effect를 나타냈다. 이와 같은 사실은 b3lyp method, 그리고 6-311g (d, p) basis sets 을 통해 DFT기반 TD-DFT 계산연구를 수행하여 확인했다. 도 4는 양이온 상태의 염료 분자 구조의 전자전이 기여 도가 가장 큰 Frontier orbital과 에너지 준위를 나타내었다. 표 2에 양이온 상태 염료의 TD-DFT 계산결과를 나 타냈다. 표 2 합성된 염료의 TD-DFT 계산된 스펙트럼 특성 염료 TD-DFT λmax (nm)f = oscillator strengthTransition Contribution (%) [EV]1+ 488.09 0.7778 HOMO → LUMO 99.9 [DTPM1]2+ 612.91 0.6278 HOMO-2 → LUMO HOMO-2 → LUMO+1 HOMO-1 → LUMO HOMO → LUMO33.5 2.2 20.0 40.5 [DTPM-Cl]2+ 630.36 0.6011 HOMO-2 → LUMO HOMO-2 → LUMO+1 HOMO-1 → LUMO HOMO → LUMO51.4 2.7 3.4 38.8 [EV]1+는 분자골격의 변형 및 치환기 없이 가장 단순한 구조의 트리페닐메탄( Triphenylmethane) 염료로 계산연 구 결과 LUMO 상태의 반결합성 분자오비탈 영역이 분자 전반에 걸쳐 나타난다. 반면, [DTPM1]2+는 분자의 골격이 다양한 이면각을 이루고 있기 때문에 conjugation system의 교란을 일으키고 HOMO 및 LUMO의 Orbital이 축퇴된 형태로 나타났다. 따라서 도 3에서 확인할 수 있듯, EV 보다 넓고 강도가 낮은 흡수를 나타냈다. 그리고 도 4에 나타낸 TD-DFT 결 과를 통해 [DTPM-Cl]2+는 Cl 원소가 염료분자 골격에 치환되면서 electro donating effect가 있는 Cl 원자 치환 기에 의해 dimeric triphenylmethane 의 전자 밀도가 높아졌고 frontier orbital 의 에너지 준위가 낮아져 LUMO-HOMO 간 에너지 차이가 작아진 것으로 기인하였다. 이들 염료에 WCA counter ion인 HFPSI가 도입된 DTPM1-HFPSI와 DTPM1-Cl-HFPSI는 각각 103,200, 91,800의 몰흡광계수를 나타내었다. 이들 modified 염료는 각 각의 모체염료의 최대흡수파장과 동일한 위치에서 흡광 계수가 높아진 것을 확인할 수 있었다. 이것은 HFPSI의 도입에 의해 모체염료의 질소 양이온자리를 입체적으로 shielding 해주는 효과로 excitation energy의quenching을 야기하는 quencher의 접근을 효율적으로 막아주는 것에 기인하였다. DTPM1-Cl 및 DTPM1-Cl- HFPSI는 주요 흡수 band의 bathochromic effect로 인해 청색 및 녹색을 투과할 것으로 예상되었다. 최적의 청색 을 구현하기 위해 위해 녹색영역을 흡수해줄 보정염료로서 단일 Triphenylmethane계 염료 EV를 선택하였으며, HFPSI를 도입한 EV-HFPSI를 합성했다. EV 시리즈의 UV-Vis 흡수 스펙트럼 특성을 도 3에, 상응하는 데이터를 표 1에 나타내었다. 모체염료 EV는 590 nm에서 113,900의 몰흡광계수를 나타내었다. 또한 EV-HFPSI는 같은 위치 에서 143,400의 몰흡광계수를 나타내었다. 전반적으로 가시광선 영역에서 주요 흡수 영역을 제외한 나머지 영역 에서 매우 낮은 흡광도를 보여주었다. 이것은 EV의 구조가 conjugation system의 교란을 야기하여 불필요한 흡 수를 유도하는 치환기 또는 구조적 변화가 없는 가장 단순한 형태이기 때문이었다. <실험예 3> 합성 염료의 용해도 공정용 용매인 PGMEA에 대한 준비된 염료의 용해도는 표 1에 나타내었다. 용해도 조사는 우선, 준비된 염료 계 열을 다른 농도로 PGMEA에 용해시키고, 준비된 용액을 초음파 세척기에서 10분 동안 초음파 처리한 다음, 초음 파 처리된 용액을 25℃에서 24시간 동안 방치한 후, 침전을 확인하여 염료의 용해도를 결정하였다. 일반적으로 염료형 색 재료를 사용한 컬러레지스트의 제조에 있어서 가장 중요한 요소 중 하나는 공정용매에 대 한 염료의 용해도이다. 염료가 고휘도 색 변환층(color conversion layer)용 착색제로서 사용되려면 산업용매에 대해서 안료보다 높은 용해도를 가져야 한다. 일반적인 컬러레지스트 제조용 용매는 PGMEA, 시클로헥사논"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "(Cyclohexanone) 등으로 요약된다. 그러나 상용 양이온성 트리페닐메탄(Triphenylmethane)계 염료는 이온성이 크기 때문에 쉽게 용해되지 않는 것으로 보고되었다. HFPSI가 도입되지 않은 염료 EV, DTPM1, 그리고 DTPM-Cl의 용해도는 각각 0.33, 0.54, 및 1.3으로 측정되었다. DTPM1은 single triphenylmethane인 EV보다 구조적으로 확장 및 꼬여있는 구조를 가지고 있기 때문에 향상된 용 해도를 갖지만 여전히 낮은 수준의 용해도를 보였다. DTPM1-Cl은 Chlorine이 일부 치환됨에 따라 모체염료보다 약간 상승된 용해도를 보였다. 이와 대조적으로 counter 이온이 도입된 EV-HFPSI, DTPM1-HFPSI 및 DTPM1-Cl- HFPSI의 용해도는 각각 3.5, 7.3 및 8.7으로 향상됨을 확인했다. 이것은 카운터 음이온의 배위에 의해 염료의 양전하가 분자 전체에 강하게 비편재화되기 때문이다. 즉, HFPSI의 도입으로 인해 양이온 염료들의 이온특성이 감소함을 뜻하는 것이다. 또한, HFPSI의 6각 ring구조의 bulky한 특 성으로 인해 입체적 효과로 인해 용액상태에서 응집을 억제했기 때문이다. 결과적으로 트리페닐메탄 (Triphenylmethane) 염료의 용해도는 이량체 시스템(dimeric system)으로의 확장과 염소화(chlorination)를 통 해 약하게 상승시킬 수 있었으며, 그리고 HFPSI 음이온의 도입을 통해 염료 분자의 양이온성을 비편재화를 통해 공정용 용매에 대한 강한 용해도 상승을 유도할 수 있었다. <실험예 4> 합성 염료의 안정성 염료 분자가 다양한 첨단 전기전자분야에서 사용되려면 제작 공정에서 노출되는 열 및 광에 대한 안정성이 보장 되어야 한다. 따라서 분자간 상호작용을 통해 조밀한 응집체를 형성하여 높은 열적 광학적 안정성을 가져야 한 다. 도 5는 준비된 염료들의 post-baking 조건을 모방하여 측정한 등온 그래프(iso thermal graph)와 표 3은 Weight loss 및 Td를 나타내었다. 염료의 열중량 분석(TGA)은 TA Instruments 열중량 분석기(Q500)를 사용하여 10℃/min의 가열 속도로 질소 분위 기에서 수행되었다. 염료의 광 안정성은 Otsuka Electronics 150 W Xe 램프(QE-1100) 및 UV 경화 시스템을 사 용하여 평가하였다. 구체적으로, 염료의 열적 안정성은 N2 분위기에서 TGA 측정을 수행하여 조사되었다. 측정온도는 10℃/min의 속 도로 30℃에서 150℃로 증가시켰다. 제조된 염료를 150℃로 가열하고 이 온도에서 1시간 동안 유지하여 색 변환 층 제조 열 조건을 모사하였다. 염료는 분해 온도를 결정하기 위해 최종적으로 10℃/min의 속도로 300℃로 가열 되었다. 각 염료 용액에 150 W Xe Lamp를 조사하여 염료의 광안정성을 조사하였다. 염료 용액의 초기 농도는 DCM에서 1 × 10-5 M으로 설정되었다. 용액의 초기 흡광도에 대한 최종 흡광도의 상대비를 구하고, 최종 상대 흡광도를 초기 상대 흡광도 값 1과 비교하여 염료의 내광성 변화를 확인하였다. 표 3 합성된 염료의 흡수 최대 변화, 광분해 속도 상수, 중량 손실 및 열분해 온도 염료 Diff. λmax (Before → After)K (1 × 10-4/min)Weight loss (%) at 150 ℃Td DTPM1 -1 (621 → 620)-2.397 4.56 210.9 DTPM1-HFPSI 0 (621→ 621)-0.971 3.02 180.6 DTPM1-Cl -2 (634 → 632)-2.178 3.11 180.2 DTPM1-Cl-HFPSI -1 (634 → 633)-1.552 2.2 177.2 EV -3 (590 → 587)-5.449 2.06 230.1 EV-HFPSI 0 (590 → 590)-1.354 2.63 203.3 HFPSI가 치환되지 않은 염료 DTPM1, 그리고 DTPM1-Cl은 각각 1시간 동안 4.56%, 3.11%의 질량 감소량을 나타냈 다. 전기음성도가 높은 Cl 원자의 치환으로 인해 분자간 인력이 상승했기 때문으로 보인다. EV는 2.2 %의 질량 감소로 상대적으로 낮은 질량감소를 보여주었는데, 이것은 상용염료에 안정제로 첨가되어있는 ZnCl2로 인해 내열 성이 강화되었기 때문이다. 또한, isothermal 상태 이후 나타나는 열분해 온도는 각각 210.9, 180.6, 그리고 230.1℃로 나타났다. 이것은 충분한 고온환경에서는 분자진동이 활발해지므로 크기가 큰 Cl 원자의 도입은 분자 사이 간격을 다소 증가시키는 것으로 생각될 수 있으며, 그로 인해 Td 온도는 감소하는 것으로 나타났다. HFPSI 가 치환된 염료 DTPM1-HFPSI, DTPM1-Cl-HFPSI, 그리고 EV-HFPSI는 각각 1시간 동안 3.02%, 2.2%, 그리고 2.63% 의 질량 감소량을 나타냈다. 합성된 두 dimeric system 염료는 더 좋은 내열 특성을 나타냈다. 이것은 Cl-이온 보다 HFPSI 음이온이 더 큰 분자량을 갖고 있기 때문이다. EV-HFPSI는 음이온 치환과정에서 정제를 통해 안정제 가 제거되고, EV분자 격자 사이 큰 부피를 가진 HFPSI가 도입되면서 낮은 열 안정성을 띄게 된다. 또한, DTPM1- HFPSI, DTPM1-Cl-HFPSI 그리고 EV-HFPSI는 Td 온도는 감소하였다. HFPSI의 도입으로 인해 분자 사이 간격이 증 가했기 때문이다. 도 6은 준비된 염료들의 용액 상태에서 Xe Lamp 광 조사시간에 따른 상대흡광도를 나타냈다. 준비된 염료들은 MC 용매에 용해시켜 다크 룸에서 광조사를 했다. 일반적으로 유기물 기반 색 재료는 분자 간의 상호작용이 강할수록 강한 광안정성을 나타낸다. 트리페닐메탄 (Triphenylmethane) 분자는 양이온성을 띄기 때문에 광조사에 의한 광화학반응으로 생성되는 Quencher에 의해 쉽게 분해되는 경향을 가진다. HFPSI가 치환되지 않은 염료 DTPM1, DTPM1-Cl 그리고 EV는 각각 20 시간 동안 -0.25, -0.23, 그리고 -0.48 의 상대 흡광도 감소를 나타냈다. 반면, HFPSI가 치환된 염료 DTPM1-HFPSI, DTPM1-Cl-HFPSI, 그리고 EV-HFPSI는 각각 같은 시간 동안 -0.11, -0.17, 그리고 -0.15의 상대흡광도 감소를 나 타냈다. 이것은 Cl 음이온보다 크기가 큰 HFPSI음이온이 효과적으로 트리페닐메탄(Triphenylmethane) 염료의 양 이온 site를 shielding 해 주는 것을 의미하며, HFPSI 구조에서 전기음성도가 높은 F 원자의 존재는 전자가 풍 부한 Quencher의 접근을 차단한다. 따라서 양이온계 염료의 내열, 내광성 향상 측면에서 간단한 치환 반응을 통한 HFPSI와 같은 counterion 교환반 응은 매력적인 요소가 있다. 그러나, 스핀 코팅된 색 변환층(color conversion layer)의 실제 열 및 광안정성은 염료 분자의 고유한 열 및 광안정성 뿐만 아니라 산업용 용매 및 바인더와의 호환성에 영향을 받기 때문에 뒷부 분에 논의되는 색차 값과 함께 논의 되어야 한다. <실험예 5> 스핀 코팅된 필름의 스펙트럼 및 색 특성 기본적으로 고품위 컬러 필름 형성을 위해서는 제조되는 컬러레지스트의 배합이 중요하다. 이때 염료는 용매에 대한 충분한 용해도를 갖추어야 하며, 각 요소간의 최적화된 배합비가 중요하다. 따라서 <실시예 6>과 같이 컬 러레지스트를 배합하였다. 합성된 DTPM1로 제작된 컬러레지스트는 낮은 용해도로 인해 DTPM1 염료 입자들이 분산된 상태에 가까웠다. 따라 서, 제작된 DTPM1 필름은 청색 필름으로서 불충분한 광 투과 특성을 나타냈다. 왜냐하면 제작과정에 포함되는 여과과정에서 대부분의 DTPM1 입자들은 여과되기 때문이다. 도 7 및 표 4에서 합성된 염료로 제작된 필름의 UV-VisTransmission spectral 특성을 나타내었다. 스핀 코팅된 필름의 투과 스펙트럼은 Scinco Mega-800 자외선-가시광선(UV-Vis) 분광계를 사용하여 측정되었다. 스핀 코팅된 필름의 열중량 분석(TGA)은 TA Instruments 열중량 분석기(Q500)를 사용하여 10℃/min의 가열 속도로 질소 분위 기에서 수행되었다. 표 4 합성된 염료의 흡수 최대 변화, 광분해 속도 상수, 중량 손실 및 열분해 온도 필름 Tmax (%)λmax (nm)Tmini (%)λmini (nm) DTPM1 99.2 460 82.6 632 DTPM1-HFPSI 70.1 440 5.2 632 DTPM1-Cl 77.3 440 4.1 643 DTPM1-Cl-HFPSI 85.7 440 6.2 643 EV 99 427 77 603 EV-HFPSI 97.7 427 0.1 603 Optimized 87.7 440 1.4 603 합성된 DTPM1-HFPSI로 제작된 필름은 향상된 용해도 및 광학 특성으로 인해 적합한 투과 특성을 나타냈지만, 청 색 투과영역 440 nm에서 70.1 %의 낮은 광 투과율을 나타냈다. DTPM1-Cl과 DTPM1-Cl-HFPSI 염료로 제작된 필름 은 각각 440 nm에서 77.3% 그리고 85.7%의 투과율을 나타냈다. 상대적으로 DTPM1-HFPSI 필름과 비교하여 두 필 름은 염료 기반 컬러필름에서 볼 수 있는 sharp한 투과 그래프를 보여주었다. 상용염료 EV로 제작된 resist 낮 은 용해도로 인해 침전된 형태를 나타냈다. 따라서 제작된 필름 역시 불충분한 청색 광 투과 특성을 나타냈다. 합성된 EV-HFPSI로 제작된 필름은 향상된 용해도로 인해 강한 발색력과 427 nm에서 97.7%의 매우 높은 투과율을 보여주었으며, 구조적으로 가장 단순한 구조이기 때문에 conjugation system의 변형으로 발생할 수 있는 투과 영역의 축소 없이 약 400 nm에서 460 nm 파장의 넓은 영역에서 매우 높은 투과율과 휘도를 보여주었다. 하지만 600 nm 이상에서 적색 빛을 투과하기 때문에 청색으로서 색 순도가 떨어졌다. 제작된 모든 필름의 color chromaticity diagram을 도 8에 나타냈다. 스핀코팅 필름의 색좌표는 Scinco colormate color spectrophotometer를 사용하여 CIE L*a*b* 모드에서 측정하였다. 불충분한 용해도 때문에 불충분한 광 투과 특성을 나타낸 DTPM1 그리고 EV 필름의 좌표는 각각 (-7.52,-1.55), 그리고(-4.39, -9.83)으로 백색광좌표 (a*,b* = 0, 0)에 가깝게 수렴하는 값을 나타냈다. 불충분한 청색 투과율 을 나타낸 DTPM1-HFPSI 필름의 좌표는 Cyan과 Blue 중간의 값인 (-16.78, -37.42)을 나타낸다. 용액상태 흡수 도를 고려할 때 블루에 적합한 것으로 나타났지만, 필름상태 투과도를 고려할 때 550 nm 에서 600 nm 영역의 투 과율이 감소 하면서 Cyan에 가깝도록 좌표가 이동했다. 이러한 낮은 투과율과 낮은 휘도 값을 고려해볼 때 불필 요한 흡수를 뜻하며 입자의 aggreation에 의한 투과광의 산란 또는 광에너지손실, 또는 DTPM1 분자가 입체적 특 성으로 인해 발생하는 conjugation system의 축퇴 인해 발생하는 흡수로 추측해 볼 수 있다. 용액상태에서 Sharp한 흡수 및 투과율 나타낸 DTPM1-Cl 그리고 DTPM1-Cl-HFPSI 필름은 각각 (-14.93, -41.66) 그리고 (- 19.41, -47.99)을 나타낸다. HFPSI 의 도입 전후에 염료의 흡수 관점에서 최대 흡수 파장의 변화 없이 약 430 nm 부터 650 nm의 흡광도의 상승을 일으키므로 더욱 심도 있는 좌표로 이동하였다. 마찬가지로 EV-HFPSI 필름의 색 좌표는 (32.70, -72.04)를 나타내며 용해도의 상승과 더불어 청색에 가까운 deep한 보라색을 나타내었다. 따 라서 Counter ion의 도입은 더 deep한 색을 나타낼 수 있게 할 수 있었다. 또한 Cl 원자의 도입은 분자간 응집 을 억제를 일으켜 향상된 휘도 값을 나타내었다. 그러므로, 최상의 블루 필름을 제작하기 위해서 전술한 독립 염료의 흡광도, 내열, 내광성, 용해도, 그리고 독 립필름의 색 특성을 모두 고려하여 EV-HFPSI와 DTPM1-Cl-HFPSI의 조합을 통해 새로운 blue resist를 배합하였다. 두 염료의 구성비는 몰흡광계수를 고려하여 조절하였으며, 바인더의 양을 추가로 조절하여 두 독립resist의 혼화성을 조절하고 최적화 했다. 제작된 필름은 440 nm를 최대 투과파장으로 하며 87.7%의 투과율을 나타냈다. 독립적으로 제작된 EV-HFPSI 필름과 비교하여 650에서 700 nm이하의 가시광선 장파장 영역 영역을 흡 수하게 되었다. 도 8에서와 같이 보라색과 파란색의 경계에 위치한 EV-HFPSI의 좌표를 DTPM1-Cl-HFPSI와의 조합 을 통해 blue 좌표로 matching시킬 수 있었으며 -60 이하의 b* 좌표를 통해 deep한 blue 색상을 얻을 수 있었다. 결과적으로, 두 독립 레지스트의 혼합에도 불구하고 최적화된 필름은 높은 투과율과 청색 영역을 제외한 넓은 가시부 영역을 흡수하여 휘도 및 색 순도 측면에서 우수한 특성을 나타내었다. <실험예 6> 스핀 코팅된 필름의 안정성 색 변환층을 이용한 디스플레이 공정은 열 그리고 광에 노출되는 일련의 제작공정을 거쳐 제작된다. 따라서 준 비된 color conversion 블루 필름의 열과 광 노출에 대한 안정성을 실험하였다. 스핀 코팅된 필름의 열중량 분석(TGA)은 TA Instruments 열중량 분석기(Q500)를 사용하여 10℃/min의 가열 속도 로 질소 분위기에서 수행되었다. 스핀 코팅된 필름의 광 안정성은 Otsuka Electronics 150 W Xe 램프(QE-1100) 및 UV 경화 시스템을 사용하여 평가하였다. 스핀 코팅된 필름의 색도 특성은 Scinco color spectrophotometer를 이용하여 분석하였다. 구체적으로, 스핀코팅된 필름의 열적 안정성을 확인하기 위해 스핀코팅된 색변환층을 150℃로 가열하고 N2 분위 기에서 1시간 동안 유지하였다. CIE L*a*b* 모드에서 Scinco colormate color spectrophotometer를 사용하여 가열 전후의 열 색차 값(ΔEab,thermal)을 측정했다. 도 9 및 표 5에서 제작된 필름과 150℃ 1시간 동안 추가로 열 환경에 노출된 필름의 투과율 그래프와 색도 도표 (chromaticity diagram)를 나타내었다. 도 9의 (a), (c), (e)는 각각 EV, DTPM1, DTPM1-Cl 염료로 제작된 필름의 투과율 변화를 나타낸다. EV와 DTPM1 은 낮은 용해도 특성으로 인해 대부분의 염료 입자가 필터링 되어 청색 빛이 감도는 투명한 필름으로 제작되었 다. 이 두 필름 열적 색차 (ΔEab)는 각각 6.47, 7.52를 나타냈다. 이들 염료의 열 특성을 고려해 볼 때 제작된 필름은 염료의 질량비율이 낮기 때문에 열적 색차를 통한 열 안정성은 과소평가된 것으로 생각된다. DTPM1-Cl 필름은 3.97을 나타냈다. 염료의 열 특성 분석 실험에 확인했듯이 상대적으로 낮은 열 환경에서 Cl의 도입은 열 안정성을 상승시키기 때문이다. 도 9의 (b), (d), (f)는 각각 EV-HFPSI, DTPM1-HFPSI, DTPM1-Cl-HFPSI 염료로 제작된 필름의 투과율 변화를 나타낸다. EV-HFPSI, DTPM1-HFPSI 필름의 열적 색차 (ΔEab)는 각각 5.70, 그리고 5.02로 나타났다. 이들 염료의 열 특성 결과와는 반대되는 결과이다. 표 5"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "DTPM1-HFPSI는 Weight loss 실험에서 3.02로 EV-HFPSI 보다 더 높은 질량감소를 보였다. 하지만 필름상태에서 는 용매가 증발되면서 부피와 표면적이 큰 DTPM1-HFPSI 분자가 응집하여 큰 입자를 형성하는 것으로 생각된다. 입자의 응집으로 인해 상대적으로 열적 색차 변화가 더 낮은 것으로 측정된 것으로 유추된다. 실제로 DTPM1- HFPSI 필름은 다른 필름과 비교하여 입자가 응집할수록 나타나는 낮은 투과율과 휘도 저하를 보여주었다. DTPM1-Cl-HFPSI필름은 DTPM1-Cl의 특징과 더불어 안정성을 부여하는 HFPSI의 도입으로 인해 3.01의 열적 색차를 나타냈다. 마지막으로 최적의 분광 및 색 특성을 위해 제작된 optimized 필름의 색차 값은 3.53으로 필름을 구 성하는 두 독립 필름의 중간 값 정도의 변형을 나타냈다. 도 10 및 표 6에서 10분 간격으로 1시간 동안 UV 환경에 노출된 필름의 투과율 그래프와 chromaticity diagram 을 나타내었다.표 6"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 6, "content": "도 10의 (a), (c), (e)는 각각 EV, DTPM1, DTPM1-Cl 염료로 제작된 필름의 투과율 변화를 나타낸다. EV와 DTPM1 필름은 청색 빛이 감도는 투명한 필름에 가깝기 때문에 투과율의 상승과 광학적 색차 값이 과소평가된 것으로 여겨지지만, 각각 투과율 상승은 9.3, 4.0, 그리고 광학적 색차 값은 3.97, 2.29로 분자 크기가 더 큰 DTPM1 필름의 변화가 더 작은 경향을 확인할 수 있었다. 특히, EV 필름 첫 10분 UV광 조사에 의해 발생하는 투 과도의 상승폭이 다른 염료에 비해 큰 편이었다. 이것은 필름 표면에 가깝게 분포하는 EV염료가 UV 조사에 의해 쉽게 분해되는 것으로 생각할 수 있다. DTPM1과 DTPM1-Cl 필름은 각각 투과율 상승은 4.0, 10.9, 그리고 광학적 색차 값은 2.29, 7.65로 Cl 원자의 도입은 낮은 광 안정성을 보여주었다. 이것은 Cl 원자의 큰 전기음성도로 인 해서 분자의 양이온 charge를 더욱 localized(편재화)하게 하는 효과를 통해 광화학반응으로 생성된 quencher의 접근을 용이하게 하는 것으로 생각된다. 또한 작은 크기의 Cl- 카운터 이온은 quencher의 접근을 억제하지 못하 기 때문에 광학적 분해반응을 가속화한다. 도 10의 (b), (d), (f)는 각각 EV-HFPSI, DTPM1-HFPSI, DTPM1-Cl- HFPSI 염료로 제작된 필름의 투과율 변화를 보여준다. EV-HFPSI와 DTPM1-HFPSI 필름은 UV 광 조사에 의한 투과 율 변화가 0.3으로 매우 낮은 변화를 보여주었으며, 상응하는 광학적 색차는 2.29 및 3.01로 우수한 광 안정성 을 나타냈다. DTPM1-Cl-HFPSI 필름은 투과율 상승은 5.2 그리고 광학적 색차 값은 6.02로 나타났다. 광학적으로 열등한 특성을 나타내던 DTPM1-Cl 염료에 HFPSI의 도입으로 인해 정전기적으로 분자의 편재화된 극성 분포를 억 제하고 입체적으로 큰 부피로 인해 quencher의 접근을 효과적으로 shielding하여 광학적 안정성이 향상되는 결 과를 얻을 수 있었다. 결과적으로 양이온성 트리페닐메탄 염료 분자의 이량체화(dimerization)는 열적, 광학적 안정성을 상승시킬 수 있으며, 전기음성도가 큰 Cl 원소의 치환은 염료의 내열성은 상승시키지만 광학적 안정성은 다소 감소되는 효과 를 나타냈다. 또한, 약한 배위 음이온(weakly coordinating anion)인 HFPSI와 같은 counter ion의 도입은 양이 온성 트리페닐메탄 염료의 내열 및 내광성을 손쉽게 향상시킬 수 있었다. <실험예 7> 스핀 코팅된 필름의 두께조절 및 표면특성 OLEDoS 기반 마이크로 디스플레이 패널의 연구 및 개발의 주요 방향성은 초고해상도, 고휘도 그리고 소형화로"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "요약할 수 있다. 특히, 마이크로 디스플레이를 사용하는 AR/VR 제품은 인체에 착용하는 형태이므로 지금의 스마트폰과 같이 mainstream 위치의 전자제품 반열에 오르려면 마이크로 디스플레이의 소형화가 필수적이다. 그러므 로 마이크로 디스플레이의 수 많은 구성요소 중 본 연구에서는 색 변환층의 두께를 줄여 박형화에 적합할 수 있 는지 실험해 보았다. 스핀 코팅된 필름의 표면 특성은 HITACHI SU8000을 사용하여 전계방출 주사전자현미경(FE-SEM)으로 조사하였다. 스핀 코팅된 필름의 표면 형태, 거칠기 및 원자간력현미경(AFM) 이미지를 사용하여 비접촉 방식으로 수집했다."}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 8, "content": "도 11에 회전속도 변화에 따른 두께 별 optimized film의 투과율을 나타냈으며, 표 7은 해당 데이터를 요약하여 나타냈다. 표 7"}
{"patent_id": "10-2022-0035107", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "FE-SEM으로 측정한 결과, 300, 400, 그리고 500 rpm의 회전속도로 제작된 optimized 필름의 두께는 각각 1.82, 1.60, 그리고 1.31 μm로 측정됐다. 두께가 얇아짐에 따라서 최대 투과율은 91.9%까지 상승할 수 있으며, 최소 투과율은 3.0으로 상승한 것을 확인할 수 있었다. 최대투과율의 상승치는 4.2%이며, 최소 투과율의 상승치는 1.6%였다. 최대투과파장은 440 nm에서 434 nm로 6 nm 이동하였다. Optimized resist에서 DTPM1-Cl-HFPSI의 용 해도가 높고 loading 양이 많기 때문에 coating 할때 이탈하는 양이 많을 것으로 추측된다. 따라서 RPM이 증가 할수록 최대 투과 파장의 blue shift와 650 nm 위치의 투과율이 상승하는 것을 확인할 수 있었다. 도 11은 두께를 조절한 optimized 필름의 표면의 FE-SEM이미지와 AFM 이미지를 나타낸다. 일반적으로 입자크기 가 클수록 투과광의 산란 및 난반사와 표면 조도의 상승으로 인해 광에너지 손실이 발생한다. 따라서 합성된 염 료로 제작된 color resist로 제작된 필름의 표면 특성을 알아보고자 하였다. AFM을 통한 각 필름의 표면의 rms 값은 1.161nm, 0.7865 nm, 그리고 0.4859 nm 으로 두께가 얇아짐에 따라서 표면조도가 감소하는 것을 확인할 수 있었다. 그리고 FE-SEM 이미지에서도 마찬가지로 두께가 얇아질수록 표면이 더 매끄러운 형상을 띄는 것을 확인 할 수 있었다. 이것은 회전속도 증가로 인해 평평한 면을 이루기 때문이며, 바인더와 염료의 좋은 혼화성으로 인해 baking과정에서 용매가 open system로 확산할 때 발생할 수 있는 필름 구성요소 사이 segregation 없이 염 료 입자가 조밀하게 필름을 형성하는 것으로 볼 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2022-0035107", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 염료의 합성 경로를 보여주는 그림이다. 도 2는 양이온 염료와 반대 음이온의 기하학적으로 최적화된 분자 구조와 정전기적 표면 전위를 보여주는 그림 이다. 도 3은 합성된 염료의 UV-Vis 흡수 스펙트럼을 나타낸 그래프로서, DCM(1 × 10-5 M)에서의 (a) DTPM1 시리즈 및 (b) EV 시리즈를 나타낸 그래프이다. 도 4는 [EV]+, [DTPM1]2+ 및 [DTPM1-Cl]2+의 분자 궤도를 나타낸 그림으로서, TDDFT 계산은 B3LYP/6-311G(d, p) 수준에서 수행된 그림이다. 도 5는 합성된 염료의 TGA 분석 결과를 나타낸 그래프이다. 도 6은 합성된 염료의 광안정성을 나타낸 그래프로서, (a)-(f) DCM의 독립 용액의 상대 흡광도, (g) 조사 시간 에 따른 상대 흡광를 나타낸 그래프이다. 도 7은 스핀 코팅된 필름의 UV-Vis 투과 스펙트럼을 나타낸 그래프로서, (a) DTPM1 시리즈, (b) EV 시리즈 및 (c) 최적화를 나타낸 그래프이다. 도 8은 스핀 코팅된 필름의 CIE 1931 색도 도표를 나타낸 그림이다. 도 9는 스핀 코팅된 필름의 열 안정성을 보여주는 그래프로서, 후(After) 스펙트럼은 150℃에서 1시간 동안 추 가로 베이크된 것이며, (a) EV, (b) EV-HFPSI, (C) DTPM1, (d) DTPM1-HFPSI, (e) DTPM1-Cl-HFPSI 및 (f) 최적 화된 필름을 나타낸 그래프이다. 도 10은 스핀 코팅된 필름의 광안정성을 보여주는 그래프로서, UV 조사에 의한 투과율 변화 추적은 10분 간격으 로 수행되었으며, (a) EV, (b) EV-HFPSI, (C) DTPM1, (d) DTPM1-HFPSI, (e) DTPM1-Cl-HFPSI 및 (f) 최적화된필름을 나타낸 그래프이다. 도 11은 회전 속도에 따른 최적화된 필름의 AFM, FE-SEM 이미지 및 UV-Vis 투과 스펙트럼을 보여주는 그림으로 서, (a) 300 rpm, (b) 400 rpm, (C) 500 rpm을 나타낸 그림이다."}
