{"patent_id": "10-2023-0037895", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0062890", "출원번호": "10-2023-0037895", "발명의 명칭": "산업용 사물 인터넷 서버 및 보안 설정 방법", "출원인": "국민대학교산학협력단", "발명자": "라이한 빈 모피둘"}}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "산업용 사물 인터넷(IIoT: Industrial Internet of Things) 시스템에 대한 노드 레드(Node-RED)의 적용에따라, 와이어로 연결되는 각 노드가 정의되면, 노드 간 데이터 전달을 중계하는 메시지 브로커를 설정하는 설정부; 및상기 메시지 브로커를 이용한 노드 간 데이터 전송 시 암호화 전송을 지원하기 위한 보안 정보를 생성하는 생성부를 포함하는 것을 특징으로 하는 산업용 사물 인터넷 서버."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 산업용 사물 인터넷 시스템은,스마트 데이터 수집 장치(SDAD: Smart Data Acquisition Device)가 수집한 데이터를, 에지(Edge) 단에서 획득하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)을 포함하며,상기 노드는,상기 에지 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 스마트 데이터 수집 장치, 및 서버 노드인상기 산업용 사물 인터넷 서버를 포함하도록 정의되는 것을 특징으로 하는 산업용 사물 인터넷 서버."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 메시지 브로커는,상기 산업용 사물 인터넷 시스템에서, 로컬 라우터를 통해 연결되는 각 노드에 대해 MQTT(Message QueuingTelemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 포함하는 것을 특징으로 하는 산업용 사물 인터넷 서버."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 산업용 사물 인터넷 시스템은,상기 에지 산업용 사물 인터넷 시스템(Edge IIoT system)과 데이터를 교환하는 중앙 집중식 산업용 사물 인터넷시스템(Centralized IIoT system)을 포함하며,상기 노드는,상기 중앙 집중식 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 에지 산업용 사물 인터넷 시스템, 및서버 노드인 상기 산업용 사물 인터넷 서버를 포함하는 것을 특징으로 하는 산업용 사물 인터넷 서버."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 메시지 브로커는,상기 중앙 집중식 사물 인터넷 시스템에서, 글로벌 인터넷을 통해 연결되는 각 노드에 대해 MQTT(MessageQueuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 포함하는것을 특징으로 하는 산업용 사물 인터넷 서버.공개특허 10-2024-0062890-3-청구항 6 제 1 항에 있어서,상기 생성부는,TLS(Transport Layer Security) 지원과 관련하여, CA(Certificate Authority) 키와 CA 인증서가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키를 상기 CA 인증 키로 암호화하여 서명으로 등록한 서버 인증서, 및 클라이언트 노드를 위해 생성되는 클라이언트 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 클라이언트 인증서를 각각 생성하는 것을 특징으로 하는 산업용 사물 인터넷 서버."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 생성부는,상기 노드 레드(Node-RED)의 적용을 위한 CA(Certificate Authority) 키와 CA 인증서가 생성되면, 서버 노드를위해 생성되는 서버 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 서버 인증서를 생성하며, 서버 노드인상기 산업용 사물 인터넷 서버에는 상기 CA 인증서를 루트(Root) CA 인증서로 수동 설치하는 것을 특징으로 하는 산업용 사물 인터넷 서버."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "산업용 사물 인터넷 서버에서 수행되는 보안 설정 방법은, 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 시스템에 대한 노드 레드(Node-RED)의 적용에따라, 와이어로 연결되는 각 노드가 정의되면, 노드 간 데이터 전달을 중계하는 메시지 브로커를 설정하는 설정단계; 및상기 메시지 브로커를 이용한 노드 간 데이터 전송 시 암호화 전송을 지원하기 위한 보안 정보를 생성하는 생성단계를 포함하는 것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 산업용 사물 인터넷 시스템은,스마트 데이터 수집 장치(SDAD: Smart Data Acquisition Device)가 수집한 데이터를, 에지(Edge) 단에서 획득하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)을 포함하며,상기 노드는,상기 에지 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 스마트 데이터 수집 장치, 및 서버 노드인상기 산업용 사물 인터넷 서버를 포함하도록 정의되는 것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 메시지 브로커는,상기 산업용 사물 인터넷 시스템에서, 로컬 라우터를 통해 연결되는 각 노드에 대해 MQTT(Message QueuingTelemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 포함하는 것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 산업용 사물 인터넷 시스템은,공개특허 10-2024-0062890-4-상기 에지 산업용 사물 인터넷 시스템(Edge IIoT system)과 데이터를 교환하는 중앙 집중식 산업용 사물 인터넷시스템(Centralized IIoT system)을 포함하며,상기 노드는,상기 중앙 집중식 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 에지 산업용 사물 인터넷 시스템, 및서버 노드인 상기 산업용 사물 인터넷 서버를 포함하는 것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 메시지 브로커는,상기 중앙 집중식 사물 인터넷 시스템에서, 글로벌 인터넷을 통해 연결되는 각 노드에 대해 MQTT(MessageQueuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 포함하는것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 8 항에 있어서,상기 생성단계는,TLS(Transport Layer Security) 지원과 관련하여, CA(Certificate Authority) 키와 CA 인증서가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키를 상기 CA 인증 키로 암호화하여 서명으로 등록한 서버 인증서, 및 클라이언트 노드를 위해 생성되는 클라이언트 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 클라이언트 인증서를 각각 생성하는 것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 8 항에 있어서,상기 생성단계는,상기 노드 레드(Node-RED)의 적용을 위한 CA(Certificate Authority) 키와 CA 인증서가 생성되면, 서버 노드를위해 생성되는 서버 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 서버 인증서를 생성하며, 서버 노드인상기 산업용 사물 인터넷 서버에는 상기 CA 인증서를 루트(Root) CA 인증서로 수동 설치하는 것을 특징으로 하는 보안 설정 방법."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 8 항 내지 제 14 항 중 어느 한 항의 방법을 실행시키기 위한 프로그램을 기록한 컴퓨터 판독 가능기록매체."}
{"patent_id": "10-2023-0037895", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "하드웨어와 결합되어, 제 8 항 내지 제 14 항 중 어느 한 항의 방법을 실행시키기 위해 매체에 저장된 컴퓨터프로그램."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 환경에서 처리되는 데이터 플로우를 모니 터링 및 관리함에 있어서 보안을 설정하기 위한 방안에 관한 것이다."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 환경에서 처리되는 데이터 플로우를 모 니터링 및 관리함에 있어서 보안을 설정하기 위한 방안에 관한 것이다."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 사물 인터넷(IoT: Internet of Things) 망으로 진화하고 있다.이러한, 사물 인터넷 환경에서는, 기존의 IT(information technology)기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 및 첨단의료서비스 등의 분야에 응용될 수 있는 것이다. 최근에는, 이러한 사물 인터넷보다 하위 범주의 개념으로서, 인더스트리 4.0 기술의 기본 요소가 되는 산업용 사물 인터넷(IIoT: Industrial Internet of Things)이 주목받고 있다. 산업용 사물 인터넷은, 사물 인터넷 기술(연결된 기계, 장치, 센서)을 산업용 애플리케이션에서 활용할 수 있으 며, 인공지능(AI)와 머신러닝 기능을 갖춘 현대식 ERP에서 실현되는 경우, 산업용 사물 인터넷의 센서 노드로부 터 수집되는 데이터를 분석하고 활용하여 효율성, 생산성, 및 가시성 등을 개선할 수 있다. 한편, 이러한 산업용 사물 인터넷 기술의 효율성과 신뢰성 그리고 지속 가능성을 향상시키기 위해서는, 데이터 획득 및 처리뿐만 아니라, 기능 추출과 데이터를 이용한 학습 등의 데이터 플로우에 대한 모니터링 및 관리와 더불어, 이를 지원할 수 있는 보안 확보 방안의 모색이 필요하다."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 사정을 감안하여 창출된 것으로서, 본 발명에서 도달하고자 하는 목적은, 산업용 사물 인터넷 (IIoT: Industrial Internet of Things) 환경에서 처리되는 데이터 플로우를 모니터링 및 관리함에 있어서 보 안을 확보하는데 있다."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버는, 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 시스템에 대한 노드 레드(Node-RED)의 적용에 따라, 와이어로 연결되는 각 노 드가 정의되면, 노드 간 데이터 전달을 중계하는 메시지 브로커를 설정하는 설정부; 및 상기 메시지 브로커를 이용한 노드 간 데이터 전송 시 암호화 전송을 지원하기 위한 보안 정보를 생성하는 생성부를 포함하는 것을 특 징으로 한다. 구체적으로, 상기 산업용 사물 인터넷 시스템은, 스마트 데이터 수집 장치(SDAD: Smart Data Acquisition Device)가 수집한 데이터를, 에지(Edge) 단에서 획득하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)을 포함하며, 상기 노드는, 상기 에지 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 스마트 데이터 수집 장치, 및 서버 노드인 상기 산업용 사물 인터넷 서버를 포함하도록 정의될 수 있다. 구체적으로, 상기 메시지 브로커는, 상기 산업용 사물 인터넷 시스템에서, 로컬 라우터를 통해 연결되는 각 노 드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커 (Mosquitto Broker)를 포함할 수 있다. 구체적으로, 상기 산업용 사물 인터넷 시스템은, 상기 에지 산업용 사물 인터넷 시스템(Edge IIoT system)과 데 이터를 교환하는 중앙 집중식 산업용 사물 인터넷 시스템(Centralized IIoT system)을 포함하며, 상기 노드는, 상기 중앙 집중식 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 에지 산업용 사물 인터넷 시스템, 및 서버 노드인 상기 산업용 사물 인터넷 서버를 포함할 수 있다. 구체적으로, 상기 메시지 브로커는, 상기 중앙 집중식 사물 인터넷 시스템에서, 글로벌 인터넷을 통해 연결되는 각 노드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커 (Mosquitto Broker)를 포함할 수 있다. 구체적으로, 상기 생성부는, TLS(Transport Layer Security) 지원과 관련하여, CA(Certificate Authority) 키 와 CA 인증서가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키를 상기 CA 인증 키로 암호화하여 서명으로 등록한 서버 인증서, 및 클라이언트 노드를 위해 생성되는 클라이언트 인증 키를 상기 CA 키로 암호화하여 서명 으로 등록한 클라이언트 인증서를 각각 생성할 수 있다. 구체적으로, 상기 생성부는, 상기 노드 레드(Node-RED)의 적용을 위한 CA(Certificate Authority) 키와 CA 인 증서가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 서버 인증서를 생성하며, 서버 노드인 상기 산업용 사물 인터넷 서버에는 상기 CA 인증서를 루트(Root) CA 인증서로수동 설치할 수 있다. 상기 목적을 달성하기 위한 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버에서 수행되는 보안 설정 방법 은, 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 시스템에 대한 노드 레드(Node-RED)의 적용에 따라, 와이어로 연결되는 각 노드가 정의되면, 노드 간 데이터 전달을 중계하는 메시지 브로커를 설정하는 설정 단계; 및 상기 메시지 브로커를 이용한 노드 간 데이터 전송 시 암호화 전송을 지원하기 위한 보안 정보를 생성 하는 생성단계를 포함하는 것을 특징으로 한다. 구체적으로, 상기 산업용 사물 인터넷 시스템은, 스마트 데이터 수집 장치(SDAD: Smart Data Acquisition Device)가 수집한 데이터를, 에지(Edge) 단에서 획득하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system)을 포함하며, 상기 노드는, 상기 에지 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 스마트 데이터 수집 장치, 및 서버 노드인 상기 산업용 사물 인터넷 서버를 포함하도록 정의될 수 있다. 구체적으로, 상기 메시지 브로커는, 상기 산업용 사물 인터넷 시스템에서, 로컬 라우터를 통해 연결되는 각 노 드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커 (Mosquitto Broker)를 포함할 수 있다. 구체적으로, 상기 산업용 사물 인터넷 시스템은, 상기 에지 산업용 사물 인터넷 시스템(Edge IIoT system)과 데 이터를 교환하는 중앙 집중식 산업용 사물 인터넷 시스템(Centralized IIoT system)을 포함하며, 상기 노드는, 상기 중앙 집중식 산업용 사물 인터넷 시스템에서 클라이언트 노드인 상기 에지 산업용 사물 인터넷 시스템, 및 서버 노드인 상기 산업용 사물 인터넷 서버를 포함할 수 있다. 구체적으로, 상기 메시지 브로커는, 상기 중앙 집중식 사물 인터넷 시스템에서, 글로벌 인터넷을 통해 연결되는 각 노드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커 (Mosquitto Broker)를 포함할 수 있다. 구체적으로, 상기 생성단계는, TLS(Transport Layer Security) 지원과 관련하여, CA(Certificate Authority) 키와 CA 인증서가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키를 상기 CA 인증 키로 암호화하여 서명으 로 등록한 서버 인증서, 및 클라이언트 노드를 위해 생성되는 클라이언트 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 클라이언트 인증서를 각각 생성할 수 있다. 구체적으로, 상기 생성단계는, 상기 노드 레드(Node-RED)의 적용을 위한 CA(Certificate Authority) 키와 CA 인증서가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키를 상기 CA 키로 암호화하여 서명으로 등록한 서버 인증서를 생성하며, 서버 노드인 상기 산업용 사물 인터넷 서버에는 상기 CA 인증서를 루트(Root) CA 인증서로 수동 설치할 수 있다."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이에, 본 발명의 산업용 사물 인터넷 서버 및 보안 설정 방법에서는 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 환경에서 노드 레드(Node-RED)를 이용하여 데이터 플로우를 모니터링 및 관리함에 있어서 모스키토 브로커(Mosquitto Broker) 기반의 TLS 지원이 가능해지도록 함으로써, 충분한 보안 확보를 통해 산업 용 사물 인터넷 기술의 효율성과 신뢰성 그리고 지속 가능성을 향상시킬 수 있다."}
{"patent_id": "10-2023-0037895", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예에 대하여 설명한다. 본 발명의 일 실시예에서는, 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 기술을 다룬다. 인터넷은 인간이 정보를 생성하고 소비하는 인간 중심의 연결 망에서, 사물 등 분산된 구성 요소들 간에 정보를 주고 받아 처리하는 사물 인터넷(IoT: Internet of Things) 망으로 진화하고 있다. 이러한, 사물 인터넷 환경에서는, 기존의 IT(information technology)기술과 다양한 산업 간의 융합 및 복합을 통하여 스마트 홈, 스마트 빌딩, 스마트 시티, 스마트 카 혹은 커넥티드 카, 스마트 그리드, 헬스 케어, 스마트 가전, 및 첨단의료서비스 등의 분야에 응용될 수 있는 것이다. 최근에는, 이러한 사물 인터넷보다 하위 범주의 개념으로서, 인더스트리 4.0 기술의 기본 요소가 되는 산업용 사물 인터넷(IIoT: Industrial Internet of Things)이 주목받고 있다. 산업용 사물 인터넷은, 사물 인터넷 기술(연결된 기계, 장치, 센서)을 산업용 애플리케이션에서 활용할 수 있으 며, 인공지능(AI)와 머신러닝 기능을 갖춘 현대식 ERP에서 실현되는 경우, 산업용 사물 인터넷의 센서 노드로부 터 수집되는 데이터를 분석하고 활용하여 효율성, 생산성, 및 가시성 등을 개선할 수 있다. 한편, 이러한 산업용 사물 인터넷 기술의 효율성과 신뢰성 그리고 지속 가능성을 향상시키기 위해서는, 데이터 획득 및 처리뿐만 아니라, 기능 추출과 데이터를 이용한 학습 등의 데이터 플로우에 대한 모니터링 및 관리와 더불어, 이를 지원할 수 있는 보안 확보 방안의 모색이 필요하다. 이에 본 발명의 일 실시예에서는 산업용 사물 인터넷 환경에서 처리되는 데이터 플로우를 모니터링 및 관리함에 있어서 보안을 확보할 수 있는 방안을 제안하고자 한다. 도 1은 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경을 예시적으로 보여주고 있다. 도 1에 도시된 바와 같이, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경에서는, 클라우드 및 에지 컴퓨 팅(Edge computing) 기술을 채택한다. 이에 따라, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경은, 댁내 가전 기기에 대해서 측정된 데이터를 수집하는 스마트 데이터 수집 장치(SDAD: Smart Data Acquisition Device, 100), 및 에지(Edge) 단에서 스마트 데이터 수집 장치가 수집한 데이터를 획득하는 에지 산업용 사물 인터넷 시스템(Edge IIoT system, 200), 및 에지 산업용 사물 인터넷 시스템과 필요한 데이터를 교환하는 중앙 집중식 산업용 사물 인터넷 시스템 (Centralized IIoT system, 300)을 포함하는 형태로 구축될 수 있다. 스마트 데이터 수집 장치는 전압 센서(Voltage Sensor)를 통해 측정되는 전압 값과, 전류 센서(Current Sensor)를 통해 측정되는 전류 값을 데이터로서 수집하는 장치를 일컫는 것으로서, 아날로그 디지털 변환기 (ADC) 기반의 마이크로 프로세서 유닛(MCU)과, MQTT(Message Queuing Telemetry Transport) 프로토콜 통신을 지원하는 사물 인터넷(IoT) 모듈을 포함할 수 있다. 에지 산업용 사물 인터넷 시스템은 AI 모델인 Edge AIoT의 실행을 기반으로 개별 주택의 스마트 데이터 수 집 장치로부터 데이터 획득 및 처리뿐만 아니라, 기능 추출과 데이터를 이용한 Edge AIoT 학습을 처리할 수 있다. 이를 위해, 에지 산업용 사물 인터넷 시스템은 로컬 서버(Local Server)로 구현될 수 있고, 로컬 라우터를 통해 개별 주택의 스마트 데이터 수집 장치와 무선 통신을 설정하며, 또한, 중앙 집중식 산업용 사물 인터 넷 시스템에 대해서는 글로벌 인터넷(Global Internet) 연결을 통해 MQTT 기반의 HTTP 데이터 전송을 지원 한다. 여기서, 에지 산업용 사물 인터넷 시스템에서 사용될 수 있는 AI 모델에는, 전술의 Edge AIoT뿐만 아니라 중앙 집중식 산업용 사물 인터넷 시스템에서 학습된 Cloud AIoT가 더 포함될 수 있는데, 이러한 Cloud AIoT를 사용하는 동안에는 Cloud AIoT의 학습을 위해 중앙 집중식 산업용 사물 인터넷 시스템으로 데이터 가 전송될 수 있다. 중앙 집중식 산업용 사물 인터넷 시스템은 AI 모델인 Cloud AIoT의 실행을 기반으로, 에지 산업용 사물 인 터넷 시스템과 필요한 데이터의 교환과 처리, 그리고 기능 추출 및 데이터를 이용한 Cloud AIoT 학습을 처리할 수 있다. 여기서, Cloud AIoT의 경우 원격 접속을 기반으로 에지 산업용 사물 인터넷 시스템에서 사용될 수 있다. 이를 위해, 중앙 집중식 산업용 사물 인터넷 시스템은 클라우드 서버(Cloud Server)로 구현될 수 있고, 전 술한 바와 같이 글로벌 인터넷(Global Internet) 연결을 통한 에지 산업용 사물 인터넷 시스템과의 MQTT 기반의 HTTP 데이터 전송을 지원한다. 그리고, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경에서는, 스마트 데이터 수집 장치와 에지 산 업용 사물 인터넷 시스템, 그리고 중앙 집중식 산업용 사물 인터넷 시스템 간에 처리되는 데이터 플 로우를 모니터링 및 관리하기 위한 기술로서, 노드 레드(Node-RED) 기술을 채택하게 된다. 여기서, 노드 레드(Node-RED)는 노드와 와이어로 응용을 표현하는 시각화 도구로서, 노드는 사물을 추상화하거 나 서비스를 추상화한 것이고 노드와 노드를 연결하는 와이어는 데이터의 흐름을 추상화한 것으로 이해될 수 있 다. 이와 관련하여, 도 2에는 에지 산업용 사물 인터넷 시스템에 대해서 노드 레드(Node-RED)를 적용한 상태를 예시적으로 보여주고 있으며, 도 3에는 중앙 집중식 산업용 사물 인터넷 시스템에 대해서 노드 레드(Node- RED) 적용한 상태를 예시적으로 보여주고 있다. 한편, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경에서는, 공용 IP(Public IP)가 활용되는데 이러한 공용 IP는 시스템 확장성에는 이점이 있는 반면 보안에는 매우 취약하다는 단점을 가지기 때문에 산업용 사물 인터넷 기술의 효율성과 신뢰성 그리고 지속 가능성을 향상시키는데 있어서 큰 걸림돌이 될 수 있다. 이에 본 발명의 일 실시예에서는, 산업용 사물 인터넷 환경에서 처리되는 데이터 플로우의 모니터링 및 관리에 있어서 보안을 확보하고자 하는 것이며, 이하에서는 이를 실현하기 위한 산업용 사물 인터넷 서버의 구성을 보 다 구체적으로 설명하기로 한다. 여기서, 산업용 사물 인터넷 서버는, 에지 산업용 사물 인터넷 시스템을 구성하는 로컬 서버와, 중앙 집중 식 산업용 사물 인터넷 시스템을 구성하는 클라우드 서버를 통칭하는 것으로서, 이하에서는 설명의 편의를 위해 별도의 식별 번호를 부여하기로 한다. 도 4는 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버의 구성을 보여주고 있다. 도 4에 도시된 바와 같이, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버는 설정부, 및 생성 부를 포함하는 구성을 가질 수 있다. 이상의 설정부, 및 생성부를 포함하는 산업용 사물 인터넷 서버의 전체 구성 내지는 적어도 일 부는 하드웨어 모듈 형태 또는 소프트웨어 모듈 형태로 구현되거나, 하드웨어 모듈과 소프트웨어 모듈이 조합된 형태로 구현될 수 있다. 여기서, 소프트웨어 모듈이란, 예컨대, 산업용 사물 인터넷 서버 내에서 연산을 제어하는 프로세서에 의해 실행되는 명령어로 이해될 수 있으며, 이러한 명령어는 산업용 사물 인터넷 서버 내 메모리에 탑재된 형태 를 가질 수 있다. 한편, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버는 전술한 구성 이외에, MQTT(Message Queuing Telemetry Transport) 프로토콜 기반의 통신 기능을 담당하는 통신 모듈인 통신부(도시 안됨)의 구성을 더 포함 할 수 있다. 이상 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버는 전술한 구성을 통해서 산업용 사물 인터넷 환경에서 처리되는 데이터 플로우의 모니터링 및 관리에 있어서 충분한 보안을 확보할 수 있는데, 이하에서는 이를 실현하기 위한 산업용 사물 인터넷 서버 내 구성에 대한 보다 구체적인 설명을 이어 가기로 한다. 설정부는 메시지 브로커를 설정하는 기능을 담당한다. 보다 구체적으로, 설정부는 노드 레드(Node-RED)의 적용에 따라, 와이어로 연결되는 각 노드가 정의되면, 노드 간 데이터 전달을 중계하는 메시지 브로커를 설정하게 된다. 이와 관련하여, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 시스템은, 앞서 도 1를 참조한 설명에서와 같 이, 스마트 데이터 수집 장치가 수집한 데이터를, 에지(Edge) 단에서 획득하는 에지 산업용 사물 인터넷시스템을 포함한다. 이에 따라, 에지 산업용 사물 인터넷 시스템에서는 노드 레드(Node-RED)의 적용 시, 예컨대, 클라이언트 노드인 스마트 데이터 수집 장치와 서버 노드인 산업용 사물 인터넷 서버를 포함하도록 노드가 정의 될 수 있다. 이에 대해, 설정부는 에지 산업용 사물 인터넷 시스템에서 로컬 라우터를 통해 연결되는 각 노드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 메시지 브로커로 설정할 수 있다. 이를 통해서, 본 발명의 일 실시예에 따른 에지 산업용 사물 인터넷 시스템에서는 모스키토 브로커 (Mosquitto Broker)의 중계로 클라이언트 노드인 스마트 데이터 수집 장치와 서버 노드인 산업용 사물 인 터넷 서버 간에 로컬 MQTT 기반의 HTTP 데이터 전송이 이루어질 수 있는 것이다. 또한, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 시스템은, 에지 산업용 사물 인터넷 시스템과 필요 한 데이터를 교환하는 중앙 집중식 산업용 사물 인터넷 시스템을 포함한다. 이에 따라, 중앙 집중식 산업용 사물 인터넷 시스템에 대해서는 노드 레드(Node-RED)의 적용 시, 예컨대, 클라이언트 노드인 에지 산업용 사물 인터넷 시스템과 서버 노드인 산업용 사물 인터넷 서버를 포함 하도록 노드가 정의될 수 있다. 이에 대해, 설정부는 에지 산업용 사물 인터넷 시스템 내 글로벌 인터넷을 통해 연결되는 각 노드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 메시지 브로커로 설정할 수 있다. 이를 통해서, 본 발명의 일 실시예에 따른 중앙 집중식 산업용 사물 인터넷 시스템에서는 모스키토 브로커 (Mosquitto Broker)의 중계로 클라이언트 노드인 에지 산업용 사물 인터넷 시스템과 서버 노드인 산업용 사물 인터넷 서버 간에 글로벌 MQTT 기반의 HTTP 데이터 전송이 이루어질 수 있는 것이다. 생성부는 보안 정보를 생성하는 기능을 담당한다. 보다 구체적으로, 생성부는 메시지 브로커를 이용한 노드 간 데이터 전송 시 암호화 전송을 지원하기 위한 보안 정보를 생성하게 된다. 이와 관련하여, MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커 (Mosquitto Broker)의 경우, TLS(Transport Layer Security)를 지원한다. 이에 따라, 생성부는 모스키토 브로커(Mosquitto Broker) 기반의 TLS를 지원하기 위한 보안 정보로서, CA(Certificate Authority) 키(Broker-CA.key)와 CA 인증서(Broker-CA.crt), 서버 인증 키(Broker- Server.key)와 서버 인증서(Broker-Server.crt), 및 클라이언트 인증 키(Broker-Client.key)와 클라이언트 인 증서(Broker-Client.crt)를 생성할 수 있다. 이를 다시 정리하자면, 생성부는 예컨대, 도 5에서와 같이 모스키토 브로커(Mosquitto Broker) 기반의 TLS 지원과 관련하여, CA 키(Broker-CA.key)와 CA 인증서(Broker-CA.crt)가 생성되면(Step-1), 서버 노드를 위해 생성되는 서버 인증 키(Broker-Server.key)를 CA 키(Broker-CA.key)로 암호화하여 서명으로 등록한 서버 인증 서(Broker-Server.crt)를 생성하며(Step-2), 이어서 클라이언트 노드를 위해 생성되는 클라이언트 인증 키 (Broker-Client.key)를 CA 키(Broker-CA.key)로 암호화하여 서명으로 등록한 클라이언트 인증서(Broker- Client.crt)를 생성하고 있는 것이다(Step-3). 한편, 본 발명의 일 실시예에서는, 산업용 사물 인터넷 시스템에서 처리되는 데이터 플로우를 모니터링 및 관리 하기 위한 기술로서, 노드 레드(Node-RED) 기술을 채택하고 있음을 언급한 바 있다. 이를 위해서, 산업용 사물 인터넷 서버에는 노드 레드(Node-RED) 편집기가 설치되는 반면, 이러한 노드 레 드(Node-RED) 편집기에는 보안이 설정되어 있지 않다. 이에 따라, 생성부는 노드 레드(Node-RED) 적용을 위한 보안 정보로서, CA(Certificate Authority) 키 (Node-CA.key)와 CA 인증서(Node-CA.crt), 및 서버 인증 키(Node-Server.key)와 서버 인증서(Node- Server.crt)를 생성할 수 있다. 이를 다시 정리하자면, 생성부는 예컨대, 도 6에서와 같이 노드 레드(Node-RED) 편집기에 대한 보안 설정 과 관련하여, CA 키(Node-CA.key)와 CA 인증서(Node-CA.crt)가 생성되면(Step-1), 서버 노드를 위해 생성되는 서버 인증 키(Node-Server.key)를 CA 키(Node-CA.key)로 암호화하여 서명으로 등록한 서버 인증서(Node- Server.crt)를 생성한다(Step-2). 한편, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 시스템의 경우, 노드 레드(Node-RED) 편집기에 대한 보 안 설정이 근본적으로 지원되지 않는 관계로, 시스템에서 생성된(발급된) CA 인증서(Node-CA.crt)가 자동으로 설치되지 않는다. 이에, 생성부는 서버 노드를 위해 생성되는 서버 인증 키(Node-Server.key)를 CA 키(Node-CA.key)로 암호 화하여 서명으로 등록한 서버 인증서(Node-Server.crt)가 생성되면(Step-2), 이어서 서버 노드인 산업용 사물 인터넷 서버에 CA 인증서(Node-Server.crt)를 루트(Root) CA 인증서로 수동 설치함으로써(Step-3), 노드 간 데이터 전달 시 CA 인증서(Node-Server.crt)에 대한 유효성이 검증될 수 있도록 한다. 이상에서 살펴본 바와 같이, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버의 구성에 따르면, 산업 용 사물 인터넷(IIoT: Industrial Internet of Things) 환경에서 노드 레드(Node-RED)를 이용하여 데이터 플로 우를 모니터링 및 관리함에 있어서 모스키토 브로커(Mosquitto Broker) 기반의 TLS 지원이 가능해지도록 함으로 써, 충분한 보안 확보를 통해 산업용 사물 인터넷 기술의 효율성과 신뢰성 그리고 지속 가능성을 향상시킬 수 있다. 이하에서는, 도 7을 참조하여 본 발명의 일 실시예에 따른 보안 설정 방법을 설명하기로 한다. 본 발명의 일 실시예에 따른 보안 설정 방법의 동작 주체는 앞서 도 4를 참조하여 설명한 산업용 사물 인터넷 서버임을 전제로 설명을 이어 가기로 한다. 먼저, 산업용 사물 인터넷 서버는 노드 레드(Node-RED)의 적용에 따라, 와이어로 연결되는 각 노드가 정의 되면, 노드 간 데이터 전달을 중계하는 메시지 브로커를 설정한다(S110). 이와 관련하여, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 시스템은, 앞서 도 1를 참조한 설명에서와 같 이, 스마트 데이터 수집 장치가 수집한 데이터를, 에지(Edge) 단에서 획득하는 에지 산업용 사물 인터넷 시스템을 포함한다. 이에 따라, 에지 산업용 사물 인터넷 시스템에서는 노드 레드(Node-RED)의 적용 시, 예컨대, 클라이언트 노드인 스마트 데이터 수집 장치와 서버 노드인 산업용 사물 인터넷 서버를 포함하도록 노드가 정의 될 수 있다. 이에 대해, 산업용 사물 인터넷 서버는 에지 산업용 사물 인터넷 시스템에서 로컬 라우터를 통해 연 결되는 각 노드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 메시지 브로커로 설정할 수 있다. 이를 통해서, 본 발명의 일 실시예에 따른 에지 산업용 사물 인터넷 시스템에서는 모스키토 브로커 (Mosquitto Broker)의 중계로 클라이언트 노드인 스마트 데이터 수집 장치와 서버 노드인 산업용 사물 인 터넷 서버 간에 로컬 MQTT 기반의 HTTP 데이터 전송이 이루어질 수 있는 것이다. 또한, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 시스템은, 에지 산업용 사물 인터넷 시스템과 필요 한 데이터를 교환하는 중앙 집중식 산업용 사물 인터넷 시스템을 포함한다. 이에 따라, 중앙 집중식 산업용 사물 인터넷 시스템에 대해서는 노드 레드(Node-RED)의 적용 시, 예컨대, 클라이언트 노드인 에지 산업용 사물 인터넷 시스템과 서버 노드인 산업용 사물 인터넷 서버를 포함 하도록 노드가 정의될 수 있다. 이에 대해, 산업용 사물 인터넷 서버는 에지 산업용 사물 인터넷 시스템 내 글로벌 인터넷을 통해 연 결되는 각 노드에 대해 MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커(Mosquitto Broker)를 메시지 브로커로 설정할 수 있다. 이를 통해서, 본 발명의 일 실시예에 따른 중앙 집중식 산업용 사물 인터넷 시스템에서는 모스키토 브로커 (Mosquitto Broker)의 중계로 클라이언트 노드인 에지 산업용 사물 인터넷 시스템과 서버 노드인 산업용 사물 인터넷 서버 간에 글로벌 MQTT 기반의 HTTP 데이터 전송이 이루어질 수 있는 것이다. 나아가, 산업용 사물 인터넷 서버는 메시지 브로커를 이용한 노드 간 데이터 전송 시 암호화 전송을 지원 하기 위한 보안 정보를 생성하게 된다. 이와 관련하여, MQTT(Message Queuing Telemetry Transport) 기반의 데이터 전송을 지원하는 모스키토 브로커 (Mosquitto Broker)의 경우, TLS(Transport Layer Security)를 지원한다. 이에 따라, 산업용 사물 인터넷 서버는 모스키토 브로커(Mosquitto Broker) 기반의 TLS를 지원하기 위한 보안 정보로서, CA(Certificate Authority) 키(Broker-CA.key)와 CA 인증서(Broker-CA.crt), 서버 인증 키 (Broker-Server.key)와 서버 인증서(Broker-Server.crt), 및 클라이언트 인증 키(Broker-Client.key)와 클라이 언트 인증서(Broker-Client.crt)를 생성할 수 있다. 정리하자면, 산업용 사물 인터넷 서버는 모스키토 브로커(Mosquitto Broker) 기반의 TLS 지원과 관련하여, CA 키(Broker-CA.key)와 CA 인증서(Broker-CA.crt)가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키 (Broker-Server.key)를 CA 키(Broker-CA.key)로 암호화하여 서명으로 등록한 서버 인증서(Broker- Server.crt)를 생성하며, 이어서 클라이언트 노드를 위해 생성되는 클라이언트 인증 키(Broker-Client.key)를 CA 키(Broker-CA.key)로 암호화하여 서명으로 등록한 클라이언트 인증서(Broker-Client.crt)를 생성한다(S120- S140). 한편, 본 발명의 일 실시예에서는, 산업용 사물 인터넷 시스템에서 처리되는 데이터 플로우를 모니터링 및 관리 하기 위한 기술로서, 노드 레드(Node-RED) 기술을 채택하고 있음을 언급한 바 있다. 이를 위해서, 산업용 사물 인터넷 서버에는 노드 레드(Node-RED) 편집기가 설치되는 반면, 이러한 노드 레 드(Node-RED) 편집기에는 보안이 설정되어 있지 않다. 이와 관련하여, 산업용 사물 인터넷 서버는 노드 레드(Node-RED) 적용을 위한 보안 정보로서, CA(Certificate Authority) 키(Node-CA.key)와 CA 인증서(Node-CA.crt), 및 서버 인증 키(Node-Server.key)와 서버 인증서(Node-Server.crt)를 생성할 수 있다. 정리하자면, 산업용 사물 인터넷 서버는 노드 레드(Node-RED) 편집기에 대한 보안 설정과 관련하여, CA 키 (Node-CA.key)와 CA 인증서(Node-CA.crt)가 생성되면, 서버 노드를 위해 생성되는 서버 인증 키(Node- Server.key)를 CA 키(Node-CA.key)로 암호화하여 서명으로 등록한 서버 인증서(Node-Server.crt)를 생성한다 (S150-S160). 한편, 본 발명의 일 실시예에 따른 산업용 사물 인터넷 시스템의 경우, 노드 레드(Node-RED) 편집기에 대한 보 안 설정이 근본적으로 지원되지 않는 관계로, 시스템에서 생성된(발급된) CA 인증서(Node-CA.crt)가 자동으로 설치되지 않는다. 이에, 산업용 사물 인터넷 서버는 앞선 단계 S160을 통해 서버 인증 키(Node-Server.key)를 CA 키(Node- CA.key)로 암호화하여 서명으로 등록한 서버 인증서(Node-Server.crt)가 생성되면, 이어서 서버 노드인 산업용 사물 인터넷 서버에 CA 인증서(Node-Server.crt)를 루트(Root) CA 인증서로 수동 설치함으로써 노드 간 데 이터 전달 시 CA 인증서(Node-Server.crt)에 대한 유효성이 검증될 수 있도록 한다(S170). 이상에서 살펴본 바와 같이, 본 발명의 일 실시예에 따른 보안 설정 방법에 따르면, 산업용 사물 인터넷(IIoT: Industrial Internet of Things) 환경에서 노드 레드(Node-RED)를 이용하여 데이터 플로우를 모니터링 및 관리 함에 있어서 모스키토 브로커(Mosquitto Broker) 기반의 TLS 지원이 가능해지도록 함으로써, 충분한 보안 확보 를 통해 산업용 사물 인터넷 기술의 효율성과 신뢰성 그리고 지속 가능성을 향상시킬 수 있다. 한편, 본 명세서에서 설명하는 기능적인 동작과 주제의 구현물들은 디지털 전자 회로로 구현되거나, 본 명세서 에서 개시하는 구조 및 그 구조적인 등가물들을 포함하는 컴퓨터 소프트웨어, 펌웨어 혹은 하드웨어로 구현되거 나, 이들 중 하나 이상의 결합으로 구현 가능하다. 본 명세서에서 설명하는 주제의 구현물들은 하나 이상의 컴 퓨터 프로그램 제품, 다시 말해 처리 시스템의 동작을 처리하기 위하여 혹은 이것에 의한 실행을 위하여 유형의 프로그램 저장매체 상에 인코딩된 컴퓨터 프로그램 명령에 관한 하나 이상의 모듈로서 구현될 수 있다. 컴퓨터로 판독 가능한 매체는 기계로 판독 가능한 저장 장치, 기계로 판독 가능한 저장 기판, 메모리 장치, 혹 은 이들 중 하나 이상의 조합일 수 있다. 본 명세서에서 \"시스템\"이나 \"장치\"라 함은 예컨대 프로그래머블 프로세서, 컴퓨터 혹은 다중 프로세서나 컴퓨 터를 포함하여 데이터를 처리하기 위한 모든 기구, 장치 및 기계를 포괄한다. 처리 시스템은, 하드웨어에 부가 하여, 예컨대 프로세서 펌웨어를 구성하는 코드, 프로토콜 스택, 데이터베이스 관리 시스템, 운영 체제 혹은 이들 중 하나 이상의 조합 등 요청 시 컴퓨터 프로그램에 대한 실행 환경을 형성하는 코드를 포함할 수 있다. 컴퓨터 프로그램(프로그램, 소프트웨어, 소프트웨어 애플리케이션, 스크립트 혹은 코드로도 알려져 있음)은 컴 파일되거나 해석된 언어나 선험적 혹은 절차적 언어를 포함하는 프로그래밍 언어의 어떠한 형태로도 작성될 수 있으며, 독립형 프로그램이나 모듈, 컴포넌트, 서브루틴 혹은 컴퓨터 환경에서 사용하기에 적합한 다른 유닛을 포함하여 어떠한 형태로도 전개될 수 있다. 컴퓨터 프로그램은 파일 시스템의 파일에 반드시 대응하는 것은 아 니다. 프로그램은 요청된 프로그램에 제공되는 단일 파일 내에, 혹은 다중의 상호 작용하는 파일(예컨대, 하나 이상의 모듈, 하위 프로그램 혹은 코드의 일부를 저장하는 파일) 내에, 혹은 다른 프로그램이나 데이터를 보유 하는 파일의 일부(예컨대, 마크업 언어 문서 내에 저장되는 하나 이상의 스크립트) 내에 저장될 수 있다. 컴퓨 터 프로그램은 하나의 사이트에 위치하거나 복수의 사이트에 걸쳐서 분산되어 통신 네트워크에 의해 상호 접속 된 다중 컴퓨터나 하나의 컴퓨터 상에서 실행되도록 전개될 수 있다. 한편, 컴퓨터 프로그램 명령어와 데이터를 저장하기에 적합한 컴퓨터로 판독 가능한 매체는, 예컨대 EPROM, EEPROM 및 플래시메모리 장치와 같은 반도체 메모리 장치, 예컨대 내부 하드디스크나 외장형 디스크와 같은 자 기 디스크, 자기광학 디스크 및 CD-ROM과 DVD-ROM 디스크를 포함하여 모든 형태의 비휘발성 메모리, 매체 및 메 모리 장치를 포함할 수 있다. 프로세서와 메모리는 특수 목적의 논리 회로에 의해 보충되거나, 그것에 통합될 수 있다. 본 명세서에서 설명한 주제의 구현물은 예컨대 데이터 서버와 같은 백엔드 컴포넌트를 포함하거나, 예컨대 애플 리케이션 서버와 같은 미들웨어 컴포넌트를 포함하거나, 예컨대 사용자가 본 명세서에서 설명한 주제의 구현물 과 상호 작용할 수 있는 웹 브라우저나 그래픽 유저 인터페이스를 갖는 클라이언트 컴퓨터와 같은 프론트엔드 컴포넌트 혹은 그러한 백엔드, 미들웨어 혹은 프론트엔드 컴포넌트의 하나 이상의 모든 조합을 포함하는 연산 시스템에서 구현될 수도 있다. 시스템의 컴포넌트는 예컨대 통신 네트워크와 같은 디지털 데이터 통신의 어떠한 형태나 매체에 의해서도 상호 접속 가능하다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 마찬가지로, 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특 정한 특징들은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양 한 특징들 역시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부 터의 하나 이상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 또한, 본 명세서에서는 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행 되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시형태의 다양한 시스템 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되 어서는 안되며, 설명한 프로그램 컴포넌트와 시스템들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거 나 다중 소프트웨어 제품에 패키징될 수 있다는 점을 이해하여야 한다 이와 같이, 본 명세서는 그 제시된 구체적인 용어에 본 발명을 제한하려는 의도가 아니다. 따라서, 상술한 예를 참조하여 본 발명을 상세하게 설명하였지만, 당업자라면 본 발명의 범위를 벗어나지 않으면서도 본 예들에 대한 개조, 변경 및 변형을 가할 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하 여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 등가개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다. 산업상 이용가능성 본 발명에 따른 산업용 사물 인터넷 서버 및 보안 설정 방법에 따르면, 댁내 가전 기기에 대해서 수집되는 에너 지 데이터의 신뢰성을 보장할 수 있는 필터링 방안을 제안하고 있다는 점에서, 기존 기술의 한계를 뛰어 넘음에 따라 관련 기술에 대한 이용만이 아닌 적용되는 장치의 시판 또는 영업의 가능성이 충분할 뿐만 아니라 현실적 으로 명백하게 실시할 수 있는 정도이므로 산업상 이용가능성이 있는 발명이다. 부호의 설명100: 스마트 데이터 수집 장치 200: 에지 산업용 사물 인터넷 시스템 300: 중앙 집중식 산업용 사물 인터넷 시스템 400: 산업용 사물 인터넷 서버 410: 설정부 420: 생성부"}
{"patent_id": "10-2023-0037895", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 산업용 사물 인터넷 환경을 설명하기 위한 예시도. 도 2는 본 발명의 일 실시예에 따른 에지 산업용 사물 인터넷 시스템(Edge IIoT system)에 대해서 노드 레드 (Node-RED)를 적용한 상태를 설명하기 위한 예시도. 도 3은 본 발명의 일 실시예에 따른 중앙 집중식 산업용 사물 인터넷 시스템(Centralized IIoT system)에 대해 서 노드 레드(Node-RED)를 적용한 상태를 설명하기 위한 예시도. 도 4는 본 발명의 일 실시예에 따른 산업용 사물 인터넷 서버를 설명하기 위한 구성도. 도 5는 및 도 6은 본 발명의 일 실시예에 따른 보안 정보를 설명하기 위한 예시도. 도 7은 본 발명의 일 실시예에 따른 보안 설정 방법을 설명하기 위한 순서도."}
