{"patent_id": "10-2019-0174321", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0000422", "출원번호": "10-2019-0174321", "발명의 명칭": "염분차 발전에 기반한 에너지 자립형 스마트 팜 시스템", "출원인": "한국에너지기술연구원", "발명자": "정남조"}}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "농작물 재배가 이루어지며, 상기 농작물 재배를 위한 적어도 하나 이상의 농작물 재배용 센서와 전자기계 장치를 포함하는 농장 시설; 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나를 포함하는 고농도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상기 저농도 용액의 농도차를 이용하여 전기를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 배출하여 상기 농작물에 공급하는 염분차 발전장치; 상기 염분차 발전장치와 상기 농장 시설 사이에 설치된 생장 원료 희석 공급부로, 상기 생장 원료 희석 공급부는 상기 염분차 발전장치와 상기 농장 시설에 연결 설치된 배관, 상기 배관에 설치된 농도 측정기, 및 상기 농도 측정기에서 농도가 측정된 생장원료가 유입되는 입구, 상기 농장 시설에 연결된 제1 출구와 상기 염분차 발전장치 전단에 상기 고농도 용액의 경로에 연결된 제2 출구를 포함하는 밸브를 포함하고, 상기 농도 측정기의측정 결과가 설정 범위를 만족하면 상기 제1 출구를 개방하여 상기 생장 원료를 상기 농장 시설에 공급하고, 상기 농도 측정기의 측정 결과가 설정 범위를 만족하지 않으며 상기 제2 출구를 개방하여 상기 생장 원료를 상기고농도 용액과 섞어 상기 염분차 발전장치로 다시 공급하는 생장 원료 희석 공급부; 및상기 염분차 발전장치에서 생산된 상기 전기를 저장하고, 상기 센서와 상기 전자기계 장치에 상기 전기를 공급하는 에너지 저장 시스템을 포함하는 염분차 발전장치에 기반한 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 농도 측정기의 측정 결과를 수신하여 상기 밸브를 제어하고, 상기 센서의 정보를 수신하고 이를 분석하여 상기 염분차 발전장치의 구동을 제어하여 상기 전기와 상기 생장원료의 생성 및 공급을 제어하는 중앙제어장치를 더 포함하는 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 염분차 발전장치의 전단 또는 후단에 반투과막에 의해 분리된 제1 유로와 제2 유로를 포함하고 상기 반투과막을 통해 삼투압에 의해 물이 이동하는 정삼투 유닛을 더 포함하는 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 미생물 배양을 위한 정보를 센싱하는 적어도 하나 이상의 센서와 상기 센서로부터 송신된 신호에 근거하여 미생물을 배양 환경을 조절하는 전자기계 장치를 포함하는 미생물 배양 장치를 더 포함하고, 상기 제1 출구는 상기 농장 시설과 상기 미생물 배양 장치에 연결되고, 상기 농도 측정기의 측정 결과가 설정 범위를 만족하면 상기 제1 출구를 개방하여 상기 생장 원료를 상기 농장시설 및/또는 상기 미생물 배양 장치에 공급하는 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 고농도 용액은 이산화탄소 흡수액이고, 상기 미생물 배양 장치에 공급되는 상기 생장원료는 탄산수인 에너지 자립형 스마트 팜 시스템.공개특허 10-2020-0000422-3-청구항 6 농작물 재배가 이루어지며, 상기 농작물 재배를 위한 적어도 하나 이상의 농작물 재배용 센서와 전자기계 장치를 포함하는 농장 시설; 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나를 포함하는 고농도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상기 저농도 용액의 농도차를 이용하여 전기를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 배출하여 상기 농작물에 공급하는 염분차 발전장치; 고농도 염수와 상기 고농도 용액 중 어느 하나와 상기 저농도 용액을 공급받아 전기를 생성하는 대용량 염분차발전장치; 및 상기 염분차 발전장치 및 상기 대용량 염분차 발전장치에서 생성된 전기를 저장하고, 상기 센서와 상기 전자기계 장치에 상기 전기를 공급하는 에너지 저장 시스템을 포함하고, 상기 대용량 염분차 발전장치는 수광부를 갖는 제1 면 및 제1 면의 반대방향의 제2 면을 갖는 태양전지 패널; 및 상기 저농도 용액으로 이루어진 제1 용액과 상기 고농도 염수와 상기 고농도 용액 중 어느 하나로 이루어진 제2용액이 유입하여 염도차 발전을 통해 전기를 생산하기 위한 염도차 발전 유닛을 포함하며,상기 염도차 발전 유닛은, 제1 용액 유입포트 및 유출포트, 제2 용액 유입포트 및 유출포트를 갖는 하우징;하우징 내에 배치되고, 소정간격 떨어져 마련된 애노드 및 캐소드 전극; 및애노드 및 캐소드 전극 사이에 제1 용액이 유동하는 제1 유로 및 제2 용액이 유동하는 제2 유로를 구획하도록배열된 복수 개의 이온교환막을 포함하고,상기 하우징은, 제1 용액 유입포트 및 제1 유로를 유체 이동 가능하게 연결하는 제1 용액 유입부를 갖고,상기 제1 용액 유입부는 유입된 제1 용액 및 태양전지 패널의 상기 제2 면 사이에 열 교환이 이루어지도록 마련된 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 염분차 발전장치와 상기 농장 시설 사이에 설치된 생장 원료 희석 공급부를 더 포함하되, 상기 생장 원료 희석 공급부는 상기 염분차 발전장치와 상기 농장 시설에 연결 설치된 배관, 상기 배관에 설치된 농도 측정기, 및 상기 농도 측정기에서 농도가 측정된 생장원료가 유입되는 입구, 상기 농장 시설에 연결된제1 출구와 상기 염분차 발전장치 전단에 상기 고농도 용액의 경로에 연결된 제2 출구를 포함하는 밸브를 포함하고,상기 농도 측정기의 측정 결과가 설정 범위를 만족하면 상기 제1 출구를 개방하여 상기 생장 원료를 상기 농장시설에 공급하고, 상기 농도 측정기의 측정 결과가 설정 범위를 만족하지 않으며 상기 제2 출구를 개방하여 상기 생장 원료를 상기 고농도 용액과 섞어 상기 염분차 발전장치로 다시 공급하는 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 농도 측정기의 측정 결과를 수신하여 상기 밸브를 제어하고, 상기 센서의 정보를 수신하고 이를 분석하여 상기 염분차 발전장치의 구동을 제어하여 상기 전기와 상기 생장원료의 생성 및 공급을 제어하는 중앙제어장치를 더 포함하는 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 공개특허 10-2020-0000422-4-미생물 배양을 위한 정보를 센싱하는 적어도 하나 이상의 센서와 상기 센서로부터 송신된 신호에 근거하여 미생물을 배양 환경을 조절하는 전자기계 장치를 포함하는 미생물 배양 장치를 더 포함하고, 상기 제1 출구는 상기 농장 시설과 상기 미생물 배양 장치에 연결되고, 상기 농도 측정기의 측정 결과가 설정 범위를 만족하면 상기 제1 출구를 개방하여 상기 생장 원료를 상기 농장시설 및/또는 상기 미생물 배양 장치에 공급하는 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 고농도 용액은 이산화탄소 흡수액이고, 상기 미생물 배양 장치에 공급되는 상기 생장원료는 탄산수인 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서, 상기 제2 용액은 태양 연못의 바닥층에서 공급되는 용액인 에너지 자립형 스마트 팜 시스템."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "염분차 발전에 기반한 스마트 팜 시스템이 개시된다. 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설과 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 및 여과액비로 이루어진 그룹에서 선택된 적어도 하 나를 포함하는 고농도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상 기 저농도 용액의 농도차를 이용하여 전기를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 공급하는 염 분차 발전장치를 포함한다."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 팜 시스템에 관한 것으로, 보다 상세하게는 염분차 발전에 기반한 에너지 자립형 스마트 팜 시스템에 관한 것이다."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "물-에너지-식량 넥서스는 물, 에너지, 식량 자원의 연계성을 파악하고, 자원을 효율적으로 이용하기 위한 통합 관리 기술을 의미한다. 물-에너지-식량 넥서스에서 중심이 되는 스마트 팜은 온실의 환경과 작물의 생육 상태에 대한 실시간 센싱 정보를 기반으로 최적의 환경조건 유지 및 양액 제어를 통해 작물의 생산성 및 품질을 향상하 고자 하는 농업 ICT 융합기술이다. 더 넓은 의미의 스마트 팜은 노지 농업, 수경재배, 시설원예, 축산 등 농· 축산업 분야에서 농·축산물 생산, 유통, 소비의 전주기적 과정에 ICT 융합 기술을 적용하고 이를 통해 농촌의 삶의 질 향상을 도모하는 농업 형태까지를 포함한다. 시설의 운영 및 관리를 위해 에너지가 많이 소모되는 스마트 팜의 특성상 전체 시스템의 효율성을 확보하기 위 해서는 스마트 팜의 에너지 공급이 자립적이고 안정적으로 이루어져야 하며, 환경친화적으로 생장 원료의 공급 이 이루어질 수 있어야 한다. 따라서, 이와 같은 에너지 자립형 스마트 팜 시스템의 개발이 요구된다."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 염분차 발전을 이용하여 스마트 팜의 운용 관리에 필요한 에너지와 농작물의 종류에 따라 최적화된 생장원료를 맞춤형으로 공급할 수 있는 염분차 발전에 기반한 에너지 자립형 스마트 팜 시스템을 제공하고자 한 다."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예들에 따른 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 및 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 및 여과액비로 이루어진 그룹에서 선택된 적어도 하나를 포함하는 고농 도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상기 저농도 용액의 농도차를 이용하여 전기를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 공급하는 염분차 발전장치를 포함할 수 있다. 본 발명의 실시예들에 따른 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 및 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나를 포함 하는 고농도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상기 저농도 용액의 농도차를 이용하여 전기를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 공급하는 염분차 발 전장치를 포함하는 염분차 발전장치 및 상기 전기 및 생장원료의 일부가 공급되는 미생물 배양 장치를 포함할 수 있다. 본 발명의 실시예들에 따른 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 및 상기 농장 시설 내의 개별 농작물 주변의 토양 또는 수경 재배액 상에 설치되고, 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나를 포함하는 고농도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상기 저농도 용액의 농도차를 이용하여 전기 를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 공급하며, 상기 고농도 용액과 상기 저농도 용액은 각 각 이동형으로 교체 가능한 캡슐 형태로 공급되는 염분차 발전 장치를 포함할 수 있다. 본 발명의 실시예들에 따른 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 여과 오폐수, 음식물 폐 기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나를 포함하 는 고농도 용액과 상기 고농도 용액보다 농도가 낮은 저농도 용액을 공급받아 상기 고농도 용액과 상기 저농도 용액의 농도차를 이용하여 전기를 생성하고, 상기 농작물의 생장에 사용되는 생장원료를 공급하는 염분차 발전 장치, 고농도 염수와 상기 고농도 용액 중 어느 하나와 상기 저농도 용액을 공급받아 전기를 생성하는 대용량 염분차 발전장치, 및 상기 염분차 발전장치 및 상기 대용량 염분차 발전장치에서 생성된 전기를 저장하고, 상기 농장 시설에 상기 전기를 공급하는 에너지 저장 시스템을 포함할 수 있다."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 스마트 팜 시스템은 담수와 폐자원 또는 비료 용액의 농도차를 이용하여 전기를 생산함과 동 시에 농작물 생장에 적합한 농도의 생장원료를 공급할 수 있다. 따라서 스마트 팜 시스템은 에너지 자립을 실현 할 수 있으며, 농작물의 생장을 효율적으로 도울 수 있어, 물-에너지-식량 넥서스 문제를 해결할 수 있다. 따라 서, 스마트 팜 시스템은 스마트 팜 프랜차이즈 사업, 친환경 도시, 항노화가 기능화된 도시, 대규모 친환경 물- 에너지-폐기물 자립형 스마트 도시 등에 적용될 수 있다."}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 태양전지 패널 및 염분차 발전 장치(역전기투석 발전 장치)와 관련하여 따로 언급되지 않는 구성요소 들은 종래"}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "에 사용되어 오는 것이라면, 당해 기술분야에 속하는 통상의 전문가가 그 사용 목적 및 조건에 따라 적절하게 선택하여 사용할 수 있다. 또한, 본 명세서 전체에서 '연결, 설치, 장착' 이라 함은, 볼트와 너트 등을 이용하"}
{"patent_id": "10-2019-0174321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여 고정 연결시키는 것을 의미하며, 볼트와 너트뿐만 아니라, 본 기술분야의 통상의 지식을 가진 자가 연결부재 를 적절히 선택하여 사용할 수 있다. 도 1은 본 발명의 일 실시예에 따른 에너지 자립형 스마트 팜 시스템의 구성도이다. 도 1을 참고하면, 제1 실시예의 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 저농도 용 액과 고농도 용액을 이용하여 발전하는 염분차 발전장치, 전기를 저장하는 에너지 저장 시스템, 중앙제 어장치를 포함한다. 염분차 발전장치는 저농도 용액 공급부 및 고농도 용액 공급부와 연결되고 중앙제어장치에 의 해 제어된다. 농장 시설은 일반적인 개방형 농장 시설이거나, 온실과 같은 건축물일 수 있다. 농장 시설은 온도, 습 도, 광량, 풍향, 풍속, 식물 성장 등을 감지하는 각종 센서를 적어도 하나 이상을 포함하고, 농장 시설(1 0)의 운용 및 통신이 가능한 전자기계장치를 포함한다. 센서는 토양 또는 수경 재배액에 부착되어 습도, 온도, pH, 영양도 등을 감지하는 센서와, 온실 내부의 광 량을 감지하는 센서와, 농작물에 부착되어 농작물의 성장을 모니터링하는 센서 등을 포함할 수 있다. 전자기계 장치는 온도 조절을 위한 냉/난방기와, 환기를 위한 배기 팬과, 관수 제어를 위한 기계, 광 공급 을 위한 조명장치, 중앙제어장치와 통신할 수 있는 장비 등을 포함할 수 있다. 저농도 용액(담수) 공급부는 담수원으로부터 얻은 저농도 용액)(0.005~1.0wt%)을 이송하는 제1 배관(L1)과, 제1 배관(L1)에 설치된 제1 펌프(P1)를 포함할 수 있다. 담수원은 일반 담수, 지하수, 수도물, 하수 방류수, 강 물, 일반 농업용수, 세척수, 냉각수 및 이들의 혼합용액 중 선택되는 적어도 어느 하나 이상을 포함할 수 있으나 이에 한정되는 것은 아니다. 고농도 용액 공급부는 고농도 용액(1.0~50.0wt%)을 이송하는 제2 배관(L2)과, 제2 배관(L2)에 설치된 제2 펌프(P2)를 포함할 수 있다. 고농도 용액은 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나이고 해수가 아닌 고농도 용액일 수 있다. 여과액비는 폐 커피 추출액, 깻묵 발효액, 청초액비, 솎음열배 이용 발효액, 청초깻묵액비, 당밀액비, 막거리액 비, 발효액비, 한방액비, 달걀껍질 이용 칼슘액비, 김치액비, 우유액비, 미생물액비, 생선액비, 축산분료 액비 및 기타 유기액비 등의 여과액일 수 있다. 비료액은 일반적인 화학 비료의 액으로서, UREA, NH4NO3, NH4Cl, Ca(NO3)2, NH4H2PO4, NaNO3, KNO3, (NH4)2SO4, KH2PO4, (NH4)2HPO4, K2SO4, 및 KCl 중 적어도 하나를 포함할 수 있다. 염분차 발전장치는 제1 및 제2 배관(L1, L2)에 연결되어 저농도 용액과 고농도 용액을 공급받고, 저농도 용 액과 고농도 용액의 농도차를 이용하여 전기를 생산하며, 생장원료(희석 양액 또는 탄산수)를 배출하여 농장 시 설의 작물에 공급한다. 구체적으로 생장원료는 농장 시설의 토양 또는 수경재배액으로 공급되어 작 물에 공급될 수 있다. 염분차 발전장치는 역전기투석(Reverse ElectroDialysis, RED) 장치일 수 있다. 역전기투석 장치는 양이온 교환막과 음이온 교환막이 번갈아 배열된 셀 스택과, 셀 스택의 양쪽 끝에 배치된 전극(산화 전극과 환원 전 극)을 포함한다. 셀 스택에 고농도 용액과 저농도 용액이 공급되면, 음이온이 음이온교환막측으로 이동하고 양 이온이 양이온교환막측으로 이동하면서 전위차가 발생하며, 전극 상에서 산화·환원 반응에 의해 전자의 흐름이 생기면서 발전이 이루어진다. 전극에서 전자의 흐름을 만들기 위해서는 산화·환원 반응 외에도 축전식 이온 탈 ·흡착 방식을 이용할 수도 있다. 일반적으로, 역전기투석 방식은 물이 분리막을 통해 이동하면서 전기를 생산 하는 압력지연삼투 방식에 비해 원리상 분리막 표면에 오염 발생 정도가 낮아 염분차발전을 위해 사용되는 고농 도 용액 및 저농도 용액에 대한 전처리 에너지 비용도 낮출 수 있어, 염분차발전의 장기 안정성 및 에너지효율 측면에서 유리한 장점을 갖는다. 염분차 발전장치에서 생산된 전기는 에너지 저장부에 모두 저장되거나, 에너지 저장부와 농장 시설 및 중앙제어장치 에 나누어 공급될 수 있다. 에너지 저장부는 염분차 발전장치에서 생산된 전 기를 저장하고, 센서와 전자기계 장치 및 중앙제어장치에 전기를 공급한다. 염분차 발전장치는 저농도 용액과 고농도용액의 큰 농도차로 인해 농장 시설의 운용에 필요한 충분한 양의 전기를 생산할 수 있다. 중앙제어장치는 센서, 전자기계장치 및 염분차 발전장치와 전기적으로 연결되며, 미리 설정된 프로그램에 의해 센서의 감지 신호에 따라 염분차 발전장치의 구동을 제어한다. 구체적으로, 중앙제어 장치는 제1 펌프(P1)와 제2 펌프(P2)의 작동을 제어하여 염분차 발전장치로 공급되는 저농도용액과 고 농도용액이 유량을 정밀하게 제어하거나, 염분차발전기의 동작 자체를 온/오프할 수도 있다. 또한, 중앙제 어장치는 각종 센서로부터 얻은 빅데이터를 무선으로 전송 받을 수도 있다. 또한, 중앙제어장치는 인공 지 능 기반을 생장 환경의 빅데이터를 분석하고 이를 제어에 다시 적용하는 인공 지능 기반 중앙 제어 장치일 수 있다. 또한, 중앙제어장치는 분석 및 모니터링 된 데이터를 사용자의 휴대용 제어장치와 상호 통신할 수 있다. 고농도 용액은 농도가 1wt% 내지 50wt% 범위에 속하는 고농축 용액이다. 따라서, 염분차 발전장치를 통해 농도가 낮아진 상태로 배출된 생장 원료라 하더라도 농작물에 바로 공급하기에 농도가 높을 수 있다. 이럴 경우 에는 농작물 생장 원료를 희석하여 농작물에 공급해야 한다. 생장 원료 희석 공급부는 염분차 발전장치(2 0)와 농장 시설에 연결 설치된 제3 배관(L3)과, 제3 배관(L3)에 설치된 농도 측정기 및 삼방향 밸브 와, 삼방향 밸브의 제2 출구(OP2)와 제2 배관(L2)에 연결 설치된 제4 배관(L4)을 포함할 수 있다. 삼방향 밸브는 생장 원료 용액이 유입되는 입구(IP)와, 농장 시설을 향하는 제1 출구(OP1)와, 제4 배관 (L4)에 접속된 제2 출구(OP2)를 포함한다. 삼방향 밸브는 농도 측정기의 측정 결과에 따라 제1 출구 (OP1)와 제2 출구(OP2) 중 어느 하나가 개방되어 희석된 농작물 생장 원료 용액의 공급 방향을 제어한다. 예를 들어, 중앙제어장치에는 농작물마다 최적의 농도 범위가 미리 설정되어 있고, 농도 측정기는 제3 배관(L3)을 흐르는 농작물 생장 원료의 농도를 측정하여 측정 신호를 중앙처리장치에 출력할 수 있다. 중앙제어장치는 측정 신호를 설정 범위와 비교하여 측정 신호가 설정 범위를 만족할 때 삼방향 밸브의 제1 출구(OP1)를 개방하여 생장 원료가 농작물에 공급되도록 할 수 있다. 한편, 중앙제어장치는 측정 신호 가 설정 범위를 만족하지 않을 때 삼방향 밸브의 제2 출구(OP2)를 개방하여 생장 원료를 제2 배관(L2)으로 이송할 수 있다. 제2 배관(L2)으로 이송된 생장 원료는 고농도 용액과 섞여 염분차 발전장치로 다시 공급된 다. 종래의 염분차 발전장치의 경우에는 담수와 해수를 염분차 발전의 원료로 사용하였으나 해수를 공급하기 위 해서는 해안가와 인접해야 한다는 한계가 있다. 또한, 해수에 포함된 다량의 NaCl 염은 농작물에 피해를 줄 수 있어 사용이 상당히 제한적일 수 있다. 반면, 본 발명의 제1 실시예에 따를 경우 농장 시설 주변에 있는 다 양한 비료 및 폐기물 또는 이들 폐기물로부터 얻어진 원료를 사용하기 때문에 농장시설의 설치 위치에 제한이 없다. 특히 농장 시설 주변의 정화조로부터 얻어진 여과 오폐수, 음식물 쓰레기 처리장으로부터 얻어진 음식물폐 기물 산발효액, 연소 배기 시설의 연소 배기 가스로부터 배출되는 이산화탄소를 흡수하는 이산화탄소 포집 플랜 트로부터 얻어진 이산화탄소 흡수액, 축사의 분뇨로부터 얻어진 여과 액비와 같은 폐자원이나 주변에서 쉽게 구 할 수 있는 비료를 해수 대신 사용하고 지하수, 수도물, 하수 방류수, 강물, 저수지 및 기타 농업용수로부터 얻 어진 담수를 사용하여 염분차 발전장치를 통해 에너지로 전환함과 동시에 식물 생장에 사용되는 생장원료를 동시에 생성할 수 있다. 따라서, 스마트 팜 시스템은 기피, 혐오 시설을 활용하여 에너지 자립을 실현할 수 있고 농작물의 생장을 효과적으로 조절할 수 있으며 폐기물의 선순환 구조를 완성할 수 있다. 즉, 환경과 에너지 문제를 동시에 해결 하여 스마트 팜 프랜차이즈 사업, 친환경 도시, 항노화가 기능화된 도시, 대규모 친환경 물-에너지-폐기물 자립 형 스마트 도시, 대규모 친환경 물-에너지-식량 자립형 스마트 도시 등에 적용될 수 있다. 도 2 내지 도 4는 본 발명의 제1 실시예에 따른 스마트 팜 시스템의 다양한 변형 실시예들을 나타낸다. 도면의 간단한 도시를 위해서 농장 시설, 에너지 저장부, 중앙제어장치, 및 농장 시설은 블랙 박스 형태로 도시하고 무선통신신호는 도시를 생략한다. 그리고, 고농도 용액으로는 액비를 예를 들어 설명 한다. 도 2를 참조하면, 제1 변형예(100A)는 전술한 제1 실시예의 구성을 기본으로 하면서 염분차 발전장치의 전 단에 위치하는 정삼투 유닛을 더 포함한다. 정삼투 유닛은 반투과막에 의해 분리된 제1 유로(CH1) 와 제2 유로(CH2)를 포함한다. 저농도 용액(담수) 공급부는 담수원으로부터 얻은 담수를 염분차 발전장치로 이송하는 제1 배관(L1)과, 제1 배관(L1)에 설치된 제1 펌프(P1)와, 담수원으로부터 얻은 담수를 정삼투 유닛의 제2 유로(CH2)에 공급 하는 제5 배관(L5)과, 제5 배관(L5)에 설치된 제3 펌프(P3)를 포함할 수 있다. 액비 공급부는 액비를 정삼투 유닛의 제1 유로(CH1)에 공급하는 제2 배관(L2)과, 제2 배관(L2)에 설치 된 제2 펌프(P2)를 포함할 수 있다. 정삼투 유닛의 제1 유로(CH1)에 액비가 공급되고, 제2 유로(CH2)에 담수가 공급되면, 액비와 담수의 삼투압 에 의해 담수에 포함된 물이 반투과막을 통과하여 제1 유로(CH1)로 이동한다. 그 결과 제1 유로(CH1)의 출 구로 1차 희석 비료 용액이 배출되고, 제2 유로(CH2)의 출구로 담수가 배출된다. 제1 유로(CH1)에서 배출된 1차 희석 비료 용액은 염분차 발전장치로 공급되고, 제2 유로(CH2)에서 배출된 담수는 제1 배관(L1)으로 이송되어 다시 염분차 발전장치에 공급된다. 염분차 발전장치는 담수와 1차 희석 비료 용액의 농도차를 이용하여 전기를 생산하며, 2차 희석 비료 용액을 배출하여 농작물에 공급한다. 농도 측정기는 2차 희석 비료 용액의 농도를 측정하고, 측정 농도가 설정 범위를 만족하면 삼방향 밸브(6 2)의 제1 출구(OP1)가 개방되어 2차 희석 비료 용액이 농작물로 공급된다. 반대로 측정 농도가 설정 범위를 만 족하지 않으면 삼방향 밸브의 제2 출구(OP2)가 개방되고, 2차 희석 비료 용액은 제2 배관(L2)으로 이송되어 액비와과 섞인 후 다시 정삼투 유닛에 공급된다. 중앙제어장치는 센서부와 염분차 발전장치 및 정삼투 유닛을 제어하며, 미리 설정된 프로그램 에 의해 센서부의 감지 신호에 따라 염분차 발전장치와 정삼투 유닛의 구동을 제어한다.구체적으로, 중앙제어장치는 제1 펌프 내지 제3 펌프(P1, P2, P3)에 전기적으로 연결될 수 있다. 중앙제어 장치는 제2 펌프(P2)와 제3 펌프(P3)의 작동을 제어하여 정삼투 유닛으로 공급되는 액비와 담수의 유량 을 정밀하게 제어할 수 있다. 또한, 중앙제어장치는 정삼투 유닛의 제1 유로(CH1)에서 배출되는 1차 희 석 비료 용액의 유량에 따라 제1 펌프(P1)의 작동을 제어하여 염분차 발전장치로 공급되는 담수의 유량을 정밀하게 제어할 수 있다. 도 3을 참조하면, 제2 변형예(100B)는 정삼투 유닛이 염분차 발전장치의 후단에 위치하는 것을 제외하 고 전술한 제제1 변형예(도 2의 100A)와 유사한 구성으로 이루어진다. 정삼투 유닛은 반투과막에 의해 분리된 제1 유로(CH1)와 제2 유로(CH2)를 포함한다. 저농도 용액(담수) 공급부는 담수원으로부터 얻은 담수를 염분차 발전장치로 이송하는 제1 배관(L1)과, 제1 배관(L1)에 설치된 제1 펌프(P1)와, 담수원으로부터 얻은 담수를 정삼투 유닛의 제2 유로(CH2)에 공급 하는 제5 배관(L5)과, 제5 배관(L5)에 설치된 제3 펌프(P3)를 포함할 수 있다. 액비 공급부 액비를 염분차 발전장치에 공급하는 제2 배관(L2)과, 제2 배관(L2)에 설치된 제2 펌프(P 2)를 포함할 수 있다. 염분차 발전장치는 담수와 액비의 농도차를 이용하여 전기를 생산하고, 1차 희석 비료 용액을 배출하여 정 삼투 유닛의 제1 유로(CH1)에 공급한다. 정삼투 유닛에서는 1차 희석 비료 용액과 담수의 삼투압에 의 해 담수에 포함된 물이 반투과막을 통과하여 제1 유로(CH1)로 이동한다. 그 결과 제1 유로(CH1)의 출구로 2 차 희석 비료 용액이 배출되고, 제2 유로(CH2)의 출구로 담수가 배출된다. 제1 유로(CH1)에서 배출된 2차 희석 비료 용액은 농장 시설의 농작물로 공급되고, 제2 유로(CH2)에서 배출된 담 수는 제5 배관(L5)으로 이송되어 다시 정삼투 유닛에 공급된다. 농도 측정기는 2차 희석 비료 용액의 농도를 측정하고, 측정 농도가 설정 범위를 만족하면 삼방향 밸브(6 2)의 제1 출구(OP1)가 개방되어 2차 희석 비료 용액이 농작물로 공급된다. 반대로 측정 농도가 설정 범위를 만 족하지 않으면 삼방향 밸브의 제2 출구(OP2)가 개방되고, 2차 희석 비료 용액은 제2 배관(L2)으로 이송되어 액비와 섞인 후 다시 염분차 발전장치에 공급된다. 중앙제어장치는 센서부와 염분차 발전장치 및 정삼투 유닛을 제어하며, 미리 설정된 프로그램 에 의해 센서부의 감지 신호에 따라 염분차 발전장치와 정삼투 유닛의 구동을 제어한다. 구체적으로, 중앙제어장치는 제1 펌프(P1)와 제2 펌프(P2)의 작동을 제어하여 염분차 발전장치로 공급 되는 담수와 액비의 유량을 정밀하게 제어할 수 있다. 또한, 중앙제어장치는 염분차 발전장치에서 배출 되는 1차 희석 비료 용액의 유량에 따라 제3 펌프(P3)의 작동을 제어하여 정삼투 유닛으로 공급되는 담수의 유량을 정밀하게 제어할 수 있다. 도 4를 참고하면, 제3 변형예(100C)는 전술한 제1 실시예의 구성을 기본으로 하면서 두 개의 염분차 발전장치 (20A, 20B)를 포함하며, 염수 공급부와 정삼투 유닛을 더 포함한다. 두 개의 염분차 발전장치(20A, 20B)는 제1 염분차 발전장치(20A)와 제2 염분차 발전장치(20B)를 포함한다. 염수 공급부는 염수원으로부터 얻은 염수를 이송하는 제6 배관(L6)과, 제6 배관(L6)에 설치된 제4 펌프(P 4)를 포함할 수 있다. 염수원은 산업 폐염수, 해수, 및 인공 염수 중 적어도 하나를 포함할 수 있다. 염수의 농 도는 담수의 농도보다 높고, 액비의 농도보다 낮다. 염수의 농도는 대략 2wt% 내지 7wt%의 범위에 속할 수 있다. 정삼투 유닛은 반투과막에 의해 분리된 제1 유로(CH1)와 제2 유로(CH2)를 포함한다. 액비 공급부의 제2 배관(L2)은 정삼투 유닛의 제1 유로(CH1)에 연결되고, 염수 공급부의 제6 배관(L6)은 정삼투 유닛 의 제2 유로(CH2)에 연결된다. 정삼투 유닛의 제1 유로(CH1)에 액비가 공급되고, 제2 유로(CH2)에 염수가 공급되면, 액비와 염수의 삼투압 에 의해 염수에 포함된 물이 반투과막을 통과하여 제1 유로(CH1)로 이동한다. 그 결과 제1 유로(CH1)의 출 구로 1차 희석 비료 용액이 배출되고, 제2 유로(CH2)의 출구로 농축 염수가 배출된다. 저농도 용액(담수) 공급부는 담수원과 연결된 제1 배관(L1)과, 제1 배관(L1)으로부터 분기된 제1 분기관 (L11) 및 제2 분기관(L12)과, 제1 배관(L1)에 설치된 제1 펌프(P1)와, 제1 분기관(L11)에 설치된 제1 밸브(V 1)와, 제2 분기관(L12)에 설치된 제2 밸브(V2)를 포함할 수 있다. 제1 분기관(L11)은 제1 염분차 발전장치(20A)에 연결되고, 제2 분기관(L12)은 제2 염분차 발전장치(20B)에 연결된다. 저농도 용액(담수) 공급부의 구성은 전술한 예시로 한정되지 않으며, 제1 및 제2 염분차 발전장치(20A, 20B)로 담수를 나누어 공급할 수 있는 구성이면 모두 적용 가능하다. 제1 염분차 발전장치(20A)는 제1 배관(L1) 및 제1 분기관(L11)으로부터 담수를 공급받고, 정삼투 유닛에서 배출된 농축 염수를 공급받으며, 담수와 농축 염수의 농도차에 의해 전기를 생산한다. 제1 염분차 발전장치 (20A)는 희석 염수를 배출하며, 희석 염수는 다시 염수원으로 공급될 수 있다. 제2 염분차 발전장치(20B)는 제1 배관(L1) 및 제2 분기관(L12)으로부터 담수를 공급받고, 정삼투 유닛에서 배출된 1차 희석 비료 용액을 공급받으며, 담수와 1차 희석 비료 용액의 농도차에 의해 전기를 생산한다. 제2 염분차 발전장치(20B)는 2차 희석 비료 용액을 배출하며, 2차 희석 비료 용액은 농장 시설의 농작물로 공급 된다. 농도 측정기는 2차 희석 비료 용액의 농도를 측정하고, 측정 농도가 설정 범위를 만족하면 삼방향 밸브(6 2)의 제1 출구(OP1)가 개방되어 2차 희석 비료 용액이 농작물로 공급된다. 반대로 측정 농도가 설정 범위를 만 족하지 않으면 삼방향 밸브의 제2 출구(OP2)가 개방되고, 2차 희석 비료 용액은 제2 배관(L2)으로 이송되어 액비와과 섞인 후 다시 정삼투 유닛으로 공급된다. 에너지 저장부는 제1 및 제2 염분차 발전장치(20A, 20B)에서 생산된 전기를 저장하고, 센서부와 전자기 계 장치 및 중앙제어장치에 전기를 공급한다. 중앙제어장치는 센서부, 정삼투 유닛, 제1 및 제2 염분차 발전장치(20A, 20B)에 전기적으로 연결되며, 미리 설정된 프로그램에 의해 센서부의 감지 신 호에 따라 제1 및 제2 염분차 발전장치(20A, 20B)와 정삼투 유닛의 구동을 제어한다. 구체적으로, 중앙제어장치는 제2 펌프(P2)와 제4 펌프(P4)의 작동을 제어하여 정삼투 유닛으로 공급되 는 액비와과 염수의 유량을 정밀하게 제어할 수 있다. 중앙제어장치는 정삼투 유닛에서 배출되는 농축 염수의 유량에 따라 제1 펌프(P1)와 제1 밸브(V1)의 작 동을 제어하여 제1 염분차 발전장치(20A)로 공급되는 담수의 유량을 정밀하게 제어할 수 있다. 또한, 중앙제어 장치는 정삼투 유닛에서 배출되는 1차 희석 비료 용액의 유량에 따라 제1 펌프(P1)와 제2 밸브(V2)의 작동을 제어하여 제2 염분차 발전장치(20B)로 공급되는 담수의 유량을 정밀하게 제어할 수 있다. 제3 변형예(100C)는 정삼투 유닛과 제2 염분차 발전장치(20B)를 이용하여 농작물로 공급되는 비료 용액의 농도를 조절할 수 있으며, 제1 및 제2 염분차 발전장치(20A, 20B)를 이용하여 농장 시설의 에너지 자립을 실현 할 수 있다. 도 5는 본 발명의 제2 실시예에 따른 스마트 팜 관리 시스템을 나타낸다. 도 5를 참조하면, 제2 실시예에 따른 스마트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 저농 도 용액 담수와 고농도 용액을 이용하여 발전하는 염분차 발전장치, 전기를 저장하는 에너지 저장 시스템 , 중앙제어장치, 미생물 배양이 이루어지는 미생물 배양 장치, 미생물 배양 장치로부터 유용 자원을 회수하는 유용자원회수장치를 포함한다. 농장 시설은 일반적인 개방형 농장 시설이거나, 온실과 같은 건축물일 수 있다. 농장 시설은 온도, 습 도, 광량, 풍향, 풍속, 식물 성장 등을 감지하는 각종 센서를 적어도 하나 이상을 포함하고, 농장 시설(1 0)의 운용 및 통신이 가능한 전자기계장치를 포함한다. 농장 시설 내의 센서는 토양 또는 수경 재배액에 부착되어 습도, 온도, pH, 영양도 등을 감지하는 센서와, 온실 내부의 광량을 감지하는 센서와, 농작물에 부착되어 농작물의 성장을 모니터링하는 센서 등을 포함할 수 있다. 미생물 배양 장치 내의 센서는 미생물 배양 장치 내에 배치되어 내부온도를 측정하는 온도 센서, 미세조류 배양조의 pH를 측정하는 pH 센서, DO 센서, 탁도 센서, 미세조류 배양조의 광량을 측정하는 광 센서, PO43--P 센서, NH3-N 센서, NO3--N 센서 습도, 온도, pH, 영양분의 농도, 광량, 탄산수 농도 등을 감지하는 센서일 수 있다. 농장 시설내의 전자기계 장치는 온도 조절을 위한 냉/난방기와, 환기를 위한 배기 팬과, 관수 제어를 위한 기계, 광 공급이 가능한 조명장치, 중앙제어장치와 통신할 수 있는 장비 등을 포함할 수 있다.미생물 배양 장치 내의 전자기계 장치는 미생물 배양 장치 내에 미생물(예., 미세조류)이 공급 되는 공급밸브, 유입수가 공급되는 유입수 공급밸브, 유입수와 방류수를 순환시키는 컴프레셔, 미세조류 배양조 내부의 온도를 조절하는 보일러 또는 히터, 미세조류 배양조를 교반시키는 교반기를 포함할 수 있다. 저농도 용액(담수) 공급부는 담수원으로부터 얻은 저농도 용액을 이송하는 제1 배관(L1)과, 제1 배관(L1)에 설치된 제1 펌프(P1)를 포함할 수 있다. 담수원은 지하수, 수도물, 하수 방류수, 강물, 저수지 및 기타 농업용 수 중 적어도 하나를 포함할 수 있다. 고농도 용액 공급부는 고농도 용액을 이송하는 제2 배관(L2)과, 제2 배관(L2)에 설치된 제2 펌프(P2)를 포 함할 수 있다. 고농도 용액은 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나이고 해수가 아닌 고농도 용액일 수 있다. 여과액비는 폐 커피 추출액, 깻묵 발효액, 청초액비, 솎음열배 이용 발효액, 청초깻묵액비, 당밀액비, 막거리액 비, 발효액비, 한방액비, 달걀껍질 이용 칼슘액비, 김치액비, 우유액비, 미생물액비, 생선액비, 축산분료 액비 및 기타 유기액비 등의 여과액일 수 있다. 비료액은 일반적인 화학 비료의 액으로서, UREA, NH4NO3, NH4Cl, Ca(NO3)2, NH4H2PO4, NaNO3, KNO3, (NH4)2SO4, KH2PO4, (NH4)2HPO4, K2SO4, 및 KCl 중 적어도 하나를 포함할 수 있다. 염분차 발전장치는 제1 및 제2 배관(L1, L2)에 연결되어 저농도 용액과 고농도 용액을 공급받고, 저농도 용 액과 고농도 용액의 농도차를 이용하여 전기를 생산하며, 생장원료(희석 양액 또는 탄산수)를 배출하여 농장 시 설의 작물과 미생물 배양장치에 공급한다. 특히, 이산화탄소 흡수액을 고농도 용액으로 공급할 경우 전기 발생량을 증가시키면서 희석된 고농도 용액의 배 출수 또는 농축된 저농도 용액의 배출수 중 미생물 배양에 적합한 조건의 농도에 맞는 용액을 제어하여 미생물 배양장치에 탄산수를 탄소원으로 공급할 수 있다. 예를 들면 미생물이 남조류인 경우 남조류는 절대적 광 합성 독립영양균 (photoautotrophs)으로서 탄소원으로 탄산수를 사용하여 소량의 미량 원소만 존재하면 대기 중 질소가스를 고정하여 단시간에 대량의 바이오에너지 재료물질(biomass)을 생산할 수 있다. 염분차 발전장치는 역전기투석(Reverse ElectroDialysis, RED) 장치일 수 있다. 역전기투석 장치는 양이온 교환막과 음이온 교환막이 번갈아 배열된 셀 스택과, 셀 스택의 양쪽 끝에 배치된 전극(산화 전극과 환원 전 극)을 포함한다. 셀 스택에 고농도 용액과 저농도 용액이 공급되면, 음이온이 음이온교환막측으로 이동하고 양 이온이 양이온교환막측으로 이동하면서 전위차가 발생하며, 전극 상에서 산화·환원 반응에 의해 전자의 흐름이 생기면서 발전이 이루어진다. 전극에서 전자의 흐름을 만들기 위해서는 산화·환원 반응 외에도 축전식 이온 탈 ·흡착 방식을 이용할 수도 있다. 일반적으로, 역전기투석 방식은 물이 분리막을 통해 이동하면서 전기를 생산 하는 압력지연삼투 방식에 비해 원리상 분리막 표면에 오염 발생 정도가 낮아 염분차발전을 위해 사용되는 고농 도 용액 및 저농도 용액에 대한 전처리 에너지 비용도 낮출 수 있어, 염분차발전의 장기 안정성 및 에너지효율 측면에서 유리한 장점을 갖는다. 염분차 발전장치에서 생산된 전기는 에너지 저장부에 모두 저장되거나, 에너지 저장부와 농장 시설 , 미생물배양장치 및 중앙제어장치 에 나누어 공급될 수 있다. 에너지 저장부는 염분차 발전 장치에서 생산된 전기를 저장하고, 센서(11, 211)와 전자기계 장치, 미생물배양장치 및 중앙제어 장치에 전기를 공급한다. 염분차 발전장치는 저농도용액과 고농도용액의 큰 농도차로 인해 농장 시설 과 미생물 배양 장치의 운용에 필요한 충분한 양의 전기를 생산할 수 있다. 중앙제어장치는 센서(11, 211), 전자기계장치(12, 212) 및 염분차 발전장치와 전기적으로 연결되며, 미 리 설정된 프로그램에 의해 센서(11, 211)의 감지 신호에 따라 염분차 발전장치의 구동을 제어한다. 구체적 으로, 중앙제어장치는 제1 펌프(P1)와 제2 펌프(P2)의 작동을 제어하여 염분차 발전장치로 공급되는 저 농도용액과 고농도용액이 유량을 정밀하게 제어하거나, 염분차발전기의 동작 자체를 온/오프할 수도 있다. 또한, 중앙제어장치는 각종 센서로부터 얻은 빅데이터를 무선으로 전송 받을 수도 있다. 또한, 중앙제어장치 는 인공 지능 기반을 생장 환경의 빅데이터를 분석하고 이를 제어에 다시 적용하는 인공 지능 기반 중앙 제 어 장치일 수 있다. 또한, 중앙제어장치는 분석 및 모니터링 된 데이터를 사용자의 휴대용 제어장치와 상호 통신할 수 있다.고농도 용액은 농도가 1wt% 내지 50wt% 범위에 속하는 고농축 용액이다. 따라서, 염분차 발전장치를 통해 농도가 낮아진 상태로 배출된 생장 원료라 하더라도 농작물 또는 미생물에 바로 공급하기에 농도가 높을 수 있 다. 이럴 경우에는 생장 원료를 희석하여 공급해야 한다. 생장 원료 희석 공급부는 염분차 발전장치와 농장 시설에 연결 설치된 제3 배관(L3)과, 제3 배관(L3)에 설치된 농도 측정기 및 삼방향 밸브와, 삼방향 밸브의 제2 출구(OP2)와 제2 배관(L2)에 연결 설치된 제4 배관(L4)을 포함할 수 있다. 삼방향 밸브는 생장 원료 용액이 유입되는 입구(IP)와, 농장 시설을 향하는 제1 출구(OP1)와, 제4 배관 (L4)에 접속된 제2 출구(OP2)를 포함한다. 삼방향 밸브는 농도 측정기의 측정 결과에 따라 제1 출구 (OP1)와 제2 출구(OP2) 중 어느 하나가 개방되어 생장 원료 용액의 공급 방향을 제어한다. 예를 들어, 중앙제어장치에는 농작물 또는 미생물마다 최적의 농도 범위가 미리 설정되어 있고, 농도 측정 기는 제3 배관(L3)을 흐르는 생장 원료의 농도를 측정하여 측정 신호를 중앙처리장치에 출력할 수 있다. 중앙제어장치는 측정 신호를 설정 범위와 비교하여 측정 신호가 설정 범위를 만족할 때 삼방향 밸브의 제1 출구(OP1)를 개방하여 생장 원료가 농작물 또는 미생물에 공급되도록 할 수 있다. 한편, 중앙제어장치 는 측정 신호가 설정 범위를 만족하지 않을 때 삼방향 밸브의 제2 출구(OP2)를 개방하여 생장 원료를 제2 배관(L2)으로 이송할 수 있다. 제2 배관(L2)으로 이송된 생장 원료는 고농도 용액과 섞여 염분차 발전장치 로 다시 공급된다. 한편, 미생물 배양 장치에서 미생물을 대량으로 배양하는 단계에서는, 미생물 배양 장치의 온도, 탄 산수의 농도, 기타 다른 영양분의 농도는 센서를 통해 중앙제어장치로 전달된다. 인공지능기반의 중앙 제어장치는 센서로부터 전달된 생장환경 빅 데이터를 분석하여 최적의 환경과 최적의 운전 조건을 분석 한 후, 이에 기초하여 미생물 배양 장치의 운전시스템인 전자기계장치를 제어하여 최소의 에너지를 소비하 면서 미생물 배양의 최적 조건을 유지할 수 있도록 한다. 그리고, 미생물 배양 장치에서 생산되는 미생물의 양을 센서를 통해 센싱한 후 그 결과가 중앙제어장 치로 송신되면 중앙제어장치에서 미생물의 양이 정해진 값을 초과하는지를 판단한다. 미생물의 양이 정 해진 값을 초과하면 중앙제어장치는 전자기계장치 중 배수 밸브 장치를 오픈하도록 제어하여 미생물 배양액을 유용자원 회수장치로 이동시킨다. 유용자원 회수장치는 미생물 배양액 중 미생물 만을 수거 하는 장치이며, 배양물에 부유하는 미생물을 긁어 모으거나, 필터링 방식을 사용할 수 있으며, 이러한 공정은 자동화될 수 있다. 수거된 미생물은 바이오리파이너리(bio-refinery) 기술을 통해 유용자원으로 최종 가공될 수 있다. 유용자원은 의약, 식품, 및 기타 미생물을 이용한 다양한 서비스(모발관리, 피부관리, 외 모 증진 등의 서비스)가 될 수 있다. 즉, 역전기투석 장치에 의한 염분차발전을 활용함으로써 미생물(미세조류)이 생장하는데 필요한 영양분을 공급 함과 동시에 에너지를 회수할 수 있다. 즉, 미생물(미세조류)의 생장 환경을 모니터링 하는데 필요한 센서 등을 구동하는데 필요한 에너지를 시스템에서 자체적으로 공급할 수 있다. 이러한 방식의 에너지 공급은 미생물(미세 조류) 생장 시스템을 분산 전원에 의한 운전이 가능하게 하여, 별도의 전력망에 연결하는 수고를 덜어주며, 미 생물(미세조류) 생장 시스템을 유기적으로 조정하여 최적의 조건을 유지하면서 미생물(미세조류)의 대량 생산이 가능하게 할 수 있다. 이렇게 생산된 미생물(미세조류)를 이용하여 항노화 신약 또는 건강 보조식품을 대량 생 산할 수 있게 된다. 결과적으로 폐자원을 활용하여 값비싼 유용 자원을 생산하는 경제적 생산이 가능하게 된다. 제1 실시예와 마찬가지로, 역전기투석 장치로 이루어진 염분차 발전 장치를 활용하여 폐자원을 에너지로 전환함 과 동시에 농작물 및 미생물의 생장에 사용되는 생장원료를 동시에 생성할 수 있으므로 스마트 팜 시스템 은 기피, 혐오 시설을 활용하여 에너지 자립을 실현할 수 있고 농작물 및 미생물의 생장을 효과적으로 조절할 수 있으며 폐기물의 선순환 구조를 완성할 수 있다. 즉, 환경과 에너지 문제를 동시에 해결하여 스마트 팜 프랜 차이즈 사업, 친환경 도시, 항노화가 기능화된 도시, 대규모 친환경 물-에너지-폐기물 자립형 스마트 도시, 대 규모 친환경 물-에너지-식량 자립형 스마트 도시 등에 적용될 수 있다. 도 6은 본 발명의 제3 실시예에 따른 스마트 팜 시스템을 나타낸다. 도 6을 참조하면, 제3 실시예에 따른 스마트 팜 시스템은 농장 시설 내에 작물 생장 실시간 모니터링 용 발전/통신 일체형 염분차 발전 장치를 포함한다. 독립형 염분차 발전 장치에 캡슐에 담긴 담수와 여과 오폐수, 음식물 폐기물 산 발효액, 이산화 탄소 흡수액, 여과액비 및 비료액으로 이루어진 그룹에서 선택된 적어도 하나를 유입하면 염분차 발전 장치 에서 발전과 동시에 생장원료가 생성된다. 특히 여과액비 또는 비료액을 사용할 경우 희석 비료 용액이 생 성된다. 독립형 염분차 발전 장치에서 생성된 전기는 농작물별로 설치된 센서와 염분차 발전 장치에 설치 된 센서에 전달된다. 농작물에 설치된 센서는 개별 농작물별 생장 상태(생리활성, 생리장해등)를 실시 간으로 모니터링하기 위한 센서이고, 염분차 발전 장치에 설치된 센서는 농장 시설 내의 환경(온 도, 습도, 이산화탄소 농도, 일사량, 수온, pH 등)을 실시간으로 모니터링하기 위한 센서이다. 작물 센서에서 수집된 정보는 인공지능 기반의 중앙제어장치로 유·무선 방식의 통신을 통해 전달되면 중앙제어장치에서 빅 데이터 기반의 분석을 통해 재배 작물의 생육상태, 수확량, 수확시기 등을 정확하게 예측하고 제어할 수 있으며, 염분차 발전 장치에 설치된 센서에서 수집된 환경 정보를 분석하고 이에 근거 하여 농장 시설 내에 설치된 전자기계장치를 제어하여 농장 시설내의 환경을 작물의 성장에 최적화 된 상태로 운용한다. 그리고, 중앙제어장치에 전달된 모든 정보는 모바일 단말기로 전달하여 사용자가 언제든지 확인할 수 있도록 할 수 있다. 독립형 염분차 발전 장치에서 생성된 희석 비료는 토양 또는 수경 재배액의 삼투압에 따라 자동으로 공급 될 수 있다. 제3 실시예에 따른 스마트 팜 시스템에 따르면 식물 생장 모니터링 시스템의 센서(11, 211)가 외부 전원에 연결 되지 않고도 염분차 발전 장치를 독립적인 전원으로 사용하여 운용이 가능하다. 따라서 대형 농장 등에 효 과적으로 적용할 수 있다. 도 7은 본 발명의 제4 실시예에 따른 스마트 팜 시스템을 나타낸다. 도 7을 참조하면, 제4 실시예에 따른 스마 트 팜 시스템은 농작물 재배가 이루어지는 농장 시설, 대용량 염분차 태양에너지 복합 발전 시스템 , 전기를 저장하는 에너지 저장 시스템 및 중앙제어장치를 포함한다. 대용량 염분차 태양에너지 복합 발전 시스템은 대용량 염분차 태양에너지 복합 발전 장치(1001, 1002, 또 는 1003)와 제1 용액 공급원과 제2 용액 공급원을 포함한다. 대용량 염분차 태양에너지 복합 발전 장치(1001, 1002, 또는 1003)는 이하 도 8 내지 도 22를 참고하여 상세히 설명한다. 제1 용액 공급원은 담수일 수 있으며, 제2 용액 공급원은 태양 연못의 바닥층인 고농도 염수층(약 80°C, 30wt%의 포화되어 있는 대류층)일 수 있다. 그러나, 이들은 공급원의 가장 대표적인 것을 에시하고 있을 뿐이며 제2 용액 공급원 으로는 제1 내지 제2 실시예에서 사용한 고농도 용액인 여과 오폐수, 음식물 폐기물 산 발효액, 이산화탄 소 흡수액(1.3~50.0wt%), 여과액비, 비료용액(1.0~50.0wt%), 염수(7.0wt% 이상) 및 이들의 혼합용액 중 선택되 는 적어도 어느 하나 이상을 포함할 수 있다. 대용량 염분차 태양에너지 복합 발전 장치(1001, 1002, 또는 1003) 에서 농도가 낮아져서 배출되는 용액은 다시 제1 용액 공급원으로 농도가 높아져서 배출되는 용액은 제2 용액 공급원인 태양 연못의 중간층(밀 도가 포화상태인 23wt% 에 이르기까지 약 1m 깊이에 걸쳐 나뉘어져 비대류특성을 갖는 층)으로 이송된다. 대용량 염분차 태양에너지 복합 발전 장치(1001, 1002, 1003)는 태양광 발전을 이용하여 전기에너지를 생산 및 이 때, 생산되는 온수를 역전기투석(RED) 장치로 공급함으로써, 역전기투석(RED) 장치 운전 시 발생하는 전기화 학적 위치에너지를 보다 효율적으로 생산하여, 다시 말해 이온의 분리 이동이 원활히 발생하여, 전기생산을 향 상시킬 수 있는, 태양광 및 태양열 발전과 염분차 발전이 동시에 가능한 염분차 태양에너지 복합 발전 장치에 관한 것이다. 도 8 및 도 9는 염분차 태양에너지 복합 발전 장치의 제1 실시예의 사시도 및 측면도, 도 10은 염분차 태양에너 지 복합 발전 장치의 제1 실시예의 제1 용액 유입부 및 제1 유입 부재를 설명하기 위해 나타낸 분해 사시도 및 배면도, 도 11은 염분차 태양에너지 복합 발전 장치의 제1 실시예의 분해 사시도, 도 12 및 도 13은 염분차 발 전 유닛을 설명하기 위한 사시도 및 개략도이다. 도 8 내지 도 13에 나타낸 바와 같이, 염분차 태양에너지 복합 발전 장치의 제1 실시예는 태양전지 패널 및 염분차 발전 유닛을 포함한다. 태양전지 패널은, 수광부를 갖는 제1 면 및 제1 면의 반대방향의 제2 면을 포함한다. 여기서, 상기 제1 면의 수광부는 태양전지 패널이 빛을 받아 전기를 생산할 수 있는 영역을 의미한다. 특히, 도 10의 (b)를 참조하면, 상기 제2 면의 적어도 일부 영역은 방열 부재를 추가로 포함할 수 있다. 상기 방열 부재는, 방열 효율을 상승시키기 위해 방열 면적을 넓게 하는 구조로 형성될 수 있으며, 일 예로, 제2 면에서 돌출되도록 형성되는 핀이나 히트파이브 구조일 수 있으나, 이에 한정되는 것은 아 니다. 또한, 염분차 발전 유닛은, 제1 용액과 제2 용액이 유입하여 염분차 발전을 통해 전기를 생산할 수 있다. 제1 및 제2 용액은 각각 제1 용액 공급원(도 7의 2100 참조) 및 제2 용액 공급원(도 7의 2200참조)에서 공급된 것이다. 보다 구체적으로, 도 11 내지 도 13을 참조하면, 상기 염분차 발전 유닛은 제1 용액 유입포트 및 유출포트, 제2 용액 유입포트 및 유출포트를 갖는 하우징을 포함한다. 하우징은 하우징 내에 배치되고, 소정간격 떨어져 마련된 애노드 전극 및 캐소드 전극과 애노드 전극 및 캐소드 전극 사이에 배열된 복수 개의 이온교환막을 포함한다. 상기 복수 개의 이온교환막은, 애노드 및 캐소드 전극(1220, 1230) 사이에 제1 용액이 유동하는 제1 유로 및 제2 용액이 유동하는 제2 유로를 구획하도록 배열될 수 있다. 여기서, 상기 복수 개의 이온교환막은 양이온 교환막(C), 음이온 교환막(A)을 포함하며, 상기 양이온 교 환막(C)과 음이온 교환막(A)은 교번하여 배치될 수 있다. 따라서, 복수 개의 이온교환막이 배열된 상기 하우징 내부에는 각각 복수 개의 제1 유로 및 제2 유로가 형성될 수 있다. 보다 구체적으로, 본 발명의 제1 실시예에 따른 염분차 발전 유닛의 하우징은, 제1 용액 유입포트 , 제2 용액 유입포트 및 제1 용액 유출포트 및 제2 용액 유출포트가 각각 마련된 제1 내지 제4 프레임(1201,1202,1203,1204)을 포함한다. 또한, 상기 애노드 및 캐소드 전극(1220, 1230)을 각각 감싸도록 마련된 제5 및 제6 프레임(1205,1206)을 포함 한다. 도 11을 참조하면, 하우징은 일 예로, 육면체로 형성될 수 있으며 제1 내지 제4 프레임 (1201,1202,1203,1204)은 하우징의 옆면을 형성하고, 제5 및 제6 프레임(1205,1206)은 각각 상면 및 하 면을 형성할 수 있다. 보다 구체적으로, 제1 프레임은은 제1 용액 유입포트를 포함할 수 있다. 또한, 제2 프레임은 제2 용액 유입포트를 포함할 수 있다. 또한, 제3 프레임은 제1 용액 유출포트를 포함할 수 있다. 또한, 제4 프레임은 제2 용액 유출포트를 포함할 수 있다. 여기서, 상기 제1 내지 제6 프레 임은 상호 연결함으로써, 하우징을 형성할 수 있다. 또한, 상기 제5 및 6 프레임은, 제5 및 제6 프레임(1205,1206) 사이에 마련되는 제1 및 제2 유로(241,242)를 유 동하는 제1 및 제2 용액이 유출되지 않도록 마련된 실링 가스켓을 각각 추가로 포함할 수 있다. 또한, 상기 제3 프레임은, 애노드 및 캐소드 전극(1220,1230) 측으로 전극용액 즉, 전해질을 공급 및 배 출하기 위한 전해질 유입포트 및 유출포트(1271,1272)를 각각 추가로 포함할 수 있다. 여기서, 상기 전해질을 공급하기 위한 전해질 공급원(미도시)이 추가로 포함될 수 있다. 또한, 제3 프레임은, 애노드 및 캐소드 전극(1220,1230)에서 생산되는 전기 콜렉터(collector)로써 전극 봉을 추가로 포함할 수 있다. 따라서, 상기 전극봉은 애노드 및 캐소드 전극(1220,1230)과 각각 연결 구비될 수 있도록 제3 프레임 상, 하단에 각각 마련될 수 있다. 특히, 상기 전극봉은 제3 프레임 바깥 측으로 돌출되도록 형성됨으로써, 생산된 전기를 외부로 공 급할 수 있다. 한편, 도 9를 참조하면, 상기 하우징은, 제1 용액 유입포트 및 제1 유로를 유체 이동 가능하 게 연결하는 제1 용액 유입부를 포함한다. 또한, 상기 제1 용액 유입부는 유입된 제1 용액 및 태양전지 패널의 제2 면 사이에 열교환이 이루 어지도록 마련될 수 있다. 보다 구체적으로, 본 발명의 제1 용액 유입부는, 제1 용액이 유입되는 공간(S)을 형성하는 적어도 일면이 태양전지 패널의 제2 면일 수 있다. 상기 태양전지 패널의 제2 면과 제1 용액 유입포트를 갖는 제1 프레임은 제1 용액이 유입되는 공간(S)을 형성하도록 상호 연결되게 마련될 수 있다. 특히, 상기 제1 프레임은, 제2 면의 모서리 둘레 영역을 따라 맞닿게 연결될 수 있으며, 제1 용액 이 유입되는 공간(S)을 형성하도록 소정 두께(T)를 갖도록 형성될 수 있다. 따라서, 상기 제1 용액이 제1 용액 유입부로 유입되면, 제1 용액은 태양전지 패널의 제2 면에 접촉 할 수 있다. 즉, 상기 제1 용액이 제1 용액 유입포트를 통하여 제1 용액 유입부로 유입되면, 제1 용액은 제2 면 에 접촉하게 된다. 상기 태양전지 패널의 제2 면은, 태양전지 패널의 제1 면의 수광부에서 받은 빛에 의해 온도가 상 승된 상태이므로, 상기와 같이 유입된 제1 용액과의 열교환을 통해 태양전지 패널을 냉각시킴으로써 태양 전지 패널의 성능을 상승시키는 효과를 갖게 된다. 이에 따라, 상기와 같이 유입된 제1 용액은 태양전지 패널 제2 면에 의해 온도가 상승하게 된다. 처음 유입된 제1 용액보다 온도가 상승된 제1 용액은, 제1 유로로 유입될 수 있다. 상기와 같은 접촉에 의해 제1 용액은, 제1 용액과 제2 면의 온도 차에 의해 제1 용액 유입부에서 대류가 발생할 수 있다. 한편, 본 발명의 염분차 발전 유닛은, 제1 용액 유입부로 유입된 제1 용액을 제1 유로로 분 배함과 동시에, 제1 용액이 제2 유로로 유입되지 않고, 전체 복수개의 이온교환막에 균일하게 분배 되도록 마련된 제1 유입 부재를 추가로 포함한다. 보다 구체적으로, 제1 유입 부재는 제1 용액 유입부와 복수 개의 이온교환막 사이에 마련될 수 있다. 상기 제1 유입 부재는, 제1 용액이 통과하여 제1 유로로 유입될 수 있도록 형성된 소정 크기를 갖는 복수 개의 홀을 갖을 수 있다. 일 예로, 상기 제1 유입 부재는, 다공판일 수 있으나 이에 한정되는 것은 아니다. 특히, 상기 제1 유입 부재는, 복수 개의 제1 홀(1261a)을 갖는 제1 다공판과 제1 홀보다 작 은 크기의 제2 홀(1262a)을 갖는 제2 다공판을 포함한다. 즉, 제1 홀(1261a)은 제2 홀(1262a) 보다 큰 크기의 홀을 갖는다. 상기 제1 용액 유입부를 기준으로, 제1 다공판과 제2 다공판은 차례로 배치될 수 있다. 상기와 같이 제1 용액을, 보다 큰 크기의 제1 홀(1261a)을 통과한 후 작은 홀의 제2 홀(1262a)을 통과하게 함으 로써, 보다 효율적으로 빠르게 그리고 균일하게 제1 용액이 제1 유로로 유입될 수 있다. 여기서, 상기 제1 유입부재는 상기와 같이 제1 다공판 및 제2 다공판을 포함하고 있으나, 이에 한정되는 것이 아니고, 제1 다공판 만을 포함할 수도 있고, 제3 다공판을 추가하여 포함할 수 있음을 이해하여야 한다. 한편, 본 발명의 제1 유로 및 제2 유로를 유동하는 제1 용액과 제2 용액의 염분차에 의해, 제2 용 액에 포함된 이온성물질이 복수 개의 이온교환막을 선택적으로 이동하며 전기를 생산할 수 있다. 보다 구체적으로, 도 13을 참조하면, 상기 제1 용액 유입부에서 유입된 제1 용액과 제2 용액 유입포트 를 통해 유입된 제2 용액은 각각 제1 및 제2 유로(1241,1242)를 유동할 때, 제1 용액보다 높은 염 농도를 갖는 제2 용액에 포함된 이온성물질, 즉, 양이온성 물질과 음이온성 물질이 양이온 교환막(C) 및 음이온 교환막 (A)을 선택적으로 통과함에 따라 전위차가 발생하여 애노드 전극 및 캐소드 전극(1220, 1230)에서 각각 산화반 응 및 환원반응이 발생하며 전자의 흐름이 생성되어 전기를 생산할 수 있게 된다. 일 예로, 상기 양이온성 물질은 나트륨 이온(Na+), 음이온성 물질은 염소이온(Cl-)일 수 있으나, 이에 한정되는 것은 아니다. 도 12의 (b)를 참조하면, 상기 복수 개의 이온교환막은, 제1 유로와 제2 유로를 형성하기 위 한, 스페이서 및 가스켓를 추가로 포함할 수 있다. 상기 스페이서와 가스켓(1243,1244)은 복수 개의 양이온교환막(C)과 음이온교환막(A)에 각각 구비될 수 있다. 도 12의 (a)에 나타낸 바와 같이, 양 말단에 형성된 애노드 및 캐소드 전극(1220,1230) 사이에 각각 스페이서와 가스켓(1243,1244)을 포함하는 양이온교환막(C)과 음이온교환막(A)이 교번하여 차례로 적층하여 배열함으로써, 제1 유로 및 제2 유로(1241,1242)가 형성될 수 있게 된다. 도 14 및 도 15는 염도차 태양에너지 복합 발전 장치의 제2 실시예의 사시도 및 측면도, 도 16은 염도차 태양에 너지 복합 발전 장치의 제2 실시예의 분해 사시도를 나타낸다. 도 14 및 도 15를 참조하면, 염분차 태양에너지 복합 발전 장치의 제2 실시예는, 제1 용액을 제1 유로 측 으로 전달하도록 제1 용액 유입부와 제1 유입 부재를 유체 이동 가능하게 연결하는 제1 연결 유로 를 추가로 포함할 수 있다. 보다 구체적으로, 전술한 바와 같이, 제1 용액 유입부로 유입된 제1 용액은, 태양전지 패널의 제2 면과 접촉한 후, 온도가 상승되어 제1 연결 유로를 통해 제1 유로로 유입될 수 있다. 도 16과 같이, 제1 용액 유입부가 제1 연결 유로를 포함하는 경우, 제1 유입부는 제5 프레임 과 맞닿게 연결 구비될 수 있다. 이에 따라, 제1 프레임은, 제2 내지 제4 프레임(1202,1203,1204) 일측면과 맞닿도록 연결 구비될 수 있다. 염분차 태양에너지 복합 발전 장치의 제1 또는 제2 실시예(1001,1002)를 이용하여 전기를 생산하는 과정을 도 8 내지 도 16을 참조하여 설명하면 다음과 같다. 먼저, 도 8 및 도 14에 도시된 바와 같이, 태양전지 패널의 수광부를 갖는 제1 면으로 태양광이 입 사되면, 입사된 태양광에 의해 전기가 생산된다. 이 때, 전기가 생산됨과 동시에 제1 면으로 입사된 태양광에 의해 제1면의 온도가 상승하고, 이에 따른 전도에 의해 제2 면은 온도가 상승하게 된다. 제1 용액 유입포트를 통해 제1 용액 유입부로 유입된 제1 용액은, 상기와 같이 온도가 상승된 제2 면과 접촉하게 되고, 접촉된 제1 용액은 온도가 상승하게 된다. 즉, 태양전지 패널은 제1 용액에 의해 냉각됨에 따라, 태양광을 이용하여 전기를 생산함에 있어서, 효율 이 향상된다. 상기와 같이 온도가 상승된 제1 용액은 제1 유입 부재를 통과하여 제1 유로로 유입된다. 상기와 같이 제1 유로로 제1 용액이 유입될 때, 제2 용액은 제2 용액 유입포트를 통해 제2 유로 로 유입된다. 상기와 같이 유입된 제1 및 제2 용액은 제1 및 제2 유로(1241,1242)를 유동하게 되고 제1 및 제2 용액의 염 농 도차에 의해 전기가 생산될 수 있다. 즉, 제1 용액보다 높은 염 농도를 갖는 제2 용액에 포함된 양이온성 물질 및 음이온성 물질이 양이온교환막(C) 과 음이온교환막(A)을 선택적으로 이동함에 따라 전위차가 발생하게 되어 전기가 생산될 수 있다. 도 17을 참조하면, 상기와 같이 온도가 상승된 제1 용액을 제1 유로로 유입시킴으로써, 제2 용액의 이온 성물질의 이동 속도가 상승하게 되어 전력 생산량이 향상되게 된다. 실험에서 고농도 용액은 해수 3.5wt.%에 상 당하는 NaCl 염 모사 용액을, 저농도 용액은 민물 0.005wt.%에 상당하는 NaCl 염 모사 용액을 각각 100cc/min의 양으로 공급하였다. 사용된 분리막은 한국에너지기술연구원에서 제작한 KIER 분리막이다. 결과로부터, 고농도 용액 측의 온도 상승보다는 저농도 용액측의 온도 상승에 의한 출력밀도 향상이 큰 것으로 나타났다. 이것은 염 분차발전이 태양광 패널과의 복합 발전시, 태양광 패널의 온도 상승에 따른 성능 저감을 극복하기 위해 염분차 발전으로 공급되는 고농도 용액 또는 저농도 용액을 태양광 패널의 냉각에 적용할 때, 고농도 용액 보다는 저농 도 용액을 활용하는 것이 더 유리 (출력 향상 측면)할 수 있다는 것을 보여준다. 또한, 태양광 패널의 안정성(염에 의한 부식 등의 대한 안정성 측면)을 고려할 때도, 고농도 용액 보다는 저농도 용액을 활용한 태양광 패 널의 냉각에 의한 성능 향상과 염분차발전 소스의 온도 상승에 따른 성능 향상 모두를 도모하는 것이 유리한 것으로 판단된다. 도 17을 참조하면, 상기와 같이 전력을 생산하는 경우, 일반적인 역전기투석발전 장치에 비해 대략 20% 이상의 전력 생산 출력이 상승될 수 있다. 도 17에 나타낸 바와 같이, 제1 유로로 20℃의 온도를 갖는 제1 용액이 유입되는 경우 최대 전력 밀도는 이온교환막 단위면적당 1.4(W/m2)으로 측정 되었으나, 본 발명과 같이 온도를 상승시켜 50℃의 온도를 갖는 제1 용액을 유입시키는 경우 최대 전력 밀도는 이온교환막 단위면적당 1.7(W/m2)로 측정되었다. 즉, 상기와 같이 전 력 밀도가 상승됨을 확인할 수 있었다. 상기와 같이 전기를 생산한 후 제1 및 제2 용액은 각각의 유출포트(1211,1213)로 배출될 수 있다. 도 18 및 도 19는 염분차 태양에너지 복합 발전 장치의 제3 실시예의 사시도 및 측면도, 도 20 내지 도 22는 염분차 태양에너지 복합 발전 장치의 제3 실시예를 설명하기 위해 나타낸 사시도들이다. 염분차 태양에너지 복합 발전 장치의 제3 실시예는, 전술한 제1 및 제2 실시예에 따른 염분차 태양에너지 복합 발전 장치 (1001,1002)에서 태양전지 패널이 한 개 더 추가된 구성을 나타낸다. 따라서, 이하에서는 전술한 염분차 태양에너지 복합 발전 장치 (1001,1002)와 동일한 구성요소 및 그 작동에 대 해서는 설명을 생략하기로 한다. 먼저, 도 18을 참조하면, 염분차 태양에너지 복합 발전 장치의 제3 실시예 는, 제1 수광부를 갖는 제1 면 및 제1 면의 반대방향의 제2 면을 갖는 제1 태양전지 패널을 포함한다. 이에 더하여, 제2 수광부를 갖는 제1 면 및 제1 면의 반대방향의 제2 면을 갖는 제2 태양전지 패널 을 포함한다. 또한, 제1 용액과 제2 용액이 유입하여 염분차 발전을 통해 전기를 생산하기 위한 염분차 발전 유닛을 포 함한다. 보다 구체적으로, 상기 염분차 발전 유닛 은 제1 용액 유입포트 및 유출포트(1210,1211), 제2 용액 유입 포트 및 유출포트(1212,1213)를 갖는 하우징을 포함한다. 또한, 하우징 내에 배치되고, 소정간격 떨어져 마련된 애노드 및 캐소드 전극(1220,1230)을 포함하고, 애 노드 및 캐소드 전극(1220,1230) 사이에 제1 용액이 유동하는 제1 유로 및 제2 용액이 유동하는 제2 유로 를 구획하도록 배열된 복수 개의 이온교환막을 포함한다. 여기서, 상기 복수 개의 이온교환막은 양이온교환막(C) 및 음이온교환막(A)을 포함한다. *또한, 하우징은, 제1 용액 유입포트 및 제1 유로를 유체 이동 가능하게 연결하는 제1 용액 유입부를 갖을 수 있다. 특히, 제1 용액 유입부는 제1 용액의 유동 방향을 따라, 제1 용액 및 제1 태양전지 패널의 제2 면 사이에 열 교환이 이루어지고, 차례로 제1 용액 및 제2 태양전지 패널의 제2 면 사이에 열 교환이 이루어지도록 마련될 수 있다. 여기서, 제1 용액 유입부는 제1 용액 유입포트와 연결된 제1 유입부 및 제1 유입부 및 제1 유로를 연결하는 제2 유입부를 포함한다. 즉, 제1 용액이 제1 유입부로 유입되면, 제1 태양전지 패널의 제2 면에 접촉한 후 제1 용액의 유동 방향 을 따라, 제2 유입부로 유입되어 제2 태양전지 패널의 제2 면에 접촉할 수 있다. 여기서, 제1 용의 유동 방향은 제1 유입부의 길이방향을 따라 유동한 후, 제2 유입부로 유입되어 유동될 수 있다. 상기 제2 유입부는, 제1 유입부에서 유동된 제1 용액이 유입되는 유입포트를 포함할 수 있다. 따라서, 상기 제1 용액은, 제1 유입부로 유입된 후 유입포트를 통해 제2 유입부로 유입될 수 있다. 또한, 상기 제1 및 제2 태양전지 패널은 제2 면(1012,1120)의 적어도 일부 영역에 마련된 방열 부재를 각 각 추가로 포함할 수 있다.이에 더하여, 염분차 발전 유닛 은, 제2 유입부에 배치되고, 제1 용액을 제1 유로로 분배함과 동시 에, 제1 용액이 제2 유로로 유입되지 않도록 마련된 제1 유입 부재를 추가로 포함한다. 또한, 제1 유로 및 제2 유로를 유동하는 제1 용액과 제2 용액의 염분차에 의해, 제2 용액에 포함된 이온성물질이 복수 개의 이온교환막을 선택적으로 이동하며 전기를 생산할 수 있다. 한편, 상기 제1 용액은 제1 및 제2 유입부(1251,1252) 각각에서, 제1 및 제2 태양전지 패널 각각의 제2 면 (1012,1120)에 의해 온도가 상승될 수 있다. 보다 구체적으로, 제1 유입부는, 제1 용액이 유입되는 공간(S1)을 형성하는 적어도 일면이 제1 태양전지 패널의 제2 면일 수 있다. 또한, 제2 유입부는, 제1 용액이 유입되는 공간(S2)을 형성하는 적어도 일면이 제2 태양전지 패널의 제2 면일 수 있다. 따라서, 제1 용액 유입포트로 유입된 제1 용액은, 제1 유입부의 적어도 일면인 제1 태양전지 패널 의 제2면에 접촉하여 온도가 상승될 수 있다. 상기와 같이 온도가 상승된 제1 용액은, 유입포트를 통해 제2 유입부로 유입되어 제2 유입부(125 2)의 적어도 일면인 제2 태양전지 패널의 제2 면에 접촉하여 한번 더 온도가 상승될 수 있다. 상기와 같이 온도가 상승된 제1 용액은 전술한 바와 같이, 제1 유로로 유입되어 염분차 발전이 보다 효율적으로 이뤄질 수 있게 된다. 이 때, 상기와 같이 유입된 제1 용액에 의해 냉각된 제1 및 제2 태양전지 패널(1010,1100) 각각은 냉각효과에 의해 전기 생산 효율이 향상될 수 있다. 상기와 같은 구성으로 이루어진 염분차 태양에너지 복합 발전 장치 제3 실시예를 이용하여 전기를 생산하 는 과정을 도 19를 참조하여 설명하면 다음과 같다. 먼저, 태양전지 패널의 수광부를 갖는 제1 면으로 태양광이 입사되면, 입사된 태양광에 의해 전기 가 생산된다. 이 때, 전기가 생산됨과 동시에 제1 면으로 입사된 태양광에 의해 제1면의 온도가 상승하고, 이에 따른 전도에 의해 제2 면은 온도가 상승하게 된다. 제1 용액 유입포트를 통해 제1 유입부로 유입된 제1 용액은, 상기와 같이 온도가 상승된 제1 태양 전지 패널의 제2 면과 접촉하게 되고, 접촉된 제1 용액은 온도가 상승함과 동시에 제2 면은 온도가 하강하게 된다. 즉, 제1 태양전지 패널은 제1 용액에 의해 냉각됨에 따라, 태양광을 이용하여 전기를 생산함에 있어서, 효 율이 향상된다. 상기와 같이 온도가 상승된 제1 용액은 유입포트를 통해 제2 유입부로 유입된다. 이와 동시에, 태양전지 패널의 수광부를 갖는 제1 면으로 태양광이 입사되면, 입사된 태양광에 의 해 전기가 생산되고, 전기가 생산됨과 동시에 제1 면으로 입사된 태양광에 의해 제1 면의 온도가 상승하고, 이에 따른 전도에 의해 제2 면은 온도가 상승하게 된다. 제2 유입부로 유입된 제1 용액은, 상기와 같이 온도가 상승된 제2 태양전지 패널의 제2 면과 접촉 하게 되고, 접촉된 제1 용액은 온도가 보다 상승하게 됨과 동시에 제2 면의 온도는 하강하게 된다. 즉, 제2 태양전지 패널은 제1 용액에 의해 냉각됨에 따라, 태양광을 이용하여 전기를 생산함에 있어서, 효율이 향상된다. 상기와 같이 온도가 상승된 제1 용액은, 제1 유입 부재를 통과하여 제1 유로로 유입된다. 상기와 같이 제1 유로로 제1 용액이 유입될 때, 제2 용액 유입포트를 통해 제2 용액이 제2 유로로 유입된다. 상기와 같이 유입된 제1 및 제2 용액은 제1 및 제2 유로(1241,1242)를 유동하게 되고, 제1 및 제2 용액의 염분 차에 의해 전기가 생산될 수 있다.즉, 제1 용액보다 높은 염 농도를 갖는 제2 용액의 양이온성 물질 및 음이온성 물질이 양이온교환막(C)과 음이 온교환막(A)을 선택적으로 이동함에 따라 전위차가 발생하게 되어 전기가 생산될 수 있다. 특히, 상기와 같이 온도가 상승된 제1 용액을 제1 유로로 유입시킴으로써, 제2 용액의 이온성물질의 이동 속도가 상승하게 되어 전력 생산 효율이 향상되게 된다. 상기와 같이 전기를 생산한 후 제1 및 제2 용액은 각각의 유출포트(1211,1213)로 배출될 수 있다. 본 발명은, 또한 염분차 태양에너지 복합 발전 시스템을 제공한다. 예를 들어, 상기 염분차 태양에너지 복합 발전 시스템은, 전술한 염분차 태양에너지 복합 발전 장치를 이용한 시스템에 관한 것이다. 따라서, 후술하는 염분차 태양에너지 복합 발전 장치에 대한 구체적인 사항은 염분차 태양에너지 복합 발전 장 치(1001,1002,1003)에서 기술한 내용이 동일하게 적용될 수 있다. 도 20 내지 도 22를 참조하면, 상기 염분차 태양에너지 복합 발전 시스템은, 전술한 염분차 태양에너지 복 합 발전 장치(1001,1002,1003)가 복수 개 연결 구비되는 것을 포함한다. 또한, 염분차 태양에너지 복합 발전 장치 각각의 제1 용액 유입 포트로 제1 용액을 공급하도록 마련된 제1 용액 공급원를 포함한다. 또한, 염분차 태양에너지 복합 발전 장치 각각의 제2 용액 유입포트로 제2 용액을 공급하도록 마련된 제2 용액 공급원 를 포함한다. 상기와 같이 구성된 시스템을 이용함으로써, 보다 효율적으로 전력을 생산할수 있어 전력생산량을 향상시킬 수 있게 된다. 아래 표 1은 도 17을 참조하여 설명한 염분차 태양에너지 복합 발전 장치에 있어 온도 변화에 따른 복합발전 시 스템의 출력 향상율을 계산한 도표이다. 표 1 태양광 패널 패널 크기100X120X10 cm3 패널 초기온도/출력 (Wh)30oC 180 패널 냉각 후 온도/출력 (Wh)20oC 190.8 출력 향상 (%) 6% 냉각 효율 (물 기준) 70% 염분차발전 고농도용액 (3.5wt%)초기 온도 (염분차유입온도)20oC 출구 온도20~25oC 유량 12L/min 저농도용액 (0.005wt.%)초기 온도20oC 태양광 패털 통과 후 온도 (염분차유입온도)35oC 출구온도25~30oC 유량 12L/min 스택 크기100X100X20 cm3 분리막 KIER 250 cell 전극 Pt-Ti mesh 20o시 출력 (Wh)350 50o시 출력 (Wh)425 출력 향상 (%) 21.4% 표 1에서와 같이 저농도 용액 측의 온도가 20도에서 50도까지 상승할 때 염분차발전의 출력 밀도는 1.4에서 1.7W/m2로 증가하는 것으로 나타났다. 이것을 염분차발전 스택 100 X 100 X 20 cm3 (W X L X h)에 적용할 경우 (KIER 분리막 약 250 cell pairs), 출력양은 약 350에서 425Wh로 약 21.4% 증가하는 것으로 계산되었다. 이를 기반으로 도 14에서와 같이 염분차 태양에너지 복합 발전 장치 를 구성할 경우, 약 100 X 120 X 10 cm3 (W X L X h)의 태양전지 패널을 구성할 수 있으며, 냉각 효율을 약 70%로 가정할 때, 태양전지 패널의 온도가 30도에서 20도로 냉각될 경우 출력양은 180에서 약 191Wh로 약 6% 향상되는 것으로 나타났다. 본 실시예를 통해 염분차발 전의 공급 소스를 태양전지 패널의 냉각수로 활용할 경우, 염분차와 태양전지 발전 모두 성능이 향상되는 것으 로 나타났다. 그러므로, 염분차발전 스택의 크기, 공급량 등의 제어를 통한 태양전지 패널과의 복합 발전 구조 의 엔지니어링 설계를 통해 복합발전 장치의 발전량과 성능 향상율 제어를 최적화 할 수 있음을 알 수 있다.도 23은 발명의 제1 내지 제4 실시예에 따른 스마트 팜 시스템을 통합한 통합 시스템을 나타낸다. 본 발명에 따른 스마트 팜 통합 관리 시스템은 제1 및 제2 실시예에 따른 염분차 발전장치와 제3 실시 예에 따른 염분차 발전장치와 제4 실시예에 따른 제3 염분차 발전장치을 포함할 수 있다. 이들 염분 차 발전장치들(20, 320, 420)은 분산전원으로 사용이 가능하며 부하 변동이 적고 생성된 전기를 센서(11, 211, 311), 전자기계장치, 중앙제어장치 등에 공급하여 에너지 자립을 실현할 수 있다. 그리고, 각각의 센서(11, 211, 311)를 통해 수집된 정보는 중앙제어장치로 전달되고 중앙제어장치에서 는 인공 지능을 기반으로 하여 생장 환경의 빅데이터를 분석하고 이에 기초하여 작물 또는 미생물의 생장을 제 어한다. 따라서, 스마트 팜의 통합적인 운용 관리가 가능하며 고부가가치 스마트 팜의 구현이 가능하게 된다. 또한, 염분차 발전 장치의 원료로 농장 시설 주변의 정화조로부터 얻어진 여과 오폐수, 음식물 쓰레기 처리장으로부터 얻어진 음식물폐기물 산발효액, 연소 배기 시설의 연소 배기 가스로부터 배출되는 이산화탄소를 흡수하는 이산화탄소 포집 플랜트로부터 얻어진 이산화탄소 흡수액, 축사의 분뇨로부터 얻어진 여과 액비와 같 은 폐자원이나 주변에서 쉽게 구할 수 있는 비료를 해수 대신 사용하고 지하수, 수도물, 하수 방류수, 강물, 저 수지 및 기타 농업용수로부터 얻어진 담수를 사용하기 때문에 환경과 에너지 문제를 동시에 해결할 수 있다. 하기 표 2에 비료 용액의 종류에 따른 농도별 삼투압을 나타내었다. 표 2 1M 2M 3M 4M 5M NH4NO3 37 60 98 125 160 NH4Cl 44 90 140 180 235 Ca(NO3)2 50 110 170 240 320 NH4H2PO4 40 90 130 160 170 NaNO3 43 75 119 154 196 KNO3 40 60 80 100 105 (NH4)2SO4 50 100 150 200 230 KH2PO4 40 60 58 55 51 (NH4)2HPO4 20 50 65 83 102 K2SO4 30 29 28 27 26 KCl 50 80 130 180 230 KH2PO4 용액의 경우 농도가 높아질수록 삼투압이 상승 후 하강하는 경향을 보이며, K2SO4 용액의 경우 농도가 높 아질수록 삼투압이 낮아지는 경향을 보인다. KH2PO4 용액과 K2SO4 용액을 제외한 나머지 비료 용액의 경우, 농도 가 높아질수록 삼투압이 높아지는 경향을 보인다.도 24와 도 25는 각각 도 1에 도시한 스마트 팜 시스템에 고농 도 용액으로 사용되는 비료 성분의 종류 및 구성에 따른 염분차 발전장치의 에너지 밀도와 개회로 전압 (Open Circuit Voltage, OCV)을 나타낸 그래프이다. 실험에 사용된 비료 용액의 농도는 0.5M이고, 염분차 발전장치에 투입되는 비료와 담수의 유량은 모두 30cc/min 이다. KNO3 비료 용액의 경우 가장 높은 출력 밀도를 보이며, NaNO3 비료의 경우 가장 높은 OCV를 보이고 있다.여섯 가지 비료 모두에서 출력 밀도는 1.3W/m2 이상이며, OCV는 0.9V 이상이다. 도 26은 도 1에 도시한 스마트 팜 시스템 중 화학 비료 성분을 이용한 염분차 발전장치의 담수 유량 변화에 따 른 에너지 밀도를 나타낸 그래프이다. 실험에 사용된 비료 용액은 1M의 KNO3 용액이며, 염분차 발전장치에 투입되는 비료의 유량은 30cc/min이다. 염 분차 발전장치에 투입되는 담수의 유량을 10cc/min, 30cc/min, 50cc/min, 70cc/min로 변경하면서 에너지 밀도 를 측정하였다. 실험 결과, 비료 용액과 담수의 공급 유량이 30cc/min으로 동일할 때 2W/m2을 초과하는 최고의 출력 밀도를 나타낸다. 도 27은 도 1에 도시한 스마트 팜 시스템 중 폐 커피 용액을 비료 용액으로 사용하고 민물을 담수로 사용한 염 분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 실험에 사용된 비료 용액은 커피 폐기물로부터 추출한 비료 용액이며, 대략 3mS/cm의 전기 전도도를 가진다. 실 험에 사용된 담수는 일반적인 민물이며, 대략 0.0053mS/cm의 전기 전도도를 가진다. 염분차 발전장치에 투입되 는 비료 용액의 유량과 담수의 유량은 모두 30cc/min이다. 실험 결과, 염분차 발전장치는 0.3W/m2을 초과하는 출력 밀도를 나타낸다. 도 28은 도 1에 도시한 스마트 팜 시스템 중 KNO3를 비료 용액으로 사용하고 폐 커피 용액을 담수로 사용한 염 분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 실험에 사용된 비료 용액은 0.5M의 KNO3 용액이며, 대략 55mS/cm의 전기 전도도를 가진다. 실험에 사용된 담수 는 커피 폐기물로부터 추출한 용액이며, 대략 3mS/cm의 전기 전도도를 가진다. 염분차 발전장치에 투입되는 비 료 용액과 담수의 유량은 모두 30cc/min이다. 실험 결과, 염분차 발전장치는 0.04W/m2을 초과하는 출력 밀도를 나타낸다. 도 29는 도 1 또는 도 6에 도시한 스마트 팜 시스템 중 돼지 분료로부터 얻은 액비를 비료 용액으로 사용하고 민물을 담수로 사용한 염분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 실험에 사용된 액비 용액은 대략 6mS/cm의 전기 전도도를 가진다. 염분차 발전장치에 투입되는 액비 용액과 담 수의 유량은 모두 10cc/min이다. 실험 결과, 염분차 발전장치는 전극의 전해질이 ferri-/ferrocyanide일 때 0.2W/m2 정도였으며, 전극의 전해질을 비료의 종류인 Potassium nitrate를 사용할 경우에도 약 0.05 W/m2의 출 력 밀도를 나타낸다. 도 30은 도 1에 도시한 스마트 팜 시스템 중 이산화탄소 흡수액를 비료 용액으로 사용하고 민물을 담수로 사용 한 염분차발전장치의 이산화탄소 흡수액의 농도변화를 나타낸 그래프이다. 실험에 사용된 분리막은 한국에너지기술연구원에서 자체 생산한 KIER 분리막, Fujifilm 사의 분리막, Fumasep 사의 분리막을 5 cell pairs로 사용하였다. 고농도 (이산화탄소 흡수액)와 저농도 용액 (민물)의 유량은 모두 15cc/min이다. 결과에서 고농도 용액측의 이산화탄소 흡수액의 농도는 염분차발전 이후 감소했으며, 그 폭은 Fujifilm 사의 분리막에서 제일 높게 측정되었다. 제일 감소폭이 적었던 KIER 분리막의 경우 생산된 출력 밀도 는 약 0.02 W/m2 였다. 도 31은 도 1에 도시한 스마트 팜 시스템 중 이산화탄소 흡수액를 비료 용액으로 사용하고 민물을 담수로 사용 한 염분차 발전장치의 담수 용액의 농도변화를 나타낸 그래프이다. 도 31의 실험 조건에서 저농도 용액인 담수 측의 이산화탄소 증가율을 보여준다. 제일 농도 증가율이 높았던 Fujifilm 사의 분리막에서의 농도 증가 폭은 민물에 용해될 수 있는 이산화탄소의 용해도 대비 약 30%인 것으로 나타났다. 상기에서는 본 발명의 바람직한 실시예에 대하여 설명하였지만, 본 발명은 이에 한정되는 것이 아니고 특허청구 범위와 발명의 상세한 설명 및 첨부한 도면의 범위 안에서 여러 가지로 변형하여 실시하는 것이 가능하고 이 또 한 본 발명의 범위에 속하는 것은 당연하다.부호의 설명 *100, 200, 300, 400, 500: 스마트 팜 시스템 10: 농장 시설 11, 211, 311: 센서 12: 전자기계장치 20: 염분차 발전장치 20A: 제1 염분차 발전장치 20B: 제2 염분차 발전장치 30: 에너지 저장부 41: 저농도 용액 공급부 42: 농축 용액 공급부 43: 고농도 용액 공급부 50: 중앙제어장치 55: 사용자 모바일 단말 60: 희석 생장 원료 공급부 61: 농도 측정기 62: 삼방향 밸브 70: 정삼투 유닛 71: 반투과막 270: 미생물 배양 장치 280: 유용자원회수장치 290: 유용자원 320: 독립형 염분차 발전 장치 340: 캡슐 1001, 1002, 1003 : 대용량 염분차 태양에너지 복합 발전 장치 2100 : 제1 용액 공급원 2200: 제2 용액 공급원도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21 도면22 도면23 도면24 도면25 도면26 도면27 도면28 도면29 도면30 도면31"}
{"patent_id": "10-2019-0174321", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시예에 따른 스마트 팜 시스템의 구성도이다. 도 2 내지 도 4는 도 1에 도시된 스마트 팜 시스템의 변형예들이다. 도 5는 본 발명의 제2 실시예에 따른 스마트 팜 시스템의 구성도이다. 도 6은 본 발명의 제3 실시예에 따른 스마트 팜 시스템의 구성도이다. 도 7은 본 발명의 제4 실시예에 따른 스마트 팜 시스템의 구성도이다. 도 8 및 도 9는 염분차 태양에너지 복합 발전 장치의 제1 실시예를 나타내는 사시도 및 측면도 이다. 도 10은 염분차 태양에너지 복합 발전 장치의 제1 실시예의 제1 용액 유입부 및 제1 유입 부재를 설명하기 위해 나타낸 분해 사시도 및 배면도 이다. 도 11은 염분차 태양에너지 복합 발전 장치의 제1 실시예를 나타내는 분해 사시도이다. 도 12 및 도 13은 염분차 태양에너지 복합 발전 장치의 염분차 발전 유닛을 설명하기 위한 사시도 및 개략도이 다. 도 14 및 도 15는 염분차 태양에너지 복합 발전 장치의 제2 실시예를 나타내는 사시도 및 측면도 이다. 도 16은 염분차 태양열 복합 발전 장치의 제2 실시예를 나타내는 분해 사시도이다. 도 17은 도 7에 도시한 스마트 팜 시스템 중 염분차 태양에너지 복합 발전 장치를 통해 염분차 발전 장치의 담 수 및 염수 용액의 온도 변화에 따른 에너지 밀도를 나타낸 그래프이다. 도 18 및 도 19는 본 발명의 제3 실시예에 따른 염분차 태양에너지 복합 발전 장치의 사시도 및 측면도 이다. 도 20 내지 도 22는 본 발명의 일 실시예에 따른 염분차 태양에너지 복합 발전 시스템을 설명하기 위해 나타낸 사시도이다. 도 23은 본 발명의 제1 내지 제4 실시예에 따른 스마트 팜 시스템을 통합한 통합 시스템의 구성도이다. 도 24는 도 1에 도시한 스마트 팜 시스템 중 화학 비료 성분의 종류 및 구성에 따른 염분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 도 25는 도 1에 도시한 스마트 팜 시스템 중 염분차 발전장치의 개회로 전압(Open Circuit Voltage, OCV)을 나 타낸 그래프이다. 도 26은 도 1에 도시한 스마트 팜 시스템 중 화학 비료 성분을 이용한 염분차 발전장치의 담수 유량 변화에 따 른 에너지 밀도 변화를 나타낸 그래프이다. 도 27은 도 1에 도시한 스마트 팜 시스템 중 폐 커피 용액을 비료 용액으로 사용하고 민물을 담수로 사용한 염 분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 도 28은 도 1에 도시한 스마트 팜 시스템 중 KNO3를 비료 용액으로 사용하고 폐 커피 용액을 담수로 사용한 염 분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 도 29는 도 1 또는 도 6에 도시한 스마트 팜 시스템 중 돼지 분료로부터 얻은 액비를 비료 용액으로 사용하고 민물을 담수로 사용한 염분차 발전장치의 에너지 밀도를 나타낸 그래프이다. 도 30는 도 1에 도시한 스마트 팜 시스템 중 이산화탄소 흡수액를 비료 용액으로 사용하고 민물을 담수로 사용 한 염분차 발전장치의 이산화탄소 흡수액의 농도변화를 나타낸 그래프이다. 도 31은 도 1에 도시한 스마트 팜 시스템 중 이산화탄소 흡수액를 비료 용액으로 사용하고 민물을 담수로 사용 한 염분차 발전장치의 담수 용액의 농도변화를 나타낸 그래프이다."}
