{"patent_id": "10-2021-0192120", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0102185", "출원번호": "10-2021-0192120", "발명의 명칭": "인공 지능 기반의 철도 자산 관리 서버, 시스템 및 방법", "출원인": "주식회사 디메타", "발명자": "김영훈"}}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스피커 및 디스플레이 중 적어도 하나를 포함하는 출력부;적어도 하나의 카메라, 레이더 센서, 라이다 센서 및 초음파 센서를 포함하는 정보 획득부; 및상기 정보 획득부에서 획득된 데이터에 기초하여 적어도 하나의 철도 자산 상태 정보를 결정하고,상기 철도 자산 상태 정보가 출력되도록 상기 출력부를 제어하는 자산 관리부;를 포함하고,상기 자산 관리부는,상기 정보 획득부로부터 획득된 상기 데이터를 저장하는 메모리;상기 데이터 및 상기 데이터를 이용하여 생성된 상기 학습 데이터에 기초하여, 상기 적어도 하나의 철도 자산클래스를 식별하도록 학습된 인공 지능 모델; 및상기 식별된 철도 자산 클래스에 기초하여, 상기 적어도 하나의 철도 자산 각각의 상기 데이터의 획득 주기를결정하고,상기 결정된 획득 주기마다 획득된 상기 데이터에 기초하여, 상기 적어도 하나의 철도 자산을 모니터링하도록구성된 하나 이상의 프로세서;를 포함하는, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 결정된 획득 주기마다 획득된 상기 데이터에 기초하여, 상기 적어도 하나의 철도 자산 각각의 데이터의 유사도를 결정하고,상기 적어도 하나의 철도 자산 각각의 데이터의 유사도가 미리 결정된 값 미만인 경우, 경고 신호를 포함한 상기 철도 자산 상태 정보가 출력되도록 상기 출력부를 제어하는, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 학습 데이터 중 제1 학습 데이터는,상기 적어도 하나의 카메라를 통해 획득된 이미지 및 상기 이미지 내의 적어도 일부에 대해 라벨링(labeling)이수행된 전처리 데이터에 기초하여 생성되는, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 적어도 하나의 철도 자산 클래스에 가중치 정보를 매칭하고,상기 가중치 정보는,상기 레이더 센서, 상기 라이다 센서 및 상기 초음파 센서 각각에 대응되는 상기 데이터의 비율이 포함된 정보인, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0102185-3-제1항에 있어서,상기 메모리는,상기 레이더, 상기 라이다 및 상기 초음파 센서를 통해 획득되는 상기 데이터를 필터링하는 복수의 필터를 포함하고,상기 학습 데이터 중 제2 학습 데이터는,상기 데이터에서 상기 철도 자산의 존재 여부를 식별하기 위해 라벨링된 전처리 데이터에 기초하여 생성되는,철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 하나 이상의 프로세서는,상기 제2 학습 데이터에 기초하여 학습된 상기 인공 지능 모델을 통해 상기 복수의 필터의 대역폭을 결정하는,철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제2항에 있어서,상기 학습 데이터 중 제3 학습 데이터는,상기 적어도 하나의 철도 자산 클래스와 상기 유사도가 대응된 전처리 데이터에 기초하여 생성되고,상기 하나 이상의 프로세서는,상기 제3 학습 데이터에 기초하여 학습된 상기 인공 지능 모델을 통해 상기 데이터의 획득 주기를 결정하는, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 하나 이상의 프로세서는,상기 적어도 하나의 카메라가 획득한 이미지에 포함된 철도 자산에 대응되는 자산 영역을 결정하고,상기 자산 영역의 컨트라스트(contrast) 정보에 기초하여 상기 자산 영역에 대응되는 윤곽 벡터를 결정하는, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 하나 이상의 프로세서는,상기 윤곽 벡터가 포함된 상기 철도 자산의 데이터를 형성하고,상기 윤곽 벡터를 이용하여 상기 철도 자산의 데이터의 유사도를 결정하는, 철도 자산 관리 서버."}
{"patent_id": "10-2021-0192120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "철도 자산 관리 서버를 통해 철도 자산을 관리하는 방법은,적어도 하나의 카메라, 레이더, 라이다 및 초음파 센서를 포함하는 정보 획득부를 통해 데이터를 획득하는단계;상기 데이터 및 상기 데이터를 이용하여 생성된 상기 학습 데이터에 기초하여 학습된 인공 지능 모델을 이용하여, 상기 적어도 하나의 철도 자산 클래스를 식별하는 단계;상기 식별된 철도 자산 클래스에 기초하여, 상기 적어도 하나의 철도 자산 각각의 상기 데이터의 획득 주기를공개특허 10-2023-0102185-4-결정하는 단계; 및상기 획득 주기마다 획득된 상기 데이터에 기초하여, 상기 적어도 하나의 철도 자산을 모니터링하는 단계;를 포함하는, 철도 자산을 관리하는 방법."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "철도 자산 관리 서버가 개시된다. 철도 자산 관리 서버는, 스피커 및 디스플레이 중 적어도 하나를 포함하는 출 력부, 적어도 하나의 카메라, 레이더 센서, 라이다 센서 및 초음파 센서를 포함하는 정보 획득부 및 상기 정보 획득부에서 획득된 데이터에 기초하여 적어도 하나의 철도 자산 상태 정보를 결정하고, 철도 자산 상태 정보가 출력되도록 출력부를 제어하는 자산 관리부를 포함하고, 자산 관리부는, 정보 획득부로부터 획득된 데이터를 저 장하는 메모리; 데이터 및 상기 데이터를 이용하여 생성된 상기 학습 데이터에 기초하여, 적어도 하나의 철도 자 산 클래스를 식별하도록 학습된 인공 지능 모델 및 식별된 철도 자산 클래스에 기초하여, 적어도 하나의 철도 자 산 각각의 데이터의 획득 주기를 결정하고, 결정된 획득 주기마다 획득된 데이터에 기초하여, 적어도 하나의 철 도 자산을 모니터링하도록 구성된 하나 이상의 프로세서를 포함할 수 있다."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 인공 지능 기반의 철도 자산 관리 서버, 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "철도(railway)는 열차의 운행에 필요한 일체의 설비를 포함하는 개념이다. 철도가 최적의 상태로 관리/유지되는 것은 열차 운행의 정시성 및 안정성을 확보하는데 필수적이다. 따라서, 철도에 대한 품질 감시 및 유지 보수는 주기적/효율적으로 이루어져야 한다. 종래에는 접촉식 센서(예로, 선형 가변 변위 변환기) 등과 같은 고가의 정밀 센서를 이용하여 철도의 상태를 감 시하는 것이 일반적이었다. 다만, 이러한 접촉식 센서를 통해 철도의 상태를 감시하는 경우, 철로 표면의 접촉 으로 인해 2차 마모가 발생할 수 있다. 또한, 이러한 방식으로 철도의 상태를 감시하는 것은 많은 인력, 시간 및 비용을 필요로 한다는 문제점이 존재하였다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-2091165호, 2020.03.13"}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술된 문제점을 해결하기 위해 안출된 것으로서, 본 개시의 목적은 인공 지능 기반의 철도 자산 관 리 서버, 시스템 및 방법을 제공함에 있다. 본 개시가 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예로, 철도 자산 관리 서버는, 스피커 및 디스플레이 중 적어도 하나를 포함하는 출력부, 적 어도 하나의 카메라, 레이더 센서, 라이다 센서 및 초음파 센서를 포함하는 정보 획득부 및 상기 정보 획득부에 서 획득된 데이터에 기초하여 적어도 하나의 철도 자산 상태 정보를 결정하고, 상기 철도 자산 상태 정보가 출 력되도록 상기 출력부를 제어하는 자산 관리부를 포함하고, 상기 자산 관리부는, 상기 정보 획득부로부터 획득 된 상기 데이터를 저장하는 메모리, 상기 데이터 및 상기 데이터를 이용하여 생성된 상기 학습 데이터에 기초하 여, 상기 적어도 하나의 철도 자산 클래스를 식별하도록 학습된 인공 지능 모델 및 상기 식별된 철도 자산 클래 스에 기초하여, 상기 적어도 하나의 철도 자산 각각의 상기 데이터의 획득 주기를 결정하고, 상기 결정된 획득 주기마다 획득된 상기 데이터에 기초하여, 상기 적어도 하나의 철도 자산을 모니터링하도록 구성된 하나 이상의 프로세서를 포함할 수 있다. 그리고, 상기 하나 이상의 프로세서는, 상기 결정된 획득 주기마다 획득된 상기 데이터에 기초하여, 상기 적어 도 하나의 철도 자산 각각의 데이터의 유사도를 결정하고, 상기 적어도 하나의 철도 자산 각각의 데이터의 유사 도가 미리 결정된 값 미만인 경우, 경고 신호를 포함한 상기 철도 자산 상태 정보가 출력되도록 상기 출력부를 제어할 수 있다. 또한, 상기 학습 데이터 중 제1 학습 데이터는, 상기 적어도 하나의 카메라를 통해 획득된 이미지 및 상기 이미 지 상의 적어도 일부에 대해 라벨링(labeling)이 수행된 전처리 데이터에 기초하여 생성될 수 있다.그리고, 상기 하나 이상의 프로세서는, 상기 적어도 하나의 철도 자산 클래스에 가중치 정보를 매칭하고, 상기 가중치 정보는, 상기 레이더 센서, 상기 라이다 센서 및 상기 초음파 센서 각각에 대응되는 상기 데이터의 비율 이 포함된 정보일 수 있다. 그리고, 상기 메모리는, 상기 레이더, 상기 라이다 및 상기 초음파 센서를 통해 획득되는 상기 데이터를 필터링 하는 복수의 필터를 포함하고, 상기 학습 데이터 중 제2 학습 데이터는, 상기 데이터에서 상기 철도 자산의 존 재 여부를 식별하기 위해 라벨링된 전처리 데이터에 기초하여 생성될 수 있다. 그리고, 상기 하나 이상의 프로세서는, 상기 제2 학습 데이터에 기초하여 학습된 상기 인공 지능 모델을 통해 상기 복수의 필터의 대역폭을 결정할 수 있다. 그리고, 상기 학습 데이터 중 제3 학습 데이터는, 상기 적어도 하나의 철도 자산 클래스와 상기 유사도가 대응 된 전처리 데이터에 기초하여 생성되고, 상기 하나 이상의 프로세서는, 상기 제3 학습 데이터에 기초하여 학습 된 상기 인공 지능 모델을 통해 상기 데이터의 획득 주기를 결정할 수 있다. 그리고, 상기 하나 이상의 프로세서는, 상기 적어도 하나의 카메라가 획득한 이미지에 포함된 철도 자산에 대응 되는 자산 영역을 결정하고, 상기 자산 영역의 컨트라스트(contrast) 정보에 기초하여 상기 자산 영역에 대응되 는 윤곽 벡터를 결정할 수 있다. 그리고, 상기 하나 이상의 프로세서는, 상기 윤곽 벡터가 포함된 상기 철도 자산의 데이터를 형성하고, 상기 윤 곽 벡터를 이용하여 상기 철도 자산의 데이터의 유사도를 결정할 수 있다. 본 개시의 또 다른 실시예로, 철도 자산 관리 서버를 통해 철도 자산을 관리하는 방법은, 적어도 하나의 카메라, 레이더, 라이다 및 초음파 센서를 포함하는 정보 획득부를 통해 데이터를 획득하는 단계; 상기 데이터 및 상기 데이터를 이용하여 생성된 상기 학습 데이터에 기초하여 학습된 인공 지능 모델을 이용하여, 상기 적어 도 하나의 철도 자산 클래스를 식별하는 단계; 상기 식별된 철도 자산 클래스에 기초하여, 상기 적어도 하나의 철도 자산 각각의 상기 데이터의 획득 주기를 결정하는 단계; 및 상기 획득 주기마다 획득된 상기 데이터에 기 초하여, 상기 적어도 하나의 철도 자산을 모니터링하는 단계를 포함할 수 있다. 이 외에도, 본 개시를 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제공될 수 있다. 본 개시의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예를 통해, 인공 지능 기반의 철도 자산 관리 서버, 시스템 및 방법이 제공될 수 있다. 본 개시의 또 다른 실시예를 통해, 다양한 센서를 통해 획득된 데이터 및 인공 지능 모델을 통해 철도 자산의 상태를 효율적으로 모니터링할 수 있다. 본 개시의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 명세서가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 개시가 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우 뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\" 위치하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존재하는 경우도 포함한다. 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위해 사용되는 것으로, 구성요소가 전 술된 용어들에 의해 제한되는 것은 아니다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 있어 식별부호는 설명의 편의를 위하여 사용되는 것으로 식별부호는 각 단계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 본 개시의 작용 원리 및 실시예들에 대해 설명한다. 도 1은 본 개시의 일 실시예에 따른, 철도 자산 관리 방법이 구현되는 시스템을 설명하기 위한 개략도이다. 본 개시를 설명함에 있어서, 철도 자산은 열차 운행에 필요한 각종 설비 자산을 의미할 수 있다. 예를 들어, 철 도 자산은, 트랙(또는, 레일), 신호등, 터널 라이닝, 철도의 도상 위에 레일을 직접 지지하는 침목, 레일을 침 목에 고정시키는 개못, 궤도를 지지하는 기반인 노반, 선로의 레이로가 침목 사이에 끼우는 타이플레이트 등을 포함할 수 있으며, 이에 한정되는 것은 아니다. 도 1에 도시된 바와 같이, 본 개시의 일 실시예에 따른, 철도 자산 관리 방법이 구현되는 시스템은, 철도 자산 관리 서버, 카메라(200-1), 라이다(light detection and ranging, LiDAR) 센서(200-2), 레이더 (radio detection and ranging, Radar) 센서(200-3), 초음파 센서(200-4), 데이터 베이스 및 철도 자산 관리 서버를 관리하는 관리 장치를 포함할 수 있다. 도 1에서는 카메라(200-1), 라이다 센서(200-2), 레이더 센서(200-3), 초음파 센서(200-4), 및 데이터 베이스 가 철도 자산 관리 서버의 외부에 구비된 경우를 도시하고 있으나, 이는 일 실시예에 불과하며, 철도 자산 관리 서버 내부에 구비될 수 있다. 이는 도 2를 참조하여 구체적으로 설명하도록 한다. 시스템에 포함된 각 장치 및 센서는 네트워크(W)를 통해 통신을 수행할 수 있다. 여기서, 네트워크(W)는 유선 네트워크와 무선 네트워크를 포함할 수 있다. 예를 들어, 네트워크는 근거리 네트워크(LAN: Local Area Network), 도시권 네트워크(MAN: Metropolitan Area Network), 광역 네트워크(WAN: Wide Area Network) 등의 다양한 네트워크를 포함할 수 있다. 또한, 네트워크(W)는 공지의 월드 와이드 웹(WWW: World Wide Web)을 포함할 수도 있다. 그러나, 본 개시의 실 시예에 따른 네트워크(W)는 상기 열거된 네트워크에 국한되지 않고, 공지의 무선 데이터 네트워크나 공지의 전 화 네트워크, 공지의 유무선 텔레비전 네트워크를 적어도 일부로 포함할 수도 있다. 카메라(200-1), 라이다 센서(200-2), 레이더 센서(200-3) 및 초음파 센서(200-4)는 지리적으로 분산 (geographically distributed)될 수 있으며, 서로 다른 유형의 데이터를 센싱 또는 획득할 수 있다. 구체적으로, 카메라(200-1)는 특정 영역에 대한 이미지 데이터(예로, 철도 자산이 위치한 영역의 이미지 데이터) 등 종합적인 데이터를 획득할 수 있다. 라이다 센서(200-2)는 전방향으로 레이저 빔을 발사하여 되돌아 오는 시간을 측정하여 철도 자산이 위치한 영역을 스캔할 수 있다. 레이더 센서(200-3)는 단방향으로 레이저 빔 을 발사하여 되돌아오는 시간에 기초하여 철도 자산의 형태, 거리 등을 획득할 수 있다. 레이더 센서(200-3)는 라이다 센서(200-2)보다 장거리를 스캔할 수 있으나, 이에 한정되는 것은 아니며 각 센서의 스펙(spec)에 따라 다를 수 있다. 초음파 센서(200-3)는 가청 주파수보다 높은 주파수를 가지는 파동을 이용하여 근접 영역을 스캔 할 수 있다. 도 1에는 각 센서가 유형 별로 하나씩 존재하는 것으로 도시되어 있으나, 이에 국한되는 것은 아니며, 각 센서 의 개수는 시스템의 설계에 따라 다양하게 구현될 수 있다. 철도 자산 관리 서버는 카메라(200-1), 라이다 센서(200-2), 레이더 센서(200-3) 및 초음파 센서(200- 4)를 통해 획득된 데이터에 기반하여 철도 자산을 식별/분류할 수 있다. 그리고, 철도 자산 관리 서버는 인공 지능 모델을 이용하여 철도 자산 별 데이터의 획득 주기를 설정/업데이트할 수 있다. 그리고, 철도 자산 관리 서버는 설정/업데이트된 획득 주기 별로 획득된 데이터에 기반하여 철도 자산의 상태를 모니터링할 수 있다. 이와 관련된 실시예는 후술하는 실시예에서 구체적으로 설명하도록 한다. 데이터 베이스는 카메라(200-1), 라이다 센서(200-2), 레이더 센서(200-3) 및 초음파 센서(200-4)를 통해 획득한 데이터가 저장될 수 있다. 데이터 베이스는 상기 획득된 데이터에 기초하여 생성된 학습 데이터가 저장될 수 있다. 데이터 베이스에는 인공 지능 모델이 학습(training)/추론(inference) 동작을 수행하기 위해 필요한 데이터가 저장될 수 있다. 데이터 베이스는 철도 자산 별 상황에 대한 데이터가 저장될 수 있 다. 여기서, 인공 지능 모델은, 철도 자산 관리 서버 내부에 구비된 온-디바이스(on device) 기반 모델 또는 별도의 클라우드 서버에 구비되어 철도 자산 관리 서버에 의해 활용되는 클라우드 기반 모델로 구현될 수 있다. 관리 장치는 철도 자산 관리 서버를 관리/제어할 수 있는 장치이다. 도 1에는 관리 장치가 데스 크 탑 PC로 구현된 경우를 도시하고 있으나, 이에 국한되는 것은 아니며, 태블릿 PC, 노트북, 스마트 폰, 웨어 러블 기기 등 다양한 기기로 구현될 수 있다. 도 2는 본 개시의 일 실시예에 따른, 철도 자산 관리 서버의 구성을 설명하기 위한 블록도이다. 도 2에 도시된 바와 같이, 철도 자산 관리 서버는 정보 획득부, 자산 관리부 및 출력부를 포함할 수 있다. 다만, 도 2에 도시된 구성은 본 개시의 실시 예들을 구현하기 위한 예시도이며, 통상의 기술자에게 자명한 수준 의 적절한 하드웨어 및 소프트웨어 구성들이 철도 자산 관리 서버에 추가로 포함될 수 있다. 정보 획득부는 카메라, 라이다 센서, 레이더 센서 및 초음파 센서를 포함할 수 있다. 각 장치에 대한 설명은 도 1을 참조하여 설명하였으므로 중복되는 설명은 생략하도록 한다. 자산 관리부는 정보 획득부에서 획득된 데이터에 기초하여 적어도 하나의 철도 자산 상태 정보를 획 득할 수 있다. 자산 관리부는 메모리, 프로세서 및 인공지능 모델을 포함할 수 있다. 메모리는 도 1을 참조하여 설명한 데이터 베이스에 대응될 수 있는 바, 중복되는 설명은 생략하도록 한다. 메모리는 각종 동작을 수행하기 위한 하나 이상의 인스트럭션(instruction)을 저장할 수 있다. 메모리 는 정보 획득부를 통해 획득한 데이터(123-2)를 저장할 수 있다. 이 때, 획득된 데이터(123-2)는 하 나 이상의 필터(123-1)에 의해 필터링된 데이터일 수 있다. 여기서, 하나 이상의 필터(123-1)는 이미지 데이터 내에서 철도 내에 발생된 마모(예를 들어, 선로에 발생한 파 상 마모 등)를 검출하는 이미지 필터를 포함할 수 있다. 또 다른 예로, 하나 이상의 필터(123-1)는 철도 자산과 관련된 데이터를 전처리 하기 위한 전처리 필터를 포함 할 수 있다. 여기서, 전처리는 잡음(noise) 제거, 세선화, 이진화 동작 등을 포함할 수 있다. 전처리 필터는 가 우시안 필터(Gaussian filter), 라플라시안 필터(Laplacian filter), 가우시안 차(Difference of Gaussian: DoG) 및 캐니 에지 검출(Canny edge detection) 등을 포함할 수 있다. 프로세서는 메모리와 전기적으로 연결되어 철도 자산 관리 서버의 전반적인 동작 및 기능을 제 어할 수 있다. 프로세서는 하나 이상의 프로세서로 구성될 수 있다. 이 때, 하나 이상의 프로세서는 CPU(Central Processing Unit), AP(Application Processor), DSP(Digital Signal Processor) 등과 같은 범용 프로세서, GPU(Graphic Processing Unit), VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU(Neural Processing Unit)와 같은 인공지능 전용 프로세서 등으로 구현될 수 있다. 인공지능 전용 프로세서는, 특정 인 공지능 모델의 처리에 특화된 하드웨어 구조로 설계된 프로세서를 의미할 수 있다.프로세서는, 인공 지능 모델을 통해 식별된 철도 자산 클래스(또는, 유형)에 기초하여, 적어도 하나 의 철도 자산 각각의 데이터 획득 주기를 결정할 수 있다. 여기서, 특정 철도 자산의 획득 주기는, 특정 철도 자산에 대한 데이터를 획득/측정하는 주기를 의미할 수 있다. 프로세서은, 결정된 획득 주기마다 정보 획득부를 통해 획득된 데이터에 기초하여, 적어도 하나의 철 도 자산을 모니터링할 수 있다. 예를 들어, 프로세서은, 결정된 획득 주기마다 획득된 데이터에 기초하여, 적어도 하나의 철도 자산 각각 의 데이터의 유사도를 결정할 수 있다. 여기서, 철도 자산 각각의 데이터의 유사도는, 이전에 획득된 철도 자산 데이터와 최근에(또는, 이번에) 획득된 철도 자산 데이터 간의 유사도를 의미할 수 있다. 이에 따라, 프로세서 는 철도 자산 상에 발생한 변화를 모니터링할 수 있다. 적어도 하나의 철도 자산 각각의 데이터의 유사도가 미리 결정된 값 미만인 경우, 프로세서는 경고 신호를 포함한 철도 자산 상태 정보가 출력되도록 출력부를 제어할 수 있다. 여기서, 특정 철도 자산 각각의 데이터의 유사도가 미리 결정된 값 미만이라는 것은, 이전의 특정 철도 자산 상 태와 최근의 특정 철도 자산 상태가 변경되었음을 의미할 수 있다. 예를 들어, 트랙 상에 마모 상황이 심각해진 경우, 이전에 획득된 트랙의 이미지 데이터와 최근에 획득된 트랙에 대한 이미지 데이터간의 유사도가 미리 결 정된 값 미만일 수 있다. 따라서, 프로세서는 특정 철도 자산을 검사할 것을 요청하는 경고 신호 및 특정 철도 자산 상태 정보를 출력하도록 출력부를 제어할 수 있다. 본 개시의 또 다른 실시예로, 프로세서은 적어도 하나의 카메라가 획득한 이미지에 포함된 철도 자산 에 대응되는 자산 영역을 결정할 수 있다. 프로세서은 자산 영역의 컨트라스트(contrast) 정보에 기초하여 자산 영역에 대응되는 윤곽 벡터를 결정할 수 있다. 프로세서은 윤곽 벡터가 포함된 철도 자산의 데이터를 형성할 수 있다. 그리고, 프로세서은 윤곽 벡 터를 이용하여 철도 자산의 데이터의 유사도를 결정할 수 있다. 인공 지능 모델은 적어도 하나의 철도 자산 클래스를 식별하도록 학습된 모델을 의미한다. 인공 지능 모델 은 정보 획득부를 통해 획득된 데이터 및 상기 데이터를 이용하여 생성된 학습 데이터에 기초하여 학 습될 수 있다. 본 개시의 일 실시예로, 학습 데이터 중 제1 학습 데이터는, 적어도 하나의 카메라를 통해 획득된 이미지 및 상기 이미지 내에 적어도 일부에 대해 라벨링(labeling)이 수행된 전처리 데이터에 기초하여 생성될 수 있다. 프로세서은, 제1 학습 데이터에 기초하여 학습된 인공 지능 모델을 통해, 카메라를 이용하여 획 득된 이미지 내에 포함된 객체의 유형을 식별할 수 있다. 본 개시의 또 다른 실시예로, 학습 데이터 중 제2 학습 데이터는, 정보 획득부를 통해 획득된 데이터에서 철도 자산의 존재 여부를 식별하기 위해 라벨링된 전처리 데이터에 기초하여 생성될 수 있다. 구체적으로, 프로세서는 적어도 하나의 철도 자산 클래스에 가중치 정보를 매칭할 수 있다. 가중치 정보는, 레이더 센서, 라이다 센서 및 초음파 센서 각각에 대응되는 데이터 비율을 포함할 수 있다. 프로세서은 제2 학습 데이터에 기초하여 학습된 인공 지능 모델을 통해 필터(123-1)의 (주파수) 대역 폭을 결정할 수 있다. 즉, 프로세서는 철도 자산 정보를 획득하는데 필요한 각각의 센서의 데이터 범위를 인공 지능 모델을 통해 결정할 수 있다. 예를 들어, 프로세서는, 인공 지능 모델을 통해, 트랙 에 대한 정보를 획득하기 위해서 라이다 센서의 획득 범위를 10nm~60nm로 결정할 수 있다. 본 개시의 또 다른 실시예로, 학습 데이터 중 제3 학습 데이터는, 적어도 하나의 철도 자산 클래스와 유사도가 대응된 전처리 데이터에 기초하여 생성될 수 있다. 여기서, 유사도는 상술된 프로세서에 의해 획득되는 철 도 자산 각각의 유사도를 의미한다. 즉, 제3 학습 데이터는 특정 철도 자산 클래스와 특정 철도 자산에 대응되 는 유사도가 대응된 전처리 데이터에 기초하여 생성될 수 있다. 프로세서은 제3 학습 데이터에 기초하여 학습된 인공 지능 모델을 통해 데이터의 획득 주기를 결정할 수 있다. 출력부는 스피커 및 디스플레이 중 적어도 하나를 포함할 수 있다. 출력부는 프로세서의 제어에 의해 경고 신호를 포함하는 철도 자산 상태 정보를 출력할 수 있다. 예를 들어, 스피커는 경고 신호를 나타내는 알림음을 출력할 수 있으며, 디스플레이는 철도 자산 상태 정보를 표시할 수 있다. 도 3은 본 개시의 일 실시예에 따른, 철도 자산 관리 방법을 설명하기 위한 순서도이다. 철도 자산 관리 서버는 적어도 하나의 카메라, 레이더 센서, 라이다 센서 및 초음파 센서를 포함하는 정보 획득 부를 통해 데이터를 획득할 수 있다(S310). 예를 들어, 철도 자산 관리 서버는 카메라를 통해 특정 영역(예로, 철도 자산이 포함된 영역)에 대한 이미지 데 이터를 획득할 수 있다. 또 다른 예로, 철도 자산 관리 서버는 레이더 센서, 라이다 센서 및 초음파 센서를 통 해 특정 영역을 스캔함으로써 데이터를 획득할 수 있다. 철도 자산 관리 서버는, 정보 획득부를 통해 획득된 데이터 및 상기 데이터를 이용하여 생성된 학습 데이터에 기초하여 학습된 인공 지능 모델을 이용하여, 적어도 하나의 철도 자산 클래스를 식별할 수 있다(S320). 예를 들어, 인공 지능 모델은 카메라를 통해 획득된 이미지 데이터 내에서 철도 자산 존재 여부 및 철도 자산의 유형을 식별하도록 학습될 수 있다. 또 다른 예로, 인공 지능 모델은, 철도 자산 클래스에 매칭된 가중치 정보 에 기초하여 철도 자산의 존재 여부 및 철도 자산의 유형을 식별하도록 학습될 수 있다. 여기서, 가중치 정보는 레이더 센서, 라이다 센서 및 초음파 센서 각각에 대응되는 데이터 비율을 포함할 수 있다. 철도 자산 관리 서버는 식별된 철도 자산 클래스에 기초하여, 적어도 하나의 철도 자산 각각의 데이터의 획득 주기 결정할 수 있다(S330). 즉, 철도 자산 관리 서버는 인공 지능 모델을 통해 철도 자산 별로 데이터를 획득해야 하는 획득 주기를 결정할 수 있다. 예를 들어, 철도 자산 관리 서버는 트랙에 대한 데이터를 매일 획득하고, 신호등에 대한 데이터는 3일 마다 획득하는 것으로 결정할 수 있다. 철도 자산 관리 서버는 획득 주기마다 획득된 데이터에 기초하여, 적어도 하나의 철도 자산을 모니터링할 수 있 다(S340). S340에 대한 구체적인 설명은 도 4를 참조하여 설명하도록 한다. 도 4는 본 개시의 일 실시예에 따른, 철도 자산에 대한 상태 정보 및 측정 주기를 제어하는 방법을 설명하기 위 한 순서도이다. 철도 자산 관리 서버는, 철도 자산 각각에 대한 데이터 획득 주기마다 획득된 데이터에 기초하여, 적어도 하나 의 철도 자산을 모니터링할 수 있다(S410). 구체적으로, 철도 자산 관리 서버는 철도 자산 각각의 데이터의 유사도가 미리 결정된 값 미만인지 여부를 식별 할 수 있다(S420). 즉, 철도 자산 관리 서버는 이전에 획득된 특정 철도 자산의 데이터와 이번에 획득한 특정 철도 자산의 데이터 간의 유사도를 획득하고, 획득된 유사도가 미리 결정된 값 미만인지 여부를 식별할 수 있다. 철도 자산 각각의 데이터의 유사도가 미리 결정된 값 미만인 경우, 철도 자산 관리 서버는 경고 신호를 포함한 철도 자산 상태 정보를 출력할 수 있다(S430). 즉, 철도 자산 관리 서버는 철도 자산 각각의 데이터의 유사도에 기초하여 경고 신호를 출력함으로써 철도 자산을 모니터링할 수 있다. 그리고, 철도 자산 관리 서버는 유사도가 미리 결정된 값 미만인 철도 자산에 대한 데이터 획득 주기를 업데이 트할 수 있다(S440). 예를 들어, 특정 철도 자산(예로, 트랙 등)의 데이터의 유사도가 미리 결정된 값 미만인 경우, 철도 자산 관리 서버는 특정 철도 자산에 대한 데이터 획득 주기를 감소시킬 수 있다(예로, 3일에서 매일 단위로). 본 개시의 실시예들은 컴퓨터에 의해 실행 가능한 명령어를 저장하는 기록매체의 형태로 구현될 수 있다. 명령 어는 프로그램 코드의 형태로 저장될 수 있으며, 프로세서에 의해 실행되었을 때, 프로그램 모듈을 생성하여 개 시된 실시예들의 동작을 수행할 수 있다. 기록매체는 컴퓨터로 읽을 수 있는 기록매체로 구현될 수 있다. 컴퓨터가 읽을 수 있는 기록매체로는 컴퓨터에 의하여 해독될 수 있는 명령어가 저장된 모든 종류의 기록 매체 를 포함한다. 예를 들어, ROM(Read Only Memory), RAM(Random Access Memory), 자기 테이프, 자기 디스크, 플 래쉬 메모리, 광 데이터 저장장치 등이 있을 수 있다."}
{"patent_id": "10-2021-0192120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상에서와 같이 첨부된 도면을 참조하여 개시된 실시예들을 설명하였다. 본 개시가 속하는 기술분야에서 통상 의 지식을 가진 자는 본 개시의 기술적 사상이나 필수적인 특징을 변경하지 않고도, 개시된 실시예들과 다른 형태로 본 개시가 실시될 수 있음을 이해할 것이다. 개시된 실시예들은 예시적인 것이며, 한정적으로 해석되어서 는 안 된다."}
{"patent_id": "10-2021-0192120", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 철도 자산 관리 방법이 구현되는 시스템을 설명하기 위한 개략도이다. 도 2는 본 개시의 일 실시예에 따른, 철도 자산 관리 서버의 구성을 설명하기 위한 블록도이다. 도 3은 본 개시의 일 실시예에 따른, 철도 자산 관리 방법을 설명하기 위한 순서도이다. 도 4는 본 개시의 일 실시예에 따른, 철도 자산에 대한 상태 정보 및 측정 주기를 제어하는 방법을 설명하기 위 한 순서도이다."}
