{"patent_id": "10-2019-0093475", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0015124", "출원번호": "10-2019-0093475", "발명의 명칭": "인공지능 로봇청소기 및 그를 포함하는 로봇 시스템", "출원인": "엘지전자 주식회사", "발명자": "강정욱"}}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외형을 형성하는 메인바디;탁도 센서 및 수위 센서를 포함하는 복수의 센서를 포함하며, 물을 저장하는 물탱크;바닥에 접촉하여 회전하면서 상기 메인바디를 이동시키는 한 쌍의 회전맙;상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 회전맙에 상기 물탱크의 물을 공급하는 노즐;상기 노즐 및 구동모터를 제어하고, 상기 물탱크의 복수의 상기 센서로부터의 감지 신호에 따라 상기 구동 모터의 출력 전류를 가변하는 회전맙제어부; 및상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 상기 회전맙제어부로부터 수신하여 상기 물탱크의 오염 여부를 판단하는 제어부를 포함하는 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 물탱크는 벽면으로 상기 물탱크의 물의 탁도를 감지하는 상기 탁도 센서가 배치되어 있는 것을 특징으로하는 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 물탱크는 벽면으로 상기 물탱크의 물의 수위를 감지하는 수위 센서가 배치되어 있는 것을 특징으로 하는,로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 회전맙제어부는 상기 탁도 센서 및 상기 수위 센서로부터 주기적으로 상기 감지 신호를 수신하고, 상기 감지 신호에 따라 상기구동 모터의 출력 전류를 전환하는 것을 특징으로하는 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 회전맙제어부는상기 수위 센서의 감지 신호가 이전 주기의 감지 신호와 비교하여 변화가 없는 경우, 물 공급 이상으로 판단하여 상기 구동 모터의 출력 전류를 제1 값으로 변경하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 회전맙제어부는상기 탁도 센서의 감지 신호가 임계값 이상인 경우, 상기 물탱크의 물이 오염된 것으로 판단하여 상기 구동 모터의 출력 전류를 제2 값으로 변경하는 것을 특징으로 하는, 로봇청소기.공개특허 10-2021-0015124-3-청구항 7 제 6 항에 있어서,상기 제1 값과 제2 값은 서로 상이한 것을 특징으로 하는 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 제1 값과 제2 값은 서로 다른 펄스폭을 갖도록 변경되는 것을 더 포함하는 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 제어부는 상기 회전맙제어부로부터 주기적으로 상기 구동 모터의 상기 출력 전류를 수신하고, 수신된 상기출력 전류의 파형을 분석하여 상기 물 공급 이상 또는 물탱크의 오염 여부에 대하여 판단하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 탁도 센서는 상기 물탱크의 외벽에 형성되는 발신부, 그리고상기 물탱크의 외벽에 형성되는 수신부를 포함하고, 상기 수신부는 상기 발신부로부터의 초음파 신호에 대한 수신 또는 산란 값으로부터 상기 물탱크의 물의 탁도를 검출하는 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서, 상기 수위센서는상기 물탱크의 외벽에 형성되는 발광부, 그리고상기 발광부와 마주하며 상기 물탱크의 외벽에 형성되는 수광부를 포함하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 수신부와 상기 수광부는 하나의 모듈로 형성되어 상기 회전맙제어부로 감지 신호를 출력하는 것을 특징으로 하는, 로봇청소기."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청소구역 내에 습식 청소를 수행하기 위한 로봇청소기;상기 로봇청소기와 송수신하며 상기 로봇청소기의 제어를 수행하는 서버; 및상기 로봇청소기 및 상기 서버와 연동하며 상기 로봇청소기의 제어에 대한 어플리케이션이 활성화되어 상기 로봇청소기에 대한 제어를 수행하는 사용자 단말을 포함하며,상기 로봇청소기는,외형을 형성하는 메인바디;탁도 센서와 수위 센서를 포함하는 복수의 센서를 포함하며, 물을 저장하는 물탱크;바닥에 접촉하여 회전하면서 상기 메인바디를 이동시키는 한 쌍의 회전맙;상기 한 쌍의 회전맙을 회전시키는 구동모터; 공개특허 10-2021-0015124-4-상기 회전맙에 상기 물탱크의 물을 공급하는 노즐;상기 노즐 및 구동모터를 제어하고, 상기 물탱크의 복수의 상기 센서로부터의 감지 신호에 따라 상기 구동 모터의 출력 전류를 가변하는 회전맙제어부; 및상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 상기 회전맙제어부로부터 수신하여 상기 물탱크의 오염 여부를 판단하는 제어부를 포함하는 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 물탱크는 벽면으로 상기 물탱크의 물의 탁도를 감지하는 상기 탁도 센서; 및 상기 물탱크의 물의 수위를 감지하는 상기 수위 센서를 포함하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 회전맙제어부는 상기 탁도 센서 및 상기 수위센서로부터 주기적으로 상기 감지 신호를 수신하고, 상기 감지 신호에 따라 상기구동 모터의 출력 전류를 전환하는 것을 특징으로 하는 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 회전맙제어부는상기 수위 센서의 감지 신호가 이전 주기의 감지 신호와 비교하여 변화가 없는 경우, 물 공급 이상으로 판단하여 상기 구동 모터의 출력 전류를 제1 값으로 변경하고, 상기 탁도 센서의 감지 신호가 임계값 이상인 경우, 상기 물탱크의 물이 오염된 것으로 판단하여 상기 구동 모터의 출력 전류를 제2 값으로 변경하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 제1 값과 제2 값은 서로 다른 펄스폭을 갖도록 변경되는 것을 더 포함하는 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13 항에 있어서,상기 제어부는 상기 회전맙제어부로부터 주기적으로 상기 구동 모터의 출력 전류를 수신하고, 수신된 상기 출력전류의 파형을 분석하여 상기 물 공급 이상 또는 물탱크의 오염 여부에 대하여 판단하여 상기 사용자 단말에 전송하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 13 항에 있어서,상기 탁도 센서는 상기 물탱크의 외벽에 형성되는 발신부, 그리고상기 물탱크의 외벽에 형성되는 수신부를 포함하고, 상기 수신부는 상기 발신부로부터의 초음파 신호에 대한 수신 또는 산란 값으로부터 상기 물탱크의 물의 탁도를 검출하는 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 13 항에 있어서, 상기 수위센서는공개특허 10-2021-0015124-5-상기 물탱크의 외벽에 형성되는 발광부, 그리고상기 발광부와 마주하며 상기 물탱크의 외벽에 형성되는 수광부를 포함하는 것을 특징으로 하는, 로봇 시스템."}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 외형을 형성하는 메인바디; 복수의 센서를 포함하며, 물을 저장하는 물탱크; 바닥에 접촉하여 회전하 면서 상기 메인바디를 이동시키는 한 쌍의 회전맙; 상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 회전맙에 상기 물탱크의 물을 공급하는 노즐; 상기 노즐 및 구동모터를 제어하고, 상기 물탱크의 복수의 상기 센서로부터 (뒷면에 계속)"}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 로봇청소기의 제어방법에 관한 것으로, 보다 상세하게는 회전맙을 사용하는 인공지능 로봇청소기의 제어방법에 관한 것이다."}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 가정 내에서의 로봇 사용이 점차 확대되고 있는 추세이다. 이러한 가정용 로봇의 대표적인 예는 청소 로봇 이다. 청소 로봇은 이동형 로봇으로서 일정 영역을 스스로 주행하며 바닥에 쌓인 먼지 등의 이물질을 흡입함으 로써 청소 공간을 자동으로 청소하는 하거나, 회전맙을 이용하여 이동함과 동시에 회전맙으로 바닥을 닦는 방식 으로 청소할 수 있다. 또한, 회전맙에 물을 공급하여 바닥을 물걸레질하는 방식의 청소도 가능하다. 다만, 회전맙에 공급되는 물을 적절하게 조절하지 않으면, 피청소면인 바닥에 물이 과하게 남거나, 바닥을 마른 걸레질 한 것과 같이, 바닥을 정상적으로 청소할 수 없는 문제점이 있다. 한국 공개 특허 번호 1020040052094호 의 경우, 바닥에 뿌려진 증기를 먼지와 함께 닦아내도록 그 외주면에 걸레용 천을 구비하는 걸레롤러를 포함한 물청소가 가능한 청소용 로봇이 개시되어 있다. 이와 같은 청소용 로봇은 습식청소를 위한 청소바닥 표면에 증 기를 분사하고, 분사된 증기와 먼지를 닦아내도록 걸레용 천을 구비한다. 또한, 한국 공개 특허 번호 20140146702호에는 습식 청소가 가능한 로봇청소기 내측에 물이 수용될 수 있는지를 판단하는 로봇청소기 및 제 어방법이 개시되어 있다. 그러나, 현재 물걸레 청소기의 물탱크의 상태를 감지하고 감지 정보를 메인 모듈로 전송하기 위하여는 별도의 모듈을 필요로 하고있어 비용 및 장비에 대한 문제가 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 특허 공개 번호 1020040052094 (공개일 2004.06.19) (특허문헌 0002) 한국 공개 특허 번호 20140146702호(공개일 2014.12.29)"}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 물탱크 내의 다양한 센서를 구비하여, 회전맙에 물을 제공하는 물탱크의 물 공급 이상 여부 및 물의 탁도 여부를 감지하여 사용자에게 알람할 수 있는 로봇청소기의 제어방법을 제공하는 것이다. 본 발명의 다른 과제는 로봇청소기의 회전맙의 모터의 출력 전류를 제어하여물탱크의 센서들에 대한 감지 결과 를 사용자에게 알람할 수 있는 로봇청소기의 제어방법을 제공하는 것이다. 본 발명의 또 다른 과제는 회전맙 모터의 출력 전류의 패턴 변화에 따라 현재 물탱크의 물 공급 이상 여부 및 물의 탁도 여부를 동시에 판독가능한 로봇청소기의 제어방법을 제공하는 것이다. 본 발명은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로부터 당 업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 외형을 형성하는 메인바디; 탁도센서와 수위센서를 포함하는 복수의 센서를 포함하며, 물을 저장하는 물탱크; 바닥에 접촉하여 회전하면서 상기 메인바디를 이동시키는 한 쌍의 회전맙; 상기 한 쌍의 회전맙을 회전시키는 구동모터; 상기 회전맙에 상기 물탱크의 물을 공급하는 노즐; 상기 노즐 및 구동모터를 제어하고, 상기 물탱크의 복수의 상기 센서로부터의 감지 신호에 따라 상기 구동 모터의 출력 전류를 가변하는 회전맙제어부; 및 상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 상기 회전맙제어부로부터 수신하여 상기 물 탱크의 오염 여부를 판단하는 제어부를 포함하는 로봇청소기를 제공한다. 상기 물탱크는 상기 물탱크의 물의 탁도를 감지하는 탁도 센서를 포함할 수 있다. 상기 물탱크는 상기 물탱크의 물의 수위를 감지하는 수위 센서를 포함할 수 있다. 상기 회전맙제어부는 상기 탁도 센서 및 상기 수위센서로부터 주기적으로 상기 감지 신호를 수신하고, 상기 감 지 신호에 따라 상기 구동 모터의 출력 전류를 전환할 수 있다. 상기 회전맙제어부는 상기 수위 센서의 감지 신호가 이전 주기의 감지 신호와 비교하여 변화가 없는 경우, 물 공급 이상으로 판단하여 상기 구동 모터의 출력 전류를 제1 값으로 변경할 수 있다. 상기 회전맙제어부는 상기 탁도 센서의 감지 신호가 임계값 이상인 경우, 상기 물탱크의 물이 오염된 것으로 판 단하여 상기 구동 모터의 출력 전류를 제2 값으로 변경할 수 있다. 상기 제1 값과 제2 값은 서로 상이할 수 있다. 상기 제1 값과 제2 값은 서로 다른 펄스폭을 갖도록 변경될 수 있다. 상기 제어부는 상기 회전맙제어부로부터 주기적으로 상기 구동 모터의 출력 전류를 수신하고, 수신된 상기 출력 전류의 파형을 분석하여 상기 물 공급 이상 또는 물탱크의 오염 여부에 대하여 판단할 수 있다. 상기 탁도 센서는 상기 물탱크의 외벽에 형성되는 발신부, 그리고 상기 물탱크의 외벽에 형성되는 수신부를 포 함하고, 상기 수신부는 상기 발신부로부터의 초음파 신호에 대한 수신 또는 산란 값으로부터 상기 물탱크의 물 의 탁도를 검출할 수 있다. 상기 수위센서는 상기 물탱크의 외벽에 형성되는 발광부, 그리고 상기 발광구와 마주하며 상기 물탱크의 외벽에 형성되는 수광부를 포함할 수 있다. 상기 수신부와 상기 수광부는 하나의 모듈로 형성되어 상기 회전맙제어부로감지 신호를 출력할 수 있다. 한편, 본 발명은 청소구역 내에 습식 청소를 수행하기 위한 로봇청소기; 상기 로봇청소기와 송수신하며 상기 로 봇청소기의 제어를 수행하는 서버; 및 상기 로봇청소기 및 상기 서버와 연동하며 상기 로봇청소기의 제어에 대 한 어플리케이션이 활성화되어 상기 로봇청소기에 대한 제어를 수행하는 사용자 단말을 포함하며, 상기 로봇청 소기는, 외형을 형성하는 메인바디; 탁도센서와 수위센서를 포함하는 복수의 센서를 포함하며, 물을 저장하는 물탱크; 바닥에 접촉하여 회전하면서 상기 메인바디를 이동시키는 한 쌍의 회전맙; 상기 한 쌍의 회전맙을 회전 시키는 구동모터; 상기 회전맙에 상기 물탱크의 물을 공급하는 노즐; 상기 노즐 및 구동모터를 제어하고, 상기 물탱크의 복수의 상기 센서로부터의 감지 신호에 따라 상기 구동 모터의 출력 전류를 가변하는 회전맙제어부; 및 상기 한 쌍의 회전맙이 회전할 때, 상기 구동모터의 출력 전류를 상기 회전맙제어부로부터 수신하여 상기 물 탱크의 오염 여부를 판단하는 제어부를 포함하는 로봇 시스템을 제공한다. 상기 물탱크는 상기 물탱크의 물의 탁도를 감지하는 탁도 센서; 및 상기 물탱크의 물의 수위를 감지하는 수위 센서를 포함할 수 있다. 상기 회전맙제어부는 상기 탁도 센서 및 상기 수위센서로부터 주기적으로 상기 감지 신호를 수신하고, 상기 감 지 신호에 따라 상기 구동 모터의 출력 전류를 전환할 수 있다. 상기 회전맙제어부는 상기 수위 센서의 감지 신호가 이전 주기의 감지 신호와 비교하여 변화가 없는 경우, 물 공급 이상으로 판단하여 상기 구동 모터의 출력 전류를 제1 값으로 변경하고, 상기 탁도 센서의 감지 신호가 임 계값 이상인 경우, 상기 물탱크의 물이 오염된 것으로 판단하여 상기 구동 모터의 출력 전류를 제2 값으로 변경 할 수 있다. 상기 제1 값과 제2 값은 서로 다른 펄스폭을 갖도록 변경될 수 있다. 상기 제어부는 상기 회전맙제어부로부터 주기적으로 상기 구동 모터의 출력 전류를 수신하고, 수신된 상기 출력 전류의 파형을 분석하여 상기 물 공급 이상 또는 물탱크의 오염 여부에 대하여 판단하여 상기 사용자 단말에 전 송할 수 있다.상기 탁도 센서는 상기 물탱크의 외벽에 형성되는 발신부, 그리고 상기 물탱크의 외벽에 형성되는 수신부를 포 함하고, 상기 수신부는 상기 발신부로부터의 초음파 신호에 대한 수신 또는 산란 값으로부터 상기 물탱크의 물 의 탁도를 검출할 수 있다. 상기 수위센서는 상기 물탱크의 외벽에 형성되는 발광부, 그리고 상기 발광부와 마주하며 상기 물탱크의 외벽에 형성되는 수광부를 포함할 수 있다. 기타 실시예들의 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 로봇청소기에 따르면 다음과 같은 효과가 하나 혹은 그 이상 있다. 본 발명은 물탱크 내에 다양하고, 단순한 센서를 구비하여, 회전맙에 물을 제공하는 물탱크의 물 공급 이상 여 부 및 물의 탁도 여부를 감지할 수 있다. 또한, 별도의 감지 신호의 처리 모듈 없이 로봇청소기의 회전맙의 모터의 출력 전류를 제어하여 물탱크의 센서 들에 대한 감지 결과를 사용자에게 알람할 수 있어 비용 및 동작이 절감될 수 있다. 그리고, 회전맙 모터의 출력 전류의 패턴 변화에 따라 현재 물탱크의 물 공급 이상 여부 및 물의 탁도 여부를 동시에 판독가능하여 사용자로부터의 물 교체를 유도할 수 있다."}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서 언급되는 “전(F)/후(R)/좌(Le)/우(Ri)/상(U)/하(D)” 등의 방향을 지칭하는 표현은 도면에 표시된 바 에 따라 정의하나, 이는 어디까지나 본 발명이 명확하게 이해될 수 있도록 설명하기 위한 것이며, 기준을 어디 에 두느냐에 따라 각 방향들을 다르게 정의할 수도 있음은 물론이다. 이하에서 언급되는 구성요소 앞에 ‘제1, 제2' 등의 표현이 붙는 용어 사용은, 지칭하는 구성요소의 혼동을 피 하기 위한 것일 뿐, 구성요소 들 사이의 순서, 중요도 또는 주종관계 등과는 무관하다. 예를 들면, 제1 구성요 소 없이 제2 구성요소 만을 포함하는 발명도 구현 가능하다. 도면에서 각 구성의 두께나 크기는 설명의 편의 및 명확성을 위하여 과장되거나 생략되거나 또는 개략적으로 도 시되었다. 또한 각 구성요소의 크기와 면적은 실제크기나 면적을 전적으로 반영하는 것은 아니다. 또한, 본 발명의 구조를 설명하는 과정에서 언급하는 각도와 방향은 도면에 기재된 것을 기준으로 한다. 명세 서에서 구조에 대한 설명에서, 각도에 대한 기준점과 위치관계를 명확히 언급하지 않은 경우, 관련 도면을 참조 하도록 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 로봇 시스템의 구성도이다. 도 1을 참고하면, 본 발명의 실시예에 따른 로봇 시스템은, 하나 이상의 로봇청소기를 구비하여 집 등의 규정된 장소에서 서비스를 제공할 수 있다. 예를 들어, 로봇 시스템은 가정 등에서 지정된 장소의 청소 서비스 를 제공하는 로봇청소기를 포함할 수 있다. 특히 이러한 로봇청소기는 포함하는 기능 블럭에 따라 건 식, 습식 또는 건/습식의 청소 서비스를 제공할 수 있다. 바람직하게는, 본 발명의 일 실시예에 따른 로봇 시스템은, 복수의 인공지능 로봇청소기 및 복수의 인공지 능 로봇청소기를 관리하고 제어할 수 있는 서버를 포함할 수 있다. 서버는 원격에서 복수의 로봇청소기의 상태를 모니터링하고, 제어할 수 있고, 로봇 시스템은 복수의 로 봇청소기를 이용하여 더 효과적인 서비스 제공이 가능하다. 복수의 로봇 청소기 및 서버는 하나 이상의 통신 규격을 지원하는 통신 수단(미도시)을 구비하여, 상호 통신할 수 있다. 또한, 복수의 로봇청소기 및 서버는 PC, 이동 단말기, 외부의 다른 서버와 통신할 수 있다. 예를 들어, 복수의 로봇청소기 및 서버는 IEEE 802.11 WLAN, IEEE 802.15 WPAN, UWB, Wi-Fi, Zigbee, Z-wave, Blue-Tooth 등과 같은 무선 통신 기술로 무선 통신하게 구현될 수 있다. 로봇청소기는 통신하고자 하는 다른 장치 또는 서버의 통신 방식이 무엇인지에 따라 달라질 수 있다. 특히, 복수의 로봇청소기는 5G 네트워크를 통해 다른 로봇 및/또는 서버와 무선통신을 구현할 수 있다. 로봇청소기가 5G 네트워크를 통해 무선 통신하는 경우, 실시간 응답 및 실시간 제어가 가능하다. 사용자는 PC, 이동 단말기 등의 사용자 단말을 통하여 로봇 시스템 내의 로봇들에 관한 정보를 확인할 수 있다. 서버는 클라우드(cloud) 서버로 구현되어, 로봇에 클라우드 서버가 연동되어 로봇청소기를 모니터링, 제어하고 다양한 솔루션과 콘텐츠를 원격으로 제공할 수 있다. 서버는, 로봇청소기, 기타 기기로부터 수신되는 정보를 저장 및 관리할 수 있다. 상기 서버는 로봇 청소기의 제조사 또는 제조사가 서비스를 위탁한 회사가 제공하는 서버일 수 있다. 상기 서버는 로 봇청소기를 관리하고 제어하는 관제 서버일 수 있다. 상기 서버는 로봇청소기를 일괄적으로 동일하게 제어하거나, 개별 로봇청소기 별로 제어할 수 있 다. 한편, 상기 서버는, 복수의 서버로 정보, 기능이 분산되어 구성될 수도 있고, 하나의 통합 서버로 구성 될 수도 있을 것이다. 로봇청소기 및 서버는 하나 이상의 통신 규격을 지원하는 통신 수단(미도시)을 구비하여, 상호 통신할 수 있다. 로봇청소기는 공간(space), 사물(Object), 사용(Usage) 관련 데이터(Data)를 서버로 전송할 수 있다. 여기서, 데이터는 공간(space), 사물(Object) 관련 데이터는 로봇청소기가 인식한 공간(space)과 사물 (Object)의 인식 관련 데이터이거나, 영상획득부가 획득한 공간(space)과 사물(Object)에 대한 이미지 데이터일 수 있다. 실시예에 따라서, 로봇청소기 및 서버는 사용자, 음성, 공간의 속성, 장애물 등 사물의 속성 중 적어도 하나를 인식하도록 학습된 소프트웨어 또는 하드웨어 형태의 인공신경망(Artificial Neural Networks: ANN)을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 로봇청소기 및 서버는 딥러닝(Deep Learning)으로 학습된 CNN(Convolutional Neural Network), RNN(Recurrent Neural Network), DBN(Deep Belief Network) 등 심층신경 망(Deep Neural Network: DNN)을 포함할 수 있다. 예를 들어, 로봇청소기의 제어부에는 CNN(Convolutional Neural Network) 등 심층신경망 구조(DNN)가 탑재될 수 있다. 서버는 로봇청소기으로부터 수신한 데이터, 사용자에 의해 입력되는 데이터 등에 기초하여, 심층신경망 (DNN)을 학습시킨 후, 업데이트된 심층신경망(DNN) 구조 데이터를 로봇으로 전송할 수 있다. 이에 따라, 로 봇이 구비하는 인공지능(artificial intelligence)의 심층신경망(DNN) 구조를 업데이트할 수 있다.또한, 사용(Usage) 관련 데이터(Data)는 로봇청소기의 사용에 따라 획득되는 데이터로, 사용 이력 데이터, 센서부에서 획득된 감지 신호 등이 해당될 수 있다. 학습된 심층신경망 구조(DNN)는 인식용 입력 데이터를 입력받고, 입력 데이터에 포함된 사람, 사물, 공간의 속 성을 인식하여, 그 결과를 출력할 수 있다. 또한, 상기 학습된 심층신경망 구조(DNN)는 인식용 입력 데이터를 입력받고, 로봇청소기의 사용(Usage) 관 련 데이터(Data)를 분석하고 학습하여 사용 패턴, 사용 환경 등을 인식할 수 있다. 한편, 공간(space), 사물(Object), 사용(Usage) 관련 데이터(Data)는 통신부를 통하여 서버로 전송될 수 있 다. 서버는 수신한 데이터에 기초하여, 심층신경망(DNN)을 학습시킨 후, 업데이트된 심층신경망(DNN) 구조 데이 터를 인공지능 로봇청소기로 전송하여 업데이트하게 할 수 있다. 이에 따라, 로봇이 점점 스마트하게 되며, 사용할수록 진화되는 사용자 경험(UX)을 제공할 수 있다. 한편, 서버는 로봇청소기의 제어 및 현재 상태 등에 대한 정보를 사용자 단말에 제공할 수 있으며, 이 와 같은 로봇청소기의 제어를 위한 어플리케이션을 생성하여 배포가능하다. 이러한 어플리케이션은 사용자 단말로서 적용되는 PC용 어플리케이션일 수 있으며, 또는 스마트폰용 어플리 케이션일 수 있다. 일 예로, 본 출원인의 다양한 전자제품을 동시에 제어하고 관리 감독가능한 어플리케이션인 SmartThinQ 어플리 케이션과 같은 스마트 가전 제어를 위한 어플리케이션일 수 있다. 도 2는 본 발명의 일 실시예에 따른 로봇청소기의 사시도이고, 도 3은 본 발명의 일 실시예에 따른 로봇청소기 의 저면도이며, 도 4는 본 발명의 일 실시예에 따른 로봇청소기의 저면도의 다른 상태도이다. 도 2 내지 도 4를 참조하여, 본 실시예에 따른 회전맙의 회전으로 모션하는 로봇청소기의 구성을 간단히 설명한다. 본 발명의 일 실시예에 따른 로봇청소기는 영역 내에서 이동하며, 주행 중에 바닥면의 이물질을 제거한다. 또한, 로봇청소기은 충전대로부터 공급되는 충전전원을 배터리(미도시)에 저장하여 영역을 주행한다. 로봇청소기는 지정된 동작을 수행하는 본체와, 본체의 전면에 배치되어 장애물을 감지하는 장애물 감지부(미도시), 360도의 영상을 촬영하는 영상획득부를 포함한다. 본체는 외관을 형성하며 내측으로 본체를 구성하는 부품들이 수납되는 공간을 형성하는 케이싱(미도시)과, 회전 가능하게 구비되는 회전맙 , 본체의 이동 및 청소를 보조하는 롤러, 충전대로부터 충전전원이 공급되는 충전단자를 포 함한다. 회전맙은 케이싱에 배치되고 바닥면을 향해 형성되어 청소포가 탈부착되도록 구성된다. 회전맙는 제 1 회전판과 제 2 회전판을 포함하여, 회전을 통해 본체가 영역의 바닥을 따라 이 동되도록 한다. 본 실시예의 로봇청소기에 사용되는 회전맙의 회전 시, 로봇청소기이 실제 회전맙의 회전에 비해 이동하지 못하는 슬립이 발생한다. 회전맙은 바닥에 평행한 회전축으로 구동하는 롤링맙이나, 바닥에 거의 수직 한 회전축으로 구동하는 스핀맙을 포함할 수 있다. 회전맙이 스핀맙을 포함하는 경우, 스핀맙은 물이 포함되는 비율인 함수율에 따라 스핀맙을 회전시키는 구 동 모터의 출력 전류 값이 가변할 수 있다. 함수율이란, 스핀맙이 물을 포함하는 정도를 말하며, 함수율이 '0' 인 상태는 스핀맙에 물이 전혀 포함되지 않은 상태를 의미한다. 본 실시예에 따른 함수율은 청소포의 무게에 따 른 물을 포함하는 비율로 설정할 수 있다. 스핀맙은 청소포의 무게와 동일한 무게의 물을 포함하거나, 청소포의 무게를 초과하여 물을 포함하는 것도 가능하다. 물을 많이 포함하는 회전맙일수록 함수율이 높아지면, 물의 영향으로 바닥면과의 마찰력이 많이 발생하여 회전 속도가 감소한다. 구동모터의 회전 속도의 감소는 구동모터의 토크가 커짐을 의미하며, 이에 따라 스핀맙을 회전시키는 구동모터의 출력 전류가 커진다. 즉, 함수율이 커지면 증가하는 마찰력에 의해 스핀맙을 회전시키는 구동모터의 출력 전류가 커지는 관계가 성립한다. 또한, 제어부는 구동모터의 출력 전류를 소정 시간 동안 가변하여 다양한 정보 전달이 가능하다. 이에 대하여는 이후에 설명한다. 본 실시예에 따른 로봇청소기는 본체 내측에 배치되어 물을 저장하는 물탱크와, 물탱크에 저 장된 물을 회전맙으로 공급하는 펌프와, 상기 펌프와 물탱크 또는 펌프와 회전맙을 연 결하는 연결유로를 형성하는 연결호스를 더 포함할 수 있다. 본 실시예에 따른 로봇청소기는 한 쌍의 회전맙을 포함하고, 한 쌍의 회전맙을 회전하여 이동한다. 본체는 회전맙의 제 1 회전판 및 제 2 회전판이 회전축을 중심으로 회전 동작함에 따라 전, 후, 좌, 우로 주행한다. 또한, 본체는 제 1 회전판과 제 2 회전판(81, 82)이 회전 동작함에 따라, 부착된 청소포에 의해 바닥면의 이물질이 제거되어 습식 청소를 수행한다. 본체는 제 1 회전판 및 제 2 회전판을 구동시키는 구동부(미도시)를 포함할 수 있다. 구동부는 적 어도 하나의 구동모터를 포함할 수 있다. 본체의 상면에는 사용자로부터 로봇청소기의 제어를 위한 각종 명령을 입력받는 조작부(미도시)를 포 함하는 컨트롤 패널이 구비될 수 있다. 또한, 본체의 전면 또는 상면에는 영상획득부가 배치된다. 영상획득부는 실내 영역에 대한 영상을 촬영한다. 영상획득부를 통해 촬영된 영상을 바탕으로 실내 영역에 대한 감시뿐 아니라, 본체 주변의 장애물을 감지할 수 있다. 영상획득부는 소정 각도로 전상방향을 향해 배치되어 이동 로봇의 전방과 상방을 촬영할 수 있다. 영상획 득부는 전방을 촬영하는 별도의 카메라가 더 포함될 수 있다. 영상획득부는 본체의 상부에 배치 되어 천장을 향하도록 구비될 수 있으며, 경우에 따라 복수의 카메라가 각각 구비될 수 있다. 또한, 영상획득부 는 바닥면을 촬영하는 카메라가 별도로 구비될 수 있다. 로봇청소기는 현재의 위치정보를 획득하기 위한 위치획득수단(미도시)을 더 포함할 수 있다. 로봇청소기 은, GPS, UWB를 포함하여 현재 위치를 판단할 수 있다. 또한 로봇청소기은 영상을 이용하여 현재위치 를 판단할 수 있다. 본체에는 재충전이 가능한 배터리(미도시)가 구비되며, 배터리의 충전단자가 상용 전원(예를 들어, 가 정 내의 전원 콘센트)과 연결되거나, 상용 전원과 연결된 충전대에 본체가 도킹되어, 충전 단자가 충 전대의 단자와의 접촉을 통해 상용 전원과 전기적으로 연결되어 본체로 공급되는 충전전원에 의해 배터 리의 충전이 이루어질 수 있다. 로봇청소기를 구성하는 전장 부품들은 배터리로부터 전원을 공급받을 수 있으며, 따라서, 배터리가 충전된 상태에서 로봇청소기는 상용 전원과 전기적으로 분리된 상태에서 자력 주행이 가능하다. 이하, 로봇청소기는 습식 청소용 이동 로봇인 것을 예로 하여 설명하나, 이에 한정되지 아니하며, 영역을 자율 주행하며 소리를 감지하는 로봇이라면 적용 가능함을 명시한다. 도 4는 도 2의 이동 로봇에 청소포가 부착된 실시예가 도시된 도이다. 도 4에 도시된 바와 같이, 회전맙은 제 1 회전판 및 제 2 회전판을 포함한다. 제 1 회전판 및 제 2 회전판은 각각 청소포(91, 92)가 부착될 수 있다. 회전맙은 청소포가 탈부착 가능하게 구성된다. 회전맙는 청소포의 부착을 위한 장착부재가 제 1 회전판 및 제 2 회전판에 각각 구비될 수 있다. 예를 들어 회전맙는 청소포가 부착 및 고정되도록 벨크로, 끼움부재 등이 구비될 수 있다. 또한, 회전맙는 청소포가 제 1 회전판 및 제 2 회전판에 고정시키기 위한 별도의 보조수단으로 청소포틀(미도시)을 더 포함할 수 있다. 청소포는 물을 흡수하여 바닥면과의 마찰을 통해 이물질을 제거한다. 청소포는 면직물 또는 면혼방 등 의 재질이 사용되는 것이 바람직하나, 일정 비율 이상으로 수분을 함유하며 소정 밀도를 갖는 재질이라면 어느 것이나 사용가능 하며, 그 재질은 한정되지 않음을 명시한다. 청소포는 원형으로 형성된다. 청소포의 형태는 도면에 한정되지 않으며 사각형, 다각형 등으로 형성될 수 있으나, 제1 및 제 2 회전판 (81, 82)의 회전동작을 고려하여, 제 1 및 제 2 회전판(81, 82)의 회전동작에 방해가 되지 않는 형상으로 구성 되는 것이 바람직하다. 또한, 청소포는 별도로 구비되는 청소포틀에 의해 원형으로 그 형상이 변경될 수 있 다. 회전맙는 청소포가 장착되면, 청소포가 바닥면에 접하도록 구성된다. 회전맙는 청소포의 두께를 고려하며, 청소포의 두께에 따라 케이싱과 제 1 회전판과 제 2 회전판(81, 82)의 이격거리가 변경되 도록 구성된다. 회전맙는 청소포와 바닥면이 접하도록 케이싱과 회전판(81, 82)의 이격거리를 조정하며, 바닥면을 향해 제 1 및 제 2 회전판(81, 82)에 압력을 발생시키는 부재를 더 포함할 수 있다. 도 5는 본 발명의 일 실시예에 따른 로봇청소기의 물탱크에 형성되는 센서를 도시한 것이고, 도 6은 본 발 명의 일 실시예에 따른 로봇청소기의 제어부 및 제어부와 관련된 구성을 도시한 블록도이다. 도 5를 참고하면, 본 발명의 일 실시예에 따른 로봇청소기의 물탱크는 물이 저장되는 공간을 형성하는 물통케이스, 물통케이스 상측으로 형성되는 개구부(미도시)를 개폐하는 개구부커버, 물탱크(3 2)가 본체에 장착될 때, 공급노즐과 연결되는 토출노즐부를 포함한다. 물통케이스는, 본체에 형성되어 있는 물탱크의 장착공간에 대응하는 형상을 가진다. 따라서, 물통케이 스는, 본체가 형성하는 장착공간으로 삽입되거나, 인출될 수 있다. 물통케이스는, 물탱크가 본체에 장착될 때, 본체와 마주하는 케이스전방면, 본체 양 측면에 마주하는 케이스양측면, 케이스상부면, 케이스하부면 및 후방으로 배치되어, 외부로 노 출되는 케이스후방면을 포함할 수 있다. 물통케이스의 상측에는, 물통케이스 내측공간으로 물을 공급할 수 있도록 개구된 개구부(미도시)가 형성되고, 개구부에는, 개구부를 개폐하는 개구부커버가 배치된다. 개구부는, 케이스상부면에 형성되 고, 개구부커버는, 개구부가 형성된 케이스상부면에 배치된다. 물통케이스의 상측에는, 물탱크의 내측과 외측을 연통시키는 공기통로(222a)가 형성된다. 공기통로 (222a)는 물통케이스 상측에 장착되는 별도의 통로부재에 형성될 수 있다, 공기통로(222a)는, 케이스상부면에 형성된다. 케이스상부면은, 물탱크이 물통하우징에 장착 될 때, 물통하우징 상부면으로부터 일정간격 이격배치될 수 있다. 따라서, 물탱크이 물통하우징에 장 착된 상태에서, 물탱크 내부의 물이 토출노즐부를 통해 물탱크 외부로 빠져나가더라도, 공기통로 (222a)를 통해 외부의 공기가 물탱크 내부로 유입될 수 있다. 토출노즐부는, 케이스전방면에 배치된다. 토출노즐부는 케이스전방면에서, 좌측 또는 우측 으로 치우진 방향에서 배치될 수 있다. 본 실시예에 따른 토출노즐부는, 케이스전방면에서 좌측으로 치우치게 배치된다. 이러한 물탱크에 복수의 센서가 형성될 수 있다. 복수의 센서는 탁도 센서(310, 330) 및 수위 센서(320, 330)를 포함한다. 탁도 센서(310, 330)는 물탱크의 면에 배치될 수 있으며, 물탱크의 벽이 투광성 물질로 형성되어 있는 경우에는 외벽에 배치될 수 있다. 일 예로 서로 마주보는 케이스양측면(206a, 206b)에 배치될 수 있다. 물탱크의 외면에 배치되는 탁도 센서(310, 330)의 경우, 발광부 및 수광부를 포함하는 감지부를 포함한다. 발광부는 특정 파장대의 광을 방출하는 광원으로서, LED 광원을 포함할 수 있다. 수광부는 탁도 센서(310, 330)의 측정 방법에 따라 발광부로부터 이격하여 배치될 수 있다. 일 예로, 탁도 센서(310, 330)의 측정 방법이 투과광 측정방식인 경우, 물탱크의 한쪽에 발광부가 배 치되어 발광부로부터 빛이 조사되면 물탱크를 통과한 광의 양을 측정하는 방식이다. 따라서, 발광부 와 대응하는 물탱크의 맞은편으로 수광부가 배치되어 있다. 투과된 광의 감쇄 정도는 액 중의 현 탁물질 농도와 반비례 관계가 있다. 이와 같은 측정방법은 방식이 간단한 반면 측정액의 색도, 측정조 내부의 오염, 광원의 변동에 따라 영향을 받는다 출력되는 수광부의 감지 신호는 탁도가 증가하면 지수함수적으로 감소한다. 한편, 탁도 센서(310, 330)의 측정 방법이 표면산란광 측정방법인 경우, 물탱크에 조사된 광원이 물 중의 입자에 부딪쳐 산란되는 산란광을 광원과 90°각도에서 측정하는 방식이다. 이 광의 강도는 액 중 현탁 물질의 농도에 비례하는 것을 이용할 수 있다. 이와 달리, 탁도 센서(310, 330)의 측정 방법이 4-빔 측정 방법인 경우, 2개의 광원과 2개의 검출기로 구성되어 있다. 물탱크 주위에 90°간격으로 발광부와 수광부를 배치시키고, 처음에 제1 광원부를 켜고, 제2 수광부 에서 투과된 광을 제1 수광부에서 산란광을 측정한 뒤, 제2 광원부를 켜고 제1 수광부에서 투과된 광을 제2 수 광부에서 산란광을 번갈아가며 검출한다. 이와 같이, 투과 산란광과 같은 방식으로 측정하며 두 위상에서 측정 한 신호의 평균을 얻음으로써 탁도를 측정한다. 본 발명의 탁도 센서(310, 330)는 위의 3가지 종류 중 선택되는 방식에 따라 자유롭게 적용 가능하나 다른 센서 와 함께 구동 가능하도록 수광부 측이 일체화되어 구성될 수 있다. 한편, 물탱크에 수위 센서(320, 330)가 배치되는 경우, 수위 레벨 센서로서, 접촉식과 비접촉식 레벨 센서 일 수 있으나, 본원 발명의 경우 비접촉식 레벨 센서일 수 있다. 비접촉식 레벨 센서로서, 초음파 레벨 센서를 주로 사용할 수 있으며, 레벨을 측정하는 데는 액체면을 연속적으 로 측정하는 방법으로서, 레벨의 검지에 초음파를 이용한 것이 초음파 레벨 센서이다. 초음파 펄스를 발사하는 송신부 및 송신부의 맞은편에 배치되어 발사된 초음파를 수신하는 수신부를 포함할 수 있다. 이와 같은 송신부와 수신부는 도 5와 같이 물탱크의 외면에 서로 마주하도록 배치될 수 있 으며, 수위 센서(320, 330)의 수신부와 탁도 센서(310, 330)의 수광부가 하나의 모듈로서 형성될 수 있다. 이와 같이, 탁도 센서(310, 330)의 수광부와 수위 센서(320, 330)의 수신부는 수신된 광 또는 초음파 를 전기 신호로 변환하여 감지 신호로서 회전맙제어부에 전송한다. 이러한 감지 신호의 전송은 무선 또는 유선으로 가능하다. 한편, 도 6과 같이, 본 실시예에 따른 로봇청소기는 회전맙이 회전할 때, 본체의 기준모션에 따른 로봇청소기의 모션을 감지하는 모션감지유닛을 더 포함한다. 모션감지유닛은 로봇의 회전속 도를 검출하는 자이로센서 또는 로봇청소기의 가속도값을 감지하는 가속도센서를 더 포함할 수 있다. 또한, 모션감지유닛은 로봇청소기의 이동거리를 감지하는 엔코더(미도시)를 사용할 수 있다. 본 실시예에 따른 로봇청소기는 회전맙을 회전하고 제어하는 구동 모터에 동력을 제공하고, 구동 모터 의 출력 전류를 읽어들여 제어부로 전송하는 회전맙제어부를 포함한다. 회전맙제어부는 단순한 로직이 구현되어 있는 별도의 칩으로 형성되어 구동 모터 및 노즐과 펌프 를 포함하는 회전맙 모듈 내에 배치될 수 있다. 이와 같은 회전맙제어부는 제어부의 시작 신호에 따라 구동 모터를 회전하기 위한 전류를 전송하 고, 설정되어 있는 주기에 따라 상기 구동 모터의 출력 전류를 읽어들여 제어부에 전달한다. 회전맙제어부는 물탱크에 형성되어 있는 복수의 센서로부터 감지 정보를 읽어들여 해당 감지 정보에 따라 상기 출력 전류를 가변하여 제어부에 전송한다. 구체적으로, 상기 물탱크에 탁도 센서(310, 330) 및 수위 센서(320, 330)를 포함할 수 있으며, 탁도 센서 (310, 330) 및 수위 센서(320, 330)는 주기적으로 물탱크의 수위 및 탁도를 감지하여 회전맙제어부로 전송한다. 회전맙제어부는 이와 같은 수위 감지 신호 및 탁도 감지 신호를 수신하고, 이를 판단하여 물 공급에 이상 이 있는지 여부 및 물탱크의 물이 오염되어 있는지 여부에 대하여 판단한다. 회전맙제어부는 이와 같은 판단 결과에 따라 구동 모터의 출력 전류의 패턴을 변화시켜 제어부로 전송한다. 제어부는 회전맙제어부로부터의 출력 전류를 수신하고, 이를 분석하여 현재 노즐의 물 공급 상태 및 물탱크의 탁도 여부에 대하여 판단한다. 즉, 제어부는 구동 모터의 출력 전류에 대한 정보에 따라 로봇청소기의 물 공급 상태 및 물탱크 의 물의 오염 여부에 대하여 판단하고, 사용자에게 알람할 수 있다. 구체적으로, 제어부는 수신된 출력 전류의 파형을 분석하고, 해당 파형에 따라 물 공급에 오류가 있는지, 물탱크의 물의 오염이 있는지 또는 정상 동작인지를 판단한다. 이때, 제어부는 각 오류에 따라 전류 파형의 펄스폭을 서로 다르게 함으로써 전류 파형의 펄스폭을 읽어들 여 해당 오류를 판단할 수 있다. 각 오류에 해당하는 펄스폭에 대한 데이터는 룩업테이블 형태로 저장부에 저장되어 있을 수 있으나 이에 한정되는 것은 아니다. 제어부는 이와 같은 오류에 대하여 사용자 단말 등으로 알람을 함으로써 사용자의 주의를 환기시킬 수 있다. 한편, 로봇 청소기는 청소 구역 내 바닥에 낭떠러지의 존재 여부를 감지하는 클리프센서를 포함하는 바닥 감지부를 더 포함할 수 있다. 본 실시예에 따른 클리프센서는 로봇청소기의 전방부분에 배치될 수 있다. 또한, 본 실시예에 따른 클리프센서는 범퍼의 일측에 배치될 수 있다. 제어부는, 클리프센서를 포함하는 경우, 상기 발광 소자에서 출력된 광이 바닥에서 반사되어 상기 수광 소 자에서 수광되는 반사광의 광량에 기초하여 바닥의 재질을 판별할 수 있으나 이에 한정되는 것은 아니다. 본 실시예에 따른 로봇청소기는 구동 모터의 출력 전류값을 읽어들여 간단한 로직만을 추가함으로써 현재 주기의 물탱크의 물의 오염 여부 및 노즐의 물 분사 오류를 판단할 수 있다. 이러한 출력 전류 값에 대한 각 데이터 값은 미리 설정되어 회전맙제어부와 제어부가 서로 공유할 수 있다. 본 실시예에 따른 로봇청소기는 사용자의 명령을 입력하는 입력부를 더 포함할 수 있다. 사용자는 입 력부를 통해, 로봇청소기의 주행방법이나, 회전맙의 동작을 설정할 수 있다. 또한, 로봇청소기는 통신부를 더 포함할 수 있으며, 통신부를 통하여 서버 또는 사용자 단말로 제어부 의 판단 결과에 따른 알람 또는 정보를 제공할 수 있다. 본 실시예에 따른 로봇청소기은 한 쌍의 회전맙을 포함하고, 한 쌍의 회전맙을 회전하여 이동한다. 로봇청소기은 한 쌍의 회전맙 각각의 회전방향 또는 회전속도를 달리하여 로봇청소기 의 주행을 제어할 수 있다. 로봇청소기의 직진이동은 한 쌍의 회전맙 각각이 서로 반대방향으로 회전하여 이동할 수 있다. 이 경 우, 한 쌍의 회전맙 각각의 회전속도는 같으나 회전방향을 달리한다. 로봇청소기는 양 회전맙의 회전방향을 변경하여 전진이동 또는 후진이동을 할 수 있다. 또한, 로봇청소기는 한 쌍의 회전맙 각각이 서로 같은 방향으로 회전하여 회전이동을 할 수 있다. 로 봇청소기는 한 쌍의 회전맙 각각의 회전속도를 달리하여 제자리 회전하거나, 곡선으로 이동하는 라운 드 회전을 할 수 있다. 로봇청소기의 한 쌍의 회전맙 각각의 회전속도 비율을 달리하여, 라운드 회전 의 반경을 조정할 수 있다. 이하에서는 도 7 내지 도 10을 참조하여, 본 실시예에 따른 로봇청소기 제어하는 방법을 설명한다. 도 7은 도 1에 따른 본 발명의 로봇청소기 시스템의 전체 동작을 나타내는 순서도이다. 도 7을 참고하면, 본 발명의 일 실시예에 따른 로봇청소기가 포함되어 있는 로봇 시스템 내에서 로봇청소 기, 서버 및 사용자 단말이 서로 무선 통신을 수행하여 로봇청소기에 대한 제어를 수행할 수 있다. 먼저, 로봇 시스템의 서버는 상기 로봇청소기를 제어할 수 있는 사용자용 어플리케이션을 생산하여, 온 라인 상으로 배포가능한 상태로 보유한다.사용자 단말은 사용자용 어플리케이션을 온라인 상에서 다운로드하여 설치한다(S100). 이와 같은 사용자용 어플리케이션을 실행하여 회원가입 및 사용자가 소유하고 있는 로봇청소기를 해당 어 플리케이션에 등록하고, 해당 로봇청소기와 어플리케이션을 연동한다. 사용자 단말은 해당 로봇청소기에 대하여 다양한 기능을 설정할 수 있으며, 구체적으로 청소 주기, 물 공급 및 탁도를 확인하기 위한 주기 설정 및 이와 같은 주기에 따라 확인한 결과를 알람하는 방법 등에 대한 설 정일 수 있다(S110). 주기는 바람직하게는 1 내지 10분일 수 있으며, 더욱 바람직하게는 1 내지 6분일 수 있다. 알람 방법으로는 소리 알람 및 표시 알람을 선택할 수 있으며, 알람 주기 또한 설정가능하다. 또한, 알람 방법으로 사용자 단말의 어플리케이션 상에서 알람을 표시하는 것 이외에도 로봇청소기 자 체가 알람을 제공함으로써 사용자의 주의를 환기시키는 방법 또한 선택할 수 있다. 사용자 단말은 이와 같은 설정 정보에 대하여 어플리케이션을 통해 서버로 데이터를 전송하고(S111), 로봇청 소기로도 물 공급 및 탁도 확인 주기 및 알람 설정 정보에 대하여 무선통신을 통해 데이터를 전송한다. 다음으로, 로봇청소기는 사용자 단말의 어플리케이션으로부터 청소 시작 명령을 수신할 수 있다(S112). 이때, 사용자 단말의 어플리케이션으로부터의 시작 정보에 대하여는 서버로 전송하여 서버에서 저장 가능하다(S113). 로봇청소기는 수신된 청소 시작명령에 따라 청소를 시작하기 위해 회전맙제어부를 통한 구동 모터 및 펌프를 제어한다(S114). 이때, 로봇청소기의 제어부는 스핀맙을 회전시키는 구동 모터의 초기 전류값을 읽어들여 초기값 을 설정할 수 있다. 로봇청소기는 통신부를 통해 서버로 측정된 초기 전류값에 대한 정보를 전송할 수 있 으며, 서버는 이에 대하여 저장 가능하다. 제어부는 회전맙제어부로 제어 신호를 전송함으로써 스핀맙을 회전시키면서 주행 및 청소를 진행한다. 스핀맙은 또한 펌프 구동에 따른 노즐로부터의 물 분사에 따라 소정의 함수율을 포함한 상태에서 습식 청소를 수행한다. 이때, 제어부는 스핀맙의 회전 방향 및 회전 속도를 제어함으로써 청소 강도 및 주행을 진행할 수 있으며, 청소 영역에 따라 소정의 모드로 주행하면서 청소를 수행한다. 제어부는 소정의 주기마다 스핀맙의 구동 모터의 출력전류를 전송하도록 회전맙제어부를 제어한 다. 회전맙제어부는 구동 모터의 출력 전류를 읽어들여 주기적으로 제어부에 전송할 수 있으며, 구동 모터에 전력을 공급하여 구동 모터를 구동시킨다. 이때, 회전맙제어부는 주기적으로 물탱크의 수위 센서(320, 330) 및 탁도 센서(310, 330)로부터 감지 신호를 수신하고, 이를 분석하여 수위 변화 및 탁도 변화를 읽어낸다(S115). 회전맙제어부는 분석한 수위 변화 및 탁도 변화에 따라 물 공급 동작 및 물탱크의 오염 여부를 반영하 여 구동 모터의 출력 전류의 파형을 변화하여 제어부에 전송한다(S116). 제어부는 각 주기에 따라 수신되는 구동 모터의 출력 전류를 수신하고, 이를 분석하여 현재 물 공급 동작 및 물탱크의 오염 여부를 판단한다(S117). 제어부는 판독한 출력 전류가 물 공급 오류인 경우, 또는 물탱크의 오염을 나타내는 경우, 이를 사용 자 단말의 어플리케이션으로 해당 로봇청소기의 물 공급오류 또는 물탱크의 오염을 알람한다 (S118). 알람은 소리 및 영상 정보를 모두 포함할 수 있으며, 주기적으로 알람 가능하다. 제어부는 사용자 단말로부터 알람 확인 정보를 수신하고(S119), 펌프의 동작을 정지시킴으로써 노 즐의 물 분사 동작을 정지시키고, 주행 정지 또는 스테이션으로 복귀를 수행할 수 있다(S120). 이와 같이, 구동 모터를 제어하는 회전맙제어부로부터 주기적으로 각 센서의 감지 신호를 수신하고, 이를 구동 모터의 출력 전류 값에 반영하여 현재 물 탱크의 오염 및 물 공급 오류에 대하여 알람할 수 있다. 본 실시예에 따른 로봇 시스템은 도 1과 같은 구성을 가질 수 있으며, 도 8과 같은 동작을 수행하는 로봇청소기 가 상기 로봇 시스템 내에 존재할 때, 서버 및 사용자 단말과 연동하여 상기 구동 모터의 출력 전 류값을 이용하여 사용자에게 물공급 오류 및 오염 여부에 대한 알람을 제공할 수 있다. 이때, 물공급 오류 및 오염 여부에 대한 알람은 플리커 형태로 주기적으로 깜박임으로써 사용자의 주의를 환기 시킬 수 있다. 사용자 단말의 어플리케이션은 물공급 오류 및 오염 여부에 대한 알람과 함께 사용자에게 해당 로봇청소기 의 다음 동작에 대한 명령을 유도할 수 있다. 다음 동작으로는 마른걸레 청소 또는 청소 중지가 아이콘화되어 활성화될 수 있다. 마른 걸레 청소가 선택되는 경우에는 로봇청소기는 펌프의 동작이 중지되어 노즐로부터의 물 분사가 중지된 상태로, 스핀맙의 회전은 그대로 유지하면서 마른 걸레의 상태로 먼지 등을 부착할 수 있는 마른 걸레 청소를 수행할 수 있다. 한편, 사용자 단말의 청소 중지 아이콘이 선택되는 경우에는 로봇청소기는 펌프의 동작 및 구동 모 터의 동작이 모두 중지되어 로봇청소기의 물 분사 및 스핀맙의 회전이 중지된다. 이는 로봇청소기 가 동작을 중지한 상태로 현재 위치에서 정지하게 된다. 이때, 설정에 따라 청소 중지의 아이콘을 선택할 때, 물 분사는 중지된 상태로 스핀맙을 회전하면서 충전대 로 복귀가능하도록 설정할 수 있다. 사용자는 물공급 오류 및 오염 여부에 대한 알람이 표시되면, 이상의 동작을 선택하고 선택 정보를 로봇청소기 에 전송한다. 이와 같은 선택 정보를 수신한 로봇청소기는 수신된 선택 정보를 판독하고, 판독한 정보에 따라 동작을 수 행한다. 즉, 앞서 설명한 바와 같이 마른 걸레 청소가 선택된 경우에는 스핀맙은 회전을 유지하나 노즐의 물 분사는 중 지한 상태로 마른 걸레 청소를 진행할 수 있다. 알람은 소리 및 영상 정보를 모두 포함할 수 있으며, 주기적으로 알람 가능하다. 제어부는 이때, 펌프의 동작을 정지시킴으로써 노즐의 물 분사를 정지시키고, 주행 정지 또는 충전대 로 복귀를 수행할 수 있다. 도 8은 본 발명의 일 실시예에 따른 로봇청소기의 회전맙제어부의 제어 방법을 나타내는 순서도이고, 도 9는 도 8의 출력 전류 값을 나타내는 그래프이며, 도 10은 도 8과 연속하는 로봇청소기의 제어부 의 제어 방법을 나타내는 순서도이다. 먼저, 도 8을 참고하면, 회전맙제어부는 제어부로부터의 시작 신호에 따라 회전맙에 물을 공급하기 위하여 펌프 및 노즐을 구동한다(S10). 이때, 회전맙제어부는 주기적으로 물탱크에 배치되어 있는 탁도 센서 및 수위 센서로부터 감지 신호를 읽어들인다(S11, S17). 현재 주기에서 읽어들인 감지 신호를 분석할 때, 도 8과 같이 수위 센서(320,330)의 감지 신호로부터 현재 주기 의 수위가 이전 주기의 수위와 비교했을 때, 변화가 없는 경우 펌프 또는 노즐의 동작에 이상이 있는 것으 로 판단한다(S12). 이때, 회전맙제어부는 상기 펌프 또는 노즐의 전원이 오프상태인지, 즉 마른걸레 청소 모드인지를 판 단하여 해당 모드가 아닌 경우에 물 공급에 이상이 있는 것으로 판단한다(S13). 물 공급에 이상이 있는 경우는 펌프 또는 노즐에 이상이 있는 것을 전체적으로 나타내는 것으로서, 포괄적 으로는 물 탱크의 물 부족여부도 나타낼 수 있다. 한편, 회전맙제어부는 현재 주기에서 읽어들인 감지 신호를 분석할 때, 탁도 센서(310, 330)의 감지신호로 부터 현재 주기의 공급된 물의 탁도값이 임계값보다 작은지 여부를 판단한다(S18). 즉, 탁도값의 임계값은 물탱크의 물의 탁도가 임계값에 해당하는 경우, 해당 물로 청소를 진행할 수 없는 오염된 상태를 나타내는 것으로서, 상기 탁도 값이 임계값 이상인 경우, 청결도 이상으로서, 물탱크의 물이 오염된 것으로 판단한다(S19).이때, 회전맙제어부는 판단 결과에 따라 모터의 출력 전류의 파형을 가변한다(S15). 이와 같은 가변 기간은 소정의 값으로 정해져 있을 수 있으며, 해당 주기에서 제어부로 전송되는 동안만 유지될 수 있다. 이때, 회전맙제어부의 출력 전류의 변환은 도 9와 같을 수 있다. 일 예로, 오류가 없는 정상 동작에서 상기 구동 모터의 출력 젼류는 펄스폭 제어가 아닌 소정의 값의 전류 가 연속적으로 출력되는 도 9a와 같은 연속 파형을 나타낼 수 있다. 이와 같은 출력 전류의 절대값은 모터가 구속되었는지를 나타낼 수 있는 최대 값을 나타낼 수 있다. 이때, 상기 회전맙제어부의 판단 결과에 따라, 물 공급에 이상이 있는 것으로 판단된 경우, 도 9b와 같이 제1 폭의 펄스 신호로 변경하여 출력한다. 이때, 제1 폭(pw1)은 50 내지 70%의 펄스폭을 충족할 수 이에 한정되는 것은 아니다. 한편, 상기 회전맙제어부의 판단 결과에 따라, 물탱크의 탁도에 이상이 있는 것으로 판단된 경우, 도 9c와 같이 제2 폭(pw2)의 펄스 신호로 변경하여 출력한다. 이때, 제2 폭(pw2)은 제1 폭(pw1)과 서로 상이하고, 제1 폭(pw1)과 작은 펄스폭을 가질 수 있다. 일 예로 제2 폭(pw2)은 제1 폭(pw1)보다 작고, 20 내지 30%의 펄스폭을 충족할 수 있다. 회전맙제어부가 현재 주기에서의 판단 결과에 따라 상기 구동 모터의 출력 전류를 변경하여 제어부 에 출력하고, 해당 주기의 동작을 종료하고, 다음 주기에서 감지 신호에 대한 판단을 반복적으로 수행한다 (S16). 한편, 제어부는 도 10과 같이 회전맙제어부로부터 해당 주기에서의 구동 모터의 변경된 출력 전 류를 획득한다(S21). 이때, 상기 출력 전류 값을 분석하여 해당 전류 패턴에 변화가 있는지를 판독한다(S22). 즉, 저장부에 저장되어 있는 전류 패턴에 대한 데이터, 즉 펄스폭 파형인지 여부 및 펄스폭이 제1 폭(pw 1)인지 제2 폭(pw2)인지를 판단한다. 이때, 펄스폭이 제 1 폭(pw1)으로 판단되는 경우, 물 공급 이상으로 판단하여, 물 공급 이상 여부에 대하여 사 용자 단말 및 서버에 알람을 진행한다(S26). 한편, 펄스폭이 제2 폭(pw2)으로 판단되는 경우(S24), 청결도 이상, 즉 물탱크의 오염이 발생한 것으로 판 단하여, 동작을 종료하고 서버 및 사용자 단말로 청결도 이상에 대하여 알람을 진행한다(S25). 이와 같이, 단순한 센서를 물탱크에 설치한 후 회전맙제어부에서 상기 센서의 감지 신호에 따라 전류 파형을 변경하여 주 제어부로 결과를 전송할 수 있어 별도의 신호 판단 모듈, 신호 전송 모듈 없이 구동 모터의 출력 전류 값만으로 물 탱크 오염 및 물 공급 오류에 대하여 판단을 수행함으로써 습식 청소 시의 장애를 해소할 수 있다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한"}
{"patent_id": "10-2019-0093475", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "정되지 아니하며, 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에 서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2019-0093475", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 홈 로봇을 포함하는 스마트 홈 시스템 구성도이다. 도 2는 본 발명의 일 실시예에 따른 로봇청소기의 사시도이다. 도 3은 본 발명의 일 실시예에 따른 로봇청소기의 저면도이다. 도 4는 본 발명의 일 실시예에 따른 로봇청소기의 저면도의 다른 상태도이다. 도 5는 본 발명의 일 실시예에 따른 로봇청소기의 물탱크에 형성되는 센서를 도시한 것이다. 도 6은 본 발명의 일 실시예에 따른 로봇청소기의 제어부 및 제어부와 관련된 구성을 도시한 블록도이다. 도 7은 도 1에 따른 본 발명의 로봇청소기 시스템의 전체 동작을 나타내는 순서도이다. 도 8은 본 발명의 일 실시예에 따른 로봇청소기의 회전맙제어부의 제어 방법을 나타내는 순서도이다. 도 9는 도 8의 출력 전류 값을 나타내는 그래프이다. 도 10은 도 9와 연속하는 로봇청소기의 제어부의 제어 방법을 나타내는 순서도이다."}
