{"patent_id": "10-2021-0065585", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0157712", "출원번호": "10-2021-0065585", "발명의 명칭": "업무 분석용 단말장치", "출원인": "이태경", "발명자": "이태경"}}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "입력포트로부터 입력신호를 선택적으로 수신할 수도 있고, 출력포트로 출력신호를 반드시 송신하며, 상기 입력신호를 선택적으로 포함할 수도 있고 상기 출력신호는 반드시 포함하여 저장신호로 저장하는 저장부;상기 저장부에 입력신호가 저장되는 경우에 상기 저장부로부터 저장된 입력신호를 전달받고, 상기 전달된 입력신호에 대응하는 연산 또는 명령을 수행하며, 상기 수행된 결과의 출력신호를 상기 저장부로 전달하는 처리연산부;상기 저장부의 작동을 제어하는 제어부; 및상기 저장부, 처리연산부 및 제어부에 전원을 공급하는 전원부;를 포함하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는,상기 저장부가 정상적으로 작동하는 경우에만 상기 처리연산부에 대한 입력신호와 출력신호의 입출력을 허용하는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 전원부는 상기 저장부 및 제어부에 대해 우선적으로 전원을 공급하고,상기 저장부 및 제어부가 정상적으로 작동하는 경우에만 상기 처리연산부에 대해 전원을 공급하는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항 내지 제3항 중 어느 한 항에 있어서,상기 저장부와 연결되고, 상기 제어부에 의해 제어되는 통신부를 더 포함하고,상기 통신부는 외부서버와 통신을 수행하며,상기 통신부는 상기 저장부에 저장된 상기 출력신호를 반드시 포함하고 상기 입력신호는 포함할 수도 있는 저장신호를 상기 외부서버로 송신하고,상기 제어부는 상기 저장부와 상기 외부서버와의 통신만을 허용하는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제어부는,상기 저장부와 상기 외부서버 사이의 통신이 정상적으로 수행되는 경우에만 상기 처리연산부에 대한 입력신호의입력을 허용할 수도 있고 출력신호의 출력을 허용하는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,공개특허 10-2022-0157712-3-상기 저장부와 통신하는 상기 외부서버의 주소는, 상기 제어부 또는 저장부에 하드웨어적인 고정값으로 지정되어 있는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 제어부는,상기 외부서버로부터 상기 저장신호가 정상적으로 수신 및 저장되었다는 무결성 신호가 전송된 경우에, 상기 저장부와 상기 외부서버 사이의 통신이 정상적으로 수행되는 것으로 판정하는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,상기 외부서버는,상기 저장부로부터 전송되어 저장된 상기 저장신호에 대한 검색 및 업무분석을 제공하는 인공지능 모듈을 포함하는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서,상기 저장신호에는,업무 분석용 단말장치의 고유번호, 입력 시간, 출력 시간, 사용자 인증정보 중의 적어도 어느 하나 이상이 포함되는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 업무 분석용 단말장치는 그 전부가 폐쇄형 케이스에 수납되고,상기 폐쇄형 케이스의 봉인상태는 사전에 설정된 절차 또는 기구에 의해서만 해제될 수 있는 것을 특징으로 하는 업무 분석용 단말장치."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시되는 발명은 업무 분석용 단말장치에 관한 것으로서, 입력포트로부터의 입력신호를 수신할 수 있고, 출력포 트로의 출력신호를 송신하며, 상기 출력신호를 포함하고 상기 입력신호를 선택적으로 포함하는 신호를 저장신호 로 저장하는 저장부;와, 상기 저장부로부터 입력신호를 전달받을 수 있고, 상기 전달된 입력신호 또는 독립적으 로 입력받은 입력신호에 대응하는 연산 또는 명령을 수행하며, 상기 수행된 결과의 출력신호를 상기 저장부로 전 달하는 처리연산부;와, 상기 저장부의 작동을 제어하는 제어부; 및 상기 저장부, 처리연산부 및 제어부에 전원을 공급하는 전원부;를 포함한다."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 업무 분석용 단말장치에 관한 것으로서, 컴퓨팅 장치에 대해 출력되는 모든 데이터를 폐쇄형으로 저 장하고 입력되는 데이터는 선택적으로 저장하는 한편 저장된 데이터를 서버와 공유함으로써 모든 자료의 처리결 과를 누락 없이, 그리고 위변조의 위험 없이 분석할 수 있도록 하는 업무 분석용 단말장치에 관한 것이다."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대사회에서는 거의 대부분의 문서작업(여기서의 \"문서작업\"은 단순히 서류작업을 의미하는 것이 아니고, 각종 데이터를 다루어 유무형의 결과물을 생산하는 광의의 작업을 의미함)이 컴퓨팅 장치를 통해 이루어지며, 또한 대다수의 컴퓨팅 장치는 인터넷 등에 접속한 온라인 환경에서 운용되고 있다. 컴퓨팅 장치를 통한 문서작업은 작업의 편리성, 수정의 용이함, 데이터 관리의 보안성, 공동작업의 동시진행, 온라인 환경에서의 실시간 미팅 등 수많은 장점을 가지고 있다. 그러나, 다른 한편으로는 중간 결과물을 따로 저장하지 않으면 최종 결과물에는 그 흔적이 남지 않기 때문에 작업의 이력을 파악하기 어렵고, 수정이 용이하 다는 것은 위변조의 개변이 이루어질 가능성을 염려하게 되며, 온라인 환경에서의 불법적인 해킹에 의해 중요한 데이터의 말소나 변경 등이 일어날 위험이 상존하게 된다.이러한 점에서 업무의 이력을 체계적이고 안전하게 관리하는 것은 매우 중요하다. 이는 비단 사적인 영역에서 업무의 이력을 관리한다는 측면에서만이 아니라, 오히려 신뢰성과 투명성이 담보되어야 하는 공적인 영역에서 더욱 중요할 수 있다. 그렇지만, 현재까지 데이터의 관리는 주로 소프트웨어적인 측면에서 이루어져 왔는데, 알고리즘의 미세한 수정 에도 문제가 발생할 수 있고 외부의 불법적인 해킹을 원천적으로 방지할 수는 없기에 이에 대한 보안이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2039340호 (2019.10.28 등록)"}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 컴퓨팅 장치에 대해 입출력되는 모든 데이터 중 적어도 출력되는 모든 데이터를 반드시 포함하여 하 드웨어적으로 안전하게 보관하고 관리할 수 있는 업무 분석용 단말장치를 제공하는데 그 목적이 있는 것이다."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 업무 분석용 단말장치에 관한 것으로서, 입력포트로부터 입력신호를 수신할 수도 있고, 출력포트로 출력신호를 송신하며, 상기 입력신호 또는 출력신호 중 적어도 상기 출력신호를 반드시 포함하여 저장신호로 저 장하는 저장부;와, 상기 저장부로부터 입력신호를 전달받을 수도 있고, 상기 전달된 입력신호가 있는 경우에 대 응하는 연산 또는 명령을 수행하며, 상기 수행된 결과의 출력신호를 상기 저장부로 전달하는 처리연산부;와, 상 기 저장부의 작동을 제어하는 제어부; 및 상기 저장부, 처리연산부 및 제어부에 전원을 공급하는 전원부;를 포 함한다. 여기서, 상기 제어부는, 상기 저장부가 정상적으로 작동하는 경우에만 상기 처리연산부에 대한 출력신호의 출력 을 허용하고, 입력신호의 입력을 허용할 수도 있는 것이 바람직할 수 있다. 또한, 상기 전원부는 상기 저장부 및 제어부에 대해 우선적으로 전원을 공급하고, 상기 저장부와 제어부가 정상 적으로 작동하는 경우에 대해서 상기 처리연산부에 대해 전원을 공급할 수 있다. 그리고, 본 발명의 일 실시형태에서, 상기 저장부와 연결되고, 상기 제어부에 의해 제어되는 통신부를 더 포함 하고, 상기 통신부는 외부서버와 통신을 수행하며, 상기 통신부는 상기 저장부에 저장된 저장신호를 상기 외부 서버로 송신하고, 상기 제어부는 상기 저장부와 상기 외부서버와의 통신만을 허용할 수 있다. 여기서, 상기 제어부는, 상기 저장부와 상기 외부서버 사이의 통신이 정상적으로 수행되는 경우에만 상기 처리 연산부에 대한 입력신호 및 출력신호의 입출력을 허용할 수 있다. 또한, 상기 저장부와 통신하는 상기 외부서버의 주소는, 상기 제어부 또는 저장부에 하드웨어적인 고정값으로 지정되어 있을 수 있다. 그리고, 상기 제어부는, 상기 외부서버로부터 상기 저장신호가 정상적으로 수신 및 저장되었다는 무결성 신호가 전송된 경우에, 상기 저장부와 상기 외부서버 사이의 통신이 정상적으로 수행되는 것으로 판정할 수 있다. 그리고, 상기 외부서버는, 상기 저장부로부터 전송되어 저장된 상기 저장신호에 대한 검색 및 업무분석을 제공 하는 인공지능 모듈을 포함할 수 있다. 그리고, 상기 저장신호에는, 업무 분석용 단말장치의 고유번호, 입출력 시간, 사용자 인증정보 중의 적어도 어 느 하나 이상이 포함될 수 있다. 한편, 본 발명의 업무 분석용 단말장치는 그 전부가 폐쇄형 케이스에 수납되고, 상기 폐쇄형 케이스의 봉인상태 는 사전에 설정된 절차 또는 기구에 의해서만 해제될 수 있다."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성을 구비한 본 발명의 업무 분석용 단말장치는 컴퓨팅 장치에서 입력되는 신호를 선택적으로 포 함하고 출력되는 모든 신호를 반드시 포함하여 폐쇄형 저장부에 우선적이고 일괄적으로 저장신호로 저장 함에 따라 컴퓨팅 장치에서 진행하는 모든 작업의 이력을 손실 없이 기록할 수 있다. 이를 통해 필요할 때에 업 무분석을 효과적으로 진행할 수 있다. 그리고, 저장부는 컴퓨팅 장치의 처리연산부보다 상위를 차지하도록 하드웨어적으로 구성되어 있기에, 외부에서 처리연산부로 직접적인 접근이 불가능하고, 이에 따라 저장부에 남겨진 데이터의 개변이나 위변조가 원천적으로 차단됨으로써 데이터의 신뢰성이 담보된다. 또한, 물리적으로 분리되고 물리적으로 접속이 고정된 외부서버에 저장부의 데이터에 대한 복사본을 남겨놓음으 로써 안정성과 데이터의 신뢰성을 더욱 향상시킬 수 있다."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 상세 한 설명으로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0065585", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리 고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것 이다. 그러나 본 발명은 이하에서 개시되는 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것 은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 본 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는 (comprising)\"은 언급된 구성 요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 구성 요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는 다. 도 1은 본 발명의 일 실시형태에 따른 업무 분석용 단말장치의 구성을 도시한 도면으로서, 첨부된 도면을 참조하여 본 발명의 기본적인 실시형태에 대해 상세히 설명한다. 도 1에 도시된 바와 같이, 본 발명에 따른 업무 분석용 단말장치는 출력포트, 저장부, 제어부 , 처리연산부, 전원부를 필수적으로 포함하고,입력포트는 선택적으로 포함한다. 입력포트와 출력포트는 컴퓨팅 장치에 구비되는 각종 입출력 포트를 의미하는 것이며, 본 발명에서는 저장부에 출력포트가 필수적으로 연결되고 입력포트는 선택적으로 연결된다. 이에 따라, 저장부 가 입력포트로부터 입력신호를 수신할 수 있고, 또한 저장부가 출력포트로 출력신호를 송 신한다. 그리고, 저장부는 출력신호를 반드시 포함하고 입력신호를 선택적으로 포함하여 저장신호로 저장할 수 있다. 여기서, 저장부의 신호 저장은 기본적으로 비휘발성 저장인 것이 바람직할 수 있다. 또한, 출력신호를 반 드시 포함하고 입력신호를 선택적으로 포함하여 저장하는 저장부는 컴퓨팅 장치에 일반적으로 구비되는 보 조기억장치(하드디스크나 SSD 등)와는 구별되는 별도의 저장장치로 이해될 필요가 있다. 즉, 도 1에는 별도의 보조기억장치가 도시되어 있지 않지만, 만일 보조기억장치를 구비하는 경우라면 도시된 저장부와는 별개로 서 처리연산부에 대해 추가되어야 한다. 처리연산부는 저장부에 입력신호가 저장되는 경우에 저장부로부터 입력신호를 전달받고, 전달된 입력신호에 대응하는 연산 또는 명령을 수행하며, 그 수행된 결과의 출력신호를 저장부로 전달한다. 본 발 명에서의 처리연산부는 컴퓨팅 장치의 중앙처리장치 및 중앙처리장치가 탑재되는 마더보드에 해당하는 것으로 이해할 수 있다. 이러한 저장부의 작동은, 처리연산부와는 별개로 구비되는, 제어부에 의해 통제된다. 특히, 본 발명은 저장부 및 제어부가 데이터 처리 체계상 컴퓨팅 장치인 처리연산부의 상위에 위치한다. 즉, 연산처리부는 독립적으로 입력신호를 입력받은 경우나 저장부가 제공하는 입력신호를 전달받을 경우에 대해서, 입력신호에 대응하는 연산 또는 명령을 수행한 결과를 직접 출력포트로 전송하지 못하고 저장부로 보내는, 저장부의 하위요소로 기능하게 된다. 따라서, 본 발명의 업무 분석용 단말장치는 저장부(20 0)를 거치지 않는 데이터의 출력이 필수적으로 하드웨어적으로 불가능하게 설계되어 있고 입력은 선택적으로 하 드웨어적으로 불가능할 수 있도록 설계될 수 있으며, 이에 따라 연산처리부의 모든 처리결과를 관리할 수 있게 되고, 연산처리부로 입력될 신호를 선택적으로 저장부가 저장하게 되므로 바이러스로부터 저장부가 보호될 수 있어, 안정성이 증진된다. 또한 제어부와 연산처리부의 운영체제를 달리하여 해킹으로부터 제어부와 저장부 를 안전하게 방어하는 것이 용이하여 연산추리부에서 일어난 이벤트를 안정적으로 저장-관리하는 것이 가능하다. 이와 같이, 본 발명은 구조적으로 저장부가 최상위 요소로 설계되었기에, 저장부의 정상적인 작동이 매우 중요하다. 이러한 저장부의 정상작동을 보장하기 위해, 제어부는 저장부가 정상적으로 작 동하는 경우에만 처리연산부에 대한 신호의 입출력을 허용하는 것이 바람직하다고 볼 수 있다. 나아가 본 발명의 업무 분석용 단말장치는 저장부, 처리연산부 및 제어부에 전원을 공급하 는 전원부를 포함하는데, 전원부가 저장부 및 제어부에 대해 우선적으로 전원을 공급하고, 그 이후에 저장부가 처리연산부에 대해 전원을 공급하는 계층적 전원공급 구조로 설계될 수 있다. 즉, 전원공급에 있어서 저장부 및 제어부에 대해 최우선 순위를 부여함으로써, 구조적으로 더욱 확실 하게 저장부의 정상작동이 업무 분석용 단말장치 작동의 선행조건이 되도록 구성할 수 있는 것이다. 도 2는 본 발명의 다른 실시형태에 따른 업무 분석용 단말장치의 구성을 도시한 도면으로서, 도 2의 실시형 태는 저장부와 연결되어 있고 또한 제어부에 의해 제어되는 통신부를 더 포함하고 있다. 통신부는, 제어부의 통제하에서, 외부서버와 통신을 수행하며, 통신부는 저장부에 저 장된 저장신호를 외부서버로 송신한다. 이는 저장부에 기록되는 저장신호의 복사본을 물리 적으로 분리된 외부서버에 저장하기 위한 것이다. 외부서버에 저장신호의 복사본을 백업해놓음 으로써 더욱 확실하게 처리연산부의 이벤트를 관리할 수 있고, 저장된 데이터의 신뢰성과 완전성을 보증할 수 있게 된다. 이러한 저장된 데이터의 신뢰성을 하드웨어적으로 보증하기 위해, 제어부는 저장부와 외부서버 와의 통신만을 허용할 수 있다. 이는 저장부가 해당 외부서버와만 통신할 수 있다는 것과, 처리연산 부가 통신부를 통해 외부와 통신을 할 수 없다는 양자의 의미를 가진다. 이를 통해, 저장부 및 제어부에 대한 외부 접속이 극히 제한됨으로써 저장부에 담긴 데이터의 신뢰성이 높은 수준으로 보장 된다. 필요하다면, 저장부와 통신하는 상기 외부서버의 주소가 제어부 또는 저장부에 하드 웨어적인 고정값으로 지정됨으로써, 저장부가 오직 정해진 외부서버와만 통신을 하도록 불변으로 고 정될 수도 있다. 그리고, 저장부와 외부서버에 각각 저장된 저장신호는 서로 완벽하게 일치되는 것이 보장되어야 한다. 이를 위해, 제어부는, 저장부와 외부서버 사이의 통신이 정상적으로 수행되는 경우에만 처리연산부에 대한 신호의 입출력이 설정에 맞게 허용할 수 있다. 즉, 외부서버에서의 데이터 저장이 정상적으로 이루어지지 않으면, 업무 분석용 단말장치의 작동 자체를 제한하는 것이다. 이를 통해 외부서버 에 대한 데이터의 저장이 보장되지 않는 상황이라면 업무 분석용 단말장치의 작동을 한시적으로 정지하고, 아울러 저장부와 외부서버에서의 데이터 저장이 최소한의 시간차 안에서 이루어지도록 함으로 써 전송 중의 데이터 손실 위험은 극단적으로 감소하고 양 데이터의 동일성은 더욱 확실히 보증된다. 예를 들어, 제어부는 외부서버로부터 저장신호가 정상적으로 수신 및 저장되었다는 무결성 신호가 전 송된 경우에, 저장부와 외부서버 사이의 통신이 정상적으로 수행되는 것으로 판정할 수 있을 것이다. 추가적으로, 외부서버는, 저장부로부터 전송되어 저장된 저장신호에 대한 검색 및 업무분석을 제공하는 인공지능 모듈을 포함할 수 있다. 검색 기능은 대단위 정보 중에서 필요한 조건을 만족하는 데이 터를 추출하여 제시하는 것이고, 업무분석은 예컨대 특정 자료를 완성하는데 소요된 시간, 완성까지의 수정 횟 수, 다수의 사용자를 대상으로 하여 동등한 작업을 완료하는데 소요된 시간에 대한 통계를 통한 작업효율성 분 석, 일정 기간 동안 해당 자료가 사용된 횟수 등의 다양한 분석을 통해 해당 업무의 중요도, 난이도, 필요성, 문제점 등을 입체적으로 파악할 수 있도록 보조하는 것이다. 또한, 이미지 파일에서 특정한 문자, 음성신호에서 특정한 음성이나 단어 등을 검출할 수 있고 또 해석할 수 있으므로, 연산처리부를 거쳐간 이벤트 전반에 대한 검색 및 분석이 가능하다. 경우에 따라서는 실시간으로 분석을 진행하여, 개별 연산처리부에 대해 정 상작동이나 부정사용 및 비정상작동 등을 판정하여, 필요한 조치를 취할 수 있다. 그리고, 저장부, 또는 저장부 및 외부서버에 저장되는 저장신호에는, 업무 분석용 단말장 치의 고유번호, 입력신호, 출력 시간, 사용자 인증정보 중의 적어도 어느 하나 이상이 포함될 수 있다. 즉, 해당 저장신호가 생성된 업무 분석용 단말장치가 무엇인지, 사용자가 누구인지 등에 대한 정보를 함께 저장함으로써 해당 출력신호의 출처를 명확히 할 수 있다. 한편, 본 발명의 업무 분석용 단말장치는 그 전부가 폐쇄형 케이스에 수납될 수 있으며, 이를 통해 저 장부에 대한 보안성을 향상시킬 수 있다. 그리고, 필요하다면 폐쇄형 케이스의 봉인상태는 사전에 설 정된 절차 또는 기구에 의해서만 해제될 수 있도록 제한함으로써 승인되지 않은 하드웨어적 접근을 봉쇄할 수도 있다. 사전에 설정된 절차라 함은 특정 순서에 따라 복수의 잠금수단을 차례로 해체하는 절차를 예로 들 수 있 으며, 사전에 설정된 기구는 시중에서는 구할 수 없는 특수한 기구를 이용해야만 봉인을 해제할 수 있는 것을 예로 들 수 있다. 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0065585", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시형태에 따라 입력신호와 출력신호 모두가 저장신호로 저장되는 업무 분석용 단말 장치의 구성을 도시한 도면. 도 2는 본 발명의 다른 실시형태에 따른 업무 분석용 단말장치의 구성을 도시한 도면. 도 3은 본 발명의 일 실시형태에 따라 출력신호 모두가 저장신호로 저장되는 업무 분석용 단말장치의 구성 을 도시한 도면."}
