{"patent_id": "10-2024-0044515", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0047350", "출원번호": "10-2024-0044515", "발명의 명칭": "안전, 작업, 공사, 제조 관리의 수단, 기술, 장비, 방법, 시스템", "출원인": "주식회사 한국산업기술원", "발명자": "정하익"}}
{"patent_id": "10-2024-0044515", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "안전관리 시스템으로서,상기 시스템은 a) 웨어러블 수단과; 상기 수단에 구비된 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기 중에서 선택된 하나 이상의 기구와; 상기 수단을 착용한 사람의 스마트폰과;상기 기구에 전기를 공급하는 배터리와;상기 배터리가 내장되는 것으로 상기 수단에 형성된 포켓과; 상기 기구와 스마트폰에 연계되는 통신장치와;상기 통신장치에 연계되는 통신망과;상기 통신망에 연계되는 서버와;상기 서버 또는 통신망에 연계되는 단말기; 로 구성되거나,b) 또는 웨어러블 수단; 상기 수단의 전면에 구비된 기구인 센서, 버튼, 랜턴, 카메라, 무전기, 알림기;상기 수단의 후면에 구비된 기구인 램프, 카메라, 제어기;상기 수단을 착용한 사람의 스마트폰;상기 기구에 전기를 공급하는 배터리;상기 배터리가 내장되는 것으로 상기 수단에 형성된 포켓; 상기 기구와 배터리에 연결되는 전선;상기 기구와 스마트폰에 연계되는 통신장치;상기 통신장치에 연계되는 통신망 또는 이동통신망;상기 통신망에 연계되는 서버 또는 클라우드서버;상기 서버 또는 통신망에 연계되는 컴퓨터, 핸드폰, 태블릿 중에서 선택된 하나 이상의 단말기;상기 서버와 단말기가 구비된 중앙관제센터; 로 구성되거나,c) 또는 웨어러블 수단; 상기 수단의 전면 또는 내부에 구비된 센서; 상기 센서에 포함되는 위치센서, 생체센서, 가스센서, 환경센서, 공기질센서;상기 전면에 구비되면서 상기 센서에 이격된 버튼 또는 SOS버튼;상기 전면에 구비되면서 상기 버튼에 이격된 랜턴;상기 전면에 구비되면서 상기 랜턴에 이격된 카메라;상기 전면에 구비되면서 상기 카메라에 이격된 무전기;상기 무전기에 포함되는 마이크, 스피커;공개특허 10-2024-0047350-3-상기 전면에 구비되면서 상기 무전기에 이격된 알림기; 상기 수단의 후면에 구비된 램프;상기 수단의 후면에 구비되면서 상기 램프에 이격된 카메라;상기 수단의 후면에 구비되면서 상기 카메라에 이격된 제어기;상기 수단을 착용한 사람의 스마트폰;상기 센서 내지 스마트폰 중에서 선택된 하나 이상의 기구에 전기를 공급하는 배터리;상기 배터리가 내장되는 것으로 상기 수단에 형성된 포켓; 상기 기구와 배터리에 연결되는 전선;상기 기구에 연계되는 통신장치;상기 통신장치에 포함되는 LTE, WiFi, Bluetooth, 게이트웨이;상기 통신장치에 연계되는 통신망;상기 스마트폰을 인식하여 상기 스마트폰을 통신망에 연결하는 비콘(beacon);상기 통신망에 연계되는 서버;상기 서버 또는 통신망에 연계되는 단말기;상기 단말기에 포함되는 컴퓨터, 핸드폰, 태블릿; 상기 서버와 단말기가 구비된 중앙관제센터; 상기 스마트폰과 단말기에 설치되는 어플리케이션 또는 어플리케이션 파일; 상기 스마트폰과 통화되는 상기 핸드폰; 상기 수단에 구비된 무전기와 통화되는 상기 중앙관제센터에 구비된 무전기;상기 수단에 포함되는 헬멧, 조끼, 멜빵, 손목밴드, 워치, 안전고리;상기 수단에 구비된 자기장기;상기 중앙관제센터에 구비된 오존기;상기 중앙관제센터에 구비되면서 상기 오존기에 이격된 음이온기;상기 중앙관제센터에 구비되면서 상기 음이온기에 이격된 청정기; 로 구성되는 것을 특징으로 하는 안전관리 시스템"}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 a) 사람, 로봇, 근로자, 작업자, 출입자, 장비, 거치대 등에 착용되는 수단, 필드수단, 웨어러블수단, 의류, 조끼, 헬멧, 밴드, 워치, 멜빵; b) 작업에 이용되는 드론, 장치, 장비, 로봇, 계측기; c) 상기 수단 내지 계측기 등에 구비되는 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 오존기, 음이 (뒷면에 계속)"}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 일정 수단, 필드 수단, 웨어러블 수단, 의류, 조끼, 헬멧, 밴드, 워치, 멜빵; 이중 하나가 이용되는 작업, 공사, 건설, 건축, 안전관리, 공사관리, 작업관리, 공장, 현장, 작업장, 방법, 공법, 장비, 장치, 드론, 시스템; 등에 관한 것이다."}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 산업, 공장, 현장, 작업장 등은 많은 위험요소를 가지고 있으며, 제조, 생산, 건설, 공사, 작업 등 에서 많은 재해, 사건, 사고 등이 발생되고 있다. 특히 제조업, 건설업, 공사업 등은 많은 작업 인력이 투입되 고 여러 작업이 동시다발적으로 일어나는 노동집약적인 산업이다. 따라서 이에 투입되는 인력 및 장비에 대한 체계적이며 효과적인 안전관리가 무엇보다 중요하다. 산업현장에서는 현장 자체에 내재되어 있는 다양한 환경으 로 인한 위험성과 작업자의 사소한 부주의로 인해 사고 및 재해가 빈번하게 발생되고 있다. 국내의 경우 산업재해를 줄이기 위하여 1981년부터 산업안전보건법이 시행되었고, 중대재해를 방지하기 위하여 2022년부터 중대재 해처벌법이 시행되었다. 특히 중대재해법 시행으로 산업계, 건설업 등은 사고방지를 위한 대책을 더욱 면밀하게 강구하여야 한다. 특히 건설업의 경우 타산업에 비하여 사고발생 비율이 높기 때문에 사고 및 재해에 대한 대책 을 더욱 강화하여야 한다. 통상 작업을 관리하는 관리자는 현장 근로자에 비해 매우 적기 때문에 관리자의 통제 및 관리가 제대로 이루어지지 않거나 또는 비관리 영역이 발생하게 된다. 이에 의하여 작업을 수행하는 근로자 가 현장 내 위험요소로 접근하거나 또는 부주의하게 작업을 수행하게 되는 문제점이 있게 된다. 일부 현장에서는 다양한 시설, 구조, 소음, 진동, 분진, 전파간섭이나, 위치추적, 유/무선통신, GPS사용 등의 어려움으로 사건, 사고, 재해, 가스, 오염, 낙상 등이 발생하는 경우가 있다. 그리고 작업자에게 일어난 사고나 상황이 관리자에게 실시간 또는 신속하게 전달되지 못하여 발생하는 피해들이 많다. 또한 안전문제, 사고발생, 재해발생, 산업발달, 기계발달, 인구감소, 작업자감소, 인력부족, 직공부족, 전문가부족, 3D업무기피, 힘든업무 기피, 공사비절감, 열악한작업, 열악한환경, 주5일근무, 작업시간단축 등에 의하여 일, 업무, 사무, 생활, 작업, 제조, 생산, 공사, 건설, 건축 등에 있어서 무인화, 자동화, 기계화, 로봇화, 안전화, 시스템화, 자동제 어, 원격제어, 오토메이션 등이 요구되고 있다. 그리고 양질의 재료, 자재, 제품, 물품, 상품, 시설, 건물, 도 로, 교량, 구조물 등이 조성되고, 안전한 일, 작업, 업무, 제조, 생산, 공사, 건설, 건축, 시공 등이 되기 위해 서는 최적의 QC, QA, 품질시험, 품질관리, 품질인증, 품질보증 등이 시행되어야 한다. 최근에 공기, 대기, 수질, 토양, 환경, 공간, 공장, 현장, 건물, 주택, 생활, 주거, 사람, 생태계 등에 균, 세 균, 오염, 먼지, 분진, 황사, 중금속, 오염물, 폐기물, 박테리아, 바이러스, 미세먼지, 새집증후군, 환경호르몬, 포름알데히드 등이 많이 존재하여 이의 청정, 정화, 정수, 청소, 세척, 살균, 멸균, 소독, 방역, 방제, 처리, 크리닝, 에코처리 등이 요구되고 있다. 현재 각종 분야에서 IT, IC, AI, VR, AR, MR, 5G, ICT, IoT, IoE, BIM, LTE, WiFi, 메타, 버스, 소자, 에코, 바이오, 반도체, 딥러닝, 시스템, 아바타, 융합기술, 빅 데이터, 클라우드, 웨어러블, 메타버스, 생명공학, 생명기술, 4차산업기술 등이 이용되고 있다. 이의 새로은 기 술이 상기의 산업, 공장, 현장, 작업장, 사고방지, 재해방지, 일 내지 건축, 청정 내지 크리닝 등에 이용된다면 매우 유익할 것이다. 이상의 문제점을 개선하기 위하여 안전, 사고방지, 재해방지, 안전화, 무인화, 자동화, 기 계화, 로봇화, 품질, 청정, 정화, 살균, 소독, 방역, 방제, 에코, 바이오, 메타버스 등에 대한 관리, 대책, 대 안, 기술, 방법, 공법, 방안, 시스템 등의 고안이 필요한 실정이다."}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 일정수단, 안전수단, 필드수단, 웨어러블수 단, 드론, 장비, 장치, 로봇, 센서, 카메라, 계측기, 청정기, 정화기, 살균기, 소독기, 방역기, 에코재, 바이오 재 등을 이용하여 작업환경 관찰, 작업상태 파악, 작업자 상태 파악, 작업자의 작업강도 파악, 작업자의 건강상 태 파악, 작업자의 비상버튼 작동, 작업자에게 얼람 전송, 사고 발생여부 감지, 위험상황 경고, 알림서비스 제 공, 작업자에게 전송, 관리자에게 전송, 작업자의 안전관리, 사고 미연 방지, 무인화, 자동화, 기계화, 로봇화, 안전화, 시스템화, 고품질화, 청정, 정화, 정수, 청소, 세척, 살균, 소독, 방역, 방제, 크리닝, 메타버스화, 안 전시스템 구축, 자동시스템 구축, 품질시스템 구축, 방역시스템 구축, 환경시스템 구축 등을 하는 것을 목적으 로 한다."}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여 본 발명에서는 a) 사람, 근로자, 작업자, 출입자, 아바타, 로봇 등에 착용되는 수단, 필드 수단, 웨어러블 수단, 의류, 조끼, 헬멧, 밴드, 워치, 멜빵; b) 작업에 이용되는 드론, 항 공기, 장치, 장비, 로봇, 물질, 재료, 자재, 계측기, 청정기, 정화기, 살균기, 소독기, 방역기, 에코재, 바이오 재, 작업장비; c) 상기 수단 내지 작업장비 등에 구비되는 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 발전기, 오존기, 음이온기, 청정기, 바이오, 히터, 쿨러; d) 상기 수단 내지 쿨러 등 에 연계되는 LTE, WiFi, 비콘, 게이트웨이, 통신장치, 통신망, 서버, 클라우드, 처리장치, 단말기, 관제센터; e) 상기 수단 내지 관제센터 등에 이용되는 하드웨어, 소프트웨어, 어플리케이션; f) 상기 수단 내지 어플리케 이션 등이 이용되는 작업, 제조, 생산, 품질, 공사, 건설, 건축, 안전, 제어, 케어, 청정, 정화, 정수, 청소, 세척, 살균, 소독, 방역, 방제, 크리닝, 관리, 안전관리, 품질관리, 자동관리, 원격관리, 출입관리, 공사관리, 작업관리, 환경관리, 방역관리, 건강관리, 냉난방관리; g) 상기 수단 내지 관리 등이 이용되는 공간, 환경, 공 장, 가정, 현장, 주택, 사무실, 작업장, 산업현장; h) 상기 수단 내지 산업현장 등에 관련되는 방법, 공법, 대책; i) 또는 사람, 로봇, 작업자, 관리자, 총괄자, 앱이용자 등에 구비되는 상기 수단 내지 대책; j) 상기 수단 내지 대책 등이 이용되는 메타버스, 안전관리방안, 자동관리방안, 재해방지방안, 작업관리방안, 공사관리방안, 방역관리방안, 청정관리방안; k) 상기 수단 내지 청정관리방안 등이 반영되는 자동관리시스템, 품질관리시스템, 재해방지시스템, 작업관리시스템, 공사관리시스템, 청정관리시스템, 방역관리시스템, 안전관리시스템; 등을 고 안하거나, 또는 등을 하고자 한다."}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서는 a) 일정 수단, 필드 수단, 웨어러블 수단, 드론, 장비, 장치, 로봇, 센서, 물질, 재료, 자재, 카 메라, 계측기, 청정기, 정화기, 살균기, 소독기, 방역기, 통신장치, 통신망, 서버, 단말기, 클라우드, 빅데이터, 처리장치, 어플, 에코재, 바이오재, 에코기술, 바이오기술 등을 고안하고, b) 상기 수단 내지 바이오 기술 등에 의하여 관리, 업무관리, 작업관리, 출입관리, 안전관리, 품질관리, 원격관리, 자동관리, 무인관리, 공사관리, 방역관리, 환경관리, 청정관리, 작업환경 측정, 작업환경 관찰, 작업 동영상 제공, 생방송 방영, 라 이브 스트리밍, 작업상태 파악, 작업자 상태 파악, 작업자의 작업강도 파악, 작업자의 건강상태 파악, 작업자의 비상버튼 작동, 작업자에게 얼람 전송, 사고 발생여부 감지, 위험상황 경고, 알림서비스 제공, 작업자에게 전송, 관리자에게 전송, 사고 미연 방지, 실시간 비상연락, 응급사고 지원, 현장과 본사 간에 실시간 연결, 실 시간 동영상 제공, 앱이용 실시간 정보제공 등을 하고, c) 상기 수단 내지 바이오기술, 관리 내지 정보제공 등 에 의하여 사고방지, 재해방지, 무인화, 자동화, 로봇화, 메타버스화, 품질개선, 방역작업, 오염방지, 환경개선, 공기청정, 수질개선 등을 하고, d) 최종적으로 효율적이고 체계적인 상기 수단 내지 안전관리시스템 등을 구축하는 효과를 제공한다. 그리고 a) 최적의 작업, 업무, 생활, 공사, 건설, 건축, 안전, 품질, 자동, 방 역, 환경, 재료, 자재, 제품, 물품, 상품, 시설, 건물, 도로, 교량, 구조물 등을 고안하고, b) 상기 IT 내지 4 차산업기술 등을 적용하고, c) 상기 균 내지 포름알데히드 등을 제거하고, d) 최적의 품질시험(QC, quality test), 품질관리(QC, quality control), 품질인증(QC, quality certification), 품질보증(QA, quality assurance) 등을 고안하고, e) 상기 작업 내지 구조물 등에 대한 적정의 관리, 대책, 대안, 기술, 방법, 공법, 방안, 시스템 등을 제공하는 효과를 가진다."}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 일정의 수단, 필드수단, 웨어러블수단, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리, 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기, 드론, 장비, 장치, 로봇, 아바타, 청정기, 정화기, 살균기, 소독기, 방역기, 통신장치, 통신망, 서버, 처리장치, 단말기, 클 라우드, 어플, 사물, 만물, 물질, 재료, 자재, 에코재, 바이오재, 자동관리시스템, 환경관리시스템, 안전관리시 스템, 이중 둘 이상이 조합된 복합수단 등이 이용되는 a) 일, 작업, 업무, 제조, 생산, 공사, 건설, 안전, 제어, 케어, 사고방지, 재해방지, 안전화, 무인화, 자동화, 기계화, 로봇화, 고품질화, 청정, 정화, 살균, 소독, 방역, 방제; b) 이중 하나의 앱, 관리, 운영, 대책, 대안, 기술, 기법, 방법, 공법, 방안, 시스템, 플랫 폼, 제어기, 컨트롤러, 메타버스; 등에 관한 것이다. 본 발명은 a) 일정의 수단, 사람, 인간, 로봇, 동물, 작업자, 근로자, 출입자, 아바타, 장비, 삼각대, 거치대; b) 이중 하나에 착용된 필드수단, 웨어러블수단, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리; c) 상기 수단 내지 안전고리 등에 구비된 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기; d) 또는 현장, 공장, 농장, 가정, 작업장 등에 구비된 물질, 재료, 자재, 에코재, 바이 오재, 드론, 장비, 장치, 제품, 가전, 로봇, 청정기, 정화기, 살균기, 소독기, 방역기; e) 상기 사람 내지 방역 기 등에 연계되는 통신장치, 통신망, 서버, 처리장치, 단말기, 클라우드; f) 상기 수단 내지 클라우드 등에 설 치되는 앱, 어플; g) 상기 수단 내지 어플 등이 포함되는 사물, 만물; h) 상기 수단 내지 만물 등이 이용되는일, 작업, 업무, 제조, 생산, 공사, 건설, 안전, 제어, 케어; i) 상기 수단 내지 케어 등에 의한 사고방지, 재 해방지, 안전화, 무인화, 자동화, 기계화, 로봇화, 고품질화, 청정, 정화, 살균, 소독, 방역, 방제; j) 상기 수 단 내지 방제 등을 제어하는 조종기, 제어기, 컨트롤러, 리모트컨트롤; k) 상기 수단 내지 리모트컨트롤 등에 관한 앱, 관리, 운영, 대책, 대안, 기술, 기법, 방법, 공법, 방안, 시스템, 플랫폼, 메타버스; ℓ) 상기 수단 내지 메타버스 등을 관리하는 관리시스템, 자동관리시스템, 품질관리시스템, 환경관리시스템, 안전관리시스템; m) 상기 수단 내지 안전관리시스템 중 둘 이상이 조합된 복합수단; 등에 관한 것이다. 본 발명에서는 a) 일정의 일, 작업, 업무, 생활, 주거, 제조, 생산, 공사, 건설, 건축, 시공 등이 되고, b) 이 에 장비, 장치, 드론, 로봇, 3D프린터, 사람, 인간, 근로자, 작업자, 아바타, 물질, 재료, 자재, 에코재, 바이 오재 등이 이용되고, c) 상기 일 내지 시공, 장비 내지 바이오재 등에 의하여 시설, 건물, 주택, 도로, 교량, 터널, 구조물 등이 조성되고, d) 상기 일 내지 시공, 장비 내지 바이오재, 시설 내지 구조물 등에서는 안전, 사 고방지, 재해방지, 무인화, 자동화, 로봇화, 고품질화, 메타버스화, 청정, 정화, 살균, 소독, 방역, 방제, 처리, 크리닝 등이 필요하고, e) 상기 일 내지 시공, 장비 내지 바이오재, 시설 내지 구조물, 안전 내지 방제 등에 상기 수단 내지 안전관리시스템 등이 이용되고, f) 상기 수단 내지 안전관리시스템 등에 의하여 상기 안전 내지 크리닝 등이 된다. 본 발명에 의한 청구항 1인 관리시스템 또는 안전관리시스템의 예는 실시예 1, 2, 3 등과 같다. 여기서 실시예 1은 a) 사람, 인간, 신체, 인체, 몸체, 로봇, 만물, 근로자, 작업자, 출입자, 관리자, 총괄자, 앱이용자 등(30, 31, 32, 33)에 착용, 부착, 장착, 구비, 거치 등이 되는 웨어러블 수단; b) 상기 웨어러블 수단에 구 비된 센서 또는 감지기(10, 11), 버튼 또는 SOS버튼(10, 12), 랜턴 또는 라이트(10, 13), 카메라 또는 CCTV(10, 14), 무전기 또는 마이크(10, 15), 알림기 또는 알림등(10, 16), 램프 또는 후방등(10, 17), 계측기 또는 모니터링장치(10, 18), 배터리 또는 태양전지(10, 19), 제어기 또는 컨트롤러(10, 20) 등의 기구; c) 상기 웨어러블 수단을 착용한 사람의 스마트폰; d) 상기 기구에 전기를 공급하는 충전기 또는 배터리; e) 물품이나 상기 배터리가 내장되는 것으로 상기 웨어러블 수단에 형성된 포켓(20'), 집, 케이스, 하우스, 하우징, 파우치, 주머니(20'); f) 상기 기구, 스마트폰 등에 연계되는 통신장치; g) 상기 통신장치에 연계되는 통신망; h) 상기 통신망에 연계되는 서버, 클라우드; i) 상기 서버 , 기구 등의 자료 또는 정보를 처리, 연산, 저장, 기록, 출력 등을 하는 처리장치, 연산장치, 중앙처리장치, 주기억장치, 보조기억장치, 출력장치; j) 상기 서버, 통신망, 통신장치, 스마트 폰 등에 연계되는 단말기; k) 상기 안전관리와 기구에 관한 정보와 영상과 데이터를 송신하는 통신장치, 중 계하는 통신망, 수신하는 서버, 디스플레이하는 앱 또는 단말기; 등으로 구성되는 것이다. 실시예 2는 a) 사람, 로봇, 근로자 등에 착용되는 웨어러블 수단; b) 상기 웨어러블 수단의 전면에 구비 된 기구인 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 계측기; c) 상기 웨 어러블 수단의 후면에 구비된 기구인 램프, 카메라, 제어기; d) 상기 웨어러블 수단을 착용한 사람 의 스마트폰; e) 상기 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계 측기, 배터리, 제어기 등의 기구에 전기를 공급하는 배터리; f) 상기 배터리, 물품, 물건, 부품, 기구 등이 내장되는 것으로 상기 수단에 형성된 포켓(20'); g) 상기 기구, 배터리 등에 연결 되는 전선; h) 상기 기구, 스마트폰 등에 연계되는 통신장치; i) 상기 통신장치에 연계되는 통신망 , 이동통신망; j) 상기 통신망에 연계되는 서버, 클라우드, 클라우드서버; k) 상기 서버, 기구 등의 자료 또는 정보를 처리, 연산, 저장, 기록, 출력 등을 하는 처리장치, 연산장치, 중앙처리장 치, 주기억장치, 보조기억장치, 출력장치; ℓ) 상기 서버, 통신망, 통신장치, 스마트폰 등에 연계되는 컴퓨터, PC(91, personal computer), 모니터, 스크린, 핸드폰, 태블릿, 태블릿 PC 중에서 선택된 하나 이상의 단말기; m) 상기 서버, 단말기, 처리장치, 통신장치 등이 구비된 사무실 , 상황실, 지사, 현장사무실, 본사, 통제실, 관제센터, 중앙관제센터 , 본사사무실; n) 상기 안전관리와 기구에 관한 정보와 영상과 데이터를 송신하는 통신장치, 중계하 는 통신망, 수신하는 서버, 디스플레이하는 앱 또는 단말기; 등으로 구성되는 것이다. 실시예 3은 1) 웨어러블 수단; 2) 상기 웨어러블 수단의 전면 또는 내부에 구비된 센서; 3) 상기 센서에 포함되는 위치센서, 생체센서, 가스센서, 환경센서, 공기질센서; 4) 상기 웨어러블 수단의 전면에 구비되면서 상기 센서에 이격된 버튼 또는 SOS버튼; 5) 상기 웨어러블 수단의 전면에 구비되면서 상기 버튼에 이격 된 랜턴; 6) 상기 웨어러블 수단의 전면에 구비되면서 상기 랜턴에 이격된 카메라; 7) 상기 웨어러블 수단의 전면에 구비되면서 상기 카메라에 이격된 무전기; 8) 상기 무전기에 포함되는 마이크, 스피커; 9) 상기 웨어러블 수단의 전면에 구비되면서 상기 무전기에 이격된 알림기; 10) 상기 웨어러블 수단의 후면에구비된 램프; 11) 상기 웨어러블 수단의 후면에 구비되면서 상기 램프에 이격된 카메라; 12) 상기 웨어 러블 수단의 후면에 구비되면서 상기 카메라에 이격된 제어기; 13) 상기 웨어러블 수단을 착용한 사람 의 스마트폰; 14) 상기 센서 내지 스마트폰 중에서 선택된 하나 이상의 기구에 전기를 공급하는 배터리 ; 15) 상기 배터리가 내장되는 것으로 상기 수단에 형성된 포켓(20'); 16) 상기 기구와 배터리에 연결되는 전선; 17) 상기 기구에 연계되는 통신장치; 18) 상기 통신장치에 포함되는 LTE, WiFi, Bluetooth, 비콘, 게이트웨이; 19) 상기 통신장치에 연계되는 통신망; 20) 상기 스마트폰을 인식하여 상기 스 마트폰을 통신망에 연결하는 비콘(51, beacon); 21) 상기 통신망에 연계되는 서버; 22) 상기 서버, 기구 등 의 자료 또는 정보를 처리, 연산, 저장, 기록, 출력 등을 하는 처리장치, 연산장치, 중앙처리장치, 주기억장치, 보조기억장치, 출력장치; 23) 상기 서버 또는 통신망에 연계되는 단말기; 24) 상 기 단말기에 포함되는 PC, 컴퓨터, 모니터, 스크린, 핸드폰, 태블릿; 25) 상기 서버 와 단말기가 구비된 중앙관제센터; 26) 상기 스마트폰과 단말기에 설치되는 앱, 어플, 앱파일, 어플리케이 션, 어플리케이션 파일, 인터넷 또는 Play스토어 등에서 PC나 핸드폰 등에 내려 받기 가능한 앱 또는 앱파일; 27) 상기 스마트폰과 통화되는 상기 핸드폰; 28) 상기 수단에 구비된 무전기와 통화되는 상기 중앙 관제센터에 구비된 무전기; 29) 상기 수단에 포함되는 헬멧(2, 21), 안경(2, 22), 완장(2, 23), 조끼(2, 24), 멜빵(2, 25), 손목밴드(2, 26), 워치(2, 27), 작업화(2, 28), 안전고리(2, 29); 30) 상기 작업자, 현장, 수단, 서버, 센터 등에 구비된 자기장기; 31) 상기 작업자, 현장, 수단, 서버, 센터 등에 구비된 오존기, 살균 기; 32) 상기 작업자, 현장, 수단, 서버, 센터 등에 구비되면서 상기 오존기에 이격된 음이온기, 소독기; 33) 상기 작업자, 현장, 수단, 서버, 센터 등에 구비되면서 상기 음이온기에 이격된 청정기, 정화기; 34) 상기 안전 관리와 기구에 관한 정보와 영상과 데이터를 송신하는 통신장치, 중계하는 통신망, 수신하는 서버, 디스플레이 하는 앱 또는 단말기; 등으로 구성되는 것이다. 여기서는 상기 작업자, 현장, 수단, 서버, 센터 등에 상기 자기 장기에 의한 자기장 발생, 상기 자기장에 의한 건강 증진, 상기 자기장에 의한 식물성장 촉진, 상기 오존기에 의한 오존 발생, 상기 오존에 의한 살균작용, 상기 살균기에 의한 살균기능, 상기 음이온기에 의한 음이온 발생, 상기 음이온에 의한 청정작용, 상기 소독기에 의한 소독기능 등의 효과가 발생된다. 상기 안전관리에 상기 수단, 기구, 정보, 영상 및 데이터가 이용되면서 IT, ICT, LTE, WiFi, IoT, 빅데이터, 딥 러닝, AI, VR 및 메타버스가 이용된다. 상기 안전관리에 상기 수단 내지 데이터, IT 내지 메타버스, 수단 내지 태블릿 등이 이용된다. 상기 IT(information technology)는 상기 정보(information)를 이용하는 기술 (technology)이다. 상기 ICT(information and communication technology)는 상기 정보(information)와; 상기 통신장치 또는 통신망에 의한 통신(communication)을; 이용하는 기술(technology)이다. 상기 LTE 또는 WiFi는 상기 통신장치에 포함된다. 상기 IoT(internet of thing)는 사물(thing)인 상기 수단에 연계되는 상기 통신장치 또는 통신망 의 또는 에 의한 또는 의 기능인 또는 에 의하여 제공되는 인터넷(internet)이다. 상기 통신장치, 통신망, 인터넷 등에 의하여 또는 상기 통신장치, 통신망, 인터넷 등을 통하여 상기 정보와 영상과 데이터가 송 신, 전송, 중계, 방송, 방영, 방송, 스트리밍, 라이브스트리밍 등이 된다. 상기 빅데이터에 상기 서버와 단말기 에 수신, 저장, 수신되어 저장 등이 되는 상기 데이터; 상기 안전관리가 아닌 다른 안전관리에 대한 데이터; 상 기 안전관리가 아닌 다른 안전관리에 대한 진단 데이터; 등이 포함된다. 상기 딥러닝(deep learning)은 상기 단 말기에 인간의 뇌신경 회로를 모방한 신경 회로망(neural network)을 구성하여 상기 데이터 및 빅데이터를 사람 처럼 학습(learning), 심층학습, 처리, 학습하여 처리, 심층학습하여 처리 등을 하거나, 또는 상기 컴퓨터가 상 기 정보, 영상, 데이터, 빅데이터 등을 사람처럼 학습(learning), 심층학습, 처리, 학습하여 처리, 심층학습하 여 처리 등을 하는 것이다. 상기 AI(artificial intelligence)는 상기 단말기에 저장된 상기 정보 내지 빅데이 터 등과 인간이 지닌 지적 능력(intelligence)을 인공적(artificial)으로 구현한 인공지능 모듈이나 모델을 이 용하여 상기 안전관리의 상태 파악; 상기 정보, 영상, 데이터 및 빅데이터의 분석, 처리; 이의 분석 및 처리에 의하여 상기 안전관리의 상태 파악; 등을 하는 것이다. 상기 VR(virtual reality)은 상기 단말기에 또는 상기 단말기의 앱에 디스플레이되는 가상(virtual)의 세계에서 사람, 로봇, 아바타, 작업자 등이 상기 안전관리에 대 하여 실제(reality)와 같은 체험을 하는 것이다. 상기 메타버스(metaverse)는 상기 단말기에 또는 상기 단말기 의 앱에 디스플레이되는 3차원 가상공간에서 사람을 대신하여 활동하는 로봇이나 아바타가 실제 현실과 같이 상 기 안전관리의 활동을 하거나 또는 상기 안전관리를 수행하는 것이다. 본 발명에 의한 웨어러블 수단의 예는 실시예 4, 5, 6 등과 같다. 여기서 실시예 4는 a) 웨어러블 수단이 사람에게 착용; b) 상기 수단에 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램 프, 계측기, 제어기의 기구가 장착; c) 상기 기구에 연결되는 배터리가 구비; d) 상기 기구에 연계되는 통신장치가 구비; e) 상기 통신장치에 통신망이 연계; f) 상기 통신망에 서버 또 는 클라우드서버가 연계; g) 상기 서버 또는 통신망에 단말기가 연계; 등이 되는 것이다. 실시예 5는 a) 웨어러블 수단이 사람에게 착용; b) 상기 수단의 전면에 센서, 버튼, 랜턴, 카메라, 무전기, 알림기의 기구가 구비; c) 상기 수단의 후면에 램프, 카메라, 제어기의 기구가 구비; c) 상 기 사람에게 스마트폰이 구비; d) 상기 기구에 전기를 공급하는 배터리가 구비; e) 상기 수단에 상기 배터리가 내장되는 포켓(20')이 형성; f) 상기 기구와 배터리 사이에 전선이 연결; g) 상기 기구와 스마트폰에 통신장치가 연계; h) 상기 통신장치에 통신망 또는 이동통신망이 연계; i) 상기 통신망에 서버 또는 클 라우드서버가 연계; j) 상기 서버 또는 통신망에 컴퓨터, 모니터, 스크린, 핸드폰, 태블릿 중에서 선택된 하나 이상의 단말기가 연계; k) 상기 서버와 단말기가 중앙관제센터에 구비; 등이 되는 것이다. 실시예 6은 1) 웨어러블 수단이 사람에게 착용; 2) 상기 수단의 전면 또는 내부에 센서가 구비; 3) 상기 센서에 위치센서, 생체센서, 가스센서, 환경센서, 공기질센서가 포함; 4) 상기 전면에 상기 센서에 이격되어 버튼 또는 SOS버튼이 구비; 5) 상기 전면에 상기 버튼에 이격되어 랜턴이 구비; 6) 상기 전면 에 상기 랜턴에 이격되어 카메라가 구비; 7) 상기 전면에 상기 카메라에 이격되어 무전기가 구비; 8) 상기 무전기에 마이크, 스피커가 포함되고, 9) 상기 전면에 상기 무전기에 이격되어 알림기가 구비; 10) 상기 수단의 후면에 램프가 구비; 11) 상기 수단의 후면에 상기 램프에 이격되어 카메라가 구비; 12) 상기 수단의 후면에 상기 카메라에 이격되어 제어기가 구비; 13) 상기 사람에 스마트폰 이 구비; 14) 상기 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기, 스마트폰 중에서 선택된 하나 이상의 기구에 전기를 공급하는 배터리가 구비; 15) 상기 배터리가 내장되는 것으로 상기 수단에 포켓(20')이 형성; 16) 상기 기구와 배터리 사이에 전선이 연결; 17) 상기 기구에 통신장치가 연계; 18) 상 기 통신장치에 LTE, WiFi, Bluetooth, 게이트웨이가 포함; 19) 상기 통신장치에 통신망이 연계; 20) 상기 스마트폰을 인식하여 상기 스마트폰을 통신망에 연결하는 비콘(51, beacon)이 구비; 21) 상기 통신망에 서버 가 연계; 22) 상기 서버에 정보 및 영상 및 데이터를 처리하는 처리장치가 연계; 23) 상기 서버 또 는 통신망에 단말기가 연계; 24) 상기 단말기에 컴퓨터, 모니터, 스크린, 핸드폰, 태 블릿이 포함; 25) 상기 서버와 단말기가 중앙관제센터에 구비; 26) 상기 스마트폰과 단말기에 어플리 케이션 또는 어플리케이션 파일이 설치; 27) 상기 스마트폰과 상기 핸드폰이 통화; 28) 상기 수단에 구 비된 무전기와 상기 중앙관제센터에 구비된 무전기가 통화; 29) 상기 수단에 헬멧, 조끼, 멜빵, 손목밴드, 워치, 작업화, 안전고리가 포함; 30) 상기 수단에 자기장기가 구비; 31) 상기 센 터에 오존기가 구비; 32) 상기 센터에 상기 오존기에 이격되어 음이온기가 구비; 33) 상기 센터에 상기 음 이온기에 이격되어 청정기가 구비; 등이 되는 것이다. 본 발명에 의한 안전관리 방법은 1) 웨어러블 수단이 구비; 2) 상기 수단은 헬멧, 조끼, 멜빵 , 손목밴드, 워치, 작업화, 안전고리; 3) 상기 수단이 사람에게 착용; 4) 상기 수단 의 전면 또는 내부에 센서가 구비; 5) 상기 센서에 위치센서, 모션센서, 생체센서, 가스센서, 환경센 서, 공기질센서가 포함; 6) 상기 위치센서에 의하여 상기 사람의 위치가 감지; 7) 상기 모션센서에 의하여 상기 사람의 이동속도가 측정; 8) 상기 생체센서에 의하여 상기 사람의 체온, 혈압, 심박수 중에서 선택된 하나가 측 정; 9) 상기 가스센서에 의하여 CO, CO2, O2, O3, H2S 중에서 선택된 하나의 농도가 측정; 10) 상기 환경센서에 의하여 온도, 습도, 풍향, 풍속 중에서 선택된 하나가 측정; 11) 상기 공기질센서에 의하여 먼지, 미세먼지 (PM10), 초미세먼지(PM2.5), 라돈, 휘발성유기화합물, 포름알데히드 중에서 선택된 하나의 농도가 측정; 12) 상기 전면에 상기 센서에 이격되어 버튼이 구비; 13) 상기 버튼은 상기 또는 하기의 센서, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기 중에서 선택된 하나를 On/Off하는 버튼이거나, 또는 위급 상황 을 알리는 SOS버튼; 14) 상기 버튼은 상기 사람이 또는 상기 사람의 손이 누르게 됨; 15) 상기 전면에 상기 버튼에 이격되어 랜턴이 구비; 16) 상기 랜턴은 상기 사람 또는 수단의 전방을 비추는 라이트임; 17) 상기 전면에 상기 랜턴에 이격되어 카메라가 구비; 18) 상기 카메라는 상기 사람 또는 수단의 전방을 촬영하는 장치임; 19) 상기 전면에 상기 카메라에 이격되어 무전기가 구비; 20) 상기 무전기에 마이크, 스피커가 포 함; 21) 상기 마이크는 상기 사람이 말을 하는 마이크임; 22) 상기 스피커는 하기의 서버, 단말기, 중 앙관제센터, 중앙관제센터의 관리자 중에서 선택된 하나가 상기 사람에게 말을 전하거나, 또는 상기 사람이 듣는 스피커임; 23) 상기 전면에 상기 무전기에 이격되어 알림기가 구비; 24) 상기 알림기는 하 기의 서버, 단말기, 중앙관제센터, 중앙관제센터의 관리자 중에서 선택된 하나가 상기 사람에게 알림을 하는 것 임; 25) 상기 전면에 상기 알림기에 이격되어 계측기가 구비; 26) 상기 수단의 후면에 램프가 구비; 27) 상기 램프는 상기 사람 또는 수단의 후방에 빛을 발하는 인디케이터임; 28) 상기 수단의 후면에 상기 램프 에 이격되어 카메라'가 구비; 29) 상기 카메라'는 상기 사람 또는 수단의 후방을 촬영하는 장치임; 30) 상 기 수단의 후면에 상기 카메라에 이격되어 제어기가 구비; 31) 상기 제어기는 상기 센서, 버튼,랜턴, 카메라, 무전기, 알림기, 램프 중에서 선택된 하나를 제어하거나, 또는 On/Off하는 것임; 32) 상기 On/Off는 가동을 나타내는 On 또는 중단을 나타내는 Off임; 33) 상기 사람에 스마트폰이 구비; 34) 상 기 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 제어기, 스마트폰 중에서 선택된 하나 이상의 기 구에 전기를 공급하는 배터리가 구비; 35) 상기 배터리가 내장되는 포켓(20')이 상기 수단에 형성; 36) 상 기 기구와 배터리 사이에 전선이 연결; 37) 상기 기구에 통신장치가 연계; 38) 상기 통신장치에 LTE, WiFi, Bluetooth, 게이트웨이가 포함; 39) 상기 통신장치에 통신망이 연계; 40) 상기 스마트폰을 인식하여 상기 스마트폰을 통신망에 연결하는 비콘(51, beacon)이 구비; 41) 상기 통신망에 서버가 연계; 42) 상기 서버 에 정보 및 영상 및 데이터를 처리하는 처리장치가 연계; 43) 상기 서버 또는 통신망에 단말기가 연계; 44) 상기 단말기에 컴퓨터, 모니터, 스크린, 핸드폰, 태블릿이 포함; 45) 상기 서버 와 단말기가 중앙관제센터에 구비; 46) 상기 스마트폰과 단말기에 어플리케이션 또는 어플리케이션 파일이 설치; 47) 상기 스마트폰과 상기 핸드폰이 통화; 48) 상기 수단에 구비된 무전기와 상기 중앙관제센터 에 구비된 무전기가 통화; 49) 상기 수단 또는 기구에 자기장기가 구비; 50) 상기 자기장기에 의하여 상기 작업 자에 자기장이 방사; 51) 상기 수단 또는 기구 또는 센터에 오존기가 구비; 52) 상기 오존기에 의하여 오존이 발생; 53) 상기 오존기에 이격되면서 상기 수단 또는 기구 또는 센터에 음이온기가 구비; 54) 상기 음이온기에 의하여 음이온이 발생; 55) 상기 음이온기에 이격되면서 상기 수단 또는 기구 또는 센터에 청정기가 구비; 56) 상기 청정기에 의하여 상기 수단, 기구, 센터, 현장, 공장, 가정, 작업장, 작업자, 사무실 등의 공기가 청정; 57) 상기 수단 또는 기구 또는 센터에 히터, 쿨러가 거치; 58) 상기 히터에 의하여 상기 수단, 기구, 센터, 현 장, 공장, 가정, 작업장, 작업자, 사무실 등에 열이 발산; 59) 상기 쿨러에 의하여 상기 수단, 기구, 센터, 현 장, 공장, 작업장, 작업자, 사무실 등의 열이 식혀짐; 등이 되거나, 또는 등을 하는 것이다. 상기 히터, 쿨러는 상기 수단, 기구, 센터, 현장, 공장, 작업장, 작업자, 사무실 등에 히팅, 쿨링, 열발산, 열식힘 등을 하여 온도 를 조절하는 것이다. 본 발명에 의한 안전관리시스템, 작업방법, 공사방법 등의 예로는 1) 웨어러블 수단이 구비; 2) 상기 웨 어러블 수단의 전면 또는 내부에 센서가 구비; 3) 상기 센서에 이격되면서 상기 전면에 SOS버튼이 구비; 4) 상기 버튼에 이격되면서 상기 전면에 랜턴이 구비; 5) 상기 랜턴에 이격되면서 상기 전면에 카메 라가 구비; 6) 상기 카메라에 이격되면서 상기 전면에 무전기가 구비; 7) 상기 무전기에 마이크와 스피 커가 포함; 8) 상기 무전기에 이격되면서 상기 전면에 알림기가 구비; 9) 상기 알림기에 이격되면서 상기 전면에 계측기가 구비; 10) 상기 수단의 후면에 램프가 구비; 11) 상기 램프에 이격되면서 상기 후면에 카메라'가 구비; 12) 상기 카메라에 이격되면서 상기 후면에 제어기가 구비; 13) 상기 수단이 작업 자에 착용; 14) 상기 작업자에 스마트폰이 구비; 15) 상기 센서, SOS버튼, 랜턴, 카메라, 무전기, 알림 기, 램프, 계측기, 제어기, 스마트폰 중에서 선택된 하나 이상의 기구에 전기를 공급하는 배터리가 구 비; 16) 상기 배터리가 내장되는 포켓(20')이 상기 수단에 형성; 17) 상기 기구와 배터리 사이에 전선이 연결; 18) 상기 작업자의 작업 시에 상기 센서가 작동; 19) 상기 작업 중에 상기 카메라에 의하여 작업 장면 이 촬영; 20) 상기 SOS버튼은 비상 시에 상기 작업자에 의하여 눌려짐; 21) 상기 기구에 통신장치 가 연계; 22) 상기 통신장치에 LTE, WiFi, Bluetooth, 비콘(beacon), 게이트웨이 중에서 선택된 하나가 포함; 23) 상기 통신장치에 통신망이 연계; 24) 상기 통신장치 또는 통신망에 서버가 연계; 25) 상기 서버 또 는 통신망에 단말기가 연계; 26) 상기 단말기에 컴퓨터, 모니터, 스크린, 핸드폰, 태블릿 중에서 선택된 하 나가 포함; 27) 상기 서버와 단말기가 중앙관제센터에 구비; 28) 상기 스마트폰에 스마트폰용 앱이 설치; 29) 상기 단말기에 단말기용 앱이 설치; 30) 상기 스마트폰과 상기 단말기는 상호 연계 또는 통화; 31) 상기 수단에 구비된 무전기와 상기 중앙관제센터에 구비된 무전기가 상호 연계 또는 통화; 32) 상기 작업자(3 0)와 상기 중앙관제센터에 근무하는 관리자 또는 총괄자 간에 통화 시스템이 구축; 33) 상기 수단 또는 기구에 자기장기가 구비; 34) 상기 자기장기에 의하여 상기 작업자에 자기장이 방사; 35) 상 기 수단, 기구, 센터, 작업자 중 하나 이상이 소독; 36) 상기 수단 또는 기구 또는 센터에 오존기가 구비; 37) 상기 오존기에 의하여 오존이 발생; 38) 상기 오존기에 이격되면서 상기 수단 또는 기구 또는 센터(12 0)에 음이온기가 구비; 39) 상기 음이온기에 의하여 음이온이 발생; 40) 상기 음이온기에 이격되면서 상기 수단 또는 기구 또는 센터에 청정기가 구비; 41) 상기 청정기는 상기 수단, 기구, 센터, 센터 내부, 현장, 공장, 가 정, 작업장, 작업자, 사무실 등의 공기를 청정; 42) 상기 수단 또는 기구 또는 센터에 히터, 쿨러가 거치; 43) 상기 히터는 상기 수단 내지 사무실 등에 열 발산; 44) 상기 쿨러는 상기 수단 내지 사무실 등의 열 식힘; 등이 되거나, 또는 등을 하는 것이다. 본 발명의 수단, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리, 드론, 장치, 장비, 시설, 사물, 만물, 생물, 기(器), 기(機), 기기, 기구, 로봇, 동물, 공간, 세계, 작업, 업무,공사, 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 포켓, 청정기, 정화기, 방역 기, 통신수단, 통신망, 서버, 처리장치, 단말기, 핸드폰, 스마트폰, 계측기, 디스플레이, 필드수단, 웨어러블수 단, 안전관리시스템 등은 수단, 헬멧(2, 21), 모자, 안경(2, 22), 고글, 완장(2, 23), 띠장, 의류, 의복, 조끼(2, 24), 멜빵(2, 25), 밴드, X밴드, 손목밴드(2, 26), 시계(2, 27), 워치, 안전화(2, 28), 작업화, 안전 고리(2, 29), 착용구(2, 10), 착용물(2, 10), 다바이스, 드론, 비행기, 장치, 장비, 시설, 설비, 사물, 만물, 생물, 사람, 인간, 물체, 물질, 재료, 자재, 기(器), 기(機), 기기, 기구, 로봇, 동물, 아 바타, 메타공간, 버스세계, 메타버스, 메타버스공간, 가상공간, 가상세계, 작업, 업무, 제 조, 생산, 공사, 건설, 건축, 시공, 센서(10, 11), 버튼(10, 12), 랜턴(10, 13), 카메라(10, 14), 무전기(10, 15), 알림기(10, 16), 램프(10, 17), 계측기(10, 18), 배터리(10, 19), 제어기(10, 20), 포켓(20'), 주머니, 청정기, 정화기, 살균기, 소독기, 방역기, 크리닝기, 통신수단, 통신망, 서버, 처리장치 , 단말기, PC, 컴퓨터, 모니터, 스크린, 핸드폰, 스마트폰, 계측기, 디스플레이, 필드수단 , 웨어러블수단, 안전관리시스템, 이중 둘 이상이 조합된 복합수단 등이 될 수 있다. 상기 수단 내지 안전관리시스템 등은 IT, 5G, 3D, 4D, Al, IC, VR, AR, MR, DX, ICT, NFT, IoT, IoE, AIoT, SNS, BIM, LTE, WiFi, 안전, 구호, 세이브, 세이프, 자동, 오토, 로봇, 모빌, 무인, 유인, 무선, 유선, 소자, 에코, 그린, 청정, 정화, 살균, 소독, 방역, 방제, 케어, 비콘, 전기, 전자, 통신, 정보, 만능, 원격, 리모트, 지능, 비트, 코드, 펄스, 신호, 필드, 측정, 제어, 계측, 화학, 물리, 생물, 헬스, 케어, 인공, 논리, 지식, 지 능, 나노, 칩, 센서, 소자, 진자, 기판, 모듈, 회로, 트윈, 스마트, 모바일, 포터블, 인터넷, 디지털, 딥러닝, 바이오, 미생물, 데이터, 반도체, 컴퓨터, 메모리, 실리콘, 웨이퍼, 컨트롤, 시스템, 웨어러블, 연성, 플렉시블, 메타, 버스, 메타버스, 아바타, 사이버, 인공지능, 프로세스, 마이크로, 로보틱스, 빅데이터, 클라우 드, 모니터링, 아날로그, 프로그램, 불록체인, 자율주행, 자동제어, 자동감시, 원격관리, 원격가동, 원격조정, 트랜지스터, 하이브리드, 인텔리전트, 리모트컨트롤, 텔레매틱스, 3차원, 4차원, telematics, meta, verse, save, safe, smart, safety, wearable, flexible, wearable technology, PTT(Push To Talk), Watcher, PIP(picture in picture), 융합기술, 생명공학, 생명기술, 4차산업기술 중에서 선택된 하나의 상기 수단 내지 안전관리시스템 등이 해당되거나, 또는 등이 될 수 있다. 상기 수단 내지 안전관리시스템 등은 상기 IT 내지 4 차산업기술 등의 기능 또는 성능을 가진 상기 수단 내지 안전관리시스템 등도 해당된다. 상기에 의거하여 상기 IT 내지 4차산업기술 중 하나의 안전관리시스템, 상기 IT 내지 4차산업기술 중 하나 기반의 안전관리시스템, 상 기 IT 내지 4차산업기술 중 하나의 기능을 가진 안전관리시스템 등이 가능하다. 상기 수단 내지 안전관리시스템 등의 용어 앞에는 상기 IT 내지 4차산업기술 중 하나의 어미, 수식어, 접두어 등이 위치할 수 있다. 상기에서 5G는 5세대, 5th Generation 등이고, IT는 정보기술, 이미지기술, Image Technology, Information Technology 등이고, Al은 Al, 인공지능, artificial intelligence, artificial intelligent 등이고, IC는 집적 회로, Integrated Circuit 등이고, ICT는 정보통신기술, Information and Communications Technology 등이고, 상기 DX는 디지털혁신이나 digital trtansformation이고, AIoT는 AI와 IoT가 접목된 것이고, 불록체인은 Block Chain, 가상 화폐로 거래할 때 해킹을 막기 위한 기술 등이고, VR은 가상현실, VR, virtual reality, 假想現實, 컴퓨터로 만들어 놓은 가상의 세계에서 사람이 실제와 같은 체험을 할 수 있도록 하는 최첨단 기술 등이고, AR 은 증강현실, 增强現實, augmented reality 등이다. MR은 혼합 현실, Mixed Reality, 混合現實, 현실 세계에 가상 현실(VR)이 접목되어 현실의 물리적 객체와 가상 객체가 상호 작용할 수 있는 환경, 현실을 기반으로 가상 정보를 부가하는 증강 현실(AR)과 가상 환경에 현실 정보를 부가하는 증강 가상(AV)의 복합의미 등이 해당된다. 상기 IoT는 a) IoT, 사물인터넷, Internet of Things, 사물의 인터넷, 인터넷을 하는 사물, 인터넷 통신이 되는 사물, 인터넷 통신이 구비되는 사물, 무선통신을 하는 사물, 사물과 사물이 인터넷으로 대화를 나누는 것, 사물 끼리 인터넷으로 연결돼 정보를 주고받는 것, 스마트폰으로 제어하는 것, 사물끼리 대화를 나누는 것, 사물에 센서를 부착해 실시간으로 데이터를 인터넷으로 주고받는 기술이나 환경, NFC의 근거리 무선통신(Near Field Communication)를 활용한 가전제품, 가전이 실시간으로 온도를 점검을 하고 제품 진단과 절전 관리를 함, 건강 관리용 스마트 팔찌, 사물끼리 통신을 주고 받을 수 있는 통로, 사물끼리 공통적으로 사용할 수 있는 언어, 사 물끼리 통신할 수 있는 통로, 시설에 센서와 스피커를 탑재해 정보를 수집, 실시간으로 정보 데이터를 습득해 본사에게 정보를 알려줌, 사무실과 가전에 센서를 설치하고 인터넷에 연결, 쓰레기에 센서를 부착해 쓰레기의 이동경로 파악, 사물지능통신 기반, 창조엔진, 초연결사회의 기반 기술, 서비스이자 차세대 인터넷으로 사물 간 인터넷 혹은 개체 간 인터넷(Internet of Objects), 사물이 만들어낸 정보를 인터넷을 통해 공유하는 환경, USN(Ubiquitous Sensor Network), M2M(Machine to Machine), Intelligence Buildings, GSMA(Global System for Mobile Communications Association), 센서(sensor)가 이용되는 인터넷, 정보를 수집·처리·관리하고 정 보가 서비스로 구현되기 위한 환경을 지원, 인터넷에 연결된 기기가 상호 정보를 주고 받으며 대화를 나누는것, 블루투스나 근거리무선통신(NFC), 센서데이터, 네트워크 등으로 자율적인 소통을 하는 것, 사물간 온도나 습도나 위치나 열 같은 정보를 주고받음, NFC칩이 탑재된 장비에 스마트폰을 갖다대면 장비 동작 상태나 오작동 여부를 확인; b) 센싱 기술, 유무선 통신 및 네트워크 인프라, IoT 서비스 인터페이스 기술; c) 근거리 통신기 술(WPAN, WLAN 등)이나 이동통신기술(2G, 3G, 4G 등)과 유선통신기술(이더넷, BcN 등) 같은 유·무선 통신 및 네트워크 인프라 기술; d) 센서에 의하여 빛, 소리, 온도, 화학물질 등 내외부에서 발생한 신호들을 수집하여 과학적인 방법으로 분석하여 내외부의 각종 상태를 파악하는 장치; e) 또는 열, 가스, 조도, 온도, 습도, 초음 파 센서부터 원격감지, SAR, 레이더, 위치, 모션, 영상센서 등 유형 사물과 주위 환경으로부터 정보를 바탕으로 사물 간 대화가 이루어짐 등이 해당된다. 상기 IoE는 만물인터넷, Internet of Everything 등이고, 이의 설명은 상기의 IoT와 유사하고 IoT의 things 대신에 IoE의 everything이 교체된 것이다. 상기 딥러닝은 심층학습, Deep Learning, 인공신경망 잇는 기계학습법, 컴퓨터가 사람처럼 생각하고 배울 수 있 도록 하는 기술, 사물이나 데이터를 군집화하거나 분류하는 데 사용하는 기술, 기계학습(Machine Learning)의 발전기술, 많은 데이터를 컴퓨터에 입력하고 비슷한 것끼리 분류하도록 하는 기술, 인공신경망의 한계를 극복하 기 위해 제안된 기계학습 방법, 인간의 뇌신경 회로를 모방한 신경 회로망(neural network)을 구성하여 컴퓨터 가 다양한 데이터를 통해 마치 사람처럼 생각하고 배울 수 있도록 하는 기술, 인간과 유사한 작업을 수행할 수 있도록 컴퓨터를 교육하는 머신 러닝 기술 등이다. 상기 인공지능(AI)은 인공지능, 人工知能, AI, AI모듈, 인공지능모듈, Artificial Intelligence, 인간이 지닌 지적 능력의 일부 또는 전체 혹은 그렇게 생각되는 능력을 인공적으로 구현한 것 등이다. 인공지능에 이용되는 것은 전문가시스템(Expert System), 퍼지이론(Fuzzy Theory), 기계학습(Machine Learning), 딥러닝(Deep Learning), 인공신경망(Artificial Neuron Network), 유전알고리즘(Genetic Algorithm), 인공지능언어, 알고리 즘, 신경망, 인공신경망, 휴먼머신, 인터페이스, 컴퓨팅 등이 있다. 상기 인공지능언어는 人工知能言語, artificial intelligence language, 리스프(LISP: 리스프처리언어), 프롤로그(Prolog) 언어, 전문가 시스템의 구축을 위해 특수하게 설계된 언어. 인공지능 프로그램의 개발에 사용되는 프로그래밍 언어 등이다. 상기 메타, 버스, 메타버스 등(97, 100)은 a) 메타버스, 메타버스공간, 메타버스세상, 메타버스세계, 메타버스시설, 메타버스장비, 공간, 세계, 3차원공간, 3차원영상공간, 3차원동영상공간, 3차원세계, 3차원 가상 세계, 3차원 가상공간, meta, verse, metaverse, 현실세계와 같은 활동이 이뤄지는 3차원 가상세계, 아바 타(abata)가 활동하는 공간, 아바타가 활동하는 가상공간, 아바타가 활동하는 3차원공간, 자신을 대신하여 아바 타가 활동하는 3차원공간, 가상이나 초월을 뜻하는 메타(Meta)와 우주를 뜻하는 유니버스(Universe)의 합성어, 메타버스는 가상현실(VR)보다 한 단계 더 진화한 개념, 아바타를 활용해 실제 현실과 같은 활동을 할 수 있는 세계, 아바타를 통해서만 들어갈 수 있는 가상의 세계, 3차원 가상현실 기반의 세컨드 라이프(Second Life) 세 계, UGC(User Generated Content) 상품이 이용되는 가상세계, 트윈기술이 이용되는 메타버스, 디지털트윈기슬이 이용되는 메타버스, 소셜서비스(SNS)의 플랫폼에서 아바타가 상호 교류하고 쇼핑하며 현실처럼 활동하는 공간, 머리 착용 디스플레이(HMD: Head Mounted Display)와 같은 몰입 기기 활용되는 가상공간; b) 아바타(avatar)를 통해 실제 현실과 같은 생활, 작업, 업무, 회의, 쇼핑, 놀이, 여행, 사회, 경제, 교육, 문화, 과학, 기술 등의 활동을 할 수 있는 3차원 공간 플랫폼; c) 또는 PC, 폰, 서버, 단말기, 컴퓨터, 모니터, 스크린, 핸드폰, 디스 플레이, 플랫폼 등에서 구현되는 또는 시청되는 가상공간, 가상세계, 3차원 가상세계, 3차원 가상공간; d) 상기 PC 내지 플랫폼 등의 속, 내부, 환경, 조건, 생태 등에 구현되는 가상공간, 가상세계, 3차원 가상세계, 3차원 가상공간; 등이 해당된다. 상기 웨어러블은 a) 착용, 着用, 착복, 입기, 구비, 구성, 거치, 위치, 장착, 정착, 웨어, 웨어러블, wear, wearable, cover, covering, 덮기, 카바, 카바링, 입기, 쓰기, 차기, 착용용(用), 착용용도, 착용 가능한, 몸 에 입기, 머리에 쓰기, 손목에 차기, 걸기, 목에 걸기; b) 또는 몸, 머리, 헤드, 어깨, 가슴, 상체, 하체, 허리, 손, 발, 팔, 목, 손목, 얼굴, 안면, 다리, 사람, 인간, 인물, 사물, 신체, 몸체, 로봇, 동물, 아바타, 허 벅지, 장구류, 인조인간, 가상인간 등에 상기 착용 내지 걸기; 등이 해당된다. 상기 사람, 인간, 로봇, 아바타 등은 사람, 인간, 로봇, 아바타, 인조인간, 가상인간, virtual human, robot, mechanical man, cyborg, cyber human, 현실세계에 존재하는 사람, 가상세계에 존재하는 가상인간 등이 될 수 있다. 상기 웨어러블 수단은 a) 헬멧, 모자, 캡, cap, 햇, hat, 의류, 의복, 조끼, 바지, 상의, 하의, 복 장, 작업복, 업무복, 완장, 띠장, 장화, 구두, 신발, 작업화, 안전화, 가방, 백, 팩, 백팩, 밴드, 손목 밴드, 허리밴드, 어깨밴드, 바지밴드, 멜빵, 벨트, 안전벨트, 혁띠, 허리띠, 시계, 워치, 링, 귀링, 반지, 가락지, 귀고리, 장갑, 안경, 고글, 안경테, 걸이, 목걸이, 귀걸이, 보호구, 보호물, 착용구, 부착구, 착용물, 부착물, 사람에게 착용되는 수단, 사람에게 착용되는 기구, 사람에게 착용되는 착용구, 사람에게 착용되는 착용물, 사람에게 부착되는 부착구, 사람에게 부착되는 부착물, 입는 것, 착용하는 것, device, wearable device, 핀, 머리핀, 고리, 멜빵고리, 안전고리, 허리밴드에 연결되는 안전고리, 허리밴드에 연결 되는 끈에 연계되는 안전고리, 끈의 양측에 고리가 형성되어 일측의 고리가 작업자의 허리밴드에 연결되고 타측 의 고리가 고층의 안전봉에 연계되는 안전고리; b) 사람이나 사물에 착용되는 상기 헬멧 내지 안전고리; c) 또 는 사람, 인간, 로봇, 동물, 아바타, 사물, 만물, 생물, 자재, 재료, 시설, 건물, 작업, 제조, 공사, 건설, 건 축 등에 구비되는 상기 헬멧 내지 안전고리; d) 또는 상기 IT 내지 wearable, 착용 내지 걸기 등의 상기 헬멧 내지 안전고리 등이 해당된다. 상기 웨어러블 수단은 a) 사람, 신체, 인체, 몸체, 사물, 만물, 근로자 , 작업자, 아바타, 관리자, 총괄자, 앱이용자, 자재, 재료, 시설, 드론, 장비 , 작업, 제조, 공사, 건설, 건축; b) 상기 사람 내지 앱이용자 등의 몸, 팔, 손, 눈, 코, 귀, 입, 목, 발, 다리, 어깨, 가슴, 허리, 머리, 헤어, 얼굴, 이마, 히프, 무릎, 발목, 엉덩이, 종아리, 손가락, 발가락; 등에 이용, 사용, 착용, 부착, 장착, 구비, 거치 등이 될 수 있다. 상기 필드 수단은 기(器), 기(機), 차(車), 카, car, 차량, 수단, 기구, 기계, 도구, 장비, 시설, 설비, 장비 , 장치, 로봇, 드론, 모빌리티, 트럭, 도져, 로라, 폼, 형틀, 비계, 재료, 자재, 거푸집, 건물, 교 량, 도로, 옹벽, 구조물, 그레이더. 측량기, 계측기, 저장고, 혼합기, 배합기, 공급기, 운반기, 이송기, 펄스기, 보링기, 굴착기, 굴삭기, 천공기, 항타기, 펌프카, 분사기, 주입기, 주사기, 주유기, 타설기, 콘크리트 타설기, 포설기, 포장기, 믹싱기, 지반믹싱기, 지중믹싱기, 다짐기, 콘크리트다짐기, 양생기, 수양생기, 살수양 생기, 증기양생기, 콘크리트양생기, 면처리기, 콘크리트면처리기, 크레인, 포크레인, 타워크레인, device, field device, 가전, 제품, 용품, 가전제품, 생활용품, 사무용품, 청정기, 정화기, 살균 기, 소독기, 방역기, 크리닝기, 제조장비, 생산장비, 공장장비, 현장장비, 산업장비, 공사장비, 시공장 비, 건축장비, 건설장비, 틀, 1m 이상 높이의 틀, 사다리, 삼각대, 삼발이, 지지대(44, 45), 거치대, 격자대, 격자틀, 조립대, 조립틀, 조립세트, 촬영대, 촬영기 거치대, 카메라 거치대, 촬영기 지지대, 카메라 지지대, 측량기 삼각대, 접이식 삼각대, 조립식 삼각대, tripod, 트라이포드, 접이식 격자대, 접이식 격자틀, 접이식 거치대, 조립식 거치대, 현장에 있는 것, 현장에 있는 수단, 현장에 있는 기구, 현장에 있는 장비, 현장에 있는 장치, 현장에 있는 시설, 현장에 있는 설비, 공장에 있는 것, 공장 에 있는 수단, 공장에 있는 기구, 공장에 있는 장비, 공장에 있는 장치, 공장에 있는 시설, 공장에 있는 설비, 현장이나 공장에 있는 상기 기(器) 내지 지지대 등이 해당된다. 상기 웨어러블수단은 사람, 인간, 로봇, 동 물 등에 구비되고, 상기 필드수단은 현장, 공장, 지반, 지중, 건물, 구조물, 메타, 버스, 메타버스, 공사현장, 건설현장, 제조공장, 생산공장 등에 구비된다. 상기 센서는 센서, 소자, 렌즈, 비콘, 키트, 전선, 계측기, 측정기, 센서폰, 폰센서, 케이블, 위치센서, 고도센 서, 위도센서, 경도센서, 기압센서, 모션센서, 생체센서, 헬스센서, 인체센서, 가스센서, 환경센서, 키트센서, 공기질센서, 전기센서, 전자센서, 통신센서, 무선센서, 유선센서, 압전센서, 측정센서, 계측센서, 광학센서, 전 선센서, 케이블센서, 휴대용센서, 무선측정센서, 유선측정센서, 칩, 센서칩, 센싱칩, 위치칩, 모션칩, 생체칩, 가스칩, 환경칩, 공기질칩, 센싱칩, 위치센싱칩, ID칩, GPS칩, 인식칩, 모션센싱칩, 생체센싱칩, 가스센싱칩, 환경센싱칩, 공기질센싱칩, 코드, 바코드, ID코드, 태그, tag, ID태그, 식별태그, 트래커, 트래커센서, 핸드폰, 핸드폰센서, sensor, multiple sensor, 게이지, gauge, 스트레스게이지, 스트레인게이지, ID센서, RFID센서, NFC센서, MEMS센서, IR센서, FOD센서, PIR센서, UWB센서, IMU, CMOS센서, IoT센서, ICT센서, GPS(global positioning system), INS(inertial navigation system), 바이오센서, 다종센서, 다중센서, 빛센서, 열센서, 광센서, 파센서, 자기센서, 발열센서, 감지센서, 누수감지센서, 진동센서, 가진센서, 농도센서, 발광센서, 광원 센서, 소자센서, 온도센서, 습도센서, 압력센서, 응력센서, 변형센서, 변위센서, 소리센서, 신호센서, 유량센서, 자기센서, 음향센서, 미각센서, 후각센서, 장치센서, 장비센서, 음파센서, 섬유센서, 광섬유센서, 적 외선센서, 원적외선센서, 열화상센서, 초음파센서, 카메라, 적외선센서, 근적외선센서, 자외선센서, 디지탈카메 라, 각종센서, CDS센서, 콤파스센서, 고도계센서, tilt sensor, triaxial tilt sensor, crack sensor, wire sensor, vibrating wire sensor, stress sensor, load sensor, millivolt sensor, displacement sensor, optical displacement sensor, 이중 둘 이상이 조합된 복합센서 등이 해당된다. 상기 카메라는 카메라, 사진기, 촬영기, 녹화기, 캠, 웹캠, 홈캠, 필드캠, 캠코더, 레코더, 방송기, 방송국, 핸 드폰, 핸드폰카메라, 펜카메라, 시계카메라, 미니카메라, 버튼카메라, 필드카메라, 필드CCTV, 필드촬영기, 웨어 러블 카메라, 웨어러블 CCTV, IP(internet protocol address) CCTV, LTE CCTV, CCTV카메라, 이동형카메라, 이 동형촬영기, 이동형CCTV, 이동방송기, 이동방송국, 모바일카메라, 모바일촬영기, 모바일방송기, 모바일방송국, LED카메라, LTE카메라, 이동형 LTE-CCTV, AI카메라, 스냅카메라, 무선카메라, camera, camcoder, recorder, wireless camera, 유선카메라, 비디오카메라, 디지털카메라, 아날로그카메라, 열화상카메라, 적외선카메라, 내시경카메라, 연속촬영카메라, HD카메라, Full HD카메라, 회전카메라, 각도조절카메라, 각도회전카메라, 광각렌 즈 구비 카메라, CMOS센서 탑재 카메라, 2M 픽셀 카메라, DSLR 카메라, 미러리스 카메라, 삼각대캠, 삼발이캠, 삼각대에 거치된 캠, 삼발이에 거치된 캠, 무선 송신이 가능한 카메라, 영상 촬영과 촬영 영상의 무선 송신이 가능한 카메라, 영상을 촬영하고 이를 실시간으로 무선 송신하는 카메라, 상기 센서 내지 제어기 등이 구비된 카메라, 이중 둘 이상이 조합된 복합카메라 등이 해당된다. 상기 카메라는 촬영, 녹화, 저장, 전송, 송신, 수신, 편집 등이 가능하고, 또한 블랙박스 기능, 140°광각 회전, 180°광각 회전, 사각지대 없는 촬영, Full HD, 듀얼 카메라를 이용한 전면 및 후면 동시 촬영, 지연없는 실시간 영상전송, 통화 제공 등의 특징을 가진다. 상기 픽셀은 畵素, picture element, 텔레비전이나 전송사진 등에서 화면을 구성하고 있는 최소단위의 명암의 점, 픽처(picture)와 엘리먼트(element)의 합성 어, 수치가 높을수록 화질이 높아짐, 디지털 이미지의 해상도는 ppi(pixels per inch)로 나타냄, 이는 1인치 안에 몇 개의 픽셀이 존재하는지를 수치로 표현한 것임 등이 해당된다. 상기 알림기는 벨, bell, 얼람, 알람, alam, 진동, 소리, 벨소리, 노래, 부저, 음향, 방송, 경고, 뮤직, 음악, 경고음, 따르릉, 싸이렌, 사운드, 전파, 스피커, 폰, 전화, 통화, 빛, 불빛, 조명, 반짝이, 알림기, 얼람기, 경 고기, 경보기, 깜박이, 사운드, 메세지, 핸드폰, 스마트폰, 푸시메세지, 비상메세지, 인디케이터, 이중 둘 이상 이 조합된 복합알림기 등이 해당된다. 상기 알림기는 작업자 등에게 위험요소에 대한 내용을 상기 얼람 내 지 인디케이터 등으로 알리는 것이다. 상기 알림기에 의한 알림은 자동으로 되거나, 또는 제어기, 서버, 관리자, 총괄자, 이용자, 처리장치, 통신장치 등에 의한다. 본 발명에서 ∼ 등은 ∼ 등; 또는 ∼ 중 하나 이상; 또는 ∼ 중에서 선택된 하나 이상; 을 나타낸다. 상기 계측기는 a) 센서, 소자, 계측기, 측정기, 감지기, 측량기, 관측기, 탐사기, 탐지기, 광파기, 시험기, 기 록기, 기록계, 칩, 계측칩, 센싱칩, 측정칩, 응력계, 강도계, 하중계, load cell, 변형계, strain gauge, 변위 계, 속도계, 가속도계, 농도계, 오염농도계, 오염측정기, 앵커계측기, 인발계측기, 지반변위계, 지중변위계, 내 공변위계, 천단변위계, 다단변위계, 건물변위계, 건물기울계, 경사계, 인클리노미터, inclinometer, 틸트미터, tilt meter, 건물경사계, 지중경사계, 지하수계, 지하수위측정기, 광파측량기, 침하계, settlement gauge, 지반 침하계, 지중침하계, 다단침하계, 게이지, gauge, 스트레인게이지, 스트레스게이지, 망치, 해머, 슈미트해머, 천단침하계, 내공변위계, 락볼트응력계, 라이닝응력계, 핸드폰, 핸드폰계측기, 디스펜서, 스캐너, 3D스캐너, 레 이저 스캐너, 화상기, 열화상기, 비파괴 장치, 사운딩기, Sounding Unit, measuring instrument, 計測器, 물리 탐사기, 자기탐사기, 전자탐사기, 음파탐지기, 초음파탐지기, 누수감지기, 손상감지기, 유선계측기, 무선계측기, 자동계측기, 지진계측기, 진동계측기, 건물계측기, 교량계측기, 터널계측기, 사면계측기, 지반계측 기, 지중계측기, 바이오계측기, 흙막이계측기, 센서 이용 계측기, 센서 탑재 계측기; b) 상기 위치 내지 복합 등의 계측기, 상기 위치 내지 복합 등을 측정하는 계측기; c) 이중 둘 이상이 조합된 복합계측기; 등이 해 당된다. 상기 디스펜서는 디스펜서, dispensor, 콘크리트 속에 작은 기포를 일으키는 에이이제 용액의 부피와 무게를 재 는 장치, 펌프식의 리필용 용기, 약품을 담아두는 펌프식의 리필용 용기, 특정한 물건이나 물질을 사용할 때 버 튼이나 손잡이를 한 번 누르면 일정한 양이 공급되도록 고안된 도구나 장치 등이 해당된다. 상기 바이오계측기 는 바이오계측기, 바이오센서, 생물 이용 계측기, 바이오 이용 계측기, 미생물 계측기, 사람을 측정하는 계측기, 동물을 측정하는 계측기 등이 해당된다. 본 발명의 센서, 계측기, 시험기, 기록기, 기록계 등은 가스, 환경, 위치, 모션, 행동, 이동, 생체, 공기질, 충 격, 진동, 지진, 낙하, 힘, 무게, 중량, 응력, 강도, 변형, 변위, 지반, 토지, 지형, 건물, 구조물, 작업, 제조, 생산, 공사, 시공, 건설, 건축, 포장, 메타버스, 상기 위치 내지 복합 등의 측정, 센싱, 계측, 측량, 측 지, 관측, 시험, 매핑, mapping, 항공측량, 지상측량, 3차원화, 3차원도형화 등이 가능하다. 상기 매핑은 매핑, mapping, 지도 작업, 지도 제작 작업, 지도에 관한 작업, 지형 작업, 메타버스에 지형 작업, 지형을 도면화하는 작업, 3D 도면 제작, 3D 모델링을 할 때 모델에 텍스쳐를 펴 바르는 작업, 어떤 값을 다른 값에 대응시키는 과 정 등이 해당된다. 상기 센서, 계측기 등은 위험지역 접근 감지, 위험지역 접근 알림, 셀프 안전점검, 착용자가 위험지역 접근시 경고 알림, 위험지역 작업현황 모니터링, 위험상황 자동감지, 긴급구조요청, 유해가스 실시간 감지, 가스사고 실시간 감지, 낙상사고 실시간 감지, 착용자 사고감지시 자동알림, 착용자 사고감지시 구호요청 전송 등을 하거나, 또는 등에 이용될 수 있다. 상기 센서, 계측기, 기록기, 기록계 등은 인터넷, 통신장치, 통 신망, 통신모듈, 서버, 처리장치, 단말기, 플랫폼, 메타버스, 디스플레이 등에 연계되어 센셍 정보, 계측 정보 등이 전송, 무선전송, 수신, 저장, 처리, 읽기, 보기 등이 가능하다. 상기 배터리는 배터리, 전지, 電池, 건전지, 전지판, 전기, 전원, 동력, 에너지, 전기에너지, 셀, 솔라셀, 태양 전지, 패널, 태양패널, 태양광패널, 태양발전패널, 수소전지, 연료전지, 수소연료전지, HFC(hydrogen fuel cell), 미생물연료전지, battery, MFC(microbial fuel cell), 태양전지판, 충전지, 충전기, 발전기, 태양발전 기, 압전발전기, 수소충전기, 전기충전기, 2차전지, 비상전원, 보조전원, battery, charger, power, 전원공급기, 수소와 공기 중의 산소를 이용하여 전기와 물을 생성하는 연료전지, 상기 연료전지에서 생성되는 전기를 저장하는 배터리, 8시간 이상 연속 사용, 예비 배터리 신속 교체, 이중 둘 이상이 조합된 복합배터리 등 이 해당된다. 상기 전지는 전지, Cell, 건전지(dry cell), 습전지(wet cell), 배터리(battery), 연료전지, 태양전지, 수소연 료전지, 전해전지, 전기분해전지, 전지 내에 미리 채워놓은 화학물질에서 나오는 화학에너지를 전기에너지로 전 환하는 장치, 자발적인 산화-환원 반응을 이용하여 화학 에너지를 전기 에너지로 변화시키는 화학 장치, 본체 또는 케이스 등에 상기 자화기 내지 복합물 등이 구비된 전지 등이 해당된다. 일차 전지(primary cell)는 전지 의 기전력이 0으로 떨어지면 재충전할 수 없어 재사용할 수 없는 전지이다. 이차 전지(secondary cell) 혹은 축 전지(storage cell)는 화학에너지를 전기에너지로 변환시키는 방전(discharging) 과정과 전기에너지를 화학에너 지로 변화시키는 충전(charging) 과정을 반복할 수 있어서 재사용할 수 있는 전지이다. 상기 태양전지는 태양전 지(solar cell), 광전지(photovoltaic cell), 광기전력 전지(photovoltaic cell), 태양 빛을 전기로 변환시키 는 장치, 빛에너지가 전기로 바뀌는 광기전 효과(photovoltaic effect)에 의하여 전기를 생산하는 장치 등이 해 당된다. 상기 연료전지는 연료전지, Fuel Cell, 연료와 산화제를 전기화학적으로 반응시키어 전기에너지를 발생시키는 장치, 지속적으로 연료와 산소의 공급을 받아서 화학반응을 통해 지속적으로 전기를 공급하는 장치, 전해조와 이의 내부에 구비된 양극과 음극과 전해질로 구성된 장치 등이 해당된다. 상기 전해조 내부에 구비된 양극과 음 극은 상기 전해조의 외부에 거치된 도선으로 상호 연결된다. 상기 양극에서는 산화작용이 일어나면서 (+) 전기 를 띄는 수소이온과 전자를 방출한다. 여기서 발생한 전자가 상기 전해조 외부의 도선을 통해 양극에서 음극으 로 이동하면서 직류 전류가 발생한다. 이의 발생 전류가 충전지에 저장되어 이용된다. 상기 전해질은 (+) 전기 를 띄는 수소이온(양이온)이 연료전지의 양극과 음극의 두 극 사이에 이동이 가능하게 하는 역할을 한다. 상기 음극에서는 양극에서 이동해온 수소이온과 전해조 외부의 도선을 통해 이동한 전자와 외부에서 공급된 공기 중 의 산소와 결합하여 물 또는 수증기를 만들어 배출한다. 상기 수소연료전지는 수소연료전지, 수소가 이용되는 연료전지, 수소와 산소가 반응하여 물이 되는 전체 반응 (2H2 + O2 → H2O)을 통해 전자는 양극의 산화전극(anode)에서 외부 도선을 통해 음극의 환원전극(cathode)으로 이동하면서 전기 에너지를 발생시키는 장치 등이 해당된다. 산화전극에서 다음과 같이 연료인 수소의 산화 반응 이 일어난다. 2H2 → 4H+ + 4e- (산성 조건), 2H2 + 4OH- → 4H2O + 4e- (염기성 조건), 그리고 환원전극에서는 다음과 같이 산소의 환원 반응이 일어난다. O2 + 4H+ + 4e- → 2H2O (산성 조건), O2 + 2H2O + 4e- → 4OH- (염기 성 조건), 그리고 산성 조건에서 수소 이온이 이동할 수 있는 고분자 막을 전해질로 사용하는 경우를 고분자 전 해질 연료 전지라고 하며, 30∼40% 농도의 수산화 포타슘(KOH) 용액을 전해질로 사용하는 경우를 알칼리 연료 전지라고 부른다. 상기 제어기는 제어기, 조종기, 조정기, 운전기, 가동기, 컨트롤러, 리모트 컨트롤러, controller 등이 해 당된다. 상기 제어기는 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리 등을 제어, 조절, 조 정, 가동, 중단, 키기, 끄기, On, Off, Stop, 연결, 차단, 전원연결, 컨트롤, 전원차단, 원격조정, 무선제어, 유선제어, 리모트컨트롤 등을 하는 것이다. 상기 제어기에는 보드, 허브(hub), 메인보드, Al모듈, 분석모듈, 판 단모듈, 제어모듈 등이 구비될 수 있다. 상기 보드에는 Al모듈, 분석모듈, 판단모듈, 제어모듈 등이 내장될 수 있다. 상기 Al모듈은 딥러닝, 모델링, 추론 등을 하는 모듈로서, 미리 학습된 딥러닝 모델을 이용하여 상기 센 서에 의한 센싱정보, 카메라에서 촬영된 영상 등으로부터 위험 요소 검출을 위한 객체의 정보를 추론한다. 분석 모듈은 분석, 해석, 추출, 검출 등을 하는 모듈로서 상기 추론된 객체 및 각종 센싱데이터를 종합적으로 분석하 여 위험 요소를 검출한다. 판단모듈은 판단 등을 하는 모듈로서 상기 추론, 검출 등이 된 정보로부터 위험여부 를 판단한다. 제어모듈은 상기 추론, 검출, 판단에 의거하여 얼람기를 제어하여 작업자 등에게 위험 상황에 대 한 경고나 안내 등을 한다. 상기 통신장치는 a) 통신기, 송신기, 전송기, 수신기, 발신기, 공유기, 인터넷, internet, 무선통신, wireless, 무선, 와이어리스통신, 통신모듈, 통신유닛, 통신수단, 통신장치, 통신장비, 인터넷공유기, 무선인터넷, 네트워 크, 무선네트워크, 통신시스템, 인테페이스, 통신인테페이스, 중계장비, 통신중계장비, 게이트웨이, 무선통신장치, 유선통신장치, 송신유닛, 송신장치, 무선송신장치, 전송유닛, 전송장치, 무선전송장치, 핸드폰, 스마트폰, 스마트폰앱, 스마트폰 이용, 이어폰, 이어셋, 무선이어폰, 무선이어셋, 핸드폰통신장치, 스마트폰통신장치, 아 바타통신장치, 메타버스통신장치, 설치형 통신장비, 이동형 통신장비, 설치형 통신중계장비, 이동형 통신중계장 비, 와이파이, 엘티이, 비콘, 테더링, 핫스팟, 블루투스, 사물인터넷(IoT), 만물인터넷(IoE), 안테나, 통신안테 나, 무선안테나, USB안테나, 기업전용 LTE망, 블루투스를 지원하는 스마트폰, 블루투스를 지원하는 다양한 주변 기기, 게이트웨이, 모뎀, 웹, web, 웹사이트, SNS, gateway, WiFi, LTE, P-LTE(Private LTE), IMT, UWB, GSM, BLE, UDP, TCP, IP, USB, ZigBee, Beacon, Bluetooth, AP(access point), WiFi장치, LTE장치, IMT장치, Beacon장치, Bluetooth장치, AP장치, 비콘(beacon)장치, WIMAX(World Interoperability for Microwave Access), 태그(tag), 비콘태그, RFID태그(radio frequency identification); b) 또는 게이트웨이, 스마트폰, 근로자앱 등을 이용한 통신시스템; c) 이동통신망이 되는 현장에서 비콘, 스마트폰, 근로자앱 등을 이용한 통신시스템; 도 1 상부 그림 참조, d) 이동통신망이 되지 않는 현장에서 게이트웨이, 200∼300m 간격으로 게이트웨이 등을 이용한 통신시스템; 도 1 하부 그림 참조, e) 또는 상기 센서, 버튼 , 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기, 스마 트폰, 수단 내지 복합수단 등의 또는 등에서 발생되는 자료, 정보, 신호, 영상, 음성, 데이터 등을 통신, 송신, 공급 등을 하는 장치; 도 1 그림 참조, f) 상기 통신기 내지 RFID태그 등의 장치; g) 상기 통신기 내지 RFID태그 등을 이용하여 자료, 정보, 신호, 영상, 음성, 데이터 등을 통신, 송신, 전송, 수신, 송수신 등을 하 는 것; g) 이중 둘 이상이 조합된 복합통신장치; 등이 해당된다. 상기 통신망은 a) 망, 통신망, 회로망, 기지국, 중계기, 네트워크, 네트워크망, 중계장비, 설치형 중계장비, 이 동형 중계장비, 고정형 중계장비, 통신시스템, 통신기지국, 설치통신망, 고정통신망, 이동통신망, 정보통신망, 인터넷망, 인터넷통신망, 클라우드, 클라우드 네트워크, 송신망, 수신망, 송신기, 수신기, 웹, web, 웹사이트, SNS, VPN, BAN, PAN, LAN, WAN, network, commutation network, cloud, 데이터 통신망, 단말기(terminal) 간의 통신 경로를 구성하는 자원의 집합체, 전자 회로망, 여러 종류의 전자 소자를 상호 접속한 것, 수동 회로망 (passive network), 능동 회로망(active network), 선형 회로망(linear network), 광통신망, 마이크로파통신망, 무선통신망, 유선통신망, 전기통신망, 전화망, 통신위성망, 이동통신시스템, 아바타통신망, 메타버스통신망, 지상기지국, 5G기지국, KT기지국, SK기지국, LG기지국, 지하케이블망, 해저케이블망, 통신이동 업무를 취급하는 무선국, 육상 이동국과의 통신 또는 이동 중계국의 중계에 의한 통신을 하기 위해 육상에 개설 하고 이동하지 않는 무선국. base station, 基地局, 통신장치와 기지국과 서버를 연결하는 네트워크, 전화가입 자 상호간의 전화망, 전보의 송수를 위한 중계망, 가입전신가입자간의 가입전신망, 철도·경찰·전력용 등의 시 외통신망, 기업체 등에서 이용하는 집중사무처리데이터망; b) 또는 단말기, 노드(node), 회선(line), 간선 (trunk), 통신위성들을 포함한 상호 접속된 매체로 구성된 시스템; c) 또는 상기 센서, 버튼, 랜턴, 카메라, 무 전기, 알림기, 램프, 계측기, 배터리, 제어기, 스마트폰, 통신장치 등의 또는 등에서 제공되는 자료, 신호, 영 상, 음성, 데이터 등을 서버, 하드웨어, 단말기 등에 통신, 송신, 공급, 전달, 이송 등을 하는 장치; d) 이중 둘 이상이 조합된 복합통신망; 등이 해당된다. 상기 서버는 a) 서버, 수신기, 클라우드, 관제서버, 관리서버, 중앙서버, 호스트서버, 서버클라우드, 송신 서버, 수신서버, 저장서버, 저장장치, 데이터 저장장치, 저장하드웨어, 데이터 베이스, 통신자서버, 112서버, 119서버, 관리자서버, 총괄자서버, 이용자서버, 현장서버, 본사서버, 중앙관제서버, 플랫폼서버, GIS서 버, 빅테이터서버, 빅테이터저장, 인공지능서버, 클라우드서버, 인터넷 상의 서버, 클라우드 네트워크, 네이버 클라우드, 네이버 MYBOX, 구글 드라이브, 클라이언트서버, 서버클라이언트, 빅데이터서버, 아 바타서버, 메타버스서버, 웹하드, 웹서버, 웹사이트, 하드웨어, 기억장치, 수신안테나, 수신기 구비 서버, DB, data base, cloud, server, cloud server; b) 주된 정보의 제공이나 작업을 수행하는 컴퓨터 또는 시스템, 데 이터를 저장하는 컴퓨터 또는 외부 컴퓨터, 데이터를 저장하는 중앙컴퓨터 또는 외부 컴퓨터, 서비스 사업자의 서버, 기업 내의 서버 또는 저장장치가 아닌 외부에 아웃소싱해 쓰는 서버 또는 저장장치, 고객 또는 클라이언 트에게 네트워크를 통해 서비스하는 컴퓨터, 고객 또는 클라이언트의 자료를 인터넷을 통하여 저장하는 컴퓨터, 인터넷과 연결되어 데이터를 저장하는 중앙컴퓨터 또는 외부 컴퓨터, 컴퓨터 파일을 저장할 때 작업한 컴퓨터 내부에 있는 공간이 아니라 인터넷을 통하여 중앙 컴퓨터에 저장할 수 있는 공간, 한 대의 컴퓨터에 여러 대의 컴퓨터를 통신회선으로 연결하여 공동으로 사용하는 정보를 저장해 두거나 컴퓨터 자원을 많이 사용하는 프로그 램을 모아놓은 컴퓨터; c) 또는 상기 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 랜턴, 계측기, 배터리, 제어 기, 스마트폰 등의 또는 등에서 공급되는 자료, 신호, 영상, 음성, 데이터 등을 저장하는 서버, 하드웨어; d) 이중 둘 이상이 조합된 복합서버; 등이 해당된다. 상기 처리장치는 센서, 버튼, 카메라, 무전기, 알림기, 제어기, 기구, 계측기, 통신장치, 통신망, 서버 등에서 제공되는 자료, 서류, 정보, 영상, 음성, 신호, 시그널, 데이터, 빅데이터, 아날로그, 측정치 등을 입력, 처리, 연산, 산정, 판단, 판독, 평가, 추론, 추리, 제도, 작도, 도식화, 도면화, 서류화, 자료화, 데이터화, 도면제작, 매핑, mapping, 저장, 기억, 출력 등을 하는 장치이다. 상기 처리장치는 PC, 컴퓨터, 노트북, 중앙처리장치, 주기억장치, 보조기억장치, 입력장치, 출력장치 등으로 구성될 수 있다. 상기 서버, 통 신망, 단말기 등은 처리장치(processing unit), CPU(중앙처리장치), MPU(micro processor unit, 마이크로프로 세서장치, 超小型演算處理裝置), MPU(주처리장치, main processing unit) 등이 구비되거나, 또는 등에 연계될 수 있다. 상기 처리장치는 균, 세균, 오염, 먼지, 황사, 분진, 바이러스, 환경호르몬 등을 청정, 정화, 청소, 세정, 세척, 살균, 소독, 방역, 방제, 처리, 크리닝 등을 하는 장치도 가능하다. 본 발명에서는 a) 자화기, 자기장기, 진동기, 가진기, 오존기, 음이온기, 청정기, 정화기, 정수기, 연수기, 세정기, 세척기, 살균기, 소독기, 방역기, 방제기, 분해기, 전해기(전기분해기), 방전기 (전기방전기), 압전기(피에조기, 435), 열전기(펠티에기, 436), 배양기, 발효기, 가습기, 건조기, 가열기, 냉각 기, 냉온기, 연무기, 응축기, 전파기, 음파기, 초음파기, 인덕터, 펄스기, 폭기기, 임펄스기, 분사기, 와류기, 케비테이션기, 반응기, 응집기, 침전기, 여과기, 필터기, 데미스터, 엘리미네이터, 서미스터, 미스트기, 다이오 드, 웨이브기, 솔레노이드, 마그네트론기; b) 자화, 자기장발생, 진동, 가진, 오존살균, 음이온소독, 청정, 정화, 정수, 연수, 세정, 세척, 살균, 소독, 방역, 방제, 분해, 전해(전기분해), 방전 (전기방전), 압전, 열전, 배양, 발효, 가습, 건조, 가열, 냉각, 냉온, 연무발생, 응축, 전파발생, 음 파발생, 초음파진동, 전자기유도, 펄스발생, 폭기, 임펄스발생, 분사, 와류, 케비테이션, 반응, 응집, 침전, 여 과, 필터링, 수분제거, 먼지제거, 열가변저항발생, 미스트발생, 발광, 웨이브발생, 자기장발생, 마이크로파발생; c) 자화물, 자기장, 진동물, 가진물, 오존, 오존물, 음이온, 음이온물, 청정물, 정화물, 정수물, 연수물, 세정물, 세척물, 살균물, 소독물, 방역물, 방제물, 분해물, 전해물(전기 분해물), 방전물(전기방전물), 압전물, 열전물, 배양물, 발효물, 가습물, 건조물, 가열물, 냉각물, 냉온물, 연무, 응축물, 전파, 음파, 초음파, 전자기, 펄스, 폭기물, 임펄스, 분사물, 와류물, 케비테이션물, 반 응물, 응집물, 침전물, 여과물, 필터물, 수분, 물방울, 열가변저항(熱可變抵抗), 미스트, 발광물, 웨이브, 육각 물, 자기장물, 마이크로파; d) 처리, 자화처리, 자기장처리, 진동처리, 가진처리, 오존처리 , 음이온처리, 청정처리, 정화처리, 정수처리, 연수처리, 세정처리, 세척처리, 살균처리, 소독처리, 방역처리, 방제처리, 분해처리, 전해처리, 방전처리, 압전처리, 냉온처리, 배양처리, 발효처리, 가습 처리, 건조처리, 가열처리, 냉각처리, 냉온처리, 연무처리, 응축처리, 전파처리, 음파처리, 초음파처리, 전자기 처리, 펄스처리, 폭기처리, 임펄스처리, 분사처리, 와류처리, 케비테이션처리, 반응처리, 응집처리, 침전처리, 여과처리, 필터처리, 데미스터처리, 엘리미네이터처리, 열가변저항처리, 미스트처리, 발광처리, 웨이브처리, 자 기장처리, 마이크로파처리; e) 상기 중 둘 이상이 조합된 복합, 처리, 복합기, 복합작용, 복합물, 복 합처리; f) 상기 자화기 내지 복합처리 중 하나의 기능, 기능기, 기능물, 기능처리; 등 (430, 440)이 또는 등(430, 440)의 이용, 사용, 적용, 구비, 거치, 주입, 투입, 발생, 생성, 공급, 제공, 분사 등이 가능하다. 상기 압전기는 압전기, 壓電器, 壓電機, 압전기기, 압전기구, 압전소자, 압전센서, 압전발전기, 압전진동 기, 피에조기, piezo器, piezo機, piezo device, piezo-electric tool, piezo-electric device, piezoelectricity device, 壓電氣를 발생하는 장치, 압전효과(Piezoelectric effect)로 전기를 발생하게 하는 압전성 기구, 압전소자가 이용되는 기기, 누르면 진동하는 압전소자의 진동기, 누르면 전기를 발생하는 압전소 자의 발전기, 어떤 종류의 결정판에 압력을 가하여 전기를 발생하는 장치, 일정한 방향으로 압력을 가하면 그 압력에 비례하여 전기가 발생하는 장치 또는 결정체, 결정판에 일정한 방향에서 압력을 가하면 판의 양면에 외 력에 비례하는 양전하와 음전하의 피에조전기가 발생되는 장치 또는 결정판, 전기를 가하면 진동하는 압전소자 의 진동기, 상기 자화기 내지 기능기 등이 구비된 압전기, 상기 자화물 내지 기능물 등을 생성하는 압전기, 상 기 자화 내지 기능 등을 하는 압전기, 상기 자화처리 내지 기능처리 등을 하는 압전기 등이 해당된다. 상 기 piezo는 압(壓), pressure라는 뜻이다. 상기 압전소자는 압전소자, 壓電素子, 피에조전기소자, piezoelectric element, piezoelectric transducer, 압 전효과를 가진 소자, 전기 변환을 집적하는 소자, 압전기(壓電氣) 현상을 나타내는 소자, 어떤 종류의 결정판 (結晶板)에 일정한 방향에서 압력을 가하면 판의 양면에 외력에 비례하는 양·음의 전하가 나타나는 소자, 한 장의 결정판에 나타나는 압전기는 미약하지만 금속박을 삽입하면서 여러 장을 겹칠 경우 그 양이 크게 증대됨, 결정판에는 고유의 진동이 있고 탄성진동과 전기진동이 일치하면 압전기와 결합되어 더욱 강한 진동이 일어남, 기계적 압력을 인가하면 전압이 발생하고 전압을 인가하면 기계적 변형이 생기는 현상을 지닌 소자, 외력을 가 하면 전기 분극이 일어나서 전위차가 생기고 반대로 전압을 가하면 변형이나 변형력이 생기는 성질을 가진소자, 충격력을 가하면 높은 전압을 발생하며 불꽃이 튀고 이 불꽃으로 가스레인지나 욕조 보일러 등의 착화를 함, 외부로부터 기계적 변형을 가하면 전기분극(分極)이 나타나는 현상을 이용한 소자(素子), 압력을 가하면 전 압이 변화하고(압전 효과), 반대로 전압을 가하면 팽창되거나 수축되는 성질을 가진 소자 등이 해당된다. 압전 소자의 재료로는 수정, 전기석, 로셸염, 세라믹, 티틴산바륨, 타이타늄산바륨, 인산이수소암모늄, 타르타르산에 틸디아민, 타타르산에틸렌다이아민, 티탄산지르콘산납(PZT) 등이 사용된다. 압전소자는 픽업, 수화기, 스피커, 확성기, 마이크로폰, 기계적 필터, 전축의 픽업, 전화기 스피커, 라디오 스피커, 초음파 탐지기, 수정시계의 진 동자, 방송기기, 원거리 통신회로, 압전센서, 라이터, 노크 센서, 각종 압력 센서, 초음파센서, 자동 점화장치, 가스 기구의 점화, 압전 마이크로폰, 레코드 재생의 픽업, 초음파 발생기, 레코드 플레이어의 픽업 등에 이용된 다. 상기 열전기는 열전기, 熱電器, 熱電機, 펠티에기, Peltier器, Peltier機, 펠티에소자器, 펠티에소자機, Peltier device, thermoelectricity device, 熱電氣를 방생하는 장치, 열전소자가 이용 또는 포함되는 기기, 펠티에소자가 이용 또는 포함되는 기기, 펠티에효과가 발생되는 기기, 전기 공급에 의하여 가열과 냉각을 하는 기기, 전기 공급에 의하여 히팅과 쿨링을 하는 기기, 전기 공급에 의하여 일측은 가열하고 타측은 냉각을 하는 기기, 두 가지 금속을 연결하였을 때 두 접합부의 온도차로 전기를 생성하게 하는 장치, 성질이 다른 금속선을 양단에서 접합하여 루프 회로를 만들고 두 접합점에 온도차를 주어 루프 전류를 흐르게 하는 장치, 종류가 다른 금속선을 양쪽 끝에서 여러 가지로 접합하여 전기 회로를 만든 다음 2개의 접합점에 온도 차를 주면 전류가 흐 르게 하는 장치 등이 해당된다. 상기 펠티에소자는 열전소자, 펠티에소자, 펠티에素子, 냉각소자, 냉온소자, 전자냉각소자, 전자냉온소자, 열전 냉각모듈, 열전냉온모듈, Peltier element, thermoelectric element, thermal electronic cooler, thermal electronic Module, 펠티에 효과를 이용한 열전소자(熱電素子), 펠티에 효과를 이용한 전자소자(電子素子), 어 떤 종류의 금속을 짝지어 전류를 흐르게 하면 한쪽 접점(接點)은 발열(發熱)하고 다른 쪽 접점은 냉각(흡열, 吸 熱)하는 현상을 가진 소자, V-VI족의 합금 및 그 고용체(固溶體)로 만든 n형과 p형의 반도체(半導體)를 냉각접 점으로 하여 구리판을 통해 연결한 소자, 다른 종류의 금속 두 개를 접합시켜 전류를 통할 때에 전류의 방향에 따라 그 접합부가 가열 또는 냉각하는 소자, 반도체에 전기를 공급하면 반도체 안에 있던 전자가 한쪽으로 몰리 게 되면서 전자가 몰린 쪽은 온도가 올라가게 되고 전자가 빠져나간 쪽은 온도가 낮아지면서 양쪽 면의 온도 차 이가 생기게 되는 소자 등이 해당된다. 상기 마그네트론기는 마이크로파 발생기, 자기장 발생기, 마그네트론 이용 장치, 마그네트론을 이용하여 마이크 로파를 발생하는 장치 등이 해당된다. 상기 마그네트론은 마그네트론, magnetron, 자전관(磁電管), 마이크로파 를 발진하기 위한 진공관, 원통형의 양극과 그 중심축의 음극으로 구성, 대출력의 펄스가 생김, 동축(同軸) 원 통 중 내부원통을 음극(陰極)으로 하고 외부원통을 양극(陽極)으로 하는 2극관을 만들고 축방향으로 직류자기장 을 걸어 고주파를 발진시키는 마이크로파 전자관 등이 해당된다. 상기 데미스터는 데미스터, demister, 공기 중 의 수분을 제거하는 장치, 기류 중의 액적을 제거하는 장치, 그물코(網目)를 여러겹 포갠 것에 증기를 통하여 증기 중의 수분을 제거하는 장치 등이 해당된다. 상기 엘리미네이터는 엘리미네이터, eliminator, 공기 중 먼지 제거 장치, 물방울을 비산시켜 공기 중의 먼지를 제거하는 기구 등이 해당된다. 상기 피에조기, 초음파기, 자기장기, 펠티에기, 오존기 등이 이용되는 복합기, 기능기의 예로는 판형의 piezo- electric device인 피에조기, 상기 피에조기에 구비된 초음파기인 울트라기, 상기 울트라기가 구비된 피에조기 인 울트라피에조기, 상기 울트라기에 구비된 자기장기인 마그네틱기, 상기 마그네틱기가 구비된 울트라피에조기 인 마그네틱울트라피에조기, 상기 마그네틱기에 구비된 열전기인 펠티에기, 상기 펠티에기가 구비된 울트라마그 네틱피에조기인 펠티에마그네틱울트라피에조기, 상기 펠티에기에 구비된 오존기, 상기 오존기가 구비된 펠티에 마그네틱울트라피에조기인 오존펠티에마그네틱울트라피에조기 등이 해당된다. 본 발명에서는 칩, 핀, 판, 팬, 침, 콘, 링, 망, 줄, 선, 실, 사, 솔, 빗, 캡, 알, 봉, 대, 폴, 틀, 붓, 볼, 삽, 끌, 톱, 칼, 날, 칼날, 구슬, 금속, 소자, 진자, 단자, 전지, 전극, 양극, 음극, 폴대, 자침, 코일, 나선, 노끈, 지퍼, 쟈크, 처크, 후크, 헤드, 테일, 센서, 기판, 키트, 모듈, 히터, 쿨러, 회로, 서버, 허브, 모뎀, 도 체, 드론, 로봇, 콘덴서, 트렌스, 스프링, 아바타, 반도체, 시스템, 이중 둘 이상이 조합된 복합요소 등의 이용이 가능하다. 그리고 상기 칩 내지 복합요소 등은 상기 수단, 센서 내지 제어기, 센서 내지 디스플레 이, 자화기 내지 기능기, 수단 내지 안전관리시스템 등에 구비, 거치, 사용, 적용, 장착 등이 가능하다. 그리고 상기 수단 내지 안전관리시스템 등에는 상기 칩 내지 복합요소 등의 구비가 가능하다. 상기 칩 내지 복 합요소 등은 상기 수단 내지 안전관리시스템 등의 부품으로 적용되거나, 상기 수단 내지 안전관리시스 템 등에 거치되어 적용되거나, 또는 하기에 기재되는 일정의 작용을 하거나, 또는 각각 가지고 있는 고유의 기능, 성능, 특징 등을 상기 수단 내지 안전관리시스템 등에 이용하려고 할때 적용될 수 있다. 본 발명에서는 상 기 칩 내지 복합요소 등의 상기 IT 내지 4차산업기술 등이 가능하다. 그리고 상기 IT 내지 4차산업기술 등의 상 기 칩 내지 복합요소 등이 가능하다. 본 발명에서는 일정의 기(器), 기(機), 차(車), 체(體), 물체, 기기, 기계, 수단, 센서, 측기, 장치, 장비, 사 물, 만물, 생물, 동물, 시설, 로봇, 설비, 부품, 제품, 물품, 상품, 용품, 폰, 전화, 서버, CPU, GPU, PIM, USB, GPS, GIS, CCTV, 카메라, 촬영기, 스캐너, 3D스캐너, 반도체, 녹화기, 추적기, 측정기, 인식기, 감지기, 벤츄리, 벤츄리관, 시스템, PC(personal computer), 컴퓨터, 노트북, 태블릿, 태블릿PC, SNS(social network service), SNS기기, 핸드폰, 모바일기(mobile kit), 무전기, 모니터, 스크린, 스마트폰, 드론, 모빌리티, 시스 템, 킥보드, 모바일기, 컴퓨터, 메모리, 프린터, 프로그램, 4G, 5G, 인공지능, 사물인터넷, 자율주행차, 가상현 실, LTE, WiFi, 메타버스, 미디버스, 앱, 어플, 어플리케이션, 스마트폰앱, 사이클론, 하드웨어, 소프트웨어, 네트워크, 이중 둘 이상이 조합된 복합 또는 복합기 등이 이용될 수 있다. 상기 기(器) 내지 복합기 등 은 상기 수단 내지 안전관리시스템 등에 구비, 거치, 사용, 적용, 장착 등이 가능하다. 상기 앱, 어플, 어플리케이션, 스마트폰앱 등은 앱, 어플, 어플리케이션, 애플리케이션, 폰앱, 전화앱, PC앱, 핸드폰앱, 스마트폰앱, 소프트웨어, 프로그램, 응용 프로그램, app, appl, application, 애플리케이션(혹은 어 플리케이션)을 약어 또는 줄임말, 스마트폰이나 스마트TV 같은 스마트 기기에서 돌아가는 프로그램 또는 응용 프로그램, 스마트폰이나 태블릿PC에 들어가는 프로그램 또는 응용 프로그램, 스마트TV용 응용프로그램, 휴대폰 이나 스마트폰 등에 다운받아 사용할 수 있는 프로그램 또는 응용프로그램 등이 해당된다. 상기 벤츄리, 벤츄리 관 등은 벤츄리, 벤츄리관, venturi, venturi pipe 등이 해당된다. 벤츄리관은 파이프, 축소부, 벤츄리, 확장부 등으로 구성될 수 있다. 상기 축소부, 벤츄리 등에는 이젝터, 인젝터, 체크밸브, 솔레노이드밸브 등의 구비가 가능하다. 본 발명에서는 일, 작업, 업무, 제조, 생산, 공사, 시공, 건설, 건축, 청정, 정화, 안전, 품질, 관리, 처리 등 이 수행될 수 있다. 상기 일 내지 처리 등에는 상기 수단 내지 복합수단 등이 이용될 수 있다. 상기 일 내지 처 리 등은 상기 수단 내지 복합수단 등을 이용할 수 있다. 상기 수단 내지 복합수단 등은 상기 일 내지 처리 등을 할 수가 있다. 상기 수단 내지 복합수단 등에 의하여 상기 일 내지 처리 등이 수행될 수 있다. 상기 일 내지 처 리 등은 상기 수단 내지 복합수단 등이 이용되는 상기 일 내지 처리 등이 가능하다. 상기 수단 내지 복합수단 등은 상기 일 내지 처리 등을 하는 상기 수단 내지 복합수단 등이 될 수 있다. 상기 일, 작업, 업무 등은 a) 일, work, 작업, 업무, 근무, 근로, 출근, 퇴근, 사무, 서무, 노동, 제조, 생산, 공사, 건설, 건축, 시공, 개발, 분양, 중개, 소개, 이사, 이전, 생활, 활동, 운전, 운행, 주행, 비행, 운반, 운 송, 상차, 하차, 주차, 출입, 승차, 하차, 하역, 배달, 택배, 수리, 수선, 구조, 구제, 보호, 복원, 복구, 보조, 보수, 보강, 재배, 영농, 농사, 분사, 방사, 분무, 분수, 살수, 살포, 포설, 포장, 채취, 시험, 조사, 調 査, 탐사, 검사, 감지, 센싱, 관측, 계측, 점검, 진단, 측량, 측정, 측지, 계량, 모니터링, 댄싱, 노래, 연기, 방송, 광고, 촬영, 녹화, 조명, 송신, 수신, 저장, 기록, 연산, 산정, 방영, 시청, 청취, 보기, 읽기, 듣기, 처 리, 처분, 조립, 관리, 감독, 감리, 감별, 감식, 감찰, 식별, 경호, 경비, 수비, 경계, 정수, 폭기, 반응, 응집, 침전, 여과, 필터, 흡착, 청소, 청정, 정화, 살균, 소독, 방역, 방제, 주유, 연소, 소성, 소각, 크리닝; b) 이중 하나의 과정, 공정, 경로, 궤적, 절차, 순서, 단계, 장면, 영상, 동영상, 로드맵, 프로세스; c) 상기 중 둘 이상의 복합; d) 상기 수단 내지 복합수단 등이 이용되는 상기 일 내지 복합; e) 로봇 또는 아바타가 수 행하는 상기 일 내지 복합; f) 메타버스에서 수행되는 상기 일 내지 복합; g) 핸드폰 또는 플랫폼 또는 메타버 스에 방영되는 상기 일 내지 복합; 등이 해당된다. 상기 일 내지 복합 등이 되는 또는 등을 하는 또는 등이 구 현되는 로봇, 아바타, 메타버스, 3차원가상공간, 3차원가상세계 등도 가능하다. 이의 예로는 일을 하는 과정을 SNS를 통하여 3차원의 가상공간에서 실시간 또는 단계별로 보여주는 메타버스이다. 본 발명에서는 상기 일 내지 복합 중 하나의 또는 하나에 관한 수, 물, 액, 유, 제, 재, 물질, 재료, 자재, 기(器), 기(機), 기기, 기구, 장 비, 장치, 설비, 시설, 구조, 작업, 업무, 시스템, 플랫폼, 메타버스 등이 이용될 수 있다. 상기 공사, 건설, 건축, 시공 등은 a) 공사, 시공, 작업, 건설, 건축, 축조, 신축, 증축, 개축, 축조, 개발, 분양, 중개, 소개, 이사, 이전, 재건축, 재개발, 조경, 식재, 조형, 조각, 환경, 정화, 복원, 복구, 힐링, 처리, 토공, 굴착, 발파, 성토, 절토, 되메움, 준설, 삭도, 미장, 방수, 차수, 지수, 발수, 배기, 배수, 지중배 수, 우수배수, 도로배수, 터널배수, 조적, 석공, 석축, 철근공, 시멘트공, 콘크리트공, 비계공, 해체공, 구조물 해체공, 기초공, 파일공, 피어공, 케이슨공, 판금공, 조립공, 건축물조립공, 상하수도공, 철도공, 궤도공, 도로 공, 수중공, 시설물설치, 철강재설치, 강구조공, 승강기설치공, 도장, 도색, 단열, 방음, 방재, 방제, 방화, 소 화, 내화, 불연공, 난연공, 비계공, 해체, 구조물해체, 창호, 판금, 보링, 인젝션, 그라우팅, 충진, 충전, 싱크홀, 발포, 팽창, 보수, 균열보수, 단면보수, 보강, 지반보강, 기초보강, 구조보강, 시설보강, 면보강, 면처리, 콘크리트면처리, 복구, 단면복구, 훼손복구, 개량, 지반개량, 지반개량공사, 시설개량, 구조개량, 보호, 면보호, 사면보호, 배합, 혼합, 교반, 지중교반, 지상교반, 몰탈교반, 공급, 이송, 압송, 운반, 타설, 형틀타설, 콘크리트타설, 치기, 레미콘치기, 주입, 몰탈주입, 지중주입, 몰드주입, 분사, 사면분사, 숏크리트, 스프레이, 시드스프레이, 포설, 아스팔트포설, 포장, 제품포장, 도로포장, 보도포장, 도배, 면도배, 벽도배, 코 팅, 도장, 페인팅, 라이닝, 터널라이닝, 다짐, 지중다짐, 지상다짐, 포장다짐, 준설, 삭도, 양생, 도배, 식재, 나무식재, 조경식재, 라이닝, 터널라이닝, 세그먼트공, 터널세그먼트공, 앵카공, 락앵카공, 소일앵카공, 네일링 공, 소일네일링공, 볼트공, 락볼트공, 소일볼트공, 인테리어, 리모델링, 숏크리트공, 녹생토공, 시드스프레이공, 실내공사, 실외공사, 현장공사, 건설업, 건설공사, 건설업공사, 건축공사, 토목공사, CIP(cast in place pile)공사, SCP(sand compaction pile)공사, GCP(gravel compaction pile)공사, CCP(crushed stone compaction pile)공사, VCCP(vibrated CCP, DCM(deep cement mixing)공사, SCW(soil cement wall)공사, RCD(reverse circulation drill) 또는 RCD기초 공사, ED(earth drill) 또는 ED기초 공사, LW(Labiles Waterglass)공사, JSP(Jumbo Special Pattern Method)공사, SIG(Super Injection Grout)공사, 탑다운(top down)공사, 버텀업(buttom up)공사; b) 이중 하나의 과정, 공정, 경로, 궤적, 절차, 순서, 단계, 장면, 영상, 동영상, 로드맵, 프로세스; c) 상기 중 둘 이상의 복합; d) 상기 수단 내지 복합수단 등이 이용되는 상기 공사 내지 복합; e) 로봇 또는 아바타가 수행하는 상기 공사 내지 복합; f) 메타버스에서 수행되는 상기 공사 내지 복합; 핸드폰 또는 플랫폼 또는 메타버스에 방영되는 상기 공사 내지 복합; 등이 해당된다. 상기 공사 내지 복 합 등이 되는 또는 등을 하는 또는 등이 구현되는 로봇, 아바타, 메타버스, 3차원가상공간, 3차원가상세계 등도 가능하다. 이의 예로는 공사하는 또는 건물을 축조하는 절차를 스크린를 통하여 3차원의 가상공간에서 실시간 또는 단계별로 보여주는 메타버스이다. 본 발명에서는 상기 공사 내지 복합 중 하나의 또는 하나에 관한 수, 물, 액, 유, 제, 재, 물질, 재료, 자재, 기(器), 기(機), 기기, 기구, 장비, 장치, 설비, 시설, 구조, 작업, 업 무, 시스템, 플랫폼, 메타버스 등이 이용될 수 있다. 상기 처리는 처리, 처분, 보수, 보강, 정수, 정화, 청정, 복원, 힐링, 청소, 세척, 세정, 세탁, 세차, 살수, 탈 수, 분수, 분무, 선별, 분리, 분별, 파쇄, 분쇄, 풍쇄, 수쇄, 분해, 소각, 소성, 연소, 도장, 도색, 방수, 단열, 방음, 방재, 방제, 방화, 소화, 내화, 불연, 난연, 보수, 보강, 보호, 매립, 열분해, 습식선별, 수조선별, 건식선별, 풍력선별, 수처리, 자가처리, 외력처리, 수질처리, 액처리, 유류처리, 상수처리, 하수처리, 폐수처리, 오수처리, 오염처리, 공기처리, 분진처리, 토양처리, 오염토양처리, 음식물처리, 폐기물처 리, 미생물처리, 생활폐기물처리, 산업폐기물처리, 건설폐기물처리, 폐기물중간처리, 폐기물최종처리, 자화처리, 진동처리, 오존처리, 정화처리, 청정처리; b) 이중 하나의 과정, 공정, 경로, 궤적, 절차, 순서, 단 계, 장면, 영상, 동영상, 로드맵, 프로세스; c) 상기 중 둘 이상의 복합; d) 상기 수단 내지 복합수단 등이 이 용되는 상기 처리 내지 복합; e) 로봇 또는 아바타가 수행하는 상기 처리 내지 복합; f) 메타버스에서 수행되는 상기 처리 내지 복합; g) 핸드폰 또는 플랫폼 또는 메타버스에 방영되는 상기 처리 내지 복합; 등이 해당된다. 상기 처리 내지 복합 등이 되는 또는 등을 하는 또는 등이 구현되는 로봇, 아바타, 메타버스, 3차원가상공간, 3 차원가상세계 등도 가능하다. 이의 예로는 처리하는 과정을 앱을 통하여 3차원적으로 실시간 또는 단계별로 보 여주는 메타버스이다. 본 발명에서는 상기 처리 내지 복합 중 하나의 또는 하나에 관한 수, 물, 액, 유, 제, 재, 물질, 재료, 자재, 기(器), 기(機), 기기, 기구, 장비, 장치, 설비, 시설, 구조, 작업, 업무, 시스템, 플랫 폼, 메타버스 등이 이용될 수 있다. 상기 장비는 a) 기(器), 기(機), 차(車), 카, car, 차량, 기구, 기계, 도구, 장비, 시설, 설비, 장비, 장치, 로 봇, 드론, 트럭, 도져, 로라, 그레이더. 저장고, 혼합기, 배합기, 공급기, 운반기, 이송기, 펄스기, 보링기, 발 파기, 굴착기, 굴삭기, 천공기, 항타기, 펌프카, 콘크리트펌프카, 분사기, 주입기, 주사기, 주유기, 타설기, 콘 크리트타설기, 포설기, 포장기, 믹싱기, 지반믹싱기, 지중믹싱기, 그라우터, 숏크리터, 다짐기, 콘크리트다짐기, 진동기, 콘크리트진동기, 양생기, 수양생기, 살수양생기, 증기양생기, 콘크리트양생기, 면처리 기, 콘크리트면처리기, 크레인, 포크레인, 타워크레인, 분해기, 전해기, 배양기, 발효기, 부숙기, 선별기, 파쇄 기, 탈수기, 건조기, 폭기기, 반응기, 응집기, 여과기, 소독기, 방류기, 방전기, 집진기, 조리기, 요리기, 정화 기, 청정기, 정수기, 청소기, 세척기, 살균기, 소독기, 처리기, 3D프린터, 전자장비, 전기장비, 통신장비, 제조 장비, 생산장비, 공장장비, 현장장비, 산업장비, 병원장비, 주방장비, 요리장비, 공사장비, 시공장비, 건축장비, 건설장비, 정화장비, 청정장비, 정수장비, 청소장비, 세척장비, 처리장비, 잭, 시거잭, 전선, 케이블, 소켓, 플러그, 콘센트, 전지, 충전지, 충전기, 충전카, 변압기, 배전반, 발전기, 태양발전기, 풍력발전 기, 수력발전기, 휴대형발전기, 전원공급기, 고전압발생기; b) 상기 일 내지 복합, 제조 내지 복합, 공사 내지 복합, 청정 내지 복합 등을 하는 장비; c) 상기 물질, 재료, 자재 등을 일 내지 복합, 제조 내지 복합, 공사 내지 복합, 청정 내지 복합 등을 하는 장비; d) 상기 물질, 재료, 자재 등을 이용하여 일 내지 복합, 제조 내지 복합, 공사 내지 복합, 청정 내지 복합 등을 하는 장비; e) 상기 수단 내지 복합수단 등이 이용되는 장비, 상기 수단 내지 복합수단 등이 구비되는 장비; f) 재료를 이용하는 장비, 자재를 제조하는 장비, 시설을 조성하는 장 비; g) 상기 중 둘 이상이 조합된 복합장비; h) 장비 또는 로봇 또는 아바타에 구비된 상기 기(器) 내지 복합 기; i) 작업장이나 메타버스에 구비된 상기 기(器) 내지 복합기; 등이 해당된다."}
{"patent_id": "10-2024-0044515", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하 도면을 참조하여 본 발명의 내용, 기술, 방법, 시스템, 청구항, 청구범위 등에 대하여 추가 설명하고자 한 다. 본 발명의 각 도면에 기재된 1, 2, 5, 10, 40, 420, 421, 430, 431, 432, 433, 434, 435, 436, 440, 441, 442, 443, 444, 445, 446 등의 부호는 상기 부호 1 내지 446 등에 해당하는 내용이 각 도면에 적용될 수 있다는 것을 나타낸다. 따라서 본 발명의 각 도면에는 또는 각 도면의 내용에는 상기 시스템, 웨어수단 , 수단 내지 복합수단, 사물, 만물, 웨어 장착 기구, 센서 내지 계측기, IT 내지 4차산업 기술, 자화기 내지 기능물(430, 440), 칩 내지 복합요소, 기(器) 내지 복합기 등의 이용이 가능하다. 도 1은 본 발명에 의한 시스템 또는 메타버스 또는 시스템이 구비된 메타버스를 나타내는 모식도이 다. 이는 a) 공장, 현장, 가정, 작업장, 현장 사무실; b) 이에 있는 사람, 로봇 , 근로자, 아바타, 필드수단, 장비, 트럭, 백호, 타워크레인, 드론, 가 전, 제품, 가전제품, 삼각대, 조립대; c) 상기 사람에 구비되는 스마트폰, 웨어러블수 단; d) 상기 웨어러블수단에 속하는 헬멧(2, 21), 안경(2, 22), 완장(2, 23), 의류(2, 24), 의복, 조끼 (2, 24), 멜빵(2, 25), 밴드, 손목밴드(2, 26), 시계(2, 27), 안전화(2, 28), 안전고리(2, 29); e) 상기 공장 내지 안전고리 등에 구비된 기구; f) 상기 기구에 속하는 센서 또는 감지기(10, 11), 버튼 또는 SOS버 튼(10, 12), 랜턴 또는 라이트(10, 13), 카메라 또는 CCTV(10, 14), 무전기 또는 마이크(10, 15), 알림기 또는 알림등(10, 16), 램프 또는 후방등(10, 17), 계측기 또는 모니터링장치(10, 18), 배터리 또는 태양전지(10, 19), 제어기 또는 컨트롤러(10, 20); g) 상기 가전 또는 제품에 속하는 청정기, 정화기, 정수기, 청소 기, 살균기, 소독기, 방역기, TV, 세탁기, 냉장고, 가전제품; h) 상기 공장 내지 가전제품 등에 연 계되는 통신수단, 통신가능 스마트폰, 비콘, 게이트폰웨이, 통신망, 서버, 처리장치 , 단말기, 핸드폰, 플랫폼; i) 상기 서버, 단말기, 플랫폼 등에 연계된 통신망, 컨트롤러 , 핸드폰, 디스플레이; j) 또는 본사, 원거리, 관제센터, 관리자, 총괄자 등에 구비된 단말기, 제어기, 디스플레이, 핸드폰; k) 또는 이용자, 앱이용자, 앱가입자 등 에 구비된 컨트롤러, 핸드폰, 디스플레이; ℓ) 상기 서버, 단말기, 핸드폰, 제어기, 디스플레 이 등에 설치되는 어플; m) 상기 서버, 단말기, 핸드폰, 제어기, 디스플레이, 어플 등에 구현되는 플랫폼; n) 상기 공장 내지 플랫폼 등에 연계된 통신망, 컨트롤러, 핸드폰, 디스플레이; 등으로 구성되 는 시스템, 메타버스, 안전시스템, 자동시스템, 환경시스템, 안전관리, 원격관리, 방역관리, 안전관리시 스템, 원격관리시스템, 환경관리시스템, 홈오토메이션, 공장오토메이션, 현장오토메이션 등에 관한 것이다. 여기서 안전관리시스템은 사람, 작업자, 아바타, 장비, 계측기, 드론, 필드수단 , 웨어러블수단, 센서(10, 11) - 스마트폰, 비콘, 블루투스, 게이트웨이, 통신장치 - 통신망 - 서버 - 관리자 단말기, 총괄자 단말기, 컴퓨터, 모니터, 스 크린, 종합관제센터 - 통신망 - 이용자 단말기, 플랫폼, 메타버스 등으로 또는 등의 순으로 구성된다. 상기 통신장치에 있어서 현장에 인터넷 또는 이동통신망(LTE)이 되는 경우에는 근로 자의 스마트폰, 스마트폰앱, 비콘, 블루투스 등이 사용되고, 터널이나 지하철이나 지하공간과 같이 현장에 인터넷 또는 이동통신망(LTE)이 되지 않는 경우에는 게이트웨이 등이 사용된다. 이 경우 게이트웨이 는 200∼300m 간격으로 설치하는 것이 권장되고, 게이트웨이 간의 통신은 GHz RF(radio frequency, 無線周 波數), Sub-GHz RF 통신기술 등으로 이루어질 수 있다. 상기 로봇은 작업, 제조, 생산, 공사, 건설, 건축, 시공 등을 하거나, 조력하는 로봇이다. 상기 아바타(3 0)는 작업, 제조, 생산, 공사, 건설, 건축, 시공 등을 하거나, 조력하는 아바타이다. 상기 장비, 트럭, 백호, 타워크레인 등은 작업, 제조, 생산, 공사, 건설, 건축, 시공 등을 하는 또는 등에 이용되는 장비 이다. 상기 드론은 작업, 제조, 생산, 공사, 건설, 건축, 시공 등을 하거나 또는 작업, 제조, 생산, 공사, 건설, 건축, 시공 등의 상부를 비행하는 드론이다. 상기 비행하는 드론은 촬영, 녹화, 분사, 살수, 청정, 정화, 감시, 측정, 관찰 등을 할 수가 있다. 상기 컨트롤러는 컨트롤러, 리모트컨트롤러, 제어기, 원격제어기, controller, remote controller, 원격으로 상기 수단 내지 복합수단 등을 제어하는 콘트롤러, 원격으로 현장의 장비를 제어하는 제어기, 원격으로 공장의 장비를 제어하는 제어기, 원격으로 현장의 계측기를 제어하는 제어기, 본사에서 지사의 장비를 제어하는 제어기, 집에서 현장의 수단을 제어하는 컨트롤러, 발주처에서 하청업체의 시설을 제어하는 컨트롤러 등이 해당된다. 본 발명에서는 상기의 반대 개념도 가능하다. 이는 a) 본사, 원거리, 관제센터, 관리자, 총 괄자 등에 구비된 단말기, 제어기, 디스플레이; b) 또는 이용자, 앱이용자, 앱가입자 등에 구비된 컨트롤러, 핸드폰, 디스플레이; 등을 이용하여 통신수단, 통신가능 스마트폰, 비콘 , 게이트폰웨이, 통신망, 서버, 처리장치 등을 통하여 공장, 현장, 가정, 작업장, 사람, 로봇, 근로자, 아바타, 장비, 드론, 가전, 제품, 가전제 품, 헬멧, 안경, 완장, 의류, 의복, 조끼, 멜빵, 밴드, 손목밴드, 시계, 안전화, 안전고리 등에 구비된 상기 상기 사람 내지 가전제품, 센서 내지 계측기, 청정기 내지 가전제 품 등을 자율조정, 원격조정, 무선조정, 원격관리, 무선관리, 안전관리 등을 하는 것이다. 이에 의하여 메타버 스, 홈오토메이션, 공장오토메이션, 현장오토메이션 등이 구현된다. 본 발명에서는 센서 또는 감지기에 의한 각종 센싱(10, 11), 버튼 또는 SOS버튼에 의한 구조 요청(10, 12), 랜 턴 또는 라이트에 의한 조명(10, 13), 카메라 또는 CCTV에 의한 촬영(10, 14), 무전기 또는 마이크에 의한 연락 (10, 15), 알림기 또는 알림등에 의한 위험 알림(10, 16), 램프 또는 후방등에 의한 야간형광(10, 17), 계측기 또는 모니터링장치에 의한 계측(10, 18), 배터리 또는 태양전지에 의한 전원 공급(10, 19), 제어기 또는 컨트롤 러에 의한 장비 제어(10, 20), 제어기 또는 컨트롤러에 의한 상기 센서 내지 태양전지 제어(10, 20) 등이 가능 하다. 도 2는 본 발명에 의한 안전관리시스템 또는 안전관리시스템이 구비된 메타버스를 나타내는 모식도이다. 이는 a) 사람, 로봇, 근로자, 아바타, 필드수단, 장비, 계측기, 드론, 청정 기, 삼각대, 조립대; b) 이중 하나 이상에 구비된 수단 또는 웨어러블수단; c) 상기 사람 내지 웨어러블수단 등에 구비된 기구; d) 상기 기구에 속하는 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기; e) 상기 사람 내지 계측기 등에 연계 되는 통신수단, 통신가능 스마트폰, 비콘, 게이트폰웨이, 통신망, 서버, 처리장치 , 단말기; f) 상기 서버, 단말기 등에 연계된 통신망, 컨트롤러, 핸드폰, 디스플레이; g) 또는 본사, 원거리, 관제센터, 관리자, 총괄자 등에 구비된 단말기, 제어기 , 디스플레이, 컴퓨터, 모니터, 스크린, 핸드폰; h) 또는 이용자, 앱이용자, 앱가입자 등에 구비된 컨트롤러, 핸드폰, 디스플레이; i) 상기 서버, 단말기, 핸드폰, 제어기, 디스플레 이 등에 구현되는 플랫폼, 메타버스; j) 상기 사람 내지 메타버스 등에 연계된 통신망, 컨트롤러 , 핸드폰, 디스플레이; 등으로 구성되는 시스템, 관리시스템, 안전관리시스템에 관한 것이다. 상기 서버는 중앙관제서버, 플랫폼서버, GIS서버, 빅테이터서버, 빅테이터저장, 인공지능 서버, 클라우드서버 등으로 구성되거나, 또는 등으로 구분될 수 있다. 상기 서버, 통신망, 단말기, 처 리장치 등에는 PC, 컴퓨터, 하드웨어, hardware, 소프트웨어, software 등이 구비될 수 있다. 컴퓨터 또는 하드 웨어는 중앙처리장치, 기억장치, 주기억장치, 보조기억장치, 입력장치, 출력장치 등으로 구성된다. 본 발명에서는 현장이나 공장 등에 비치된 드론, 삼각대, 거치대, 드론에 구비된 기구 , 삼각대에 구비된 기구, 거치대에 구비된 기구, 기구가 구비된 드론, 기구가 구비된 삼각대, 기구가 구비된 거치대 등에 의하여 센싱, SOS요청, 라이트, 촬영, 녹화, 무전, 경보알림, 등점멸, 계측, 전원공급, 장비제어 등이 되고, 이의 정보가 무선 송신되고, 상기 정보가 수신되고, 상기 정보가 서버, 단말기, 플렛폼, 메타버스, 디스플레이 등에 제공된다. 도 3은 본 발명에 의한 현장, 공장, 작업장, 아파트, 공사현장 등에서의 안전관리시스템 또는 안전관리 시스템이 구비된 메타버스를 나타내는 모식도이다. 이는 a) 현장, 공장, 작업장, 아파트, 공사현장 등 ; b) 이에 있는 시설, 건물, 주택, 구조물, 공사중인 건물 등; c) 상기 현장이나 공장의 사무실 ; d) 상기 현장 내지 사무실 등에 있는 사람, 로봇, 동물, 아바타, 필드수단, 장비 , 드론, 방역기; e) 상기 현장 내지 방역기 등에 구비된 스마트폰, 웨어러블수단; f) 상기 사람 내지 웨어러블수단 등에 구비된 기구인 센서, 버튼, 랜턴, 카메라, 무전기, 알림 기, 램프, 계측기, 배터리, 제어기; g) 상기 사람 내지 제어기 등에 연계되는 통신수단 , 통신가능 스마트폰, 비콘, 게이트폰웨이, 통신망, 서버, 처리장치, 단말기 ; h) 상기 서버, 처리장치, 단말기 등이 구비된 현장이나 공장의 사무실; i) 상기 서버, 단말기 등에 연계된 통신망, 컨트롤러, 핸드폰, 디스플레이; j) 또는 이용자, 앱이용자, 앱가 입자 등에 구비된 컨트롤러, 핸드폰, 디스플레이; k) 상기 서버, 단말기, 핸드폰, 제어기, 디 스플레이 등에서 제공되는 플랫폼, 메타버스; ℓ) 상기 현장 내지 메타버스 등에 연계된 통신망,컨트롤러, 핸드폰, 디스플레이; 등으로 구성되는 안전관리시스템에 관한 것이다. 여기에서는 상기 센서, 버튼, 랜턴, 카메라, 무전기, 알림기, 램프, 계측기, 배터리, 제어기 등에 의하여 넓은 현장이나 시공 중인 건물 등에 있는 사람, 로봇, 동물, 아바타 등의 이동, 경로, 궤적, 위치, 좌표, 고도, 위도, 경도, 층, 층수, 방, 호실, 실번호, 방 번호, 현장에서의 작업 위치, 건물 내부에서의 거치 위치 등을 센터, 소장, 사장, 관리자, 앱 이용자 등이 용이하게 파악할 수가 있다. 이에 의하여 사고 시에 근로자의 위치를 실시간으로 파악하여 신 속한 구조를 할 수가 있다. 상기 센서로 사람의 건강을 실시간 체크, 상기 버튼으로 SOS 요청, 상기 랜 턴으로 빛조명, 상기 카메라에 의하여 작업 장면을 실시간 영상 관찰, 상기 무전기로 교신, 상기 알림기로 사고 알림, 상기 램프로 야간등 표시, 상기 계측기로 시설의 응력이나 변형을 실시간 검 측, 상기 배터리로 전원 공급, 상기 제어기로 장비 제어 등을 할 수가 있다. 본 발명에서는 a) 현장, 공장, 가정, 작업장, 공사현장; b) 이중 하나와 동일한 3차원의 가상공간, 메타버스 상 의 3차원의 가상공간; c) 상기 공간이 조성된 앱, 플랫폼, 컴퓨터; d) 상기 현장의 장비, 드론, 자재, 사람, 인 간, 아바타, 건물, 비계, 형틀, 건자재; e) 상기 현장에 구비된 상기 수단 내지 복합수단; f) 상기 장비 내지 건자재 등에 부착된 ID칩, IDtag, 바코드; g) 상기 ID칩, IDtag, 바코드 등의 인식장치; h) 상기 수단에 속하는 센서에 의한 센싱 정보, 카메라에 의한 영상 정보; 게측기에 의한 계측 정보, 상기 인식장치에 의한 인식 정보 등을 송신하는 송신기; i) 상기 현장 내지 송신기 등에 연계된 비콘, 통신망, 서버, 처리장치; j) 상기 현장 내 지 처리장치 등에 연계된 단말기, 컴퓨터, 모니터, 스크린, 핸드폰, 디스플레이; k) 상기 현장 내지 디스플레이 등이 연계되는 플랫폼, 가상공간, 메타버스; ℓ) 상기 장비 내지 건자재 등의 이동 경로가 나타나는 플랫폼, 가 상공간, 메타버스; m) 상기 현장에서의 건물이 축조되는 과정이 방영되는 플랫폼, 가상공간, 메타버스; n) 상기 플랫폼, 가상공간, 메타버스 등이 제공 또는 방영되는 앱, 어플, SNS, 단말기, 컴퓨터, 모니터, 스크린, 핸드폰, 디스플레이; o) 상기 정보가 제공되는 상기 서버 내지 메타버스; p) 상기 정보에 의하여 이동 경로, 사 람 위치, 장비 위치, 자재 위치, 사람 안전, 장비 안전, 공기 환경, 방역 상태, 건물 축조, 공사 장면 등이 파 악되는 상기 서버 내지 메타버스; q) 상기 파악에 의하여 경보, 경고, 알람, 통화, 통신, 조치, 대책마련, 자동 경고 등을 하는 본사, 관리자, 총괄자, 관제센터, 상기 서버 내지 메타버스; 등이 가능하거나, 또는 등의 구현 이 가능하다. 도 4 및 도 5는 본 발명에 의한 a) 웨어러블수단, 작업자, 작업자의 스마트폰, 웨어러블수단에 부착되는 기구 또는 부착물, 작업자에 부착되는 기구 또는 부착물; b) 이중 하나 이상에 연계 되는 통신망(50, 60), 서버, 처리장치, 단말기990); c) 상기 수단 내지 단말기 등에 연계되는 컨트롤러 , 핸드폰, 디스플레이, 메타버스; d) 상기 수단 내지 메타버스 등이 이용되는 시스템, 메타버 스, 관리시스템, 안전관리시스템을 나타낸 모식도이다. 여기서 웨어러블수단으로는 헬멧 또는 모자, 안경 또는 고글, 완장 또는 어깨밴드, 조끼 또는 상의, 멜빵 또는 X밴드, 손목밴드, 시계 또는 워치, 신발 또는 작업화, 고리 또는 안전고리 등이 도시되어 있다. 그리고 웨어러블수단 또는 작업자에 부착되는 기구 또는 부착물로는 센서 또는 측정기, 버튼 또는 SOS버튼, 랜턴 또는 라이트 , 카메라 또는 CCTV, 무전기 또는 마이크, 알림기 또는 알림등, 램프 또는 후방등, 계측기 또는 모니터링장치, 충전기 또는 배터리, 제어기 또는 컨트롤러, 포켓 또는 주머니(20') 등이 도시 되어 있다. 상기 포켓 또는 주머니(20')에는 상기 센서 내지 제어기 등이 내장 또는 보관될 수 있다. 본 발명의 안전관리시 스템에는 상기 웨어러블수단, 헬멧 내지 안전고리, 센서 내지 주머니, 센서 내지 디스플레이 등이 이용 또는 구비된다. 본 발명에 웨어러블수단의 전면 또는 전방에는 상기 센서 내지 주머니, 그리고 웨어러블 수단의 후면 또는 후방에는 카메라 또는 CCTV, 램프 또는 후방등, 계측기 또는 모니터링장치 , 배터리 또는 태양전지, 제어기 또는 컨트롤러 등이 구비될 수 있다. 물론 웨어러블수단의 후 면 또는 후방에도 상기 센서 내지 주머니 등이 구비될 수도 있다. 그리고 본 발명에 의한 장비, 장치, 드론, 필드수단, 웨어러블수단, 공장, 현장, 시설, 건물, 사람(30, 31, 32), 작업자, 아바타, 이용자, 스마트폰, 계측기 등에는 상기 센서 내지 주머니 등이 구비될 수 있다. 상기 수단 내지 부착물, 헬멧 내지 안전고리, 센서 내지 주머니 등은 통신장치, 통신망, 서버 , 처리장치, 단말기, 사무실, 관제센터, 작업자, 관리자, 총괄자, 이용자 , 스마트폰, 장비, 계측기, 드론, 메타버스 등에 연계, 연결, 구비, 거치 등이 될 수 있다. 본 발명에 의한 웨어러블수단의 전면 또는 전방, 후면 또는 후방을 살펴보면 헬멧 또는 모자의 경 우는 창 또는 햇빛가리게가 있는 부분이 전면이고 이의 반대측이 후면이다. 안경 또는 고글의 경우는 안경알 측이 전면이고 안경테 측이 후면이다. 완장 또는 어깨밴드의 경우는 사람의 앞으로 보이는 부 분이 전면이고 사람의 뒤로 보이는 부분이 후면이다. 조끼 또는 상의의 경우는 쟈크, 오픈부 등이 있 는 부위가 전면이고 이의 반대측 또는 오픈부가 없는 부위가 후면이다. 멜빵 또는 X밴드의 경우는 X 모양이 있는 부분이 후면이고 이의 반대측이 전면이다. 손목밴드의 경우는 손바닥과 동일한 방향의 부분이 전면이고 이의 반대측이 후면이다. 시계 또는 워치의 경우는 손등과 동일한 방향의 부분이 전 면이고 이의 반대측이 후면이다. 신발 또는 작업화의 경우는 앞굽이 있는 부분이 전면이고 뒷굽이 있는 부분이 후면이다. 고리 또는 안전고리의 경우는 사람의 멜빵에 연결되는 고리 부분이 전 면이고 상기 멜빵에 이격된 고지대의 봉에 연결되는 고리 부분이 후면이다. 도 5의 a, b에는 본 발명에 의한 웨어러블수단, 작업자, 헬멧 또는 모자, 조끼 또는 상의, 멜빵 또는 X밴드 등에 장착되는 센서 또는 계측기, 카메라 또는 CCTV, 알림기 또는 알림등, 계측기 또는 모니터링장치, 배터리 또는 태양전지, 제어기 또는 컨트롤러 등의 기구 또는 장착물에 대 한 상세 실시예가 도시되어 있다. 상기 센서 또는 계측기에는 센서, 소자, 계측기, 측정기, 위치센서, 모션 센서, 생체센서, 가스센서, 환경센서, 공기질센서, 자이로센서, 가속도센서, CO센서, O2센서, O3센서, CO2센서 등이 포함될 수 있다. 상기 카메라 또는 CCTV에는 스피커, 단자, LED, 카메라 등이 포함될 수 있다. 상기 a) 스피커는 폰, 스피커, 마이크, 전화기, 무전기 등, b) 단자는 단자, 잭단자, 홈단자, 구멍단자, 요홈단자, 잭꽂이단자, 헤드폰꽂이, 헤드폰단자, 이어폰꽂이, 아어폰단자, 이어폰잭 단자 등, c) LED는 LED, 라이트, 촬영라이트, 등LED, LED등, 촬영LED, 조명LED, LED촬영등, LED라이트, LED촬영라이트 등, d) 카메라는 카메라, 촬영기, CCTV, 각조절카메라, HD카메라, Full HD카메라 등이 포함 되거나, 또는 등이 될 수 있다. 상기 알림기 또는 알림등에는 카메라, LED, 메모리 등이 포함될 수 있다. 상기 a) 카메라 는 카메라, 촬영기, CCTV, 각조절카메라, HD카메라, Full HD카메라 등, b) LED는 LED, 램프LED, 조 명LED, 안전LED, 표시등, 야광등, 인디케이터, LED인디케이터 등, c) 메모리는 메모리, 외장메모리, 메모 리카드, 보조기억장치, 이동식기억장치, 디스크, 메모리디스크, SD(Secure Digital), USB(Universal Serial Bus), SIM(subscriber identity module)카드, UICC(universal IC card), USIM(universal subscriber identity module), SD Card, USB Card, Secure Digital memory card 등이 포함되거나, 또는 등이 될 수 있다. 상기 제어기 또는 컨트롤러에는 전면에 랜턴, 스위치, 버튼; 후면에 마이크, 화 면, 무전기, 제어툴, 전송기; 등이 포함될 수 있다. 상기 a) 랜턴은 등(燈), 빛, 랜 턴, 라이트, LED랜턴, 고휘도랜턴, 라이트랜턴, LED등, 전등(傳燈) 등, b) 스위치는 스위치, 버튼, ON/OFF, LED ON/OFF, 전후면 LED ON/OFF, ON/OFF 버튼, ON/OFF 스위치 등, c) 버튼은 버튼, SOS, SOS버튼, 알림버튼, 얼람버튼, 경고버튼, 사고발생알림버튼, 구호요청버튼 등, d) 마이크는 마이크, 스피 커, 무전기 등, e) 화면은 창, 화면, 화면창, 보기창, 디스플레이 등, f) 무전기는 무전기, 무전기버 튼, 버튼식 무전기, 통화무전기 등, g) 제어툴은 제어툴, 제어반, 제어기, 제어버튼, 제어장치 등, h) 전 송기는 전송기, 녹화버튼, 촬영버튼, 전송버튼, 송신버튼 등이 포함되거나, 또는 등이 될 수 있다. 상기 배터리 또는 태양전지에는 전기, 전원, 전류, 전압, 전지, 전극, 양극, 음극, 에너지, 전지판, 배터리, 건 전지, 충전지, 충전기, 충전잭, 대용량배터리, 교체형 배터리, 충전형 배터리, 태양전지판, 배터리집, 배터리하 우징, 배터리안착대, 배터리고정대, 소켓, 플러그, 전선, 케이블, 콘센트, 콘덴서, 변압기, 정류기, 정전기, 계 전기, 증폭기, 변환기, 전해조, 방전조, AC/DC변환기, 트랜스듀서, 전원공급기, 고전압발생기 등이 포함될 수 있다. 도 5의 c에는 센서 또는 측정기, 버튼 또는 SOS버튼, 랜턴 또는 라이트, 카메라 또는 CCTV, 무 전기 또는 마이크, 알림기 또는 알림등, 램프 또는 후방등, 계측기 또는 모니터링장치, 배터리 또는 태양전지, 제어기 또는 컨트롤러 등의 기구가 도시되어 있다. 도 5의 d에는 상기 센서 내지 제어기 중 둘 이상이 합체된 기구를 나타낸다. 여기서 d1은 센서와 SOS버튼과 비콘이 합체된 기구, d2는 센서와 SOS버튼과 게이트웨이가 합체된 기구, d3는 센서와 SOS버튼과 카메라 와 무전기와 제어기와 통신장치가 합체된 기구 이다. 여기서 기구는 띠, 통, 판, 밴드, 스 틱, 롯드, 막대, 세트, 집, 원통, 중공체, 중공통, 사각통, 케이스, 하우스, 하우징 등에 내장되거나, 또는 일 정의 길이를 가진 상기 띠 내지 하우징 등에 내장될 수 있거나, 또는 외형이 상기 통 내지 하우징 등의 형상을 가진다. 도 5의 d는 일정의 길이를 가진 사각통의 모양을 가진 기구를 보여준다. 상기 합체된 기구는 헬멧의 테 두리, 헬멧의 하부 테두리, 헬멧의 측면 테두리(도 5의 a의 헬멧 참조), 조끼의 전면(도 5의 a의 조끼 참조),조끼의 포켓, 멜빵의 전면띠, 멜빵의 허리띠(도 5의 a의 멜빵 참조), 멜빵의 후면 X띠, 완장의 전면 등에 거치 가 될 수 있다. 상기 기구(10는 필드수단, 웨어러블수단, 헬멧 또는 모자, 완장 또는 어깨밴드, 조끼 또는 상의 , 멜빵 또는 X밴드 등에 구비, 거치, 정착, 장착, 끼움, 연결, 걸쇠, 핀연결, 고리연결 등이 될 수 있 다. 여기서 센서 또는 계측기는 웨어러블수단의 착용 감지, 버튼 또는 SOS버튼은 근로자 위급상황 알림, 비콘은 스마트폰 등과 연동되어 근로자 위치 감지 또는 모니터링 등의 기능을 하게 되고, 이는 비콘 , 게이트웨이, 통신장치, 통신망 등을 통하여 무선으로 서버, 단말기, 사무실, 본사, 중앙관제센터, 작업자, 관리자, 총괄자, 앱 이용자 등에 전달 또는 통지된다. 그리고 상기 띠 내지 하우징 등에는 상기 센서 내지 주머니, 센서 내지 디스플레이 등의 구비도 가능하다. 상기 띠 내지 하우징 등은 상기 센서 내지 주머니, 센서 내지 디스플레이 중 둘 이상이 구비된 세트 기구가 된다. 도 6은 본 발명에 의한 삼각대, 거치대, 조립대, 메타버스 등(44, 45)의 모식도이다. 상기 삼각대, 거치대, 조 립대 등(44, 45)은 a) 삼각대, 삼발이, 거치대, 지지대(44, 45), 격자대, 격자틀, 조립대, 조립틀, 조립세트, 촬영대, 틀, 1m 이상 높이의 틀, 폴대, 봉, 셀카봉, 탑, 타워, 비계, 고층탑, 고층 타워, 사다리, 유압식 삼각대, 폴식 삼각대, 촬영기 거치대, 카메라 거치대, 촬영기 지지대, 카메 라 지지대, 측량기 삼각대, 접이식 삼각대, 조립식 삼각대, 접이식 격자대, 접이식 격자틀, 접이식 거 치대, 조립식 거치대, 현장이나 공장에 거치된 삼각대, 현장이나 공장에 거치된 거치대, 현장이나 공장 에 거치된 조립대, tripod, 트라이포드; b) 이동형의 상기 삼각대 내지 트라이포드; c) 상기 수단 내지 복합수단 등이 구비된 상기 삼각대 내지 트라이포드; d) 이중 둘 이상이 조합된 복합대; 등이 해당된다. 상기 삼각대 내지 복합대 등에는 상기 센서 내지 제어기, 통신장치 내지 디스플레이 등의 구비 또는 연계가 가능하다. 이의 실시예로는 상기 센서 내지 제어기 등이 구비된 삼각대를 현장이나 공장에 비치하여 작업 중에 상기 센서 내지 제어기 등이 수행한 영상이나 정보를 실시간으로 무선송신하여 서버, 핸드폰, 화면, 메타버스, 디스플레이 등으로 수신하여 상기 영상이나 정보를 실시간적으로 살펴보아 현장, 공장, 작업, 공사, 건축, 안전, 방역, 환경, 품질, 공기질, 대기질 등을 관리하는 것이다. 상기 삼각대, 거치대, 조립대 등(40, 44, 45)의 예로는 a) 다리, 2발 다리, 3발 다리, 4발 다리; b) 격자, 프레임, 조립체, 조립대, 1m 이상의 조립대; c) 상기 다리 내지 조립대 등의 하부에 거치된 바 퀴 또는 이동수단; d) 상기 다리 내지 조립대 등의 상부에 거치된 받침대; e) 상기 받침대의 상부에 거치된 서포트; f) 상기 다리 내지 서포트 등의 상부에 거치된 안착대; g) 상기 안착대에 안착된 거 치된 카메라; h) 상기 다리 내지 카메라 등을 회전시키는 회전수단; i) 상기 다리 내지 회전수단 등에 구비된 관절, 절곡, 마디, 연골, 연성대, 자바라, 접이대, 출입대, 스프링, 인장수축대; j) 상기 다리 내 지 회전수단 등에 형성된 포켓(20'); k) 상기 다리 내지 포켓 등에 구비된 상기 센서 내지 제어기(10, 11, 12, 13, 14, 15, 16, 17, 18, 19); ℓ) 상기 다리 내지 제어기 등에 연계되는 통신장치, 통신망, 서버 , 처리장치, 하드웨어; m) 상기 다리 내지 하드웨어 등에 연계되는 단말기, 컴퓨터, 모니 터, 스크린, 핸드폰; n) 상기 다리 내지 핸드폰 등에 연계되는 통신장치, 통신망, 스마트 폰, 디스플레이; o) 상기 서버 내지 디스플레이 등에 구현되는 플랫폼, 메타버스; p) 상기 다 리 내지 메타버스 등이 구비된 시스템, 관리시스템, 가상시스템, 안전시스템; 등이 해당 또는 포함된다. 상 기 삼각대, 거치대, 조립대, 다리 내지 안전시스템 등에는 상기 수단 내지 복합수단 등의 이용이나 연계가 가능 하다. 상기 수단 내지 복합수단 등에는 상기 삼각대 내지 안전시스템 등의 이용이나 연계가 가능하다. 이상에 기재 또는 설명된 내용, 용어, 단어, 숙어, 구절, 어구, 문구, 문장, 단락, 설명, 해설, 표현, 표기, 도 면, 그림, 청구항 내용 등은 본 발명의 청구 범위, 내용, 청구항 등에 포함될 수 있다. 이상은 본 발명에 의해 구현될 수 있는 내용, 청구항, 실시예 등의 일부에 관한 것으로, 주지된 바와 같이 본 발명의 범위는 위의 내용, 청구항, 실시예 등에 한정되어 해석되어서는 안 될 것이며, 위에서 설명된 본 발명의 기술적 사항과 그 근본을 함께 하는 기술적 사항은 모두 본 발명의 범위에 포함된다고 할 것이다."}
{"patent_id": "10-2024-0044515", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 시스템을 나타내는 모식도 도 2는 본 발명에 의한 안전관리시스템을 나타내는 모식도 도 3은 본 발명에 의한 현장 및 공장에서의 안전관리시스템을 나타내는 모식도 도 4 및 5는 본 발명에 의한 웨어러블수단 및 부착물을 나타낸 모식도 도 6은 본 발명에 의한 삼각대, 거치대, 조립대를 나타낸 모식도"}
