{"patent_id": "10-2019-0042780", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0123499", "출원번호": "10-2019-0042780", "발명의 명칭": "발렛서비스장치 및 그 장치의 구동방법", "출원인": "이근호", "발명자": "이근호"}}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주차대행 서비스를 이용하는 차량이 도착한 제1 장소의 원거리에 위치하는 제2 장소에 대한 장소 정보를 저장하는 저장부; 및상기 저장한 장소 정보 및 상기 차량의 차주가 지정 지역에 머무는 시간 길이를 근거로 상기 차량을 이동시키기위한 상기 제2 장소 내의 주차장을 결정하며, 상기 결정한 주차장으로 차량이 위치 변경되면, 변경 사실을 상기차주의 제1 단말장치로 통지하는 제어부;를포함하는 발렛서비스장치."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제어부는, 주차를 대행하는 발렛요원의 제2 단말장치로 상기 차량의 차량 정보 및 상기 결정한 주차장의주차장 정보를 전송하여 상기 차량을 이동시키는 발렛서비스장치."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제어부는 상기 제1 단말장치로부터 상기 주차장으로 이동하기 위한 픽업 요청이 있으면, 상기 제2 단말장치로 요청 사실을 통지하는 발렛서비스장치."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제어부는, 상기 차주가 상기 주차대행 서비스의 예약시 입력하는 상기 장소 정보를 근거로 상기 제2 장소내의 주차장을 추천하며, 상기 추천을 통해 지정되는 주차장의 주차장 정보를 상기 저장부에 저장시키는 발렛서비스장치."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어부는, 지역상권 주차할인 티켓의 제시 여부 및 상기 주차장으로의 픽업 여부 중 적어도 하나의 상황에따라 주차 요금을 정산하는 발렛서비스장치."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제어부는, 상기 지정 지역의 빅데이터를 수집하여 상기 저장부에 저장하며, 상기 저장한 빅데이터를 인공지능(AI)에 의해 딥러닝한 분석 결과를 근거로 상기 주차장을 결정하는 발렛서비스장치."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "저장부 및 제어부를 포함하는 발렛서비스장치의 구동방법으로서,주차대행 서비스를 이용하는 차량이 도착한 제1 장소의 원거리에 위치하는 제2 장소에 대한 장소 정보를 상기저장부에 저장하는 단계; 및상기 제어부가, 상기 저장한 장소 정보 및 상기 차량의 차주가 지정 지역에 머무는 시간 길이를 근거로 상기 차량을 이동시키기 위한 상기 제2 장소 내의 주차장을 결정하며, 상기 결정한 주차장으로 차량이 위치 변경되면,공개특허 10-2020-0123499-3-변경 사실을 상기 차주의 제1 단말장치로 통지하는 단계;를포함하는 발렛서비스장치의 구동방법."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,주차를 대행하는 발렛요원의 제2 단말장치로 상기 차량의 차량 정보 및 상기 결정한 주차장의 주차장 정보를 전송하여 상기 차량을 이동시키는 단계;를 더 포함하는 발렛서비스장치의 구동방법."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 제1 단말장치로부터 상기 주차장으로 이동하기 위한 픽업 요청이 있으면, 상기 제2 단말장치로 요청 사실을 통지하는 단계;를 더 포함하는 발렛서비스장치의 구동방법."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 차주가 상기 주차대행의 서비스 예약시 입력하는 상기 장소 정보를 근거로 상기 제2 장소 내의 주차장을추천하며, 상기 추천을 통해 지정되는 주차장의 주차장 정보를 상기 저장부에 저장시키는 단계;를 더 포함하는발렛서비스장치의 구동방법."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,지역상권 주차할인 티켓의 제시 여부 및 상기 주차장으로의 픽업 여부 중 적어도 하나의 상황에 따라 주차 요금을 정산하는 단계;를 더 포함하는 발렛서비스장치의 구동방법."}
{"patent_id": "10-2019-0042780", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 지정 지역의 빅데이터를 수집하여 상기 저장부에 저장하는 단계; 및상기 저장한 빅데이터를 인공지능(AI)에 의해 딥러닝한 분석 결과를 근거로 상기 주차장을 결정하는 단계;를더 포함하는 발렛서비스장치의 구동방법."}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 발렛서비스장치 및 그 장치의 구동방법에 관한 것으로서, 본 발명의 실시예에 따른 발렛서비스장치는, 주차대행 서비스를 이용하는 차량이 도착한 제1 장소의 원거리에 위치하는 제2 장소에 대한 장소 정보를 저장하 는 저장부, 및 저장한 장소 정보 및 차량의 차주가 지정 지역에 머무는 시간 길이를 근거로 차량을 이동시키기 위한 제2 장소 내의 주차장을 결정하며, 결정한 주차장으로 차량이 위치 변경되면, 변경 사실을 차주의 제1 단말 장치로 통지하는 제어부를 포함할 수 있다."}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 발렛서비스장치 및 그 장치의 구동방법에 관한 것으로서, 더 상세하게는 가령 발렛 서비스(valet service)를 이용하는 차량의 도착지와 차량의 출발지가 원거리의 서로 다른 장소일 때 지역단위별로 발렛파킹 (valet parking) 서비스를 제공하는 발렛서비스장치 및 그 장치의 구동방법에 관한 것이다."}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적인 발렛 서비스는 호텔, 극장, 공항, 음식점, 숙박시설 등과 같은 서비스 시설을 이용하기 위하여 도착 차량의 운전자를 대신하여 차량을 전용주차장으로 주차해 주는 서비스를 일컫는다. 이러한 발렛 서비스는 주차 를 원하는 차량이 해당 서비스 시설로 진입하면 종이 주차권 또는 별도의 차량 식별 번호표를 발행하여 운전자 에게 전달하고, 이후 운전자가 출차를 요청하면 종이 주차권 또는 차량 식별번호표를 확인한 후 해당 차량을 출 차하는 서비스 방식으로 운영되고 있다. 이처럼 일반적인 발렛 서비스의 경우 고객이 이용하려는 서비스 시설에 진입해야만 발렛 서비스를 제공받을 수 있다. 이와 같이, 기존의 발렛 파킹은 특정 건물내 위주로 제안되어 있 다. 그런데, 고객들은 가령 명동에서 쇼핑을 한 후 남대문 시장을 방문하거나 남산 타워도 방문할 수 있다. 이러한 경우 실제 차량을 가지고 이동하는 경우 교통 체증, 주차장 확보, 주차비 등으로 인해 많은 불편함을 겪게 되는 문제가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제10-2017-0030976호(2017.03.20.) (특허문헌 0002) 한국공개특허공보 제10-2016-0136879호(2016.11.30.)"}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예는 가령 발렛서비스를 이용하는 차량의 도착지와 차량의 출발지가 원거리의 서로 다른 장소일 때 지역단위별로 발렛파킹 서비스를 제공하는 발렛서비스장치 및 그 장치의 구동방법을 제공함에 그 목적이 있 다."}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따른 발렛서비스장치는, 주차대행 서비스를 이용하는 차량이 도착한 제1 장소의 원거리에 위치하는 제2 장소에 대한 장소 정보를 저장하는 저장부, 및 상기 저장한 장소 정보 및 상기 차량의 차주가 지 정 지역에 머무는 시간 길이를 근거로 상기 차량을 이동시키기 위한 상기 제2 장소 내의 주차장을 결정하며, 상 기 결정한 주차장으로 차량이 위치 변경되면, 변경 사실을 상기 차주의 제1 단말장치로 통지하는 제어부를 포함 한다. 상기 제어부는, 주차를 대행하는 발렛요원의 제2 단말장치로 상기 차량의 차량정보 및 상기 결정한 주차장의 주 차장 정보를 전송하여 상기 차량을 이동시킬 수 있다. 상기 제어부는 상기 제1 단말장치로부터 상기 주차장으로 이동하기 위한 픽업 요청이 있으면, 상기 제2 단말장 치로 요청 사실을 통지할 수 있다. 상기 제어부는, 상기 차주가 상기 주차대행 서비스의 예약시 입력하는 상기 장소 정보를 근거로 상기 제2 장소 내의 주차장을 추천하며, 상기 추천을 통해 지정되는 주차장의 주차장 정보를 상기 저장부에 저장시킬 수 있다. 상기 제어부는, 지역상권 주차할인 티켓의 제시 여부 및 상기 주차장으로의 픽업 여부 중 적어도 하나의 상황에 따라 주차 요금을 정산할 수 있다. 상기 제어부는, 상기 지정 지역의 빅데이터를 수집하여 상기 저장부에 저장하며, 상기 저장한 빅데이터를 인공 지능(AI)에 의해 딥러닝한 분석 결과를 근거로 상기 주차장을 결정할 수 있다. 또한, 본 발명의 실시예에 따른 발렛서비스장치의 구동방법은, 저장부 및 제어부를 포함하는 발렛서비스장치의 구동방법으로서, 주차대행 서비스를 이용하는 차량이 도착한 제1 장소의 원거리에 위치하는 제2 장소에 대한 장 소 정보를 상기 저장부에 저장하는 단계, 및 상기 제어부가, 상기 저장한 장소 정보 및 상기 차량의 차주가 지 정 지역에 머무는 시간 길이를 근거로 상기 차량을 이동시키기 위한 상기 제2 장소 내의 주차장을 결정하며, 상 기 결정한 주차장으로 차량이 위치 변경되면, 변경 사실을 상기 차주의 제1 단말장치로 통지하는 단계를 포함한 다. 상기 구동방법은, 주차를 대행하는 발렛요원의 제2 단말장치로 상기 차량의 차량정보 및 상기 결정한 주차장의 주차장 정보를 전송하여 상기 차량을 이동시키는 단계를 더 포함할 수 있다. 상기 구동방법은, 상기 제1 단말장치로부터 상기 주차장으로 이동하기 위한 픽업 요청이 있으면, 상기 제2 단말 장치로 요청 사실을 통지하는 단계를 더 포함할 수 있다. 상기 구동방법은, 상기 차주가 상기 주차대행 서비스의 예약시 입력하는 상기 장소 정보를 근거로 상기 제2 장 소 내의 주차장을 추천하며, 상기 추천을 통해 지정되는 주차장의 주차장 정보를 상기 저장부에 저장시키는 단 계를 더 포함할 수 있다.상기 구동방법은, 지역상권 주차할인 티켓의 제시 여부 및 상기 주차장으로의 픽업 여부 중 적어도 하나의 상황 에 따라 주차 요금을 정산하는 단계를 더 포함할 수 있다. 상기 구동방법은, 상기 지정 지역의 빅데이터를 수집하여 상기 저장부에 저장하는 단계, 및 상기 저장한 빅데이 터를 인공지능(AI)에 의해 딥러닝한 분석 결과를 근거로 상기 주차장을 결정하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면 특정 지역에 머무르는 사람의 경우 쇼핑, 식음료 섭취 등을 위해 위치를 변경하는 경우가 많고, 이때 해당 지역에서 머무르는 시간 등을 참고하여 발렛 서비스시 주차장의 위치를 결정함으로써 해당 지역의 주차 문제를 쉽게 해결할 수 있을 것이다. 또한, 사람들이 많이 모이는 지역 등의 상권 기반으로 발렛 파킹을 제안함으로써 지역 상권의 활성화 등에 기여 할 수 있으며, 주차장이 있는 빌딩, 지역상인, 유휴인력(예: 노인) 등을 가용해 발렛 서비스를 제공함으로써 지 역발전에도 많은 도움을 줄 수 있을 것이다."}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 실시예에 대하여 상세히 설명한다. 도 1은 본 발명의 제1 실시예에 따른 발렛서비스시스템을 나타내는 도면이고, 도 2는 본 발명의 제2 실시예에 따른 발렛서비스시스템을 도식화하여 나타낸 도면이며, 도 3은 발렛 서비스를 제공하는 지역 단위의 발렛존과 주차장을 보여주기 위한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 실시예에 따른 발렛서비스시스템은 고객 단말장치(이하, 제1 단말장치), 발렛요원 단말장치(이하, 제2 단말장치 ), 통신망 및 발렛서비스장치의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 통신망과 같은 일부 구성요소가 생략되어 단말장치(100, 105)와 발렛서비스장치가 다이렉트 통신(예: P2P 통신 등)을 수행하거나 발렛서비스장치의 일부 또는 전부가 통신망 내의 네트워크장치(예: 무선교환장치 등)에 통합되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설명한다. 제1 단말장치 및 제2 단말장치는 음성 통화나 인터넷 서비스 등이 가능한 스마트폰 등의 무선단말, 태블릿PC, 랩탑컴퓨터, 또 몸에 착용가능한 웨어러블장치, 나아가 본 발명의 실시예에 따른 서비스를 이용하기 위한 전용 단말을 포함한다. 물론 제2 단말장치는 무전기와 같은 장치나 발렛존에 고정되어 설치되는 키오스크(kiosk) 등의 고정장치를 더 포함할 수 있다. 제1 단말장치는 가령 주차대행 즉 발렛파킹 서비스를 이용하는 차량의 차주가 소지하는 단말장치로서, 도 2에 나타낸 대로 회사나 가정에서 발렛서비스의 예약을 수행하는 컴퓨터 등의 단말장치(이하, 예약 단말장 치)와, 차주가 항상 소지하는 스마트폰 등의 단말장치를 모두 포함한다. 설명의 편의상 스마트폰 등으로 설 명한다. 제1 단말장치는 차주가 차량을 제1 장소에 도착하여 제1 장소와 원거리에 있는 제2 장소에서 회수 하고자 할 때, 차량이 제2 장소에 주차되었다는 사실과 함께 다양한 부가 정보를 발렛서비스장치로부터 수 신하게 된다. 물론 여기서, 제1 장소는 제1 지역이 될 수 있고, 제2 장소는 제2 지역이 될 수 있으며, 혹은 제1 장소 및 제2 장소는 제1 지역 내에 존재할 수도 있다. 제1 지역 및 제2 지역은 행정구역상의 구역(예: 시, 군, 구 등)이 될 수 있지만, 특정 상권을 중심으로 가상으로 설정한 구역일 수도 있다. 따라서, 본 발명의 실시예에서의 그러한 용어의 의미에 특별히 한정하지는 않을 것이다. 다만, 본 발명의 실시예에서의 \"원거리\"란 기존과 같이 차량이 도착해 발렛파킹을 이용한 후 동일한 곳이나 그 인근에서 차량을 회수하는 것이 아니라, 가급적 일반 사람들의 시각에서 볼 때 많이 이격되어 있는 위치를 의미한다고 볼 수 있다. 물론 본 발명의 실시예에는 이러한 서비스 를 병행하여 실시하는 것도 얼마든지 가능할 수 있다. 좀더 구체적으로, 본 발명의 실시예는 도 2에서와 같이, 특정 상권(예: 명동역 근처)이 있는 지역 내에서 이루 어지는 지역단위별 서비스인 것이 바람직하다. 특정 지역 내에 복수의 발렛존(200; 201, 202)과 주차장(210; 211, 212)을 배치하고, 이를 중심으로 발렛서비스를 제공하는 것이다. 이를 통해 고객들이 특정 지역에 도착하 여 주차나 교통 체증 등을 걱정하지 않고 자유롭게 관광을 하거나 쇼핑을 할 수 있도록 하고, 이와 같이 특정 장소에 오래 머무를 수 있게 함으로써 지역의 경기 활성화에 기여할 수 있을 것이다. 본 발명의 실시예에 따른 제1 단말장치는 자신의 차량이 발렛파킹 즉 주차대행 서비스를 이용하여 제2 장 소에 주차되는 곳에 대한 정보를 알 수 있으면 족하다. 예를 들어, 제1 단말장치의 차주는 본 발명의 실시 예에 따른 발렛서비스장치에 접속하여 사전에 예약을 진행하여 발렛서비스를 이용할 수도 있다. 물론 이의 경우, 차주는 제1 단말장치나 기타 컴퓨팅 장치를 통해 자신이 직접 제1 장소나 제2 장소에 대한 위치정보, 즉 차량의 도착지, 더 정확하게는 발렛 서비스 지점에 주차하고, 또 회수하고자 하는 제2 장소의 주 차장 등에 대한 정보를 선택하여 입력할 수 있다. 예약은 물론 차주가 소지하는 제1 단말장치에서 이루어 지거나 예약 단말장치에서 이루어질 수 있다. 이와 같이, 예약이 이루어지는 예약 단말장치와 차주가 소지하는 제1 단말장치는 상이할 수 있다. 따라서, 발렛서비스의 이용시에는 차주가 소지하는 스마트폰과 같은 제1 단말장치인 것이 바람직하다. 예약에 의하든, 아니면 임의적이든 제1 단말장치의 차주는 특정 지역의 지정 장소로 차량을 가지고 방문하 게 되고, 그곳의 발렛요원에게 차량을 회수하려는 곳의 위치 즉 제2 장소에 대한 정보를 알리게 되면, 이의 과 정에서 회수하려는 시간 정보도 함께 제공하면, 발렛요원이 이의 정보들을 입력하거나 함으로써 제2 장소로의 차량 이동이나 해당 지역에 머무르는 시간에 따라 차량의 주차 장소에 대한 정보를 제공받을 수 있게 된다. 머 무르는 시간이 길면 주차 문제를 해결하기 위하여 주차는 가급적 회수하고자 하는 대기장소로부터 멀게 주차를 한 후, 가까운 곳으로 이동시키는 것도 얼마든지 가능할 수 있게 되는 것이다. 따라서, 제1 단말장치의 차 주가 예약을 수행하거나 제2 장소의 정보를 입력해야 하는 등의 번거로움을 덜 수 있을 것이다. 또한, 제1 단말장치는 제2 장소로 자신의 차량이 이동되었다는 사실을 도 1의 발렛서비스장치로부터 통지받고, 가령 자신의 차량이 주차되어 있는 주차장소와 현재 자신이 위치하는 장소와의 거리가 멀다고 판단될 때 픽업(pick up)을 요청하면, 물론 이의 과정도 발렛요원을 통해 픽업 정보가 처리될 수 있겠지만, 본 발명의 실시예에 따른 주차대행 서비스에 접속하여 픽업 정보를 입력함으로써 처리가 이루어질 수 있다. 이와 같이 픽 업을 요청하여 픽업에 의해 제2 장소로의 이동도 얼마든지 가능하게 된다. 나아가, 제1 단말장치는 제1 장소에 도착한 후, 자신의 위치가 변경될 때, 자신의 위치 이동 경로에 대한 정보를 제공할 수 있도록 GPS 모듈을 가동하고, 이는 물론 서비스 신청시 고객의 동의하에 이루어질 수 있겠지 만, 이와 같이 자신의 위치를 공유함으로써 발렛서비스의 이용시 해당 위치의 맛집 정보와 같은 유용한 정보를 제공받을 수 있거나, 서비스 제공자의 입장에서는 차량을 회수하려는 곳에 멀게 배차되어 있는 차량을 가까운 곳으로 이동시키기 위한 시간을 예측하여 차량을 적절히 배치시킬 수도 있게 된다. 제2 단말장치는 발렛요원이 소지하는 무전기나 스마트폰, 컴퓨터 등과 같은 다양한 장치를 포함하며, 키오 스크와 같이 발렛서비스를 제공하는 곳에 고정 설치되는 고정장치를 더 포함할 수 있다. 제2 단말장치는 차주가 발렛파킹을 신청할 때, 차주로부터 차량 정보와 휴대폰 정보 등을 제공받아 입력할 수 있으며, 차량의 이동이 완료된 경우, 이동이 완료되었다는 정보를 입력하여 제1 단말장치로 해당 사실이 통지되도록 할 수 있다. 이외에도 제2 단말장치는 차주가 픽업을 요청하거나 차주의 위치를 추적하여 제공되는 관련 정보를 발렛서 비스장치로부터 제공받을 수 있다. 예를 들어, 제1 단말장치에서 픽업 요청이 있는 경우, 발렛요원들 의 제2 단말장치로 해당 사실을 통지하고, 또는 통지한 후 요원이 신청하면 이를 근거로 픽업이 이루어지 게 되는 것이다. 또한 위치 추적을 통해서는 차주가 차량의 회수를 위해 대기하는 대기 장소에서 가급적 가까운 주차장(211, 212)으로 차량을 변경하여 이동시킬 수 있게 된다. 제2 단말장치는 차량의 위치를 변경시키라는 지시를 발렛서비스장치로부터 수신할 수 있고, 또 변경이 완료되면 이를 알려 차주의 제1 단말장치 로 관련 정보가 제공되도록 할 수 있을 것이다. 통신망은 유무선 통신망을 모두 포함한다. 가령 통신망으로서 유무선 인터넷망이 이용되거나 연동될 수 있다. 여기서 유선망은 케이블망이나 공중 전화망(PSTN)과 같은 인터넷망을 포함하는 것이고, 무선 통신망은 CDMA, WCDMA, GSM, EPC(Evolved Packet Core), LTE(Long Term Evolution), 와이브로(Wibro) 망 등을 포함하는 의미이다. 물론 본 발명의 실시예에 따른 통신망은 이에 한정되는 것이 아니며, 향후 구현될 차세대 이동 통신 시스템의 접속망으로서 가령 클라우드 컴퓨팅 환경하의 클라우드 컴퓨팅망, 5G망 등에 사용될 수 있다. 가 령, 통신망이 유선 통신망인 경우 통신망 내의 액세스포인트는 전화국의 교환국 등에 접속할 수 있지 만, 무선 통신망인 경우에는 통신사에서 운용하는 SGSN 또는 GGSN(Gateway GPRS Support Node)에 접속하여 데 이터를 처리하거나, BTS(Base Station Transmission), NodeB, e-NodeB 등의 다양한 중계기에 접속하여 데이터 를 처리할 수 있다. 통신망은 액세스포인트를 포함할 수 있다. 여기서의 액세스포인트는 건물 내에 많이 설치되는 펨토(femto) 또는 피코(pico) 기지국과 같은 소형 기지국을 포함한다. 여기서, 펨토 또는 피코 기지국은 소형 기지국의 분류 상 단말장치(100, 105) 등을 최대 몇 대까지 접속할 수 있느냐에 따라 구분된다. 물론 액세스포인트는 단말장치 (100, 105))와 지그비 및 와이파이 등의 근거리 통신을 수행하기 위한 근거리 통신모듈을 포함한다. 액세스포인 트는 무선통신을 위하여 TCP/IP 혹은 RTSP(Real-Time Streaming Protocol)를 이용할 수 있다. 여기서, 근거리 통신은 와이파이 이외에 블루투스, 지그비, 적외선, UHF(Ultra High Frequency) 및 VHF(Very High Frequency) 와 같은 RF(Radio Frequency) 및 초광대역 통신(UWB) 등의 다양한 규격으로 수행될 수 있다. 이에 따라 액세스 포인트는 데이터 패킷의 위치를 추출하고, 추출된 위치에 대한 최상의 통신 경로를 지정하며, 지정된 통신 경로 를 따라 데이터 패킷을 다음 장치, 예컨대 발렛서비스장치로 전달할 수 있다. 액세스포인트는 일반적인 네 트워크 환경에서 여러 회선을 공유할 수 있으며, 예컨대 라우터(router), 리피터(repeater) 및 중계기 등이 포 함된다. 발렛서비스장치는 지역단위별 발렛서비스를 제공한다. 도 2에서 볼 수 있는 바와 같이, 발렛서비스장치 는 서비스의 특성상 사람들이 주로 많이 모이는 도심의 주요 상권이나 관광지를 중심으로 구역을 설정하고, 이를 중심으로 DB(120a)상에 데이터를 구축하여 발렛서비스를 제공한다. 예를 들어, 발렛서비스장치 는 DB(120a)상에 도 2의 명동역 근처를 카테고리로 설정하고, 설정한 카테고리 내에는 복수의 발렛존(201, 202)에 대한 발렛존 정보와 복수의 주차장(211, 212)에 대한 주차장 정보를 저장할 수 있다. 지도정보에 맵핑시 켜 저장할 수 있지만, 단순히 매칭시켜 저장하는 것도 가능할 수 있다. 발렛서비스장치는 구축된 데이터를 근거로 발렛요원으로부터 발렛서비스를 이용하는 차주의 차량 정보나 휴대폰과 같은 단말장치의 사용자 정보를 제공받아 이를 기반으로 서비스를 제공하면 되지만, 즉 이를 기반으로 다양한 정보를 제공하면 되지만, 만약 예약을 진행하는 경우에는 사용자 즉 차주가 발렛서비스를 신청하면서 차 량의 도착지를 명동역 근처로 예약을 통해 설정하는 경우 도 2에서와 같이 해당 지역의 지도와 함께 발렛존 정 보와 주차장 정보를 제시하여 선택이 이루어지도록 할 수 있다. 이와 같이 발렛서비스장치는 발렛서비스를 이용하는 차주가 예약시 제공하는 정보를 기반으로 서비스를 제공할 수 있게 된다. 예를 들어, 차주가 도 2에서 볼 때, 발렛존의 어느 한 곳에 도착하여 발렛서비스를 신청하였다고 가정해 보자. 이의 경우, 차주의 차량정보와 제1 단말장치의 정보가 발렛요원의 제2 단말장치, 또는 발렛존 의 접수 장소에 설치되어 있는 키오스크를 통해 발렛서비스장치로 제공된다. 물론 이때, 차량을 회수 하고자 하는 제2 장소에 대한 정보가 함께 제공되며, 나아가 차량을 회수하려는 시간에 대한 시간 정보를 함께 제공할 수 있다. 발렛서비스장치는 발렛서비스 신청이 있으면, 해당 정보를 기반으로 발렛요원에게 작업 즉 차량의 이동을 할당할 수 있으며, 물론 이러한 작업의 배정은 다양하게 이루어질 수 있다. 가령, 발렛존 에 상주하는 발렛요원이 바로 차량을 이동시키는 경우에는 별도로 발렛요원을 선정하기 위한 과정이 생략 될 수 있다. 그러나, 발렛요원을 결정해야 하는 경우에는 해당 사실을 통지하고 누가 차량을 이동시킬 것인지에 대한 관련 정보를 수신하게 된다. 가령, 지역의 노인과 같은 유휴 인력을 발렛요원으로 활용하게 될 때, 제2 단 말장치로 고객의 발렛 요청 사실을 통지하고, 선택을 받아 서비스를 처리할 수 있을 것이다. 또한, 발렛서비스장치는 차량의 이동이 완료되었을 때, 발렛요원이 가령 제2 단말장치를 통해 입력하 는 정보를 근거로 제1 단말장치로 차량의 이동이 완료되었음을 통지한다. 물론 발렛서비스장치는 차 량이 주차되는 주차 정보를 제공할 때, 주차 정보는 차주가 제공한 제2 장소와 회수하려는 시간 즉 해당 지역에 머무르는 시간을 고려하여 결정하고, 이러한 결정은 발렛서비스장치에서 결정하여 발렛요원의 제2 단말장치로 전송하게 된다. 즉, 발렛서비스장치는 가령 제2 단말장치로 발렛을 통지할 때, 제1 장소의 차량 XXXX를 제2 장소, 더 정확하게는 도착지의 주차장에 대한 정보를 제공하면서 해당 주차장으로 이동시킬 수 있는 발렛요원을 찾아 할당하게 되는 것이다. 물론 주차장의 할당시에도 해당 주차장의 유휴 상태를 확인하여 할당하는 것이 바람직하다. 그리고, 발렛요원으로부터 주차장에 입고가 완료되었다는 통지를 받으면 발렛서비스 장치는 이를 근거로 제1 단말장치로 관련 사실을 통지한다. 나아가, 발렛서비스장치는 차주로부터 현재의 위치에서 도착지 주차장으로의 픽업 요청이 있으면 이를 근 거로 발렛요원에게 픽업을 지시한다. 물론 픽업 요청을 신청한 경우에는 별도의 요금이 부과될 수 있다. 차량의 차주가 도착지에 도착하여 직접 차량을 출고하는 경우, 주차장에 대기하거나 인근의 발렛존에 근무하는 직원은 차량의 출고시 발렛요금을 정산할 수 있다. 요금의 정산시 지역상권 주차할인 티켓의 소지 여부나 픽업을 요청 했는지의 여부에 따라 차등적으로 요금을 부과하며, 발렛서비스장치는 주차장에 설치된 정산기, 또는 발렛 요원 등을 통해 요금을 정산할 수 있고, 정산이 완료되면 계산 내역을 차주의 제1 단말장치로 전송할 수 있다. 상기의 구성 결과, 자신의 차량으로 특정 지역을 찾은 차주는 교통체증이나 부수적인 문제로 인한 불편함 없이 자유롭게 시간을 보낼 수 있으며, 또 해당 지역의 유휴 인력이나 유휴 주차 공간을 활용할 수 있게 됨으로써 지 역 경기의 활성화에도 많은 도움을 줄 수 있게 될 것이다. 도 4는 도 1의 발렛서비스장치의 세부구조를 예시한 블록다이어그램이다. 설명의 편의상 도 4를 도 1과 함께 참조하면, 본 발명의 실시예에 따른 발렛서비스장치는 통신 인터페이스 부, 제어부, 발렛서비스처리부 및 저장부의 일부 또는 전부를 포함한다. 여기서, \"일부 또는 전부를 포함한다\"는 것은 저장부와 같은 일부 구성요소가 생략되어 발렛서비스장치 가 구성되거나 발렛서비스처리부와 같은 일부 구성요소가 제어부와 같은 다른 구성요소에 통합 되어 구성될 수 있는 것 등을 의미하는 것으로서, 발명의 충분한 이해를 돕기 위하여 전부 포함하는 것으로 설 명한다. 통신 인터페이스부는 도 1의 통신망을 경유하여 제1 단말장치 및 제2 단말장치와 통신을 수행하며, 이의 과정에서 변/복조, 인코딩/디코딩, 먹싱/디먹싱, 암호화/복호화, 스케일링 등의 다양한 동작을 수행할 수도 있다. 이는 당업자에게 자명한 사항이므로 더 이상의 설명은 생략한다. 통신 인터페이스부는 가령 도 2의 예약 단말장치로부터 예약 신청이 있는 경우, 예약 신청에 의해 서 비스를 제공할 수 있다. 또한, 차량의 차주가 발렛존에 도착하여 발렛서비스를 요청한 경우, 발렛서비스를 요청한 차주의 차량정보, 차량을 회수하여 출발하려는 출발지 정보 등 다양한 정보를 수신하여 제어부로 전달한다. 또한, 통신 인터페이스부는 물론 이는 선택 사항이기는 하지만 제2 단말장치와의 통신에 의해 발렛요 원을 배정하기 위한 동작을 더 수행할 수 있으며, 차주의 이동 종착지로 차량의 이동이 완료된 경우, 이를 발렛 요원의 제2 단말장치로부터 수신하고, 또 제어부의 제어하에 이동이 완료되었다는 사실을 제1 단말장 치로 통지하게 된다. 그 이외에도 통신 인터페이스부는 제1 단말장치로부터 픽업 요청이 있거나, 제2 단말장치로부터 정산을 위한 요청이 있는 경우, 발렛서비스에 대한 정산 동작을 수행하게 된다. 여기서, 제2 단말장치는 키오스크와 같은 장치가 될 수 있을 것이다. 제어부는 발렛서비스장치를 구성하는 통신 인터페이스부, 발렛서비스처리부 및 저장부 의 전반적인 제어 동작을 수행한다. 통신 인터페이스부에서 발렛서비스처리부로 제공할 정보나 데이터가 수신되면, 이를 저장부에 임시 저장한 후 발렛서비스처리부로 제공할 수 있다. 또한, 발렛 서비스처리부에서 요청하는 다양한 동작을 수행할 수 있다. 예를 들어, DB(120a)로부터 데이터를 검색하여 제공할 것을 요청받으면 DB(120a)를 검색해 관련 데이터를 제공할 수 있다. 예를 들어, 제1 단말장치에서 예약을 진행하는 경우, 해당 요청에 따라, DB(120a)에 저장되어 있는 관련 데이터를 검색해 제공하는 것이다. 다시 말해, 차주가 발렛서비스를 신청하려는 지역이 도 3의 명동역 근처라면 해당 부분의 지도정보와 함께 발렛 존 정보 및 주차장 정보를 DB(120a)에서 검색해 제공하는 것이다. 이외에도 제어부는 다양한 동작을 수행할 수 있으며, 이와 관련한 자세한 내용은 앞서 발렛서비스장치 를 설명하면서 충분히 설명하였으므로 그 내용들로 대신하고자 한다.다만, 도 4의 제어부는 본 발명의 다른 실시예로서 CPU와 메모리를 포함할 수 있으며, 원칩화(One-chip)하 여 형성할 수도 있다. 여기서, CPU는 제어회로, 연산부(ALU), 명령어해석부, 레지스트리 등을 포함하며, 메모리 는 램(RAM)을 포함할 수 있다. 제어회로는 제어동작을, 연산부는 2진 비트의 연산동작을, 명령어해석부는 고급 언어를 제어회로가 인식가능한 기계어로 변환하는 컴파일러 등의 프로그램을 포함할 수 있으며, 레지스트리는 소프트웨어적인 데이터 저장에 관여한다. CPU는 발레서비스장치의 동작 초기에 발렛서비스처리부에 저장되어 있는 프로그램을 복사하여 메모리에 로딩한 후 이를 실행시킴으로써 데이터 처리 속도를 빠르게 증가 시킬 수 있게 된다. 한편, 발렛서비스처리부는 본 발명의 실시예에 따른 지역단위별 발렛서비스를 처리한다. 발렛서비스처리부 는 차주가 지정 장소에 도착하여 발렛서비스를 신청하는 차주의 종착지 즉 차량을 회수하려는 장소에 대한 정보, 또 해당 지역에서 머무르는 시간 정보 등의 정보를 제공하게 되면, 이와 함께 해당 종착지의 주차장 정보 를 더 확인하여 최적의 발렛 정보를 제공한다. 물론 여기서의 발렛정보는 차량이 이동하여 주차되어 있는 주차 장 정보를 포함한다. 즉 발렛서비스처리부는 차주의 차량의 회수 장소에 대한 주차장을 할당할 때, 차주가 해당 지역에 머무르는 시간과 해당 장소의 주차장들에 대한 유휴 상태를 확인하여 배정하는 것이다. 또한, 발렛서비스처리부는 차주의 동의가 있는 경우, 위치를 추적하여 해당 지나는 곳에 대한 맛집 정보와 같은 다양한 부가정보를 제공한다. 물론 관광지라면, 관광정보를 자막이나 음성 등의 형태로 제공할 수도 있다. 또한, 위치를 추적하면서 시간을 확인하여 도착하는 시간에 시간 변경이 발생할 거라 판단될 때에는 물론 이는 차주가 별도로 통지하여 알 수도 있겠지만, 이와 같이 시간이 앞당겨질 것으로 예상되는 경우에는 이의 상황을 차주에게 물어 확인한 후, 현재 배차된 곳의 차량을 좀더 가까운 곳으로 이동시키고, 이를 통지해 줄 수도 있다. 나아가, 발렛서비스처리부는 차주로부터 현재 위치에서 차량이 주차되어 있는 곳으로의 픽업 요청이 있는 경우, 발렛요원의 픽업 차량으로 이를 통지할 수 있다. 물론 발렛요원의 픽업 차량의 내비게이션과 같은 장치로 통지할 수 있지만, 제2 단말장치로 통지하는 것이 바람직하며, 이는 시스템 설계자의 의도에 따라 다양하 게 처리될 수 있다. 다시 말해, 픽업 차량을 운행하는 발렛요원이 어떻게 설정하는지에 따라 다르게 서비스가 이루어질 수 있을 것이다. 이외에도 발렛서비스처리부는 발렛 서비스와 그 부가 서비스(예: 세차, 정비, 픽업 등)에 대한 금액 정산 을 수행할 수 있다. 예를 들어, 발렛존이나 해당 주차장에 설치되어 있는 요금 정산기(예: 키오스크 등)를 통해 요금을 정산하며, 이의 과정에서 지역의 주차할인권 등을 제시하거나 할 때, 할인을 통해 요금을 정산한다. 정 산을 요청할 때, 픽업이 있는 경우 픽업 등의 부가서비스에 대한 요금을 합산하여 제시하며, 해당 금액을 기준 으로 할인을 진행하여 정산을 요청할 수 있을 것이다. 본 발명의 실시예에서는 별도의 키오스크 장치나 또는 발 렛요원이 상주하고 있다가 무선단말기를 통해 결제를 진행할 수 있지만, 기존 주차장의 요금 정산기와 연동하여 요금 정산을 수행하고, 해당 주차장의 운영자와 수익을 배분하는 것도 얼마든지 가능하므로, 어느 하나의 방식 에 특별히 한정하지는 않을 것이다. 저장부는 제어부의 제어하에 다양한 정보나 데이터를 저장할 수 있다. 영구적인 데이터는 도 1의 DB(120a)에 저장될 수 있지만, 발렛서비스장치에서 처리하는 임시적인 데이터가 저장될 수 있을 것이다. 도 5는 본 발명의 실시예에 따른 발렛서비스 과정을 예시하여 나타낸 도면이며, 도 6은 도 5의 특정 발렛존과 인근 지역을 예시한 도면이다. 도 5에 도시된 바와 같이, 본 발명의 실시예에 따른 제1 단말장치 또는 도 2의 별도의 예약 단말장치 는 도 1의 발렛서비스장치에 접속하여 회원 가입을 진행할 수 있다(S500). 물론 회원 가입시에 자신의 차 량에 대한 차량 정보를 제공할 수 있다. 이외에도, 결제수단이나 주(요)행선지(단골), 그리고 보유차종이나 기 타 개인정보를 더 제공할 수도 있을 것이다. 이후, 제1 단말장치는 발렛 서비스를 이용하고자 하는 경우, 서비스에 접속하여 예약 신청을 한다(S610). 물론 본 발명의 실시예에서는 현장에 도착하여 바로 발렛 서비스를 신청하는 것도 얼마든지 가능하다. 온라인상 으로 예약을 진행하는 과정에서 차량의 도착지와, 또 차량을 회수하여 출발하려는 출발지에 대한 정보를 함께 입력하거나, 픽업이나 셔틀 이용 여부, 또 부가 서비스(예: 세차, 차량정비, 렌탈, 대리운전 등)를 이용할 것인 지에 대한 부가정보를 더 제공할 수 있다. 또한 결제를 선택할 수도 있다. 예약 과정에서, 차주는 직접 주차장 을 방문할지, 발렛존 또는 자신의 위치에서 픽업을 요청할지를 선택할 수 있을 것이다. 물론 예약이 아닌 경우 에도 마찬가지로 동일한 지정이 가능할 수 있다.차주는 가령 예약 신청에 따라, 안내되는 주차정보를 근거로 차량을 도착지의 특정 주차장 1에 바로 입고 시킬 수도 있지만, 도착 지역의 발렛존에 도착하여 발렛요원의 도움으로 주차를 수행할 수 있다(S620, S630). 차량의 확인이나 인수인계를 진행할 수 있다. 또한, 대리운전 등의 부가서비스를 진행할 수 있으며, 결 제 수단을 선택하여 선 결제를 진행할 수도 있다. 이와 같이, 차주는 차량을 발렛존에 입고시킨 후, 해당 지역에서 관광 등을 수행할 수 있으며, 이의 과정 에서 자신의 차량이 특정 주차장에 입고가 완료되면 이에 대한 정보를 제공받을 수 있다. 가령, 관광을 진행하는 과정에서 렌탈을 신청한 경우에는 렌탈업체를 방문하여 자신이 신청한 차량을 렌트할 수 있다. 또한, 차주는 가령 셔틀 서비스의 이용을 신청한 경우, 셔틀차량을 통해 해당 지역에서 업무를 보고, 셔틀 차량을 통해 자신의 차량이 주차되어 있는 가령 주차장 2로 바로 이동이 가능할 수 있다. 셔틀차량 을 이용하는 과정에서 차주 즉 고객들은 내비게이션이나 별도의 모니터 화면을 통해 해당 지역의 광 고(621a)를 접하거나 해당 지역의 다양한 상업정보를 볼 수 있을 것이다. 만약, 차주가 해당 지역을 둘러보는 과정에서 현재 위치에서 자신의 차량이 있는 곳으로 픽업을 요청할 수 있으 며, 이의 경우 발렛요원은 픽업차량을 통해 고객을 픽업하여 해당 장소로 안내할 수도 있다. 한편, 발렛요원은 고객의 부가서비스 요청에 따라 차량을 이동시켜 서비스센터에 방문하여 차량을 세차하 거나 정비하는 등의 동작을 수행할 수 있다. 이외에도 고객은 조식 서비스(bread event) 신청이 있는 경우 이를 이용할 수 있다. 도 6에서 볼 때, 발렛존은 고객이 요청한 이동지의 발렛존을 의미할 수 있다. 발렛요원은 인근의 서 비스센터에서 주유를 하거나, 세차를 진행하는 등 다양한 부가서비스를 진행할 수 있을 것이다. 해당 지역에서의 일정이 완료되면 차주는 출고 요청을 진행하고, 대기할 수 있다. 도 6에서와 같이, 출발지의 특정 발렛존의 인근에는 대기장소가 있을 수 있고, 발렛요원은 인근 지역의 주차장 1이나 주차 장에 주차되어 있는 고객의 차량을 출고하여 대기장소로 이동시켜 차량을 고객에게 인계할 수 있을 것이다. 즉 차량의 출고를 위해 차주는 출고를 요청하고, 출차 지역 변경 등이 있었는지 확인이 이루어질 수 있다. 부가 서비스 할인이나 서비스 이용에 따른 정산을 진행할 수 있다. 이의 과정에서 차량 할인 등을 진행할 수도 있을 것이다. 발렛존 내의 접수 센터에서 정산을 수행할 수 있을 것이다. 상기의 시스템은 지역단위별로 수행되는 만큼, 앞선 도 1이나 도 2에서와 같이, 발렛서비스장치와 같은 서 버를 통해 서비스가 이루어지는 것도 가능하겠지만, 사물인터넷(IoT) 기반으로 이루어지는 것도 얼마든지 가능 할 수 있다. 본 발명의 실시예에서는 특정 지역의 상권에서 지속적으로 모니터링을 수행하고, 이를 통해 빅데이터를 확보하 여 확보한 빅데이터를 활용함으로써 유용한 정보를 더 산출할 수 있게 된다. 예를 들어, 1년 중 어느 시기나 어 느 분기에 교통 체증이 많이 유발되어 주차 배정시 이를 고려해야 한다는지, 또는 해당 지역에 현재 공사가 진 행 중이므로 이를 고려해야 한다든지, 데이터를 끝없이 수집하고, 또 이를 인공지능(AI) 등의 프로그램을 통해 딥러닝을 수행함으로써 예측 가능한 정보를 더 추가로 생성할 수 있을 것이다. 가령, 교통체증이 발생되는 시간 대를 예측하거나 하는 등의 동작을 수행할 수 있는 것이다. 도 7은 도 1의 발렛서비스장치의 구동과정을 나타내는 흐름도이다. 설명의 편의상 도 7을 도 1과 함께 참조하면, 본 발명의 실시예에 따른 발렛서비스장치는 차량의 도착지인 제1 장소에서 주차대행 서비스를 이용하여 차량을 회수해 출발하는 원거리의 제2 장소에 대한 위치정보를 저장 부에 저장한다(S700). 제2 장소에 대한 위치정보는 온라인상에서 예약을 통해 이루어질 수 있지만, 해당 장소에 바로 도착하여 제공될 수도 있다. 또한, 발렛서비스장치는 저장한 위치정보에 근거하여 제2 장소로 차량이 이동되었을 때 차량의 차주가 소 지하는 제1 단말장치로 차량의 이동 사실을 통지한다(S710). 물론 이의 과정에서 제2 단말장치로부터 차량이 이동되었다는 정보를 수신함에 따라 관련 사실을 통지할 수 있게 된다. 물론 위치추적을 통해, 다시 말해, 발렛요원이 배정되면 해당 발렛요원의 스마트폰 등을 통해 위치추적을 수행 하여 자동으로 인식하는 것도 얼마든지 가능할 수 있으므로 본 발명의 실시예에서는 위의 내용에 특별히 한정하지는 않을 것이다. 상기한 내용 이외에도 발렛서비스장치는 다양한 동작을 수행할 수 있으며, 이와 관련해서는 앞서 충분히 설명하였으므로 그 내용들로 대신하고자 한다. 한편, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합하거나 결합하여 동작하는 것으로 설명되었 다고 해서, 본 발명이 반드시 이러한 실시 예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각 각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프 로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 비일 시적 저장매체(non-transitory computer readable media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시 예를 구현할 수 있다. 여기서 비일시적 판독 가능 기록매체란, 레지스터, 캐시(cache), 메모리 등과 같이 짧은 순간 동안 데이터를 저 장하는 매체가 아니라, 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로, 상술한 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리 카드, ROM 등과 같은 비일시적 판독가능 기록매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2019-0042780", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통 상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2019-0042780", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 제1 실시예에 따른 발렛서비스시스템을 나타내는 도면, 도 2는 본 발명의 제2 실시예에 따른 발렛서비스시스템을 도식화하여 나타낸 도면, 도 3은 발렛 서비스를 제공하는 지역 단위의 발렛존과 주차장을 보여주기 위한 도면, 도 4는 도 1의 발렛서비스장치의 세부구조를 예시한 블록다이어그램, 도 5는 본 발명의 실시예에 따른 발렛서비스 과정을 예시하여 나타낸 도면, 도 6은 도 5의 특정 발렛존과 인근 지역을 예시한 도면, 도 7은 도 1의 발렛서비스장치의 구동과정을 나타내는 흐름도이다."}
