{"patent_id": "10-2019-0135834", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0051055", "출원번호": "10-2019-0135834", "발명의 명칭": "뇌파 신호를 이용한 이미지 생성 장치 및 방법", "출원인": "현대자동차주식회사", "발명자": "강정수"}}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동안 복수의 채널에서 수집하는 센싱부;및인공지능 모델을 이용하여 상기 복수의 채널에서 수집된 뇌파 신호로부터 제1 이미지를 생성하고, 상기 생성된제1 이미지에 기초하여 소정의 리스트에 포함된 적어도 하나의 제2 이미지를 선택하고, 상기 선택된 제2 이미지에 대한 응답으로서, 상기 모빌리티를 제어하는 제어부를 포함하는 뇌파 신호를 이용한 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 복수의 채널에서 수집된 뇌파 신호는, 시간 도메인, 주파수 도메인 또는 공간 도메인 중 적어도 하나에서의 뇌파 신호인 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 인공지능 모델은, 생성적 적대 신경망(Generative Adversarial Networks, GAN) 모델인 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 이미지는, 서비스 포인트를 나타내는 서비스 포인트 이미지 및 아이템 이미지 중 적어도 하나이고,상기 서비스 포인트 이미지는 서비스 포인트를 나타내는 이미지이고, 상기 아이템 이미지는 상기 서비스 포인트에서 제공하는 아이템을 나타내는 이미지인 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 소정의 리스트는, 적어도 하나 이상의 서비스 포인트 이미지로 구성되거나 또는 적어도 하나 이상의 아이템 이미지로 구성되는 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 서비스 포인트는, 상기 모빌리티를 기준으로 소정의 범위 내에 있는 DT(Drive Through) 서비스 제공 장소인 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 모빌리티와 상기 서비스 포인트간 근거리 통신망에 기초하여 송수신하는 경우, 상기 소정의 범위는 상기근거리 통신망으로 송수신될 수 있는 범위인 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서,공개특허 10-2021-0051055-3-상기 아이템은, 상기 서비스 포인트에서 제공하는 물품, 상기 서비스 포인트에서 제공하는 서비스 및 상기 서비스 포인트에 관한 정보 중 적어도 하나인 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 제어부는, 상기 제1 이미지와 상기 소정의 리스트에 포함된 이미지간의 유사도 판단에 기초하여 상기 제2이미지를 선택하는 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제4항에 있어서,상기 제2 이미지가 서비스 포인트 이미지인 경우, 상기 제어부는, 상기 서비스 포인트로 상기 모빌리티의 주행경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것 및 상기 변경될 주행경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 중 적어도 하나를 수행하는 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제4항에 있어서,상기 제2 이미지가 아이템 이미지인 경우, 상기 제어부는, 상기 아이템을 제공하는 서비스 포인트로 상기 모빌리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것, 상기 변경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 및 상기 아이템에대한 주문 신호를 전송하는 것 중 적어도 하나를 수행하는 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 제어부는, 상기 선택된 제2 이미지가 상기 탑승자의 의도에 부합되는지 여부를 확인하는 과정을 더 포함하는 것을 특징으로 하는 이미지 생성 장치."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동안 복수의 채널에서 수집하는 단계;인공지능 모델을 이용하여 상기 복수의 채널에서 수집된 뇌파 신호로부터 제1 이미지를 생성하고 단계;상기 생성된 제1 이미지에 기초하여 소정의 리스트에 포함된 적어도 하나의 제2 이미지를 선택하는 단계; 및상기 선택된 제2 이미지에 대한 응답으로서, 상기 모빌리티를 제어하는 단계를 포함하는 뇌파 신호를 이용한 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 복수의 채널에서 수집된 뇌파 신호는, 시간 도메인, 주파수 도메인 또는 공간 도메인 중 적어도 하나에서의 뇌파 신호인 것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 인공지능 모델은, 생성적 적대 신경망(Generative Adversarial Networks, GAN) 모델인 것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,공개특허 10-2021-0051055-4-상기 제1 이미지는, 서비스 포인트를 나타내는 서비스 포인트 이미지 및 아이템 이미지 중 적어도 하나이고,상기 서비스 포인트 이미지는 서비스 포인트를 나타내는 이미지이고, 상기 아이템 이미지는 상기 서비스 포인트에서 제공하는 아이템을 나타내는 이미지인 것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 소정의 리스트는, 적어도 하나 이상의 서비스 포인트 이미지로 구성되거나 또는 적어도 하나 이상의 아이템 이미지로 구성되는 것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 서비스 포인트는, 상기 모빌리티를 기준으로 소정의 범위 내에 있는 DT(Drive Through) 서비스 제공 장소인 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 모빌리티와 상기 서비스 포인트간 근거리 통신망에 기초하여 송수신하는 경우, 상기 소정의 범위는 상기근거리 통신망으로 송수신될 수 있는 범위인 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 아이템은, 상기 서비스 포인트에서 제공하는 물품, 상기 서비스 포인트에서 제공하는 서비스 및 상기 서비스 포인트에 관한 정보 중 적어도 하나인 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제13항에 있어서,상기 적어도 하나의 제2 이미지를 선택하는 단계는, 상기 제1 이미지와 상기 소정의 리스트에 포함된 이미지간의 유사도 판단에 기초하여 상기 제2 이미지를 선택하는 것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제16항에 있어서,상기 제2 이미지가 서비스 포인트 이미지인 경우, 상기 모빌리티를 제어하는 단계는, 상기 서비스 포인트로 상기 모빌리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것및 상기 변경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 중 적어도 하나를 수행하는 것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제16항에 있어서,상기 제2 이미지가 아이템 이미지인 경우, 상기 모빌리티를 제어하는 단계는, 상기 아이템을 제공하는 서비스포인트로 상기 모빌리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것, 상기 변경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것및 상기 아이템에 대한 주문 신호를 전송하는 것 중 적어도 하나를 수행하는 것을 특징으로 하는 이미지 생성방법."}
{"patent_id": "10-2019-0135834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제13항에 있어서,공개특허 10-2021-0051055-5-상기 방법은, 상기 선택된 제2 이미지가 상기 탑승자의 의도에 부합되는지 여부를 확인하는 단계를 더 포함하는것을 특징으로 하는 이미지 생성 방법."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "뇌파 신호를 이용한 이미지 생성 장치 및 방법이 제공된다. 본 개시의 이미지 생성 방법은 모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동안 복수의 채널에서 수집하는 단계, 인공지능 모델을 이용하 여 상기 복수의 채널에서 수집된 뇌파 신호로부터 제1 이미지를 생성하고 단계, 상기 생성된 제1 이미지에 기초 하여 소정의 리스트에 포함된 적어도 하나의 제2 이미지를 선택하는 단계 및 상기 선택된 제2 이미지에 대한 응 답으로서, 상기 모빌리티를 제어하는 단계를 포함한다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 탑승자의 뇌파 신호에 기초하여 이미지를 생성하는 장치 및 방법에 관한 것이다. 구체적으로, 인공지 능 모델을 이용하여 탑승자의 뇌파 신호로부터 이미지를 생성하고, 상기 생성된 이미지에 기초하여 모빌리티를 제어하는 방법 및 장치에 대한 관한 것이다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량은 운송수단의 하나로서 현대인이 삶을 영위하는데 있어 매우 중요한 수단이자 도구이다. 나아가 어떤 누구 에게는 차량은 그 자체로서 어떤 의미가 부여될 수 있는 특별한 존재로 간주될 수도 있다. 기술이 발전함에 따라 차량이 제공할 수 있는 기능도 점차 진화하고 있다. 예를 들어, 최근의 차량은 단순히 탑 승자를 목적지까지 이동시켜주는 것에 그치지 않고, 탑승자의 니즈를 고려하여 보다 더 편안하고 안전하고 빠르 게 목적지까지 이동시켜줄 수 있도록 개발되고 있다. 또한, 탑승자의 심미감, 편안함 등을 충족시켜주기 위한 새로운 장치가 차량 시스템에 추가되고 있다. 또한, 핸들, 변속기, 가속/감속 장치 등과 같은 기존의 장치들도 조작을 통해 더 많은 기능을 사용자에게 제공할 수 있도록 개발되고 있다. 이에 따라, 최근 탑승자의 의도나 심 리상태를 이해하고 이를 반영하여 차량을 제어하는 연구가 시도되고 있다. 한편, 뇌-컴퓨터 인터페이스 또는 뇌-기계 인터페이스는 뇌파 신호를 이용하여 사람의 의도에 따라 컴퓨터 또는 기계를 제어하는 분야로서, 주로 인지 기능과 밀접한 관련이 있는 사건유발전위(ERP, Event-Related Potentia l)가 상기 연구를 수행하는데 이용되고 있다. 또한, 최근 인공지능 모델을 이용하여 영상에 포함되어 있는 객체를 인식, 분류하거나 새로운 이미지들을 생성 하는 연구가 늘어나고 있는 추세이다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 탑승자의 뇌파 신호에 기초하여 이미지를 생성하는 장치 및 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 인공지능 모델을 이용하여 탑승자의 뇌파 신호로부터 이미지를 생성하고, 상기 생성된 이미지 에 기초하여 모빌리티를 제어하는 장치 및 방법을 제공하는 것을 목적으로 한다. 본 개시에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은"}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따르면, 모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동안 복수의 채널에 서 수집하는 센싱부; 및 인공지능 모델을 이용하여 상기 복수의 채널에서 수집된 뇌파 신호로부터 제1 이미지를 생성하고, 상기 생성된 제1 이미지에 기초하여 소정의 리스트에 포함된 적어도 하나의 제2 이미지를 선택하고, 상기 선택된 제2 이미지에 대한 응답으로서, 상기 모빌리티를 제어하는 제어부를 포함하는 뇌파 신호를 이용한 이미지 생성 장치가 제공될 수 있다. 상기 복수의 채널에서 수집된 뇌파 신호는, 시간 도메인, 주파수 도메인 또는 공간 도메인 중 적어도 하나에서 의 뇌파 신호인 것을 특징으로 할 수 있다. 상기 인공지능 모델은, 생성적 적대 신경망(Generative Adversarial Networks, GAN) 모델인 것을 특징으로 할 수 있다. 상기 제1 이미지는, 서비스 포인트를 나타내는 서비스 포인트 이미지 및 아이템 이미지 중 적어도 하나이고, 상 기 서비스 포인트 이미지는 서비스 포인트를 나타내는 이미지이고, 상기 아이템 이미지는 상기 서비스 포인트에서 제공하는 아이템을 나타내는 이미지인 것을 특징으로 할 수 있다. 상기 소정의 리스트는, 적어도 하나 이상의 서비스 포인트 이미지로 구성되거나 또는 적어도 하나 이상의 아이 템 이미지로 구성되는 것을 특징으로 할 수 있다. 상기 서비스 포인트는, 상기 모빌리티를 기준으로 소정의 범위 내에 있는 DT(Drive Through) 서비스 제공 장소 인 것을 특징으로 할 수 있다. 상기 모빌리티와 상기 서비스 포인트간 근거리 통신망에 기초하여 송수신하는 경우, 상기 소정의 범위는 상기 근거리 통신망으로 송수신될 수 있는 범위인 것을 특징으로 할 수 있다. 상기 아이템은, 상기 서비스 포인트에서 제공하는 물품, 상기 서비스 포인트에서 제공하는 서비스 및 상기 서비 스 포인트에 관한 정보 중 적어도 하나인 것을 특징으로 할 수 있다. 상기 제어부는, 상기 제1 이미지와 상기 소정의 리스트에 포함된 이미지간의 유사도 판단에 기초하여 상기 제2 이미지를 선택하는 것을 특징으로 할 수 있다. 상기 제2 이미지가 서비스 포인트 이미지인 경우, 상기 제어부는, 상기 서비스 포인트로 상기 모빌리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것 및 상기 변경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 중 적어도 하나를 수행하는 것 을 특징으로 할 수 있다. 상기 제2 이미지가 아이템 이미지인 경우, 상기 제어부는, 상기 아이템을 제공하는 서비스 포인트로 상기 모빌 리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것, 상기 변 경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 및 상기 아이템에 대한 주문 신호를 전송하는 것 중 적어도 하나를 수행하는 것을 특징으로 할 수 있다. 상기 제어부는, 상기 선택된 제2 이미지가 상기 탑승자의 의도에 부합되는지 여부를 확인하는 과정을 더 포함하 는 것을 특징으로 할 수 있다. 또한, 본 발명에 따르면, 모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동안 복수의 채널에서 수집하는 단계; 인공지능 모델을 이용하여 상기 복수의 채널에서 수집된 뇌파 신호로부터 제1 이미지 를 생성하고 단계; 상기 생성된 제1 이미지에 기초하여 소정의 리스트에 포함된 적어도 하나의 제2 이미지를 선 택하는 단계; 및 상기 선택된 제2 이미지에 대한 응답으로서, 상기 모빌리티를 제어하는 단계를 포함하는 뇌파 신호를 이용한 이미지 생성 방법이 제공될 수 있다. 상기 복수의 채널에서 수집된 뇌파 신호는, 시간 도메인, 주파수 도메인 또는 공간 도메인 중 적어도 하나에서 의 뇌파 신호인 것을 특징으로 할 수 있다. 상기 인공지능 모델은, 생성적 적대 신경망(Generative Adversarial Networks, GAN) 모델인 것을 특징으로 할 수 있다. 상기 제1 이미지는, 서비스 포인트를 나타내는 서비스 포인트 이미지 및 아이템 이미지 중 적어도 하나이고, 상 기 서비스 포인트 이미지는 서비스 포인트를 나타내는 이미지이고, 상기 아이템 이미지는 상기 서비스 포인트에 서 제공하는 아이템을 나타내는 이미지인 것을 특징으로 할 수 있다. 상기 소정의 리스트는, 적어도 하나 이상의 서비스 포인트 이미지로 구성되거나 또는 적어도 하나 이상의 아이 템 이미지로 구성되는 것을 특징으로 할 수 있다. 상기 서비스 포인트는, 상기 모빌리티를 기준으로 소정의 범위 내에 있는 DT(Drive Through) 서비스 제공 장소 인 것을 특징으로 할 수 있다. 상기 모빌리티와 상기 서비스 포인트간 근거리 통신망에 기초하여 송수신하는 경우, 상기 소정의 범위는 상기 근거리 통신망으로 송수신될 수 있는 범위인 것을 특징으로 할 수 있다. 상기 아이템은, 상기 서비스 포인트에서 제공하는 물품, 상기 서비스 포인트에서 제공하는 서비스 및 상기 서비 스 포인트에 관한 정보 중 적어도 하나인 것을 특징으로 할 수 있다. 상기 적어도 하나의 제2 이미지를 선택하는 단계는, 상기 제1 이미지와 상기 소정의 리스트에 포함된 이미지간 의 유사도 판단에 기초하여 상기 제2 이미지를 선택하는 것을 특징으로 할 수 있다.상기 제2 이미지가 서비스 포인트 이미지인 경우, 상기 모빌리티를 제어하는 단계는, 상기 서비스 포인트로 상 기 모빌리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제공하는 것 및 상기 변경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 중 적어 도 하나를 수행하는 것을 특징으로 할 수 있다. 상기 제2 이미지가 아이템 이미지인 경우, 상기 모빌리티를 제어하는 단계는, 상기 아이템을 제공하는 서비스 포인트로 상기 모빌리티의 주행 경로를 변경하는 것, 변경될 주행 경로에 대한 안내 멘트를 상기 탑승자에게 제 공하는 것, 상기 변경될 주행 경로를 상기 탑승자에게 제공하여 상기 탑승자로부터의 경로 선택을 유도하는 것 및 상기 아이템에 대한 주문 신호를 전송하는 것 중 적어도 하나를 수행하는 것을 특징으로 할 수 있다. 상기 방법은, 상기 선택된 제2 이미지가 상기 탑승자의 의도에 부합되는지 여부를 확인하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "본 개시에 대하여 위에서 간략하게 요약된 특징들은 후술하는 본 개시의 상세한 설명의 예시적인 양상일 뿐이며, 본 개시의 범위를 제한하는 것은 아니다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 탑승자의 뇌파 신호에 기초하여 이미지를 생성하는 장치 및 방법이 제공될 수 있다. 또한, 본 발명에 따르면, 인공지능 모델을 이용하여 탑승자의 뇌파 신호로부터 이미지를 생성하고, 상기 생성된 이미지에 기초하여 모빌리티를 제어하는 장치 및 방법이 제공될 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 개시가 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0135834", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참고로 하여 본 개시의 실시예에 대하여 본 개시가 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나, 본 개시는 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 본 개시의 실시예를 설명함에 있어서 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그에 대한 상세한 설명은 생략한다. 그리고, 도면에서 본 개시에 대한 설명과 관계없 는 부분은 생략하였으며, 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 개시에 있어서, 어떤 구성요소가 다른 구성요소와 \"연결\", \"결합\" 또는 \"접속\"되어 있다고 할 때, 이는 직접 적인 연결관계뿐만 아니라, 그 중간에 또 다른 구성요소가 존재하는 간접적인 연결관계도 포함할 수 있다. 또한 어떤 구성요소가 다른 구성요소를 \"포함한다\" 또는 \"가진다\"고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 배제하는 것이 아니라 또 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 개시에 있어서, 제1, 제2 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용되 며, 특별히 언급되지 않는 한 구성요소들간의 순서 또는 중요도 등을 한정하지 않는다. 따라서, 본 개시의 범위 내에서 일 실시예에서의 제1 구성요소는 다른 실시예에서 제2 구성요소라고 칭할 수도 있고, 마찬가지로 일 실 시예에서의 제2 구성요소를 다른 실시예에서 제1 구성요소라고 칭할 수도 있다. 본 개시에 있어서, 서로 구별되는 구성요소들은 각각의 특징을 명확하게 설명하기 위함이며, 구성요소들이 반드 시 분리되는 것을 의미하지는 않는다. 즉, 복수의 구성요소가 통합되어 하나의 하드웨어 또는 소프트웨어 단위 로 이루어질 수도 있고, 하나의 구성요소가 분산되어 복수의 하드웨어 또는 소프트웨어 단위로 이루어질 수도 있다. 따라서, 별도로 언급하지 않더라도 이와 같이 통합된 또는 분산된 실시예도 본 개시의 범위에 포함된다. 본 개시에 있어서, 다양한 실시예에서 설명하는 구성요소들이 반드시 필수적인 구성요소들은 의미하는 것은 아 니며, 일부는 선택적인 구성요소일 수 있다. 따라서, 일 실시예에서 설명하는 구성요소들의 부분집합으로 구성 되는 실시예도 본 개시의 범위에 포함된다. 또한, 다양한 실시예에서 설명하는 구성요소들에 추가적으로 다른 구성요소를 포함하는 실시예도 본 개시의 범위에 포함된다. 이하, 첨부한 도면을 참조하여 본 개시의 실시예들에 대해서 설명한다. 뇌파 신호(또는 뇌 신호, brain wave)는 두뇌를 구성하는 신경세포들의 전기적 활동으로서, 인간의 의식 또는 무의식의 상태를 직간접으로 반영하는 생체 신호를 의미한다. 인간의 두피 모든 영역에서 측정될 수 있으며, 주 로 30Hz 이하의 주파수로 수십 마이크로 볼트의 전위차를 가진 파장으로서, 뇌 활동 상태에 따라 다양한 파형이 나타날 수 있다. 뇌파 신호를 이용하여 사람의 의도에 따른 인터페이스 제어에 관한 연구가 시도되고 있다. 뇌 파 신호는 뇌의 활동에 의한 전기적 신호를 이용하는 뇌전도(EEG, Electro Encephalo Graphy), 전기적 신호와 함께 유발되는 자기적 신호를 이용하는 뇌자도(MEG, Magneto encephalo graphy), 혈중 산소포화도의 변화를 이 용하는 기능적 자기공명영상(fMRI, functional Magnetic Resonance Imaging) 또는 기능적 근적외선 분광법 (fNIRS, Near-Infrared Spectroscopy) 등의 방식을 이용하여 획득될 수 있다. fMRI 또는 fNIRS는 뇌의 활동을 측정하는데 유용한 기술이나, 일반적으로, fMRI는 시간 해상도(time-resolution)가 떨어지며, fNIRS는 공간 해 상도(spatial-resolution)가 떨어지는 한계가 있으며, 휴대성이나 시간 분해 능력이 뛰어난 EEG 신호가 많이 이 용되고 있다. 뇌파 신호는 뇌의 활동에 따라 시공간적으로 변화하게 되며, 일반적으로 뇌파 신호를 해석하기가 어렵고 그 파 형을 시각적으로 분석하기가 용이하지 않기 때문에 이를 처리하기 위한 다양한 방법들이 제시되고 있다. 일 예로, 뇌파 신호의 진동수(주파수)에 따라 주파수 대역별로 뇌파 신호를 분류할 수 있다(파워 스펙트럼 분류). 상기 분류는 측정되는 뇌파 신호를 특정한 주파수별 단순 신호들의 선형적 합으로 간주하여, 각각의 주 파수 성분별로 분해하고 그 크기를 표시한 것이다. 주파수별 뇌파 신호는 일반적으로 잡음을 제거하기 위한 전 처리(pre-processing), 주파수 영역으로의 변환을 위한 푸리에 변환 및 대역필터(BPF) 등을 이용하여 획득할 수 있다. 구체적으로, 주파수 대역에 따라 델타(delta)파, 세타(theta)파, 알파(alpha)파, 베타(beta)파, 감마(gamma)파 로 분류될 수 있다. 델타파는 일반적으로 3.5Hz 이하의 주파수를 가진 뇌파로서, 20~200μV의 진폭을 보이며 정 상인의 깊은 수면 상태나 신생아들에게서 주로 나타난다. 또한, 각성이 떨어질수록 증가할 수 있다. 세타파는 일반적으로 3.5 ~ 7Hz의 주파수를 가진 뇌파로서, 정서적으로 안정된 상태나 수면 상태에서 주로 나타난다. 또 한, 주로 두정엽과 후두엽에서 주로 발생되며, 기억을 회상하거나 명상 등의 조용한 집중 상태에서 나타날 수 있다. 알파파는 일반적으로 8 ~ 12Hz의 주파수를 가진 뇌파로서, 긴장이 이완된 편안한 상태에서 주로 나타난다. 또한, 휴식 상태의 후두엽에서 주로 발생되며 수면 상태에서는 약해질 수 있다. 베타파는 일반적으로 13 ~ 30Hz의 주파수를 가진 뇌파로서, 약간의 긴장상태나 일정 이상의 주의를 기울일 때 주로 나타난다. 또한, 주로 전두엽에서 발생되고, 각성 상태나 집중적 뇌 활동과 연관되며, 병리적 현상 및 약물 효과와 관련이 있으 며, 뇌 전체에서 광범위하게 나타날 수 있다. 또한, 보다 세분하여, 상기 베타파는 13 ~ 15Hz의 주파수를 가진 SMR파, 15 ~ 18Hz의 주파수를 가진 중간 베타파, 20Hz 이상의 고 베타파로 구분될 수 있으며, 베타파는 불안, 긴장 등의 스트레스를 받을 때 더욱 강하게 나타나기 때문에 스트레스파라고 지칭된다. 감마파는 일반적으로 30~ 50Hz의 주파수를 가진 뇌파로서, 강한 흥분 상태 또는 고도의 인지 정보 처리 과정에서 주로 나타난다. 또한, 의식적 각성 상태와 REM 수면시 나타날 수 있으며, 베타파와 중복되어 나타날 수 있다. 상기 주파수 대역별 뇌파 신호 각각은 특정 인지 기능(cognitive function)과 관련이 있으며, 예를 들어, 델타 파는 수면 기능과 관련이 있고, 세타파는 작업 기억(working memory)과 관련이 있고, 알파파는 주의 집중 (attention)이나 억제(inhibition) 기능과 관련이 있는 등 뇌파 신호의 주파수 대역별 속성은 특정 인지 기능을 선택적으로 나타낸다고 볼 수 있다. 또한, 상기 주파수 대역별 뇌파 신호는 머리 표면의 각 측정 부위마다 조금 씩 다른 양상을 나타낼 수 있다. 대뇌피질은 전두엽(Frontal Lobe), 두정엽(Parietal Lobe), 측두엽(Temporal Lobe), 후두엽(Occipital Lobe) 등으로 구분할 수 있으며, 담당 역할이 조금씩 다를 수 있다. 예를 들어, 뒤통 수에 해당하는 후두엽에는 일차 시각피질이 있기 때문에 일차적인 시각 정보 처리를 담당하며, 정수리 근처에 해당하는 두정엽에는 체성감각 피질이 있기 때문에 운동/감각관련 정보 처리를 담당할 수 있다. 또한, 전두엽은 기억력과 사고력에 관한 정보 처리를 담당할 수 있으며, 측두엽은 청각과 후각에 관한 정보 처리를 담당할 수 있다. 한편, 다른 예로, 사건유발전위(ERP, Event-Related Potential)를 이용하여 뇌파 신호를 분석할 수 있다. ERP 는 외부의 자극이나 내부의 심리적 과정과 관련하여 뇌에서 발생하는 전기적인 변화로서, 특정한 정보(예를 들 어, 영상, 음성, 소리, 수행명령 등)를 내포하고 있는 자극을 제시한 다음 일정 시간 후에 상기 자극이 유발한 뇌의 전기적 활성도가 포함된 신호를 의미한다. ERP를 분석하기 위해 잡음(noise)으로부터 신호(signal)를 분리하는 과정이 필요하며, 주로 평균화(averaging) 하는 방법을 이용할 수 있다. 구체적으로, 자극이 제시된 시간을 기준으로 측정된 뇌파들을 평균함으로써, 자극 과 무관한 뇌파 신호는 제거되고 자극 처리에 공통으로 관여한 뇌 활동인 유발전위만을 추려낼 수 있다. ERP는 높은 시간해상도를 가지고 있기 때문에 인지 기능 연구와 밀접한 관련이 있는 것으로서, 외부의 자극에 의해 유발되거나(evoked) 내부의 상태와 관련이 있는(related) 전기적인 현상이다. ERP는 자극의 종류에 따라 청각, 시각, 체감, 후각 관련 전위로 구분할 수 있으며, 자극의 성질에 따라 외인성(exogenous) ERP와 내인성 (endogenous) ERP로 구분할 수 있다. 외인성 ERP는 외부의 자극에 의하여 파(wave)의 모양이 결정되는 것으로서, 자동과정(automatic processing)과 관련이 있으며 주로 자극을 준 초기에 나타난다. 예를 들어, 외인 성 ERP에는 뇌간전위(brainstem potentials) 등이 있다. 반면, 내인성 ERP는 자극과 관계없이 내부의 인지 과정 에 의하여 심리적 과정이나 상태에 따라 결정되는 것으로서, 통제 과정(controlled processing)과 관련이 있다. 예를 들어, 내인성 ERP에는 P300, N400, P600, CNV(Contingent Negative Variation) 등이 있다. ERP 피크(peak)에 주어진 명칭은 보통 극성과 잠복기를 포함하며, 각 신호의 피크마다 개별적인 정의와 의미를 가진다. 예를 들어, 양 전위는 P, 음 전위는 N이라 하고, P300은 자극의 제시 후 300ms 전후 시점에서 측정되는 양(positive)의 피크를 의미한다. 또한, 나타나는 순서에 따라 1, 2, 3 또는 a, b, c 등을 붙이기도 하는, 예를 들어, P3는 자극 후 파형에서 세 번째 나타나는 양 전위를 의미한다. 이하에서는, 다양한 ERP에 대하여 후술한다. 일 예로, N100은 예측할 수 없는 자극에 대한 반응과 관련이 있다. MMN(Mismatch Negativity)은 주의집중이 된 자극뿐만 아니라 주의집중이 안된 자극에도 발생될 수 있으며, 초기 주의집중 전 감각기억(잔향기억(echoic memory))의 작동여부에 대한 지표로 이용될 수 있다. 후술할 P300이 주 의를 집중하고 판단하는 과정에서 나타나는 것에 비하여 MMN은 주의력을 집중하기 전 뇌에서 일어나는 과정의 일종으로 해석된다. 다른 예로, N200(또는 N2)은 주로 시각자극과 청각자극에 따라 발생하며, 후술하는 P300과 함께 주의집중 후 기 억의 형태인 단기기억(short-term memory) 또는 장기기억(long-term memory)과 관련이 있다. 또 다른 예로, P300(또는 P3)은 주로 자극에 대한 주의력, 자극 인지, 기억 탐색, 불확실감의 해소 등을 반영한 것으로서 외부에서 들어오는 자극을 구별하는 지각적 결정(perceptual decision)과 관련이 있다. P300의 발생은 인지 기능과 관련이 있기 때문에 제시되는 자극의 종류에 관계없이 발생한다. 예를 들어, 청각자극, 시각자극, 체성자극 등에서 모두 P300이 발생할 수 있다. P300는 뇌-컴퓨터 인터페이스 연구에 널리 응용되고 있다.또 다른 예로, N400은 언어처리와 관련된 것으로서, 의미론적인 오류가 있는 문장, 의미론적인 오류가 있는 청 각자극 등이 제공될 때 유발된다. 또한, N400은 기억과정과 관련이 있으며, 장기 기억으로부터 정보를 인출하거 나 탐색하는 과정을 반영할 수 있다. 또 다른 예로, P600은 재구성(reconstruction) 또는 회상 과정(recollective process)을 나타내는 지표로서, 장기 기억에 저장되어 있는 정보를 근거로 하여 자극을 더욱 정교하게 처리하는 과정과 관련이 있다. 또 다른 예로, CNV는 200 ~ 300ms부터 몇 초까지 나타나는 후반부의 전위로서 slow potentials(SPs)이라 하며, 기대(expectancy), 준비(preparation), 정신점화(mental priming), 연합과정, 주의집중, 운동기능(motor activity)과 관련이 있다. 또 다른 예로, 오류 관련 부적전위(ERN, Error-Related Negativity 또는 Ne, error negativity)는 실수나 오류 에 의해 발생되는 사건유발전위로서, 피험자가 감각운동과제나 또는 그와 유사한 과제에서 실수를 한 경우 유발 될 수 있다. 구체적으로, ERN은 피험자가 실수나 오류를 인지했을 때 약 50 ~ 150ms동안 음(negative)의 피크가 주로 전두, 중앙(frontal, central) 영역에서 발생되며, 특히 동작 반응(motor response)과 관련된 실수가 발 생될 수 있는 상황에서 나타날 수 있으며, 부정적인 자가 판단을 가리키는데 이용될 수 있다. 이하에서는, ERN의 주요 특징에 대해서 보다 상세하게 후술한다. 도 1은 본 발명의 일 실시예에 따른 ERN의 일반적인 파형을 나타내는 도면이다. 도 1을 참조하면, 가로축을 기준으로 상단에 음전위 값이 표시되어 있으며, 가로축을 기준으로 하단에 양전위 값이 표시되어 있다. 또한, 임의의 동작에 대한 반응의 발생(response onset) 이후 소정의 시간 범위 내에서 음 의 피크값을 가지는 사건유발전위가 발생됨을 확인할 수 있다. 여기서, 상기 반응은 실수나 오류가 발생된 경우 (Error Response)를 의미할 수 있다. 또한, 상기 소정의 시간 범위는 약 50 ~ 150ms를 의미할 수 있다. 또는, 상기 소정의 시간 범위는 약 0 ~ 100ms를 의미할 수 있다. 한편, 올바른 응답을 한 경우(Correct Response)에도, ERN보다는 상대적으로 작은 음의 피크를 가지는 사건유발전위가 발생됨을 알 수 있다. ERN은 초기 부적전위의 ERP로서, 응답 오류가 발생할 때까지 잠겨있다(time-locked). 또한, ERN은 행동 모니터 링과 관련된 도파민성 시스템의 강화 활동을 반영하는 것으로 알려져 있으며, 앞쪽 대상(rostral cingulate) 영 역을 포함한 전두-줄무늬체 회로(fronto-striatal loop)를 포함하고 있다. 한편, 도파민은 일반적으로 특정한 행동을 형성하여 사람으로 하여금 동기를 유발함으로써 즐거움과 재강화의 기분을 제공하는 뇌의 보상 시스템과 관련되어 있으며, 적절한 보상을 얻는 행동이 반복되면 습관으로서 학습이 된다. 또한, 감정 학습을 통해 더 많 은 도파민의 분비가 일어나게 되고 상기 도파민 분비에 따라 새로운 행동을 시도하게 된다. 이와 같이, 보상에 의해 유도된 학습을 강화 학습이라 한다. 또한, ERN은 전두엽 리드를 통해 간섭 태스크(예를 들어, Go-noG0, Stroop, Flanker, Simon 태스크 등)를 수행 하는 동안 야기된 잘못된 응답의 발생 후 0 ~ 100ms 사이에 발현될 수 있다. 또한, ERN은 후술할 CRN과 함께 올바른 행동과 잘못된 행동을 구별할 수 있는 일반적인 행동 모니터링 시스템의 활동을 반영한다고 알려져 있다. 또한, ERN이 전두엽 전극에서 최대 진폭에 도달하는 사실은 대뇌 내 생성기가 앞쪽 대상 영역 또는 등쪽 전방 대상 피질(dorsal anterior cingulate cortex, dACC)에 위치하는 것을 반영하는 것으로 알려져 있다. 또한, ERN은 부정적인 정서 상태에 따라 진폭의 변화를 보일 수 있다. 또한, ERN은 내부 동작 표현과 다르게 외부 평가 피드백 처리를 기반으로 동작 모니터링을 수행하는 상황에서도 보고될 수 있으며, 후술할 FRN으로 분류될 수 있다. 또한, ERN은 실수나 오류를 인지한 경우뿐만 아니라 상기 실수나 오류를 인지하기 전에도 발생될 수 있다. 또한, ERN은 자신의 실수나 오류에 대한 반응으로 발생될 뿐만 아니라 타인의 실수나 오류에 대해서도 그에 대 한 반응으로 발생될 수 있다. 또한, ERN은 실수나 오류에 대한 반응으로 발생될 뿐만 아니라 소정의 수행 과제 또는 대상에 대한 불안감, 스 트레스에 대한 반영으로서 발생될 수 있다.또한, 획득되는 ERN의 피크 값이 클수록, 보다 중대한 실수나 오류에 대한 반영을 의미하는 것으로 판단될 수 있다. 한편, 또 다른 예로, 오류 정적전위(Pe, Error Positivity)는 ERN에 이어 발생되는 사건유발전위로서, 실수나 오류 후 약 150 ~ 300ms 사이에 주로 전두엽 전극 부위에서 발생되는 양의 값을 갖는 사건유발전위이다. Pe는 실수나 오류를 자각하고 주위를 더 기울이는 반응으로 알려져 있으며, 즉 오류 탐지 이후의 의식적인 오류 정보 처리 과정의 지표와 관련이 있다. ERN과 Pe는 오류 모니터링과 관련되는 사건유발전위로 알려져 있다. 이하에서는, Pe의 주요 특징에 대해서 보다 상세하게 후술한다. 도 2는 본 발명의 일 실시예에 따른 ERN 및 Pe의 일반적인 파형을 나타내는 도면이다. 도 2를 참조하면, 상단에 음전위 값이 표시되어 있으며, 하단에 양전위 값이 표시되어 있다. 또한, 임의의 동작 에 대한 반응의 발생(response onset) 이후 제1 소정의 시간 범위 내에서 음의 피크값을 가지는 사건유발전위, 즉 ERN가 발생됨을 확인할 수 있다. 여기서, 상기 반응은 실수나 오류가 발생된 경우(Error Response)를 의미할 수 있다. 또한, 상기 제1 소정의 시간 범위는 약 50 ~ 150ms를 의미할 수 있다. 또는, 상기 제1 소정의 시간 범 위는 약 0 ~ 200ms를 의미할 수 있다. 또한, 상기 ERN의 발생 이후 제2 소정의 시간 범위 내에서 양의 피크값을 가지는 사건유발전위, 즉 Pe가 발생됨 을 확인할 수 있다. 여기서, 상기 제2 소정의 시간 범위는 오류 발생 이후 약 150 ~ 300ms를 의미할 수 있다. 또는, 상기 제2 소정의 시간 범위는 약 200 ~ 400ms를 의미할 수 있다. 도 3은 본 발명의 일 실시예에 따른 Pe의 편향 특성을 나타내는 도면이다. 도 3을 참조하면, Pe는 P3와 유사하게 넓은 편향 특성을 가지며, 신경총 생성기가 후대상피질 및 뇌섬엽피질 영 역뿐 아니라 더 많은 앞쪽 전방 대상 피질을 포함한다. 또한, Pe는 오류의 정서적 평가, P300과 같은 자극에 대한 집중 등을 반영할 수 있다. 또한, ERN은 맞는 반응과 틀린 반응 사이의 갈등을 나타내며, Pe는 실수를 자각하고 주의를 더 기울이는 반응이라고 알려져 있다. 즉, ERN은 자극을 탐지하는 과정에서 발생하고, Pe는 자극의 처리 과정에서 주의 여부에 따라 발생할 수 있다. ERN 및/또는 Pe의 값이 각각 상대적으로 큰 값을 갖는 경우, 이는 실수 후 더 천천히 더 정확한 반응을 하려는 적응 적인 행동과 관련이 있는 것으로 알려져 있다. 도 4는 본 발명의 일 실시예에 따른 ERP 및 Pe의 측정 영역을 나타내는 도면이다. ERN 및 Pe는 오류 모니터링과 관련되는 사건유발전위로 알려져 있으며, ERN 및 Pe의 측정 영역은 일반적으로 central 영역에서 각각 가장 큰 음의 값 및 양의 값이 측정될 수 있으나, 측정 조건에 따라 다소간의 차이가 있 을 수 있다. 일 예로, 도 4의 (a)는 ERN이 측정되는 주요 영역으로서, ERN은 일반적으로 midline frontal 또는 central 영역(즉, FCZ)에서 가장 큰 음의 값이 측정될 수 있다. 또한, 도 4의 (b)는 Pe가 측정되는 주요 영역으 로서, Pe는 일반적으로 ERN보다는 좀더 후방의(posterior) midline 영역에서 큰 양의 값이 측정될 수 있다. 한편, 또 다른 예로, 피드백관련 부적전위(FRN, Feedback-Related Negativity)는 외부 평가 피드백에 기초하여 오류 검출이 획득되는 것과 관련된 사건유발전위이다. ERN 및/또는 Pe는 내부 모니터링 프로세스에 기초하여 오 류 검출을 하지만, FRN의 경우 외부 평가 피드백에 기초하여 획득될 때 ERN의 프로세스와 유사하게 동작할 수 있다. 또한, FRN은 ERN과 많은 전기 생리학적 성질을 공유할 수 있다. 예를 들어, FRN은 부정적인 피드백 발생 후 약 250 ~ 300ms 사이에 전두엽 전극에서 음의 값의 피크를 가지며, ERN과 동일한 등쪽 전방 대상 피질 영역에서 생 성될 수 있다. 또한, FRN은 ERN과 유사하게 도파민성 시스템에 의한 강화 학습의 활동을 반영할 수 있다. 또한, FRN은 보통 양 의 피드백에 비해 음의 값이 더 크며, 예측 가능한 결과에 비해 예측하지 못한 경우에 그 값이 더 클 수 있다. 또 다른 예로, 정반응 관련 부적전위(CRN, Correct-Related Negativity)는 올바른 응답(correct trial)을 한 경우 생성되는 ERP로서, ERN보다는 상대적으로 작은 크기를 갖은 음수이며 ERN과 동일한 초기 잠복기(예를 들어, 0 ~ 100ms) 사이에 생성될 수 있다. 도 5은 본 발명의 일 실시예에 따른 ERN 및 CRN의 일반적인 파형을 나타내는 도면이다. 또 다른 예로, 정반응 정적전위(Pc, Correct Positivity)는 CRN에 이어 발생되는 사건유발전위로서, 올바른 응 답 이후 약 150 ~ 300ms 사이에 발생되는 사건유발전위이다. CRN과 Pc의 관계는 전술한 ERN과 Pe의 관계와 유사 할 수 있다. 한편, ERP는 자극 잠금(stimulus-locked) ERP와 반응 잠금(response-locked) ERP로 구분할 수 있다. 상기 자극 잠금 ERP와 반응 잠금 ERP는 사건유발전위의 유발 원인, 반응 시점 등의 기준에 따라 구분될 수 있다. 예를 들 어, 외부에서 사용자에게 글이나 그림을 제시했을 때로부터 유발되는 ERP를 자극 잠금 ERP라 할 수 있다. 또한, 예를 들어, 사용자가 말을 했을 때 또는 버튼을 눌렀을 때로부터 유발되는 ERP를 반응 잠금 ERP라 할 수 있다. 따라서, 상술한 기준에 따를 때, 일반적으로 자극 잠금 ERP에는 N100, N200, P2, P3 등이 있고, 반응 잠금 ERP 는 ERN, Pe, CRN, Pc, FRN 등이 있다. 한편, 뇌파는 발현 동기에 따라 구분할 수 있는데, 사용자의 의지에 의해 발현되는 자발적 뇌파(자발전위)와 사 용자의 의지에 관계없이 외부 자극에 따라 자연스럽게 발현되는 유발적 뇌파(유발전위)로 구분할 수 있다. 자발 적 뇌파는 사용자 스스로 움직이거나 어떤 동작을 상상했을 때 발현될 수 있으며, 유발적 뇌파는, 예를 들어 시 각, 청각, 후각, 촉각 등의 자극에 의해 발현될 수 있다. 한편, 뇌파 신호는 10-20 국제시스템(International 10-20 system)에 의거하여 측정될 수 있다. 10-20 국제시 스템은 뇌파 신호 측정점을 전극의 위치와 대뇌피질 영역의 관계에 기초하여 결정하고 있다. 도 6은 본 발명의 일 실시예에 따른 대뇌피질 영역에 대응되는 뇌파측정 채널을 나타내는 도면이다. 도 6을 참조하면, 뇌 영역별(전전두엽 FP1, FP2; 전두엽 F3, F4, F7, F8, FZ, FC3, FC4, FT7, FT8, FCZ; 두정 엽 C3, C4, CZ, CP3, CP4, CPZ, P3, P4, PZ; 측두엽 T7, T8, TP7, TP8, P7, P8; 후두엽 O1, O2, OZ)로 32개의 뇌파측정 채널에 대응되어 있다. 상기 각각의 채널에 대해 데이터를 획득하고 이를 이용하여 각 대뇌피질 영역 에 대한 분석을 수행할 수 있다. 도 7은 본 발명의 일 실시예에 따른 탑승자의 뇌파 신호에 기초하여 이미지를 생성하는 장치의 구성을 나타내는 블록도이다. 승차 구매(Drive Through, DT)는 고객이 주차를 하지 않고 모빌리티에 승차한 상태에서 소정의 상품을 주문하고 결재하고 픽업해 갈 수 있는 서비스를 의미한다. 주차의 번거로움 없이 줄을 서서 기다릴 필요도 없기 때문에 소비자에게 효율적이면서 편리한 서비스로 각광받고 있으며, 최근 DT 서비스는 점차 보편화 되고 있는 추세이다. 예컨대, 모빌리티 내의 탑승자들은 패스트푸드점, 커피숍 등에서 제공하는 DT 서비스를 도심지, 고속 도로 등 일상에서 편리하고 쉽게 이용할 수 있다. 상기 모빌리티는 차량, 이동/운송 장치 등의 의미를 포함할 수 있다. 한편, 현재의 DT 서비스는 승객이 DT 서비스를 제공하는 장소 또는 그 위치(이하 ‘DT점’ 또는 ‘DT 포인트 ’)까지 도달한 후에 필요한 물품 등을 주문하는 것이 일반적이다. 본 개시에서는 DT점에 도달하기 이전에 모빌 리티에서 상기 DT점에서 제공하는 물품(이하 ‘DT 아이템’)을 선택하고 주문할 수 있는 이미지 생성 장치 및 방법을 제공할 수 있다. 여기서, DT점은 모빌리티를 기준으로 하여 소정의 범위 내에 있는 DT 서비스 제공 장소일 수 있다. 또한, 본 개시의 DT점은 DT 서비스를 제공하는 장소뿐만 아니라, DT 서비스를 제공하지 않더라도 모빌리티에 DT 아이템을 제공하고 모빌리티에서 선택하고 주문한 아이템 정보를 수신할 수 있는 영업소를 포함할 수 있다. 예 컨대, 본 개시의 DT점은 모빌리티 내의 고객이 DT점에서 제공하는 아이템을 선택하고 주문할 수는 있으나, 상기 주문한 아이템을 픽업하기 위해서는 모빌리티를 별도의 장소에 주/정차를 해야 할 필요가 있는 영업소일 수 있 다. 즉, 본 개시의 DT점은 Drive Through 경로가 없는 Drive In 형태의 영업소도 포함할 수 있다. 본 개시의 이미지 생성 장치는 인공지능 모델을 이용하여 탑승자의 뇌파 신호로부터 DT점과 관련된 이미지를 생 성할 수 있다. 예컨대, DT점에서 제공하는 메뉴 또는 상품과 관련된 이미지를 생성할 수 있다. 또한, 본 개시의 이미지 생성 장치는 생성된 이미지에 기초하여 소정의 리스트에 포함된 이미지를 선택할 수 있다. 예컨대, DT점 에서 제공하는 소정의 메뉴 또는 상품의 리스트에 포함된 이미지를 선택할 수 있다. 또한, 본 개시의 이미지 생 성 장치는 상기 선택된 이미지에 기초하여 모빌리티를 제어하거나 상기 DT점에 탑승자가 선택한 소정의 정보를 제공할 수 있다. 한편, 인공지능 기술은 컴퓨터에게 데이터를 학습시켜 마치 사람처럼 스스로 의사결정을 할 수 있게 하는데, 인 공 신경망(artificial neural network)은 생물학의 신경망에서 영감을 얻은 수학적 모델로서, 시냅스의 결합으 로 네트워크를 형성한 인공 뉴런이 학습을 통해 시냅스의 결합 세기를 변화시킴으로써 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경망은 일반적으로 입력층(input layer), 은닉층(hidden layer) 및 출력층 (output layer)로 구성되어 있으며 각 층에 포함된 뉴런들이 가중치를 통해 연결되어 있으며, 가중치와 뉴런값 의 선형 결합과 비선형 활성화 함수를 통해 인공 신경망은 복잡한 함수를 근사화할 수 있는 형태를 가질 수 있 다. 인공 신경망 학습의 목적은 출력층에서 계산된 출력과 실제 출력의 값 차이를 최소화 시키는 가중치를 찾는 데 있다. 심층 신경망(deep neural network)은 입력층과 출력층 사이에 여러 개의 은닉층들로 이루어진 인공 신경망으로 서, 많은 은닉층을 통해 복잡한 비선형 관계들을 모델링할 수 있으며, 이처럼 층의 개수를 늘림으로써 고도화된 추상화가 가능한 신경망 구조를 딥러닝(deep learning)이라고 부른다. 딥러닝은 매우 방대한 양의 데이터를 학 습하여, 새로운 데이터가 입력될 경우 학습 결과를 바탕으로 확률적으로 가장 높은 답을 선택하기 때문에 영상 에 따라 적응적으로 동작할 수 있으며, 데이터에 기초하여 모델을 학습하는 과정에서 특성인자를 자동으로 찾아 낼 수 있다. 본 개시의 딥러닝 기반의 모델은 완전 합성곱 신경망(완전 컨볼루션 뉴럴 네트워크, fully convolutional neural network), 합성곱 신경망(컨볼루션 뉴럴 네트워크, Convolutional Neural Network, CNN), 순환 신경망 (회귀 뉴럴 네트워크, Recurrent Neural Network, RNN), 제한 볼츠만 머신(restricted Boltzmann machine, RBM) 및 심층 신뢰 신경망(deep belief neural network, DBN) 중 적어도 하나를 포함할 수 있으나, 이에 제한 되지 않는다. 또는, 딥러닝 이외의 머신 러닝 방법도 포함할 수 있다. 또는 딥러닝과 머신 러닝을 결합한 하이 브리드 형태의 모델도 포함할 수 있다. 예컨대, 딥러닝 기반의 모델을 적용하여 영상의 특징을 추출하고, 상기 추출된 특징에 기초하여 영상을 분류하거나 인식할 때는 머신 러닝 기반의 모델을 적용할 수도 있다. 머신 러닝 기반의 모델은 서포트 벡터 머신(Support Vector Machine, SVM), 에이다부스트(AdaBoost) 등을 포함할 수 있으 나, 이에 한정되지 않는다. 여기서, RNN은 LSTM(Long Short-Term Memory)을 포함할 수 있다. 또한, 본 개시의 딥러닝 기반의 모델을 학습하는 방법은 지도 학습(supervised learning), 비지도 학습 (unsupervised learning) 또는 강화 학습(reinforcement learning) 중 적어도 하나를 포함할 수 있으나, 이에 제한되지 않는다. 지도 학습은 일련의 학습 데이터와 그에 상응하는 레이블(label, 목표 출력값)을 이용하여 학 습이 이루어지며, 지도 학습에 기초한 신경망 모델은 훈련용 데이터(training data)로부터 함수를 추론해내는 형태의 모델일 수 있다. 지도 학습은 일련의 학습 데이터와 그에 상응하는 목표 출력 값을 수신하고, 입력되는 데이터에 대한 실제 출력 값과 목표 출력 값을 비교하는 학습을 통해 오류를 찾아내고, 해당 결과를 근거로 모 델을 수정하게 된다. 지도 학습은 결과물의 형태에 따라 다시 회귀(regression), 분류(classification), 검출 (detection), 시멘틱 세그멘테이션(semantic segmentation) 등으로 구분될 수 있다. 지도 학습을 통해 도출된 함수는 다시 새로운 결과값을 예측하는데 사용될 수 있다. 이처럼, 지도 학습에 기초한 신경망 모델은 수많은 학습 데이터의 학습을 통해, 신경망 모델의 파라미터를 최적화하게 된다. 비지도 학습은 지도 학습과 달리 데이터에 대한 레이블이 주어지지 않은 상태에서 학습이 이루어지는 방법론이 다. 즉, 비지도 학습은 알고 있는 출력값이나 정보 없이 학습 알고리즘을 가르쳐야 하는 학습 방법을 의미하며, 상기 학습 알고리즘은 입력 데이터만으로 데이터에서 지식을 추출할 수 있어야 한다. 일 예로, 비지도 변환 (unsupervised transformation)은 데이터를 새롭게 표현하여 사람이나 다른 머신 러닝 알고리즘이 원래 데이터 보다 쉽게 해석할 수 있도록 만드는 방법을 의미할 수 있다. 예컨대, 차원 축소(dimensionality reduction)는 특성이 많은 고차원 데이터로부터 특성의 수를 줄이면서 필요한 특징만을 포함하도록 변환할 수 있다. 다른 예 로, 군집(clustering)은 데이터를 비슷한 특성을 가진 것끼리 그룹으로 구분하는 방법을 의미할 수 있으며, 즉, 레이블이 없어도 사진 등에 나타나는 공통적인 특징으로 그룹화를 하는 것을 의미할 수 있다. 또 다른 예로, 이미지를 생성하거나 복원하는 분야, 동작을 흉내 내는 분야 등에서 최근 활발한 연구가 진행되 고 있는 생성적 적대 신경망(Generative Adversarial Network, GAN) 모델이 있다. 생성적 적대 신경망 모델은 한 종류의 서로 대립하는 두 시스템이 서로 경쟁하는 방식으로 학습을 진행하는 인공 신경망 또는 딥러닝으로서, 생성이라는 문제를 풀기 위해 딥러닝으로 만들어진 모델을 적대적 학습이라는 방식으로 학습시키 는 알고리즘을 의미할 수 있다. 생성적 적대 신경망 모델은 생성자(generator)와 판별자(discriminator)가 서로 경쟁하는 과정을 통해 정보를 학습할 수 있다. 구체적으로, 생성자는 이미 존재하는 데이터와 비슷한 모조 데이 터를 생성하는 역할을 수행할 수 있으며, 만약 생성자의 모조 데이터가 실제 데이터에 가깝다면 판별자는 판별 의 기능을 상실할 수 있다. 또한, 판별자는 입력 데이터가 실제 데이터인지 모조 데이터인지 여부를 구별하는 역할을 수행할 수 있으며, 만약 생성자가 산출한 모조 데이터를 판별자가 50%의 확률로 진위 여부를 판단한다면 학습을 종료할 수 있다. 한편, 본 개시의 생성적 적대 신경망 모델은 보다 안정적인 학습이 가능한 DCGAN(Deep Convolutional GAN) 모델을 포함할 수 있다. 도 7을 참조하면, 이미지 생성 장치는 센싱부 및/또는 제어부를 포함할 수 있다. 다만, 이는 본 실시예를 설명하기 위해 필요한 일부 구성요소만을 도시한 것일 뿐, 이미지 생성 장치에 포함된 구성요소 가 전술한 예에 한정되는 것은 아니다. 예컨대, 둘 이상의 구성부가 하나의 구성부 내에서 구현될 수도 있고, 하나의 구성부에서 실행되는 동작이 분할되어 둘 이상의 구성부에서 실행되도록 구현될 수도 있다. 또한, 일부 구성부가 생략되거나 부가적인 구성부가 추가될 수도 있다. 본 개시의 이미지 생성 장치는 모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동 안 복수의 채널에서 수집할 수 있다. 또한, 센싱부는 상기 동작을 수행할 수 있다. 여기서, 복수의 채널에서 수집된 뇌파 신호는, 시간 도메인, 주파수 도메인 또는 공간 도메인 중 적어도 하나에 서의 뇌파 신호를 의미할 수 있다. 여기서, 상기 공간 도메인은 뇌파 신호 측정 채널을 의미할 수 있다. 본 개시의 이미지 생성 장치는 인공지능 모델을 이용하여 복수의 채널에서 수집된 뇌파 신호로부터 서비스 포인트와 관련된 제1 이미지를 생성할 수 있다. 또한, 제어부는 상기 동작을 수행할 수 있다. 여기서, 서비스 포인트는 DT점을 의미할 수 있다. 일 예로, 상기 서비스 포인트는 모빌리티를 기준으로 하여 소정의 범위 내에 있는 DT 서비스 제공 장소일 수 있 다. 또는, 모빌리티가 상기 서비스 포인트로부터 소정의 범위 내에 있는 경우 상기 모빌리티는 상기 아이템에 관한 정보를 수신할 수 있다. 상기 서비스 포인트는 모빌리티의 위치에 따라 개수, 종류 등이 상이할 수 있다. 본 개시의 이미지 생성 장치는 수신부(미도시)를 더 포함할 수 있으며, 상기 수신부는 상기 수신 동작을 수행할 수 있다. 도 8은 본 발명의 일 실시예에 따른 서로 송수신하는 모빌리티와 서비스 포인트 간의 범위를 설명하기 위한 도 면이다. 도 8을 참조하면, 제1 서비스 포인트의 경우, 상기 제1 서비스 포인트를 기준으로 제1 범위 내 에 있는 모빌리티에게 상기 제1 서비스 포인트에서 제공하는 아이템에 관한 정보를 전송할 수 있다. 반면, 제2 서비스 포인트의 경우, 상기 제2 서비스 포인트를 기준으로 제2 범위 내에 있는 아이 템에 관한 정보를 전송할 수 있는 모빌리티가 존재하지 않는다. 또는, 모빌리티는 상기 모빌리티를 기준으로 제3 범위 내에 있는 제1 서비스 포인트 및 제2 서비스 포인트로부터 아이템에 관한 정보를 수신할 수 있다. 다른 예로, 상기 서비스 포인트는 사용자 입력에 의한 장소 또는 모빌리티에 기설정된 장소를 의미할 수 있다. 또는, 상기 서비스 포인트는 모빌리티 상의 네비게이션 장치에서 소정의 조건에 따라 자동으로 감지된 장소를 의미할 수 있다. 상기 서비스 포인트는 모빌리티 내의 사용자마다 상이하게 설정될 수 있다. 예컨대, 사용자가 선호하는 서비스 포인트를 사용자마다 입력함으로써 서비스 포인트가 설정될 수 있다. 또 다른 예로, 상기 서비스 포인트는 서비스 제공 장소의 성격에 따라 그룹핑될 수 있다. 예컨대, 제공되는 아 이템, 서비스의 성격 내지 타입에 따라 패스트푸드점, 커피숍, 제과점, 편의점, 은행, 매표소 등으로 그룹핑될 수 있고, 모빌리티 탑승자의 선택에 따라 상기 그룹핑된 목록 중 적어도 하나가 선정될 수 있다. 또한, 예컨대, 모빌리티 상의 디스플레이에 상기 그룹핑된 목록이 제시되고, 상기 제시에 대한 응답으로서, 모빌리티 탑승자의 선택에 따라 상기 그룹핑된 목록 중 적어도 하나가 선정될 수 있다. 여기서, 상기 소정의 범위는 모빌리티 및/또는 서비스 포인트를 기준으로 반경 몇 km, 몇 십 km 등 거리를 의미 할 수 있다. 또한, 상기 소정의 범위는 통신망에 기초하여 설정될 수 있다. 예컨대, 모빌리티와 서비스 포인트 간에 근거리 통신망에 기초하여 송수신하는 경우, 상기 소정의 범위는 근거리 통신망으로 송수신될 수 있는 범 위일 수 있다. 이때, 상기 근거리 통신망은 비콘 등이 이용될 수 있다. 여기서, 아이템은 DT 아이템을 의미할 수 있다. 예컨대, 상기 아이템은 햄버거, 커피, 빵 등의 각각의 물품을 의미할 수 있다. 즉, 모빌리티 탑승자가 구매하고자 하는 물품을 의미할 수 있다. 또한, 상기 아이템은 서비스 포인트에서 제공하는 서비스를 포함할 수 있다. 또한, 상기 아이템은 서비스 포인트의 명칭, 이미지, 로고 등을 포함할 수 있다. 여기서, 아이템에 관한 정보는 DT 아이템에 관한 정보를 의미할 수 있다. 일 예로, 상기 DT 아이템에 관한 정보는 아이템의 이미지, 종류, 가격, 수량, 명칭 정보 등을 포함할 수 있다. 다른 예로, 상기 DT 아이템에 관한 정보는 서비스 포인트에서 제공하는 소정의 정보를 포함할 수 있다. 예컨대, 서비스 포인트에서 제공하는 신메뉴, 이벤트, 할인행사에 관한 정보 등을 포함할 수 있다. 또 다른 예로, 상기 DT 아이템에 관한 정보는 탑승자의 선호도에 기초하여 설정된 정보일 수 있다. 이를 위해, 상기 DT 아이템에 관한 정보는 탑승자에 따라 미리 학습이 수행된 결과일 수 있다. 또한, 상기 DT 아이템에 관 한 정보는 실시간으로 업데이트될 수 있다. 한편, 인공지능 모델은 생성적 적대 신경망 모델을 의미할 수 있다. 또한, 상기 생성적 적대 신경망 모델은 DCGAN(Deep Convolutional GAN) 모델을 포함할 수 있다. 또한, 상기 인공지능 모델은 뇌파 신호를 처리하기 위 해 생성적 적대 신경망 모델에 RNN 기반의 모델이 결합된 모델을 의미할 수 있다. 상기 인공지능 모델은 생성적 적대 신경망 모델을 이용하여 사용자의 뇌파 신호와 그에 대응되는 서비스 포인트 에 관한 이미지에 대해 미리 학습될 수 있다. 여기서, 상기 서비스 포인트에 관한 이미지는 DT점을 나타내는 이 미지이거나 DT점에서 제공하는 아이템을 나타내는 이미지를 의미할 수 있다. 여기서, 상기 제1 이미지는 서비스 포인트를 나타내는 서비스 포인트 이미지 및 아이템 이미지 중 적어도 하나 이고, 상기 서비스 포인트 이미지는 서비스 포인트를 나타내는 이미지이고, 상기 아이템 이미지는 상기 서비스 포인트에서 제공하는 아이템을 나타내는 이미지를 의미할 수 있다. 여기서, 상기 아이템 이미지는 DT점에서 제 공하는 상품, 메뉴, 물품 등의 이미지를 의미할 수 있다. 일 예로, 상기 제1 이미지가 서비스 포인트 이미지인 경우, 제1 이미지는 패스트푸드점, 커피숍, 제과점, 편의 점, 은행, 매표소 등의 로고, 상호 이미지 등을 의미할 수 있다. 다른 예로, 상기 제1 이미지가 아이템 이미지인 경우, 제1 이미지는 패스트푸드점에서 제공하는 햄버거, 음료수 등의 이미지를 의미할 수 있다. 또 다른 예로, 상기 제1 이미지가 아이템 이미지인 경우, 제1 이미지는 제과점에서 제공하는 상품들의 이미지를 의미할 수 있다.한편, 제1 이미지를 생성하는 과정에서, 상기 복수의 채널에서 수집된 뇌파 신호는 소정의 인코더를 거침으로써 EEG 특징 벡터가 생성될 수 있다. 여기서, 상기 소정의 인코더는 LSTM 레이어, 비선형 레이어(예를 들어, ReLU 비선형 활성함수를 포함하는 fully-connected 레이어) 등을 포함할 수 있다. 다시, 도 7을 참조하면, 본 개시의 이미지 생성 장치는 상기 제1 이미지에 기초하여 소정의 리스트에 포함 된 제2 이미지를 선택할 수 있다. 또한, 제어부는 상기 동작을 수행할 수 있다. 여기서, 소정의 리스트는 적어도 하나 이상의 서비스 포인트 이미지로 구성될 수 있다. 또는, 소정의 리스트는 적어도 하나 이상의 아이템 이미지로 구성될 수 있다. 또한, 상기 제2 이미지는 서비스 포인트 이미지 또는 아 이템 이미지를 의미할 수 있다. 예컨대, 본 개시의 이미지 생성 장치는 상기 제1 이미지와 상기 소정의 리스트에 포함된 이미지간의 유사 도 판단에 기초하여 상기 제2 이미지를 선택할 수 있다. 즉, 본 개시의 이미지 생성 장치는 상기 소정의 리스트에서 상기 제1 이미지와 가장 유사한 이미지인 제2 이미지를 선택할 수 있다. 여기서, 상기 유사도 판단은 입력 영상간의 특징점을 추출하여 유사도를 판단하는 기법 등 영상 인식 또는 분류 분야에서 일반적으로 이용되는 다양한 유사도 판단 방법들이 적용될 수 있다. 즉, 본 개시의 이미지 생성 장치는 제2 이미지를 선택함으로써, 탑승자가 의도하고 있다고 판단되는 서비 스 포인트를 선택할 수 있다. 또는, 본 개시의 이미지 생성 장치는 제2 이미지를 선택함으로써, 탑승자가 의도하고 있다고 판단되는 아이템을 선택할 수 있다. 또한, 본 개시의 이미지 생성 장치는 상기 선택된 제2 이미지에 대한 응답으로서 상기 모빌리티를 제어하 거나 소정의 정보를 서비스 포인트에게 제공할 수 있다. 또한, 제어부는 상기 동작을 수행할 수 있다. 즉, 상술한 바와 같이, 본 개시의 이미지 생성 장치는 상기 유사도 판단을 이용함으로써 탑승자가 의도한 또는 생각한 정보가 어떤 것인지 판단할 수 있다. 또한, 상기 판단에 따라 목적에 맞게 모빌리티를 제어하거나 서비스 포인트에게 소정의 정보를 전송할 수 있다. 일 예로, 상기 선택된 제2 이미지에 대응되는 서비스 포인트로 주행 경로가 변경되거나 상기 주행 경로가 탑승 자에게 제공됨으로써 상기 탑승자로부터 경로 선택을 유도할 수 있다. 또는, 상기 변경된 주행 경로에 대한 안 내 멘트가 탑승자에게 제공될 수 있다. 다른 예로, 상기 선택된 제2 이미지에 대응되는 아이템에 대한 주문(order) 신호가 해당 서비스 포인트로 전송 될 수 있다. 예컨대, 제2 이미지가 ‘커피’로 선택된 경우, 상기 커피에 대응되는 커피숍으로 상기 커피에 대 한 주문 신호가 전송될 수 있다. 또는, 상기 커피에 대응되는 커피숍으로 주행 경로가 변경되거나 상기 주행 경 로가 탑승자에게 제공됨으로써 상기 탑승자로부터 경로 선택을 유도할 수 있다. 또는, 상기 변경된 주행 경로에 대한 안내 멘트가 탑승자에게 제공될 수 있다. 도 9는 본 발명의 일 실시예에 따른 이미지 생성 장치의 동작방법을 나타내는 흐름도이다. 단계 S901에서, 모빌리티 내의 적어도 한 명의 탑승자에 대한 뇌파 신호를 소정의 시간 동안 복수의 채널에서 수집할 수 있다. 여기서, 복수의 채널에서 수집된 뇌파 신호는, 시간 도메인, 주파수 도메인 또는 공간 도메인 중 적어도 하나에 서의 뇌파 신호를 의미할 수 있다. 단계 S902에서, 인공지능 모델을 이용하여 복수의 채널에서 수집된 뇌파 신호로부터 제1 이미지를 생성할 수 있 다. 여기서, 인공지능 모델은 생성적 적대 신경망 모델을 의미할 수 있다. 또한, 상기 생성적 적대 신경망 모델은 DCGAN 모델을 포함할 수 있다. 또한, 상기 인공지능 모델은 뇌파 신호를 처리하기 위해 생성적 적대 신경망 모 델에 RNN 기반의 모델이 결합된 모델을 의미할 수 있다. 여기서, 상기 제1 이미지는 서비스 포인트를 나타내는 서비스 포인트 이미지 및 아이템 이미지 중 적어도 하나 이고, 상기 서비스 포인트 이미지는 서비스 포인트를 나타내는 이미지이고, 상기 아이템 이미지는 상기 서비스 포인트에서 제공하는 아이템을 나타내는 이미지를 의미할 수 있다. 한편, 상기 인공지능 모델은 생성적 적대 신경망 모델을 이용하여 사용자의 뇌파 신호와 그에 대응되는 서비스 포인트에 관한 이미지에 대해 미리 학습될 수 있다. 여기서, 상기 서비스 포인트에 관한 이미지는 DT점을 나타 내는 이미지이거나 DT점에서 제공하는 아이템을 나타내는 이미지를 의미할 수 있다. 또한, 한편, 제1 이미지를 생성하는 과정에서, 상기 복수의 채널에서 수집된 뇌파 신호는 소정의 인코더를 거침 으로써 EEG 특징 벡터가 생성될 수 있다. 여기서, 상기 소정의 인코더는 LSTM 레이어, 비선형 레이어(예를 들어, ReLU 비선형 활성함수를 포함하는 fully-connected 레이어) 등을 포함할 수 있다. 단계 S903에서, 상기 생성된 제1 이미지에 기초하여 소정의 리스트에 포함된 적어도 하나의 제2 이미지를 선택 할 수 있다. 여기서, 소정의 리스트는 적어도 하나 이상의 서비스 포인트 이미지로 구성될 수 있다. 또는, 소정의 리스트는 적어도 하나 이상의 아이템 이미지로 구성될 수 있다. 또한, 상기 제2 이미지는 서비스 포인트 이미지 또는 아 이템 이미지를 의미할 수 있다. 예컨대, 상기 제1 이미지와 상기 소정의 리스트에 포함된 이미지간의 유사도 판단에 기초하여 상기 제2 이미지 를 선택할 수 있다. 즉, 상기 소정의 리스트에서 상기 제1 이미지와 가장 유사한 이미지인 제2 이미지를 선택할 수 있다. 여기서, 상기 유사도 판단은 입력 영상간의 특징점을 추출하여 유사도를 판단하는 기법 등 영상 인식 또는 분류 분야에서 일반적으로 이용되는 다양한 유사도 판단 방법들이 적용될 수 있다. 단계 S904에서, 상기 선택된 제2 이미지에 대한 응답으로서, 모빌리티를 제어하거나 소정의 정보를 서비스 포인 트에게 제공할 수 있다. 즉, 유사도 판단을 이용함으로써 탑승자가 의도한 또는 생각한 정보가 어떤 것인지 판단할 수 있으며, 상기 판 단에 따라 목적에 맞게 모빌리티를 제어하거나 서비스 포인트에게 소정의 정보를 전송할 수 있다. 도 10은 본 발명의 다른 실시예에 따른 이미지 생성 장치의 동작방법을 나타내는 흐름도이다. 한편, 본 개시의 이미지 생성 장치는 탑승자의 뇌파 신호로부터 제1 이미지를 생성하고, 상기 생성된 제1 이미 지에 기초하여 제2 이미지를 선택하는 과정을 통해 상기 인공지능 모델을 업데이트할 수 있다. 즉, 상기 탑승자 의 뇌파 신호 및/또는 제1 이미지가 인공지능 모델에 대한 학습데이터로서 추가될 수 있다. 일 예로, 본 개시의 이미지 생성 장치는 상기 선택된 제2 이미지가 상기 탑승자의 의도에 부합되는지 여부에 대 한 확인 과정이 추가적으로 수행될 수 있다. 그리고, 탑승자의 의도에 부합하는지 여부에 따라 상기 인공지능 모델에서 상기 제1 이미지가 생성될 확률을 높이거나 또는 낮출 수 있다. 단계 S1001 내지 단계 S1003은 도 9의 단계 S901 내지 단계 S903에 각각 대응될 수 있으므로, 자세한 과정은 도 9에서 상술한 바와 같다. 단계 S1004에서, 선택된 제2 이미지가 탑승자의 의도에 부합되는지 여부에 대한 확인 과정을 수행할 수 있다. 예컨대, 상기 선택된 제2 이미지 또는 제2 이미지에 대한 명칭 등을 모빌리티 내 소정의 디스플레이에 표시할 수 있으며, 상기 표시에 대한 응답으로서, ‘예’ 또는 ‘아니오’를 선택하는 사용자 입력자 입력을 수신할 수 있다. 단계 S1005에서, 상기 탑승자의 의도에 부합되는지 여부에 기초하여 인공지능 모델을 업데이트 할 수 있다. 예컨대, 선택된 제2 이미지가 탑승자의 의도에 부합하는 경우, 인공지능 모델에서 제1 이미지가 생성될 확률을 소정의 수치만큼 높이고, 상기 선택된 제2 이미지가 상기 탑승자의 의도에 부합되는 않은 경우, 상기 인공지능 모델에서 상기 제1 이미지가 생성될 확률을 소정의 수치만큼 낮출 수 있다. 본 개시의 예시적인 방법들은 설명의 명확성을 위해서 동작의 시리즈로 표현되어 있지만, 이는 단계가 수행되는 순서를 제한하기 위한 것은 아니며, 필요한 경우에는 각각의 단계가 동시에 또는 상이한 순서로 수행될 수도 있다. 본 개시에 따른 방법을 구현하기 위해서, 예시하는 단계에 추가적으로 다른 단계를 포함하거나, 일부의 단 계를 제외하고 나머지 단계를 포함하거나, 또는 일부의 단계를 제외하고 추가적인 다른 단계를 포함할 수도 있 다. 본 개시의 다양한 실시예는 모든 가능한 조합을 나열한 것이 아니고 본 개시의 대표적인 양상을 설명하기 위한 것이며, 다양한 실시예에서 설명하는 사항들은 독립적으로 적용되거나 또는 둘 이상의 조합으로 적용될 수도 있 다. 또한, 본 개시의 다양한 실시예는 하드웨어, 펌웨어(firmware), 소프트웨어, 또는 그들의 결합 등에 의해 구현 될 수 있다. 하드웨어에 의한 구현의 경우, 하나 또는 그 이상의 ASICs(Application Specific Integrated Circuits), DSPs(Digital Signal Processors), DSPDs(Digital Signal Processing Devices), PLDs(Programmable Logic Devices), FPGAs(Field Programmable Gate Arrays), 범용 프로세서(general processor), 컨트롤러, 마이크로 컨트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 본 개시의 범위는 다양한 실시예의 방법에 따른 동작이 장치 또는 컴퓨터 상에서 실행되도록 하는 소프트웨어 또는 머신-실행가능한 명령들(예를 들어, 운영체제, 애플리케이션, 펌웨어(firmware), 프로그램 등), 및 이러한 소프트웨어 또는 명령 등이 저장되어 장치 또는 컴퓨터 상에서 실행 가능한 비-일시적 컴퓨터-판독가능 매체 (non-transitory computer-readable medium)를 포함한다."}
{"patent_id": "10-2019-0135834", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 ERN의 일반적인 파형을 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 ERN 및 Pe의 일반적인 파형을 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 Pe의 편향 특성을 나타내는 도면이다. 도 4는 본 발명의 일 실시예에 따른 ERP 및 Pe의 측정 영역을 나타내는 도면이다. 도 5은 본 발명의 일 실시예에 따른 ERN 및 CRN의 일반적인 파형을 나타내는 도면이다. 도 6은 본 발명의 일 실시예에 따른 대뇌피질 영역에 대응되는 뇌파측정 채널을 나타내는 도면이다. 도 7은 본 발명의 일 실시예에 따른 탑승자의 뇌파 신호에 기초하여 이미지를 생성하는 장치의 구성을 나타내는 블록도이다. 도 8은 본 발명의 일 실시예에 따른 서로 송수신하는 모빌리티와 서비스 포인트 간의 범위를 설명하기 위한 도 면이다. 도 9는 본 발명의 일 실시예에 따른 이미지 생성 장치의 동작방법을 나타내는 흐름도이다. 도 10은 본 발명의 다른 실시예에 따른 이미지 생성 장치의 동작방법을 나타내는 흐름도이다."}
