{"patent_id": "10-2023-7012734", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0067659", "출원번호": "10-2023-7012734", "발명의 명칭": "멀티-USIM 동작들을 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "라자두라이 라자벨사미"}}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 사용자 장비(user equipment, UE)에 의해 수행되는 방법에 있어서,상기 UE가 적어도 하나의 멀티-유니버셜 가입자 식별 모듈(universal subscriber identity module, USIM) 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하는 단계;상기 UE에 의해 지원되고 사용하도록 의도되는 상기 적어도 하나의 멀티-USIM 피처가 식별되는 경우, 액세스 및이동성 관리 기능(access and mobility management function, AMF) 엔티티에게, 상기 UE에 의해 지원되는 멀티-USIM 피처들의 정보를 포함하는 등록 요청 메시지를 송신하는 단계;기지국(base station, BS)으로부터, 상기 등록 요청 메시지에 기초하여 UE에 대한 멀티-USIM 피처들의 지시 ―상기 UE에 대한 멀티-USIM 피처들의 지시는 네트워크 정보 및 상기 멀티-USIM 피처들의 정보에 기초하여 상기AMF에 의해 식별됨 ― 를 포함하는 등록 수락 메시지를 수신하는 단계; 및상기 등록 수락 메시지에 기초하여 상기 AMF에 의해 상기 UE에 대해 지원되는 것으로 지시되는 적어도 하나의멀티-USIM 피처를 식별하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 UE에 의해 지원되는 멀티-USIM 피처들의 상기 정보는 상기 UE에 의해 지원되고 사용하도록 의도되는 상기적어도 하나의 멀티-USIM 피처를 포함하고,상기 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부에 대응하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 UE에 대한 멀티-USIM 피처들의 지시는 상기 AMF에 의해 지원되고 상기 UE에게 적용하도록 의도되는 적어도하나의 멀티-USIM 피처를 포함하고,상기 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부에 대응하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 UE가 상기 적어도 하나의 멀티-USIM 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하는 단계는,적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM이 활성인지의 여부를 식별하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 UE에 대한 멀티-USIM 피처들의 지시는 상기 AMF로부터 상기 BS로의 N2 메시지에포함되는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 UE에 대한 상기 멀티-USIM 피처의 지시는 네트워크 능력, 미리 설정된 로컬 정책, 또는선호 정책 중 적어도 하나에 기초하여 상기 AMF에 의해 식별되는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0067659-3-제1항에 있어서, 상기 UE에 대해 지원되는 것으로서 지시되는 적어도 하나의 멀티-USIM 피처는 적어도 두 개의운용 USIM들 중에서 적어도 하나의 USIM에 적용되는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "무선 통신 시스템에서 액세스 및 이동성 관리 기능(access and mobility management function, AMF) 엔티티에의해 수행되는 방법에 있어서,사용자 장비(user equipment, UE)로부터, 상기 UE에 의해 지원되고 사용하도록 의도되는 상기 적어도 하나의 멀티-USIM 피처가 상기 UE에 의해 식별되는 경우, 상기 UE에 의해 지원되는 멀티-USIM 피처들의 정보를 포함하는등록 요청 메시지를 수신하는 단계;네트워크 정보 및 상기 멀티-USIM 피처들의 정보에 기초하여 상기 UE에 대한 멀티-USIM 피처들의 지시를 식별하는 단계; 및기지국(base station, BS)에게, 상기 UE에 대한 멀티-USIM 피처들의 지시를 포함하는 메시지를 송신하는 단계;를 포함하며,상기 AMF에 의해 상기 UE에 대해 지원되는 것으로서 지시되는 적어도 하나의 멀티-USIM 피처는 등록 수락 메시지에 기초하여 식별되는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 UE에 의해 지원되는 멀티-USIM 피처들의 상기 정보는 상기 UE에 의해 지원되고 사용하도록 의도되는 상기적어도 하나의 멀티-USIM 피처를 포함하고,상기 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부에 대응하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8항에 있어서,상기 UE에 대한 멀티-USIM 피처들의 지시는 상기 AMF에 의해 지원되고 상기 UE에게 적용하도록 의도되는 적어도하나의 멀티-USIM 피처를 포함하고,상기 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부에 대응하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM이 활성인지의 여부는 상기 UE에 의해식별되는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서, 상기 UE에 대한 멀티-USIM 피처들의 지시는 상기 BS에 의해 상기 UE에게 송신되는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서, 상기 네트워크 정보 및 상기 멀티-USIM 피처들의 정보에 기초하여 상기 UE에 대한 멀티-USIM피처들의 지시를 식별하는 단계는,네트워크 능력, 미리 설정된 로컬 정책, 또는 선호 정책 중 적어도 하나에 기초하여 상기 UE에 대한 상기 멀티-USIM 피처의 지시를 식별하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7012734", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제8항에 있어서, 상기 UE에 대해 지원되는 것으로서 지시되는 적어도 하나의 멀티-USIM 피처는 상기 UE에 의해적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM에 적용되는, 방법.공개특허 10-2023-0067659-4-청구항 15 무선 통신 시스템에서의 사용자 장비(user equipment, UE)에 있어서,송수신부; 및상기 송수신부와 커플링된 적어도 하나의 프로세서;를 포함하며,상기 적어도 하나의 프로세서는,상기 UE가 적어도 하나의 멀티-유니버셜 가입자 식별 모듈(universal subscriber identity module, USIM) 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하며,상기 UE에 의해 지원되고 사용하도록 의도되는 상기 적어도 하나의 멀티-USIM 피처가 식별되는 경우, 액세스 및이동성 관리 기능(access and mobility management function, AMF) 엔티티에게, 상기 UE에 의해 지원되는 멀티-USIM 피처들의 정보를 포함하는 등록 요청 메시지를 송신하며,기지국(BS)으로부터, 상기 등록 요청 메시지에 기초하여 UE에 대한 멀티-USIM 피처들의 지시 ― 상기 UE에 대한멀티-USIM 피처들의 지시는 네트워크 정보 및 상기 멀티-USIM 피처들의 정보에 기초하여 상기 AMF에 의해 식별됨 ― 를 포함하는 등록 수락 메시지를 수신하며, 및상기 등록 수락 메시지에 기초하여 상기 AMF에 의해 상기 UE에 대해 지원되는 것으로 지시되는 적어도 하나의멀티-USIM 피처를 식별하도록구성되는, UE."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "무선 통신 시스템에서 사용자 장비(UE)에 의해 수행되는 방법이 제공된다. 그 방법은, UE가 적어도 하나의 멀티- USIM 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하는 단계; UE에 의해 지원되고 사용하도록 의도되는 적어도 하나의 멀티-USIM 피처가 식별되는 경우, AMF 엔티티에게, UE에 의해 지원되는 멀티-USIM 피처들의 정보 를 포함하는 등록 요청 메시지를 송신하는 단계; 기지국(BS)으로부터, 등록 요청 메시지에 기초하여 UE에 대한 멀티-USIM 피처들의 지시 ― UE에 대한 멀티-USIM 피처들의 지시는 네트워크 정보 및 멀티-USIM 피처들의 정보에 기초하여 AMF에 의해 지시됨 ― 를 포함하는 등록 수락 메시지를 수신하는 단계; 및 등록 수락 메시지에 기초하 여 AMF에 의해 UE에 대해 지원되는 것으로 지시되는 적어도 하나의 멀티-USIM 피처를 식별하는 단계를 포함한다."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 무선 통신에 관한 것이고, 더 상세하게는 멀티 유니버셜 가입자 식별 모듈(Multi Universal Subscriber Identity Module, MUSIM) 최적화를 개시/사용하는 방법, 사용자 장비(User Equipment, UE), 및 네 트워크 엔티티들에 관한 것이다."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "4세대(4G) 통신 시스템들의 전개 이후 증가한 무선 데이터 트래픽에 대한 요구를 충족시키기 위해, 개선된 5세 대(5G) 또는 pre-5G 통신 시스템을 개발하기 위한 노력들이 이루어졌다. 5G 또는 pre-5G 통신 시스템은 '4G 이 후(beyond 4G) 네트워크' 또는 '포스트 LTE(post long term evolution) 시스템'이라고 또한 지칭된다. 5G 통신 시스템은 더 높은 데이터 속도들을 성취하기 위해서, 더 높은 주파수(mmWave) 대역들, 예컨대, 60 GHz 대역들에 서 구현되는 것으로 생각된다. 전파들의 전파 손실을 줄이고 송신 거리를 늘이기 위해, 빔포밍, 대규모 MIMO(multiple-input multiple-output), FD-MIMO(full dimensional MIMO), 어레이 안테나, 아날로그 빔포밍, 및 대규모 안테나 기법들이 5G 통신 시스템들에 관해 논의된다. 또한, 5G 통신 시스템들에서, 차세대 소형 셀들, 클라우드 RAN들(radio access networks), 초고밀(ultra-dense) 네트워크들, D2D(device-to-device) 통신, 무선 백홀(backhaul), 무빙 네트워크, 협력 통신, CoMP(coordinated multi-points), 수신단 간섭 제거 등에 기초하여 시스템 네트워크 개선을 위한 개발이 진행 중이다. 5G 시스템에서, 하이브리드 FSK(frequency shift keying)와 FQAM(Feher's quadrature amplitude modulation) 및 SWSC(sliding window superposition coding)가 ACM(advanced coding modulation)으로서, 그리고 FBMC(filter bank multi carrier), NOMA(non-orthogonal multiple access), 및 SCMA(sparse code multiple access)가 고급 액세스 기술로서 개발되었다. 인간들이 정보를 생성하고 소비하는 인간 중심 연결성 네트워크인 인터넷은 사물들과 같은 분산된 엔티티들이 인간 개입 없이 정보를 교환하고 프로세싱하는 사물 인터넷(Internet of things, IoT)으로 이제 진화하고 있다. 클라우드 서버와의 연결을 통한 IoT 기술과 빅 데이터 프로세싱 기술의 조합인 만물 인터넷(Internet of everything, IoE)이 출현하였다. \"감지 기술\", \"유선/무선 통신 및 네트워크 인프라스트럭처\", \"서비스 인터페 이스 기술\", 및 \"보안 기술\"과 같은 기술 요소들이 IoT 구현을 위해 요구됨에 따라, 센서 네트워크, M2M(machine-to-machine) 통신, MTC(machine type communication) 등이 최근에 연구되고 있다. 이러한 IoT 환 경은 연결된 사물들 간에 생성되는 데이터를 수집하고 분석함으로써 인간의 삶에 새로운 가치를 창출하는 지능형 인터넷 기술 서비스들을 제공할 수 있다. IoT는 현존 정보 기술(information technology, IT)과 다양한 산업 적 응용들 사이의 수렴 및 조합을 통하여 스마트 홈, 스마트 빌딩, 스마트 도시, 스마트 자동차 또는 연결형 자 동차들, 스마트 그리드, 헬스 케어, 스마트 가전기기들 및 차세대 의료 서비스들을 포함하는 다양한 분야들에 적용될 수 있다. 이것에 맞추어, 5G 통신 시스템들을 IoT 네트워크들에 적용하려는 다양한 시도들이 이루어졌다. 예를 들어, 센 서 네트워크, MTC, 및 M2M 통신과 같은 기술들이 빔포밍, MIMO, 및 어레이 안테나들에 의해 구현될 수 있다. 클 라우드 RAN의 위에서 설명된 빅 데이터 프로세싱 기술로서의 응용은 5G 기술과 IoT 기술 사이의 수렴의 일 예로 서 또한 간주될 수 있다. 위에서 설명된 바와 같이, 다양한 서비스들은 무선 통신 시스템의 발전에 따라 제공될 수 있고, 따라서 이러한 서비스들을 손쉽게 제공하는 방법이 요구된다."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "예시적인 실시예에서, 무선 통신 시스템에서 사용자 장비(UE)에 의해 수행되는 방법이 제공된다. 그 방법은, UE 가 적어도 하나의 멀티-USIM 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하는 단계; UE에 의해 지원되 고 사용하도록 의도되는 적어도 하나의 멀티-유니버셜 가입자 식별 모듈(USIM) 피처가 식별되는 경우, 액세스 및 이동성 관리 기능(access and mobility management function, AMF) 엔티티에게, UE에 의해 지원되는 멀티- USIM 피처들의 정보를 포함하는 등록 요청 메시지를 송신하는 단계; 기지국(BS)으로부터, 등록 요청 메시지에 기초하여 UE에 대한 멀티-USIM 피처들의 지시 ― UE에 대한 멀티-USIM 피처들의 지시는 네트워크 정보 및 멀티- USIM 피처들의 정보에 기초하여 AMF에 의해 지시됨 ― 를 포함하는 등록 수락 메시지를 수신하는 단계; 및 등록 수락 메시지에 기초하여 AMF에 의해 UE에 대해 지원되는 것으로 지시되는 적어도 하나의 멀티-USIM 피처를 식별 하는 단계를 포함한다."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "따라서, 본 개시에서의 실시예들은 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 지원하는 사용자 장비(U E)를 동작시키는 방법을 성취한다. 본 개시의 일 양태에 따라, 무선 통신 시스템에서 사용자 장비(UE)에 의해 수행되는 방법이 제공된다. 그 방법 은, UE가 적어도 하나의 멀티-USIM 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하는 단계; UE에 의해 지원되고 사용하도록 의도되는 적어도 하나의 멀티-유니버셜 가입자 식별 모듈(USIM) 피처가 식별되는 경우, 액 세스 및 이동성 관리 기능(AMF) 엔티티에게, UE에 의해 지원되는 멀티-USIM 피처들의 정보를 포함하는 등록 요 청 메시지를 송신하는 단계; 기지국(BS)으로부터, 등록 요청 메시지에 기초하여 UE에 대한 멀티-USIM 피처들의 지시 ― UE에 대한 멀티-USIM 피처들의 지시는 네트워크 정보 및 멀티-USIM 피처들의 정보에 기초하여 AMF에 의 해 지시됨 ― 를 포함하는 등록 수락 메시지를 수신하는 단계; 및 등록 수락 메시지에 기초하여 AMF에 의해 UE에 대해 지원되는 것으로 지시되는 적어도 하나의 멀티-USIM 피처를 식별하는 단계를 포함한다, 예시적인 실시예에서, UE에 의해 지원되는 멀티-USIM 피처들의 정보는 UE에 의해 지원되고 사용하도록 의도되는 적어도 하나의 멀티-USIM 피처를 포함하고, 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부(reject paging)에 해당한다. 예시적인 실시예에서, UE에 대한 멀티-USIM 피처들의 지시는 AMF에 의해 지원되고 UE에게 적용하도록 의도되는 적어도 하나의 멀티-USIM 피처를 포함하고, 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부에 대응한다. 예시적인 실시예에서, UE가 적어도 하나의 멀티-USIM 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하는 단계는, 적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM이 활성인지의 여부를 식별하는 단계를 포함한 다. 예시적인 실시예에서, UE에 대한 멀티-USIM 피처들의 지시는 AMF로부터 BS로의 N2 메시지에 포함된다. 예시적인 실시예에서, UE에 대한 멀티-USIM 피처의 지시는 네트워크 능력, 미리 설정된 로컬 정책, 또는 선호 정책 중 적어도 하나에 기초하여 AMF에 의해 식별된다. 예시적인 실시예에서, UE에 대해 지원되는 것으로서 지시되는 적어도 하나의 멀티-USIM 피처는 적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM에 적용된다. 본 개시의 다른 양태에 따르면, 무선 통신 시스템에서 액세스 및 이동성 관리 기능(AMF) 엔티티에 의해 수행되 는 방법이 제공된다. 그 방법은, UE에 의해 지원되고 사용하도록 의도되는 적어도 하나의 멀티-USIM 피처가 UE에 의해 식별되는 경우, 사용자 장비(UE)로부터, UE에 의해 지원되는 멀티-USIM 피처들의 정보를 포함하는 등록 요청 메시지를 수신하는 단계; 네트워크 정보 및 멀티-USIM 피처들의 정보에 기초하여 UE에 대한 멀티-USIM 피 처들의 지시를 식별하는 단계; 및 기지국(BS)에게, UE에 대한 멀티-USIM 피처들의 지시를 포함하는 메시지를 송 신하는 단계를 포함하며, AMF에 의해 UE에 대해 지원되는 것으로서 지시되는 적어도 하나의 멀티-USIM 피처는 등록 수락 메시지에 기초하여 식별된다. 예시적인 실시예에서, UE에 의해 지원되는 멀티-USIM 피처들의 정보는 UE에 의해 지원되고 사용하도록 의도되는 적어도 하나의 멀티-USIM 피처를 포함하고, 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부(reject paging)에 해당한다. 예시적인 실시예에서, UE에 대한 멀티-USIM 피처들의 지시는 AMF에 의해 지원되고 UE에게 적용하도록 의도되는 적어도 하나의 멀티-USIM 피처를 포함하고, 적어도 하나의 멀티-USIM 피처는 연결 해제, 페이징 원인, 페이징 제한, 또는 페이징 거부에 대응한다. 예시적인 실시예에서, 적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM이 활성인지의 여부는 UE에 의해 식별된다. 예시적인 실시예에서, UE에 대한 멀티-USIM 피처들의 지시는 BS에 의해 UE에게 송신된다. 예시적인 실시예에서, 네트워크 정보 및 멀티-USIM 피처들의 정보에 기초하여 UE에 대한 멀티-USIM 피처들의 지 시를 식별하는 단계는, 네트워크 능력, 미리 설정된 로컬 정책, 또는 선호 정책 중 적어도 하나에 기초하여 UE에 대한 멀티-USIM 피처 의 지시를 식별하는 단계를 포함한다. 예시적인 실시예에서, UE에 대해 지원되는 것으로서 지시되는 적어도 하나의 멀티-USIM 피처는 UE에 의해 적어 도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM에 적용된다. 본 개시의 다른 양태에 따르면, 무선 통신 시스템의 사용자 장비(UE)가 제공된다. UE는 송수신부; 및 송수신부 와 커플링되는 적어도 하나의 프로세서를 포함하고, 적어도 하나의 프로세서는, UE가 적어도 하나의 멀티-USIM 피처를 지원하고 사용할 의도가 있는지의 여부를 식별하며; UE에 의해 지원되고 사용하도록 의도되는 적어도 하 나의 멀티-유니버셜 가입자 식별 모듈(USIM) 피처가 식별되는 경우, 액세스 및 이동성 관리 기능(AMF) 엔티티에 게, UE에 의해 지원되는 멀티-USIM 피처들의 정보를 포함하는 등록 요청 메시지를 송신하며; 기지국(BS)으로부 터, 등록 요청 메시지에 기초하여 UE에 대한 멀티-USIM 피처들의 지시 ― UE에 대한 멀티-USIM 피처들의 지시는 네트워크 정보 및 멀티-USIM 피처들의 정보에 기초하여 AMF에 의해 지시됨 ― 를 포함하는 등록 수락 메시지를 수신하고; 등록 수락 메시지에 기초하여 AMF에 의해 UE에 대해 지원되는 것으로 지시되는 적어도 하나의 멀티- USIM 피처를 식별하도록 구성된다. 예시적인 실시예에서, 적어도 하나의 프로세서는 적어도 두 개의 운용 USIM들 중에서 적어도 하나의 USIM이 활 성인지의 여부를 식별하도록 구성된다. 그 방법은, 액세스 및 이동성 관리 기능(AMF) 엔티티에 의해, UE의 능력 정보를 포함하는 비-액세스 계층군 (Non-access stratum, NAS) 요청 메시지를 수신하는 단계를 포함하며, 능력 정보는 UE에서 액티브 MUSIM의 수, UE에 의해 지원되는 MUSIM 피처들 및 UE에 의해 사용되도록 의도되는 MUSIM 피처들 중 적어도 하나를 포함한다. 게다가, 그 방법은, AMF 엔티티에 의해, UE가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 AMF가 개시하도록 인가할지의 여부 및 AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원할지의 여부를 결정하는 단계를 포함한다. 게다가, 그 방법은, AMF 엔티티에 의해, AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원 한다는 지시를 포함하는 NAS 응답 메시지를 전송하는 단계를 포함한다. 게다가, 그 방법은, AMF 엔티티에 의해, AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원함을 지시하 는 N2 메시지를 라디오 액세스 네트워크(RAN) 노드에게 전송하는 단계를 포함한다. 일 실시예에서, AMF는 미리 설정된 로컬 정책 또는 선호 정책 중 하나에 기초하여 UE에 의해 사용되도록 의도되 는 MUSIM 피처들의 지원을 결정한다. 미리 설정된 로컬 정책 또는 선호 정책은 네트워크(예를 들어, AMF, gNB 등)가 MUSIM 피처들을 지원하는지의 여부와, 네트워크가 지원하더라도, AMF가 MUSIM 향상들을 UE들에게 제공하 도록 허용되는지의 여부를 지시한다. 미리 설정된 로컬 정책 또는 선호 정책은 특정한 MUSIM 피처들만을 허용할 수 있고 특정한 MUSIM 피처들을 허용하지 않을 수 있다.일 실시예에서, UE는 등록 수락 메시지를 수신하는 것에 기초하여 AMF 엔티티에 의해 지원되는 MUSIM 피처들을 사용한다. 일 실시예에서, UE에 의해 지원되는 하나 이상의 MUSIM 피처들은 연결 해제, 페이징 원인, 페이징 제한 및 페이 징 거부 중 적어도 하나를 지원하는 것을 포함한다. 일 실시예에서, NAS 요청 메시지는 등록 요청 메시지이고 NAS 응답 메시지는 등록 수락 메시지이다. 일 실시예에서, AMF 엔티티에 의해, UE가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 AMF 엔티티 개시하도 록 인가할지의 여부와 AMF 엔티티가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원할지의 여부를 결정하 는 것은, AMF 엔티티에 의해, UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가하지 않는다고 결정하는 것에 응답하여 하나 이상의 MUSIM 피처들을 개시하지 않는 것과, UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가 한다고 결정하는 것에 응답하여 AMF 엔티티가 하나 이상의 MUSIM 피처들을 개시하도록 인가되는지의 여부를 결 정하는 것 중 하나를 수행하는 것을 포함한다. 게다가, 그 방법은, AMF 엔티티에 의해, AMF 엔티티가 하나 이상 의 MUSIM 피처들을 개시하도록 인가되지 않는다고 결정하는 것에 응답하여 하나 이상의 MUSIM 피처들을 개시하 지 않는 것과, AMF 엔티티가 하나 이상의 MUSIM 피처들을 개시하도록 인가된다고 결정하는 것에 응답하여 MUSIM 최적화에 대한 지원을 개시하는 것 중 하나를 수행하는 단계와, MUSIM 최적화 지원 지시를 UE에게 전송하는 단 계를 포함한다. 일 실시예에서, MUSIM 최적화를 개시하는 것을 지시하는 것은 UE가 하나 이상의 MUSIM 최적화 지원하고 사용할 의도가 있다는 것을 지시한다. 일 실시예에서, UE의 하나 이상의 MUSIM 피처들은 UE가 연결 해제, 페이징 원인, 페이징 제한 및 페이징 거부 중 적어도 하나를 MUSIM 최적화 능력들로서 지원함을 지시한다. 일 실시예에서, UE의 하나 이상의 MUSIM 피처들은 UE 중 적어도 하나가 멀티-USIM 피처들의 능력들을 가짐과 UE 가 하나 이상의 멀티-USIM 피처들을 지원하지 않음을 지시한다. 일 실시예에서, UE의 하나 이상의 MUSIM 피처들은 하나 이상의 SIM을 갖는 UE가 요구되지 않는 경우 하나 이상 의 MUSIM 피처들을 받지 않음을 지시한다. 일 실시예에서, 그 방법은, UE에 의해, 하나 이상의 MUSIM 피처들 지원 지시가 AMF 엔티티로부터 수신되는지의 여부를 결정하는 단계를 더 포함한다. 게다가, 그 방법은, UE에 의해, 하나 이상의 MUSIM 피처들 지원 지시가 AMF 엔티티로부터 수신될 때 하나 이상의 MUSIM 피처들을 사용하는 것과, 하나 이상의 MUSIM 피처들 지원 지시 가 AMF 엔티티로부터 수신되지 않을 때 하나 이상의 MUSIM 피처들을 사용하지 않는 것 중 하나를 수행하는 단계 를 포함한다. 일 실시예에서, 그 방법은, UE에 의해, UE의 사용자로부터의 입력을 수신하는 단계를 더 포함하며, 입력은 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되고 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되지 않음 을 지시한다. 게다가, 그 방법은, UE에 의해, UE의 가입자 식별 모듈(SIM) 카드 관리자 또는 UE의 SIM 애플리케 이션 툴킷(SIM Application Toolkit, SAT)에 입력을 저장하는 단계를 포함한다. 게다가, 그 방법은, 수신된 입 력이 하나 이상의 MUSIM 피처들이 지원됨을 지시할 때, UE에 의해, 하나 이상의 MUSIM 피처들을 사용하는 단계 를 포함한다. 따라서, 본 개시에서의 실시예들은 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 지원하는 사용자 장비(U E)를 동작시키는 AMF 엔티티를 달성한다. AMF 엔티티는 프로세서 및 메모리와 커플링되는 MUSIM 최적화부를 포 함한다. MUSIM 최적화부는 UE의 능력 정보를 포함하는 비-액세스 계층군(NAS) 요청 메시지를 수신하며, 능력 정 보는 UE에서 액티브 MUSIM의 수, UE에 의해 지원되는 MUSIM 피처들 및 UE에 의해 사용되도록 의도되는 MUSIM 피 처들 중 적어도 하나를 포함한다. 게다가, MUSIM 최적화부는 UE가 UE에 의해 사용되도록 의도되는 MUSIM 피처들 을 AMF가 개시하도록 인가할지의 여부와 AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원할지의 여부 를 결정한다. 게다가, MUSIM 최적화부는 AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원한다는 지시 를 포함하는 NAS 응답 메시지를 전송한다. 따라서, 본 개시에서의 실시예들은 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 지원하는 UE를 달성한다. UE는 프로세서 및 메모리와 커플링되는 MUSIM 최적화부를 포함한다. MUSIM 최적화부는 UE의 사용자로부터의 입 력을 수신하며, 그 입력은 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되고 UE가 하나 이상의 MUSIM 피처 들을 개시하도록 인가되지 않음을 지시한다. 게다가, MUSIM 최적화부는 UE의 가입자 식별 모듈(SIM) 카드 관리자 또는 UE의 SIM 애플리케이션 툴킷(SAT)에 입력을 저장한다. MUSIM 최적화부는 수신된 입력이 하나 이상의 MUSIM 피처들이 지원됨을 지시할 때 하나 이상의 MUSIM 피처들을 사용한다. 본 개시에서의 실시예들의 이들 및 다른 양태들은 다음의 설명 및 첨부 도면들과 연계하여 고려될 때 더 잘 인 식되고 이해될 것이다. 그러나, 다음의 설명들은, 바람직한 실시예들 및 그것들의 수많은 특정 세부사항들을 나 타내면서, 예시로서 주어지고 제한으로는 아니라는 것이 이해되어야 한다. 많은 변경들 및 수정들이 본 개시에 서의 실시예들의 범위 내에서, 그 사상으로부터 벗어남 없이 이루어질 수 있고, 본 개시에서의 실시예들은 모든 그러한 수정들을 포함한다."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "아래의 \"발명을 실시하기 위한 구체적인 내용의 설명\"에 착수하기에 앞서, 본 특허 문서의 전체에 걸쳐 사용되 는 특정 단어들 및 문구들의 정의들을 언급하는 것이 유리할 수 있다. \"커플\"이란 용어 및 그것의 파생어들은, 그들 엘리먼트들이 서로 물리적으로 접촉하든 아니든, 둘 이상의 엘리먼트들 사이의 임의의 직접 또는 간접 통 신을 지칭한다. \"송신한다\", \"수신한다\" 및 \"통신한다\"라는 용어들뿐만 아니라 그 파생어들은 직접 통신 및 간 접 통신 둘 다를 포함한다. \"구비한다\" 및 \"포함한다\"라는 용어들뿐만 아니라 그 파생어들은, 제한 없는 포함을 의미한다. \"또는\"이란 용어는 포함적(inclusive)이며, \"및/또는\"을 의미한다. \"~에 연관된\"이란 문구 뿐만 아니 라 그 파생어들은, ~를 포함한다, ~내에 포함된다, ~와 상호연결한다, ~를 담고 있다, ~내에 담긴다, ~에 또는 ~와 연결한다, ~에 또는 ~와 커플링한다, ~와 통신 가능하다, ~와 협력한다, ~를 인터리브한다, ~를 병치한다, ~에 근접된다, ~에 또는 ~와 결부된다, ~를 가진다, ~의 특성을 가진다, ~에 또는 ~와 관계를 가진다 등을 의미 한다. \"제어부\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 디바이스, 시스템 또는 그 부분을 의미한다. 이러한 제어부는 하드웨어 또는 하드웨어 및 소프트웨어 및/또는 펌웨어의 조합으로 구현될 수 있다. 임의의 특 정 제어부에 연관된 기능은, 국부적으로든 또는 원격으로든, 중앙집중식 또는 분산식일 수 있다. \"~중 적어도 하나\"라는 문구는, 항목들의 목록과 함께 사용될 때, 열거된 항목들 중 하나 이상의 항목들의 상이한 조합들이 사용될 수 있고 목록에서의 임의의 하나의 항목만이 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B, 및 C 중 적어도 하나\"는 다음의 조합들 중 임의의 것을 포함한다: A, B, C, A 및 B, A 및 C, B 및 C, 그리고 A 및 B 및 C. 더구나, 아래에서 설명되는 다양한 기능들은 하나 이상의 컴퓨터 프로그램들에 의해 구현 또는 지원될 수 있으 며, 그러한 컴퓨터 프로그램들의 각각은 컴퓨터 판독가능 프로그램 코드로부터 형성되고 컴퓨터 판독가능 매체 에 수록된다. \"애플리케이션\" 및 \"프로그램\"이란 용어들은 적합한 컴퓨터 판독가능 프로그램 코드에서의 구현에 적합한 하나 이상의 컴퓨터 프로그램들, 소프트웨어 컴포넌트들, 명령 세트들, 프로시저들, 함수들, 개체들 (objects), 클래스들, 인스턴스들, 관련된 데이터, 또는 그 부분을 지칭한다. \"컴퓨터 판독가능 프로그램 코 드\"라는 문구는 소스 코드, 목적 코드, 및 실행가능 코드를 포함하는 임의의 유형의 컴퓨터 코드를 포함한다. \"컴퓨터 판독가능 매체\"라는 문구는, ROM(read only memory), RAM(random access memory), 하드 디스크 드라 이브, CD(compact disc), DVD(digital video disc), 또는 임의의 다른 유형의 메모리와 같은, 컴퓨터에 의해 액세스될 수 있는 임의의 유형의 매체를 포함한다. \"비일시적(non-transitory)\" 컴퓨터 판독가능 매체가 일시적 인 전기적 또는 다른 신호들을 전송하는 유선, 무선, 광학적, 또는 다른 통신 링크들을 배제한다. 비일시적 컴 퓨터 판독가능 매체가 데이터가 영구적으로 저장될 수 있는 매체와 데이터가 저장되고 나중에 덮어쓸 수 있는 매체, 이를테면 재기입가능 광 디스크 또는 소거가능 메모리 디바이스를 포함한다."}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "다른 특정 단어들 및 문구들에 대한 정의들은 본 특허 문서의 전체에 걸쳐 제공된다. 본 기술분야의 통상의 기 술자들은, 대부분은 아니지만 많은 경우들에서, 이러한 정의들이 이렇게 정의된 단어들 및 문구들의 이전 및 미 래의 사용들에 적용된다는 것을 이해하여야 한다. 아래에서 논의되는 도 1 내지 도 15와, 본 특허 문서에서 본 개시의 원리들을 설명하는데 사용되는 다양한 실시 예들은 단지 예시일 뿐이고 어떤 식으로든 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 본 기술분 야의 통상의 기술자들은 본 개시의 원리들이 임의의 적절히 배열된 시스템 또는 디바이스로 구현될 수 있다는 것을 이해할 것이다. 본 개시에서의 실시예들과 그것들의 다양한 특징들 및 유리한 세부사항들은 첨부 도면들에서 예시되고 다음의 설명에서 상세하게 되는 비제한적인 실시예들을 참조하여 더 충분히 설명된다. 널리 공지된 컴포넌트들 및 프로 세싱 기법들의 설명들은 본 개시의 실시예들을 불필요하게 모호하게 하지 않기 위해서 생략된다. 또한, 본 개시 에서 설명되는 다양한 실시예들은 반드시 상호 배타적인 것은 아닌데, 일부 실시예들이 새로운 실시예들을 형성 하기 위해 하나 이상의 다른 실시예들과 조합될 수 있기 때문이다. 본 명세서에서 사용되는 바와 같은 \"또는\"이"}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "란 용어는, 달리 지시되지 않는 한, 비배타적인 것을 말한다. 본 개시에서 사용되는 예들은 단지 본 개시의 실시예들이 실시될 수 있는 방법들의 이해를 용이하게 하기 위해서 그리고 본 기술분야의 통상의 기술자들이 본 개시의 실시예들을 실시하는 것을 추가로 가능하게 하기 위해서일 뿐이다. 따라서, 그 예들은 본 개시의 실시예 들의 범위를 제한하는 것으로 해석되자 않아야 한다. 그 분야에서 통상적인 바와 같이, 실시예들은 설명된 기능 또는 기능들을 수행하는 블록들의 측면에서 설명되고 예시될 수 있다. 이들 블록들은, 본 명세서에서 관리기들, 유닛들, 모듈들, 하드웨어 컴포넌트들 등이라고 말 할 수 있는 것으로, 로직 게이트들, 집적 회로들, 마이크로프로세서들, 마이크로제어기들, 메모리 회로들, 수동 전자 컴포넌트들, 능동 전자 컴포넌트들, 광학적 컴포넌트들, 하드와이어드 회로들 등과 같은 아날로그 및/또는 디지털 회로들에 의해 물리적으로 구현되고, 펌웨어에 의해 옵션적으로 구동될 수 있다. 그 회로들은, 예를 들 어, 하나 이상의 반도체 칩들 내에, 또는 인쇄 회로 보드들 등과 같은 기판 지지물들 상에 실시될 수 있다. 블 록을 구성하는 회로들은 전용 하드웨어에 의해, 또는 프로세서(예컨대, 하나 이상의 프로그래밍된 마이크로프로 세서들 및 연관된 회로)에 의해, 또는 그 블록의 일부 기능들을 수행하는 전용 하드웨어와 그 블록의 다른 기능 들을 수행하는 프로세서의 조합에 의해 구현될 수 있다. 실시예들의 각각의 블록은 본 개시의 범위로부터 벗어 남 없이 둘 이상의 상호작용 및 개별 블록들로 물리적으로 분리될 수 있다. 비슷하게, 실시예들의 블록들은 본 개시의 범위로부터 벗어남 없이 더 복잡한 블록들로 물리적으로 조합될 수 있다. 첨부 도면들은 다양한 기술적 특징들을 쉽게 이해하는 것을 돕는데 사용되고 본 개시에서 제시된 실시예들은 첨 부 도면들에 의해 제한되지 않는다는 것이 이해되어야 한다. 이와 같이, 본 개시는 특히 첨부 도면들에서 제시 된 것들 외에도 임의의 변경들, 동등물들 및 치환물들로 확장되는 것으로 해석되어야 한다. 비록 제1, 제2 등의 용어들이 다양한 엘리먼트들을 설명하기 위해 본 개시에서 사용될 수 있지만, 이들 엘리먼트들은 이들 용어들에 의해 제한되지 않아야 한다. 이들 용어들은 하나의 엘리먼트를 다른 엘리먼트로부터 구별하는데에만 일반적으로 사용된다. 3세대 파트너십 프로젝트(3rd Generation Partnership Project, 3GPP)가 네트워크 리소스들 사용(예를 들어, 페이징)을 최적화하기 위한 연구를 개시하였다. 멀티 유니버셜 가입자 식별 모듈(MUSIM) 디바이스들에 대한 지 원을 표준화하는 것은 네트워크 기능이 예측 가능한 사용자 장비(UE) 동작에 기초하게 허용함으로써 성능을 개 선할 수 있다. 사용자가 다양한 네트워크들 사이의 통신들을 스위칭할 때, UE는 최근에 통신했던 네트워크로부 터 데이터를 더 이상 수신하지 못할 수 있다. 이러한 상황들은, 예컨대, 페이지들이 네트워크에 의해 전송되고 UE에서 적절히 수신되지 않으면, 또는 사용자들이 통신을 수신할 수 없는 동안 페이징 메시지들을 수신하도록 스케줄링되면, 성능에 부정적인 영향을 미칠 수 있다. 현존 시스템에서, 유니버셜 이동 통신 시스템(UMTS) 가입자 식별 모듈(들)(USIM(들)) 사이에서 그리고/또는 모 바일 네트워크 사업자(들) 사이에서 가능한/요구되는 조정이 없고 동일 또는 상이한 사업자들에 속할 수 있는 다수의 SIM들(예컨대, USIM(들))을 처리하기 위한 최적화가 없다. USIM(들)은 물리적 SIM 카드 또는 통합된 SIM 또는 내장형 가입자 식별 모듈(embedded Subscriber Identity Module, eSIM)일 수 있다. USIM(들)이 다양한 모 바일 네트워크 사업자들에 속할 수 있으므로, 모바일 네트워크 사업자(들)(예컨대, 네트워크 서버)는 다른 모바 일 네트워크 사업자(들)와 USIM(들) 데이터 (암시적) 공유에 관한 개인정보보호 우려를 가질 수 있다. 예를 들 어, 가입자 불법침입(poaching)을 피하기 위함이다. 더욱이, 지역별 법적 요건들/규칙들에 기초하여, 특정한 모 바일 네트워크 사업자(들)는 다른 모바일 네트워크 사업자(들)에게 USIM(들) 데이터(예컨대, 가입자(들) 데이터, 개인 정보, SIM 정보 등)를 제공하는 것에 관한 개인정보보호 우려를 가질 수 있다. 현존 시스템은 MUSIM 최적화들을 관리하기 위한 (예컨대, 다른 모바일 네트워크 사업자(들)와 USIM(들) 데이터를 공유하거나 또는 공유하지 않는) 임의의 최적의 메커니즘을 제공하지 않는다. 따라서, UE 및 네트워크에 의해 의도된 때에 만 MUSIM 최적화들을 개시/사용하기 위한 유용한 대안을 제공하는 것이 바람직하다. 본 개시에서의 실시예들의 주 목적은, 성능 개선을 위해 UE에서 다수의(하나를 초과하는) 활성 SIM들의 소유에 관한 정보를 공유/노출하기 위해 및/또는 하나의 사업자의 정보를 다른 사업자와 공유/다른 사업자에게 노출하 기 위해, 가입자(예컨대, UE/사용자)로부터 및/또는 홈 네트워크(Home Network, HN)(예컨대, 통합 데이터 관리 (Unified data management, UDM) 엔티티)로부터 및/또는 서빙 네트워크(Serving Network, SN)(예컨대, 액세스 및 이동성 관리 기능(AMF) 엔티티)로부터 동의를 획득하는 것이다. 본 개시의 실시예의 다른 목적은 UE, SN, 및 HN의 동의(들) 및 능력들에 기초하여 MUSIM 최적화들을 개시하는 것이다. UE의 능력은 UE가 MUSIM 최적화(하나 이상의 MUSIM 피처들)을 개시하도록 인가될 때 하나 이상의 MUSIM 피처들을 포함하며, 여기서 하나 이상의 MUSIM 피처들은 연결 해제 지원, 페이징 원인 지원, 페이징 제한 지원, 및 페이징 거부 지원을 포함한다.본 개시의 전체에 걸쳐, \"AMF 엔티티\" 및 \"AMF\"라는 용어들은 교환적으로 사용되고 동일한 것을 의미한다. \"UDM 엔티티\" 및 \"UDM\"이란 용어들은 교환적으로 사용되고 동일한 것을 의미한다. \"MUSIM 동의\" 및 \"동의\"라는 용어 들은 교환적으로 사용되고 동일한 것을 의미한다. \"네트워크 엔티티들\" 및 \"네트워크\"라는 용어들은 교환적으로 사용되고 동일한 것을 의미한다. \"MUSIM 최적화를 개시하도록 지시하는 것\" 및 \"동의\"는 교환적으로 사용되고 UE가 하나 이상의 MUSIM 최적화를 지원하고 사용할 의도가 있다는 것을 의미한다. \"MUSIM 최적화\"라는 용어는 MUSIM 최적화 능력들로서의 하나 이상의 다음 멀티-USIM 피처들 즉, 연결 해제, 페이징 원인, 페이징 제한 및 페이징 거부를 의미한다. \"MUSIM\" 및 \"멀티-SIM\"이란 용어는 교환적으로 사용되고 UE 내의 다수의 USIM들의 사 용을 의미한다. 기존의 방법들 및 시스템들에서, 사용자 장비(UE)의 사용자가 동일한 UE 내에 개인 USIM(들) 및 비즈니스 USIM (들)(즉, 전화 번호) 양쪽 모두 또는 다수의 USIM(들)을 가지는 옵션들을 가질 때 개인정보보호 우려가 발생한 다. 많은 비즈니스 USIM(들)/전화기(들)는 기업 정책들에 따라 비즈니스의 소유자로부터의 원격 제어/관리를 허 용할 것이고 임의의 USIM(들) 정보가 다른 모바일 네트워크 사업자(들)와 공유되는 것을 허용하지 않을 것이다. 추가적으로, 기업 직원들이 비즈니스 USIM(들)의 현재 세션들을 방해하는 금지하는 기업 정책이 있을 수 있다. 예를 들어, 개인 USIM(들)의 페이징 메시지에서 수신된 페이징 원인이 비즈니스 연결/비즈니스 USIM(들)의 액티 브 연결들을 중단시키지 않아야 하며, 이는 UE가 듀얼 활성 SIM들을 지원함을 드러낸다. 사용자가 두 사업자들(A 및 B)을 가입하거나 또는 UE가 듀얼 액티브 USIM(들)을 지원/사용하는 다른 예를 고려 한다. 이 경우, 사업자들(A 및 B)은 가입자가 두 개의 USIM(들)을 사용하고 있는지의 여부를 알지 못할 수 있다. UE가 사업자-A에게 사용자의 허가 없이 사용자가 사업자-B에게의 다른 가입을 이용하고 있다고 알리는 경 우. 그 경우, 사용자가 가치있는 고객이 아님을 또는 가입자가 가입을 그만둘 의도가 있음을 사업자-A가 알면, 사용자는 사업자-A가 우선 처리를 제공하지 않을 수 있다고 우려할 수 있다. 이러한 예에서, 현존 시스템은 UE 에서 MUSIM 최적화들을 관리하는(예컨대, 다른 모바일 네트워크 사업자(들)와 USIM(들) 데이터/개인 정보를 공 유하거나 또는 공유하지 않는)) 임의의 최적의 메커니즘을 제공하지 않는다. UE 및/또는 네트워크가 다른 모바일 네트워크 사업자(들)(예컨대, 서드파티 서버(들))와 USIM(들) 데이터를 공 유하기 원하는 다른 예를 고려한다. UE가 다른 USIM을 또한 이용하고 있음을 UE가 하나의 USIM을 사용하여 모바 일 네트워크 사업자에게 지시하는 경우, 모바일 네트워크 사업자가 다른 모바일 네트워크 사업자(들)와 협력할 때 개인정보보호 우려를 가지면 보안 우려가 있다. 모바일 네트워크 사업자가 UE의 아이덴티티들이 다른 모바일 네트워크 사업자(들)에 등록되지 않아야 함을 UE에게 알리면, UE는 그렇게 하도록 인가되지 않아야 한다. 협력 을 꺼리는 이유는 피처(들)가 지원되지 않는 경우와 또한 피처(들)을 지원하도록 모바일 네트워크 사업자를 업 데이트하지 않으려고 하는 경우 또는 약정(가입자로부터의 요청)에 기초하는 경우 또는 사용자의 낮은 요금제 가입(tariff subscription) 때문에 또는 가입 요금제(subscription tariff)에 기초하여(예컨대, 사용자가 선택 하면, UE(사용자)가 (사업자 A의) USIM 세부사항들을 사업자 B와 공유하기를 원하더라도 사업자 A는 세부사항들 을 공유하는 것을 허용해야 하고 이는, 예로, 특별히 정보 유형에 기초하여 세부사항들을 공유하는 것에 대해 요금을 부과하는 것, 애플리케이션 우선순위들을 유지하는 것 및 페이징의 원인을 지시하는 것 등과 같은 사업 자 간 과금에 따라 달라질 수 있다), 해당 특정 가입자에 대한 지원은 없다(예를 들어, 부가 가치 서비스들 (Value Added Services, VAS)이 없다)는 것일 수도 있다. 이러한 예에서, 현존 시스템은 UE, 모바일 네트워크 사업자, 및 다른 모바일 네트워크 사업자(들)에서 MUSIM을 관리하기 위한 임의의 최적의 메커니즘을 제공하지 않는다. 따라서, 본 개시에서의 실시예들은 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 지원하는 사용자 장비(U E)를 동작시키는 방법을 성취한다. 그 방법은, 액세스 및 이동성 관리 기능(AMF) 엔티티에 의해, UE의 능력 정 보를 포함하는 비-액세스 계층군(NAS) 요청 메시지를 수신하는 단계를 포함하며, 능력 정보는 UE에서 액티브 MUSIM의 수, UE에 의해 지원되는 MUSIM 피처들 및 UE에 의해 사용되도록 의도되는 MUSIM 피처들 중 적어도 하나 를 포함한다. 게다가, 그 방법은, AMF 엔티티에 의해, UE가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 AMF 가 개시하도록 인가할지의 여부 및 AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원할지의 여부를 결 정하는 단계를 포함한다. 게다가, 그 방법은, AMF 엔티티에 의해, AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원한다는 지시를 포함하는 NAS 응답 메시지를 전송하는 단계를 포함한다. 따라서, 본 개시에서의 실시예들은 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 지원하는 사용자 장비(U E)를 동작시키는 AMF 엔티티를 달성한다. AMF 엔티티는 프로세서 및 메모리와 커플링되는 MUSIM 최적화부를 포 함한다. MUSIM 최적화부는 UE의 능력 정보를 포함하는 비-액세스 계층군(NAS) 요청 메시지를 수신하며, 능력 정 보는 UE에서 액티브 MUSIM의 수, UE에 의해 지원되는 MUSIM 피처들 및 UE에 의해 사용되도록 의도되는 MUSIM 피처들 중 적어도 하나를 포함한다. 게다가, MUSIM 최적화부는 UE가 UE에 의해 사용되도록 의도되는 MUSIM 피처들 을 AMF가 개시하도록 인가할지의 여부와 AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원할지의 여부 를 결정한다. 게다가, MUSIM 최적화부는 AMF가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원한다는 지시 를 포함하는 NAS 응답 메시지를 전송한다. 따라서, 본 개시에서의 실시예들은 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 지원하는 UE를 달성한다. UE는 프로세서 및 메모리와 커플링되는 MUSIM 최적화부를 포함한다. MUSIM 최적화부는 UE의 사용자로부터의 입 력을 수신하며, 그 입력은 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되고 UE가 하나 이상의 MUSIM 피처 들을 개시하도록 인가되지 않음을 지시한다. 게다가, MUSIM 최적화부는 UE의 가입자 식별 모듈(SIM) 카드 관리 자 또는 UE의 SIM 애플리케이션 툴킷(SAT)에 입력을 저장한다. MUSIM 최적화부는 수신된 입력이 하나 이상의 MUSIM 피처들이 지원됨을 지시할 때 하나 이상의 MUSIM 피처들을 사용한다. 현존 방법들 및 시스템들과 달리, 제안된 방법은 UE/AMF/SDM이 가입자(예컨대, UE/사용자)로부터 및/또는 HN(예 컨대, UDM 엔티티)으로부터 및/또는 SN(예컨대, AMF 엔티티)으로부터 동의를 획득하는 것을 허용하여, 성능 개 선을 위해 UE에서 다수의(하나를 초과하는) 활성 SIM들의 소유에 관한 정보 및/또는 하나의 사업자의 정보를 다 른 사업자와 공유/에게 노출한다. 현존 방법들 및 시스템들과 달리, 제안된 방법은 UE/AMF/SDM이 UE, SN, 및 HN의 동의(들) 및 능력들에 기초하여 하나 이상의 MUSIM 피처들을 개시/사용하는 것을 허용한다. UE가 하나 이상의 MUSIM 피처들을 개시/사용하도록 네트워크에 대해 인가될 때 UE의 능력들은 하나 이상의 MUSIM 피처들을 포함하며, 여기서 하나 이상의 MUSIM 피 처들은 연결 해제 지원, 페이징 원인 지원, 페이징 제한 지원, 및 페이징 거부 지원을 포함한다. 제안된 방법에서 언급된 바와 같이, UE는 다음과 같이, 비제한적으로, 성능을 증가시키기 위해, UE에서의 다수 의(하나를 초과하는) 활성 SIM들의 소유에 관한 정보를 공유하도록, 또는 하나 이상의 MUSIM 피처들을 개시하도 록 허용된다: a. UE가 각각의 USIM들과 연관되는 네트워크들 양쪽 모두에서 유휴/비활성 모드에 있을 때 페이징의 수신으로 인한 충돌을 해결하기 위한 향상(들). b. UE는 (MUSIM 목적으로) 자신의 네트워크 A로부터의 스위치를 네트워크 A에게 통지함. c. 서비스가 VoLTE(Voice over Long-Term Evolution)인지 VoNR(Voice over New Radio)인지를 UE에게 지시하기 위한 착신 페이지. d. UE가 USIM B와 적극적으로 통신하는 동안 USIM A로 향하는 모바일 해지 서비스(Mobile Terminated servic e)의 처리. e. UE가 USIM B와 연관되는 3GPP 시스템을 일시적으로 떠난 다음, USIM A와 연관되는 3GPP 시스템에 네트워크- 제어 방식으로 복귀할 수 있도록, USIM A와 연관되는 3세대 파트너십 프로젝트(3GPP) 시스템에서 진행중인 연결 의 그만둠(leaving) 및 재개를 조정. f. MUSIM 디바이스에서 페이징 수신 가능화. g. 서비스 우선순위화, 즉, 페이징 정보 수신 시의 UE 동작이 USIM 설정 또는 사용자 선호사항들 또는 양쪽 모 두에 의해 구동되는지의 여부의 처리. 일 실시예에서, a~g에서 언급된 절차들은 연결 해제 지원, 페이징 원인 지원, 페이징 제한 지원, 페이징 거부 지원과 같은 하나 이상의 MUSIM 피처들 절차들에 속하며, 하나 이상의 MUSIM 피처들이라고 총칭된다. 일 실시예에서, 제안된 방법은 다수의(하나를 초과하는) 활성 SIM들의 소유에 관한 정보 및/또는 하나의 사업자 의 정보를 다른 사업자와 공유/에게 노출하기 위해, UE가 가입자로부터 및/또는 홈 네트워크(HN)로부터 및/또는 서빙 네트워크(SN)로부터 동의를 획득하는 것을 허용한다. 동의(또는 설정)는 하나 이상의 MUSIM 피처들을 획득 /제공하려는 사용자의 및/또는 네트워크의 의지가 있는지의 여부를 명시적으로 지시한다. SN은 하나 이상의 MUSIM 피처들을 제공할지의 여부를 결정하고, UE, HN, 및 SN이 하나 이상의 MUSIM 피처들을 할 수 있더라도, 사 용자의 동의/인가, HN의 인가/지시/동의, 및 SN의 정책(로컬 정책/동의)에 기초하여, 자신의 결정을 UE에게 지 시한다. 네트워크(즉, HN, SN)로부터의 지시에 기초하여, UE는 하나 이상의 MUSIM 피처들을 지원할지의 여부를 결정한다. UE와 네트워크는 MUSIM 최적화들(하나 이상의 MUSIM 피처들)을, a. 사용자가 사용자의 개인 정보를 개시하기 위한 동의를 제공하지 않으면; b. HN의 지시가 (가입에 기초하여 또는 SN과의 SLA에 기초하여) 가입을 위한 MUSIM 최적화를 지원/제공하지 않 으면; 및 c. SN의 지시가 가입자/로밍 가입자를 위한 MUSIM 최적화를 지원/제공하는 것을 선호하지 않으면, 제공/개시하지 않는다. 이제 도면들을, 그리고 더 상세하게는 유사한 참조 부호들이 도면들의 전체에 걸쳐 일관되게 대응하는 특징부들 을 나타내는 도 1a 내지 도 12를 참조하면, 바람직한 실시예들이 도시되어 있다. 도 1a는 본 개시에서 개시된 바와 같은 일 실시예에 따른, 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 개 시하기 위한 사용자 장비(UE)의 블록도를 예시한다. UE의 예들은, 스마트폰, 태블릿 컴퓨터, 개인 정 보 단말(Personal Digital Assistance, PDA), 사물 인터넷(IoT) 디바이스, 착용가능 디바이스 등을 포함하지만 그것들로 제한되지 않는다. 일 실시예에서, UE는 메모리, 프로세서, 통신부, MUSIM 최적화부, 및 복수의 SIM들 을 포함한다. 일 실시예에서, 메모리는, 하나 이상의 MUSIM 피처들에 대한 사용자 입력/동의, UE의 능력, UE 에서의 활성 SIM들의 수, 및 UE 중 하나가 하나 이상의 MUSIM 피처들을 개시하도록 인가되고, UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되지 않음을 지시하는 정보를 저장한다. 메모리는 프로세서 에 의해 실행될 명령들을 저장한다. 메모리는 비휘발성 저장 엘리먼트들을 포함할 수 있다. 이러한 비휘발성 저장 엘리먼트들의 예들은 자기적 하드 디스크들, 광학적 디스크들, 플로피 디스크들, 플래시 메모리 들, 또는 EPROM(electrically programmable memories) 또는 EEPROM(electrically erasable and programmable memories)의 형태들을 포함할 수 있다. 추가적으로, 메모리는, 일부 예들에서, 비-일시적 저장 매체로 간 주될 수 있다. \"비일시적\"이란 용어는 저장 매체가 반송파 또는 전파되는 신호로 구현되지 않음을 나타낼 수 있 다. 그러나, \"비일시적\"이란 용어는 메모리가 비이동성인 것으로 해석되지 않아야 한다. 일부 예들에서, 메모리는 메모리보다 더 많은 양의 정보를 저장하도록 구성될 수 있다. 특정한 예들에서, 비일시적 저장 매체가 (예컨대, RAM(Random Access Memory) 또는 캐시에) 시간 경과에 따라 변할 수 있는 데이터를 저장할 수 있다. 메모리는 내부 저장소 유닛일 수 있거나 또는 이는 UE의 외부 저장소 유닛, 클라우드 저장소, 또는 임의의 다른 유형의 외부 저장소일 수 있다. 프로세서는 메모리, 통신부, 및 MUSIM 최적화부, 그리고 복수의 SIM들과 통신한다. 프로세서는 메모리에 저장되는 명령들을 실행하고 다양한 프로세스들을 수행한다. 프로세서는 하나 또는 복수의 프로세서들을 포함할 수 있으며, 범용 프로세서, 이를테면 중앙 프로세싱 유닛(central processing unit, CPU), 애플리케이션 프로세서(application processor, AP) 등, 그래픽스 전용 프로세싱 유닛 이를테면 그래픽 프로세싱 유닛(graphics processing unit, GPU), 시각적 프로세싱 유닛(visual processing unit, VPU), 및/또는 인공지능(Artificial intelligence, AI) 전용 프로세서 이를테면 신경 프로세싱 유닛 (neural processing unit, NPU)일 수 있다. 통신부는 내부 하드웨어 컴포넌트들 사이에서 내부적으로 그리고 하나 이상의 네트워크들(예컨대, 라디오 기술)을 통해 외부 디바이스들(예컨대, eNodeB, gNodeB, 서버, AMF, UDM 등)과 통신하도록 구성된다. 통신부 는 유선 또는 무선 통신을 가능하게 하는 표준에 특화된 전자 회로를 포함한다. MUSIM 최적화부는 로직 게이트들, 집적 회로들, 마이크로프로세서들, 마이크로제어기들, 메모리 회로들, 수동 전자 컴포넌트들, 능동 전자 컴포넌트들, 광학적 컴포넌트들, 하드와이어드 회로들 등과 같은 프로세싱 회 로에 의해 구현되고, 펌웨어에 의해 옵션적으로 구동될 수 있다. 그 회로들은, 예를 들어, 하나 이상의 반도체 칩들 내에, 또는 인쇄 회로 보드들 등과 같은 기판 지지물들 상에 실시될 수 있다. MUSIM 최적화부는 하나 이상의 MUSIM 피처들 지원 지시가 AMF 엔티티(200c)로부터 수신되는지의 여부를 결 정한다. 게다가, MUSIM 최적화부는 하나 이상의 MUSIM 피처들 지원 지시가 AMF 엔티티(200c)로부터 수신될 때 하나 이상의 MUSIM 피처들을 사용하는 것과, 하나 이상의 MUSIM 피처들 지원 지시가 AMF 엔티티(200c)로부터 수신되지 않을 때 하나 이상의 MUSIM 피처들을 사용하지 않는 것 중 하나를 수행한다. 게다가, MUSIM 최적화부는 UE의 사용자로부터 입력을 수신하며, 그 입력은 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되고 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가되지 않음을 지시 한다. 게다가, MUSIM 최적화부는 그 입력을 UE의 가입자 식별 모듈(SIM) 카드 관리자 또는 UE의SIM 애플리케이션 툴킷(SAT)에 저장한다. 게다가, MUSIM 최적화부는 수신된 입력이 하나 이상의 MUSIM 피 처들이 지원됨을 지시할 때 하나 이상의 MUSIM 피처들을 사용한다. 비록 도 1a가 UE의 다양한 하드웨어 컴포넌트들을 도시하지만 다른 실시예들이 그것으로 제한되지 않음이 이해되어야 한다. 다른 실시예들에서, UE는 더 적거나 또는 더 많은 수의 컴포넌트들을 포함할 수 있다. 게다가, 컴포넌트들의 라벨들 또는 이름들은 예시 목적으로만 사용되고 본 개시의 범위를 제한하지 않는다. 하 나 이상의 컴포넌트들은 하나 이상의 MUSIM 피처들을 개시하기 위해 동일한 또는 실질적으로 유사한 기능을 수 행하도록 함께 결합될 수 있다. 도 1b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 액세스 및 이동성 관 리 기능(AMF) 엔티티(200c)의 블록도를 예시한다. 일 실시예에서, AMF 엔티티(200c)는 메모리(210c), 프로세서(220c), 통신부(230c), 및 MUSIM 최적화부(240c)를 포함한다. 일 실시예에서, 메모리(210c)는 MUSIM 최적화를 위한 사용자 입력/동의, UE의 능력, UE에서의 활성 SIM들의 수, 및 UE 및/또는 UDM(200b) 중 하나가 MUSIM 최적화(즉, 하나 이상의 MUSIM 피처들)를 개시하 도록 인가되고, UE 및/또는 UDM(200b)이 MUSIM 최적화를 개시하도록 인가되지 않음을 지시하는 정보를 저 장한다. 메모리(210c)는 프로세서(220c)에 의해 실행될 명령들을 저장한다. 메모리(210c)는 비휘발성 저장 엘리 먼트들을 포함할 수 있다. 이러한 비휘발성 저장 엘리먼트들의 예들은 자기적 하드 디스크들, 광학적 디스크들, 플로피 디스크들, 플래시 메모리들, 또는 EPROM(electrically programmable memories) 또는 EEPROM(electrically erasable and programmable memories)의 형태들을 포함할 수 있다. 추가적으로, 메모리 (210c)는, 일부 실시예들에서, 비일시적 저장 매체로 간주될 수 있다. \"비일시적\"이란 용어는 저장 매체가 반송 파 또는 전파되는 신호로 구현되지 않음을 나타낼 수 있다. 그러나, \"비일시적\"이란 용어는 메모리(210c)가 비 이동성인 것으로 해석되지 않아야 한다. 일부 예들에서, 메모리(210c)는 메모리보다 더 많은 양의 정보를 저장 하도록 구성될 수 있다. 특정한 예들에서, 비일시적 저장 매체가 (예컨대, RAM(Random Access Memory) 또는 캐 시에) 시간 경과에 따라 변할 수 있는 데이터를 저장할 수 있다. 메모리(210c)는 내부 저장소 유닛일 수 있거나 또는 이는 AMF 엔티티(200c)의 외부 저장소 유닛, 클라우드 저장소, 또는 임의의 다른 유형의 외부 저장소일 수 있다. 프로세서(220c)는 메모리(210c), 통신부(230c), 및 MUSIM 최적화부(240c)와 통신한다. 프로세서(220c)는 메모 리(210c)에 저장된 명령들을 실행하고 다양한 프로세스들을 수행한다. 프로세서(220c)는 하나 또는 복수의 프로 세서들을 포함할 수 있으며, 범용 프로세서, 이를테면 중앙 프로세싱 유닛(CPU), 애플리케이션 프로세서(AP) 등, 그래픽스 전용 프로세싱 유닛 이를테면 그래픽 프로세싱 유닛(GPU), 시각적 프로세싱 유닛(VPU), 및/또는 인공지능(AI) 전용 프로세서 이를테면 신경 프로세싱 유닛(NPU)일 수 있다. 통신부(230c)는 내부 하드웨어 컴포넌트들 사이에서 내부적으로 그리고 하나 이상의 네트워크들(예컨대, 라디오 기술)을 통해 외부 디바이스들(예컨대, eNodeB, gNodeB, 서버, UE, UDM 등)과 통신하도록 구성된다. 통신부 (230c)는 유선 또는 무선 통신을 가능하게 하는 표준에 특화된 전자 회로를 포함한다. MUSIM 최적화부(240c)는 로직 게이트들, 집적 회로들, 마이크로프로세서들, 마이크로제어기들, 메모리 회로들, 수동 전자 컴포넌트들, 능동 전자 컴포넌트들, 광학적 컴포넌트들, 하드와이어드 회로들 등과 같은 프로세싱 회 로에 의해 구현되고, 펌웨어에 의해 옵션적으로 구동될 수 있다. 그 회로들은, 예를 들어, 하나 이상의 반도체 칩들 내에, 또는 인쇄 회로 보드들 등과 같은 기판 지지물들 상에 실시될 수 있다. 일 실시예에서, MUSIM 최적화부(240c)는 UE의 능력 정보를 포함하는 비-액세스 계층군(NAS) 요청 메시지를 수신하며, 능력 정보는 UE에서의 액티브 MUSIM의 수, UE에 의해 지원되는 MUSIM 피처들 및 UE 에 의해 사용되도록 의도되는 MUSIM 피처들 중 적어도 하나를 포함한다. 게다가, MUSIM 최적화부(240c)는 UE가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 AMF 엔티티(200c)가 개시하도록 인가할지 의 여부와, AMF 엔티티(200c)가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원할지의 여부를 결정한 다. 게다가, MUSIM 최적화부(240c)는 AMF 엔티티(200c)가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지원한다는 지시를 포함하는 NAS 응답 메시지를 전송한다. 게다가, MUSIM 최적화부(240c)는 AMF 엔티티(200c)가 UE에 의해 사용되도록 의도되는 MUSIM 피처들을 지함 을 지시하는 N2 메시지를 라디오 액세스 네트워크(RAN) 노드(200A)에게 전송한다. AMF 엔티티(200c)는 미리 설정된 로컬 정책 또는 선호 정책 중 하나에 기초하여 UE에 의해 사용되도록 의 도되는 MUSIM 피처들의 지원을 결정한다. 로컬 정책 또는 선호 정책은 네트워크(예를 들어, AMF, gNB 등)가 MUSIM 피처들을 지원하는지의 여부와, 네트워크가 지원하더라도, AMF가 MUSIM 향상들을 UE들에게 제공하도 록 허용되는지의 여부를 지시하는 미리 설정된 로컬 정책 또는 선호 정책이다. 미리 설정된 로컬 정책 또는 선 호 정책은 특정한 MUSIM 피처들만을 허용할 수 있고 특정한 MUSIM 피처들을 허용하지 않을 수 있다. UE는 등록 수락 메시지를 수신하는 것에 기초하여 AMF 엔티티(200c)에 의해 지원되는 MUSIM 피처들을 사용한다. UE에 의해 지원되는 하나 이상의 MUSIM 피처들은 연결 해제, 페이징 원인, 페이징 제한 및 페이징 거부 중 적어 도 하나를 지원하는 것을 포함한다. NAS 요청 메시지는 등록 요청 메시지이고 NAS 응답 메시지는 등록 수락 메 시지이다. 게다가, MUSIM 최적화부(240c)는 UE가 하나 이상의 MUSIM 피처들을 개시하도록 인가하지 않는다고 결정하 는 것에 응답하여 하나 이상의 MUSIM 피처들을 개시하지 않는 것과. UE가 하나 이상의 MUSIM 피처들을 개 시하도록 인가한다고 결정하는 것에 응답하여 AMF 엔티티(200c)가 하나 이상의 MUSIM 피처들을 개시하도록 인가 되는지의 여부를 결정하는 것 중 하나를 수행한다. 게다가, MUSIM 최적화부(240c)는, AMF 엔티티(200c)가 하나 이상의 MUSIM 피처들을 개시하도록 인가되지 않는다고 결정하는 것에 응답하여 하나 이상의 MUSIM 피처들을 개 시하지 않는 것과, AMF 엔티티(200c)하나 이상의 MUSIM 피처들을 개시하도록 인가된다고 결정하는 것에 응답하 여 MUSIM 최적화에 대한 지원을 개시하는 것과, MUSIM 최적화 지원 지시를 UE에게 전송하는 것, 중 하나를 수행한다. 일 실시예에서, MUSIM 최적화를 개시하는 것을 지시하는 것은 UE가 하나 이상의 MUSIM 최적화 지원하고 사 용할 의도가 있다는 것을 지시한다. UE의 하나 이상의 MUSIM 피처들은 UE가 연결 해제, 페이징 원인, 페이징 제한 및 페이징 거부 중 적어도 하나를 MUSIM 최적화 능력들로서 지원함을 지시한다. UE의 하나 이 상의 MUSIM 피처들은 UE 중 적어도 하나가 멀티-USIM 피처들의 능력들을 가짐과 UE가 하나 이상의 멀 티-USIM 피처들을 지원하지 않음을 지시한다. UE의 하나 이상의 MUSIM 피처들은 하나 이상의 SIM을 갖는 UE가 요구되지 않는 경우 하나 이상의 MUSIM 피처들을 받지 않음을 지시한다. 도 1b가 AMF 엔티티(200c)의 다양한 하드웨어 엘리먼트들을 도시하지만 다른 실시예들이 그것으로 제한되지 않 음이 이해되어야 한다. 다른 실시예들에서, AMF 엔티티(200c)는 더 적거나 또는 더 많은 수의 컴포넌트들을 포 함할 수 있다. 게다가, 컴포넌트들의 라벨들 또는 이름들은 예시 목적으로만 사용되고 본 개시의 범위를 제한하 지 않는다. 하나 이상의 컴포넌트들은 하나 이상의 MUSIM 피처들을 개시하기 위해 동일하거나 또는 실질적으로 유사한 기능을 수행하기 위해 함께 결합될 수 있다. 일 실시예에서, 듀얼 USIM 디바이스(즉, UE)의 경우, 페이징 메시지에 페이징 원인이 포함되고, 단일 USIM 디바이스(즉, UE)의 경우, 페이징 원인이 포함되지 않으며, 그러면 페이징 원인을 포함하는 것에 의해 사 용자의 사적인 정보를 암시적으로 노출시키는 것은 위협이 될 것이다. 사용자는 자신의 페이징 원인을 추적하기 를 원하지 않고, 그러면 사용자는 UE를 듀얼 USIM 가능한 것으로서 선택하지 않고 그래서 듀얼 USIM이 활 성화된 듀얼 USIM 디바이스는 사용자가 선택할 수 있어야 함을 네트워크(200a/200b/200c)에게 지시하지 않을 수 있다. 세부사항들을 공유하거나 또는 사용자 동의를 제공하기 위한 조건은 다음(중 하나)에 기초해야 한다: a. 홈 내(In-Home) 네트워크(예컨대, UDM 엔티티(200b)): 가입자/사용자 정보는 사업자들 사이의 세부사항들을 공유할지의 여부가 다음 중 하나에 기초해야 하는지를 지시해야 한다: . 가입자들 동의(네트워크(200a/200b/200c) 및 UE가 지원하더라도, 사용자는 이 정보를 공유할 의사가 없음); 및 . UDM(200b)의 동의/인가(비즈니스 관계, 가입 요금제에 기초함). b. 서빙중(In-Serving) 네트워크(예컨대, AMF 엔티티(200c)): 가입 정보와 함께, UE에 의해 요구되는 MUSIM 동작들을 지원할 AMF 엔티티 능력, 자신의 동의, 및 UDM 엔티티(200b)와의 자신의 정책이 고려되어야 한 다. 일 실시예에서, 자신의 네트워크의 정보를 다른 네트워크 사업자들과 공유할지의 여부의 지시가 UDM 엔티티 (200b) 및/또는 AMF 엔티티(200c)에 의해 UE에게 전송되어야 한다. UDM 엔티티(200b) 및/또는 AMF 엔티티 (200c)는 \"허용된 공공 육상 이동 네트워크(Public Land Mobile Network, PLMN)의 ID들의 리스트\" 및/또는 \"금 지된 PLMN ID들의 리스트\"를 UE에게 제공할 수 있고, 그것에 기초하여 UE는 USIM 정보 및/또는 요청 을 공유하고 및/또는 다른 네트워크 사업자들과의 MUSIM 최적화들을 요청하고 획득한다. 일 실시예에서, 본 명세서에서 제공되는 솔루션들(도 2 내지 도 15)은 HPLMN들이 상이하거나 또는 동일함에 무 관하게, 가입 기준으로 수행된다. 일 실시예에서, 인가 정보/지시는 해당 USIM에게만 적용되고, 해당 USIM에 관련된 정보는, 다른 USIM(15 0)이 하나 이상의 MUSIM 피처들을 획득하도록 인가되더라도, 인가되지 않으면, 사용되지 않아야 한다. 솔루션을 가지기 위해 상이한 솔루션 대안들로부터의 단계들을 결합하는 것이 가능해야 한다. 도 2는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 방법을 예시하는 순서 도이다. 이 시나리오에서, 그 방법은 UE, UDM(200b)(즉, 홈 네트워크(HN)), 및 AMF(200c)(즉, 서빙 네트워크(SN)) 중 하나가 MUSIM 최적화/지원을 할 수 있다고 가정된다. UE의 사용자(가입자)는 일부 수단들에 의해 UDM(200b)에게 사용자의 동의를 제공했다. 예를 들어, 가입 구매 프로세스 동안 또는 단문 메시지 서비스(Short Message Service, SMS)를 통해 또는 UDM(200b)의 포털에 대한 웹 인터페이스를 통해 UDM(200b)에게 사용자의 동의를 지시했다. 그러나, 사용자의 동의에 기초하여, AMF(200c)는 MUSIM 최적화들을 제공할지의 여부를 결정할 수 있고, AMF(200c)는 결정을 UE에게 지시한다. AMF(200c)로부터 수신된 지시에 기초하여, UE는 MUSIM 최적화들을 지원할지의 여부를 결정한다. UE의 사용자가 자신의 정보를 개시하기 위한 동의를 제공 하지 않으면, UE 및 네트워크(예컨대, UDM(200b), AMF(200c))는 MUSIM 최적화들을 지원하지 않는다. 단계 201에서, UE는 MUSIM 동의 정보를 UDM(200b)에게 제공한다. MUSIM 동의 정보는 UE가 MUSIM 최 적화를 제공하는지의 여부(즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의도가 있는지 의 여부)를 포함한다. 단계 202에서, UE는 등록 요청 메시지를 AMF(200c)에게 전송함으로써 등록 절차를 개시한다. UE는 이 메시지에서 등록을 위해 요구되는 필요한 절차를 포함한다. 단계 203에서, 등록 절차의 일부로서, UDM(200b)는, AMF(200c)에 의해 요청되면, AMF(200c)에게 가입 데이터를 제공한다. 가입 데이터는 MUSIM 최적화들을 사용/제공할지의 여부를 포함하는 MUSIM 동의 정보를 가질 수 있다. UDM(200b)에 의해 가입 데이터에서 제공되는 MUSIM 동의 정보에 추가적으로 또는 그 MUSIM 동의 정보에 대한 대안으로서, 정책 제어 기 능부(Policy Control function, PCF)는 MUSIM 최적화들을 지원할지의 여부에 대한 MUSIM 동의 정보 및/또는 로 컬 정책에 관한 정보를 AMF(200c)에게 제공한다. 단계 204에서, AMF(200c)는 MUSIM 최적화들을 개시할지의 여부를 결정한다. AMF(200c)는 가입 데이터에서 및/또 는 PCF-제공 정책들에서 제공되는 정보에 기초하여 MUSIM 최적화들을 진행한다. 단계 205에서, AMF(200c)는 UE에게 MUSIM 최적화들을 지원/개시할지의 여부를 지시하는 등록 수락 메시지 를 전송한다. 일 실시예에서, (도 2, 단계 205에서) AMF(200c)에 의해 제공되는 MUSIM 동의 정보에 추가적으로 또는 그 MUSIM 동의 정보에 대한 대안으로서, PCF는 UE 설정 업데이트 절차를 사용하여 MUSIM 동의 또는 인가에 대한 정보를 UE에게 제공한다. 일 실시예에서, MUSIM 최적화들을 위한 인가 정보/지시는, UE 컨텍스트 셋 업/수정 절차를 사용하여, AMF(200c)에 의해 RAN(eNB/gNB)(200a)에게 제공된다. RAN(200a)이 MUSIM 최적화가 인가된다는 정보/지시를 수신하는 경우에만, RAN(200a)은 MUSIM 최적화들을 UE에게 제공한다. 일 실시예에 서, AMF(200c)로부터 UE로의 지시의 예시된 표현은 표 1에서 도시된다. 표 1 속성 이름 데이터 유형 디스크립션 MUSIM 최적화 부울 이는 UE에는 연관된 USIM/가입에 대한 MUSIM 최적화가 허용됨 을 지시한다. 참 또는 \"1\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들 이 허용됨을 지시한다. 거짓 또는 부재 또는 \"0\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들이 허용되지 않음을 지시한다. 단계 206에서, 임의의 MUSIM 최적화 관련 절차를 사용하지 말라는 지시를 수신하는 것에 응답하여, UE는 임의의 이러한 절차들을 개시 또는 사용하지 않아야 한다. 도 3은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 이 시나리오에서, UE는 사용자가 MUSIM 최적화들에 대한 동의를 제공했는지의 여부를 결정하고 UE는 하나를 초과하는 USIM들이 활성화된다고 결정하고 사용자 동의 세부사항들(즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의도가 있는지의 여부)을 AMF(200c)에게 제공한다. 마찬가지로, UDM(200b)은 UDM(200b)의 동의 또는 UDM(200b)의 인가를 AMF(200c)에게 제공하여, MUSIM 최적화들을 UE에 게 제공할 수 있다. UDM(200b)은 자신의 동의 또는 인가를 AMF(200c)에게 가입 데이터의 일부로서 제공할 수 있 다. 수신된 사용자의 동의 및/또는 인가에 기초하여, AMF(200c)는 MUSIM 최적화들을 제공할지의 여부를 결정하고 결 정을 UE에게 지시한다. AMF(200c)의 지시에 기초하여, UE는 MUSIM 최적화들을 지시/사용할지의 여부 를 결정한다. 사용자(즉, UE)가 동의를 제공하지 않거나 또는 UE와 연관되는 정보를 개시할 의도가 없음을 명시적으로 지시하면, UE 및 네트워크(200a/200b/200c)는 MUSIM 최적화들을 지원/사용하지 않는다. 단계 301에서, UE는 하나를 초과하는 USIM들이 활성화되는 것으로 결정한다. 단계 302에서, UE 는 사용자가 MUSIM 최적화를 획득하기 위해 사용자의 의지(의도)를 제공했는지의 여부에 대한 사용자의 동의/설 정 정보를 결정한다. 일 실시예에서, 모든 초기 등록 절차에 대해, UE는 MUSIM 최적화들을 개시/사용하기 전에 사용자의 동의를 요청한다. 더욱이, UE는 USIM으로부터 MUSIM 최적화를 개시/요청할지의 여부의 사용 자의 동의를 결정한다. UDM(200b)은 에어 메커니즘을 통해 및/또는 원격 SIM 프로비저닝 메커니즘을 통해 및/또 는 UDM-제어 평면 절차를 통해 UE-파라미터 업데이트를 사용하여 사용자의 동의 정보/지시를 USIM에게 제공할 수 있다. 사용자는 일부 수단들에 의해 UDM(200b)에게 사용자의 동의를 제공했다. 예를 들어, 가입 구매 프로세 스 동안 또는 SMS를 통해 또는 UDM(200b)의 포털에 대한 웹 인터페이스를 통해 UDM(200b)에게 사용자의 동의를 지시했다. 단계 303에서, UE는 MUSIM 동의 정보(즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용 할 의도가 있는지의 여부) 및/또는 MUSIM 최적화에 대한 요청을 NAS 메시지에서 AMF(200c)에게 전송한다. NAS 메시지는 지시(즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의도가 있는지의 여부) 및 /또는 MUSIM 최적화에 대한 요청을 포함할 수 있고 및/또는 하나를 초과하는 USIM들이 UE에서 현재 활성화된다는 지시를 포함할 수 있다. 한편, 단계 304에서, UDM(200b)은 서비스-기반 메시지에서 가입 데이터를 AMF(200c)에게 제공할 수 있다(이는 등록 절차의 일부일 수 있다). 가입 데이터는 옵션적으로 MUSIM 최적화를 사용/제공할지의 여부를 포함하는, UDM(200b)로부터의 MUSIM 동의/인가 정보를 가진다. 단계 305에서, 사용자의 동의(UE에 의해 제공됨) 또는 UDM(200b) 중 어느 하나가 동의/인가를 제공하지 않 으면, AMF(200c)는 MUSIM 관련된 절차(즉, MUSIM 최적화 메커니즘)를 진행하지 않는다. 만약 사용자의 동의 인 가/지시가 설정되고(긍정 또는 인가됨; (즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의도가 있고)) AMF(200c)가 MUSIM 최적화를 지원하지 않으면, AMF(200c)는 임의의 MUSIM 최적화 메커니즘을 개 시하지 않는다. 단계 306에서, AMF(200c)는 MUSIM 최적화 메커니즘(들)을 지원/개시/요청하는지의 여부를 UE에게 지시하는 등록 수락 메시지(예컨대, NAS 메시지)를 전송한다. 일 실시예에서, MUSIM 최적화들을 위한 인가 정보/지시는, UE 컨텍스트 셋업/수정 절차를 사용하여, AMF(200c)에 의해 RAN(200a)에게 제공된다. RAN(200a)이 MUSIM 최적 화가 인가된다는 정보/지시를 수신하는 경우에만, RAN(200a)은 MUSIM 최적화들을 UE에게 제공한다. 단계 307에서, 임의의 MUSIM 최적화 메커니즘(들)을 사용하지 않도록 지시되면, UE는 임의의 MUSIM 최적화 메커 니즘(들)을 개시/사용하지 않는다. 도 4는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 이 시나리오에서, UE는 사용자의 동의, 네트워크로부터 수신된 UDM(200b), 및/또는 AMF(200c) 인가에 기초 하여 MUSIM 관련된 절차들을 개시할지의 여부를 결정한다. 대체 실시예에서, UDM(200b)은 UPU(UE 파라미터들 업 데이트) 절차들을 사용하여 직접 UE에게 MUSIM 최적화들을 수행할지의 인가를 제공한다. 다른 대체 실시예 에서, UDM(200b)은 MUSIM 최적화들을 사용할지의 여부를 USIM에 미리 설정한다. 단계 401에서, UE는 MUSIM 동의 정보를 UDM(200b)에게 제공한다. MUSIM 동의 정보는 MUSIM 최적화를 제공 /획득할지의 여부를 포함한다. 단계 402에서, UDM(200b)은 AMF(200c)에게 가입 데이터를 제공한다. 가입 데이터 는 MUSIM 최적화를 사용/제공할지의 여부를 포함하는, UDM(200b)로부터의 MUSIM 동의 정보를 가진다. 여기서 가 입 데이터에서 값 \"0\"을 갖는 \"사용자\"는 사용자가 MUSIM 최적화들을 제공하기 위한 동의를 제공하지 않는 것으 로 지시한다. 가입 데이터에서 값 \"1\"을 갖는 \"사용자\"는 사용자가 MUSIM 최적화들을 제공하기 위한 동의를 제 공하는 것으로 지시한다. 유사하게 값 \"1\"을 갖는 \"HN\"은 UDM(200b)이 인가를 제공함을 지시하고, 값 \"0\"을 갖는 \"HN\"은 MUSIM 최적화가 UDM(200b)에 의해 인가되지 않음을 지시한다. 예시된 표현은 표 2에서 도시된다. 표 2 속성 이름 데이터 유형 디스크립션 MUSIM 사용자 부울 이는 사용자-제공 동의와 UE에는 연관된 USIM/가입에 대한 MUSIM 최적화가 허용됨을 지시한다. 참 또는 \"1\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들이 허용됨을 지시한다. 거짓 또는 부재 또는 \"0\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들이 허용되지 않음을 지시한다. MUSIMHN 부울 이는 UE에는 연관된 USIM/가입에 대한 MUSIM 최적화가 허용됨을 지 시한다. 참 또는 \"1\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들이 허용됨을 지시한다. 거짓 또는 부재 또는 \"0\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들이 허용되지 않음을 지시한다. 일 실시예에서, UDM(200b)의 인가는 사용자의 동의 정보를 포함하고 사용자의 동의에 대한 명시적인 지시가 없 거나 또는 그 반대의 경우도 마찬가지이다. 값 \"1\"을 갖는 \"HN\"은 UDM(200b)이 인가를 제공하고 MUSIM 최적화들 을 제공하기 위해 사용자 동의를 사용자가 제공함을 지시한다. \"0\"을 갖는 \"HN\"은 MUSIM 최적화가 UDM(200b)에 의해 인가되지 않고 및/또는 사용자가 동의를 제공하지 않음을 지시한다. 예시된 표현은 표 2에 있다. 단계 403에서, 사용자의 동의 또는 UDM(200b)의 인가 중 어느 하나가 제공되지 않으면, AMF(200c)는 MUSIM 최적 화 메커니즘(들)을 진행하지 않을 수 있다. 만약 사용자 및 UDM(200b) 지시 둘 다가 설정되고(긍정 또는 인가되 고) AMF(200c)가 MUSIM 최적화를 지원하지 않으면, AMF(200c)는 임의의 MUSIM 최적화 메커니즘(들)을 개시하지 않는다. 단계 404~405에서, AMF(200c)는 사용자, UDM(200b), 및 AMF(200c)의 동의에 관해 UE에게 (NAS 메 시지, 예를 들어, 등록 수락을 사용하여) 지시한다. 동의/인가 중 어느 하나가 설정(긍정 또는 인가)되지 않으 면, UE는 임의의 MUSIM 최적화 메커니즘(들)을 지원하지 않을 수 있다. 단계 406~407에서, 대안적으로, AMF(200c)가 임의의 MUSIM 관련된 절차를 사용하지 말 것(즉, MUSIM 최적화 (들)가 인가되지 않음)을 UE에게 (NAS 메시지, 예를 들어, 등록 수락을 사용하여) 지시하면, UE는 MUSIM 최적화 절차들을 개시하지 않는다. AMF(200c)가 MUSIM 최적화가 인가됨을 지시하면, UE는 네트워크 로부터(RAN(200a)으로부터 또는/및 코어 네트워크로부터) 임의의 MUSIM 최적화를 개시/요청한다. 이 대안적인 단계 406~407에서, AMF(200c)는, PCF에 의해 제공될 수 있는 또는 국부적으로 이용 가능한 로컬 정 책에 기초하여 사용자의 동의, UDM(200b), 및 AMF(200c)로부터의 인가가 있는 경우에만, 모든 정보를 지시 속으 로 인가된 것으로서 결합한다. 만약 사용자 동의가 이용 가능하지 않거나 또는 UDM(200b) 인가하고 있지 않거나 또는 로컬 정책이 허용하지 않으면, AMF(200c)는 임의의 MUSIM 최적화 메커니즘(들)을 사용하지 말 것을 UE에게 지시한다. 일 실시예에서, 이 방법에서 제공되는 모든 대안들에 대한 MUSIM 최적화에 대한 인가에 대해 사용자 동의만이 고려된다. 일 실시예에서, MUSIM 최적화들을 위한 인가 정보/지시는, UE 컨텍스트 셋업/수정 절차를 사용하여, AMF(200c) 에 의해 RAN(200a)에게 제공된다. RAN(200a)이 MUSIM 최적화가 인가된다는 정보/지시를 수신하는 경우에만, RAN(200a)은 MUSIM 최적화들을 UE에게 제공한다. 도 5는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 이 시나리오에서, 사용자는 일부 수단들에 의해 UDM(200b)에게 사용자의 동의를 제공했다. 예를 들어, 가입 구 매 프로세스 동안 또는 SMS를 통해 또는 UDM(200b)의 포털에 대한 웹 인터페이스를 통해 UDM(200b)에게 지시했 다. UE는 하나를 초과하는 USIM들이 활성화됨을 결정하고, 활성화되는 하나를 초과하는 USIM들 이 있다는 지시를 AMF(200c)에게 제공한다. UDM(200b)은 UDM(200b)의 동의 또는 인가의 세부사항들을 AMF(200c)에게 제공하여, MUSIM 최적화들을 UE에게 제공한다. UDM(200b)은 자신의 동의 또는 인가를 AMF(200c)에게 가입 데이터의 일부로서 제공한다. 수신된 사용자 동의 및/또는 인가에 기초하여, AMF(200c)는MUSIM 최적화들을 제공할지의 여부를 결정하고, 자신의 결정을 UE에게 지시한다. UE의 지시에 기초하 여, UE는 MUSIM 최적화들을 지원할지의 여부를 결정한다. 사용자가 자신의 정보를 개시하기 위한 동의를 제공하지 않으면, UE 및 네트워크(200a/200/200c)는 MUSIM 최적화들을 지원하지 않는다. 단계 501에서, UE는 MUSIM 동의 정보를 AMF(200c)에게 제공한다. MUSIM 동의 정보는 MUSIM 최적화를 제공 할지의 여부를 포함한다. 단계 502에서, UE는 하나를 초과하는 USIM들이 UE에서 활성화되는 것으로 결정한다. 단계 503에서, UE는 하나를 초과하는 USIM들이 현재 활성화된다는 지시를 포함하는 NAS 메시지, 또는 MUSIM 최적화들을 위한 UE 요청을 전송한다(예를 들어, UE는 USIM1의 등록 컨텍스트를 위한 식별자(예컨대, USIM1 GUTI(Globally Unique Temporary ID))를 전송한다. 한편, 단계 504에서, UDM(200b)은, 등록 절차의 일부로서, 서비스-기반 메시지에서 가입 데이터를 AMF(200c)에 게 제공한다. 가입 데이터는 MUSIM 최적화 메커니즘(들)을 사용할지의 여부를 포함하는, UDM(200b)으로부터의 MUSIM 동의 정보를 가진다. UDM(200b) 인가는 또한 사용자 동의 정보(예컨대, 사용자의 동의 및 UDM의 동의)를 포함하거나 또는 사용자 동의 정보만을 포함한다. UDM(200b)이 MUSIM이 인가됨을 지시하면 이는 UDM(200b)이 인 가를 제공하고 또한 MUSIM 최적화들을 제공하기 위한 사용자-제공 동의를 지시함을 의미한다. MUSIM 인가된 지 시/정보가 없으면, 이는 MUSIM 최적화가 UDM(200b)에 의해 인가되지 않고 및/또는 사용자가 동의를 제공하지 않 음을 의미한다. 예시된 표현은 표 3에 있다. 표 3 속성 이름 데이터 유형 디스크립션 MUSIMHN 부울 이는 UE에는 연관된 USIM/가입에 대한 MUSIM 최적화가 허용됨을 지시한다. 참 또는 \"1\": UE에는 연관된 USIM/가입에 대한 MUSIM 최 적화들이 허용됨을 지시한다. 거짓 또는 부재 또는 \"0\": UE에는 연관된 USIM/가입에 대한 MUSIM 최적화들이 허용되지 않음을 지시한다. 단계 505에서, 사용자 또는 UDM(200b) 중 어느 하나가 동의를 제공하지 않으면, AMF(200c)는 MUSIM 최적화 메커 니즘(들)을 진행하지 않을 수 있다. 만약 사용자 및 UDM(200b) 지시 둘 다가 설정되고 AMF(200c)가 MUSIM 최적 화를 지원하지 않으면, AMF(200c)는 임의의 MUSIM 최적화 메커니즘(들)을 개시하지 않는다. 단계 506~507에서, AMF(200c)는 MUSIM 최적화 메커니즘(들)을 지원할지의 여부를 UE에게 지시하는 NAS 메시지를 전송한다. 임 의의 MUSIM 최적화 메커니즘(들)을 사용하지 않도록 UE에게 지시되면, UE는 임의의 이러한 절차들을 지시하지 않을 수 있다. 일 실시예에서, MUSIM 최적화들을 위한 인가 정보/지시는, UE 컨텍스트 셋업/수정 절차 를 사용하여, AMF(200c)에 의해 RAN(200a)에게 제공된다. RAN(200a)이 MUSIM 최적화가 인가되지 않는다는 정보 /지시를 수신하는 경우에만, RAN(200a)은 MUSIM 최적화들을 UE에게 제공한다. 도 6은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 단계 601에서, UDM(200b)은 UDM(200b)에게 사업자에 의해 또는 사용자에 의해 일부 수단들을 통해 사용자의 동 의 하에 미리 프로비저닝된다. 예를 들어, 가입 구매 프로세스 동안 또는 SMS를 통해 또는 UDM(200b)의 포털에 대한 웹 인터페이스를 통해 UDM(200b)에게 사용자의 동의를 지시했다. 단계 602에서, UE는 하나를 초과하 는 USIM들이 UE에서 활성화되는 것으로 결정한다. 단계 603에서, UE는 AMF(200c)(예컨대, 방문 자(V)-AMF)에게 활성화되는 하나를 초과하는 USIM들 및/또는 MUSIM 최적화들에 대한 요청이 있다는 지시를 제공한다. 단계 604에서, MUSIM 최적화들에 대한 UE의 요청에 기초하여, AMF(200c)는 가입 데이터에 대해 UDM(200 b)에게 요청한다. 단계 605에서, UDM(200b)의 동의/인가 및 사용자의 동의는 가입 데이터 요청의 일부로서 AMF(200c)에게 다시 전송된다. 단계 606에서, AMF(200c)는 수신된 사용자의 동의 및/또는 UDM(200b) 및/또는 AMF(200c)로부터의 인가(국부적으로 설정된 정책 또는 PCF로부터 획득된 정책)에 기초하여, MUSIM 최적화들을 UE에게 제공할지의 여부를 결정한다. AMF(200c)는 MUSIM 최적화들을 제공할지의 여부를 결정한다. 단계 607에서, AMF(200c)는 자신의 결정을 UE에게 지시한다. AMF(200c)의 지시에 기초하여, UE는 MUSIM 최적화들을 지원/개시/요청할지의 여부를 결정한다. 일 실시예에서, MUSIM 최적화를 개시하기 위한 다른 대안에서, UE에는 MUSIM 최적화들이 사용될지의 정보 로 미리 설정된다. MUSIM 최적화들의 구성을 위해, 등록 절차들은 3GPP 기술 사양(Technical Specification, TS) 23.502에서 특정된 바와 같이 수행하는데, 3GPP TS 23.502에서 특정된 바와 같은 UE 정책 연관 확립 절차에 는 다음이 추가된다: a. UE가 UE의 능력에서 UE가 MUSIM 최적화를 지원함을 지시하거나 또는 현재 두 개의 USIM들이 UE 가입 데이터에 기초하여 등록 요청 메시지에서 활성이면, AMF(200c)는 MUSIM 관련된 정보를 제공할 수 있는 PCF를 선택하고 PCF와 연관되는 UE 정책을 제공할 수 있다. b. AMF(200c)가 UE로부터의 등록 요청 메시지에서 자신이 MUSIM 최적화를 지원하는 능력을 수신하면, AMF(200c)는 추가로 그 능력을 선택된 PCF에게 보고한다. c. PCF는 MUSIM 최적화 정보를 제공할지의 여부를 결정하고 그 정보를 UE에게 3GPP TS 23.502의 4.2.4.3 절 \"투명한 UE 정책 전달을 위한 UE 설정 업데이트 절차\" 에서 정의된 바와 같은 절차를 사용하여 제공한 다. UE가 로밍하고 있을 때, 가입의 변경은 서빙 네트워크의 V-PCF를 통해 홈 PLMN의 PCF에 의해 UE에게 추가로 전송되는 서비스 인가 파라미터들을 업데이트하는 결과를 초래한다. 도 7a 및 도 7b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도들이다. 이 시나리오에서, 사용자는 UDM(200b)에게 일부 수단들에 의해 사용자의 동의를 제공한다. 예를 들어, 가입 구 매 프로세스 동안 또는 SMS를 통해 또는 UDM(200b)의 포털에 대한 웹 인터페이스를 통해 UDM(200b)에게 사용자 의 동의를 지시했다. 네트워크 엔티티들(200a/200b/200c) 및 UE가 공유하는 인가 정보는 (USIM 또는 UE에서) MUSIM 최적화를 위한 인가 정보로 미리 설정된다. MUSIM 최적화는 인가 결과들 및 UE의 RAN 노드 (200a)에게의 지시에 기초한 UE 및 네트워크 엔티티들(200a/200b/200c) 양쪽 모두로부터의 지원에 순전히 기초한다. 단계 701~702에서, 사용자는 MUSIM 동의/의지/설정 정보를 UDM(200b)에게 제공한다. 예를 들어, 사용자/UE(10 0)는 상점을 방문하고 수동으로 서명하는 것과 같은 애플리케이션 또는 다른 수단을 사용하고 있다. 그 다음에 모바일 네트워크 사업자는 상점으로 정보를 페치하거나 또는 그 정보는 상점주인에 의해 사업자의 네트워크에게 제공된다. 일 실시예에서, UE는 (USIM 또는 UE에서) MUSIM 최적화를 위한 인가로 미리 설정되고 또한 UE는 허용된/허용되지 않은 PLMN의 리스트를 포함하게 한다. 단계 703에서, UDM(200b)은 가입 데이터를 서비스-기반 메시지(예컨대, Nudm 서비스)에서 AMF(200c)에게 등록 절차의 일부로서 제공한다. 가입 데이터는 MUSIM 최적화를 위한 인가를 포함한다. 단계 704에서, AMF(200c)는 MUSIM 최적화가 지원될 때 UDM(200b)으로부터 수신된 UE 컨텍스트에 MUSIM 인가 정보를 저장한다. 단계 705에서, AMF(200c)는 N2 애플리케이션 프로토콜(N2AP) 메시지(예컨대, 초기 컨텍스트 셋업 요청 메시지)를 RAN 노드(200a)에게 전송한다. N2AP 메시지는 MUSIM 최적화들을 위한 인가를 포함한다. 단계 706에서, RAN 노드(200a)는 MUSIM 최적화가 지원될 때 MUSIM 최적화를 위한 UE 컨텍스트에 수신된 MUSIM 인가 정보를 저장한다. 단계 707에서, UE가 네트워크(200a/200b/200c)로 인가되면(즉, 만약 허용된 또는 허용되지 않은 PLMN들 리스트가 이용 가능하고 선택된 PLMN이 허용된 리스트에 있거나 또는 차단된 리스트에 없 으면), UE는 임의의 MUSIM 최적화 메커니즘(들)을 개시할 수 있다. 단계 708에서, UE는 MUSIM 최적화에 대한 요청을 RAN 노드(200a)에게 지시하는 AS 메시지 요청을 전송한다. 단계 709에서, RAN 노드(200a)는 RAN 노드(200a)가 MUSIM 절차들에 대해 인가될 때 MUSIM 최적화를 제공한다. 단계 710에서, UE는 MUSIM 최적화 절차에 대한 요청을 임의의 NAS 메시지에서 AMF(200c)에게 전 송한다. 단계 711에서, AMF(200c)는 MUSIM 최적화 메커니즘(들)에 대한 UE의 인가의 검증 후 MUSIM 최적 화를 UE에게 제공한다. 단계 712에서, UE는 MUSIM 최적화 메커니즘(들)에 대한 요청을 지시하는 사용 자 평면 메시지를 데이터 네트워크(예컨대, AMF(200c))에 전송한다. 도 8은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 단계 801에서, 사용자는 MUSIM 최적화를 위한 사용자의 동의/설정(즉, 사용자가 하나 이상의 멀티-USIM 특정 피 처들을 사용할 의도가 있는지의 여부)을 UE에게 제공한다. UE는 사용자로부터의 수신된 입력/동의/설 정/정보에 기초하여 사용자 동의 정보를 MUSIM 또는 UE/ME 또는 SIM 카드 관리자 또는 SIM 애플리케이션툴킷(SAT)에 저장한다. UE는, USIM이 (재)활성화되거나 또는 사용자 입력 정보가 없을 때, 사용자 동의/설 정에 대해 요청한다. 사용자는 필요할 때마다 동의/설정을 변경할 수 있다. 단계 802에서, UE는 사용자가 MUSIM 최적화 메커니즘(들)에 대한 동의를 UE에게 제공할 때 임의의 MUSIM 최적화 메커니즘(들)을 개시/사용할 수 있다. 단계 803에서, UE는 MUSIM 최적화에 대한 요청을 RAN 노드(200a)에게 지시하는 AS 메시지 요청을 전송할 수 있다. 단계 804에서, UE는 MUSIM 최적화에 대한 요 청(즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의도가 있는지의 여부)을 AMF(200c)에 게 지시하는 NAS 메시지 요청을 AMF(200c)에게 전송할 수 있다. 단계 805에서, UE는 MUSIM 최적화를 위해 사용자 평면 요청을 사용자 평면 엔티티에게 전송한다. 지원된 멀티-USIM 피처들의 수신된 지시에 기초하여, AMF(200c)는, (단계 306에서 상세히 설명된 바와 같이) NAS 메시지에서 이용 가능하면, 네트워크에 의해 지원된 멀티-USIM 피처들 및 네트워크에 의한 임의의 선호 정책에 기초하여 멀티-USIM 피처들의 지원을 UE에게 지 시한다. 일 실시예에서, NAS 메시지는 등록 요청, 서비스 요청, PDU 세션 확립 요청 메시지 중 적어도 하나이다. 도 9a 및 도 9b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도들이다. 단계 901에서, UE의 사용자는 MUSIM 동의 정보를 UDM(200b)에게 제공한다. MUSIM 동의 정보는 MUSIM 최적 화를 제공/획득할지의 여부를 포함한다. 단계 902에서, UDM(200b)은 MUSIM 최적화 메커니즘(들)을 사용/제공할 지의 여부를 포함하는, UDM(200b)로부터의 MUSIM 동의 정보를 포함하는 가입 데이터를 AMF(200c)에게 제공한다. 가입 데이터는 MUSIM 최적화를 위해 허용된 또는 허용되지 않은 PLMN의 리스트를 또한 포함할 수 있다. 단계 903에서, AMF(200c)가 MUSIM 최적화 메커니즘(들)을 지원하면 AMF(200c)는 UDM(200b)로부터 수신된 MUSIM 인가 정보를 UE 컨텍스트에 저장한다. 단계 904에서, AMF(200c)는 MUSIM 최적화에 대한 인가에 관해 지시하는 N2 메 시지를 RAN(200a)에게 전송한다. 단계 905에서, RAN(200a)이 MUSIM 최적화를 지원하면 RAN(200a)은 UDM(200b)로부터 수신된 MUSIM 인가 정보를 UE 컨텍스트에 저장한다. 단계 906에서, AMF(200c)는 MUSIM 절차를 사용/제공할지의 여부와 MUSIM 최적화에 대 한 허용된 또는 허용되지 않은 PLMN의 리스트를 포함하는, UDM(200b)으로부터의 MUSIM 동의 정보에 관해 UE에게 (NAS 메시지, 예를 들어, 등록 수락을 사용하여) 지시한다. 단계 907에서, AMF(200c)로부터 지시를 수신할 시, UE는 수신된 MUSIM 동의 정보와 MUSIM 최적화를 위한 허용된 또는 허용되지 않은 PLMN의 리스 트를 저장한다. 단계 908에서, 만약 UE가 MUSIM 최적화 절차들에 대해 인가되며, UE가 허용된/허용되 지 않은 PLMN의 리스트를 가지고, UE가 허용된 PLMN을 캠핑을 위해 선택하면, UE는 임의의 MUSIM 최 적화 메커니즘(들)을 수행하도록 허용된다. 단계 909에서, UE는 MUSIM 최적화에 대한 요청을 RAN 노드(200a)에게 지시하는 AS 메시지 요청을 전송한다. 단계 910에서, RAN 노드(200a)는 RAN 노드(200a)가 MUSIM 절차들에 대해 인가될 때 MUSIM 최적화를 제공한다. 단계 911에서, UE는 MUSIM 최적화 절차에 대한 요청을 임의의 NAS 메시지에서 AMF(200c)에게 전 송한다. 단계 912에서, AMF(200c)는 MUSIM 최적화 메커니즘(들)에 대한 UE의 인가의 검증 후 MUSIM 최적 화를 UE에게 제공한다. 단계 913에서, UE는 MUSIM 최적화 메커니즘(들)에 대한 요청을 지시하는 사용 자 평면 메시지를 데이터 네트워크에게 전송한다. 도 10a 및 도 10b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법 을 예시하는 순서도들이다. 단계 1001에서, UE의 사용자는 MUSIM 동의 정보를 UDM(200b)에게 제공한다. MUSIM 동의 정보는 MUSIM 최 적화를 제공/획득할지의 여부를 포함한다. 단계 1002에서, UDM(200b)은 MUSIM 최적화 메커니즘(들)을 사용/제공 할지의 여부를 포함하는, UDM(200b)로부터의 MUSIM 동의 정보를 포함하는 가입 데이터를 AMF(200c)에게 제공한 다. 단계 1003에서, AMF(200c)가 MUSIM 최적화 메커니즘(들)을 지원하면 AMF(200c)는 UDM(200b)로부터 수신된 MUSIM 인가 정보를 UE 컨텍스트에 저장한다. 단계 1004에서, AMF(200c)는 MUSIM 최적화에 대한 인가를 지시하는 N2 메시지(초기 컨텍스트 셋업 요청)를 RAN(200a)에게 전송한다. 단계 1005에서, RAN(200a)이 MUSIM 최적화를 지원하면 RAN(200a)은 UDM(200b)로부터 수신된 MUSIM 인가 정보를 UE 컨텍스트에 저장한다. 단계 1006에서, UDM(200b)은 Nudm_SDM_Notification 서비스 동작을 호출하는 것에 의 해 UE에 관련된 정보의 변경들을 AMF(200c)에게 통지한다. Nudm_SDM_Notification 서비스 동작은 액세스 및 이동성 가입 데이터 내에서 NAS를 통해 UE에게 투명하게 전달될 필요가 있는 UDM(200b)의 업데이트 데이터(예컨대, \"라우팅 지시자 업데이트 데이터\", \"디폴트 설정된 NSSAI 업데이트 데이터\", 추가로 \"MUSIM 인 가\")를 포함한다. UDM(200b)의 업데이트 데이터는 다음과 같이 하나 이상의 UE 파라미터들을 포함한다: a. (업데이트된) MUSIM 인가(파라미터의 최종 소비자는 UE/USIM이다). b. 허용된/허용되지 않은 PLMN(파라미터의 최종 소비자의 리스트는 UE/USIM이다). 단계 1007에서, AMF(200c)는 DL NAS TRANSPORT 메시지를 서빙된 UE에게 전송한다. AMF(200c)는 UDM(200 b)으로부터 수신된 투명 컨테이너를 DL NAS TRANSPORT 메시지에 포함시키도록 하고 있다. 단계 1008에서, AMF(200c)로부터 DL NAS TRANSPORT 메시지를 수신할 시, UE는 수신된 MUSIM 동의 정보와 MUSIM 최적화를 위한 허용된 또는 허용되지 않은 PLMN의 리스트를 저장한다. 단계 1009에서, 만약 UE가 MUSIM 최적화 절차 들에 대해 인가되며, UE가 허용된/허용되지 않은 PLMN의 리스트를 가지고, UE가 허용된 PLMN을 선택 하면, UE는 임의의 MUSIM 최적화 메커니즘(들)을 수행하도록 허용된다. 단계 1010에서, UE는 MUSIM 최적화에 대한 요청을 RAN 노드(200a)에게 지시하는 AS 메시지 요청을 전송한 다. 단계 1011에서, RAN 노드(200a)는 RAN 노드(200a)가 MUSIM 절차들에 대해 인가될 때 MUSIM 최적화를 제공 한다. 단계 1012에서, UE는 MUSIM 최적화 절차에 대한 요청을 임의의 NAS 메시지에서 AMF(200c)에게 전송 한다. 단계 1013에서, AMF(200c)는 MUSIM 최적화 메커니즘(들)에 대한 UE의 인가의 검증 후 MUSIM 최적화 를 UE에게 제공한다. 단계 1014에서, UE는 MUSIM 최적화 메커니즘(들)에 대한 요청을 지시하는 사용 자 평면 메시지를 데이터 네트워크에게 전송한다. 도 11은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 단계 1101에서, UE의 사용자는 MUSIM 동의 정보를 UDM(200b)에게 제공한다. MUSIM 동의 정보는 MUSIM 최 적화를 제공/획득할지의 여부를 포함한다. 단계 1102에서, UDM(200b)은 MUSIM 최적화 메커니즘(들)을 사용/제공 할지의 여부를 포함하는, UDM(200b)로부터의 MUSIM 동의 정보를 포함하는 가입 데이터를 AMF(200c)에게 제공한 다. 단계 1103에서, AMF(200c)가 MUSIM 최적화 메커니즘(들)을 지원하면 AMF(200c)는 UDM(200b)로부터 수신된 MUSIM 인가 정보를 UE 컨텍스트에 저장한다. 단계 1104에서, AMF(200c)는 MUSIM 최적화에 대한 인가를 지시하는 N2 메시지(초기 컨텍스트 셋업 요청)를 RAN(200a)에게 전송한다. 단계 1105에서, RAN(200a)이 MUSIM 최적화를 지원하면 RAN(200a)은 UDM(200b)로부터 수신된 MUSIM 인가 정보를 UE 컨텍스트에 저장한다. 단계 1106에서, UE는 MUSIM 최적화에 대한 요청을 RAN 노드(200a)에게 지시하는 AS 메시지 요청을 전송한다. 단계 1107에서, RAN 노드(200a)는 RAN 노드(200a)가 MUSIM 절차들에 대해 인가될 때 MUSIM 최적화를 제공한다. 단계 1108에서, UE는 MUSIM 최적화 절차에 대한 요청을 임의의 NAS 메시지에 서 AMF(200c)에게 전송한다. 단계 1109에서, AMF(200c)는 MUSIM 최적화 메커니즘(들)에 대한 UE의 인가의 검증 후 MUSIM 최적화를 UE에게 제공한다. 단계 1110에서, UE는 MUSIM 최적화 메커니즘(들)에 대한 요청을 지시하는 사용자 평면 메시지를 데이터 네트워크에게 전송한다. 도 12는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이다. 이 시나리오에서, 그 방법은 UE 및 AMF(200c)(즉, 서빙 네트워크(SN))가 하나 이상의 MUSIM 피처를 지원한 다고 가정된다. 그러나, 멀티-USIM UE가 하나를 초과하는 USIM을 활성화하며, 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의도가 있을 때, AMF(200c)에게 해당 멀티-USIM 피처(들)가 지원됨을 지시한다. UE로부터 지원된 멀티-USIM 피처들의 수신된 지시에 기초하여, AMF(200c)는 네트워크에 의해 지원되면 멀 티-USIM 피처들에 기초하여 멀티-USIM 피처들의 지원을 UE에게 지시한다. 일 실시예에서, AMF(200c)는 미리 설정된 로컬 정책 및/또는 임의의 선호 정책에 기초하여 MUSIM 피처의 지원을 결정한다. 단계 1201에서, UE는 다수의 USIM들이 활성화되는지를 결정한다. 단계 1202에서, UE는 하나 이상의 MUSIM 피처들이 지원되는지와 UE가 하나 이상의 멀티-USIM 특정 피처들을 사용할 의도가 있는지의 여부를 결정한다. 단계 1203에서, UE는 AMF(200c)에 대해 하나 이상의 MUSIM 피처들이 UE에 의해 지원되고 사용하도록 의도된다는 지시를 등록 요청 메시지에 포함시킨다.일 실시예에서, UE는 MUSIM 동의(즉, UE가 하나 이상의 멀티-USIM 특정 피처들을 지원하고 사용할 의 도가 있는지의 여부)를 RAN 노드(200a)를 통해 AMF(200c)에게 등록 요청 메시지로 제공한다. 일 실시예에서, 연결 해제 지원, 페이징 원인 지원, 페이징 제한 지원, 페이징 거부 지원과 같은 MUSIM 피처들 은 AMF(200c)에 대한 UE 네트워크 능력의 등록 요청에서 지시된다. 단계 1204에서, UE로부터의 지원된 멀티-USIM 피처들의 수신된 지시에 기초하여, AMF(200c)는 네트워크 또 는 그것의 로컬 정책 또는 선호 정책에 의해 지원되든 아니든 멀티-USIM 피처들에 기초하여 멀티-USIM 피처들의 지원을 결정한다. 일 실시예에서, AMF(200c)가 하나 이상의 MUSIM 피처를 지원하면, 단계 1205에서, AMF(200c)는 지원된 MUSIM 피처의 지시를 등록 수락 메시지에서 전송한다. 다른 실시예에서, AMF(200c)는 현존 NAS 메시지/N2 메시지/임의의 새로운 NAS 메시지에서 MUSIM 최적화 절차의 지원을 지시했다. 단계 1206에서, UE는 단계 1205에서 AMF(200c)에 의해 지원되는 지시된 MUSIM 피처들에 대해 MUSIM 관련 된 절차를 사용한다. AMF(200c)가 MUSIM 최적화를 지원하지 않으면, UE는 MUSIM 피처들을 사용하지 않는다. 순서도들(도 2 내지 도 12)에서의 다양한 액션들, 액트들, 블록들, 단계들 등은, 제시된 순서로, 상이한 순서로 또는 동시에 수행될 수 있다. 게다가, 일부 실시예들에서, 액션들, 액트들, 블록들, 단계들 등의 일부는 본 개 시의 범위로부터 벗어남 없이 생략되며, 추가되며, 수정되며, 스킵되는 등이 될 수 있다. 본원에서 개시되는 실시예들은 적어도 하나의 하드웨어 디바이스를 사용하여 구현되고 네트워크 관리 기능들을 수행하여 엘리먼트들을 제어할 수 있다. 도 13은 본 개시의 실시예들에 따른 사용자 장비(UE)를 개략적으로 예시한다. 도 13을 참조하면, UE는 프로세서, 송수신부 및 메모리를 포함할 수 있다. 그러나, 예 시된 구성요소들의 모두는 필수적이지 않다. 기지국은 도 13에서 예시된 구성요소들보다 더 많거나 또는 더 적은 구성요소들에 의해 구현될 수 있다. 추가적으로, 프로세서와 송수신부 및 메모리는 다른 실시예에 따라 단일 칩으로서 구현될 수 있다. 전술한 구성요소들은 이제 상세히 설명될 것이다. 프로세서는 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서들 또는 다른 프로세 싱 디바이스들을 포함할 수 있다. UE의 동작은 프로세서에 의해 구현될 수 있다. 송수신부는 송신되는 신호를 업 컨버팅 및 증폭하는 RF 송신기와, 수신된 신호의 주파수를 다운 컨버팅하 는 RF 수신기를 포함할 수 있다. 그러나, 다른 실시예에 따르면, 송수신부는 구성요소들로 도시된 것들보 다 더 많거나 또는 더 적은 구성요소들에 의해 구현될 수 있다. 송수신부는 프로세서에 연결될 수 있고 신호를 송신 및/또는 수신할 수 있다. 그 신호는 제어 정보 와 데이터를 포함할 수 있다. 또한, 송수신부는 신호를 무선 채널을 통해 수신하고 그 신호를 프로세서 에 출력할 수 있다. 송수신부는 프로세서로부터 출력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 UE에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리(133 0)는 프로세서에 연결되고 제안된 기능, 프로세스, 및/또는 방법을 위한 적어도 하나의 명령 또는 프로토 콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM(read-only memory) 및/또는 RAM(random access memory) 및/또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 다른 저장 디바이스들을 포함할 수 있다. 도 14는 본 개시의 실시예들에 따른 기지국(BS)을 예시한다. 도 14을 참조하면, BS는 프로세서, 송수신부 및 메모리를 포함할 수 있다. 그러나, 예 시된 구성요소들의 모두는 필수적이지 않다. BS는 도 14에 예시된 것들보다 더 많거나 또는 더 적은 컴포 넌트들에 의해 구현될 수 있다. 추가적으로, 프로세서와 송수신부 및 메모리는 다른 실시예 에 따라 단일 칩으로서 구현될 수 있다.전술한 구성요소들은 이제 상세히 설명될 것이다. 프로세서는 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서들 또는 다른 프로세 싱 디바이스들을 포함할 수 있다. BS의 동작은 프로세서에 의해 구현될 수 있다. 송수신부는 송신되는 신호를 업 컨버팅 및 증폭하는 RF 송신기와, 수신된 신호의 주파수를 다운 컨버팅하 는 RF 수신기를 포함할 수 있다. 그러나, 다른 실시예에 따르면, 송수신부는 구성요소들로 도시된 것들보 다 더 많거나 또는 더 적은 구성요소들에 의해 구현될 수 있다. 송수신부는 프로세서에 연결될 수 있고 신호를 송신 및/또는 수신할 수 있다. 그 신호는 제어 정보 와 데이터를 포함할 수 있다. 또한, 송수신부는 신호를 무선 채널을 통해 수신하고 그 신호를 프로세서 에 출력할 수 있다. 송수신부는 프로세서로부터 출력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 BS에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리(143 0)는 프로세서에 연결되고 제안된 기능, 프로세스, 및/또는 방법을 위한 적어도 하나의 명령 또는 프로토 콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM(read-only memory) 및/또는 RAM(random access memory) 및/또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 다른 저장 디바이스들을 포함할 수 있다. 도 15는 본 개시의 실시예들에 따른 엔티티를 예시한다. 도 15를 참조하면, ENTITY는 프로세서, 송수신부 및 메모리를 포함할 수 있다. 그러 나, 예시된 구성요소들의 모두는 필수적이지 않다. ENTITY는 도 15에 예시된 것들보다 더 많거나 또는 더 적은 컴포넌트들에 의해 구현될 수 있다. 추가적으로, 프로세서와 송수신부 및 메모리는 다 른 실시예에 따라 단일 칩으로서 구현될 수 있다. 전술한 구성요소들은 이제 상세히 설명될 것이다. 프로세서는 제안된 기능, 프로세스, 및/또는 방법을 제어하는 하나 이상의 프로세서들 또는 다른 프로세 싱 디바이스들을 포함할 수 있다. ENTITY의 동작은 프로세서에 의해 구현될 수 있다. 송수신부는 송신되는 신호를 업 컨버팅 및 증폭하는 RF 송신기와, 수신된 신호의 주파수를 다운 컨버팅하 는 RF 수신기를 포함할 수 있다. 그러나, 다른 실시예에 따르면, 송수신부는 구성요소들로 도시된 것들보 다 더 많거나 또는 더 적은 구성요소들에 의해 구현될 수 있다. 송수신부는 프로세서에 연결될 수 있고 신호를 송신 및/또는 수신할 수 있다. 그 신호는 제어 정보 와 데이터를 포함할 수 있다. 또한, 송수신부는 신호를 무선 채널을 통해 수신하고 그 신호를 프로세서 에 출력할 수 있다. 송수신부는 프로세서로부터 출력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 ENTITY에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리 는 프로세서에 연결되고 제안된 기능, 프로세스, 및/또는 방법을 위한 적어도 하나의 명령 또는 프 로토콜 또는 파라미터를 저장할 수 있다. 메모리는 ROM(read-only memory) 및/또는 RAM(random access memory) 및/또는 하드 디스크 및/또는 CD-ROM 및/또는 DVD 및/또는 다른 저장 디바이스들을 포함할 수 있다. 특정 실시예들의 앞서의 설명은, 다른 사람들이, 현재의 지식을 적용함으로써, 일반적인 개념으로부터 벗어남 없이 이러한 특정 실시예들을 다양한 응용들을 위해 쉽사리 수정 및/또는 적응시킬 수 있는 본 개시에서의 실시 예들의 일반적인 성질을 충분히 드러낼 것이고, 그러므로, 이러한 개조들 및 수정들은 개시된 실시예들의 동등 물들의 의미 및 범위 내에서 이해되어야 하고 이해되도록 의도된다. 본 개시에서 채용되는 어법 또는 용어는 설 명의 목적을 위한 것이고 제한하는 것이 아님이 이해되어야 한다. 그러므로, 본 개시의 실시예들이 바람직한 실"}
{"patent_id": "10-2023-7012734", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "시예들의 측면에서 설명되었지만, 관련 기술분야의 통상의 기술자들은 본 개시의 실시예들이 본원에서 설명되는 바와 같은 실시예들의 사상 및 범위 내에서 수정하여 실시될 수 있다는 것이 인식될 것이다.도면 도면1a 도면1b 도면2 도면3 도면4 도면5 도면6 도면7a 도면7b 도면8 도면9a 도면9b 도면10a 도면10b 도면11 도면12 도면13 도면14 도면15"}
{"patent_id": "10-2023-7012734", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는 첨부 도면들에서 예시되며, 그 도면들의 전체에 걸쳐 유사한 참조 번호들이 다양한 도면들에서 대응 하는 부분들을 나타낸다. 본 개시의 실시예들은 도면들을 참조하여 다음의 설명으로부터 더 잘 이해될 것이며, 도면들 중: 도 1a는 본 개시에서 개시된 바와 같은 일 실시예에 따른, 멀티 유니버셜 가입자 식별 모듈(MUSIM) 최적화를 개 시하기 위한 사용자 장비(UE)의 블록도를 예시하며; 도 1b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 액세스 및 이동성 관 리 기능(AMF) 엔티티의 블록도를 예시하며; 도 2는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 방법을 예시하는 순서 도이며; 도 3은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 4는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 5는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 6은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 7a 및 도 7b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을예시하는 순서도들이며; 도 8은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 9a 및 도 9b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도들이며; 도 10a 및 도 10b는 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법 을 예시하는 순서도들이며; 도 11은 본 개시에서 개시된 바와 같은 일 실시예에 따른, MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 12는 본 개시에서 개시된 바와 같은 다양한 실시예를 결합하는 MUSIM 최적화를 개시하기 위한 대체 방법을 예시하는 순서도이며; 도 13은 본 개시의 실시예들에 따른 사용자 장비(UE)를 예시하며; 도 14는 본 개시의 실시예들에 따른 기지국(BS)을 예시하며; 그리고 도 15는 본 개시의 실시예들에 따른 엔티티를 예시한다."}
