{"patent_id": "10-2024-7030432", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0162496", "출원번호": "10-2024-7030432", "발명의 명칭": "무선 통신 네트워크에서 인공 지능 및 머신 러닝 트래픽 전송을 구성하기 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "샤리아, 메흐르다드"}}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 네트워크에서 인공 지능/머신 러닝(artificial intelligence/machine learning: AI/ML) 트래픽 전송을 구성하는 방법에 있어서,정책 제어 기능(policy control function: PCF)이, AI/ML 전송 구성 정보를 저장하는 통합 데이터 리포지토리(unified data repository: UDR)로부터, 상기 AI/ML 구성 정보의 업데이트의 통지를 수신하는 동작(S24);상기 PCF가, AI/ML 프로토콜 데이터 유닛(AI/ML protocol data unit: PDU) 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는지 여부를 결정하는 동작; 및상기 AI/ML PDU 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는다고 결정함에 기반하여, 상기 PCF가,세션 관리 기능(session management function: SMF)에게 세션 관리(session management: SM) 정책이 업데이트됨을 통지하는 동작(S25)을 포함하며, 상기 SMF는 상기 업데이트된 SM 정책에 기반하여 AI/ML 트래픽을 전송하는 상기 PDU 세션을 재구성하도록(S26)구성되는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 SMF가, 액세스 및 이동성 관리 기능(access and mobility management function: AMF)으로 상기 재구성된PDU 세션에 대한 정보를 송신하는 동작을 더 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 SMF가, 상기 AI/ML 전송 구성 정보에 기반하여 사용자 장비(user equipment: UE)를 업데이트하는 동작을더 포함하며, 상기 AI/ML 전송 구성 정보에 기반하여 상기 UE를 업데이트하는 동작은 AI/ML 애플리케이션 기능(applicationfunction: AF) 어드레스, AI/ML 도메인 명칭 시스템(domain name system: DNS) 서버 어드레스, 또는 AI/ML 인증 정보 중 하나 또는 그 이상을 업데이트하는 동작을 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 UE가, PDU 세션 설립 또는 PDU 세션 수정 절차 동안 상기 AI/ML 전송 구성 정보를 수신하기 위한 능력을지시하는 동작을 더 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 AI/ML 전송 구성 정보가 상기 UDR에 의해 AI/ML 애플리케이션 기능(application function: AF) 요청의 일부로서 수신되고, 상기 AI/ML AF 요청은 AI/ML AF로부터 직접 수신되거나 또는 네트워크 노출 기능(network exposure function:NEF)을 통해 수신되고,상기 AI/ML AF 요청은 상기 AI/ML 전송 구성 정보 또는 연관 유효성 파라미터들을 업데이트하기 위한 PDU 세션설립 절차 또는 PDU 세션 수정 절차의 일부인 상기 방법.공개특허 10-2024-0162496-3-청구항 6 제 5 항에 있어서,상기 AI/ML AF 요청은 트래픽 디스크립션(traffic description)을 더 포함하며, 상기 트래픽 디스크립션은 데이터 네트워크 명칭(data network name: DNN), 단일 네트워크 슬라이스 선택 보조 정보(single network sliceselection assistance information: S-NSSAI), 애플리케이션 식별자, 애플리케이션 ID, 또는 트래픽 필터링 정보 중 하나 또는 그 이상을 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서,상기 AI/ML AF 요청은 AI/ML 애플리케이션들의 잠재적인 위치 정보, 타겟 UE 식별자들, 공간 유효성 정보, 시간유효성 정보, 사용자 평면 레이턴시 요구 사항들, 경험 품질 요구 사항들, 또는 AI/ML 트래픽 타입과 연관되는지시들 중 하나 또는 그 이상을 더 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 PDU 세션이 AI/ML 트래픽을 전송하고, 상기 PDU 세션을 재구성하는 동작은 상기 PDU 세션의 사용자 평면을재구성하는 동작을 포함하고,상기 PDU 세션의 사용자 평면을 재구성하는 동작은 UE로 신규 프리픽스(prefix)를 할당하는 동작, 신규 트래픽스티어링 규칙(traffic steering rule)들로 사용자 평면 기능(user plane function: UPF)을 업데이트하는동작, 또는 상기 UPF를 재배치할지 여부를 결정하는 동작 중 하나 또는 그 이상을 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항에 있어서,상기 AI/ML 전송 구성 정보는 상기 UDR에 의해 AI/ML 애플리케이션 기능(application function: AF) 또는 네트워크 노출 기능(network exposure function: NEF)으로부터 수신되는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 5 항에 있어서,상기 AI/ML 전송 구성 정보는 상기 AI/ML AF 상의 AI/ML 서비스 제공자 및/또는 UE 상의 AI/ML 애플리케이션 클라이언트에 의해 사전 구성되는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 5 항에 있어서,상기 AI/ML 전송 구성 정보는 AI/ML 애플리케이션 기능(application function: AF) 어드레스, AI/ML 도메인 명칭 시스템(domain name system: DNS) 서버 어드레스, AI/ML 트래픽 타입, 또는 AI/ML 인증 정보 중 하나 또는그 이상을 포함하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 5 항에 있어서,상기 AI/ML 전송 구성 정보는 상기 AI/ML AF와 연관되는 AI/ML 애플리케이션 서비스 제공자 및 이동 네트워크운영자(mobile network operator: MNO) 사이의 서비스 레벨 합의(service level agreement: SLA)에 의해 결정되는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,공개특허 10-2024-0162496-4-상기 AI/ML 전송 구성 정보는 AI/ML 애플리케이션 ID별로 존재하는 상기 방법."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "무선 통신 네트워크에서 인공 지능/머신 러닝(artificial intelligence/machine learning: AI/ML) 트래픽 전송을 구성하기 위한 정책 제어 기능(policy control function: PCF)에 있어서, 송수신기; 및상기 송수신기와 결합되는 프로세서를 포함하며, 상기 프로세서는 상기 송수신기가:AI/ML 전송 구성 정보를 저장하는 통합 데이터 리포지토리(unified data repository: UDR)로부터, 상기 AI/ML구성 정보의 업데이트의 통지를 수신하고,AI/ML 프로토콜 데이터 유닛(AI/ML protocol data unit: PDU) 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는지 여부를 결정하고, 및상기 AI/ML PDU 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는다고 결정함에 기반하여, 세션 관리기능(session management function: SMF)에게 세션 관리(session management: SM) 정책이 업데이트됨을 통지하도록 제어하고,상기 SMF는 상기 업데이트된 SM 정책에 기반하여 AI/ML 트래픽을 전송하는 상기 PDU 세션을 재구성하도록 구성되는 상기 PCF."}
{"patent_id": "10-2024-7030432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 SMF는 액세스 및 이동성 관리 기능(access and mobility management function: AMF)으로 상기 재구성된PDU 세션에 대한 정보를 송신하도록 구성되고, 및상기 SMF는 상기 AI/ML 전송 구성 정보에 기반하여 사용자 장비(user equipment: UE)를 업데이트하도록 구성되는 상기 PCF."}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 무선 통신 네트 워크에서 인공 지능/머신 러닝(AI/ML) 트래픽 전송을 구성하는 방법이 개시된다. 상기 방법은, 정책 제어 기능 (PCF)이, 통합 데이터 리포지토리(UDR)로부터, AI/ML 전송 구성 정보의 업데이트의 통지를 수신하는 동작, 상기 PCF가, AI/ML 프로토콜 데이터 유닛(AI/ML PDU) 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는지 여 부를 결정하는 동작, 및 상기 PCF가, 세션 관리 기능(SMF)에게 SM 정책이 업데이트됨을 통지하는 동작을 포함하 며, 상기 SMF는 상기 업데이트된 SM 정책에 기반하여 상기 PDU 세션을 재구성하도록 구성된다."}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 특정 예제들은 인공 지능(artificial intelligence: AI) 및/또는 머신 러닝(machine leaning: ML) 트래픽 전송을 구성하는 것과 관련된 기술들을 제공한다."}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)과 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. AI/ML은 산업 분야들 전반에 걸쳐 다양한 애플리케이션 도메인들에서 사용되고 있는 중이다. 이동 통신 시스템 들에서, 이동 디바이스들(예를 들어, 스마트 폰들, 자동차, 로봇들)에서 기존 알고리즘들(예를 들어, 음성 인식, 이미지 인식, 비디오 프로세싱)은 다양한 애플리케이션들을 활성화하기 위해 점점 더 AI/ML 모델들로 대 체되고 있는 중이다. 상기와 같은 정보는 본 개시의 이해를 돕기 위한 배경 정보로만 제시된다. 상기와 같은 내용 중 어떤 것이라도 본 발명과 관련하여 선행 기술로 적용될 수 있는지 여부에 대해서는 어떠한 결정도 내려지지 않았으며 어떠한 주장도 이루어지지 않았다."}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 특정 예제들은 3세대 파트너쉽 프로젝트(3rd generation partnership project: 3GPP) 5세대(5th generation: 5G) 네트워크에서 AI 및/또는 ML 트래픽 전송을 구성하기 위한 방법들, 장치, 및 시스템들을 제공 한다."}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 특정 예제들의 목적은 관련 기술과 연관되는 문제점들 및/또는 단점들 중 적어도 하나, 예를 들어, 여기에서 설명되는 문제들 및/또는 단점들 중 적어도 하나를 적어도 부분적으로 처리하고, 해결하고, 및/또는 완화하는 것에 있다. 본 개시의 특정 예제들의 목적은 관련 기술에 비해 적어도 하나의 이점, 예를 들어 여기에 서 설명되는 이점들 중 적어도 하나를 제공하는 것에 있다. 본 개시의 일 실시 예에 따르면, 무선 통신 네트워크에서 인공지능/머신 러닝(artificial intelligence/machine learning: AI/ML) 트래픽 전송을 구성하는 방법 및 장치가 제공된다. 본 개시의 일 실시 예에 따르면, 무선 통신 네트워크에서 AI/ML 전송 구성 정보를 통신하기 위한 방법 및 장치 가 제공된다. 본 개시의 일 실시 예에 따르면, 무선 통신 네트워크에서 인공 지능/머신 러닝(artificial intelligence/machine learning: AI/ML) 트래픽 전송을 구성하는 방법이 제공된다. 상기 정책 제어 기능 (policy control function: PCF)이, AI/ML 전송 구성 정보를 저장하는 통합 데이터 리포지토리(unified data repository: UDR)로부터, 상기 AI/ML 구성 정보의 업데이트의 통지를 수신하는 동작, 상기 PCF가, AI/ML 프로토 콜 데이터 유닛(AI/ML protocol data unit: PDU) 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는지 여부를 결정하는 동작, 및 상기 AI/ML 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는다고 결정함에 기반하여, 상기 PCF가, 세션 관리 기능(session management function: SMF)에게 세션 관리(session management: SM) 정책이 업데이트됨을 통지하는 동작을 포함한다. 상기 SMF는 상기 업데이트된 SM 정책에 기반 하여 AI/ML 트래픽을 전송하는 상기 PDU 세션을 재구성하도록 구성될 수 있다. 일 예에서, 상기 방법은, 상기 SMF가, 액세스 및 이동성 관리 기능(access and mobility management function: AMF)으로 상기 재구성된 PDU 세션에 대한 정보를 송신하는 동작을 더 포함한다. 일 예에서, 상기 방법은, 상기 SMF가, 상기 AI/ML 전송 구성 정보에 기반하여 사용자 장비(user equipment: U E)를 업데이트하는 동작을 더 포함한다. 일 예에서, 상기 AI/ML 전송 구성 정보에 기반하여 상기 UE를 업데이트하는 동작은 AI/ML 애플리케이션 기능 (application function: AF) 어드레스, AI/ML 도메인 명칭 시스템(domain name system: DNS) 서버 어드레스, AI/ML 트래픽 타입, 또는 AI/ML 인증 정보 중 하나 또는 그 이상을 업데이트하는 동작을 포함한다. 일 예에서, 상기 방법은, 상기 UE가, PDU 세션 설립 또는 PDU 세션 수정 절차 동안 상기 AI/ML 전송 구성 정보 를 수신하기 위한 능력을 지시하는 동작을 더 포함한다. 일 예에서, 상기 AI/ML 전송 구성 정보가 상기 UDR에 의해 AI/ML 애플리케이션 기능(application function: AF) 요청의 일부로서 수신된다. 일 예에서, 상기 AI/ML AF 요청은 AI/ML AF로부터 직접 수신되거나 또는 네트워크 노출 기능(network exposure function: NEF)을 통해 수신된다. 일 예에서, 상기 AI/ML AF 요청은 상기 AI/ML 전송 구성 정보 또는 연관 유효성 파라미터들을 업데이트하기 위 한 PDU 세션 설립 절차 또는 PDU 세션 수정 절차의 일부이다. 일 예에서, 상기 AI/ML AF 요청은 트래픽 디스크립션(traffic description)을 더 포함하며, 상기 트래픽 디스크 립션은 데이터 네트워크 명칭(data network name: DNN), 단일 네트워크 슬라이스 선택 보조 정보(single network slice selection assistance information: S-NSSAI), 애플리케이션 식별자, 애플리케이션 ID, 또는 트 래픽 필터링 정보 중 하나 또는 그 이상을 포함한다. 일 예에서, 상기 AI/ML AF 요청은 AI/ML 애플리케이션들의 잠재적인 위치 정보, 타겟 UE 식별자들, 공간 유효성 정보, 시간 유효성 정보, 사용자 평면 레이턴시 요구 사항들, 경험 품질 요구 사항들, 또는 AI/ML 트래픽 타입 과 연관되는 지시들 중 하나 또는 그 이상을 더 포함한다. 일 예에서, 상기 PDU 세션이 AI/ML 트래픽을 전송하고, 상기 PDU 세션을 재구성하는 동작은 상기 PDU 세션의 사 용자 평면을 재구성하는 동작을 포함한다. 일 예에서, 상기 PDU 세션의 사용자 평면을 재구성하는 동작은 UE로 신규 프리픽스(prefix)를 할당하는 동작, 신규 트래픽 스티어링 규칙(traffic steering rule)들로 사용자 평면 기능(user plane function: UPF)을 업데 이트하는 동작, 또는 상기 UPF를 재배치할지 여부를 결정하는 동작 중 하나 또는 그 이상을 포함한다. 일 예에서, 상기 AI/ML 전송 구성 정보는 상기 UDR에 의해 AI/ML 애플리케이션 기능(application function: AF) 또는 네트워크 노출 기능(network exposure function: NEF)으로부터 수신된다. 일 예에서, 상기 AI/ML 전송 구성 정보는 상기 AI/ML AF 상의 AI/ML 서비스 제공자 및/또는 상기 UE 상의 AI/ML 애플리케이션 클라이언트에 의해 사전 구성된다. 일 예에서, 상기 AI/ML 전송 구성 정보는 AI/ML 애플리케이션 기능(application function: AF) 어드레스, AI/ML 도메인 명칭 시스템(domain name system: DNS) 서버 어드레스, AI/ML 트래픽 타입, 또는 AI/ML 인증 정 보 중 하나 또는 그 이상을 포함한다. 일 예에서, 상기 AI/ML 전송 구성 정보는 상기 AI/ML AF와 연관되는 AI/ML 애플리케이션 서비스 제공자 및 이동 네트워크 운영자(mobile network operator: MNO) 사이의 서비스 레벨 합의(service level agreement: SLA)에 의해 결정된다. 일 예에서, 상기 AI/ML 전송 구성 정보는 AI/ML 애플리케이션 ID별로 존재한다. 본 개시의 일 실시 예에 따르면, 무선 통신 네트워크에서 인공 지능/머신 러닝(artificial intelligence/machine learning: AI/ML) 트래픽 전송을 구성하기 위한 정책 제어 기능(policy control function: PCF)이 개시된다. 상기 PCF는, 송수신기, 및 상기 송수신기와 결합되는 프로세서를 포함할 수 있고, 상기 프로세서는 상기 송수신기가, AI/ML 전송 구성 정보를 저장하는 통합 데이터 리포지토리(unified data repository: UDR)로부터, 상기 AI/ML 구성 정보의 업데이트의 통지를 수신하고, AI/ML 프로토콜 데이터 유닛 (AI/ML protocol data unit: PDU) 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는지 여부를 결정하고, 및 상기 AI/ML PDU 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는다고 결정함에 기반하여, 세션 관리 기능(session management function: SMF)에게 업데이트된 세션 관리(session management: SM) 정책이 업데이트됨을 통지하도록 제어한다. 상기 SMF는 상기 업데이트된 SM 정책에 기반하여 AI/ML 트래픽 을 전송하는 상기 PDU 세션을 재구성하도록 구성될 수 있다. 본 개시의 일 실시 예에 따르면, 통합 데이터 리포지토리(unified data repository: UDR), 정책 제어 기능 (policy Control function: PCF), 세션 관리 기능(session management function: SMF)을 포함하는 복수 개의 네트워크 엔티티들을 포함하는 무선 통신 네트워크가 제공된다. 상기 UDR은 AI/ML 전송 구성 정보를 수신하고, 상기 수신된 AI/ML 구성 정보를 기반으로 AI/ML 전송 구성 정보를 업데이트하고, 및 정책 제어 기능(policy control function: PCF)에 상기 AI/ML 구성 정보의 업데이트를 통지하도록 구성될 수 있다. 상기 PCF는, 상기 UDR로부터, 상기 AI/ML 구성 정보의 업데이트의 통지를 수신하고, AI/ML 프로토콜 데이터 유닛(protocol data unit: PDU) 세션 또는 전송 정책이 상기 업데이트에 의해 영향을 받는지 여부를 결정하고, 상기 AI/ML PDU 세션 또는 상기 전송 정책이 상기 업데이트에 의해 영향을 받는다고 결정함에 기반하여, 세션 관리 기능(session management function: SMF)에 세션 관리(session management: SM) 정책이 업데이트됨을 통지하도록 구성될 수 있다. 상기 SMF는 상기 업데이트된 SM 정책에 따라 AI/ML 트래픽을 전송하는 상기 PDU 세션을 재구성하도록 구 성될 수 있다; 일 예에서, 상기 무선 통신 네트워크는 액세스 및 이동성 관리 기능(access and mobility management function: AMF)을 포함하고, 상기 SMF는 상기 재구성된 PDU 세션에 대한 정보를 상기 AMF로 송신하도록 구성된 다. 일 예에서, 상기 무선 통신 네트워크는 사용자 장비(user equipment: UE)를 포함하는 것을 더 포함하며, 상기 SMF는 상기 AI/ML 전송 구성 정보에 기반하여 상기 UE를 업데이트하도록 구성된다. 일 예에서, 상기 무선 통신 네트워크는 3GPP 5G 네트워크이다. 청구항들의 범위를 벗어나는 본 설명 및/또는 도면들에 개시되어 있는 실시 예들 또는 예제들은 본 발명을 이해 하는 데 유용한 예제들로서 이해될 것이다. 본 발명의 다른 측면들, 이점들, 및 중요한 특징들은 첨부된 도면들과 함께 다음의 상세한 설명을 통해 해당 기 술 분야의 당 업자들에게 명확하게 될 것이다."}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 예제들의 다음 설명은 첨부 도면들을 참조하여 청구항들에 의해 정의되는 본 발명의 포괄적인 이해를 돕기 위해 제공된다. 설명은 그와 같은 이해를 돕기 위한 다양한 구체적인 세부 사항들을 포함하지만, 이는 단 지 예시로서 간주될 것이다. 따라서, 해당 기술 분야의 통상의 기술자들은 본 발명의 범위를 벗어나지 않고 여 기에 설명되어 있는 상기 예제들의 다양한 변경들 및 수정들이 이루어질 수 있다는 것을 인식할 것이다. 동일하거나 유사한 컴포넌트들은 서로 다른 도면들에 도시되어 있을 수 있더라도 동일하거나 또는 유사한 참조 번호들에 의해 지정될 수 있다. 본 발명의 주제를 모호하게 하는 것을 피하고 명확성과 간결성을 위해 해당 기술 분야에서 알려진 기술들, 구조 들, 구성들, 기능들, 또는 프로세스들에 대한 구체적인 설명들은 생략될 수 있다. 여기에서 사용되는 용어들 및 단어들은 서지적 또는 표준적 의미들에 제한되지 않으며, 단지 본 발명을 명확하 고 일관되게 이해할 수 있도록 사용된다. 본 명세서의 설명 및 청구항들 전체에서, \"포함한다(comprise)\", \"포함한다(include)\" 및 \"포함한다(contai n)\"라는 단어들, 및 \"포함하는\" 및 \"포함한다\"와 같은 단어들의 변형들은 \"포함하지만 이에 국한되지 않음\"을 의미하며, 다른 특징들, 엘리먼트들, 컴포넌트들, 정수들, 단계들, 프로세스들, 동작들, 기능들, 특성들, 속성 들, 및/또는 그 그룹들을 배제하려는 의도가 아니며, 배제하지도 않는다. 본 명세서의 설명 및 청구항들 전체에서, 단수 형태, 예를 들어 \"한(a)\", \"한(an)\" 및 \"상기(the)\"는 문맥상 달 리 요구되지 않는 한 복수 형태를 포함한다. 예를 들어, \"오브젝트(an object)\"에 대한 참조는 그와 같은 오브 젝트들 중 하나 또는 그 이상에 대한 참조를 포함한다. 본 명세서의 설명 및 청구항들 전체에서, \"Y에 대한 Y\"라는 일반 형태의 언어(여기서 Y는 어떤 액션, 프로세스, 동작, 기능, 액티비티 또는 단계이고, X는 그 액션, 프로세스, 동작, 기능, 액티비티 또는 단계를 수행하기 위 한 어떤 수단임)는 Y를 수행하기 위해 특별히, 하지만 반드시 전적으로는 아는, 조정, 구성 또는 배열된 수단 X 를 포함한다. 특정한 측면, 실시 예, 예제, 또는 청구항과 관련하여 설명되는 또는 개시되는 특징들, 엘리먼트들, 컴포넌트들, 정수들, 단계들, 프로세스들, 동작들, 기능들, 특성들, 속성들, 및/또는 그 그룹들은 그와 양립할 수 없을 경우를 제외하고는 여기에서 설명되는 임의의 다른 측면, 실시 예, 예제 또는 청구항에도 적용 가능한 것으로 이해될 것이다. 본 개시의 특정 예제들은 인공 지능(artificial intelligence: AI) 및/또는 머신 러닝(machine leaning: ML) 트래픽 전송과 관련된 기술들을 제공한다. 예를 들어, 본 개시의 특정 예제들은 3세대 파트너십 프로젝트(3rd Generation Partnership Project: 3GPP) 5세대(5th Generation: 5G) 네트워크에서 AI 및/또는 ML 트래픽 전송 을 위한 방법들, 장치, 및 시스템들을 제공한다. 하지만, 해당 기술 분야의 당 업자들은 본 발명이 이러한 예제 들에 제한되지 않고, 예를 들어, 하나 또는 그 이상의 기존 및/또는 미래 세대 무선 통신 시스템들 또는 표준들, 예를 들어 3GPP 5G와 같은 동일한 표준 규격들의 임의의 기존 또는 미래 릴리스들을 포함하여 임의의 적합한 시스템 또는 규격에 적용될 수 있음을 이해할 것이다. 다음 예제들은 3GPP 5G에 적용 가능하며, 3GPP 5G와 연관되는 용어를 사용한다. 하지만, 해당 기술 분야의 당 업자들은 여기에 공개된 기술들이 3GPP 5G로 제한되지 않는다는 것을 이해할 것이다. 예를 들어, 상기 다양한 네트워크 엔티티들의 기능성 및 여기에서 공개되는 다른 특징들은 다른 통신 시스템들 또는 규격들의 대응하는 또는 균등한 엔티티들 및 기능들에 적용될 수 있다. 상기 대응하는 또는 균등한 엔티티들 또는 기능들은 상기 네트워크 내에서 동일하거나 또는 유사한 역할, 기능 또는 목적을 수행하는 엔티티들 또는 기능들로 간주될 수 있다.또한, 해당 기술 분야의 당 업자들은 네트워크 엔티티들 사이의 정보의 송신이 여기에서 개시되는 예제들과 관 련하여 설명되는 메시지들의 특정한 형태, 타입 또는 순서로 제한되지 않는다는 것을 이해할 것이다. 특정 네트워크 엔티티는 전용 하드웨어의 네트워크 엘리먼트로, 전용 하드웨어 상에서 실행되는 소프트웨어 인 스턴스(instance)로, 및/또는 적절한 플랫폼(예를 들어, 클라우드 인프라스트럭처)상에서 인스턴스화된 가상화 된 기능으로서 구현될 수 있다. 해당 기술 분야의 당 업자들은 본 발명이 여기에 개시되어 있는 특정 예제들로 제한되지 않는다는 것을 이해할 것이다. 예를 들어: 여기에 공개되는 기술들은 3GPP 5G로 제한되지 않는다; 여기에 개시되어 있는 상기 예제들에서 하나 또는 그 이상의 엔티티들은 균등하거나 대응하는 기능들, 프로세스 들, 또는 동작들을 수행하는 하나 또는 그 이상의 대체 엔티티들로 대체될 수 있다; 여기에 개시되어 있는 예제들에서 상기 메시지들 중 하나 또는 그 이상은 균등하거나 또는 대응하는 정보를 통 신하는 하나 또는 그 이상의 대체 메시지들, 신호들, 또는 다른 타입의 정보 캐리어들로 대체될 수 있다; 여기에 개시되어 있는 예제들에 하나 또는 그 이상의 추가적인 엔티티들 및/또는 메시지들이 추가될 수 있다; 특정 예제들에서 하나 또는 그 이상의 필수적이지 않은 엔티티들 및/또는 메시지들이 생략될 수 있다; 일 예에서 특정 엔티티의 기능들, 프로세스들, 또는 동작들은 대안적인 예제에서 두 개 또는 그 이상의 별도의 엔티티들 사이에서 분할될 수 있다; 일 예에서 두 개 또는 그 이상의 별도의 엔티티들의 기능들, 프로세스들, 또는 동작들은 대안적인 예제에서 단 일 엔티티에 의해 수행될 수 있다; 일 예에서 특정 메시지에 의해 전달되는 정보는 대안적인 예제에서 두 개 또는 그 이상의 별도의 메시지들에 의 해 전달될 수 있다; 일 예에서 두 개 또는 그 이상의 별도의 메시지들에 의해 전달되는 정보는 대안적인 예제에서 단일 메시지에 의 해 전달될 수 있다; 및/또는 동작들이 수행되는 순서 및/또는 메시지들이 송신되는 순서는 가능할 경우 대안적인 예제들에서 수정될 수 있다. 본 개시의 특정 예제들은 하나 또는 그 이상의 정의된 네트워크 기능들을 수행하도록 구성된 장치/디바이스/네 트워크 엔티티 및/또는 그 방법의 형태로 제공될 수 있다. 본 개시의 특정 예제들은 하나 또는 그 이상의 그와 같은 장치들/디바이스들/네트워크 엔티티들을 포함하는 시스템(예를 들어, 네트워크 또는 무선 통신 시스템) 및 /또는 그를 위한 방법의 형태로 제공될 수 있다. 본 개시에서, UE는 이동 종단(Mobile Termination: MT) 및 단말 장비(Terminal Equipment: TE) 중 하나 또는 둘 다를 지칭할 수 있다. MT는 일반적인 이동 네트워크 기능들, 예를 들어, 무선 송신 및 핸드오버, 음성 인코 딩 및 디코딩, 에러 검출 및 정정, 시그널링 및 SIM에 대한 액세스 중 하나 또는 그 이상을 제공할 수 있다. 국 제 이동 장비 식별(international mobile equipment identity: IMEI) 코드, 또는 임의의 다른 적합한 타입의 식별이 상기 MT에 어태치(attach)될 수 있다. TE는 MT 기능들을 통해 상기 사용자에게 임의의 적합한 서비스들 을 제공할 수 있다. 하지만, 그것은 임의의 네트워크 기능들 자체를 포함하지 않을 수 있다. 여기서, 다음 문서들이 참조된다:"}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[1] 3GPP TS 22.261 V18.5.0"}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[2] 3GPP TS 23.501 V17.3.0"}
{"patent_id": "10-2024-7030432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[3] 3GPP TS 23.502 V17.3.0 상기 5G 시스템은 [1]에 정의된 다음 세 가지들을 포함하여 다양한 타입들의 AI/ML 동작들을 지원할 수 있다: AI/ML 엔드 포인트(endpoint)들 사이의 AI/ML 동작 스플리팅(splitting); 5G 시스템을 통한 AI/ML 모델/데이터 분배 및 공유; 및/또는 5G 시스템을 통한 분산/연합 러닝. 상기 AI/ML 동작/모델은, 예를 들어, 상기 현재의 태스크(task) 및 환경에 따라, 복수 개의 파트들로 분할될 수 있다. 상기 목적은 상기 연산-집약적이고, 에너지-집약적인 파트들을 네트워크 엔드 포인트들로 오프로드하고 (offload), 프라이버시에 민감하고(privacy-sensitive) 지연에 민감한(delay-sensitive) 파트들을 상기 엔드 디바이스(end device)에 남겨두는 것이다. 상기 디바이스는 특정 파트/계층까지 상기 동작/모델을 실행하고, 그 리고 나서 상기 중간 데이터를 상기 네트워크 엔드 포인트로 송신한다. 상기 네트워크 엔드 포인트는 나머지 파 트들/계층들을 실행하고 상기 추론 결과들을 상기 디바이스로 다시 제공한다. 다기능 이동 단말기(multi-functional mobile terminal)들은 예를 들어 태스크 및 환경 변화들에 응답하여 AI/ML 모델을 스위치할 필요가 있을 수 있다. 적응형 모델 선택의 가정은 상기 선택될 모델들이 상기 이동 디바 이스에 대해 사용 가능할 수 있다는 것이다. 하지만, AI/ML 모델들이 점차 다양해지고 있고, UE에 저장 자원이 제한되어 있기 때문에, 모든 후보 AI/ML 모델들이 미리 탑재될 수는 없다. 온라인 모델 분배(즉, 신규 모델 다 운로딩)가 필요로 될 수 있으며, 그들이 그것을 상기 변경된 AI/ML 태스크들 및 환경들에 적응하기 위해 필요할 때 네트워크(Network: NW) 엔드 포인트로부터 상기 디바이스들로 AI/ML 모델이 분배될 수 있다. 이 목적을 위해 서, 상기 UE에서 상기 모델 성능이 지속적으로 모니터되는 것이 필요로 될 수 있다. 클라우드 서버는 복수 개의 엔드 디바이스들(예를 들어, UE들) 각각에 의해 부분적으로 트레이닝된 로컬 모델들 을 어그리게이팅함으로써 글로벌 모델을 트레이닝할 수 있다. 각 트레이닝 반복 내에서, UE는 로컬 트레이닝 데 이터를 사용하여 상기 AI 서버로부터 다운로드되는 모델에 기반하여 상기 트레이닝을 수행한다. 그리고 나서, 상기 UE는 예를 들어 5G UL 채널들을 통해 상기 클라우드 서버로 상기 중간 트레이닝 결과들을 보고한다. 상기 서버는 상기 UE들로부터 상기 중간 트레이닝 결과들을 어그리게이트하고 상기 글로벌 모델을 업데이트한다. 그 리고 나서 상기 업데이트된 글로벌 모델은 상기 UE들에게 다시 분배되고 상기 UE들은 다음 반복을 위해 상기 트 레이닝을 수행할 수 있다. 다른 레벨들의 상호 작용들이, UE와 AF 사이에서, 예를 들어, [1]에 기반하여, AI/ML 모델들, 중간 데이터, 로 컬 트레이닝 데이터, 추론 결과들 및/또는 모델 성능을 애플리케이션 AI/ML 트래픽으로 교환하기 위한 AI/ML 엔 드 포인트들로서 예상된다. 하지만, 상기에서 설명한 바와 같은 AI/ML 엔드 포인트들 (예를 들어, UE와 AF) 사이에서 예를 들어 5GS를 통한 애플리케이션 AI/ML 트래픽의 송신을 위한 지원은 현재 상기 기존의 5GC 데이터 전송/트래픽 라우팅 메커니즘들 에 정의되어 있지 않다. 원하는 것은 AI/ML AF가 예를 들어 5GS를 통해 상기 AI/ML 데이터 전송 및/또는 트래픽 라우팅에 어떻게 영향을 미칠 수 있는지를 정의하는 절차들 및 시그널링이다. AI/ML 애플리케이션은 AI/ML 동작을 지원하기 위해 MT에 의해 제공되는 상기 서비스들을 사용하는 TE의 일부일 수 있고, 이에 반해 AI/ML 애플리케이션 클라이언트는 MT의 일부일 수 있다. 대안적으로, AI/ML 애플리케이션 클라이언트의 일부는 TE에 존재할 수 있고, AI/ML 애플리케이션 클라이언트의 일부는 MT에 존재할 수 있다. 여기에 개시되어 있는 절차들은 다양한 네트워크 기능들/엔터티들을 참조할 수 있다. 예를 들어, 아래에 나타낸 바와 같은 특정 네트워크 기능들/엔터티들의 기능들 및 정의들은 해당 기술 분야의 당 업자들에게 알려져 있으 며, 예를 들어 적어도 [2] 및 [3]에 정의되어 있다: 애플리케이션 기능(application function: AF); 네트워크 노출 기능(network exposure function: NEF); 통합 데이터 리포지토리(unified data repository: UDR); 정책 제어 기능(policy control function: PCF); 세션 관리 기능(session management function: SMF); 사용자 평면 기능(user plane function: UPF); 액세스 및 이동성 관리 기능(access and mobility management function: AMF); 사용자 장비(user equipment: UE); 및/또는 네트워크 리포지토리 기능(network repository function: NRF) 하지만, 상기에서 언급된 바와 같이, 해당 기술 분야의 당 업자들은 본 개시가 [2] 및 [3]에서 제공되는 정의들 로 제한되지 않으며, 균등한 기능들/엔터티들이 사용될 수 있음을 인식할 것이다. 아키텍쳐 도 1은 본 개시의 예시적인 실시 예에 따른 아키텍처의 표현을 도시하고 있다. 도 1에 도시되어 있는 바와 같이, 다양한 엔티티들은 복수 개의 인터페이스들 또는 기준 포인트들 S11-S17을 통 해 연결된다. 하지만, 해당 기술 분야의 당 업자들은 본 개시가 도 1에 도시되어 있는 예제로 제한되지 않는다 는 것을 인식할 것이다. 예를 들어, 대안적인 예제들에서, 더 많거나 또는 더 적은 인터페이스들이 제공될 수 있고, 및/또는 다른 엔티티들 사이의 인터페이스들이 제공될 수 있다. 또한, 상기 인터페이스들은 임의의 적절 한 용어를 사용하여 지칭될 수 있다. 도 1의 예제에서, 기준 포인트들 S11 및 S15는 애플리케이션 기능(Application Function: AF)으로부터 기대되는 다른 논리 기능들 사이의 상호 작용들을 운영한다. 예를 들어, 이들은 중앙적으로 함께 또는 별도의 네트워크 엔터티들의 일부로 분산 방식으로 실현될 수 있다. 상기 AI/ML AF는 AI/ML 동작들, 예를 들어 상기 모델 트레이닝을 분할하거나, 상기 모델을 상기 UE로 분배하거나, 또는 예를 들어, 연합 러닝의 케이스에서, 복수 개의 UE들로부터 상기 로컬 모델들, 추론 피드백, 등을 수집 및 어그리게이트할 수 있는 AI/ML 동작에 대한 상기 네트워크 측 엔드 포인트일 수 있다. 후자의 역 할은 데이터 수집 애플리케이션 기능(Data Collection Application Function: DCAF)과 유사할 수 있다. DCAF와 는 달리, 상기 프로세싱된 모델 또는 데이터는 상기 네트워크 데이터 분석 기능(Network Data Analytics Function: NWDAF)으로만 노출될 뿐만 아니라, 다른 5GC NF들(예를 들어, 하기에서 설명되는 상기 프로비저닝 AF 를 통해) 또는 다른 소비자 AF들(하기에서 설명되는 바와 같은)에 의해서도 소모될 수 있다. 또한, AI/ML AF는 다른 역할들을 할 수 있다, 예를 들어 AI/ML 애플리케이션 서버들과 협력하여 UPF (재)선택에 도움을 제공하고, 및/또는 전송 구성 정보의 프로비저닝에 도움을 제공하고, 및/또는 상기 PCF가 상기 UE에 대한 AI/ML UE 정책 또는 루트 선택 정책(route selection policy: URSP) 정책들을 생성하는 데 도움을 제공할 수 있다 (아래에서 설명되는 바와 같이). 상기 프로비저닝 AF는 외부 파라미터들 및 모델들(예를 들어, S11 기준 포인트를 통해 수집된)의 프로비저 닝 및/또는 대응하는 이벤트들, 예를 들어, 서비스 기반 인터페이스를 통한 상기 5GC NF에 대한 AI/ML 동작 별 로 대응하는 이벤트들의 노출을 담당할 수 있다. 상기 소비자 AF(예를 들어, 클라이언트 소비자 AF)은 예를 들어 S15 기준 포인트를 통한, AI/ML AF 모델들 및/또는 AI/ML 동작들의 외부 소비자로서 동작할 수 있는 AF 로직(logic)을 나타낼 수 있다. 상기 AF(AI/ML AF, 프로비저닝 AF 또는 소비자 AF)(예를 들어, 신뢰되는 도메인(trusted domain)에 존재할 때)는, 예를 들어 DNN, S-NSSAI, 지원되는 애플리케이션 ID(들), 지원되는 이벤트 ID(들), 및 임의의 관련 그룹 ID(들)를 포함하는 네트워크 리포지토리 기능(Network Repository Function: NRF)에 등록할 수 있다. 상기 AF는 NRF 서비스들을 통해 다른 5GC NF들에 의해 발견될 수 있다. 기존 포인트들 S12, S13, S16 및 S17은 상기 UE와 네트워크 사이에서 AI/ML 트래픽 타입들이 수집되거나 또는 분배되는 방식을 운영할 수 있습니다. 예를 들어, S16 인터페이스는 AI/ML 애플리케이션으로부터 상기 UE의 직접 AI/ML 애플리케이션 클라이언트로 로컬 트레이닝 모델들, 추론 결과들, 및/또는 모델 성능 을 수집하기 위해 사용될 수 있다. 또한, 직접 AI/ML 애플리케이션 클라이언트를 통해 상기 UE 상의 AI/ML 애플리케이션으로 (글로벌) AI/ML 모델을 분배하기 위해 사용될 수도 있다. S12 기준 포인트는, 예를 들어, 상기 UE와 네트워크 사이의 직접 보고의 케이스를 위해 사용될 수 있다. 특정 예제에서, S12는 상기 UE와 5GC 사용자 평면 내의 앵커 사용자 평면 기능(User Plane Function: UPF) 사 이에 설립되는 사용자 평면 PDU 세션을 통해 실현될 수 있다. 상기 S12를 통한 UE와 네트워크 사이의 직접 보고 의 케이스에서, 상기 AI/ML AF는 S14 기준 포인트를 통해 하나 또는 그 이상의 AI/ML 애플리케이션 서버들 (AI/ML application servers: AI/ML AS)과 협력하여 UPF(재)선택을 도울 수도 있다. UE와 상기 네트워크 사이의 간접 보고의 케이스(예를 들어, 상기 간접 AI/ML 애플리케이션 클라이언트를 사용하는)에 대해서, S17과 S13의 조합이 사용될 수 있다. 특정 예제들에서, S17은 3GPP 도메인 외부에서 실현될 수 있다. 상기에서 설명된 케이스들 중 하나 또는 그 이상 또는 모두를 포함하는, 다양한 예제들에서, 3GPP 외부의 신뢰 되지 않는 엔티티와 3GPP 도메인 내의 신뢰되는 엔티티 사이에서 상호 작용이 예상될 때, NEF 노출 서비스 들이 사용될 수 있다. 전송 구성 정보 AI/ML 전송 구성 정보의 다양한 예제들이 본 개시의 예제들에서 사용될 수 있다. 예를 들어, 전송 구성 정보는 어드레스 정보, 트래픽 타입 정보, 보조 데이터 또는 메타데이터, 인증 또는 보안 정보, 및 다른 구성 정보 중 하나 또는 그 이상을 포함할 수 있다. 이제 복수 개의 비-제한적인 예제들이 설명될 것이다. 신뢰되는 도메인에서 AI/ML AF 및 신뢰되지 않는 도메인에서 AI/ML AF 둘 다에 대해서, 상기 이동 네트워크 운 영자(mobile network operator: MNO)와 상기 AI/ML 애플리케이션 서비스 제공자(예를 들어, ASP) 사이의 서비스 레벨 합의(Service Level Agreement: SLA)는 다음 중 하나 또는 그 이상의 임의의 조합들을 사용하여 상 기 AI/ML 전송 구성 정보(예를 들어, AI/ML 애플리케이션 ID 별로)를 결정할 수 있다: AI/ML AF 어드레스; AI/ML DNS 서버 어드레스; AI/ML 트래픽 타입(들); AI/ML 메타데이터 정보; 인증 정보; 및/또는 보고의 모드. AI/ML AF 어드레스에 대해서, 적합한 타입의 어드레스가 사용될 수 있다. 예를 들어, 상기 AI/ML AF 어드레스는 상기 UE 또는 상기 UE의 AI/ML 애플리케이션 클라이언트가 상기 AI/ML AF 또는 임의의 연관되는 AI/ML 애플리케 이션 서버(들)와 통신할 수 있는 전체 어드레스 도메인 명칭(fully qualified domain name: FQDN)(들) 및/또는 IP 어드레스(들) 및/또는 비-IP 어드레스(들)일 수 있다. AI/ML DNS 서버 어드레스에 대해서, 임의의 적합한 타입의 어드레스가 사용될 수 있다. 상기 AI/ML DNS 서버 어 드레스는 상기 UE 또는 상기 UE의 AI/ML 애플리케이션 클라이언트가 FQDN에서 상기 AI/ML AF의 어드레스 또는 임의의 연관되는 AI/ML 애플리케이션 서버(들)의 IP 어드레스로 상기 AI/ML AF 어드레스를 분석하기 위해 선택 적으로 사용될 수 있다. AI/ML 트래픽 타입(들)은, 예를 들어, 상기 AI/ML AF 또는 임의의 연관되는 AI/ML 애플리케이션 서버(들)와 상 호 작용할 때 또는 그 반대일 때(예를 들어. 사용자 동의에 따른) 상기 UE 및/또는 상기 UE의 AI/ML 애플리케이 션 클라이언트가 지원할 수 있는 트래픽 타입을 지시할 수 있다. 상기 트래픽 타입의 비-제한적 예제들은 AI/ML 모델, 중간 데이터, 논리 트레이닝 데이터, 추론 결과들, 및 모델 성능 중 하나 또는 그 이상의 임의의 조합을 애플리케이션 AI/ML 트래픽(들)으로 포함한다. 특정 예제들에서, 통합 AI/ML 트래픽 타입은 UE(또는 상기 UE의 AI/ML 애플리케이션 클라이언트)와 상기 AI/ML AF(또는 임의의 연관되는 AI/ML 애플리케이션 서버들) 사이의 모 든 트래픽들에 대해 채택될 수 있다. AI/ML 메타데이터 정보에 대해서, 임의의 적합한 타입의 메타데이터가 사용될 수 있으며, 예를 들어 익명화 (anonymisation), 어그리게이션(aggregation), 정규화(normalisation), 연합 트레이닝, 등을 위해 상기 AI/ML AF 또는 임의의 연관되는 AI/ML 애플리케이션들 서버(들)에 의해 지원되는 가능한 AI/ML 프로세싱 알고리즘들 및 연관되는 파라미터들이 사용될 수 있다. 예를 들어, 인증 정보는 상기 AI/ML AF(또는 임의의 연관되는 AI/ML 애플리케이션들 서버들) 및/또는 상기 UE (또는 상기 UE의 AI/ML 애플리케이션 클라이언트)가 상기 AI/ML 트래픽이 교환된 진위성(authenticity)을 확인 할 수 있는 정보를 포함할 수 있다. 예를 들어, 보고의 모드는 3GPP를 통한 직접 보고 또는 비-3GPP를 통한 간접 보고를 포함할 수 있다. 전송 구성 정보의 공유/적용 특정 예제들에서, 상기 AI/ML 전송 구성 정보는 예를 들어 상기 AI/ML AF의 AI/ML 애플리케이션 서비스 제공자 및/또는 상기 UE의 AI/ML 애플리케이션 클라이언트에 의해 (사전) 구성될 수 있다. 특정 예제들에서, 상기 AI/ML 전송 구성 정보는 동적으로 구성될 수 있다. 특정 예제들에서, 상기 UE는 상기 AI/ML 전송 구성 정보(또는 연관되는 정책)를 수신할 가능성 및/또는 능력을 지시할 수 있다. 예를 들어, 그와 같은 지시는 PDU 세션 설립 및/또는 PDU 세션 수정 절차들 동안 프로토콜 구 성 옵션들(protocol configuration options: PCO)의 일부로 이루어질 수 있다. 상기 UE는 상기 SMF 또는 AMF (예를 들어, 비-액세스-계층(Non-Access-Stratum: NAS) 메시지들 및 명령들을 통해)와 같은 임의의 적합한 엔티 티를 통해 AI/ML 전송 구성 정보(또는 상기 연관되는 정책)의 적어도 일부를 수신할 수 있다. 이는 PCF로부터 AI/ML UE 정책 또는 루트 선택 정책(Route Selection Policy: URSP)의 일부로서 공유될 수 있다. 그렇게 수행하기 위해서, 상기 AI/ML 서비스 제공자는 상기 AF 요청들을 사용하여, 예를 들어, PDU 세션 설립 및/또는 수정 절차의 일부로 상기 트래픽 라우팅에 직접적으로(예를 들어, 신뢰되는 도메인의 AI/ML AF에 대해 서) 또는 NEF를 통해 간접적으로(예를 들어, 신뢰되지 않는 도메인의 AI/ML AF에 대해서) 영향을 미치게 하여 AI/ML 전송 구성 정보 및/또는 연관되는 유효성 파라미터들을 업데이트할 수 있다. 상기 AI/ML AF 요청은 트래픽 디스크립션으로서, 임의의 적합한 타입의 정보, 예를 들어, 상기 AI/ML AF 또는 임의의 연관되는 AI/ML 애플리케이션들 서버(들)를 처리하는 트래픽 필터링 정보, DNN, S-NSSAI, 애플리케이션 식별자, 또는 애플리케이션 ID 또는 중 하나 또는 그 이상의 임의의 조합들을 포함할 수 있다. 상기 요청이 NEF 를 통해 존재할 경우, 상기 AF 요청은 (외부의) AF 서비스 식별자를 트래픽 디스크립션으로 사용할 수 있으며, 그리고 나서 NEF는 그것을 DNN, S-NSSAI, 애플리케이션 식별자, 애플리케이션 ID 또는 트래픽 필터링 정보 중 하나 또는 그 이상의 임의의 조합으로 변환할 수 있다. 특정 예제들에서, 상기 요청은 AI/ML 전송 구성 정보 외에도 하나 또는 그 이상의 다른 파라미터들 역시 포함할 수 있다. 예를 들어, 상기 파라미터들은 상기 5GC(예를 들어, UDR, PCF 또는 SMF)가 상기 전송 정책 및 연관되 는 유효성 파라미터들을 컴파일/생성할 수 있도록 하는 하나 또는 그 이상의 파라미터들을 포함할 수 있다. 예를 들어, 상기 AF 요청은 다음 중 하나 또는 그 이상을 포함할 수 있다: - 예를 들어 DNAI(들)의 형태일 수 있는 AI/ML 애플리케이션들의 잠재적인 위치 정보 (예를 들어, 신뢰되는 도 메인에서 AI/ML AF에 대해서) - 타겟 UE 식별자(들), 예를 들어, 개별 UE(예를 들어, AI/ML 동작 분할 또는 AI/ML 모델 분배), UE들의 그룹 (예를 들어, AL/ML 모델 분배 또는 연합 러닝), 또는 임의의 UE(예를 들어, 임의의 타입들의 AI/ML 동작을 지원 하기 위해)에 전송 구성 정보가 적용될 경우). 임의의 적합한 타입의 식별자(들)가 사용될 수 있다. 예를 들어, 신뢰되는 도메인에서 AI/ML AF에 대해서, 식별자는 가입 영구 식별자(subscription permanent identifier: SUPI)(들), 내부 UE 식별자(들) 및/또는 내부 그룹 ID(들)를 포함할 수 있다. 신뢰되지 않는 도메인에서 AI/ML AF에 대해서, 식별자는 예를 들어, 상기 NEF에 의해 SUPI(들), 내부 UE 식별자(들) 및/또는 내부 그룹 ID(들)로 해석될 일반 공중 가입 식별자(generic public subscription identifier: GPSI)(들), 외부 UE 식별자(들) 및/ 또는 외부 그룹 ID(들)을 포함할 수 있다. - 공간 유효성 정보, 예를 들어 전송 구성 정보에 대한 임의의 지리적 경계들이 존재할 경우. 임의의 적합한 타 입의 공간 유효성 정보가 사용될 수 있다. 예를 들어, 신뢰되는 도메인에서 AI/ML AF에 대해서, 상기 정보는 트 래킹 영역 식별자(tracking area identity: TAI) 또는 다른 적합한 해상도의 위치 데이터를 포함할 수 있다. 신 뢰되지 않는 도메인에서 AI/ML AF에 대해서, 상기 정보는 예를 들어 상기 NEF에 의해 TAI, 또는 다른 해상도들 의 위치 데이터로 변환될 지리적 존(zone)들을 포함할 수 있다. - 시간 유효성 정보, 예를 들어, 전송 구성 정보에 대한 임의의 만료 시간이 존재할 경우. - 사용자 평면 레이턴시 요구 사항들, 예를 들어, 상기 AI/ML 트래픽 타입(들)이 AI/ML 동작을 지원하기 위한 특정 레이턴시 요구 사항들과 연관될 경우 - 임의의 다른 서비스 또는 경험 품질 요구 사항들, 예를 들어 상기 AI/ML 동작이 특정 서비스 요구 사항 또는 경험 품질 요구 사항과 관련될 경우. - 특정 AI/ML 트래픽 타입(들), AI/ML 동작의 타입 또는 통합 AI/ML 트래픽과 연관되는 지시(들). AI/ML 트래픽에 대한 트래픽 라우팅 및/또는 재구성을 통한 AI/ML AF 영향의 일 예 본 개시의 다양한 예제들에서, 전송 구성 정보는 다양한 네트워크 엔티티들 사이에서 공유/통신될 수 있다. 다 양한 네트워크 엔티티들은 수신된 전송 정보를 저장하고, 및/또는 수신/저장된 전송 구성 정보에 따라 업데이트 들 및/또는 (재)구성을 수행할 수 있다. 상기 전송 구성 정보는 상기에 개시되어 있는 바와 같은 하나 또는 이 상의 아이템들의 정보 및/또는 다른 적합한 정보를 포함할 수 있다. 상기 전송 구성 정보는 예를 들어 상기에서 개시된 바와 같은 AF 요청 또는 임의의 다른 적합한 기술을 사용하 여 공유될 수 있다. 특정 예제들에서, 상기에서 공개된 아키텍처 또는 임의의 다른 적합한 아키텍처는 상기 전 송 구성 정보를 공유하고 상기 전송 구성 정보에 따라 업데이트 및/또는 (재)구성을 수행하기 위한 임의의 다른 메시지(들)를 송신하기 위해 사용될 수 있다. 도 2는 본 발명의 일 실시 예에 따른 콜 플로우의 표현을 도시하고 있다. 하지만, 해당 기술 분야의 당 업자들 은 본 개시가 도 2의 예제로 한정되지 않는다는 것을 인식할 것이다. 예를 들어, 전송 구성 정보는 임의의 적합 한 네트워크 엔티티들 사이에 공유/통신될 수 있다. 또한, 임의의 적합한 네트워크 엔티티들은 수신된 전송 구 성 정보를 저장하고, 및/또는 수신/저장된 전송 구성 정보에 따라 업데이트들 및/또는 (재)구성을 수행할 수 있 다. 동작들 S21 및 S22에서, 상기 AI/ML AF(예를 들어, AI/ML AF) 또는 NEF(예를 들어, NEF) 는 AI/ML 전송 구성 정보 및 다른 관련 파라미터들을 사용하여 (예를 들어, 통합 데이터 관리(unified data management: UDM) 서비스들을 통해) 상기 UDR을 생성, 업데이트(또는 삭제)할 수 있다. 동작 S23a에서, 상기 UDR은 상기 신규 AI/ML 전송 구성 정보 및 다른 관련 파라미터들을 저장하거나 또는 업데이트할 수 있다(또는 존재할 경우, 기존 전송 구성 정보를 제거할 수 있다). 동작 23b에서, 상기 NEF 는 동작 S22의 메시지에 응답할 수 있다(예를 들어, 생성, 업데이트 또는 삭제할 수 있다). 동작 S24에서, 상기 UDR은 상기 PCF로 통지할 수 있다. 이 동작은 AF 요청들의 수정들에 대한 상기 PCF(들)의 이전 가입에 기반할 수 있다. 예를 들어, DNN, S-NSSAI, AI/ML 애플리케이션 식별자, SUPI, 또 는 내부 그룹 식별자 중 하나 또는 그 이상의 임의의 조합들이 상기 PCF를 처리하기 위한 데이터 키로서 사용될 수 있다. 동작 S25에서, 상기 PCF는 상기 AI/ML PDU 세션들 또는 전송 정책이 영향을 미치는지 여부를 결정하고, SM 정책들을 업데이트하고, SM 정책 제어 업데이트에 기반하여 상기 SMF에게 통지할 수 있다. 동작 S26에서, 상기 SMF는 상기 AI/ML 트래픽(들)을 전송하는 상기 PDU 세션(들)의 사용자 평면을 재구성 하기 위한 적절한 액션(들)을 취할 수 있다. 그와 같은 액션(들)의 비-제한적인 예제들은 다음 중 하나 또는 그 이상을 포함한다: 상기 UE(예를 들어, (UE 104))에 신규 프리픽스를 할당한다; 신규 트래픽 스티어링 규칙들을 사용하여 상기 UPF(예를 들어, 타겟 DNAI에서)를 업데이트한다; 및/또는 예를 들어, 위치 정보, 타겟 UE ID들, 공간 유효성, 시간 유효성, UP 레이턴시 및/또는 서비스 요구 사항들, 및 /또는 AI/ML 동작과 연관되는 임의의 다른 적합한 지시에 대한 상기 AI/ML AF에 의해 제공되는 요구 사항 들을 고려하여 상기 UPF를 재배치할지 여부를 결정한다 (예를 들어, AI/ML AS와 협력하여). 동작 S27에서, 상기 SMF는 SMF/I-SMF (재)선택을 트리거하기 위해 상기 AMF로 상기 타겟 DNAI를 송 신하고, 그리고 나서, 예를 들어 Nsmf_PDUSession_SMContextStatusNotify 서비스 동작을 통해 상기 현재의 PDU 세션 또는 다음 PDU 세션에 대한 타겟 DNAI 정보를 상기 AMF로 알릴 수 있다. 동작 S28에서, 상기 SMF는 또한 다른 세션 관리(session management: SM) 가입 정보와 함께 상기 신규 또 는 수정된 AI/ML 전송 정책(예를 들어, 비-접속- 계층(non-access-stratum: NAS) 메시지들에 따라)에 대해 상 기 UE를 업데이트할 수 있다. 비-제한적인 예제들은 다음 중 하나 또는 그 이상을 포함한다: AI/ML AF 어드레스를 업데이트한다; AI/ML DNS 서버 어드레스를 업데이트한다; AI/ML 메타데이터 정보를 업데이트한다; AI/ML 트래픽 타입(들)을 업데이트한다; 및/또는 AI/ML 인증 정보를 업데이트한다. 해당 기술 분야의 당 업자들은 도 2의 콜 플로우가 단지 예제일 뿐이며 다양한 대안들이 본 공개의 범위에 속한 다는 것을 이해할 것이다. 예를 들어, 대안적인 절차로서, 상기 PCF(예를 들어, PCF)는 사용자 구성 업데이트 절차를 사용하여 UE AI/ML 정책 또는 상기 AI/ML 전송 정책에 대한 UE에서의 URSP를 업데이트할 수 있다(예를 들어, AMF를 통 해). 그를 경우, 상기 AI/ML 정책 또는 URSP의 트래픽 디스크립터(descriptor)는 AI/ML 전송 정책으로 해석될 수 있다. 예를 들어, 애플리케이션 디스크립터는 상기 UE의 AI/ML 애플리케이션 OS ID 및 OSAPP ID와 일치할 수 있다. IP 디스크립터들 및 도메인 디스크립터들(또는 비-IP 디스크립터들)은 상기 AI/ML AF 어드레스와 일치할 수 있다. 연결 능력들은 AI/ML 트래픽 타입(들)과 일치할 수 있다. 루트 선택 디스크립터(Route selection descriptor: RSD)는 세션 및 서비스 연속성(session and service continuity: SSC), S-NSSAI, DNN, PDU 세션 타입, 시간 윈도우, 및 AI/ML 트래픽 타입 별로 또는 통합 트래픽 타입 별로 설정된 위치 기준과 일치할 수 있 다. 이는 단계 S21에서 AI/ML 전송 구성 정보를 기반으로 할 수 있다. 특정 예제들에서, 액세스 타입 선호 및/ 또는 끊김 없는 오프로드(offload) 지시(또는 유사한 정보 엘리먼트)가 3GPP(즉, S12 기준 포인트)를 통한 직접 보고의 사용 대 비-3GPP(즉, S17과 S13의 조합)를 통한 간접 보고 사용을 지시하기 위해 사용될 수 있다. 상기와 같은 예제들에서, 상기 UE 측(예를 들어, UE)의 AI/ML 애플리케이션 클라이언트(예를 들어, 직접 AI/ML 애플리케이션 클라이언트)는 예를 들어 S16 인터페이스에 기반하여 또는 3GPP 범위 외부의 다른 로 직에 기반하여 상기 AI/ML 전송 구성 정보의 일부를 상기 UE의 AI/ML 애플리케이션으로 전달할 수 있 다. 상기와 같은 예제들에서, 상기 UE(예를 들어, UE) 또는 상기 UE의 AI/ML 애플리케이션 클라이언트(예 를 들어, 직접 AI/ML 애플리케이션 클라이언트)는 상기 AI/ML AF(예를 들어, AI/ML AF) 또는 임의의 연관된 AI/ML 애플리케이션들 서버(예를 들어, AI/ML AS)의 FQDN(들)를 상기 AI/ML AF 또는 임의의 연관 된 AI/ML 애플리케이션 서버(들)의 IP 어드레스들로 정확하게 변환할 수 있다. 이는, 예를 들어 로컬(local), 프라이빗(private), 또는 글로벌 DNS 서버에 액세스함으로써 수행될 수 있다. 상기에 개시되어 있는 바와 같이, 상기 UE에 대한 DNS 서버 어드레스 또는 관련 구성들은 필요할 경우(예를 들어, 프라이빗 DNS에 대해) 전송 구 성 정보의 일부로 선택적으로 공유될 수도 있다. 특정 예제들에서, 상기 AI/ML AF(예를 들어, AI/ML A)(또는 NEF(예를 들어, NEF)는 UDM으로부터의 상기 SUPI, DNN, S-NSSAI를 서비스하는 상기 PDU 세션(들)과 상기 SMF로부터의 상기 할당된 IPv4 어드레스 또는 IPv6 프리픽스 또는 둘 다를 찾을 수 있다. 상기 AI/ML AF(또는 NEF)는 상기 UE(또는 상기 UE의 AI/ML 애플리케 이션 클라이언트)에 대한 상기 PDU 세션 설립 동안 상기 UE IP 어드레스 또는 임의의 다른 외부 UE ID들을 저장 할 수 있다. 상기 AI/ML AF(또는 NEF)는 상기 SMF에 의해 할당된 상기 IPv4 어드레스 또는 IPv6 프리픽스를 사 용하여 상기 UE IP 어드레스(또는 임의의 다른 외부 UE ID) 및 상기 검색된 SUPI(예를 들어, UDM/SMF를 통한)의 매핑을 상관시키고 저장할 수 있다. 해당 기술 분야의 당 업자들은 도 2의 동작들 중 하나 또는 그 이상, 예를 들어 점선들로 나타내진 바와 같은 동작들은 특정 예제들에서 선택적일 수 있다는 것을 이해할 것이다. 도 3은 도 1 및/또는 도 2와 관련하여 개시되는 기술들과 같이, 본 개시의 예제들에서 사용될 수 있는 예시적인 네트워크 엔티티의 블록 다이어그램이다. 예를 들어, 상기 UE(예를 들어, UE 또는 UE), AI/ML AF(예 를 들어, AI/ML AF 또는 AI/ML AF), NEF(예를 들어, NEF 또는 NEF), UDR(예를 들어, UDR), PCF(들)(예를 들어, PCF(들), SMF(예를 들어, SMF), UPF(예를 들어, UPF), AMF(예 를 들어, AMF) 및/또는 다른 NF들은 도 3에 도시되어 있는 네트워크 엔티티의 형태로 제공될 수 있다. 해 당 기술 분야의 당 업자들은 네트워크 엔티티가 예를 들어 전용 하드웨어의 네트워크 엘리먼트, 전용 하드웨어 에서 실행되는 소프트웨어 인스턴스, 및/또는 적절한 플랫폼(예를 들어, 클라우드 인프라스트럭처)에서 인스턴 스화된 가상화된 기능으로 구현될 수 있음을 인식할 것이다. 상기 엔티티는 프로세서(또는 제어기), 송신기, 및 수신기를 포함할 수 있다. 상기 수신기 는 예를 들어 상기에서 설명된 바와 같이 유선 또는 무선으로 하나 또는 그 이상의 다른 네트워크 엔티티 들로부터 하나 또는 그 이상의 메시지들을 수신하도록 구성될 수 있다. 상기 송신기는 예를 들어 상기에서 설명된 바와 같이 유선 또는 무선으로 하나 또는 그 이상의 다른 네트워크 엔티티들로 하나 또는 그 이상의 메 시지들을 송신하도록 구성될 수 있다. 상기 프로세서는 예를 들어 상기에서 설명된 바와 같은 동작들에 따 라 하나 또는 그 이상의 동작들을 수행하도록 구성될 수 있다. 여기에서 설명되는 기술들은 임의의 적합하게 구성된 장치 및/또는 시스템을 사용하여 구현될 수 있다. 그와 같 은 장치 및/또는 시스템은 여기에서 개시되는 임의의 측면, 실시 예, 예제, 또는 청구항에 따른 방법을 수행하 도록 구성될 수 있다. 그와 같은 장치는 하나 또는 그 이상의 엘리먼트들, 예를 들어 수신기들, 송신기들, 송수 신기들, 프로세서들, 제어기들, 모듈들, 유닛들, 등 중 하나 또는 그 이상을 포함할 수 있으며, 각 엘리먼트는 여기에서 개시되는 기술들을 구현하기 위한 하나 또는 그 이상의 대응하는 프로세스들, 동작들, 및/또는 방법 단계들을 수행하도록 구성된다. 예를 들어, X의 동작/기능은 X를 수행하도록 구성되는 모듈(또는 X-모듈)에 의 해 수행될 수 있다. 상기 하나 또는 그 이상의 엘리먼트들은 하드웨어, 소프트웨어, 또는 하드웨어와 소프트웨 어의 임의의 조합의 형태로 구현될 수 있다. 본 개시의 예제들은 하드웨어, 소프트웨어, 또는 하드웨어 및 소프트웨어의 임의의 조합의 형태로 구현될 수 있 음이 인식될 것이다. 임의의 그와 같은 소프트웨어는 휘발성 또는 비-휘발성 스토리지의 형태, 예를 들어, 소거 가능한지(erasable) 또는 다시 쓸 수 있는지(rewritable) 여부와 관계 없이, ROM과 같은 저장 디바이스의 형태 로, 또는 예를 들어, RAM, 메모리 칩들, 디바이스 또는 집적 회로들과 같은 메모리의 형태로, 또는 예를 들어 CD, DVD, 자기 디스크 또는 자기 테이프 등과 같은 광학적 또는 자기적으로 판독 가능한 매체에 저장될 수 있다. 상기 저장 디바이스들 및 저장 매체들은 실행 시 본 개시의 특정 예제들을 구현하는 인스트럭션들을 포함하는 프로그램 또는 프로그램들을 저장하는 데 적합한 머신-판독 가능 스토리지(storage)의 실시 예들이라는 것이 이 해될 것이다. 따라서, 특정 예제들은 여기에 개시되어 있는 임의의 예, 실시 예, 측면, 및/또는 청구항에 따른 방법, 장치 또는 시스템을 구현하기 위한 코드를 포함하는 프로그램 및/또는 그와 같은 프로그램을 저장하는 머 신-판독 가능 스토리지를 제공한다. 또한, 그와 같은 프로그램들은 임의의 매체, 예를 들어, 유선 또는 무선 연 결을 통해 전달되는 통신 신호를 통해 전자적으로 전달될 수 있다. 본 발명은 특정 예제들을 참조하여 도시되고 및 설명되었을 지라도, 해당 기술 분야의 당 업자들에 의해 첨부된 청구항들에 의해 정의되는 바와 같은, 본 발명의 범위를 벗어남이 없이 그에서 형태 및 세부 사항들에서의 다양 한 변경들이 이루어질 수 있다는 것이 이해될 것이다. 약어들 및 정의들 3GPP: 3세대 파트너쉽 프로젝트(3rd Generation Partnership Project) 5G: 5세대(5th Generation) 5GC: 5G 코어(5G Core) 5GS: 5G 시스템(5G System) AF: 애플리케이션 기능(Application Function) AI: 인공 지능(Artificial Intelligence) AMF: 액세스 및 이동성 관리 기능(Access and Mobility management Function) AS: 애플리케이션 서버(Application Server) ASP: 애플리케이션 서버 제공자(Application Service Provider) DCAF: 데이터 수집 애플리케이션 기능(Data Collection Application Function) DNAI: 데이터 네트워크 액세스 식별자(Data Network Access Identifier) DNN: 데이터 네트워크 명칭(Data Network Name) DNS: 도메인 명칭 서버(Domain Name Server) FQDN: 전체 주소 도메인 명칭(Fully Qualified Domain Name) GPSI: 일반 공중 가입 식별자(Generic Public Subscription Identifier) ID: 식별/식별자(Identity/Identifier) IMEI: 국제 이동 장비 식별자들(International Mobile Equipment Identities) IP: 인터넷 프로토콜(Internet Protocol) I-SMF: 중간 SMF(Intermediate SMF) ML: 머신 러닝(Machine Learning) MNO: 이동 네트워크 운영자(Mobile Network Operator) MT: 이동 종단(Mobile Termination) NAS: 비-액세스 계층(Non-Access Stratum) NEF: 네트워크 노출 기능(Network Exposure Function) NRF: 네트워크 리포지토리 기능(Network Repository Function) NW: 네트워크(Network) NWDAF: 네트워크 데이터 분석 기능(Network Data Analytics Function) OS: 운영 시스템(Operating System) OSAPP: OS 애플리케이션(OS Application) PCF: 정책 제어 기능(Policy Control Function) PCO: 프로토콜 구성 옵션들(Protocol Configuration Options) PDU: 프로토콜 데이터 유닛(Protocol Data Unit) RSD: 루트 선택 디스크립터(Route Selection Descriptor) SIM: 가입자 식별 모듈(Subscriber Identity Module) SLA: 서비스 레벨 합의(Service Level Agreement) SM: 세션 관리(Session Management) SMF: 세션 관리 기능(Session Management Function) S-NSSAI: 단일 네트워크 슬라이스 선택 보조 정보(Single Network Slice Selection Assistance Information) SSC: 세션 및 서비스 연속성(Session and Service Continuity) SUPI: 가입 영구 식별자(Subscription Permanent Identifier) TAI: 트래킹 영역 식별(Tracking Area Identity) TE: 단말 장비(Terminal Equipment) TS: 기술 규격(Technical Specification) UDM: 통합 데이터 관리자(Unified Data Manager) UDR: 통합 데이터 리포지토리(Unified Data Repository) UE: 사용자 장비(User Equipment) UL: 업링크(Uplink) UP: 사용자 평면(User Plane) UPF: 사용자 평면 기능(User Plane Function) URSP: UE 루트 선택 정책(UE Route Selection Policy) 도면 도면1 도면2 도면3"}
{"patent_id": "10-2024-7030432", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시는 첨부 도면들에 도시되어 있으며, 첨부 도면들 전체에서 동일한 참조 문자들은 다양한 도면들에서 대 응하는 부분들을 지시한다. 여기에서의 실시 예들은 도면들을 참조하여 다음 설명을 통해 보다 더 잘 이해될 것이며: 도 1은 AI/ML 전송 모델의 예제 아키텍쳐이다; 도 2는 AI/ML 트래픽에 대한 트래픽 라우팅 및/또는 재구성에 대한 AI/ML AF 영향을 설명하는 예제 콜 플로우이 다; 및 도 3은 본 개시의 특정 예제들에서 사용될 수 있는 예시적인 네트워크 엔티티의 블록 다이어그램이다."}
