{"patent_id": "10-2023-0045709", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0149735", "출원번호": "10-2023-0045709", "발명의 명칭": "인공 지능 모델을 기반으로 한 특정 질병의 조기 진단 검출 시스템 및 방법", "출원인": "국립강릉원주대학교산학협력단", "발명자": "정태윤"}}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 환자들에 대한 혈액 검사 데이터 및 활력 징후 데이터들이 저장된 데이터베이스; 및 인공 지능 모델을 기반으로 하여, 상기 데이터베이스를 이용하여 패혈증 조기 진단용 바이오마커를 검출하여 제공하는 바이오마커 검출 장치;를 구비하고, 상기 바이오마커 검출 장치는, 환자들의 혈액 검사 데이터 및 활력 징후 데이터들을 전처리하여 패혈증 조기 진단용 학습 데이터를 생성하여제공하는 데이터 전처리 모듈;상기 패혈증 조기 진단용 학습 데이터들로부터 패혈증 진단을 위한 특징들(Feature)들을 선택하여 바이오마커조합을 설정하는 바이오마커 조합 설정 모듈;상기 바이오마커 조합 설정 모듈에 의해 설정된 바이오마커 조합을 이용하여, 인공 지능 모델을 학습시키는 학습 모듈; 상기 학습 모듈에 의해 학습된 인공 지능 모델의 성능을 검증하는 검증 모듈; 및상기 검증 모듈에 의해 측정된 패혈증 분류 정확도가 사전 설정된 기준값 이상이면 해당 바이오마커 조합을 패혈증 조기 진단용 바이오마커로 결정하고 출력하는 바이오마커 출력 모듈;을 구비하여, 패혈증을 신속하게 조기 진단할 수 있는 바이오마커 조합을 검출하여 제공하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 데이터 전처리 모듈은,환자들의 혈액 검사 데이터들을 환자 번호를 기준으로 하여 사전 설정된 순서에 따라 특징들(Feature)을 나열하고, 환자 번호, 상기 나열된 특징 정보들, 검사 일자 정보, 질병 분류 정보를 함께 저장하여 혈액 검사 데이터들을 재구성하는 혈액 검사 데이터 재구성 모듈; 환자들의 활력 징후 데이터들을 환자 번호를 기준으로 하여 사전 설정된 순서에 따라 나열하고, 환자 번호, 상기 나열된 활력 징후 데이터들, 검사 일자 정보를 함께 저장하여 활력 징후 데이터들을 재구성하는 활력 징후데이터 재구성 모듈; 환자 번호를 기준으로 하여 검사 일자 정보에 따라 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후데이터를 병합하는 병합 모듈; 및병합된 데이터를 이용하여, 패혈증 조기 진단용 학습 데이터를 생성하여 출력하는 학습 데이터 생성 모듈;을 구비하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 활력 징후 데이터는 혈압, 맥박, 호흡, 체온 데이터 및 이들의 검사 일자 정보들을 포함하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 병합 모듈은,각 환자에 대하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터가 복수 개인 경우 검사공개특허 10-2024-0149735-3-일자의 시간 차이가 가장 낮은 값의 데이터를 병합하되, 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터의 검사 일자의 차이가 사전 설정된 시간 범위내인 경우에만 병합하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커검출 시스템."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법에 있어서, (a) 환자들의 혈액 검사 데이터 및 활력 징후 데이터들을 전처리하여 각 환자에 대한 패혈증 조기 진단용 학습데이터를 생성하여 제공하는 단계;(b) 상기 패혈증 조기 진단용 학습 데이터들로부터 패혈증 진단을 위한 특징들(Feature)을 선택하여 바이오마커조합을 설정하는 단계;(c) 상기 설정된 바이오마커 조합을 이용하여, 인공 지능 모델을 학습시키는 단계; (d) 상기 학습된 인공 지능 모델의 성능을 검증하는 단계; 및(e) 상기 검증에 의해 측정된 패혈증 분류 정확도가 사전 설정된 기준값 이상이면 해당 바이오마커 조합을 패혈증 조기 진단용 바이오마커로 결정하고 출력하는 단계;을 구비하여, 패혈증을 신속하게 조기 진단할 수 있는 바이오마커를 검출하여 제공하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 (a) 단계는,(a1) 환자들의 혈액 검사 데이터들의 특징들(Feature)을 환자 번호를 기준으로 하여 사전 설정된 순서에 따라나열하고, 환자 번호, 상기 나열된 특징 정보들, 검사 일자 정보, 질병 분류 정보를 함께 저장하여 혈액 검사데이터를 재구성하는 단계; (a2) 환자들의 활력 징후 데이터들을 환자 번호를 기준으로 하여 사전 설정된 순서에 따라 나열하고, 환자번호, 상기 나열된 활력 징후 데이터들, 검사 일자 정보를 함께 저장하여 활력 징후 데이터를 재구성하는 단계; (a3) 환자 번호를 기준으로 하여 검사 일자 정보에 따라 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력징후 데이터들을 병합하는 단계; 및(a4) 상기 병합된 데이터들을 이용하여, 패혈증 조기 진단용 학습 데이터를 생성하는 단계;를 구비하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 활력 징후 데이터는 혈압, 맥박, 호흡, 체온 데이터를 포함하는 것을 특징으로 하는 인공지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법."}
{"patent_id": "10-2023-0045709", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서, 상기 (a3) 단계는,각 환자에 대하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터가 복수 개인 경우 검사일자의 시간 차이가 가장 낮은 값의 데이터를 병합하되, 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터의 검사 일자의 차이가 사전 설정된 시간 범위내인 경우에만 병합하는 것을 특징으로 하는 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커검출 방법."}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 관한 것이다. 상기 바이 오마커 검출 시스템은, 인공 지능 모델을 기반으로 하여, 혈액 검사 데이터 및 활력 징후 데이터들이 이용하여 패혈증 조기 진단용 바이오마커를 검출하여 제공한다. 바이오마커 검출 장치는, 환자들의 혈액 검사 데이터 및 (뒷면에 계속)"}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 패혈증 조기 진단용 바이오마커 검출 시스템 및 그 방법에 관한 것으로서, 더욱 구체적으로는 인공 지능 모델을 기반으로 하여, 혈액 검사 데이터와 활력 징후 데이터 간의 상관관계를 분석하여 패혈증 분류 정확 도가 높은 바이오마커의 조합을 검출함으로써, 패혈증을 조기에 발견하고 신속하게 진단할 수 있는 바이오마커 를 탐색할 수 있도록 하는 패혈증 조기 진단용 바이오마커 검출 시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "패혈증은 조직이나 기관에 상처가 생겼을 때 미생물에 감염되어 발열, 빠른 맥박, 호흡수 증가, 백혈구 수의 증 가 또는 감소 등과 같은 염증 반응이 전신에 걸쳐 나타나는 증상으로서, 신속하게 진단하고 치료하지 않으면 생 명을 위협할 수 있는 심각한 의학적 상태이다. 따라서, 패혈증은 무엇보다도 신속하게 진단되어야 한다. 일반적 으로 패혈증 진단 방법은 다음과 같다. 1) 임상 평가: 발열, 빠른 심박수, 빠른 호흡 및 저혈압과 같은 증상을 포함하는 환자의 임상 증상을 기반으로 진단된다. 2) 혈액 검사: 혈액 검사를 통해 감염 징후를 확인하고 장기 기능을 모니터링할 수 있다. 일반적인 혈액 검사에 는 백혈구의 이상을 감지할 수 있는 전혈구수(CBC)와 감염을 일으키는 박테리아 또는 기타 병원체를 식별할 수 있는 혈액 배양 등이 포함된다. 3) 영상 검사: X-레이, CT 스캔 또는 초음파와 같은 영상 검사를 통해, 폐렴이나 신부전과 같은 감염이나 장기 손상의 징후를 찾을 수 있다. 4) 바이오마커: 프로칼시토닌 및 C-반응성 단백질(CRP)과 같은 바이오마커를 이용하여 패혈증을 진단하고 치료 에 대한 신체 반응을 모니터링할 수 있다. 한편, 최근 기계 학습을 기반으로 한 인공 지능 모델에 대한 다양한 연구 및 개발들이 진행되고 있으며, 이러한 기술들이 의료 분야 등을 포함한 많은 분야에 다양하게 응용되고 있다. 딥 러닝을 이용하여 학습되어 모델링된 인공 지능 모델은 많은 양의 환자 데이터를 분석하고 인간이 감지하기 어려운 패턴을 식별하여 패혈증 진단을 개선할 수 있는 잠재력을 가지고 있다. 따라서, 인공 지능 모델을 기반으로 한 패혈증 진단 시스템들에 대한 다양한 연구들이 진행되고 있다. 일반적으 로, 인공 지능 모델을 기반으로 한 패혈증 진단 시스템은 심박수, 혈압, 호흡수 등을 포함하는 활력 징후 데이 터, 백혈구 수, 젖산 수치 등을 포함하는 혈액 검사 데이터, 연령, 성별, 동반 질환 등을 포함하는 임상 정보들 을 다양하게 사용한다. 경우에 따라 전자 의료 기록, 의료 영상 또는 미생물 데이터와 같은 추가 데이터 소스도 포함될 수 있다. 하지만, 신경망 모델을 기반으로 하는 기존의 패혈증 진단 시스템들은 실제 임상 환경에서 해 석하고 검증하기 어려운 문제점이 내포되어 있다. 또한 이러한 신경망 모델을 기반으로 하는 패혈증 진단 시스 템들은 학습 데이터나 측정 데이터에 대한 품질, 완전성 또는 정확성 등에 따라 그 성능에 영향을 미칠 수 있다. 따라서, 본 발명은 패혈증을 신속하면서도 정확하게 조기 진단할 수 있는 바이오마커의 조합을 검출할 수 있는 방안을 제안하고자 한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제 10-2022-0104582호 (특허문헌 0002) 한국공개특허공보 제 10-2023-0015938호"}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전술한 문제점을 해결하기 위하여 본 발명은 인공 지능 모델을 기반으로 하여, 혈액 검사 데이터 및 활력 징후 데이터들의 상관 관계를 확인하여 패혈증 분류 정확도가 높은 바이오마커들의 조합들을 검출하여, 패혈증을 신 속하면서도 정확하게 조기 진단할 수 있도록 하는 패혈증 조기 진단용 바이오마커 검출 시스템 및 방법을 제공 하는 것을 목적으로 한다."}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 기술적 과제를 달성하기 위한 본 발명의 제1 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진 단용 바이오마커 검출 시스템은, 환자들에 대한 혈액 검사 데이터 및 활력 징후 데이터들이 저장된 데이터베이 스; 및 인공 지능 모델을 기반으로 하여, 상기 데이터베이스를 이용하여 패혈증 조기 진단용 바이오마커를 검출 하여 제공하는 바이오마커 검출 장치;를 구비하고, 상기 바이오마커 검출 장치는, 환자들의 혈액 검사 데이터 및 활력 징후 데이터들을 전처리하여 패혈증 조기 진 단용 학습 데이터를 생성하여 제공하는 데이터 전처리 모듈; 상기 패혈증 조기 진단용 학습 데이터들로부터 패 혈증 진단을 위한 특징들(Feature)들을 선택하여 바이오마커 조합을 설정하는 바이오마커 조합 설정 모듈; 상기 바이오마커 조합 설정 모듈에 의해 설정된 바이오마커 조합을 이용하여, 인공 지능 모델을 학습시키는 학습 모 듈; 상기 학습 모듈에 의해 학습된 인공 지능 모델의 성능을 검증하는 검증 모듈; 및 상기 검증 모듈에 의해 측 정된 패혈증 분류 정확도가 사전 설정된 기준값 이상이면 해당 바이오마커 조합을 패혈증 조기 진단용 바이오마 커로 결정하고 출력하는 바이오마커 출력 모듈;을 구비하여, 패혈증을 신속하게 조기 진단할 수 있는 바이오마 커 조합을 검출하여 제공한다. 전술한 제1 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 상기 데이터 전처리 모듈은, 환자들의 혈액 검사 데이터들을 환자 번호를 기준으로 하여 사전 설정된 순서에 따 라 특징들(Feature)을 나열하고, 환자 번호, 상기 나열된 특징 정보들, 검사 일자 정보, 질병 분류 정보를 함께 저장하여 혈액 검사 데이터들을 재구성하는 혈액 검사 데이터 재구성 모듈; 환자들의 활력 징후 데이터들을 환 자 번호를 기준으로 하여 사전 설정된 순서에 따라 나열하고, 환자 번호, 상기 나열된 활력 징후 데이터들, 검 사 일자 정보를 함께 저장하여 활력 징후 데이터들을 재구성하는 활력 징후 데이터 재구성 모듈; 환자 번호를 기준으로 하여 검사 일자 정보에 따라 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터를 병 합하는 병합 모듈; 및 병합된 데이터를 이용하여, 패혈증 조기 진단용 학습 데이터를 생성하여 출력하는 학습 데이터 생성 모듈;을 구비하는 것이 바람직하다. 전술한 제1 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 상기 활력 징후 데이터는 혈압, 맥박, 호흡, 체온 데이터 및 이들의 검사 일자 정보들을 포함하는 것이 바람직 하다. 전술한 제1 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 상기 병합 모듈은, 각 환자에 대하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터가 복 수 개인 경우 검사 일자의 시간 차이가 가장 낮은 값의 데이터를 병합하되, 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터의 검사 일자의 차이가 사전 설정된 시간 범위내인 경우에만 병합하는 것이 바 람직하다. 본 발명의 제2 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법은, (a) 환 자들의 혈액 검사 데이터 및 활력 징후 데이터들을 전처리하여 각 환자에 대한 패혈증 조기 진단용 학습 데이터 를 생성하여 제공하는 단계; (b) 상기 패혈증 조기 진단용 학습 데이터들로부터 패혈증 진단을 위한 특징들 (Feature)을 선택하여 바이오마커 조합을 설정하는 단계; (c) 상기 설정된 바이오마커 조합을 이용하여, 인공 지능 모델을 학습시키는 단계; (d) 상기 학습된 인공 지능 모델의 성능을 검증하는 단계; 및 (e) 상기 검증에 의해 측정된 패혈증 분류 정확도가 사전 설정된 기준값 이상이면 해당 바이오마커 조합을 패혈증 조기 진단용 바이오마커로 결정하고 출력하는 단계;를 구비하여, 패혈증을 신속하게 조기 진단할 수 있는 바이오마커의 조합 을 검출하여 제공한다. 전술한 제2 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법에 있어서, 상 기 (a) 단계는, (a1) 환자들의 혈액 검사 데이터들의 특징들(Feature)을 환자 번호를 기준으로 하여 사전 설정 된 순서에 따라 나열하고, 환자 번호, 상기 나열된 특징 정보들, 검사 일자 정보, 질병 분류 정보를 함께 저장 하여 혈액 검사 데이터를 재구성하는 단계; (a2) 환자들의 활력 징후 데이터들을 환자 번호를 기준으로 하여 사 전 설정된 순서에 따라 나열하고, 환자 번호, 상기 나열된 활력 징후 데이터들, 검사 일자 정보를 함께 저장하 여 활력 징후 데이터를 재구성하는 단계; (a3) 환자 번호를 기준으로 하여 검사 일자 정보에 따라 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터들을 병합하는 단계; 및 (a4) 상기 병합된 데이터들을 이용하여, 패혈증 조기 진단용 학습 데이터를 생성하는 단계;를 구비하는 것이 바람직하다. 전술한 제2 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법에 있어서, 상 기 활력 징후 데이터는 혈압, 맥박, 호흡, 체온 데이터를 포함하는 것이 바람직하다. 전술한 제2 특징에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 방법에 있어서, 상 기 (a3) 단계는 각 환자에 대하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터가 복수 개인 경우 검사 일자의 시간 차이가 가장 작은 값의 데이터를 병합하되, 상기 재구성된 혈액 검사 데이터와 상 기 재구성된 활력 징후 데이터의 검사 일자의 차이가 사전 설정된 시간 범위내인 경우에만 병합하는 것이 바람 직하다."}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템 및 방법은 혈액 검 사 데이터와 활력 징후 데이터들을 전처리하여 패혈증 조기 진단에 필요한 AI 학습 데이터를 생성할 수 있다. 또한, 본 발명에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템 및 방법은 어 떤 변수(바이오마커)들이 인공지능 분류 모델에서 가장 중요한 역할을 하는지 파악하여 해당 변수를 보완하거나 불필요한 변수를 제거하는 등의 예측력을 개선할 수 있다. 또한, 본 발명에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템 및 방법은 검 출된 바이오마커를 통해 패혈증과 관련된 인사이트를 도출하여 패혈증 발생과 밀접한 혈액 내 특정 성분의 중요 도를 확인할 수 있고, 패혈증과 관련된 기존 지식과 인공지능 분류 모델에서 파악된 바이아마커 결과를 비교하 여 기존 지식을 검증할 수 있게 된다."}
{"patent_id": "10-2023-0045709", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예에 따른 인공 신경망을 기반으로 한 패혈증 조기 진단 용 바이오마커 검출 시스템 및 방법에 대하여 구체적으로 설명한다. 도 1은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템의 구조를 도시한 블록도 이다. 도 1을 참조하면, 본 발명에 따른 패혈증 조기 진단용 바이오마커 검출 시스템은 원본 데이터들이 저 장된 데이터베이스 및 컴퓨터 등과 같은 장치로 구성된 바이오마커 검출 장치를 구비하며, 상기 바이오 마커 검출 장치는 데이터 전처리 모듈, 바이오마커 조합 설정 모듈, 학습 모듈, 검증 모듈 및 바이오마커 출력 모듈을 구비한다. 전술한 구성을 갖는 본 발명에 따른 인공 지능 모델을 기반으 로 한 패혈증 조기 진단용 바이오마커 검출 시스템은 패혈증을 신속하게 진단할 수 있는 바이오마커를 설정하여 출력하는 것을 특징으로 한다. 이하, 각 구성들에 대하여 구체적으로 설명한다. 상기 데이터베이스는 각 환자들에 대한 혈액 검사 데이터 및 활력 징후 데이터들이 저장 및 관리된다. 도 2 는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 가공되지 않은 혈 액 검사 데이터의 원본을 도시한 도표이다. 도 2를 참조하면, 일반적으로 혈액 검사 데이터는 각 환자 번호에 대하여 질병 정보, 혈액 검사 항목, 혈액 검사 수치, 혈액 검사 일자를 포함한다. 도 3은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 가공되지 않은 활력 징후 데이터의 원본 을 도시한 도표이다. 도 3을 참조하면, 일반적으로 활력 징후 데이터는 각 환자 번호에 대하여, 혈압, 맥박, 호 흡, 체온 검사 일자 및 그 정보들이 포함된다. 상기 데이터 전처리 모듈은 환자들의 혈액 검사 데이터 및 활력 징후 데이터들을 전처리하여 각 환자에 대 한 패혈증 조기 진단용 학습 데이터를 생성하여 제공한다. 상기 데이터 전처리 모듈은 혈액 검사 데이터 재구성 모듈, 활력 징후 데이터 재구성 모듈, 병합 모듈 및 학습 데이터 생성 모듈을 구비 한다. 상기 혈액 검사 데이터 재구성 모듈은, 환자들의 혈액 검사 데이터들의 특징들(Feature)을 환자 번호를 기 준으로 하여 사전 설정된 순서에 따라 나열하고, 환자 번호, 상기 나열된 특징 정보들, 검사 일자 정보, 질병 분류 정보를 포함하도록 혈액 검사 데이터들을 재구성하고 저장한다. 상기 혈액 검사 데이터 재구성 모듈은 혈 액 검사 항목과 혈액 검사 수치 열을 각각 행 인덱스, 열 인덱스로 사용하여 데이터를 재구성하고, 주어진 데이 터가 존재하지 않으면 빈칸(NaN)으로 채우며, 혈액 검사 수치에서 정수, 실수 외의 문자가 있는 경우에는 삭제 처리하는 것이 바람직하다. 도 4는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시 스템에 있어서, 재구성된 혈액 검사 데이터를 예시적으로 도시한 도표이다. 상기 활력 징후 데이터 재구성 모듈은 환자들의 활력 징후 데이터들을 환자 번호를 기준으로 하여 사전 설정된 순서에 따라 나열하고, 환자 번호, 상기 나열된 활력 징후 데이터들, 검사 일자 정보를 포함하도록 활력 징후 데이터들을 재구성하고 저장한다. 상기 활력 징후 데이터는 혈압, 맥박, 호흡, 체온 데이터를 포함한다. 상기 병합 모듈은 환자 번호를 기준으로 하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터들을 병합하여 출력한다. 상기 병합 모듈은, 각 환자에 대하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터가 복수 개인 경우 검사 일자의 시간 차이가 가장 낮은 값의 데이터를 병합하되, 상 기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터의 검사 일자의 차이가 사전 설정된 시간 범위 내인 경우에만 병합하는 것이 바람직하다. 본 발명에서는 혈액 검사 일자와 활력 징후 데이터간의 시간 차이가 Default로 120초 이내인 것을 사용하였으며 복수개인 경우 가장 낮은 값을 기준으로 데이터 병합 처리를 하였다. 도 5는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 병합 완료된 혈액 검사 데이터 및 활력 징후 데이터를 예시적으로 도시한 도표이다. 상기 학습 데이터 생성 모듈은 혈액 검사 데이터와 활력 징후 데이터의 병합 데이터를 이용하여, 패혈증 조기 진단용 학습 데이터를 생성하여 출력한다. 상기 학습 데이터 생성 모듈은 병합 데이터에 대하여, 질병 진 단 일자를 기준으로 24시간 이내의 데이터만을 사용하고 24시간이 경과한 데이터는 삭제하고, 질병 분류 코드에 서 패혈증과 기타 감염병 중 한 종류(예:폐렴)를 선택하여 예측 변수로 사용하고, 수치화를 진행하며(예; 0:패 혈증, 1:폐렴으로 표시), 환자 번호를 기준으로 중복 데이터를 제거하고, 각각의 검사 일자 데이터를 삭제하는 과정을 수행함으로써, 최종적으로 패혈증 조기 진단용 학습 데이터를 생성하여 출력한다. 도 6은 본 발명의 바 람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 패혈증 조기 진단용 학습 데이터 를 예시적으로 도시한 도표이다.상기 바이오마커 조합 설정 모듈은 상기 패혈증 조기 진단용 학습 데이터들로부터 바이오마커로 사용할 패 혈증 진단을 위한 특징들(Feature)의 조합을 설정한다. 도 7은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커의 조합들을 예시적으로 도시한 도표이다. 도 7을 참조하 면, 훈련 변수들을 복수 개로 조합할 수 있으며, 랜덤하게 조합할 수 있으며, 순서는 있으나 중복없는 모든 경 우의 수를 나열하여 리스트로 저장할 수 있다. 상기 학습 모듈은 상기 바이오마커 조합 설정 모듈에 의해 설정된 특징들의 조합, 즉 바이오마커의 조합을 이용하여, 인공 지능 모델을 학습시킨다. 이때, 패혈증 조기 진단용 학습 데이터는 훈련 데이터와 검증데이터를 분리하는 것이 바람직하다. 상기 검증 모듈은 상기 학습 모듈에 의해 학습된 인공 지능 모델의 성능을 검증한다. 상기 바이오마커 출 력 모듈은 상기 검증 모듈에 의한 정확도가 사전 설정된 기준값 이상이면 해당 특징들의 조합을 패혈증 조 기 진단용 바이오마커로 결정하고 출력한다. 도 8은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커의 조합들 및 이에 따른 모델 성능 결과를 예시적으로 도시한 도표이다. 도 8을 참조하면, 바이오마커의 조합에 따 른 패혈증 조기 진단의 정확도를 확인할 수 있다. 본 발명에 따른 시스템의 바이오마커 출력 모듈은 가장 정확 도가 우수한 바이오마커의 조합을 선택하여 제공할 수 있다. 도 9는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 인공 지능 모 델의 성능에서 바이오마커의 조합들의 중요도를 예시적으로 도시한 그래프이다. 이하, 본 발명의 바람직한 실시예에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커 검출 장치에 의해 수행되는 바이오마커 검출 방법을 구체적으로 설명한다. 도 10은 본 발명의 바람직한 실시예에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커 검출 방법을 순차적으로 도시한 흐름도이다. 도 10을 참조하면, 본 발명에 따른 바이오마커 검출 방법은 환자들의 혈액 검사 데이터 및 활력 징후 데이터들을 전처리하여 각 환자에 대한 패혈 증 조기 진단용 학습 데이터를 생성하여 제공하는 데이터 전처리 단계, 상기 패혈증 조기 진단용 학습 데이터들 로부터 패혈증 진단을 위한 특징들(Feature)의 조합을 생성하여 바이오마커 조합을 설정하는 단계, 바이오마커 조합을 이용하여 인공 지능 모델을 학습시키는 단계, 상기 학습된 인공 지능 모델의 성능을 검증하는 단계 및 상기 검증에 의해 측정된 정확도를 이용하여 패혈증 조기 진단용 바이오마커를 결정하는 단계를 구비하여, 패혈 증을 신속 진단할 수 있는 바이오마커의 조합을 검출하여 제공한다. 전술한 본 발명에 따른 바이오마커 검출 방법에 있어서, 데이터 전처리 단계에 대하여 보다 구체적으로 설명한 다. 도 11은 본 발명의 바람직한 실시예에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커 검출 방법에서의 데이터 전처리 단계를 순차적으로 도시한 흐름도이다. 도 11을 참조하면, 상기 데이터 전처리 단계는, 혈액 검사 데이터 재구성 단계, 활력 징후 데이터 재구성 단계, 데이터 병합 단계 단계 및 학습 데이터 생성 단계를 구비하여, 상기 데이터베이스에 저장된 혈액 검사 데이터 및 활력 징후 데이터들을 재구성하고 병합하여 패혈증 조기 진단용 학습 데이터를 생성한다. 이하, 상기 데이터 전처리 단계의 각 세부 단계들에 대하여 구체적으로 설명한다. 상기 혈액 검사 데이터 재구성 단계는, 데이터베이스에 저장된 환자들에 대한 혈액 검사 데이터 원본을 이용하 여, 환자 번호를 기준으로 하여 사전 설정된 순서에 따라 동일한 검사 일자에 검사된 특징들(Feature)을 나열하 고, 환자 번호, 상기 나열된 특징 정보들, 검사 일자 정보, 질병 분류 정보를 포함하도록 혈액 검사 데이터를 재구성하고 저장한다. 상기 활력 징후 데이터 재구성 단계는, 데이터베이스에 저장된 환자들에 대한 활력 징후 데이터 원본을 이용하 여, 환자 번호를 기준으로 하여 사전 설정된 순서에 따라 사전 설정된 기간내에 측정된 활력 징후 데이터들을 나열하고, 환자 번호, 상기 나열된 활력 징후 데이터들, 검사 일자 정보를 포함하도록 활력 징후 데이터들을 재 구성하고 저장한다. 상기 데이터 병합 단계는, 환자 번호를 기준으로 하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터들을 병합하여 출력한다. 이때, 각 환자에 대하여 상기 재구성된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터가 복수 개인 경우 검사 일자의 시간 차이가 가장 낮은 값의 데이터를 병합하되, 상기 재구성 된 혈액 검사 데이터와 상기 재구성된 활력 징후 데이터의 검사 일자의 차이가 사전 설정된 시간 범위내인 경우에만 병합하는 것이 바람직하다. 상기 학습 데이터 생성 단계는, 병합 데이터에서 결측값을 처리하고, 특수 문자 등을 처리하여, 패혈증 조기 진 단용 학습 데이터를 생성한다. 이상에서 본 발명에 대하여 그 바람직한 실시예를 중심으로 설명하였으나, 이는 단지 예시일 뿐 본 발명을 한정 하는 것이 아니며, 본 발명이 속하는 분야의 통상의 지식을 가진 자라면 본 발명의 본질적인 특성을 벗어나지 않는 범위에서 이상에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 그리고, 이러한 변형과 응용에 관계된 차이점들은 첨부된 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어 야 할 것이다."}
{"patent_id": "10-2023-0045709", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템의 구조를 도시한 블록도 이다. 도 2는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 가공되지 않 은 혈액 검사 데이터의 원본을 도시한 도표이다. 도 3은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 가공되지 않 은 활력 징후 데이터의 원본을 도시한 도표이다. 도 4는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 재구성된 혈 액 검사 데이터를 예시적으로 도시한 도표이다. 도 5는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 병합 완료된 혈액 검사 데이터 및 활력 징후 데이터를 예시적으로 도시한 도표이다. 도 6은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 패혈증 조기 진단용 학습 데이터를 예시적으로 도시한 도표이다. 도 7은 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커의 조합들을 예시적으로 도시한 도표이다. 도 8는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커의 조합들 및 이에 따른 모델 성능 결과를 예시적으로 도시한 도표이다. 도 9는 본 발명의 바람직한 실시예에 따른 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 인공 지능 모 델의 성능에서 바이오마커의 조합들의 중요도를 예시적으로 도시한 그래프이다. 도 10은 본 발명의 바람직한 실시예에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커 검출 방법을 순차적으로 도시한 흐름도이다. 도 11은 본 발명의 바람직한 실시예에 따른 인공 지능 모델을 기반으로 한 패혈증 조기 진단용 바이오마커 검출 시스템에 있어서, 바이오마커 검출 방법에서의 데이터 전처리 단계를 순차적으로 도시한 흐름도이다."}
