{"patent_id": "10-2024-0092387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0036003", "출원번호": "10-2024-0092387", "발명의 명칭": "메모리 인터페이스 구동회로의 출력 임피던스 보정 방법 및 장치", "출원인": "한국전자통신연구원", "발명자": "조민형"}}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메모리 인터페이스 구동회로의 출력 임피던스를 보정하는 장치에 있어서,서로 병렬 연결된 복수개의 제1 서브 PD 드라이버를 포함하는 제1 PD 드라이버;풀다운 스윕시마다 상기 복수개의 제1 서브 PD 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인제1 제어 코드를 순차적으로 변화시키는 제1 제어부; 및상기 제1 제어 코드에 따라 생성되는 상기 제1 PD 드라이버의 출력 전압과 제1 기준전압을 비교한 결과를 나타내는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성하는 제1 비교기를 포함하고,상기 제1 제어부는, 상기 제1 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제1 임피던스 보정 코드를 상기 순차적으로 변화되는 제1 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 PD 드라이버의 출력단에는 기준 저항의 일단이 연결되고, 상기 외부 저항의 타단에는 제1 전원이 연결되는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 제어부는,상기 제1 출력 패턴을 상기 제어 코드에 따라 기설정된 풀다운 스윕 횟수 만큼 누적하고, 상기 누적된 제1 출력패턴에 기초하여 상기 제1 임피던스 보정 코드를 결정하는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제1 제어부는,상기 누적된 제1 출력 패턴에 포함된 0 또는 1의 개수에 대하여 풀다운 스윕시마다의 제1 평균을 산출하고, 상기 제1 평균에 따라 상기 제1 임피던스 보정 코드를 결정하는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제1 제어부는,상기 누적된 제1 출력 패턴에 포함된 1 또는 0의 제1 누적 개수를 산출하고 상기 제1 누적 개수를 상기 풀다운스윕 횟수로 나누어 상기 제1 평균을 산출하는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제1 제어부는,공개특허 10-2025-0036003-3-각 회차의 풀다운 스윕 시의 제1 제어 코드를 순차적으로 생성하는 제1 코드 생성부;상기 각 회차의 풀다운 스윕 시의 상기 제1 출력 패턴에 포함된 0 또는 1의 개수를 계수하여 제1 계수 결과를생성하는 제1 카운터;상기 제1 계수 결과에 대하여 일정 비트만큼 우측으로 쉬프트하여 제1 평균값을 산출하는 제1 쉬프트 레지스터;및상기 각 회차의 풀다운 스윕에 대응하는 제1 제어 코드 중에서 상기 제1 평균값에 대응하는 제1 제어 코드를 선택하여 상기 제1 임피던스 보정 코드로서 결정하는 제1 코드 저장부를 포함하는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 풀다운 스윕의 횟수는 2n(단, n은 1 이상의 자연수)에 해당하는 횟수로 설정되는 것을 특징으로 하는 출력임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 제1 쉬프트 레지스터는,상기 제1 계수 결과를 n비트 만큼 우측으로 쉬프트하여 상기 제1 평균값을 산출하는 것을 특징으로 하는 출력임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 제1 코드 저장부는,상기 제1 임피던스 보정 코드를 상기 메모리 인터페이스 구동회로에 제공하는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,서로 병렬 연결된 복수개의 제2 서브 PD 드라이버를 포함하는 제2 PD 드라이버를 더 포함하고,상기 제1 임피던스 보정 코드를 이용하여 상기 복수개의 제2 서브 PD 드라이버의 출력을 를 제어하는 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,서로 병렬 연결된 복수개의 서브 PU 드라이버를 포함하되 출력단자가 제2 PD 드라이버의 출력단자에 연결되는PU 드라이버;상기 복수개의 서브 PU 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인 제2 제어 코드를 순차적으로 변화시키는 제2 제어부; 및상기 제2 제어 코드에 따라 생성되는 상기 제1 PU 드라이버의 출력 전압과 제2 기준전압을 비교한 결과를 나타내는 제2 출력 패턴을 생성하는 제2 비교기를 더 포함하고,상기 제2 제어부는, 상기 제2 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제2 임피던스 보정 코드를 상기 순차적으로 변화되는 제2 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정공개특허 10-2025-0036003-4-장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 메모리 인터페이스 구동회로는,서로 병렬로 연결된 복수의 서브 풀다운 드라이버를 포함하는 풀다운 드라이버 및 서로 병렬로 연결된 복수의서브 풀다운 드라이버를 포함하는 풀업 드라이버를 포함하고,상기 복수의 서브 풀다운 드라이버의 연결구조는 상기 복수의 제1 서브 PD 드라이버의 연결 구조와 동일하고,상기 복수의 서브 풀업 드라이버의 연결구조는 상기 복수의 서브 PU 드라이버의 연결 구조와 동일한 것을 특징으로 하는 출력 임피던스 보정 장치."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "서로 병렬 연결된 복수개의 제1 서브 PD 드라이버를 포함하는 출력 임피던스 보정 장치가 메모리 인터페이스 구동회로의 출력 임피던스를 보정하는 방법에 있어서,풀다운 스윕시마다 상기 복수개의 제1 서브 PD 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인제1 제어 코드를 순차적으로 변화시키는 제1 제어 과정; 및상기 제1 제어 코드에 따라 생성되는 상기 제1 PD 드라이버의 출력 전압과 제1 기준전압을 비교한 결과를 나타내는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성하는 제1 비교 과정을 포함하고,상기 제1 제어 과정은, 상기 제1 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제1 임피던스보정 코드를 상기 순차적으로 변화되는 제1 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제1 제어 과정은,상기 제1 출력 패턴을 상기 제어 코드에 따라 기설정된 풀다운 스윕 횟수 만큼 누적하고, 상기 누적된 제1 출력패턴에 기초하여 상기 제1 임피던스 보정 코드를 결정하는 것을 특징으로 하는 출력 임피던스 보정 방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 제1 제어 과정은,상기 누적된 제1 출력 패턴에 포함된 0 또는 1의 개수에 대하여 풀다운 스윕시마다의 제1 평균을 산출하고, 상기 제1 평균에 따라 상기 제1 임피던스 보정 코드를 결정하는 것을 특징으로 하는 출력 임피던스 보정 방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 제1 제어 과정은,상기 누적된 제1 출력 패턴에 포함된 1 또는 0의 제1 누적 개수를 산출하고 상기 제1 누적 개수를 상기 풀다운스윕 횟수로 나누어 상기 제1 평균을 산출하는 것을 특징으로 하는 출력 임피던스 보정 방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제14항에 있어서,공개특허 10-2025-0036003-5-상기 풀다운 스윕의 횟수는 2n(단, n은 1 이상의 자연수)에 해당하는 횟수로 설정되는 것을 특징으로 하는 출력임피던스 보정 방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제1 제어 과정은,상기 제1 계수 결과를 n비트 만큼 우측으로 쉬프트하여 상기 제1 평균값을 산출하는 것을 특징으로 하는 출력임피던스 보정 방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서,상기 출력 임피던스 보정 장치는, 서로 병렬 연결된 복수개의 제2 서브 PD 드라이버를 포함하는 제2 PD 드라이버를 더 포함하고,상기 제1 임피던스 보정 코드를 이용하여 상기 복수개의 제2 서브 PD 드라이버의 출력을 제어하는 과정을 더 포함하는 것을 특징으로 하는 출력 임피던스 보정 방법."}
{"patent_id": "10-2024-0092387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 출력 임피던스 보정 장치는, 서로 병렬 연결된 복수개의 서브 PU 드라이버를 포함하되 출력단자가 제2 PD드라이버의 출력단자에 연결되는 PU 드라이버를 더 포함하되,풀업 스윕시마다 상기 복수개의 서브 PU 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인 제2 제어 코드를 순차적으로 변화시키는 제2 제어 과정; 및상기 제2 제어 코드에 따라 생성되는 상기 제1 PU 드라이버의 출력 전압과 제2 기준전압을 비교한 결과를 나타내는 제2 출력 패턴을 생성하는 제2 비교 과정을 더 포함하고,상기 제2 제어 과정은, 상기 제2 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제2 임피던스보정 코드를 상기 순차적으로 변화되는 제2 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정방법."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 메모리 인터페이스 구동회로의 출력 임피던스 보정 방법 및 장치에 관한 것이다. 본 개시의 일 측면에 의하면, 메모리 인터페이스 구동회로의 출력 임피던스를 보정하는 장치에 있어서, 서로 병 렬 연결된 복수개의 제1 서브 PD 드라이버를 포함하는 제1 PD 드라이버; 풀다운 스윕시마다 상기 복수개의 제1 서브 PD 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인 제1 제어 코드를 순차적으로 변화시키는 제1 제어부; 및 상기 제1 제어 코드에 따라 생성되는 상기 제1 PD 드라이버의 출력 전압과 제1 기준전압을 비교 한 결과를 나타내는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성하는 제1 비교기를 포함하고, 상기 제1 제어부는, 상기 제1 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제1 임피던스 보정 코드를 상기 순차적 으로 변화되는 제1 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정 장치를 제공한다."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 메모리 인터페이스 구동회로의 출력 임피던스 보정 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구성하는 것이 아니 다. DRAM(Direct Random Access Memory)으로 대표되는 메모리 소자는 PC(Personal Computer), 노트북, 컴퓨터 서버, 스마트폰, 태블릿, 자동차 부품 등 연산을 필요로 하는 거의 대부분의 전자기기에 범용적으로 메인 메모 리로 사용되고 있다. PC 등의 전자기기에서 더욱 높은 성능 향상을 위해서는 프로세서의 연산 속도 향상뿐만 아 니라 메모리의 데이터 입출력 속도도 함께 빨라져야 한다. 최근 인공지능 기술을 이용한 빅데이터 처리 시스템의 경우 많은 양의 데이터 처리로 인해 더욱 많은 용량과 더 욱 빠른 데이터 전송 속도를 갖는 메모리에 대한 요구가 급증하고 있다. 현재 PC, 컴퓨터 서버 등에서 가장 많 이 사용되는 DDR5 메모리는 최대 6.4Gbps/pin의 전송속도를 갖고 있다. 또한, 인공지능 연산, 게임 등에서 GPU(Graphics Processing Unit) 연산에 특화된 메모리인 GDDR(Graphics Double Data Rate) 메모리의 하나인GDDR6의 경우 현재 최대 24Gbps/pin의 빠른 전송속도를 갖는다. 메모리 인터페이스에서 수 GHz 이상의 빠른 데이터 송수신을 위해서는 송수신 신호의 무결성 유지가 매우 중요 하며, 신호 무결성에 가장 큰 영향을 주는 것이 임피던스 매칭이다. 즉, 신호 송신부의 출력 임피던스와 신호 전송선의 임피던스 및 신호 수신부의 입력 임피던스가 모두 서로 매칭되어야 신호 반사에 의한 신호 손실 및 왜 곡이 최소화되어 고속 데이터 송수신이 가능하게 된다."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는, 메모리 인터페이스 구동회로의 출력 임피던스 보정 방법 및 장치를 제공하는 데에 주된 목적이 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면에 의하면, 메모리 인터페이스 구동회로의 출력 임피던스를 보정하는 장치에 있어서, 서로 병 렬 연결된 복수개의 제1 서브 PD 드라이버를 포함하는 제1 PD 드라이버; 풀다운 스윕시마다 상기 복수개의 제1 서브 PD 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인 제1 제어 코드를 순차적으로 변화시키 는 제1 제어부; 및 상기 제1 제어 코드에 따라 생성되는 상기 제1 PD 드라이버의 출력 전압과 제1 기준전압을 비교한 결과를 나타내는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성하는 제1 비교기를 포함하고, 상기 제1 제어 부는, 상기 제1 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제1 임피던스 보정 코드를 상기 순차적으로 변화되는 제1 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정 장치를 제공한다. 본 개시의 다른 측면에 의하면, 서로 병렬 연결된 복수개의 제1 서브 PD 드라이버를 포함하는 출력 임피던스 보 정 장치가 메모리 인터페이스 구동회로의 출력 임피던스를 보정하는 방법에 있어서, 풀다운 스윕시마다 상기 복 수개의 제1 서브 PD 드라이버를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인 제1 제어 코드를 순차적으 로 변화시키는 제1 제어 과정; 및 상기 제1 제어 코드에 따라 생성되는 상기 제1 PD 드라이버의 출력 전압과 제 1 기준전압을 비교한 결과를 나타내는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성하는 제1 비교 과정을 포함하 고, 상기 제1 제어 과정은, 상기 제1 출력 패턴을 이용하여 상기 메모리 인터페이스 구동회로에 대한 제1 임피 던스 보정 코드를 상기 순차적으로 변화되는 제1 제어 코드 중에서 결정하는 것을 특징으로 하는 출력 임피던스 보정 방법을 제공한다."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같이 본 개시의 실시예에 의하면, 메모리 인터페이스 구동회로의 출력 임피던스 보정 회 로에서 보정 수행 중에 소자, 회로 및 동작환경으로부터 발생하는 다양한 원인의 잡음에 의해 출력 임피던스의 보정 결과에 오류가 발생하는 것을 최소화할 수 있어 더욱 정확한 데이터 구동회로의 출력 임피던스 보정을 수 행할 수 있다. 잡음에 의한 출력 임피던스의 보정 결과의 에러가 최소화됨으로써 신호 무결성이 향상되는 효과가 있다. 또한, 신호 무결성이 향상되므로 더욱 빠른 속도의 데이터 전송이 가능한 메모리 인터페이스의 구성이 가능해지 는 효과가 있다. 본 개시의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성 요소들에 식별 부 호를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호 를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 본 개시에 따른 실시예의 구성요소를 설명하는 데 있어서, 제1, 제2, i), ii), a), b) 등의 부호를 사용할 수 있다. 이러한 부호는 그 구성요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 부호에 의해 해당 구성요소의 본질 또는 차례나 순서 등이 한정되지 않는다. 명세서에서 어떤 부분이 어떤 구성요소를 '포함' 또는 '구비'한 다고 할 때, 이는 명시적으로 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 개시의 예시적인 실시형태를 설명하고자 하는 것이며, 본 개시가 실시될 수 있는 유일한 실시형태를 나타내고자 하는 것이 아니다. 메모리 인터페이스에서 신호 송신부의 출력 임피던스는 칩 제조공정상의 변화, 전원전압, 온도 등 제작 및 동작 환경에 따라 통상적으로 30% 정도까지 변화가 발생할 수 있으므로 이러한 변화를 보정하기 위한 출력 임피던스 보정 기능이 필요하다. 도 1은 출력 임피던스 조정이 가능한 메모리 인터페이스 구동회로를 예시한 도면이다. 도 1에 도시된 바와 같이, 메모리 인터페이스 구동회로는, 풀다운 드라이버(Pull-down Driver, 110), 풀업 드라이버(Pull-up Driver, 120) 및 프리 드라이버(pre-Driver, 130)를 포함하여 구성된다. 풀다운 드라이버는 데이터 입력인 TxD의 로직(logic) Low를 전송하는 기능을 하고, 풀업 드라이버는 TxD의 로직 High를 전송하는 기능을 하고, 프리 드라이버는 TxD 입력에 따라 풀다운 드라이버 또는 풀업 드라이버를 선택적으로 구동하기 위한 게이트 신호를 생성한다. 메모리 인터페이스 구동 회로의 출력 임피던스는 출력단자(DQ)에 연결되는 저항 소자(R)의 제1 임피던스와 각 드라이버(110, 120) 내의 ON이 되는 MOS(Metal Oxide Semiconductor) 소자의 제2 임피던스에 따라 결정된다. 그런데 제1 및 제2 임피던스의 값은 PVT(Process, Voltage, Temperature) 변화에 그 값이 일정 범위 내에서 변 한다. 공정(process)에 의한 임피던스 변화는 반도체 칩 제작 공정 과정에서 발생하는 소자 임피던스 값의 변화이고, 전압(voltage)에 의한 변화는 회로의 동작 조건에서 각 소자에 인가되는 전압 조건에 의해 변화되는 임피던스 값이고, 온도(temperature)에 의한 변화는 회로 동작 시 주변 온도 변화에 따라 변화되는 임피던스 값이다.이러한 PVT 변화에 의한 소자 임피던스 값의 변화는 설계값에서 최대 30% 수준까지 변하기도 한다. 이렇게 다양 한 원인에 의해 소자 임피던스 값이 설계값과 다르게 변하게 되면 메모리 인터페이스 구동 회로의 출력 임 피던스도 바뀌게 된다. 메모리 인터페이스 구동 회로의 출력 임피던스가 변화함에 따라 신호 수신단의 임피던스와 정합(matching) 되지 않게 되면 전송 신호가 신호 수신단에서 반사되어 제대로 전송되지 않고, 또한 신호 수신단에서의 전압 레 벨도 바뀌게 되어 전송된 데이터가 제대로 수신되지 않을 수 있다. 이러한 출력 임피던스의 변화가 발생하는 경 우 메모리 인터페이스 구동 회로의 출력 임피던스가 보정(ZQ 캘리브레이션)되어야 한다. 도 1에서, 풀다운 드라이버와 풀업 드라이버는 각각 복수의 서브 풀다운 드라이버(sub pull-down driver, 111, 112, 113, 114) 및 복수의 서브 풀업 드라이버(sub pull-up driver, 121, 122, 123, 124)가 병렬 로 연결된 형태로 구성된다. 복수의 서브 풀다운 드라이버(111, 112, 113, 114) 및 복수의 서브 풀업 드라이버 (121, 122, 123, 124) 중에서 각각 ON이 된 서브 풀다운 드라이버의 개수 및 각각 ON이 된 서브 풀업 드라이버 의 개수의 조합에 따라 서로 다른 출력 임피던스가 결정된다. 복수의 서브 풀다운 드라이버(111, 112, 113, 114) 및 복수의 서브 풀업 드라이버(121, 122, 123, 124)들은 각 각 서로 동일한 출력 임피던스를 갖도록 구성될 수도 있다. 또한, 복수의 서브 풀다운 드라이버(111, 112, 113, 114)가 서로 binary-weighted 관계를 갖고 복수의 서브 풀업 드라이버(121, 122, 123, 124)가 서로 binary- weighted 관계를 갖도록 구성될 수도 있다. 또한, 복수의 서브 풀다운 드라이버(111, 112, 113, 114)가 서로 다 른 출력 임피던스 비율을 갖고 복수의 서브 풀업 드라이버(121, 122, 123, 124)가 서로 다른 출력 임피던스 비 율을 갖도록 구성되는 등 출력 임피던스의 제어 방식에 따라 다양하게 구성될 수 있다. 출력 임피던스 보정 과정이란 병렬로 구성된 복수의 서브 풀다운 드라이버(111, 112, 113, 114)와 병렬로 구성 된 복수의 서브 풀업 드라이버(121, 122, 123, 124)가 각각 원하는 출력 임피던스 값을 갖도록 하기 위하여, ON 이 되는 서브 풀다운 드라이버 및 ON이 되는 서브 풀업 드라이버들의 조합을 찾는 과정을 의미한다. 도 2는 일반적인 메모리 인터페이스 구동 회로의 출력 임피던스를 보정하기 위한 임피던스 보정회로의 구 조를 예시한 도면이다. 도 1에서 설명된 바와 같이 메모리 인터페이스 구동 회로는 로직 Low 신호의 전송을 위한 풀다운 드라이버 와 로직 High 신호의 전송을 위한 풀업 드라이버를 포함하고 있으므로, 출력 임피던스 보정도 풀다운 드라이버에 대한 보정(즉, 풀다운 캘리브레이션(PD Calibration))과 풀업 드라이버에 대한 보정(즉, 풀업 캘리브레이션(PU Calibration))이 각각 이루어져야 한다. 따라서, 도 2에 도시된 바와 같이, 임피던스 보정회로는 풀다운 드라이버에 대한 보정 수행을 위한 풀다운 캘리브레이션 블록(Pull-down Calibration Block, 210) 및 풀업 드라이버에 대한 보정 수행을 위 한 풀업 캘리브레이션 블록(Pull-up Calibration block, 220)을 포함한다. 도 2에서 제1 PD 드라이버는 메모리 인터페이스 구동 회로의 풀다운 드라이버와 동일한 구성을 갖는 회로이고, PU 드라이버는 메모리 인터페이스 구동 회로의 풀업 드라이버와 동일한 회로 구 성을 갖는다. 제1 비교기는 캘리브레이션 과정에서 변화되는 제1 PD 드라이버의 출력 임피던스에 따라 변화되는 전 압인 VPD의 크기와 기준 전압 VREF,PD의 크기를 서로 비교하고 그 비교 결과에 따라 0 또는 1을 출력하고, 제2 비 교기는 캘리브레이션 과정에서 변화되는 PU 드라이버의 출력 임피던스에 따라 변화되는 전압인 VPU의 크기와 기준 전압 VREF,PU의 크기를 서로 비교하고 그 비교 결과에 따라 0 또는 1을 출력한다. PD Calibration Control 블록은 제1 비교기의 출력을 각각 입력받아 제1 PD 드라이버 내부의 복수의 서브 풀다운 드라이버를 각각 ON 또는 OFF로 제어하는 제어 신호 DPD,CAL를 생성하고 제1 PD 드라이버 에 대한 캘리브레이션(즉, PD 캘리브레이션)이 완료되었는지 여부를 판단한다. PU Calibration Control 블록은 제2 비교기의 출력을 입력받아 PU 드라이버 내부의 복수의 서 브 풀업 드라이버를 각각 ON 또는 OFF로 제어하는 제어 신호 DPU,CAL를 생성하고 PU 드라이버에 대한 캘리브 레이션(즉, PU 캘리브레이션)이 완료되었는지 여부를 판단한다. 도 2에서 출력 임피던스 보정 과정은 다음과 같다. 먼저 Pull-down Calibration 블록이 동작하여 메모리 인터페이스 구동 회로의 풀다운 드라이버 의 출력 임피던스를 보정하기 위한 풀다운 제어 코드 DPD,CAL 를 생성한다. - PD Calibration Control 블록은 기준 저항 RREF의 일단과 제1 PD 드라이버의 출력단이 서로 연결된 노드의 전압 VPD와 기준 전압인 VREF,PD를 서로 비교하여 두 전압이 같아지거나 그 차이가 최소화 되도록 제1 PD 드라이버 내부의 복수의 서브 풀다운 드라이버를 각각 ON 또는 OFF로 제어한다. 이때, 제1 PD 드라이버 내의 복수의 서브 풀다운 드라이버를 각각 ON 또는 OFF로 제어하기 위한 게이트 신호(DPD0, DPD1, DPD2, ..., DPDn)를 코드화한 것이 DPD,CAL 코드이다. - 노드 전압 VPD와 기준 전압 VREF,PD 사이의 전압 차이가 최소화되도록( 아니면 같아지도록) 하기 위하여, PD Calibration Control 블록에서 제1 PD 드라이버의 모든 서브 풀다운 드라이버를 OFF시키도록 DPD,CAL 코드를 설정한 후 서브 풀다운 드라이버를 하나씩 추가적으로 ON 시키도록 DPD,CAL 코드를 변화시키면서 제1 PD 드라이버의 출력 임피던스의 크기를 단계적으로 제어한다. DPD,CAL 코드의 변화에 따라 전압 VPD 와 전압 VREF,PD 을 서로 비교하는 과정에서 VPD 이 VREF,PD 보다 높은 상태에서 VPD 이 VREF,PD 보다 낮아지거나 같아지는 상태로 변하는 순간이 제1 PD 드라이버의 출력 임피던스가 설정된 시점이다. 즉, 이 시점은 제1 PD 드라이버의 출력 임피던스는 외부 기준 저항의 임피던스 RREF와 같아지는 값을 갖는 시점이거나 또는 RREF와의 차이가 최소화된 값으로서 RREF에 일정 비율로 비례하는 값으로 설정되는 시 점이다. 이때, 제1 PD 드라이버의 출력 임피던스 값 ZQPD는 수학식 1에 따라 결정된다. 수학식 1"}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, VDDQ는 저항 RREF의 타단에 연결된 전원 전압을 의미한다. 변화되는 DPD,CAL 코드 중에서 ZQPD가 결정되는 시점의 VPD 를 생성하기 위한 DPD,CAL 코드가 DPD 코드로 결정되며, DPD 코드가 메모리 인터페이스 구동회로의 풀다운 드라이버의 출력 임피던스를 조정하기 위한 복수의 서브 풀다운 드라이버(111, 112, 113, 114)의 ON/OFF 제어 코드로서 사용된다. 풀다운 드라이버에 대한 캘리브레이션이 완료된 후 Pull-up Calibration 블록이 동작하여 메모리 인터페이스 구동 회로의 풀업 드라이버의 출력 임피던스를 보정한다. - 풀업 드라이버를 위한 캘리브레이션은 풀다운 드라이버의 캘리브레이션 시의 기준 저항 RREF 대신 풀다운 드라이버의 출력 임피던스 ZQPD가 기준 저항으로 사용된다. 이를 위하여 Pull-up Calibration 블록 은 제2 PD 드라이버를 포함하며, 제2 PD 드라이버는 DPD 코드에 의해 ON/OFF 제어되어 출력 임 피던스 ZQPD를 갖도록 설정된다. - PU Calibration Control 블록은, PU 드라이버의 출력단과 제2 PD 드라이버의 출력단이 서로 연결된 노드(VPU 노드)의 전압 VPU와 기준 전압인 VREF,PU를 서로 비교하여 두 전압이 같아지거나 그 차이가 최소가 되도록 PU 드라이버 내부의 복수의 서브 풀업 드라이버를 각각 ON 또는 OFF로 제어한다. 이때, PU 드라이 버 내의 복수의 서브 풀업 드라이버를 각각 ON 또는 OFF로 제어하기 위한 게이트 신호(DPU0, DPU1, DPU2, ..., DPUn)를 코드화한 것이 DPU,CAL 코드이다. - PU Calibration Control 블록에서 PU 드라이버의 모든 서브 풀업 드라이버를 OFF시키도록 DPU,CAL 코드를 설정한 후, 서브 풀업 드라이버를 하나씩 추가적으로 ON 시키도록 DPU,CAL 코드를 변화시키면서 PU 드라이 버의 출력 임피던스의 크기를 단계적으로 제어한다.DPU,CAL 코드의 변화에 따라 전압 VPU 와 전압 VREF,PU 을 서로 비교하는 과정에서 VPU 이 VREF,PU 보다 낮은 상태에서 VPU 이 VREF,PU 보다 높아지거나 같아지는 상태로 변하는 순간이 PU 드라이버의 출력 임피던스가 설정된 시점 이다. 즉, 이 시점은 PU 드라이버의 출력 임피던스가 Calibration이 완료된 제2 PD 드라이버의 출력 임피던스 ZQPD와 같아지는 값을 갖는 시점이거나 또는 ZQPD와의 차이가 최소화된 값으로서 ZQPD에 일정 비율로 비 례하는 값으로 설정되는 시점이다. 이때, PU 드라이버의 출력 임피던스 값 ZQPU는 수학식 2에 따라 결정된 다. 수학식 2"}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "변화되는 DPU,CAL 코드 중에서 ZQPU가 결정되는 시점의 VPU 를 생성하기 위한 DPU,CAL 코드가 DPU 코드로 결정되며, DPU 코드가 메모리 인터페이스 구동회로의 풀업 드라이버의 출력 임피던스를 조정하기 위한 복수의 서 브 풀업 드라이버의 ON/OFF 제어 코드로서 사용된다. 도 3a는 PD Calibration Control 블록의 구성을 예시한 도면이고, 도 3b는 PU Calibration Control 블록 의 구성을 예시한 도면이다. PD Calibration Control 블록은 Up/Down Counter, 제1 Flip-Flop 및 제1 End_Calibration 블 록을 포함한다. Up/Down Counter는 제1 비교기의 출력을 입력으로 받아 그 값을 기준으로 제1 PD 드라이버의 제어를 위한 DPD,CAL 신호를 생성한다. 제1 Flip-Flop은 PD Calibration이 완료된 후 PD Calibration 완료시의 제어값인 DPD를 저장하고 메모리 인터페이스 구동회로에 DPD를 출력한다. 제1 End_Calibration 블록은 PD Calibration의 완료 여부를 판단하는 기능을 수행한다. PU Calibration Control 블록은 Up/Down Counter, 제2 Flip-Flop 및 제2 End_Calibration 블 록을 포함한다. Up/Down Counter는 제2 비교기의 출력을 입력으로 받아 그 값을 기준으로 PU 드라이버의 제어를 위한 DPU,CAL 신호를 생성한다. 제2 Flip-Flop은 PU Calibration이 완료된 후 PU Calibration 완료시의 제어값인 DPU를 저장하고 메모리 인터페이스 구동회로에 DPU를 출력한다. 제2 End_Calibration 블록은 PU Calibration의 완료 여부를 판단하는 기능을 수행한다. 도 4는 임피던스 보정회로의 주요 동작 파형을 도시한 도면이다. 임피던스 보정회로에서 PD Calibration 시에, 제1 비교기는 전압 VPD 및 전압 VREF,PD 를 서로 비교하 고, 도 4에 도시된 바와 같이 VPD 가 VREF,PD 보다 높은 경우, 출력으로 1을 생성한다. 제1 비교기의 출력이 1이 되면 Up/Down Counter는 제1 PD 드라이버 내의 서브 풀다운 드라이버 가 하나씩 추가적으로 ON이 되도록 DPD,CAL 신호를 변화시켜 제1 PD 드라이버를 제어하며, 제1 비교기 의 출력이 1로 유지되는 동안 DPD,CAL 신호의 변화에 따라 VPD 가 점차 낮아지게 된다. 제1 비교기의 출력이 1로 유지되는 동안 변화되는 DPD,CAL 신호에 의해 제1 PD 드라이버의 서브 풀다운 드라이버가 하나씩 더 ON이 되어감에 따라, 도 4와 같이 t5 시점에 VPD 가 VREF,PD 보다 낮아지게 되면, 제1 비교기의 출력은 0이 된다. 제1 비교기의 출력은 0이 되면 Up/Down Counter는 제1 PD 드라이버 내에서 ON이었던 서브 풀다 운 드라이버 하나를 다시 OFF 시킴에 따라 t6 시점에서는 VREF,PD 보다 VPD 전압이 다시 높아져서 제1 비교기(21 2)의 출력이 1이 된다. 따라서, 도 4에 도시된 바와 같이, t5 이후에는 제1 비교기의 출력이 0과 1을 반복하게 되고 PD Calibration Control 블록의 제어에 의해 DPD,CAL 신호가 변함에 따라 VPD 전압도 VREF,PD 전압에 비해 높아졌 다 낮아졌다 하는 파형이 반복된다. 또한, 도 4에서 PU Calibration 동작 시에는, PD Calibration 동작시와 유사하게 제2 비교기가 VPU 전압(- 단자)과 VREF,PU 전압(+단자)을 서로 비교하고, 그 비교 결과에 따라 t16 시점 이후부터 제2 비교기의 출력 이 0과 1을 반복하게 되고, PU Calibration Control 블록의 제어에 의해 DPU,CAL 신호가 변함에 따라 VPU 전 압도 VREF,PU 전압에 비해 높아졌다 낮아졌다 하는 파형이 반복됨을 확인할 수 있다. PD Calibration 및 PU Calibration이 수행되는 과정에서 어떤 제어 값으로 Calibration이 완료되었는지를 판단 하는 과정이 필요하다. 즉, 변화하는 DPD,CAL 및 DPU,CAL 값으로부터 최종적인 DPD 및 DPU 를 결정하는 과정이 필요하 다. 가장 간단한 방법으로는, PD Calibration의 경우 제1 PD 드라이버 내부의 모든 서브 풀다운 드라이버의 개 수만큼 제1 비교기에서 비교 동작을 수행한 후 마지막으로 결정된 DPD,CAL 값을 DPD 값으로 정하는 방법이 있 다. 예를 들어, 제1 PD 드라이버가 10개의 서브 풀다운 드라이버로 구성된 경우 도 4에 나타낸 바와 같이 10번의 비교를 수행하고 t10 시점에 결정된 마지막 DPD,CAL 값인 4를 최종 DPD 값으로 결정한다. PU Calibration에 대해서도 PD Calibration과 유사하게, PU 드라이버 내부의 모든 서브 풀업 드라이버의 개수만큼 제2 비교기에서 비교 동작을 수행한 후 마지막으로 결정된 DPU,CAL 값을 DPU 값으로 정하는 방법이 있다. 또 다른 방법으로는 비교기(제1 비교기 및 제2 비교기)의 출력 패턴을 이용하여 Calibration의 완료 여부를 결정하는 방법이 있다. 도 4에서, PD Calibration 시, 시간 t5 이후에 제1 비교기의 출력이 0과 1을 반복하는 패턴을 보여주는 경 우, 0과 1이 기설정 횟수만큼 반복되는 경우 PD Calibration이 완료된 것으로 판단하고 이때의 DPD,CAL 값을 DPD 값으로 결정할 수 있다. 마찬가지로, PU Calibration 시, 시간 t16 이후에 제2 비교기의 출력이 0과 1을 반복하는 패턴을 보여주는 경우, 0과 1이 기설정 횟수만큼 반복되는 경우 PU Calibration이 완료된 것으로 판단하고 이때의 DPU,CAL 값을 DPU 값으로 결정할 수 있다. 하지만, 임피던스 보정회로는 Single-ended 형태의 회로 구성으로 인하여 출력 임피던스 보정 과정에서 외 부 잡음에 취약할 수 있고 이 잡음으로 인해 잘못된 Calibration 결과가 결정될 수 있다. 도 5는 외부 잡음이 인가된 경우 잘못된 캘리브레이션 결과가 도출되는 경우를 예시한 도면이다. 여기서는, 풀다운 캘리브레이션 과정에서 제1 비교기의 출력이 0과 1이 2번 이상 반복되는 경우 풀다운 캘 리브레이션이 완료된 것으로 판단하도록 설정된 경우를 가정하여 설명한다. 이와 관련하여, 풀다운 캘리브레이 션 및 풀업 캘리브레이션의 경우 모두 유사하게 발생하므로 풀업 캘리브레이션의 경우에 대해서는 설명을 생략 하고 풀다운 캘리브레이션의 경우에 대해서만 설명한다. 도 5에서 t8 시점에 Noise1으로 표기된 형태와 크기의 잡음이 VPD 노드에 인가되는 경우 시간 t8에 순간적으로 VPD 가 VREF,PD 보다 높아지게 된다. 따라서 제1 비교기의 출력이 원래는 1이어야 할 것이 Noise1에 의해 0으 로 바뀌게 된다. 따라서, 제1 비교기의 출력이 원래는 t5부터 t8까지 0101로서 0과 1이 반복되는 패턴이어야 할 것이, t8의 Noise1에 의해 0100로 바뀌어 캘리브레이션이 완료되지 않았다고 판단하여 t8 이후에도 캘리브레이션이 지속될수 있다. 또한, Noise1과 같은 일시적인 잡음이 아니라 연속적인 잡음이 VPD 노드에 인가되는 경우 0과 1이 반복되는 제1 비교기의 출력 패턴이 형성되기가 어려워짐으로 인하여 캘리브레이션이 완료되지 않을 수도 있다. 또한, PU 드라이버 내부의 모든 서브 풀다운 드라이버의 개수에 해당하는 횟수만큼 제2 비교기에서 비교 동작을 수행한 후 마지막으로 결정된 DPU,CAL 값을 DPU 값으로 정하는 방법을 사용하는 경우에 노이즈로 인한 문제를 설명한다. 도 5에서, 풀업 캘리브레이션 과정에서 시점 t21에 Noise2라고 표기된 형태와 크기의 잡음이 VPU 노드에 인가되 는 경우 t21 시간에 순간적으로 VPU 노드 전압이 VREF,PU 보다 낮아져서, Noise2가 아니었으면 제2 비교기의 출력이 1이어야 하는 것이 0으로 바뀌게 되고, 이로 인해 DPU,CAL 값이 4가 아닌 6으로 바뀌게 되어서 최종 캘리 브레이션 값인 DPU 값이 6이 되어 잘못된 캘리브레이션 결과를 메모리 인터페이스 구동 회로에서 사용하게 될 수 있다. 도 5의 예시는 잡음에 의해서 캘리브레이션 결과 도출에 어떻게 영향을 미치고 에러가 발생할 수 있는지를 설명 하기 위해 특정 타이밍에 특정 형태의 잡음을 예를 들어 설명한 것이고, 실제로는 전원 잡음, 열 잡음(Thermal Noise), 1/f Nose 등 다양한 원인에 의한 잡음이 지속적으로 출력 임피던스 보정 회로에 영향을 주게 된다. 그리고 메모리 제조공정의 미세화, 높아지는 Pin 당 데이터 전송속도, 높아지는 전력 소모 등의 이유로 메모리 인터페이스 출력 구동회로의 동작 전원전압이 점차 낮아지고 있다. LPDDR4 까지는 구동회로의 전원 전압(VDDQ)이 1.2~1.0V 수준이었으나 LPDDR4X에서는 0.6V, LPDDR5는 0.5V, 그리고 최근 HBM3 메모리의 경우 0.4V의 데이터 구동회로 전원 전압을 사용하고 있다. 이에 따라 데이터 구동회로 출력 임피던스 보정회로의 동작 전원 전압도 같은 수준으로 낮아져야 하고, 따라서 동일한 크기의 잡음에 대한 에러 발생 가능성이 점차 커지고 있다. 일반적으로 메모리 인터페이스 구동 회로는 출력 임피던스를 4~5bit 정도의 범위로 조정할 수 있도록 설계 한다. 예를 들어, LPDDR5 메모리의 인터페이스 구동회로의 경우 0.5V 데이터 구동회로 전원전압을 갖고, Logic Low 데 이터 구동은 0V, Logic High 데이터 구동은 0.25V로 구동하고, 출력 임피던스가 4bit 크기로 선형적으로 조정 가능하도록 구성된 경우, 출력 임피던스를 1 단계 조정하게 되면 신호의 크기는 대략 15.6mV의 값의 변화를 갖 는다(0.25V÷2^4). 그런데 전원잡음, 열잡음, 1/f noise 등 다양한 원인에 의한 잡음을 고려하면 잡음의 크기도 수 mV~수십 mV의 크기 범위를 갖는다. 따라서, 도 5의 예를 통해 설명된 것과 같이, 잡음 성분에 의한 영향으로 출력 임피던스 보정회로의 오동작이 발생할 수 있고, 전력 소모 등의 이유로 메모리 인터페이스 구동회로의 전원전압을 점차 낮추면 잡음에 의한 출 력 임피던스 보정 에러가 더욱 크게 발생할 수 있다. 도 6은 본 개시의 일 실시예에 따른 출력 임피던스 보정 장치의 구성을 블록으로 예시한 도면이다. 도 6에 도시된 바와 같이, 본 실시예에 따른 출력 임피던스 보정 장치는 풀다운 캘리브레이션부(pull-down calibration unit, 610) 및 풀업 캘리브레이션부(pull-up calibration unit, 620)를 포함하여 구현될 수 있다. 풀다운 캘리브레이션부는 제1 PD 드라이버(first PD driver, 611), 제1 비교기(first comparator, 612) 및 제1 제어부(first controlling unit, 613)를 포함한다. 풀업 캘리브레이션부는 PU 드라이버(PU driver, 621), 제2 비교기(second comparator, 622), 제2 제어부 (second controlling unit, 623) 및 제2 PD 드라이버(second PD driver, 624)를 포함한다. 도 7a는 제1 PD 드라이버의 구성을 예시한 도면이고, 도 7b는 PU 드라이버의 구성을 예시한 도면이고, 도 7c는 제2 PD 드라이버의 구성을 예시한 도면이다. 출력 임피던스 보정 장치는 메모리 인터페이스 구동회로의 출력 임피던스를 보정하는 기능을 한다. 이하, 도 1, 도 6 내지 도 7c를 함께 참조하면서 본 실시예에 따른 출력 임피던스 보정 장치에 대하여 설 명한다.도 1에 도시된 바와 같이, 메모리 인터페이스 구동회로는 풀다운 드라이버 및 풀업 드라이버를 포함한다. 풀다운 드라이버는 복수의 서브 풀다운 드라이버(111, 112, 113, 114)가 서로 병렬로 연결된다. 복수의 서브 풀다운 드라이버(111, 112, 113, 114)는 서로 동일한 특성을 갖는 스위치 소자로서 구현될 수 있다, 복수의 서브 풀다운 드라이버(111, 112, 113, 114)는 제어신호 DPD0, DPD1, DPD2, ..., DPDn에 의해 각각 ON 또는 OFF로 제어된다. 이하, 제어신호 DPD0, DPD1, DPD2, ..., DPDn의 조합을 제1 임피던스 보정 코드(즉, DP D)로 명명한다. 풀업 드라이버는 복수의 서브 풀업 드라이버(121, 122, 123, 124)가 서로 병렬로 연결된다. 복수의 서브 풀업 드라이버(121, 122, 123, 124)는 서로 동일한 특성을 갖는 소자로서 구현될 수 있다, 복수의 서브 풀업 드라이버(121, 122, 123, 124)는 제어신호 DPU0, DPU1, DPU2, ..., DPUn에 의해 각각 ON 또 는 OFF로 제어된다. 이하, 제어신호 DPU0, DPU1, DPU2, ..., DPUn의 조합을 제2 임피던스 보정 코드(즉, DPU)로 명명한다. 출력 임피던스 보정 장치는 제1 임피던스 보정 코드(즉, DPD) 및 제2 임피던스 보정 코드(즉, DPU)를 결정 한다. 제1 PD 드라이버는 서로 병렬로 연결된 복수개의 제1 서브 PD 드라이버(711, 712, 713, 714)를 포함한다. 각 제1 서브 PD 드라이버(711, 712, 713, 714)에 MOS 스위치 소자(S) 및 그에 직렬 연결된 저항 소자(R)를 더 포함할 수 있다. 복수개의 제1 서브 PD 드라이버(711, 712, 713, 714)의 연결 구조는 복수의 서브 풀다운 드라이버(111, 112, 113, 114)의 연결구조와 동일하도록 형성된다. 기준 저항 RREF의 일단이 제1 PD 드라이버의 출력단(N1)에 연결되고 기준 저항 RREF의 타단이 제1 전원 VDDQ 에 연결된다. 제1 PD 드라이버의 타단은 그라운드 단자(GND)에 연결된다. 제1 제어부는 복수개의 제1 서브 PD 드라이버(711, 712, 713, 714)를 각각 ON 또는 OFF로 만들기 위한 각 각의 게이트 신호(즉, 제1 제어 신호) DPD10, DPD11, DPD12, ..., DPD1n를 생성한다. 이하, DPD10, DPD.11, DPD12, ..., DPD1n로서 형성되는 제1 제어 신호의 조합을 제1 제어 코드(즉, DPD,CAL)로 명명한다. 제1 비교기는 일정 시간 단위로 결정되는 제1 제어 코드에 따라 생성되는 제1 PD 드라이버의 출력 전 압과 제1 기준전압을 비교한 결과에 따라 0 또는 1의 시퀀스인 제1 출력 패턴을 생성한다. 제2 PD 드라이버는 서로 병렬로 연결된 복수개의 제2 서브 PD 드라이버(731, 732, 733, 734)를 포함한다. 각 제2 서브 PD 드라이버(731, 732, 733, 734)는 MOS 스위치 소자(S) 및 그에 직렬 연결된 저항 소자(R)를 더 포함할 수 있다. 복수개의 제2 서브 PD 드라이버(731, 732, 733, 734)의 연결구조는 복수의 제1 서브 PD 드라이버(711, 712, 713, 714)의 연결구조와 동일하도록 형성된다. 제2 PD 드라이버의 각 제2 서브 PD 드라이버(731, 732, 733, 734)를 ON 또는 OFF 하기 위한 각각의 게이 트 신호 DPD20, DPD21, DPD22, ..., DPD2n는 제1 제어부가 제공하는 제1 임피던스 보정 코드 DPD로서 결정 된다. 제1 제어부가 제1 임피던스 보정 코드 DPD를 생성하는 방법에 관한 사항은 후술한다. PU 드라이버 일단이 제2 PD 드라이버의 출력단(N2)에 연결되고 PU 드라이버 타단이 제1 전원 VDDQ에 연결된다. PU 드라이버는 서로 병렬로 연결된 복수개의 서브 PU 드라이버(721, 722, 723, 724)를 포함한다. 각 서브 PU 드라이버(721, 722, 723, 724)는 MOS 스위치 소자(S) 및 그에 직렬 연결된 저항 소자(R)를 더 포함할 수 있 다. 복수개의 서브 PU 드라이버(721, 722, 723, 724)의 연결구조는 복수의 서브 풀업 드라이버(121, 122, 123, 124)의 연결구조와 동일한 형태로 형성된다. 제2 제어부는 복수개의 서브 PU 드라이버(721, 722, 723, 724)를 각각 ON 또는 OFF로 만들기 위한 각각의 게이트 신호(즉, 제2 제어 신호) DPU10, DPU11, DPU12, ..., DPU1n를 생성한다. 이하, DPU10, DPU11, DPU12, ..., DPU1n로서 형성되는 제2 제어 신호의 조합을 제2 제어 코드(즉, DPU,CAL)로 명명한다. 제2 비교기는 일정 시간 단위로 결정되는 제2 제어 코드에 따라 생성되는 제2 PD 드라이버의 출력 전 압과 제2 기준전압을 비교한 결과에 따라 0 또는 1의 시퀀스인 제2 출력 패턴을 생성한다. 도 8은 본 실시예에 따른 출력 임피던스 보정 장치의 주요 동작 파형을 도시한 도면이고, 도 9는 풀다운 스윕 또는 풀업 스윕을 복수 회차 수행하는 경우의 제1 임피던스 보정 코드 또는 제2 임피던스 보정 코드의 결 정 방법을 예시한 도면이다. 제1 제어부는, 한번의 풀다운 스윕 시에, 제1 제어 신호 DPD10, DPD11, DPD12, ..., DPD1n의 조합을 일정 시간 간격마다 서로 다르게 하면서 순차적으로 변화시켜서 제1 PD 드라이버 내의 각 제1 서브 PD 드라이버 (711, 712, 713, 714)에게 제공한다. 즉, 시간의 변화에 따라 제1 제어 코드(즉, DPD,CAL)는 순차적으로 변하는 값을 갖는다. 예를 들어, 도 8에 도시된 바와 같이, 한번의 풀다운 스윕 시에는, 최초 시점(t0)에 제1 PD 드라이버의 모 든 제1 서브 PD 드라이버(711, 712, 713, 714)를 OFF시키도록 DPD,CAL 코드를 설정한 후 각 시간 간격(t1, t2, ..., t10)마다 제1 서브 PD 드라이버(711, 712, 713, 714)를 하나씩 추가적으로 ON 시키도록 DPD,CAL 코드를 변화 시키면서 제1 PD 드라이버의 출력 임피던스의 크기를 단계적으로 제어한다. 제1 비교기는 제1 PD 드라이버의 출력 전압(VPD)을 (+)단자로 입력받고 제1 기준전압 VREF,PD을 (-)단자 로 입력받아 VPD의 크기와 제1 기준 전압 VREF,PD의 크기를 비교하여 그 결과에 따라 0 또는 1을 출력한다. 한번의 풀다운 스윕 시에 제1 제어부에서 생성된 제1 제어 코드의 시간적 변화에 따라 VPD의 크기가 시간적 으로 변하며, VPD의 시간적 변화에 따라 제1 비교기는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성한다. 즉, 도 9에 도시된 것과 같은 제1 출력 패턴이 생성될 수 있다. 한번의 풀다운 스윕 시에 제1 제어부는 제1 제어 코드 DPD,CAL 를 DPD10, DPD11, DPD12, ..., DPD1n 들의 서로 다른 조합으로 순차적으로 생성하며, 복수의 제1 제어 코드 DPD,CAL 에 기초하여 생성되는 각각의 0 또는 1 의 출력의 시퀀스인 제1 출력 패턴을 생성한다. 도 9에 도시하듯이, 제1 제어부는 도 8에 도시한 것과 같은 풀다운 스윕을 복수회(예컨대, 4차례)만큼 수 행할 수 있다. 즉, 제1 제어부는 풀다운 스윕 시마다 복수의 제1 제어 코드 DPD,CAL 를 반복하여 생성하여 제1 PD 드라이버에게 제공한다. 풀다운 스윕 시마다 제1 비교기는 제1 PD 드라이버의 출력 전압(VPD)과 제1 기준 전압 VREF,PD의 크기를 비교하여 그 결과에 따라 0 또는 1의 시퀀스인 제1 출력 패턴을 각각 생성한다. 즉, 매 회차의 풀다운 스윕 시마다, 제1 비교기는 한 차례씩 제1 출력 패턴을 생성하며, 풀다운 스윕 횟수 와 동일한 개수의 제1 출력 패턴을 생성한다. 제1 제어부는 복수회(즉, 풀다운 스윕 횟수) 누적한 제1 출력 패턴에 대하여 0 또는 1의 개수의 제1 평균 을 산출하고, 제1 평균에 따라 제1 임피던스 보정 코드를 결정한다. 즉, 제1 제어부는 각각 획득한 제1 출력 패턴마다 0 또는 1의 개수를 산출하고, 각각 산출한 0 또는 1의 개수를 풀다운 스윕 횟수로 나누어 0 또는 1의 개수의 제1 평균을 산출한다. 예를 들어, 제1 제어부는, 도 9에 도시된 바와 같이, 각 회차(1회차 내지 4회차)의 풀다운 스윕시의 1의 개수 5, 4, 6, 5를 산출하고, 그 평 균을 (5+4+6+5)/5로 연산하여 그 결과값인 5를 제1 평균으로서 산출한다. 또한, 제1 제어부는 복수회 누적된 제1 출력 패턴에 포함된 1 또는 0의 제1 누적 개수를 산출하고 제1 누 적 개수에 따라 제1 임피던스 보정 코드를 결정할 수 있다. 여기서, 복수회(즉, 풀다운 스윕 횟수)는 2n(단, n은 1 이상의 자연수)에 해당하는 횟수로서 구현될수 있다. 이하, 풀업 스윕 과정에 대하여 설명한다, 제1 제어부는 제1 임피던스 보정 코드 DPD를 결정한 후에 DPD를 제2 PD 드라이버의 각 제2 서브 PD 드 라이버(731, 732, 733, 734)를 ON 또는 OFF 하기 위한 제어 신호(즉, 각각의 게이트 신호 DPD20, DPD21, DPD22, ..., DPD2n)로서 제공한다. 제2 PD 드라이버는 제1 임피던스 보정 코드 DPD에 의해 출력단 N2의 출력이 결정된다. 출력단 N2는 제2 비교기의 (-)단자에 연결되고, 제2 비교기의 (+)단자에는 제2 기준전압 VREF,PU이 입 력된다. 제2 비교기는 제2 PD 드라이버의 출력전압 VPU와 제2 기준전압 VREF,PU을 서로 비교하여, 그 비교 결과 에 따라 0 또는 1을 출력한다. 제2 제어부는, 한번의 풀업 스윕 시에, 제2 제어 신호 DPU10, DPU11, DPU12, ..., DPU1n의 조합을 일정 시간 간격마다 서로 다르게 하면서 순차적으로 변화시켜서 PU 드라이버 내의 각 서브 PU 드라이버(721, 722, 723, 724)에게 제공한다. 즉, 시간의 변화에 따라 제2 제어 코드(즉, DPU,CAL)는 순차적으로 변하는 값을 갖 는다. 예를 들어, 도 8에 도시된 바와 같이, 한번의 풀업 스윕 시에는, 최초 시점(t11)에 PU 드라이버의 모든 서 브 PU 드라이버(721, 722, 723, 724)를 OFF시키도록 DPU,CAL 코드를 설정한 후 각 시간 간격(t12, t13, ..., t21)마다 서브 PU 드라이버(721, 722, 723, 724)를 하나씩 추가적으로 ON 시키도록 DPU,CAL 코드를 변화시키면서 PU 드라이버의 출력 임피던스의 크기를 단계적으로 제어한다. 제2 비교기는 PU 드라이버의 출력 전압(VPU)을 (-)단자로 입력받고 제2 기준전압 VREF,PU을 (+)단자로 입력받아 VPU의 크기와 제2 기준 전압 VREF,PU의 크기를 비교하여 그 결과에 따라 0 또는 1을 출력한다. 한번의 풀업 스윕 시에 제2 제어부에서 생성된 제2 제어 코드의 시간적 변화에 따라 VPU의 크기가 시간적으 로 변하며, VPU의 시간적 변화에 따라 제2 비교기는 0 또는 1의 시퀀스인 제2 출력 패턴을 생성한다. 즉, 도 9에 도시된 것과 같은 제2 출력 패턴이 생성될 수 있다. 한번의 풀업 스윕 시에 제2 제어부는 제2 제어 코드 DPU,CAL 를 DPU10, DPU11, DPU12, ..., DPU1n 들의 서 로 다른 조합으로 순차적으로 생성하며, 복수의 제2 제어 코드 DPU,CAL 에 기초하여 생성되는 각각의 0 또는 1의 출력의 시퀀스인 제2 출력 패턴을 생성한다. 도 9에 도시하듯이, 제2 제어부는 도 8에 도시한 것과 같은 풀업 스윕을 복수회(예컨대, 4차례)만큼 수행 할 수 있다. 즉, 제2 제어부는 풀업 스윕 시마다 복수의 제2 제어 코드 DPU,CAL 를 반복하여 생성하여 PD 드 라이버에게 제공한다. 풀업 스윕 시마다 제2 비교기는 PU 드라이버의 출력 전압(VPU)과 제2 기준 전압 VREF,PU의 크기를 비교 하여 그 결과에 따라 0 또는 1의 시퀀스인 제2 출력 패턴을 각각 생성한다. 즉, 매 회차의 풀업 스윕 시마다, 제2 비교기는 한 차례씩 제2 출력 패턴을 생성하며, 풀업 스윕 횟수와 동일한 개수의 제2 출력 패턴을 생성한다. 제2 제어부는 복수회(즉, 풀업 스윕 횟수) 누적한 제2 출력 패턴에 대하여 0 또는 1의 개수의 제2 평균을 산출하고, 제2 평균에 따라 제2 임피던스 보정 코드를 결정한다. 즉, 제2 제어부는 각각 획득한 제2 출력 패턴마다 0 또는 1의 개수를 산출하고, 각각 산출한 0 또는 1의 개수를 풀업 스윕 횟수로 나누어 0 또는 1의 개수의 제2 평균을 산출한다. 예를 들어, 제2 제어부는, 도 9 에 도시된 바와 같이, 각 회차(1회차 내지 4회차)의 풀다운 스윕시의 1의 개수 5, 4, 6, 5를 산출하고, 그 평균 을 (5+4+6+5)/5로 연산하여 그 결과값인 5를 제2 평균으로서 산출한다. 또한, 제2 제어부는 복수회 누적된 제2 출력 패턴에 포함된 1 또는 0의 제2 누적 개수를 산출하고 제2 누 적 개수에 따라 제2 임피던스 보정 코드를 결정할 수 있다.여기서, 복수회(즉, 풀업 스윕 횟수)는 2n(단, n은 1 이상의 자연수)에 해당하는 횟수로서 구현될수 있다. 도 10은 제1 제어부의 구성을 예시한 도면이다. 제1 제어부는 제1 코드 생성기, 제1 카운터, 제1 쉬프트 레지스터 및 제1 코드저장부 를 포함하여 구현될 수 있다. 제1 코드 생성기는 각 회차의 풀다운 스윕시의 DPD,CAL을 생성한다. 제1 카운터는 각 회차의 풀다운 스윕시의 DPD,CAL에 대응하는 제1 출력 패턴을 수신하여 1의 개수를 계수한 다. 제1 카운터는 기설정된 풀다운 스윕 횟수와 동일한 개수의 제1 출력 패턴을 수신하고 각 회차의 풀다운 스윕시의 제1 출력 패턴에 포함된 1의 개수를 모두 합산한다. 예컨대, 제1 카운터는 도 9에 도시된 것과 같은 4회의 풀다운 스윕시의 1의 개수를 모두 계수하여 20이라는 값을 제1 계수 결과로서 산출한다. 제1 쉬프트 레지스터는 제1 계수 결과를 수신하고, 제1 계수 결과를 풀다운 스윕 횟수로 나누고 나눈 제1 평균값을 제1 코드 저장부에게 전송한다. 예컨대, 풀다운 스윕 횟수가 2n이면 제1 쉬프트 레지스터(103 0)는 n 비트만큼 오른쪽으로 제1 계수 결과를 쉬프트하여 제1 평균값을 산출한다. 제1 코드 저장부는 각 회차의 풀다운 스윕에 대응하는 DPD,CAL 중에서 제1 평균값에 대응하는 DPD,CAL을 선택 하여 제1 임피던스 보정 코드 DPD로서 결정한다. 도 11은 제2 제어부의 구성을 예시한 도면이다. 제2 제어부는 제2 코드 생성기, 제2 카운터, 제2 쉬프트 레지스터 및 제2 코드저장부 를 포함하여 구현될 수 있다. 제2 코드 생성기는 각 회차의 풀업 스윕시의 DPU,CAL을 생성한다. 제2 카운터는 각 회차의 풀업 스윕시의 DPU,CAL에 대응하는 제2 출력 패턴을 수신하여 1의 개수를 계수한다. 제2 카운터는 기설정된 풀업 스윕 횟수와 동일한 개수의 제2 출력 패턴을 수신하고 각 회차의 풀업 스윕 시의 제2 출력 패턴에 포함된 1의 개수를 모두 합산한다. 예컨대, 제2 카운터는 도 9에 도시된 것과 같은 4회의 풀업 스윕시의 1의 개수를 모두 계수하여 20이라는 값을 제2 계수 결과로서 산출한다. 제2 쉬프트 레지스터는 제2 계수 결과를 수신하고, 제2 계수 결과를 풀업 스윕 횟수로 나누고 나눈 제2 평균값을 제2 코드 저장부에게 전송한다. 예컨대, 풀업 스윕 횟수가 2n이면 제2 쉬프트 레지스터는 n 비트만큼 오른쪽으로 제2 계수 결과를 쉬프트하여 제2 평균값을 산출한다. 제2 코드 저장부는 각 회차의 풀업 스윕에 대응하는 DPU,CAL 중에서 제2 평균값에 대응하는 DPU,CAL을 선택하 여 제2 임피던스 보정 코드 DPU로서 결정한다. 도 12는 출력 임피던스 보정 장치에 의한 본 개시의 일 실시예에 따른 출력 임피던스 보정 방법을 예시한 흐름도이다. 제1 제어부는 풀다운 스윕시마다 복수개의 제1 서브 PD 드라이버(711, 712, 713, 714)를 각각 ON 또는 OFF로 만들기 위한 제어신호의 조합인 제1 제어 코드를 순차적으로 변화시키는 제1 제어 과정을 수행하고, 제1 비교기는 제1 제어 코드에 따라 생성되는 제1 PD 드라이버의 출력 전압과 제1 기준전압을 비교한 결 과를 나타내는 0 또는 1의 시퀀스인 제1 출력 패턴을 생성하는 제1 비교 과정을 수행한다(S1210). 여기서, S1210에서 제1 제어과정과 제1 비교과정을 합친 과정이 한번의 풀다운 스윕 과정이며, 풀다운 스윕 과 정은 기설정 풀다운 스윕 횟수만큼 반복된다. 풀다운 스윕 과정이 기설정 풀다운 스윕 횟수만큼 반복된 후, 제1 제어부는 기설정 풀다운 스윕 횟수에 해 당하는 개수만큼 획득된 제1 출력 패턴에서 '0' 또는 '1'의 제1 평균값을 산출한다(S1220).제1 제어부는 S1220에서 산출된 제1 평균값을 이용하여 메모리 인터페이스 구동회로에 대한 제1 임피 던스 보정 코드를 순차적으로 변화되는 제1 제어 코드 중에서 결정하는 과정을 수행한다(S1230). 제1 제어부는 제1 임피던스 보정 코드를 이용하여 복수개의 제2 서브 PD 드라이버(731, 732, 733, 734)의 출력을 제어한다(S1240). 제2 제어부는 풀업 스윕시마다 복수개의 서브 PU 드라이버(721, 722, 723, 724)를 각각 ON 또는 OFF로 만 들기 위한 제어신호의 조합인 제2 제어 코드를 순차적으로 변화시키는 제2 제어 과정을 수행하고, 제2 비교기 는 제2 제어 코드에 따라 생성되는 PU 드라이버의 출력 전압과 제2 기준전압을 비교한 결과를 나타내 는 제2 출력 패턴을 생성하는 제2 비교 과정을 수행한다(S1250). 여기서, S1250에서 제2 제어과정과 제2 비교과정을 합친 과정이 한번의 풀업 스윕 과정이며, 풀업 스윕 과정은 기설정 풀업 스윕 횟수만큼 반복된다. 풀업 스윕 과정이 기설정 풀업 스윕 횟수만큼 반복된 후, 제2 제어부는 기설정 풀업 스윕 횟수에 해당하는 개수만큼 획득된 제2 출력 패턴에서 '0' 또는 '1'의 제2 평균값을 산출한다(S1260). 제2 제어부는 S1260에서 산출된 제2 평균값을 이용하여 메모리 인터페이스 구동회로에 대한 제2 임피 던스 보정 코드를 순차적으로 변화되는 제2 제어 코드 중에서 결정한다(S1270). 본 개시의 예시적인 실시예들에 기술된 적어도 일부의 구성요소들은 DSP(Digital Signal Processor), 프로세서, 컨트롤러, ASIC(Application-Specific IC), 프로그래머블 로직소자(FPGA 등), 기타 전자소자 중의 적어도 하나 또는 이들의 조합이 포함되는 하드웨어 요소로써 구현될 수 있다. 또한, 예시적인 실시예들에서 기술된 적어도 일부의 기능(function)들 또는 처리과정(process)들은 소프트웨어로 구현될 수 있으며, 소프트웨어는 기록매체 에 저장될 수 있다. 본 개시의 예시적인 실시예들에 기술된 적어도 일부의 구성요소들, 기능들, 그리고 처리과 정들은 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 본 개시의 예시적인 실시예들에 따른 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성될 수 있고, 마그네 틱 저장매체, 광학적 판독매체, 디지털 저장매체 등 다양한 기록 매체로도 구현될 수 있다. 본 명세서에 설명된 각종 기술들의 구현들은 디지털 전자 회로조직으로, 또는 컴퓨터 하드웨어, 펌웨어, 소프트 웨어로, 또는 그들의 조합들로 구현될 수 있다. 구현들은 데이터 처리 장치, 예를 들어 프로그램가능 프로세서, 컴퓨터, 또는 다수의 컴퓨터들의 동작에 의한 처리를 위해, 또는 이 동작을 제어하기 위해, 컴퓨터 프로그램 제 품, 즉 정보 캐리어, 예를 들어 기계 판독가능 저장 장치(컴퓨터 판독가능 매체) 또는 전파 신호에서 유형적으 로 구체화된 컴퓨터 프로그램으로서 구현될 수 있다. 상술한 컴퓨터 프로그램(들)과 같은 컴퓨터 프로그램은 컴 파일된 또는 인터프리트된 언어들을 포함하는 임의의 형태의 프로그래밍 언어로 기록될 수 있고, 독립형 프로그 램으로서 또는 모듈, 구성요소, 서브루틴, 또는 컴퓨팅 환경에서의 사용에 적절한 다른 유닛으로서 포함하는 임 의의 형태로 전개될 수 있다. 컴퓨터 프로그램은 하나의 사이트에서 하나의 컴퓨터 또는 다수의 컴퓨터들 상에 서 처리되도록 또는 다수의 사이트들에 걸쳐 분배되고 통신 네트워크에 의해 상호 연결되도록 전개될 수 있다. 컴퓨터 프로그램의 처리에 적절한 프로세서들은 예로서, 범용 및 특수 목적 마이크로프로세서들 둘 다, 및 임의 의 종류의 디지털 컴퓨터의 임의의 하나 이상의 프로세서들을 포함한다. 일반적으로, 프로세서는 판독 전용 메 모리 또는 랜덤 액세스 메모리 또는 둘 다로부터 명령어들 및 데이터를 수신할 것이다. 컴퓨터의 요소들은 명령 어들을 실행하는 적어도 하나의 프로세서 및 명령어들 및 데이터를 저장하는 하나 이상의 메모리 장치들을 포함 할 수 있다. 일반적으로, 컴퓨터는 데이터를 저장하는 하나 이상의 대량 저장 장치들, 예를 들어 자기, 자기-광 디스크들, 또는 광 디스크들을 포함할 수 있거나, 이것들로부터 데이터를 수신하거나 이것들에 데이터를 송신하 거나 또는 양쪽으로 되도록 결합될 수도 있다. 컴퓨터 프로그램 명령어들 및 데이터를 구체화하는데 적절한 정 보 캐리어들은 예로서 반도체 메모리 장치들, 예를 들어, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광 기 록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media), 롬 (ROM, Read Only Memory), 램(RAM, Random Access Memory), 플래시 메모리, EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM) 등을 포함한다. 프로세서 및 메모리는 특수 목적 논리 회로조직에 의해 보충되거나, 이에 포함될 수 있다. 프로세서는 운영 체제(Operating System) 및 상기 운영 체제 상에서 수행되는 소프트웨어 애플리케이션을 수행 할 수 있다. 또한, 프로세서 디바이스는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및생성할 수도 있다. 이해의 편의를 위하여, 프로세서 디바이스는 하나가 사용되는 것으로 설명된 경우도 있지만,"}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "해당 기술분야에서 통상의 지식을 가진 자는, 프로세서 디바이스가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 프로세서 디바이스는 복수 개의 프 로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processo r)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 또한, 비-일시적 컴퓨터 판독가능 매체(non-transitory computer-readable media)는 컴퓨터에 의해 액세스될 수 있는 임의의 가용매체일 수 있고, 컴퓨터 저장매체 및 전송매체를 모두 포함할 수 있다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 마찬가지로, 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시 형태의 다양한 장치 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되어서는 안되며, 설명한 프로그램 컴포넌트와 장치들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거나 다중 소프트웨어 제품에 패키징 될 수 있다는 점을 이해하여야 한다. 한편, 본 명세서와 도면에 개시된 본 발명의 실시 예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으 며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상"}
{"patent_id": "10-2024-0092387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 자명한 것이다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2024-0092387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 출력 임피던스 조정이 가능한 메모리 인터페이스 구동회로를 예시한 도면이다. 도 2는 일반적인 메모리 인터페이스 구동 회로의 출력 임피던스를 보정하기 위한 임피던스 보정회로의 구 조를 예시한 도면이다. 도 3a는 PD Calibration Control 블록의 구성을 예시한 도면이고, 도 3b는 PU Calibration Control 블록의 구성을 예시한 도면이다. 도 4는 임피던스 보정회로의 주요 동작 파형을 예시한 도면이다. 도 5는 외부 잡음이 인가된 경우 잘못된 캘리브레이션 결과가 도출되는 경우를 예시한 도면이다. 도 6은 본 개시의 일 실시예에 따른 출력 임피던스 보정 장치의 구성을 블록으로 예시한 도면이다. 도 7a는 제1 PD 드라이버의 구성을 예시한 도면이고, 도 7b는 PU 드라이버의 구성을 예시한 도면이고, 도 7c는 제2 PD 드라이버의 구성을 예시한 도면이다. 도 8은 본 실시예에 따른 출력 임피던스 보정 장치의 주요 동작 파형을 도시한 도면이다. 도 9는 풀다운 스윕 또는 풀업 스윕을 복수 회차 수행하는 경우의 제1 임피던스 보정 코드 또는 제2 임피던스 보정 코드의 결정 방법을 예시한 도면이다. 도 10은 제1 제어부의 구성을 예시한 도면이다. 도 11은 제2 제어부의 구성을 예시한 도면이다. 도 12는 출력 임피던스 보정 장치에 의한 본 개시의 일 실시예에 따른 출력 임피던스 보정 방법을 예시한 흐름도이다."}
