{"patent_id": "10-2022-0131723", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0051708", "출원번호": "10-2022-0131723", "발명의 명칭": "맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법", "출원인": "주식회사 케이블러썸", "발명자": "이선교"}}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버가 학습자 답변에 기반하여 사용자 단말에 인공지능 분석을 통한 맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법에 있어서,적어도 하나의 교육 콘텐츠(지문+질문)를 포함하는 교육 콘텐츠 데이터베이스를 저장하는 단계 - 상기 교육 콘텐츠는 기본 질문을 포함함 -;관리자 단말(필수/필수X)로부터 상기 기본 질문에 대응하는 교사 답변 정보를 상기 교육 콘텐츠에 종속되는 레퍼런스 답변으로 저장하는 단계;상기 레퍼런스 답변을 인공지능을 통해 분석하여 상기 레퍼런스 답변의 답변 유형을 결정하는 단계;학습자 단말로부터 학습 성향 정보를 수신하여, 학습자 성향 정보로 저장하는 단계 - 상기 학습 성향 정보는 강화 선호 성향 및 보완 선호 성향을 포함함 -;상기 학습자 단말에 상기 교육 콘텐츠를 제공하는 단계;상기 학습자 단말로부터 상기 기본 질문에 대응한 학습자 기본 답변을 획득하는 단계;상기 학습자 기본 답변을 인공지능을 통해 분석하여 상기 학습자 기본 답변의 답변 유형을 결정하는 단계;상기 학습 성향 정보가 상기 강화 선호 성향인 경우, 상기 레퍼런스 답변 중 상기 학습자 기본 답변의 답변 유형과 동일한 답변 유형의 레퍼런스 답변에 기반하여 강화 연계 질문을 생성하는 단계;상기 학습 성향 정보가 상기 보완 선호 성향인 경우, 상기 레퍼런스 답변 중 상기 학습자 기본 답변의 답변 유형과 다른 답변 유형의 레퍼런스 답변에 기반하여 보완 연계 질문을 생성하는 단계;상기 학습자 단말에 상기 강화 연계 질문 또는 상기 보완 연계 질문을 제공하는 단계;상기 학습자 단말로부터 상기 강화 연계 질문 또는 상기 보완 연계 질문에 대응한 학습자 연계 답변을 획득하는단계; 및상기 학습자 기본 답변 및 상기 학습자 연계 답변 중 적어도 하나의 성취도를 평가하여, 상기 성취도가 미리 정해진 기준을 만족하는 경우 상기 적어도 하나를 상기 레퍼런스 답변으로 저장하는 단계를 포함하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 레퍼런스 답변의 답변 유형 별 비중을 생성하는 단계; 및상기 답변 유형 별 비중의 차이가 미리 정해진 기준을 초과하는 경우, 상기 교사 단말에 상기 비중이 적은 답변유형에 해당하는 교사 답변을 추가로 요청하는 단계를 더 포함하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 답변 유형은 복수의 필드를 포함하고,상기 복수의 필드는 1) 긍정/부정 여부, 2) 논리력, 3) 어휘력 및 4) 맞춤법에 관한 필드를 포함하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법.공개특허 10-2024-0051708-3-청구항 4 제3 항에 있어서,상기 학습자 성향 정보는 상기 복수의 필드에 대응되는 세부 성향 정보를 포함하고,상기 강화 연계 질문을 생성하는 단계 및 상기 보완 연계 질문을 생성하는 단계는 상기 세부 성향 정보에 기반하여 수행되는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 맞춤법 필드에 대한 상기 세부 성향 정보는 상기 강화 선호 성향과 상기 보완 선호 성향 중 상기 보완 선호 성향만 존재하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3 항에 있어서,상기 1) 긍정/부정 여부 필드에 해당하는 상기 답변 유형의 지표를 a라 하고, 상기 2) 논리력 필드에 해당하는상기 답변 유형의 지표를 b라 할 때,a/b가 미리 정해진 수준을 초과하는 경우, 상기 학습자 단말에 상기 교육 콘텐츠와 관련된 참고 콘텐츠를 제공하는 단계를 더 포함하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3 항에 있어서,상기 1) 긍정/부정 여부 필드에 해당하는 상기 답변 유형의 지표를 a라 하고, 상기 2) 학습 수준에 해당하는 상기 답변 유형의 지표를 c라 할 때,a/c가 미리 정해진 수준을 초과하는 경우, 상기 학습자 단말에 상기 교육 콘텐츠와 관련된 참고 콘텐츠를 제공하는 단계를 더 포함하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 레퍼런스 답변의 답변 유형 별 비중을 생성하는 단계를 더 포함하고,상기 답변 유형 별 비중의 차이가 미리 정해진 기준을 초과하는 경우, 상기 비중이 적은 답변 유형에 해당하는상기 학습자 기본 답변 및 상기 학습자 연계 답변에 대한 상기 성취도를 상기 비중이 높은 답변 유형에 해당하는 상기 학습자 기본 답변 및 상기 학습자 연계 답변에 대한 상기 성취도 보다 낮게 설정하는맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법."}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 서버가 학습자 답변에 기반하여 사용자 단말에 인공지능 분석을 통한 맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법은, 적어도 하나의 교육 콘텐츠(지문+질문)를 포함하는 교육 콘텐츠 데이터베이스를 저장하는 단계 - 상기 교육 콘텐츠는 기본 질문을 포함함 -, 관리자 단말(필수/필수X)로 (뒷면에 계속)"}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 온라인 통신 환경의 개선으로 인해 다양한 온라인 학습 프로그램이 제공되고 있다. 이 중 최근의 온라인 학습 프로그램은 학습자의 답변을 추적 및 분석하여 학습자의 수준에 맞는 프로그램을 제공하는 경우가 많다. 이러한 학습자의 수준에 맞는 프로그램은 학습자의 학습 성과를 향상시키는 것에 긍정적인 효과가 있으나, 학습 자의 수준이 아닌 학습 성향은 반영하지 못한다는 문제점이 있다. 중고등학생의 경우, 개개인의 차별화된 학습 성향이 존재하며 이에 따라 학습 성향에 맞는 맞춤형 교육 프로그 램 제공이 필요하다. 이러한 학습 성향에 따른 맞춤형 교육 프로그램의 경우, 단순한 질문에 대한 답변이 정답 인지 또는 오답인지에 기반하는 것이 아니라 답변의 구체적인 내용에 기반한 것이기 때문에 간단한 프로그램으 로는 쉽게 구현하기 어렵다는 문제가 있다. 그러나 최근 인공지능 등을 이용한 자연어 처리기술의 발달로 인해 이러한 답변의 구체적인 내용이 분석이 가능 해지고 있다. 따라서 이러한 인공지능 등을 이용한 자연어 처리기술을 활용한 학습자의 차별화된 학습 성향에 기반한 맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법에 대한 요구가 증대되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허공보 제10-2022-0120330호 (2022.08.30)"}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 학습자의 차별화된 학습 성향에 기반한 맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 것에 목적이 있다."}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 서버가 학습자 답변에 기반하여 사용자 단말에 인공지능 분석을 통한 맞춤형 학습 을 위한 자기주도형 온라인 학습 정보를 제공하는 방법은, 적어도 하나의 교육 콘텐츠(지문+질문)를 포함하는 교육 콘텐츠 데이터베이스를 저장하는 단계 - 상기 교육 콘텐츠는 기본 질문을 포함함 -, 관리자 단말(필수/필 수X)로부터 상기 기본 질문에 대응하는 교사 답변 정보를 상기 교육 콘텐츠에 종속되는 레퍼런스 답변으로 저장 하는 단계, 상기 레퍼런스 답변을 인공지능을 통해 분석하여 상기 레퍼런스 답변의 답변 유형을 결정하는 단계, 학습자 단말로부터 학습 성향 정보를 수신하여, 학습자 성향 정보로 저장하는 단계 - 상기 학습 성향 정보는 강 화 선호 성향 및 보완 선호 성향을 포함함 -, 상기 학습자 단말에 상기 교육 콘텐츠를 제공하는 단계, 상기 학 습자 단말로부터 상기 기본 질문에 대응한 학습자 기본 답변을 획득하는 단계, 상기 학습자 기본 답변을 인공지 능을 통해 분석하여 상기 학습자 기본 답변의 답변 유형을 결정하는 단계, 상기 학습 성향 정보가 상기 강화 선 호 성향인 경우, 상기 레퍼런스 답변 중 상기 학습자 기본 답변의 답변 유형과 동일한 답변 유형의 레퍼런스 답 변에 기반하여 강화 연계 질문을 생성하는 단계, 상기 학습 성향 정보가 상기 보완 선호 성향인 경우, 상기 레 퍼런스 답변 중 상기 학습자 기본 답변의 답변 유형과 다른 답변 유형의 레퍼런스 답변에 기반하여 보완 연계 질문을 생성하는 단계, 상기 학습자 단말에 상기 강화 연계 질문 또는 상기 보완 연계 질문을 제공하는 단계, 상기 학습자 단말로부터 상기 강화 연계 질문 또는 상기 보완 연계 질문에 대응한 학습자 연계 답변을 획득하는 단계 및 상기 학습자 기본 답변 및 상기 학습자 연계 답변 중 적어도 하나의 성취도를 평가하여, 상기 성취도가 미리 정해진 기준을 만족하는 경우 상기 적어도 하나를 상기 레퍼런스 답변으로 저장하는 단계를 포함한다. 본 발명의 일 실시예에 있어서, 상기 레퍼런스 답변의 답변 유형 별 비중을 생성하는 단계 및 상기 답변 유형 별 비중의 차이가 미리 정해진 기준을 초과하는 경우, 상기 교사 단말에 상기 비중이 적은 답변 유형에 해당하 는 교사 답변을 추가로 요청하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 답변 유형은 복수의 필드를 포함하고,상기 복수의 필드는 1) 긍정/부정 여 부, 2) 논리력, 3) 어휘력 및 4) 맞춤법에 관한 필드를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 학습자 성향 정보는 상기 복수의 필드에 대응되는 세부 성향 정보를 포함 하고, 상기 강화 연계 질문을 생성하는 단계 및 상기 보완 연계 질문을 생성하는 단계는 상기 세부 성향 정보에기반하여 수행될 수 있다. 본 발명의 일 실시예에 있어서, 상기 맞춤법 필드에 대한 상기 세부 성향 정보는 상기 강화 선호 성향과 상기 보완 선호 성향 중 상기 보완 선호 성향만 존재할 수 있다. 본 발명의 일 실시예에 있어서, 상기 1) 긍정/부정 여부 필드에 해당하는 상기 답변 유형의 지표를 a라 하고, 상기 2) 논리력 필드에 해당하는 상기 답변 유형의 지표를 b라 할 때, a/b가 미리 정해진 수준을 초과하는 경우, 상기 학습자 단말에 상기 교육 콘텐츠와 관련된 참고 콘텐츠를 제공하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 1) 긍정/부정 여부 필드에 해당하는 상기 답변 유형의 지표를 a라 하고, 상기 2) 학습 수준에 해당하는 상기 답변 유형의 지표를 c라 할 때, a/c가 미리 정해진 수준을 초과하는 경우, 상기 학습자 단말에 상기 교육 콘텐츠와 관련된 참고 콘텐츠를 제공하는 단계를 더 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 레퍼런스 답변의 답변 유형 별 비중을 생성하는 단계를 더 포함하고, 상기 답변 유형 별 비중의 차이가 미리 정해진 기준을 초과하는 경우, 상기 비중이 적은 답변 유형에 해당하는 상기 학습자 기본 답변 및 상기 학습자 연계 답변에 대한 상기 성취도를 상기 비중이 높은 답변 유형에 해당하는 상 기 학습자 기본 답변 및 상기 학습자 연계 답변에 대한 상기 성취도 보다 낮게 설정할 수 있다."}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 맞춤형 학습을 위한 자기주도형 온라인 학습 정보를 제공하는 방법은 학습자의 차별화된 학습 성향에 기반한 맞춤형 질문을 제공할 수 있다는 장점이 있다."}
{"patent_id": "10-2022-0131723", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 명 세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, 설명되는 각 단계들은 특별한 인과관계에 의해 나열된 순서에 따라 수행되어야 하는 경우를 제외 하고, 나열된 순서와 상관없이 수행될 수 있다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 이하, 첨부된 도면들을 참조하여 본 발명에 대해 설명한다. 도 1은 본 발명의 일 실시예에 따른 네트워크 환경의 예를 도시한 도면이다. 도 1에 도시된 본 발명의 일 실시예에 따른 네트워크 환경은 서버 및 교육 콘텐츠 데이터베이스, 교 사 단말, 학습자 단말, 학부모 단말을 포함할 수 있다. 서버는 교육 콘텐츠 데이터베이스를 저장할 수 있다. 여기서 교육 콘텐츠는 학습자에게 제공될 수 있 도록 준비된 지문, 질문 및 레퍼런스 답변을 포함할 수 있다.지문은 텍스트, 이미지, 동영상 또는 멀티미디어 자료를 포함할 수 있다. 질문은 기본 질문 및 연계 질문을 포 함한다. 연계 질문은 기본 질문의 성향을 강화하는 강화 연계 질문과 기본 질문의 성향을 보완하는 보완 질문으 로 구분될 수 있다. 레퍼런스 답변은 질문에 대한 성취도가 높은 답변을 의미한다. 경우에 따라서, 레퍼런스 답 변은 교사 단말로부터 수신한 교사 답변 정보일 수 있다. 서버는 복수의 학습자에 대한 복수의 교육 콘텐츠를 저장할 수 있다. 이러한 복수의 교육 콘텐츠는 서로 다른 주제의 학습과 관련된 것일 수 있다. 예를 들어, 교육 콘텐츠는 역사에 관한 교육 콘텐츠, 예술사에 관한 교육 콘텐츠, 외국어에 대한 교육 콘텐츠, 사회 또는 과학에 대한 교육 콘텐츠, 수학에 대한 교육 콘텐츠 또는 국어 맞춤법에 관한 교육 콘텐츠 등이 될 수 있다. 서버는 학습자 단말에 교육 콘텐츠를 제공하고, 학습자 단말으로부터 제공한 질문에 대한 답변 을 획득할 수 있다. 서버는 획득한 답변을 분석하여 해당 답변이 미리 정해진 성취도 기준을 만족하면 레 퍼런스 답변으로 저장할 수 있다. 교사 단말은 교육 콘텐츠에 대응하는 교사 답변 정보를 서버에 제공할 수 있다. 제공된 교사 답변 정 보는 레퍼런스 답변으로 저장된다. 학부모 단말은 학습자의 부모가 사용하는 단말이다. 서버는 학부모 단말에 학습자의 학습 결과 등을 제공할 수 있다. 경우에 따라 서버는 학부모 단말에 학습자에게 제공된 교육 콘텐츠와 관련된 추가 콘텐츠를 제공할 수 있다. 도 2는 본 발명의 일 실시예를 설명하기 위한 순서도이다. 단계(S110)에서, 서버는 적어도 하나의 교육 콘텐츠를 포함하는 교육 콘텐츠 데이터베이스를 저장한다. 교 육 콘텐츠 데이터베이스에는 복수의 서로 다른 주제의 교육 콘텐츠가 저장될 수 있다. 교육 콘텐츠는 지문 정보 및 기본 질문을 포함한다. 단계(S120)에서, 서버는 교사 단말로부터 교육 콘텐츠에 대응하는 교사 답변 정보를 교육 콘텐츠에 종속되는 레퍼런스 답변으로 저장한다. 서버는 교사 답변 정보는 성취도가 높은 것으로 판단하여 당연적으로 레퍼런스 답변으로 저장한다. 레퍼런 스 답변이란 해당 교육 콘텐츠의 기본 질문에 대한 우수한 답변의 집합으로 이후 연계 질문의 기반 정보로 활용 될 수 있는 답변을 의미한다. 서버에 교육 콘텐츠가 처음 저장되게 되면, 연계 질문의 기반 정보로 활용될 수 있는 레퍼런스 답변이 부 족하기 때문에 초기에 서버는 교사 단말로부터 교육 콘텐츠에 대응하는 교사 답변 정보를 수신하여 레퍼런스 답변을 확보하게 된다. 단계(S130)에서, 서버는 레퍼런스 답변을 인공지능을 통해 분석하여 레퍼런스 답변의 답변 유형을 결정한 다. 레퍼런스 답변이 이후에 연계 질문의 기반 정보로 활용되기 위해서는 서버가 레퍼런스 답변의 답변 유 형을 식별해야 한다. 답변 유형이란 다양한 필드로 구분될 수 있다. 다양한 필드는 예를 들어, 긍정/부정 여부, 논리력 수준, 어휘력 수준, 맞춤법 준수 여부, 논거의 개수, 답변의 길이 등에 대한 필드일 수 있다. 단계(S140)에서, 서버는 학습자 단말로부터 학습 성향 정보를 수신하여 학습자 성향 정보로 저장한다. 학 습 성향 정보는 강화 선호 성향 및 보완 선호 성향을 포함한다. 학습자 성향 정보는 답변 유형의 복수의 필드에 대응되는 세부 성향 정보를 포함할 수 있다. 예를 들어, 답변 유형이 긍정/부정 유형인 필드에 대해 학습자는 강화 선호 성향을 가질 수 있다. 이는 학습자가 자신이 긍정 유 형의 답변을 한 경우, 긍정 답변의 근거를 추가로 문의하는 등의 강화 연계 질문을 더욱 선호한다는 것을 의미 한다. 이러한 학습자에게 긍정 답변과 반대되는 부정 답변에 대한 의견을 문의하는 경우, 학습자는 자신의 학습 취향 상 이러한 문의를 부담스럽게 여기거나 학습의 흥미를 저해하는 요소로 느낄 수 있다. 이러한 긍정/부정 유형 필드에 대해 강화 선호 성향을 가지는 학습자에게는 답변 내용과 긍정/부정 여부를 일치시키면서 논거의 강화 또는 이유 등을 문의하는 연계 질문이 바람직할 것이다.반대로, 답변 유형이 긍정/부정 유형인 필드에 대해 학습자는 보완 선호 성향을 가질 수 있다. 이는 학습자가 자신이 긍정 유형의 답변을 한 경우, 긍정 답변과 반대되는 부정 답변에 대한 의견을 문의하는 등의 보완 연계 질문을 더욱 선호한다는 것을 의미한다. 이러한 학습자는 긍정 답변과 긍정이라는 유형이 동일하면서 심화 이유 등을 문의하는 질문을 하는 경우, 부정적인 결과를 초래할 수 있다. 그러나 이러한 답변 유형의 모든 필드에 대해 강화 선호 성향 및 보완 선호 성향이 존재하는 것은 아닐 수 있다. 예를 들어, 맞춤법 필드에 대한 세부 성향 정보는 강화 선호 성향과 보완 선호 성향 중 보완 선호 성향만 존재할 수 있다. 이는 맞춤법 필드에 대한 오답 성향을 강화하는 것은 존재하지 않기 때문이다. 단계(S150)에서, 서버는 학습자 단말에 기본 질문을 제공한다. 구체적으로 교육 콘텐츠의 지문과 기 본 질문을 함께 제공할 수 있다. 단계(S160)에서, 서버는 학습자 단말로부터 기본 질문에 대응한 학습자 기본 답변을 획득한다. 기본 답변 은 텍스트 정보 또는 음성 정보 등을 통해 획득될 수 있다. 단계(S170)에서, 서버는 학습자 기본 답변을 인공지능을 통해 분석하여 학습자 기본 답변의 답변 유형을 결정한다. 여기서 답변 유형은 상술한 단계(S130)에서 설명한 답변 유형과 동일한 것일 수 있다. 단계(S180)에서, 서버는 학습 성향 정보가 강화 선호 성향인 경우, 레퍼런스 답변 중 학습자 기본 답변의 답변 유형과 동일한 답변 유형의 레퍼런스 답변에 기반하여 강화 연계 질문을 생성한다. 예를 들어, 학습자 기본 답변이 긍정 답변이고 학습 성향 정보가 강화 선호 성향인 경우, 서버는 레퍼런스 답변 중 학습자 기본 답변의 이유, 논거 등에 대한 레퍼런스 답변을 선택하고, 선택된 레퍼런스 답변을 유도할 수 있는 연계 질문을 생성할 수 있다. 이러한 연계 질문은 학습자의 답변 유형을 강화시키는 것이므로 이하 강 화 연계 질문이라고 지칭하도록 한다. 단계(S190)에서, 서버는 학습 성향 정보가 보완 선호 성향인 경우, 레퍼런스 답변 중 학습자 기본 답변의 답변 유형과 다른 답변 유형의 레퍼런스 답변에 기반하여 보완 연계 질문을 생성한다. 예를 들어, 학습자 기본 답변이 부정 답변이고 학습 성향 정보가 보완 선호 성향인 경우, 서버는 레퍼런스 답변 중 학습자 기본 답변과는 다른 부정 답변에 해당하는 레퍼런스 답변을 선택하고, 선택된 레퍼런스 답변을 유도할 수 있는 연계 질문을 생성할 수 있다. 이러한 연계 질문은 학습자의 답변 유형을 보완하는 것이므로 이 하 보완 연계 질문이라고 지칭하도록 한다. 단계(S200)에서, 서버는 학습자 단말에 단계(S180)에서 생성된 강화 연계 질문 또는 단계(S190)에서 생성된 보완 연계 질문을 제공한다. 단계(S210)에서, 서버는 학습자 단말로부터 강화 연계 질문 또는 보완 연계 질문에 대응한 학습자 연 계 답변을 획득한다. 단계(S220)에서, 서버는 학습자 기본 답변 및 학습자 연계 답변 중 적어도 하나의 성취도를 평가하여, 성 취도가 미리 정해진 기준을 만족하는 경우 적어도 하나를 레퍼런스 답변에 저장한다. 이러한 레퍼런스 답변은 계속 누적되어 저장되어 다른 연계 질문을 생성하는 기반 정보로 사용될 수 있다. 도 3은 본 발명의 일 실시예를 설명하기 위한 서버 및 단말들의 정보 흐름도이다. 서버는 교육 콘텐츠를 교육 콘텐츠 데이터베이스에 저장한다(S310). 이후, 서버는 교사 단말로 부터 교사 답변 정보를 입력받는다(S320). 서버는 교사 답변 정보를 레퍼런스 답변으로 저장하고(S330), 레퍼런스 답변의 답변 유형을 결정한다(S340). 이후, 서버는 학습자 단말로부터 학습자에 대한 학습자 성향 정보 입력받고(S350), 학습자 성향 정보 저장하게 된다(S360). 서버는 학습자 단말에 교육 콘텐츠에 대한 지문과 기본 질문을 제공한다 (S361). 이후, 서버는 학습자 단말로부터 학습자 기본 답변을 입력받는다(S362). 그리고 서버는 학습자 기본 답변에 대한 답변 유형을 결정한다(S363). 이후의 단계는 학습 성향 정보가 강화 선호 성향인 경우(S370)와 학습 성향 정보가 보완 선호 성향인 경우 (S380)로 나눠서 수행된다.만약, 학습 성향 정보가 강화 선호 성향인 경우(S370), 서버는 학습자 단말에 강화 연계 질문을 제공 한다(S371). 반면에, 학습 성향 정보가 보완 선호 성향인 경우(S380), 서버는 학습자 단말에 보완 연계 질문을 제 공한다(S381). 학습자 단말은 서버에 학습자 연계 답변을 제공한다(S382). 서버는 기본 답변 또는 연계 답변이 성취도 기준을 만족하면 해당 답변을 레퍼런스 답변으로 저장한다(S390). 도 4는 본 발명의 일 실시예를 설명하기 위한 서버 및 단말들의 정보 흐름도이다. 서버는 레퍼런스 답변을 저장한다(S410). 서버는 레퍼런스 답변의 유형 별 비중을 생성한다(S420). 예를 들어, 레퍼런스 답변 중 긍정 유형이 70%이고, 부정 유형이 30%라는 사실을 확인할 수 있다. 또한, 예를 들어 레퍼런스 답변 중 논리력이 상급인 유형인 20%이고, 중급이 유형이 40%이고, 하급이 유형이 20%라는 사실 을 확일 수 있다. 서버는 이러한 레퍼런스 답변 중 유형 별 비중의 차이가 기준을 초과하는 수준인지 판단한다(S430). 만약, 레퍼런스 답변 중 유형 별 비중의 차이가 기준을 초과하면 레퍼런스 답변의 비중 불균형 경고가 생성될 수 있다. 예를 들어, 레퍼런스 답변 중 긍정 유형과 부정 유형의 차이가 30%포인트 넘게 차이가 날 경우 불균형 경고를 생성할 수 있다. 교사 단말은 이러한 불균형을 해결하기 위해서 비중이 적은 답변 유형의 교사 답변을 요청받을 수 있다 (S440). 서버가 교사 단말로부터 비중이 적은 답변 유형의 교사 답변을 수신하면 이를 레퍼런스 답변 으로 저장하여 상술한 불균형을 해소할 수 있다. 경우에 따라 상술한 레퍼런스 답변의 불균형을 해소하기 위해, 상술한 단계(S220)에서 성취도를 차등적으로 적 용할 수 있다. 구체적으로, 답변 유형 별 비중의 차이가 미리 정해진 기준을 초과하는 경우, 비중이 적은 답변 유형에 해당하는 학습자 기본 답변 및 상기 학습자 연계 답변에 대한 성취도 기준을 비중이 높은 답변 유형에 해당하는 학습자 기본 답변 및 학습자 연계 답변에 대한 성취도 기준 보다 낮게 설정할 수 있다. 이렇게 되면 비중이 적은 답변 유형에 해당하는 답변이 더 많이 레퍼런스 답변에 해당하게 되어 불균형을 해소 할 수 있다. 이하, 도 5 내지 도 8을 참조하여 본 발명의 구체적인 실시예에 대해 설명하도록 한다. 도 5를 참조하면, 서버는 학습자 단말에 기본 질문을 제공한다. 학습자 단말은 기본 질문 에 대응되는 기본 답변을 입력하여 서버에 제공한다. 이때, 서버는 인공지능 분석을 통해 학습자의 기본 답변은 세부 답변 유형이 부정이라는 것을 파악할 수 있다. 그리고 학습자는 논리력 여부에 대한 세부 성향 정보는 강화 선호 성향이라는 것을 가정한다. 그렇다 면, 서버는 강화 연계 질문을 제공하게 된다. 이후 학습자는 연계 답변을 제공하게 된다. 서버 가 이러한 강화 연계 질문을 제공할 수 있는 것은, 이와 관련된 레퍼런스 답변이 존재하기 때문이라 고 할 수 있다. 도 6을 참조하면, 서버는 학습자 단말에 기본 질문을 제공한다. 학습자 단말은 기본 질문 에 대응되는 기본 답변을 입력하여 서버에 제공한다. 이때, 서버는 인공지능 분석을 통해 학습자의 기본 답변은 세부 답변 유형이 부정이라는 것을 파악할 수 있다. 그리고 학습자는 긍정/부정 여부에 대한 세부 성향 정보는 강화 선호 성향이라는 것을 가정한다. 그렇 다면, 서버는 강화 연계 질문을 제공하게 된다. 이후 학습자는 연계 답변을 제공하게 된다. 서 버가 이러한 강화 연계 질문을 제공할 수 있는 것은, 이와 관련된 레퍼런스 답변이 존재하기 때문이 라고 할 수 있다. 도 7을 참조하면, 서버는 학습자 단말에 기본 질문을 제공한다. 학습자 단말은 기본 질문 에 대응되는 기본 답변을 입력하여 서버에 제공한다. 이때, 서버는 인공지능 분석을 통해 학습자의 기본 답변은 세부 답변 유형이 부정이라는 것을 파악할 수 있다. 그리고 학습자는 긍정/부정 여부에 대한 세부 성향 정보는 보완 선호 성향이라는 것을 가정한다. 그렇 다면, 서버는 보완 연계 질문을 제공하게 된다. 이후 학습자는 연계 답변을 제공하게 된다. 서 버가 이러한 보완 연계 질문을 제공할 수 있는 것은, 이와 관련된 레퍼런스 답변이 존재하기 때문이 라고 할 수 있다. 도 8을 참조하면, 서버는 학습자 단말에 기본 질문을 제공한다. 학습자 단말은 기본 질문 에 대응되는 기본 답변을 입력하여 서버에 제공한다. 이때, 서버는 인공지능 분석을 통해 학습자의 기본 답변은 맞춤법 오류가 있음을 파악할 수 있다. 그 리고 학습자는 맞춤법 오류 여부에 대한 세부 성향 정보는 보완 선호 성향이라는 것을 가정한다. 경우에 따라 맞춤법 오류 여부에 대한 세부 성향 정보는 강화 선호 성향이 없고, 보완 선호 성향만 있을 수 있다. 그렇다면, 서버는 보완 연계 질문을 제공하게 된다. 이후 학습자는 연계 답변을 제공하게 된다. 서버가 이러한 보완 연계 질문을 제공할 수 있는 것은, 이와 관련된 레퍼런스 답변이 존재하기 때문 이라고 할 수 있다. 경우에 따라서, 1) 긍정/부정 여부 필드에 해당하는 상기 답변 유형의 지표를 a라 하고, 2) 논리력 필드에 해당 하는 상기 답변 유형의 지표를 b라 하여, a/b를 산출할 수 있다. a/b는 학습자가 가지고 있는 논리력에 비해 긍 정/부정 편향 여부를 판단하기 위한 지표가 될 수 있다. a/b에 대한 미리 정해진 기준은 예를 들어 2.0이 될 수 있다. 이러한 지표가 기준치를 초과할 경우, 서버는 학습자 단말 또는 학부보 단말에 교육 콘텐츠와 관련된 참고 콘텐츠를 제공하는 단계를 더 수행할 수 있다. 도 9는 교육 콘텐츠 데이터베이스 예시로 한 것이다. 도 10은 레퍼런스 답변 유형 비중 차이 보완에 대한 표이 다. 본 발명의 각 실시예에 개시된 기술적 특징들은 해당 실시예에만 한정되는 것은 아니고, 서로 양립 불가능하지 않은 이상, 각 실시예에 개시된 기술적 특징들은 서로 다른 실시예에 병합되어 적용될 수 있다. 따라서, 각 실시예에서는 각각의 기술적 특징을 위주로 설명하지만, 각 기술적 특징이 서로 양립 불가능하지 않 은 이상, 서로 병합되어 적용될 수 있다. 본 발명은 상술한 실시예 및 첨부한 도면에 한정되는 것은 아니며, 본 발명이 속하는 분야에서 통상의 지식을 가진 자의 관점에서 다양한 수정 및 변형이 가능할 것이다. 따라서 본 발명의 범위는 본 명세서의 청구범위뿐만 아니라 이 청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2022-0131723", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명이 수행되는 시스템의 구성을 도시한 것이다. 도 2는 본 발명의 일 실시예를 설명하기 위한 순서도이다."}
