{"patent_id": "10-2016-0039751", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2017-0112575", "출원번호": "10-2016-0039751", "발명의 명칭": "확장형 케이블 분배장치 및 확장형 케이블 분배장치 제조방법", "출원인": "주식회사 케이엠더블유", "발명자": "송명길"}}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부에서 공급된 복합 케이블의 단부를 수용하고, 상기 수용된 복합 케이블이 분배되는 통로를 제공하는 메인블럭;상기 메인 블럭의 일측에 착탈 가능하도록 배치되며, 상기 메인 블럭을 통과하면서 분배된 상기 복합 케이블의일부의 분기 방향을 가이드 하는 적어도 하나의 서브 블럭; 및 상기 적어도 하나의 서브 블럭 외주면에 배치되며, 상기 분배된 케이블의 적어도 일부와 전기적으로 연결되는커넥터를 포함하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 서브 블럭은, 상기 메인 블럭에 수용되는 상기 복합 케이블과 직교하는 방향을 중심으로 시계 또는 반시계방향으로 회전할 수 있는 것을 특징으로 하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 서브 블럭은 양단이 개구된 형상으로, 상기 메인 블록 일측으로 나란하게 복수 개 배치 가능한 것을 특징으로 하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 서브 블럭의 외주면에는 상기 커넥터가 안착하는 안착부가 배치되며, 상기 안착부는 상기 복합 케이블의일부와 상기 커넥터를 연결할 수 있는 분배홀을 포함하는 것을 특징으로 하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서, 상기 메인 블럭 및 상기 서브 블럭은,상기 메인 블럭에 대하여 상기 서브 블럭이 회전 가능하도록 결합하여 상기 분배된 케이블이 연장되는 방향을가이드하는 체결부를 포함하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 메인 블럭 및 상기 서브 블럭의 체결부 사이에 배치되며, 상기 메인 블럭 및 상기 서브 블럭이 서로 결합하여 이탈되지 않도록 적어도 하나의 단턱부 포함한 커플링 부재를 더 포함하는 확장형 케이블 분배장치.공개특허 10-2017-0112575-3-청구항 7 제 6항에 있어서,상기 커플링 부재는 링 형상의 몸체를 포함하고, 상기 단턱부는 상기 몸체를 중심으로 양 방향으로 복수 개 분리 배치된 것을 특징으로 하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서, 상기 메인 블럭은,외부에서 공급된 상기 복합 케이블의 단부가 수용되는 수용홀;상기 수용홀에 수용된 상기 복합 케이블과 상기 메인블럭을 결합하는 체결부재를 포함하는 케이블 체결부; 및상기 서브 블록과 회전 가능하도록 결합하여 상기 분배된 케이블 연장 방향을 가이드하는 확장 체결부를 포함하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서, 상기 서브 블럭은상기 메인 블럭의 상기 확장 체결부 내측으로 적어도 일부가 삽입되어 결합된 전단 체결부; 및상기 전단 체결부와 대향 배치되며, 서로 다른 서브 블럭 또는 측면 커버와 결합되는 후단 체결부를 포함하는확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 메인 블럭과 상기 서브 블럭 사이의 회전 결합을 유도하는 커플링 부재를 포함하며,상기 커플링 부재는 복수 개의 단턱부가 상기 서브 블럭의 전단 체결부에 배치된 복수 개의 결합홀에 독립적으로 결합하여, 상기 메인 블럭에 대하여 상기 서브 블럭과 상기 커플링 부재가 동시에 회전 가능하도록 구성된것을 특징으로 하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 6항 또는 제 10항에 있어서, 상기 메인 블럭 또는 상기 서브 블럭의 상기 체결부 내측에는 링 형상의 적어도 하나의 실링부재를 더 포함하는확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서, 상기 서브 블럭 외측에 결합 배치되며, 외부의 이물질이 상기 서브 블럭 또는 상기 메인 블럭 내부로 침투하는것을 방지하는 측면 커버를 더 포함하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "공개특허 10-2017-0112575-4-제 1항에 있어서,상기 메인 블럭 또는 상기 측면 커버와 연결되어 배치되고, 상기 케이블 분배장치를 외부 장치와 연결하여 지지하는 지지 브라켓을 더 포함하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 1항에 있어서,상기 커넥터와 연결되며, 상기 커넥터의 사용 여부에 따라 상기 커넥터를 둘러싸도록 배치하여 보호하거나 분리하는 커넥터 커버를 더 포함하는 확장형 케이블 분배장치."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "외부에서 공급된 복합 케이블의 단부가 메인 블럭의 하단에 수용하여 결합하는 공정;상기 복합 케이블로부터 분배가 필요한 케이블의 수에 따라, 상기 메인 블럭 외측으로 적어도 하나의 서브 블럭을 결합 배치하는 공정; 및상기 메인 블럭으로부터 연장된 상기 복합 케이블의 적어도 일부를 상기 서브 블럭에 배치된 커넥터와 연결하는공정을 포함하는 확장형 케이블 분배장치 제조방법."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서, 상기 메인 블럭 또는 상기 서브 블럭 내부에 배치된 상기 케이블을 보호하기 위하여, 상기 서브 블럭 외측으로측면 커버를 결합 배치하는 공정을 더 포함하는 확장형 케이블 분배장치 제조방법."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 15항에 있어서, 상기 메인 블럭 외측으로 적어도 하나의 서브 블럭을 결합 배치하는 공정에서,상기 메인 블럭에 대하여 상기 서브 블럭이 회전 가능하도록 결합하여 상기 복합 케이블에서 분배된 케이블이연장되는 방향을 가이드하는 것을 특징으로 하는 확장형 케이블 분배장치 제조방법."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 15항에 있어서, 상기 메인 블럭 외측으로 적어도 하나의 서브 블럭을 결합 배치하는 공정 이전에,상기 서브 블럭 외주면에 배치된 안착면에 상기 복합 케이블의 적어도 일부와 연결되는 커넥터를 배치하는 공정을 포함하는 확장형 케이블 분배장치 제조방법."}
{"patent_id": "10-2016-0039751", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 15항에 있어서, 상기 메인 블럭 외측으로 적어도 하나의 서브 블럭을 결합 배치하는 공정에서,상기 메인 블럭 및 상기 서브 블럭이 서로 회전 결합하도록, 상기 메인 블럭 및 상기 서브 블럭의 체결부 사이에 링 형상의 커플링 부재를 배치하는 공정을 포함하는 확장형 케이블 분배장치 제조방법."}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 확장형 케이블 분배장치는, 외부에서 공급된 복합 케이블의 단부를 수용하고, 상기 수용된 복합 케이블이 분배되는 통로를 제공하는 메인 블럭; 상기 메인 블록의 일측에 착탈 가능하도록 배치되며, 상기 메인 블럭을 통과하면서 분배된 상기 복합 케이블의 일부의 분기 방향을 가이드 하는 적어도 하 (뒷면에 계속)"}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 복합 케이블의 분배 및 방향 전환이 가능한 확장형 케이블 분배장치 및 확장형 케이블 분배장치의 제 조 방법에 관한 것이다."}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 교환국 장치, 기지국 장치 또는 중계기 등의 장비 또는 부품에는 주파수가 높은 무선 신호와 같은 특정 신호를 송수신하기 위한 복합 케이블이 연결된다. 최근 통신 방식에 따라 기지국 등에 배치되는 안테나의 수가 증가함에 따라, RRH(remote radio head) 또는 그에 따른 연결 장비의 수도 증가되는 추세이다. 따라서, 기존의 하나의 복합 케이블과 연결되는 입력 메인 박스로 구성된 케이블 장치의 경우, 케이블을 분리하기 위하여 기지국 관리 작업자가 인위적으로 광전복합 케이블을 탈 피하고 각각의 전력선 유닛 또는 광유닛을 케이블을 박스 내에서 점퍼 케이블의 전력선 유닛과 광유닛과 연결하 는 연결작업을 추가적으로 수행해야 하므로 많은 시간과 노력이 요구되는 문제점이 있었다. 또한, 복합 케이블은 분배하는 경우에도, 기존의 일체형으로 구성된 박스 형태의 장치는 상황에 따라 분배 케이 블이 여러 방향으로 배치하는데 어려움이 있으며, 새로운 방향으로 재전환시에도 소비되는 케이블의 길이의 증 가에 따른 부품 비용 및 전력이 손실되는 문제점이 있었다."}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 케이블의 방향 전환이 자유로운 회전형 케이블 분배장치를 설계하여, 장비 설치시 케이블이 차지하 는 설치 공간 및 케이블 길이를 절약하고자 한다. 본 발명은, 확장 가능한 모듈형 케이블 분배장치를 구현하여, 추가되는 분배 케이블에 따라 블럭의 수를 확장 또는 축소하여 설치자가 필요한 케이블 수만큼 손쉽게 케이블을 분배할 수 있도록 한다. 본 발명은, 확장 가능한 모듈형 케이블 블럭의 결합부를 탈착식으로 구성하여, 설치자가 손쉽게 교체 또는 수리 가 가능한 케이블 분배 장치를 제공하고자 한다."}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 확장형 케이블 분배장치는, 외부에서 공급된 복합 케이블의 단부를 수용하고, 상기 수용된 복합 케이블이 분배되는 통로를 제공하는 메인 블럭; 상기 메인 블록의 일측에 착탈 가능하도록 배치되 며, 상기 메인 블럭을 통과하면서 분배된 상기 복합 케이블의 적어도 일부의 분기 방향을 가이드 하는 적어도 하나의 서브 블럭; 및 상기 적어도 하나의 서브 블럭 외주면에 배치되며, 상기 분배된 케이블의 적어도 일부와 전기적으로 연결되는 커넥터를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 서브 블럭은, 상기 메인 블럭에 수용되는 상기 복합 케이블과 직교하는 방 향을 중심으로 시계 또는 반시계 방향으로 회전할 수 있다. 본 발명의 일 실시예에 따르면, 상기 서브 블럭은 양단이 개구된 형상으로, 상기 메인 블록 일측으로 나란하게 복수 개 배치 가능할 수 있다. 본 발명의 일 실시예에 따르면, 상기 서브 블럭의 외주면에는 상기 커넥터가 안착하는 안착부가 배치되며, 상기 안착부는 상기 복합 케이블의 일부와 상기 커넥터를 연결할 수 있는 분배홀을 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 메인 블럭 및 상기 서브 블럭은, 상기 메인 블럭에 대하여 상기 서브 블럭 이 회전 가능하도록 결합하여 상기 분배된 케이블이 연장되는 방향을 가이드하는 체결부를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 메인 블럭 및 상기 서브 블럭의 체결부 사이에 배치되며, 상기 메인 블럭 및 상기 서브 블럭이 서로 결합하여 이탈되지 않도록 적어도 하나의 단턱부 포함한 커플링 부재를 더 포함할 수 있다.본 발명의 일 실시예에 따르면, 상기 커플링 부재는 링 형상의 몸체를 포함하고, 상기 단턱부는 상기 몸체를 중 심으로 양 방향으로 복수 개 분리 배치될 수 있다. 본 발명의 일 실시예에 따르면, 상기 메인 블럭은, 외부에서 공급된 상기 복합 케이블의 단부가 수용되는 수용 홀; 상기 수용홀에 수용된 상기 복합 케이블과 상기 메인블럭을 결합하는 체결부재를 포함하는 케이블 체결부; 및 상기 서브 블록과 회전 가능하도록 결합하여 상기 분배된 케이블 연장 방향을 가이드하는 확장 체결부를 포 함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 서브 블럭은 상기 메인 블럭의 상기 확장 체결부 내측으로 적어도 일부가 삽입되어 결합된 전단 체결부; 및 상기 전단 체결부와 대향 배치되며, 서로 다른 서브 블럭 또는 측면 커버와 결합되는 후단 체결부를 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 메인 블럭과 상기 서브 블럭 사이의 회전 결합을 유도하는 커플링 부재를 포함하며, 상기 커플링 부재는 복수 개의 단턱부가 상기 서브 블럭의 전단 체결부에 배치된 복수 개의 결합홀에 독립적으로 결합하여, 상기 메인 블럭에 대하여 상기 서브 블럭과 상기 커플링 부재가 동시에 회전 가능하도록 구성될 수 있다. 본 발명의 일 실시예에 따르면, 상기 메인 블럭 또는 상기 서브 블럭의 상기 체결부 내측에는 링 형상의 적어도 하나의 실링부재를 더 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 서브 블럭 외측에 결합 배치되며, 외부의 이물질이 상기 서브 블럭 또는 상기 메인 블럭 내부로 침투하는 것을 방지하는 측면 커버를 더 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 메인 블럭 또는 상기 측면 커버와 연결되어 배치되고, 상기 케이블 분배장 치를 외부 장치와 연결하여 지지하는 지지 브라켓을 더 포함할 수 있다. 본 발명의 일 실시예에 따르면, 상기 커넥터와 연결되며, 상기 커넥터의 사용 여부에 따라 상기 커넥터을 둘러 싸도록 배치하여 보호하거나 분리하는 커넥터 커버를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 확장형 케이블 분배장치 제조방법은, 외부에서 공급된 상기 복합 케이블의 단부를 메인 블럭에서 수용하여 결합하는 공정; 상기 복합 케이블로부터 분배가 필요한 케이블의 수에 따라, 상기 메인 블럭 외측으로 적어도 하나의 서브 블럭을 결합 배치하는 공정; 및 상기 메인 블럭으로부터 연장된 상기 복합 케이블의 적어도 일부를 상기 서브 블럭에 배치된 커넥터와 연결하는 공정을 포함할 수 있다."}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 공급된 복합 케이블을 분배하고, 분배된 케이블이 외부로 연장되는 방향에 따라 회전할 수 있는 케이블 분배 장치를 제공할 수 있다. 또한, 본 발명의 일 실시예에 따르면, 분배된 케이블이 추가되는 경우, 모듈형 서브 블럭을 추가적으로 장착하 여 간편하게 설치자가 원하는 수 또는 방향으로 케이블의 연장이 가능한 효과가 있다. 또한, 본 발명의 일 실시예에 따르면, 추가되는 서브 블럭은 상황에 따라 설치자가 원하는 방향으로 실시간 회 전 가능하고, 외부로부터 유체의 유입을 차단하는 방수 기능을 제공할 수 있다. 또한, 본 발명의 일 실시예에 따르면, 추가되는 서브 블릭의 결합이 간단하여, 설치자의 작업시간을 단축할 수 있는 효과가 있다."}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상 의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시예들을 배제하도록 해석될 수 없다. 이하, 첨부 도면을 참조하여, 일 실시예에 따른 복합 케이블을 분배하고 연장하는 케이블 블럭 장치가 설명된다. 본 문서에서, 설치자라는 용어는 전자장치를 설치하는 사람 또는 전자 장치를 설치하는 장치(예: 인 공지능 전자 장치)를 지칭할 수 있다. 도 1은 본 발명의 일 실시예에 따른, 케이블 분배장치의 외면을 나타낸 사시도 이다. 본 발명의 일 실시예에 따른, 상기 케이블 분배장치로 공급되는 복합 케이블은, 복수 개의 전력선 유닛 및 복수 개의 광 유닛을 포함하여 구성될 수 있다. 예를 들어, 상기 복합 케이블은 교환국 장치, 기지국 장 치 또는 중계기 등의 장비 부품에 제공되는 주파수가 높은 무선 신호와 같은 특정 신호를 송수신하기 위한 알에 프 케이블을 사용할 수 있다. 또한, 상기 알에프 케이블은 용도 및 신호의 주파수에 따라서 복수 개의 케이블로 분기가 필요하며, 연결 부품의 구조적 특징에 접합하게 제작된 커넥터를 사용할 수 있다. 본 발명의 일 실시예에 따른, 기지국 장비, 예를 들면, RRH(remote radio head) 또는 RRA(Remote Radio Antenna)로 제공하는 복합 케이블을 복수 개의 분배된 케이블로 분기하기 위하여 연결 및 교체가 손쉬 운 케이블 분배장치가 요구될 수 있다. 도 1를 참조하여 케이블 분배장치의 구성 부품에 대해서 설명하기로 한다. 도 1에 도시된 바와 같이, 케이블 분배장치는, 외부에서 공급된 복합 케이블의 단부를 수용하고, 상기 수용된 복합 케이블을 분배하는 메인 블럭, 상기 메인 블럭과 연결되어, 분배된 케이블을 연 장하고 보호하는 서브 블럭 및 상기 서브 블럭의 외주면에 배치되며, 분배된 케이블을 외부로 제 공하는 커넥터를 포함할 수 있다. 본 발명의 일 실시예에 따른, 상기 메인 블럭은 관형 하우징 형태로, PAAS(Polyamic Acid Alkylamine Salts), PPS(Polyhenylene Sulfide), PPA(Polyphthal Amide) 중 어느 하나의 재질로 이루어진 사출물일 수 있 다. 메인 블럭은 아연 다이 캐스팅 또는 알루미늄 다이 캐스팅으로 제작될 수 있고, 금속물을 가공하여 제 작될 수 있다. 또한, 메인 블럭의 외주면은 고염수에 강한 재질로 도포될 수 있다. 예를 들면, 상기 외주 면은 고염수에 대해 부식 등이 견딜 수 있는 재질로 도포 또는 도금함으로써 메인 블럭을 외부 환경으로부터 보 호할 수 있다. 또 다른 예로, 상기 메인 블럭은 외부로부터 제공된 복합 케이블이 수용되는 제 1방향의 하단 블럭 과 상기 제 1방향과 서로 다른 제 2방향으로 연장된 상단 블럭을 포함할 수 있다. 상기 하단 블럭 및 상단 블럭은 일체형으로 구성될 수 있으며, 상기 제 1방향과 제 2방향은 서로 직교하는 방향일 수 있다. 본 발명의 일 실시예에 따른, 상기 서브 블럭은 메인 블럭의 단부와 결합하여 연장되는 관형 하우징 형태로 상기 메인 블럭과 동일 재질로 구성될 수 있다. 예를 들면, 서브 블럭은 PAAS, PPS(Polyhenylene Sulfide), PPA(Polyphthal Amide) 중 어느 하나의 재질로 이루어진 사출물일 수 있다. 서브 블럭은 메인 블럭과 마찬가지로, 아연 다이 캐스팅 또는 알루미늄 다이 캐스팅으로 제작될 수 있고, 금속물을 가공하여 제작될 수 있다. 또한, 서브 블럭의 외주면은 고염수에 강한 재질로 도포될 수 있다. 예를 들면, 상기 외주면은 고염수에 대해 부식 등이 견딜 수 있는 재질로 도포 또는 도금함으로써 서블 블럭을 외부 환경으로부터 보호할 수 있다. 본 발명의 일 실시예에 따른, 상기 서브 블럭의 외주면에는 커넥터가 안착될 수 있는 적어도 하나의 안착면을 배치할 수 있다. 본 발명의 일 실시예에 따르면, 메인 블럭 외측에 3개의 서브 블럭이 결합되어 있으나, 상기 수는 일 예에 해당하며, 설치자가 원하는 다양한 수의 서브 블럭이 배치될 수 있다. 상기 확장된 서브 블럭의 수에 따라 복합 케이블에서 용도 및 신호의 주파수에 맞추어 분기된 케이블을 커넥터와 연결할 수 있다. 본 발명의 일 실시예에 따른, 커넥터는 서브 블럭의 안착면에 안착되는 원통형의 금속부일 수 있다. 커넥터의 하부면은 복합 케이블의 적어도 일부와 연결되고, 커넥터의 상부면은 외부로 연 장되는 새로운 외부 케이블과 연결될 수 있다. 도 2는 본 발명의 일 실시예에 따른, 확장형 케이블 분배장치의 내면을 나타낸 단면도이다 도 2에 도시된 바와 같이, 케이블 분배장치 내부에는 외부로부터 공급된 복합 케이블이 각각 분기되어 서브 블럭으로 확장되는 것을 확인할 수 있다. 본 발명의 일 실시예에 따른, 메인 블럭은 일체형으로 구성된 관형으로 서로 개구되어 통하는 하단 블럭 및 상단 블럭를 포함할 수 있다. 상기 하단 블럭의 단부는 외부에서 공급된 복합 케이블의 단부가 수용되는 수용홀 및 상기 수용홀에 수용된 복합 케이블과 상기 하단 블럭을 결합하 는 케이블 체결부를 포함할 수 있다. 본 발명의 일 실시예에 따라, 케이블 체결부는 금속 재질로 복합 케이블과 결합하여 구조적으로 체결 강성을 제공할 수 있다. 상기 케이블 체결부는 예를 들면, 너트일 수 있으며, 나사선이 마련된 복합 케이 블의 단부와 고정 결합할 수 있다. 다만, 복합 케이블의 단부는 나사선 이외에도 홈 또는 단턱이 마련된 다양한 결합 구조로 변형될 수 있으며, 이러한 변형 예들에 따라 상기 수용홀 및 케이블 체결부 또한 다양한 형태도 변형 실시될 수 있다. 본 발명의 일 실시예에 따른, 상기 상단 블럭은 하단 블럭의 상부에 연결 배치되고, 양측으로 개구되 며 서브 블럭과 결합될 수 있다. 하단 블럭으로부터 수용된 복합 케이블의 일부는 상단 블럭 내부에서 다양한 용도에 따른 주파수 별로 분기될 수 있다. 본 발명의 일 실시예에 따라, 상단 블럭의 양측으로 개구된 양 단부는 서브 블럭과 결합하는 확장 체 결부를 포함할 수 있다. 상기 확장 체결부는 서브 블럭의 전단 체결부와 상호 결합하며, 상기 서브 블럭의 단부가 삽입할 수 있도록 서브 블럭보다 큰 크기로 구성할 수 있다. 예를 들면, 관 형의 확장 체결부는 관형의 전단 체결부의 직경보다 큰 크기의 직경으로 구성되어 상기 확장 체결부 내측으로 서브 블럭의 전단 체결부가 삽입 결합할 수 있다. 본 발명의 일 실시예에 따른, 상단 블럭의 확장 체결부는 상기 서브 블럭의 전단 체결부와 삽입 결합하면서 내측으로 홈이 생성되며, 상기 홈으로 실링부재가 배치될 수 있다. 상기 실링부재는 외부 유체가 케이블 분배장치 내부로 침투하는 것을 방지하는 방수 기능을 제공할 수 있다.(도 6참조) 실링부재의 구체적인 설명은 후술한다. 본 발명의 일 실시예에 따른, 서브 블럭은 양단이 개구된 관 형상으로, 내부로 메인 블럭에서 분배된 케이블이 통과하는 통로를 제공할 수 있다. 서브 블럭의 일단은 상기 메인 블럭의 확장 체결부 내측으로 적어도 일부가 삽입되어 결합하는 전단 체결부가 구성될 수 있다. 또한, 서브 블럭의 타 일단은 상기 전단 체결부와 대향 배치되며, 서로 다른 서브 블럭 또는 측면 커버와 결합하는 후단 체결부가 구성될 수 있다. 본 발명의 일 실시예에 따른, 상기 전단 체결부의 내측 개구는 메인 블럭 또는 다른 서브 블럭 에서 전달된 분배된 케이블이 들어오는 입구를 제공할 수 있다. 또한, 상기 후단 체결부의 내측 개구 는 다른 서브 블럭으로 상기 분배된 케이블을 전달하는 출구를 제공할 수 있다. 본 발명의 일 실시예에 따른, 서브 블럭은 상기 전단 체결부와 메인 블럭을 연결하여 상기 복합 케이블에서 분배된 케이블을 배분할 수 있다. 또 다른 예로, 상기 서브 블럭은 상기 후단 체결부 와 서로 다른 서브 블럭간의 연결을 통해 분배된 케이블을 확장할 수 있다. 본 발명의 일 실시예에 따른, 확장형 케이블 분배장치는 상기 서브 블럭의 후단 체결부에 측면 커버와 결합하여 추가적인 복합 케이블의 분배를 차단하고 외부로부터 이물질 침투를 방지할 수 있다. 본 발명의 일 실시예에 따른, 서브 블럭은 커넥터가 안착되는 안착면을 포함할 수 있다. 상기 안착면은 서브 블럭 외주면에 배치되며, 서브 블럭 내부와 연결 가능한 적어도 하나의 안착홀 를 포함할 수 있다. 또 다른 예로, 상기 안착면은 서브 블럭의 전단 체결부 및 후단 체결부 사이에 배치되며, 커넥터의 하측의 적어도 일부가 수용될 수 있는 홈 형상으로 구비될 수 있다. 상기 홈은 커넥터의 하 측에 대응되는 형상으로 구비되어, 커넥터가 수월하게 지지되고 고정 부착되도록 할 수 있다. 본 발명의 일 실시예에 따른, 상기 안착홀은 분배된 케이블이 커넥터와 연결될 수 있는 통로를 제공할 수 있다. 메인 블럭 또는 서브 블럭에서 분배된 케이블은 상기 안착홀을 통해 커넥 터 하면에 접촉하여 전기적으로 연결될 수 있다. 본 발명의 일 실시예에 따르면, 메인 블럭으로 제공되는 복합 케이블(3pair*12core)은 3개의 분배 케 이블로 분기될 수 있는 구조이다. 설치자가 상기 복합 케이블을 3개의 분배 케이블로 전환하기 위 해선 서브 블럭 3개를 메인 블럭 측면에 결합할 수 있다. 우선, 메인블럭의 양측에 배치된 확장 체결부와 서브 블럭의 전단 체결부와 결합하여 케이블 분배장치의 길이를 확장할 수 있다. 또한, 결합된 서브 블럭 외측으로 또 하나의 서브 블럭을 연장하고, 각 서브 블럭마다 분배된 케이블(1pair*4core)를 제공할 수 있다. 각 서브 블럭의 커넥터에 각 분배된 케이블을 연결 하면, 간단한 조작으로 총 3개의 분배 케이블을 구현할 수 있다. 그리고 회전 가능한 서브 블럭으로 방향 을 손쉽게 제어하여 설치자가 원하는 방향으로 외부 케이블과 연결할 수 있다. 이하, 각 메인 블럭 또는 서브 블럭의 결합부의 회전 구성을 상세하게 설명한다. 도 3은 본 발명의 일 실시예에 따라, 메인 블럭과 서브 블럭사이에 결합 체결 구조에 대해 나타낸 분해 사시도 이다. 도 4는 본 발명의 일 실시예에 따른 케이블 분배장치의 결합 구조의 관계를 나타낸 사시도 및 단면도이다. 도 4(a)는 케이블 분배장치의 체결부를 확대한 사시도 이며, 도 4(b)는 케이블 분배장치의 체결부 의 내측이 도시된 단면도이다. 도 5은, 도 4(b)를 확대한 단면도이다. 도 3 내지 도 5에 나타난 바와 같이, 케이블 분배장치는 상기 메인 블럭 또는 서브 블럭의 체결 부가 서로 회전이 가능한 결합을 유도하는 커플링 부재를 포함할 수 있다. 본 발명의 일 실시예에 따른, 케이블 분배장치는 메인 블럭과 서브 블럭을 포함하며, 상기 도 3 에서 상기 메인 블럭 좌측에 대면 배치된 서브 블럭을 제 1서브 블럭(300(a))으로, 상기 메인 블럭 우측에 대면 배치된 서브 블럭을 제 2서브 블럭(300(b))으로 지칭하도록 한다. 또한, 상기 제 1서브 블럭(300(a)) 좌측에 배치된 서브 블럭을 제 3서브 블럭(300(c))으로 지칭하도록 한다. 본 발명의 일 실시예에 따른 커플링 부재는 메인 블럭의 확장 체결부와 제 1서브 블럭(300(a)) 또는 제 2서브 블럭(300(b))의 전단 체결부 사이에 배치되며, 상기 메인 블럭과 상기 제 1서브 블럭 (300(a)) 또는 상기 메인 블럭과 제 2서브 블럭(300(b))이 서로 결합하여 이탈되지 않도록 적어도 하나의 단턱부(730(a),(b))를 포함할 수 있다. 또 다른 일 실시예에 따른 커플링 부재는 제 1서브 블럭(300(a))의 후단 체결부와 제 3서브 블럭 (300(c))의 전단 체결부 사이에 배치되며, 상기 제 1서브 블럭(300(a))과 제 3서브 블럭(300(c))이 서로 결합하여 이탈되지 않도록 적어도 하나의 단턱부(730(a),(b))를 포함할 수 있다. 본 발명의 일 실시예에 따른, 케이블 분배장치의 제 2서브 블럭(300(b))의 후단 체결부 및 제 3서브 블럭(300(c))의 후단 체결부는 측면 커버와 결합하여 상기 케이블 분배장치를 외부와 차단할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재는 폐쇄된 곡선 형상(예를 들어, 링 형상)의 몸체를 포함하 여 구성되며, 상기 몸체를 중심으로 양 방향으로 분리 배치된 단턱부(730(a),(b))를 포함할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재의 몸체 하단은 제 1서브 블럭(300(a))의 전단 체결부 일면에 배치되며, 서브 블럭과 동시에 회전할 수 있도록 결합과 동시에 슬라이드 회전할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재의 단턱부(730(a),(b))는 제 1서브 블럭(300(a))의 전단 체결부 와 결합하는 제 1단턱부(730(a))와 메인 블럭의 확장 체결부와 결합하는 제 2단턱부(730(b))를 포함할 수 있다. 상기 제 1단턱부(730(a)) 및 제 2단턱부(730(b))는 복수 개로 구성될 수 있다. 상기 제 1단턱부(730(a))와 결합하는 제 1서브 블럭(300(a))의 전단 체결부는 복수 개의 결합홀을 포 함할 수 있다, 상기 복수개의 결합홀 각각은 상기 제 1단턱부(730(a)) 각각과 개별적으로 끼움 결합되어 고정될 수 있다. 따라서 제 1서브 블럭(300(a))이 분배된 케이블의 방향 전환을 위하여 회전시, 커플링 부재도 상기 제 1서브 블럭(300(a))의 회전에 상응하여 동시에 회전할 수 있다. 반면, 상기 제 2단턱부(730(b))와 결합하는 메인 블럭의 확장 체결부는 폐쇄 곡선 형상의 하나의 결 합홀을 포함할 수 있다. 상기 하나의 결합홀은 제 2단턱부(730(b))와 끼움 결합되어 상기 서브 블럭 이 이탈되지 않도록 고정될 수 있다. 다만, 제 2단턱부(730(b))와 결합홀의 결합은 제 1서브 블럭(300 (a))의 회전 방향으로는 고정 결합되지 아니한 바, 상기 커플링 부재는 회전할 수 있다. 즉, 메인 블럭 은 움직이지 않은 상태에서 커플링 부재만 회전할 수 있다. 본 발명의 일 실시예에 따른, 제 2서브 블럭(300(b))은 메인 블럭의 우측에 결합 배치되며, 제 1서브 블럭 (300(a))과 동일한 방식으로 결합 및 회전 동작할 수 있다. 예를 들어, 커플링 부재의 단턱부(730(a), (b))는 제 2서브 블럭(300(b))의 전단 체결부와 결합하는 제 1단턱부(730(a))와 메인 블럭의 확장 체 결부와 결합하는 제 2단턱부(730(b))를 포함할 수 있다. 상기 제 1단턱부(730(a)) 및 제 2단턱부(730 (b))는 복수 개로 구성될 수 있다. 상기 제 1단턱부(730(a))와 결합하는 제 2서브 블럭(300(b))의 전단 체결부는 복수개의 결합홀을 포 함할 수 있다, 상기 복수개의 결합홀 각각은 상기 제 1단턱부(730(a)) 각각과 개별적으로 끼움 결합되어 고정될 수 있다. 따라서 제 2서브 블럭(300(b))으로 분배된 케이블의 방향 전환을 위하여 회전시, 커플링 부재도 제 2서브 블럭(300(a))의 회전에 상응하여 동시에 회전할 수 있다. 본 발명의 일 실시예에 따른, 상기 커플링 부재와 메인 블럭 또는 서브 블럭의 결합에 따라, 고 정된 메인 블럭에 대하여 상기 서브 블럭이 회전 가능할 수 있다. 따라서 서브 블럭 외주면에 배치된 커넥터는 서브 블럭과 함께 회전이 가능하여 설치자가 원하는 방향에 분배된 케이블과 외 부장치(예를 들어, 케이블)을 연결할 수 있다. 분배된 케이블이 고정된 방향에서 외부 케이블과 연결되기 때문에 커넥터가 배치된 방향과 반대방향에 외부 케 이블이 위치하는 경우에, 외부 케이블의 길이가 추가적으로 더 필요하고 외부 케이블의 꼬임 현상이 일어나는 문제점이 있었다. 또한, 외부 케이블의 길이 연장에 따른 전력 손실(loss)이 발생하는 문제점이 있었다. 그러나, 본 발명에 따른 확장형 케이블 분배장치는 외부 케이블의 방향에 따라 설치자가 자유롭게 커넥터의 위치를 변경할 수 있도록 회전 가능한 서브 블럭을 구현함에 따라, 부품비를 절감하고 손실되는 전력을 최 소화하는 효과가 있다. 또한, 서브 블럭이 분배되는 케이블에 따라 추가적으로 연장되고 제거할 수 있어, 설치자의 작업시간이 단 축되는 효과가 있다. 도 6은 본 발명의 다른 실시예에 따라, 메인 블럭과 서브 블럭사이에 결합 체결 구조에 대해 나타낸 분해 사시 도이다. 도 6에 나타난 바와 같이, 케이블 분배장치는 도 3에서 사용된 서브 블럭 이상의 추가적인 케이블 분 배가 필요한 경우, 추가적인 서브 블럭을 결합하여 사용할 수 있다. 도 3에서, 메인 블럭으로 제공되는 복합 케이블(3pair*12core)은 3개의 분배 케이블로 분기될 수 있는 구조를 설명하였다면, 도 4에서는, 메인 블럭으로 제공되는 복합 케이블(5pair*20core)은 5개의 분배 케이블로 분기될 수 있는 구조를 설명한다. 본 발명의 일 실시예에 따른, 메인 블럭으로 제공되는 복합 케이블(3pair*12core)은 5개의 분배 케이 블로 분배될 수 있는 구조이다. 설치자가 상기 복합 케이블을 5개의 분배 케이블로 전환하기 위해선 서브 블럭 5개를 메인 블럭 측면에 결합할 수 있다. 우선, 메인 블럭의 양측에 배치된 확장 체결부 와 서브 블럭의 전단 체결부와 결합하여 케이블 분배장치의 길이를 확장할 수 있다. 또한, 결합된 서브 블럭 외측으로 또 하나의 서브 블럭을 연장하고, 각 서브 블럭마다 분배된 케이블 (1pair*4core)를 제공할 수 있다. 각 서브 블럭의 커넥터에 각 분배된 케이블을 연결하면, 간단한 조작으로 총 5개의 분배 케이블을 구현할 수 있다. 그리고 회전 가능한 서브 블럭으로 방향을 손쉽 게 제어하여 설치자가 원하는 방향으로 외부 케이블과 연결할 수 있다. 상기 도 6에서, 도 3의 제 1서브 블럭(300(a)), 제 2서브 블럭(300(b)) 및 제 3서브 블럭(300(c))이 메인 블럭 에 연결된 상태에서, 추가적으로 제 4서브 블럭(300(d)) 및 제 5서브 블럭(300(e))의 연결 구조에 관하여설명한다. 상기 커플링 부재는 동일한 구조이므로, 구체적인 구성은 생략한다. 본 발명의 일 실시예에 따른, 커플링 부재의 단턱부(730(a),(b))는 제 5서브 블럭(300(e))의 전단 체결부 와 결합하는 제 1단턱부(730(a))와 제 3서브 블럭(300(c))의 후단 체결부와 결합하는 제 2단턱부 (730(b))를 포함할 수 있다. 본 발명의 일 실시예에 따른, 상기 제 1단턱부(730(a))와 결합하는 제 5서브 블럭(300(e))의 전단 체결부 는 복수개의 결합홀을 포함할 수 있다, 상기 복수개의 결합홀 각각은 상기 제 1단턱부(730(a)) 각각 과 개별적으로 끼움 결합되어 고정될 수 있다. 따라서 제 5서브 블럭(300(e))에 분배된 케이블의 방향 전환 을 위하여 회전시에 커플링 부재도 이에 상응하여 동시에 회전할 수 있다. 반면, 상기 제 2단턱부(730(b))와 결합하는 제 3 서브 블럭의 후단 체결부는 폐쇄 곡선 형상의 하나 의 결합홀을 포함할 수 있다. 상기 하나의 결합홀은 제 2단턱부(730(b))와 끼움 결합되어 서브 블럭 이 이탈되지 않도록 고정될 수 있다. 다만, 제 2단턱부(730(b))와 결합홀의 결합은 제 3서브 블럭(300(c)) 의 회전 방향으로는 고정 결합되지 아니한 바, 상기 커플링 부재는 회전할 수 있다. 즉, 메인 블럭은 움직이지 않은 상태에서 커플링 부재만 회전할 수 있다. 본 발명의 일 실시예에 따른, 제 4서브 블럭(300(d))은 제 2서브 블럭(300(b))의 우측에 결합 배치되며, 제 5서 브 블럭(300(e))과 동일한 방식으로 결합 및 회전 동작할 수 있다. 예를 들어, 커플링 부재의 단턱부 (730(a),(b))는 제 4서브 블럭(300(d))의 전단 체결부와 결합하는 제 1단턱부(730(a))와 제 2서브 블럭 (300(b))의 후단 체결부와 결합하는 제 2단턱부(730(b))를 포함할 수 있다. 상기 제 1단턱부(730(a)) 및 제 2단턱부(730(b))는 복수 개로 구성될 수 있다. 상기 제 1단턱부(730(a))와 결합하는 제 4서브 블럭(300(d))의 전단 체결부는 복수개의 결합홀을 포 함할 수 있다, 상기 복수개의 결합홀 각각은 상기 제 1단턱부(730(a)) 각각과 개별적으로 끼움 결합되어 고정될 수 있다. 따라서 서브 블럭으로 분배된 케이블의 방향 전환을 위하여 회전시에 커플링 부재 도 이에 상응하여 동시에 회전할 수 있다. 본 발명의 일 실시예에 따른, 상기 커플링 부재와 제 4, 5서브블럭(300(d), 300(e)) 및 제 2,3서브 블럭 (300(b),300(c))의 결합에 따라, 제 2, 3서브 블럭(300(b),300(c))에 대하여 상기 4, 5서브 블럭(300(d), 300(e))이 회전할 수 있다. 따라서 4, 5서브 블럭(300(d), 300(e)) 외주면에 배치된 커넥터는 서브 블럭 과 회전이 가능하여 설치자가 원하는 방향에 분배된 케이블과 외부장치(예를 들어, 외부 케이블)을 연 결할 수 있다. 본 발명의 일 실시예에 따르면, 총 5개의 서브 블럭의 수를 메인 블럭 양측에 배치하였다, 다만, 서 브 블럭의 수는 이에 한정된 것은 아니며, 동일한 체결 구조를 가진 추가적인 서브 블럭을 설치자가 원하는 케이블의 분배 수만큼 확장할 수 있고, 이미 설치된 서브 블럭도 손쉽게 제거할 수 있다. 다시 도 4 및 도 5를 참조하면, 상기 체결부는 메인 블럭 및 서브 블럭간의 체결 구조일 수 있으며, 서브 블럭 및 서로 다른 서브 블럭 간의 체결 구조일 수 있다. 서브 블럭의 체결 구조는 상기 설명한 바와 같이, 메인 블럭-제 1서브 블럭(300(a))-제 3서브 블럭(300(c))-제 5서브 블럭(300(e))간의 체결 관계일 수 있다. 또한, 메인 블럭-제 2서브 블럭(300(b))-제 4서브 블럭(300(d))간의 체결 관계일 수 있다. 본 발명의 일 실시예에 따른, 케이블 분배장치는 메인 블럭과 제 1서브 블럭(300(a)) 사이에 배치되고, 외부로부터 유체의 유입을 차단하는 실링부재를 더 포함할 수 있다. 본 발명의 일 실시예에 따른, 실링부재는 링 형상의 구조로 메인 블럭의 확장 체결부 하부와 상 기 서브 블럭 전단 체결부 상부와 접촉 배치되어 케이블 분배장치의 내부 공간을 외부와 차단할 수 있다. 상기 실링부재는 커플링 부재 외측에서, 상기 전단 체결부 일면을 기준으로 상기 커플 링 부재와 동일 선상에 배치될 수 있다. 본 발명의 일 실시예에 따른, 메인 블럭과 서브 블럭간의 결합 또는 서브 블럭들 간의 결합에 따라 홈이 형성되고 상기 홈으로 실링부재가 삽입 배치될 수 있다. 상기 홈 단부는 메인 블럭 또는 서브 블럭 내부로 들어갈 수 있는 틈을 제공할 수 있어 실링부재를 통하여 차단하고자 함이다.본 발명의 일 실시예에 따른, 실링부재는 메인 블럭과 서브 블럭의 결합에 따라 압착되는 탄성 재질을 포함할 수 있다. 실링부재의 상면은 서브 블럭과 접촉 배치되기 때문에, 서브 블럭의 회전에 따라 마찰력을 제공하여 설치자가 서브 블럭을 수동적으로 회전시 회전 질감을 제공할 수 있다. 또 다른 예로, 상기 실링부재는 방수 성능을 확장하기 위하여 상기 홈 내부에 복수 개로 배치할 수 있다. 본 발명의 일 실시예에 따른, 실링부재는 메인 블럭과 제 2서브 블럭(300(b)) 사이 또는 메인 블럭 과 제 1서브 블럭(300(a)) 사이 또는 제 1서브 블럭(300(a))과 제 3서브 블럭(300(c)) 사이에 배치될 수 있다. 또 다른 예로, 제 2서브 블럭(300(b))과 제 4서브 블럭(300(d)) 사이 또는 제 3서브 블럭(300(c))과 제 5서브 블럭(300(e)) 사이에 배치될 수 있다. 본 발명의 일 실시예에 따른, 케이블 분배장치는 양단에 측면 커버가 배치되어, 내부 공간을 외부 환 경과 차단할 수 있다. 상기 측면 커버는 일면이 닫힌 원통 형상이며, 개구된 타일면은 서브 블럭의 후단 체결부와 결합하는 전면 체결부를 포함할 수 있다.(도 3참조) 본 발명의 일 실시예에 따른, 측면 커버의 전단 체결부는 각각의 서브 블럭의 전단 체결부(31 0)와 동일한 구조 및 기능을 포함할 수 있다. 예를 들면, 커플링 부재를 통하여 서브 블럭과 결합하 기 위하여, 상기 커플링 부재의 단턱부(730(a),(b))와 결합하기 위한 복수개의 결합홈을 포함할 수 있다 또 다른 예로, 서브 블럭의 후단 체결부에 삽입 배치될 수 있도록 측면 커버의 전단 체결 부는 서브 블럭의 후단 체결부보다 작은 직경을 가지도록 구성될 수 있다. 본 발명의 일 실시예에 따른, 케이블 분배장치 외주면에는, 지지 브라켓을 배치하여, 본 장치를 고정 할 수 있다(도 2참조). 상기 지지 브라켓은 메인 블럭 외주면 상에 배치되고, 복합 케이블이 상, 하 방향을 향하도록 외부 장치와 결합하여 케이블 분배장치를 고정할 수 있다. 상기 지지 브라켓으로 메인 블럭을 고정하여, 서브 블럭의 상대적 회전시 케이블 분배장치 의 중심을 지지하여 설치자가 원하는 방향으로 외부 케이블을 유리하게 연결할 수 있다. 본 발명의 일 실시예에 따른, 지지 브라켓은 메인 블럭 외주면 외에도, 상기 측면 커버 외면에 연결되어, 본 장치를 고정할 수 있다. 상기 지지 브라켓이 케이블 분배장치의 중심과 양 단부를 지지 함에 따라, 서브 블럭을 회전하여 설치가가 원하는 방향으로 외부 케이블을 유리하게 연결할 수 있다. 이하, 상기 다양한 실시예에 따라 확장형 케이블 분배장치 제조방법에 대하여 설명하도록 한다. 도 7은 본 발명의 일 실시예에 따른 확장형 케이블 분배장치 제조 방법에 대하여 나타낸 흐름도이다. 도 7에 나타난 바와 같이, 케이블 분배장치 제조 방법은, 공정 10에 따라, 우선적으로 외부에서 공급된 복 합 케이블의 단부가 메인 블럭에 수용되어 결합하는 공정을 진행할 수 있다. 다만, 설치자는 미리 복합 케이블에서 분배될 케이블 수를 미리 정하여 전체 서브 블럭이 필요한 수를 계산할 수 있다. 예를 들면, 도 3과 같이, 설치자가 복합 케이블에서 필요한 주파수에 따라 세 개의 분배된 케이블을 이용하려는 경우에, 메인 블럭과 양측에 배치될 세 개의 서브 블럭을 미리 준비하여 제 작할 수 있다. 또 다른 예로, 도 4와 같이, 설치자가 복합 케이블에서 필요한 주파수에 따라 다섯 개의 분 배된 케이블을 이용하려는 경우에, 메인 블럭과 양측에 배치될 다섯 개의 서브 블럭을 미리 준비 하여 제작할 수 있다. 본 발명의 일 실시예에 따라, 메인 블럭은 일체형으로 구성된 관형으로 서로 개구되어 통하는 하단 블럭 및 상단 블럭를 포함하여 제작할 수 있다. 상기 하단 블럭의 단부는 외부에서 공급된 복합 케 이블의 단부가 수용되는 수용홀 및 상기 수용홀에 수용된 복합 케이블과 상기 하단 블럭 을 결합하는 케이블 체결부를 포함할 수 있다. 본 발명의 일 실시예에 따라, 케이블 체결부는 금속 재질로 복합 케이블과 결합하여 구조적으로 체결 강성을 제공할 수 있다. 본 발명의 일 실시예에 따라, 상기 상단 블럭은 하단 블럭의 상부에 연결 배치되고, 양측으로 개구되 며 서브 블럭과 결합될 수 있다. 하단 블럭으로부터 수용된 복합 케이블의 일부는 상단 블럭 내부에서 분배되는 공정이 진행될 수 있다. 상기 메인 블럭과 복합 케이블이 결합된 후, 동작 30에 따라, 상기 복합 케이블로부터 분배가 필 요한 케이블의 수에 따라, 상기 메인 블럭 외측으로 적어도 하나의 서브 블럭이 결합 배치되는 공정 이 진행될 수 있다. 본 발명의 일 실시예에 따라, 서브 블럭은 양단이 개구된 관 형상으로, 내부로 메인 블럭에서 분배된 케이블이 통과하는 통로를 제공할 수 있다. 서브 블럭의 일단은 상기 메인 블럭의 확장 체결부 내측으로 적어도 일부가 삽입되어 결합하는 전단 체결부가 구성되며, 서브 블럭의 타 일단은 상기 전단 체결부와 대향 배치되며, 서로 다른 서브 블럭 또는 측면 커버와 결합하는 후단 체결 부가 구성될 수 있다. 본 발명의 일 실시예에 따라, 상기 전단 체결부의 내측 개구는 메인 블럭 또는 다른 서브 블럭 에서 전달된 분배된 케이블이 들어오는 입구를 제공할 수 있다. 또한, 상기 후단 체결부의 내측 개구 는 다른 서브 블럭으로 분배된 케이블을 전달하는 출구를 제공할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재는 메인 블럭의 확장 체결부와 서브 블럭의 전단 체결부 사이에 배치되며, 상기 메인 블럭과 상기 서브 블럭이 서로 결합하여 이탈되지 않도록 적어도 하나의 단턱부(730(a),(b))를 포함할 수 있다. 또 다른 일 실시예에 따른, 커플링 부재는 서브 블럭의 후단 체결부와 서로 다른 서브 블럭 의 전단 체결부 사이에 배치되며, 상기 서브 블럭들이 서로 결합하여 이탈되지 않도록 적어도 하나의 단턱부(730(a),(b))를 포함할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재의 몸체 하단은 서브 블럭의 전단 체결부 일면에 배치되며, 서브 블럭과 동시에 회전할 수 있도록 결합과 동시에 슬라이드 회전할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재의 단턱부(730(a),(b))는 서브 블럭의 전단 체결부와 결합하는 제 1단턱부(730(a))와 메인 블럭의 확장 체결부와 결합하는 제 2단턱부(730(b))를 포함할 수 있다. 상기 제 1단턱부(730(a)) 및 제 2단턱부(730(b))는 복수 개로 구성될 수 있다. 상기 제 1단턱부(730(a))와 결합하는 서브 블럭의 전단 체결부는 복수개의 결합홀을 포함할 수 있다, 상기 복수개의 결합홀 각각은 상기 제 1단턱부(730(a)) 각각과 개별적으로 끼움 결합되어 고정될 수 있다. 따라서 제 1서브 블럭(300(a))이 분배된 케이블의 방향 전환을 위하여 회전시, 커플링 부재도 이에 상응하여 동시에 회전할 수 있다. 반면, 상기 제 2단턱부(730(b))와 결합하는 메인 블럭의 확장 체결부는 폐쇄 곡선 형상의 하나의 결 합홀을 포함할 수 있다. 상기 하나의 결합홀은 제 2단턱부(730(b))과 끼움 결합되어 상기 서브 블럭 이 이탈되지 않도록 고정될 수 있다. 다만, 제 2단턱부(730(b))와 결합홀의 결합은 서브 블럭의 회전 방향으로는 고정 결합되지 아니한 바, 상기 커플링 부재는 회전할 수 있다. 즉, 메인 블럭은 움직이 지 않은 상태에서 커플링 부재만 회전할 수 있다. 본 발명의 일 실시예에 따른, 커플링 부재의 동시 회전 및 고정 구조는 서로 다른 서브 블럭 사이에 도 적용될 수 있음은 당연하다. 이후, 공정 50에 따라, 상기 메인 블럭으로부터 연장된 상기 복합 케이블의 적어도 일부를 상기 서브 블럭 에 배치된 커넥터와 연결하는 공정이 진행될 수 있다. 설치자는 공정 30 이전에, 서브 블럭에는 분배된 케이블과 전기적 연결되어 외부 케이블과 접속하는 커넥터를 배치할 수 있다. 본 발명의 일 실시예에 따라, 상기 커넥터는 서브 블럭은 외주면에 배치된 안착면에 안착되며, 상기 안착면은 서브 블럭 내부와 연결 가능한 적어도 하나의 안착홀를 포함하도록 구성할 수 있 다. 본 발명의 일 실시예에 따라, 상기 안착홀은 분배된 케이블이 커넥터와 연결될 수 있는 통로를 제공할 수 있다. 따라서, 메인 블럭 또는 서브 블럭에서 분배된 케이블은 상기 안착홀을 통 해 커넥터 하면에 접촉하여 전기적으로 연결될 수 있다. 이후, 공정 70에 따라, 상기 메인 블럭 또는 상기 서브 블럭 내부에 배치된 상기 복합 케이블 또 는 상기 분배된 케이블을 보호하기 위하여, 상기 서브 블럭 외측으로 측면 커버를 결합하는 공정 이 진행될 수 있다. 케이블 분배장치 양단은 측면 커버가 배치되어, 내부 공간을 외부 환경과 차단할 수 있다. 상기 측면 커버는 일면이 닫힌 원통 형상이며, 개구된 타일면은 서브 블럭의 후단 체결부와 결합하는 전단 체결부를 포함하여 구성할 수 있다. 본 발명의 일 실시예에 따른, 측면 커버의 전단 체결부는 전술한 서브 블럭의 전단 체결부(31 0)와 동일한 구조 및 기능을 포함할 수 있다. 예를 들면, 커플링 부재를 통하여 서브 블럭과 결합하 기 위하여, 상기 커플링 부재의 단턱부(730(a),(b))와 결합하기 위한 복수개의 결합홈을 포함할 수 있다. 또 다른 예로, 서브 블럭의 후단 체결부에 삽입 배치될 수 있도록 측면 커버의 전단 체결 부는 서브 블럭의 후단 체결부보다 작은 직경을 가지도록 구성될 수 있다. 본 발명의 일 실시예에 따른, 케이블 분배장치 제조밥법으로, 외부 케이블의 방향에 따라 설치자가 자유롭 게 커넥터의 위치를 변경할 수 있도록 회전 가능한 서브 블럭을 구현함에 따라, 부품비를 절감하고 손실되 는 전력을 최소화할 수 있다. 또한, 주파수에 따라 필요한 케이블을 확장하기 위하여, 간단하게 서브 블럭을 확장할 수 있으며, 확장 방 법도 간편하여, 설치자의 작업 시간이 단축될 수 있다. 이상에서 설명한 본 발명의 다양한 실시예의 전자장치는 전술한 실시 예 및 도면에 의해 한정되는 것은 아니고,"}
{"patent_id": "10-2016-0039751", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명의 기술적 범위 내에서 여러 가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는 기술분야에서 통상 의 지식을 가진 자에게 있어 명백할 것이다."}
{"patent_id": "10-2016-0039751", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른, 케이블 분배 장치의 외면을 나타낸 사시도 이다. 도 2는 본 발명의 일 실시예에 따른, 케이블 분배 장치의 내면을 나타낸 단면도이다 도 3은 본 발명의 일 실시예에 따른, 메인 블럭과 서브 블럭사이에 결합 체결 구조에 대해 나타낸 분해 사시도 이다. 도 4는 본 발명의 일 실시예에 따른 케이블 분배장치의 결합 구조의 관계를 나타낸 사시도 및 단면도이다. 도 4(a)는 케이블 분배장치의 체결부를 확대한 사시도 이며, 도 4(b)는 케이블 분배장치의 체결부의 내측이 도시된단면도이다. 도 5는, 도 4(b)를 확대한 단면도이다. 도 6은 본 발명의 다른 실시예에 따른, 메인 블럭과 서브 블럭 사이에 결합 체결 구조에 대해 나타낸 분해 사시 도이다. 도 7은 본 발명의 일 실시예에 따른 확장형 케이블 분배장치의 제조 방법에 대하여 나타낸 흐름도이다."}
