{"patent_id": "10-2021-0116483", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0033783", "출원번호": "10-2021-0116483", "발명의 명칭": "약통의 원격 모니터링 시스템 및 방법", "출원인": "박현정", "발명자": "박현정"}}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "기 설정된 ID를 구비하고, 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신하는 스마트 약통; 약 처방전을 촬영하여 영상 인식을 통해 텍스트로 변환하고, 사용자가 복용할 약의 종류 및 복용 시간에 관한데이터를 자동으로 생성하여, 상기 스마트 약통과 상기 무선 송수신하는 사용자 무선 단말기; 상기 사용자 무선 단말기가 상기 수납된 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단한경우, 원격으로 처방을 요청받아 처방하는 의료진 무선 단말기; 및 상기 수납된 약에 대해 식약처에 등록된 약물 정보를 제공하고, 이를 기초로 상기 확인된 약의 잔량을 통한 사용자의 약 복용 상태 및 사용자의 건강 정보를 예측 및 저장하는 관리 서버; 를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 스마트 약통은상기 덮개부의 개폐 시 및 사용자의 약 복용으로 인해 감소된 약의 무게를 측정하는 무게 측정부; 상기 측정된 약의 무게 데이터를 인가받아, 상기 기 설정된 ID와 함께 미리 등록된 상기 사용자 무선 단말기에전송하는 제1 제어부; 및약품 별 무게정보 DB를 이용하여 측정된 상기 약의 무게 데이터를 디스플레이하여 약품의 종류를 구분하는 제1표시부; 를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 사용자 무선 단말기는 의료기관으로부터 처방받은 상기 약 처방전을 촬영하는 촬영부; 상기 촬영된 약 처방전의 이미지를 인가받아, 영상 인식을 통하여 텍스트로 변환하는 이미지 처리부;상기 변환된 텍스트를 인가받아, 상기 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하는 제2 제어부;및상기 복용 시간이 되면 상기 생성된 데이터에 따라 사용자가 복용할 약의 종류 및 약 봉지의 이미지를 디스플레이하는 제2 표시부; 를 포함하고,상기 제2 제어부가 상기 디스플레이 동작을 제어하는 동시에, 알람을 발생시켜 사용자가 상기 복용 시간에 약을공개특허 10-2023-0033783-3-복용하도록 유도하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 관리 서버는 사용자의 약 복용 상태 및 사용자의 건강 정보를 바탕으로 기계학습하여 사용자의 내원이 필요한 시기를 판단하는 인공지능 처리부; 및상기 사용자의 약 복용 상태 및 사용자의 건강 정보를 업데이트하여 저장하고, 상기 기계학습을 이용하여 주치의의 처방에 참고할 자료를 저장하는 DB부; 를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서, 상기 인공지능 처리부는 사용자의 내원이 필요한 시기로 판단된 경우, 상기 의료진 무선 단말기를 통해 주치의에게 알려 사용자의 내원을 유도하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서, 사용자가 내원하여 진료를 받은 경우, 상기 의료진 무선 단말기는, 사용자의 진료결과 데이터를 상기 사용자 무선 단말기로 전송하여 차후 처방에 대한 추천정보를 사용자에게 제공하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 사용자 무선 단말기는,휴대용 헬스케어 기기와의 연동으로 사용자의 생체신호 및 운동량을 포함하는 상기 건강 정보를 상기 관리 서버에 제공하는 것을 특징으로 하는,약통의 원격 모니터링 시스템."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공개특허 10-2023-0033783-4-(a) 스마트 약통이 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신하는 단계; (b) 미리 등록된 사용자 무선 단말기가 약 처방전을 촬영하여 영상 인식을 통해 텍스트로 변환하고, 사용자가복용할 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하여, 상기 복용 시간이 되면 복용할 약의 종류및 약 봉지의 이미지를 디스플레이 및 알람하는 단계; (c) 사용자가 약을 복용한 경우에, 상기 스마트 약통이 사용자의 약 복용으로 인해 감소된 약통의 무게를 측정하여, 상기 사용자 무선 단말기와 상기 무선 송수신하는 단계; (d) 상기 사용자 무선 단말기가 상기 감소된 약통의 무게를 바탕으로 약의 잔량을 확인하여, 사용자가 약을 복용하였는지 여부를 확인하는 단계; 및(e) 상기 사용자 무선 단말기가 상기 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단된 경우, 의료진 무선 단말기에 원격으로 처방을 요청하는 단계; 를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 (a) 단계는무게 측정부가 상기 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하는 단계; 제1 제어부가 상기 측정된 약의 무게 데이터를 인가받아, 상기 스마트 약통에 부여된 ID와 함께 미리 등록된 상기 사용자 무선 단말기와 상기 무선 송수신하는 단계; 및 전원부가 외부 전원을 상기 제1 제어부를 통해 약 수납부의 각 구성요소들에 전달하는 단계; 를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서, 상기 (b) 단계는촬영부가 의료기관으로부터 처방받은 상기 약 처방전을 촬영하는 단계; 이미지 처리부가 상기 촬영된 약 처방전의 이미지를 인가받아, 영상 인식을 통하여 텍스트로 변환하는 단계; 제2 제어부가 상기 변환된 텍스트를 인가받아, 상기 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하는 단계; 상기 복용 시간이 되면 제2 표시부가 상기 생성된 데이터에 따라 상기 복용할 약의 종류 및 약 봉지의 이미지를디스플레이하는 단계; 및 상기 제2 제어부가 상기 제2 표시부의 디스플레이 동작을 제어함과 동시에, 알람을 발생시켜 사용자가 상기 복용 시간에 약을 복용하도록 유도하는 단계;를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2023-0033783-5-제 10 항에 있어서, 사용자가 약을 복용한 경우에, 상기 무게 측정부가 사용자의 약 복용으로 인해 감소된 약통의 무게를 측정하여, 제1 통신부를 통해 상기 사용자 무선 단말기에 전송하는 단계; 및상기 제2 제어부가 상기 감소된 약통의 무게를 바탕으로 약의 잔량을 확인하고, 생성된 계획에 따라 사용자가약을 복용하였는지 여부를 확인하는 단계; 를 포함하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서, 상기 제2 제어부는,상기 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단된 경우, 약이 소진되기 전에 상기 의료진 무선 단말기에 원격으로 처방을 요청하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서, 상기 무게 측정부는,상기 측정된 약통의 무게를 상기 제1 통신부를 통해 상기 의료진 무선 단말기에 전송하여 병원 전산 프로그램DB와 연동하여 작동하도록 하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10 항에 있어서, 상기 이미지 처리부는약 처방전에 기재된 약 목록, 복용량, 복용 횟수, 복용 시간, 복용 일수 및 용법을 포함하는 이미지를 영상 인식하는 것을 특징으로 하는,약통의 원격 모니터링 방법."}
{"patent_id": "10-2021-0116483", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 10 항에 있어서, 상기 이미지 처리부는상기 영상 인식 대신에, RFID, NFC 및 QR 코드 중 하나로 인식하여 상기 텍스트로 변환하는 것을 특징으로하는,약통의 원격 모니터링 방법.공개특허 10-2023-0033783-6-"}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 약통의 원격 모니터링 시스템 및 방법을 공개한다. 이 기 설정된 ID를 구비하고, 덮개부의 개폐 때마 다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신하는 스마트 약통; 약 처방전을 촬영하여 영상 인식을 통해 텍스트로 변환하고, 사용자가 복용할 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하여, 상기 스 (뒷면에 계속)"}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 약통의 원격 모니터링에 관한 것으로서, 보다 상세하게는 사용자에게 올바른 약의 복용 지도 를 하고, 원격으로 이를 모니터링하여 적절한 시기에 처방 및 내원을 유도하게 하기 위한 약통의 원격 모니터링 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 복약 유도 및 관리를 위한 다양한 스마트 약통이 개발되고 있다. 기존의 스마트 약통은 환자 본인이 날자 별로 약을 분리하여 수납칸에 구비하지 않으면 복용 여부를 온전히 본 인 기억에 의존할 수 밖에 없는 한계를 가지고 있다. 최근에, 이러한 한계를 극복하기 위하여, 인지능력이 떨어지는 고령환자에게 과 복용, 미 복용 여부 및 복용약 을 알려주는 알람형 스마트 약통이 연구 개발되고 있다. 이러한 알람형 스마트 약통은 1종류의 약을 다량 보관하거나, 1회 복용 분의 약을 구분하기 위해 많은 수납칸을 구비하여 다양한 약을 포장을 뜯어 보관하고 있는 경우가 많았다. 그런데, 종래의 알람형 스마트 약통은 약의 포장을 뜯어 약통에 보관해야 하기 때문에, 사용자의 오류로 잘못된 약이 들어갈 수도 있고, 포장을 벗기는데 대한 불편함으로 사용자의 적극적인 참여를 유도하기 어려운 문제점이 있었다. 또한, 환자가 약을 안 먹었는데 기억을 못하게 되면 약의 잔량 확인이 불가능하고, 특히 약품의 변질 및 오염 가능성도 함께 존재한다. 특히, 의료기관으로부터 처방받은 약품의 경우, 각 봉지 안에 다양한 종류의 약이 혼재하고 복용 시간에 따라 복용해야 하는 약의 종류가 다를 수 있어 사용자의 혼동을 야기할 수가 있다. 또한, 한번에 복용해야 할 여러 개의 약을 각각 수납하기 위해서는 공간의 낭비가 많아질 수 있고, 환자가 수납 한 공간을 기억하기도 어려워 잘못된 약을 복용할 가능성도 있었다. 이에, 본 발명자는 사용자의 입력 또는 처방전의 영상 인식을 통해 약의 종류 및 잔량을 자동으로 관리하고, 사 용자에게 올바른 약 복용을 유도하는 알람형 스마트 약통과, 약통에 보관된 약품의 종류 및 양을 원격으로 모니 터링하고 처방받을 수 있는 약통의 원격 모니터링 시스템 및 방법을 발명하기에 이르렀다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1515559 B1"}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 약을 포장된 상태대로 보관 가능하고, 사용자의 수동 입력 또는 처방전의 영상 인식 및 약통 내부의 무게를 기반으로, 보관된 약의 종류 및 분량을 계산하여 잔량을 정확하게 확인함으로써, 사용자에게 복 용 시기를 자동으로 알려줄 수 있는 약통의 원격 모니터링 시스템을 제공하는 데 있다. 또한, 사용자의 복용 상황 및 건강상태를 원격으로 모니터링하여, 처방된 약이 완전히 소진되기 전에 원격처방 요청이 가능하도록 함으로써, 사용자의 적절한 내원을 유도하고, 인공지능의 기계학습을 이용하여 추후 처방에 참고할 자료를 제공할 수 있는 약통의 원격 모니터링 시스템을 제공하는 데 있다. 본 발명의 다른 목적은 상기 목적을 달성하기 위한 약통의 원격 모니터링 방법을 제공하는데 있다."}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템은 기 설정된 ID를 구비하고, 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신하는 스마트 약통; 약 처방전을 촬영하여 영상 인 식을 통해 텍스트로 변환하고, 사용자가 복용할 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하여, 상기 스마트 약통과 상기 무선 송수신하는 사용자 무선 단말기; 상기 사용자 무선 단말기가 상기 수납된 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단한 경우, 원격으로 처방을 요청받아 처방하는 의 료진 무선 단말기; 및 상기 수납된 약에 대해 식약처에 등록된 약물 정보를 제공하고, 이를 기초로 상기 확인된 약의 잔량을 통한 사용자의 약 복용 상태 및 사용자의 건강 정보를 예측 및 저장하는 관리 서버; 를 포함하는 것을 특징으로 한다. 상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템의 상기 스마트 약통은 상기 덮개부의 개폐 시 및 사용자의 약 복용으로 인해 감소된 약의 무게를 측정하는 무게 측정부; 상기 측정된 약의 무게 데이터를 인가받아, 상기 기 설정된 ID와 함께 미리 등록된 상기 사용자 무선 단말기에 전송하는 제1 제어부; 및 약품 별 무게정보 DB를 이용하여 측정된 상기 약의 무게 데이터를 디스플레이하여 약품의 종류를 구분하는 제1 표시부; 를 포함하는 것을 특징으로 한다. 상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템의 상기 사용자 무선 단말기는 의료기관으로 부터 처방받은 상기 약 처방전을 촬영하는 촬영부; 상기 촬영된 약 처방전의 이미지를 인가받아, 영상 인식을 통하여 텍스트로 변환하는 이미지 처리부; 상기 변환된 텍스트를 인가받아, 상기 약의 종류 및 복용 시간에 관 한 데이터를 자동으로 생성하는 제2 제어부; 및 상기 복용 시간이 되면 상기 생성된 데이터에 따라 사용자가 복 용할 약의 종류 및 약 봉지의 이미지를 디스플레이하는 제2 표시부; 를 포함하고, 상기 제2 제어부가 상기 디스 플레이 동작을 제어하는 동시에, 알람을 발생시켜 사용자가 상기 복용 시간에 약을 복용하도록 유도하는 것을 특징으로 한다. 상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템의 상기 관리 서버는 사용자의 약 복용 상태 및 사용자의 건강 정보를 바탕으로 기계학습하여 사용자의 내원이 필요한 시기를 판단하는 인공지능 처리부; 및 상기 사용자의 약 복용 상태 및 사용자의 건강 정보를 업데이트하여 저장하고, 상기 기계학습을 이용하여 주치 의의 처방에 참고할 자료를 저장하는 DB부; 를 포함하는 것을 특징으로 한다. 상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템의 상기 인공지능 처리부는 사용자의 내원이 필요한 시기로 판단된 경우, 상기 의료진 무선 단말기를 통해 주치의에게 알려 사용자의 내원을 유도하는 것을 특징으로 한다. 상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템은 사용자가 내원하여 진료를 받은 경우, 상 기 의료진 무선 단말기는, 사용자의 진료결과 데이터를 상기 사용자 무선 단말기로 전송하여 차후 처방에 대한 추천정보를 사용자에게 제공하는 것을 특징으로 한다. 상기 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 시스템의 상기 사용자 무선 단말기는, 휴대용 헬스 케어 기기와의 연동으로 사용자의 생체신호 및 운동량을 포함하는 상기 건강 정보를 상기 관리 서버에 제공하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법은 (a) 스마트 약통이 덮개부의 개폐 때 마다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신하는 단계; (b) 미리 등록된 사용자 무선 단말기가 약 처방전을 촬영하여 영상 인식을 통해 텍스트로 변환하고, 사용자가 복용할 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하여, 상기 복용 시간이 되면 복용할 약의 종류 및 약 봉지의 이미지를 디스플레이 및 알람하는 단계; (c) 사용자가 약을 복용한 경우에, 상기 스마트 약통이 사용자의 약 복용으로 인해 감소된 약통 의 무게를 측정하여, 상기 사용자 무선 단말기와 상기 무선 송수신하는 단계; (d) 상기 사용자 무선 단말기가 상기 감소된 약통의 무게를 바탕으로 약의 잔량을 확인하여, 사용자가 약을 복용하였는지 여부를 확인하는 단계; 및 (e) 상기 사용자 무선 단말기가 상기 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단된 경우, 의료진 무선 단말기에 원격으로 처방을 요청하는 단계; 를 포함하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법의 상기 (a) 단계는 무게 측정부가 상기 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하는 단계; 제1 제어부가 상기 측정된 약의 무게 데 이터를 인가받아, 상기 스마트 약통에 부여된 ID와 함께 미리 등록된 상기 사용자 무선 단말기와 상기 무선 송 수신하는 단계; 및 전원부가 외부 전원을 상기 제1 제어부를 통해 약 수납부의 각 구성요소들에 전달하는 단계;를 포함하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법의 상기 (b) 단계는 촬영부가 의료기관으 로부터 처방받은 상기 약 처방전을 촬영하는 단계; 이미지 처리부가 상기 촬영된 약 처방전의 이미지를 인가받 아, 영상 인식을 통하여 텍스트로 변환하는 단계; 제2 제어부가 상기 변환된 텍스트를 인가받아, 상기 약의 종 류 및 복용 시간에 관한 데이터를 자동으로 생성하는 단계; 상기 복용 시간이 되면 제2 표시부가 상기 생성된 데이터에 따라 상기 복용할 약의 종류 및 약 봉지의 이미지를 디스플레이하는 단계; 및 상기 제2 제어부가 상기 제2 표시부의 디스플레이 동작을 제어함과 동시에, 알람을 발생시켜 사용자가 상기 복용 시간에 약을 복용하도 록 유도하는 단계; 를 포함하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법은 사용자가 약을 복용한 경우에, 상기 무게 측정부가 사용자의 약 복용으로 인해 감소된 약통의 무게를 측정하여, 제1 통신부를 통해 상기 사용자 무 선 단말기에 전송하는 단계; 및 상기 제2 제어부가 상기 감소된 약통의 무게를 바탕으로 약의 잔량을 확인하고, 생성된 계획에 따라 사용자가 약을 복용하였는지 여부를 확인하는 단계; 를 포함하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법의 상기 제2 제어부는, 상기 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단된 경우, 약이 소진되기 전에 상기 의료진 무선 단말 기에 원격으로 처방을 요청하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법의 상기 무게 측정부는, 상기 측정된 약 통의 무게를 상기 제1 통신부를 통해 상기 의료진 무선 단말기에 전송하여 병원 전산 프로그램 DB와 연동하여 작동하도록 하는 것을 특징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법의 상기 이미지 처리부는 약 처방전에 기 재된 약 목록, 복용량, 복용 횟수, 복용 시간, 복용 일수 및 용법을 포함하는 이미지를 영상 인식하는 것을 특 징으로 한다. 상기 다른 목적을 달성하기 위한 본 발명의 약통의 원격 모니터링 방법의 상기 이미지 처리부는 상기 영상 인식 대신에, RFID, NFC 및 QR 코드 중 하나로 인식하여 상기 텍스트로 변환하는 것을 특징으로 한다. 기타 실시예의 구체적인 사항은 \""}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의할 경우, 다양한 처방약을 봉지에 담긴 상태로 하나의 통에 보관함으로써, 각각의 통에 나누어 수 납하는 경우에 발생하는 공간의 낭비를 줄일 수 있고, 약의 포장을 훼손하지 않고 보관하여 약의 변질 및 오염 을 방지할 수 있다. 또한, 처방전 영상인식을 바탕으로 자동으로 사용자에게 적절한 복약 계획을 생성하여 알려줌으로써, 사용자의 편의를 도모할 수 있다. 또한, 휴대용 헬스케어 기기 등을 통한 사용자의 건강상태를 비롯한 다양한 건강정보를 활용하여 적절한 시기에 내원을 유도함으로써, 불필요한 내원으로 인한 시간 및 노력의 낭비를 줄일 수 있게 된다. 또한, 사용자에게 처방전과 동일한 약물이 전달되고 적절하게 복용되고 있는지 원격으로 확인할 수 있어, 원격 의료를 함에 있어서 막기 어려운 처방된 약물의 오남용, 변경, 임의 조제 등을 원천적으로 예방할 수 있다."}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "\" 및 첨부 \"도면\"에 포함되어 있다. 본 발명의 이점 및/또는 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 각종 실시예를 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 각 실시예의 구성만으로 한정되는 것이 아니라 서로 다른 다양한 형태로 도 구현될 수도 있으며, 단지 본 명세서에서 개시한 각각의 실시예는 본 발명의 개시가 완전하도록 하며, 본 발 명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것 이며, 본 발명은 청구범위의 각 청구항의 범주에 의해 정의될 뿐임을 알아야 한다."}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "발명의 효과 본 발명에 의할 경우, 다양한 처방약을 봉지에 담긴 상태로 하나의 통에 보관함으로써, 각각의 통에 나누어 수 납하는 경우에 발생하는 공간의 낭비를 줄일 수 있고, 약의 포장을 훼손하지 않고 보관하여 약의 변질 및 오염 을 방지할 수 있다. 또한, 처방전 영상인식을 바탕으로 자동으로 사용자에게 적절한 복약 계획을 생성하여 알려줌으로써, 사용자의 편의를 도모할 수 있다. 또한, 휴대용 헬스케어 기기 등을 통한 사용자의 건강상태를 비롯한 다양한 건강정보를 활용하여 적절한 시기에 내원을 유도함으로써, 불필요한 내원으로 인한 시간 및 노력의 낭비를 줄일 수 있게 된다. 또한, 사용자에게 처방전과 동일한 약물이 전달되고 적절하게 복용되고 있는지 원격으로 확인할 수 있어, 원격 의료를 함에 있어서 막기 어려운 처방된 약물의 오남용, 변경, 임의 조제 등을 원천적으로 예방할 수 있다."}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "도면의 간단한 설명 도 1은 본 발명의 일 실시예에 따른 약통의 원격 모니터링 시스템의 개략적인 구성도이다. 도 2는 본 발명의 일 실시예에 따른 약통의 원격 모니터링 시스템의 블록도이다.도 3은 도 2에 도시된 약통의 약 수납부의 내부 블록도이다. 도 4는 도 2에 도시된 사용자 무선 단말기의 내부 블록도이다. 도 5는 본 발명의 일 실시예에 따른 약통의 원격 모니터링 방법의 전반적인 동작을 설명하기 위한 순서도이다. 도 6은 도 5에 도시된 약통의 원격 모니터링 방법 중 단계(S100)의 세부적인 동작을 설명하기 위한 순서도이다. 도 7은 도 5에 도시된 약통의 원격 모니터링 방법 중 단계(S200 내지 S300)의 세부적인 동작을 설명하기 위한 순서도이다."}
{"patent_id": "10-2021-0116483", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "발명을 실시하기 위한 구체적인 내용 이하, 첨부한 도면을 참고로 하여 본 발명의 바람직한 실시예에 대하여 상세히 설명하면 다음과 같다. 본 발명을 상세하게 설명하기 전에, 본 명세서에서 사용된 용어나 단어는 통상적이거나 사전적인 의미로 무조건 한정하여 해석되어서는 아니 되며, 본 발명의 발명자가 자신의 발명을 가장 최선의 방법으로 설명하기 위해서 각종 용어의 개념을 적절하게 정의하여 사용할 수 있다. 더 나아가 이들 용어나 단어는 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 함을 알아야 한 다. 즉, 본 명세서에서 사용된 용어는 본 발명의 바람직한 실시예를 설명하기 위해서 사용되는 것일 뿐이고, 본 발 명의 내용을 구체적으로 한정하려는 의도로 사용된 것이 아니다. 이들 용어는 본 발명의 여러 가지 가능성을 고려하여 정의된 용어임을 알아야 한다. 또한, 본 명세서에 있어서, 단수의 표현은 문맥상 명확하게 다른 의미로 지시하지 않는 이상, 복수의 표현을 포 함할 수 있다. 또한, 유사하게 복수로 표현되어 있다고 하더라도 단수의 의미를 포함할 수 있음을 알아야 한다. 본 명세서의 전체에 걸쳐서 어떤 구성 요소가 다른 구성 요소를 \"포함\"한다고 기재하는 경우에는, 특별히 반대 되는 의미의 기재가 없는 한 임의의 다른 구성 요소를 제외하는 것이 아니라 임의의 다른 구성 요소를 더 포함 할 수도 있다는 것을 의미할 수 있다. 더 나아가서, 어떤 구성 요소가 다른 구성 요소의 \"내부에 존재하거나, 연결되어 설치된다\"고 기재한 경우에는, 이 구성 요소가 다른 구성 요소와 직접적으로 연결되어 있거나 접촉하여 설치되어 있을 수 있다. 또한, 일정한 거리를 두고 이격되어 설치되어 있을 수도 있으며, 일정한 거리를 두고 이격되어 설치되어 있는 경우에 대해서는 해당 구성 요소를 다른 구성 요소에 고정 내지 연결시키기 위한 제 3의 구성 요소 또는 수단이 존재할 수 있다. 한편, 상기 제 3의 구성 요소 또는 수단에 대한 설명은 생략될 수도 있음을 알아야 한다. 반면에, 어떤 구성 요소가 다른 구성 요소에 \"직접 연결\"되어 있다거나, 또는 \"직접 접속\"되어 있다고 기재되는 경우에는, 제 3의 구성 요소 또는 수단이 존재하지 않는 것으로 이해하여야 한다. 마찬가지로, 각 구성 요소 간의 관계를 설명하는 다른 표현들, 즉 \" ~ 사이에\"와 \"바로 ~ 사이에\", 또는 \" ~ 에 이웃하는\"과 \" ~ 에 직접 이웃하는\" 등도 마찬가지의 취지를 가지고 있는 것으로 해석되어야 한다. 또한, 본 명세서에 있어서 \"일면\", \"타면\", \"일측\", \"타측\", \"제 1\", \"제 2\" 등의 용어는, 하나의 구성 요소에 대해서 이 하나의 구성 요소가 다른 구성 요소로부터 명확하게 구별될 수 있도록 하기 위해서 사용된다. 하지만, 이와 같은 용어에 의해서 해당 구성 요소의 의미가 제한적으로 사용되는 것은 아님을 알아야 한다. 또한, 본 명세서에서 \"상\", \"하\", \"좌\", \"우\" 등의 위치와 관련된 용어는, 사용된다면, 해당 구성 요소에 대해 서 해당 도면에서의 상대적인 위치를 나타내고 있는 것으로 이해하여야 한다. 또한, 이들의 위치에 대해서 절대적인 위치를 특정하지 않는 이상은, 이들 위치 관련 용어가 절대적인 위치를 언급하고 있는 것으로 이해하여서는 아니 된다. 더욱이, 본 발명의 명세서에서는, \"부\", \"기\", \"모듈\", \"장치\" 등의 용어는, 사용된다면, 하나 이상의 기능이나 동작을 처리할 수 있는 단위를 의미한다. 이는 하드웨어 또는 소프트웨어, 또는 하드웨어와 소프트웨어의 결합으로 구현될 수 있음을 알아야 한다. 본 명세서에 첨부된 도면에서 본 발명을 구성하는 각 구성 요소의 크기, 위치, 결합 관계 등은 본 발명의 사상 을 충분히 명확하게 전달할 수 있도록 하기 위해서 또는 설명의 편의를 위해서 일부 과장 또는 축소되거나 생략 되어 기술되어 있을 수 있고, 따라서 그 비례나 축척은 엄밀하지 않을 수 있다. 또한, 이하에서, 본 발명을 설명함에 있어서, 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 구성, 예 를 들어, 종래 기술을 포함하는 공지 기술에 대한 상세한 설명은 생략될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 약통의 원격 모니터링 시스템의 개략적인 구성도로서, 스마트 약통 및 사용자 무선 단말기를 포함하고, 스마트 약통은 덮개부, 약 주입부 및 약 수납부를 포함한다. 도 2는 본 발명의 일 실시예에 따른 약통의 원격 모니터링 시스템의 블록도로서, 스마트 약통, 사용자 무 선 단말기, 휴대용 헬스케어 기기, 의료진 무선 단말기 및 관리 서버를 포함하고, 관리 서 버는 인공지능 처리부 및 DB부를 포함한다. 도 3은 도 2에 도시된 약통의 약 수납부의 내부 블록도로서, 무게 측정부, 제1 제어부, 제1 표 시부, 제1 통신부 및 전원부를 포함한다. 도 4는 도 2에 도시된 사용자 무선 단말기의 내부 블록도로서, 촬영부, 이미지 처리부, 제2 제 어부, 제2 표시부 및 제2 통신부를 포함한다. 도 1 내지 도 4를 참조하여 본 발명의 일 실시예에 따른 약통의 원격 모니터링 방법을 구현하기 위한 시스템의 각 구성요소들의 기능을 개략적으로 설명하면 다음과 같다. 스마트 약통은 기 설정된 ID를 구비하고, 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신한다. 즉, 무게 측정부는 덮개부의 개폐 시 및 사용자의 약 복용으로 인해 감소된 약의 무게를 측정하고, 제1 제 어부는 무게 측정부로부터 측정된 약의 무게 데이터를 인가받아, 기 설정된 ID와 함께 미리 등록된 사용자 무선 단말기에 전송한다. 제1 표시부는 약품 별 무게정보 DB를 이용하여 무게 측정부에 서 측정된 약의 무게 데이터를 디스플레이하여 약품의 종류를 구분한다. 사용자 무선 단말기는 노트북, 태블릿 PC 또는 스마트폰 등의 형태로서, 약 처방전을 촬영하여 영상 인식 을 통해 텍스트로 변환하고, 사용자가 복용할 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성하여, 스 마트 약통과 무선 송수신한다. 즉, 촬영부는 의료기관으로부터 처방받은 약 처방전을 촬영하고, 이미지 처리부는 촬영부로부터 촬영된 약 처방전의 이미지를 인가받아, 영상 인식을 통하여 텍스트로 변환한다. 제2 제어부는 이미지 처 리부로부터 변환된 텍스트를 인가받아, 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성한다. 제2 표시부는 복용 시간이 되면 제2 제어부에서 생성된 데이터에 따라 사용자가 복용할 약의 종류 및 약 봉지의 이미지를 디스플레이한다. 이때, 제2 제어부는 제2 표시부의 디스플레이 동작을 제어하는 동시에, 알람을 발생시켜 사용자가 계획된 복용 시간에 약을 복용하도록 유도한다. 의료진 무선 단말기는 노트북, 태블릿 PC 또는 스마트폰 등의 형태로서, 사용자 무선 단말기가 약통 에 수납된 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단한 경우, 원격으로 처방을 요청받아 처방한다. 관리 서버는 약통에 수납된 약에 대해 식약처에 등록된 약물 정보를 제공하고, 이를 기초로 사용자 무선 단말기에서 확인된 약의 잔량을 통한 사용자의 약 복용 상태 및 사용자의 건강 정보를 예측 및 저장 한다. 즉, 인공지능 처리부는 사용자의 약 복용 상태 및 사용자의 건강 정보를 바탕으로 기계학습하여 사용자의 내원이 필요한 시기를 판단하고, DB부는 사용자의 약 복용 상태 및 사용자의 건강 정보를 업데이트하여 저 장하며, 인공지능 처리부의 기계학습을 이용하여 주치의의 처방에 참고할 자료를 저장한다.도 5는 본 발명의 일 실시예에 따른 약통의 원격 모니터링 방법의 전반적인 동작을 설명하기 위한 순서도이다. 도 1 내지 도 5를 참조하여 본 발명의 일 실시예에 따른 약통의 원격 모니터링 방법의 동작을 개략적으로 설명 하면 다음과 같다. 먼저, 스마트 약통이 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하여 무선 송수신한다 (S100). 즉, 무게 측정부가 덮개부의 개폐 때마다 실시간으로 수납된 약의 무게를 측정하고(S110), 제1 제어부 가 무게 측정부로부터 측정된 약의 무게 데이터를 인가받아, 스마트 약통에 부여된 ID와 함께 미리 등록된 사용자 무선 단말기와 무선 송수신하며(S120), 전원부가 외부 전원을 제1 제어부를 통해 약 수납부의 각 구성요소들에 전달한다(S130). 미리 등록된 사용자 무선 단말기가 약 처방전을 촬영하여 영상 인식을 통해 텍스트로 변환하고, 사용자가 복용할 약의 종류 및 복용 시간에 관한 데이터를 자동으로 생성한다(S200). 즉, 촬영부가 의료기관으로부터 처방받은 약 처방전을 촬영하고(S210), 이미지 처리부가 촬영부(21 0)로부터 촬영된 약 처방전의 이미지를 인가받아, 영상 인식을 통하여 텍스트로 변환하며(S220), 제2 제어부 가 이미지 처리부로부터 변환된 텍스트를 인가받아, 약의 종류 및 복용 시간에 관한 데이터를 자동으 로 생성한다(S230). 제2 표시부는 복용 시간이 되면 복용할 약의 종류 및 약 봉지의 이미지를 디스플레이 및 알람한다(S300). 즉, 미리 정해진 복용 시간이 되면 제2 표시부가 단계(S230)에서 생성된 데이터에 따라 사용자가 복용할 약의 종류 및 약 봉지의 이미지를 디스플레이하고(S310), 제2 제어부가 제2 표시부의 디스플레이 동 작을 제어함과 동시에, 알람을 발생시켜 사용자가 정해진 복용 시간에 약을 복용하도록 유도한다(S320). 사용자가 약을 복용한 경우에, 스마트 약통이 사용자의 약 복용으로 인해 감소된 약의 무게를 측정하여, 사용자 무선 단말기와 무선 송수신한다(S400). 사용자 무선 단말기가 단계(S230)에서 측정된 감소된 약의 무게를 바탕으로 약의 잔량을 확인하여, 사용자 가 약을 복용하였는지 여부를 확인한다(S500). 사용자 무선 단말기가 약의 잔량 확인 결과, 처방받은 약이 소진될 시점에 이르렀다고 판단된 경우, 의료 진 무선 단말기에 원격으로 처방을 요청한다(S600). 도 6은 도 5에 도시된 약통의 원격 모니터링 방법 중 단계(S100)의 세부적인 동작을 설명하기 위한 순서도이다. 도 7은 도 5에 도시된 약통의 원격 모니터링 방법 중 단계(S200 내지 S300)의 세부적인 동작을 설명하기 위한 순서도이다. 도 1 내지 도 7을 참조하여 본 발명의 일 실시예에 따른 약통의 원격 모니터링 방법의 유기적인 동작을 상세하 게 설명하면 다음과 같다. 본 발명의 일 실시예는 사용자의 수동 입력 또는 사용자 무선 단말기 내 촬영부를 통해 처방전의 정 보가 입력되면, 약통에 투입된 약의 종류 및 수량이 자동으로 계산되고, 사용자에게 기 결정된 투약시기를 알려주어 사용자가 적정한 시기에 적정한 분량의 약을 복용하도록 한다. 도 1에서 보는 바와 같이, 약은 포장을 해제하지 않은 채로 약 주입부를 통해 약 수납부로 투입되고, 약 수납부 내 무게 측정부는 수납된 약 전체의 무게를 측정할 수 있다. 무게 측정부는 덮개부가 열리고 닫힐 때마다 실시간으로 수납된 약의 무게를 측정한다. 제1 제어부는 무게 측정부에서 측정된 약의 무게 데이터를 인가받아, 약통 자체에 부여된 기 설 정된 ID와 함께 미리 등록(pairing)된 사용자 무선 단말기에 제1 통신부를 통해 전송한다. 이때, 약의 무게는 식약처에 등록된 약품 별 무게정보 DB를 이용하여 미세한 단위로 측정되어 제1 표시부 에 디스플레이됨으로써 약품의 종류가 구분된다. 제1 제어부는 전원부를 통해 인가되는 외부 전원을 약 수납부의 각 구성요소들에 전달한다. 이와 같이, 스마트 약통은 최소한의 구성요소들로 구성되어 전력소모가 적어 장시간 사용이 가능하다. 한편, 사용자 무선 단말기 내 촬영부는 병원 등 의료기관으로부터 처방받은 약 처방전을 촬영한다. 이미지 처리부는 촬영부로부터 약 처방전의 이미지를 인가받아, 약 처방전에 기재된 약 목록, 복용량, 복용 횟수, 복용 시간, 복용 일수 및 용법 등의 이미지를 영상 인식, RFID, NFC 또는 QR 코드 등으로 인식하여 텍스트로 변환한다. 제2 제어부는 이미지 처리부에서 변환된 텍스트를 인가받아, 복용약의 종류 및 복용 시간에 관한 데 이터를 자동으로 생성하여 제2 표시부에 디스플레이하는데, 복용 시간이 되면 생성된 데이터에 따라 복용 해야 할 약의 종류 및 약 봉지의 이미지를 디스플레이함과 동시에 알람을 발생시켜 사용자가 적정시간에 약을 복용하도록 유도한다. 사용자는 제2 표시부에 디스플레이된 복용약의 종류 및 복용 시간을 육안으로 확인한 후에, 적정한 시기에 적정한 분량의 약을 복용한다. 무게 측정부는 사용자의 약 복용으로 인해 감소된 약통의 무게를 측정하여 제1 통신부를 통해 사용자 무선 단말기에 전송한다. 또는, 무게 측정부를 통해 측정된 감소된 약통의 무게를 제1 통신부를 통해 의료진 무선 단말기 에 전송하여 병원 전산 프로그램 DB와 연동하여 작동하도록 한다. 사용자 무선 단말기 내 제2 제어부는 무게 측정부로부터 전송받은 감소된 약통의 무게를 바탕으로 약의 잔량을 확인하고, 생성된 계획에 따라 사용자가 약을 복용하였는지 여부를 확인한다. 또한, 제2 제어부가 감소된 약통의 무게를 바탕으로 약의 잔량을 확인한 결과, 처방받은 약이 거의 소진될 시점에 이르렀다고 판단된 경우, 약이 완전히 소진되기 전에 의료진 무선 단말기에 원격으로 처방 을 요청함으로써, 사용자의 불필요한 내원으로 인한 시간과 노력의 낭비를 줄일 수 있게 한다. 한편, 사용자 무선 단말기는 스마트 워치와 같은 휴대용 헬스케어 기기 등과의 연동으로 사용자의 생 체신호, 운동량 등의 건강 정보를 관리 서버에 함께 제공한다. 관리 서버 내 인공지능 처리부에서는 사용자의 약 복용 상태 및 사용자의 건강 정보를 바탕으로 기계 학습하여 사용자의 내원이 필요한 시기를 판단하고, 내원이 필요한 시기로 판단된 경우, 의료진 무선 단말기 를 통해 주치의에게 알려 사용자의 내원을 유도한다. 또한, 사용자가 내원하여 진료를 받은 경우, 의료진 무선 단말기는 사용자의 진료결과 데이터를 사용자 무 선 단말기로 전송하여 차후 처방에 대한 추천정보를 사용자에게 제공함과 동시에, 관리서버에 전송하여 인 공지능 처리부를 통한 기계학습을 이용하여 주치의의 처방에 참고할 자료를 제공한다. 이와 같이, 본 발명은 약을 포장된 상태대로 보관 가능하고, 사용자의 수동 입력 또는 처방전의 영상 인식 및 약통 내부의 무게를 기반으로, 보관된 약의 종류 및 분량을 계산하여 잔량을 정확하게 확인함으로써, 사용자에 게 복용 시기를 자동으로 알려줄 수 있는 약통의 원격 모니터링 시스템 및 방법을 제공한다. 또한, 사용자의 복용 상황 및 건강상태를 원격으로 모니터링하여, 처방된 약이 완전히 소진되기 전에 원격처방 요청이 가능하도록 함으로써, 사용자의 적절한 내원을 유도하고, 인공지능의 기계학습을 이용하여 추후 처방에 참고할 자료를 제공할 수 있는 약통의 원격 모니터링 시스템 및 방법을 제공한다. 이를 통하여, 본 발명은 다양한 처방약을 봉지에 담긴 상태로 하나의 통에 보관함으로써, 각각의 통에 나누어 수납하는 경우에 발생하는 공간의 낭비를 줄일 수 있고, 약의 포장을 훼손하지 않고 보관하여 약의 변질 및 오 염을 방지할 수 있다. 또한, 처방전 영상인식을 바탕으로 자동으로 사용자에게 적절한 복약 계획을 생성하여 알려줌으로써, 사용자의 편의를 도모할 수 있다. 또한, 휴대용 헬스케어 기기 등을 통한 사용자의 건강상태를 비롯한 다양한 건강정보를 활용하여 적절한 시기에 내원을 유도함으로써, 불필요한 내원으로 인한 시간 및 노력의 낭비를 줄일 수 있게 된다. 이상, 일부 예를 들어서 본 발명의 바람직한 여러 가지 실시예에 대해서 설명하였지만, 본 \"발명을 실시하기 위 한 구체적인 내용\" 항목에 기재된 여러 가지 다양한 실시예에 관한 설명은 예시적인 것에 불과한 것이며, 본 발 명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 이상의 설명으로부터 본 발명을 다양하게 변형하여 실시 하거나 본 발명과 균등한 실시를 행할 수 있다는 점을 잘 이해하고 있을 것이다.또한, 본 발명은 다른 다양한 형태로 구현될 수 있기 때문에 본 발명은 상술한 설명에 의해서 한정되는 것이 아 니며, 이상의 설명은 본 발명의 개시 내용이 완전해지도록 하기 위한 것으로 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것일 뿐이며, 본 발명은 청구범 위의 각 청구항에 의해서 정의될 뿐임을 알아야 한다."}
{"patent_id": "10-2021-0116483", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 약통의 원격 모니터링 시스템의 개략적인 구성도이다. 도 2는 본 발명의 일 실시예에 따른 약통의 원격 모니터링 시스템의 블록도이다.도 3은 도 2에 도시된 약통의 약 수납부의 내부 블록도이다. 도 4는 도 2에 도시된 사용자 무선 단말기의 내부 블록도이다. 도 5는 본 발명의 일 실시예에 따른 약통의 원격 모니터링 방법의 전반적인 동작을 설명하기 위한 순서도이다. 도 6은 도 5에 도시된 약통의 원격 모니터링 방법 중 단계(S100)의 세부적인 동작을 설명하기 위한 순서도이다. 도 7은 도 5에 도시된 약통의 원격 모니터링 방법 중 단계(S200 내지 S300)의 세부적인 동작을 설명하기 위한 순서도이다."}
