{"patent_id": "10-2019-0039267", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0117317", "출원번호": "10-2019-0039267", "발명의 명칭": "대화 시스템 및 대화 처리 방법", "출원인": "현대자동차주식회사", "발명자": "김선아"}}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "액션에 관한 정보를 저장하는 저장부;사용자의 발화를 수신하고, 상기 사용자의 발화로부터 사용자 규칙에 관한 액션을 추출하는 입력 처리기;상기 입력 처리기가 전달하는 상기 액션이 적용 가능한 것인지 여부를 판단하고, 상기 액션에 포함된 인자를 분석하고, 상기 분석 결과를 기초로 상기 저장부의 업데이트를 결정하는 규칙 판단기; 및상기 규칙 판단기의 결정에 기초하여 상기 저장부를 업데이트하는 규칙 관리기;를 포함하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 규칙 판단기는,상기 저장부에 미리 저장된 그라운드 규칙과 상기 사용자 규칙이 충돌하는지 여부를 판단하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 규칙 판단기는,상기 저장부에 포함된 상황 정보 또는 대화 정책 중 적어도 하나에 기초하여 상기 사용자 규칙이 적용 가능한지여부를 판단하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 규칙 판단기는,상기 충돌 여부에 대한 판단 결과 및 상기 적용 가능 여부에 대한 판단 결과에 기초하여, 상기 저장부의 업데이트를 결정하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 규칙 관리기는,상기 액션 또는 상기 인자를 상기 저장부에 추가하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 규칙 관리기는,상기 저장부에 미리 저장된 정보를 상기 액션 또는 상기 인자로 변경하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 규칙 관리기는,대화 정책에 기초하여 상기 인자와 관련된 연관어 또는 반의어를 상기 저장부에 등록하는 대화 시스템.공개특허 10-2020-0117317-3-청구항 8 제 1항에 있어서,상기 규칙 판단기는,상기 액션이 상기 저장부에 저장된 다른 액션에도 적용할 수 있는지 여부를 판단하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,상기 규칙 관리기는,상기 규칙 판단기의 결정에 기초하여 상기 사용자 규칙과 관련된 서비스를 위한 명령어를 추가하는 대화시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서,상기 액션이 적용 가능한 것인지 여부에 대한 판단 결과에 기초하여 상기 사용자의 발화에 대한 응답을 생성하는 응답 생성 관리기;를 더 포함하는 대화 시스템."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "액션에 관한 정보를 저장하고;사용자의 발화를 수신한 후, 상기 사용자의 발화로부터 사용자 규칙에 관한 액션을 추출하고;상기 입력 처리기가 전달하는 상기 액션이 적용 가능한 것인지 여부를 판단하고;상기 액션에 포함된 인자를 분석한 후, 상기 분석 결과를 기초로 저장부의 업데이트를 결정하고; 및상기 결정에 기초하여 상기 액션에 관한 정보를 관리하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 판단하는 것은,미리 저장된 그라운드 규칙과 상기 사용자 규칙이 충돌하는지 여부를 판단하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12항에 있어서,상기 판단하는 것은,상황 정보 또는 대화 정책 중 적어도 하나에 기초하여 상기 사용자 규칙이 적용 가능한지 여부를 판단하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 결정하는 것은,상기 충돌 여부에 대한 판단 결과 및 상기 적용 가능 여부에 대한 판단 결과에 기초하여, 상기 저장부의 업데이트를 결정하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 11항에 있어서,공개특허 10-2020-0117317-4-상기 관리하는 것은,상기 액션 또는 상기 인자를 상기 저장부에 추가하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 11항에 있어서,상기 관리하는 것은,상기 저장부에 미리 저장된 정보를 상기 액션 또는 상기 인자로 변경하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 11항에 있어서,상기 관리하는 것은,대화 정책에 기초하여 상기 인자와 관련된 연관어 또는 반의어를 상기 저장부에 등록하는 것;을 포함하는 대화처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 11항에 있어서,상기 결정하는 것은,상기 액션이 상기 저장부에 저장된 다른 액션에도 적용할 수 있는지 여부를 판단하는 것;을 포함하는 대화 처리방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 11항에 있어서,상기 관리하는 것은,상기 사용자 규칙과 관련된 서비스를 위한 명령어를 추가하는 것;을 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 11항에 있어서,상기 액션이 적용 가능한 것인지 여부에 대한 판단 결과에 기초하여 상기 사용자의 발화에 대한 응답을 생성하는 것;을 더 포함하는 대화 처리 방법."}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 일 실시예에 따른 대화 시스템은, 액션에 관한 정보를 저장하는 저장부; 사용자의 발화를 수신하고, 상기 사용자의 발화로부터 사용자 규칙에 관한 액션을 추출하는 입력 처리기; 상기 입력 처리기가 전달하는 상기 액션 이 적용 가능한 것인지 여부를 판단하고, 상기 액션에 포함된 인자를 분석하고, 상기 분석 결과를 기초로 상기 저장부의 업데이트를 결정하는 규칙 판단기; 및 상기 규칙 판단기의 결정에 기초하여 상기 저장부를 업데이트하 는 규칙 관리기;를 포함한다."}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시된 발명은 사용자와의 대화를 통해 사용자의 의도를 파악하고 사용자에게 필요한 정보나 서비스를 제공하는 대화 시스템, 및 대화 처리 방법에 관한 것이다."}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "차량용 AVN이나 대부분의 모바일 기기는 작은 화면 및 작은 버튼으로 인해, 사용자에게 시각적인 정보를 제공하 거나 사용자의 입력을 수신함에 있어 불편함이 발생할 수 있다. 특히, 사용자가 운전 중 시각적인 정보를 확인 하거나 기기를 조작하기 위해, 시선을 이동시키고 스티어링 휠에서 손을 떼는 것은 안전 운전에 위협이 되는 요 소로 작용한다. 따라서, 사용자와의 대화를 통해 사용자의 의도를 파악하고, 사용자에게 필요한 서비스를 제공하는 대화 시스템 이 차량에 적용될 경우 보다 안전하고 편리하게 서비스를 제공할 수 있을 것으로 기대된다. 한편, 기존의 대화 시스템에서는 정해진 어휘 이외에 사용자가 직접 어휘를 추가하거나 변경하기 어려웠다. 또 한, 사용자가 직접 어휘를 추가하거나 변경하는 기능은 기존 시스템과 충돌을 발생시킬 수 있었다. (특허문헌 1) KR2013-0035983 A"}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "미리 설정된 대화 패턴에 따라 대화를 수행하는 것을 넘어서, 사용자가 스스로 대화 시스템에 자신의 기호와 취 향에 맞는 어휘를 등록하고, 미리 저장된 대화 패턴을 변경시킴으로써, 사용자에게 확장된 기능을 제공하는 대 화 시스템 및 대화 처리 방법을 제공한다."}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "개시된 일 실시예에 따른 대화 시스템은, 액션에 관한 정보를 저장하는 저장부; 사용자의 발화를 수신하고, 상 기 사용자의 발화로부터 사용자 규칙에 관한 액션을 추출하는 입력 처리기; 상기 입력 처리기가 전달하는 상기 액션이 적용 가능한 것인지 여부를 판단하고, 상기 액션에 포함된 인자를 분석하고, 상기 분석 결과를 기초로 상기 저장부의 업데이트를 결정하는 규칙 판단기; 및 상기 규칙 판단기의 결정에 기초하여 상기 저장부를 업데 이트하는 규칙 관리기;를 포함한다. 상기 규칙 판단기는, 상기 저장부에 미리 저장된 그라운드 규칙과 상기 사용자 규칙이 충돌하는지 여부를 판단 할 수 있다. 상기 규칙 판단기는, 상기 저장부에 포함된 상황 정보 또는 대화 정책 중 적어도 하나에 기초하여 상기 사용자 규칙이 적용 가능한지 여부를 판단할 수 있다. 상기 규칙 판단기는, 상기 충돌 여부에 대한 판단 결과 및 상기 적용 가능 여부에 대한 판단 결과에 기초하여, 상기 저장부의 업데이트를 결정할 수 있다. 상기 규칙 관리기는, 상기 액션 또는 상기 인자를 상기 저장부에 추가할 수 있다. 상기 규칙 관리기는, 상기 저장부에 미리 저장된 정보를 상기 액션 또는 상기 인자로 변경할 수 있다. 상기 규칙 관리기는, 대화 정책에 기초하여 상기 인자와 관련된 연관어 또는 반의어를 상기 저장부에 등록할 수 있다. 상기 규칙 판단기는, 상기 액션이 상기 저장부에 저장된 다른 액션에도 적용할 수 있는지 여부를 판단할 수 있 다. 상기 규칙 관리기는, 상기 규칙 판단기의 결정에 기초하여 상기 사용자 규칙과 관련된 서비스를 위한 명령어를 추가할 수 있다. 상기 액션이 적용 가능한 것인지 여부에 대한 판단 결과에 기초하여 상기 사용자의 발화에 대한 응답을 생성하 는 응답 생성 관리기;를 더 포함할 수 있다. 개시된 다른 실시예에 따른 대화 처리 방법은 액션에 관한 정보를 저장하고; 사용자의 발화를 수신한 후, 상기 사용자의 발화로부터 사용자 규칙에 관한 액션을 추출하고; 상기 입력 처리기가 전달하는 상기 액션이 적용 가 능한 것인지 여부를 판단하고; 상기 액션에 포함된 인자를 분석한 후, 상기 분석 결과를 기초로 저장부의 업데 이트를 결정하고; 및 상기 결정에 기초하여 상기 액션에 관한 정보를 관리하는 것;을 포함한다. 상기 판단하는 것은, 미리 저장된 그라운드 규칙과 상기 사용자 규칙이 충돌하는지 여부를 판단하는 것;을 포함 할 수 있다. 상기 판단하는 것은, 상황 정보 또는 대화 정책 중 적어도 하나에 기초하여 상기 사용자 규칙이 적용 가능한지 여부를 판단하는 것;을 포함할 수 있다. 상기 결정하는 것은, 상기 충돌 여부에 대한 판단 결과 및 상기 적용 가능 여부에 대한 판단 결과에 기초하여, 상기 저장부의 업데이트를 결정하는 것;을 포함할 수 있다. 상기 관리하는 것은, 상기 액션 또는 상기 인자를 상기 저장부에 추가하는 것;을 포함할 수 있다. 상기 관리하는 것은, 상기 저장부에 미리 저장된 정보를 상기 액션 또는 상기 인자로 변경하는 것;을 포함할 수 있다. 상기 관리하는 것은, 대화 정책에 기초하여 상기 인자와 관련된 연관어 또는 반의어를 상기 저장부에 등록하는 것;을 포함할 수 있다. 상기 결정하는 것은, 상기 액션이 상기 저장부에 저장된 다른 액션에도 적용할 수 있는지 여부를 판단하는 것; 을 포함할 수 있다. 상기 관리하는 것은, 상기 사용자 규칙과 관련된 서비스를 위한 명령어를 추가하는 것;을 포함할 수 있다. 상기 액션이 적용 가능한 것인지 여부에 대한 판단 결과에 기초하여 상기 사용자의 발화에 대한 응답을 생성하 는 것;을 더 포함할 수 있다."}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 일 측면에 따른 대화 시스템 및 대화 처리 방법은 미리 설정된 대화 패턴에 따라 대화를 수행하는 것을 넘어서, 사용자가 스스로 대화 시스템에 자신의 기호와 취향에 맞는 어휘를 등록하고, 미리 저장된 대화 패턴을 변경시킴으로써, 사용자에게 확장된 기능을 제공할 수 있다. 또 다른 측면에 따른 대화 시스템 및 대화 처리 방법은 사용자의 만족도를 증가시킴으로써, 서비스의 충성심을 향상시키고, 사용자의 편의성을 제공할 수 있다."}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 명세서가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2019-0039267", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부, 모듈, 부재, 블록'이라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시예들에 따라 복수의 '부, 모듈, 부재, 블록'이 하나의 구성요소로 구현되거나, 하나의 '부, 모듈, 부재, 블 록'이 복수의 구성요소들을 포함하는 것도 가능하다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 직접적으로 연결되어 있는 경우뿐 아니라, 간접적으로 연결되어 있는 경우를 포함하고, 간접적인 연결은 무선 통신망을 통해 연결되는 것을 포함 한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 단수의 표현은 문맥상 명백하게 예외가 있지 않는 한, 복수의 표현을 포함한다. 각 단계들에 붙여지는 부호는 각 단계들을 식별하기 위해 사용되는 것으로 이들 부호는 각 단계들 상호 간의 순 서를 나타내는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순서와 다르 게 실시될 수 있다. 이하 첨부된 도면들을 참고하여 대화 시스템, 이를 포함하는 차량 및 대화 처리 방법의 실시예를 상세하게 설명 한다. 일 실시예에 따른 대화 시스템은 사용자의 음성 및 음성 외 입력을 이용하여 사용자의 의도를 파악하고 사용자 의 의도에 적합한 서비스 또는 사용자에게 필요한 서비스를 제공하는 장치이다. 또한, 대화 시스템은 서비스 제 공의 일 수단 또는 사용자의 의도를 명확히 파악하기 위한 일 수단으로, 시스템 발화를 출력함으로써 사용자와 대화를 수행할 수 있다. 당해 실시예에서 사용자에게 제공되는 서비스는 정보의 제공, 차량의 제어, 오디오/비디오/내비게이션 기능의 실행, 외부 서버로부터 가져온 컨텐츠의 제공 등 사용자의 필요나 사용자의 의도에 부응하기 위해 수행되는 모 든 동작을 포함할 수 있다. 또한, 일 실시예에 따른 대화 시스템은 차량 환경에 특화된 대화 처리 기술을 제공함으로써, 차량이라는 특수한 환경에서 사용자의 의도를 정확히 파악할 수 있다. 이러한 대화 시스템과 사용자를 연결하는 게이트 웨이는 차량 또는 차량에 연결된 모바일 기기가 될 수 있다. 후술하는 바와 같이, 대화 시스템은 차량에 마련될 수도 있고, 차량 외부의 원격 서버에 마련되어 차량 또는 차 량에 연결된 모바일 기기와의 통신을 통해 데이터를 주고 받을 수도 있다. 또한, 대화 시스템의 구성 요소 중 일부는 차량에 마련되고 일부는 원격 서버에 마련되어 대화 시스템의 동작을 차량과 원격 서버에서 부분적으로 수행하는 것도 가능하다. 도 1은 일 실시예에 따른 대화 시스템의 제어 블록도이다. 도 1을 참조하면, 일 실시예에 따른 대화 시스템은 사용자의 음성 및 음성 외 입력을 포함하는 사용자 입 력이나 차량과 관련된 정보 또는 사용자와 관련된 정보를 포함하는 입력을 처리하는 입력 처리기, 입력 처 리기의 처리 결과를 이용하여 사용자의 의도를 파악하여, 사용자가 생성 또는 변경시키고자 하는 새로운 규칙을 적용할 수 있는지 여부를 판단하는 규칙 판단기 및 규칙 판단기의 출력 결과에 따라 새롭게 적용할 사용자 규칙을 생성하고, 생성된 사용자 규칙을 적용하도록 시스템을 업데이트하는 규칙 관리기 및 대화 시스템이 후술하는 동작을 수행하기 위해 필요한 각종 정보를 저장하는 저장부를 포함한다. 당해 실시예에서 사용자 규칙(user rule)이란, 대화 시스템의 제작 당시 미리 저장된 규칙(이하 그라운드 규칙, ground rule)) 이외에 새롭게 사용자가 생성하고자 하는 규칙으로, 액션(action)의 일 예이다. 액션이란 대화 시스템이 사용자에게 제공할 수 있는 모든 동작으로써, 사용자의 의도를 파악한 후 수행될 수 있다. 액션의 종류는 미리 정의될 수 있다. 따라서 사용자 규칙은 사용자에게 시스템이 설정된 대화 패턴을 변경할 수 있는 서비스 그 자체를 의미한다. 액션에 관한 구체적인 설명은 이하 다른 도면을 통해 후술한다. 입력 처리기는 사용자 음성과 음성 외 입력, 두 가지 종류의 입력을 수신할 수 있다. 음성 외 입력은 사용 자의 제스처 인식이나, 입력 장치의 조작을 통해 입력되는 사용자의 음성 외 입력, 차량의 상태를 나타내는 차 량 상태 정보, 차량의 주행 환경과 관련된 주행 환경 정보, 사용자의 상태를 나타내는 사용자 정보 등을 포함할 수 있다. 이하에서는 입력 처리기가 사용자의 명시적인 음성 입력을 수신한 후, 사용자 규칙을 생성 또는 변경하는 방법에 관해서 설명하지만, 개시된 실시예가 반드시 사용자의 음성에 인한 명시적인 입력에만 한정되는 것은 아 니다. 입력 처리기는 입력된 사용자 음성을 인식하여 텍스트 형태의 발화문으로 변환하고, 사용자의 발화문에 자 연어 이해(Natural Language Understanding) 알고리즘을 적용하여 사용자의 의도를 파악한다. 개시된 실시예에 서 입력 처리기는 자연어 이해를 통해 사용자 규칙이라는 사용자의 의도를 파악한 후, 사용자의 음성 입력 및 사용자 규칙에 관한 구체적인 정보를 규칙 판단기로 전달한다. 규칙 판단기는 입력 처리기로부터 전달된 사용자의 의도, 즉 사용자 규칙을 수신하고, 그라운드 규칙 과 충돌이 일어날 수 있는지 여부를 판단한다. 또한, 규칙 판단기는 사용자가 입력한 조건 및 결과가 대화 시스템이 수행할 수 있는 조건인지 여부도 함께 판단한다. 사용자 규칙의 생성 또는 변경이 가능하다고 판단하면, 규칙 판단기는 규칙 관리기로 사용자 규칙에 관한 새로운 업데이트를 요청한다. 규칙 관리기는 대화 시스템이 처리하는 결과 처리기의 일 예다. 결과 처리기는 대화 시스템이 현재 진행 중인 대화를 수행하기 위해 필요한 대화 응답 및 명령어를 생성하 여 출력한다. 대화 응답은 텍스트, 이미지 또는 오디오로 출력될 수 있고, 명령어가 출력되면 출력된 명령어에 대응되는 차량 제어, 외부 컨텐츠 제공 등의 서비스가 수행될 수 있다. 규칙 판단기로부터 사용자 규칙이라는 액션이 실행 가능하다는 판단 결과가 전달되면, 규칙 관리기는 저장부에 조건 인자, 결과 인자 및 기타 인자를 저장하고, 필요에 따라 응답 생성, 서비스 편집, 명령어 생성, 외부 서비스 변경과 같은 서비스를 업데이트한다. 저장부는 전술한 동작에 필요한 각종 정보를 저장한다. 예를 들어, 저장부는 도메인/액션의 추론을 위해 필요한 정보를 저장할 수 있고, 사용자 규칙이 적용될 수 있는지 여부에 관한 판단에 필요한 상황 정보를 저장할 수 있으며, 적용 가능한 사용자 규칙에 관한 정보를 장기적으로 저장하기 위한 저장 공간을 제공한다. 저장부는 도메인/액션 추론 규칙 DB, 상황 정보 DB, 장기 메모리, 단기 메모리, 대 화 정책 DB, 응답 템플릿 및 외부 서비스 집합 DB으로 구분될 수 있으며, 대화 시스템이 수행하는 동작에 필요로 하는 정보를 저장한다. 저장부가 저장하는 다양한 정보에 관한 구체적인 설명은 이하의 다른 도면을 통해 후술한다. 도 2는 차량 내부의 구성을 나타낸 도면이다. 도 2를 참조하면, 차량은 내부에 마련된 대시보드, 대시보드의 중앙 영역인 센터페시아를 포함한다. 센터페이사는 오디오 기능, 비디오 기능, 내비게이션 기능 또는 전화 걸기 기능을 포함하는 차량의 제어를 수행하기 위해 필요한 화면을 표시하는 디스플레이와 사용자의 제어 명령을 입력 받기 위한 입력 버튼 이 마련될 수 있다. 운전자의 조작 편의성을 위해 마련된 스티어링 휠에도 입력 버튼이 마련될 수 있고, 운전석(254a)과 조수석(254b) 사이의 센터 콘솔 영역에 입력 버튼의 역할을 수행하는 조그 셔틀이 마련될 수도 있다. 디스플레이, 입력 버튼 및 각종 기능을 전반적으로 제어하는 프로세서를 포함하는 모듈을 AVN(Audio Video Navigation) 단말이라 할 수도 있고, 헤드유닛(Head Unit)이라 할 수도 있다. 디스플레이는 LCD(Liquid Crystal Display), LED(Light Emitting Diode), PDP(Plasma Display Panel), OLED(Organic Light Emitting Diode), CRT(Cathode Ray Tube) 등의 다양한 디스플레이 장치 중 하나로 구현될 수 있다. 입력 버튼은 도 2에 도시된 바와 같이 디스플레이와 인접한 영역에 하드 키 타입으로 마련될 수도 있 고, 디스플레이가 터치 스크린 타입으로 구현되는 경우에는 디스플레이가 입력 버튼의 기능도 함께 수행할 수 있다. 차량은 사용자의 명령을 음성 입력 장치를 통해 음성으로 입력 받을 수 있다. 음성 입력 장치는 음향을 입력 받아 전기적인 신호로 변환하여 출력하는 마이크로폰을 포함할 수 있다. 효과적인 음성의 입력을 위하여 음성 입력 장치는 도 2에 도시된 바와 같이 헤드라이닝에 마련될 수 있으나, 차량의 실시예가 이에 한정되는 것은 아니며, 대시보드 위에 마련되거나 스티어링 휠에 마련되는 것도 가능하다. 이 외에도 사용자의 음성을 입력 받기에 적합한 위치이면 어디든 제한이 없다. 차량 내부에는 사용자와 대화를 수행하거나, 사용자가 원하는 서비스를 제공하기 위해 필요한 음향을 출력 하는 스피커가 마련될 수 있다. 일 예로, 스피커는 운전석 도어(253a) 및 조수석 도어(253b) 내측에 마련될 수 있다. 스피커는 내비게이션 경로 안내를 위한 음성, 오디오/비디오 컨텐츠에 포함되는 음향 또는 음성, 사용자가 원하는 정보나 서비스를 제공하기 위한 음성, 사용자의 발화에 대한 응답으로서 생성된 시스템 발화 등을 출력 할 수 있다. 개시된 실시예에 따른 대화 시스템은 전술한 차량에 특화된 대화 처리 기술을 이용하여 사용자의 라 이프스타일에 최적화된 서비스를 제공하고, 커넥티드카(Connected Car), 사물인터넷(IoT), 인공지능(AI) 등의 기술을 이용한 새로운 서비스를 구현할 수 있다. 대화 시스템이 차량 환경에 특화되어 적용될 경우, 대화 시스템은 차량의 주행 상황에서, 주요 상황(Context)에 대한 인지 및 대응이 용이하다. 대화 시스템은 유량 부족, 졸음 운전 등 주행에 영향을 미치는 요소에 가중치를 부여하여 서비스를 제공할 수 있고, 대부분의 경우 목적지로 이동 중인 조건을 기반으 로 주행 시간, 목적지 정보 등 서비스 제공을 위해 필요한 정보를 용이하게 획득할 수 있다. 또한, 대화 시스템은 운전자의 의도를 파악하고, 기능을 제안하는 지능적인 서비스를 용이하게 구현할 수 있다. 이는 운전자의 직접 주행 상황에 있어 실시간 정보와 액션을 우선적으로 고려하기 때문이다. 일 예로, 주 행 중에 운전자가 주유소라는 단어를 발화하는 경우, 가까운 주요소를 검색하라는 새로운 규칙을 생성할 수 있 다. 대화 시스템은 다음 주행 중에서 운전자의 주유소라는 발화만으로도, 가까운 주유소를 검색함으로써, 사용자의 취향에 맞는 서비스를 제공할 수 있다. 또한, 차량은 한정적인 공간이지만, 그 안에 다양한 상황이 존재할 수 있다. 예를 들어, 렌터카 등 생소한 인터 페이스의 운전 상황, 대리 운전을 맡긴 상황, 세차 등 차량 관리 상황, 유아를 탑승시키는 상황, 특정 목적지를 찾아가는 상황 등에서 대화 시스템은 활용될 수 있다. 도 3은 대화 시스템과 운전자 사이에 주고 받을 수 있는 대화의 예시를 나타낸 도면이다. 도 3을 참조하면, 운전자는 개시된 대화 시스템에서 자신의 기호나 취향에 맞는 사용자 규칙을 생성 또는 변경하도록 요청할 수 있다. 대화 시스템은 운전자의 요청에 응답하는 발화를 스피커를 통해 출력할 수 있다. 구체적으로 운전자는 미리 정해진 그라운드 규칙의 변경을 요청하는 발화(U1: 다음에 에어컨을 켜 달라고 하면, 온도를 17도로 설정해 줘)를 입력할 수 있다. 대화 시스템은 운전자의 새로운 요청이 적용 가능한지 여부 를 판단한 후, 운전자의 요청을 수용하였다는 발화(S1: 알겠습니다)를 출력할 수 있다. 시간이 흐른 뒤, 운전자는 대화 시스템에게 이전에 적용한 사용자 규칙의 조건에 해당하는 발화(U1: 에어 컨을 켜줘)를 입력할 수 있고, 대화 시스템은 저장된 사용자 규칙에 따라 온도를 17도로 조절하는 서비스 에 관한 정보를 제공하는 발화(S2: 예 에어컨의 온도를 17도로 조정합니다)를 출력할 수 있다. 즉, 대화 시스템은 입력 처리기를 통해 사용자가 설정한 새로운 규칙을 적용하고, 업데이트를 수행할 수 있다. 또한, 다음 대화에서 대화 시스템은 적용된 규칙을 통해 사용자와 대화를 수행할 수 있다. 도 4는 도 1에서 도시된 입력 처리기의 구성을 세분화한 제어 블록도이고, 도 5는 저장부의 일 예에 해당하는 도메인/액션 추론 규칙 DB(데이터베이스)를 설명하기 위한 도면이다. 도 4를 먼저 참조하면, 입력 처리기는 음성 입력을 처리하는 음성 입력 처리기 및 상황 정보를 처리 하는 상황 정보 처리기를 포함할 수 있다. 음성 입력 장치를 통해 입력된 음성은 음성 입력 처리기로 전송되고, 음성 외 입력 장치(미도시)를 통해 입력된 음성 외 사용자 입력은 상황 정보 처리기로 전송된다. 음성 외 입력은 모두 상황 정보에 포함 될 수 있다. 즉, 상황 정보는 차량 상태 정보, 주행 환경 정보, 사용자 정보를 포함할 수 있다. 차량 상태 정보는 차량에 마련된 센서에 의해 획득된 정보로서 차량의 상태를 나타내는 정보를 포함할 수 도 있고, 차량의 유종과 같이 차량에 관련된 정보로서 차량에 저장되어 있는 정보 등을 포함할 수도 있다. 주행 환경 정보는 차량에 마련된 센서에 의해 획득된 정보로서 전방 카메라, 후방 카메라 또는 스테레오 카메라가 획득한 영상 정보, 레이더(radar), 라이다(Lidar), 초음파 센서 등의 센서가 획득한 장애물 정보, 강 우 센서가 획득한 강우량/강우속도 정보 등을 포함할 수 있다. 또한, 주행 환경 정보는 V2X를 통해 획득된 정보로서 교통 상황 정보, 신호등 정보, 주변 차량의 접근 또는 추 돌 가능성 정보 등을 더 포함할 수 있다. 사용자 정보는 차량에 마련된 카메라 또는 생체 신호 측정 장치를 통해 측정한 사용자의 상태와 관련된 정보, 사용자가 차량에 마련된 입력 장치를 이용하여 직접 입력한 사용자와 관련된 정보, 외부 컨텐츠 서버(미도시)에 저장된 사용자와 관련된 정보, 차량에 연결된 모바일 기기(미도시)에 저장된 정보 등을 포함할 수 있다. 음성 입력 처리기는 입력된 사용자 음성을 인식하여 텍스트 형태의 발화문으로 출력하는 음성 인식기 (111a), 발화문에 대해 자연어 이해 기술(Natural Language Understanding)을 적용하여 발화문이 내포하는 사 용자의 의도를 파악하는 자연어 이해기(111b) 및 자연어 이해 결과와 상황 정보를 규칙 관리기로 전달하는 대화 입력 관리기(111c)를 포함할 수 있다.음성 인식기(111a)는 음성 인식 엔진(speech recognition engine)을 포함하고, 음성 인식 엔진은 입력된 음성에 음성 인식 알고리즘을 적용하여 사용자가 발화한 음성을 인식하고, 인식 결과를 생성할 수 있다. 이 때, 입력된 음성은 음성 인식을 위한 더 유용한 형태로 변환될 수 있는바, 음성 신호로부터 시작 지점과 끝 지점을 검출하 여 입력된 음성에 포함된 실제 음성 구간을 검출한다. 이를 EPD(End Point Detection)이라 한다. 그리고, 검출 된 구간 내에서 켑스트럼(Cepstrum), 선형 예측 코딩(Linear Predictive Coefficient: LPC), 멜프리퀀시켑스트 럼(Mel Frequency Cepstral Coefficient: MFCC) 또는 필터 뱅크 에너지(Filter Bank Energy) 등의 특징 벡터 추출 기술을 적용하여 입력된 음성의 특징 벡터를 추출할 수 있다. 추출된 특징 벡터와 훈련된 기준 패턴과의 비교를 통하여 인식 결과를 얻을 수 있다. 이를 위해, 음성의 신호적 인 특성을 모델링하여 비교하는 음향 모델(Acoustic Model) 과 인식 어휘에 해당하는 단어나 음절 등의 언어적 인 순서 관계를 모델링하는 언어 모델(Language Model)이 사용될 수 있다. 이를 위해, 저장부에는 음향 모 델/언어 모델 DB가 저장될 수 있다. 음향 모델은 다시 인식 대상을 특징 벡터 모델로 설정하고 이를 음성 데이터의 특징 벡터와 비교하는 직접 비교 방법과 인식 대상의 특징 벡터를 통계적으로 처리하여 이용하는 통계 방법을 나뉠 수 있다. 직접 비교 방법은 인식 대상이 되는 단어, 음소 등의 단위를 특징 벡터 모델로 설정하고 입력 음성이 이와 얼마 나 유사한지를 비교하는 방법으로서, 대표적으로 벡터 양자화(Vector Quantization) 방법이 있다. 벡터 양자화 방법에 의하면 입력된 음성 데이터의 특징 벡터를 기준 모델인 코드북(codebook)과 매핑시켜 대표 값으로 부호 화함으로써 이 부호 값들을 서로 비교하는 방법이다. 통계적 모델 방법은 인식 대상에 대한 단위를 상태 열(State Sequence)로 구성하고 상태 열 간의 관계를 이용하 는 방법이다. 상태 열은 복수의 노드(node)로 구성될 수 있다. 상태 열 간의 관계를 이용하는 방법은 다시 동적 시간 와핑(Dynamic Time Warping: DTW), 히든 마르코프 모델(Hidden Markov Model: HMM), 신경 회로망을 이용 한 방식 등이 있다. 동적 시간 와핑은 같은 사람이 같은 발음을 해도 신호의 길이가 시간에 따라 달라지는 음성의 동적 특성을 고려 하여 기준 모델과 비교할 때 시간 축에서의 차이를 보상하는 방법이고, 히든 마르코프 모델은 음성을 상태 천이 확률 및 각 상태에서의 노드(출력 심볼)의 관찰 확률을 갖는 마르코프 프로세스로 가정한 후에 학습 데이터를 통해 상태 천이 확률 및 노드의 관찰 확률을 추정하고, 추정된 모델에서 입력된 음성이 발생할 확률을 계산하는 인식 기술이다. 한편, 단어나 음절 등의 언어적인 순서 관계를 모델링하는 언어 모델은 언어를 구성하는 단위들 간의 순서 관계 를 음성 인식에서 얻어진 단위들에 적용함으로써 음향적인 모호성을 줄이고 인식의 오류를 줄일 수 있다. 언어 모델에는 통계적 언어 모델과 유한 상태 네트워크(Finite State Automata: FSA)에 기반한 모델이 있고, 통계적 언어 모델에는 Unigram, Bigram, Trigram 등 단어의 연쇄 확률이 이용된다. 음성 인식기(111a)는 음성을 인식함에 있어 상술한 방식 중 어느 방식을 사용해도 무방하다. 예를 들어, 히든 마르코프 모델이 적용된 음향 모델을 사용할 수도 있고, 음향 모델과 음성 모델을 통합한 N-best 탐색법을 사용 할 수 있다. N-best 탐색법은 음향 모델과 언어 모델을 이용하여 N개까지의 인식 결과 후보를 선택한 후, 이들 후보의 순위를 재평가함으로써 인식 성능을 향상시킬 수 있다. 음성 인식기(111a)는 인식 결과의 신뢰성을 확보하기 위해 신뢰값(confidence value)을 계산할 수 있다. 신뢰값 은 음성 인식 결과에 대해서 그 결과를 얼마나 믿을 만한 것인가를 나타내는 척도이다. 일 예로, 인식된 결과인 음소나 단어에 대해서, 그 외의 다른 음소나 단어로부터 그 말이 발화되었을 확률에 대한 상대값으로 정의할 수 있다. 따라서, 신뢰값은 0 에서 1 사이의 값으로 표현할 수도 있고, 0 에서 100 사이의 값으로 표현할 수도 있 다. 신뢰값이 미리 설정된 임계값(threshold)을 초과하는 경우에는 인식 결과를 출력하여 인식 결과에 대응되는 동 작이 수행되도록 할 수 있고, 신뢰값이 임계값 이하인 경우에는 인식 결과를 거절(rejection)할 수 있다. 음성 인식기(111a)의 인식 결과인 텍스트 형태의 발화문은 자연어 이해기(111b)로 입력된다. 자연어 이해기(111b)는 자연어 이해 기술을 적용하여 발화문에 내포된 사용자의 의도를 파악할 수 있다. 따라서 사용자는 자연스러운 대화(Dialogue)를 통해 명령을 입력할 수 있고, 대화 시스템 역시 대화를 통해 명령 의 입력을 유도하거나 사용자가 필요로 하는 서비스를 제공할 수 있다. 먼저, 자연어 이해기(111b)는 텍스트 형태의 발화문에 대해 형태소 분석을 수행한다. 형태소는 의미의 최소 단 위로써, 더 이상 세분화할 수 없는 가장 작은 의미 요소를 나타낸다. 따라서, 형태소 분석은 자연어 이해의 첫 단계로서, 입력 문자열을 형태소열로 바꿔준다. 자연어 이해기(111b)는 형태소 분석 결과에 기초하여 발화문으로부터 도메인을 추출한다. 도메인은 사용자가 발 화한 언어의 주제를 식별할 수 있는 것으로서, 예를 들어, 액션 변경, 경로 안내, 날씨 검색, 교통 검색, 일정 관리, 주유 안내, 공조 제어 등의 다양한 주제를 포함할 수 있다. 도메인에 관한 다양한 정보는 데이터베이스화 되어, 도메인/액션 추론 규칙 DB에 저장된다. 즉, 자연어 이해기(111b)는 분석된 형태소를 도메인/액션 추 론 규칙 DB와 매칭시킨 후, 사용자의 발화에서 도메인을 추출한다. 자연어 이해기(111b)는 발화문으로부터 개체명을 인식할 수 있다. 개체명은 인명, 지명, 조직명, 시간, 날짜, 화폐 등의 고유 명사로서, 개체명 인식은 문장에서 개체명을 식별하고 식별된 개체명의 종류를 결정하는 작업이 다. 개체명 인식을 통해 문장에서 중요한 키워드를 추출하여 문장의 의미를 파악할 수 있다. 자연어 이해기(111b)는 발화문이 갖는 화행을 분석할 수 있다. 화행 분석은 사용자 발화에 대한 의도를 분석하 는 작업으로, 사용자가 새로운 규칙을 생성하는 것인지, 사용자가 질문을 하는 것인지, 요청을 하는 것인지, 응 답을 하는 것인지, 단순한 감정 표현을 하는 것인지 등에 관한 발화의 의도를 파악하는 것이다. 자연어 이해기 (111b)는 발화문에 대응되는 도메인, 개체명, 화행 등의 정보에 기초하여 사용자의 발화 의도를 파악하고, 발화 의도에 대응되는 액션을 추출할 수 있다. 자연어 이해기(111b)는 파악된 사용자의 발화 의도에 대응하는 액션을 추출한다. 전술한 바와 같이, 액션이란 대화 시스템이 사용자에게 제공하는 동작의 집합을 의미한다. 이러한 액션은 도메인/액션 추론 규칙 DB에 미리 저장될 수 있다. 도 5를 참조하면, 액션은 오브젝트(Object)와 오퍼레이터(Operator)에 의해 정의될 수 있다. 예를 들어, 차량 에 마련된 전면 쉴드에서 서리를 제거하는 장치인 디포그(defog)를 실행시키는 액션은 오퍼레이터에 해당하는 \"on\"과 오브젝트에 해당하는 \"defog\"가 결합되어 \"on_defog\"로 정의될 수 있다. 다른 예로, 차량(20 0)에 마련된 에어컨을 실행시키는 액션은 오퍼레이터에 해당하는 \"on\"과 오브젝트에 해당하는 \"aircon\"이 결합 되어 \"on_aircon\"으로 정의될 수 있다. 또한, 도메인/액션 추론 규칙 DB는 정의된 액션을 데이터베이스화 시킨 액션 세트(141a) 이외에도 오퍼레 이터 및 오브젝트를 데이터베이스화 시킨 오페레이터 세트(141b)와 오브젝트 세트(141c)를 더 포함할 수 있다. 오퍼레이터 세트(141b)는 사용자가 발화할 수 있는 다양한 형태소인 \"켜\", \"켜줘\", \"실행\" 등을 액션의 오페레 이터인 \"on\"과 매칭시켜 저장할 수 있다. 또한, 오퍼레이터 세트(141b)는 사용자가 발화할 수 있는 다양한 형태 소인 \"꺼\", \"꺼줘\", \"종료\" 등을 오페레이터인 \"off\"와 매칭시켜 저장할 수도 있다. 오브젝트 세트(141c)는 사용자가 발화할 수 있는 다양한 형태소인 \"에어컨\", \"에어컨디셔너\" 등을 액션의 오브 젝트인 \"aircon\"과 매칭시켜 저장할 수 있다. 또한, 사용자가 발화할 수 있는 다양한 형태소인 \"디포그\", \"김서 림제거기\" 등을 액션의 오브젝트인 \"defog\"와 매칭시켜 저장할 수 있다. 이처럼 자연어 이해기(111b)는 도메인, 개체명, 화행 또는 사용자의 발화 의도 중 적어도 하나에 기초하여 도메 인/액션 추론 규칙 DB에 저장된 오퍼레이터 및 오브젝트를 결정하고, 결정된 오퍼레이터 및 오브젝트에 대 응되는 액션을 추출한다. 다시 도 4를 참조하면, 자연어 이해기(111b)는 액션 수행과 관련된 인자를 추출하는 것도 가능하다. 액션 수행 과 관련된 인자는 액션을 수행하는데 직접적으로 필요한 유효 인자일 수도 있고, 이러한 유효 인자를 추출하기 위해 사용되는 비유효 인자일 수도 있다. 예를 들어, 자연어 이해기(111b)는 도 3에서 도시된 사용자의 발화(U1)에서 \"에어컨을 켜\"를 조건 인자로 추출 할 수 있다. 자연어 이해기(111b)는 도 3에서 도시된 사용자의 발화(U1)에서 \"온도를 설정해줘\"를 결과 인자로 추출할 수 있다. 또한, 자연어 이해기(111b)는 도 3에서 도시된 사용자의 발화(U1)에서 \"17도\"를 기타 인자로 추출할 수 있다. 자연어 이해기(111b)는 파스트리(Parse-tree)와 같이 단어와 단어, 문장과 문장의 수식 관계를 표현할 수 있는 수단도 추출할 수 있다. 자연어 이해기(111b)의 처리 결과인, 형태소 분석 결과, 도메인 정보, 액션 정보, 화행 정보, 추출된 인자 정보, 개체명 정보, 파스트리 등은 대화 입력 관리기(111c)로 전달된다.일 예로, 자연어 이해기(111b)는 도 3에서 도시된 사용자의 발화(U1)에서 액션으로 \"alter_user rule\"을, 조건 인자로 \"on_aircon\"을, 결과 인자로 \"mod_aircon\"을, 기타 인자로 \"17도\"를 추출하고, 추출된 전술한 정보를 대 화 입력 관리기(111c)로 전달할 수 있다. 한편, 상황 정보 처리기는 음성 외 입력 장치와 차량에 마련된 하드웨어적 장치로부터 상황 정 보를 수집하고, 수집된 상황 정보에 기초하여 상황을 이해할 수 있다. 구체적으로, 상황 정보 처리기는 사용자의 명시적인 발화에서 사용자 규칙을 변경 또는 생성하려는 의도를 이해하지 못 하는 경우, 상황 정보를 추가적으로 수집하고, 사용자의 의도를 명확하게 파악할 수 있도록 한다. 이와 달리, 사용자의 명시적인 발화 없이도, 상황 정보 처리기는 상황 정보를 통해 사용자 규칙을 생성 및 변경할 수 있다. 예를 들어 사용자가 입력 버튼을 통해 사용자 규칙을 설정하는 인터페이스를 통해 사용자 규칙을 생성하려는 의도를 파악할 수도 있다. 도 6은 규칙 판단기를 설명하기 위한 제어 블록도이다. 도 7은 규칙 판단기가 사용자 규칙을 적용하기 위한 다 양한 실시예를 설명하기 위한 순서도이다. 입력 처리기는 사용자 규칙에 관한 사용자의 의도를 파악하고, 대화 흐름 관리기로 파악된 결과를 전 달한다. 대화 흐름 관리기는 현재 사용자의 발화에 응답하는 대화 정책을 수립한다. 대화 흐름 관리기는 현재 사용자의 발화가 사용자 규칙에 관한 것임을 판단할 수 있다. 대화 흐름 관리기 는 전달된 정보를 규칙 판단기로 전달한다. 즉, 규칙 판단기는 개시된 대화 시스템이 입력 처리기의 처리 결과에 따라 대화를 생성하는 대화 관리기의 구성이다. 도 6을 참조하면, 규칙 판단기는 사용자가 생성 또는 변경하고자 하는 사용자 규칙에 대해서 분석한다. 구체적으로 규칙 판단기는 저장부에 저장된 그라운드 규칙과 사용자가 입력한 사용자 규칙이 서로 충 돌되는지 여부를 판단한다. 규칙 판단기는 저장부의 일 예에 해당하는 도메인/액션 추론 규칙 DB, 상황 정보 DB, 장기 메모리, 단기 메모리 또는 대화 정책 DB 중 적어도 하나에 저장된 정보를 사용하여, 사용자 규칙이 그라운드 규칙과 서로 충돌하는지 여부를 판단한다. 예를 들어, 도 3의 실시예와 같이 사용자가 on_aircon의 액션을 mod_aircon의 액션으로 변경하고자 하는 경우, 사용자 규칙은 기존에 저장된 그라운드 규칙인 mod_aircon과 서로 충돌한다. 만약 사용자 규칙이 그라운드 규칙과 충돌하지 않으면, 규칙 판단기는 사용자가 새로운 사용자 규칙을 생 성하는 것으로 판단한다. 규칙 판단기는 사용자 규칙과 그라운드 규칙이 충돌하는지 여부를 판단한 후, 사용자 규칙이 현재 대화 시 스템이 적용된 상황에서 실행할 수 있는 규칙인지 여부를 판단한다. 구체적으로 규칙 판단기는 대화 정책 DB를 통해 그라운드 규칙과 사용자 규칙 중 어느 것을 적용할지 여부를 판단한다. 대화 정책 DB에는 여러 대화 상황이 저장될 수 있으며, 그라운드 규칙마다 중요도 및 변경에 대한 기준이 저장될 수 있다. 대화 정책이 등에 의해서 변경될 수 없는 그라운드 규칙을 변경하고자 하는 경우, 규칙 판단기 는 입력된 사용자 규칙을 실행할 수 없는 규칙이라고 판단한다. 또한, 규칙 판단기는 상황 정보 DB에 저장된 상황 정보에 기초하여 사용자 규칙을 적용할 수 있는지 여부를 판단한다. 일 예로, 사용자가 \"샤워기를 켜\"라는 새로운 사용자 규칙을 생성하고자 하면, 규칙 판단기는 상황 정보 DB를 통해 차량에 샤워기가 마련되어 있는지 여부를 확인한다. 만약 차량에 샤워기가 포함되지 않는 경우, 규칙 판단기는 입력된 사용자 규칙이 적용되지 않는 것으로 판단할 수 있다. 이 경우, 규칙 판 단기는 사용자 규칙을 적용 불가능한 규칙으로 판단한다. 만약 사용자 규칙이 적용 가능한 것으로 판단되면, 규칙 판단기는 입력된 사용자 규칙을 기초로 변경시킬 액션 및 인자를 결정한다. 규칙 판단기는 입력된 사용자 규칙에 포함된 액션의 오브젝트, 오퍼레이터 및 인자를 분석하고, 저장부 에서 업데이트할 정보를 선택한다. 이에 관한 구체적인 설명는 도 7을 통해서 후술한다.도 7을 참조하면, 규칙 판단기는 사용자 규칙을 다시 분석한다. 입력 처리기로부터 전달되는 사용자 규칙은, 조건 인자, 결과 인자 및 기타 인자를 포함할 수 있다. 규칙 판단기는 각각의 인자를 분석한 후, 업데이트할 저장부의 정보를 결정한다. 구체적으로 규칙 판단기는 액션을 생성하거나 액션을 변경하거나 인자를 등록함으로써, 저 장부를 업데이트할 수 있다. 액션의 생성(오퍼레이터/오브젝트 추가)와 관련하여, 규칙 판단기는 사용자가 지정한 어휘를 등록할 수 있 다. 예를 들어, 규칙 판단기는 \"에어컨을 쫑(jjong)이라고 하면, 에어컨을 꺼줘\"라는 사용자 규칙을 생성할 수 있다. 이 경우, 규칙 판단기는 새로운 오퍼레이터로 \"쫑\"을 도메인/액션 추론 규칙DB, 단 기 메모리 또는 장기 메모리를 업데이트하는 것으로 결정할 수 있다. 규칙 판단기는 대화 정책에 기초하여 연관어 또는 반의어를 등록할 수도 있다. 예를 들어 규칙 판단 기는 \"이제부터 콘이라고 하면, 에어컨으로 인식해줘\"라는 사용자 규칙을 생성할 수 있다. 이 경우, 규칙 판단기는 \"콘\"이라는 오브젝트를 등록하면서, 연관어에 해당할 수 있는 \"코니\"를 함께 오브젝트로 등록할 수도 있다. 규칙 판단기는 변경할 오브젝트를 도메인/액션 추론 규칙DB, 단기 메모리 또는 장기 메모리에 등록할 것을 결정할 있다. 규칙 판단기는 생성된 액션이 다른 액션에도 적용할 수 있는지 여부를 대화 정책에 기초하여 판단할 수 있 다. 예를 들어 규칙 판단기는 \"이제부터 모두 종료라고 하면, 에어컨을 종료시켜줘\"라는 사용자 규칙 을 생성할 수 있다. 규칙 판단기는 off_aircon과 관련된 액션 세트을 수정하면서, 에어컨 이외의 차량 의 제어 장치에도 이를 적용할 수 있는지 여부를 판단할 수 있다. 규칙 판단기는 액션 생성 이외에도, 액션을 변경을 결정할 수 있다. 구체적으로 규칙 판단기는 액션 세트에 포함된 그라운드 규칙을 사용자 규칙으로 변경할 수 있다. 예를 들어, 규칙 판단기는 도 3의 실시예에 포함된 \"다음에 에어컨을 켜 달라고 하면, 온도를 17도로 설정 해 줘\"라는 사용자 규칙을 적용할 수 있다. 이 경우, 규칙 판단기는 액션 세트에 저장된 on_aircon를 mod_aircon으로 변경할 수 있다. 규칙 판단기는 해당 액션에 인자를 등록할 수도 있다. 예를 들어, 규칙 판단기는 도 3의 실시예에 따라 mod_aircon을 변경하면서, 설정 온도에 해당하는 기타 인 자, 즉 \"17도\"를 액션 세트에 저장할 수 있다. 변경할 액션에 필요한 인자가 포함되면, 규칙 판단기는 해 당 인자 역시 액션과 함께 변경할 수 있다. 다시 도 6을 참조하면, 규칙 판단기는 저장부를 어떻게 변경할지 여부를 구체적으로 판단한 후, 판단 결과를 대화 흐름 관리기로 다시 전달한다. 대화 흐름 관리기는 현재 사용자의 발화에 응답하는 발화를 대화 정책 DB로부터 판단한다. 대화 흐름 관리기는 규칙 판단기가 판단한 결과를 규칙 관리기로 전달한다. 도 8은 규칙 관리기를 설명하기 위한 제어 블록도이다. 도 8을 참조하면, 대화 흐름 관리기는 규칙 관리기의 판단 결과를 응답 생성 관리기로 전달한다. 응답 생성 관리기는 대화 흐름 관리기가 전달하는 액션, 즉 사용자 규칙에 관한 액션을 수행하기 위 해 필요한 응답을 생성한다. 생성된 응답은 출력 관리기를 통해 음성 출력 및 음성 외 출력으로 출력된다. 구체적으로 응답 생성 관리기는 현재 입력된 사용자의 발화에 대한 응답을 위해서 텍스트 응답, 이미지 응 답 또는 오디오 응답을 생성하는 생성하는 대화 응답 생성기, 사용자가 원하는 서비스를 제공하기 위해 다 수의 서비스를 순차적 또는 산발적으로 실행하고 결과값을 취합해주는 서비스 편집기, 차량 제어를 위한 명령어 또는 외부 컨텐츠를 이용한 서비스를 제공하기 위한 명령어를 생성하는 명령어 생성기 및 출력 관 리기의 출력에 기초하여 장기 메모리와 단기 메모리를 관리하는 메모리 관리기를 제어할 수 있다. 대화 응답 생성기는 응답 템플릿을 검색하여 대화 응답 서식을 추출할 수 있고, 추출된 대화 응답 서 식에 필요한 인자 값을 채워 대화 응답을 생성한다. 예를 들어, 도 3과 같은 실시예에서 사용자 규칙이 적용될수 있다는 규칙 판단기의 판단 결과에 기초하여 대화 응답 생성기는 응답 템플릿에서 \"알겠습니 다\"를 생성할 수 있다. 생성된 대화 응답은 응답 생성 관리기로 전달된다. 명령어 생성기는 사용자의 발화가 대화 시스템이 제공하는 서비스와 관련된 것일 때, 서비스를 위한 명령어를 생성한다. 예를 들어, 사용자 규칙이 에어컨 조절과 관련된 사용자 규칙이면, 서비스 편집기는 차량에 마련된 에어컨 장치의 제어를 위한 명령어를 생성할 수 있다. 명령어 생성기가 생성한 명령어는 단기 메모리(14 4)에 저장하고, 일정 시간이 경과될 때 단기 메모리에서 삭제될 수 있다. 서비스 편집기는 규칙 관리기가 판단한 사용자 규칙이 대화 시스템이 제공하는 다수의 서비스와 관련된 것일 때, 다수의 서비스를 순차적 또는 산발적으로 실행하는데 관여할 수 있다. 서비스 편집기가 실행한 결과는 외부 서비스 집합 DB에 저장될 수 있다. 규칙 관리기는 규칙 판단기의 판단 결과를 적용하기 위해서 메모리를 업데이트할 수 있다. 구체적으로 응답 생성 관리기의 요청에 따라 규칙 관리기는 규칙 판단기가 결정한 사용자 규칙 을 장기 메모리에 저장할 수 있다. 또한, 필요에 따라 응답 템플릿, 외부 서비스 집합 DB, 또는 단기 메모리 중 적어도 하나를 편집할 수 있다. 예를 들어, 도 3과 같은 실시예에서 규칙 관리기는 alter_user rule이라는 액션을 포함한 사용자 규칙을 장기 메모리에 저장하면서, 조건 인자, 결과 인자 및 기타 인자를 함께 저장할 수 있다. 또한, 규칙 관리 기는 조건 인자인 on_aircon과 관련된 명령어를 mod_aircon 명령어로 변경하고, 에어컨의 설정 온도를 17 도로 설정하는 명령어를 추가할 수 있다. 또한, 규칙 관리기는 해당 사용자 규칙이 다시 입력되었을 때, 발화하는 응답인 \"예 에어컨의 온도를 17도로 조정합니다\"를 생성할 수 있도록 응답 템플릿을 업데이트할 수 있다. 메모리 관리기는 응답 생성 관리기 및 출력 관리기로부터 전달받은 내용에 기초하여 장기 메모 리와 단기 메모리를 관리한다. 예를 들어, 메모리 관리기는 생성 및 출력된 대화 응답에 기초하 여 사용자와 시스템 간 대화 내용을 저장하여 단기 메모리를 업데이트할 수 있고, 사용자와의 대화를 통해 획득된 사용자 관련 정보를 저장하여 장기 메모리를 업데이트할 수 있다. 메모리 관리기는 일정 기간 이상 축적된 데이터를 분석하여 영속성이 있는 데이터를 획득하고 장기 메모리 에 다시 저장한다. 장기 메모리 내에서 영속성 있는 데이터가 저장되는 위치와 로그 파일 형태로 저 장되는 데이터가 저장되는 위치를 서로 다를 수 있다. 또는, 메모리 관리기가 단기 메모리에 저장된 데이터 중에서 영속성 있는 데이터를 판단하고, 판단된 데이터를 장기 메모리로 옮겨 저장하는 것도 가능하다. 출력 관리기는 대화 응답 생성기가 생성한 대화 응답과 명령어 생성기가 생성한 명령어의 출력 타이밍, 출력 순서, 출력 위치 등을 결정한다. 출력 관리기는 응답 생성기가 생성한 대화 응답과 명령어 생성기가 생성한 명령어를 적절한 타 이밍에 적절한 순서로 적절한 출력 위치에 전송하여 응답을 출력한다. TTS(Text to Speech) 응답은 스피커(23 2)를 통해 출력할 수 있고, 텍스트 응답은 디스플레이를 통해 출력할 수 있다. 대화 응답을 TTS 형태로 출 력하는 경우에는 차량에 마련된 TTS 모듈을 이용하거나 출력 관리기가 TTS 모듈을 포함할 수도 있다. 한편, 도 4, 도 6 및 도 8에서 설명한 각각의 구성요소들은 단일 프로세서에 의해 구현되는 것도 가능하고, 별 개의 프로세서에 의해 구현되는 것도 가능하다. 또한, 입력 처리기, 규칙 판단기 및 규칙 관리기 역시 단일 프로세서에 의해 구현되는 것도 가능하고, 별개의 프로세서에 의해 구현되는 것도 가능하다. 도 9는 새로운 사용자 규칙을 생성하는 다른 실시예에 관한 순서도이다. 도 9를 참조하면, 입력 처리기는 사용자로부터 \"다음에 에어컨 쫑 이라고 하면, 에어컨을 꺼줘\"라는 발화 를 수신할 수 있다. 입력 처리기는 입력된 발화에 대한 형태소를 분석하고, 도메인을 사용자 규칙이라고 판단할 수 있다. 또한, 입력 처리기는 화행을 요청으로 분석한다. 입력 처리기는 전술한 분석 결과를 기초로 사용자의 발화에서 사용자 규칙 생성(generate_user rule)을 추 출할 수 있다. 또한, 입력 처리기는 결과 인자로 \"off_aircon\"을 추출하고, 기타 인자로 쫑을 추출할 수있다. 입력 처리기는 추출된 액션과 복수 개의 인자를 대화 흐름 관리기로 전달한다. 대화 흐름 관리기는 사용자의 발화에 대한 응답을 위해서 대화 정책을 수립한다. 또한 대화 흐름 관리기 는 현재 사용자의 발화가 사용자 규칙에 관련된 것임을 확인하고, 규칙 판단기로 추출된 액션 및 인 자를 전달한다. 규칙 판단기는 도메인/액션 추론 규칙 DB, 상황 정보 DB 또는 대화 정책 DB 중 적어도 하 나에 포함된 정보에 기초하여 사용자 규칙이 그라운드 규칙과 서로 충돌하는지 여부를 판단한다. 구체적으로 규칙 판단기는 도메인/액션 추론 규칙 DB로부터 입력된 사용자 규칙과 충돌하는 그라운드 규칙이 서로 충돌하지 않는 것을 확인할 수 있다. 규칙 판단기는 상황 정보 DB로부터 현재 대화 시스 템이 차량에 마련되어 있고, 에어컨의 동작에 관한 사용자의 규칙이 적용될 수 있는 것으로 판단할 수 있다. 또한, 규칙 판단기는 대화 정책DB로부터 기타 인자인 쫑이 적용될 수 있는 것으로 판단할 수 있다. 입력된 사용자 규칙이 적용 가능한 것으로 판단되면, 규칙 판단기는 입력된 사용자 규칙을 분석하여 저장 부를 업데이트할 구체적인 정보를 결정한다. 개시된 실시예에서 규칙 판단기는 입력된 사용자 규칙이 오퍼레이터를 새롭게 추가하는 사용자 규칙인 것으로 분석할 수 있다. 규칙 판단기는 새로운 어휘인 \"쫑\"을 추가하기 위해서 도메인/액션 추론 규칙 DB의 오퍼레이터 세트를 변경하고, 장기 메모리에 입력된 사용자 규칙을 저장하도록 결정할 수 있다. 규칙 판단기는 결정 사항을 대화 흐름 관리기로 전달한다. 대화 흐름 관리기는 규칙 판단기의 결정 사항에 대응하는 응답을 생성하도록 대화 정책을 수립한다. 대화 흐름 관리기는 규칙 판단기의 결정 사항과 수립된 대화 정책을 응답 생성 관리기로 전달한 다. 응답 생성 관리기는 수립된 대화 정책에 따라 응답 템플릿으로부터 \"네 알겠습니다\"를 선택할 수 있 다. 또한, 응답 생성 관리기는 대화 판단기의 결정 사항을 규칙 관리기로 전달한다. 규칙 관리기는 새로운 오퍼레이터인 \"쫑\"을 추가하기 위해서 도메인/액션 추론 규칙 DB를 업데이트하 고, 장기 메모리에 새로운 사용자 규칙에 대한 정보를 추가한다. 응답 생성 관리기는 규칙 관리기의 동작을 모니터링하면서, 출력 관리기를 통해 선택된 응답, 즉 \"네 알겠습니다\"를 출력할 수 있다. 이를 통해서 개시된 대화 시스템, 이를 포함하는 차량 및 대화 처리 방법은 미리 설정된 대화 패턴에 따라 대화를 수행하는 것을 넘어서, 사용자가 스스로 대화 시스템에 자신의 기호와 취향에 맞는 어휘를 등록하 고, 미리 저장된 대화 패턴을 변경시킴으로써, 사용자에게 확장된 기능을 제공할 수 있다. 또한 대화 시스템 , 이를 포함하는 차량 및 대화 처리 방법은 사용자의 만족도를 증가시킴으로써 서비스의 충성심을 향 상시키고, 사용자의 편의성을 제공할 수 있다."}
{"patent_id": "10-2019-0039267", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 대화 시스템의 제어 블록도이다. 도 2는 차량 내부의 구성을 나타낸 도면이다. 도 3은 대화 시스템과 운전자 사이에 주고 받을 수 있는 대화의 예시를 나타낸 도면이다. 도 4는 도 1에서 도시된 입력 처리기의 구성을 세분화한 제어 블록도이다. 도 5는 저장부의 일 예에 해당하는 도메인/액션 추론 규칙 DB(데이터베이스)를 설명하기 위한 도면이다. 도 6은 규칙 판단기를 설명하기 위한 제어 블록도이다. 도 7은 규칙 판단기가 사용자 규칙을 적용하기 위한 다양한 실시예를 설명하기 위한 순서도이다. 도 8은 규칙 관리기를 설명하기 위한 제어 블록도이다. 도 9는 새로운 사용자 규칙을 생성하는 다른 실시예에 관한 순서도이다."}
