{"patent_id": "10-2023-0040575", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0145741", "출원번호": "10-2023-0040575", "발명의 명칭": "CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템", "출원인": "(주)금오시큐리티", "발명자": "임채욱"}}
{"patent_id": "10-2023-0040575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템(100)에 관한 것으로, 지하 공동구 내부에 설치되며, 지하 공동구 작업시 작업자의 동선을 따라 실시간 추적하며 작업 현황을 상황실로 실시간 음성 및 영상 그리고 공기질을 전송하는 지하 공동구 CCTV 레일형 이동체(110); 및지하 공동구 CCTV 레일형 이동체(110)와 연결되며, 딥러닝 엔진 기반의 영상 분석 엔진으로 실시간 스트리밍 되는 CCTV 영상으로부터 작업자의 이상행동 패턴을 선별적으로 탐지함과 동시에 영상 데이터, 환경 센서 데이터그리고 서로 다른 이기종의 자료를 수집하여 상호 연관성과 상태, 임계치를 분석 처리한 후 작업자 위험 및 안전사고를 예측할 수 있도록 한 딥러닝 엔진 기반의 위험 예측 시스템(150);이 포함됨을 특징으로 하는 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템."}
{"patent_id": "10-2023-0040575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1 에 있어서,상기 지하 공동구 CCTV 레일형 이동체(110)에는,지하 공동구 물리적 환경에 적합한 레일형 CCTV 시스템을 이용하여 작업자를 실시간 추적할 수 있게 함과 동시에 고도화된 지능형 멀티 객체 인식 SW를 적용하여 CCTV 영상의 화각을 거리와 방향에 따라 자동 조절하여 원격지에서 작업 현황을 정확하게 파악하고, 레일형 CCTV로부터 원격지로 전송되는 영상은 작업자 행동 분석 알고리즘이 적용된 딥러닝 엔진으로 분석하여‘비인가 출입자’,‘작업자의 쓰러짐’,‘작업영역 이탈’및 발생할 수있는 각종 상황에 대한 경보 전파의 임무를 수행하는 CCTV 레일형 이동체(120); 및CCTV 레일형 이동체(120)에 연결되며, 지하 공동구 CCTV 레일형 이동체(110)의 입출력 장치간 통신 및 조율을제어하고, 데이터를 처리하는 콘트롤유니트(140);가 포함됨을 특징으로 하는 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템."}
{"patent_id": "10-2023-0040575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2 에 있어서,상기 CCTV 레일형 이동체(120)는,지하 공동구 천정에 매달려 설치되는 레일(121);레일(121)에 조립 설치되며, 레일을 따라 좌우로 슬라이딩 이동하는 대차(122); 및대차(122)에 조립 설치되며, 360도로 지하 공동구의 현장을 실시간 촬영하면서 딥러닝 엔진 기반의 위험 예측시스템(150)에 데이터를 전송하는 CCTV카메라(123);가 포함됨을 특징으로 하는 CCTV 레일 이동형 지하 공동구작업자 안전관리 시스템."}
{"patent_id": "10-2023-0040575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2 에 있어서,상기 CCTV 레일형 이동체(120)에는,콘트롤유니트(140)와 연동하여 작업자의 작업반경 준수, 안전모, 방진마스크의 작업복장 착용 준수, 위치 확인을 통한 작업자 안전 지침 준수, 작업자의 실시간 행동 파악, 이상행동 패턴을 추출하여 예측 판단, 작업패턴공개특허 10-2024-0145741-3-분석을 통한 작업패턴별 안전관리 환경을 구축하는 행동분석을 통한 위험예측 판단부(135);가 더 포함됨을 특징으로 하는 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템."}
{"patent_id": "10-2023-0040575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 에 있어서,상기 딥러닝 엔진 기반의 위험 예측 시스템(150)은,인공지능(AI) 알고리즘 훈련에 활용될 데이터를 수집하고 각 데이터를 정확하게 라벨링 하는 데이터 라벨링, 데이터 관리 및 AI Engine에 의해 작업패턴 분석을 통한 작업패턴별 안전관리 환경 구축하고, 딥러닝 서버 내 학습된 모델에 의하여 영상에서 곧바로 행동 패턴을 자동 식별하고, 유의미한 선별적 영상만을 저장 관리하여 스토리지 인프라에 대한 비용 절감과 함께 실시간 행동 파악을 통해 빠른 대응이 가능하고, 이상행동 패턴을 추출함으로써 결과 예측이나 규정 준수를 보장하는 AI행동인식부(160);가 포함됨을 특징으로 하는 CCTV 레일 이동형지하 공동구 작업자 안전관리 시스템."}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템에 관한 것이다. 본 발명은 이를 위해 지하 공동구 내부에 설치되며, 지하 공동구 작업시 작업자의 동선을 따라 실시간 추적하며 작업 현황을 상황실로 실시간 음성 및 영상 그리고 공기질을 전송하는 지하 공동구 CCTV 레일형 이동체; 및 (뒷면에 계속)"}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템에 관한 것으로, 보다 상세하게는 지 하 공동구 작업자 안전 및 공기질 측정을 위한 딥러닝 엔진 기반 레일 이동형 안전관리 시스템을 제공하고, 이 로 인해 안전관리 시스템의 품질과 신뢰성을 대폭 향상시키므로 사용자인 작업자들의 다양한 욕구(니즈)를 충족 시켜 좋은 이미지를 심어줄 수 있도록 한 것이다."}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 식별항목에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술 이 아니며, 이 식별항목에 기재된다고 하여 종래 기술이라고 인정되는 것은 아니다. 주지하다시피 지하 공동구는 각종 전력선과 전화선, 유선방송 케이블, 초고속 광통신망, 상수도관, 난방용 온수 관 등 각종 생활관련 중요공급시설을 한꺼번에 모아 설치한 대형 지하구조물을 말한다. 종래에는 상기 지하공동구를 점검하는 시스템이 갖추어져 있으나 다음과 같은 많은 문제점이 발생되었다. 즉, 상기 종래 기술은 지하 공동구 전 구역 관리 및 감시가 어려운 문제점이 발생 되었다. 이를 보다 상세히 설명하면, 종래 기술은 광범위한 지하 공동구 모든 구역에 공기질 측정 센서 및 CCTV 설치가 어려운 구조적인 문제점이 발생 되었다. 또한 상기 종래 기술은 지하 공동구에 매번 작업자 투입이 어려운 구역이므로 무인 감시 및 무인 관리 시스템으 로 전환이 필요하나, 이러한 기술이 전무하다는 문제점이 발생 되었다. 그리고 상기 종래 기술은 지하 공동구 사각지대를 없애기 위한 시스템이 필요하나, 이러한 기술도 전무한 실정 이다. 상기 종래 기술의 지하 공동구는 접근이 어렵고, 환풍기가 설치되어 있더라도 밀폐 구조이기 때문에 환기가 제 대로 이루어지지 않아 지하 내부 공기의 질이 상당히 떨어지게 된다. 내부 콘크리트 구조물에서 발생하는 미세 입자나 분진이 많으며, 공기 중 상당량의 유해가스가 함유되고 있는 것으로 보고되고 있다. 따라서 지하공동구 전 구간의 공기질을 상시 측정하여 지하공동구 작업 개시 전 필요한 조처를 할 수 있도록 점 검 가능한 시스템 고도화가 요구되나, 이러한 기술이 뒷받침되지 못하는 커다란 문제점이 발생 되었다. 특히 상기 종래 기술은 평균적으로 400m를 상회하는 지하 공동구 전체를 관리, 감독하기 위해서 움직이는 형태 의 감시 시스템과 지능화된 제어 시스템이 필요하나, 종래에는 이러한 기술이 전무하다는 커다란 문제점이 발생 되었다.상기한 문제점을 해결하기 위해 종래에는 아래와 같은 선행기술문헌들이 개발되었으나, 여전히 상기한 종래 기 술의 문제점을 일거에 해결하지 못하는 커다란 문제점이 발생 되었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제2369229호(2022. 02. 24)가 등록된바 있다. (특허문헌 0002) 대한민국 등록특허공보 제1348973호(2014. 01. 02)가 등록된바 있다. (특허문헌 0003) 대한민국 등록특허공보 제2127921호(2020. 06. 23)가 등록된바 있다. (특허문헌 0004) 대한민국 공개특허공보 제2010-0001685호(2010. 01. 06)가 공개된바 있다."}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래 기술의 제반 문제점을 해소하기 위하여 안출한 것으로, CCTV 레일 이동형 지하 공 동구 작업자 안전관리 시스템에 지하 공동구 CCTV 레일형 이동체, CCTV 레일형 이동체, 공기질 측정시스템, 콘 트롤 유니트, 딥러닝 엔진 기반의 위험 예측 시스템, AI 행동 인식부, 경보기, DB 및 데이터 처리 및 분석부가 구비됨을 제1목적으로 한 것이고, 상기한 기술적 구성에 의한 본 발명의 제2목적은 지하 공동구 작업자 안전 및 공기질 측정을 위한 딥러닝 엔진 기반 레일 이동형 안전관리 시스템을 제공하고, 제3목적은 중대재해기업처벌법 시행에 따른 위험지역 작업자 안전관리를 위하여 발전소 내 지하공동구 전 구간에 대한 작업자 안전관리를 위한 실시간 촬영과 영상 분석을 통한 위험 예측 및 지하공동구 전 구간의 상시, 주기적 공기질 측정이 가능한 레일 형 안전관리 시스템구축으로 지하공동구에서 발생하는 모든 안전사고를 획기적으로 감소시킬 수 있도록 한 것이 고, 제4목적은 단순 모니터링 위주의 노동 집약적 감시환경에서 벗어나 보다 지능적이고 자율적인 상황 인식 방 식의 지능형 솔루션으로, 레일을 이용하여 이동이 자유롭고 지능형 행동 분석과 환경분석 시스템 도입을 통해 지하공동구 안전사고 감시의 정확도를 높이고, 관제실에서 실시간 안전사고를 판단하고 적절한 대응을 가능케 함으로써 골든 타임을 확보하여 피해를 최소화할 수 있도록 한 것이고, 제5목적은 지하 공동구 전 지역 감시 가 능한 원격,자동제어 이동형 디바이스를 제공하고, 제6목적은 지능형 멀티 객체 인식 및 행동분석 알고리즘과 객 체와의 거리 별 카메라 화각 및 기능 자동제어 소프트웨어를 제공하고, 제7목적은 지하공동구 안전관리를 위한 레일형 이동체 고도화를 이루도록 한 것이고, 제8목적은 딥러닝 엔진 기반의 작업자 행동 분석을 통한 위험 예 측 시스템 개발을 제공하는 것이고, 제9목적은 지하 공동구내 산소농도, 이산화탄소, 미세먼지, 휘발성 유기화 합물 미세 측정 가능한 이동형 디바이스를 제공하고, 제10목적은 이로 인해 안전관리 시스템의 품질과 신뢰성을 대폭 향상시키므로 사용자인 작업자들의 다양한 욕구(니즈)를 충족시켜 좋은 이미지를 심어줄 수 있도록 한 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템을 제공한다."}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적 달성을 위하여 본 발명은 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템에 관한 것으로, 지하 공동구 내부에 설치되며, 지하 공동구 작업시 작업자의 동선을 따라 실시간 추적하며 작업 현황을 상황실 로 실시간 음성 및 영상 그리고 공기질을 전송하는 지하 공동구 CCTV 레일형 이동체; 및 지하 공동구 CCTV 레일 형 이동체와 연결되며, 딥러닝 엔진 기반의 영상 분석 엔진으로 실시간 스트리밍 되는 CCTV 영상으로부터 작업 자의 이상행동 패턴을 선별적으로 탐지함과 동시에 영상 데이터, 환경 센서 데이터 그리고 서로 다른 이기종의 자료를 수집하여 상호 연관성과 상태, 임계치를 분석 처리한 후 작업자 위험 및 안전사고를 예측할 수 있도록 한 딥러닝 엔진 기반의 위험 예측 시스템;이 포함됨을 특징으로 하는 CCTV 레일 이동형 지하 공동구 작업자 안 전관리 시스템을 제공한다."}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기에서 상세히 살펴본 바와 같이 본 발명은 지하 공동구 작업자 안전 및 공기질 측정을 위한 딥러닝 엔진 기 반 레일 이동형 안전관리 시스템을 제공한다. 또한 본 발명은 중대재해기업처벌법 시행에 따른 위험지역 작업자 안전관리를 위하여 발전소 내 지하공동구 전 구간에 대한 작업자 안전관리를 위한 실시간 촬영과 영상 분석을 통한 위험 예측 및 지하공동구 전 구간의 상시, 주기적 공기질 측정이 가능한 레일형 안전관리 시스템구축으로 지하공동구에서 발생하는 모든 안전사고를 획기적으로 감소시킬 수 있도록 한 것이다. 그리고 본 발명은 단순 모니터링 위주의 노동 집약적 감시환경에서 벗어나 보다 지능적이고 자율적인 상황 인식 방식의 지능형 솔루션으로, 레일을 이용하여 이동이 자유롭고 지능형 행동 분석과 환경분석 시스템 도입을 통해 지하공동구 안전사고 감시의 정확도를 높이고, 관제실에서 실시간 안전사고를 판단하고 적절한 대응을 가능케 함으로써 골든 타임을 확보하여 피해를 최소화할 수 있도록 한 것이다. 또한 본 발명은 지하 공동구 전 지역 감시 가능한 원격,자동제어 이동형 디바이스를 제공한다. 그리고 본 발명은 지능형 멀티 객체 인식 및 행동분석 알고리즘과 객체와의 거리 별 카메라 화각 및 기능 자동 제어 소프트웨어를 제공하고, 특히 본 발명은 지하공동구 안전관리를 위한 레일형 이동체 고도화를 이루도록 한 것이다. 아울러 본 발명은 딥러닝 엔진 기반의 작업자 행동 분석을 통한 위험 예측 시스템 개발을 제공하는 것이다. 더하여 본 발명은 지하 공동구내 산소농도, 이산화탄소, 미세먼지, 휘발성 유기화합물 미세 측정 가능한 이동형 디바이스를 제공한다. 본 발명은 상기한 효과로 인해 안전관리 시스템의 품질과 신뢰성을 대폭 향상시키므로 사용자인 작업자들의 다 양한 욕구(니즈)를 충족시켜 좋은 이미지를 심어줄 수 있도록 한 매우 유용한 발명인 것이다. 이하에서는 이러한 효과 달성을 위한 본 발명의 바람직한 실시 예를 첨부된 도면에 따라 상세히 설명하면 다음 과 같다."}
{"patent_id": "10-2023-0040575", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 적용된 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템은 도 1 내지 도 3 에 도시된 바와 같 이 구성되는 것이다. 하기에서 본 발명을 설명함에 있어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불 필요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 설정된 용어들로서 이는 생산자의 의도 또는 관례에 따라 달라질 수 있으므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 또한 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 임의로 나타내었으므로, 본 발명이 반드시 도면에 도시된 바에 한정되지 않는다.먼저, 본 발명은 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템에 관한 것으로 다음과 같이 구성 된다. 즉, 본 발명은 지하 공동구 내부에 설치되며, 지하 공동구 작업시 작업자의 동선을 따라 실시간 추적하며 작업 현황을 상황실로 실시간 음성 및 영상 그리고 공기질을 전송하는 지하 공동구 CCTV 레일형 이동체가 구비 된다. 또한 본 발명은 상기 지하 공동구 CCTV 레일형 이동체와 연결되며, 딥러닝 엔진 기반의 영상 분석 엔진으 로 실시간 스트리밍 되는 CCTV 영상으로부터 작업자의 이상행동 패턴을 선별적으로 탐지함과 동시에 영상 데이 터, 환경 센서 데이터 그리고 서로 다른 이기종의 자료를 수집하여 상호 연관성과 상태, 임계치를 분석 처리한 후 작업자 위험 및 안전사고를 예측할 수 있도록 한 딥러닝 엔진 기반의 위험 예측 시스템이 구비된다. 또한 본 발명에 적용된 상기 지하 공동구 CCTV 레일형 이동체에는 다음의 기술적 구성이 구비된다. 즉, 본 발명은 지하 공동구 물리적 환경에 적합한 레일형 CCTV 시스템을 이용하여 작업자를 실시간 추적할 수 있게 함과 동시에 고도화된 지능형 멀티 객체 인식 SW를 적용하여 CCTV 영상의 화각을 거리와 방향에 따라 자동 조절하여 원격지에서 작업 현황을 정확하게 파악하고, 레일형 CCTV로부터 원격지로 전송되는 영상은 작업자 행 동 분석 알고리즘이 적용된 딥러닝 엔진으로 분석하여‘비인가 출입자’,‘작업자의 쓰러짐’,‘작업영역 이탈 ’및 발생할 수 있는 각종 상황에 대한 경보 전파의 임무를 수행하는 CCTV 레일형 이동체가 구비된다. 아울러 본 발명은 상기 CCTV 레일형 이동체에 연결되며, 지하 공동구 CCTV 레일형 이동체의 입출력 장치간 통신 및 조율을 제어하고, 데이터를 처리하는 콘트롤유니트가 구비된다. 더하여 본 발명에 적용된 상기 CCTV 레일형 이동체는 다음의 기술적 구성이 구비된다. 즉, 본 발명은 지하 공동구 천정에 매달려 설치되는 레일이 구비된다. 또한 본 발명은 상기 레일에 조립 설치되며, 레일을 따라 좌우로 슬라이딩 이동하는 대차가 구비된다. 그리고 본 발명은 상기 대차에 조립 설치되며, 360도로 지하 공동구의 현장을 실시간 촬영하면서 딥러닝 엔진 기반의 위험 예측 시스템에 데이터를 전송하는 CCTV카메라가 구비된다. 이때 본 발명에 적용된 상기 대차의 내부에는 모터 및 권취기가 구비되고, 모터와 권취기의 구동에 의해 케이블이 권취 및 풀림 작동으로 CCTV카메라를 상하로 승하강 작동시킬 수 있게 된다. 그리고 상기 레일에는 전선, 케이블, 모선 등을 수용하고 기계적으로 보호하기 위한 레이스웨이(race wa y)가 구비됨이 바람직하다. 또한 상기 레일의 양 끝단에는 대차를 정지시키는 과정에서 충격을 완화시키는 완충유니트가 구 비됨이 바람직하다. 특히 본 발명에 적용된 상기 CCTV 레일형 이동체는 지하 공동구의 낮은 높이를 고려하여 레일형 이동체인 대차를 소형화하고 제어 속도를 5msec 이하로 낮추어 정밀 제어가 가능하도록 구성하고, 레일형 이동체인 대차 의 속도별, 방향 전환 모터 속도를 최적화하고, 레일의 각 위치 정보를 검출할 수 있도록 레일 길이별 위치 정 보 송신 모듈이 구비되고, 딥러닝 기반 위험 예측 시스템과 연동되는 제어용 프로토콜 탑재됨이 바람직하다. 한편, 본 발명에 적용된 상기 CCTV 레일형 이동체에는 콘트롤유니트와 연동하여 작업자의 작업반경 준수, 안전모, 방진마스크의 작업복장 착용 준수, 위치 확인을 통한 작업자 안전 지침 준수, 작업자의 실시간 행동 파악, 이상행동 패턴을 추출하여 예측 판단, 작업패턴 분석을 통한 작업패턴별 안전관리 환경을 구축하는 행동분석을 통한 위험예측 판단부가 구비된다. 또 한편, 본 발명에 적용된 상기 딥러닝 엔진 기반의 위험 예측 시스템은 인공지능(AI) 알고리즘 훈련에 활용될 데이터를 수집하고 각 데이터를 정확하게 라벨링 하는 데이터 라벨링, 데이터 관리 및 AI Engine에 의해 작업패턴 분석을 통한 작업패턴별 안전관리 환경 구축하고, 딥러닝 서버 내 학습된 모델에 의하여 영상에서 곧 바로 행동 패턴을 자동 식별하고, 유의미한 선별적 영상만을 저장 관리하여 스토리지 인프라에 대한 비용 절감 과 함께 실시간 행동 파악을 통해 빠른 대응이 가능하고, 이상행동 패턴을 추출함으로써 결과 예측이나 규정 준 수를 보장하는 AI행동인식부가 구비된다.한편 본 발명은 상기의 구성부를 적용함에 있어 다양하게 변형될 수 있고 여러 가지 형태를 취할 수 있다. 그리고 본 발명은 상기의 상세한 설명에서 언급되는 특별한 형태로 한정되는 것이 아닌 것으로 이해되어야 하며, 오히려 첨부된 청구범위에 의해 정의되는 본 발명의 정신과 범위 내에 있는 모든 변형물과 균등물 및 대 체물을 포함하는 것으로 이해되어야 한다. 상기와 같이 구성된 본 발명 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템의 작용효과를 설명하면 다 음과 같다. 우선, 본 발명은 지하 공동구 작업자 안전 및 공기질 측정을 위한 딥러닝 엔진 기반 레일 이동형 안전관리 시스 템을 제공한다. 이를 위해 본 발명에 적용된 도 1 은 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템의 전체 구성 도를 보인 것이다. 이하에서 상기 본 발명의 작용효과를 보다 구체적으로 설명하면 다음과 같다. 먼저, 본 발명은 작업자가 지하 공동구에 진입하게 되면 CCTV 레일형 이동체에 의해 작업자의 이동 상황을 실시간 파악하여 딥러닝 엔진 기반의 위험 예측 시스템에 데이터를 전송하게 된다. 이때 본 발명은 대차가 레일을 따라 좌우로 이동하는 과정에서 CCTV카메라가 360도 회전하면서 실시간 현장 상황을 촬영하게 되고, 아울러 상기 CCTV카메라는 대차의 내부에 구비된 모터 및 권취부 에 연결된 케이블을 통해 상하로 승하강 작동하면서 현장 상황을 리얼하게 촬영하고, 이렇게 촬영된 영상 및 음성을 실시간으로 딥러닝 엔진 기반의 위험 예측 시스템에 전송한다. 그리고 본 발명은 상기 과정에서 CCTV 레일형 이동체에 연결된 공기질측정장치가 지하 공동구 전 구 간을 레일형 이동체에 탑재되어 이동하면서 이산화탄소, 이산화질소, 아황산가스, 미세먼지, 석면, 휘발성 유기 화합물(VOCs), 포름알데히드(CH2O), 라돈, 산소농도 등을 측정 및 공기질을 분석하고 이를 통해 위험, 경고, 작 업 가능 등 단계별 표시를 통하여 작업자가 사전 확인 가능하도록 해주게 된다. 아울러 본 발명은 상기 CCTV 레일형 이동체에 연결된 행동분석을 통한 위험예측 판단부가 콘트롤유니 트와 연동하여 작업자의 작업반경 준수, 안전모, 방진마스크의 작업복장 착용 준수, 위치 확인을 통한 작 업자 안전 지침 준수, 작업자의 실시간 행동 파악, 이상행동 패턴을 추출하여 예측 판단, 작업패턴 분석을 통한 작업패턴별 안전관리 환경을 구축하게 된다. 본 발명은 상기한 지하 공동구 CCTV 레일형 이동체에서 발생된 모든 데이터가 딥러닝 엔진 기반의 위험 예 측 시스템에 전송되고, 딥러닝 엔진 기반의 위험 예측 시스템은 상기 데이터를 가공 분석 처리하게 된다. 즉, 상기 딥러닝 엔진 기반의 위험 예측 시스템은 딥러닝 엔진 기반의 영상 분석 엔진으로 실시간 스트리 밍 되는 CCTV 영상으로부터 작업자의 이상행동 패턴을 선별적으로 탐지함과 동시에 영상 데이터, 환경 센서 데 이터 그리고 서로 다른 이기종의 자료를 수집하여 상호 연관성과 상태, 임계치를 분석 처리한 후 작업자 위험 및 안전사고를 예측하게 되고, 상기 딥러닝 엔진 기반의 위험 예측 시스템에 연결된 AI행동인식부는 인공지능(AI) 알고리즘 훈련에 활용될 데이터를 수집하고 각 데이터를 정확하게 라벨링 하는 데이터 라벨링, 데 이터 관리 및 AI Engine에 의해 작업패턴 분석을 통한 작업패턴별 안전관리 환경 구축하고, 딥러닝 서버 내 학 습된 모델에 의하여 영상에서 곧바로 행동 패턴을 자동 식별하고, 유의미한 선별적 영상만을 저장 관리하여 스 토리지 인프라에 대한 비용 절감과 함께 실시간 행동 파악을 통해 빠른 대응이 가능하고, 이상행동 패턴을 추출 함으로써 결과 예측이나 규정 준수를 보장하게 된다. 특히 본 발명에 적용된 상기 데이터 라벨링에는 예를 들어 액션라벨링, 상호작용 라벨링, 문맥라벨링, 학생/교 사 라벨링 및 수업라벨링 등이 포함되고, 상기 데이터 관리에는 예를 들어 유치원관리, 접근제어, 사용로그, 백 업, 폐기 및 모자이크 등이 포함되고, 상기 AI Engine에는 예를 들어 포즈감지, 행동감지, 상호작용감지, 문맥 감지, 학생/교사감지 및 수업감지 등이 포함된다. 아울러 상기 딥러닝 엔진 기반의 위험 예측 시스템에는 갑작스러운 사고나 위험을 광선이나 음향 따위를 이용하여 알리는 경보기가 구비됨과 아울러 상기 경보기는 작업자의 휴대폰을 통해 위험 상황을 신속히 알 려주게 되고, 또한 본 발명은 저장매체에 자료를 저장하여 관리하는 데이터베이스가 구비되고, 그리고 본발명은 작업자의 위험 정보를 얻기 위해 데이터를 분석 및 처리하는 데이터처리 및 분석부가 구비된다. 상기한 결과 도 2 는 본 발명 작업자 복장 유형을 판단한 사진으로 왼쪽 사진은 안전모, 안전벨트 착용, 중앙 사진은 안전모, 안전벨트 미착용, 오른쪽 사진은 안전벨트만 착용한 상태를 보인 사진으로, 본 발명 CCTV카메라 가 촬영한 영상을 1차적으로 행동분석을 통한 위험예측 판단부가 판단한 후 2차적으로 AI행동인식부 가 영상을 판독하여 위험 상황시 경보기를 작동시키게 된다. 또한 도 3 은 본 발명 작업자 안전모 수칙 준수 여부 판단 사진으로, 이 역시 본 발명 딥러닝 엔진 기반의 위험 예측 시스템이 데이터베이스와 데이터처리 및 분석부를 통해 작업자 행동양식을 분석 한 후 안 전수칙 준수 여부를 파악하게 된다. 한편, 본 발명에 적용된 지하 공동구 및 건설 현장의 경우 다른 곳 보다도 빈번하게 위험에 노출되므로 항상 안 전이 중요시 되는 장소이다. 지하 공동구에서 사람이 항상 불안전한 구조물을 이동해야 하므로 물체와 충돌 사 고의 위험이 높다. 따라서 안전모를 착용하지 아니하여 인명사고로 이어지는 것을 방지하기 위하여 카메라 레 일 CCTV는 안전모 미착용자를 인식하고, 안전모 미착용자에게 경고 메시지를 전송함으로써 안전사고를 예방할 수 있다. 특히 상기한 판단부의 기술은 카메라 감시구역의 영상 신호를 수신하고, 영상 신호로부터 객체의 크기와 윤곽선 을 기초로 사람임을 판별하고, 사람 머리부분 RGB(Red, Green, Blue)값 또는 HSV(Hue, Saturation, Value)의 색상(H)값 중 적어도 하나 이상을 기초로 안전모 착용여부를 판별하고, 안전모 미착용자 판별시 상기 안전모 미 착용자의 썸네일 영상을 획득하기 위한 PTZ(Pan-Tilt-Zoom) 카메라 제어 신호를 출력하고, 카메라는 소정 기준 값 이하의 해상도를 가지는 카메라이고, 처리부의 안전모 착용여부 판별은 RGB(Red, Green, Blue)값과 미리 설 정된 기준 RGB(Red, Green, Blue)값의 비교 결과에 기초하거나 HSV(Hue, Saturation, Value)의 색상(H)값과 미 리 설정된 기준 HSV(Hue, Saturation, Value)의 색상(H)값의 비교 결과에 기초하여 지하 공동구에서 안전모 착 용여부를 판별한다. 상기와 같이 본 발명은 지하공동구 안전관리를 위한 레일형 이동체 고도화 한 것으로, 기존 고속도로 터널, 교 도소, 제조공장 등 다양한 용도로 사용되던 레일형 이동체를 지하 공동구에서 사용할 수 있도록 고도화 한 것이 고, 지하 공동구의 낮은 높이를 고려하여 레일형 이동체를 소형화하고 제어 속도를 5msec 이하로 낮추어 정밀 제어가 가능하도록 구성한 것이고, 레일형 이동체의 속도 별, 방향 전환 모터 속도를 최적화 한 것이고, 레일의 각 위치 정보를 검출할 수 있도록 레일 길이 별 위치 정보 송신 모듈을 개발한 것이고, 딥러닝 기반 위험예측 시스템과 연동되는 제어용 프로토콜 탑재된 컨트롤 유닛 개발한 것이다. 또한 본 발명은 딥러닝 엔진 기반의 작업자 행동 분석을 통한 위험 예측 시스템 개발한 것으로, 개발 기술은 딥 러닝 엔진 기반의 영상 분석 엔진으로 실시간 스트리밍 되는 CCTV 영상으로부터 작업자의 이상행동 패턴을 선별 적으로 탐지함과 동시에 영상 데이터, 환경 센서 데이터 등 서로 다른 이기종의 자료를 수집하여 상호 연관성과 상태, 임계치를 분석 처리한 후 작업자 위험 및 안전사고를 예측할 수 있도록 한 것이다. 아울러 본 발명은 딥러닝 서버 내 학습된 모델에 의하여 영상에서 곧바로 행동 패턴을 자동 식별함으로써 영상 을 수동적인 방식으로 관찰할 필요성이 줄어들어 비용 감소와 인력 오류 발생 가능성도 제거되고, 또한 유의미 한 선별적 영상만을 저장 관리하여 스토리지 인프라에 대한 비용 절감과 함께 실시간 행동 파악을 통해 빠른 대 응이 가능하고, 또한 이상행동 패턴을 추출함으로써 결과 예측이나 규정 준수를 보장하고, 작업패턴 분석을 통 한 작업패턴별 안전관리 환경 구축이 가능한 장점이 있다. 더하여 본 발명은 지하 공동구 실내공기 중 산소농도, 이산화탄소, 미세먼지, 휘발성 유기화합물 분석을 통한 공기질 측정 시스템을 개발한 것으로, 지하 공동구 전 구간을 레일형 이동체에 탑재되어 이동하면서 이산화탄소, 이산화질소, 아황산가스, 미세먼지, 석면, 휘발성 유기화합물(VOCs), 포름알데히드(CH2O), 라돈, 산소농도 등을 측정하여 전송하여 공기질을 분석하고 이를 통해 위험, 경고, 작업 가능 등 단계별 표시를 통하 여 작업자가 사전 확인 가능한 공기질 측정 시스템을 개발한 것이다. 산업상 이용가능성 본 발명 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템의 기술적 사상은 실제로 동일결과를 반복 실시 가능한 것으로, 특히 이와 같은 본원발명을 실시함으로써 기술발전을 촉진하여 산업발전에 이바지할 수 있어 보 호할 가치가 충분히 있다."}
{"patent_id": "10-2023-0040575", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명에 적용된 CCTV 레일 이동형 지하 공동구 작업자 안전관리 시스템의 전체 구성도. 도 2 는 본 발명 작업자 복장 유형을 판단한 사진. 도 3 은 본 발명 작업자 안전모 수칙 준수 여부 판단 사진."}
