{"patent_id": "10-2024-0044060", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0035998", "출원번호": "10-2024-0044060", "발명의 명칭": "비대면으로 야간뇨 질환의 증상 정도에 따라 치료군을 분류하는 방법 및 장치", "출원인": "순천향대학교 산학협력단", "발명자": "김재헌"}}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말을 통해 비대면으로 야간뇨 질환의 증상 정도에 따라 치료군을 분류하는 방법으로써,야간뇨 질환의 진단을 위한 검사 결과를 기초로 하여, 야간다뇨(NP; Nocturnal Polyuria), 하부요로증상(LUTS;Lower Urinary Tanct Symptom), 과민성 방광(OAB; Over Active Bladder), 수면무호흡증(OSA; ObstructiveSleep Apnea) 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공하는 단계;상기 진단 결과를 기초로 하여 상기 사용자를 제 1 차 치료군에 포함된 치료군으로 제 1 차 분류하는 단계;상기 사용자의 기본 건강 정보를 기초로 하여 상기 사용자를 제 2 차 치료군에 포함된 치료군으로 제 2 차 분류하는 단계; 및상기 제 1 차 분류 결과 및 상기 제 2 차 분류 결과를 기초로 하여 상기 사용자의 최종 치료군을 결정하는단계;를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 야간뇨 질환의 진단을 위한 검사는,과거 질환 병력에 관한 제 1 설문, 야간뇨 횟수에 대한 제 2 설문, 수면 질에 관한 제 3 설문, 과민성 방광에대한 제 4 설문, 전립선 증상에 관한 제 5 설문 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 야간뇨 질환의 진단을 위한 검사는,배뇨 일지를 포함하고,상기 배뇨 일지는,하루의 배뇨량, 배뇨 횟수 및 야간뇨 횟수에 대한 정보를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 야간뇨 질환의 진단을 위한 검사에 포함되는 설문은,상기 기본 건강 정보를 기초로 하여 결정되는 것인, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 제 1 차 분류하는 단계는,상기 사용자가 야간다뇨를 진단받은 경우, 야간다뇨 관련 약물의 처방 여부에 관한 정보를 기초로 하여 상기 제1 차 치료군에 포함된 치료군으로 상기 제 1 차 분류하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2025-0035998-3-제 1 항에 있어서,상기 기본 건강 정보는,당뇨 여부, 심장 질환 여부 및 비만 여부에 관한 정보 중 적어도 어느 하나를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 제 2 차 분류하는 단계는,운등 능력에 관한 검사의 결과를 기초로 하여 상기 제 2 차 치료군에 포함된 치료군으로 상기 제 2 차 분류하는단계;를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 방법은, 상기 결정된 최종 치료군에 기초하여 각각 다른 내용의 치료 방안을 제시하는 단계;를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 치료 방안은, 행동 요법 방안, 운동 요법 방안, 처방받은 약물에 대한 부작용 검진 설문 방안 및 내원 진료 제안 방안 중 적어도 어느 하나를 포함하는, 방법."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 따른 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체."}
{"patent_id": "10-2024-0044060", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "적어도 하나의 메모리; 및적어도 하나의 프로세서;를 포함하고,상기 적어도 하나의 프로세서는,야간뇨 질환의 진단을 위한 검사 결과를 기초로 하여, 야간다뇨(NP; Nocturnal Polyuria), 하부요로증상(LUTS;Lower Urinary Tanct Symptom), 과민성 방광(OAB; Over Active Bladder), 수면무호흡증(OSA; ObstructiveSleep Apnea) 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공하고, 상기 진단 결과를 기초로 하여 상기사용자를 제 1 차 치료군에 포함된 치료군으로 제 1 차 분류하고, 상기 사용자의 기본 건강 정보를 기초로 하여상기 사용자를 제 2 차 치료군에 포함된 치료군으로 제 2 차 분류하고, 상기 제 1 차 분류 결과 및 상기 제 2차 분류 결과를 기초로 하여 상기 사용자의 최종 치료군을 결정하는, 컴퓨팅 장치."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 비대면으로 야간뇨 질환의 증상 정도에 따라 치료군을 분류하는 방법 및 이에 관한 장치에 관한 것이다. 본 개시의 일 실시예에 따르면, 비대면으로 야간뇨 질환의 증상 정도에 따라 치료군을 분류하는 방법에 있어 서, 야간뇨 질환의 진단을 위한 검사 결과를 기초로 하여, 야간다뇨(NP; Nocturnal Polyuria), 하부요로증상 (LUTS; Lower Urinary Tanct Symptom), 과민성 방광(OAB; Over Active Bladder), 수면무호흡증(OSA; Obstructive Sleep Apnea) 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공하고, 상기 진단 결과를 기초로 하여 상기 사용자를 제 1 차 치료군에 포함된 치료군으로 제 1 차 분류하고, 상기 사용자의 기본 건강 정보를 기 초로 하여 상기 사용자를 제 2 차 치료군에 포함된 치료군으로 제 2 차 분류하고, 상기 제 1 차 분류 결과 및 상 기 제 2 차 분류 결과를 기초로 하여 상기 사용자의 최종 치료군을 결정할 수 있다."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 비대면으로 야간뇨 질환의 증상 정도에 따라 치료군을 분류하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "야간뇨(Nocturia)란, 수면 중에 소변 마려움으로 인해 기상 후 배뇨하는 것을 의미한다. 야간뇨는 반드시 소변 을 보기 전후에 수면이 동반되어야 하며, 수면 중에 무의식적으로 소변을 보는 야뇨증(Enuresis)과는 구별된다. 야간뇨는 60세 이상에서 약 70%가 경험하는 흔한 배뇨장애 질환 중 하나이다. 야간뇨의 환자수는 인구 고령화가 지속됨에 따라 증가하고 있는 실정이다. 연구 결과에 따르면 야간뇨가 다른 만성질환보다 노동 생산성은 24%, 여가 시간의 활동성은 34%나 떨어뜨리는 것으로 분석되었다는 점에서 야간뇨 질환은 일상 생활에 불편함을 주고 발병 빈도 또한 높다는 것을 알 수 있다. 야간뇨의 주요한 발생 원인으로는 야간에 소변량이 과도하게 많은 야간다뇨(NP; Nocturnal Polyuria), 잠을 깊 이 자지 못하는 수면 장애, 과민성 방광(OAB; Over Active Bladder)에 의한 방광 기능 이상 등을 들 수 있다. 이 중에서도 야간다뇨는 야간뇨 환자의 약 83%가 겪고 있기에 가장 흔한 원인으로 꼽힌다. 야간뇨의 치료 방안으로는 크게 행동요법과 약물요법으로 나뉜다. 행동요법으로는, 자기 전 배뇨를 하고, 저녁 이후에는 물 섭취 자제를 권고하는 요법이 있다. 또한, 약물요법으로는, 바소프레신의 합성 유사체인 데스모프 레신(Demopressin)이 사용된다. 상술한 내용을 참조하면, 야간뇨 질환은 일상 생활에 큰 어려움을 유발하는 만성질환으로써 야간뇨 질환을 가지 는 인구 또한 증가하고 있는 실정이다. 이에 따라, 야간뇨 질환을 내원 없이 비대면으로 진단하고 진단 결과에 따라 효율적인 치료 방안을 제시하는 방법의 개발에 대한 필요함이 요구되는 시점이다."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 비대면으로 야간뇨 질환의 증상 정도에 따라 치료군을 분류하는 방법 및 장치를 제공하는 데에 있다. 본 발명이 해결하고자 하는 과제는 이상에서 언급한 과제에 한정되지 않으며, 언급되지 않은 본 발명의 다른 과 제 및 장점들은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발명이 해결하고자 하는 과제 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 알 수 있을 것이다."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 개시의 제 1 측면은, 비대면으로 야간뇨 질환의 증 상 정도에 따라 치료군을 분류하는 방법에 있어서, 야간뇨 질환의 진단을 위한 검사 결과를 기초로 하여, 야간 다뇨(NP; Nocturnal Polyuria), 하부요로증상(LUTS; Lower Urinary Tract Symptom), 과민성 방광(OAB; Over Active Bladder), 수면무호흡증(OSA; Obstructive Sleep Apnea) 및 수면 장애 중 적어도 하나에 대한 진단 결 과를 제공하고, 상기 진단 결과를 기초로 하여 상기 사용자를 제 1 차 치료군에 포함된 치료군으로 제 1 차 분 류하고,상기 사용자의 기본 건강 정보를 기초로 하여 상기 사용자를 제 2 차 치료군에 포함된 치료군으로 제 2 차 분류하고, 상기 제 1 차 분류 결과 및 상기 제 2 차 분류 결과를 기초로 하여 상기 사용자의 최종 치료군을 결정할 수 있다. 본 개시의 제 2 측면은, 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 장치에 있어서, 적어도 하나의 메모리; 및 적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는, 야간뇨 질환의 진단을 위한 검사 결과를 기초로 하여, 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공하고, 상기 진단 결과를 기초로 하여 상기 사용자를 제 1 차 치료군에 포함된 치료군으로 제 1 차 분류하고,상기 사용자의 기본 건강 정보를 기초로 하여 상기 사용자를 제 2 차 치료군에 포함된 치료군 으로 제 2 차 분류하고, 상기 제 1 차 분류 결과 및 상기 제 2 차 분류 결과를 기초로 하여 상기 사용자의 최종 치료군을 결정할 수 있다. 본 개시의 제 3 측면은, 제 1 측면에 따른 방법을 컴퓨터에서 실행하기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공할 수 있다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램이 저장된 컴퓨터로 판독 가능한 기록매체가 더 제공될 수 있다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 개시의 과제 해결 수단에 의하면, 본 개시에서는 비대면으로 야간뇨 질환에 대한 진단 결과를 제공함 으로써, 사용자가 직접 내원하여 야간뇨를 진단받는 데에 소요되는 시간을 줄일 수 있다. 또한, 본 개시에서는 야간뇨 질환에 대한 진단 결과를 제공하기 전에 야간뇨와 관련된 다수의 질환들에 대한 위 험성을 평가하고 그 결과에 따라 내원 진료를 제안함으로써 사용자가 고위험도 질환의 발병을 사전에 방지할 수 있다. 또한, 본 개시에서는 야간뇨 질환에 대한 진단 결과로 다양한 치료군으로의 분류 결과를 제공함으로써, 정확한 진단 결과를 제공할 수 있다. 또한, 본 개시에서는 야간뇨 질환의 치료군마다 다른 치료 방안을 제시함으로써 효과적인 야간뇨 치료 방향을 제시할 수 있다."}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 발명은 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 발명의 개시가 완전하도록 하며, 본 발"}
{"patent_id": "10-2024-0044060", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다.본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시의 일부 실시예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블 록들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현 될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기술 을 채용할 수 있다. \"매커니즘\", \"요소\", \"수단\" 및 \"구성\" 등과 같은 용어는 넓게 사용될 수 있으며, 기계적이 고 물리적인 구성들로서 한정되는 것은 아니다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 이하 첨부된 도면을 참고하여 본 개시를 상세히 설명하기로 한다. 도 1은 일 실시예에 따른 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 방법을 설명하기 위한 개념도이 다. 도 1을 참조하면, 사용자 단말은 사용자에게 야간뇨 질환의 진단 결과 및 그에 따른 치료 방안(5 0)을 제공할 수 있다. 사용자는 사용자 단말에 사용자의 기본 건강 정보를 입력할 수 있다. 여기서, 기본 건강 정보 에는 사용자의 나이, 성별, 신장, 체중, 고혈압 여부, 당뇨 여부, 고지혈증 여부, 불안전 협심증 여부, 심근경색 여부, 심부전 여부, 흡연 여부, 음주 여부, 내과 약물 복용 여부, 비뇨의학과 약물 복용 여부 및 우울 감 여부에 관한 정보 중 적어도 하나가 포함될 수 있으나, 이에 한정되는 것은 아니다. 사용자 단말은 사용자로부터 입력된 기본 건강 정보를 기초로 하여 야간뇨 질환을 제외한 야간뇨 관련 질환의 위험성을 판단하기 위한 제 1 검사를 수행할 수 있다. 야간뇨 질환은 발병 비율이 60세 이상의 노인들에게 높다는 특성에 따라 여러 질환을 동반할 수 있다. 예를 들 어, 야간뇨 질환에 동반되는 질환에는 당뇨, 비만, 심장 질환 및 정신 질환 등이 포함될 수 있으나, 이에 한정 되는 것은 아니다. 야간뇨 질환에 동반되는 질환은 야간뇨 질환에 비하여 위험성이 높은 질환일 수 있기에, 야 간뇨 질환에 대한 진단에 앞서서 야간뇨 관련 질환에 대한 내원 진료를 제안할 필요성이 있다. 종래에는, 야간뇨 질환의 진단 과정에서 야간뇨 관련 질환의 발병 가능성에 대한 고려가 없었기에, 야간뇨 질환 에 동반되는 질환을 사전적으로 필터링할 수 없다는 문제점이 존재하였다. 그러나, 사용자 단말은 사용자가 기본 건강 정보를 기초로 하여 야간뇨 관련 질환의 발병 위험성 판단을 위한 제 1 검사를 수햄함으로써, 야간뇨 질환에 비해 위험도가 높은 질환을 가질 수 있는 사용자를 필터링 할 수 있다. 예를 들어, 사용자 단말은 제 1 검사의 결과가 비정상인 사용자에 대하여, 야간뇨 질환의 진단 결과 를 제공하지 않고 내원 진료를 받을 것을 제안할 수 있다. 또한, 사용자 단말은 내원 진료를 받고 난 후의 사용자에 대하여 야간뇨 질환에 대한 검사를 수행함으 로써 야간뇨 질환에 대한 진단 결과를 제공할 수 있다, 예를 들어, 의료진 단말은 내원 진료를 제안받은 사 용자에 대하여 내원 진료 후 사용자 단말에 진료 결과를 전송할 수 있다, 사용자 단말은 의료진 단 말로부터 전송받은 진료 결과를 기초로 하여, 사용자에 대하여 야간뇨 질환에 대한 검사를 수행할지 여부를 결정할 수 있다. 이를 통해, 사용자 단말은 내원 진료를 제안받은 사용자를 야간뇨 질환 진단 결과제공 과정에 재입적시킴으로써 효율적인 야간뇨 질환 진단 과정을 수행할 수 있다. 또한, 사용자 단말은 의료진 단말로부터 내원 진료에 대한 결과를 수신하지 않고, 사용자로부터 직접 내원 진료에 대한 결과를 입력 받을 수 있다. 구체적으로, 사용자는 사용자 단말로부터 제안받은 내원 진료 후 내원 진료에 대한 결과를 사용자 단말에 입력할 수 있다. 사용자 단말은 입력된 내원 진료에 대한 결과를 기초로 하여 사용자에 대하여 야간뇨 질환에 대한 검사를 수행할지 여부를 결정할 수 있다. 또한, 사용자 단말은 제 1 검사의 결과가 정상인 사용자에 대하여, 야간뇨 질환의 진단을 위한 제 2 검 사를 수행할 수 있다. 예를 들어, 제 2 검사에는 과거 질환 병력에 관한 제 1 설문, 야간뇨 횟수에 대한 제 2 설문, 수면 질에 관한 제 3 설문, 과민성 방광에 대한 제 4 설문, 전립선 증상에 관한 제 5 설문 및 배뇨 일지 중 적어도 하나가 포함 될 수 있으나, 이에 한정되는 것은 아니다. 사용자 단말은 제 2 검사의 결과를 기초로 하여 야간다뇨(NP; Nocturnal Polyuria), 하부요로증상(LUTS; Lower Urinary Tanct Symptom), 과민성 방광(OAB; Over Active Bladder), 수면무호흡증(OSA; Obstructive Sleep Apnea) 및 수면 장애 중 적어도 하나에 대한 진단 결과를 사용자에게 제공할 수 있다. 또한, 사용자 단말은 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애에 대한 진단 결과 를 기초로 하여, 야간뇨 질환의 증상 정도에 따라 치료군을 분류할 수 있다. 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애는 야간뇨 질환 발명의 주요 원인들에 해당된 다. 사용자 단말은 야간뇨 질환의 주요 원인에 대한 진단 결과를 통해 야간뇨 질환의 최종 진단 결과 를 제공하고, 이에 따른 치료 방안을 제시할 수 있다. 이를 통해, 사용자 단말은 다양한 원인에 의 해 발병하는 야간뇨 질환에 대해 발병 원인에 따라 서로 다른 치료 방안을 제시함으로써, 효율적인 야간뇨 질환의 치료를 수행할 수 있다. 예를 들어, 사용자 단말은 야간뇨 질환에 대한 최종 치료군을 사용자의 기본 건강 정보를 기초로 하여 분류된 제 1 차 분류 결과 및 사용자의 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애에 대한 진단 결과를 기초로 하여 분류된 제 2 차 분류 결과를 기초로 하여 결정할 수 있다. 도 2는 일 실시예에 따른 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 사용자 단말의 블록도이다. 도 2를 참조하면, 사용자 단말은 프로세서, 메모리 및 통신 모듈을 포함한다. 설명의 편의 를 위하여, 도 2에는 본 발명과 관련된 구성요소들만이 도시되어 있다. 따라서, 도 2에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 사용자 단말에 더 포함될 수 있다. 또한, 도 2에 도시된 프로세서, 메모 리, 입출력 인터페이스 및 통신 모듈은 독립된 장치로 구현될 수도 있음은 본 발명과 관련된 기 술 분야에서의 통상의 지식을 가진 자에게 자명하다. 여기서, 사용자 단말은 도 1의 사용자 단말과 동일한 장치일 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리할 수 있 다. 여기에서, 명령은 메모리 또는 외부 장치로부터 제공될 수 있다. 또한, 프로세서는 사용자 단말 에 포함된 다른 구성요소들의 동작을 전반적으로 제어할 수 있다. 예를 들어, 프로세서는 사용자의 기본 건강 정보를 기초로 하여 야간뇨 관련 질환의 발병 위험성 판단을 위한 제 1 검사를 수행할 수 있다. 제 1 검사의 결과가 비정상인 경우, 프로세서는 야간뇨 관련 질환의 치 료를 위한 내원 진료를 제안할 수 있다. 또한, 제 1 검사의 결과가 정상인 경우, 프로세서는 야간뇨 질환 의 진단을 위한 제 2 검사를 수행할 수 있다. 예를 들어, 제 2 검사에는 과거 질환 병력에 관한 제 1 설문, 야 간뇨 횟수에 대한 제 2 설문, 수면 질에 관한 제 3 설문, 과민성 방광에 대한 제 4 설문, 전립선 증상에 관한 제 5 설문 중 적어도 하나가 포함될 수 있다. 예를 들어, 프로세서는 사용자의 기본 건강 정보를 기초로 하여 제 2 검사에 포함되는 설문을 결정할 수 있다. 또한, 프로세서는 제 2 검사의 결과에 기초하여, 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공할 수 있다. 또한, 프로세서는 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나에 대 한 진단 결과 및 사용자의 기본 건강 정보 중 적어도 하나를 기초로 하여 야간뇨 질환의 증상 정도에 따라 치료 군을 분류할 수 있다.예를 들어, 프로세서는 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나 에 대한 진단 결과를 기초로 하여 사용자를 제 1 차 분류할 수 있다. 또한, 프로세서는 사용자의 기본 건 강 정보를 기초로 하여 사용자를 제 2 차 분류할 수 있다. 또한, 프로세서는 제 1 차 분류 결과 및 제 2 차 분류 결과를 기초로 하여 사용자의 야간뇨 질환 진단의 치료를 위한 최종 치료군을 결정할 수 있다. 예를 들어, 사용자 단말은 뉴럴 네트워크 모델을 이용하여 야간뇨 질환에 대한 진단 결과를 제공할 수 있 다. 예를 들어, 사용자 단말은 뉴럴 네트워크 모델의 입력 데이터로써 제 1 검사의 결과 및 제 2 검사의 결과를 이용하여 출력 데이터로써 야간뇨 질환에 대한 진단 결과를 이용하여 뉴럴 네트워크 모델을 학습시킬 수 있다. 또한, 사용자 단말은 학습된 뉴럴 네트워크 모델에 제 1 검사의 결과 및 제 2 검사의 결과를 입력하 여 야간뇨 질환의 진단 결과를 획득할 수 있다. 뉴럴 네트워크 모델은 기계학습 기술과 인지과학에서, 생물학적 신경망의 구조에 기초하여 구현된 통계학적 학 습 알고리즘 또는 그 알고리즘을 실행하는 구조를 의미한다. 예를 들어, 뉴럴 네트워크 모델은 생물학적 신경망에서와 같이 시냅스의 결합으로 네트워크를 형성한 인공 뉴런 인 노드(Node)들이 시냅스의 가중치를 반복적으로 조정하여, 특정 입력에 대응한 올바른 출력과 추론된 출력 사 이의 오차가 감소되도록 학습함으로써, 문제 해결 능력을 가지는 모델을 나타낼 수 있다. 예를 들어, 뉴럴 네트 워크 모델은 기계학습, 딥러닝 등의 인공지능 학습법에 사용되는 임의의 확률 모델, 뉴럴 네트워크 모델 등을 포함할 수 있다. 예를 들어, 뉴럴 네트워크 모델은 다층의 노드들과 이들 사이의 연결로 구성된 다층 퍼셉트론(MLP; Multilayer Perceptron)으로 구현될 수 있다. 본 실시예에 따른 뉴럴 네트워크 모델은 MLP를 포함하는 다양한 인공신경망 모델 구조들 중의 하나를 이용하여 구현될 수 있다. 예를 들어, 뉴럴 네트워크 모델은 외부로부터 입력 신호 또 는 데이터를 수신하는 입력층, 입력 데이터에 대응한 출력 신호 또는 데이터를 출력하는 출력층, 입력층과 출력 층 사이에 위치하며 입력층으로부터 신호를 받아 특성을 추출하여 출력층으로 전달하는 적어도 하나의 은닉층으 로 구성될 수 있다. 출력층은 은닉층으로부터 신호 또는 데이터를 수신하여 외부로 출력한다. 프로세서는 다수의 논리 게이트들의 어레이로 구현될 수도 있고, 범용적인 마이크로 프로세서와 이 마이크 로 프로세서에서 실행될 수 있는 프로그램이 저장된 메모리의 조합으로 구현될 수도 있다. 예를 들어, 프로세서 는 범용 프로세서, 중앙 처리 장치(CPU), 마이크로프로세서, 디지털 신호 프로세서(DSP), 제어기, 마이크 로제어기, 상태 머신 등을 포함할 수 있다. 일부 환경에서, 프로세서는 주문형 반도체(ASIC), 프로그램 가 능 로직 디바이스(PLD), 필드 프로그램 가능 게이트 어레이(FPGA) 등을 포함할 수도 있다. 예를 들어, 프로세서 는 디지털 신호 프로세서(DSP)와 마이크로프로세서의 조합, 복수의 마이크로프로세서들의 조합, 디지털 신 호 프로세서(DSP) 코어와 결합된 하나 이상의 마이크로프로세서들의 조합, 또는 임의의 다른 그러한 구성들의 조합과 같은 처리 디바이스들의 조합을 지칭할 수도 있다. 메모리는 비-일시적인 임의의 컴퓨터 판독 가능한 기록매체를 포함할 수 있다. 일 예로서, 메모리는 RAM(random access memory), ROM(read only memory), 디스크 드라이브, SSD(solid state drive), 플래시 메모 리(flash memory) 등과 같은 비소멸성 대용량 저장 장치(permanent mass storage device)를 포함할 수 있다. 다른 예로서, ROM, SSD, 플래시 메모리, 디스크 드라이브 등과 같은 비소멸성 대용량 저장 장치는 메모리와는 구분되는 별도의 영구 저장 장치일 수 있다. 또한, 메모리에는 운영체제(OS)와 적어도 하나의 프로그램 코 드(예를 들어, 도 3 내지 도 15를 참조하여 후술할 동작을 프로세서가 수행하기 위한 코드)가 저장될 수 있다. 예를 들어, 메모리는 사용자의 기본 건강 정보를 저장할 수 있다. 또한, 메모리는 각 치료군에 대한 치료 방안에 대한 정보를 저장할 수 있다. 이러한 소프트웨어 구성요소들은 메모리와는 별도의 컴퓨터에서 판독 가능한 기록매체로부터 로딩될 수 있 다. 이러한 별도의 컴퓨터에서 판독 가능한 기록매체는 사용자 단말에 직접 연결될 수 있는 기록 매체일 수 있고, 예를 들어, 플로피 드라이브, 디스크, 테이프, DVD/CD-ROM 드라이브, 메모리 카드 등의 입출력 컴퓨터 에서 판독 가능한 기록매체를 포함할 수 있다. 또는, 소프트웨어 구성요소들은 컴퓨터에서 판독 가능한 기록매 체가 아닌 통신 모듈을 통해 메모리에 로딩될 수도 있다. 예를 들어, 적어도 하나의 프로그램은 개발 자들 또는 어플리케이션의 설치 파일을 배포하는 파일 배포 시스템이 통신 모듈을 통해 제공하는 파일들에 의해 설치되는 컴퓨터 프로그램(예를 들어, 도 3 내지 도 15를 참조하여 후술할 동작을 프로세서가 수행하 기 위한 컴퓨터 프로그램 등)에 기반하여 메모리에 로딩될 수 있다.입출력 인터페이스는 사용자 단말과 연결되거나 사용자 단말에 포함될 수 있는 입력 및/또는 출 력을 위한 장치(예를 들어, 키보드, 마우스 등)와의 인터페이스를 위한 수단일 수 있다. 도 2에서는 입출력 인 터페이스가 프로세서와 별도로 구성된 요소로 도시되었으나, 이에 한정되지 않으며, 입출력 인터페이 스가 프로세서에 포함되도록 구성될 수도 있다. 예를 들어, 프로세서는 입출력 인터페이스(13 0)로부터 입력된 사용자의 기본 건강 정보를 기초로 하여 제 1 검사의 결과를 도출할 수 있다. 통신 모듈은 네트워크를 사용자 단말이 외부 디바이스(미도시)와 서로 통신하기 위한 구성 또는 기능 을 제공할 수 있다. 또한, 통신 모듈은 사용자 단말이 다른 외부 디바이스와 통신하기 위한 구성 또 는 기능을 제공할 수 있다. 예를 들어, 프로세서의 제어에 따라 제공되는 제어 신호, 명령, 데이터 등이 통신 모듈과 네트워크를 거쳐 외부 디바이스로 전송될 수 있다. 도 3은 일 실시예에 따른 사용자 단말 및 외부 장치를 포함하는 시스템의 예시적인 구성도이다. 도 3을 참조하면, 사용자 단말은 인공지능 서비스를 제공할 수 있는 웹 및/또는 앱을 관리하는 모든 종류 의 서버를 포함할 수 있다. 또한, 도 3의 사용자 단말은 도 1 의 사용자 단말 및/또는 도 2의 사용자 단말과 동일한 장치일 수 있다. 외부 장치는 정보를 제공할 수 있는 웹 서비스 API를 관리하는 서버를 포함할 수 있으나, 이에 한정되지는 않는다. 예를 들어, 외부 장치는 사용자 단말에 사용자의 내원 진료 결과를 송신하는 의료진 단말에 해당될 수 있다. 예를 들어, 사용자 단말은 외부 장치로부터 수신한 사용자의 내원 진료 결과를 기초로 하여, 야간뇨 질환의 진단을 위한 제 2 검사를 수행할지 여부에 대해 결정할 수 있다. 이를 통해, 사용자 단말은 내원 진료를 제안 받은 사용자를 야간뇨 진단 과정에 재입적 시킴으로써 효율적인 진단 결과 제공을 수행할 수 있다. 사용자 단말 및 외부 장치는 상호간 및/또는 다른 디바이스와 네트워크를 통하여 통신할 수 있다. 네 트워크는 서로 다른 주체들이 서로 원활하게 통신을 할 수 있도록 하는 포괄적인 의미의 데이터 통신망이며, 유 선 인터넷, 무선 인터넷 및 모바일 무선 통신망을 포함할 수 있다. 예를 들어, 네트워크는 근거리 통신망(LAN; Local Area Network), 광역 통신망(WAN; Wide Area Network), 부가가치 통신망(VAN; Value Added Network), 이 동 통신망(mobile radio communication network), 위성 통신망 및 이들의 상호 조합을 포함할 수 있다. 또한, 무선 통신은 예를 들어, 무선 랜(Wi-Fi), 블루투스, 저전력 블루투스(Bluetooth Low energy), 지그비(ZigBee), WFD(Wi-Fi Direct), UWB(ultrawideband), 적외선 통신(IrDA; Infrared Data Association), NFC(Near Field Communication) 등이 있을 수 있으나, 이에 한정되는 것은 아니다. 사용자 단말은 외부 장치와 네트워크를 통하여 통신을 수행할 수 있다. 사용자 단말은 네트워크 를 통하여 통신을 수행함으로써 외부 장치로부터 사용자의 내원 진료 결과를 수신할 수 있고, 제 2 검사의 수행 여부를 결정할 수 있다. 도 4는 일 실시예에 따른 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 방법을 설명하기 위한 흐름도이 다. 도 4를 참조하면, 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 방법은 도 2에 도시된 사용자 단말 및/또는 프로세서에서 시계열적으로 처리되는 단계들로 구성된다. 따라서, 이하에서 생략된 내용이 라고 하더라도 도 2에 도시된 사용자 단말 또는 프로세서에 관하여 이상에서 기술된 내용은 도 4의 야간뇨 질환에 대한 진단 결과를 제공하는 방법에도 적용될 수 있다. 단계 410에서, 사용자 단말은 사용자의 기본 건강 정보를 기초로 하여 야간뇨 관련 질환의 발병 위험성의 판단 을 위한 제 1 검사를 수행할 수 있다. 예를 들어, 기본 건강 정보는 사용자의 나이, 성별, 신장, 체중, 고혈압 여부, 당뇨 여부, 고지혈증 여부, 불안 전 협심증 여부, 심근경색 여부, 심부전 여부, 흡연 여부, 음주 여부, 내과 약물 복용 여부, 비뇨의학과 약물 복용 여부 및 우울감 여부에 관한 정보 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 제 1 검사는 폐경 증상의 여부를 판단하는 제 1-1 검사, 심장 질환 여부를 판단하는 제 1-2 검사, 당뇨 질환의 여부를 판단하는 제 1-3 검사, 비뇨의학과 약물의 복용 여부를 판단하는 제 1-4 검사 및 우울 척도 와 관련된 제 3 검사 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 사용자 단말은 제 1 검사에 포함된 제 1-1 검사 내지 제 1-4 검사 및 제 3 검사 중 적어도 어느 하 나의 검사의 결과가 비정상에 해당되는 경우, 제 1 검사의 결과를 비정상으로 결정할 수 있다. 또한, 사용자 단 말은 제 1 검사에 포함된 검사 중 모든 검사의 결과가 정상에 해당되는 경우, 제 1 검사의 결과를 정상으로 결 정할 수 있다. 제 1 검사에 포함된 각각 검사의 정상 및 비정상 여부를 판단하는 방법은 이하 도 6에서 자세하게 설명한다. 단계 420에서, 사용자 단말은 제 1 검사의 결과가 정상인 경우, 야간뇨 질환의 진단을 위한 제 2 검사를 수행할 수 있다. 예를 들어, 제 2 검사는 과거 질환 병력에 관한 제 1 설문, 야간뇨 횟수에 대한 제 2 설문, 수면 질에 대한 제 3 설문, 과민성 방광에 대한 제 4 설문, 전립선 증상에 대한 제 5 설문 및 배뇨 일지 중 적어도 하나를 포함할 수 있다. 또한, 사용자 단말은 사용자의 기본 건강 정보를 기초로 하여 제 1 설문 내지 제 4 설문 중 제 2 검사에 포함되 는 설문을 결정할 수 있다. 예를 들어, 사용자 단말은 사용자의 기본 건강 정보에 포함된 사용자의 성별에 대한 정보를 기초로 하여 제 5 설문을 제 2 검사에 포함시킬지 여부를 결정할 수 있다. 예를 들어, 사용자가 여성인 경우, 사용자 단말은 제 5 설문을 제 2 검사에서 제외할 수 있다. 이를 통해, 사용자 단말은 효율적인 야간뇨 질환의 진단 결과 제공을 수행할 수 있다. 단계 430에서, 사용자 단말은 제 2 검사의 결과를 기초로 하여, 야간다뇨, 하부요로증상, 과민성 방광, 수면무 호흡증 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공할 수 있다. 예를 들어, 사용자 단말은 야간뇨 횟수에 대한 제 2 설문 및 배뇨 일지의 결과를 기초로 하여 야간다뇨에 대한 진단 결과를 제공할 수 있다. 또한, 사용자 단말은 수면 질에 대한 제 3 설문의 결과를 기초로 하여 수면무호흡 증 및 수면 장애에 대한 진단 결과를 제공할 수 있다. 또한, 사용자 단말은 과민성 방광에 대한 제 4 설문의 결 과를 기초로 하여 과민성 방광에 대한 진단 결과를 제공할 수 있다. 또한, 사용자 단말은 전립선 증상에 대한 제 5 설문의 결과를 기초로 하여 하부요로증상에 대한 진단 결과를 제공할 수 있다. 단계 440에서, 사용자 단말은 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하 나에 대한 진단 결과 및 상기 기본 건강 정보 중 적어도 하나를 기초로 하여 야간뇨 질환의 증상 정도에 따른 치료군을 분류할 수 있다. 예를 들어, 사용자 단말은 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나에 대한 진단 결과 및 상기 기본 건강 정보 외에 운동 능력에 관한 제 4 검사에 대한 결과를 추가로 이용하여 야간 뇨 질환의 증상 정도에 따른 치료군을 분류 여부를 결정할 수 있다. 구체적으로, 사용자 단말은 제 4 검사의 결과가 정상인 경우, 야간뇨 질환의 증상 정도에 따른 치료군을 분류할 수 있다. 또한, 사용자 단말은 제 4 검사의 결과가 비정상인 경우, 야간뇨 질환의 증상 정도에 따른 치료군을 분류하지 않고 심장내과의 진료를 제안할 수 있다. 또한, 사용자 단말은 사용자의 기본 건강 정보에 기초하여 사용자가 고혈압을 보유하고 있다고 판단한 경우, 사 용자로부터 심장내과 내원 진료에 대한 결과를 입력받을 수 있다. 사용자 단말은 사용자로부터 입력받은 심장내 과 내원 진료에 대한 결과를 통해 혈압이 안정적이라 판단한 경우, 제 4 검사를 수행하지 않고 야간뇨 질환의 증상 정도에 따른 치료군을 분류할 수 있다. 예를 들어, 사용자 단말은 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나에 대한 진단 결과를 기초로 하여 사용자를 제 1 차 분류할 수 있다. 또한, 사용자 단말은 사용자의 기본 건강 정 보를 기초로 하여 사용자를 제 2 차 분류할 수 있다. 또한, 사용자 단말은 제 1 차 분류 결과 및 제 2 차 분류 결과를 기초로 하여 사용자의 최종 치료군을 결정할 수 있다. 도 5는 일 실시예에 따른 야간뇨 질환의 증상 정도에 따라 세부 치료군으로 분류하는 방법을 설명하기 위한 흐 름도이다. 도 5를 참조하면, 야간뇨 질환의 증상 정도에 따라 세부 치료군으로 분류하는 방법은 도 2에 도시된 사용자 단 말 및/또는 프로세서에서 시계열적으로 처리되는 단계들로 구성된다. 따라서, 이하에서 생략된 내용 이라고 하더라도 도 2에 도시된 사용자 단말 또는 프로세서에 관하여 이상에서 기술된 내용은 도 5의 야간뇨 질환의 증상 정도에 따라 세부 치료군으로 분류하는 방법에도 적용될 수 있다.단계 510에서, 사용자 단말은 야간뇨 질환의 진단을 위한 검사 결과를 기초로 하여, 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하나에 대한 진단 결과를 제공할 수 있다. 여기서, 단계 510은 도 4의 단계 430과 동일한 단계일 수 있다. 단계 520에서, 사용자 단말은 야간다뇨, 하부요로증상, 과민성 방광, 수면무호흡증 및 수면 장애 중 적어도 하 나에 대한 진단 결과를 기초로 하여 사용자를 제 1 차 치료군에 포함된 치료군으로 제 1 차 분류할 수 있다. 예를 들어, 제 1 차 치료군은 사용자의 야간다뇨의 여부, 하부요로증상의 여부, 과민성 방광의 여부, 수면무호 흡증의 여부 및 수면 장애의 여부를 기초로 한 제 1-1 치료군 내지 제 1-18 치료군을 포함할 수 있다. 제 1 차 치료군에 포함된 치료군에 대해서는 이하 도 14에서 자세하게 설명한다. 단계 530에서, 사용자 단말은 사용자의 기본 건강 정보를 기초로 하여 상기 사용자를 제 2 차 치료군에 포함된 치료군으로 제 2 차 분류할 수 있다. 예를 들어, 제 2 차 치료군은 사용자의 비만 여부, 당뇨 여부 및 심장질환 여부를 기초로 한 제 2-1 치료군 내 지 제 2-8 치료군을 포함할 수 있다. 제 2 차 치료군에 포함된 치료군에 대해서는 이하 도 15에서 자세하게 설명한다. 단계 540에서, 사용자 단말은 제 1 차 분류 결과 및 상기 제 2 차 분류 결과를 기초로 하여 상기 사용자의 최종 치료군을 결정할 수 있다. 도 6은 일 실시예에 따른 제 1 검사의 결과를 정상 및 비정상으로 분류하는 방법을 설명하기 위한 개념도이다. 도 6을 참조하면, 사용자는 사용자 단말에 사용자의 기본 건강 정보를 입력할 수 있다. 또한, 사용자 단말은 입력된 사용자의 기본 건강 정보를 기초로 하여 제 1 검사를 수행할 수 있다. 예를 들어, 기본 건강 정보는 사용자의 나이, 성별, 신장, 체중, 고혈압 여부, 당뇨 여부, 고지혈증 여부, 불안전 협심증 여부, 심근경색 여부, 심부전 여부, 흡연 여부, 음주 여부, 내과 약물 복용 여부, 비뇨의 학과 약물 복용 여부 및 우울감 여부에 관한 정보 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아 니다. 또한, 제 1 검사는 폐경 증상의 여부를 판단하는 제 1-1 검사, 심장 질환 여부를 판단하는 제 1-2 검사, 당뇨 질환의 여부를 판단하는 제 1-3 검사, 비뇨의학과 약물의 복용 여부를 판단하는 제 1-4 검사 및 우울 척도 와 관련된 제 3 검사 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 사용자 단말은 기본 건강 정보 중 사용자의 나이, 성별, 안면 홍조의 여부, 발한 여 부, 불면증 여부 및 우울증 여부를 기초로 하여 제 1-1 검사의 결과를 결정할 수 있다. 예를 들어, 사용자 단말은 50세 이상의 여성이 안면 홍조, 발한, 불면증, 우울증 중 적어도 2개 이상에 해 당되는 경우, 제 1-1 검사의 결과를 비정상으로 결정할 수 있다. 또한, 사용자 단말은 사용자의 기본 건강 정보 중 심혈관 위험 인자 중 적어도 3개 이상에 해당 되는지 여부, 불안전 협심증 여부, 심근경색 여부, 심부전 여부 및 혈관 질환의 여부를 기초로 하여 제 1-2 검 사의 결과를 결정할 수 있다. 여기서, 심혈관 위험 인자에는 과체중, 고혈압, 당뇨, 흡연 및 고지혈증이 포함될 수 있으나, 이에 한정되는 것은 아니다. 또한, 혈관 질환에는 뇌경색, 말초혈관질환, 심장근육 질환 및 심장판 막 질환이 포함될 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 사용자 단말은 사용자가 심혈관 위험 인자 중 적어도 3개 이상에 해당되거나, 불안전 협 심증을 보유하고 있거나, 심근경색의 과거력이 있거나, 심부전을 보유하고 있거나, 혈관질환을 보유하고 있는 경우, 제 1-2 검사의 결과를 비정상으로 결정할 수 있다. 또한, 사용자 단말은 사용자의 기본 건강 정보 중 당뇨 질환의 여부를 기초로 하여 제 1-3 검사 의 결과를 결정할 수 있다. 예를 들어, 사용자 단말은 사용자가 당뇨 질환을 보유하고 있고, 내과 약물 복용을 통한 당뇨 질환의 조절이 불가한 경우, 제 1-3 검사의 결과를 비정상으로 결정할 수 있다.또한, 사용자 단말은 사용자의 기본 건강 정보 중 비뇨의학과 약물의 복용 여부를 기초로 하여 제 1-4 검사의 결과를 결정할 수 있다. 예를 들어, 사용자 단말은 사용자가 비뇨의학과 약물 중 데모프레신(Demopressin)을 복용하고 있는 경우, 제 1-4 검사의 결과를 비정상으로 결정할 수 있다. 또한, 사용자 단말은 사용자의 기본 건강 정보 중 우울감 여부에 관한 정보를 기초로 하여 제 3 검사의 결과를 결정할 수 있다. 예를 들어, 사용자 단말은 제 3 검사의 결과가 제 1 임계값 이상인 경우, 사용자 단말은 제 3 검사의 결과를 비정상으로 결정할 수 있다. 예를 들어, 사용자 단말은 제 1 검사에 포함된 제 1-1 검사 내지 제 1-4 검사 및 제 3 검사 중 적어 도 어느 하나의 검사의 결과가 비정상에 해당되는 경우, 제 1 검사의 결과를 비정상으로 결정할 수 있다. 또한, 사용자 단말은 제 1 검사에 포함된 검사 중 모든 검사의 결과가 정상에 해당되는 경우, 제 1 검사의 결과를 정상으로 결정할 수 있다. 예를 들어, 사용자 단말은 제 1 검사의 결과가 정상인 경우, 야간뇨 질환에 관련된 제 2 검사를 수행할 수 있다. 또한, 사용자 단말은 제 1 검사의 결과가 비정상인 경우, 사용자에게 내원 진 료를 제안할 수 있다. 종래에는, 야간뇨 질환의 진단 과정에서 야간뇨 질환이 폐경, 당뇨, 심장 질환과 같은 관련 질환을 동반할 가능 성이 높다는 특성을 고려하지 않고 야간뇨만을 진단하였다. 그러나, 사용자 단말은 야간뇨 질환에 비해 위험도가 높은 야간뇨 관련 질환을 야간뇨 질환의 진단 결과 제공에 앞서 위험성을 판단함으로써, 사용자에게 우선적으로 내원 진료를 제안할 수 있다. 도 7은 일 실시예에 따른 제 1 검사의 결과에 따라 내원 진료를 제안하는 과정을 설명하기 위한 개념도이다. 도 7은 일 실시예에 따른 제 1 검사의 결과에 따라 내원 진료를 제안하는 과정을 설명하기 위한 개념도이 다. 도 7을 참조하면, 사용자 단말은 사용자의 기본 건강 정보를 기초로 하여 제 1 검사를 수행할 수 있 다. 또한, 사용자 단말은 제 1 검사의 결과가 비정상인 경우, 사용자 단말은 사용자에게 내원 진료를 제안할 수 있다. 예를 들어, 사용자 단말은 제 1-1 검사의 결과가 비정상인 경우, 부인과 진료를 제안할 수 있다. 또 한, 사용자 단말은 의료진 단말로부터 부인과 진료에 대한 진료 결과를 수신하여 야간뇨 질환에 관련된 제 2 검사의 수행 여부를 결정할 수 있다. 예를 들어, 수신한 진료 결과에 야간뇨가 지속된다는 결과가 포함된 경 우, 사용자 단말은 제 2 검사를 수행하는 것으로 결정할 수 있다. 또한, 사용자 단말은 의료진 단말로부터 부인과 진료에 대한 진료 결과를 수신하지 않고, 사용자로부터 직 접 부인과 진료에 대한 결과를 입력 받을 수 있다. 또한, 사용자 단말은 사용자로부터 입력된 부인과 진료 에 대한 진료 결과를 통해 제 2 검사의 수행 여부를 결정할 수 있다. 또한, 사용자 단말은 제 1-2 검사의 결과가 비정상인 경우, 심장내과 진료를 제안할 수 있다. 또한, 사용자 단말은 의료진 단말로부터 심장내과 진료에 대한 진료 결과를 수신하여 야간뇨 질환에 관련된 제 2 검사의 수행 여부를 결정할 수 있다. 예를 들어, 수신한 진료 결과에 심장 질환이 조절된다는 결과가 포함된 경 우, 사용자 단말은 제 2 검사를 수행하는 것으로 결정할 수 있다. 또한, 사용자 단말은 의료진 단말로부터 심장내과 진료에 대한 진료 결과를 수신하지 않고, 사용자로부터 직접 심장내과 진료에 대한 결과를 입력 받을 수 있다. 또한, 사용자 단말은 사용자로부터 입력된 심장내 과 진료에 대한 진료 결과를 통해 제 2 검사의 수행 여부를 결정할 수 있다. 또한, 사용자 단말은 제 1-3 검사의 결과가 비정상인 경우, 내분비내과의 진료를 제안할 수 있다. 또 한, 사용자 단말은 의료진 단말로부터 내분비내과 진료에 대한 진료 결과를 수신하여 야간뇨 질환에 관련 된 제 2 검사의 수행 여부를 결정할 수 있다. 예를 들어, 수신한 진료 결과에 당뇨 질환이 조절된다는 결과가 포함된 경우, 사용자 단말은 제 2 검사를 수행하는 것으로 결정할 수 있다. 또한, 사용자 단말은 의료진 단말로부터 내분비내과 진료에 대한 진료 결과를 수신하지 않고, 사용자로부 터 직접 내분비내과 진료에 대한 결과를 입력 받을 수 있다. 또한, 사용자 단말은 사용자로부터 입력된 내 분비내과 진료에 대한 진료 결과를 통해 제 2 검사의 수행 여부를 결정할 수 있다. 또한, 사용자 단말은 제 1-4 검사의 결과가 비정상인 경우, 비뇨의학과의 진료를 제안할 수 있다. 또 한, 사용자 단말은 의료진 단말로부터 비뇨의학과 진료에 대한 진료 결과를 수신하여 야간뇨 질환에 관련 된 제 2 검사의 수행 여부를 결정할 수 있다. 또한, 사용자 단말은 의료진 단말로부터 비뇨의학과 진료에 대한 진료 결과를 수신하지 않고, 사용자로부 터 직접 비뇨의학과 진료에 대한 결과를 입력 받을 수 있다. 또한, 사용자 단말은 사용자로부터 입력된 비 뇨의학과 진료에 대한 진료 결과를 통해 제 2 검사의 수행 여부를 결정할 수 있다. 또한, 사용자 단말은 제 3 검사의 결과가 비정상인 경우, 정신건강의학과 진료를 제안할 수 있다. 또 한, 또한, 사용자 단말은 의료진 단말로부터 정신건강의학과 진료에 대한 진료 결과를 수신하여 야간뇨 질 환에 관련된 제 2 검사의 수행 여부를 결정할 수 있다. 예를 들어, 제 3 검사는 우울 정도 자가 진단 검사(CES-D; Center for Epidemiological Studies-Depression scale)에 해당될 수 있다. 예를 들어, 우울 정도 자가 진단 검사의 결과가 제 1 임계값 이상에 해당되는 경우, 사용자 단말은 정신건강의학과 진료를 제안할 수 있다. 또한, 우울 정도 자가 진단 검사의 결과가 제 2 임 계값 이상 제 1 임계값 미만에 해당되는 경우, 사용자 단말은 야간뇨 질환의 치료가 시작된 후 소정의 기 간을 간격으로 제 3 검사를 다시 수행할 수 있다. 사용자 단말은 내원 진료 결과를 수신하여 야간뇨 질환의 진단 과정 재수행 여부를 결정함으로써 효율적으 로 진단 결과를 제공할 수 있다. 도 8a는 일 실시예에 따른 제 2 검사에 포함된 수면 장애에 대한 진단 결과를 제공하기 위한 제 3 설문을 설명 하기 위한 예시적인 도면이다. 도 8b는 일 실시예에 따른 제 2 검사에 포함된 수면무호흡증에 대한 진단 결과를 제공하기 위한 제 3 설문을 설 명하기 위한 예시적인 도면이다. 도 8a를 참조하면, 이미지는 제 2 검사에 포함된 수면 장애에 대한 진단 결과를 제공하기 위한 제 3 설문 에 해당된다. 도 8b를 참조하면, 이미지는 제 2 검사에 포함된 수면무호흡증에 대한 진단 결과를 제공하기 위한 제 3 설 문에 해당된다. 예를 들어, 사용자 단말은 야간뇨 질환의 진단을 위한 제 2 검사를 수행할 수 있다. 예를 들어, 제 2 검사는 과 거 질환 병력에 관한 제 1 설문, 야간뇨 횟수에 대한 제 2 설문, 수면 질에 대한 제 3 설문, 과민성 방광에 대 한 제 4 설문, 전립선 증상에 대한 제 5 설문 및 배뇨 일지 중 적어도 하나를 포함할 수 있다. 예를 들어, 과거 질환 병력에 관한 제 1 설문은 정신 질환의 과거력을 묻는 설문, 뇌혈관 질환 및 중추신경계 질환의 과거력을 묻는 설문, 복부 수술 및 항암 치료의 과거력을 묻는 설문 및 신장 및 간 질환의 과거력을 묻 는 설문 중 적어도 하나를 포함할 수 있다. 예를 들어, 사용자 단말은 사용자가 상술한 질환 중 적어도 하나의 질환에 대한 과거력을 보유하고 있는 경우, 내원 진료를 제안할 수 있다. 또한, 야간뇨 횟수에 대한 제 2 설문은 나이에 대한 설문, 하루의 야간뇨 횟수에 대한 설문, 야간뇨로 인한 삶 의 질(QoL; Quality of Life)에 대한 설문, 취침 시각 및 수면 시간에 대한 설문, 야간뇨 이후 수면에 드는 데 에 어려움이 있는지에 대한 설문 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 사용자 단말은 제 2 설문의 결과를 기초로 하여 야간다뇨에 대한 진단 결과를 제공할 수 있다. 예를 들어, 사용자 단말의 제 2 설문의 분석 결과, 사용자의 나이가 65세 미만이고 전체 배뇨량 중 야간뇨의 배뇨량 이 20%를 초과하는 경우, 사용자 단말은 사용자가 야간다뇨를 보유하고 있다는 진단 결과를 제공할 수 있다. 또 한, 사용자의 나이가 65세 이상이고 전체 배뇨량 중 야간뇨의 배뇨량이 33%를 초과하는 경우, 사용자 단말은 사 용자가 야간다뇨를 보유하고 있다는 진단 결과를 제공할 수 있다. 또한, 이미지를 참조하면, 수면 질에 대한 제 3 설문은 수면 장애에 대한 진단 결과를 제공하기 위한 불면 증 심각도 지수에 대한 설문(ISS; Insomnia Severity Scale)에 해당될 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 제 3 설문은 불면증에 관련된 7개의 설문을 포함할 수 있다. 사용자 단말은 각각의 설문에 대한 값 을 총합하여 제 3 설문의 결과를 도출할 수 있다. 예를 들어, 제 3 설문의 결과가 소정의 임계값 이상인 경우, 사용자 단말은 사용자가 수면 장애를 보유하고 있다는 진단 결과를 제공할 수 있다. 또한, 이미지를 참조하면, 수면 질에 대한 제 3 설문은 수면무호흡증에 대한 진단 결과를 제공하기 위한 STOP BANG 설문에 해당될 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 제 3 설문은 수면무호흡증에 관련된 8개의 설문을 포함할 수 있다. 사용자 단말은 각각의 설문에 대 한 값을 총합하여 제 3 설문의 결과를 도출할 수 있다. 예를 들어, 제 3 설문의 결과가 소정의 임계값 이상인 경우, 사용자 단말은 사용자가 수면무호흡증을 보유하고 있다는 진단 결과를 제공할 수 있다. 도 9는 일 실시예에 따른 제 2 검사에 포함된 제 4 설문을 설명하기 위한 예시적인 도면이다. 도 9를 참조하면, 이미지는 제 2 검사에 포함된 과민성 방광에 대한 제 4 설문에 해당된다. 이미지를 참조하면, 과민성 방광에 대한 제 4 설문은 과민성 방광 증상 점수 설문지(OABSS; Over Active Bladder Symptom Score)에 해당될 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 제 4 설문은 과민성 방광을 판단하기 위한 4개의 설문을 포함할 수 있다. 사용자 단말은 각각의 설 문에 대한 값을 총합하여 제 4 설문의 결과를 도출할 수 있다. 예를 들어, 제 4 설문의 결과가 소정의 임계값 이상인 경우, 사용자 단말은 사용자가 과민성 방광을 보유하고 있다는 진단 결과를 제공할 수 있다. 도 10은 일 실시예에 따른 제 2 검사에 포함된 제 5 설문을 설명하기 위한 예시적인 도면이다. 도 10을 참조하면, 이미지는 제 2 검사에 포함된 전립선 증상에 대한 제 5 설문에 해당된다. 이미지를 참조하면, 전립선 증상에 대한 제 5 설문은 국제 전립선 증상 점수표(IPSS; International Prostate Symptom Score)에 해당될 수 있으나, 이에 한정되는 것은 아니다. 예를 들어, 제 5 설문은 하부요로증상을 판단하기 위한 7개의 설문을 포함할 수 있다. 사용자 단말은 각각의 설 문에 대한 값을 총합하여 제 5 설문의 결과를 도출할 수 있다. 예를 들어, 제 5 설문의 결과가 소정의 임계값 이상인 경우, 사용자 단말은 사용자가 하부요로증상을 보유하고 있다는 진단 결과를 제공할 수 있다. 도 11은 일 실시예에 따른 배뇨 일지를 설명하기 위한 예시적인 도면이다. 도 11을 참조하면, 이미지는 제 2 검사에 포함된 배뇨 일지에 해당된다. 이미지를 참조하면, 사용자 단말은 제 2 설문뿐만 아니라 배뇨일지의 결과를 기초로 하여 야간다뇨에 대 한 진단 결과를 제공할 수 있다. 예를 들어, 배뇨 일지에는 하루 총 배뇨 횟수, 하루 총 배뇨량 및 야간 시간대의 배뇨 여부 및 배뇨량에 대한 정보가 포함될 수 있다. 예를 들어, 사용자 단말은 1시간 단위로 사용자의 배뇨량에 대한 정보를 획득할 수 있으나, 이에 한정되는 것은 아니다. 사용자 단말은 10분 단위로 사용자의 배뇨량에 대한 정보를 획득할 수 있다. 예를 들어, 사용자 단말은 하루 총 배뇨량 중 야간 시간대의 배뇨량이 차지하는 비율(NPi; Nocturnal Polyuira index)가 소정의 임계값 이상인 경우, 사용자가 야간다뇨를 보유하고 있다는 진단 결과를 제공할 수 있다. 예를 들어, NPi의 값이 20% 이상인 경우, 사용자 단말은 사용자가 야간다뇨를 보유하고 있다는 진단 결과를 제공할 수 있다. 도 12는 일 실시예에 따른 사용자의 기본 건강 정보를 기초로 하여 제 2 검사에 포함되는 설문을 결정하는 방법 을 설명하기 위한 예시적인 도면이다. 도 12를 참조하면, 표는 사용자의 기본 건강 정보를 기초로 하여 수행되는 설문에 대한 정보를 나타낸다. 표를 참조하면, 사용자 단말은 사용자의 기본 건강 정보에 포함된 사용자의 성별에 대한 정보를 기초로 하여 제 2 검사에 포함되는 설문을 결정할 수 있다. 예를 들어, 사용자 단말은 사용자의 성별이 남성인 경우, 과민성 방광에 대한 제 4 설문을 제 2 검사에 포함시 키지 않을 수 있다. 또한, 사용자 단말은 사용자의 성별이 여성인 경우, 전립선 증상에 대한 제 5 설문을 제 2 검사에 포함시키지 않을 수 있다. 이를 통해, 사용자 단말은 사용자의 기본 건강 정보에 상관 없이 모든 설문을 제 2 검사에 포함시켜 수행하지 않고, 야간뇨 질환의 진단을 위해 필요한 설문만을 제 2 검사에 포함시킴으로써 야간뇨 질환의 진단 결과 제공 에 소요되는 시간을 줄일 수 있다. 도 13은 일 실시예에 따른 제 2 검사의 결과에 따라 내원 진료를 제안하는 과정을 설명하기 위한 개념도이다. 도 13을 참조하면, 사용자 단말은 야간뇨 질환의 진단을 위한 제 2 검사를 수행할 수 있다. 또한, 사용자 단말은 제 2 검사의 결과를 기초로 하여 내원 진료를 제안할 수 있다. 예를 들어, 사용자 단말은 과거 질환 병력에 관한 제 1 설문의 결과에 따라 사용자가 정신 질환, 뇌혈관 질환, 중추신경계 질환, 복부 수술, 항암 치료 및 신장 및 간 질환의 과거력이 있는 경우 내과 진료를 제안 할 수 있다. 또한, 사용자 단말은 수면 질에 대한 제 3 설문의 결과가 소정의 임계값 이상인 경우 수면의학과 진료를 제안할 수 있다. 또한, 사용자 단말은 과민성 방광에 대한 제 4 설문의 결과가 소정의 임계값 이상인 경우 비뇨의학과 진 료를 제안할 수 있다. 또한, 사용자 단말은 전립선 증상에 대한 제 5 설문의 결과가 소정의 임계값 이상인 경우 비뇨의학과 진 료를 제안할 수 있다. 또한, 사용자 단말은 배뇨 일지의 결과 중 하루의 총 소변량이 전일에 비하여 소정의 임계값 이상 감소한 경우 신장내과 진료를 제안할 수 있다. 이를 통해, 사용자 단말은 제 2 검사의 결과에 기초하여, 비대면으로 야간뇨 질환에 대한 질단 결 과를 제공하기에는 수면 장애와 같은 야간뇨 관련 질환의 위험도가 높다고 판단되는 경우, 내원 진료를 제안하 여 효율적인 치료를 수행할 수 있다. 도 14는 일 실시예에 따른 제 1 차 치료군에 포함된 치료군을 설명하기 위한 예시적인 도면이다. 도 14를 참조하면, 표는 제 1 차 치료군에 포함된 치료군을 나타낸 표에 해당한다. 예를 들어, 사용자 단말은 야간다뇨의 여부에 따라 치료군을 나눌 수 있다. 또한, 사용자 단말은 야간다뇨를 진 단받은 사용자의 경우, 야간다뇨 관련 약물의 처방 여부에 따라 치료군을 나눌 수 있다. 예를 들어, 사용자 단 말은 야간다뇨를 진단받은 사용자의 경우, 데모프레신(Demopressin)의 처방 여부에 따라 치료군을 다시 나눌 수 있다. 또한, 사용자 단말은 하부요로증상(LUTS) 또는 과민성 방광(OAB)의 여부에 따라 치료군을 나눌 수 있다. 예를 들어, 사용자 단말은 사용자가 남성인 경우 하부요로증상의 여부에 따라 치료군을 나눌 수 있다. 또한, 사용자 단말은 사용자가 여성인 경우 과민성 방광의 여부에 따라 치료군을 나눌 수 있다. 또한, 사용자 단말은 수면 장애 또는 수면무호흡증의 여부에 따라 치료군을 나눌 수 있다. 예를 들어, 사용자 단말은 수면 장애의 여부에 따라 치료군을 나눌 수 있다. 또한, 사용자 단말은 수면 장애가 있는 사용자의 경우 수면무호흡증의 동반 여부에 따라 치료군을 나눌 수 있다. 예를 들어, 사용자 단말은 상술한 야간다뇨의 여부, 야간다뇨 관련 약물의 처방 여부, 하부요로증상 또는 과민 성 방광의 여부, 수면 장애 여부 및 수면무호흡증의 여부에 기초하여, 제 1 차 치료군에 제 1-1치료군 내지 제 1-18 치료군을 포함시킬 수 있다. 도 15는 일 실시예에 따른 제 2 차 치료군에 포함된 치료군을 설명하기 위한 예시적인 도면이다. 도 15를 참조하면, 표는 제 2 차 치료군에 포함된 치료군을 나타낸 표에 해당한다. 예를 들어, 사용자 단말은 당뇨의 여부에 따라 치료군을 나눌 수 있다. 또한, 사용자 단말은 심장 질환의 여부 에 따라 치료군을 나눌 수 있다. 또한, 사용자 단말은 비만의 여부에 따라 치료군을 나눌 수 있다. 예를 들어, 사용자 단말은 상술한 당뇨의 여부, 심장 질환의 여부 및 비만의 여부에 기초하여, 제 2 차 치료군 에 제 2-1치료군 내지 제 2-8 치료군을 포함시킬 수 있다. 예를 들어, 사용자 단말은 제 1 차 치료군으로의 제 1 차 분류 결과 및 제 2 차 치료군으로의 제 2 차 분류 결 과를 기초로 하여 사용자의 최종 치료군을 결정할 수 있다.예를 들어, 사용자 단말은 제 1 차 치료군에 포함된 18개의 치료군 및 제 2 차 치료군에 포함된 8개의 치료군을 통해, 총 144개의 최종 치료군을 산출할 수 있다. 또한, 사용자 단말은 144개의 최종 치료군에 대해 각각 다른 치료 방안을 제시할 수 있다. 이를 통해, 사용자 단말은 야간뇨 질환의 증상 정도에 따라 서로 다른 내용의 치료 방안을 제시함으로써 효율적 인 야간뇨 질환의 치료를 수행할 수 있다. 본 발명에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같 은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 일 실시예에 따르면, 본 개시의 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 본 발명에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 발명이 한정되는 것은 아니 다. 본 발명에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 발명을 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 발명의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허 청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2024-0044060", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 방법을 설명하기 위한 개념도이 다. 도 2는 일 실시예에 따른 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 장치의 블록도이다. 도 3은 일 실시예에 따른 사용자 단말 및 외부 장치를 포함하는 시스템의 예시적인 구성도이다. 도 4는 일 실시예에 따른 비대면으로 야간뇨 질환에 대한 진단 결과를 제공하는 방법을 설명하기 위한 흐름도이 다. 도 5는 일 실시예에 따른 야간뇨 질환의 증상 정도에 따라 세부 치료군으로 분류하는 방법을 설명하기 위한 흐 름도이다. 도 6은 일 실시예에 따른 제 1 검사의 결과를 정상 및 비정상으로 분류하는 방법을 설명하기 위한 개념도이다. 도 7은 일 실시예에 따른 제 1 검사의 결과에 따라 내원 진료를 제안하는 과정을 설명하기 위한 개념도이다. 도 8a는 일 실시예에 따른 제 2 검사에 포함된 수면 장애에 대한 진단 결과를 제공하기 위한 제 3 설문을 설명 하기 위한 예시적인 도면이다. 도 8b는 일 실시예에 따른 제 2 검사에 포함된 수면무호흡증에 대한 진단 결과를 제공하기 위한 제 3 설문을 설 명하기 위한 예시적인 도면이다. 도 9는 일 실시예에 따른 제 2 검사에 포함된 제 4 설문을 설명하기 위한 예시적인 도면이다. 도 10은 일 실시예에 따른 제 2 검사에 포함된 제 5 설문을 설명하기 위한 예시적인 도면이다. 도 11은 일 실시예에 따른 배뇨 일지를 설명하기 위한 예시적인 도면이다. 도 12는 일 실시예에 따른 사용자의 기본 건강 정보를 기초로 하여 제 2 검사에 포함되는 설문을 결정하는 방법 을 설명하기 위한 예시적인 도면이다. 도 13은 일 실시예에 따른 제 2 검사의 결과에 따라 내원 진료를 제안하는 과정을 설명하기 위한 개념도이다. 도 14는 일 실시예에 따른 제 1 차 치료군에 포함된 치료군을 설명하기 위한 예시적인 도면이다. 도 15는 일 실시예에 따른 제 2 차 치료군에 포함된 치료군을 설명하기 위한 예시적인 도면이다."}
