{"patent_id": "10-2021-0045879", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0139654", "출원번호": "10-2021-0045879", "발명의 명칭": "증강형 측정 장치 및 이에 대한 운영법", "출원인": "이태경", "발명자": "이태경"}}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "객체를 포함하는 영상정보를 수취하는 영상정보 수취부;지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용하여 특정 위치까지의 거리를 측정하는 거리 측정부;상기 영상정보 수취부를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체를 특정할수 있는 유한한 개수의 피쳐를 추출하는 영상정보 처리부; 및상기 거리 측정부를 제어하여 상기 영상정보 처리부에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써상기 객체에 대해 3차원 계측을 수행하는 연산제어부;를 포함하는 증강형 측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 영상정보 처리부는,상기 영상정보 수취부를 통해 얻어진 영상정보에 대해 이미지 매칭을 이용하거나 인공지능 학습을 통해 만든 객체탐지 모델을 이용하여 객체를 탐지하고,상기 객체에 포함된 점, 선, 면을 상기 피쳐로 추출하며,상기 추출된 피쳐에 대해 사전에 정해진 기하학적 위치를 상기 피쳐점으로 결정하는 것을 특징으로 하는 증강형측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 영상정보 처리부는,유선 또는 무선통신으로 연결된 인공지능 서버에 대해 상기 영상정보 안에서 객체를 탐지할 것을 문의하고 그결과를 수신하는 것을 특징으로 하는 증강형 측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,증강정보를 투사하는 증강정보 투사부를 더 포함하고,상기 연산제어부는 상기 객체에 대한 3차원 계측결과에 기반하여 상기 증강정보 투사부가 상기 객체에 초점거리가 맞춰진 증강정보를 투사하도록 제어하는 것을 특징으로 하는 증강형 측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 영상정보 수취부의 광학계는 빔 스플리터를 포함하고,상기 빔 스플리터는 상기 영상정보 수취부로 입사하는 광은 투과하며,상기 빔 스플리터는 상기 거리 측정부에서 출사하는 레이저 및 상기 피쳐점에서 반사하는 광은 전반사하는 것을특징으로 하는 증강형 측정 장치.공개특허 10-2022-0139654-3-청구항 6 제4항에 있어서,상기 영상정보 수취부의 광학계는 제1 빔 스플리터를 포함하고,상기 증강정보 투사부의 광학계는 제2 빔 스플리터를 포함하며,상기 제1 빔 스플리터는 상기 영상정보 수취부로 입사하는 광은 투과하고,상기 증강정보 투사부에서 투사하는 증강정보는 상기 제2 빔 스플리터 및 제1 빔 스플리터에서 순차적으로 전반사되어 투사되며,상기 거리 측정부에서 출사하는 레이저 및 상기 피쳐점에서 반사하는 광은 상기 제1 빔 스플리터에서는 전반사되고 상기 제2 빔 스플리터에서는 투과되는 것을 특징으로 하는 증강형 측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 거리 측정부에 구비된 지향성 파동으로서 레이저는,펄스 레이저, 주파수 변조 레이저 또는 위상변위 레이저인 것을 특징으로 하는 증강형 측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 증강형 측정 장치의 속도, 가속도, 3차원상의 위치, 방위각, 고각, 자세, 주변 온도, 습도를 포함하는 적어도 하나 이상의 부가정보를 취득하는 센서를 더 포함하는 것을 특징으로 하는 증강형 측정 장치."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "객체를 포함하는 영상정보를 수취하는 영상정보 수취단계;상기 영상정보 수취단계를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체를 특정할 수 있는 유한한 개수의 피쳐를 추출하는 영상정보 처리단계; 및지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용하여 상기 영상정보 처리단계에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 상기 객체에 대해 3차원 계측을 수행하는 측위단계;를 포함하는 증강형 측위 방법."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 측위단계는,상기 영상정보 수취단계를 통해 얻어진 영상정보 안에서 객체를 탐지한 경우에 수행하는 것을 특징으로 하는 증강형 측위 방법."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 영상정보 처리단계는,상기 영상정보 수취단계를 통해 얻어진 영상정보에 대해 이미지 매칭을 이용하거나 인공지능 학습을 통해 만든객체탐지 모델을 이용하여 객체를 탐지하고,상기 객체에 포함된 점, 선, 면을 상기 피쳐로 추출하며,상기 추출된 피쳐에 대해 사전에 정해진 기하학적 위치를 상기 피쳐점으로 결정하는 것을 특징으로 하는 증강형측위 방법.공개특허 10-2022-0139654-4-청구항 12 제11항에 있어서,상기 영상정보 처리단계는,유선 또는 무선통신으로 연결된 인공지능 서버에 대해 상기 영상정보 안에서 객체를 탐지할 것을 문의하고 그결과를 수신하는 것을 특징으로 하는 증강형 측위 방법."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 측위단계 이후에 증강정보 투사단계를 더 포함하고,상기 증강정보 투사단계는, 상기 객체에 대한 3차원 계측결과에 기반하여 상기 객체에 초점거리가 맞춰진 증강정보를 투사하는 것을 특징으로 하는 증강형 측위 방법."}
{"patent_id": "10-2021-0045879", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 지향성 파동으로서 레이저는, 펄스 레이저, 주파수 변조 레이저 또는 위상변위 레이저인 것을 특징으로 하는 증강형 측위 방법."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시되는 발명은 증강형 측정 장치에 관한 것으로서, 객체를 포함하는 영상정보를 수취하는 영상정보 수취부;와, 지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용하여 특정 위치까지의 거리를 측정하는 거리 측정부;와, 상기 영상정보 수취부를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체 를 특정할 수 있는 유한한 개수의 피쳐를 추출하는 영상정보 처리부; 및 상기 거리 측정부를 제어하여 상기 영상 정보 처리부에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 상기 객체에 대해 3차원 계측을 수행하는 연산제어부;를 포함한다."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 증강형 측정 장치 및 이에 대한 운영법에 관한 것으로서, 관측자와 대상물 사이의 상대적 위치관계, 즉 대상물의 측위를 효율적이고 정확하게 진행하고, 이를 통해 공간과 대상물을 빠르고 정확하게 특정할 수 있 는 장치 및 방법에 관한 발명이다."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에 미래의 주요기술로 부상하고 있는 증강현실이나 혼합현실, 자율주행 등의 기술은 관측자(사람이나 물체 를 모두 포함)를 기준으로 그 주변의 환경 및 대상물(이를 통칭하여 \"객체\"라 부르기로 함)에 대한 상대적인 위 치관계의 특정이 필수적으로 요구된다. 예를 들어, 증강현실이나 혼합현실을 구현하기 위해서는 목적이 되는 객체가 어디에 있는지를 3차원적으로 정확 히 파악해야 하며, 자율주행의 경우에는 차량 주변의 도로 및 안전을 위협하는 위험요소 등의 제반 환경을 정확 하게 감지해야 한다. 이러한 3차원 측위를 위해, 카메라를 이용한 영상분석이나, 라이다와 같은 측위장치를 이용하여 주변을 파악하 고 있는데, 이러한 개별 기술에는 문제점 내지 장단점이 존재한다. 자율주행을 예로 든다면, 카메라만을 이용하여 주변 차량 주변의 객체를 인식하게 되면 오류가 개입할 가능성이 크다. 즉, 환경과 대상물의 구분이 안되는 넓은 평야나 특징이 없는 벽, 그리고 도로에 그려진 착시 그림(예를 들어, 착시를 일으키는 과속방지턱 그림 등) 등은 차량이 일정 거리를 주행하여 시점의 변화가 발생하기 전까지 는 정확히 구분하는 것이 불가능하다. 이렇게 되면, 일정 거리를 주행하여 시점의 변위가 생기기 전까지는 브레 이크 작동 등의 명령이 지연되고, 이에 따라 사고로 이어질 가능성이 크다. 반면, 라이다를 적용하는 경우에는 차량 주변을 3차원으로 인식하기 때문에 더욱 정확한 주변 인식이 가능하다 는 장점이 있지만, 모든 영역을 계측하기 때문에 데이터량이 방대하여 연산이 비효율적이고, 시간이 오래 소요 되는 단점이 있다. 또한, 주변 차량과 정보를 공유하기 위해서는 고속의 5G 통신이 필요하기에, 관련 인프라를 구축하기 위한 대규모 자본 투자가 필요하기도 한다. 선행기술문헌특허문헌 (특허문헌 0001) 한국등록특허 제10-2049863호 (2019.11.22 등록)"}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 3차원 측위시의 오류 발생과 시간 지연을 방지하면서, 효율적인 연산이 가능한 증강형 측정 장치 및 이에 대한 운영법을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 증강형 측정 장치는, 객체를 포함하는 영상정보를 수취하는 영상정보 수취부;와, 지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용하여 특정 위치까지의 거리를 측정하는 거리 측정부;와, 상기 영 상정보 수취부를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체를 특정할 수 있는 유한한 개수의 피쳐를 추출하는 영상정보 처리부; 및 상기 거리 측정부를 제어하여 상기 영상정보 처리부에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 상기 객체에 대해 3차원 계측을 수행하는 연산제어부;를 포함한다. 여기서, 상기 영상정보 처리부는, 상기 영상정보 수취부를 통해 얻어진 영상정보에 대해 이미지 매칭을 이용하 거나 인공지능 학습을 통해 만든 객체탐지 모델을 이용하여 객체를 탐지하고, 상기 객체에 포함된 점, 선, 면을 상기 피쳐로 추출하며, 상기 추출된 피쳐에 대해 사전에 정해진 기하학적 위치를 상기 피쳐점으로 결정할 수 있 다. 그리고, 상기 영상정보 처리부는, 유선 또는 무선통신으로 연결된 인공지능 서버에 대해 상기 영상정보 안에서 객체를 탐지할 것을 문의하고 그 결과를 수신할 수 있다. 그리고, 본 발명의 증강형 측정 장치는, 증강정보를 투사하는 증강정보 투사부를 더 포함하고, 상기 연산제어부 는 상기 객체에 대한 3차원 계측결과에 기반하여 상기 증강정보 투사부가 상기 객체에 초점거리가 맞춰진 증강 정보를 투사하도록 제어할 수 있다. 본 발명의 일 실시형태에서, 상기 영상정보 수취부의 광학계는 빔 스플리터를 포함하고, 상기 빔 스플리터는 상 기 영상정보 수취부로 입사하는 광은 투과하며, 상기 빔 스플리터는 상기 거리 측정부에서 출사하는 지향성 파 동인 레이저 및 상기 피쳐점에서 반사하는 광은 전반사하는 구조로 구성될 수 있다. 그리고, 본 발명의 다른 실시형태에 따르면, 상기 영상정보 수취부의 광학계는 제1 빔 스플리터를 포함하고, 상 기 증강정보 투사부의 광학계는 제2 빔 스플리터를 포함하며, 상기 제1 빔 스플리터는 상기 영상정보 수취부로 입사하는 광은 투과하고, 상기 증강정보 투사부에서 투사하는 증강정보는 상기 제2 빔 스플리터 및 제1 빔 스플 리터에서 순차적으로 전반사되어 투사되며, 상기 거리 측정부에서 출사하는 지향성 파동인 레이저 및 상기 피쳐 점에서 반사하는 광은 상기 제1 빔 스플리터에서는 전반사되고 상기 제2 빔 스플리터에서는 투과되는 구조로 구 성될 수 있다. 상기 거리 측정부에 구비된 지향성 파동 중 레이저는, 펄스 레이저, 주파수 변조 레이저 또는 위상변위 레이저 일 수 있다. 그리고, 상기 증강형 측정 장치의 속도, 가속도, 3차원상의 위치, 방위각, 고각, 자세, 주변 온도, 습도를 포함 하는 적어도 하나 이상의 부가정보를 취득하는 센서를 더 포함할 수 있다. 한편, 본 발명은, 객체를 포함하는 영상정보를 수취하는 영상정보 수취단계;와, 상기 영상정보 수취단계를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체를 특정할 수 있는 유한한 개수의 피쳐를 추출하는 영상정보 처리단계; 및 지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용하여 상기 영상정 보 처리단계에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 상기 객체에 대해 3차원 계측을 수행하 는 측위단계;를 포함하는 증강형 측위 방법을 제공한다. 여기서, 상기 측위단계는, 상기 영상정보 수취단계를 통해 얻어진 영상정보 안에서 객체를 탐지한 경우에 수행 하는 것이 바람직할 수 있다. 그리고, 상기 영상정보 처리단계는, 상기 영상정보 수취단계를 통해 얻어진 영상정보에 대해 이미지 매칭을 이 용하거나 인공지능 학습을 통해 만든 객체탐지 모델을 이용하여 객체를 탐지하고, 상기 객체에 포함된 점, 선, 면을 상기 피쳐로 추출하며, 상기 추출된 피쳐에 대해 사전에 정해진 기하학적 위치를 상기 피쳐점으로 결정할 수 있다. 그리고, 상기 영상정보 처리단계는, 유선 또는 무선통신으로 연결된 인공지능 서버에 대해 상기 영상정보 안에 서 객체를 탐지할 것을 문의하고 그 결과를 수신할 수 있다. 그리고, 상기 측위단계 이후에 증강정보 투사단계를 더 포함하고, 상기 증강정보 투사단계는 상기 객체에 대한 3차원 계측결과에 기반하여 상기 객체에 초점거리가 맞춰진 증강정보를 투사하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명의 증강형 측정 장치는, 영상정보 처리부가 영상정보 수취부를 통해 얻어진 영상정보 안에서 객체를 탐지한 경우에야 비로소 지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용한 3차원 측위를 수행하도록 구성된다. 따라서, 카메라만을 이용하여 객체를 탐지하는 경우에 발생할 수 있는 오류와 시간 지연 은 지향성 파동, 특히 레이저의 측위를 통해 해결되고, 또한 영상정보 안에서 객체를 탐지한 경우에 지향성 파 동, 특히 레이저에 대한 측위를 수행하기 때문에 효율적인 연산이 가능해진다."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 상세 한 설명으로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0045879", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리 고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것 이다. 그러나 본 발명은 이하에서 게시되는 실시 예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 본 명세서에서 사용된 용어는 실시 예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것 은 아니다. 본 명세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 본 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는 (comprising)\"은 언급된 구성 요소, 단계, 동작 및/또는 소자는 하나 이상의 다른 구성 요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는 다. 도 1은 자율주행을 예로 들어, 카메라만을 이용하여 주변 차량 주변의 객체를 인식하는 경우에 발생할 수 있는 오류에 대해 설명하는 도면이다. 도 1에서는 도로 바닥에 착시효과를 일으키는 과속방지턱 그림이 그려져 있는것이 예시되어 있다. 카메라가 촬영한 영상으로는, 착시효과를 일으키는 과속방지턱 그림과 실제 과속방지턱은 구별하기가 매우 어렵다. 따라서, Δt 만큼의 시간 동안 Δd 만큼 이동하여 카메라의 시점이 변경됨으로써 착시 효과가 사라진 이후에야 비로소 도로 바닥의 그림임을 판정할 수 있게 된다. 그러나, Δt 만큼의 시간 지연이 발생함에 따라 과속방지턱 그림 인근의 다른 장애물을 파악하여 대응할 시간적 여유가 줄어들게 됨으로써 사고 위험의 가능성은 높아진다. 그렇다고 하여, 안전을 위해 모든 의심스러운 객체에 대해 일일이 대응한다면, 이는 운전자에게 심한 불편을 초래할 것이다. 도 2는 본 발명에 따른 증강형 측정 장치를 적용한 경우를 비교 도시한 것이다. 본 발명에 따른 증강형 측 정 장치는, 영상정보 수취부와 거리 측정부, 영상정보 처리부 및 연산제어부를 포함하 며, 이에 대해서는 도 3에 도시되어 있다. 영상정보 수취부는 객체(환경과 대상물을 모두 포함)를 포함하는 영상정보를 수취한다. 영상정보 수취부 는 CCD나 CMOS와 같은 촬상소자를 구비한 디지털 카메라로 이해할 수 있다. 거리 측정부는 지향성 광파, 음파, 전자기파를 포함하는 지향성 파동을 이용하여 특정 위치까지의 거리를 측정할 수 있는 구성이다. 지향성 파동을 사용하는 이유는 특정 피쳐에 대해 선별적으로 거리를 측정하기가 용 이하기 때문인데, 지향성 파동 중 레이저를 적용하는 것이 실용적일 수 있다. 레이저를 이용한 거리측정은 공지 의 기술에 해당하며, 레이저가 목표물에서 반사되어 되돌아오는 시간을 측정하여 목표물까지의 거리를 측정하는 것이 대표적인 거리측정 원리이다. 여기서, 거리 측정부에 구비되는 레이저는 펄스 레이저, 주파수 변조 레이저 또는 위상변위 레이저일 수 있다. 펄스 레이저는 대략 1억분의 1초 정도의 짧은 레이저 펄스를 이용하며, 측정 거리가 길다는 장점이 있지 만 레이저의 출력이 높아야 하고 측정 정밀도가 다소 낮다는 단점이 있기도 하다. 주파수 변조 레이저는 연속발 진형 레이저를 주파수 변조를 하여 목표물로 발사하고 되돌아온 광파를 원래의 광파와 상호 비교함으로써 거리 를 측정하는 것인데, 측정 정밀도가 매우 높은 것이 장점이지만 측정가능 거리가 보통 수십 미터 정도라는 한계 를 가진다. 그리고, 위상변위 레이저는 연속발진형 레이저를 발사하고 목표물의 속도와 거리를 모두 측정할 수 있으며, 목표물까지의 거리는 송수신 사이에 발생한 위상차에 비례하는 특성을 가진다. 거리 측정부에 구 비되는 레이저는 본 발명이 목적으로 하는 용도에 맞춰 적절하게 선정될 수 있다. 영상정보 처리부는 영상정보 수취부를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체를 특정할 수 있는 유한한 개수의 피쳐를 추출하는 역할을 한다. 영상정보 수취부에서 취득한 영상정보 안에는 주변 환경을 구성하는 고정물과 움직이는 물체 등의 각종 객체가 포함되어 있다. 그리고, 이러 한 객체 중에는 프로그램이나 어플리케이션 등의 목적에 따라 거리를 측정해야 할 대상이 있을 수 있으며, 영상 정보 처리부는 이런 유의미한 개체를 영상정보 안에서 탐지한다. 여기서, 영상정보 처리부는, 영상정보 수취부를 통해 얻어진 영상정보에 대해 이미지 매칭을 이용하 거나 인공지능 학습을 통해 만든 객체탐지 모델을 이용하여 객체를 탐지할 수 있다. 이미지 매칭은, 얻어진 영 상정보에 대해 기저장되어 있는 각종 이미지를 상호 비교하여 얻어진 일치율에 근거하여 객체를 탐지하는 기술 이다. 그리고, 인공지능 학습을 통해 만든 객체탐지 모델로는 R-CNN 계열의 모델을 예로 들 수 있다. R-CNN 모 델은 관심영역에 대해 다수의 경계 상자를 생성하고, 각 경계 상자에 대해 그 안에 담긴 객체를 탐지하는 과정 을 수행한다. 탐지된 객체에 군집이 포함되어 있는 경우에는, 이를 하나의 덩어리로 탐지하거나, 또는 하나씩 분리하여 탐지할 수도 있으며, 이는 객체 탐지의 목적에 맞춰 적절히 선택될 수 있다. 예를 들어, 자율주행의 경우라면 하나의 덩어리로 객체를 탐지하여도 무방하며, 밀집도를 계산하는 경우라면 하나씩 분리하여 탐지하는 것이 적절할 것이다. 또한, 영상정보 처리부는, 탐지된 객체에 대해 그 객체를 특정할 수 있는 유한한 개수의 피쳐를 추출한다. 피쳐(또는 이미지 피쳐)에는 윤곽선, 코너, 강도 히스토그램, SIFT 등이 있는데, 결국 피쳐는 해당 객체를 특정 할 수 있는 특징적인 이미지 요소를 말하는 것이다. 객체를 더욱 정확히 인식하기 위한 피쳐의 특성으로는, 물 체 방향의 변화에 영향을 받지 않는 회전 불변성(rotation invariance), 이미지 척도 변화에 영향을 받지 않는 크기 불변성(scale invariance), 한 이미지 안에서 물체가 움직여도 같은 물체라고 인식할 수 있는 평행이동 불 변성(translation invariance)을 갖추는 것이 바람직하다. 결론적으로, 영상정보 처리부는, 연속적으로 제공되는 영상정보 안의 객체에 대해 회전 불변성, 크기 불변 성, 그리고 평행이동 불변성의 각종 특성을 가장 잘 만족하는 부분을 피쳐로서 추출한다. 객체의 피처에는 점, 선, 면이 포함된다. 그리고, 실시형태에 따라서, 영상정보 처리부는 유선 또는 무선통신으로 연결된 인공지능 서버에 대해 영상정보 안에서 객체를 탐지할 것을 문의하고 그 결과를 수신할 수 있으며, 나아가 탐 지된 객체에 대한 피쳐 추출도 함께 문의하고 그 결과를 수신할 수 있다. 연산제어부는, 거리 측정부를 제어하여 영상정보 처리부에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 객체에 대해 3차원 계측을 수행한다. 피쳐점은 각각의 피쳐를 특징지을 수 있는 하나 이상 의 점을 의미한다. 점으로 추출된 피쳐는 그 자체로서 피쳐점이 되며, 선과 면에 대해서는 사전에 정해진 하나 이상의 기하학적 위치를 피쳐점으로 정할 수 있다. 예를 들어, 선분의 중점, 면의 무게중심 등을 각각 선과 면 의 피쳐점으로 정할 수 있다. 이와 같은 본 발명의 증강형 측정 장치는, 영상정보 처리부가 영상정보 수취부를 통해 얻어진 영 상정보 안에서 객체를 탐지한 경우에야 비로소 지향성 파동, 특히 레이저를 이용한 3차원 측위를 수행하도록 구 성된다. 따라서, 카메라만을 이용하여 객체를 탐지하는 경우에 발생할 수 있는 오류와 시간 지연은 레이저 측위 를 통해 해결되고, 또한 영상정보 안에서 객체를 탐지한 경우에 레이저 측위를 수행하기 때문에 효율적인 연산 이 가능해진다. 그리고, 본 발명의 증강형 측정 장치는, 증강정보를 투사하는 증강정보 투사부를 더 포함할 수 있다. 객체에 대한 3차원 측위는 연산제어부가 거리 측정부를 제어하여 영상정보 처리부에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 완성되었으며, 이를 바탕으로 연산제어부는 객체에 대한 3 차원 계측결과에 기반하여 객체에 정확하게 맞춰진 증강정보, 예를 들어 객체의 바로 위로 정확하게 중첩된 위 치 및 이에 맞는 초점거리를 가진 증강정보를 투사하도록 증강정보 투사부를 제어할 수 있다. 초점거리를 가진 증강정보가 투사되었기 때문에, 만약 측정하고자 하는 대상 또는 피쳐로부터 반사된 증강정보의 상이 흐리 다면, 즉 초점이 흐리게 영상정보 처리부에서 판정된다면, 거리 측정부를 기반으로 계산한 거리가 다 른 것을 검산할 수도 있게 된다. 도 4 및 도 5는 본 발명에 따른 증강형 측정 장치의 다양한 실시형태를 보여준다. 도 4의 실시형태는, 영상정보 수취부의 광학계는 빔 스플리터를 포함한다. 빔 스플리터는 영상 정보 수취부로 입사하는 광은 투과하며, 또한 빔 스플리터는 거리 측정부에서 출사하는 레이저 및 피쳐점에서 반사하는 광은 전반사하는 구조로 구성되어 있다. 도 4의 실시형태는, 영상정보 수취부와 거리 측정부가 빔 스플리터를 공유하는 구조로 만들어짐에 따라 전체 광학계의 구조가 단순해지는 이 점이 있다. 다만, 도 4의 실시형태에서는 증강정보 투사부가 별도의 광학계를 구성하고 있다. 따라서, 증 강정보 투사부가 필수적이지 않은 증강형 측정 장치, 또는 증강정보 투사부가 착탈식으로 장착되 는 증강형 측정 장치에 유용한 실시형태로 볼 수 있다. 도 5의 실시형태는 증강정보 투사부까지 포함하여 하나의 통합된 광학계를 구성하는 예를 보여준다. 도 5 를 참조하면, 영상정보 수취부의 광학계는 제1 빔 스플리터를 포함하고, 증강정보 투사부의 광 학계는 제2 빔 스플리터를 포함한다. 제1 빔 스플리터는 영상정보 수취부로 입사하는 광은 투과 하고, 증강정보 투사부에서 투사하는 증강정보는 제2 빔 스플리터 및 제1 빔 스플리터에서 순차 적으로 전반사되어 투사된다. 그리고, 거리 측정부에서 출사하는 레이저 및 상기 피쳐점에서 반사하는 광 은 제1 빔 스플리터에서는 전반사되고 제2 빔 스플리터에서는 투과되는 구조로 구성되어 있다. 전체 광학계가 하나로 통합됨에 따라, 더욱 콤팩트한 구조를 이룰 수 있다. 그리고, 본 발명의 증강형 측정 장치는, 실시형태에 따라 속도, 가속도, 3차원상의 위치(고도 포함), 방위 각, 고각, 자세, 주변 온도, 습도를 포함하는 적어도 하나 이상의 부가정보를 취득하는 센서를 더 포함할 수 있다. 이러한 센서에서 제공하는 부가정보를 이용함으로써 연산 효율을 더욱 향상시키거나, 또는 활용 범위를 더욱 확장할 수 있다. 예를 들어, GPS 센서를 부가한 증강형 측정 장치를 스마트 글라스에 적용함으 로써 위치기반 서비스를 적극적으로 도입할 수 있다. 또한, 예를 들어, GPS 센서를 통해 어느 장소 또는 환경에 서 증강형 측정이 실행되는지 파악할 수 있어서, 객체 탐지 및 피쳐추출에 이용될 이미지 매칭이나 인공지능 모 델의 데이터 종류나 범위를 좁힐 수 있어서, 탐색이나 추출의 속도나 정확도 개선을 도모할 수 있다. 또한, 습 도센서를 통해, 비가 오는 날과 같은 환경에서 변할 수 있는 반사 레이저의 특성을 적용할 수 있게 되어 정밀한 계측이 가능하게 된다. 한편, 본 발명은 증강형 측위 방법을 제공하며, 이에 대한 순서도가 도 6에 도시되어 있다. 도 6을 참조하면, 본 발명의 증강형 측위 방법은, 객체를 포함하는 영상정보를 수취하는 영상정보 수취단계와, 상기 영상정보 수취단계를 통해 얻어진 영상정보 안에서 객체를 탐지하고, 탐지된 객체에 대해 그 객체를 특정할 수 있는 유한한 개수의 피쳐를 추출하는 영상정보 처리단계, 그리고 지향성 파동, 특히 레이저를 이용하여 상기 영상정보 처리단계에서 추출한 각 피쳐의 피쳐점에 대한 거리를 측정함으로써 상기 객체에 대해 3차원 계 측을 수행하는 측위단계를 포함한다. 여기서, 측위단계는 영상정보 수취단계를 통해 얻어진 영상정보 안에서 객체를 탐지한 경우에 수행하는 것이 바 람직함은 전술한 바와 같다. 그리고, 측위단계 이후에 증강정보 투사단계를 더 포함할 수 있으며, 증강정보 투사단계는 객체에 대한 3차원 계측결과에 기반하여 객체에 위치와 초점거리가 맞춰진 증강정보를 투사한다. 본 발명의 증강형 측위 방법은 전술한 증강형 측위 장치와 밀접한 관련이 있으며, 중복되는 설명은 명료한 이해 를 위해 생략하기로 한다. 이상 첨부된 도면을 참조하여 본 발명의 실시 예들을 설명하였지만, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시 예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0045879", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 자율주행에서 카메라만을 이용하여 객체를 인식하는 경우에 발생할 수 있는 오류에 대해 설명하는 도면. 도 2는 본 발명의 증강형 측정 장치를 이용하여 객체를 인식하는 경우를 간략히 설명하는 도면. 도 3은 본 발명에 따른 증강형 측정 장치를 도시한 도면. 도 4는 본 발명에 따른 증강형 측정 장치의 다른 실시형태를 도시한 도면. 도 5는 본 발명에 따른 증강형 측정 장치의 또 다른 실시형태를 도시한 도면. 도 6은 본 발명에 따른 증강형 측위 방법에 대한 순서도."}
