{"patent_id": "10-2019-0178622", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0085518", "출원번호": "10-2019-0178622", "발명의 명칭": "개인 맞춤형 ＩｏＴ 의료 시스템", "출원인": "(주)유비텍", "발명자": "김경오"}}
{"patent_id": "10-2019-0178622", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 건강정보 및 주변정보를 측정하는 다수의 IoT 센서; 상기 다수의 다수의 IoT 센서로부터 수신한 데이터를 수집하여 서버로 송신하는 게이트웨이; 및상기 게이트웨이로부터 데이터를 수신하여 분석하는 서버를 포함하되,상기 다수의 IoT 센서는IoT 혈당측정부, IoT 맥파측정부, IoT 수면상태측정부, IoT 가연성가스 측정부, IoT 스마트콘센트, IoT 모션측정부, IoT 소변측정부, IoT 수액측정부, IoT 체온측정부 및 IoT 조도측정부 중 적어도 하나를 포함하는 것을 특징으로 하는 개인 맞춤형 IoT 의료 시스템."}
{"patent_id": "10-2019-0178622", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 IoT 모션측정부는,가속도 센서 및 자이로센서에 의해 측정된 환자의 움직임 정보를 수집하여 상기 게이트웨이를 통해 서버로 전송하고, 상기 서버는,상기 수집된 움직임 정보를 분석하여 환자의 데이터베이스를 구축하고 상기 수집된 움직임 정보로부터 상기 환자의 운동량 및 보행패턴 중 적어도 어나 하나를 수집하는 사용자모니터링부를 포함할 수 있으며,상기 서버는,상기 환자의 호흡, 맥박, 혈압 및 산소포화도 중 적어도 어느 하나를 포함하는 생체신호를 디스플레이하도록 제어하고, 상기 생체신호에 기초하여 추천재활운동영상 및 권장식단 중 적어도 어느 하나를 제공하며, 상기 환자의 진료 및 재활운동 일정에 기초하여 사용자일정안내서비스를 제공하고, 상기 환자의 현재 건강상태를 스스로점검하는 자가진단서비스를 제공하는 것을 특징으로 하는 개인 맞춤형 IoT 의료 시스템."}
{"patent_id": "10-2019-0178622", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 사용자모니터링부는,상기 환자의 운동량 및 생체신호에 기초하여 응급상황을 판단하되, 상기 환자의 운동량 및 생체신호가 기설정된기준수치를 초과하는 경우, 기설정된 관리자 단말기에게 즉시 호출신호를 전송하는 것을 특징으로 하는 개인 맞춤형 IoT 의료 시스템."}
{"patent_id": "10-2019-0178622", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서, 상기 서버는,사용자 이동시 빔투사부를 통해 상기 환자의 목적지로 향하는 유도 발자국을 지면에 투사하도록 제어하되, 상기 IoT 모션측정부를 통해 수집된 상기 환자의 실제 걸음과 상기 유도 발자국의 일치도를 산출하고, 상기 일치도에 기초하여 사용자의 재활운동을 관리하며, 상기 환자별로 목표 운동량을 부여하고, 상기 환자의 설정에 따라 캐릭터 이미지 및 응원문구 중 적어도 어느하나를 상기 유도 발자국과 함께 투사하도록 제어하는 것을 특징으로 하는 개인 맞춤형 IoT 의료 시스템. 공개특허 10-2021-0085518-3-청구항 5 제1항에 있어서, 상기 서버는,상기 IoT 모션측정부를 통해 수집된 상기 환자의 보행 정보를 분석하여 상기 환자의 보행 속도를 산출하고, 상기 보행속도에 기초하여 이동로봇의 속도를 제어하며, 상기 이동로봇의 동선 상에 감지된 장애물의 움직임을 판단하여 고정된 장애물일 경우, 경보음을 발생시키고, 움직이는 장애물일 경우, 상기 환자에게 음성안내를 제공하는 것을 특징으로 하는 개인 맞춤형 IoT 의료 시스템."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개인 맞춤형 IoT 의료 시스템이 개시된다. 일실시례에 따른 개인 맞춤형 IoT 의료 시스템은, 환자의 건강정보 및 주변정보를 측정하는 다수의 IoT 센서, 상기 다수의 다수의 IoT 센서로부터 수신한 데이터를 수집하여 서버로 송 신하는 게이트웨이 및 상기 게이트웨이로부터 데이터를 수신하여 분석하는 서버를 포함하고, 상기 다수의 IoT 센 서는 IoT 혈당측정부, IoT 맥파측정부, IoT 수면상태측정부, IoT 가연성가스 측정부, IoT 스마트콘센트, IoT 모 션측정부, IoT 소변측정부, IoT 수액측정부, IoT 체온측정부 및 IoT 조도측정부 중 적어도 하나를 포함할 수 있 다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 개인 맞춤형 IoT 의료 시스템에 관한 것으로, 보다 상세하게는 환자의 건강상태를 다수의 IoT 센서를 통해 모니터링하고, 환자에게 병원 생활에 필요한 정보를 안내하며, 환자의 재활운동을 유도하는 개인 맞춤형 IoT 의료 시스템에 관한 것이다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료기술의 발달과 식생활의 변화로 인간의 평균연령은 증가하고 있으며, 세계적으로 인구의 노령화가 가속되고 있다. 또한 각종 질환들이 증가하여 노인이나 환자를 간병 혹은 간호할 인력의 증가는 미미한 수준이고, 의료기 술의 발달에 반하여 간호사 수의 부족은 환자에 대한 간호업무 외에 차트나 약 전달 등 단순하고 반복적인 잡무 의 증가가 발생하게 되어 환자에 대한 의료 서비스 품질이 떨어지는 문제점 있다. 종래기술인 한국공개특허 제10-2015-0119734호는 환자에게 약을 전달하거나, 회진하고 있는 의사에게 차트를 전 달하는 단순한 기능을 구비한 병실 도우미 로봇에 관한 기술이 개시되어 있으며, 한국등록특허 제10-2025233호 는 외과계 환자의 입원 및 수술 전후에 매일 이루어지는 상처 드레싱을 포함한 환자의 의료 처치를 수행하는 병 동 어시스턴트 로봇 장치에 관한 기술이 개시되어 있었으나 다양한 IoT 센서로부터 정보를 수집하고 활용하지는 못하여 환자의 상태를 관리하는데 어려움이 있었다. 따라서, 다수의 IoT 센서를 통해 환자의 생체신호를 실시간으로 파악하고, 병실 밖에서도 환자의 이동을 보조할 수 있는 개인 맞춤형 IoT 의료 시스템에 관한 연구가 요구된다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 바와 같은 종래 기술의 문제점을 해결하기 위하여 안출된 것으로, 다수의 IoT 센서로부터 환 자의 요구에 따라 병동안내, 일정안내 및 자가진단 서비스 등을 제공함으로써, 환자가 스스로 건강상태를 점검 할 수 있으며, 단순한 정보전달 및 병동안내 등과 같은 간호사의 잡무를 수행하여 간호사의 업무량을 감소시켜 줄 수 있는 개인 맞춤형 IoT 의료 시스템을 제공하는 데 그 목적이 있다. 또한 본 발명은 IoT 센서들로부터 병동 주변의 정보와 이동로봇의 이동반경 상에 마련된 장애물의 위치를 파악 함으로써, 이동로봇 등이 지면에 유도발자국 이미지를 투사하여 사용자에게 길안내 기능을 제공하고, 재활환자 의 경우, 흥미를 유발시킬 수 있는 이미지를 함께 투사하여 적극적인 재활운동을 유도하는 개인 맞춤형 IoT 의 료 시스템을 제공하는 데 그 목적이 있다. 또한 본 발명은 IoT 모션측정부를 통해 사용자의 모션 정보를 수집함으로써, 구집된 데이터를 분석하여 사용자 의 보행패턴 등 사용자의 특성을 구분하여 관리할 수 있는 개인 맞춤형 IoT 의료 시스템을 제공하는 데 그 목적 이 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제로 제한되지 않으며, 여기에 언급되지 않은 본 발명 이 해결하려는 또 다른 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 개인 맞춤형 IoT 의료 시스템은, 환자의 건강정보 및 주변정보를 측정하는 다수의 IoT 센서, 상 기 다수의 다수의 IoT 센서로부터 수신한 데이터를 수집하여 서버로 송신하는 게이트웨이 및 상기 게이트웨이로 부터 데이터를 수신하여 분석하는 서버를 포함하되, 상기 다수의 IoT 센서는 IoT 혈당측정부, IoT 맥파측정부, IoT 수면상태측정부, IoT 가연성가스 측정부, IoT 스마트콘센트, IoT 모션측정부, IoT 소변측정부, IoT 수액측 정부, IoT 체온측정부 및 IoT 조도측정부 중 적어도 하나를 포함한다. 또한, 본 발명의 일측에 따르면, 상기 IoT 모션측정부는, 가속도 센서 및 자이로센서에 의해 측정된 환자의 움 직임 정보를 수집하여 상기 게이트웨이를 통해 서버로 전송하고, 상기 서버는, 상기 수집된 움직임 정보를 분석 하여 환자의 데이터베이스를 구축하고 상기 수집된 움직임 정보로부터 상기 환자의 운동량 및 보행패턴 중 적어 도 어나 하나를 수집하는 사용자모니터링부를 포함할 수 있으며, 상기 서버는, 상기 환자의 호흡, 맥박, 혈압 및 산소포화도 중 적어도 어느 하나를 포함하는 생체신호를 디스플레이하도록 제어하고, 상기 생체신호에 기초 하여 추천재활운동영상 및 권장식단 중 적어도 어느 하나를 제공하며, 상기 환자의 진료 및 재활운동 일정에 기 초하여 사용자일정안내서비스를 제공하고, 상기 환자의 현재 건강상태를 스스로 점검하는 자가진단서비스를 제 공할 수 있다. 또한, 본 발명의 일측에 따르면, 상기 사용자모니터링부는, 상기 환자의 운동량 및 생체신호에 기초하여 응급상 황을 판단하되, 상기 환자의 운동량 및 생체신호가 기설정된 기준수치를 초과하는 경우, 기설정된 관리자 단말 기에게 즉시 호출신호를 전송할 수 있다. 또한, 본 발명의 일측에 따르면, 상기 서버는, 사용자 이동시 빔투사부를 통해 상기 환자의 목적지로 향하는 유 도 발자국을 지면에 투사하도록 제어하되, 상기 IoT 모션측정부를 통해 수집된 상기 환자의 실제 걸음과 상기 유도 발자국의 일치도를 산출하고, 상기 일치도에 기초하여 사용자의 재활운동을 관리하며, 상기 환자별로 목표 운동량을 부여하고, 상기 환자의 설정에 따라 캐릭터 이미지 및 응원문구 중 적어도 어느 하나를 상기 유도 발 자국과 함께 투사하도록 제어할 수 있다. 또한, 본 발명의 일측에 따르면, 상기 IoT 모션측정부를 통해 수집된 상기 환자의 보행 정보를 분석하여 상기 환자의 보행 속도를 산출하고, 상기 보행속도에 기초하여 이동로봇의 속도를 제어하며, 상기 이동로봇의 동선 상에 감지된 장애물의 움직임을 판단하여 고정된 장애물일 경우, 경보음을 발생시키고, 움직이는 장애물일 경우, 상기 환자에게 음성안내를 제공할 수 있다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 개인 맞춤형 IoT 의료 시스템은 다수의 IoT 센서로부터 환자의 요구에 따라 병동안내, 일정안내 및 자가진단 서비스 등을 제공함으로써, 환자가 스스로 건강상태를 점검할 수 있으며, 단순한 정보전달 및 병동안 내 등과 같은 간호사의 잡무를 수행하여 간호사의 업무량을 감소시켜 줄 수 있는 효과가 있다. 또한 본 발명은 IoT 센서들로부터 병동 주변의 정보와 이동로봇의 이동반경 상에 마련된 장애물의 위치를 파악 함으로써, 이동로봇 등이 지면에 유도발자국 이미지를 투사하여 사용자에게 길안내 기능을 제공하고, 재활환자 의 경우, 흥미를 유발시킬 수 있는 이미지를 함께 투사하여 적극적인 재활운동을 유도할 수 있는 효과가 있다. 또한 본 발명은 IoT 모션측정부를 통해 사용자의 모션 정보를 수집함으로써, 구집된 데이터를 분석하여 사용자 의 보행패턴 등 사용자의 특성을 구분하여 관리할 수 있는 효과가 있다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이상과 같은 본 발명에 대한 해결하고자 하는 과제, 과제의 해결 수단, 발명의 효과를 포함한 구체적인 사항들 은 다음에 기재할 실시례 및 도면들에 포함되어 있다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법 은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시례들을 참조하면 명확해질 것이다. 이하, 첨부된 도면을 참조하여 본 발명을 보다 상세히 설명하기로 한다. 도 1은 본 발명의 일실시례에 따른 개인 맞춤형 IoT 의료 시스템의 구성도이고,도 2는 본 발명의 일실시례에 따 른 개인 맞춤형 IoT 의료 시스템을 이용한 서비스를 제공하는 이동로봇에 다수의 IoT 센서가 마련된 일실시례를 도시한 도면이며, 도 3은 본 발명의 일실시례에 따라 환자의 건강정보를 IoT 센서로부터 수집하여 환자에 대한 맞춤형 처방을 도출하는 과정을 도시한 도면이고, 도 4는 본 발명의 일실시례에 따라 수액의 잔량을 센싱하여 관리자에게 고지함으로써 환자의 상태를 관리하는 과정을 설명하기 위한 도면이며, 도 5는 본 발명의 일실시례 에 따라 환자의 모션측정을 통해 환자의 낙상 등을 모니터링하여 환자를 보호하는 과정을 설명하기 위한 도면이 다. 도 1을 참고하면, 개인 맞춤형 IoT 의료 시스템은, 다수의 IoT 센서, 게이트웨이 및 서버(30 0)를 포함할 수 있다. 다수의 IoT 센서는 환자의 건강정보 및 주변정보를 측정할 수 있으며, 다양한 센서를 구비함으로써, 환자 의 세밀한 정보와 환자 주변의 정보를 수집할 수 있다. 이를 위해 다수의 IoT 센서는 IoT 혈당측정부, IoT 맥파측정부, IoT 수면상태측정부, IoT 가연성가스 측정부, IoT 스마트콘센트, IoT 모션측정부, IoT 소변측정부, IoT 수액측정부 , IoT 체온측정부 및 IoT 조도측정부 중 적어도 하나를 포함할 수 있다. 이때, 상기 다수의 IoT 센서는 환자가 착용한 웨어러블 디바이스 형태로 구현되거나, 기타 주변 장치나 구 조물에 장착되어 데이터를 측정할 수 있으며, 도 2에 도시된 바와 같이 이동로봇에 장착될 수도 있다. 게이트웨이는 다수의 IoT 센서로부터 수신한 데이터를 수집하여 서버로 송신할 수 있다. 이를 통해 다수의 IoT 센서로부터 측정된 데이터는 게이트웨이를 통해 수집되어 하기 설명할 서버로 송신될 수 있어 보다 효과적인 데이터 수집과 전송이 가능해 질 수 있다. 서버는 상기 게이트웨이로부터 데이터를 수신하여 분석할 수 있으며, 상기 분석된 결과에 따라 환자를 진 단하고 처방할 수 있도록 다수의 주변기기를 제어할 수 있다. 일례로 상기 서버는 데이터 분석 결과에 따라 환자를 처방하기 위해 이동로봇의 움직임을 제어할 수 있으며, 상 기 이동로봇은 서버의 제어에 따라 환자의 주변으로 이동하여 필요한 정보를 수집 또는 제공할 수 있다. 상기 과정을 수행하기 위한 일례로 도 3에 도시된 바와 같이, IoT 모션측정부는, 가속도 센서 및 자이로센 서에 의해 환자의 모션 정보가 수집되면, 상기 수집된 환자의 모션 정보를 상기 게이트웨이를 통해 서버로 전송 하고, 상기 서버는, 상기 수집된 정보를 분석하여 환자의 모션데이터를 추출하여 사용자데이터베이스를 구축하 고 상기 수집된 정보로부터 상기 환자의 운동량 및 보행패턴 중 적어도 어나 하나를 수집하는 사용자모니터링부 를 포함할 수 있다. 이 경우, 상기 사용자모니터링부는, 상기 환자의 운동량 및 생체신호에 기초하여 응급상황을 판단하되, 상기 환 자의 운동량 및 생체신호가 기설정된 기준수치를 초과하는 경우, 기설정된 관리자 단말기에게 즉시 호출신호를 전송할 수 있다. 또한, 상기 서버는, 상기 환자의 호흡, 맥박, 혈압 및 산소포화도 중 적어도 어느 하나를 포함하는 생체신호를 디스플레이하도록 제어하고, 상기 생체신호에 기초하여 추천재활운동영상 및 권장식단 중 적어도 어느 하나를 제공하며, 상기 환자의 진료 및 재활운동 일정에 기초하여 사용자일정안내서비스를 제공하고, 상기 환자의 현재 건강상태를 스스로 점검하는 자가진단서비스를 제공할 수 있다. 또한, 상기 서버는 환자가 이동할 때, 이동로봇 등에 마련된 빔투사부를 통해 상기 환자의 목적지로 향하는 경 로에 유도 발자국을 투사하도록 제어할 수 있으며, 상기 IoT 모션측정부를 통해 수집된 상기 환자의 실제 걸음 과 상기 유도 발자국의 일치도를 산출하고, 상기 일치도에 기초하여 사용자의 재활운동을 관리할 수 있고, 상기 환자별로 목표 운동량을 부여하고, 상기 환자의 설정에 따라 캐릭터 이미지 및 응원문구 중 적어도 어느 하나를상기 유도 발자국과 함께 투사하도록 제어할 수 있다. 또한, 상기 서버는, 상기 IoT 모션측정부를 통해 수집된 상기 환자의 보행 정보를 분석하여 상기 환자의 보행 속도를 산출하고, 상기 보행속도에 기초하여 이동로봇의 속도를 제어하며, 상기 이동로봇의 동선 상에 감지된 장애물의 움직임을 판단하여 고정된 장애물일 경우, 경보음을 발생시키고, 움직이는 장애물일 경우, 상기 환자 에게 음성안내를 제공할 수 있다. 한편, 환자의 수액 잔량을 측정하기 위한 IoT 수액측정부는 환자의 수액 잔량을 측정하고, 수액 잔량이 기 설정된 수치 이하로 측정되는 경우 서버는 위험신호를 의사, 간호사 등의 관리자에게 송신하도록 제어하여 환자 를 신속하게 케어할 수 있도록 제어할 수 있다. 또한, 도 5에 도시된 바와 같이 환자의 스마트폰, 웨어러블 디바이스 등(ex. 가속도 센서 등이 구비됨)을 통해 환자의 모션이 감지될 수 있는데, 서버는 환자의 급격한 이동 등이 감지되는 경우 낙상, 기절 등을 의심할 수 있으므로 이러한 상태를 관리자에게 즉시 고지하도록 제어하여 환자를 즉시 확인하도록 제어할 수 있다. 한편, 서버가 환자의 상태를 제어하기 위해 이동로봇을 통해 환자의 다양한 니즈를 충족시킬 수 있는데 이하에 서는 IoT 센서의 데이터를 분석하여 이동로봇을 제어하고 이를 통해 환자 맞춤형 의료 서비스를 제공하는 과정 을 설명한다. <실시례 1> 이동로봇은 디스플레이부를 포함할 수 있다. 보다 상세하게는, 상기 디스플레이부 상측에 마련된 IoT 모션측정부(ex. 가속도센서 및 자이로센서)를 통해 상 기 환자의 모션 데이터를 수집하고, 서버는 상기 수집된 모션 데이터를 분석하여 상기 환자의 모션을 식별하여 이를 분석한 결과에 따라 환자를 케어할 수 있다. 보다 상세하게는 IoT 모션측정부를 통해 수집된 모션 데이터를 서버로 전송하되, 상기 수집된 모션 데이터를 분 석하여 사용자데이터베이스를 구축하고, 상기 촬영된 영상으로부터 상기 환자의 운동량 및 보행패턴 중 적어도 어느 하나를 수집할 수 있다. 상기 환자정보DB에 저장된 사용자의 경우, 상기 환자정보DB에 저장된 상기 환자의 진단상태, 진료현황, 치료일 정 등의 정보를 불러와 사용자에게 제공하고 상기 환자의 요구사항을 입력받을 수 있다. 예를 들어, 상기 환자가 통원치료중인 경우, 상기 모션 데이터를 통해 상기 환자를 식별하고, 상기 환자정보DB 에 저장된 상기 환자에게 오늘자 치료내용을 이동로봇의 스피커를 통해 안내하며, 담당의사정보 및 진료실의 위 치를 이동로봇의 디스플레이부에 디스플레이 할 수 있다. <실시례 2> 다수의 IoT 센서가 환자의 호흡, 맥박, 혈압 및 산소포화도 등을 측정하고 게이트웨이를 통해 서버에 전달하면, 서버는 이동로봇의 디스플레이부에 환자의 호흡, 맥박, 혈압 및 산소포화도 중 적어도 어느 하나를 포함하는 생 체신호를 디스플레이하도록 제어하고, 상기 생체신호에 기초하여 추천재활운동영상 및 권장식단 중 적어도 어느 하나를 제공하며, 상기 환자의 진료 및 재활운동 일정에 기초하여 사용자일정안내서비스를 제공하고, 상기 환자 의 현재 건강상태를 스스로 점검하는 자가진단 서비스를 제공하도록 제어할 수 있다. 보다 상세하게는, 상기 환자가 입원중인 경우, 상기 환자의 복약시간, 진료시간, 식사시간 및 재활운동시간 등 을 안내하는 사용자일정안내서비스와, 상기 환자에게 반복적인 재활운동이 필요한 경우, 기설정된 시간마다 상 기 환자에게 부위별 재활운동영상을 추천하고, 상기 IoT 모션측정부를 통해 상기 환자의 자세를 인식하여 올바 른 자세를 유지할 수 있도록 안내하는 추천재활영상제공서비스와, 상기 환자에게 처방별 권장식단을 안내하는 권장식단안내서비스와 상기 환자의 현재 건강상태를 점검할 수 있는 인공지능 자가진단서비스가 제공될 수 있다. 또한, 상기 서버는 상기 환자의 운동량 및 생체신호에 기초하여응급상황을 판단하되, 상기 환자의 운동량 및 생 체신호가 기설정된 기준 수치를 초과하는 경우, 기설정된 관리자 단말기에 즉시 호출신호를 전송할 수 있다. 예를 들어, 상기 환자의 호흡 수가 기설정된 기준수치(ex. 분당 16~18회)를 벗어난 경우, 즉시 상기 환자의 보 호자 및 병원관계자 단말기에 호출신호가 전송될 수 있다. <실시례 3> 서버는 환자 주변의 다양한 정보를 IoT 센서들로부터 수집하여 이동로봇이 환자의 이동시 빔투사부를 통해 상기 환자의 목적지로 향하는 유도 발자국을 지면에 투사하도록 제어할 수 있으며, 상기 IoT 모션측정부를 통해 수집 된 상기 환자의 실제 걸음과 상기 유도 발자국의 일치도를 산출하고, 상기 일치도에 기초하여 환자의 재활운동 을 관리하며, 상기 환자별로 목표 운동량을 부여하고, 상기 환자의 설정에 따라 캐릭터 이미지 및 응원문구 중 적어도 어느 하나를 상기 유도 발자국과 함께 투사할 수 있다. 보다 상세하게는, 상기 환자가 진료실, 재활치료실과 같은 목적지를 설정한 경우, 상기 목적지로 향하는 유도 발자국을 지면에 투사하여 상기 환자에게 목적지를 안내할 수 있다. 또한, 상기 재활운동이 필요한 환자의 경우, 상기 환자의 현재 건강상태를 고려하여 목표 운동량을 부여하고, 상기 목표 운동량을 달성할 수 있도록 상기 디스플레이부를 통해 운동자세 및 목표 운동량을 디스플레이하고, 이동로봇의 프로젝터부를 통해 유도 발자국 또는 운동 가이드 이미지를 투사할 수 있으며, 환자가 유아 또는 노 인인 경우, 캐릭터 이미지 및 응원문구 중 적어도 어느 하나를 이용하여 게임형식으로 상기 재활운동을 유도할 수 있다. 예를 들어, 상기 환자가 유아인 경우, 기설정된 캐릭터 이미지를 상기 환자의 전면 바닥에 투사하되, 우측에는 'O', 좌측에는 'X' 텍스트 이미지를 투사하고, 기설정된 퀴즈를 상기 디스플레이부에 디스플레이하여, 상기 환 자는 상기 퀴즈의 대답에 따라 우측 또는 좌측으로 이동하며, 상기 IoT 모션측정부를 통해 수집된 상기 환자가 이동한 방향을 판단하고, 상기 퀴즈의 정답 여부에 따라 상기 환자가 이동할 수 있는 횟수만큼 유도 발자국을 디스플레이 할 수 있다. 따라서, 상기 환자가 상기 퀴즈 게임에 몰입함으로써 상기 할당된 운동량을 달성할 수 있도록 유도하는 효과를 가진다. 또한, 상기 환자의 실제 발자국과 상기 유도 발자국의 일치도를 산출함으로써, 상기 환자가 정확한 보행 자세를 유지할 수 있도록 보조할 수 있는 효과를 가진다. 또한, 상기 환자의 재활운동현황은 상기 기설정된 관리자 또는 보호자 단말기에 즉시 전송됨으로써, 상기 환자 의 건강상태를 상기 기설정된 관리자 또는 보호자가 수시로 체크할 수 있고, 상기 환자의 건강상태에 기초하여 적절한 처방을 제공할 수 있는 효과를 가진다. <실시례 4> 한편, 상기 다수의 IoT 센서들은 이동중인 상기 환자의 진행방향을 기준으로 기설정된 거리 내에 위치하는 장애 물을 인식할 수 있으며, 상기 서버는, 상기 이동로봇의 움직임을 제어하되, 상기 디스플레이부에서 촬영된 상기 환자의 보행 영상을 분석하여, 상기 환자의 보행 속도를 산출하고, 상기 보행 속도에 기초하여 상기 이동로봇의 속도를 제어하며, 상기 감지된 상기 장애물의 움직임을 판단하여 고정된 장애물일 경우, 경보음을 발생시키고, 움직이는 장애물일 경우, 상기 환자에게 음성안내를 제공할 수 있다. 보다 상세하게는, 상기 감지한 장애물이 고정된 장애물인지 움직이는 장애물인지 판단하기 위하여, 상기 환자의 보행 속도에 기초하여 상기 장애물과 상기 환자 사이의 거리 변화량을 분석하여 상기 장애물의 이동성을 판단할 수 있다. 상기 장애물이 상기 환자가 위치한 방향으로 이동중인 경우, 상기 스피커를 통해 경고음성을 제 공하며, 상기 장애물이 고정된 장애물일 경우, 상기 스피커를 통해 경보음을 제공하여 상기 환자로 하여금 상기 장애물을 인식하고 주의할 수 있도록 유도할 수 있다."}
{"patent_id": "10-2019-0178622", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기와 같은 본 발명의 효과에 따르면, 환자의 요구에 따라 병동안내, 일정안내 및 자가진단 서비스 등을 제공 함으로써, 환자가 스스로 건강상태를 점검할 수 있으며, 단순한 정보전달 및 안내와 같은 간호사의 잡무를 수행하여 간호사의 업무량을 감소시켜 줄 수 있는 개인 맞춤형 IoT 의료 시스템이 제공될 수 있다. 또한, 빔프로젝터의 구성을 포함함으로써, 지면에 유도발자국 이미지를 투사하여 사용자에게 길안내 기능을 제 공하고, 재활환자의 경우, 흥미를 유발시킬 수 있는 이미지를 함께 투사하여 적극적인 재활운동을 유도하는 개 인 맞춤형 IoT 의료 시스템이 제공될 수 있다. 또한, IoT 모션측정부를 통해 사용자의 모션 정보를 수집함으로써, 구집된 데이터를 분석하여 사용자의 보행패 턴 등 사용자의 특성을 구분하여 관리할 수 있는 개인 맞춤형 IoT 의료 시스템이 제공될 수 있다. 또한 본 발명의 일실시례에 따른, 개인 맞춤형 의료 보조 로봇 제어 방법은 다양한 컴퓨터로 구현되는 동작을 수행하기 위한 프로그램 명령을 포함하는 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매 체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체는 프 로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이 프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드를 포함한다. 이상과 같이 본 발명의 일실시례는 비록 한정된 실시례와 도면에 의해 설명되었으나, 본 발명의 일실시례는 상 기 설명된 실시례에 한정되는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서 본 발명의 일실시례는 아래에 기재된 특허청구범위에 의해 서만 파악되어야 하고, 이의 균등 또는 등가적 변형 모두는 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2019-0178622", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시례에 따른 개인 맞춤형 IoT 의료 시스템의 구성도이다. 도 2는 본 발명의 일실시례에 따른 개인 맞춤형 IoT 의료 시스템을 이용한 서비스를 제공하는 이동로봇에 다수 의 IoT 센서가 마련된 일실시례를 도시한 도면이다. 도 3은 본 발명의 일실시례에 따라 환자의 건강정보를 IoT 센서로부터 수집하여 환자에 대한 맞춤형 처방을 도 출하는 과정을 도시한 도면이다. 도 4는 본 발명의 일실시례에 따라 수액의 잔량을 센싱하여 관리자에게 고지함으로써 환자의 상태를 관리하는 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 일실시례에 따라 환자의 모션측정을 통해 환자의 낙상 등을 모니터링하여 환자를 보호하는 과 정을 설명하기 위한 도면이다."}
