{"patent_id": "10-2020-0182827", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0091779", "출원번호": "10-2020-0182827", "발명의 명칭": "헬스 케어를 제공하는 게이트웨이 및 방법과, 이의 전자 장치 및 방법", "출원인": "엘지전자 주식회사", "발명자": "이상민"}}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "헬스 케어를 제공하는 게이트웨이에 있어서,통신부;표시부; 및상기 통신부, 및 상기 표시부와 전기적으로 연결된 프로세서를 포함하며,상기 프로세서는,홈 내의 구성원들 각각에 대한 의료 데이터를 상기 통신부를 통해 획득하고,상기 획득된 의료 데이터에 기반하여 구성원들 각각에 대한 건강 상태를 파악하고,홈 내의 적어도 하나의 가전 기기로부터의 로그 데이터, 및 상기 구성원들 각각에 대한 웨어러블 전자 장치로부터의 생체 데이터를 상기 통신부를 통해 획득하고,상기 의료 데이터, 상기 로그 데이터, 및 상기 생체 데이터 중 적어도 일부에 기반하여 상기 구성원들 각각에대한 헬스 정보를 생성하고,상기 생성된 헬스 정보에 기반하여 상기 구성원들 각각에 대한 헬스 케어 정보를 상기 표시부를 통해 표시하도록 설정된 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 의료 데이터는,상기 구성원들 각각의 병원 진료에 대한 제1 정보, 및 상기 병원 진료에 기반한 의약품에 대한 제2 정보를 포함하는 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 프로세서는,적어도 하나의 병원에서의 진료에 대한 정보를 저장하는 제1 서버로부터 상기 제1 정보를 상기 통신부를 통해획득하고,적어도 하나의 약국에서의 의약품 처방에 대한 정보를 저장하는 제2 서버로부터 상기 제2 정보를 상기 통신부를통해 획득하도록 설정된 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 제1 정보는 전자 의료 기록(Electronic Medical Record, EMR), 검진 기록, 진료 기록, 교육 기록, 치료기록, 및 수술 기록 중 적어도 하나에 대한 정보를 포함하며,상기 제2 정보는 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나에 대한 정공개특허 10-2022-0091779-3-보를 포함하는 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 프로세서는,상기 획득된 의료 데이터에 기반한 구성원들 각각에 대한 연령대, 성별, 체중, 기저 질환 종류, 체내 영양소,진료 부위, 및 상기 진료 부위에 대한 진료 내역 중 적어도 하나를 이용하여 상기 건강 상태를 파악하도록 설정된 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 로그 데이터는,상기 적어도 하나의 가전 기기에 각각에 대한 사용 정보, 상기 각 가전 기기에서 획득된 정보, 및 상기 각 가전기기의 동작 정보 중 적어도 일부를 포함하는 게이트웨이"}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 생체 데이터는,혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나를 포함하는 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,저장부를 더 포함하며,상기 프로세서는,상기 통신부를 통해 획득된 상기 의료 데이터, 상기 로그 데이터, 및 상기 생체 데이터를 상기 저장부에 저장하며,상기 저장부는,연령대, 및 성별 중 적어도 하나에 기반한 표준 체중, 표준 체내 영양소, 표준 혈압, 표준 혈당, 표준 맥박, 표준 심전도, 표준 심탄도, 표준 근전도, 표준 심박수, 및 표준 체온 중 적어도 하나에 대한 표준 데이터를 저장하는 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 프로세서는,상기 구성원들 각각에 대한 상기 의료 데이터, 상기 로그 데이터, 및 상기 생체 데이터에 기반하여, 상기 구성원들 각각의 건강 상태가 상기 저장된 표준 데이터에 대응되도록 하는 상기 헬스 정보를 생성하도록 설정된 게이트웨이.공개특허 10-2022-0091779-4-청구항 10 제1 항에 있어서,상기 헬스 케어 정보는,상기 구성원들 각각의 건강 상태가 상기 저장된 표준 데이터에 대응되도록 하기 위한, 운동 정보, 음식 정보,및 의료 기관 방문 추천 정보 중 적어도 일부를 포함하는 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 프로세서는,상기 생성된 헬스 정보에 기반하여 상기 홈 내의 환경을 제어하기 위한 상기 적어도 하나의 가전 기기를 식별하고,상기 생성된 헬스 정보에 기반하여 상기 식별된 적어도 하나의 가전 기기를 제어하기 위한 제어 신호를 생성하고,상기 생성된 제어 신호를 상기 통신부를 통해 상기 적어도 하나의 가전 기기로 전송하도록 설정된 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 제어 신호는,상기 식별된 적어도 하나의 가전 기기의 종류에 따라 온도, 습도, 수분 섭취, 및 음식물 섭취 중 적어도 하나에대한 제어 또는 추천을 나타내는 메시지를 출력하도록 하는 적어도 하나의 명령어를 포함하는 게이트웨이."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "게이트웨이의 헬스 케어 제공 방법에 있어서,홈 내의 구성원들 각각에 대한 의료 데이터를 획득하는 과정;상기 획득된 의료 데이터에 기반하여 구성원들 각각에 대한 건강 상태를 파악하는 과정;홈 내의 적어도 하나의 가전 기기로부터의 로그 데이터, 및 상기 구성원들 각각에 대한 웨어러블 전자 장치로부터의 생체 데이터를 획득하는 과정;상기 의료 데이터, 상기 로그 데이터, 및 상기 생체 데이터 중 적어도 일부에 기반하여 상기 구성원들 각각에대한 헬스 정보를 생성하는 과정; 및상기 생성된 헬스 정보에 기반하여 상기 구성원들 각각에 대한 헬스 케어 정보를 표시하는 과정을 포함하는 헬스 케어 제공 방법."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 의료 데이터는,상기 구성원들 각각의 병원 진료에 대한 제1 정보, 및 상기 병원 진료에 기반한 의약품에 대한 제2 정보를 포함공개특허 10-2022-0091779-5-하는 헬스 케어 제공 방법."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서,상기 의료 데이터를 획득하는 과정은,적어도 하나의 병원에서의 진료에 대한 정보를 저장하는 제1 서버로부터 상기 제1 정보를 획득하는 과정;적어도 하나의 약국에서의 의약품 처방에 대한 정보를 저장하는 제2 서버로부터 상기 제2 정보를 획득하는 과정을 포함하며,상기 제1 정보는 전자 의료 기록(Electronic Medical Record, EMR), 검진 기록, 진료 기록, 교육 기록, 치료기록, 및 수술 기록 중 적어도 하나에 대한 정보를 포함하며,상기 제2 정보는 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나에 대한 정보를 포함하는 헬스 케어 제공 방법."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13 항에 있어서,상기 의료 데이터, 상기 로그 데이터, 및 상기 생체 데이터를 저장부에 저장하는 과정을 더 포함하는 헬스 케어제공 방법."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서,상기 헬스 정보를 생성하는 과정은,상기 구성원들 각각에 대한 상기 의료 데이터, 상기 로그 데이터, 및 상기 생체 데이터에 기반하여, 상기 구성원들 각각의 건강 상태가 상기 저장된 표준 데이터에 대응되도록 하는 상기 헬스 정보를 생성하는 과정을 포함하는 헬스 케어 제공 방법."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13 항에 있어서,상기 헬스 정보를 생성하는 과정은,상기 생성된 헬스 정보에 기반하여 상기 홈 내의 환경을 제어하기 위한 상기 적어도 하나의 가전 기기를 식별하는 과정;상기 생성된 헬스 정보에 기반하여 상기 식별된 적어도 하나의 가전 기기를 제어하기 위한 제어 신호를 생성하는 과정; 및상기 생성된 제어 신호를 상기 적어도 하나의 가전 기기로 전송하는 과정을 포함하는 헬스 케어 제공 방법."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "헬스 케어를 제공하는 전자 장치에 있어서,통신부;공개특허 10-2022-0091779-6-표시부; 및상기 통신부, 및 상기 표시부와 전기적으로 연결된 프로세서를 포함하며,상기 프로세서는,게이트웨이로부터 헬스 정보를 상기 통신부를 통해 획득하고,상기 획득된 헬스 정보에 기반한 어플리케이션을 상기 표시부 상에 표시하고,상기 어플리케이션에 기반하여 외부 전자 장치와 통신 채널을 상기 통신부를 통해 셋업하고,상기 셋업된 통신 채널을 통해 상기 외부 전자 장치로 상기 헬스 정보를 전송하고,상기 헬스 정보의 전송에 기반하여, 상기 외부 전자 장치로부터 수신된 부가 정보를 상기 어플리케이션을 통해표시하도록 설정된 전자 장치."}
{"patent_id": "10-2020-0182827", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 헬스 케어 제공 방법에 있어서,게이트웨이로부터 헬스 정보를 획득하는 과정;상기 획득된 헬스 정보에 기반한 어플리케이션을 표시하는 과정;상기 어플리케이션에 기반하여 외부 전자 장치와 통신 채널을 셋업하는 과정;상기 셋업된 통신 채널을 통해 상기 외부 전자 장치로 상기 헬스 정보를 전송하는 과정; 및상기 헬스 정보의 전송에 기반하여, 상기 외부 전자 장치로부터 수신된 부가 정보를 상기 어플리케이션을 통해표시하는 과정을 포함하는 헬스 케어 제공 방법."}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 헬스 케어를 제공하는 게이트웨이 및 방법과, 전자 장치 및 방법에 관한 것이다. 본 발명의 게이트웨이는 홈 내의 구성원들 각각에 대한 의료 데이터에 기반하여 구성원들 각각에 대한 건강 상태 를 파악할 수 있다. 그리고, 상기 게이트웨이는 상기 의료 데이터, 홈 내의 적어도 하나의 가전 기기로부터의 로 그 데이터, 및 상기 구성원들 각각에 대한 웨어러블 전자 장치로부터의 생체 데이터 중 적어도 일부에 기반하여 구성원들 각각에 대한 헬스 케어 정보를 각 구성원에게 제공할 수 있다. 따라서, 본 발명은 각 구성원들에 대한 헬스 케어 서비스를 제공할 수 있다."}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 헬스 케어를 제공하는 게이트웨이 및 방법과, 이의 전자 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 헬스 케어 (또는 스마트 헬스 케어)는 개인의 건강과 의료에 관한 정보, 전자 기기, 시스템, 플랫 폼을 다루는 산업분야로서 건강관련 서비스와 의료 정보 기술이 융합된 종합 의료 서비스이다. 이러한 헬스 케 어를 통해 사용자는 맞춤형 건강관리서비스를 제공받을 수 있다. 예를 들면, 사용자는 자신이 소유한 휴대 단말, 웨어러블 전자 장치나 클라우드 병원정보시스템 등에서 확보된 생활습관, 신체검진, 의료이용정보, 인 공지능, 가상현실, 유전체정보 등의 분석을 바탕으로 헬스 케어 서비스를 제공받을 수 있다. 종래의 선행 문헌(한국공개특허공보 10-2019-0103104)은 식이 습관을 생체 신호로부터 센싱, 및 분석하여 사용 자의 건강을 관리하는 내용을 개시하고 있다. 이러한 선행 문헌은 맥압 신호, 광전용적맥파 신호, 심전도 신호, 근전도 신호, 심탄도 신호중 하나를 수집하여 사용자의 식이 여부를 판단하는 내용을 개시하고 있다. 이와 같이, 종래에는 단지 사용자의 생체 신호를 획득하여 헬스 케어를 제공할 뿐, 사용자의 생체 신호, 사용자 가 거주하는 홈 내의 적어도 하나의 가전 기기, 및 의료 기관의 의료 데이터를 이용하여 헬스 케어를 제공하지 못하였다. 따라서, 사용자에 대한 다양한 정보 또는 데이터에 기반하여 홈 내의 헬스 케어 서비스를 제공할 필요성이 제기 된다. 선행기술문헌 특허문헌(특허문헌 0001) 한국공개특허공보 10-2019-0103104"}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래에는 사용자의 생체 신호, 사용자가 거주하는 홈 내의 적어도 하나의 가전 기기, 및 의료 기관의 의료 데이 터를 이용하여 사용자에게 헬스 케어 서비스를 제공하지 못하였다 따라서, 본 발명은 홈 내의 각 구성원에 대한 생체 데이터, 의료 기관에 대한 의료 데이터, 및 적어도 하나의 가전 기기에 대한 로그 데이터를 획득하는 게이트웨이 및 방법을 제공하는 것이다. 또한, 본 발명은 각 구성원에 대한 생체 데이터, 의료 데이터, 및 로그 데이터를 이용하여 각 구성원의 헬스 케 어 서비스를 제공하는 게이트웨이 및 방법을 제공하는 것이다. 또한, 본 발명은 헬스 정보에 기반하여 각각의 가전 기기를 독립적으로 제어하는 게이트웨이 및 방법을 제공하 는 것이다. 또한, 본 발명은 헬스 정보에 기반하여 생성된 헬스 케어 정보를 통해서 해당 구성원에게 헬스 케어 서비스를 제공하는 게이트웨이 및 방법을 제공하는 것이다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위해 본 발명의 게이트웨이는 홈 내의 구성원들 각각에 대한 의료 데이터를 획득하고, 상기 획득된 의료 데이터에 기반하여 구성원들 각각에 대한 건강 상태를 파악할 수 있다. 또한, 본 발명의 게이트웨이는 홈 내의 적어도 하나의 가전 기기로부터의 로그 데이터를 획득할 수 있다. 또한, 본 발명의 게이트웨이는 구성원들 각각에 대한 웨어러블 전자 장치로부터의 생체 데이터를 획득할 수 있 다. 또한, 본 발명의 게이트웨이는 각 구성원에 대한 의료 데이터, 각 구성원이 사용한 적어도 하나의 가전 기기에 대한 로그 데이터, 및 각 구성원의 신체에서 획득한 생체 데이터 중 적어도 일부에 기반하여 구성원들 각각에 대한 건강 상태를 파악하고, 헬스 케어 서비스를 위한 헬스 정보를 생성할 수 있다. 또한, 본 발명의 게이트웨이는 상기 헬스 정보에 기반하여 구성원들 각각에 대한 헬스 케어 정보를 각 구성원, 또는 가족 구성원들 모두에게 제공할 수 있다. 또한, 본 발명의 게이트웨이는 적어도 하나의 병원에서의 진료에 대한 정보와 적어도 하나의 약국에서의 의약품 처방에 대한 정보를 획득할 수 있다. 또한, 본 발명의 게이트웨이는 각 구성원에 대한 연령대, 성별, 체중, 기저 질환 종류, 체내 영양소, 진료 부위, 및 상기 진료 부위에 대한 진료 내역 중 적어도 하나를 이용하여 각 구성원의 건강 상태를 파악할 수 있 다. 또한, 본 발명의 게이트웨이는 저장부에 저장된 표준 데이터 즉, 연령대, 및 성별 중 적어도 하나에 기반한 표 준 체중, 표준 체내 영양소, 표준 혈압, 표준 혈당, 표준 맥박, 표준 심전도, 표준 심탄도, 표준 근전도, 표준 심박수, 및 표준 체온 중 적어도 하나에 대한 표준 데이터를 통해 각 구성원의 건강 상태를 파악하여 헬스 정보 를 생성할 수 있다. 또한, 본 발명의 게이트웨이는 구성원들 각각에 대한 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여, 상기 구성원들 각각의 건강 상태가 표준 데이터에 대응되도록 하는 즉, 표준 건강에 부합되도록 하기 위한 유익 한 정보를 포함하는 헬스 정보를 생성할 수 있다.또한, 본 발명의 게이트웨이는 상기 헬스 정보에 기반하여 적어도 하나의 가전 기기를 제어하기 위한 제어 신호 를 통해 상기 적어도 하나의 가전 기기를 제어할 수 있다."}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 홈 내의 구성원들 각각에 대한 의료 데이터를 획득하고, 상기 획득된 의료 데이터에 기반하여 구성원 들 각각에 대한 건강 상태를 파악함으로써, 각 구성원들에 대한 헬스 케어 서비스를 제공할 수 있다. 또한, 본 발명은 홈 내의 적어도 하나의 가전 기기로부터 각 구성원에 대한 로그 데이터와 각 구성원들 각각에 대한 웨어러블 전자 장치로부터의 생체 데이터를 획득함으로써, 각 구성원에 대한 보다 정확한 헬스 케어 서비 스를 제공할 수 있다. 또한, 본 발명은 각 구성원에 대한 의료 데이터, 각 구성원이 사용한 적어도 하나의 가전 기기에 대한 로그 데 이터, 및 각 구성원의 신체에서 획득한 생체 데이터 중 적어도 일부에 기반하여 구성원들 각각에 대한 건강 상 태를 파악하고, 헬스 케어 서비스를 위한 헬스 정보를 생성함으로써, 각 구성원들은 자신의 건강 상태에 따른 헬스 케어 서비스를 제공받을 수 있다. 또한, 본 발명은 적어도 하나의 병원에서의 진료에 대한 정보와 적어도 하나의 약국에서의 의약품 처방에 대한 정보를 획득함으로써, 각 구성원에 대한 보다 정확한 건강 상태를 파악할 수 있다. 또한, 본 발명은 각 구성원에 대한 건강 상태와 연령대 및 성별 중 적어도 하나에 기반한 표준 데이터를 비교함 으로써, 표준 건강 상태 대비 각 구성원의 건강 상태의 정도를 판단할 수 있다. 또한, 본 발명은 표준 건강에 부합되도록 하기 위한 유익한 정보를 포함하는 헬스 정보를 생성 및 제공함으로써, 각 구성원은 실시간으로 자신의 건강을 체크할 수 있다. 또한, 본 발명은 헬스 정보에 기반하여 적어도 하나의 가전 기기를 제어하기 위한 제어 신호를 통해 상기 적어 도 하나의 가전 기기를 제어함으로써, 홈 내의 적어도 하나의 가전 기기를 통해 헬스 케어 서비스를 제공받을 수 있다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2020-0182827", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시 예를상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 비록 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한 되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것으 로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 이하에서 구성요소의 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서 로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개재\"되거나, 각 구성 요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 명세서 전체에서, 특별히 반대되는 기재가 없는 한, 각 구성요소는 단수일수도 있고 복수일 수도 있다. 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않 을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 명세서 전체에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B 를 의미 하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 이하에서는, 본 발명의 몇몇 실시 예에 따른 헬스 케어를 제공하는 게이트웨이 및 방법과, 전자 장치 및 방법을 설명하도록 한다. 도 1은 본 발명의 일 실시 예에 따른 헬스 케어를 제공하는 시스템을 나타낸 예시도이다. 도 1을 참조하면, 본 발명의 일 실시 예에 따른 헬스 케어를 제공하는 시스템은 홈 내의 적어도 하나의 가 전 기기(121, 122, 123, 124)(예: 공기 청정기, 에어컨, 냉장고, 정수기), 게이트웨이 , 웨어러블 전자 장치(예: 스마트 시계 등), 사용자의 전자 장치(예: 스마트 폰 등), 제1 서버 , 제2 서버를 포함할 수 있다. 상기 게이트웨이는 인터넷을 통해 상기 제1 서버 및 상기 제2 서버와 신호 또는 데이터를 송수신할 수 있다. 도 1에 도시된 헬스 케어를 제공하는 시스템의 구성은 일 실시 예에 따른 것이고, 헬스 케어를 제공하는 시스템의 구성 요소들이 도 1에 도시된 실시 예에 한정되는 것은 아니며, 필요에 따라 일부 구성 요소가 부가, 변경 또는 삭제될 수 있다. 일 실시 예에 따르면, 상기 게이트웨이는 홈 내부의 벽면에 배치될 수 있다. 예를 들면, 상기 게이트웨이 는 홈 내부의 전실, 거실, 방, 부엌 등 적어도 한 곳 이상에 배치될 수 있다. 일 실시 예에 따르면, 상기 게이트웨이는 홈 내부에 존재하는 적어도 하나의 가전 기기(예: 공기 청정기 , 에어컨, 냉장고, 정수기), 게이트웨이, 웨어러블 전자 장치(예: 스마트 시계 등), 사용자의 전자 장치(예: 스마트 폰, 태블릿 PC 등))와 유선 또는 무선으로 연결될 수 있다. 또한, 상 기 게이트웨이는 산소 발생기(미도시), 음향 출력 장치(미도시), 조명 장치(미도시), 가습기(미도시), 제 습기(미도시), 및 TV(미도시))와 유선 또는 무선으로 연결될 수 있다. 상기 가전 기기는 이외에도 홈 내부에 배 치되어 사용될 수 있는 다양한 장치를 포함할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이는 각각의 가전 기기로부터 소비 전력, 위치, 및 식별자를 포함하는 정보를 수신할 수 있다. 상기 정보는 가전 기기의 종류에 따라 다를 수 있다. 일 실시 예에 따르면, 상기 게이트웨이는 각각의 가전 기기로부터 홈 내의 가족 구성원 각각에 대한 로그 데이터를 수신할 수 있다. 상기 게이트웨이는 상기 적어도 하나의 가전 기기에 각각에 대한 사용 정보, 상 기 각 가전 기기에서 획득된 정보, 및 상기 각 가전 기기의 동작 정보 중 적어도 일부를 획득할 수 있다. 일 실시 예에 따르면, 제1 서버는 적어도 하나의 병원에서의 진료에 대한 정보(예: 전자 의료 기록 (Electronic Medical Record, EMR), 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하 나)를 저장할 수 있다. 상기 제1 서버는 의료 기관(예: 병원 등) 또는 의료 기관에 관련된 정부 기관(예:건강보험심사평가원, 건강보험공단 등)에서 관리하는 서버일 수 있다. 일 실시 예에 따르면, 상기 제1 서버는 정부 기관(예: 건강보험심사평가원)에서 관리하며, 건강보험공단, 약학정보원, 식품안전정보원의 의료 데이터를 관리하는 오픈 API를 통해 홈 내의 구성원들 각각에 대한 전자 의 료 기록, 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 저장할 수 있다. 또는, 상기 제1 서버는 정부 기관(예: 건강보험심사평가원)에서 국민에 대한 의료 처방/검진을 관리하는 마이데 이터 플래폼을 통해 홈 내의 구성원들 각각에 대한 전자 의료 기록, 검진 기록, 진료 기록, 교육 기록, 치료 기 록, 및 수술 기록 중 적어도 하나를 저장할 수 있다. 일 실시 예에 따르면, 제2 서버는 적어도 하나의 약국에서의 의약품 처방에 대한 정보(예: 의약품 처방 접 수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나)를 저장할 수 있다. 상기 제2 서버는 약국 또는 의약품에 관련된 정부 기관(예: 약학정보원, 식품안전정보원 등)에서 관리하는 서버일 수 있다. 일 실시 예에 따르면, 상기 제2 서버는 홈 내의 구성원들 각각에 대한 처방전, 판매된 의약품 정보, 및 결 제 내역을 저장할 수 있다. 일 실시 예에 따르면, 적어도 하나의 전자 장치(131, 132)는 구성원의 생체 데이터(혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나)를 획득할 수 있다. 그리고, 상기 적어도 하나의 전자 장치 (131, 132)는 획득된 생체 데이터를 게이트웨이로 전송할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 게이트웨이의 블록도이다. 도 2를 참조하면, 본 발명의 일 실시 예에 따른 게이트웨이는 통신부, 입력부, 표시부, 저 장부, 카메라부, 스피커, 센서부, 및 전원부을 포함할 수 있다. 도 2에 도시된 게이트웨이의 구성은 일 실시 예에 따른 것이고, 게이트웨이의 구성 요소들이 도 2에 도시된 실시 예에 한정되는 것은 아니며, 필요에 따라 일부 구성 요소가 부가, 변경 또는 삭제될 수 있다. 일 실시 예에 따르면, 상기 통신부는 게이트웨이에 포함된 적어도 하나의 구성 요소(예: 입력부 , 표시부, 저장부, 프로세서, 카메라부, 스피커, 센서부, 및 전원부 )와 유선 통신 또는 무선 통신을 통해 적어도 하나의 신호 또는 정보를 송수신할 수 있는 적어도 하나의 회로를 포함할 수 있다. 일 실시 예에 따르면, 상기 통신부는 적어도 하나의 가전 기기(121, 122, 123, 124), 또는 적어도 하나의 전자 장치(131, 132)와 유선 통신 또는 무선 통신을 통해 적어도 하나의 신호 또는 정보를 송수신할 수 있는 적 어도 하나의 회로를 포함할 수 있다. 또한, 상기 통신부는 인터넷을 통해 제1 서버 및 제2 서버 중 적어도 하나와 유선 통신 또는 무선 통신을 통해 적어도 하나의 신호 또는 정보를 송수신할 수 있는 적어도 하나의 회로를 포함할 수 있다. 일 실시 예에 따르면, 상기 통신부는 다양한 외부 장치로부터 신호 또는 데이터를 수신 또는 송신할 수 있 음은 자명하다. 일 실시 예에 따르면, 상기 입력부는 외부 장치(예: USB(Universal Serial Bus), 외장 하드(미도시) 등) 로/로부터 데이터를 송신/수신할 수 있는 인터페이스를 포함할 수 있다. 상기 입력부는 사용자로부터 입력 된 다양한 정보를 상기 프로세서로 제공할 수 있다. 이를 위해, 입력부는 스위치, 버튼 등의 물리적 인 조작부재를 포함하거나 터치 키, 터치 패드, 터치 스크린 등의 전기적인 조작부재를 포함할 수 있다. 또는, 상기 입력부는 사용자의 음성 신호를 입력 받을 수 있는 마이크(미도시)를 더 포함할 수 있다. 일 실시 예에 따르면, 상기 표시부는 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있다. 상기 표시부는 상기 프로세서에 의해 처리된, 처리중, 또는 처리될 결과를 표시할 수 있다. 상기 표시부는 게이트웨이를 통해 적어도 하나의 가전 기기의 동작 상태 또는 적어도 하나의 가전 기 기에 대한 다양한 정보를 시각적으로 제공할 수 있고, 이러한 다양한 정보를 표시하는 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 상기 표시부는 상기 프로세서에 의해 생성된 구성원들 각각에 대한 헬스 정보 및 헬스 케어 정보 중 적어도 일부를 표시할 수 있다. 일 실시 예에 따르면, 상기 표시부는 터치를 감지하는 터치 회로(touch circuitry), 또는 터치에 대한 압 력의 세기를 측정할 수 있는 압력 센서를 포함할 수 있다.일 실시 예에 따르면, 상기 표시부는 제1 모드(예: 미러 모드), 제2 모드(예: 스마트 미러 모드), 및 제3 모드(예: 디스플레이 모드)로 동작될 수 있다. 상기 제1 모드는 일반적인 미러와 같이 사물을 완전하게 반사시 키는 모드이고, 상기 제2 모드는 상기 제1 모드에 기반하여 적어도 일부의 정보를 표시하는 모드이고, 상기 제3 모드는 상기 프로세서에 의한 적어도 일부의 정보만을 표시하는 모드이다. 이와 같이, 상기 표시부는 이러한 다양한 모드를 지원하기 위해 다양한 패널(예: 편광층, 도전층, 절연층, 디스플레이 패널, 터치 센싱 패 널 등)을 포함할 수 있다. 일 실시 예에 따르면, 상기 표시부는 미러 및 투명 디스플레이부를 포함할 수 있다. 상기 투명 디스플레이부는 상기 미러의 전면에 배치되어, 미러를 통해 투명 디스플레이부의 전면에 있는 사용자의 거울상을 표시할 수 있다(제1 모드). 그리고, 상기 프로세서에 의해 투명 디스플레이 의 투과율 및 반사율이 조정됨으로써, 상기 표시부는 미러를 통해 거울상을 표시하면서, 투명 디스플 레이부를 통해 다양한 정보를 표시할 수 있다. 일 실시 예에 따르면, 상기 투명 디스플레이부는 광을 선택적으로 투과 및 반사시켜 광 효율을 향상시키는 광학 부재를 포함할 수 있다. 상기 투명 디스플레이부는 X축의 굴절률은 같고, Y축의 굴절률은 다른 복수 개의 필름을 번갈아 적층한 구조일 수 있다. 상기 투명 디스플레이부는 굴절률이 같은 X축은 투과축으로서 빛을 투과시키고, 굴절률이 다른 Y축은 반사축으로서 빛을 반사시킬 수 있다. 예를 들어, 상기 투명 디스플레이 부는 빛의 성분 중 P파는 투과시키고 S파는 연속적으로 반사시킬 수 있다. 일 실시 예에 따르면, 상기 투명 디스플레이부는 크기가 작은 휴대형 디스플레이부터 대형 디스플레이까지 적용이 가능할 수 있다. 일 실시 예에 따르면, 상기 표시부는 제 1 영역 및 제 2 영역으로 표시 영역이 구분될 수 있으며, 이를 통 해 컨텐트의 중요도 및/또는 종류에 따라 투명 디스플레이의 상이한 영역에 표시되도록 구현될 수 있다. 본 발명이 적용되는 실시 예에 따라 투명 디스플레이의 표시 영역은 다양한 형태로 구분될 수 있다. 일 실시 예에 따르면, 상기 저장부는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 예를 들면, 상기 저장부는 게이트웨이, 또는 적어도 하나의 가전 기기(121, 122, 123, 124) 또는 적어도 하나의 전자 장치(131, 132)의 동작에 필요한 정보, 데이터, 프로그램 등이 저장될 수 있다. 이에 따라, 상기 프로세서 는 저장부에 저장된 정보를 참조하여 후술하는 제어 동작을 수행할 수 있다. 상기 저장부는 다 양한 플랫폼(platform)을 저장할 수도 있다. 상기 저장부는, 예를 들어 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM), 롬(EEPROM 등), USB 메모리 중 적어도 하나의 타입 의 저장매체를 포함할 수 있다. 일 실시 예에 따르면, 상기 저장부는 상기 게이트웨이의 적어도 하나의 구성요소(예: 통신부, 입력부, 표시부, 저장부, 프로세서, 카메라부, 스피커, 센서부, 및 전원 부)에 의해 획득되거나 또는 사용되는 다양한 데이터(예: 소프트웨어, 어플리케이션, 획득된 정보, 측정된 정보, 제어 신호 등), 및 이와 관련된 명령어들을 저장할 수 있다. 예를 들면, 상기 저장부는 적어도 하나 의 가전 기기(121, 122, 123, 124)와 적어도 하나의 전자 장치(131, 132)로부터 수신된 제어 신호 또는 데이터 를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 기 등록된 사용자(예: 가족 구성원)에 대한 정보를 저장할 수 있다. 상기 저장부는 기 등록된 사용자(예: 가족 구성원)에 대한 정보(예: 이름, 성별, 나이, 체중, 키 등), 및 생체 정보(예: 혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 인터넷을 통해 수신된 표준 데이터(예: 연령대, 및 성별 중 적 어도 하나에 기반한 표준 체중, 표준 체내 영양소, 표준 혈압, 표준 혈당, 표준 맥박, 표준 심전도, 표준 심탄 도, 표준 근전도, 표준 심박수, 및 표준 체온 중 적어도 하나에 대한 표준 데이터)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 적어도 하나의 병원에서의 진료에 대한 정보를 저장하는 서버(예: 제 1 서버)로부터 수신된 정보(예: 전자 의료 기록(Electronic Medical Record, EMR), 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 적어도 하나의 약국에서의 의약품 처방에 대한 정보를 저장하는 서버 (예: 제2 서버)로부터 수신된 정보(예: 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결 제 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 홈 내의 적어도 하나의 가전 기기(121, 122, 123, 124)로부터 수신된 로그 데이터(예: 적어도 하나의 가전 기기에 각각에 대한 사용 정보, 각 가전 기기에서 획득된 정보, 및 각 가 전 기기의 동작 정보 중 적어도 일부)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 각 구성원의 전자 장치(예: 스마트 시계, 스마트 폰, 태블 릿 PC(미도시) 등 등)로부터 수신된 생체 데이터(혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 카메라부는 적어도 하나의 카메라를 포함할 수 있다. 상기 카메라부는 홈 내부의 사물 또는 사용자에 대한 이미지를 획득할 수 있다. 상기 카메라부는 인공지능 칩(예: ThinQ)이 내 장된 영상 지능 카메라(또는 스마트 영상 지능 카메라)를 포함할 수 있다. 이러한 영상 지능 카메라를 통해 재 실자의 얼굴을 인식할 수 있고, 재실자의 존재 여부를 감지할 수 있다. 일 실시 예에 따르면, 영상 지능 카메라는 인공지능 칩(예: ThinQ)에서 동작 가능한 딥러닝 기반 알고리즘이 적 용된 카메라로서, 사용자 등록 및 인식, 사용자 접근 감지, 재실자 인지 사용자의 귀가 인지, 및 셀프 모니터링 촬영 기능 등 개인 맞춤형 서비스를 제공할 수 있다. 이러한 영상 지능 카메라는 게이트웨이의 카메라부 에 포함될 수 있다. 일 실시 예에 따르면, 상기 카메라부는 조명에 의한 조도가 높은 상황에서도 사용자에 대한 이미지를 획득 할 수 있는 카메라(예: RGB(Red Green Blue) 카메라)), 조도가 낮은 상황에서 이미지를 획득할 수 있는 IR(infrared) 카메라를 포함할 수 있다. 상기 카메라부는 이미지를 획득하는데 필요한 조명을 발광하는 소 자(예: LED, IR 패턴 조명)를 포함할 수 있다. 일 실시 예에 따르면, 상기 스피커는 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환 시킬 수 있다. 상기 스피커는 음향 출력 장치(예: 이어폰 또는 헤드폰)를 통해 소리를 출력할 수 있다. 상 기 스피커는 음향 신호를 게이트웨이의 외부로 출력할 수 있다. 상기 스피커는 홈 내부에 존재 하는 사용자에게 제공되는 정보를 음성으로 출력할 수 있다. 일 실시 예에 따르면, 상기 스피커는 게이트웨이내에 별도의 구성 요소로서 배치되거나, 또는 상기 표시부와 함께 출력부(미도시)에 포함될 수 있다. 일 실시 예에 따르면, 상기 센서부는 게이트웨이에 접근하는 사용자와의 거리, 사용자의 움직임, 또 는 게이트웨이가 설치된 장소의 밝기 등을 감지할 수 있는 적어도 하나의 센서를 포함할 수 있다. 예를 들 면, 상기 센서부는 거리 측정 센서(미도시), 움직임 감지 센서(미도시), 및 조도 센서(미도시)를 포함할 수 있다. 일 실시 예에 따르면, 상기 전원부는 외부 전원(미도시)과 유선 또는 무선으로 연결될 수 있고, 이러한 유 선 또는 무선에 기반한 연결을 통해 상기 외부 전원으로부터 전원을 공급받을 수 있다. 상기 전원부는 상 기 프로세서의 제어 하에, 전압을 상기 게이트웨이가 동작될 수 있는 전압으로 조절하고, 상기 조절 된 전압을 상기 게이트웨이에 포함된 각각의 구성 요소로 공급할 수 있다. 일 실시 예에 따르면, 상기 전원부는 외부 전원과의 유선 연결 또는 무선 연결을 위한 인터페이스(미도 시)를 포함할 수 있다. 상기 인터페이스(미도시)는 HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스, 또는 D-sub(D-subminiature)를 포함할 수 있다. 상기 인터페이스 (미도시)는 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure digital) 카드/MMC(multi- media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 소프트웨어를 구동하여 상기 프로세서에 연결된 적어도 하나 의 구성요소(예: 통신부, 입력부, 표시부, 저장부, 카메라부, 스피커, 센서부 , 및 전원부)를 유선 통신 또는 무선 통신에 기반하여 제어할 수 있다. 그리고, 상기 프로세서 는 상기 유선 통신 또는 상기 무선 통신에 기반하여 다양한 데이터 처리 및 연산을 수행할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 통신부, 입력부, 표시부, 저장부, 카메라부 , 스피커, 센서부, 및 전원부 등으로부터 수신된 명령 또는 데이터를 상기 저장부에 로드하여 처리하고, 처리된 데이터를 저장부에 저장할 수 있다. 또는, 상기 프로세서는 상기 처리된데이터를 표시부를 통해 표시하거나, 또는 스피커를 통해 출력할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이 또는 적어도 하나의 가전 기기에는 인공지능 칩(예: ThinQ)이 내장될 수 있다. 또는, 상기 인공지능 칩에 대한 알고리즘은 상기 프로세서에 의해 구현될 수 있다. 상기 인공지능 칩은 인간의 뇌 신경망을 모방한 프로세서로서 다양한 데이터를 스스로 분석, 인지, 추론, 판단 하는 딥러닝 알고리즘을 지원할 수 있다. 이를 통해, 본 발명의 게이트웨이(예: 프로세서)는 카메라 부를 통해 공간, 위치, 사물, 사용자 등을 인식하고 구분할 수 있으며, 사용자의 음성 또는 주변 소음의 특징을 인식할 수 있다. 또한, 적어도 하나의 가전 기기 역시 이러한 인공지능 칩이 내장될 수 있다. 이를 통해, 상기 게이트웨이(예: 프로세서)는 인공지능 칩을 통해 홈 내부의 가전 기기와 서로 연동하면서, AloT(Aritificial Intelligence Internet of Things) 플랫폼을 제공할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이는 인공지능 칩(예: ThinQ)을 통해 구성원들 각각에 대한 의료 데이터, 적어도 하나의 가전 기기에 대한 로그 데이터, 및 적어도 하나의 전자 장치로부터 획득된 생체 데이터 중 적어도 일부에 기반하여 구성원들 각각에 대한 헬스 정보를 생성할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이는 인공지능 칩(예: ThinQ)을 통해 상기 생성된 헬스 정보에 기반하여 구성원들 각각에 대한 헬스 케어 정보를 생성할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 홈 내의 구성원들 각각에 대한 의료 데이터를 통신부를 통해 획득하고, 상기 획득된 의료 데이터에 기반하여 구성원들 각각에 대한 건강 상태를 파악할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 가족 구성원 각각에 대한 병원에서 관리하는 서버에 저장된 전자 의료 기록(EMR), 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 통신부를 통해 획득할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 가족 구성원 각각에 대한 약국에서 관리하는 서버에 저장된 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나를 통신부를 통해 획득할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 가족 각 구성원들 각각에 대한 인증 절차를 수행하고, 인증이 성공 되는 경우 해당 기관의 서버에 접속하여 구성원들 각각에 대한 의료 데이터를 획득할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 의료 데이터에 기반한 구성원들 각각에 대한 연령대, 성별, 체중, 기저 질환 유무/종류, 체내 영양소, 진료 부위, 및 상기 진료 부위에 대한 진료 내역 중 적어도 하나를 획득하여 각 구성원들의 건강 상태를 판단할 수 있다. 예를 들면, 상기 프로세서는 상기 의료 데이터에 기 반하여, 구성원들 각각에 대해 혈압 정상 여부, 혈당 정상 여부, 비만 정도, 감기/알러지 여부 등을 판단할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 홈 내의 적어도 하나의 가전 기기로부터의 로그 데이터, 및 상기 구성원들 각각에 대한 웨어러블 전자 장치로부터의 생체 데이터를 통신부를 통해 획득할 수 있다. 상기 프 로세서는 홈 내의 적어도 하나의 가전 기기(121, 122, 123, 124)에 각각에 대한 사용 정보, 상기 각 가전 기기(121, 122, 123, 124)에서 획득된 정보, 및 상기 각 가전 기기(121, 122, 123, 124)의 동작 정보 중 적어 도 일부를 포함하는 로그 데이터를 상기 각 가전 기기(121, 122, 123, 124)로부터 획득할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 각 구성원이 착용하고 있는 웨어러블 전자 장치(예: 스마트 시계, 무선 이어폰 등)와 휴대하고 있는 전자 장치(예: 스마트 폰, 패블릿 PC 등)으로부터 해당 구성원에 대한 생체 데이터(예: 혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나)를 획득할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 각 구성원에 대한 의료 데이터, 로그 데이터, 및 생체 데이터 중 적어도 일부에 기반하여 각 구성원에 대한 헬스 정보를 생성할 수 있다. 상기 프로세서는 상기 의료 데이 터, 로그 데이터, 및 생체 데이터에 기반하여 각 구성원에 대한 혈압 값, 혈당 값, 맥박 값, 심전도 값, 심탄도 값, 근전도 값, 심박수 값, 및 체온 값 중 적어도 하나를 포함하는 헬스 정보를 획득할 수 있다. 상기 프로세서 는 구성원들 각각에 대한 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여, 상기 구성원들 각각의 건강 상태가 저장부에 저장된 표준 데이터에 대응되도록 하는(또는 같아지도록 하는) 헬스 정보(예: 획득 된 헬스 정보와 표준 데이터의 차이 값에 대한 정보)를 생성할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 생성된 헬스 정보에 기반하여 상기 구성원들 각각에 대한 헬 스 케어 정보를 표시부를 통해 표시할 수 있다. 상기 프로세서는 상기 헬스 정보에 기반하여 각 구성원에 대한 맞춤형 헬스 케어 정보를 표시부 상에 표시하거나, 스피커를 통해 출력할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 구성원들 각각의 건강 상태가 상기 표준 데이터에 대응되도록 하기 위한, 운동 정보(예: 운동 종류, 운동 시간 등), 음식 정보(예: 음식 종류, 수량, 칼로리 등), 및 의료 기관(예: 주변에 위치한 병원, 약국) 방문 추천 정보 중 적어도 일부를 포함하는 헬스 케어 정보를 표시부 상에 표시하거나, 스피커를 통해 출력할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 각 구성원에 대한 의료 데이터, 로그 데이터, 및 생체 데이터에 기 반하여 홈 내 환경을 제어하기 위한 적어도 하나의 가전 기기를 식별할 수 있다. 상기 프로세서는 헬스 정 보, 및 헬스 케어 정보 중 적어도 일부에 기반하여 홈 내의 가전 기기를 식별할 수 있다. 상기 프로세서는 구성원에 대한 헬스 케어를 제공하는데 도움이 되는 적어도 하나의 가전 기기를 식별할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 각 구성원에 대한 맞춤형 헬스 서비스를 제공하기 위해, 의료 데이 터, 로그 데이터, 및 생체 데이터에 기반하여 적어도 하나의 가전 기기를 제어하기 위한 제어 신호를 생성하고, 상기 생성된 제어 신호를 해당 가전 기기로 전송할 수 있다. 상기 프로세서는 헬스 정보, 및 헬스 케어 정 보 중 적어도 일부에 기반하여 상기 식별된 적어도 하나의 가전 기기(121, 122, 123, 124)를 제어하기 위한 제 어 신호를 생성할 수 있다. 상기 제어 신호는 상기 식별된 적어도 하나의 가전 기기의 종류에 따라 온도, 습도, 수분 섭취, 및 음식물 섭취 중 적어도 하나에 대한 제어 또는 추천을 나타내는 메시지를 출력하도록 하는 적어 도 하나의 명령어를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 복수의 가전 기기들의 동작을 제어 또는 추천 정보 제공 등에 대한 복수의 제어 신호들을 각각 생성하고, 상기 각각 생성된 제어 신호를 해당 가전 기기(예: 공기 청정기, 에 어컨, 정수기)로 전송할 수 있다. 예를 들면, 상기 프로세서는 상기 제어 신호를 통신부를 통해 상기 적어도 하나의 가전 기기(121, 122, 123, 124)로 직접 전송할 수 있다. 예를 들면, 상기 프로세서 는 상기 제어 신호 및 헬스 정보를 TV로 전송할 수 있고, TV는 상기 제어 신호 및 헬스 정보에 기반하여 헬스 케어 정보를 표시할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 게이트웨이의 헬스 케어 제공 방법을 나타낸 순서도이다. 도 4a는 본 발명 의 일 실시 예에 따른 게이트웨이에 고혈압에 관한 헬스 케어 정보를 표시한 예시도이다. 도 4b는 본 발명의 일 실시 예에 따른 게이트웨이에 당뇨에 관한 헬스 케어 정보를 표시한 예시도이다. 이하, 도 3, 도 4a, 및 도 4b를 참조하여 본 발명의 일 실시 예에 따른 게이트웨이의 헬스 케어 제공 방법을 상 세히 설명하면 다음과 같다. 일 실시 예에 따르면, 게이트웨이(예: 프로세서)는 의료 기관의 서버로부터 가족 구성원 각각에 대한 의료 데이터를 획득할 수 있다(S310). 상기 게이트웨이(예: 프로세서)는 가족 구성원 각각에 대한 병 원에서 관리하는 서버에 저장된 전자 의료 기록(Electronic Medical Record, EMR), 검진 기록, 진료 기록, 교 육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 통신부를 통해 수신하고, 상기 수신된 전자 의료 기 록, 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 저장부에 저장할 수 있 다. 또는, 상기 게이트웨이(예: 프로세서)는 국가에서 국민의 의료 데이터를 관리 및 저장하고 있는 기관(예: 건강보험심사평가원, 건강보험공단 등)의 서버에 접속하여, 홈 내의 구성원들 각각에 대한 전자 의료 기록, 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 획득할 수 있다. 도 1의 제1 서버는 의료 기관(예: 병원 등) 또는 의료 기관에 관련된 정부 기관(예: 건강보험심사평가원, 건강보 험공단 등)에서 관리하는 서버일 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 가족 구성원 각각에 대한 약국에서 관리하는 서버에 저장된 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나를 통신부 를 통해 수신하고, 상기 수신된 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적 어도 하나를 저장부에 저장할 수 있다. 또는, 상기 게이트웨이(예: 프로세서)는 국가에서 국민 의 의약품 데이터를 관리 및 저장하고 있는 기관(예: 약학 정보원, 식품안전정보원 등)의 서버에 접속하여, 홈 내의 구성원들 각각에 대한 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나 를 획득할 수 있다. 도 1의 제2 서버는 약국 또는 의약품에 관련된 정부 기관(예: 약학정보원, 식품안전정 보원 등)에서 관리하는 서버일 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 정부 기관(예: 건강보험심사평가원)에서 관 리하며, 건강보험공단, 약학정보원, 식품안전정보원의 의료 데이터를 관리하는 오픈 API를 통해 홈 내의 구성원들 각각에 대한 전자 의료 기록, 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 획득할 수 있다. 또는, 상기 게이트웨이(예: 프로세서)는 정부 기관(예: 건강보험심사평가원)에서 국 민에 대한 의료 처방/검진을 관리하는 마이데이터 플래폼을 통해 홈 내의 구성원들 각각에 대한 전자 의료 기록, 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나를 획득할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 가족 각 구성원들 각각에 대한 인증 절차를 수행하고, 인증이 성공되는 경우 해당 서버에 접속하여 구성원들 각각에 대한 의료 데이터를 획득할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 획득된 의료 데이터에 기반하여 각 구 성원의 건강 상태를 파악할 수 있다(S312). 상기 게이트웨이(예: 프로세서)는 상기 의료 데이터에 기 반한 구성원들 각각에 대한 연령대, 성별, 체중, 기저 질환 유무/종류, 체내 영양소, 진료 부위, 및 상기 진료 부위에 대한 진료 내역 중 적어도 하나를 획득하여 각 구성원들의 건강 상태를 판단할 수 있다. 예를 들면, 상 기 게이트웨이(예: 프로세서)는 상기 의료 데이터에 기반하여, 구성원들 각각에 대해 혈압 정상 여부, 혈당 정상 여부, 비만 정도, 감기/알러지 여부 등을 판단할 수 있다. 예를 들면, 상기 게이트웨이(예: 프로세서)는 의료 데이터에 기반하여 특정 구성원이 항히스타민제를 복용중인 것으로 판단되면, 현재 알러지 치료중인 것으로 판단할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 홈 내의 적어도 하나의 가전 기기로부터 가 족 구성원 각각에 대한 로그 데이터를 획득할 수 있다(S314). 상기 게이트웨이(예: 프로세서)는 홈 내의 적어도 하나의 가전 기기(121, 122, 123, 124)에 각각에 대한 사용 정보, 상기 각 가전 기기(121, 122, 123, 124)에서 획득된 정보, 및 상기 각 가전 기기(121, 122, 123, 124)의 동작 정보 중 적어도 일부를 포함하 는 로그 데이터를 상기 각 가전 기기(121, 122, 123, 124)로부터 획득할 수 있다. 그리고, 상기 게이트웨이 (예: 프로세서)는 상기 각 가전 기기(121, 122, 123, 124)로부터 획득된 로그 데이터를 저장부(24 0)에 저장할 수 있다. 아래 [표 1]은 일 실시 예에 따른 각 가전 기기에 따른 로그 데이터의 예를 나타낸다. 표 1 종류 분석 지표 에어컨 운전 모드 별 가동시간운전 모드 별 온도 운전 모드 별 습도운전 모드 별 바람 세기 공기청정기동작 명령 별 제어 횟수옵션 모드 상세 설정동작 명령 제어 횟수 (시간, 사용 기간 별) 냉장고 시간 별 냉장실/냉동실 별 문 열림 횟수월 별 냉장실/냉동실 별 문 열림 횟수시간 별 온도 월 별 온도 김치 냉장고시간 별 상/중/하 칸 문 열림 횟수 월 별 상/중/하 칸 문 열림 횟수 시간 별 보관 모드월 별 보관 모드 정수기 시간 별 냉/온/정수 물 수취량 월 별 냉/온/정수 물 수 취량 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 [표 1]에서 기술한 가전기기 이외에 홈 내에 비치된 다양한 가전 기기(예: 세탁기, 건조기, 스타일러, 식기세척기, 레인지, 광파 오픈, 전자 레인지 등)에 대한 로그 데이터를 획득할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 각 가전 기기의 일 측에 설치된 카메라(미도 시), 도어 열림/닫힘을 감지하는 센서, 전자 장치의 어플리케이션을 통한 입력, 동작 내역 등을 통해 각 가전 기기(예: ThinQ)에서 획득된 정보, 사용 정보 및 동작 정보 중 적어도 일부를 획득할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 웨어러블 전자 장치로부터 각 구성원에 대한 생체 데이터를 획득할 수 있다(S316). 상기 게이트웨이(예: 프로세서)는 각 구성원이 착용하고 있는 웨어러블 전자 장치(예: 스마트 시계, 무선 이어폰 등)와 휴대하고 있는 전자 장치(예: 스마트 폰, 패블릿 PC 등)으로부터 해당 구성원에 대한 생체 데이터(예: 혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나)를 획득할 수 있다. 아래 [표 2]는 일 실시 예에 따른 각 가전 기기, 및 각 전자 장치에 따른 생체 데이터, 행동_섭취 데이터, 행동 _움직임 데이터, 및 환경 데이터의 예를 나타낸다. 표 2 측정 카테고 리측정 대상 센서의 위치 불면증비만코골이고혈압근골격피부노화 생체 데이터주관적인 감정/ 생각폰(셀프기록) OOO 생체 데이터 심박 웨어러블 OO O 생체 데이터 체온 웨어러블 OO O 생체 데이터 혈압 웨어러블 OO O 생체 데이터체중/인바디 전자제품 OO O O 생체 데이터피부체크 공간_침실 행동_섭취 식사 시간 식탁, 주방 OO O 행동_섭취알코올섭취 시간/양폰(셀프기록) OOO O O O 행동_섭취카페인 섭취 시 간/양폰(셀프기록) O O O 행동_섭취 복약 유무 물건_약통 O O O 행동_섭취 식단 폰(셀프기록) O 행동_섭취 물 섭취량 전자제품 O O 행동_섭취 흡연 폰(셀프기록) O O 행동_섭취 간식 섭취 폰(셀프기록) O O 행동_움직임기상/취침 시간침대 / 웨어러블 O O O 행동_움직임움직임 (시간/강 도)웨어러블 OOO O O O 행동_움직임야외 활동 시간 /강도웨어러블 OOO O 행동_움직임티비시청 시간 전자제품 O 행동_움직임스마트폰 사용 시간전자제품 O 행동_움직임잠들기 전까지 누워있는 시간침대 / 웨어러블 O O 행동_움직임밤 시간 동안 기 상횟수침대 / 웨어러블 O O O 행동_움직임 낮잠 침대 / 웨어러블 행동_움직임 외출 공간_현관문 O 행동_움직임가사노동 시간 전자제품 행동_움직임 배변 물건_변기 O 행동_움직임 손 씻기 물건_수도꼭지 환경 침실온도/습도 공간_침실 O O O 환경 댁 내 공기질 공간_( 침실,거실,주방)O 환경 소음/큰소리 공간_( 침실,거실,주방)O O 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 [표 2]에서 기술한 각 가전 기기, 및 각 전자 장치 이외에 홈 내에 비치된 다양한 가전 기기(예: 세탁기, 건조기, 스타일러, 식기세척기, 레인지, 광 파 오픈, 전자 레인지 등)로부터 생체 데이터, 행동_섭취 데이터, 행동_움직임 데이터, 및 환경 데이터에 대한 로그 데이터를 획득할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 구성원들 각각에 대한 의료 데이터, 로그 데 이터, 생체 데이터를 저장부에 저장할 수 있다. 상기 저장부는 연령대, 및 성별 중 적어도 하나에 기 반한 표준 체중, 표준 체내 영양소, 표준 혈압, 표준 혈당, 표준 맥박, 표준 심전도, 표준 심탄도, 표준 근전도, 표준 심박수, 및 표준 체온 중 적어도 하나에 대한 표준 데이터를 저장할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 획득된 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여 각 구성원에 대한 헬스 정보를 생성할 수 있다(S318). 상기 게이트웨이(예: 프로 세서)는 상기 획득된 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여 각 구성원에 대한 혈압 값,혈당 값, 맥박 값, 심전도 값, 심탄도 값, 근전도 값, 심박수 값, 및 체온 값 중 적어도 하나를 포함하는 헬스 정보를 획득할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 구성원들 각각에 대한 의료 데이터, 로그 데 이터, 및 생체 데이터에 기반하여, 상기 구성원들 각각의 건강 상태가 상기 저장부에 저장된 표준 데이터 에 대응되도록 하는(또는 같아지도록 하는) 헬스 정보(예: 획득된 헬스 정보와 표준 데이터의 차이 값에 대한 정보)를 생성할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 생성된 헬스 정보에 기반하여 각 구성 원에 대한 맞춤형 헬스 케어 정보를 제공할 수 있다(S320). 상기 게이트웨이(예: 프로세서)는 구성원 들 각각의 건강 상태가 상기 표준 데이터에 대응되도록 하기 위한, 운동 정보(예: 운동 종류, 운동 시간 등), 음식 정보(예: 음식 종류, 수량, 칼로리 등), 및 의료 기관(예: 주변에 위치한 병원, 약국) 방문 추천 정보 중 적어도 일부를 포함하는 헬스 케어 정보를 표시부에 출력할 수 있다. 도 4a를 참조하면, 상기 게이트웨이(예: 프로세서)는 구성원들 각각에 대한 의료 데이터, 가전 기기 의 로그 데이터, 및 구성원들 각각에 대한 생체 데이터 중 적어도 일부에 기반하여 생성된 상기 구성원들 각각 에 대한 헬스 정보를 이용하여 헬스 케어 정보(예: 고혈압에 관한 정보)를 생성할 수 있다. 그리고, 상기 게이트웨이(예: 프로세서)는 생성된 헬스 케어 정보(예: 고혈압에 관한 정보)를 표시부에 표시할 수 있다. 상기 헬스 케어 정보는 고혈압에 좋은 음식(예; 호두, 두부, 당근, 고구마, 고등어 등)에 대한 정보, 운동(예: 걷기, 체조 등)에 대한 정보를 포함할 수 있다. 도 4b를 참조하면, 상기 게이트웨이(예: 프로세서)는 구성원들 각각에 대한 의료 데이터, 가전 기기 의 로그 데이터, 및 구성원들 각각에 대한 생체 데이터 중 적어도 일부에 기반하여 생성된 상기 구성원들 각각 에 대한 헬스 정보를 이용하여 헬스 케어 정보(예: 당뇨에 관한 정보)를 생성할 수 있다. 그리고, 상기 게 이트웨이(예: 프로세서)는 생성된 헬스 케어 정보(예: 당뇨에 관한 정보)를 표시부에 표시 할 수 있다. 상기 헬스 케어 정보는 당뇨에 좋은 식품군(예; 곡류, 어율류, 채소군, 지방군, 우유군, 과일군 등)에 대한 정보, 운동(예: 걷기, 체조 등)에 대한 정보를 포함할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 헬스 케어 정보를 해당 구성원의 전자 장치(예: 스마트 폰, 태블릿 PC)로 전송할 수 있다. 도 5는 본 발명의 다른 실시 예에 따른 게이트웨이의 헬스 케어 제공 방법을 나타낸 순서도이다. 이하, 도 5를 참조하여, 본 발명의 다른 실시 예에 따른 게이트웨이의 헬스 케어 제공 방법을 상세히 설명하면 다음과 같다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 각 구성원에 대한 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여 홈 내 환경을 제어하기 위한 적어도 하나의 가전 기기를 식별할 수 있다 (S510). 상기 게이트웨이(예: 프로세서)는 헬스 정보에 기반하여 홈 내의 환경을 제어하기 위한 상기 적어도 하나의 가전 기기를 식별할 수 있다. 또는, 상기 게이트웨이(예: 프로세서)는 헬스 정보, 및 헬스 케어 정보 중 적어도 일부에 기반하여 홈 내의 가전 기기를 식별할 수 있다. 상기 게이트웨이(예: 프 로세서)는 구성원에 대한 헬스 케어를 제공하는데 도움이 되는 적어도 하나의 가전 기기를 식별할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 각 구성원에 대한 맞춤형 헬스 서비스를 제 공하기 위해, 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여 적어도 하나의 가전 기기를 제어하기 위한 제어 신호를 생성할 수 있다(S512). 상기 게이트웨이(예: 프로세서)는 헬스 정보, 및 헬스 케어 정보 중 적어도 일부에 기반하여 상기 식별된 적어도 하나의 가전 기기(121, 122, 123, 124)를 제어하기 위한 제어 신호를 생성할 수 있다. 상기 제어 신호는 상기 식별된 적어도 하나의 가전 기기의 종류에 따라 온도, 습도, 수 분 섭취, 및 음식물 섭취 중 적어도 하나에 대한 제어 또는 추천을 나타내는 메시지를 출력하도록 하는 적어도 하나의 명령어를 포함할 수 있다. 일 실시 예에 따르면, 상기 게이트웨이(예: 프로세서)는 상기 생성된 제어 신호를 해당 가전 기기로 전송할 수 있다(S514). 상기 게이트웨이(예: 프로세서)는 복수의 가전 기기들의 동작을 제어 또는 추 천 정보 제공 등에 대한 복수의 제어 신호들을 각각 생성하고, 상기 각각 생성된 제어 신호를 해당 가전 기기 (예: 공기 청정기, 에어컨, 정수기)로 전송할 수 있다. 예를 들면, 상기 게이트웨이(예: 프로세서)는 상기 생성된 제어 신호를 통신부를 통해 상기 적어도 하나의 가전 기기(121, 122, 123,124)로 직접 전송할 수 있다. 예를 들면, 상기 게이트웨이(예: 프로세서)는 상기 생성된 제어 신호 및 헬스 정보를 TV로 전송할 수 있고, TV는 상기 제어 신호 및 헬스 정보에 기반하여 헬스 케어 정보를 표시할 수 있다. 예를 들면, 상기 헬스 정보에 기반하여 특정 구성원이 현재 알러지 질환이 있는 경우, 상기 게이트웨이(예: 프로세서)는 헬스 케어를 위한 가전 기기로서 공기 청정기를 식별할 수 있다. 그리고, 상기 게이트웨이(예: 프로세서)는 상기 공기 청정기를 제어하기 위한 제어 신호를 생성 하고, 상기 생성된 제어 신호를 공기 청정기로 전송할 수 있다. 예를 들면, 상기 제어 신호는 알러지 완화 를 위해 공기 청정기의 세기를 조절하는 신호를 포함할 수 있다. 또는, 상기 제어 신호는 특정 모드를 제 안하는 정보를 포함할 수 있다. 예를 들면, 상기 헬스 정보에 기반하여 특정 구성원이 현재 알러지 질환이 있는 경우, 상기 게이트웨이(예: 프로세서)는 헬스 케어를 위한 가전 기기로서 에어컨을 식별할 수 있다. 그리고, 상기 게이트웨이(예: 프로세서)는 상기 에어컨을 제어하기 위한 제어 신호를 생성하고, 상기 생성된 제어 신호를 에어컨으로 전송할 수 있다. 예를 들면, 상기 제어 신호는 알러지 완화를 위해 에어컨의 온도/습도를 조절하는 신호를 포함할 수 있다. 또는, 상기 제어 신호는 특정 온도/습도에 대한 설정 값을 제안하는 정보를 포함할 수 있다. 예를 들면, 상기 헬스 정보에 기반하여 특정 구성원이 현재 알러지 질환이 있는 경우, 상기 게이트웨이(예: 프로세서)는 헬스 케어를 위한 가전 기기로서 정수기를 식별할 수 있다. 그리고, 상기 게이트웨이(예: 프로세서)는 상기 정수기를 제어하기 위한 제어 신호를 생성하고, 상기 생성된 제어 신호를 정수기로 전송할 수 있다. 예를 들면, 상기 제어 신호는 알러지 치료를 위한 의 약품(예: 항히스타민제 등)을 복용하는데 유용한 정보(예: 물 섭취량을 증가시키기 위한 정보)를 포함할 수 있 다. 도 6은 본 발명의 일 실시 예에 따른 전자 장치의 블록도이다. 도 6을 참조하면, 본 발명의 일 실시 예에 따른 전자 장치는 각 구성원이 소유하고 있는 휴대 단말(예: 스 마트 폰, 태블릿 PC 등)을 포함할 수 있다. 일 실시 예에 따르면, 상기 전자 장치는 통신부, 표시부, 저장부, 카메라부, 스피커 , 센서부, 및 배터리을 포함할 수 있다. 도 6에 도시된 전자 장치의 구성은 일 실시 예에 따른 것이고, 전자 장치의 구성 요소들이 도 6에 도 시된 실시 예에 한정되는 것은 아니며, 필요에 따라 일부 구성 요소가 부가, 변경 또는 삭제될 수 있다. 일 실시 예에 따르면, 상기 통신부는 게이트웨이, 적어도 하나의 가전 기기(121, 122, 123, 124), 또 는 적어도 하나의 전자 장치와 유선 통신 또는 무선 통신을 통해 적어도 하나의 신호 또는 정보를 송수신 할 수 있는 적어도 하나의 회로를 포함할 수 있다. 또한, 상기 통신부는 인터넷을 통해 제1 서버 및 제2 서버 중 적어도 하나와 유선 통신 또는 무선 통신을 통해 적어도 하나의 신호 또는 정보를 송수신할 수 있는 적어도 하나의 회로를 포함할 수 있다. 일 실시 예에 따르면, 상기 통신부는 다양한 외부 장치로부터 신호 또는 데이터를 수신 또는 송신할 수 있 음은 자명하다. 일 실시 예에 따르면, 상기 표시부는 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)을 표시할 수 있다. 상기 표시부는 상기 프로세서에 의해 처리된, 처리중, 또는 처리될 결과를 표시할 수 있다. 상기 표시부는 적어도 하나의 가전 기기의 동작 상태 또는 적어도 하나의 가전 기기에 대한 다양한 정보를 시각적으로 제공할 수 있고, 이러한 다양한 정보를 표시하는 제어 회로를 포함할 수 있다. 일 실시 예에 따르면, 상기 표시부는 게이트웨이, 적어도 하나의 가전 기기(121, 122, 123, 124), 제 1 서버, 및 제2 서버 중 적어도 하나로부터 수신된 정보, 구성원들 각각에 대한 헬스 정보 및 헬스 케어 정보 중 적어도 일부를 표시할 수 있다. 일 실시 예에 따르면, 상기 표시부는 터치를 감지하는 터치 회로(touch circuitry), 또는 터치에 대한 압 력의 세기를 측정할 수 있는 압력 센서를 포함할 수 있다. 일 실시 예에 따르면, 상기 저장부는 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 예를 들면, 상기 저장부는 게이트웨이, 또는 적어도 하나의 가전 기기(121, 122, 123, 124) 또는 적어도 하나의 전자 장치의 동작에 필요한 정보, 데이터, 프로그램 등이 저장될 수 있다. 이에 따라, 상기 프로세서(68 0)는 저장부에 저장된 정보를 참조하여 후술하는 제어 동작을 수행할 수 있다. 상기 저장부는 다양한 플랫폼(platform)을 저장할 수도 있다. 상기 저장부는, 예를 들어 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM), 롬(EEPROM 등), USB 메모리 중 적어도 하나의 타입 의 저장매체를 포함할 수 있다. 일 실시 예에 따르면, 상기 저장부는 상기 게이트웨이로부터 수신되는 헬스 정보, 헬스 케어 정보, 및 제어 신호를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 인터넷을 통해 수신된 표준 데이터(예: 연령대, 및 성별 중 적 어도 하나에 기반한 표준 체중, 표준 체내 영양소, 표준 혈압, 표준 혈당, 표준 맥박, 표준 심전도, 표준 심탄 도, 표준 근전도, 표준 심박수, 및 표준 체온 중 적어도 하나에 대한 표준 데이터)를 저장할 수 있다. 이러한 표준 데이터는 필요에 따라 게이트웨이로 제공될 수 있다. 일 실시 예에 따르면, 상기 저장부는 적어도 하나의 병원에서의 진료에 대한 정보를 저장하는 서버(예: 제 1 서버)로부터 수신된 정보(예: 전자 의료 기록(Electronic Medical Record, EMR), 검진 기록, 진료 기록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 적어도 하나의 약국에서의 의약품 처방에 대한 정보를 저장하는 서버 (예: 제2 서버)로부터 수신된 정보(예: 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결 제 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 홈 내의 적어도 하나의 가전 기기(121, 122, 123, 124)로부터 수신된 로그 데이터(예: 적어도 하나의 가전 기기에 각각에 대한 사용 정보, 각 가전 기기에서 획득된 정보, 및 각 가 전 기기의 동작 정보 중 적어도 일부)를 저장할 수 있다. 일 실시 예에 따르면, 상기 저장부는 각 구성원의 전자 장치(예: 스마트 시계, 스마트 폰, 태블 릿 PC(미도시) 등 등)로부터 수신된 생체 데이터(혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체온 중 적어도 하나)를 저장할 수 있다. 일 실시 예에 따르면, 상기 카메라부는 적어도 하나의 카메라를 포함할 수 있다. 상기 카메라부는 홈 내부의 사물 또는 사용자에 대한 이미지를 획득할 수 있다. 상기 카메라부는 인공지능 칩(예: ThinQ)이 내 장된 영상 지능 카메라(또는 스마트 영상 지능 카메라)를 포함할 수 있다. 일 실시 예에 따르면, 상기 스피커는 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환 시킬 수 있다. 상기 스피커는 음향 출력 장치(예: 이어폰 또는 헤드폰)를 통해 소리를 출력할 수 있다. 상 기 스피커는 음향 신호를 전자 장치의 외부로 출력할 수 있다. 상기 스피커는 홈 내부에 존재하 는 사용자에게 제공되는 정보를 음성으로 출력할 수 있다. 일 실시 예에 따르면, 상기 센서부는 거리 측정 센서(미도시), 움직임 감지 센서(미도시), 및 조도 센서 (미도시)를 포함할 수 있다. 일 실시 예에 따르면, 상기 배터리는 외부 전원(미도시)과 유선 또는 무선으로 연결될 수 있고, 이러한 유 선 또는 무선에 기반한 연결을 통해 상기 외부 전원으로부터 전원을 공급받아서 충전할 수 있다. 상기 배터리 는 상기 프로세서의 제어 하에, 상기 전자 장치에 포함된 각각의 구성 요소로 공급할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 소프트웨어를 구동하여 상기 프로세서에 연결된 적어도 하나 의 구성요소(예: 통신부, 표시부, 저장부, 카메라부, 스피커, 센서부, 및 배터 리)를 유선 통신 또는 무선 통신에 기반하여 제어할 수 있다. 그리고, 상기 프로세서는 상기 유선 통 신 또는 상기 무선 통신에 기반하여 다양한 데이터 처리 및 연산을 수행할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 통신부, 표시부, 저장부, 카메라부, 스피커 , 센서부, 및 배터리 등으로부터 수신된 명령 또는 데이터를 상기 저장부에 로드하여 처리 하고, 처리된 데이터를 저장부에 저장할 수 있다. 또는, 상기 프로세서는 상기 처리된 데이터를 표시 부를 통해 표시하거나, 또는 스피커를 통해 출력할 수 있다.일 실시 예에 따르면, 상기 프로세서는 인터넷을 통해 수신된 표준 데이터(예: 연령대, 및 성별 중 적어도 하나에 기반한 표준 체중, 표준 체내 영양소, 표준 혈압, 표준 혈당, 표준 맥박, 표준 심전도, 표준 심 탄도, 표준 근전도, 표준 심박수, 및 표준 체온 중 적어도 하나에 대한 표준 데이터)를 저장부에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 적어도 하나의 병원에서의 진료에 대한 정보를 저장하는 서버(예: 제1 서버)로부터 수신된 정보(예: 전자 의료 기록(Electronic Medical Record, EMR), 검진 기록, 진료 기 록, 교육 기록, 치료 기록, 및 수술 기록 중 적어도 하나)를 저장부에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 적어도 하나의 약국에서의 의약품 처방에 대한 정보를 저장하는 서 버(예: 제2 서버)로부터 수신된 정보(예: 의약품 처방 접수 기록, 의약품 종류, 의약품 복용, 및 의약품 결제 중 적어도 하나)를 저장부에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 홈 내의 적어도 하나의 가전 기기(121, 122, 123, 124)로부터 수신 된 로그 데이터(예: 적어도 하나의 가전 기기에 각각에 대한 사용 정보, 각 가전 기기에서 획득된 정보, 및 각 가전 기기의 동작 정보 중 적어도 일부)를 획득하여 저장부에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 각 구성원의 전자 장치(예: 스마트 시계, 스마트 폰, 태 블릿 PC(미도시) 등 등)로부터 수신된 생체 데이터(혈압, 혈당, 맥박, 심전도, 심탄도, 근전도, 심박수, 및 체 온 중 적어도 하나)를 획득하여 저장부에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 홈 내의 게이트웨이로부터 헬스 정보를 통신부를 통해 획득하고, 상기 획득된 헬스 정보에 기반한 어플리케이션(예: 헬스 서비스 어플리케이션)을 표시부 상에 표시할 수 있다. 그리고, 상기 프로세서는 상기 어플리케이션에 기반하여 외부 전자 장치(예: 의사 단말, 약사 단말 등)와 통신 채널을 상기 통신부를 통해 셋업하고, 상기 셋업된 통신 채널을 통해 상기 외부 전 자 장치(예: 의사 단말, 약사 단말 등)로 상기 헬스 정보를 전송할 수 있다. 그리고, 상기 프로세서는 상 기 헬스 정보의 전송에 기반하여, 상기 외부 전자 장치(예: 의사 단말, 약사 단말 등)로부터 수신된 부가 정보 를 상기 어플리케이션을 통해 표시할 수 있다. 도 7은 본 발명의 일 실시 예에 따른 전자 장치의 헬스 케어를 제공하는 방법을 나타낸 순서도이다. 도 8a는 본 발명의 일 실시 예에 따른 전자 장치와 외부 전자 장치가 어플리케이션을 통해 통신하는 예시도이다. 도 8b는 본 발명의 일 실시 예에 따른 전자 장치가 외부 전자 장치로 헬스 정보를 제공하는 예시도이다. 이하, 도 7, 도 8a, 및 도 8b를 참조하여, 본 발명의 일 실시 예에 따른 전자 장치의 헬스 케어를 제공하는 방 법을 상세히 설명하면 다음과 같다. 일 실시 예에 따르면, 전자 장치(예: 프로세서)는 게이트웨이로부터 헬스 정보가 수신되는지 식별할 수 있다(S710). 상기 전자 장치(예: 프로세서)는 구성원들 각각에 대한 의료 데이터, 로그 데이터, 및 생체 데이터에 기반하여 각 구성원에 대한 혈압 값, 혈당 값, 맥박 값, 심전도 값, 심탄도 값, 근전도 값, 심박수 값, 및 체온 값 중 적어도 하나를 포함하는 헬스 정보를 생성한 게이트웨이로부터 상기 헬스 정보 를 수신할 수 있다. 일 실시 예에 따르면, 상기 전자 장치(예: 프로세서)는 상기 수신된 헬스 정보에 기반하여 어플리케 이션을 실행할 수 있다(S712). 상기 전자 장치(예: 프로세서)는 상기 헬스 정보의 수신에 기반하여 헬스 케어를 제공하는 어플리케이션을 실행하고, 상기 실행된 어플리케이션을 통해 상기 수신된 헬스 정보를 표 시할 수 있다. 일 실시 예에 따르면, 상기 전자 장치(예: 프로세서)는 상기 실행된 어플리케이션에 기반하여 외부 전자 장치와 통신 채널을 셋업할 수 있다(S714). 상기 전자 장치(예: 프로세서)는 상기 헬스 정보의 수신에 기반하여 해당 의료 기관(예: 병원 또는 약국)의 담당자의 휴대 단말과 어플리케이션을 통해 통신 채널 을 셋업할 수 있다. 상기 전자 장치(예: 프로세서)는 상기 외부 전자 장치로 통신 셋업을 요청하여 통신 채널을 셋업할 수 있다. 상기 통신 채널은 신호 또는 데이터를 송수신할 수 있는 유선 통신 또는 무선 통 신에 기반한 채널을 포함할 수 있다. 일 실시 예에 따르면, 상기 전자 장치(예: 프로세서)는 상기 셋업된 통신 채널을 통해 상기 외부 전 자 장치로 헬스 정보를 전송할 수 있다(S716). 상기 전자 장치(예: 프로세서)는 상기 통신 채널을 통 해 의료 데이터, 로그 데이터, 및 생체 데이터에 기반한 헬스 정보를 상기 외부 전자 장치로 헬스 정보를 전송할 수 있다. 도 8a 및 도 8b를 참조하면, 상기 전자 장치(예: 프로세서)는 헬스 케어 서비스를 제공하는 의료인 (예: 의사, 약사, 간호사 등)의 휴대 단말(미도시)과 어플리케이션에 기반하여 셋업된 통신 채널을 통해 메시지 또는 데이터를 전송할 수 있다. 그리고, 상기 전자 장치(예: 프로세서)는 의료인(예: 의사, 약사, 간 호사 등)의 휴대 단말(미도시)과 송수신되는 메시지를 포함하는 화면을 어플리케이션을 통해 표시할 수 있 다. 예를 들면, 구성원은 김00 약사에게 자신의 건강 정보를 제공할 수 있다. 일 실시 예에 따르면, 상기 전자 장치(예: 프로세서)는 건강 정보의 전송이 감지되면, 상기 건강 정 보의 전송을 확인하는 팝업을 표시하여, 해당 구성원의 동의(또는 거부)를 획득할 수 있다. 일 실시 예에 따르면, 상기 전자 장치(예: 프로세서)는 상기 헬스 정보의 전송에 기반하여, 상기 외 부 전자 장치로부터 수신된 부가 정보를 상기 어플리케이션을 통해 출력할 수 있다(S718). 상기 전자 장치 (예: 프로세서)는 상기 헬스 정보의 전송에 기반하여, 상기 외부 전자 장치로부터 헬스 케어에 관한 부가 정보를 수신할 수 있다. 상기 부가 정보는 상기 전송된 헬스 정보에 기반하여 의사 또는 약사의 조언에 대 한 정보를 포함할 수 있다. 예를 들면, 상기 부가 정보는 구성원의 건강 상태를 양호하게 하기 위한 다양한 정 보(예: 음식물 섭취, 의약품 복용, 운동 정보 등)를 포함할 수 있다. 일 실시 예에 따르면, 상기 전자 장치(예: 프로세서)는 상기 수신된 부가 정보를 상기 어플리케이션 을 통해 출력할 수 있다. 상기 어플리케이션은 구성원의 건강 상태를 유지 또는 관리하기 위한 다양한 정보(예: 헬스 케어 정보, 부가 정보 등)을 표시하고, 의약품 복용 시간에 따라 알람을 제공할 수 있다. 이상에서 상술한 각각의 순서도에서의 각 단계는 도시된 순서에 무관하게 동작될 수 있거나, 또는 동시에 수행 될 수 있다. 또한, 본 발명의 적어도 하나의 구성 요소와, 상기 적어도 하나의 구성 요소에서 수행되는 적어도 하나의 동작은 하드웨어 및/또는 소프트웨어로 구현 가능할 수 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다."}
{"patent_id": "10-2020-0182827", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 헬스 케어를 제공하는 시스템을 나타낸 예시도이다. 도 2는 본 발명의 일 실시 예에 따른 게이트웨이의 블록도이다. 도 3은 본 발명의 일 실시 예에 따른 게이트웨이의 헬스 케어 제공 방법을 나타낸 순서도이다. 도 4a는 본 발명의 일 실시 예에 따른 게이트웨이에 고혈압에 관한 헬스 케어 정보를 표시한 예시도이다. 도 4b는 본 발명의 일 실시 예에 따른 게이트웨이에 당뇨에 관한 헬스 케어 정보를 표시한 예시도이다. 도 5는 본 발명의 다른 실시 예에 따른 게이트웨이의 헬스 케어 제공 방법을 나타낸 순서도이다. 도 6은 본 발명의 일 실시 예에 따른 전자 장치의 블록도이다. 도 7은 본 발명의 일 실시 예에 따른 전자 장치의 헬스 케어를 제공하는 방법을 나타낸 순서도이다. 도 8a는 본 발명의 일 실시 예에 따른 전자 장치와 외부 전자 장치가 어플리케이션을 통해 통신하는 예시도이다. 도 8b는 본 발명의 일 실시 예에 따른 전자 장치가 외부 전자 장치로 헬스 정보를 제공하는 예시도이다."}
