{"patent_id": "10-2019-0083121", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0018236", "출원번호": "10-2019-0083121", "발명의 명칭": "인공 지능 칩에 적용되는 산출 방법 및 인공 지능 칩", "출원인": "베이징 바이두 넷컴 사이언스 앤 테크놀로지 코.,", "발명자": "오우양, 지안"}}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 프로세서 코어 및 상기 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결된 연산 가속 구성 요소를 포함하는 인공 지능 칩에 적용되는 산출 방법에 있어서, 상기 방법은, 상기 적어도 하나의 프로세서 코어 중의 타겟 프로세서 코어에 의해 실행 대상 명령을 디코딩하여, 연산 식별자및 적어도 하나의 피연산자를 얻는 단계와,상기 타겟 프로세서 코어가, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이용하여 복잡 연산 명령을 생성하는 단계와,상기 타겟 프로세서 코어가 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가하는 단계와,상기 연산 가속 구성 요소가 상기 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하는 단계와,상기 연산 가속 구성 요소가, 선택된 복잡 연산 명령의 적어도 하나의 피연산자를 입력 파라미터로 사용하여,선택된 복잡 연산 명령의 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻는 단계와,상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 적어도 하나의 프로세서 코어 중의 타겟 프로세서 코어에 의해 실행 대상 명령을 디코딩하기 전에, 상기방법은 또한,실행 대상 명령의 수신에 응답하여, 상기 적어도 하나의 프로세서 코어로부터, 타겟 프로세서 코어로서 상기 실행 대상 명령을 실행하는 프로세서 코어를 선택하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 복잡 연산 명령큐는 상기 적어도 하나의 프로세서 코어의 각각에 대응하는 복잡 연산 명령 큐를 포함하고,상기 복잡 연산 결과큐는 상기 적어도 하나의 프로세서 코어의 각각에 대응하는 복잡 연산 결과큐를 포함하며,상기 타겟 프로세서 코어가 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가하는 단계는,상기 타겟 프로세서 코어가, 생성된 복잡 연산 명령을 상기 타겟 프로세서 코어에 대응하는 복잡 연산 명령큐에추가하는 단계를 포함하고,상기 연산 가속 구성 요소가 상기 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하는 단계는,상기 연산 가속 구성 요소가, 상기 적어도 하나의 프로세서 코어의 각각에 대응하는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하는 단계를 포함하며,상기 연산 가속 구성 요소가 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입하는 단계는,상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서, 선택된 복잡 연산 명령이 유래하는 복잡연산 명령큐에 대응하는 프로세서 코어에 대응하는 복잡 연산 결과큐에 기입하는 단계를 포함하는 방법.공개특허 10-2020-0018236-3-청구항 4 제3항에 있어서,상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서 선택된 복잡 연산 명령이 유래하는 복잡연산 명령큐에 대응하는 프로세서 코어에 대응하는 복잡 연산 결과큐에 기입하한 후, 상기 방법은 또한,상기 타겟 프로세서 코어가, 상기 타겟 프로세서 코어에 대응하는 복잡 연산 결과큐로부터 복잡 연산 결과를 선택하고, 상기 타겟 프로세서 코어의 결과 레지스터 및 상기 인공 지능 칩의 메모리 중 적어도 하나에 기록하는단계를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 타겟 프로세서 코어가, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이용하여 복잡 연산 명령을 생성하는 단계는,상기 타겟 프로세서 코어가, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자와 적어도 하나의 피연산자 및 타겟 프로세서 코어 식별자를 이용하여 복잡 연산 명령을 생성하는 단계를 포함하고,상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입하는 단계는,상기 연산 가속 구성 요소가, 얻어진 연산 결과 및 선택된 복잡 연산 명령의 프로세서 코어 식별자를 복잡 연산결과로서 상기 복잡 연산 결과큐에 기입하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 연산 가속 구성 요소가, 얻어진 연산 결과 및 선택된 복잡 연산 명령의 프로세서 코어 식별자를 복잡 연산결과로서 상기 복잡 연산 결과큐에 기입한 후, 상기 방법은 또한,상기 타겟 프로세서 코어가 상기 복잡 연산 결과큐로부터, 프로세서 코어 식별자가 상기 타겟 프로세서 코어 식별자인 복잡 연산 결과의 연산 결과를 선택하여, 상기 타겟 프로세서 코어의 결과 레지스터 및 상기 인공 지능칩의 메모리 중 적어도 하나에 기록하는 단계를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항 내지 제6항 중 어느 한항에 기재된 방법에 있어서,상기 연산 가속 구성 요소는 ASIC 칩 및 필드 프로그래머블 게이트 어레이 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항 내지 제6항 중 어느 한항에 기재된 방법에 있어서,상기 복잡 연산 명령큐 및 상기 복잡 연산 결과큐는 선입 선출 큐인 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2020-0018236-4-제1항 내지 제6항 중 어느 한항에 기재된 방법에 있어서,상기 복잡 연산 명령큐 및 상기 복잡 연산 결과큐는 캐시에 저장되어 있는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항 내지 제6항 중 어느 한항에 기재된 방법에 있어서,상기 연산 가속 구성 요소는 적어도 하나의 연산 유닛을 포함하고,상기 연산 가속 구성 요소가, 선택된 복잡 연산 명령의 적어도 하나의 피연산자를 입력 파라미터로 사용하여,선택된 복잡 연산 명령의 복잡 연산 식별자가 지시하는 복잡 연산을 실행하는 단계는,상기 연산 가속 구성 요소 중의 선택된 복잡 연산 명령의 복잡 연산 식별자에 대응하는 연산 유닛이, 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하는 단계를 포함하는 방법,"}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항 내지 제6항 중 어느 한항에 기재된 방법에 있어서,상기 미리 설정된 복잡 연산 식별자는 지수 연산 식별자, 제곱 연산 식별자 및 삼각 함수 연산 식별자 중 적어도 하나를 포함하는 방법."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "적어도 하나의 프로세서 코어,상기 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결되는 연산 가속 구성 요소, 및 적어도 하나의 프로그램이 저장된 저장 장치 - 상기 적어도 하나의 프로그램이 상기 인공 지능 칩에 의해 실행될 때, 인공 지능 칩이 제1항 내지 제6항 중 어느 한 항에 기재된 방법을 실현하도록 함 - 를 포함하는 인공 지능 칩."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "컴퓨터 프로그램이 저장된 컴퓨터 판독 가능 매체에 있어서,상기 컴퓨터 프로그램이 인공 지능 칩에 의해 실행될 때, 제1항 내지 제6항 중 어느 한 항에 기재된 방법을 실현하는 컴퓨터 판독 가능 매체."}
{"patent_id": "10-2019-0083121", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "프로세서, 저장 장치, 및 제12항에 기재된 적어도 하나의 인공 지능 칩을 포함하는 전자 기기."}
{"patent_id": "10-2019-0083121", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원의 실시예는 인공 지능 칩에 적용되는 산출 방법 및 인공 지능 칩을 개시한다. 상기 방법의 구체적인 실 시형태는, 타겟 프로세서 코어가 실행 대상 명령을 디코딩하여 얻은 연산 식별자가 미리 설정된 복잡 연산 식별 자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 사용하여 복잡 연산 명령을 생성 하고, 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가하는 단계와, 연산 가속 구성 요소가 복잡 연산 명령큐 로부터 복잡 연산 명령을 선택하고, 선택된 복잡 연산 명령의 적어도 하나의 피연산자를 입력 파라미터로 사용하 여 선택된 복잡 연산 명령의 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻고, 얻어진 연 산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입하는 단계를 포함한다. 해당 실시형태는 인공 지능 칩의 공간 오버헤드 및 전력 소비 오버헤드를 감소시킨다."}
{"patent_id": "10-2019-0083121", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원의 실시예는 컴퓨터 기술분야에 관한 것으로, 특히 인공 지능 칩에 적용되는 산출 방법 및 인공 지능 칩 에 관한 것이다."}
{"patent_id": "10-2019-0083121", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공 지능 칩 즉 AI（Artificial Intelligence）칩은 AI 가속기 또는 컴퓨팅 카드라고도 불리우며, 인공 지능 응용에 있어서 대량의 컴퓨팅 작업을 전문적으로 처리하는 모듈이다(기타 비컴퓨팅 작업은 여전히 CPU가 부담한 다). AI 컴퓨팅에 있어서 거대한 연산이 필요되며, 특히 복잡한 연산 수요는 컴퓨팅 성능에 큰 영향을 준다. 복 잡한 연산은 기본적인 연산 명령으로 실시할 수 있지만, 복잡한 연산 (부동 소수점 제곱근 연산, 부동 소수점 지수 연산, 삼각 함수 연산 등)의 실행 효율이 저하될 수 있다. 본 출원의 실시예는 인공 지능 칩에 적용되는 산출 방법 및 인공 지능 칩을 개시한다. 제1 양태에서, 본 출원의 실시형태는 인공 지능 칩에 적용되는 산출 방법을 제공한닫. 상기 방법은, 상기 적어 도 하나의 프로세서 코어 중의 타겟 프로세서 코어에 의해 실행 대상 명령을 디코딩하여, 연산 식별자 및 적어 도 하나의 피연산자를 얻는 단계와, 상기 타겟 프로세서 코어가, 디코딩된 연산 식별자가 미리 설정된 복잡 연 산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이용하여 복잡 연산 명 령을 생성하는 단계와, 상기 타겟 프로세서 코어가 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가하는 단계 와, 상기 연산 가속 구성 요소가 상기 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하는 단계와, 상기 연산 가속 구성 요소가, 선택된 복잡 연산 명령의 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령의 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻는 단계와, 상기 연산 가속 구 성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입하는 단계를 포함한다. 일부 실시예에서, 적어도 하나의 프로세서 코어 중의 타겟 프로세서 코어에 의해 실행 대상 명령을 디코딩하기 전에, 상기 방법은 또한, 실행 대상 명령의 수신에 응답하여, 상기 적어도 하나의 프로세서 코어로부터, 타겟 프로세서 코어로서 상기 실행 대상 명령을 실행하는 프로세서 코어를 선택하는 단계를 포함한다. 일부 실시예에서, 복잡 연산 명령큐는 상기 적어도 하나의 프로세서 코어의 각각에 대응하는 복잡 연산 명령 큐 를 포함하고, 상기 복잡 연산 결과큐는 상기 적어도 하나의 프로세서 코어의 각각에 대응하는 복잡 연산 결과큐 를 포함하며, 상기 타겟 프로세서 코어가 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가하는 단계는, 상기 타겟 프로세서 코어가, 생성된 복잡 연산 명령을 상기 타겟 프로세서 코어에 대응하는 복잡 연산 명령큐에 추가 하는 단계를 포함하고, 상기 연산 가속 구성 요소가 상기 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하는 단계는, 상기 연산 가속 구성 요소가, 상기 적어도 하나의 프로세서 코어의 각각에 대응하는 복잡 연산 명령큐 로부터 복잡 연산 명령을 선택하는 단계를 포함하며, 상기 연산 가속 구성 요소가 얻어진 연산 결과를 복잡 연 산 결과로서 복잡 연산 결과큐에 기입하는 단계는, 상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서, 선택된 복잡 연산 명령이 유래하는 복잡 연산 명령큐에 대응하는 프로세서 코어에 대응하는 복잡 연 산 결과큐에 기입하는 단계를 포함한다. 일부 실시예에서, 상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서 선택된 복잡 연산 명령 이 유래하는 복잡 연산 명령큐에 대응하는 프로세서 코어에 대응하는 복잡 연산 결과큐에 기입하한 후, 상기 방 법은 또한, 상기 타겟 프로세서 코어가, 상기 타겟 프로세서 코어에 대응하는 복잡 연산 결과큐로부터 복잡 연 산 결과를 선택하고, 상기 타겟 프로세서 코어의 결과 레지스터 및/또는 상기 인공 지능 칩의 메모리에 기록하 는 단계를 포함한다. 일부 실시예에서, 타겟 프로세서 코어가, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이용하여 복잡 연산 명령을 생성하는 단계는, 상 기 타겟 프로세서 코어가, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코 딩된 연산 식별자와 적어도 하나의 피연산자 및 타겟 프로세서 코어 식별자를 이용하여 복잡 연산 명령을 생성 하는 단계를 포함하고, 상기 연산 가속 구성 요소가, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐 에 기입하는 단계는, 상기 연산 가속 구성 요소가, 얻어진 연산 결과 및 선택된 복잡 연산 명령의 프로세서 코 어 식별자를 복잡 연산 결과로서 상기 복잡 연산 결과큐에 기입하는 단계를 포함한다. 일부 실시예에서, 연산 가속 구성 요소가, 얻어진 연산 결과 및 선택된 복잡 연산 명령의 프로세서 코어 식별자 를 복잡 연산 결과로서 상기 복잡 연산 결과큐에 기입한 후, 상기 방법은 또한, 상기 타겟 프로세서 코어가 상 기 복잡 연산 결과큐로부터, 프로세서 코어 식별자가 상기 타겟 프로세서 코어 식별자인 복잡 연산 결과의 연산 결과를 선택하여, 상기 타겟 프로세서 코어의 결과 레지스터 및 / 또는 상기 인공 지능 칩의 메모리에 기입하는단계를 포함한다. 일부 실시예에서, 연산 가속 구성 요소는 ASIC 칩 및 필드 프로그래머블 게이트 어레이 중 적어도 하나를 포함 한다. 일부 실시예에서, 복잡 연산 명령큐 및 복잡 연산 결과큐는 선입 선출큐이다. 일부 실시예에서, 복잡 연산 명령큐 및 복잡 연산 결과큐는 캐시에 저장된다. 일부 실시예에서, 연산 가속 구성 요소는 적어도 하나의 연산 유닛을 포함하고, 상기 연산 가속 구성 요소가, 선택된 복잡 연산 명령의 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령의 복잡 연산 식별자가 지시하는 복잡 연산을 실행하는 단계는, 상기 연산 가속 구성 요소 중의 선택된 복잡 연산 명령 의 복잡 연산 식별자에 대응하는 연산 유닛이, 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라 미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하는 단계를 포함한 다. 일부 실시예에서, 미리 설정된 복잡 연산 식별자는 지수 연산 식별자, 제곱근 연산 식별자 및 삼각 함수 연산 식별자 중 적어도 하나를 포함할 수 있다. 제2 양태에서, 본 출원의 실시예는 인공 지능 칩을 제공한다. 인공 지능 칩은, 적어도 하나의 프로세서 코어, 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결되는 연산 가속 구성 요소, 및 적어도 하나의 프로그램 이 저장된 저장장치를 포함하며, 상기 적어도 하나의 프로그램이 인공 지능 칩에 의해 실행될 때, 인공 지능 칩 이 제1 양태 중 어느 하나의 실시형태에 기재된 방법을 실현하도록 한다. 제3 양태에서, 본 출원의 실시예는 컴퓨터 프로그램이 저장된 컴퓨터 판독 가능 저장 매체를 제공한다. 상기 컴 퓨터 프로그램이 인공 지능 칩에 의해 실행될 때, 제1 양태 중 어느 한 실시형태에 기재된 방법을 실현한다. 제4 양태에서, 본 출원 실시예는 프로세서, 저장장치, 및 제2 양태에 기재된 적어도 하나의 인공 지능 칩을 포 함하는 전자 기기를 제공한다. 본 출원의 실시형태에 의한 인공 지능 칩에 적용되는 산출 방법에 있어서, 인공 지능 칩은 적어도 하나의 프로 세서 코어 및 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결된 연산 가속 구성 요소를 포함한다. 상 기 방법은, 타겟 프로세서 코어는 실행 대상 명령이 실행하고자 하는 연산이 미리 설정된 복잡 연산임을 확정한 데 응답하여, 실행 대상 명령을 디코딩하여 복잡 연산 식별자 및 적어도 하나의 피연산자를 얻고, 복잡 연산 식 별자 및 적어도 하나의 피연산자를 사용하여 복잡 연산 명령을 생성하고, 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가한다. 또한, 연산 가속 구성 요소는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하고, 선택된 복잡 연산 명령 중의 적어도 하나의 피연산자를 입력 파라미터로 사용하여 선택된 복잡 연산 명령 중의 복잡 연 산 식별자가 지시하는 복잡 연산을 실행하여 연산 결과를 얻고, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입한다. 따라서, 연산 가속 구성 요소를 효과적으로 사용하여 복잡한 연산을 진행하며, 그 기 술적 효과는 적어도 다음을 포함한다. 첫째, 연산 가속 구성 요소를 도입하여 복잡한 연산을 실행함으로써 AI칩의 복잡 연산을 처리하는 능력과 효율 을 제고시킨다. 둘째, 실천에 있어서, 복잡 연산(complex computation)은 단순 연산에 비해 실행 빈도가 높지 않기 때문에 매개 프로세서 코어마다 하나의 연산 가속 구성 요소를 배치하는 것이 아니라 적어도 하나의 프로세서 코어가 하나의 연산 가속 구성 요소를 공유함으로써 복잡 연산으로 인한 AI 칩의 공간 오버헤드 및 전력 소모 오버헤드를 감소 시킬 수 있다. 셋째, 연산 가속 구성 요소는 복수의 연산 유닛을 갖고 있고, 복수의 연산 유닛은 병렬로 복잡 연산 조작을 실 행하기 때문에, 데이터 위험이 없는 정황하에서, 복잡 연산의 시간적인 오버헤드는 후속 명령에 의해 커버될 수 있다."}
{"patent_id": "10-2019-0083121", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부 도면 및 실시예를 참조하면서 본 출원을 더 상세하게 설명한다. 본 명세서에 기술된 특정 실시예는, 본 발명에 대한 한정이 아니라 관련 발명을 분석하기 위한 것임을 이해해야 할 것이다. 또한, 설명의 편의상, 관련된 발명과 관련된 부분만이 첨부 도면에 도시되어 있음에 유의해야 한다. 본 출원에 있어서의 실시예와 실시예에 있어서의 특징들은 충돌하지 않는한 서로 결합될 수 있음에 유의해야 한 다. 이하, 첨부 도면에 실시예를 결합하여 본 출원을 상세하게 설명한다. 도 1은 본 출원을 적용할 수 있는 인공 지능 칩에 적용되는 산출 방법의 실시예의 예시적인 시스템 아키텍처 를 도시한다. 도 1에 도시된 바와 같이, 시스템 아키텍처는 CPU (Central Processing Unit, 중앙 처리 장치) , 버 스 및 AI 칩 (103, 104)을 포함할 수 있다. 버스 는 CPU 와 AI 칩 (103, 104) 사이에 통신 링 크를 제공하는 매체로 사용된다. 버스 는 예를 들어 AMBA (Advanced Microcontroller Bus Architecture) 버스, OCP (Open Core Protocol) 버스 등과 같은 다양한 버스 유형을 포함할 수 있다. AI 칩 은 프로세서 코어 (1031, 1032, 1033), 유선 , 및 연산 가속 구성 요소 를 포함할 수 있다. 유선 은 프로세서 코어 (1031, 1032, 1033)와 연산 가속 구성 요소 사이에 통신 링크를 제 공하는 매체로 사용된다. 유선 은 예를 들어, PCI 버스, PCIE 버스, 네트워크 온 칩（Network On Chip） 프로토콜을 지원하는, AMBA 버스, OCP 버스 및 기타 네트워크 온 칩 버스와 같은 다양한 유선 유형을 포함할 수 있다. AI 칩 은 프로세서 코어 (1041, 1042, 1043), 유선 , 및 연산 가속 구성 요소 를 포함할 수 있다. 유선 은 프로세서 코어 (1041, 1042, 1043)와 연산 가속 구성 요소 사이에 통신 링크를 제 공하는 매체로 사용된다. 유선 은 예를 들어, PCI 버스, PCIE 버스, 네트워크 온 칩（Network On Chip） 프로토콜을 지원하는, AMBA 버스, OCP 버스 및 기타 네트워크 온 칩 버스와 같은 다양한 유선 유형을 포함할 수 있다. 본 출원의 실시예에 의해 제공된 인공 지능 칩에 적용되는 산출 방법은 일반적으로 AI 칩 및 에 의 해 실행된다는 것에 유의해야 한다. 도 1의 CPU, 버스 및 AI 칩의 수량은 단지 예시적인 것임을 이해해야 한다. 실시의 수요에 따라 임의의 수량의 CPU, 버스 및 AI 칩을 갖출 수 있다. 마찬가지로, AI 칩 (103, 104) 에 있어서의 프로세서 코어, 유선 및 메모 리의 수량도 단지 예시적인 것에 불과하다. 실시의 수요에 따라, AI 칩 (102, 103)은 임의의 수량의 프로세서 코어, 유선 및 메모리를 가질 수 있다. 또한, 실시의 수요에 따라, 시스템 아키텍처 는 메모리, 입력 장치 (마우스, 키보드 등), 출력 장치 (디스플레이, 스피커 등), 입력 / 출력 인터페이스 등을 더 포함할 수 있다. 계속하여 도 2를 참조하면, 도 2는 본 출원에 따른 인공 지능 칩에 적용되는 산출 방법의 일 실시예의 프로세스 를 나타낸다. 상기 인공 지능 칩에 적용되는 산출 방법은 다음의 단계를 포함한다. 단계 에서, 적어도 하나의 프로세서 코어 중의 타겟 프로세서 코어에 의해 실행 대상 명령을 디코딩하여 연산 식별자 및 적어도 하나의 피연산자를 얻는다. 본 실시예에서, 인공 지능 칩의 산출 방법에 적용되는 실행 주체 (예를 들어, 도 1에 도시된 AI 칩)는 적어도 하나의 프로세서 코어 및 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결된 연산 가속 구성 요소를 포 함할 수 있다. 연산 가속 구성 요소는 독립적인 연산 능력을 가지며, 프로세서 코어보다 복잡한 연산에 더 적합 하다. 여기서, 복잡 연산(complex computation)은 간단한 연산에 비해 계산량이 많은 연산을 의미하며, 간단한 연산은 계산량이 적은 연산을 의미할 수 있다. 예를 들어, 간단한 연산은 더하기 연산, 곱하기 연산 또는 더하 기 연산과 곱하기 연산의 간단한 조합 연산일 수 있다. 일반적인 프로세서 코어는 가산기와 곱셈기를 포함하기 때문에 프로세서 코어에 대해 간단한 연산이 더 적합하다. 복잡 연산은, 지수, 제곱근, 삼각 함수 등과 같은 더 하기와 곱하기의 간단한 조합으로는 구성될 수 없는 연산을 가리킨다. 본 실시예의 일부 바람직한 실시형태에 있어서, 연산 가속 구성 요소는 전용 집적 회로 (ASIC, Application Specific Integrated Circuit) 칩 및 필드 프로그래머블 게이트 어레이 （FPGA，Field Programmable Gate Array） 중 적어도 하나를 포함할 수 있다. 여기서, 상기 실행 주체는 실행 대상 명령이 수신된 경우에, 적어도 하나의 프로세서 코어로부터, 타겟 프로세 서 코어로서 실행 대상 명령을 실행하는 프로세서 코어를 선택할 수 있다. 예를 들어, 각 프로세서 코어의 현재 작업 상태에 근거하여, 적어도 하나의 프로세서 코어로부터, 타겟 프로세서 코어로서 실행 대상 명령을 실행하 는 프로세서 코어를 선택할 수 있다. 다른 예로서, 폴링 방식에 따라 적어도 하나의 프로세서 코어로부터, 타겟 프로세서 코어로서 실행 대상 명령을 실행하는 프로세서 코어를 선택할 수 있다. 이러한 방식으로, 타겟 프로세서 코어는 실행 대상 명령을 수신한 경우에, 실행 대상 명령을 디코딩하여, 연산 식별자 및 적어도 하나의 피연산자를 획득할 수 있다. 여기서, 연산 식별자는, 프로세서 코어가 실행할 수 있는 다양한 연산을 유일하게 식별하는데 사용될 수 있다. 연산 식별자는 숫자, 문자 및 기호 중 적어도 하나를 포함 할 수 있다. 단계 에서, 타겟 프로세서 코어는, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이용하여, 복잡 연산 명령을 생성한다. 본 실시예에서, 타겟 프로세서 코어는 실행 대상 명령을 디코딩하고, 연산 식별자 및 적어도 하나의 피연산자를 획득한 후, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자인지 그 여부를 확정할 수 있다. 미리 설정된 복잡 연산 식별자임이 확정되면, 타겟 프로세서 코어는 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이 용하여 복잡 연산 명령을 생성할 수 있다. 구체적으로, 각 프로세서 코어는 미리 설정된 복잡 연산 식별자 세트를 미리 저장할 수 있고, 이로하여, 타겟 프로세서 코어는 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자 세트에 속하는지 여부를 확정할 수있다. 미리 설정된 복잡 연산 식별자 세트에 속하면, 디코딩된 연산 식별자를 미리 설정된 복잡 연산 식별자 로 확정할 수 있고, 미리 설정된 복잡 연산 식별자 세트에 속하지 않으면, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자가 아님을 확정할 수 있다. 여기서, 복잡 연산 식별자 세트는, 기술자가 실제 애플리케이션 연산 수요에 근거하여, AI 컴퓨팅에 있어서 통 상적인 연산과 관련된 계산량이 많은 연산에 대해, 상기 연산의 연산 식별자를 복잡 연산 식별자로 하여 형성된 복잡 연산 식별자 세트일 수 있다. 일부 실시예에서, 미리 설정된 복잡 연산 식별자는 지수 연산 식별자, 제곱근 연산 식별자 및 삼각 함수 연산 식별자 중 적어도 하나를 포함할 수 있다. 단계 에서, 타겟 프로세서 코어는 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가한다. 본 실시예에서, 타겟 프로세서 코어는 단계 에서 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가할 수 있다. 여기서, 복잡 연산 명령큐에 실행될 복잡 연산 명령이 저장된다. 본 실시예의 일부 바람직한 실시형태에 있어서, 복잡 연산 명령큐는 선입 선출큐일 수 있다. 본 실시예의 일부 바람직한 실시형태에 있어서, 복잡 연산 명령큐는 캐시에 저장될 수 있으며, 여기서 캐시는 타겟 프로세서 코어 및 연산 가속 구성 요소에 각각 유선 연결될 수 있다. 이로서, 타겟 프로세서 코어는 생성 된 복잡 연산 명령을 복잡 연산 명령큐에 추가할 수 있으며, 후속 단계 에서, 연산 가속 구성 요소는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택할 수도 있다.단계 에서, 연산 가속 구성 요소는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택한다. 본 실시예에서, 연산 가속 구성 요소는 다양한 실시방식으로 복잡 연산 명령큐로부터 복잡 연산 명령을 선택할 수 있다. 예를 들어, 연산 가속 구성 요소는 선입 선출 순서에 따라 복잡 연산 명령큐로부터 복잡 연산 명령을 선택할 수 있다. 단계 에서, 연산 가속 구성 요소는 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻는다. 본 실시예에서, 단계 에서 선택된 복잡 연산 명령에 근거하여, 연산 가속 구성 요소는 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻을 수 있다. 본 실시예의 일부 바람직한 실시형태에서, 연산 가속 구성 요소는 적어도 하나의 연산 유닛을 포함할 수 있다. 이로하여, 단계 에서, 연산 가속 구성 요소 중의 선택된 복잡 연산 명령 중 복잡 연산 식별자에 대응하는 연산 유닛이, 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행한다. 단계 에서, 연산 가속 구성 요소는 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입한다. 본 실시예에서, 연산 가속 구성 요소는 단계 에서 복잡 연산을 실행하여 얻어진 연산 결과를 복잡 연산 결 과로서 복잡 연산 결과큐에 기입한다. 여기서, 연산 가속 구성 요소에 의해 복잡 연산을 실행하여 얻은 복잡 연산 결과는 복잡 연산 결과큐에 저장된 다. 본 실시예의 일부 바람직한 실시형태에 있어서, 복잡 연산 결과큐는 선입 선출큐일 수 있다. 본 실시예의 일부 바람직한 실시형태에 있어서, 복잡 연산 결과큐는 캐시에 저장될 수 있으며, 여기서 캐시는 타겟 프로세서 코어 및 연산 가속 구성 요소에 각각 유선 연결될 수 있다. 이렇게 연산 가속 구성 요소는 복잡 연산 결과를 복잡 연산 결과큐에 기입할 수 있다. 동시에, 타겟 프로세서 코어에서 복잡 연산 결과 큐로부터 복 잡 연산 결과를 읽을 수도 있다. 본 출원의 실시형태에 따른 방법은, 타겟 프로세서 코어가, 실행 대상 명령이 실행하고자 하는 연산이 미리 설 정된 복잡 연산임을 확정한데 응답하여, 실행 대상 명령을 디코딩하여 복잡 연산 식별자 및 적어도 하나의 피연 산자를 얻고, 복잡 연산 식별자 및 적어도 하나의 피연산자를 사용하여 복잡 연산 명령을 생성하고, 생성된 복 잡 연산 명령을 복잡 연산 명령큐에 추가하며, 또한, 연산 가속 구성 요소가 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하고, 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여 연산 결과를 얻고, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입함으로써 실현된다. 따라서, 연산 가속 구성 요소를 효과적으로 사용하 여 복잡한 연산을 진행하며, 적어도 다음을 포함한 기술적 효과가 있다. 첫째, 연산 가속 구성 요소를 도입하여 복잡한 연산을 실행함으로써 AI 칩의 복잡 연산을 처리하는 능력과 효율 을 제고시킨다. 둘째, 실천에 있어서, 복잡 연산은 단순 연산에 비해 실행 빈도가 높지 않기 때문에 매개 프로세서 코어마다 하 나의 연산 가속 구성 요소를 배치하는 것이 아니라 적어도 하나의 프로세서 코어가 하나의 연산 가속 구성 요소 를 공유함으로써, 복잡 연산으로 인한 AI 칩의 공간 오버헤드 및 전력 소모 오버헤드를 감소시킬 수 있다. 셋째, 연산 가속 구성 요소는 복수의 연산 유닛을 갖고 있고, 복수의 연산 유닛은 병렬로 복잡 연산 조작을 실 행하기 때문에, 데이터 위험이 없는 정황하에서, 복잡 연산의 시간 오버헤드는 후속 명령에 의해 커버될 수 있 다. 계속하여 도 3a을 참조하면, 도 3a는 인공 지능 칩에 적용되는 산출 방법의 또 하나의 실시예의 프로세스 (30 0)를 나타낸다. 상기 인공 지능 칩에 적용되는 산출 방법의 프로세스 는 다음의 단계를 포함한다. 단계 에서, 적어도 하나의 프로세서 코어 중의 타겟 프로세서 코어에 의해 실행 대상 명령을 디코딩하여 연산 식별자 및 적어도 하나의 피연산자를 얻는다. 본 실시예에서, 인공 지능 칩의 산출 방법에 적용되는 실행 주체 (예를 들어, 도 1에 도시된 AI 칩)는 적어도 하나의 프로세서 코어 및 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결된 연산 가속 구성 요소를 포 함할 수 있다. 연산 가속 구성 요소는 독립적인 연산 능력을 가지며, 프로세서 코어보다 복잡한 연산에 더 적합 하다. 여기서, 복잡 연산은 간단한 연산에 비해 계산량이 많은 연산을 의미하며, 간단한 연산은 계산량이 적은 연산을 의미할 수 있다. 단계 에서, 타겟 프로세서 코어는 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임이 확정됨에 응 답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 이용하여 복잡 연산 명령을 생성한다. 본 실시예에서, 단계 및 단계 의 구체적인 조작은 도 2에 도시된 실시예의 단계 및 단계 의 조작과 실질적으로 동일하므로, 상세한 설명은 생략한다. 단계 에서, 타겟 프로세서 코어는 생성된 복잡 연산 명령을 타겟 프로세서 코어와 대응하는 복잡 연산 명 령큐에 추가한다. 본 실시예에서, 상기 적어도 하나의 프로세서 코어 중 각 프로세서 코어는 모두 대응하는 복잡 연산 명령큐를 갖고 있다. 각 프로세서 코어는 대응하는 복잡 연산 명령큐를 통해 연산 가속 구성 요소에 연결될 수 있다. 이 로서 타겟 프로세서 코어는 단계 에서 생성된 복잡 연산 명령을, 타겟 프로세서 코어와 대응하는 복잡 연 산 명령큐에 추가할 수 있다. 단계 에서, 연산 가속 구성 요소는 적어도 하나의 프로세서 코어의 각 프로세서 코어에 대응하는 복잡 연 산 명령큐로부터 복잡 연산 명령을 선택한다. 본 실시예에서, 연산 가속 구성 요소는 다양한 실시방식을 사용하여 적어도 하나의 프로세서 코어의 각 프로세 서 코어에 대응하는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택할 수 있다. 예를 들어, 연산 가속 구성 요 소는 적어도 하나의 프로세서 코어의 각 프로세서 코어에 대응하는 복잡 연산 명령큐를 폴링하고, 매번 하나의 프로세서 코어에 대응하는 복잡 연산 명령큐로부터 선입 선출 순서에 따라 사전에 설정된 수량 (예를 들어, 하 나)의 명령을 선택할 수 있다. 단계 에서, 연산 가속 구성 요소는 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여 연산 결과를 얻을 수 있다. 본 실시예에서, 단계 의 구체적인 조작은 도 2에 도시된 실시예의 단계 의 조작과 실질적으로 동일하 므로, 상세한 설명은 생략한다. 단계 에서, 연산 가속 구성 요소는,얻어진 연산 결과를 복잡 연산 결과로서, 택된 복잡 연산 명령이 유래 하는 복잡 연산 명령큐에 대응하는 프로세서 코어에 대응하는 복잡 연산 결과큐에 기입한다. 본 실시예에서, 상기 적어도 하나의 프로세서 코어 중 각 프로세서 코어는 모두 대응하는 복잡 연산 결과큐를 갖고 있다. 각 프로세서 코어는 대응하는 복잡 연산 결과큐를 통해 연산 가속 구성 요소에 연결될 수 있다. 이 렇게 하여, 연산 가속 구성 요소는 단계 에서 얻어진 연산 결과를 복잡 연산 결과로서, 단계 에서 선 택된 복잡 연산 명령이 유래하는 복잡 연산 명령큐에 대응하는 프로세서 코어에 대응하는 복잡 연산 결과큐에 기입한다. 본 실시예의 일부 바람직한 실시형태에 있어서, 상기 인공 지능 칩에 적용되는 산출 방법은 다음의 단계 를 더 포함할 수 있다. 단계 에서, 타겟 프로세서 코어는,타겟 프로세서 코어에 대응하는 복잡 연산 결과큐로부터 복잡 연산 결과 를 선택하고, 타겟 프로세서 코어의 결과 레지스터 및 / 또는 인공 지능 칩의 메모리에 기입한다. 여기서, 타겟 프로세서 코어에는 계산 결과를 저장하기 위한 결과 레지스터를 설치할 수 있다. 이렇게, 단계 후, 타겟 프로세서 코어는 타겟 프로세서 코어에 대응하는 복잡 연산 결과큐로부터 복잡 연산 결과를 선 택하고, 타겟 프로세서 코어의 결과 레지스터 및 / 또는 인공 지능 칩의 메모리에 기입한다. 여기서, 인공 지능 칩의 메모리는 스태틱 랜덤 액세스 메모리 (SRAM, Static Random-Access Memory), 다이내믹 랜덤 액세스 메모리 (DRAM, Dynamic Random Access Memory) 및 Flash 메모리 (Flash Memory) 중 적어도 하나를 포함할 수 있다. 계속하여 도 3b를 참조하면, 도 3b는 본 실시예에 따른 인공 지능 칩의 산출 방법에 적용되는 인공 지능 칩의 하나의 구성을 나타낸다. 도 3b에 도시된 바와 같이, 인공 지능 칩은, 프로세서 코어 (301', 302', 303'), 복잡 연산 명령큐 (304', 305', 306'), 연산 가속 구성 요소 (307') 및 복잡 연산 결과큐 (308', 309’, 310') 및 메모리 (311')를 포함할 수 있다. 프로세서 코어 (301', 302', 303')는 복잡 연산 명령큐 (304', 305', 306') 에 각각 유선으로 연결되며, 복잡 연산 명령큐 (304', 305', 306')는 각각 연산 가속 구성 요소 (307')에 유선 으로 연결되며, 연산 가속 구성 요소 (307')는 복잡 연산 결과큐 (308', 309', 310')에 유선으로 연결되며, 복 잡 연산 결과큐 (308', 309', 310')는 각각 프로세서 코어 (301', 302', 303')에 유선으로 연결되며, 프로세서 코어 (301', 302', 303')는 메모리 (311')에 각각 유선으로 연결된다. 프로세서 코어 (301', 302', 303') 내부 에는 각각 결과 레지스터 (도 3b에 도시되지 않음)를 더 설치할 수 있다. 따라서, 프로세서 코어 (301')를 타겟 프로세서 코어로 가정할 경우, 프로세서 코어 (301')는 실행 대상 명령을 수신한 경우에, 먼저 실행 대상 명령을 디코딩하여, 연산 식별자 및 적어도 하나의 피연산자를 얻고, 그 다음, 디코딩에 의해 얻어진 연산 식별자가 삼각 함수 연산 식별자임을 확정하고, 삼각 함수 연산 식별자가 미리 설정 된 복잡 연산 식별자이면, 디코딩에 의해 얻어진 연산 식별자, 즉 삼각 함수 연산 식별자 및 적어도 하나의 피 연산자를 이용하여 복잡 연산 명령을 생성할 수 있다. 도 3c에 도시된 바와 같이, 도 3c는 복잡 연산 명령의 개 략도이다. 이어서, 프로세서 코어(301’)는 생성된 복잡 연산 명령을 프로세서 코어와 대응하는 복잡 연산 명령 큐(304’)에 추가한다. 그리고, 연산 가속 구성 요소(307’)는 복잡 연산 명령큐(304’、305’、306’)로부터 복잡 연산 명령을 선택한다. 그 다음, 연산 가속 구성 요소(307’)는 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실 행하여, 연산 결과를 얻는다. 마지막으로, 연산 가속 구성 요소(307’)는 얻어진 연산 결과를 복잡 연산 결과로 서 복잡 연산 결과큐(308’)에 기입한다. 도 3d에 도시된 바와 같이, 도 3d는 복잡 연산 결과의 개략도이다. 바 람직하게는, 프로세서 코어(301’)는 또한 프로세서 코어(301’)에 대응하는 복잡 연산 결과큐(304’)로부터 복 잡 연산 결과를 선택하고, 프로세서 코어(301’)의 결과 레지스터 및 / 또는 인공 지능 칩의 메모리(311’)에 기입할 수도 있다. 도 3a에서 알수 있는바, 도 2의 대응되는 실시예에 비하여, 본 실시예의 인공 지능 칩에 적용되는 산출 방법의 프로세스 는, 각 프로세서 코어에 대응하는 복잡 연산 명령큐 및 복잡 연산 결과큐를 설치함으로서, 본 실 시예에 설명된 기술적 수단은 인공 지능 칩에 적용되는 산출을 실시하는 구체적인 기술적 수단을 제공한다. 계속하여 도 4를 참조하면, 도 4는 인공 지능 칩에 적용되는 산출 방법의 또 하나의 실시예의 프로세스 를 나타낸다. 상기 인공 지능 칩에 적용되는 산출 방법의 프로세스 는 다음의 단계를 포함한다. 단계 에서, 적어도 하나의 프로세서 코어 중 타겟 프로세서 코어가 실행 대상 명령을 디코딩하여, 연산 식 별자 및 적어도 하나의 피연산자를 얻는다. 본 실시예에서, 인공 지능 칩의 산출 방법에 적용되는 실행 주체 (예를 들어, 도 1에 도시된 AI 칩)는 적어도 하나의 프로세서 코어 및 적어도 하나의 프로세서 코어의 각 프로세서 코어에 연결된 연산 가속 구성 요소를 포 함할 수 있다. 연산 가속 구성 요소는 독립적인 연산 능력을 가지며, 프로세서 코어보다 복잡한 연산에 더 적합 하다. 여기서, 복잡 연산은 간단한 연산에 비해 계산량이 많은 연산을 의미하며, 간단한 연산은 계산량이 적은 연산을 의미할 수 있다. 본 실시예에서, 단계 의 구체적인 조작은 도 2에 도시된 실시예의 단계 의 조작과 실질적으로 동일하 므로, 상세한 설명은 생략한다. 단계 에서, 타겟 프로세서 코어는, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자임을 확정한데 응답하여, 디코딩된 연산 식별자, 적어도 하나의 피연산자 및 타겟 프로세서 코어 식별자를 이용하여 복잡 연산 명령을 생성한다. 본 실시예에서, 타겟 프로세서 코어는 실행 대상 명령을 디코딩하고, 연산 식별자 및 적어도 하나의 피연산자를 획득한 후, 디코딩된 연산 식별자가 미리 설정된 복잡 연산 식별자인지 그 여부를 확정할 수 있다. 미리 설정된 복잡 연산 식별자임이 확정되면, 타겟 프로세서 코어는 디코딩된 연산 식별자, 적어도 하나의 피연산자 및 타겟 프로세서 코어 식별자를 이용하여 복잡 연산 명령을 생성할 수 있다. 단계 에서, 타겟 프로세서 코어는 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가한다. 단계 에서, 연산 가속 구성 요소는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택한다. 단계 에서, 연산 가속 구성 요소는 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻을 수 있다. 본 실시예에서, 단계 , 단계 및 단계 의 구체적인 조작은 도 2에 도시된 실시예의 단계 , 단계 및 단계 의 조작과 실질적으로 동일하므로, 상세한 설명은 생략한다. 단계 에서, 연산 가속 구성 요소는 얻어진 연산 결과 및 선택된 복잡 연산 명령 중 프로세서 코어 식별자 를 복잡 연산 결과로서 복잡 연산 결과큐에 기입한다. 본 실시예에서, 연산 가속 구성 요소는 단계 에서 복잡 연산을 실행하여 얻어진 연산 결과 및 선택된 복잡 연산 명령 중 프로세서 코어 식별자를 복잡 연산 결과로서 복잡 연산 결과큐에 기입한다. 여기서, 연산 가속 구성 요소가 복잡 연산을 실행하여 얻은 복잡 연산 결과가 복잡 연산 결과큐에 저장된다. 본 실시예의 일부 바람직한 실시형태에 있어서, 상기 인공 지능 칩에 적용되는 산출 방법은 다음의 단계 를 더 포함할 수 있다. ]단계 에서, 타겟 프로세서 코어는, 복잡 연산 결과큐로부터 프로세서 코어 식별자가 타겟 프로세서 코어 식별자인 복잡 연산 결과의 연산 결과를 선택하여, 타겟 프로세서 코어의 결과 레지스터 및 / 또는 인공 지능 칩의 메모리에 기입한다. 여기서, 타겟 프로세서 코어에는 계산 결과를 저장하기 위한 결과 레지스터를 설치할 수 있다. 따라서, 단계 후, 타겟 프로세서 코어는 복잡 연산 결과큐로부터 프로세서 코어 식별자가 타겟 프로세서 코어 식별자인 복잡 연산 결과의 연산 결과를 선택하여, 타겟 프로세서 코어의 결과 레지스터 및 / 또는 인공 지능 칩의 메모 리에 기입할 수 있다. 여기서, 인공 지능 칩의 메모리는 스태틱 랜덤 액세스 메모리, 다이내믹 랜덤 액세스 메모리 및 Flash 메모리 중 적어도 하나를 포함할 수 있다. 계속하여 도 4b를 참조하면, 도 4b는 본 실시예에 따른 인공 지능 칩의 산출 방법에 적용되는 인공 지능 칩의 하나의 구성을 나타낸다. 도 4b에 도시된 바와 같이, 인공 지능 칩은 프로세서 코어 (401', 402', 403'), 복잡 연산 명령큐 (404'), 연산 가속 구성 요소 (405') 및 복잡 연산 결과큐 (406') 및 메모리 (407')를 포함할 수 있다. 프로세서 코어 (401', 402', 403')는 각각 복잡 연산 명령큐 ( 404')에 유선으로 연결되며, 복잡 연산 명 령큐 (404')는 연산 가속 구성 요소 (405')에 유선으로 연결되며, 연산 가속 구성 요소 (405')는 복잡 연산 결 과큐 (406')에 유선으로 연결되며, 복잡 연산 결과큐 (406')는 프로세서 코어 (401', 402', 403')에 유선으로 연결되며, 프로세서 코어 (401', 402', 403')는 각각 메모리 (407')에 유선으로 연결된다. 프로세서 코어 (401', 402', 403') 내부에는 각각 결과 레지스터 (도 4b에 도시되지 않음)를 더 설치할 수 있다. 따라서, 프로세서 코어 (401')를 타겟 프로세서 코어로 가정할 경우, 프로세서 코어 (401')는 실행 대상 명령을 수신한 경우에, 먼저 실행 대상 명령을 디코딩하여, 연산 식별자 및 적어도 하나의 피연산자를 얻고, 그 다음, 디코딩에 의해 얻어진 연산 식별자가 삼각 함수 연산 식별자임을 확정하고, 삼각 함수 연산 식별자가 미리 설정 된 복잡 연산 식별자이면, 디코딩에 의해 얻어진 연산 식별자, 즉 삼각 함수 연산 식별자, 적어도 하나의 피연 산자 및 프로세서 코어 (401’)의 프로세서 코어 식별자를 이용하여 복잡 연산 명령을 생성할 수 있다. 도 4c에 도시된 바와 같이, 도 4c는 하나의 복잡 연산 명령을 나타낸다. 이어서, 프로세서 코어(401’)는 생성된 복잡 연산 명령을 복잡 연산 명령큐(404’)에 추가한다. 그 다음, 연산 가속 구성 요소(405’)는 복잡 연산 명령큐 (404’)로부터 복잡 연산 명령을 선택한다. 그 다음, 연산 가속 구성 요소(405’)는 선택된 복잡 연산 명령 중 적어도 하나의 피연산자를 입력 파라미터로 사용하여, 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여, 연산 결과를 얻는다. 마지막으로, 연산 가속 구성 요소(405’)는 얻어진 연산 결과 및 선택된 복잡 연산 명령 중 프로세서 코어 식별자를 복잡 연산 결과로서 복잡 연산 결과큐(406’)에 기입한다. 도 4d에 도시된 바와 같이, 도 4d는 복잡 연산 결과를 나타낸다. 바람직하게는, 프로세서 코어(401’)는 또한 복잡 연산 결과큐로부터 프로세서 코어 식별자가 프로세서 코어(401’)의 프로세서 코어 식별자인 복잡 연산 결 과의 연산 결과를 선택하여, 프로세서 코어(401’)의 결과 레지스터 및 / 또는 인공 지능 칩의 메모리(407’)에 기입한다. 도 4a에서 알수 있는바, 도 3의 대응되는 실시예에 비하여, 본 실시예의 인공 지능 칩에 적용된 산출 방법의 프 로세스 는, 적어도 하나의 프로세서 코어가 하나의 복잡 연산 명령큐 및 복잡 연산 결과큐를 공유함으로서, 도 3a의 대응하는 실시예에 비교하여, 본 실시예에서 설명된 해결 방안은 AI 칩의 공간 오버헤드및 전력 소비 오버헤드를 더 감소시킬 수 있다. 이하 도5를 참조하면, 도 5는 본 출원의 실시예의 전자 기기를 실현하기에 적합한 컴퓨터 시스템의 구조를 나타낸다. 도 5에 도시된 전자 기기는 단 하나의 예에 불과하며, 본 출원의 실시예의 기능과 사용 범위에 대하 여 어떠한 제한을 해서는 안된다. 도 5에 도시된 바와 같이, 컴퓨터 시스템은 적어도 하나의 중앙 처리 유닛 (CPU, Central Processing Unit）을 포함하며, 읽기 전용 메모리(ROM, Read Only Memory) 에 저장되어 있는 프로그램 또는 저 장부로부터 랜덤 액세스 메모리(RAM, Random Access Memory) 에 로드된 프로그램에 따라 다양한 적 당한 동작 및 처리를 실행할 수 있다. RAM에는 시스템의 조작에 필요한 각종 프로그램 및 데이터가 더 저장되어 있다. CPU 는 또한 적어도 하나의 인공 지능 칩 을 통해 데이터의 처리 분석을 수행할 수 있다. CPU, ROM, RAM 및 인공 지능 칩 은 버스를 통해 서로 연결되어 있다. 입력 / 출력 (I / O) 인터페이스도 버스에 연결되어 있다. I/O 인터페이스에 연결되는 부재로서, 키보드, 마우스 등을 포함하는 입력부와, 예를 들어, 음극선관 (CRT, Cathode Ray Tube), 액정 표시 장치(LCD, Liquid Crystal Display) 등 및 스피커 등을 포함하는 출력부 와, 하드 디스크 등을 포함하는 저장부와, 예를 들어 LAN (로컬 영역 네트워크, Local Area Network) 카드, 모뎀 등의 네트워크 인터페이스 카드를 포함하는 통신부가 포함된다. 통신부는 인터 넷과 같은 네트워크를 통해 통신 처리를 실행한다. 드라이버는 또한 필요에 따라 I / O 인터페이스에 연결된다. 이동식 미디어, 예를 들어, 마그네틱 디스크, 광 디스크, 광자기 디스크, 반도체 메모리 등이, 필요에 따라 드라이버에 장착됨으로서 드라이버 에서 판독된 컴퓨터 프로그램이 필요에 따라 기억부 에 장착된다. 특히, 본 발명의 실시예에 따르면, 상기 흐름도를 참조하여 설명된 과정은 컴퓨터 소프트웨어 프로그램으로 실 현될 수 있다. 예를 들어, 본 발명의 실시예는, 컴퓨터 판독 가능 매체에 로드되는 컴퓨터 프로그램을 포함한 컴퓨터 프로그램 제품을 제공하며, 상기 컴퓨터 프로그램은 순서도에 표시된 방법을 실행하기 위한 프로그램 코 드를 포함한다. 이러한 실시예에서, 상기 컴퓨터 프로그램은 통신부를 통해 네트워크로부터 다운로드되여 설치 및/또는 이동식 미디어로부터 장착될 수 있다. 상기 컴퓨터 프로그램은 중앙 처리 유닛 (CPU)에 의해 실행시, 본 출원의 방법에 한정된 상기 기능을 실행한다. 설명해야 할것은, 본 출원에 기재되는 컴퓨터 판 독 가능 매체는 컴퓨터 판독 가능 신호 매체 또는 컴퓨터 판독 가능 저장 매체 또는 상기 양자의 임의적인 조합 일 수 있다. 컴퓨터 판독 가능 저장 매체는 예컨대 전기, 자기, 광, 전자기, 적외선 또는 반도체의 시스템, 장 치 또는 소자, 혹은 임의적인 조합일 수 있지만 이에 한정되지 않는다. 컴퓨터 판독 가능 저장 매체의 보다 구 체적인 예는, 하나 또는 복수의 전도선을 구비한 전기적 연결, 휴대형 컴퓨터 자기 디스크, 하드디스크, 랜덤 액세스 메모리(RAM), 읽기 전용 메모리(ROM), 삭제 가능 프로그래밍 읽기 전용 메모리(EPROM 또는 플래시 메모 리), 광섬유, 휴대형 콤팩터 자기디스크 읽기 전용 메모리(CD-ROM), 광 메모리 소자, 자기 메모리 소자, 또는 상술한 요소들의 임의적인 적당한 조합을 포함하며 이에 한정되지 않는다. 본 출원에 있어서, 컴퓨터 판독 가능 저장 매체는 프로그램을 포함하거나 저장한 임의의 유형 매체일 수 있으며, 상기 프로그램은 명령 실행 시스템, 장치 또는 소자에 의해 사용되거나 그것들과 결합 사용될 수 있다. 본 출원에서, 컴퓨터 판독 가능 신호 매체는 베이스 밴드에 포함되거나, 캐리어 파동의 일부분으로서 전파되는 데이터 신호에 포함될 수 있는데, 그 중에는 컴퓨터 판독 가능 프로그램 코드가 탑재되어 있다. 이러한 전파되는 데이터 신호는 다양한 형식을 적용할 수 있 는 바, 전자기 신호, 광 신호 또는 상술한 신호들의 임의적인 조합을 포함할 수 있지만 이에 한정되지는 않는다. 컴퓨터 판독 가능 신호 매체는 또한 컴퓨터 판독 가능 저장 매체 이외의 임의의 컴퓨터 판독 가능 매체 일 수도 있는데, 상기 컴퓨터 판독 가능 매체는 프로그램을 수송, 전파 또는 전송할 수 있는 바, 상기 프로그램 은 명령 실행 시스템, 장치 또는 소자 또는 이들의 결합에 의해 사용되는 프로그램이다. 컴퓨터 판독 가능 매체 상에 포함되는 프로그램 코드는 임의의 적절한 매체를 이용하여 전송될 수 있는데, 무선, 전선, 광 케이블, RF 등 또는 상술한 요소들의 임의의 적절한 조합을 포함할 수 있으나 이에 한정되지 않는다. 한 가지 또는 여러 가지 프로그램 설계 언어 또는 그 조합에 의해 본 출원에 따라 조작하는 컴퓨터 프로그램 코 드를 프로그래밍할 수 있고, 상기 프로그램 설계 언어는 객체를 지향한 프로그램 설계 언어, 예컨대 Java, Smalltalk, C++를 포함하고, 상규적 과정식 프로그램 설계 언어, 예컨대 \"C\" 언어 또는 유사한 프로그램 설계 언어를 더 포함한다. 프로그램 코드는 완전히 사용자 컴퓨터 상에서 실행되거나, 부분적으로 사용자 컴퓨터 상 에서 실행되거나, 하나의 독립적인 소프트웨어 패킷으로서 실행되거나, 일부분은 사용자 컴퓨터 상에서 타부분 은 원격 컴퓨터 상에서 실행되거나, 완전히 원격 컴퓨터 또는 서버 상에서 실행될 수 있다. 원격 컴퓨터가 섭렵 되는 경우, 원격 컴퓨터는 임의의 종류의 네트워크 - 로컬 영역 네트워크(LAN) 또는 광대 영역 네트워크(WAN)를통해 사용자 컴퓨터에 연결될 수 있다. 또는, 외부 컴퓨터 (예를 들면, 인터넷 서비스 제공업체를 이용하여 인 터넷을 통해 연결)에 연결될 수 있다. 첨부된 도면 중의 흐름도 및 블록도는 본 출원의 각 실시예에 따른 시스템, 방법, 및 컴퓨터 프로그램 제품의 실시 가능한 체계구조, 기능 및 동작을 도시하였다. 이러한 방면에 있어서, 흐름도 또는 블록도 중의 각 블록은 하나의 모듈, 프로그램 세그먼트 또는 코드의 일부분을 대표할 수 있고, 해당 모듈, 프로그램 세그먼트 또는 코 드의 일부분은 규정된 로직 기능을 실시하기 위한 하나 또는 다수의 실행 가능한 명령을 포함한다. 일부 대체 실시에 있어서, 블록에 표기된 기능들은 첨부된 도면에 표기된 순서와 다른 순서로 수행될 수도 있음을 유의하 여야 한다. 예를 들어, 순차적으로 표시된 두개의 블록은 실제적으로 거의 동시에 실행될 수 있고, 경우에 따라 반대된 순서에 따라 실행될 수도 있으며, 이는 관련된 기능에 따라 결정된다. 블록도 및 / 또는 흐름도 중의 각 블록 및 블록도 및 / 또는 흐름도 중의 블록들의 조합은 규정된 기능 또는 동작을 실행하는 하드웨어 기반의 전 용 시스템으로 실시되거나, 전용 하드웨어와 컴퓨터 명령의 조합으로 실시될 수 있음을 유의하여야 한다. 다른 하나의 양태로서, 본 출원은 컴퓨터 판독 가능 매체를 더 제공하며,상기 컴퓨터 판독 가능 매체에는 하나 또는 다수의 프로그램이 탑재되어 있고, 상기 하나 또는 다수의 프로그램이 인공 지능 칩에 의해 실행될 경우, 상기 인공 지능 칩으로 하여금, , 적어도 하나의 크로세서 코어 중 타겟 프로세서 코어가 실행 대상 명령을 디 코딩하여 연산 식별자 및 적어도 하나의 피연산자를 얻고, 타겟 프로세서 코어는 디코딩하여 얻은 연산 식별자 가 미리 설정된 복잡 연산 식별자임이 확정됨에 응답하여, 디코딩된 연산 식별자 및 적어도 하나의 피연산자를 사용하여 복잡 연산 명령을 생성하고, 생성된 복잡 연산 명령을 복잡 연산 명령큐에 추가하며, 연산 가속 구성 요소는 복잡 연산 명령큐로부터 복잡 연산 명령을 선택하고, 선택된 복잡 연산 명령 중 적어도 하나의 피연산자 를 입력 파라미터로 사용하여 선택된 복잡 연산 명령 중 복잡 연산 식별자가 지시하는 복잡 연산을 실행하여 연 산 결과를 얻고, 얻어진 연산 결과를 복잡 연산 결과로서 복잡 연산 결과큐에 기입한다. 이상의 설명은 단지 본 출원의 비교적 바람직한 실시예 및 운용한 기술적 원리에 대한 설명이다. 본 출원에 관 련된 발명의 범위가 상기 기술적 특징들의 특정 조합으로 이루어진 기술적 방안들에 한정되는 것이 아니라, 본 발명의 주지를 벗어나지 않는한 상기 기술적 특징들 또는 그들의 균등한 특징들의 임의의 조합으로 이루어진 기"}
{"patent_id": "10-2019-0083121", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "타 기술적 방안들도 포함되어야 함을 해당 기술분야의 당업자는 이해할 것이다. 예를 들어, 상기 특징들과 본 출원에 개시되어 있으나 이에 한정되지 않는 유사한 기능을 구비한 기술적 특징을 서로 대체하여 이루어진 기술 적 방안도 포함된다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면3d 도면4a 도면4b 도면4c 도면4d 도면5"}
{"patent_id": "10-2019-0083121", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이하, 첨부된 도면을 참조하면서 비한정적인 실시예를 상세하게 설명함으로써 본 출원의 다른 특징, 목적 및 이 점은 더욱 명확해진다. 도 1은 본 출원의 일 실시예에 적용될 수 있는 예시적인 시스템 아키텍처 도이다.도 2는 본 출원에 따른 인공 지능 칩에 적용되는 산출 방법의 일 실시예의 흐름도이다. 도 3a는 본 출원에 따른 인공 지능 칩에 적용되는 산출 방법의 또 하나의 실시예의 흐름도이다. 도 3b는 도 3a의 실시예에 따른 인공 지능 칩의 산출 방법에 적용되는 인공 지능 칩의 개략적인 구조도이다. 도 3c는 도 3a의 실시예에 따른 복잡 연산 명령의 개략도이다. 도 3d는 도 3a의 실시예에 따른 복잡 연산 결과의 개략도이다. 도 4a는 본 출원에 따른 인공 지능 칩에 적용되는 산출 방법의 또 하나의 실시예의 흐름도이다. 도 4b는 도 4a의 실시예에 따른 인공 지능 칩의 산출 방법에 적용되는 인공 지능 칩의 개략적인 구조도이다. 도 4c는 도 4a의 실시예에 따른 복잡 연산 명령의 개략도이다. 도 4d는 도 4a의 실시예에 따른 복잡 연산 결과의 개략도이다. 도 5는 본 출원의 실시예의 실현에 적합한 전자 기기의 컴퓨터 시스템의 개략적인 구조도이다."}
