{"patent_id": "10-2022-0152781", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0071073", "출원번호": "10-2022-0152781", "발명의 명칭": "수하물 검색 방법, 수하물 검색을 위한 학습 모델을 학습시키는 학습 장치 및 방법", "출원인": "한국원자력연구원", "발명자": "이병노"}}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 영상 검출부;상기 수하물 영상의 원본 데이터를 획득하는 데이터 획득부;수하물 검색을 위한 프로그램이 저장된 저장부; 및상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 프로그램 내의 학습 모델을 학습시키는 영상 처리부;를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 데이터 획득부는,상기 수하물 영상을 디지털 신호로 변환하여 출력하는 제1 데이터 획득부;상기 디지털 신호를 저전압 차분 신호(low voltage differential signaling, LVDS)로 분기시키는 데이터 분기부; 및상기 저전압 차분 신호를 획득하여 상기 원본 데이터를 출력하는 제2 데이터 획득부;를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 데이터 획득부는,상기 저전압 차분 신호를 획득하여 상기 디지털 신호의 캡처 데이터를 출력하는 제3 데이터 획득부;를 더 포함하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 제2 데이터 획득부는 이더넷(ethernet) 인터페이스를 통해 상기 원본 데이터를 상기 영상 처리부로 전송하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서,상기 원본 데이터는 4바이트의 헤더를 포함하고, 상기 헤더는 채널 번호 바이트, 각 채널의 데이터 일련 번호바이트, 라인 번호 바이트 및 옵션 바이트를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0071073-3-제 2 항에 있어서,상기 제1 데이터 획득부는 상기 수하물 영상에서 m개의 수직 성분 영상과 상기 m개의 수평 성분 영상을, 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호로 각각 변환하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 제2 데이터 획득부는 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호를, 단일의수직 성분 디지털 신호와 단일의 수평 성분 디지털 신호로 각각 취합하여 상기 원본 데이터로 출력하는수하물 검색을 위한 학습 모델을 학습시키는 장치."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "수하물 검색 시스템의 수하물 검색을 위한 학습 모델을 학습시키는 학습 장치의 학습 방법에 있어서,상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계;상기 수하물 영상의 원본 데이터를 획득하는 단계;상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 학습 모델을 학습시키는 단계;를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 획득하는 단계는,상기 수하물 영상을 디지털 신호로 변환하여 출력하는 단계;상기 디지털 신호를 저전압 차분 신호로 분기시키는 단계; 및상기 저전압 차분 신호를 획득하여 상기 원본 데이터를 출력하는 단계;를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 획득하는 단계는,상기 저전압 차분 신호를 획득하여 상기 디지털 신호의 캡처 데이터를 출력하는 단계;를 더 포함하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 원본 데이터를 출력하는 단계는 이더넷 인터페이스를 통해 상기 원본 데이터를 상기 영상 처리부로 전송하는 단계를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,상기 원본 데이터는 4바이트의 헤더를 포함하고, 상기 헤더는 채널 번호 바이트, 각 채널의 데이터 일련 번호공개특허 10-2024-0071073-4-바이트, 라인 번호 바이트 및 옵션 바이트를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 디지털 신호를 변환하여 출력하는 단계는 상기 수하물 영상에서 m개의 수직 성분 영상과 상기 m개의 수평성분 영상을, 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호로 각각 변환하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 원본 데이터를 출력하는 단계는 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털신호를, 단일의 수직 성분 디지털 신호와 단일의 수평 성분 디지털 신호로 각각 취합하여 상기 원본 데이터로출력하는 단계를 포함하는수하물 검색을 위한 학습 모델을 학습시키는 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "수하물 검색 시스템의 수하물 검색 방법에 있어서,상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계; 및상기 수하물 검색 시스템 내의 학습 모델을 이용하여 상기 수하물 영상으로부터 수하물 검색 결과를 출력하는단계;를 포함하되,상기 학습 모델은 상기 수하물 영상의 원본 데이터로부터 상기 수하물 검색 결과를 영상으로 출력하도록 학습된학습 모델인수하물 검색 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15 항에 있어서,상기 원본 데이터는 방사선 투과 정보가 포함된 원본 이미지 파일을 포함하는수하물 검색 방법."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체로서,상기 컴퓨터 프로그램은,수하물 검색 시스템의 수하물 검색을 위한 학습 모델을 학습시키는 학습 장치의 학습 방법을 프로세서가 수행하도록 하기 위한 명령어를 포함하고,상기 방법은,상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계;상기 수하물 영상의 원본 데이터를 획득하는 단계;상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 학습 모델을 학습시키는 단계;를 포함하는컴퓨터 판독 가능한 기록매체."}
{"patent_id": "10-2022-0152781", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2024-0071073-5-컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램으로서,상기 컴퓨터 프로그램은,상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계;상기 수하물 영상의 원본 데이터를 획득하는 단계;상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 학습 모델을 학습시키는 단계;를 포함하는 수하물 검색 시스템의 수하물 검색을 위한 학습 방법을 프로세서가 수행하도록 하기위한 명령어를 포함하는 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 영상 검출부; 상기 수하물 영상 의 원본 데이터를 획득하는 데이터 획득부; 수하물 검색을 위한 프로그램이 저장된 저장부; 및 상기 원본 데이터 를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 프로그램 내의 학습 모델을 학습시 키는 영상 처리부;를 포함하는 수하물 검색을 위한 학습 모델을 학습시키는 장치를 포함할 수 있다."}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 수하물 검색 기술 및 이를 위한 데이터 처리 기술과 관련이 있다."}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 수하물 검색 방식에서는 촬영된 영상을 캡처(capture)하거나 영상 파일을 우회 획득하여 수하물에 대한 정보를 제공하고 있으며, 수하물에 대한 세부 품목을 구체적으로 확인하기 위해서는 이러한 수하물 정보를 인공 지능 판독 프로그램 등을 이용하여 학습을 수행할 필요가 있다. 그런데, 캡처 방식으로 획득된 수하물 정보로는 인공지능 판독 프로그램을 이용하더라도 양질의 검사 결과를 얻 는데 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-1900463호 (2018년10월10일 등록공고) (특허문헌 0002) 일본등록특허 제6699890호 (2020년05월07일 등록)"}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시예에서는, 촬영된 수하물 영상에 대해 양질의 수하물 검색 결과를 제공할 수 있는 수하물 검색 기술을 제안하고자 한다. 본 발명의 실시예에서는, 촬영된 수하물 영상에 대해 양질의 수하물 검색 결과를 출력하도록 학습 모델을 학습 하는 기술을 제안하고자 한다. 본 발명의 실시예에서는, 촬영된 수하물 영상에 대해 양질의 수하물 검색 결과를 제공할 수 있도록 데이터를 획 득하는 데이터 처리 기술을 제안하고자 한다. 본 발명이 해결하고자 하는 과제는 상기에서 언급한 것으로 제한되지 않으며, 언급되지 않은 또 다른 해결하고 자 하는 과제는 아래의 기재들로부터 본 발명이 속하는 통상의 지식을 가진 자에 의해 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 영상 검출부; 상기 수하물 영상의 원본 데이터를 획득하는 데이터 획득부; 수하물 검색을 위한 프로그램이 저장된 저장부; 및 상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 프로그램 내의 학 습 모델을 학습시키는 영상 처리부;를 포함하는 수하물 검색을 위한 학습 모델을 학습시키는 장치를 제공할 수 있다.여기서, 상기 데이터 획득부는, 상기 수하물 영상을 디지털 신호로 변환하여 출력하는 제1 데이터 획득부; 상기 디지털 신호를 저전압 차분 신호(low voltage differential signaling, LVDS)로 분기시키는 데이터 분기부; 및 상기 저전압 차분 신호를 획득하여 상기 원본 데이터를 출력하는 제2 데이터 획득부;를 포함할 수 있다. 또한, 상기 데이터 획득부는, 상기 저전압 차분 신호를 획득하여 상기 디지털 신호의 캡처 데이터를 출력하는 제3 데이터 획득부;를 더 포함할 수 있다. 또한, 상기 제2 데이터 획득부는 이더넷(ethernet) 인터페이스를 통해 상기 원본 데이터를 상기 영상 처리부로 전송할 수 있다. 또한, 상기 원본 데이터는 4바이트의 헤더를 포함하고, 상기 헤더는 채널 번호 바이트, 각 채널의 데이터 일련 번호 바이트, 라인 번호 바이트 및 옵션 바이트를 포함할 수 있다. 또한, 상기 제1 데이터 획득부는 상기 수하물 영상에서 m개의 수직 성분 영상과 상기 m개의 수평 성분 영상을, 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호로 각각 변환할 수 있다. 또한, 상기 제2 데이터 획득부는 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호를, 단 일의 수직 성분 디지털 신호와 단일의 수평 성분 디지털 신호로 각각 취합하여 상기 원본 데이터로 출력할 수 있다. 본 발명의 실시예에 따르면, 수하물 검색 시스템의 수하물 검색을 위한 학습 모델을 학습시키는 학습 장치의 학 습 방법에 있어서, 상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계; 상기 수하 물 영상의 원본 데이터를 획득하는 단계; 상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영 상으로 출력하도록 상기 학습 모델을 학습시키는 단계;를 포함하는 수하물 검색을 위한 학습 모델을 학습시키는 방법을 제공할 수 있다. 여기서, 상기 획득하는 단계는, 상기 수하물 영상을 디지털 신호로 변환하여 출력하는 단계; 상기 디지털 신호 를 저전압 차분 신호로 분기시키는 단계; 및 상기 저전압 차분 신호를 획득하여 상기 원본 데이터를 출력하는 단계;를 포함하는 수하물 검색을 위한 학습 모델을 학습시키는 방법을 제공할 수 있다. 또한, 상기 획득하는 단계는, 상기 저전압 차분 신호를 획득하여 상기 디지털 신호의 캡처 데이터를 출력하는 단계;를 더 포함할 수 있다. 또한, 상기 원본 데이터를 출력하는 단계는 이더넷 인터페이스를 통해 상기 원본 데이터를 상기 영상 처리부로 전송하는 단계를 포함할 수 있다. 또한, 상기 원본 데이터는 4바이트의 헤더를 포함하고, 상기 헤더는 채널 번호 바이트, 각 채널의 데이터 일련 번호 바이트, 라인 번호 바이트 및 옵션 바이트를 포함할 수 있다. 또한, 상기 디지털 신호를 변환하여 출력하는 단계는 상기 수하물 영상에서 m개의 수직 성분 영상과 상기 m개의 수평 성분 영상을, 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호로 각각 변환할 수 있다. 또한, 상기 원본 데이터를 출력하는 단계는 상기 m개의 수직 성분 디지털 신호와 상기 m개의 수평 성분 디지털 신호를, 단일의 수직 성분 디지털 신호와 단일의 수평 성분 디지털 신호로 각각 취합하여 상기 원본 데이터로 출력하는 단계를 포함할 수 있다. 본 발명의 실시예에 따르면, 수하물 검색 시스템의 수하물 검색 방법에 있어서, 상기 수하물 검색 시스템을 통 과하는 객체에 대한 수하물 영상을 검출하는 단계; 및 상기 수하물 검색 시스템 내의 학습 모델을 이용하여 상 기 수하물 영상으로부터 수하물 검색 결과를 출력하는 단계;를 포함하되, 상기 학습 모델은 상기 수하물 영상의 원본 데이터로부터 상기 수하물 검색 결과를 영상으로 출력하도록 학습된 학습 모델인 수하물 검색 방법을 제공 할 수 있다. 여기서, 상기 원본 데이터는 방사선 투과 정보가 포함된 원본 이미지 파일을 포함할 수 있다. 본 발명의 실시예에 따르면, 컴퓨터 프로그램을 저장하고 있는 컴퓨터 판독 가능 기록매체로서, 상기 컴퓨터 프 로그램은, 수하물 검색 시스템의 수하물 검색을 위한 학습 모델을 학습시키는 학습 장치의 학습 방법을 프로세 서가 수행하도록 하기 위한 명령어를 포함하고, 상기 방법은, 상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계; 상기 수하물 영상의 원본 데이터를 획득하는 단계; 상기 원본 데이터를 학습용데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 상기 학습 모델을 학습시키는 단계;를 포함할 수 있다. 본 발명의 실시예에 따르면, 컴퓨터 판독 가능 기록매체에 저장된 컴퓨터 프로그램으로서, 상기 컴퓨터 프로그 램은, 상기 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계; 상기 수하물 영상의 원 본 데이터를 획득하는 단계; 상기 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력 하도록 상기 학습 모델을 학습시키는 단계;를 포함하는 수하물 검색 시스템의 수하물 검색을 위한 학습 방법을 프로세서가 수행하도록 하기 위한 명령어를 포함할 수 있다."}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 의하면, 원본 데이터 기반의 고화질 영상을 획득 함으로써 수하물 검색 정확도를 높이고 검 색 오류를 최소화할 수 있는 양질의 수하물 검색 결과를 제공할 수 있다. 또한, 원본 데이터의 획득을 통해서 인공지능 학습을 위한 방사선 투과 정보를 함유하고 있는 고 해상도 원본 이미지 파일을 확보할 수 있는 바, 보 다 진보된 인공지능 판독 프로그램의 개발이 가능하다. 본 발명의 실시예에서와 같이 원본 데이터 파일을 획득 함으로써 기존에 캡쳐 보드 혹은 이미지 그래버(grabber) 형태로 획득되었던 이미지 형태의 인공지능 학습 데이 터들(이미지 도메인)을 원본 데이터의 영역(원본 데이터 도메인)으로 변환하는 정보를 갖는 인자들을 추출하여 기존 이미지 형태의 수많은 데이터들을 방사선 투과 정보가 함유된 의미 있는 원본 데이터로 재 생성 할 수 있 다."}
{"patent_id": "10-2022-0152781", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 다 양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명의 범주 는 청구항에 의해 정의될 뿐이다. 본 발명의 실시예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명은 본 발명의 실시예들을 설 명함에 있어 실제로 필요한 경우 외에는 생략될 것이다. 그리고 후술되는 용어들은 본 발명의 실시예에서의 기 능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 본 발명의 실시예에서는, 원본 데이터 기반의 고화질 영상을 획득함으로써, 촬영된 수하물 영상에 대해 정확도 가 향상된 수하물 검색 결과를 제공할 수 있는 수하물 검색 기술, 수하물 검색을 위한 학습 기술 및 데이터 처 리 기술을 제안하고자 한다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예에 대해 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 수하물 검색 장치 또는 수하물 검색을 위한 학습 장치에 대한 블록도이다. 본 발명의 실시예는 수하물 영상의 원본 데이터를 획득하여 정확도가 향상된 수하물 검색 결과를 출력하도록 학 습 모델을 학습시키는데 주요 특징이 있는 바, 수하물 검색을 위한 학습 장치를 먼저 설명하기로 한다. 도 1의 학습 장치는 영상 검출부, 데이터 획득부, 영상 처리부 및 저장부를 포함할 수 있다. 도 1에 도시한 바와 같이, 영상 검출부는 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출 할 수 있다. 데이터 획득부는 영상 검출부를 통해 검출되는 수하물 영상으로부터 원본 데이터를 획득할 수 있다. 이러한 데이터 획득부를 도 2를 참조하여 보다 상세히 설명하기로 한다. 도 2는 도 1의 데이터 획득부에 대한 상세 블록도로서, 데이터 획득부는 제1 데이터 획득부, 데이 터 분기부, 제2 데이터 획득부 및 제3 데이터 획득부를 포함할 수 있다. 제1 데이터 획득부는 영상 검출부에서 검출된 수하물 영상을 디지털 신호로 변환 및 획득할 수 있다. 데이터 분기부는 제1 데이터 획득부에서 획득된 디지털 신호를 저전압 차분 신호(low voltage differential signaling, LVDS)로 분기시킬 수 있다. 제2 데이터 획득부는 데이터 분기부에서 분기된 저전압 차분 신호를 획득하여 원본 데이터를 출력할 수 있다. 이러한 원본 데이터는 영상 검출부에서 검출된 원본 영상을 그대로 디지털 처리한 데이터로서, 후 술하는 영상 처리부에서 수하물 검색 결과를 출력하기 위한 학습 모델을 학습시키기 위한 입력 데이터로 활 용될 수 있다. 즉, 제2 데이터 획득부는 양질의 수하물 검색 결과를 얻기 위한 학습 모델의 학습용 데이터 를 확보하는데 그 목적이 있다. 이때, 원본 데이터는 방사선 투과 정보가 포함된 영상, 예를 들어 X-선 영상일 수 있다. 제3 데이터 획득부는 데이터 분기부에서 분기된 저전압 차분 신호를 획득하여 디지털 신호의 캡처 데 이터를 획득 및 출력할 수 있다. 이러한 캡처 데이터를 획득하기 위해 제3 데이터 획득부는, 예를 들어 PCI(peripheral component interconnect) 방식의 그래버 보드(grabber board)를 포함할 수 있다. 영상 처리부는 제2 데이터 획득부에서 획득된 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 영상으로 출력하도록 저장부 내의 학습 모델을 학습시키는 역할을 할 수 있다. 이러한 영상 처리부는 수하물 검색을 위한 학습 장치의 전반적인 동작을 제어할 수 있다. 저장부는 도 3에 도시한 바와 같이, 수하물 검색 프로그램 및 수하물 검색 프로그램의 실행에 필요한 정보를 저장할 수 있으며, 수하물 검색 프로그램 내에는 본 발명의 실시예에 따른 수하물 검색 결과를 출력 하기 위한 학습 모델을 포함할 수 있다. 본 발명의 실시예에서 수하물 검색 프로그램은 수하물을 촬영한 수하물 영상의 원본 데이터를 수신하면, 이 러한 원본 데이터를 입력으로 하여 수하물 영상의 검색 결과를 영상으로 출력하도록 프로그램 된 명령어들을 포 함하는 소프트웨어를 의미할 수 있다. 따라서, 영상 처리부는 수하물 검색 프로그램을 실행하기 위하여 저장부에서 수하물 검색 프로그 램 및 수하물 검색 프로그램의 실행에 필요한 정보를 로드할 수 있으며, 수하물 검색 프로그램을 실행하여 수하물을 촬영한 이미지로부터 수하물 검색 결과를 출력할 수 있다. 도 4는 본 발명의 실시예에 따라 정확도가 향상된 수하물 검색 결과를 출력하도록 학습 모델을 학습시키는 특징을 설명하는 도면이다. 도 4에 도시한 바와 같이, 학습 모델은 데이터 획득부의 제2 데이터 획득부에서 획득된 수하물 영 상의 원본 데이터를 학습용 데이터로 입력하여 수하물 검색 결과를 출력하도록 학습될 수 있다. 예를 들어, 학습 모델은 수하물 영상의 원본 데이터인 학습용 데이터와 함께, 레이블 데이터로서 학습용 데 이터에 대한 정답 결과를 입력 받으면, 상기 학습용 데이터에 대한 수하물 검색 결과를 출력하도록 학습될 수 있다. 한편, 도 1은 도 3 및 도 4의 학습 모델을 이용하여 수하물을 검색하기 위한 수하물 검색 장치로 활용될 수 있다. 도 1에 따른 수하물 검색 장치는 영상 검출부, 영상 처리부 및 저장부를 포함할 수 있으며, 필 요에 따라 데이터 획득부는 구성에서 생략될 수 있다. 도 5는 본 발명의 실시예에 따라 학습 모델을 이용하여 수하물 영상으로부터 수하물 검색 결과를 출력하는 특징을 설명하는 도면이다. 도 5에 도시한 바와 같이, 수하물 검색 장치의 수하물 검색 방법은, 수하물 검색 시스템을 통과하는 객체에 대한 수하물 영상을 검출하는 단계와, 수하물 검색 시스템 내의 학습 모델을 이용하여 수하물 영상으로부터 수하물 검색 결과를 출력하는 단계를 포함할 수 있다. 여기서, 학습 모델은 수하물 영상의 원본 데이터로부터 수하물 검색 결과를 영상으로 출력하도록 학습된 학 습 모델일 수 있으며, 원본 데이터는 방사선 투과 정보가 포함된 원본 이미지 파일을 포함할 수 있다. 이때, 학습 모델로 입력되는 수하물 영상은 전처리된 영상을 포함할 수 있다. 여기서, 전처리는, 예를 들어 촬영된 수하물 영상의 특정 검출 영역을 크롭(crop)하고, 크롭된 이미지에 히스토그램 평활화 기법을 적용한 처 리 과정을 포함할 수 있으며, 이러한 전처리 과정을 통해 보다 더 양호한 수하물 검색 결과를 얻을 수 있다. 도 6은 도 1의 수하물 검색을 위한 학습 장치의 세부 구성 및 개념을 예시적으로 설명하기 위한 도면이다. 도 6에 도시한 바와 같이, 영상 검출부는 제1 수직 성분 영상 검출부(Detector V-1), 제2 수직 성분 영상 검출부(Detector V-2), 제1 수평 성분 영상 검출부(Detector H-1) 및 제2 수평 성분 영상 검출부(Detector H- 2)를 포함할 수 있다. 제1 데이터 획득부는 영상 검출부의 제1 수직 성분 영상 검출부(Detector V-1)에서 검출되는 기 설정 된 개수의 수하물 영상, 예를 들어 9개의 수직 성분 영상을 수직 성분 디지털 신호로 변환 및 획득하는 제1 수 직 성분 데이터 획득부(DAQ V-1)를 포함할 수 있다. 또한, 제1 데이터 획득부는 영상 검출부의 제2 수직 성분 영상 검출부(Detector V-2)에서 검출되는 기 설정된 개수의 수하물 영상, 예를 들어 9개의 수직 성분 영상을 수직 성분 디지털 신호로 변환 및 획득하는 제2 수직 성분 데이터 획득부(DAQ V-2)를 포함할 수 있다. 또한, 제1 데이터 획득부는 영상 검출부의 제1 수평 성분 영상 검출부(Detector H-1) 에서 검출되는 기 설정된 개수의 수하물 영상, 예를 들어 9개의 수평 성분 영상을 수평 성분 디지털 신호로 변환 및 획득하는 제1 수평 성분 데이터 획득부(DAQ H-1)를 포함할 수 있다. 또한, 제1 데이터 획득부는 영상 검출부의 제2 수평 성분 영상 검출부(Detector H-2)에서 검출되는 기 설정된 개수의 수하물 영상, 예를 들어 9개의 수평 성분 영상을 수평 성분 디지털 신호로 변환 및 획득하는 제2 수평 성분 데이터 획득부(DAQ H-2)를 포함할 수 있다. 데이터 분기부는 이러한 제1 데이터 획득부에서 획득된 수직 및 수평 성분의 디지털 신호를 분기시킬 수 있다. 이러한 데이터 분기부는, 예를 들어 스플리터(splitter)를 포함할 수 있다. 제2 데이터 획득부는 데이터 분기부에서 분기된 디지털 신호로부터 제1 수직 성분 데이터 획득부(DAQ V-1)의 수직 성분 디지털 신호와 제2 수직 성분 데이터 획득부(DAQ V-1)의 수직 성분 디지털 신호를 취합하는 수직 성분 데이터 취합부(DAQ V)를 포함할 수 있다. 또한, 제2 데이터 획득부는 데이터 분기부에서 분기된 디지털 신호로부터 제1 수평 성분 데이터 획득 부(DAQ H-1)의 수평 성분 디지털 신호와 제2 수평 성분 데이터 획득부(DAQ H-1)의 수평 성분 디지털 신호를 취 합하는 수평 성분 데이터 취합부(DAQ H)를 포함할 수 있다. 이때, 제2 데이터 획득부는 데이터 분기부부터 신호의 감쇠나 변형 없이 원형 그대로의 데이터를 획 득 하기 위하여, 고성능의 FPGA(field programmable gate array), 예를 들어 SPARTAN -6가 적용될 수 있다. 이러한 수직 성분 데이터 취합부(DAQ V)의 수직 성분 디지털 신호와 수평 성분 데이터 취합부(DAQ H)의 수형 성 분 디지털 신호는 제2 데이터 획득부에서 원본 데이터로 취합되어 이더넷 인터페이스를 통해 영상 처리부 로 제공될 수 있다. 영상 처리부로 원본 데이터를 제공시에는, 이미 제2 데이터 획득부에서 획득한 패킷들을 헤더부터 데 이터 일련번호, 바이트 라인번호, 옵션 바이트 등으로 분리하여 영상으로 재구성될 수 있도록 정리한 상태로 전송하게 되며, 이더넷 인터페이스를 통해 영상 송수신과 관련한 프로토콜이 존재할 수 있으며, 이에 따라 펌웨어 및 운용 소프트웨어를 구현하여 송수신이 가능하다. 도 7은 제2 데이터 획득부를 통해 획득된 데이터의 헤더 패킷 구조를 예시적으로 설명하기 위한 도면이다. 도 7에 도시한 바와 같이, 원본 데이터는 4바이트의 헤더를 포함하고, 헤더는 채널 번호 바이트, 각 채널의 데 이터 일련 번호 바이트, 라인 번호 바이트 및 옵션 바이트를 포함할 수 있다. 또한, 영상 처리부는 이렇게 정리가 완료된 형태의 원본 데이터들을 지정된 루트의 폴더(날짜별)에 원본 데 이터 파일 4개(상방향 고에너지 & 저에너지, 하방향 고에너지 & 저에너지)와 이 원본 데이터 파일들을 직관적으 로 이해할 수 있는 동일한 개수의 이미지 파일로 저장하여 원본 데이터 파일의 적절성 여부도 동시에 판단할 수 있도록 한다. 영상 처리부에 원본 이미지 파일을 획득하기 위해서는 수화물 검색 장치의 운영상태를 파악하 여 빔의 발생 여부와 신호 획득 여부, 이미지 보정, 물체 검출 기능(화면 내에 물체만 인식하고 배경은 제거하 는 기능) 등을 온/오프할 수 있는 운영 소프트웨어가 함께 설치될 수 있다. 도 8은 이러한 운영 소프트웨어의 물체 검출 기능을 예시적으로 나타낸 도면이다. 도 8의 (a)는 물체 검출 기능 을 오프한 경우이고, 도 8의 (b)는 물체 검출 기능을 온시킨 경우로서, 물체 검출 기능이 온된 경우에는 인식된 물체만 잘라서 디스플레이 해 줄 수 있다. 이상 설명한 바와 같은 본 발명의 실시예에 의하면, 원본 데이터 기반의 고화질 영상을 획득 함으로써 수하물 검색 정확도를 높이고 검색 오류를 최소화할 수 있는 양질의 수하물 검색 결과를 제공할 수 있다. 또한, 원본 데이터의 획득을 통해서 인공지능 학습을 위한 방사선 투과 정보를 함유하고 있는 고 해상도 원본 이미지 파일 을 확보할 수 있는 바, 보다 진보된 인공지능 판독 프로그램의 개발이 가능하다. 본 발명의 실시예에서와 같이 원본 데이터 파일을 획득함으로써 기존에 캡쳐 보드 혹은 이미지 그래버(grabber) 형태로 획득되었던 이미지 형 태의 인공지능 학습 데이터들(이미지 도메인)을 원본 데이터의 영역(원본 데이터 도메인)으로 변환하는 정보를 갖는 인자들을 추출하여 기존 이미지 형태의 수많은 데이터들을 방사선 투과 정보가 함유된 의미 있는 원본 데 이터로 재 생성 할 수 있게 구현하였다. 한편, 첨부된 블록도의 각 블록과 흐름도의 각 단계의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수도 있다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기타 프로그램 가능한 데이 터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 의 프로세서를 통해 수행되는 그 인스트럭션들이 블록도의 각 블록에서 설명된 기능들을 수행하는 수단을 생성 하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 기록매체(또는 메모리) 등에 저장되는 것도 가능하므로, 그 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 기록매체(또는 메모리)에 저장된 인스 트럭션들은 블록도의 각 블록에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 그리고, 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되 는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수 행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수 행하는 인스트럭션들은 블록도의 각 블록에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 적어도 하나 이상의 실행 가능한 인스트럭션들을 포 함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실시예들에서는 블록들에서 언급 된 기능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순 으로 수행되는 것도 가능하다."}
{"patent_id": "10-2022-0152781", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 수하물 검색 장치 또는 수하물 검색을 위한 학습 장치에 대한 블록도이다. 도 2는 도 1의 데이터 획득부에 대한 상세 블록도이다. 도 3은 도 1의 저장부에 대한 개념도이다. 도 4는 본 발명의 실시예에 따라 정확도가 향상된 수하물 검색 결과를 출력하도록 학습 모델을 학습시키는 특징 을 설명하는 도면이다. 도 5는 본 발명의 실시예에 따라 학습 모델을 이용하여 수하물 영상으로부터 수하물 검색 결과를 출력하는 특징 을 설명하는 도면이다. 도 6은 도 1의 수하물 검색을 위한 학습 장치의 세부 구성 및 개념을 예시적으로 설명하기 위한 도면이다. 도 7은 도 1의 데이터 획득부를 통해 획득된 데이터의 헤더 패킷 구조를 예시적으로 설명하기 위한 도면이다. 도 8은 본 발명의 실시예에 따른 수하물 검색 장치의 수하물 검색 결과로서, 물체 검출 기능을 예시적으로 설명 하기 위한 도면이다."}
