{"patent_id": "10-2023-0104866", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0023761", "출원번호": "10-2023-0104866", "발명의 명칭": "강화학습 기반 개인 맞춤형 뇌 질환 진단 장치 및 방법", "출원인": "고려대학교 산학협력단", "발명자": "감태의"}}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "강화학습 기반의 개인 맞춤형 뇌 질환 진단 장치에 관한 것으로,개별 환자의 Rs-fMRI 데이터를 전처리하는 전처리부;전처리된 상기 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통해 뇌 기능 네트워크를 생성하는 네트워크생성부;상기 뇌 기능 네트워크 및 상기 뇌 기능 네트워크를 생성하는 과정에서 생성된 에피소드를 기초로, 최적의 뇌기능 네트워크를 식별하도록 에이전트를 강화학습 시키는 학습부;학습된 상기 에이전트를 통해 식별된 상기 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있는 중요특성을 추출하는 특성 추출부; 및상기 중요 특성을 활용하여 뇌 질환 여부를 진단하는 진단부; 를 포함하는뇌 질환 진단 장치."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 네트워크 생성부는,전체 영역간 상관관계 정보를 포함하는 전체 뇌 기능 네트워크를 생성하는 전체 뇌 네트워크 생성 모듈; 및상기 전체 영역에 포함된 복수의 일부 영역을 제외한 나머지 영역간 상관관계 정보를 포함한 부분 뇌 기능 네트워크를 생성하는 부분 뇌 네트워크 생성 모듈; 을 포함하는뇌 질환 진단 장치."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 부분 뇌 네트워크 생성 모듈은,제외할 상기 복수의 일부 영역을 액터 네트워크-크리틱 네트워크로 구조를 기반으로 구성된 소프트-액터-크리틱알고리즘 기반 강화학습을 통해 선택하는 것을 특징으로 하는뇌 질환 진단 장치."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 부분 뇌 네트워크 생성 모듈은,제외할 상기 복수의 일부 영역을 상기 크리틱 네트워크를 기반으로 현재 상태의 가치를 예측함으로써 선택하는것을 특징으로 하는뇌 질환 진단 장치."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 학습부는,공개특허 10-2025-0023761-3-액터 네트워크-크리틱 네트워크로 구조를 기반으로 구성된 소프트-액터-크리틱 알고리즘 기반 강화학습을 활용하는 것을 특징으로 하는 뇌 질환 진단 장치."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 크리틱 네트워크는,(여기서 JQ(θi)는 강화학습에서 사용되는 손실 함수, E는 예상 값, D는 확률분포, Qθi는 예상 누적 보상을 추정하는 함수, y^는 모델이 예측하려는 값, logπφ는 정책의 엔트로피)의 소프트 벨만 잔차를 최소화 하고,상기 액터 네트워크는,(여기서 Jπ(φi)는 정책에 대한 기대 보상)의 최적의 정책 및 상기 액터 네트워크의 정책 분포 사이의 KL 발산을 최소화하여 최적의 정책을 학습할 수 있도록 하는 것을 특징으로 하는뇌 질환 진단 장치."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "강화학습 기반의 개인 맞춤형 뇌 질환 진단 방법에 관한 것으로,개별 환자의 Rs-fMRI 데이터를 전처리하는 전처리 단계;전처리된 상기 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통해 뇌 기능 네트워크를 생성하는 네트워크생성 단계;상기 뇌 기능 네트워크 및 상기 뇌 기능 네트워크를 생성하는 과정에서 생성된 에피소드를 기초로, 최적의 뇌기능 네트워크를 식별하도록 에이전트를 강화학습 시키는 학습 단계;학습된 상기 에이전트를 통해 식별된 상기 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있는 중요특성을 추출하는 특성 추출 단계; 및상기 중요 특성을 활용하여 뇌 질환 여부를 진단하는 진단 단계; 를 포함하는뇌 질환 진단 방법."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 네트워크 생성 단계는,전체 영역간 상관관계 정보를 포함하는 전체 뇌 기능 네트워크를 생성하는 전체 뇌 네트워크 생성 단계; 및상기 전체 영역에 포함된 복수의 일부 영역을 제외한 나머지 영역간 상관관계 정보를 포함한 부분 뇌 기능 네트워크를 생성하는 부분 뇌 네트워크 생성 단계; 를 포함하는뇌 질환 진단 방법."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 부분 뇌 네트워크 생성 단계는,공개특허 10-2025-0023761-4-제외할 상기 복수의 일부 영역을 액터 네트워크-크리틱 네트워크로 구조를 기반으로 구성된 소프트-액터-크리틱알고리즘 기반 강화학습을 통해 선택하는 것을 특징으로 하는뇌 질환 진단 방법."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 부분 뇌 네트워크 생성 단계는,제외할 상기 복수의 일부 영역을 상기 크리틱 네트워크를 기반으로 현재 상태의 가치를 예측함으로써 선택하는것을 특징으로 하는뇌 질환 진단 방법."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 학습 단계는,액터 네트워크-크리틱 네트워크로 구조를 기반으로 구성된 소프트-액터-크리틱 알고리즘 기반 강화학습을 활용하는 것을 특징으로 하는 뇌 질환 진단 방법."}
{"patent_id": "10-2023-0104866", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 크리틱 네트워크는,(여기서 JQ(θi)는 강화학습에서 사용되는 손실 함수, E는 예상 값, D는 확률분포, Qθi는 예상 누적 보상을 추정하는 함수, y^는 모델이 예측하려는 값, logπφ는 정책의 엔트로피)의 소프트 벨만 잔차를 최소화 하고,상기 액터 네트워크는,(여기서 Jπ(φi)는 정책에 대한 기대 보상)의 최적의 정책 및 상기 액터 네트워크의 정책 분포 사이의 KL 발산을 최소화하여 최적의 정책을 학습할 수 있도록 하는 것을 특징으로 하는뇌 질환 진단 방법."}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 강화학습 기반의 개인 맞춤형 뇌 질환 진단 장치에 관한 것으로, 뇌 질환 진단 장치는 개별 환자의 Rs-fMRI 데이터를 전처리하는 전처리부, 전처리된 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통하여 뇌 기능 네트워크를 생성하는 네트워크 생성부, 생성된 뇌 기능 네트워크를 기초로 에이전트를 강화학습 시키는 학 습부, 학습된 에이전트를 통해 뇌 질환 진단에 의미가 있는 중요 특성을 추출하는 특성 추출부 및 중요 특성을 활용하여 뇌 질환 여부를 진단하는 진단부를 포함할 수 있다."}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "뇌 질환 진단 장치 및 방법에 관한 것으로, 강화학습에 기반하여 뇌 네트워크 생성을 통한 개인 맞춤형 진단을 제공할 수 있는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "우울증, 조울증 및 치매 등의 뇌 질환은, 적절한 치료와 관리 기회를 받을 수 있고 합병증을 예방할 수 있도록 조기에 발견하는 것이 매우 중요하다. 다만, 이러한 뇌 질환은 증상의 점진적인 진행, 비특이적 증상, 인지능력 의 변동성 등의 이유로 조기에 발견하는 것이 매우 어렵다. 이에 따라, 많은 연구에서 인공지능을 이용한 뇌 질환 진단 방법이 고려되고 있다. 연구들에 의하면, 뇌의 일 영역은 다른 영역과 기능적으로 연관되는 경향이 있기 때문에, 이러한 뇌의 기능적 연결 네트워크를 인공지능을이용하여 파악함으로써 복잡한 특성의 뇌 질환을 보다 적극적이고 정확하게 진단할 수 있다. 또한, 몇몇 연구에 서는 뇌의 관심 영역간 연결의 하위 집합만을 포함하는 희소한 기능적 연결 네트워크가 질병의 기본 메커니즘에 대한 더 정확한 정보를 제공할 수 있기 때문에, 모든 영역을 포함하여 완전 연결된 기능적 연결 네트워크 보다 더 적합하다고 제안하고 있다. 그러나, 환자별로 기능적 연결 네트워크를 생성하는 것은, 기능적 연결 네트워크의 큰 변동성 때문에 어려울 수 있다. 이러한 기능적 연결 네트워크의 환자별 가변성은 연결성과 기능면에서 상당한 개인차를 초래하여 각 환자 에 적합한 뇌의 연결 네트워크 구조를 설계하는 것을 어렵게 만들고, 결국 환자의 개인차를 고려한 뇌 질환 진 단을 어렵게 만드는 문제로 작용하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1995383호(\"의료 영상에 대한 특징 순위에 기반하여 뇌질환을 판 정하는 방법 및 이를 이용한 장치\", 주식회사 뷰노, 2019.07.02)"}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 강화학습을 이용하여 환자마다 다르게 가지고 있는 기능적 연결 네트워크의 변동성을 고려한 뇌 네트 워크 생성을 가능케 하고, 이를 통해 환자의 고유한 특성이 고려된 뇌 질환에 대한 유용한 진단 정보를 제공하 는 것을 해결하고자 하는 과제로 한다."}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예는 강화학습 기반의 개인 맞춤형 뇌 질환 진단 장치에 관한 것으로, 뇌 질환 진단 장치는 개별 환자의 Rs-fMRI 데이터를 전처리하는 전처리부, 전처리된 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습 을 통해 뇌 기능 네트워크를 생성하는 네트워크 생성부, 뇌 기능 네트워크 및 뇌 기능 네트워크를 생성하는 과 정에서 생성된 에피소드를 기초로, 최적의 뇌 기능 네트워크를 식별하도록 에이전트를 강화학습 시키는 학습부, 학습된 에이전트를 통해 식별된 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있는 중요 특성을 추 출하는 특성 추출부 및 중요 특성을 활용하여 뇌 질환 여부를 진단하는 진단부를 포함할 수 있다. 또한, 일 실시예에 따라서, 네트워크 생성부는 전체 영역간 상관관계 정보를 포함하는 전체 뇌 기능 네트워크를 생성하는 전체 뇌 네트워크 생성 모듈 및 전체 영역에 포함된 복수의 일부 영역을 제외한 나머지 영역간 상관관 계 정보를 포함한 부분 뇌 기능 네트워크를 생성하는 부분 뇌 네트워크 생성 모듈을 포함할 수 있다. 또한, 일 실시예에 따라서, 부분 뇌 네트워크 생성 모듈은, 제외할 상기 복수의 일부 영역을 액터 네트워크-크 리틱 네트워크로 구조를 기반으로 구성된 소프트-액터-크리틱 알고리즘 기반 강화학습을 통해 선택하는 것을 특 징으로 할 수 있다. 또한, 일 실시예에 따라서, 부분 뇌 네트워크 생성 모듈은, 제외할 복수의 일부 영역을 크리틱 네트워크를 기반 으로 현재 상태의 가치를 예측함으로써 선택하는 것을 특징으로 할 수 있다. 또한, 일 실시예에 따라서, 액터 네트워크-크리틱 네트워크 구조를 기반으로 구성된 소프트-액터-크리틱 알고리 즘 기반 강화학습을 활용하는 것을 특징으로 할 수 있다. 또한, 일 실시예에 따라서, 크리틱 네트워크는 (여기서 JQ(θi)는 강화학습에서 사용되는 손실 함수, E는 예상 값, D는 확률분포, Qθi는 예상 누적 보상을 추정하는 함 수, y^는 모델이 예측하려는 값, logπφ는 정책의 엔트로피)의 소프트 벨만 잔차를 최소화 하고, 액터 네트워크 는 (여기서 Jπ(φi)는 정책에 대한 기대 보상)의 최적의정책 및 액터 네트워크의 정책 분포 사이의 KL 발산을 최소화하여 최적의 정책을 학습할 수 있도록 하는 것을 특징으로 할 수 있다. 본 발명의 또 다른 실시예는 강화학습 기반의 개인 맞춤형 뇌 질환 진단 방법에 관한 것으로, 뇌 질환 진단 방 법은 개별 환자의 Rs-fMRI 데이터를 전처리하는 전처리 단계, 전처리된 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통해 뇌 기능 네트워크를 생성하는 네트워크 생성 단계, 뇌 기능 네트워크 및 뇌 기능 네트워크를 생성하는 과정에서 생성된 에피소드를 기초로, 최적의 뇌 기능 네트워크를 식별하도록 에이전트를 강화학습 시 키는 학습 단계, 학습된 에이전트를 통해 식별된 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있 는 중요 특성을 추출하는 특성 추출 단계 및 중요 특성을 활용하여 뇌 질환 여부를 진단하는 진단 단계를 포함 할 수 있다. 또한, 일 실시예에 따라서, 네트워크 생성 단계는, 전체 영역간 상관관계 정보를 포함하는 전체 뇌 기능 네트워 크를 생성하는 전체 뇌 네트워크 생성 단계 및 전체 영역에 포함된 복수의 일부 영역을 제외한 나머지 영역간 상관관계 정보를 포함한 부분 뇌 기능 네트워크를 생성하는 부분 뇌 네트워크 생성 단계를 포함할 수 있다. 또한, 일 실시예에 따라서, 부분 뇌 네트워크 생성 단계는, 제외할 복수의 일부 영역을 액터 네트워크-크리틱 네트워크로 구조를 기반으로 구성된 소프트-액터-크리틱 알고리즘 기반 강화학습을 통해 선택하는 것을 특징으 로 할 수 있다. 또한, 일 실시예에 따라서, 부분 뇌 네트워크 생성 단계는, 제외할 복수의 일부 영역을 크리틱 네트워크를 기반 으로, 현재 상태의 가치를 예측함으로써 선택하는 것을 특징으로 할 수 있다. 또한, 일 실시예에 따라서, 학습 단계는, 액터 네트워크-크리틱 네트워크 구조를 기반으로 구성된 소프트-액터- 크리틱 알고리즘 기반 강화학습을 활용하는 것을 특징으로 할 수 있다. 또한, 일 실시예에 따라서, 크리틱 네트워크는 (여기서 JQ(θi)는 강화학습에서 사용되는 손실 함수, E는 예상 값, D는 확률분포, Qθi는 예상 누적 보상을 추정하는 함 수, y^는 모델이 예측하려는 값, logπφ는 정책의 엔트로피)의 소프트 벨만 잔차를 최소화 하고, 액터 네트워크 는 (여기서 Jπ(φi)는 정책에 대한 기대 보상)의 최적의 정책 및 액터 네트워크의 정책 분포 사이의 KL 발산을 최소화하여 최적의 정책을 학습할 수 있도록 하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 의한 강화학습 기반 개인 맞춤형 뇌 질환 진단 장치 및 방법에 따르면, 환자별 뇌의 기 능적 연결 네트워크 변동성을 고려할 수 있다. 또한, 이에 따라 개별환자 뇌 영역간 희소한 기능적 연결 네트워크 발견을 통해 뇌 질환의 조기진단을 보다 정 확하고 효율적으로 수행할 수 있으며, 질환의 진행을 늦추거나 지연시키는 조기 개입 및 치료를 가능케하여 환 자의 상태를 개선할 수 있다."}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 후술되어 있는 실시예들을 참 조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다 양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구 항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용되는 용어에 대해 간략히 설명하고, 본 발명에 대해 구체적으로 설명하기로 한다. 본 발명에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있 다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에서 사용되는 \"부\", \"모듈\", \"유닛\" 등의 용어는 적어도 하나의 기능 또는 동작을 처리하는 단위를 의미하며, 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소, 또는 소프트웨어와 하드웨어의 결합으로 구현될 수 있다. 그렇지만 \"부\", \"모듈\", \"유닛\" 등의 용어가 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\", \"모듈\", \"유닛\" 등은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생 시키도록 구성될 수도 있다. 따라서, 일 예로서 \"\"부\", \"모듈\", \"유닛\" 등의 용어는 소프트웨어 구성요소들, 객 체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함 수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로 코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 아래에서는 첨부한 도면을 참고하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략한다. “제1\", \"제2\" 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설 명하는데 사용될 수 있지만, 구성 요소들은 용어들에 의해 한정되지는 않는다. 용어들은 하나의 구성요소를 다 른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. \"및/또 는\" 이라는 용어는 복수의 관련된 항목들의 조합 또는 복수의 관련된 항목들 중의 어느 하나의 항목을 포함한다. 본 명세서에 설명된 다양한 시스템, 장치, 저장 매체, 모듈 및 기구는 전용 연산 디바이스, 또는 하나 이상의 전용 연산 디바이스의 하나 이상의 연산 칩에서 구현될 수도 있다. 이하 도면을 참조하여 본 발명의 강화학습 기반 개인 맞춤형 뇌 질환 진단 장치 및 방법에 관하여 설명하도록 한다. 본 발명의 강화학습 기반 개인 맞춤형 뇌 질환 진단 장치 및 방법은 강화학습을 이용하여 환자별로 뇌 기능 네 트워크(기능적 연결성 네트워크)를 생성함으로써, 환자 개개인의 특성이 고려되도록 하여, 보다 정확하고 효율 적으로 뇌 관련 장애 및 질병을 조기 진단할 수 있다. 또한, 이를 통해 장애 및 질병의 진행을 늦추거나 지연시 켜 조기 개입 및 치료를 가능하게 하여 환자의 상태를 개선할 수 있다. 본 발명에서 활용하는 강화학습은 일반적인 강화학습 방법을 포함하는 것으로, 인공지능 모델이 주어진 환경과 상호작용하며 시행착오를 통해 보상을 최대화하는 방법을 학습하는 기계학습 방법을 포함할 수 있다. 본 발명의 강화학습 방법은 에이전트(agent)를 포함할 수 있으며, 에이전트는 상태(state)를 관찰하고, 행동(action)을 선 택하여 환경과 상호작용하며 보상(reward)을 얻을 수 있다. 또한, 이러한 보상을 통해 에이전트는 최적의 행동 을 결정하는 정책(policy)을 학습할 수 있다. 구체적으로, 본 발명에서 활용하는 강화학습은 마르코프 결정 과정(Markov decision process, MDP)을 기반으로 하는 것일 수 있다. 마르코프 결정 과정은 순차적인 의사 결정 문제를 형식화하는 수학적 모델로, 시간 단계별로 변화하는 상태와 에이전트가 취할 수 있는 행동을 고려할 수 있고, 각 상태에서 에이전트가 어떤 행동을 취 하면 다음 상태로 전이되며 보상이 주어지는 형태를 취할 수 있다. 마르코프 결정 과정은 상태가 마르코프 속성 을 만족하는 환경에서 적용되는 것으로, 즉 특정 상태에 대한 미래 예측은 오직 현재 상태에만 의존하고 이전 이력은 고려하지 않는 것일 수 있다. 또한, 본 발명은 마르코프 결정 과정의 개념을 이용함으로써 결과가 부분 적으로는 무작위이고, 부분적으로는 의사 결정자의 통제 하에 있는 의사 결정 문제를 모델링 할 수 있다. 마르 코프 결정 과정에 관한 자세한 설명은 본 명세서에서는 생략하도록 한다. 또한, 본 발명에서 활용되는 강화학습은 소프트-액터-크리틱(Soft Actor-Critic, SAC) 알고리즘 기반의 강화학 습 방법을 활용할 수 있다. 이에 관하여는 후술하도록 한다. 본 발명의 일 실시예에 의한 뇌 질환 진단 장치 및 방법은 개별 환자의 Rs-fMRI 데이터를 입력 받고, 이를 전처 리할 수 있다. 또한, 뇌 질환 진단 장치 및 방법은 전처리된 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통하여 뇌 기능 네트워크를 생성할 수 있다. 또한, 뇌 질환 진단 장치 및 방법은 생성된 뇌 기능 네트워크 및 뇌 기능 네트워크를 생성하는 과정에서 생성된 에피소드를 기초로 에이전트를 강화학습 시킬 수 있다. 또한, 뇌 질환 진단 장치 및 방법은 학습된 에이전트를 통해 식별된 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있는 중요 특성을 추출할 수 있다. 또한, 뇌 질환 진단 장치 및 방법은 추출한 중요 특성을 활용하여 뇌 질환 여부를 진단할 수 있다. 도 1은 일 실시예에 의한 본 발명의 뇌 질환 진단 장치의 블록도이다. 도 1의 실시예에 의하면, 뇌 질환 진단 장치는 입력부, 저장부, 출력부 및 프로세서를 포함 할 수 있다. 입력부는 본 발명의 뇌 질환 진단 장치의 동작에 필요한 명령, 데이터 및 프로그램 중 적어도 하나를 입 력 받고, 이를 프로세서 및/혹은 저장부로 전달할 수 있다. 예를 들어, 입력부는 Rs-fMRI 데이터를 입력 받을 수 있다. Rs-fMRI(Resting state-functional Magnetic Resonance Imaging)는 휴식 상태 기능적 자기 공명 영상으로, 피 험자가 아무런 특정 작업을 수행하지 않는 휴식 상태에 있을 때의 뇌 활동을 측정하는 방법으로, 뇌의 특정 부 분에서의 혈류 변화를 감지하여 시각화하는 비침습적 의료영상 기법이다. Rs-fMRI 데이터는 Rs-fMRI 방법을 이 용하여 획득한 데이터를 의미하여, 영상 처리된 이미지 데이터를 포함할 수 있으며, 뇌의 특정 부분에 따라 신 호의 세기를 측정한 수치 데이터를 포함할 수 있다. 또한, 연속된 시간에 기초하여 촬영 및 측정된 시계열적 정 보를 포함할 수 있다. 일 실시예에 의하면, Rs-fMRI 데이터는 아틀라스(atlas)와 같은 뇌 분할 영역 지도의 템플릿으로 기분획된 영역 에 따른 신호 정보를 포함하고 있을 수 있다. 예를 들어, 일 아틀라스에 따라 뇌 분할 영역이 결정되고, 이에 따라 Rs-fMRI 데이터에 포함된 신호 정보가 해당 분할 영역에 따라 분획되어 포함되어 있을 수 있다. 여기서 분 할 영역에 따른 신호는 각 영역에 포함된 신호값의 평균을 계산하여 이를 해당 영역의 신호값으로 할 수 있다. 이는 Rs-fMRI 데이터가 포함하는 신호 정보의 일 실시예일 뿐이며, 이에 한정되는 것은 아니다. 저장부는 명령, 데이터 또는 프로그램 등을 일시적 또는 비일시적으로 저장할 수 있다. 이러한 명령, 데이 터 또는 프로그램 등은 입력부를 통해 입력된 것일 수도 있다. 예를 들어, Rs-fMRI 데이터에 관한 데이터를 포함할 수 있다. 또한, 저장부에 저장되는 데이터는 프로세서의 처리 과정에서 생성된 것, 일례로 뇌 기능 네트워크나 중요 특성에 관한 데이터 등을 포함할 수도 있다. 저장부는 프로세서의 호출에 따라 저장된 데이터 등을 프로세서에 제공하는 것도 가능하다. 저장부는, 주기억장치 및 보조기억장치 중 적 어도 하나를 포함할 수 있으며, 이들은 반도체나 자기디스크 등을 이용해 구현될 수 있다. 또한, 저장부는 강화학습 기능과 관련된 모듈 및 정보 등을 저장할 수 있다. 일례로, 강화학습에 필요한 학 습 데이터 및 이로 인하여 학습되는 에이전트 등에 관한 정보를 저장할 수 있다. 출력부는 외부로 데이터나 프로그램 등을 출력할 수 있게 마련된다. 예를 들어, 출력부는 후술할 뇌 기 능 네트워크나, 피험자에 대한 뇌 질환 진단 결과 등을 출력하여 사용자에게 제공하거나 다른 정보처리장치로 전송할 수도 있다. 출력부는, 예를 들어, 디스플레이, 프린터 장치, 스피커 장치, 영상 출력 단자, 데이터 입출력 단자 또는 통신 모듈 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 출력부는 후술할 중요 특 성 및 진단 결과 등을 시각화 및 청각화하여 출력함으로써 사용자가 진단에 대한 인사이트를 얻도록 할 수 있다.프로세서는 입력부 및/혹은 저장부에서 데이터 등을 전달받을 수 있고, 전달받은 데이터를 전처리 할 수 있다. 또한, 프로세서는 개별환자의 Rs-fMRI 데이터를 기초로 강화학습을 활용하여 뇌 기능 네트워크 를 생성할 수 있다. 또한, 프로세서는 생성된 뇌 기능 네트워크 및 에피소드를 기초로 에이전트를 학습시킬 수 있고, 학습된 에이전트를 통해 식별된 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있는 중요 특성을 추출할 수 있다. 또한, 프로세서는 이를 활용하여 환자의 뇌 질환 여부를 진단할 수 있다. 프로세서 는 전술한 바와 같이 뇌 질환을 진단하는 일련의 과정에 따른 동작을 수행할 수 있다. 프로세서는 실시 예에 따라 전술한 과정을 모두 수행할 수 있으며, 이 중 일부만을 수행할 수도 있다. 이들 동작의 수행을 위해 저장부 등에 미리 저장된 데이터 및 프로그램 등이 이용될 수 있다. 여기서 프로그램은 설계자 등에 의해 직접 작성된 것일 수 있고, 전자소프트웨어 유통망을 통해 획득 또는 갱신된 것을 수 있다. 일 실시예에 의하면, 프로세서는, 중앙 처리 장치(CPU: Central Processing Unit), 그래픽 처리 장치(GPU: Graphic Processing Unit), 마이크로 컨트롤러 유닛(MCU: Micro Controller Unit), 애플리케이션 프로세서(AP: Application Processor), 전자 제어 유닛(ECU: Electronic Controlling Unit), 마이컴(Micom: Micro Processor) 또는 이외 각종 연산 및 제어 처리를 수행할 수 있는 적어도 하나의 전자 장치 등을 하나 이상 포함 할 수 있다. 이들 처리 또는 제어 장치는, 예를 들어, 하나 또는 둘 이상의 반도체 칩, 회로 또는 관련 부품 등 을 단독으로 이용하거나 조합하여 구현된 것일 수도 있다. 일 실시예에 의하면, 프로세서는 전처리부, 네트워크 생성부, 학습부, 특성 추출부 및 진단부를 포함할 수 있다. 전처리부는 입력부 및/혹은 저장부로부터 전달 받은 Rs-fMRI 데이터를 전처리할 수 있다. Rs-fMRI 데이터는 측정에 따라 차이가 심하기 때문에 데이터 분석 전, 전처리부는 표준화된 의료 영상 전처리 기법 을 적용하여 Rs-fMRI 데이터를 표준화된 영상으로 전처리할 수 있다. 전처리부는 전처리 과정을 통해 Rs- fMRI 데이터를 분석하기에 더 적합한 형태로 만들 수 있고, 분석을 보다 정확하고 신뢰성 높게 수행할 수 있도 록 할 수 있다. 전처리부에서 수행될 수 있는 전처리 기법은 타이밍 교정(timing correction), 머리 움직임 교정(head motion correction), 공간 정규화(spatially normalization), 스무딩(smoothing) 및 밴드 패스 필터(band pass filter) 등이 포함될 수 있다. 각 과정에 관한 자세한 설명은 생략하도록 한다. 전처리부에서 수행될 수 있는 전처리 기법은 예시한 것에 한정되지 않으며, 이외에도 다양한 방법이 포함될 수 있다. 도 2 내지 도 5를 참조하여 네트워크 생성부에 관하여 설명하도록 한다. 네트워크 생성부는 전처리부로부터 전처리된 개별 환자의 Rs-fMRI 데이터를 전달 받을 수 있다. 네트워크 생성부는 전처리된 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통하여 뇌 기능 네트워크를 생성할 수 있다. 여기서 뇌 기능 네트워크는 Rs-fMRI 데이터로부터 산출된 것으로, Rs-fMRI 데이터에 나타난 뇌 의 각 영역별 신호를 기초로 뇌의 영역간 상관관계를 행렬의 형태로 변환한 것일 수 있다. 전술한 바와 같이 Rs-fMRI 데이터에는 뇌의 각 영역별 신호에 관한 정보(예로, 신호 발생 여부, 신호 세기, 신호의 시계열적 정보 등)가 포함되어 있으며, 이러한 정보에 따라 네트워크 생성부는 각 영역간 상관관계를 분석할 수 있으며, 분석한 상관관계 정보를 행렬과 같은 형태로 나타낼 수 있다. 또한, 네트워크 생성부는 강화학습을 활용함에 따라 복수의 에피소드를 생성할 수 있다. 각 에피소드는 복 수의 (상태 St, 행동 At, 보상 Rt, 다음 상태 St+1)의 상태 쌍을 포함하고 있을 수 있다. 일 실시예에 의하면, 네트워크 생성부는 강화학습에 있어 원하는 종점 상태를 결정할 수 있도록 시퀀스 모 델링을 활용할 수 있다. 여기서 시퀀스 모델링은 종점 예측을 위한 보조 과제 정의, 각 상태의 보상 추정 및 종 점 상태 결정 과정을 의미하는 것일 수 있으며 후술하도록 한다. 도 2는 네트워크 생성부에서 Rs-fMRI 데이터를 기초로 뇌 기능 네트워크(FCN)를 생성하는 모습을 도시한 도면이다. 도 2의 예시에 의하면, Rs-fMRI 데이터는 뇌의 각 기분할 영역에서의 각 신호값을 가지고 있으며, 이들 신호값 을 기초로 뇌의 영역간 상관관계를 분석함으로써 행렬의 형태를 갖는 뇌 기능 네트워크(FCN)를 생성할 수 있다. 도 2의 예시에 의하면, 뇌 기능 네트워크(FCN)는 각 영역을 행렬의 행과 열로 하여 영역간 상관관계 정보를 대 각항을 기준으로 대칭이 되도록 나타낼 수 있다. 네트워크 생성부는 분할 정복 접근법을 활용함으로써 뇌 기능 네트워크(FCN)를 생성하는 작업을 더 작은 하위 문제로 분해하여 수행할 수 있다. 이에 따라 네트워크 생성부는 각 하위 문제 조건에서 효율적인 탐 색을 가능하게 하여 성능을 향상시킬 수 있다. 또한, 네트워크 생성부는 분할 정복 접근법을 이용함으로써 개인의 특성이 더 고려된 뇌 기능 네트워크를 생성함으로써, 개인의 특성을 고려한 강화학습이 가능케 하도록 할 수 있다. 도 3 내지 도 5를 참조하여 전체 뇌 기능 네트워크 및 부분 뇌 기능 네트워크에 관하여 설명하도록 한다. 도 3은 일 실시예에 따른 네트워크 생성부의 블록도이다. 도 3의 일 실시예에 의하면, 네트워크 생성부는 전체 네트워크 생성 모듈 및 부분 네트워크 생성 모 듈을 포함할 수 있다. 또한, 이에 따라 각 모듈을 통해 전체 뇌 기능 네트워크 및 부분 뇌 기능 네트워크 를 생성할 수 있다. 도 4는 일 실시예에 따라 전체 뇌 기능 네트워크(FCN) 및 부분 뇌 기능 네트워크(FCN-1, FCN-2 및 FCN-3)를 생 성하는 과정을 도시한 도면이다. 전체 네트워크 생성 모듈은 전술한 뇌 기능 네트워크 생성 과정과 동일한 과정에 의하여 전체 뇌 기능 네 트워크(FCN)를 생성할 수 있다. 전체 뇌 기능 네트워크(FCN)는 Rs-fMRI에 포함된 모든 영역간 상관관계 정보를 포함할 수 있다. 부분 네트워크 생성 모듈은 전체 영역에 포함된 복수의 일부 영역을 제외한 나머지 영역간 상관관계 정보 를 포함한 부분 뇌 기능 네트워크(FCN-1, FCN-2 및 FCN-3)를 생성할 수 있다. 도 4의 일 실시예를 참조하여 설명하면, 부분 뇌 기능 네트워크(FCN-1, FCN-2 및 FCN-3)는 전체 영역 중 일부 영역의 제외한 나머지 영역간 상관관계 정보를 나타낸 뇌 기능 네트워크를 의미할 수 있다. 여기서 일부 영역은 적어도 하나 이상의 영역으로 복수개 영역일 수 있다. 일 실시예에 의하면, 부분 네트워크 생성 모듈은 강화학습을 활용하여 부분 뇌 기능 네트워크를 생성할 수 있으며, 이 과정상에서 서로 다른 복수의 부분 뇌 기능 네트워크(FCN-1, FCN-2 및 FCN-3)를 생성할 수 있다. 즉, 부분 네트워크 생성 모듈은 서로 다른 복수의 영역이 제외된 나머지 영역의 상관관계 정보를 나타낸 부분 뇌 기능 네트워크를 생성할 수 있다. 도 4의 예시를 참조하면, 일 영역만이 제외된 부분 뇌 기능 네트워크 (FCN-1), 2개의 영역이 제외된 부분 뇌 기능 네트워크(FCN-2), 3개의 영역이 제외된 부분 뇌 기능 네트워크 (FCN-3) 등이 생성될 수 있다. 일 실시예에 의하면, 부분 네트워크 생성 모듈은 어떤 영역을 제외할지 선택하는 과정에서 강화학습을 이 용할 수 있다. 부분 네트워크 생성 모듈은 강화학습을 통해 제외될 영역을 선택함으로써, 무작위로 제외될 영역을 선택하는 방식에 비하여 더 효율적으로 개별 환자의 특성이 고려된 부분 뇌 기능 네트워크를 생성할 수 있다. 부분 네트워크 생성 모듈은 어떤 영역을 제외할지 선택하는 과정에서 강화학습을 활용함으로써, 전술한 네 트워크 생성부와 마찬가지로 복수의 에피소드를 생성할 수 있다. 또한, 각 에피소드는 복수의 (상태 St, 행동 At, 보상 Rt, 다음 상태 St+1)의 상태 쌍을 포함하고 있을 수 있다. 일 실시예에 의하면 부분 네트워크 생성 모듈은 소프트-액터-크리틱 알고리즘 기반의 강화학습 방법을 활 용할 수 있다. 이에 따라, 부분 네트워크 생성 모듈은 어떤 영역을 제외할지 선택하는 과정에서 후술할 크 리틱 네트워크를 기반으로 하여 선택할 수 있다. 부분 네트워크 생성 모듈은 크리틱 네트워크를 기반으로 현재 상태의 가치를 예측함으로써 제외할 영역을 선택할 수 있다. 도 5는 강화학습을 이용하여 어떤 영역을 제외할지 선택하는 과정을 도시한 도면이다. 일 실시예에 의하면, 본 발명에서는 개인의 특성을 고려하여 피험자에 따라 에피소드의 종점을 결정하는데 학습 된 가치함수를 이용할 수 있다. 도 5의 예시를 참조하면, 에이전트는 관심 영역(region of interest, ROI)을 선 택하고, 선택한 관심 영역에 따라 연결을 끊거나 새로운 연결 구성을 만드는 과정을 각 에피소드의 단계에서 수 행할 수 있다. 따라서 각 에피소드에서 선택된 관심 영역은 현재 상태에서 선택된 관심 영역과 함께 다음 상태 를 결정할 수 있다. 학습부는 네트워크 생성부에서 뇌 기능 네트워크 생성 과정에서 생성된 에피소드를 기초로 에이전트를 강 화학습 시킬 수 있다. 학습부는 네트워크 생성부로부터 생성된 뇌 기능 네트워크를 전달받을 수 있으며, 이 과정에서 강화 학습을 활용함에 따라 생성된 에피소드 및 에피소드에 포함된 상태 쌍을 전달받을 수 있다. 또한, 학습부 는 저장부 등에 저장된 에이전트를 전달 받을 수 있고 이용할 수 있다. 학습부는 전달받은 뇌 기능 네트워크, 이를 생성하는 과정에서 생성된 에피소드 및 에피소드에 포함된 상 태 쌍을 기초로 최적의 뇌 기능 네트워크를 식별하도록 에이전트를 학습시킬 수 있다. 또한, 학습부는 에 이전트를 학습시킬 때, 개별 환자의 Rs-fMRI 데이터에 기초하여 생성된 뇌 기능 네트워크, 에피소드 및 상태 쌍 만을 학습시킴으로써 개별 환자의 특성이 고려되도록 할 수 있다. 에이전트는 최적의 뇌 기능 네트워크를 식별할 수 있도록 학습될 수 있다. 여기서 최적의 뇌 기능 네트워크는 강화학습 결과 최대의 보상을 갖는 것을 의미하며, 뇌 질환 진단에 가장 관련이 높은 뇌 기능 네트워크를 의미 하는 것일 수 있다. 구체적으로, 최적의 뇌 기능 네트워크는 후술할 크리틱 네트워크 기반으로 하였을 때, 생성 된 에피소드 중에서 가장 가치가 큰 뇌 기능 네트워크를 의미할 수 있다. 일 실시예에 의하면 학습부는 소프트-액터-크리틱 알고리즘 기반의 강화학습 방법을 활용할 수 있다. 소프 트-액터-크리틱 알고리즘은 강화학습 모델 중 하나로, 최대 엔트로피 강화학습을 기반으로 하여 상태마다 정책 의 엔트로피와 보상을 최대화하는 정책을 학습하도록 하는 방법이다. 소프트-액터-크리틱 알고리즘은 액터 네트 워크-크리틱 네트워크 구조를 기반으로 하여 구성될 수 있다. 액터 네트워크는 환경과 상호작용하며 행동을 결정하는 정책 함수를 학습할 수 있다. 여기서 정책 함수는 주어 진 상태에서 취할 수 있는 행동을 확률적으로 결정할 수 있다. 크리틱 네트워크는 액터 네트워크의 학습을 돕기 위해 가치 함수를 학습할 수 있다. 가치 함수는 주어진 상태에 서 액터 네트워크의 행동을 평가할 수 있다. 소프트-액터-크리틱 알고리즘은 최대 엔트로피 강화학습을 기반으로 하여 정책의 엔트로피와 보상을 최대화하는 정책을 학습할 수 있다. 이를 위해 크리틱 네트워크는 [수학식 1]과 같이 소프트 벨만 잔차를 최소화하는 것일 수 있다. 수학식 1"}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 JQ(θi)는 강화학습에서 사용되는 손실 함수, E는 예상 값, D는 확률분포, Qθi는 예상 누적 보상을 추정 하는 함수, y^는 모델이 근사하거나 예측하려는 값, logπφ는 정책의 엔트로피일 수 있다. 또한, α는 로그를 포함하는 엔트로피의 정도를 제어하는 파라미터일 수 있으며, J(α)로 학습되어 정해질 수 있다. 또한, 학습의 안정성을 위하여 [수학식 2]와 같은 지수이동평균을 적용할 수 있다. 수학식 2"}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "액터 네트워크는 [수학식 3]과 같이 최적의 정책 및 액터 네트워크의 정책 분포 사이의 KL 발산을 최소화하여 최적의 정책을 학습할 수 있다.수학식 3"}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서 Jπ(φi)는 정책에 대한 기대 보상일 수 있다. 또한, α는 종종 로그 확률 항(엔트로피)과 Q-value 항의 상대적 기여도의 균형을 맞추는 스칼라 계수일 수 있 으며, 정책 탐색의 정도를 규제하는 데 사용될 수 있다. 즉, 이는 탐색(로그 확률 용어로 표시됨)과 착취(Q-value 용어로 표시됨)의 균형을 맞추도록 정책 파이의 최적 화하려는 목적함수를 설명하는 것일 수 있다. 이에 따라 이 표현을 최대화하는 정책 매개변수 φi를 찾는 것일 수 있다. 로그 확률항의 존재는 이것이 엔트로피 정규화된 강화 학습의 한 형태일 수 있음을 시사할 수 있다. 여기서 에 이전트는 예상 보상을 최대화할 뿐만 아니라 환경을 효율적으로 탐색하기 위해 정책에서 일정 수준의 확률 또는 불확실성을 유지하도록 할 수 있다. 액터 네트워크는 정책분포의 엔트로피 정도를 계산하기 위해 [수학식 4]와 같은 엔트로피 손실 함수를 사용할 수 있다. 수학식 4"}
{"patent_id": "10-2023-0104866", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서 엔트로피 손실 함수는 엔트로피와 보상을 최대화를 하는데 현재 상태의 엔트로피가 휴리스틱하게 정의한 타겟 엔트로피 H0보다 커야한다는 제약조건을 쌍대성 문제(Duality problem)의 최적화 문제로 접근하여 정의할 수 있다. 일 실시예에 의하면, 크리틱 네트워크는 현재 예측 값과 목표 값의 차이를 최소화하여 업데이트될 수 있으며, 목표 값은 보상 신호와 할인된 한 단계 앞에서의 목표 Q값으로 구성될 수 있다(수학식 1). 이때, 타겟 네트워크 는 현재 크리틱 네트워크와 동일한 복사본으로 구성되어 불안정성 문제를 완화하기 위해 사용될 수 있다(수학식 2). 또한, 액터 네트워크는 생성하는 정책 분포를 최적화하도록 학습될 수 있으며(수학식 3), 이를 위해 크리틱 네트워크는 액터 네트워크의 지침에 따라 정책의 확률 분포를 조정할 수 있다(수학식 4). 학습부는 강화학습에 있어 전술한 네트워크 생성부의 강화학습과 마찬가지로 시퀀스 모델링을 활용할 수 있다. 도 6을 참조하여 학습부의 시퀀스 모델링 활용에 관하여 설명하도록 한다. 도 6은 시퀀스 모델링 과정을 도시한 도면이다. 학습부는 원하는 종점 상태를 결정할 수 있도록 시퀀스 모델링을 활용할 수 있다. 여기서 학습부가 원하는 종점 상태는 앞서 언급된 최적의 상태를 포함하는 것 일 수 있다. 학습부는 종점 상태 예측을 위한 보조 과제를 정의하고, 학습된 크리틱 네트워크를 이용하여 각 상태의 보 상을 추정하고, 가치 추정을 기반으로 원하는 종점 상태를 결정할 수 있다. 학습부는 학습된 에이전트를 통해 최적의 뇌 기능 네트워크를 식별할 수 있다. 학습부는 식별된 최적 의 뇌 기능 네트워크를 특성 추출부로 전달할 수 있다. 특성 추출부는 최적의 뇌 기능 네트워크를 전달받고, 이를 기초로 뇌 질환에 의미가 있는 중요 특성을 추 출할 수 있다. 특성 추출부는 GCN(Graph convolution network) 기반 분류기를 포함하여, 학습된 에이전트에 의해 식별된 최적의 뇌 기능 네트워크를 GCN 기반 분류기에 입력함으로써 중요 특성을 추출할 수 있다. 중요 특성은 전술한 바와 같이 뇌 기능 네트워크를 기초로 추출된 복수의 영역일 수 있으며, 복수의 영역간 상 호관계에 기초하여 추출된 특성일 수 있다. 진단부는 중요 특성을 활용하여 뇌 질환 여부를 진단할 수 있다. 진단부는 특성 추출부에서 추출한 중요 특성을 전달받을 수 있고, 입력부 및/혹은 저장부에 서 레이블이 지정된 예제에 대해 교육을 받은 GCN 기반 분류기 및 이를 통한 뇌 질환 여부 정보 등을 전달받을 수 있다. 진단부는 전달받은 중요 특성, GCN 기반 분류기 및 중요 특성에 따른 뇌 질환 여부 정보 등을 기초로 피험 자의 뇌 질환 여부를 진단할 수 있다. 일 실시예에 의하면 중요 특성과 기 저장된 특성에 따른 뇌 질환 여부 비 교를 통해 진단이 수행될 수 있다. 또 다른 실시예에 의하면, 진단부는 중요 특성에 관한 정보를 출력부로 전달하고, 출력부는 이를 시각화하여 제공함으로써 의사와 같은 전문가가 이를 기초로 진단할 수 있도록 할 수도 있다. 전술한 예시들은 진단 방법의 실시예에 불과하며, 이에 한정되지 않고 다양한 진단 방법이 활용될 수 있다. 도 7을 참조하여 본 발명의 일 실시예에 의한 강화학습 기반 개인 맞춤형 뇌 질환 진단 방법에 관하여 설명하도 록 한다. 도 7은 뇌 질환 진단 방법의 순서도이다. 본 발명의 또 다른 실시예는 강화학습 기반의 개인 맞춤형 뇌 질환 진단 방법에 관한 것으로, 뇌 질환 진단 방 법은 개별 환자의 Rs-fMRI 데이터를 전처리하는 전처리 단계(S710)를 포함할 수 있다. 또한, 뇌 질환 진단 방법 은 전처리된 상기 개별 환자의 Rs-fMRI 데이터를 기초로 강화학습을 통해 뇌 기능 네트워크를 생성하는 네트워 크 생성 단계(S720)를 포함할 수 있다. 또한, 뇌 질환 진단 방법은 뇌 기능 네트워크 및 뇌 기능 네트워크를 생 성하는 과정에서 생성된 에피소드를 기초로, 최적의 뇌 기능 네트워크를 식별하도록 에이전트를 강화학습 시키 는 학습 단계(S730)를 포함할 수 있다. 또한, 뇌 질환 진단 방법은 학습된 상기 에이전트를 통해 식별된 상기 최적의 뇌 기능 네트워크를 기초로 뇌 질환 진단에 의미가 있는 중요 특성을 추출하는 특성 추출 단계(S740)를 포함할 수 있다. 또한, 뇌 질환 진단 방법은 중요 특성을 활용하여 뇌 질환 여부를 진단하는 진단 단계(S750)를 포함할 수 있다. 또한, 일 실시예에 따라서, 네트워크 생성 단계는, 전체 영역간 상관관계 정보를 포함하는 전체 뇌 기능 네트워 크를 생성하는 전체 뇌 네트워크 생성 단계 및 전체 영역에 포함된 복수의 일부 영역을 제외한 나머지 영역간 상관관계 정보를 포함한 부분 뇌 기능 네트워크를 생성하는 부분 뇌 네트워크 생성 단계를 포함할 수 있다. 또한, 일 실시예에 따라서, 부분 뇌 네트워크 생성 단계는, 제외할 복수의 일부 영역을 강화학습을 통해 선택하 는 것을 특징으로 할 수 있다. 또한, 일 실시예에 따라서, 학습 단계는, 액터 네트워크-크리틱 네트워크 구조를 기반으로 구성된 소프트-액터- 크리틱 알고리즘 기반 강화학습을 활용하는 것을 특징으로 할 수 있다. 또한, 일 실시예에 따라서, 크리틱 네트워크는 의 소프 트 벨만 잔차를 최소화 하고, 액터 네트워크는 의 최적의 정책 및 액터 네트워크의 정책 분포 사이의 KL 발산을 최소화하여 최적의 정책을 학습할 수 있도록 하는 것을 특징으로 할 수 있다. 이상 강화학습 기반의 개인 맞춤형 뇌 질환 진단 장치 및 방법의 여러 실시예에 대해 설명하였으나, 뇌 질환 진 단 장치 및 방법은 오직 상술한 실시예에 한정되는 것은 아니다. 해당 기술 분야에서 통상의 지식을 가진 자가 상술한 실시예를 기초로 수정 및 변형하여 구현할 수 있는 다른 다양한 장치나 방법 역시 상술한 뇌 질환 진단 장치 및 방법의 일 실시예가 될 수 있다. 예를 들어, 설명된 방법(들)이 설명된 바와 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성 요소(들)가 설명된 바와 다른 형태로 결합, 연결 또는 조 합되거나 다른 구성 요소 또는 균등물 등에 의하여 대치 또는 치환되더라도, 상술한 뇌 질환 진단 장치 및/또는 진단 방법의 일 실시예가 될 수 있다. 본원 발명의 실시예 들과 관련된 기술 분야에서 통상의 지식을 가진 자는 상기 기재의 본질적인 특성에서 벗어 나지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로, 개시된 방법들은 한정 적인 관점이 아닌 설명적 관점에서 고려되어야 한다. 본 발명의 범위는 발명의 상세한 설명이 아닌 특허청구 범 위에 나타나며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0104866", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 뇌 질환 진단 장치의 블록도이다. 도 2는 일 실시예에 따른 뇌 기능 네트워크 생성 과정을 도시한 도면이다. 도 3은 일 실시예에 따른 네트워크 생성부의 블록도이다. 도 4는 일 실시예에 따른 부분 뇌 기능 네트워크 생성 과정을 도시한 도면이다. 도 5는 일 실시예에 따라 강화학습을 사용하여 부분 뇌 기능 네트워크를 생성하는 과정을 도시한 도면이다. 도 6은 일 실시예에 따른 시퀀스 모델링을 도시한 도면이다. 도 7은 일 실시예에 따른 뇌 질환 진단 방법의 순서도이다."}
