{"patent_id": "10-2023-0081142", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0178846", "출원번호": "10-2023-0081142", "발명의 명칭": "3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션", "출원인": "주식회사 셀버스", "발명자": "김기동"}}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말; 및상기 사용자 단말과 유무선 통신망을 통해 서로 연결되여 상기 사용자 단말로 3차원의 가상 공간 이미지 서비스를 제공하는 가상 이미지 제공 서버;를 포함하고,상기 가상 이미지 제공 서버는,사용자의 회원 정보를 등록하여 회원 인증하는 회원 관리부;상기 사용자 단말에 구비된 카메라와 연동하여 특정 공간이나 사물을 촬영하기 위한 스티칭용 이미지 촬영 화면을 제공하는 촬영 화면 제공부;상기 사용자 단말로부터 특정 공간이나 사물에 대한 사진 또는 영상을 포함하는 2차원의 촬영 이미지를 수신하는 촬영 이미지 수신부;상기 촬영 이미지를 이용하여 해당 촬영 이미지와 매핑하는 3차원의 제 1 가상 공간 스티칭 이미지를 생성하는스티칭 이미지 생성부;상기 제 1 가상 공간 스티칭 이미지를 인공지능 기반의 이미지 처리 프로그램에 의해 처리하여 3차원의 제 2 가상 공간 스티칭 이미지를 생성하는 스티칭 이미지 처리부;상기 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 각각 저장하는 스티칭 이미지 저장부;및상기 스티칭 이미지 저장부에 저장된 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 상기사용자 단말에 표시하는 스티칭 이미지 표시부;를 포함하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 회원 관리부는,상기 사용자의 회원 정보를 등록하는 회원 등록모듈;상기 사용자의 회원 정보를 인증하는 회원 인증모듈; 및상기 사용자 중 회원 인증된 사용자의 사용자 단말에 상기 가상 공간 이미지 서비스의 제공을 허용하는 서비스허용모듈;을 포함하고,상기 회원 등록모듈은,상기 사용자의 회원 정보를 기업회원, 기관회원 및 개인회원으로 분류하여 등록하는 것을 특징으로 하는 3차원가상 공간 이미지 서비스 시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 촬영 화면 제공부는,특정 공간이나 사물을 촬영하기 위한 촬영 포인트 개수에 따라 상기 이미지 촬영 화면에 촬영 지점을 자동으로공개특허 10-2024-0178846-3-배치하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스 시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 촬영 이미지 수신부는,상기 카메라의 자체 기능에 따른 촬영 화면을 통해 촬영한 촬영 이미지; 및상기 이미지 촬영 화면을 통해 촬영한 촬영 이미지;를 각각 수신하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스 시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 스티칭 이미지 생성부는,상기 촬영 이미지에서 360도 공간 생성을 위한 각도별 프레임 이미지를 추출하는 프레임 추출모듈;상기 프레임 이미지를 이미지 필터링으로 전처리하는 프레임 전처리모듈;특징맵 탐지(Feature Map Detection) 프로그램을 통해, 상기 프레임 이미지에서 특징점(Feature Point)을 추출하여 프레임 이미지별 특징맵을 생성하는 특징맵 생성모듈;매칭 함수 프로그램을 통해, 상기 프레임 이미지별 특징맵의 키포인트를 매칭하는 키포인트 매칭모듈;2차원으로 투영된 상기 프레임 이미지를 3차원 좌표로 비투영(un-projection)하기 위해 카메라 정보 및 상기 프레임 이미지의 회전, 이동, 뒤틀림 정도를 계산하여 캘리브레이션하는 카메라 캘리브레이션모듈; 및상기 프레임 이미지의 3차원 좌표를 이용하여 360도 공간의 스티칭 이미지인 상기 제 1 가상 공간 스티칭 이미지를 생성하는 스티칭 이미지 생성모듈;을 포함하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 프레임 전처리모듈은,인공지능 기반의 인페인팅 및 디노이징 프로그램에 의해 상기 프레임 이미지를 전처리하는 것을 특징으로 하는3차원 가상 공간 이미지 서비스 시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 스티칭 이미지 처리부는,상기 제 1 가상 공간 스티칭 이미지의 공백 부분을 인공지능 기반의 인페인팅 프로그램에 의해 채우는 이미지인페인팅모듈; 및상기 제 1 가상 공간 스티칭 이미지의 노이즈를 인공지능 기반의 디노이징 프로그램에 의해 제거하는 이미지 디노이징모듈;을 포함하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스 시스템.공개특허 10-2024-0178846-4-청구항 8 제 7항에 있어서,상기 스티칭 이미지 저장부는,상기 스티칭 이미지 생성부에서 생성된 제 1 가상 공간 스티칭 이미지를 저장하는 제 1 이미지 저장모듈; 및상기 스티칭 이미지 처리부에서 생성된 제 2 가상 공간 스티칭 이미지를 저장하는 제 2 이미지 저장모듈;을 포함하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스 시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8항에 있어서,상기 스티칭 이미지 표시부는,상기 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 이용하여 상기 사용자 단말에 가상 매장을 구축가능한 매장용 공간 솔루션을 표시하는 매장용 앱 표시모듈; 및상기 매장용 공간 솔루션을 통해 표시된 가상 매장에서 특정 사물의 위치 이동이 가능하고, 360도 공간 체험,지역 지도뷰 및 3차원 공간 구성뷰를 포함하는 사용자용 공간 솔루션을 표시하는 사용자용 앱 표시모듈;을 포함하는 것을 특징으로 하는 3차원 가상 공간 이미지 서비스 시스템."}
{"patent_id": "10-2023-0081142", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항 내지 제 9항 중 어느 한 항에 따른 3차원 가상 공간 이미지 서비스 시스템에 포함된 가상 이미지 제공서버의 구성이 프로그래밍되어 사용자 단말에 설치가능한 어플리케이션으로 구현된 기록매체에 저장된 3차원 가상 공간 이미지 서비스 어플리케이션."}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템은 사용자 단말; 및 상기 사용자 단말과 유무선 통신망을 통해 서로 연결되여 상기 사용자 단말로 3차원의 가상 공간 이미지 서비스를 제공하는 가상 이미지 제공 서버;를 포함하고, 상기 가상 이미지 제공 서버는, 사용자의 회원 정보를 등록하여 회원 인증하는 회원 관리부; 상기 사 (뒷면에 계속)"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시예는 3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션에 관한 것이다."}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "종래에는 3D 데이터(공간, 물체)를 생성하기 위해 전용 3D 스캐너를 이용하거나 정밀하게 배열된 여러 대의 카 메라를 이용하여 3D 데이터를 생성하였다. 하지만, 3D 스캐너는 가격이 비싸고 사용자에게 전문적 지식을 요구하여 접근성이 떨어졌고, 또한, 여러 대의 카메라를 이용하는 경우, 측정을 위한 복잡도가 높아 촬영 및 공간 모델링 구축에 한계가 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1818778호(2018.01.16.)"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "발명의 내용"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 모바일 기기에 탑재된 카메라, 깊이맵 센서(LiDAR 센서 또는 ToF 센서) 및 관성 측정 장치(IMU) 등을 이용하여 수집한 데이터를 기반으로 특징점 추출, 스티칭, visual localization 등을 적용하여 공간 또는 물체 를 스캔함으로써 3D 데이터를 생성할 수 있는 3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션을 제공하 는 것을 목적으로 한다. 또한, 본 발명은 누구나 모바일 기기를 이용하여 손쉽게 3D 데이터를 생성할 수 있고, 전문적 지식을 요구하지 않아 접근성이 높은 3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션을 제공하는 것을 목적으로 한다. 아울러, 본 발명은 가상공간 체험 서비스 편의성을 고려하여 웹/앱 기반으로 위치 이동이 가능하며 360도로 공 간을 체험할 수 있는 경험을 제공가능한 3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션을 제공하는 것 을 목적으로 한다."}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템은 사용자 단말; 및 상기 사용자 단말과 유무선 통신망을 통해 서로 연결되여 상기 사용자 단말로 3차원의 가상 공간 이미지 서 비스를 제공하는 가상 이미지 제공 서버;를 포함하고, 상기 가상 이미지 제공 서버는, 사용자의 회원 정보를 등 록하여 회원 인증하는 회원 관리부; 상기 사용자 단말에 구비된 카메라와 연동하여 특정 공간이나 사물을 촬영 하기 위한 스티칭용 이미지 촬영 화면을 제공하는 촬영 화면 제공부; 상기 사용자 단말로부터 특정 공간이나 사 물에 대한 사진 또는 영상을 포함하는 2차원의 촬영 이미지를 수신하는 촬영 이미지 수신부; 상기 촬영 이미지 를 이용하여 해당 촬영 이미지와 매핑하는 3차원의 제 1 가상 공간 스티칭 이미지를 생성하는 스티칭 이미지 생 성부; 상기 제 1 가상 공간 스티칭 이미지를 인공지능 기반의 이미지 처리 프로그램에 의해 처리하여 3차원의 제 2 가상 공간 스티칭 이미지를 생성하는 스티칭 이미지 처리부; 상기 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 각각 저장하는 스티칭 이미지 저장부; 및 상기 스티칭 이미지 저장부에 저장된 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 상기 사용자 단말에 표시하는 스티칭 이미지 표 시부;를 포함하는 것을 특징으로 한다. 또한, 상기 회원 관리부는, 상기 사용자의 회원 정보를 등록하는 회원 등록모듈; 상기 사용자의 회원 정보를 인 증하는 회원 인증모듈; 및 상기 사용자 중 회원 인증된 사용자의 사용자 단말에 상기 가상 공간 이미지 서비스 의 제공을 허용하는 서비스 허용모듈;을 포함하고, 상기 회원 등록모듈은, 상기 사용자의 회원 정보를 기업회원, 기관회원 및 개인회원으로 분류하여 등록할 수 있다. 또한, 상기 촬영 화면 제공부는, 특정 공간이나 사물을 촬영하기 위한 촬영 포인트 개수에 따라 상기 이미지 촬 영 화면에 촬영 지점을 자동으로 배치할 수 있다. 또한, 상기 촬영 이미지 수신부는, 상기 카메라의 자체 기능에 따른 촬영 화면을 통해 촬영한 촬영 이미지; 및 상기 이미지 촬영 화면을 통해 촬영한 촬영 이미지;를 각각 수신할 수 있다. 또한, 상기 스티칭 이미지 생성부는, 상기 촬영 이미지에서 360도 공간 생성을 위한 각도별 프레임 이미지를 추 출하는 프레임 추출모듈; 상기 프레임 이미지를 이미지 필터링으로 전처리하는 프레임 전처리모듈; 특징맵 탐지 (Feature Map Detection) 프로그램을 통해, 상기 프레임 이미지에서 특징점(Feature Point)을 추출하여 프레임 이미지별 특징맵을 생성하는 특징맵 생성모듈; 매칭 함수 프로그램을 통해, 상기 프레임 이미지별 특징맵의 키 포인트를 매칭하는 키포인트 매칭모듈; 2차원으로 투영된 상기 프레임 이미지를 3차원 좌표로 비투영(un- projection)하기 위해 카메라 정보 및 상기 프레임 이미지의 회전, 이동, 뒤틀림 정도를 계산하여 캘리브레이션 하는 카메라 캘리브레이션모듈; 및 상기 프레임 이미지의 3차원 좌표를 이용하여 360도 공간의 스티칭 이미지인 상기 제 1 가상 공간 스티칭 이미지를 생성하는 스티칭 이미지 생성모듈;을 포함할 수 있다. 또한, 상기 프레임 전처리모듈은, 인공지능 기반의 인페인팅 및 디노이징 프로그램에 의해 상기 프레임 이미지 를 전처리할 수 있다. 또한, 상기 스티칭 이미지 처리부는, 상기 제 1 가상 공간 스티칭 이미지의 공백 부분을 인공지능 기반의 인페 인팅 프로그램에 의해 채우는 이미지 인페인팅모듈; 및 상기 제 1 가상 공간 스티칭 이미지의 노이즈를 인공지 능 기반의 디노이징 프로그램에 의해 제거하는 이미지 디노이징모듈;을 포함할 수 있다.또한, 상기 스티칭 이미지 저장부는, 상기 스티칭 이미지 생성부에서 생성된 제 1 가상 공간 스티칭 이미지를 저장하는 제 1 이미지 저장모듈; 및 상기 스티칭 이미지 처리부에서 생성된 제 2 가상 공간 스티칭 이미지를 저 장하는 제 2 이미지 저장모듈;을 포함할 수 있다. 또한, 상기 스티칭 이미지 표시부는, 상기 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 이용하여 상기 사용자 단말에 가상 매장을 구축가능한 매장용 공간 솔루션을 표시하는 매장용 앱 표시모듈; 및 상기 매장용 공간 솔루션을 통해 표시된 가상 매장에서 특정 사물의 위치 이동이 가능하고, 360도 공간 체험, 지역 지도뷰 및 3차원 공간 구성뷰를 포함하는 사용자용 공간 솔루션을 표시하는 사용자용 앱 표시모듈;을 포함 할 수 있다. 아울러, 본 발명에 따른 기록매체에 저장된 3차원 가상 공간 이미지 서비스 어플리케이션은 3차원 가상 공간 이 미지 서비스 시스템에 포함된 가상 이미지 제공 서버의 구성이 프로그래밍되어 사용자 단말에 설치가능한 어플 리케이션으로 구현될 수 있다."}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기한 바와 같이 본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션에 따르면, 모바일 기 기에 탑재된 카메라, 깊이맵 센서(LiDAR 센서 또는 ToF 센서) 및 관성 측정 장치(IMU) 등을 이용하여 수집한 데 이터를 기반으로 특징점 추출, 스티칭, visual localization 등을 적용하여 공간 또는 물체를 스캔함으로써 3D 데이터를 생성할 수 있는 효과가 있다. 또한, 본 발명은 누구나 모바일 기기를 이용하여 손쉽게 3D 데이터를 생성할 수 있고, 전문적 지식을 요구하지 않아 접근성이 높은 효과가 있다. 아울러, 본 발명은 가상공간 체험 서비스 편의성을 고려하여 웹/앱 기반으로 위치 이동이 가능하며 360도로 공 간을 체험할 수 있는 경험을 제공가능한 효과가 있다."}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시 예를 상세히 설명한다. 우선, 도면들 중 동일한 구성요소 또는 부품들은 가능한 한 동일한 참조부호를 나타내고 있음에 유의해야 한다. 본 발명을 설명함에 있어서 관련된 공 지기능 혹은 구성에 대한 구체적인 설명은 본 발명의 요지를 모호하게 하지 않기 위해 생략한다.본 발명은 모바일 기반으로 언제 어디서든 쉽고 빠르게 가상 공간을 생성하고 꾸미기 위해 360도 이미지를 촬영 하고, 이를 기반으로 3D 렌더링 자동화를 구현하여 쉽고 빠르게 이미지를 렌더링할 수 있고, 3D 좌표와 실제 구 형 이미지에 좌표를 매핑하고, 해당 위치에 콘텐츠를 표출하는 세부 기능을 구현함으로써 3D 이미지의 렌더링, 렌더링 결과물의 좌표 추적 기능, 및 컨텐츠 매핑이 가능한 기술이다. 또한, 본 발명은 생성된 가상 공간의 다양한 인터렉티브와 퀄리티 향상을 위해 사용자가 빠르게 큐브를 생성하 며 변환 알고리즘을 통해 사진 비율에 맞는 큐브 넓이 조절과 실시간 미리보기 뷰 기술, 및 360도 공간 스티칭 이미지 생성 후 인공지능 기반 이미지 인페인팅, 및 디노이징이 가능한 기술이다. 특히, 본 발명은 종래의 구(sphere)를 통한 Scene 연결의 스티칭 방식의 한계를 극복하기 위해, 큐브 매핑(cube mapping) 기반의 스티칭 기술을 활용한다. 본 발명은 큐브 형으로 Scene을 연결해 경계의 중첩 부분을 최소화 할 수 있는데, 큐브 매핑의 경우 중첩 부분 이 적기 때문에 Scene을 이격시키지 않은 상태에서 찍을 수 있고, 또한 사용자가 이동하면서 VR 서비스를 제공 받을 수 있으며, 인접 위치로 이동함에 따라 scene의 경계에 닿으면 인접 위치의 scene으로 자연스럽게 전환될 수 있다. 즉, Panorama 이미지를 Cube의 형태로 변환하고, Cube 형태로 변환된 2차원 이미지를 코드를 통해 3차 원 큐브에 매핑할 수 있다. 또한, 본 발명은 360 이미지를 Cube Map Projection (CMP) 형태로 변형하는 기술을 활용하여 360 이미지를 방위 별로 잘라낼 수 있고, CMP로 변형한 360 이미지 간의 스티칭이 가능하고, CMP로 변형하여 각 면을 스티칭한 후 사용자는 그 중간 시점을 잘라내어 볼 수 있다. 이동 방향을 기준으로 Left/Rignt/Up/Down 면은 스티칭으로 중 간 시점을 생성해 내며, Front/Back 방향은 줌인/아웃 효과로 중간뷰를 생성할 수 있다. 아울러, 본 발명은 가상 공간을 이동하며 체험하는 사용자의 요구에 맞춰 공간 상의 좌표 인식 및 매핑 기술을 적용하여 사용자의 좌표에 따른 이미지를 제공할 수 있고, 특징점 정보(feature map), IMU 센서 정보 및 깊이 정보를 이용한 registration 및 visual localization 기술이 적용가능하며, 위치 추정과 특징점 매핑을 동시에 수행하는 SLAM (simultaneous localization and mapping) 기술 등으로 얻은 Spatial Data로 Feature Map에 Spatial Context를 부여할 수 있고, Spatial Feature Map을 구축하여 2D 이미지가 주어졌을 때 그 이미지의 위 치 정보를 파악할 수 있는 레퍼런스가 되어, 사용자의 위치 정보를 추적하는 것이 가능하다. 도 1은 본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템의 구성도이다. 본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템은 도 1에 도시된 바와 같이, 사용자 단말, 및 사용 자 단말과 유무선 통신망을 통해 서로 연결되어 사용자 단말로 3차원의 가상 공간 이미지 서비스를 제공하 는 가상 이미지 제공 서버를 포함한다. 상기 사용자 단말은 데스크탑, 노트북 등의 컴퓨터 또는 스마트폰을 포함한다. 상기 사용자 단말이 컴퓨터로 이루어지는 경우, 해당 컴퓨터 상에서 실행되는 웹을 통해 가상 이미지 제공 서버에 접속할 수 있고, 또한 상기 사용자 단말이 스마트폰으로 이루어지는 경우, 해당 스마트폰에 설치된 전용 어플리케이션을 통해 가상 이미지 제공 서버에 접속할 수 있다. 즉, 사용자는 사용자 단말을 통해 가상 이미지 제공 서버에 접속하여 3차원의 가상 공간 이미지 서비 스를 이용할 수 있다.도 2는 본 발명에 따른 가상 이미지 제공 서버의 구성도이다. 상기 가상 이미지 제공 서버는 도 2에 도시된 바와 같이, 회원 관리부, 촬영 화면 제공부, 촬영 이미지 수신부, 스티칭 이미지 생성부, 스티칭 이미지 처리부, 스티칭 이미지 저장부, 및 스티칭 이미지 표시부를 포함할 수 있다. 상기 회원 관리부는 사용자의 회원 정보를 등록하여 회원 인증할 수 있다. 도 3은 본 발명에 따른 회원 관리부의 구성도이다. 구체적으로, 상기 회원 관리부는 도 3에 도시된 바와 같이, 회원 등록모듈, 회원 인증모듈 및 서비스 허용모듈을 포함할 수 있다. 상기 회원 등록모듈은 사용자의 회원 정보를 등록할 수 있다. 상기 회원 등록모듈은 가상 이미지 제공 서버에 접속하여 3차원의 가상 공간 이미지 서비스를 이용하 려는 사용자로부터 해당 사용자의 인적 정보 및 기타 정보를 각각 제공받아 회원 정보로 등록할 수 있다. 특히, 상기 회원 등록모듈은 사용자의 회원 정보를 기업회원, 기관회원 및 개인회원으로 분류하여 등록할 수 있는데, 기업회원은 일반 기업, 미디어, 사회적 기업, 소기업, 개인사업자가 해당되고, 기관회원은 공공기관 이 해당되며, 개인회원은 기업회원 및 기관회원에 해당하지 않는 모든 대상층이 해당된다. 상기 회원 인증모듈은 사용자의 회원 정보를 인증할 수 있다. 상기 회원 인증모듈은 사용자가 가상 이미지 제공 서버에 접속하여 가상 공간 이미지 서비스를 이용 하려는 경우, 사용자에 의해 입력된 회원 정보가 기등록된 회원 정보와 일치하는지 여부에 따른 인증 과정을 수 행함으로써 사용자를 가상 이미지 제공 서버에 접속시킬 수 있다. 상기 서비스 허용모듈은 사용자 중 회원 인증된 사용자의 사용자 단말에 가상 공간 이미지 서비스의 제공 을 허용할 수 있다. 상기 서비스 허용모듈은 가상 이미지 제공 서버에 접속하려는 사용자가 회원 인증모듈에서 회원 으로 인증되지 않는 경우, 해당 사용자가 가상 이미지 제공 서버에 접속하는 것을 차단할 수 있다. 이에 반해, 사용자가 상기 회원 인증모듈에서 회원으로 인증되는 경우, 사용자가 가상 이미지 제공 서버 에 접속하는 것을 허용하여 사용자 단말에 가상 공간 이미지 서비스를 제공할 수 있다. 한편, 본 발명에서는 서비스 허용모듈을 통해 회원으로 인증된 사용자에게만 가상 이미지 제공 서버 의 접속을 허용하여 가상 공간 이미지 서비스를 제공하는 것으로 기재하였지만, 별도의 회원 등록없이도 가상 공간 이미지 서비스 중 맛보기 서비스를 사용자에게 제공할 수 있음은 물론이다. 상기 촬영 화면 제공부는 사용자 단말에 구비된 카메라와 연동하여 특정 공간이나 사물을 촬영하기 위한 스티칭용 이미지 촬영 화면을 제공할 수 있다. 이러한 촬영 화면 제공부는 특정 공간이나 사물을 촬영하기 위한 촬영 포인트 개수에 따라 상기 이미지 촬 영 화면에 촬영 지점을 자동으로 배치할 수 있다.구체적으로, 촬영 화면 제공부는 구면 좌표계의 값(0~360도 범위)을 촬영 포인트 개수에 따라 간격을 계 산하여 생성(d = 360도 / 촬영 포인트 개수)할 수 있는데, 예를 들어 촬영 포인트 개수를 광각 카메라는 12장, 일반 카메라는 14장으로 할 수 있고, 모션 센서를 활용하여 사용자(카메라)의 시야 방향을 지속적으로 업데이트 할 수 있으며, 벡터의 크기가 1로 고정된 상태에서 사용자의 시야 방향 과 촬영 포인트의 구면 좌표계 위치 방향 사이의 거리가 일정 범위에 들어오면 촬영할 수 있다. 이러한 이미지 촬영 화면은 사진 촬영 시 카메라의 시야 방향 정보를 저장하여 스티칭에 활용할 수 있고, 또한 촬영 포인트 정보를 가지고 있으므로 모든 이미지 사이의 매칭점 계산이 아닌 인접 이미지 사이에서만 매칭점을 계산함으로써 시간 단축이 가능하다. 일반적으로 사진 스티칭은 사진의 특징맵을 추출하여 매칭되는 부분을 찾아서 정합하는데, 간격이 일정하지 않 으면, 특정 사진은 겹치는 부분이 거의 없거나 반대로 너무 많이 겹쳐져서 낮은 퀄리티의 스티칭 이미지가 출력 될 수 있다. 상기 이미지 촬영 화면은 카메라 유형(일반 카메라, 광각 카메라), 사용자 촬영 방식(파노라마, 전체 촬영)에 따라 일정한 간격으로 자동으로 촬영 포인트를 배치하여 스티칭시 균일한 거리의 사진들을 제공함으로써 스티칭 성공률을 높일 수 있다. 상기 촬영 이미지 수신부는 사용자 단말로부터 특정 공간이나 사물에 대한 사진 또는 영상을 포함하는 2차 원의 촬영 이미지를 수신할 수 있다. 구체적으로, 촬영 이미지 수신부는 사용자 단말에 구비된 카메라의 자체 기능에 따른 촬영 화면을 통해 촬 영한 촬영 이미지를 수신할 수 있고, 또한 상기 이미지 촬영 화면을 통해 촬영한 촬영 이미지를 수신할 수 있다. 상기 스티칭 이미지 생성부는 촬영 이미지 수신부에 수신된 촬영 이미지를 이용하여 해당 촬영 이미지와 매핑하는 3차원의 제 1 가상 공간 스티칭 이미지를 생성할 수 있는데, 이러한 스티칭 이미지 생성부는 촬 영 이미지의 360도 이미지를 큐브 전개도 변환 알고리즘을 이용하여 3차원의 제 1 가상 공간 스티칭 이미지를 생성할 수 있다. 도 4는 본 발명에 따른 스티칭 이미지 생성부의 구성도이다. 구체적으로, 상기 스티칭 이미지 생성부는 도 4에 도시된 바와 같이, 프레임 추출모듈, 프레임 전처 리모듈, 특징맵 생성모듈, 키포인트 매칭모듈, 카메라 캘리브레이션모듈, 및 스티칭 이미 지 생성모듈을 포함할 수 있다. 상기 프레임 추출모듈은 상기 촬영 이미지에서 360도 공간 생성을 위한 각도별 프레임 이미지를 추출할 수 있다. 구체적으로, 상기 프레임 추출모듈은 촬영 이미지에 포함된 동영상 중에서 중요 프레임을 추출할 수 있는 데, 이러한 프레임 추출모듈은 추출 각도 설정, 촬영 각도 입력을 통해 360도 공간 생성을 위해 필요한 동 영상 프레임 이미지를 각도별로 추출할 수 있다.상기 프레임 전처리모듈은 상기 프레임 이미지를 이미지 필터링으로 전처리할 수 있다. 구체적으로, 프레임 전처리모듈은 후술하는 특징맵 생성이 잘 되도록 인공지능 기반의 인페인팅 및 디노이 징 프로그램에 의해 프레임 이미지를 전처리하여 동영상에서 발생하는 잔상 및 노이즈를 제거함으로써 스티칭 성공률과 퀄리티를 높일 수 있다. 상기 특징맵 생성모듈은 특징맵 탐지(Feature Map Detection) 프로그램을 통해, 상기 프레임 이미지에서 특징점(Feature Point)을 추출하여 프레임 이미지별 특징맵을 생성할 수 있다. 구체적으로, 특징맵 생성모듈은 추출된 각 프레임 이미지에서 이미지의 특징이 되는 부분, 예를 들어, 물 체의 모서리, 인접 픽셀 간 RGB값의 급변 부분을 탐색할 수 있는데, 이러한 특징맵 생성모듈은 SIFT, ORB 등의 Feature Map Detection 방법을 활용하여 프레임 이미지별 특징맵을 생성할 수 있다. 즉, 특징맵 생성모듈은 각 동영상에 맞게 파라미터를 변화시켜 최적의 Feature Map Detection 실행할 수 있는데, 전체 프레임 중 대표 프레임을 선정하여 ORB 함수를 적용시켜 평균 특징점 개수를 파악하고 최적의 Feature Map Detection을 실행할 수 있다. 상기 키포인트 매칭모듈은 매칭 함수 프로그램을 통해, 상기 프레임 이미지별 특징맵의 키포인트를 매칭할 수 있다. 도 5는 본 발명에 따른 키포인트 매칭모듈의 특징점 매칭을 통한 스티칭 기술을 보여주는 도이다. 구체적으로, 키포인트 매칭모듈은 도 5에 도시된 바와 같이, 특징맵 생성모듈에서 생성된 특징맵을 활용하여 프레임간 연관성으로, 프레임 간의 연결 여부 및 프레임 간 연결되는 지점을 파악하고, 특징맵의 키포 인트(Keypoint) 비교를 위해 다양한 Matching 함수, 예를 들어, KNN 매칭, FLANN 매칭 함수를 사용하여 프레임 이미지별 특징맵의 키포인트를 매칭할 수 있다. 상기 카메라 캘리브레이션모듈은 2차원으로 투영된 상기 프레임 이미지를 3차원 좌표로 비투영(un- projection)하기 위해 카메라 정보 및 상기 프레임 이미지의 회전, 이동, 뒤틀림 정도를 계산하여 캘리브레이션 할 수 있다. 구체적으로, 카메라 캘리브레이션모듈은 매칭된 Keypoint를 기반으로 초점거리, 내부 행렬(K), 외부 행렬 (R) 등의 카메라 정보를 획득할 수 있는데, 이러한 카메라 캘리브레이션모듈은 촬영된 카메라 정보를 포함 하는 내부 행렬 정보(초점거리, 주점 등)를 계산하고, 기준 좌표에 대하여 각 프레임의 외부 행렬 정보(회전, 이동, 뒤틀림)를 계산할 수 있다. 카메라 시야 방향 정보를 활용한 외부 파라미터 계산 방식으로, 종래에는 사진간 매칭점을 통해 사진의 외부 파 라미터(R, 카메라 회전 정보)를 계산하였는데, 이러한 종래 특징맵의 매칭점 기반의 외부 파라미터(이미지의 회 전, 이동, 뒤틀림 정도) 계산의 경우, 촬영된 사진 기반의 외부 파라미터를 계산하기 때문에, 특징점 생성이 어 려운 밤이나 단조로운 벽면 사진의 경우 외부 파라미터 계산이 불가한 문제점이 있었다. 본 발명에서는 최초 촬영 사진을 기준으로 저장된 사진 시야 방향 정보를 활용해 외부 파라미터를 계산할 수 있 다. 구체적으로, 하기 수학식 1, 2를 계산하여 외부 파라미터를 획득할 수 있는데, 촬영시 확정적으로 획득할 수 있 는 카메라 시야 방향 정보를 활용하여 외부 파라미터를 계산할 수 있다.수학식 1"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 2"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "또한, 본 발명에서는 카메라 시야 방향 기반 외부 파라미터를 기반으로 Bundle Adjustment 실행하여 보정된 외 부 파라미터 획득할 수 있고, 보정된 외부 파라미터와 카메라 시야 방향 정보 기반의 외부 파라미터의 값 오차를 하기 수학식 3으로 계산할 수 있다. 수학식 3"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "아울러, 본 발명에서는 전체 사진 간 오차 평균을 하기 수학식 4로 계산할 수 있고, 또한 하기 수학식 5와 같이, 보정된 외부 파라미터의 오차율이 촬영 포인트의 설정한 촬영 범위를 넘어갈 경우 스티칭 에러로 판단하 고 기존의 시야 방향 기반 외부 파라미터 활용할 수 있다. 수학식 4"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 5"}
{"patent_id": "10-2023-0081142", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "상기 스티칭 이미지 생성모듈은 상기 프레임 이미지의 3차원 좌표를 이용하여 360도 공간의 스티칭 이미지 인 상기 제 1 가상 공간 스티칭 이미지를 생성할 수 있다. 구체적으로, 스티칭 이미지 생성모듈은 특징맵 생성모듈, 키포인트 매칭모듈, 카메라 캘리브레이션모듈을 통해 생성된 다양한 정보를 활용하여 최종적으로 360도 공간의 스티칭 이미지를 생성할 수 있고, 이때, 동영상 스티칭에 최적화된 Image Warping, Seam Finding, Blending 방법을 구현할 수 있다. 상기 스티칭 이미지 처리부는 스티칭 이미지 생성부에서 생성된 제 1 가상 공간 스티칭 이미지를 인공지능 기반의 이미지 처리 프로그램에 의해 처리하여 3차원의 제 2 가상 공간 스티칭 이미지를 생성할 수 있다. 도 6은 본 발명에 따른 스티칭 이미지 처리부의 구성도이다. 구체적으로, 상기 스티칭 이미지 처리부는 도 6에 도시된 바와 같이, 이미지 인페인팅모듈, 및 이미 지 디노이징모듈을 포함할 수 있다. 이미지 인페인팅모듈은 제 1 가상 공간 스티칭 이미지의 공백 부분을 인공지능 기반의 인페인팅 프로그램 에 의해 채울 수 있다. 도 7은 본 발명에 따른 이미지 인페인팅모듈의 이미지 인페인팅을 보여주는 도이다. 구체적으로, 이미지 인페인팅모듈은 도 7에 도시된 바와 같이, 360도 공간 이미지의 인페인팅을 위해 해당 이미지를 큐브형 이미지로 변환하고, 큐브형 이미지의 공백 부분에 마스킹을 진행하여 해당 이미지의 공백 부분 을 채움으로써 이미지의 퀄리티를 높일 수 있다. 이미지 디노이징모듈은 제 1 가상 공간 스티칭 이미지의 노이즈를 인공지능 기반의 디노이징 프로그램에 의해 제거할 수 있다. 도 8은 본 발명에 따른 이미지 디노이징모듈의 이미지 디노이징을 보여주는 도이다. 구체적으로, 이미지 디노이징모듈은 도 8에 도시된 바와 같이, 이미지의 노이즈를 제거하거나 해당 이미지 를 선명하게 함으로써 이미지의 퀄리티를 높일 수 있다. 상기 스티칭 이미지 저장부는 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 각각 저 장할 수 있다. 도 9는 본 발명에 따른 스티칭 이미지 저장부의 구성도이다. 구체적으로, 상기 스티칭 이미지 저장부는 도 9에 도시된 바와 같이, 제 1 이미지 저장모듈, 및 제 2 이미지 저장모듈을 포함할 수 있다. 제 1 이미지 저장모듈은 상기 스티칭 이미지 생성부에서 생성된 제 1 가상 공간 스티칭 이미지를 저장할 수 있는데, 이러한 제 1 이미지 저장모듈이 제 1 가상 공간 스티칭 이미지를 저장함으로써, 후술하는 바와 같이, 스티칭 이미지 표시부가 해당 제 1 가상 공간 스티칭 이미지를 이용하여 사용자 단말에 매장용 공간 솔루 션 또는 사용자용 공간 솔루션을 표시하도록 할 수 있다.또한, 제 2 이미지 저장모듈은 상기 스티칭 이미지 처리부에서 생성된 제 2 가상 공간 스티칭 이미지를 저 장할 수 있는데, 이러한 제 2 이미지 저장모듈이 제 2 가상 공간 스티칭 이미지를 저장함으로써, 스티칭 이미지 표시부가 해당 제 2 가상 공간 스티칭 이미지를 이용하여 사용자 단말에 매장용 공간 솔루션 또는 사용 자용 공간 솔루션을 표시하도록 할 수 있다. 상기 스티칭 이미지 표시부는 스티칭 이미지 저장부에 저장된 제 1 가상 공간 스티칭 이미지, 및 제 2 가 상 공간 스티칭 이미지를 사용자 단말에 표시할 수 있다. 도 10은 본 발명에 따른 스티칭 이미지 표시부의 구성도이다. 구체적으로, 상기 스티칭 이미지 표시부는 도 10에 도시된 바와 같이, 매장용 앱 표시모듈, 및 사용 자용 앱 표시모듈을 포함할 수 있다. 매장용 앱 표시모듈은 상기 제 1 가상 공간 스티칭 이미지, 및 제 2 가상 공간 스티칭 이미지를 이용하여 상기 사용자 단말에 가상 매장을 구축가능한 매장용 공간 솔루션을 표시할 수 있다. 도 11은 본 발명에 따른 매장용 앱 표시모듈이 매장용 공간 솔루션을 표시하는 도이다. 구체적으로, 매장용 앱 표시모듈은 도 11에 도시된 바와 같이, 사용자가 간편하고 쉽게 가상 매장을 직접 구축가능한 솔루션 앱을 제공할 수 있고, 모바일을 통해 사진 및 영상촬영 후 제품, 공간 연결 등을 설정하여 가상 매장 모델링을 가능하게 할 수 있다. 사용자용 앱 표시모듈은 상기 매장용 공간 솔루션을 통해 표시된 가상 매장에서 특정 사물의 위치 이동이 가능하고, 360도 공간 체험, 지역 지도뷰 및 3차원 공간 구성뷰를 포함하는 사용자용 공간 솔루션을 표시할 수 있다. 도 12는 본 발명에 따른 사용자용 앱 표시모듈이 사용자용 공간 솔루션을 표시하는 도이다. 구체적으로, 사용자용 앱 표시모듈은 도 12에 도시된 바와 같이, 매장용 앱을 통해 모델링된 가상 매장을 사용자 솔루션 앱에 반영하여, 매장 내 위치 이동이 가능하며 360도로 공간 체험. 좌표 추적 및 매핑을 통해 지 역 지도뷰와 공간 구성뷰로 표현할 수 있고, 또한 오프라인으로 방문하지 않고 매장 경험과 커뮤니케이션(라이 브, 채팅), 및 제품 구매(픽업, 배송)가 가능하며. 모든 매장이 입점하여 사용할 수 있는 공통 플랫폼 형태로 사용자 접점이 높을 수 있다. 보다 구체적으로, 사용자용 앱 표시모듈은 온-오프라인 매장 경험이 지속되는 옴니채널 플랫폼으로 사용자 용 공간 솔루션을 표시할 수 있는데, 가상 매장 내 360도 경험과 홍보 영상, 좌석 예약(레스토랑 등), 픽업주문, 패키지/외식 상품권 구매 배송, 라이브와 채팅을 활용한 고객 소통 및 판매가 가능하고, 예를 들어, 매장이 음식 매장인 경우, 시각적으로 소비되는 몰입형 음식 경험을 제공할 수 있다. 한편, 본 발명에서는 상기한 바와 같이, 데이터 시각화 서비스 시스템을 기재하고 있으나, 해당 시스템에 포함 된 데이터 시각화 서버의 구성, 즉 회원 관리부, 객체 생성부, 객체 저장부, 객체 표시부,객체 공유부 및 객체 수정부를 각각 프로그래밍하여 사용자 단말에 설치가능한 데이터 시각화 서비스 어플리케이션으로 구현함으로써 사용자 단말과 데이터 시각화 서버와의 데이터 송수신이 없이 사용자 단말 내에 설치된 어플리케이션만을 통해 데이터 시각화 서비스를 제공할 수 있음은 물론이다. 상기한 바와 같이 본 발명에 따르면, 모바일 기기에 탑재된 카메라, 깊이맵 센서(LiDAR 센서 또는 ToF 센서) 및 관성 측정 장치(IMU) 등을 이용하여 수집한 데이터를 기반으로 특징점 추출, 스티칭, visual localization 등을 적용하여 공간 또는 물체를 스캔함으로써 누구나 모바일 기기를 이용하여 손쉽게 3D 데이터를 생성할 수 있고, 전문적 지식을 요구하지 않아 접근성이 높으며, 가상공간 체험 서비스 편의성을 고려하여 웹/앱 기반으로 위치 이동이 가능하고 360도로 공간을 체험할 수 있다. 이상과 같이 본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템 및 어플리케이션을 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기 술사상 범위 내에서 당업자에 의해 다양한 변형이 이루어질 수 있음은 물론이다."}
{"patent_id": "10-2023-0081142", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 3차원 가상 공간 이미지 서비스 시스템의 구성도이다. 도 2는 본 발명에 따른 가상 이미지 제공 서버의 구성도이다. 도 3은 본 발명에 따른 회원 관리부의 구성도이다. 도 4는 본 발명에 따른 스티칭 이미지 생성부의 구성도이다. 도 5는 본 발명에 따른 키포인트 매칭모듈의 특징점 매칭을 통한 스티칭 기술을 보여주는 도이다. 도 6은 본 발명에 따른 스티칭 이미지 처리부의 구성도이다. 도 7은 본 발명에 따른 이미지 인페인팅모듈의 이미지 인페인팅을 보여주는 도이다. 도 8은 본 발명에 따른 이미지 디노이징모듈의 이미지 디노이징을 보여주는 도이다. 도 9는 본 발명에 따른 스티칭 이미지 저장부의 구성도이다. 도 10은 본 발명에 따른 스티칭 이미지 표시부의 구성도이다. 도 11은 본 발명에 따른 매장용 앱 표시모듈이 매장용 공간 솔루션을 표시하는 도이다. 도 12는 본 발명에 따른 사용자용 앱 표시모듈이 사용자용 공간 솔루션을 표시하는 도이다."}
