{"patent_id": "10-2021-0141163", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0057117", "출원번호": "10-2021-0141163", "발명의 명칭": "인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법", "출원인": "동의대학교 산학협력단", "발명자": "장종욱"}}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "객체 검출을 위한 영상 데이터를 입력하는 영상 데이터 입력부;객체 인식 인공지능 작업을 수행하는 딥러닝 프로세싱부;딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정하여 영상 분할 후 엣지 검출단계를 수행하는 영상분할후 엣지 검출부;영상 데이터 입력부를 통하여 입력된 원본 이미지의 엣지 검출을 수행하는 엣지 검출부;영상분할후 엣지 검출부 및 엣지 검출부에서 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 수행하는 엣지 이미지 비교부;엣지 이미지 비교부의 비교 결과를 기준으로 결과 값을 반영하지 않은 이미지를 불러와 출력하거나, 결과 값을원본 이미지에 반영하여 결과 이미지 최적화 출력을 하는 결과 이미지 최적화부;를 포함하는 것을 특징으로 하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 딥러닝 프로세싱부는 이미지 데이터가 입력되면,입력 원본을 임시저장하고, 인식할 객체 데이터학습 모델을 불러와 객체 인식 인공지능 작업을 수행하고 수행결과 이미지의 임시 저장 및 객체 위치 전송을 하는 객체 인식 인공지능 작업 단계를 수행하는 것을 특징으로하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 결과 이미지 최적화부는,인공지능 객체 검출 중앙값과 비교하여 변화가 기준값보다 크거나, 인공지능 객체 검출 영역과 비교하여 변화가기준값보다 크면 관심 영역의 결과 값을 반영하지 않은 이미지를 불러와 결과 이미지로 출력하는 것을 특징으로하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 결과 이미지 최적화부는,인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 작거나 검출 영역 외곽선 잡음의 양이 기준값보다 작으면 영상 처리로 수행된 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하는 것을 특징으로 하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 결과 이미지 최적화부는,검출 영역 외곽선 잡음의 양이 기준값보다 많으면 두 개의 객체 영역의 중간 값을 가지는 영역으로 보정 연산을하고 관심 영역의 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하는 것을 특징으로 하는 인공 신경망적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서, 영상 분할후 엣지 검출부는,딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정하는 관심 영역 지정부와,공개특허 10-2023-0057117-3-영상 분할 후 엣지 검출을 위하여 관심 영역 이진화 변환을 수행하는 이진화 변환 수행부와,회색조 이미지의 외곽선 검출을 수행하는 외곽선 검출부와,외곽선 데이터 내 잡음을 제거하기 위해 중간 값 필터 연산을 하는 필터 연산부와,외곽선 데이터를 뚜렷하게 하기 위한 라플라스 연산을 수행하는 라플라스 연산부와,객체 위치를 활용하여 중심점 연산을 하는 중심점 연산부와,컨벌루션 기법으로 이진화 외곽선 검출 객체 데이터의 중심점에서 값이 없는 부분을 찾는 연산을 하고, 값이 없는 부분 검출 이후 해당 위치를 중심으로 하여 객체 외곽선까지 색상 채우기를 하는 컨벌루션 연산 및 색상 처리부를 포함하는 것을 특징으로 하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 엣지 이미지 비교부는 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 통하여,객체 중심점 위치 변화 크기 차이를 비교하는 중심점 위치 비교부와,검출된 객체 영역 크기 차이를 비교하는 객체인식 영역 비교부와,검출 영역 외곽선 잡음의 양을 비교하는 외곽선 잡음 비교부를 포함하는 것을 특징으로 하는 인공 신경망 적용객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "객체 검출을 위한 영상 데이터를 입력하는 영상 데이터 입력 단계;객체 인식 인공지능 작업을 수행하는 딥러닝 프로세싱 단계;딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정하여 영상 분할 후 엣지 검출단계를 수행하는 영상분할후 엣지 검출 단계;영상 데이터 입력 단계를 통하여 입력된 원본 이미지의 엣지 검출을 수행하는 엣지 검출 단계;영상분할후 엣지 검출 단계 및 엣지 검출 단계에서 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 수행하는 엣지 이미지 비교단계;엣지 이미지 비교 단계의 비교 결과를 기준으로 결과 값을 반영하지 않은 이미지를 불러와 출력하거나, 결과 값을 원본 이미지에 반영하여 결과 이미지 최적화 출력을 하는 결과 이미지 최적화 단계;를 포함하는 것을 특징으로 하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 딥러닝 프로세싱 단계에서 이미지 데이터가 입력되면,입력 원본을 임시저장하고, 인식할 객체 데이터학습 모델을 불러와 객체 인식 인공지능 작업을 수행하고 수행결과 이미지의 임시 저장 및 객체 위치 전송을 하는 객체 인식 인공지능 작업 단계를 수행하는 것을 특징으로하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서, 결과 이미지 최적화 단계는,인공지능 객체 검출 중앙값과 비교하여 변화가 기준값보다 크거나, 인공지능 객체 검출 영역과 비교하여 변화가기준값보다 크면 관심 영역의 결과 값을 반영하지 않은 이미지를 불러와 결과 이미지로 출력하는 것을 특징으로하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2023-0057117-4-제 8 항에 있어서, 결과 이미지 최적화 단계는,인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 작거나 검출 영역 외곽선 잡음의 양이 기준값보다 작으면 영상 처리로 수행된 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하는 것을 특징으로 하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서, 결과 이미지 최적화 단계는,검출 영역 외곽선 잡음의 양이 기준값보다 많으면 두 개의 객체 영역의 중간 값을 가지는 영역으로 보정 연산을하고 관심 영역의 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하는 것을 특징으로 하는 인공 신경망적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 8 항에 있어서, 영상 분할후 엣지 검출 단계는,딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정하는 관심 영역 지정 단계와,영상 분할 후 엣지 검출을 위하여 관심 영역 이진화 변환을 수행하는 이진화 변환 수행 단계와,회색조 이미지의 외곽선 검출을 수행하는 외곽선 검출 단계와,외곽선 데이터 내 잡음을 제거하기 위해 중간 값 필터 연산을 하는 필터 연산 단계와,외곽선 데이터를 뚜렷하게 하기 위한 라플라스 연산을 수행하는 라플라스 연산 단계와,객체 위치를 활용하여 중심점 연산을 하는 중심점 연산 단계와,컨벌루션 기법으로 이진화 외곽선 검출 객체 데이터의 중심점에서 값이 없는 부분을 찾는 연산을 하고, 값이 없는 부분 검출 이후 해당 위치를 중심으로 하여 객체 외곽선까지 색상 채우기를 하는 컨벌루션 연산 및 색상 처리 단계를 포함하는 것을 특징으로 하는 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 8 항에 있어서, 엣지 이미지 비교 단계는 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 통하여,객체 중심점 위치 변화 크기 차이를 비교 판단하는 단계와,검출된 객체 영역 크기 차이를 비교 판단하는 단계와,검출 영역 외곽선 잡음의 양을 비교 판단하는 단계를 포함하는 것을 특징으로 하는 인공 신경망 적용 객체 감지과정에서의 효과적인 하드웨어 사용을 위한 방법."}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 딥러닝 영상 분할의 결과물을 출력하기 직전에 이미지 처리를 수행하여 효율적인 하드웨어 사용으로 정확도를 높일 수 있도록 한 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법에 관한 것으로, 객체 검출을 위한 영상 데이터를 입력하는 영상 데이터 입력부;객체 인식 인공지능 작업을 (뒷면에 계속)"}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상 데이터 처리에 관한 것으로, 구체적으로 딥러닝 영상 분할의 결과물을 출력하기 직전에 이미지 처리를 수행하여 효율적인 하드웨어 사용으로 정확도를 높일 수 있도록 한 인공 신경망 적용 객체 감지 과정에 서의 효과적인 하드웨어 사용을 위한 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "자율주행, CCTV, 휴대폰 보안, 주차시설 등 카메라를 통한 이미지 처리는 실생활의 많은 문제를 해결하기 위해 사용되고 있다. 간단한 구분의 경우는 이미지 처리를 통해 해결하지만, 복잡하게 섞인 물체의 이미지 또는 이미 지 내 특징을 찾아내기 어렵다.이런 문제를 해결을 위해 영상데이터에 분류, 탐지, 분할에서 딥러닝 기술을 도입하고 있다. 이러한 딥러닝이 가장 활발하게 적용되고 있는 분야 중 하나가 컴퓨터 비전(computer vision) 분야이다. 컴퓨터 비전 기술은 컴퓨터에서 카메라, 스캐너 등의 시각 매체를 통해 입력 받은 영상에서 주변 물체와 환경 속성에 대한 이미지를 분석하여 유용한 정보를 생성하는 기술이다. 화상 처리와 배경 분석을 거쳐 각종 임무 수행에 필요한 정보 형태로 생성해내는 것으로, 특히, 입력된 주어진 이미지에서 특정 객체의 위치를 표시하고 라벨링하는 객체 분류 및 검출 알고리즘은 그 중에서도 빠르게 발전하 고 있다. 딥러닝을 통한 이미지 분석은 크게 분류(Classification), 검출(Detection), 분할(Segmentation)로 구분된다. 분류는 이미지에서 특정한 객체나 배경, 분위기 등의 주제를 잡고 각 이미지에 대여 1개의 답을 가지고 지정하 는 것을 의미한다. 검출은 보통 이미지에서 필요한 객체를 찾고 그 위치(Localization)를 Binding Box 형식으로 표기를 해주는 것이 일반적인 형태이다. 이것을 넘어서 분할에서는 이미지에서 필요한 객체를 찾는 검출에 추가로 정확한 객체의 모양을 Polygon 형식으 로 Box의 형식보다 더 정밀하게 표기한다. 각 처리방법에 따라 데이터 정제 방식도 다르다. 보통 원하는 결과와 같이 사람이 직접 정제하여 학습 데이터로 사용하게 된다. 이 유사 학습 데이터를 토대로 학습하여 나온 가중치를 토대로 결과에 반영시키기 때문이다. 그리고 딥러닝의 Image Segmentation에는 2가지 방법으로 의미론적 분할(Semantic segmentation)과 의미있는 객체의 분할(Instance segmentation)이 있다. 의미론적 분할은 객체의 분할을 수행하되 같은 클래스에 속하는 객체들은 같은 영역과 색으로 분할된것을 의미 하며, 의미 있는 객체의 분할은 같은 클래스에 속하더라도 객체들을 모두 구분해 주는 것을 의미한다. 이것은 여러 개의 같은 물체가 있더라도 다른 색으로 분할 한다. 하지만, 이와 같은 종래 기술의 딥러닝을 통한 이미지 분석은 일반적인 이미지 처리만 수행하는 것보다 결과가 좋지만, 딥러닝을 사용한 영상 분할의 방법에서 판단된 결과물이 실제 객체와 편차가 발생하는 문제가 있다. 따라서, 하드웨어의 가중 사용없이 딥러닝을 통한 이미지 분석 정확도를 높일 수 있도록 하는 새로운 영상 데이 터 처리 기술의 개발이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제10-2021-0067498호 (특허문헌 0002) 대한민국 공개특허 제10-2018-0072549호 (특허문헌 0003) 대한민국 공개특허 제10-2020-0027428호"}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 종래 기술의 영상 데이터 처리 기술의 문제점을 해결하기 위한 것으로, 딥러닝 영상 분할의 결과물을 출력하기 직전에 이미지 처리를 수행하여 효율적인 하드웨어 사용으로 정확도를 높일 수 있도록 한 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법을 제공하는데 그 목적이 있다. 본 발명은 하드웨어에 가중되는 작업을 억제하면서 데이터의 전처리 정밀도와 다른 환경을 지닌 영상에 따라 결 과물은 달라지는 문제를 해결할 수 있도록 한 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용 을 위한 시스템 및 방법을 제공하는데 그 목적이 있다. 본 발명은 인공지능 처리에서의 불필요하게 가중되는 연산 작업을 줄이면서 객체의 탐지 이후의 출력에 대해 영 상처리를 통하여 검출된 결과의 정확도를 높일 수 있도록 한 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법을 제공하는데 그 목적이 있다. 본 발명의 다른 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템은 객체 검출을 위한 영상 데이터를 입력하는 영상 데이터 입력부;객체 인식 인공지능 작업 을 수행하는 딥러닝 프로세싱부;딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정하여 영상 분할 후 엣지 검출 단계를 수행하는 영상분할후 엣지 검출부;영상 데이터 입력부를 통하여 입력 된 원본 이미지의 엣지 검출을 수행하는 엣지 검출부;영상분할후 엣지 검출부 및 엣지 검출부에서 처리된 결과 물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 수행하는 엣지 이미지 비교부;엣지 이미지 비교부의 비교 결과를 기준으로 결과 값을 반영하지 않은 이미지를 불러와 출력하거나, 결과 값을 원본 이미지에 반영하여 결과 이미지 최적화 출력을 하는 결과 이 미지 최적화부;를 포함하는 것을 특징으로 한다. 여기서, 딥러닝 프로세싱부는 이미지 데이터가 입력되면, 입력 원본을 임시저장하고, 인식할 객체 데이터학습 모델을 불러와 객체 인식 인공지능 작업을 수행하고 수행 결과 이미지의 임시 저장 및 객체 위치 전송을 하는 객체 인식 인공지능 작업 단계를 수행하는 것을 특징으로 한다. 그리고 결과 이미지 최적화부는, 인공지능 객체 검출 중앙값과 비교하여 변화가 기준값보다 크거나, 인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 크면 관심 영역의 결과 값을 반영하지 않은 이미지를 불러와 결 과 이미지로 출력하는 것을 특징으로 한다. 그리고 결과 이미지 최적화부는, 인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 작거나 검출 영역 외 곽선 잡음의 양이 기준값보다 작으면 영상 처리로 수행된 결과 값을 원본 이미지에 반영하여 결과 이미지를 출 력하는 것을 특징으로 한다. 그리고 결과 이미지 최적화부는, 검출 영역 외곽선 잡음의 양이 기준값보다 많으면 두 개의 객체 영역의 중간 값을 가지는 영역으로 보정 연산을 하고 관심 영역의 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하 는 것을 특징으로 한다. 그리고 영상 분할후 엣지 검출부는, 딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영 역 지정하는 관심 영역 지정부와,영상 분할 후 엣지 검출을 위하여 관심 영역 이진화 변환을 수행하는 이진화 변환 수행부와,회색조 이미지의 외곽선 검출을 수행하는 외곽선 검출부와,외곽선 데이터 내 잡음을 제거하기 위 해 중간 값 필터 연산을 하는 필터 연산부와,외곽선 데이터를 뚜렷하게 하기 위한 라플라스 연산을 수행하는 라 플라스 연산부와,객체 위치를 활용하여 중심점 연산을 하는 중심점 연산부와,컨벌루션 기법으로 이진화 외곽선 검출 객체 데이터의 중심점에서 값이 없는 부분을 찾는 연산을 하고, 값이 없는 부분 검출 이후 해당 위치를 중 심으로 하여 객체 외곽선까지 색상 채우기를 하는 컨벌루션 연산 및 색상 처리부를 포함하는 것을 특징으로 한 다. 그리고 엣지 이미지 비교부는 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결 과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 통하여, 객체 중심점 위치 변화 크기 차이를 비교하는 중심점 위치 비교부와,검출된 객체 영역 크기 차이를 비교하는 객체인식 영역 비교부와,검출 영역 외곽선 잡음 의 양을 비교하는 외곽선 잡음 비교부를 포함하는 것을 특징으로 한다. 다른 목적을 달성하기 위한 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법은 객체 검출을 위한 영상 데이터를 입력하는 영상 데이터 입력 단계;객체 인식 인공지능 작업을 수행 하는 딥러닝 프로세싱 단계;딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정 하여 영상 분할 후 엣지 검출 단계를 수행하는 영상분할후 엣지 검출 단계;영상 데이터 입력 단계를 통하여 입 력된 원본 이미지의 엣지 검출을 수행하는 엣지 검출 단계;영상분할후 엣지 검출 단계 및 엣지 검출 단계에서 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물 의 객체 인식 영역의 비교를 수행하는 엣지 이미지 비교 단계;엣지 이미지 비교 단계의 비교 결과를 기준으로 결과 값을 반영하지 않은 이미지를 불러와 출력하거나, 결과 값을 원본 이미지에 반영하여 결과 이미지 최적화출력을 하는 결과 이미지 최적화 단계;를 포함하는 것을 특징으로 한다. 여기서, 딥러닝 프로세싱 단계에서 이미지 데이터가 입력되면, 입력 원본을 임시저장하고, 인식할 객체 데이터 학습 모델을 불러와 객체 인식 인공지능 작업을 수행하고 수행 결과 이미지의 임시 저장 및 객체 위치 전송을 하는 객체 인식 인공지능 작업 단계를 수행하는 것을 특징으로 한다. 그리고 결과 이미지 최적화 단계는, 인공지능 객체 검출 중앙값과 비교하여 변화가 기준값보다 크거나, 인공지 능 객체 검출 영역과 비교하여 변화가 기준값보다 크면 관심 영역의 결과 값을 반영하지 않은 이미지를 불러와 결과 이미지로 출력하는 것을 특징으로 한다. 그리고 결과 이미지 최적화 단계는, 인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 작거나 검출 영역 외곽선 잡음의 양이 기준값보다 작으면 영상 처리로 수행된 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하는 것을 특징으로 한다. 그리고 결과 이미지 최적화 단계는, 검출 영역 외곽선 잡음의 양이 기준값보다 많으면 두 개의 객체 영역의 중 간 값을 가지는 영역으로 보정 연산을 하고 관심 영역의 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력 하는 것을 특징으로 한다. 그리고 영상 분할후 엣지 검출 단계는, 딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관 심영역 지정하는 관심 영역 지정 단계와,영상 분할 후 엣지 검출을 위하여 관심 영역 이진화 변환을 수행하는 이진화 변환 수행 단계와,회색조 이미지의 외곽선 검출을 수행하는 외곽선 검출 단계와,외곽선 데이터 내 잡음 을 제거하기 위해 중간 값 필터 연산을 하는 필터 연산 단계와,외곽선 데이터를 뚜렷하게 하기 위한 라플라스 연산을 수행하는 라플라스 연산 단계와,객체 위치를 활용하여 중심점 연산을 하는 중심점 연산 단계와,컨벌루션 기법으로 이진화 외곽선 검출 객체 데이터의 중심점에서 값이 없는 부분을 찾는 연산을 하고, 값이 없는 부분 검출 이후 해당 위치를 중심으로 하여 객체 외곽선까지 색상 채우기를 하는 컨벌루션 연산 및 색상 처리 단계를 포함하는 것을 특징으로 한다. 그리고 엣지 이미지 비교 단계는 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 통하여, 객체 중심점 위치 변화 크기 차이를 비교 판단하는 단계와,검출된 객체 영역 크기 차이를 비교 판단하는 단계와,검출 영역 외곽선 잡음의 양을 비교 판단 하는 단계를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서 설명한 바와 같은 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법은 다음과 같은 효과가 있다. 첫째, 딥러닝 영상 분할의 결과물을 출력하기 직전에 이미지 처리를 수행하여 효율적인 하드웨어 사용으로 정확 도를 높일 수 있도록 한다. 둘째, 하드웨어에 가중되는 작업을 억제하면서 데이터의 전처리 정밀도와 다른 환경을 지닌 영상에 따라 결과물 은 달라지는 문제를 해결할 수 있도록 한다. 셋째, 인공지능 처리에서의 불필요하게 가중되는 연산 작업을 줄이면서 객체의 탐지 이후의 출력에 대해 영상처 리를 통하여 검출된 결과의 정확도를 높일 수 있도록 한다."}
{"patent_id": "10-2021-0141163", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법 의 바람직한 실시 예에 관하여 상세히 설명하면 다음과 같다. 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법의 특징 및 이점들은 이하에서의 각 실시 예에 대한 상세한 설명을 통해 명백해질 것이다. 도 1은 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법 의 개념을 나타낸 구성도이다. 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법은 딥러 닝 영상 분할의 결과물을 출력하기 직전에 이미지 처리를 수행하여 효율적인 하드웨어 사용으로 정확도를 높일 수 있도록 한 것이다. 이를 위하여 본 발명은 인공 신경망 적용 객체 감지 과정에서 하드웨어에 가중되는 작업을 억제하면서 데이터의 전처리 정밀도와 다른 환경을 지닌 영상에 따라 결과물은 달라지는 문제를 해결할 수 있도록 하기 위한 구성을 포함할 수 있다. 본 발명은 인공지능 처리에서의 불필요하게 가중되는 연산 작업을 줄이면서 객체의 탐지 이후의 출력에 대해 영 상처리를 통하여 검출된 결과의 정확도를 높일 수 있도록 하는 구성을 포함할 수 있다. 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템은 도 1에서와 같이, 영상 분할의 정밀도를 높이기 위해 딥러닝 영상 분할의 결과물을 출력하기 직전에, 이미지 내의 픽셀이 가지고 있는 값에 대해 색상정보 변화를 감지하여 이미지에 있는 물체의 외곽선을 나타내는 에지 검출을 하고, 에지 검출을 수행한 이미지와 영상 분할로 수행된 외곽선과 일치하는지 비교하여 결과 이미지를 최적화하는 구 성을 포함하고, 간단한 이미지 처리를 하는 것이다. 도 2는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템의 구성 블록도이다. 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템은 도 2에서와 같이, 객체 검출을 위한 영상 데이터를 입력하는 영상 데이터 입력부와, 객체 인식 인공지능 작업을 수행하 는 딥러닝 프로세싱부와, 딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지 정하여 영상 분할 후 엣지 검출 단계를 수행하는 영상분할후 엣지 검출부와, 영상 데이터 입력부를 통 하여 입력된 원본 이미지의 엣지 검출을 수행하는 엣지 검출부와, 영상분할후 엣지 검출부 및 엣지 검 출부에서 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 수행하는 엣지 이미지 비교부, 엣지 이미지 비교부의 비교 결 과를 기준으로 결과 값을 반영하지 않은 이미지를 불러와 출력하거나, 결과 값을 원본 이미지에 반영하여 결과 이미지 최적화 출력을 하는 결과 이미지 최적화부를 포함한다. 여기서, 딥러닝 프로세싱부는 이미지 데이터가 입력되면, 입력 원본을 임시저장하고, 인식할 객체 데이터학 습 모델을 불러와 객체 인식 인공지능 작업을 수행하고 수행 결과 이미지의 임시 저장 및 객체 위치 전송을 하 는 객체 인식 인공지능 작업 단계를 수행한다. 그리고 결과 이미지 최적화부는 인공지능 객체 검출 중앙값과 비교하여 변화가 기준값보다 크거나, 인공지 능 객체 검출 영역과 비교하여 변화가 기준값보다 크면 관심 영역의 결과 값을 반영하지 않은 이미지를 불러와 결과 이미지로 출력한다. 그리고 결과 이미지 최적화부는 인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 작거나 검출 영역 외곽선 잡음의 양이 기준값보다 작으면 영상 처리로 수행된 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력한다. 그리고 결과 이미지 최적화부는 검출 영역 외곽선 잡음의 양이 기준값보다 많으면 두 개의 객체 영역의 중 간 값을 가지는 영역으로 보정 연산을 하고 관심 영역의 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력한다. 도 3은 본 발명에 따른 영상 분할후 엣지 검출부의 상세 구성도이다. 본 발명에 따른 영상 분할후 엣지 검출부는 딥러닝 프로세싱에 의해 인식된 객체 위치를 토대로 원본영상에 서의 관심영역 지정하는 관심 영역 지정부와, 영상 분할 후 엣지 검출을 위하여 관심 영역 이진화(회색조) 변환을 수행하는 이진화 변환 수행부와, 회색조 이미지의 외곽선 검출을 수행하는 외곽선 검출부와, 외 곽선 데이터 내 잡음을 제거하기 위해 중간 값 필터 연산을 하는 필터 연산부와, 외곽선 데이터를 뚜렷하게 하기 위한 라플라스 연산을 수행하는 라플라스 연산부와, 객체 위치를 활용하여 중심점 연산을 하는 중심점 연산부와, 컨벌루션 기법으로 이진화 외곽선 검출 객체 데이터의 중심점에서 값이 없는 부분을 찾는 연산을 하고 값이 없는 부분 검출 이후 해당 위치를 중심으로 하여 객체 외곽선 까지 색상 채우기를 하는 컨벌루션 연 산 및 색상 처리부를 포함한다. 도 4는 엣지 이미지 비교부의 상세 구성도이다. 본 발명에 따른 엣지 이미지 비교부는 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 통하여, 객체 중심점 위치 변화 크기 차 이를 비교하는 중심점 위치 비교부와, 검출된 객체 영역 크기 차이를 비교하는 객체인식 영역 비교부와, 검출 영역 외곽선 잡음의 양을 비교하는 외곽선 잡음 비교부를 포함한다. 도 5는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법을 나타낸 플로우 차트이다. 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법은 딥러닝을 통하 여 영상 분할이 먼저 진행된 데이터에 후처리를 진행하는 것이다. 딥러닝이 수행된 이미지는 경계선이 완벽히 정돈되지 않은 상태로 본다. 1차로 수행된 이미지의 정확도를 높이 기 위하여 후처리를 수행한다. 후처리는 영상처리 방법 중 에지 검출을 진행한다. 에지 검출이란, 이미지 내의 픽셀이 가지고 있는 값에 대해 대체로 색상정보 변화를 감지하여 이미지에 있는 물 체의 외곽선을 나타내는 것이다. 에지 검출을 수행한 이미지는 영상에서 외곽선을 나타내게 되고 영상 분할로 수행된 외곽선과 일치하는지 비교 하게 된다. 이와 같은 두 과정 이후 나온 데이터에서 유사한 위치에 있는 외곽선이라면 추론으로 나온 딥러닝보다 에지 검 출로 나온 것이 실제 데이터로 나온 것이기 때문에 더 정확하다. 만약, 여기서 위치 오차가 크다면 데이터 보정 을 하지 않는다. 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법은 먼저, 이미지 데이터가 입력되면, 입력 원본을 임시저장하고(S502), 인식할 객체 데이터학습 모델을 불러와 객체 인식 인공지 능 작업을 수행하고 수행 결과 이미지의 임시 저장 및 객체 위치 전송을 하는 객체 인식 인공지능 작업 단계를 수행한다.(S501) 이어, 인식된 객체 위치를 토대로 원본영상에서의 관심영역 지정하고, 영상 분할 후 엣지 검출을 위하여 관심 영역 이진화(회색조) 변환 수행, 회색조 이미지의 외곽선 검출 수행, 외곽선 데이터 내 잡음을 제거하기 위해 중간 값 필터 연산 및 외곽선 데이터를 뚜렷하게 하기 위한 라플라스 연산 및 객체 위치를 활용하여 중심점 연 산을 하고, 이진화 외곽선 검출 객체 데이터의 중심점에서 값이 없는 부분을 찾는 연산(컨벌루션 기법 활용)을 하고 값이 없는 부분 검출 이후 해당 위치를 중심으로 하여 객체 외곽선 까지 색상 채우기를 하는 영상 분할 후 엣지 검출 단계를 수행한다.(S503) 그리고 처리된 결과물 중심점 및 객체인식 직후 결과물 중심점 위치의 비교 및 처리된 결과물과 객체인식 직후 결과물의 객체 인식 영역의 비교를 통하여, 객체 중심점 위치 변화 크기 차이, 검출된 객체 영역 비교 크기 차 이, 검출 영역 외곽선 잡음의 양을 각각 판단하는 엣지 이미지 비교 단계를 수행한다.(S504) 이어, 인공지능 객체 검출 중앙값과 비교하여 변화가 기준값보다 크거나, 인공지능 객체 검출 영역과 비교하여 변화가 기준값보다 크면 관심 영역의 결과 값을 반영하지 않은 이미지를 불러와 출력하고, 인공지능 객체 검출영역과 비교하여 변화가 기준값보다 작거나 검출 영역 외곽선 잡음의 양이 기준값보다 작으면 영상 처리로 수행 된 결과 값을 원본 이미지에 반영하여 결과 이미지를 출력하고, 검출 영역 외곽선 잡음의 양이 기준값보다 많으 면 두 개의 객체 영역의 중간 값을 가지는 영역으로 보정 연산을 하고 관심 영역의 결과 값을 원본 이미지에 반 영여 출력하는 결과 이미지 최적화 출력 단계를 수행한다.(S505) 이와 같은 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법은 인공지능의 영상 분할(Instance Segmentation) 사용시 생기는 객체 감지 범위(해당 객체 모양이 잘린 부 분)를 커버하기 위하여 후처리 프로세스를 진행하여 신경망의 깊이를 더 늘릴 필요없이 하드웨어 사용량을 감소 시킬 수 있도록 한 것이다. 객체를 정확하게 검출하여야 하는 로봇, 의료 분야의 검출 시스템 등에서는 실시간 동작시에 소규모 하드웨어는 깊은 연산을 하지 못하므로 사용량을 감축시켜야 하는데, 본 발명은 하드웨어의 사용량을 줄여 기기의 가격과 부하를 감소시킬 수 있도록 한다. 도 6a 내지 도 6f는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방 법을 적용한 결과를 나타낸 구성도이다. 도 6a는 본 발명에 따른 딥 러닝 및 이미지 처리 5회차 비교 이미지를 나타낸 것으로, 보정전 이미지(상), 단순 딥러닝 처리 이미지(하)이다. 도 6b는 딥러닝 처리 결과물과 이미지 처리 결과물의 차이를 비교한 것이다. 도 6c는 물체의 차이를 확인할 수 있는 아랫부분 이미지, 딥러닝과 이미지 후처리를 통한 외곽 비교 이미지, 두 가지 처리 사용 후의 영역 보정 이미지를 나타낸 것이다. 도 6d는 딥러닝과 이미지 후처리를 통해 나온 결과를 보정후 결과 이미지에 사용하여 개선되는 부분(사각 표시 부분) 및 딥러닝 결과에 이미지 후처리를 보정시의 개선 상태를 나타낸 것이다. 도 6e는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방 법의 5회차 처리시의 오차 확인 구성을 나타낸 것이다. 도 6f는 5개의 다른 이미지에 대한 처리 결과를 비교한 것이다. 이상에서 설명한 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스 템 및 방법은 딥러닝 영상 분할의 결과물을 출력하기 직전에 이미지 처리를 수행하여 효율적인 하드웨어 사용으 로 정확도를 높일 수 있도록 한 것이다. 이상에서의 설명에서와 같이 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 변형된 형태로 본 발명이 구 현되어 있음을 이해할 수 있을 것이다. 그러므로 명시된 실시 예들은 한정적인 관점이 아니라 설명적인 관점에서 고려되어야 하고, 본 발명의 범위는 전술한 설명이 아니라 특허청구 범위에 나타나 있으며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명에 포함된 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0141163", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템 및 방법 의 개념을 나타낸 구성도 도 2는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 시스템의 구성 블록도 도 3은 본 발명에 따른 영상 분할후 엣지 검출부의 상세 구성도 도 4는 엣지 이미지 비교부의 상세 구성도 도 5는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방법을 나타낸 플로우 차트도 6a 내지 도 6f는 본 발명에 따른 인공 신경망 적용 객체 감지 과정에서의 효과적인 하드웨어 사용을 위한 방 법을 적용한 결과를 나타낸 구성도"}
