{"patent_id": "10-2021-0051963", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0145198", "출원번호": "10-2021-0051963", "발명의 명칭": "접합 구조물을 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김태정"}}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 적어도 하나의 개구가 형성된 제1 구조물; 상기 제1 구조물과 결합되기 위한 적어도 하나의 돌출부를 포함하는 제2 구조물; 및 상기 돌출부 측면의 적어도 일 부분을 감싸도록 형성된 지지구조를 포함하고, 상기 돌출부는, 상기 개구와 인접한 제1 구조물의 상면과 접촉면을 형성하는 제1 용접 부분, 상기 개구를 형성하는 제1 구조물의 내측면과 접촉면을 형성하는 제2 용접 부분, 및 상기 개구와 인접한 제1 구조물의 하면과 접촉면을 형성하는제3 용접 부분을 포함하는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에서, 상기 돌출부는 상기 제1 구조물에 형성된 상기 개구에 관통하여 삽입되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에서, 상기 지지구조는 상기 제1 구조물 또는 상기 제2 구조물로부터 연장되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에서,상기 제1 용접 부분 내지 상기 제3 용접 부분 각각에 대하여 적어도 일부는 상기 제1 구조물 및 상기 제2 구조물 간 마찰과 교반에 의해 용접되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에서, 상기 돌출부가 가압되어 리벳팅(riveting)을 형성하고 상기 제1 용접 부분이 형성되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에서,상기 접촉면은 상기 제1 용접 부분, 상기 제2 용접 부분 및 상기 제3 용접 부분 순서로 형성되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2022-0145198-3-제1항에서, 상기 제1 용접 부분 내지 제3 용접 부분 각각에 대하여 적어도 일부는 상기 제1 구조물 및 상기 제2 구조물의접합계면에 Lamellar Layer를 포함하는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에서, 상기 제2 구조물에 포함된 상기 돌출부는 상기 제1 구조물에 형성된 상기 개구에 관통하여 삽입되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에서, 상기 제1 구조물 및 상기 제2 구조물은 이종 또는 동종 금속 재료로 포함하는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "전자 장치에 있어서, 적어도 하나의 개구가 형성된 제1 구조물; 상기 제1 구조물과 결합되기 위한 적어도 하나의 돌출부를 포함하는 제2 구조물; 및 상기 돌출부 측면의 적어도 일 부분을 감싸도록 형성된 지지구조를 포함하고,상기 돌출부는, 상기 개구와 인접한 제1 구조물의 하면에 접촉면을 형성하는 용접 부분을 포함하고, 상기 제3 용접 부분은 상기 제1 구조물과 상기 제2 구조물 간 마찰과 교반에 의한 고상 용접에 의한 접촉면인전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에서,상기 돌출부는 상기 제1 구조물에 형성된 상기 개구에 관통하여 삽입되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에서,상기 지지구조 는 상기 제1 구조물 또는 상기 제2 구조물로부터 연장되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에서,상기 돌출부는 상기 개구와 인접한 제1 구조물의 상면과 접촉면을 형성하는 제1 용접 부분, 상기 개구를 형성하는 제1 구조물의 내측면과 접촉면을 형성하는 제2 용접 부분을 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2022-0145198-4-제10항에서,상기 접촉면은 상기 제1 용접 부분, 상기 제2 용접 부분 및 상기 제3 용접 부분 순서로 형성되는 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에서,상기 제1 구조물 및 상기 제2 구조물은 동종 또는 이종의 금속 재료로 형성된 전자 장치."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자장치에 포함되는 복수의 구조물의 용접 방법에 있어서,제2 구조물에 포함된 돌출부를 제1 구조물에 형성된 개구에 관통하여 결합하는 과정; 상기 개구와 인접한 제1 구조물의 상면과 상기 제2 구조물이 접촉하는 제1 용접 부분을 형성하는 과정;상기 개구를 형성하는 제1 구조물의 내측면과 상기 제2 구조물이 접촉하는 제2 용접 부분을 형성하는 과정; 및 상기 개구와 인접한 제1 구조물의 하면과 상기 제2 구조물이 접촉하는 제3 용접 부분을 형성하는 과정을 포함하고, 상기 제1 구조물 또는 상기 2 구조물로부터 연장되고, 상기 돌출부 측면의 적어도 일 부분을 감싸도록 형성된지지구조를 포함하는 방법."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제2 구조물에 포함된 상기 돌출부는 상기 제1 구조물에 형성된 상기 개구에 관통하여 삽입되는 과정; 및상기 관통된 돌출부의 상단이 리벳팅 되면서 상기 제1 구조물과 기구적으로 결합하는 과정을 더 포함하는 방법."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 제1 구조물 및 상기 제2 구조물은 이종 또는 동종의 금속 재료를 포함하고, 상기 제1 용접 부분 내지 제3용접 부분 각각에 대하여 적어도 일부는 상기 제1 구조물 및 상기 제2 구조물 간 마찰과 교반에 의해 고상 용접되는 방법."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서,상기 돌출부가 가압되어 리벳팅(riveting)을 형성하고 상기 제1 용접 부분을 형성하는 방법."}
{"patent_id": "10-2021-0051963", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 접촉면은 상기 제1 용접 부분, 상기 제2 용접 부분 및 상기 제3 용접 부분 순서로 형성되는 전자 장치.공개특허 10-2022-0145198-5-"}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 전자 장치는 접합된 복수의 구조물을 포함하며, 상기 복수의 구조물은 적어도 하나의 개구가 형성된 제1 구조물 및 상기 제1 구조물과 결합되기 위한 적어도 하나의 돌출부를 포함하는 제2 구조물을 포함하고, 상기 돌출부 측면의 적어도 일 부분을 감싸도록 형성된 지지구조를 포함하고, 상기 돌출부는 상기 개구와 인접한 제1 구조물의 상면과 접촉면을 형성하는 제1 용접 부분, 상기 개구를 형성하는 제1 구조물의 내측면과 접촉면을 형성 하는 제2 용접 부분, 및 상기 개구와 인접한 제1 구조물의 하면과 접촉면을 형성하는 제3 용접 부분을 포함한다."}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 전자 장치에 포함되는 구조물들 간 결합에 관련된 기술에 관한 것이다."}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근에 전자 제품이 소형화, 슬림화, 및 고밀도화 되는 추세에 따라 전자 제품에 포함되는 금속 프레임 또는 전 자 제품이 포함하는 소자들도 함께 소형화와 슬림화가 진행되고 있다. 또한 금속이 가지는 특성에 따라서 금속 프레임 또는 소자들은 각각 여러 종류의 금속 재료로 형성될 수 있다. 일반적으로, 금속 재료는 휴대폰 및 휴대용 전자기기에 사용되는 금속 프레임을 제조하는 재료로 사용된다. 전 자 장치를 제조하기 위하여는 복수의 구조물들을 결합하여야 하는 경우가 발생할 수 있다. 복수의 구조물들은 동종 혹은 이종의 금속 재료일 수 있으며, 따라서 금속 간의 결합에는 다양한 방법이 존재한다. 특히 소형 전자 장치의 대표적인 결합 방법의 몇가지 예를 들면 다음과 같다. 리벳팅(riveting) 혹은 스크류(screw)를 이용한 결합은, 두 금속을 별도의 부재를 이용해 결합하는 방법이며, 부재나 결합부의 구조를 이용한 기구적인 결합이다. 표면의 돌기 혹은 pore(공극)를 이용한 결합은, 금속의 표면에 물리적 혹은 화학적인 처리를 통해 표면을 형성 한 후 유동성을 가지는 다른 소재를 돌기 혹은 pore에 침투 시킨 후 침투된 금속을 고화 시키고, 고화된 금속이 앵커링(anchoring)되며 돌기가 있는 금속과 결합하는 방법이며, 또는 두 금속 사이에 액상의 접착체를 침투시키 고 이 접착체를 경화시켜 결합 시키는 방법도 있다. 용접을 이용한 결합은, 용접(welding)은 금속을 열과 압력으로 접합하는 기술로써 이는 두 물질 사이의 원자간 결합을 이루어 접합하는 것으로, 재료를 절감할 수 있다. 용접은 보통 매우 높은 온도에서 작업이 이루어지므로 레이저나 초음파 혹은 다른 에너지를 통해 금속을 용융시켜 결합시키는 용융 접합 방법이 있다."}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "기존의 금속 결합 방법으로는 기구적인 결합의 경우, 별도의 부재가 필요하며, 결합 구조를 위한 형상이 필요하 므로 별도의 설비 혹은 공정이 필요하며, 이로 인한 설계상의 공간 제약이 따를 수 있다. anchoring(앵커링) 을 이용한 물리적 결합의 경우, anchor effect를 위하여는 결합이 필요한 금속에 돌기 혹은 pore 형성이 필요하며 이를 위해서는 물리 혹은 화학적인 처리가 필요하며, 미세한 돌기 혹은 pore의 특성에 따라 접합 강도에 큰 차 이가 발생할 수 있다. 또한, 미세한 돌기 혹은 pore에 용융금속을 침투 시켜 anchoring하는 경우 침투한 금속이 고화되는 과정에서 체적이 변하고, 이로 인한 접합력 저하가 발생한다. 접착제를 이용할 경우 접합강도는 접작 체의 물리적 특성에 의존할 수 있다. 용융 접합 방법의 경우, 두 금속의 용접은 금속 결합(metallic bonding)을 형성하는 것으로써, 금속의 강도, 전성, 연성, 광택, 열전도성과 전기전도성과 같은 금속의 여러 특성을 가지게 하는 화학 결합이다. 금속결합은 금속에 고르게 퍼져있는 전자와 이온들 간의 전기적인 인력이므로, 전자와 이 온 간의 힘은 매우 크기 때문에 결합을 끊으려면 많은 에너지가 필요하다. 이에, 용융된 접합부 및 주변의 HAZ(heat affect zone: 열영향부)는 경도 및 강도가 저하되고 모재(母材)와는 다른 기계적 특성을 가질 우려가 있다. 또한, 용융 접합으로 인해 용접 bead가 형성되고 bead의 모양 및 크기는 제어가 어렵고, 용접 bead가 형 성되는 용접부 외의 두 금속간의 계면은 완전히 붙어 있지 않을 수 있고 이로 인해 전자기기의 물리적, 전기적 기능에 제약이 발생할 수 있다. 또한, 융점이 다른 두 금속은 용접이 어렵거나 용접온도가 높은 경우 두 금속간 의 계면에서 금속간 화합물이 형성되며, 이로 인해 기계적 특성의 저하가 발생할 수 있고, 접합되는 금속의 용 융을 위한 열원이 필요하며 이에 따른 유해광선 및 유해가스가 발생할 수 있다. 본 개시는 동종 혹은 이종의 금속 구조물 간의 결합에 있어서 리벳팅을 이용한 기구적 결합 및용접을 통한 화학 적 결합을 이용하여 개선된 구조물 간의 결합 방법을 제안한다. 본 개시는, 동족 혹은 이종 금속간의 안정적이고 효율적인 접합을 구현하기 위한 방법 및 접합 구조물을 제공한 다. 본 개시는, 단순한 접합 구조를 통해 용융 용접보다 건전한 접합면을 형성하는 방법 및 접합 구조물을 제공한다. 본 개시의 일 실시예에 따르면 범용 공작기계를 이용한 접합으로 편리한 기술접근과 공정셋업을 달성할 수 있으 며 열원, 유해광선, 또는 유해가스의 발생이 없는 친환경적 금속 접합을 이룰 수 있다."}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따른 전자 장치는, 적어도 하나의 개구가 형성된 제1 구조물, 상기 제1 구조물과 결 합되기 위한 적어도 하나의 돌출부를 포함하는 제2 구조물 및 상기 돌출부 측면의 적어도 일 부분을 감싸도록 형성된 지지 구조를 포함하고, 상기 돌출부는, 상기 개구와 인접한 제1 구조물의 상면과 접촉면을 형성하는 제1 용접 부분, 상기 개구를 형성하는 제1 구조물의 내측면과 접촉면을 형성하는 제2 용접 부분, 및 상기 개구와 인 접한 제1 구조물의 하면과 접촉면을 형성하는 제3 용접 부분을 포함할 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 적어도 하나의 개구가 형성된 제1 구조물, 상기 제1 구조물과 결 합되기 위한 적어도 하나의 돌출부를 포함하는 제2 구조물 및 상기 돌출부 측면의 적어도 일 부분을 감싸도록 형성된 지지부재를 포함하고, 상기 돌출부는, 상기 개구와 인접한 제1 구조물의 하면에 접촉면을 형성하는 용접 부분을 포함하고, 상기 용접 부분은 상기 제1 구조물과 상기 제2 구조물의 마찰과 교반에 의한 고상 용접에 의 한 접촉면이고, 상기 용접 부분은 상기 개구와 인접한 상기 제1 구조물의 상면과 평행하게 형성될 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 제2 구조물에 포함된 돌출부를 제1 구조물에 형성된 개구에 관통 하여 결합하는 과정, 상기 개구와 인접한 제1 구조물의 상면과 상기 제2 구조물이 접촉하는 제1 용접 부분을 형 성하는 과정, 상기 개구를 형성하는 제1 구조물의 내측면과 상기 제2 구조물이 접촉하는 제2 용접 부분을 형성 하는 과정 및 상기 개구와 인접한 제1 구조물의 하면과 상기 제2 구조물이 접촉하는 제3 용접 부분을 형성하는 과정을 포함하고, 상기 제1 구조물 또는 제상기 2 구조물로부터 연장되고, 상기 돌출부 측면의 적어도 일 부분 을 감싸도록 형성된 지지 구조를 포함할 수 있다."}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예에 따른 전자 장치는, 기구적 결합력과 용접 결합력이 동시에 발현되어 높은 접합력을 가질 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 물리적 특성이 다른 이종 금속의 결합이 용이할 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 접합구조를 간단하고 소형화 할 수 있어 완성품의 경량화, 및/또 는 소형화가 가능할 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 접합 계면이 건전하고 치밀해 전자기기의 물리적, 및/또는 전기 적 특성을 향상시킬 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 범용 공작기계를 사용할 수 있어 접합을 위한 설비 활용에 유리 해질 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 공정 셋업과 자동화 구현이 용이해질 수 있다. 본 개시의 다양한 실시예에 따른 전자 장치는, 열원, 용접봉, 용제, 유해광선, 및/또는 유해가스가 없어 환경 친화적이 될 수 있다."}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 개시의 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)을 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서(AP)), 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그 래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세 서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 또는 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로 서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성 요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프 로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지 능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈는 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈는, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치) (예: 스피커 또는 헤드폰))를 통 해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치이 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다.연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자은, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버)간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있 다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)으로 통합되거나, 또는 서로 별도의 복수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 및/또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB(printed circuit board)) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈(19 7)은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크 와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈 에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안 테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방 사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))를 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104 또는 108) 중 하나 이상의 외부 장치들에서 실행될 수 있다. 예 를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반 응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적 으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있 다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내 에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치)에 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서,'비일시적'은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우 와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2는 본 개시의 다양한 실시예에 따른, 전자 장치의 전면 사시도이다. 도 3은 본 개시의 다양한 실시예에 따 른, 전자 장치의 후면 사시도이다. 도 2 및 도 3을 참조하면, 일 실시예에 따른 전자 장치는, 전면(310A), 후면(310B), 및 전면(310A) 및 후 면(310B) 사이의 공간을 둘러싸는 측면(310C)을 포함하는 하우징을 포함할 수 있다. 다른 실시예(미도시) 에서는, 상기 하우징은, 도 2의 전면(310A), 도 3의 후면(310B) 및 측면(310C)들 중 일부를 형성하는 구조 를 지칭할 수도 있다. 일 실시예에 따르면, 상기 전면(310A)은 적어도 일부분이 실질적으로 투명한 전면 플레이 트(예: 다양한 코팅 레이어들을 포함하는 글라스 플레이트, 또는 폴리머 플레이트)에 의하여 형성될 수 있 다. 후면(310B)은 후면 플레이트에 의하여 형성될 수 있다. 상기 후면 플레이트는, 예를 들어, 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 상기 측면(310C)은, 전면 플레이트 및 후면 플레이트와 결합하며, 금 속 및/또는 폴리머를 포함하는 측면 베젤 구조 (또는 \"측면 부재\")에 의하여 형성될 수 있다. 어떤 실시예 에서는, 후면 플레이트 및 측면 베젤 구조는 일체로 형성되고 동일한 물질(예: 유리, 알루미늄과 같 은 금속 물질 또는 세라믹)을 포함할 수 있다. 도시된 실시예에서는, 상기 전면 플레이트는, 상기 전면(310A)으로부터 상기 후면 플레이트 쪽으로 휘어져 심리스하게(seamless) 연장된 2개의 제1 엣지 영역(310D)들을, 상기 전면 플레이트의 긴 엣지(long edge) 양단에 포함할 수 있다. 도시된 실시예(도 3 참조)에서, 상기 후면 플레이트는, 상기 후면(310B)으 로부터 상기 전면 플레이트 쪽으로 휘어져 심리스하게 연장된 2개의 제2 엣지 영역(310E)들을 긴 엣지 양 단에 포함할 수 있다. 어떤 실시예에서는, 상기 전면 플레이트(또는 상기 후면 플레이트)가 상기 제1 엣지 영역(310D)들(또는 상기 제2 엣지 영역(310E)들) 중 하나 만을 포함할 수 있다. 다른 실시예에서는, 상기 제1 엣지 영역(310D)들 또는 제2 엣지 영역(310E)들 중 일부가 포함되지 않을 수 있다. 상기 실시예들에서, 상 기 전자 장치의 측면에서 볼 때, 측면 베젤 구조는, 상기와 같은 제1 엣지 영역(310D)들 또는 제2 엣 지 영역(310E)들이 포함되지 않는 측면 쪽에서는 제1 두께(또는 폭)을 가지고, 상기 제1 엣지 영역(310D)들 또 는 제2 엣지 영역(310E)들을 포함한 측면 쪽에서는 상기 제1 두께보다 얇은 제2 두께를 가질 수 있다.일 실시예에 따르면, 전자 장치는, 디스플레이(예: 도 1의 표시장치), 오디오 모듈(303, 307, 314)(예: 도 1의 오디오 모듈), 센서 모듈(예: 도 1의 센서 모듈), 카메라 모듈(305, 312, 313)(예: 도 1의 카메라 모듈), 키 입력 장치(예: 도 1의 입력 장치), 및 커넥터 홀(308, 309)(예: 도 1 의 연결 단자) 중 적어도 하나 이상을 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나(예: 커넥터 홀)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 일 실시예에 따르면, 디스플레이는, 예를 들어, 전면 플레이트의 상당 부분을 통하여 시각적으로 노 출될 수 있다. 어떤 실시예에서는, 상기 전면(310A), 및 상기 제1 엣지 영역(310D)들을 형성하는 전면 플레이트 를 통하여 상기 디스플레이의 적어도 일부가 노출될 수 있다. 어떤 실시예에서는, 디스플레이의 모서리를 상기 전면 플레이트의 인접한 외곽 형상과 대체로 동일하게 형성할 수 있다. 다른 실시예(미도시)에서는, 디스플레이가 노출되는 면적을 확장하기 위하여, 디스플레이의 외곽과 전면 플레이트의 외곽간의 간격이 대체로 동일하게 형성될 수 있다. 일 실시예에 따르면, 하우징의 표면(또는 전면 플레이트)은 디스플레이가 시각적으로 노출됨에 따라 형성되는 화면 표시 영역을 포함할 수 있다. 일례로, 화면 표시 영역은 전면(310A), 및 제1 엣지 영역 (310D)들을 포함할 수 있다. 다른 실시예(미도시)에서는, 디스플레이의 화면 표시 영역(예: 전면(310A), 제1 엣지 영역(310D))의 일부 에 리세스 또는 개구부(opening)를 형성하고, 상기 리세스 또는 상기 개구부(opening)와 정렬되는 오디오 모듈 , 센서 모듈(미도시), 발광 소자(미도시), 및 카메라 모듈 중 적어도 하나 이상을 포함할 수 있다. 다른 실시예(미도시)에서는, 디스플레이의 화면 표시 영역의 배면에, 오디오 모듈, 센서 모듈(미도시), 카메라 모듈, 지문 센서(미도시), 및 발광 소자(미도시) 중 적어도 하나 이상을 포함할 수 있다. 일 실시예에 따르면, 디스플레이의 하단 방향에 적어도 하나의 카메라 모듈(305, 312)이 배치될 수 있다. 예를 들면, 제 1 카메라 모듈은 카메라 화각(FOV, field of view)에 대응하는 디스플레이의 적어도 일부 영역에 배치될 수 있다. 제1 카메라 모듈이 카메라 화각(FOV)에 대응되는 디스플레이의 적어도 일부 영역에 배치됨에 따라, 제 1 카메라 모듈의 위치가 시각적으로 구별(또는 노출)되지 않을 수 있다. 일 실시예에 따르면, 디스플레이를 제1 면(310A)에서 볼 때, 제 1 카메라 모듈은 디스플레이의 적어도 일부인, 카메라 화각(FOV)에 대응되는 부분에 배치되어, 외부로 시각적으로 노출되지 않으면서, 외부 피 사체의 이미지를 획득할 수 있다. 예를 들면, 제 1 카메라 모듈은 디스플레이 배면 카메라(UDC, under display camera)일 수 있다. 일 실시예에서, 전자 장치는, 슬라이딩 운동 가능하게 배치되어 화면(예: 디스플레이 영역)을 제공하는 디 스플레이(미도시)를 포함할 수 있다. 예를 들면, 전자 장치의 디스플레이 영역은, 시각적으로 노출되어 이 미지를 출력 가능하게 하는 영역일 수 있다. 일 예시에서, 전자 장치는 슬라이딩 플레이트(미도시)의 이동 또는 디스플레이의 이동에 따라 디스플레이 영역을 조절할 수 있다. 예를 들어, 전자 장치는, 전자 장치 의 적어도 일부(예: 하우징)가 적어도 부분적으로 슬라이딩 가능하게 동작함으로써, 디스플레이 영역 의 선택적인 확장을 도모할 수 있도록 구성되는 롤러블(rollable) 방식의 전자 장치를 포함할 수 있다. 상술한 디스플레이는, 예를 들어, 슬라이드 아웃 디스플레이(slide-out display) 또는 익스펜더블 디스플레이 (expandable display)로 지칭될 수도 있다. 다른 실시예(미도시)에서는, 디스플레이는, 터치 감지 회로, 터치의 세기(압력)를 측정할 수 있는 압력 센 서, 및/또는 자기장 방식의 스타일러스 펜을 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 어떤 실시예에서는, 상기 키 입력 장치의 적어도 일부가, 상기 제1 엣지 영역(310D)들, 및/또는 상기 제2 엣지 영역(310E)들에 배치될 수 있다. 일 실시예에 따르면, 오디오 모듈(303, 307, 314)은, 예를 들면, 마이크 홀 및 스피커 홀(307, 314)을 포 함할 수 있다. 마이크 홀은 외부의 소리를 획득하기 위한 마이크가 내부에 배치될 수 있고, 어떤 실시예에 서는 소리의 방향을 감지할 수 있도록 복수개의 마이크가 배치될 수 있다. 스피커 홀(307, 314)은, 외부 스피커 홀 및 통화용 리시버 홀을 포함할 수 있다. 어떤 실시예에서는 스피커 홀(307, 314)과 마이크 홀 이 하나의 홀로 구현 되거나, 스피커 홀(307, 314) 없이 스피커가 포함될 수 있다(예: 피에조 스피커). 오 디오 모듈(303, 307, 314)은 상기 구조에 한정된 것은 아니며, 전자 장치의 구조에 따라 일부 오디오 모듈 만 장착되거나 새로운 오디오 모듈이 부가되는 등 다양하게 설계 변경할 수 있다.일 실시예에 따르면, 센서 모듈(미도시)은, 예를 들면, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(미도시)은, 예를 들어, 하우징의 전면(310A)에 배치된 제1 센서 모듈(예: 근접 센서) 및/또는 제2 센서 모듈(예: 지문 센서), 및/또는 상기 하우 징의 후면(310B)에 배치된 제3 센서 모듈(예: HRM 센서) 및/또는 제4 센서 모듈(예: 지문 센서)을 포함할 수 있다. 어떤 실시 예에서(미도시), 상기 지문 센서는 하우징의 전면(310A)(예: 디스플레이)뿐만 아 니라 후면(310B)에 배치될 수 있다. 전자 장치는, 도시되지 않은 센서 모듈, 예를 들어, 제스처 센서, 자 이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온 도 센서, 습도 센서, 또는 조도 센서 중 적어도 하나를 더 포함할 수 있다. 상기 센서 모듈은 상기 구조에 한정 된 것은 아니며, 전자 장치의 구조에 따라 일부 센서 모듈만 장착되거나 새로운 센서 모듈이 부가되는 등 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 카메라 모듈(305, 312, 313)은, 예를 들면, 전자 장치의 전면(310A)에 배치된 전면 카메라 모듈, 및 후면(310B)에 배치된 후면 카메라 모듈, 및/또는 플래시를 포함할 수 있다. 상 기 카메라 모듈(305, 312)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함 할 수 있다. 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 어떤 실 시예에서는, 2개 이상의 렌즈들 (적외선 카메라, 광각 및 망원 렌즈) 및 이미지 센서들이 전자 장치의 한 면에 배치될 수 있다. 카메라 모듈(305, 312, 313)은 상기 구조에 한정된 것은 아니며, 전자 장치의 구조 에 따라 일부 카메라 모듈만 장착되거나 새로운 카메라 모듈이 부가되는 등 다양하게 설계 변경할 수 있다. 일 실시예에 따르면, 전자 장치는 각각 다른 속성(예: 화각) 또는 기능을 가진 복수의 카메라 모듈들(예: 듀얼 카메라, 또는 트리플 카메라)을 포함할 수 있다. 예를 들면, 서로 다른 화각을 갖는 렌즈를 포함하는 카메 라 모듈(305, 312)이 복수로 구성될 수 있고, 전자 장치는 사용자의 선택에 기반하여, 전자 장치에서 수행되는 카메라 모듈(305, 312)의 화각을 변경하도록 제어할 수 있다. 예를 들면, 상기 복수의 카메라 모듈 (305, 312)들 중 적어도 하나는 광각 카메라이고, 적어도 다른 하나는 망원 카메라일 수 있다. 유사하게, 상기 복수의 카메라 모듈(305, 312)들 중 적어도 하나는 전면 카메라이고, 적어도 다른 하나는 후면 카메라일 수 있 다. 또한, 복수의 카메라 모듈(305, 312)들은, 광각 카메라, 망원 카메라, 또는 IR(infrared) 카메라(예: TOF(time of flight) camera, structured light camera) 중 적어도 하나를 포함할 수 있다. 일 실시 예에 따르 면, IR 카메라는 센서 모듈의 적어도 일부로 동작될 수 있다. 예를 들어, TOF 카메라는 피사체와의 거리를 감지 하기 위한 센서 모듈(미도시)의 적어도 일부로 동작될 수 있다. 일 실시예에 따르면, 키 입력 장치는, 하우징의 측면(310C)에 배치될 수 있다. 다른 실시 예에서는, 전자 장치는 상기 언급된 키 입력 장치 중 일부 또는 전부를 포함하지 않을 수 있고 포함되지 않은 키 입력 장치는 디스플레이 상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 어떤 실시예에서, 키 입력 장치는 하우징의 제2 면(310B)에 배치된 센서 모듈(미도시)을 포함할 수 있다. 일 실시예에 따르면, 발광 소자(미도시)는, 예를 들어, 하우징의 전면(310A)에 배치될 수 있다. 발광 소자 (미도시)는, 예를 들어, 전자 장치의 상태 정보를 광 형태로 제공할 수 있다. 다른 실시 예에서, 발광 소 자(미도시)는, 예를 들어, 전면 카메라 모듈의 동작과 연동되는 광원을 제공할 수 있다. 발광 소자(미도시)는, 예를 들어, LED, IR LED 및/또는 제논 램프를 포함할 수 있다. 일 실시예에 따르면, 커넥터 홀(308, 309)은, 예를 들면, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥터(예를 들어, USB 커넥터)를 수용할 수 있는 제1 커넥터 홀, 및/또는 외부 전자 장치와 오디오 신호를 송수신하기 위한 커넥터를 수용할 수 있는 제2 커넥터 홀(예를 들어, 이어폰 잭)을 포함할 수 있다. 일 실시예에 따르면, 카메라 모듈들(305, 312) 중 일부 카메라 모듈, 및/또는 센서 모듈(미도시)들 중 일 부 센서 모듈은 디스플레이의 적어도 일부를 통해 외부로 노출되도록 배치될 수 있다. 예를 들어, 카메라 모듈은 디스플레이의 배면에 형성된 홀 또는 리세스의 내부에 배치되는, 펀치 홀 카메라를 포함할 수 있다. 일 실시예에 따르면, 카메라 모듈은 렌즈가 전자 장치의 제2 면(310B)으로 노출되도록 하우징 내부에 배치될 수 있다. 예를 들어, 카메라 모듈은 인쇄 회로 기판(예: 도 4의 인쇄 회로 기판 )에 배치될 수 있다. 일 실시예에 따르면, 카메라 모듈, 및/또는 센서 모듈은 전자 장치의 내부 공간에서, 디스플레이 의, 전면 플레이트까지 투명 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 또한, 일부 센서 모듈(미도시)은 전자 장치의 내부 공간에서 전면 플레이트를 통해 시각적으로 노출되지 않고 그 기능을 수행하도록 배치될 수도 있다. 도 4는 본 개시의 다양한 실시예에 따른, 전자 장치의 분해 사시도이다. 도 4를 참조하면, 다양한 실시예에 따른 전자 장치(예: 도 1 내지 도 3의 전자 장치)는, 측면 베젤 구조(예: 도 2의 측면 베젤 구조), 제1 지지부재, 전면 플레이트(예: 도 2의 전면 플레이 트), 디스플레이(예: 도 2의 디스플레이), 인쇄 회로 기판(예: PCB, FPCB(flexible PCB), 또는 RFPCB(rigid flexible PCB)), 배터리(예: 도 1의 배터리), 제2 지지부재(예: 리어 케이스), 안테나(예: 도 1의 안테나 모듈), 및 후면 플레이트(예: 도 2의 후면 플레이트) 를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나(예: 제1 지지부재, 또는 제2 지지부재)를 생략하거나 다른 구성요소를 추가적으로 포함할 수 있다. 전자 장치의 구성요 소들 중 적어도 하나는, 도 2 또는 도 3의 전자 장치의 구성요소들 중 적어도 하나와 동일, 또는 유사할 수 있으며, 중복되는 설명은 이하 생략한다. 다양한 실시예에 따르면, 제1 지지부재는, 전자 장치 내부에 배치되어 측면 베젤 구조와 연결될 수 있거나, 측면 베젤 구조와 일체로 형성될 수 있다. 제1 지지부재는, 예를 들어, 금속 재질 및/또 는 비금속 (예: 폴리머) 재질로 형성될 수 있다. 제1 지지부재는, 일면에 디스플레이가 결합되고 타 면에 인쇄 회로 기판이 결합될 수 있다. 다양한 실시예에 따르면, 인쇄 회로 기판에는, 프로세서, 메모리, 및/또는 인터페이스가 장착될 수 있다. 프로세서는, 예를 들어, 중앙처리장치, 어플리케이션 프로세서, 그래픽 처리 장치, 이미지 시그널 프로세서, 센 서 허브 프로세서, 또는 커뮤니케이션 프로세서 중 하나 또는 그 이상을 포함할 수 있다. 다양한 실시예에 따르 면, 인쇄 회로 기판은, 가요성 인쇄 회로 기판 유형의 무선 주파수 케이블(flexible printed circuit board type radio frequency cable, FRC)을 포함할 수 있다. 예를 들어, 인쇄 회로 기판은 제1 지지부재 의 적어도 일부에 배치될 수 있고, 안테나 모듈(예: 도 1의 안테나 모듈) 및 통신 모듈(예: 도 1의 통신 모듈)과 전기적으로 연결될 수 있다. 일 실시예에 따르면, 메모리(예: 도 1의 메모리)는, 예를 들어, 휘발성 메모리 또는 비휘발성 메모리를 포 함할 수 있다. 일 실시예에 따르면, 인터페이스(예: 도 1의 인터페이스)는, 예를 들어, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 및/또는 오디오 인터페이 스를 포함할 수 있다. 인터페이스는, 예를 들어, 전자 장치를 외부 전자 장치와 전기적 또는 물리적으로 연결시킬 수 있으며, USB 커넥터, SD 카드/MMC 커넥터, 또는 오디오 커넥터를 포함할 수 있다. 다양한 실시예에 따르면, 배터리(예: 도 1의 배터리)는 전자 장치의 적어도 하나의 구성 요소에 전력을 공급하기 위한 장치로서, 예를 들면, 재충전 불가능한 1차 전지, 또는 재충전 가능한 2차 전지, 또는 연 료 전지를 포함할 수 있다. 배터리의 적어도 일부는, 예를 들어, 인쇄 회로 기판과 실질적으로 동일 평면 상에 배치될 수 있다. 배터리는 전자 장치 내부에 일체로 배치될 수 있고, 전자 장치와 탈 부착 가능하게 배치될 수도 있다. 다양한 실시예에 따르면, 제2 지지 부재(예: 리어 케이스)는, 인쇄 회로 기판과 안테나 사이에 배치될 수 있다. 예를 들면, 제2 지지 부재는, 인쇄 회로 기판 또는 배터리 중 적어도 하나가 결합된 일면, 및 안테나가 결합된 타면을 포함할 수 있다. 다양한 실시예에 따르면, 안테나(예: 도 1의 안테나 모듈)는, 후면 플레이트와 배터리 사 이에 배치될 수 있다. 안테나는, 예를 들어, NFC(near field communication) 안테나, 무선 충전 안테나, 및/또는 MST(magnetic secure transmission) 안테나를 포함할 수 있다. 안테나는, 예를 들어, 외부 장치 와 근거리 통신을 하거나, 충전에 필요한 전력을 무선으로 송수신 할 수 있다. 다른 실시예에서는, 측면 베젤 구조 및/또는 상기 제1 지지부재의 일부 또는 그 조합에 의하여 안테나 구조가 형성될 수 있다. 다양한 실시예에 따르면, 후면 플레이트는 전자 장치의 후면(예: 도 3의 제2 면(310B))의 적어도 일 부를 형성할 수 있다. 도 5는, 본 개시의 일 실시예들에 따른, 구조물들의 접합 상태 및 상기 구조물들의 접합을 위한 구성 부품들의 사시도이다. 다양한 실시예에 따르면, 본 개시는 전자 장치에서 복수의 구조물들의 결합을 위하여 예시로써, 두 구조물 (예: 제1 구조물 및 제2 구조물)의 물리적 결합을 위한 구조(예: 도 6의 610), 두 구조물의 소성 유동을 제어하 기 위한 구조(예: 도 6의 620), 결합용 공구(예: 도 5의 530), 및 결합용 설비(예: 도 5의 540)를 도시한다. 제 1 구조물(예: 도 5의 510)은 A 라는 금속(metal)을, 제2 구조물(예: 도 5의 520)은 B라는 금속을 재료로 하는 구조물이 될 수 있다. 다양한 실시예에 따르면, 제1 구조물(예: 도 5의 510)은 전자 장치에서 전면(310A), 후면(310B), 또는 전 면(310A) 및 후면(310B) 사이의 공간을 둘러싸는 측면(310C)을 이루는 프레임이 될 수 있다. 전면(310A), 후면 (310B) 및 측면(310C)은 플레이트(302, 311, 318)에 의하여 형성될 수 있다. 상기 플레이트(302, 311, 318)는 예를 들어, 금속(예: 알루미늄, 스테인레스 스틸(STS), 마그네슘 또는 상기 물질들 중 적어도 둘의 조합)에 의 하여 형성될 수 있다. 제1 구조물(예: 도 5의 510)은 구멍이 있는 형상(예: 개구(예: 도 5의 511))을 포함 할 수 있다. 다양한 실시예에 따르면, 제2 구조물(예: 도 5의 520)은 전자 장치에서 제1 구조물(예: 도 5의 510)에 포 함된 적어도 하나 이상의 개구(예: 도 5의 511)에 결합되는 적어도 하나 이상의 돌출된 형상(예: 돌출부(예: 도 5의 521))을 포함 할 수 있다. 제2 구조물(예: 도 5의 520)은 예를 들어, 금속(예: 알루미늄, 스테인레스 스틸 (STS), 마그네슘, 또는 상기 물질들 중 적어도 둘의 조합)에 의하여 형성될 수 있다. 다양한 실시예에 따르면, 제1 구조물(예: 도 5의 510) 주변을 제2 구조물(예: 도 5의 520)이 감싸는 구조로 결 합될 수 있다. 제1 구조물(예: 도 5의 510)의 개구(예: 도 5의 511)에 제2 구조물(예: 도 5의 520)의 돌출부(예: 도 5의 521)가 관통하여 삽입되는 구조로 구성될 수 있다. 다양한 실시예에 따르면, 결합용 공구(예: 도 5의 530)은 일 예로, 공구의 상단에 오목한 형상(예: 도 6의 63 0)이 있는 것으로 구성될 수 있다. 일 예로, 공구의 상단에 평면의 형상을 가지는 원기둥 형태 또는 각도가 있 는 원기둥 형태의 공구로 형성될 수 있다. 결합용 설비(예: 도 5의 540)은 결합용 공구(예: 도 5의 530)이 회전 할 수 있는 회전 축을 가지며, 결합용 설비(예: 도 5의 540)는 결합용 공구(예: 도 5의 530)로 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5의 520)의 결합을 위한 구조(예: 도 6의 610)를 누를 수 있는 방향으로 제 어 할 수 있다. 결합용 공구(예: 도 5의 530)의 형상에 따라서 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5의 520)의 접합면이 다르게 형성될 수 있다. 다양한 실시예에 따르면, 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5의 520)의 접합면은 마찰 교반 용 접에 의하여 생성될 수 있다. 결합용 공구(예: 도 5의 530)의 형상이 공구의 상단에 오목한 형상(예: 도 6의 630)인 경우에는 리벳팅(예: 도 7의 710)과 제1 용접부분(예: 도 7의 701), 제2 용접부분(예: 도 7의 702) 및 제3 용접부분(예: 도 7의 703)이 형성될 수 있으며, 결합용 공구(예: 도 5의 530)의 형상이 상단에 평면의 형상 을 가지는 원기둥 형태 또는 각도가 있는 원기둥 형태의 공구로 형성될 경우 리벳팅과 제1 용접부분 이 형성되지 않을 수 있으며, 제2 용접부분 및 제3 용접부분은 형성될 수 있다. 도 6는 본 개시의 일 실시예에 따른, 구조물들의 접합전 결합 상태 및 상기 구조물들의 접합을 위한 툴 구성의 단면도이다. 다양한 실시예에 따르면, 두 구조물(예: 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5의 520))의 단면도 를 통해 물리적 결합을 위한 구조(예: 도 6의 610), 및 두 구조물의 소성 유동을 제어하기 위한 구조(예: 도 6 의 620)를 도시하며, 결합용 공구(예: 도 5의 530)의 단면을 도시한다. 상기 두 구조물(예: 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)), 결합용 공구(예: 도 5의 530) 및 결합용 설비(예: 도 5의 540)에 대한 설명은 도 5에 대한 설명을 준용한다. 다양한 실시예에 따르면, 두 구조물의 결합을 위한 구조(예: 도 6의 610)는 다음과 같이 구성될 수 있다. 제1 구조물 (예: 도 5의 510)는 적어도 일부에 구멍이 있는 형상(예: 개구(예: 도 5의 511))을 포함 할 수 있다. 제2 구조물 (예: 도 5의 520)는 적어도 일부가 돌출된 형상(예: 돌출부(예: 도 5의 521))을 포함 할 수 있다. 제1 구조물 (예: 도 5의 510)의 개구(예: 도 5의 511)에 제2 구조물 (예: 도 5의 520) 의 돌출부(예: 도 5의 521) 가 관통하여 삽입되는 구조로 구성될 수 있다. 두 구조물의 접합(예: 도 7의 701, 702, 703)을 위한 금속의 구 조(예: 도 6의 620)는 일 예로, 제2 구조물 (예: 도 5의 520)가 제1 구조물 (예: 도 5의 510)주변을 둘러싸는 구조로 구성될 수 있다. 다양한 실시예에 따르면, 다음과 같은 동작을 포함 할 수 있다. 두 구조물의 접합을 위하여 결합용 설비(예: 도 5의 540)에 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)를 상, 하, 좌, 우로 유동이 없도록 고정 할 수 있다. 결합용 공구(예: 도 5의 530)는 결합용 설비(예: 도 5의 540)에 장착되고, 회전을 하며 두 구 조물의 결합을 위한 구조(예: 도 6의 610)를 가압할 수 있다. 이때, 결합용 공구(예: 도 5의 530)의 회전과 이 송에 의해 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)는 소성 변형을 일으킬 수 있다. 소성 변형된 금속은 결합용 공구(예: 도 5의 530) 상단의 오목한 형상(예: 도 6의 630)에 의해 리벳(rivet)(예: 도 7 의 710)을 형성하여 기구적인 결합을 일으킬 수 있다. 다양한 실시예에 따르면, 계속된 가압에 의해 두 구조물의 접합면(예: 도 7의 701, 702, 703)에서 마찰과 교반 이 일어나 두 구조물 각각의 표면에 있는 금속의 산화막(미도시)이 파괴될 수 있다. 산화막이 파괴된 제2 구조 물 (예: 도 5의 520)의 상단부(예: 도 7의 701)가 용접이 되어 결합할 수 있다. 다양한 실시예에 따르면, 제2 구조물 (예: 도 5의 520)의 상단부(예: 도 7의 701)의 접합 후에도 하중을 가하면 (예: 도 12의 1210 및 1220) 제1 구조물 (예: 도 5의 510)의 소성유동이 발생할 수 있다. 제1 구조물 (예: 도 5의 510)의 소성유동을 제어하기 위한 구조(예: 도 6의 620)로 인해 제1 구조물 로 가해진 하중은 제2 구조물 방향(예: 도 12의 1210)으로 전달될 수 있다. 이로써, 제2 구조물 (예: 도 5의 520) 방향으로 전달된 하중(예: 도 12의 1210)에 의해 제1 구조물 (예: 도 5의 510)과 제2 구조물 (예: 도 5의 520)이 맞닿고 있는 하단면(예: 도 7의 703)에 있는 산화막(미도시)이 파괴될 수 있다. 산화막이 파괴된 두 구조물(예: 도 5의 510, 520)의 하 단면(예: 도 7의 703)는 용접이 되어 결합할 수 있다. 다양한 실시예에 따르면, 두 구조물(예: 도 5의 510, 520)의 결합의 순서는, 제2 구조물 (예: 도 5의 520)의 돌 출부(예: 도 5의 521) 상단이 리벳팅(riveting)에 의해 기구적으로 결합되고, 제1 구조물 (예: 도 5의 510)의 개구(예: 도 5의 511)와 인접한 두 구조물(예: 도 5의 510, 520)의 상단면(예: 도 7의 701)은 마찰교반에 의해 용접 될 수 있다. 제1 구조물 (예: 도 5의 510)의 개구(예: 도 5의 511)를 형성하는 내부(예: 도 7의 702)와 제 2 구조물 (예: 도 5의 520)의 돌출부(예: 도 5의 521)는 마찰교반에 의해 용접이 될 수 있다. 제1 구조물 (예: 도 5의 510)의 개구(예: 도 5의 511)와 인접한 두 구조물(예: 도 5의 510, 520)이 맞닿고 있는 하단면(예: 도 7 의 703)은 마찰교반에 의해 용접될 수 있다. 다양한 실시예에 따르면, 도 6의 610 및 630에 도시된 구조에 의하면, 제2 구조물 (예: 도 5의 520)의 돌출부 (예: 도 5의 521)와 결합용 공구(예: 도 5의 530)의 형상에 의하여 리벳팅(riveting)되면서(예: 도 7의 710) 기구적인 결합력을 가지게 되며, 리벳팅이 되는 과정에서 제1 구조물 (예: 도 5의 510) 와 제2 구조물 (예: 도 5의 520) 사이에 마찰과 교반이 일어나면서 용접이 발생할 수 있다. 계속되는 결합용 공구(예: 도 5의 530)의 하단 방향(예: 도 6b의 611 방향)으로의 가압에 따라 돌출부(예: 도 5의 521) 및 제1 구조물 (예: 도 5의 510) 의 개구(예: 도 5의 511)와 인접한 접촉면에서 마찰과 교반이 일어나면서 두 구조물(예: 도 5의 510, 520)의 용 접이 발생할 수 있다. 다양한 실시예에 따르면, 도 6a의 620에 도시된 구조에 의하면, 제2 구조물 (예: 도 5의 520)의 돌출부(예: 도 5의 521)의 적어도 일부를 둘러싸고, 제1 구조물 (예: 도 5의 510)의 개구(예: 도 5의 511)과 인접한 지지구조 (예: 도 6a의 601)에 의하여 제1 구조물 (예: 도 5의 510)의 소성유동을 제어할 수 있다. 지지구조 (예: 도 6a 의 601)는 제1 구조물 (예: 도 5의 510) 또는 제2 구조물 (예: 도 5의 520)에서 연장된 구조로써 결합용 공구 (예: 도 5의 530)이 가하는 하중이 제2 구조물 (예: 도 5의 520)가 있는 방향으로 (예: 도 6b의 611) 전달되도 록 하는 구조일 수 있다. 전달된 하중에 의하여 두 금속(예: 도 5의 510, 520)의 접촉면(예: 도 7의 701, 702, 703)에서 마찰과 교반이 일어나면서 용접이 될 수 있다. 다양한 실시예에 따르면, 기구적 결합력과 용접 결합력이 동시에 발현되어 높은 접합력을 가질 수 있으며, 접합 구조를 간단하고 소형화 할 수 있어 완성품의 경량화, 및/또는 소형화가 가능할 수 있으며, 범용 공작기계를 사 용할 수 있어 접합을 위한 설비 활용에 유리하고, 공정 셋업과 자동화 구현이 용이할 수 있다. 다양한 실시예에 따르면, 지지구조(예: 도 6a의 601)는 일 예로, 개구(도 5의 511)의 좌측에 도시된 것처럼, 개 구(예: 도 5의 511)를 형성하는 구조물을 지지하여 결합용 공구(예: 도 5의 530)가 가하는 하중이 제2 구조물 (예: 도 5의 520)이 있는 방향으로 (예: 도 6b의 611) 온전히 전달되도록 할 수 있다. 지지구조(예: 도 6a의 601)는 개구(예: 도 5의 511)를 형성하는 구조물을 지지하는 제2 구조물(예: 도 5의 520)이 연장된 형태일 수 있다. 유사한 형태로 제1 구조물(예: 도 5의 510)이 연장되어 형성될 수 있다. 다양한 실시예에 따르면, 지지구조(예: 도 6b의 601a)는 일 예로, 개구(도 5의 511)를 형성하는 구조물의 우측 에 도시된 것처럼, 개구(예: 도 5의 511)를 형성하는 구조물을 지지하기 위한 강성 확보를 위해 제1 구조물(예: 도 5의 510)은 두꺼운 두께를 갖도록 형성될 수 있다. 다양한 실시예에 따르면, 지지구조 (예: 도 6b의 601b)는, 일 예로, 개구(도 5의 511)의 우측에 도시된 것처럼, 개구(예: 도 5의 511)를 형성하는 구조물을 지지하기 위해 제1 구조물(예: 도 5의 510)은 연장된 형태를 갖도록 형성될 수 있다. 다양한 실시예에 따르면, 지지구조(예: 도 6a의 601, 도 6b의 601a, 도 6b의 601b)는 다양한 형태를 가질 수 있다. 지지구조로 인하여 결합용 공구(예: 도 5의 530)가 가하는 하중이 측면 방향(예: 도 6b의 610)으로 분산 되지 않을 경우 제3 용접부분(예: 도 7의 703)이 형성될 수 있다. 제1구조물(예: 도 5의 510) 및 제2구조물(예: 도 5의 520)에서 연장된 지지구조의 형태는 상술한 예시에 한정되지 않는다. 도 7은 본 개시의 일 실시예에 따른, 접합된 구조물의 단면도이다. 다양한 실시예에 따르면, 본 개시는 전자 장치에 포함된 복수의 구조물(예: 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5의 520))의 물리적 결합을 위한 구조(예: 도 6의 610), 두 구조물의 소성 유동을 제어하 기 위한 구조(예: 도 6의 620), 결합용 공구(예: 도 5의 530), 및 결합용 설비(예: 도 5의 540)를 도시하며, 제 1 구조물 (예: 도 5의 510)및 제2 구조물 (예: 도 5의 520)에 대한 구조는 도 6의 설명을 준용할 수 있다. 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)의 물리적 결합을 위한 구조(예: 도 6의 610) 및 소성 유동을 제어하기 위한 구조(예: 도 6의 620)는 도 6의 설명을 준용할 수 있다. 다양한 실시예에 따르면, 도 7의 710는 제2 구조물 (예: 도 5의 520)의 리벳팅(riveting) 된 돌출부(예: 도 5의 521)를 도시한다. 결합용 공구(예: 도 5의 530)는 회전을 하며 두 구조물의 결합을 위한 구조(예: 도 6의 610) 를 가압할 수 있다. 도 5을 참조하면 결합용 공구(예: 도 5의 530)은 공구의 상단에 오목한 형상(예: 도 6의 630)이 있어 결합용 공구(예: 도 5의 530)로 가압하여 리벳팅 된 돌출부(예: 도 5의 521) 상단에 볼록한 형상 (예: 도 7의 710)을 형성할 수 있다. 다양한 실시예에 따르면, 도 7의 701, 702, 703는 제2 구조물 (예: 도 5의 520)의 돌출부(예: 도 5의 521)에 의한 용접 부분을 도시한다. 돌출부(예: 도 5의 521)는 개구(예: 도 5의 511)와 인접한 제1 구조물(예: 도 5의 510)의 상면과 접촉면을 형성하는 제1 용접 부분(도 7의 701), 개구(예: 도 5의 511)를 형성하는 제1 구조물(예: 도 5의 510)의 내측면과 접촉면을 형성하는 제2 용접 부분(도 7의 702), 및 개구(예: 도 5의 511)와 인접한 제1 구조물(예: 도 5의 510)의 하단면과 제2 구조물(예: 도 5의 520)의 상단면이 맞닿고 있는 접촉면을 형성하는 제3 용접 부분(도 7의 703)을 포함할 수 있다. 다양한 실시예에 따르면, 제1 용접 부분(예: 도 7의 701)은 돌출부(예: 도 5의 521)가 결합용 공구(예: 도 5의 530)에 의해 가압되어 리벳팅(riveting) 되어 기구적으로 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5 의 520)이 결합되는 부분이 될 수 있다. 또한, 결합용 공구(예: 도 5의 530)는 회전하면서 가압하여 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)의 경계면에 있는 산화피막을 파괴하여 용접될 수 있다. 제1 용접 부분(도 7의 701)은 개구(예: 도 5의 511)와 인접한 제1 구조물 (예: 도 5의 510)의 상면에 위치하며 제2 구조물 (예: 도 5의 520)와 접촉면을 이루는 지점에 위치할 수 있다. 다양한 실시예에 따르면, 제2 용접 부분(도 7의 702)은 돌출부(예: 도 5의 521)가 회전하는 결합용 공구(예: 도 5의 530)에 의해 가압되어 기구적으로 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)이 결합되 는 동안 및 그 이후에도 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)의 경계면에 있는 산화피 막을 파괴하여 용접될 수 있다. 제2 용접 부분(도 7의 702)은 개구(예: 도 5의 511)를 형성하는 제1 구조물 (예: 도 5의 510)의 내측면에 위치하며, 제2 구조물 (예: 도 5의 520)와 접촉면을 이루는 지점에 위치할 수 있 다. 제2 용접 부분(예: 도 7의 702)은 제1 용접 부분(예: 도 7의 701)과 서로 수직 방향의 접촉면을 형성할 수 있다. 다양한 실시예에 따르면, 제3 용접 부분(예: 도 7의 703)은 돌출부(예: 도 5의 521)가 회전하는 결합용 공구(예: 도 5의 530)에 의해 가압되어 기구적으로 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의520)이 결합된 이후에도 계속되는 가압에 의해 제1 구조물 (예: 도 5의 510)의 하단 및 제2 구조물 (예: 도 5 의 520)의 상단이 맞닿아 있는 경계면에 있는 산화피막을 파괴하여 용접될 수 있다. 제3 용접 부분(예: 도 7의 703)은 개구(예: 도 5의 511)를 형성하는 제1 구조물 (예: 도 5의 510)의 하단면에 위치하며, 제2 구조물 (예: 도 5의 520)와 접촉면을 이루는 지점에 위치할 수 있다. 제3 용접 부분(예: 도 7의 703)이 마찰과 교반에 의하 여 접촉면에서 용접이 일어나기 위하여는 돌출부(예: 도 5의 521)을 계속적으로 가압하는 힘이 제3 용접 부분 (예: 도 7의 703)까지 도달해야 할 수 있다. 이 경우, 가압하는 힘이 개구(예: 도 5의 511)과 인접한 부분에서 사방으로 퍼지지 않고 가압하는 방향으로 집중되기 위하여 제1 구조물(예: 도 5의 510) 또는 제2 구조물(예: 도 5의 520)에서 연장되는 구조로써 지지구조(예: 도 6의 601)를 더 포함할 수 있다. 다양한 실시예에 따르면, 계속된 가압에 의해 두 구조물의 접합면(예: 도 7의 701, 702, 703)에서 마찰과 교반 이 일어나 두 구조물 각각의 표면에 있는 금속의 산화막(미도시)이 파괴될 수 있다. 일 예로, 제1 구조물과 제2 구조물 간의 교반으로 인해 Lamellar Layer라는 판상의 구조를 가지게 되며 이는 SEM(Scanning Electron Microscope: 주사전자현미경)으로 확인할 수 있다. 도 8은 본 개시의 일 실시예에 따른 구조물들이 접합되기 전을 나타낸 사시도이다. 도 9는 본 개시의 일 실시 예에 따른, 접합 가공을 도시한 사시도이다. 도 10은 도 9에서 도시한 D-D 부분에 대한 단면도를 나타낸 것이다. 다양한 실시예에 의하면, 본 개시는 전자 장치에 포함된 복수의 구조물(예: 제1 구조물 및 제2 구조 물)의 물리적 결합을 위한 구조(예: 도 6의 610), 두 구조물의 소성 유동을 제어하기 위한 구조(예: 도 6 의 620), 결합용 공구(예: 도 5의 530), 및 결합용 설비(예: 도 5의 540)를 도시하며, 제1 구조물 (예: 도 5의 510) 및 제2 구조물 (예: 도 5의 520)에 대한 구조는 도 6의 설명을 준용할 수 있다. 제1 구조물 (예: 도 5의 510)및 제2 구조물 (예: 도 5의 520)의 물리적 결합을 위한 구조(예: 도 6의 610) 및 소성 유동을 제어하기 위 한 구조(예: 도 6의 620)는 도 6의 설명을 준용할 수 있다. 두 구조물(예: 도 5의 510, 520)이 접합된 부분인 리벳팅(riveting) 부분(예: 도 7의 710) 및 제1 내지 제3 용접 부분(예: 도 7의 701, 702, 703)에 대하여는 도 7의 설명을 준용할 수 있다. 다양한 실시예에 의하면, 제1 구조물 (예: 도 5의 510)은 도 8에 도시된 바와 같이 스마트폰의 앞면, 측면 혹은 뒷면을 이루는 프레임이 될 수 있으며 제2 구조물 (예: 도 5의 520)는 제1 구조물 (예: 도 5의 510)에 포함된 적어도 하나 이상의 돌출부(예: 도 5의 511)에 결합되는 적어도 하나 이상의 개구(예: 도 5의 521)가 포함된 구 조물(예: 도 5의 520)을 도시한다. 다양한 실시예에 의하면, 도 10a 내지 도 10c는, 스마트폰의 앞면 또는 뒷면 방향으로 결합용 공구(예: 도 5의 530)가 두 구조물(예: 도 5의 510, 520)의 결합을 위한 구조(예: 도 6 의 610)를 가압하는 일 실시예를 도시한 것이다. 다양한 실시예에 의하면, 도 9에서 도시한 D-D 부분의 단면도를 도시한 도 10a 내지 도 10c에서는 두 구조물(예: 도 5의 510, 520)의 결합 전(도 10a)과 결합 후(도 10b)의 모습 및 도 10b를 확대한 부분 A(도 10c)을 도시하였다. 다양한 실시예에 따르면, 도 10a에서는 제1 구조물(예: 도 5의 510)은 개구(예: 도 5의 511)를 포함하며, 개구 (예: 도 5의 511)와 인접한 상면, 개구를 형성하는 내측면 및 개구와 인접한 하면을 도시한다. 다양한 실시예에 따르면, 제2 구조물(예: 도 5의 520)은 개구(예: 도 5의 511)를 관통하여 삽입되는 돌출부(예: 도 5의 521)을 포함하며, 제2 구조물(예: 도 5의 520)에서 연장된 구성으로써, 돌출부(예: 도 5의 521) 주위를 감싸며 개구(예: 도 5의 511)와 인접한 곳에 지지구조(예: 도 6의 601)를 포함할 수 있다. 다양한 실시예에 따르면, 도 10b에서는 결합용 공구가 두 구조물(예: 도 5의 510, 520)의 결합을 위한 구 조(예: 도 6 의 610)를 가압한 상태를 도시한다. 두 구조물(예: 도 5의 510, 520)의 결합 후(도 10b)의 모습 및 도 10b를 확대한 부분(도 10c)은 결합용 공구(예: 도 5의 530)에 의한 리벳팅 부분(예: 도 7의 710), 개구(예: 도 5의 511)와 인접한 상면에서 접합된 제1 용접 부분(예: 도 7의 701), 개구(예: 도 5의 511)를 형성하는 내측 면에서 접합된 제2 용접 부분(예: 도 7의 702), 및 개구(예: 도 5의 511)와 인접한 하면에서 접합된 제3용접 부 분(예: 도 7의 703)을 도시한다. 도 11a는 레이져 접합된 구조물들의 단면을 도시한 것이다. 도 11b는 본 개시의 일 실시예에 따른 리벳팅 접합을 도시한 것이다. 다양한 실시예에 의하면, 본 개시는 전자 장치에 포함된 복수의 구조물(예: 제1 구조물(도 5의 510) 및 제 2 구조물(도 5의 520))의 물리적 결합을 위한 구조(예: 도 6의 610), 두 구조물의 소성 유동을 제어하기 위한 구조(예: 도 6의 620), 결합용 공구(도 5의 530), 및 결합용 설비(도 5의 540)를 도시하며, 제1 구조물 (예: 도 5의 510)및 제2 구조물 (예: 도 5의 520)에 대한 구조는 도 6의 설명을 준용할 수 있다. 제1 구조물 (예: 도 5 의 510) 및 제2 구조물 (예: 도 5의 520)의 물리적 결합을 위한 구조(예: 도 6의 610) 및 소성 유동을 제어하기 위한 구조(예: 도 6의 620)는 도 6의 설명을 준용할 수 있다. 두 구조물(예: 도 5의 510, 520)이 접합된 부분인 리벳팅(riveting) 부분(예: 도 7의 710) 및 제1 내지 제3 용접 부분(예: 도 7의 701, 702, 703)에 대하여는 도 7의 설명을 준용할 수 있다. 다양한 실시예에 따르면, 도 11b에서의 접합은 리벳팅과 마찰교반에 의하여 용접하는 방식으로써 도 11a에서 도 시된 레이저를 이용한 접합인 레이저 접합과 동종 혹은 이종의 금속을 결합하였을 때의 접합력을 비교한 것이다. 실험에 의하면 일 예로, 레이저 접합은 접합력이 3~8kgf인 반면, 리벳팅 접합은 접합력이 10~50kgf 이 상임을 확인할 수 있다. 특히 도 11a를 참조하면 레이저 접합의 결과 돌출부의 표면이 고르지 못하며, 용융면이 비스듬하게 형성된 것을 알 수 있다. 반면에 리벳팅 접합은 결합용 공구에 기반하여 접합력이 차이가 날 수 있 으나 리벳팅된 돌출부의 표면이 고르며 용융면이 평평하게 형성된 것을 알 수 있다. 도 11b에서 도시된 바와 같 이 리벳팅 결합 시 강한 접합력은 결합용 공구뿐만 아니라, 결합시 형성되는 접촉면의 모양에도 기반할 수 있다. 도 12a는 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조가 없는 경우 힘의 분배를 도시한 것이다. 도 12b는 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조 가 있는 경우 힘의 분배를 도시한 것이다. 도 13a는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조 가 있는 경우를 도시한 것이다. 도 13b는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조 가 있는 경우 제1 구조물을 제 거한 상태를 도시한 것이다. 도 13c는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조 가 없는 경우를 도시한 것이다. 도 13d는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조가 없는 경우 제1 구조물을 제거 한 상태를 도시한 것이다. 다양한 실시예에 의하면, 본 개시는 전자 장치에 포함된 복수의 구조물(예: 제1 구조물(도 5의 510) 및 제 2 구조물(도 5의 520))의 물리적 결합을 위한 구조(예: 도 6의 610), 두 구조물의 소성 유동을 제어하기 위한 구조(예: 도 6의 620), 결합용 공구(도 5의 530), 및 결합용 설비(도 5의 540)를 도시하며, 제1 구조물(예: 도 5의 510) 및 제2 구조물(예: 도 5의 520)에 대한 구조는 도 6의 설명을 준용할 수 있다. 제1 구조물(예: 도 5의 510)및 제2 구조물(예: 도 5의 520)의 물리적 결합을 위한 구조(예: 도 6의 610) 및 소성 유동을 제어하기 위한 구조(예: 도 6의 620)는 도 6의 설명을 준용할 수 있다. 두 구조물(예: 도 5의 510, 520)이 접합된 부분인 리벳 팅(riveting) 부분(예: 도 7의 710) 및 제1 내지 제3 용접 부분(예: 도 7의 701, 702, 703)에 대하여는 도 7의 설명을 준용할 수 있다. 이하, 도 12a 내지 도 13d를 참조로, 도 5 내지 도 10c와의 차이점을 중심으로 설명한다. 다양한 실시예에 따르면, 도 12a에서, 결합용 공구(예: 도 5의 530)에 의해 가압된 힘(예: 도 12의 1210)을 받 은 제1 구조물 및 제2 구조물은 사방(예: 도 12a의 1220)으로 힘이 퍼질 수 있다. 이 경우, 개구(예: 도 5의 511)와 인접한 하면에서 접합된 부분이 용접 되지 않을 수 있다. 다시 말하면, 접합된 부분에서 마찰 및 교반이 충분히 발생되지 못하여 산화막이 파괴되지 않을 수 있다. 다양한 실시예에 따르면, 도 12b에서, 지지구조 (예: 도 6의 601)는 제1 구조물 또는 제2 구조물에서 연장된 구 성으로써, 결합용 공구(예: 도 5의 530)의 의해 가압된 힘(예: 도 12의 1210)을 받은 제1 구조물 및 제2 구조물 의 소성 유동을 제어할 수 있다. 다시 말하면, 지지구조 (예: 도 6의 601)에 의하여 제1 구조물 및 제2 구조물 이 받는 힘(예: 도 12의 1210)은 가압된 힘의 방향(예: 도 12의 1220)으로 집중될 수 있으므로 개구(예: 도 5의 511)와 인접한 하면까지 마찰 및 교반이 발생하여 용접이 일어날 수 있다. 다양한 실시예에 따르면, 지지구조 (예: 도 6의 601)가 있는 경우 용접 영역(예: 도 13의 1301a)의 경계 및 리 벳팅 부분의 단면(예: 도 13의 1302b)이 지지부재(예: 도 6의 601)가 없는 경우의 용접영역(예: 도 13의 1301c) 및 단면(예: 도 13의 1302d) 보다 더 깔끔한 것을 확인할 수 있다. 본 개시를 통해, 기구적 결합력과 용접 결합력이 동시에 발현되어 동종 혹은 이종의 금속결합이 용이할 수 있 으며, 접합 계면이 건전하고 치밀할 수 있다. 또한 간단한 접합 구조로 소형화 기기에 적합하며, 범용 공작기 계를 사용할 수 있다. 이상에서 설명한 본 개시의 구조물 및 구조물이 포함하는 구성 및 재료는 전술한 실시 예 및 도면에 의해 한정 되는 것은 아니고, 본 개시의 기술적 범위 내에서 여러가지 치환, 변형 및 변경이 가능함은 본 발명이 속하는"}
{"patent_id": "10-2021-0051963", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자에게 있어 명백할 것이다."}
{"patent_id": "10-2021-0051963", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따르면, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 본 개시의 다양한 실시예에 따른, 전자 장치의 전면 사시도이다. 도 3은 본 개시의 다양한 실시예에 따른, 전자 장치의 후면 사시도이다. 도 4는 본 개시의 다양한 실시예에 따른, 전자 장치의 분해 사시도이다. 도 5는, 본 개시의 일 실시예들에 따른, 구조물들의 접합 상태 및 상기 구조물들의 접합을 위한 구성 부품들의 사시도이다. 도 6은 본 개시의 일 실시예에 따른, 구조물들의 접합전 결합 상태 및 상기 구조물들의 접합을 위한 툴 구성의 단면도이다. 도 7은 본 개시의 일 실시예에 따른, 접합된 구조물들의 단면도이다. 도 8은 본 개시의 일 실시예에 따른 구조물들이 접합되기 전을 나타낸 사시도이다. 도 9는 본 개시의 일 실시예에 따른, 접합 가공을 도시한 사시도이다. 도 10은 도 5에서 도시한 D-D 부분에 대한 단면도이다. 도 11a는 레이져 접합된 구조물들의 단면을 도시한 것이다. 도 11b는 본 개시의 일 실시예에 따른 리벳팅 접합을 비교 도시한 것이다. 도 12a는 본 개시의 일 실시예에 따른, 구조물들의 접합시 지지구조가 없는 경우 힘의 분배를 도시한 것이다. 도 12b는 본 개시의 일 실시예에 따른, 구조물들의 접합시 지지구조가 있는 경우 힘의 분배를 도시한 것이다. 도 13a는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조가 있는 경우를 도시한 것이다. 도 13b는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조가 있는 경우 제 1구조물을 제거 한 단면을 도시한 것이다. 도 13c는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조가 없는 경우를 도시한 것이다. 도 13d는 본 개시의 본 개시의 일 실시예에 따른, 구조물들의 접합 시 지지구조 가 없는 경우 제 1구조물 을 제 거한 단면을 도시한 것이다"}
