{"patent_id": "10-2020-0187120", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0095519", "출원번호": "10-2020-0187120", "발명의 명칭": "서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치 및 방법", "출원인": "아주대학교산학협력단", "발명자": "김재훈"}}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법에 있어서,네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어지는 엣지마다 엣지 자원 정보를 연산하는 단계;상기 엣지 자원 정보가 입력되면 해당 엣지에 대한 관계 정보를 출력하도록 학습된 인공지능 기반의 엣지 분석모델에 기초하여 상기 네트워크 내의 엣지 각각에 대한 상기 관계 정보를 도출하는 단계;상기 관계 정보에 기초하여 엣지 각각에 대한 활성 여부를 결정하는 단계; 및상기 활성 여부에 기초하여 서브 그래프를 구축하는 단계,를 포함하는, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 엣지는 시작 단말 및 종말 단말을 포함하고,상기 엣지 자원 정보를 연산하는 단계는,상기 종말 단말의 적어도 하나의 유형의 자원 정보 각각으로부터 상기 시작 단말의 상기 자원 정보 각각을 감산하여 상기 엣지 자원 정보를 연산하는 것인, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 관계 정보는,상기 시작 단말과 상기 종말 단말의 연결 시 상기 서비스 요청에 대응하는 서비스에 대한 제공 가능성을 포함하는 상기 엣지의 유효성과 관련된 정보인 것인, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 서브 그래프를 구축하는 단계는,활성화된 엣지를 포함하고, 상기 활성화된 엣지를 상기 시작 단말에서 상기 종말 단말로 뻗어나가도록 표현한상기 서브 그래프를 상기 네트워크 내의 복수의 단말 중 적어도 일부의 단말에 대하여 계층적으로 구축하는 것인, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 자원 정보는,단말 각각의 저장 용량 정보, 연산 능력 정보, 메모리 정보 및 센서 탑재 정보 중 적어도 하나를 포함하는것인, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,공개특허 10-2022-0095519-3-상기 엣지 자원 정보를 연산하는 단계 이전에,적어도 하나의 엣지에 대하여 수집된 상기 엣지 자원 정보와 상기 적어도 하나의 엣지에 대응하는 상기 시작 단말 및 상기 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반하여 상기엣지 분석 모델을 학습시키는 단계,를 더 포함하는 것인, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 학습시키는 단계는,상기 소정의 서비스가 상기 시작 단말 및 상기 종말 단말에서 제공 가능한 상태에 대응하는 제1목표값, 상기 소정의 서비스가 상기 시작 단말에서 제공 불가능하나 상기 종말 단말에서 제공 가능한 상태에 대응하는 제2목표값 및 상기 소정의 서비스가 상기 종말 단말에서 제공 불가능한 상태에 대응하는 제3목표값에 기초하여 상기 엣지 분석 모델을 학습시키는 것인, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 서브 그래프는,상기 서비스 요청에 포함된 해당 서비스에서 요구하는 자원 정보를 고려하여 생성되는 것인, 서브 그래프 생성방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 서브 그래프 생성 방법은,상기 서비스 요청의 규칙 변화 및 상기 네트워크의 환경 변화 중 적어도 하나가 발생하면, 상기 서브 그래프를갱신하여 생성하도록 상기 변화를 반영하여 재차 수행되는 것을 특징으로 하는, 서브 그래프 생성 방법."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치에 있어서,네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어지는 엣지마다 엣지 자원 정보를 연산하는 엣지 정의부;상기 엣지 자원 정보가 입력되면 해당 엣지에 대한 관계 정보를 출력하도록 학습된 인공지능 기반의 엣지 분석모델에 기초하여 상기 네트워크 내의 엣지 각각에 대한 상기 관계 정보를 도출하는 엣지 평가부; 및상기 관계 정보에 기초하여 엣지 각각에 대한 활성 여부를 결정하고, 상기 활성 여부에 기초하여 서브 그래프를구축하는 서브 그래프 구축부,를 포함하는, 서브 그래프 생성 장치."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 엣지는 시작 단말 및 종말 단말을 포함하고,상기 엣지 정의부는,상기 종말 단말의 적어도 하나의 유형의 자원 정보 각각으로부터 상기 시작 단말의 상기 자원 정보 각각을 감산하여 상기 엣지 자원 정보를 연산하는 것인, 서브 그래프 생성 장치."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2022-0095519-4-제11항에 있어서,상기 관계 정보는,상기 시작 단말과 상기 종말 단말의 연결 시 상기 서비스 요청에 대응하는 서비스에 대한 제공 가능성을 포함하는 상기 엣지의 유효성과 관련된 정보인 것인, 서브 그래프 생성 장치."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 서브 그래프 구축부는,활성화된 엣지를 포함하고, 상기 활성화된 엣지를 상기 시작 단말에서 상기 종말 단말로 뻗어나가도록 표현한상기 서브 그래프를 상기 네트워크 내의 복수의 단말 중 적어도 일부의 단말에 대하여 계층적으로 구축하는 것인, 서브 그래프 생성 장치."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,적어도 하나의 엣지에 대하여 수집된 상기 엣지 자원 정보와 상기 적어도 하나의 엣지에 대응하는 상기 시작 단말 및 상기 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반하여 상기엣지 분석 모델을 학습시키는 모델 학습부,를 더 포함하는 것인, 서브 그래프 생성 장치."}
{"patent_id": "10-2020-0187120", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제9항 중 어느 한 항에 따른 방법을 컴퓨터에서 실행하기 위한 프로그램을 기록한 컴퓨터에서 판독가능한 기록매체."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서비스 요청에 대한 단말 추천을 위한 서브 그래프 생성 장치 및 방법이 개시되며, 본원의 일 실시예에 따른 서 비스 요청에 대한 단말 추천을 위한 서브 그래프 생성 방법은, 네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어지는 엣지마다 엣지 자원 정보를 연산하는 단계, 상기 엣지 자원 정보가 입력되면 해당 엣 지에 대한 관계 정보를 출력하도록 학습된 인공지능 기반의 엣지 분석 모델에 기초하여 상기 네트워크 내의 엣지 각각에 대한 상기 관계 정보를 도출하는 단계, 상기 관계 정보에 기초하여 엣지 각각에 대한 활성 여부를 결정하 는 단계 및 상기 활성 여부에 기초하여 서브 그래프를 구축하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 서비스 요청에 대한 단말 추천을 위한 서브 그래프 생성 장치 및 방법에 관한 것이다. 예를 들면, 본원 은 셀룰러 네트워크에서의 서비스 요청에 대한 단말 추천 서브 그래프 생성 기법에 관한 것이다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "셀룰러 네트워크 내의 특정 단말의 서비스 요청에 대응하여 해당 서비스를 제공하기에 알맞은 단말을 선택 및 추천하는 기법은 다양하게 적용될 수 있다. 예를 들어, 종래에는 주로 해당 서비스를 제공할 수 있는 제공자 단 말의 목록 내에서 가장 좋은 자원 정보를 보유한 단말을 선택하여 해당 서비스를 제공하도록 하는 방식이 주로 적용되었다. 또한, 제공자 단말 각각이 선택된 횟수, 제공자 단말에 대한 만족도(선호도)와 같은 제공자 단말을 평가할 수 있는 기록에 근거하여 제공자 단말의 추천 순위를 제시하는 방식이 적용될 수도 있으며, 이 때에는 다양한 추천 알고리즘이 적용될 수 있다. 또 다른 예로, 요청자 단말 또는 선택된 단말과 유사한 자원 정보를 보유한 단말을 추천하는 방식을 고려할 수도 있다. 그러나, 전술한 제공자 단말 추천 방식의 경우, 단말(노드) 각각의 위치나 자원 정보 등을 활용하여 해당 단말 (노드)이 특정 서비스를 제공하기에 적합한지가 평가되기 때문에 네트워크에 참여하는 단말(노드)의 수가 많아 질수록 효율성이 떨어지게 된다. 또한, 단말 간의 유사도에 기반하여 제공자 단말을 추천하는 방식 역시 평가를 통한 자원 추천 이후에 새로운 알고리즘을 적용해야 하므로 많인 시간과 연산이 요구된다는 한계가 있으며, 다수의 후보 단말에 대한 추천 순 위를 매기거나 후보 단말 간의 계층적인 추천이 이루어지기 위하여는 내림 차순 정렬 알고리즘 등의 복잡한 추 가 알고리즘이 적용되어야 한다는 문제가 있다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본원의 배경이 되는 기술은 한국등록특허공보 제10-1273909호에 개시되어 있다. 발명의 내용"}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 개별 단말의 자원 정보만을 고려하는 것이 아니 라, 단말 간의 관계를 정의한 엣지를 고려하여 소정의 서비스에 적합한 제공자 단말을 추천할 수 있는 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 서비스 요청에 대한 단말 추 천을 위한 서브 그래프 생성 방법은, 네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어 지는 엣지마다 엣지 자원 정보를 연산하는 단계, 상기 엣지 자원 정보가 입력되면 해당 엣지에 대한 관계 정보 를 출력하도록 학습된 인공지능 기반의 엣지 분석 모델에 기초하여 상기 네트워크 내의 엣지 각각에 대한 상기 관계 정보를 도출하는 단계, 상기 관계 정보에 기초하여 엣지 각각에 대한 활성 여부를 결정하는 단계 및 상기 활성 여부에 기초하여 서브 그래프를 구축하는 단계를 포함할 수 있다. 또한, 상기 엣지는 시작 단말 및 종말 단말을 포함할 수 있다. 또한, 상기 엣지 자원 정보를 연산하는 단계는, 상기 종말 단말의 적어도 하나의 유형의 자원 정보 각각으로부 터 상기 시작 단말의 상기 자원 정보 각각을 감산하여 상기 엣지 자원 정보를 연산할 수 있다. 또한, 상기 관계 정보는, 상기 시작 단말과 상기 종말 단말의 연결 시 상기 서비스 요청에 대응하는 서비스에 대한 제공 가능성을 포함하는 상기 엣지의 유효성과 관련된 정보일 수 있다. 또한, 상기 서브 그래프를 구축하는 단계는, 활성화된 엣지를 포함하고, 상기 활성화된 엣지를 상기 시작 단말 에서 상기 종말 단말로 뻗어나가도록 표현한 상기 서브 그래프를 상기 네트워크 내의 복수의 단말 중 적어도 일 부의 단말에 대하여 계층적으로 구축할 수 있다. 또한, 상기 자원 정보는, 단말 각각의 저장 용량 정보, 연산 능력 정보, 메모리 정보 및 센서 탑재 정보 중 적 어도 하나를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 서비스 요청에 대한 단말 추천을 위한 서브 그래프 생성 방법은, 상기 엣지 자 원 정보를 연산하는 단계 이전에, 적어도 하나의 엣지에 대하여 수집된 상기 엣지 자원 정보와 상기 적어도 하 나의 엣지에 대응하는 상기 시작 단말 및 상기 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반하여 상기 엣지 분석 모델을 학습시키는 단계를 포함할 수 있다. 또한, 상기 학습시키는 단계는, 상기 소정의 서비스가 상기 시작 단말 및 상기 종말 단말에서 제공 가능한 상태 에 대응하는 제1목표값, 상기 소정의 서비스가 상기 시작 단말에서 제공 불가능하나 상기 종말 단말에서 제공 가능한 상태에 대응하는 제2목표값 및 상기 소정의 서비스가 상기 종말 단말에서 제공 불가능한 상태에 대응하 는 제3목표값에 기초하여 상기 엣지 분석 모델을 학습시킬 수 있다. 또한, 상기 서브 그래프는, 상기 서비스 요청에 포함된 해당 서비스에서 요구하는 자원 정보를 고려하여 생성될 수 있다. 또한, 상기 서브 그래프 생성 방법은, 상기 서비스 요청의 규칙 변화 및 상기 네트워크의 환경 변화 중 적어도 하나가 발생하면, 상기 서브 그래프를 갱신하여 생성하도록 상기 변화를 반영하여 재차 수행될 수 있다. 한편, 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치는, 네트워크 내 의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어지는 엣지마다 엣지 자원 정보를 연산하는 엣지 정 의부, 상기 엣지 자원 정보가 입력되면 해당 엣지에 대한 관계 정보를 출력하도록 학습된 인공지능 기반의 엣지 분석 모델에 기초하여 상기 네트워크 내의 엣지 각각에 대한 상기 관계 정보를 도출하는 엣지 평가부 및 상기 관계 정보에 기초하여 엣지 각각에 대한 활성 여부를 결정하고, 상기 활성 여부에 기초하여 서브 그래프를 구축 하는 서브 그래프 구축부를 포함할 수 있다. 또한, 상기 엣지 정의부는, 상기 종말 단말의 적어도 하나의 유형의 자원 정보 각각으로부터 상기 시작 단말의 상기 자원 정보 각각을 감산하여 상기 엣지 자원 정보를 연산할 수 있다. 또한, 상기 서브 그래프 구축부는, 활성화된 엣지를 포함하고, 상기 활성화된 엣지를 상기 시작 단말에서 상기 종말 단말로 뻗어나가도록 표현한 상기 서브 그래프를 상기 네트워크 내의 복수의 단말 중 적어도 일부의 단말 에 대하여 계층적으로 구축할 수 있다. 또한, 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치는, 적어도 하나 의 엣지에 대하여 수집된 상기 엣지 자원 정보와 상기 적어도 하나의 엣지에 대응하는 상기 시작 단말 및 상기 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반하여 상기 엣지 분석 모델을 학습시키는 모델 학습부를 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 개별 단말의 자원 정보만을 고려하는 것이 아니라, 단말 간의 관계를 정의한 엣지를 고려하여 소정의 서비스에 적합한 제공자 단말을 추천할 수 있는 서비스 요청에 대응한 단말 추 천을 위한 서브 그래프 생성 장치 및 방법을 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 단말 각각의 자원 정보를 단말 간의 엣지 자원 정보로 변경하여, 학습 신경망을 통해 네트워크 내의 단말 간 관계를 학습하고, 학습된 관계를 통해서 요청된 특정 서비스에 대응하는 서브 그래프를 구축할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 엣지 정보에 기반하여 복수의 단말에 대하여 계층적으로 생성되는 서 브 그래프를 기초로 하여 서비스 제공 단말에 대한 추천이 이루어질 수 있어 네트워크 내에 다수의 단말이 존재 하더라도 효율적인 평가가 이루어질 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 네트워크 내의 상태 변화에 대응하여 최신화된 서브 그래프가 보다 신 속하게 제공될 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다.본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 서비스 요청에 대한 단말 추천을 위한 서브 그래프 생성 장치 및 방법에 관한 것이다. 예를 들면, 본원 은 셀룰러 네트워크에서의 서비스 요청에 대한 단말 추천 서브 그래프 생성 기법에 관한 것이다. 도 1은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치를 포함하는 서 비스 제공 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 서비스 제공 시스템은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치(이하, '서브 그래프 생성 장치' 라 한다.), 요청자 단말 및 제공자 단말을 포함할 수 있다. 또한, 도 1을 참조하면, 제공자 단말은 복수 개로 구비될 수 있다. 서브 그래프 생성 장치, 요청자 단말 및 제공자 단말 상호간은 네트워크를 통해 통신할 수 있다. 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교환이 가능한 연결 구조를 의미하 는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인 터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않 는다. 한편, 본원의 실시예에 관한 설명에서의 네트워크는 주로 셀룰러 네트워크를 의미하는 것일 수 있다. 요청자 단말 및 제공자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다. 도 2는 소정의 서비스에 대한 요청자 단말 및 제공자 단말의 관계를 설명하기 위한 개념도이다. 도 2를 참조하면, 본원의 실시예에 관한 설명에서 요청자 단말은 소정의 서비스가 두 단말 간의 연결(접속) 을 통해 제공될 수 있는 경우, 해당 서비스를 제공하여 줄 것을 해당 서비스 제공 주체 등에게 요청하거나 해당 서비스의 제공을 위한 제공자 단말의 탐색을 요청한 사용자 단말을 의미할 수 있다. 또한, 제공자 단말은 요청자 단말과 동일한 네트워크(예를 들면, 셀룰러 네트워크 등)에 참여하는 복수의 단말 중 적어도 일부의 단말로서 요청자 단말에 소정의 서비스를 제공할 수 있는 자원을 보유하고, 이러한 자원을 활용하여 요청자 단말과의 연결(접속)을 통해 특정 서비스를 제공하는 사용자 단말을 의미할 수 있다. 달리 말해, 본원의 실시예에 관한 설명에서, 요청자 단말은 제공자 단말에 소정의 서비스를 요청하고(서 비스 요청), 제공자 단말은 요청된 서비스를 요청자 단말에 제공할 수 있다(서비스 제공). 또한, 본원의 서브 그래프 생성 장치는 소정의 서비스에 대하여 요청자 단말을 포함하는 네트워크 내에서의 복수 의 제공자 단말 사이에서 정의되는 엣지에 대한 관계 정보에 기반하여 요청자 단말에 해당 서비스를 제공 하기에 적합한 제공자 단말에 대한 정보를 포함하는 서브 그래프를 생성하여 제공할 수 있다. 이하에서는, 도 3 내지 도 5를 참조하여, 서브 그래프 생성 장치의 구체적인 기능 및 동작에 대해 상세히 설명하도록 한다. 도 3은 서브 그래프를 구축하는 전체 프로세스를 설명하기 위한 개념도이다. 도 3을 참조하면, 서브 그래프 생성 장치는 네트워크 내의 단말(예를 들면, 요청자 단말과 복수의 제공자 단말 등)의 단말 자원정보로부터 엣지 관계 정보를 도출하며 도출된 관계 정보에 기반하여 최종 출력 되는 서브 그래프 내에서의 엣지 활성 여부를 결정하기 위한 학습 신경망을 구축하고(도 3의 Step 1), 구축된 학습 신경망에 기초하여 소정의 서비스에 대한 서브 그래프를 생성(발견)하도록 동작할 수 있다(도 3의 Step 2). 또한, 도 3을 참조하면, 서브 그래프 생성 장치는 상황에 따라 학습 신경망의 재학습을 진행할 수 있 다. 구체적으로, 서브 그래프 생성 장치는 네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말 로 이루어지는 엣지마다 엣지 자원 정보를 연산할 수 있다. 달리 말해, 서브 그래프 생성 장치는 네트워크 내의 복수의 단말 중 한 쌍의 단말 사이에서 정의되는 복수의 엣지를 정의하고, 정의된 엣지에 대응하는 엣지 자원 정보를 연산할 수 있다. 또한, 도 3을 참조하면, '서브 그래프(Subgraph)'는 네트워크에 참여하는 단말들을 포함하도록 생성되는 그 래프에 대하여 해당 그래프에 속한 정점(노드)과 간선(엣지)들의 부분 집합으로 이루어지는 하위 그래프를 의미 하며, 본원의 구현예에 따라 부분 그래프 등으로 달리 지칭될 수 있다. 도4는 네트워크 내에서의 엣지의 정의를 설명하기 위한 개념도이다. 도 4를 참조하면, 본원에서의 엣지(E)는 네트워크 내의 단말 각각에 대응하는 한 쌍의 노드(N) 사이를 잇는 선 형태로 서브 그래프 상에서 표현될 수 있다. 이와 관련하여, 서브 그래프 생성 장치는 단말(노드) 각각의 자원 정보를 개별적으로 활용하는 것이 아니 라, 단말 간의 자원 관계를 도출하고, 도출된 단말 간의 자원 관계를 활용하여 단말 간 접속을 통하여 소정의 서비스를 제공할 수 있는지에 대한 정보를 반영하는 서브 그래프를 생성할 수 있다. 또한, 이를 위하여 서브 그 래프 생성 장치는 서브 그래프 상에 선 형태로 표시되는 엣지(E) 각각에 대하여 해당 엣지와 관련된 한 쌍 의 단말(노드)의 자원 정보로부터 엣지 자원 정보를 도출할 수 있다. 또한, 본원의 일 실시예에 따르면, 본원에서의 '엣지(Edge)'는 시작 단말 및 종말 단말을 포함하도록 결정되어 엣지 마다의 방향성이 정의되는 것일 수 있다. 또한, 이와 관련하여, 서브 그래프 생성 장치는 종말 단말 의 적어도 하나의 유형의 자원 정보 각각으로부터 시작 단말의 자원 정보 각각을 감산하는 방식으로 엣지 자원 정보를 연산할 수 있다. 또한, 본원의 일 실시예에 따르면, 네트워크 내의 모든 단말(예를 들면, 제공자 단말로 선택될 수 있는 복수의 후보 단말 등)들은 서로 연결(접속)이 가능한 것으로 가정하여 단말 간 관계가 정의될 수 있으며, 이에 따르면, 도 4는 4개의 단말로 이루어진 셀룰러 네트워크의 네트워크 구조를 표현한 것일 수 있다. 또한, 본원의 일 실시예에 따르면, 단말의 자원 정보는 단말 각각의 저장 용량 정보, 연산 능력 정보, 메모리 정보 및 센서 탑재 정보 중 적어도 하나를 포함할 수 있다. 구체적으로 예시하면, 자원 정보 중 저장 용량은 단말 내에 탑재되는 스토리지 장치의 용량을 의미할 수 있다. 또한, 자원 정보 중 연산 능력 정보는 CPU, GPU 등 단말 내에 탑재 가능한 연산 처리 장치의 연산 성능에 대한 정보를 의미할 수 있다. 또한, 메모리 정보는 RAM 정보를 포함할 수 있다. 또한, 센서 탑재 정보는 온도 센서 등의 특정 유형의 IoT(Internet-of-Things) 센서를 해당 단말이 탑재하는지 여부를 의미할 수 있다. 다만, 전술 한 자원 정보는 상술한 유형으로만 한정되는 것은 아니고, 본원의 구현예에 따라 다양한 자원 정보가 고려될 수 있다. 또한, 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 하기 식 1에 기초하여 소정의 서비스 K와 연 계된 단말 각각의 자원 정보를 정의하고, 하기 식 2에 기초하여 한 쌍의 단말 사이에서 정의되는 엣지에 대한 엣지 자원 정보를 연산할 수 있다. [식 1]"}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, f1, f2 등은 각각의 자원 정보의 유형에 대응될 수 있으며, 이에 따라, 상기 식 1에서 n은 자원의 종류 의 수를 나타낼 수 있다.[식 2]"}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, Eji는 시작 단말(i)과 종말 단말(j) 사이에서 정의되는 엣지 자원 정보이고, Fi 및 Fj는 각각 시작 단말 (i) 및 종말 단말(j) 각각의 자원 정보일 수 있다. 이렇듯, 서브 그래프 생성 장치는 한 쌍의 단말 각각의 자원 정보에 기초하여 해당 한 쌍의 단말 사이에서 정의되는 엣지에 대한 엣지 자원 정보를 연산하되, 복수의 단말 간의 방향성이 부여되는 계층적인 서브 그래프 의 표현을 위하여 종말 단말(j)의 자원 정보에서 시작 단말(i)의 자원 정보를 상호 대응하는 자원의 유형 성분 마다 차감하는 방식으로 엣지 자원 정보를 도출할 수 있다. 또한, 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 요청자 단말에 의해 요청된 서비스에서 요 구하는 자원 정보의 유형을 고려하여 서브 그래프가 생성될 수 있도록, 요청된 서비스와 관련한 자원 정보의 유 형을 고려하여 단말 각각의 자원 정보 및 엣지 자원 정보를 도출할 수 있다. 예를 들어, 서브 그래프 생성 장치는 요청된 서비스에서 요구되는 자원의 유형을 고려하여 특정 유형의 센 서 탑재 정보가 해당 서비스의 제공과 무관한 것으로 판단되면, 단말 각각의 자원 정보 및 엣지 자원 정보의 연 산시 해당 유형의 자원 정보는 고려되지 않도록 제외할 수 있다. 또한, 서브 그래프 생성 장치는 인공지능 기반의 엣지 분석 모델을 학습시킬 수 있다. 구체적으로, 서브 그래프 생성 장치는 적어도 하나의 엣지에 대하여 수집된 엣지 자원 정보와 해당 적어도 하나의 엣지에 대 응하는 시작 단말 및 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반 하여 엣지 분석 모델을 학습시킬 수 있다. 달리 말해, 서브 그래프 생성 장치는 지도 학습 방식에 기반하 여 엣지 분석 모델(도 3의 학습 신경망)을 구축할 수 있다. 구체적으로, 서브 그래프 생성 장치는 소정의 서비스가 시작 단말 및 종말 단말에서 제공 가능한 상태에 대응하는 제1목표값, 소정의 서비스가 시작 단말에서 제공 불가능하나 종말 단말에서 제공 가능한 상태에 대응 하는 제2목표값 및 소정의 서비스가 종말 단말에서 제공 불가능한 상태에 대응하는 제3목표값에 기초한 지도 학 습을 통해 엣지 분석 모델을 학습시킬 수 있다. 이와 관련하여, 서브 그래프 생성 장치는 해당 서비스에 대한 시작 단말 및 종말 단말의 연결(접속)을 통 한 제공 가능성이 높을수록 높은 값으로 수치화된 관계 정보가 도출되도록, 제1목표값, 제2목표값 및 제3목표값 중에서 제1목표값이 가장 큰 값으로 설정되고, 다음으로 제2목표값이 크게 설정되고, 제3목표값이 가장 작은 값 으로 설정되도록 할 수 있다(달리 말해, 제1목표값 > 제2목표값 > 제3목표값). 또한, 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 엣지 분석 모델의 학습 과정에서 엣지 분석 모델의 출력값과 전술한 목표값의 오차를 연산하고, 해당 오차를 엣지 분석 모델(학습 신경망)의 손실(Loss) 값 으로 하여 엣지 분석 모델을 학습시킬 수 있다. 도 5는 시작 단말 및 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 지도 학습을 수행하기 위하 여 설정되는 목표값을 예시적으로 나타낸 도표이다. 도 5를 참조하면, 상술한 제1목표값은 '1'로, 제2목표값은 '0.5'로, 제3목표값이 '0'으로 각각 설정될 수 있으 나, 이에만 한정되는 것은 아니고, 서브 그래프 생성 장치는 서브 그래프를 생성하고자 하는 서비스의 유 형, 특성과 네트워크에 참여한 단말의 수 등에 기초하여 각각의 목표값에 대한 구체적인 수치를 결정하도록 동작할 수 있다. 또한, 본원에서 개시하는 엣지 분석 모델의 구축을 위하여는 종래에 이미 공지되었거나 향후 개발되는 다양한 지도 학습 알고리즘 모델이 적용될 수 있다. 또한, 서브 그래프 생성 장치는 전술한 과정을 통해 학습(구축)되어, 요청자 단말이 포함된 특정 네트 워크 내에서 복수의 제공자 단말 사이에서 정의되는 각각의 엣지 자원 정보가 입력되면, 입력된 엣지마 다의 관계 정보를 출력하는 인공지능 기반의 엣지 분석 모델(학습 신경망)에 기초하여 네트워크 내의 엣지 각각에 대한 관계 정보를 도출할 수 있다. 보다 구체적으로, 엣지 분석 모델(학습 신경망)에 의해 도출되는 엣지 각각에 대한 관계 정보는 시작 단말과 종 말 단말의 연결 시 서비스 요청에 대응하는 서비스에 대한 제공 가능성을 포함하는 엣지의 유효성과 관련된 정 보일 수 있다. 달리 말해, 엣지 분석 모델은 소정의 엣지에 대하여 정의된 엣지 자원 정보를 입력으로 하여, 해당 엣지에 포함 된 시작 단말과 종말 단말이 연결될 경우 해당 서비스를 유효하게 제공할 수 있는 가능성을 나타내는 수치화된 관계 정보를 출력으로서 제공할 수 있다. 보다 구체적으로, 엣지 분석 모델(학습 신경망)은 앞서 상세히 설명한 목표값에 기반한 지도 학습을 통해, 입력 된 엣지 자원 정보에 기초하여 해당 엣지와 관련하여 종말 단말이 시작 단말과 접속될 때 서비스를 유효하게 제 공할 확률이 높을수록 제1목표값(예를 들면, 1)에 가까운 수치를 출력하도록 동작할 수 있다. 또한, 서브 그래프 생성 장치는 엣지 분석 모델에 의해 도출된 관계 정보에 기초하여 엣지 각각에 대한 활 성 여부를 결정할 수 있다. 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 엣지 분석 모델에 의해 도출된 수치화된 관계 정보가 미리 설정된 임계값 미만인 엣지는 비활성화하고, 엣지 분석 모델에 의해 도출된 수치화된 관계 정보가 전술한 임계값 이상인 엣지를 활성화하도록 활성 여부를 엣지마다 결정할 수 있다. 예를 들어, 엣지 각각의 활성 여부를 결정하기 위한 기준인 임계값은 요청된 서비스의 유형, 네트워크에 참여하 는 단말(노드)의 수 등에 기초하여 설정됨으로써, 서브 그래프 생성 장치가 요청자 단말이 참여하는 네 트워크의 상태에 부합하는 단말 추천을 제공하도록 임계값이 결정될 수 있다. 또한, 서브 그래프 생성 장치는 결정된 활성 여부에 기초하여 서브 그래프를 구축할 수 있다. 또한, 본원 의 일 실시예에 따르면 서브 그래프 생성 장치에 의해 생성되는 서브 그래프는 전술한 바와 같이 서비스 요청에 포함된 해당 서비스에서 요구하는 자원 정보를 고려하여 생성되는 것일 수 있다. 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 결정된 활성 여부에 기초하여, 활성화된 엣지를 포 함하는 서브 그래프를 생성하되, 활성화된 엣지 각각을 해당 엣지의 시작 단말에서 종말 단말로 뻗어나가도록 표현한 서브 그래프를 네트워크 내의 복수의 단말 중 적어도 일부의 단말에 대하여 계층적으로 구축할 수 있다. 한편, 서브 그래프 생성 장치는 학습된 엣지 분석 모델을 통해 목표값을 만들기 위해 필요한 서비스가 일 련의 규칙을 기초로 하여 요청되는 상황을 가정하여 서브 그래프를 생성하므로, 서브 그래프 생성 장치에 의해 구축되는 서브 그래프는 해당 서비스를 네트워크에 요청하는 요청자 단말을 기준으로 생성(구축)되 는 것으로 이해될 수 있다. 또한, 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 생성된 서브 그래프를 요청자 단말로 전송 하여 요청자 단말을 통해 생성된 서브 그래프가 표출(시각화)되도록 할 수 있다. 또한, 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 서비스 요청의 규칙 변화 및 네트워크의 환경 변화 중 적어도 하나가 발생하면, 이러한 변화를 반영하여 서브 그래프를 갱신하여 생성하도록 재차 전술 한 서브 그래프 생성 프로세스를 수행할 수 있다. 본원의 일 실시예에 따르면, 서브 그래프 생성 장치는 전술한 엣지 자원 정보를 연산하는 프로세스 및 엣 지 자원 정보에 기반하여 엣지 간의 관계 정보와 활성 여부를 결정하는 프로세스를 모듈화하여 미리 설정된 갱 신 주기마다 서브 그래프 생성 프로세스를 반복 수행하도록 동작할 수 있다. 또한, 네트워크의 환경 변화는 이를 테면, 해당 네트워크 내의 기 참여하는 일부의 노드(단말)가 해당 네트워크로부터 이탈하거나, 해당 네트워크에 새로운 노드(단말)가 추가되는 경우 등을 포함할 수 있다. 이와 관련하여, 본원에서 개시하는 서브 그래프 생성 장치는 한 쌍의 단말에 대하여 정의되는 엣지 간의 엣지 자원 정보와 이에 따른 관계 정보를 모든 단말 간의 조합에 대하여 정의하므로, 노드(단말)의 이탈 또는 추가에 대응하여 이탈되거나 추가된 노드(단말)와 연계된 엣지에 대하여만 엣지 자원 정보, 관계 정보, 활성 여 부 등을 재차 판단하면 되므로, 노드(단말)의 이탈 또는 추가를 포함하는 네트워크에 변화에 능동적으로 대 응하여 신속하게 네트워크의 변화를 반영한 서브 그래프를 재생성할 수 있다. 도 6은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치의 개략적인 구 성도이다. 도 6을 참조하면, 서브 그래프 생성 장치는, 엣지 정의부, 모델 학습부, 엣지 평가부 및 서브 그래프 구축부를 포함할 수 있다. 엣지 정의부는, 네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어지는 엣지마다 엣 지 자원 정보를 연산할 수 있다. 모델 학습부는, 적어도 하나의 엣지에 대하여 수집된 엣지 자원 정보와 적어도 하나의 엣지에 대응하는 시 작 단말 및 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반하여 인공 지능 기반의 엣지 분석 모델을 학습시킬 수 있다. 엣지 평가부는, 엣지 자원 정보가 입력되면 해당 엣지에 대한 관계 정보를 출력하도록 학습된 인공지능 기 반의 엣지 분석 모델에 기초하여 네트워크 내의 엣지 각각에 대한 관계 정보를 도출할 수 있다. 서브 그래프 구축부는, 도출된 관계 정보에 기초하여 엣지 각각에 대한 활성 여부를 결정할 수 있다. 또한, 서브 그래프 구축부는, 결정된 활성 여부에 기초하여 서브 그래프를 구축할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 7은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법에 대한 동작 흐름도이다. 도 7에 도시된 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법은 앞서 설명된 서브 그래프 생성 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 서브 그래프 생성 장치에 대하여 설명된 내용은 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법에 대한 설명에도 동일하 게 적용될 수 있다. 도 7을 참조하면, 단계 S11에서 엣지 정의부는 네트워크 내의 단말 각각의 자원 정보에 기초하여 한 쌍의 단말로 이루어지는 엣지마다 엣지 자원 정보를 연산할 수 있다. 구체적으로, 단계 S11에서 엣지 정의부는 한 쌍의 단말 중 종말 단말의 적어도 하나의 유형의 자원 정보 각각으로부터 한 쌍의 단말 중 시작 단말의 자원 정보 각각을 감산하여 엣지 자원 정보를 연산할 수 있다. 다음으로, 단계 S12에서 엣지 평가부는 엣지 자원 정보가 입력되면 해당 엣지에 대한 관계 정보를 출력하 도록 학습된 인공지능 기반의 엣지 분석 모델에 기초하여 네트워크 내의 엣지 각각에 대한 관계 정보를 도 출할 수 있다. 다음으로, 단계 S13에서 서브 그래프 구축부는 도출된 관계 정보에 기초하여 엣지 각각에 대한 활성 여부 를 결정할 수 있다. 다음으로, 단계 S14에서 서브 그래프 구축부는 결정된 활성 여부에 기초하여 서브 그래프를 구축할 수 있 다. 구체적으로, 단계 S14에서 서브 그래프 구축부는 활성화된 엣지를 포함하고, 활성화된 엣지를 시작 단말에 서 종말 단말로 뻗어나가도록 표현한 서브 그래프를 네트워크 내의 복수의 단말 중 적어도 일부의 단말에 대하여 계층적으로 구축할 수 있다. 또한, 도면에는 도시되지 않았으나, 단계 S11 이전에 모델 학습부는 적어도 하나의 엣지에 대하여 수집된 엣지 자원 정보와 적어도 하나의 엣지에 대응하는 시작 단말 및 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 수행되는 지도 학습에 기반하여 엣지 분석 모델을 학습시킬 수 있다. 구체적으로, 모델 학습부 는 소정의 서비스가 시작 단말 및 종말 단말에서 제공 가능한 상태에 대응하는 제1목표값, 소정의 서비스 가 시작 단말에서 제공 불가능하나 종말 단말에서 제공 가능한 상태에 대응하는 제2목표값 및 소정의 서비스가 종말 단말에서 제공 불가능한 상태에 대응하는 제3목표값에 기초하여 엣지 분석 모델을 학습시킬 수 있다. 상술한 설명에서, 단계 S11 내지 S14는 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법은 다양한 컴퓨터 수단 을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨 터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로 피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램 (RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된 다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작 을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2020-0187120", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2020-0187120", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치를 포함하는 서 비스 제공 시스템의 개략적인 구성도이다. 도 2는 소정의 서비스에 대한 요청자 단말 및 제공자 단말의 관계를 설명하기 위한 개념도이다. 도 3은 서브 그래프를 구축하는 전체 프로세스를 설명하기 위한 개념도이다. 도4는 네트워크 내에서의 엣지의 정의를 설명하기 위한 개념도이다. 도 5는 시작 단말 및 종말 단말을 통한 소정의 서비스의 제공 가부 정보에 기초하여 지도 학습을 수행하기 위하 여 설정되는 목표값을 예시적으로 나타낸 도표이다. 도 6은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 장치의 개략적인 구 성도이다. 도 7은 본원의 일 실시예에 따른 서비스 요청에 대응한 단말 추천을 위한 서브 그래프 생성 방법에 대한 동작 흐름도이다."}
