{"patent_id": "10-2021-0094182", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0013437", "출원번호": "10-2021-0094182", "발명의 명칭": "인공 지능 피드백 시스템 및 방법", "출원인": "한국수력원자력 주식회사", "발명자": "이승찬"}}
{"patent_id": "10-2021-0094182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "학습하기 위한 기본 재료를 포함하는 입력1 및 학습하기 위한 핵심 내용을 포함하는 입력2를 제공받아 상기 입력1로부터 상기 입력2에 관련된 정보의 인기 빈도값 또는 순위값을 위한 초기 조건을 생성하는 스크립트 추출및 실행기;상기 스크립트 추출 및 실행기와 연결되며, 상기 초기 조건으로부터 도출된 상기 인기 빈도값 또는 상기 순위값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정보 테이블을 생성하고, 상기 2차원 정보 테이블의 해당 좌표에 상기 인기 빈도값 또는 상기 순위값을 추가하고, 상기 해당 좌표에 상기 인공 지능이 습득한 지식을 매칭(matching)하는 인공 지능;상기 인공 지능과 연결되며, 상기 인공 지능이 상기 2차원 정보 테이블로부터 도출한 깊은 진리값을 출력하는출력부; 및 상기 인공 지능과 연결되며, 상기 인공 지능이 도출한 상기 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 저장하는 저장소를 포함하되,상기 인공 지능은,상기 2차원 정보 테이블로부터 상기 2차원 정보 테이블의 상기 순위값이 수치화되고 각 좌표가 랜덤(random)하게 온(on) 또는 오프(off)되며 상기 2차원 정보테이블과 동일한 면적을 가지는 2차원 유사선형변환 테이블을 생성하고,상기 2차원 정보 테이블에 상기 2차원 유사선형변환 테이블을 연산하는 유사선형변환을 복수 번 수행하여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 상기 2차원 고유 특성 테이블의 좌표들 중 특성벡터가 변경되지 않은 좌표의 정보를 상기 깊은 진리값으로 도출하며,상기 2차원 고유 특성 테이블을 상기 깊은 진리값이 매핑된 복수 세대의 1차원 선형 채널들로 변환하여 상기 저장소에 저장하고 상기 복수 세대의 1차원 선형채널들 각각의 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 상기 저장소에 저장하되,상기 2차원 유사선형변환 테이블은,방향 회전, 반전 및 중심점의 대칭, 좌우대칭 중 어느 하나의 대응을 기반으로 연산의 회차가 증대될수록 연산변환에 대응하여 반응하는, 인공 지능 피드백 시스템."}
{"patent_id": "10-2021-0094182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 2차원 유사선형변환 테이블은,온 또는 오프 상태 중 온 상태는 1로 바꾸고, 오프 상태는 0.1로 바꾼 뒤에, 상기 대응을 기반으로 상기 연산변환에 대응하여 반응하는, 인공지능 피드백 시스템."}
{"patent_id": "10-2021-0094182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에서,상기 입력1은 복수의 그림 파일들을 포함하며,상기 입력2는 윤곽의 강도를 포함하는 인공 지능 피드백 시스템."}
{"patent_id": "10-2021-0094182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에서,공개특허 10-2023-0013437-3-상기 입력1은 복수의 문서 파일들을 포함하며,상기 입력2는 설정된 단어들을 포함하는 인공 지능 피드백 시스템."}
{"patent_id": "10-2021-0094182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "학습하기 위한 기본 재료를 포함하는 입력1 및 학습하기 위한 핵심 내용을 포함하는 입력2를 스크립트 추출 및실행기에 제공하는 단계;상기 스크립트 추출 및 실행기가 상기 입력1로부터 상기 입력2에 관련된 정보의 인기 빈도값 또는 순위값을 위한 초기 조건을 인공 지능에 제공하는 단계;상기 인공 지능이 상기 초기 조건으로부터 도출된 상기 인기 빈도값 또는 상기 순위값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정보 테이블을 생성하는 단계;상기 인공 지능과 상기 스크립트 추출 및 실행기와의 상호 작용으로 상기 2차원 정보 테이블의 해당 좌표에 상기 인기 빈도값 또는 상기 순위값을 추가하고, 상기 해당 좌표에 상기 인공 지능이 습득한 지식을 매칭(matching)하는 단계;상기 인공 지능이 상기 2차원 정보 테이블로부터 상기 2차원 정보 테이블의 상기 순위값이 수치화되고 각 좌표가 랜덤(random)하게 온(on) 또는 오프(off)되며 상기 2차원 정보 테이블과 동일한 면적을 가지는 2차원 유사선형변환 테이블을 생성하는 단계;상기 인공 지능이 상기 2차원 정보 테이블에 상기 2차원 유사선형변환 테이블을 연산하는 유사선형변환을 복수번 수행하여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 상기 2차원 고유 특성 테이블의좌표들 중 특성벡터가 변경되지 않은 좌표의 정보를 깊은 진리값으로 도출하는 단계; 및상기 인공 지능이 상기 2차원 고유 특성 테이블을 상기 깊은 진리값이 매핑된 복수 세대의 1차원 선형 채널들로변환하여 저장소에 저장하고 상기 복수 세대의 1차원 선형 채널들 각각의 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 상기 저장소에 저장하는 단계를 포함하되,상기 2차원 유사선형변환 테이블은,방향 회전, 반전 및 중심점의 대칭, 좌우대칭 중 어느 하나의 대응을 기반으로 연산의 회차가 증대될수록 연산변환에 대응하여 반응하는, 인공 지능 피드백 방법."}
{"patent_id": "10-2021-0094182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 2차원 유사선형변환 테이블은,온 또는 오프 상태 중 온 상태는 1로 바꾸고, 오프 상태는 0.1로 바꾼 뒤에, 상기 대응을 기반으로 상기 연산변환에 대응하여 반응하는, 인공지능 피드백 방법."}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공 지능 피드백 시스템을 제공한다. 인공 지능 피드백 시스템은 학습하기 위한 기본 재료를 포함하는 입력1 및 학습하기 위한 핵심 내용을 포함하는 입력2를 제공받아 상기 입력1로부터 상기 입력2에 관련된 정보의 인기 빈도 값 또는 순위값을 위한 초기 조건을 생성하는 스크립트 추출 및 실행기; 상기 스크립트 추출 및 실행기와 연결되 (뒷면에 계속)"}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 지능 피드백 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적인 인공 지능의 학습 방법은 누적된 패턴이나 그것을 실현하는 방법에 의해 많은 단계와 오랜 시간이 걸 린다. 인공 지능의 학습 방법은 인공 지능이 지식을 쌓고 인식하기 위해 외부로부터 일방적으로 주입되는 자료 가 있어야 하고, 그것에 의해서 새로운 평형점을 찾아가는 방법이다. 종래의 인공 지능의 학습 방법은 방대한 양의 정보를 입력 받고, 그 정보를 통한 회귀분석 분류에 의존하기 때문에, 학습 단계가 진행될수록 기하급수 적으로 많은 연산 및 오랜 시간이 걸리는 문제가 있다. 선행기술문헌특허문헌 (특허문헌 0001) 한국공개특허 제10-2020-0074843호"}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 학습을 위한 직관적인 피드백이 효율적으로 이루어지는 인공 지능 피드백 방 법 및 인공 지능 피드백 시스템을 제공하는 것이다. 본 발명의 과제들은 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재로 부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 달성하기 위한 본 발명의 일 면(aspect)에 따른 인공 지능 피드백 시스템은, 학습하기 위한 기본 재료를 포함하는 입력1 및 학습하기 위한 핵심 내용을 포함하는 입력2를 제공받아 상기 입력1로부터 상기 입력2 에 관련된 정보의 인기 빈도값 또는 순위값을 위한 초기 조건을 생성하는 스크립트 추출 및 실행기; 상기 스크 립트 추출 및 실행기와 연결되며, 상기 초기 조건으로부터 도출된 상기 인기 빈도값 또는 상기 순위값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정보 테이블을 생성하고, 상기 2차원 정보 테이블의 해당 좌표에 상기 인기 빈도값 또는 상기 순위값을 추가하고, 상기 해당 좌표에 상기 인공 지능이 습 득한 지식을 매칭(matching)하는 인공 지능; 상기 인공 지능과 연결되며, 상기 인공 지능이 상기 2차원 정보 테 이블로부터 도출한 깊은 진리값을 출력하는 출력부; 및 상기 인공 지능과 연결되며, 상기 인공 지능이 도출한 상기 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 저장하는 저장소를 포함하되, 상기 인공 지능은, 상기 2차원 정보 테이블로부터 상기 2차원 정보 테이블의 상기 순위값이 수치화되고 각 좌표가 랜덤 (random)하게 온(on) 또는 오프(off)되며 상기 2차원 정보테이블과 동일한 면적을 가지는 2차원 유사선형변환 테이블을 생성하고, 상기 2차원 정보 테이블에 상기 2차원 유사선형변환 테이블을 연산하는 유사선형변환을 복 수 번 수행하여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 상기 2차원 고유 특성 테이 블의 좌표들 중 특성 벡터가 변경되지 않은 좌표의 정보를 상기 깊은 진리값으로 도출하며, 상기 2차원 고유 특 성 테이블을 상기 깊은 진리값이 매핑된 복수 세대의 1차원 선형 채널들로 변환하여 상기 저장소에 저장하고 상 기 복수 세대의 1차원 선형채널들 각각의 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 상 기 저장소에 저장하되, 상기 2차원 유사선형변환 테이블은, 방향 회전, 반전 및 중심점의 대칭, 좌우대칭 중 어 느 하나의 대응을 기반으로 연산의 회차가 증대될수록 연산변환에 대응하여 반응할 수 있다. 또한, 상기 2차원 유사선형변환 테이블은, 온 또는 오프 상태 중 온 상태는 1로 바꾸고, 오프 상태는 0.1로 바 꾼 뒤에, 상기 대응을 기반으로 상기 연산변환에 대응하여 반응할 수 있다. 또한, 상기 입력1은 복수의 그림 파일들을 포함하며, 상기 입력2는 윤곽의 강도를 포함할 수 있다. 또한, 상기 입력1은 복수의 문서 파일들을 포함하며, 상기 입력2는 설정된 단어들을 포함할 수 있다. 상기 과제를 달성하기 위한 본 발명의 다른 면에 따른 인공 지능 피드백 방법은, 학습하기 위한 기본 재료를 포 함하는 입력1 및 학습하기 위한 핵심 내용을 포함하는 입력2를 스크립트 추출 및 실행기에 제공하는 단계; 상기 스크립트 추출 및 실행기가 상기 입력1로부터 상기 입력2에 관련된 정보의 인기 빈도값 또는 순위값을 위한 초 기 조건을 인공 지능에 제공하는 단계; 상기 인공 지능이 상기 초기 조건으로부터 도출된 상기 인기 빈도값 또 는 상기 순위값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정보 테이블을 생성 하는 단계; 상기 인공 지능과 상기 스크립트 추출 및 실행기와의 상호 작용으로 상기 2차원 정보 테이블의 해당 좌표에 상기 인기 빈도값 또는 상기 순위값을 추가하고, 상기 해당 좌표에 상기 인공 지능이 습득한 지식을 매 칭(matching)하는 단계; 상기 인공 지능이 상기 2차원 정보 테이블로부터 상기 2차원 정보 테이블의 상기 순위 값이 수치화되고 각 좌표가 랜덤(random)하게 온(on) 또는 오프(off)되며 상기 2차원 정보 테이블과 동일한 면 적을 가지는 2차원 유사선형변환 테이블을 생성하는 단계; 상기 인공 지능이 상기 2차원 정보 테이블에 상기 2 차원 유사선형변환 테이블을 연산하는 유사선형변환을 복수 번 수행하여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 상기 2차원 고유 특성 테이블의 좌표들 중 특성벡터가 변경되지 않은 좌표의 정보를 깊은 진리값으로 도출하는 단계; 및 상기 인공 지능이 상기 2차원 고유 특성 테이블을 상기 깊은 진리값이 매핑된 복수 세대의 1차원 선형 채널들로 변환하여 저장소에 저장하고 상기 복수 세대의 1차원 선형 채널들 각 각의 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 상기 저장소에 저장하는 단계를 포함하 되, 상기 2차원 유사선형변환 테이블은, 방향 회전, 반전 및 중심점의 대칭, 좌우대칭 중 어느 하나의 대응을 기반으로 연산의 회차가 증대될수록 연산변환에 대응하여 반응할 수 있따. 또한, 상기 2차원 유사선형변환 테이블은 온 또는 오프 상태 중 온 상태는 1로 바꾸고, 오프 상태는 0.1로 바꾼 뒤에, 상기 대응을 기반으로 상기 연산변환에 대응하여 반응할 수 있다."}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명의 인공 지능 피드백 시스템 및 방법에 따르면 다음과 같은 효과가 하나 혹은 그 이상 있다. 본 발명은 학습을 위한 직관적인 피드백이 효율적으로 이루어지는 인공 지능 피드백 시스템을 제공할 수 있다."}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 게시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될"}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수 있으며, 단지 본 실시 예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지 식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정 의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 대상물 또는 구성 요소들과 다른 대상물 또는 구성 요소들과의 상관 관계를 용이하게 기술하기 위해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더 하여 사용시 또는 동작시 대상물의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들면, 도면에 도 시되어 있는 대상물를 뒤집을 경우, 다른 대상물의 \"아래(below)\" 또는 \"아래(beneath)\"로 기술된 대상물는 다 른 대상물의 \"위(above)\"에 놓일 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 대상물는 다른 방향으로도 배향될 수 있고, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해 석될 수 있다. 비록 제1, 제2 등이 다양한 대상물, 구성요소 및/또는 섹션들을 서술하기 위해서 사용되나, 이들 대상물, 구성 요소 및/또는 섹션들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 대상물, 구성 요소 또는 섹션들을 다른 대상물, 구성요소 또는 섹션들과 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 대상물, 제1 구성요소 또는 제1 섹션은 본 발명의 기술적 사상 내에서 제2 대상물, 제2 구성요소 또는 제2 섹션일 수도 있음은 물론이다.본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 대상물는 하나 이상의 다른 구성요소, 단계, 동작 및/또는 대상물의 존재 또는 추가를 배제하지 않는다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 이하, 첨부한 도면들을 참조하여 본 발명의 실시예들을 상세히 설명하기로 하며, 첨부 도면을 참조하여 설명함 에 있어 도면 부호에 상관없이 동일하거나 대응하는 구성 요소는 동일한 참조번호를 부여하고 이에 대한 중복되 는 설명은 생략하기로 한다. 도 1은 일 실시예에 따른 인공 지능 피드백 방법을 나타낸 순서도이다. 도 2 내지 도 7은 일 실시예에 따른 인 공 지능 피드백 방법을 설명하기 위한도면이다. 우선, 도 1 및 도 2를 참조하면, 입력1 및 입력2를 스크립트 추출및 실행기에 제공한다(S100). 구체적으로, 도 2의 ①,②를 참조하면, 인공 지능이 학습하기 위한 기본 재료를 포함하는 입력1 및 학습하기 위한 핵심 내용을 포함하는 입력2를 스크립트 추출 및 실행기에 제공한다. 일례로서, 입력1은 복수의 그림 파일들을 포함하며, 입력2는 윤곽의 강도를 포함할 수 있으나, 이에 한정되지 않는다. 다른 예로서, 입력1은 복수의 문서 파일들을 포함하며, 입력2는 설정된 단어들을 포함할 수 있으나, 이 에 한정되지 않는다. 인식 지능이 학습하거나 트레이닝을 해야 하는 재료가 준비되는 입력1, 입력2가 제시되는 단계이다. 이는 인공 지능이 학습하기 위한 기본적인 재료로 구성되며, 입력1은 주로 문서 파일(pdf, txt 파일과 같은 글자 정보 등)과 그림파일(jpg, png 파일과 같은 그림 정보 등)이 될 수 있으며, 입력2는 주로 인공 지능이 학습해야 하는 핵심 단어 또는 핵심 내용이 된다. 일례로, 입력1이 문서 파일일 경우 입력2는 주로 핵심 주제어가 될 수 있으며, 입력1이 그림 파일일 경우 입력2 는 명암의 단계 또는 그림의 윤곽선이 될 수 있다. 다음, 스크립트 추출 및 실행기가 입력1로부터 입력2에 관련 된 정보의 인기 빈도값 또는 순위값을 위한 초기 조건을 인공 지능에 제공한다(S200). 구체적으로, 도 2의 ③을 참조하면, 스크립트 추출 및 실행기가 입력1로부터 입력2에 관련된 정보의 인기 빈도 값 또는 순위값을 위한 초기 조건을 인공 지능에 제공한다. 스크립트 추출 및 실행기는, Perl Script, java, 또는 언어스크립트분석기 등의 스크립트를 추출 및 실행하는 프로그램을 포함할 수 있다. 스크립트추출 및 실행기는 초기의 학습 재료에서 입력2의 내용을 바탕으로 핵심 주 제어나 핵심 내용과 관련되는 정보의 인기 빈도값 또는 순위값 등을 위한 초기 조건 등을 인식 지능에 제공한다. 다음, 인공 지능이 초기 조건으로부터 도출된 인기 빈도값 또는 순위값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정보 테이블(A)을 생성한다(S300) .구체적으로, 도 2의 ①,②를 참조하면, 인공 지능이 스크립트 추출 및 실행기로부터 제공된 초기 조건으로부터 도출된 인기 빈도값 또는 순위값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정 보 테이블(A)을 생성한다. 인공 지능은 초기의 인기 빈도값 또는 순위값 등에 대한 정보로 초기의 2차원 정보 테이블(A)을 만들 준비를 한다. 인공 지능은 초기의 인기 빈도값또는 순위값 등에 의해서, 핵심 주제어와 문서 파일 또는 그림 파일에서 찾은 핵심내용을 가지고 2차원 직각 테이블 좌표계인 2차원 정보 테이블(A)을 생성한다. 2차원 정보 테이블(A)은 행 렬과 유사한 구조를 가지며, 핵심 단어 및 핵심 정보 각각을 x축 및 y축 각각으로 하는 2차원 직각 테이블 좌표 계일 수 있다. 다음, 인공 지능과 스크립트 추출 및 실행기와의 상호 작용으로 2차원 정보 테이블(A)의 해당 좌표에 인기 빈도 값 또는 순위값을 추가하고, 해당 좌표에 인공 지능이 습득한 지식을 매칭(matching)한다(S400). 구체적으로, 도 2의 ③을 참조하면, 인공 지능과 스크립트 추출 및 실행기와의 상호 작용으로 2차원 정보 테이 블(A)의 해당 좌표에 인기 빈도값 또는 순위값을 추가하고, 해당 좌표에 인공 지능이 습득한 지식을 매칭 (matching)한다. 인공 지능과 스크립트 추출 및 실행기와의 상호 작용에 의해서 2차원 직각 테이블 좌표계인 2차원 정보 테이블 의 해당 좌표에 인기 빈도, 비중, 또는 순위값 등을 추가하고, 해당 좌표에는 인공 지능이 습득한 지식을 매칭 시켜 관리할 수 있다. 다음, 도 2 및 도 3을 참조하면, 인공 지능이 2차원 정보 테이블(A)로부터 2차원 정보 테이블(A)의 순위값이 수 치화되고 각 좌표가 랜덤하게 온(on) 또는 오프(off)되며 2차원 정보 테이블(A)과 동일한 면적을 가지는 2차원 유사선형변환 테이블(T)을 생성한다(S500). 구체적으로, 도 2의 ⑤ 및 도 3을 참조하면, 인공 지능이 2차원 정보 테이블(A)로부터 2차원 정보 테이블(A)의 순위값이 수치화되고 각 좌표가 랜덤(random)하게 온(on) 또는 오프(off)되며 2차원 정보 테이블(A)과 동일한 면적을 가지는 2차원 유사선형변환 테이블(T)을 생성한다. 인공 지능이 2차원 정보 테이블(A)과 동일한 사이즈의 2차원 유사선형변환 테이블(T)을 생성한다. 인공 지능은 2차원 유사선형변환 테이블(T)의 각각의 좌표에 해당되는 지점에 2차원 정보 테이블(A)의 정보에 대한 순위값을 그대로 투영시켜서 수치화하고, 각 좌표의 수치화된 값은 그대로 유지하되 각 좌표가 특별한 패턴이 없고 예측 이 불가능한 랜덤(random)한 온(on) 및 오프(off) 상태가 되도록 하는 2차원 유사선형변환 테이블(T)을 생성한 다. 인공 지능이 생성한 2차원 유사선형변환 테이블(T)은 유사선형변환을 수행하기 위한 연산용 테이블이다. 도 3을 참조하면, 인공 지능이 피드백 과정과 연산에 의한 도출 과정에서 연산에 사용되는 2차원 유사선형변환 테이블의 각 단계별로 어떻게 생성하고 모양은 어떻게 구성되는지를 보여주고 있다. 각 단계별 2차원 유사선형변환 테이블은 순위값은 그대로 유지하도록 구성하며, 동일한 좌표계의 랜덤 온(on) 및 오프(off) 상태를 만들어야 하는데, 이것은 각 좌표별로 랜덤하게 1 또는 0이 되게끔 배치시키되 예측이 불 가능하게 랜덤하게 생성시켜서 2차원 유사선형변환 테이블을 만든다. 일례로, 도 3의 왼쪽 테이블과 오른쪽 테 이블을 각 동일한 좌표 별로 곱셈을 취하여 2차원 유사선형변환 테이블의 랜덤한 온 및 오프 상태를 생성할 수 있다. 다음, 도 4 및 도 5를 참조하면, 인공 지능이 2차원 정보 테이블(A)에 2차원 유사선형변환 테이블(T)을 연산하 는 유사선형변환을 복수 번 수행하여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 2차원 고유 특성 테이블의 좌표들 중 특성 벡터가 변경되지 않은 좌표의 정보를 깊은 진리값으로 도출한다(S600). 구체적으로, 도 4의 ⑥,⑦,⑧및 도 5를 참조하면, 인공 지능이 2차원 정보 테이블(A)에 2차원 유사선형변환 테 이블(T)을 연산하는 유사선형변환을 복수 번 수행하여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 2차원 고유 특성 테이블의 좌표들 중 특성 벡터가 변경되지 않은 좌표의 정보를 깊은 진리값으로 도출 한다. 2차원 정보 테이블(A)에 2차원 유사선형변환 테이블(T)을 n번 연산을 하게 되면, 행렬연산과 유사한 효과를 나 타난다. 2차원 정보 테이블(A)에 2차원 유사선형변환 테이블(T)을 복수 번 연산하는 과정에서 2차원 정보 테이 블(A)은 특성 벡터를 가지는 2차원 고유 특성 테이블로 변환되며, 이때 변경되지 않고 끝까지 살아남는 정보는 실질적으로 변동되지 않는 깊은 진리값으로 도출된다. 2차원 정보 테이블(A)에 회차 별로 2차원 유사선형변환 테이블(T)을 n번 연산시키면 n회의 유사선형변환을 하게 되는 것이다. 여기서 생성되는 2차원유사선형변환 테이블(T)은 일반적인 행렬연산과는 다르게 동일한 위치의 인 자별로 곱하여 생성되며, 각 좌표는 랜덤하게 온 및 오프된다. 한편, 2차원 유사선형변환 테이블과 온 및 오프를 랜덤하게 주는 동일 면적의 직각 테이블은 임의적으로 90도, 180도, 270도, 또는 360도 회전이 가능하도록 계산하여도 연산을 통한 진리값을 도출할 수 있다. 도 4의 ⑥을 참조하면, 유사선형변환이 n회 시행되는 것을 확인할 수 있다. 도 4의 ⑦을 참조하면, 유사선형변환된 2차원 고유 특성 테이블의 값들이 더 이상 변동되지 않거나 가장 진리에 가깝도록 특성 벡터와 특성값으로 구성된다. 이것은 초기의 2차원 정보 테이블 좌표값에서 진리라고 할 수 있는 것들만 살아남게 되도록 필요한 정보 좌표계만을 찾아 내도록 하며, 이때 살아남은 좌표값에 매칭되는 정보가 깊은 진리값이 된다. 도 4의 ⑧을 참조하면 깊은 진리값을 도출하는 과정은 행렬에서 마치 고유치와 고유벡터를 구하는 것과 비슷하 지만, 행렬연산과는 다르게 각 좌표값이 랜덤 온 및 오프 상태인 고유 순위값이 매겨진 동일 면적의 2차원 유사 선형변환 테이블을 각 단계별로 2차원 정보 테이블의 동일 좌표계에 일대일로 곱셈하는 형식으로 유사선형변환 을 수행하기 때문에 행렬연산과는 차이가 있다. 도 5를 참조하면, 도 4의 ⑥,⑦,⑧에 도시된 전 과정은 원시 2차원 정보 테이블의 좌표계와 그 해당 좌표값으로 이루어지는 2차원 좌표 테이블을 동일 차원의 유사선형변환을 위한 T 테이블의 연속적인 연산과정으로 정리되며, 특성값 또는 깊은 진리값을 찾아가기 위한 특성 테이블 연산을 위한 S테이블 연산의 연속적인 결합이 라고 볼 수 있다. 이러한 2차원 좌표 테이블의 각 좌표값에서 매칭되는 인공 지능의 지식과 학습 내용이 어떻게 비중있게 좌표계 에 살아남아서, 깊은 진리값으로 도출되는지를 개념적으로 보여준다. n회의 유사선형변환은 결과적으로 각 좌표 값의 랜덤 on/off상태에 따라서, 고유 순위값이 그 해당 좌표에 주어지기도 하고 그렇지 않기도 하다. 이것을 다시 상세하게 설명하면, 각각의 좌표는 각 회차마다 스위치 그 좌표값이 on이기도 하고 off이기도 하다. 이렇게 되면, 각 좌표값에서 on인 상태의 좌표값만 그대로 유지되고 off인 상태의 좌표값은 모두 0으로 처리되어, off인 상태의 좌표값은 해당 회차의 연산에서 지식이 매칭된 2차원 정보 테이블의 해당 좌표에는 아 무런 영향을 주지 못하게 되어, 그 좌표의 지식은 중요하지 않은 것으로 인식되고, on인 상태의 좌표에 대해서 만 그 순위값의 비중만큼 중요한 정보로 인식된다. 이렇게 되면, n회의 유사선형변환이 이루어지는 동안각 회차별 on/off 상태가 랜덤하게 달라지므로, 예측 불가 능한 인기 투표처럼 작용하게 된다. 이로 인해, 끝까지 살아남아서 상대적으로 높은 비중과 순위값을 가지게 되 면, 이 상태를 반영해서 고유 특성 테이블에 의해서 고유 특성 테이블과 고유특성값을 연산에 의하여 선정하게 된다. 이것은 흡사 행렬의 고유치와 고유벡터를 구하여 순위를 정하는 것처럼 작동하지만 연산 자체가 연산에 사용하 는 변환 테이블과 지식 정보 테이블이 위치 상으로는 같은 위치에 연산시켜서 생기는 테이블이므로 행렬의 연산 과는 다른 과정을 거치게 된다. 즉, 고유특성 테이블을 찾는 과정이 독창적이다. 이상과 같은, 일 실시예에 따른 인공 지능 피드백 방법에 의해 인공지능은 입력1, 입력2로부터 궁극의 깊은 진 리값을 학습한다. 또한, 일 실시예에 따른 인공 지능 피드백 방법에 의해 2차원 정보테이블로부터 변환된 2차원 고유 특성 테이블은 1세대 정보 테이블 층을 생성한다. 인공 지능 피드백 방법에 의해 또 다른 정보로부터 인공 지능이 학습을 하고 깊은진리값을 찾는 과정을 통해서 2세대, 3세대, 4세대, n세대 2차원 정보 테이블 층 각각을 생성한다. 인공 지능은 생성된 n세대별 2차원 정보 테이블 층들을 이용해 보다 쉬운 비교와 분석을 위하여, (nxn) 형 2차원 좌표계를 (nxn) 개의 채널을 가지는 선 형으로 변환하여 비교 분석할 수 있고, 이를 이용하여 2차원 좌표계가 선형 맵핑될 수 있다. 다음, 도 6 및 도 7을 참조하면, 인공 지능이 2차원 고유 특성 테이블을 깊은 진리값이 매핑된 복수 세대의 1차 원 선형 채널들(1세대 지식층 내지 n세대 지식층)로 변환하여 저장소에 저장하고 상기 복수 세대의 1차원 선형 채널들(1세대 지식층 내지 n세대 지식층) 각각의 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별(지식 범 주1 내지 지식 범주n)로 정리하여 저장소에 저장한다(S700). 구체적으로, 도 6을 참조하면, 인공 지능이 저장소를 이용하여, 2차원 고유 특성 테이블의 2차원 좌표들을 모두 선형의 채널값을 가지는 복수 세대의 1차원 선형 채널들(1세대 지식층 내지 n세대 지식층)로 변환하여 깊은 진 리값들을 해당 채널에 매핑(mapping)하여 채우고 복수 세대의 1차원 선형 채널들 각각의 깊은 진리값을 연결하 여 정보 및 지식의 맥락을 형성한다. 일례로, 인공 지능이 각 세대에서 획득된 깊은 진리값으로 구성된 2차원 고유 특성 테이블이 (nxn) 형 2차원 좌 표계라면, 각 좌표를 선형의 (nxn) 개의 채널로 맵핑할 수 있고, 도 6에서 세대별 깊은 진리값으로 매겨진 붉은 색 막대로 표시된 해당 채널은 다음 세대에 연관된 깊은 진리값으로 매겨진 지식층의 값과 연결될 수 있다. 이 렇게 몇 개의 지식층을 연관시키면, 지식의 맥락이 추론 및 형성될 수 있다. 그리고, 도 7을 참조하면, 인공 지능이 정보 및 지식의 맥락을 구성하는 주요 정보들을 저장소에서 범주별(지식 범주1 내지 지식 범주n)로 나누어 정리 및 저장하여 체계화된 지식을 구축한다. 일례로, 인공 지능은 여러 세대 를 거쳐서 연결된 깊은 진리값 또는 깊은 지식의 맥락에 의해서 구축된 지식들을 저장소를 이용하여 지식의 범 주별로 나누어서 지식들을 정리할 수 있다. 일 실시예에 따른 인공 지능 피드백 방법은 초기의 입력 자료와 핵심 키워드를 통한 입력1, 입력2를 바탕으로 좌표계를 구축하고, 각 좌표값에 빈도, 우선 순위 등에 따른 상대적인 순위값이 주어지고, 2차원 좌표 테이블에 구축된 좌표계와 좌표값에 인공 지능이 발견한 지식을 매칭하여 누적하는 방식으로 초기부터 효율적으로 지식을 쌓아나갈 수 있다. 따라서, 일 실시예에 따른 인공 지능 피드백 방법은 최종 목적인 깊은 진리값을 도출하여 최종 결론에 도달하는 방식이 종래보다 효율적이며, 이것을 개념적으로 구현하여 정보를 처리 분석하고 인공 지능이 보다 효율적으로 최종 결론에 도달하도록 도와줄 수 있을 뿐만 아니라, 인공 지능의 지식 구축을 기반으로 하는 핵심 기술로서 활용할 수 있어 그 효용성이 증대될 수 있다. 즉, 학습을 위한 직관적인 피드백이 효율적으로 이루어지는 인공 지능 피드백 방법이 제공된다. 이하, 도 8 내 지 도 10을 참조하여 다른 실시예에 따른 인공 지능 피드백 시스템을 설명한다. 다른 실시예에 따른 인공 지능 피드백 시스템은 상술한 일 실시예에 따른 인공 지능 피드백 방법을 수행할 수 있으나, 이에 한정되지는 않는다. 도 8은 다른 실시예에 따른 인공 지능 피드백 시스템을 나타낸 도면이다. 도 8을 참조하면, 다른 실시예에 따른 인공 지능 피드백 시스템은 스크립트 추출 및 실행기, 인공 지능, 출력부, 저장소를 포함 한다. 스크립트 추출 및 실행기는 학습하기 위한 기본 재료를 포함하는 입력1 및 학습하기 위한 핵심 내용 을 포함하는 입력2를 제공받아 입력1로부터 입력2에 관련된 정보의 인기 빈도값 또는 순위값을 위한 초기 조건 을 생성한다. 인공 지능은 스크립트 추출 및 실행기와 연결되며, 초기조건으로부터 도출된 인기 빈도값 또는 순위 값에 의한 핵심 단어 및 핵심 정보 각각을 양 축으로 하는 행렬 형태의 2차원 정보 테이블을 생성하고, 2차원 정보 테이블의 해당 좌표에 인기 빈도값 또는 순위값을 추가하고, 해당 좌표에 인공 지능이 습득한 지식을 매칭 (matching)한다. 인공 지능은 2차원 정보 테이블로부터 2차원 정보 테이블의 순위값이 수치화되고 각 좌표 가 랜덤(random)하게 온(on) 또는 오프(off)되며 2차원정보 테이블과 동일한 면적을 가지는 2차원 유사선형변환 테이블을 생성하고, 2차원 정보 테이블에 2차원 유사선형변환 테이블을 연산하는 유사선형변환을 복수 번수행하 여 각 좌표가 특성 벡터를 가지는 2차원 고유 특성 테이블을 형성하고 2차원고유 특성 테이블의 좌표들 중 특성 벡터가 변경되지 않은 좌표의 정보를 깊은 진리값으로 도출하며, 2차원 고유 특성 테이블을 깊은 진리값이 매핑 된 복수 세대의 1차원 선형 채널들로 변환하여 저장소에 저장하고 복수 세대의 1차원 선형 채널들 각각의 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 저장소에 저장한다. 출력부는 인공 지능과 연결되며, 인공 지능이 2차원정보 테이블로부터 도출한 깊은 진리값을 출 력한다. 저장소는 인공 지능과 연결되며, 인공 지능이 도출한 깊은 진리값을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 저장한다. 도 9 및 도 10은 다른 실시예에 따른 인공 지능 피드백 시스템을 설명하기 위한 도면이다. 도 8 및 9를 참조하 면, 인공 지능인 인식프로그램이 학습해야 할 초기 입력에 해당하는 문서 또는 그림에 대한 정보인 입력1과 우 선적으로 다루어야 하는 우선 순위 핵심 단어에 해당하는 입력2를 보여주고 있다. 인공 지능에 해당하는 인식프 로그램은 입력 자료들과 대화 또는 검토하는 수단을 마련해주는 스크립트 추출 및 실행기와 상호작용한다. 스크 립트 추출 및 실행기는 강력한 문서 또는 입력 파일의 정보를 검색하는 Perl 스크립트와 같은 시스템 언어로, 인식프로그램에게 필요한 데이터를 추출하고 빈도값을 계산할 때 인식프로그램이 활용한다. Perl 스크립트에는 단어 추출 기능, 인접 단어 추출, 문장의 유사도에 대한 기본적인 검색 및 통계 등의 기능을 수행할 수 있다. 인공 지능은 이러한 탑재된 스크립트 문법의 특별 창구를 통하여 분석 자료를 수집 및 피드백을 수행하여, 특정 정보를 지식화하는 2차원 정보 테이블 또는 학습한 결과를 2차원 좌표테이블의 좌표에 매칭하여 저장한다. 2차 원 좌표 테이블은 입력1과 입력2로 대표되는 정보 좌표축이 되는 좌표를 기반으로 할 수 있다. 이때 정보 좌표 축은 계산의 편의성에 따라서 수직선 형태로 변환할 수 있다. 정지명령은 인공 지능이 몇 회 차의 학습을 수 행 해야 하는 지를 초기 조건으로 설정하는 수행한다. 특별한 초기 조건이 주어지지 않으면, 인식프로그램인 인공 지능은 n회의 유사선형변환 과정을 거치면서, 특성 벡터 테이블 또는 특성 테이블의 값이 거의 변동되지 않는 시점까지 마치 행렬의 고유치와 고유벡터를 구하여 더 이상 피드백과 연산이 필요하지 않은 깊은 진리값을 찾아 내는 데까지 학습한다. 정지명령에 대한 특별한 입력이 없는 경우는 그렇게 작동하고 정지명령이 주어지게 되면 정지명령과 함께 인공 지능의 학습과 연산은 종료되고 학습 결과인 깊은 진리값을 출력부에 출력한다. 이때, 인공 지능은 깊은 진리값 을 연결하여 형성된 지식의 맥락을 범주별로 정리하여 저장소에 저장하여 체계화된 지식을 구축할 수 있다.도 10을 참조하면, 해당하는 스크립트 추출, 스크립트 실행, 인공지능인 인식프로그램이 어떻게 상호작용하는지 를 개념적으로 보여주고 있다. 인공 지능인 인식프로그램은 스크립트 언어를 조작함으로써, 필요한 정보와 단어 들을 검색 분석하게 되는 구조임을 확인할 수 있다. 이렇게 인식프로그램은 스크립트추출 및 실행기를 이용하여 입력1과 입력2를 가지고 계속해서 스스로 피드백을 하고 2차원 정보 테이블과 2차원 테이블 좌표계를 만들어서 지식에 대한 비중을 인기 빈도값 또는 순위값 형태 로 좌표 분포를 만들고 그 좌표에 대한 구체적인 문장 정보는 동일한 사이즈의 좌표계에 따로 저장하여, 그 좌 표에 매칭이 되는 정보는 계속 누적 저장한다. 상술한 모든 정보는 인공 지능에 의해 저장소에 저장될 수 있다. 이하, 도 11을 참조하여 인공 지능 피드백 방법 및 인공 지능 시스템을 이용한 학습의 일례로서, 그림을 통한 트레이닝을 설명한다. 도 11은 인공 지능 피드백 방법 및 인공 지능 시스템을 이용한 그림을 통한 트레이닝을 나타낸 이미지이다. 도 11을 참조하면, 그림을 통한 트레이닝은 jpg 파일의 특징을 찾아서 깊은 진리를 도출하고 종합적인 공통점을 찾아서 그림을 만들어 내는 과정일 수 있다. 구체적으로, 일정한 크기의 픽셀을 가진 jpg 파일을 학습시킨다. 그림 파일의 특징을 위해서, 윤곽선 위주로 인기 빈도값(변수의 가중치와 유사개념)을 크게 주고, 그 외의 것은 특징적인 것이 아니라고, 전제 조건을 준다. 그림 파일도 일종의 문서로 볼 수 있으므로, 그림파일에서 각 픽셀 의 값들을 인식프로그램이 인식하여, 인기 빈도값을 스스로 산정하고, 해당 픽셀에 누적값을 세워간다. 일정시 간이 지나면, 누적 분포값에 의한 특성값들이 주어지고, 이특성값의 순위에 따라서 순위값을 다시 매기게 된다. 여기서, 순위값은 가중치와 비슷한 역할을 한다. 각 픽셀은 일정한 평면에서 즉 행렬같은 테이블의 각 좌표로 매칭할 수 있으며, 행렬모양의 테이블은 곧 그림에 대한 정보값 들의 분포를 가지게 되며, 이러한 값들로부터, 인식프로그램이 만들어 놓은 행렬모양 테이블의 정 보값들에 대한 각 픽셀의 순위값들은 그대로 유지하되, 동일 차원의 행렬모양 테이블을 만들고 각 테이블의 각 좌표에 대하여, 순위값이 표시되기도 하고, 표시되지 않기도 하도록 하는 랜덤한 테이블을 만들고, 이 테이블을 행렬의 선형변환처럼 작용시켜 깊은 진리값을 찾도록 한다. 각 랜덤한 테이블에 의한 유사선형변환을 스크립트 실행기에서 수행하면, 각각의 변환된 테이블에는 깊은 진리 값을 나타내는 특성 벡터가 생성되는데 이것은 마치 행렬의 고유치와 고유벡터와 비슷하게 행동하게 된다. 특성 벡터값이 생기면, 특성벡터의 특성치의 크기에 따라서 순위를 매길 수 있고, 이것은 그림에서는 그림의 특성을 나타내는 픽셀을 강조하는 역할을 하며, 일종의 깊은 진리값을 찾는 과정을 완성한다. 완성된 결과는 학습한 모 든 그림으로부터 일종의 공통점을 찾아서 완성하게 되는 표준그림이 된다. 이하, 도 12를 참조하여 인공 지능 피드백 방법 및 인공 지능 시스템을 이용한 학습의 다른 예로서, 문서를 통 한 트레이닝을 설명한다. 도 12는 인공 지능 피드백 방법 및 인공 지능 시스템을 이용한 문서를 통한 트레이닝 을 나타낸 이미지이다. 도 12를 참조하면, 문서를 통한 트레이닝은 txt 문서를 통해서 관련성을 찾아 깊은 진리를 만드는 과정일 수 있 다. 구체적으로, 일정한 크기의 가지는 문서, 여기서는 txt 파일을 선택하여 학습시킨다. 학습과정은 입력1에 txt파일을 입력시키고, 입력2에서는 핵심 단어 또는 관심 사항을 입력한다. 입력2의 제시어 또는 관심 단어를 가지고, 핵심 단어의 인기 빈도분포와 핵심 단어가 들어있는 문장을 찾아서 빈도에 따른 특성값을 준다. 핵심 단어는 행렬 모양의 테이블에 매칭하여 학습하는 지식의 층을 만들고, 그 빈도 분포가 어느 좌표에 해당하 는지 좌표값에 매칭한다. 실시예에서는 약 7개 정도의 핵심단어를 나열하고, 3개의 단어에 의한 조합을 고려한 7X7 행렬과 유사한 테이블을 구성하여, 관련 단어를 축으로 하는 좌표값을 만들게 된다(좌표계에서는 숫자로 표 시함). 각 좌표에는 인기빈도에 따른 순위값이 매겨지고, 그 순위값을 각 좌표에 부여한 후, 각 좌표의 그 값들 은 인식프로그램이 인식하여, 인기 빈도값을 스스로 산정하고, 해당 좌표에 누적값을 세워간다. 일정시간이 지나면, 누적 분포값에 의한 특성값들이 주어지고, 이특성값의 순위에 따라서 순위값을 다시 매기게 된다. 여기서 순위값은 가중치와 비슷한 역할을 한다. 각 좌표는 일정한 평면에서 즉 행렬같은 테이블의 각 좌 표로 매칭할 수 있으며, 행렬 모양의 테이블은 각 좌표의 정보값들의 분포를 가지게 되며, 이러한 값들로부터, 인식프로그램이 만들어 놓은 행렬 모양 테이블의 정보값들에 대한 각 좌표의 순위값들은 그대로 유지하되, 동일 차원의 행렬 모양 테이블을 만들고 각 테이블의 각 좌표에 대하여, 순위값이 표시되기도 하고, 표시되지 않기도 하도록 하는 랜덤한 테이블을 만들고, 이 테이블을 행렬의 선형변환처럼 작용시켜 깊은 진리값을 찾도록 한다. 일정시간이 지나면, 테이블의 각 좌표가 가지는 순위값은 그대로 유지하되 랜덤하게 값을 나타내는 특성벡터가 생성되는데, 이것은 마치 행렬의 고유치와 고유벡터처럼 행동하게 된다. 특성 벡터값이 생기면, 특성 벡터의 특 성치의 크기에 따라서 순위를 매길 수 있고, 이것은 txt 또는 문서에서는 핵심 단어가 들어가는 의미 있는 문장 들을 강조하고 조합 또는 융합에 의한 일종의 깊은 진리값을 찾는 과정을 완성한다. 완성된 결과는 학습한 문서 로부터 일종의 종합적인 결론을 도출하는 결과를 가지게 된다. 도 13은 도 9에 기반하는 또 다른 실시예에 따른 인공 지능 피드백 시스템을 설명하기 위한 도면이다. 전술한 내용을 기반으로 도 13을 참조하면, 인공지능 피드백시스템의 구현방식은 별도의 저장소를 가지고 있으며，이를 활용하여 세대를 거듭하면서 누적되는 지식을 공유하고，세대간 영향이 큰 지식들을 연결하면서 지식의 전통과 맥락을 만드는 방법을 포함한다. 본 발명은 인공지능 피드백시스템의 기능을 그대로 유지하면서, 좀더 강화되는 피드백과 깊은진리값을 획득하도 록 하는 절차가 하나더 추가된다. 따라서 본 발명에서 추구하는 방법은 10개의 단계가 필요하다. 추가되는 절차 는 테이블연산의 방식을 다양하게 작동하도록 하는 것이다. 진리값이 0이 아닌 것은 0이 되지 않도록 유지하기 위하여 본 발명의 추가절차에는 테이블연산의 연속성을 위하여，0은 아니지만 상대적으로 작은값을 0에 대한 대 체값으로 연산테이블을 만드는 것이다. 본 발명에서는 예시적으로 0이 되는 부분을 0.1 로 대체하여 수행하는 방법도 추가하였다. 이렇게 하여, 연산자로 작용하는 테이블의 방향을 회전을 시키든 180도 반전을 일으키든 중심점의 대칭을 이용하든 아니면 앞면과 뒷면을 바꾸든 상관없이 연산의 회차가 증대될수록 어떠한 연산변환에 대해서도 반응하여 깊은 진리값을 얻게 되는 구조를 만드는 것이다. 첫째는 인식프로그램（인공지능）이 공부하거나 트레이닝을 해야하는 재료가 준비되는 입력1，입력2가 제시되는 단계이다. 이는 인공지능이 공부하기 위한 기본적인 재료로 구성되며，입력1은 주로 문서파일（pdf，txt 파일과 같이 글자정보 등）과 그림파일（jpg, png파일과 같이 그림같은 정보 등）이 될수 있으며，입력2는 주로 인공지 능이 공부해야하는 핵심단어 또는 핵심내요이 된다, 예를 들어서 문서 파일일 경우에는 주로 핵심주제어가 될것 이며，그림파일에서는 명암의 단계 또는 그림의 윤곽선이 될 것이다. 둘째는 스크립트 추출실행기의 단계로써 초기의 공부재료에서 입력2의 내용을 바탕으로 핵심주제어나 핵심내용 과 관련되는 정보의 인기빈도값 또는 순위값 등을 위한 초기조건등이 인식프로그램（인공지능）에게 주어진다. 셋째는 인식프로그램이 작동하는 단계로써 인식 프로그램은 초기의 인기 빈도값 또는 순위값등에 대한 정보로 초기의 2차원 정보테이블을 만들 준비를 하게 된다. 넷째는 인식프로그램（인공지능）이 2차원 정보테이블을 만드는 단계이다. 이 단계에서는 초기의 인기빈도값 또 는 순위값등에 의해서，핵심주제어와 문서/그림 파일에서 찾은 핵심내용을 가지고 2차원 직각 테이블 좌표계를 만들게 된다, 이것을 다른 말로 2차원 정보테이블이라고 한다. 모양은 우리가 알게되는 행렬과 비슷한 구조를 가지게 되지만，이것은 핵심단어와 핵심정보를 축으로 하는 2차원 테이블 좌표계가 된다. 다섯째는 2차원 테이블 좌표계에 인공지능과 스크립트 추출/실행기와의 상호작용에 의해서 해당좌표값의 인기빈 도 또는 비중 또는 순위값을 좌표계에 매기고 해당되는 좌표에는 인공지능이 습득한 지식을 매칭시켜서 관리하 는 단계이다. 여섯째는 2차원 정보테이블과 동일한 사이즈의 2차원 테이블을 생성하여，각각의 좌표에 해당되는 지점에 2차원 정보테이블의 정보에 대한 순위값을 그대로 투영시켜서 수치화 하고 각 좌표의 수치화된 값은 그대로 유지하되 각 좌표가 특별한 패턴이 없고 예측이 불가능한 랜덤한 on/off상태가 되도록 하는 2차원 테이블을 만들어내는 과정이다. 이 단계에서 생성되는 2차원 테이블은 유사선형 변환을 수행하기 위한 연산용 테이블을 만드는 단계 이다. 일곱째는 유사선형변환을 통해서 이루어지는 결과를 도출하는 단계이다. 이 단계는 유사선형변환용 2차원 테이 블에 의해서 여러번 연산을 하게되면，이것은 행렬연산과 유사한 효과를 나타내는데，이러한 연산과정에서 2차 원 정보테이블은 특성벡터를 가지는 특성정보테이블로 변환하게 되며，이땐 변경되지 않고 끝까지 살아남는 정 보는 거의 변동되 지 않는 깊은 진 리값으로 도출되는 단계이다. 이러한 과정을 통해서 인공지능은 입력1，입력2를 통해서 궁극의 깊은 진리값을 찾게 되며 이렇게 형성된 2차원 정보테이블은 1세대 정보테이블 충을 구성한다. 이와 마찬가지로 또다른 정보로부터 인공지능이 공부를하고 깊 은 진리값을 찾는 과정을 통해서 2세대 정보테이블 층을 만들며，그다음도 마찬가지 방법으로 3세대，4세대，n 세대의 2차원 정보테이블 층을 각각 만들어내게 된다. 여덟째는 유사선형변환용 2차원 테이블에 의한 여러번의 연산과정에서 앞서실행된 연산과정을 더욱 강화하기 위 하여，다양한 변환을 단계와 단계사이에 수행을 할수 있다는 것이다. 이때의 변환과정은 그림1에서 제시된 것처 럼，회전， 대칭，점대칭，축대칭，반전 등의 어떠한 형태로든 변환연산을 수행하는 것이다. 여기서 변환연산은 기존의 0으로 처리된 테이블 값은 아주작은값이 0.1 정도 수준으로 대체한다. 이것은 다양한 변환작업을 할 경우에 살아남은 리값들이 상대적으로 축소되는 현상을 누적값을 적용할 때 완화시켜주는 역할을 하게 된다. 이러한 다양한 변환연산을 추가 삽입함으로써 2세대 정보테이블，3세대，4세대， n세대의 2차원 정 보테이블 층을 각각 만들어낼 때 더욱 강화된 누적진리값을 도출하는 것을 가능하게 한다. 아홉째는 인식프로그램이 저장소를 이용하여，2차원 정보테이블 층의 2차원 좌표들을 모두 선형의 채널값으로 변환하여 깊은 진리값들을 선형의 해당채널에 맵핑하여 채우고 세대별 채널들을 연결하여，정보/지식의 맥락을 만드는 과정이다. 열 번째는 정보/지식의 맥락을 구성하는 중요정보들을 저장소에서 범주별로 지식범주를 나누 어서 체계화된 지식을 구축하는 과정이다. 도 14 내지 도 18는 도 8에 기반하는 또 다른 실시예에 따른 인공지능 피드백 시스템을 나타낸 도면이다. 전술 한 내용을 기반으로 도 14 내지 도 18를 참조하면, 도 14는 앞서 보인 발명을 구현하는 시스템의 기본개념의 구 조를 보여주는 것이다. 도 15는 스크립트 추출/실행기와 인식프로그램의 상호작용이 어떻게 이루어 지는지를 상 호작용 관계를 보여주고 있다. 도 16과 도 17은 인공지능 피드백 시스템의 작동개념 및 상세구성을 보여주고 있다. 도 18은 인공지능의 인기 비도값 또는 중요도에 따른 정보를 입력1과 입력2에 따른 좌표축에 따라서 공부하여 얻게된 비중 또는 인기빈도 값의 분포를 나타내는 2차원 좌표테이블 A를 가지고 어떻게 깊은 진리값에 도달하는지를 보여주고 있다. 도 19는 각 회차 또는 각 단계별 유사선형변환을 수 행할 때 연산자로 작용하게 될 고유순위값을 가진 변환테이블의 구조를 보여주고 각 좌표별 on/off상태를 보여 주는 도면이다. 도 14에서 ①번과 ②번은 인식프로그램（인공지능）이 공부해야 할 초기 입력에 해당하는 문서 또는 그림에 대 한 정보 \"입력1\" 과 우선적으로 다루어야 하는 우선순위 핵심단어에 해당하는 \"입력2\" 를 보여주고 있다. 도 14 에서 ③번과 ④번은 인공지능에 해당하는 인식프로그램 ⑤번이 입력자료들과 대화 또는 검토하는 수단을 마련해 주는 스크립트 추출/ 또는 스크립트 실행기로 생각하면 된다. ③번과 ④번은 강력한 문서 또는 입력파일의 정보 를 검색하는 Perl가 같은 시스템 언어로，인식프로그램에게 필요한 데이터를 추출하고 빈도값을 계산할 때인식 프로그램이 활용하게 된다. Perl 스크립트에는 단어 추출기능，인접단어 추출，문장의 유사도에 대한 기본적인 검색/통계등의 기능을 수행 할 수 있다. 인공 지능은 이러한 탑재된 스크립트 문법의 특별창구를 통하여 분석자료를 수집 및 피드백을 수행 하여，특정정되화본 2차원 정보테이블 또는 공부한 결과를 2차원 좌표테이블의 좌표에 매칭하여，저장하게 된다. 2차원 좌표테이블은 “입력 1\" 과 \"입력 2\" 로 대표되는 정보 좌표축이 되는 좌표를 기반으로 한다. 이때 정보좌표축은 계산의 편의성에 따라서 수직선 형태로 변환할 수 있다. 번 은 인공지능이 몇회차의 공부를 해야하는지를 초기조건으로 주는 기능을 수행한다. 특별한 초기조건이 주어지지 않으면，인식프로그램 ⑤번은 n 회의 유사선형변환 과정을 거치면서，특성벡터 테이블 또는 특성테이블의 값이 거의 변동되지 않는 시점까지 마 치 행렬의 고유치와 고유벡터를 구하여 더 이상 피드백과 연산이 필요하지 않은 깊은 진리값을 찾아내는데까지 공부를 하게 된다. ⑥번 정지명령에 대한 특별한 입력이 없는 경우는 그렇게 작동하고 정지명령이 주어지게 되 면 정지명령과 함께 인공지능의 공부와 연산은 종료하고 ⑦번의 공부결과를 출력하게 된다. 도 15는 도 14의 기본개념도에서 ③번, ⓒ번, ⑤번에 해당하는 스크립트 추출， 스크립트 실행，인식프로그램（ 인공지능）이 어떻게 상호작용하는지를 개념적으로 보여주고 있다. 도 15에서처럼 인식프로그램（인공지능）은 스크립트 언어를 조작함으로써，필요한 정보와 단어들을 검색 분석하게 되는 구조임을 알수 있다. 이렇게 인식 프로그램은 스크립트 추출/실행기를 이용하여 입력1 과 입력2를 가지고 계속해서 스스로 피드백을 하고 2차원 정보테이블과 2차원 테이블 좌표계를 만들어서 지식에 대한 비중을 인기빈도값 또는 순위값 형태로 좌표분포를 만들고 그 좌표에 대한 구체적인 문장 정보는 동일한 사이즈의 좌표계에 따로 저장하여，그 좌표에 매칭이 되는 정보는 계속 누적 저장하게 된다. 도 16과 도 17은 인공지능 피드백 시스템의 실행 및 작동개념을 상세하게 보여주고 있다. 도 16은 입력1과 입력 2를 가지고，스크립트 추출/실행기 와 인식프로그램（인공 지능）이 자체 피드백과 자체 트레이닝을 통해서，초기의 2차원 정보테이블을 생산하고，2차원 정보테이블의 각 좌표에 해당되는 지식을 매칭하여 2차원 정보테이블 좌표계를 관리하는 과정을 보여주고 있다. 입력에서 좌표계를 생산하고 관리하는 과정은 도 16의 ①번,②번, ③ 번, ④번이 이러한 과정에 해당된다. 이과정을 통해서 각 좌표계에 대하여，진정한 진리값을 찾기 위한 유사선 형변환을 수행하는데， 유사선형변환을 수행하기 위하여， 선형변환테이블을 동일차원으로 만들게 된다. 유사선 형변환을 위한 동일차원의 변환테이블을 생성하는 과정이 도 16의 번에 해당되는 과정이다. 도 17은 도 16의 과정에 의해서 생성되는 유사선형변환 2차원 테이블을 가지고 초기의 2차원 정보/지식 테이블 을 어떻게 변환하고，어떻게 깊은 진리값이 도출되는지를 보여주고 있다. 유사선형변환을 n회 시행하는 모습은 도 17의 ⑦ 번을 통해서 알수 있고，도 17의 번은 유사선형변환된 2차원 테이블의 값들이 더 이상 변동되지 않 거나 가장 진리에 가깝도록 특성벡터와 특성값으로 구성된 2차원 테이블이 만들어지게 된다. 이것은 초기의 지 식/정보 2차원테이블 좌표값에서 정말로 진리라고 할수 있는 것들만 살아남게 되도록 필요한 정보좌표 계만을 찾아내도록 하며，이때 살아남은 좌표값에 매칭되는 정보가 깊은진리값이 된다. 깊은 진리값을 도출하는 과정은 행렬에서 마치 고유치와 고유벡터를 구하는 것과 비슷하지만 본발명에서 행렬연산과는 다르게 고유 순위값이 매 겨진동일사이즈의 유사선형변환 2차원테이블의 각 좌표값이 예측이 불가능한 랜덤하게 on/off상태를 각 단계별 로 만들어서 생성되는 각 단계별 유사선형변환 2차원테이블의 각 좌표값을 동일 좌표계에 일대일로 곱셈하는 형 식으로 변환을 수행하기 때문에 행렬연산과는 차이가 있다. 본발명에서는 이러한 유사선형변환이 매우 특징적이 다. 도 18은 도 16과 돠 17의 개념에서 유사선형변환이 상세하게는 어떤의미인지 보여준다. 도 18에서처럼，도 17의 전과정은 원시 2차원 지식정보테이블의 좌표계와 그 해당 좌표값으로 이루어지는 2차원 좌표테이블을 동일차원 의 유사 선형변환을 위한 T 테이블의 연속적인 연산과정으로 정리되며，특성값 또는 깊은 진리값을 찾기 위한 특성테이블 연산을 위한 S테이블 연산의 연속적인 결합이라고 볼수 있다. 도 18은 이러한 2차원 좌표테이블의 각 좌표값에서 매칭되는 인공지능의 지식과 공부내용이 어떻게 비중있게 좌표계에 살아남아서，깊은 진리 값으 로 도출되는지를 개념적으로 보여준다. n 회의 유사선형변환은 결과적으로 각 좌표값의 랜덤 on/off상태에 따라 서，고유순위값이 그 해당좌표에 주어지기도 하고 그렇지 않기도 하다. 이것을 다시 상세하게 설명하면 각각의 좌표는 각 회차마다 스위치 그 좌표값이 on이기도 하고 off이기도 하다. 이렇게 되면，각 좌표값에서 on인 상태 의 좌표값만 그대로 유지되고 off인 상태의 좌표값은 모두 0으로 처리되어，off인 상태의 좌표값은 해당 회차의 연산에서 지식/정보 테이블의 해당좌표에는 아무런 영향을 주지못하게 되어，그 좌표의 지식은 중요하지 않은 것으로 인식되고，on인 상태의 좌표에 대해서만 그 순위값의 비중만큼 중요한 정보로 인식되게 된다. 이렇게 되 면，n회의 유사선형변환이 이루어지는 동안 각 회차별 on/off 상태가 랜덤하게 달라지므로，예측불가능한 인기 투표처럼 작용하게 된다. 이렇게 해서，끝까지 살아남아서 상대적으로 높은 비중과 순위값을 가지게 되면，이 상태를 반영해서 고유특성 테이블에 의해서 고유특성테이블과 고유특성값을 연산에 의하여 선정하게 된다. 이것은 홉사 행렬의 고유치와 고유벡터를 구하여 순위를 정하는것처럼 작동하지만 연산자체가 연산에 사용하는 변환테이블과 지식정보테이블 이 위치상으로는 같은위치에 연산시켜서 생기는 테이블이므로 행렬의 연산과는 다른과정을 거치게 된다. 따라서 본 발명에서는 고유특성 테이블을 찾는 과정이 독창적이라고 할 수 있다. 도 19는 도 18의 인식프로그램이 피드백 과정과 연산에 의한 도출과정에서 연산에 사용되는 유사선형변환 테이 블의 각 단계별로 어떻게 생성하고 모양은 어떻게 구성되는지를 보여주고 있다. 도 3에서 각 단계별 유사선형변 환 테이블은 순위값은 그대로 유지하도록 구성한다. 그리고 동일한 좌표계의 랜덤 on/off상태를 만들어야 하는 데，이것은 각좌표별로 랜덤하게 1 또는 0이 되게끔 배치시키되 예측이 불가능하게 랜덤하게 생성시켜서 2차원 테이블을 만든다. 그리고 도 3의 왼쪽 테이블과 도 3의 오른쪽 테이블을 각 동일한 좌표별로 곱셈을 취하여 유 사선형변환 2차원 테이블의 랜덤 on/off상태를 생성시키게 된다. 이렇게 회차별로 n회 진행시키면 n회의 유사선 형변환을 하게 되는 것이다. 여기서의 유사선형변환용 테이블 생성도 일반적인 행렬연산과는 다르게 동일한 위치의 인자별로 곱하여서 생성 하도록 하며，본 발명에서는 이러한 방법을 통하여 효율적으로 랜덤하게 on/off되는 유사선형변환 테이블을 만 들 수 있다. 추가적으로 정보테이블의 패턴과 매칭을 더욱 명확하게 하기 위하여 도 3에서 보여지는 것처럼 도 3의 오른쪽 편에 있는 2차원 테이블 on/off상태에서 도 19와 같이 2차원 테이블의 on/off상태를 on상태는 1로 off상태는 0.1 로 바꾸어서 회전，반전，축대칭，점대칭，앞과 뒤를 바꾸는 등의 모든 유사선형변환을 이용하여 ，깊은 진리값을 도출할 수도 있다.전술한 바와 같이 도 6은 깊은 진리값이 도출되는 2차원 지식/정보테이블의 좌표계의 각 좌표값들을 선형 채널 로 맵핑하는 과정을 세대별 2차원 정보/지식 테이블 층 또는 세대별 지식층을 n세대까지 맵핑하는 것을 보여준 다. 조금 더 상세하게 설명하면，각 세대에서 획득된 깊은 진리값으로 구성된2차원 정보/지식 테이블은 2차원 격자좌표계와 동일하다. 따라서 2차원 좌표계를 예를 들어서 (nxn)형 2차원 좌표계라면 이것은 각 좌표를 선형 의 (nxn)개의 채널로 맵핑할수 있고，세대별 깊은 진리값으로 매겨진 그림 7의 붉은색 막대로 표시된 해당 채널 은 다음 세대의 연관된 깊은 진리값으로 매겨진 지식충의 값과 연결될 수 있다. 따라서 이렇게 몇 개의 지식충을 연관시키면，지식의 맥락을 추론할 수 있다. 도 7은 여러세대를 거쳐서 연결된 깊은 진리값 또는 깊은 지식의 맥락에 의해서 구축된 지식들을 저장소를 이용하여 지식의 범주별로 나누어서 지 식들을 정리하는 것을 설명하고 있다. 도 20은 추가적인 도 13 내지 도 19에 따른 절차가 적어도 일부 반영된 인공지능 트레이닝 결과를 나타낸 것이다. 제시된 것처럼, 변환테이블의 변환방식을 반전, 축대징, 점대칭, 회전대칭 등의 각종 다양한 방법으로 임의 적으로 변환을 누적시키고, on/off값을 각각 1.0과 0.1로 했을 때 보다 더 뚜렷한 결과가 도출됨을 알 수 있다. 실제 결과를 시각화 하기 위하여, 그림의 윤곽선의 강도가 인기빈도값이라는 조건으로 누적된 최대값에 도달되 는 값들만을 선별하여, 최적 트레이닝 값으로 도출하는 과정임. 시각화를 통하여, 비교적 쉽게 확인하도록, 그 림을 통해서 트레이닝을 추가적으로 수행하였다."}
{"patent_id": "10-2021-0094182", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 첨부된 도면을 참조하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식 을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정 적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0094182", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공 지능 피드백 방법을 나타낸 순서도이다. 도 2 내지 도 7은 도 1에 따른 인공 지능 피드백 방법을 설명하기 위한도면이다. 도 8은 본 발명의 다른 실시예에 따른 인공 지능 피드백 시스템을 나타낸 도면이다. 도 9 및 도 10은 다른 실시예에 따른 인공 지능 피드백 시스템을 설명하기 위한 도면이다. 도 11은 인공 지능 피드백 방법 및 인공 지능 시스템을 이용한 그림을 통한 트레이닝을 나타낸 이미지이다. 도 12는 인공 지능 피드백 방법 및 인공 지능 시스템을 이용한 문서를 통한 트레이닝을 나타낸 이미지이다. 도 13은 도 9에 기반하는 또 다른 실시예에 따른 인공 지능 피드백 시스템을 설명하기 위한 도면이다. 도 14 내지 도 19는 도 8에 기반하는 또 다른 실시예에 따른 인공지능 피드백 시스템을 설명하기 위한 도면이다. 도 20은 도 14 내지 도 19에 따른 절차가 반영된 인공지능 트레이닝 결과를 도시한 도면이다."}
