{"patent_id": "10-2021-0054594", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0110024", "출원번호": "10-2021-0054594", "발명의 명칭": "인공 지능 모델에 기반하여 연산을 수행하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "이하윤"}}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치로서,메모리; 및 적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는:상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하고,상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터를 획득하고,상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 적어도 하나의 프로세서는 복수의 실행 환경들에 기반하여 동작을 수행 가능하도록 설정되고, 상기 복수의 실행 환경들은 일반 실행 환경 및 신뢰 실행 환경을 포함하고,상기 적어도 하나의 프로세서는:상기 신뢰 실행 환경에서, 상기 노이즈 값을 생성하고, 상기 복수의 레이어들 중 적어도 일부의 웨이트 값들에노이즈 값을 반영(apply)하고,상기 이벤트가 식별되는 경우, 상기 일반 실행 환경에서 상기 노이즈 값이 반영된 상기 웨이트 값들을이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산하고,상기 신뢰 실행 환경에서 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서, 상기 메모리 중 제 1 일부는 상기 일반 실행 환경에 할당되고, 상기 메모리 중 제 2 일부는상기 신뢰 실행 환경에 할당되고,상기 적어도 하나의 프로세서는:상기 신뢰 실행 환경에서 획득된 상기 노이즈 값이 반영된 상기 웨이트 값들을 상기 일반 실행 환경에 할당된상기 메모리 중 제 1 일부에 저장하고,상기 일반 실행 환경에서, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2022-0110024-3-제 3 항에 있어서,상기 적어도 하나의 프로세서는:지정된 범위 내의 값들 중에서 상기 노이즈 값을 선택하도록 설정되고, 상기 지정된 범위 내의 값들은 0.9 미만의 값들 또는 1.1 이상의 값들을 포함하는,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2 항에 있어서, 상기 전자 장치는 상기 인공 지능 모델에 기반한 연산을 수행하기 위한 복수의 연산 장치들을 더 포함하고, 상기 복수의 연산 장치들은 상기 복수의 실행 환경들 중 상기 일반 실행 환경에 할당되고,상기 적어도 하나의 프로세서는:상기 일반 실행 환경에서, 상기 복수의 연산 장치들을 이용하여, 상기 노이즈 값이 반영된 상기 웨이트 값들을기반으로 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 2 항에 있어서,상기 적어도 하나의 프로세서는:상기 신뢰 실행 환경에서 상기 복수의 레이어들 중 적어도 일부로 입력될 입력 데이터에 대응하는 제 1 노이즈값들을 생성하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 적어도 하나의 프로세서는:상기 입력될 상기 입력 데이터의 값의 범위 중에서 랜덤하게 값을 선택함으로써, 상기 제 1 노이즈 값들 각각을생성하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 적어도 하나의 프로세서는:상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 신뢰 실행 환경에서 상기 복수의 레이어들중 적어도 일부로 입력되는 상기 데이터에 상기 제 1 노이즈 값들을 반영하여 상기 제 1 노이즈 값들이 반영된상기 데이터를 획득하고,상기 제 1 노이즈 값들이 반영된 상기 데이터를 획득한 것에 기반하여, 상기 전자 장치의 실행 환경을 상기 신뢰 실행 환경에서 상기 일반 실행 환경으로 변경하도록 설정된,공개특허 10-2022-0110024-4-전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 적어도 하나의 프로세서는:상기 일반 실행 환경에서, 상기 노이즈 값이 반영된 상기 웨이트 값들에 기반하여 상기 제 1 노이즈 값들이 반영된 상기 데이터를 연산하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항에 있어서,상기 적어도 하나의 프로세서는:상기 신뢰 실행 환경에서, 상기 인공 지능 모델의 상기 복수의 레이어들 중 일부의 상기 웨이트 값들, 상기 노이즈 값들, 상기 제 1 노이즈 값들, 및 바이어스에 기반하여 제 1 값들을 생성하고,상기 생성된 제 1 값들을 상기 메모리 중 일부에 저장하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 적어도 하나의 프로세서는:상기 일반 실행 환경에서 상기 획득된 연산 데이터 및 상기 미리 저장된 제 1 값들을 연산함으로써 기반하여,상기 출력 데이터를 획득하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 2 항에 있어서,상기 적어도 하나의 프로세서는:상기 전자 장치의 상태를 식별하고,상기 전자 장치의 상태가 유휴 상태인 경우, 상기 신뢰 실행 환경에서 상기 노이즈 값을 생성하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 적어도 하나의 프로세서는:상기 인공 지능 모델의 상기 복수의 레이어들 중 상기 노이즈 값이 생성된 레이어들의 수를 식별하고,상기 식별된 레이어들의 수가 기설정된 값 미만인 경우, 상기 노이즈 값이 생성되지 않은 레이어들 중 일부 레공개특허 10-2022-0110024-5-이어를 선택하고,상기 선택된 일부 레이어와 연관된 상기 노이즈 값을 생성하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 적어도 하나의 프로세서는:상기 인공 지능 모델의 상기 복수의 레이어들 중 첫번째 레이어와 연관된 상기 노이즈 값을 생성하는 동작을 삼가하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 2 항에 있어서,상기 적어도 하나의 프로세서는:상기 이벤트가 식별되는 경우, 상기 인공 지능 모델의 상기 복수의 레이어들 중 일부에 대한 상기 노이즈 값이상기 전자 장치에 저장되었는지 여부를 식별하고,상기 노이즈 값이 상기 전자 장치에 저장되지 않은 경우, 상기 신뢰 실행 환경에서 상기 복수의 레이어들 중 일부의 웨이트 값들에 기반하여 상기 복수의 레이어들 중 일부로 입력되는 상기 데이터를 연산하고,상기 노이즈 값이 상기 전자 장치에 저장된 경우, 상기 일반 실행 환경에서 상기 노이즈 값이 반영된 상기 복수의 레이어들 중 일부의 웨이트 값들에 기반하여 상기 복수의 레이어들 중 일부로 입력되는 상기 데이터를 연산하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "전자 장치의 동작 방법으로서,상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하는 동작;상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터를 획득하는 동작; 및상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하는 동작;을 포함하는,동작 방법."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서, 상기 적어도 하나의 프로세서는 복수의 실행 환경들에 기반하여 동작을 수행 가능하도록 설정되고, 상기 복수의 실행 환경들은 일반 실행 환경 및 신뢰 실행 환경을 포함하고,상기 신뢰 실행 환경에서, 상기 노이즈 값을 생성하고, 상기 복수의 레이어들 중 적어도 일부의 웨이트 값들에노이즈 값을 반영(apply)하는 동작;공개특허 10-2022-0110024-6-상기 이벤트가 식별되는 경우, 상기 일반 실행 환경에서 상기 노이즈 값이 반영된 상기 웨이트 값들을이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산하는 동작; 및상기 신뢰 실행 환경에서 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하는 동작;을 포함하는,동작 방법."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서, 상기 메모리 중 제 1 일부는 상기 일반 실행 환경에 할당되고, 상기 메모리 중 제 2 일부는상기 신뢰 실행 환경에 할당되고,상기 신뢰 실행 환경에서, 상기 노이즈 값이 반영된 상기 웨이트 값들을 상기 일반 실행 환경에 할당된 상기 메모리 중 제 1 일부에 저장하는 동작;상기 일반 실행 환경에서, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하는 동작;을 포함하는,동작 방법."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 4 항에 있어서,지정된 범위 내의 값들 중에서 상기 노이즈 값을 선택하도록 설정되고, 상기 지정된 범위 내의 값들은 0.9 미만의 값들 또는 1.1 이상의 값들을 포함하는,동작 방법."}
{"patent_id": "10-2021-0054594", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치로서,메모리; 및 적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는:신뢰 실행 환경에서 상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하고,상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 일반 실행 환경에서 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터를 획득하고,상기 연산 데이터를 획득한 것에 기반하여 상기 전자 장치의 상태를 상기 일반 실행 환경에서 상기 신뢰 실행환경으로 변경하고,상기 신뢰 실행 환경에서, 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하도록 설정된,전자 장치."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예들에 따르면, 전자 장치로서, 메모리, 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는 상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하고, 상기 인공 지능 모델 의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터를 획득하고, 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하도록 설정된, 전자 장치가 제공될 수 있다. 그 밖의 다양한 실시예가 가능하다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예는 인공 지능 모델을 최적화하기 위한 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대를 살아가는 많은 사람들에게 휴대용 디지털 통신기기들은 하나의 필수 요소가 되었다. 소비자들은 휴대용 디지털 통신기기들을 이용하여 언제 어디서나 자신이 원하는 다양한 고품질의 서비스를 제공받고 싶어한다. 근래에 휴대용 디지털 통신기기들에는 인공 지능 학습 알고리즘에 기반하여 학습된 인공 지능 모델들이 저장되 며, 휴대용 디지털 통신기기들에 의해 학습된 인공 지능 모델들을 이용하여 획득되는 다양한 종류의 데이터들을 처리하여 다양한 고품질의 서비스를 제공되고 있다. 그러나 인공 지능 모델들을 운용하기 위해 요구되는 리소스가 증가함에 따라, 휴대용 디지털 통신기기들에서 인 공 지능 모델들을 운용하기 위해 인공 지능 모델들의 연산 프로세스를 최적화하는 기술에 대한 수요가 증대되고 있다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 미리 학습된 복수의 인공 지능 모델들(예: 딥 러닝 모델들, 또는 머신 러닝 모델들)을 저장할 수 있다. 상기 미리 학습된 인공 지능 모델들은 복수의 레이어들을 포함하며, 복수의 레이어들 별로 입력되는 데이 터를 연산하기 위한 적어도 하나의 파라미터(예: 가중치 값들(또는 웨이트 값들), 활성 함수, 바이어스(bias)) 을 포함할 수 있다. 전자 장치에서는 인공 지능 모델들을 실행함에 기반하여 인공 지능 모델들 별로 포함된 적 어도 하나의 파라미터로 데이터를 처리함으로써, 사용자에게 풍부한 서비스의 제공이 가능해질 수 있다. 다만, 전자 장치에 인공 지능 모델들이 저장되고 실행되는 경우 외부로 유출될 가능성이 있어, 보안성에 문제가 생길 수 있다. 또 보안성 향상을 위해, 인공 지능 모델들을 전자 장치의 보안화된 영역에 저장하고 실행하는 경우, 보안화된 영역에 할당된 연산 장치의 수가 적어 연상 성능 문제가 발생될 수 있다. 다양한 실시예들에 따르면, 전자 장치 및 그 동작 방법은 미리 학습된 인공 지능 모델들을 보안화된 환경에 저 장하고 실행함으로써, 전자 장치에 저장된 인공 지능 모델들에 대한 보안성을 향상시킬 수 있다. 또 다양한 실 시예들에 따르면, 전자 장치 및 그 동작 방법은 보안화된 환경에 저장된 인공 지능 모델들에 기반한 적어도 일 부 연산(예: 적어도 일부 레이어에 기반한 연산)의 수행 시, 일반 환경에 할당된 연산 장치들을 이용하되 연산 을 위한 값들이 외부로 노출되지 않도록 함(예: 노이즈 값을 반영)으로써, 연상 성능을 향상시키며 향상된 보안 성을 유지할 수 있다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예들에 따르면, 전자 장치로서, 메모리, 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나 의 프로세서는 상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값 들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하고, 상기 인공 지 능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터를 획득하고, 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하도록 설정된, 전자 장치가 제 공될 수 있다. 다양한 실시예들에 따르면, 전자 장치의 동작 방법으로서, 상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득하는 동작, 상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연 산함에 기반하여, 연산 데이터를 획득하는 동작, 및 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반 하여, 출력 데이터를 획득하는 동작을 포함하는, 전자 장치가 제공될 수 있다. 다양한 실시예들에 따르면, 전자 장치로서, 메모리, 및 적어도 하나의 프로세서를 포함하고, 상기 적어도 하나 의 프로세서는 신뢰 실행 환경에서 상기 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어 도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득 하고, 상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 일반 실행 환경에서 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함 에 기반하여, 연산 데이터를 획득하고, 상기 연산 데이터를 획득한 것에 기반하여 상기 전자 장치의 상태를 상기 일반 실행 환경에서 상기 신뢰 실행 환경으로 변경하고, 상기 신뢰 실행 환경에서, 상기 획득된 연산 데이터 및 상기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득하도록 설정된, 전자 장치가 제공될 수 있다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "다양한 실시예들에 따른, 과제의 해결 수단이 상술한 해결 수단들로 제한되는 것은 아니며, 언급되지 아니한 해"}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "결 수단들은 본 명세서 및 첨부된 도면으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명 확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예들에 따르면, 미리 학습된 인공 지능 모델들을 보안화된 환경에 저장하고 실행함으로써, 전자 장 치에 저장된 인공 지능 모델들에 대한 보안성을 향상시키는 전자 장치 및 그 동작 방법이 제공될 수 있다. 또 다양한 실시예들에 따르면, 보안화된 환경에 저장된 인공 지능 모델들에 기반한 적어도 일부 연산(예: 적어 도 일부 레이어에 기반한 연산)의 수행 시, 일반 환경에 할당된 연산 장치들을 이용하되 연산을 위한 값들이 외 부로 노출되지 않도록 함(예: 노이즈 값을 반영)으로써, 연상 성능을 향상시키며 향상된 보안성을 유지하는 전 자 장치 및 그 동작 방법이 제공될 수 있다."}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예:블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 전 자 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 이하에서는 다양한 실시예들에 따른 전자 장치(예: 도 1의 전자 장치)의 구성의 일 예에 대해서 설명한다. 이하에서 기술되는 전자 장치는 도 1에서 전술한 전자 장치와 같이 구현될 수 있으므로 중복되는 설명은 생략한다. 도 2는 다양한 실시예들에 따른 전자 장치의 구성의 일 예를 설명하기 위한 도면이다. 다만 도 2에 도시되 는 구성들에 제한되지 않고, 전자 장치는 도 2에 도시되는 구성들 보다 더 많은 구성들 또는 더 적은 구성 들을 포함하도록 구현될 수 있다. 이하에서는 도 3a 내지 도 3c, 및 도 4a 내지 도 4b를 참조하여 도 2에 대해 서 설명한다. 도 3a는 다양한 실시예들에 따른 단일 프로세서가 구비되는 경우 전자 장치의 실행 환경의 일 예를 설명하기 위한 도면이다. 도 3b는 다양한 실시예들에 따른 단일 프로세서가 구비되는 경우 전자 장치(10 1)의 실행 환경의 다른 예를 설명하기 위한 도면이다. 도 3c는 다양한 실시예들에 따른 멀티 프로세서(제 1 프 로세서(250a), 및 제 2 프로세서(250b))가 구비되는 경우 전자 장치의 실행 환경의 일 예를 설명하기 위한 도면이다. 상기 도 3a 내지 도 3c에서 점선을 기준으로 좌측과 우측은 서로 다른 실행 환경(예: 일반 실행 환경 (rich execution environment, REE) 및 신뢰 실행 환경(trusted execution environment, TEE))을 나타낼 수 있다. 도 4a는 다양한 실시예들에 따른 인공 신경망의 일 예를 설명하기 위한 도면이다. 도 4b는 다양한 실 시예들에 따른 인공 신경망의 다른 예를 설명하기 위한 도면이다. 다양한 실시예들에 따르면, 도 2를 참조하면, 전자 장치는 카메라, 마이크, 및 통신 회로 를 포함하는 데이터 획득 장치, 복수의 연산 장치들, 복수의 인공 지능 모델들, 복수의 어플리 케이션들과 모듈들(예: 연산 수행 모듈, 노이즈 부가 모듈, 및 출력 데이터 획득 모듈 )을 저장하는 메모리, 및 프로세서를 포함할 수 있다. 이하에서는 전자 장치에 포함된 각 각의 구성들에 대해서 설명한다. 먼저 다양한 실시예들에 따른 데이터 획득 장치에 대해서 설명한다. 데이터 획득 장치는 전자 장치 에 포함된 장치들 중에서 컨텐트를 획득하기 위한 장치들을 분류하기 위한 논리적인 개념으로 해석될 수 있다. 데이터 획득 장치들은 카메라, 마이크, 및 통신 회로 이외에도 이하에서 기술하는 다양한 종류의 컨텐트들을 획득하기 위한 다양한 종류의 장치들(예: 각종 센서들, 터치 스크린)을 더 포함할 수 있다. 다양한 실시예들에 따르면 데이터 획득 장치들은 후술할 인공 지능 모델들에 기반하여 처리될 다양한 종류의 데이터(또는 컨텐트)를 획득할 수 있다. 상기 다양한 종류의 데이터들은 이미지, 영상, 및 오디오 데이 터와 같은 미디어 데이터, 전자적인 문서를 포함할 수 있으며, 이에 제한되지 않고 인공 지능 모델에 의해 전자 적으로 분석 가능한 종류의 전자적인 데이터들(예: 소프트웨어, 센서의 값들)을 더 포함할 수 있다. 일 실시예 에서, 상기 데이터 획득 장치들은, 전자 장치에 설치된(또는, 저장된) 프로세스들, 프로그램들, 및/ 또는 어플리케이션들의 실행 및/또는 구동에 따라서, 구동되어 다양한 종류의 데이터를 획득할 수 있다. 일 예 로, 카메라 어플리케이션이 실행 및/또는 구동되는 경우, 전자 장치는 카메라를 구동(예: 이미지 센 서의 리드 아웃을 제어하는 동작을 수행)하여 데이터로서 이미지 및/또는 영상을 획득할 수 있다. 또 일 예로, 녹음 어플리케이션이 실행 및/또는 구동되는 경우, 전자 장치는 마이크를 구동하여 데이터로서 사용 자의 발화 및/또는 주변 소리들과 같은 오디오 데이터를 획득할 수 있다. 또 일 예로, 웹 기반의 어플리케이션 이 실행 및/또는 구동되는 경우, 전자 장치는 통신 회로를 이용하여 미디어 서버와 통신 연결을 설정 하고 이미지, 영상, 오디오 데이터와 같은 미디어 데이터들을 획득할 수 있다. 이하에서는 각각의 데이터 획득 장치들의 예에 대해서 설명한다. 다양한 실시예들에 따르면 카메라는 정지 영상(또는, 이미지) 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 적어도 하나의 카메라는 하나 이상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플 래시들을 포함할 수 있다. 일 실시예에서, 전자 장치는 각각 다른 속성 또는 기능(또는, 용도)을 가진 카 메라들을 포함할 수 있다. 예를 들면, 적어도 하나의 카메라는 서로 다른 화각의 카메라들을 포함할 수 있다. 상기 화각은 일 예로서, 114° 내지 94°의 초광각(super wide angle), 광각(wide angle), 84° 내지63°의 표준(normal lens), 28° 내지 8°의 망원(telephoto), 및 6° 내지 3°의 초망원(super telephoto)을 포함할 수 있다. 또 예를 들어, 적어도 하나의 카메라는 전자 장치의 전면에 배치되어 이미지 및/또 는 영상을 촬영하는 적어도 하나의 전면 카메라 및 전자 장치의 후면에 배치되어 이미지 및/또는 영상을 촬영하는 적어도 하나의 후면 카메라를 포함할 수 있다. 다양한 실시예들에 따르면 마이크는 전자 장치의 외부로부터 사운드를 수신할 수 있다. 예를 들어, 전자 장치(예: 프로세서)는 마이크를 구동하여, 마이크를 통해 외부에서 발생되는 사운드 를 수신할 수 있다. 외부에서 발생되는 사운드는 화자들(예: 사용자 및/또는 다른 화자(또는 타인))의 음성들 (또는 발화들), 생활 노이즈, 주변(또는 배경) 노이즈들을 포함할 수 있다. 일 실시예에서, 상기 마이크는 복수의 마이크들을 포함할 수 있다. 상기 전자 장치(예: 프로세서)는 복수의 마이크들을 이용하여 수신되는 사운드로부터, 전자 장치로부터 지정된 방향에서 발생되는 사운드를 수신하는 빔포밍을 형성할 수 있다. 상기 수신된 사운드에 기반하여, 획득된 지정된 방향의 사운드는 서브 사운드로 정의될 수 있 다. 상기 복수의 마이크들 각각은 소정의 거리로 이격되도록 전자 장치에 배치되며, 상기 이격된 거 리와 사운드를 획득하고자 하는 방향과 연관된 시간 또는 위상 만큼 각 마이크를 통해 수신되는 사운드를 신호 처리하여 상기 서브 사운드가 획득될 수 있다. 상기 빔포밍 기술은 주지의 기술이므로, 구체적인 설명은 생략한다. 다양한 실시예들에 따르면 통신 회로는 다양한 종류의 통신 방식으로 외부 전자 장치(예: 다른 전자 장치, 또는 서버)와 통신 연결을 형성하고, 데이터를 송신 및/또는 수신할 수 있다. 상기 통신 방식은 상술한 바와 같 이, Bluetooth, 및 Wi-Fi direct와 같은 직접 통신 연결을 설정하는 통신 방식에 의해 수행될 수 있으나, 이에 제한되지 않고 AP(access point)를 이용하는 통신 방식(예: Wi-Fi 통신) 또는 기지국(base station)을 이용하 는 셀룰러 통신을 이용하는 통신 방식(예: 3G, 4G/LTE, 5G)을 포함할 수 있다. 상기 통신 회로는 도 1에서 상술한 통신 모듈과 같이 구현될 수 있으므로 중복되는 설명은 생략한다. 이하에서는 복수의 연산 장치들에 대해서 설명한다. 다양한 실시예들에 따르면 복수의 연산 장치들은 각각은 전자 장치에 저장된 인공 지능 모델들 에 기반한(또는 인공 지능 모델들과 연관된) 연산(예: 행렬 연산(예: 행렬 곱셈(matrix multiplication)))을 수행하도록 설정될 수 있다. 예를 들어, 상기 복수의 연산 장치들은 AP(application processor)(미도시), CPU(central processing unit)(미도시), GPU(graphic processing unit), DPU(display processing unit), 또는 NPU(neural processing unit)(미도시) 중 적어도 하나를 포함할 수 있으며, 기재된 바에 제한되지 않고 연산을 위한 다양한 종류의 프로세서들을 포함할 수 있다. 이때, 본 명세서 에서 일 프로세서에 포함된 복수의 코어들은 프로세서들로 이해될 수 있다. 예를 들어, DSP가 복수의 코어 들을 포함하도록 구현되는 경우, 복수의 코어들 각각이 프로세서로 이해될 수 있다. 상기 인공 지능 모델 과 연관된 연산은 미리 학습된 레이어들을 포함하는 인공 지능 모델들에 기반한 연산(예: 행렬 연산, 바이 어스 연산, 활성 함수 연산)을 포함할 수 있다. 후술하겠으나, 상기 복수의 연산 장치들각각은 특정 실행 환경(예: 일반 실행 환경(rich execution environment, REE), 또는 신뢰 실행 환경(trusted execution environment, TEE)))(또는 실행 모드, 또는 프로세서)에서 연산을 수행하도록 설정될 수 있다. 예를 들어, 복수의 연산 장치들 중 대다수는 일반 실행 환경에서 인공 지능 모델에 기반한 연산을 수 행하도록 설정되며, 나머지는 신뢰 실행 환경에서 연산을 수행하도록 설정될 수 있다. 상기 복수의 연산 장치들의 인공 지능 모델에 기반하여 연산을 수행하는 동작은 백-그라운드에서 수행될 수 있으나, 이에 제 한되지 않고 포어-그라운드에서 수행될 수도 있다. 다양한 실시예들에 따르면 상기 복수의 연산 장치들 각각이 이용 가능한 연산 능력과 연관된 값이 미리 설 정될 수 있다. 예를 들어, 상기 연산 능력과 연관된 값들은 32bit, 16bit, 8bit, 및 4bit를 포함할 수 있으나 이에 제한되지 않고 다양한 값으로 설정 가능하며, 설정된 값에 따라서 연산하기 위한 형식과 수의 범위가 결정 될 수 있다. 일 예로 일 연산 장치에 대한 연산 값이 32bit로 설정되는 경우, 일 연산 장치는 인공 지능 모델 에 포함된 가중치 값들의 지수부를 8bit 그리고 가수부를 24bit로 하여 부동 소수점 단위(32-bit float)로 연산할 수 있다. 외에 다른 연산 값들에 기반하여 표현 가능한 형식과 수의 범위는 주지의 기술이므로 구체적인 설명은 생략한다. 이하에서는 다양한 실시예들에 따른 인공 지능 모델에 대해서 설명한다. 다양한 실시예들에 따르면 복수의 인공 지능 모델들 각각은 지정된 종류의 학습 알고리즘을 기반으로 미리 학습이 완료된 인공 지능 모델들로서, 다양한 종류의 데이터(또는 컨텐트)를 입력 받아 연산하여 결과 데이터를 출력(또는 획득)하도록 미리 구현된 인공 지능 모델들일 수 있다. 예를 들어, 전자 장치에서 머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 기반으로 지정된 종류들의 데이터들을 인풋 데이터로 하여 특정 종류의 결과 데이터를 아웃풋 데이터로 출력하도록 학습이 수행되어 복수의 인공 지능 모델들(예: 머신 러닝 모델, 및 딥 러닝 모델)이 생성됨으로써 전자 장치에 저장되거나, 또는 외부 전자 장치(예: 외부 서버)로 부터 학습이 완료된 인공 지능 모델들이 전자 장치로 전달되어 저장될 수 있다. 일 실시예에서 외부 서버로부터 인공 지능 모델이 전자 장치로 수신(또는, 다운로드)되는 경우, 외부 서버는 어플리케이션을 제작하는 써드 파티(third party)의 서버 또는 써드 파티들이 어플리케이션을 등록하는 관리 서버일 수 있으며 상기 어플리케이션과 함께 어플리케이션을 통해 제공하기 위한 기능에 대응하는 인공 지능 모델이 함께 외부 서 버에 등록되어 있을 수 있다. 이에 따라, 외부 서버로부터 어플리케이션과 함께 대응하는 인공 지능 모델이 전 자 장치로 전달(예: 다운로드)되는 것일 수 있으나, 이에 제한되지는 않는다. 상기 머신 러닝 알고리즘은 선형 회귀(linear regression), 및 로지스틱 회귀(logistic regression)와 같은 지도 학습 알고리즘 (supervised algorithms), 클러스터링(clustering), 시각화와 차원 축소(visualization and dimensionality reduction), 및 연관 규칙 학습(association rule learning)과 같은 비지도 학습 알고리즘(unsupervised algorithms), 및 강화학습 알고리즘(reinforcement algorithms)을 포함하고, 상기 딥 러닝 알고리즘은 ANN(Artificial Neural Network), DNN(Deep Neural Network), CNN(Convolution Neural Network)을 포함할 수 있으며, 기재된 바에 제한되지 않고 다양한 학습 알고리즘을 더 포함할 수 있다. 일 실시예에서 상기 복수의 인 공 지능 모델들 각각은 복수의 연산 장치들 중 특정 연산 장치를 이용하여 실행하도록 설정될 수 있 다. 이에 따라, 특정 연산 장치가 이용하도록 미리 설정된 연산 능력과 연관된 값에 기반하여 복수의 인공 지능 모델들 각각에 기반한 연산이 수행(예: 가중치가 32-bit float 형식으로 연산 됨)될 수 있다. 다만 이에 제한되지 않고, 복수의 연산 장치들 중에서 복수의 인공 지능 모델들 각각을 실행하기 위한 연산 장 치가 랜덤하게 선택될 수도 있다. 다양한 실시예들에 따르면 상기 학습 완료된 인공 지능 모델은 입력 데이터를 연산하기 위한 적어도 하나 의 파라미터(예: 가중치 값들, 활성 함수들, 또는 바이어스(bias)들 중 적어도 하나)을 포함하며, 파라미터들을 기반으로 입력된 데이터를 연산하여 출력 데이터를 획득할 수 있다. 예를 들어, 학습이 완료된 인공 지능 모델 은 도 4a에 도시된 바와 같이 복수의 레이어들(예: 제 1 레이어(1st layer), 및 제 2 레이어(2nd laye r))을 포함하며, 복수의 레이어들 별로 복수의 레이어들 별로 입력되는 입력 데이터(예: X1 벡터(vector))를 연 산하기 위한 가중치 값들(w1-1, w2-1, w3-1)(또는 가중치 행렬(W)), 활성 함수(예: 시그모이드(sigmoid) 함수, Relu 함수), 또는 바이어스(bias)(또는 바이어스 벡터)(B) 중 적어도 하나를 포함할 수 있다. 상기 레이어들(예: 제 1 레이어(1st layer), 및 제 2 레이어(2nd layer))은 연산을 위한 값들(예: 가중치 값들, 활성 함수, 바이어스)이 분류되어 저장되는 논리적인 개념으로 해석될 수 있다. 예를 들어, 도 4a를 참조하면, 인공 지능 모델은 입력 데이터들(x1, x2, x3)이 제 1 레이어(1st layer)에 입력되는 것에 기반하여, 입력 데이 터들(x1, x2, x3) 각각과 제 1 레이어(1st layer)의 노드들 별로 설정된 가중치(예: w1-1, w2-1, w3-1)를 곱하 고, 가중치가 곱해진 입력 데이터들 각각에 바이어스(B)를 더하고, 더해진 결과에 활성 함수(δ(x))를 적용함으 로써 출력 데이터(Y1)를 획득할 수 있다. 결론적으로, 전자 장치는 아래의 [수학식 1]과 같이 상기 인공 지능 모델들의 상기 특정 레이어(예: 제 1 레이어(1st layer))에 대해서 아래와 같은 행렬 연산을 수행할 수 있으며, 레이어들 별로 연산을 위한 값들은 가중치 행렬(weight matrix), 바이어스 행렬(bias matrix)로서 저장될 수 있다. 수학식 1"}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "[수학식 1]에서 n은 레이어의 식별자(또는 순서), Xn은 레이어들 별로 입력되는 데이터, An은 레이어들 별 가중 치 행렬, Bn은 레이어들 별 바이어스 행렬, δ는 활성 함수를 나타냄. 상기 일 레이어(예: 제 1 레이어(1st layer))에서의 연산에 따라 출력된 출력 데이터(예: Y1 행렬)는 다음 레이 어(예: 제 2 레이어(2nd layer))로 입력되며, 제 2 레이어(2nd layer)의 가중치들, 바이어스, 또는 활성 함수들 에 기반하여 입력된 데이터가 연산될 수 있다. 이에 따라, 출력 레이어(output layer)(미도시)에 연산된 결과 데이터가 출력될 때까지, 상술한 인공 지능 모델의 레이어들의 순서대로 연산이 계속해서 수행될 수 있다. 한편, 기재 및/또는 도시된 바에 제한되지 않고 레이어들에는 구현 목적에 따라서 바이어스 행렬 및/또는 활성함수가 구현되지 않을 수도 있다. 또 예를 들어 도 4b에 도시된 바와 같이 인공 지능 모델이 CNN을 기반으로 학 습되는 경우, 상기 복수의 레이어들은 입력 데이터(예: X1)를 연산하여 결과 데이터를 획득하기 위한 컨벌루션 레이어(convolution layer), 및 풀링 레이어(pooling layer)와 같은 다양한 종류의 레이어들을 포함할 수 있다. 한편, 기재된 바에 제한되지 않고 주지의 기술로 인공 지능 모델이 구현될 수 있으므로 구체적인 설명은 생략한다. 이하에서는 다양한 실시예들에 따른 프로세서에 대해서 설명한다. 이하에서 기술되는 프로세서는 설 명의 편의를 위하여 상술한 복수의 연산 장치들과 구분되도록 기재 및/또는 도시하였으나, 상기 프로세서 는 상기 복수의 연산 장치들 중의 하나일 수 있다. 다만, 이에 제한되지 않고 상기 프로세서는 상기 복수의 연산 장치들과는 별도로 구현되는 프로세서일 수도 있다. 다양한 실시예들에 따르면 상기 프로세서는 AP(application processor), CPU(central processing unit), GPU(graphic processing unit), DPU(display processing unit), 또는 NPU(neural processing unit) 중 적어도 하나를 포함할 수 있다. 이하에서 설명되는 프로세서의 동작은 메모리에 저장되는 모듈들(예: 연산 수행 모듈, 노이즈 부가 모듈, 및 결과 데이터 획득 모듈)의 실행에 따라서 수행될 수 있다. 예 를 들어, 모듈들(예: 연산 수행 모듈, 노이즈 부가 모듈, 및 결과 데이터 획득 모듈)의 적어도 일부는 소프트웨어, 펌웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현(예를 들어, 실행)될 수 있다. 예를 들어, 상기 모듈들은 프로세서에 의해 실행 가능한 어플리케이션(application), 프로그램(program), 컴퓨 터 코드(computer code), 인스트럭션들(instructions), 루틴(routine), 내지는 프로세스(process)의 형태로 구 현될 수 있다. 이에 따라, 상기 모듈들이 프로세서에 의해 실행되는 경우, 상기 모듈들은 상기 프로세서가 상기 모듈과 연관된 동작(또는, 모듈이 제공 가능한 기능)을 수행하도록 야기할 수 있다. 따라 서 이하에서 특정 모듈이 동작을 수행한다는 기재는, 특정 모듈이 실행됨에 따라서 프로세서가 해당 동작 을 수행하는 것으로 해석될 수 있다. 또는 상기 모듈들은 특정 어플리케이션의 일부로 구현될 수도 있다. 또는 기재 및/또는 도시된 바에 제한되지 않고, 각 모듈들은 프로세서와는 별도의 하드웨어(예: 프로세서, 제어 회로)로 구현될 수도 있다. 다양한 실시예들에 따르면 상기 프로세서는 서로 격리된 복수의 실행 환경들에서 실행되는 모듈들에 기반 하여 동작을 수행할 수 있다. 예를 들어, 소프트웨어적으로 격리된 실행 환경이 구현되거나, 하드웨어적으로 격 리된 실행 환경이 구현될 수 있다. 이하에서는 각각의 예들에 대해서 설명한다. 이하에서는 소프트웨어적으로 격리된 실행 환경이 구현되는 예(예: 도 3a 및 도 3b)에 대해서 설명한다. 다양한 실시예들에 따르면 전자 장치는 도 3a 및 도 3b에 도시된 바와 같이 소프트웨어적으로 서로 격리된 (또는 독립적인) 복수의 실행 환경들에 기반하여 동작(또는 기능)을 수행하도록 구현될 수 있다. 250상기 복수 의 실행 환경들은 일반 실행 환경(rich execution environment, REE), 및 신뢰 실행 환경(trusted execution environment, TEE))을 포함할 수 있으나, 이에 제한되지 않고 서로 격리되도록(또는 독립적으로) 구 현 가능한 다양한 종류의 실행 환경들을 더 포함할 수도 있다. 이때, 상기 복수의 실행 환경들은 일종의 단일의 프로세서의 실행 모드로 해석될 수도 있다. 예를 들어, 후술하는 도 3a에 도시된 전자 장치의 경우 프로세서가 제 1 시구간 동안 일반 실행 환경으로 동작을 수행하거나, 또는 다른 제 2 시구간 동안 신뢰 실행 환경에서 동작을 수행할 수 있다. 이때, 상기 실행 환경들(예: 일반 실행 환경 및 신뢰 실 행 환경) 별로 할당되는 하드웨어들, 및 권한이 서로 다를 수 있다. 일 실시예에서 각각의 실행 환경들 별 로 할당되는 연산 장치들의 수가 상이할 수 있다. 도 3a 및 도 3b를 참조하면, 각 도면은 점선을 기준으로 좌측 에 위치되는 하드웨어 장치들은 일반 실행 환경에 할당(또는, 일반 실행 환경에서 구동)되고, 우측에 위치되는 하드웨어 장치들은 신뢰 실행 환경에 할당(또는, 신뢰 실행 환경에서 구동)됨을 나타낼 수 있다. 예를 들어, 도 3a 및 도 3b를 참조하면 상기 일반 실행 환경에는 상기 신뢰 실행 환경과 비교 하여 더 많은 연산 장치들이 할당되며(또는 연산 장치들 모두가 할당되며), 이에 따라 프로세서는 일반 신 뢰 실행 환경에서 상대적으로 더 많은 연산 장치들에 기반하여 동작을 수행할 수 있다. 또 일 실시예에서, 도 3a 및 도 3b에 도시된 바와 같이 상기 실행 환경들 별(예: 일반 실행 환경 및 신뢰 실행 환경)로 메모리의 지정된 영역이 할당되어, 프로세서는 일반 실행 환경에서 일반 실행 환경에 할당 된 제 1 영역에 데이터를 읽고 쓸 수 있으며, 신뢰 실행 환경에서는 신뢰 실행 환경에 할당된 메모리의 제 2 영역에 데이터를 읽고 쓸 수 있다. 또 일 실시예에서 각각의 실행 환경들 별로 부여되 는 권한과 보안성이 다를 수 있다. 예를 들어, 신뢰 실행 환경에 대한 권한과 보안성이 상기 일반 실행 환 경에 대한 권한과 보안성과 비교하여 더 높을 수 있다. 일 예로, 프로세서는 신뢰 실행 환경에 서 일반 실행 환경에 할당된 메모리의 제 1 영역에 접근하여 데이터를 읽고 쓸 수 있으나, 일반실행 환경에서는 신뢰 실행 환경에 할당된 하드웨어들 또는 정보들(예: 메모리의 제 2 영역 )에 접근 불가할 수 있다. 도 3a 및 도 3b에 도시된 바와 같이 인공 지능 모델들은 신뢰 실행 환경 의 메모리의 영역(예: 제 2 영역)에 저장되어, 프로세서는 일반 실행 환경에서 인공 지능 모델들에 접근 불가할 수 있다. 이에 따라, 인공 지능 모델들에 대한 정보가 외부로 노출되지 않을 수 있다. 다양한 실시예들에 따르면 프로세서는 서로 다른 실행 환경들에서 실행되는 각 모듈들에 기반한 동작을 수 행할 수 있다. 일 예로 도 3a 및 도 3b 를 참조하면, 일반 실행 환경에서 연산 수행 모듈이 실행되며, 신뢰 실행 환경에서는 노이즈 부가 모듈과 결과 데이터 획득 모듈이 실행되도록 설정될 수 있다 전술한 바와 같이 신뢰 실행 환경의 권한 및/또는 보안성이 상대적으로 더 높은 것에 기반하여, 프로 세서는 일반 실행 환경에서는 상기 신뢰 실행 환경에서 실행된 노이즈 부가 모듈과 결과 데이터 획득 모듈에 기반하여 획득된 데이터들로 접근 불가할 수 있다. 그러나 이에 제한되지 않고, 각 모듈들 의 실행 환경이 도시 및/또는 기재된 바와는 다르게 구현될 수도 있다. 일 실시예에서, 프로세서는 도 3a 에 도시된 바와 같이 실행 환경을 전환하기 위한 구성(예: 모니터 모드(monitor mode))에 기반하여 서로 다른 실행 환경에서 모듈들을 실행할 수 있다. 예를 들어, 상기 도 3a와 같은 전자 장치의 소프트웨어 및 하드웨어는 ARM 社의 아키텍처(arm architecture)에 기반하여 구현되며, 이 경우 일반 실행 환경은 노말 월드(normal world)로 정의되고 그리고 신뢰 실행 환경은 시큐어 월드(secure world)로 정의될 수 있다. 상기 모니터 모드는 시큐어 월드(예: 신뢰 실행 환경)에서 실행되며, 월드들(예: 노말 월드(예: 일반 실행 환경) 및 시큐어 월드(예: 신뢰 실행 환경)) 간의 전환을 수행하기 위한 SMC(Secure Monitor Call) 명령이 발생하거나, 또는 IRQ(Interrupt Request) 내지 FIQ(Fast Interrupt Request)가 발생되는 경우 각 월드들 간의 전환(또는 실행 환경의 전환)을 수행할 수 있다. 예를 들어, 도 3a에 도시된 바와 같이 노이즈 부가 모듈 또는 출력 데이터 획득 모듈에 기반한 동작을 개시하기 위한 이벤트가 발생되는 경우, 프 로세서는 모니터 모드를 통해 현재 실행 환경을 신뢰 실행 환경으로 전환(또는 변경)하여 신뢰 실행 환경에서 노이즈 부가 모듈 또는 출력 데이터 획득 모듈에 기반한 동작을 수행할 수 있다. 또 예를 들어, 모니터 모드를 통해 현재 실행 환경을 일반 실행 환경으로 전환하여 연산 수행 모듈 에 기반한 동작을 개시하기 위한 이벤트가 발생되는 경우, 프로세서는 신뢰 실행 환경에서 연산 수행 모듈에 기반한 동작을 수행할 수 있다. 이때 도시되지 않았으나, 각각의 실행 환경에서 실행되는 운 영체제(operating system, OS)이 전자 장치에 포함되며, 각각의 실행 환경으로 전환 시 각각의 운영 체제 가 실행될 수 있다. 예를 들어, 프로세서는 일반 실행 환경에서 일반 실행 환경의 OS를 실행하 고, 신뢰 실행 환경에서는 신뢰 실행 환경의 OS를 실행할 수 있다. 프로세서는 도 3a에 도시된 바와 같이 서로 중첩되지 않는 다른 시간 동안(또는, 이시에) 각각의 실행 환경에 기반하여 동작을 수행(예: 신 뢰 실행 환경에서 동작을 수행하고 이후 일반 실행 환경에서 동작을 수행, 또는 일반 실행 환경(31 0)에서 동작을 수행하고 이후 신뢰 실행 환경에서 동작을 수행)할 수 있으나, 기재된 바에 제한되지 않고 두 실행 환경에 기반하여 동시에 동작을 수행할 수도 있다. 또 일 실시예에서, 프로세서는 도 3b에 도시된 바와 같이 서로 다른 실행 환경에서 실행되는 가상의 운영 체제들 및 가상의 운영 체제들을 운용하는 하이퍼바 이저(hypervisor)를 이용하여, 서로 다른 실행 환경(예: 일반 실행 환경, 신뢰 실행 환경)에서 실행되는 서로 다른 가상 OS 상에서 모듈들(예: 노이즈 부가 모듈, 연산 수행 모듈, 출력 데이터 획 득 모듈)을 실행할 수 있다. 도 3b와 같이 구현된 전자 장치가 각 모듈들을 각각의 실행 환경에 서 실행하는 동작은 도 3a에서 전술한 바와 같이 수행될 수 있으므로 중복되는 설명은 생략한다. 이 경우에도, 프로세서는 서로 중첩되지 않는 시구간 동안 각각의 실행 환경에 서 동작을 수행할 수 있으나, 기재된 바 에 제한되지 않고 두 실행 환경에 기반하여 동시에 동작을 수행할 수도 있다. 상기 도 3b과 같은 전자 장치 의 소프트웨어 및 하드웨어는 intel 社의 아키텍처(siq architecture)에 기반하여 구현될 수 있다. 다양한 실시예들에 따르면 상기 프로세서는 일반 실행 환경에 할당된 메모리의 영역(예: 제 1 영역) 중 일부를 통해서 데이터를 공유할 수 있다. 예를 들어, 프로세서는 신뢰 실행 환경에서 모듈들 중 적어도 일부(예: 노이즈 부가 모듈)에 기반하여 획득된 데이터를 일반 실행 환경에 할당된 메모리의 제 1 영역 중 일부에 쓰고, 일반 실행 환경에서 모듈들 중 적어도 일부(예: 연산 수행 모듈)에 기반한 동작의 수행 시 제 1 영역 중 일부에 쓰여진 데이터를 읽을 수 있다. 또 예를 들어, 프로세서는 일반 실행 환경에서 모듈들 중 적어도 일부(예: 연산 수행 모듈)에 기반하여 획득된 데이터를 일반 실행 환경에 할당된 메모리의 제 1 영역 중 일부에 쓰고(또는, 저장하 고), 신뢰 실행 환경에서 모듈들 중 적어도 일부(예: 출력 데이터 획득 모듈)에 기반한 동작의 수행 시 제 1 영역 중 일부에 쓰여진 데이터를 읽어올(또는, 획득할) 수 있다. 이 경우, 특정 모듈들(예: 노이즈 부가 모듈, 연산 수행 모듈, 출력 데이터 획득 모듈)은 상기 메모리의 제 1 영역 중 일부를 참조하도록 미리 설정될 수 있다. 또는 기재된 바에 제한되지 않고, 신뢰 실행 환경에서 일반 실행 환경으로 데이터를 전송하거나 또는 일반 실행 환경에서 신뢰 실행 환경으로 데이터를 전 송하는 방식으로 각 실행 환경들 간의 데이터가 공유될 수도 있다. 이하에서는 하드웨어적으로 격리된 실행 환경이 구현되는 예(예: 도 3c)에 대해서 설명한다. 다양한 실시예들에 따르면 전자 장치는 도 3c에 도시된 바와 같이 서로 독립적으로 구현된 하드웨어들(예: 메모리들, 연산 장치들)에 기반하여 복수의 실행 환경들에서 동작(또는 기능)을 수행하도록 구현될 수 있 다. 예를 들어, 전자 장치는 각각의 실행 환경들(예: 일반 실행 환경 및 신뢰 실행 환경) 별로 하드웨어들(예: 프로세서들(250a, 250b), 메모리들(230a, 230b), 및 연산 장치들)이 할당되며, 권한이 상 이할 수 있다. 예를 들어 도 3c에 도시된 바와 같이, 제 1 프로세서(250a)는 일반 실행 환경에서 별도의 독립된 운영 체제를 실행하고, 연산 장치들을 이용하여 연산 수행 모듈에 기반한 동작을 수행하며 제 1 메 모리(230a)에 데이터를 읽고 쓸 수 있다. 또 예를 들어, 제 2 프로세서(250b)는 신뢰 실행 환경에서 일반 실행 환경의 운영 체제와는 별도의 독립된 운영 체제를 실행하고, 노이즈 부가 모듈 및 결과 데이터 획득 모듈에 기반한 동작을 수행하며 제 2 메모리(230b)에 데이터를 읽고 쓸 수 있다. 이 경우에도 제 2 프로세 서(250b)는 신뢰 실행 환경에서 상기 제 1 메모리(230a)에 접근하는 권한을 가질 수 있다. 상기 일반 실행 환경과 신뢰 실행 환경의 권한에 대해서는 도 3a 및 도 3b에서 전술한 바와 같으므로 중복되는 설명 은 생략한다. 이 경우에도 전술한 바와 유사하게, 각 프로세서(예: 제 1 프로세서(250a) 및 제 2 프로세서 (250b))는 서로 중첩되지 않는 시구간 동안 각각의 실행 환경에서 동작을 수행할 수 있으나, 기재된 바에 제한 되지 않고 두 실행 환경에 기반하여 동시에 동작을 수행할 수도 있다. 또 전술한 바와 같이, 각 프로세서(예: 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 일반 실행 환경에 할당된 제 1 메모리(230a)의 특정 영역 (313a) 중 일부를 통해서 데이터를 공유할 수 있으나, 이제 제한되지 않고 각 실행 환경들이 서로 데이터를 전 송하는 방식으로 각 실행 환경들 간의 데이터가 공유될 수도 있다. 이하에서는 다양한 실시예들에 따른 프로세서에 의해 실행되는 각 모듈들의 예에 대해서 설명한다. 전술한 바와 같이, 연산 수행 모듈은 일반 실행 환경에서 실행되며, 노이즈 부가 모듈 및 출력 데이터 획득 모듈은 신뢰 실행 환경에서 실행될 수 있다. 한편 기재된 바에 제한되지 않고, 각 모듈 들은 다른 실행 환경에도 실행되도록 구현될 수도 있다. 예를 들어, 후술하겠으나 전자 장치는 인공 지능 모델의 복수의 레이어들 중 첫번째 레이어에 기반한 연산을 신뢰 실행 환경에서 수행할 수 있다(즉, 첫번째 레이어에 기반한 연산을 수행하도록 구현된 연산 수행 모듈이 신뢰 실행 환경에서 실행될 수 있다). 다양한 실시예들에 따르면 노이즈 부가 모듈은 인공 지능 모델에 기반한 연산과 연관된 노이즈 값들 (예: 가중치 노이즈, 입력 노이즈)을 생성할 수 있다. 예를 들어, 상기 노이즈 부가 모듈은 상기 인공 지 능 모델의 복수의 레이어들 중에서 일부 레이어들을 식별하고, 식별된 레이어들의 가중치와 식별된 레이어 들로 입력되는 데이터에 반영될 가중치 값들을 생성할 수 있다. 상기 노이즈 부가 모듈의 일부 레이어들을 식별하는 동작에 대해서는 도 5 내지 도 7에서 후술한다. 일 실시예에서, 노이즈 부가 모듈은 인공 지능 모델에 포함된 복수의 레이어들 중 일부의 가중치 값들(예: 가중치 매트릭스)에 반영할 노이즈 값(이하, 가중치 노이즈)을 생성하고, 생성된 노이즈 값을 복수의 레이어들 중 일부의 가중치 값들에 반영(예: 곱)할 수 있다. 상기 가중치 노이즈의 값은 랜덤하게 생성될 수 있으며, 상기 값은 0.9 미만의 값 또는 1.1 이상의 값의 범위에서 랜덤하게 설정될 수 있다. 이때, 상기 가중치 노이즈의 값은 인공 지능 모델을 실행할 연산 장치 의 연산 능력(예: 32bit, 8bit)에 비례하여 설정될 수 있다. 또 일 실시예에서, 노이즈 부가 모듈은 상기 인공 지능 모델에 포함된 복수의 레이어들 중 일부로 입력되는 데이터에 반영(예: 합)될 노이즈 값들(예: 노이즈 벡터)(이하, 입력 노이즈)을 생성할 수 있다. 상기 입력 노이즈의 형식과 수는 입력되는 입력 데이터의 형식과 크기(예: 벡터의 수)에 따라 결정되며, 값들 각각은 입력 데이터가 가질 수 있는 값의 범위 내에서 랜덤 하게 생성될 수 있다. 한편 후술하겠으나, 상기 노이즈 부가 모듈은 미리 일부 레이어들에 대한 가중치 노 이즈를 생성하여 반영하는 동작과 입력 노이즈를 생성하는 동작을 수행하고, 동작의 수행에 따라서 획득된 데이 터(예: 가중치 노이즈가 반영된 레이어의 가중치 값들, 가중치 노이즈, 입력 노이즈, 및 도 5 내지 도 7에서 후 술하는 노이즈 차감 행렬)를 미리 저장할 수 있다. 한편 상기 기재된 바에 제한되지 않고, 노이즈 부가 모듈 은 바이어스 벡터 및/또는 활성 함수에 반영될 노이즈 값을 생성할 수도 있다. 다양한 실시예들에 따르면 연산 수행 모듈은 인공 지능 모델에 기반한 연산을 수행할 수 있다. 예를 들어, 연산 수행 모듈은 노이즈 부가 모듈에 의해 노이즈 값이 반영된 인공 지능 모델의 레이어의 가중치 값들(예: 가중치 행렬)과 노이즈 값들이 반영된 상기 레이어로 입력되는 입력 데이터들(예: 입력 데 이터 행렬)에 기반하여 연산(예: 행렬 곱)을 수행하여, 출력 데이터를 획득할 수 있다. 상기 연산은 기재된 바 에 제한되지 않고, 행렬 곱이 아닌 다양한 종류의 연산을 포함할 수도 있다. 다양한 실시예들에 따르면 출력 데이터 획득 모듈은 연산 수행 모듈에 의해 획득된 출력 데이터로부 터, 노이즈 값들을 차감함으로써 출력 데이터를 획득할 수 있다. 또 출력 데이터 획득 모듈은 출력 데이터 가 연산된 레이어에 바이어스가 있는 경우 획득된 출력 데이터에 바이어스를 더 하거나 및/또는 레이어에 활성 함수가 있는 경우 활성 함수에 획득된 출력 데이터를 대입하는 연산을 더 수행할 수 있다. 이때, 연산량 저감을 위해서, 프로세서는 레이어 별 연산 시 연산 수행 모듈에 의해 획득된 출력 데이터로부터 연산될 값 들(예: 차감될 노이즈 값들과 더해질 바이어스의 합)을 미리 하나의 값(또는 하나의 행렬)로 미리 계산하여 저 장할 수 있다. 일 예로, 프로세서(예: 노이즈 부가 모듈)는 후술하는 노이즈 차감 행렬(Tn)을 미리 계산하여 저장해 둘 수 있다. 이후 출력 데이터 획득 모듈은 미리 계산된 노이즈 차감 행렬(Tn)을 연산 수 행 모듈에 의해 획득된 연산 데이터에 반영하고 가중치 노이즈를 차감함으로써 상대적으로 더 적은 연산량 으로, 노이즈 값들이 제거된 출력 데이터를 획득할 수 있다. 이하에서는 다양한 실시예들에 따른 전자 장치의 동작의 예에 대해서 설명한다. 다양한 실시예들에 따르면 전자 장치는 인공 지능 모델의 복수의 레이어들 중 적어도 일부에 기반한 연산과 연관된 노이즈 값들을 신뢰 실행 환경에서 미리 생성할 수 있다. 전자 장치는 미리 생성된 노 이즈 값을 복수의 레이어들 중 적어도 일부의 가중치 값들에 반영하여 저장하고, 이후 인공 지능 모델의 실행 시 일반 실행 환경에서 미리 저장된 노이즈 값이 반영된 가중치 값들에 기반하여 연산을 수행하고, 연산의 수행에 기반하여 획득된 연산 데이터를 획득할 수 있다. 전자 장치는 신뢰 실행 환경에서 획 득된 연산 데이터로부터 노이즈 값을 차감하여 출력 데이터를 획득하고, 획득된 출력 데이터를 다음 레이어의 입력 데이터로 하여 계속해서 동작을 수행할 수 있다. 도 5a는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 5a에 도 시되는 동작들은 도시되는 순서에 국한되지 않고 다양한 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따르 면 도 5a에 도시되는 동작들 보다 더 많은 동작들이 수행되거나, 더 적은 적어도 하나의 동작이 수행될 수도 있 다. 이하에서는, 도 5b, 도 6a 내지 도 6b, 및 도 7을 참조하여 도 5에 대해서 설명한다. 도 5b는 다양한 실시예들에 따른 전자 장치의 어플리케이션의 실행에 기반하여 인공 지능 모델을 선택하는 동작의 예를 설명하기 위한 도면이다. 도 6a는 다양한 실시예들에 따른 전자 장치의 신뢰 실행 환경에서의 사전 계산 동작의 일 예를 설명하기 위한 도면이다. 도 6b는 다양한 실시예들에 따른 사전 계산 동작에 따라서, 전자 장치에 저장되는 값들의 예를 설명하기 위한 도면이다. 도 7은 다양한 실시예들에 따른 전자 장치 의 사전 계산된 값들을 이용하여, 인공 지능 모델에 기반한 연산 동작의 일 예를 설명하기 위한 도면이다. 다양한 실시예들에 따르면 전자 장치는 501 동작에서 전자 장치에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들에 노이즈 값을 반영(apply)함으로써, 상기 노이즈 값이 반영된 상기 웨이트 값들을 획득할 수 있다. 예를 들어, 전자 장치(예: 프로세서)는 도 6a에 도시된 바와 같 이 신뢰 실행 환경에서 인공 지능 모델의 복수의 레이어들 중 적어도 일부 레이어(n)를 선택하는 동 작, 선택된 레이어(n)의 가중치 값들(예: w)(또는, 가중치 행렬(An))에 가중치 노이즈(zn)를 반영하 여 노이즈가 반영된 가중치 값들(예: w')(또는 노이즈(zn)가 반영된 가중치 행렬(An'))을 생성하는 동작, 및 선택된 레이어(n)에 입력될 입력 데이터(Xn)에 반영될 입력 노이즈(Rn)를 생성하는 동작 을 수행할 수 있으며, 상기 동작들(601, 603, 605)은 기재된 순서에 제한되지 않고 다양한 순서로 수행될 수 있다. 상기 동작들(601, 603, 605)은 사전 계산(pre-computation) 동작으로 정의될 수 있다. 도 6a에 도시 된 바와 같이 모니터 모드 및 환경 전환을 위한 FIQ 또는 IRQ에 의해 프로세서의 실행 환경(또는 실 행 모드)이 신뢰 실행 환경으로 전환됨에 따라 프로세서가 상기 동작들(601, 603, 605)을 수행할 수 있다. 다만, 기재된 바에 제한되지 않고 전술한 가상 OS들을 운용하거나(예: 도 3a 및 도 3b와 같은 구현예), 또는 독립적으로 구비되는 하드웨어들에 기반하여(예: 도 3c와 같은 구현예) 상기 동작들을 수행할 수 있으므로 중복되는 설명은 생략한다. 상기 사전 계산 동작은 전자 장치의 유휴 상태(Idle state)에서 수행될 수 있 으며, 이에 따라 상기 전자 장치의 상태가 유휴 상태인 경우 프로세서의 실행 환경은 사전 계산 동작 의 수행을 위해 신뢰 실행 환경으로 전환될 수 있다. 상기 유휴 상태에 대해서는 도 8 내지 도 9에서 후술 한다. 일 실시예에서 전자 장치(예: 프로세서)는 메모리에 저장된 복수의 인공 지능 모델들 각각에 대해서 상기 사전 계산 동작들(601, 603, 605)을 수행할 수 있다. 또는 일 실시예에서, 전자 장치 (예: 프로세서)는 복수의 인공 지능 모델들 중 일부 인공 지능 모델에 대해서만 상기 사전 계산 동작을 수행할 수 있다. 예를 들어, 상기 인공 지능 모델의 제작자, 인공 지능 모델에 대응하는 어플리케이션의 제작자, 또는 인공 지능 모델의 사용자(또는 전자 장치의 사용자)는 상기 인공 지능 모델에 대한 상기 사 전 계산 동작의 수행 여부를 미리 결정하여, 사전 계산 동작의 수행 여부를 나타내기 위한 정보를 미리 전자 장 치에 저장할 수 있다. 프로세서는 상기 정보에 기반하여 복수의 인공 지능 모델들 중 일부 인공 지능 모델에 대해서 사전 계산 동작을 수행할 수 있다. 이하에서는, 사전 계산 동작에 대해서 더 설명한다. 다양한 실시예들에 따르면 전자 장치(예: 노이즈 부가 모듈)는 복수의 인공 지능 모델들 중 일 부 인공 지능 모델(예: A model)의 복수의 레이어들 중 일부 레이어(n)를 선택할 수 있다. 예를 들어, 노이즈 부가 모듈은 인공 지능 모델(예: A model)의 복수의 레이어들 중 첫번째 레이어를 제외한 나머지 레이어들 중에서 일부 레이어를 선택할 수 있다. 상기 첫번째 레이어는 인공 지능 모델(예: A model)로 입력 데이터 (Xn)가 입력되는 경우 가장 먼저 연산이 수행되는 레이어로 정의될 수 있다. 프로세서는 신뢰 실행 환경에서 상기 첫번째 레이어의 가중치들, 바이어스, 및/또는 활성 함수에 기반하여 첫번째 레이어로 입력 되는 데이터를 연산함으로써, 입력 데이터(Xn)가 외부로 노출되지 않도록 할 수 있다. 다만 기재된 바에 제한되지 않고, 노이즈 부가 모듈은 첫번째 레이어를 포함한 복수의 레이어들 중에서 일부 레이어(n)를 선 택할 수도 있다. 노이즈 부가 모듈은 지정된 정보에 기반하여 일부 레이어(n)를 선택할 수 있다. 일 실시 예에서, 상기 지정된 정보는 인공 지능 모델(예: A model) 또는 인공 지능 모델(예: A model)과 연관된 어플리 케이션(예: A app)의 제작자에 의해 사전 계산 동작이 수행되도록 선택된 레이어(n)들을 나타내는 정보를 포함 할 수 있다. 노이즈 부가 모듈은 상기 레이어들을 나타내는 정보에 기반하여, 인공 지능 모델(예: A model)에 포함된 복수의 레이어들 중 일부 레이어(n)를 선택할 수 있다. 또 일 실시예에서, 상기 지정된 정보는 레이어의 특성에 대한 정보를 포함할 수 있다. 상기 레이어의 특성에 대한 정보는 레이어에 포함된 가중치 값들 (An)(또는, 가중치 행렬)이 선형성을 갖는지 여부를 나타낼 수 있다. 노이즈 부가 모듈은 상기 레이어의 특성에 대한 정보에 기반하여, 복수의 레이어들 중 선형성을 갖는 가중치들을 갖는 일부 레이어(n)들을 선택할 수 있다. 또 일 실시예에서, 상기 지정된 정보는 전자 장치의 유휴 리소스를 나타내는 정보를 포함할 수 있다. 예를 들어, 노이즈 부가 모듈은 상기 유휴 리소스를 나타내는 정보에 기반하여, 유휴 리소스의 크기 에 비례하여 복수의 레이어들 중에서 선택될 레이어의 수를 결정할 수 있다. 이때, 결정된 수에 따라서 선택되 는 레이어들은 선택되지 않은 레이어들 보다 더 높은 우선 순위를 갖도록 설정된 레이어들일 수 있다. 상기 우 선 순위는 인공 지능 모델(예: A model) 또는 인공 지능 모델(예: A model)과 연관된 어플리케이션(예: A app) 의 제작자에 의해 미리 결정될 수 있다. 상술한 실시예들 각각이 모두 조합되어 수행될 수 있으나, 기재된 바에 제한되지 않고 실시예들 중 일부 실시예만이 수행될 수도 있다. 다양한 실시예들에 따르면 노이즈 부가 모듈은 선택된 레이어들(n)의 가중치 값들(예: w)(또는 가중치 행 렬(An))에 반영될 노이즈 값(전술한, 가중치 노이즈(zn))을 생성할 수 있다. 상기 가중치 노이즈(zn)(63 1)의 값은 지정된 범위(예: 0.9 미만 또는 1.1 이하의 범위)내에서 랜덤한 값으로 생성되며, 도 2 내지 도 4에 서 전술한 바와 같이 연산 장치의 연산 능력에 따라 가중치 노이즈(zn)의 값이 결정될 수 있으므로 중복되는 설명은 생략한다. 상기 가중치 노이즈(zn)은 레이어들 별로 서로 다르게 지정된 범위 내에서 생 성될 수 있으나, 기재된 바에 제한되지 않고 동일한 값으로 생성될 수도 있다. 노이즈 부가 모듈은 생성된 가중치 노이즈(zn)를 선택된 레이어(n)의 가중치 값들(w)(또는 가중치 행렬(An))에 반영(예: 곱)하고, 가 중치 노이즈(zn)가 반영된 가중치 값들(w')(또는, 가중치 행렬(An'))을 저장할 수 있다. 노이즈 부가 모듈 은 도 6a에 도시된 바와 같이 가중치 노이즈(zn)가 반영된 가중치 값들(An)을 일반 실행 환경에 할당된 메모리의 특정 영역에 저장하여, 일반 실행 환경에서 이용되도록 할 수 있다. 다양한 실시예들에 따르면 노이즈 부가 모듈은 선택된 레이어(n)들로 입력되는 입력 데이터(Xn)에 부 가될 노이즈 값들(전술한, 입력 노이즈(Rn))을 생성할 수 있다. 예를 들어, 노이즈 부가 모듈은 입력 노이즈(Rn)로서 선택된 레이어(n)들로 입력되는 입력 데이터(Xn)의 크기(또는 수)에 대응하는 크기를 갖는 노이즈 벡터를 생성할 수 있다. 상기 입력 노이즈(Rn)의 값(예: r1, r2, r3, r4)은 지정된 범위(예: 입력 데이터(Xn)가 가질 수 있는 값의 범위)내에서 생성되며, 각각의 값(예: r1, r2, r3, r4)은 랜덤하게 생성될 수 있다. 노이즈 부가 모듈은 생성된 입력 노이즈(Rn)를 일반 실행 환경에 할당된 메모리의 특정 영역에 저장하여, 일반 실행 환경에서 이용되도록 할 수 있다. 다양한 실시예들에 따르면 전자 장치(예: 프로세서)는 도 6b에 도시된 바와 같이 신뢰 실행 환경 에서 선택된 레이어(n)들 별로 생성된 값들(이하, 사전 계산된 값들)을 미리 저장할 수 있다. 예를 들어,상기 사전 계산된 값들은 선택된 레이어들(n) 별 가중치 노이즈(zn), 가중치 노이즈(zn)가 반영된 가 중치 행렬(An'), 입력 노이즈 벡터(Rn), 바이어스 벡터(Bn), 및/또는 노이즈 차감 행렬(Tn)을 포함할 수 있다. 상기 노이즈 차감 행렬(Tn)은 아래의 [수학식 2]와 같이 계산되며, 후술하겠으나 상기 노이즈 차감 행 렬(Tn)은 일반 실행 환경에서 연산된 연산 데이터(Yn')로부터 차감하기 위한 행렬일 수 있다. Tn의 연산 시 각 값들의 (+, -)는 기재된 바와 반대로 구현될 수 있으며, 이 경우 후술하는 Yn'에서 Tn이 차감될 수 도 있다. [수학식 2]"}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "[수학식 2]에서 n은 선택된 레이어의 식별자(또는 순서), An은 선택된 레이어 별 가중치 행렬, Rn은 선택된 레 이어들 별 입력 노이즈, zn은 선택된 레이어들 별 가중치 노이즈, Bn는 선택된 레이어들 별 바이어스 벡터를 나 타냄. 도 6b에 도시된 바와 같이 상기 값들 중 적어도 일부는 신뢰 실행 환경에 할당된 메모리에 저장되어 신뢰 실행 환경에서 이용될 수 있다. 한편, 상기 값들 중 적어도 일부(예: 노이즈 값이 반영된 가중치 값 (An'))는 미리 일반 실행 환경에 할당된 메모리의 특정 영역에 저장되어 일반 실행 환경에 서 이용될 수도 있다. 이 경우, 보안을 위해 상기 값들 중 바이어스 벡터(Bn), 및/또는 노이즈 차감 행렬(Tn)는 일반 실행 환경에 할당된 메모리의 특정 영역에 저장되지 않고, 신뢰 실행 환경에 할당된 메모리에만 저장될 수 있다. 한편, 기재 및/또는 도시된 바에 제한되지 않고, 데이터 저장량 저감을 위해 상기 값들 중 입력 노이즈(Rn)와 바이어스(Bn)는 저장되지 않고 노이즈 차감 행렬(Tn)만이 저장될 수도 있다. 다양한 실시예들에 따르면 전자 장치는 503 동작에서 인공 지능 모델의 실행을 위한 이벤트의 발생 여부를 판단할 수 있다. 예를 들어, 전자 장치는 도 7에 도시된 바와 같이 지정된 어플리케이션(예: A app)의 실 행에 기반하여, 실행된 어플리케이션(예: A app)과 연관된 인공 지능 모델(예: A model)의 실행을 위한 이벤트 의 발생을 식별할 수 있다. 일 실시예에서 전자 장치는 어플리케이션에 기반한 기능의 수행을 위해 지정된 인공 지능 모델을 실행할 수 있다. 도 5b의 510에 도시된 바와 같이 카메라 어플리케이션은 획득되는 이미 지 또는 영상을 처리하여 객체들(또는 피사체들)에 대한 정보를 획득하기 위한 모드를 제공하도록 구현될 수 있다. 이에 따라 전자 장치는 도 5의 520에 도시된 바와 같이 사용자에 의해 상기 카메라 어플리케이션 의 실행 화면 상에서 상기 모드가 선택되는 경우 데이터(또는 컨텐트)의 처리를 위한 이벤트가 발생 되는 것으로 식별할 수 있다. 전자 장치는 복수의 인공 지능 모델들에서 상기 카메라 어플리케이션 에 대응하도록 설정된(또는 상기 모드에 대응하는 피사체 인식 기능을 제공하기 위해 구현된) 인공 지능 모델(예: A model)을 식별할 수 있다. 상기 식별된 인공 지능 모델(예: A model)은 이미지 데이터를 입력 받은 것에 대한 응답으로, 피사체에 대한 정보를 출력(예: 피사체의 존재 확률)하도록 구현될 수 있다. 전자 장 치는 상기 카메라 어플리케이션의 실행에 기반하여, 획득되는 데이터(예: 이미지(512, 521))를 연산 을 위한 입력 데이터로서 제공할 수 있다. 또 일 실시예에서, 전자 장치는 실행된 어플리케이션에 연관되 도록 미리 설정된 인공 지능 모델을 실행할 수도 있다. 이 경우, 어플리케이션들 별로 대응하는 인공 지능 모델 에 대한 정보가 전자 장치에 미리 저장되고, 전자 장치(예: 프로세서)는 저장된 정보를 참조하 여 실행된 어플리케이션에 대응하는 인공 지능 모델을 식별 및/또는 실행할 수 있다. 다양한 실시예들에 따르면 전자 장치는 505 동작에서 인공 지능 모델의 실행을 위한 이벤트가 발생된 것으 로 판단된 경우, 상기 노이즈 값이 반영된 상기 웨이트 값들을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여 연산 데이터를 획득하고, 507 동작에서 획득된 연산 데이터 및 상 기 반영된 노이즈 값에 기반하여, 출력 데이터를 획득할 수 있다. 전자 장치는 상기 실행 이벤트가 발생된 인공 지능 모델의 복수의 레이어들 중 사전 계산 동작이 수행된 일부 레이어(n)들에 기반한 연산 시, 도 7에 도 시된 바와 같이 신뢰 실행 환경에서 레이어들로 입력되는 데이터(Xn)에 입력 노이즈(Rn)를 반영 하여 입력 노이즈(Rn)가 반영된 데이터(Xn')를 획득하는 동작, 일반 실행 환경에서 입력 노이즈(Rn)가 반영된 데이터(Xn')와 가중치 노이즈(zn)가 반영된 가중치 값들(또는 행렬 (An'))을 연산하여 연산 데이터(Yn')를 획득하는 동작, 및 신뢰 실행 환경에서 연산 데이 터(Yn')로부터 노이즈 값들을 차감하는 동작을 수행할 수 있다. 상기 동작들(701, 703, 705)은 레이 어 연산 동작으로 정의될 수 있다. 상기 동작들(701, 703, 705)의 수행을 위해서 전자 장치의 실행 환경이 전환(또는 변경)될 수 있다. 전자 장치(예: 프로세서)는 인공 지능 모델(예: model A)의 실행을 위한이벤트의 발생에 기반하여, 실행 환경을 신뢰 실행 환경으로 전환(변경 또는 설정)하여 인공 지능 모델(예: model A)을 실행할 수 있다. 이후 신뢰 실행 환경에서 701 동작을 수행하고, 701 동작의 수행 완 료 후 전자 장치의 실행 환경이 신뢰 실행 환경에서 일반 실행 환경으로 변경될 수 있다. 일반 실행 환경에서 상기 702 동작이 수행되고, 702 동작의 수행 완료 후 전자 장치의 실행 환경이 일반 실행 환경에서 신뢰 실행 환경으로 변경되고 신뢰 실행 환경에서 703 동작이 수행될 수 있다. 한편 전자 장치(예: 프로세서)는 인공 지능 모델(예: model A)의 첫번째 레이어에 대해서는 신뢰 실 행 환경에서 연산을 수행할 수 있다. 예를 들어, 전자 장치는 인공 지능 모델(예: model A)의 첫번째 레이어에 대해서는 가중치 값들(A1), 바이어스(B1), 및 활성 함수에 기반하여 일반적인 연산을 수행하고, 연산 의 수행 결과 출력된 데이터를 이용하여 계속해서 나머지 레이어들 중 적어도 일부에서 상술한 레이어 연산 동 작(701, 703, 705)을 수행할 수 있다. 이하에서는 레이어 연산 동작(701, 703, 705)에 대해서 더 설명한다. 다양한 실시예들에 따르면 프로세서(예: 노이즈 부가 모듈)은 신뢰 실행 환경에서 현재 연산을 수행하기 위한 레이어가 사전 계산 동작이 수행된 레이어인 경우, 상기 레이어로 입력되는 입력 데이터 (Xn)에 입력 노이즈(Rn)를 반영(예: 더함)하여 입력 노이즈(Rn)가 반영된 입력 데이터 (Xn')를 획득할 수 있다. 상기 노이즈 부가 모듈은 도 6b에서 전술한 미리 저장된 정보로부터, 현재 연산이 수행되는 레이어에 대한 입력 노이즈(Rn)를 식별하고, 식별된 입력 노이즈(Rn)를 입력 데이터 (Xn)에 반영(예: 더함)할 수 있다. 상기 노이즈 부가 모듈은 입력 노이즈(Rn)가 반영된 입력 데 이터(Xn')를 일반 실행 환경에 할당된 메모리의 특정 영역에 저장할 수 있다. 프로세서 는 상기 입력 노이즈(Rn)가 반영된 입력 데이터(Xn')가 저장되는 경우, 실행 환경을 일반 실행 환경으로 전환할 수 있다. 다양한 실시예들에 따르면 프로세서(예: 연산 수행 모듈)는 일반 실행 환경에서 입력 노이즈 (Rn)가 반영된 입력 데이터(Xn')와 가중치 노이즈(zn)가 반영된 가중치 값들(An')을 연산 (예: 행렬 곱)함으로써, 연산 데이터(Yn')를 획득할 수 있다. 연산 수행 모듈은 일반 실행 환경(31 0)에 할당된 메모리의 특정 영역에 접근함으로써, 상기 입력 노이즈(Rn)가 반영된 입력 데이터 (Xn')와 가중치 노이즈(zn)가 반영된 가중치 값들(An')을 식별할 수 있다. 상기 연산 수행 모듈(24 3)은 연산에 따라 생성된 연산 데이터(Yn')를 일반 실행 환경에 할당된 메모리의 특정 영역 에 저장할 수 있다. 프로세서는 연산 데이터(Yn')가 저장되는 경우, 실행 환경을 신뢰 실행 환 경으로 전환할 수 있다. 다양한 실시예들에 따르면 프로세서(예: 출력 데이터 획득 모듈)는 신뢰 실행 환경에서 연산 데 이터(Yn')로부터 노이즈 값들을 차감하여, 출력 데이터(Yn)를 획득할 수 있다. 예를 들어, 아래의 [수학식 3]과 같이 연산 데이터(Yn')로부터 미리 저장된 가중치 노이즈(zn)를 차감하고(예: 나누고) 노이즈 차감 행렬(Tn)을 더하여, 출력 데이터 획득 모듈은 출력 데이터를 획득할 수 있다. Tn의 연산 시 각 값들의 (+, -)는 기재된 바와 반대로 구현될 수 있으며, 이 경우 후술하는 Yn'에서 Tn이 차감될 수도 있다. 기재된 바에 제한되지 않고, 해당 레이어에 바이어스가 없는 경우에는 노이즈 차감 행렬을 더하는 대신 An*Rn/zn이 연산 데이터(Yn')로부터 차감될 수도 있다. [수학식 3]"}
{"patent_id": "10-2021-0054594", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "[수학식 3]에서 n은 연산이 수행되는 레이어의 식별자(또는 순서), Yn은 출력 데이터, Yn'는 연산 데이터, zn은 레이어 별 가중치 노이즈, Tn은 [수학식 3]의 노이즈 차감 행렬을 나타냄. 다양한 실시예들에 따르면 프로세서는 상기 획득된 출력 데이터(Yn)를 다음 레이어의 입력 데이터로 하여 계속해서 연산을 수행할 수 있다. 이때, 현재 연산이 수행되는 레이어에 활성 함수가 존재하는 경우, 프로 세서는 출력 데이터에 활성 함수를 적용하여 출력된 데이터를 다음 레이어의 입력 데이터로하여 계속해서 연산을 수행할 수 있다. 다양한 실시예들에 따르면 프로세서는 현재 레이어에 대한 연산의 완료 시, 현재 레이어에 대한 사전 계산 된 값들(예: 가중치 노이즈(zn), 가중치 노이즈(zn)가 반영된 가중치 행렬(An'), 입력 노이즈 벡터(Rn), 바이어스 벡터(Bn), 및/또는 노이즈 차감 행렬(Tn))을 메모리에서 제거할 수 있으나, 이에 제한되지는 않는다.한편 다양한 실시예들에 따르면 전자 장치는 503 동작에서 사전 계산된 값들을 기반으로, 인공 지능 모델 을 실행하기 위한 이벤트가 발생된 경우 505 동작에서 연산을 수행하는 것으로 기술하였으나, 이에 제한되지 않 고 503 동작은 인공 지능 모델을 실행하기 위한 이벤트 발생 후에 수행될 수 있다. 예를 들어, 전자 장치 는 인공 지능 모델을 실행하기 위한 이벤트가 발생된 경우, 일 레이어에 대해서 값들(예: 선택된 레이어들(n) 별 가중치 노이즈(zn), 가중치 노이즈(zn)가 반영된 가중치 행렬(An'), 입력 노이즈 벡터(Rn), 바이어스 벡터(Bn), 및/또는 노이즈 차감 행렬(Tn))을 생성하고 생성된 값들에 기반하여 일 레이어에 대한 연산 을 수행할 수 있다. 이하에서는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명한다. 다양한 실시예들에 따르면 전자 장치는 전자 장치의 상태가 유휴 상태(Idle state)인 경우, 인공 지 능 모델에 대한 사전 계산 동작을 수행할 수 있다. 도 8은 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 8에 도시 되는 동작들은 도시되는 순서에 국한되지 않고 다양한 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따르면 도 8에 도시되는 동작들 보다 더 많은 동작들이 수행되거나, 더 적은 적어도 하나의 동작이 수행될 수도 있다. 이하에서는, 도 9를 참조하여 도 8에 대해서 설명한다. 도 9는 다양한 실시예들에 따른 전자 장치의 유휴 상태와 활성화 상태의 일 예를 설명하기 위한 도면이다. 다양한 실시예들에 따르면 전자 장치는 801 동작에서 전자 장치의 상태가 유휴 상태인지 여부를 판단할 수 있다. 예를 들어, 전자 장치의 상태는 유휴 상태(Idle state) 및 활성 상태(Active state)를 포함할 수 있다. 상기 유휴 상태는 신뢰 실행 환경에서 동작을 수행하기 위한 프로세서(예: 도 3a 및 도 3b의 프로세 서, 또는 도 3c의 제 2 프로세서(250b))의 리소스가 충분한 상태를 나타내고, 상기 활성화 상태는 신뢰 실 행 환경에서 동작을 수행하기 위한 프로세서(예: 도 3a 및 도 3b의 프로세서, 또는 도 3c의 제 2 프 로세서(250b))의 리소스가 불충분한 상태를 나타낼 수 있다. 상기 리소스는 프로세서(예: 도 3a 및 도 3b의 프 로세서, 또는 도 3c의 제 2 프로세서(250b))의 사용량, 또는 프로세서(예: 도 3a 및 도 3b의 프로세서 , 또는 도 3c의 제 2 프로세서(250b))에 의해 실행 중인 프로세스(또는 작업, 또는 프로그램, 또는 어플리 케이션)의 수 중 적어도 하나를 포함할 수 있다. 상기 프로세서의 사용량은 다양한 종류의 타임 카운터(time counter)를 이용하여 모니터링 될 수 있다. 이하에서는 전술한 전자 장치의 구현 예들(예: 도 3a의 구현 예, 도 3b의 구현 예, 및 도 3c의 구현 예) 각각에 따른, 전자 장치의 유휴 상태(Idle state)를 판단하는 동작의 예에 대해서 설명한다. 다양한 실시예들에 따르면, 전자 장치가 도 3a 및 3b에 도시된 바와 같이 단일의 프로세서로 구현되 는 경우, 전자 장치는 프로세서의 리소스가 충분한 경우에 전자 장치의 상태가 유휴 상태인 것으로 판단할 수 있다. 예를 들어, 전자 장치는 프로세서의 리소스가 기설정된 값 이상인 경우 상기 전자 장치의 상태가 유휴 상태인 것으로 판단하고, 상기 리소스가 기설정된 값 미만 인 경우 전자 장치 의 상태가 활성 상태인 것으로 판단할 수 있다. 일 실시예에서, 전자 장치는 프로세서의 사용량 이 기설정된 값 이상인 경우 상기 전자 장치의 상태가 활성 상태인 것으로 판단하고, 상기 리소스가 기설 정된 값 미만인 경우 상기 전자 장치의 상태가 유휴 상태인 것으로 판단할 수 있다. 일 예로, 도 9의 901에 도 시된 바와 같이, 프로세서가 적어도 하나의 어플리케이션을 실행함에 따라서, 식별되는 프로세서의 사용량이 기설정된 값 이상일 수 있다. 상기 적어도 하나의 어플리케이션은 포어 그라운드 모드, 또는 백 그라 운드 모드로 실행될 수 있다. 이 경우, 전자 장치는 전자 장치의 상태가 활성 상태인 것으로 판단할 수 있다. 또 일 예로, 도 9의 902에 도시된 바와 같이 어플리케이션의 실행 수가 적거나, 또는 도 9의 903에 도 시된 바와 같이 실행 중인 어플리케이션이 없는 경우, 프로세서의 사용량이 기설정된 값 미만일 수 있다. 이 경우, 전자 장치는 전자 장치의 상태가 유휴 상태인 것으로 판단할 수 있다. 또 일 실시예에서, 전자 장치는 실행 중인 어플리케이션(또는 프로세스, 또는 프로그램)의 실행 수가 기설정된 값 이상인 경 우 상기 전자 장치의 상태가 활성 상태인 것으로 판단하고, 상기 실행 수가 기설정된 값 미만인 경우 상기 전자 장치의 상태가 유휴 상태인 것으로 판단할 수 있다. 다양한 실시예들에 따르면, 전자 장치가 도 3c에 도시된 바와 같이 멀티 프로세서(예: 제 1 프로세서 (250a) 및 제 2 프로세서(250b))로 구현되는 경우, 전자 장치는 신뢰 실행 환경에 할당된 프로세서 (예: 제 2 프로세서(250b))의 리소스가 충분한 경우에 전자 장치의 상태가 유휴 상태인 것으로 판단할 수있다. 전술한 바와 같이, 전자 장치는 신뢰 실행 환경에 할당된 프로세서(예: 제 2 프로세서(250b)) 의 사용량 또는 프로세서(예: 제 2 프로세서(250b))에 의해 실행 중인 어플리케이션(또는 프로세스, 또는 프로 그램)의 수와 기설정된 값을 비교한 것에 기반하여, 전자 장치의 상태(예: 유휴 상태 또는 활성 상태)를 판단할 수 있으므로, 중복되는 설명은 생략한다. 상기 신뢰 실행 환경에 할당된 프로세서(예: 제 2 프로세 서(250b))가 신뢰 실행 환경 전용으로 실행되는 프로그램(예: 보안 툴)의 실행 여부에 따라서, 프로세서 (예: 제 2 프로세서(250b))의 리소스 양이 달라질 수 있다. 다양한 실시예들에 따르면 전자 장치는 전자 장치의 상태가 유휴 상태인 경우 803 동작에서 적어도 하나의 사전 계산 동작을 수행할 수 있다. 예를 들어, 전자 장치는 전자 장치의 상태가 유휴 상태인 것으로 판단한 것에 기반하여, 신뢰 실행 환경에서 복수의 인공 지능 모델들 중 적어도 일부에 대해 서, 인공 지능 모델의 복수의 레이어들 중 적어도 일부 레이어(n)를 선택하는 동작, 선택된 레이어 (n)의 가중치 값들(예: w)(또는, 가중치 행렬(An))에 가중치 노이즈(zn)를 반영하여 노이즈가 반영된 가중치 값 들(예: w')(또는 노이즈(zn)가 반영된 가중치 행렬(An'))을 생성하는 동작, 또는 선택된 레이어(n)에 입력될 입력 데이터(Xn)에 반영될 입력 노이즈(Rn)를 생성하는 동작 중 적어도 하나를 수행할 수 있 다. 각각의 동작들(601, 603, 605)은 전자 장치의 501 동작에서 상술한 바와 같이 수행될 수 있으므로 중 복되는 설명은 생략한다. 다양한 실시예들에 따르면 전자 장치는 판단된 전자 장치의 상태가 활성화 상태인 경우에는, 사전 계 산 동작을 수행하지 않을 수 있다. 다양한 실시예들에 따르면 전자 장치는 805 동작에서 전자 장치의 상태가 활성화 상태인지 여부를 판단하 고, 전자 장치의 상태가 활성화 상태인 경우, 807 동작에서 사전 계산 동작을 중단할 수 있다. 예를 들어, 전자 장치는 사전 계산 동작을 수행하는 중에, 주기적으로 및/또는 비주기적으로 전자 장치의 상태를 판단 할 수 있다. 상기 전자 장치의 상태를 판단하는 동작은 801 동작에서 전술한 바와 같이 수행될 수 있으므 로 중복되는 설명은 생략한다. 상기 전자 장치의 상태가 활성화 상태로 판단된 경우, 전자 장치는 상 기 사전 계산 동작을 중단할 수 있다. 이후에, 전자 장치의 상태가 유휴 상태로 변경되는 경우, 전자 장치 는 인공 지능 모델에 대한 사전 계산 동작이 완료되지 않은 경우, 계속해서 사전 계산 동작을 수행할 수 있다. 예를 들어, 전자 장치는 인공 지능 모델의 복수의 레이어들 중 가중치 노이즈의 반영 또는 입력 노이즈의 생성 중 적어도 하나가 수행되지 않은 레이어에 대해서 계속해서 가중치 노이즈의 반영 또는 입 력 노이즈의 생성하는 동작을 수행할 수 있다. 다양한 실시예들에 따르면 전자 장치는 전자 장치의 상태가 유휴 상태로 판단된 경우에는, 계속해서 사전 계산 동작을 수행할 수 있다. 이하에서는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명한다. 다양한 실시예들에 따르면 전자 장치는 특정 인공 지능 모델에 대한 사전 계산 동작의 수행에 따라서 가중치 노이즈가 반영되고 입력 노이즈가 생성된 레이어의 수가 기설정된 수 이상(또는 초과)이 될 때까지, 특 정 인공 지능 모델에 대한 사전 계산 동작을 수행할 수 있다. 도 10은 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 10에 도시되는 동작들은 도시되는 순서에 국한되지 않고 다양한 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따 르면 도 10에 도시되는 동작들 보다 더 많은 동작들이 수행되거나, 더 적은 적어도 하나의 동작이 수행될 수도 있다. 이하에서는, 도 11을 참조하여 도 10에 대해서 설명한다. 도 11은 다양한 실시예들에 따른 전자 장치의 유휴 상태에서 선택된인공 지능 모델에 대한 사전 계산 동작 을 수행하는 동작의 일 예를 설명하기 위한 도면이다. 다양한 실시예들에 따르면 전자 장치는 1001 동작에서 전자 장치의 상태가 유휴 상태인지 여부를 판 단하고, 전자 장치의 상태가 유휴 상태인 경우 1003 동작에서 복수의 인공 지능 모델들 중 일 인공 지능 모델을 선택할 수 있다. 예를 들어, 전자 장치는 프로세서(예: 도 3a 및 도 3b의 프로세서, 또는 도 3c의 제 2 프로세서(250b))의 리소스와 기설정된 값을 비교한 것에 기반하여, 리소스가 기설정된 값 이상인 경 우 전자 장치의 상태가 유휴 상태인 것으로 판단하고 리소스가 기설정된 값 미만인 경우 전자 장치의 상태가 활성 상태인 것으로 판단할 수 있다. 상기 전자 장치의 상태를 판단하는 동작은 전술한 전자 장치 의 501 동작과 같이 수행될 수 있으므로 중복되는 설명은 생략한다. 전자 장치는 전자 장치의상태가 유휴 상태인 경우, 복수의 인공 지능 모델들 중에서 사전 계산 동작이 수행될 일 인공 지능 모델 을 선택할 수 있다. 예를 들어, 전자 장치는 복수의 인공 지능 모델들 중 사전 계산 동작이 완 료되지 않은 적어도 하나의 인공 지능 모델을 선택할 수 있다. 상기 사전 계산 동작이 완료된다는 의미는 인공 지능 모델에 포함된 복수의 레이어들 중 사전 계산 동작이 완료된 레이어의 수가 기설정된 값 이상임을 의 미할 수 있다. 일 실시예에서, 전자 장치는 상기 인공 지능 모델을 선택하는 동작에 있어서, 복수의 인공 지능 모델들 중 사전 계산 동작이 완료되지 않은 나머지 인공 지능 모델들로부터 랜덤하게 인공 지능 모델을 선택할 수 있다. 또 일 실시예에서, 전자 장치는 상기 인공 지능 모델을 선택하는 동 작에 있어서, 복수의 인공 지능 모델들 중 사전 계산 동작이 완료되지 않은 나머지 인공 지능 모델들로부 터 지정된 순서로 인공 지능 모델을 선택할 수 있다. 상기 지정된 순서로 인공 지능 모델을 선택하 는 동작은 우선 수위가 높은 인공 지능 모델을 우선 순위가 낮은 인공 지능 모델 보다 먼저 선택하는 동 작을 포함할 수 있다. 상기 우선 순위는 인공 지능 모델의 복잡도에 비례하여 설정될 수 있다. 예를 들어, 상기 인공 지능 모델의 복잡도는 인공 지능 모델에 포함된 레이어의 수가 많거나, 또는 인공 지능 모델의 용량이 클 수록 높은 것으로 판단될 수 있다. 또 일 실시예에서, 전자 장치는 특정 인공 지능 모델에 대해서 제작자 가 사전 계산이 필요하지 않은 것으로 사전에 결정한 경우에는, 상기 특정 인공 지능 모델에 대해서는 사전 계 산 동작을 수행하지 않을 수 있다. 이 경우, 복수의 인공 지능 모델들 각각은 사전 계산 동작의 필요 여부 를 나타내는 정보를 포함하고, 전자 장치는 사전 계산 동작이 필요함을 나타내는 정보를 포함하는 인공 지 능 모델들에 대해서만 사전 계산 동작을 수행할 수 있다. 다양한 실시예들에 따르면 전자 장치는 1005 동작에서 선택된 인공 지능 모델에 대한 사전 계산 동작이 수 행된 레이어의 수와 기설정된 수를 비교하고, 상기 레이어의 수가 기설정된 수를 미만인 경우 1007 동작에서 복 수의 레이어들 중 일 레이어를 선택하고 1009 동작에서 선택된 레이어에 대한 사전 계산 값들을 생성할 수 있다. 예를 들어, 전자 장치는 도 11의 1101에 도시된 바와 같이 선택된 인공 지능 모델에 포함된 복수의 레이어들(예: 제 1 레이어, 제 2 레이어, 제 3 레이어, ... , 제 n 레이어)에 대한 사전 계산 동작의 완 료 여부를 식별할 수 있다. 일 실시예에서, 전자 장치는 메모리(예: 신뢰 실행 환경에 할당된 메모리 , 또는 일반 실행 환경에 할당된 메모리의 특정 영역(313a))에 저장된 선택된 인공 지능 모델 의 복수의 레이어들 중 적어도 일부에 대한 사전 계산된 값들을 식별함에 따라서, 레이어에 대한 사전 계 산 동작의 완료 여부를 판단할 수 있다. 상기 사전 계산된 값들은 도 6b에서 전술한 바와 같이 레이어들(n) 별 가중치 노이즈(zn), 가중치 노이즈(zn)가 반영된 가중치 행렬(An'), 입력 노이즈 벡터(Rn), 바이어스 벡터(Bn), 및/또는 노이즈 차감 행렬(Tn)을 포함할 수 있다. 전자 장치는 복수의 레이어들 중에서 사전 계산된 값들 이 저장된 레이어들을 사전 계산 동작이 완료된 레이어들로 판단하고, 상기 사전 계산된 값들이 저장되지 않은 레이어들을 사전 계산 동작이 완료되지 않은 레이어들로 판단할 수 있다. 또 일 실시예에서, 전자 장치는 메모리(예: 신뢰 실행 환경에 할당된 메모리, 또는 일반 실행 환경에 할당된 메모리의 특 정 영역(313a))에 저장된 선택된 인공 지능 모델의 레이어들에 대한 사전 계산 완료를 나타내는 정보를 식별함에 따라서, 레이어에 대한 사전 계산 동작의 완료 여부를 판단할 수 있다. 예를 들어, 전자 장치는 특정 레이어에 대한 사전 계산 동작의 완료 후, 사전 계산 동작의 완료를 나타내는 정보(예: 사전 계산 동작이 완료된 특정 레이어에 대한 식별 정보)를 메모리(예: 신뢰 실행 환경에 할당된 메모리, 또는 일반 실 행 환경에 할당된 메모리의 특정 영역(313a))에 저장할 수 있다. 전자 장치는 상기 메모리에 미 리 저장된 사전 계산 동작의 완료를 나타내는 정보를 식별함으로써, 상기 정보가 있는 레이어들에 대해서는 사 전 계산 동작이 완료된 레이어들로 판단하고, 상기 정보가 없는 레이어들을 사전 계산 동작이 완료되지 않은 레 이어들로 판단할 수 있다. 다양한 실시예들에 따르면 전자 장치는 상기 레이어에 대한 사전 계산 동작의 완료 여부를 판단하는 동작 에 기반하여, 사전 계산 동작이 완료된 레이어들의 수를 식별할 수 있다. 또 일 실시예에서, 전자 장치는 선택된 인공 지능 모델에 대한 사전 계산 동작을 수행한 후, 사전 계산 동작이 완료된 레이어들의 수에 대한 정보를 미리 저장하고, 저장된 정보를 식별함에 기반하여 선택된 인공 지능 모델에 대해서 사전 계 산 동작이 완료된 레이어의 수를 식별할 수 있다. 전자 장치는 상기 식별된 사전 계산 동작이 완료된 레이 어의 수와 기설정된 값(ε)을 비교하고, 상기 비교 결과에 기반하여, 사전 계산 동작이 완료된 레이어의 수가 기설정된 값(ε) 보다 작은 경우 사전 계산 동작이 완료되지 않은 레이어들 중 적어도 일부 레이어에 대해서 도 11의 1102에 도시된 바와 같이 사전 계산 동작을 수행할 수 있다. 상기 사전 계산 동작은 전술한 바와 같이 선 택된 레이어(n)의 가중치 값들(예: w)(또는, 가중치 행렬(An))에 가중치 노이즈(zn)를 반영하여 노이즈가 반영 된 가중치 값들(예: w')(또는 노이즈(zn)가 반영된 가중치 행렬(An'))을 생성하는 동작, 및 선택된 레이어(n)에 입력될 입력 데이터(Xn)에 반영될 입력 노이즈(Rn)를 생성하는 동작을 포함할 수 있으므로, 중복되는 설명은 생략한다. 전자 장치는 상기 사전 계산 동작이 완료된 레이어의 수와 기설정된 값(ε)을 비교한 것에 기반하여, 사전 계산 동작이 완료된 레이어의 수가 기설정된 값(ε) 보다 큰 경우에는 사 전 계산 동작이 완료된 레이어의 수가 기설정된 값(ε) 보다 작은 다른 인공 지능 모델을 선택할 수 있다. 상기 기설정된 값(ε)은 복수의 인공 지능 모델들에 연관되도록 미리 저장된 값일 수 있으나, 조절될 수 있다. 또, 복수의 인공 지능 모델들 별로 서로 다른 값(ε)이 설정될 수도 있다. 예를 들어, 상기 복수의 인공 지능 모델들 각각의 제작자에 의해 상기 값(ε)이 미리 설정될 수 있다. 다양한 실시예들에 따르면 전자 장치는 상기 사전 계산 동작이 완료된 레이어들 중에서 랜덤하게 레이어를 선택하여, 사전 계산 동작을 수행할 수 있다. 이때, 전술한 바와 같이 전자 장치는 제일 첫번째 레이어(예: 제 1 레이어)에 대해서는 사전 계산 동작을 수행하지 않을 수도 있다. 또 일 실시예에서, 전자 장치 는 상기 사전 계산 동작이 완료된 레이어들 중에서 레이어의 우선 순위에 따라서 레이어를 선택하여, 사전 계산 동작을 수행할 수 있다. 예를 들어, 상기 우선 순위는 인공 지능 모델 또는 인공 지능 모델과 연관된 어플리케이션의 제작자에 의해 미리 결정될 수 있다. 또 예를 들어, 상기 인공 지능 모델의 레이 어들 별 우선 순위는 레이어에 포함된 값들(예: 가중치 매트릭스)의 용량이 클수록 높은 것으로 판단될 수 있다. 다양한 실시예들에 따르면 전자 장치는 상기 1007 동작 및 상기 1009 동작 이후에, 1011 동작에서 사전 계 산 동작이 완료된 레이어의 수와 기설정된 수를 비교하고, 사전 계산된 레이어의 수가 기설정된 수 미만인 경우 다시 1007 동작 및 1009 동작을 재수행할 수 있다. 예를 들어, 전자 장치는 상기 사전 계산 동작이 완료되 지 않은 레이어들 중에서 적어도 하나의 레이어를 선택하여, 사전 계산 동작이 완료된 후 다시 사전 계산 동작 이 완료된 레이어의 수와 기설정된 값(ε)을 비교하는 동작을 수행할 수 있다. 전자 장치는 상기 비교 결 과에 기반하여, 사전 계산 동작이 완료된 레이어의 수가 기설정된 값(ε) 보다 낮은 경우 사전 계산 동작이 완 료되지 않은 레이어들 중 적어도 일부에 대해서 사전 계산 동작을 수행할 수 있다. 또는, 전자 장치는 상 기 비교 결과에 기반하여, 사전 계산 동작이 완료된 레이어의 수가 기설정된 값(ε) 보다 큰 경우 선택된 인공 지능 모델에 대한 사전 계산 동작을 완료(또는 중단)할 수 있다. 이하에서는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명한다. 다양한 실시예들에 따르면 전자 장치는 특정 인공 지능 모델에 대한 연산 수행 시, 특정 인공 지능 모델의 사전 계산 동작이 완료되지 않은(또는, 사전 계산 동작이 수행되지 않은) 레이어에 대해서는 일반적인 연산 동 작을 수행하고 사전 계산 동작이 완료된 레이어에 대해서는 미리 사전 계산된 값들에 기반하여 연산 동작을 수 행할 수 있다. 도 12는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 12에 도시되는 동작들은 도시되는 순서에 국한되지 않고 다양한 순서로 수행될 수 있다. 또한, 다양한 실시예들에 따 르면 도 10에 도시되는 동작들 보다 더 많은 동작들이 수행되거나, 더 적은 적어도 하나의 동작이 수행될 수도 있다. 이하에서는, 도 13a 및 도 13b을 참조하여 도 12에 대해서 설명한다. 도 13a는 다양한 실시예들에 따른 전자 장치의 인공 지능 모델의 사전 계산 동작이 완료되지 않은(또는, 사전 계산 동작이 수행되지 않은) 레이어에 대해서 연산을 수행하는 동작의 일 예를 설명하기 위한 도면이다. 도 13b는 다양한 실시예들에 따른 전자 장치의 인공 지능 모델의 사전 계산 동작이 완료된 레이어에 대해 서 연산을 수행하는 동작의 일 예를 설명하기 위한 도면이다. 다양한 실시예들에 따르면, 전자 장치는 1201 동작에서 일 인공 지능 모델을 실행하기 위한 이벤트의 발생 을 식별하고, 일 인공 지능 모델에 기반한 연산을 개시하고, 1203 동작에서 인공 지능 모델의 복수의 레이어들 중 일 레이어를 선택할 수 있다. 예를 들어, 전자 장치는 어플리케이션의 실행에 기반하여 인공 지능 모 델(예: A 인공 지능 모델)을 실행하기 위한 이벤트를 획득(예: 인공 지능 모델에 기반한 데이터를 처리하기 위한 모드에 진입)할 수 있다. 전자 장치는 상기 이벤트의 발생에 기반하여, 실행 환경(또는 실 행 모드)를 신뢰 실행 환경으로 변경하고 신뢰 실행 환경 상에서 인공 지능 모델을 식별할 수 있다. 전자 장치는 식별된 인공 지능 모델에 포함된 복수의 레이어들 중에서 순차적으로 레이어를 선택할 수 있다. 예를 들어, 전자 장치는 도 13a에 도시된 바와 같이 복수의 레이어(예: 제 1 레이어, 제 2 레이어, 제 3 레이어, ... , 제 n 레이어) 중에서 가장 첫번째 레이어(예: 제 1 레이어)를 선택할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 1205 동작에서 선택된 레이어에 대한 사전 계산된 값이 존재하는 지 여부를 판단할 수 있다. 일 실시예에서, 전자 장치는 메모리(예: 신뢰 실행 환경에 할당된 메모리 , 또는 일반 실행 환경에 할당된 메모리의 특정 영역(313a))에 인공 지능 모델의 선택된 레이어(예: 제 1 레이어, 또는 제 2 레이어)에 대한 사전 계산된 값들(예: 레이어들(layer#n) 별 가중치 노이즈 (zn), 가중치 노이즈(zn)가 반영된 가중치 행렬(An'), 입력 노이즈 벡터(Rn), 바이어스 벡터(Bn), 및/또는 노이 즈 차감 행렬(Tn))의 존재 여부(또는, 전자 장치에 저장되었는지 여부)를 식별할 수 있다. 또 일 실시예에 서, 전자 장치는 메모리에 미리 저장된 선택된 레이어(예: 제 1 레이어, 또는 제 2 레이어)에 대한 사전 계산 완료 여부를 나타내는 정보를 식별함에 기반하여, 현재 선택된 레이어에 대한 사전 계산된 값들이 존재하 는지 여부를 판단(예: 레이어에 대한 사전 계산 완료를 나타내는 정보가 있는 경우 사전 계산된 값들이 존재하 는 것으로 판단, 또는 레이어에 대한 사전 계산 완료를 나타내는 정보가 없는 경우 사전 계산된 값들이 존재하 지 않는 것으로 판단)할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 선택된 레이어에 대한 사전 계산된 값이 존재하지 않는 경우, 1207 동작에서 신뢰 실행 환경에서, 현재 레이어의 파라미터에 기반하여 연산을 수행할 수 있다. 예를 들어, 전 자 장치는 도 13a에 도시된 바와 같이 현재 선택된 레이어(예: 제 1 레이어)에 대해서 사전 계산된 값이 없는 것으로 판단할 수 있다. 전자 장치는 이 경우, 신뢰 실행 환경에서 선택된 레이어(layer#n)(예: 제 1 레이어)의 적어도 하나의 파라미터(예: 가중치 값들(An)(예: A1), 활성 함수들, 또는 바이어스(bias)들 중 적어도 하나)에 기반하여 입력되는 데이터에 대한 연산을 수행할 수 있다. 일 예로, 전자 장치(예: 프로세 서)는 신뢰 실행 환경에서 입력 데이터(Xn)을 획득하고, 획득된 입력 데이터(Xn)와 현재 선택된 레이 어(예: 제 1 레이어)의 가중치 값들(예: 가중치 행렬(An)(예: A1))을 연산(예: 행렬 곱)할 수 있다. 전자 장치 는 상기 연산 결과에 상기 레이어(예: 제 1 레이어)의 바이어스(Bn)를 연산(예: 행렬 덧셈)하고, 활성 함 수(예: Relu)가 있는 경우에는 활성 함수를 적용하여 출력되는 출력 데이터를 획득할 수 있다. 상기 인공 지능 모델에서의 일 레이어에서의 연산 동작은 주지된 기술과 같이 수행될 수 있으므로, 더 구체적인 설명은 생략한 다. 전자 장치는 출력 데이터 획득 이후, 1217 동작에서 현재 레이어가 마지막 레이어인지 여부를 판단하 고 마지막 레이어가 아닌 경우 1203 동작에서 계속해서 순차적으로 다음 레이어(예: 제 2 레이어)를 선택하여 연산을 수행할 수 있다. 또는 기재 및/또는 도시된 바에 제한되지 않고, 전자 장치는 선택된 레이어에 대한 사전 계산된 값이 없는 경우 다른 레이어의 사전 계산된 값들에 기반하여, 현재 선택된 레이어에 대한 연산 동작을 수행할 수도 있다. 다양한 실시예들에 따르면, 전자 장치는 선택된 레이어에 대한 사전 계산된 값이 존재하는 경우, 1209 동 작에서 현재 레이어에 대한 사전 계산된 값을 획득하고, 1211 동작에서 획득된 사전 계산된 값에 기반하여, 입 력 데이터에 입력 노이즈를 부가하여 제 1 입력 데이터를 생성할 수 있다. 예를 들어, 전자 장치는 도 13b 에 도시된 바와 같이 현재 선택된 레이어(layer#n+1)(예: 제 2 레이어)에 대해서 사전 계산된 값이 있는 것으로 판단한 경우, 상기 사전 계산된 값을 기반으로 연산을 수행할 수 있다. 일 예로, 전자 장치는 신뢰 실행 환경 현재 레이어(layer#n+1)(예: 제 2 레이어)로 입력되는 데이터(예: 제 1 레이어의 출력 데이터)(Xn+ 1)에 입력 노이즈를 부가하여 노이즈가 반영된 입력 데이터(X'n+1)를 획득하고, 획득된 노이즈가 반영된 입력 데이터(X'n+1)를 일반 실행 환경에 할당된 메모리의 특정 영역(313a)에 저장할 수 있다. 상기 전자 장치의 1211 동작은 전자 장치의 연산 데이터를 획득하는 동작(505 동작)에서 전술한 바와 같이 수행 될 수 있으므로 중복되는 설명은 생략한다. 다양한 실시예들에 따르면, 전자 장치는 1213 동작에서 생성된 제 1 입력 데이터에 가중치 노이즈가 반영 된 가중치 값들을 연산하여, 제 1 연산 데이터를 획득할 수 있다. 예를 들어, 전자 장치는 실행 환경을 신 뢰 실행 환경에서 일반 실행 환경으로 전환(또는 변경)하고, 메모리의 특정 영역(313a)에 저장 된 노이즈가 반영된 입력 데이터(X'n+1) 및 가중치 노이즈가 반영된 현재 레이어(예: 제 2 레이어)의 가중치 값 들(A'n+1)을 획득할 수 있다. 전자 장치는 일반 실행 환경에서 입력 데이터(X'n+1)와 가중치 노이즈 가 반영된 현재 레이어(예: 제 2 레이어)의 가중치 값들(A'n+1)을 연산(예: 행렬 곱)함으로써, 연산 데이터 (Y'n+1)를 획득할 수 있다. 전자 장치는 획득된 연산 데이터(Y'n+1)를 메모리의 특정 영역(313a)에 저장할 수 있다. 상기 전자 장치의 1213 동작은 전자 장치의 연산 데이터를 획득하는 동작(505 동 작)에서 전술한 바와 같이 수행될 수 있으므로 중복되는 설명은 생략한다. 다양한 실시예들에 따르면, 전자 장치는 1215 동작에서 제 1 연산 데이터 및 기저장된 노이즈 값들에 기반 하여, 제 1 출력 데이터를 획득할 수 있다. 예를 들어, 전자 장치는 상기 실행 환경을 일반 실행 환경 에서 일반 실행 환경으로 전환하고, 메모리의 특정 영역(313a)으로부터 현재 레이어(예: 제 2 레이어)의 연산 데이터(Y'n+1)를 획득할 수 있다. 전자 장치는 연산 데이터(Y'n+1)로부터 노이즈를 제거(예: 입력 노이즈(zn+1)을 나눔, Tn+1을 더함)함으로써 출력 데이터(Yn+1)를 획득할 수 있다. 상기 전자 장치 의 1213 동작은 전자 장치의 출력 데이터를 획득하는 동작(507 동작)에서 전술한 바와 같이 수행될 수 있으므로 중복되는 설명은 생략한다. 다양한 실시예들에 따르면, 전자 장치는 1217 동작에서 현재 레이어가 가장 마지막 레이어인지 여부를 판 단하고, 현재 레이어가 가장 마지막 레이어인 경우 1219 동작에서 출력 레이어에서 결과 데이터를 획득할 수 있 다. 예를 들어, 전자 장치는 현재 선택된 레이어가 마지막 레이어인 경우에는, 마지막 레이어의 출력 데이 터를 결과 데이터로서 획득할 수 있다. 다양한 실시예들에 따르면, 전자 장치는 현재 레이어가 가장 마지막 레이어가 아닌 경우, 다시 1203 동작 에서 인공 지능 모델의 복수의 레이어들 중 일 레이어를 선택하여 선택된 레이어에 대한 연산을 수행할 수 있다. 예를 들어, 전자 장치는 현재 레이어가 마지막 레이어인지 여부를 판단하고 마지막 레이어가 아닌 경우 계속해서 순차적으로 다음 레이어(예: 제 3 레이어)를 선택하여 연산을 수행할 수 있다. 다양한 실시예들에 따르면, 전자 장치(예: 도 2의 전자 장치)로서, 메모리(예: 도 2의 메모리), 및 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서 (250b))를 포함하고, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세 서(250a) 및 제 2 프로세서(250b))는 상기 전자 장치(예: 도 2의 전자 장치)에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들(예: 도 6a의 An)에 노이즈 값(예: 도 6a의 zn)을 반영 (apply)함으로써, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 획득하고, 상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터(예: 도 6b의 Yn’)를 획득하고, 상기 획득된 연산 데이터(예: 도 6b의 Yn’) 및 상기 반영된 노이즈 값(예: 도 6a의 zn)에 기반하여, 출력 데이터(도 6b의 Yn)를 획득하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 복수의 실행 환경들에 기반하여 동작을 수행 가능하도록 설정되고, 상기 복수의 실행 환경들은 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경) 및 신뢰 실행 환경 (예: 도 3a 내지 도 3c의 신뢰 실행 환경)을 포함하고, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b 의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 신뢰 실행 환경(예: 도 3a 내 지 도 3c의 신뢰 실행 환경)에서, 상기 노이즈 값(예: 도 6a의 zn)을 생성하고, 상기 복수의 레이어들 중 적어도 일부의 웨이트 값들(예: 도 6a의 An)에 노이즈 값(예: 도 6a의 zn)을 반영(apply)하고, 상기 이벤트가 식별되는 경우, 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일 부로 입력되는 데이터를 연산하고, 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서 상 기 획득된 연산 데이터(예: 도 6b의 Yn’) 및 상기 반영된 노이즈 값(예: 도 6a의 zn)에 기반하여, 출력 데이터 (도 6b의 Yn)를 획득하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 메모리(예: 도 2의 메모리) 중 제 1 일부는 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에 할당되고, 상기 메모리(예: 도 2의 메모리) 중 제 2 일부는 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에 할당되고, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 신뢰 실행 환 경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에 할당된 상기 메모리(예: 도 2의 메모리) 중 제 1 일부에 저장하고, 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 획득하 도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 지정된 범위 내의 값들 중에서 상기 노이즈 값(예: 도 6a의 zn)을 선택하도록 설정되고, 상기 지정된 범위 내의 값들은 0.9 미만의 값들 또는 1.1 이상의 값들을 포함하는, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다.다양한 실시예들에 따르면, 상기 전자 장치(예: 도 2의 전자 장치)는 상기 인공 지능 모델에 기반한 연산 을 수행하기 위한 복수의 연산 장치들을 더 포함하고, 상기 복수의 연산 장치들은 상기 복수의 실행 환경들 중 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에 할당되고, 상기 적어도 하나의 프로세서 (예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 일반 실 행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서, 상기 복수의 연산 장치들을 이용하여, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 기반으로 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경(32 0))에서 상기 복수의 레이어들 중 적어도 일부로 입력될 입력 데이터에 대응하는 제 1 노이즈 값들(예: 도 6a의 Rn)을 생성하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 입력될 상기 입력 데이터의 값의 범위 중에서 랜덤하게 값을 선택함으로써, 상기 제 1 노이즈 값들(예: 도 6a의 Rn) 각각을 생성하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서 상기 복수의 레이어들 중 적어도 일부로 입 력되는 상기 데이터에 상기 제 1 노이즈 값들(예: 도 6a의 Rn)을 반영하여 상기 제 1 노이즈 값들(예: 도 6a의 Rn)이 반영된 상기 데이터를 획득하고, 상기 제 1 노이즈 값들(예: 도 6a의 Rn)이 반영된 상기 데이터를 획득한 것에 기반하여, 상기 전자 장치(예: 도 2의 전자 장치)의 실행 환경을 상기 신뢰 실행 환경(예: 도 3a 내 지 도 3c의 신뢰 실행 환경)에서 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)으로 변경하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경(31 0))에서, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)에 기반하여 상기 제 1 노이즈 값들(예: 도 6a의 Rn)이 반영된 상기 데이터를 연산하도록 설정된, 전자 장치(예: 도 2의 전자 장치 )가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경(32 0))에서, 상기 인공 지능 모델의 상기 복수의 레이어들 중 일부의 상기 웨이트 값들(예: 도 6a의 An), 상기 노 이즈 값(예: 도 6a의 zn)들, 상기 제 1 노이즈 값들(예: 도 6a의 Rn), 및 바이어스에 기반하여 제 1 값들을 생 성하고, 상기 생성된 제 1 값들을 상기 메모리(예: 도 2의 메모리) 중 일부에 저장하도록 설정된, 전자 장 치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경(31 0))에서 상기 획득된 연산 데이터(예: 도 6b의 Yn’) 및 상기 미리 저장된 제 1 값들을 연산함으로써 기반하여, 상기 출력 데이터(도 6b의 Yn)를 획득하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 전자 장치(예: 도 2의 전자 장치)의 상태를 식별하고, 상 기 전자 장치(예: 도 2의 전자 장치)의 상태가 유휴 상태인 경우, 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서 상기 노이즈 값(예: 도 6a의 zn)을 생성하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 인공 지능 모델의 상기 복수의 레이어들 중 상기 노이즈 값(예: 도 6a의 zn)이 생성된 레이어들의 수를 식별하고, 상기 식별된 레이어들의 수가 기설정된 값 미만인 경우, 상기 노이즈 값(예: 도 6a의 zn)이 생성되지 않은 레이어들 중 일부 레이어를 선택하고, 상기 선택된 일부 레이어와 연관된 상기 노이즈 값(예: 도 6a의 zn)을 생성하도록 설정된, 전자 장치(예: 도 2의 전자 장치(10 1))가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 인공 지능 모델의 상기 복수의 레이어들 중 첫번째 레이어와 연관된 상기 노이즈 값(예: 도 6a의 zn)을 생성하는 동작을 삼가하도록 설정된, 전자 장치(예: 도 2의 전자 장 치)가 제공될 수 있다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 상기 이벤트가 식별되는 경우, 상기 인공 지능 모델의 상기 복수의 레이어들 중 일부에 대한 상기 노이즈 값(예: 도 6a의 zn)이 상기 전자 장치(예: 도 2의 전자 장치)에 저 장되었는지 여부를 식별하고, 상기 노이즈 값(예: 도 6a의 zn)이 상기 전자 장치(예: 도 2의 전자 장치)에 저장되지 않은 경우, 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서 상기 복수의 레이 어들 중 일부의 웨이트 값들(예: 도 6a의 An)에 기반하여 상기 복수의 레이어들 중 일부로 입력되는 상기 데이 터를 연산하고, 상기 노이즈 값(예: 도 6a의 zn)이 상기 전자 장치(예: 도 2의 전자 장치)에 저장된 경우, 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서 상기 노이즈 값(예: 도 6a의 zn)이 반 영된 상기 복수의 레이어들 중 일부의 웨이트 값들(예: 도 6a의 An)에 기반하여 상기 복수의 레이어들 중 일부 로 입력되는 상기 데이터를 연산하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다. 다양한 실시예들에 따르면, 전자 장치(예: 도 2의 전자 장치)의 동작 방법으로서, 상기 전자 장치(예: 도 2의 전자 장치)에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들(예: 도 6a의 An)에 노이즈 값(예: 도 6a의 zn)을 반영(apply)함으로써, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 획득하는 동작, 상기 인공 지능 모델의 실행을 위한 이벤트가 식별되는 경우, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 이용하여, 상기 복수의 레이 어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터(예: 도 6b의 Yn’)를 획득하는 동작, 및 상기 획득된 연산 데이터(예: 도 6b의 Yn’) 및 상기 반영된 노이즈 값(예: 도 6a의 zn)에 기반하여, 출력 데이터(도 6b의 Yn)를 획득하는 동작을 포함하는, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있 다. 다양한 실시예들에 따르면, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서(250b))는 복수의 실행 환경들에 기반하여 동작을 수행 가능하도록 설정되고, 상기 복수의 실행 환경들은 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경) 및 신뢰 실행 환경 (예: 도 3a 내지 도 3c의 신뢰 실행 환경)을 포함하고, 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서, 상기 노이즈 값(예: 도 6a의 zn)을 생성하고, 상기 복수의 레이어들 중 적어도 일부의 웨 이트 값들(예: 도 6a의 An)에 노이즈 값(예: 도 6a의 zn)을 반영(apply)하는 동작, 상기 이벤트가 식별되는 경 우, 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되 는 데이터를 연산하는 동작, 및 제 3 시구간 동안 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경 )에서 상기 획득된 연산 데이터(예: 도 6b의 Yn’) 및 상기 반영된 노이즈 값(예: 도 6a의 zn)에 기반하여, 출력 데이터(도 6b의 Yn)를 획득하는 동작을 포함하는, 동작 방법이 제공될 수 있다. 다양한 실시예들에 따르면, 상기 메모리(예: 도 2의 메모리) 중 제 1 일부는 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에 할당되고, 상기 메모리(예: 도 2의 메모리) 중 제 2 일부는 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에 할당되고, 상기 신뢰 실행 환경(예: 도 3a 내 지 도 3c의 신뢰 실행 환경)에서, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a 의 An’)을 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에 할당된 상기 메모리(예: 도 2 의 메모리) 중 제 1 일부에 저장하는 동작, 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경 )에서, 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 획득하는 동작을 포함하는, 동작 방법이 제공될 수 있다. 다양한 실시예들에 따르면, 지정된 범위 내의 값들 중에서 상기 노이즈 값(예: 도 6a의 zn)을 선택하도록 설정 되고, 상기 지정된 범위 내의 값들은 0.9 미만의 값들 또는 1.1 이상의 값들을 포함하는, 동작 방법이 제공될 수 있다.다양한 실시예들에 따르면, 전자 장치(예: 도 2의 전자 장치)로서, 메모리(예: 도 2의 메모리), 및 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세서(250a) 및 제 2 프로세서 (250b))를 포함하고, 상기 적어도 하나의 프로세서(예: 도 3a 및 도 3b의 프로세서, 도 3c의 제 1 프로세 서(250a) 및 제 2 프로세서(250b))는 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서 상기 전자 장치(예: 도 2의 전자 장치)에 저장된 인공 지능 모델에 포함된 복수의 레이어들 중 적어도 일부의 웨이트 값들(예: 도 6a의 An)에 노이즈 값(예: 도 6a의 zn)을 반영(apply)함으로써, 상기 노이즈 값(예: 도 6a 의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 획득하고, 상기 인공 지능 모델의 실행을 위한 이벤트 가 식별되는 경우, 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서 상기 노이즈 값(예: 도 6a의 zn)이 반영된 상기 웨이트 값들(예: 도 6a의 An’)을 이용하여, 상기 복수의 레이어들 중 상기 적어도 일부로 입력되는 데이터를 연산함에 기반하여, 연산 데이터(예: 도 6b의 Yn’)를 획득하고, 상기 연산 데이터 (예: 도 6b의 Yn’)를 획득한 것에 기반하여 상기 전자 장치(예: 도 2의 전자 장치)의 상태를 상기 일반 실행 환경(예: 도 3a 내지 도 3c의 일반 실행 환경)에서 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신 뢰 실행 환경)으로 변경하고, 상기 신뢰 실행 환경(예: 도 3a 내지 도 3c의 신뢰 실행 환경)에서, 상 기 획득된 연산 데이터(예: 도 6b의 Yn’) 및 상기 반영된 노이즈 값(예: 도 6a의 zn)에 기반하여, 출력 데이터 (도 6b의 Yn)를 획득하도록 설정된, 전자 장치(예: 도 2의 전자 장치)가 제공될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면3c 도면4a 도면4b 도면5a 도면5b 도면6a 도면6b 도면7 도면8 도면9 도면10 도면11 도면12 도면13a 도면13b"}
{"patent_id": "10-2021-0054594", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다양한 실시예들에 따른 전자 장치의 구성의 일 예를 설명하기 위한 도면이다. 도 3a는 다양한 실시예들에 따른 단일 프로세서가 구비되는 경우 전자 장치의 실행 환경의 일 예를 설명하기 위 한 도면이다. 도 3b는 다양한 실시예들에 따른 단일 프로세서가 구비되는 경우 전자 장치의 실행 환경의 다른 예를 설명하기 위한 도면이다. 도 3c는 다양한 실시예들에 따른 멀티 프로세서가 구비되는 경우 전자 장치의 실행 환경의 일 예를 설명하기 위 한 도면이다. 도 4a는 다양한 실시예들에 따른 인공 신경망의 일 예를 설명하기 위한 도면이다. 도 4b는 다양한 실시예들에 따른 인공 신경망의 다른 예를 설명하기 위한 도면이다. 도 5a는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 5b는 다양한 실시예들에 따른 전자 장치의 어플리케이션의 실행에 기반하여 인공 지능 모델을 선택하는 동작 의 예를 설명하기 위한 도면이다. 도 6a는 다양한 실시예들에 따른 전자 장치의 신뢰 실행 환경에서의 사전 계산 동작의 일 예를 설명하기 위한 도면이다. 도 6b는 다양한 실시예들에 따른 사전 계산 동작에 따라서, 전자 장치에 저장되는 값들의 예를 설명하기 위한 도면이다. 도 7은 다양한 실시예들에 따른 전자 장치의 사전 계산된 값들을 이용하여, 인공 지능 모델에 기반한 연산 동작 의 일 예를 설명하기 위한 도면이다. 도 8은 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 9는 다양한 실시예들에 따른 전자 장치의 유휴 상태와 활성화 상태의 일 예를 설명하기 위한 도면이다. 도 10은 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다. 도 11은 다양한 실시예들에 따른 전자 장치의 유휴 상태에서 선택된인공 지능 모델에 대한 사전 계산 동작을 수 행하는 동작의 일 예를 설명하기 위한 도면이다. 도 12는 다양한 실시예들에 따른 전자 장치의 동작의 일 예를 설명하기 위한 흐름도이다.도 13a는 다양한 실시예들에 따른 전자 장치의 인공 지능 모델의 사전 계산 동작이 완료되지 않은(또는, 사전 계산 동작이 수행되지 않은) 레이어에 대해서 연산을 수행하는 동작의 일 예를 설명하기 위한 도면이다. 도 13b는 다양한 실시예들에 따른 전자 장치의 인공 지능 모델의 사전 계산 동작이 완료된 레이어에 대해서 연 산을 수행하는 동작의 일 예를 설명하기 위한 도면이다."}
