{"patent_id": "10-2024-7040908", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0005499", "출원번호": "10-2024-7040908", "발명의 명칭": "라이드 차량 인공 지능 엔티티 시스템 및 방법", "출원인": "유니버셜 시티 스튜디오스 엘엘씨", "발명자": "조던 로버트 마이클"}}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "라이드 차량 인공 지능 엔티티(ride vehicle artificial intelligence entities)를 활용하는 시스템으로,놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 활동을 인식하도록 구성된 하나 이상의 방문객 활동 인식 장치와,상기 놀이 공원의 라이드 중 하나 이상의 라이드 차량을 포함하되,각각의 라이드 차량은,상기 인식된 하나 이상의 방문객의 활동에 적어도 부분적으로 기초하여 상기 라이드 차량의 하나 이상의 라이드차량 인공 지능 엔티티를 유지하도록 구성된 인공 지능 엔티티 관리 시스템과,상기 라이드 차량에 배치되고, 상기 인공 지능 엔티티 관리 시스템에 의해 활성화되어 상기 하나 이상의 라이드차량 인공 지능 엔티티의 하나 이상의 속성에 따라 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 존재를시뮬레이션하도록 구성된 하나 이상의 특징부를 포함하는,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 각각의 라이드 차량 인공지능 엔티티는 상기 라이드 차량에특화된,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 각각의 라이드 차량 인공 지능 엔티티는 상기 하나 이상의방문객 중 하나의 방문객 또는 방문객 그룹에 특화된,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부는, 상기 인공 지능 엔티티 관리 시스템에 의해 활성화되어상기 하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티를 표시하도록 구성된하나 이상의 디스플레이를 포함하는,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0005499-2-제1항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부는, 상기 인공 지능 엔티티 관리 시스템에 의해 활성화되어상기 하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티와 연관된 빛을 생성하도록 구성된 조명 효과 시스템을 포함하는,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부는, 상기 인공 지능 엔티티 관리 시스템에 의해 활성화되어상기 하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티의 존재를 시뮬레이션하도록 구성된 하나 이상의 애니메이션 피규어를 포함하는,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부는, 상기 인공 지능 엔티티 관리 시스템에 의해 활성화되어상기 하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티와 연관된 소리를 생성하도록 구성된 음향 효과 시스템을 포함하는,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 상기 하나 이상의 속성은 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 신원, 상기 하나 이상의 라이드 차량 인공 지능 엔티티에 대한 하나 이상의 세부사항, 상기하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 성격 특성, 상기 하나 이상의 라이드 차량 인공 지능엔티티의 분위기, 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 선호도 또는 이들의 일부 조합을 포함을 포함하는,시스템."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "라이드 차량 인공 지능 엔티티를 활용하는 방법으로서,하나 이상의 방문객 활동 인식 장치를 통해, 놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 활동을 인식하는 단계와,라이드 차량의 인공 지능 엔티티 관리 시스템을 통해, 상기 인식된 하나 이상의 방문객의 활동에 적어도 부분적으로 기초하여 상기 라이드 차량의 하나 이상의 라이드 차량 인공 지능 엔티티를 유지하는 단계와,상기 라이드 차량의 상기 인공 지능 엔티티 관리 시스템을 통해, 상기 라이드 차량에 배치된 하나 이상의 특징부를 활성화하여 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 속성에 따라 상기 하나 이상의라이드 차량 인공 지능 엔티티의 존재를 시뮬레이션하는 단계를 포함하는,공개특허 10-2025-0005499-3-방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 각각의 라이드 차량 인공지능 엔티티는 상기 라이드 차량에특화된,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 각각의 라이드 차량 인공 지능 엔티티는 상기 하나 이상의방문객 중 하나의 방문객 또는 방문객 그룹에 특화된,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부를 활성화하는 것은, 하나 이상의 디스플레이를 활성화하여상기 하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티를 표시하는 것을 포함하는,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부를 활성화하는 것은, 조명 효과 시스템을 활성화하여 상기하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티와 연관된 빛을 생성하는것을 포함하는,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 라이드 차량에 배치된 상기 하나 이상의 특징부를 활성화하는 것은, 하나 이상의 애니메이션 피규어를 활성화하여 상기 하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티의 존재를시뮬레이션하는 것을 포함하는,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,공개특허 10-2025-0005499-4-상기 라이드 차량에 배치된 상기 하나 이상의 특징부를 활성화하는 것은, 음향 효과 시스템을 활성화하여 상기하나 이상의 라이드 차량 인공 지능 엔티티 중 하나의 라이드 차량 인공 지능 엔티티와 연관된 소리를 생성하는것을 포함하는,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 상기 하나 이상의 속성은 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 신원, 상기 하나 이상의 라이드 차량 인공 지능 엔티티에 대한 하나 이상의 세부사항, 상기하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 성격 특성, 상기 하나 이상의 라이드 차량 인공 지능엔티티의 분위기, 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 선호도 또는 이들의 일부 조합을 포함을 포함하는,방법."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "라이드 차량 인공 지능 엔티티를 활용하는 라이드 차량으로서,상기 라이드 차량은,놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 인식된 활동과 관련된 데이터를 수신하고,상기 하나 이상의 방문객의 인식된 활동과 관련된 데이터에 적어도 부분적으로 기초하여 상기 라이드 차량의 하나 이상의 라이드 차량 인공 지능 엔티티를 유지하며,상기 라이드 차량에 배치된 하나 이상의 특징부를 활성화하여 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 속성에 따라 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 존재를 시뮬레이션하도록 구성되는,라이드 차량."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 각각의 라이드 차량 인공지능 엔티티는 상기 라이드 차량에특화된,라이드 차량."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 각각의 라이드 차량 인공 지능 엔티티는 상기 하나 이상의방문객 중 하나의 방문객 또는 방문객 그룹에 특화된,라이드 차량."}
{"patent_id": "10-2024-7040908", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "공개특허 10-2025-0005499-5-제17항에 있어서,상기 하나 이상의 라이드 차량 인공 지능 엔티티의 상기 하나 이상의 속성은 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 신원, 상기 하나 이상의 라이드 차량 인공 지능 엔티티에 대한 하나 이상의 세부사항, 상기하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 성격 특성, 상기 하나 이상의 라이드 차량 인공 지능엔티티의 분위기, 상기 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 선호도 또는 이들의 일부 조합을 포함을 포함하는,라이드 차량."}
{"patent_id": "10-2024-7040908", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 명세서에 제시된 시스템 및 방법은 놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 활동을 인식하도록 구성된 하나 이상의 방문객 활동 인식 장치를 포함한다. 시스템은 또한 놀이 공원의 라이드 중 하나 이상의 라이 드 차량을 포함하되, 각각의 라이드 차량은, 하나 이상의 방문객의 인식된 활동에 적어도 부분적으로 기초하여 라이드 차량의 하나 이상의 라이드 차량 인공 지능 엔티티를 유지하도록 구성된 인공 지능 엔티티 관리 시스템과, 라이드 차량에 배치되고, 인공 지능 엔티티 관리 시스템에 의해 활성화되어 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 속성에 따라 하나 이상의 라이드 차량 인공 지능 엔티티의 존재를 시뮬레이션하 도록 구성된 하나 이상의 특징부를 포함한다."}
{"patent_id": "10-2024-7040908", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원에 대한 상호 참조 본 출원은 2022년 5월 11일에 \"라이드 차량 인공 지능 엔티티 시스템 및 방법\"이라는 명칭으로 출원된 미국 가 출원 제63/340,786호에 대한 우선권 및 이익을 주장하며, 이는 모든 목적을 위해 그 전체가 참조로 통합된다."}
{"patent_id": "10-2024-7040908", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 개시는 일반적으로 놀이 공원 분야와 관련된다. 보다 구체적으로, 본 개시의 실시예들은 라이드 차량 인공 지능 엔티티를 활성화하기 위한 시스템 및 방법에 관한 것이다. 이 섹션은 아래에 설명되는 본 개시의 다양한 양상과 관련될 수 있는 당업계의 다양한 양상을 독자에게 소개하 기 위한 것이다. 이러한 설명은 독자에게 본 개시의 다양한 양상에 대한 보다 나은 이해를 용이하게 하기 위한 배경 정보를 제공하는 데 도움이 될 것으로 믿어진다. 따라서, 본 명세서는 이러한 관점에서 읽혀져야 하며, 선 행 기술을 인정하는 것이 아님을 이해해야 한다. 놀이 공원은 각각의 공원 방문객에게 독특한 경험을 제공하는 다양한 특징부를 포함한다. 일부 특징부는 특정 경로를 따라 이동할 수 있는 라이드 차량을 포함할 수 있다. 그 경로는 요소를 포함할 수 있는데, 라이드 차량 이 그 경로를 따라 이동함에 따라, 그 요소가 방문객의 경험을 향상시킬 수 있다. 예를 들어, 라이드 차량은 경 로를 따라 이동할 때 여러 개의 방에 출입할 수 있으며, 각 방 내부에는 방문객의 경험을 향상시키는 요소가 있 다. 그러나, 이제 더 복잡한(그리고 맞춤화된) 경험을 시뮬레이션할 수 있는 기능이 방문객 경험을 더욱 향상시 킬 수 있다는 것이 인식되고 있다."}
{"patent_id": "10-2024-7040908", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "본 명세서에 개시된 특정 실시예의 요약이 아래에 개시되어 있다. 이러한 양상은 단지 독자에게 이러한 특정 실"}
{"patent_id": "10-2024-7040908", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "시예에 대한 간략한 요약을 제공하기 위한 것일뿐이며, 이러한 양상이 본 개시의 범위를 제한하기 위한 것이 아 님을 이해해야 한다. 실제로, 본 개시는 아래에 기재되지 않을 수 있는 다양한 양상을 포함할 수 있다. 특정 실시예에서, 시스템은 놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 활동을 인식하도록 구성된 하나 이상의 방문객 활동 인식 장치를 포함한다. 시스템은 또한 놀이 공원의 라이드 중 하나 이상의 라이드 차 량을 포함하되, 각각의 라이드 차량은, 하나 이상의 방문객의 인식된 활동에 적어도 부분적으로 기초하여 라이 드 차량의 하나 이상의 라이드 차량 인공 지능 엔티티를 유지하도록 구성된 인공 지능 엔티티 관리 시스템과, 라이드 차량에 배치되고, 인공 지능 엔티티 관리 시스템에 의해 활성화되어 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 속성에 따라 하나 이상의 라이드 차량 인공 지능 엔티티의 존재를 시뮬레이션하도록 구성 된 하나 이상의 특징부를 포함한다. 또한, 특정 실시예에서, 방법은 하나 이상의 방문객 활동 인식 장치를 통해, 놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 활동을 인식하는 단계를 포함한다. 방법은 또한 라이드 차량의 인공 지능 엔티티 관리 시 스템을 통해, 하나 이상의 방문객의 인식된 활동에 적어도 부분적으로 기초하여 라이드 차량의 하나 이상의 라 이드 차량 인공 지능 엔티티를 유지하는 단계를 포함한다. 방법은 라이드 차량의 인공 지능 엔티티 관리 시스템 을 통해, 라이드 차량에 배치된 하나 이상의 특징부를 활성화하여 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 속성에 따라 하나 이상의 라이드 차량 인공 지능 엔티티의 존재를 시뮬레이션하는 단계를 더 포함 한다.또한, 특정 실시예에서, 라이드 차량은 놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 인식된 활동과 관련된 데이터를 수신하고, 하나 이상의 방문객의 인식된 활동과 관련된 데이터에 적어도 부분적으로 기초하여 라이드 차량의 하나 이상의 라이드 차량 인공 지능 엔티티를 유지하며, 라이드 차량에 배치된 하나 이상의 특징 부를 활성화하여 하나 이상의 라이드 차량 인공 지능 엔티티의 하나 이상의 속성에 따라 하나 이상의 라이드 차 량 인공 지능 엔티티의 존재를 시뮬레이션하도록 구성된다."}
{"patent_id": "10-2024-7040908", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "하나 이상의 특정 실시예가 이하에서 설명될 것이다. 이러한 실시예에 대한 간결한 설명을 제공하기 위해, 실제 구현의 모든 특징이 본 명세서에 설명되지 않는다. 임의의 엔지니어링 또는 설계 프로젝트에서와 마찬가지로, 그러한 임의의 실제 구현의 개발에서, 시스템 관련 및 비즈니스 관련 제약 조건의 준수와 같은 개발자의 특정 목표를 달성하기 위해 수많은 구현별 결정이 이루어져야 하며, 이는 구현마다 다를 수 있음을 이해해야 한다. 더욱이, 그러한 개발 노력은 복잡하고 시간이 많이 소요될 수 있지만, 그럼에도 불구하고 본 개시의 혜택을 받 는 통상의 기술자에게는 일상적인 설계, 제작 및 제조 작업이 될 수 있음을 이해해야 한다. 본 개시의 실시예는 다양한 공원 센서에 의해 모니터링될 수 있는 놀이 공원 내의 (예를 들어, AI 엔티티와 직 접적으로 연관된) 방문객의 활동에 기초하여 수정될 수 있는 특정 신원, 캐릭터 세부 사항, 성격 특성, 기분, 선호도 등을 가질 수 있는 라이드 차량 인공 지능(AI) 엔티티를 관리하기 위한 시스템 및 방법에 관한 것이다. 각 AI 엔티티는 특정 라이드 차량에 특화(specific)될 수 있다. 실제로, 특정 실시예에서, 라이드 차량 AI 엔티 티 시스템은 특정 라이드 차량에 상주하여 특정 놀이기구 차량에 특화된 AI 엔티티를 나타낼 수 있다. 특정 실 시예에서, 특정 라이드 차량과 연관된 하나 이상의 특징부는 특정 라이드 차량의 라이드 차량 AI 엔티티 시스템 에 의해 활성화되어 특정 라이드 차량에 특화된 AI 엔티티의 존재를 나타낼 수 있다. 도면을 참조하면, 도 1은 라이드 차량 AI 엔티티를 가진 놀이 공원의 개략적 표현이다. 특정 실시예에서, 놀이 공원은 놀이 공원의 다양한 어트랙션, 구역, 통로, 또는 다른 영역 상에서 또는 그 주변에서 특정 방문객을 위해 수정될 수 있는 하나 이상의 특징부(예컨대, 디스플레이(12A), 조명 효과 시스템(12B), 애니 메이션 피규어(12C) 및/또는 음향 효과 시스템(12D))를 포함한다. 도 1에 도시된 하나 이상의 특징부는 놀 이 공원 전체에 걸쳐 다양한 위치에 배치될 수 있다. 그러나, 본 명세서에서 보다 상세하게 설명되는 바와 같이, 하나 이상의 특징부는 특정 라이드 차량에 상주할 수 있으며, 놀이 공원의 특정 라이드 차량 에 특화된 AI 엔티티의 존재를 나타내도록 구성된 라이드 차량 AI 표현 시스템으로서 집합적으로 기능할 수 있다. 또한, 본 명세서에서 보다 상세하게 설명되는 바와 같이, 특정 라이드 차량의 하나 이상의 특징부 에 의해 표현되는 라이드 차량 AI 엔티티는 특정 라이드 차량을 타는 특정 방문객에 특화될 수도 있다. 예시된 실시예에서, 놀이 공원은 또한 어트랙션들 그 중에서도 터널 라이드 어트랙션(14A), 가상 게임 룸 어트랙션(14B), 레스토랑 어트랙션(14C), 롤러코스터 어트랙션(14D) 및 워터 어트랙션(14E)을 포함하는 복수의 어트랙션을 포함한다. 본 명세서에서 보다 상세하게 설명되는 바와 같이, 특징부의 상이한 실시예는 놀이 공원 전체에서 발견될 수 있으며, 방문객 추적 시스템에 의해 수집되는, 놀이 공원에 대해 배치 된 다양한 공원 센서에 의해 수집된 방문객 데이터에 적어도 부분적으로 기초하여 방문객이 AI 엔티티 로부터의 응답으로서 인식하는 방식으로 반응하도록 활성화될 수 있다. 예를 들어, 특정 실시예에서, 터널 라이드 어트랙션(14A)은 애니메이션 피규어(12C)의 이미지를 표시하는 디스 플레이(12A)를 포함할 수 있다. 특정 방문객을 검출하는 것, 예를 들어, 근접 센서(18A)를 사용하여 사람의 존재를 검출하고 카메라(18B)를 사용하여 특정 방문객을 식별하는, 특정 방문객 검출에 응답하여, 특정 애니메이션 피규어(12C)는 본 명세서에 더 상세하게 설명된 바와 같이 특정 방문객에 대해 수집된 방문객 데이터에 적어도 부분적으로 기초하여 반응하도록 표시될 수 있다. 또한, 특정 실시예에서, 가상 게임 룸(14B) 내의 가상 게임에서 애니메이션 피규어(12C)의 가상 실시예 또는 홀로그램이 유사하게 반응할 수 있다. 다른 비제한적인 예로서, 특정 실시예에서, 특정 방문객은 예를 들어, 특정 방문객과 연관된 방문객 웨 어러블 무선 주파수 식별(RFID) 태그(18C)로부터의 센서 데이터에 기초하여 현재 터널 라이드 어트랙션(14A)에 있는 것으로 판정될 수 있다. 예시된 바와 같이, 특정 실시예에서, 터널 라이드 어트랙션(14A)의 라이드 차량 은 하나 이상의 RFID 태그(18C)도 포함할 수 있다. 특정 실시예에서, 라이드 차량이 라이드 트랙을 따라 이동함에 따라, 라이드 트랙의 전자 판독기(18D)는 라이드 차량의 RFID 태그(18C)를 판독하여 라 이드 차량의 존재를 나타낼 수 있다. 라이드 차량이 존재하고 라이드 트랙을 따라 이동하는 것에 기초하여, 방문객 추적 시스템은 특정 방문객이 관심 있는 임계 거리 내에, 예를 들어, 본 명세서에 더 상세하게 설명된 바와 같이, 특정 방문객과 연관된 AI 엔티티의 존재를 시뮬레이션하도록 활성화될 수 있는 하나 이상의 특징부 근처의 거리 내에 존재한다고 판정할 수 있다. 추가적으로, 또는 대안적으로, 라이드 트랙 상에 배치된 중량 센서(18E)는 라이드 차량이 중량 센서(18E) 위로 이동할 때 임계 중량 이상의 중량을 검출하여 라이드 차량의 존재를 나타낼 수 있다. 특정 실시예에서, 라이드 차량이 존재하고 특정 방문객이 존재할 가능성이 있다고 판단한 후, 카메라 (18B) 및/또는 방문객 웨어러블 RFID 태그(18C)와 같은 추가 공원 센서는 추가 공원 센서를 트리거하여 (특정 방문객의 식별을 지원하기 위해) 데이터를 수집할 수 있다. 예를 들어, 특정 실시예에서, 방문객 추 적 시스템은 카메라(18B)에 의해 수집된 비디오 및/또는 이미지의 이미지 분석을 수행하여 이미지를 특정 방문객과 연관된 사용자 ID에 대응하는 이미지에 매칭할 수 있다. 카메라(18B)에 추가적으로 또는 대안적으 로, 방문객 추적 시스템은 RFID 태그 데이터를 분석하여 이를 특정 방문객과 연관된 사용자 ID와 연관 시킬 수 있다. 특정 실시예에서, 방문객 추적 시스템은, 예를 들어, 라이드 차량의 중량에 기초하여, 특정 방문객의 존재를 초기에 결정하는 대신에, 카메라(18B) 및/또는 RFID 태그(18C)를 사용하여 특정 방문 객의 존재를 결정하고 식별할 수 있다. 방문객을 식별한 후, 방문객 추적 시스템은 특정 방문객에 대한 방문객 데이터를 결정하고, 이어서 방문객 데이터에 기초하여 터널 라이드 어트랙션(14A)의 상호작용을 수정할 수 있다. 예를 들어, 특정 실시예에 서, 방문객 데이터는 특정 방문객이 광대를 두려워한다는 것을 나타낼 수 있다. 특히, 방문객 추적 시스템 은 특정 방문객이 광대를 두려워한다는 진술(예를 들어, 다른 어트랙션에서 오디오 센서(18F)에 의 해 캡처됨)을 한 것으로 판정할 수 있다. 따라서, 특정 특징부가 그에 따라 활성화될 수 있다. 예를 들어, 본 예에서, 특정 공원 애니메이션 피규어(12C)는 특정 방문객이 타고 있는 라이드 차량이 애니메이션 피규어(12C)에 접근할 때 (예를 들어, 관련 음향 효과 시스템(12D)을 통해) 특정 방문객을 부르며, 특정 방 문객이 이전에 놀이공원에서 플레이한 게임에 대해 묻고, 가족 구성원의 이름을 묻고, 방문객이 방 문한 놀이공원 구역과 관련된 코멘트 등을 할 수 있다. 따라서, 놀이 공원에 대해 배치된 특징부는 놀 이 공원에 대해 배치된 공원 센서에 의해 결정된 방문객 데이터에 기초하여 활성화될 수 있다. 또한, 특정 실시예에서, 애니메이션 피규어(12C)는 예를 들어, 방문객 데이터에 기초하여 특정 방문객을 겁주는 얼굴 또는 제스처를 취하도록 애니메이팅될 수 있다. 또한, 본 명세서에서 보다 상세하게 설명되는 바와 같이, 라이드 차량에 배치된 AI 엔티티 관리 시스템은, 방문객 추적 시스템에 의해 수집된 방문객 데이터를 검색하고, 라이드 차량의 특정 특징부(예를 들어, 디스플레이(12A), 조명 효과 시스템(12B), 애니메이션 피규어(12C) 및/또는 음향 효과 시스템(12D))를 활성화하 여 라이드 차량과 관련된 AI 엔티티의 존재를 시뮬레이션하도록 구성될 수 있다. 예로서, 방문객 데이터(예 컨대, 놀이 공원용으로 구매한 티켓의 수)는 특정 방문객이 다른 두 명의 가족 구성원과 함께 놀이 공 원을 방문하고 있음을 나타낼 수 있고, 따라서 특정 라이드 차량의 AI 엔티티 관리 시스템은 특정 방문 객이 특정 라이드 차량에 탑승할 때 다른 두 명의 가족 구성원에 관련된 데이터(예를 들어, 소셜 미디 어 애플리케이션에 태그된 가족 구성원 이름)에 액세스할 수 있다. 또한, 특정 실시예에서, 터널 라이드 어트랙션(14A)을 타는 동안, 방문객 추적 시스템은 특정 방문객이 다른 방문객과 함께 특정 라이드 차량 에 있음을 나타내는 카메라(18B)의 비디오 데이터를 분석할 수 있고, 다른 방문객이 가족 구성원임을 판단할 수 있으며, 이 데이터를 특정 라이드 차량의 AI 엔티티 관리 시스템으로 전송할 수 있다. 특정 실시 예에서, 방문객 추적 시스템은 추가적인 이미지 분석을 수행하여 캡처된 비디오 데이터를 소셜 미디어 애플 리케이션 상의 이미지에 매칭시켜 다른 방문객의 신원을 확인할 수 있고, 이 데이터를 특정 라이드 차량 의 AI 엔티티 관리 시스템으로 전송할 수 있다. 따라서, 특정 라이드 차량의 AI 엔티티 관리 시스템은 이 데이터를 사용하여 다른 방문객을 각자의 이름으로 불러서, 특정 방문객 및/또는 관련 방문객을 위한 맞춤형 상호작용을 제공할 수 있다. 그러나, 특정 실시예에서, 특정 방문객은 방문객 관리 시스템 및 특정 라이드 차량의 AI 엔티티 관리 시스템과 공유되는 데이터를 제어할 수 있으며, 따라서 상호작용의 범위는 공유되는 데이터의 범위에 대응할 수 있다. 예를 들어, 이러한 제한으로 인해, 특정 라이드 차량의 AI 엔티티 관리 시스템은 상호작용을 다른 가족 구성원이 아닌 오직 방문객의 이름으로만 호명하는 것으로 제한할 수 있다. 특정 실시예에서, 라이드 차량은 라이드 차량의 AI 엔티티 관리 시스템이 방문객 데이터에 기초하여 수 정하는 다른 음향 효과 시스템(12D)을 포함할 수 있다. 예를 들어, 특정 실시예에서, 라이드 차량의 AI 엔 티티 관리 시스템은 음향 효과 시스템(12D)이 특정 방문객이 선호하는 어트랙션과 연관된 오디오(예를 들어, 테마송)를 재생하도록 할 수 있다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 조명 효과 시스템(12B)이 특정 방문객에 대한 방문객 데이터에 기초하여 터널 라이드 어트랙션(14A)의 터널 내에 광대 얼굴을 투사하도록 할 수 있다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 특정 방문객의 존재에 기초하여 특정 라이드 차량의 다른 특징부를 활성화할 수 있다. 예를 들어, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 라이드 차량의 좌측에 배치된 특정 방문객 에 대해 터널 라이드 어트랙션(14A)의 좌측에 있는 특징부를 활성화하는 한편, 라이드 차량의 우측 에 배치된 특정 방문객에 대해 터널 라이드 어트랙션(14A)의 우측에 있는 특징부를 활성화할 수 있다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 식별된 방문객이 탑승 차량 내에 있을 때 라이드 차량의 애니메이션 피규어(12C)를 활성화할 수 있다. 특정 실시예에서, 방문객 추적 시스템 은 방문객의 특정 그룹의 존재 및 그룹에 속한 개인의 선호도의 조합을 추적할 수 있다. 예를 들어, 특정 실시예에서, 다수의 그룹 구성원들 간의 관심사 오버랩이 식별되어 상호작용을 제공하는 데 사용될 수 있고, 그룹 내 구성원들의 선호도에 기초하여 상호작용의 랜덤 선택 또는 조합이 선택될 수 있으며, 그룹 선 호도에 기초하여 상호작용이 순환될 수 있는 등이 있다. 또한, 특정 실시예에서, 모니터링 시스템 및/또는 서비스 데스크는 놀이 공원 내의 방문객의 활동을 모니터링하여 공원 운영이 예상대로 완료되는지 확인할 수 있다. 특히, 본 명세서에 보다 상세하게 설명 된 바와 같이, 본 명세서에 설명된 다양한 특징부를 통해 활성화되는 특정 방문객과의 상호작용은 하나 이상의 AI 엔티티의 존재를 시뮬레이션하기 위한 것이며, 이는 예를 들어, 본 명세서에 설명된 다양한 공원 센 서에 의해 검출된 놀이 공원 내의 특정 방문객의 이전 활동을 기반으로 특정 \"성격 특성\"을 개발한 다. 라이드 차량이 본 명세서에 설명된 각각의 라이드 차량 AI 엔티티를 유지하는 방법을 설명하기 위해, 도 2는 라이드 차량 AI 엔티티의 존재를 시뮬레이션하도록 도 1의 놀이 공원의 특징부를 활성화하 기 위한 라이드 차량 AI 엔티티 시스템을 도시한다. 도시된 바와 같이, 라이드 차량 AI 엔티티 시스템 은 장치들 그 중에서도 공원 센서, 방문객 추적 시스템, 하나 이상의 특징부 및 AI 엔티티 관리 시 스템을 갖는 하나 이상의 라이드 차량, 및 하나 이상의 방문객 모바일 장치를 포함한다. 예시된 시 스템은 단지 예시적인 것으로서, 개시된 실시예에 따라 특정 특징 및 구성요소가 생략될 수 있고, 성능을 용이 하게 하기 위해 다양한 다른 특징 및 구성요소가 추가될 수 있다는 것을 이해해야 한다. 도시된 바와 같이, 특정 실시예에서, 각각의 라이드 차량의 AI 엔티티 관리 시스템은 입력 장치, 프로세서, 메모리, 및 통신 회로부를 포함할 수 있다. 특정 실시예에서, 입력 장치는 공원 센 서로부터 입력 데이터를 수신할 수 있다. 예를 들어, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 입력 장치가 물리적 데이터 인터페이스와 인터페이싱할 수 있는 각각의 라이드의 라이드 트랙 을 따라 특정 위치에서 입력 장치를 통해 공원 센서로부터 입력 데이터를 수신할 수 있다. 그러나, 다 른 실시예에서, 입력 장치는 공원 센서로부터 입력 데이터를 무선으로 수신하도록 구성될 수 있다. 입 력 장치에서 수신된 입력 데이터에 기초하여, 라이드 차량의 AI 엔티티 관리 시스템은 예를 들어, 라이드 차량 AI 엔티티의 인공 성격을 수정하고, 라이드 차량 AI 엔티티의 존재를 나타내도록 다양한특징부를 활성화하는 등의 방식으로 각각의 라이드 차량의 라이드 차량 AI 엔티티를 관리할 수 있 다. 특히, 본 명세서에 설명된(그리고 도 1에 도시된) 놀이 공원 설정에서, 라이드 차량의 AI 엔티티 관리 시스 템은 디스플레이(12A), 조명 효과 시스템(12B), 애니메이션 피규어(12C) 및/또는 음향 효과 시스템(12D)과 같은 라이드 차량의 특징부를 제어할 수 있다. 예로서, 터널 라이드 어트랙션(14A) 또는 롤러코스터 어 트랙션(14D)은 하나 이상의 디스플레이(12A), 조명 효과 시스템(12B), 하나 이상의 애니메이션 피규어(12C) 및/ 또는 음향 효과 시스템(12D)을 포함할 수 있다. 본 명세서에 더 상세하게 설명된 바와 같이, 라이드 차량의 AI 엔티티 관리 시스템은 각각의 특징부를 제어하여 방문객을 위한 맞춤형 상호작용을 제공할 수 있다. 예로서, 라이드 차량의 AI 엔티티 관리 시스템은 라이드 차량 상의 음향 효과 시스템(12D)의 스피커를 제어하여 특정 방문객와 연관된 라이드 차량 AI 엔티티와 연관된 오디오를 생성할 수 있다. 예를 들어, 오디오는 인식 가능하고 고유한 소리(예를 들어, 특정 AI 엔티티와 연관된 노래) 및/또는 방문 객의 이름을 포함할 수 있다. 맞춤형 오디오는 본 명세서에 설명된 공원 센서에 의해 획득된 방문객 데이터 에 기초할 수 있다. 다른 예로서, 라이드 차량의 AI 엔티티 관리 시스템은 라이드 차량의 조명 효과 시스템(12B)을 제 어하여 방문객 데이터에 기초하여 탑승 중에 특정 애니메이션을 투사할 수 있다. 예를 들어, 라이드 차량의 AI 엔티티 관리 시스템은 특정 방문객의 두려움을 나타내는 공원 센서로부터 방문객 데이터를 검색하고, 이 방문객 데이터를 사용하여 조명 효과 시스템(12B)에 의해 투사되는 애니메이션을 수정(예를 들어, 특정 방문객이 거미를 두려워하고 연관된 AI 엔티티가 거미와 관련된 경우 임의의 방식으로 거미를 투 사)할 수 있다. 이러한 방식으로, 라이드 차량의 AI 엔티티 관리 시스템은 방문객 데이터를 기반으로 맞춤형 경험을 제공하기 위해 라이드 상호작용을 제어 및 수정할 수 있다. 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 또한 본 명세서에서 보다 상세하게 설명되는 바와 같이, 라이드 차량 내의 특 정 방문객의 존재(예컨대, 식별, 위치, 움직임 등)도 검출할 수 있다. 도 1과 관련하여 전술한 바와 같이, 공원 센서는 하나 이상의 근접 센서(18A), 하나 이상의 카메라(18B), 하나 이상의 무선 주파수 식별(RFID) 태그(18C), 하나 이상의 전자 판독기(18D), 하나 이상의 중량 센서(18E) 및/또는 하나 이상의 오디오 센서(18F)를 포함할 수 있다. 공원 센서는 라이드의 라이드 차량 또는 라 이드 트랙과 같이, 방문객의 존재가 예상되는 영역에 배치되거나 위치될 수 있다. 특정 실시예에서, RFID 태그(18C)는 전자 판독기(18D)와 통신하여 특정 방문객의 존재를 나타낼 수 있다. 예를 들어, 특정 실시예 에서, RFID 태그(18C)는 라이드의 라이드 트랙 또는 라이드 차량과 같은 라이드 (예컨대, 라이드 차량 의 내부, 측면 또는 입구)에 통합될 수 있다. 또한, 전자 판독기(18D)는 RFID 태그(18C)의 스캔을 허용하는 방식으로 배치될 수 있다. 예로서, 전자 판독기(18D)는 라이드 트랙에 배치되어, 라이드 차량이 전자 판독기(18D) 위를 통과할 때 라이드 차량의 RFID 태그(18C)를 스캔할 수 있으며 이는 특정 방문객이 라 이드에 있음을 나타낸다. 특정 실시예에서, RFID 태그(18C)는 특정 사용자 ID와 연관된 방문객 웨어러블 RFID 태그(18C)를 포함할 수 있다. 따라서, 전자 판독기(18D)로부터의 입력 데이터는 특정 방문객과 관련된 방문객 웨어러블 RFID 태그(18C)를 스캔할 때 특정 사용자 ID와 관련된 특정 방문객이 존재함을 나타낼 수 있다. 이어서, 라이드 차량의 AI 엔티티 관리 시스템은 본 명세서에 더 상세하게 설명된 바와 같이 사용자 ID에 기초하여 방문객 데이터를 검색하고, 그에 따라 각각의 라이드 차량의 특징부를 활성 화할 수 있다. 본 명세서에 더 상세하게 설명된 바와 같이, 놀이 공원은 또한 라이드 이력, 상호작용 등과 같은 방문객 공 원 활동도 추적할 수 있다. 예로서, 추적된 방문객 공원 활동(예컨대, 방문객 웨어러블 RFID 태그(18C)를 통해 추적됨)은 특정 방문객이 방문객의 놀이 공원 방문의 대부분 동안 놀이 공원의 특정 구역에 머물렀 다는 것을 나타낼 수 있다. 추적된 방문객 공원 활동은 또한 특정 방문객이 다른 라이드보다 특정 라이드를 더 자주 탔다는 것을 나타낼 수도 있다. 이러한 방문객 데이터에 기초하여, 라이드 차량의 AI 엔티티 관리 시스템은 본 명세서에 더 상세하게 설명된 바와 같이 특정 방문객에 대한 선호도(예를 들어, 놀이 공원 에서의 선호 구역 및 라이드)를 결정할 수 있고 이러한 선호도를 사용하여 특정 방문객과 관련된 라이 드 차량 AI 엔티티의 인공 성격을 수정할 수 있다. 특정 실시예에서, 카메라(18B)는 방문객의 존재가 예상되는 위치에 기초하여 예를 들어, 라이드에서 라이드 차 량을 보기 위한 영역에 배치되거나 배치될 수 있다. 이러한 실시예에서, 카메라(18B)는 카메라(18B)에 의해 캡처된 이미지 및/또는 비디오에 기초하여 특정 방문객의 존재를 결정할 수 있다. 구체적으로, 카메라(18 B)는 얼굴 인식 및/또는 신체 인식을 수행하여 특정 방문객의 존재를 결정할 수 있다. 특정 실시예에서, 카메라(18B)는 대신 이미지 및/또는 비디오를 라이드 차량의 AI 엔티티 관리 시스템에 입력 데이터로서 제공할 수 있으며, 이후 얼굴 인식 및/또는 신체 인식을 수행할 수 있다. 예를 들어, 특정 실시예에서, 카메라 (18B) 및/또는 라이드 차량의 AI 엔티티 관리 시스템은 이미지 및/또는 비디오를 특정 방문객의 이 전에 저장된 이미지와 매칭시킬 수 있다. 특정 실시예에서, 특정 방문객의 이전에 저장된 이미지는 라이드 차량의 AI 엔티티 관리 시스템의 메모리에 저장되고 특정 방문객의 사용자 ID와 연관되고/ 되거나 제3자 애플리케이션을 통해 검색 가능한 것(예를 들어, 소셜 미디어 애플리케이션 상의 방문객 프로 필 사진)일 수 있다. 추가적으로 또는 대안적으로, 특정 실시예에서, 중량 센서(18E)는 방문객의 존재를 나타낼 수 있다. 예를 들어, 중량 센서(18E)는 라이드 트랙에 장착될 수 있고, 사전결정된 중량에 기초하여 라이드 트랙 상에 라이드 차량의 존재를 나타낼 수 있다. 마찬가지로, 특정 실시예에서, 근접 센서(18A)는 방문객의 존재가 예상되는 영역에 근접하게(예를 들어, 라이드 차량의 좌석에) 배치되거나 위치될 수 있다. 근접 센서(18A) 는 전자기장, 빛 및/또는 소리를 사용하여 물리적 접촉 없이 인근 물체의 존재를 검출할 수 있다. 근접 센서 (18A)는 전자기장 또는 전자기 방사 빔(예컨대, 적외선)을 방출하고 전자기장의 변화 또는 리턴 신호를 찾을 수 있다. 방문객으로서 인근 물체의 존재를 정확하게 검출하기 위해, 근접 센서(18A)는 라이드 차량의 탑 승 지점 근처 및/또는 라이드 차량 좌석에 위치할 수 있다. 특정 실시예에서, RFID 태그(18C) 및/또는 카메라 (18B)는 단독으로 또는 다른 공원 센서(예컨대, 중량 센서(18E) 및/또는 근접 센서(18A))와 함께 사용되어 특정 방문객의 존재를 검출하고/하거나 특정 방문객을 식별할 수 있다. 추가적으로, 또는 대안적으로, 특정 실시예에서, 제3자 애플리케이션은 라이드 차량의 AI 엔티티 관리 시스템에 입력 데이터를 제공할 수 있다. 즉, 방문객 허가 하에, 제3자 애플리케이션은 특정 라이드 차 량의 AI 엔티티 관리 시스템과 데이터를 공유하도록 활성화될 수 있다. 제3자 애플리케이션은 놀이 공원과 직접적인 관계를 갖지 않는 엔티티를 포함하는, 제3자와 관련된 시스템을 포함할 수 있다. 제3자 애 플리케이션은 하나 이상의 제3자로부터, 그들의 웹사이트, 모바일 애플리케이션 및/또는 다른 플랫폼을 통 해 수집된 제3자 데이터를 제공할 수 있다. 제3자 애플리케이션은 소셜 미디어 애플리케이션, 의료 애플리 케이션 및/또는 은행 애플리케이션을 포함할 수 있지만 이에 제한되지 않는다. 따라서, 제3자 애플리케이션(5 4)으로부터의 제3자 데이터는 소셜 미디어 애플리케이션, 의료 애플리케이션 및/또는 은행 애플리케이션과 관련 된 데이터를 포함할 수 있다. 특정 실시예에서, 방문객 모바일 장치는 또한 라이드 차량의 AI 엔티티 관리 시스템에 입력 데이터 를 제공할 수 있다. 예를 들어, 방문객으로부터 수신된 허가에 따라, 관련된 방문객 모바일 장치는 특 정 라이드 차량의 AI 엔티티 관리 시스템과 장치 데이터를 공유하도록 활성화될 수 있다. 장치 데이터 는 방문객 모바일 장치에 저장되거나 방문객 모바일 장치에 액세스 가능한 이미지 및/또는 비디오, 방 문객 모바일 장치의 GPS 위치, 방문객 모바일 장치에 의해 결정된 추적 데이터(예를 들어, 일일 걸음 수, 평균 스크린 타임 등) 및/또는 설정 선호도(예를 들어, 더 큰 텍스트, 컬러 테마, 특수 접근성 기능 활성화 등)를 포함할 수 있지만, 이에 한정되지 않는다. 도 1과 관련하여 위에서 설명한 바와 같이, 특정 실시예에서, 라이드 차량 AI 엔티티 시스템은 모니터링 시 스템 및/또는 서비스 데스크를 포함할 수 있다. 다음 논의에서는 모니터링 시스템 및 서비스 데스 크를 라이드 차량 AI 엔티티 시스템의 개별 구성요소로서 설명하지만, 이러한 구성요소들은 (예를 들어, 점선으로 표시된 것처럼) 서로 통신할 수도 있거나 또는 (예를 들어, 서비스 데스크가 모니터링 시스 템의 일부인 경우) 단일 시스템으로 통합될 수도 있다. 모니터링 시스템은 본 명세서에 설명된 공원 센 서 및 라이드 차량을 모니터링하는 관리 시스템일 수 있다. 예를 들어, 모니터링 시스템은, 본 명 세서에 더 상세하게 설명된 바와 같이, 특정 방문객의 존재 및 식별에 응답하여 라이드 차량의 AI 엔티 티 관리 시스템으로부터 전송되는 제어 신호를 모니터링할 수 있다. 특히, 모니터링 시스템은 공원 센 서 및 라이드 차량이 예상대로 기능하고/하거나 특정 방문객에 대해 예상된 대로 라이드 차량 AI 엔티티를 통해 맞춤형 상호작용을 제공할 수 있음을 보장할 수 있다. 추가적으로, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템이 예상대로 기능하고 있지 않는 경우(예를 들어, 잘못된 제어 신호를 생성하는 경우), 모니터링 시스템은 라이드 차량의 AI 엔티티 관 리 시스템을 제어하거나 재구성할 수 있다. 예를 들어, 모니터링 시스템은 특정 공원 센서 및/또는 라이드 차량의 특징부를 리셋 또는 재교정하고/하거나 (예를 들어, 라이드 차량의 AI 엔티티 관리 시스템에 의해 원래 결정된 바와 같이) 특징부에 대한 제어 신호를 무시할 수 있다. 특정 실시예에서,모니터링 시스템 및 라이드 차량의 AI 엔티티 관리 시스템은 단일 제어기로서 구현될 수 있다. 특정 실시예에서, 인간 또는 가상 서비스 에이전트를 포함할 수 있는 서비스 데스크는, 서비스 데스크 가 라이드 차량의 AI 엔티티 관리 시스템에 의해 결정되는 문제를 넘어서는 라이드 차량 AI 엔티티(3 6)의 임의의 문제를 발견하면 정지 메커니즘(예컨대, 버튼)을 통해 라이드 차량 AI 엔티티의 활성화를 수동 으로 정지시켜 라이드 차량의 AI 엔티티 관리 시스템으로부터 제어 신호를 무시할 수 있다. 본 명세서 에 설명된 바와 같이, (예를 들어, 방문객 웨어러블 RFID 태그(18C)를 통해) 방문객이 추적될 수 있기 때문 에, 서비스 데스크는 방문객의 활동을 모니터링하고 이 정보를 사용하여 놀이 공원에서 예기치 않 은 지연 또는 예상치 못한 기능을 해결할 수 있다. 예를 들어, 추적된 활동은 방문객이 특정 롤러 코스터를 타려고 시도했으나 임계 지속 시간을 초과하는 특정 지속 시간 동안 롤러 코스터 구역에 정지되어 있거나 거의 정지되어 있었음을 나타낼 수 있으며, 이는 롤러 코스터의 예상치 못한 지연 또는 대기열 및/또는 예상치 못한 성능을 나타낸다. 특정 실시예에서, 예상치 못한 활동은 그러한 문제를 해결하기 위해 서비스 데스크에 경 고할 수 있다. 라이드 차량의 AI 엔티티 관리 시스템의 통신 회로부는 라이드 차량의 AI 엔티티 관리 시스템 이 모니터링 시스템, 서비스 데스크, 라이드 차량의 특징부 및/또는 방문객 모바일 장치 와 같은 다양한 전자 장치와 인터페이싱할 수 있게 할 수 있다. 예를 들어, 특정 실시예에서, 모니터링 시 스템 및/또는 서비스 데스크는 라이드 차량의 AI 엔티티 관리 시스템과 통신하여 (양방향 화살 표로 표시된 바와 같이) 정보를 수신 및/또는 전송하여 라이드 차량의 AI 엔티티 관리 시스템 및/또는 라이드 차량의 특징부가 예상대로 작동하고 있음을 보장할 수 있다. 또한, 특정 실시예에서, 통신 회로 부는 라이드 차량의 AI 엔티티 관리 시스템이 라이드 차량의 특징부의 구성요소와 인터페 이싱할 수 있도록 할 수 있다. 예를 들어, 통신 회로부는 라이드 차량의 AI 엔티티 관리 시스템이 개인 영역 네트워크(PAN), 근거리 통신망(LAN) 및/또는 광역 네트워크(WAN)와 같은 네트워크에 통신 가능하게 결합할 수 있도록 할 수 있다. 따라서, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템은 입력 장치를 통해 공원 센서 로부터 수신된 데이터를 처리하고, 특정 방문객의 존재를 결정 및 식별하며, 각각의 사용자 ID로부 터 특정 방문객과 관련된 방문객 데이터를 결정하고, 라이드 차량 AI 엔티티에 대한 수정(예를 들어, 수정들 그 중에서도, 라이드 차량 AI 엔티티의 성격에 대한 수정)을 결정하며, 라이드 차량의 특정 특 징부(예를 들어, 특징부의 기능 활성화)를 통한 상호작용에 대한 수정을 결정하여 (예를 들어, 라이드 차량 AI 엔티티의 존재의 시뮬레이션을 통해) 방문객을 위한 맞춤형 경험을 용이하게 하고, 수정을 특 징부에 전달할 수 있다. 예를 들어, 입력 장치를 통해 수신된 센서 데이터를 처리한 후, 라이드 차량 의 AI 엔티티 관리 시스템의 프로세서는 통신 회로부가 라이드 차량의 특징부로 제어 데이터를 전송할 수 있게 하는 제어 신호를 결정하여 라이드 차량의 특징부를 통해 수정을 활성화할 수 있도록 할 수 있다. 또한, 특정 실시예에서, AI 엔티티 관리 시스템은 머신 러닝을 사용하여 공원 센서, 방문객 추적 시스 템, 모니터링 시스템, 서비스 데스크, 방문객 모바일 장치, 클라우드 스토리지 등으로부터 수 신 및/또는 이들로 전송되어야 하는 데이터가 무엇인지를 식별함으로써 비교적 효율적인 처리를 활용하여 라이 드 차량의 특징부를 통해 원하는 라이드 결과를 제공하도록 구성될 수 있다. 특히, 특정 실시예에서, AI 엔티티 관리 시스템은, 특정 유형의 데이터가 라이드 차량 AI 엔티티와 관련된 특정 기능을 수행하 는 데 필요한 (그리고 이미 로컬로 저장되지 않은) 경우에만, 공원 센서, 방문객 추적 시스템, 모니터 링 시스템, 서비스 데스크, 방문객 모바일 장치, 클라우드 스토리지 등으로부터 그 특정 유형의 데 이터를 요청할 수 있다. 또한, 특정 실시예에서, AI 엔티티 관리 시스템은 그 특정 유형의 데이터가 요청되 거나 또는 AI 엔티티 관리 시스템이 특정 유형의 데이터가 본 명세서에 설명된 라이드 차량 AI 엔티티 와 관련된 다른 기능의 수행에 필요할 것으로 판단하는 경우에만 그 특정 유형의 데이터를 방문객 추적 시스템 , 모니터링 시스템, 서비스 데스크, 방문객 모바일 장치, 클라우드 스토리지 등으로 전송할 수 있다. 라이드 차량의 AI 엔티티 관리 시스템의 프로세서는 방문객의 존재 및/또는 식별과 관련된 입 력 장치로부터 입력 신호를 수신하는 하나 이상의 처리 장치를 포함할 수 있는데, 이 입력 신호는 이후 본 명세서에 설명된 기법을 사용하여 라이드 차량의 특정 특징부(예컨대, 라이드 차량의 특징부의 기능의 활성화)를 통해 상호작용의 수정을 결정하는 데 사용되어 (예를 들어, 라이드 차량 AI 엔티티의 존 재의 시뮬레이션을 통해) 방문객의 맞춤형 경험을 용이하게 할 수 있다. 라이드 차량의 AI 엔티티 관리시스템의 메모리는 하나 이상의 유형의 비일시적 머신 판독가능 매체를 포함할 수 있다. 예를 들어, 그 러한 머신 판독가능 매체는 RAM, ROM, EPROM, EEPROM 또는 광학 디스크 스토리지, 자기 디스크 스토리지 또는 기타 자기 저장 장치, 또는 머신 실행가능 명령어 또는 데이터 구조의 형태로 원하는 알고리즘(예를 들어, 프로 그램 코드)을 전달 또는 저장하는 데 사용될 수 있고, 라이드 차량의 AI 엔티티 관리 시스템의 프로세 서에 의해 또는 다른 프로세서 기반 장치에 의해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있다. 라 이드 차량의 AI 엔티티 관리 시스템의 프로세서는 라이드 차량의 AI 엔티티 관리 시스템의 메모리에 저장된 머신 실행가능 명령어 알고리즘을 실행하기 위한 처리 코어를 포함할 수 있다. 라이드 차 량의 AI 엔티티 관리 시스템의 프로세서는 본 명세서에 설명된 라이드 차량의 특징부와 같 은 하드웨어 구성요소와 상호 작용하기 위해 처리 코어에서 실행되는 소프트웨어 애플리케이션을 위한 프로세서 측 인터페이스도 포함할 수 있다. 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템의 메모리 는 (예를 들어, 방문객의 수동 입력에 의해 및/또는 라이드 차량의 AI 엔티티 관리 시스템의 프로세서가 실행하는 알고리즘을 처리함으로써 결정되는 바와 같이) 추적된 방문객 활동 및 공원 활동 및 방문객의 해당 선호도에 대응하는 방문객 데이터를 저장할 수 있다. 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템의 메모리는 후속 검색을 위해 방문객 데이터를 저장하기 전에 해당 사용자 ID로 방문객 데이터에 태깅할 수 있다. 즉, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템 은 ID를 조회하고 연관된 방문객 데이터를 사용함으로써 방문객과 연관된 데이터를 검색할 수 있다. 예를 들어, 본 명세서에서 설명된 (그리고 도 1에 도시된) 놀이 공원 설정에서, 저장된 알고리즘은 공원 센서 로부터의 센서 데이터에 기초하여 방문객의 존재를 결정하고, (예를 들어, 카메라(18B)로부터 센서 데이터 를 처리하고, 얼굴 인식을 수행하고/하거나 방문객의 사용자 ID와 연관된 RFID 태그(18C)로부터의 센서 데이터를 처리함으로써) 특정 방문객을 식별하며, 사용자 ID에 대한 방문객 데이터를 검색하고, 방문객 데이터(예를 들어, 하나 이상의 라이드 차량 AI 엔티티를 수정하는 선호도 또는 방문객 정보를 나타냄)에 기초하여 놀이 공원 내의 상호작용에 대한 수정을 결정하며, 방문객 데이터에 기초하여 수정된 이미지, 소 리, 조명 효과 또는 애니메이션(예를 들어 메모리에 저장됨)을 제공하는 알고리즘을 포함할 수 있으나 이에 한정되지 않는다. 이러한 방식으로, 라이드 차량의 AI 엔티티 관리 시스템은 특정 방문객의 존재를 결정하고 그에 따라 라이드 차량의 특징부를 제어할 수 있다. 이와 같이, 본 명세서에서 보다 상세하게 설명되는 바와 같이, 도 2에 도시된 라이드 차량 AI 엔티티 시스템 은 도 1에 도시된 놀이 공원의 특정 라이드 차량과 연관되는 라이드 차량 AI 엔티티를 관리하 도록 구성된다. 도 3은 도 2의 라이드 차량 AI 엔티티 시스템을 작동시키는 방법의 흐름도이다. 도시된 바와 같이, 특정 실시예에서, 방법은 하나 이상의 방문객 활동 인식 장치(예컨대, 본 명세서에 설명된 공원 센서)를 통해, 놀이 공원의 물리적 환경 내에서 하나 이상의 방문객의 활동을 인식하는 것을 포함 한다(블록). 또한, 특정 실시예에서, 방법은 또한 하나 이상의 방문객의 인식된 활동에 적어도 부 분적으로 기초하여, 라이드 차량의 AI 엔티티 관리 시스템을 통해, 라이드 차량의 하나 이상의 라 이드 차량 AI 엔티티를 유지하는 것을 포함한다(블록 60). 또한, 특정 실시예에서, 방법은 라이드 차량 의 AI 엔티티 관리 시스템을 통해 라이드 차량에 배치된 하나 이상의 특징부를 활성화하여 하 나 이상의 라이드 차량 AI 엔티티의 하나 이상의 속성에 따라 하나 이상의 라이드 차량 AI 엔티티의 존 재를 시뮬레이션하는 것을 더 포함한다(블록 62). 본 명세서에서 보다 상세하게 설명되는 바와 같이, 특정 실시 예에서, 하나 이상의 라이드 차량 AI 엔티티의 각 라이드 차량 AI 엔티티는 라이드 차량에 특하된 다. 그러나, 다른 실시예에서, 하나 이상의 라이드 차량 AI 엔티티의 각 라이드 차량 AI 엔티티는 하나 이상의 방문객 중 방문객 또는 방문객의 그룹에 특화된다. 본 명세서에서 보다 상세하게 설명되는 바와 같이, 특정 실시예에서, 하나 이상의 방문객의 활동을 인식하 는 데 사용되는 데이터를 수집하는 데 사용되는 하나 이상의 방문객 활동 인식 장치는 놀이 공원의 물리적 환경 내의 위치에서 하나 이상의 방문객 중 방문객의 존재를 검출하도록 구성된 하나 이상의 근접 센서 (18A)를 포함할 수 있다. 또한, 특정 실시예에서, 하나 이상의 방문객의 활동을 인식하는 데 사용되는 데이 터를 수집하는 데 사용되는 하나 이상의 방문객 활동 인식 장치는, 놀이 공원의 물리적 환경 내의 위치에서 하나 이상의 방문객 중 방문객의 존재를 검출하거나 하나 이상의 방문객 중 방문객의 신원을 확인하거나 이들의 일부 조합이도록 구성되는 하나 이상의 카메라(18B)를 포함할 수 있다. 또한, 특정 실시예에 서, 하나 이상의 방문객의 활동을 인식하는 데 사용되는 데이터를 수집하는 데 사용되는 하나 이상의 방문 객 활동 인식 장치는 놀이 공원의 물리적 환경 내의 위치에서 하나 이상의 방문객과 관련된 하나 이상 의 무선 주파수 식별 태그(18C)의 존재를 검출하도록 구성된 하나 이상의 전자 판독기(18D)를 포함할 수 있다.본 명세서에 더 상세히 설명된 바와 같이, 특정 실시예에서, 하나 이상의 무선 주파수 식별 태그(18C)는 하나 이상의 방문객이 착용하도록 구성된 웨어러블 장치에 통합될 수 있다. 또한, 특정 실시예에서, 하나 이상의 방문객의 활동을 인식하는 데 사용되는 데이터를 수집하는 데 사용되는 하나 이상의 방문객 활동 인식 장치 는 놀이 공원의 물리적 환경 내의 위치에서 하나 이상의 방문객 중 방문객의 존재를 검출하도록 구 성된 중량 센서(18E)를 포함할 수 있다. 또한, 특정 실시예에서, 하나 이상의 방문객의 활동을 인식하는 데 사용되는 데이터를 수집하는 데 사용되는 하나 이상의 방문객 활동 인식 장치는 하나 이상의 방문객 중 방 문객에 의해 생성된 소리를 검출하도록 구성된 하나 이상의 오디오 센서(18F)를 포함할 수 있다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템에 의해 활성화될 수 있는 라이드 차량 의 하나 이상의 특징부는 하나 이상의 라이드 차량 AI 엔티티 중 라이드 차량 AI 엔티티를 표 시하도록 구성되는 하나 이상의 디스플레이(12A)를 포함할 수 있다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템에 의해 활성화될 수 있는 라이드 차량의 하나 이상의 특징부는 하나 이상의 라이드 차량 AI 엔티티 중 라이드 차량 AI 엔티티와 관련된 빛을 생성하도록 구성되는 조명 효과 시스 템(12B)을 포함할 수 있다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템에 의해 활성 화될 수 있는 라이드 차량의 하나 이상의 특징부는 하나 이상의 라이드 차량 AI 엔티티 중 라이드 차량 AI 엔티티의 존재를 시뮬레이션하도록 구성되는 하나 이상의 애니메이션 피규어(12C)를 포함할 수 있 다. 또한, 특정 실시예에서, 라이드 차량의 AI 엔티티 관리 시스템에 의해 활성화될 수 있는 라이드 차 량의 하나 이상의 특징부는 하나 이상의 라이드 차량 AI 엔티티의 라이드 차량 AI 엔티티와 관 련된 소리를 생성하도록 구성되는 음향 효과 시스템(12D)을 포함할 수 있다. 도 4에 도시된 바와 같이, 특정 실시예에서, 하나 이상의 라이드 차량 AI 엔티티의 하나 이상의 속성은, 하 나 이상의 라이드 차량 AI 엔티티의 신원, 하나 이상의 라이드 차량 AI 엔티티에 대한 하나 이상의 세부사항, 하나 이상의 라이드 차량 AI 엔티티의 하나 이상의 성격 특성, 하나 이상의 라이드 차량 AI 엔티티의 분위기, 하나 이상의 라이드 차량 AI 엔티티의 하나 이상의 선호도 또는 이들의 일부 조합을 포함할 수 있다. 예를 들어, 특정 라이드 차량 AI 엔티티의 신원은 예를 들어, 놀이 공원 의 특정 테마 구역에 대해 비교적 잘 알려진 특정 테마 캐릭터일 수 있다. 특정 실시예에서, 방문객은 놀이 공원(또는 놀이 공원의 특정 테마 구역) 방문 내내 자신을 따라다니기를 원하는 특정 캐릭터를 라이드 차량 AI 엔티티로 선택하거나, 특정 캐릭터가 예를 들어, 방문객의 추적된 활동(예를 들어, 특정 캐릭 터에 대한 특정 친화성을 나타내는 방문객, 특정 캐릭터에 대한 두려움을 나타내는 방문객 등)에 기초 하여 라이드 차량의 AI 엔티티 관리 시스템에 의해 특정 방문객에 대한 라이드 차량 AI 엔티티(3 6)이도록 자동으로 선택될 수 있다. 특정 테마 캐릭터는 테마 캐릭터에 특화된 세부 사항(예를 들어, 배경스토 리 세부 사항, 출신지, 진영 동맹, 친구, 적, 목표, 동기 등)을 가질 수 있음이 이해될 것이다. 또한, 특정 라 이드 차량 AI 엔티티는, 그것이 비교적 잘 알려진 특정 테마 캐릭터인지 또는 완전히 맞춤화된 캐릭터인지 에 관계없이, 행복, 슬픔, 유머, 붙임성, 용감, 겁쟁이, 수동성, 공격성, 호전성, 복종성, 비열함, 친절, 풍자, 존경심 등과 같은 특정 성격 특성을 가질 수 있다. 또한, 특정 라이드 차량 AI 엔티티는 성격 특성(6 8)과 실질적으로 유사하지만, 보다 영구적인 성격 특성과는 대조적으로 사실상 보다 일시적인 특정 분위기 를 가질 수 있다. 또한, 특정 라이드 차량 AI 엔티티는 특정 선호도, 예컨대, 참여하기를 좋아하는 활동, 선호하는 놀이 공원의 영역, 좋아하는 (또는 싫어하는) 다른 테마 캐릭터 등과 같은 특정 선호도(7 2)를 가질 수 있다. 본 명세서에서 보다 상세하게 설명되는 바와 같이, 특정 실시예에서, 라이드 차량 AI 엔티티 중 적어도 일 부는 라이드 차량에 특정될 수 있다. 예를 들어, 그러한 실시예에서, 라이드 차량 AI 엔티티는 각각의 라이드 차량에서 영구적으로 유지되거나(예를 들어, 각각의 AI 엔티티 관리 시스템의 메모리에 영 구적으로 저장됨) 또는 적어도 반영구적으로 유지되는(예를 들어, 일정 시구간 동안 각각의 AI 엔티티 관리 시 스템의 메모리에 저장됨) 지속성(또는 적어도 반지속성)을 가질 수 있다. 이러한 라이드 차량별 AI 엔 티티는 방문객의 평판을 전개하기 시작하여 방문객이 특정 라이드 차량에 탑승하기를 원하여 해당 특정 AI 엔티티와 상호 작용하게 할 수 있다. 그러나, 다른 실시예에서, 라이드 차량 AI 엔티티 중 적어도 일부는 방문객 또는 방문객의 그룹 에 특정될 수 있다. 예를 들어, 그러한 실시예들에서, 라이드 차량 AI 엔티티는 다양한 라이드 차량 을 탈 때 각각의 방문객 또는 방문객의 그룹(예컨대, 유령)을 따라다니는 것처럼 보일 수 있다. 그러나, 또한, 특정 실시예에서, 라이드 차량 AI 엔티티 중 적어도 일부는 특정 라이드 차량에 대해서만 방문객 또는 방문객의 그룹에 특정될 수 있다. 예를 들어, 그러한 실시예에서, 방문객 또는 방문객의 그룹은 특정 라이드 차량을 타는 동안 상호 작용하고자 하는 특정 라이드 차량 AI 엔티티를 선택할 수 있다. 도 5는 방문객이 놀이 공원 주위를 이동할 때 본 명세서에 설명된 라이드 차량 AI 엔티티가 어떻게 나 타날 수 있는지에 대한 비제한적인 예를 도시한다. 예를 들어, 도 5는 라이드 차량 AI 엔티티와 관련된 캐 릭터가 제시될 수 있는 라이드 차량의 디스플레이(12A) 및 캐릭터의 말을 시뮬레이션하기 위해 소 리가 생성될 수 있는 라이드 차량의 관련 음향 효과 시스템(12D)을 도시한다. 도 6은 도 5의 라이드 차량 의 디스플레이(12A) 및 음향 효과 시스템(12D)을 보다 상세하게 도시한다. 본 명세서에서 보다 상세하게 설 명되는 바와 같이, 특정 라이드 차량 AI 엔티티는 특정 라이드 차량 AI 엔티티의 속성에 기초하여 (예 를 들어, 라이드 차량의 하나 이상의 근접 센서(18A) 및/또는 하나 이상의 카메라(18B)에 의해 검출된 바와 같이) 특정 라이드 차량 AI 엔티티와 연관된 방문객이 예를 들어, 라이드 차량을 타고 있을 때 디 스플레이(12A)를 통해 제시되는 캐릭터의 하나 이상의 양상(음향 효과 시스템(12D)에 의해 생성된 관련 소 리 포함)을 제어함으로써 자신을 나타낼 수 있다(예를 들어, 도 4 참조). 라이드 차량 AI 엔티티가 제어할 수 있는 하나 이상의 양상은 캐릭터의 애니메이션, 캐릭터의 대화, 캐릭터와 관련된 특수 시각 및/ 또는 오디오 효과 등을 포함할 수 있지만 이에 한정되지 않는다. 예를 들어, 특정 방문객에 대한 방문객 데 이터가 특정 방문객이 특정 캐릭터에 대한 두려움을 가지고 있음(또는 반대로 친근감을 가지고 있음)을 나타내는 경우, 캐릭터는 AI 엔티티 관리 시스템에 의해 상대적으로 위협적인 방식으로(또는 반대로 친 절한 방식으로) 특정 방문객의 일반적인 방향으로 말하게 될 수 있다. 본 명세서에서는 본 개시의 소정의 특징들만이 예시되고 설명되었지만, 당업자에게는 많은 수정 및 변경이 발생 할 것이다. 따라서, 첨부된 청구범위는 본 개시의 진정한 사상에 속하는 그러한 모든 수정 및 변경을 포함하도 록 의도된 것으로 이해되어야 한다. 본 명세서에 제시되고 청구된 기법은 현재 기술 분야를 명백히 개선하는 실질적인 성격의 물질적 객체 및 구체 적인 예에 참조 및 적용되며, 따라서 추상적이거나 무형적이거나 순전히 이론적인 것이 아니다. 또한, 만약 본 명세서 말미에 첨부된 임의의 청구항에 \"[기능]을 [수행]하기 위한 수단...\" 또는 \"[기능]을 [수행]하기 위한 단계...\"로 지정된 하나 이상의 구성요소가 포함되어 있는 경우, 이는 그러한 구성요소가 35 U.S.C. 112(f)에 의거하여 해석되도록 의도된 것이다. 그러나, 임의의 다른 방식으로 지정된 구성요소를 포함하는 임의의 청구항 의 경우, 해당 구성요소는 35 U.S.C. 112(f)에 의거하여 해석되지 않도록 의도된다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2024-7040908", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 이들 및 다른 특징, 양상 및 장점은 도면 전체에서 동일한 문자가 동일한 부분을 나타내는 첨부 도면 을 참조하여 다음의 상세한 설명을 읽으면 더 잘 이해될 것이다. 도 1은 본 개시의 실시예에 따른, 라이드 차량 인공 지능(AI) 엔티티를 가진 놀이 공원의 개략적 표현이다. 도 2는 본 개시의 실시예에 따라, 도 1의 놀이 공원의 특징부를 활성화하여 라이드 차량 AI 엔티티의 존재를 시 뮬레이션하는 라이드 차량 AI 엔티티 시스템을 도시한다. 도 3은 본 개시의 실시예에 따른 도 2의 라이드 차량 AI 엔티티 시스템을 작동시키는 방법의 흐름도이다. 도 4는 본 개시의 실시예에 따라, 도 2의 라이드 차량 AI 엔티티 시스템에 의해 관리될 수 있는 라이드 차량 AI 엔티티의 다양한 속성을 도시한다. 도 5는 본 개시의 실시예에 따라, 라이드 차량 AI 엔티티가 표시될 수 있는 디스플레이를 도시한다. 도 6은 본 개시의 실시예에 따라, 도 5의 라이드 차량의 디스플레이 및 음향 효과 시스템을 보다 상세하게 도시 한다."}
