{"patent_id": "10-2019-0160038", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0070466", "출원번호": "10-2019-0160038", "발명의 명칭": "표시부를 포함한 전자 장치", "출원인": "삼성디스플레이 주식회사", "발명자": "김휘"}}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "영상을 표시하는 표시 패널을 포함하고, 상기 표시 패널은, 서로 인접한 제1 표시 영역 및 제2 표시 영역과, 상기 제1 및 제2 표시 영역들 각각의 적어도 일측을 둘러싸는비표시 영역을 포함한 기판; 상기 제1 표시 영역에 제공된 복수의 제1 화소들; 및상기 제2 표시 영역에 제공된 복수의 제2 화소들을 포함하고, 상기 제2 표시 영역은 각각의 상기 제2 화소가 배치되는 제1 서브 영역 및 각각의 상기 제2 화소가 배치되지 않는 제2 서브 영역을 포함하고, 상기 제2 표시 영역의 광 투과율을 상기 제1 표시 영역의 광 투과율보다 높고, 각각의 상기 제1 화소의 크기와 각각의 상기 제2 화소의 크기는 서로 상이한, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 제1 표시 영역에서 상기 제1 화소들의 밀도는 상기 제2 표시 영역에서 상기 제2 화소들의 밀도보다 높고, 상기 제2 표시 영역은 상기 제1 표시 영역보다 크기가 작으며 상기 제1 표시 영역에 연결되는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서, 상기 제2 화소들은 평면 상에서 사선 방향으로 배열되는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2 항에 있어서, 상기 표시 패널의 배면에 배치된 적어도 하나의 센서를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서, 상기 센서는 카메라, 근접 센서, 조도 센서, 제스쳐 센서, 모션 센서, 지문 인식 센서, 또는 생체 센서 중, 적어도 하나 또는 이들의 조합을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서, 상기 제2 서브 영역은 광이 투과되는 투과 영역을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6 항에 있어서, 상기 제1 서브 영역과 상기 제2 서브 영역은 교번하여 배치되는, 전자 장치. 공개특허 10-2021-0070466-3-청구항 8 제7 항에 있어서, 상기 제1 서브 영역은 상기 제2 표시 영역 내에서 복수 개로 제공되고, 상기 제2 서브 영역은 상기 제2 표시 영역 내에서 복수 개로 제공되는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서, 상기 복수 개의 제1 서브 영역들은 상기 제2 표시 영역 내에서 일 방향을 따라 반복적으로 배열되어 적어도 하나의 제1 열을 구성하고, 상기 복수 개의 제2 서브 영역들은 상기 제2 표시 영역 내에서 상기 일 방향을 따라 반복적으로 배열되어 적어도 하나의 제2 열을 구성하며, 상기 제1 열과 상기 제2 열은 교번하여 배치되는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제8 항에 있어서, 상기 복수 개의 제1 서브 영역들은 상기 제2 표시 영역 내에서 일 방향을 따라 반복적으로 배열되어 적어도 하나의 열을 구성하고, 상기 복수 개의 제2 서브 영역들은 상기 일 방향과 직교하는 방향을 따라 반복적으로 배열되어 적어도 하나의행을 구성하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6 항에 있어서, 각각의 상기 제1 화소는 상기 제1 표시 영역에 제공된 적어도 1개의 제1 서브 화소를 포함하고, 상기 제1 서브 화소는, 상기 기판 상에 제공된 제1 전극;상기 제1 전극 상에 제공된 제1 발광층; 및상기 제1 발광층 상에 제공된 제2 전극을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,각각의 상기 제2 화소는 상기 제1 서브 영역에 제공된 적어도 1개의 제2 서브 화소를 포함하고, 상기 제2 서브 화소는,상기 기판 상에 제공되며 상기 제1 전극과 동일한 층에 제공된 제3 전극;상기 제3 전극 상에 제공된 제2 발광층; 및상기 제2 발광층 상에 제공된 제4 전극을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서, 상기 제1 서브 화소와 상기 제2 서브 화소는 서로 상이한 크기를 갖는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서, 공개특허 10-2021-0070466-4-상기 제2 서브 화소는 상기 제1 서브 화소보다 크기가 큰, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14 항에 있어서, 상기 제1 서브 화소는 상기 제1 전극, 상기 제1 발광층, 및 상기 제2 전극이 중첩된 제1 발광 영역을 포함하고, 상기 제2 서브 화소는 상기 제3 전극, 상기 제2 발광층, 및 상기 제4 전극이 중첩된 제2 발광 영역을 포함하며, 상기 제2 발광 영역은 상기 제1 발광 영역보다 크기가 큰, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12 항에 있어서, 상기 기판과 상기 제3 전극 사이에 제공된 절연층을 더 포함하며, 상기 절연층은 상기 제2 서브 영역으로 연장되며, 상기 제4 전극은 상기 제2 서브 영역으로 연장되지 않는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16 항에 있어서, 상기 제1 및 제2 서브 화소들 각각은 적색 광, 녹색 광, 청색 광, 및 백색 광 중 어느 하나를 출사하는, 전자장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제13 항에 있어서, 상기 제2 서브 화소는 상기 제1 표시 영역과 상기 제2 표시 영역 사이의 경계부와 상기 제2 표시 영역 사이에서상기 경계부를 향할수록 크기가 점진적으로 변화하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서, 상기 제2 서브 화소는 상기 경계부로부터 상기 제2 표시 영역 사이에서 상기 경계부를 향할수록 크기가 점진적으로 작아지는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18 항에 있어서, 상기 제2 서브 화소는 상기 경계부로부터 상기 제2 표시 영역 사이에서 상기 경계부를 향할수록 크기가 점진적으로 커지는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제6 항에 있어서, 상기 제2 서브 영역은 상기 기판 상에 제공되며 개구부를 포함하는 적어도 하나의 절연층을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21 항에 있어서, 상기 제2 서브 영역은 상기 개구부를 채우는 충진재를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제1 항에 있어서,공개특허 10-2021-0070466-5-상기 제1 및 제2 화소들 각각은 상기 기판 상에 제공되며 적어도 하나의 트랜지스터를 구비한 화소 회로부를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제1 항에 있어서, 상기 제1 표시 영역은 각각의 상기 제1 화소가 배치되는 제1 단위 화소 영역을 포함하고, 상기 제2 표시 영역은각각의 상기 제2 화소가 배치되는 제2 단위 화소 영역을 포함하며, 상기 제1 단위 화소 영역과 상기 제2 단위 화소 영역은 동일한 크기를 갖는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "입사되는 광을 센싱하는 적어도 하나의 센서;상기 센서와 중첩하며 영상을 표시하는 표시부; 상기 표시부 상에 제공되어 상기 표시부를 커버하는 윈도우; 및상기 표시부와 상기 윈도우 사이에 제공되며 사용자에 의한 터치를 센싱하는 터치 센서를 포함하고, 상기 표시부는, 제1 표시 영역, 상기 제1 표시 영역보다 작은 면적을 가지고 상기 제1 표시 영역에 연결되며 상기 제1 표시 영역보다 광 투과율이 높은 제2 표시 영역, 및 상기 제1 및 제2 표시 영역들 각각의 주변을 둘러싸는 비표시 영역을 포함한 기판;상기 제1 표시 영역에 제공된 복수의 제1 화소들; 및상기 제2 표시 영역에 제공되고, 상기 제1 화소들과 다르며 상기 제1 화소들 각각의 크기보다 큰 복수의 제2 화소들을 포함하고, 상기 제2 표시 영역은 각각의 상기 제2 화소가 배치되는 제1 서브 영역과 각각의 상기 제2 화소가 배치되지 않으며 광이 투과되는 투과 영역을 포함한 제2 서브 영역을 포함하며, 상기 제1 서브 영역과 상기 제2 서브 영역은 평면 상에서 볼 때 교번하여 배치되는, 전자 장치."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치는 영상을 표시하는 표시 패널을 포함할 수 있다. 여기서, 상기 표시 패널은, 서로 인접한 제1 표시 영 역 및 제2 표시 영역과, 상기 제1 및 제2 표시 영역들 각각의 적어도 일측을 둘러싸는 비표시 영역을 포함한 기 판; 상기 제1 표시 영역에 제공된 복수의 제1 화소들; 및 상기 제2 표시 영역에 제공된 복수의 제2 화소들을 포 함할 수 있다. 상기 제2 표시 영역은 각각의 상기 제2 화소가 배치되는 제1 서브 영역 및 각각의 상기 제2 화소 가 배치되지 않은 제2 서브 영역을 포함할 수 있다. 또한, 상기 제2 표시 영역의 광 투과율은 상기 제1 표시 영 역의 광 투과율보다 높을 수 있으며, 각각의 상기 제1 화소의 크기와 각각의 상기 제2 화소의 크기는 서로 상이 할 수 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 표시부를 포함한 전자 장치에 관한 것이다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적인 스마트폰과 같은 전자 장치는 적어도 하나 이상의 표시부를 포함할 수 있다. 표시부는 데이터 출력 장 치로서, 입력된 데이터가 표시될 수 있다. 또한, 표시부는 터치 센서가 구비되어, 터치 스크린으로 동작될 수 있다. 이러한 표시부는 전자 장치 전면에 채용되어, 각종 정보를 표시할 수 있다. 최근 들어, 이동 단말기 등과 같은 전자 장치에서 표시부가 전면의 대부분을 차지하면서 카메라, 근접 센서, 지 문 인식 센서, 조도 센서, 근적외선 센서 등이 표시부의 적어도 일 영역에 중첩될 수 있다. 표시부에 중첩되는 센서 영역은 광 투과율을 향상시키기 위해 화소의 밀도를 감소시킬 수 있다. 이때, 센서 영역과 표시 영역 사이 에서 화소의 밀도 변화는 상기 센서 영역과 상기 표시 영역에서의 휘도 차이를 발생할 수 있으며, 이러한 휘도 차이는 사용자에게 영상의 불연속으로써 시인될 수 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은, 영상의 품질을 향상시킬 수 있는 표시부를 포함한 전자 장치를 제공하는 데 목적이 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 전자 장치는, 영상을 표시하는 표시 패널을 포함할 수 있다. 상기 표시 패널은, 서 로 인접한 제1 표시 영역 및 제2 표시 영역과, 상기 제1 및 제2 표시 영역들 각각의 적어도 일측을 둘러싸는 비 표시 영역을 포함한 기판; 상기 제1 표시 영역에 제공된 복수의 제1 화소들; 및 상기 제2 표시 영역에 제공된 복수의 제2 화소들을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 표시 영역은 각각의 상기 제2 화소가 배치되는 제1 서브 영역 및 각각 의 상기 제2 화소가 배치되지 않는 제2 서브 영역을 포함할 수 있다. 상기 제2 표시 영역의 광 투과율은 상기 제1 표시 영역의 광 투과율보다 높을 수 있다. 본 발명의 일 실시예에 있어서, 각각의 상기 제1 화소의 크기와 각각의 상기 제2 화소의 크기는 서로 상이할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 표시 영역에서 상기 제1 화소들의 밀도는 상기 제2 표시 영역에서 상 기 제2 화소들의 밀도보다 높을 수 있다. 상기 제2 표시 영역은 상기 제1 표시 영역보다 크기가 작으며 상기 제 1 표시 영역에 연결될 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 화소들은 평면 상에서 사선 방향으로 배열될 수 있다. 본 발명의 일 실시예에 있어서, 상기 전자 장치는 상기 표시 패널의 배면에 배치된 적어도 하나의 센서를 포함 할 수 있다. 본 발명의 일 실시예에 있어서, 상기 센서는 카메라, 근접 센서, 조도 센서, 제스쳐 센서, 모션 센서, 지문 인 식 센서, 또는 생체 센서 중, 적어도 하나 또는 이들의 조합을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 서브 영역은 광이 투과되는 투과 영역을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 서브 영역과 상기 제2 서브 영역은 교번하여 배치될 수 있다. 여기서, 상기 제1 서브 영역은 상기 제2 표시 영역 내에서 복수 개로 제공되고, 상기 제2 서브 영역은 상기 제2 표시 영 역 내에서 복수 개로 제공될 수 있다. 본 발명의 일 실시예에 있어서, 상기 복수 개의 제1 서브 영역들은 상기 제2 표시 영역 내에서 일 방향을 따라 반복적으로 배열되어 적어도 하나의 제1 열을 구성하고, 상기 복수 개의 제2 서브 영역들은 상기 제2 표시 영역 내에서 상기 일 방향을 따라 반복적으로 배열되어 적어도 하나의 제2 열을 구성할 수 있다. 여기서, 상기 제1 열과 상기 제2 열은 교번하여 배치될 수 있다. 본 발명의 일 실시예에 있어서, 상기 복수 개의 제1 서브 영역들은 상기 제2 표시 영역 내에서 일 방향을 따라 반복적으로 배열되어 적어도 하나의 열을 구성하고, 상기 복수 개의 제2 서브 영역들은 상기 일 방향과 직교하 는 방향을 따라 반복적으로 배열되어 적어도 하나의 행을 구성할 수 있다. 본 발명의 일 실시예에 있어서, 각각의 상기 제1 화소는 상기 제1 표시 영역에 제공된 적어도 1개의 제1 서브 화소를 포함할 수 있다. 여기서, 상기 제1 서브 화소는, 상기 기판 상에 제공된 제1 전극; 상기 제1 전극 상에 제공된 제1 발광층; 및 상기 제1 발광층 상에 제공된 제2 전극을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 각각의 상기 제2 화소는 상기 제1 서브 영역에 제공된 적어도 1개의 제2 서브 화소를 포함할 수 있다. 여기서, 상기 제2 서브 화소는, 상기 기판 상에 제공되며 상기 제1 전극과 동일한 층에 제공된 제3 전극; 상기 제3 전극 상에 제공된 제2 발광층; 및 상기 제2 발광층 상에 제공된 제4 전극을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 서브 화소와 상기 제2 서브 화소는 서로 상이한 크기를 가질 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 서브 화소는 상기 제1 서브 화소보다 크기가 클 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 서브 화소는 상기 제1 전극, 상기 제1 발광층, 및 상기 제2 전극이 중 첩된 제1 발광 영역을 포함하고, 상기 제2 서브 화소는 상기 제3 전극, 상기 제2 발광층, 및 상기 제4 전극이 중첩된 제2 발광 영역을 포함할 수 있다. 여기서, 상기 제2 발광 영역은 상기 제1 발광 영역보다 크기가 클 수 있다. 본 발명의 일 실시예에 있어서, 상기 전자 장치는 상기 기판과 상기 제3 전극 사이에 제공된 절연층을 더 포함 할 수 있다. 상기 절연층은 상기 제2 서브 영역으로 연장될 수 있다. 여기서, 상기 제4 전극은 상기 제2 서브 영역으로 연장되지 않을 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 및 제2 서브 화소들 각각은 적색 광, 녹색 광, 청색 광, 및 백색 광 중 어느 하나를 출사할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 서브 화소는 상기 제1 표시 영역과 상기 제2 표시 영역 사이의 경계부 와 상기 제2 표시 영역 사이에서 상기 경계부를 향할수록 크기가 점진적으로 변화할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 서브 화소는 상기 경계부로부터 상기 제2 표시 영역 사이에서 상기 경 계부를 향할수록 크기가 점진적으로 작아질 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 서브 화소는 상기 경계부로부터 상기 제2 표시 영역 사이에서 상기 경 계부를 향할수록 크기가 점진적으로 커질 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 서브 영역은 상기 기판 상에 제공되며 개구부를 포함하는 적어도 하나 의 절연층을 포함할 수 있다. 여기서, 상기 제2 서브 영역은 상기 개구부를 채우는 충진재를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 및 제2 화소들 각각은 상기 기판 상에 제공되며 적어도 하나의 트랜지 스터를 구비한 화소 회로부를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 표시 영역은 각각의 상기 제1 화소가 배치되는 제1 단위 화소 영역을 포함하고, 상기 제2 표시 영역은 각각의 상기 제2 화소가 배치되는 제2 단위 화소 영역을 포함할 수 있다. 여기 서, 상기 제1 단위 화소 영역과 상기 제2 단위 화소 영역은 동일한 크기를 가질 수 있다. 본 발명의 다른 실시예에 따른 전자 장치는, 입사되는 광을 센싱하는 적어도 하나의 센서; 상기 센서와 중첩하 며 영상을 표시하는 표시부; 상기 표시부 상에 제공되어 상기 표시부를 커버하는 윈도우; 및 상기 표시부와 상 기 윈도우 사이에 제공되며 사용자에 의한 터치를 센싱하는 터치 센서를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 표시부는 제1 표시 영역, 상기 제1 표시 영역보다 작은 면적을 가지고 상 기 제1 표시 영역에 연결되며 상기 제1 표시 영역보다 광 투과율이 높은 제2 표시 영역, 및 상기 제1 및 제2 표 시 영역들 각각의 주변을 둘러싸는 비표시 영역을 포함한 기판; 상기 제1 표시 영역에 제공된 복수의 제1 화소 들; 및 상기 제2 표시 영역에 제공되고, 상기 제1 화소들과 다르며 상기 제1 화소들 각각의 크기보다 큰 복수의 제2 화소들을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제2 표시 영역은 각각의 상기 제2 화소가 배치되는 제1 서브 영역과 각각 의 상기 제2 화소가 배치되지 않으며 광이 투과되는 투과 영역을 포함한 제2 서브 영역을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 상기 제1 서브 영역과 상기 제2 서브 영역은 평면 상에서 볼 때 교번하여 배치 될 수 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 제1 표시 영역과 제2 표시 영역 사이의 경계에서 영상 불연속을 최소화하고, 영 상에 대한 사용자의 시인성을 향상시킬 수 있는 표시부를 포함한 전자 장치가 제공될 수 있다. 본 발명의 실시예들에 따른 효과는 이상에서 기재된 내용에 의해 제한되지 않으며, 더욱 다양한 효과들이 본 명 세서 내에 포함되어 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 형태를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 본문에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 개시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 각 도면을 설명하면서 유사한 참조 부호를 유사한 구성요소에 대해 사용하였다. 첨부된 도면에 있어서, 구조물 들의 치수는 본 발명의 명확성을 위하여 실제보다 확대하여 도시한 것이다. 제1, 제2 등의 용어는 다양한 구성 요소들을 설명하는데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용 어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범 위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요 소로 명명될 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 발명에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 또한, 층, 막, 영역, 판 등의 부분이 다른 부분 \"상에\" 있다고 할 경우, 이는 다른 부분 \"바로 위 에\" 있는 경우뿐만 아니라 그 중간에 또 다른 부분이 있는 경우도 포함한다. 또한, 본 명세서에 있어서, 어느 층, 막, 영역, 판 등의 부분이 다른 부분 상(on)에 형성되었다고 할 경우, 상기 형성된 방향은 상부 방향만 한 정되지 않으며 측면이나 하부 방향으로 형성된 것을 포함한다. 반대로 층, 막, 영역, 판 등의 부분이 다른 부분 \"아래에\" 있다고 할 경우, 이는 다른 부분 \"바로 아래에\" 있는 경우뿐만 아니라 그 중간에 또 다른 부분이 있는 경우도 포함한다. 본 발명의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, 워크스테이션, 서버, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장치 중 적어도 하나를 포함할 수 있다. 웨어러블 장 치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치 (headmounted-device(HMD)), 직물 또는 의류 일체형(일 예로, 전자 의복), 신체 부착형(일 예로, 스킨 패드 또 는 문신), 또는 생체 이식형 회로 중 적어도 하나를 포함할 수 있다. 어떤 실시 예들에서, 전자 장치는, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁 기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스, 게임 콘솔, 전자 사 전, 전자 키, 캠코더, 전자 액자, 또는 홀로그램 영상 표시 장치(일 예로, 게이트 박스) 중 적어도 하나를 포함할 수 있다. 다른 실시 예에서, 전자 장치는, 각종 의료기기(일 예로, 혈당 측정기, 심박 측정기, 혈압측정기, 또는 체온 측 정기 등과 같은 각종 휴대용 의료 측정 기기), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트 장치, 선박용 전자 장비(일 예로, 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기 (avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (일 예로, 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시 예에 따르면, 전자 장치는 가구, 건물/구조물 또는 자동차의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터, 또는 각종 계측 기기(일 예 로, 수도, 전기, 가스, 또는 전파 계측 기기등) 중 적어도 하나를 포함할 수 있다. 다양한 실시 예에서, 전자 장치는 플렉서블하거나, 또는 전술한 다양한 장치들 중 둘 이상의 조합일 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 발명에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또 는 전자 장치를 사용하는 장치(일 예로, 인공지능 전자 장치)를 지칭할 수 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하, 첨부한 도면들을 참조하여 본 발명의 바람직한 실시예 및 그 밖에 당업자가 본 발명의 내용을 쉽게 이해 하기 위하여 필요한 사항에 대하여 상세히 설명하기로 한다. 아래의 설명에서, 단수의 표현은 문맥상 명백하게 단수만을 포함하지 않는 한, 복수의 표현도 포함한다. 도 1은 다양한 실시예에서의 네트워크 환경 내의 전자 장치를 도시한 블록도이다. 도 1을 참조하면, 다양한 실시예에서의, 네트워크 환경 내의 전자 장치가 기재될 수 있다. 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이스를 포함할 수 있다. 실시예에 따라, 전자 장치는, 구성 요소들 중 적어도 하나를 생략하거 나 다른 구성 요소를 추가적으로 구비할 수 있다. 버스는 구성 요소들(110 ~ 170)을 서로 연결하고, 상기 구성 요소들(110 ~ 170) 간의 통신(일 예로, 제어 메시지 또는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치, 어플리케이션 프로세서, 또는 커뮤니케이션 프로세서(communication processor (CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성 요소들의 제어 및/또는 통신에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성에 관계된 명령 또는 데이터를 저장할 수 있다. 일 실시예에 따르면, 메모리(13 0)는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API), 및/ 또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 어플리케이션 프로그래밍 인터페이스의 적어도 일부는, 운영 시스템으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(일 예로, 미들 웨어, 어플리케이션 프로그래밍 인터페이스 , 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들 (일 예로, 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, 어플리케이션 프로그래밍 인터페이스, 또는 어플리케이션 프로그램에서 전자 장치 의 개별 구성 요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들 웨어는, 예를 들면, 어플리케이션 프로그래밍 인터페이스 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들 웨어는 어플 리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따라 처리할 수 있다. 예를 들 면, 미들 웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치의 시스템 리소스(일 예로, 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 부여하고, 상기 하나 이상의작업 요청들을 처리할 수 있다. 어플리케이션 프로그래밍 인터페이스는 어플리케이션 프로그램이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등 을 위한 적어도 하나의 인터페이스 또는 함수(일 예로, 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성 요소(들)에 전달하거나, 또는 전자 장치의 다른 구성 요소(들)로부터 수신된 명령 또 는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이(160, 또는 표시부)는, 예를 들면, 액정 디스플레이(LCL), 발광 다이오드(LED) 디스플레이, 유기 발 광 다이오드(OLED) 디스플레이, 또는 마이크로 전자 기계 시스템(MEMS) 디스플레이, 또는 전자 종이(electric paper) 디스플레이, 홀로그램 디스플레이 등을 포함할 수 있다. 디스플레이(160, 또는 표시부)는 예를 들면, 사 용자에게 각종 콘테츠(일 예로, 텍스트, 2D/3D 이미지, 비디오, 아이콘, 및/또는 심볼 등)을 표시할 수 있다. 디스플레이(160, 또는 표시부)는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(일 예로, 제1 외부 전자 장치, 제2 외부 전자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(일 예로, 제2 외부 전자 장치 또는 서버)와 통신 할 수 있다. 무선 통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신을 포함할 수 있다. 실시예에 따라, 무선 통신은 근거리 통신을 포함할 수 있다. 예를 들어, 근거리 통신은 WiFi(wireless fidelity), 블루투스, 블루투스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크 (BAN) 중 적어도 하나를 포함할 수 있다. 다른 실시 예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System(이하 “Beidou”) 또는 Galileo, the European global satellite-based navigation system일 수 있다. 이하, 본 발명에서는, “GPS”는 “GNSS”와 상호 호환적으로 사용될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS- 232(recommended standard232), 전력선 통신, 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 텔레커뮤니케이션 네트워크, 예를 들면, 컴퓨터 네트워크(예: LAN 또는 WAN), 인터넷, 또는 텔레폰 네트워크 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치들(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 다양한 실시 예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전 자 장치(일 예로, 제1 및 제2 외부 전자 장치들(102,104), 또는 서버)에서 실행될 수 있다. 실시 예에 따 라, 전자 장치가 어떤 기능이나 서비스를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치 는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(일 예로, 제1 및 제2 외부 전자 장치들(102, 104), 또는 서버)에 요청할 수 있다. 다른 전자 장 치(일 예로, 제1 및 제2 외부 전자 장치들(102, 104), 또는 서버)는 요청된 기능 또는 추가 기능을 실행하 고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또는 추가적으로 처 리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또 는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다. 도 2를 참조하면, 전자 장치는 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(일 예로, AP), 통신 모듈, 가입자 식별 모듈, 메모리, 센서 모듈, 입력 장치, 디스플레이(260, 표시부), 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드웨 어 또는 소프트 웨어 구성 요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 이러한 프로 세서는, 예를 들면, SoC(system on chip) 로 구현될 수 있다. 실시예에 따라, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서를 더 포함할 수 있다. 프로세서는 도 2에 도시된 구성 요소들 중 적어도 일부(일 예로, 셀룰러 모듈)를 포함할 수도 있다. 프로세서는 다른 구 성 요소들(일 예로, 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발성 메모리에 로드 하여 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 통신 모듈(일 예로, 통신 인터페이스)와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈, NFC 모듈 및 RF 모 듈을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 실시예에 따라, 셀룰러 모듈은 가입자 식별 모듈(일 예로, SIM 카드)를 이용하여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 실시예에 따라, 셀룰러 모듈은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 다른 실시예에 따라, 셀룰러 모 듈은 커뮤니케이션 프로세서(CP)를 포함할 수 있다. 또 다른 실시예에 따라, 셀룰러 모듈, WiFi 모듈 , 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(일 예로, 두 개 이상)는 하나 의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(일 예로, RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트 랜시버, PAM(power amp module), 주파수 필터, LNA(low noise amplifier), 또는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모 듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예 를들면, 가입자 식별 모듈을 포함하는 카드 또는 임베디드 SIM을 포함할 수 있으며, 고유한 식별 정보(일 예로, ICCID(integrated circuit card identifier)) 또는 가입자 정보(일 예로, IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(일 예로, 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(일 예로, DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(일 예 로, OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이브, 또는 솔리드 스테이트 드라이브 (SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래 시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 외장 메모리는 다 양한 인터페이스를 통하여 전자 장치와 기능적으로 또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 자이로 센서(240B), 기 압 센서(240C), 마그네틱 센서(240D), 가속도 센서(240E), 그립 센서(240F), 근접 센서(240G), 컬러(color) 센 서(240H)(예: RGB(red, green, blue) 센서), 생체 센서(240I), 온/습도 센서(240J), 조도 센서(240K), 또는 UV(ultra violet) 센서(240M) 중의 적어도 하나를 포함할 수 있다. 추가적으로 또는 대체적으로, 센서 모듈 은, 예를 들면, 후각(e-nose) 센서, 일렉트로마이오그라피(EMG) 센서, 일렉트로엔씨팔로그램(EEG) 센서, 일렉트로카디오그램(ECG) 센서, IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈 은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 실시예에 따라, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서 를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널, 펜 센서, 키, 또는 초음파 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용 할 수 있다. 또한, 터치 패널은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어 (tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크(일 예로, 마이크)를 통해, 입력 도구 에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(일 예로, 도 1의 디스플레이(160, 또는 표시부))는 표시 패널, 홀로그램 장치, 프로 젝터, 및/또는 이들을 제어하기 위한 제어 회로를 포함할 수 있다. 표시 패널은, 예를 들면, 유연하 게, 투명하게, 또는 착용할 수 있게 구현될 수 있다. 표시 패널은 터치 패널과 하나 이상의 모듈로 구성될 수 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 일 예로, 홀 로그램 장치는 가상의(홀로그램) 캐릭터를 표시하여 사용자와 소통하는 가상 홈 로봇인 게이트 박스를 포 함할 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 표시할 수 있다. 스크린은, 예를 들면, 전자 장 치의 내부 또는 외부에 위치할 수 있다. 인터페이스는, 예를 들면, HDMI, USB, 광 인터페 이스(optical interface), 또는 D-sub(Dsubminiature)를 포함할 수 있다. 인터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체적으로, 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈의 적어도 일부 구성 요소는, 예를 들면, 도 1에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또는 출력되는 소리 정 보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실 시 예에 따르면, 하나 이상의 이미지 센서(일 예로, 전면 센서 또는 후면 센서), 렌즈, 이미지 시그널 프로세서 (ISP), 또는 플래시(일 예로, LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시 예에 따르면, 전력 관리 모듈은 PMIC(power management integrated circuit), 충전 IC, 또는 배터리 또는 연료 게이지를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공 진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전 압, 전류, 또는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지 및/또는 태양 전지를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(일 예로, 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진동, 또는 햅틱 효과 등을 발생시킬 수 있다. 전자 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또 는 미디어플로(mediaFlo TM) 등의 규격에 따른 미디어 데이터를 처리할 수 있는 모바일 TV 지원 장치(일 예로, GPU)를 포함할 수 있다. 본 발명에서 기술된 구성 요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구 성 요소의 명칭은 적용되는 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시 예에서, 전자 장치는 일부 구성 요소가 생략되거나, 추가적인 구성 요소를 더 포함하거나, 또는, 구성 요소들 중 일부가 결합되어 하 나의 개체로 구성되되, 결합 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 실시예에 따라, 프로세서는 어플리케이션 동작을 통해 이미지를 생성할 수 있다. 어플리케이션 동작이 센 서(일 예로, 이미지 센서)와 관련되는 경우, 프로세서는 생성된 이미지에서 센서가 위치하는 제1 영역에 대응되는 이미지를 제거할 수 있다. 이후에, 프로세서는 제1 영역의 이미지가 제거된 전체 이미지를 디스 플레이 상에 표시할 수 있다. 다른 실시예에 따라, 어플리케이션 동작이 센서와 관련되지 않는 경우, 프로세서는 생성된 이미지에서 센 서가 위치하는 제1 영역의 이미지를 보정할 수 있다. 예를 들면, 프로세서는 제1 영역의 이미지가 시각적 으로 어색하지 않도록 제1 영역의 이미지를 원본 이미지(일 예로, 제2 영역의 이미지) 대비 밝은 명도 또는 채 도로 보상할 수 있다. 예를 들면, 제2 영역은 불투명 디스플레이 영역에서 제1 영역의 주변 영역일 수 있다. 또 다른 실시예에 따라, 프로세서는 제2 영역의 적어도 하나의 유기발광 소자의 광특성을 조절함으로써 제 1 영역의 이미지에 대한 색감을 보상할 수 있다. 또 다른 실시예에 따라, 프로세서는 제1 영역의 적어도하나의 유기발광 소자의 광 특성을 조절함으로써 제1 영역의 이미지에 대한 색감을 보상할 수 있다. 또 다른 실 시예에 따라, 프로세서는 제1 영역의 적어도 하나의 유기 발광 소자의 광 특성과 제2 영역의 적어도 하나 의 유기 발광 소자의 광특성을 조절함으로써 제1 영역의 이미지에 대한 색감을 보상할 수 있다. 이후에 프로세서는 제1 영역의 이미지가 보정된 전체 이미지를 디스플레이 상에 표시할 수 있다. 도 3a는 다양한 실시예에 따른 전자 장치의 전면을 간략히 나타내는 사시도이며, 도 3b는 도 3a의 전자 장치의 후면을 간략히 나타내는 사시도이다. 도 3a 및 도 3b에 있어서, 전자 장치는 도 1 및 도 2에 도시된 전자 장치(100, 200)와 동일한 전자 장치일 수 있으며, 일 예로, 표시 패널을 채용한 휴대 장치일 수 있다. 이에 더하여, 도 3a에 있어서는 편의를 위해 전 자 장치의 표시부에 메인 홈 화면이 표시된 예를 나타내었다. 도 1 내지 도 3b를 참조하면, 다양한 실시예에 따른 전자 장치의 전면(300a)에는 표시부가 배치될 수 있다. 전자 장치의 전면(300a)은 표시부가 배치되어 각종 데이터가 표시되는 표시 영역(DA)과 상기 표시 영역(DA)의 적어도 일측에 제공된 비표시 영역(NDA)을 포함할 수 있다. 다양한 실시예에 따른 전자 장치의 후면(300b)에는 후면 카메라, 플래시, 스피커 등이 위 치할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 측면(300c)에는 예를 들어 전원/리셋 버튼, 음량 버튼, 방송 수신을 위한 지상파 DMB 안테나, 하나 또는 복수의 마이크들(345, 347) 등이 위치할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 하단 측면에는 커넥터가 형성될 수 있다. 커넥터에는 다수의 전극들이 형성되어 있으며 외부 장치와 유선으로 연결될 수 있다. 전자 장치의 상단 측면에는 이어폰 연결 잭이 배치될 수 있다. 상술한 전자 장치는 표시부 내부 아래에, 예를 들어, 센서와 같은 부품을 배치함으로써, 그의 전면 (300a) 외관이 미려해지고, 보다 넓은 표시 영역(DA)을 확보할 수 있다. 상기 부품은 광과 관련된 광학 부품일 수 있다. 일 예로, 부품은 외부의 광이 입사되거나 또는 광을 방출하는 광학 부품일 수 있다. 광학 부품은, 일 예로, 지문 스캐너, 이미지 캡쳐 장치, 스트로브, 광 센서, 근접 센서, 인디케이터, 또는 솔라 패널 등을 포함 할 수 있다. 표시부는 전자 장치의 전면(300a)의 전체를 차지하도록 대화면으로 배치될 수 있다. 표시부가 전자 장치의 전면(300a)에 전체적으로 배치되는 경우, 상기 전자 장치는, 실질적으로 \"full front display\"라 지칭할 수 있다. 여기서, \"full front display\"는 전자 장치의 전면(300a)이 전부 표시 영역 (DA)일 수 있다. 상술한 표시부는 유기 발광 표시 패널(Organic Light Emitting Display panel)일 수 있다. 이러한 경우, 상술한 표시부가 채용된 전자 장치는 유기 발광 표시 장치일 수 있다. 실시예에 따라, 표시부는 터치 전극들을 포함하여 터치 스크린으로 구성될 수도 있다. 도 3a에 도시된 바와 같이, 표시부에는 메인 홈 화면이 표시될 수 있으며, 이러한 메인 홈 화면은 전자 장 치의 전원을 켰을 때, 표시부 상에 표시되는 첫 화면일 수 있다. 이때, 표시부의 상단에는 배터 리 충전 상태, 수신 신호의 세기, 현재 시각과 같은 전자 장치의 상태가 표시될 수 있다. 표시부는, 사용자에게 각종 콘텐츠(일 예로, 텍스트, 이미지, 비디오, 아이콘, 또는 심볼 등)를 표시할 수 있다. 도 4a 및 도 4b는 본 발명의 일 실시예에 따른 전자 장치를 간략히 나타내는 평면도들이며, 도 5는 도 4a의 Ⅰ ~ Ⅰ'선에 따른 단면도이다. 도 1 내지 도 5를 참조하면, 전자 장치는 전체 또는 적어도 일부가 가요성(flexibility)을 가질 수 있다. 일 예로, 전자 장치는 전체 영역에서 가요성을 가질 수 있으며, 또는 가요성 영역에 대응하는 영역에서 가 요성을 가질 수 있다. 전자 장치의 전체가 가요성을 갖는 경우 전자 장치는 롤러블 표시 장치일 수 있고, 전자 장치의 일부가 가요성을 갖는 경우 전자 장치는 폴더블 표시 장치일 수 있으나, 본 발명 이 이에 한정되는 것은 아니다. 전자 장치는 표시 패널, 터치 센서, 윈도우, 및 적어도 하나의 부품을 포함할 수 있 다. 표시 패널은 전자 장치의 전면(front surface)에 배치될 수 있다. 표시 패널은 전면(일 예로, 영상 표시 면)으로 임의의 시각 정보, 예를 들어, 텍스트, 비디오, 사진 2차원 또는 3차원 영상 등을 표시한다. 표시 패널의 종류는 영상을 표시하는 것으로서 특별히 한정되는 것은 아 니다. 표시 패널로는 유기 발광 표시 패널(Organic Light Emitting Display panel, OLED panel)과 같은 자발광이 가능한 표시 패널이 사용될 수 있다. 또한, 표시 패널로는 액정 표시 패널(Liquid Crystal Display panel, LCD panel), 전기 영동 표시 패널(Electro-Phoretic Display panel, EPD panel), 및 일렉트로 웨팅 표시 패널(Electro-Wetting Display panel, EWD panel)과 같은 비발광성 표시 패널이 사용될 수 있다. 비 발광성 표시 패널이 본 발명의 실시예에 따른 전자 장치의 표시 패널로 사용되는 경우, 상기 전자 장 치는 표시 패널로 광을 공급하는 백라이트 유닛을 구비할 수 있다. 본 발명의 일 실시예에서는 표시 패널이 유기 발광 표시 패널인 것을 일 예로서 설명한다. 그러나, 표시 패널의 종류는 이에 한정되는 것은 아니며, 본 발명의 개념에 부합되는 범위(또는 한도) 내에서 다른 표시 패널이 사용될 수 있다. 본 발명의 일 실시예에 있어서, 표시 패널은 도 3a에 도시된 전자 장치에 채용된 표시부와 동일한 구성일 수 있다. 표시 패널은 표시 영역(DA)과 표시 영역(DA)의 적어도 일측을 둘러싸는 비표시 영역(NDA)을 포함할 수 있 다. 표시 영역(DA)에는 복수의 화소들(PXL)이 배치될 수 있다. 실시예에 따라, 화소들(PXL) 각각은 적어도 하나의 발광 소자를 포함할 수 있다. 실시예에 따라 발광 소자는 유기 발광 다이오드 또는 마이크로 내지 나노 스케일 범위의 크기를 갖는 초소형 무기 발광 다이오드들을 포함한 발광 유닛일 수 있으나, 본 발명이 이에 한정되지 않는다. 표시 패널은 입력되는 영상 데이터에 대응하여 화소들(PXL)을 구동함으로서 표시 영역(DA)에서 영 상을 표시할 수 있다. 표시 영역(DA)은 전자 장치의 전면의 대부분을 차지하도록 대화면으로 배치될 수 있 다. 비표시 영역(NDA)은 표시 영역(DA)의 적어도 일측을 둘러싸는 영역으로서, 표시 영역(DA)을 제외한 나머지 영역 일 수 있다. 실시예에 따라, 비표시 영역(NDA)은 배선 영역, 패드 영역, 및/또는 각종 더미 영역 등을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 표시 영역(DA)은 도 4a 및 도 4b에 도시된 바와 같이, 전자 장치의 전면 전체에 배치될 수 있다. 표시 영역(DA)이 전자 장치의 전면 전부에 배치됨에 따라, 전면에는 비표시 영역 (NDA)이 배치되지 않거나 매우 협소한 면적으로 배치될 수 있다. 일 예로, 표시 영역(DA)은 전자 장치의 측면 테두리와 접하거나 측면 테두리로부터 1mm 이내의 간격을 두고 배치될 수 있다. 도 4a 및 도 4b에 있어서, 표시 영역(DA)이 전자 장치의 전면에만 배치되는 것으로 도시하였으나, 본 발명이 이에 한정되는 것은 아 니다. 실시예에 따라, 표시 영역(DA)은 전자 장치의 측면 테두리의 적어도 일 영역이나 후면의 적어도 일 영역 등에 배치될 수도 있다. 전자 장치의 다수의 면에 배치되는 표시 영역(DA)은 서로 적어도 일부분에서 연결되거나 분리되어 마련될 수도 있다. 본 발명의 일 실시예에 있어서, 전자 장치는 표시 영역(DA)의 적어도 일부와 중첩하여 배치되는 적어도 하 나의 부품을 포함할 수 있다. 부품은 표시 영역(DA)에 배치되는 화소들(PXL) 및/또는 배선들의 하부 에 배치되어, 전자 장치의 전면에 대하여 은폐될 수 있다. 이러한 부품이 표시 영역(DA)의 하부에 중 첩하여 배치되면, 전자 장치의 외관, 특히 표시 영역(DA)에 대응되는 전면의 외관이 미려해지고, 보다 넓 은 표시 영역(DA)을 확보할 수 있다. 본 발명의 일 실시예에 있어서, 표시 영역(DA)은 도 4a에 도시된 바와 같이, 일 방향, 일 예로, 제2 방향(DR2) 을 따라 구획된 제1 표시 영역(A1)과 제2 표시 영역(A2)을 포함할 수 있다. 제1 표시 영역(A1)과 제2 표시 영역 (A2)은 서로 인접하여 연결될 수 있다. 제1 표시 영역(A1)과 제2 표시 영역(A2)의 크기는 서로 상이할 수 있다. 일 예로, 제1 표시 영역(A1)의 크기가 제2 표시 영역(A2)의 크기보다 클 수 있다. 제1 표시 영역(A1)은 상술한 부품과 중첩되지 않는 표시 영역(DA)의 일 영역이고, 제2 표시 영역(A2)은 상 기 부품과 중첩되는 표시 영역(DA)의 다른 일 영역일 수 있다. 실시예에 따라, 제2 표시 영역(A2)은 부품 과 중첩되는 영역보다 넓은 영역을 갖도록 제공(또는 설정)될 수 있다. 예를 들어, 제2 표시 영역(A2)은 도 4a에 도시된 바와 같이 전자 장치의 일단(일 예로, 상단부)에 넓게 형성될 수 있다. 도 4a에서는, 적어 도 하나의 제2 표시 영역(A2)이 전자 장치의 전면 상단부에만 배치되는 것으로 도시하였으나, 본 발명이 이에 한정되는 것은 아니다. 실시예에 따라, 제2 표시 영역(A2)은 하나 또는 다수 개가 마련될 수 있으며, 표시영역(DA) 내이면 어디에나 인접하게 또는 분산되어 배치될 수 있다. 예를 들어, 표시 영역(DA)이 전자 장치 의 측면 테두리 및/또는 후면 등에 형성되는 실시예에서, 일부의 제2 표시 영역(A2)은 전자 장치의 측면 테두리 및/또는 후면의 표시 영역(DA) 내에 형성될 수 있다. 또한, 실시예에 따라, 제2 표시 영역(A2)은 도 4b에 도시된 바와 같이, 표시 영역(DA)의 하단부 중앙(또는 가운 데)에 위치하여 제1 표시 영역(A1)에 의해 둘러싸인 형태로 제공될 수 있다. 제2 표시 영역(A2)에 중첩하여 배치되는 부품은 광학 부품일 수 있다. 즉, 부품은 광을 수신하거나 광을 방출하는 부품일 수 있다. 부품은, 예를 들어, 지문 센서, 이미지 센서, 카메라, 스트로브, 광 센서, 조도 센서, 근접 센서, RGB 센서, 적외선 센서, 인디케이터 및 솔라 패널 등을 포함할 수 있다. 다만, 상기 부 품은 광학 부품으로 한정되지 않으며, 초음파 센서, 마이크로폰, 환경 센서(예를 들어, 기압계, 습도계, 온도계, 방사능 감지 센서, 열 감지 센서 등), 화학 센서(가스 감지 센서, 먼지 감지 센서, 냄새 감지 센서 등) 등 다양한 부품을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 부품은 제2 표시 영역(A2)과 중첩하는 복수 개의 센서들을 포함할 수 있다. 여기서, 복수 개의 센서들은, 나란하게 배치되는 카메라, 근접 센서, 및 조도 센서를 포함할 수 있다. 상술한 부품은 도시하지 않은 브라켓, 케이스 등과 같은 플라스틱 또는 금속 소재로 이루어진 별도의 기판 상에 SMD(Surface Mount Device) 방식으로 표시 영역(DA)의 적어도 일 영역, 일 예로, 제2 표시 영역(A2)과 대 면하도록(또는 대응하도록) 배치될 수 있다. 제2 표시 영역(A2)은 부품으로 입력된 신호(일 예로, 광 또는 빛)를 투과시킬 수 있다. 신호의 투과율을 향상시키기 위해 제2 표시 영역(A2)의 투과율은 제1 표시 영역(A1)과 비교하여 더 높을 수 있다. 여기서, 제2 표시 영역(A2)의 투과율 및 제1 표시 영역(A1)의 투과율은 각각 단위 면적(또는, 기 설정된 면적, 동일한 면적) 당 광이 투과되는 정도일 수 있다. 예를 들어, 투과율은 표시 패널의 단위 면적에 입사되는 광에 대한 표 시 패널을 투과하는 광의 비율일 수 있다. 따라서, 상대적으로 높은 투과율을 갖는 제2 표시 영역(A2)은 제1 표시 영역(A1)보다 신호(일 예로, 광 또는 빛)를 더욱 잘 투과시킬 수 있다. 예를 들어, 제2 표시 영역(A 2)은 제1 표시 영역(A1)과 비교하여 화소들(PXL)이 낮은 밀도로 배치될 수 있다. 낮은 밀도로 배치되는 화소들 (PXL)의 간극은 물리적 및/또는 광학적 개구, 일 예로, 투과창을 형성함으로써, 신호(일 예로, 광 또는 빛)를 보다 잘 투과시킬 수 있다. 제1 표시 영역(A1)과 제2 표시 영역(A2)에는 복수의 화소들(PXL)이 배치될 수 있다. 일 예로, 제1 표시 영역 (A1)에는 복수의 제1 화소들(PXL1)이 배치되고, 제2 표시 영역(A2)에는 복수의 제2 화소들(PXL2)이 배치될 수 있다. 제1 및 제2 화소들(PXL1, PXL2) 각각은 광을 방출하는 발광 소자를 포함할 수 있다. 발광 소자는 예를 들 어 유기 발광 다이오드일 수 있으나, 본 발명이 이에 한정되는 것은 아니다. 실시예에 따라, 발광 소자는 무기 발광 재료를 포함하는 무기 발광 소자 또는 양자점을 이용하여 출사되는 광의 파장을 변화시켜 발광하는 발광 소자(퀀텀닷 디스플레이 소자)일 수도 있다. 본 발명의 일 실시예에 있어서, 각각의 제1 화소(PXL1)와 각각의 제2 화소(PXL2)는 서로 상이할 수 있다. 이와 관련된 상세한 설명은 후술하기로 한다. 표시 패널은 기판 및 상기 기판 상에 제공된 표시 모듈을 포함할 수 있다. 기판은 표시 패널의 베이스 기재로서, 실질적으로 투명한 투광성 기판일 수 있다. 실시예에 따라, 기 판은 유리 또는 강화 유리를 포함한 경성 기판(rigid substrate), 또는 플라스틱 재질의 가요성 기판 (flexible substrate)일 수 있다. 본 발명의 일 실시예에 있어서, 기판은 가요성 기판일 수 있다. 여기서, 부품은 기판의 배면에 제공될 수 있다. 표시 모듈은 사용자가 입력한 정보 또는 사용자에게 제공하는 정보를 영상으로 표시할 수 있다. 다시 말해, 표시 모듈은 사용자에 의해서 입력되는 데이터와 그 데이터에 따른 동작 수행 결과 및 반응을 영상 으로써 표시할 수 있다. 이를 위해, 표시 모듈은 기판 상에 제공된 복수의 화소들(PXL)을 이용하여 영상을 표시할 수 있다. 상술한 표시 모듈에 대한 상세한 설명은 후술한다. 상술한 구성들을 포함한 표시 패널 상에 터치 센서 및 윈도우가 배치될 수 있다. 터치 센서는 터치 전극들을 포함하며 표시 패널의 영상 표시 면 상에 배치되어 사용자의 터치 입력 및/또는 호버 입력을 수신할 수 있다. 터치 센서는 사용자의 손이나 이와 유사한 도전체와 같은 별도의 입 력 수단의 접촉 및/또는 근접에 의해 터치 커패시턴스를 감지하여 전자 장치의 터치 입력 및/또는 호버 입 력을 인식할 수 있다. 여기서, 터치 입력은 사용자의 손이나 별도의 입력 수단에 의해 직접 터치(또는 접촉)되 는 것을 의미하고, 호버 입력은 사용자의 손이나 별도의 입력 수단이 터치 센서를 포함한 전자 장치근처에 있지만 터치하지는 않는 것을 의미할 수 있다. 또한, 터치 센서는 사용자의 터치 동작을 감지하고, 상기 터치 동작에 응답하여 전자 장치에 표시된 객체를 원래 표시된 위치에서 다른 위치로 이동할 수 있다. 여기서, 터치 동작이란, 단일의 싱글 터치, 멀티 터 치, 및 터치 제스처 중의 적어도 하나의 터치를 포함할 수 있다. 일 예로, 사용자의 손가락을 터치 센서의 터치면 상에 터치한 상태에서 일정 거리를 움직여 텍스트나 영상을 확대하거나 축소하는 등의 특정 제스처 등을 포함한 다양한 터치 동작이 있을 수 있다. 윈도우는 표시 패널을 포함한 전자 장치의 최상단에 배치되는 부재로서, 실질적으로 투명한 투 광성 기판일 수 있다. 윈도우는 표시 패널로부터의 영상을 투과시킴과 동시에 외부의 충격을 완화시 킴으로써, 외부의 충격에 상기 표시 패널이 파손되거나 오동작하는 것을 방지할 수 있다. 여기서, 외부의 충격이라 함은, 압력, 스트레스 등으로 표현할 수 있는 외부로부터의 힘으로써, 표시 패널에 결함을 일으 킬 수 있는 힘을 의미할 수 있다. 이러한 윈도우는 경성 또는 가요성의 기재를 포함할 수 있으며, 상기 윈 도우의 구성 물질이 특별히 한정되는 것은 아니다. 도 6은 본 발명의 일 실시예에 따른 제1 표시 영역을 개략적으로 나타낸 평면도이며, 도 7은 도 6의 제1 서브 화소에 포함된 구성 요소들의 전기적 연결 관계를 일 실시예에 따라 나타낸 회로도이다. 도 7에 있어서는, 제1 표시 영역(A1)의 i번째 수평 화소 열에 배치된 i번째 스캔 라인(Si), i번째 발광 제어 라 인(Ei), 및 j번째 수직 화소 열에 배치된 j번째 데이터 라인(Dj)에 접속되며 7개의 트랜지스터들을 포함하는 능 동형 하나의 서브 화소, 일 예로 도 6의 제1 서브 화소를 도시하였다. 도 1 내지 도 7을 참조하면, 제1 표시 영역(A1)은 표시 영역(DA)의 일 영역으로, 복수의 제1 화소들(PXL1)이 배 치될 수 있다. 각각의 제1 화소(PXL1)는 적어도 1개의 서브 화소를 포함할 수 있다. 일 예로, 제1 화소(PXL1)는 4개의 서브 화 소들(SP1, SP2, SP3, SP4)을 포함할 수 있다. 구체적으로, 제1 화소(PXL1)는 제1 서브 화소(SP1), 제2 서브 화 소(SP2), 제3 서브 화소(SP3), 및 제4 서브 화소(SP4)를 포함할 수 있다. 제1 서브 화소(SP1)는 적색 광(R)을 방출하는 적색 화소일 수 있고, 제2 및 제4 서브 화소들(SP2, SP4)은 녹색 광(G)을 방출하는 녹색 화소일 수 있 으며, 제3 서브 화소(SP3)는 청색 광(B)을 방출하는 청색 화소일 수 있다. 제1 표시 영역(A1)에서, 제2 및 제4 서브 화소들(SP2, SP4) 중 하나의 서브 화소를 중심으로 대각 방향의 4 곳 에는 두 개의 제1 서브 화소(SP1)와 두 개의 제3 서브 화소(SP3)가 위치할 수 있다. 두 개의 제1 서브 화소들 (SP1)과 두 개의 제3 서브 화소들(SP3)은 제2 및 제4 서브 화소들(SP2, SP4) 중 하나의 서브 화소를 중앙에 두 고 서로 마주볼 수 있다. 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각은 마름모 구조를 가질 수 있으며, 서로 동 일하거나 유사한 면적으로 형성되어 있다. 다만, 본 발명이 이에 한정되는 것은 아니며 제1 내지 제4 서브 화소 들(SP1 ~ SP4)은 서로 상이한 구조를 가질 수 있으며, 상기 제1 내지 제4 서브 화소들(SP1 ~ SP4) 중 일부는 그 의 면적(또는 크기)이 나머지 서브 화소들보다 작거나 또는 클 수 있다. 본 발명의 일 실시예에 있어서, 제1 표시 영역(A1)은 각각의 제1 화소(PXL1)가 배치되는 제1 단위 화소 영역 (PXA1)을 포함할 수 있다. 즉, 제1 표시 영역(A1)에는 복수 개의 제1 단위 화소 영역들(PXA1)이 배치될 수 있다. 이러한, 제1 단위 화소 영역들(PXA1)은 표시 패널의 해상도에 따라 제1 방향(DR1)과 제2 방향(DR2) 을 따라 소정의 개수로 배열될 수 있다. 평면 상에서 볼 때, 각각의 제1 단위 화소 영역(PXA1)은 마름모 형상을 가질 수 있으나, 본 발명이 이에 한정되는 것은 아니며, 제1 화소(PXL1)에 포함된 서브 화소들의 조합에 따라 다양한 형상을 포함할 수 있다. 각각의 제1 단위 화소 영역(PXA1) 내에 포함된 서브 화소들의 조합에 의해 컬러 광 및/또는 백색 광이 구현될 수 있다. 각각의 제1 단위 화소 영역(PXA1) 내에서, 제2 및 제4 서브 화소들(SP2, SP4)은 동일한 열 방향을 따라 배치되 고, 제1 서브 화소(SP1)는 제2 및 제4 서브 화소들(SP2, SP4)이 배치되는 열과 다른 열에 위치하며, 제3 서브 화소(SP3)는 상기 제2 및 제4 서브 화소들(SP2, SP4)이 배치되는 열과 또 다른 열에 위치할 수 있다. 각각의 제 1 단위 화소 영역(PXA1) 내에서 제2 및 제4 서브 화소들(SP2, SP4)은 제2 방향(DR2)을 따라 인접하게 배치되고, 제1 및 제3 서브 화소들(SP1, SP3)은 상기 제2 방향(DR2)과 교차하는 제1 방향(DR1)을 따라 인접하게 배치될 수 있다. 도 6에 도시된 바와 같이, 제1 표시 영역(A1)에서 제1 내지 제4 서브 화소들(SP1 ~ SP4)을 각각 포함한 제1 화 소들(PXL1)은 제1 밀도로 배치될 수 있다. 제1 밀도는, 예를 들어, 제1 표시 영역(A1) 내에서 제1 화소들(PXL 1)이 조밀하게 배치되어, 제1 표시 영역(A1)의 전체 면적과 제1 화소들(PXL1)이 배치된 면적이 실질적으로 동일 한 밀도일 수 있다. 예를 들어, 제1 밀도는 대략 100%일 수 있다. 여기서, 제1 밀도는 제1 표시 영역(A1)의 단 위 면적 당 제1 화소들(PXL1)의 총 개수(pixel per inch, PPI)로 정의될 수 있다. 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각은 광을 방출하는 발광 소자 및 상기 발광 소자를 구동하기 위한 적 어도 하나의 트랜지스터를 포함한 화소 회로를 포함할 수 있다. 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각의 화소 회로는 실질적으로 유사하거나 동일한 구조를 가질 수 있다. 이에 따라, 설명의 편의를 위하여 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각의 화소 회로에 대한 설명은 도 7을 참고하여 상기 제1 서브 화소(SP1)의 화소 회로(PXC)에 대한 설명으로 대신하기로 한다. 제1 서브 화소(SP1)는, 도 7에 도시된 바와 같이, 발광 소자(OLED) 및 상기 발광 소자(OLED)에 연결되어 상기 발광 소자(OLED)를 구동하는 화소 회로(PXC)를 포함할 수 있다. 여기서, 화소 회로(PXC)는 제1 내지 제7 트랜지 스터들(T1 ~ T7), 발광 소자(OLED), 및 스토리지 커패시터(Cst)를 포함할 수 있다. 다만, 본 발명에서 제1 서브 화소(SP1)의 화소 회로(PXC)에 포함된 구성들은 상술한 실시예에 한정되는 것은 아니다. 제1 트랜지스터(T1, 구동 트랜지스터)의 제1 전극은 제5 트랜지스터(T5)를 경유하여 제1 전원(ELVDD)에 접속되 고, 제2 전극은 제6 트랜지스터(T6)를 경유하여 발광 소자(OLED)의 애노드 전극에 접속될 수 있다. 그리고, 제1 트랜지스터(T1)의 게이트 전극은 제1 노드(N1)에 접속될 수 있다. 이러한 제1 트랜지스터(T1)는 제1 노드(N1)의 전압에 대응하여 제1 전원(ELVDD)으로부터 발광 소자(OLED)를 경유하여 제2 전원(ELVSS)으로 흐르는 전류량을 제어할 수 있다. 제2 트랜지스터(T2, 스위칭 트랜지스터)는 j번째 데이터 라인(Dj)과 제1 트랜지스터(T1)의 제1 전극의 사이에 접속될 수 있다. 그리고, 제2 트랜지스터(T2)의 게이트 전극은 i번째 스캔 라인(Si)에 접속될 수 있다. 이러한 제2 트랜지스터(T2)는 i번째 스캔 라인(Si)으로 스캔 신호가 공급될 때 턴-온되어 j번째 데이터 라인(Dj)과 제1 트랜지스터(T1)의 제1 전극을 전기적으로 접속시킬 수 있다. 제3 트랜지스터(T3)는 제1 트랜지스터(T1)의 제2 전극과 제1 노드(N1)의 사이에 접속될 수 있다. 그리고, 제3 트랜지스터(T3)의 게이트 전극은 i번째 스캔 라인(Si)에 접속될 수 있다. 이러한 제3 트랜지스터(T3)는 i번째 스캔 라인(Si)으로 게이트-온 전압의 스캔 신호가 공급될 때 턴-온되어 제1 트랜지스터(T1)의 제2 전극과 제1 노드(N1)를 전기적으로 접속시킬 수 있다. 따라서, 제3 트랜지스터(T3)가 턴-온 될 때, 제1 트랜지스터(T1)는 다이오드 형태로 접속될 수 있다. 제4 트랜지스터(T4, 초기화 트랜지스터)는 제1 노드(N1)와 초기화 전원(Vint)의 사이에 접속될 수 있다. 그리고, 제4 트랜지스터(T4)의 게이트 전극은 i-1번째 스캔 라인(Si-1)에 접속될 수 있다. 이러한 제4 트랜지스 터(T4)는 i-1번째 스캔 라인(Si-1)으로 스캔 신호가 공급될 때 턴-온 되어 제1 노드(N1)로 초기화 전원(Vint)의 전압을 공급할 수 있다. 도 7에서는, 제1 트랜지스터(T1)의 게이트 노드, 즉 제1 노드(N1)를 초기화하기 위한 초기화 제어선으로서 i- 1번째 스캔 라인(Si-1)이 이용되는 실시예가 도시되었다. 그러나, 본 발명의 기술적 사상은 이에 한정되지 않는 다. 예를 들어, 본 발명의 다른 실시 예에서, i-2번째 스캔 라인(미도시)과 같은 다른 제어선을 제1 트랜지스터 (T1)의 게이트 노드를 초기화하기 위한 초기화 제어선으로 이용할 수도 있다. 제5 트랜지스터(T5)는 제1 전원(ELVDD)과 제1 트랜지스터(T1)의 사이에 접속될 수 있다. 그리고, 제5 트랜지스 터(T5)의 게이트 전극은 i번째 발광 제어라인(Ei)에 접속될 수 있다. 이러한 제5 트랜지스터(T5)는 i번째 발광 제어 라인(Ei)으로 게이트-오프 전압의 발광 제어 신호가 공급될 때 턴-오프되고, 그 외의 경우에 턴-온될 수 있다. 제6 트랜지스터(T6)는 제1 트랜지스터(T1)와 발광 소자(OLED)의 사이에 접속될 수 있다. 그리고, 제6 트랜지스 터(T6)의 게이트 전극은 i번째 발광 제어 라인(Ei)에 접속될 수 있다. 이러한 제6 트랜지스터(T6)는 i번째 발광 제어 라인(Ei)으로 게이트-오프 전압의 발광 제어 신호(예를 들어, 하이 레벨 전압)가 공급될 때 턴-오프되고, 그 외의 경우에 턴-온될 수 있다. 제7 트랜지스터(T7)는 초기화 전원(Vint)과 발광 소자(OLED)의 제1 전극, 예를 들어, 애노드 전극의 사이에 접 속될 수 있다. 그리고, 제7 트랜지스터(T7)의 게이트 전극은 i+1번째 스캔 라인(Si+1)에 접속될 수 있다. 이러 한 제7 트랜지스터(T7)는 i+1번째 스캔 라인(Si+1)으로 게이트-온 전압(예를 들어, 로우 레벨 전압)의 스캔 신 호가 공급될 때 턴-온되어 초기화 전원(Vint)의 전압을 발광 소자(OLED)의 애노드 전극으로 공급할 수 있다. 여기서, 초기화 전원(Vint)의 전압은 데이터 신호보다 낮은 전압으로 설정될 수 있다. 즉, 초기화 전원(Vint)의 전압은 데이터 신호의 최저 전압 이하로 설정될 수 있다. 도 7에서는, 제7 트랜지스터(T7)의 게이트 전극이 접속되는 애노드 초기화 제어선이 i+1번째 스캔 라인(Si+1)인 경우가 도시되었으나, 본 발명의 기술적 사상은 이로써 한정되지 않는다. 예를 들어, 본 발명의 다른 실시 예에 서, 제7 트랜지스터(T7)의 게이트 전극이 i번째 스캔 라인(Si)에 접속될 수도 있다. 이 경우, 초기화 전원 (Vint)의 전압은 i번째 스캔 라인(Si)으로 게이트-온 전압의 주사 신호가 공급될 때, 제7 트랜지스터(T7)를 경 유하여 발광 소자(OLED)의 애노드 전극으로 공급될 수 있다. 스토리지 커패시터(Cst)는 제1 전원(ELVDD)과 제1 노드(N1)의 사이에 접속될 수 있다. 이러한 스토리지 커패시 터(Cst)는 데이터 신호 및 제1 트랜지스터(T1)의 문턱 전압에 대응하는 전압을 저장할 수 있다. 발광 소자(OLED)의 애노드 전극은 제6 트랜지스터(T6)를 경유하여 제1 트랜지스터(T1)에 접속되고, 캐소드 전극 은 제2 전원(ELVSS)에 접속될 수 있다. 이러한 발광 소자(OLED)는 제1 트랜지스터(T1)로부터 공급되는 전류량에 대응하여 소정 휘도의 빛을 생성한다. 발광 소자(OLED)로 전류가 흐를 수 있도록 제1 전원(ELVDD)의 전압 값은 제2 전원(ELVSS)의 전압 값보다 높게 설정될 수 있다. 발광 소자(OLED)는 예를 들어, 유기 발광 다이오드일 수 있다. 발광 소자(OLED)는 적색, 녹색, 및 청색 중 하나 로 발광할 수 있다. 그러나 본 발명은 이로써 한정되지 않는다. 한편, 제1 서브 화소(SP1)의 구조가 도 7에 도시된 실시 예에 한정되지는 않는다. 예를 들어, 현재 공지된 다양 한 구조의 화소 회로(PXC)가 제1 서브 화소(SP1)에 적용될 수 있음은 물론이다. 도 8은 도 5의 표시 패널의 개략적인 단면도이다. 도 8에 있어서는, 설명의 편의를 위하여 도 7에 도시된 제1 내지 제7 트랜지스터들(T1 ~ T7) 중 제2 및 제6 트 랜지스터들(T2, T6) 각각에 대응하는 부분의 단면만을 도시하였다. 도 1 내지 도 8을 참조하면, 표시 패널은 기판, 표시 모듈, 박막 봉지막을 포함할 수 있다. 기판은 투명 절연 물질을 포함하여 광의 투과가 가능할 수 있다. 기판은 단일층 구조나 다중층 구조 를 가질 수 있다. 기판은 경성(rigid) 기판일 수 있다. 예를 들면, 경성 기판은 유리 기판, 석영 기판, 유리 세라믹 기판, 및 결정질 유리 기판 중 하나일 수 있다. 또한, 기판은 가요성(flexible) 기판일 수 있다. 여기서, 가요성 기판은 고분자 유기물을 포함하는 필름 기판 및 플라스틱 기판 중 하나일 수 있다. 예를 들면, 가요성 기판은 폴리스티렌(polystyrene), 폴리비닐알코 올(polyvinyl alcohol), 폴리메틸메타크릴레이트(Polymethyl methacrylate), 폴리에테르술폰 (polyethersulfone), 폴리아크릴레이트(polyacrylate), 폴리에테르이미드(polyetherimide), 폴리에틸렌 나프탈 레이트(polyethylene naphthalate), 폴리에틸렌 테레프탈레이트(polyethylene terephthalate), 폴리페닐렌 설 파이드(polyphenylene sulfide), 폴리아릴레이트(polyarylate), 폴리이미드(polyimide), 폴리카보네이트 (polycarbonate), 트리아세테이트 셀룰로오스(triacetate cellulose), 셀룰로오스아세테이트 프로피오네이트 (cellulose acetate propionate) 중 적어도 어느 하나를 포함할 수 있다. 다만, 기판을 구성하는 재료는 상술한 실시예에 한정되는 것은 아니며 다양하게 변경될 수 있다. 표시 모듈은 기판 상에 제공된 화소 회로부(430a) 및 상기 화소 회로부(430a) 상에 제공된 표시 소자 부(430b)를 포함할 수 있다. 화소 회로부(430a)는 적어도 하나의 절연층과 적어도 하나의 트랜지스터를 포함한 화소 회로(PXC)를 포함할 수 있다. 표시 소자부(430b)는 광을 방출하는 적어도 하나의 발광 소자(OLED)를 포함 할 수 있다. 화소 회로부(430a)는 버퍼막, 제2 및 제6 트랜지스터들(T2, T6), 및 보호막을 포함할 수 있다. 버퍼막은 기판 상에 제공되며, 제2 및 제6 트랜지스터들(T2, T6)에 불순물이 확산되는 것을 방지할 수 있다. 버퍼막은 단일층으로 제공될 수 있으나, 적어도 2중층 이상의 다중층으로 제공될 수 있다. 버퍼 막은 기판의 재료 및 공정 조건에 따라 생략될 수도 있다. 제2 및 제6 트랜지스터들(T2, T6) 각각은 반도체층(SCL), 게이트 전극(GE), 제1 단자(SE), 및 제2 단자(DE)를 포함할 수 있다. 제1 단자(SE)는 소스 전극 및 드레인 전극 중 어느 하나의 전극일 수 있으며, 제2 단자(DE)는 나머지 하나의 전극일 수 있다. 일 예로, 제1 단자(SE)가 소스 전극일 경우 제2 단자(DE)는 드레인 전극일 수 있다. 제2 및 제6 트랜지스터들(T2, T6)과 함께 하나의 서브 화소의 화소 회로(PXC)에 포함된 제1, 제3 내지 제 5, 및 제7 트랜지스터들(T1, T3 ~ T5, T7) 각각도 반도체층(SCL), 게이트 전극(GE), 제1 단자(SE), 및 제2 단 자(DE)를 포함할 수 있다. 제2 및 제6 트랜지스터들(T2, T6) 각각의 반도체층(SCL)은 버퍼막 상에 제공 및/또는 형성될 수 있다. 반 도체층(SCL)은 제1 단자(SE)에 접촉하는 제1 영역과 제2 단자(DE)에 접촉하는 제2 영역을 포함할 수 있다. 제1 영역과 제2 영역 사이의 영역은 채널 영역일 수 있다. 반도체층(SCL)은 폴리 실리콘, 아몰퍼스 실리콘, 산화물 반도체 등으로 이루어진 반도체 패턴일 수 있다. 채널 영역은 불순물이 도핑되지 않는 반도체 패턴으로서, 진성 반도체일 수 있다. 제1 영역과 제2 영역은 불순물이 도핑된 반도체 패턴일 수 있다. 여기서, 불순물로는 n형 불 순물, p형 불순물, 기타 금속과 같은 불순물이 사용될 수 있다. 제2 및 제6 트랜지스터들(T2, T6) 각각의 게이트 전극(GE)은 게이트 절연막을 사이에 두고 대응하는 반도 체층(SCL) 상에 제공 및/또는 형성될 수 있다. 제2 및 제6 트랜지스터들(T2, T6) 각각의 제1 단자(SE)와 제2 단자(DE) 각각은 층간 절연막과 게이트 절연 막을 관통하는 컨택 홀을 통해 대응하는 반도체층(SCL)의 제1 영역 및 제2 영역에 접촉할 수 있다. 상술한 실시예에 있어서, 제2 및 제6 트랜지스터들(T2, T6) 각각의 제1 및 제2 단자들(SE, DE)이 대응하는 반도 체층(SCL)과 전기적으로 연결되는 별개의 전극으로 설명하였으나, 본 발명이 이에 한정되는 것은 아니다. 실시 예에 따라, 제2 및 제6 트랜지스터들(T2, T6) 각각의 제1 단자(SE)는 대응하는 반도체층(SCL)의 채널 영역에 인 접한 제1 및 제2 영역들 중 하나의 영역일 수 있으며, 상기 제2 및 제6 트랜지스터들(T2, T6) 각각의 제2 단자 (DE)는 상기 대응하는 반도체층(SCL)의 채널 영역에 인접한 제1 및 제2 영역들 중 나머지 영역일 수 있다. 이러 한 경우, 제2 및 제6 트랜지스터들(T2, T6) 각각의 제2 단자(DE)는 브릿지 전극 또는 컨택 전극 등을 통해 대응 하는 서브 화소의 발광 소자(OLED)에 전기적으로 연결될 수 있다. 제2 및 제6 트랜지스터들(T2, T6) 각각은 LTPS 박막 트랜지스터로 구성될 수 있으나, 본 발명이 이에 한정되는 것은 아니며, 실시예에 따라 산화물 반도체 박막 트랜지스터로 구성될 수도 있다. 또한, 제2 및 제6 트랜지스터 들(T2, T6) 각각이 탑 게이트(top gate) 구조의 박막 트랜지스터인 경우를 예로서 설명하였으나, 본 발명이 이 에 한정되는 것은 아니다. 실시예에 따라, 제2 및 제6 트랜지스터들(T2, T6) 각각은 바텀 게이트(bottom gate) 구조의 박막 트랜지스터일 수도 있다. 본 발명의 일 실시예에 있어서, 층간 절연막 및 게이트 절연막 각각은 무기 재료를 포함한 무기 절연 막 또는 유기 재료를 포함한 유기 절연막으로 이루어질 수 있다. 보호막은 제2 및 제6 트랜지스터들(T2, T6) 상에 제공 및/또는 형성되어 상기 제2 및 제6 트랜지스터들 (T2, T6)을 커버할 수 있다. 표시 소자부(430b)는 보호막(PSV) 상에 제공되며 광을 방출하는 발광 소자(OLED)를 포함할 수 있다. 발광 소자(OLED)는 제1 및 제2 전극(AE, CE)과, 두 전극들(AE, CE) 사이에 제공된 발광층(EML)을 포함할 수 있 다. 여기서, 제1 및 제2 전극(AE, CE) 중 어느 하나는 애노드(anode) 전극일 수 있으며, 다른 하나는 캐소드 (cathode) 전극일 수 있다. 발광 소자(OLED)가 전면 발광형 유기 발광 소자인 경우, 제1 전극(AE)이 반사형 전 극이고, 제2 전극(CE)이 투과형 전극일 수 있다. 본 발명의 일 실시예에 있어서는, 발광 소자(OLED)가 전면 발 광형 유기 발광 소자이며, 제1 전극(AE)이 애노드 전극인 경우를 예로서 설명한다. 제1 전극(AE)은 보호막을 관통하는 컨택 홀을 통해 제6 트랜지스터(T6)의 제2 단자(DE)에 전기적으로 연결 될 수 있다. 제1 전극(AE)은 광을 반사시킬 수 있는 반사막(미도시) 및 상기 반사막의 상부 또는 하부에 배치되 는 투명 도전막(미도시)을 포함할 수 있다. 투명 도전막 및 반사막 중 적어도 하나는 제6 트랜지스터(T6)의 제2 단자(DE)에 전기적으로 연결될 수 있다. 표시 소자부(430b)는 제1 전극(AE)의 일부, 예를 들면, 제1 전극(AE)의 상면을 노출시키는 개구부를 구비한 화 소 정의막을 더 포함할 수 있다. 제1 표시 영역(A1)에서 각각의 제1 단위 화소 영역(PXA1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각 은 발광 영역(EMA)과 상기 발광 영역(EMA)에 인접한 비발광 영역(NEMA)을 포함할 수 있다. 비발광 영역(NEMA)은발광 영역(EMA)을 둘러쌀 수 있다. 본 실시예에 있어서, 발광 영역(EMA)은 화소 정의막의 개구부에 의해 노출된 제1 전극(AE)의 일부 영역 또는 발광층(EML)에 대응하게 정의될 수 있다. 발광층(EML)은 화소 정의막의 개구부에 대응하는 영역에 배치될 수 있다. 즉, 발광층(EML)은 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각에 분리되어 제공될 수 있다. 발광층(EML)은 유기 물질 및/또는 무기 물질을 포함 할 수 있다. 본 발명의 일 실시예에 있어서, 패터닝된 발광층(EML)을 예시적으로 도시하였으나, 발광층(EML)은 실시예에 따라 화소들(PXL)에 공통적으로 제공될 수 있다. 발광층(EML)에서 생성되는 광의 색상은 적색(red), 녹색(green), 청색(blue) 및 백색(white) 중 하나일 수 있으나, 본 실시예에서 이를 한정하는 것은 아니다. 예 를 들어, 발광층(EML)에서 생성되는 광의 색상은 마젠타(magenta), 시안(cyan), 옐로(yellow) 중 하나일 수도 있다. 제2 전극(CE)은 발광층(EML) 상에 제공될 수 있다. 제2 전극(CE)은 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각 에 공통으로 제공될 수 있다. 제2 전극(CE)은 제1 표시 영역(A1)에 전체적으로 대응되도록 판(plate) 형태로 제 공될 수 있으나, 본 발명이 이에 한정되는 것은 아니다. 제1 전극(AE)과 발광층(EML) 사이에 정공 주입층(미도 시)이 배치될 수 있고, 상기 발광층(EML)과 제2 전극(CE) 사이에 전자 주입층(미도시)이 배치될 수 있다. 정공 주입층 및 전자 주입층은 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각에 공통으로 제공될 수 있다. 제2 전극(CE) 상에 박막 봉지막이 제공될 수 있다. 박막 봉지막은 단일막으로 이루어질 수 있으나, 다중막으로 이루어질 수도 있다. 박막 봉지막은 발광 소자(OLED)를 커버하는 복수의 절연막을 포함할 수 있다. 구체적으로, 박막 봉지막은 적어도 하나의 무기막 및 적어도 하나의 유기막을 포함할 수 있다. 예를 들면, 박막 봉지막은 무기막 및 유기막이 교번하여 적층된 구조를 가질 수 있다. 도 9는 본 발명의 일 실시예에 따른 제2 표시 영역을 개략적으로 나타낸 평면도이고, 도 10은 도 9의 Ⅱ ~ Ⅱ' 선에 따른 단면도이고, 도 11은 도 10의 투과 영역을 다른 실시예에 따라 구현한 것으로, 도 9의 Ⅱ ~ Ⅱ'선에 대응되는 단면도이며, 도 12 내지 도 15는 본 발명의 일 실시예에 따른 제2 표시 영역을 다른 실시예에 따라 나 타낸 개략적인 평면도들이다. 도 1 내지 도 15를 참조하면, 표시 패널은 화소들(PXL)이 서로 상이한 밀도로 배치된 제1 표시 영역(A1)과 제2 표시 영역(A2)을 포함할 수 있다. 즉, 제1 표시 영역(A1)과 제2 표시 영역(A2)에는 화소들(PXL)이 상이한 밀도로 배치될 수 있다. 일 예로, 제1 표시 영역(A1)에는 제1 밀도로 제1 화소들(PXL1)이 배치되고, 제2 표시 영역(A2)에는 제2 밀도로 제2 화소들(PXL2)이 배치될 수 있다. 제2 밀도는 제1 밀도보다 작게 설정될 수 있다. 본 발명의 일 실시예에 있어서, 밀도(또는 화소 밀도(pixel density))는 해당 표시 영역의 전체 면적 대비 화소 들(PXL)이 배치된 면적의 비율(%)로 정의될 수 있다. 화소들(PXL)이 배치된 면적은 화소들(PXL) 각각의 면적의 총합일 수 있다. 각각의 화소(PXL)의 면적은 화소 회로(PXC) 및 발광 소자(OLED)를 포함하는 영역의 면적을 의 미할 수 있다. 실시예에 따라, 각각의 화소(PXL)의 면적은 발광 소자(OLED)의 발광면의 면적, 일 예로, 광이 방 출되는 발광 영역의 크기를 의미할 수 있다. 예를 들어, 각각의 화소(PXL)의 면적은 발광 소자(OLED)에 포함된 제1 전극(AE)의 면적, 또는 발광층(EML)의 면적일 수 있다. 이하의 실시예들에서는, 제1 밀도가 제1 표시 영역(A1)의 전체 면적 대비 제1 화소들(PXL1)이 배치된 면적의 비 율로 정의하고 제2 밀도가 제2 표시 영역(A2)의 전제 면적 대비 제2 화소들(PXL2)이 배치된 면적의 비율로 정의 한다. 제2 표시 영역(A2)은 서로 인접하며 동일한 크기(또는 면적)를 갖는 복수 개의 제1 서브 영역들(SA1)과 복수 개 의 제2 서브 영역들(SA2)을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 각각의 제1 서브 영역(SA1)은 하나 의 제2 화소(PXL2)가 배치되는 제2 단위 화소 영역(PXA2)이고, 각각의 제2 서브 영역(SA2)은 제2 화소(PXL2)가 배치되지 않는 영역이며 광이 투과되는 투과 영역(TA)이다. 이하의 실시예에서는, 제1 서브 영역(SA1)을 제2 단 위 화소 영역(PXA2)으로 명명하고, 제2 서브 영역(SA2)을 투과 영역(TA)으로 명명한다. 각각의 제2 단위 화소 영역(PXA2)과 각각의 투과 영역(TA)은 제1 및 제2 방향(DR1, DR2) 중 어느 한 방향의 경 사진 방향, 일 예로, 제3 방향(DR3)을 따라 교번하여 배치할 수 있다. 이 경우, 제2 표시 영역(A2)에 위치한 제 2 화소들(PXL2)은 제3 방향(DR3)을 따라 배열될 수 있다. 일 예로, 제2 화소들(PXL2)은 제2 표시 영역(A2) 내에 서 사선 방향을 따라 배열될 수 있다. 실시예에 따라, 도 12 내지 도 15에 도시된 바와 같이, 각각의 제2 단위 화소 영역(PXA2)과 각각의 투과 영역 (TA)은 제1 방향(DR1)을 따라 교번하여 배치할 수 있다. 또한, 실시예에 따라, 각각의 제2 단위 화소 영역 (PXA2)과 각각의 투과 영역(TA)은 제2 방향(DR2)을 따라 교번하여 배치할 수 있다. 또한 다른 실시예에 따라, 서로 인접한 적어도 둘 이상의 제2 단위 화소 영역들(PXA2)과 서로 인접한 적어도 둘 이상의 투과 영역들(TA)이 제1 방향(DR1), 제2 방향(DR2), 또는 제3 방향(DR3)을 따라 교번하여 배치할 수 있다. 도 9에 도시된 바와 같이, 제2 단위 화소 영역들(PXA2)은 제3 방향(DR3)을 따라 반복적으로 배열되어 제1 열을 구성하고, 투과 영역들(TA)은 상기 제3 방향(DR3)을 따라 반복적으로 배열되어 제2 열을 구성할 수 있다. 제2 표시 영역(A2) 내에서, 상술한 제1 열과 제2 열은 제1 방향(DR1)을 따라 교번하여 배치할 수 있다. 실시예에 따라, 도 12에 도시된 바와 같이, 제2 단위 화소 영역들(PXA2)은 제2 방향(DR2)을 따라 반복적으로 배 열되어 적어도 하나의 열을 구성하고, 투과 영역들(TA)은 상기 제2 방향(DR2)에 교차하는 제1 방향(DR1)을 따라 반복적으로 배열되어 적어도 하나의 행을 구성할 수 있다. 또한, 도 12에 도시된 바와 같이, 제2 표시 영역(A 2)에서 하나의 제2 단위 화소 영역(PXA2)을 중심으로 대각 방향의 4곳에는 각각 하나의 투과 영역(TA)이 배치될 수 있다. 마찬가지로, 제2 표시 영역(A2)에서 하나의 투과 영역(TA)을 중심으로 대각 방향의 4곳에는 각각 하나 의 제2 단위 화소 영역(PXA2)이 배치될 수 있다. 하나의 제2 화소(PXL2)는 제2 단위 화소 영역(PXA2)에 배치된 적어도 1개의 서브 화소를 포함할 수 있다. 일 예 로, 하나의 제2 화소(PXL2)는 제2 단위 화소 영역(PXA2)에 배치된 제1 내지 제4 서브 화소들(SP1', SP2', SP3', SP4')을 포함할 수 있다. 각각의 제2 단위 화소 영역(PXA2) 내에서, 제1 내지 제4 서브 화소들(SP1' ~ SP4')의 배치 관계는 제1 표시 영 역(A1)에 포함된 각각의 제1 단위 화소 영역(PXA1)에 배치된 제1 내지 제4 서브 화소들(SP1 ~ SP4)의 배치 관계 와 동일할 수 있다. 즉, 각각의 제2 단위 화소 영역(PXA2) 내에서, 제2 및 제4 서브 화소들(SP2', SP4')은 동일 한 열 방향을 따라 인접하게 배치되고, 제1 서브 화소(SP1')는 상기 제2 및 제4 서브 화소들(SP2', SP4')이 배 치되는 열과 다른 열에 위치하며, 제3 서브 화소(SP3')는 상기 제2 및 제4 서브 화소들(SP2', SP4')이 배치되는 열과 또 다른 열에 위치할 수 있다. 각각의 제2 단위 화소 영역(PXA2) 내에서, 제2 및 제4 서브 화소들(SP2', SP4')은 제2 방향(DR2)을 따라 인접하 게 배치되고, 제1 및 제3 서브 화소들(SP1', SP3')은 제1 방향(DR1)을 따라 인접하게 배치될 수 있다. 제1 내지 제4 서브 화소들(SP1' ~ SP4') 각각은 마름모 구조를 가질 수 있으며, 서로 동일하거나 유사한 면적(또는 크 기)으로 형성될 수 있다. 다만, 본 발명이 이에 한정되는 것은 아니며 제1 내지 제4 서브 화소들(SP1' ~ SP4') 은 서로 상이한 구조를 가질 수 있으며, 상기 제1 내지 제4 서브 화소들(SP1' ~ SP4') 중 일부 서브 화소의 면 적(또는 크기)이 나머지 서브 화소들보다 작거나 또는 클 수 있다. 본 발명의 일 실시예에 있어서, 제1 서브 화소(SP1')는 적색 광(R)을 방출하는 적색 화소일 수 있고, 제2 및 제 4 서브 화소들(SP2', SP4')은 녹색 광(G)을 방출하는 녹색 화소일 수 있고, 제3 서브 화소(SP3)는 청색 광(B)을 방출하는 청색 화소일 수 있으나, 본 발명이 이에 한정되는 것은 아니다. 실시예에 따라, 제1 서브 화소(SP1') 는 녹색 광(G)을 방출하는 녹색 화소이거나 청색 광(B)을 방출하는 청색 화소일 수 있고, 제2 서브 화소(SP2') 는 적색 광(R)을 방출하는 적색 화소이거나 청색 광(B)을 방출하는 청색 화소일 수 있고, 제3 서브 화소(SP3') 는 적색 광(R)을 방출하는 적색 화소이거나 녹색 광(G)을 방출하는 녹색 화소일 수 있으며, 제4 서브 화소 (SP4')는 적색 광(R)을 방출하는 적색 화소이거나 청색 광(B)을 방출하는 청색 화소일 수 있다. 제1 내지 제4 서브 화소들(SP1' ~ SP4') 각각에서 방출되는 광을 조합하여 하나의 제2 화소(PXL2)은 백색 광을 구현할 수 있 다. 상술한 실시예에서는, 제1 내지 제4 서브 화소들(SP1' ~ SP4')이 하나의 제2 화소(PXL2)를 구성하는 것으로 설명하였으나, 본 발명이 이에 한정되는 것은 아니다. 실시예에 따라, 하나의 제2 화소(PXL2)는 2개의 서브 화 소들, 또는 3개의 서브 화소들을 포함하여 구성될 수도 있다. 도 9에서는, 각각의 제2 단위 화소 영역(PXA2)이 마름모 형태를 갖는 것으로 도시되었으나, 본 발명이 이에 한 정되는 것은 아니며, 실시예에 따라 정사각형, 직사각형, 육각형, 팔각형 등 다양한 형태를 가질 수 있다. 실시예에 따라, 하나의 제2 화소(PXL2)는, 도 13에 도시된 바와 같이, 제1 방향(DR1)을 따라 동일한 화소 행에 배열된 제1 내지 제3 서브 화소들(SP1' ~ SP3')을 포함할 수 있다. 제1 내지 제3 서브 화소들(SP1' ~ SP3')은 스트라이프 형태의 배열 구조로 각각의 제2 단위 화소 영역(PXA2)에 배치될 수 있다. 제1 서브 화소(SP1')는 적 색 광(R)을 방출하고, 제2 서브 화소(SP2')는 녹색 광(G)을 방출하며, 제3 서브 화소(SP3')는 청색 광(B)을 방 출할 수 있다. 이러한 경우, 제1 내지 제3 서브 화소들(SP1' ~ SP3')은 직사각형 구조를 가질 수 있으며, 서로 동일하거나 유사한 면적(또는 크기)으로 형성될 수 있다. 또한, 각각의 제2 단위 화소 영역(PXA2)은 정사각 형태를 가질 수 있다. 다른 실시예에 따라, 하나의 제2 화소(PXL2)는 도 14에 도시된 바와 같이, 제1 내지 제4 서브 화소들(SP1' ~ SP4')을 포함할 수 있다. 제1 서브 화소(SP1')는 적색 광(R)을 방출하고, 제2 및 제4 서브 화소들(SP2', SP 4')은 녹색 광(G)을 방출하며, 제3 서브 화소(SP3')는 청색 광(B)을 방출할 수 있다. 상술한 제1 내지 제4 서브 화소들(SP1' ~ SP4') 중 제1 및 제3 서브 화소들(SP1', SP3')은 제2 표시 영역(A2)에서 제2 방향(DR2, 일 예로, '열 방향')으로 반복적으로 배치되어 하나의 화소 열을 이룰 수 있고, 제2 및 제4 서브 화소들(SP2', SP4')은 상기 제2 표시 영역(A2)에서 제2 방향(DR2)으로 반복적으로 배치되어 하나의 다른 화소 열을 이룰 수 있다. 이러한 제1 내지 제4 서브 화소들(SP1' ~ SP4')은 펜타일 형태의 배열 구조를 이룰 수 있다. 상술한 실시 예에서는, 제4 서브 화소(SP4')가 녹색 광(G)을 방출하는 것으로 설명하였으나, 본 발명이 이에 한정되는 것은 아니다. 다른 실시예에 따라, 제4 서브 화소(SP4')는 도 15에 도시된 바와 같이 백색 광(W)을 방출할 수도 있다. 제4 서브 화소(SP4')가 백색 광(W)을 방출하는 경우, 녹색 광(G)을 방출하는 제2 서브 화소(SP2')와 상기 제4 서브 화소(SP4')는 제2 방향(DR2)을 따라 반복적으로 배치되어 하나의 화소 열을 이룰 수 있다. 제1 내지 제4 서브 화소들(SP1' ~ SP4') 각각은 적어도 하나의 트랜지스터를 포함한 화소 회로부(430a) 및 발광 소자(OLED)를 포함하는 표시 소자부(430b)를 포함할 수 있다. 제1 내지 제4 서브 화소들(SP1' ~ SP4')은 실질적 으로 유사하거나 동일한 구조를 가질 수 있다. 이에, 제2 내지 제4 서브 화소들(SP2' ~ SP4')에 포함된 구성에 대한 설명은 도 10을 참조하여 제1 서브 화소(SP1')의 구성에 대한 설명으로 대신하기로 한다. 제1 서브 화소(SP1')는 기판, 상기 기판 상에 제공된 적어도 하나의 트랜지스터를 구비한 화소 회로 (도 7의 PXC 참고)를 포함한 화소 회로부(430a), 및 상기 화소 회로부(430a) 상에 제공된 표시 소자부(430b), 및 박막 봉지막을 포함할 수 있다. 여기서, 박막 봉지막은 도 8에 도시된 제1 표시 영역(A1)의 박막 봉지막과 동일한 구성이다. 도 10에서는, 도시의 편의를 위하여 발광 소자(OLED)를 구동하는 구동 트랜지 스터(T)만을 도시하였다. 도 10의 구동 트랜지스터(T)는 도 7의 제1 트랜지스터(T1)와 동일한 구성이다. 화소 회로부(430a)는 구동 트랜지스터(T) 및 적어도 하나 이상의 절연막을 포함할 수 있다. 여기서, 절연막은 기판 상에 순차적으로 적층된 버퍼막, 게이트 절연막, 층간 절연막, 및 보호막을 포 함할 수 있다. 여기서, 버퍼막, 게이트 절연막, 층간 절연막, 및 보호막은 도 8에 도시된 제1 표시 영역(A1)의 버퍼막, 게이트 절연막, 층간 절연막, 및 보호막과 동일한 구성이다. 구동 트랜지스터(T)는 반도체층(SCL), 게이트 전극(GE), 제1 및 제2 단자들(SE, DE)을 포함하며, 도 8에 도시된 제1 표시 영역(A1)의 제2 및 제6 트랜지스터들(T2, T6)과 동일한 구조의 박막 트랜지스터로 이루어질 수 있다. 표시 소자부(430b)는 제1 전극(AE), 발광층(EML), 및 제2 전극(CE)을 포함한 발광 소자(OLED)를 포함할 수 있다. 여기서, 발광층(EML)은 적색 광(R)을 방출할 수 있다. 제1 서브 화소(SP1')의 발광 영역(EMA)은 적색 광 (R)이 방출되는 영역으로, 화소 정의막의 개구부에 의해 노출된 제1 전극(AE)의 일부 영역 또는 발광층 (EML)에 대응되게 정의(또는 구획)될 수 있다. 각각의 투과 영역(TA)은 제2 화소(PXL2)가 배치되지 않는 영역으로, 투과창(또는 투명창)일 수 있다. 즉, 각각 의 투과 영역(TA)은 제2 화소(PXL2)에 포함된 화소 회로부(430a)의 일부 구성(일 예로, 화소 회로(도 7의 PXC 참고)) 및 표시 소자부(430b)의 일부 구성(일 예로, 발광 소자(OLED))이 제거된 영역일 수 있다. 화소 회로부 (430a) 및 표시 소자부(430b) 각각의 일부 구성이 제거됨에 따라, 각각의 투과 영역(TA)에는 화소 회로부(430 a)에 포함된 구성들 사이, 표시 소자부(430b)에 포함된 구성들 사이에 마련되는 절연막만이 배치될 수 있다. 다 시 말해, 각각의 투과 영역(TA)은 제1 내지 제4 서브 화소들(SP1' ~ SP4')에 포함된 구성 요소들, 일 예로, 화 소 회로부(430a) 및 표시 소자부(430b)를 배치하지 않는(또는 구비하지 않는) 방식으로 제공될 수 있다. 각각의 투과 영역(TA)은 도 10에 도시된 바와 같이, 기판 상에 순차적으로 적층된 버퍼막, 게이트 절 연막, 층간 절연막, 보호막, 화소 정의막, 및 박막 봉지막만이 배치되어 입사되는 광 을 투과시키는 투과창으로 기능할 수 있다. 특히, 각각의 투과 영역(TA)은 광 투과율에 가장 큰 영향을 미칠 수 있는 제2 전극(CE)이 제거된 영역일 수 있다. 이러한 경우, 제2 전극(CE)은 제2 표시 영역(A2) 내에서 선택적으 로 제공될 수 있다. 즉, 제2 전극(CE)은 제2 단위 화소 영역들(PXA2)에만 제공되고, 투과 영역들(TA)에는 제공 되지 않을 수 있다. 실시예에 따라, 각각의 투과 영역(TA)에 배치되는 화소 회로부(430a) 및 표시 소자부(430b) 각각에 포함된 전극들 중 일부가 투명한 전극으로 형성되고, 나머지 일부가 불투명한 전극으로 형성되는 경우, 투과 영역(TA)은 불투명한 전극만이 제거된 영역일 수 있다. 본 발명의 일 실시예에 있어서, 제1 표시 영역(A1)에 위치한 제2 전극(CE)과 제2 표시 영역(A2)에 위치한 제2 전극(CE)은 전기적 및/또는 물리적으로 서로 연결될 수 있다. 실시예에 따라, 각각의 투과 영역(TA)은 도 11에 도시된 바와 같이, 상기 각각의 투과 영역(TA)을 지나는 광이 손실없이 관통되게 하기 위한 개구부(OPN)를 포함할 수 있다. 본 발명의 일 실시예에 있어서, 개구부(OPN)는 각 각의 투과 영역(TA)에 대응되는 절연막의 일부를 제거하는 방식으로 형성될 수 있다. 예를 들어, 개구부(OPN)는 각각의 투과 영역(TA)에서 층간 절연막, 보호막, 및 화소 정의막이 제거됨으로써 형성될 수 있 다. 그러나, 개구부(OPN)를 형성하기 위해 제거되는 절연막들은 상술한 예에 한정되는 것은 아니다. 예를 들어, 게이트 절연막이나 버퍼막도 제거되어 개구부(OPN)를 형성할 수 있음은 물론이다. 투과 영역들(TA) 각각에 개구부(OPN)가 형성될 경우, 박막 봉지막은 상기 개구부(OPN) 내부를 채우는 형태 로 제공될 수 있다. 이러한 경우, 박막 봉지막은 개구부(OPN)를 관통하는 광의 손실을 최소화하기 위해 광 을 투과시키는 재료(또는 물질)로 이루어질 수 있다. 실시예에 따라, 투과 영역들(TA) 각각에 개구부(OPN)가 형 성될 경우, 중간층이 상기 개구부(OPN)를 채우는 형태로 제공될 수 있다. 일 예로, 중간층은 개구부 (OPN)를 통과하는(또는 관통하는) 광의 손실을 최소화하기 위해 상기 개구부(OPN)를 채우는 에어(air) 층일 수 있다. 또한, 실시예에 따라, 중간층은 개구부(OPN)를 통과하는 광의 손실을 최소화하면서 상기 개구부 (OPN)에 의해 노출된 절연막, 일 예로, 게이트 절연막과 박막 봉지막 사이의 접착력을 강화하기 위한 투명한 점착층(또는 접착층), 일 예로, 광학용 투명 접착층(Otically Clear Adhesive)일 수 있다. 중간층(43 7)의 재료는 상술한 실시예에 한정되는 것은 아니며, 투과 영역들(TA)을 통과하는(또는 관통하는) 광의 손실을 최소하는 재료들 중 다양하게 선택될 수 있다. 상술한 바와 같이, 제2 표시 영역(A2)은 제2 화소들(PXL2)이 배치되지 않는 투과 영역들(TA)을 포함함에 따라 제1 표시 영역(A1)에 비하여 단위 면적 당 광 투과율이 상대적으로 높을 수 있다. 제2 표시 영역(A2)은 기판의 하부에 배치되며 광을 수신하거나 광을 방출하는 부품과 중첩할 수 있다. 제2 표시 영역(A2)에 광을 투과하는 복수 개의 투과 영역들(TA)이 제공됨에 따라, 상기 제2 표시 영역 (A2)에 대응되게 배치되는 부품으로 입사되는 광의 양(또는 세기)이 증가하여 상기 부품의 센싱 능력 (또는 센싱 정확도, 인식률)이 향상될 수 있다. 제2 표시 영역(A2)에서 제2 화소들(PXL2)은 제2 밀도로 배치될 수 있다. 제2 밀도는 제2 표시 영역(A2)의 전체 면적 대비 광을 투과하는 투과 영역인 제2 서브 영역들(SA2)이 배치되는 면적을 제외한 면적의 비율일 수 있다. 제2 밀도는 제1 표시 영역(A1)에 배치된 제1 화소들(PXL1)의 밀도인 제1 밀도보다 작을 수 있다. 제2 밀도는 제 2 표시 영역(A2)의 단위 면적 당 제2 화소들(PXL2)의 총 개수(pixel per inch, PPI)로 정의될 수 있다. 제2 표시 영역(A2)에서 화소들(PXL)의 밀도가 제1 표시 영역(A1)에서보다 작아짐에 따라, 제2 표시 영역(A2)에 서 표시되는 영상은 제1 표시 영역(A2)에서 표시되는 영상보다 상대적으로 어둡게(즉, 휘도가 낮게) 시인될 수 있다. 이러한 문제를 해결하기 위하여, 본 발명의 일 실시예에서는 제2 표시 영역(A2)에 배치되는 제2 화소들 (PXL2) 각각에 포함된 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)을 제1 표시 영역(A1)에 배치되는 제1 화소 들(PXL1) 각각에 포함된 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)보다 크게 설계할 수 있다. 일 예로, 제2 표 시 영역(A2)에 배치되는 서브 화소들(SP1' ~ SP4') 각각의 발광 영역의 면적(또는 크기)을 제1 표시 영역(A1)에 배치되는 서브 화소들(SP1 ~ SP4) 각각의 발광 영역의 면적(또는 크기)보다 상대적으로 크게 설계할 수 있다. 제1 표시 영역(A1)과 제2 표시 영역(A2) 사이에서의 급격한 화소들(PXL)의 밀도 변화 및 휘도 변화는 사용자에 게 영상의 불연속으로 시인될 수 있다. 이에, 본 발명에서는 제2 표시 영역(A2)에 배치되는 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)을 제1 표시 영역(A1)에 배치되는 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)보다 크게 설계하여 제2 표시 영역(A2)의 서브 화소들(SP1' ~ SP4') 각각에서 방출되는 광의 양(또는 세기)을 더욱 확보하 여 제1 및 제2 표시 영역들(A1, A2) 사이의 경계 영역에서 발생하는 휘도 차이를 최소화할 수 있다. 이하에서는, 상술한 본 발명의 기술적 특징을 보다 구체적으로 설명한다. 도 16은 도 4a의 EA1 부분을 확대한 개략적인 평면도이고, 도 17은 도 16의 EA2 부분을 확대한 개략적인 평면도 이고, 도 18은 도 17의 Ⅲ ~ Ⅲ'선에 따른 단면도이며, 도 19는 도 18의 투과 영역을 다른 실시예에 따라 구현 한 것으로, 도 17의 Ⅲ ~ Ⅲ'선에 대응되는 단면도이다. 도시의 편의를 위하여, 도 18 및 도 19에서는, 각각의 제1 단위 화소 영역(PXA1)에 제공된 화소 회로부(430a) 중 발광 소자(OLED)에 전기적으로 연결된 구동 트랜지스터(DT1) 및 각각의 제2 단위 화소 영역(PXA2)에 제공된화소 회로부(430a) 중 발광 소자(OLED)에 전기적으로 연결된 구동 트랜지스터(DT2)만을 도시하였다. 상술한 구 동 트랜지스터들(DT1, DT2) 각각은 도 7을 참조하여 설명한 제1 트랜지스터(T1)와 동일한 구성일 수 있다. 도 1 내지 도 19를 참조하면, 표시 영역(DA)은 제1 방향(DR1)을 따라 연장된 가상의 선(VL)을 기준으로 구획된 제1 표시 영역(A1)과 제2 표시 영역(A2)을 포함할 수 있다. 제1 표시 영역(A1)은 각각의 제1 화소(PXL1)가 배치된 복수의 제1 단위 화소 영역들(PXA1)을 포함할 수 있다. 제2 표시 영역(A2)은 각각의 제2 화소(PXL2)가 배치된 복수의 제2 단위 화소 영역들(PXA2)과 상기 각각의 제2 화소(PXL2)가 배치되지 않는 복수의 투과 영역들(TA)을 포함할 수 있다. 각각의 투과 영역(TA)에는 배선부가 위치할 수 있다. 배선부는 각각의 투과 영역(TA)을 사이에 두고 인접한 제2 단위 화소 영역들(PXA2)을 전기적 및/또는 물리적으로 연결하는 구성일 수 있다. 이러한 배선부 는 화소 회로부 내에서 서로 상이한 층에 위치한 복수의 도전 라인들을 포함할 수 있다. 배선부(43 8)는 각각의 투과 영역(TA)을 관통하는(또는 통과하는) 광의 손실을 최소화하기 위하여, 인접한 제2 단위 화소 영역들(PXA2) 각각에 인접하게 우회시켜 배치될 수 있다. 각각의 투과 영역(TA)은 도 19에 도시된 바와 같이, 부품으로 입사되는 광의 양을 더욱 확보하기 위한 개 구부(OPN)를 포함할 수 있다. 상기 개구부(OPN)는 도 11을 참고하여 설명한 개구부(OPN)와 동일할 수 있다. 개 구부(OPN)는 중간층으로 채워질 수 있다. 제1 단위 화소 영역들(PXA1) 중 일부는 제1 표시 영역(A1)과 제2 표시 영역(A2) 사이에 걸쳐 제공될 수 있으나, 본 발명이 이에 한정되는 것은 아니다. 실시예에 따라, 제1 단위 화소 영역들(PXA1)은 제1 표시 영역(A1)에만 제공되어 제2 표시 영역(A2)에는 제공되지 않을 수 있다. 하나의 제1 화소(PXL1)는 제1 내지 제4 서브 화소들(SP1, SP2, SP3 SP4)을 포함하고, 하나의 제2 화소(PXL2)는 제1 내지 제4 서브 화소들(SP1', SP2', SP3', SP4')을 포함할 수 있다. 하나의 제1 화소(PXL1)의 제1 내지 제4 서브 화소들(SP1 ~ SP4)과 하나의 제2 화소(PXL2)의 제1 내지 제4 서브 화소들(SP1' ~ SP4')은 기판, 화 소 회로(도 7의 PXC 참고)를 포함한 화소 회로부(430a), 및 발광 소자(OLED)를 포함한 표시 소자층(430b)을 포 함할 수 있다. 본 발명의 일 실시예에 있어서, 하나의 제1 화소(PXL1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4)은 제1 단위 화소 영역(PXA1) 내에서 서로 이격되게 배치될 수 있다. 이때, 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각 은 인접한 서브 화소들과 이격될 수 있다. 일 예로, 상기 제1 단위 화소 영역(PXA1) 내에서 인접한 서브 화소들 은 제1 폭(W1)의 간격을 두고 이격될 수 있다. 하나의 제1 단위 화소 영역(PXA1) 내에서 인접한 서브 화소들 사 이의 간격은 도 8을 참고하여 설명한 광이 방출되지 않는 영역, 즉, 비발광 영역(NEMA)일 수 있다. 하나의 제2 화소(PXL2)에 포함된 제1 내지 제4 서브 화소들(SP1' ~ SP4')은 제2 단위 화소 영역(PXA2) 내에서 서로 이격되게 배치될 수 있다. 이때, 제1 내지 제4 서브 화소들(SP1' ~ SP4') 각각은 인접한 서브 화소들과 이 격될 수 있다. 일 예로, 상기 제2 단위 화소 영역(PXA2) 내에서 인접한 서브 화소들은 제1 폭(W1)보다 좁은 제2 폭(W2)의 간격으로 이격될 수 있다. 하나의 제2 단위 화소 영역(PXA2) 내에서 인접한 서브 화소들 사이의 간격 은 광이 방출되지 않는 비발광 영역(NEMA)일 수 있다. 본 발명의 일 실시예에 있어서, 제2 단위 화소 영역들(PXA2) 각각의 비발광 영역(NEMA)의 면적(또는 크기)은 제 1 단위 화소 영역들(PXA1) 각각의 비발광 영역(NEMA)의 면적(또는 크기)보다 작을 수 있다. 즉, 하나의 제2 단 위 화소 영역(PXA2)의 발광 영역(EMA)의 면적(또는 크기)은 하나의 제1 단위 화소 영역(PXA1)의 발광 영역(EM A)의 면적(또는 크기)보다 클 수 있다. 이하의 실시예에서는, 설명의 편의를 위하여, 각각의 제2 단위 영역(PXA2)에 제공된 제1 서브 화소(SP1')를 제 2-1 서브 화소(SP1')로 명명하고, 제2 서브 화소(SP2')를 제2-2 서브 화소(SP2')로 명명하고, 제3 서브 화소 (SP3')를 제2-3 서브 화소(SP3')로 명명하며, 제4 서브 화소(SP4')를 제2-4 서브 화소(SP4')로 명명한다. 각각의 제2 단위 화소 영역(PXA2) 내에서 제2-1 내지 제2-4 서브 화소들(SP1' ~ SP4')은 서로 동일한 면적(또는 크기)을 가질 수 있다. 또한, 하나의 제1 단위 화소 영역(PXA1) 내에서 제1 내지 제4 서브 화소들(SP1 ~ SP4)은 서로 동일한 면적(또는 크기)을 가질 수 있다. 본 발명의 일 실시예에 있어서, 제2-1 내지 제2-4 서브 화소들(SP1' ~ SP4') 각각의 면적(또는 크기)은 각각의 제1 화소(PXL1)의 제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각의 면적(또는 크기)보다 크게 설계될 수 있다. 즉, 제2-1 내지 제2-4 서브 화소들(SP1' ~ SP4') 각각의 발광 영역의 면적(또는 크기)은 각각의 제1 화소(PXL1)의제1 내지 제4 서브 화소들(SP1 ~ SP4) 각각의 발광 영역의 면적(또는 크기)보다 크게 설계될 수 있다. 도 18에 도시된 바와 같이, 하나의 제2 단위 화소 영역(PXA2) 내에서 적색 광(R)을 방출하는 제2-1 서브 화소 (SP1')의 발광 영역(EMA)의 면적(또는 크기)은 하나의 제1 단위 화소 영역(PXA1) 내에서 녹색 광(G)을 방출하는 제2 서브 화소(SP2)의 발광 영역(EMA)의 면적(또는 크기)보다 크게 설계될 수 있다. 제2-1 서브 화소(SP1')에서 화소 정의막의 개구부에 의해 노출된 제1 전극(AE, 애노드 전극)의 면적(또는 크기)이 제2 서브 화소(SP2)에서 화소 정의막의 개구부에 의해 노출된 제1 전극(AE, 애노드 전극)의 면적 (또는 크기)보다 크게 설계되는 경우, 상기 제2-1 서브 화소(SP1')의 발광 영역(EMA)의 면적(또는 크기)이 제2 서브 화소(SP2)의 발광 영역(EMA)의 면적(또는 크기)보다 클 수 있다. 제2-1 서브 화소(SP1')의 발광 영역(EM A)의 면적(또는 크기)이 제2 서브 화소(SP2)의 발광 영역(EMA)의 면적(또는 크기)보다 클 때 동일한 영상 데이 터에 대하여 상기 제2-1 서브 화소(SP1')가 상기 제2 서브 화소(SP2)보다 상대적으로 높은 휘도로 발광되도록 제어하면, 상기 제2-1 서브 화소(SP1')의 발광 영역(EMA)에서 방출되는 광의 양(또는 세기)이 제2 서브 화소 (SP2)의 발광 영역(EMA)에서 방출되는 광의 양(또는 세기)보다 많을 수 있다. 이러한 경우, 제2 표시 영역(A2)이, 광을 방출하지 않으면서 제2 화소들(PXL2)에서 방출되는 광을 그 하부에 배 치된 부품으로 투과시키는 복수 개의 투과 영역들(TA)을 포함하더라도, 제1 표시 영역(A1)과 상기 제2 표 시 영역(A2) 각각에서 동일한 면적(또는 단위 면적, 기 설정된 면적) 당 방출되는 광의 양은 실질적으로 유사하 거나 동일해질 수 있다. 이에 따라, 제1 표시 영역(A1)과 제2 표시 영역(A2)에서 화소들(PXL)의 밀도 차이로 인 하여 발생하는 상기 제1 및 제2 표시 영역들(A1, A2) 사이에서의 휘도 차이가 줄어들 수 있다. 결국, 표시 패널 의 영상 품질이 향상될 수 있다. 한편, 각각의 제2 화소(PXL2)에 포함된 제1 내지 제4 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)이 각각의 제 1 화소(PXL1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)과 동일하게 설계할 될 수 있다. 이러한 경우, 제1 표시 영역(A1)과 제2 표시 영역(A2) 사이에서 발생하는 휘도 차이를 보상하기 위해 상 기 제2 화소들(PXL2)에 과도한 전류를 공급하여 상기 제2 화소들(PXL2)을 상기 제1 화소들(PXL1)보다 매우 높은 휘도로 발광되도록 제어할 수 있다. 제2 화소들(PXL2)에 과도한 전류가 지속적으로 공급되면, 상기 제2 화소들 (PXL2) 각각에 포함된 발광층(EML)이 빠르게 열화되어 상기 발광층(EML)을 포함한 발광 소자(OLED)의 수명이 짧 아질 수 있다. 이에, 본 발명에서는, 각각의 제2 화소(PXL2)에 포함된 제1 내지 제4 서브 화소들(SP1' ~ SP4') 의 면적(또는 크기)을 각각의 제1 화소(PXL1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)보다 크게 설계함으로써, 동일한 영상 데이터에 대하여 상기 제1 화소들(PXL1)보다 상기 제2 화소들(PXL 2)에서 방출되는 광을 더욱 확보함으로써 상기 제2 화소들(PXL2)에 포함된 발광층(EML)의 열화를 최소화할 수 있다. 각각의 제1 화소(PXL1) 및 각각의 제2 화소(PXL2)에 포함된 발광 소자들(OLED)의 수명은 다음의 수식을 통해 예 측될 수 있다."}
{"patent_id": "10-2019-0160038", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서, τ0는 기준 수명을 의미하고, L0는 기준 초기 휘도를 의미하고, τ1는 수명을 의미하고, L1은 초기 휘도 를 의미하며, acc는 가속 계수를 의미할 수 있다. 가속 계수는 기타 조건(일 예로, 온도, 소자 특성, 및 재료 특성)을 나타낼 수 있다. 기준 수명은, 예를 들어, 개구율이 100%인 화소(PXL)의 수명일 수 있으며, 설명의 편 의를 위하여 기준 수명은 1000이라고 가정한다. 즉, 개구율이 100%인 화소(PXL)의 수명(τ0)이 1000일 수 있다. 예를 들어, 각각의 제2 화소(PXL2)에 포함된 제1 내지 제4 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)이 각각 의 제1 화소(PXL1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)과 동일할 때, 하나의 제2 화소(PXL2)가 배치된 제2 단위 화소 영역(PXA2)과 그에 인접한 투과 영역(TA)에서의 개구율은 하나의 제1 화소 (PXL1)가 배치된 제1 단위 화소 영역(PXA1)의 개구율의 절반 정도일 수 있다. 일 예로, 제1 단위 화소 영역 (PXA1)의 개구율이 20%이면, 제2 단위 화소 영역(PXA2)과 그에 인접한 투과 영역(TA)의 개구율은 10%일 수 있다. 상기 제1 화소(PXL1)와 상기 제2 화소(PXL2) 각각에서 요구되는 휘도가 100 cd/㎡인 경우, 상기 제1 화소(PXL 1)의 실제 휘도는 500 cd/㎡가 되고, 상기 제2 화소(PXL2)의 실제 휘도는 1000 cd/㎡가 될 수 있다. 이때, 상기 제1 화소(PXL1)의 수명을 상술한 수식에 따라 계산하면, 상기 제1 화소(PXL1)의 수명은 1000*(0.2)1.8 일 수 있다. 또한, 상기 제2 화소(PXL2)의 수명을 상술한 수식에 따라 계산하면, 상기 제2 화소(PXL2)의 수명은 1000*(0.1)1.8 일 수 있다. 상기 제1 화소(PXL1)의 수명을 100%라고 할 때 상기 제2 화소(PXL2)의 수명은 28.70% 가 될 수 있다. 상술한 바와 같이, 상기 제1 화소(PXL1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4)의 면적 (또는 크기)과 상기 제2 화소(PXL2)에 포함된 제1 내지 제4 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)이 동 일한 경우 상기 제2 화소(PXL2)의 수명이 상기 제1 화소(PXL1)의 수명에 비하여 상대적으로 짧아질 수 있다. 만일, 상기 제2 화소(PXL2)에 포함된 제1 내지 제4 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)이 상기 제1 화 소(PXL1)에 포함된 제1 내지 제4 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)의 2배일 때, 상기 제2 화소(PXL2) 가 배치된 제2 단위 화소 영역(PXA2)과 그에 인접한 투과 영역(TA)에서의 개구율은 상기 제1 화소(PXL1)가 배치 된 제1 단위 화소 영역(PXA1)의 개구율과 동일할 수 있다. 이러한 경우, 상기 제2 화소(PXL2)의 수명은 상기 제 1 화소(PXL1)의 수명과 동일할 수 있다. 상기 제1 및 제2 화소들(PXL1, PXL2) 각각의 수명에는 여러 요인이 복합적으로 작용할 수 있지만, 주요 요인인 개구율이 증가할 경우 각 화소(PXL)에 포함된 발광 소자(OLED)의 발광층(EML)에 걸리는 전류 밀도가 감소할 수 있다. 특히, 제2 표시 영역(A2)에 위치한 제2 화소(PXL2)의 개구율이 증가할 경우, 상기 제2 화소(PXL2)에 포함 된 발광 소자(OLED)의 발광층(EML)에 걸리는 전류 밀도가 감소하여 초기 휘도가 낮아지고, 상기 발광층(EML)의 열화가 감소될 수 있다. 이에, 상기 제2 화소(PXL2)의 수명이 향상될 수 있다. 도 20 내지 도 23은 본 발명의 일 실시예에 따른 제1 및 제2 표시 영역들, 제1 및 제2 화소들을 다른 실시예에 따라 나타낸 것으로, 도 4a의 EA1 영역에 대응되는 확대 평면도이다. 도 20 내지 도 23의 제1 및 제2 표시 영역들과 관련하여, 중복된 설명을 피하기 위하여 상술한 일 실시예와 상 이한 점을 위주로 설명한다. 본 발명에서 특별히 설명하지 않는 부분은 상술한 일 실시예에 따르며, 동일한 번 호는 동일한 구성 요소를, 유사한 번호는 유사한 구성 요소를 나타낸다. 도 1 내지 도 15, 및 도 20 내지 도 23을 참조하면, 표시 영역(DA)은 제1 방향(DR1)을 따라 연장된 가상의 선 (VL)을 기준으로 구획된 제1 표시 영역(A1)과 제2 표시 영역(A2)을 포함한다. 제1 표시 영역(A1)에는 제1 화소 들(PXL1)이 제공될 수 있다. 제2 표시 영역(A2)은 각각의 제2 화소(PXL2)가 마련된(또는 제공된) 복수 개의 제2 단위 화소 영역들(PXA2)과 상기 제2 화소(PXL2)이 마련되지 않는(또는 제공되지 않는) 복수 개의 투과 영역들(TA)을 포함할 수 있다. 각각 의 제2 화소(PXL2)는 적어도 하나 이상의 서브 화소들(SP1' ~ SP4')을 포함할 수 있고, 각각의 제1 화소(PXL1) 는 적어도 하나 이상의 서브 화소들(SP1 ~ SP4)을 포함할 수 있다. 본 발명의 일 실시예에 있어서, 각각의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')은 각각의 제1 화소 (PXL1)에 포함된 서브 화소들(SP1 ~ SP4)보다 면적(또는 크기)이 상대적으로 크게 설계될 수 있다. 일 예로, 각 각의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')은 각각의 제1 화소(PXL1)에 포함된 서브 화소들(SP1 ~ SP4)보다 적어도 2배 이상의 면적(또는 크기)를 갖도록 설계될 수 있다. 다만, 본 발명이 이에 한정되는 것은 아니며, 실시예에 따라, 각각의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')의 면적(또는 크기)은 각각 의 제1 화소(PXL1)에 포함된 서브 화소들(SP1 ~ SP4)의 면적(또는 크기)보다 상대적으로 크고 제2 표시 영역 (A2) 내에서 인접한 서브 화소들과 일정 간격을 두고 이격되게 배치될 수 있는 범위 내에서 다양한 크기를 갖도 록 설계될 수 있다. 실시예에 따라, 각각의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')은, 도 22에 도시된 바와 같이, 제1 표시 영역(A1)과 제2 표시 영역(A2) 사이의 경계에 위치한 가상의 선(VL)에 인접할수록 면적(또는 크기)이 점진 적으로 커지도록 설계될 수 있다. 이때, 하나의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')의 면적(또 는 크기) 또한, 실시예에 따라, 각각의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')은, 도 23에 도시된 바와 같이, 상기 가상의 선(VL)에 인접할수록 면적(또는 크기)이 점진적으로 작아지도록 설계될 수 있다. 또한, 다른 실시예에 따라, 각각의 제2 화소(PXL2)에 포함된 서브 화소들(SP1' ~ SP4')은, 특정 방향, 일 예로, 제1 내지 제3 방향들(DR1 ~ DR3) 중 어느 한 방향을 따라 면적(또는 크기)이 점진적으로 커지거나 작아지도록 설계 될 수 있다. 도 20에 도시된 바와 같이, 제2 단위 화소 영역들(PXA2)은 제2 표시 영역(A2) 내에서 제2 방향(DR2)을 따라 반 복적으로 배열되는 적어도 하나의 열을 구성하고, 투과 영역들(TA)은 상기 제2 표시 영역(A2) 내에서 상기 제2방향(DR2)과 직교하는 제1 방향(DR1)을 따라 반복적으로 배열되는 하나의 행을 구성할 수 있다. 또한, 제2 단위 화소 영역들(PXA2)은 제2 표시 영역(A2) 내에서 제1 방향(DR1)을 따라 반복적으로 배열되는 적어도 하나의 다른 행을 구성하고, 투과 영역들(TA)은 상기 제2 표시 영역(A2) 내에서 상기 제1 방향(DR1)과 직교하는 제2 방향 (DR2)을 따라 반복적으로 배열되는 하나의 다른 열을 구성할 수 있다. 상기 하나의 열과 상기 하나의 다른 열은 서로 교번하여 배치되고, 상기 하나의 행과 상기 하나의 다른 행은 서로 교번하여 배치될 수 있다. 일 예로, 하 나의 제2 단위 화소 영역(PXA2)과 하나의 투과 영역(TA)은 제2 표시 영역(A2) 내에서 서로 교번하여 배치될 수 있다. 실시예에 따라, 제2 단위 화소 영역들(PXA2)은, 도 21에 도시된 바와 같이, 제2 표시 영역(A2) 내에서 제2 방향 (DR2)을 따라 반복적으로 배열되어 제1 열을 구성하고, 투과 영역들(TA)은 상기 제2 방향(DR2)을 따라 반복적으 로 배열되어 제2 열을 구성할 수 있다. 상기 제1 열과 상기 제2 열은 상기 제2 표시 영역(A2) 내에서 제1 방향 (DR1)을 따라 서로 교번하여 배치될 수 있다. 평면에서 볼 때, 제2 단위 화소 영역들(PXA2)과 투과 영역들(TA) 은 수직 방향(일 예로, 제2 방향(DR2))으로 연속성을 가질 수 있다. 다른 실시예에 따라, 제2 단위 화소 영역들(PXA2)은, 제2 표시 영역(A2) 내에서 제1 방향(DR1)을 따라 반복적으 로 배열되어 제1 행을 구성하고, 투과 영역들(TA)은 상기 제1 방향(DR1)을 따라 반복적으로 배열되어 제2 행을 구성할 수 있다. 상기 제1 행과 상기 제2 행은 상기 제2 표시 영역(A2) 내에서 제2 방향(DR2)을 따라 교번하여 배치될 수 있다. 평면에서 볼 때, 제2 단위 화소 영역들(PXA2)과 투과 영역들(TA)은 수평 방향(일 예로, 제1 방 향(DR1))으로 연속성을 가질 수 있다. 이상에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자 또는 해당 기술 분야에 통상의 지식을 갖는 자라면, 후술될 특허청구범위에 기재된 본 발명의 사상 및 기술 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 따라서, 본 발명의 기술적 범위는 명세서의 상세한 설명에 기재된 내용으로 한정되는 것이 아니라 특허청구범위 에 의해 정하여져야만 할 것이다."}
{"patent_id": "10-2019-0160038", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예에서의 네트워크 환경 내의 전자 장치를 도시한 블록도이다. 도 2는 다양한 실시예에 따른 전자 장치의 블록도이다. 도 3a는 다양한 실시예에 따른 전자 장치의 전면을 간략히 나타내는 사시도이다. 도 3b는 도 3a의 전자 장치의 후면을 간략히 나타내는 사시도이다. 도 4a 및 도 4b는 본 발명의 일 실시예에 따른 전자 장치를 간략히 나타내는 평면도들이다. 도 5는 도 4a의 Ⅰ ~ Ⅰ'선에 따른 단면도이다. 도 6은 본 발명의 일 실시예에 따른 제1 표시 영역을 개략적으로 나타낸 평면도이다. 도 7은 도 6의 제1 서브 화소에 포함된 구성 요소들의 전기적 연결 관계를 일 실시예에 따라 나타낸 회로도이다. 도 8은 도 5의 표시 패널의 개략적인 단면도이다. 도 9는 본 발명의 일 실시예에 따른 제2 표시 영역을 개략적으로 나타낸 평면도이다. 도 10은 도 9의 Ⅱ ~ Ⅱ'선에 따른 단면도이다. 도 11은 도 10의 투과 영역을 다른 실시예에 따라 구현한 것으로, 도 9의 Ⅱ ~ Ⅱ'선에 대응되는 단면도이다. 도 12 내지 도 15는 본 발명의 일 실시예에 따른 제2 표시 영역을 다른 실시예에 따라 나타낸 개략적인 평면도 들이다. 도 16은 도 4a의 EA1 부분을 확대한 개략적인 평면도이다. 도 17은 도 16의 EA2 부분을 확대한 개략적인 평면도이다. 도 18은 도 17의 Ⅲ ~ Ⅲ'선에 따른 단면도이다. 도 19는 도 18의 투과 영역을 다른 실시예에 따라 구현한 것으로, 도 17의 Ⅲ ~ Ⅲ'선에 대응되는 단면도이다. 도 20 내지 도 23은 본 발명의 일 실시예에 따른 제1 및 제2 표시 영역들, 제1 및 제2 화소들을 다른 실시예에 따라 나타낸 것으로, 도 4a의 EA1 영역에 대응되는 확대 평면도이다."}
