{"patent_id": "10-2024-0098095", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0118047", "출원번호": "10-2024-0098095", "발명의 명칭": "전력 설비를 위한 딥러닝 화재 감시 시스템", "출원인": "한국전력공사", "발명자": "조재운"}}
{"patent_id": "10-2024-0098095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전력선의 단선사고로 인한 화재 발생 여부를 영상에 대한 딥러닝 모델로 감시/분석하는 화재 감시시스템으로서,전력 설비 및 인근 영역에 대한 촬영 영상에서 화재 발생 여부 및 상기 전력 설비와의 관련성을 판정하는 화재영상 감시 모듈; 상기 전력 설비의 단선 상태를 모니터링하는 단선 감시 모듈; 및 상기 화재 발생 여부의 판정 및 상기 단선 상태로부터 상기 전력 설비에 대한 화재 관련 위험 요인들을 판단하여, 상기 전력 설비에 대한 화재 관련 위험 요인들을 경보하는 화재 위험 경보 장치를 포함하되,상기 단선 감시 모듈은, 상기 전력 설비에 대한 영향을 받는 범위에 있는 AMI 계기들의 동작을 주기적으로 확인하여 상기 전력 설비에관련된 단선 여부를 판정하는 방안으로서,상기 AMI 계기들이 계량 데이터 전송 주기(고압 15분, 저압 60분임)와 별도로, AMI 서버에 소정의 송신 주기(수십초임)로 송신하는 소용량의 모뎀의 상태 정보인 Alive 메시지에 대한 전송 실패 횟수가 임계 개수로 누적되어카운트되면 단선으로 인식하고,상기 화재 영상 감시 모듈은,연기, 불꽃 등과 같은 화재 요소와 전주, 변압기, 애자, 전선과 같은 전력설비 이미지를 훈련 데이터로 학습한딥러닝 모델을 이용하여 발화점의 위치와 전력설비 근접 여부를 추정하는 전력 설비를 위한 딥러닝 화재 감시시스템."}
{"patent_id": "10-2024-0098095", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 화재 영상 감시 모듈은,상기 촬영 영상에서 빛 반사를 포함하는 노이즈를 제거하는 전처리 과정; 또는, 연속된 프레임의 차영상을 통해서 연기로 오탐지 가능성이 큰 구름 및 안개를 제거하는 과정 을 수행하는 전력 설비를 위한 딥러닝 화재 감시 시스템."}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 전력 설비를 위한 화재 감시 시스템은, 전력 설비 및 인근 영역에 대한 촬영 영상에서 화재 발생 여부 및 상기 전력 설비와의 관련성을 판정하는 화재 영상 감시 모듈; 상기 전력 설비의 단선 상태를 모니터링하는 단 선 감시 모듈; 및 상기 화재 발생 여부의 판정 및 상기 단선 상태로부터 상기 전력 설비에 대한 화재 관련 위험 요인들을 판단하여, 상기 전력 설비에 대한 화재 관련 위험 요인들을 경보하는 화재 위험 경보 장치를 포함하고, 상기 화재 영상 감시 모듈은, 연기, 불꽃 등과 같은 화재 요소와 전주, 변압기, 애자, 전선과 같은 전력설비 이 미지를 훈련 데이터로 학습한 딥러닝 모델을 이용하여 발화점의 위치와 전력설비 근접 여부를 추정할 수 있다."}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전력 설비의 이상에 의한 화재, 특히, 전력선 단선에 의한 산불을 방지할 수 있는 전력 설비를 위한 딥러닝 화재 감시 시스템에 관한 것이다."}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대한민국은 전 국토의 70% 이상이 산림으로 구성되어 있다. 70년대 이후 경제력이 향상되면서 삼림은 울창하게 갖춰진 반면, 휴일이면 증가된 등산객들의 부주의로 인해 산불이 많이 발생하고 있으며, 등산객의 부주의뿐 아 니라 농촌에서의 논두렁 태우기나 번개 등의 천재지변에 의해서도 산불이 발생되고 있다. 이외에도 산불의 발생 원인은 다양화되고 있다. 다양한 원인에 의해 발생된 산불은 우거진 산림을 매개체로 점차 대형화되어 가고 있고, 초기 진압에 실패할 경 우 진압이 쉽지 않으며, 이는 많은 인명 및 재산 피해의 원인이 된다. 산불은 산림에 대한 훼손/손실 뿐만 아니 라, 예컨대 낙산사 및 문화재 소실을 유발하며, 국가의 전력 전송망에도 큰 위협으로 다가온다. 따라서, 산불의 조기 감지 및 조기 진압은 산림 보존, 인명 보호 및 재산 보호 등의 관점에서 최우선적으로 고려되어야 하며, 이를 위해 과감한 투자가 선행되어야 한다는 요구가 점차 높아지고 있다. 종래의 산불 감시 방법은 주로 관리자의 육안 감시 및 통제에 의하는 방법이다. 즉, 사람의 출입이 빈번한 산의 요소요소 또는 산불 감시가 용이한 지점에 산림 감시 초소를 설치하고 관리자가 산불이 발생하였음을 감지하면 통신 수단을 이용하여 중앙 통제소에 알리는 방법이다. 한편, 카메라를 이용한 종래의 산불 감시 시스템은 산의 주요 요소에 카메라를 설치하여 카메라를 통해 촬상되 어 수신된 영상을 중앙 통제소의 운용 요원이 육안으로 확인하여 산불 감지가 가능하도록 한 시스템이다. 그러나, 종래의 산불 감시 시스템은 소수의 운용 요원이 산의 주요 요소들에 설치된 다수의 카메라들로부터 수 신되는 영상을 동시에 감시할 수 없고, 하나의 화면상에 복수의 영상을 동시에 표시하여 확인함으로써 육안 감 지가 정확하지 않은 문제점이 있었다. 또한, 종래의 산불 감시 시스템은 운용 요원의 부재시에는 산불의 신속한 감지 및 대처가 불가능한 문제점도 있었다. 카메라 영상 등을 이용한 산불의 감지 자동화에 대한 기술도 시도되고 있는데, 이러한 화재 감지 및 모니터링 시스템은, CCTV 카메라 또는 화재 감지 센서를 통하여 화재가 감지되는 경우 발화지점을 조기에 발견하고 화재 경보를 발하는 방식으로 화재에 대한 초기 대응을 수행하도록 한다. 다소 개선된 기존 영상 감시장치를 활용한 산불감시 방안은 CCTV, 적외선, 자외선 카메라, 각종 센서 등을 통하 여 일반 이미지 영상과 열 영상 등을 촬영하여 획득된 이미지에서 온도 분포정보를 판단하거나 화재 이미지를 판별한다. 그에 따라 개소당 감시장치 설치비용이 과다하며 각종 기기와 부품의 유지보수를 위한 인건비, 용역 비용이 추가로 소요된다. 또한 영상 이미지로만 화재여부를 판단하여야 하므로 화재사고 인식 실패를 방지하기 위해 각종 신호의 민감도를 낮출 수 없어 자외선, 안개 등의 오인식에 취약할 수 밖에 없다. 전력회사는 CCTV에 서 취득한 영상감시 정보와 전력설비의 상태 정보인 전압, 전류 등의 전력 데이터를 융합하여 화재 위험이 큰 전력선의 단선 상황을 검출, 판단할 필요가 있으나 관련 기술 체계가 미비한 상태이다. 통상 전력회사에서 설치하는 CCTV를 활용한 산불 감시시스템은 산불에 취약한 배전선로의 경과지에 설치되며, 운영자가 24시간 상주하고 있는 배전계통운영센터(Distribution Control Center)에서 감시업무를 수행한다. 계 통운영담당자는 배전자동화시스템(DAS, Distribution Automation System)을 운영하면서 동시에 해당 감시 시스 템을 수시로 모니터링 한다. 다만, 이러한 감시자의 인지 기반의 시스템의 경우, 감시화면 모니터를 지속적으로 주시하기 어렵고 현장에서 취득되는 오정보가 빈번하여 계통운영담당자의 업무효율을 저하시키는 문제가 크다. 또한, 기존에 제안된 배전자동화시스템(DAS)와 지능형 전력계량 시스템(AMI Advanced Metering Infrastructure)의 단순 연계를 통한 전력선 단선 검출 체계는 정전발생 시 보조전원이 없는 전력량계의 모뎀의 전원이 차단되는 문제가 발생하므로 전력량계의 결상, 정전정보를 서버로 전송할 수 없어 실질적으로 현장 적용 이 어렵다는 문제도 존재한다. 특히, 전력선의 단선으로 발생하는 22.9kV 특고압 배전선로의 고저항 지락사고(HIF, High Impedance Fault)는 발생 위치의 명확한 검출이 어려워 고객의 신고와 선로 순시에 의존하는 경우가 많아 사고위치 파악, 복구에 장 시간이 소요되고 화재 위험과 안전사고의 우려가 크다. 그리고 산악 경과지 내 저압 배전선로의 단선 사고는 DAS 시스템을 비롯한 기존 전력계통 감시시스템을 활용한 조기 탐지 방법이 부재해 산불로 진전될 수 있는 위험 이 있다. 따라서 화재에 취약한 산악, 건조·강풍 지역에서 운영되는 전력설비 단선사고의 신속한 감지를 위해 고저압 계통의 구분 없이 신속히 단선 상태를 감지하고 화재의 확산을 방지하기 위한 기술적인 방안 마련이 요 구된다. 구체적으로 문제 상황을 예시하기 위해, 현행 산불 위험개소를 감시하고 있는 산악 배전선로 경과지에 설치된 영상감시 시스템은 CCTV를 이용하여 선로 경과지를 단순 모니터링하고 있는 상태를 전제한다. 이러한 환경에서 배전계통운영센터의 운영자는 해당 시스템의 모니터 화면을 수시로 확인하여 산불 발생여부를 확인하여야 한다.현재 차단기의 재폐로 동작으로 인한 아크의 반복적 발생과 화재 확대를 예방하기 위해 국내외 전력회사는 건조 기, 강풍시기에 산악 경과지 등 화재 취약개소에 설치된 CB(Circuit Breaker), Recloser 등의 차단기의 재폐로 기능을 정지시키는 정책을 시행 중이다. 현장에 설치된 전력선의 단선여부 판단을 위해 계통운영담당자는 22.9kV 배전계통을 운영하는 DAS 시스템에서 고장 표시기(Fault Indicator)와 결상(Open Phase) 정보를 확인하 여 단선 발생여부를 추정하고, 이후 단선 분위의 아크 발생으로 인한 화재나 안전사고가 발생하지 않도록 해당 구간의 전력을 차단하고 시험송전을 중지하는 조치를 취한다. 다만 전력선이 단선될 때 지면에 완전히 접지되지 않는 고저항 지락 고장(HIF, High Impedance Fault)이 발생하는 경우 차단기가 동작하지 않으므로 단선부위에서 지속적인 아크가 발생하여 화재로 진전되거나 감전 등의 안전사고를 초래할 수 있다. 또한 DAS 시스템은 22.9kV의 고압 배전계통을 감시하므로 220V, 380V로 공급되는 저압 배전계통을 감시할 수 없 는 맹점이 있다. 그에 따라 화재 취약구간 내 저압 배전계통에서 전력선이 단선되어 화재로 진전하는 사고는 조 기 탐지와 예방이 어려운 상태이다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개공보 10-2020-0080579호"}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 산악 경과지 등 화재 취약개소에 설치된 전력선의 단선사고로 인한 화재 발생 여부를 정확하고 신속 하게 감시/분석할 수 있는 전력 설비를 위한 딥러닝 화재 감시 시스템을 제공하고자 한다."}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따른 전력 설비를 위한 화재 감시 시스템은, 전력 설비 및 인근 영역에 대한 촬영 영상에 서 화재 발생 여부 및 상기 전력 설비와의 관련성을 판정하는 화재 영상 감시 모듈; 상기 전력 설비의 단선 상 태를 모니터링하는 단선 감시 모듈; 및 상기 화재 발생 여부의 판정 및 상기 단선 상태로부터 상기 전력 설비에 대한 화재 관련 위험 요인들을 판단하여, 상기 전력 설비에 대한 화재 관련 위험 요인들을 경보하는 화재 위험 경보 장치를 포함할 수 있다. 여기서, 상기 단선 감지 모듈은, 상기 전력 설비에 대한 영향을 받는 범위에 있는 AMI 계기들의 동작을 주기적 으로 확인하여 상기 전력 설비에 관련된 단선 여부를 판정할 수 있다. 여기서, 상기 단선 감시 모듈은, 상기 AMI 계기들이 계량 데이터 전송 주기와 별도로 주기적으로 송신하는 소용 량의 모뎀의 상태 정보인 Alive 메시지에 대한 전송 실패 횟수가 임계 개수로 누적되어 카운트되면 단선으로 인 식할 수 있다. 여기서, 상기 화재 위험 경보 장치는, 상기 화재 영상 감지 모듈이 상기 전력 설비에서의 화재 발생을 감지한 시각과 상기 단선 감시 모듈이 단선 상태임을 감지한 시각이 유사하면, 상기 단선에 의한 화재로 추정할 수 있 다. 여기서, 상기 화재 위험 경보 장치는, 상기 단선에 의한 화재로 추정되면, 상기 전력 설비에 대한 DAS 구간내 단선 또는 결상 경보를 확인하여, 경보가 존재하면 고압 전력선 단선으로 판단하는 단계; 상기 DAS 구간내 단선 또는 결상 경보가 존재하지 않으면, 상기 전력 설비에 대한 영향을 받는 범위에 있는 AMI 저압 계기들의 동작 상태를 확인하는 단계; 상기 AMI 저압 계기들 중 확인 실패인 것이 존재하면, 저압 전력선 단선으로 판단하는 단계; 및 상기 AMI 저압 계기들 중 확인 실패인 것이 존재하지 않으면, 전력선 단선 이외 원인으로 인한 화재로 판단하는 단계를 포함하는 화재 원인으로서 단선 분석 방법을 수행할 수 있다. 여기서, 상기 화재 원인으로서 단선 분석 방법은, 상기 저압 전력선 단선으로 판단하는 단계 이후, 상기 확인 실패인 AMI 저압 계기의 계통 연결 위치 및 정전 규모를 확인하는 단계; 및 상기 계통 연결 위치 및 정전 규모 에 따라 단선 구간을 추정하는 단계를 더 포함할 수 있다. 여기서, 상기 화재 영상 감시 모듈은, 연기, 불꽃 등과 같은 화재 요소와 전주, 변압기, 애자, 전선과 같은 전 력설비 이미지를 훈련 데이터로 학습한 딥러닝 모델을 이용하여 발화점의 위치와 전력설비 근접 여부를 추정할 수 있다. 여기서, 상기 화재 영상 감시 모듈은, 상기 촬영 영상에서 빛 반사를 포함하는 노이즈를 제거하는 전처리 과정; 또는, 연속된 프레임의 차영상을 통해서 연기로 오탐지 가능성이 큰 구름 및 안개를 제거하는 과정을 수행할 수 있다. 여기서, 상기 화재 영상 감시 모듈은, 전력설비 이미지 위에 연기, 불꽃 등 화재요소가 중첩되어 감지되는 경우 '전력설비 근접 화재'로 분류할 수 있다. 여기서, 상기 화재 위험 경보 장치는, 화재요소, 전력설비 근접여부, 전력선 단선 발생구간 정보를 일괄 제공하 는 화면을 출력할 수 있다. 여기서, 상기 화재 위험 경보 장치는, 화재발생 가능성이 낮은 시기 및 기상정보의 데이터를 머신러닝 기반으로 규정하고, 이를 화면으로 관리자에게 제공할 수 있다. 본 발명의 다른 측면에 따른 전력 설비를 위한 화재 원인 분석 방법은, 감시 영상으로부터 전력 설비에 근접한 화재를 인지하는 단계; 상기 전력 설비에 대한 DAS 구간내 단선 또는 결상 경보를 확인하여, 경보가 존재하면 고압 전력선 단선으로 판단하는 단계; 상기 DAS 구간내 단선 또는 결상 경보가 존재하지 않으면, 상기 전력 설 비에 대한 영향을 받는 범위에 있는 AMI 저압 계기들의 동작 상태를 확인하는 단계; 상기 AMI 저압 계기들 중 확인 실패인 것이 존재하면, 저압 전력선 단선으로 판단하는 단계; 및 상기 AMI 저압 계기들 중 확인 실패인 것 이 존재하지 않으면, 전력선 단선 이외 원인으로 인한 화재로 판단하는 단계를 포함할 수 있다. 여기서, 상기 감시 영상으로부터 화재를 인지하는 단계는, 상기 전력 설비에 대한 감시 영상에서 화재 발생을 감지하는 단계; 상기 전력 설비와 발생된 화재 요소의 이격 거리를 계산하는 단계; 및 상기 이격 거리에 따른 경보를 발송하는 단계를 포함할 수 있다. 여기서, 상기 저압 전력선 단선으로 판단하는 단계 이후, 상기 확인 실패인 AMI 저압 계기의 계통 연결 위치 및 정전 규모를 확인하는 단계; 및 상기 계통 연결 위치 및 정전 규모에 따라 단선 구간을 추정하는 단계를 더 포 함할 수 있다."}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 구성의 본 발명의 사상에 따른 전력 설비를 위한 딥러닝 화재 감시 시스템을 실시하면, 산악 경과지 등 화재 취약개소에 설치된 전력선의 단선 사고로 인한 화재발생 여부를 정확하고 신속하게 감시할 수 있는 이점이 있다. 본 발명의 전력 설비를 위한 딥러닝 화재 감시 시스템은, 딥러닝 기술을 이용하여 화재 요소를 CCTV 화면에서 자동으로 감지 후 경보를 발송해 주므로 계통운영담당자의 CCTV 감시업무 부담을 경감시키고 감시업무의 실효성 을 제고하는 이점이 있다. 본 발명의 전력 설비를 위한 딥러닝 화재 감시 시스템은, 화재요소 영상 감지정보, DAS 시스템의 단선/결상 경 보, AMI 시스템의 Alive 메시지 수신정보의 종합적인 분석으로 계통운영담당자가 22.9kV 특고압 배전선로뿐만 아니라 220V/380V 저압 배전선로의 화재 발생 여부와 전력선 단선 여부, 발생 개소를 판단할 수 있으며, 그에 따라 사고가 발생한 배전계통의 선제적 차단, 현장출동 지시, 화재 신고 등 후속조치를 신속히 시행할 수 있어 화재의 확산을 효율적으로 예방하는 이점이 있다. 본 발명의 전력 설비를 위한 딥러닝 화재 감시 시스템은, 저렴한 비용으로 효과적으로 화재 취약개소에 설치된 전력선의 단선 사고로 인한 화재를 방지할 수 있는 이점이 있다."}
{"patent_id": "10-2024-0098095", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 설명함에 있어서 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요 소들은 용어들에 의해 한정되지 않을 수 있다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적 으로만 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 연결되어 있다거나 접속되어 있다고 언급되는 경우는, 그 다른 구성요소에 직 접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해 될 수 있다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 명세서에서, 포함하다 또는 구비하다 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것으로서, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해될 수 있다. 또한, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 본 발명의 사상은 전력선 단선 구간 검출을 함께 적용하는 카메라(CCTV) 영상을 이용한 화재 감지 시스템 구축 을 지원할 수 있다. 예컨대, 본 발명은 인공지능 기반의 영상인식 기술과 지능형 전력계량시스템(AMI, Advanced Metering Infrastructure)의 계량정보를 활용하여 산악 경과지 등 화재 취약개소에 설치된 전력선의 단선사고로 인한 화 재발생 여부를 정확하고 신속하게 검출하여 계통운영담당자를 비롯한 전력설비 운영자에게 위험 경보를 적시에 제공할 수 있는 전력 설비 화재 감시 시스템을 구축할 수 있다. 또한, 본 발명은 CCTV 감시영상에서 화염/연기 등 화재 요소를 감지하고, 전력설비와 화재 요소의 이격거리/근 접 여부에 따른 경보를 수행하고, 해당 지역의 전력선 단선 여부 및 단선 구간 판정을 수행하는 전력선 단선개 소 검출 및 화재감지 알고리즘을 학습 모델의 형태로 구비할 수 있다. 도 1은 본 발명의 사상에 따른 전력 설비를 위한 화재 감시 시스템을 도시한 블록도이다. 도시한 전력 설비 화재 감시 시스템은, 전력 설비 및 인근 영역에 대한 촬영 영상에서 화재 발생 여부를 판정하는 화재 영상 감시 모듈; 상기 전력 설비의 단선 상태를 모니터링하는 단선 감시 모듈; 상기 화재 발생 여부의 판정 및 상기 단선 상태로부터 상기 전력 설비에 대한 화재 관련 위험 요인들을 판단하여, 상 기 전력 설비에 대한 화재 관련 위험 요인들을 경보하는 화재 위험 경보 장치를 포함할 수 있다. 상기 화재 영상 감시 모듈은, 기존의 CCTV 영상을 인공지능 기반의 화재 감시 알고리즘을 이용하여 전력 설비 또는 그의 인근에서 연기, 화염 등이 발생될 때 그 의심 영역을 자동으로 감지하기 위한 것이다. 상기 단선 감시 모듈은, 예컨대, AMI 시스템을 통해 화재 영상 감시권역의 배전계통에 연계된 고·저압 전 력량계의 결상 또는 무전압을 감지할 수 있다. 상기 화재 위험 경보 장치는 전력선 단선과 화재 위험을 감지시 계통운영 담당자에게 경보를 발송하기 위 한 것이다. 인공지능 기반의 상기 화재 영상 감시 모듈은, 영상감시 중인 전력설비 인근의 발화점을 추정하기 위하여 연기, 불꽃 등과 같은 화재 요소와 전주, 변압기, 애자, 전선과 같은 전력설비 이미지를 훈련 데이터로 학습한 딥러닝 모델을 이용하여 발화점의 위치와 전력설비 근접 여부를 추정하는 모듈이다. 상기 화재 영상 감시 모듈은, 기존에 설치된 CCTV 시스템을 활용하여 현장에 설치된 영상 기자재나 감시 소프트웨어를 교체하지 않고 CCTV 시스템에서 취득된 영상을 감시하는 화재감시 Agent를 소프트웨어 형태로 구 현하여 기존 시스템에 설치하고 실시간으로 화재발생 여부를 감지하도록 구현할 수 있다. 예컨대, 상기 화재 영상 감시 모듈은, 먼저 CCTV를 통해 얻는 영상을 입력으로 받아 빛 반사와 같은 노이 즈 제거 등 전처리 단계를 거친다. 전처리된 영상에서 딥러닝 기반 물체검출 알고리즘(Scaled YOLOV4, YOLOv4 등)을 활용하여 전력설비와 화재요소(연기/불꽃)과 발화 위치를 탐지할 수 있다. 화재 탐지 과정에서 연기와 유사한 특성을 갖는 구름이나 안개를 연기로 오탐지 하는 경우가 간헐적으로 발생할 수 있으므로 이러한 단점을 보완하기 위하여 연속된 프레임의 차영상을 통해서 얻은 Optical flow정보를 이용하 여 연기로 오탐지 가능성이 큰 구름 및 안개를 제거함으로써, 관리자에게 전달되는 False Alarm 을 사전에 방지 가능하도록 하며, 상기 영상기반 화재탐지 알고리즘(딥러닝 기반 물체검출/Optical Flow)에 기상정보를 융합하 여 화재탐지 성능을 더욱 고도화 한다. 즉, 화재발생 가능성이 낮은 시기 및 기상정보의 데이터를 머신러닝 기 반으로 훈련/추정하여 영상기반 결과와 융합하여 화재탐지의 정확성을 높임과 동시에 오탐지를 줄인다. 상기 화재 영상 감시 모듈은, 전체 알고리즘 동작을 통합 분석하여 얻은 결과값을 토대로 화재여부 및 발 화위치를 판단하는 신호를 출력한다. 전력설비에서 화재가 발생한 것으로 인식되는 경우, 즉, 전력설비 이미지 위에 연기, 불꽃 등 화재요소가 중첩되어 감지되는 경우 '전력설비 근접 화재'로 분류하여 사용자에게 경보를 알리고, 'AMI 전력선 단선 감시모듈'의 전력선 단선 감시정보와 연계하여 화재 발생 위험성을 판단할 수 있도록 한다. 상기 단선 감시 모듈은 AMI 기반의 전력선 단선 감시 모듈일 수 있고, 이 경우, AMI 전력량계에서 계량정 보를 서버와 통신하는 주기는 통상 고압 15분, 저압 60분이며, 전력량계를 구동하는 배전계통의 전원이 차단되 는 경우 전력량계 및 그 모뎀의 전원도 꺼지게 된다. 따라서, 고압 배전선로 정전이 발생하거나 단상으로 구성 된 저압 배전계통에서 전력선 단선이 발생하는 경우 AMI 전력량계 및 모뎀의 전원이 꺼지므로 서버로 상태를 전 송할 수 없게 된다. 본 제안 기술은 전력량계의 전원차단 여부를 계량 데이터(LP, Load Profile) 전송 주기와 별도로 소용량의 모뎀 의 상태정보인 Alive 메시지를 AMI 서버로 주기적으로 송신하도록 데이터 전송 알고리즘을 구성하여 송신주기를 30초로 하고 전력선 단선 등으로 정전이 발생한 경우 AMI 서버에 Alive 메시지가 도달하지 않는 메시지 전송 실 패 횟수를 5회 누적 카운트하여 정전으로 인식한다. 또한, Alive 메시지 송신주기 및 정전 인식 누적 카운트 횟 수는 현장의 요구사항에 따라 가변하여 적용할 수 있다. AMI 전력량계는 배전계통의 연결 정보를 가지고 있으므로 CCTV로 감시하고 있는 산불 취약 경과지의 배전계통에 연결된 전력량계에서 정전, 결상 이벤트가 발생하는 경우 해당 이벤트를 사용자에게 경보 알람으로 전송하여 계 통운영자가 해당 위험구간을 원격차단하거나 현장확인을 위한 출동지시 등 초동조치를 시행할 수 있다. 만약 단선된 전력선이 나무 등에 걸쳐 고저항 지락사고(HIF)로 진전하는 경우 해당 선로의 부하측에 있는 AMI의 단상 전력량계들의 전원이 일제히 차단되므로 AMI 서버에 Alive 메시지가 도달하지 않는 현상을 이용하여 단선 예상구간을 추정하고 사용자에게 경보를 제공할 수 있다. 도 2는 도 1의 화재 영상 감시 모듈의 세부 구성을 도시한 블록도이다. 도시한 화재 영상 감시 모듈은, CCTV의 전력 설비에 대한 촬영 영상들을 수집하는 영상 입력 버퍼; 빛 반사 노이즈 등 촬영 영상에 일반적으로 발생되는 잡음 이미지 요소를 제거하는 영상 전처리부; 전처리 된 상기 촬영 영상에서 머신 러닝 기반으로 화재 요소의 발생을 검출하고 전력 설비를 식별하는 영상 학습 모델; 검출된 상기 화재 요소에 따라 1차적으로 화재로 판정하는 1차 화재 판정부; 상기 화재 요소 중 연 기에 대하여 상기 촬영 영상의 이미지 객체에 대한 모션 벡터를 적용하여 연기 여부를 확인하는 연기 판정부 ; 상기 연기 여부 확인에 따라 최종적으로 화재 여부를 판정하는 최종 화재 판정부; 최종적으로 판정 된 화재에 관련된 전력 설비들의 위치를 확인하는 전력 설비 위치 확인부; 및 상기 최종적으로 판정된 화 재의 발화점과 상기 전력 설비들과의 위치 관계를 판정하는 발화점 판정부를 포함할 수 있다. 상기 영상 전처리부는 풍경 사진등에 일반적으로 널리 알려진 빛 반사 노이즈, 회절 간섭 무늬, 야간 촬영 노이즈, 고감도 노이즈 등을 예컨대 FFT 기반으로 고주파 성분이나, 해당 노이즈에 대한 주파수 대역을 억제하 는 방식으로 처리하여 제거할 수 있다. 도시한 영상 학습 모델은, 불꽃, 연기 등 화재 요소 이미지 객체를 식별하고, 전주, 전선, 변압기, 애자 등 전력 설비 이미지 객체를 식별하는 이미지 객체(요소) 식별부; 상기 이미지 객체들에 대한 데이터 저장 을 위한 전처리를 수행하는 이미지 객체 DB 전처리부 및 딥러닝 기반으로 상기 이미지 객체를 식별에 대한 학습을 수행하는 학습부를 포함할 수 있다. 구현에 따라 상기 이미지 객체(요소) 식별부는 전력 설비에 대한 DB에서 해당 전력 설비의 설치 위치 정보 를 획득하여 이를 식별된 전력 설비 이미지 객체에 매칭할 수 있다. 예컨대, 상기 이미지 객체 DB 전처리부는, 화재 이미지에 대한 레이블링, Class 분류 및 Box 좌표 추출, 이미지 Augmentation을 수행할 수 있다. 예컨대, 상기 학습부는 YOLOV4 기반의 이미지 객체 인식을 위한 딥러닝 모듈을 적용하여, 불꽃, 연기 등 화재 요소 이미지 객체 및 전주, 전선, 변압기, 애자 등 전력 설비 이미지 객체를 식별하는 학습을 수행할 수 있다. 상기 1차 화재 판정부는 실시간적으로 입력되는 촬영 영상으로부터 즉각적인 화재 판정을 위한 것으로, 예 컨대, 상기 1차 화재 판정부가 판정한 화재 판정은 관리자를 위한 화면에서 요주의로만 시각적으로만 출력 할 수 있다. 이는 후술하는 모션 벡터의 이용에 시간이 소요됨을 감안하여, 이미 요주의 수준으로 경보하는 정 책에 따른 것이다. 상기 연기 판정부는 Optical Flow 기반으로 식별된 이미지 객체들의 모션 벡터를 이용하여 연기와 유사한 성격의 안개 및 구름을 제거할 수 있다. 구체적으로 연기는 상향 모션 벡터 및/또는 풍향에 따른 모션 벡터가 주도적이며, 상당한 원거리의 객체인 구름의 경우 수평 방향의 모션 벡터가 주도적이고, 안개의 경우 모션 벡터 가 뚜렷하게 드러나지 않는다. 이러한 특성에 따라 연기와 유사한 특성의 구름 및 안개를 제거할 수 있다. 이중 연기만이 화재 요소임은 물론이다. 구현에 따라 상기 연기 판정부는 불꽃에 대해서도 모션 벡터를 이용하여 구분할 수 있는 처리를 수행할 수 있다. 예컨대, 상기 최종 화재 판정부는 상기 1차 화재 판정부가 판정한 화재 요소(불꽃, 연기)들 중에서 상기 연기 판정부에서 구름이나 안개로 판정한 것들에 매칭되는 것을 제거할 수 있다. 상기 전력 설비 위치 확인부는 상기 상기 최종 화재 판정부에서 판정된 화재 요소에 대하여 인접한 전력 설비들의 각 설비의 종류 및 화재 요소와의 거리를 확인할 수 있다. 상기 발화점 판정부는 상기 최종 화재 판정부가 판정한 화재 요소가 전력 설비에서 발생된 것인지 또 는 전력 설비 인근에서 다른 원인으로 발생된 산불인지를 영상 분석으로 판단할 수 있다. 이를 위해, 상기 전력 설비 위치 확인부가 확인한 각 설비의 종류 및 화재 요소와의 거리를 반영할 수 있다. 한편, 도 2에서는 기상 학습 모델을 함께 도시하는데, 상기 기상 학습 모델은 상기 화재 영상 감시 모듈에 속하기 보다는, 상기 화재 위험 경보 장치에 속하도록 구현하는 것이 유리하다. 그러나, 다른 목적에서는 상기 화재 영상 감시 모듈에 속하도록 구현할 수도 있다. 도시한 기상 학습 모델은, 화재 발생시의 기상 정보(계측값 및 기상 조건 등)를 수집하는 기상 정보 수집 부; 수집된 상기 기상 정보들에 대한 데이터 저장을 위한 전처리(예: 레이블링)를 수행하는 기상 DB 전처 리부; 및 상기 기상 정보에 따른 상황에서의 화재 발생 확률을 산출하는 학습을 수행하는 학습부를 포함할 수 있다.도 3은 도 1의 상기 단선 감시 모듈 및 화재 위험 경보 장치의 세부 구성을 도시한 블록도이다. 도시한 단선 감시 모듈은, 담당하는 AMI 계기들로부터 상태 정보를 수집하는 AMI 계기 정보 수집부 및 상기 AMI 계기들의 상태 정보들로부터 단선 위치를 판단하는 단선 위치 판정부를 포함한다. 도시한 화재 위험 경보 장치는, 화재 발생시의 기상 조건에 따른 화재 발생 확률을 산정하는 기상 학습 모 델; 상기 단선 감시 모듈의 판정 결과, 상기 화재 영상 감시 모듈의 판정 결과 및 상기 화재 발 생 확률을 조합하여 관리자를 위한 경보 정보를 생성하는 경보 정보 생성부; 및 상기 경보 정보를 관리자 에게 출력하는 관리자 인터페이스를 포함할 수 있다. 예컨대, 상기 AMI 계기 정보 수집부는, 각 AMI 계기에 구비된 모뎀의 상태정보인 Alive 메시지를 주기적 (예: 30초)으로 수신하고, 그 수신 결과를 누적기록할 수 있다. 누적하여 기록하는 것은 예컨대, 전력선 단선 등으로 정전이 발생한 경우 상기 Alive 메시지가 도달하지 않는 메시지 전송 실패 횟수를 5회 누적 카운트하여 정전으로 인식하기 위함이다. 또한, 상기 AMI 계기 정보 수집부는, Alive 메시지 송신주기 및 정전 인식 누적 카운트 횟수는 상기 관리 자 인터페이스를 통한 관리자의 지정에 따라 설정할 수 있다. 상기 단선 위치 판정부가 수행하는 단선 위치 판정 방법에 대해서는 후술하겠다. 예컨대, 상기 경보 정보 생성부는, 도 2의 1차 화재 판정부가 화재로 판정한 경우에는, 다수개의 CCTV를 함께 디스플레이하는 화면에서 1차 화재 판정된 해당 CCTV의 촬영 영상의 테두리에 색상으로 표시하고, 도 2의 최종 화재 판정부가 화재로 판정한 경우에는, 최종 화재 판정된 해당 CCTV의 촬영 영상을 전체 화 면으로 전환하고, 화재 지점 및 관련 정보들을 표시하고, 음성으로도 경보를 출력할 수 있다. 상기 관리자 인터페이스는 상기 경보 정보 생성부가 생성한 경보 정보에 따라 시/청각 경보들을 관리 자에게 출력하며, 관리자로부터 각종 설정을 위한 지시를 입력받는다. 하기 표 1은 전력선 단선구간 화재위험 경보 모듈의 구현 예를 나타낸 것이다. 표 1 상기 화재 위험 경보 장치는 전력선 단선구간 화재위험 경보모듈로서, 전력계통 운영자가 인공지능 화재영 상 감시모듈과 AMI 전력선 단선 감시모듈에서 수집된 정보를 파악하여 감시구간 내 화재 발생여부와 전력선 단 선 유무를 종합적으로 파악할 수 있도록, 예컨대, 상기 경보 정보 생성부는, 상기 표 1에 나타낸 바 같이 화재요소, 전력설비 근접여부, 전력선 단선 발생구간 정보를 담은 화면을 생성하고, 상기 화면을 상기 관리자 인터페이스에서 디스플레이하여 관리자에게 일괄 제공할 수 있다. 예를 들어 CCTV 영상감시 구간 내에 있는 강원D/L 123호에서 A상 전력선의 단선사고가 발생하여 단선된 전력선 부위에서 아크로 인한 불꽃이 발생하였다. 인공지능 화재영상 감시모듈이 화재를 인식하고 전력설비와 근접도를 계산하여 계통운영담당자에게 즉시 화재요소 경보를 발송한다. A상의 단선구간 부하측 저압선로의 AMI 전력량계 는 모두 정전을 경험하게 되므로 AMI의 정전 정보를 기반으로 전력선 단선개소를 추정하여 관리(운영)자에게 제 공할 수 있다. 도 4는 본 발명의 사상에 따른 전력 설비의 화재 원인에 대한 분석 방법을 도시한 흐름도이다. 도시한 전력 설비의 화재 원인 분석 방법은, 감시 영상으로부터 전력 설비에 근접한 화재를 인지하는 단계 (S100); 상기 전력 설비에 대한 DAS 구간내 단선 또는 결상 경보를 확인하여(S210), 경보가 존재하면 고압 전력 선 단선으로 판단하는 단계(S220); 상기 DAS 구간내 단선 또는 결상 경보가 존재하지 않으면, 상기 전력 설비에 대한 영향을 받는 범위에 있는 AMI 저압 계기들의 동작 상태를 확인하는 단계(S230); 상기 AMI 저압 계기들 중 확인 실패인 것이 존재하면, 저압 전력선 단선으로 판단하는 단계(S240); 및 상기 AMI 저압 계기들 중 확인 실 패인 것이 존재하지 않으면, 전력선 단선 이외 원인으로 인한 화재로 판단하는 단계(S250)를 포함할 수 있다. 구현에 따라, 도시한 상기 감시 영상으로부터 화재를 인지하는 단계(S100)는, 상기 전력 설비에 대한 감시 영상 에서 화재 요소(불꽃, 연기 등)를 감지하는 단계(S110); 상기 전력 설비와 발생된 화재 요소의 이격 거리를 계 산하는 단계(S140); 및 상기 이격 거리에 따른 경보를 발송하는 단계(S160)를 포함할 수 있다. 이때, 화재 요소 가 감지되지 않으면, 계속 감시 상태를 유지한다(S120). 구현에 따라, 상기 저압 전력선 단선으로 판단하는 단계(S250) 이후, 상기 확인 실패인 AMI 저압 계기의 계통 연결 위치 및 정전 규모를 확인하는 단계(S260); 및 상기 계통 연결 위치 및 정전 규모에 따라 단선 구간을 추 정하는 단계(S270)를 포함할 수 있다. 상기 AMI 저압 계기들의 동작 상태는 AMI 계기의 Alive 메시지를 확인하는 방식, 예컨대, 5회 이상 연속 특정 AMI 계기의 Alive 메시지가 수신되지 않으면 동작 이상 상태로 판정하는 방식으로 수행될 수 있다. 이 경우, 상 기 S260 단계에서는, 1, 2개의 특정 AMI 저압 계기에서만 Alive 메시지가 확인되지 않으면, 즉, 동작 이상 상태 이면, 해당 계기나 통신 회선의 문제에 기인할 가능성이 상당하지만, 특정 부분 지역에 속한 모든 AMI 저압 계 기들의 Alive 메시지가 확인되지 않으면(즉, 규모가 큰 정전과 유사한 상태이면), 상기 특정 부분 지역의 저압 선 단선 사고에 기인할 가능성이 높으며, 이러한 가능성에 따른 판정을 수행할 수 있다. 상기 감시 영상으로부터 화재를 인지하는 단계(S100)는 실시간으로 수신되는 촬영 영상을 이용하여, 해당 사건 발생시 바로 1차적으로 수행될 수 있으며, 소정 회수(시간) 동안 AMI 계기의 Alive 메시지들의 미확인들을 카운 트해야 완료되는 상기 S230 단계 내지 S260 단계의 수행 이후 가능한 상기 단선 구간을 추정하는 단계(S270)는 최종적 판단으로서 수행될 수 있다. 도시한 흐름도의 전력 설비의 화재 원인에 대한 분석 방법 중 상기 S110 단계 내지 S160 단계는 도 1의 화재 영 상 감시 모듈에서 수행되고, 상기 S210 단계 내지 S270 단계는 도 3의 단선 위치 판정부에서 수행될 수 있다. 도 5는 감시용 CCTV 시스템이 기 구축된 필드에 본 발명의 사상에 따른 화재 감시 시스템을 구현한 경우의 장점 을 도시한 개념도이다. 통상적인 배전 운영 시스템(AS-IS)에서, 계통운영 담당자는 24시간 교대근무로 DAS 시스템을 활용하여 계통을 감시하고 운영해야 하므로 육안으로 확인해야 하는 CCTV 산불 감시체계는 담당직원의 업무부담을 증가시키고 지 속적인 감시가 어려워 실효성이 저하되었다. 이러한 상황에서 산악지, 강풍·건조 지역 등 취약경과지에서 발생하는 화재는 조기 탐지 및 초동조치가 지연되는 경우 큰 산불로 진전되어 막대한 피해가 발생하게 된다. 본 제안 기술에 따른 화재 감시 시스템(TO-BE)을 구축하면, 딥러닝 기술을 이용하여 화재 요소를 CCTV 화면에서 자동으로 감지 후 경보를 발송해 주므로 계통운영담당자의 CCTV 감시업무 부담을 경감시키고 감시업무의 실효성 을 제고하며, 그에 따라 사고가 발생한 배전계통의 선제적 차단, 현장출동 지시, 화재 신고 등 후속조치를 신속 히 시행할 수 있어 화재 피해의 확산을 효율적으로 예방할 수 있다. *이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야 에서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명 하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보 호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명 의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2024-0098095", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 사상에 따른 전력 설비를 위한 화재 감시 시스템을 도시한 블록도. 도 2는 도 1의 화재 영상 감시 모듈의 세부 구성을 도시한 블록도. 도 3은 도 1의 단선 감시 모듈 및 화재 위험 경보 장치의 세부 구성을 도시한 블록도. 도 4는 본 발명의 사상에 따른 전력 설비의 화재 원인에 대한 분석 방법을 도시한 흐름도. 도 5는 감시용 CCTV 시스템이 기 구축된 필드에 본 발명의 사상에 따른 화재 감시 시스템을 구현한 경우의 장점 을 도시한 개념도."}
