{"patent_id": "10-2021-0133042", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0163835", "출원번호": "10-2021-0133042", "발명의 명칭": "간편식의 영양밸런스 강화정보 시각화에 기반한 조리대상 간편식의 제품정보, 조리과정 영상", "출원인": "주식회사 하벤", "발명자": "이혁진"}}
{"patent_id": "10-2021-0133042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말에 간편식 리스트를 제공하는 단계;상기 사용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택정보를 수신하는 단계;상기 선택 정보에 포함된 간편식 및 사이드디쉬에 대한 영양점수를 시각화하여 상기 사용자 단말에 제공하는 단계;상기 간편식의 식별코드를 스캔하여 취득된 상기 간편식의 유통기한 정보를 상기 사용자 단말로 제공하는 단계;및상기 간편식의 조리영상을 상기 사용자 단말로 전송하는 단계;를 포함하는, 간편식 관련정보 다각화 제공 방법."}
{"patent_id": "10-2021-0133042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 간편식 리스트를 제공하는 단계는, 상기 사용자 단말에 상기 사용자 단말을 사용하는 사용자의 건강정보를획득하기 위한 건강정보 항목을 제공하는 단계;를 포함하고,상기 선택 정보를 수신하는 단계는, 상기 사용자 단말로부터 상기 건강정보 항목에 대응하는 상기 사용자의 건강정보를 수신하는 단계;를 포함하는, 간편식 관련정보 다각화 제공 방법."}
{"patent_id": "10-2021-0133042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 영양점수를 시각화하여 제공하는 단계는, 인공지능 학습 데이터 및 상기 건강정보에 기초하여 상기 사이드디쉬에 의해 영양 밸런스화된 상기 간편식의 기 설정된 항목별 영양점수를 제공하는, 간편식 관련정보 다각화제공 방법."}
{"patent_id": "10-2021-0133042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 간편식의 조리영상을 전송하는 단계는,상기 간편식이 조리되는 주방에 설치된 복수개의 카메라를 통해 상기 간편식 및 상기 사이드디쉬 각각에 대응하는 조리 과정에 대한 복수개의 영상을 획득하는 단계;상기 사용자 단말을 사용하는 사용자의 식별자를 상기 사용자 단말로부터 취득하는 단계;취득된 상기 사용자의 식별자를 상기 복수개의 영상 각각에 표출시키는 단계; 및상기 사용자의 식별자가 표출된 상기 복수개의 영상을 상기 사용자 단말에 실시간으로 제공하는 단계;를 포함하는, 간편식 관련정보 다각화 제공 방법."}
{"patent_id": "10-2021-0133042", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0163835-3-적어도 하나의 프로그램이 기록된 메모리; 및상기 프로그램을 실행하는 프로세서;를 포함하고,상기 프로그램은,사용자 단말에 간편식 리스트를 제공하는 단계;상기 사용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택정보를 수신하는 단계;상기 선택 정보에 포함된 간편식 및 사이드디쉬에 대한 영양점수를 시각화하여 상기 사용자 단말에 제공하는 단계;상기 간편식의 식별코드를 스캔하여 취득된 상기 간편식의 유통기한 정보를 상기 사용자 단말로 제공하는 단계;및상기 간편식의 조리영상을 상기 사용자 단말로 전송하는 단계;를 수행하기 위한 명령어들을 포함하는, 간편식관련정보 다각화 제공 장치."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "간편식 관련정보 다각화 제공 방법 및 장치가 개시된다. 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제 공 방법은 사용자 단말에 간편식 리스트를 제공하는 단계, 사용자 단말로부터 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택 정보를 수신하는 단계, 선택 정보에 포함된 간편식 및 사이드디쉬 에 대한 영양점수를 시각화하여 사용자 단말에 제공하는 단계, 간편식의 식별코드를 스캔하여 취득된 간편식의 유통기한 정보를 사용자 단말로 제공하는 단계, 간편식의 조리영상을 사용자 단말로 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 간편식 정보 시각화 제공 시스템에 관한 것으로, 보다 상세하게는 간편식의 영양밸런스 강화정보 시 각화에 기반한 조리대상 간편식의 제품정보, 조리과정 영상 및 신선배송상태정보 제공 시스템에 관한 것이다."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 발명에 따른 일 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구 성하는 것은 아니다. 최근 1인 가구가 확대되고 여성의 사회 활동이 증가함에 따라, 가정 간편식(Home Meal Replacement, HMR)에 대 한 관심이 높아지고 있다. 과거 대가족 구조에서는 많은 인원을 위한 식사를 한꺼번에 준비하여 1인당 식사 준 비 비용이 적었던 것에 비해 1인 가구나 소규모 가구에서는 식사 준비 비용이 많이 들 뿐만 아니라, 식사 준비 에 소비되는 시간을 줄여 여가를 즐기려는 니즈와 맞물려 식사를 준비하는데 드는 노력과 시간을 감소시켜주고 외식 대비 가격 경쟁력도 갖춘 가정 간편식의 본격적인 성장세가 나타나고 있다. 또한, 고령 인구의 증가 역시 가정에서 간단하게 먹을 수 있는 간편 조리식품이나 소포장 식품 등의 확대를 이끄는 요인으로 작용하고 있다. 이러한 가정 간편식은 조리법에 따라 RTE(Ready To Eat), RTH(Ready To Heat), RTC(Ready To Cook) 등으로 분 류할 수 있는데, 먼저 RTE는 조리 과정 없이 바로 먹을 수 있는 제품으로 도시락, 김밥, 샌드위치 등이 이에 속 하며, RTH는 데우기만 하면 먹을 수 있는 제품으로 즉석밥, 냉동만두, 레토르트 식품 등이 이에 속한다. 또한, RTC는 간편 조리 후 먹을 수 있는 제품으로 밀키트(찌개류, 볶음류, 탕류 등)가 이에 속한다. 이 중 식재료를 미리 손질하여 가공하지 않은 상태로 레시피와 함께 동봉하여 배송하는 밀키트(Meal Kit) 시장이 급성장세를 보 이고 있다. 2017년 유통업계 조사에 따르면 국내 HMR 시장은 2010년 7700억원에서 2016년 2조3000억원으로 3배가량 성장했 다. 통계청에 따르면 국내 1인 가구 수는 2015년 518만가구로 전체 가구 중 27.2%를 차지하며, 2045년에는 1인 가구가 809만가구(36.3%)로 증가할 것으로 전망되는 바, 별다른 조리 없이 간단한 한 끼를 해결하기 위한 간편 식에 대한 수요와 관심은 앞으로도 꾸준히 증가할 것으로 보인다. 그러나, 시중에 판매되는 다양한 간편식 위주의 식사 습관은 식생활의 간편화 및 시간 절약에 효과적인 반면 균 형잡힌 영양식을 기대하기에 어려움이 있어 건강한 식생활과는 다소 거리가 멀고 특히 밀키트의 경우 수요자 개 인적 성향과 거주환경적 측면에서 취사가 어렵거나 번거로움이 있다. 더욱이, 최근 식품의약품안전처 조사 결과에 따르면 치킨, 중식, 피자, 족발보쌈, 분식, 햄버거 등의 비영양식 이 배달음식의 대부분을 차지하였고, 배달서비스의 이용증가 이유로는 ‘음식을 해먹기 귀찮아서’가 1위로 꼽 힌 점을 고려할 때, ‘웰빙’, ‘웰니스’ 등의 건강한 라이프스타일을 간편식에 접목하고, 나아가 섭취자의 건강상태, 체성분, 유전자, 대사 균형, 생활 습관 등을 고려한 간편하지만 균형 잡힌 영양소를 갖춘 종합영양간편 식품에 대한 조리 및 배달대행 서비스가 절실히 필요한 실정이다."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 인공지능 기반 개인맞춤형 간편식 조리 및 콜드체인 배송 서비스를 제공하는 것을 목적으로 한다. 또한 본 발명은 사용자 ?춤형 케어푸드를 지향하는 인공지능 기반 개인맞춤형 간편식의 조리서비스를 제공하고 조리된 간편식의 최적온도 유지를 위한 콜드체인 배송 서비스를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법은 사용자 단말에 간편식 리스트를 제공하는 단계; 상기 사용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하 나에 대한 선택을 포함하는 선택 정보를 수신하는 단계; 상기 선택 정보에 포함된 간편식 및 사이드디쉬에 대한 영양점수를 시각화하여 상기 사용자 단말에 제공하는 단계; 상기 간편식의 식별코드를 스캔하여 취득된 상기 간 편식의 유통기한 정보를 상기 사용자 단말로 제공하는 단계; 및 상기 간편식의 조리영상을 상기 사용자 단말로 전송하는 단계;를 포함한다. 상기 간편식 리스트를 제공하는 단계는, 상기 사용자 단말에 상기 사용자 단말을 사용하는 사용자의 건강정보를 획득하기 위한 건강정보 항목을 제공하는 단계;를 포함하고, 상기 선택 정보를 수신하는 단계는, 상기 사용자 단말로부터 상기 건강정보 항목에 대응하는 상기 사용자의 건강정보를 수신하는 단계;를 포함할 수 있다. 상기 영양점수를 시각화하여 제공하는 단계는, 인공지능 학습 데이터 및 상기 건강정보에 기초하여 상기 사이드 디쉬에 의해 영양 밸런스화된 상기 간편식의 기 설정된 항목별 영양점수를 제공할 수 있다. 상기 간편식의 조리영상을 전송하는 단계는, 상기 간편식이 조리되는 주방에 설치된 복수개의 카메라를 통해 상 기 간편식 및 상기 사이드디쉬 각각에 대응하는 조리 과정에 대한 복수개의 영상을 획득하는 단계; 상기 사용자 단말을 사용하는 사용자의 식별자를 상기 사용자 단말로부터 취득하는 단계; 취득된 상기 사용자의 식별자를 상 기 복수개의 영상 각각에 표출시키는 단계; 및 상기 사용자의 식별자가 표출된 상기 복수개의 영상을 상기 사용 자 단말에 실시간으로 제공하는 단계;를 포함할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 장치는 적어도 하나의 프로그램이 기록된 메모리; 및 상기 프로그램을 실행하는 프로세서;를 포함하고, 상기 프로그램은, 사용자 단말 에 간편식 리스트를 제공하는 단계; 상기 사용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택 정보를 수신하는 단계; 상기 선택 정보에 포함된 간편식 및 사이드디쉬에 대 한 영양점수를 시각화하여 상기 사용자 단말에 제공하는 단계; 상기 간편식의 식별코드를 스캔하여 취득된 상기 간편식의 유통기한 정보를 상기 사용자 단말로 제공하는 단계; 및 상기 간편식의 조리영상을 상기 사용자 단말 로 전송하는 단계;를 수행하기 위한 명령어들을 포함한다. 또한, 본 발명의 영양 밸런스화된 간편식 제공 방법은 사용자 단말에 간편식 리스트를 제공하는 단계; 상기 사 용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택 정보를 수신하는 단계; 및 상기 선택 정보 및 상기 선택 정보에 대응하는 레시피를 조리사 단말에 제공하는 단계;를 포 함한다. 상기 간편식 리스트를 제공하는 단계는 상기 사용자 단말에 상기 사용자 단말을 사용하는 사용자의 건강정보를 획득하기 위한 건강정보 항목을 제공하는 단계;를 포함하고, 상기 선택 정보를 수신하는 단계는 상기 사용자 단 말로부터 상기 건강정보 항목에 대응하는 상기 사용자의 건강정보를 수신하는 단계;를 포함할 수 있다. 상기 선택 정보를 수신하는 단계 후, 인공지능 학습 데이터 및 상기 건강정보에 기초하여, 상기 간편식의 기 설 정된 항목별 영양점수를 산출하는 단계; 상기 항목별 영양점수가 각각 기 설정된 최소기준 점수 이상인 경우 상 기 간편식을 제1 그룹으로 결정하고, 상기 항목별 영양점수 중 어느 하나가 상기 최소기준 점수 미만인 경우 상기 간편식을 제2 그룹으로 결정하는 단계; 상기 간편식이 속하는 그룹에 따라 사이드디쉬 후보군을 생성하는 단 계; 상기 간편식의 항목별 영양점수, 상기 간편식과 사이드디쉬 후보군 중 사용자에 의해 임시 선택된 적어도 하나의 사이드디쉬로 구성된 사이드디쉬 세트의 영양점수를 상기 사용자 단말에 제공하는 단계; 및 상기 사용자 단말로부터 상기 사이드디쉬에 대한 선택 여부를 포함하는 최종 선택 정보를 수신하는 단계;를 포함하고, 상기 간편식이 속하는 그룹에 따라 사이드디쉬 후보군을 생성하는 단계는, 상기 간편식이 상기 제1 그룹에 속하는 경 우에는 각 항목별 영양밸런스를 향상시키기 위한 사이드디쉬들로 구성된 제1 사이드디쉬 후보군을 생성하되 상 기 간편식이 상기 제2 그룹에 속하는 경우 상기 최소기준 점수 미만인 항목에 대응하는 영양점수를 보충해줄 수 있는 사이드디쉬들로 구성된 제2 사이드디쉬 후보군을 생성하며, 상기 사이드디쉬 후보군을 생성하는 단계는, 상기 간편식의 원가에 기초하여, 상기 사이드디쉬의 상한액을 산출하는 단계; 상기 상한액에 기초하여, 상기 사 이드디쉬 후보군을 생성하는 단계; 및 상기 사이드디쉬 후보군에 포함되는 재료의 원가에 기초하여, 상기 사이 드디쉬에 대응하는 가격을 산출하는 단계;를 포함하고, 상기 사용자 단말에 제공하는 단계는, 상기 사이드디쉬 에 대응하는 가격을 상기 사용자 단말에 제공하는 단계;를 포함할 수 있다. 상기 기 설정된 항목별 영양점수를 산출하는 단계는, 상기 인공지능 학습 데이터에 기초하여, 상기 간편식에 대 응하는 항목별 제1 영양점수를 산출하는 단계; 및 상기 건강정보에 포함된 상기 사용자의 건강상태에 기초하여, 상기 제1 영양점수에 가산점 또는 감점을 부여하여 제2 영양점수를 산출하는 단계;를 포함하고, 상기 제2 영양 점수를 산출하는 단계는, 상기 간편식을 섭취하는 것이 상기 사용자의 건강상태에 해로움이 있을 것으로 판단되 는 경우 상기 제1 영양점수에 감점을 부여하여 제2 영양점수를 산출하고, 상기 선택 정보에 포함된 간편식을 섭 취하는 것이 상기 사용자의 건강상태에 이로움이 있을 것으로 판단되는 경우 상기 제1 영양점수에 가산점을 부 여하여 제2 영양점수를 산출하는 단계;를 포함할 수 있다. 상기 레시피를 조리사 단말에 제공하는 단계는, 상기 최종 선택 정보에 사이드디쉬가 포함되지 않은 경우, 상기 조리사 단말에 상기 간편식에 대응하는 레시피를 제공하고, 상기 최종 선택 정보에 사이드디쉬가 포함된 경우, 상기 조리사 단말에 상기 간편식 및 상기 사이드디쉬에 대응하는 레시피를 제공하는 단계;를 포함할 수 있다. 상기 간편식의 항목별 영양점수, 상기 사이드디쉬 후보군 및 상기 사이드디쉬 후보군에 따라 조리된 사이드디쉬 에 대응하는 영양점수를 포함하는 항목별 영양점수를 상기 사용자 단말에 제공하는 단계는 상기 항목별 영양점 수를 시각화하여 제공하는 단계를 포함할 수 있다. 상기 시각화하여 제공하는 단계는 상기 영양점수를 각 항목별로 구분되도록 시각화하는 단계 및 상기 각 항목별 로 상기 간편식의 영양점수 및 상기 사이드디쉬의 영양점수가 서로 구분되도록 시각화하는 단계를 포함할 수 있 다. 상기 조리사 단말에 제공하는 단계 후 주방에 설치된 복수개의 카메라를 통해 상기 간편식 및 사이드디쉬 각각 에 대응하는 조리 과정에 대한 복수개의 영상을 획득하는 단계 및 상기 복수개의 영상을 사용자 단말에 실시간 으로 제공하는 단계를 포함할 수 있다. 상기 복수개의 영상을 사용자 단말에 제공하는 단계는 상기 조리사 단말에 상기 레시피가 제공된 순서에 기초하 여, 기 설정된 시간 간격으로 상기 복수개의 영상을 순차적으로 제공하는 단계를 포함할 수 있다. 상기 최종 선택 정보는 상기 사용자에 대응하는 식별자를 포함하고, 상기 복수개의 영상을 순차적으로 제공하는 단계는 상기 복수개의 영상에 상기 식별자를 포함하여 상기 사용자 단말에 제공하는 단계를 포함할 수 있다. 상기 선택 정보를 수신하는 단계는 상기 선택 정보에 포함된 간편식에 대한 배송조건을 수신하는 단계를 포함하 고, 상기 조리사 단말에 제공하는 단계 후 상기 사용자 단말로부터 상기 사용자의 제1 위치 정보를 수신하는 단 계, 상기 배송조건이 배달인 경우, 배송자 단말에 상기 제1 위치 정보를 제공하는 단계 및 상기 사용자 단말 및 상기 배송자 단말 중 적어도 하나로부터 상기 사용자에게 상기 선택 정보에 포함된 간편식이 배송되었음을 지시 하는 확인 정보를 수신하는 단계를 포함할 수 있다. 상기 조리사 단말에 제공하는 단계 후 상기 사용자 단말로부터 상기 사용자의 제1 위치 정보를 수신하는 단계, 상기 배송조건이 테이크아웃인 경우, 다른 사용자의 간편식 주문 건에 대한 상기 사용자의 추가배달 가능 여부 를 산출하는 단계, 상기 사용자가 추가배달이 가능한 경우, 배달 가능한 상기 다른 사용자의 제2 위치 정보 및 상기 다른 사용자가 주문한 간편식에 대응하는 정보를 포함하는 추가배달 리스트를 상기 사용자 단말에 제공하 는 단계, 상기 사용자 단말로부터 추가배달 선택 정보를 수신하는 단계, 상기 사용자 단말 및 매장 단말 중 적 어도 하나로부터 상기 사용자에게 상기 선택 정보에 포함된 간편식이 제공되었음을 지시하는 확인 정보를 수신 하는 단계 및 상기 사용자가 추가배달을 선택한 경우, 상기 사용자 단말 및 상기 매장 단말 중 적어도 하나로부터 상기 사용자에게 상기 추가배달에 대응하는 대금을 지급하였음을 지시하는 확인 정보를 수신하는 단계를 포 함할 수 있다. 상기 사용자의 추가배달 가능 여부를 산출하는 단계는 상기 제1 위치 정보에 기초하여, 매장으로부터 상기 제1 위치 정보에 대응하는 제1 위치까지 제1 경로를 산출하는 단계, 상기 제2 위치 정보에 기초하여, 상기 매장으로 부터 상기 제2 위치 정보에 대응하는 제2 위치를 경유한 후 상기 제1 위치까지 제2 경로를 산출하는 단계, 상기 제1 경로 및 제2 경로에 기초하여, 추가배달 점수를 산출하는 단계 및 상기 추가배달 점수가 기 설정된 점수 이 상인 경우, 상기 사용자가 추가배달이 가능한 것으로 산출하는 단계를 포함할 수 있다. 상기 추가배달 점수를 산출하는 단계는 상기 사용자가 상기 제1 경로 대비 상기 제2 경로로 이동하는 경우, 추 가 소요시간 및 추가 거리에 대응하는 제1 점수를 산출하는 단계, 상기 제1 점수에 상기 다른 사용자가 주문한 간편식의 무게에 대응하는 제1 가중치를 부여하여 제2 점수를 산출하는 단계 및 상기 추가 소요시간 및 추가 거 리 대비 상기 대금에 기초하여, 상기 제2 점수에 제2 가중치를 부여하여 제3 점수를 산출하는 단계를 포함할 수 있다. 또한, 본 발명의 일 실시예에 따른 간편식 레시피 제공 장치는 적어도 하나의 프로그램이 기록된 메모리 및 프 로그램을 실행하는 프로세서를 포함하고, 상기 프로그램은 사용자 단말로부터 간편식 주문에 대응하는 선택 입 력을 수신하는 단계, 상기 사용자 단말에 간편식 리스트를 제공하는 단계, 상기 사용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택 정보를 수신하는 단계 및 상기 선택 정 보 및 상기 선택 정보에 대응하는 레시피를 조리사 단말에 제공하는 단계를 수행하기 위한 명령어들을 포함할 수 있다."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예들에 따르면, 영양 밸런스화된 간편식의 시각화된 영양정보를 사용자에게 전달함으로써 칼로리 관리, 맛과 영양 균형 유지에 대한 동기부여를 제공할 수 있다. 조리하여 제공되는 간편식의 유통기한을 제공받음과 동시에 조리의 전과정을 실시간으로 관찰함으로써 지루한 대기시간에 즐거움을 느낌과 동시에 안심하고 간편식을 취식할 수 있게 된다. 본 개시의 기술적 사상에 따른 효 과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 게시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "될 수 있으며, 단지 본 실시예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다.다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또 일반적으로 사용되는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해 석되지 않는다. 또한, 본 명세서에서 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함될 수 있다. 명세서에서 사용되 는 \"포함한다(comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소, 단계, 동작 및/또는 소자는 하 나 이상의 다른 구성요소, 단계, 동작 및/또는 소자의 존재 또는 추가를 배제하지 않는다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 기반 개인맞춤형 간편식 조리 및 콜드체인 배송 서비스 제공을 위 한 주체들을 나타낸 블록도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공지능 기반 개인맞춤형 간편식 조리 및 콜드체인 배송 서비스 제공을 위한 주체들은 서비스 제공 장치, 사용자 단말 및 조리사 단말을 포함한다. 서비스 제공 장치는 사용자 단말로부터 간편식 주문에 대응하는 선택 입력을 수신하는 장치를 의미할 수 있다. 서비스 제공 장치는 사용자 단말로에 간편식 리스트를 제공하고, 사용자 단말로부터 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함하는 선택 정보를 수신하는 장치를 의미할 수 있다. 서비스 제공 장치는 사용자 단말로부터 수신한 선택 정보에 대응하는 레시피를 조리사 단말에 제공하는 장치를 의미할 수 있다. 사용자 단말은 서비스 제공 장치로부터 간편식 리스트를 수신하고, 서비스 제공 장치에 선택 정 보를 제공하는 장치일 수 있다. 조리사 단말은 서비스 제공 장치로부터 선택 정보에 대응하는 레시피를 수신하는 장치일 수 있다. 서비스 제공 장치 및 사용자 단말, 서비스 제공 장치 및 조리사 단말 각각은 통신망을 통 해 상호 연결될 수 있다. 통신망은 위와 같은 주체들 사이에서 데이터가 송수신되도록 하기 위한 접속 경로를 의미한다. 예컨대, 통신망 은 LANs(Local Area Networks), WANs(Wide Area Networks), MANs(Metropolitan Area Networks), ISDNs(Integrated Service Digital Networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 발명에 적용될 수 있는 통신망의 범위가 이에 한정되는 것은 아니 다. 서비스 제공 장치, 사용자 단말 및 조리사 단말 각각은 예를 들면 PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치에 의해 구현될 수 도 있고, 웹 브라우저(WEB Browser)가 탑재된 데스크톱(desktop), 노트북, 랩톱(laptop) 등에 의해 구현될 수도 있으며, 수요자 인터페이스 및 공급자 인터페이스 각각은 스마트폰, 스마트 노트, 태블릿 PC, 스마트 카메라, 스마트 TV, 웨어러블(wearable) 컴퓨터 등의 각종 스마트 기기일 수도 있다. 도 2는 본 발명의 일 실시예에 따른 영양 밸런스화된 간편식 제공 방법을 나타낸 동작 흐름도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 영양 밸런스화된 간편식 제공 방법에 따르면 먼저, 사용자 단말 로부터 간편식 주문에 대응하는 선택 입력을 수신할 수 있다(S210). 다음으로, 상기 사용자 단말에 간편식 리스트를 제공할 수 있다(S220). 여기서, 상기 간편식 리스트는 칼로리별 로 분류되거나 식단조절 목표별로 분류될 수 있다. 구체적으로, 상기 간편식 리스트는 주문될 간편식의 개별 칼 로리별로 분류되거나, 사용자의 당일 권장 칼로리, 기 섭취 칼로리 및 잔여 칼로리에 기초하여 분류되거나, 체 중감량, 벌크업, 근육강화, 체질개선 등의 식단조절 목표별로 분류될 수 있다. 이 때, 상기 사용자 단말에 상기 사용자 단말을 사용하는 사용자의 건강정보를 획득하기 위한 건강정보 항목을 제공할 수 있다. 상기 건강정보 항목은 예를 들면 사용자의 기본신체정보(예를 들어, 나이, 키, 몸무게 등), 건 강검진 수치(혈압, 혈당량 등), 당일 섭취한 식단내용 등일 수 있으나, 이에 제한되지 않는다. 다음으로, 상기 사용자 단말로부터 상기 간편식 리스트에 포함된 간편식들 중 적어도 하나에 대한 선택을 포함 하는 선택 정보를 수신할 수 있다(S230). 이 때, 상기 사용자 단말로부터 상기 건강정보 항목에 대응하는 상기 사용자의 건강정보를 수신할 수 있다. 상 기 건강정보 수신은 사용자로부터 개별 항목별 값을 입력 받거나 사용자의 건강검진결과표를 스캔함으로써 수행 될 수 있다. 다음으로, 상기 선택 정보 및 상기 선택 정보에 대응하는 레시피를 조리사 단말에 제공할 수 있다(S240). 도 3은 본 발명의 일 실시예에 따른 간편식 영양밸런스화 방법을 나타낸 동작 흐름도이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 간편식 영양밸런스화 방법에 따르면 상기 선택 정보를 수신하는 단계 후, 인공지능 학습 데이터 및 상기 건강정보에 기초하여, 상기 간편식의 기 설정된 항목별 영양점수를 산 출할 수 있다(S310). 여기서, 상기 간편식의 영양점수 산출에 사용되기 위한 영양정보는 예를 들어 조리사 단말의 카메라 렌즈를 통 해 촬영된 개별조리식 표시정보(예를 들어, 제품명, 제조사, 영양성분표시 등)에 기초하여 수집될 수 있으며, 수집된 정보는 데이터베이스화될 수 있다. 다만 이에 제한되지 않고, 간편식의 영양정보는 간편식의 고유 식별 정보에 기초하여 고유 식별정보별 영양정보가 데이터베이스화된 외부 데이터베이스를 통해 수집될 수도 있다. 여기서, 인공지능 학습 데이터는 상기 간편식 리스트에 포함된 간편식들의 조리에 필요한 재료들 각각에 대응하 는 영양점수(NS, Nutri-Score)를 학습한 데이터를 포함할 수 있다. 영양점수의 산출은 수요자의 건강정보 및 선 택된 조리식의 영양성분에 기초하여 수행될 수 있으며, 도 4에서 후술할 영양점수 학습 블록을 통해 딥러닝될 수 있다. 다음으로, 상기 항목별 영양점수가 각각 기 설정된 최소기준 점수 이상인 경우 상기 간편식을 제1 그룹으로 결 정하고, 상기 항목별 영양점수 중 어느 하나가 상기 최소기준 점수 미만인 경우 상기 간편식을 제2 그룹으로 결 정할 수 있다(S320). 다음으로, 상기 간편식이 속하는 그룹에 따라 사이드디쉬 후보군을 생성할 수 있다(S330). 이 때, 상기 간편식이 제2 그룹에 속하는 경우, 상기 최소기준 점수 미만인 항목에 대응하는 영양점수를 보충해 줄 수 있는 사이드디쉬 후보군을 생성하고, 상기 간편식이 제1 그룹에 속하는 경우에는 각 항목별 영양밸런스를 고려하여 사이드디쉬 후보군을 생성할 수 있다. 다음으로, 상기 간편식의 항목별 영양점수, 상기 간편식과 사이드디쉬 후보군 중 사용자에 의해 임시선택된 적 어도 하나의 사이드디쉬로 구성된 사이드디쉬 세트의 영양점수를 포함하는 항목별 영양점수를 시각화하여 상기 사용자 단말에 제공할 수 있다(S340). 여기서 사이드디쉬라 함은 밑반찬, 샐러드, 주스 등의 음료, 액상 또는 분말 영양제 등을 포함하는 음식물로 정의될 수 있다. 다음으로, 상기 사용자 단말로부터 상기 사이드디쉬에 대한 선택 여부를 포함하는 최종 선택 정보를 수신할 수 있다(S350). 이 때, 상기 S240단계는 상기 최종 선택 정보에 사이드디쉬가 포함되지 않은 경우 상기 조리사 단말에 상기 간 편식의 레시피만을 제공하고, 상기 최종 선택 정보에 사이드디쉬가 포함된 경우 상기 조리사 단말에 상기 간편 식 레시피 및 상기 사이드디쉬에 대응하는 레시피를 제공하는 단계를 포함할 수 있다. 도 4는 본 발명의 일부 실시예들에 따른 서비스 제공 장치의 영양점수 학습 블록 딥러닝 알고리즘 구조도 이다. 도 4를 참조하면, 영양점수(NS) 학습 딥러닝 모델의 입력데이터는 수분, 단백질, 지방, 탄수화물, 총당류, 자당, 포도당, 과당, 유당, 맥아당, 갈락토오스, 당알콜, 에리스리톨, 총 식이섬유, 수용성 식이섬유, 불용성 식이섬유, 셀룰로오스, 리그닌, 칼슘, 철, 마그네슘, 인, 칼륨, 나트륨, 아연, 구리, 망간, 셀레늄, 몰리브덴, 요오드, 염소, 비타민 A, 레티놀, 베타카로틴, 비타민 D(D2+D3), 비타민 D2, 비타 민 D3, 비타민 D1, 비타민 E, 알파 토코페롤, 베타 토코페롤, 감마 토코페롤, 델타 토코페롤, 알파 토코 트리에놀, 베타 토코트리에놀, 감마 토코트리에놀, 델타 토코트리에놀, 토코페롤, 토코트리에놀, 비타민K, 비타민 K1, 비타민 K2, 비타민 B1, 비타민 B2, 나이아신, 나이아신(NE), 니코틴산, 니코틴아마이드, 판토텐산, 비타민 B6, 피리독신, 비오틴, 엽산(DFE), 엽산(천연), 엽산(합성), 비타민 B12, 비타민 C, 콜린, 총 아미노산, 필수 아미노산, 이소류신, 류신, 라이신, 메티오닌, 페닐알라닌, 트레오닌, 트립토판, 발 린, 히스티딘, 아르기닌, 비필수 아미노산, 티로신, 시스테인, 알라닌, 아스파르트산, 글루탐산, 글리신, 프롤 린, 세린, 타우린, 글리신 베타인, 호마린, 트리고넬린, 리보핵산, 데옥시리보핵산, 콜레스테롤, 총 지방산, 총 필수 지방산, 총 포화 지방산, 부티르산(4:0), 카프로산(6:0), 카프릴산(8:0), 카프르산(10:0), 라우르산 (12:0), 트라이데칸산(13:0), 미리스트산(14:0), 펜타데칸산(15:0), 팔미트산(16:0), 헵타데칸산(17:0), 스테 아르산(18:0), 아라키드산(20:0), 헨에이코산산(21:0), 베헨산(22:0), 트리코산산(23:0), 리그노세르산(24:0), 총 단일 불포화지방산, 미리스톨레산(14:1), 팔미톨레산(16:1), 헵타데센산(17:1), 올레산(18:1(n-9)), 박센산 (18:1(n-7)), 가돌레산(20:1), 에루크산(22:1), 네르본산(24:1), 총 다중 불포화지방산, 리놀레산(18:2(n- 6)c), 알파 리놀렌산(18:3(n-3)), 감마 리놀렌산(18:3(n-6)), 스테아리돈산(18:4), 에이코사디에노산(20:2(n- 6)), 에이코사트리에노산(20:3(n-3)), 에이코사트리에노산(20:3(n-6)), 아라키돈산 (20:4(n-6)), 에이코사펜타 에노산(20:5(n-3)), 도코사디에노산(22:2), 도코사펜타에노산(22:5(n-3)), 도코사헥사에노산(22:6(n-3)), EPA 와 DHA의 합, 오메가 3 지방산, 오메가 6 지방산, 트랜스 지방산, 트랜스 올레산(18:1(n-9)t), 트랜스 리놀레산 (18:2t), 트랜스 리놀레산(18:3t), 냉산가용성물질, 식염상당량, 회분, 폐기율, 가부, 산가용성물질, 총내용량, 카페인이며, 딥러닝 모델은 5개의 은닉층으로 구성된다. 결과는 출력데이터의 6개 1NS 그룹 중 하나의 1NS 그룹 으로 산출하여 평균치를 최종 1NS으로 이용한다. 딥러닝 알고리즘의 세부 계산의 설명은 다음과 같다. Input Data x에 대해서 첫 번째 은닉층의 값과 두 번째 은닉층의 값은 수학식 1 내지 2와 같이 계산되며, 추정 값은 수학식 3에 의해 계산되고, Learning rate는 0.001, 학습주기(training epochs)는 5000, 5개의 은닉층과 128개의 노드로 구성한다. 수학식 1"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "수학식 3"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서 σ는 시그모이드함수(sigmoid function)이며, σ는 수학식 4로 정의된다. 수학식 4"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "위의 딥러닝 모델에서 매개변수를 업데이트하기 위해서 출력층(output Layer)에서 원하는 목표 값(target output)과 네트워크가 생산한 추정 결과들끼리의 손실함수(loss function)를 계산하여 그 값을 최소화하는 방식 을 취한다.일반적으로 많이 선택하는 손실함수는 아래의 수학식 5 내지 8과 같으며, 원하는 다차원의 목표 값(d- dimensional target output)을 t=[t1,…,td]로, 추정 값(estimated output)을 y=[y1,…,yd] 로 정의하면, 각 수식에 의해 계산된 값을 가장 작게 만들 수 있도록 하는 가중치(weight)와 편향(bias)값들을 조정한다. 수학식 5"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 6"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "수학식 7"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "수학식 8"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "상기에서는 상황에 따라 조금씩 다른 손실함수(loss function)을 사용하지만, 범주 분류(classification)를 위 해 소프트맥스 손실 함수(softmax loss function)를 이용한다. 소프트맥스 손실 함수는 기울기(gradient) 값이 수치적으로 안정되기 때문에 사용한다. 최적화 함수로는 Adam (Adaptive Moment Estimation)을 적용했으며 지금 까지 계산해온 기울기의 지수평균을 저장하며, 기울기의 제곱값의 지수평균을 저장한다. 수학식 9 및 10에서, mt는 과거기울기 제곱의 평균, vt는 과거기울기의 평균이다. 수학식 9"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "수학식 10"}
{"patent_id": "10-2021-0133042", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 12, "content": "도 5는 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 5를 참조하면, 서비스 제공 장치는 사용자 단말로부터 최종 선택되어 수신(S350)된 간편식 및 사이드디 쉬에 대한 영양점수를 시각화하여 제공할 수 있다. 다음으로, 서비스 제공 장치는 최종 선택되어 조리될 간편식의 식별코드를 스캔하고(S420), 식별된 정보로 부터 취득된 상기 간편식의 유통기한 정보를 사용자 단말로 제공할 수 있다(S430). 이 때, 사이드디쉬 재료에 대한 유통기한 정보 또한 사용자 단말로 함께 제공될 수 있으며, 사이드디쉬 재료의 유통기한은 간편식과 유사 하게 식별코드 스캔을 통해 취득되거나, 서비스 제공 장치 내 자체적으로 구축된 식자재 유통기한 데이터 베이스를 통해 취득될 수 있다. 다음으로, 간편식의 조리영상을 획득하고 획득된 영상을 사용자에게 실시간 스트리밍 할 수 있다(S440). 온라인 주문 및 배달/포장 건인 경우 해당 영상은 사용자 단말의 디스플레이를 통해 스트리밍될 수 있으며, 오프라인 매장 내 키오스크 등을 통해 주문된 건일 경우 해당 영상은 식당 홀 등에 구비된 모니터 등을 통해 사용자에게 제공될 수 있다. 해당 주문이 배달 건인 경우, 포장 및 배달 과정에서 조리된 간편식의 신선배송 상태정보 및 플레이트 아이디어 가 사용자에게 제공될 수 있다. 신선배송 상태정보는 조리된 간편식이 수용되는 배달박스 내부 온습도 정보 및 위치정보 등을 포함할 수 있다. 도 6은 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 6을 참조하면, 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법에 따르면 상기 조리사 단말에 제공하는 단계 후, 주방에 설치된 복수개의 카메라를 통해 상기 간편식 및 사이드디쉬 각각에 대응하는 조리 과 정에 대한 복수개의 영상을 획득할 수 있다(S810). 다음으로, 상기 복수개의 영상을 상기 사용자 단말에 실시간 으로 제공할 수 있다(S820). 이 때, 상기 조리사 단말에 상기 레시피가 제공된 순서에 기초하여, 기 설정된 시 간 간격으로 상기 복수개의 영상을 순차적으로 제공할 수 있다. 여기서, 상기 최종 선택 정보는 상기 사용자에 대응하는 식별자(ex, ID, 닉네임 등)를 포함할 수 있고, 상기 복 수개의 영상의 적어도 일측영역에 상기 식별자가 노출된 화면를 포함하여 상기 사용자 단말에 제공할 수 있다. 도 7은 본 발명의 일 실시예에 따른 컴퓨터 시스템을 나타낸 도면이다. 본 발명의 일 실시예에 따른 서비스 제공 장치는 컴퓨터로 읽을 수 있는 기록매체와 같은 컴퓨터 시스템 에서 구현될 수 있다. 도 7을 참조하면, 컴퓨터 시스템은 버스를 통하여 서로 통신하는 하나 이상의 프로세서, 메 모리, 사용자 인터페이스 입력 장치, 사용자 인터페이스 출력 장치 및 스토리지를 포 함할 수 있다. 또한, 컴퓨터 시스템은 네트워크에 연결되는 네트워크 인터페이스를 더 포함 할 수 있다. 프로세서는 중앙 처리 장치 또는 메모리나 스토리지에 저장된 프로세싱 인스트 럭션들을 실행하는 반도체 장치일 수 있다. 메모리 및 스토리지는 다양한 형태의 휘발성 또는 비 휘발성 저장 매체일 수 있다. 예를 들어, 메모리는 ROM이나 RAM을 포함할 수 있다. 본 발명에서 설명하는 특정 실행들은 일 실시예들로서, 어떠한 방법으로도 본 발명의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 상기 시스템들의 다른 기 능적인 측면들의 기재는 생략될 수 있다. 또한, 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부재들 은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대체 가 능하거나 추가의 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, “필 수적인”, “중요하게” 등과 같이 구체적인 언급이 없다면 본 발명의 적용을 위하여 반드시 필요한 구성 요소 가 아닐 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2021-0133042", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 위한 주체들을 나타낸 블록도이다. 도 2는 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 3은 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 4는 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 6은 본 발명의 일 실시예에 따른 간편식 관련정보 다각화 제공 방법을 나타낸 동작 흐름도이다. 도 7은 본 발명의 일 실시예에 따른 컴퓨터 시스템을 나타낸 도면이다."}
