{"patent_id": "10-2021-0021337", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0117685", "출원번호": "10-2021-0021337", "발명의 명칭": "전자 장치의 지속적 그룹 정보 관리 방법", "출원인": "삼성전자주식회사", "발명자": "조남주"}}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 지속적 그룹 정보 관리 방법에 있어서,외부 전자 장치로부터 P2P(Peer to Peer) 연결 준비 요청을 수신하는 동작;상기 P2P 연결 요청에 대해 P2P 연결 준비 응답을 전송하는 동작;상기 외부 전자 장치에 그룹 오너 협상 요청을 전송하는 동작;상기 외부 전자 장치로부터 그룹 오너 협상 응답을 수신하는 동작;상기 외부 전자 장치와의 지속적 그룹이 형성되면, 지속적 그룹 정보를 저장하는 동작;상기 지속적 그룹 정보가 이벤트에 따라 삭제되면, 외부 전자 장치에 지속적 그룹 정보의 삭제 요청을 전송하는동작;상기 외부 전자 장치에서 지속적 그룹 정보가 삭제되면, 상기 외부 전자 장치로부터 지속적 그룹 정보의 삭제응답을 수신하는 동작을 포함하는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 지속적 그룹 정보의 삭제 요청은,상기 지속적 그룹이 유지된 경우, 상기 지속적 그룹을 형성하는 P2P 연결과 동일한 통신 방식을 통해 전송되는지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 지속적 그룹 정보의 삭제 요청은,상기 지속적 그룹이 해제된 경우, 상기 지속적 그룹을 형성하는 P2P 연결과 다른 통신 방식을 통해 전송되는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 외부 전자 장치는,상기 지속적 그룹 정보가 삭제된 이후에 상기 전자 장치와 P2P 연결을 수행하는 경우, 준비 탐색, 그룹 오너 협상 과정 및 준비 과정을 통해 P2P 연결을 수행하는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 전자 장치는,상기 지속적 그룹 정보가 삭제된 이후, 상기 전자 장치가 속한 그룹이 지속적 그룹이 아니라는 정보를 주변 장치에 전달하는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0117685-3-제1항에 있어서,상기 지속적 그룹 정보는,신뢰 정보(credential)인 인증 타입(authentication type), 암호화 타입(encryption type), 네트워크 키(network key) 및 SSID와 그룹 오너 또는 그룹 클라이언트를 의미하는 그룹 역할을 포함하는 지속적 그룹 정보관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전자 장치의 지속적 그룹 정보 관리 방법에 있어서,외부 전자 장치로부터 P2P(Peer to Peer) 연결 준비 요청을 수신하는 동작;상기 P2P 연결 요청에 대해 P2P 연결 준비 응답을 전송하는 동작;상기 외부 전자 장치에 그룹 오너 협상 요청을 전송하는 동작;상기 외부 전자 장치로부터 그룹 오너 협상 응답을 수신하는 동작;상기 외부 전자 장치와의 지속적 그룹이 형성되면, 지속적 그룹 정보를 저장하는 동작;상기 지속적 그룹 정보가 이벤트에 따라 외부 전자 장치에서 삭제되면, 외부 전자 장치로부터 지속적 그룹 정보의 삭제 요청을 수신하는 동작;상기 삭제 요청에 따라 지속적 그룹 정보를 삭제하는 동작;상기 지속적 그룹 정보가 삭제되면, 상기 외부 전자 장치에 지속적 그룹 정보의 삭제 응답을 전송하는 동작을 포함하는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 지속적 그룹 정보의 삭제 요청은,상기 지속적 그룹이 유지된 경우, 상기 지속적 그룹을 형성하는 P2P 연결과 동일한 통신 방식을 통해 전송되는지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 지속적 그룹 정보의 삭제 요청은,상기 지속적 그룹이 해제된 경우, 상기 지속적 그룹을 형성하는 P2P 연결과 다른 통신 방식을 통해 전송되는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 외부 전자 장치는,상기 지속적 그룹 정보가 삭제된 이후에 상기 전자 장치와 P2P 연결을 수행하는 경우, 준비 탐색, 그룹 오너 협상 과정 및 준비 과정을 통해 P2P 연결을 수행하는 지속적 그룹 정보 관리 방법."}
{"patent_id": "10-2021-0021337", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 전자 장치는,상기 지속적 그룹 정보가 삭제된 이후, 상기 전자 장치가 속한 그룹이 지속적 그룹이 아니라는 정보를 주변 장치에 전달하는 지속적 그룹 정보 관리 방법.공개특허 10-2022-0117685-4-청구항 12 제7항에 있어서,상기 지속적 그룹 정보는,신뢰 정보(credential)인 인증 타입(authentication type), 암호화 타입(encryption type), 네트워크 키(network key) 및 SSID와 그룹 오너 또는 그룹 클라이언트를 의미하는 그룹 역할을 포함하는 지속적 그룹 정보관리 방법."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치의 지속적 그룹 정보 관리 방법이 개시된다. 전자 장치는 지속적 그룹의 그룹 멤버이며, 특정 이벤트 에 따라 지속적 그룹 정보가 삭제되면, 지속적 그룹의 그룹 멤버들이 저장하고 있는 지속적 그룹 정보를 삭제할 것을 요청하는 메시지를 그룹 멤버들에게 전송하여, 지속적 그룹 정보를 삭제하여 동기화가 진행될 수 있도록 할 수 있다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 다양한 실시예들은 전자 장치의 지속적 그룹 정보 관리 방법에 관한 것이다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치들 간에 P2P(Peer to Peer) 방식으로 1:1 연결을 진행하여 그룹을 형성하는 경우, 어느 하나의 전자 장치는 그룹의 오너의 역할을 하고, 나머지 하나의 전자 장치는 그룹의 클라이언트의 역할을 할 수 있다. P2P 연결을 위해서 준비 과정 및 협상 과정과 같이 여러 과정이 요구되나, 지속적 그룹을 형성하면 P2P 연결을 위해 요구되는 별도의 사전 절차를 진행하지 않고도 P2P 연결이 가능할 수 있다. 지속적 그룹을 형성하면 지속적 그룹에 속하는 그룹의 오너와 그룹의 클라이언트는 지속적 그룹 정보를 각각 저 장할 수 있다. 지속적 그룹 정보의 관리를 통해 불필요한 P2P 연결이 발생되지 않을 수 있다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "P2P 연결을 통해 지속적 그룹을 형성한 후, 지속적 그룹 정보를 지속적 그룹의 오너와 클라이언트가 각각 저장 하고 있다가 어느 하나에서 지속적 그룹 정보가 삭제되는 경우, 그룹에 속한 다른 주체에게 지속적 그룹 정보를 삭제하도록 하여 P2P 연결의 실패 과정을 줄일 수 있다. 본 문서에 개시되는 다양한 실시예에 따르면, 지속적 그룹 정보를 저장하고 있는 지속적 그룹의 오너 또는 클라 이언트 중 어느 하나에서 지속적 그룹 정보가 삭제되면, 지속적 그룹 정보가 삭제된 그룹 멤버가 지속적 그룹 정보를 저장하고 있는 다른 그룹 멤버에게 지속적 그룹 정보를 삭제할 것을 요청함으로써 지속적 그룹에 속하는 멤버 전체가 지속적 그룹 정보를 동일한 상태로 유지할 수 있다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일실시예에 따른 전자 장치의 지속적 그룹 정보 관리 방법은 외부 전자 장치로부터 P2P(Peer to Peer) 연결 준비 요청을 수신하는 동작; 상기 P2P 연결 요청에 대해 P2P 연결 준비 응답을 전송하 는 동작; 상기 외부 전자 장치에 그룹 오너 협상 요청을 전송하는 동작; 상기 외부 전자 장치로부터 그룹 오너 협상 응답을 수신하는 동작; 상기 외부 전자 장치와의 지속적 그룹이 형성되면, 지속적 그룹 정보를 저장하는 동작; 상기 지속적 그룹 정보가 이벤트에 따라 삭제되면, 외부 전자 장치에 지속적 그룹 정보의 삭제 요청을 전 송하는 동작; 상기 외부 전자 장치에서 지속적 그룹 정보가 삭제되면, 상기 외부 전자 장치로부터 지속적 그룹 정보의 삭제 응답을 수신하는 동작을 포함할 수 있다. 본 문서에 개시되는 일실시예에 따른 전자 장치의 지속적 그룹 정보 관리 방법은 외부 전자 장치로부터 P2P(Peer to Peer) 연결 준비 요청을 수신하는 동작; 상기 P2P 연결 요청에 대해 P2P 연결 준비 응답을 전송하 는 동작; 상기 외부 전자 장치에 그룹 오너 협상 요청을 전송하는 동작; 상기 외부 전자 장치로부터 그룹 오너 협상 응답을 수신하는 동작; 상기 외부 전자 장치와의 지속적 그룹이 형성되면, 지속적 그룹 정보를 저장하는 동작; 상기 지속적 그룹 정보가 이벤트에 따라 외부 전자 장치에서 삭제되면, 외부 전자 장치로부터 지속적 그 룹 정보의 삭제 요청을 수신하는 동작; 상기 삭제 요청에 따라 지속적 그룹 정보를 삭제하는 동작; 상기 지속적 그룹 정보가 삭제되면, 상기 외부 전자 장치에 지속적 그룹 정보의 삭제 응답을 전송하는 동작을 포함할 수 있 다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시예에 따르면, 지속적 그룹에 속한 그룹 멤버들 중 어느 하나의 멤버에서 지속적 그룹 정보가 삭제되는 경우, 삭제된 지속적 그룹 정보에 대응하는 그룹에 속하는 다른 그룹 멤버에게도 지속적 그룹 정보가 삭제되도록 함으로써 지속적 그룹의 그룹 멤버들 간에 P2P 연결시에 불필요한 연결이 배제될 수 있 다. 본 문서에 개시되는 다양한 실시예에 따르면, 지속적 그룹의 그룹 멤버들 간에 지속적 그룹 정보를 동기화함으 로써 지속적 그룹에 대한 효율적인 관리가 가능할 수 있다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 구현될 수 있다. 따라서, 실제 구현되는 형태는 개시된 특정 실시예로만 한정되는 것이 아니며, 본 명세서의 범위는 실시예들로 설명한 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 설명된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되 는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다. 도 1은 일 실시 예에 따른 네트워크 인프라에 적용되는 전자 장치의 구성 요소를 도시한 도면이다. 도 1은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 전자 장치는 무선통신 기능을 가지는 전자 장치일 수 있다. 전자 장치는 예를 들어, 스마트폰, 태블릿 컴퓨터, 휴대용 전화단말기, 랩탑 컴퓨터, 스마트 워치 등 착용가능한 웨어러블 전자 장치, 휴대용 게임용 전자 장치, 내비게이션 장치, 멀티미디어 재생 장치 및 헤드셋 장치 등이 될 수 있다. 전자 장치는 적어도 하나 이상 종류의 무선통신 기능을 지원한다. 무선 통신은 예를 들어, 셀룰러 네트워크 통 신, 무선 근거리 네트워크 통신(예를 들면, Wi-Fi 등), 무선 단거리 네트워크 통신(예를 들면, Bluetooth 등), 범지구 위성항법시스템(Global Positioning System, GPS) 및 근거리 무선 통신(Near Field Communication, NFC) 등이 될 수 있다. 전자 장치는 이러한 무선통신 기능을 지원하기 위해서 적어도 하나의 안테나를 포함한다. 안테나는 무선통신을 통해 신호를 송신하거나 수신하는 기능을 수행한다. 하나의 안테나는 한 종류의 무선통신을 지원할 수도 있고, 둘 이상의 무선통신을 복합적으로 지원할 수도 있다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서 , 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통신 네 트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판 기판, 상기 인쇄 회로 기판 기판의 제1 면(예: 아래 면)에 또는 그에 인 접하여 배치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판 기판의 제2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수 신할 수 있는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외 부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가 적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상 기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제 공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용 한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내 에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없 이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으 로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 도 2는 일 실시 예에 따라 지속적 그룹에 속하는 그룹 멤버들 간의 P2P 연결 과정을 도시한 도면이다. 도 2에 도시된 전자 장치와 외부 전자 장치는 도 1에 도시된 전자 장치의 구성 요소를 포함할 수 있다. 전자 장치와 외부 전자 장치는 P2P 연결을 수행할 수 있다. 일례로, P2P 연결은 Wi-Fi Direct 연결을 통해 수행될 수 있다. Wi-Fi Direct 연결은 Wi-Fi 환경에 속하는 단말들 간에 매개 단말인 액세 스 포인트를 거치지 않고 직접적으로 연결하는 것을 의미할 수 있다. 도 2와 같이 전자 장치와 외부 전자 장치가 P2P 연결을 수행하면 그룹을 형성할 수 있다. 도 2에서 전자 장치는 그룹 오너(group owner)일 수 있고, 외부 전자 장치는 그룹 클라이언트(group client)일 수 있다. 그룹 오너와 그룹 클라이언트는 그룹에 속하는 멤버들 각각의 역할을 의미하며, P2P 연결 과정에 서 협상(negotiation)을 통해 결정될 수 있다. 도 2의 경우, 1개의 전자 장치에 1개의 외부 전자 장치가 연결된 형태를 도시하고 있으나, 본 문서에 서는 1개의 전자 장치에 N개의 외부 전자 장치들이 연결되는 형태를 제외하지 않을 수 있다. 그룹 오너인 전자 장치의 능력에 따라 수용 가능한 외부 전자 장치들의 개수가 증가할 수 있다. 전자 장치와 외부 전자 장치가 그룹을 형성하는 경우, 임시 그룹(temporary group) 또는 지속적 그룹 (persistent group) 중 어느 하나의 그룹으로 설정될 수 있다. 그룹의 종류는 P2P 연결 과정에서 그룹 오너 협 상 과정에서 결정될 수 있다. P2P 연결을 통해 형성된 그룹이 지속적 그룹으로 결정되면, 지속적 그룹에 속한 그룹 멤버들은 신뢰 정보(credential)인 인증 타입(authentication type), 암호화 타입(encryption type), 네 트워크 키(network key) 및 SSID와 그룹 역할 (그룹 오너 또는 그룹 클라이언트)를 포함하는 지속적 그룹 정보 를 저장할 수 있다. 지속적 그룹 정보를 저장하는 그룹 멤버는 다음 번의 P2P 연결할 때 준비 탐색(provision discovery), 그룹 오너 협상 과정(group owner negotiation) 및 준비 과정(provisioning)의 사전 절차를 생략 하고, 지속적 그룹 정보에 기초하여 바로 지속적 그룹을 형성하여 연결 속도가 향상될 수 있다. 준비 탐색은 P2P 디스커버리를 통해 P2P 연결을 하고자 하는 피어 단말의 존재를 확인하는 과정을 의미할 수 있 다. 그룹 오너 협상 과정은 P2P 연결을 통해 형성된 그룹에서 어떤 단말이 오너 또는 클라이언트 중 어떤 역할 을 할 것인지 결정하는 과정을 의미할 수 있다. 준비 과정은 그룹 오너와 그룹 클라이언트가 서로 신뢰 정보를 교환하는 과정을 의미할 수 있다. 지속적 그룹에 속하는 그룹 멤버들이 P2P 연결을 하는 경우, 준비 탐색, 그 룹 오너 협상 과정 및 준비 과정을 거치지 않고 지속적 그룹 정보를 이용하여 신속하게 WiFi Direct와 같은 P2P 연결이 진행될 수 있다. 지속적 그룹의 그룹 오너는 이전 그룹의 속성을 포함하는 절차 요청과 절차 응답과 관련된 메시지를 교환함으로 써 바로 그룹을 생성하고, 그룹 클라이언트는 신뢰 정보를 통해 그룹에 접속함으로써 지속적 그룹이 신속하게 형성될 수 있다. 본 문서에서는 지속적 그룹에 속하는 그룹 멤버들 중 어느 하나의 그룹 멤버에서 지속적 그룹 정보가 삭제되었 을 때, 나머지 그룹 멤버들 모두가 지속적 그룹 정보가 삭제되도록 처리함으로써 지속적 그룹 정보를 저장한 그 룹 멤버가 P2P 연결시에 발생할 수 있는 오류가 해소될 수 있다. 지속적 그룹의 그룹 멤버들은 지속적 그룹 정 보의 상태가 동일하도록 지속적 그룹 정보의 동기화를 수행할 수 있다. 지속적 그룹의 그룹 멤버들 중 어느 하 나의 그룹 멤버에서 지속적 그룹 정보가 삭제되면, 지속적 그룹 정보가 삭제되는 그룹 멤버는 다른 그룹 멤버에 서 지속적 그룹 정보가 삭제되었다는 것을 알림으로써 다른 그룹 멤버들이 저장한 지속적 그룹 정보를 삭제하도 록 요청할 수 있다. 도 3은 일 실시 예에 따라 전자 장치에서 지속적 그룹 정보가 삭제되었을 때 지속적 그룹 정보를 동기화하는 과 정을 도시한 흐름도이다. 도 3은 지속적 그룹을 형성하는 전자 장치(예: 도 1 또는 도 2의 전자 장치)와 외부 전자 장치(예: 도 2의 외부 전자 장치) 중 전자 장치에서 지속적 그룹 정보가 삭제되는 경우를 설명할 수 있다. 도 3에서 설명되는 동작들은 반드시 순차적으로 실행되지 않을 수 있다. 동작 301에서, 전자 장치는 외부 전자 장치로부터 P2P 연결 준비 요청을 수신할 수 있다. 동작 302에서, 전자 장치는 외부 전자 장치에게 P2P 연결 준비 응답을 전송할 수 있다. 동작 303에서, 전자 장치는 외부 전자 장치에게 그룹 오너 협상 요청을 전송할 수 있다. 동작 304에서, 전자 장치는 외부 전자 장치로부터 그룹 오너 협상 응답을 수신할 수 있다. 동작 301 내지 동작 304를 통해 전자 장치와 외부 전자 장치는 지속적 그룹을 형성할 수 있다. 전자 장치 는 지속적 그룹의 그룹 오너로 동작하고, 외부 전자 장치는 지속적 그룹의 그룹 클라이언트로 동작할 수 있다. 지속적 그룹이 형성되면, 동작 305에서 전자 장치는 지속적 그룹 정보를 저장하고, 동작 306에서 외부 전 자 장치는 지속적 그룹 정보를 저장할 수 있다. 지속적 그룹 정보는 전자 장치 및 외부 전자 장치 각각의 파일 시스템에 저장될 수 있다. 도 3과 같이 동작 307에서 그룹 오너인 전자 장치에서 지속적 그룹 정보가 삭제될 수 있다. 지속적 그룹 정보는 전자 장치의 사용자에 의해 삭제되거나 또는 네트워크 정보의 초기화, 전자 장치 전체의 초기 화 또는 전자 장치의 파일 시스템이 오류 중 어느 하나의 이벤트에 따라 삭제될 수 있다. 동작 308에서, 전자 장치는 외부 전자 장치에 지속적 그룹 정보의 삭제 요청을 전송할 수 있다. 동 작 309에서, 외부 전자 장치는 전자 장치로부터 수신한 지속적 그룹 정보의 삭제 요청에 따라 파일 시스템에 저장된 지속적 그룹 정보를 삭제할 수 있다. 동작 310에서, 전자 장치는 외부 전자 장치로 부터 수신한 지속적 그룹 정보의 삭제 요청에 대해 지속적 그룹 정보의 삭제 응답을 외부 전자 장치로부터 수신할 수 있다. 도 3과 같이, 지속적 그룹의 그룹 오너인 전자 장치에서 지속적 그룹 정보가 삭제되면. 전자 장치는 그룹 능력(group capability)에 포함된 지속적 P2P 그룹 비트를 0으로 변경하여 비컨 및 프루브 응답을 주변 장 치에 전송함으로써, 주변 장치가 전자 장치가 속한 그룹이 지속적 그룹이 아니라는 것을 인식하도록 할 수 있다. 전자 장치(예: 도 1 또는 도 2의 전자 장치의 지속적 그룹 정보 관리 방법은 외부 전자 장치(예: 도 2의 외부 전자 장치)로부터 P2P(Peer to Peer) 연결 준비 요청을 수신하는 동작; P2P 연결 요청에 대해 P2P 연결 준비 응답을 전송하는 동작; 외부 전자 장치에 그룹 오너 협상 요청을 전송하는 동작; 외 부 전자 장치로부터 그룹 오너 협상 응답을 수신하는 동작; 외부 전자 장치와의 지속적 그룹이 형성되면, 지속적 그룹 정보를 저장하는 동작; 지속적 그룹 정보가 이벤트에 따라 삭제되면, 외부 전자 장치에 지속적 그룹 정보의 삭제 요청을 전송하는 동작; 외부 전자 장치에서 지속적 그룹 정보가 삭제되면, 외 부 전자 장치로부터 지속적 그룹 정보의 삭제 응답을 수신하는 동작을 포함할 수 있다. 지속적 그룹 정보의 삭제 요청은, 지속적 그룹이 유지된 경우, 지속적 그룹을 형성하는 P2P 연결과 동일한 통신 방식을 통해 전송될 수 있다. 지속적 그룹 정보의 삭제 요청은, 지속적 그룹이 해제된 경우, 지속적 그룹을 형성하는 P2P 연결과 다른 통신 방식을 통해 전송될 수 있다. 외부 전자 장치는, 지속적 그룹 정보가 삭제된 이후에 전자 장치와 P2P 연결을 수행하는 경우, 준비 탐색, 그룹 오너 협상 과정 및 준비 과정을 통해 P2P 연결을 수행할 수 있다. 전자 장치는, 지속적 그룹 정보가 삭제된 이후, 전자 장치가 속한 그룹이 지속적 그룹이 아니라는 정보를 주변 장치에 전달할 수 있다. 지속적 그룹 정보는, 신뢰 정보(credential)인 인증 타입(authentication type), 암호화 타입(encryption type), 네트워크 키(network key) 및 SSID와 그룹 오너 또는 그룹 클라이언트를 의미하는 그룹 역할을 포함할 수 있다. 도 4는 일 실시 예에 따라 외부 전자 장치에서 지속적 그룹 정보가 삭제되었을 때 지속적 그룹 정보를 동기화하 는 과정을 도시한 흐름도이다. 도 4는 지속적 그룹을 형성하는 전자 장치(예: 도 1 또는 도 2의 전자 장치)와 외부 전자 장치(예: 도 2의 외부 전자 장치) 중 외부 전자 장치에서 지속적 그룹 정보가 삭제되는 경우를 설명할 수 있다. 도 4에서 설명되는 동작들은 반드시 순차적으로 실행되지 않을 수 있다. 동작 401에서, 전자 장치는 외부 전자 장치로부터 P2P 연결 준비 요청을 수신할 수 있다. 동작 402에서, 전자 장치는 외부 전자 장치에게 P2P 연결 준비 응답을 전송할 수 있다. 동작 403에서, 전자 장치는 외부 전자 장치에게 그룹 오너 협상 요청을 전송할 수 있다. 동작 404에서, 전자 장치는 외부 전자 장치로부터 그룹 오너 협상 응답을 수신할 수 있다. 동작 401 내지 동작 404를 통해 전자 장치와 외부 전자 장치는 지속적 그룹을 형성할 수 있다. 전자 장치 는 지속적 그룹의 그룹 오너로 동작하고, 외부 전자 장치는 지속적 그룹의 그룹 클라이언트로 동작할 수 있다. 지속적 그룹이 형성되면, 동작 405에서 전자 장치는 지속적 그룹 정보를 저장하고, 동작 406에서 외부 전 자 장치는 지속적 그룹 정보를 저장할 수 있다. 지속적 그룹 정보는 전자 장치 및 외부 전자 장치 각각의 파일 시스템에 저장될 수 있다. 도 4과 같이 동작 407에서 그룹 클라이언트인 외부 전자 장치에서 지속적 그룹 정보가 삭제될 수 있다. 지속적 그룹 정보는 외부 전자 장치의 사용자에 의해 삭제되거나 또는 네트워크 정보의 초기화, 외부 전자 장치 전체의 초기화 또는 외부 전자 장치의 파일 시스템이 오류 중 어느 하나의 이벤트에 따라 삭제 될 수 있다. 동작 408에서, 전자 장치는 외부 전자 장치로부터 지속적 그룹 정보의 삭제 요청을 수신할 수 있다. 동작 409에서, 전자 장치는 외부 전자 장치로부터 수신한 지속적 그룹 정보의 삭제 요청에 따라 파일 시스템에 저장된 지속적 그룹 정보를 삭제할 수 있다. 동작 410에서, 전자 장치는 외부 전자 장치로 부터 수신한 지속적 그룹 정보의 삭제 요청에 대해 지속적 그룹 정보의 삭제 응답을 외부 전자 장치에 전 송할 수 있다. 일 실시 예에 따른 전자 장치(예: 도 1 또는 도 2의 전자 장치의 지속적 그룹 정보 관리 방법은 외부 전자 장치(예: 도 2의 외부 전자 장치)로부터 P2P(Peer to Peer) 연결 준비 요청을 수신하는 동작; P2P 연결 요청에 대해 P2P 연결 준비 응답을 전송하는 동작; 외부 전자 장치에 그룹 오너 협상 요청을 전 송하는 동작; 외부 전자 장치로부터 그룹 오너 협상 응답을 수신하는 동작; 외부 전자 장치 와의 지속적 그룹이 형성되면, 지속적 그룹 정보를 저장하는 동작; 지속적 그룹 정보가 이벤트에 따 라 외부 전자 장치에서 삭제되면, 외부 전자 장치로부터 지속적 그룹 정보의 삭제 요청을 수신하는 동작; 삭제 요청에 따라 지속적 그룹 정보를 삭제하는 동작; 지속적 그룹 정보가 삭제되면, 외부 전 자 장치에 지속적 그룹 정보의 삭제 응답을 전송하는 동작을 포함할 수 있다. 지속적 그룹 정보의 삭제 요청은, 지속적 그룹이 유지된 경우, 지속적 그룹을 형성하는 P2P 연결과 동일한 통 신 방식을 통해 전송될 수 있다. 지속적 그룹 정보의 삭제 요청은, 지속적 그룹이 해제된 경우, 지속적 그룹을 형성하는 P2P 연결과 다른 통신 방식을 통해 전송될 수 있다. 외부 전자 장치는, 지속적 그룹 정보가 삭제된 이후에 전자 장치와 P2P 연결을 수행하는 경우, 준비 탐색, 그룹 오너 협상 과정 및 준비 과정을 통해 P2P 연결을 수행할 수 있다. 전자 장치는, 지속적 그룹 정보가 삭제된 이후, 전자 장치가 속한 그룹이 지속적 그룹이 아니라는 정보를 주변 장치에 전달할 수 있다. 지속적 그룹 정보는, 신뢰 정보(credential)인 인증 타입(authentication type), 암호화 타입(encryption type), 네트워크 키(network key) 및 SSID와 그룹 오너 또는 그룹 클라이언트를 의미하는 그룹 역할을 포함할 수 있다. 도 5는 일 실시 예에 따라 지속적 그룹의 형성 중에 지속적 그룹 정보를 삭제하는 과정을 도시한 흐름도이다. 도 5는 지속적 그룹을 형성하는 전자 장치(예: 도 1 또는 도 2의 전자 장치)와 외부 전자 장치(예: 도 2의 외부 전자 장치) 중 전자 장치에서 지속적 그룹 정보가 삭제되는 경우를 설명할 수 있다. 도 5에서 설명되는 동작들은 반드시 순차적으로 실행되지 않을 수 있다. 도 5는 도 3에 도시된 동작 301 내지 동 작 304 또는 도 4에 도시된 동작 401 내지 동작 404와 같이 P2P 연결을 위한 사전 절차에 따라 이미 지속적 그 룹이 형성된 경우를 전제할 수 있다. 동작 501에서, 전자 장치는 외부 전자 장치로부터 P2P 연결 요청을 수신할 수 있다. 동작 502에서, 전자 장치는 P2P 연결 요청에 대해 P2P 연결 응답을 외부 전자 장치에 전송할 수 있다. 동작 501와 동작 502를 통해 전자 장치와 외부 전자 장치 간에 P2P 연결이 연결되어 지속적 그룹이 형성될 수 있 다. 지속적 그룹 내에서 제1 통신 방식 (예: WiFi Direct 연결)을 통해 전자 장치와 외부 전자 장치 간에 데이터 전송이 가능할 수 있다. 동작 503에서, 전자 장치는 특정 이벤트에 따라 지속적 그룹 정보를 삭제할 수 있다. 일 실시 예에 따르 면, 지속적 그룹 정보는 전자 장치의 사용자에 의해 삭제되거나 또는 네트워크 정보의 초기화, 전자 장치 전체의 초기화 또는 전자 장치의 파일 시스템이 오류 중 어느 하나의 이벤트에 따라 삭제될 수있다. 동작 504에서, 전자 장치는 지속적 그룹 정보를 저장하고 있는 외부 전자 장치에게 지속적 그룹 정보 의 삭제 요청을 전송할 수 있다. 지속적 그룹을 통해 P2P 연결이 된 상태이므로, 전자 장치는 P2P 연결과 동일한 제1 통신 방식을 통해 지속적 그룹 정보의 삭제 요청을 전송할 수 있다. 일례로, 전자 장치는 P2P 연결을 통한 action frame 또는 GAS frame을 이용하여 지속적 그룹 정보의 삭제 요청을 외부 전자 장치로 전달할 수 있다. 동작 505에서, 외부 전자 장치는 전자 장치로부터 수신한 지속적 그룹 정보의 삭제 요청에 따라 지속 적 그룹 정보를 파일 시스템에서 삭제할 수 있다. 동작 506에서, 전자 장치는 외부 전자 장치로부터 지속적 그룹 정보의 삭제 응답을 수신할 수 있다. 일례로, 지속적 그룹을 통해 P2P 연결이 된 상태이므로, 전자 장치는 P2P 연결과 동일한 제1 통신 방식을 통해 지속적 그룹 정보의 삭제 응답을 수신할 수 있다. 도 6은 일 실시 예에 따라 지속적 그룹의 해제 중에 지속적 그룹 정보를 삭제하는 과정을 도시한 흐름도이다. 도 6은 지속적 그룹을 형성하는 전자 장치(예: 도 1 또는 도 2의 전자 장치)와 외부 전자 장치(예: 도 2의 외부 전자 장치) 중 전자 장치에서 지속적 그룹 정보가 삭제되는 경우를 설명할 수 있다. 도 6에서 설명되는 동작들은 반드시 순차적으로 실행되지 않을 수 있다. 도 6은 도 3에 도시된 동작 301 내지 동 작 304 또는 도 4에 도시된 동작 401 내지 동작 404와 같이 P2P 연결을 위한 사전 절차에 따라 이미 지속적 그 룹이 형성된 경우를 전제할 수 있다. 동작 601에서, 전자 장치는 외부 전자 장치로부터 P2P 연결 요청을 수신할 수 있다. 동작 602에서, 전자 장치는 P2P 연결 요청에 대해 P2P 연결 응답을 외부 전자 장치에 전송할 수 있다. 동작 601와 동작 602를 통해 전자 장치와 외부 전자 장치 간에 P2P 연결이 연결되어 지속적 그룹이 형성될 수 있 다. 지속적 그룹 내에서 제1 통신 방식 (예: WiFi Direct 연결)을 통해 전자 장치와 외부 전자 장치 간에 데이터 전송이 가능할 수 있다. 이후, 지속적 그룹은 해제되어 WiFi Direct 연결과 같은 P2P 연결은 종료 될 수 있다. 동작 603에서, 전자 장치는 특정 이벤트에 따라 지속적 그룹 정보를 삭제할 수 있다. 일 실시 예에 따르 면, 지속적 그룹 정보는 전자 장치의 사용자에 의해 삭제되거나 또는 네트워크 정보의 초기화, 전자 장치 전체의 초기화 또는 전자 장치의 파일 시스템이 오류 중 어느 하나의 이벤트에 따라 삭제될 수 있다. 동작 604에서, 전자 장치는 지속적 그룹 정보를 저장하고 있는 외부 전자 장치에게 지속적 그룹 정보 의 삭제 요청을 전송할 수 있다. 지속적 그룹을 통해 P2P 연결이 진행되었다가 P2P 연결이 종료된 상태이므로, 전자 장치는 P2P 연결과 다른 제2 통신 방식을 통해 지속적 그룹 정보의 삭제 요청을 전송할 수 있다. 일 례로, 전자 장치는 제1 통신 방식과 다른 OOB(out of Band)와 같은 블루투스, NFC, BLE 와 같은 제2 통신 방식을 이용하여 지속적 그룹 정보의 삭제 요청을 외부 전자 장치로 전달할 수 있다. 동작 605에서, 외부 전자 장치는 전자 장치로부터 수신한 지속적 그룹 정보의 삭제 요청에 따라 지속 적 그룹 정보를 파일 시스템에서 삭제할 수 있다. 동작 606에서, 전자 장치는 외부 전자 장치로부터 지속적 그룹 정보의 삭제 응답을 수신할 수 있다. 일례로, 지속적 그룹을 통해 P2P 연결이 된 상태이므로, 전자 장치는 P2P 연결과 다른 제2 통신 방식을 통 해 지속적 그룹 정보의 삭제 응답을 수신할 수 있다. 도 7은 일 실시 예에 따라 지속적 그룹 정보가 삭제된 이후의 처리 과정을 도시한 흐름도이다. 도 7은 지속적 그룹을 형성하는 전자 장치(예: 도 1 또는 도 2의 전자 장치), 외부 전자 장치 1(102- 1) 및 외부 전자 장치 2(102-2)(예: 도 2의 외부 전자 장치) 중 외부 전자 장치 1(102-1)에서 지속적 그룹 정보가 삭제되는 경우를 설명할 수 있다. 도 7에서 설명되는 동작들은 반드시 순차적으로 실행되지 않을 수 있 다.도 7에서 전자 장치와 외부 전자 장치(102-1)은 P2P 연결을 위한 지속적 그룹 1을 형성하고, 전자 장치 와 외부 전자 장치(102-2)는 P2P 연결을 위한 지속적 그룹 2를 형성할 수 있다. 도 7에 도시된 바와 같이, 동작 701에서 외부 전자 장치 1는 지속적 그룹 1 정보를 저장할 수 있다. 동작 702에서 전자 장치는 지속적 그룹 1 정보를 저장하고, 동작 703에서 전자 장치는 지속적 그룹 2 정보 를 저장할 수 있다. 동작 704에서, 외부 전자 장치 2(102-2)는 지속적 그룹 2 정보를 저장할 수 있다. 동작 705에서, 특정 이벤트에 따라 외부 전자 장치 1(102-1)에서 지속적 그룹 1 정보가 삭제될 수 있다. 동작 706에서, 전자 장치는 외부 전자 장치 1(102-1)로부터 지속적 그룹 1 정보의 삭제 요청을 수신할 수 있다. 외부 전자 장치 1(102-1)와 외부 전자 장치 2(102-2)는 지속적 그룹 1의 그룹 멤버가 아니므로, 외부 전자 장치 1(102-1)은 외부 전자 장치 2(102-2)에 지속적 그룹 1 정보의 삭제 요청을 전송할 것이 요구되지 않을 수 있다. 동작 707에서, 전자 장치는 지속적 그룹 1 정보를 삭제할 수 있다. 전자 장치와 외부 전자 장치 2(101-2)는 여전히 지속적 그룹 2의 그룹 멤버로 동작한다. 동작 708에서, 전자 장치가 외부 전자 장치 2(102-2)로부터 P2P 연결 요청을 수신할 수 있다. 전자 장치는 외부 전 자 장치 2(102-2)의 P2P연결 요청에 따라 지속적 그룹 2 정보를 이용하여 P2P 연결을 위한 사전 절차를 거치지 않고 바로 P2P 연결을 수행할 수 있다. 동작 709에서, 전자 장치는 외부 전자 장치 2(102-2)에 P2P 연결 응답을 전송할 수 있다. 전자 장치와 외부 전자 장치 2(102-2)는 P2P 연결을 통해 지속적 그룹 2가 형성 될 수 있다. 동작 707 이후에, 외부 전자 장치 1(102-1)이 전자 장치에 P2P 연결 요청을 전달하는 경우, 도 3의 동작 301 내지 동작 304 또는 도 4의 동작 401 내지 동작 4040와 같이 P2P 연결을 위한 사전 절차를 모두 수행하여야 P2P 연결이 가능할 수 있다. 도 8은 일 실시 예에 따라 지속적 그룹 정보를 클라우드를 통해 관리하는 과정을 도시한 도면이다. 도 8은 전자 장치(예: 도 1 또는 도 2의 전자 장치)와 외부 전자 장치 1(102-1)(예: 도 2의 외부 전 자 장치 ) 간에 지속적 그룹 1이 형성되는 것을 고려할 수 있다. 도 8은 전자 장치와 외부 전자 장 치 2(102-2)(예: 도 2의 외부 전자 장치 ) 간에 지속적 그룹 2가 형성되는 것을 고려할 수 있다. 전자 장 치와 외부 전자 장치 3(102-3)(예: 도 2의 외부 전자 장치 ) 간에 지속적 그룹 3이 형성되는 것을 고 려할 수 있다. 도 3 내지 도 7은 지속적 그룹 정보가 삭제되었을 때 수행 주체 간에 지속적 그룹 정보의 삭제 요청이 전달되는 과정이 설명될 수 있다. 도 8은 클라우드를 통해 지속적 그룹 정보가 공유되고, 지속적 그룹 정보를 공유하는 수행 주체들 중 어느 하나의 수행 주체에서 지속적 그룹 정보가 삭제되면 클라우드를 통해 동기화되어 지속적 그룹 정보가 자동적으로 삭제되는 과정이 설명될 수 있다. 일 실시 예에 따르면, 전자 장치는 외부 전자 장치 1(102-1)와 형성된 지속적 그룹 1에 대한 지속적 그룹 1정보, 외부 전자 장치 2(102-2)와 형성된 지속적 그룹 2에 대한 지속적 그룹 2정보 및 외부 전자 장치 3(102- 3)와 형성된 지속적 그룹 3에 대한 지속적 그룹 3정보를 저장할 수 있다. 특정 이벤트에 따라 전자 장치에서 지속적 그룹 3정보가 삭제되면, 클라우드를 통해 동기화되어 지속적 그 룹 3정보를 저장하는 외부 전자 장치 3(102-3)에서도 지속적 그룹 3 정보가 삭제될 수 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 소프트웨어 애플리 케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처 리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만,"}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단 독으로 또는 조합하여 포함할 수 있으며 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계되고 구 성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 위에서 설명한 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 또는 복수의 소프트웨어 모듈로서 작동하 도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2021-0021337", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가진 자라면 이를 기초로 다양한 기술적 수정 및 변형을 적용할 수 있다. 예를 들어, 설명된 기술들이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2021-0021337", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 네트워크 인프라에 적용되는 전자 장치의 구성 요소를 도시한 도면이다. 도 2는 일 실시 예에 따라 지속적 그룹에 속하는 그룹 멤버들 간의 P2P 연결 과정을 도시한 도면이다. 도 3은 일 실시 예에 따라 전자 장치에서 지속적 그룹 정보가 삭제되었을 때 지속적 그룹 정보를 동기화하는 과 정을 도시한 흐름도이다. 도 4는 일 실시 예에 따라 외부 전자 장치에서 지속적 그룹 정보가 삭제되었을 때 지속적 그룹 정보를 동기화하 는 과정을 도시한 흐름도이다. 도 5는 일 실시 예에 따라 지속적 그룹의 형성 중에 지속적 그룹 정보를 삭제하는 과정을 도시한 흐름도이다. 도 6은 일 실시 예에 따라 지속적 그룹의 해제 중에 지속적 그룹 정보를 삭제하는 과정을 도시한 흐름도이다. 도 7은 일 실시 예에 따라 지속적 그룹 정보가 삭제된 이후의 처리 과정을 도시한 흐름도이다. 도 8은 일 실시 예에 따라 지속적 그룹 정보를 클라우드를 통해 관리하는 과정을 도시한 도면이다."}
