{"patent_id": "10-2019-0117704", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0035968", "출원번호": "10-2019-0117704", "발명의 명칭": "사용자의 표정이나 발화를 고려하여 마사지 동작을 제어하는 인공 지능 마사지 장치 및 그 방", "출원인": "엘지전자 주식회사", "발명자": "신원호"}}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "마사지 동작을 제어하는 인공 지능 마사지 장치에 있어서,마이크로폰;카메라; 적어도 하나 이상의 모터를 포함하는 구동부; 및상기 카메라를 통해 사용자의 얼굴을 포함하는 이미지 데이터를 획득하고, 상기 획득한 이미지 데이터를 이용하여 상기 사용자가 발화하는지 판단하고, 상기 사용자가 발화한 경우 상기 마이크로폰을 통해 음성 데이터를 획득하고, 상기 획득한 음성 데이터에 상응하는 의도 정보를 생성하고, 상기 생성한 의도 정보에 기초하여 상기구동부를 제어하여 마사지 동작을 제어하는 프로세서를 포함하는, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 프로세서는상기 사용자가 발화하지 않은 경우, 상기 획득한 이미지 데이터와 마사지 동작 정보를 이용하여 목표 마사지 동작을 결정하고,상기 결정한 목표 마사지 동작에 기초하여 상기 구동부를 제어하여 상기 마사지 동작을 제어하는, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 프로세서는표정 정보 생성 모델을 이용하여 상기 획득한 이미지 데이터로부터 상기 표정 정보를 생성하고,제1 마사지 동작 결정 모델을 이용하여 상기 생성한 표정 정보와 상기 마사지 동작 정보로부터 상기 목표 마사지 동작을 결정하고,상기 표정 정보 생성 모델 및 상기 제1 마사지 동작 결정 모델 각각은인공 신경망을 포함하고, 머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 이용하여 학습되는 모델인, 인공 지능마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 제1 마사지 동작 결정 모델은일정 구간의 이미지 데이터로부터 생성된 표정 정보와 상기 일정 구간의 마사지 동작 정보에 기초하여 상기 목표 마사지 동작을 결정하는 모델인, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 3에 있어서,공개특허 10-2021-0035968-3-상기 프로세서는상기 생성한 의도 정보에 기초하여 상기 마사지 동작을 제어한 경우, 상기 생성한 표정 정보, 상기 마사지 동작정보 및 상기 생성한 의도 정보에 상응하는 상기 마사지 동작의 제어 정보를 포함하는 제1 학습 데이터를 생성하고,상기 제1 학습 데이터는상기 제1 마사지 동작 결정 모델의 학습에 이용되는 학습 데이터인, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 2에 있어서,상기 프로세서는제2 마사지 동작 결정 모델을 이용하여 상기 획득한 이미지 데이터로부터 상기 목표 마사지 동작을 결정하고,상기 제2 마사지 동작 결정 모델 각각은인공 신경망을 포함하고, 머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 이용하여 학습되는 모델인, 인공 지능마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 제2 마사지 동작 결정 모델은일정 구간의 이미지 데이터와 상기 일정 구간의 마사지 동작 정보에 기초하여 상기 목표 마사지 동작을 결정하는 모델인, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 프로세서는상기 생성한 의도 정보에 기초하여 상기 마사지 동작을 제어한 경우, 상기 획득한 이미지 데이터, 상기 마사지동작 정보 및 상기 생성한 의도 정보에 상응하는 상기 마사지 동작의 제어 정보를 포함하는 제2 학습 데이터를생성하고,상기 제2 학습 데이터는상기 제2 마사지 동작 결정 모델의 학습에 이용되는 학습 데이터인, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 2에 있어서,상기 프로세서는상기 생성한 의도 정보가 상기 마사지 동작의 제어와 무관한 경우, 상기 획득한 이미지 데이터와 상기 마사지동작 정보를 이용하여 목표 마사지 동작을 결정하고,상기 결정한 목표 마사지 동작에 기초하여 상기 구동부를 제어하여 상기 마사지 동작을 제어하는, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "에 있어서,상기 프로세서는상기 자율 주행 차량이 자율 주행 중인 상황에서 마사지 동작을 수행하는, 인공 지능 마사지 장치."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "마사지 동작을 제어하는 방법에 있어서,카메라를 통해 사용자의 얼굴을 포함하는 이미지 데이터를 획득하는 단계;상기 획득한 이미지 데이터를 이용하여 상기 사용자가 발화하는지 판단하는 단계;상기 사용자가 발화한 경우 상기 마이크로폰을 통해 음성 데이터를 획득하는 단계;상기 획득한 음성 데이터에 상응하는 의도 정보를 생성하는 단계;상기 생성한 의도 정보에 기초하여 적어도 하나 이상의 모터를 포함하는 구동부를 제어하여 마사지 동작을 제어하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0117704", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "마사지 동작을 제어하는 방법을 수행하기 위한 프로그램이 기록된 기록 매체에 있어서, 상기 마사지 동작을 제어하는 방법은카메라를 통해 사용자의 얼굴을 포함하는 이미지 데이터를 획득하는 단계;상기 획득한 이미지 데이터를 이용하여 상기 사용자가 발화하는지 판단하는 단계;상기 사용자가 발화한 경우 상기 마이크로폰을 통해 음성 데이터를 획득하는 단계;상기 획득한 음성 데이터에 상응하는 의도 정보를 생성하는 단계;상기 생성한 의도 정보에 기초하여 적어도 하나 이상의 모터를 포함하는 구동부를 제어하여 마사지 동작을 제어하는 단계를 포함하는, 기록 매체."}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시 예는 마사지 동작을 제어하는 인공 지능 마사지 장치에 있어서, 마이크로폰; 카메라; 적어도 하나 이상의 모터를 포함하는 구동부; 및 상기 카메라를 통해 사용자의 얼굴을 포함하는 이미지 데이터를 획득하 고, 상기 획득한 이미지 데이터를 이용하여 상기 사용자가 발화하는지 판단하고, 상기 사용자가 발화한 경우 상 기 마이크로폰을 통해 음성 데이터를 획득하고, 상기 획득한 음성 데이터에 상응하는 의도 정보를 생성하고, 상 기 생성한 의도 정보에 기초하여 상기 구동부를 제어하여 마사지 동작을 제어하는 프로세서를 포함하는, 인공 지 능 마사지 장치를 제공한다."}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)는 사용자의 표정이나 발화를 고려하여 마사지 동작을 제어하는 인공 지능 마사지 장치 및 그 방법에 관한 것이다. 구체적으로, 본 개시는 마사지 동작을 제공하는 동안의 사용자의 동작, 표정 또는 발 화 내용을 인식하여 마사지 동작을 제어하는 인공 지능 마사지 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 안마를 통하여 뭉쳐진 근육을 풀거나 피로 및 스트레스를 해소하려는 수요가 많아 안마 기구에 대한 관심 이 높아지고 있다. 안마란 손이나 특수한 기구로 몸을 쓸거나, 주무르거나, 누르거나, 잡아당기거나, 두드리거 나, 움직이거나 하여 혈액 순환을 돕고, 피로가 풀리게 하는 의료 보조 요법의 하나이다. 기계적 장치에 의하여 안마를 수행하는 기구를 안마 기구라 하며, 안마 기구의 대표적인 예로 사용자가 편하게 앉아 안마를 받을 수 있는 안마 의자를 들 수 있다. 한편, 안마의 강도가 너무 강한 경우 사용자에게 고통을 줄 수 있다. 이러한 경우 사용자는 안마의 강도를 낮춰 야 하는데, 사용자는 안마의 강도를 낮추기 위하여 안마 의자에 장착된 입력 장치나 리모콘을 이용한 버튼 조작"}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "을 수행하여야 하는 불편함이 있었다. 발명의 내용"}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 사용자의 표정이나 발화를 고려하여 사용자에게 적합한 마사지 동작을 제공하는 인공 지능 마사지 장 치 및 그 방법을 제공하고자 한다."}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시 예는, 사용자의 얼굴을 포함하는 이미지 데이터를 획득하고, 획득한 이미지 데이터를 이용하 여 사용자가 발화하는지 판단하고, 사용자가 발화한 경우 마이크로폰을 통해 음성 데이터를 획득하고, 획득한 음성 데이터에 상응하는 의도 정보를 생성하고, 의도 정보에 기초하여 마사지 동작을 제어하는 인공 지능 마사 지 장치 및 그 방법을 제공한다. 또한, 본 개시의 일 실시 예는, 사용자가 발화하지 않은 경우, 획득한 이미지 데이터와 마사지 동작 정보를 이 용하여 목표 마사지 동작을 결정하고, 결정한 목표 마사지 동작에 기초하여 마사지 동작을 제어하는 인공 지능 마사지 장치 및 그 방법을 제공한다. 또한, 본 개시의 일 실시 예는, 표정 정보 생성 모델을 이용하여 획득한 이미지 데이터로부터 표정 정보를 생성 하고, 제1 마사지 동작 결정 모델을 이용하여 생성한 표정 정보와 마사지 동작 정보로부터 목표 마사지 동작을 결정하는 인공 지능 마사지 장치 및 그 방법을 제공한다. 또한, 본 개시의 일 실시 예는, 제2 마사지 동작 결정 모델을 이용하여 획득한 이미지 데이터로부터 목표 마사 지 동작을 결정하는 인공 지능 마사지 장치 및 그 방법을 제공한다. 또한, 본 개시의 일 실시 예는, 음성 데이터로부터 생성한 의도 정보에 기초하여 마사지 동작을 제어한 경우, 이미지 데이터 또는 표정 정보, 마사지 동작 정보 및 생성한 의도 정보에 상응하는 마사지 동작의 제어 정보를 포함하는 학습 데이터를 생성하는 인공 지능 마사지 장치 및 그 방법을 제공한다."}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따르면, 사용자의 얼굴을 인식하여 사용자가 발화하는지 판단하므로, 사용자가 기 동어 없이도 음성으로 마사지 동작을 제어할 수 있다. 또한, 본 개시의 다양한 실시 예에 따르면, 사용자의 상호작용이 없더라도, 현재 마사지 동작과 사용자의 표정 의 변화에 기초하여 사용자가 선호하는 마사지 동작으로 변경하도록 제어할 수 있다."}
{"patent_id": "10-2019-0117704", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 '모듈' 및 '부'는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 개시의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 '직접 연결되어' 있다거나 '직접 접속되어' 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. <인공 지능(AI: Artificial Intelligence)> 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. <로봇(Robot)> 로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미할 수 있다. 특히, 환경을 인식하고 스스로 판단하여 동작을 수행하는 기능을 갖는 로봇을 지능형 로봇이라 칭할 수 있다. 로봇은 사용 목적이나 분야에 따라 산업용, 의료용, 가정용, 군사용 등으로 분류할 수 있다. 로봇은 액츄에이터 또는 모터를 포함하는 구동부를 구비하여 로봇 관절을 움직이는 등의 다양한 물리적 동작을 수행할 수 있다. 또한, 이동 가능한 로봇은 구동부에 휠, 브레이크, 프로펠러 등이 포함되어, 구동부를 통해 지 상에서 주행하거나 공중에서 비행할 수 있다. <자율 주행(Self-Driving)> 자율 주행은 스스로 주행하는 기술을 의미하며, 자율 주행 차량은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미한다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절 하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하 는 기술 등이 모두 포함될 수 있다. 차량은 내연 기관만을 구비하는 차량, 내연 기관과 전기 모터를 함께 구비하는 하이브리드 차량, 그리고 전기 모터만을 구비하는 전기 차량을 모두 포괄하며, 자동차뿐만 아니라 기차, 오토바이 등을 포함할 수 있다. 이때, 자율 주행 차량은 자율 주행 기능을 가진 로봇으로 볼 수 있다. <확장 현실(XR: eXtended Reality)> 확장 현실은 가상 현실(VR: Virtual Reality), 증강 현실(AR: Augmented Reality), 혼합 현실(MR: Mixed Reality)을 총칭한다. VR 기술은 현실 세계의 객체나 배경 등을 CG 영상으로만 제공하고, AR 기술은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR 기술은 현실 세계에 가상 객체들을 섞고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. MR 기술은 현실 객체와 가상 객체를 함께 보여준다는 점에서 AR 기술과 유사하다. 그러나, AR 기술에서는 가상 객체가 현실 객체를 보완하는 형태로 사용되는 반면, MR 기술에서는 가상 객체와 현실 객체가 동등한 성격으로 사용된다는 점에서 차이점이 있다. XR 기술은 HMD(Head-Mount Display), HUD(Head-Up Display), 휴대폰, 태블릿 PC, 랩탑, 데스크탑, TV, 디지털 사이니지 등에 적용될 수 있고, XR 기술이 적용된 장치를 XR 장치(XR Device)라 칭할 수 있다.이하에서, 인공 지능 마사지 장치(AI massage apparatus)는 인공 지능 장치라 칭할 수 있고, 두 용어는 혼용되 어 사용될 수 있다. 도 1은 본 개시의 일 실시 예에 따른 AI 장치를 나타낸다. 이하에서, 인공 지능 장치는 단말기라 칭할 수 있다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, 인공 지능 장치는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부 , 메모리 및 프로세서 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치(100a 내지 100e)나 AI 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신할 수 있다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센 서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 이때, 프로세서는 음성 입력을 문자열로 변환하기 위한 STT(Speech To Text) 엔진 또는 자연어의 의도 정 보를 획득하기 위한 자연어 처리(NLP: Natural Language Processing) 엔진 중에서 적어도 하나 이상을 이용하여, 사용자 입력에 상응하는 의도 정보를 획득할 수 있다. 이때, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 적어도 일부가 머신 러닝 알고리즘에 따라 학습된 인 공 신경망으로 구성될 수 있다. 그리고, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 러닝 프로세서 에 의해 학습된 것이나, AI 서버의 러닝 프로세서에 의해 학습된 것이거나, 또는 이들의 분산 처리에 의해 학습된 것일 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포 함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 개시의 일 실시 예에 따른 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 3은 본 개시의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 3을 참조하면, AI 시스템은 AI 서버, 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰 (100d) 또는 가전(100e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적용된 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰(100d) 또는 가전(100e) 등을 AI 장치(100a 내지 100e)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(100a 내지 100e, 200)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(100a 내지 100e, 200)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않 고 직접 서로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스 마트폰(100d) 또는 가전(100e) 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(100a 내지 100e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(100a 내지 100e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치 (100a 내지 100e)로 전송할 수 있다. 또는, AI 장치(100a 내지 100e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론 한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 이하에서는, 상술한 기술이 적용되는 AI 장치(100a 내지 100e)의 다양한 실시 예들을 설명한다. 여기서, 도 3에 도시된 AI 장치(100a 내지 100e)는 도 1에 도시된 AI 장치의 구체적인 실시 예로 볼 수 있다. <AI+로봇> 로봇(100a)은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇(100a)은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇(100a)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇(100a)의 상태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용 자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇(100a)은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇(100a)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있 다. 예컨대, 로봇(100a)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇(100a)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 로봇(100a)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇(100a)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적 어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계 획에 따라 로봇(100a)을 주행시킬 수 있다. 맵 데이터에는 로봇(100a)이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇(100a)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 로봇(100a)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+자율주행> 자율 주행 차량(100b)은 AI 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. 자율 주행 차량(100b)은 자율 주행 기능을 제어하기 위한 자율 주행 제어 모듈을 포함할 수 있고, 자율 주행 제 어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 자율 주행 제어 모듈은 자율 주 행 차량(100b)의 구성으로써 내부에 포함될 수도 있지만, 자율 주행 차량(100b)의 외부에 별도의 하드웨어로 구 성되어 연결될 수도 있다. 자율 주행 차량(100b)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 자율 주행 차량(100b)의 상 태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계 획을 결정하거나, 동작을 결정할 수 있다. 여기서, 자율 주행 차량(100b)은 이동 경로 및 주행 계획을 결정하기 위하여, 로봇(100a)과 마찬가지로, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 특히, 자율 주행 차량(100b)은 시야가 가려지는 영역이나 일정 거리 이상의 영역에 대한 환경이나 객체는 외부 장치들로부터 센서 정보를 수신하여 인식하거나, 외부 장치들로부터 직접 인식된 정보를 수신할 수 있다. 자율 주행 차량(100b)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수 행할 수 있다. 예컨대, 자율 주행 차량(100b)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인 식된 주변 환경 정보 또는 객체 정보를 이용하여 주행 동선을 결정할 수 있다. 여기서, 학습 모델은 자율 주행 차량(100b)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 자율 주행 차량(100b)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서 버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 자율 주행 차량(100b)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로 와 주행 계획에 따라 자율 주행 차량(100b)을 주행시킬 수 있다. 맵 데이터에는 자율 주행 차량(100b)이 주행하는 공간(예컨대, 도로)에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 가로등, 바위, 건물 등의 고정 객체들과 차량, 보행자 등의 이 동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위 치 등이 포함될 수 있다. 또한, 자율 주행 차량(100b)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 자율 주행 차량(100b)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+XR> XR 장치(100c)는 AI 기술이 적용되어, HMD(Head-Mount Display), 차량에 구비된 HUD(Head-Up Display), 텔레비 전, 휴대폰, 스마트 폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지, 차량, 고정형 로봇이나 이동 형 로봇 등으로 구현될 수 있다. XR 장치(100c)는 다양한 센서들을 통해 또는 외부 장치로부터 획득한 3차원 포인트 클라우드 데이터 또는 이미 지 데이터를 분석하여 3차원 포인트들에 대한 위치 데이터 및 속성 데이터를 생성함으로써 주변 공간 또는 현실 객체에 대한 정보를 획득하고, 출력할 XR 객체를 렌더링하여 출력할 수 있다. 예컨대, XR 장치(100c)는 인식된 물체에 대한 추가 정보를 포함하는 XR 객체를 해당 인식된 물체에 대응시켜 출력할 수 있다.XR 장치(100c)는 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, XR 장치(100c)는 학습 모델을 이용하여 3차원 포인트 클라우드 데이터 또는 이미지 데이터에서 현실 객체를 인식할 수 있고, 인식한 현실 객체에 상응하는 정보를 제공할 수 있다. 여기서, 학습 모델은 XR 장 치(100c)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, XR 장치(100c)는 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. <AI+로봇+자율주행> 로봇(100a)은 AI 기술 및 자율 주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터 테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율 주행 기술이 적용된 로봇(100a)은 자율 주행 기능을 가진 로봇 자체나, 자율 주행 차량(100b)과 상호작용하는 로봇(100a) 등을 의미할 수 있다. 자율 주행 기능을 가진 로봇(100a)은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스 스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 이동 경로 또는 주행 계획 중 하나 이상을 결정 하기 위해 공통적인 센싱 방법을 사용할 수 있다. 예컨대, 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차 량(100b)은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상을 결정할 수 있다. 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)과 별개로 존재하면서, 자율 주행 차 량(100b)의 내부에서 자율 주행 기능에 연계되거나, 자율 주행 차량(100b)에 탑승한 사용자와 연계된 동작을 수 행할 수 있다. 이때, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)을 대신하여 센서 정보를 획득 하여 자율 주행 차량(100b)에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자 율 주행 차량(100b)에 제공함으로써, 자율 주행 차량(100b)의 자율 주행 기능을 제어하거나 보조할 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)에 탑승한 사용자를 모니터링하 거나 사용자와의 상호작용을 통해 자율 주행 차량(100b)의 기능을 제어할 수 있다. 예컨대, 로봇(100a)은 운전 자가 졸음 상태인 경우로 판단되는 경우, 자율 주행 차량(100b)의 자율 주행 기능을 활성화하거나 자율 주행 차 량(100b)의 구동부의 제어를 보조할 수 있다. 여기서, 로봇(100a)이 제어하는 자율 주행 차량(100b)의 기능에는 단순히 자율 주행 기능뿐만 아니라, 자율 주행 차량(100b)의 내부에 구비된 네비게이션 시스템이나 오디오 시스 템에서 제공하는 기능도 포함될 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)의 외부에서 자율 주행 차량 (100b)에 정보를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇(100a)은 스마트 신호등과 같이 자율 주행 차 량(100b)에 신호 정보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자 율 주행 차량(100b)과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다. <AI+로봇+XR> 로봇(100a)은 AI 기술 및 XR 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇, 드론 등으로 구현될 수 있다. XR 기술이 적용된 로봇(100a)은 XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇을 의미할 수 있다. 이 경 우, 로봇(100a)은 XR 장치(100c)와 구분되며 서로 연동될 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇(100a)은 카메라를 포함하는 센서들로부터 센서 정보를 획 득하면, 로봇(100a) 또는 XR 장치(100c)는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치(100c)는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 로봇(100a)은 XR 장치(100c)를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 예컨대, 사용자는 XR 장치(100c) 등의 외부 장치를 통해 원격으로 연동된 로봇(100a)의 시점에 상응하는 XR 영 상을 확인할 수 있고, 상호작용을 통하여 로봇(100a)의 자율 주행 경로를 조정하거나, 동작 또는 주행을 제어하 거나, 주변 객체의 정보를 확인할 수 있다. <AI+자율주행+XR> 자율 주행 차량(100b)은 AI 기술 및 XR 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있 다. XR 기술이 적용된 자율 주행 차량(100b)은 XR 영상을 제공하는 수단을 구비한 자율 주행 차량이나, XR 영상 내 에서의 제어/상호작용의 대상이 되는 자율 주행 차량 등을 의미할 수 있다. 특히, XR 영상 내에서의 제어/상호 작용의 대상이 되는 자율 주행 차량(100b)은 XR 장치(100c)와 구분되며 서로 연동될 수 있다. XR 영상을 제공하는 수단을 구비한 자율 주행 차량(100b)은 카메라를 포함하는 센서들로부터 센서 정보를 획득 하고, 획득한 센서 정보에 기초하여 생성된 XR 영상을 출력할 수 있다. 예컨대, 자율 주행 차량(100b)은 HUD를 구비하여 XR 영상을 출력함으로써, 탑승자에게 현실 객체 또는 화면 속의 객체에 대응되는 XR 객체를 제공할 수 있다. 이때, XR 객체가 HUD에 출력되는 경우에는 XR 객체의 적어도 일부가 탑승자의 시선이 향하는 실제 객체에 오버 랩되도록 출력될 수 있다. 반면, XR 객체가 자율 주행 차량(100b)의 내부에 구비되는 디스플레이에 출력되는 경 우에는 XR 객체의 적어도 일부가 화면 속의 객체에 오버랩되도록 출력될 수 있다. 예컨대, 자율 주행 차량 (100b)은 차로, 타 차량, 신호등, 교통 표지판, 이륜차, 보행자, 건물 등과 같은 객체와 대응되는 XR 객체들을 출력할 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 자율 주행 차량(100b)은 카메라를 포함하는 센서들로부터 센서 정보를 획득하면, 자율 주행 차량(100b) 또는 XR 장치(100c)는 센서 정보에 기초한 XR 영상을 생성하고, XR 장 치(100c)는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 자율 주행 차량(100b)은 XR 장치(100c) 등의 외 부 장치를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 도 4는 본 개시의 일 실시 예에 따른 AI 장치를 나타낸다. 도 1과 중복되는 설명은 생략한다. 통신부는 통신기(communicator)라고 칭할 수 있다. 도 4를 참조하면, 인공 지능 장치는 구동부(160, driver)를 더 포함할 수 있다. 입력부는 영상 신호 입력을 위한 카메라(Camera, 121), 오디오 신호를 수신하기 위한 마이크로폰 (Microphone, 122), 사용자로부터 정보를 입력 받기 위한 사용자 입력부(User Input Unit, 123)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어 명령으로 처리될 수 있다. 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입 력을 위한 것으로서, 영상 정보의 입력을 위하여, AI 장치는 하나 또는 복수의 카메라들을 구비할 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상 등의 화 상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부(Display Unit, 151)에 표시되거나 메모리에 저 장될 수 있다. 마이크로폰은 외부의 음향 신호를 전기적인 음성 데이터로 처리한다. 처리된 음성 데이터는 AI 장치 에서 수행 중인 기능(또는 실행 중인 응용 프로그램)에 따라 다양하게 활용될 수 있다. 한편, 마이크로폰 에는 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알고리 즘이 적용될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력 받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력 되면, 프로세서는 입력된 정보에 대응되도록 AI 장치의 동작을 제어할 수 있다. 사용자 입력부는 기계식 (mechanical) 입력수단(또는, 메커니컬 키, 예컨대, AI 장치의 전/후면 또는 측면에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 터치식 입력수단을 포함할 수 있다. 일 예로서, 터치식 입력수단은, 소프트웨어적인 처리를 통해 터치스크린에 표시되는 가상 키(virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부분에 배치 되는 터치 키(touch key)로 이루어질 수 있다. 센싱부는 센서부라고 칭할 수 있다. 센싱부는 사용자가 접촉하는 부분에 배치되는 정전 센서, 압력 센서 또는 압전 센서 중 적어도 하나를 포 함할 수 있으며, 안마 의자에 사용자가 접촉하는 경우 접촉면 및 접촉 세기 중 적어도 하나에 대한 센서 데이터 를 획득할 수 있다. 이 경우, 프로세서는 센싱부에서 획득한 센서 데이터에 기초하여, 사용자의 체 형, 자세 또는 위치 중 적어도 하나에 대한 정보를 획득할 수 있다. 센싱부에 포함되는 센서는 상술한 정전 센서, 압력 센서 및 압전 센서에 한정되지 아니하며, 관성 센서, 자기 센서, 중력 센서, 자이로스코프 센서, 가속도 센서, 초음파 센서, 광 센서 등 사용자의 체형, 자세 및 위 치 중 적어도 하나에 대한 정보를 획득하는데 이용될 수 있는 센서 데이터를 수집할 수 있는 모든 센서일 수 있 다. 출력부는 디스플레이부(Display Unit, 151), 음향 출력부(Sound Output Unit, 152), 햅틱 모듈(Haptic Module, 153), 광 출력부(Optical Output Unit, 154) 중 적어도 하나를 포함할 수 있다. 디스플레이부는 AI 장치에서 처리되는 정보를 표시(출력)한다. 예컨대, 디스플레이부는 AI 장치 에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이부는 터치 센서와 상호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현 할 수 있다. 이러한 터치 스크린은, AI 장치와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부 로써 기능함과 동시에, 단말기와 사용자 사이의 출력 인터페이스를 제공할 수 있다. 음향 출력부는 호신호 수신, 통화모드 또는 녹음 모드, 음성인식 모드, 방송수신 모드 등에서 통신부(11 0)로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 음향 출력부는 리시버(receiver), 스피커(speaker), 버저(buzzer) 중 적어도 하나 이상을 포함할 수 있다. 햅틱 모듈(haptic module)은 사용자가 느낄 수 있는 다양한 촉각 효과를 발생시킨다. 햅틱 모듈이 발 생시키는 촉각 효과의 대표적인 예로는 진동이 될 수 있다. 광출력부는 AI 장치의 광원의 빛을 이용하여 이벤트 발생을 알리기 위한 신호를 출력한다. AI 장치 에서 발생 되는 이벤트의 예로는 메시지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메일 수신, 애플리케이션을 통한 정보 수신 등이 될 수 있다. 마사지부는 사용자와 접촉하여 마사지를 수행하는 구성으로, 사용자의 머리를 지지하는 머리 마사지부 , 사용자의 등을 지지하는 등 마사지부, 사용자의 팔을 지지하는 팔 마사지부, 사용자의 엉덩이 를 지지하는 엉덩이 마사지부 또는 사용자의 다리를 지지하는 다리 마사지부 중 적어도 하나 이상을 포함할 수 있다. 머리 마사지부, 등 마사지부, 팔 마사지부, 엉덩이 마사지부 및 다리 마 사지부 각각은 에어백을 포함할 수 있다. 구동부는 회전력을 발생시키는 모터를 통해 마사지를 위한 물리적 움직임 또는 물리력을 발생시킬 수 있고, 발생시킨 물리적 움직임 또는 물리력을 마사지부에 전달할 수 있다. 예컨대, 구동부는 모터 에서 발생한 물리력을 이용하여 마사지 헤드를 움직일 수 있고, 마사지 헤드의 움직임을 통해 사용자의 신 체를 마사지할 수 있다. 마사지 헤드는 구동부의 구성으로 볼 수도 있고, 마사지부의 구성으로 볼 수도 있다. 구동부는 마사지부의 에어백에 공기를 주입하는 인플레이터(192, inflator)를 통해 에어백의 공기압 또는 에어백에의 공기 주입량을 조절할 수 있다. 즉, 인플레이터는 설정된 공급 공기압에 따라 에어백에 공기 공급을 시도할 수 있으며, 만약 에어백의 공기압이 공급 공기압보다 높은 경우라면 에어백의 공기압이 공급 공기압과 같아질 때까지 에어백이 디플레이트(deflate)되고, 만약 에어백의 공기압이 공급 공기압보다 낮은 경우라면 에어백의 공기압이 공급 공기압과 같아질 때까지 에어백이 인플레이트(inflate)된다. 특히, 구동부는 모터의 회전 속도 또는 인플레이터의 에공기압 또는 공기 주입량을 조절함으로 써 마사지 강도를 조절할 수 있다. 예컨대, 구동부는 모터의 회전 속도를 증가시키거나, 인플레이터 의 공기압을 감소시킴으로써 마사지 강도를 증가시킬 수 있다. 반대로, 구동부는 모터의 회전 속도를 감소시키거나, 인플레이터의 공기압을 증가시킴으로써 마사지 강도를 감소시킬 수 있다. 에어백의 공기압이 높아질수록 에어백이 인플레이트되므로, 해당 에어백에 상응하는 마사지 헤드와 사용자의 신체 사이의 거리가 멀어지며, 따라서 해당 에어백에 상응하는 신체 부위에 대한 마사지 강도가 낮아지게 된다. 도 4에서는 구동부가 마사지부와 구분된 구성으로 도시되어 있으나, 본 개시가 이에 한정되지는 않는 다. 일 실시 예에서, 마사지부에 포함된 머리 마사지부, 등 마사지부, 팔 마사지부, 엉덩 이 마사지부 및 다리 마사지부 각각은 개별적으로 적어도 하나 이상의 구동부를 포함할 수 있다. 도 5는 본 개시의 일 실시 예에 따른 인공 지능 장치를 나타낸 사시도이다. 도 5를 참조하면, 인공 지능 장치 또는 인공 지능 마사지 장치는 의자 형태의 마사지 장치일 수 있다. 의자 형태의 마사지 장치는 통상의 마사지 의자뿐만 아니라, 마사지 기능 또는 마사지 동작을 제공할 수 있는 마사지부와 구동부 등을 구비한 의자를 포함할 수 있다. 일 실시 예에서, 인공 지능 장치는 마사지부와 구동부를 포함하여 마사지 기능을 제공하는 카 시트(car seat)일 수 있다. 만약, 인공 지능 장치가 카 시트인 경우라면, 인공 지능 장치는 탑재하 고 있는 차량의 일부로 볼 수 있다. 안전을 위해, 인공 지능 장치는 차량이 자율 주행 중인 상황에서만 동작할 수 있다. 인공 지능 장치는 사용자의 머리를 지지하는 머리 마사지부, 사용자의 등을 지지하는 등 마사지부 , 사용자의 팔을 지지하는 팔 마사지부, 사용자의 엉덩이를 지지하는 엉덩이 마사지부 또는 사 용자의 다리를 지지하는 다리 마사지부 중 적어도 하나 이상을 포함할 수 있다. 머리 마사지부, 등 마사지부, 팔 마사지부, 엉덩이 마사지부 및 다리 마사지부 각각 은 하나 이상의 마사지 헤드를 포함할 수 있고, 각 마사지 헤드는 구동부의 모터으로부터 발생한 물 리적 움직임 또는 물리력에 의하여 동작함으로써, 사용자의 신체의 적어도 일부를 마사지할 수 있다. 각 마사 지 헤드는 하나 이상의 또는 하나 이상의 마사지 봉을 포함할 수 있다. 한편, 머리 마사지부, 등 마사지부, 팔 마사지부, 엉덩이 마사지부 및 다리 마사지부 각각은 하나 이상의 하위 안마기를 포함할 수 있다. 예를 들어, 머리 마사지부는 사용자의 머리를 안마할 수 있는 머리 안마기, 사용자의 목을 안마할 수 있는 목 안마기 중 적어도 하나를 포함할 수 있다. 등 마사지 부는 사용자의 어깨를 안마할 수 있는 어깨 안마기, 사용자의 등을 안마할 수 있는 어깨 안마기 및 사용자 의 허리를 안마할 수 있는 허리 안마기 중 적어도 하나를 포함할 수 있다. 다리 마사지부는 사용자의 허 벅지를 안마할 수 있는 허벅지 안마기, 사용자의 종아리를 안마할 수 있는 종아리 안마기 및 사용자의 발을 안 마할 수 있는 발 안마기 중 적어도 하나를 포함할 수 있다. 또한, 인공 지능 장치는 사용자 입력부 또는 사용자 인터페이스부를 포함할 수 있다. 사용자 입력부 는 프로세서의 제어 하에 정보를 디스플레이 하는 디스플레이부(123_1) 및 사용자로부터 입력을 수신 하여 프로세서로 전달하는 입력수단(123_2)을 포함할 수 있다. 사용자 입력부에 포함된 디스플레이 부(123_1)은 출력부의 디스플레이부을 의미할 수 있다. 또한, 인공 지능 장치는 적어도 하나 이상의 카메라와 적어도 하나 이상의 마이크로폰을 포함할 수 있다. 카메라은 인공 지능 장치를 이용하는 사용자의 얼굴을 포함하는 이미지 데이터를 획득할 수 있는 위치에 설치될 수 있다. 마이크로폰는 사용자의 발화 음성을 수음할 수 있는 위치에 설치될 수 있다. 일 실시 예에서, 사용자가 정면을 바라보는 상황에서는, 인공 지능 장치는 정면 방향에 설치된 카메라 와 마이크로폰을 이용하여 사용자의 얼굴을 포함하는 이미지 데이터와 사용자의 발화 음성을 포함하 는 음성 데이터를 획득할 수 있다. 사용자가 측면을 바라보는 상황에서는, 인공 지능 장치는 측면 방향에설치된 카메라와 마이크로폰을 이용하여 사용자의 얼굴을 포함하는 이미지 데이터와 사용자의 발화 음성을 포함하는 음성 데이터를 획득할 수 있다. 도 6은 본 개시의 일 실시 예에 따른 인공 지능 시스템을 나타낸 블록도이다. 도 6을 참조하면, 인공 지능 시스템은 인공 지능 장치, 음성 텍스트 변환(STT: Speech To Text) 서버 , 자연어 처리(NLP: Natural Language Processing) 서버 및 음성 합성 서버를 포함할 수 있다. 인공 지능 장치는 음성 데이터를 STT 서버에 전송할 수 있다. STT 서버는 인공 지능 장치(10 0)로부터 수신한 음성 데이터를 텍스트 데이터로 변환할 수 있다. NLP 서버는 STT 서버로부터 텍스 트 데이터를 수신할 수 있다. NLP 서버는 수신한 텍스트 데이터에 기초하여, 텍스트 데이터에 대한 의도 분석을 수행할 수 있다. NLP 서버는 의도 분석의 수행 결과를 나타내는 의도 분석 정보를 인공 지능 장치 또는 음성 합성 서버에 전송할 수 있다. 음성 합성 서버는 의도 분석 정보에 기초하여 사용자 의 의도를 반영한 합성 음성을 생성하고, 생성된 합성 음성을 인공 지능 장치에 전송할 수 있다. STT 서버는 언어 모델을 이용하여 음성-텍스트 변환의 정확도를 높일 수 있다. 언어 모델은 문장의 확률 을 계산하거나, 이전의 단어들이 주어졌을 때 다음 단어가 나올 확률을 계산할 수 있는 모델을 의미할 수 있다. 예컨대, 언어 모델은 유니그램(Unigram) 모델, 바이그램(Bigram) 모델, N-그램(N-gram) 모델 등과 같은 확률론 적 언어 모델들을 포함할 수 있다. 유니그램 모델은 모든 단어의 활용이 완전히 서로 독립적이라고 가정하는 모델로, 단어 열의 확률을 각 단어의 확률의 곱으로 계산하는 모델이다. 바이그램 모델은 단어의 활용이 이전 1개의 단어에만 의존한다고 가정하는 모델이다. N-그램 모델은 단어의 활용이 이전 (n-1)개의 단어에 의존한다 고 가정하는 모델이다. 즉, STT 서버는 언어 모델을 이용하여 음성 데이터로부터 변환된 텍스트 데이터가 적합하게 변환된 것인지 판단할 수 있고, 이를 통해 음성 데이터에서 텍스트 데이터로의 변환의 정확도를 높일 수 있다. NLP 서버는 텍스트 데이터에 대해, 형태소 분석 단계, 구문 분석 단계, 화행 분석 단계, 대화 처리 단계를 순차적으로 수행하여, 의도 분석 정보를 생성할 수 있다. 형태소 분석 단계는 사용자가 발화한 음성에 대응하는 텍스트 데이터를 의미를 지닌 가장 작은 단위인 형태소 단위로 분류하고, 분류된 각 형태소가 어떤 품사를 가지는지를 결정하는 단계이다. 구문 분석 단계는 형태소 분석 단계의 결과를 이용하여, 텍스트 데이터를 명사구, 동사구, 형용사 구 등으로 구분하고, 구분된 각 구들 사이에, 어떠한 관계가 존재하는지를 결정하는 단계이다. 구문 분석 단계를 통해, 사용자가 발화한 음성의 주 어, 목적어, 수식어들이 결정될 수 있다. 화행 분석 단계는 구문 분석 단계의 결과를 이용하여, 사용자가 발화 한 음성에 대한 의도를 분석하는 단계이다. 구체적으로, 화행 분석 단계는 사용자가 질문을 하는 것인지, 요청 을 하는 것인지, 단순한 감정 표현을 하는 것인지와 같은, 문장의 의도를 결정하는 단계이다. 대화 처리 단계 는 화행 분석 단계의 결과를 이용하여, 사용자의 발화에 대해 대답을 할지, 호응을 할지, 추가 정보를 문의하는 질문을 할지를 판단하는 위한 단계이다. NLP 서버는 대화 처리 단계 후, 사용자가 발화한 의도에 대한 답변, 호응, 추가 정보 문의 중 하나 이상을 포함하는 의도 분석 정보를 생성할 수 있다. 한편, NLP 서버는 인공 지능 장치로부터 텍스트 데이터를 수신할 수도 있다. 예를 들어, 인공 지능 장치가 음성 텍스트 변환 기능을 지원하는 경우, 인공 지능 장치는 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터를 NLP 서버에 전송할 수 있다. 음성 합성 서버는 기 저장된 음성 데이터들을 조합하여, 합성 음성을 생성할 수 있다. 음성 합성 서버 는 모델로 선정된 한 사람의 음성을 녹음하고, 녹음된 음성을 음절 또는 단어 단위로 분할할 수 있다. 음 성 합성 서버는 음절 또는 단어 단위로, 분할된 음성을 내부 또는 외부의 데이터 베이스에 저장할 수 있다. 음성 합성 서버는 주어진 텍스트 데이터에 대응하는 음절 또는 단어를 데이터 베이스로부터 검색하고, 검 색된 음절 또는 단어들의 조합을 합성하여, 합성 음성을 생성할 수 있다. 음성 합성 서버는 복수의 언어들 각각에 대응하는 복수의 음성 언어 그룹들을 저장하고 있을 수 있다. 예 를 들어, 음성 합성 서버는 한국어로 녹음된 제1 음성 언어 그룹, 영어로, 녹음된 제2 음성 언어 그룹을포함할 수 있다. 음성 합성 서버는 제1 언어의 텍스트 데이터를 제2 언어의 텍스트로 번역하고, 제2 음성 언어 그룹을 이용 하여, 번역된 제2 언어의 텍스트에 대응하는 합성 음성을 생성할 수 있다. 인공 지능 시스템은 인공 지능 서버를 더 포함할 수 있다. 인공 지능 서버는 STT 서버에서 이용하는 STT 엔진, NLP 서버에서 이용하는 NLP 엔진, 음성 합성 서버에서 이용하는 음성 합성 엔진 중에서 적어도 하나 이상을 학습시킬 수 있다. 즉, STT 서버, NLP 서버, 음성 합성 서버 중에 서 적어도 하나 이상은 인공 지능 서버에서 학습된 모델들 또는 엔진들을 이용할 수 있다. 도 6에서는 인공 지능 장치, STT 서버, NLP 서버 및 음성 합성 서버가 서로 구분되어 도시 되어 있으나, 본 개시는 이에 한정되지 않는다. 일 실시 예에서, 인공 지능 서버, STT 서버, NLP 서 버 또는 음성 합성 서버 중에서 일부는 하나의 서버로 구성될 수도 있다. 일 실시 예에서, STT 서버 , NLP 서버 또는 음성 합성 서버 중에서 일부는 인공 지능 장치에 포함될 수도 있고, 이는 인공 지능 장치가 STT 서버, NLP 서버 또는 음성 합성 서버의 기능을 수행하는 것을 의미 한다. 도 7은 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지 동작을 제어하는 방법을 나타 낸 동작 흐름도이다. 도 7을 참조하면, 인공 지능 마사지 장치의 프로세서는 카메라를 통해 사용자의 얼굴을 포함하 는 이미지 데이터를 획득한다(S701). 인공 지능 마사지 장치는 적어도 하나 이상의 카메라를 포함할 수 있고, 프로세서는 인공 지능 마사지 장치를 이용하는 사용자의 얼굴이 바라보는 방향에 가장 가까운 카메라를 이용하여 사용자의 얼굴 을 포함하는 이미지 데이터를 획득할 수 있다. 만약, 사용자가 정면을 바라보고 있는 경우라면, 프로세서(18 0)는 정면에 위치한 카메라를 이용하여 이미지 데이터를 획득할 수 있다. 프로세서는 각 카메라로부터 이미지 데이터를 획득하고, 각 이미지 데이터에서 사용자의 안면 및 사 용자의 안면 방향을 결정할 수 있다. 그리고, 프로세서는 이미지 데이터 중에서 결정된 안면 방향이 중심 으로부터 가장 가까운 이미지 데이터를 선택하여 이용할 수 있다. 예컨대, 인공 지능 마사지 장치가 정면 에 제1 카메라, 좌측면에 제2 카메라, 우측면에 제3 카메라를 포함하고, 사용자가 정면을 바라본다면, 제1 카메 라에서 획득한 제1 이미지 데이터에서는 사용자의 안면 방향이 중심에 가깝지만, 제2 카메라에서 획득한 제2 이 미지 데이터와 제3 카메라에서 획득한 제3 이미지 데이터에서는 사용자의 안면 방향이 중심에서 멀다. 이 경우, 프로세서는 제2 이미지 데이터와 제3 이미지 데이터를 이용하지 않고, 제1 이미지 데이터만을 선택 하여 이용할 수 있다 그리고, 인공 지능 마사지 장치의 프로세서는 획득한 이미지 데이터를 이용하여 사용자의 표정 정보 를 생성한다(S703). 일 실시 예에서, 사용자의 표정 정보는 미리 정해진 표정 항목들에 대한 점수를 포함할 수 있다. 예컨대, 프로 세서는 중립(neutral), 찡그림(frown), 웃음(smile) 등의 표정 항목들 각각에 대한 점수를 결정함으로써 사용자의 표정 정보를 생성할 수 있다. 일 실시 예에서, 사용자의 표정 정보는 미리 정해진 감정 항목들에 대한 점수를 포함할 수 있다. 예컨대, 프로 세서는 사용자의 얼굴 또는 표정으로부터, 분노(anger), 경멸(contempt), 혐오(disgust), 두려움(fear), 행복(happiness), 중립(neutral), 슬픔(sadness), 놀람(surprise) 등의 감정 항목들에 대한 점수를 결정함으로 써 사용자의 표정 정보를 생성할 수 있다. 프로세서는 메모리에 저장된 표정 정보 생성 모델을 이용하여, 획득한 이미지 데이터로부터 사용자의 표정 정보를 생성할 수 있다. 또는, 프로세서는 통신부를 통해 인공 지능 서버에 획득한 이미 지 데이터를 전송하고, 인공 지능 서버의 프로세서가 메모리에 저장된 표정 정보 생성 모델을 이용하여 획득한 이미지 데이터로부터 사용자의 표정 정보를 생성하면, 프로세서는 통신부를 통해 인 공 지능 서버로부터 생성된 사용자의 표정 정보를 수신할 수 있다. 표정 정보 생성 모델은 이미지 데이터가 입력되면, 입력된 이미지 데이터에 포함된 사용자의 얼굴에 상응하는 각 표정 항목들에 대한 점수를 출력하는 모델 또는 사용자의 얼굴에 상응하는 각 감정 항목들에 대한 점수를 출 력하는 모델일 수 있다. 표정 정보 생성 모델은 인공 신경망을 포함하여 구성되며, 머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 이용하여 학습되는 모델일 수 있다. 인공 지능 마사지 장치의 러닝 프로세서 또는 인공 지능 서버의 러닝 프로세서는 제1 학습 데이터를 이용하여 표정 정보 생성 모델을 학습할 수 있다. 제1 학습 데이터는 사용자의 얼굴을 포함하는 이미 지 데이터 및 사용자의 얼굴에 상응하는 각 표정 항목들에 대한 점수 또는 각 감정 항목들에 대한 점수를 포함 할 수 있다. 사용자의 얼굴에 상응하는 각 표정 항목들에 대한 점수 또는 각 감정 항목들에 대한 점수는 상응 하는 이미지 데이터에 대한 라벨(label) 또는 라벨 데이터(label data)이며, 표정 정보 생성 모델이 이미지 데 이터로부터 추론(infer)하여야 하는 결과 또는 정답으로 기능할 수 있다. 그리고, 인공 지능 마사지 장치의 프로세서는 획득한 이미지 데이터를 이용하여 사용자가 발화하고 있는지 판단한다(S705). 프로세서는 이미지 데이터에서 사용자의 입술을 검출하고, 사용자의 입술이 움직이는지 판단함으로써 사용 자가 발화하고 있는지 여부를 판단할 수 있다. 사용자가 인공 지능 마사지 장치를 이용하는 경우, 사용자 는 인공 지능 마사지 장치를 기준으로는 고정된 위치에 있다. 따라서, 카메라를 이용하여 획득한 이 미지 데이터에는 사용자의 얼굴이 선명하게 포함될 수 있으며, 따라서 높은 정확도로 사용자의 입술을 검출하고, 입술의 움직임을 판단할 수 있다. 단계(S705)의 판단 결과 사용자가 발화하고 있는 경우, 인공 지능 마사지 장치의 프로세서는 사용자 의 발화 음성을 포함하는 음성 데이터(speech data)를 획득하고, 획득한 음성 데이터에 상응하는 의도 정보를 생성한다(S707). 통상적으로 음성 인식 기능은 사용자가 미리 정해진 기동어를 발화한 경우에 동작한다. 그러나, 본 개시에서는 사용자의 입술의 움직임을 기초로 사용자가 발화하고 있는지 여부를 판단할 수 있으므로, 별도의 기동어 없이도 사용자의 발화 음성을 인식하기 위하여 음성 데이터를 획득할 수 있다. 발화 음성을 인식하기 위하여 음성 데이터를 획득하는 것은, 상시로 활성화된 마이크로폰를 통해서 연속적 으로 음성 데이터를 획득하다가 사용자가 발화하는 것으로 판단되는 상황의 음성 데이터만을 선택하는 것, 또는 사용자가 발화하는 것으로 판단되는 상황에서만 마이크로폰을 활성화하여 음성 데이터를 획득하는 것을 포 함한다. 사용자의 발화 음성은 인공 지능 마사지 장치의 마사지와 관련된 음성일 수도 있고, 마사지와는 상관없는 통상적인 대화 음성일 수도 있으며, 만족감이나 통증 등을 나타내는 허밍(humming), 신음(moaning) 등의 소리일 수도 있다. 본 개시에서는, 허밍이나 신음 등의 소리도 발화의 일부라고 볼 수 있다. 프로세서는 마이크로폰을 통해 음성 데이터를 획득할 수도 있고, 통신부를 통해 외부 장치(미도 시)로부터 음성 데이터를 수신할 수도 있다. 음성 데이터는 사용자의 음성을 포함하는 음파가 디지털 신호로 변환된 것이다. 예컨대, 음성 데이터는 PCM(pulse code modulation), wav, mp3 등의 다양한 형식의 오디오 파일일 수 있다. 프로세서는 전처리(pre-processing)로써 획득한 음성 데이터에서 노이즈를 제거할 수 있다. 프로세서 는 직접 노이즈 제거 엔진 또는 노이즈 제거 필터를 이용하여 노이즈를 제거한 음성 데이터를 생성할 수도 있고, 인공 지능 서버에 음성 데이터를 전송하고 노이즈가 제거된 음성 데이터를 수신할 수도 있다. 또한, 음성 데이터의 볼륨은 미리 정해진 레벨에 맞추어 조절될 수 있다. 음성 데이터의 볼륨의 조절도 전처리 과정의 일부로 볼 수 있다. 이하에서, 음성 데이터는 전처리를 통하여 노이즈가 제거된 음성 데이터를 의미할 수 있다. 프로세서는 STT 엔진을 이용하여 음성 데이터를 텍스트로 변환하고, NLP 엔진을 이용하여 변환된 텍스트에 상응하는 의도 정보를 생성할 수 있다. 음성 데이터를 텍스트로 변환할 때, 프로세서는 음성 데이터의 각 구간에 상응하는 단어별 확률을 산출하고, 산출된 확률에 기초하여 음성 데이터를 텍스트로 변환하고, 변환한 텍스트에 기초하여 의도 정보를 생성할 수 있다. 특히, 프로세서는 가장 높은 확률을 갖는 단어들을 조합 하여 음성 데이터를 텍스트로 변환할 수 있다. 또는, 프로세서는 STT 서버, NLP 서버을 이용하여 음성 데이터에 상응하는 의도 정보를 생성할 수 있다. 예컨대, 프로세서는 통신부를 통해 음성 데이터를 STT 서버에 전송하고, STT 서버는 수신한 음성 데이터를 텍스트로 변환하고, 변환된 텍스트를 NLP 서버에 전송하고, NLP 서버 는 수신한 텍스트에 상응하는 의도 정보를 생성하고, 생성한 의도 정보를 인공 지능 장치에 전송할 수 있 다. 일 실시 예에서, 프로세서는 이미지 데이터를 획득하는 카메라의 위치와 이미지 데이터에서의 사용자 의 안면 방향에 기초하여, 사용자의 실제 안면 방향을 결정하고, 결정된 사용자의 실제 안면 방향에 기초하여 마이크로폰의 빔포밍(beamforming) 방향을 조절하고, 마이크로폰를 통해 사용자의 발화 음성을 포함 하는 음성 데이터를 획득할 수 있다. 인공 지능 마사지 장치는 복수의 마이크로폰들 또는 마이크로 폰 어레이(microphone array)로 구성된 마이크로폰을 포함할 수 있고, 프로세서는 복수의 마이크로폰 들 중에서 적어도 일부 또는 마이크로폰 어레이를 이용하여 빔포밍 방향을 설정할 수 있고, 빔포밍 방향이 설정 된 마이크로폰을 이용하여 빔포밍 방향에서의 음성 데이터를 획득할 수 있다. 그리고, 인공 지능 마사지 장치의 프로세서는 생성한 의도 정보가 마사지 동작의 제어와 관련되어 있 는지 판단한다(S709). 프로세서는 의도 정보에 마사지 동작의 제어를 포함하는 경우에 의도 정보가 마사지 동작의 제어와 관련되 어 있다고 판단할 수 있다. 구체적으로, 마사지 동작의 제어는 마사지 코스의 설정, 마사지 시간의 설정, 마사 지 강도의 설정, 마사지 부위(대상)의 설정 등을 포함할 수 있다. 마사지 코스 또는 마사지 스케줄을 의미할 수 있으며, 마사지 부위, 마사지 시간, 마사지 강도 등에 대한 순차 적인 설정을 포함할 수 있다. 마사지 코스는 적어도 하나 이상의 미리 설정된 프리셋(preset) 마사지 코스 중 에서 선택될 수도 있지만, 사용자의 입력에 의하여 미리 설정된 프리셋 마사지 코스에서 적어도 일부가 수정된 사용자 설정 마사지 코스에서 선택될 수도 있다. 마사지 부위(대상)의 설정은 마사지부에 포함된 머리 마사지부, 등 마사지부, 팔 마사지부 , 엉덩이 마사지부 및 다리 마사지부 각각의 동작 여부를 설정하는 것뿐만 아니라, 단일한 마사 지부 내에서의 마사지 헤드의 위치를 설정하는 것도 포함할 수 있다. 마사지 동작의 제어는 마사지 코스 자체를 설정하는 제어뿐만 아니라, 마사지 코스를 구성하는 마사지 부위, 마 사지 시간, 마사지 강도 등의 개별적 항목들을 설정하는 제어를 포함할 수 있다. 예컨대, 마사지 동작의 제어 는 현재 제1 프리셋 마사지 코스로 동작중인 상황에서 제2 프리셋 마사지 코스로 변경하는 제어뿐만 아니라, 제 1 프리셋 마사지 코스 중에서 현재 마사지 동작에 상응하는 마사지 강도 (또는 마사지 시간, 마사지 부위 등)만 을 변경하여 제1 프리셋 마사지 코스의 내용을 일부 수정하여 사용자 설정 마사지 코스를 생성하고, 생성한 사 용자 설정 마사지 코스로 변경하는 제어도 포함할 수 있다. 예컨대, 사용자의 발화 음성이 \"더 강하게 해 줘.\"라면, 프로세서는 \"마사지 강도 증가\"와 같은 의도 정보 를 생성할 수 있다. 사용자의 발화 음성이 \"다리도 마사지 해 줘.\"라면, 프로세서는 \"다리 마사지부 동작\" 또는 \"다리 마사지 시작\"과 같은 의도 정보를 생성할 수 있다. 사용자의 발화 음성이 \"지금 그 곳 좋아. 그 곳 조금 더 해 줘.\"라면, 프로세서는 \"마사지 위치 고정 및 고정한 위치에서의 마사지 시간 증가\"와 같 은 의도 정보를 생성할 수 있다. 상술한 예시들은 마사지 동작의 제어와 관련된 의도 정보를 나타낸다. 예컨대, 사용자의 발화 음성이 \"아주 좋아.\"라면, 프로세서는 \"긍정적 피드백\" 또는 \"만족\"과 같은 의도 정보를 생성할 수 있다. 사용자의 발화 음성이 \"별 느낌 없네.\"라면, 프로세서는 \"부정적 피드백\" 또는 \"불만족\"과 같은 의도 정보를 생성할 수 있다. 상술한 예시들은 마사지 동작의 제어와 관련되지 않은 의도 정 보를 나타낸다. 단계(S709)의 판단 결과 의도 정보가 마사지 동작의 제어와 관련된 경우, 인공 지능 마사지 장치의 프로세 서는 생성한 의도 정보에 기초하여 마사지 동작을 제어한다(S711). 예컨대, 의도 정보가 \"마사지 강도 증가\"라면, 프로세서는 현재 수행중인 마사지의 강도를 높일 수 있다. 의도 정보가 \"다리 마사지부 동작\" 또는 \"다리 마사지 시작\"라면, 프로세서는 다리 마사지부를 동작 시킬 수 있다. 의도 정보가 \"마사지 위치 고정 및 고정한 위치에서의 마사지 시간 증가\"라면, 프로세서는 현재 동작중인 마사지부에서의 마사지 헤드의 위치를 고정하고, 고정된 위치에서의 마사지 시간을 증가시 킬 수 있다. 프로세서는 출력부를 통해 사용자에게 마사지 동작의 제어에 대한 응답 (또는 피드백)을 출력하거나, 통신부를 통해 마사지 동작의 제어에 대한 응답을 출력하는 출력 신호를 사용자 단말기(미도시)에 전송할수 있다. 예컨대, 프로세서는 마사지 강도를 증가시키는 제어를 수행한 경우, 출력부나 사용자 단말 기(미도시)를 통해 마사지 강도를 증가시킴을 알리는 알림, 메시지 등을 출력할 수 있다. 프로세서는 응답 정보를 출력하기 위한 응답 음성(response speech)을 생성하고, 음향 출력부를 통해 응답 음성을 출력할 수 있다. 구체적으로, 프로세서는 자연어 생성(NLG: Natural Language Generation) 기법을 이용하여 응답 문장을 생성하고, TTS(Text To Speech) 엔진을 이용하여 생성된 응답 문장을 응답 음성으 로 변환하고, 음향 출력부를 통해 변환된 응답 음성을 통해 출력할 수 있다. 일 실시 예에서, 프로세서는 생성한 의도 정보에 기초한 마사지 동작의 제어 정보를 이용하여 후술하는 제 1 마사지 동작 결정 모델 또는 제2 마사지 동작 결정 모델의 학습에 이용할 학습 데이터를 생성할 수 있다. 프 로세서는 사용자의 표정 정보, 인공 지능 마사지 장치의 마사지 동작 정보, 그리고 마사지 동작의 제 어 정보를 포함하는 학습 데이터를 생성할 수도 있고, 프로세서는 사용자의 얼굴을 포함하는 이미지 데이 터, 인공 지능 마사지 장치의 마사지 동작 정보, 그리고 마사지 동작의 제어 정보를 포함하는 학습 데이터 를 생성할 수도 있다. 전자의 학습 데이터는 후술하는 제2 학습 데이터로써 이용될 수 있으며, 후자의 학습 데 이터는 후술하는 제3 학습 데이터로써 이용될 수 있다. 단계(S705)의 판단 결과 사용자가 발화하지 않는 경우이거나, 단계(S709)의 판단 결과 의도 정보가 마사지 동작 의 제어와 관련되지 않은 경우, 인공 지능 마사지 장치의 프로세서는 사용자의 표정 정보와 마사지 동작 정보를 이용하여 목표 마사지 동작을 결정한다(S713). 목표 마사지 동작은 현재의 인공 지능 마사지 장치의 마사지 동작 정보와 사용자의 표정으로부터 적합하다 고 판단되는 마사지 동작을 의미할 수 있다. 예컨대, 현재의 마사지 동작이 최대 강도로 진행되고 있고, 사용 자가 아파서 찡그리는 표정을 짓고 있다면, 목표 마사지 동작은 마사지 강도가 낮아진 마사지 동작일 수 있다. 프로세서는 메모리에 저장된 제1 마사지 동작 결정 모델을 이용하여, 획득한 이미지 데이터로부터 생 성한 사용자의 표정 정보와 현재 인공 지능 마사지 장치의 마사지 동작 정보로부터 목표 마사지 동작을 결 정할 수 있다. 또는, 프로세서는 통신부를 통해 인공 지능 서버에 사용자의 표정 정보와 마사 지 동작 정보를 전송하고, 인공 지능 서버의 프로세서가 메모리에 저장된 제1 마사지 동작 결정 모델을 이용하여 사용자의 표정 정보와 마사지 동작 정보로부터 목표 마사지 동작을 결정하면, 프로세서는 통신부를 통해 인공 지능 서버로부터 결정된 목표 마사지 동작을 수신할 수 있다. 제1 마사지 동작 결정 모델은 사용자의 표정 정보와 마사지 동작 정보가 입력되면, 사용자의 표정 정보와 마사 지 동작 정보에 적합한 목표 마사지 동작을 출력하는 모델일 수 있다. 제1 마사지 동작 결정 모델은 인공 신경 망을 포함하여 구성되며, 머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 이용하여 학습되는 모델일 수 있다. 인공 지능 마사지 장치의 러닝 프로세서 또는 인공 지능 서버의 러닝 프로세서는 제2 학습 데이터를 이용하여 제1 마사지 동작 결정 모델을 학습할 수 있다. 제2 학습 데이터는 사용자의 표정 정보, 마 사지 동작 정보 및 목표 마사지 동작 (또는 목표 마사지 동작 정보)을 포함할 수 있다. 목표 마사지 동작은 사 용자의 표정 정보 및 마사지 동작 정보에 대한 라벨이며, 제1 마사지 동작 결정 모델이 사용자의 표정 정보와 마사지 동작 정보로부터 추론하여야 하는 결과 또는 정답으로 기능할 수 있다. 제1 마사지 동작 결정 모델은 사용자의 얼굴을 포함하는 이미지 데이터로부터 생성된 사용자의 표정 정보를 이 용하여 목표 마사지 동작을 결정하는 모델을 의미할 수 있다. 그러나, 본 개시가 이에 한정되지는 않는다. 즉, 일 실시 예에서, 프로세서는 제2 마사지 동작 결정 모델을 이용하여 이미지 데이터와 마사지 동작 정 보로부터 목표 마사지 동작을 결정할 수도 있다. 이 경우에는, 프로세서는 사용자의 표정 정보를 생성하 지 않고도 사용자의 얼굴을 포함하는 이미지 데이터와 현재 마사지 동작 정보로부터 목표 마사지 동작을 결정할 수 있다. 제2 마사지 동작 결정 모델을 이용하는 실시 예는 후술한다. 일 실시 예에서, 제1 마사지 동작 결정 모델은 특정 시점(예컨대, 현재 시점)에 상응하는 단일한 프레임의 이미 지 데이터만을 이용하지 않고, 특정 시점으로부터 앞 뒤의 일정 구간의 복수의 프레임들의 이미지 데이터를 이 용할 수 있다. 예컨대, 제1 마사지 동작 결정 모델은 특정 시점을 기준으로 앞 뒤의 n초 동안의 이미지 데이터 에서 생성된 표정 정보와 마사지 동작 정보에 기초하여 목표 마사지 동작을 결정하는 모델일 수 있다. 만약, 실시간으로 목표 마사지 동작을 결정하는 경우라면, 제1 마사지 동작 결정 모델은 현재 시점을 기준으로 이전 n 초 동안의 이미지 데이터에서 생성된 표정 정보와 마사지 동작 정보에 기초하여 목표 마사지 동작을 결정할 수 있다. 그리고, 인공 지능 마사지 장치의 프로세서는 결정된 목표 마사지 동작에 기초하여 마사지 동작을 제 어한다(S715). 만약 현재의 마사지 동작과 결정된 목표 마사지 동작이 동일하다면, 프로세서는 현재 진행중인 마사지 동 작을 그대로 유지할 수 있다. 반면, 현재의 마사지 동작과 결정된 목표 마사지 동작이 상이하다면, 프로세서 는 목표 마사지 동작에 따라 마사지 동작을 제어할 수 있다. 도 7은 사용자의 얼굴과 사용자의 발화 음성을 고려하여 마사지 동작을 제어하는 방법만을 개시하고 있지만, 본 개시가 이에 한정되지 않는다. 즉, 사용자의 발화 음성은 마사지 동작을 제어하기 위한 상호작용 방법의 하나 의 예시에 불과하며, 사용자가 리모컨 등의 사용자 입력부를 통해 마사지 동작을 제어하는 명령을 입력시 킨다면, 인공 지능 마사지 장치는 사용자의 입력에 기초하여 마사지 동작을 제어할 수 있다. 이 경우에도, 프로세서는 사용자의 입력에 기초한 마사지 동작의 제어 정보에 기초하여 제1 마사지 동작 결정 모델 또는 제2 마사지 동작 결정 모델의 학습에 이용할 학습 데이터를 생성할 수 있다. 또한, 도 7은 사용자의 표정 정보를 생성하는 단계(S703)가 이미지 데이터를 획득하는 단계(S701)의 직후에 수 행되는 것으로 도시되어 있으나, 본 개시가 이에 한정되지 않는다. 즉, 일 실시 예에서, 사용자의 표정 정보를 생성하는 단계(S703)가 목표 마사지 동작을 결정하는 단계(S713)의 직전에 수행될 수도 있다. 도 7에 도시된 단계들(steps)은 반복적으로 수행될 수 있고, 그에 따라 인공 지능 마사지 장치는 연속적으 로 마사지 동작을 제어할 수 있다. 도 8은 본 개시의 일 실시 예에 따른 제1 마사지 동작 결정 모델을 이용하여 목표 마사지 동작을 결정하는 방법 을 나타낸 도면이다. 도 8을 참조하면, 프로세서는 카메라를 통해 사용자의 얼굴을 포함하는 이미지 데이터를 획득하 고, 획득한 이미지 데이터를 표정 정보 생성 모델에 입력하여 사용자의 표정 정보를 생성한다. 도 8에 도시된 표정 정보 생성 모델의 구조는 하나의 예시에 불과하며, 본 개시가 이에 한정되지는 않는다. 일 실시 예에서, 표정 정보 생성 모델은 합성곱 신경망(CNN: Convolutional Neural Network)을 포함할 수 있다. 그리고, 프로세서는 현재 시점의 마사지 동작 정보를 획득하고, 생성한 표정 정보와 획득한 마 사지 동작 정보를 제1 마사지 동작 결정 모델에 입력하여 목표 마사지 동작을 결정한다. 마찬 가지로, 도 8에 도시된 제1 마사지 동작 결정 모델의 구조는 하나의 예시에 불과하며, 본 개시가 이에 한 정되지는 않는다. 일 실시 예에서, 제1 마사지 동작 결정 모델은 순환 신경망(RNN: Recurrent Neural Network)을 포함하여, 시계열적으로 입력되는 데이터로부터 목표 마사지 동작을 결정할 수 있다. 도 9는 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지 동작을 제어하는 방법을 나타 낸 동작 흐름도이다. 도 9를 참조하면, 인공 지능 마사지 장치의 프로세서는 카메라를 통해 사용자의 얼굴을 포함하 는 이미지 데이터를 획득한다(S901). 이는 도 7의 이미지 데이터를 획득하는 단계(S701)에 대응된다. 그리고, 인공 지능 마사지 장치의 프로세서는 획득한 이미지 데이터를 이용하여 사용자가 발화하고 있는지 판단한다(S903). 이는 도 7의 사용자가 발화하고 있는지 판단하는 단계(S705)에 대응된다. 단계(S903)의 판단 결과 사용자가 발화하고 있는 경우, 인공 지능 마사지 장치의 프로세서는 사용자 의 발화 음성을 포함하는 음성 데이터(speech data)를 획득하고, 획득한 음성 데이터에 상응하는 의도 정보를 생성한다(S905). 이는 도 7의 음성 데이터에 상응하는 의도 정보를 생성하는 단계(S707)에 대응된다. 그리고, 인공 지능 마사지 장치의 프로세서는 생성한 의도 정보가 마사지 동작의 제어와 관련되어 있 는지 판단한다(S907). 이는 도 7의 의도 정보가 마사지 동작의 제어와 관련되어 있는지 판단하는 단계(S709)에 대응된다. 단계(S907)의 판단 결과 의도 정보가 마사지 동작의 제어와 관련된 경우, 인공 지능 마사지 장치의 프로세 서는 생성한 의도 정보에 기초하여 마사지 동작을 제어한다(S909). 이는 도 7의 생성한 의도 정보에 기초 하여 마사지 동작을 제어하는 단계(S711)에 대응된다. 일 실시 예에서, 프로세서는 생성한 의도 정보에 기초한 마사지 동작의 제어 정보를 이용하여 후술하는 제 2 마사지 동작 결정 모델의 학습에 이용할 학습 데이터를 생성할 수 있다. 프로세서는 사용자의 얼굴을 포함하는 이미지 데이터, 인공 지능 마사지 장치의 마사지 동작 정보, 그리고 마사지 동작의 제어 정보를 포함하는 학습 데이터를 생성할 수 있다. 이러한 학습 데이터는 후술하는 제3 학습 데이터로써 이용될 수 있다. 단계(S903)의 판단 결과 사용자가 발화하지 않는 경우이거나, 단계(S907)의 판단 결과 의도 정보가 마사지 동작 의 제어와 관련되지 않은 경우, 인공 지능 마사지 장치의 프로세서는 이미지 데이터와 마사지 동작 정보를 이용하여 목표 마사지 동작을 결정한다(S911). 목표 마사지 동작은 현재의 인공 지능 마사지 장치의 마사지 동작 정보와 사용자의 표정으로부터 적합하다 고 판단되는 마사지 동작을 의미할 수 있다. 예컨대, 현재의 마사지 동작이 최대 강도로 진행되고 있고, 사용 자가 아파서 찡그리는 표정을 짓고 있다면, 목표 마사지 동작은 마사지 강도가 낮아진 마사지 동작일 수 있다. 프로세서는 메모리에 저장된 제2 마사지 동작 결정 모델을 이용하여, 획득한 이미지 데이터와 현재 인공 지능 마사지 장치의 마사지 동작 정보로부터 목표 마사지 동작을 결정할 수 있다. 또는, 프로세서 는 통신부를 통해 인공 지능 서버에 이미지 데이터와 마사지 동작 정보를 전송하고, 인공 지능 서버의 프로세서가 메모리에 저장된 제2 마사지 동작 결정 모델을 이용하여 이미지 데이터와 마 사지 동작 정보로부터 목표 마사지 동작을 결정하면, 프로세서는 통신부를 통해 인공 지능 서버(20 0)로부터 결정된 목표 마사지 동작을 수신할 수 있다. 제2 마사지 동작 결정 모델은 사용자의 얼굴을 포함한 이미지 데이터와 마사지 동작 정보가 입력되면, 이미지 데이터와 마사지 동작 정보에 적합한 목표 마사지 동작을 출력하는 모델일 수 있다. 즉, 제2 마사지 동작 모델 은 종단 간 학습(end-to-end learning)에 의하여, 사용자의 표정 정보를 생성하지 않고 이미지 데이터로부터 바 로 목표 마사지 동작을 결정하는 모델을 의미할 수 있다. 제2 마사지 동작 결정 모델은 인공 신경망을 포함하 여 구성되며, 머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 이용하여 학습되는 모델일 수 있다. 인공 지능 마사지 장치의 러닝 프로세서 또는 인공 지능 서버의 러닝 프로세서는 제3 학습 데이터를 이용하여 제2 마사지 동작 결정 모델을 학습할 수 있다. 제3 학습 데이터는 사용자의 얼굴을 포함하 는 이미지 데이터, 마사지 동작 정보 및 목표 마사지 동작 (또는 목표 마사지 동작 정보)을 포함할 수 있다. 목표 마사지 동작은 이미지 데이터 및 마사지 동작 정보에 대한 라벨이며, 마사지 동작 결정 모델이 사용자의 표정 정보와 마사지 동작 정보로부터 추론하여야 하는 결과 또는 정답으로 기능할 수 있다. 일 실시 예에서, 제2 마사지 동작 결정 모델은 특정 시점(예컨대, 현재 시점)에 상응하는 단일한 프레임의 이미 지 데이터만을 이용하지 않고, 특정 시점으로부터 앞 뒤의 일정 구간의 복수의 프레임들의 이미지 데이터를 이 용할 수 있다. 예컨대, 제2 마사지 동작 결정 모델은 특정 시점을 기준으로 앞 뒤의 n초 동안의 이미지 데이터 와 마사지 동작 정보에 기초하여 목표 마사지 동작을 결정하는 모델일 수 있다. 만약, 실시간으로 목표 마사지 동작을 결정하는 경우라면, 제2 마사지 동작 결정 모델은 현재 시점을 기준으로 이전 n초 동안의 이미지 데이터 와 마사지 동작 정보에 기초하여 목표 마사지 동작을 결정할 수 있다. 그리고, 인공 지능 마사지 장치의 프로세서는 결정된 목표 마사지 동작에 기초하여 마사지 동작을 제 어한다(S913). 이는 도 7의 목표 마사지 동작에 기초하여 마사지 동작을 제어하는 단계(S715)에 대응된다. 도 9에 도시된 단계들(steps)은 반복적으로 수행될 수 있고, 그에 따라 인공 지능 마사지 장치는 연속적으 로 마사지 동작을 제어할 수 있다. 도 10은 본 개시의 일 실시 예에 따른 제2 마사지 동작 결정 모델을 이용하여 목표 마사지 동작을 결정하는 방 법을 나타낸 도면이다. 도 10을 참조하면, 프로세서는 카메라를 통해 사용자의 얼굴을 포함하는 이미지 데이터를 획득 하고, 현재 시점의 마사지 동작 정보를 획득하고, 획득한 이미지 데이터와 획득한 마사지 동작 정 보를 제2 마사지 동작 결정 모델에 입력하여 목표 마사지 동작을 결정한다. 마찬가지로, 도 10에 도시된 제2 마사지 동작 결정 모델의 구조는 하나의 예시에 불과하며, 본 개시가 이에 한정되지는 않는다. 일 실시 예에서, 제2 마사지 동작 결정 모델은 순환 신경망(RNN: Recurrent Neural Network)을 포함하여, 시계열적으로 입력되는 데이터로부터 목표 마사지 동작을 결정할 수 있다.도 11 및 12는 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지의 동작을 제어하는 예 시를 나타낸 도면이다. 도 11 및 12를 참조하면, 사용자는 인공 지능 마사지 장치를 이용하여, 미리 설정된 마사지 동작 또 는 사용자가 설정한 마사지 동작에 따른 마사지를 받을 수 있다. 만약 사용자가 현재의 마사지 동작에 만족하여 웃는 표정 또는 만족하는 표정을 지으면서, \"아~ 좋 아. 거기 좀 더 해 줘.\"와 같이 발화하였다면, 인공 지능 마사지 장치는 사용자의 발화 음성 에 기초하여 현재 수행 중인 마사지 동작이 사용자에게 만족스럽다는 것을 파악할 수 있다. 그리 고, 인공 지능 마사지 장치는 현재 마사지 동작의 동작 시간을 더 늘리고, \"현재 마사지 동작을 더 오래 수행합니다.\"와 같은 응답 음성을 출력할 수 있다. 또는, 사용자가 직접 음성으로 발화하지 않더 라도, 리모컨 등의 사용자 입력부를 통해 현재 마사지 동작의 동작 시간을 늘리는 입력을 한 경우에도, 인 공 지능 마사지 장치는 현재 마사지 동작의 동작 시간을 더 늘리고, 필요하다면 \"현재 마사지 동작을 더 오래 수행합니다.\"와 같은 응답 음성을 출력할 수 있다. 인공 지능 마사지 장치는 현재의 마사지 동작 정보와 사용자의 표정 정보 (또는 사용자의 얼굴을 포함하는 이미지 데이터), 그리고 사용자의 마사지 동작 제어 정보에 기초하여 마사지 동작 결정 모델의 학습에 이 용할 학습 데이터를 생성할 수 있다. 그리고, 마사지 동작 결정 모델은 생성된 학습 데이터를 이용하여 재학습 또는 갱신될 수 있다. 인공 지능 마사지 장치는 사용자가 음성으로 발화하여 제어하는 마사지 동작 또는 사용자가 사용자 입력부를 통해 제어하는 마사지 동작을 목표 마사지 동작으로 간주할 수 있다. 따라서, 인공 지능 마사지 장치가 추후에 도 11의 예시에서의 마사지 동작과 동일한 마사지 동작을 수행하 고 있으며, 사용자가 웃는 표정 또는 만족하는 표정을 짓는다면, 인공 지능 마사지 장치는 사 용자의 발화 또는 제어 입력이 없더라도 현재 마사지 동작의 동작 시간을 더 늘리기 위하여, \"현재 마사 지 동작을 더 오래 수행할까요?\"와 같이 질의 음성을 출력할 수 있다. 만약, 사용자가 발화하여 동의한다면, 인공 지능 마사지 장치는 현재 마사지 동작의 동작 시간을 더 늘릴 수 있다. 도 13 및 14는 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지의 동작을 제어하는 예 시를 나타낸 도면이다. 도 13 및 14를 참조하면, 사용자는 인공 지능 마사지 장치를 이용하여, 미리 설정된 마사지 동작 또 는 사용자가 설정한 마사지 동작에 따른 마사지를 받을 수 있다. 만약 사용자가 고통스러운 표정 또는 찡그리는 표정을 지으면서, \"아, 아파.\"와 같이 발화하 였다면, 인공 지능 마사지 장치는 사용자의 발화 음성에 기초하여 현재 수행 중인 마사지 동 작이 사용자에게 강하다는 것을 파악할 수 있다. 그리고, 인공 지능 마사지 장치는 현재 마사지 동 작의 마사지 강도를 낮추고, \"마사지 강도를 낮춥니다.\"와 같은 응답 음성을 출력할 수 있다. 또는, 사 용자가 직접 음성으로 발화하지 않더라도, 리모컨 등의 사용자 입력부를 통해 현재 마사지 동작의 마사지 강도를 낮추는 입력을 한 경우에도, 인공 지능 마사지 장치는 현재 마사지 동작의 마사지 강도를 낮추고, 필요하다면 \"마사지 강도를 낮춥니다.\"와 같은 응답 음성을 출력할 수 있다. 인공 지능 마사지 장치는 현재의 마사지 동작 정보와 사용자의 표정 정보 (또는 사용자의 얼굴을 포함하는 이미지 데이터), 그리고 사용자의 마사지 동작 제어 정보에 기초하여 마사지 동작 결정 모델의 학습에 이 용할 학습 데이터를 생성할 수 있다. 그리고, 마사지 동작 결정 모델은 생성된 학습 데이터를 이용하여 재학습 또는 갱신될 수 있다. 인공 지능 마사지 장치는 사용자가 음성으로 발화하여 제어하는 마사지 동작 또는 사용자가 사용자 입력부를 통해 제어하는 마사지 동작을 목표 마사지 동작으로 간주할 수 있다. 따라서, 인공 지능 마사지 장치가 추후에 도 13의 예시에서의 마사지 동작과 동일한 마사지 동작을 수행하 고 있으며, 사용자가 고통스러운 표정 또는 찡그러운 표정을 짓는다면, 인공 지능 마사지 장치 는 사용자의 발화 또는 제어 입력이 없더라도 현재 마사지 동작의 마사지 강도를 낮추기 위하여, \" 마사지 강도를 낮출까요?\"와 같이 질의 음성을 출력할 수 있다. 만약, 사용자가 발화하여 동의한다면, 인공 지능 마사지 장치는 현재 마사지 동작의 마사지 강도를 낮출 수 있다. 도 15 및 16은 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지의 동작을 제어하는 예 시를 나타낸 도면이다. 도 15 및 16을 참조하면, 사용자는 인공 지능 마사지 장치를 이용하여, 미리 설정된 마사지 동작 또 는 사용자가 설정한 마사지 동작에 따른 마사지를 받을 수 있다. 만약 사용자가 현재의 마사지 동작 (예컨대, 등 마사지)에 불만족하여 못마땅한 표정 또는 불만족 스러운 표정을 지으면서, \"애매한데.. 다리 마사지 해 줘.\"와 같이 발화하였다면, 인공 지능 마사지 장치 는 사용자의 발화 음성에 기초하여 현재 수행 중인 마사지 동작이 사용자에게 불만족스 럽다는 것을 파악할 수 있다. 그리고, 인공 지능 마사지 장치는 현재 마사지 동작을 다리 마사지 동작으 로 바꾸고, \"다리를 마사지합니다.\"와 같은 응답 음성을 출력할 수 있다. 또는, 사용자가 직접 음 성으로 발화하지 않더라도, 리모컨 등의 사용자 입력부를 통해 현재 마사지 동작을 다리 마사지 동작으로 바꾸는 입력을 한 경우에도, 인공 지능 마사지 장치는 현재 마사지 동작을 다리 마사지 동작으로 바꾸고, 필요하다면 \"다리를 마사지합니다.\"와 같은 응답 음성을 출력할 수 있다. 인공 지능 마사지 장치는 현재의 마사지 동작 정보와 사용자의 표정 정보 (또는 사용자의 얼굴을 포함하는 이미지 데이터), 그리고 사용자의 마사지 동작 제어 정보에 기초하여 마사지 동작 결정 모델의 학습에 이 용할 학습 데이터를 생성할 수 있다. 그리고, 마사지 동작 결정 모델은 생성된 학습 데이터를 이용하여 재학습 또는 갱신될 수 있다. 인공 지능 마사지 장치는 사용자가 음성으로 발화하여 제어하는 마사지 동작 또는 사용자가 사용자 입력부를 통해 제어하는 마사지 동작을 목표 마사지 동작으로 간주할 수 있다. 따라서, 인공 지능 마사지 장치가 추후에 도 15의 예시에서의 마사지 동작과 동일한 마사지 동작을 수행하 고 있으며, 사용자가 못마땅한 표정 또는 불만족스러운 표정을 짓는다면, 인공 지능 마사지 장치 는 사용자의 발화 또는 제어 입력이 없더라도 현재 마사지 동작을 다리 마사지 동작으로 바꾸기 위 하여, \"다리를 마사지할까요?\"와 같이 질의 음성을 출력할 수 있다. 만약, 사용자가 발화하여 동 의한다면, 인공 지능 마사지 장치는 현재 마사지 동작을 다리 마사지 동작으로 바꿀 수 있다. 상술한 도 11 내지 16의 예시는 단일한 시점(time point)에서의 사용자의 표정에 기초하여 마사지 동작을 제어 하는 방법에 한정되지 않는다. 즉, 마사지 동작 모델은 일정 기간 동안의 사용자의 얼굴을 포함하는 이미지 데 이터 또는 일정 기간 동안의 사용자의 표정 정보에 기초하여 목표 마사지 동작을 결정할 수 있다. 즉, 인공 지 능 마사지 장치는 사용자의 단일한 시점에서의 사용자의 표정뿐만 아니라, 일정 기간 동안의 사용자의 표 정의 변화를 고려하여 마사지 동작을 결정할 수 있다. 도 17은 본 개시의 일 실시 예에 따른 사용자의 표정의 변화를 고려하여 마사지 동작을 제어하는 예시를 나타낸 도면이다. 도 17을 참조하면, 인공 지능 마사지 장치가 제1 부위에 대한 제1 마사지 동작을 시작하고 나서, 사 용자의 표정이 중립 표정, 만족스러운 표정, 그리고 불만족스러운 표정의 순서대로 변하였고, 사용자가 음성 발화 또는 사용자 입력부에 대한 입력을 통해 마사지 부위를 제1 부위에서 제2 부위로 변경함으로써, 제1 마사지 동작을 제2 마사지 동작으로 변경하였다고 가정한다. 이 경우, 마사지 동작 결정 모델은 제1 마사지 부위에 대한 제1 마사지 동작이 수행 중이고, 사용자의 표정이 중립 표정, 만족스러운 표정, 그리고 불만족스러운 표정의 순서대로 변하였을 때, 제1 마사지 부위에 대한 제1 마사지 동작을 제2 마사지 부위에 대한 제2 마사지 동작으로 변경하도록 학습될 수 있다. 추후에, 사용자가 인공 지능 마사지 장치의 제1 마사지 부위에 대한 제1 마사지 동작으로 마사지를 받고 있고, 사용자의 표정이 중립 표정, 만족스러운 표정, 그리고 불만족스러운 표정의 순서대로 변한다면, 인공 지능 마사지 장치는 사용자의 별도의 입력이 없더라도 제1 마사지 부위에 대한 제1 마사지 동작을 제2 마사지 부위에 대한 제2 마사지 동작으로 변경할 것인지를 물어볼 수 있다.도 18은 본 개시의 일 실시 예에 따른 사용자의 표정의 변화를 고려하여 마사지 동작을 제어하는 예시를 나타낸 도면이다. 도 18을 참조하면, 인공 지능 마사지 장치가 제1 마사지 강도를 갖는 제1 마사지 동작을 시작하고 나서, 사용자의 표정이 중립 표정, 그리고 고통스러운 표정의 순서대로 변하였고, 사용자가 음성 발화 또는 사용자 입력부에 대한 입력을 통해 제1 마사지 강도를 제2 마사지 강도로 낮춤으로써, 제1 마사 지 동작을 제3 마사지 동작으로 변경하였다고 가정한다. 이 경우, 마사지 동작 결정 모델은 제1 마사지 동작이 수행 중이고, 사용자의 표정이 중립 표정, 그리고 고통스러운 표정의 순서대로 변하였을 때, 제1 마사지 강도의 제1 마사지 동작을 제2 마사지 강도의 제3 마사지 동작으로 변경하도록 학습될 수 있다. 추후에, 사용자가 인공 지능 마사지 장치의 제1 마사지 강도의 제1 마사지 동작으로 마사지를 받고 있고, 사용자의 표정이 중립 표정, 그리고 고통스러운 표정의 순서대로 변한다면, 인공 지능 마사지 장치 는 사용자의 별도의 입력이 없더라도 제1 마사지 강도의 제1 마사지 동작을 제2 마사지 강도의 갖는 제3 마사지 동작으로 변경할 것인지를 물어볼 수 있다. 도 19는 본 개시의 일 실시 예에 따른 마사지 동작을 제어하는 예시를 나타낸 도면이다. 도 19를 참조하면, 인공 지능 마사지 장치는 카 시트로써, 자율 주행 차량에 탑재되거나 자율 주행 차량의 일부를 구성할 수 있다. 또는, 인공 지능 마사지 장치가 자율 주행 차량이며, 마사지부가 카 시트를 구성할 수도 있다. 이 경우, 인공 지능 마사지 장치의 프로세서는 자율 주행 차량의 프로세서일 수 도 있고, 자율 주행 차량의 프로세서와는 구분되는 별개의 프로세서일 수도 있다. 만약, 인공 지능 마사지 장 치의 프로세서가 자율 주행 차량의 프로세서와 구분되는 경우라면, 프로세서는 자율 주행 차량 의 프로세서와 연동하여 동작할 수 있다. 인공 지능 마사지 장치는 안전을 위하여 자율 주행 차량이 자율 주행을 수행하고 있는 상황에서만 마사지 동작을 수행하도록 동작에 제한이 있을 수 있다. 사용자는 인공 지능 마사지 장치를 이용하여, 미리 설정된 마사지 동작 또는 사용자가 설정한 마사지 동작에 따른 마사지를 받을 수 있다. 만약 사용자가 고통스러운 표정 또는 찡그리는 표정 을 짓는다면, 인공 지능 마사지 장치는 사용자의 발화 또는 제어 입력이 없더라도 현재 마사지 동작 의 마사지 강도를 낮추기 위하여, \"마사지 강도를 낮출까요?\"와 같이 질의 음성을 출력할 수 있다. 만약, 사용자가 발화하여 동의한다면, 인공 지능 마사지 장치는 현재 마사지 동작의 마사지 강도를 낮출 수 있다. 본 개시의 일 실시 예에 따르면, 전술한 방법은 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구 현하는 것이 가능하다. 컴퓨터가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장 되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19"}
{"patent_id": "10-2019-0117704", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 AI 장치를 나타낸 블록도이다. 도 2는 본 개시의 일 실시 예에 따른 AI 서버를 나타낸 블록도이다. 도 3은 본 개시의 일 실시 예에 따른 AI 시스템을 나타낸 도면이다. 도 4는 본 개시의 일 실시 예에 따른 AI 장치를 나타낸 블록도이다. 도 5는 본 개시의 일 실시 예에 따른 인공 지능 장치를 나타낸 사시도이다. 도 6은 본 개시의 일 실시 예에 따른 인공 지능 시스템을 나타낸 블록도이다. 도 7은 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지 동작을 제어하는 방법을 나타 낸 동작 흐름도이다. 도 8은 본 개시의 일 실시 예에 따른 제1 마사지 동작 결정 모델을 이용하여 목표 마사지 동작을 결정하는 방법 을 나타낸 도면이다. 도 9는 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지 동작을 제어하는 방법을 나타 낸 동작 흐름도이다. 도 10은 본 개시의 일 실시 예에 따른 제2 마사지 동작 결정 모델을 이용하여 목표 마사지 동작을 결정하는 방법을 나타낸 도면이다. 도 11 및 12는 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지의 동작을 제어하는 예 시를 나타낸 도면이다. 도 13 및 14는 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지의 동작을 제어하는 예 시를 나타낸 도면이다. 도 15 및 16은 본 개시의 일 실시 예에 따른 사용자의 표정이나 발화를 고려하여 마사지의 동작을 제어하는 예 시를 나타낸 도면이다. 도 17은 본 개시의 일 실시 예에 따른 사용자의 표정의 변화를 고려하여 마사지 동작을 제어하는 예시를 나타낸 도면이다. 도 18은 본 개시의 일 실시 예에 따른 사용자의 표정의 변화를 고려하여 마사지 동작을 제어하는 예시를 나타낸 도면이다. 도 19는 본 개시의 일 실시 예에 따른 마사지 동작을 제어하는 예시를 나타낸 도면이다."}
