{"patent_id": "10-2022-0002573", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0106884", "출원번호": "10-2022-0002573", "발명의 명칭": "콘텐츠 수집 플랫폼 시스템", "출원인": "김소윤", "발명자": "김소윤"}}
{"patent_id": "10-2022-0002573", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인터넷 네트워크상에서 콘텐츠를 게시하거나 공유가 가능하도록 하는 다수 개의 외부플랫폼 중 적어도 하나의외부플랫폼에서 게시된 다수 개의 콘텐츠와 각각의 콘텐츠에 대한 콘텐츠 정보를 사용자 단말을 통해서 수집하고, 상기 다수 개의 콘텐츠 중에서 상기 사용자 단말로부터 선택된 적어도 하나의 원본 콘텐츠를 포함하는 폴더를 생성하는 플랫폼 서버;를 포함하고,상기 플랫폼 서버는,상기 원본 콘텐츠를 상기 사용자 단말이 가공할 수 있도록 인터페이스를 제공하고, 상기 원본 콘텐츠가 상기 사용자 단말로부터 가공된 가공 콘텐츠를 상기 폴더에 포함하는 콘텐츠 가공부; 및상기 폴더에 포함된 상기 원본 콘텐츠와 가공 콘텐츠 중 적어도 하나에 대하여 다수 개의 사용자 단말이 서로커뮤니케이션할 수 있도록 인터페이스를 제공하는 커뮤니케이션 제공부;를 포함하는 것을 특징으로 하는 콘텐츠수집 플랫폼 시스템."}
{"patent_id": "10-2022-0002573", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 플랫폼 서버는,상기 다수 개의 콘텐츠와 각각의 콘텐츠에 대한 콘텐츠 정보를 다수 개의 사용자 단말을 통해서 수집하고, 상기다수 개의 콘텐츠 중에서 상기 다수 개의 사용자 단말로부터 각각 선택된 다수 개의 원본 콘텐츠를 포함하는 그룹폴더를 생성하는 것을 특징으로 하고,상기 콘텐츠 가공부는, 상기 그룹폴더에 포함된 다수 개의 원본 콘텐츠를 상기 다수 개의 사용자 단말이 가공할 수 있도록 인터페이스를 제공하고, 상기 다수 개의 사용자 단말로부터 가공된 그룹가공 콘텐츠를 상기 그룹폴더에 포함하는 것을 특징으로 하는 콘텐츠 수집 플랫폼 시스템."}
{"patent_id": "10-2022-0002573", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 플랫폼 서버는,상기 콘텐츠 정보 내 링크주소에 기초하여 외부플랫폼의 종류를 인식한 후 외부플랫폼별로 콘텐츠를 분류하고,상기 콘텐츠 정보 내 수집일자에 기초하여 수집일자별로 콘텐츠를 분류하고, 상기 콘텐츠 정보 내 카테고리에기초하여 상기 콘텐츠를 기 저장된 카테고리 중 하나로 분류하는 콘텐츠 분류부;를 포함하고,상기 콘텐츠 분류부는,상기 콘텐츠 정보 내 카테고리를 포함하지 않는 콘텐츠의 경우 콘텐츠 자체에서 텍스트 마이닝(Text Mining)하고, 상기 콘텐츠와 연관된 키워드를 추출한 후 상기 키워드에 기초하여 상기 콘텐츠를 기 저장된 카테고리 중하나로 분류하는 것을 특징으로 하는 콘텐츠 수집 플랫폼 시스템."}
{"patent_id": "10-2022-0002573", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 플랫폼 서버는, 상기 콘텐츠 분류부로부터 분류되지 않은 비분류 콘텐츠가 기 설정된 기간 내에 상기 사용자 단말로부터 분류되지 않는 경우 상기 사용자 단말에 정리요청 팝업창을 제공하고, 상기 사용자 단말로부터 상기 정리요청 팝업창공개특허 10-2023-0106884-3-이 선택된 후 상기 비분류 콘텐츠가 분류되면 리워드를 제공하는 리워드 제공부;를 더 포함하는 것을 특징으로하는 콘텐츠 수집 플랫폼 시스템."}
{"patent_id": "10-2022-0002573", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 플랫폼 서버는, 상기 사용자 단말로부터 수집된 상기 다수 개의 콘텐츠와 각각의 콘텐츠에 대한 콘텐츠 정보 중 적어도 하나를이용하여 인공지능 기술기반으로 사용자 성향을 분석한 후 기 수집된 콘텐츠 중에서 사용자 성향과 대응되는 콘텐츠를 추천 콘텐츠로 제공하거나, 기 생성된 폴더 중에서 사용자 성향과 대응되는 폴더를 추천 폴더로 제공하는 콘텐츠 추천부;를 더 포함하는 것을 특징으로 하는 콘텐츠 수집 플랫폼 시스템."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 콘텐츠 수집 플랫폼 시스템에 관한 것으로, 보다 구체적으로 인터넷 네트워크상에서 콘텐츠를 게시하 거나 공유가 가능하도록 하는 다수 개의 외부플랫폼 중 적어도 하나의 외부플랫폼에서 게시된 다수 개의 콘텐츠 와 각각의 콘텐츠에 대한 콘텐츠 정보를 사용자 단말을 통해서 수집하고, 상기 다수 개의 콘텐츠 중에서 상기 사 (뒷면에 계속)"}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 콘텐츠 수집 플랫폼 시스템에 관한 것으로, 보다 구체적으로 인터넷 네트워크상에서 콘텐츠를 게시하 거나 공유가 가능하도록 하는 다수 개의 외부플랫폼에서 게시된 다수 개의 콘텐츠를 사용자 단말을 통해서 수집 및 가공할 수 있는 서비스를 제공하는 콘텐츠 수집 플랫폼 시스템에 관한 것이다."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "온라인상에서 사진, 영상, 글과 같은 여러 형태의 콘텐츠를 올리고 공유하는 활동이 활발해지며 하루에도 수천, 수만 개의 콘텐츠가 쏟아지고 있다. 이러한 콘텐츠 홍수의 시대에 개인이 관심 있는 콘텐츠를 확인하기 위해서 는 각 플랫폼에서 제공하는 저장기능을 사용할 수 있으나, 서로 다른 플랫폼에 흩어져 저장되어 있으므로 한 번 에 확인하기 어렵다. 즉, 콘텐츠의 양이 늘어남에 따라 개인이 원하는 것을 찾는 데 걸리는 시간과 노력도 마찬가지로 증가하게 된다. 이를 해결하기 위해서 효과적인 인터페이스 기술들의 개발이 시도되고 있는데, 관련문헌 1은 사용자 콘텐 츠 수집 장치 및 방법에 관한 것으로 서로 다른 웹 서비스 제공 장치에 접속하여 사용자가 등록한 사용자 콘텐 츠들을 수집한 후 중복되는 콘텐츠를 제거하고 저장할 수 있다. 관련문헌 2는 특정 대상에 대한 온라인 콘텐츠 를 수집하고 분석할 수 있다. 다만, 관련문헌 1 내지 2는 사용자가 저장하고 싶은 콘텐츠를 단순히 수집하기만 함으로 사용자가 자신이 수집한 콘텐츠를 가공하거나 또 다른 사용자와 관심사를 공유할 수 없는 기술적 한계가 존재한다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1404184 (특허문헌 0002) KR 10-1804400"}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 사용자가 이전에 저장한 다양한 콘텐츠의 가독성 및 활 용성을 높일 수 있도록 인터넷 네트워크상에서 콘텐츠를 게시하거나 공유가 가능하도록 하는 다수 개의 외부플 랫폼에서 게시된 다수 개의 콘텐츠를 사용자 단말을 통해서 수집 및 가공할 수 있는 서비스를 제공하는 콘텐츠 수집 플랫폼 시스템을 얻고자 하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 콘텐츠 수집 플랫폼 시스템은 인터넷 네트워크상에서 콘텐츠를 게시하 거나 공유가 가능하도록 하는 다수 개의 외부플랫폼 중 적어도 하나의 외부플랫폼에서 게시된 다수 개의 콘텐츠 와 각각의 콘텐츠에 대한 콘텐츠 정보를 사용자 단말을 통해서 수집하고, 상기 다수 개의 콘텐츠 중에서 상기 사용자 단말로부터 선택된 적어도 하나의 원본 콘텐츠를 포함하는 폴더를 생성하는 플랫폼 서버;를 제공한다. 본 발명의 콘텐츠 수집 플랫폼 시스템의 상기 플랫폼 서버는, 상기 원본 콘텐츠를 상기 사용자 단말이 가공할 수 있도록 인터페이스를 제공하고, 상기 원본 콘텐츠가 상기 사용자 단말로부터 가공된 가공 콘텐츠를 상기 폴 더에 포함하는 콘텐츠 가공부; 및 상기 폴더에 포함된 상기 원본 콘텐츠와 가공 콘텐츠 중 적어도 하나에 대하 여 다수 개의 사용자 단말이 서로 커뮤니케이션할 수 있도록 인터페이스를 제공하는 커뮤니케이션 제공부;를 제 공한다."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면 인터넷 네트워크상에서 콘텐츠를 게시하거나 공유가 가능하도록 하는 다수 개의 외부플랫폼에서 게시된 다수 개의 콘텐츠를 사용자 단말을 통해서 수집 및 가공할 수 있는 서비스를 제공함으로 써, 사용자가 이전에 저장한 다양한 콘텐츠의 가독성 및 활용성을 높일 수 있는 효과가 있다. 또한, 본 발명은 수집한 상기 다수 개의 콘텐츠 중에서 상기 사용자 단말로부터 선택된 적어도 하나의 원본 콘 텐츠를 포함하는 폴더를 생성함으로써, 콘텐츠 추가 및 가공을 통해 또 다른 새로운 콘텐츠를 생성하여 셀프 브 랜딩(Self Branding)에 활용할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 상세한 설명 및 청구범위의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 다르게 정의되지 않는 한 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반 적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 콘텐츠 수 집 플랫폼 시스템 구성도이다. 도 2는 본 발명의 일실시예에 따라 다수 개의 사용자 단말(200a, 200b 200c...) 을 대상으로 하는 콘텐츠 수집 플랫폼 시스템 구성도이다. 도 3은 본 발명의 일실시예에 따라 외부플랫폼으로부 터 콘텐츠를 수집하는 것을 표시한 도면이다. 도 4는 본 발명의 일실시예에 따라 플랫폼 서버로부터 생성 된 폴더를 표시한 도면이다. 도 5는 본 발명의 일실시예에 따라 폴더를 가공하기 위한 다양한 인터페이스를 표 시한 도면이다. 도 6은 본 발명의 일실시예에 따라 외부플랫폼별(a), 수집일자별(b), 카테고리별(c)로 분류된콘텐츠를 표시한 도면이다. 우선 도 1을 보면, 본 발명의 콘텐츠 수집 플랫폼 시스템은 인터넷 네트워크상에서 콘텐츠를 게시하거나 공유가 가능하도록 하는 다수 개의 외부플랫폼 중 적어도 하나의 외부플랫폼에서 게시된 다수 개의 콘텐츠와 각각의 콘 텐츠에 대한 콘텐츠 정보를 사용자 단말을 통해서 수집하고, 상기 다수 개의 콘텐츠 중에서 상기 사용자 단말로부터 선택된 적어도 하나의 원본 콘텐츠를 포함하는 폴더를 생성하는 플랫폼 서버를 포함한다. 예컨대, 상기 외부플랫폼은 구글, 네이버, 다음과 같이 포털사이트일 수 있고, 네이버 블로그(Blog) 및 카페 (Cafe), 구글 블로거(Blogger), 다음 카페(Cafe) 등 커뮤니티 및 개인 사이트일 수 있고, 유튜브(Youtube)와 같은 동영상 플랫폼일 수 있고, 인스타그램(Instagram), 페이스북(Facebook), 카카오(Kakao), 틱톡(Tiktok), 트위터(Twitter)를 포함하는 소셜 네트워크 서비스(Social Network Service; SNS)를 위한 어플리케이션일 수 있다. 그리고 임의의 사용자는 인터넷 네트워크에 접속이 가능하고 어플리케이션 설치가 가능하고 디스플레이와 입력 장치를 포함하는 사용자 단말을 구비할 수 있다. 예컨대 상기 사용자 단말은 개인PC, 태블릿PC, 스마 트폰, 웨어러블 기기일 수 있다. 가장 바람직하게, 상기 사용자 단말은 상기 플랫폼 서버가 다수의 사용자가 용이하게 접근하여 콘텐츠 수집 플랫폼 서비스를 활용할 수 있도록 형성한 어플리케이션이 설치될 수 있다. 그리고 다수의 사용자는 각자의 사용자 단말을 통해서 상기 어플리케이션에 접근할 수 있고, 상기 플랫폼 서버가 제공하는 콘텐츠 수집 플랫폼 서비스를 시간과 장소에 관계없이 활용할 수 있다. 일상적으로 임의의 사용자는 사용자 단말을 통해서 인터넷 네트워크상에서 수많은 외부플랫폼에 접근할 수 있고, 타 사용자로부터 실시간으로 게시 및 공유된 사진, 글, 동영상 형태의 수많은 콘텐츠를 접할 수 있다. 다 만, 사용자는 저장하고 싶은 콘텐츠가 있다면 각각의 외부플랫폼에서 제공하는 저장기능을 통해서 개별적으로 저장할 수 있는데, 이렇게 되면 저장한 콘텐츠를 한 번에 확인하거나 이를 재가공하여 또 다른 콘텐츠로 생성하 기 상당히 불편하다. 이를 해결하고자 본 발명의 플랫폼 서버는 서로 다른 다수 개의 외부플랫폼 중 적어 도 하나의 외부플랫폼에서 게시된 다수 개의 콘텐츠와 각각의 콘텐츠에 대한 콘텐츠 정보를 사용자 단말을 통해서 수집할 수 있도록 한다. 도 3의 (a) 내지 (b)를 보면, 상기 플랫폼 서버는 가장 바람직하게 어플리케이션 기반의 공유하기 서비스 를 제공함으로써, 상기 사용자 단말로부터 선택된 임의의 외부플랫폼 내 임의의 콘텐츠를 수집할 수 있다. 즉, 상기 사용자 단말은 공유하기 기능을 이용하여 임의의 외부플랫폼에서 저장하고자 하는 임의의 콘텐츠 를 상기 플랫폼 서버에 전송할 수 있다. 이때, 상기 공유하기 기능은 콘텐츠 자체만 전송하는 것이 아니라 해당 콘텐츠의 링크주소, 파일형식, 카테고리, 수집일자를 포함하는 콘텐츠 정보를 함께 전송할 수 있다. 그러 면, 상기 플랫폼 서버는 임의의 콘텐츠와 이의 콘텐츠 정보를 전송받은 후 수집할 수 있다. 여기서, 수집 은 획득하고 저장하는 일련의 동작을 말한다. 또한, 상기 플랫폼 서버는 상기 다수 개의 콘텐츠 중에서 상기 사용자 단말로부터 선택된 적어도 하 나의 원본 콘텐츠를 포함하는 폴더를 생성할 수 있다. 여기서, 상기 원본 콘텐츠는 상기 외부플랫폼으로부터 수 집된 후 일체 가공되지 않은 상태의 콘텐츠를 말한다. 즉, 상기 플랫폼 서버가 상기 폴더를 생성하는 서비스를 제공함으로써, 사용자는 상기 다수 개의 외부플랫 폼으로부터 수집된 다수 개의 콘텐츠 중에서 한 번에 확인하고자 하는 콘텐츠를 자신이 원하는 대로 직접 분류 할 수 있다. 도 4의 (a)를 보면, 상기 플랫폼 서버가 제공하는 어플리케이션에는 상기 사용자 단말로 부터 선택된 적어도 하나의 원본 콘텐츠를 포함하는 폴더가 생성됨과 동시에 표시될 수 있고, 사용자는 자신의 사용자 단말을 통해서 자신이 분류하고자 했던 콘텐츠가 포함된 폴더, 타 사용자가 분류하고자 했던 콘텐 츠가 포함된 폴더를 스크롤 및 터치 방식으로 확인할 수 있다. 그리고 도 4의(b)를 보면, 상기 폴더는 텍스트 기반 콘텐츠만을 포함하는 글만 있는 폴더, 이미지와 텍스트 기 반 콘텐츠만을 포함하는 이미지와 정보가 있는 폴더, 동영상과 이미지 기반 콘텐츠만을 포함하는 영상 또는 이 미지만 있는 폴더를 포함할 수 있다. 그리고 각 폴더는 사용자의 프로필 이미지, 사용자의 계정이름, 해당 폴더 소개 및 콘텐츠 내용, 다수 개의 콘텐츠를 포함할 수 있다. 이에 따라, 본 발명은 상기 사용자 단말을 통 해서 무작위적으로 상기 플랫폼 서버에 수집된 다수 개의 콘텐츠에 대해 사용자의 활용성 및 가독성을 향 상시킬 수 있도록 하는 현저한 효과가 있다. 다음으로, 상기 플랫폼 서버는 상기 원본 콘텐츠를 상기 사용자 단말이 가공할 수 있도록 인터페이스 를 제공하고, 상기 원본 콘텐츠가 상기 사용자 단말로부터 가공된 가공 콘텐츠를 상기 폴더에 포함하는 콘텐츠 가공부를 포함한다. 상기 콘텐츠 가공부는 상기 원본 콘텐츠의 크기를 조절하는 크기조절기능, 텍스트를 추가하는 텍스트기능, 필터를 입히는 필터기능을 포함할 수 있다. 즉, 상기 플랫폼 서버는 상기 폴더에 상기 원본 콘텐츠만을 포함할 수 있고, 상기 원본 콘텐츠와 가공 콘텐츠를 모두 포함할 수 있고, 상기 가공 콘텐츠만을 포함할 수 있다. 한편, 도 5의 (a) 내지 (b)를 보면 상기 콘텐츠 가공부는 생성된 폴더 역시 가공할 수 있다. 상기 콘텐츠 가공부는 폴더의 이름, 폴더의 배경색 및 템플릿을 변경하는 폴더변경기능을 포함할 수 있다. 그리고 상기 콘텐츠 가공부는 상기 폴더 내 새로운 콘텐츠를 상기 사용자 단말이 추가할 수 있도록 다양한 인터페 이스를 제공할 수 있다. 예컨대, 도 5의 (c)를 보면 상기 콘텐츠 가공부는 수집된 콘텐츠 이외에 상기 폴 더에 새롭게 추가하고자 하는 콘텐츠의 링크주소를 기재할 수 있는 인터페이스를 제공할 수 있고, 도 5의 (d) 내지 (e)를 보면 사용자 단말 내 카메라를 통해서 직접 촬영한 사진을 업로드할 수 있는 인터페이스를 제 공할 수 있고, 사용자 단말 내 앨범을 통해서 이전에 촬영한 사진을 업로드할 수 있는 인터페이스를 제공 할 수 있고, 도 5의 (f)를 보면 새로운 텍스트를 입력하여 메모할 수 있는 인터페이스를 제공할 수 있다. 다음으로, 상기 플랫폼 서버는 상기 폴더에 포함된 상기 원본 콘텐츠와 가공 콘텐츠 중 적어도 하나에 대 하여 다수 개의 사용자 단말이 서로 커뮤니케이션할 수 있도록 인터페이스를 제공하는 커뮤니케이션 제공 부를 포함한다. 즉, 상기 폴더에 포함된 각각의 콘텐츠에 타 사용자 단말이 공감을 표시하기 위해서 ‘좋아요’를 누르거나, ‘댓글’을 기재할 수 있도록 인터페이스를 제공할 수 있다. 한편, 상기 커뮤니케이션 제공부는 임의의 사용자가 폴더를 생성할 때마다 콘텐츠 수집 플랫폼에 접근한 또 다른 사용자가 확인하기 용이하도록 다른 사용자가 임의의 사용자를 구독하기 위해서 ‘팔로우’를 누를 수 있는 인터페이스를 제공할 수 있다. 따라서 상기 커뮤니케이션 제공부를 통해서 콘텐츠 게시자와 시청자 간에 콘텐츠에 대한 의견을 주고받음으로써 사용자들의 양방향 소통이 가능하도록 하는 현저한 효과가 있다. 다음으로, 본 발명의 상기 플랫폼 서버는 하나의 사용자 단말을 통해서 다수 개의 외부플랫폼으로부 터 다수 개의 콘텐츠를 수집한 후 상기 폴더를 생성할 수도 있지만, 다수 개의 사용자 단말(200a, 200b, 200c...)을 통해서 다수 개의 외부플랫폼으로부터 다수 개의 콘텐츠를 수집한 후 다수 개의 사용자 단말(200a, 200b, 200c...)에서 각각 선택된 콘텐츠를 포함하는 그룹폴더를 생성할 수도 있다. 보다 구체적으로, 도 2를 보면, 상기 플랫폼 서버는 상기 다수 개의 콘텐츠와 각각의 콘텐츠에 대한 콘텐 츠 정보를 다수 개의 사용자 단말(200a, 200b, 200c...)을 통해서 수집하고, 상기 다수 개의 콘텐츠 중에서 상 기 다수 개의 사용자 단말(200a, 200b, 200c...)로부터 각각 선택된 다수 개의 원본 콘텐츠를 포함하는 그룹폴 더를 생성할 수 있다. 그리고 상기 콘텐츠 가공부는 상기 그룹폴더에 포함된 다수 개의 원본 콘텐츠를 상 기 다수 개의 사용자 단말(200a, 200b, 200c...)이 가공할 수 있도록 인터페이스를 제공하고, 상기 다수 개의 사용자 단말(200a, 200b, 200c...)로부터 가공된 그룹가공 콘텐츠를 상기 그룹폴더에 포함할 수 있다. 예컨대, 다수 개의 사용자 단말(200a, 200b, 200c...) 중에서 임의의 사용자 단말(200a)을 통해서 상기 플랫폼 서버는 특정 주제에 대한 하나의 폴더를 생성할 수 있다. 이때, 상기 플랫폼 서버는 폴더를 생성함과 동시에 고유링크를 생성할 수 있다. 즉, 임의의 사용자 단말(200a)은 상기 고유링크를 다른 사용자 단말(200b, 200c...)들과 공유할 수 있고, 상기 고유링크를 통해서 유입된 사용자 단말(200b, 200c...)들은 상기 폴더에 콘 텐츠를 추가 및 가공할 수 있는 권한을 상기 플랫폼 서버로부터 부여받을 수 있다. 즉, 상기 그룹폴더는 다수 개의 사용자 단말(200a, 200b, 200c...)이 콘텐츠를 추가하거나 가공함으로써 생성된 폴더의 종류 중 하나 이다. 그리고 상기 콘텐츠 가공부는 상기 다수 개의 사용자 단말(200a, 200b, 200c...)이 수집된 콘텐츠 이외에 상기 그룹폴더에 새롭게 추가하고자 하는 콘텐츠의 링크주소를 기재할 수 있는 인터페이스를 제공할 수 있고, 상기 다수 개의 사용자 단말(200a, 200b, 200c...) 각각에 구비된 카메라를 통해서 직접 촬영한 사진을 업로드 할 수 있는 인터페이스를 제공할 수 있고, 상기 다수 개의 사용자 단말(200a, 200b, 200c...) 내 앨범을 통해서 이전에 촬영한 사진을 업로드할 수 있는 인터페이스를 제공할 수 있고, 새로운 텍스트를 입력하여 메모할 수 있 는 인터페이스를 제공할 수 있다. 따라서 본 발명은 주제와 연관된 콘텐츠가 여러 사용자에 의하여 수집, 추가 및 가공될 수 있는 현저한 효과가 있다. 다음으로, 상기 플랫폼 서버는 상기 콘텐츠 정보 내 링크주소에 기초하여 외부플랫폼의 종류를 인식한 후 외부플랫폼별로 콘텐츠를 분류하고, 상기 콘텐츠 정보 내 수집일자에 기초하여 수집일자별로 콘텐츠를 분류하고, 상기 콘텐츠 정보 내 카테고리에 기초하여 상기 콘텐츠를 기 저장된 카테고리 중 하나로 분류하는 콘텐츠 분류부를 포함할 수 있다. 도 6의 (a)를 보면, 상기 콘텐츠 분류부는 상기 링크주소에 기재된 텍스트를 기반으로 사이트의 종류 또는 어플리케이션의 종류를 인식할 수 있다. 예컨대, 상기 콘텐츠 분류부는 상기 링크주소로 ‘ https://www.instagram.com/_and_makes/’를 획득한다면, www. 과 .com 사이의 문자열을 인식함으로써 외부플 랫폼이 ‘인스타그램(Instagram)’이라는 것을 인식할 수 있다. 이와 동일하게 상기 콘텐츠 분류부는 수집 된 다수 개의 콘텐츠 각각의 콘텐츠 정보에 기초하여 구글, 페이스북, 인스타그램, 네이버 블로그, 유튜브와 같 은 외부플랫폼을 인식할 수 있고, 수집된 상기 다수 개의 콘텐츠를 각각 자동으로 분류할 수 있다. 따라서 사용 자는 외부플랫폼별로 콘텐츠를 확인할 수 있는 현저한 효과가 있다. 그리고 도 6의 (b)를 보면, 상기 콘텐츠 분류부는 상기 콘텐츠 정보 내 수집일자에 기초하여 수집일자별로 콘텐츠를 분류할 수 있다. 따라서 사용자는 일자별로 수집된 콘텐츠의 개수 및 콘텐츠 자체를 확인할 수 있는 현저한 효과가 있다. 그리고 도 6의 (c)를 보면, 상기 콘텐츠 분류부는 상기 콘텐츠 정보 내 카테고리에 기초하여 상기 콘텐츠 를 기 저장된 카테고리 중 하나로 분류할 수 있다. 이때, 기 저장된 카테고리에는 트렌드, 일상, 브랜드, 스포 츠, 연예, 리빙, 푸드, 예술, 유머, 쇼핑, 경제, 취미, 커리어, 지식교양, 패션뷰티, 건강, 테크, 반려동물, 여 행, 교육 등이 포함될 수 있다. 상기 외부플랫폼에는 자체적으로 카테고리를 분류하는 경우가 종종 있다. 즉, 외부플랫폼으로부터 기 분류된 카 테고리가 있어 상기 콘텐츠 정보에 포함되어 있는 경우, 상기 콘텐츠 분류부는 외부플랫폼으로부터 기 분 류된 카테고리가 상기 콘텐츠 분류부 내 기 저장된 카테고리 중에서 대응하는 카테고리로 자동으로 분류할 수 있다. 이때, 대응하는 카테고리는 하나 이상일 수 있고, 중복으로 자동 분류될 수 있다. 예컨대, 인스타그램 (Instagram)이라는 외부플랫폼에서 ‘건강 및 뷰티’에 대한 비즈니스 계정에서 게시된 콘텐츠의 경우 상기 콘 텐츠 분류부에 기 저장된 카테고리 중에서 ‘패션뷰티’ 와 ‘건강’ 카테고리와 대응됨으로, 최종적으로 해당 콘텐츠는 ‘패션뷰티’와 ‘건강’ 카테고리에 중복으로 자동 분류될 수 있다. 반대로, 상기 콘텐츠 정보 내 카테고리를 포함하지 않는 콘텐츠의 경우 상기 콘텐츠 분류부는 콘텐츠 자체 에서 텍스트 마이닝(Text Mining)하고, 상기 콘텐츠와 연관된 키워드를 추출한 후 상기 키워드에 기초하여 상기 콘텐츠를 기 저장된 카테고리 중 하나로 분류할 수 있다. 상기 콘텐츠 분류부는 상기 콘텐츠 정보에 포함 되어 있는 카테고리와 기 저장된 카테고리가 대응되지 않는 경우에도 상기와 동일하게, 콘텐츠 자체에서 텍스트 마이닝(Text Mining)하고, 상기 콘텐츠와 연관된 키워드를 추출한 후 상기 키워드에 기초하여 상기 콘텐츠를 기 저장된 카테고리 중 하나로 분류할 수 있다. 이는, 일반적으로 콘텐츠는 사용자 단말을 통해서 해시태그 또는 간단한 텍스트와 함께 업로드 되기 때문에, 상 기 콘텐츠 분류부는 이러한 텍스트를 인공지능 기술기반으로 분석하고 상기 콘텐츠와 가장 관련이 있는 키 워드만을 추출할 수 있다. 그리고 해당 키워드가 포함될 수 있는 카테고리로 최종적으로 분류할 수 있다. 따라 서 상기 콘텐츠 분류부는 수집된 다수 개의 콘텐츠 중에서 자동으로 분류되지 못하는 비분류 콘텐츠를 최 소화할 수 있는 현저한 효과가 있다. 따라서 본 발명에 의하면 사용자는 사용자 단말을 통해서 직접 선택한 콘텐츠를 포함하는 폴더를 이용하여 다수 개의 외부플랫폼으로부터 수집된 다수 개의 콘텐츠를 자신이 원하는 대로 직접 분류할 수 있고, 뿐만 아니 라 수집된 다수 개의 콘텐츠가 상기 콘텐츠 분류부를 통해서 외부플랫폼별, 수집일자별 및 카테고리별로 자동으로 분류된 것을 용이하게 확인할 수 있다. 다음으로, 상기 플랫폼 서버는, 상기 콘텐츠 분류부로부터 분류되지 않은 비분류 콘텐츠가 기 설정된 기간 내에 상기 사용자 단말로부터 분류되지 않는 경우 상기 사용자 단말에 정리요청 팝업창을 제공 하고, 상기 사용자 단말로부터 상기 정리요청 팝업창이 선택된 후 상기 비분류 콘텐츠가 분류되면 리워드 를 제공하는 리워드 제공부를 더 포함할 수 있다. 즉, 상기 리워드 제공부는 오랫동안 분류되지 않는 콘텐츠가 없도록 사용자에게 동기부여를 하고자 리워드를 제공할 수 있다. 가장 바람직하게, 상기 리워드 제공부는 게임형식 기반의 정리요청 팝업창을 제공할 수 있다. 예컨대, 상 기 리워드 제공부는 비분류 콘텐츠를 폴더 바구니에 담기, 비분류 콘텐츠를 풍선 터뜨리기, 비분류 콘텐츠 를 볼링하기 등으로 제공할 수 있고, 게임 내에서 상기 정리요청 팝업창을 제공함으로써, 사용자 단말로부 터 상기 비분류 콘텐츠를 신속하게 분류할 수 있도록 흥미를 유발시킬 수 있고 동기를 부여할 수 있다. 다음으로, 상기 플랫폼 서버는 상기 사용자 단말로부터 수집된 상기 다수 개의 콘텐츠와 각각의 콘텐 츠에 대한 콘텐츠 정보 중 적어도 하나를 이용하여 인공지능 기술기반으로 사용자 성향을 분석한 후 기 수집된 다수 개의 콘텐츠 중에서 사용자 성향과 대응되는 콘텐츠를 추천 콘텐츠로 제공하거나, 기 생성된 폴더 중에서 사용자 성향과 대응되는 폴더를 추천 폴더로 제공하는 콘텐츠 추천부를 더 포함할 수 있다. 이때, 상기 추 천 폴더는 임의의 사용자 단말을 통해서 생성된 상기 폴더일 수 있고, 상기 다수 개의 사용자 단말(200a, 200b, 200c...)를 통해서 생성된 상기 그룹폴더일 수 있다. 예컨대, 상기 콘텐츠 추천부는 상기 사용자 단말을 통해서 기 설정된 기간 내 수집된 다수 개의 콘텐 츠 중에서 애완동물 강아지에 대한 콘텐츠가 약 90% 이상이라면 사용자 성향을 애완동물 강아지를 좋아하는 성 향으로 분석하여 다른 사용자 단말로부터 수집된 콘텐츠 중에서 애완동물 강아지에 대한 사진, 영상, 메모 등을 포함하는 다양한 형식의 콘텐츠를 추천 콘텐츠로 제공하거나, 애완동물 강아지에 대한 사진, 영상, 메모 등을 포함하는 다양한 형식의 콘텐츠를 이용하여 생성된 폴더를 추천 폴더로 제공할 수 있다. 따라서 사용자는 자신이 주로 사용하는 외부플랫폼에서 수집한 콘텐츠뿐만 아니라 다양한 외부플랫폼에 게시 및 공유되어 있는 콘텐츠를 추천받을 수 있고, 자신의 성향에 적합한 콘텐츠를 추천받을 수 있는 현저한 효과가 있 다. 한편, 상기 플랫폼 서버는 수집된 다수 개의 콘텐츠 중 적어도 하나를 대상으로 리마인드 일자를 지정할 수 있도록 하고, 상기 리마인드 일자가 도래하면 알림을 상기 사용자 단말에 제공하는 리마인드 제공부 를 더 포함할 수 있다. 즉, 상기 리마인드 제공부는, 사용자가 꼭 다시 보고자하는 콘텐츠 또는 해당 일자에 확인해야하는 콘텐츠를 잊어버리지 않고 확인할 수 있도록 하는 현저한 효과가 있다. 종합해보면, 하루에도 수많은 콘텐츠를 접하는 사용자는 자신이 다시 보고 싶은 콘텐츠를 각 사이트 또는 어플 리케이션에서 제공하는 보관함 기능 또는 메신저의 나에게 보내기 기능을 통해서 별도로 수집한다. 다만, 사용 자는 저장할 당시에는 나중에 확인할 것이라는 막연한 생각으로 각 외부플랫폼에서 제공하는 보관함 기능 또는 나에게 보내기 기능을 사용하지만 결국 해당 콘텐츠를 다시 확인하거나 활용하지 않고 잊어버리게 된다. 본 발명에 의하면 다수 개의 외부플랫폼 중 적어도 하나의 외부플랫폼으로부터 다수 개의 콘텐츠와 각각의 콘텐 츠 정보를 수집하고, 상기 다수 개의 콘텐츠 중에서 상기 사용자 단말로부터 선택된 적어도 하나의 원본 콘텐츠를 포함하는 폴더를 생성함으로써, 사용자 본인 입장에서 자신이 직접 원하는 대로 분류한 콘텐츠를 한 번에 확인할 수 있고, 상기 폴더 내 콘텐츠의 추가 및 가공을 통해 또 다른 새로운 콘텐츠를 생성하여 셀프 브 랜딩(Self Branding)에 활용할 수 있는 현저한 효과가 있다. 또한, 본 발명은 콘텐츠 수집 플랫폼에 접근한 또 다른 다수의 사용자들과 콘텐츠 및 폴더를 공유하거나 좋아요, 댓글, 팔로우 기능을 통해 커뮤니케이션할 수 있고, 또 다른 다수의 사용자들과 하나의 주제에 부합하 는 콘텐츠를 함께 수집하여 새로운 콘텐츠를 생성할 수 있는 현저한 효과가 있다. 또한, 본 발명은 사용자 단말로부터 수집된 다수 개의 콘텐츠를 자동으로 분류하여 외부플랫폼별, 수집일 자별, 카테고리별로 확인할 수 있고, 사용자 단말로부터 수집된 다수 개의 콘텐츠와 각각의 콘텐츠 정보에 기초하여 사용자 성향을 분석한 후 적합한 콘텐츠를 추천하여 사용자의 콘텐츠 접근 편의성을 증진시킬 수 있는 현저한 효과가 있다. 실시예들은 하드웨어, 소프트웨어, 펌웨어, 미들웨어, 마이크로코드, 하드웨어 기술 언어, 또는 이들의 임의의 조합에 의해 구현될 수 있다. 소프트웨어, 펌웨어, 미들웨어 또는 마이크로코드로 구현되는 경우, 필요한 작업 을 수행하는 프로그램 코드 또는 코드 세그먼트들은 컴퓨터 판독 가능 저장 매체에 저장되고 하나 이상의 프로 세서에 의해 실행될 수 있다. 그리고 본 명세서에 설명된 주제의 양태들은 컴퓨터에 의해 실행되는 프로그램 모듈 또는 컴포넌트와 같은 컴퓨 터 실행 가능 명령어들의 일반적인 맥락에서 설명될 수 있다. 일반적으로, 프로그램 모듈 또는 컴포넌트들은 특 정 작업을 수행하거나 특정 데이터 형식을 구현하는 루틴, 프로그램, 객체, 데이터 구조를 포함한다. 본 명세서 에 설명된 주제의 양태들은 통신 네트워크를 통해 링크되는 원격 처리 디바이스들에 의해 작업들이 수행되는 분 산 컴퓨팅 환경들에서 실시될 수도 있다. 분산 컴퓨팅 환경에서, 프로그램 모듈들은 메모리 저장 디바이스들을 포함하는 로컬 및 원격 컴퓨터 저장 매체에 둘 다에 위치할 수 있다."}
{"patent_id": "10-2022-0002573", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 으로 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2022-0002573", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 콘텐츠 수집 플랫폼 시스템 구성도이다. 도 2는 본 발명의 일실시예에 따라 다수 개의 사용자 단말을 대상으로 하는 콘텐츠 수집 플랫폼 시스템 구성도 이다. 도 3은 본 발명의 일실시예에 따라 외부플랫폼으로부터 콘텐츠를 수집하는 것을 표시한 도면이다. 도 4는 본 발명의 일실시예에 따라 플랫폼 서버로부터 생성된 폴더를 표시한 도면이다. 도 5는 본 발명의 일실시예에 따라 폴더를 가공하기 위한 다양한 인터페이스를 표시한 도면이다. 도 6은 본 발명의 일실시예에 따라 외부플랫폼별(a), 수집일자별(b), 카테고리별(c)로 분류된 콘텐츠를 표시한 도면이다."}
