{"patent_id": "10-2022-0151819", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0073179", "출원번호": "10-2022-0151819", "발명의 명칭": "그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치 및 방법", "출원인": "연세대학교 산학협력단", "발명자": "박노성"}}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시계열 데이터에서 각 노드에 대해 연속 경로를 생성하는 전처리부; 및상기 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을결합하여 시간 정보 및 공간 정보를 통합 처리하는 메인 처리부를 포함하고,상기 메인 처리부는두개의 CDE(Controlled Differential Equation) 함수로 상기 각 노드에 대해 시간처리 및 공간처리를 수행하여마지막 은닉 벡터를 계산하고 출력 레이어를 예측하는 것을 특징으로 하는 그래픽 신경 제어 미분 방정식(Graph Neural Controlled Differential Equation) 기반의 시공간 예측 장치."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 전처리부는각 노드에 대해 보간 알고리즘을 수행하여 연속경로를 생성하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 전처리부는상기 보간 알고리즘으로 자연 3차 스플라인을 사용하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 메인 처리부는상기 각 노드의 연속 경로를 시간처리(Temporal Processing)하여 시간정보의 은닉 궤적을 생성하는 제1 NCDE 모듈; 및상기 각 노드의 연속 경로를 공간 처리(Spatial Processing)하여 공간정보의 은닉 궤적을 생성하는 제2 NCDE 모듈을 포함하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 제1 NCDE 모듈은모든 노드에 대해 상기 은닉 궤적을 스태킹(staking)하여 행렬을 생성하고 CDE 함수로 상기 행렬의 각 행을 개별적으로 처리하여 연속 RNN으로 변환하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 메인 처리부는공개특허 10-2024-0073179-3-상기 시간 처리 및 공간 처리의 초기값을 생성하고 초기값 생성 계층의 매개변수, 노드 임베딩 행렬을 포함한CDE 함수 및 출력 레이어를 훈련하는 초기값 생성모듈을 더 포함하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "시계열 데이터에서 각 노드에 대해 연속 경로를 생성하는 전처리 단계; 및상기 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을결합하여 시간 정보 및 공간 정보를 통합 처리하는 메인 처리단계를 포함하고,상기 메인 처리단계는두개의 CDE(Controlled Differential Equation) 함수로 상기 각 노드에 대해 시간처리 및 공간처리를 수행하여마지막 은닉 벡터를 계산하고 출력 레이어를 예측하는 것을 특징으로 하는 그래픽 신경 제어 미분 방정식(Graph Neural Controlled Differential Equation) 기반의 시공간 예측 방법."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 전처리 단계는각 노드에 대해 보간 알고리즘을 수행하여 연속경로를 생성하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 전처리 단계는상기 보간 알고리즘으로 자연 3차 스플라인을 사용하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서, 상기 메인 처리단계는제1 NCDE 모듈을 통해 상기 각 노드의 연속 경로를 시간처리(Temporal Processing)하여 시간정보의 은닉 궤적을생성하는 시간처리 단계; 및제2 NCDE 모듈을 통해 상기 각 노드의 연속 경로를 공간 처리(Spatial Processing)하여 공간정보의 은닉 궤적을생성하는 공간처리 단계를 포함하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터처리 방법."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 시간처리 단계는모든 노드에 대해 상기 은닉 궤적을 스태킹(staking)하여 행렬을 생성하고 CDE 함수로 상기 행렬의 각 행을 개별적으로 처리하여 연속 RNN으로 변환하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법."}
{"patent_id": "10-2022-0151819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2024-0073179-4-제10항에 있어서, 상기 메인 처리단계는상기 시간 처리 및 공간 처리의 초기값을 생성하고 초기값 생성 계층의 매개변수, 노드 임베딩 행렬을 포함한CDE 함수 및 출력 레이어를 훈련하는 초기값 생성단계를 더 포함하는 것을 특징으로 하는 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 그래프 신경 제어 미분 방정식 (Graph Neural Controlled Differential Equation) 기반의 시공간 데 이터 처리 장치 및 방법에 관한 것으로, 상기 장치는 시계열 데이터에서 각 노드에 대해 연속 경로를 생성하는 전처리부; 및 상기 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을 결합하여 시간 정보 및 공간 정보를 통합 처리하는 메인 처리부를 포함하고, 상기 메인 처리부는 두 개의 CDE(Controlled Differential Equation) 함수로 상기 각 노드에 대해 시간처리 및 공간처리를 수행하여 마 지막 은닉 벡터를 계산하고 출력 레이어를 예측할 수 있다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시공간 데이터 처리 기술에 관한 것으로, 보다 상세하게는 신경 제어 미분 방정식(Neural Controlled Differential Equations; 이하 NCDE)을 기반으로 시간 처리를 위한 NCDE와 공간 처리를 위한 NCDE를 단일 프레 임워크로 결합하여 시공간 그래프 데이터 처리의 정확도를 높일 수 있는 STG-NCDE 기술에 관한 것이다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "시공간(spatio-temporal) 그래프 데이터는 교통량에서 기후 예측에 이르기까지 실제 응용 프로그램에서 자주 발 생한다. 예를 들어, California Performance of Transportation(PeMS)에서 시작한 교통량 예측 태스크는 시공 간 처리 분야에서 가장 인기있는 문제 중 하나이다. 그래프의 시계열 이 주어지면, 여기서 는 고정 노드 집합, 는 고정 에지 집합, 는 가 관측되는 시점이고, 는 노드의 -차원 입력 특징을 포함하는 시간 에서의 특징 행렬이며, 시공간 예측은 을 예측한다. 예를 들어, 과거 N+1개의 교통량 패턴이 주어진 다음 S개의 시점 동안 도로 네트워크의 각 위치에 대한 교통량을 예측한다. 여기서, 는 예측할 위치의 수이고 부피가 스칼라, 즉 차량 수이기 때문에 이다. 와 는 시간이 지남에 따라 변하지 않는다. 즉, 그래프 토폴 로지는 고정되어 있지만 노드 입력 기능은 시간이 지남에 따라 변할 수 있다. 이 태스크를 위해 다양한 기술이 제안되었다. 한편, 순환 신경망(Recurrent Neural Networks, RNNs)의 연속 유사체로 간주되는 NCDE는 다음 수학식으로 정의 된다. [수학식]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "여기서, 는 바나흐 공간에서 값을 취하는 연속 경로이다. 의 전체 궤적은 경로 에 의해 시간이 지남에 따라 제어된다. 다운스트림 태스크에 대해 제어 미분 방정식(CDE) 함수 를 기울이는 것은 NCDE의 핵심이다. CDE 이론은 확률적 미분 방정식과 이토(Ito) 미적분학을 의 준마팅게일 설정을 훨씬 넘어서 확장하기 위해 개 발되었다. 즉, 가 준마팅게일 조건을 만족시키는 경우에만 확률적 미분 방정식으로 축소한다. 예를 들어, 경 로 의 일반적인 예는 확률적 미분 방정식의 경우 위너(Wiener) 과정이다. 그러나 CDE에서 경로 는 그러한 준마팅게일 또는 마팅게일 과정일 필요가 없다. NODE는 이러한 CDE를 매개변수화하고 데이터에서 학습하는 기 술이다. 또한, NODE는 연속 RNN과 동일하며 많은 시계열 태스크 및 데이터에서 최신 정확도를 보여준다. 그러나 NCDE 기술(즉, 시간 처리)과 그래프 컨볼루션 처리 기술(즉, 공간 처리)을 결합하는 방법은 아직 연구되 지 않았다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2254765호 (2021.05.14)"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 NCDE을 기반으로 시간 처리를 위한 NCDE와 공간 처리를 위한 NCDE를 단일 프레임워크로 결합하여 시공간 그래프 데이터 처리의 정확도를 높일 수 있는 STG-NCDE 기술을 제공하고자 한다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예들 중에서, 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치는 시계열 데이터에서 각 노드 에 대해 연속 경로를 생성하는 전처리부; 및 상기 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을 결합하여 시간 정보 및 공간 정보를 통합 처리하는 메인 처 리부를 포함하고, 상기 메인 처리부는 두개의 CDE(Controlled Differential Equation) 함수로 상기 각 노드에 대해 시간처리 및 공간처리를 수행하여 마지막 은닉 벡터를 계산하고 출력 레이어를 예측할 수 있다. 상기 전처리부는 각 노드에 대해 보간 알고리즘을 수행하여 연속경로를 생성할 수 있다. 상기 전처리부는 상기 보간 알고리즘으로 자연 3차 스플라인을 사용할 수 있다. 상기 메인 처리부는 상기 각 노드의 연속 경로를 시간처리(Temporal Processing)하여 시간정보의 은닉 궤적을 생성하는 제1 NCDE 모듈; 및 상기 각 노드의 연속 경로를 공간 처리(Spatial Processing)하여 공간정보의 은닉 궤적을 생성하는 제2 NCDE 모듈을 포함할 수 있다. 상기 제1 NCDE 모듈은 모든 노드에 대해 상기 은닉 궤적을 스태킹(staking)하여 행렬을 생성하고 CDE 함수로 상 기 행렬의 각 행을 개별적으로 처리하여 연속 RNN으로 변환할 수 있다. 상기 메인 처리부는 상기 시간 처리 및 공간 처리의 초기값을 생성하고 초기값 생성 계층의 매개변수, 노드 임 베딩 행렬을 포함한 CDE 함수 및 출력 레이어를 훈련하는 초기값 생성모듈을 더 포함할 수 있다. 실시예들 중에서, 그래프 신경 제어 미분 방정식 (Graph Neural Controlled Differential Equation) 기반의 시 공간 데이터 처리 방법은 시계열 데이터에서 각 노드에 대해 연속 경로를 생성하는 전처리 단계; 및 상기 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을 결합하여 시간 정보 및 공간 정보를 통합 처리하는 메인 처리단계를 포함하고, 상기 메인 처리단계는 두개의 CDE(Controlled Differential Equation) 함수로 상기 각 노드에 대해 시간처리 및 공간처리를 수행하여 마지막 은닉 벡터를 계산하고 출력 레이어를 예측할 수 있다. 상기 전처리 단계는 각 노드에 대해 보간 알고리즘을 수행하여 연속경로를 생성할 수 있다. 상기 전처리 단계는 상기 보간 알고리즘으로 자연 3차 스플라인을 사용할 수 있다. 상기 메인 처리단계는 제1 NCDE 모듈을 통해 상기 각 노드의 연속 경로를 시간처리(Temporal Processing)하여 시간정보의 은닉 궤적을 생성하는 시간처리 단계; 및 제2 NCDE 모듈을 통해 상기 각 노드의 연속 경로를 공간 처리(Spatial Processing)하여 공간정보의 은닉 궤적을 생성하는 공간처리 단계를 포함할 수 있다. 상기 시간처리 단계는 모든 노드에 대해 상기 은닉 궤적을 스태킹(staking)하여 행렬을 생성하고 CDE 함수로 상 기 행렬의 각 행을 개별적으로 처리하여 연속 RNN으로 변환할 수 있다. 상기 메인 처리단계는 상기 시간 처리 및 공간 처리의 초기값을 생성하고 초기값 생성 계층의 매개변수, 노드 임베딩 행렬을 포함한 CDE 함수 및 출력 레이어를 훈련하는 초기값 생성단계를 더 포함할 수 있다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 기술은 다음의 효과를 가질 수 있다. 다만, 특정 실시예가 다음의 효과를 전부 포함하여야 한다거나 다 음의 효과만을 포함하여야 한다는 의미는 아니므로, 개시된 기술의 권리범위는 이에 의하여 제한되는 것으로 이 해되어서는 아니 될 것이다. 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 장치 및 방법은 NCDE을 기반으로 시 간 처리를 위한 NCDE와 공간 처리를 위한 NCDE를 단일 프레임워크로 결합하여 시공간 그래프 데이터 처리의 정 확도를 높일 수 있다. 따라서, 본 발명의 STG-NCED 방식을 통해 불규칙한 교통량 예측의 수행 성능을 향상시킬 수 있다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명에 관한 설명은 구조적 내지 기능적 설명을 위한 실시예에 불과하므로, 본 발명의 권리범위는 본문에 설 명된 실시예에 의하여 제한되는 것으로 해석되어서는 아니 된다. 즉, 실시예는 다양한 변경이 가능하고 여러 가 지 형태를 가질 수 있으므로 본 발명의 권리범위는 기술적 사상을 실현할 수 있는 균등물들을 포함하는 것으로 이해되어야 한다. 또한, 본 발명에서 제시된 목적 또는 효과는 특정 실시예가 이를 전부 포함하여야 한다거나 그러한 효과만을 포함하여야 한다는 의미는 아니므로, 본 발명의 권리범위는 이에 의하여 제한되는 것으로 이해 되어서는 아니 될 것이다. 한편, 본 출원에서 서술되는 용어의 의미는 다음과 같이 이해되어야 할 것이다. \"제1\", \"제2\" 등의 용어는 하나의 구성요소를 다른 구성요소로부터 구별하기 위한 것으로, 이들 용어들에 의해 권리범위가 한정되어서는 아니 된다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\"있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결될 수 도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\"있다고 언급된 때에는 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 한편, 구성요소들 간의 관계를 설명하는 다른 표현들, 즉 \"~사이에\"와 \"바로 ~사이에\" 또는 \"~에 이웃 하는\"과 \"~에 직접 이웃하는\" 등도 마찬가지로 해석되어야 한다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한 복수의 표현을 포함하는 것으로 이해되어야 하고, \"포함 하다\"또는 \"가지다\" 등의 용어는 실시된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 지정하려는 것이며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이 들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 각 단계들에 있어 판별부호(예를 들어, a, b, c 등)는 설명의 편의를 위하여 사용되는 것으로 판별부호는 각 단 계들의 순서를 설명하는 것이 아니며, 각 단계들은 문맥상 명백하게 특정 순서를 기재하지 않는 이상 명기된 순 서와 다르게 일어날 수 있다. 즉, 각 단계들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 본 발명은 컴퓨터가 읽을 수 있는 기록매체에 컴퓨터가 읽을 수 있는 코드로서 구현될 수 있고, 컴퓨터가 읽을 수 있는 기록 매체는 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록 장치를 포함 한다. 컴퓨터가 읽을 수 있는 기록 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다. 또한, 컴퓨터가 읽을 수 있는 기록 매체는 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 여기서 사용되는 모든 용어들은 다르게 정의되지 않는 한, 본 발명이 속하는 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 용어들은 관 련 기술의 문맥상 가지는 의미와 일치하는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한 이 상적이거나 과도하게 형식적인 의미를 지니는 것으로 해석될 수 없다. NCDE에 대해 설명하기 전에, 먼저 신경 상미분 방정식(Neural Ordinary Differential Equation; 이하, NODE)에 대해 설명한다. NODE는 미분방정식을 사용하여 잔차 신경망(ResNet)을 연속적으로 모델링하는 방법을 도입했다. NODE는 다음의 수학식 1와 같이 표현될 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기에서, 로 매개변수화된 신경망은 에 근사하고 오일러 양해법(explicit Euler method), 4차 Runge- Kutta(RK4), Dormand-Prince(DOPRI) 방법에 이르기까지 다양한 ODE 솔버에 의존하여 적분 문제를 해결한다. 특히, 상기 수학식 2는 오일러 양해법으로 풀면 잔차 연결로 줄어든다. 이와 관련하여 NOED는 연속적인 방식으 로 ResNet을 일반화한다. 다음으로, NCDE에 대해 설명한다. NODE가 ResNet을 일반화하는 반면, NCDE는 하기 수학식 2에서 연속적인 방식으로 RNN을 일반화한다. [수학식 2]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "제어 미분 방정식(CDE)은 상미분 방정식(ODE) 보다 고급 개념이다. 상기 수학식 1에서 적분 문제는 Rienmann 적분 문제인 반면 상기 수학식 1은 Riemann-Stieltjes 적분 문제이다. 상기 수학식 2에서 는 로 근사된다. 가 가까운 수학 형식으로 어떻게든 성공적으로 공식화되면 기존 ODE 솔버를 사용하여 풀 수 있다. 따라서 NODE를 해결하기 위해 개발된 많은 기술을 NCDE에도 적용할 수 있다. 시계열 그래프 의 시공간 처리는 공간처리만(즉, GCN) 또는 시간처리만(즉, RNN) 보다 분 명히 더 어렵다. 이와 같이 GCN과 RNN을 결합한 많은 신경망이 제안되어 왔다. 본 발명에서는 NCDE와 적응형 토폴로지 생성 기술을 기반으로 하는 새로운 시공간 모델을 설계한다. 이하, 도 1 내지 4를 통해 본 발명에 따른 시공간 데이터 처리 장치 및 방법에 대해 보다 자세히 설명한다. 도 1은 본 발명에 따른 시공간 데이터 처리 시스템을 설명하는 도면이다. 도 1을 참조하면, 시공간 데이터 처리 시스템은 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시 공간 데이터 처리 방법을 실행하도록 구현될 수 있다. 이를 위해, 시공간 데이터 처리 시스템은 사용자 단 말, 시공간 데이터 처리 장치 및 데이터베이스를 포함할 수 있다. 사용자 단말은 사용자에 의해 운용되는 단말 장치에 해당할 수 있다. 예를 들어, 사용자는 사용자 단말 을 통해 교통량 예측을 위한 시공간 데이터 생성 및 학습에 관한 동작을 처리할 수 있다. 본 발명의 실시 예에서 사용자는 하나 이상의 사용자로 이해될 수 있으며, 복수의 사용자들은 하나 이상의 사용자 그룹으로 구 분될 수 있다. 또한, 사용자 단말은 시공간 데이터 처리 시스템을 구성하는 하나의 장치로서 시공간 데이터 처리 장 치와 연동하여 동작하는 컴퓨팅 장치에 해당할 수 있다. 예를 들어, 사용자 단말은 시공간 데이터 처 리 장치와 연결되어 동작 가능한 스마트폰, 노트북 또는 컴퓨터로 구현될 수 있으며, 반드시 이에 한정되 지 않고, 태블릿 PC 등 포함하여 다양한 디바이스로도 구현될 수 있다. 또한, 사용자 단말은 시공간 데이 터 처리 장치와 연동하기 위한 전용 프로그램 또는 어플리케이션(또는 앱, app)을 설치하여 실행할 수 있 다. 시공간 데이터 처리 장치는 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방 법을 수행하는 컴퓨터 또는 프로그램에 해당하는 서버로 구현될 수 있다. 또한, 시공간 데이터 처리 장치 는 사용자 단말과 유선 네트워크 또는 블루투스, WiFi, LTE 등과 같은 무선 네트워크로 연결될 수 있고, 네트워크를 통해 사용자 단말과 데이터를 송·수신할 수 있다. 또한, 시공간 데이터 처리 장치는 관 련 동작을 수행하기 위하여 독립된 외부 시스템(도 1에 미도시함)과 연결되어 동작하도록 구현될 수 있다. 데이터베이스는 시공간 데이터 처리 장치의 동작 과정에서 필요한 다양한 정보들을 저장하는 저장장 치에 해당할 수 있다. 예를 들어, 데이터베이스는 시공간 데이터 처리 과정에 사용되는 학습 데이터에 관 한 정보를 저장할 수 있고, 학습을 위한 모델이나 학습 알고리즘에 관한 정보를 저장할 수 있으며, 반드시 이에 한정되지 않고, 시공간 데이터 처리 장치가 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법을 수행하는 과정에서 다양한 형태로 수집 또는 가공된 정보들을 저장할 수 있다. 한편, 도 1에서, 데이터베이스는 시공간 데이터 처리 장치와 독립적인 장치로서 도시되어 있으나, 반 드시 이에 한정되지 않고, 논리적인 저장장치로서 시공간 데이터 처리 장치에 포함되어 구현될 수 있음은 물론이다. 도 2는 본 발명에 따른 시공간 데이터 처리 장치의 시스템 구성을 설명하는 도면이다. 도 2를 참조하면, 시공간 데이터 처리 장치는 프로세서, 메모리, 사용자 입출력부 및 네트 워크 입출력부를 포함할 수 있다. 프로세서는 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 프로시저를 실행할 수 있고, 이러한 과정에서 읽혀지거나 작성되는 메모리를 관리할 수 있으며, 메모리에 있는 휘발성 메모리와 비휘발성 메모리 간의 동기화 시간을 스케줄 할 수 있다. 프로세서는 시공간 데이터 처리 장치 의 동작 전반을 제어할 수 있고, 메모리, 사용자 입출력부 및 네트워크 입출력부와 전기적 으로 연결되어 이들 간의 데이터 흐름을 제어할 수 있다. 프로세서는 시공간 데이터 처리 장치의 CPU(Central Processing Unit)로 구현될 수 있다. 메모리는 SSD(Solid State Disk) 또는 HDD(Hard Disk Drive)와 같은 비휘발성 메모리로 구현되어 시공간 데이터 처리 장치에 필요한 데이터 전반을 저장하는데 사용되는 보조기억장치를 포함할 수 있고, RAM(Random Access Memory)과 같은 휘발성 메모리로 구현된 주기억장치를 포함할 수 있다. 또한, 메모리는 전기적으로 연결된 프로세서에 의해 실행됨으로써 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법을 실행하는 명령들의 집합을 저장할 수 있다. 사용자 입출력부은 사용자 입력을 수신하기 위한 환경 및 사용자에게 특정 정보를 출력하기 위한 환경을 포함하고, 예를 들어, 터치 패드, 터치 스크린, 화상 키보드 또는 포인팅 장치와 같은 어댑터를 포함하는 입력 장치 및 모니터 또는 터치 스크린과 같은 어댑터를 포함하는 출력장치를 포함할 수 있다. 일 실시예에서, 사용 자 입출력부은 원격 접속을 통해 접속되는 컴퓨팅 장치에 해당할 수 있고, 그러한 경우, 시공간 데이터 처 리 장치는 독립적인 서버로서 수행될 수 있다.네트워크 입출력부은 네트워크를 통해 사용자 단말과 연결되기 위한 통신 환경을 제공하고, 예를 들 어, LAN(Local Area Network), MAN(Metropolitan Area Network), WAN(Wide Area Network) 및 VAN(Value Added Network) 등의 통신을 위한 어댑터를 포함할 수 있다. 또한, 네트워크 입출력부는 데이터의 무선 전송을 위해 WiFi, 블루투스 등의 근거리 통신 기능이나 4G 이상의 무선 통신 기능을 제공하도록 구현될 수 있다. 도 3은 본 발명에 따른 시공간 데이터 처리 장치의 기능적 구성을 설명하는 도면이다. 도 3을 참조하면, 시공간 데이터 처리 장치는 전처리부 및 메인 처리부를 포함할 수 있다. 전처리부는 시계열 데이터에서 각 노드에 대해 연속 경로를 생성할 수 있다. 여기에서, 전처리부는 각 노드에 대해 보간 알고리즘을 수행하여 연속경로를 생성할 수 있다. 전처리부는 보간 알고리즘으로 자 연 3차 스플라인을 사용할 수 있다. 메인 처리부는 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을 결합하여 시간 정보 및 공간 정보를 통합 처리할 수 있다. 여기에서, 메인 처리부 는 두개의 CDE(Controlled Differential Equation) 함수로 각 노드에 대해 시간처리 및 공간처리를 수행 하여 마지막 은닉 벡터를 계산하고 출력 레이어를 예측할 수 있다. 메인 처리부는 시공간 그래픽 신경 제어 미분 방정식(Spatio-Temporal Graph Neural Controlled Differential Equation; STG-NCDE)를 포함하여 구현될 수 있다. 이를 위한 구성으로서, 메인 처리부는 2 개의 NCDE 모듈(331,333)를 포함할 수 있다. 2개의 NCDE 모듈(331,333) 중 제1 NCDE 모듈은 시간정보를 처리할 수 있고, 제2 NCDE 모듈은 공간정보를 처리할 수 있다. 여기에서, 제1 및 제2 NCDE 모듈(331,33 3)은 통합 구현되어 시간 및 공간 처리를 통합할 수 있다. 제1 NCDE 모듈은 각 노드의 연속 경로를 시간처리(Temporal Processing)하여 시간정보의 은닉 궤적을 생성 할 수 있다. 여기에서, 제1 NCDE 모듈은 모든 노드에 대해 은닉 궤적을 스태킹(staking)하여 행렬을 생성 하고 CDE 함수로 행렬의 각 행을 개별적으로 처리하여 연속 RNN으로 변환할 수 있다. 제2 NCDE 모듈은 각 노드의 연속 경로를 공간 처리(Spatial Processing)하여 공간정보의 은닉 궤적을 생성할 수 있다. 메인 처리부는 시간 처리 및 공간 처리의 초기값을 생성하고 초기값 생성 계층의 매개변수, 노드 임베딩 행렬을 포함한 CDE 함수 및 출력 레이어를 훈련하는 초기값 생성모듈을 더 포함할 수 있다. 도 5a 및 5b를 참조하면, 시계열 처리를 위한 도 5a의 기존 NCDE 워크플로우를 보면, 경로 X는 보간 알고리즘에 의해 생성되므로 이는 불규칙한 시계열 데이터에 강건한다. 본 발명에서 제안한 STG-NCDE 워크플로우는 도 5b 에 도시한 바와 같이, 하나의 전처리와 하나의 주요 처리 단계를 포함할 수 있다. 전처리 단계는 에서, 인 각 노드 에 대해 연속 경로 를 생성한다. 여기서, 는 의 번째 행(row)을 의미하고, 는 의 입력 특징의 시계열을 나타낸다. 본 발명은 이 산 시계열 을 보간하고 연속경로를 구축하기 위해 자연 3차 스플라인 방법을 사용할 수 있다. 자연 3차 스플라인은 i) 연속 경로를 생성하고, ii) 생성 경로가 두 번 미분 가능하다는 본 발명 방법에 사용하기 적당한 특성을 갖는다. 특히 제안된 모델의 기울기를 계산할 때 두 번째 특성이 중요하다. 전처리 단계는 모델을 학습시키기 전에 발생한다. 그래프로 표현되는 데이터에 컨볼루션 연산을 수행하는 GCN 과 NCDE 기술을 결합하는 본 발명의 메인 단계는 로 표시된 각 노드 에 대한 마지막 은닉 벡터를 계산 한다. 그후, 각 노드 에 대해 을 예측하는 출력 레이어를 가진다. 에서 모든 모드에 대해 이러한 예측을 수집한 후 예측 행렬 을 가진다. 본 발명에서 제안한 STG-NCDE는 두 개의 NCDE로 구성된다. 하나는 시간 정보를 처리하고 다른 하나는 공간 정 보를 처리한다.시간 처리(Temporal Processing)를 위한 제1 NCDE는 다음 수학식 3과 같이 작성할 수 있다. [수학식 3]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, 는 노드 의 시간 정보의 은닉 궤적(시간 )이다. 모든 에 대해 를 스태킹 (staking) 후 행렬 를 정의할 수 있다. 따라서 시간 에 대한 에 의해 생성된 궤적에 는 시간 처리 결과의 은닉 정보가 포함된다. 상기 수학식 3은 행렬 표기법을 사용하여 다음 수학식 4와 같이 동등하게 재작성할 수 있다. [수학식 4]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "여기서 는 -번째 행이 인 행렬이다. CDE 함수 는 의 각 행을 개별적으로 처리한다. 이 설계의 핵심은 로 매개변수화된 CDE 함수 를 정의하는 방법이다. 가 RNN일 필요가 없고, 대신 완전-연결된 레이어 로만 설계함으로써 상기 수학식 4를 연속 RNN으로 변환한다. 그후, 제2 NCDE는 다음의 수학식 5와 같이 공간 처리(Spatial Processing)을 시작한다. [수학식 5]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "여기서, 은닉 궤적 는 시간 처리에 의해 생성된 에 의해 제어된다. 상기 수학식 4 및 5를 결합한 후, 시간 및 공간 처리를 모두 통합하는 다음의 수학식 6와 같은 단일 방정식을 갖는다. [수학식 6]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "여기서, 는 모든 에 대한 은닉 궤적 를 스태킹 후 생성된 행렬이다. 이 NCDE에서 은 닉 궤적 은 쓰기 쉽도록 이웃의 궤적을 고려하여 생성되며 상기 수학식 5 및 6의 행렬 표기법을 사용한다. 핵심 부분은 공간 처리를 위해 로 매개변수화된 CDE 함수 를 설계하는 방법이다. 이제 두개의 CDE 함수 와 를 설명한다. 의 정의: 는 다음 수학식 7과 같다. [수학식 7]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "여기서, 는 정류된 선형 단위, 는 쌍곡선 탄젠트, 는 입력 크기가 이고 출 력 크기도 인 완전 연결 계층을 의미한다. 는 완전 연결 계층의 매개변수를 나타낸다. 이 함수 는 개의 완전 연결 계층으로 의 각 행을 독립적으로 처리한다. 공간 처리를 위해 하나 이상의 CDE 함수 를 정의해야 한다. 의 정의: 는 다음의 수학식 8과 같다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "여기서, 는 단위 행렬, 는 소프트맥스 활성화, 는 훈련가능한 노드-임베딩 행렬, 는 전치이고 은 훈련가능한 가중치 변환 행렬이다. 개념적으로, 는 정규화된 인접 행렬 에 해당하며, 여기서 및 소프트맥스 활성화는 적응 인접 행렬을 정규화하는 역할을 한 다(Wu et al. 2019; Bai et al. 2020). 본 발명은 또한, 상기 수학식 8에서 입력 행렬 와 의 행을 혼합 하지 않고 정규화된 적응 인접 행렬을 사용한 그래프 컨볼루션 연산의 1차 체비쇼프 다항식 확장(Kipf and Welling 2017)과 동일하다. 시간 처리의 초기 값, 즉 은 다음과 같이 에서 생성된다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "또한, 을 생성하기 위해 다음과 같은 유사한 전략도 사용한다."}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "두 NCDE에 대해 이러한 초기 값을 생성한 후, 상기 수학식 6의 Riemann-Stieltjes 적분 문제를 해결한 후"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "를 계산할 수 있다. 상기 수학식 4 및 5를 별도로 구현하지 않고, 상기 수학식 6을 구현하려면 다음의 수학식 9와 같은 증강 ODE를 정의한다. [수학식 9] 여기서, 초기값 및 은 앞서 언급한 방식으로 생성될 수 있다. 그런 다음, 초기값 생성 레이어의 매 개변수, 노드 임베딩 행렬 를 포함한 CDE 함수 및 출력 레이어를 훈련할 수 있다. , 즉 의 번 째 행에서 출력 레이어 를 다음의 수학식 10과 같이 생성한다. [수학식 10]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "여기서, 및 은 훈련가능한 가중치 및 출력 레이어의 바이어스이 다. 다음의 수학식 11과 같이 정의되는 훈련 목표로 손실을 사용한다. [수학식 11]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "여기서 는 훈련 세트, 는 훈련 샘플, 는 에 있는 노드 의 실측값이다. 또한 매개변수의 표준 정규 화, 즉 가중치 감쇠를 사용한다. 도 4는 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법을 설명하는 순서도이다. 도 4를 참조하면, 시공간 데이터 처리 장치는 전처리부를 통해 시계열 데이터의 각 노드에 대해 연속 경로를 생성할 수 있다(단계 S410). 이후, 시공간 데이터 처리 장치는 메인 처리부에서 두개의 NCDE (Neural Controlled Differential Equation) 모듈(331,333)을 통해 생성 경로에 대해 GCN(Graph Convolution Networks)과 NCDE(Neural Controlled Differential Equation)을 결합하여 시간 정보 및 공간 정보를 통합 처리 할 수 있다(단계 S430). 여기에서, 시공간 데이터 처리 장치는 두개의 CDE(Controlled Differential Equation) 함수로 각 노드에 대해 시간처리 및 공간처리를 수행하여 마지막 은닉 벡터를 계산하고 출력 레이어 를 예측할 수 있다. 이하, 도 6 내지 10을 참조하여 본 발명에 따른 시공간 데이터 처리 장치 및 방법에 관한 실험 내용을 설명한다. 구체적으로, 도 6은 PeMSD3, PeMSD4, PeMSD7 및 PeMSD8의 예측 오류를 나타내는 표이고, 도 7은 PeMSD7(M) 및 PeMSD7(L)의 예측 오류를 나타내는 표이다. 또한, 도 8은 교통량 예측 결과로, 그림 (a)는 PeMSD4에서 노드 111 실험 결과들이고, 그림 (b)는 PeMSD4에서 노드 261 실험 결과들이고, 그림 (c)는 PeMSD8 에서 노드 9 실험 결과들이고, 그림 (d)는 PeMSD8에서 노드 112 실험 결과들이다. 또한, 도 9는 훈련 곡선 및 민감도 분석 결과로, 그림 (a)는 PeMSD7에서 훈련 곡선이고, 그림 (b)는 PeMSD7에서 C에 대한 민감도 결과들이 다. 또한, 도 10은 각 수평선의 예측 오류 결과로, 그림 (a)는 PeMSD7에서 MAE 결과들이고, 그림 (b)는 PeMSD7 에서 MAPE 결과들이며, 그림 (c)는 PeMSD8에서 MAE 결과들이고, 그림 (d)는 PeMSD8에서 MAPE 결과들이다. 먼저 여기에서는 시계열 예측 실험을 수행한다. 모든 실험은 다음 소프트웨어 및 하드웨어 환경에서 수행될 수 있다. 즉, Ubuntu 18.04 LTS, Python 3.9.5, Numpy 1.20.3, Scipy 1.7, Matplotlib 3.3.1, torchdiffeq 0.2.2, PyTorch 1.9.0, CUDA 11.4 및 NVIDIA Driver 470.42, i9 CPU, 및 NVIDIA RTX A6000. 교통량 예측 분야 에서 가장 큰 규모의 실험 중 하나인 6개의 데이터셋(dataset)와 20개 베이스라인 모델(baseline model)을 사용 한다. 데이터셋(Datasets) 실험에서, PeMS에서 수집한 PeMSD7(M), PeMSD7(L), PeMS03, PeMS04, PeMS07 및 PeMS08과 같은 6개의 실제 교통 량 데이터셋을 사용한다. 여기서 사용된 데이터셋에 대한 세부 내용은 하기 표 1과 같다.[표 1]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "상기 표 1에는 i) 차량 수 또는 ii) 속도와 같은 다양한 유형의 값이 포함되어 있다. 실험 셋팅(Experimental Settings) 데이터셋은 이미 6:2:2 비율로 훈련, 검증 및 테스트 셋으로 분할되어 있다. 이 데이터셋에서, 두개의 연속적 인 시점 사이의 간격은 5분이다. 과거 12개의 그래프 스냅샷을 읽은 후 및 의 예측 설정을 사용 한다. 그래프 스냅샷 인덱스 는 0에서 시작한다. 여기에서, 표준 벤치마크 셋인 12-sequence-to-12-sequence 예측을 수행한다. 평균 절대 오차(MAE), 평균 절대 백분율 오차(MAPE) 및 평균 제곱근 오차(RMSE)를 사용하여 다양한 모델의 성능을 측정한다. 베이스라인(Baselines): 본 발명에 따른 방법(STG-NCDE)을 이전 모델과 함께 베이스라인 모델과 비교한다. 20 개의 베이스라인 모델을 사용한다. HA (Hamilton 2020)는 마지막 12개 타임 슬라이스의 평균값을 사용하여 다음 값을 예측한다. ARIMA는 시계열 분석의 통계 모델이다. VAR (Hamilton 2020)은 모든 트래픽 시리즈 간의 공간적 상관관계를 포착하는 시계열 모델이다. TCN (Bai, Kolter, and Koltun 2018)은 기하급수적으로 확장된 팽창 계수를 가진 인과관계 컨볼루션 레이 어 스택으로 구성된다. FC-LSTM (Sutskever, Vinyals, and Le 2014)은 완전히 연결된 은닉 장치가 있는 LSTM이다. GRU-ED (Cho et al. 2014)은 GRU 기반 베이스라인이며 다단계 시계열 예측을 위해 인코더-디코더 프레임워 크를 활용한다. DSANet (Huang et al. 2019)은 CNN 네트워크와 공간 상관을 위한 자기 주의 메커니즘을 사용하는 상관 시계 열 예측 모델이다. 초매개변수(Hyperparameters): 본 발명 방법에 대해 다음 하이퍼파라미터를 테스트한다. 모든 데이터셋에서 배 치 크기 64인 Adam 옵티마이저를 사용하여 200 에포크를 훈련한다. 및 의 2차원은 {32, 64, 128, 256}이고, 노드 임베팅 크기 C는 1에서 10이며, 수학식 8에서 K의 수는 {1, 2, 3}에 있다. 모든 방 법의 학습률은 이고, 가중치 감쇠 계수는 이다. 검증 데이터셋에 대해 15회 반복의 인내심을 갖는 조기 중지 전략이 사 용된다. 최고의 하이퍼파라미터는 재현성을 위해 (Choi et al. 2021)에 있다. 베이스라인의 경우, 데이터셋에 대한 정확도가 알려지지 않은 경우 권장 구성을 기반으로 하이퍼파라미터 검색 프로세스로 코드를 실행하고, 알 려진 경우에는 공식적으로 보고된 정확도를 사용한다. 실험 결과(Experimental Resuls) 도 6 및 도 7은 자세한 예측 성능을 나타낸다. 본 발명에 따른 방법인 STG-NCDE는 하기 표 2에 나타낸 바와 같 이, 최고의 평균 정확도를 보여준다.[표 2]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "상기 표 2는 각 모델에 대해 6개의 데이터셋에서 평균 MAE/RMSE/MAPE를 나열하고, 괄호 안에는 본 발명의 방법 (STG-NCDE)과 비교하여 상대적 정확도를 보여준다. 예를 들어, STGCN은 본 발명의 방법보다 17.0% 더 나쁜 MAE 를 보여준다. 기존의 모든 방법은 본 발명의 방법보다 모든 메트릭에서 더 나쁜 오류를 보여준다. 각 데이터셋의 실험 결과를 설명하면, STG-NCDE는 모든 경우에서 최고의 정확도를 보여주고 Z-GCNET, AGCRN, STGODE 등이 그 뒤를 이었다. STG-NCDE 만큼 안정적인 기존 방법은 없었다. STGODE는 많은 경우에 상당히 낮 은 오류를 보여준다. 예를 들어, STGODE의 PeMSD3에서 27.84의 RMSE가 STG-NCDE의 27.09에 비해 두번째로 좋 은 결과이지만, PeMSD7용 AGCRN 및 Z0GCNET 보다 성능이 우수하다. 본 발명의 방법인 STG-NCDE만이 모든 경우 에 신뢰할 수 있는 예측을 보여준다. 도 8에서 또한, 본 발명의 방법과 Z-GCNET에 의해 ground-truth와 예측된 곡선을 시각화한다. 도 8의 (a) 및 (b)에 시각화된 노드 111 및 261은 PeMSD4에서 가장 교통량이 많은 두 곳이고, 도 8의 (c) 및 (d)에 시각화된 노드 9 및 112는 PeMSD8에서 가장 교통량이 많은 두 곳이다. Z-GCNET는 합리적인 성능을 보여주기 때문에 예측 곡선은 많은 시점에서 본 발명의 방법과 유사하지만, 상자(boxes)로 강조 표시된 것처럼 본 발명의 방법은 어려 운 경우에 대해 훨씬 더 정확한 예측을 보여준다. 특히, 본 발명의 방법은 PeMSD4의 노드 111 및 PeMSD8의 노 드 9에 대해 강조 표시된 시점에 대해 Z-GCNET을 크게 능가한다. Z-GCNET는 무의미한 예측 즉, 예측 곡선이 직 선이다. 절제, 민감도 및 추가 연구(Ablation, Sensitivity, and Additional Studies) 절제 연구(Ablation Study): 절제 연구 모델로 두가지 모델을 정의한다. i) 첫번째 절제 모델은 앞서 정의한 수학식 4와 같은 시간 처리 부분만 있고, ii) 두번째 절제 모델은 하기 수학식 12로 정의되는 공간 처리 부분만 있다. [수학식 12]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "여기서 시간 경과에 따른 궤적 는 에 의해 제어된다. 따라서 이 절제 연구 모델에 대한 모델 아키텍처 를 변경하여 첫번째 모델은 “Only Temporal”로, 두번째 모델은 “Only Spatial”로 표기된다. 모든 경우에, 공간 처리만 있는 절제 연구 모델은 시간 처리만 있는 것보다 훨씬 더 성능이 좋다. 그러나 시간 및 공간 처리를 모두 활용하는 STG-NCDE는 이를 능가한다. 이것은 최상의 모델 정확도를 달성하기 위해 둘다 필요하다는 것을 보여준다. 도면 9의 (a)에서 PeMSD7의 훈련 곡선을 비교한다. STG-NCDE의 손실 곡선은 두번째 에포크 이후에 안정화되지 만 다른 두 절제 모델은 손실 곡선이 안정화될 때까지 더 긴 시간이 필요하다. C에 대한 민감도(Sensitivity to C): 도면 9의 (b)는 노드 임베딩 크기 C를 변경하여 MAE 및 MAPE를 보여준다. 두개의 오류 메트릭은 C=7 이후에 안정화되고, C=10이면 최고의 정확도를 얻을 수 있다. 각 범위에 대한 오류(Error for Each Horizon): 여기에서 S는 예측 길이 즉, 예측 범위의 수를 나타낸다. 벤치 마크 데이터셋은 S=12로 셋팅되어 있고, 도 10에서 각 예측 범위에 대한 모델 오차를 보여준다. 오차 수준이 S와 높은 상관관계를 보이는 것은 분명하다. 모든 지평에 대해 STG-NCDE는 다른 베이스라인 보다 작은 오차를 보여준다. 불규칙 교통량 예측(Irregular Traffic Forecasting): 실제로 교통 센서가 손상될 수 있으며 일부 지역에서는 일정 시간 동안 데이터를 수집할 수 없다. 이러한 상황을 반영하기 위해 각 노드에 대한 센싱 값의 10~50%를 독립적으로 무작위로 떨어뜨린다. NCDE는 설계에 따라 불규칙한 시계열을 고려할 수 있기 때문에 STG-NCDE는 기존 베이스라인과 가장 구별되는 점 중 하나인 모델 설계의 변경 없이도 수행할 수 있다. 그 결과는 하기 표 3 및 표 4와 같다. [표 3]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 18, "content": "[표 4]"}
{"patent_id": "10-2022-0151819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 19, "content": "도 6의 결과와 비교하여 본 발명의 모델 성능은 크게 떨어지지 않았다. 도 6에 나열된 다른 베이스라인은 불규 칙한 예측을 수행할 수 없으며 STG-NCDE를 상기 표 3 및 4의 절제 모델과 비교한다. 본 발명에 따른 공진화 신경 상미분 방정식 기반의 인공지능 신경망 장치는 교통량 예측을 위해 시간 처리 NCDE 및 공간 처리 NCDE 모델을 구현할 수 있다. 특히, 공간 처리를 위한 NCDE는 그래프 컨볼루션 네트워크의 NCED 기반 해석으로 간주될 수 있다. 6개 데이터셋과 20개 베이스라인을 사용한 실험에서 본 발명의 방법은 최고의 전체 정확도를 명확하게 보여주며 일부 입력 관찰이 누락될 수 있는 불규칙한 교통량 예측을 수행할 수 있다. 상기에서는 본 발명의 바람직한 실시예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특 허 청구의 범위에 기재된 본 발명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다."}
{"patent_id": "10-2022-0151819", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 시공간 데이터 처리 시스템을 설명하는 도면이다. 도 2는 본 발명에 따른 시공간 데이터 처리 장치의 시스템 구성을 설명하는 도면이다. 도 3은 본 발명에 따른 시공간 데이터 처리 장치의 기능적 구성을 설명하는 도면이다. 도 4는 본 발명에 따른 그래프 신경 제어 미분 방정식 기반의 시공간 데이터 처리 방법을 설명하는 순서도이다. 도 5a 및 5b는 기존 및 본 발명에 따른 NCDE의 워크플로를 설명하는 도면이다. 도 6 내지 도 10은 본 발명에 관한 실험 결과를 설명하는 도면이다."}
