{"patent_id": "10-2022-0103564", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0123187", "출원번호": "10-2022-0103564", "발명의 명칭": "다중 시스템 기반 지능형 질의 응답 방법, 장치와 기기", "출원인": "베이징 바이두 넷컴 사이언스 테크놀로지 컴퍼니", "발명자": "펑, 신웨이"}}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 상기 질의 정보의 질의 유형을 확정하는단계;상기 질의 유형에 대응되는 검색 엔진을 확정하고, 상기 검색 엔진을 기초로 상기 검색 엔진에 대응되는 복수의질의 분석 시스템을 호출하는 단계;질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 상기 복수의 질의 분석 시스템을 사용하여 상기질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에 대응되는 답안 정보를확정해 내면, 사용자에게 상기 답안 정보를 피드백하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 복수의 질의 분석 시스템은, 지식 그래프 시스템, 추리 질의 응답 시스템, 문서 질의 응답 시스템, 일반 질의 해답(FAQ) 질의 응답 시스템을 포함하고;여기서, 상기 지식 그래프 시스템은 질의 정보 중의 엔티티에 대응되는 답안 정보를 지시하기 위한 것이고;상기 추리 질의 응답 시스템은 질의 정보에 대응되는 추리 템플릿을 지시하기 위한 것이고, 여기서, 상기 추리템플릿은 답안 정보를 확정하기 위한 것이고; 상기 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 상기 필링 포인트는 단어 특성을 구비하고;상기 문서 질의 응답 시스템은 상기 질의 정보에 대응되는 단락을 지시하기 위한 것이고, 여기서, 상기 단락은답안 정보를 확정하기 위한 것이고;상기 FAQ 질의 응답 시스템은 상기 질의 정보와 관련되는 기타 질의를 지시하기 위한 것이고, 상기 기타 질의와상기 질의 정보는 답안 정보를 확정하기 위한 것인 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 현재 질의 분석 시스템이 문서 질의 응답 시스템이면, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에 대응되는 답안 정보를 확정해 내는 단계는,상기 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,상기 질의 정보에 대응되는 최적 단락을 획득하되; 여기서, 상기 제1 데이터베이스는 복수의 문서를 포함하고,상기 문서는 복수의 단락을 포함하는 단계;제1 통과 지식을 기초로 통합된 증강 표현(ERNIE) 모델을 기초로, 상기 최적 단락에 대해 글자수 간소화 처리를수행하여, 상기 질의 정보에 대응되는 답안 정보를 획득하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,상기 질의 정보에 대응되는 최적 단락을 획득하는 단계는,상기 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,상기 질의 정보와 유사한 복수의 후보 단락을 획득하고; 상기 질의 정보에 대응되는 핵심 요소 정보를 획득하는단계;공개특허 10-2022-0123187-3-상기 핵심 요소 정보와 상기 후보 단락에 대해 유사도 계산을 수행하여, 유사도가 가장 높은 후보 단락을 상기질의 정보에 대응되는 최적 단락으로 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 핵심 요소 정보는 사용자 위치 정보, 사용자 속성 정보, 사용자가 사용한 단말기의 정보 중 적어도 하나를포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 현재 질의 분석 시스템이 FAQ 질의 응답 시스템이면, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에대응되는 답안 정보를 확정해 내는 단계는,상기 FAQ 질의 응답 시스템 중의 제2 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,상기 질의 정보와 유사한 복수의 질의 텍스트를 획득하되; 여기서, 상기 제2 데이터베이스는 복수의 질의 텍스트를 포함하는 단계;상기 질의 정보, 및 상기 질의 정보와 유사한 복수의 질의 텍스트를 기초로, 상기 질의 정보에 대응되는 답안정보를 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 질의 정보, 및 상기 질의 정보와 유사한 복수의 질의 텍스트를 기초로, 상기 질의 정보에 대응되는 답안정보를 확정하는 단계는,상기 질의 정보, 및 상기 질의 정보와 유사한 복수의 질의 텍스트를 질의 집합 중의 후보 질의로 확정하되; 여기서, 상기 후보 질의는 특징 정보를 구비하는 단계;질의 집합 중의 후보 질의의 특징 정보를 기설정 뉴럴 네트워크 모델에 입력하여, 최적의 후보 질의를 획득하는단계;기설정된 후보 질의와 답안 정보 사이의 대응 관계를 기초로, 상기 최적의 후보 질의에 대응되는 답안 정보를상기 질의 정보에 대응되는 답안 정보로 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,원본 문서를 획득하고, 상기 원본 문서에 대해 분할 처리를 수행하여, 복수의 단문을 획득하고; 제2 ERNIE 모델을 기초로 상기 단문에 대해 오클루전 처리를 수행하여, 상기 제2 데이터베이스 중의 질의 텍스트를 생성하는단계;또는, 원본 문서를 획득하고, 상기 원본 문서 중의 타이틀을 확정하고; 상기 타이틀을 상기 제2 데이터베이스중의 질의 텍스트로 확정하는 단계;또는, 원본 문서를 획득하고, 상기 원본 문서에 대해 내용 구조 분석 처리를 수행하여, 질문 특성을 구비한 짧은 스니펫을 획득하고; 상기 짧은 스니펫과 상기 짧은 스니펫의 상기 원본 문서에서의 원본 단락을 기설정 모델에 입력하여, 상기 제2 데이터베이스 중의 질의 텍스트를 획득하되; 여기서, 상기 짧은 스니펫은 획득된 질의텍스트에 대응되는 답안 정보인 단계를 더 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서, 상기 현재 질의 분석 시스템이 지식 그래프 시스템이면, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에대응되는 답안 정보를 확정해 내는 단계는,공개특허 10-2022-0123187-4-상기 질의 정보 중의 엔티티를 추출하는 단계;상기 지식 그래프 시스템 중의 기설정 지식 그래프 및 제3 ERNIE 모델을 기초로, 상기 질의 정보 중의 엔티티에대해 식별하여, 상기 질의 정보에 대응되는 답안 정보를 획득하되; 여기서, 상기 기설정 지식 그래프는 복수의엔티티를 포함하고, 상기 기설정 지식 그래프 중의 엔티티 사이에는 연결 관계를 구비하고, 상기 제3 ERNIE 모델은 상기 질의 정보 중의 엔티티를 처리하기 위한 것인 단계를 포함하는 다중 시스템 기반 지능형 질의 응답방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 지식 그래프 시스템 중의 기설정 지식 그래프 및 제3 ERNIE 모델을 기초로, 상기 질의 정보 중의 엔티티에대해 식별하여, 상기 질의 정보에 대응되는 답안 정보를 획득하는 단계는,상기 제3 ERNIE 모델을 기초로 상기 질의 정보 중의 엔티티에 대해 오클루전 처리를 수행하여, 복수의 관련 엔티티를 획득하는 단계;상기 질의 정보 중의 엔티티, 및 획득된 관련 엔티티를 상기 기설정 지식 그래프에 입력하여, 복수의 초기 답안을 획득하는 단계;상기 제3 ERNIE 모델을 기초로 상기 복수의 초기 답안에 대해 채점 처리를 수행하여, 상기 질의 정보에 대응되는 답안 정보를 획득하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제2항에 있어서, 상기 현재 질의 분석 시스템이 지식 그래프 시스템이면, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에대응되는 답안 정보를 확정해 내는 단계는,상기 질의 정보 중의 키워드를 추출하되, 여기서, 상기 키워드는 단어 특성을 구비하는 단계;상기 지식 그래프 시스템 중의 기설정 규칙 템플릿 라이브러리, 및 상기 질의 정보 중의 키워드의 단어 특성을기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여, 상기 질의 정보에 대응되는 규칙 템플릿을 확정하되; 여기서, 상기 규칙 템플릿 라이브러리는 복수의 규칙 템플릿을 포함하고, 상기 규칙 템플릿은 순서 관계가 없는복수의 슬롯 위치를 포함하고, 상기 슬롯 위치는 단어 특성을 표시하고, 상기 규칙 템플릿 중의 각 슬롯 위치의단어 특성은 상이한 단계;상기 질의 정보에 대응되는 규칙 템플릿을 기초로, 상기 질의 정보에 대해 답안 매칭을 수행하여, 상기 질의 정보에 대응되는 답안 정보를 획득하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 규칙 템플릿은 기설정된 세부 규칙 라이브러리를 구비하고, 여기서, 상기 세부 규칙 라이브러리는 상기 규칙 템플릿에 대응되는 복수의 세부 규칙 테이블을 포함하고, 상기 세부 규칙 테이블은 복수의 순서 관계를 구비한 복수의 슬롯 위치를 포함하고; 상기 세부 규칙 테이블 중의 각 슬롯 위치의 단어 특성은 상이하거나, 또는,상기 세부 규칙 테이블 중의 부분 슬롯 위치의 단어 특성은 서로 동일하고;상기 지식 그래프 시스템 중의 기설정 규칙 템플릿 라이브러리, 및 상기 질의 정보 중의 키워드의 단어 특성을기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여, 상기 질의 정보에 대응되는 규칙 템플릿을 확정하는 단계는,상기 세부 규칙 라이브러리의 상기 기설정된 세부 규칙 라이브러리, 상기 질의 정보 중의 서로 다른 단어 특성의 키워드의 수량, 및 상기 질의 정보 중의 서로 다른 단어 특성의 키워드의 연결 관계를 기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여, 상기 질의 정보에 대응되는 세부 규칙 테이블을 확정하는 단계;상기 질의 정보 중의 키워드를 상기 질의 정보에 대응되는 세부 규칙 테이블에 입력하여, 질의 설명 정보를 획득하고; 기설정된 질의 설명 정보와 답안 정보 간의 대응 관계를 기초로, 획득된 질의 설명 정보에 대응되는 답공개특허 10-2022-0123187-5-안 정보를 상기 질의 정보에 대응되는 답안 정보로 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제2항에 있어서, 상기 현재 질의 분석 시스템이 추리 질의 응답 시스템이면, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에 대응되는 답안 정보를 확정해 내는 단계는,상기 질의 정보의 키워드를 추출하되, 여기서, 상기 키워드는 단어 특성을 구비하는 단계;상기 추리 질의 응답 시스템 중의 기설정된 추리 규칙 템플릿 라이브러리, 상기 질의 정보 중의 키워드의 단어특성, 및 상기 질의 정보 중의 키워드 간의 순서 관계를 기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여,상기 질의 정보에 대응되는 추리 템플릿을 확정하되; 여기서, 상기 추리 규칙 템플릿 라이브러리는 복수의 추리템플릿을 포함하고, 상기 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 상기 필링 포인트는 단어 특성을 구비하는 단계;상기 질의 정보에 대응되는 핵심 요소 정보를 획득하고, 상기 질의 정보에 대응되는 핵심 요소 정보, 및 상기질의 정보에 대응되는 추리 템플릿을 기초로, 상기 질의 정보에 대응되는 답안 정보를 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 질의 정보에 대응되는 핵심 요소 정보, 및 상기 질의 정보에 대응되는 추리 템플릿을 기초로, 상기 질의정보에 대응되는 답안 정보를 확정하는 단계는,기설정된 뉴럴 네트워크 모델을 기초로 상기 질의 정보에 대응되는 각 추리 템플릿에 대해 식별하여, 최적 추리템플릿을 확정하는 단계;질의 정보에 대응되는 핵심 요소 정보 및 상기 최적 추리 템플릿을 기초로, 상기 질의 정보에 대응되는 답안 정보를 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 질의 정보에 대응되는 핵심 요소 정보 및 상기 최적 추리 템플릿을 기초로, 상기 질의 정보에 대응되는 답안 정보를 확정하는 단계는,상기 핵심 요소 정보의 단어 특성을 확정하여, 상기 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를 획득하는 단계;상기 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를 상기 최적 추리 템플릿에 가입시켜, 최종 추리 템플릿을 획득하는 단계;상기 질의 정보의 키워드와 상기 질의 정보에 대응되는 핵심 요소 정보를 상기 최종 추리 템플릿의 각 필링 포인트에 필링하여, 추리 문구를 획득하는 단계;기설정 추리 문구와 답안 정보 간의 대응 관계를 기초로, 획득된 추리 문구에 대응되는 답안 정보를 상기 질의정보에 대응되는 답안 정보로 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서, 상기 시스템 우선순위는 기설정된 것이거나; 또는, 상기 시스템 우선순위는 사용자에 의해 확인된 것이거나; 또는, 상기 시스템 우선순위는 질의 분석 시스템에 포함된 데이터의 데이터 량을 표시하는 다중 시스템 기반 지능형 질의 응답 방법.공개특허 10-2022-0123187-6-청구항 17 제1항에 있어서, 상기 질의 정보의 질의 유형을 확정하는 단계는,상기 질의 정보의 키 정보를 추출하되, 여기서, 상기 키 정보는 엔티티 단어 및/또는 어투 단어를 포함하는 단계;기설정된 키 정보와 질의 유형 간의 대응 관계를 기초로, 상기 질의 정보의 질의 유형을 확정하는 단계를 포함하는 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서, 상기 질의 유형에 대응되는 검색 엔진을 확정하는 단계는,기설정된 질의 유형과 검색 엔진의 매핑 관계를 기초로, 상기 질의 유형에 대응되는 검색 엔진을 확정하는 단계를 포함하고;여기서, 상기 질의 유형은, 숫자 유형, 단문 유형, 장문 유형, 일반 수요 유형, 판단 유형 중 하나인 다중 시스템 기반 지능형 질의 응답 방법."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 상기 질의 정보의 질의 유형을 확정하는 제1확정 유닛;상기 질의 유형에 대응되는 검색 엔진을 확정하고, 상기 검색 엔진을 기초로 상기 검색 엔진에 대응되는 복수의질의 분석 시스템을 호출하는 호출 유닛;질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 상기 복수의 질의 분석 시스템을 사용하여 상기질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에 대응되는 답안 정보를확정해 내면, 사용자에게 상기 답안 정보를 피드백하는 제2 확정 유닛를 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 복수의 질의 분석 시스템은 지식 그래프 시스템, 추리 질의 응답 시스템, 문서 질의 응답 시스템, 일반 질의 해답(FAQ)질의 응답 시스템을 포함하고;여기서, 상기 지식 그래프 시스템은 질의 정보 중의 엔티티에 대응되는 답안 정보를 지시하기 위한 것이고;상기 추리 질의 응답 시스템은 질의 정보에 대응되는 추리 템플릿을 지시하기 위한 것이고, 여기서, 상기 추리템플릿은 답안 정보를 확정하기 위한 것이고; 상기 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 상기 필링 포인트는 단어 특성을 구비하고;상기 문서 질의 응답 시스템은 상기 질의 정보에 대응되는 단락을 지시하기 위한 것이고, 여기서, 상기 단락은답안 정보를 확정하기 위한 것이고;상기 FAQ 질의 응답 시스템은 상기 질의 정보와 관련되는 기타 질의를 지시하기 위한 것이고, 상기 기타 질의와상기 질의 정보는 답안 정보를 확정하기 위한 것인 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서, 상기 현재 질의 분석 시스템이 문서 질의 응답 시스템이면, 상기 제2 확정 유닛은,상기 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,공개특허 10-2022-0123187-7-상기 질의 정보에 대응되는 최적 단락을 획득하되; 여기서, 상기 제1 데이터베이스는 복수의 문서를 포함하고,상기 문서는 복수의 단락을 포함하는 매칭 모듈;제1 통과 지식을 기초로 통합된 증강 표현(ERNIE) 모델을 기초로, 상기 최적 단락에 대해 글자수 간소화 처리를수행하여, 상기 질의 정보에 대응되는 답안 정보를 획득하는 처리 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, 상기 매칭 모듈은,상기 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,상기 질의 정보와 유사한 복수의 후보 단락을 획득하고; 상기 질의 정보에 대응되는 핵심 요소 정보를 획득하는제1 확정 서브 모듈;상기 핵심 요소 정보와 상기 후보 단락에 대해 유사도 계산을 수행하여, 유사도가 가장 높은 후보 단락을 상기질의 정보에 대응되는 최적 단락으로 확정하는 제2 확정 서브 모듈을 포함하는 다중 시스템 기반 지능형 질의응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제22항에 있어서, 상기 핵심 요소 정보는 사용자 위치 정보, 사용자 속성 정보, 사용자가 사용한 단말기의 정보 중 적어도 하나를포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제20항에 있어서, 상기 현재 질의 분석 시스템이 FAQ 질의 응답 시스템이면, 상기 제2 확정 유닛은,상기 FAQ 질의 응답 시스템 중의 제2 데이터베이스를 기초로, 상기 질의 정보에 대해 유사성 매칭을 수행하여,상기 질의 정보와 유사한 복수의 질의 텍스트를 획득하되; 여기서, 상기 제2 데이터베이스는 복수의 질의 텍스트를 포함하는 매칭 모듈;상기 질의 정보, 및 상기 질의 정보와 유사한 복수의 질의 텍스트를 기초로, 상기 질의 정보에 대응되는 답안정보를 확정하는 제1 확정 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 제1 확정 모듈은,상기 질의 정보, 및 상기 질의 정보와 유사한 복수의 질의 텍스트를 질의 집합 중의 후보 질의로 확정하되; 여기서, 상기 후보 질의는 특징 정보를 구비하는 제1 확정 서브 모듈;질의 집합 중의 후보 질의의 특징 정보를 기설정 뉴럴 네트워크 모델에 입력하여, 최적의 후보 질의를 획득하는제2 확정 서브 모듈;기설정된 후보 질의와 답안 정보 사이의 대응 관계를 기초로, 상기 최적의 후보 질의에 대응되는 답안 정보를상기 질의 정보에 대응되는 답안 정보로 확정하는 제3 확정 서브 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제24항에 있어서,원본 문서를 획득하고, 상기 원본 문서에 대해 분할 처리를 수행하여, 복수의 단문을 획득하고; 제2 ERNIE 모델을 기초로 상기 단문에 대해 오클루전 처리를 수행하여, 상기 제2 데이터베이스 중의 질의 텍스트를 생성하는공개특허 10-2022-0123187-8-제1 생성 유닛;또는, 원본 문서를 획득하고, 상기 원본 문서 중의 타이틀을 확정하고; 상기 타이틀을 상기 제2 데이터베이스중의 질의 텍스트로 확정하는 제2 생성 유닛;또는, 원본 문서를 획득하고, 상기 원본 문서에 대해 내용 구조 분석 처리를 수행하여, 질문 특성을 구비한 짧은 스니펫을 획득하고; 상기 짧은 스니펫과 상기 짧은 스니펫의 상기 원본 문서에서의 원본 단락을 기설정 모델에 입력하여, 상기 제2 데이터베이스 중의 질의 텍스트를 획득하되; 여기서, 상기 짧은 스니펫은 획득된 질의텍스트에 대응되는 답안 정보인 제3 생성 유닛을 더 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제20항에 있어서, 상기 현재 질의 분석 시스템이 지식 그래프 시스템이면, 상기 제2 확정 유닛은,상기 질의 정보 중의 엔티티를 추출하는 제1 추출 모듈;상기 지식 그래프 시스템 중의 기설정 지식 그래프 및 제3 ERNIE 모델을 기초로, 상기 질의 정보 중의 엔티티에대해 식별하여, 상기 질의 정보에 대응되는 답안 정보를 획득하되; 여기서, 상기 기설정 지식 그래프는 복수의엔티티를 포함하고, 상기 기설정 지식 그래프 중의 엔티티 사이에는 연결 관계를 구비하고, 상기 제3 ERNIE 모델은 상기 질의 정보 중의 엔티티를 처리하기 위한 것인 식별 모듈을 포함하는 다중 시스템 기반 지능형 질의응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제27항에 있어서, 상기 식별 모듈은,상기 제3 ERNIE 모델을 기초로 상기 질의 정보 중의 엔티티에 대해 오클루전 처리를 수행하여, 복수의 관련 엔티티를 획득하는 제1 처리 서브 모듈;상기 질의 정보 중의 엔티티, 및 획득된 관련 엔티티를 상기 기설정 지식 그래프에 입력하여, 복수의 초기 답안을 획득하는 입력 서브 모듈;상기 제3 ERNIE 모델을 기초로 상기 복수의 초기 답안에 대해 채점 처리를 수행하여, 상기 질의 정보에 대응되는 답안 정보를 획득하는 제2 처리 서브 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제20항에 있어서,상기 현재 질의 분석 시스템이 지식 그래프 시스템이면, 상기 제2 확정 유닛은,상기 질의 정보 중의 키워드를 추출하되, 여기서, 상기 키워드는 단어 특성을 구비하는 제2 추출 모듈;상기 지식 그래프 시스템 중의 기설정 규칙 템플릿 라이브러리, 및 상기 질의 정보 중의 키워드의 단어 특성을기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여, 상기 질의 정보에 대응되는 규칙 템플릿을 확정하되; 여기서, 상기 규칙 템플릿 라이브러리는 복수의 규칙 템플릿을 포함하고, 상기 규칙 템플릿은 순서 관계가 없는복수의 슬롯 위치를 포함하고, 상기 슬롯 위치는 단어 특성을 표시하고, 상기 규칙 템플릿 중의 각 슬롯 위치의단어 특성은 상이한 처리 모듈;상기 질의 정보에 대응되는 규칙 템플릿을 기초로, 상기 질의 정보에 대해 답안 매칭을 수행하고, 상기 질의 정보에 대응되는 답안 정보를 획득하는 매칭 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제29항에 있어서, 상기 규칙 템플릿은 기설정된 세부 규칙 라이브러리를 구비하고, 여기서, 상기 세부 규칙 라이브러리는 상기 규칙 템플릿에 대응되는 복수의 세부 규칙 테이블을 포함하고, 상기 세부 규칙 테이블은 복수의 순서 관계를 구비공개특허 10-2022-0123187-9-한 복수의 슬롯 위치를 포함하고; 상기 세부 규칙 테이블 중의 각 슬롯 위치의 단어 특성은 상이하거나, 또는,상기 세부 규칙 테이블 중의 부분 슬롯 위치의 단어 특성은 서로 동일하고;상기 처리 모듈은,상기 세부 규칙 라이브러리의 상기 기설정된 세부 규칙 라이브러리, 상기 질의 정보 중의 서로 다른 단어 특성의 키워드의 수량, 및 상기 질의 정보 중의 서로 다른 단어 특성의 키워드의 연결 관계를 기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여, 상기 질의 정보에 대응되는 세부 규칙 테이블을 확정하는 제1 확정 서브모듈;상기 질의 정보 중의 키워드를 상기 질의 정보에 대응되는 세부 규칙 테이블에 입력하여, 질의 설명 정보를 획득하고; 기설정된 질의 설명 정보와 답안 정보 간의 대응 관계를 기초로, 획득된 질의 설명 정보에 대응되는 답안 정보를 상기 질의 정보에 대응되는 답안 정보로 확정하는 제2 확정 서브 모듈을 포함하는 다중 시스템 기반지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제20항에 있어서, 상기 현재 질의 분석 시스템이 추리 질의 응답 시스템이면, 상기 제2 확정 유닛은,상기 질의 정보의 키워드를 추출하되, 여기서, 상기 키워드는 단어 특성을 구비하는 추출 모듈;상기 추리 질의 응답 시스템 중의 기설정된 추리 규칙 템플릿 라이브러리, 상기 질의 정보 중의 키워드의 단어특성, 및 상기 질의 정보 중의 키워드 간의 순서 관계를 기초로, 상기 질의 정보에 대해 매칭 처리를 수행하여,상기 질의 정보에 대응되는 추리 템플릿을 확정하되; 여기서, 상기 추리 규칙 템플릿 라이브러리는 복수의 추리템플릿을 포함하고, 상기 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 상기 필링 포인트는 단어 특성을 구비하는 처리 모듈;상기 질의 정보에 대응되는 핵심 요소 정보를 획득하고, 상기 질의 정보에 대응되는 핵심 요소 정보, 및 상기질의 정보에 대응되는 추리 템플릿을 기초로, 상기 질의 정보에 대응되는 답안 정보를 확정하는 확정 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제31항에 있어서, 상기 확정 모듈은,기설정된 뉴럴 네트워크 모델을 기초로 상기 질의 정보에 대응되는 각 추리 템플릿에 대해 식별하여, 최적 추리템플릿을 확정하는 제1 확정 서브 모듈;질의 정보에 대응되는 핵심 요소 정보 및 상기 최적 추리 템플릿을 기초로, 상기 질의 정보에 대응되는 답안 정보를 확정하는 제2 확정 서브 모듈을 포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제32항에 있어서, 상기 제2 확정 서브 모듈은,상기 핵심 요소 정보의 단어 특성을 확정하여, 상기 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를 획득하고;상기 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를, 상기 최적 추리 템플릿에 가입시켜, 최종 추리 템플릿을 획득하고;상기 질의 정보의 키워드와 상기 질의 정보에 대응되는 핵심 요소 정보를 상기 최종 추리 템플릿의 각 필링 포인트에 필링하여, 추리 문구를 획득하고;기설정 추리 문구와 답안 정보 간의 대응 관계를 기초로, 획득된 추리 문구에 대응되는 답안 정보를 상기 질의정보에 대응되는 답안 정보로 확정하는 다중 시스템 기반 지능형 질의 응답 장치.공개특허 10-2022-0123187-10-청구항 34 제19항에 있어서, 상기 시스템 우선순위는 기설정된 것이거나; 또는, 상기 시스템 우선순위는 사용자에 의해 확인된 것이거나; 또는, 상기 시스템 우선순위는 질의 분석 시스템에 포함된 데이터의 데이터 량을 표시하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제19항에 있어서, 상기 제1 확정 유닛은,상기 질의 정보의 키 정보를 추출하되, 여기서, 상기 키 정보는 엔티티 단어 및/또는 어투 단어를 포함하는 추출 모듈;기설정된 키 정보와 질의 유형 간의 대응 관계를 기초로, 상기 질의 정보의 질의 유형을 확정하는 확정 모듈을포함하는 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제19항 내지 제35항 중 어느 한 항에 있어서, 상기 호출 유닛은,기설정된 질의 유형과 검색 엔진의 매핑 관계를 기초로, 상기 질의 유형에 대응되는 검색 엔진을 확정하는 확정모듈을 포함하고;여기서, 상기 질의 유형은 숫자 유형, 단문 유형, 장문 유형, 일반 수요 유형, 판단 유형 중 하나인 다중 시스템 기반 지능형 질의 응답 장치."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "적어도 하나의 프로세서; 및상기 적어도 하나의 프로세서와 통신 연결된 메모리를 포함하고, 여기서,상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되고, 상기 명령이 상기 적어도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1항 내지 제18항 중 어느 한 항에 따른방법을 실행할 수 있도록 하는 전자기기."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능 저장매체에 있어서,상기 컴퓨터 명령은 컴퓨터가 제1항 내지 제18항 중 어느 한 항에 따른 방법을 실행하도록 하는 비일시적 컴퓨터 판독 가능 저장매체."}
{"patent_id": "10-2022-0103564", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "컴퓨터 판독 가능 저장매체에 저장된 컴퓨터 프로그램에 있어서, 해당 컴퓨터 프로그램이 프로세서에 의해 실행될 때 제1항 내지 제18항 중 어느 한 항에 따른 방법을 구현하는 컴퓨터 프로그램."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 다중 시스템 기반 지능형 질의 응답 방법, 장치와 기기를 제공하며, 인공지능 분야에 관한 것이며, 특 히 지식 그래프 분야에 관한 것이다. 구체적인 구현 방안은, 사용자의 질의 정보를 지시하기 위한 질의 응답 명 령에 응답하여, 질의 정보의 질의 유형을 확정하고; 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스템을 호출하고; 질의 분석 시스템의 시스템 우선순위에 근거 하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스 템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 한다."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 인공지능 중의 지식 그래프에 관한 것으로, 특히 다중 시스템 기반 지능형 질의 응답 방법, 장치와 기기에 관한 것이다."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지능 기술과 자연어 기술의 발전에 따라, 사용자에게 지능적 질의 응답을 제공할 수 있다. 사용자가 음성 질의 또는 텍스트 질의를 제공한 후, 지능형 시스템은 사용자에게 답안을 제공한다. 종래 기술에서는 일반 질의 해답(frequently-asked questions, FAQ로 약칭) 시스템을 사용하여 사용자가 입력한 질의 정보를 처리한 후 사용자에게 답안을 출력할 수 있다. 그러나 상술한 방식은 질의 및 질의에 대응되는 답안이 FAQ 시스템에 사전에 구성되어 있고; 그 다음 질의에 대 응되는 답안을 직접 검색하는 방식으로 답안을 확정하고, FAQ 시스템에 사전에 구성된 답안이 없을 경우, 사용 자가 입력한 질의 정보에 대응되는 답안을 검색할 수 없기에, 광범위한 답안 요구를 충족시킬 수 없다."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 출원은 다중 시스템 기반 지능형 질의 응답 방법, 장치와 기기를 제공한다."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 제1 측면에 따르면, 다중 시스템 기반 지능형 질의 응답 방법을 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 상기 질의 정보의 질의 유형을 확정하는 단계; 상기 질의 유형에 대응되는 검색 엔진을 확정하고, 상기 검색 엔진을 기초로 상기 검색 엔진에 대응되는 복수의 질의 분석 시스템을 호출하는 단계; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 상기 복수의 질의 분석 시스템을 사용하여 상기 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에 대응되는 답안 정보를 확정해 내면, 사용자에게 상기 답안 정보를 피드백하는 단계를 포함한다. 본 출원의 제2 측면에 따르면, 다중 시스템 기반 지능형 질의 응답 장치를 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 상기 질의 정보의 질의 유형을 확정하는 제1 확정 유닛; 상기 질의 유형에 대응되는 검색 엔진을 확정하고, 상기 검색 엔진을 기초로 상기 검색 엔진에 대응되는 복수의 질의 분석 시스템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 상기 복수의 질의 분석 시스템을 사용하여 상기 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 상기 질의 정보에 대응되는 답안 정보를 확정해 내면, 사용자에게 상기 답안 정보를 피드백하는 제2 확정 유닛을 포함한다. 본 출원의 제3 측면에 따르면, 전자기기를 제공하는 바, 적어도 하나의 프로세서; 및 상기 적어도 하나의 프로세서와 통신 연결된 메모리를 포함하고; 여기서, 상기 메모리에는 상기 적어도 하나의 프로세서에 의해 실행될 수 있는 명령이 저장되고, 상기 명령이 상기 적어 도 하나의 프로세서에 의해 실행되어, 상기 적어도 하나의 프로세서가 제1 측면에 따른 방법을 실행할 수 있도 록 한다. 본 출원의 제4 측면에 따르면, 컴퓨터 명령이 저장된 비일시적 컴퓨터 판독 가능 저장매체를 제공하는 바, 여기 서, 상기 컴퓨터 명령은 컴퓨터가 제1 측면에 따른 방법을 실행하도록 하기 위한 것이다. 본 출원의 제5 측면에 따르면, 컴퓨터 프로그램 제품을 제공하는 바, 상기 컴퓨터 프로그램 제품은 컴퓨터 프로 그램을 포함하고, 상기 컴퓨터 프로그램은 판독 가능 저장매체에 저장되고, 전자기기의 적어도 하나의 프로세서 는 상기 판독 가능 저장매체로부터 상기 컴퓨터 프로그램을 판독할 수 있고, 상기 적어도 하나의 프로세서는 상 기 컴퓨터 프로그램을 실행하여 전자기기가 제1 측면에 따른 방법을 실행하도록 한다. 본 출원의 제6 측면에 따르면, 컴퓨터 판독 가능 저장매체에 저장된 컴퓨터 프로그램을 제공하며, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 때, 제1 측면에 따른 방법을 구현한다."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 출원의 기술은 기존 FAQ 시스템으로 사용자의 광범한 답안 수요를 만족할 수 없는 문제를 해결한다. 본 부분에 기재되는 내용은 본 출원의 실시예의 핵심 또는 중요 특징을 특정하려는 목적이 아니며, 본 출원의 범위를 한정하는 것도 아닌 것으로 이해하여야 한다. 본 출원의 기타 특징은 아래의 명세서로부터 쉽게 이해할 수 있다."}
{"patent_id": "10-2022-0103564", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부 도면과 결합하여 본 출원의 예시적인 실시예에 대해 설명하며, 이해를 돕기 위하여 본 출원의 실시예의 다양한 세부 사항을 포함하며, 이들은 단지 예시적인 것으로만 간주되어야 한다. 따라서, 본 분야의 통상적인 지식을 가진 자라면, 여기에 설명된 실시예에 대하여 다양한 변경과 수정을 가할 수 있으며, 이는 본 출원의 범위와 정신을 벗어나지 않음을 이해해야 한다. 마찬가지로, 명확성과 간결성을 위하여, 아래의 설명에 서 공지 기능과 구조에 대한 설명을 생략한다. 본 출원은 다중 시스템 기반 지능형 질의 응답 방법, 장치와 기기를 제공하며, 인공지능 분야 중의 지식 그래프 분야에 응용되어, 기존 FAQ시스템으로 사용자의 광범한 답안 수요를 만족하지 못하는 문제를 해결하고자 한다. 본 출원에서, 도 1은 본 출원의 제1 실시예의 도면이고, 여기서, 복수의 질의 분석 시스템을 포함하며, 의사 결 정 응용층에서 사용자의 질의 응답 명령을 획득한 후, 의사 결정 응용층에서 해당 사용자의 질의 응 답 명령에 대해 분류하고, 해당 사용자의 질의 응답 명령이 지시하는 질의 정보를 확정한 후, 해당 질의 정보를 기초로 최종의 질의 유형을 확정하며, 여기서, 질의 유형은 검색 엔진층에서 확정되고, 검색 엔진층 에서 질의 유형을 확정한 후, 코어 서비스층에서 질의 분석 시스템의 유형을 확정하고, 질의 분석 시스템 은 베이스 데이터층 중의 다양한 데이터베이스로부터 데이터 정보를 획득하며, 여기서, 베이스 데이터층 중의 데이터 유형은 지식 그래프, SQL/테이블, 규칙 라이브러리, 문서 라이브러리, FAQ 라이브러리 및 고 유 명사 라이브러리를 포함한다. 도 2는 본 출원의 제1 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 방법을 제공하는 바, 아래의 단계를 포함한다. S201, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정한다. 일 예시에서, 사용자의 질의 응답 명령은 사용자가 기업 문서에서 발송한 검색 명령 메시지를 의미하며, 여기서, 검색 명령 메시지는 문자 형식일 수 있고, 음성 형식일 수도 있다. 나아가, 기업 문서는 이미지, 목록, 타이틀, 테이블과 수식 등 내용을 포함할 수 있고, 기업 문서에 포함된 내용의 량은 보다 크며, 포함된 내용의 종류도 보다 많다. 따라서, 사용자의 질의 응답 명령을 기초로 질의 응답 명령이 지시하는 질의 정보의 질의 유 형을 분석해 내고, 그 다음 질의 유형을 기초로 기업 문서에서 사용자의 질의 응답 명령을 검색하여야 한다. 여 기서, 질의 유형은 사용자의 질의 응답 명령의 유형을 구분하기 위한 것이다. 이러한 설정의 장점은 다양한 질 의 유형에 따라, 해당 질의 유형이 필요로 하는 데이터를 검색할 수 있어, 검색 효율을 향상시킨다. S202, 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분 석 시스템을 호출한다. 일 예시에서, 검색 엔진은 기설정된 알고리즘에 근거하여 사용자에게 전면적인 정보 서비스를 제공하는 것을 말 하며, 여기서, 기설정된 알고리즘은 웹크롤러 알고리즘, 검색 정렬 알고리즘, 웹페이지 처리 알고리즘, 빅 데이 터 처리 알고리즘과 자연어 처리 알고리즘을 포함한다. 본 실시예에서, 서로 다른 검색 엔진에 의해 확정된 질 의 분석 시스템 중의 내용은 서로 다르며, 예를 들어, 검색 엔진은 숫자 유형 엔진, 단문 유형 엔진, 장문 유형 엔진, 일반 수요 유형 엔진과 판단 유형 엔진을 포함할 수 있다. 이러한 설정의 장점은 다양한 엔진에 사용된 알고리즘이 상이하여 검색 효율을 향상시킨다. S203, 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 한다. 본 실시예에서, 질의 분석 시스템의 시스템 우선순위 순서를 획득한 후, 현재 질의 분석 시스템의 우선순위가 제1 우선순위이면, 현재 질의 분석 시스템에 따라 질의 정보를 처리하고, 현재 질의 분석 시스템을 기초로 해당 질의 정보에 대응되는 답안 정보를 획득하여, 답안 정보를 사용자에게 피드백하며, 제1 우선순위의 질의 분석 시스템에 의해 획득된 답안 정보가 없으면, 제2 우선순위의 질의 분석 시스템을 통해 질의 정보를 처리하고, 제 2 우선순위의 질의 분석 시스템을 기초로 해당 질의 정보에 대응되는 답안 정보를 획득하여, 답안 정보를 사용 자에게 피드백하며, 제2 우선순위의 질의 분석 시스템에 의해 획득된 답안 정보도 없으면, 제3 우선순위의 질의 분석 시스템을 통해 질의 정보를 처리하며, 답안 정보가 획득될 때까지 진행한다. 나아가, 서로 다른 질의 분석 시스템이 동일한 질의 정보에 대해 처리하는 과정에, 확정된 답안 정보는 서로 다르며, 우선순위가 높은 질의 분석 시스템에 의해 확정된 답안 정보는 우선순위가 낮은 질의 분석 시스템에 의해 확정된 답안 정보보다 정확 하다. 본 출원은 다중 시스템 기반 지능형 질의 응답 방법을 제공하며, 사용자의 질의 정보를 지시하기 위한 질의 응 답 명령에 응답하여, 질의 정보의 질의 유형을 확정하고, 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔 진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스템을 호출하고, 질의 분석 시스템의 시스템 우선순위 에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 한다. 본 기술방안을 사용하여 기존 FAQ 시스템으로 사용자의 광범한 답안 수요에 만족하지 못하는 문제를 해결할 수 있 다. 도 3은 본 출원의 제2 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 방법을 제공하며, 아 래의 단계를 포함한다. S301, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 키 정보를 추출하되, 여기 서, 키 정보는 엔티티 단어 및/또는 어투 단어를 포함한다. 일 예시에서, 질의 정보는 복수의 키 정보를 포함하며, 여기서, 서로 다른 키 정보가 대표하는 의미는 서로 다 르며, 나아가, 키 정보는 엔티티 단어와 어투 단어를 포함하고; 또는 키 정보는 엔티티 단어 또는 어투 단어를포함할 수 있으며, 여기서, 엔티티 단어는 지명, 인명 또는 속성일 수 있고, 어투 단어는 인가(찐), 의(的) 또 는 와 등 접속사일 수 있다. 본 실시예에서, 질의 정보 중의 키 정보를 추출하여, 질의 정보가 대표하는 어의 내용을 분석할 수 있으며, 예 를 들어, 질의 정보가 A의 키는 얼마인가? 일 수 있으며, 이때 해당 질의 정보 중의 키 정보는 엔티티 단어 \"A\", 어투 단어\"의\", 엔티티 단어\"키\", 어투 단어\"인가\"와 어투 단어\"얼마\" 이다. S302, 기설정된 키 정보와 질의 유형 간의 대응 관계를 기초로, 질의 정보의 질의 유형을 확정하되; 여기서, 질 의 유형은 숫자 유형, 단문 유형, 장문 유형, 일반 수요 유형, 판단 유형 중 하나이다. 일 예시에서, 기설정된 키 정보와 질의 유형 사이에는 대응 관계가 존재하며, 예를 들어, 기설정된 키 정보는 \"얼마\"에 대응되는 질의 유형 중의 숫자 유형일 수 있고; 기설정된 키 정보는 \"여부\"에 대응되는 질의 유형 중 의 판단 유형일 수 있는 것 등 이다. 키 정보가 획득된 후에, 기설정된 키 정보와 질의 유형의 대응 관계를 기 초로, 해당 질의 정보가 속하는 질의 유형을 확정한다. S303, 기설정된 질의 유형과 검색 엔진의 매핑 관계를 기초로, 질의 유형에 대응되는 검색 엔진을 확정하고, 검 색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스템을 호출한다. 일 예시에서, 기설정된 질의 유형과 검색 엔진 사이에는 매핑 관계가 존재하고, 서로 다른 질의 유형에 사용되 는 검색 엔진은 다르며, 서로 다른 검색 엔진에 사용된 알고리즘이 다르기에, 확정된 검색 엔진이 다른 후, 질 의 분석 시스템을 호출하는데 사용된 알고리즘도 다르고, 호출된 질의 분석 시스템에 의해 분석된 데이터의 종 류도 서로 다르다. 하지만, 서로 다른 검색 엔진에 의해 호출된 질의 분석 시스템의 우선순위는 동일하다. 나아가, 여기서, 복수의 질의 분석 시스템은, 지식 그래프 시스템, 추리 질의 응답 시스템, 문서 질의 응답 시 스템, 일반 질의 해답(FAQ) 질의 응답 시스템을 포함한다. 여기서, 지식 그래프 시스템은 질의 정보 중의 엔티티에 대응되는 답안 정보를 지시하기 위한 것이다. 추리 질의 응답 시스템은 질의 정보에 대응되는 추리 템플릿을 지시하기 위한 것이고, 여기서, 추리 템플릿은 답안 정보를 확정하기 위한 것이고; 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 필링 포인트는 단어 특성을 구비한다. 문서 질의 응답 시스템은 질의 정보에 대응되는 단락을 지시하기 위한 것이고, 여기서, 단락은 답안 정보를 확 정하기 위한 것이다. FAQ 질의 응답 시스템은 질의 정보와 관련되는 기타 질의를 지시하기 위한 것이고, 기타 질의와 질의 정보는 답 안 정보를 확정하기 위한 것이다. 본 실시예에서, 지식 그래프 시스템은 지식 발전 프로세스와 구조 관계를 표시하는 일련의 각종 상이한 그래프 로 형성된 시스템이고, 가시적인 기술로 지식 자원과 그 매개체를 설명하고, 지식과 그 사이의 상호 연계를 발 굴, 분석, 구축, 제도 및 표시할 수 있다. 지식 그래프 시스템은 지식 그래프의 지식 라이브러리로부터, 질의 정보를 입력하고, 질의 정보에 대해 어의 이해와 해석을 수행하여, 자동으로 지식 그래프 라이브러리에서 검색, 계산, 추리하여 답안을 찾을 수 있다. 추리 질의 응답 시스템은 일정한 추리 규칙을 사용하여 검색 및 계산하여 답안을 획득하는 시스템이며, 여기서, 추리 규칙은 간단한 답안 계산 로직일 수 있다. 문서 질의 응답 시스템은 문서 지식 라이브러리 지향 질의 응답 시스템을 의미하며, 핵심 기술은 머신 독해로서, 여기서, 머신 독해는 머신이 텍스트를 읽은 후, 읽은 내용에 관련되는 질의에 대답하도록 하고, 컴퓨 터로 하여금 텍스트 데이터로부터 지식을 획득하고 질의에 대답하는 능력을 구비하도록 하는 것이다. 일반 질의 해답(frequently-asked questions, 약칭 FAQ) 질의 응답 시스템은 사전에 일부 가능한 일반적인 질의 응답 페어를 제공하고, 상술한 일반적인 질의 응답 페어를 공개하는 것이다. 이러한 설정의 장점은 복수의 질의 분석 시스템을 결합하여 사용함으로써, 각 질의 분석 시스템의 장점을 잘 활용할 수 있는 것이다. 나아가, 여기서, 시스템 우선순위는 기설정된 것이거나; 또는, 시스템 우선순위는 사용자에 의해 확인된 것이거 나; 또는, 시스템 우선순위는 질의 분석 시스템에 포함된 데이터의 데이터 량을 표시한다. 본 실시예에서, 시스템 우선순위는 기설정된 것일 수 있으며, 예를 들어, 시스템 우선순위는 내림 순으로 일반 질의 해답(FAQ) 질의 응답 시스템, 지식 그래프 시스템, 추리 질의 응답 시스템과 문서 질의 응답 시스템일 수있다. 또한 사용자에 의해 확인된 시스템 우선순위일 수도 있으며, 이때 설정된 시스템 우선순위는 사용자의 취 향에 따라 설정될 수 있으며, 예를 들어, 사용자는 지식 그래프 시스템의 우선순위가 문서 질의 응답 시스템보 다 높게 해야 할 때, 우선적으로 지식 그래프 시스템의 우선순위 순서를 설정한다. 이러한 설정의 장점은 다양 한 사용 시나리오에 적용할 수 있고, 이로부터 추천된 답안 정보의 정확도가 보다 높도록 한다. 나아가, 시스템 우선순위는 질의 분석 시스템에 포함된 데이터의 데이터 량의 량일 수도 있으며, 데이터 량이 많은 질의 분석 시스템의 우선순위가 높고, 데이터 량이 적은 질의 분석 시스템의 우선순위는 낮다. 예를 들어, 문서 질의 응답 시스템 중의 데이터의 데이터 량이 FAQ 질의 응답 시스템 중의 데이터의 데이터 량보다 크면, 문서 질의 응답 시스템의 시스템 우선순위를 FAQ 질의 응답 시스템의 시스템 우선순위보다 높게 우선순위를 설 정한다. S304, 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정 되면, 사용자에게 답안 정보를 피드백 한다. 예시적으로, 본 단계는 단계(S203)를 참조할 수 있으며, 여기서 중복 설명을 생략한다. 본 출원은 다중 시스템 기반 지능형 질의 응답 방법을 제공하며, 사용자의 질의 정보를 지시하기 위한 질의 응 답 명령에 응답하여, 질의 정보의 키 정보를 추출하되, 여기서, 키 정보는 엔티티 단어 및/또는 어투 단어를 포 함하고, 기설정된 키 정보와 질의 유형 간의 대응 관계를 기초로, 질의 정보의 질의 유형을 확정하고; 기설정된 질의 유형과 검색 엔진의 매핑 관계를 기초로, 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초 로 검색 엔진에 대응되는 복수의 질의 분석 시스템을 호출하고, 질의 분석 시스템의 시스템 우선순위에 근거하 여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 한다. 본 기술 방안을 사용하면, 답안 정보의 전반적인 리콜률을 향상시키고, 질의 정보 어의와 일반화 문제를 해결할 수 있다. 도 4는 본 출원의 제3 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 방법을 제공하며, 상 술한 실시예의 기초 상에서, 현재 질의 분석 시스템이 상이함에 따라, 질의 정보에 대응되는 답안 정보를 확정 하고, 해당 방법은 아래의 단계를 포함한다. S401, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정한다. 예시적으로, 본 단계는 단계(S201)를 참조할 수 있으며, 여기서 중복 설명을 생략한다. S402, 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분 석 시스템을 호출한다. 예시적으로, 본 단계는 단계(S202)를 참조할 수 있으며, 여기서 중복 설명을 생략한다. S403, 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템이 문서 질의 응답 시스템이면, 현재 질의 분석 시스 템에 근거하여 질의 정보에 대응되는 답안 정보를 확정한다. 일 예시에서, 현재 질의 분석 시스템이 문서 질의 응답 시스템이면, 현재 질의 분석 시스템에 근거하여 질의 정 보에 대응되는 답안 정보를 확정하는 단계는, 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭을 수행하여, 질의 정보 에 대응되는 최적 단락을 획득하되; 여기서, 제1 데이터베이스는 복수의 문서를 포함하고, 문서는 복수의 단락 을 포함하는 단계; 제1 통과 지식을 기초로 통합된 증강 표현(ERNIE) 모델을 기초로, 최적 단락에 대해 글자수 간소화 처리를 수행 하여, 질의 정보에 대응되는 답안 정보를 획득하는 단계를 포함한다. 본 실시예에서, 제1 데이터베이스는 문서 라이브러리와 고유 명사 라이브러리를 포함한다. 현재 질의 분석 시스 템이 문서 질의 응답 시스템임을 확정한 후, 제1 데이터베이스에서 질의 정보의 유사 내용을 확정하며, 구체적 으로, 질의 정보에 대해 유사성 매칭을 수행하여, 유사성이 가장 높은 단락을 대응되는 최적 단락으로 확정하는 것일 수 있다. 예를 들어, 제1 데이터베이스는 서로 다른 문서 유형을 포함하며, 뉴스 유형의 문서 내용, 질의 응답 검색 유형의 문서 내용과 문헌 자료 유형의 문서 내용일 수 있다. 뉴스 유형의 문서 내용, 질의 응답 검색유형의 문서 내용과 문헌 자료 유형의 문서 내용에서 질의 정보에 대해 유사성 매칭을 수행하여, 유사성이 높은 문서 중의 최적 단락을 확정하고, 최적 단락을 지식 통합을 통한 증강 표현(enhanced representation through knowledge integration, ERNIE) 모델을 통해, 최적 단락에 대해 무의미 단어 삭제를 수행하며, 예를 들어, 최적 단락 중의 “이다, 인가, 의”를 삭제하여, 보다 간소화한 답안 정보를 획득한다. 나아가, ERNIE 모델은 기설정된 질의 정보 및 해당 질의 정보에 대응되는 간소화한 답안 정보를 통해 트레이닝 하여, 질의 정보를 ERNIE 모델에 입력한 후, ERNIE 모델을 통해 최적 단락의 글자수를 간소화하도록 할 수 있다. 이러한 설정의 장점은 문서 질의 응답 시스템에 ERNIE 모델을 도입시켜, 마지막 답안 정보의 정확도가 보 다 높도록 할 수 있다. 일 예시에서, 여기서, 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭 을 수행하여, 질의 정보에 대응되는 최적 단락을 획득하는 단계는, 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭을 수행하여, 질의 정보 와 유사한 복수의 후보 단락을 획득하고; 질의 정보에 대응되는 핵심 요소 정보를 획득하는 단계; 핵심 요소 정보와 후보 단락에 대해 유사도 계산을 수행하고, 유사도가 가장 높은 후보 단락을 질의 정보에 대 응되는 최적 단락으로 확정하는 단계를 포함한다. 본 실시예에서, 여기서, 핵심 요소 정보는 사용자 위치 정보, 사용자 속성 정보, 사용자가 사용한 단말기의 정 보 중 적어도 하나를 포함한다. 이러한 설정의 장점은 핵심 요소 정보의 내용을 증가하여, 후보 단락 유사도의 정확성을 향상시킬 수 있다. 일 예시에서, 제1 데이터베이스에서 질의 정보와 유사한 복수의 후보 단락을 확정하고, 복수의 후보 단락을 확 정한 후, 질의 정보 중의 핵심 요소 정보를 획득하며, 여기서, 핵심 요소 정보는 사용자 위치 정보, 사용자 속 성 정보와 사용자가 사용한 단말기의 정보일 수 있다. 여기서, 사용자 속성 정보는 사용자의 성명, 사용자의 신 장, 사용자의 연령과 사용자의 취향 등 사용자 자신의 특징을 기술할 수 있는 정보일 수 있다. 본 실시예에서, 핵심 요소 정보를 복수의 후보 단락과 유사도 계산을 수행하여, 유사도가 가장 높은 후보 단락 을 확정하고, 유사도가 가장 높은 후보 단락을 최적 단락으로 한다. 이러한 설정의 장점은 핵심 요소 정보와 복 수의 후보 단락을 통해, 질의 정보에 대응되는 최적 단락을 빠르게 확정할 수 있으며, 이때 최적 단락의 정확도 를 향상시킬 수 있다. S404, 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템이 FAQ 질의 응답 시스템이면, 현재 질의 분석 시스 템에 근거하여 질의 정보에 대응되는 답안 정보를 확정한다. 일 예시에서, 현재 질의 분석 시스템이 FAQ 질의 응답 시스템이면, 현재 질의 분석 시스템에 근거하여 질의 정 보에 대응되는 답안 정보를 확정하는 단계는, FAQ 질의 응답 시스템 중의 제2 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭을 수행하여, 질의 정보 와 유사한 복수의 질의 텍스트를 획득하되; 여기서, 제2 데이터베이스는 복수의 질의 텍스트를 포함하는 단계; 질의 정보, 및 질의 정보와 유사한 복수의 질의 텍스트를 기초로, 질의 정보에 대응되는 답안 정보를 확정하는 단계를 포함한다. 일 예시에서, 제2 데이터베이스는 FAQ 라이브러리와 고유 명사 라이브러리를 포함하고, 제2 데이터베이스에서 질의 정보와 유사한 복수의 질의 텍스트를 확정하고, 질의 정보와 복수의 질의 텍스트를 기초로 질의 정보에 대 응되는 답안 정보를 공동으로 확정한다. 예를 들어, 질의 정보는 “A의 연령은 얼마인가？”이면, 제2 데이터베 이스에서 해당 질의 정보에 대해 유사성 매칭을 수행할 수 있으며, 얻을 수 있는 복수의 질의 텍스트는 “A의 출생 년월일이 언제인가？”“A는 올해 몇살인가？”이고, 이때 얻어진 질의 정보와 복수의 질의 텍스트를 기초 로 대응되는 답안 정보를 공동으로 확정한다. 이러한 설정의 장점은 질의 정보의 범용화 능력을 향상시킬 수 있 고, 나아가 피드백된 답안 정보가 더욱 정확하도록 한다. 일 예시에서, 여기서, 질의 정보, 및 질의 정보와 유사한 복수의 질의 텍스트를 기초로, 질의 정보에 대응되는 답안 정보를 확정하는 단계는, 질의 정보, 및 질의 정보와 유사한 복수의 질의 텍스트를, 질의 집합 중의 후보 질의로 확정하되; 여기서, 후보 질의는 특징 정보를 구비하는 단계;질의 집합 중의 후보 질의의 특징 정보를 기설정 뉴럴 네트워크 모델에 입력하여, 최적의 후보 질의를 획득하는 단계; 기설정된 후보 질의와 답안 정보 사이의 대응 관계를 기초로, 최적의 후보 질의에 대응되는 답안 정보를, 질의 정보에 대응되는 답안 정보로 확정하는 단계를 포함한다. 본 실시예에서, 질의 정보 및 복수의 질의 텍스트를 질의 집합 중의 후보 질의로 확정하며, 여기서, 후보 질의 는 동일한 하나의 특징 정보를 포함하고, 예를 들어, 후보 질의에 포함된 질의는, “A의 연령은 얼마인가？”, “A의 출생 년월일이 언제인가？”와 “A는 올해 몇살인가？”가 있고, 상술한 후보 질의 중의 특징 정보는 연 령이며, 이때 획득된 연령의 특징 정보를 뉴럴 네트워크 모델에 입력하여, 최적의 후보 질의를 확정하고, 최적 의 후보 질의와 답안 정보 사이의 대응 관계를 기초로, 답안 정보를 확정하고, 해당 답안 정보를 해당 질의 정 보에 대응되는 답안 정보로 한다. 예를 들어, 최적 후보 질의가 “A는 올해 몇살인가？”이면, 얻어진 답안 정 보는 27이고, 이때 27을 질의 정보 “A의 연령은 얼마인가？”의 답안 정보로 한다. 이러한 설정의 장점은 최적 후보 질의를 확정한 후, 최적 후보 질의에 대응되는 답안 정보를 직접 마지막 답안 정보로 하여, 답안 정보를 확정하는 시간을 절약할 수 있다. 일 예시에서, 제2 데이터베이스 중의 복수의 질의 텍스트의 생성 과정은 아래와 같다. 원본 문서를 획득하고, 원본 문서에 대해 분할 처리하여, 복수의 단문을 획득하고; 제2 ERNIE 모델을 기초로 단 문에 대해 오클루전 처리하여, 제2 데이터베이스 중의 질의 텍스트를 생성하고; 또는, 원본 문서를 획득하고, 원본 문서 중의 타이틀을 확정하고; 타이틀을 제2 데이터베이스 중의 질의 텍스트 로 확정한다. 또는, 원본 문서를 획득하고, 원본 문서에 대해 내용 구조 분석 처리를 수행하여, 질문 특성을 구비한 짧은 스 니펫을 획득하고; 짧은 스니펫과 짧은 스니펫의 원본 문서에서의 원본 단락을 기설정 모델에 입력하여, 제2 데 이터베이스 중의 질의 텍스트를 획득하고; 여기서, 짧은 스니펫은 획득된 질의 텍스트에 대응되는 답안 정보이 다. 본 실시예에서, 원본 문서는 다양한 형식으로 저장된 문서 데이터일 수 있고, 원본 문서를 획득한 후, 원본 문 서에 대해 분할 처리하며, 어의 관계에 따라 원본 문서에 대해 분할하는 것일 수 있으며, 예를 들어, 원본 문서 중의 동일한 어의를 표현하는 문서를 분할하여, 복수의 단문을 획득하고, 제2 ERNIE 모델을 기초로 단문 중의 부분 단어에 대해 오클루전 처리하여, 복수의 질의 텍스트를 획득할 수 있다. 여기서, 사용된 기술은, 단락 인 식 기술, 답안 단락 인식 기술, 질의 응답 단락 매칭 기술 및 노이즈 감소 기술이 있다. 본 실시예에서, 원본 문서를 획득한 후, 원본 문서의 타이틀 또는 서브 타이틀을 추출하고, 타이틀 또는 서브 타이틀을 질의 형식으로 수정하거나, 또는 타이틀을 스티칭한 후 질의 텍스트로 한다. 본 실시예에서, 원본 문서를 획득한 후, 원본 문서 중의 문자 내용에 대해 분석하고, 구체적으로, 내용 구조 분 석 처리하여, 원본 문서 중의 접속사를 추출하고, 질문 특성을 구비한 짧은 스니펫을 획득한 후, 짧은 스니펫과 짧은 스니펫이 위치한 원본 단락을 뉴럴 네트워크 모델에 입력하여, 제2 데이터베이스 중의 질의 텍스트를 확정 하는 것일 수 있다. 이러한 설정의 장점은 후속 질의 정보의 검색을 위해 가능한 한 많은 제2 데이터베이스 중 의 질의 텍스트를 제공한다. S405, 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템이 지식 그래프 시스템이면, 현재 질의 분석 시스템 에 근거하여 질의 정보에 대응되는 답안 정보를 확정한다. 일 예시에서, 현재 질의 분석 시스템이 지식 그래프 시스템이면, 현재 질의 분석 시스템에 근거하여 질의 정보 에 대응되는 답안 정보를 확정하는 단계는, 질의 정보 중의 엔티티를 추출하는 단계; 지식 그래프 시스템 중 기설정 지식 그래프 및 제3 ERNIE 모델을 기초로, 질의 정보 중의 엔티티에 대해 식별하 여, 질의 정보에 대응되는 답안 정보를 획득하되; 여기서, 기설정 지식 그래프는 복수의 엔티티를 포함하고, 기 설정 지식 그래프 중의 엔티티 사이에는 연결 관계를 구비하고, 제3 ERNIE 모델은 질의 정보 중의 엔티티를 처 리하기 위한 것인 단계를 포함한다. 일 예시에서, 질의 정보 중의 엔티티를 추출한 후에, 지식 그래프 시스템 중의 기설정 지식 그래프 및 제3 ERNIE 모델을 통해, 기설정 지식 그래프 중에서 엔티티를 확정한 후, 엔티티에 관련되는 답안 정보를 확정하며, 나아가, 엔티티의 식별은 제3 ERNIE 모델을 통해 구현되는 것이다. 이러한 설정의 장점은 ERNIE 모델을 사용하 여, 지식 그래프 시스템이 엔티티를 확정하는 정확율을 향상시키는 것이다. 일 예시에서, 여기서, 지식 그래프 시스템 중 기설정 지식 그래프 및 제3 ERNIE 모델을 기초로, 질의 정보 중의 엔티티에 대해 식별하여, 질의 정보에 대응되는 답안 정보를 획득하는 단계는, 제3 ERNIE 모델을 기초로 질의 정보 중의 엔티티에 대해 오클루전 처리를 수행하여, 복수의 관련 엔티티를 획득 하는 단계; 질의 정보 중의 엔티티, 및 얻어진 관련 엔티티를 기설정 지식 그래프에 입력하여, 복수의 초기 답안을 획득하 는 단계; 제3 ERNIE 모델을 기초로 복수의 초기 답안에 대해 채점 처리를 수행하여, 질의 정보에 대응되는 답안 정보를 획득하는 단계를 포함한다. 본 실시예에서, 질의 정보에서 식별된 엔티티를 오클루전 처리한 후, 해당 엔티티와 관련되는 복수의 관련 엔티 티를 확정하고, 그 후, 질의 정보 중의 엔티티와 관련 엔티티를 기설정 지식 그래프 시스템에 입력하여, 복수의 초기 답안을 확정하고, 그 다음 제3 ERNIE 모델을 통해 복수의 초기 답안에 대해 채점 처리를 수행하여, 질의 정보에 대응되는 답안 정보를 획득한다. 이러한 설정의 장점은 확정된 답안 정보의 정확율을 향상시킬 수 있다. 일 예시에서, 현재 질의 분석 시스템이 지식 그래프 시스템이면, 현재 질의 분석 시스템에 근거하여 질의 정보 에 대응되는 답안 정보를 확정하는 단계는, 질의 정보 중의 키워드를 추출하되, 여기서, 키워드는 단어 특성을 구비하는 단계; 지식 그래프 시스템 중의 기설정된 규칙 템플릿 라이브러리, 및 질의 정보 중의 키워드의 단어 특성을 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응되는 규칙 템플릿을 확정하되, 여기서, 규칙 템플릿 라이브러리는 복수의 규칙 템플릿을 포함하고, 규칙 템플릿은 순서 관계가 없는 복수의 슬롯 위치를 포함하고, 슬롯 위치는 단어 특성을 표시하고, 규칙 템플릿 중의 각 슬롯 위치의 단어 특성은 서로 다른 단계; 질의 정보에 대응되는 규칙 템플릿을 기초로, 질의 정보에 대해 답안 매칭을 수행하여, 질의 정보에 대응되는 답안 정보를 획득하는 단계를 포함한다. 본 실시예에서, 질의 정보 중의 키워드를 추출하고, 여기서, 질의 정보 중의 각 단어는 모두 키워드이고, 단지 키워드가 속해 있는 단어 특성이 서로 다르며, 여기서, 단어 특성은 엔티티, 속성, 의문사, 불용어, 접속어와 점프어를 포함한다. 본 실시예 중의 슬롯 위치는 키워드를 배치하는 하나의 위치이며, 서로 다른 슬롯 위치에 배치한 키워드는 서로 다르다. 본 실시예에서, 기설정된 규칙 템플릿 라이브러리로부터, 질의 정보 중 키워드에 포함된 단어 특성을 확정하고, 확정된 질의 정보에 대응되는 규칙 템플릿 중에서, 질의 정보에 대해 답안 매칭을 수행한다. 본 실시예에서, 규칙 템플릿 라이브러리는 엔티티, 속성과 의문사의 한가지 규칙을 포함하고, 속성, 의문사와 접속어의 한가지 규칙, 및 엔티티, 점프어와 속성의 한가지 규칙을 더 포함한다. 예를 들어, 질의 정보에 포함 된 단어 특성이 엔티티, 속성과 의문사이면, 해당 질의 정보는 규칙 템플릿 라이브러리 중의 제1 규칙에 대응되 고, 제1 규칙을 통해 해당 질의 정보에 대응되는 답안 정보를 확정한다. 이러한 설정의 장점은 규칙 템플릿을 미리 제공하여, 질의 정보를 빠르게 위치 확정할 수 있다. 일 예시에서, 규칙 템플릿은 기설정된 세부 규칙 라이브러리를 구비하고, 여기서, 세부 규칙 라이브러리는 규칙 템플릿에 대응되는 복수의 세부 규칙 테이블을 포함하고, 세부 규칙 테이블은 복수의 순서 관계를 구비한 복수 의 슬롯 위치를 포함하고; 세부 규칙 테이블 중의 각 슬롯 위치의 단어 특성은 상이하거나, 또는, 세부 규칙 테 이블 중의 부분 슬롯 위치의 단어 특성은 서로 동일하다. 지식 그래프 시스템 중의 기설정된 규칙 템플릿 라이브러리, 및 질의 정보 중의 키워드의 단어 특성을 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응되는 규칙 템플릿을 확정하는 단계는, 세부 규칙 라이브러리의 기설정된 세부 규칙 라이브러리, 질의 정보 중의 서로 다른 단어 특성의 키워드의 수량, 및 질의 정보 중의 서로 다른 단어 특성의 키워드의 연결 관계를 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응되는 세부 규칙 테이블을 확정하는 단계;질의 정보 중의 키워드를, 질의 정보에 대응되는 세부 규칙 테이블에 필링하여, 질의 설명 정보를 획득하고; 기 설정된 질의 설명 정보와 답안 정보 간의 대응 관계를 기초로, 획득된 질의 설명 정보에 대응되는 답안 정보를 질의 정보에 대응되는 답안 정보로 확정하는 단계를 포함한다. 본 실시예에서, 규칙 템플릿은 복수의 세부 규칙 라이브러리를 포함하고, 각 규칙 템플릿 중의 복수의 슬롯 위 치의 단어 특성은 동일하지만, 각 규칙 템플릿 중의 세부 규칙 테이블 중의 복수의 슬롯 위치는 순서 관계를 구 비하므로, 예를 들어, 규칙 템플릿의 제1 규칙은 엔티티, 속성과 의문사이면, 세부 규칙 라이브러리에 포함된 세부 규칙은 엔티티, 속성과 의문사와 같은 한가지 규칙일 수 있고, 엔티티, 속성, 엔티티와 의문사와 같은 한 가지 규칙을 포함할 수도 있고, 엔티티, 의문사와 속성과 같은 한가지 규칙을 포함할 수도 있다. 본 실시예에서, 질의 정보 중의 서로 다른 단어 특성의 키워드 수량, 및 질의 정보 중의 서로 다른 단어 특성 중의 키워드의 연결 관계를 확정한 후, 해당 질의 정보에 대해 매칭 처리를 수해하여, 질의 정보에 대응되는 세 부 규칙 테이블을 확정하고, 예를 들어, 이때 확정된 세부 규칙 테이블이 엔티티, 속성과 의문사이면, 질의 정 보 중의 키워드를 필링하고, 세부 규칙 테이블 중의 질의 정보를 이용하여 대응되는 답안 정보를 확정한다. 예 를 들어, 질의 정보는 “A의 연령은 얼마인가？”이고, 여기서, “A”는 엔티티이고, “의”는 접속어이고, “ 연령”은 속성이고, “인가”는 접속어이고, “얼마”는 의문사이며, 이때 규칙 템플릿 라이브러리에서 엔티티, 접속어, 속성과 의문사의 규칙 템플릿을 확정할 수 있으며, 이 규칙 템플릿에서 두개의 접속어, 하나의 엔티티 단어, 하나의 속성, 하나의 의문사의 세부 규칙 테이블을 확정하여, 질의 설명 정보를 획득하고; 이로부터 기설 정된 질의 설명 정보와 답안 정보 사이의 대응 관계를 기초로, 획득된 질의 설명 정보에 대응되는 답안 정보를 확정하며, 해당 답안 정보는 질의 정보에 대응되는 답안 정보이다. 이러한 설정의 장점은 답안 정보의 전반적인 리콜률을 향상시킬 수 있다. S406, 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템이 추리 질의 응답 시스템이면, 현재 질의 분석 시스 템에 근거하여 질의 정보에 대응되는 답안 정보를 확정한다. 일 예시에서, 만약 현재 질의 분석 시스템이 추리 질의 응답 시스템이면, 현재 질의 분석 시스템에 근거하여 질 의 정보에 대응되는 답안 정보를 확정하는 단계는, 질의 정보의 키워드를 추출하되, 여기서, 키워드는 단어 특성을 구비하는 단계; 추리 질의 응답 시스템 중의 기설정된 추리 규칙 템플릿 라이브러리, 질의 정보 중의 키워드의 단어 특성, 및 질의 정보 중의 키워드 사이의 순서 관계를 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응 되는 추리 템플릿을 확정하되; 여기서, 추리 규칙 템플릿 라이브러리는 복수의 추리 템플릿을 포함하고, 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 필링 포인트는 단어 특성을 구비하는 단계; 질의 정보에 대응되는 핵심 요소 정보를 획득하고, 질의 정보에 대응되는 핵심 요소 정보, 및 질의 정보에 대응 되는 추리 템플릿을 기초로, 질의 정보에 대응되는 답안 정보를 확정하는 단계를 포함한다. 본 실시예에서, 추리 템플릿 중 복수의 필링 포인트는 순서가 존재하는 것으로, 필링 포인트의 단어 특성이 동 일한 경우에, 만약 필링 포인트의 단어 특성 순서가 서로 다른 경우에는, 표시하는 추리 템플릿은 서로 다르며, 질의 정보에 대응되는 핵심 요소 정보, 및 질의 정보에 대응되는 추리 템플릿을 확정하여 질의 정보에 대응되는 답안 정보를 공동으로 확정한다. 이러한 설정의 장점은 사용자의 광범위한 질의 응답 수요를 만족할 수 있다. 일 예시에서, 질의 정보에 대응되는 핵심 요소 정보, 및 질의 정보에 대응되는 추리 템플릿을 기초로, 질의 정 보에 대응되는 답안 정보를 확정하는 단계는, 기설정된 뉴럴 네트워크 모델을 기초로 질의 정보에 대응되는 각 추리 템플릿에 대해 식별하여 최적 추리 템플 릿을 확정하는 단계; 질의 정보에 대응되는 핵심 요소 정보 및 최적 추리 템플릿을 기초로, 질의 정보에 대응되는 답안 정보를 확정 하는 단계를 포함한다. 본 실시예에서, 복수의 추리 템플릿을 기설정된 뉴럴 네트워크 모델에 입력하고, 기설정된 뉴럴 네트워크 모델 을 통해 최적 추리 템플릿을 확정한 후, 질의 정보에 대응되는 핵심 요소 정보를 획득하고, 양자를 결합하여 질 의 정보에 대응되는 답안 정보를 공동으로 확정한다. 이러한 설정의 장점은 답안 정보의 강건성을 향상시킨다. 일 예시에서, 질의 정보에 대응되는 핵심 요소 정보 및 최적 추리 템플릿을 기초로, 질의 정보에 대응되는 답안 정보를 확정하는 단계는, 핵심 요소 정보의 단어 특성을 확정하여, 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를 획득하는 단계; 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를, 최적 추리 템플릿에 입력하여, 최종 추리 템플릿을 획 득하는 단계; 질의 정보의 키워드와 질의 정보에 대응되는 핵심 요소 정보를, 최종의 추리 템플릿의 각 필링 포인트에 입력하 여, 추리 문구를 획득하는 단계; 기설정 추리 문구와 답안 정보 간의 대응 관계를 기초로, 획득된 추리 문구에 대응되는 답안 정보를 질의 정보 에 대응되는 답안 정보로 확정하는 단계를 포함한다. 본 실시예는, 획득된 핵심 요소 정보의 단어 특성을 필링 포인트에 필링하고, 해당 핵심 요소 정보를 최적 추리 템플릿에 입력하며, 예를 들어, 핵심 요소 정보가 지리 위치 정보일 수 있으면, 지리 위치 정보를 엔티티의 필 링 포인트에 필링하고, 엔티티의 필링 포인트를 기초로 최종의 추리 템플릿을 공동으로 확정한다. 질의 정보 중 의 키워드를 획득한 후, 키워드도 필링 포인트에 필링하고, 최종 추리 템플릿을 기초로 추리 문구를 획득한다. 추리 문구를 획득한 후, 기설정 추리 문구와 답안 정보 사이의 관계를 기초로, 최종의 답안 정보를 확정한다. 이러한 설정의 장점은 추리 문구를 통해 정확한 답안 정보를 확정하여, 답안 정보의 확정 효율을 향상시킬 수 있다. 본 실시예의 방법은 사용자에게 답안 정보를 피드백하는 단계를 더 포함한다. 본 출원은 다중 시스템 기반 지능형 질의 응답 방법을 제공하며, 현재 질의 분석 시스템의 상이함에 따라, 질의 정보에 대응되는 답안 정보를 확정하며, 복수의 현재 질의 분석 시스템을 포함하고, 이러한 시스템은 임의로 조 합되어 질의 정보에 대응되는 답안 정보를 확정할 수 있다. 본 기술방안을 사용하면, 대량의 전문적인 기업 문 서에서 답안 정보를 빠르게 찾아낼 수 있다. 도 5는 본 출원의 제4 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 장치를 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정하는 제1 확정 유닛; 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스 템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자 에게 답안 정보를 피드백 하는 제2 확정 유닛을 포함한다. 당해 분야의 기술 자라면, 설명의 편리와 간결성을 위하여, 상술한 장치의 구체적인 동작 과정은, 전술한 방법 실시예의 대응되는 과정을 참조할 수 있다는 것을 명확하게 이해할 수 있으며, 여기서 중복 설명을 생략한다. 도 6은 본 출원의 제5 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 장치를 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정하는 제1 확정 유닛; 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스 템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 하는 제2 확정 유닛을 포함한다. 일 예시에서, 여기서, 복수의 질의 분석 시스템은, 지식 그래프 시스템, 추리 질의 응답 시스템, 문서 질의 응 답 시스템, 일반 질의 해답(FAQ) 질의 응답 시스템을 포함한다.여기서, 지식 그래프 시스템은 질의 정보 중의 엔티티에 대응되는 답안 정보를 지시하기 위한 것이다. 추리 질의 응답 시스템은 질의 정보에 대응되는 추리 템플릿을 지시하기 위한 것이고, 여기서, 추리 템플릿은 답안 정보를 확정하기 위한 것이고; 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 필링 포인트는 단어 특성을 구비한다. 문서 질의 응답 시스템은 질의 정보에 대응되는 단락을 지시하기 위한 것이며, 여기서, 단락은 답안 정보를 확 정하기 위한 것이다. FAQ 질의 응답 시스템은 질의 정보와 관련되는 기타 질의를 지시하기 위한 것이고, 기타 질의와 질의 정보는 답 안 정보를 확정하기 위한 것이다. 일 예시에서, 여기서, 시스템 우선순위는 기설정된 것이거나; 또는, 시스템 우선순위는 사용자에 의해 확정된 것이거나; 또는, 시스템 우선순위는 질의 분석 시스템에 포함된 데이터의 데이터 량을 표시한다. 일 예시에서, 여기서, 제1 확정 유닛은, 질의 정보의 키 정보를 추출하되, 여기서, 키 정보는 엔티티 단어 및/또는 어투 단어를 포함하는 추출 모듈 ; 기설정된 키 정보와 질의 유형 간의 대응 관계를 기초로, 질의 정보의 질의 유형을 확정하는 확정 모듈을 포함한다. 일 예시에서, 여기서, 호출 유닛은, 기설정된 질의 유형과 검색 엔진의 매핑 관계를 기초로, 질의 유형에 대응되는 검색 엔진을 확정하는 확정 모듈 을 포함한다. 여기서, 질의 유형은 숫자 유형, 단문 유형, 장문 유형, 일반 수요 유형, 판단 유형 중 하나를 포함한다. 당해 분야의 기술 자라면, 설명의 편리와 간결성을 위하여, 상술한 장치의 구체적인 동작 과정은, 전술한 방법 실시예의 대응되는 과정을 참조할 수 있다는 것을 명확하게 이해할 수 있으며, 여기서 중복 설명을 생략한다. 도 7은 본 출원의 제6 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 장치를 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정하는 제1 확정 유닛; 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스 템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 하는 제2 확정 유닛을 포함한다. 일 예시에서, 여기서, 만약 현재 질의 분석 시스템이 문서 질의 응답 시스템이면, 제2 확정 유닛은, 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭을 수행하여, 질의 정보 에 대응되는 최적 단락을 획득하되; 여기서, 제1 데이터베이스는 복수의 문서를 포함하고, 문서는 복수의 단락 을 구비하는 매칭 모듈; 제1 통과 지식을 기초로 통합된 증강 표현(ERNIE) 모델을 기초로, 최적 단락에 대해 글자수 간소화 처리를 수행 하여, 질의 정보에 대응되는 답안 정보를 획득하는 처리 모듈을 포함한다. 일 예시에서, 여기서, 매칭 모듈은, 문서 질의 응답 시스템 중의 제1 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭을 수행하여, 질의 정보 와 유사한 복수의 후보 단락을 획득하고; 질의 정보에 대응되는 핵심 요소 정보를 획득하는 제1 확정 서브 모듈 ; 핵심 요소 정보와 후보 단락에 대해 유사도 계산을 수행하고, 유사도가 가장 높은 후보 단락을 질의 정보에 대 응되는 최적 단락으로 확정하는 제2 확정 서브 모듈을 포함한다.일 예시에서, 여기서, 핵심 요소 정보는 사용자 위치 정보, 사용자 속성 정보, 사용자가 사용한 단말기의 정보 중 적어도 하나를 포함한다. 당해 분야의 기술 자라면, 설명의 편리와 간결성을 위하여, 상술한 장치의 구체적인 동작 과정은, 전술한 방법 실시예의 대응되는 과정을 참조할 수 있다는 것을 명확하게 이해할 수 있으며, 여기서 중복 설명을 생략한다. 도 8은 본 출원의 제7 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 장치를 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정하는 제1 확정 유닛; 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스 템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 하는 제2 확정 유닛을 포함한다. 일 예시에서, 여기서, 만약 현재 질의 분석 시스템이 FAQ 질의 응답 시스템이면, 제2 확정 유닛은, FAQ 질의 응답 시스템 중의 제2 데이터베이스를 기초로, 질의 정보에 대해 유사성 매칭을 수행하여, 질의 정보 와 유사한 복수의 질의 텍스트를 획득하되; 여기서, 제2 데이터베이스는 복수의 질의 텍스트를 포함하는 매칭 모듈; 질의 정보, 및 질의 정보와 유사한 복수의 질의 텍스트를 기초로, 질의 정보에 대응되는 답안 정보를 확정하는 제1 확정 모듈을 포함한다. 일 예시에서, 여기서, 제1 확정 모듈은, 질의 정보, 및 질의 정보와 유사한 복수의 질의 텍스트를, 질의 집합 중의 후보 질의로 확정하되; 여기서, 후보 질의는 특징 정보를 구비하는 제1 확정 서브 모듈; 질의 집합 중의 후보 질의의 특징 정보를 기설정 뉴럴 네트워크 모델에 입력하여, 최적의 후보 질의를 획득하는 제2 확정 서브 모듈; 기설정된 후보 질의와 답안 정보 사이의 대응 관계를 기초로, 최적의 후보 질의에 대응되는 답안 정보를 질의 정보에 대응되는 답안 정보로 확정하는 제3 확정 서브 모듈을 포함한다. 일 예시에서, 다중 시스템 기반 지능형 질의 응답 장치는, 원본 문서를 획득하고, 원본 문서에 대해 분할 처리하여, 복수의 단문을 획득하고; 제2 ERNIE 모델을 기초로 단 문에 대해 오클루전 처리하여, 제2 데이터베이스 중의 질의 텍스트를 생성하는 제1 생성 유닛; 또는,원본 문서를 획득하고, 원본 문서 중의 타이틀을 확정하고; 타이틀을 제2 데이터베이스 중의 질의 텍스트 로 확정하는 제2 생성 유닛; 또는, 원본 문서를 획득하고, 원본 문서에 대해 내용 구조 분석 처리를 수행하고, 질문 특성을 구비한 짧은 스 니펫을 획득하고; 짧은 스니펫과 짧은 스니펫의 원본 문서에서의 원본 단락을 기설정 모델에 입력하여, 제2 데 이터베이스 중의 질의 텍스트를 획득하되; 여기서, 짧은 스니펫은 획득된 질의 텍스트에 대응되는 답안 정보인 제3 생성 유닛을 더 포함한다. 당해 분야의 기술 자라면, 설명의 편리와 간결성을 위하여, 상술한 장치의 구체적인 동작 과정은, 전술한 방법 실시예의 대응되는 과정을 참조할 수 있다는 것을 명확하게 이해할 수 있으며, 여기서 중복 설명을 생략한다. 도 9는 본 출원의 제8 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 장치를 제공하는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정하는 제1 확정 유닛; 질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스 템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자 에게 답안 정보를 피드백 하는 제2 확정 유닛을 포함한다. 일 예시에서, 여기서, 현재 질의 분석 시스템이 지식 그래프 시스템이면, 제2 확정 유닛은, 질의 정보 중의 엔티티를 추출하는 제1 추출 모듈; 지식 그래프 시스템 중 기설정 지식 그래프 및 제3 ERNIE 모델을 기초로, 질의 정보 중의 엔티티에 대해 식별하 여, 질의 정보에 대응되는 답안 정보를 획득하되; 여기서, 기설정 지식 그래프는 복수의 엔티티를 포함하고, 기 설정 지식 그래프 중의 엔티티 사이에는 연결 관계를 구비하고, 제3 ERNIE 모델은 질의 정보 중의 엔티티를 처 리하기 위한 것인 식별 모듈을 포함한다. 일 예시에서, 여기서, 식별 모듈은, 제3 ERNIE 모델을 기초로 질의 정보 중의 엔티티에 대해 오클루전 처리를 수행하여, 복수의 관련 엔티티를 획득 하는 제1 처리 서브 모듈; 질의 정보 중의 엔티티, 및 얻어진 관련 엔티티를, 기설정 지식 그래프에 입력하여, 복수의 초기 답안을 획득하 는 입력 서브 모듈; 제3 ERNIE 모델을 기초로 복수의 초기 답안에 대해 채점 처리를 수행하여, 질의 정보에 대응되는 답안 정보를 획득하는 제2 처리 서브 모듈을 포함한다. 일 예시에서, 현재 질의 분석 시스템이 지식 그래프 시스템이면, 제2 확정 유닛은, 질의 정보 중의 키워드를 추출하되, 여기서, 키워드는 단어 특성을 구비하는 제2 추출 모듈; 지식 그래프 시스템 중의 기설정된 규칙 템플릿 라이브러리, 및 질의 정보 중의 키워드의 단어 특성을 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응되는 규칙 템플릿을 확정하되; 여기서, 규칙 템플릿 라이브러리는 복수의 규칙 템플릿을 포함하고, 규칙 템플릿은 순서 관계가 없는 복수의 슬롯 위치를 포함하고, 슬롯 위치는 단어 특성을 표시하고, 규칙 템플릿 중의 각 슬롯 위치의 단어 특성은 서로 다른 처리 모듈; 질의 정보에 대응되는 규칙 템플릿을 기초로, 질의 정보에 대해 답안 매칭을 수행하여, 질의 정보에 대응되는 답안 정보를 획득하는 매칭 모듈을 포함한다. 일 예시에서, 여기서, 규칙 템플릿은 기설정된 세부 규칙 라이브러리를 구비하고, 여기서, 세부 규칙 라이브러 리는 규칙 템플릿에 대응되는 복수의 세부 규칙 테이블을 포함하고, 세부 규칙 테이블은 복수의 순서 관계를 구 비한 복수의 슬롯 위치를 포함하고; 세부 규칙 테이블 중의 각 슬롯 위치의 단어 특성은 상이하거나, 또는, 세 부 규칙 테이블 중의 부분 슬롯 위치의 단어 특성은 서로 동일하다. 처리 모듈은, 세부 규칙 라이브러리의 기설정된 세부 규칙 라이브러리, 질의 정보 중의 서로 다른 단어 특성의 키워드의 수량, 및 질의 정보 중의 서로 다른 단어 특성의 키워드의 연결 관계를 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응되는 세부 규칙 테이블을 확정하는 제1 확정 서브 모듈; 질의 정보 중의 키워드를, 질의 정보에 대응되는 세부 규칙 테이블에 필링하여, 질의 설명 정보를 획득하고; 기 설정된 질의 설명 정보와 답안 정보 간의 대응 관계를 기초로, 획득된 질의 설명 정보에 대응되는 답안 정보를, 질의 정보에 대응되는 답안 정보로 확정하는 제2 확정 서브 모듈을 포함한다. 당해 분야의 기술 자라면, 설명의 편리와 간결성을 위하여, 상술한 장치의 구체적인 동작 과정은, 전술한 방법 실시예의 대응되는 과정을 참조할 수 있다는 것을 명확하게 이해할 수 있으며, 여기서 중복 설명을 생략한다. 도 10은 본 출원의 제9 실시예의 도면이고, 본 출원은 다중 시스템 기반 지능형 질의 응답 장치를 제공하 는 바, 사용자의 질의 정보를 지시하기 위한 질의 응답 명령에 응답하여, 질의 정보의 질의 유형을 확정하는 제1 확정 유닛;질의 유형에 대응되는 검색 엔진을 확정하고, 검색 엔진을 기초로 검색 엔진에 대응되는 복수의 질의 분석 시스 템을 호출하는 호출 유닛; 질의 분석 시스템의 시스템 우선순위에 근거하여, 순차적으로 복수의 질의 분석 시스템을 사용하여 질의 정보에 대해 처리하는 과정에, 만약 현재 질의 분석 시스템에 근거하여 질의 정보에 대응되는 답안 정보가 확정되면, 사용자에게 답안 정보를 피드백 하는 제2 확정 유닛을 포함한다. 일 예시에서, 여기서, 만약 현재 질의 분석 시스템이 추리 질의 응답 시스템이면, 제2 확정 유닛은, 질의 정보의 키워드를 추출하되, 여기서, 키워드는 단어 특성을 구비하는 추출 모듈; 추리 질의 응답 시스템 중의 기설정된 추리 규칙 템플릿 라이브러리, 질의 정보 중의 키워드의 단어 특성, 및 질의 정보 중의 키워드 사이의 순서 관계를 기초로, 질의 정보에 대해 매칭 처리를 수행하여, 질의 정보에 대응 되는 추리 템플릿을 확정하되; 여기서, 추리 규칙 템플릿 라이브러리는 복수의 추리 템플릿을 포함하고, 추리 템플릿에는 순서 관계가 있는 복수의 필링 포인트가 포함되고, 필링 포인트는 단어 특성을 구비하는 처리 모듈 ; 질의 정보에 대응되는 핵심 요소 정보를 획득하고, 질의 정보에 대응되는 핵심 요소 정보, 및 질의 정보에 대응 되는 추리 템플릿을 기초로, 질의 정보에 대응되는 답안 정보를 확정하는 확정 모듈을 포함한다. 일 예시에서, 여기서, 확정 모듈은, 기설정된 뉴럴 네트워크 모델을 기초로 질의 정보에 대응되는 각 추리 템플릿에 대해 인식하여, 최적 추리 템플 릿을 확정하는 제1 확정 서브 모듈; 질의 정보에 대응되는 핵심 요소 정보 및 최적 추리 템플릿을 기초로, 질의 정보에 대응되는 답안 정보를 확정 하는 제2 확정 서브 모듈을 포함한다. 일 예시에서, 여기서, 제2 확정 서브 모듈은 또한, 핵심 요소 정보의 단어 특성을 확정하여, 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를 획득하고; 핵심 요소 정보의 단어 특성에 대응되는 필링 포인트를, 최적 추리 템플릿에 도입하여, 최종 추리 템플릿을 획 득하고; 질의 정보의 키워드와 질의 정보에 대응되는 핵심 요소 정보를, 마지막 추리 템플릿의 각 필링 포인트에 필링하 여, 추리 문구를 획득하고; 기설정 추리 문구와 답안 정보 간의 대응 관계를 기초로, 획득된 추리 문구에 대응되는 답안 정보를, 질의 정보 에 대응되는 답안 정보로 확정한다. 당해 분야의 기술 자라면, 설명의 편리와 간결성을 위하여, 상술한 장치의 구체적인 동작 과정은, 전술한 방법 실시예의 대응되는 과정을 참조할 수 있다는 것을 명확하게 이해할 수 있으며, 여기서 중복 설명을 생략한다. 본 출원의 기술방에서, 관련되는 사용자의 개인 정보에 대한 수집, 저장, 사용, 가공, 전송, 제공과 공개 등 처 리는, 모두 관련 법률 법규의 규정에 부합하고, 공서양속을 어기지 않는다. 본 출원의 실시예에 따르면, 본 출원은 전자기기, 판독 가능 저장매체와 컴퓨터 프로그램 제품을 더 제공한다. 본 출원의 실시예에 따르면, 본 출원은 컴퓨터 프로그램 제품을 더 제공하는 바, 컴퓨터 프로그램 제품은 컴퓨 터 프로그램을 포함하고, 컴퓨터 프로그램은 판독 가능 저장매체에 저장되고, 전자기기의 적어도 하나의 프로세 서는 판독 가능 저장매체로부터 컴퓨터 프로그램을 판독할 수 있고, 적어도 하나의 프로세서는 컴퓨터 프로그램 을 실행하여 전자기기가 상술한 임의의 실시예에 따른 방안을 실행하도록 한다. 본 출원의 실시예에 따르면, 본 출원은 컴퓨터 판독 가능 저장매체에 저장된 컴퓨터 프로그램을 제공하며, 상기 컴퓨터 프로그램이 프로세서에 의해 실행될 때, 상술한 임의의 실시예에 따른 방법을 구현한다. 도 11은 본 출원의 실시예를 실시하기 위한 예시적인 전자기기를 나타내는 블럭도이다. 전자기기는 다양 한 형태의 디지털 컴퓨터, 예컨대, 랩톱 컴퓨터, 데스크톱 컴퓨터, 워크스테이션, 개인 정보 단말, 서버, 블레 이드 서버, 대형 컴퓨터, 및 기타 적합한 컴퓨터를 나타내기 위한 것이다. 전자기기는 다양한 형태의 이동 장치, 예컨대, 개인 정보 단말, 셀폰, 스마트 폰, 웨어러블 기기 및 기타 유사한 컴퓨팅 장치를 더 나타낼 수 있다. 본문에 개시된 부재, 이들의 연결 및 관계, 및 이들의 기능은 단지 예시적인 것이며, 본문에 개시된 것및/또는 요구하는 본 출원의 구현을 한정하려는 의도가 아니다. 도 11에 도시된 바와 같이, 전자기기는 컴퓨팅 유닛을 포함하여, 읽기 전용 메모리(1102, ROM)에 저장된 컴퓨터 프로그램 또는 저장 유닛으로부터 랜덤 액세스 메모리(1103, RAM)에 로딩된 컴퓨터 프로그 램을 기초로, 다양한 적합한 동작 및 처리를 수행할 수 있다. RAM에는, 전자기기의 조작에 필요한 다양한 프로그램과 데이터가 더 저장될 수 있다. 컴퓨팅 유닛, ROM 및 RAM은 버스를 통해 서로 연결된다. 입력/출력(I/O) 인터페이스도 버스에 연결된다. 전자기기의 복수의 부재는 I/O 인터페이스에 연결되고, 예를 들어 키보드, 마우스 등과 같은 입력 유닛; 예를 들어 다양한 유형의 디스플레이, 스피커 등과 같은 출력 유닛; 예를 들어 자기 디스크, 광 디스크 등과 같은 저장 유닛; 및 예를 들어 네트워크 카드, 모뎀, 무선 통신 트랜시버 등과 같은 통신 유닛을 포함한다. 통신 유닛은 전자기기가 인터넷과 같은 컴퓨터 네트워크 및/또는 다양한 전자통신 네트워크를 통해 기타 기기와 정보/데이터를 교환하는 것을 허용한다. 컴퓨팅 유닛은 처리 및 연산 능력을 갖춘 다양한 범용 및/또는 전용 처리 모듈일 수 있다. 컴퓨팅 유닛 의 일부 예시로서 중앙 처리 유닛(CPU), 그래픽 처리 유닛(GPU), 다양한 전용 인공지능(AI) 연산 칩, 다 양한 기계 학습 모델 알고리즘을 실행하는 컴퓨팅 유닛, 디지털 신호 프로세서(DSP), 및 임의의 적합한 프로세 서, 컨트롤러, 마이크로 컨트롤러 등을 포함하지만 이에 한정되는 것은 아니다. 컴퓨팅 유닛은 상술한 각 각의 방법 및 처리를 수행하는 바, 예를 들어 다중 시스템 기반 지능형 질의 응답 방법을 들 수 있다. 예를 들 어, 일부 실시예에서, 다중 시스템 기반 지능형 질의 응답 방법은 컴퓨터 소프트웨어 프로그램으로 구현되어, 명시적으로 저장 유닛과 같은 기계 판독 가능 매체에 저장될 수 있다. 일부 실시예에서, 컴퓨터 프로그램 의 부분 또는 전부는 ROM 및/또는 통신 유닛을 통해 전자기기 상에 로딩 및/또는 설치될 수 있다. 컴퓨터 프로그램이 RAM에 로딩되어 컴퓨팅 유닛에 의해 실행될 때, 상술한 다중 시스템 기반 지능형 질의 응답 방법의 하나 또는 복수의 단계를 수행할 수 있다. 선택적으로, 기타 실시예에서, 컴퓨팅 유닛 은 기타 임의의 적합한 방식(예를 들어, 펌웨어를 통해)을 통해 다중 시스템 기반 지능형 질의 응답 방법 을 수행하도록 구성될 수 있다. 본 명세서에 기재되는 시스템 및 기술의 다양한 실시형태는 디지털 전자 회로 시스템, 집적 회로 시스템, 필드 프로그래머블 어레이(FPGA), 전용 집적 회로(ASIC), 전용 표준 제품(ASSP), 시스템 온 칩 시스템(SOC), 컴플랙 스 프로그래머블 논리 장치(CPLD), 컴퓨터 하드웨어, 펌웨어, 소프트웨어, 및/또는 이들의 조합에서 구현될 수 있다. 이러한 다양한 실시형태는 하나 또는 복수의 컴퓨터 프로그램에서 구현되는 것을 포함할 수 있고, 해당 하나 또는 복수의 컴퓨터 프로그램은 적어도 하나의 프로그래머블 프로세서를 포함하는 프로그래머블 시스템 상 에서 실행 및/또는 해석될 수 있으며, 해당 프로그래머블 프로세서는 전용 또는 범용 프로그래머블 프로세서일 수 있고, 저장 시스템, 적어도 하나의 입력 장치, 및 적어도 하나의 출력 장치로부터 데이터와 명령을 수신할 수 있으며, 데이터와 명령을 해당 저장 시스템, 해당 적어도 하나의 입력 장치, 및 해당 적어도 하나의 출력 장 치로 전송한다. 본 출원의 방법을 실시하기 위한 프로그램 코드는 하나 또는 복수의 프로그래밍 언어의 임의의 조합으로 작성될 수 있다. 이러한 프로그램 코드는 범용 컴퓨터, 전용 컴퓨터 또는 기타 프로그래머블 데이터 처리 장치의 프로 세서 또는 컨트롤러에 제공되어, 프로그램 코드가 프로세서 또는 컨트롤러에 의해 실행될 때 흐름도 및/또는 블 록도에서 규정하는 기능/조작이 실시되도록 할 수 있다. 프로그램 코드는 완전히 기계 상에서 실행되거나, 부분 적으로 기계 상에서 실행될 수 있으며, 독립 소프트웨어 패키지로서 부분적으로 기계 상에서 실행되고 부분적으 로 원격 기계 상에서 실행되거나 완전히 원격 기계 또는 서버 상에서 실행될 수도 있다. 본 출원의 문맥에서, 기계 판독 가능 매체는 유형의 매체일 수 있고, 명령 실행 시스템, 장치 또는 기기에 의해 사용되거나 명령 실행 시스템, 장치 또는 기기와 결합되어 사용되는 프로그램을 포함하거나 저장할 수 있다. 기 계 판독 가능 매체는 기계 판독 가능 신호 매체이거나 기계 판독 가능 저장 매체일 수 있다. 기계 판독 가능 매 체는 전자적, 자기적, 광학적, 전자기적, 적외선, 또는 반도체 시스템, 장치 또는 기기, 또는 상술한 내용의 임 의의 적합한 조합을 포함할 수 있지만 이에 한정되는 것은 아니다. 기계 판독 가능 저장매체의 더 구체적인 예 시로서 하나 또는 복수의 와이어를 기반으로 하는 전기적 연결, 휴대형 컴퓨터 디스크, 하드 디스크, 랜덤 액세 스 메모리(RAM), 읽기 전용 메모리(ROM), 소거 가능 및 프로그래머블 읽기 전용 메모리(EPROM 또는 플래쉬 메모 리), 광섬유, 휴대용 컴팩트 읽기 전용 메모리(CD-ROM), 광학 저장 장치, 자기 저장 장치, 또는 상술한 내용의 임의의 조합을 포함한다. 사용자와의 인터랙션을 제공하기 위하여, 컴퓨터 상에서 본 명세서에 기재되는 시스템 및 기술을 실시할 수 있 으며, 해당 컴퓨터는 사용자에게 정보를 표시하기 위한 표시장치(예를 들어, CRT(캐소드레이 튜브) 또는 LCD(액 정 디스플레이) 모니터); 및 키보드와 지향 장치(예를 들어, 마우스 또는 트랙볼)를 구비하고, 사용자는 해당 키보드와 해당 지향 장치를 통해 입력을 컴퓨터로 제공할 수 있다. 기타 종류의 장치는 사용자와의 인터랙션을 제공할 수도 있다. 예를 들어, 사용자에게 제공되는 피드백은 임의의 형태의 센싱 피드백(예를 들어, 시각적 피 드백, 청각적 피드백, 또는 촉각적 피드백)일 수 있고; 임의의 형태(사운드 입력, 음성 입력 또는 촉각 입력)을 통해 사용자로부터의 입력을 수신할 수 있다. 여기에 기재되는 시스템과 기술은 백그라운드 부재를 포함하는 컴퓨팅 시스템(예를 들어, 데이터 서버로서), 또 는 중간부재를 포함하는 컴퓨팅 시스템(예를 들어, 응용 서버), 또는 프론트 엔드 부재를 포함하는 컴퓨팅 시스 템(예를 들어, 그래픽 유저 인터페이스 또는 인터넷 브라우저를 구비하는 사용자 컴퓨터, 사용자는 해당 그래픽 유저 인터페이스 또는 해당 인터넷 브라우저를 통해 여기에 기재되는 시스템 및 기술의 실시형태와 인터랙션할 수 있다), 또는 이러한 백그라운드 부재, 중간 부재, 또는 프론트 엔드 부재를 포함하는 임의의 조합의 컴퓨팅 시스템에서 실시될 수 있다. 임의의 형태 또는 매체의 디지털 데이터 통신(예를 들어, 통신 네트워크)을 통해 시스템의 부재를 서로 연결시킬 수 있다. 통신 네트워크의 예시로서, 근거리 통신망(LAN), 광역 통신망(WAN) 및 인터넷을 포함한다. 컴퓨터 시스템은 클라이언트와 서버를 포함할 수 있다. 클라이언트와 서버는 일반적으로 서로 멀리 떨어져 있으 며, 통상적으로 통신 네트워크를 통해 인터랙션한다. 상응한 컴퓨터 상에서 실행되며 서로 클라이언트 - 서버 관계를 가지는 컴퓨터 프로그램을 통해 클라이언트와 서버의 관계를 생성한다. 상술한 다양한 형태의 프로세스를 사용하여 단계를 재배열, 추가 또는 삭제할 수 있음을 이해해야 한다. 예를 들어, 본 출원에 기재된 각 단계는 병열로 수행될 수 있고 순차적으로 수행될 수도 있고 서로 다른 순서로 수행 될 수도 있으며, 본 출원에 따른 기술방안이 원하는 결과를 얻을 수만 있다면, 본문에서는 여기서 한정하지 않 는다. 상술한 구체적인 실시형태는, 본 출원의 보호범위에 대한 한정이 아니다. 본 분야의 통상의 지식을 가진 자라면, 설계 수요와 기타 요소를 기초로, 다양한 수정, 조합, 서브 조합 및 대체를 가할 수 있음을 이해하여야 한다. 본 출원의 정신과 원칙 내에서 이루어진 모든 수정, 동등한 대체와 개선 등은 모두 본 출원의 보호 범위 내에 포함되어야 한다."}
{"patent_id": "10-2022-0103564", "section": "도면", "subsection": "도면설명", "item": 1, "content": "첨부되는 도면은 본 방안을 더 충분히 이해하도록 제공되는 것으로서, 본 출원에 대한 한정은 아니다. 여기서, 도 1은 본 출원의 제1 실시예의 도면이다. 도 2는 본 출원의 제1 실시예의 도면이다. 도 3은 본 출원의 제2 실시예의 도면이다. 도 4는 본 출원의 제3 실시예의 도면이다. 도 5는 본 출원의 제4 실시예의 도면이다. 도 6은 본 출원의 제5 실시예의 도면이다. 도 7은 본 출원의 제6 실시예의 도면이다. 도 8은 본 출원의 제7 실시예의 도면이다. 도 9는 본 출원의 제8 실시예의 도면이다. 도 10은 본 출원의 제9 실시예의 도면이다. 도 11은 본 출원의 실시예의 다중 시스템에 기반한 지능형 질의 응답 방법을 구현하기 위한 전자기기의 블록도 이다."}
