{"patent_id": "10-2020-0099137", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0018722", "출원번호": "10-2020-0099137", "발명의 명칭": "사용자 맞춤형 하드웨어 정보 제공 장치 및 방법", "출원인": "건국대학교 글로컬산학협력단", "발명자": "정혜경"}}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 맞춤형 하드웨어 정보 제공 장치에 있어서,사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하는 수신부;상기 조립 PC의 하드웨어별로 상기 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하는 후보 부품 정보 생성부;상기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축하여 가상 PC의 성능 정보를 생성하는 구축부; 및상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 제공하는 인터페이스부,를 포함하는 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 수신부는,사용자의 PC, 노트북, 태블릿 사용이력, 기사용 기기의 사양 정보, 기기 사용 숙련도 및 기기별 선호도를 더 포함하는 사용자 입력을 수신하는 것인, 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 후보 부품 정보 생성부는,상기 사용 목적, 성능, 희망 구매 견적, 상기 기기 사용 숙련도 및 기기별 선호도에 기초하여 하드웨어별 부품에 가중치를 부여하여, 상기 후보 부품 정보를 생성하는 것인, 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 후보 부품 정보 생성부는,가중치가 부여된 상기 후보 부품 상호간의 호환성을 검증하여 상호 호환 가능한 부품 중심의 후보 부품 정보를생성하고,하드웨어별 상기 후보 부품 중 하나를 선택하는 사용자 입력이 수신되면, 선택된 후보 부품과의 시너지 후보 부품이 우선 표시되도록 상기 후보 부품 정보를 업데이트 하는 것인, 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 구축부는,상기 후보 부품 정보 중 하드웨어별로 하나를 선택하는 사용자 입력에 기초하여 상기 가상 PC를 구축하고, 선택된 후보 부품 각각의 제원 및 사양을 고려하여 상기 가상 PC의 성능 정보를 생성하는 것인, 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2022-0018722-3-제1항에 있어서,상기 인터페이스부는,사용자가 선택한 후보 부품으로 구성된 조립 PC로부터 조립 PC의 성능 정보를 수신하고, 상기 가상 PC의 성능정보와 비교하여 출력하는 것인, 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 인터페이스부는,상기 조립 PC의 성능 정보와 상기 가상 PC의 성능 정보의 차이를 입력으로 하고, 상기 가상 PC의 성능 정보에대한 피드백 정보를 출력하는 인공지능 모델을 구축하는 것인, 사용자 맞춤형 하드웨어 정보 제공 장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 인공지능 모델은,상기 조립 PC의 성능 정보와 연계된 하드웨어별 제원에 기초하여, 상기 조립 PC의 성능 정보 산출에 대한 강화학습을 수행하고,상기 구축부는,상기 피드백 정보를 고려하여 신규 가상 PC의 성능 정보를 생성하는 것인, 사용자 맞춤형 하드웨어 정보 제공장치."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "사용자 맞춤형 하드웨어 정보 제공 방법에 있어서,조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하는 단계;상기 조립 PC의 하드웨어별로 상기 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하는 단계;상기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축하여 가상 PC의 성능 정보를 생성하는 단계; 및상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 제공하는 단계,를 포함하는 사용자 맞춤형 하드웨어 정보 제공 방법."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 사용자 입력을 수신하는 단계는,사용자의 PC, 노트북, 태블릿 사용이력, 기사용 기기의 사양 정보, 기기 사용 숙련도 및 기기별 선호도를 더 포함하는 사용자 입력을 수신하는 것인, 사용자 맞춤형 하드웨어 정보 제공 방법."}
{"patent_id": "10-2020-0099137", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 후보 부품 정보를 생성하는 단계는,상기 사용 목적, 성능, 희망 구매 견적, 상기 기기 사용 숙련도 및 기기별 선호도에 기초하여 하드웨어별 부품에 가중치를 부여하여, 상기 후보 부품 정보를 생성하는 것인, 사용자 맞춤형 하드웨어 정보 제공 방법.공개특허 10-2022-0018722-4-청구항 12 사용자 맞춤형 하드웨어 정보 제공 시스템에 있어서,사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하고, 상기 조립 PC의 하드웨어별로 상기 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하고, 상기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로가상 PC를 구축하여 가상 PC의 성능 정보를 생성하고, 상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 제공하는 사용자 맞춤형 하드웨어 정보 제공 장치및;조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하고, 가상 PC의 성능 정보 및 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 출력하는 사용자 단말을 포함하는 사용자 맞춤형 하드웨어정보 제공 시스템."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치는, 사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하는 수신부, 상기 조립 PC의 하드웨어별로 상기 사용 목 적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하는 후보 부품 정보 생성부, 상기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축 하여 가상 PC의 성능 정보를 생성하는 구축부 및 상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 제공하는 인터페이스부를 포함할 수 있다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 사용자 맞춤형 하드웨어 정보 제공 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 PC(Personal Computer), 서버 또는 노트북 등과 같은 컴퓨터는 다른 전자 제품에 비해 사용자가 개별 부품 을 쉽게 구매 및 조립이 가능하여 사용자의 접근성이 높은 전자 제품이다. 조립 PC를 구성하고자 하는 경우, 구 매자는 가격, 사용환경, 부품별 조합을 고려하여 조립PC를 선택한다. 이때 구매자는 조립PC의 각 부품에 대한 가격정보, 제품정보, 제품 사용 후기 및 리뷰를 조사하고 이들 로부터 자신에게 최적화된 견적서를 작성한다. 즉, 조립PC를 구매하기 위해서는 상당한 조사기간이 필요하며, PC 및 각 하드웨어에 대한 사전지식이 요구된다. 본원의 배경이 되는 기술은 한국공개특허공보 제10-2017-0032673 호에 개시되어 있다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 사용자가 조립 PC를 구성하려는 목적에 최적화된 조립 PC의 견적을 제공할 수 있는 사용자 맞춤형 하드웨어 정보 제공 장치 및 방법을 제공하는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들도 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정 보 제공 장치는, 사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하는 수신부, 상기 조립 PC의 하드웨어별로 상기 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하는 후보 부품 정보 생성부, 상기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축하여 가상 PC의 성능 정보를 생성하는 구축부 및 상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인 터페이스를 제공하는 인터페이스부를 포함할 수 있다. 본원의 일 실시예에 따르면, 상기 수신부는, 사용자의 PC, 노트북, 태블릿 사용이력, 기사용 기기의 사양 정보, 기기 사용 숙련도 및 기기별 선호도를 더 포함하는 사용자 입력을 수신할 수 있다. 본원의 일 실시예에 따르면, 상기 후보 부품 정보 생성부는, 상기 사용 목적, 성능, 희망 구매 견적, 상기 기기 사용 숙련도 및 기기별 선호도에 기초하여 하드웨어별 부품에 가중치를 부여하여, 상기 후보 부품 정보를 생성 할 수 있다.본원의 일 실시예에 따르면, 상기 후보 부품 정보 생성부는, 가중치가 부여된 상기 후보 부품 상호간의 호환성 을 검증하여 상호 호환 가능한 부품 중심의 후보 부품 정보를 생성하고, 하드웨어별 상기 후보 부품 중 하나를 선택하는 사용자 입력이 수신되면, 선택된 후보 부품과의 시너지 후보 부품이 우선 표시되도록 상기 후보 부품 정보를 업데이트할 수 있다. 본원의 일 실시예에 따르면, 상기 구축부는, 상기 후보 부품 정보 중 하드웨어별로 하나를 선택하는 사용자 입 력에 기초하여 상기 가상 PC를 구축하고, 선택된 후보 부품 각각의 제원 및 사양을 고려하여 상기 가상 PC의 성 능 정보를 생성할 수 있다. 본원의 일 실시예에 따르면, 상기 인터페이스부는, 사용자가 선택한 후보 부품으로 구성된 조립 PC로부터 조립 PC의 성능 정보를 수신하고, 상기 가상 PC의 성능 정보와 비교하여 출력할 수 있다. 본원의 일 실시예에 따르면, 상기 인터페이스부는, 상기 조립 PC의 성능 정보와 상기 가상 PC의 성능 정보의 차 이를 입력으로 하고, 상기 가상 PC의 성능 정보에 대한 피드백 정보를 출력하는 인공지능 모델을 구축할 수 있 다. 본원의 일 실시예에 따르면, 상기 인공지능 모델은, 상기 조립 PC의 성능 정보와 연계된 하드웨어별 제원에 기 초하여, 상기 조립 PC의 성능 정보 산출에 대한 강화 학습을 수행하고, 상기 구축부는, 상기 피드백 정보를 고 려하여 신규 가상 PC의 성능 정보를 생성할 수 있다. 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 방법은, 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하는 단계, 상기 조립 PC의 하드웨어별로 상기 사용 목적, 성능 및 희망 구 매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하는 단계, 상기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축하여 가상 PC의 성능 정보를 생성하 는 단계 및 상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 제공하는 단계를 포함할 수 있다. 본원의 일 실시예에 따르면, 상기 사용자 입력을 수신하는 단계는, 사용자의 PC, 노트북, 태블릿 사용이력, 기 사용 기기의 사양 정보, 기기 사용 숙련도 및 기기별 선호도를 더 포함하는 사용자 입력을 수신할 수 있다. 본원의 일 실시예에 따르면, 상기 후보 부품 정보를 생성하는 단계는, 상기 사용 목적, 성능, 희망 구매 견적, 상기 기기 사용 숙련도 및 기기별 선호도에 기초하여 하드웨어별 부품에 가중치를 부여하여, 상기 후보 부품 정 보를 생성할 수 있다. 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 시스템은, 사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하고, 상기 조립 PC의 하드웨어별로 상기 사용 목 적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품을 포함하는 후보 부품 정보를 생성하고, 상 기 조립 PC의 하드웨어별 상기 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축하여 가상 PC의 성능 정보를 생성하고, 상기 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크하고, 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 제공하는 사용자 맞춤형 하드웨어 정보 제공 장치 및 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신하고, 가상 PC의 성능 정보 및 사용자간 상기 하드웨어의 거래를 위한 인터페이스를 출력하는 사용자 단말을 포함할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 사용자가 조립 PC를 구성하려는 목적에 최적화된 조립 PC의 견적을 제 공할 수 있는 사용자 맞춤형 하드웨어 정보 제공 장치 및 방법을 제공할 수 있다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\" 한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 시스템의 구성을 도시한 도면이다. 도 1을 참조하면, 사용자 맞춤형 하드웨어 정보 제공 시스템은 사용자 맞춤형 하드웨어 정보 제공 장치, 사용자 단말 및 조립 PC를 포함할 수 있다. 사용자 맞춤형 하드웨어 정보 제공 장치는 사용자 맞춤형 하드웨어 정보 제공 장치와 연동되고, 사용자 단말에 설치되는 어플리케이션을 제공할 수 있 다. 또한, 사용자 맞춤형 하드웨어 정보 제공 장치 및 상기 어플리케이션은 사용자 맞춤형 하드웨어 정보 제공 장치를 활용하여 사용자 맞춤형으로 구성된 조립 PC에 설치되는 프로그램과 연동될 수 있다. 사용자 맞춤형 하드웨어 정보 제공 장치는 신규 PC를 구성하려는 사용자에게 사용자가 희망하는 PC의 용도, 성능, 견적에 최적화된 하드웨어로 구성된 조립 PC에 대한 정보를 제공할 수 있다. 사용자 맞춤형 하드웨 어 정보 제공 장치에서 제공된 정보에 기반하여 조립 PC가 구성되면, 사용자 맞춤형 하드웨어 정보 제공 장치는 조립 PC에 설치된 프로그램을 통해 조립 PC의 하드웨어의 성능 및 드라이버 업데이트를 관리할 수 있다. 사용자 단말은 어플리케이션을 통해 사용자가 희망하는 조립 PC의 성능, 용도, 견적을 입력받을 수 있고, 사용자 맞춤형 하드웨어 정보 제공 장치에서 제공된 조립 PC 구성을 위한 정보를 출력할 수 있다. 사용자 맞춤형 하드웨어 정보 제공 장치, 사용자 단말 및 조립 PC 상호간은 네트워크를 통 해 통신할 수 있으며, 네트워크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트 워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워 크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함 되나 이에 한정되지는 않는다.또한, 사용자 단말 및 조립 PC는 스마트폰(Smartphone), 스마트패드(SmartPad), 스마트 TV, 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말 같은 모든 종류의 무선 통신 장치를 포함할 수 있다. 도 2는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치 사용자가 희망하는 의 구성을 도시한 도면이다. 도 2를 참조하면, 사용자 맞춤형 하드웨어 정보 제공 장치는 수신부, 후보 부품 정보 생성부, 구축부 및 인터페이스부를 포함할 수 있다. 수신부는 사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구매 견적을 포함하는 사용자 입력을 수신할 수 있다. 사용자는 사용자 단말에 설치된 어플리케이션을 통해 입력을 수행할 수 있고, 수신부는 사용자 단말로부터 사용자 입력을 수신할 수 있다. 도 3은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 사용자 입력의 예를 도시한 도면이 다. 도 3은 사용자 단말에서 실행되는 어플리케이션을 통한 사용자 입력의 예를 도시한 도면이다. 도 3을 참조 하면, 사용자 단말은 조립 PC의 사용 목적, 성능, 희망 구매 견적에 대한 사용자 입력을 수신할 수 있다. 특히, 희망 구매 견적은 조립 PC의 전체 견적 또는 하드웨어별 견적 중 적어도 하나를 포함할 수 있다. 또한, 수신부는 사용자의 PC, 노트북, 태블릿 사용이력, 기사용 기기의 사양 정보, 기기 사용 숙련도 및 기기별 선호도를 더 포함하는 사용자 입력을 수신할 수 있다. 이 역시, 상기 어플리케이션을 통해 사용자 입력이 수신 될 수 있다. 사용자가 희망하는 조립 PC를 구성함에 있어서, 사용자의 PC를 포함한 기기의 사용 이력, 하드웨어 에 대한 이해도(숙련도) 및 선호도를 더 고려함으로써, 조립 PC의 사용 목적, 성능, 구매 견적 내에서 사용자에 게 최적화된 조립 PC에 대한 견적을 제공할 수 있다. 후보 부품 정보 생성부는 사용자 입력은 사용자가 조립 PC를 구성하면서 희망하는 조건(목적, 성능, 견 적)을 최대한 만족하는 하드웨어별 후보 부품에 대한 정보를 제공할 수 있다. 구체적으로, 후보 부품 정보 생성 부는 조립 PC의 하드웨어별로 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여된 후보 부품 을 포함하는 후보 부품 정보를 생성할 수 있다. 후보 부품 정보 생성부는 하드웨어별로 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치를 부여할 수 있다. 예시적으로, 후보 부품 정보 생성부는 CPU, GPU, RAM, 메인보드, HDD등 각 하드웨어별로 판매중인 부품마다 가중치를 부여할 수 있다. 예시적으로, 후보 부품 정 보 생성부는 하드웨어별 각 부품의 제원 및 가격을 고려하여 사용자가 희망하는 목적, 성능, 견적에 부합 할수록 높은 가중치를 부여할 수 있다. 예를 들어, 음악 작업을 목적으로 하는 경우, 사운드 카드의 성능이 상 대적으로 높은 메인보드에 가중치가 부여될 수 있다. 도 4는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 후보 부품 정보의 예를 도시한 도면 이다. 후보 부품 정보는 각각의 하드웨어별로 복수개의 후보 부품을 선정한 것을 의미한다. 도 4를 참조하면, 하드웨 어 중 CPU에 대한 복수개의 후보 부품이 사용자 단말을 통해 출력될 수 있으며, 이는 CPU 뿐만 아니라, 각 하드웨어별로 동일하게 이루어질 수 있다. 또한, 후보 부품 정보 생성부는 사용 목적, 성능, 희망 구매 견적, 기기 사용 숙련도 및 기기별 선호도에 기초하여 하드웨어별 부품에 가중치를 부여하여, 후보 부품 정보를 생성할 수 있다. 하드웨어별로 다양한 부품 각각은 저가형, 고급형, 전문가형, 범용형 등 제품(부품)의 판매 목적을 가질 수 있다. 후보 부품 정보 생성부 는 전술한 조건(목적, 성능, 견적)에 더불어 사용자의 기기 사용 경험, 숙련도 및 선호도를 더 고려하여 보다 사용자에게 최적화된 후보 부품을 선정할 수 있다. 후보 부품 정보 생성부는 가중치가 부여된 후보 부품 상호간의 호환성을 검증하여 상호 호환 가능한 부품 중심의 후보 부품 정보를 생성할 수 있다. 예시적으로, 메인보드는 소켓별로 호환 가능한 CPU가 상이하며, 메인 보드별로 지원하는 GPU, RAM, HDD, SSD, 슬롯의 종류 및 사양이 상이할 수 있다. 즉, 부품간 호환성 여부를 고 려하지 않고, 하드웨어별 부품만을 선택하는 경우, 부품 상호간 호환되지 않아 조립 PC의 구성이 불가능할 수도 있다. 이에, 후보 부품 정보 생성부는 각 부품의 제원에 기초한 부품간 호환성 여부를 검증하여 가중치를부여된 부품 중 상호 호환 가능한 부품을 포함하는 후보 부품 정보를 생성할 수 있다. 도 4는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 후보 부품 정보의 예를 도시한 도면 이다. 도 4를 참조하면, 제공된 후보 부품 정보에 따라 하드웨어별로 후보 부품이 사용자 단말을 통해 표시될 수 있다. 도 4를 참조하면, 사용자 단말은 후보 부품 중 하나를 선택하는 사용자 입력을 하드웨어 별로 수신 할 수 있다. 후보 부품 정보는 사용자가 설정한 조건에 부합하는 부품에 가중치를 부여할 수 있으므로, 사용자 의 조립 PC 구성 의도에 적합한 부품들이 후보 부품 정보에 포함될 수 있다. 예를 들어, 사용자가 그래픽 작업 용 PC를 구성하고 싶은 경우, 사용자가 설정한 조건 및 기기 사용 숙련도, 기기별 선호도에는 높은 사양의 CPU 및 GPU를 희망하는 사용자의 의도(하드웨어별 견적)가 반영될 수 있다. 이 때, 후보 부품 정보 생성부는 사용자의 의도가 반영된 조건 등을 고려하여 각 부품에 가중치를 부여하므로, 최종적으로 사용자에게 제공되는 후보 부품 정보는 사용자가 조립 PC를 구성하는 목적, 성능, 희망 구매 견적에 최적화된 후보 부품을 포함할 수 있다. 또한, 후보 부품 정보 생성부는 하드웨어별 상기 후보 부품 중 하나를 선택하는 사용자 입력이 수신되면, 선택된 후보 부품과의 시너지 후보 부품이 우선 표시되도록 상기 후보 부품 정보를 업데이트할 수 있다. 시너지 후보 부품이란, 하드웨어의 성능을 보다 끌어 올릴 수 있는 하드웨어 조합을 의미한다. 예를 들어, AMD사의 CPU 는 단일 채널의 RAM으로 구성하는 것보다 듀얼 채널의 RAM으로 구성하는 경우, CPU가 보다 최적화되어 월등한 성능을 발휘한다. 특히, INTEL사의 CPU를 단일 채널의 RAM에서 듀얼 채널의 RAM으로 업그레이드할 때의 성능 향 상치보다 AMD사의 CPU를 단일 채널 RAM에서 듀얼 채널 RAM으로 업그레이드할 때 성능 향상치가 더욱 높다. 따라 서, 후보 부품 정보 생성부는 사용자가 AMD사의 CPU를 선택하는 경우, 나머지 하드웨어 중 RAM 선택시 시 너지 후보 부품으로서 듀얼 채널의 램이 후보 부품 정보에 포함되어 최상단에 표시되도록 후보 부품 정보를 실 시간으로 업데이트 할 수 있다. 상기 예시의 CPU 뿐만 아니라, 하드웨어 상호간 시너지를 발휘하는 다양한 조합 이 있을 수 있으며, 후보 부품 정보 생성부는 사용자가 먼저 선택한 하드웨어를 중심으로 시너지 후보 부 품이 우선 표시되도록 후보 부품 정보를 업데이트 할 수 있다. 또한, 후보 부품 정보 생성부는 시너지 부 품의 경우, 아이콘, 배지 등으로 시너지 부품임을 알리는 식별자를 포함하여 후보 부품 정보를 업데이트 할 수 있다. 도 5는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 후보 부품 정보의 다른 예를 도시한 도면이다. 조립 PC에 대한 경험이 적거나, 하드웨어별 부품에 대해 잘 알지 못하는 사용자의 경우, 사용자 본인이 원하는 조건을 설정하고, 그에 대응하는 후보 부품을 제시 하더라도 하드웨어별로 복수의 후보 부품 중 하나를 선정하 는 것을 어려워 할 수 있다. 이에, 후보 부품 정보 생성부는 각 하드웨어별로 가장 가중치가 높은 하드웨 어를 선별할 수 있다. 도 5를 참조하면, 후보 부품 정보 생성부는 하드웨어별로 가중치가 가장 높은 부품 을 선별하여 조립 PC를 구성하기 위한 모든 하드웨어가 결정된 후보 부품 정보를 제공할 수 있다. 따라서, 사용 자가 PC 및 하드웨어에 대해 초보자 수준이더라도 가중치에 기반하여 사용자의 조립 PC 구성 의도에 가장 최적 화된 조립 PC 의 견적을 제공할 수 있다. 도 6은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 하드웨어별 견적의 예를 도시한 도 면이다. 도 6을 참조하면, 사용자 단말은 사용자가 선택한 하드웨어별 부품을 종합하여 출력할 수 있다. 도면에 도 시되지 않았으나, 각 하드웨어별 부품과 해당 부품별 가격이 함께 출력될 수 있다. 구축부는 조립 PC의 하 드웨어별 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축하여 가상 PC의 성능 정보를 생성할 수 있 다. 가상 PC는 사용자가 최종적으로 선택한 하드웨어별 부품으로 구성된 시뮬레이션 상의 PC이다. 구체적으로, 구축부는 후보 부품 정보 중 하드웨어별로 하나를 선택하는 사용자 입력에 기초하여 가상 PC를 구축하고, 선택된 후보 부품 각각의 제원 및 사양을 고려하여 가상 PC의 성능 정보를 생성할 수 있다. 사용자가 선택한 부 품으로 구성된 가상 PC의 성능은 Fire strike와 같이 기 알려진 벤치마크 어플리케이션을 통해 산출될 수 있다. 예시적으로, 구축부는 가상 PC를 구성하는 하드웨어 별 제원을 벤치마크 어플리케이션에 입력하여, 가상 PC의 성능 정보를 생성할 수 있다. 사용자는 가상 PC의 성능 정보를 통해, 자신이 선택한 하드웨어별 부품에 따 른 조립 PC의 성능이 어느 정도인지 참고할 수 있다. 또한, 사용자는 가상 PC의 성능 정보를 고려하여 하드웨어 를 변경하거나, 구매를 결정할 수 있다.도 7은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 하드웨어 성능 모니터링의 예를 도 시한 도면이다. 인터페이스부는, 구성된 조립 PC에 설치되는 프로그램과 연동하여 하드웨어의 상태 및 성능을 모니터 링하여 사용자 단말을 통해 출력할 수 있다. 이를 통해 사용자는 현재 PC의 상태를 실시간으로 확인할 수 있다. 또한, 인터페이스부는 사용자가 선택한 후보 부품으로 구성된 조립 PC로부터 조립 PC의 성능 정보를 수신하고, 상기 가상 PC의 성능 정보와 비교하여 출력할 수 있다. 전술한 구축부에 의해 생성된 가상 PC의 성능 정보와 가상 PC의 부품으로 실제 구성된 조립 PC의 성능 정보를 비교함으로써, 사용자 맞춤형 하드웨어 정 보 제공 장치의 효용성을 사용자에게 상기시킬 수 있다. 또한, 가상 PC의 성능 정보가 조립 PC의 성능 정 보와 유사할수록 가상 PC를 이용한 성능 파악의 정확도가 향상되므로, 실제 조립 PC를 구매하기 이전에, 사용자 에게 보다 합리적인 소비가 될 수 있도록 PC에 대한 정보를 제공할 수 있다. 또한, 인터페이스부는 조립 PC의 성능 정보와 가상 PC의 성능 정보의 차이를 입력으로 하고, 가상 PC의 성 능 정보에 대한 피드백 정보를 출력하는 인공지능 모델을 구축할 수 있다. 실제 조립 PC의 경우, 조립 PC가 구 동되는 환경적 요인 등 다양한 요인에 의해 가상 PC와는 성능의 차이가 발생할 수 있다. 인터페이스부는 실제 조립 PC 구동시 하드웨어에 대한 정보를 수집할 수 있다. 예를 들어, 인터페이스부는 조립 PC의 하드 웨어별 온도, 사용량, 클럭속도, 팬속도 등 하드웨어에 대한 정보를 수집할 수 있다. 인터페이스부는 상기 정보를 고려하여 조립 PC의 성능 정보와 가상 PC의 성능 정보의 차이를 산출할 수 있고, 이를 인공지능 모델의 입력으로 활용할 수 있다. 예시적으로, 인공지능 모델은 조립 PC의 성능 정보와 연계된 하드웨어별 제원에 기초 하여, 조립 PC의 성능 정보 산출에 대한 강화 학습을 수행할 수 있다. 강화학습이란, 지도 및 비지도 학습처럼 학습 데이터를 사전에 구축할 필요가 없는 기계학습 방법이다. 또한 강 화학습은 외부환경과 상호작용하면서 목표를 달성하는 목표 지향적 기계학습 방법이며, 반복적인 시도를 통해 목표를 달성하는 방법을 습득한다. 다시 말해 강화학습은 행동에 대한 보상을 최대화하기 위해, 주어진 상황에 서 어떻게 행동해야 하는지 배우는 기계학습 기법 중 하나이므로, 다양한 환경에서의 조립 PC의 성능 정보가 존 재하는 상황에서 가장 차이가 적은 가상 PC의 성능 정보를 산출하기에 적합한 기법이라고 할 수 있다. 또한, 구축부는 피드백 정보를 고려하여 신규 가상 PC의 성능 정보를 생성할 수 있다. 인공지능 모델의 강 화 학습을 통해 보다 조립 PC의 성능 정보와 유사한 가상 PC의 성능 정보(성능 정보간의 차이가 줄어들 수 있다.)가 산출될 수 있다. 따라서, 사용자는 보다 실제 조립 PC에 성능과 유사한 가상PC의 성능 정보를 통해 조 립 PC 구축에 활용할 수 있다. 또한, 인터페이스부는 조립 PC의 하드웨어별 드라이브 업데이트 현황을 체크할 수 있다. 인터페이스부 는 각 하드웨어의 제조사에서 제공하는 드라이브의 업데이트 존재여부를 주기적으로 확인할 수 있고, 업데 이트가 존재할 경우, 사용자 단말 또는 조립 PC를 통해 업데이트를 공지할 수 있다. 도 8은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 중고거래 인터페이스의 예를 도시한 도면이다. 도 8을 참조하면, 인터페이스부는 사용자간 하드웨어의 거래를 위한 인터페이스를 제공할 수 있다. 기존의 부품을 처분하고자 하는 사용자를 위해, 인터페이스부는 중고거래를 위한 인터페이스를 제공할 수 있으며, 해당 인터페이스는 하드웨어별로 판매 현황을 표시할 수 있다. 또한, 판매자와 구매자는 판매 또는 구매하고자 하는 하드웨어와 관련된 키워드를 등록할 수 있다. 이에 따라, 인터페이스부는 구매자와 판매자를 연결하 여 보다 용이한 판매 및 구매가 이루어지도록 할 수 있다. 도 9는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 방법의 흐름을 도시한 도면이다. 도 9에 도시된 사용자 맞춤형 하드웨어 정보 제공 방법은 앞선 도1 내지 도 8을 통해 설명된 사용자 맞춤형 하 드웨어 정보 제공 장치에 의하여 수행될 수 있다. 따라서 이하 생략된 내용이라고 하더라도 도 1 내지 도 8을 통해 사용자 맞춤형 하드웨어 정보 제공 장치에 대하여 설명된 내용은 도 8에도 동일하게 적용될 수 있다. 도 9를 참조하면, 단계 S910에서 수신부는 사용자 단말로부터 조립 PC의 사용 목적, 성능 및 희망 구 매 견적을 포함하는 사용자 입력을 수신할 수 있다. 사용자는 사용자 단말에 설치된 어플리케이션을 통해 입력을 수행할 수 있고, 수신부는 사용자 단말로부터 사용자 입력을 수신할 수 있다. 또한, 수신부 는 사용자의 PC, 노트북, 태블릿 사용이력, 기사용 기기의 사양 정보, 기기 사용 숙련도 및 기기별 선호도를 더 포함하는 사용자 입력을 수신할 수 있다. 이 역시, 상기 어플리케이션을 통해 사용자 입력이 수신될 수 있다. 단계 S920에서 후보 부품 정보 생성부는 사용자 입력은 사용자가 조립 PC를 구성하면서 희망하는 조건(목 적, 성능, 견적)을 최대한 만족하는 하드웨어별 후보 부품에 대한 정보를 제공할 수 있다. 구체적으로, 후보 부 품 정보 생성부는 조립 PC의 하드웨어별로 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치가 부여 된 후보 부품을 포함하는 후보 부품 정보를 생성할 수 있다. 후보 부품 정보 생성부는 하드웨어별로 사용 목적, 성능 및 희망 구매 견적에 기초하여 가중치를 부여할 수 있다. 또한, 후보 부품 정보 생성부는 사용 목적, 성능, 희망 구매 견적, 기기 사용 숙련도 및 기기별 선호도에 기초하여 하드웨어별 부품에 가중치를 부여 하여, 후보 부품 정보를 생성할 수 있다. 또한, 후보 부품 정보 생성부는 가중치가 부여된 후보 부품 상호 간의 호환성을 검증하여 상호 호환 가능한 부품 중심의 후보 부품 정보를 생성할 수 있다. 또한, 후보 부품 정 보 생성부는 하드웨어별 상기 후보 부품 중 하나를 선택하는 사용자 입력이 수신되면, 선택된 후보 부품과 의 시너지 후보 부품이 우선 표시되도록 상기 후보 부품 정보를 업데이트할 수 있다. 단계 S930에서 구축부는 조립 PC의 하드웨어별 후보 부품 중 사용자 선택된 후보 부품으로 가상 PC를 구축 하여 가상 PC의 성능 정보를 생성할 수 있다. 가상 PC는 사용자가 최종적으로 선택한 하드웨어별 부품으로 구성 된 시뮬레이션 상의 PC이다. 구체적으로, 구축부는 후보 부품 정보 중 하드웨어별로 하나를 선택하는 사용 자 입력에 기초하여 가상 PC를 구축하고, 선택된 후보 부품 각각의 제원 및 사양을 고려하여 가상 PC의 성능 정 보를 생성할 수 있다. 단계 S940에서 인터페이스부는, 구성된 조립 PC에 설치되는 프로그램과 연동하여 하드웨어의 상태 및 성능을 모니터링하여 사용자 단말을 통해 출력할 수 있다. 이를 통해 사용자는 현재 PC의 상태를 실시간으 로 확인할 수 있다. 또한, 인터페이스부는 사용자가 선택한 후보 부품으로 구성된 조립 PC로부터 조립 PC 의 성능 정보를 수신하고, 상기 가상 PC의 성능 정보와 비교하여 출력할 수 있다. 인터페이스부는 조립 PC 의 성능 정보와 가상 PC의 성능 정보의 차이를 입력으로 하고, 가상 PC의 성능 정보에 대한 피드백 정보를 출력 하는 인공지능 모델을 구축할 수 있다. 또한, 구축부는 피드백 정보를 고려하여 신규 가상 PC의 성능 정보 를 생성할 수 있다. 인공지능 모델의 강화 학습을 통해 보다 조립 PC의 성능 정보와 유사한 가상 PC의 성능 정 보(성능 정보간의 차이가 줄어들 수 있다.)가 산출될 수 있다. 따라서, 사용자는 보다 실제 조립 PC에 성능과 유사한 가상PC의 성능 정보를 통해 조립 PC 구축에 활용할 수 있다. 또한, 인터페이스부는 조립 PC의 하드 웨어별 드라이브 업데이트 현황을 체크할 수 있다. 인터페이스부는 각 하드웨어의 제조사에서 제공하는 드 라이브의 업데이트 존재여부를 주기적으로 확인할 수 있고, 업데이트가 존재할 경우, 사용자 단말 또는 조 립 PC를 통해 업데이트를 공지할 수 있다. 본원의 일 실시 예에 따른, 사용자 맞춤형 하드웨어 정보 제공 방법은, 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이 프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2020-0099137", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다.부호의 설명 10: 네트워크 100: 하드웨어 정보 제공 장치 110: 수신부 120: 후보 부품 정보 생성부 130: 구축부 140: 인터페이스부 200: 사용자 단말 300: 조립 PC"}
{"patent_id": "10-2020-0099137", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 시스템의 구성을 도시한 도면이다. 도 2는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치 사용자가 희망하는 의 구성을 도시한 도면이다. 도 3은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 사용자 입력의 예를 도시한 도면이다. 도 4는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 후보 부품 정보의 예를 도시한 도면 이다. 도 5는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 후보 부품 정보의 다른 예를 도시한 도면이다. 도 6은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 하드웨어별 견적의 예를 도시한 도 면이다. 도 7은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 하드웨어 성능 모니터링의 예를 도 시한 도면이다. 도 8은 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 장치의 중고거래 인터페이스의 예를 도시한 도면이다. 도 9는 본원의 일 실시예에 따른 사용자 맞춤형 하드웨어 정보 제공 방법의 흐름을 도시한 도면이다."}
