{"patent_id": "10-2024-0124519", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0142347", "출원번호": "10-2024-0124519", "발명의 명칭": "인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법 및 이에 사용되는 서비스", "출원인": "그로스벤처스 주식회사", "발명자": "윤기창"}}
{"patent_id": "10-2024-0124519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "(a) 서비스 제공 서버가, 사용자 단말기로부터 회원 가입 정보를 수신하는 단계;(b) 상기 서비스 제공 서버가, 적어도 하나의 외부 서버로부터 지원사업 공고를 수신하는 단계;(c) 상기 서비스 제공 서버가, 상기 지원사업 공고에 포함된 지원 대상자의 자격 조건 정보를 추출하는 단계;및 (d) 상기 서비스 제공 서버가, 상기 회원 가입 정보, 및 상기 지원 대상자의 자격 조건 정보에 기초하여 사용자에게 적합한 지원사업을 선별하는 단계를 포함하는 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법."}
{"patent_id": "10-2024-0124519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 (c) 단계 이후, 상기 (d) 단계 이전에,상기 서비스 제공 서버가, 상기 지원사업을 수행하는 기관의 지원 대상자 선정 내부 가이드 라인을 검색하는 단계를 더 포함하는 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법."}
{"patent_id": "10-2024-0124519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "사용자 단말기로부터 회원 가입 정보를 수신하고, 적어도 하나의 외부 서버로부터 지원사업 공고를 수신하는 수신부; 및상기 지원사업 공고에 포함된 지원 대상자의 자격 조건 정보를 추출하고, 상기 회원 가입 정보, 및 상기 지원대상자의 자격 조건 정보에 기초하여 사용자에게 적합한 지원사업을 선별하는 판단부를 포함하는 서비스 제공 서버."}
{"patent_id": "10-2024-0124519", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 판단부는, 상기 지원사업을 수행하는 기관의 지원 대상자 선정 내부 가이드 라인을 검색하는 것인 서비스제공 서버."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법 및 이에 사용되는 서비스 제공 서버가 개시된 다. 본 발명은, 서비스 제공 서버가, 사용자 단말기로부터 회원 가입 정보를 수신하고, 외부 서버로부터 지원사 업 공고를 수신하며, 지원사업 공고에 포함된 지원 대상자의 자격 조건 정보를 추출하고, 회원 가입 정보, 및 지 원 대상자의 자격 조건 정보에 기초하여 사용자에게 적합한 지원사업을 선별하는 과정을 통해 구현된다. 본 발명 에 따르면, 사업자 또는 예비 창업자 등의 사용자는 자신에게 적합한 지원사업 정보를 자동으로 안내받을 수 있 게 된다. 아울러, 본 발명에 따르면, 사용자는 해당 지원사업에의 선정을 위해 보완이 필요한 사항과 이를 지원 할 컨설턴트를 안내받을 수 있게 됨으로써, 지원사업의 선정 가능성을 높일 수 있게 된다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법 및 이에 사용되는 서비스 제공 서 버에 관한 것으로, 더욱 상세하게는 사업자 또는 예비 창업자 등의 사용자가 자신에게 적합한 지원사업 정보를 자동으로 안내받을 수 있게 될 뿐만 아니라, 해당 지원사업에의 선정을 위해 보완이 필요한 사항과 이를 지원할 컨설턴트를 안내받을 수 있게 됨으로써, 지원사업의 선정 가능성을 높일 수 있도록 하는 인공 지능 및 빅데이터 를 이용한 지원사업 매칭 서비스 제공 방법 및 이에 사용되는 서비스 제공 서버에 관한 것이다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "창업 지원사업, 연구개발 지원사업, 융자/보증/대출 지원사업, 기업인증 지원사업, 투자유치 지원사업, 조달 지 원사업 등과 같은 기업 또는 예비 창업자를 위한 다양한 형태의 정부 또는 민간 주도의 지원 사업들이 수행되고 있다. 그러나, 각종 지원 사업에서의 수혜 대상이 되는 기업 또는 예비 창업자들은 각 지원 사업 공고를 일일이 검색 해야 할 뿐만 아니라, 지원 사업의 신청 조건이 자신에게 부합되는 것인지를 판단함에 있어서도 상당한 시간과 노력을 기울여야 한다. 이러한 이유에서 상당수의 기업 또는 예비 창업자들은 자신에게 해당되는 지원 사업에의 신청 기회 자체를 갖지 못하거나, 지원 사업의 신청 조건을 제대로 분석하지 못한 상태에서 신청함으로써 지원 사업 신청에 헛된 노력 을 기울이게 된다는 문제가 있다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명의 목적은, 사업자 또는 예비 창업자 등의 사용자가 자신에게 적합한 지원사업 정보를 자동으로 안내받을 수 있게 될 뿐만 아니라, 해당 지원사업에의 선정을 위해 보완이 필요한 사항과 이를 지원할 컨설턴트 를 안내받을 수 있게 됨으로써, 지원사업의 선정 가능성을 높일 수 있도록 하는 인공 지능 및 빅데이터를 이용 한 지원사업 매칭 서비스 제공 방법 및 이에 사용되는 서비스 제공 서버를 제공함에 있다. 본 발명의 해결하고자 하는 과제는 언급한 과제로 제한되지 않으며, 이하의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있는 다른 기술적 과제들을 포함한다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법은, (a) 서비스 제공 서버가, 사용자 단말기로부터 회원 가입 정보를 수신하는 단계; (b) 상기 서비스 제공 서버가, 적어도 하나의 외부 서버로부터 지원사업 공고를 수신하는 단계; (c) 상기 서비스 제공 서버가, 상기 지원사업 공고에 포함된 지원 대상자의 자격 조건 정보를 추출하는 단계; 및 (d) 상기 서비스 제공 서버가, 상 기 회원 가입 정보, 및 상기 지원 대상자의 자격 조건 정보에 기초하여 사용자에게 적합한 지원사업을 선별하는 단계를 포함한다. 바람직하게는, 상기 (c) 단계 이후, 상기 (d) 단계 이전에, 상기 서비스 제공 서버가, 상기 지원사업을 수행하 는 기관의 지원 대상자 선정 내부 가이드 라인을 검색하는 단계를 더 포함한다. 또한, (e) 상기 서비스 제공 서버가, 상기 지원사업에서의 잠재적 경쟁자와 상기 사용자를 비교 분석하는 단계 를 더 포함한다. 또한, (f) 상기 서비스 제공 서버가, 상기 비교 분석 정보에 기초하여, 상기 사용자의 지원사업 선정을 위한 컨 설턴트를 선정하는 단계를 더 포함한다. 한편, 본 발명에 따른 서비스 제공 서버는, 사용자 단말기로부터 회원 가입 정보를 수신하고, 적어도 하나의 외 부 서버로부터 지원사업 공고를 수신하는 수신부; 및 상기 지원사업 공고에 포함된 지원 대상자의 자격 조건 정 보를 추출하고, 상기 회원 가입 정보, 및 상기 지원 대상자의 자격 조건 정보에 기초하여 사용자에게 적합한 지 원사업을 선별하는 판단부를 포함한다. 바람직하게는, 상기 판단부는, 상기 지원사업을 수행하는 기관의 지원 대상자 선정 내부 가이드 라인을 검색하 는 것을 특징으로 한다. 또한, 상기 판단부는, 상기 지원사업에서의 잠재적 경쟁자와 상기 사용자를 비교 분석하는 것을 특징으로 한다. 또한, 상기 판단부는, 상기 비교 분석 정보에 기초하여, 상기 사용자의 지원사업 선정을 위한 컨설턴트를 선정 하는 것을 특징으로 한다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 사업자 또는 예비 창업자 등의 사용자는 자신에게 적합한 지원사업 정보를 자동으로 안내받 을 수 있게 된다. 아울러, 본 발명에 따르면, 사용자는 해당 지원사업에의 선정을 위해 보완이 필요한 사항과 이를 지원할 컨설턴 트를 안내받을 수 있게 됨으로써, 지원사업의 선정 가능성을 높일 수 있게 된다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 언급한 효과로 제한되지 않으며, 이하의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있는 다른 효과들을 포함한다."}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명을 보다 상세하게 설명한다. 도면들 중 동일한 구성요소들은 가능한 한 어 느 곳에서든지 동일한 부호들로 나타내고 있음에 유의해야 한다. 또한 본 발명의 요지를 불필요하게 흐릴 수 있 는 공지 기능 및 구성에 대한 상세한 설명은 생략한다. 도 1은 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 시스템의 구성 도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 시스템은 사용자 단말기, 서비스 제공 서버 및 외부 서버를 포함한다. 사용자 단말기는 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스를 이 용하는 개인 사업자, 법인 사업자, 예비 창업자 등의 사용자가 소지하고 있는 PC, 스마트 폰, 태블릿 등의 무선 통신 단말기이다. 이와 같은 사용자 단말기에는 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스를 이용하는 데 필요한 소정의 어플리케이션 프로그램이 설치될 수 있을 것이다. 한편, 서비스 제공 서버는 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서 비스를 제공하는 사업자가 설치 및 운영하는 서버이다. 이와 같은 서비스 제공 서버는 사용자 단말기로부터 회원 가입 정보를 수신하고, 적어도 하나의 외부 서버로부터 지원사업 공고를 수신하며, 지원사업 공고에 포함된 지원 대상자의 자격 조건을 추출하고, 지 원사업을 수행하는 기관의 지원 대상자 선정 내부 가이드 라인을 검색하며, 회원 가입 정보, 지원 대상자의 자 격 조건 및 지원 대상자 선정 내부 가이드 라인 정보에 기초하여 사용자에게 적합한 지원사업을 선별하고, 해당 지원사업에서의 잠재적 경쟁자와 사용자를 비교 분석하며, 비교 분석 결과에 기초하여 사용자의 지원사업 선정 을 위한 컨설턴트를 선별한다. 이와 같은 서비스 제공 서버는 통신망을 통하여 사용자 단말기 및 외부 서버와 통신 가능하도록 구성된다. 통신망은 서비스 제공 서버, 사용자 단말기 및 외부 서버가 서로 접속한 후 패킷 데 이터를 송수신할 수 있도록 접속 경로를 제공한다. 통신망은 예컨대 LANs(Local Area Networks), WANs(Wide Area Networks), MANs(Metropolitan Area Networks), ISDNs(Integrated Service Digital Networks) 등의 유선 네트워크나, 무선 LANs, CDMA, 블루투스, 위성 통신 등의 무선 네트워크를 망라할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 아울러, 서비스 제공 서버는 전적으로 하드웨어이거나, 또는 부분적으로 하드웨어이고 부분적으로 소프트 웨어인 측면을 가질 수 있다. 예컨대, 본 명세서의 서버 및 이에 포함된 각 모듈(module), 부(unit)는, 특정 형식 및 내용의 데이터를 전자통신 방식으로 주고받기 위한 장치 및 이에 관련된 소프트웨어를 통칭할 수 있 다. 한편, 외부 서버는 창업진흥원, 정보통신기획평가원, 한국에너지기술평가원, 한국산업기술평가관리원, 중 소기업기술정보진흥원, 기술보증기금, 신용보증기금 등의 전국 440여개의 정부 사업수행기관에 설치되어 있는 각 서버 또는 대학교, 창업지원단, AC, VC, 민간기업 등의 민간 기관에 설치되어 있는 각 서버가 될 수 있으며, 서비스 제공 서버는 이와 같은 각 외부 서버로부터 지원사업 공고를 주기적으로 수신한다. 또한, 본 발명을 실시함에 있어서, 외부 서버는 올크레딧(KCB), 나이스신용평가(NICE) 등의 신용평가기관 에 설치되어 있는 각 서버가 될 수도 있으며, 서비스 제공 서버는 이와 같은 외부 서버에 사용자의 신용 평가 정보를 요청하여 이를 수신하고, 사용자의 신용 평가 정보가 소정의 기준 등급 이하인지 여부를 판단 함으로써, 사용자의 각 지원사업에의 신청 자격 유무를 1차 판단할 수도 있을 것이다. 아울러, 본 발명을 실시함에 있어서, 지원사업 공고에서의 구체적인 지원사업 내용은, 창업 지원사업, 연구개발 지원사업, 융자/보증/대출 지원사업, 기업인증 지원사업, 투자유치 지원사업, 조달 지원사업 등이 될 수 있을 것이다. 도 2는 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스를 제공하는 서비스 제공 서버의 구조를 나타내는 기능 블록도이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스를 제공하는 서비스 제공 서버는 수신부, 저장부, 판단부 및 송신부를 포함한다. 서비스 제공 서버는 수신부는 사용자 단말기로부터 회원 가입 정보를 수신하고, 외부 서버(30 0)로부터 지원사업 공고, 및 사용자에 대한 신용 평가 정보 등을 수신한다. 한편, 서비스 제공 서버의 판단부는 지원사업 공고에 포함된 지원 대상자의 자격 조건 정보를 추출하 고, 지원사업을 수행하는 기관의 지원 대상자 선정 내부 가이드 라인을 검색하며, 회원 가입 정보, 지원 대상자 의 자격 조건 및 지원 대상자 선정 내부 가이드 라인 정보에 기초하여 사용자에게 적합한 지원사업을 선별하고, 해당 지원사업에서의 잠재적 경쟁자와 사용자를 비교 분석하며, 비교 분석 결과에 기초하여 사용자의 지원사업 선정을 지원하기 위한 컨설턴트를 선별한다. 서비스 제공 서버의 송신부는 사용자에게 매칭된 지원 사업 정보를 포함하는 지원 사업 안내 메시지, 해당 지원사업에서의 사용자와 잠재적 경쟁자의 비교 분석 결과 정보, 및 사용자에게 매칭된 컨설턴트 정보 등 을 사용자 단말기로 송신한다. 한편, 수신부에서의 각종 수신 정보, 판단부에서의 각종 추출 정보, 검색 정보, 분석 정보, 선별 정 보, 및 송신부에서의 각종 송신 정보는 서비스 제공 서버의 저장부에 누적 저장될 수 있을 것이다. 도 3은 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법의 실행 과정을 설명하는 신호 흐름도이다. 이하에서는 도 1 내지 도 3을 참조하여, 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법의 실행 과정을 설명하기로 한다. 먼저, 사용자 단말기에 설치된 어플리케이션을 실행함으로써 서비스 제공 서버에 접속한 상태에서 사 용자가 회원 가입 정보를 사용자 단말기에 입력함에 따라, 서비스 제공 서버는 사용자가 입력한 회원 가입 정보를 포함하는 회원 등록 요청을 사용자 단말기로부터 수신하고, 이를 저장부에 저장한다 (S410). 한편, 본 발명을 실시함에 있어서, 전술한 S410 단계에서의 회원 가입 정보는, 기본 정보, 연구개발 실적 정보, 경영 실적 정보, 투자유치 실적 정보, 관련 사업 정보를 포함할 수 있을 것이다. 구체적으로, 기본 정보에는 예비 창업자의 경우에는 생년월일, 창업 예정 지역, 창업 아이템, 성별, 창업 관련 교육이수 여부 정보, 자격증 정보 등이 포함될 수 있으며, 기존 사업자의 경우에는 회사 설립 연월일, 사업분야, 주 업종 및 업태 정보, 회사명, 사업장 소재지, 사업 아이템, 지원 사업의 담당자 및 연락처 정보, 사업자번호, 법인번호, 대표자 및 연락처 정보가 포함될 수 있을 것이다. 아울러, 연구개발 실적 정보에는 특허 출원 건수 및 등록 건수 등의 지식재산권 정보, 기업부설연구소 유/무 등 의 현황 정보, 연구전담부서 유/무 등의 현황 정보, 직전 4분기 연구 개발인력 비용, 연구원 수, 벤처 인증 관련 정보로서 벤처 인증 유/무 정보, 벤처인증 종류(투자유형, 연구개발, 혁신성장) 정보, 벤처 인증 유효 기간, 벤처 인증을 위한 자가진단 점수, 각종 인증 관련 정보로서 이노비즈, 메인비즈, NEP, NET 등의 각종 인증 취득 여부 정보, 국가과학기술 표준분류 정보, 미래유망신기술(6T), NTRM(비전Ⅰ~Ⅴ), 녹색 기술, 중점 3대 분야, 소 부장사업 등의 기술 분류 정보, 지원사업 수행 관련 정보로서 현재 지원사업 수행 여부 정보, 현재 수행 중인 지원사업 수, 잔여수행기간 정보, 제품/서비스 개발 기간 정보, 제품/서비스 개발 단계(TRL:1~9단계) 정보 등이 포함될 수 있을 것이다. 또한, 경영 실적 정보에는 법인 설림 자금, 자본금, 매출액(전년도, 현재년도 등), 수출액(건수/금액), 종업원 수, 부채비율, 유동비율, 기업신용등급, 경상개발비율, 정부 지원사업 선정 유/무 정보, 기존 대출 정보, 대출 기관, 여성기업, 사회적기업, 강소기업 등의 기업 인증 정보, MOU 건수, NDA, 수상 이력, 조달청 등록기업 해당 여부, 조달청 제품 등록 여부, 코스닥, 코스피, 나스닥 등에서의 기업상장 여부, 국세 및 지방세 체납, 파산기 업 등의 지원 결격 사유 유/무 등의 정보가 포함될 수 있을 것이다. 한편, 투자유치 실적 정보에는 기업 지분 구조, 투자유치 유형 정보(엔젤투자, 프리시드, 시리즈A,B,C 등), 투 자유치 기관, 투자 유치 금액 등이 포함될 수 있을 것이다. 또한, 관련 사업 정보에는, 시장성, 경제성, 기술성 정보, 제품 생산 유/무 정보, 자체 공장 보유 여부, OEM 해 당 여부, 민간 및 정부에서의 시장 발굴(고객수) 정보, 팀원 구성 및 역량 정보, 상용화 제품 수 등이 포함될 수 있을 것이다. 한편, 서비스 제공 서버는 적어도 하나의 외부 서버로부터 지원사업 공고를 주기적으로 수신 및 저장 하고(S420), 각 지원사업 공고에 포함되어 있는 지원 자격 조건을 추출하고, 이를 해당 지원사업 공고와 연관 저장할 수 있을 것이다(S430). 본 발명을 실시함에 있어서, 지원사업 공고로부터 추출되는 지원 자격 조건에는 창업 관련 교육이수 조건, 사업 장 소재지 조건(예를 들면, 경기), 회사 설립 기간 조건(예를 들면, 지원사업 공고일로부터 최근 3년), 특허출 원 완료 또는 특허권 보유 건수 조건, 기업부설연구소 또는 연구전담부서 보유 조건, 지원사업 공고일 기준 벤 처 인증 기업일 것, 이노비즈, 메인비즈, NEP, NET, 각종 인증 취득 기업일 것, 공고일 기준 수행 중인 지원사 업 한도수 조건, 제품/서비스 개발 단계 조건(예를 들면, 3단계 이상), 매출액 최소 기준 조건(전년도, 현재년 도 등), 수출액 최소 기준 조건, 기업신용등급 최소 기준 조건, 여성 기업, 사회적 기업, 조달기업, 조달청 제 품 등록 최소 건수 조건, 코스닥, 코스피, 나스닥 등에서의 상장 기업일 것, 지원 결격 사유 조건(국세 및 지방 세 체납, 파산기업 등), 투자유치 유형 조건(엔젤투자, 프리시드, 시리즈A,B,C 등), 최소 투자 유치 금액 조건, 제품 생산 유/무 관련 조건, 자체 공장 보유 여부 조건 등이 포함될 수 있을 것이다. 한편, 본 발명을 실시함에 있어서, 서비스 제공 서버는 각 지원사업 공고를 관리하는 지원사업 수행기관에 서의 지원사업 선정의 내부 가이드 라인 정보를 저장부를 통해 검색하고, 검색된 내부 가이드 라인 정보를 해당 지원사업 공고에 연관 저장할 수도 있을 것이다(S440). 이를 위해 서비스 제공 서버의 저장부에는 각 수행기관의 내부 가이드 라인 정보가 수행기관 정보와 함께 연관 저장되어 있도록 함이 바람직할 것이다. 본 발명을 실시함에 있어서, 전술한 S440 단계에서의 내부 가이드 라인 정보에는 동점자 처리 기준 정보(예를 들면, 여성 기업 또는 사회적 기업 우선 선정), 투자유치 유형별(엔젤투자, 프리시드, 시리즈A,B,C 등) 가산점 정보 등이 포함될 수 있을 것이다. 한편, 서비스 제공 서버의 판단부는 전술한 S410 단계에서의 회원 가입 정보, 전술한 S430 단계에서 추출 및 저장된 지원 대상자의 자격 조건 정보, 전술한 S440 단계에서 검색된 지원 대상자 선정 내부 가이드 라 인 정보에 기초하여 해당 사용자에게 적합한 지원사업을 하나 이상 선별함으로써, 사용자와 적어도 하나의 지원 사업 공고를 상호 매칭할 수 있을 것이다(S450). 구체적으로, 서비스 제공 서버의 판단부는 전술한 S410 단계에 사용자가 입력한 회원 가입 정보가 개 별 지원사업 공고에서의 각 자격 조건을 충족하는 정도를 백분위 비율(예를 들면, 80%)로 각 지원사업 공고별로 산출함으로써, 사용자의 각 지원사업별 적합도 점수(예를 들면, 80점)를 산출할 수 있을 것이다. 또한, 본 발명을 실시함에 있어서, 서비스 제공 서버의 판단부는 전술한 S410 단계에 사용자가 입력 한 회원 가입 정보가 해당 지원사업 수행기관에서의 지원사업 선정의 내부 가이드 라인에 부합하는지 여부(예를 들면, 동점자 처리 기준인 여성 기업 또는 사회적 기업에의 해당 여부)를 판단함으로써, 부합하는 경우에 해당지원사업의 적합도 점수에 소정의 가산점(예를 들면, 5점)을 추가함으로써 사용자의 각 지원사업별 적합도 점수 (예를 들면, 85점)를 최종 산출할 수도 있을 것이다. 그 다음, 서비스 제공 서버는 각 지원사업별로 최종 산출된 적합도 점수가 높은 순서에 따라 소정의 기준 개수(예를 들면, 1~5개)의 지원사업 공고를 추출하거나, 최종 산출된 적합도 점수가 소정의 기준 점수(예를 들 면, 70점) 이상인 지원 사업 공고를 추출하고, 추출된 지원사업 공고를 포함하는 지원사업 안내 메시지를 사용 자 단말기로 송신할 수도 있을 것이다(S460). 이와 같이 본 발명에 의하면, 사업자 또는 예비 창업자 등의 사용자는 자신에게 적합한 지원사업 정보를 서비스 제공 서버를 통해 자동으로 안내받을 수 있게 된다. 아울러, 본 발명을 실시함에 있어서, 도 4에서와 같이 서비스 제공 서버는 전술한 S450 단계에서 각 지원 사업별로 적합도 점수(즉, 매칭률)를 산출하고, 산출된 적합도 점수(매칭률)에 대해 각 지원사업의 유형별(예를 들면, 사업화, R&D, 금융지원사업, 인증지원사업 등)로 평균값을 산출하고, 이와 같이 산출된 평균값을 포함하 는 지원사업 안내 메시지를 전술한 S460 단계에서 사용자 단말기로 송신할 수도 있을 것이다. 이에 따라, 사용자는 각 지원사업의 유형별(예를 들면, 사업화, R&D, 금융지원사업, 인증지원사업 등)로 산출된 적합도 점수(매칭률)의 평균값을 참고하여, 향후 자신이 신청할 지원사업의 유형을 결정할 수 있을 것이다. 아울러, 본 발명을 실시함에 있어서, 서비스 제공 서버의 판단부는 전술한 S420 단계에서의 지원사업 공고 정보에 기초하여 각 지원사업의 유형별(예를 들면, 사업화, R&D, 금융지원사업, 인증지원사업 등) 평균 지 원금액(예를 들면, 3억원)을 산출할 수 있을 것이다. 이를 위해 전술한 S420 단계에서의 지원사업 공고에는 해당 지원사업에서의 선정시 지원금액 정보가 포함될 수 있을 것이다. 한편, 서비스 제공 서버의 판단부는 각 지원사업의 유형별로 산출된 평균 지원금액과, 상기와 같이 산출된 각 지원사업의 유형별 적합도 점수(매칭률)의 평균값을 각 지원사업의 유형별로 곱함으로써 각 지원사업 의 유형별로 지원금액의 평균 기대값(기대금액)을 산출할 수도 있을 것이다. 아울러, 서비스 제공 서버는 이와 같이 산출된 평균 기대값(기대금액)을 포함하는 지원사업 안내 메시지를 전술한 S460 단계에서 사용자 단말기로 송신할 수도 있을 것이다. 이에 따라, 사용자는 각 지원사업의 유형별로 산출된 지원금액의 평균 기대값(기대금액)을 참고하여, 향후 어떠 한 유형의 지원사업에 신청할 지를 결정할 수 있을 것이다. 한편, 이와 같이 지원사업 안내 메시지를 수신한 사용자가 사용자 단말기의 화면에 표시된 검색창을 통해 지원사업에 대한 각종 문의를 하는 경우 서비스 제공 서버의 판단부는 생성형 AI 및 챗봇을 활용하여 저장부의 빅데이터를 기초로 관련 정보를 사용자에게 제공할 수도 있을 것이다. 구체적으로, 서비스 제공 서버는 상기와 같은 지원사업의 상담 및 문의에 생성형 챗봇을 활용할 수 있으며, 이와 같은 AI 채팅 서비스는 TTS(Text-to-Speech) 데이터 또는 STT(Speech-to-Text) 데이터의 형태로 제공될 수도 있을 것이다. 또한, 본 발명을 실시함에 있어서, 서비스 제공 서버의 판단부는 사용자와의 적합도 점수(예를 들면, 90점)가 가장 높게 산출된 지원사업 공고에 대한 적합도 점수가 동일한 정도(예를 들면, 90점) 또는 그보다 높 게 산출된 다른 사용자를 검색하고, 이와 같이 검색된 다른 사용자를 해당 사용자의 지원사업 선정 과정에서의 잠재적 경쟁자로 분류할 수 있을 것이다. 아울러, 서비스 제공 서버의 판단부는 해당 사용자의 전술한 S410 단계에서의 회원 정보와 잠재적 경 쟁자로 분류된 다른 사용자의 전술한 S410 단계에서의 회원 정보를 정성적/정량적으로 비교 분석함으로써, 해당 사용자의 잠재적 경쟁자 대비 상대적 강점과 약점 정보를 추출할 수 있을 것이다(S470). 아울러, 서비스 제공 서버의 판단부는 상기와 같이 추출된 상대적 약점(예를 들면, 특허 보유 건수, 벤처 인증, 매출액, 조달청 제품 등록 여부) 중에서 해당 지원사업 공고에 조건으로 포함되어 있는 항목을 추출 한 다음, 이와 같이 추출된 항목을 사용자의 지원사업 선정을 위해 보완이 필요한 항목으로 결정할 수도 있을 것이다. 한편, 서비스 제공 서버는 상기와 같이 잠재적 경쟁자 대비 추출된 상대적 강점 및 약점 항목 정보, 및 지 원사업 선정을 위해 보완이 필요한 항목 정보를 포함하는 비교 분석 결과를 사용자 단말기로 송신할 수도 있을 것이다(S480). 한편, 본 발명을 실시함에 있어서, 전술한 S460 단계에서의 지원사업 안내 메시지 또는 전술한 S480 단계에서의 비교 분석 결과에는 추출된 각 지원사업에서의 사용자의 선정 확률 정보가 포함될 수 있을 것이다. 구체적으로, 서비스 제공 서버의 판단부는 전술한 S450 단계에서 각 지원사업별로 최종 산출된 적합 도 점수에 비례하도록 사용자의 선정 확률값을 산출하되, 전술한 S470 단계에서 잠재적 경쟁자로 분류된 다른 사용자의 수에 반비례하도록 선정 확률값을 산출할 수 있을 것이다. 또한, 본 발명을 실시함에 있어서, 서비스 제공 서버의 판단부는 전술한 S470 단계에서의 지원사업 선정을 위해 보완이 필요한 항목 정보에 기초하여 해당 사용자를 위한 컨설턴트 정보를 저장부를 통해 검 색할 수도 있을 것이다(S490). 이를 위해 서비스 제공 서버의 저장부에는 지식재산 출원 및 등록, 벤처 인증 절차, 마케팅, 조달청 제품 등록 절차 등의 각 컨설턴트 별 전문 분야 정보가 컨설턴트의 개인 정보(성명, 연락처 등)와 함께 연관 저 장되어 있도록 함이 바람직할 것이다. 구체적으로, 서비스 제공 서버의 판단부는 전술한 S470 단계에서의 지원사업 선정을 위해 보완이 필 요한 항목이 특허 보유 건수인 경우에는 전문 분야가 지식재산 출원 및 등록인 컨설턴트를 검색하고, 보완이 필 요한 항목이 벤처 인증인 경우에는 전문 분야가 벤처 인증 절차인 컨설턴트를 검색하며, 보완이 필요한 항목이 매출액인 경우에는 마케팅이 전문 분야인 컨설턴트를 검색하고, 보완이 필요한 항목이 조달청 제품 등록인 경우 에는 전문 분야가 조달청 제품 등록 절차인 컨설턴트를 검색할 수 있을 것이다. 이를 위해 서비스 제공 서버의 저장부에는 보완이 필요한 항목 정보별로 컨선털트의 전문 분야 정보 가 맵핑되어 있는 맵핑 테이블이 서비스 제공 서버의 관리자에 의한 추가/삭제/변경 등의 수정 입력이 가 능한 형태로 저장되어 있도록 함이 바람직할 것이다. 서비스 제공 서버는 상기와 같이 검색된 컨설턴트를 해당 사용자를 위한 맞춤형 컨설턴트로 선정함과 아울 러, 선정된 컨설턴트의 전문 분야 정보와 해당 컨설턴트의 개인 정보를 포함하는 컨설턴트 매칭 안내 메시지를 사용자 단말기로 송신할 수도 있을 것이다(S495). 이와 같이 본 발명에 의하면, 사용자는 지원사업에의 선정을 위해 보완이 필요한 항목 뿐만 아니라, 이를 지원 할 컨설턴트를 안내받을 수 있게 됨으로써, 지원사업의 선정 가능성을 높일 수 있게 된다. 한편, 본 발명을 실시함에 있어서, 전술한 S410 단계에서 회원 등록 요청을 송신하는 사용자는 예비 창업자가 될 수 있을 것이며, 이러한 경우에 회원 등록 요청에는 예비 창업자의 성향 정보(예를 들면, 성격 유형 정보)을 파악하기 위해 서비스 제공 서버가 제공한 설문 정보에 대한 예비 창업자의 답변 정보가 포함될 수 있을 것이다. 이러한 경우 서비스 제공 서버의 판단부는 예비 창업자의 답변 정보에 기초하여 예비 창업자의 성향 (예를 들면, 성격 유형 정보)을 분석하고, 분석된 예비 창업자의 성향에 기초하여 해당 예비 창업자를 위한 추 천 창업 분야를 선정할 수 있을 것이다. 이를 위해 서비스 제공 서버에는 각 성격 유형별로 추천 창업 분야 정보가 연관 저장된 맵핑 테이블이 구 비될 수 있을 것이다. 구체적으로, 서비스 제공 서버의 판단부는 예비 창업자의 답변 정보에 기초하여 예비 창업자에 대한 MBTI 등의 성격 유형 정보를 분석하고, 해당 성격 유형 정보와 연관 저장되어 있는 추천 창업 분야를 해당 예비 창업자를 위한 추천 창업 분야(예를 들면, 제조업, 서비스업 등)로 선정할 수 있을 것이다. 이에 서비스 제공 서버의 판단부는 선정된 추천 창업 분야 정보를 사용자 단말기로 송신함으로 써,사용자가 자신에게 추천된 창업 분야와 관련된 지원 사업을 신청토록 유도할 수 있을 것이다. 아울러, 서비스 제공 서버는 전술한 S460 단계에서 지원사업 안내 메시지를 송신함에 있어서, 상기 선정된 추천 창업 분야와 관련된 지원사업 공고를 먼저 추출한 다음, 각 지원사업별로 최종 산출된 적합도 점수가 높은 순서에 따라 소정의 기준 개수(예를 들면, 1~5개)의 지원사업 공고를 추출하거나, 최종 산출된 적합도 점수가 소정의 기준 점수(예를 들면, 70점) 이상인 지원 사업 공고를 추출하고, 추출된 지원사업 공고를 포함하는 지원 사업 안내 메시지를 사용자 단말기로 송신할 수도 있을 것이다.아울러, 본 발명을 실시함에 있어서, 전술한 S410 단계에서 회원 등록 요청을 송신하는 사용자는 본 발명에 따 른 서비스를 통해 컨설팅을 제공하고자 하는 컨설턴트가 될 수 있을 것이며, 이러한 경우에 회원 등록 요청에는 컨설턴트의 자격 유형 정보(예를 들면, 경영지도사, 세무사 등), 소속 기관 정보, 컨설팅 경력 정보(예를 들면, 마케팅 컨설팅, 지재권 컨설팅 등)가 포함될 수 있을 것이다. 이를 위해 서비스 제공 서버에는 각 자격 유형 정보별(예를 들면, 경영지도사, 세무사 등) 전문 활동 분야 가 연관 저장되어 있고, 각 소속 기관별 전문 활동 분야가 연관 저장되어 있으며, 각 컨설팅 경력 정보별(예를 들면, 마케팅 컨설팅, 지재권 컨설팅 등) 전문 활동 분야가 연관 저장된 맵핑 테이블이 구비될 수 있을 것이다. 이러한 경우 서비스 제공 서버의 판단부는 회원 등록 요청에 포함되어 있는 컨설턴트의 자격 유형 정 보와 연관 저장되어 있는 전문 활동 분야를 1차 추출하고, 1차 추출된 전문 활동 분야 중에서 컨설턴트의 소속 기관 정보와 연관 저장되어 있는 전문 활동 분야가 연관 저장되어 있는 전문 활동 분야를 2차 추출하고, 2차 추 출된 전문 활동 분야 중에서 컨설턴트의 컨설팅 경력 정보와 연관 저장되어 있는 전문 활동 분야를 3차 추출하 고, 이와 같이 3차 추출된 전문 활동 분야를 해당 컨설턴트를 위한 추천 전문 활동 분야로 선정할 수 있을 것이다. 이에 서비스 제공 서버는 상기와 같이 선정된 추천 전문 활동 분야 정보를 사용자 단말기로 송신함으 로써, 해당 사용자(컨설턴트)가 자신에게 추천된 전문 활동 분야에서의 컨설팅 활동을 위한 컨설턴트 등록 신청 을 서비스 제공 서버로 송신토록 유도할 수도 있을 것이다. 한편, 본 발명을 실시함에 있어서, 전술한 S470 단계에서 지원사업 선정을 위해 보완이 필요한 항목이 벤처 기 업 인증, 기술혁신형 중소기업 등의 기업 인증 항목인 것으로 판단된 경우에 서비스 제공 서버의 판단부 는 전술한 S490 단계에서 해당 분야의 컨설턴트를 검색하기에 앞서, 해당 인증에 필요한 자격 조건 항목을 저장부를 통해 검색한 다음, 검색된 자격 조건 항목과 전술한 S410 단계에서의 회원 등록 요청에 포함된 회원 가입 정보를 상호 대비함으로써, 해당 자격 조건 항목의 충족율을 산출할 수 있을 것이다. 이에 서비스 제공 서버의 판단부는 산출된 충족율이 소정의 기준 비율(예를 들면, 70%) 이상인 경우 에만 해당 인증 분야의 컨설턴트 검색을 실행하여 전술한 S490 단계를 실행함으로써 컨설턴트의 불필요한 매칭 및 컨설팅 업무 효율 저하를 방지할 수도 있을 것이다. 아울러, 본 발명을 실시함에 있어서, 이후 지원 사업에의 신청에 따라 1차 평가(서류 심사)를 통과함으로써 예 비 선정된 사용자가 사용자 단말기를 통해 해당 지원사업 공고의 식별 정보(예를 들면, 공고 번호)를 입력 함에 따라, 서비스 제공 서버는 사용자 단말기로부터 해당 식별 정보를 포함하는 2차 평가(예를 들면, 대면 발표 평가) 리허설 요청을 수신할 수도 있을 것이다. 이에 서비스 제공 서버는 해당 식별 정보를 포함하는 평가 일정 열람 요청을 외부 서버로 송신함으로 써, 해당 지원 사업의 2차 평가 일정 정보 및 평가 방법 정보(예를 들면, 발표 시간)를 외부 서버로부터 수신할 수 있을 것이다. 이에 서비스 제공 서버는 해당 지원 사업의 2차 평가 일정으로부터 소정의 기준 시간(예를 들면, 48시간) 이전에 사용자 단말기로 2차 평가(예를 들면, 대면 발표 평가) 리허설을 위한 화상 회의 접속 요청을 송신 함으로써, 해당 사용자의 2차 평가 리허설을 진행할 수도 있을 것이다. 이러한 경우 사용자 단말기가 서비스 제공 서버에 접속하여 사용자가 온라인 발표를 시작한 시점으로 부터 상기 평가 방법 정보에 포함되어 있는 소정의 발표 시간(예를 들면, 10분)이 경과된 경우에 서비스 제공 서버는 발표 시간 초과 알림 메시지를 생성하여 사용자 단말기로 송신함으로써, 사용자의 대면 발표 평가 리허설을 지원할 수도 있을 것이다. 또한, 본 발명을 실시함에 있어서, 본 발명에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법을 실행시키는 프로그램은 본 발명에 따른 서비스 제공 서버에 설치되거나 컴퓨터로 읽을 수 있는 각 종 기록 매체에 기록되거나 또는 네트워크를 통해 해당 프로그램을 전송하는 서버에 저장될 수 있을 것이다. 또한, 본 발명에 따른 프로그램은 네트워크로 연결된 컴퓨터 시스템에 분산되어, 분산 방식으로 컴퓨터가 읽을 수 있는 코드가 저장되어 실행될 수도 있으며, 본 발명을 구현하기 위한 기능적인 프로그램, 코드 및 코드 세그 먼트(segment)들은 본 발명이 속하는 기술 분야의 통상의 기술자에 의해 용이하게 이해될 수 있을 것이다. 한편, 본 발명에서의 상술한 단계들(S410~S495)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계 들(S410~S495)간의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있을 것이다. 본 발명에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이상에서는 본 발명의 바람직한 실시예 및 응용예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예 및 응용예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이"}
{"patent_id": "10-2024-0124519", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시 들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2024-0124519", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 시스템의 구성 도, 도 2는 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스를 제공하는 서비스 제공 서버의 구조를 나타내는 기능 블록도, 도 3은 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법의 실행 과정을 설명하는 신호 흐름도, 및 도 4는 본 발명의 일 실시예에 따른 인공 지능 및 빅데이터를 이용한 지원사업 매칭 서비스 제공 방법의 실행 과정에서의 사용자 단말기의 화면 상태를 나타낸 도면이다."}
