{"patent_id": "10-2022-0180782", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0098746", "출원번호": "10-2022-0180782", "발명의 명칭": "시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템", "출원인": "주식회사 다정글로벌", "발명자": "양부림"}}
{"patent_id": "10-2022-0180782", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템으로서,시장 트랜드 데이터로부터 추천 조성물 정보를 제공받기 위한 키워드 정보를 입력받는 입력부;복수의 조성물 제품 중 상기 키워드 정보와 관련된 적어도 일부의 조성물을 추천 조성물로서 선정하는 선정부; 복수의 조성물 제품 중 키워드 정보를 입력받아 추천 조성물로 선정되어 자동으로 설계가 가능한 자동 설계부;및선정된 상기 추천 조성물에 관한 정보를 포함하는 추천 조성물 정보를 사용자 단말의 화면에 표시하는 제어부를포함하는 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템"}
{"patent_id": "10-2022-0180782", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 선정부는,복수의 조성물 정보, 상기 추천 조성물 정보의 제공이 이루어지는 상기 시장 데이터가 추천 조성물의 정보 및복수의 조성물 정보 중 적어도 하나를 입력으로 하는 인공지능 모델을 이용하여 상기 추천 조성물을 선정하고상기 키워드 정보는,사용자가 직접 타이핑함으로써 획득되는 텍스트 관련 제1 유형의 정보, 기 설정된 복수개의 카테고리 중 적어도하나를 선택함으로써 획득되는 카테고리 관련 제2 유형의 정보, 및 사용자에 대한 촬영을 통해 획득되는 사용자이미지 관련 제3 유형의 정보 중 적어도 하나를 포함하는 것인, 시장 트랜드 데이터를 반영한 향수 조성물 설계자동화 방법, 장치 및 시스템"}
{"patent_id": "10-2022-0180782", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 자동 설계부는,상기 화면에 표시된 추천 조성물 중 설계를 희망하는 설계 희망 추천 조성물을 구매하기 위한 사용자 설계 입력이 이루어진 경우, 사용자 설계 입력에 응답하여 상기 조성물의 설계를 요청하는 설계 요청 신호를 생성하여 전송하는 것인, 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템"}
{"patent_id": "10-2022-0180782", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 자동 설계부는,복수의 조성물 정보, 상기 추천 조성물 정보의 제공이 이루어지는 상기 시장 데이터가 추천 조성물의 설계 방법및 복수의 조성물 설계 방법 중 적어도 하나를 입력으로 하는 인공지능 모델을 이용하여 상기 추천 조성물을 선정하는 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템공개특허 10-2024-0098746-3-"}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "일실시예에 시장 트랜드 데이터로부터 추천 조성물 정보를 제공받기 위한 키워드 정보를 입력받는 입력부, 복수 의 조성물 제품 중 상기 키워드 정보와 관련된 적어도 일부의 조성물을 추천 조성물로서 선정하는 선정부, 복수 의 조성물 제품 중 키워드 정보를 입력받아 추천 조성물로 선정되어 자동으로 설계가 가능한 자동 설계부, 선정 된 상기 추천 조성물에 관한 정보를 포함하는 추천 조성물 정보를 사용자 단말의 화면에 표시하는 제어부를 포함 하는 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "향수(perfume)는 사람들에게 패션의 일부이자 자기표현의 수단으로 여겨지고 있다. 그런데, 향수의 경우에는 사 용자들(소비자들)이 매장에서 향수를 직접 시향해 보지 않는 이상, 사용자들이 원하는 향을 찾기 란 쉽지 않다. 한편, 향수는 사용자가 직접 제조하는 친환경 향수, 프리미엄 향수, 수제 향수, 명품 브랜드의 향수 등이 시장 에서 인기가 많은 편인데, 단순히 사용자가 제조하여 판매하였을 때, 실제로 수령하여 본 구매 제품(향수 제 품)이 구매자가 생각한 향과 다르거나 그 크기가 생각했던 것과 다른 경우(예를 들어, 향수 병 크기가 생각했던 것 보다 너무 크거나 작은 경우 등)이 빈번히 발생하게 되어, 결과적으로 사용자가 구매한 향수 제품에 대한 만 족도가 높지 않게 된다. 이러한 경우, 판매자는 반송, 반품 교환되는 등의 상품을 버리거나 사용하지 큰 문제점이 있다 아울러, 이에 시장 데이터를 기반으로 향수 조성물을 추천하고 이를 자동화 설계를 할 수 있도록 하는 시스템의 연구 및 개발이 요구되고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 10-2272390호 (특허문헌 0002) 한국등록특허공보 10-1992411호 (특허문헌 0003) 한국등록특허공보 10-2094378호 비특허문헌"}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "실시예들은 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템을 제공하고자 한다."}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "시장 트랜드 데이터로부터 추천 조성물 정보를 제공받기 위한 키워드 정보를 입력받는 입력부, 복수의 조성물 제품 중 상기 키워드 정보와 관련된 적어도 일부의 조성물을 추천 조성물로서 선정하는 선정부, 복수의 조성물 제품 중 키워드 정보를 입력받아 추천 조성물로 선정되어 자동으로 설계가 가능한 자동 설계부, 선정된 상기 추 천 조성물에 관한 정보를 포함하는 추천 조성물 정보를 사용자 단말의 화면에 표시하는 제어부를 포함하는 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스템을 제공하고자 한다."}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들은 인공지능 모델을 이용한 추천 조성물 정보의 제공뿐만 아니라 시장데이터를 이용해 조성물 정보 데 이터를 제공하고, 복수의 조성물 제품 중 키워드 정보를 입력받아 추천 조성물로 선정되어 자동으로 설계가 가 능한 자동 설계 조성물 추천 장치를 제공함으로써, 사용자가 원하는 향을 설계할 수 있도록 사전에 테스트를 진 행하고, 테스트 결과로 나온 향수 조성물을 기반으로 원하는 향수를 자동으로 설계할 수 있는 효과가 있다. 또한, 실시예들은 전술한 본원의 발명에 따르면, 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법은 사용자가 향수를 제조함에 있어서 보다 쉽게 대량으로 향수를 제조할 수 있으며, 시장 트랜드 데이터를 반영하 여 사용자가 원하는 향수 조성물을 제조할 수 있는 효과가 있다. 또한, 실시예들은 전술한 본원의 발명에 따르면, 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법은, 종래에 사용자가 직접 제조하여 오랜시간이 소요되어 많은 인건비가 발생한 문제점이 있었으나, 전술한 본원의 발명은 이를 방지하여 인건비를 절약할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 첨부된 도면을 참조하여 실시예들을 상세하게 설명한다. 그러나, 실시예들에는 다양한 변경이 가해 질 수 있어서 특허출원의 권리 범위가 이러한 실시예들에 의해 제한되거나 한정되는 것은 아니다. 실시예들에 대한 모든 변경, 균등물 내지 대체물이 권리 범위에 포함되는 것으로 이해되어야 한다. 실시예들에 대한 특정한 구조적 또는 기능적 설명들은 단지 예시를 위한 목적으로 개시된 것으로서, 다양한 형 태로 변경되어 실시될 수 있다. 따라서, 실시예들은 특정한 개시형태로 한정되는 것이 아니며, 본 명세서의 범 위는 기술적 사상에 포함되는 변경, 균등물, 또는 대체물을 포함한다. 제1 또는 제2 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성요소 를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 한다. 예를 들어, 제1 구성요소는 제2 구성요소로 명 명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 실시예에서 사용한 용어는 단지 설명을 목적으로 사용된 것으로, 한정하려는 의도로 해석되어서는 안된다. 단 수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또 는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 실시예가 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조부호를 부여 하고 이에 대한 중복되는 설명은 생략하기로 한다. 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적 인 설명이 실시예의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하며, 본 발명이 속하"}
{"patent_id": "10-2022-0180782", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 본 발명의 실시예들에서, 별도로 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사 용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것 과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문 맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 실시예에서 명백하게 정의하 지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 실시예를 설명하기 위한 도면에 개시된 형상, 크기, 비율, 각도, 개수 등은 예시적인 것이므로 본 발 명이 도시된 사항에 한정되는 것은 아니다. 또한, 본 발명을 설명함에 있어서, 관련된 공지 기술에 대한 구체 적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명은 생략한다. 본 명세 서 상에서 언급된 '포함한다', '갖는다', '이루어진다' 등이 사용되는 경우 '~만'이 사용되지 않는 이상 다른 부분이 추가될 수 있다. 구성 요소를 단수로 표현한 경우에 특별히 명시적인 기재 사항이 없는 한 복수를 포함 하는 경우를 포함한다. 구성 요소를 해석함에 있어서, 별도의 명시적 기재가 없더라도 오차 범위를 포함하는 것으로 해석한다. 위치 관계에 대한 설명일 경우, 예를 들어, '~상에', '~상부에', '~하부에', '~옆에' 등으로 두 부분의 위치 관 계가 설명되는 경우, '바로' 또는 '직접'이 사용되지 않는 이상 두 부분 사이에 하나 이상의 다른 부분이 위치 할 수도 있다. 소자(elements) 또는 층이 다른 소자 또는 층\"위(on)\"로 지칭되는 것은 다른 소자 바로 위에 또는 중간에 다른 층 또는 다른 소자를 개재한 경우를 모두 포함한다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 도면에서 나타난 각 구성의 크기 및 두께는 설명의 편의를 위해 도시된 것이며, 본 발명이 도시된 구성의 크기 및 두께에 반드시 한정되는 것은 아니다. 본 발명의 여러 실시예들의 각각 특징들이 부분적으로 또는 전체적으로 서로 결합 또는 조합 가능하며, 당업자 가 충분히 이해할 수 있듯이 기술적으로 다양한 연동 및 구동이 가능하며, 각 실시예들이 서로에 대하여 독립적 으로 실시 가능할 수도 있고 연관 관계로 함께 실시 가능할 수도 있다. 도 1은 본 발명의 일 실시예에 따른 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스 템의 블록도이다. 도 1을 참조하면, 본 시스템은 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 장치, 사용자 단말, 및 조성물 거치부를 포함할 수 있다. 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 장치는 본원의 일 실 시예에 따른 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 장치로서, 이하에서는 설명의 편의상 조성 물 설계 자동 장치라 하기로 한다. 조성물 설계 자동 장치는 사용자로부터 추천 조성물 정보를 제공받기 위한 키워드 정보를 입력받고, 복수의 조 성물 제품 중 키워드 정보와 관련된 적어도 일부의 조성물 제품을 추천 조성물 제품으로서 선정하고, 선정된 추 천 조성물 제품에 관한 정보를 포함하는 추천 조성물 정보를 사용자 단말의 화면에 표시할 수 있다. 조성물 설계 자동 장치는 사용자 단말과 연동(연결)될 수 있다. 여기서, 일예로 조성물 설계 자동 장치가 사용 자 단말과 연동(연결)된다라 함은, 조성물 설계 자동 장치에 의한 조성물 추천 방법이 사용자 단말에서 실행 가 능한 프로그램 혹은 애플리케이션의 형태로 구현 가능한 경우일 때, 사용자 단말에 설치됨에 따라 사용자 단말 에 의해 동작 제어가 가능한 경우(상태)를 의미할 수 있다. 다른 일예로, 조성물 설계 자동 장치가 사용자 단말과 연동된다라 함은, 조성물 설계 자동 장치가 사용자 단말 과 별개의 구성으로 마련되는 경우일 때, 조성물 설계 자동 장치가 사용자 단말과 네트워크를 통해 연결됨에 따라 사용자 단말에 의하여 원격으로 동작 제어가 가능한 경우(상태)를 의미할 수 있다. 사용자 단말은 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 장치(조성물 설계 자동 장치, )와 연동되 어 조성물 설계 자동 장치의 동작 제어를 위한 제어 신호를 사용자로부터 입력받아 제공할 수 있다.사용자 단말은 일예로 사용자로부터 키워드 정보를 입력받을 수 있으며, 입력받은 키워드 정보를 조성물 설계 자동 장치의 입력부로 제공할 수 있다. 이에 따라, 입력부는 키워드 정보를 사용자 단말을 통해 사용자로부터 입력받을 수 있다. 이 외에도, 사용자 단말은 조성물 설계 자동 장치의 각종 동작을 제어(원격으로 제어)할 수 있다. 도 2는 본 발명의 일 실시예에 따른 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스 템의 실시예이다. 도 2를 참조하면, 조성물 설계 자동 장치는 입력부, 선정부, 제어부, 예측부, 자동 설계부를 포함할 수 있다. 입력부는 사용자로부터 추천 조성물 정보를 제공받기 위한 키워드 정보를 입력받을 수 있다. 선정부는 복수의 조성물 제품 중 입력부에서 입력받은 키워드 정보와 관련된 적어도 일부의 조성물 제품을 추천 조성물 제품으로서 선정할 수 있다. 여기서, 복수의 조성물 제품은 일예로 온라인 쇼핑몰 상에서 판매, 거래되 는 각종 조성물 제품을 의미할 수 있다. 선정부는 복수의 조성물 제품 정보(복수의 조성물 제품 각각에 관한 정보), 추천 조성물 정보의 제공이 이루어 지는 사용자인 추천 사용자의 정보(나이, 선호하는 향 등) 및 복수의 사용자 정보 중 적어도 하나를 입력으로 하는 학습된 인공지능 모델을 이용하여 추천 조성물 제품을 선정할 수 있다. 제어부는, 선정부에서 선정된 추천 조성물 제품에 관한 정보를 포함하는 추천 조성물 정보를 사용자 단말의 화 면에 표시할 수 있다. 이를 통해, 사용자는 사용자 단말의 화면을 통해 추천 조성물 정보를 볼 수 있다. 또한, 제어부는 조성물 설계 자동 장치의 각 부의 동작을 제어할 수 있다. 선정부는 인공지능 모델을 이용하여 추천 조성물 제품을 선정할 수 있고, 제어부는 인공지능 모델을 이용하여 선정(추천)되는 추천 조성물 제품에 관한 정보를 추천 조성물 정보로서 사용자 단말의 화면에 표시할 수 있다. 제어부는 사용자 단말의 화면에 표시된 추천 조성물 제품 중 구매를 희망하는 추천 조성물 제품을 구매하기 위 한 사용자 구매 입력이 이루어진 경우, 사용자 구매 입력에 응답하여 추천 조성물 제품의 구매를 요청하는 구매 요청 신호를 생성하여 전송할 수 있다. 예측부는 추천 조성물 제품에 대한 구매가 이루어지고, 구매가 이루어진 구매 조성물 제품을 포함한 사용자가 소유한 소유 조성물 제품 중 어느 하나의 소유 조성물 제품에 대한 사용이 감지되면, 사용이 감지된 사용 감지 시점을 기준으로 사용이 감지된 소유 조성물 제품의 향 지속 시간을 예측하고, 예측된 향 지속 시간 정보를 제 공할 수 있다. 예측부는 예측된 향 지속 시간 정보가 사용자 단말의 화면에 표시되도록 제공할 수 있다. 자동설계부는 복수의 조성물 제품 중 키워드 정보를 입력받아 추천 조성물로 선정되어 자동으로 설계가 가 능하다. 자동설계부는 시장 트랜드 데이터를 반영하여 복수의 조성물을 설계하고, 이를 기반으로 추천 조성물로 선 정된 조성물을 자동으로 설계가 가능하다. 도 3은 일실시예에 따른 장치의 구성의 예시도이다. 이상 첨부된 도면을 참조하여 본 발명의 실시예들을 더욱 상세하게 설명하였으나, 본 발명은 반드시 이러한 실시예로 국한되는 것은 아니고, 본 발명의 기술사상을 벗어 나지 않는 범위 내에서 다양하게 변형 실시될 수 있다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위 가 한정되는 것은 아니다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 청구범위의 범위에 속한다. 부호의 설명도면 도면1 도면2 도면3"}
{"patent_id": "10-2022-0180782", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스 템의 블록도이다. 도 2는 본 발명의 일 실시예에 따른 시장 트랜드 데이터를 반영한 향수 조성물 설계 자동화 방법, 장치 및 시스 템의 실시예이다. 도 3은 일실시예에 따른 장치의 구성의 예시도이다."}
