{"patent_id": "10-2023-0041057", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0146285", "출원번호": "10-2023-0041057", "발명의 명칭": "사용자 단말에서 메시지 분석 장치 및 방법", "출원인": "한국전자통신연구원", "발명자": "이성희"}}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말에서 메시지 분석 장치에 있어서,상기 사용자 단말의 채팅 앱 대화 화면을 주기적으로 캡쳐하여 대화 화면 이미지 형태로 수집하는 대화 정보 수집부;상기 대화 화면 이미지에서 관심 객체를 추출하고, 텍스트 정보를 포함하는 이미지 형태의 관심 객체에서 텍스트를 추출하고, 및 상기 텍스트 및 대화 중 주고받은 이미지 객체를 이용하여 분석이 가능한 대화 형태로 복원하는 대화 정보 추출 및 복원부;상기 복원된 데이터를 저장하는 복원 대화 DB(database); 및상기 복원 대화 DB에서 추출된 데이터에 인공지능 모델을 적용하여 대화 내용과 미디어의 유해성을 분석하는 대화 정보 분석부를 포함하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 대화 정보 수집부는,대화 화면 분류 모델을 이용하여 상기 사용자 단말의 채팅 앱 대화 화면을 수집하는 화면 수집부; 및대화 중 사용자에 의해 다운로드된 파일 정보를 수집하는 파일 수집부를 포함하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 대화 정보 추출 및 복원부는,상기 대화 화면 이미지에서 상기 관심 객체를 추출하는 관심 객체 추출부;상기 관심 객체 중 이미지 형태의 텍스트 정보를 텍스트로 변환하는 문자 인식부; 및상기 관심 객체를 기반으로 하여 채팅 앱의 종류 별로 하나의 대화방 당 하나의 복원 대화를 갖도록 구성하는대화 복원부를 포함하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 관심 객체 추출부는,상기 대화 화면 이미지에서 관심 객체 탐지 모델을 이용하여 관심 객체를 탐지하고, 각 객체의 위치 및 라벨 정보를 획득하도록 구성되고,상기 관심 객체는, 대화 텍스트를 포함하는 말풍선 영역, 화자 텍스트 정보가 포함된 영역, 시간 정보가 포함된영역, 그리고 채팅 화면에 보이는 이미지 영역 중 적어도 하나를 포함하고,상기 텍스트 정보는, 대화 텍스트, 화자, 시간 중 적어도 하나를 포함하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 관심 객체 중 이미지는 별도로 파일로 저장되고, 파일명, 파일 위치, 저장 시간을 포함하는 파일 정보는상기 관심 객체와 함께 관리되는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서, 상기 문자 인식부는,공개특허 10-2024-0146285-3-상기 텍스트 정보가 포함된 객체에서 텍스트 정보를 추출하여 객체 정보와 함께 관리하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 상기 대화 정보 분석부는,대화 유해성 탐지 모델을 이용하여 상기 복원 대화 DB에 저장된 복원 대화 데이터의 대화 텍스트의 의도를 분석하여 유해 단계를 판단하는 대화 유해성 탐지부; 및미디어 유해성 탐지 모델을 이용하여 상기 복원 대화 DB에 저장된 이미지/오디오/파일을 불러와서 유해 단계를판단하는 미디어 유해성 탐지부를 포함하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 대화 유해성 탐지부의 대화 유해 단계 판단 결과와 상기 미디어 유해성 탐지부의 유해 단계 판단 결과를기반으로 사이버 범죄 노출 단계를 판단하고 일정 단계 이상일 때 상기 사용자 단말로 알림을 전송하는 복합 유해성 분석부를 더 포함하는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 대화 정보 추출 및 복원부 및 대화 정보 분석부의 동작 주기는 상기 사용자 단말의 배터리 잔량에 따라 변경되는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 대화 정보 추출 및 복원부 및 대화 정보 분석부의 동작 주기는 미리 지정된 간격 또는 상기 사용자 단말의프로세서 또는 메모리 사용량에 따라 변경되는, 사용자 단말에서 메시지 분석 장치."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "사용자 단말에서 메시지 분석 방법에 있어서,대화 정보 수집부에서, 상기 사용자 단말의 채팅 앱 대화 화면을 주기적으로 캡쳐하여 대화 화면 이미지 형태로수집하는 과정;대화 정보 추출 및 복원부에서, 상기 대화 화면 이미지에서 관심 객체를 추출하고, 텍스트 정보를 포함하는 이미지 형태의 관심 객체에서 텍스트를 추출하고, 및 상기 텍스트 및 대화 중 주고받은 이미지 객체를 이용하여분석이 가능한 대화 형태로 복원하는 과정;복원 대화 DB에서, 상기 복원된 데이터를 저장하는 과정; 및대화 정보 분석부에서, 상기 복원 대화 DB에서 추출된 데이터에 인공지능 모델을 적용하여 대화 내용과 미디어의 유해성을 분석하는 과정을 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 수집하는 과정은,대화 화면 분류 모델을 이용하여 상기 사용자 단말의 채팅 앱 대화 화면을 수집하는 과정; 및대화 중 사용자에 의해 다운로드된 파일 정보를 수집하는 과정을 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 복원하는 과정은,공개특허 10-2024-0146285-4-상기 대화 화면 이미지에서 상기 관심 객체를 추출하는 과정;상기 관심 객체 중 이미지 형태의 텍스트 정보를 텍스트로 변환하는 과정; 및상기 관심 객체를 기반으로 하여 채팅 앱의 종류 별로 하나의 대화방 당 하나의 복원 대화를 갖도록 구성하는과정을 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 관심 객체를 추출하는 과정은,상기 대화 화면 이미지에서 관심 객체 탐지 모델을 이용하여 관심 객체를 탐지하는 과정; 및각 객체의 위치 및 라벨 정보를 획득하는 과정을 포함하고,상기 관심 객체는, 대화 텍스트를 포함하는 말풍선 영역, 화자 텍스트 정보가 포함된 영역, 시간 정보가 포함된영역, 그리고 채팅 화면에 보이는 이미지 영역 중 적어도 하나를 포함하고,상기 텍스트 정보는, 대화 텍스트, 화자, 시간 중 적어도 하나를 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 관심 객체 중 이미지는 별도로 파일로 저장되고, 파일명, 파일 위치, 저장 시간을 포함하는 파일 정보는상기 관심 객체와 함께 관리되는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서, 상기 텍스트로 변환하는 과정은,상기 텍스트 정보가 포함된 객체에서 텍스트 정보를 추출하여 객체 정보와 함께 관리하는 과정을 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서, 상기 분석하는 과정은,대화 유해성 탐지부에서, 대화 유해성 탐지 모델을 이용하여 상기 복원 대화 DB에 저장된 복원 대화 데이터의대화 텍스트의 의도를 분석하여 유해 단계를 판단하는 과정; 및미디어 유해성 탐지부에서, 미디어 유해성 탐지 모델을 이용하여 상기 복원 대화 DB에 저장된 이미지/오디오/파일을 불러와서 유해 단계를 판단하는 과정을 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 대화 유해성 탐지부의 유해 단계 판단 결과와 상기 미디어 유해성 탐지부의 유해 단계 판단 결과를 기반으로 사이버 범죄 노출 단계를 판단하고 일정 단계 이상일 때 상기 사용자 단말로 알림을 전송하는 과정을 더 포함하는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 대화 정보 추출 및 복원부 및 대화 정보 분석부의 동작 주기는 단말의 배터리 잔량에 따라 변경되는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 대화 정보 추출 및 복원부 및 대화 정보 분석부의 동작 주기는 미리 지정된 간격 또는 단말의 프로세서 또공개특허 10-2024-0146285-5-는 메모리 사용량에 따라 변경되는, 사용자 단말에서 메시지 분석 방법."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 실시 예는, 사용자 단말에서 메시지 분석 장치에 있어서, 상기 사용자 단말의 채팅 앱 대화 화면을 주 기적으로 캡쳐하여 대화 화면 이미지 형태로 수집하는 대화 정보 수집부; 상기 대화 화면 이미지에서 관심 객체 를 추출하고, 상기 대화 화면 이미지에서 텍스트를 추출하고, 및 상기 관심 객체 및 텍스트를 이용하여 분석이 가능한 형태로 복원하는 대화 정보 추출 및 복원부; 상기 복원된 데이터를 저장하는 복원 대화 DB(database); 및 상기 복원 대화 DB에서 추출된 데이터에 인공지능 모델을 적용하여 대화 내용과 미디어의 유해성을 분석하는 대 화 정보 분석부를 포함한다."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 사용자 단말에서 메시지 분석 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구성하는 것이 아니 다. 스마트 기기의 확산과 온라인 서비스 기술의 발전으로 유해 콘텐츠 유포, 온라인 그루밍(Online Grooming) 그리 고 사이버불링(Cyberbullying) 등 채팅 앱을 통한 사이버 범죄가 사회 문제로 대두되고 있다. 이러한 사이버 범 죄는 피해자 대다수가 10대이며, 가해자가 피해자에게 서서히 호감을 갖게 하고, 신뢰 관계를 형성한 후 범죄를 저지르기 때문에 문제가 심각해질 때까지 스스로 문제를 인지하지 못한다. 또한 사이버 범죄는 개인 단말을 타 인이 물리적으로 24시간 감시할 수 없고, 개인 사생활 침해 문제가 있기 때문에 예방이 어려워 신고에 의한 사 후 대응에만 의존했다. 사용자 단말에서 채팅 앱을 통한 사이버 범죄 피해를 예방하기 위해서는 사용자 개인 정 보가 외부로 유출되지 않도록 사용자 단말 내에서 사용자가 채팅 앱을 통해 주고받은 대화와 미디어들을 분석하 여 위험성을 탐지하고 본인 및 보호자에게 알려주는 기술이 필요하다."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는, 스마트폰 등 사용자 단말에서 채팅 앱을 통한 사이버 범죄를 탐지 및 예방하기 위해 사용자 대화 정 보를 수집하고, 분석이 가능한 형태로 변환하고, 변환된 대화 정보를 이용하여 대화의 유해성과 대화 중 주고받 은 미디어(이미지/비디오/오디오 등)의 유해성을 분석하는 장치 및 방법을 제공한다. 본 개시는, 이상 징후 또는 유해성 탐지 결과에 따라 단계적으로 사용자 및 사용자의 보호자에게 위험성을 알리 고 채증하는 장치 및 방법을 제공한다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제 들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예는, 사용자 단말에서 메시지 분석 장치에 있어서, 상기 사용자 단말의 채팅 앱 대화 화면을 주기적으로 캡쳐하여 대화 화면 이미지 형태로 수집하는 대화 정보 수집부; 상기 대화 화면 이미지에서 관심 객 체를 추출하고, 텍스트 정보를 포함하는 이미지 형태의 관심 객체에서 텍스트를 추출하고, 및 상기 관심 객체 및 텍스트를 이용하여 분석이 가능한 대화 형태로 복원하는 대화 정보 추출 및 복원부; 상기 복원된 데이터를 저장하는 복원 대화 DB(database); 및 상기 복원 대화 DB에서 추출된 데이터에 인공지능 모델을 적용하여 대화 내용과 미디어의 유해성을 분석하는 대화 정보 분석부를 포함한다. 본 개시의 실시 예는, 사용자 단말에서 메시지 분석 방법에 있어서, 대화 정보 수집부에서, 상기 사용자 단말의 채팅 앱 대화 화면을 주기적으로 캡쳐하여 대화 화면 이미지 형태로 수집하는 과정; 대화 정보 추출 및 복원부 에서, 상기 대화 화면 이미지에서 관심 객체를 추출하고, 텍스트 정보를 포함하는 이미지 형태의 관심 객체에서 텍스트를 추출하고, 및 상기 관심 객체 및 텍스트를 이용하여 분석이 가능한 대화 형태로 복원하는 과정; 복원 대화 DB에서, 상기 복원된 데이터를 저장하는 과정; 및 대화 정보 분석부에서, 상기 복원 대화 DB에서 추출된 데이터에 인공지능 모델을 적용하여 대화 내용과 미디어의 유해성을 분석하는 과정을 포함한다."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는, 사용자 단말에서 발생하는 특성 때문에 탐지 및 예방이 어려웠던 온라인 그루밍, 사이버 폭력 등의 사이버 범죄 발생을 감소시킬 수 있다. 본 개시의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일부 실시예들을 예시적인 도면을 이용해 상세하게 설명한다. 각 도면의 구성 요소들에 참조 부호를 부가함에 있어서, 동일한 구성 요소들에 대해서는 비록 다른 도면 상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 개시를 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다.` 본 개시에 따른 실시예의 구성요소를 설명하는 데 있어서, 제1, 제2, i), ii), a), b) 등의 부호를 사용할 수 있다. 이러한 부호는 그 구성요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 부호에 의해 해당 구성요소의 본질 또는 차례나 순서 등이 한정되지 않는다. 명세서에서 어떤 부분이 어떤 구성요소를 '포함' 또는 '구비'한 다고 할 때, 이는 명시적으로 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 개시의 예시적인 실시형태를 설명하고자 하는 것이며, 본 개시가 실시될 수 있는 유일한 실시형태를 나타내고자 하는 것이 아니다. 사용자 단말에서 채팅 앱을 통해 주고받은 대화와 미디어들을 분석하기 위해서는 먼저, 대화 상대방, 대화 텍스 트, 시간 그리고 사진/다운로드 파일 등의 미디어 정보를 구분하여 수집할 수 있어야 하며, 수집된 대화 문장의 키워드와 의도, 그리고 동영상/이미지/오디오 등의 미디어를 분석하여 유해 여부를 판단할 수 있어야 한다. 그러나 대부분의 채팅 앱에서는 사용자의 대화 정보를 앱 외부에 제공하지 않기 때문에 다양한 채팅 앱에서 사 용자의 대화를 분석하기 위해서는 대화 화면을 이미지 형태로 캡쳐하고, 대화 화면 이미지 내에서 사용자가 주 고받은 문장과 이미지 영역을 분리하고, 이미지 형태의 대화 문장을 텍스트 형태의 대화로 복원하는 기술이 필 요하다. 또한 이미지 영역과 주고받은 다운로드 파일을 수집하여 복원된 대화와 연결지어 대화의 유해성과 미디 어의 유해성을 분석하고, 분석 결과를 통하여 사이버 범죄 노출 여부를 판단하는 기술이 필요하다. 본 개시의 실시 예는 사용자 단말에서 온라인 그루밍, 집단 괴롭힘 그리고 음란물 유포 등의 사이버 범죄를 탐 지하기 위해서 채팅 앱을 통해 주고받은 메시지를 분석하는 장치 및 방법을 제공한다. 이를 위해 본 개시의 실 시 예는 사용자 단말에서 대화 화면을 캡쳐하고, 캡쳐된 대화 이미지에서 주고받은 텍스트, 이미지 그리고 파일 정보를 추출하여 대화의 의도와 유해성을 분석하고, 다운받은 파일의 유해성을 분석하여 사이버 범죄를 탐지하 는 장치 및 방법을 제안한다. 본 개시의 실시 예는 스마트폰 등 사용자 단말에서 채팅 앱 대화를 분석하기 위하 여 채팅 앱 대화 화면을 주기적으로 캡쳐하고, 캡쳐된 대화 이미지 내에서 대화 분석에 필요한 미디어 영역(화 자, 대화 내용, 시간, 이미지, 파일 등)을 탐지하여 분리하기 위한 객체 탐지 기술, 이미지 형태의 문장을 텍스 트로 변환하기 위한 OCR(Optical Character Recognition) 기술, 그리고 수집된 대화 텍스트 및 주고받은 이미 지/동영상/오디오를 분석이 가능한 데이터 형태로 생성하는 메타데이터 생성기술, 대화 내용의 유해성을 분석하 는 자연어 처리기술, 그리고 이미지/동영상/오디오의 유해성을 판단하기 위한 분류(Classification) 기술과 관 련된다. 본 명세서에서 관심 객체는 이미지 형태로 캡쳐된 대화 화면 이미지에서 객체 검출을 통해 검출된 객체들을 의 미할 수 있다. 관심 객체는 예컨대, 대화 텍스트를 포함하는 말풍선 영역, 화자 텍스트 정보가 포함된 영역, 시 간 정보가 포함된 영역, 그리고 채팅 화면에 보이는 이미지 영역 등을 포함할 수 있다. 도 1은 본 개시의 실시 예에 따른 사용자 단말에서 메시지 분석 장치 블록 구성도이다. 본 개시의 실시 예에 따른 사용자 단말에서 메시지 분석 장치는, 도 1을 참조하면, 사용자 단말 대화 분석기 , 대화 화면 분류 학습기, 관심 객체 탐지 학습기, 대화 유해성 탐지 학습기, 그리고 미디 어 유해성 탐지 학습기 등을 포함하여 구성될 수 있다. 사용자 단말 대화 분석기는 사용자의 채팅 앱 대화 화면을 이미지 형태로 저장하고, 이미지 형태의 대화에 서 관심 정보(예컨대, 누구와 어떤 내용의 대화를 주고받았는지, 어떤 파일들을 주고받았는지 등)를 추출하여분석이 가능한 미디어 형태로 복원/저장하고, 및 인공지능 모델을 이용하여 대화 내용과 미디어의 유해성을 분 석해 유해 정도를 사용자 또는 사용자의 보호자에게 알리도록 구성될 수 있다. 대화 화면 분류 학습기는 캡쳐된 단말 화면 중에서 채팅 앱 대화 화면을 구분하기 위한 인공지능 모델을 학습하도록 구성될 수 있다. 관심 객체 탐지 학습기는 사용자 단말이 이미지 형태의 대화에서 관심 영역(예컨대, 대화 내용, 화자, 시 간, 주고받은 이미지/파일 등)을 분리하기 위한 인공지능 모델을 학습하도록 구성될 수 있다. 대화 유해성 탐지 학습기는 분석 가능한 형태로 복원된 대화에서 유해성을 탐지하는 인공지능 모델을 학습 하도록 구성될 수 있다. 미디어 유해성 탐지 학습기는 사용자가 주고받은 대화 이미지, 오디오, 비디오의 유해성을 분석하는 인공 지능 모델을 학습하도록 구성될 수 있다. 대화 화면 분류 학습기는 대화 화면 분류 데이터와 대화 화면 분류 학습부 등을 포함하여 구성 될 수 있다. 대화 화면 분류 데이터는 대화 화면 이미지와 비(非)대화 화면 이미지로 구성될 수 있다. 대화 화면 분류 학습부는 대화 화면 분류 데이터를 이용하여 대화 화면과 비(非)대화 화면을 구분하 는 분류 모델(Classification)을 학습하도록 구성될 수 있다. 관심 객체 탐지 학습기는 관심 객체 탐지 학습 데이터와 관심 객체 탐지 학습부 등을 포함하여 구성될 수 있다. 관심 객체 탐지 학습 데이터는 채팅 앱 대화 이미지 파일들과 각 대화 이미지 내의 관심 객체(예컨대, 대 화방 명, 화자, 말풍선, 시간, 이미지, 파일 등)의 위치 및 객체 식별을 위한 라벨(label) 정보가 기입된 주석 (Annotation) 파일들 등을 포함하여 구성될 수 있다. 관심 객체 탐지 학습부는 관심 객체 탐지 학습 데이터를 이용하여 입력으로 들어온 대화 이미지 내에 서 관심 객체의 식별 정보와 위치 정보를 탐지하는 객체 탐지(Object Detection) 모델을 학습하도록 구성될 수 있다. 대화 유해성 탐지 학습기는 대화 유해성 탐지 학습 데이터와 대화 유해성 탐지 학습기 등을 포 함하여 구성될 수 있다. 대화 유해성 탐지 학습 데이터는 대화 텍스트와 그 대화의 의도와 유해 여부 정보 등을 포함하도록 구성될 수 있다. 대화 유해성 탐지 학습부는 대화 유해성 탐지 학습 데이터를 이용하여 사용자가 주고받은 대화들의 의도와 온라인 그루밍, 사이버 폭력 등의 유해성이 있는지 판단하는 모델을 학습하도록 구성될 수 있다. 미디어 유해성 탐지 학습기는 미디어 유해성 탐지 학습 데이터와 미디어 유해성 탐지 학습부 등 을 포함하여 구성될 수 있다. 미디어 유해성 탐지 학습 데이터는 음란물, 폭력물 등 유해 이미지 및 음성 정보와 건전한 이미지 및 음성 정보 등을 포함하여 구성될 수 있다. 미디어 유해성 탐지 학습부는 미디어 유해성 탐지 학습 데이터를 이용해 입력 이미지 및 오디오의 선 정성, 폭력성 등의 유해성을 판단하는 분류 모델을 학습하도록 구성될 수 있다. 사용자 단말 대화 분석기는 세부적으로 대화 정보 수집부, 대화 정보 추출및 복원부, 복원 대화 DB 그리고 대화 정보 분석부 등을 포함하여 구성될 수 있다. 대화 정보 수집부는 화면 수집부와 파일 수집부 등을 포함하여 구성될 수 있다. 화면 수집부는 일정 시간 간격으로 사용자 단말 화면을 캡쳐하고, 대화 화면 분류모델을 이용하여 캡 쳐된 화면에서 채팅 앱 대화 화면만을 구분하여 대화 복원부에 전달하도록 구성될 수 있다. 파일 수집부는 대화 중에 주고받은 파일의 제목, 위치 그리고 생성된 시간 정보를 대화 정보 추출 및 복원 부에 전달하도록 구성될 수 있다.대화 정보 추출 및 복원부는 관심 객체 추출부, 문자 인식부, 그리고 대화 복원부 등을 포 함하여 구성될 수 있다. 관심 객체 추출부는 관심 객체 탐지 학습 모델을 이용하여 대화 정보 수집부에서 전달한 대화 이미지에서 객체를 탐지하고, 각 객체의 라벨 정보(대화방 명, 화자, 말풍선, 시간, 이미지, 파일 등)와 위치 정보 그리고 채팅 앱의 종류 정보를 문자 인식부에게 전달한다. 문자 인식부는 OCR 기술을 이용하여 전달받은 객체 중 이미지 형태의 텍스트가 포함된 객체에서 텍스트 정 보를 추출하여 객체 정보에 추가하고, 이를 대화 복원부에게 전달하도록 구성될 수 있다. 대화 복원부는 전달받은 객체 정보를 기반으로 하여 채팅 앱의 종류 별로 하나의 대화방 당 하나의 복원 대화를 갖도록 구성할 수 있다. 복원 대화는 실제 대화에서 전송된 메시지 하나당 메시지를 보낸 화자, 화자가 보낸 텍스트 또는 이미지/파일 경로 그리고 메시지가 전송된 시간 정보로 구성한 메타파일 형태로 저장할 수 있 다. 상기 파일 정보는 채팅 앱 대화 중 다운로드한 동영상, 이미지, 오디오 등과 같은 파일을 포함한다. 대화 복원부는 파일 수집부로부터 전송된 파일 정보를 이용하여 대화를 복원할 수 있다. 복원된 데이터는 각 정보에 접근할 수 있도록 복원 대화 DB에 저장하도록 구성될 수 있다. 대화 정보 분석부는 대화 유해성 탐지부, 미디어 유해성 탐지부 그리고 복합 유해성 분석부 등을 포함하여 구성될 수 있다. 대화 유해성 탐지부는 대화 유해성 탐지 모델을 이용하여 복원 대화 DB에서 대화 텍스트 정보를 입력으로 대화의 의도를 파악하여 유해 여부를 탐지하도록 구성될 수 있다. 미디어 유해성 탐지부는 미디어 유해성 탐지 모델을 이용하여 대화 중 주고받은 이미지/비디오/오디 오의 유해성을 탐지하도록 구성될 수 있다. 복합 유해성 분석부는 대화 유해성 탐지 결과와 미디어 유해성 탐지 결과를 이용하여 사이버 범죄 노출 여 부 및 단계를 판단하도록 구성될 수 있다. 이에 따라서, 본 개시의 실시 예는 상기 대화 정보 분석부에서의 이상 징후 또는 유해성 탐지 결과에 따라 단계적으로 사용자 및 사용자의 보호자에게 위험성을 알리고 채증할 수 있다. 도 2는 본 개시의 실시 예에 따른 사용자 단말에서 메시지 분석 방법을 나타낸 흐름도이다. 사용자 단말에서 메시지 분석 장치는 201 단계에서 상기 사용자 단말의 채팅 앱 대화 화면을 주기적으로 캡쳐하 여 대화 화면 이미지 형태로 수집한다. 여기에서, 수집하는 과정은, 상기 사용자 단말의 채팅 앱 대화 화면을 수집하는 과정 및 대화 중 사용자에 의해 다운로드된 파일 정보를 수집하는 과정을 포함한다. 사용자 단말에서 메시지 분석 장치는 202 단계에서 상기 대화 화면 이미지에서 관심 정보를 추출하여 분석이 가 능한 대화 형태로 복원한다. 여기에서, 복원하는 과정은, 상기 대화 화면 이미지에서 관심 객체를 추출하는 과 정, 상기 관심 객체 중 이미지 형태의 텍스트 정보를 텍스트로 변환하는 과정, 및 전달받은 객체 정보를 기반으 로 하여 채팅 앱의 종류 별로 하나의 대화방 당 하나의 복원 대화를 갖도록 구성하는 과정을 포함한다. 관심 객 체를 추출하는 과정은, 상기 대화 화면 이미지에서 관심 객체 탐지 모델을 이용하여 관심 객체를 탐지하는 과정, 및 각 객체의 위치 및 라벨 정보를 획득하는 과정을 포함하고, 상기 관심 객체는, 대화 텍스트를 포함하 는 말풍선 영역, 화자 텍스트 정보가 포함된 영역, 시간 정보가 포함된 영역, 그리고 채팅 화면에 보이는 이미 지 영역 중 적어도 하나를 포함한다. 상기 텍스트 정보는, 대화 텍스트, 화자, 시간 중 적어도 하나를 포함한다. 상기 관심 객체 중 이미지는 별도로 파일로 저장되고, 파일명, 파일 위치, 저장 시간을 포함하는 파 일 정보는 상기 관심 객체와 함께 관리된다. 텍스트로 변환하는 과정은, 상기 텍스트 정보가 포함된 객체에서 텍스트 정보를 추출하여 객체 정보와 함께 관리하는 과정을 포함한다. 사용자 단말에서 메시지 분석 장치는 203 단계에서 복원 대화 DB를 통해 상기 복원된 데이터를 저장한다. 사용자 단말에서 메시지 분석 장치는 204 단계에서 상기 복원 대화 DB에서 추출된 데이터에 인공지능 모델을 적 용하여 대화 내용과 미디어의 유해성을 분석한다. 여기에서, 분석하는 과정은, 대화 유해성 탐지부에서, 대화 유해성 탐지 모델을 이용하여 상기 복원 대화 DB에 저장된 복원 대화 데이터의 대화 텍스트의 의도를 분석하여 유해 단계를 판단하는 과정, 및 미디어 유해성 탐지부에서, 미디어 유해성 탐지 모델을 이용하여 상기 복원 대 화 DB에 저장된 이미지/오디오/파일을 불러와서 유해 단계를 판단하는 과정, 상기 대화 유해성 탐지부의 유해 단계 판단 결과와 상기 미디어 유해성 탐지부의 유해 단계 판단 결과를 기반으로 사이버 범죄 노출 단계를 판단하고 일정 단계 이상일 때 상기 사용자 단말(사용자 및 사용자의 보호자)에게 알림을 전송하는 과정을 포함한다. 상기 대화 정보 추출 및 복원부 및 대화 정보 분석부의 동작 주기는 상기 사용자 단말의 배터리 잔량에 따라 변 경될 수 있다. 예컨대, 배터리 잔량이 적을 때는 대화 정보 추출 및 복원부와 대화 정보 분석부의 동작 주기를 길게 조절할 수 있고, 배터리가 충전 중이거나 일정량 이상일 때는 동작 주기를 짧게 조절할 수 있다. 상기 대화 정보 추출 및 복원부 및 대화 정보 분석부의 동작 주기는 미리 지정된 간격 또는 상기 사용자 단말 의 프로세서 또는 메모리 사용량에 따라 변경될 수 있다. 예컨대, 프로세서 또는 메모리 사용량이 많을 때는 대 화 정보 추출 및 복원부와 대화 정보 분석부의 동작 주기를 길게 조절할 수 있고, 프로세서 또는 메모리 사용량 이 적을 때는 동작 주기를 짧게 조절할 수 있다. 본 개시의 실시 예에 의하면 기존에 사용자 단말에서 발생하는 특성 때문에 탐지 및 예방이 어려웠던 온라인 그 루밍, 사이버 폭력 등의 사이버 범죄 발생을 감소시킬 수 있다. 본 개시의 예시적인 실시예들에 기술된 적어도 일부의 구성요소들은 DSP(Digital Signal Processor), 프로세서, 네트워크 제어부, ASIC(Application-Specific IC), 프로그래머블 로직소자(FPGA 등), 기타 전자소자 중의 적어 도 하나 또는 이들의 조합이 포함되는 하드웨어 요소로써 구현될 수 있다. 또한, 예시적인 실시예들에서 기술된 적어도 일부의 기능(function)들 또는 처리과정(process)들은 소프트웨어로 구현될 수 있으며, 소프트웨어는 기 록매체에 저장될 수 있다. 본 개시의 예시적인 실시예들에 기술된 적어도 일부의 구성요소들, 기능들, 그리고 처리과정들은 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 본 개시의 예시적인 실시예들에 따른 방법은 컴퓨터에서 실행될 수 있는 프로그램으로 작성될 수 있고, 마그네 틱 저장매체, 광학적 판독매체, 디지털 저장매체 등 다양한 기록 매체로도 구현될 수 있다. 본 명세서에 설명된 각종 기술들의 구현들은 디지털 전자 회로조직으로, 또는 컴퓨터 하드웨어, 펌웨어, 소프트 웨어로, 또는 그들의 조합들로 구현될 수 있다. 구현들은 데이터 처리 장치, 예를 들어 프로그램가능 프로세서, 컴퓨터, 또는 다수의 컴퓨터들의 동작에 의한 처리를 위해, 또는 이 동작을 제어하기 위해, 컴퓨터 프로그램 제 품, 즉 정보 캐리어, 예를 들어 기계 판독가능 저장 장치(컴퓨터 판독가능 매체) 또는 전파 신호에서 유형적으 로 구체화된 컴퓨터 프로그램으로서 구현될 수 있다. 상술한 컴퓨터 프로그램(들)과 같은 컴퓨터 프로그램은 컴 파일된 또는 인터프리트된 언어들을 포함하는 임의의 형태의 프로그래밍 언어로 기록될 수 있고, 독립형 프로그 램으로서 또는 모듈, 구성요소, 서브루틴, 또는 컴퓨팅 환경에서의 사용에 적절한 다른 유닛으로서 포함하는 임 의의 형태로 전개될 수 있다. 컴퓨터 프로그램은 하나의 사이트에서 하나의 컴퓨터 또는 다수의 컴퓨터들 상에 서 처리되도록 또는 다수의 사이트들에 걸쳐 분배되고 통신 네트워크에 의해 상호 연결되도록 전개될 수 있다. 컴퓨터 프로그램의 처리에 적절한 프로세서들은 예로서, 범용 및 특수 목적 마이크로프로세서들 둘 다, 및 임의 의 종류의 디지털 컴퓨터의 임의의 하나 이상의 프로세서들을 포함한다. 일반적으로, 프로세서는 판독 전용 메 모리 또는 랜덤 액세스 메모리 또는 둘 다로부터 명령어들 및 데이터를 수신할 것이다. 컴퓨터의 요소들은 명령 어들을 실행하는 적어도 하나의 프로세서 및 명령어들 및 데이터를 저장하는 하나 이상의 메모리 장치들을 포함 할 수 있다. 일반적으로, 컴퓨터는 데이터를 저장하는 하나 이상의 대량 저장 장치들, 예를 들어 자기, 자기-광 디스크들, 또는 광 디스크들을 포함할 수 있거나, 이것들로부터 데이터를 수신하거나 이것들에 데이터를 송신하 거나 또는 양쪽으로 되도록 결합될 수도 있다. 컴퓨터 프로그램 명령어들 및 데이터를 구체화하는데 적절한 정 보 캐리어들은 예로서 반도체 메모리 장치들, 예를 들어, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM(Compact Disk Read Only Memory), DVD(Digital Video Disk)와 같은 광 기 록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media), 롬 (ROM, Read Only Memory), 램(RAM, Random Access Memory), 플래시 메모리, EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM) 등을 포함한다. 프로세서 및 메모리는 특수 목적 논리 회로조직에 의해 보충되거나, 이에 포함될 수 있다. 프로세서는 운영 체제(Operating System) 및 상기 운영 체제 상에서 수행되는 소프트웨어 애플리케이션을 수행 할 수 있다. 또한, 프로세서 디바이스는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 프로세서 디바이스는 하나가 사용되는 것으로 설명된 경우도 있지만,"}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "해당 기술분야에서 통상의 지식을 가진 자는, 프로세서 디바이스가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 프로세서 디바이스는 복수 개의 프 로세서 또는 하나의 프로세서 및 하나의 네트워크 제어부를 포함할 수 있다. 또한, 병렬 프로세서(parallelprocessor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 또한, 비-일시적 컴퓨터 판독가능 매체(non-transitory computer-readable media)는 컴퓨터에 의해 액세스될 수 있는 임의의 가용매체일 수 있고, 컴퓨터 저장매체 및 전송매체를 모두 포함할 수 있다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 마찬가지로, 특정한 순서로 도면에서 동작들을 묘사하고 있지만, 이는 바람직한 결과를 얻기 위하여 도시된 그 특정한 순서나 순차적인 순서대로 그러한 동작들을 수행하여야 한다거나 모든 도시된 동작들이 수행되어야 하는 것으로 이해되어서는 안 된다. 특정한 경우, 멀티태스킹과 병렬 프로세싱이 유리할 수 있다. 또한, 상술한 실시 형태의 다양한 장치 컴포넌트의 분리는 그러한 분리를 모든 실시형태에서 요구하는 것으로 이해되어서는 안되며, 설명한 프로그램 컴포넌트와 장치들은 일반적으로 단일의 소프트웨어 제품으로 함께 통합되거나 다중 소프트웨어 제품에 패키징 될 수 있다는 점을 이해하여야 한다. 한편, 본 명세서와 도면에 개시된 본 개시의 실시 예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으 며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상"}
{"patent_id": "10-2023-0041057", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 자명한 것이다. 본 실시예의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 실시예의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2"}
{"patent_id": "10-2023-0041057", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시 예에 따른 사용자 단말에서 메시지 분석 장치 블록 구성도이다. 도 2는 본 개시의 실시 예에 따른 사용자 단말에서 메시지 분석 방법을 나타낸 흐름도이다."}
