{"patent_id": "10-2021-0121217", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0034701", "출원번호": "10-2021-0121217", "발명의 명칭": "태그 기반 콘텐츠 추천 방법 및 이를 수행하는 서버", "출원인": "(주)웨델", "발명자": "이동우"}}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "관리 서버가 태그를 기반으로 사용자에게 콘텐츠를 추천하는 방법에 있어서,자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 추출하여 부여하는 단계;사용자에 의해 선택된 적어도 하나 이상의 콘텐츠에 부여된 태그 정보에 기초하여 해당 사용자에 대한 태그를부여하는 단계;적어도 하나 이상의 사용자에 부여된 태그와 적어도 하나 이상의 콘텐츠에 부여된 태그들을 기초로, 각각의 사용자 또는 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 단계; 복수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기 정해진 일정 정도 이상으로 측정된 태그 그룹들을하나의 클러스터로 그룹화하는 단계;특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터 내에 포함된 태그 그룹에 대한 추천을 수행하는 단계; 및복수의 클러스터 사이의 유사도를 계산하고, 상기 특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터와 유사도가 기 정해진 일정 정도 이상으로 계산된 클러스터에 포함된 태그 그룹에 대한 추천을 수행하는단계를 포함하는, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,자연어 분석은,인공지능 모델 중 하나인 BERT(Bidirectional Encoder Representations from Transformers)를 활용하여 수행되는 것을 특징으로 하는, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 부여하는 단계는,콘텐츠와 해당 콘텐츠에 부여되는 태그 사이의 유사도를 계산하는 단계를 더 포함하며,각각의 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 단계에서 콘텐츠와 해당 콘텐츠에 부여되는 태그 사이의유사도가 활용되는, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 태그 사이의 유사도는 사용자가 콘텐츠를 선택하는 빈도 또는 사용자가 선택한 콘텐츠에 특정 키워드가 포함되는 빈도에 기초하여 계산되는 것을 특징으로 하는, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2022-0034701-3-제1항에 있어서,자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 부여하는 단계는,특정 콘텐츠에서 추출된 복수의 태그 사이의 관계도를 계산하는 단계를 더 포함하며,복수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기 정해진 일정 정도 이상으로 측정된 태그 그룹들을하나의 클러스터로 그룹화하는 단계는,태그 그룹들이 포함하고 있는 태그들의 관계도에 기초하여 그룹화를 수행하는 것을 특징으로 하는, 관리 서버의콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,복수의 클러스터 사이의 유사도를 계산하는 단계는,각각의 클러스터 내부의 태그 그룹들이 포함하는 태그들 사이의 유사도에 기초하여 유사도를 계산하는 것인, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,복수의 클러스터 사이의 유사도를 계산하는 단계는,개별 클러스터를 대표하는 적어도 하나 이상의 대표 태그들 사이의 유사도를 계산하고, 계산된 대표 태그들 사이의 유사도에 기초하여 복수의 클러스터 사이의 유사도를 계산하는 것인, 관리 서버의콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,개별 클러스터를 대표하는 대표 태그들 사이의 유사도는 대표 태그들을 노드(node)로 가지는 그래프(graph) 자료구조 상에서 대표 태그들 사이의 거리에 기초하여 계산되는 것인, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 복수의 태그 그룹들 사이의 유사도를 측정하는 단계는,태그 그룹 내에 포함되는 태그들을 노드(node)로 가지는 그래프(graph) 자료구조 상에서 태그들 사이의 거리에기초하여 유사도를 계산하는 것인, 관리 서버의 콘텐츠 추천 방법."}
{"patent_id": "10-2021-0121217", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "태그를 기반으로 사용자에게 콘텐츠를 추천해주는 관리 서버에 있어서,자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 추출하여 부여하며, 사용자에 의해 선택된 적어도 하나 이상의 콘텐츠에 부여된 태그 정보에 기초하여 해당 사용자에 대한 태그를 부여하는 태그 부여부;공개특허 10-2022-0034701-4-적어도 하나 이상의 사용자에 부여된 태그와 적어도 하나 이상의 콘텐츠에 부여된 태그들을 기초로, 각각의 사용자 또는 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 태그 그룹 관리부;복수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기 정해진 일정 정도 이상으로 측정된 태그 그룹들을하나의 클러스터로 그룹화하는 클러스터링 수행부;특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터 내에 포함된 태그 그룹에 대한 추천을 수행하는 클러스터 내부 추천부; 및복수의 클러스터 사이의 유사도를 계산하고, 상기 특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터와 유사도가 기 정해진 일정 정도 이상으로 계산된 클러스터에 포함된 태그 그룹에 대한 추천을 수행하는클러스터 외부 추천부를 포함하는, 관리 서버."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "태그 기반 콘텐츠 수행 방법 및 이를 수행하는 서버가 개시된다. 본 발명의 다양한 실시예 중 하나에 따른 관리 서버의 콘텐츠 추천 방법은, 자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 추출하여 부여하는 단계; 사용자에 의해 선택된 적어도 하나 이상의 콘텐츠에 부여된 태그 정보에 기초하여 해당 사용자에 (뒷면에 계속)"}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 태그 기반 콘텐츠 추천 방법 및 이를 수행하는 서버에 관한 것으로, 상세하게는 사 용자와 콘텐츠를 동일 차원의 태그 그룹으로 관리하고 태그 그룹의 유사도에 따른 클러스터링을 수행하고 이를 기초로 사용자에게 콘텐츠를 추천하는 기술에 대한 것이다."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "어플리케이션 등의 형태로 제공되는 서비스를 활용하는 사용자들에게 맞춤형 콘텐츠를 제공하거나 사용자들이 관심이 있는 상품을 추천하는 기술은 계속해서 발전하여 왔다. 그 중, 태그를 활용하는 방법이 주로 활용되고 있는데 이는 제공되는 콘텐츠 또는 상품마다 해당 콘텐츠 또는 상품이 어떠한 카테고리에 속하는지 또는 어떠한 키워드와 연관이 있는지를 해시태그 등과 같은 태그를 통해 분 류하고, 이를 통해 사용자가 관심있어 하는 콘텐츠 또는 상품을 추천하는 방식이다. 다만 이와 같은 방식에서는 태그가 해당 콘텐츠 또는 상품의 속성을 정확하지 반영하지 못하는 경우가 발생하였 으며, 이와 같은 추천 시스템을 구축하는 초기 단계이거나 해당 시스템을 사용하는 사용자의 숫자가 충분하지 않을 때, 또는 각각의 사용자에 대한 데이터가 충분히 수집되지 않는 경우에는 추천 시스템을 구축하는데 어려 움이 존재하였을 뿐 아니라, 추천 시스템의 정확도가 낮게 나타나는 한계점 또한 존재하였다. 이에, 콘텐츠 또는 상품에 대응되는 태그를 통해 추천을 수행하는 기존의 방식을 발전시킬 필요성이 존재하였으 며, 또한 데이터가 부족한 상황에서 추천 시스템의 정확도를 향상시킬 방안이 필요하였다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-1166130호"}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 다양한 실시예는 사용자와 콘텐츠에 부여된 태그를 기초로 사용자에게 정밀한 맞춤형 콘텐츠 추천을 제공하는 것을 그 목적으로 한다. 본 발명의 다양한 실시예는 데이터가 부족한 상황에서 콘텐츠 추천의 정확도를 향상시키는 것을 그 목적으로 한 다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 다양한 실시예 중 하나에 따르면, 관리 서버가 태그를 기반으로 사용자 에게 콘텐츠를 추천하는 방법에 있어서, 자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그 를 추출하여 부여하는 단계; 사용자에 의해 선택된 적어도 하나 이상의 콘텐츠에 부여된 태그 정보에 기초하여 해당 사용자에 대한 태그를 부여하는 단계; 적어도 하나 이상의 사용자에 부여된 태그와 적어도 하나 이상의 콘 텐츠에 부여된 태그들을 기초로, 각각의 사용자 또는 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 단계; 복 수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기 정해진 일정 정도 이상으로 측정된 태그 그룹들을 하 나의 클러스터로 그룹화하는 단계; 특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터 내에 포함 된 태그 그룹에 대한 추천을 수행하는 단계; 및 복수의 클러스터 사이의 유사도를 계산하고, 상기 특정 사용자 에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터와 유사도가 기 정해진 일정 정도 이상으로 계산된 클러스 터에 포함된 태그 그룹에 대한 추천을 수행하는 단계를 포함하는, 관리 서버의 콘텐츠 추천 방법이 개시될 수 있다. 자연어 분석은, 인공지능 모델 중 하나인 BERT(Bidirectional Encoder Representations from Transformers)를 활용하여 수행될 수 있다. 자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 부여하는 단계는, 콘텐츠와 해당 콘텐 츠에 부여되는 태그 사이의 유사도를 계산하는 단계를 더 포함할 수 있으며, 각각의 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 단계에서 콘텐츠와 해당 콘텐츠에 부여되는 태그 사이의 유사도가 활용될 수 있다. 상기 태그 사이의 유사도는 사용자가 콘텐츠를 선택하는 빈도 또는 사용자가 선택한 콘텐츠에 특정 키워드가 포 함되는 빈도에 기초하여 계산될 수 있다. 자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 부여하는 단계는, 특정 콘텐츠에서 추 출된 복수의 태그 사이의 관계도를 계산하는 단계를 더 포함할 수 있으며, 복수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기 정해진 일정 정도 이상으로 측정된 태그 그룹들을 하나의 클러스터로 그룹화하는 단계는, 태그 그룹들이 포함하고 있는 태그들의 관계도에 기초하여 그룹화를 수행하는 것을 특징으로 할 수 있다. 복수의 클러스터 사이의 유사도를 계산하는 단계는, 각각의 클러스터 내부의 태그 그룹들이 포함하는 태그들 사 이의 유사도에 기초하여 유사도를 계산하는 것일 수 있다. 복수의 클러스터 사이의 유사도를 계산하는 단계는, 개별 클러스터를 대표하는 적어도 하나 이상의 대표 태그들 사이의 유사도를 계산하고, 계산된 대표 태그들 사이의 유사도에 기초하여 복수의 클러스터 사이의 유사도를 계 산하는 것일 수 있다. 개별 클러스터를 대표하는 대표 태그들 사이의 유사도는 대표 태그들을 노드(node)로 가지는 그래프(graph) 자 료구조 상에서 대표 태그들 사이의 거리에 기초하여 계산되는 것일 수 있다. 복수의 태그 그룹들 사이의 유사도를 측정하는 단계는, 태그 그룹 내에 포함되는 태그들을 노드(node)로 가지는 그래프(graph) 자료구조 상에서 태그들 사이의 거리에 기초하여 유사도를 계산하는 것일 수 있다. 본 발명의 다양한 실시예 중 하나에 따르면, 자연어 분석을 수행하여 적어도 하나 이상의 콘텐츠 각각에 대한 태그를 추출하여 부여하며, 사용자에 의해 선택된 적어도 하나 이상의 콘텐츠에 부여된 태그 정보에 기초하여 해당 사용자에 대한 태그를 부여하는 태그 부여부; 적어도 하나 이상의 사용자에 부여된 태그와 적어도 하나 이 상의 콘텐츠에 부여된 태그들을 기초로, 각각의 사용자 또는 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 태 그 그룹 관리부; 복수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기 정해진 일정 정도 이상으로 측정된 태그 그룹들을 하나의 클러스터로 그룹화하는 클러스터링 수행부; 특정 사용자에 대해, 해당 사용자의 태그 그 룹이 속하는 클러스터 내에 포함된 태그 그룹에 대한 추천을 수행하는 클러스터 내부 추천부; 및 복수의 클러스 터 사이의 유사도를 계산하고, 상기 특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터와 유사도 가 기 정해진 일정 정도 이상으로 계산된 클러스터에 포함된 태그 그룹에 대한 추천을 수행하는 클러스터 외부 추천부를 포함하는, 관리 서버가 개시될 수 있다."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 사용자와 콘텐츠를 동일한 차원의 태그 그룹으로 관리하고, 유사한 태그 그룹에 대 한 클러스터링을 수행함으로써 사용자에게 정밀한 레벨의 맞춤형 콘텐츠 추천이 가능해진다.본 발명의 실시예에 따르면, 하나의 콘텐츠에서 함께 추출되는 키워드들의 관계도에 기초하여 태그 그룹들의 클 러스터링을 수행하고, 클러스터 내부에서의 유사 콘텐츠 추천과 클러스터 외부에서의 관계성 존재 콘텐츠 추천 을 병행함으로써 데이터가 부족한 상황에서도 유사한 콘텐츠가 반복해서 추천되지 않도록 제어할 수 있다."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 도 1은 본 발명의 일 실시예에 따른 콘텐츠 추천 시스템이 동작하는 환경에 대한 개략도이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 콘텐츠 추천 시스템은 관리 서버, 사용자 단말기 및 외부 서버를 포함하는 형태로 구성될 수 있다. 관리 서버는 적어도 하나 이상의 사용자 단말기와의 통신을 통해 사용자들에게 다양한 종류의 콘텐츠 를 제공할 수 있다. 관리 서버가 사용자들에게 제공하는 콘텐츠는 텍스트, 오디오, 이미지, 영상 또는 이 들의 조합으로 구성될 수 있으며 기사, 블로그, 포스팅, 판매되는 상품 또는 서비스 등의 형태일 수도 있다. 관리 서버가 사용자에게 제공하는 콘텐츠의 종류는 특정한 콘텐츠로 한정되지는 않으나, 설명의 편의를 위 해서 이하 명세서 상에서는 관리 서버가 사용자들에게 제공하는 콘텐츠가 '육아 콘텐츠'로 한정되는 것을 예시로 들어 설명할 수 있다. 관리 서버는 콘텐츠 추천 시스템이 원할하게 동작하도록 데이터를 관리하고 필요한 데이터를 사용자 단말기와 주고받을 수 있다. 관리 서버는 사용자 단말기와의 통신을 통해 사용자가 원하는 콘텐 츠를 제공하고, 사용자의 콘텐츠 선택 정보와 각 콘텐츠들이 포함하고 있는 정보들을 분석하여 각 사용자가 필 요로 하는 콘텐츠를 맞춤형으로 추천할 수 있다. 사용자 단말기는 사용자가 콘텐츠 추천 시스템을 이용하기 위해 사용하는 단말기로, 사용자는 사용자 단말기를 통해 관리 서버에 접속하여 자신이 원하는 콘텐츠를 조회하거나 상품 또는 서비스의 구매등을 수행할 수 있다. 도 1에 도시된 것과 같이, 복수의 사용자는 각각 자신의 사용자 단말기를 통해 관리 서버에 접속할 수 있다. 이러한 사용자 단말기는 휴대폰, 스마트폰, PDA(Personal Digital Assistant), PMP(Portable Multimedia Player), 태블릿 PC, 등과 같이 네트워크를 통하여 웹 서버와 연결될 수 있는 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있으며, 개인용 컴퓨터(예를 들어, 데스크탑 컴퓨터, 노트북 컴퓨터 등), 워크스테이션, PDA, 웹 패드 등과 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖 춘 디지털 기기 중 하나일 수도 있다. 본 발명의 일 실시예에 따르면, 사용자 단말기는 관리 서버에 접속하여 콘텐츠 및 콘텐츠 추천 정보 를 수신하는 과정에서 어플리케이션 등과 같은 특정 프로그램을 활용할 수도 있다. 이와 같은 프로그램이 사용 자 단말기 상에 설치되는 루트는 각종 어플리케이션 스토어를 통한 것일 수도 있다. 해당 프로그램의 다운 로드는 무상으로 이루어질 수도 있으며, 사용자는 어플리케이션 스토어 상에서 유료로 등록된 프로그램을 다운 로드하여 사용자 단말기 상에 설치하기 위하여 소정의 가격을 지불하여야 할 수도 있으며, 해당 프로그램 의 제작사는 이를 통해 수익을 창출할 수도 있다. 또한, 해당 프로그램의 수익은 프로그램의 동작 화면 상에서 노출되는 광고를 통해 발생할 수도 있다. 사용자 단말기 상에 설치된 프로그램의 실행에 필요한 동작(예: 명령어, 루틴 또는 인스트럭션 등)들은 사 용자 단말기의 메모리에 프로그램의 형태로 저장될 수 있으며, 이러한 프로그램은 사용자 단말기의 프로세서에 의해 호출되어 상기 프로그램에 저장된 동작들을 수행하기 위해 상기 사용자 단말기를 제어할 수 있다. 외부 서버는 관리 서버를 운영하는 주체와 상이한 주체에 의해 운영되는 서버로, 본 발명에서는 외부 콘텐츠를 보급하는 업체들의 서버로 구성될 수 있다. 예를 들어, 외부 서버는 외부의 포털 사이트 서버, 상품을 판매하는 쇼핑몰의 서버 등으로 구성될 수 있다. 관리 서버는 외부 서버로부터 콘텐츠 추천 시스템의 각종 기능을 수행함에 있어 필요한 정보를 습득할 수 있다. 본 발명의 일 실시예에 따르면, 콘텐츠 추천 시스템 내에서 동작하는 각 주체들이 통신하기 위해서 사용하 는 통신망은 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있으며, 예를 들면, 근거리 통신망 (LAN: Local Area Network), 도시권 통신망(MAN: Metropolitan Area Network), 광역 통신망(WAN: Wide Area Network) 등 다양한 통신망으로 구현될 수 있다. 바람직하게는, 본 발명의 일 실시예에 따른 통신망은 공지의 월드와이드웹(WWW: World Wide Web) 등일 수도 있다. 도 2는 본 발명의 일 실시예에 따른 관리 서버의 구성을 개략적으로 나타낸 블록도이다. 도 2를 참조하면, 관리 서버는 태그 부여부, 태그 그룹 관리부, 클러스터링 수행부, 클러 스터 내부 추천부, 클러스터 외부 추천부, 통신부, 저장부 및 제어부를 포함하여 구 성될 수 있다. 일 실시예에 따른 태그 부여부는 자연어 분석을 수행하여 관리 서버에 의해 관리되는 콘텐츠 각각에 대한 태그를 추출하고 추출된 태그를 각 콘텐츠에 대해 부여할 수 있다. 태그 부여부에 의해 활용되는 자연어 분석 알고리즘은 딥 러닝 기술을 기초로 하는 인공지능 알고리즘으로 구성될 수 있으며, 일 실시예에 따르면 인공지능 자연어 처리 모델 중 하나인 BERT(Bidirectional Encoder Representations from Transformers)가 활용될 수 있다. 이와 같이 태그 부여부가 딥 러닝 기술을 기초로 하는 인공지능 알고리즘을 통해 콘텐츠에 대한 속성을 반 영하는 태그를 추출함으로 인해, 해당 콘텐츠가 직접적으로 포함하고 있지 않은 키워드 또는 해당 콘텐츠에 나 타나는 빈도가 적은 키워드에 대한 추출이 수행될 수도 있다. 본 발명의 콘텐츠 추천 시스템이 육아와 관련된 콘텐츠를 제공하는 경우를 예시하면, 태그 부여부는 위키피디아 등과 같은 공개된 데이터 세트를 활용하여 인공지능 알고리즘에 대한 사전 학습을 수행시킬 수 있으 며, 관리되고 있는 다양한 육아 콘텐츠들과 육아 제품들에 등록된 제품 리뷰 등을 활용하여 추가적인 학습을 수 행시킬 수도 있다. 또한, 태그 부여부는 사용자에 의해 선택된 적어도 하나 이상의 콘텐츠에 부여된 태그 정보에 기초하여 해 당 사용자에 대한 태그를 부여할 수 있다. 사용자에 대해 부여될 태그는, 특정 사용자가 선택하여 조회한 콘텐츠에 따라 결정될 수 있으며, 특정 사용자가 구매한 제품에 따라 결정될 수도 있다. 태그 부여부는 자연여 분석을 수행하여 콘텐츠에 태그를 부여함에 있어서, 특정 콘텐츠와 해당 콘텐츠에 부여되는 태그 사이의 유사도를 계산할 수 있으며, 이후 각각의 콘텐츠를 복수의 태그 그룹 중 하나로 분류하는 단계에서 이와 같이 계산된 유사도를 활용할 수 있다. 일 실시예에 따르면, 이와 같은 콘텐츠와 태그 사이의 유사도는 사용자가 콘텐츠를 선택하는 빈도 또는 사용자 가 선택한 콘텐츠에 특정 키워드가 포함되는 빈도에 기초하여 계산될 수 있다. 태그 부여부는 자연어 분석을 수행하여 콘텐츠에 태그를 부여하는 과정에서, 특정 콘텐츠에서 추출된 복수 의 태그 사이의 관계도를 추가로 계산할 수 있다. 이와 같이 계산된 복수의 태그 사이의 관계도는 추후 클러스 터링 수행부에 의해 활용될 수 있다. 태그 그룹 관리부는 사용자들에 대해 부여된 태그와, 콘텐츠들에 부여된 태그들을 기초로 하여 각각의 사 용자 또는 콘텐츠를 복수의 태그 그룹 중 하나로 분류할 수 있다. 즉, 태그 그룹 관리부는 콘텐츠와 사용자를 각각의 별개 차원으로 관리하여 콘텐츠와 사용자 간의 관계를 계산하지 않으며, 콘텐츠와 사용자를 동일한 차원의 태그 그룹으로 분류하여 관리할 수 있다. 이와 같이, 각각의 사용자 또는 콘텐츠는 해당 사용자 또는 콘텐츠에 부여된 태그들의 종류에 따라 복수의 태그 그룹 중 하나로 분류될 수 있다. 일 실시에에 따르면 태그에 가중치가 부여된 경우 동일한 태그가 부여된 사용 자 또는 콘텐츠 또한 태그에 부여된 가중치에 따라서 서로 상이한 태그 그룹으로 분류될 수도 있다. 태그 그룹 관리부는 태그 부여부에 의해 계산된 특정 콘텐츠와 해당 콘텐츠에 부여되는 태그 사이의 유사도를 참조하여 태그 그룹의 분류를 수행할 수도 있다. 클러스터링 수행부는 복수의 태그 그룹들 사이의 유사도를 측정할 수 있으며, 이후 유사도가 기 정해진 일 정 정도 이상으로 측정된 태그 그룹들을 하나의 클러스터로 그룹화할 수 있다. 즉, 클러스터링 수행부의 클러스터링에 의해서 복수의 클러스터들이 생성될 수 있으며, 이와 같이 생성된 클러스터는 사용자에게 어떠한 콘텐츠를 추천할지 결정하는 기준으로 활용될 수 있다. 클러스터링 수행부는 태그 부여부가 콘텐츠에 태그를 부여하는 관계에서 계산한, 특정 콘텐츠에서 추 출된 복수의 태그 사이의 관계도에 기반하여, 태그 그룹들에 대한 클러스터링을 수행함에 있어 해당 관계도를 참조하여 그룹화를 수행할 수 있다. 클러스터 내부 추천부는 특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터 내에 포함된 태 그 그룹에 대한 추천을 수행할 수 있다. 즉, 클러스터 내부 추천부의 추천은 특정 태그 그룹으로 분류된 콘텐츠에 대한 추천일 수 있다. 클러스터 외부 추천부는 복수의 클러스터 사이의 유사도를 계산하고, 특정 사용자에 대해 해당 사용자의 태그 그룹이 속하는 클러스터오 유사도가 기 정해진 일정 정도 이상으로 계산된 클러스터에 포함된 태그 그룹에 대한 추천을 수행할 수 있다. 이와 같이, 클러스터 외부 추천부의 추천 또한 특정 태그 그룹으로 분류된 콘텐츠에 대한 추천일 수 있다. 본 발명의 일 실시예에 따르면, 클러스터 외부 추천부는 복수의 클러스터 사이의 유사도를 계산함에 있어, 클러스터 내부에 포함되는 태그 그룹 각각이 포함하는 태그들 간의 유사도에 기초하여 클러스터 사이의 유사도 를 계산할 수 있다. 본 발명의 일 실시예에 따르면, 클러스터 외부 추천부는 복수의 클러스터 사이의 유사도를 계산함에 있어, 개별 클러스터를 대표하는 적어도 하나 이상의 대표 태그들 사이의 유사도를 계산하고, 계산된 대표 태그들 사 이의 유사도에 기초하여 복수의 클러스터 사이의 유사도를 계산할 수 있다. 클러스터 외부 추천부는 개별 클러스터들을 대표하는 대표 태그들을 추출하기 위해, 특정 클러스터 내에 포함된 태그 그룹들이 포함하고 있는 태그들이 해당 클러스터 내의 얼마나 많은 태그 그룹에 중복되어서 포함되 어 있는지에 대한 정보를 기초로 대표 태그를 추출할 수 있다. 클러스터 외부 추천부는 개별 클러스터들 대표하는 대표 태그들 사이의 유사도를 계산함에 있어, 대표 태 그들을 노드(node)로 가지는 그래프(graph) 자료구조 상에서 대표 태그들 간의 거리에 기초하여 유사도를 계산 할 수 있다. 또한, 그래프 자료구조 상에서 노드들 간의 거리에는 각각 가중치가 설정되어 있을 수 있다. 이와 같은 그래프 자료구조를 통한 유사도 계산은 전술된 다양한 형태의 유사도 계산에도 활용될 수 있다. 즉, 콘텐츠와 태그 사이의 유사도, 특정 콘텐츠에서 추출된 복수의 태그 사이의 관계도, 태그 그룹들 사이의 유사도, 클러스터 사이의 유사도를 계산함에 있어 전술된 방식이 활용될 수 있다. 다만, 본 발명에서 활용되는 유사도 및 관계도를 계산하는 방식은 전술된 방식에 한정되지 않으며, 다양한 자료구조 및 알고리즘이 계산에 활용될 수 있다. 통신부는 관리 서버가 사용자 단말기 및 외부 서버와의 통신을 수행할 수 있도록 한다. 통 신부가 통신을 수행하기 위해서 사용하는 통신망은 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있으며, 예를 들면, 근거리 통신망(LAN: Local Area Network), 도시권 통신망(MAN: Metropolitan Area Network), 광역 통신망(WAN: Wide Area Network) 등 다양한 통신망으로 구현될 수 있다. 저장부는 관리 서버 내의 각종 구성부 내에서 수집되고, 생성되고, 가공되는 정보들을 저장하는 역할 을 수행한다. 즉, 관리 서버에는 각종 콘텐츠들에 대한 정보, 콘텐츠와 연관되어 판매되는 상품들의 정보, 콘텐츠와 사용자들에 부여된 태그들에 대한 정보, 태그 그룹 및 클러스터에 대한 정보, 유사도 계산을 위해 필 요한 자료구조 또는 알고리즘에 대한 정보 등이 저장될 수 있다. 이러한 저장부는 예를 들어, 메모리 (memory), 캐시(cash), 버퍼(buffer) 등을 포함할 수 있으며, 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어 도 둘 이상의 조합으로 구성될 수 있다. 제어부는 태그 부여부, 태그 그룹 관리부, 클러스터링 수행부, 클러스터 내부 추천부 , 클러스터 외부 추천부, 통신부 및 저장부 간의 데이터 흐름을 제어하는 역할을 수행할 수 있다. 즉, 본 발명의 일 실시예에 따른 제어부는 태그 부여부, 태그 그룹 관리부, 클러스터 링 수행부, 클러스터 내부 추천부, 클러스터 외부 추천부, 통신부 및 저장부에서 각 각 고유한 역할을 수행하도록 제어할 수 있다. 도 2에서 태그 부여부, 태그 그룹 관리부, 클러스터링 수행부, 클러스터 내부 추천부 및 클러스터 외부 추천부는 제어부를 기능적으로 분류한 구성이므로 하나의 제어부로서 통합되어 구성될 수도 있다. 도 3은 본 발명의 일 실시예에 따른 관리 서버가 복수의 사용자와 콘텐츠들을 태그 그룹으로 분류하는 방 식을 설명하기 위한 도면이다. 도 3을 참조하면, 복수의 사용자와 복수의 콘텐츠는 각각 해당 사용자 또는 콘텐츠에 부여된 태그들에 기초하여 복수의 태그 그룹 중 하나로 분류될 수 있다. 이와 같은 동작은 관리 서버의 태그 그룹 관리부에 의해 수행될 수 있으며, 도 3에 도시된 바와 같이 BERT와 같은 특정 인공지능 모델에 의해 수행될 수도 있다. 이와 같이, 본 발명 상에서는 사용자와 콘텐츠가 서로 다른 차원에서 평가되어 사용자에게 콘텐츠를 추천하는 방식이 활용되는 대신, 사용자와 콘텐츠가 같은 차원의 태그 그룹으로 변환되어 비교되는 방식이 활용될 수 있 다. 도 4는 본 발명의 일 실시예에 따른 클러스터 그룹화 방식 및 클러스터를 통한 콘텐츠 추천 방식을 설명하기 위 한 도면이다. 도 4를 참조하면, 세가지의 상이한 색상의 점으로 표시된 각각의 객체는 콘텐츠 또는 사용자들이 분류된 태그 그룹을 나타낼 수 있다. 관리 서버는 전술한 바와 같이 복수의 태그 그룹들 사이의 유사도를 측정하여 유사도가 기정해진 일정 정 도 이상으로 측정된 태그 그룹들을 하나의 클러스터로 그룹화할 수 있으며, 그 결과는 도 4에 도시된 것과 같이 복수의 클러스터로 그룹화된 형태로 나타날 수 있다. 이후, 관리 서버는 특정 사용자에 대해, 해당 사용자의 태그 그룹이 속하는 클러스터 내에 포함된 태그 그 룹에 대한 추천을 수행할 수 있으며, 이와 달리 해당 사용자의 태그 그룹이 속하지 않는 외부 클러스터 내에 포 함된 태그 그룹에 대한 추천을 수행할 수도 있다. 즉, 클러스터 내부의 태그 그룹을 대상으로 하는 추천은 특정 사용자 또는 콘텐츠와 관계성이 강한 유사 콘텐츠를 추천하는 것일 수 있으며, 클러스터 외부의 태그 그룹을 대상으로 하는 추천은 클러스터 내부 추천되는 콘텐츠보다는 유사도가 낮으나 관계성이 존재하는 콘텐츠에 대한 추천일 수 있다. 도 5는 본 발명의 일 실시예에 따른 클러스터 사이의 유사도에 따른 추천 방법을 설명하기 위한 도면이다. 즉, 관리 서버는 특정 사용자 또는 콘텐츠에 대해, 해당 사용자 또는 콘텐츠의 태그 그룹이 속하지 않은 외부 클러스터에 포함되는 태그 그룹에 대한 추천을 수행할 수 있다. 도 5를 참조하면, 복수의 사용자는 각각 자신이 선택한 콘텐츠에 따라 상이한 태그 그룹에 속할 수 있으며, 그 에 따라 각각의 태그 그룹 또한 상이한 클러스터에 속할 수 있다. 도 5의 예시에서는 두 명의 사용자가 각각 '유기농 제품'과 관련된 클러스터, '놀이 정보'와 관련된 클러스터에 속하는 경우가 도시되어 있다. '유기농'에 대한 클러스터는 '성분'에 대한 클러스터와 연관되어 있을 수 있으며, '성분'에 대한 클러스터는 ' 가격'에 대한 클러스터와 '영양'에 대한 클러스터와 연관되어 있을 수 있다. 이와 유사하게, '놀이'에 대한 클 러스터는 '발달'에 대한 클러스터와 '출산'에 대한 클러스터와 연관되어 있을 수 있으며, '출산'에 대한 클러스 터는 '영양'에 대한 클러스터와 연관되어 있을 수 있다. 특정 사용자 또는 콘텐츠에 대한 외부 클러스터 추천은, 클러스터 사이의 유사도 계산이 수행되어 그에 따라 추 천이 수행될 수 있다. 상세하게는, 복수의 클러스터 사이의 유사도를 계산하는 방식은 다양한 방식으로 구성될 수 있다. 일 실시예에 따르면, 복수의 클러스터 사이의 유사도는 각각의 클러스터 내부의 태그 그룹들이 포함하는 태그들 간의 유사도에 기초하여 계산될 수 있으며, 이 과정에서 각각의 클러스터에 대해 클러스터를 대표하는 대표 태 그들이 선정되고 대표 태그들 사이의 유사도가 계산되고 이에 기초하여 클러스터 사이의 유사도가 계산될 수도 있다. 관리 서버는 특정 클러스터에 속한 사용자에게 콘텐츠를 추천함에 있어 해당 클러스터와 유사도가 높은, 즉 클러스터 간의 거리가 가까운 클러스터를 탐색하여 탐색된 클러스터에 포함되는 태그 그룹을 참조하고, 참조 된 태그 그룹에 해당하는 콘텐츠를 사용자에게 추천할 수 있다. 도 6은 본 발명의 일 실시예에 따른 콘텐츠 추천 시스템이 동작하는 방식을 설명하기 위한 흐름도이다. 도 6을 참조하면, 관리 서버는 관리되는 콘텐츠들에 포함된 텍스트들에 대한 자연어 분석을 수행하여, 각 각의 콘텐츠에 대한 태그를 부여할 수 있다(S610). 이후, 관리 서버는 각각의 사용자에 대해 사용자가 선택하여 조회한 콘텐츠에 부여되어 있는 태그 정보에 기초하여, 해당 사용자에게도 태그를 부여할 수 있다(S620). 본 발명에서는 사용자와 콘텐츠에 부여된 태그 정보를 기초로 하여 사용자에 대한 추천이 수행되는 방식을 주로 설명하지만, 사용자가 콘텐츠 추천 시스템에 처음 가입한 상황에서는 해당 사용자에 부여된 태그가 존재하 지 않을 수 있다. 이 경우, 관리 서버는 사용자가 콘텐츠 추천 시스템에 가입하는 시점에 등록한 기본 정보들(예를 들어, 육아 콘텐츠를 제공하는 경우에 아이의 성별, 개월수, 지역)에 기초하여 콘텐츠를 추천할 수 있다. 관리 서버는 사용자 및 콘텐츠에 대해 태그가 부여된 이후, 사용자 및 콘텐츠에 부여된 태그에 기초하여 각각의 사용자 및 콘텐츠를 복수의 태그 그룹 중 하나로 분류할 수 있다(S630). 이후, 관리 서버는 태그 그룹들 사이의 유사도를 측정하여 유사도가 높은 태그 그룹들을 하나의 클러스터 로 그룹화할 수 있다(S640). 본 발명의 일 실시예에 따르면 관리 서버는 S610 단계에서 콘텐츠에 태그를 부여함에 있어 특정 콘텐츠에 서 추출된 복수의 태그 사이의 관계도를 계산할 수 있으며, 이와 같이 계산된 관계도를 S640 단계에서 유사도가 높은 태그 그룹들을 클러스터로 그룹화하는 과정에서 계산의 기초로 활용할 수 있다. 관리 서버는 특정 사용자에게 콘텐츠 추천을 수행함에 있어, 사용자의 태그 그룹이 속하는 클러스터 내부 의 다른 태그 그룹에 해당하는 콘텐츠를 추천할 수 있으며(S650), 이와 같이 클러스터 내부에서 추천되는 콘텐 츠는 해당 사용자의 태그 그룹과 유사도가 높은 콘텐츠일 수 있다.관리 서버는 특정 사용자에게 콘텐츠 추천을 수행함에 있어, 사용자의 태그 그룹이 속하는 클러스터 외부 의 클러스터를 통해 콘텐츠 추천을 수행할 수 있으며(S660), 이는 복수의 클러스터 사이의 유사도 계산을 통해 사용자의 태그 그룹이 속하는 클러스터와 유사도가 높은 클러스터에 포함된 태그 그룹에 속하는 콘텐츠를 추천 하는 것일 수 있다. 이와 같이 클러스터 외부에서 추천되는 콘텐츠는 클러스터 내부에서 추천되는 콘텐츠와 비 교하였을 때에 해당 사용자의 태그 그룹과의 유사도는 보다 낮을 수 있으나, 해당 사용자의 태그 그룹과 관계성 이 존재하는 콘텐츠로 구성될 수 있다. 이와 같이 본 발명의 다양한 실시예들에 따르면, 콘텐츠 추천 시스템이 동작함에 있어 추천 시스템이 동작된 시 간이 짧거나 사용자가 충분하지 않은 경우 또는 각 사용자 별로 생성된 데이터가 충분하지 않은 경우의 어려움 을 극복할 수 있다. 상세하게는, 전술된 경우에 콘텐츠 간의 비교가 어려워지거나 사용자에게 유사한 콘텐츠만 이 반복하여 추천되는 단점이 존재하였는데, 이와 같은 상황에서 콘텐츠에서 키워드를 추출하여 키워드를 비교 함으로써 콘텐츠의 유형과 관계없는 비교가 가능할 수 있다. 또한, 콘텐츠에서 키워드를 추천할 때에 키워드 사 이의 관계도를 함께 추출하여 이와 같은 관계도를 통해 키워드 간 클러스터를 구축하고, 클러스터 내부에서의 추천과 클러스터 외부에서의 추천을 병행하여 수행함으로써 유사 콘텐츠를 반복해서 추천하는 문제도 해결할 수 있다. 또한, 사용자가 선택하여 조회한 콘텐츠에 기반하여 콘텐츠 내의 키워드를 사용자에게 부여하는 방식으로 사용자에 태그를 부여하고, 콘텐츠와 동일한 차원에서 사용자를 태그 그룹화하는 방식으로 콘텐츠 추천에 대한 정확도를 향상시킬 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2021-0121217", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0121217", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 콘텐츠 추천 시스템이 동작하는 환경에 대한 개략도이다. 도 2는 본 발명의 일 실시예에 따른 관리 서버의 구성을 개략적으로 나타낸 블록도이다. 도 3은 본 발명의 일 실시예에 따른 관리 서버가 복수의 사용자와 콘텐츠들을 태그 그룹으로 분류하는 방식을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른 클러스터 그룹화 방식 및 클러스터를 통한 콘텐츠 추천 방식을 설명하기 위 한 도면이다. 도 5는 본 발명의 일 실시예에 따른 클러스터 사이의 유사도에 따른 추천 방법을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 콘텐츠 추천 시스템이 동작하는 방식을 설명하기 위한 흐름도이다."}
