{"patent_id": "10-2022-0016297", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0154600", "출원번호": "10-2022-0016297", "발명의 명칭": "상품 운송 수단에 설치되는 전용 단말기를 이용한 결제 방법 및 결제 시스템", "출원인": "주식회사 고스트패스", "발명자": "이선관"}}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "결제 시스템이 상품 운송 수단에 설치되는 전용 단말기를 이용한 결제를 수행하는 방법에 있어서,상기 전용 단말기가 적어도 하나 이상의 구매 대상 상품을 인식하고 인식된 상품이 상기 상품 운송 수단 내에위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시키는 단계;상기 전용 단말기가 사용자로부터 상기 상품 운송 수단 내에 위치한 적어도 하나 이상의 상품에 대한 결제를 수행하기 위한 식별 정보를 습득하고, 사용자의 생체 정보를 습득하는 단계;상기 전용 단말기가 상기 식별 정보를 통해 인식된 사용자 단말기에 상기 생체 정보 및 결제 정보를 전송하는단계; 및상기 사용자 단말기가, 수신한 상기 생체 정보를 통해 본인 인증을 수행하고 본인 인증이 성공적으로 수행된 경우 상기 결제 정보를 통해 상기 예비 구매 리스트에 포함된 상품에 대한 결제를 수행하는 단계를 포함하며,상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 과정은, 상기 전용 단말기에 탑재된 이미지 촬영부에 의해 상품의 외형 이미지가 수집되면, 상기 전용 단말기가 수집된 상품의 외형 이미지를 관리 서버로 전송하여 상기 관리 서버 상에서의 분석을 통해 상품의 종류 및 수량을 특정하는 것이며,상품의 종류 및 수량에 대한 특정은, 상기 이미지 촬영부에 의해 수집된 상품의 외형 이미지 상에서 바코드 또는 QR 코드가 인식된 상품은 바코드 또는 QR코드를 통해 상품의 종류를 특정하고, 수집된 외형 이미지 상에서바코드 또는 QR코드가 인식되지 않는 상품은 상품의 외형 이미지 분석을 통해 상품의 종류를 특정하는 것이며,상기 전용 단말기가, 인식된 구매 대상 상품이 상기 상품 운송 수단 내에 위치하는지를 판단하는 방법은, 상기관리 서버로부터 수신된 상품 이미지 분석 정보를 통해 판단하는 것이고,상기 전용 단말기에 의해 인식된 상품 중 성인 인증을 필요로 하는 상품이 존재하는 경우, 상기 결제 정보를 수신한 상기 사용자 단말기의 결제 수행은 상기 사용자 단말기 상에서 성인 인증이 완료된 경우에만 가능하도록제어되는, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 식별 정보는 PIN 번호로 구성되는 것을 특징으로 하는, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 생체 정보는 지문 정보, 홍채 정보, 안면 이미지 정보, 정맥 정보, 심전도 정보 또는 음성 정보 중 어느하나 이상을 포함하는, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 전용 단말기가 상기 사용자 단말기의 결제 수행 여부를 수신하여, 결제 완료시 특정 위치의 출입 수단의개폐를 제어하는 단계를 더 포함하는, 결제 시스템의 결제 수행 방법.공개특허 10-2022-0154600-3-청구항 5 제1항에 있어서,상기 전용 단말기가 상기 사용자 단말기의 결제 수행 여부를 수신하여, 결제 완료 정보를 상기 전용 단말기의디스플레이부 또는 음성 출력부를 통해 사용자에게 제공하는 단계를 더 포함하는, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 관리 서버가 수집된 상품의 외형 이미지를 분석하여 상품의 종류 및 수량을 특정하는 단계는,상기 관리 서버에 탑재된 인공지능 엔진에 의해 수행되는 것을 특징으로 하며, 상기 인공지능 엔진은 상품의 외형 이미지를 통해 학습을 수행하는 것인, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 인공지능이 엔진이 활용하는 기계학습 알고리즘은 하라이크(haar like), 콘볼루션 신경회로망(CNN), YOLO또는 SSD 중 하나로 구성되는, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 단계는,상기 전용 단말기가 상품에 포함된 전자 태그를 통해 상품의 정보를 획득하는 것인, 결제 시스템의 결제 수행방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "결제 시스템이 상품 운송 수단에 설치되는 카메라와 연결된 전용 단말기를 이용한 결제를 수행하는 방법에 있어서,상기 전용 단말기가 적어도 하나 이상의 구매 대상 상품을 인식하고 인식된 상품이 상기 상품 운송 수단 내에위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시키는 단계;상기 전용 단말기가 사용자로부터 상기 상품 운송 수단 내에 위치한 적어도 하나 이상의 상품에 대한 결제를 수행하기 위한 식별 정보를 습득하고, 사용자의 생체 정보를 습득하는 단계;상기 전용 단말기가 상기 식별 정보를 통해 인식된 사용자 단말기에 상기 생체 정보 및 결제 정보를 전송하는단계; 및상기 사용자 단말기가, 수신한 상기 생체 정보를 통해 본인 인증을 수행하고 본인 인증이 성공적으로 수행된 경우 상기 결제 정보를 통해 상기 예비 구매 리스트에 포함된 상품에 대한 결제를 수행하는 단계를 포함하며,상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 과정은, 상기 전용 단말기에 탑재된 이미지 촬영부에 의해 상품의 외형 이미지가 수집되면, 상기 전용 단말기가 수집된 상품의 외형 이미지를 관리 서버로 전송하여 상기 관리 서버 상에서의 분석을 통해 상품의 종류 및 수량을 특정하는 것이며,공개특허 10-2022-0154600-4-상품의 종류 및 수량에 대한 특정은, 상기 이미지 촬영부에 의해 수집된 상품의 외형 이미지 상에서 바코드 또는 QR 코드가 인식된 상품은 바코드 또는 QR코드를 통해 상품의 종류를 특정하고, 수집된 외형 이미지 상에서바코드 또는 QR코드가 인식되지 않는 상품은 상품의 외형 이미지 분석을 통해 상품의 종류를 특정하는 것이며,상기 전용 단말기가, 인식된 구매 대상 상품이 상기 상품 운송 수단 내에 위치하는지를 판단하는 방법은, 상기관리 서버로부터 수신된 상품 이미지 분석 정보를 통해 판단하는 것이고,상기 전용 단말기에 의해 인식된 상품 중 성인 인증을 필요로 하는 상품이 존재하는 경우, 상기 결제 정보를 수신한 상기 사용자 단말기의 결제 수행은 상기 사용자 단말기 상에서 성인 인증이 완료된 경우에만 가능하도록제어되는, 결제 시스템의 결제 수행 방법."}
{"patent_id": "10-2022-0016297", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "상품 운송 수단에 설치되는 전용 단말기를 활용하는 결제 시스템에 있어서,적어도 하나 이상의 구매 대상 상품을 인식하고 인식된 상품이 상기 상품 운송 수단 내에 위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시키며, 사용자로부터 상기 상품 운송 수단 내에 위치한 적어도 하나 이상의 상품에 대한 결제를 수행하기 위한 식별 정보를 습득하고, 사용자의 생체 정보를 습득하고,상기 식별 정보를 통해 인식된 사용자 단말기에 상기 생체 정보 및 결제 정보를 전송하는, 전용 단말기; 및상기 전용 단말기로부터 수신한 생체 정보를 통해 본인 인증을 수행하고, 본인 인증이 성공적으로 수행된 경우상기 결제 정보를 통해 상기 예비 구매 리스트에 포함된 상품에 대한 결제를 수행하는, 사용자 단말기;를 포함하며,상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 과정은, 상기 전용 단말기에 탑재된 이미지 촬영부에 의해 상품의 외형 이미지가 수집되면, 상기 전용 단말기가 수집된 상품의 외형 이미지를 관리 서버로 전송하여 상기 관리 서버 상에서의 분석을 통해 상품의 종류 및 수량을 특정하는 것이며,상품의 종류 및 수량에 대한 특정은, 상기 이미지 촬영부에 의해 수집된 상품의 외형 이미지 상에서 바코드 또는 QR 코드가 인식된 상품은 바코드 또는 QR코드를 통해 상품의 종류를 특정하고, 수집된 외형 이미지 상에서바코드 또는 QR코드가 인식되지 않는 상품은 상품의 외형 이미지 분석을 통해 상품의 종류를 특정하는 것이며,상기 전용 단말기가, 인식된 구매 대상 상품이 상기 상품 운송 수단 내에 위치하는지를 판단하는 방법은, 상기관리 서버로부터 수신된 상품 이미지 분석 정보를 통해 판단하는 것이고,상기 전용 단말기에 의해 인식된 상품 중 성인 인증을 필요로 하는 상품이 존재하는 경우, 상기 결제 정보를 수신한 상기 사용자 단말기의 결제 수행은 상기 사용자 단말기 상에서 성인 인증이 완료된 경우에만 가능하도록제어되는, 결제 시스템."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "상품 운송 수단에 설치되는 전용 단말기를 이용한 결제 방법 및 결제 시스템이 개시된다. 상술한 과제를 해결하기 위한 본 발명의 다양한 실시예 중 하나에 따르면, 결제 시스템이 상품 운송 수단에 설치 되는 전용 단말기를 이용한 결제를 수행하는 방법은, 상기 전용 단말기가 적어도 하나 이상의 구매 대상 상품을 (뒷면에 계속)"}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 상품 운송 수단에 설치되는 전용 단말기를 이용하여 소비자가 구매하고자 하는 상품 을 인식하고 결제를 수행하는 기술에 대한 것이다."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술이 발전하면서 물건을 구매할 때의 결제 방식도 점차 다양화되고 있다. 특히, 대부분의 사람들이 항상 소지 하고 있는 스마트폰을 통해 결제를 수행하는 방법이 많이 개발되고 있다. 예를 들어, 소비자가 자신의 스마트폰에 탑재되어 있는 카메라 또는 기타 수단을 활용하여 구매하고자 하는 상 품을 인식하고 스마트폰을 통해 결제를 수행할 수 있다. 다만, 대형마트 등과 같이 소비자가 다수의 상품을 구매하게 되는 경우에 소비자가 구매하고자 하는 상품들을 일일이 인식하는데에는 불편함이 존재하였다.따라서, 사용자가 직접 자신의 스마트폰과 같은 단말기를 이용하여 상품을 하나씩 인식하지 않아도 자동으로 소 비자가 구매하고자 하는 상품을 인식하여 결제할 수 있도록 하는 시스템의 필요성이 존재하였다. 또한, 소비자가 자신의 스마트폰을 수중에 소지하지 않은 상황에서도 스마트폰을 활용하여 결제를 수행할 수 있 는 시스템이나, 수중에 소지한 스마트폰의 조작을 최소한으로 축소한 방식으로 결제를 수행할 수 있는 시스템이 필요한 실정이었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허 제10-2021-0010598호"}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 다양한 실시예는 오프라인 상에서 소비자가 보유하고 있는 단말기의 조작을 최소화하는 방식의 자동 결제 시스템을 구축하는 것을 목적으로 한다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 다양한 실시예 중 하나에 따르면, 결제 시스템이 상품 운송 수단에 설 치되는 전용 단말기를 이용한 결제를 수행하는 방법에 있어서, 상기 전용 단말기가 적어도 하나 이상의 구매 대 상 상품을 인식하고 인식된 상품이 상기 상품 운송 수단 내에 위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시키는 단계; 상기 전용 단말기가 사용자로부터 상기 상품 운송 수단 내에 위치한 적어도 하 나 이상의 상품에 대한 결제를 수행하기 위한 식별 정보를 습득하고, 사용자의 생체 정보를 습득하는 단계; 상 기 전용 단말기가 상기 식별 정보를 통해 인식된 사용자 단말기에 상기 생체 정보 및 결제 정보를 전송하는 단 계; 및 상기 사용자 단말기가, 수신한 상기 생체 정보를 통해 본인 인증을 수행하고 본인 인증이 성공적으로 수 행된 경우 상기 결제 정보를 통해 상기 예비 구매 리스트에 포함된 상품에 대한 결제를 수행하는 단계를 포함하 는, 결제 시스템의 결제 수행 방법이 개시될 수 있다. 상기 식별 정보는 PIN 번호로 구성되는 것을 특징으로 할 수 있다. 상기 생체 정보는 지문 정보, 홍채 정보, 안면 이미지 정보, 정맥 정보, 심전도 정보 또는 음성 정보 중 어느 하나 이상을 포함할 수 있다. 상기 결제 시스템의 결제 수행 방법은, 상기 전용 단말기가 상기 사용자 단말기의 결제 수행 여부를 수신하여, 결제 완료시 특정 위치의 출입 수단의 개폐를 제어하는 단계를 더 포함할 수 있다. 상기 결제 시스템의 결제 수행 방법은, 상기 전용 단말기가 상기 사용자 단말기의 결제 수행 여부를 수신하여, 결제 완료 정보를 상기 전용 단말기의 디스플레이부 또는 음성 출력부를 통해 사용자에게 제공하는 단계를 더 포함할 수 있다. 상기 전용 단말기는, 인식한 상품 중 성인 인증을 필요로 하는 상품이 존재하는 경우 상기 사용자 단말기로부터 성인 인증 관련 정보를 수신하는 경우에만 결제 정보를 상기 사용자 단말기로 전송하는 것을 특징으로 할 수 있 다. 상기 전용 단말기에 의해 인식된 상품 중 성인 인증을 필요로 하는 상품이 존재하는 경우, 상기 결제 정보를 수 신한 상기 사용자 단말기의 결제 수행은 상기 사용자 단말기 상에서 성인 인증이 완료된 경우에만 가능하도록 제어될 수 있다. 상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 과정은, 상기 전용 단말기에 탑재된 이미지 촬영부에 의 해 상품의 외형 이미지가 수집되면, 상기 전용 단말기가 수집된 상품의 외형 이미지를 관리 서버로 전송하여 상기 관리 서버 상에서의 분석을 통해 상품의 종류 및 수량을 특정하는 것일 수 있다. 상기 관리 서버가 수집된 상품의 외형 이미지를 분석하여 상품의 종류 및 수량을 특정하는 단계는, 상기 관리 서버에 탑재된 인공지능 엔진에 의해 수행되는 것을 특징으로 하며, 상기 인공지능 엔진은 상품의 외형 이미지 를 통해 학습을 수행할 수 있다. 상기 인공지능이 엔진이 활용하는 기계학습 알고리즘은 하라이크(haar like), 콘볼루션 신경회로망(CNN), YOLO 또는 SSD 중 하나로 구성될 수 있다. 상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 단계는, 상기 전용 단말기가 상품에 포함된 전자 태그를 통해 상품의 정보를 획득하는 것일 수 있다. 상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 단계는, 상기 전용 단말기에 탑재된 이미지 촬영부에 의 해 바코드 또는 QR코드가 인식되면, 상기 전용 단말기가 수집된 바코드 또는 QR코드에 대응되는 상품의 종류를 특정하는 것일 수 있다. 상기 전용 단말기가 구매 대상이 되는 상품을 인식하는 단계는, 상기 전용 단말기에 탑재된 이미지 촬영부에 의 해 바코드 또는 QR 코드가 인식된 상품은 바코드 또는 QR코드를 통해 상품의 종류를 특정하고, 수집된 이미지 상에서 바코드 또는 QR코드가 인식되지 않는 상품은 상품의 외형 이미지 분석을 통해 상품의 종류를 특정하는 것일 수 있다. 상술한 과제를 해결하기 위한 본 발명의 다양한 실시예 중 하나에 따르면, 결제 시스템이 상품 운송 수단에 설 치되는 카메라와 연결된 전용 단말기를 이용한 결제를 수행하는 방법에 있어서, 상기 전용 단말기가 적어도 하 나 이상의 구매 대상 상품을 인식하고 인식된 상품이 상기 상품 운송 수단 내에 위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시키는 단계; 상기 전용 단말기가 사용자로부터 상기 상품 운송 수단 내에 위치한 적어도 하나 이상의 상품에 대한 결제를 수행하기 위한 식별 정보를 습득하고, 사용자의 생체 정보를 습 득하는 단계; 상기 전용 단말기가 상기 식별 정보를 통해 인식된 사용자 단말기에 상기 생체 정보 및 결제 정보 를 전송하는 단계; 및 상기 사용자 단말기가, 수신한 상기 생체 정보를 통해 본인 인증을 수행하고 본인 인증이 성공적으로 수행된 경우 상기 결제 정보를 통해 상기 예비 구매 리스트에 포함된 상품에 대한 결제를 수행하는 단계를 포함하는, 결제 시스템의 결제 수행 방법이 개시될 수 있다. 상술한 과제를 해결하기 위한 본 발명의 다양한 실시예 중 다른 하나에 따르면, 상품 운송 수단에 설치되는 전 용 단말기를 활용하는 결제 시스템에 있어서, 적어도 하나 이상의 구매 대상 상품을 인식하고 인식된 상품이 상 기 상품 운송 수단 내에 위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시키며, 사용자 로부터 상기 상품 운송 수단 내에 위치한 적어도 하나 이상의 상품에 대한 결제를 수행하기 위한 식별 정보를 습득하고, 사용자의 생체 정보를 습득하고, 상기 식별 정보를 통해 인식된 사용자 단말기에 상기 생체 정보 및 결제 정보를 전송하는, 전용 단말기; 및 상기 전용 단말기로부터 수신한 생체 정보를 통해 본인 인증을 수행하 고, 본인 인증이 성공적으로 수행된 경우 상기 결제 정보를 통해 상기 예비 구매 리스트에 포함된 상품에 대한 결제를 수행하는, 사용자 단말기;를 포함하는, 결제 시스템이 개시될 수 있다."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 상품 운송 수단에 설치되는 전용 단말기를 통해 결제가 이루어질 수 있으며, 소비 자가 자신의 단말기를 보유하고 있지 않은 상황에서도 본인 인증을 통한 결제가 수행될 수 있다."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있음을 의미한다. 또한, 명세서에 기재된 \"...부\", \"모듈\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 본 명세서 상에서, '사용자'는 본 발명의 결제 시스템을 활용하여 특정 상품을 구매하는 소비자와 같은 주체를 의미할 수 있으며, '판매자'는 본 발명의 결제 시스템을 활용하여 상품들을 판매하는 주체를 의미할 수 있다. 또한, 상품 운송 수단은 특정 지역 내에서 소비자가 구매하고자 하는 상품들을 보관하는 수단으로, 상품 판매 장소에서 사용되는 카트, 바구니 또는 가방 등으로 구성될 수 있으며, 바구니는 비닐 봉투, 장바구니 등으로 구 성될 수 있으나 이와 같은 예시에 한정되지는 않는다. 이하, 첨부된 도면들을 참조하여 본 발명의 다양한 실시예들을 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 결제 시스템이 동작하는 전체 환경에 대한 개략도이다. 도 1을 참조하면, 결제 시스템은 전용 단말기, 사용자 단말기, 관리 서버, 외부 서버 및 출입 수단을 포함하는 형태로 구성될 수 있다. 결제 시스템은 오프라인 상에서 다양한 상품을 판매하는 장소에 설치되어 활용될 수 있다. 전용 단말기는 상품 운송 수단에 설치되어 동작할 수 있다. 전용 단말기는 사용자가 구매하고 싶 은 상품을 상품 운송 수단으로 이동시키는 경우 해당 상품을 인식하고 해당 상품을 예비 구매 리스트에 포 함시킬 수 있으며, 추후 예비 구매 리스트에 포함된 상품들에 대한 결제 정보를 생성하여 사용자 단말기로 전송할 수 있다. 일 실시예에 따르면, 전용 단말기는 상품 운송 수단에 설치되는 카메라와 연동되어 동작할 수 있으며, 카메라에 의해 촬영되는 이미지를 수신하여 이를 기초로 상품의 인식 및 결제를 위한 동작을 수행할 수 있다. 이 경우, 전용 단말기는 사용자가 셀프로 상품을 인식시켜 결제할 수 있는 셀프 데스크 또는 결제 카운터 에 위치할 수 있으며 POS 단말기 또는 키오스크 기기로 구현될 수도 있다. 사용자 단말기는 사용자에 의해 보유되고 제어되는 단말기로, 웹 브라우저 또는 사용자 단말기 상에 설치된 컴퓨터 소프트웨어 또는 어플리케이션을 통하여 결제 시스템 내의 전용 단말기 또는 관리 서버 에 접속할 수 있다. 사용자 단말기는 결제 시스템 내의 전용 단말기, 관리 서버 및 외 부 서버와 각종 데이터를 주고받을 수 있으며, 이와 같은 데이터를 기초로 하여 사용자 단말기의 화 면(디스플레이부)을 통해 표시할 내용을 결정할 수 있다. 전용 단말기 또는 사용자 단말기는 휴대폰, 스마트폰, PDA(Personal Digital Assistant), PMP(Portable Multimedia Player), 태블릿 PC, 등과 같이 네트워크를 통하여 웹 서버와 연결될 수 있는 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있으며, 개인용 컴퓨터(예를 들어, 데스크탑 컴 퓨터, 노트북 컴퓨터 등), 워크스테이션, PDA, 웹 패드 등과 같이 메모리 수단을 구비하고 마이크로 프로세서를 탑재하여 연산 능력을 갖춘 디지털 기기 중 하나일 수도 있다. 사용자 단말기는 사용자가 결제 시스템을 이용하여 구매하기 원하는 상품들에 대한 결제를 수행하는 역할을 수행할 수 있다. 사용자 단말기는 전용 단말기로부터 각종 정보를 주고받을 수 있으며 이와 같은 통신은 관리 서버를 중간 매개로 이루어질 수도 있다. 사용자 단말기는 전용 단말기로부터 적어도 하나 이상의 상품에 대한 정보를 수신할 수 있으며, 상품 에 대한 정보는 전용 단말기에 의해 관리되는 예비 구매 리스트의 형식으로 전달될 수도 있다. 사용자 단 말기는 전용 단말기로부터 수신한 상품 정보를 기초로 결제를 수행할 수 있으며, 결제를 위해서 본인 인증 또는 성인 인증이 선행되어야 할 수도 있다. 관리 서버는 결제 시스템이 원활하게 동작하도록 데이터를 관리하고 필요한 데이터를 전용 단말기 및 사용자 단말기와 주고받을 수 있다. 예를 들어, 관리 서버는 복수의 오프라인 상점을 총체 적으로 관리할 수 있으며 그에 따라 복수의 오프라인 상점 내에 위치한 전용 단말기들과, 오프라인 상점에 서 상품을 구매하기 위해 결제를 수행하고자 하는 사용자 단말기들과 통신을 수행할 수 있다. 외부 서버는 관리 서버와 별도로 존재하는 서버로, 일 실시예에 따르면 관리 서버는 결제 시스 템의 원활한 운영을 위해 필요한 각종 데이터를 외부 서버로부터 획득할 수 있으며, 전용 단말기 또는 사용자 단말기 또한 외부 서버와의 통신으로 필요한 데이터를 획득할 수 있다. 예를 들어, 외부 서버는 판매할 상품을 제공하는 도매 업체 등이 관리하는 서버, 결제를 수행하기 위해 통신이 필요한 신용 카드 서버, PG 서버 등으로 구성될 수 있다. 이와 같은 관리 서버 및 외부 서버는 적어도 하나의 프로세서를 가지는 제어부, 통신 모듈, 저장부 (예: 메모리) 등과 같은 하드웨어 또는 알고리즘 연산을 위한 소프트웨어를 포함하여 구성될 수 있다. 출입 수단은 사용자가 상품을 구매하는 오프라인 상의 특정 공간을 외부 또는 타 공간으로부터 분리하며, 개폐 형식으로 동작하는 게이트나 출입문 형태로 구성될 수 있다. 일 실시예에 따르면, 출입 수단은 전용 단말기 또는 관리 서버에 의해 개폐 동작이 제어될 수 있다. 본 발명의 일 실시예에 따르면, 결제 시스템 내에서 전용 단말기, 사용자 단말기, 관리 서버 , 외부 서버 및 출입 수단가 통신하기 위해서 사용하는 통신망은 유선 및 무선 등과 같은 그 통 신 양태를 가리지 않고 구성될 수 있으며, 예를 들면, 근거리 통신망(LAN: Local Area Network), 도시권 통신망 (MAN: Metropolitan Area Network), 광역 통신망(WAN: Wide Area Network) 등 다양한 통신망으로 구현될 수 있 다. 바람직하게는, 본 발명의 일 실시예에 따른 통신망은 공지의 월드와이드웹(WWW: World Wide Web) 등일 수 도 있다. 무선통신은, 예를 들면, LTE, LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UWB(ultra wide band) UMTS(universal mobile telecommunications system), WiBro(Wireless Broadband), 또는 GSM(Global System for Mobile Communications) 등 중 적어도 하나를 사용하는 셀룰러 통신 을 포함할 수 있다. 한 실시예에 따르면, 무선 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스, 블루투 스 저전력(BLE), 지그비(Zigbee), NFC(near field communication), 자력 시큐어 트랜스미션(Magnetic Secure Transmission), 라디오 프리퀀시(RF), 또는 보디 에어리어 네트워크(BAN) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 무선 통신은 GNSS를 포함할 수 있다. GNSS는, 예를 들면, GPS(Global Positioning System), Glonass(Global Navigation Satellite System), Beidou Navigation Satellite System 또는 Galileo, the European global satellite-based navigation system일 수 있다. 도 2는 본 발명의 일 실시예에 따른 전용 단말기의 구성을 개략적으로 나타낸 블록도이다. 도 2를 참조하면, 전용 단말기는 상품 인식부, 구매 리스트 관리부, 식별 정보 습득부, 생 체 정보 관리부, 결제 정보 관리부, 출입 수단 관리부, 통신부, 저장부 및 제어부 를 포함하여 구성될 수 있다. 상품 인식부는 다양한 인식 방법을 통해 사용자가 상품 운송 수단에 위치시키는 상품을 인식할 수 있 다. 일 실시예에 따르면, 상품 인식부는 주변을 시각적으로 촬영하여 이미지를 생성할 수 있다. 즉, 상품 인식 부는 전용 단말기에 탑재된 카메라 모듈 또는 캠코더 모듈과 같은 이미지 수집 장치를 활용하여 외부 의 상품에 대한 이미지를 습득할 수 있다. 상품 인식부가 수집하는 이미지는 정지된 상태의 사진 형태로구성될 수 있으나 복수의 프레임으로 구성된 영상의 형태로 구성될 수도 있다. 일 실시예에 따른 상품 인식부는 사용자의 조작 없이 자동으로 동작하여 이미지 촬영을 수행할 수 있으며, 이와 달리 사용자가 전용 단말기를 특정 방식으로 조작함으로써 이미지 촬영을 시작할 수도 있다. 일 실시예에 따르면, 상품 인식부는 촬영된 이미지 상에서 구매 대상이 되는 상품을 인식함에 있어 이미지 분석을 통해 상품을 인식할 수 있다. 이와 같은 이미지 분석은 전용 단말기에서 수행될 수도 있지만, 관리 서버에서 수행될 수도 있다. 관리 서버 상에서 이미지 분석이 수행되는 경우, 상품 인식부는 촬 영된 이미지를 관리 서버로 전송하고 관리 서버로부터 해당 이미지를 분석하여 특정한 상품에 대한 정보를 수신할 수 있다. 전용 단말기 또는 관리 서버 상에서 수행되는 이미지 분석은, 전용 단말기 또는 관리 서버(30 0)가 포함하는 인공지능 엔진에 의해 수행될 수 있다. 이와 같은 인공지능 엔진은 기계학습 또는 딥러닝 기술을 활용하여 이미지 분석을 수행할 수 있다. 인공지능 엔진은 복수의 상품 이미지를 학습 데이터로 설정하고 설정 된 학습 데이터를 통해 학습을 수행함으로써 이미지 분석 능력을 향상시킬 수 있다. 상기 인공지능 엔진이 활용하는 기계학습은 하라이크(haar like)와 콘볼루션 신경회로망(cnn) 또는 콘볼루션 신 경 회로망 기반 변형모델(R-CNN, Fast R-CNN, Faster R-CNN, YOLO, SSD, Mask R-CNN) 중 적어도 하나의 알고리 즘을 활용하는 것일 수 있다. 이와 같은 인공지능 엔진은 전용 단말기 또는 관리 서버 상에서 하드웨어적 또는 소프트웨어적으로 구현될 수 있다. 일 실시예에 따르면, 상품 인식부는 상품의 외형 이미지를 분석하는 방식이 아닌, 구매 대상이 되는 상품 에 표시된 바코드 또는 QR코드를 인식하는 방식으로 구매 대상 상품을 인식할 수 있다. 즉, 상품 인식부는 촬영된 이미지 상에 존재하는 바코드 또는 QR코드를 인식하여, 수집된 바코드 또는 QR코드에 대응되는 상품의 종류 및 개수를 특정할 수 있다. 본 발명의 일 실시예에 따르면, 상품 인식부는 촬영된 이미지를 기반으로 구매 대상 상품을 인식함에 있어, 상품의 외형 이미지를 분석하는 방법과, 상품에 표시된 바코드 또는 QR코드를 활용하는 방법을 종합적으 로 활용할 수 있다. 상세하게는, 상품 인식부가 구매 대상이 되는 상품을 인식함에 있어 수집된 이미지 상에서 바코드 또는 QR 코드가 인식된 상품은 인식된 바코드 또는 QR코드를 통해 상품의 종류를 특정하고, 수집된 이미지 상에서 바코 드 또는 QR코드가 인식되지 않는 상품은 상품의 외형 이미지 분석을 통해 상품의 종류를 특정할 수 있다. 즉, 상품 인식부가 습득하는 이미지 상에는 상품의 일부 모습만이 나타날 수 있으므로 그에 따라 상품 외 관에 표시된 바코드 또는 QR코드가 인식되지 않을 수 있고, 외형 이미지 분석을 통한 상품 인식 방법을 함께 활 용함으로써 상품 인식의 정확도를 높일 수 있다. 이와 같은 상품 인식부의 동작은 상품 인식부가 수집된 이미지를 관리 서버로 전송함에 따라 관리 서 버 상에서 수행될 수 있다. 본 발명의 일 실시예에 따르면, 상품 인식부는 구매 대상이 되는 상품을 인식함에 있어 촬영된 이미지 분 석 기반이 아닌 전자 태그 인식 방식으로 상품의 정보를 획득할 수 있도록 한다. 전자 태그는 RFID(Radio Frequency Identification), NFC(Near Field Communicaion) 기술을 활용한 형태로 적 용될 수 있으며, 전자 태그는 가격을 포함한 상품의 정보를 포함한 형태로 각 상품에 포함되거나 부착되어 있을 수 있다. 상품 인식부는 전자 태그를 활용하여 상품을 인식하는 경우, 전용 단말기와 일정 간격 이내에 위치하 는 전자 태그를 인식하여 이를 통해 사용자 단말기가 구매 대상이 되는 상품을 인식하도록 할 수 있다. 구매 리스트 관리부는 상품 인식부에 의해 인식된 상품이 상품 운송 수단 내에 위치하는 것으로 판단되는 경우 해당 상품을 예비 구매 리스트로 포함시킬 수 있다. 즉, 구매 리스트 관리부는 상품 인식부에 의해 인식된 상품이 상품 운송 수단 내에 위치하는지에 따라 해당 상품을 예비 구매 리스트에 포함할지 여부를 결정할 수 있다. 일 실시예에 따르면, 구매 리스트 관리부는 예비 구매 리스트로 포함되었던 상품이 상품 운송 수단에 서 제거되는 것을 인식하여 인식된 상품을 예비 구매 리스트 상에서 삭제할 수 있다. 식별 정보 습득부는 사용자로부터 결제를 수행하기 위한 식별 정보를 수집할 수 있다. 이와 같은 식별 정 보의 수집은 전용 단말기의 입력부를 통해 수행될 수 있으며, 전용 단말기는 터치 스크린, 키보드, 마우스, 음성 인식 등의 입력부를 통해 사용자로부터 식별 정보를 습득할 수 있다. 식별 정보 습득부는 습득한 식별 정보를 통해 사용자 및 사용자 단말기의 정보를 특정할 수 있다. 식별 정보는 아이디, 비밀 번호, PIN 번호 등 또는 이들의 조합으로 구성될 수 있다. 일 실시예에 따르면, PIN 번호는 후술될 생체 정보로 대체될 수 있다. 생체 정보 관리부는 식별 정보 습득부가 사용자로부터 식별 정보를 습득한 이후 또는 습득하는 과정 에서, 사용자의 생체 정보를 습득할 수 있다. 이와 같은 생체 정보는 결제를 위한 본인 인증에 활용될 수 있다. 일 실시예에 따르면, 전용 단말기는 별도의 본인 인증 장치와 통신하여 생체 정보를 습득하고 관리할 수도 있다. 본 발명의 일 실시예에 따르면, 결제를 위한 본인 인증에 활용되는 생체 정보는 지문 정보, 홍채 정보, 안면 이 미지 정보, 정맥 정보, 심전도 정보 또는 음성 정보 중 어느 하나 또는 이들의 조합으로 구성될 수 있다. 본 발명의 일 실시예에 따르면, 생체 정보는 전용 단말기, 사용자 단말기, 관리 서버 또는 기타 클라우드 등에 분산 저장되어 인증이 수행될 수 있다. 즉, 하나의 생체 정보는 전술된 매체 중 적어도 하나 이 상에 저장되어 보관될 수 있으며 특정 매체에는 생체 정보의 적어도 일부가 분산된 형태로 저장될 수도 있다. 예를 들어, 생체 정보는 암호화된 벡터 데이터, 패턴값 또는 해시값 중 하나의 형태로 저장될 수 있으며, 사용 자 단말기, 관리 서버 또는 기타 클라우드 환경 내에 저장될 수 있다. 일 실시예에 따르면, 생체 정보 관리부는 무선 통신 회로를 이용하여 관리 서버 또는 외부 서버(40 0)로 사용자의 센싱 정보를 전송하고, 관리 서버 또는 외부 서버로부터 본인인증 장치에 대한 휴대폰 전화 번호와 같은 식별 정보를 획득할 수 있다. 또한, 생체 정보 관리부는 무선 통신 회로를 이용하여 사 용자의 센싱 정보를 식별된 본인 인증 장치로 전송하고 본인 인증 장치로부터 인증 데이터를 수신할 수 있다. 생체 정보 관리부는 인증 데이터에 기반하여 정해진 기능을 수행하거나 입출력 장치를 통해 인증 실패 메 시지를 출력할 수 있다. 결제 정보 관리부는 예비 구매 리스트에 포함된 상품들에 대한 결제 정보를 생성하고 이를 식별 정보 습득 부에 의해 특정된 사용자 단말기로 전송할 수 있다. 이 과정에서, 생체 정보 관리부는 습득한 사용자의 생체 정보를 함께 사용자 단말기로 전송할 수 있다. 사용자 단말기는 전용 단말기로부터 생체 정보와 결제 정보를 수신할 수 있으며, 일 실시예에 따르면 생체 정보와 결제 정보는 관리 서버를 통해 사용자 단말기로 전달될 수도 있다. 사용자 단말기는 수신된 생체 정보를 통해 본인 인증을 수행할 수 있다. 즉, 사용자 단말기는 수신한 생체 정보와 사용자 단말기 상에 미리 저장되어 있는 생체 정보의 일치 여부를 판단하고 이를 기반으로 본 인 인증을 수행할 수 있다. 본인 인증이 성공적으로 수행된 경우, 사용자 단말기는 수신된 결제 정보를 통 해 예비 구매 리스트에 포함된 상품들에 대한 결제를 수행할 수 있다. 사용자 단말기는 결제를 수행한 이후 완료된 결제에 대한 정보를 전용 단말기 또는 관리 서버로 전송할 수 있다. 결제 수행 여부에 대한 정보를 수신한 전용 단말기는 결제 완료 정보를 전용 단말기(10 0)의 디스플레이부 또는 음성 출력부를 통해 사용자에게 제공할 수도 있다. 사용자 단말기는 신용카드 결제, 체크카드 결제, 직불카드 결제, 계좌이체 결제, 가상화폐 결제, 포인트 결제, 오픈 뱅킹 결제, 휴대폰 소액 결제 등 다양한 결제 방법을 통해 결제를 진행할 수 있으며, 이와 같은 결 제 방법은 생체 정보를 통한 본인 인증을 활용한 것일 수도 있다. 사용자 단말기 상에서 카드를 통한 결제 는 PG(Payment Gateway)사 서버를 통해서 수행될 수도 있으나, PG사 서버를 거치지 않고 카드사 서버와 직접 연 결되어 결제가 수행될 수도 있다. 사용자 단말기는 PISP(지급지시 대행서비스 제공업자)를 통한 결제를 수행할 수 있다. PISP는 오픈 API를 통해 기존 은행들의 결제 인프라를 활용하지 않는 형태의 금융 서비스를 제공하며, 소비자들이 특정 서비스에 로그인하는 것만으로 소비자들이 보유하고 있는 계좌를 활용하여 결제나 송금을 수행할 수 있도록 한다.일 실시예에 따르면, 결제 정보 관리부는, 상품 인식부에 인식되어 예비 구매 리스트에 포함된 상품 중 성인 인증을 필요로 하는 상품(예를 들어, 주류, 담배류 등)이 존재하는 경우 사용자 단말기로부터 성 인 인증 관련 정보를 수신하는 경우에만 결제 정보를 사용자 단말기로 전송할 수 있다. 다른 실시예에 따르면, 결제 정보 관리부는 상품 인식부에 인식되어 예비 구매 리스트에 포함된 상품 중 성인 인증을 필요로 하는 상품이 존재하는 경우, 결제 정보를 수신한 사용자 단말기 상에서의 결제 수 행이 사용자 단말기 상에서 성인 인증이 완료된 경우에만 가능하도록 결제 정보를 생성하여 전송할 수 있 다. 출입 수단 관리부는 전용 단말기가 사용자 단말기로부터 결제 완료에 대한 정보를 수신하면, 이 를 기초로 특정 위치의 출입 수단의 개폐를 제어할 수 있다. 예를 들어, 출입 수단은 특정 영업장의 출구일 수 있으며, 출입 수단 관리부는 상품 운송 수단 내에 위치한 상품들의 결제를 완료한 사용자만이 해당 출구를 통과할 수 있도록 출입 수단을 제어할 수 있 다. 일 실시예에 따르면, 출입 수단 관리부는 전용 단말기의 위치를 파악하고, 전용 단말기의 위치 가 출입 수단 인근에 위치한 경우에만 출입 수단이 열리도록 제어할 수 있다. 통신부는 전용 단말기가 사용자 단말기, 관리 서버, 외부 서버 및 출입 수단 등 과의 통신을 수행할 수 있도록 한다. 통신부가 통신을 수행하기 위해서 사용하는 통신망은 유선 및 무선 등과 같은 그 통신 양태를 가리지 않고 구성될 수 있으며, 예를 들면, 근거리 통신망(LAN: Local Area Network), 도시권 통신망(MAN: Metropolitan Area Network), 광역 통신망(WAN: Wide Area Network) 등 다양한 통신망으로 구현될 수 있다. 근거리 통신망은 전술한 바와 같이 UWB(Ultra Wideband), NFC(Near Field Communication), 초음파, MAT, 비콘 등을 통해 구현될 수 있다. 저장부는 전용 단말기의 각종 구성부 내에서 수집되고, 생성되고, 가공되는 정보들을 저장하는 역할 을 수행한다. 즉, 저장부에는 사용자에 대한 정보, 결제 수단에 대한 정보, 인공지능 엔진이 사용하는 알 고리즘에 대한 정보 등이 저장될 수 있다. 이러한 저장부는 예를 들어, 메모리(memory), 캐시(cash), 버퍼 (buffer) 등을 포함할 수 있으며, 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성 될 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 본인 인증 장 치의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨어, 어플리케이션 프 로그래밍 인터페이스(API), 및/또는 어플리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 메모리 는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM, SRAM, 또는 SDRAM 등), 비휘발성 메모리(예: OTPROM(one time programmable ROM), PROM, EPROM, EEPROM, mask ROM, flash ROM, 플래시 메모리, 하드 드라이브, 또는 솔리드 스테이트 드라이브 (SSD) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD, Mini-SD, xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱 등을 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통하여 본인 인증 장치와 기능적으로 또는 물리 적으로 연결될 수 있다. 제어부는 상품 인식부, 구매 리스트 관리부, 식별 정보 습득부, 생체 정보 관리부, 결제 정보 관리부, 출입 수단 관리부, 통신부 및 저장부 간의 데이터 흐름을 제어하는 기 능을 수행할 수 있다. 즉, 제어부는 상품 인식부, 구매 리스트 관리부, 식별 정보 습득부, 생체 정보 관리부, 결제 정보 관리부, 출입 수단 관리부, 통신부 및 저장부에서 각각 고유한 기능을 수행하도록 지원할 수 있다. 도 2에서 상품 인식부, 구매 리스트 관리부, 식별 정보 습득부, 생체 정보 관리부, 결제 정보 관리부 및 출입 수단 관리부는 제어부를 기능적으로 분류한 구성이므로 하나의 제어부 로서 통합되어 구성될 수 있다. 도 3은 본 발명의 일 실시예에 따른 관리 서버의 구성을 개략적으로 나타낸 블록도이다. 도 3을 참조하면, 관리 서버는 상품 특정부, 구매 리스트 관리부, 식별 정보 관리부, 생체 정보 관리부, 결제 정보 관리부, 출입 수단 관리부, 통신부, 저장부 및 제어부를 포함하는 형태로 구성될 수 있다. 관리 서버의 상품 특정부, 구매 리스트 관리부, 식별 정보 관리부, 생체 정보 관리부 , 결제 정보 관리부, 출입 수단 관리부, 통신부, 저장부 및 제어부는 각각 전 용 단말기의 상품 인식부, 구매 리스트 관리부, 식별 정보 습득부, 생체 정보 관리부 , 결제 정보 관리부, 출입 수단 관리부, 통신부, 저장부 및 제어부에 대응되어 유사한 역할을 수행할 수 있다. 예를 들어, 상품 특정부는 상품 인식부에 의해 촬영된 이미지를 수신하여 이를 인공지능 엔진을 통해 분석하여 인식된 상품을 특정하고 특정된 상품에 대한 정보를 전용 단말기로 전송하거나 구매 리스트에 추 가시킬 수 있다. 또한, 구매 리스트 관리부, 식별 정보 관리부, 생체 정보 관리부는 각각 전용 단말기로부터 구매 리스트, 식별 정보, 사용자의 생체 정보를 수신하여 이를 관리하고 활용할 수 있다. 결 제 정보 관리부 및 출입 수단 관리부 또한 전용 단말기로부터 결제 정보 및 출입 수단에 대한 관리 정보를 수신하여 이를 관리하고 활용할 수 있다. 즉, 관리 서버는 전용 단말기의 대응되는 구성부로부터 필요한 데이터를 수신하여 관리할 수 있으며 이를 사용자 단말기, 외부 서버 또는 출입 수단으로 전달하는 중개 역할을 수행할 수 있다. 일 실시예에 따른 관리 서버는 사용자가 상품을 구매하는 특정 공간 내에 위치할 수도 있으나, 이와 달리 특정 공간 외부에 위치하여 복수의 영업점을 함께 관리할 수도 있다. 이와 같이, 본 발명의 실시예에 따르면 사용자 단말기 및 관리 서버가 사용자가 상품을 구매하는 오 프라인 영업점 내에 위치하지 않은 경우에도 상품 운송 수단에 설치된 전용 단말기 만을 통해 상품의 인식과 결제가 이루어질 수 있다. 도 4는 본 발명의 일 실시예에 따른 전용 단말기가 본 발명의 결제 시스템을 활용하여 상품을 인식하 고 결제하는 방식을 설명하기 위한 흐름도이다. 도 4를 참조하면, 상품 운송 수단에 설치되는 전용 단말기는 외부 이미지 촬영을 통해 상품의 이미지 를 촬영하는 방식으로 상품의 개수 및 종류를 특정할 수 있다. 전용 단말기는 전술된 것과 같이 다양한 방식을 통해 사용자가 구매하고자 하는 상품을 인식할 수 있다. 도 4에서는 이와 같은 다양한 방식 중 이미지 분석 방식을 통해 상품의 종류 및 개수 등이 특정되는 방식이 사 용되는 과정을 예시로 설명하기로 한다. 전용 단말기는 외부 이미지 촬영을 통해 사용자가 구매하고자 하는 상품에 대한 이미지를 촬영할 수 있으 며(S410), 촬영된 이미지를 관리 서버로 전송할 수 있다(S420). 관리 서버는 전용 단말기로부터 상품에 대한 이미지를 수신하여 이미지에 대한 분석을 수행할 수 있 다. 이와 같은 이미지 분석은 관리 서버에 탑재되어 있는 인공지능 엔진에 의해 수행될 수 있으며, 상품 이미지 자체 분석뿐 아니라 이미지에 포함된 바코드 또는 QR코드 등의 인식을 통해 상품의 종류 및 개수 등이 특정될 수도 있다. 전용 단말기는 관리 서버로부터, 상품 이미지의 분석을 통해 인식된 상품에 대한 정보를 수신할 수 있으며(S430), 이후 인식된 상품이 상품 운송 수단 내에 위치하는지를 판단하여 인식된 상품이 상품 운송 수단 내에 위치한다고 판단되는 경우 해당 상품을 예비 구매 리스트에 포함시킬 수 있다(S440). 이후, 사용자가 상품 운송 수단 내에 있는 상품들을 구매하고자 하는 경우 사용자는 전용 단말기에 식 별 정보를 입력할 수 있으며, 전용 단말기는 사용자로부터 식별 정보를 수신하여 이를 기초로 사용자 정보 를 불러와 사용자 단말기를 특정할 수 있다(S450). 전용 단말기는 사용자의 생체 정보를 습득할 수 있으며, 예비 구매 리스트에 포함된 상품들에 대한 결제 정보를 생성하여 생체 정보 및 결제 정보를 사용자 단말기 측으로 전송할 수 있다(S460). 사용자 단말기 측에서는 전용 단말기로부터 수신한 생체 정보를 통해 본인 인증이 수행될 수 있으며, 이는 전용 단말기로부터 수신된 생체 정보와 사용자 단말기 상에 저장되어 있던 생체 정보의 비교를 기초로 수행될 수 있다. 이후, 본인 인증이 정상적으로 완료되면 사용자 단말기에서는 전용 단말기로 부터 수신한 결제 정보를 통한 결제가 수행될 수 있다.이와 같은 결제는 신용카드 결제, 체크카드 결제, 직불카드 결제, 계좌이체 결제, 가상화폐 결제, 포인트 결제, 오픈 뱅킹 결제, 휴대폰 소액 결제, PISP를 통한 결제 등 다양한 결제 방법을 통해 수행될 수 있다. 사용자 단말기는 결제를 수행한 이후, 결제 완료에 대한 정보를 전용 단말기로 전송할 수 있으며, 전 용 단말기는 사용자 단말기로부터 결제 수행 여부를 수신하여 결제가 정상적으로 완료된 경우 출입 수단을 개방 상태로 제어할 수 있다(S470). 일 실시예에 따르면, 출입 수단의 제어는 결제가 완료된 시점에 바로 수행되지 않을 수 있다. 즉, 결제가 정상적으로 완료된 상태의 상품 운송 수단이 출입 수단 근처로 이동하면 전용 단말기와 출입 수 단의 위치 정보에 따라 출입 수단이 개방 상태로 제어될 수 있다. 또한, 결제가 완료된 이후에 상품 운송 수단에 추가적인 상품이 인식된 경우, 추가된 상품에 대한 추가 결제가 이루어지기 전까지는 전용 단 말기에 의한 출입 수단 제어가 수행되지 않을 수 있다. 도 5는 본 발명의 일 실시예에 따른 전용 단말기가 구매에 성인 인증이 요구되는 상품을 결제하는 방식을 설명하기 위한 흐름도이다. 전술된 바와 같이, 전용 단말기는 도 5의 (a)와 (b)와 같이 상이한 방식으로 성인 인증이 요구되는 상품의 결제를 처리할 수 있다. 도 5의 (a)를 우선적으로 살펴보면, 전용 단말기는 결제 단계에서 예비 구매 리스트 내에 성인 인증 필요 상품이 존재하는지 여부를 확인하고(S510), 성인 인증 필요 상품이 존재하는 경우 결제 정보를 생성하여 사용자 단말기에 전송하기 전에 식별 정보를 통해 특정한 사용자 단말기에 성인 인증 관련 정보를 요청할 수 있다(S520). 이후, 전용 단말기는 사용자 단말기로부터 성인 인증 관련 정보를 수신하여 이에 대한 확인을 수행하 고(S530), 성인 인증이 정상적으로 완료된 경우에만 예비 구매 리스트에 포함된 상품들의 결제 정보를 사용자 단말기로 전송할 수 있다(S540). 다음으로, 도 5의 (b)를 살펴보면, 전용 단말기는 결제 단계에서 예비 구매 리스트 내에 성인 인증 필요 상품이 존재하는지 여부를 확인하고(S550), 예비 구매 리스트 내에 포함된 상품들에 대한 결제 정보를 생성하는 과정에서 성인 인증이 완료된 경우에만 결제가 가능한 형태로 결제 정보를 생성하여 사용자 단말기로 전송 할 수 있다(S560). 사용자 단말기 측에서는 전용 단말기로부터 수신한 결제 정보를 통해 결제를 수행하기 위해서는 성인 인증을 완료하여야 하며, 성인 인증을 성공적으로 완료한 이후에만 결제를 수행할 수 있다(S570). 이와 같이, 결제 시스템은 다양한 방식을 통해 상품 구매에 필요한 성인 인증 확인 시스템을 갖출 수 있다. 전술된 다양한 실시예들에 따르면, 본 발명의 결제 시스템은 상품 운송 수단에 설치되는 전용 단말기를 통해 소 비자의 편리한 비대면 결제를 지원할 수 있으며, 이를 통해 무인 점포의 운영 또한 편리해질 수 있다. 또한, 소 비자는 자신의 단말기를 보유하고 있지 않은 상황에서도 단말기를 활용하여 결제를 수행할 수도 있다. 이상에서 설명된 실시예들은 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨 어 구성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치, 방법 및 구성요소는, 예를 들 어, 프로세서, 컨트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마 이크로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목적 컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터 를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로"}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "설명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtualequipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호파(signal wave)에 영구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분산되어서, 분산 된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CDROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto- optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드 뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하 드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2022-0016297", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2022-0016297", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 결제 시스템이 동작하는 전체 환경에 대한 개략도이다. 도 2는 본 발명의 일 실시예에 따른 전용 단말기의 구성을 개략적으로 나타낸 블록도이다. 도 3은 본 발명의 일 실시예에 따른 관리 서버의 구성을 개략적으로 나타낸 블록도이다. 도 4는 본 발명의 일 실시예에 따른 전용 단말기가 본 발명의 결제 시스템을 활용하여 상품을 인식하고 결제하 는 방식을 설명하기 위한 흐름도이다.도 5는 본 발명의 일 실시예에 따른 전용 단말기가 구매에 성인 인증이 요구되는 상품을 결제하는 방식을 설명 하기 위한 흐름도이다."}
