{"patent_id": "10-2022-7029020", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0143853", "출원번호": "10-2022-7029020", "발명의 명칭": "인덱스 서열들의 인공 지능 기반 염기 호출", "출원인": "일루미나, 인코포레이티드", "발명자": "자가나탄 키쇼르"}}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인덱스 서열들을 염기 호출하는 인공 지능 기반 방법으로서,서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 - 상기 인덱스 이미지들은 상기 서열분석 런 동안의 상기 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서생성되는 세기 방출물들을 묘사함 -;현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 상기인덱스 이미지들을 사전-프로세싱하는 단계로서, 상기 정규화된 버전을 생성하는 것은,(i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들,(ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및(iii) 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 및신경 네트워크 기반 염기 호출자를 통해 상기 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 상기 인덱스서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 상기 인덱스 서열들에 대한 인덱스 판독물들을생성하는 단계를 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 정규화 기능은,(i) 상기 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 상기 하나이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및(i) 상기 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 상기 하나이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 상위 백분위수를 계산하여,상기 인덱스 이미지의 정규화된 버전에서,정규화된 세기 값들의 제1 백분율이 상기 하위 백분위수 미만이고,상기 정규화된 세기 값들의 제2 백분율이 상기 상위 백분위수 초과이고,상기 정규화된 세기 값들의 제3 백분율이 상기 하위 백분위수와 상기 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,함께 취하면, 상기 현재, 선행 및 후행 인덱스 서열분석 사이클들로부터의 상기 인덱스 이미지들에 의해 묘사된뉴클레오티드들은상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해서만 묘사되는 뉴클레오티드들보다 점증적으로 더 많이 다양해지는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 선행 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들 중의 적어도 하나의 인공개특허 10-2022-0143853-3-덱스 이미지는 검출가능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해 묘사되는 상기 뉴클레오티드들은 4개의 염기들 A, C, T, 및 G 중 일부가 상기 뉴클레오티드들 전부의 15%, 10% 또는 5% 미만의 빈도로 표현되는 낮은 복잡도 패턴들인, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 함께 취하면, 상기 현재, 선행, 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들에의해 묘사되는 상기 뉴클레오티드들은 상기 4개의 염기들 A, C, T, 및 G 각각이 상기 뉴클레오티드들 전부의 적어도 20%, 25% 또는 30%의 빈도로 표현되는 높은 복잡도 패턴들을 점증적으로 형성하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,추론 동안뿐만 아니라 상기 신경 네트워크 기반 염기 호출자의 트레이닝 동안에도 상기 정규화 기능을 사용하여상기 인덱스 이미지들을 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 인덱스 이미지의 세기 값들을 스케일링 인자와 곱하고, 곱셈의 결과에 오프셋 값을 더함으로써 인덱스 이미지의 증강된 버전을 생성하는 증강 기능을 사용하여 상기 인덱스 이미지들을 사전-프로세싱하는 단계; 및상기 신경 네트워크 기반 염기 호출자를 통해 상기 인덱스 이미지들의 증강된 버전들을 프로세싱하고, 상기 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 상기 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 추가로 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 신경 네트워크 기반 염기 호출자의 트레이닝 동안에만 상기 증강 기능을 사용하여 그리고 상기 추론 동안에는 사용하지 않고서 상기 인덱스 이미지들을 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 현재 인덱스 서열분석 사이클로부터 상기 인덱스 이미지의 정규화된 버전을 생성하는 상기 정규화 기능을사용하여 상기 인덱스 이미지들을 사전-프로세싱하는 단계로서, 상기 정규화된 버전을 생성하는 것은,(i) 하나 이상의 현재가 아닌 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및(ii) 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 초기 인덱스 서열분석 사이클들을포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 중간 인덱스 서열분석 사이클들을포함하는, 인공 지능 기반 방법.공개특허 10-2022-0143853-4-청구항 13 제10항에 있어서, 상기 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 말기 인덱스 서열분석 사이클들을포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 현재가 아닌 인덱스 서열분석 사이클들은 초기 인덱스 서열분석 사이클들, 중간 인덱스서열분석 사이클들, 및 상기 말기 인덱스 서열분석 사이클들의 조합을 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서, 상기 현재가 아닌 인덱스 서열분석 사이클들로부터의 적어도 하나의 인덱스 이미지는 검출가능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "서열분석 런의 인덱스 서열분석 사이클들에서 분석물들을 염기 호출하는 인공 지능 기반 방법으로서,현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 상기인덱스 서열분석 사이클들 동안 생성된 인덱스 이미지들을 사전-프로세싱하는 단계로서, 상기 정규화된 버전을생성하는 것은,(i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들,(ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및(iii) 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계;특정 분석물이 상기 현재 인덱스 서열분석 사이클에서 염기 호출되는 경우,상기 현재, 선행, 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 정규화된 버전들로부터 인덱스 이미지 패치들을 추출하여,각각의 정규화된 인덱스 이미지 패치가 상기 현재 인덱스 서열분석 사이클 동안 상기 특정 분석물, 일부 인접분석물들, 및 상기 특정 분석물 및 상기 인접 분석물들의 대응하는 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 그들의 주변 배경의 세기 방출물들을 묘사하도록 하는 단계;콘볼루션 신경 네트워크를 통해 상기 정규화된 인덱스 이미지 패치들을 콘볼루션하고 콘볼루션된 표현을 생성하는 단계; 및상기 콘볼루션된 표현에 기초하여 상기 현재 인덱스 서열분석 사이클에서 상기 특정 분석물을 염기 호출하는 단계를 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "표적 서열들 및 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 상기 표적 서열들은 복수의 샘플들로부터 도출되고 상기 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성하고, 각각의 인덱스 서열은 상기복수의 샘플들 중의 각자의 샘플과 고유하게 연관되고, 상기 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링(pooling)되고, 상기 표적 서열들은 상기 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고 상기 인덱스 서열들은 상기 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석되며, 상기 방법은,상기 표적 서열분석 사이클들 동안 상기 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 상기표적 이미지들은 상기 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -;상기 표적 이미지의 세기 값들에만 기초하여 현재 표적 서열분석 사이클로부터 상기 표적 이미지의 정규화된 버전을 생성하는 제1 정규화 기능을 사용하여 상기 표적 이미지들을 사전-프로세싱하는 단계;신경 네트워크 기반 염기 호출자를 통해 상기 표적 이미지들의 정규화된 버전들을 프로세싱하고, 상기 표적 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 상기 표적 서열들에 대한 표적 판독물들을 생성공개특허 10-2022-0143853-5-하는 단계;상기 인덱스 서열분석 사이클들 동안 상기 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 -상기 인덱스 이미지들은 상기 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -;현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능을 사용하여 상기 인덱스 이미지들을 사전-프로세싱하는 단계로서, 상기 정규화된 버전을 생성하는 것은,(i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들,(ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및(iii) 상기 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계;상기 신경 네트워크 기반 염기 호출자를 통해 상기 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 상기인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 상기 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계; 및표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 상기 표적 서열의 각각의 표적 판독물을 상기 복수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 제1 정규화 기능은,상기 표적 이미지의 세기 값들의 하위 백분위수, 및상기 표적 이미지의 세기 값들의 상위 백분위수를 계산하여,상기 표적 이미지의 정규화된 버전에서,정규화된 세기 값들의 제1 백분율이 상기 하위 백분위수 미만이고,상기 정규화된 세기 값들의 제2 백분율이 상기 상위 백분위수 초과이고,상기 정규화된 세기 값들의 제3 백분율이 상기 하위 백분위수와 상기 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "표적 서열들 및 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 상기 표적 서열들은 복수의 샘플들로부터 도출되고 상기 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성하고, 각각의 인덱스 서열은 상기복수의 샘플들 중의 각자의 샘플과 고유하게 연관되고, 상기 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링되고, 상기 표적 서열들은 상기 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고 상기인덱스 서열들은 상기 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석되며, 상기 방법은,상기 표적 서열분석 사이클들 동안 상기 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 상기표적 이미지들은 상기 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -;(i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적이미지들의 세기 값들에 기초하여 상기 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 상기 표적 이미지들을 사전-프로세싱하는 단계;상기 인덱스 서열분석 사이클들 동안 상기 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 -상기 인덱스 이미지들은 상기 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -;(i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터공개특허 10-2022-0143853-6-의 인덱스 이미지들의 세기 값들에 기초하여 상기 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 상기 정규화 기능을 사용하여 상기 인덱스 이미지들을 사전-프로세싱하는 단계;신경 네트워크 기반 염기 호출자를 통해 상기 표적 이미지들의 정규화된 버전들을 프로세싱하고, 상기 표적 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 상기 표적 서열들에 대한 표적 판독물들을 생성하는 단계;상기 신경 네트워크 기반 염기 호출자를 통해 상기 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 상기인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 상기 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계; 및표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 상기 표적 서열의 각각의 표적 판독물을 상기 복수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 포함하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서, 상기 정규화 기능은,(i) 상기 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 상기 하나 이상의 후행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 상기 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들의 하위 백분위수, 및(i) 상기 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 상기 하나 이상의 후행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 상기 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들의 상위 백분위수를 계산하여,상기 표적 이미지의 정규화된 버전에서,정규화된 세기 값들의 제1 백분율이 상기 하위 백분위수 미만이고,상기 정규화된 세기 값들의 제2 백분율이 상기 상위 백분위수 초과이고,상기 정규화된 세기 값들의 제3 백분율이 상기 하위 백분위수와 상기 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법."}
{"patent_id": "10-2022-7029020", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 기술은 인덱스 서열들의 인공 지능 기반 염기 호출에 관한 것이다. 개시된 기술은 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스한다. 인덱스 이미지들은 서열 분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 개시된 (뒷면에 계속)"}
{"patent_id": "10-2022-7029020", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시된 기술은 지능의 에뮬레이션을 위한; 그리고 불확실성 추리 시스템들(예컨대, 퍼지 논리 시스템들), 적응 적 시스템들, 기계 학습 시스템들, 및 인공 신경 네트워크들을 포함하는, 인공 지능 유형 컴퓨터들 및 디지털 데이터 프로세싱 시스템들, 및 대응하는 데이터 프로세싱 방법들 및 제품들(즉, 지식 기반 시스템들, 추리 시스 템들, 및 지식 획득 시스템들)에 관한 것이다. 특히, 개시된 기술은 데이터를 분석하기 위한 심층 콘볼루션 (deep convolutional) 신경 네트워크들과 같은 심층 신경 네트워크들을 사용하는 것에 관한 것이다. 우선권 출원 본 PCT 출원은 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED BASE CALLING OF INDEX SEQUENCES\"이고 2020년 2월 20일자로 출원된 미국 가특허 출원 제62/979,384호(대리인 문서 번호 ILLM ILLM 1015-1/IP-1857-PRV) 및 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED BASE CALLING OF INDEX SEQUENCES\"이고 2021년 2월 12일자로 출원된 미국 특허 출원 제17/175,546호(대리인 문서 번호 ILLM 1015-2/IP-1857-US)에 대한 우선권 및 그의 이 익을 주장한다. 우선권 출원들은 이로써 모든 목적들을 위해 본 명세서에 완전히 설명된 것처럼 참고로 포함된 다. 참조 문헌들 하기는 본 명세서에 완전히 설명된 것처럼 참고로 포함된다: 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED MANY-TO-MANY BASE CALLING\"이고 2020년 2월 20일자로 출원된 미국 가특허 출원 제62/979,414호(대리인 문서 번호 ILLM 1016-1/IP-1858-PRV);발명의 명칭이 \"KNOWLEDGE DISTILLATION-BASED COMPRESSION OF ARTIFICIAL INTELLIGENCE-BASED BASE CALLER\" 이고 2020년 2월 20일자로 출원된 미국 가특허 출원 제62/979,385호(대리인 문서 번호 ILLM 1017-1/IP-1859- PRV); 발명의 명칭이 \"DETECTING AND FILTERING CLUSTERS BASED ON ARTIFICIAL INTELLIGENCE-PREDICTED BASE CALL S\"이고 2020년 8월 28일자로 출원된 미국 가특허 출원 제63/072,032호(대리인 문서 번호 ILLM 1018-1/IP-1860- PRV); 발명의 명칭이 \"MULTI-CYCLE CLUSTER BASED REAL TIME ANALYSIS SYSTEM\"이고 2020년 2월 20일자로 출원된 미국 가특허 출원 제62/979,412호(대리인 문서 번호 ILLM 1020-1/IP-1866-PRV); 발명의 명칭이 \"DATA COMPRESSION FOR ARTIFICIAL INTELLIGENCE-BASED BASE CALLING\"이고 2020년 2월 20일자로 출원된 미국 가특허 출원 제62/979,411호(대리인 문서 번호 ILLM 1029-1/IP-1964-PRV); 발명의 명칭이 \"SQUEEZING LAYER FOR ARTIFICIAL INTELLIGENCE-BASED BASE CALLING\"이고 2020년 2월 20일자로 출원된 미국 가특허 출원 제62/979,399호(대리인 문서 번호 ILLM 1030-1/IP-1982-PRV); 발명의 명칭이 \"TRAINING DATA GENERATION FOR ARTIFICIAL INTELLIGENCE-BASED SEQUENCING\"이고 2020년 3월 20일자로 출원된 미국 가특허 출원 제16/825,987호(대리인 문서 번호 ILLM 1008-16/IP-1693-US); 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED GENERATION OF SEQUENCING METADATA\"이고 2020년 3월 20일자로 출원된 미국 특허 출원 제16/825,991호(대리인 문서 번호 ILLM 1008-17/IP-1741-US); 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED BASE CALLING\"이고 2020년 3월 20일자로 출원된 미국 특허 출 원 제16/826,126호(대리인 문서 번호 ILLM 1008-18/IP-1744-US); 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED QUALITY SCORING\"이고 2020년 3월 20일자로 출원된 미국 특허 출원 제16/826,134호(대리인 문서 번호 ILLM 1008-19/IP-1747-US); 및 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED SEQUENCING\"이고 2020년 3월 21일자로 출원된 미국 특허 출원 제16/826,168호(대리인 문서 번호 ILLM 1008-20/IP-1752-PRV-US)."}
{"patent_id": "10-2022-7029020", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 섹션에서 논의되는 주제는 단지 이 섹션 내에서의 그의 언급의 결과로서 종래기술이라고 가정되어서는 안 된"}
{"patent_id": "10-2022-7029020", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다. 유사하게, 이 섹션에서 언급되거나 배경기술로서 제공되는 주제와 연관된 문제는 종래기술에서 이전에 인 식되었다고 가정되어서는 안 된다. 이 섹션에서의 주제는 단지 상이한 접근법들을 표현할 뿐이며, 그 접근법들 자체는 청구되는 기술의 구현들에 또한 대응할 수 있다. 차세대 서열분석(Next-Generation Sequencing, NGS) 기술에서의 개선들은 서열분석 속도 및 데이터 출력을 크게 증가시켜, 현재 서열분석 플랫폼들의 대규모 샘플 처리량을 초래했다. 대략 10년 전, Illumina Genome Analyzer™은 런당 최대 1 기가바이트의 서열 데이터를 생성할 수 있었다. 오늘날, Illumina NovaSeq™ 시리즈 의 시스템들은 2일 동안 최대 2 테라바이트의 데이터를 생성할 수 있는데, 이는 2000x 초과의 용량 증가를 표현 한다. 이러한 증가된 용량을 활용하는 핵심은 멀티플렉싱인데, 이는 라이브러리 제조 동안의 각각의 DNA 단편에 대한 고유 인덱스 서열(\"바코드\")의 추가를 통해 단일 서열분석 런 동안 다수의 라이브러리들의 풀링(pooling) 및 서 열분석을 동시에 가능하게 한다. 서열분석 판독물들은 디멀티플렉싱 동안 그들의 각자의 샘플들로 분류되어, 적절한 정렬을 허용한다. 염기 호출 인덱스 서열들을 위해 인공 지능 및 신경 네트워크들을 사용할 기회가 발생한다. 더 높은 염기 호출 처리량 및 증가된 염기 호출 정확도가 초래될 수 있다."}
{"patent_id": "10-2022-7029020", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 논의는 어느 당업자라도 개시된 기술을 제조하고 사용할 수 있게 하도록 제시되며, 특정의 응용 및 그의 요건과 관련하여 제공된다. 개시된 구현예들에 대한 다양한 변형들은 당업자들에게 용이하게 명백할 것이며, 본 명세서에서 정의된 일반적인 원리들은 개시된 기술의 사상 및 범주로부터 벗어남이 없이 다른 구현예들 및 응용예들에 적용될 수 있다. 따라서, 개시된 기술은 도시된 구현예들로 제한되도록 의도된 것이 아니라, 본 명세서에 개시된 원리들 및 특징들과 일치하는 가장 넓은 범주에 부합되어야 한다. 멀티플렉싱 도 1은 인덱싱된 라이브러리들로부터의 폴리뉴클레오티드들의 서열분석의 하나의 구현예를 도시한다. 상이한 라이브러리들로부터의 폴리뉴클레오티드들이 서열분석을 위해 풀링되거나 멀티플렉싱될 때, 각각의 라이브러리 로부터의 폴리뉴클레오티드들은 라이브러리 특정적 인덱스 서열을 포함하도록 수정된다. 서열분석 동안, 인덱 스 서열들은 라이브러리들로부터의 표적 폴리뉴클레오티드 서열들과 함께 서열분석된다. 인덱스 서열은 표적 폴리뉴클레오티드 서열과 연관되어 표적 서열이 유래한 라이브러리가 식별될 수 있도록 한다. 멀티플렉싱, 인덱스 서열들, 및 디멀티플렉싱에 관한 추가적인 세부사항들은 문헌 [Illumina, \"Indexed Sequencing Overview Guide\", Document No. 15057455, v. 5, March 201] 및 Illumina의 특허 출원 공개 US 2018/0305751호, US 2018/0334712호, US 2016/0110498호, US 2018/0334711호, 및 WO 2019/090251호에서 찾을 수 있으며, 이들 각각은 본 명세서에 참고로 포함된다. 패널 A는 인덱싱된 라이브러리들을 보여준다. 여기서, 고유 인덱스 서열들(\"인덱스들\")은 라이브러리 제 조 동안 2개의 상이한 라이브러리들에 추가된다. 제1 인덱스 서열(인덱스 1)은 \"CATTCG\"의 바코드를 갖는다. 제2 인덱스 서열(인덱스 2)은 \"AACTGA\"의 바코드를 갖는다. 패널 B는 풀링을 보여준다. 여기서, 인덱싱된 라이브러리들은 함께 풀링되고 동일한 플로우 셀 레인 에 로딩된다. 패널 C는 서열분석 및 서열분석 출력을 보여준다. 여기서, 인덱싱된 라이브러리들은 단일 기구 실행 동안 함께 서열분석된다. 이어서, 모든 서열들이 출력 파일로 익스포트된다. 출력 파일은 (청 색 및 자홍색의) 대응하는 인덱스 판독물들에 커플링되는 (녹색의) 서열 판독물들을 포함한다. 패널 D는 디멀티플렉싱을 보여준다. 여기서, 디멀티플렉싱 알고리즘은 서열 판독물들을 그들의 인덱스들 에 따라 상이한 파일들로 분류한다. 패널 E는 정렬을 보여준다. 여기서, 디멀티플렉싱된 서열 판독물들의 각각의 세트는 적절한 기준 서열로 정렬된다. 표적 서열들 및 인덱스 서열들 도 2는 표적 서열을 서열분석하여 표적 판독물(\"GTCCGATA\")을 생성하고 인덱스 서열을 서열분석 하여 인덱스 판독물(\"AACTGA\")을 생성하는 하나의 구현예를 도시한다. 인덱스 서열은 템플릿 제조 단계 동안 표적 서열에 커플링되는 뉴클레오티드들의 합성 서열일 수 있다. 표적 서열은 자연적으로 발생하는 DNA, RNA, 또는 일부 다른 생물학적 분자일 수 있다. 인덱스 서열의 길이는 2 내지 20개의 뉴클 레오티드들의 범위일 수 있다. 예를 들어, 인덱스 서열은 1 내지 10개의 뉴클레오티드 길이 또는 4 내지 6개의 뉴클레오티드 길이일 수 있다. 4-뉴클레오티드 인덱스 서열은 동일한 어레이 상의 256개의 샘플들을 멀 티플렉싱할 가능성을 제공한다. 6-뉴클레오티드 인덱스 서열은 4096개의 샘플들이 동일한 어레이 상에서 프로 세싱될 수 있게 한다. 서열분석 동안, 표적 프라이머는 표적 서열을 순회하여 표적 판독물(\"GTCCGATA\")을 생성하 고, 인덱스 프라이머는 인덱스 서열을 순회하여 인덱스 판독물(\"AACTGA\")을 생성한다. 일부 구 현예들에서, 서열분석은 Illumina의 단일 인덱싱된 서열분석이다. 다른 구현예들에서, 서열분석은 Illumina의 듀얼 인덱싱된 서열분석이다. 염기 호출은 표적 서열과 인덱스 서열의 뉴클레오티드 조성물을 결정하는 프로세스, 즉, 표적 판독물 (\"GTCCGATA\") 및 인덱스 판독물(\"AACTGA\")을 생성하는 프로세스이다. 염기 호출은 이미지 데이터, 즉 Illumina의 iSeq, HiSeqX, HiSeq 3000, HiSeq 4000, HiSeq 2500, NovaSeq 6000, NextSeq, NextSeqDx, MiSeq, 및 MiSeqDx와 같은 서열분석 기구에 의한 서열분석 동안 생성된 서열분석 이미지들을 분석하는 것 을 수반한다. 하기의 논의는 하나의 구현예에 따라, 서열분석 이미지들이 어떻게 생성되고 그들이 무엇을 묘사 하는지의 개요를 서술한다. 염기 호출은 서열분석 기구의 원시 신호, 즉 서열분석 이미지들로부터 추출된 세기 데이터를 뉴클레오티드 서열 들로 디코딩한다. 하나의 구현예에서, Illumina 플랫폼들은 염기 호출을 위한 CRT(Cyclic Reversible Termination) 화학을 채용한다. 프로세스는 각각의 새롭게 추가된 뉴클레오티드의 방출된 신호를 추적하면서,형광-라벨링된 뉴클레오티드들을 갖는 템플릿 가닥들에 상보적인 발생기 가닥들을 성장시키는 것에 의존한다. 형광-라벨링된 뉴클레오티드들은 뉴클레오티드 유형의 형광단 신호를 앵커링하는 3' 제거가능한 블록을 갖는다. 서열분석은 반복 사이클들에서 발생하는데, 각각은 3개의 단계들을 포함한다: (a) 형광-라벨링된 뉴클레오 티드를 추가하는 것에 의한 발생기 가닥(예컨대, 표적 서열, 인덱스 서열)의 연장; (b) 서열분석 기 구의 광학 시스템의 하나 이상의 레이저들을 사용한 형광단의 여기(excitation)하고 광학 시스템의 상이한 필터 들을 통해 이미징하여, 서열분석 이미지들을 산출; (c) 다음 서열분석 사이클을 대비한 형광단의 절단 (cleavage) 및 3' 블록의 제거. 혼입 및 이미징 사이클들은 지정된 수의 서열분석 사이클들까지 반복되어, 판 독물 길이를 정의한다. 이러한 접근법을 사용하여, 각각의 사이클이 템플릿 가닥들을 따라 새로운 포지션을 심 문한다. Illumina 플랫폼들의 엄청난 힘은 CRT 반응들을 겪는 수백만 또는 심지어 수십억 개의 분석물들(예컨대, 클러스 터들)을 동시에 실행시키고 감지하는 그들의 능력으로부터 유래한다. 클러스터는 템블릿 가닥의 대략 1000개의 동일한 복제물들을 포함하지만, 클러스터들은 크기 및 형상이 다르다. 클러스터들은, 서열분석 런 전에, 입력 라이브러리의 브리지 증폭에 의해 템플릿 가닥으로부터 성장된다. 증폭 및 클러스터 성장의 목적은 방출된 신 호의 세기를 증가시키는 것인데, 이는 이미징 디바이스가 단일 가닥의 형광단 신호를 신뢰성 있게 감지할 수 없 기 때문이다. 그러나, 클러스터 내의 가닥들의 물리적 거리는 작고, 따라서, 이미징 디바이스는 가닥들의 클러 스터를 단일 스폿으로 인지한다. 서열분석은 플로우 셀 - 입력 가닥들을 보유하는 작은 유리 슬라이드 - 에서 발생한다. 플로우 셀은 현미 경 이미징, 여기 레이저들, 및 형광 필터들을 포함하는 광학 시스템에 접속된다. 플로우 셀은 레인들로 칭해지 는 다수의 챔버들을 포함한다. 레인들은 서로 물리적으로 분리되어 있고, 샘플 교차 오염 없이 구별가능한 상 이한 태깅된 서열분석 라이브러리들을 포함할 수 있다. 서열분석 기구의 이미징 디바이스(예컨대, 전하 결합 소자(Charge-Coupled Device, CCD) 또는 상보성 금속 산화물 반도체(Complementary Metal-Oxide- Semiconductor, CMOS) 센서와 같은 솔리드 스테이트 이미저)는 타일들로 칭해지는 일련의 비-중첩 영역들 내의 레인들을 따르는 다수의 위치들에서 스냅숏(snapshot)들을 촬영한다. 예를 들어, Illumina의 Genome Analyzer II에는 레인당 100개의 타일들이 그리고 Illumina의 HiSeq 2000에는 레인당 68개의 타일들이 있다. 타일은 수 십만 내지 수백만 개의 클러스터들을 보유한다. 서열분석의 출력은 서열분석 이미지들이며, 각각은 클러스터들 및 그들의 주변 배경의 세기 방출물들을 묘 사한다. 표적 서열을 서열분석하는 서열분석의 그러한 서열분석 사이클들은 \"표적 서열분석 사이클 들\"로 불리고, 인덱스 서열분석을 서열분석하는 서열분석의 그러한 서열분석 사이클들은 \"인덱스 서 열분석 사이클들\"로 불린다. 표적 서열분석 사이클들 동안 생성된 서열분석 이미지들은 \"표적 이미지들\"로 불 리고, 인덱스 서열분석 사이클들 동안 생성된 서열분석 이미지들은 \"인덱스 이미지들\"로 불린다. 표적 이미지들은 서열분석 동안의 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물 들을 묘사한다. 인덱스 이미지들은 서열분석 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 세기 방출물들은 연관된 분석물들 및 그들의 주변 배경으로부터의 것이다. 신경 네트워크 기반 염기 호출 이제, 신경 네트워크, 즉, 신경 네트워크 기반 염기 호출자가 서열분석 이미지들을 염기 호출들에 맵 핑시키도록 트레이닝되는 신경 네트워크 기반 염기 호출에 대한 논의로 전환한다. 하기의 논의는 하기와 같이 정리된다. 먼저, 하나의 구현예에 따르면, 신경 네트워크 기반 염기 호출자에 대한 입력이 기술된다. 이어서, 신경 네트워크 기반 염기 호출자의 구조 및 형태의 예들이 제공된다. 마 지막으로, 하나의 구현예에 따르면, 신경 네트워크 기반 염기 호출자의 출력이 기술된다. 신경 네트워크 기반 염기 호출자에 관한 추가적인 세부사항들은 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE- BASED SEQUENCING\"이고 2019년 3월 21일자로 출원된 미국 가특허 출원 제62/821,766호(대리인 문서 번호 ILLM 1008-9/IP-1752-PRV)에서 찾을 수 있으며, 이는 본 명세서에 참고로 포함된다. 하나의 구현예에서, 표적 이미지들 및 인덱스 이미지들로부터 이미지 패치들이 추출된다. 추출된 이미지 패치 들은 염기 호출을 위한 \"입력 이미지 데이터\"로서 신경 네트워크 기반 염기 호출자에 제공된다. 이미지 패치들은 치수들 w x h를 가지며, 여기서 w(폭) 및 h(높이)는 1 내지 10,000 범위의 임의의 수들(예컨대, 3 x 3, 5 x 5, 7 x 7, 10 x 10, 15 x 15, 25 x 25)이다 . 일부 구현예들에서, w 및 h는 동일하다. 다른 구현예들에서, w 및 h는 상이하다. 서열분석은 대응하는 m개의 이미지 채널들에 대해 서열분석 사이클당 m개의 이미지(들)를 생성한다. 하나 의 구현예에서, 각각의 이미지 채널은 복수의 필터 파장 대역들 중 하나에 대응한다. 다른 구현예에서, 각각의 이미지 채널은 서열분석 사이클에서의 복수의 이미징 이벤트들 중 하나에 대응한다. 또 다른 구현예에서, 각각 의 이미지 채널은 특정 레이저를 사용하는 조명과 특정 광학 필터를 통한 이미징의 조합에 대응한다. 특정 서열분석 사이클 동안 입력 이미지 데이터를 준비하기 위해 m개의 이미지(들) 각각으로부터 이미지 패치가 추출된다. 4-, 2-, 및 1-채널 화학들과 같은 상이한 구현예들에서, m은 4 또는 2이다. 다른 구현예들에서, m 은 1, 3, 또는 4 초과이다. 입력 이미지 데이터는, 일부 구현예들에서는 광학 픽셀 도메인 내에 있고, 다른 구 현예들에서는 업샘플링된 서브픽셀 도메인 내에 있다. 예를 들어, 서열분석이 2개의 상이한 이미지 채널들, 즉 적색 채널 및 녹색 채널을 사용하는 것을 고려한 다. 이어서, 각각의 서열분석 사이클에서, 서열분석은 적색 이미지 및 녹색 이미지를 생성한다. 이러한 방식으로, 일련의 k개의 서열분석 사이클 동안, 적색 및 녹색 이미지들의 k개의 쌍들을 갖는 시퀀스가 출력으로 서 생성된다. 입력 이미지 데이터는 서열분석 런의 일련의 k개의 서열분석 사이클들 동안 생성된 사이클별 이미지 패치들의 시퀀스를 포함한다. 사이클별 이미지 패치들은 하나 이상의 이미지 채널들(예컨대, 적색 채널 및 녹색 채널)에 서 연관된 분석물들 및 그들의 주변 배경에 대한 세기 데이터를 포함한다. 하나의 구현예에서, 단일 표적 분석 물(예컨대, 클러스터)이 염기 호출될 때, 사이클별 이미지 패치들은 표적 연관된 분석물에 대한 세기 데이터를 포함하는 중심 픽셀에 중심을 두고, 사이클별 이미지 패치들 내의 비-중심 픽셀들은 표적 연관된 분석물에 인접 한 연관된 분석물들에 대한 세기 데이터를 포함한다. 입력 이미지 데이터는 다수의 서열분석 사이클들(예컨대, 현재 서열분석 사이클, 하나 이상의 선행 서열분석 사 이클들, 및 하나 이상의 연속적인 서열분석 사이클들)에 대한 데이터를 포함한다. 하나의 구현예에서, 입력 이 미지 데이터는 3개의 서열분석 사이클들 동안의 데이터를 포함하여서, 염기 호출될 현재(시간 t) 서열분석 사이 클 동안의 데이터에 (i) 좌측 플랭킹/콘텍스트/이전/선행/우선(시간 t-1) 서열분석 사이클 동안의 데이터, 및 (ii) 우측 플랭킹/콘텍스트/다음/연속/후속(시간 t+1) 서열분석 사이클 동안의 데이터가 동반되도록 한다. 다 른 구현예들에서, 입력 이미지 데이터는 단일 서열분석 사이클 동안의 데이터를 포함한다. 또 다른 구현예들에 서, 입력 이미지 데이터는 58, 75, 92, 130, 168, 175, 209, 225, 230, 275, 318, 325, 330, 525, 또는 625개 의 서열분석 사이클들 동안의 데이터를 포함한다. 하나의 구현예에서, 신경 네트워크 기반 염기 호출자는 다층 퍼셉트론(multilayer perceptron, MLP)이다. 다른 구현예에서, 신경 네트워크 기반 염기 호출자는 피드포워드 신경 네트워크이다. 또 다른 구현예에서, 신경 네트워크 기반 염기 호출자는 완전 접속 신경 네트워크이다. 추가 구현예에서, 신경 네 트워크 기반 염기 호출자는 완전 콘볼루션 신경 네트워크이다. 다른 추가 구현예에서, 신경 네트워크 기 반 염기 호출자는 시맨틱 세그먼트화 신경 네트워크이다. 하나의 구현예에서, 신경 네트워크 기반 염기 호출자는 복수의 콘볼루션 층들을 갖는 콘볼루션 신경 네트 워크(CNN)이다. 다른 구현예에서, 그것은 장단기 메모리(LSTM) 네트워크, 양방향 LSTM(Bi-LSTM), 또는 게이트 형 순환 유닛(GRU)과 같은 순환 신경 네트워크(RNN)이다. 또 다른 구현예에서, 그것은 CNN 및 RNN 둘 모두를 포함한다. 또 다른 구현예들에서, 신경 네트워크 기반 염기 호출자는 1D 콘볼루션, 2D 콘볼루션, 3D 콘볼루션, 4D 콘 볼루션, 5D 콘볼루션, 확장형 또는 아트로스 콘볼루션, 전치 콘볼루션, 깊이별 분리가능 콘볼루션, 포인트별 콘 볼루션, 1 x 1 콘볼루션, 그룹 콘볼루션, 편평형 콘볼루션, 공간 및 교차 채널 콘볼루션, 셔플 그룹형 콘볼루션, 공간 분리가능 콘볼루션, 및 디콘볼루션을 사용할 수 있다. 그것은 하나 이상의 손실 함수들, 예컨 대 로지스틱 회귀(logistic regression)/로그(log) 손실, 다중클래스 교차-엔트로피(multi-class cross- entropy)/소프트맥스 손실, 이진 교차-엔트로피(binary cross-entropy) 손실, 평균 제곱 에러(mean-squared error) 손실, L1 손실, L2 손실, 평활한(smooth) L1 손실, 및 Huber 손실을 사용할 수 있다. 그것은 임의의 병렬성(parallelism), 효율성, 및 압축 스킴들, 예컨대 TFRecords, 압축 인코딩(예컨대, PNG), 샤딩 (sharding), 맵 변환을 위한 병렬 호출, 배칭(batching), 프리페칭(prefetching), 모델 병렬성, 데이터 병렬성, 및 동기식/비동기식 SGD를 사용할 수 있다. 그것은 업샘플링 층, 다운샘플링 층, 순환 접속, 게이트 및 게이트형 메모리 유닛(예컨대, LSTM 또는 GRU), 잔차 블록, 잔차 접속, 하이웨이 접속, 스킵 접속, 핍홀(peephole) 접속, 활성화 함수(예컨대, ReLU(rectifying linear unit), 리키 ReLU(leaky ReLU), ELU(exponential liner unit), 시그모이드 및 tanh(hyperbolic tangent)와 같은 비선형 변환 함수), 배치 정규 화 층, 규칙화 층, 드롭아웃, 풀링 층(예컨대, 최대 또는 평균 풀링), 글로벌 평균 풀링 층, 및 감쇠 메커니즘 을 포함할 수 있다. 하나의 구현예에서, 신경 네트워크 기반 염기 호출자는 특정 서열분석 사이클 동안 단일 표적 분석물에 대 한 염기 호출을 출력한다. 다른 구현예에서, 그것은 특정 서열분석 사이클 동안 복수의 표적 분석물들 내의 각 각의 표적 분석물에 대한 염기 호출을 출력한다. 또 다른 구현예에서, 그것은 복수의 서열분석 사이클들 내의 각각의 서열분석 사이클 동안 복수의 표적 분석물들 내의 각각의 표적 분석물에 대한 염기 호출을 출력하여, 이 에 의해, 각각의 표적 분석물에 대한 염기 호출 서열을 생성한다. 사전-프로세싱 하나의 구현예에서, 표적 이미지들 및 인덱스 이미지들로부터의 이미지 데이터는 신경 네트워크 기반 염기 호출 자에 대한 입력으로서 직접 공급되지 않는다. 대신, 표적 이미지들 및 인덱스 이미지들이 먼저 사전-프로 세싱된다. 그러나, 인덱스 이미지들은 표적 이미지들과는 상이하게 사전-프로세싱된다. 본 명세서에 기술된 염기 호출 로직은, 인덱스 이미지들이, 4개의 염기들 A, C, T, 및 G 중 일부가 뉴클레오티 드들 전부의 15%, 10% 또는 5% 미만의 빈도로 표현되는 낮은 복잡도 패턴들로 뉴클레오티드들을 묘사한다는 관 찰을 고려한다. 이는, 임의의 주어진 인덱스 서열분석 사이클 동안, 인덱스 이미지가, 동일한 샘플에서 유 래하고 동일한 인덱스 서열을 공유하는 다수의 분석물들, 및 또한, 상이한 샘플들에 속하고 상이한 인덱스 서열들을 갖는 분석물들의 세기 방출물들을 묘사하기 때문에 사실이다. 제1 유형의 분석물들은 매 인덱스 서열분석 사이클 동안 동일한 인덱스 염기를 갖는다. 그 결과, 인덱스 이미 지는 결국, 다수의 분석물들에 대해 동일한 뉴클레오티드를 묘사하게 된다. 이는 인덱스 이미지의 뉴클레오티 드 다양성을 감소시킨다. 인덱스 이미지의 뉴클레오티드 다양성은 제2 유형의 분석물들이 또한, 결국, 소정 인덱스 서열분석 사이클들 동 안 동일한 인덱스 염기를 갖게 될 때 추가로 감소된다. 이는 2개의 이유들로 일어난다. 첫째, 인덱스 서열들 은 2 내지 20개의 인덱스 염기들을 갖는 짧은 서열들이고, 따라서, 상이한 인덱스 서열들 사이에 상당한 오정합 들을 생성할 수 있는 충분한 위치를 갖지는 않는다. 둘째, 종종, 최대 20개의 샘플들만이 동시 서열분석을 위 해 풀링된다. 그 결과, 인덱스 이미지에 의해 묘사될 수 있는 상이한 인덱스 서열들의 수는 많지 않다. 이 인 자들은 동일한 위치들에서의 정합 인덱스 염기들을 갖는 상이한 인덱스 서열들을 초래하는데(염기 충돌), 이는 이어서, 상이한 인덱스 서열들을 갖는 분석물들이 소정 인덱스 서열분석 사이클들 동안 동일한 인덱스 염기를 갖게 한다. 인덱스 이미지들의 낮은 뉴클레오티드 다양성은 신호 다양성(콘트라스트)이 결여된 세기 패턴들을 생성한다. 한편, 표적 이미지들은, 4개의 염기들 A, C, T 및 G 각각이 뉴클레오티드들 전부의 적어도 20%, 25% 또는 30%의 빈도로 표현되는 높은 복잡도 패턴들로 뉴클레오티드들을 묘사한다. 이는, 표적 서열들이 종종 길고(예컨대, 150개의 염기들) 소스 샘플에 관계없이 각각의 분석물에 고유하기 때문에 사실이다. 따라서, 인덱스 이미지들 과는 달리, 표적 이미지들은 적절한 신호 다양성을 갖는다. 신경 네트워크 기반 염기 호출자의 콘볼루션 커널들 및 필터들은 주로 표적 이미지들에 대해 트레이닝된다. 따라서, 추론 동안, 트레이닝된 신경 네트워크 기반 염기 호출자에게 사전-프로세싱을 겪 지 않은 인덱스 이미지들(원시 인덱스 이미지들)이 제시될 때, 인덱스 판독물들에 대한 그의 염기 호출 정확도 는, 그의 콘볼루션 커널들 및 필터들이 콘트라스트에 기초하여 세기 패턴들을 검출하도록 트레이닝되기 때문에 떨어진다. 신호 다양성을 도입하기 위해 많은 양의 원시 인덱스 이미지들에 대해 신경 네트워크 기반 기본 호출자를 트레이닝함으로써 사전-프로세싱을 우회하는 것은, 매우 많은 인덱스 서열들이 공개되고 공개적으로 이용가능하 게 될 뿐이기 때문에 실현가능하지 않다. 둘째, 사용자들이 맞춤형 인덱스 서열들을 설계하고 이들을 공개된 인덱스 서열들 대신에 사용하는 것은 드문 일이 아니다. 따라서, 단지 원시 인덱스 이미지들에 대해서만 트레 이닝될 때, 신경 네트워크 기반 염기 호출자는 추론 동안 잘 일반화되지 않고, 오버피팅되기 쉽다. 하나의 솔루션은 정규화를 사용하여 인덱스 이미지들을 사전-프로세싱하는 것이다. 현재 인덱스 서열분석 사이 클로부터의 인덱스 이미지는, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여 정규화된다. 세기 값들은 뉴클레오티드 혼입들로 인해 생성된 화학발광 신호들을 측정한다. 세기 값들은 \"이미지들\"에 인코 딩되며, 이어서 \"특정 신호들\"을 포함하는 \"광학 신호들\"을 표현한다. 본 명세서에 사용되는 바와 같이, 용어 \"이미지\"는 객체의 전부 또는 일부의 표현을 의미하도록 의도된다. 표현은 광학적으로 검출되는 재생 (reproduction)일 수 있다. 예를 들어, 이미지는 형광, 발광, 산란, 또는 흡수 신호들로부터 획득될 수 있다. 이미지에 존재하는 객체의 부분은 객체의 표면 또는 다른 xy 평면일 수 있다. 이미지는 2차원 표현이지만, 일 부 경우들에 있어서, 이미지 내의 정보는 3개 이상의 치수들로부터 도출될 수 있다. 이미지는 광학적으로 검출 된 신호들을 포함할 필요가 없다. 대신, 비-광학 신호들(예컨대 전압, pH 또는 이온 데이터)이 제시될 수 있다. 이미지는 본 명세서의 다른 곳에 기술된 것들 중 하나 이상과 같은 컴퓨터 판독가능 포맷 또는 매체에서 제공될 수 있다. 본 명세서에 사용되는 바와 같이, 용어 \"광학 신호\"는, 예를 들어 형광, 발광, 산란, 또는 흡 수 신호들을 포함하도록 의도된다. 광학 신호들은 자외선(UV) 범위(약 200 내지 390 nm), 가시선(VIS) 범위(약 391 내지 770 nm), 적외선(IR) 범위(약 0.771 내지 25 마이크로미터), 또는 다른 범위의 전자기 스펙트럼에서 검출될 수 있다. 광학 신호들은 이러한 범위들 중 하나 이상의 범위의 모두 또는 일부를 배제하는 방식으로 검 출될 수 있다. 본 명세서에 사용되는 바와 같이, 용어 \"특정 신호\"는 배경 에너지 또는 정보와 같은 다른 에너 지 또는 정보에 걸쳐서 선택적으로 관찰되는 검출된 에너지 또는 코딩된 정보를 의미하도록 의도된다. 예를 들 어, 특정 신호는 특정 세기, 파장 또는 컬러에서 검출된 광학 신호; 특정 주파수, 전력 또는 필드 강도에서 검 출된 전기 신호; 또는 분광법 및 분석 검출에 관한 당업계에 공지된 다른 신호들일 수 있다. 하나의 구현예에 서, 세기 값들은 2개의 상이한 컬러/세기 채널 서열분석 이미지들로부터 추출된다. 4개의 상이한 뉴클레오티드 유형들/염기들 A, C, T 및 G의 아이덴티티는 2개의 컬러 이미지들, 즉, 제1 및 제2 세기 채널들에서의 세기 값 들의 조합으로서 인코딩된다. 예를 들어, 제1 세기 채널에서 검출되는 제1 뉴클레오티드 유형(예컨대, 염기 T), 제2 세기 채널에서 검출되는 제2 뉴클레오티드 유형(예컨대, 염기 C), 제1 및 제2 세기 채널들 둘 모두에서 검출되는 제3 뉴클레오티드 유형(예컨대, 염기 A), 및 양쪽 세기 채널들에서 검출되지 않는 또는 최소로 검출되 는 라벨이 결여된 제4 뉴클레오티드 유형(예컨대, 염기 G)을 제공함으로써 핵산이 서열분석될 수 있다. 일부 구현예들에서, 4개의 세기 분포들(예컨대, 가우스 분포들)이 제1 및 제2 세기 채널들에서의 세기 값들에 반복적 으로 피팅된다. 4개의 세기 분포들은 4개의 염기들 A, C, T 및 G에 대응한다. 제1 세기 채널에서의 세기 값들 은 제2 세기 채널에서의 세기 값들에 대해 (예컨대, 산포도로서) 플롯되고, 세기 값들은 4개의 세기 분포들로 분리된다. 인덱스 서열분석 사이클들에 걸친 정규화는 또한, 인덱스 서열분석 사이클들의 이미지 데이터 내의 이미지 채널 들에 걸친 정규화를 포함한다. 예를 들어, 3개의 인덱스 서열분석 사이클들, 즉, 제1 인덱스 서열분석 사이클, 제2 인덱스 서열분석 사이클, 및 제3 인덱스 서열분석 사이클을 고려한다. 또한, 제1, 제2, 및 제3 인덱스 서 열분석 사이클들 각각은 2개의 인덱스 이미지들, 즉 제1 이미지 채널(예컨대, 적색 채널) 내의 제1 인덱스 이미 지(예컨대, 적색 인덱스 이미지), 및 제2 이미지 채널(예컨대, 녹색 채널) 내의 제2 인덱스 이미지(예컨대, 녹 색 인덱스 이미지)를 갖는다는 것을 고려한다. 제2 인덱스 서열분석 사이클로부터의 적색 인덱스 이미지는, (i) 제1 인덱스 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들, (ii) 제3 인덱스 서열분석 사이 클로부터의 적색 및 녹색 이미지들의 세기 값들, 및 (iii) 제2 인덱스 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들에 기초하여 정규화된다. 제2 인덱스 서열분석 사이클로부터의 녹색 인덱스 이미지는, (i) 제1 인덱스 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들, (ii) 제3 인덱스 서열분석 사이 클로부터의 적색 및 녹색 이미지들의 세기 값들, 및 (iii) 제2 인덱스 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들에 기초하여 정규화된다. 정규화는 플랭킹 인덱스 서열분석 사이클들로부터의 인덱스 이미지들을 포함하는데, 그 이유는, 함께 취하면, 현재, 선행, 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들에 의해 묘사되는 뉴클레오티드들이, 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해서만 묘사되는 뉴클레오티드들보다 점증적으로 더 많이 다양해지기 때문이다. 정규화를 플랭킹 인덱스 서열분석 사이클들로부터의 인덱스 이미지들로 확장하는 것은 또한, 검출가능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사하는 선행 및/또는 후행 인덱스 서열분석 사이클들로부터의 적어도 하나의 인덱스 이미지를 포함한다. 더 많은 상세사항들은 하기와 같다. 인덱스 이미지들의 정규화 도 3은 인덱스 이미지들을 정규화하는 하나의 구현예를 도시한다. 백분위수 계산기가, (i) 선행(시간 t-1) 인덱스 서열분석 사이클로부터의 인덱스 이미지들(322, 332)의 세 기 값들, (ii) 후행(시간 t+1) 인덱스 서열분석 사이클들로부터의 인덱스 이미지들(326, 336)의 세기 값들, 및 (iii) 현재(시간 t) 인덱스 서열분석 사이클로부터의 인덱스 이미지들(324, 334)의 세기 값들의 하위 백분위수 를 계산한다. 백분위수 계산기는 이미지들에 대한 백분위수 세기 값들을 계산하도록 백분위수 계산 로직으로 구성된다. 백분위수 계산기는 (i) 하드웨어 모듈(들), (ii) 하나 이상의 하드웨어 프로세서들 상에서 실행되는 소프 트웨어 모듈(들), 또는 (iii) 하드웨어와 소프트웨어 모듈들의 조합을 포함할 수 있고; (i) 내지 (iii) 중 임의 의 것이 본 명세서에 제시된 특정 기법들을 구현하고, 소프트웨어 모듈들은 컴퓨터 판독가능 저장 매체(또는 다 수의 그러한 매체)에 저장된다. 상기에서 논의한 바와 같이, 각각의 인덱스 서열분석 사이클은 2개, 3개, 4개 또는 그 이상의 인덱스 이미지들 을 가질 수 있다. 따라서, 선행(시간 t-1) 인덱스 서열분석 사이클, 후행(시간 t+1) 인덱스 서열분석 사이클들, 및 현재(시간 t) 인덱스 서열분석 사이클 각각으로부터의 각자의 인덱스 이미지 세트 내의 인덱스 이 미지들의 세기 값들은, 현재(시간 t) 인덱스 서열분석 사이클로부터의 인덱스 이미지 세트 내의 인덱스 이미지 들의 세기 값들을 정규화하는 데 사용된다. 예시된 구현예에서, 각각의 인덱스 서열분석 사이클은 2개의 인덱스 이미지들, 즉 제1 이미지 채널(예컨대, 적 색 채널) 내의 하나의 인덱스 이미지 및 제2 이미지 채널(예컨대, 녹색 채널) 내의 다른 인덱스 이미지를 갖는 다. 바람직한 구현예들에서, 제1 이미지 채널(예컨대, 적색 채널) 내의 인덱스 이미지의 정규화는 제1 이미지 채널 내의 인덱스 이미지들, 및 또한, 다른 이미지 채널들(예컨대, 녹색 채널) 내의 하나 이상의 인덱스 이미지들을 사용한다. 다른 구현예들에서, 특정 이미지 채널 내의 인덱스 이미지의 정규화는 그 특정 이미지 채널 내의 인덱스 이미지 들만을 사용하고, 상이한 이미지 채널 내의 인덱스 이미지들은 사용하지 않는다. 예를 들어, 그러한 구현예에 서, 제1 채널 내의 현재 정규화된 인덱스 이미지는 제1 채널 내의 선행 인덱스 이미지 및 제1 채널 내의 후행 인덱스 이미지의 세기 값들로부터만 생성된다. 유사하게, 제2 채널 내의 현재 정규화된 인덱스 이미지는 제2 채널 내의 선행 인덱스 이미지 및 제2 채널 내의 후행 인덱스 이미지의 세기 값들 로부터만 생성된다. 백분위수 계산기는 또한, (i) 선행(시간 t-1) 인덱스 서열분석 사이클로부터의 인덱스 이미지들(322, 33 2)의 세기 값들, (ii) 후행(시간 t+1) 인덱스 서열분석 사이클로부터의 인덱스 이미지들(326, 336)의 세기 값들, 및 (iii) 현재(시간 t) 인덱스 서열분석 사이클로부터의 인덱스 이미지들(324, 334)의 세기 값들의 상위 백분위수를 계산한다. 이어서, 하위 및 상위 백분위수들에 기초하여, 이미지 정규화기는 인덱스 이미지들(324, 334)의 정규화된 버전들(364, 374)을 생성하여, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값 들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위 수 사이이도록 한다. 하나의 예에서, 하위 백분위수는 제5 백분위수일 수 있고, 상위 백분위수는 제95 백분위수일 수 있다. 제5 백 분위수에 대한 정규화된 세기 값은 0일 수 있고, 제95 백분위수에 대한 정규화된 세기 값은 1일 수 있다. 따라 서, 인덱스 이미지들(324, 334)의 정규화된 버전들(364, 374)에서, (i) 정규화된 세기 값들의 5%는 0 미만이고, (ii) 정규화된 세기 값들의 다른 5 퍼센트는 1 초과이고, (iii) 정규화된 세기 값들의 나머지 90%는 0과 1 사이 이다. 세기 값들은 픽셀 세기 값들, 서브픽셀 세기 값들, 또는 슈퍼픽셀 세기 값들일 수 있다. 정규화 기능은 하기와 같이 수학적으로 표현될 수 있다:"}
{"patent_id": "10-2022-7029020", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "따라서, 하나의 예에서, 세기 값이 제95 백분위수의 것일 때, 정규화된 세기 값은 1이고, 세기 값이 제5 백분위 수의 것일 때, 정규화된 세기 값은 0이다. 다른 구현예들에서, 하위 백분위수는 제10 백분위수일 수 있고, 상위 백분위수는 제90 백분위수일 수 있다. 또 다른 구현예들에서, 하위 백분위수는 1과 100 사이의 임의의 수일 수 있고, 상위 백분위수는 100 - 하위 백분위 수일 수 있다. 하위 및 상위 백분위수들에 배정된 정규화된 세기 값들은 또한, -1 대 1, 0.5 대 1, 1 대 10, 1대 99 등과 같이 상이할 수 있다. 도 4는 염기 호출을 위해 신경 네트워크 기반 염기 호출자를 통해 정규화된 인덱스 이미지들을 프로세싱하 는 하나의 구현예를 도시한다. 하나의 구현예에서, 현재(시간 t) 인덱스 서열분석 사이클로부터의 정규화된 인덱스 이미지들(404, 414)에는 선 행(시간 t-1) 인덱스 서열분석 사이클로부터의 정규화된 인덱스 이미지들(402, 412) 및 후행(시간 t+1) 인덱스 서열분석 사이클로부터의 정규화된 인덱스 이미지들(406, 416)이 동반된다. 이 인덱스 이미지들은 상기에 논의 된 바와 같이, 대응하는 플랭킹 인덱스 서열분석 사이클들에서의 인덱스 이미지들의 세기 값들 및 그들 자체의 각자의 세기 값들에 기초하여 정규화된다. 신경 네트워크 기반 염기 호출자는 하나의 구현예에 따르면, 그의 콘볼루션 층들을 통해 정규화된 인덱스 이미지들(402, 412, 404, 414, 406, 416)을 프로세싱하고, 대안적인 표현을 생성한다. 이어서, 대안적인 표현 은, 현재(시간 t) 인덱스 서열분석 사이클 또는 인덱스 서열분석 사이클들 각각, 즉 현재(시간 t) 인덱스 서열 분석 사이클, 선행(시간 t-1) 인덱스 서열분석 사이클, 및 후행(시간 t+1) 인덱스 서열분석 사이클 중 어느 하 나의 인덱스 서열분석 사이클 동안만 염기 호출을 생성하기 위해 출력 층(예컨대, 소프트맥스 층)에 의해 사용 된다. 생성된 염기 호출들은 인덱스 판독물들을 형성한다. 하나의 구현예에서, 패치 추출 프로세스는 상기에서 논의된 바와 같이, 정규화된 인덱스 이미지들(402, 412, 404, 414, 406, 416)로부터 패치들을 추출하고 입력 이미지 데이터를 생성한다. 이어서, 입력 이미 지 데이터 내의 추출된 이미지 패치들이 신경 네트워크 기반 염기 호출자에 입력으로서 제공된다. 하나의 구현예에서, 인덱스 이미지들은, 추론 동안뿐만 아니라 신경 네트워크 기반 염기 호출자의 트레이 닝 동안에도 정규화된다. 신경 네트워크 기반 염기 호출자가 염기 호출을 어떻게 수행하는지에 관한 추가적인 세부사항들 및 패치 추출 프로세스는 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED SEQUENCING\"이고 2019년 3월 21일자로 출원된 미국 가특허 출원 제62/821,766호(대리인 문서 번호 ILLM 1008--9/IP-1752-PRV)에서 찾을 수 있으며, 이는 본 명세서에 참고로 포함된다. 도 5는 인덱스 이미지들의 정규화를 현재가 아닌 인덱스 서열분석 사이클들로 확장시키는 하나의 구현예를 도시 한다. 다른 구현예들에서, 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지는 (i) 하나 이상의 현재가 아닌 인덱 스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (ii) 현재 인덱스 서열분석 사이클로부터의 인 덱스 이미지들의 세기 값들에 기초하여 정규화될 수 있다. 현재가 아닌 인덱스 서열분석 사이클들로부터의 인 덱스 이미지들은 이미지 선택기에 의해 선택되고 정규화를 위해 백분위수 계산기 및 이미지 정규화기 에 제공될 수 있다. 즉, 정규화는 단지 플랭킹 인덱스 서열분석 사이클들을 넘어 확장될 수 있고, 항상, 바로 선행 또는 후행 인덱스 서열분석 사이클들을 사용해야 하는 것은 아니다. 예를 들어, 현재가 아닌 인덱스 서열분석 사이클들은 초기 인덱스 서열분석 사이클들(예컨대, 처음 2개, 3개, 5개, 10개, 20개의 인덱스 서열분석 사이클들)을 포함할 수 있다. 현재가 아닌 인덱스 서열분석 사이클들은 중간 인덱스 서열분석 사이클들(예컨대, 중간 2개, 3개, 5개, 10개, 20개의 인덱스 서열분석 사이클들)을 포함할 수 있다. 현재가 아닌 인덱스 서열분석 사 이클들은 말기 인덱스 서열분석 사이클들(예컨대, 마지막 2개, 3개, 5개, 10개, 20개의 인덱스 서열분석 사이클들)을 포함할 수 있다. 더욱이, 현재가 아닌 인덱스 서열분석 사이클들은 초기 인덱스 서열분석 사이클들, 중간 인덱스 서열분석 사이 클들, 및 말기 인덱스 서열분석 사이클들(예컨대, 제1 및 제5 인덱스 서열분석 사이클들, 제15 및 제23 인덱스 서열분석 사이클들, 및 제18 및 제149 인덱스 서열분석 사이클들)의 조합을 포함할 수 있다. 도 6은 검출가능 신호 상태(즉, 온/검출가능)의 하나 이상의 뉴클레오티드들을 묘사하는 적어도 하나의 인덱스 이미지를 사용하여 인덱스 이미지들을 정규화하는 하나의 구현예를 도시한다. 검출가능 신호 상태에 관하여, 하나의 형광 염료(또는 동일한 또는 유사한 여기/방출 스펙트럼들의 2개 이상의 염료들)를 사용하여 서열분석 반응에서 뉴클레오티드 혼입을 검출하기 위한 상이한 전략들 사이를 구별하는 하 나의 방안은 서열분석 사이클 동안 발생하는 형광성 전이의 존재 또는 상대적 부재, 또는 그 사이의 레벨들의 관점에서 혼입들을 특성화하는 것에 의한 것이다. 이와 같이, 서열분석 전략들은 서열분석 사이클 동안 그들의형광 프로파일에 의해 예시화될 수 있다. 본 명세서에 개시된 전략들의 경우, \"1\" 또는 \"온\" 및 \"0\" 또는 \"오 프\"는 뉴클레오티드가 \"검출가능 신호 상태\"에 있는 형광 상태(예컨대, 형광성에 의해 검출가능함)(1/온)를 나 타내거나, 또는 뉴클레오티드가 암(dark) 상태(예컨대, 이미징 단계에서 검출되지 않거나 최소로 검출됨)(0/오 프)에 있는지 여부를 나타낸다. \"0\" 또는 \"오프\" 상태가 반드시, 신호의 총체적인 결여 또는 부재를 지칭하는 것은 아니다. 그럼에도 불구하고, 일부 구현예들에서는, 신호(예컨대, 형광성)의 총체적인 결여 또는 부재가 있을 수 있다. 최소의 또는 감소된 형광 신호(예컨대, 배경 신호)가 또한, 제1 이미지로부터 제2 이미지로의 형광성의 변화(또는 그 반대)가 신뢰성있게 구별될 수 있는 한, \"0\" 또는 \"오프\" 상태의 범주 내에 포함되는 것으로 간주된다. 도 6의 예시된 2-채널 구현예에서, 뉴클레오티드 \"G\"는 인덱스 이미지들 둘 모두에서 암/오프이고, 뉴클레오티 드 \"A\"는 인덱스 이미지들 둘 모두에서 온/검출가능이고, 뉴클레오티드 \"C\"는 제1 인덱스 이미지에서는 암/오프 이고 제2 인덱스 이미지에서는 온/검출가능이고, 뉴클레오티드 \"T\"는 제1 인덱스 이미지에서는 온/검출가능이고 제2 인덱스 이미지에서는 암/오프이다. 하나의 구현예에서, 이미지 선택기는 검출가능 신호 상태에 있는, 현재가 아닌 인덱스 서열분석 사이클로 부터의 인덱스 이미지를 선택하고, 이를 백분위수 계산기 및 이미지 정규화기로 전달하여 정규화된 이미지들을 생성한다. 온/검출가능 인덱스 이미지는 모든 인덱스 이미지들이 검출가능 신호 상태에 있는 현재가 아닌 인덱스 서열분석 사이클(예컨대, t+3 인덱스 서열분석 사이클)로부터, 또는 인덱스 이미지들 중 일부만이 검출가능 신호 상태에 있는 현재가 아닌 인덱스 서열분석 사이클(예컨대, t-2 인덱스 서열분석 사 이클)로부터 생길 수 있다. 일부 구현예들에서, 검출가능 신호 상태의 많은 인덱스 이미지들이 인덱스 이미지를 정규화하기 위해 사용될 수 있다. 바람직한 구현예들에서, 제1 이미지 채널(예컨대, 적색 채널) 내의 하나 이상의 온/검출가능 인덱스 이미지들 및 또한 다른 이미지 채널들(예컨대, 녹색 채널) 내의 하나 이상의 온/검출가능 인덱스 이미지들을 사용하여 제 1 이미지 채널 내의 인덱스 이미지가 정규화되도록 온/검출가능 인덱스 이미지들이 채널들에 걸쳐 선택된다. 다른 구현예들에서, 특정 이미지 채널 내에만 있고 상이한 이미지 채널들 내에는 없는 하나 이상의 온/검출가능 인덱스 이미지들을 사용하여 그 특정 이미지 채널 내의 인덱스 이미지가 정규화되도록 온/검출가능 인덱스 이미 지들이 채널 단위로 선택된다. 예를 들어, 제1 이미지 채널 내의 인덱스 이미지는, 또한 제1 이미지 채널 (t-3 인덱스 서열분석 사이클) 내의 온/검출가능 인덱스 이미지를 사용하여 정규화될 수 있다. 유사하게, 제2 이미지 채널 내의 인덱스 이미지는, 또한 제2 이미지 채널(t-2 인덱스 서열분석 사이클) 내의 온/검출 가능 인덱스 이미지를 사용하여 정규화될 수 있다. 표적 이미지들의 정규화 도 7은 표적 서열들 및 인덱스 서열들을 염기 호출하는 하나의 구현예를 도시한다. 표적 서열들은 복수의 샘플 들로부터 도출되고 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성한다. 각각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘플과 고유하게 연관된다. 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위 해 풀링된다. 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고, 인덱스 서열들은 서열 분석 런의 인덱스 서열분석 사이클들 동안 서열분석된다. 개시된 기술은 그것이 인덱스 이미지들을 정규화하는 것과는 상이하게 표적 이미지들을 정규화한다. 표적 이미 지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 인덱스 이미지들 은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 표적 이미지를 사전-프로세싱하기 위해, 개시된 기술은 표적 이미지의 세기 값들에만 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 제1 정규화 기능을 사용 한다. 제1 정규화 기능은 표적 이미지의 세기 값들의 하위 백분위수 및 표적 이미지의 세기 값 들의 상위 백분위수를 계산한다. 표적 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분 율은 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율은 상위 백분위수 초과이고, 정규화된 세기 값 들의 제3 백분율은 하위 백분위수와 상위 백분위수 사이이다. 인덱스 이미지를 사전-프로세싱하기 위해, 개시된 기술은, (i) 하나 이상의 선행 인덱스 서열분석 사이클 들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이 미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능 을 사용한다. 제2 정규화 기능은 (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 인덱 스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들 로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세 기 값들의 상위 백분위수를 계산한다. 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율은 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율은 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율은 하위 백분위수와 상위 백분위수 사이이다. 개시된 기술은, 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성한다. 개시된 기술은, 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하 고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독 물들을 생성한다. 개시된 기술은, 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복수의 샘플들 중의 특정 샘플에 속하는 것으로 분류함으로써 디멀티플렉싱을 수행한다. 증강 도 8은 증강을 사용하는 사전-프로세싱의 하나의 구현예를 도시한다. 이미지 증강기는 증강 기능을 사용 하여 인덱스 이미지들 및 표적 이미지들을 사전-프로세싱한다. 하나의 구현예에서, 이미지 증강기 는 인덱스 이미지들 및 표적 이미지들의 세기 값들을 스케일링 인자와 곱하고 곱셈의 결과에 오 프셋 값을 더한다. 다른 구현예에서, 이미지 증강기는 인덱스 이미지들 및 표적 이미지들의 콘 트라스트를 변화시킨다. 또 다른 구현예에서, 이미지 증강기는 인덱스 이미지들 및 표적 이미지들 의 초점을 변화시킨다. 이미지 증강기는 이미지들의 세기 값들을 스케일링 인자들과 곱하고 곱셈 연산들의 결과들에 오프셋 값들 을 더하도록 이미지 증강 로직으로 구성된다. 이미지 증강기는 (i) 하드웨어 모듈(들), (ii) 하나 이상의 하드웨어 프로세서들 상에서 실행되는 소프트웨어 모듈(들), 또는 (iii) 하드웨어와 소프트웨어 모듈들의 조합 을 포함할 수 있고; (i) 내지 (iii) 중 임의의 것이 본 명세서에 제시된 특정 기법들을 구현하고, 소프트웨어 모듈들은 컴퓨터 판독가능 저장 매체(또는 다수의 그러한 매체)에 저장된다. 하나의 구현예에서, 인덱스 이미지들 및 표적 이미지들의 증강은 신경 네트워크 기반 염기 호출자의 트레이닝 동안에만 수행되고, 추론 동안에는 수행되지 않는다. 증강된 인덱스 이미지들 및 증강된 표적 이미지들은 인덱스 서열분석 사이클들 각각 동안 염기 호출 을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하도록, 그리고 표적 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하도록 신경 네트워크 기반 염기 호출자를 통해 프로세싱된다. 개시된 기술은, 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복수의 샘플들 중의 특정 샘플에 속하는 것으로 분류함으로써 디멀티플렉싱을 수행한다. 예시적인 사전-프로세싱 결과들 도 9 및 도 10은 제1 표적 판독물(판독물 1)의 2개의 표적 서열분석 사이클들(사이클들 1 및 151)의 적색 및 녹 색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 11, 도 12, 도 13, 도 14, 도 15, 도 16, 도 17 및 도 18은 제1 인덱스 판독물(인덱스 판독물 1)의 8개의 인덱스 서열분석 사이클들(사이클들 152, 153, 154, 155, 156, 157, 158, 및 159)의 적색 및 녹색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 19, 도 20, 도 21, 도 22, 도 23, 도 24, 도 25 및 도 26은 제2 인덱스 판독물(인덱스 판독물 2)의 8개의 인덱스 서열분석 사이클들(사이클들 160, 161, 162, 163, 164, 165, 166, 및 167)의 적색 및 녹색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 27 및 도 28은 제2 표적 판독물(판독물 2)의 2개의 표적 서열분석 사이클들(사이클들 168 및 169)의 적색 및 녹색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 따라서, 판독물 1 뒤에 인덱스 판독물 1이 이어지고, 이어서, 인덱스 판독물 2가 이어지고, 차례로 판독물 2가 이어진다. 여기서, 각각의 도면은 주어진 표적 또는 인덱스 서열분석 사이클에 대한 2개의 픽셀 세기 히스토그램들을 갖는 데, 하나의 픽셀 세기 히스토그램은 (좌측에서) 적색 이미지에 대한 것이고, 다른 픽셀 세기 히스토그램은 (우 측에서) 녹색 이미지에 대한 것이다. 픽셀 세기 히스토그램들의 x-축은 픽셀 세기들을 나타낸다. 픽셀 세기 히스토그램들의 y-축은 픽셀 카운트 또는 픽셀 밀도를 나타낸다. 따라서, 예를 들어, 이미지가 10,000개의 픽 셀들을 갖는 경우, 대응하는 픽셀 세기 히스토그램은 소정 픽셀 세기들이 이미지에서 얼마나 빈번하게 발견되는 지를 묘사한다. 범례들은 7개의 상이한 서열분석 런들의 이름들(예컨대, A00240_0175, A00276_0125, A00675_0021 등등)을, 그 들의 대응하는 컬러 코드들과 함께 나타낸다. 컬러 코드들은 픽셀 세기 분포들이 다양한 서열분석 런들에 걸쳐 서 어떻게 변하는지를 전달한다. 도 9로부터 도 28로의 픽셀 세기 히스토그램들의 진행은 표적 및 인덱스 서열분석 사이클들에 걸친 픽셀 세기 분포 변화가 많지 않음을 보여준다. 이는, 픽셀 세기 값들이, 그들이 적절한 값으로부터 멀리 떨어져 있지 않 다는 신뢰도로 정규화 파라미터들을 계산하기 위해 혼합될 수 있음을 의미한다. 독창성의 객관적 표시로서의 기술적 효과 및 성능 결과들 하기의 논의는, 인덱스 이미지들을 정규화하고 증강시키는 것이 인덱스 서열들에 대한 신경 네트워크 기반 염기 호출자의 염기 호출 정확도를 개선한다는 것을 보여준다. 특히, 하기의 성능 결과들은, 신경 네트워크 기 반 염기 호출자가 개시된 정규화 및 증강 기법들을 사용할 때에 비해 신경 네트워크 기반 염기 호출자 가 개시된 정규화 및 증강 기법들을 사용하지 않을 때 염기 호출 에러가 증가하는, 개시된 기술의 독창성 의 객관적 표시를 제공한다. 도 29, 도 30 및 도 31에 도시된 그래프들은 4개 유형들의 라인들, 즉, 청록색 라인, 황색 라인, 녹색 라인, 및 흑색 라인을 갖는다. 청록색 라인은 인덱스 이미지들이 정규화되지 않을 때의 신경 네트워크 기반 기본 호출자의 인덱스 염기 호출 성능을 표현한다(\"DeepRTA(비정규화)\"). 황색 라인은 인덱스 이미지들이 정규화될 때의 신경 네트워크 기반 기본 호출자의 인덱스 염기 호출 성능 을 표현한다(\"DeepRTA(정규화)\"). 녹색 라인은 인덱스 이미지들이 증강될 때의 신경 네트워크 기반 기본 호출자의 인덱스 염기 호출 성능을 표현한다(\"DeepRTA(증강)\"). 흑색 라인은 실시간 분석(Real-Time Analysis, \"RTA\")이라 불리는 Illumina의 비-신경 네트워크 기반 기본 호 출자의 인덱스 염기 호출 성능을 표현한다. RTA에 관한 추가적인 세부사항들은 발명의 명칭이 \"DATA PROCESSING SYSTEM AND METHODS\"이고 2011년 1월 13일자로 출원된 미국 특허 출원 공개 제2012/0020537호(대리 인 문서 번호 ILLINC.174A)에서 찾을 수 있으며, 이는 본 명세서에 참고로 포함된다. RTA는 인덱스 서열들에 대해 양호한 염기 호출 정확도를 갖는 것으로 알려져 있고, 따라서, 비교를 위한 기준점 으로 사용될 수 있다. 또한, 그래프들에서, x-축은 염기 호출 정확도의 표시인 에러 백분율을 표현하고, y-축은 인덱스 서열분석 사이 클들의 사이클 수를 표현한다. 더욱이, 그래프들은 7개의 인덱스 서열분석 사이클들을 각각 갖는 2개의 인덱스 판독물들, 즉 판독물: 1 및 판독물: 2를 보여준다. 도 29는 4개의 샘플들을 멀티플렉싱하기 위해 4개의 인덱스 서열들을 사용하는 서열분석 런의 경우, 인덱스 이 미지들이 정규화되지 않을 때 신경 네트워크 기반 염기 호출자의 인덱스 염기 호출 성능이 떨어진다는 것 을 도시한다(예컨대, 인덱스 판독물: 2의 청록색 라인).에러 백분율은 점선 직사각형들로 표시된 바와 같이, 인덱스 이미지들이 정규화될 때(황색 라인) 그리고 또한, 그들이 증강될 때(녹색 라인) 상대적으로 낮다. 더욱이, 정규화 및 증강 구현예들의 경우의 에러 백분율은 RTA 의 에러 백분율의 라인들을 따른다. 도 30은 2개의 샘플들을 멀티플렉싱하기 위해 2개의 인덱스 서열들을 사용하는 서열분석 런의 경우, 점선 직사 각형들로 표시된 바와 같이, 인덱스 이미지들이 정규화되지 않을 때 신경 네트워크 기반 염기 호출자의 인 덱스 염기 호출 성능이 떨어진다는 것을 도시한다(예컨대, 인덱스 판독물: 2의 청록색 라인). 에러 백분율은 인덱스 이미지들이 정규화될 때(황색 라인) 그리고 또한, 그들이 증강될 때(녹색 라인) 상대적으 로 낮다. 더욱이, 정규화 및 증강 구현예들의 경우의 에러 백분율은 RTA의 에러 백분율의 라인들을 따른다. 도 31은 단일 샘플을 서열분석하기 위해 단일 인덱스 서열을 사용하는 서열분석 런의 경우, 점선 직사각형들로 표시된 바와 같이, 인덱스 이미지들이 정규화되지 않을 때 신경 네트워크 기반 염기 호출자의 인덱스 염기 호출 성능이 떨어진다는 것을 도시한다(예컨대, 인덱스 판독물: 2의 청록색 라인). 에러 백분율은 인덱스 이미지들이 정규화될 때(황색 라인) 그리고 또한, 그들이 증강될 때(녹색 라인) 상대적으 로 낮다. 더욱이, 정규화 및 증강 구현예들의 경우의 에러 백분율은 RTA의 에러 백분율의 라인들을 따른다. 표적 이미지들 및 인덱스 이미지들을 사용한 염기 호출 도 7은 표적 서열들 및 인덱스 서열들을 염기 호출하는 하나의 구현예를 도시한다. 표적 서열들은 복수의 샘플 들로부터 도출되고 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성한다. 각각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘플과 고유하게 연관된다. 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위 해 풀링된다. 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고, 인덱스 서열들은 서열 분석 런의 인덱스 서열분석 사이클들 동안 서열분석된다. 다른 구현예에서, 개시된 기술은 표적 이미지들 및 인덱스 이미지들을 동일한 방식으로 정규화한다. 표적 이미 지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 인덱스 이미지들 은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 인덱스 이미지를 사전-프로세싱하기 위해, 개시된 기술은, (i) 하나 이상의 선행 인덱스 서열분석 사이클 들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이 미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능 을 사용한다. 제2 정규화 기능은 (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 인덱 스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들 로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세 기 값들의 상위 백분위수를 계산한다. 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율은 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율은 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율은 하위 백분위수와 상위 백분위수 사이이다. 표적 이미지를 사전-프로세싱하기 위해, 개시된 기술은 또한, (i) 하나 이상의 선행 표적 서열분석 사이클 들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표적 서열분석 사이클들로부터의 표적 이미지들 의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 제2 정규화 기능을 사용한다. 제2 정규화 기능은 (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열 분석 사이클로부터의 표적 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 표적 서열분석 사 이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표적 서열분석 사이클들로부터의 표적 이미 지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들의 상위 백분위수를 계산한다. 표적 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율은 하위 백분위수 미 만이고, 정규화된 세기 값들의 제2 백분율은 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율은 하위백분위수와 상위 백분위수 사이이다. 하나의 구현예에서, 표적 서열분석 사이클들에 걸친 정규화는 또한, 표적 서열분석 사이클들의 이미지 데이터 내의 이미지 채널들에 걸친 정규화를 포함한다. 예를 들어, 3개의 표적 서열분석 사이클들, 즉, 제1 표적 서열 분석 사이클, 제2 표적 서열분석 사이클, 및 제3 표적 서열분석 사이클을 고려한다. 또한, 제1, 제2, 및 제3 표적 서열분석 사이클들 각각은 2개의 표적 이미지들, 즉 제1 이미지 채널(예컨대, 적색 채널) 내의 제1 표적 이미지(예컨대, 적색 표적 이미지), 및 제2 이미지 채널(예컨대, 녹색 채널) 내의 제2 표적 이미지(예컨대, 녹 색 표적 이미지)를 갖는다는 것을 고려한다. 제2 표적 서열분석 사이클로부터의 적색 표적 이미지는, (i) 제1 표적 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들, (ii) 제3 표적 서열분석 사이클로부터의 적 색 및 녹색 이미지들의 세기 값들, 및 (iii) 제2 표적 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들에 기초하여 정규화된다. 제2 표적 서열분석 사이클로부터의 녹색 표적 이미지는, (i) 제1 표적 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들, (ii) 제3 표적 서열분석 사이클로부터의 적색 및 녹색 이 미지들의 세기 값들, 및 (iii) 제2 표적 서열분석 사이클로부터의 적색 및 녹색 이미지들의 세기 값들에 기초하 여 정규화된다. 개시된 기술은, 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성한다. 개시된 기술은, 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하 고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독 물들을 생성한다. 하나의 구현예에서, 제2 정규화 기능을 사용하는 표적 이미지들 및 인덱스 이미지들의 사전-프로세싱은, 추론 동안뿐만 아니라 신경 네트워크 기반 염기 호출자의 트레이닝 동안에도 발생한다. 개시된 기술은, 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복수의 샘플들 중의 특정 샘플에 속하는 것으로 분류함으로써 디멀티플렉싱을 수행한다. 컴퓨터 시스템 도 32는 개시된 기술을 구현하는데 사용될 수 있는 컴퓨터 시스템이다. 컴퓨터 시스템은 버스 서 브시스템을 통해 다수의 주변 디바이스들과 통신하는 적어도 하나의 중앙 프로세싱 유닛(CPU)을 포 함한다. 이러한 주변 디바이스들은, 예를 들어 메모리 디바이스들 및 파일 저장 서브시스템을 포함하는 저장 서브시스템, 사용자 인터페이스 입력 디바이스들, 사용자 인터페이스 출력 디바이스들, 및 네트워크 인터페이스 서브시스템을 포함할 수 있다. 입력 및 출력 디바이스들은 컴퓨터 시스템(320 0)과의 사용자 상호작용을 허용한다. 네트워크 인터페이스 서브시스템은 다른 컴퓨터 시스템들에서의 대 응하는 인터페이스 디바이스들에 대한 인터페이스를 포함하는 인터페이스를 외부 네트워크들에 제공한다. 하나의 구현예에서, 백분위수 계산기, 이미지 정규화기, 및 신경 네트워크 기반 염기 호출자는 저장 서브시스템 및 사용자 인터페이스 입력 디바이스들에 통신가능하게 링크된다. 사용자 인터페이스 입력 디바이스들은 키보드; 마우스, 트랙볼, 터치패드, 또는 그래픽 태블릿과 같은 포 인팅 디바이스들; 스캐너; 디스플레이 내에 통합된 터치 스크린; 음성 인식 시스템들 및 마이크로폰들과 같은 오디오 입력 디바이스들; 및 다른 유형들의 입력 디바이스들을 포함할 수 있다. 일반적으로, 용어 \"입력 디바 이스\"의 사용은 정보를 컴퓨터 시스템에 입력하기 위한 모든 가능한 유형들의 디바이스들 및 방식들을 포 함하도록 의도된다. 사용자 인터페이스 출력 디바이스들은 디스플레이 서브시스템, 프린터, 팩스 기계, 또는 오디오 출력 디 바이스들과 같은 비시각적 디스플레이들을 포함할 수 있다. 디스플레이 서브시스템은 LED 디스플레이, 음극선 관(CRT), 액정 디스플레이(LCD)와 같은 평면 디바이스, 프로젝션 장치, 또는 가시적인 이미지를 생성하기 위한 일부 다른 메커니즘을 포함할 수 있다. 디스플레이 서브시스템은 또한, 오디오 출력 디바이스들과 같은 비시각 적 디스플레이를 제공할 수 있다. 대체적으로, \"출력 디바이스\"라는 용어의 사용은 정보를 컴퓨터 시스템 으로부터 사용자에게 또는 다른 기계 또는 컴퓨터 시스템에 출력하기 위한 모든 가능한 유형들의 디바이 스들 및 방식들을 포함하도록 의도된다. 저장 서브시스템은 본 명세서에 기술된 모듈들 및 방법들 중 일부 또는 전부의 기능을 제공하는 프로그래 밍 및 데이터 구성들을 저장한다. 이들 소프트웨어 모듈들은, 대체적으로, 심층 학습 프로세서들에 의해 실행된다. 심층 학습 프로세서들은 그래픽 프로세싱 유닛(GPU)들, 필드 프로그래밍가능 게이트 어레이(FPGA)들, 주 문형 반도체(ASIC)들, 및/또는 코어스-그레인드 재구성가능 아키텍처(CGRA)들일 수 있다. 심층 학습 프로세서 들은 Google Cloud Platform™, Xilinx™, 및 Cirrascale™과 같은 심층 학습 클라우드 플랫폼에 의해 호스팅될 수 있다. 심층 학습 프로세서들의 예들은 Google의 Tensor Processing Unit(TPU)™, 랙마운트 솔루션들, 예컨대 GX4 Rackmount Series™, GX32 Rackmount Series™, NVIDIA DGX-1™, Microsoft의 Stratix V FPGA™, Graphcore의 Intelligent Processor Unit (IPU)™, Snapdragon processors™을 갖는 Qualcomm의 Zeroth Platform™, NVIDIA의 Volta™, NVIDIA의 DRIVE PX™, NVIDIA의 JETSON TX1/TX2 MODULE™, Intel의 Nirvana™, Movidius VPU™, Fujitsu DPI™, ARM의 DynamicIQ™, IBM TrueNorth™ 등을 포함한다. 저장 서브시스템에 사용되는 메모리 서브시스템은 프로그램 실행 동안 명령어들 및 데이터의 저장 을 위한 메인 랜덤 액세스 메모리(RAM) 및 고정된 명령어들이 저장되는 판독 전용 메모리(ROM)를 포함하는 다수의 메모리들을 포함할 수 있다. 파일 저장 서브시스템은 프로그램 및 데이터 파일을 위한 영구 저장소를 제공할 수 있고, 하드 디스크 드라이브, 연관된 착탈 가능 매체와 함께 플로피 디스크 드라이브, CD-ROM 드라이브, 광학 드라이브, 또는 착탈 가능 매체 카트리지를 포함할 수 있다. 소정 구현예들의 기능을 구현하는 모듈들은 저장 서브시스템 내의 파일 저장 서브시스템에 의해, 또는 프로세서에 의해 액 세스가능한 다른 기계들에 저장될 수 있다. 버스 서브시스템은 컴퓨터 시스템의 다양한 컴포넌트들 및 서브시스템들이 의도된 대로 서로 통신 하게 하기 위한 메커니즘을 제공한다. 버스 서브시스템이 개략적으로 단일 버스로서 도시되어 있지만, 버스 서브시스템의 대안적인 구현예들은 다수의 버스들을 사용할 수 있다. 컴퓨터 시스템 자체는 개인용 컴퓨터, 휴대용 컴퓨터, 워크스테이션, 컴퓨터 단말기, 네트워크 컴퓨터, 텔레비전, 메인프레임, 서버 팜, 느슨하게 네트워킹된 컴퓨터들의 광범위하게 분포된 세트, 또는 임의의 다른 데이터 프로세싱 시스템 또는 사용자 디바이스를 포함한 다양한 유형들의 것일 수 있다. 컴퓨터들 및 네트워크 들의 변화하는(ever-changing) 특성으로 인해, 도 32에 묘사된 컴퓨터 시스템의 설명은 본 발명의 바람직 한 구현예들을 예시하기 위한 특정 예로서만 의도된다. 도 32에 묘사된 컴퓨터 시스템보다 더 많은 또는 더 적 은 컴포넌트들을 갖는 컴퓨터 시스템의 많은 다른 구성들이 가능하다. 특정 구현예들 인덱스 서열들의 인공 지능 기반 염기 호출의 다양한 구현예들을 기술한다. 구현예의 하나 이상의 특징부들은 기본 구현예와 조합될 수 있다. 상호 배타적이지 않은 구현예들은 조합가능한 것으로 교시되어 있다. 구현예 의 하나 이상의 특징부들은 다른 구현예들과 조합될 수 있다. 본 발명은 이러한 옵션들을 사용자에게 주기적으 로 리마인드한다. 이러한 옵션들을 반복하는 인용들의 일부 구현예들로부터의 생략은 전술한 섹션들에 교시된 조합들을 제한하는 것으로서 간주되어서는 안된다 - 이들 인용들은 이로써 다음의 구현예들 각각에 참조로 통합 된다. 하나의 구현예에서, 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법을 개시한다. 본 방법은 서열분석 런 의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계를 포함한 다. 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사한다. 본 방법은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계를 포함한다. 본 방법은, 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱 스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 추가로 포함한다. 개시된 기술의 본 섹션 및 다른 섹션들에 기술된 방법은 개시된 추가의 방법들과 관련하여 기술된 특징부들 및/ 또는 다음의 특징부들 중 하나 이상을 포함할 수 있다. 간결함을 위해, 본 출원에 개시된 특징부들의 조합은 개별적으로 열거되지 않고 특징부들의 각각의 기본 세트로 반복되지 않는다. 독자는, 이들 구현예들에서 식별된 특징부들이 다른 구현예들에서 식별된 기본 특징부들의 세트들과 어떻게 쉽게 조합될 수 있는지를 이해할 것 이다. 하나의 구현예에서, 정규화 기능은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들 의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상 의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열 분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 상위 백분위수를 계산하여, 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 한다. 하나의 구현예에서, 함께 취하면, 현재, 선행, 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들에 의해 묘사되는 뉴클레오티드들이, 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해서만 묘사되는 뉴클레오티드들보다 점증적으로 더 많이 다양해진다. 일부 구현예들에서, 선행 및 후행 인덱스 서열분석 사이 클들로부터의 인덱스 이미지들 중의 적어도 하나의 인덱스 이미지는 검출가능 신호 상태의 하나 이상의 뉴클레 오티드들을 묘사한다. 하나의 구현예에서, 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해 묘사되는 뉴클레오티드들은 4개의 염기들 A, C, T, 및 G 중 일부가 뉴클레오티드들 전부의 15%, 10% 또는 5% 미만의 빈도로 표현되는 낮은 복잡도 패턴들이다. 하나의 구현예에서, 함께 취하면, 현재, 선행, 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들에 의해 묘사되는 뉴클레오티드들은 4개의 염기들 A, C, T, 및 G 각각이 뉴클레오티드들 전부의 적어도 20%, 25% 또는 30%의 빈도로 표현되는 높은 복잡도 패턴들을 점증적으로 형성한다. 하나의 구현예에서, 본 방법은, 추론 동안뿐만 아니라 신경 네트워크 기반 염기 호출자의 트레이닝 동안에도 정 규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계를 포함한다. 하나의 구현예에서, 본 방법은, 인덱스 이미지의 세기 값들을 스케일링 인자와 곱하고 곱셈의 결과에 오프셋 값 을 더함으로써 인덱스 이미지의 증강된 버전을 생성하는 증강 기능을 사용하여 인덱스 이미지들을 사전-프로세 싱하는 단계를 포함한다. 본 방법은, 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 증강된 버전 들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 추가로 포함한다. 하나의 구현예에서, 본 방법은, 신경 네트워크 기반 염기 호출자의 트레이닝 동안에만 증강 기능을 사용하여 그 리고 추론 동안에는 사용하지 않고서 인덱스 이미지들을 사전-프로세싱하는 단계를 포함한다. 하나의 구현예에서, 본 방법은, (i) 하나 이상의 현재가 아닌 인덱스 서열분석 사이클들로부터의 인덱스 이미지 들의 세기 값들, 및 (ii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 이미 지들을 사전-프로세싱하는 단계를 포함한다. 일부 구현예들에서, 현재가 아닌 인덱스 서열분석 사이클들은 서 열분석의 초기 인덱스 서열분석 사이클들을 포함한다. 다른 구현예들에서, 현재가 아닌 인덱스 서열분석 사이 클들은 서열분석의 중간 인덱스 서열분석 사이클들을 포함한다. 일부 다른 구현예들에서, 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 말기 인덱스 서열분석 사이클들을 포함한다. 또 다른 구현예들에서, 현재가 아닌 인덱스 서열분석 사이클들은 초기 인덱스 서열분석 사이클들, 중간 인덱스 서열분석 사이클들, 및 말기 인 덱스 서열분석 사이클들의 조합을 포함한다. 하나의 구현예에서, 현재가 아닌 인덱스 서열분석 사이클들로부터의 적어도 하나의 인덱스 이미지는 검출가능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사한다. 이 섹션에 기술된 방법의 다른 구현예들은 전술된 방법들 중 임의의 것을 수행하도록 프로세서에 의해 실행가능 한 명령어들을 저장하는 비일시적 컴퓨터 판독가능 저장 매체를 포함할 수 있다. 이 섹션에 기술된 방법의 또 다른 구현예는 메모리, 및 메모리에 저장된 명령어들을 실행하여 전술된 방법들 중 임의의 것을 수행하도록 동 작가능한 하나 이상의 프로세서들을 포함하는 시스템을 포함할 수 있다. 도 34는 서열분석 런의 인덱스 서열분석 사이클들에서 분석물들을 염기 호출하는 인공 지능 기반 방법의 흐름도 의 하나의 구현예이다. 액션에서, 본 방법은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세 기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 서열분석 사 이클들 동안 생성된 인덱스 이미지들을 사전-프로세싱하는 단계를 포함한다. 특정 분석물이 현재 인덱스 서열분석 사이클에서 염기 호출되는 경우, 액션에서, 본 방법은, 현재, 선행, 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 정규화된 버전들로부터 인덱스 이미지 패치들을 추 출하여, 각각의 정규화된 인덱스 이미지 패치가 상기 현재 인덱스 서열분석 사이클 동안 상기 특정 분석물, 일 부 인접 분석물들, 및 상기 특정 분석물 및 상기 인접 분석물들의 대응하는 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 그들의 주변 배경의 세기 방출물들을 묘사하도록 하는 단계를 포함한다. 본 방법은, 액션에서, 콘볼루션 신경 네트워크를 통해 정규화된 인덱스 이미지 패치들을 콘볼루션하고 콘 볼루션된 표현을 생성하는 단계를 추가로 포함한다. 본 방법은, 액션에서, 콘볼루션된 표현에 기초하여 현재 인덱스 서열분석 사이클에서 특정 분석물을 염기 호출하는 단계를 추가로 포함한다. 다른 구현예들에 대해 특정 구현예 섹션에서 논의된 특징부들 각각은 이러한 구현예에 동일하게 적용된다. 상 기에 나타낸 바와 같이, 모든 다른 특징부들은 여기에서 반복되지 않으며, 참고로 반복된 것으로 간주되어야 한 다. 독자는, 이들 구현예들에서 식별된 특징부들이 다른 구현예들에서 식별된 기본 특징부들의 세트들과 어떻 게 쉽게 조합될 수 있는지를 이해할 것이다. 이 섹션에 기술된 방법의 다른 구현예들은 전술된 방법들 중 임의 의 것을 수행하도록 프로세서에 의해 실행가능한 명령어들을 저장하는 비일시적 컴퓨터 판독가능 저장 매체를 포함할 수 있다. 이 섹션에 기술된 방법의 또 다른 구현예는 메모리, 및 메모리에 저장된 명령어들을 실행하여 전술된 방법들 중 임의의 것을 수행하도록 동작가능한 하나 이상의 프로세서들을 포함하는 시스템을 포함할 수 있다. 도 35는 표적 서열들 및 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법의 흐름도의 하나의 구현예이다. 표적 서열들은 복수의 샘플들로부터 도출되고 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성한다. 각 각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘플과 고유하게 연관된다. 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링된다. 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고, 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석된다. 본 방법은, 액션에서, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스 하는 단계를 포함한다. 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출 물들을 묘사한다. 본 방법은, 액션에서, 표적 이미지의 세기 값들에만 기초하여 현재 표적 서열분석 사이클로부터 표적 이 미지의 정규화된 버전을 생성하는 제1 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계를 추가 로 포함한다. 본 방법은, 액션에서, 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로 세싱하고, 표적 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독 물들을 생성하는 단계를 추가로 포함한다. 본 방법은, 액션에서, 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계를 추가로 포함한다. 인덱스 이미지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생 성되는 세기 방출물들을 묘사한다. 본 방법은, 액션에서, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계를 추가로 포함한다. 본 방법은, 액션에서, 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프 로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 추가로 포함한다. 본 방법은, 액션에서, 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서 열의 각각의 표적 판독물을 복수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 추가로 포함한다. 다른 구현예들에 대해 특정 구현예 섹션에서 논의된 특징부들 각각은 이러한 구현예에 동일하게 적용된다. 상 기에 나타낸 바와 같이, 모든 다른 특징부들은 여기에서 반복되지 않으며, 참고로 반복된 것으로 간주되어야 한 다. 독자는, 이들 구현예들에서 식별된 특징부들이 다른 구현예들에서 식별된 기본 특징부들의 세트들과 어떻 게 쉽게 조합될 수 있는지를 이해할 것이다. 하나의 구현예에서, 제1 정규화 기능은, 표적 이미지의 세기 값들의 하위 백분위수, 및 표적 이미지의 세기 값 들의 상위 백분위수를 계산하여, 표적 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백 분율이 하위 백분위수와 상위 백분위수 사이이도록 한다. 하나의 구현예에서, 제2 정규화 기능은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미 지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상 의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열 분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들의 상위 백분위수를 계산하여, 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 한다. 이 섹션에 기술된 방법의 다른 구현예들은 전술된 방법들 중 임의의 것을 수행하도록 프로세서에 의해 실행가능 한 명령어들을 저장하는 비일시적 컴퓨터 판독가능 저장 매체를 포함할 수 있다. 이 섹션에 기술된 방법의 또 다른 구현예는 메모리, 및 메모리에 저장된 명령어들을 실행하여 전술된 방법들 중 임의의 것을 수행하도록 동 작가능한 하나 이상의 프로세서들을 포함하는 시스템을 포함할 수 있다. 본 명세서에 개시된 구현예들은 소프트웨어, 펌웨어, 하드웨어, 또는 이들의 임의의 조합을 생성하기 위해 표준 프로그래밍 또는 엔지니어링 기법들을 사용하는 방법, 장치, 시스템 또는 제조 물품으로서 구현될 수 있다. 본 명세서에 사용되는 바와 같이, 용어 \"제조 물품\"은 하드웨어 또는 컴퓨터 판독가능 매체, 예컨대 광학 저장 디 바이스들, 및 휘발성 또는 비휘발성 메모리 디바이스들에서 구현된 코드 또는 로직을 지칭한다. 그러한 하드웨 어는 FPGA들, ASIC들, CPLD(complex programmable logic device)들, PLA(programmable logic array)들, 마이 크로프로세서들, 또는 다른 유사한 프로세싱 디바이스들을 포함할 수 있지만, 이로 제한되지 않는다. 특정 구 현예들에서, 본 명세서에 기재된 정보 또는 알고리즘들은 비일시적 저장 매체에 존재한다. 개시된 기술의 하나 이상의 구현예들, 또는 이들의 요소들은, 나타낸 방법 단계들을 수행하기 위한 컴퓨터 사용 가능 프로그램 코드를 갖는 비일시적 컴퓨터 판독가능 저장 매체를 포함하는 컴퓨터 제품의 형태로 구현될 수 있다. 더욱이, 개시된 기술의 하나 이상의 구현예들, 또는 이들의 요소들은, 메모리, 및 메모리에 커플링되고 예시적인 방법 단계들을 수행하기 위해 동작하는 적어도 하나의 프로세서를 포함하는 장치의 형태로 구현될 수 있다. 또한, 추가로, 다른 태양에서, 개시된 기술의 하나 이상의 구현예들, 또는 이들의 요소들은, 본 명세서 에 기술된 방법 단계들 중 하나 이상을 수행하기 위한 수단의 형태로 구현될 수 있고; 수단은 (i) 하드웨어 모 듈(들), (ii) 하나 이상의 하드웨어 프로세서들 상에서 실행되는 소프트웨어 모듈(들), 또는 (iii) 하드웨어와 소프트웨어 모듈들의 조합을 포함할 수 있고; (i) 내지 (iii) 중 임의의 것이 본 명세서에 제시된 특정 기법들 을 구현하고, 소프트웨어 모듈들은 컴퓨터 판독가능 저장 매체(또는 다수의 그러한 매체)에 저장된다. 본 명세서에 사용되는 바와 같이, 용어 \"분석물\"은 상대 위치에 따라 다른 점들 또는 영역들과 구별될 수 있는 패턴의 점 또는 영역을 의미하도록 의도된다. 개별 분석물은 특정 유형의 하나 이상의 분자들을 포함할 수 있 다. 예를 들어, 분석물은 특정 서열을 갖는 단일 표적 핵산 분자를 포함할 수 있거나, 또는 분석물은 동일한 서열(및/또는 그의 상보적 서열)을 갖는 몇몇 핵산 분자들을 포함할 수 있다. 소정 패턴의 상이한 분석물들에 있는 상이한 분자들은 그러한 패턴의 분석물들의 위치들에 따라 서로 구별될 수 있다. 예시적인 분석물들은, 제한 없이, 기재 내의 웰, 기재 내의 또는 기재 상의 비드(또는 다른 입자), 기재로부터의 돌출부, 기재 상의 리지(ridge), 기재 상의 겔 재료의 패드, 또는 기재 내의 채널을 포함한다. 검출, 특성화, 또는 식별될 다양한 표적 분석물 중 임의의 것이 본 명세서에 기술된 장치, 시스템 또는 방법에 사용될 수 있다. 예시적인 분석물은 핵산(예컨대, DNA, RNA 또는 그의 유사체), 단백질, 다당류, 세포, 항체, 에피토프, 수용체, 리간드, 효소(예를 들어, 키나제, 포스파타제 또는 폴리머라제), 소분자 약물 후보물질, 세 포, 바이러스, 유기체 등을 포함하지만, 이로 한정되지 않는다. 용어 \"분석물\", \"핵산\", \"핵산 분자\", 및 \"폴리뉴클레오티드\"는 본 명세서에서 상호교환가능하게 사용된다. 다 양한 구현예들에서, 핵산은, 핵산 증폭, 핵산 발현 분석, 및/또는 핵산 서열 결정 또는 이들의 적합한 조합들을 포함하지만 이로 한정되지 않는 특정 유형들의 핵산 분석을 위해 본 명세서에 제공된 바와 같은 템플릿들(예컨 대, 핵산 템플릿, 또는 핵산 핵산 템플릿에 상보적인 핵산 상보체)로서 사용될 수 있다. 소정 구현예들에서의 핵산은, 예를 들어, 3'-5' 포스포다이에스테르 또는 다른 결합(linkage)에서의 데옥시리보뉴클레오티드의 선형 중합체, 예컨대 데옥시리보핵산(DNA), 예를 들어, 단일 가닥 및 이중 가닥 DNA, 게놈 DNA, 복제 DNA 또는 상보 적 DNA(cDNA), 재조합 DNA, 또는 임의의 형태의 합성 또는 변형된 DNA를 포함한다. 다른 구현예들에서, 핵산은, 예를 들어, 3'-5' 포스포다이에스테르 또는 다른 결합에서의 리보뉴클레오티드의 선형 중합체, 예컨대 리보핵산(RNA), 예를 들어, 단일 가닥 및 이중 가닥 RNA, 메신저(mRNA), 복제 RNA 또는 상보적 RNA(cRNA), 선 택적으로 스플라이싱된 mRNA, 리보솜 RNA, 소핵소체 RNA(snoRNA), 마이크로 RNA(miRNA), 소간섭 RNA(sRNA), piwi RNA(piRNA), 또는 임의의 형태의 합성 또는 변형된 RNA를 포함한다. 본 발명의 조성물들 및 방법들에 사 용되는 핵산은 길이가 다를 수 있으며, 온전한 또는 전장(full-length) 분자 또는 단편 또는 더 큰 핵산 분자의 더 작은 부분일 수 있다. 특정 구현예들에서, 핵산은, 본 명세서의 다른 곳에 기술된 바와 같이, 하나 이상의 검출가능한 표지들을 가질 수 있다. 용어들 \"분석물\", \"클러스터\", \"핵산 클러스터\", \"핵산 콜로니\", 및 \"DNA 클러스터\"는 상호교환가능하게 사용되 며, 고체 지지체에 부착된 핵산 템플릿 및/또는 그의 상보체들의 복수의 복제물들을 지칭한다. 전형적으로 그 리고 소정의 바람직한 구현예들에서, 핵산 클러스터는 5' 말단을 통해 고체 지지체에 부착된 템플릿 핵산 및/또 는 그의 상보체의 복수의 복제물들을 포함한다. 핵산 클러스터들을 구성하는 핵산 가닥들의 복제물들은 단일 가닥 또는 이중 가닥 형태일 수 있다. 클러스터 내에 존재하는 핵산 템플릿의 복제물들은, 예를 들어, 표지 모 이어티의 존재로 인해, 서로 상이한 대응하는 포지션들에 뉴클레오티드를 가질 수 있다. 대응하는 포지션들은, 또한, 우라실 및 티민에 대한 경우와 같이, 상이한 화학 구조를 갖지만 유사한 왓슨-크릭(Watson-Crick) 염기쌍 형성 속성들을 갖는 아날로그 구조들을 포함할 수 있다. 핵산의 콜로니들은 \"핵산 클러스터들\"로도 지칭될 수 있다. 핵산 콜로니들은 본 명세서의 다른 곳에서 더욱 상 세히 기술되는 바와 같은 클러스터 증폭 또는 브리지 증폭 기법들에 의해 선택적으로 생성될 수 있다. 표적 서 열의 다수의 반복부들이 단일 핵산 분자, 예컨대 회전환 증폭(rolling circle amplification) 절차를 사용하여 생성된 콘카티머(concatemer)에 존재할 수 있다. 본 발명의 핵산 클러스터들은 사용되는 조건들에 따라 상이한 형상들, 크기들 및 밀도들을 가질 수 있다. 예를 들어, 클러스터들은 실질적으로 둥근형, 다면형, 도넛형 또는 링형인 형상을 가질 수 있다. 핵산 클러스터의 직경은 약 0.2 μm 내지 약 6 μm, 약 0.3 μm 내지 약 4 μm, 약 0.4 μm 내지 약 3 μm, 약 0.5 μm 내지 약 2 μm, 약 0.75 μm 내지 약 1.5 μm, 또는 임의의 중간 직경이 되도록 설계될 수 있다. 특정 구현예에서, 핵 산 클러스터의 직경은 약 0.5 μm, 약 1 μm, 약 1.5 μm, 약 2 μm, 약 2.5 μm, 약 3 μm, 약 4 μm, 약 5 μm, 또는 약 6 μm이다. 핵산 클러스터의 직경은, 클러스터를 생성하는 데 있어서 수행되는 증폭 사이클들의 수, 핵산 템플릿의 길이, 또는 클러스터들이 형성되는 표면에 부착된 프라이머들의 밀도를 포함하지만 이로 한 정되지 않는 다수의 파라미터들에 의해 영향을 받을 수 있다. 핵산 클러스터들의 밀도는, 전형적으로 0.1/㎟, 1/㎟, 10/㎟, 100/㎟, 1,000/㎟, 10,000/㎟ 내지 100,000/㎟의 범위가 되도록 설계될 수 있다. 본 발명은, 부 분적으로, 더 높은 밀도의 핵산 클러스터들, 예를 들어, 100,000/㎟ 내지 1,000,000/㎟ 및 1,000,000/㎟ 내지 10,000,000/㎟를 추가로 고려한다. 본 명세서에 사용되는 바와 같이, \"분석물\"은 시료 또는 시야 내의 관심 영역이다. 마이크로어레이 디바이스들 또는 다른 분자 분석용 디바이스들과 관련하여 사용될 때, 분석물은 유사한 또는 동일한 분자들에 의해 점유되 는 영역을 지칭한다. 예를 들어, 분석물은 증폭된 올리고뉴클레오티드, 또는 동일하거나 유사한 서열을 갖는 폴리뉴클레오티드 또는 폴리펩티드의 임의의 다른 그룹일 수 있다. 다른 구현예들에서, 분석물은 시료 상의 물 리적 영역을 점유하는 임의의 요소 또는 요소들의 그룹일 수 있다. 예를 들어, 분석물은 한 구획의 땅(parcel of land), 수역(body of water) 등일 수 있다. 분석물이 이미징될 때, 각각의 분석물은 약간의 영역을 가질 것 이다. 따라서, 많은 구현예들에서, 분석물은 단지 하나의 픽셀만이 아니다. 분석물들 사이의 거리들은 많은 방식들로 기술될 수 있다. 일부 구현예들에서, 분석물들 사이의 거리들은 하나 의 분석물의 중심으로부터 다른 분석물의 중심까지로 설명될 수 있다. 다른 구현예들에서, 거리들은 하나의 분 석물의 에지로부터 다른 분석물의 에지까지로, 또는 각각의 분석물의 최외측의 식별가능한 지점들 사이로 설명 될 수 있다. 분석물의 에지는 칩 상의 이론적 또는 실제의 물리적 경계로서, 또는 분석물의 경계 내부의 어떠 한 지점으로서 설명될 수 있다. 다른 구현예들에서, 거리들은 시료 상의 고정된 지점과 관련하여 또는 시료의 이미지에서 설명될 수 있다. 항목들 하기의 항목들은 본 개시내용의 일부이다: 인덱스 판독물들 1. 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단 계 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사함 -; 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계 를 포함하는, 인공 지능 기반 방법. 2. 항목 1에 있어서, 정규화 기능은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들의 상위 백분위수를 계산하여, 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법. 3. 항목 1에 있어서, 함께 취하면, 현재, 선행 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들에 의해 묘사된 뉴클레오 티드들은 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해서만 묘사되는 뉴클레오티드들보다 점증적으로 더 많이 다양해지는, 인공 지능 기반 방법. 4. 항목 3에 있어서, 선행 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들 중의 적어도 하나의 인 덱스 이미지는 검출가능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사하는, 인공 지능 기반 방법. 5. 항목 3에 있어서, 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들에 의해 묘사되는 뉴클레오티드들 은 4개의 염기들 A, C, T, 및 G 중 일부가 뉴클레오티드들 전부의 15%, 10% 또는 5% 미만의 빈도로 표현되는 낮은 복잡도 패턴들인, 인공 지능 기반 방법. 6. 항목 5에 있어서, 함께 취하면, 현재, 선행, 및 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들에 의해 묘사되는 뉴클레오티드들은 4개의 염기들 A, C, T, 및 G 각각이 뉴클레오티드들 전부의 적어도 20%, 25% 또는 30%의 빈도로 표현되는 높은 복잡도 패턴들을 점증적으로 형성하는, 인공 지능 기반 방법. 7. 항목 1에 있어서, 추론 동안뿐만 아니라 신경 네트워크 기반 염기 호출자의 트레이닝 동안에도 정규화 기능을 사용하여 인덱스 이 미지들을 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 8. 항목 1에 있어서, 인덱스 이미지의 세기 값들을 스케일링 인자와 곱하고, 곱셈의 결과에 오프셋 값을 더함으로써 인덱스 이미지의 증강된 버전을 생성하는 증강 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 증강된 버전들을 프로세싱하고, 인덱스 서열분석 사 이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 9. 항목 8에 있어서, 신경 네트워크 기반 염기 호출자의 트레이닝 동안에만 증강 기능을 사용하여 그리고 추론 동안에는 사용하지 않 고서 인덱스 이미지들을 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 10. 항목 1에 있어서, 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 현재가 아닌 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (ii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 11. 항목 10에 있어서, 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 초기 인덱스 서열분석 사이클들을 포함하는, 인공 지능 기반 방법. 12. 항목 10에 있어서, 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 중간 인덱스 서열분석 사이클들을 포함하는, 인공 지능 기반 방법. 13. 항목 10에 있어서, 현재가 아닌 인덱스 서열분석 사이클들은 서열분석의 말기 인덱스 서열분석 사이클들을 포함하는, 인공 지능 기반 방법. 14. 항목 13에 있어서, 현재가 아닌 인덱스 서열분석 사이클들은 초기 인덱스 서열분석 사이클들, 중간 인덱스 서열분석 사이클들, 및 말기 인덱스 서열분석 사이클들의 조합을 포함하는, 인공 지능 기반 방법. 15. 항목 10에 있어서, 현재가 아닌 인덱스 서열분석 사이클들로부터의 적어도 하나의 인덱스 이미지는 검출가 능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사하는, 인공 지능 기반 방법. 16. 서열분석 런의 인덱스 서열분석 사이클들에서 분석물들을 염기 호출하는 인공 지능 기반 방법으로서, 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 서열분석 사이클들 동안 생성된 인덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것 은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 특정 분석물이 현재 인덱스 서열분석 사이클에서 염기 호출되는 경우, 현재, 선행, 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 정규화된 버전들로부터 인덱스 이미지 패치들을 추출하여, 각각의 정규화된 인덱스 이미지 패치가 현재 인덱스 서열분석 사이클 동안 특정 분석물, 일부 인접 분석물들, 및 특정 분석물 및 인접 분석물들의 대응하는 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 그들의 주변 배경의 세기 방출물들을 묘사하도록 하는 단계; 콘볼루션 신경 네트워크를 통해 정규화된 인덱스 이미지 패치들을 콘볼루션하고 콘볼루션된 표현을 생성하는 단 계; 및 콘볼루션된 표현에 기초하여 현재 인덱스 서열분석 사이클에서 특정 분석물을 염기 호출하는 단계를 포함하는, 인공 지능 기반 방법. 17. 표적 서열들 및 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 표적 서열들은 복수의 샘플들 로부터 도출되고 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성하고, 각각의 인덱스 서열은 복수의 샘 플들 중의 각자의 샘플과 고유하게 연관되고, 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링 되고, 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석되며, 본 방법은, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 표적 이미지의 세기 값들에만 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성 하는 제1 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 - 인덱스 이 미지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능을 사용하여 인 덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계; 및 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복 수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 포함하는, 인공 지능 기반 방법. 18. 항목 17에 있어서, 제1 정규화 기능은, 표적 이미지의 세기 값들의 하위 백분위수, 및 표적 이미지의 세기 값들의 상위 백분위수를 계산하여, 표적 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법. 19. 항목 17에 있어서, 제2 정규화 기능은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들의 상위 백분위수를 계산하여, 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법. 인덱스 및 정상 판독물들 20. 표적 서열들 및 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 표적 서열들은 복수의 샘플들 로부터 도출되고 인덱스 서열들에 커플링되어 표적-인덱스 서열들을 형성하고, 각각의 인덱스 서열은 복수의 샘 플들 중의 각자의 샘플과 고유하게 연관되고, 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링 되고, 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석되며, 본 방법은, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 - 인덱스 이 미지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버 전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계; 및 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복 수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 포함하는, 인공 지능 기반 방법. 21. 항목 20에 있어서, 정규화 기능은, (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들의 상위 백분위수를 계산하여, 표적 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법. 22. 항목 20에 있어서, 정규화 기능은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들의 하위 백분위수, 및 (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들의 상위 백분위수를 계산하여, 인덱스 이미지의 정규화된 버전에서, 정규화된 세기 값들의 제1 백분율이 하위 백분위수 미만이고, 정규화된 세기 값들의 제2 백분율이 상위 백분위수 초과이고, 정규화된 세기 값들의 제3 백분율이 하위 백분위수와 상위 백분위수 사이이도록 하는, 인공 지능 기반 방법. 23. 항목 20에 있어서, 추론 동안뿐만 아니라 신경 네트워크 기반 염기 호출자의 트레이닝 동안에도 정규화 기능을 사용하여 표적 이미 지들 및 인덱스 이미지들을 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 24. 항목 20에 있어서, 표적 이미지의 세기 값들을 스케일링 인자와 곱하고, 곱셈의 결과에 오프셋 값을 더함으로써 표적 이미지의 증 강된 버전을 생성하는 증강 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 증강된 버전들을 프로세싱하고, 표적 서열분석 사이클 들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 25. 항목 20에 있어서, 인덱스 이미지의 세기 값들을 스케일링 인자와 곱하고, 곱셈의 결과에 오프셋 값을 더함으로써 인덱스 이미지의 증강된 버전을 생성하는 증강 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 증강된 버전들을 프로세싱하고, 인덱스 서열분석 사 이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 26. 항목 20에 있어서, 신경 네트워크 기반 염기 호출자의 트레이닝 동안에만 증강 기능을 사용하여 그리고 추론 동안에는 사용하지 않 고서 표적 이미지들 및 인덱스 이미지들을 사전-프로세싱하는 단계를 추가로 포함하는, 인공 지능 기반 방법. 27. 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 서열분석 런의 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표 적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단 계 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기방출물들을 묘사함 -; (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버 전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계 를 포함하는, 인공 지능 기반 방법. 상기에 기술된 방법의 다른 구현예들은 전술된 방법들 중 임의의 것을 수행하도록 프로세서에 의해 실행가능한 명령어들을 저장하는 비일시적 컴퓨터 판독가능 저장 매체를 포함할 수 있다. 이 섹션에 기술된 방법의 또 다 른 구현예는 메모리, 및 메모리에 저장된 명령어들을 실행하여 전술된 방법들 중 임의의 것을 수행하도록 동작 가능한 하나 이상의 프로세서들을 포함하는 시스템을 포함할 수 있다. 28. 서열들을 염기 호출하는 인공 지능 기반 방법으로서, 서열분석 런의 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표 적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단 계 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사함 -; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들을 프로세싱하고, 표적 서열분석 사이클들 각각 동안 염 기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 포함하는, 인공 지능 기반 방법. 29. 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 시스템으로서, 메모리에는 인덱스 서열들을 염기 호출하기 위한 컴퓨터 명령어들이 로딩되고, 명령어들은, 프로세서들 상에서 실행될 때, 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 것 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방 출물들을 묘사함 -; 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 것으로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 것; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 것을 포함하는 액션들을 구현하는, 시스템. 30. 항목 29에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 시스템. 31. 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 시스템으로서, 메모리에는 서열분석 런의 인덱스 서열분석 사이클들에서 분석물들을 염기 호출하기 위한 컴퓨터 명령어들이 로딩되고, 명령어들은, 프로세서들상에서 실행될 때, 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 서열분석 사이클들 동안 생성된 인덱스 이미지들을 사전-프로세싱하는 것으로서, 정규화된 버전을 생성하는 것 은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 것; 특정 분석물이 현재 인덱스 서열분석 사이클에서 염기 호출되는 경우, 현재, 선행, 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 정규화된 버전들로부터 인덱스 이미지 패치들을 추출하여, 각각의 정규화된 인덱스 이미지 패치가 현재 인덱스 서열분석 사이클 동안 특정 분석물, 일부 인접 분석물들, 및 특정 분석물 및 인접 분석물들의 대응하는 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 그들의 주변 배경의 세기 방출물들을 묘사하도록 하는 것; 콘볼루션 신경 네트워크를 통해 정규화된 인덱스 이미지 패치들을 콘볼루션하고 콘볼루션된 표현을 생성하는 것; 및 콘볼루션된 표현에 기초하여 현재 인덱스 서열분석 사이클에서 특정 분석물을 염기 호출하는 것을 포함하는 액 션들을 구현하는, 시스템. 32. 항목 31에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 시스템. 33. 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 시스템으로서, 메모리에는 표적 서열들 및 인덱스 서열들을 염기 호출하기 위한 컴퓨터 명령어들이 로딩되고, 표적 서열들은 복수의 샘플들로부터 도출되고 인덱 스 서열들에 커플링되어 표적-인덱스 서열들을 형성하고, 각각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘 플과 고유하게 연관되고, 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링되고, 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사 이클들 동안 서열분석되며, 명령어들은, 프로세서들 상에서 실행될 때, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 것 - 표적 이미지들은 표 적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 표적 이미지의 세기 값들에만 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성 하는 제1 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 것; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 것; 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 것 - 인덱스 이미 지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능을 사용하여 인 덱스 이미지들을 사전-프로세싱하는 것으로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 것; 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 것;및 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복 수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 것을 포함하는 액션들을 구현하는, 시스템. 34. 항목 33에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 시스템. 35. 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 시스템으로서, 메모리에는 표적 서열들 및 인덱스 서열들을 염기 호출하기 위한 컴퓨터 명령어들이 로딩되고, 표적 서열들은 복수의 샘플들로부터 도출되고 인덱 스 서열들에 커플링되어 표적-인덱스 서열들을 형성하고, 각각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘 플과 고유하게 연관되고, 표적-인덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링되고, 표적 서열들은 서열분석 런의 표적 서열분석 사이클들 동안 서열분석되고 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사 이클들 동안 서열분석되며, 명령어들은, 프로세서들 상에서 실행될 때, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 것 - 표적 이미지들은 표 적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 것; 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 것 - 인덱스 이미 지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버 전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 것; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 것; 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 것; 및 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복 수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 것을 포함하는 액션들을 구현하는, 시스템. 36. 항목 35에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 시스템. 37. 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 시스템으로서, 메모리에는 서열들을 염기 호출하기 위한 컴퓨터 명령어들이 로딩되고, 명령어들은, 프로세서들 상에서 실행될 때, 서열분석 런의 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 것 - 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 것; 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 것 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방 출물들을 묘사함 -; (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버 전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 것; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 것; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 것을 포함하는 액션들을 구현하는, 시스템. 38. 항목 37에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 시스템. 39. 메모리에 커플링된 하나 이상의 프로세서들을 포함하는 시스템으로서, 메모리에는 서열들을 염기 호출하기 위한 컴퓨터 명령어들이 로딩되고, 명령어들은, 프로세서들 상에서 실행될 때, 서열분석 런의 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 것 - 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 것 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방 출물들을 묘사함 -; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들을 프로세싱하고, 표적 서열분석 사이클들 각각 동안 염 기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 것; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 것을 포함하는 액션들을 구현하는, 시스템. 40. 항목 39에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 시스템. 41. 인덱스 서열들을 염기 호출하기 위해 컴퓨터 프로그램 명령어들이 저장되는 비일시적 컴퓨터 판독가능 저 장 매체로서, 명령어들은, 프로세서 상에서 실행될 때, 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단 계 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사함 -; 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계 를 포함하는 방법을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 42. 항목 41에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 43. 서열분석 런의 인덱스 서열분석 사이클들에서 분석물들을 염기 호출하기 위해 컴퓨터 프로그램 명령어들이 저장되는 비일시적 컴퓨터 판독가능 저장 매체로서, 명령어들은, 프로세서 상에서 실행될 때, 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 인덱스 서열분석 사이클들 동안 생성된 인덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것 은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 특정 분석물이 현재 인덱스 서열분석 사이클에서 염기 호출되는 경우, 현재, 선행, 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 정규화된 버전들로부터 인덱스 이미지 패치들을 추출하여, 각각의 정규화된 인덱스 이미지 패치가 현재 인덱스 서열분석 사이클 동안 특정 분석물, 일부 인접 분석물들, 및 특정 분석물 및 인접 분석물들의 대응하는 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 그들의 주변 배경의 세기 방출물들을 묘사하도록 하는 단계; 콘볼루션 신경 네트워크를 통해 정규화된 인덱스 이미지 패치들을 콘볼루션하고 콘볼루션된 표현을 생성하는 단 계; 및 콘볼루션된 표현에 기초하여 현재 인덱스 서열분석 사이클에서 특정 분석물을 염기 호출하는 단계를 포함하는 방법을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 44. 항목 43에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 45. 표적 서열들 및 인덱스 서열들을 염기 호출하기 위해 컴퓨터 프로그램 명령어들이 저장되는 비일시적 컴퓨 터 판독가능 저장 매체로서, 표적 서열들은 복수의 샘플들로부터 도출되고 인덱스 서열들에 커플링되어 표적-인 덱스 서열들을 형성하고, 각각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘플과 고유하게 연관되고, 표적-인 덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링되고, 표적 서열들은 서열분석 런의 표적 서열분석 사 이클들 동안 서열분석되고 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석되며, 명령 어들은, 프로세서 상에서 실행될 때, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 표적 이미지의 세기 값들에만 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성 하는 제1 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 - 인덱스 이 미지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버전을 생성하는 제2 정규화 기능을 사용하여 인 덱스 이미지들을 사전-프로세싱하는 단계로서, 정규화된 버전을 생성하는 것은, (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터의 인덱스 이미지들의 세기 값들에 기초하는, 상기 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계; 및 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복 수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 포함하는 방법을 구현하는, 비일시적 컴퓨터 판 독가능 저장 매체. 46. 항목 45에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 47. 표적 서열들 및 인덱스 서열들을 염기 호출하기 위해 컴퓨터 프로그램 명령어들이 저장되는 비일시적 컴퓨 터 판독가능 저장 매체로서, 표적 서열들은 복수의 샘플들로부터 도출되고 인덱스 서열들에 커플링되어 표적-인 덱스 서열들을 형성하고, 각각의 인덱스 서열은 복수의 샘플들 중의 각자의 샘플과 고유하게 연관되고, 표적-인 덱스 서열들은 서열분석 런 동안 서열분석하기 위해 풀링되고, 표적 서열들은 서열분석 런의 표적 서열분석 사 이클들 동안 서열분석되고 인덱스 서열들은 서열분석 런의 인덱스 서열분석 사이클들 동안 서열분석되며, 명령 어들은, 프로세서 상에서 실행될 때, 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단계 - 인덱스 이 미지들은 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버 전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계; 및 표적 서열에 커플링된 인덱스 서열의 대응하는 인덱스 판독물에 기초하여 표적 서열의 각각의 표적 판독물을 복 수의 샘플들 중의 특정 샘플에 속하는 것으로 분류하는 단계를 포함하는 방법을 구현하는, 비일시적 컴퓨터 판 독가능 저장 매체. 48. 항목 47에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 49. 서열들을 염기 호출하기 위해 컴퓨터 프로그램 명령어들이 저장되는 비일시적 컴퓨터 판독가능 저장 매체 로서, 명령어들은, 프로세서 상에서 실행될 때, 서열분석 런의 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표 적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 표적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, (ii) 하나 이상의 후행 표 적 서열분석 사이클들로부터의 표적 이미지들의 세기 값들, 및 (iii) 현재 표적 서열분석 사이클로부터의 표적 이미지들의 세기 값들에 기초하여 현재 표적 서열분석 사이클로부터 표적 이미지의 정규화된 버전을 생성하는 정규화 기능을 사용하여 표적 이미지들을 사전-프로세싱하는 단계; 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단 계 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사함 -; (i) 하나 이상의 선행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, (ii) 하나 이상의 후행 인덱스 서열분석 사이클들로부터의 인덱스 이미지들의 세기 값들, 및 (iii) 현재 인덱스 서열분석 사이클로부터 의 인덱스 이미지들의 세기 값들에 기초하여 현재 인덱스 서열분석 사이클로부터 인덱스 이미지의 정규화된 버 전을 생성하는 정규화 기능을 사용하여 인덱스 이미지들을 사전-프로세싱하는 단계; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들의 정규화된 버전들을 프로세싱하고, 표적 서열분석 사이 클들 각각 동안 염기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들의 정규화된 버전들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계 를 포함하는 방법을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 50. 항목 49에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 51. 서열들을 염기 호출하기 위해 컴퓨터 프로그램 명령어들이 저장되는 비일시적 컴퓨터 판독가능 저장 매체 로서, 명령어들은, 프로세서 상에서 실행될 때, 서열분석 런의 표적 서열분석 사이클들 동안 표적 서열들에 대해 생성된 표적 이미지들에 액세스하는 단계 - 표 적 이미지들은 표적 서열들 내의 뉴클레오티드 혼입의 결과로서 생성된 세기 방출물들을 묘사함 -; 서열분석 런의 인덱스 서열분석 사이클들 동안 인덱스 서열들에 대해 생성된 인덱스 이미지들에 액세스하는 단 계 - 인덱스 이미지들은 서열분석 런 동안의 인덱스 서열들 내의 뉴클레오티드 혼입의 결과로서 생성되는 세기 방출물들을 묘사함 -; 신경 네트워크 기반 염기 호출자를 통해 표적 이미지들을 프로세싱하고, 표적 서열분석 사이클들 각각 동안 염 기 호출을 생성하여, 이에 의해, 표적 서열들에 대한 표적 판독물들을 생성하는 단계; 및 신경 네트워크 기반 염기 호출자를 통해 인덱스 이미지들을 프로세싱하고, 인덱스 서열분석 사이클들 각각 동안 염기 호출을 생성하여, 이에 의해, 인덱스 서열들에 대한 인덱스 판독물들을 생성하는 단계를 포함하는 방법을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체. 52. 항목 51에 있어서, 항목 1, 항목 16, 항목 17, 항목 20, 및 항목 27에 궁극적으로 의존하는 항목들 각각을 구현하는, 비일시적 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2022-7029020", "section": "도면", "subsection": "도면설명", "item": 1, "content": "특허 또는 출원 파일은 컬러로 작성된 적어도 하나의 도면을 포함한다. 컬러 도면(들)을 갖는 이러한 특허 또 는 특허 출원 공보의 사본들은 요청 및 필요한 요금의 지불 시에 청(Office)에 의해 제공될 것이다. 컬러 도면 은, 또한, Supplemental Content 탭을 통해 PAIR에서 입수가능할 수 있다. 도면에서, 유사한 도면 부호는, 대체로, 상이한 도면들 전체에 걸쳐서 유사한 부분들을 지칭한다. 또한, 도면은 반드시 축척대로인 것은 아니며, 그 대신, 대체적으로, 개시된 기술의 원리들을 예시할 시에 강조된다. 하 기의 설명에서, 개시된 기술의 다양한 구현예들이 하기의 도면을 참조하여 기술된다. 도 1은 인덱싱된 라이브러리들로부터의 폴리뉴클레오티드들의 서열분석의 하나의 구현예를 도시한다. 도 2는 표적 서열을 서열분석하여 표적 판독물을 생성하고 인덱스 서열을 서열분석하여 인덱스 판독물을 생성하 는 하나의 구현예를 도시한다. 도 3은 인덱스 이미지들을 정규화하는 하나의 구현예를 도시한다. 도 4는 염기 호출을 위해 신경 네트워크 기반 염기 호출자를 통해 정규화된 인덱스 이미지들을 프로세싱하는 하 나의 구현예를 도시한다. 도 5는 인덱스 이미지들의 정규화를 현재가 아닌 인덱스 서열분석 사이클들로 확장시키는 하나의 구현예를 도시 한다. 도 6은 검출가능 신호 상태의 하나 이상의 뉴클레오티드들을 묘사하는 적어도 하나의 인덱스 이미지를 사용하여 인덱스 이미지들을 정규화하는 하나의 구현예를 도시한다. 도 7은 표적 서열들 및 인덱스 서열들을 염기 호출하는 하나의 구현예를 도시한다. 도 8은 증강을 사용하는 사전-프로세싱의 하나의 구현예를 도시한다. 도 9 및 도 10은 제1 표적 판독물(판독물 1)의 2개의 표적 서열분석 사이클들(사이클들 1 및 151)의 적색 및 녹 색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 11, 도 12, 도 13, 도 14, 도 15, 도 16, 도 17 및 도 18은 제1 인덱스 판독물(인덱스 판독물 1)의 8개의 인덱스 서열분석 사이클들(사이클들 152, 153, 154, 155, 156, 157, 158, 및 159)의 적색 및 녹색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 19, 도 20, 도 21, 도 22, 도 23, 도 24, 도 25 및 도 26은 제2 인덱스 판독물(인덱스 판독물 2)의 8개의 인덱스 서열분석 사이클들(사이클들 160, 161, 162, 163, 164, 165, 166, 및 167)의 적색 및 녹색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 27 및 도 28은 제2 표적 판독물(판독물 2)의 2개의 표적 서열분석 사이클들(사이클들 168 및 169)의 적색 및 녹색 이미지들의 픽셀 세기 히스토그램들을 도시한다. 도 29는 4개의 샘플들을 멀티플렉싱하기 위해 4개의 인덱스 서열들을 사용하는 서열분석 런의 경우, 인덱스 이 미지들이 정규화되지 않을 때 신경 네트워크 기반 염기 호출자의 인덱스 염기 호출 성능이 떨어진다는 것을 도 시한다. 도 30은 2개의 샘플들을 멀티플렉싱하기 위해 2개의 인덱스 서열들을 사용하는 서열분석 런의 경우, 인덱스 이 미지들이 정규화되지 않을 때 신경 네트워크 기반 염기 호출자의 인덱스 염기 호출 성능이 떨어진다는 것을 도 시한다. 도 31은 단일 샘플을 서열분석하기 위해 단일 인덱스 서열을 사용하는 서열분석 런의 경우, 인덱스 이미지들이 정규화되지 않을 때 신경 네트워크 기반 염기 호출자의 인덱스 염기 호출 성능이 떨어진다는 것을 도시한다. 도 32는 개시된 기술을 구현하는데 사용될 수 있는 컴퓨터 시스템이다. 도 33은 표적 서열들 및 인덱스 서열들을 염기 호출하는 다른 구현예를 도시한다. 도 34는 서열분석 런의 인덱스 서열분석 사이클들에서 분석물들을 염기 호출하는 인공 지능 기반 방법의 흐름도 의 하나의 구현예이다. 도 35는 표적 서열들 및 인덱스 서열들을 염기 호출하는 인공 지능 기반 방법의 흐름도의 하나의 구현예이다."}
