{"patent_id": "10-2018-0156302", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0069124", "출원번호": "10-2018-0156302", "발명의 명칭": "특허정보의 확인 및 가치 평가 시스템 및 방법", "출원인": "(주)엠로보", "발명자": "안상선"}}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "금융감독원 사이트의 기업공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의진위를 확인하는 특허정보 확인부; 및진위가 확인된 상기 대상특허정보에 대한 가치평가정보를 생성하는 가치평가 정보 생성부를 포함하는 것을 특징으로 하는 특허 정보의 확인 및 가치평가 시스템."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 특허정보 확인부는,상기 금융감독원의 상기 기업공시정보에 대한 데이터를 크롤링하는 데이터 크롤링 모듈; 및상기 크롤링된 기업공시정보와 상기 키프리스 특허정보의 매칭을 통해서 상기 대상특허정보의 진위를 크로스채킹하는 크로스채킹 모듈을 포함하는 것을 특징으로 하는 특허 정보의 확인 및 가치평가 시스템."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 크로스채킹 모듈은,상기 대상특허정보에 대한 특허명칭, 특허권자, 특허 내용의 주요 키워드 중 어느 하나 이상에 대한 크로스채킹을 수행하는 것을 특징으로 하는 특허 정보의 확인 및 가치평가 시스템."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 크로스채킹 모듈은,머신러닝 또는 딥러닝을 수행하는 인공지능 로봇을 이용해 상기 크롤링딘 기업공시정보와 상기 키프리스 특허정보를 매칭시키는 것을 특징으로 하는 특허 정보의 확인 및 가치평가 시스템."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 가치평가정보 생성부는,상기 대상특허정보에 대응하는 증권거래소 사이트의 주가변화정보를 매칭하여 상기 대상특허정보에 대한 상기가치평가정보를 생성하는 것을 특징으로 하는 특허 정보의 확인 및 가치평가 시스템."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 가치평가정보 생성부는,상기 기업공시정보의 발표일자, 발표시간과 상기 주가변화정보의 주가 변동율을 비교하여 상기 가치평가정보를생성하는 것을 특징으로 하는 특허 정보의 확인 및 가치평가 시스템."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "금융감독원 사이트의 기업공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의공개특허 10-2020-0069124-3-진위를 확인하는 단계; 및진위가 확인된 상기 대상특허정보에 대한 가치평가정보를 생성하는 단계를 포함하는 것을 특징으로 하는 특허정보의 확인 및 가치 평가방법."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 대상특허정보의 진위를 확인하는 단계는,상기 금융감독원의 상기 기업공시정보에 대한 데이터를 크롤링하는 단계; 및상기 크롤링된 기업공시정보와 상기 키프리스 특허정보의 매칭을 통해서 상기 대상특허정보의 진위를 크로스채킹하는 단계를 포함하는 것을 특징으로 하는 특허 정보의 확인 및 가치 평가방법."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 대상특허정보의 진위를 크로스채킹하는 단계는,상기 대상특허정보에 대한 특허명칭, 특허권자, 특허 내용의 주요 키워드 중 어느 하나 이상에 대한 크로스채킹을 수행하는 것을 특징으로 하는 특허 정보의 확인 및 가치 평가방법."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서,상기 대상특허정보의 진위를 크로스채킹하는 단계는,머신러닝 또는 딥러닝을 수행하는 인공지능 로봇을 이용해 상기 크롤링된 기업공시정보와 상기 키프리스 특허정보를 매칭시키는 것을 특징으로 하는 특허 정보의 확인 및 가치 평가방법."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 7에 있어서,상기 대상특허정보에 대한 상기 가치평가정보를 생성하는 단계는,상기 대상특허정보에 대응하는 증권거래소 사이트의 주가변화정보를 매칭하여 상기 대상특허정보에 대한 상기가치평가정보를 생성하는 것을 특징으로 하는 특허 정보의 확인 및 가치 평가방법."}
{"patent_id": "10-2018-0156302", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 주가변화정보를 비교하여 상기 가치평가정보를 생성하는 단계는,상기 기업공시정보의 발표일자, 발표시간과 상기 주가변화정보의 주가 변동율을 비교하여 상기 가치평가정보를생성하는 것을 특징으로 하는 특허 정보의 확인 및 가치 평가방법."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 특허정보의 확인 및 가치 평가 시스템은 금융감독원 사이트의 기업공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의 진위를 확인하는 특허정보 확인부; 및 진위가 확인된 상 기 대상특허정보에 대한 가치평가정보를 생성하는 가치평가 정보 생성부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 기업이 가진 특허에 대한 가치 평가 기술에 관한 것으로, 특허 정보의 시장 가치를 객관적으로 평가 할 수 있는 특허 정보의 확인 및 가치 평가 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 특허나 실용신안과 같은 지적 재산의 기술적 가치를 평가할 때, 특허 정보 조사 서비스를 제공하는 기관이나 기술평가를 업으로 하는 전문가에게 의뢰하여 해당 지적 재산의 가치가 얼마이고, 관련 분야에서 어느 정도의 위치에 서는지 확인하곤 한다. 그러나, 상술한 바와 같이 기관이나 개인이 지적 재산의 가치를 조사하는 경우 조사에 따른 많은 시간이 요구되 고, 동시에 조사를 수행한 사람의 개인적인 주관이 개입될 가능성이 높아서 기술 가치를 평가받은 후에도 이를 확실하게 입증하기가 다소 곤란한 경우가 발생할 수 있다. 한편, 다른 국가와 마찬가지로 우리나라의 특허 제도 또한 지적 재산의 소유자로 하여금 권리의 유지에 따른 비 용을 받고 있어서, 상기 지적 재산의 소유자는 본인의 지적 재산이 이러한 금전적 부담을 지속적으로 감내해야 할 만큼의 가치 또는 그 이상의 가치가 있는지 객관적인 관점에서 기술의 가치를 입증하려는 경우가 많다. 이러한 요구에 따라 최근에는 지적 재산의 기술적 가치에 대한 평가를 수행하는 시스템이 개발되었고, 상기 시 스템을 보급화하려는 움직임이 지속되는 중인데, 평가 시스템을 이용하는데 따르는 시간적 절약에 있어서는 다 소 효과가 있으나 아직까지는 기술 평가의 객관적인 정보의 신뢰성이 떨어지는 문제점이 있다. 즉, 특허 정보는 기업의 미래가치를 변화시키는 요인 중에 하나로, 기업의 대표자, 주주, 투자자, 채권자, 고객, 거래처 등 많은 이해 관계자들의 주요 관심사 중에 하나이다. 하지만 기업이 보유한 특허에 대한 정보는 금융감독원 기업공시(Corporate disclosure) 외에 확인이 어려우며, 특허 내용에 대한 사실여부를 확인하기도 어려움이 있다. 또한, 이러한 특허 정보에 대한 객관적인 기술평가정보를 확보하기도 어렵다. 예를 들어, 특허의 가치에 대한 객관적인 평가가 어렵기 때문에 과대평가의 대상이 되기 쉽고, 특히, 바이오 제약 IT업종이나 비상장 기업은 특허의 과장 광고우려가 있어서, 신뢰성이 있다고 보기 어렵다."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 대상특허정보에 대한 신뢰성 있는 가치평가정보를 생성할 수 있도록 하는 특 허 정보의 확인 및 가치 평가 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 과제를 해결하기 위한 본 발명에 따른 특허정보의 확인 및 가치 평가 시스템은 금융감독원 사이트의 기 업공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의 진위를 확인하는 특허정 보 확인부; 및 진위가 확인된 상기 대상특허정보에 대한 가치평가정보를 생성하는 가치평가 정보 생성부를 포함 하는 것을 특징으로 한다. 상기 특허정보 확인부는, 상기 금융감독원 기업공시정보에 대한 데이터를 크롤링하는 데이터 크롤링 모듈; 및 상기 크롤링딘 기업공시정보와 상기 키프리스 특허정보의 매칭을 통해서 상기 대상특허정보의 진위를 크로스채 킹하는 크로스채킹 모듈을 포함하는 것을 특징으로 한다. 상기 크로스채킹 모듈은, 상기 대상특허정보에 대한 특허명칭, 특허권자, 특허 내용의 주요 키워드 중 어느 하 나 이상에 대한 크로스채킹을 수행하는 것을 특징으로 한다. 상기 크로스채킹 모듈은, 인공지능의 머신러닝 또는 딥러닝을 이용해 상기 크롤링딘 기업공시정보와 상기 키프 리스 특허정보를 매칭시키는 것을 특징으로 한다. 상기 가치평가정보 생성부는, 상기 대상특허정보에 대응하는 증권거래소 사이트의 주가변화정보를 매칭하여 상 기 대상특허정보에 대한 상기 가치평가정보를 생성하는 것을 특징으로 한다. 상기 가치평가정보 생성부는, 상기 기업공시정보의 발표일자, 발표시간과 상기 주가변화정보의 주가 변동율을 비교하여 상기 가치평가정보를 생성하는 것을 특징으로 한다. 상기의 과제를 해결하기 위한 본 발명에 따른 특허정보의 확인 및 가치 평가 방법은, 금융감독원 사이트의 기업 공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의 진위를 확인하는 단계; 및 진위가 확인된 상기 대상특허정보에 대한 가치평가정보를 생성하는 단계를 포함하는 것을 특징으로 한다.상기 대상특허정보의 진위를 확인하는 단계는, 상기 금융감독원 기업공시정보에 대한 데이터를 크롤링하는 단계; 및 상기 크롤링딘 기업공시정보와 상기 키프리스 특허정보의 매칭을 통해서 상기 대상특허정보의 진위를 크로스채킹하는 단계를 포함하는 것을 특징으로 한다. 상기 대상특허정보의 진위를 크로스채킹하는 단계는, 상기 대상특허정보에 대한 특허명칭, 특허권자, 특허 내용 의 주요 키워드 중 어느 하나 이상에 대한 크로스채킹을 수행하는 것을 특징으로 한다. 상기 대상특허정보의 진위를 크로스채킹하는 단계는, 인공지능의 머신러닝 또는 딥러닝을 이용해 상기 크롤링딘 기업공시정보와 상기 키프리스 특허정보를 매칭시키는 것을 특징으로 한다. 상기 대상특허정보에 대한 상기 가치평가정보를 생성하는 단계는, 상기 대상특허정보에 대응하는 증권거래소 사 이트의 주가변화정보를 매칭하여 상기 대상특허정보에 대한 상기 가치평가정보를 생성하는 것을 특징으로 한다. 상기 주가변화정보를 비교하여 상기 가치평가정보를 생성하는 단계는, 상기 기업공시정보의 발표일자, 발표시간 과 상기 주가변화정보의 주가 변동율을 비교하여 상기 가치평가정보를 생성하는 것을 특징으로 한다."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 기업공시정보와 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의 진위를 확인한 후에, 상기 대상특허정보에 대한 가치평가정보를 생성함으로써, 특허 정보의 존재 여부에 따른 신뢰성 확보뿐만 아니 라, 이러한 특허 정보가 시장에서 어느 정도의 가치로 인정받고 있는지를 명확히 판단할 수 있도록 한다."}
{"patent_id": "10-2018-0156302", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예들은 당해 기술 분야에서 통상의 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위하 여 제공되는 것이며, 아래의 실시예들은 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 아래의 실 시예들로 한정되는 것은 아니다. 오히려, 이들 실시예는 본 개시를 더욱 충실하고 완전하게 하며 당업자에게 본 발명의 사상을 완전하게 전달하기 위하여 제공되는 것이다. 본 명세서에서 사용된 용어는 특정 실시예를 설명하기 위하여 사용되며, 본 발명을 제한하기 위한 것이 아니다. 본 명세서에서 사용된 바와 같이 단수 형태는 문맥상 다른 경우를 분명히 지적하는 것이 아니라면, 복수의 형태 를 포함할 수 있다. 또한, 본 명세서에서 사용되는 경우 \"포함한다(comprise)\" 및/또는\"포함하는(comprising)\" 은 언급한 형상들, 숫자, 단계, 동작, 부재, 요소 및/또는 이들 그룹의 존재를 특정하는 것이며, 하나 이상의 다른 형상, 숫자, 동작, 부재, 요소 및/또는 그룹들의 존재 또는 부가를 배제하는 것이 아니다. 본 명세서에서 사용된 바와 같이, 용어 \"및/또는\"은 해당 열거된 항목 중 어느 하나 및 하나 이상의 모든 조합을 포함한다. 이하, 본 발명의 실시예들은 본 발명의 실시예들을 개략적으로 도시하는 도면들을 참조하여 설명한다. 도 1은 본 발명에 따른 특허정보의 확인 및 가치 평가 시스템을 설명하기 위한 일 실시예의 시스템 블록도이다. 도 1을 참조하면, 특허정보의 확인 및 가치 평가 시스템은 특허정보 확인부 및 가치평가정보 생성부 를 포함한다.특허정보 확인부는 금융감독원 사이트의 기업공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검 색하여 대상특허정보의 진위를 확인한다. 특허정보 확인부는 금융감독원 기업공시의 특허권 관련 공시를 데이터 크롤링 한뒤에 키프리스(KIPRIS) 특허정보와 데이터 메칭을 통해 관련 내용을 크로스채크(Cross Check)를 수행한다. 도 2는 도 1에 도시된 특허정보 확인부의 세부 구성요소를 설명하기 위한 일 실시예의 구성 블록도이다. 또한, 도 3은 도 2에 도시된 특허정보 확인부의 동작 수행과정을 설명하기 위한 예시적인 참조도이다. 도 2를 참조하면, 특허정보 확인부는 데이터 크롤링모듈 및 크로스채킹 모듈을 포함한다. 도 3을 참조하면, 데이터 크롤링모듈은 금융감독원 기업공시정보에 대한 데이터를 크롤링한다. 크롤링은 무수히 많은 컴퓨터에 분산 저장되어 있는 문서를 수집하여 검색 대상의 색인으로 포함시키는 기술을 말한다. 데이터 크롤링모듈은 웹 상에서 금융감독원 기업공시정보에 대한 데이터를 자동으로 검색하고 색인하기 위 해 사용한다. 사용자가 일일이 해당 사이트의 정보를 검색하는 것이 아니라, 데이터 크롤링모듈이 미리 입 력된 방식에 따라 끊임없이 새로운 웹 페이지를 찾아 종합하고, 찾은 결과를 이용해 또 새로운 정보를 찾아 색 인을 추가하는 작업을 반복 수행한다. 크로스채킹 모듈은 크롤링된 기업공시정보와 키프리스 특허정보의 매칭을 통해서 상기 대상특허정보의 진 위를 크로스채킹한다. 크로스채킹 모듈은, 상기 대상특허정보에 대한 특허명칭, 특허권자, 특허 내용의 주 요 키워드 중 어느 하나 이상에 대한 크로스채킹을 수행한다. 크로스채킹 모듈은, 머신러닝 또는 딥러닝을 수행하는 인공지능 로봇을 이용해 상기 크롤링된 기업공시정 보와 상기 키프리스 특허정보를 매칭시킨다. 머신 러닝(기계 학습)은 인공지능의 한 분야로, 패턴인식과 컴퓨터 학습 이론을 이용한 분석기술이다. 머신 러닝은 경험적 데이터를 기반으로 학습을 하고 예측을 수행하고 스스로 의 성능을 향상시키는 기술이다. 머신 러닝의 알고리즘은 엄격하게 정해진 정적인 프로그램 명령들을 수행하는 것이라기보다, 입력 데이터를 기반으로 예측이나 결정을 이끌어내기 위해 특정한 모델을 구축하는 방식을 취한 다. 이에 비해, 딥러닝은 다층구조 형태의 신경망을 기반으로 하는 머신 러닝의 한 분야로, 다량의 데이터로부 터 높은 수준의 추상화 모델을 구축하고자 하는 기법이다. 데이터를 컴퓨터가 처리 가능한 형태인 벡터나 그래 프 등으로 표현하고 이를 학습하는 모델을 구축하는 방식을 포함한다. 크로스채킹 모듈의 인공지능 로봇은 이러한 머신러닝 또는 딥러닝 알고리즘을 수행에 따른 반복적인 학습 을 통해서 크롤링된 기업공시정보와 상기 키프리스 특허정보를 매칭시켜서, 대상특허정보의 진위 여부를 확인할 수 있다. 가치평가정보 생성부는 진위가 확인된 상기 대상특허정보에 대한 가치평가정보를 생성한다. 도 4는 도 2에 도시된 가치평가정보 생성부의 동작 수행과정을 설명하기 위한 예시적인 참조도이다. 도 4를 참조하면, 가치평가정보 생성부는 상기 대상특허정보에 대응하는 증권거래소 사이트의 주가변화정 보를 매칭하여 상기 대상특허정보에 대한 상기 가치평가정보를 생성한다. 가치평가정보 생성부는 상기 기업공시정보의 발표일자, 발표시간과 상기 주가변화정보의 주가 변동율을 비교하여 상기 가치평가정보를 생성한다. 가치평가정보 생성부는 기업이 보유한 특허에 대한 시장평가로 해당 기업의 특허 발표 후 주가 변화 데이 터를 분석하며, 단계별로 키프리스의 특허와 금융감독원의 기업공시(특허공시)를 매칭한 뒤에, 해당 기업공시 발표일자, 시간 자료를 추출해서 거래소의 주가 데이터와 매칭시킨다. 본원발명과 종래의 특허 정보를 검색하는 기술을 비교하면 다음과 같다. 도 5는 종래의 특허 정보 QR 서비스를 설명하기 위한 참조도이고, 도 6은 종래의 특허 관련 공공데이터(예를 들 어, e-나라지표) 서비스를 설명하기 위한 참조도이다. 도 5를 참조하면, 종래의 특허 정보 QR서비스는 특허를 QR코드로 가려내는 서비스로 사용자가 별도의 조회절차 없이 QR코드를 사용해 키프리스에서 진위 여부를 확인 가능하다. 사용자가 직접 확인해야하는 절차가 있으며,QR코드를 부여하기 어려운 소프트웨어, 서비스에 대해서는 확인이 어렵다. 도 6을 참조하면, 종래의 특허 관련 공공데이터(예를 들어, e-나라지표)의 경우에는 특허 등록 건수, 출원건수 위주로 각 특허의 세부 내용(업종별 특허 등록 및 추이 등) 확인에 한계가 있으며, 특허 건수 외에 다른 데이 터를 얻기 어렵다. 이에 비해, 본원발명의 경우에는 인공지능을 탑재한 로봇 저널리즘을 이용한 특허 정보의 크로스 체킹을 수행함 으로써, 사용자가 직접 확인할 필요 없이, 특허 정보의 진위 여부를 명확히 확인할 수 있고, 이러한 특허정보에 대해 시장에서의 객관적인 특허가치 평가정보를 획득할 수 있어서, 투자의사결정에 도움이 되는 데이터를 제공 하며 산업별 비교를 통해 높은 가치를 인정받는 정보를 제공할 수 있다. 도 7은 본 발명에 따른 특허정보의 확인 및 가치 평가 방법을 설명하기 위한 일 실시예의 플로차트이다. 금융감독원 사이트의 기업공시정보와 특허청 사이트의 키프리스(KIPRIS) 특허정보를 검색하여 대상특허정보의 진위를 확인한다(S300 단계). 도 8은 도 7에 도시된 대상특허정보의 진위를 확인하는 단계를 설명하기 위한 일 실시예의 플로차트이다. 먼저, 상기 금융감독원 기업공시정보에 대한 데이터를 크롤링한다(S400 단계). 시스템은 웹 상에서 금융감독원 기업공시정보에 대한 데이터를 자동으로 검색하고 색인한다. 시스템은 미리 입력된 방식에 따라 끊임없이 새로 운 웹 페이지를 찾아 종합하고, 찾은 결과를 이용해 또 새로운 정보를 찾아 색인을 추가하는 작업을 반복 수행 한다. S400 단계 후에, 상기 크롤링된 기업공시정보와 상기 키프리스 특허정보의 매칭을 통해서 상기 대상특허정보의 진위를 크로스채킹한다(S402 단계). 상기 대상특허정보의 진위를 크로스채킹하는 단계는, 상기 대상특허정보에 대한 특허명칭, 특허권자, 특허 내용의 주요 키워드 중 어느 하나 이상에 대한 크로스채킹을 수행한다. 상기 대 상특허정보의 진위를 크로스채킹하는 단계는, 머신러닝 또는 딥러닝을 수행하는 인공지능로봇을 이용해 상기 크 롤링딘 기업공시정보와 상기 키프리스 특허정보를 매칭시킨다. S300 단계 후에, 진위가 확인된 상기 대상특허정보에 대한 가치평가정보를 생성한다(S302 단계). 상기 대상특허 정보에 대한 상기 가치평가정보를 생성하는 단계는, 상기 대상특허정보에 대응하는 증권거래소 사이트의 주가변 화정보를 매칭하여 상기 대상특허정보에 대한 상기 가치평가정보를 생성한다. 상기 주가변화정보를 비교하여 상기 가치평가정보를 생성하는 단계는, 상기 기업공시정보의 발표일자, 발표시간 과 상기 주가변화정보의 주가 변동율을 비교하여 상기 가치평가정보를 생성한다. 본 발명은 소프트웨어적인 프로그램으로 구현하여 컴퓨터로 읽을 수 있는 소정 기록매체에 기록해 둘 수 있다. 예컨대, 기록매체는 각 재생장치의 내장형으로 하드디스크, 플래시 메모리, RAM, ROM 등이거나, 외장형으로 CD- R, CD-RW와 같은 광디스크, 콤팩트 플래시 카드, 스마트 미디어, 메모리 스틱, 멀티미디어 카드일 수 있다. 이상과 같이 본 발명의 실시예를 설명하였으나, 본 발명의 명세서에 개시된 실시예들은 본 발명을 한정하는 것 이 아니다. 본 발명의 범위는 아래의 특허청구범위에 의해 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술도 본 발명의 범위에 포함되는 것으로 해석해야 할 것이다."}
{"patent_id": "10-2018-0156302", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 특허정보의 확인 및 가치 평가 시스템을 설명하기 위한 일 실시예의 시스템 블록도이다. 도 2는 도 1에 도시된 특허정보 확인부의 세부 구성요소를 설명하기 위한 일 실시예의 구성 블록도이다. 도 3은 도 2에 도시된 특허정보 확인부의 동작 수행과정을 설명하기 위한 예시적인 참조도이다. 도 4는 도 2에 도시된 가치평가정보 생성부의 동작 수행과정을 설명하기 위한 예시적인 참조도이다. 도 5는 종래의 특허 정보 QR 서비스를 설명하기 위한 참조도이다. 도 6은 종래의 특허 관련 공공데이터(예를 들어, e-나라지표) 서비스를 설명하기 위한 참조도이다. 도 7은 본 발명에 따른 특허정보의 확인 및 가치 평가 방법을 설명하기 위한 일 실시예의 플로차트이다. 도 8은 도 7에 도시된 대상특허정보의 진위를 확인하는 단계를 설명하기 위한 일 실시예의 플로차트이다."}
