{"patent_id": "10-2023-0112946", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0031448", "출원번호": "10-2023-0112946", "발명의 명칭": "빔 식별자 기반의 통신 제어 장치 및 방법", "출원인": "주식회사 티제이이노베이션", "발명자": "장광재"}}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "빔 식별자 기반의 통신 제어 방법에 있어서,(a) 빔 식별자 정보 및 하향 링크 신호를 획득하는 단계;(b) 복수의 기지국 장치 중 상기 빔 식별자 정보에 대응하는 타겟 기지국 장치를 선정하는 단계; 및(c) 상기 선정된 타겟 기지국 장치로 상기 하향 링크 신호를 전송하는 단계,를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 (b) 단계는,상기 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치를 상기 타겟 기지국 장치로 선택하는것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 복수의 기지국 장치 각각에 대한 상기 빔 식별자 정보에 대한 할당 빈도에 대한 정보를 수집하는 단계; 및상기 할당 빈도에 기초하여 상기 복수의 기지국 장치 각각에 대한 트래픽 예측 정보를 생성하는 단계,를 더 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 복수의 기지국 장치는 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유닛을 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제어 방법은,상기 복수의 기지국 장치와 접속된 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치에 의해 수행되는 것을 특징으로 하는, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "빔 식별자 기반의 통신 제어 방법에 있어서,(a) 빔 식별자 정보를 획득하는 단계;(b) 복수의 기지국 장치 중 상기 빔 식별자 정보에 대응하는 타겟 기지국 장치를 선정하는 단계; 및(c) 상기 선정된 타겟 기지국 장치로부터 상향 링크 신호를 수신하는 단계,를 포함하는, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2025-0031448-3-제6항에 있어서,(d) 미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링크 신호를 다중화(Multiplexing) 하는 단계,를 더 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 (b) 단계는,상기 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치를 상기 타겟 기지국 장치로 선택하는것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 복수의 기지국 장치 각각에 대한 상기 빔 식별자 정보에 대한 할당 빈도에 대한 정보를 수집하는 단계; 및상기 할당 빈도에 기초하여 상기 복수의 기지국 장치 각각에 대한 트래픽 예측 정보를 생성하는 단계,를 더 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제6항에 있어서,상기 복수의 기지국 장치는 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유닛을 포함하는 것인, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제6항에 있어서,상기 제어 방법은,상기 복수의 기지국 장치와 접속된 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치에 의해 수행되는 것을 특징으로 하는, 제어 방법."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "빔 식별자 기반의 통신 제어 장치에 있어서,제1빔 식별자 정보 및 하향 링크 신호를 획득하고, 복수의 기지국 장치 중 상기 제1빔 식별자 정보에 대응하는제1타겟 기지국 장치로 상기 하향 링크 신호를 전송하는 다운링크 제어부; 및제2빔 식별자 정보를 획득하고, 상기 복수의 기지국 장치 중 상기 제2빔 식별자 정보에 대응하는 제2타겟 기지국 장치로부터 상향 링크 신호를 수신하는 업링크 제어부,를 포함하는, 제어 장치."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 업링크 제어부는,미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링크 신호를 다중화(Multiplexing) 하는 것인, 제어 장치."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,공개특허 10-2025-0031448-4-상기 제1타겟 기지국 장치 또는 상기 제2타겟 기지국 장치는 상기 복수의 기지국 장치 중 접속된 사용자 단말이존재하는 기지국 장치로 선정되는 것인, 제어 장치."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 복수의 기지국 장치는 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유닛을 포함하는 것인, 제어 장치."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제12항에 있어서,상기 제어 장치는,상기 복수의 기지국 장치와 접속되는 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치를 포함하는 것인,제어 장치."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 제어 장치는,제어 정보의 교환을 위한 제1기능 개체 및 상기 상향 링크 신호 및 상기 하향 링크 신호 중 적어도 하나를 전달하는 제2기능 개체를 포함하는 네트워크 제어 리피터(Network-Controlled Repeaters, NCR)를 포함하는 것인,제어 장치."}
{"patent_id": "10-2023-0112946", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15항에 있어서,상기 O-RAN 기반 유닛 각각이 유선 접속 방식을 통해 상기 제어 장치에 연결되는 것을 특징으로 하는, 제어 장치."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "빔 식별자 기반의 통신 제어 장치 및 방법이 개시되며, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방 법은, (a) 빔 식별자 정보 및 하향 링크 신호를 획득하는 단계, (b) 복수의 기지국 장치 중 상기 빔 식별자 정보 에 대응하는 타겟 기지국 장치를 선정하는 단계 및 (c) 상기 선정된 타겟 기지국 장치로 상기 하향 링크 신호를 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 빔 식별자 기반의 통신 제어 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 높은 데이터 전송률을 달성하기 위해, 5G 통신 시스템은 초고주파(mmWave) 대역, 일 예로, 60GHz 대역 등 에서의 구현이 고려되고 있다. 초고주파 대역에서의 전파의 경로손실 완화 및 전파의 전달 거리를 증가시키기 위해, 5G 통신 시스템에서는 빔포밍(Beam-forming), 거대배열 다중입출력(massive MIMO), 전차원 다중입출력 (Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 아날로그 빔형성(Analog Beam-forming), 및 대규모 안테나(Large Scale Antenna) 기술 등이 논의되고 있다. 특히, 5G 서비스에 대한 커버리지 문제가 대두되고 있으며, 과학기술정보통신부의 통신커버리지 품질평가 결과 를 살펴보면 다중이용시설, 지하철과 같은 공공 인프라 시설 및 실내에서의 커버리지는 아직 부족한 실정이다. 이와 관련하여 현재까지 FR1의 옥외/옥내 라디오 유닛(Radio Unit)은 모두 기존 3G나 4G에서와 같이 빔포밍 기 능을 활용하지 않고, 빔ID를 0으로 설정(beamId=0)하여 사용하고 있는데, 이러한 빔 식별자 정보를 활용하여 공 유셀에서 빔포밍 경로를 기반으로 5G 망을 구성함으로써 각 통신 유닛의 사용량을 줄이면서도 에너지 효율을 극 대화 할 수 있는 기술에 대한 개발이 요구된다. 한편, 4G 통신 시스템과 5G 통신 시스템 등이 혼용된 시스템에서 사업자들과 장비제공 업체가 모여서 설립한 O- RAN(Open Radio Access Network)은, 기존 3GPP 규격 기반으로 신규 NE(Network Element)와 인터페이스 (Interface) 규격을 정의하고, O-RAN 구조를 제시하고 있다.본원의 배경이 되는 기술은 한국등록특허공보 제10-2406456호에 개시되어 있다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 빔 식별자를 이용한 RF 페이로드 제어를 통해 전 력 소모를 줄여 에너지 효율을 향상시킬 수 있는 빔 식별자 기반의 통신 제어 장치 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은, (a) 빔 식별자 정보 및 하향 링크 신호를 획득하는 단계, (b) 복수의 기지국 장치 중 상기 빔 식별자 정보에 대응하는 타겟 기지국 장치를 선정하는 단계 및 (c) 상기 선정된 타겟 기지국 장치로 상기 하향 링크 신 호를 전송하는 단계를 포함할 수 있다. 또한, 상기 (b) 단계는, 상기 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치를 상기 타겟 기지국 장치로 선택할 수 있다. 또한, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은, 상기 복수의 기지국 장치 각각에 대한 상 기 빔 식별자 정보에 대한 할당 빈도에 대한 정보를 수집하는 단계 및 상기 할당 빈도에 기초하여 상기 복수의 기지국 장치 각각에 대한 트래픽 예측 정보를 생성하는 단계를 포함할 수 있다. 또한, 상기 복수의 기지국 장치는 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유 닛을 포함할 수 있다. 또한, 상기 제어 방법은, 상기 복수의 기지국 장치와 접속된 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치에 의해 수행될 수 있다. 한편, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은, (a) 빔 식별자 정보를 획득하는 단계, (b) 복수의 기지국 장치 중 상기 빔 식별자 정보에 대응하는 타겟 기지국 장치를 선정하는 단계 및 (c) 상기 선정된 타겟 기지국 장치로부터 상향 링크 신호를 수신하는 단계를 포함할 수 있다. 또한, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은, (d) 미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링크 신호를 다중화(Multiplexing) 하는 단계를 포함할 수 있다. 또한, 상기 (b) 단계는, 상기 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치를 상기 타겟 기지국 장치로 선택할 수 있다. 또한, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은, 상기 복수의 기지국 장치 각각에 대한 상 기 빔 식별자 정보에 대한 할당 빈도에 대한 정보를 수집하는 단계 및 상기 할당 빈도에 기초하여 상기 복수의 기지국 장치 각각에 대한 트래픽 예측 정보를 생성하는 단계를 포함할 수 있다. 한편, 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치는, 제1빔 식별자 정보 및 하향 링크 신호를 획득하고, 복수의 기지국 장치 중 상기 제1빔 식별자 정보에 대응하는 제1타겟 기지국 장치로 상기 하향 링크 신호를 전송하는 다운링크 제어부 및 제2빔 식별자 정보를 획득하고, 상기 복수의 기지국 장치 중 상기 제2빔 식별자 정보에 대응하는 제2타겟 기지국 장치로부터 상향 링크 신호를 수신하는 업링크 제어부를 포함할 수 있 다. 또한, 상기 업링크 제어부는, 미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링크 신호를 다중화 (Multiplexing) 할 수 있다. 또한, 상기 제1타겟 기지국 장치 또는 상기 제2타겟 기지국 장치는 상기 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치로 선정될 수 있다. 또한, 상기 제어 장치는, 상기 복수의 기지국 장치와 접속되는 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치를 포함할 수 있다. 또한, 상기 제어 장치는, 제어 정보의 교환을 위한 제1기능 개체 및 상기 상향 링크 신호 및 상기 하향 링크 신 호 중 적어도 하나를 전달하는 제2기능 개체를 포함하는 네트워크 제어 리피터(Network-Controlled Repeaters, NCR)를 포함할 수 있다. 또한, 상기 O-RAN 기반 유닛 각각이 유선 접속 방식을 통해 상기 제어 장치에 연결될 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 빔 식별자를 이용한 RF 페이로드 제어를 통해 전력 소모를 줄여 에너 지 효율을 향상시킬 수 있는 빔 식별자 기반의 통신 제어 장치 및 방법을 제공할 수 있다. 전술한 본원의 과제 해결 수단에 의하면, 상향 링크 신호의 잡음 최적화를 통해 통신 장비의 커버리지 축소 문 제 및 간섭 문제를 해소할 수 있다. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 본원은 빔 식별자 기반의 통신 제어 장치 및 방법에 관한 것이다. 도 1은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치를 구비하는 통신 시스템의 하향 링크 신호 전달 과정을 설명하기 위한 개념도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 통신 시스템은 예시적으로 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유닛을 포함하도록 구현될 수 있다. 보다 구체적으로, 통신 시스템은 복수 개의 개방형 무선 액세스 네트워크 기반의 유닛(예를 들면, Shared O- RU 등)이 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치를 매개로 공유 셀을 형성하는 아키텍쳐로 구 현될 수 있다. 예시적으로 하나의 프론트홀 멀티플렉서(FHM) 장치에 대하여 8개의 O-RU가 연결(접속)될 수 있고, 복수의 프론 트홀 멀티플렉서(FHM) 장치가 상하위 모듈로 연결되는 계층 구조로 통신 시스템이 이루어질 수 있으나, 이에 만 한정되는 것은 아니다. 다른 예로, 본원에서 개시하는 통신 시스템은 복수 개의 개방형 무선 액세스 네트워크 기반의 유닛(예를 들 면, Shared O-RU 등)이 Cascade 형태로 연결되는 구조로 구현될 수 있으며, 예시적으로 O-RU Cascade 모드의 경우 3개 이상의 O-RU를 수용하는 공유셀 기능을 지원할 수 있다. 또 다른 예로, 본원에서 개시하는 통신 시스템은 인빌딩 환경을 대상으로 하여 개방형 무선 액세스 네트워크 기반의 유닛(예를 들면, Shared O-RU 등)이 통신 시스템이 구현되는 건물 내의 하위 모듈(예를 들면, 허브 유닛(Hub Unit, HU), 서비스 유닛(Service Unit, SU) 등)와 해당 인빌딩 환경의 특성을 고려하여 유선 경로로 연결(접속)되어 빔포밍 경로가 유선 경로에 의해 논리적으로 분산(분할)되는 방식으로 동작하는 인빌딩 통신 시 스템 형태로 구현될 수도 있다. 보다 구체적으로 도 1을 참조하면, 통신 시스템은 분산 유닛(ORAN Distributed Unit; O-DU, 10), 프론트홀 멀티플렉서(FHM) 장치 및 라디오 유닛(ORAN Radio Unit, O-RU, 30) 중 적어도 하나를 포함하도록 구현될 수 있다. 참고로, 본원의 실시예에 관한 설명에서 빔 식별자 기반의 통신 제어 장치(이하, '통신 제어 장치'라 한다.)는 통신 시스템의 구현예에 따라 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유닛으로서 전술한 O-DU, O-RU 등의 디바이스와 FHM 장치와 동일한 디바이스를 지칭하는 것 이거나, 각 디바이스(달리 말해, O-DU, FHM 장치, O-RU 등)에 탑재되는 하위 모듈로서 구현될 수 있다. 한편, 본원에서 개시하는 통신 제어 장치, 사용자 단말, O-DU, FHM 장치 및 O-RU 상호 간은 네트워크(미도시)를 통해 통신할 수 있다. 네트워크(미도시)는 단말들 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이러한 네트워크(미도시)의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 사용자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다.이하에서는 도 1을 참조하여 통신 제어 장치에 의해 제어되는 통신 시스템에서의 하향 링크 신호 전달 과정을 설명하도록 한다. 도 1을 참조하면, 통신 제어 장치는 공유셀 환경에서 동일 셀(Cell)의 O-RU에 대하여 동일한 빔 식별 정보 (beamId)가 할당될 수 없는 특성을 이용하여 RF 페이로드를 제어함으로써, 빔 식별 정보가 할당된 사업자 주파 수에 대응하는 하향 링크 신호만 RF 출력을 송출하여 통신 시스템의 에너지를 절감할 수 있다. 구체적으로 하향 링크 신호의 전송을 위하여 통신 제어 장치는 빔 식별자 정보 및 하향 링크 신호를 획득 할 수 있다. 예시적으로 FHM 장치에 대하여 구비되는 통신 제어 장치는 O-DU로부터 O-RU 측으 로 송신할 하향 링크 신호 및 해당 하향 링크 신호가 도달하는 사용자 단말을 특정하기 위한 빔 식별자 정 보(beamId)를 수신할 수 있다. 또한, 통신 제어 장치는 접속(연동)된 복수의 기지국 장치(예를 들면, 복수의 O-RU 등) 중 획득한 빔 식별자 정보(beamId)에 대응하는 타겟 기지국 장치를 선정하고, 선정된 타겟 기지국 장치로 하향 링크 신호를 선택적으로 전송함으로써, 각각의 기지국 장치 간의 중첩(간섭)을 방지하고, 하향 링크 신호의 전송을 위하여 필요한 에너지(전력)를 절감할 수 있다. 구체적으로 타겟 기지국 장치는 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치로 선 택될 수 있으며, 예를 들어 사용자 단말은 전원이 켜지거나 새로이 셀(cell)에 접속하고자 하는 경우 SSB 정보를 이용하여 기지국 장치와 하향링크신호 및 상향링크신호의 전송을 정확한 시점에 수행하는 데 필요한 시간 및 주파수 파라미터 등을 결정하여 동기화할 수 있으며, 이때, 접속된 사용자 단말에 대응하는 빔 식 별자 정보에 따라 해당 사용자 단말과 연계된 기지국 장치가 타겟 기지국 장치로 특정될 수 있고, 이 에 따라 통신 제어 장치는 타겟 기지국 장치에만 선택적으로 하향 링크 신호가 송신되도록 할 수 있다. 한편, O-RU에서 소모되는 전력 소모량의 대부분은 하향 링크 신호의 송신을 위한 대출력 증폭기에 의해 이 루어지며, 이러한 특성을 고려할 때 본원에서 개시하는 통신 제어 장치에 의하면, 빔 식별자 정보가 할당 되지 않은 시간에 RF 출력을 차단할 수 있어 O-RU 측에서의 에너지 소모량을 획기적으로 절감할 수 있다. 이하에서는 도 2를 참조하여 통신 제어 장치에 의해 제어되는 통신 시스템에서의 상향 링크 신호 전달 과정을 설명하도록 한다. 도 2는 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치를 구비하는 통신 시스템의 상향 링크 신호 전달 과정을 설명하기 위한 개념도이다. 도 2를 참조하면, 통신 제어 장치는 공유셀 환경에서 동일 셀(Cell)의 O-RU에 대하여 동일한 빔 식별 정보 (beamId)가 할당될 수 없는 특성을 이용하여 RF 페이로드를 제어함으로써, 빔 식별 정보가 할당된 사업자 주파 수에 대응하는 상향 링크 신호만 송출하여 상향 링크 신호의 노이즈를 억제할 수 있다. 통신 제어 장치는 빔 식별자 정보를 획득하고, 복수의 기지국 장치 중 획득한 빔 식별자 정보에 대응하는 타겟 기지국 장치를 선정할 수 있다. 또한, 통신 제어 장치는 빔 식별자 정보를 이용하여 선정된 타겟 기지국 장치로부터 상향 링크 신호를 선 택적으로 수신할 수 있다. 또한, 통신 제어 장치는 미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링크 신호를 다중화 (Multiplexing)할 수 있다(도 2의 'UL Muxing'). 또한, 본원의 일 실시예에 따르면, 복수의 기지국 장치는 개방형 무선 액세스 네트워크(Open Radio Access Network, O-RAN) 기반의 유닛(예를 들면, O-RU 등)을 포함할 수 있으며, 통신 제어 장치는 복수의 기 지국 장치와 접속된 프론트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치와 동일한 디바이스이거나 프론 트홀 멀티플렉서(Fronthaul Multiplexer, FHM) 장치의 하위 모듈 형태로 탑재되는 것일 수 있다. 한편, 셀을 공유하는 O-RU가 많을수록 상향 링크 송신 시 역방향 노이즈가 증가할 수 있으며, 구체적으로 역방 향 노이즈는 식 1에 기초하여 연산될 수 있다. [식 1] 여기서, Noise Floor는 역방향 노이즈이고, Noise Figure는 잡음 지수이고, Ncell은 셀의 공유 O-RU의 개수를 의 미한다. 따라서, 본원에서 개시하는 통신 제어 장치에 의할 때, 빔 식별자 정보를 할당하는 타이밍 등에 따라 상향 링크 신호를 Time Multiplexing 함으로써 셀의 공유 O-RU 수와 무관하게 노이즈 성분의 상승이 유발되지 않을 수 있다. 도 3은 네트워크 제어 리피터(Network-Controlled Repeaters, NCR)를 나타낸 개념도이다. 도 3을 참조하면, 본원의 일 실시예에 따르면, 통신 제어 장치는 송수신되는 신호를 증폭하여 전송거리를 증가시키도록 통신 시스템에 구비되는 중계기 디바이스(미도시)와 동일한 디바이스를 지칭하는 것이거나, 중 계기 디바이스(미도시)에 탑재되는 하위 모듈로서 구현될 수 있다. 예시적으로 통신 제어 장치는 제어 정보의 교환을 위한 C-link를 통해 기지국(gNB)과 통신하는 기능 개체 인 NCR-MT 및 백홀 링크 및 액세스 링크를 통해 기지국(gNB)과 사용자 단말 간의 상향 링크 및 하향 링크 신호에 대응하는 RF 신호를 증폭하여 전달하는 기능 개체인 NCR-fwd를 포함하는 네트워크 제어 리피터(Network- Controlled Repeaters, NCR)에 대하여 구비되는 것일 수 있다. 달리 말해, 본원에서 개시하는 통신 제어 장치 는 적어도 하나의 기지국 장치(gNB)와 접속된 네트워크 제어 리피터(Network-Controlled Repeaters, NC R)와 동일한 디바이스이거나 네트워크 제어 리피터(NCR)의 하위 모듈 형태로 탑재되는 것일 수 있다. 도 4는 본원의 일 실시예에 따른 인빌딩 환경의 통신 시스템의 빔 식별자 정보와 O-RU의 SU 경로 매칭을 예시적 으로 나타낸 도면이다. 도 4를 참조하면, 통신 시스템이 인빌딩(In-Building) 환경에서 구현됨으로써 O-RAN 기반 유닛(예를 들면, O-RU 등) 각각이 유선 접속 방식을 통해 통신 제어 장치 내지 FHM 장치에 연결되는 것일 수 있다. 구체적으로 도 3을 참조하면, 인빌딩 환경에 배치된 O-RU의 경우, 유선 접속 방식을 통해 연결된 복수의 서 비스 유닛(SU) 각각에 대하여 개별적인 빔 식별자 정보를 할당하고, 각각의 빔 식별자 정보에 대응하는 신호 경 로를 따라 독립적으로 하향 링크 신호를 송신하도록 구비될 수 있다(Transmit only beamId designated path). 또한, 마찬가지로, 복수의 서비스 유닛(SU) 각각에 대하여 개별 할당된 빔 식별자 정보를 이용하여 각 서비스 유닛(SU)에 대응하는 타겟 공간에 위치하는 사용자 단말로부터의 상향 링크 신호가 각 서비스 유닛(SU)으 로부터 인빌딩 O-RU로 송신될 수 있으며, 인빌딩 O-RU는 빔 식별자 정보를 이용하여 SU 각각으로부터 개별적으 로 송신된 상향 링크 신호를 선택적으로 결합(예를 들면, 소정의 시간 동안 누적하여 송신된 상향 링크 신호를 취합하는 등)할 수 있다(Selective combine along beamId). 도 5는 본원의 일 실시예에 따른 인빌딩 환경의 통신 시스템에서 트래픽 상태에 따른 빔 식별자 정보의 능동적 할당 프로세스를 설명하기 위한 개념도이다. 도 5를 참조하면, 본원에서 개시하는 통신 제어 장치는 각 O-RU 별 빔 식별자 정보(beamId) 할당 빈도 로부터 O-RU 각각의 트래픽(Traffic)을 예측하고, 트래픽 예측 결과를 고려하여 빔 식별자 정보를 재할당하 도록 동작할 수 있다. 이에 따라, 빔 식별자 정보가 능동적으로 재할당 및 추가 할당됨으로써 통신 시스템의 전체적인 트래픽 처리 효율성이 개선될 수 있다. 구체적으로 통신 제어 장치는 복수의 기지국 장치 각각에 대한 빔 식별자 정보에 대한 할당 빈도에 대 한 정보를 수집할 수 있다. 또한, 통신 제어 장치는 수집된 할당 빈도에 기초하여 복수의 기지국 장치 각각에 대한 트래픽 예측 정보를 생성할 수 있다. 인빌딩 환경의 통신 시스템의 경우, 건물의 각 구획 공간(예를 들면, 개별 층 등) 각각에 대하여 복수의 O- RU가 각각 설치될 수 있으며, FHM 장치는 전술한 통신 제어 장치의 기능을 통해 사용자 단말(20 0)이 존재(위치)하는 구획 공간에 배치된 O-RU에 대하여 해당 구획 공간에 위치하는 사용자 단말에 대 응하는 빔 식별자 정보를 활용하여 O-DU로부터 전달되는 하향 링크 신호를 선택적으로 해당 구획 공간으로 만 송신되도록 할 수 있으며, 이러한 빔 식별자 정보에 대한 할당 및 개별 O-RU에 대한 하향 링크 신호 전 송은 각각의 구획 공간에 따라 상이한 패턴으로 나타날 수 있다. 이와 관련하여 예시적으로 도 4를 참조하면, 건물 내 3개의 구획 공간(Site) 각각에 대하여 3개의 O-RU가 각각 배치된 경우, 제1구획 공간(도 4에서 상대적으로 상측에 도시된 구획 공간)에 3개의 사용자 단말이존재하고, 제2구획 공간(도 4에서 가운데 도시된 구획 공간) 및 제3구획 공간(도 4에서 상대적으로 하측에 도시 된 구획 공간)에 1개의 사용자 단말이 존재하는 경우, 제1구획 공간에 대한 빔 식별자 정보 할당 빈도가 나머지 두 구획 공간(제2구획 공간 및 제3구획 공간) 대비 높은 것으로 파악될 수 있으며, 이러한 빔 식별자 정 보의 할당 패턴을 시계열적으로 누적하여 파악함에 따라 개별 구획 공간 별, 시간대 별로 사용자 단말의 수에 대한 통계 데이터가 파악될 수 있고, 통신 제어 장치는 이러한 통계 데이터를 고려하여 각 구획 공간 에 대응하는 O-RU에 대하여 할당할 빔 식별자 정보를 미리 예측할 수 있다. 이에 따라, 본원에서 개시하는 통신 제어 장치에 의할 때, 빔 식별자 정보를 인빌딩 O-RU 간 연결 경로에 매핑함으로써 빔포밍 효과를 획득할 수 있을 뿐만 아니라, 인빌딩 환경 내부의 트래픽 상태에 따라 빔 식별자 정보를 능동적으로 할당하여 전체적인 통신 효율을 개선할 수 있다. 또한, 본원의 일 실시예에 따르면, 통신 제어 장치는 수집된 할당 빈도에 기초하여 복수의 기지국 장치 각각에 대응하는 구획 공간(Site)에 대하여 향후 예측되는 트래픽 수준에 대한 트래픽 예측 정보를 출력하 도록 미리 학습되는 인공지능 기반의 트래픽 예측 모델을 구비할 수 있다. 예를 들어, 트래픽 예측 모델은 빔 식별자 정보에 대한 구획 공간 별 할당 빈도에 대한 정보를 각각의 구획 공간에 대한 트래픽 수준을 나타내는 데이터로 변환하고, 변환된 데이터에 대한 시계열 분석을 통해 이후의 트래픽 예측 정보를 추론하도록 구축되는 것일 수 있다. 도 6은 본원의 일 실시예에 따른 빔포밍 요소를 활용한 분산 경로에 대응하는 인덱스 테이블을 이용한 인빌딩 환경의 통신 시스템의 개략적인 구성도이다. 도 6을 참조하면, 본원의 일 실시예에 따른 인빌딩 환경의 통신 시스템은 기지국, 라디오 유닛, 익 스텐션 유닛, 분산종단유닛 및 사용자 단말을 포함할 수 있다. 또한, 본원에서 개시하는 인빌딩 환경의 통신 시스템의 경우, 기지국, 라디오 유닛, 익스텐션 유닛 및 분산종단유닛 상호 간 은 유선으로 통신 가능하게 연결되고, 분산종단유닛과 사용자 단말은 무선으로 통신 가능하게 연결되 는 것일 수 있다. 본원의 일 실시예에 따른 인빌딩 환경의 통신 시스템은, 기지국, 라디오 유닛을 매개로 기지국 과 통신 가능하도록 연결되는 단말기(사용자 단말; 200), 기지국에 상향 링크 신호를 전송하거나 기지국 으로부터 하향 링크 신호를 전송하는 라디오 유닛을 포함할 수 있다. 본원의 일 실시예에 따른 라디오 유닛은 기지국과 사용자 단말 사이에 위치하여, 신호를 전달하거 나 중계할 수 있다. 또한, 인빌딩 환경의 통신 시스템은 라디오 유닛과 분산종단유닛 사이에서 신호 를 전달하는 익스텐션 유닛을 포함할 수 있다. 한편, 본원의 실시예에 관한 설명에서 익스텐션 유닛은 허브 유닛(Hub Unit, HU)로 달리 지칭될 수 있고, 분산종단유닛은 서비스 유닛(Service Unit, SU)로 달리 지칭될 수 있다. 본원의 일 실시예에 따르면, 라디오 유닛은 인빌딩 환경의 통신 시스템 내의 익스텐션 유닛 및 분산 종단유닛의 설치 개수, 라디오 유닛과 익스텐션 유닛의 연결 관계(유선 경로), 익스텐션 유닛 과 분산종단유닛의 연결 관계(유선 경로) 등을 포함하는 인빌딩 유선 환경을 기초로 하여 복수의 분산종단 유닛에 대한 분산 경로(달리 말해, 라디오 유닛으로부터 복수의 분산종단유닛 각각에 도달하기 위 한 물리적 유선 경로)에 대응하는 인덱스 테이블을 생성할 수 있다. 보다 구체적으로, 본원의 실시예에 관한 설명에서 인덱스 테이블은 기지국으로부터 획득되는 빔포밍 정보를 이용하여 빔ID와 분산종단유닛을 매칭하기 위한 정보이거나 기지국으로부터 전달되는 빔포밍 정보에 포 함되는 빔ID와 분산종단유닛을 상호 매칭한 정보를 의미하는 것일 수 있다. 또한, 라디오 유닛은 인빌딩 환경의 통신 시스템이 구축되는 인빌딩 환경의 분산종단유닛에 도달하 기 위한 유선 경로를 기초로 생성된 인덱스 테이블을 기지국으로 전달할 수 있으며, 이러한 인덱스 테이블 은 라디오 유닛의 초기 설치(설정) 시 최초로 생성되어 기지국으로 전달되고, 매 슬롯(Slot) 단위로 인 빌딩 환경의 변화를 고려하여 갱신될 수 있다. 또한, 라디오 유닛으로부터 인덱스 테이블을 전달받은 기지국은 수신한 인덱스 테이블에 기초하여 복수 의 분산종단유닛 중 소정의 분산종단유닛에 연결된 사용자 단말과 라디오 유닛을 매개로 하여 신호를 송수신하는 통신을 수행함으로써, 기지국이 인빌딩 환경의 통신 시스템이 구축된 인빌딩 유선 환 경의 물리적 상태에 대한 정보를 직접적으로 파악하지 않고도 분산된 유선 경로를 반영하는 인덱스 테이블을 이 용하여 분산종단유닛에 구비되는 각각의 안테나가 독립적으로 활성화되는 방식의 통신을 원활하게 수행할수 있다. 또한, 기지국은 사용자 단말과 무선으로 전파를 송수신하며, 기지국과 사용자 단말 사이에 독립적인 경로를 설정하기 위해 빔포밍(beamforming) 기술을 사용할 수 있다. 밀리미터파 대역의 고주파수를 사용하는 5G 네트워크에서는, 고주파 신호의 높은 경로손실을 극복하기 위하여 빔포밍 기술을 사용하고 있으며, 빔의 좁은 커버리지 특성을 고려했을 때, 기지국과 사용자 단말은 서 로 데이터를 교환하기 위해서는 서로에게 맞는 빔 각도를 찾는 빔-정렬(beam-alignment) 과정이 필요하다. 구체 적으로 기지국과 사용자 단말 사이에 빔을 정렬하기 위해, 기지국은 빔의 방향을 어느 한 방향으 로 소정 각도씩 순차적으로 SSB(Synchronization Signal Block)의 신호를 빔포밍하여 전송할 수 있다. 이렇게 빔의 방향을 소정 각도씩 돌려가면서 신호를 전송하거나 수신하는 것을 빔-스위핑(beam-sweeping) 또는 빔-스캐 닝(beam-scanning)이라 하며, 여기서 빔-스위핑은 기지국 측에서 바라본 행동이고, 빔-스캐닝은 수신기 측 에서 바라본 행동을 가리킬 수 있다. 일 예로, 기지국이 n개의 빔 방향을 가질 수 있다고 한다면, 기지국은 n개의 빔 방향 각각에 대하여 지 원하고자 하는 방향들을 스위핑하면서 SSB 등의 신호를 전송할 수 있다. 이때, 적어도 하나의 빔들이 그룹화될 수 있으며, 이 경우에는 빔 그룹별로 SSB 등의 신호를 전송할 수 있다. 동일 방향으로 전송되는 SSB(Synchronization Signal Block)는, 한 셀 내에 복수의 SSB들이 존재할 수 있다. 복수의 SSB들이 존재하는 경우, 각 SSB의 구분을 위해서 SSB 인덱스(index)가 사용될 수 있다. 일 예로, 하나의 기지국에서 8개의 빔 방향으로 SSB가 전송되는 경우, 서로 다른 빔 방향을 가진 8개의 SSB 인덱스, 일 예로 SSB0 ~ SSB7가 전송될 수 있다. 한편, 본원의 일 실시예에 따르면, 라디오 유닛과 익스텐션 유닛은 1:8로 연결되고, 각 익스텐션 유닛 과 분산종단유닛은 1:16으로 연결되는 것으로 도시되어 있으나, 이에만 한정되는 것은 아니고, 라디오 유닛과 익스텐션 유닛의 연결 관계, 익스텐션 유닛과 분산종단유닛의 연결 관계, 익스텐션 유 닛의 배치 여부 등은 인빌딩 환경의 통신 시스템이 구현되는 인빌딩 환경의 특성에 따라 가변될 수 있다. 예를 들어, 본원의 구현예에 따라서는 복수의 분산종단유닛이 Cascade 형태로 다중 연결되는 경우, 익스텐션 유닛과 분산종단유닛이 1:32로 연결될 수 있다. 이때, 사용자 단말은 전원이 켜지거나 새로이 셀(cell)에 접속하고자 하는 경우 SSB 정보를 이용하여 기지 국과 하향링크신호 및 상향링크신호의 전송을 정확한 시점에 수행하는 데 필요한 시간 및 주파수 파라미터 등을 결정하여 동기화할 수 있으며, 이때, 사용자 단말은 SSB 정보로부터 빔 ID(identity) 등의 정보를 획 득할 수 있다. 도 7은 기지국에 대한 상향링크신호의 잡음을 도식화한 도면이다. 도 7을 참조하면, 라디오 유닛의 분산종단유닛(FEU; Front-End Unit)이 한 개인 경우, 잡음을 포함하는 통 신신호는 도 6의 (a)에 도시된 바와 같고, 분산종단유닛이 둘인 경우의 잡음을 포함하는 통신신호는 도 6의 (b)에 도시된 바와 같으며, 분산종단유닛이 그 이상인 n인 경우의 잡음을 포함하는 통신신호는 도 6의 (c)에 도 시된 바와 같다. 즉, 분산종단유닛의 개수가 증가함에 따라 잡음지수(NF)가 증가하는 문제가 있다. 왜냐하면 라디오 유닛은 비잡음 장치가 아니기 때문에, 그 개수가 증가함에 따라 잡음지수(NF)가 증가할 수 있다. 따라서, 하나의 기지국에 복수 개의 분산종단유닛의 연결이 요구되는 경우, 발생할 수 있는 상향링크 노이 즈에 대한 문제는 본원에서 개시하는 인빌딩 환경의 통신 시스템을 통해 라디오 유닛을 이용하여 빔포밍 을 위한 논리적 경로를 인빌딩 환경에서 유선 경로로 치환함으로써 하나의 레이어에서 하나의 분산종단유닛만이 활성화되도록 함으로써 해소될 수 있다. 또한, 본원에서 개시하는 인빌딩 환경의 통신 시스템의 경우, 인빌딩 환경에서 동작하는 복수의 분산종단유 닛에 대한 통신 경로를 빔포밍 정보를 이용하여 분산시킴으로써 분산종단유닛 간의 간섭을 방지할 뿐만 아니라, 하향링크 증폭기의 부담을 경감하여 전력 소모량을 감소시키는 이점이 있다. 도 8은 본원의 일 실시예에 따라 서로 매칭되는 빔포밍 정보와 분산종단유닛을 나타낸 도면이다. 도 8을 참조하면, 본원의 일 실시예에 따른 라디오 유닛은, 기지국으로부터 획득 가능한 빔포밍 정보를 이용하여 빔 ID와 분산종단유닛을 매칭하고, 매칭 결과를 반영하는 인덱스 테이블을 생성할 수 있다.구체적으로, 라디오 유닛은 기지국으로부터 전송되는 빔포밍 정보를 이용하여 이로부터 추출된 빔 ID와 복수의 분산종단유닛 중 적어도 하나를 매칭하고, 매칭된 분산종단유닛에 연결된 사용자 단말과 기지국 간에 신호를 중계하여, 통신 가능하도록 연결하기 위한 인덱스 테이블을 생성할 수 있다. 이때, 라디오 유닛은, 라디오 유닛에 의해 매칭된 분산종단유닛만 기지국과 통신 가능하도록 활성화함으로써, 여러 개의 분산종단유닛이 동시에 통신함으로써 발생할 수 있는 기지국에 대한 상향링 크 노이즈 문제를 해소할 수 있게 된다. 도 9는 본원의 일 실시예에 따른 인빌딩 라디오유닛과 분산종단유닛의 연결관계를 나타낸 도면이다. 도 9를 참조하면, 라디오 유닛은 기지국으로부터 전송되는 빔포밍 정보를 이용하여 추출되는 빔 ID와 분산종단유닛을 매칭하여 기지국과의 통신 경로를 분산할 수 있고, 바람직하게는 라디오 유닛이 빔 ID와 분산종단유닛을 매칭할 때 동시에 복수의 분산종단유닛이 매칭되지 않도록 시간적으로 분할하여, 소정 주기에 따라 빔 ID와 상기 분산종단유닛을 일대일로 매칭하도록 동작할 수 있다. 예시적으로 라디오 유닛은 소정 주기 T에 따라, T1에서 빔 ID #1은 분산종단유닛 #1과 매칭하고, T2에서 빔 ID #2는 분산종단유닛 #2와 매칭하며, Tn에서 빔 ID #n은 분산종단유닛 #n과 매칭하여 인덱스 테이블을 생성할 수 있다. 즉, 라디오 유닛은 상향링크 구간 또는 하향링크 구간을 각각 소정 주기로 시분할할 수 있고, 라디오 유닛 은 시분할된 각 구간에서 둘 이상의 분산종단유닛이 동시에 매칭되지 않도록 하되, 이때 각 분산종단유 닛은 자기가 매칭되었을 때에만 라디오 유닛을 경유한 기지국과의 통신 경로가 개방되도록 동작할 수 있다. 한편, 본원에서 개시하는 인빌딩 환경의 통신 시스템은 O-RAN(Open Radio Access Network Alliance) 기반의 기지국과 통신 가능하도록 연결된 라디오 유닛(O-RU; O-RAN Radio Unit)과, 사용자 단말과 통신 가능하도록 연결된 분산종단유닛(FEU; Front-End Unit)을 포함할 수 있다. 라디오 유닛은 기지국과 통신 가능하도록 연결되어, 라디오 유닛에 연결된 사용자 단말과 기 지국 간 통신시 그 신호를 중계할 수 있다. 이때 라디오 유닛은, 기지국, 구체적으로 분산기지국유닛(DU; Distributed Unit)과 무선이 아닌 유 선(일 예로 광케이블)로 연결될 수 있다. 5G 무선접속망에서는 무선 속도 증가 및 MIMO 시스템에 따른 프론트 홀(fronthaul) 용량의 증대 등으로 인하여, 기지국은 집중기지국유닛(CU; Central Unit)과 분산기지국유닛(DU; Distributed Unit)으로 분리 구현되고, 집중기지국유닛(CU)과 분산기지국유닛(DU)에 8가지 기능분리 옵션들을 선택적으로 적용할 수 있도록 다양한 구조를 갖는 개방형 기지국 구조를 갖도록 하고 있다. O-RAN(Open-Radio Access Network)에서 물리계층은 기능 분리되어, 분산기지국유닛(DU)은 option7인 High PHY를, 그리고 라디오 유닛은 option8인 Low PHY를 담당하였고, 라디오 유닛과 분산기지국유닛(DU)(1 2)은 서로 프론트홀(fronthaul) 인터페이스로 연결될 수 있다. 즉, 본원의 일 실시예에 따른 라디오 유닛은 기지국, 그 중 분산기지국유닛(DU)과 프론트홀 인터페 이스를 지원할 수 있다. 통상, 라디오 유닛은 무선 통신(RF) 기능을 가져, 무선으로 연결된 사용자 단말과 기지국 간에 통 신 연결을 중계할 수 있으나, 본원의 일 실시예에 따른 라디오 유닛이 인빌딩(in-building)용으로 구현되는 경우, 상기 라디오 유닛은 무선 통신(RF) 기능을 갖지 않지 않고, 분산종단유닛이 무선 통신(RF)을 기 능을 가져 사용자 단말과 무선으로 통신 연결될 수 있다. 즉, 본원의 일 실시예에 따른 라디오 유닛은 무선 통신 기능을 가진 분산종단유닛을 이용하여, 간접적 으로 기지국과 사용자 단말 간의 통신 신호를 중계할 수 있다. 또한, 라디오 유닛은 필요에 따라 집선 장치, 즉 허브(hub)로서, 하나의 라디오 유닛과 복수의 분산종 단유닛 간에 신호를 양방향으로 전달하기 위한 익스텐션 유닛(EU; Extension Unit)을 더 포함할 수 있 다. 일 예로, 본원에서 개시하는 인빌딩 환경의 통신 시스템이 구축되는 건물에는 기지국과 유선으로 연결된 라디오 유닛이 설치될 수 있고, 또한 사용자 단말과 연결되는 복수의 분산종단유닛과, 라디오 유 닛과 복수의 분산종단유닛 사이에 통신 신호를 분배하기 위한 익스텐션 유닛이 마련될 수 있다. 이 때 통상 분산종단유닛은 건물에 설치될 때 층별로 설치될 수 있으나, 이에만 한정되는 것은 아니다. 이때, 본원의 일 실시예에 따른 분산종단유닛은, 사용자 단말과 무선신호를 송수신하기 위한 안테나를 포함할 수 있고, 전술한 바와 같이, 분산종단유닛은 안테나를 이용하여 사용자 단말과 무선 통신(RF) 할 수 있다. 즉, 사용자 단말은 무선 통신(RF) 기능을 가진 분산종단유닛을 포함한 라디오 유닛에 의해 중계되어, 기지국과 통신 연결될 수 있다. 아울러, 본원의 일 실시예에 따른 라디오 유닛은, 빔포밍 정보를 이용하여 기지국과 복수의 분산종단유 닛 간의 통신 경로를 분산하고, 분산된 경로 정보에 대응하는 인덱스 테이블을 생성하여 기지국 측으로 전송할 수 있다. 즉, 본원의 일 실시예에 따른 라디오 유닛은, 기지국으로부터 수신한 빔포밍 정보를 이용하여 빔 ID와 분산종단유닛을 매칭할 수 있다. 라디오 유닛이 인빌딩용인 경우, 라디오 유닛은 빔포밍을 할 필요가 없지만, 본원의 일 실시예에 따른 라디오 유닛은 기지국, 구체적으로 분산기지국유닛(DU)에서 전송되는 빔포밍 정보를 프리코딩(pre- coding)하여 추출된 SSB 정보를 이용하여 빔 ID와 분산종단유닛을 매칭할 수 있다. 구체적으로, 라디오 유닛은 상기 SSB 정보로부터 획득한 SSB 인덱스를 근거로 익스텐션 유닛을 매칭할 수 있고, 더 정밀한 빔포밍을 위한 CSI-RS 인덱스를 근거로 분산종단유닛을 매칭할 수 있다. 여기서 CSI-RS 인덱스는 상기 추출된 SSB 정보로부터 획득한 SSB 인덱스에 속한 것으로, 본 명세서에서 사용하 는 용어 중 빔 ID는 SSB 인덱스와 이에 속하는 CSI-RS 인덱스의 조합일 수 있다. 종래 무선 통신(RF) 기능을 가진 라디오 유닛(RU)은, 일 예로 총 8개(SSB0~SSB7)의 SSB 인덱스, 그리고 각 빔에 서 총 16개(CSI-RS0 ~ CSI-RS15)의 CSI-RS 인덱스를 이용하여 빔포밍을 수행할 수 있다. 즉, 본원의 일 실시예에 따른 라디오 유닛은, 하나의 CSI-RS 인덱스에 하나의 분산종단유닛을 일대일로 매칭할 수 있고, 하나의 SSB 인덱스에 하나의 익스텐션 유닛을 일대일로 매칭할 수 있다. 본원의 일 실시예에 따른 라디오 유닛이 빔 ID와 분산종단유닛을 매칭한 경우, 매칭된 분산종단유닛 을 매개로 한 통신 신호만 기지국과 송수신이 이루어지도록 할 수 있다. 따라서, 라디오 유닛에 의해 매칭되지 않은, 비매칭된 분산종단유닛으로부터의 통신 신호는 라디오 유 닛이 중계하지 않을 수 있고, 이에 따라, 비매칭된 분산종단유닛으로부터 전송된 상향링크 노이즈는 기 지국으로 전송이 차단될 수 있다. 자기의 시분할된 구간이 아닌 분산종단유닛이나 또는 연결된 사용자 단말 의 미존재 등으로 매칭되지 않은 분산종단유닛 등은 비활성화될 수 있고, 이때 비매칭된 분산종단유닛과 라디오 유닛 간의 통 신 경로는 스위치 오프(off)될 수 있기 때문에, 복수의 분산종단유닛으로부터 전송되어 온 신호를 집선하여 기지국으로 전송하더라도, 비매칭된 분산종단유닛으로부터의 노이즈는, 매칭된 분산종단유닛으로부 터 전송된 상향링크신호에 중첩되지 않고, 따라서 라디오 유닛에 연결된 분산종단유닛의 개수가 증가하 더라도 그에 따라 라디오 유닛을 통해 기지국으로 전송되는 신호의 잡음지수(NF)가 증가하는 문제는 발 생하지 않는다. 한편, 본원의 바람직한 일 실시예에 따른 라디오 유닛은 기지국으로부터 전송된 빔포밍 정보에 대한 프 리코딩을 소정 주기에 따라 수행할 수 있다. 통상 복수의 빔 방향으로 빔-스위핑 또는 빔스캐닝이 이루어지는 경우, 소정 주기에 따라 시간적으로 분할되어 SSB 정보가 전송되기 때문에, 본원의 일 실시예에 따른 라디오 유닛 역시 이에 상응하여, 소정 주기에 따라 프리코딩을 하는 것이 바람직하며, 이때 상기 주기는 C-plane 데이터의 발생 주기, OFDM 심볼 단위 등일 수 있 으며, 일 예로 약 1ms일 수 있다. 또한, 여기서, 본원의 바람직한 일 실시예에 따른 라디오 유닛은 프론트홀 인터페이스의 C-plane 데이터만 프리코딩할 수 있다. 전술한 바와 같이, 기지국의 분산기지국유닛(DU)과 라디오 유닛은 프론트홀 인터페이스로 연결될 수 있으며, 이때, 라디오 유닛은 제어 신호 전송을 위한 프로토콜로서 C-plane 데이터와, 사용자 데이터 전 송을 위한 프로토콜로서 U-plane 데이터와, 동기화를 위한 프로토콜로서 S-plane 데이터 중 상기 U-plane 등은 제외하고 C-plane 데이터만 프리코딩하여, 처리 속도 및 처리 효율을 향상하는 것이 바람직하다. 즉, 라디오 유닛은 상기 C-plane 데이터만 프리코딩하여 빔 ID 정보 등을 추출하는 것이 바람직하다. 도 10은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치의 개략적인 구성도이다. 도 10을 참조하면, 통신 제어 장치는 다운링크 제어부 및 업링크 제어부를 포함할 수 있다. 다운링크 제어부는 제1빔 식별자 정보 및 하향 링크 신호를 획득하고, 복수의 기지국 장치 중 제1빔 식별 자 정보에 대응하는 제1타겟 기지국 장치로 하향 링크 신호를 전송할 수 있다. 업링크 제어부는 제2빔 식별자 정보를 획득하고, 복수의 기지국 장치 중 제2빔 식별자 정보에 대응하는 제 2타겟 기지국 장치로부터 상향 링크 신호를 수신할 수 있다. 또한, 업링크 제어부는 미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링크 신호를 다중화 (Multiplexing) 할 수 있다. 또한, 본원의 일 실시예에 따르면, 제1타겟 기지국 장치 또는 제2타겟 기지국 장치는 복수의 기지국 장치 중 접 속된 사용자 단말이 존재하는 기지국 장치로 선정될 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 11은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법에 대한 동작 흐름도이다. 도 11에 도시된 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은 앞서 설명된 통신 제어 장치(10 0)에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 통신 제어 장치에 대하여 설명된 내용은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법에 대한 설명에도 동일하게 적용될 수 있다. 도 11을 참조하면, 단계 S11에서 다운링크 제어부는 (a) 빔 식별자 정보 및 하향 링크 신호를 획득할 수 있다. 다음으로, 단계 S12에서 다운링크 제어부는 (b) 복수의 기지국 장치 중 빔 식별자 정보에 대응하는 타겟 기지국 장치를 선정할 수 있다. 구체적으로 단계 S12에서 다운링크 제어부는 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기지국 장치를 타겟 기지국 장치로 선택할 수 있다. 다음으로, 단계 S13에서 다운링크 제어부는 (c) 선정된 타겟 기지국 장치로 하향 링크 신호를 전송할 수 있다. 상술한 설명에서, 단계 S11 내지 S13은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 도 12는 본원의 다른 실시예에 따른 빔 식별자 기반의 통신 제어 방법에 대한 동작 흐름도이다. 도 12에 도시된 본원의 다른 실시예에 따른 빔 식별자 기반의 통신 제어 방법은 앞서 설명된 통신 제어 장치 에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이라고 하더라도 통신 제어 장치에 대하여 설명 된 내용은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법에 대한 설명에도 동일하게 적용될 수 있 다. 도 12를 참조하면, 단계 S21에서 업링크 제어부는 (a) 빔 식별자 정보를 획득할 수 있다. 다음으로, 단계 S22에서 업링크 제어부는 (b) 복수의 기지국 장치 중 빔 식별자 정보에 대응하는 타겟 기 지국 장치를 선정할 수 있다. 구체적으로 단계 S22에서 업링크 제어부는 복수의 기지국 장치 중 접속된 사용자 단말이 존재하는 기 지국 장치를 타겟 기지국 장치로 선택할 수 있다. 다음으로, 단계 S23에서 업링크 제어부는 (c) 선정된 타겟 기지국 장치로부터 상향 링크 신호를 수신할 수 있다.다음으로, 단계 S24에서 업링크 제어부는 (d) 미리 설정된 시간 간격 동안 누적하여 수신된 상기 상향 링 크 신호를 다중화(Multiplexing) 할 수 있다. 상술한 설명에서, 단계 S21 내지 S24는 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단 계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있다. 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프 로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그 램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로 그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사 용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프 와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같 은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴 파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행 될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 빔 식별자 기반의 통신 제어 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그 램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2023-0112946", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2023-0112946", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치를 구비하는 통신 시스템의 하향 링크 신호 전달 과정을 설명하기 위한 개념도이다. 도 2는 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치를 구비하는 통신 시스템의 상향 링크 신호 전달 과정을 설명하기 위한 개념도이다. 도 3은 네트워크 제어 리피터(Network-Controlled Repeaters, NCR)를 나타낸 개념도이다. 도 4는 본원의 일 실시예에 따른 인빌딩 환경의 통신 시스템의 빔 식별자 정보와 O-RU의 SU 경로 매칭을 예시적 으로 나타낸 도면이다. 도 5는 본원의 일 실시예에 따른 인빌딩 환경의 통신 시스템에서 트래픽 상태에 따른 빔 식별자 정보의 능동적 할당 프로세스를 설명하기 위한 개념도이다. 도 6은 본원의 일 실시예에 따른 빔포밍 요소를 활용한 분산 경로에 대응하는 인덱스 테이블을 이용한 인빌딩 환경의 통신 시스템의 개략적인 구성도이다. 도 7은 기지국에 대한 상향링크신호의 잡음을 도식화한 도면이다. 도 8은 본원의 일 실시예에 따라 서로 매칭되는 빔포밍 정보와 분산종단유닛을 나타낸 도면이다. 도 9는 본원의 일 실시예에 따른 인빌딩 라디오유닛과 분산종단유닛의 연결관계를 나타낸 도면이다. 도 10은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 장치의 개략적인 구성도이다. 도 11은 본원의 일 실시예에 따른 빔 식별자 기반의 통신 제어 방법에 대한 동작 흐름도이다. 도 12는 본원의 다른 실시예에 따른 빔 식별자 기반의 통신 제어 방법에 대한 동작 흐름도이다."}
