{"patent_id": "10-2022-0020008", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0123193", "출원번호": "10-2022-0020008", "발명의 명칭": "경보 수신기의 오경보를 원격에서 해제하는 장치", "출원인": "안동과학대학교 산학협력단", "발명자": "나욱정"}}
{"patent_id": "10-2022-0020008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "네트워킹 기능이 구비되지 않은 경보 수신기로부터 경보발생정보를 수신하여 관리자 단말로 전송하는 경보발생정보 전송부;상기 관리자 단말로부터 경보해제명령을 수신하는 경보해제명령 수신부; 및상기 수신한 경보해제명령을 토대로 경보해제 버튼 구동신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기에 구비된 경보해제 버튼을 물리적으로 눌러주도록 제어하거나, 혹은 경보해제 제어신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기의 경보 발생을 해제하도록 제어하는경보해제 제어부;를 포함하며,상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말의 원격제어를 통해서 상기 경보 수신기의 오경보를 해제할 수 있도록 하는 것을 특징으로 하는 경보 수신기의 오경보를 원격에서 해제하는 장치."}
{"patent_id": "10-2022-0020008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 경보 수신기의 오경보를 원격에서 해제하는 장치는,상기 경보해제 버튼의 대응되는 위치에 구비되어, 상기 경보해제 제어부로부터 수신되는 경보해제 버튼 구동신호에 따라 상기 경보해제 버튼을 물리적으로 눌러주는 경보해제 버튼 누름부;를 더 포함하며,상기 경보해제 버튼 누름부는,상기 경보해제 버튼의 둘레를 감싸도록 형성되며, 내면에 가이드레일이 형성된 지지부재;상기 지지부재의 상부에 결합되고, 상기 가이드레일을 따라 상기 경보해제 버튼 방향으로 이동되어 상기 경보해제 버튼을 가압하는 가압부재; 및상기 가압부재의 일측에 연결되고, 상기 경보해제 제어부로부터 수신되는 상기 경보해제 버튼 구동신호에 따라구동되어 상기 가압부재를 상기 경보해제 버튼 방향으로 이동시키고, 소정 시간이 경과되면 상기 가압부재를 원위치로 복귀시키는 액추에이터;를 포함하는 것을 특징으로 하는 경보 수신기의 오경보를 원격에서 해제하는 장치."}
{"patent_id": "10-2022-0020008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 경보 수신기의 오경보를 원격에서 해제하는 장치는,상기 경보 수신기에 구비된 시스템 유지보수용 통신포트를 통해 상기 경보 수신기와 통신 접속되며, 상기 시스템 유지보수용 통신포트를 통해서 상기 경보해제 제어신호를 상기 경보 수신기의 제어부로 전송하며,상기 경보 수신기의 제어부는,상기 시스템 유지보수용 통신포트를 통해서 상기 경보해제 제어신호가 수신되면, 경보발생부에서 발생하는 경보를 해제하는 것을 특징으로 하는 경보 수신기의 오경보를 원격에서 해제하는 장치."}
{"patent_id": "10-2022-0020008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 관리자 단말은,상기 수신한 경보발생정보에 포함된 전체 센서의 동작상태를 인공지능 학습모델에 입력하여 오경보인지를 추정공개특허 10-2023-0123193-2-하고, 상기 추정한 결과 오경보로 판단되면 상기 경보 수신기의 경보를 해제하기 위한 경보해제명령을 생성하여상기 경보 수신기의 오경보를 원격에서 해제하는 장치로 전송하며,상기 인공지능 학습모델은,상기 경보 수신기가 오경보를 발생할 때 전체 센서의 동작상태에 대한 패턴을 학습하여 생성한 것으로서, 상기관리자 단말에 저장되거나, 혹은 클라우드 서버에 저장되어 오경보 여부 판단시 이용되는 것을 특징으로 하는경보 수신기의 오경보를 원격에서 해제하는 장치."}
{"patent_id": "10-2022-0020008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "경보 수신기의 오경보를 원격에서 해제하는 장치에서, 네트워킹 기능이 구비되지 않은 경보 수신기로부터 경보발생정보를 수신하여 관리자 단말로 전송하는 경보발생정보 전송 단계;상기 관리자 단말로부터 경보해제명령을 수신하는 경보해제명령 수신 단계; 및상기 수신한 경보해제명령을 토대로 경보해제 버튼 구동신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기에 구비된 경보해제 버튼을 물리적으로 눌러주도록 제어하거나, 혹은 경보해제 제어신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기의 경보 발생을 해제하도록 제어하는경보 해제 제어 단계;를 포함하며,상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말의 원격제어를 통해서 상기 경보 수신기의 오경보를 해제할 수 있도록 하는 것을 특징으로 하는 경보 수신기의 오경보를 원격에서 해제하는 방법."}
{"patent_id": "10-2022-0020008", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 경보 수신기의 오경보를 원격에서 해제하는 방법은,상기 경보 수신기의 오경보를 원격에서 해제하는 장치에서, 상기 경보해제 버튼의 대응되는 위치에 구비된 경보해제 버튼 누름부를 이용하여 상기 경보해제 버튼을 물리적으로 눌러주어 경보를 해제하도록 제어하거나, 또는상기 경보 수신기의 오경보를 원격에서 해제하는 장치에서, 상기 경보 수신기에 구비된 시스템 유지보수용 통신포트를 통해 상기 경보해제 제어신호를 상기 경보 수신기의 제어부로 전송하여 경보발생부에서 발생하는 경보를해제하도록 제어하는 것을 더 포함하며,상기 경보해제 버튼 누름부는,상기 경보해제 버튼의 둘레를 감싸도록 형성되며, 내면에 가이드레일이 형성된 지지부재;상기 지지부재의 상부에 결합되고, 상기 가이드레일을 따라 상기 경보해제 버튼 방향으로 이동되어 상기 경보해제 버튼을 가압하는 가압부재; 및상기 가압부재의 일측에 연결되고, 경보해제 제어부로부터 수신되는 상기 경보해제 버튼 구동신호에 따라 구동되어 상기 가압부재를 상기 경보해제 버튼 방향으로 이동시키고, 소정 시간이 경과되면 상기 가압부재를 원위치로 복귀시키는 액추에이터;를 포함하는 것을 특징으로 하는 경보 수신기의 오경보를 원격에서 해제하는 방법."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 경보 수신기의 오경보를 원격에서 해제하는 장치에 관한 것으로, 네트워킹 기능이 구비되어 있지 않은 경보 수신기에, 오경보를 해제할 수 있는 오경보 원격 해제 장치를 연결하고, 상기 경보 수신기의 오경보로 인해 실제 화재가 발생하지 않은 상황에서 경보가 울리면, 관리자의 원격제어에 따라 상기 오경보 원격 해제 장치를 통해 경보해제 버튼을 물리적으로 눌러주어 경보를 해제하거나, 혹은 시스템 유지보수를 위한 통신포트를 이용하 여 전자적으로 경보를 해제함으로써, 상기 경보 수신기의 잦은 오경보에 의한 거주민들의 불편함을 해소하고, 불 필요한 소방 출동을 억제할 수 있도록 하는 경보 수신기의 오경보를 원격에서 해제하는 장치에 관한 것이다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 경보 수신기의 오경보를 원격에서 해제하는 장치에 관한 것으로, 더욱 상세하게는 네트워킹 기능이 구비되어 있지 않은 경보 수신기에, 오경보를 해제할 수 있는 오경보 원격 해제 장치를 연결하고, 상기 경보 수 신기의 오경보로 인해 실제 화재가 발생하지 않은 상황에서 경보가 울리면, 관리자의 원격제어에 따라 상기 오 경보 원격 해제 장치를 통해 경보해제 버튼을 물리적으로 눌러주어 경보를 해제하거나, 혹은 시스템 유지보수를 위한 통신포트를 이용하여 전자적으로 경보를 해제함으로써, 상기 경보 수신기의 잦은 오경보에 의한 거주민들 의 불편함을 해소하고, 불필요한 소방 출동을 억제할 수 있도록 하는 경보 수신기의 오경보를 원격에서 해제하 는 장치에 관한 것이다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 빌딩, 아파트 등의 건물에는 소방관리를 위해서 각 사무실이나 세대별, 혹은 각 층별로 화재를 감지 하는 각종 센서가 배치되어 있으며, 각각의 센서는 하나의 수신기에 통합되어 연결되어 있다. 수신기는 각 센서에서 감지한 센서 데이터를 토대로 화재발생이 확인되면, 자체적으로 경보를 발생하는 것은 물 론, 화재경보와 관련된 방송을 수행하여 소방 관계자가 건물의 특정 장소에 화재가 발생하였음을 인지하여 후속 조치를 취할 수 있도록 하며, 화재 발생을 소방서로 전달하는 기능을 수행한다. 하지만, 화재가 발생하지 않았음에도 불구하고 건물의 상태, 습기, 배선 노후, 센서 오류 등의 각종 요인으로 인해 수신기가 잘못된 경보를 발생하는 경우가 매우 빈번하게 일어나고 있으며, 이에 따라 거주자들의 불편이나 혼란이 늘어나는 것은 물론 잘못된 소방 출동으로 인한 인력 및 시간의 낭비가 발생하였다. 또한 수신기가 오경보를 발생하는 경우, 관리자는 해당 수신기가 설치된 위치로 직접 이동한 다음, 경보해제 버 튼을 조작하여 경보를 해제하고 원래 상태로 되돌려야 한다. 즉 수신기는 화재가 발생하는 경우 이에 대응하는 역할을 수행하여야 하기 때문에 임의로 원격에서 마음대로 작 동을 멈추도록 설계되어 있지 않기 때문에, 수신기에서 오경보가 발생하는 경우에는 관리자가 직접 수신기가 설 치된 위치로 이동해서 경보를 해제하여야 하는 불편함이 있었던 것이다. 이에 따라 일부 건물에서는 수신기의 잦은 오경보로 인한 거주자의 불편이나 혼란을 줄이기 위한 관리의 편이성 을 앞세우거나, 화재가 실제 발생하겠느냐는 안이한 마음가짐으로 인해 수신기의 동작을 정지시켜 놓은 경우가 있다. 그러나, 수신기의 동작을 꺼놓은 상황에서 실제 화재가 발생하면 큰 피해가 발생되어 인명 및 재산의 손실을 초 래하게 된다. 그러므로 수신기의 오경보 문제를 보다 쉽게 해결할 수 있는 방안의 도입이 시급한 실정이다. 따라서 본 발명에서는 실제 화재가 발생하지 않은 상황에서 경보 수신기가 오경보를 발생시키는 경우, 원격지에 서 상기 경보 수신기의 오경보를 해제함으로써, 경보 수신기의 오경보로 인한 거주자들의 불편함을 해소하고, 불필요한 소방 출동으로 인한 인력 및 비용의 낭비를 줄일 수 있는 방안을 제시하고자 한다. 특히, 본 발명은 네트워킹 기능이 구비되지 않은 경보 수신기에 오경보를 해제할 수 있는 오경보 원격 해제 장 치를 연결하고, 경보 수신기에서 발생한 경보를 오경보로 판단한 원격지의 관리자 단말의 제어에 따라 상기 오 경보 원격 해제 장치를 통해 경보해제 버튼의 대응 위치에 구비된 경보해제 버튼 누름부를 동작시켜 상기 경보 해제 버튼을 물리적으로 눌러주어 오경보를 해제하거나, 혹은 상기 오경보 원격 해제 장치에서 상기 경보 수신 기에 구비된 시스템 유지보수를 위한 통신포트를 통해 제어명령을 전송하여 전자적으로 오경보를 해제할 수 있 는 방안을 제시하고자 한다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "다음으로 본 발명의 기술분야에 존재하는 선행발명에 대하여 간단하게 설명하고, 이어서 본 발명이 상기 선행발 명에 비해서 차별적으로 이루고자 하는 기술적 사항에 대해서 기술하고자 한다. 먼저 한국등록특허 제1774897호(2017.08.30.)는 화재 신호의 휴대폰 통보 및 화재수신반의 리셋 시스템에 관한 것으로, 건물 내 각 가구에 마련된 화재감지기에 연결되어, 화재감지로부터의 화재 감지되었음을 알리는 화재 신호를 모니터링 기기로 출력하는 화재수신반; 상기 화재수신반을 통해 화재 신호가 출력되는지를 모니터링하는 기기로서, 상기 화재수신반을 통해 화재 신호가 출력되는 경우, 미리 등록된 관리자 휴대폰으로 화재감지기의 상태값이 포함된 화재 감지 메시지를 전송하고, 상기 관리자 휴대폰으로부터 리셋 메시지가 수신되는 경우, 상 기 화재수신반을 리셋시키는 모니터링 기기; 및 관리자가 사용하는 휴대폰으로서, 상기 모니터링 기기로 부터 수신되는 화재 감지 메시지를 표시하고, 화재수신반의 기기 오류라고 판단한 관리자로부터 리셋 명령이 입력되 면 화재수신반을 리셋시키라는 리셋 메시지를 상기 모니터링 기기로 전송하는 관리자 휴대폰;을 포함하는 화재 신호의 휴대폰 통보 및 화재수신반의 리셋 시스템에 관한 선행발명이다. 즉, 상기 한국등록특허 제1774897호는 화재수신반의 오작동으로 인한 리셋 처리를 원격에서 할 수 있는 시스템 에 대해 기재하고 있다. 하지만, 본 발명은 네트워킹 기능이 구비되지 않은 경보 수신기에 오경보를 해제할 수 있는 오경보 원격 해제 장치를 연결하고, 원격지의 관리자 단말에서 오경보 원격 해제 장치를 통해 경보해제 버튼의 대응 위치에 구비 된 경보해제 버튼 누름부를 동작시켜 상기 경보해제 버튼을 물리적으로 눌러주어 오경보를 해제하거나, 혹은 시 스템 유지보수를 위한 통신포트를 통해 제어명령을 전송하여 전자적으로 오경보를 해제하는 것이므로, 상기 한국등록특허 제1774897호와 본 발명은 현저한 구성상 차이점이 있다. 또한 한국공개특허 제2018-0055468호(2018.05.25.)는 P형 수신기의 화재감지 오류 제어장치 및 그 방법에 관한 것으로, 다수의 화재감지기 중 적어도 어느 하나의 화재감지기로부터 화재가 감지되면 해당 화재감지기가 연결 된 채널을 통해 화재 감지신호를 수신하고, 그에 대응되는 경보신호를 출력하는 경보부; 상기 경보부의 전단에 설치되며, 복수의 화재감지기가 그룹핑된 채널별로 화재 감지신호를 스위칭하는 릴레이부; 및 상기 화재감지기 및 경보부로부터 화재 감지신호를 전달받아 외부 원격서버로 전송하되, 외부 원격서버로부터 화재감지 작동 오 류 통지 신호가 통신모듈을 통하여 입력되면 상기 릴레이부의 해당 오류감지 채널만의 출력을 제어하여 상기 경 보부가 경종이 오프되도록 제어하는 제어부;를 포함하는 P형 수신기의 화재감지 오류 제어장치에 관한 선행발명 이다. 즉, 상기 한국공개특허 제2018-0055468호는 화재감지기의 화재감지 오류시 불량난 화재감지기의 화재감지램프가 계속 점멸되도록 해당 화재감지기의 출력 채널을 오프시켜 경종의 발생 여부를 원격으로 제어함으로써, 경종을 오프시킨 상태에서도 불량난 화재감지기의 식별이 용이하도록 하는 장치 및 그 방법을 기재하고 있다. 반면에 본 발명은, 원격지의 관리자 단말에서 기 설치되어 있는 경보 수신기에 연결한 오경보 원격 해제 장치를 통해 경보해제 버튼의 대응 위치에 구비된 경보해제 버튼 누름부를 동작시켜 상기 경보해제 버튼을 물리적으로 눌러주어 오경보를 해제하거나, 혹은 시스템 유지보수를 위한 통신포트를 통해 제어명령을 전송하여 전자적으로 오경보를 해제하는 것이므로, 상기 한국공개특허 제2018-0055468호와 본 발명은 기술적 구성의 차이점이 분명하 다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위해 창작된 것으로서, 경보 수신기에서 발생한 경보가 오경보로 판 단되면, 원격에서 해당 경보 수신기에서 울리는 경보를 해제할 수 있도록 하는 것을 목적으로 한다. 또한 본 발명은 네트워킹 기능이 구비되지 않은 경보 수신기에 오경보를 해제할 수 있는 오경보 원격 해제 장치 를 구비하고, 원격지의 관리자 단말에서 상기 오경보 원격 해제 장치를 통해 경보를 해제하는 경보해제 버튼을 작동시켜 경보 수신기의 오경보를 해제할 수 있도록 하는 것을 다른 목적으로 한다. 또한 본 발명은 원격지의 관리자 단말에서 경보 수신기에 연결한 오경보 원격 해제 장치를 통해 경보 수신기의 경보발생신호, 경보발생에 따른 각 센서별 동작상태정보, 경보해제 버튼의 동작정보 등을 제공받고, 이를 토대 로 경보 수신기의 오경보 여부를 판단하여 해당 경보 수신기의 경보를 해제할 수 있도록 하는 것을 또 다른 목 적으로 한다. 또한 본 발명은 경보 수신기의 오경보 발생에 따른 전체 센서의 동작상태에 대한 패턴을 학습하여 인공지능 학 습모델을 생성하고, 실제 경보 발생에 따른 전체 센서의 동작상태를 상기 생성한 인공지능 학습모델에 입력하여 오경보 발생을 추정하고, 상기 추정한 결과를 토대로 오경보로 판단된 해당 경보 수신기의 경보를 해제할 수 있 도록 하는 것을 또 다른 목적으로 한다. 또한 본 발명은 경보 수신기에서 발생한 경보를 오경보로 판단한 원격지의 관리자 단말의 제어에 따라 해당 경 보 수신기에 연결된 오경보 원격 해제 장치에서 경보해제 버튼의 대응 위치에 구비된 경보해제 버튼 누름부를 동작시켜 상기 경보해제 버튼을 물리적으로 눌러줌으로써, 경보 수신기의 오경보를 해제할 수 있도록 하는 것을 또 다른 목적으로 한다. 또한 본 발명은 경보 수신기에서 발생한 경보를 오경보로 판단한 원격지의 관리자 단말의 제어에 따라 해당 경 보 수신기에 연결된 오경보 원격 해제 장치에서 상기 경보 수신기에 구비된 시스템 유지보수를 위한 통신포트를 통해 제어명령을 전송하여 전자적으로 경보를 해제함으로써, 경보 수신기의 오경보를 해제할 수 있도록 하는 것 을 또 다른 목적으로 한다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 장치는, 네트워킹 기능이 구비되지 않 은 경보 수신기로부터 경보발생정보를 수신하여 관리자 단말로 전송하는 경보발생정보 전송부; 상기 관리자 단 말로부터 경보해제명령을 수신하는 경보해제명령 수신부; 및 상기 수신한 경보해제명령을 토대로 경보해제 버튼구동신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기에 구비된 경보해제 버튼을 물 리적으로 눌러주도록 제어하거나, 혹은 경보해제 제어신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해 서 상기 경보 수신기의 경보 발생을 해제하도록 제어하는 경보해제 제어부;를 포함하며, 상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말의 원격제어를 통해서 상기 경보 수신기의 오경보를 해제할 수 있도록 하는 것을 특징으로 한다. 또한 상기 경보 수신기의 오경보를 원격에서 해제하는 장치는, 상기 경보해제 버튼의 대응되는 위치에 구비되어, 상기 경보해제 제어부로부터 수신되는 경보해제 버튼 구동신호에 따라 상기 경보해제 버튼을 물리적 으로 눌러주는 경보해제 버튼 누름부;를 더 포함하며, 상기 경보해제 버튼 누름부는, 상기 경보해제 버튼의 둘 레를 감싸도록 형성되며, 내면에 가이드레일이 형성된 지지부재; 상기 지지부재의 상부에 결합되고, 상기 가이 드레일을 따라 상기 경보해제 버튼 방향으로 이동되어 상기 경보해제 버튼을 가압하는 가압부재; 및 상기 가압 부재의 일측에 연결되고, 상기 경보해제 제어부로부터 수신되는 상기 경보해제 버튼 구동신호에 따라 구동되어 상기 가압부재를 상기 경보해제 버튼 방향으로 이동시키고, 소정 시간이 경과되면 상기 가압부재를 원위치로 복 귀시키는 액추에이터;를 포함하는 것을 특징으로 한다. 또한 상기 경보 수신기의 오경보를 원격에서 해제하는 장치는, 상기 경보 수신기에 구비된 시스템 유지보수용 통신포트를 통해 상기 경보 수신기와 통신 접속되며, 상기 시스템 유지보수용 통신포트를 통해서 상기 경보해제 제어신호를 상기 경보 수신기의 제어부로 전송하며, 상기 경보 수신기의 제어부는, 상기 시스템 유지보수용 통 신포트를 통해서 상기 경보해제 제어신호가 수신되면, 경보 발생부에서 발생하는 경보를 해제하는 것을 특징으 로 한다. 또한 상기 관리자 단말은, 상기 수신한 경보발생정보에 포함된 전체 센서의 동작상태를 인공지능 학습모델에 입 력하여 오경보인지를 추정하고, 상기 추정한 결과 오경보로 판단되면 상기 경보 수신기의 경보를 해제하기 위한 경보해제명령을 생성하여 상기 경보 수신기의 오경보를 원격에서 해제하는 장치로 전송하며, 상기 인공지능 학 습모델은, 상기 경보 수신기가 오경보를 발생시킬 때 전체 센서의 동작상태에 대한 패턴을 학습하여 생성한 것으로서, 상기 관리자 단말에 저장되거나, 혹은 클라우드 서버에 저장되어 오경보 여부 판단시 이용되는 것을 특 징으로 한다. 아울러, 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 방법은, 경보 수신기의 오경보 를 원격에서 해제하는 장치에서, 네트워킹 기능이 구비되지 않은 경보 수신기로부터 경보발생정보를 수신하여 관리자 단말로 전송하는 경보발생정보 전송 단계; 상기 관리자 단말로부터 경보해제명령을 수신하는 경보해제명 령 수신 단계; 및 상기 수신한 경보해제명령을 토대로 경보해제 버튼 구동신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기에 구비된 경보해제 버튼을 물리적으로 눌러주도록 제어하거나, 혹은 경 보해제 제어신호를 생성하여 상기 경보 수신기로 제공하는 것을 통해서 상기 경보 수신기의 경보 발생을 해제하 도록 제어하는 경보 해제 제어 단계;를 포함하며, 상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말의 원격제어를 통해서 상기 경보 수신기의 오경보를 해제할 수 있도록 하는 것을 특징으로 한다. 또한 상기 경보 수신기의 오경보를 원격에서 해제하는 방법은, 상기 경보 수신기의 오경보를 원격에서 해제하는 장치에서, 상기 경보해제 버튼의 대응되는 위치에 구비된 경보해제 버튼 누름부를 이용하여 상기 경보해제 버튼 을 물리적으로 눌러주어 경보를 해제하도록 제어하거나, 또는 상기 경보 수신기의 오경보를 원격에서 해제하는 장치에서, 상기 경보 수신기에 구비된 시스템 유지보수용 통신포트를 통해 상기 경보해제 제어신호를 상기 경보 수신기의 제어부로 전송하여 경보 발생부에서 발생하는 경보를 해제하도록 제어하는 것을 더 포함하며, 상기 경 보해제 버튼 누름부는, 상기 경보해제 버튼의 둘레를 감싸도록 형성되며, 내면에 가이드레일이 형성된 지지부재; 상기 지지부재의 상부에 결합되고, 상기 가이드레일을 따라 상기 경보해제 버튼 방향으로 이동되어 상기 경보해제 버튼을 가압하는 가압부재; 및 상기 가압부재의 일측에 연결되고, 상기 경보해제 제어부로부터 수신되는 상기 경보해제 버튼 구동신호에 따라 구동되어 상기 가압부재를 상기 경보해제 버튼 방향으로 이동시 키고, 소정 시간이 경과되면 상기 가압부재를 원위치로 복귀시키는 액추에이터;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상에서와 같이 본 발명의 경보 수신기의 오경보를 원격에서 해제하는 장치에 따르면, 실제 화재가 발생하지 않았음에도 불구하고 경보 수신기가 작동되어 경보가 울리는 경우, 원격에서 해당 경보 수신기의 오경보를 해제 할 수 있도록 함으로써, 경보 수신기의 오경보로 인한 거주자들의 불편함을 해소할 수 있으며, 불필요한 소방출동을 억제하여 인력 및 비용의 낭비를 줄일 수 있는 효과가 있다."}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참조하여 본 발명의 경보 수신기의 오경보를 원격에서 해제하는 장치에 대한 바람직한 실 시 예를 상세히 설명한다. 각 도면에 제시된 동일한 참조부호는 동일한 부재를 나타낸다. 또한 본 발명의 실시 예들에 대해서 특정한 구조적 내지 기능적 설명들은 단지 본 발명에 따른 실시 예를 설명하기 위한 목적으로 예 시된 것으로, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들"}
{"patent_id": "10-2022-0020008", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "은 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가 지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과 도하게 형식적인 의미로 해석되지 않는 것이 바람직하다. 도 1은 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 장치를 포함한 전체 구성을 나 타낸 개략도이다. 도 1에 도시된 바와 같이, 본 발명은 경보 수신기의 오경보를 원격에서 해제하는 장치(100, 이하 오경보 원격 해제 장치라 약칭함), 경보 수신기, 관리자 단말, 데이터베이스 등을 포함하여 구성된다. 통상적으로 빌딩이나 주택의 소정 위치에 설치된 경보 수신기는 각 감시영역에 설치된 센서에서 측정한 열, 불꽃, 연기 등의 감지 데이터를 토대로 화재발생을 확인하고, 이를 알리는 경보를 발생한다. 하지만, 상기 경보 수신기에는 자체적으로 네트워킹 기능을 보유하고 있지 않아 원격지에 위치한 관리자 단말과 데이터 송수신을 수행하기 어려웠으며, 이에 따라 오경보가 발생되는 경우 관리자가 이를 원격에서 제어하여 해결하지 못하고, 직접 해당 위치를 방문하여 해결하여야 하는 불편함이 있었음은 물론, 오경보로 인 한 소방 출동으로 인해 소방력이 낭비되는 문제가 있었다. 본 발명은 이러한 문제를 해결하기 위한 것으로서, 상기 오경보 원격 해제 장치는 독립적인 네트워킹 기능 이 구비되어 있지 않은 경보 수신기와 접속되어, 원격지에 위치한 관리자 단말과 유선 및 무선 인터 넷을 포함한 네트워크를 통해 상기 경보 수신기에서 발생하는 경보와 관련된 데이터 통신을 수행할 수 있 도록 개발된 장치이다. 상기 오경보 원격 해제 장치는 네트워킹 기능이 없는 상기 경보 수신기를 대신하여 상기 경보 수신기 로부터 제공받은 경보발생정보를 원격지에 위치한 관리자 단말로 전송하고, 상기 정보 수신기에 서 발생한 경보를 오경보로 판단한 상기 관리자 단말로부터 경보해제명령이 수신되면 상기 경보 수신기 의 경보해제 버튼을 작동시킴으로써, 상기 경보 수신기의 오경보를 해제하는 기능을 수행한다. 즉 상기 경보 수신기가 실제 화재가 발생하지 않았음에도 경보가 울리는 경우, 관리자가 원격지에서 상기 오경보 원격 해제 장치를 통해 상기 경보 수신기의 오경보를 해제하여, 상기 경보 수신기의 오경보로 인한 거주자들의 불편함을 해소하고, 불필요한 소방 출동으로 인한 인력 및 비용의 낭비를 줄일 수 있도록 하는 것이다. 이때 상기 오경보 원격 해제 장치는 상기 경보 수신기에 구비된 시스템 유지보수용 통신포트(예를 들 어, USB 포트)에 접속하여 사용할 수 있도록 구성함으로써, 기존에 배치되어 있는 경보 수신기에 접속하여 사용할 수 있도록 하여야 한다.(도 3 참조) 또한 상기 관리자 단말로 제공되는 경보발생정보는 상기 경보 수신기로부터 제공받은 경보신호, 경보 발생에 따른 각 센서별 동작상태 및 측정데이터, 감시영역별 영상, 경보해제 버튼의 동작정보 등을 포함하며, 상기 관리자 단말에서는 상기 경보발생정보를 토대로 현재 발생한 경보가 정상적으로 동작되는 것인지, 아 니면 오경보인지를 판단할 수 있다. 한편, 상기 오경보 원격 해제 장치는 상기 관리자 단말로부터 수신한 경보해제명령에 따라 상기 경보 수신기의 경보 발생을 해제할 때 다음과 같은 2가지의 방식을 적용할 수 있다. 첫 번째, 상기 오경보 원격 해제 장치는 상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말로부터 경보해제명령이 수신되면, 상기 경보 수신기의 경보해제 버튼의 대응 위치에 구비 된 경보해제 버튼 누름부를 동작시켜 상기 경보해제 버튼을 물리적으로 눌러주도록 제어함으로써, 상기 경보 수 신기의 오경보를 해제할 수 있다.(도 4 참조) 두 번째, 상기 오경보 원격 해제 장치는 상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말로부터 경보해제명령이 수신되면, 상기 경보 수신기에 구비된 시스템 유지보수를 위한 통 신포트를 통해 경보해제 제어신호를 전송하여 전자적으로 경보를 해제하도록 제어함으로써, 상기 경보 수신기 의 오경보를 해제할 수 있다.(도 3 참조) 상기 경보 수신기는 특정 건물의 각 감시영역마다 설치되어 화재 발생을 감지하는 적어도 하나 이상의 센 서(카메라 포함)와 전기적으로 연결되어 있고, 화재로 인해 연기, 불꽃, 열 등이 상기 센서를 통해 감지되면, 화재발생을 알리는 경보를 발생시키며, 화재 발생을 인근 소방서에 전달하는 기능을 수행한다. 특히, 상기 경보 수신기는 시스템 유지보수용 통신포트를 통해 상기 오경보 원격 해제 장치와 통신 접속되어 있고, 상기 오경보 원격 해제 장치로 화재 발생 등으로 인한 경보발생정보를 제공하며, 상기 경 보가 오경보인 경우 상기 관리자 단말의 원격제어에 따라 상기 오경보 원격 해제 장치를 통해 경보 발생을 해제한다. 상기 관리자 단말은 관리자가 소유하고 있는 스마트폰, 태블릿 PC 등의 유무선 인터넷 등에 접속가능한 통 신단말로서, 원격에서 상기 오경보 원격 해제 장치를 통해서 상기 경보 수신기의 오작동으로 인한 경 보를 해제할 수 있도록 한다. 즉 상기 관리자 단말은 관리자가 애플리케이션 프로그램을 통해 상기 오경보 원격 해제 장치로부터 상기 경보 수신기의 경보발생정보를 수신하여 오경보 여부를 확인할 수 있도록 하며, 상기 확인한 결과 오 경보로 판단되면 관리자의 조작에 따른 경보해제명령을 생성하여 상기 오경보 원격 해제 장치로 전송하는 것이다. 이때 상기 관리자 단말은 상기 오경보 원격 해제 장치로부터 제공받은 상기 경보발생정보를 토대로 정상적으로 발생한 경보인지, 오경보인지를 판단할 때 여러 가지 방식을 적용할 수 있다. 예를 들어, 관리자가 상기 관리자 단말을 통해 상기 경보발생정보에 포함되어 있는 감시영역별 영상을 통 해서 실제 경보가 울리고 있지만 해당 감시영역 영상에서 화재가 확인되지 않으면, 오경보로 판단할 수 있다. 또한 상기 관리자 단말은 인공지능 학습모델을 사용하여 오경보 여부를 확인할 수 있다. 이 경우 상기 관 리자 단말은 상기 오경보 원격 해제 장치로부터 제공받은 상기 경보발생정보에 포함된 전체 센서의 동작상태에 대한 정보를 상기 인공지능 학습모델에 입력하여 오경보 발생을 추정하고, 상기 추정한 결과를 토대 로 관리자가 경보가 오경보임을 판단하도록 할 수 있다. 이때 상기 인공지능 학습모델은 상기 경보 수신기가 오경보를 발생시킬 때 전체 센서의 동작상태에 대한 패턴을 학습하여 생성한 것으로서, 상기 관리자 단말에 저장되거나, 혹은 클라우드 서버에 저장되어 오경 보 여부 판단시 사용된다. 또한 상기 관리자 단말은 경보해제명령에 의해 상기 경보 수신기의 경보해제 버튼이 수차례 동작되어 경보가 해제된 상황에서 또 다시 경보가 발생되면, 관리자가 전체 센서의 동작여부를 참조하여 오경보 여부를 판단하도록 할 수 있다. 즉 상기 경보해제 버튼이 구동되어 경보가 해제되었음에도 불구하고 또 다시 경보가 계 속 발생되면, 상기 관리자 단말은 전체 센서의 동작상태에 대한 정보를 화면상에 표시하고, 관리자가 각센서별 동작상태를 확인하여 경보의 오작동 여부를 판단할 수 있도록 하는 것이다. 이 경우 관리자는 어느 하나 의 센서만 계속 동작되는 경우 해당 경보가 오경보인 것으로 판단할 수 있으며, 위치가 서로 다른 여러 센서가 동시에 동작되는 경우 해당 경보가 정상적으로 동작된 것으로 판단할 수 있을 것이다. 한편, 상기 관리자 단말은 상기 오경보 원격 해제 장치로부터 직접 상기 경보 수신기의 경보발 생정보를 수신하고, 오작동으로 인한 경보를 해제하기 위한 경보해제명령을 상기 오경보 원격 해제 장치로 전송하는 방식 이외에, 상기 오경보 원격 해제 장치 각각을 관리하는 관리서버(미도시)를 경유하여 상기 오경보 원격 해제 장치로부터 상기 경보발생정보를 수신하거나 상기 경보해제명령을 전송하도록 구성할 수 있다. 상기 데이터베이스는 상기 오경보 원격 해제 장치 및 상기 관리자 단말에서 사용되는 오경보 여 부 판단을 위한 각종 동작프로그램을 저장하여 관리하며, 상기 경보 수신기에 접속된 오경보 원격 해제 장 치별 정보(예를 들어, 스펙정보, 설치위치, 동작상태 정보 등)를 저장하여 관리한다. 도 2는 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 장치의 구성을 보다 상세하게 나타낸 블록도이다. 도 2에 도시된 바와 같이, 상기 오경보 원격 해제 장치는 경보발생정보 수신부, 경보발생정보 전송부 , 경보해제명령 수신부, 경보해제 제어부 등을 포함하여 구성된다. 또한 상기 오경보 원격 해제 장치는 경보해제 버튼 누름부를 더 포함하여 구성할 수 있다. 상기 경보 해제 버튼 누름부의 구성은 도 4에서 보다 상세하게 설명한다. 상기 경보발생정보 수신부는 상기 경보 수신기의 시스템 유지보수용 통신포트를 통해 경보신호, 각 센서별 동작상태 및 측정데이터, 감시영역을 촬영한 영상 등을 포함한 경보발생정보를 수신한다. 상기 경보발생정보 전송부는 상기 경보발생정보 수신부를 통해 상기 경보 수신기로부터 수신한 경보발생정보를 네트워크를 통해 상기 관리자 단말로 전송한다. 즉 상기 경보 수신기에 유무선 인터넷 등의 네트워크를 통해 외부로 상기 경보발생정보를 전송하는 기능이 구비되어 있지 않기 때문에, 상기 경보발생정보 전송부에서 상기 경보 수신기를 대신하여 상기 경보 발생정보를 상기 관리자 단말로 전송하는 것이다. 상기 경보해제명령 수신부는 네트워크를 통해 상기 관리자 단말로부터 경보해제명령을 수신하고, 상 기 수신한 경보해제명령을 상기 경보해제 제어부로 출력한다. 상기 경보해제 제어부는 상기 경보 수신기에서 발생한 경보를 오경보로 판단한 상기 관리자 단말 의 원격제어를 통해서 상기 경보 수신기의 오경보를 물리적으로 해제하거나 혹은 전자적으로 해제할 수 있도록 하는 기능을 수행한다. 이때 상기 경보해제 제어부는 상기 경보해제명령 수신부를 통해 상기 관리자 단말로부터 수신한 경보해제명령에 따라 경보해제 버튼 구동신호를 생성하고, 상기 생성한 경보해제 버튼 구동신호를 상기 경보해 제 버튼 누름부로 출력하여 상기 경보 수신기에 구비된 경보해제 버튼을 물리적으로 눌러주도록 제어 한다. 즉 상기 경보해제 버튼을 물리적으로 구동시켜 경보를 해제할 수 있도록 하는 것이다. 또한 상기 경보해제 제어부는 상기 경보해제명령 수신부를 통해 상기 관리자 단말로부터 수신한 경보해제명령에 따라 경보해제 제어신호를 생성하고, 상기 생성한 경보해제 제어신호를 상기 경보 수신기 의 시스템 유지보수용 통신포트를 통해 상기 경보 수신기의 제어부로 출력하여 현재 발생되고 있는 경보를 해제하도록 제어한다. 즉 상기 경보를 전자적으로 해제할 수 있도록 하는 것이다. 도 3은 본 발명에 적용되는 경보 수신기의 구성을 보다 상세하게 나타낸 블록도이다. 도 3에 도시된 바와 같이, 상기 경보 수신기는 센서정보 수집부, 경보발생부, 표시부, 경 보발생정보 제공부, 경보해제 버튼, 시스템 유지보수용 통신포트, 제어부 등을 포함하여 구성된다. 상기 센서정보 수집부는 각 감시영역별로 설치되어 있는 적어도 하나 이상의 센서로부터 센서 동작정보, 측정 데이터, 영상 등을 포함한 센서정보를 수집하고, 상기 수집한 센서정보를 상기 제어부로 출력하여, 상기 제어부에서 상기 센서정보를 토대로 특정 지역에 화재가 발생하였음을 확인하도록 한다.상기 경보발생부는 상기 제어부의 제어에 따라 화재 발생을 알리는 경보를 스피커를 통해 발생시킨다. 상기 표시부는 상기 경보 수신기에 연결되어 있는 각 센서별 동작상태에 대한 정보를 표시한다. 상기 경보발생정보 제공부는 상기 센서정보 수집부로부터 수집한 센서정보를 상기 시스템 유지보수용 통신포트를 통해 상기 오경보 원격 해제 장치로 출력한다. 상기 경보해제 버튼은 상기 경보발생부를 통해 발생하는 경보를 해제하기 위한 키 입력을 수행하는 부분이다. 이때 상기 경보해제 버튼의 대응되는 위치에는 상기 관리자 단말의 원격제어를 토대로 자동으로 눌러 주는 경보해제 버튼 누름부가 설치될 수 있다.(도 4 참조) 상기 시스템 유지보수용 통신포트는 상기 센서정보 수집부에서 수집한 센서정보를 상기 오경보 원격 해제 장치로 전송한다. 또한 상기 시스템 유지보수용 통신포트는 상기 오경보 원격 해제 장치로부터 입력되는 경보해제 제어 신호를 상기 제어부로 출력한다. 상기 제어부는 상기 시스템 유지보수용 통신포트를 통해 상기 오경보 원격 해제 장치로부터 경 보해제 제어신호가 입력되면, 상기 경보발생부를 통해 발생하는 경보를 해제한다. 즉 상기 경보가 오경보 인 경우, 상기 오경보 원격 해제 장치로부터 제공되는 경보해제 제어신호에 의해 오경보를 전자적으로 해 제할 수 있는 것이다. 한편, 오경보의 해제는 도 4에서와 같이 상기 경보해제 버튼의 대응 위치에 상기 경보해제 버튼 누름부 가 설치되어 있는 경우, 상기 제어부를 통하지 않고 상기 관리자 단말에서 직접 상기 오경보 원 격 해제 장치를 통해 상기 경보해제 버튼 누름부의 구동을 제어하여 상기 경보발생부를 통해 발 생하는 경보를 해제할 수 있다. 도 4는 본 발명에 적용되는 경보 수신기의 경보해제 버튼을 물리적으로 눌러주기 위한 경보해제 버튼 누름부의 구성을 상세하게 나타낸 도면이다. 도 4에 도시된 바와 같이, 상기 경보해제 버튼 누름부는 상기 경보 수신기에 구비된 경보해제 버튼 의 대응되는 위치에 구비되고, 상기 경보해제 제어부로부터 출력되는 경보해제 버튼 구동신호를 토대 로 상기 경보해제 버튼을 가압하여 물리적으로 눌러주는 기능을 수행하며, 지지부재, 가압부재, 액추에이터 등을 포함하여 구성된다. 상기 지지부재는 상기 경보해제 버튼의 둘레를 감싸면서 상기 가압부재를 상부에 거치할 수 있 도록 형성되며, 상기 가압부재가 상기 액추에이터에 의해 상기 경보해제 버튼 방향으로 이동할 수 있도록 내측면에 가이드레일(151a)이 형성되어 있다. 상기 가압부재는 상기 지지부재의 상부에 결합되고, 상기 액추에이터가 구동됨에 따라 상기 가 이드레일(151a)을 따라 상기 경보해제 버튼 방향으로 이동되어 상기 경보해제 버튼을 가압하여, 상기 경보해제 버튼이 동작되도록 한다. 상기 액추에이터는 상기 가압부재의 일측에 연결되고, 상기 경보해제 제어부에서 출력되는 상기 경보해제 버튼 구동신호에 따라 구동되어(①), 상기 가압부재를 상기 경보해제 버튼 방향으로 이동시 켜 상기 경보해제 버튼을 물리적으로 눌러주어 상기 경보해제 버튼이 동작되도록 하며(②), 소정 시 간이 경과되면 상기 가압부재를 원위치로 복귀시킨다. 이때 상기 액추에이터는 실린더 및 피스톤 구조로 형성되며, 유압이나 공압에 의해 동작된다. 다음에는, 이와 같이 구성된 본 발명에 따른 경보 수신기의 오경보를 원격에서 해제하는 방법의 일 실시예를 도 5를 참조하여 상세하게 설명한다. 이때 본 발명의 방법에 따른 각 단계는 사용 환경이나 당업자에 의해 순서가 변경될 수 있다. 도 5는 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 방법의 동작과정을 상세하게 나 타낸 순서도이다.도 5에 도시된 바와 같이, 네트워킹 기능이 구비되어 있지 않은 경보 수신기를 대신하여 원격지에 위치한 관리자 단말과 네트워크를 통해 통신을 수행할 수 있는 오경보 원격 해제 장치에서 상기 경보 수신기 로부터 경보발생정보를 수신한다(S100). 즉 상기 경보 수신기에서 각 감시영역에 설치된 센서에서 측정한 감지 데이터를 토대로 화재 발생을 알리 는 경보가 울리면, 상기 오경보 원격 해제 장치는 상기 경보 수신기로부터 경보신호, 각 센서별 동작 상태 및 측정데이터, 감시영역별 영상 등을 포함한 경보발생정보를 수신하는 것이다. 이때 상기 오경보 원격 해 제 장치는 상기 경보 수신기에 구비된 시스템 유지보수용 통신포트를 통해 연결되어 데이터 입출력을 수행한다. 상기 S100 단계를 통해 상기 경보 수신기로부터 경보발생정보를 수신한 상기 오경보 원격 해제 장치 는 네트워크를 통해 상기 경보발생정보를 상기 관리자 단말로 전송하는 경보발생정보 전송 단계를 수행한 다(S200). 그러면, 상기 관리자 단말은 상기 오경보 원격 해제 장치에서 전송되는 경보발생정보를 토대로 오경 보인지, 아니면 정상적으로 경보가 동작한 것인지를 확인한다(S300). 이때 오경보 여부를 판단할 때, 실제 경보가 울리는 상황에서 감시영역 영상을 추가로 확인하여 오경보 여부를 판단하거나, 또는 상기 경보발생정보에 포함된 전체 센서의 동작상태에 대한 정보를 인공지능 학습모델에 입력 하여 추정한 결과를 이용하여 오경보 여부를 판단하거나, 또는 경보해제 버튼의 동작에 따라 경보가 해제된 상 황에서 또 다시 경보가 발생할 때 전체 센서의 동작여부를 참조하여 오경보 여부를 판단하는 것임은 상기 설명 한 바와 같다. 상기 S300 단계를 통해 오경보가 확인되면, 상기 관리자 단말은 관리자의 조작을 토대로 경보를 해제하기 위한 경보해제명령을 생성하여 네트워크를 통해 상기 오경보 원격 해제 장치로 전송한다(S400). 또한 상기 오경보 원격 해제 장치는 네트워크를 통해 상기 관리자 단말로부터 경보해제명령을 수신하 는 경보해제명령 수신 단계를 수행한다(S500). 이어서, 상기 오경보 원격 해제 장치는 상기 S500 단계를 통해 상기 관리자 단말로부터 수신한 경보 해제명령을 토대로 상기 경보 수신기의 경보 발생을 해제하도록 제어하는 경보 해제 제어 단계를 수행한다 (S600). 예를 들어, 상기 오경보 원격 해제 장치는 도 4에 나타낸 것처럼 상기 관리자 단말로부터 수신한 경 보해제명령에 따라 경보해제 버튼 구동신호를 생성한 다음, 상기 생성한 경보해제 버튼 구동신호를 상기 경보 수신기의 경보해제 버튼의 대응 위치에 설치된 경보해제 버튼 누름부로 전송하여, 상기 경보해 제 버튼 누름부를 통해 상기 경보해제 버튼을 물리적으로 눌러주도록 제어할 수 있다. 또한 상기 오경보 원격 해제 장치는 도 3에 나타낸 것처럼 상기 관리자 단말로부터 수신한 경보해제 명령에 따라 경보해제 제어신호를 생성한 다음, 상기 생성한 경보해제 제어신호를 시스템 유지보수용 통신포트 를 통해 상기 경보 수신기의 제어부로 전송하여, 경보 발생을 전자적으로 해제하도록 제어할 수 있다. 이처럼, 본 발명은 실제 화재가 발생하지 않았음에도 불구하고 경보 수신기가 작동되어 경보가 울리는 경우, 원 격에서 해당 경보 수신기의 오경보를 해제할 수 있기 때문에, 경보 수신기의 오경보로 인한 거주자들의 불편함 을 해소할 수 있으며, 불필요한 소방 출동을 억제하여 인력 및 비용의 낭비를 줄일 수 있다. 이상에서와 같이 본 발명은 도면에 도시된 실시예를 참고로 하여 설명되었으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하 다는 점을 이해할 것이다. 따라서 본 발명의 기술적 보호범위는 아래의 특허청구범위에 의해서 판단되어야 할 것이다."}
{"patent_id": "10-2022-0020008", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 장치를 포함한 전체 구성을 나 타낸 개략도이다. 도 2는 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 장치의 구성을 보다 상세하게 나타낸 블록도이다. 도 3은 본 발명에 적용되는 경보 수신기의 구성을 보다 상세하게 나타낸 블록도이다. 도 4는 본 발명에 적용되는 경보 수신기의 경보해제 버튼을 물리적으로 눌러주기 위한 경보해제 버튼 누름부의 구성을 상세하게 나타낸 도면이다. 도 5는 본 발명의 일 실시예에 따른 경보 수신기의 오경보를 원격에서 해제하는 방법의 동작과정을 상세하게 나 타낸 순서도이다."}
