{"patent_id": "10-2022-0031237", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0053488", "출원번호": "10-2022-0031237", "발명의 명칭": "금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 방법 및", "출원인": "주식회사 엑스퀀트", "발명자": "조금택"}}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 방법으로서,a) 소정 포맷의 이미지 파일 내에서 상기 테이블을 추출하는 인공지능 알고리즘을 학습시키는 단계;b) 입력되는 상기 계약서 내에서 상기 인공지능 알고리즘을 이용하여 상기 테이블을 추출하는 단계;c) 추출된 상기 테이블 내에서 각각의 셀의 내용을 추출하는 단계; 및d) 추출된 각각의 상기 셀의 내용을 헤더와 값으로 분류하여, 분류된 상기 헤더와 상기 값을 상기 테이블에 포함된 상기 데이터로서 추출하는 단계;를 포함하는 것을 특징으로 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 b) 단계는,b-1) 상기 계약서를 상기 이미지 파일로 변환하는 단계;b-2) 상기 인공지능 알고리즘을 이용하여 상기 이미지 파일 내에서 상기 테이블을 인식하는 단계;b-3) 인식된 상기 테이블에 대응되는, 상기 계약서 내의 상기 테이블의 위치를 산출하는 단계; 및b-4) 산출된 상기 위치를 이용하여 상기 계약서 내에서 상기 테이블을 추출하는 단계;를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 d) 단계에서는, 상기 헤더를 구성하는 데에 사용되는 소정의 키워드를 상기 셀의 내용과 비교하여 상기 헤더를 결정하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 d) 단계에서는 상기 키워드를 상기 테이블 내의 특정 열 또는 특정 행에 해당되는 상기 셀들과 비교하는것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,f) 추출된 상기 데이터에 대해 자연어 처리를 수행하여 상기 데이터 내에 포함된 의미를 도출하는 단계;공개특허 10-2023-0053488-3-를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 f) 단계에서 도출되는 상기 의미는 상기 자연어 처리에 의하여 상기 데이터에 대해 해석되는 기일을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 기일은 상기 계약서상의 계약 당사자의 달력 정보를 반영하여 도출되는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 시스템으로서,소정 포맷의 이미지 파일 내에서 상기 테이블을 추출하는 인공지능 알고리즘을 구비하는 테이블 추출부;상기 계약서를 상기 이미지 파일로서 상기 추출부에 입력하는 입력부;상기 테이블 추출부에 의해 추출된 상기 테이블 내에서 각각의 셀의 내용을 추출하는 내용 추출부; 및상기 내용 추출부에 의해 추출된 각각의 상기 셀의 내용을 헤더와 값으로 분류하여, 분류된 상기 헤더와 상기값을 상기 테이블에 포함된 상기 데이터로서 추출하는 데이터 추출부;를 포함하는 것을 특징으로 시스템."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 테이블 추출부는,상기 계약서를 상기 이미지 파일로 변환하는 변환부,상기 인공지능 알고리즘을 이용하여 상기 이미지 파일 내에서 상기 테이블을 인식하는 인식부, 및인식된 상기 테이블에 대응되는, 상기 계약서 내의 상기 테이블의 위치를 산출하는 산출부를 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서,상기 데이터 추출부는, 상기 헤더를 구성하는 데에 사용되는 소정의 키워드를 상기 셀의 내용과 비교하여 상기헤더를 결정하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 10 항에 있어서,상기 데이터 추출부는 상기 키워드를 상기 테이블 내의 특정 열 또는 특정 행에 해당되는 상기 셀들과 비교하여공개특허 10-2023-0053488-4-상기 헤더를 결정하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 8 항에 있어서,상기 데이터 추출부에 의해 추출된 상기 데이터에 대해 자연어 처리를 수행하여 상기 데이터 내에 포함된 의미를 도출하는 자연어 처리부;를 더 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 의미는 상기 자연어 처리에 의하여 상기 데이터에 대해 해석되는 기일을 포함하는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2022-0031237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 기일은 상기 계약서상의 계약 당사자의 달력 정보를 반영하여 도출되는 것을 특징으로 하는 시스템."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 방법 및 시스템이 개시된다. 소정 포맷의 이미지 파일 내에서 테이블을 추출하는 인공지능 알고리즘을 학습시키고, 입력되는 계약서 내에서 인공지능 알고리즘을 이용하여 테이블을 추출한다. 추출된 테이블 내에서 각각의 셀의 내용을 추출하고, 추출된 각각의 셀의 내용을 헤더와 값으로 분류하여 데이터로서 추출한다. 비표준화된 다양한 금융거래 계약서 내의 테 이블에 포함된 주요 내용이 자동으로 추출된다. 따라서 계약서의 종류나 형태에 상관없이 계약의 주요 내용에 대한 자동 입력이 가능하여 입력 전담 인력 및 입력 내용 검수 인력의 투입에 따른 비용이 절감된다."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 방법 및 시스템에 관한 것으로서, 보다 상세하게는, 장외 파생상품 거래 계약서 등과 같은 금융기관 간의 사적인 금융거래 계약서 내에 포함되어 있는 각종 비정형 테이블의 데이터를 자동으로 추출하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "금융기관들은 다양한 금융상품을 거래한다. 금융상품의 거래는 거래소에 상장되어 있는 주식이나 채권 등과 같 은 금융상품의 매매를 통해 이루어지기도 하지만, 금융기관들 간에 직접적으로 이루어지기도 한다. 예컨대 장 외 파생상품에 대한 거래는 두 금융기관들 간의 직접 협의를 통해 이루어진다. 금융기관들 간의 직접적인 거래가 합의되면 금융거래 계약서를 작성하여 계약을 체결한다. 이러한 금융거래 계 약서는 표준화되어 있지 않고, 어느 한 당사자가 자신이 사용하는 계약서 양식을 토대로 계약 내용을 작성하고 다른 당사자가 이에 대해 서명함으로써 계약이 체결되는 것이 일반적이다. 따라서, 금융거래 계약서의 형태는 거래 대상이 되는 금융상품의 종류마다 상이하고, 계약 당사자마다 상이하며, 주된 거래 내용에 부가되는 조건 이나 기한과 같은 부관에 따라서도 상이하다. 이와 같은 실정에 기인하여 수천 종류의 계약서가 실제 금융상품 의 거래 계약에 사용되고 있으며, 나아가 새로운 금융상품의 거래나 새로운 형태의 계약 또는 기존과는 다른 조 건의 설정 등과 같은 특수 상황을 반영하기 위해서 추가로 새로운 종류의 계약서가 다양한 형태로 새로 생성되 고 있다. 계약의 체결이 완료되면 각 당사자는 체결된 계약의 내용을 전산화하는 작업을 수행한다. 그런데 계약서는 최 종적으로 종이 문서의 형태로 작성되거나 pdf 파일 형태나 기타 이미지 파일 형태의 전자 문서로 작성되므로 계 약 내용의 입력을 자동화하기는 어렵다. 더욱이 전술한 바와 같이 수천 종류의 계약서가 기 존재하고 또한 새 로운 형태의 계약서가 지속적으로 등장하므로, 표준화된 특정 포맷의 계약서를 가정하여 계약서 내의 주요 내용 을 자동 추출 및 입력하는 방식은 채용하기 어렵다. 따라서 계약서 내용을 전산화하는 작업은 작업자의 수작업 에 의존하고 있다.그런데 이러한 수작업 입력 방식은 전담 인력의 배정이 필요하여 비용의 증가를 야기한다. 금융상품 거래의 특 성상 기일을 도과하는 경우 해당 금융기관에 막대한 손실과 신용의 실추를 가져올 수 있으므로, 계약서의 내용 에 대해 오류 없는 정확한 입력은 매우 중요하다. 그럼에도 불구하고 입력상의 오류로 인하여 금융사고가 빈번 하게 발생하고 있고, 이를 방지하기 위하여 금융기관은 입력 전담 인력 외에도 입력된 내용의 정확성을 검수하 기 위한 검수 인력을 추가로 배치하여 계약 내용의 정확한 입력을 위해 이중, 삼중의 인력을 투여하고 있다. 이에 따라 비용의 증가가 막대하고, 그럼에도 불구하고 입력 오류로 인한 금융사고는 지속적으로 발생하고 있다."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 문제점들을 해결하기 위해 안출된 것으로서, 본 발명의 목적은 비표준화된 금융거래 계약서 내의 비정형 데이터를 자동으로 추출함으로써 입력상의 오류를 줄일 수 있는 방안을 제공하는 것이다."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여 본 발명은, 금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 방법을 제시한다. 상기 방법은, a) 소정 포맷의 이미지 파일 내에서 상기 테이블을 추출하는 인공 지능 알고리즘을 학습시키는 단계; b) 입력되는 상기 계약서 내에서 상기 인공지능 알고리즘을 이용하여 상기 테이블을 추출하는 단계; c) 추출된 상기 테이블 내에서 각각의 셀의 내용을 추출하는 단계; 및 d) 추출된 각각 의 상기 셀의 내용을 헤더와 값으로 분류하여, 분류된 상기 헤더와 상기 값을 상기 테이블에 포함된 상기 데이 터로서 추출하는 단계;를 포함한다. 상기 b) 단계는, b-1) 상기 계약서를 상기 이미지 파일로 변환하는 단계; b-2) 상기 인공지능 알고리즘을 이용 하여 상기 이미지 파일 내에서 상기 테이블을 인식하는 단계; b-3) 인식된 상기 테이블에 대응되는, 상기 계약 서 내의 상기 테이블의 위치를 산출하는 단계; 및 b-4) 산출된 상기 위치를 이용하여 상기 계약서 내에서 상기 테이블을 추출하는 단계;를 포함하여 구성될 수 있다. 상기 d) 단계에서는, 상기 헤더를 구성하는 데에 사용되는 소정의 키워드를 상기 셀의 내용과 비교하여 상기 헤 더를 결정할 수 있다. 상기 d) 단계에서는 상기 키워드를 상기 테이블 내의 특정 열 또는 특정 행에 해당되는 상기 셀들과 비교한다. 본 발명의 방법은, f) 추출된 상기 데이터에 대해 자연어 처리를 수행하여 상기 데이터 내에 포함된 의미를 도 출하는 단계;를 더 포함하여 구성될 수 있다. 상기 f) 단계에서 도출되는 상기 의미는 상기 자연어 처리에 의하여 상기 데이터에 대해 해석되는 기일을 포함 한다. 상기 기일은 상기 계약서상의 계약 당사자의 달력 정보를 반영하여 도출될 수 있다. 본 발명의 다른 측면에 의하면, 금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 시스템이 제공된다. 상기 시스템은, 소정 포맷의 이미지 파일 내에서 상기 테이블을 추출하는 인공지능 알고리즘을 구비하는 테이블 추출부; 상기 계약서를 상기 이미지 파일로서 상기 추출부에 입력하는 입력부; 상 기 테이블 추출부에 의해 추출된 상기 테이블 내에서 각각의 셀의 내용을 추출하는 내용 추출부; 및 상기 내용 추출부에 의해 추출된 각각의 상기 셀의 내용을 헤더와 값으로 분류하여, 분류된 상기 헤더와 상기 값을 상기 테이블에 포함된 상기 데이터로서 추출하는 데이터 추출부;를 포함하여 구성된다. 상기 테이블 추출부는, 상기 계약서를 상기 이미지 파일로 변환하는 변환부, 상기 인공지능 알고리즘을 이용하 여 상기 이미지 파일 내에서 상기 테이블을 인식하는 인식부, 및 인식된 상기 테이블에 대응되는, 상기 계약서 내의 상기 테이블의 위치를 산출하는 산출부를 포함하여 구성될 수 있다. 상기 데이터 추출부는, 상기 헤더를 구성하는 데에 사용되는 소정의 키워드를 상기 셀의 내용과 비교하여 상기 헤더를 결정한다.상기 데이터 추출부는 상기 키워드를 상기 테이블 내의 특정 열 또는 특정 행에 해당되는 상기 셀들과 비교하여 상기 헤더를 결정한다. 상기 시스템은, 상기 데이터 추출부에 의해 추출된 상기 데이터에 대해 자연어 처리를 수행하여 상기 데이터 내 에 포함된 의미를 도출하는 자연어 처리부;를 더 포함하여 구성될 수 있다. 상기 의미는 상기 자연어 처리에 의하여 상기 데이터에 대해 해석되는 기일을 포함한다. 상기 기일은 상기 계약서상의 계약 당사자의 달력 정보를 반영하여 도출된다."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 비표준화된 다양한 금융거래 계약서 내의 테이블에 포함된 주요 내용이 자동으로 추출된다. 따라서 계약서의 종류나 형태에 상관없이 계약의 주요 내용에 대한 자동 입력이 가능하여 입력 전담 인력 및 입 력 내용 검수 인력의 투입에 따른 비용이 절감된다. 또한, 입력 시간이 현저하게 단축되어 효율적이고 즉각적 인 전산화 및 이를 통한 관리 및 통계의 신속성과 정확성을 제공할 수 있다. 나아가, 전산화를 위한 계약 내용 의 입력 과정에서 오류가 발생하지 않으므로, 잠재적인 금융리스크가 제거된다."}
{"patent_id": "10-2022-0031237", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 금융기관 간의 비표준화된 금융거래 계약서 내에서 거래 조건을 빠르고 정확하게 추출하고 전처리하 여 정형화하는 방안을 제시한다. 금융기관 간의 금융거래 계약서는 일반 계약 내용과 주된 계약 내용을 포함하고 있다. 일반 계약 내용은 예컨 대 당사자 간의 이행 의무나 주의 의무와 같은 통상적인 계약서 또는 금융 계약서에 관용적으로 포함되어 있는 내용이고, 주된 계약 내용은 예컨대 거래 대상 금융상품, 거래 조건, 지급 이자, 이행일 등과 같은 개별적, 구 체적 내용이다. 주된 계약 내용은 관리를 위해 입력해야 하는 대상이 되는 내용으로서, 본 발명은 이를 자동으 로 추출하여 정형화함으로써 수작업에 의한 입력이 아닌 자동 입력을 통해 전산화하여 관리할 수 있도록 하는 방안을 제시한다. 주된 계약 내용은 일반적으로 테이블의 형태로 작성된다. 금융거래가 합의되면 합의된 내용은 당사자 중 일방 이 사용하는 금융거래 계약서 포맷을 이용하여 계약서로서 작성되며, 이러한 계약서는 필요한 주요 내용만을 선 별하여 기재하기 편하도록 주요 내용들이 테이블의 형태로 사전 작성되어 테이블 내의 각 공란 항목을 기입하도 록 구성되어 있다. 그런데 이러한 테이블은 금융기관마다 그 형태가 상이하여 이를 자동 추출하기가 매우 어렵 다. 본 발명은 계약서 내에서 이러한 테이블에 기입되어 있는 데이터를 추출함으로써 계약의 주된 내용을 추출 한다. 테이블은 일반 테이블과 특이 테이블로 구분된다. 일반 테이블은 도 1 에 도시된 바와 같이 수평선과 수직선으 로 명확하게 테이블임을 알 수 있도록 작성된 테이블을 지칭한다. 즉, 일반 테이블은 그 형태가 정형화되고 인 식이 용이한 테이블을 의미한다. 특이 테이블은 선이 없거나 도 2 에 도시된 바와 같이 일부의 선만 존재하는 테이블, 또는 도 3 에 도시된 바와 같이 색이 칠해져 있는 테이블 등을 지칭한다. 즉, 특이 테이블은 정형화되 어 있는 일반 테이블 외의 모든 유형의 테이블을 의미한다. 특이 테이블은 현재 개발된 소프트웨어로는 정확하 게 인식하지 못하고 있다. 본 발명은 일반 테이블은 물론이고 정형화되지 않은 특이 테이블에 대해서도 이를 테이블로 인식하여 각각의 셀(cell) 내에 포함된 데이터를 추출하는 방안을 제공하며, 이를 위하여 머신러닝이 가능한 인공지능 알고리즘을 이용하여 학습하는 방안을 채용한다.도 4 는 본 발명에 따른 시스템의 블록도로서, 금융거래의 계약에 사용되는 계약서 내의 비표준화된 테이블에 포함된 데이터 추출 시스템의 각 모듈을 도시한 것이다. 도 4 의 모듈들은 하드웨어적으로 또는 소프트웨어적 으로 구현될 수 있다. 도 4 에서 각각의 모듈은 본 발명의 개념을 기술하기 위해 구분되어 있으나, 도 4 에 도 시된 모듈들은 둘 이상이 하나의 모듈로 구성될 수도 있고 하나의 모듈이 둘 이상의 세부 모듈들로 나뉘어 구성 될 수도 있다. 본 발명의 시스템은 입력부, 테이블 추출부, 내용 추출부, 데이터 처리부, 및 자연어 처 리부를 포함하여 구성된다. 입력부는 본 발명에서 데이터의 추출 대상이 되는 계약서를 입력하는 모듈이다. 여기에서 입력부에 입 력되는 계약서는 예컨대 계약서 원본을 스캔한 pdf 파일로 구성될 수 있다. 테이블 추출부는 입력부에 입력된 계약서로부터 테이블을 추출하는 모듈이다. 테이블 추출부는 인 공지능 알고리즘을 구비하여, 이 알고리즘을 이용하여 테이블을 추출한다. 인공지능 알고리즘은 머신러닝을 통 해 사전에 학습된다. 구체적으로는, 인공지능 알고리즘은 소정 포맷의 이미지 파일 내에서 테이블을 추출하는 과정을 수행하고 수행한 결과에 대해 피이드백을 받는 과정을 반복함으로써, 다양한 종류의 이미지 파일에 대해 테이블 추출 과정을 학습하여 수행 능력을 점진적으로 개선한다. 학습에 사용되는 이미지 파일은 도 1 에 도시 된 바와 같은 형태의 일반 테이블을 포함하는 문서의 이미지, 및 도 2 와 도 3 에 도시된 바와 같은 형태 및 기 타 제반 형태의 특이 테이블을 포함하는 문서의 이미지를 포함한다. 이러한 다양한 문서의 이미지 파일에 대해 학습을 거듭함에 따라 다양한 종류의 특이 테이블이 포함된 문서의 이미지로부터 테이블을 추출하는 능력의 정 확도가 점진적으로 증가한다. 본 발명에서 인공지능 알고리즘으로는 기존의 다양한 알고리즘, 예컨대 CNN (Convolutional Neural Network) 알 고리즘이 사용될 수 있다. 바람직하게는 본 발명의 인공지능 알고리즘으로는 LSTM (Long-Short Term Memory) 알고리즘이 적용된다. LSTM 알고리즘은 입력 데이터를 기억하여 분석하는 RNN 알고리즘의 짧은 기간 지속성을 개선한 알고리즘으로서, 긴 기간 동안의 데이터에 대해 지속적으로 예측을 하는 데에 최적화된 알고리즘이다. 테이블 추출부는 변환부, 인식부, 및 산출부를 구비한다. 변환부는 입력부에 입력된 계약서를 이미지 파일로 변환한다. 이때 이미지 파일은 시스템에 사전 에 설정된 포맷의 파일로 구성된다. 예컨대 테이블 추출부 내의 인공지능 알고리즘이 jpg 파일을 이용하여 학습하였다면, 변환부는 입력된 계약서를 jpg 파일로 변환함으로써 학습된 인공지능 알고리즘이 동작하기에 적합한 이미지 파일을 얻는다. 인식부는 상기 인공지능 알고리즘을 이용하여 이미지 파일 내에서 테이블을 인식한다. 계약서의 이미지 파 일 내에는 테이블뿐만 아니라 다른 다양한 내용이 포함되어 있다. 전술한 바와 같이 데이터 추출부 내의 인공지능 알고리즘은 이미지 내에서 테이블을 추출하는 학습을 거쳤으므로, 입력된 계약서의 이미지 파일에 대 해 학습된 결과를 적용하여 이미지 파일 내의 정형화/비정형화된 다양한 종류의 테이블을 인식할 수 있다. 산출부는 인식된 테이블에 대응되는 위치(coordinate)를 산출한다. 여기에서 위치는 이미지 파일로 변환되 기 전의 원본인 계약서(예컨대 pdf 파일) 내의 테이블의 위치를 의미한다. 변환부에 의해 변환된 이미지 파일 내에서의 위치는 변환되기 전의 계약서 내의 위치와는 상이할 수 있다. 따라서 산출부는 이미지 파일 내에서 인식된 테이블의 위치를 계약서 내의 테이블의 위치로서 산출한다. 테이블 추출부는 산출부가 산출한 테이블 위치를 토대로 계약서 내에서 테이블을 추출한다. 예컨대 계 약서가 pdf 파일로 구성된 경우 테이블 추출부는 pdf 프로그램의 잘라내기 기능 등을 이용하여 산출된 위치 에 의해 정의되는 영역을 잘라냄으로써, 계약서 내에서 테이블을 추출할 수 있다. 내용 추출부는 테이블 추출부에 의해 추출된 테이블 내에서 각각의 셀의 내용을 추출한다. 예컨대 도 1 과 같은 테이블이 테이블 추출부에 의해 추출된 경우, 도 1 의 각 셀의 내용(1, 고객, 방향, 통화, ㆍㆍ ㆍㆍㆍ , DB Financial Investment, SELL, USD, ㆍㆍㆍㆍㆍ , 2021-07-06, 1132.50 등과 같이 각각의 셀에 기 재되어 있는 내용)이 추출된다. 내용 추출부에 의한 내용 추출은 일반적인 패턴 인식에 의해 수행된다. 즉, 각 셀의 내용을 이미지로서 스캔하고 스캔된 이미지를 패턴 인식에 의하여 문자/숫자 등으로 인식함으로써 내용이 추출될 수 있다. 데이터 추출부는 내용 추출부에 의해 추출된 각각의 셀의 내용을 헤더와 값으로 분류하고, 분류된 헤더 와 값을 해당 테이블에 포함된 데이터로서 추출한다. 예컨대 도 1 의 예시에서, 첫 번째 행(row)의 \"고객\", \"방향\", \"통화\" 등과 같은 내용은 해당 테이블의 항목 명칭을 열거한 헤더이고, 두 번째 행 이하의 \"DB Financial Investment\", \"SELL\", \"USD\" 등과 같은 내용은 헤더를 구성하는 각 항목에 대해 실제로 기입된 값이 다. 이와 같이 테이블에는 헤더를 구성하는 셀들과 값을 기입하는 셀들을 포함하므로, 데이터 추출부는 추 출된 각각의 셀의 내용을 분석하여 해당 셀을 헤더와 값으로 분류한다. 데이터 추출부가 셀의 내용을 헤더와 값으로 분류하는 데에는 키워드와 셀의 내용을 비교하는 방식이 사용 될 수 있다. 테이블의 헤더를 구성하는 용어들은 금융거래 계약서의 특성을 고려하여 사전에 정의하는 것이 가 능하다. 예컨대 금융거래 계약서의 헤더에 사용되는 용어는 도 1 내지 도 3 의 첫 번째 행들에 도시된 바와 같 이, 고객, 방향, 통화, 외화, 원화, 만기, 환율, FX, Value, Rate, Amount 등이며, 다양한 계약서에 사용되는 용어들을 수집함으로써 사전에 키워드로서 정의가 가능하다. 그리고 값을 구성하는 내용은 위 각각의 용어들에 대한 실제 수치나 고유명사(고객/상대방 등의 경우) 등이며, 따라서 위 헤더에 사용되는 용어와는 확연하게 구 분되는 내용으로 이루어진다. 이러한 점을 고려할 때, 헤더에 사용되는 용어들을 수집하여 풀(pool)로 구성하 고, 추출된 셀의 내용을 이 풀 내에 포함된 키워드와 비교하여 일치되는(또는 일치도가 일정 이상인) 셀들에 대 해서는 헤더를 구성하는 셀로 분류하고 나머지는 값을 구성하는 셀로 분류할 수 있다. 데이터 추출부는 이 러한 키워드를 사전에 정의하여 구비하는 별도의 저장부를 구비하는 것이 바람직하다. 한편, 도 1 내지 도 3 에 예시된 테이블들에서와 같이, 통상적으로 헤더를 구성하는 셀들은 최상위 열(또는 상 위 한두 개의 열)에 배치되거나 최좌측의 열(또는 좌측 한두 개의 열)에 배치된다. 따라서, 데이터 추출부(4 0)가 헤더를 구성하는 셀인지 값을 구성하는 셀인지를 판단하여 분류하는 데에 있어서 이러한 점을 반영하여, 예컨대 어느 셀이 명백하게 값을 구성하는 셀인 것으로 분류되는 경우 그보다 우측이나 하부에 놓인 셀 또한 값 을 구성하는 셀로 분류할 수 있다. 다른 예로서, 데이터 추출부는 키워드를 테이블 내의 특정 열(column) 또는 특정 행(row)에 해당되는 셀들과 비교하여 헤더를 결정할 수 있다. 전술한 바와 같이, 헤더를 구성하는 셀들은 첫 번째 열이나 첫 번째 행, 또는 상위 2~3 개의 열이나 좌측 2~3 개의 행에 배치되므로, 이들 행과 열 에 대해서만 키워드와 비교함으로써 헤더를 결정하면 헤더 결정 프로세스가 간결하고 신속하게 이루어질 수 있 다. 자연어 처리부는 데이터 추출부에 의해 추출된 데이터에 대해 자연어 처리를 수행하여 데이터 내에 포 함된 의미를 도출한다. 특정 셀의 내용이 문장을 이루는 경우, 해당 문장에 대해 자연어 분석을 수행함으로써 그 의미를 파악할 수 있다. 금융거래 계약서의 경우 예컨대 지급 기일과 같은 날짜는 이를 도과할 경우 채무불 이행 상태가 되어 매우 심각한 문제를 야기한다. 따라서 정확한 날짜를 추출하고 입력하는 것이 매우 중요하다. 그런데 이러한 날짜는 서술형 문구로 기재되는 경우가 많아, 이를 해석하여 명확하게 입력하는 데에 있어서 오류가 발생할 가능성이 있다. 도 4 는 내용 추출부에 의해 추출된 셀의 내용이 서술형으로 기재된 기일에 관한 내용으로 구성된 일 예를 보여준다. 계약의 주된 내용이 일반적인 서술형 문장으로 기술되어 있으며, 이 내용의 의미를 자연어 처리를 통해 분석하면 기일에 관한 내용이 포함되어 있음을 알 수 있다. 구체적으로 도 4 의 내용은, 이자의 지급 기 일(Payment Date)은 반기에 한 번으로 하되 5월 1일 이후 및 11월 1일 이후의 첫 번째 영업일로 정하고, 2019년 5월 1일부터 2021년 5월 1일까지의 기간으로 한다는 것이다. 이 내용을 자연어 분석을 통해 분석함으로써 지급 기일을 구체적인 날짜로 결정할 수 있다. 이때 자연어 처리부는 달력 정보를 반영하여 기일을 도출할 수 있다. 구체적으로는, 자연어 처리부는 별도로 마련되는 달력 정보를 조회하여 주말과 공휴일을 제외한 날짜를 영업일로 설정함으로써, \"첫 번째 영업 일\"을 도출한다. 나아가, 금융거래 계약서상의 계약 당사자의 국적이 상이한 경우에는 상대방 당사자의 공휴일 을 영업일에서 제외하는 방식으로 자연어 분석에 의한 기일 결정 프로세스에 반영할 수 있다. 이러한 과정을 거쳐, 2019.11.4., 2020.5.4., 2020.11.2., 2021.5.3.의 네 번의 지급 기일이 자연어 분석을 통해 결정되고, 자연어 처리부는 이 날짜를 기일로서 출력한다. 상기와 같은 구성의 시스템에서 데이터 추출부에 의해 최종적으로 추출된 데이터는 로데이터(raw data)로서 금융거래 계약서 관리 시스템(도시되지 않음)에 제공된다. 이때 관리 시스템에 제공되는 데이터는 로데이터로부터 가공되어 관리 시스템 자체에서 요구되는 데이터 포맷으로 변환되어 제공될 수 있다. 관리 시 스템은 이와 같이 제공받은 데이터를 자신의 시스템 내에 관리 대상 데이터로서 저장함으로써, 계약서의 주된 내용이 관리 시스템에 자동으로 입력된다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0031237", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 계약 내용의 추출 대상이 되는 계약서 내의 일반 테이블의 일 예를 도시한 도면. 도 2 및 도 3 은 계약 내용의 추출 대상이 되는 계약서 내의 특이 테이블의 일 예를 도시한 도면. 도 4 는 본 발명에 따른 시스템의 블록도. 도 5 는 추출된 내용 중 자연어 처리 대상이 되는 문장의 예와 함께 이 문장에서 추출된 내용을 도시한 도면."}
