{"patent_id": "10-2019-0136432", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0051319", "출원번호": "10-2019-0136432", "발명의 명칭": "인공 지능 장치", "출원인": "엘지전자 주식회사", "발명자": "이상석"}}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공 지능 장치에 있어서,디스플레이 장치와 통신을 수행하는 통신부; 및상기 통신부를 통해 상기 디스플레이 장치로부터, 시청 정보 및 검색 명령어에 상응하는 음성 데이터를 수신하고, 수신된 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터의 의도를 나타내는 제1 쿼리를 획득하고, 상기 시청 정보에 기초하여, 상기 제1 쿼리를 제2 쿼리로 변환하고, 변환된 제2 쿼리에 상응하는 검색결과를 획득하고, 획득된 검색 결과를 상기 디스플레이 장치에 전송하는 프로세서를 포함하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 시청 정보는상기 디스플레이 장치 상에 표시된 검색 결과 UI에 포함된 컨텐트 정보, 상기 디스플레이 장치에서 시청 중인프로그램의 정보, 사용자가 이전에 발화한 이전 검색어 중 하나 이상을 포함하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 컨텐트 정보는상기 검색 결과 UI에 포함된 복수의 컨텐트 항목들 각각에 대응하는 복수의 타이틀들을 포함하는 타이틀리스트, 복수의 컨텐트 항목들 중 포커스된 항목의 타이틀, 컨텐트 항목들의 배치 관계 중 하나 이상을 포함하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 프로세서는상기 디스플레이 장치 상에 상기 검색 결과 UI가 표시되고, 상기 제1 쿼리가 복수의 컨텐트 항목들 중 N 번째컨텐트 항목을 나타내는 쿼리인 경우, 상기 컨텐트 정보에 기초하여, 상기 N 번째 컨텐트 항목을 추출하고, 상기 N 번째 컨텐트 항목의 타이틀을 이용하여, 상기 제1 쿼리를 상기 제2 쿼리로 변환하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 프로세서는상기 디스플레이 장치 상에 상기 검색 결과 UI가 표시되고, 상기 복수의 컨텐트 항목들 중 포커스된 항목이 존재하는 경우, 포커스된 컨텐트 항목을 추출하고,공개특허 10-2021-0051319-3-상기 추출된 컨텐트 항목의 타이틀을 이용하여, 상기 제1 쿼리를 상기 제2 쿼리로 변환하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 프로세서는상기 디스플레이 장치 상에 상기 검색 결과 UI가 표시되지 않은 경우, 상기 이전 검색어를 이용하여, 상기 제1쿼리를 상기 제2 쿼리로 변환하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제4항에 있어서,상기 프로세서는상기 디스플레이 장치로부터 추가 검색 명령어에 상응하는 음성 데이터를 수신하고, 수신된 음성 데이터를 텍스트 데이터로 변환하고,상기 N 번째 컨텐트 항목에 대해 변환된 텍스트 데이터의 의도를 반영하는 추가 검색 결과를 획득하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는상기 N 번째 컨텐트 항목의 선택을 해제하는 의도를 반영한 명령어를 상기 디스플레이 장치로부터 수신한 경우,상기 N 번째 컨텐트 항목의 선택을 해제하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 프로세서는복수의 AI 에이전트들 중 상기 제2 검색 쿼리에 상응하는 검색을 수행할 AI 에이전트를 결정하고, 결정된 AI 에이전트로부터, 상기 제2 검색 쿼리에 상응하는 상기 검색 결과를 획득하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제1 AI 에이전트 및 상기 제2 AI 에이전트 각각은 음성 인식 서비스를 제공하는 주체를 나타내는 에이전트인인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "인공 지능 장치에 있어서,디스플레이 장치와 통신을 수행하는 통신부; 및상기 통신부를 통해 상기 디스플레이 장치로부터, 오브젝트의 정보 및 음성 명령어에 상응하는 음성 데이터를공개특허 10-2021-0051319-4-수신하고, 수신된 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터의 의도를 나타내는 제1 쿼리를 획득하고, 상기 오브젝트의 정보에 기초하여, 상기 제1 쿼리를 제2 쿼리로 변환하고, 변환된 제2 쿼리에 상응하는 의도 수행 결과를 획득하고, 획득된 의도 수행 결과를 상기 디스플레이 장치에 전송하는 프로세서를 포함하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 오브젝트의 정보는상기 디스플레이 장치 상에 표시된 프로그램 영상에 포함된 오브젝트를 식별하기 위한 명칭인인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는상기 제1 쿼리에 상기 오브젝트의 명칭을 결합하여, 상기 제2 쿼리를 생성하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 프로세서는복수의 AI 에이전트들 중 어느 하나에 상기 제2 쿼리를 전송하고, 상기 제2 쿼리에 상응하는 상기 의도 수행 결과를 획득하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 의도 수행 결과는상기 오브젝트의 상세 검색 정보를 포함하는인공 지능 장치."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 실시 예에 따른 인공 지능 장치는 디스플레이 장치로부터 시청 정보 및 검색 명령어에 상응하는 음성 데이터를 수신하고, 수신된 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터의 의도를 나타내는 제1 쿼리를 획득하고, 상기 시청 정보에 기초하여, 상기 제1 쿼리를 제2 쿼리로 변환하고, 변환된 제2 쿼리에 상 응하는 검색 결과를 획득하고, 획득된 검색 결과를 상기 디스플레이 장치에 전송할 수 있다."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 복수의 인공 지능 에이전트들을 통해 음성 인식 서비스를 제공할 수 있는 것과 관련이 있다."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "유선 또는 무선 통신망을 이용한 디지털 TV 서비스가 보편화되고 있다. 디지털 TV 서비스는 기존의 아날로그 방 송 서비스에서는 제공할 수 없었던 다양한 서비스를 제공할 수 있다. 예를 들어, 디지털 TV 서비스의 종류인 IPTV(Internet Protocol Television), smart TV 서비스의 경우 사용자 로 하여금 시청 프로그램의 종류, 시청 시간 등을 능동적으로 선택할 수 있도록 하는 양방향성을 제공한다. IPTV, smart TV서비스는 이러한 양방향성을 기반으로 하여 다양한 부가 서비스, 예컨대 인터넷 검색, 홈쇼핑, 온라인 게임 등을 제공할 수도 있다. 최근에는 인공 지능을 이용하여, 사용자의 발화를 인식하고, 이에 맞는 음성 인식 서비스를 제공하는 기술이 많 이 등장하고 있다. 일반적으로, 디스플레이 장치는 음성 인식 서비스를 제공할 수 있는 복수의 인공 지능(Artificial Intelligence, AI) 에이전트들이 탑재되어 있다. 종래에는 복수의 AI 에이전트들은 사용자가 시청 중인 프로그램 정보와 연관된 정보 또는 쿼리를 제공하였다. 그러나, 연관된 정보 또는 쿼리는 이전에 사용자가 검색한 검색어와 연동되는 제한적인 범위로, 제공되었다. 예를 들어, 이전 검색어가 <날씨>인 경우, 사용자의 발화를 유도하는 연속 쿼리인 <내일은>이라는 연관 정보가 되는데, 그쳤다. 즉, 종래의 멀티 AI 에이전트를 통한 서비스에서, 이전 검색어와 연동되는 정보의 제공이 제한된 범위에 그쳐, 다양하고, 연속적인 정보 검색에 불편함이 있었다."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 사용자의 발화를 통해, 다양한 정보의 검색을 연속적으로 수행할 수 있도록 하는 것에 그 목적이 있 다. 본 개시는 멀티 AI 에이전트를 통해 음성 인식 서비스를 제공할 시, 각 AI 에이전트의 검색 결과를 이용하여, 연속적인 정보의 검색이 가능하도록 한 것에 그 목적이 있다."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예에 따른 인공 지능 장치는 디스플레이 장치로부터 시청 정보 및 검색 명령어에 상응하는 음성 데이터를 수신하고, 수신된 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터의 의도를 나타내는 제1 쿼리를 획득하고, 상기 시청 정보에 기초하여, 상기 제1 쿼리를 제2 쿼리로 변환하고, 변환된 제2 쿼리에 상응하는 검색 결과를 획득하고, 획득된 검색 결과를 상기 디스플레이 장치에 전송할 수 있다. 본 개시의 또 다른 실시 예에 따른 인공 지능 장치는 디스플레이 장치로부터, 오브젝트의 정보 및 음성 명령어 에 상응하는 음성 데이터를 수신하고, 수신된 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터 의 의도를 나타내는 제1 쿼리를 획득하고, 상기 오브젝트의 정보에 기초하여, 상기 제1 쿼리를 제2 쿼리로 변환 하고, 변환된 제2 쿼리에 상응하는 의도 수행 결과를 획득하고, 획득된 의도 수행 결과를 상기 디스플레이 장치 에 전송할 수 있다."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시 예에 따르면, 다양한 정보의 검색이 자연스럽게 연속적으로 수행되어, 사용자는 정보 검 색의 향상된 경험을 느낄 수 있다."}
{"patent_id": "10-2019-0136432", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시와 관련된 실시 예에 대하여 도면을 참조하여 보다 상세하게 설명한다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 본 개시의 실시예에 따른 디스플레이 장치는, 예를 들어 방송 수신 기능에 컴퓨터 지원 기능을 추가한 지능형 디스플레이 장치로서, 방송 수신 기능에 충실하면서도 인터넷 기능 등이 추가되어, 수기 방식의 입력 장치, 터 치 스크린 또는 공간 리모콘 등 보다 사용에 편리한 인터페이스를 갖출 수 있다. 그리고, 유선 또는 무선 인터 넷 기능의 지원으로 인터넷 및 컴퓨터에 접속되어, 이메일, 웹브라우징, 뱅킹 또는 게임 등의 기능도 수행가능 하다. 이러한 다양한 기능을 위해 표준화된 범용 OS가 사용될 수 있다. 따라서, 본 개시에서 기술되는 디스플레이 장치는, 예를 들어 범용의 OS 커널 상에, 다양한 애플리케이션이 자 유롭게 추가되거나 삭제 가능하므로, 사용자 친화적인 다양한 기능이 수행될 수 있다. 상기 디스플레이 장치는, 보다 구체적으로 예를 들면, 네트워크 TV, HBBTV, 스마트 TV, LED TV, OLED TV 등이 될 수 있으며, 경우에 따라 스마트폰에도 적용 가능하다. 도 1은 본 개시의 일 실시예에 따른 디스플레이 장치의 구성을 블록도로 도시한 것이다. 도 1을 참조하면, 디스플레이 장치는 방송 수신부, 외부장치 인터페이스부, 저장부, 사용 자입력 인터페이스부, 제어부, 무선 통신부, 디스플레이부, 오디오 출력부, 전원공급 부를 포함할 수 있다. 방송 수신부는 튜너, 복조부 및 네트워크 인터페이스부를 포함할 수 있다. 튜너는 채널 선국 명령에 따라 특정 방송 채널을 선국할 수 있다. 튜너는 선국된 특정 방송 채널에 대한 방송 신호를 수신할 수 있다. 복조부는 수신한 방송 신호를 비디오 신호, 오디오 신호, 방송 프로그램과 관련된 데이터 신호로 분리할 수 있고, 분리된 비디오 신호, 오디오 신호 및 데이터 신호를 출력이 가능한 형태로 복원할 수 있다. 외부장치 인터페이스부는 인접하는 외부 장치 내의 애플리케이션 또는 애플리케이션 목록을 수신하여, 제 어부 또는 저장부로 전달할 수 있다. 외부장치 인터페이스부는 디스플레이 장치와 외부 장치 간의 연결 경로를 제공할 수 있다. 외부장치 인터페이스부는 디스플레이 장치에 무선 또는 유선으로 연결된 외부장치로부터 출력된 영상, 오디오 중 하나 이상을 수신하여, 제어부로 전달할 수 있다. 외부장치 인터페이스부는 복수의 외부 입력 단 자들을 포함할 수 있다. 복수의 외부 입력 단자들은 RGB 단자, 하나 이상의 HDMI(High Definition Multimedia Interface) 단자, 컴포넌트(Component) 단자를 포함할 수 있다. 외부장치 인터페이스부를 통해 입력된 외부장치의 영상 신호는 디스플레이부를 통해 출력될 수 있다. 외부장치 인터페이스부를 통해 입력된 외부장치의 음성 신호는 오디오 출력부를 통해 출력될 수 있다. 외부장치 인터페이스부에 연결 가능한 외부 장치는 셋톱박스, 블루레이 플레이어, DVD 플레이어, 게임기, 사운드 바, 스마트폰, PC, USB 메모리, 홈 씨어터 중 어느 하나일 수 있으나, 이는 예시에 불과하다.네트워크 인터페이스부는 디스플레이 장치를 인터넷망을 포함하는 유/무선 네트워크와 연결하기 위한 인터페이스를 제공할 수 있다. 네트워크 인터페이스부는 접속된 네트워크 또는 접속된 네트워크에 링크된 다른 네트워크를 통해, 다른 사용자 또는 다른 전자 기기와 데이터를 송신 또는 수신할 수 있다. 또한, 디스플레이 장치에 미리 등록된 다른 사용자 또는 다른 전자 기기 중 선택된 사용자 또는 선택된 전 자기기에, 디스플레이 장치에 저장된 일부의 컨텐츠 데이터를 송신할 수 있다. 네트워크 인터페이스부는 접속된 네트워크 또는 접속된 네트워크에 링크된 다른 네트워크를 통해, 소정 웹 페이지에 접속할 수 있다. 즉, 네트워크를 통해 소정 웹 페이지에 접속하여, 해당 서버와 데이터를 송신 또는 수신할 수 있다. 그리고, 네트워크 인터페이스부는 컨텐츠 제공자 또는 네트워크 운영자가 제공하는 컨텐츠 또는 데이터들 을 수신할 수 있다. 즉, 네트워크 인터페이스부는 네트워크를 통하여 컨텐츠 제공자 또는 네트워크 제공자 로부터 제공되는 영화, 광고, 게임, VOD, 방송 신호 등의 컨텐츠 및 그와 관련된 정보를 수신할 수 있다. 또한, 네트워크 인터페이스부는 네트워크 운영자가 제공하는 펌웨어의 업데이트 정보 및 업데이트 파일을 수신할 수 있으며, 인터넷 또는 컨텐츠 제공자 또는 네트워크 운영자에게 데이터들을 송신할 수 있다. 네트워크 인터페이스부는 네트워크를 통해, 공중에 공개(open)된 애플리케이션들 중 원하는 애플리케이션 을 선택하여 수신할 수 있다. 저장부는 제어부 내의 각 신호 처리 및 제어를 위한 프로그램이 저장하고, 신호 처리된 영상, 음성 또는 데이터신호를 저장할 수 있다. 또한, 저장부는 외부장치 인터페이스부 또는 네트워크 인터페이스부로부터 입력되는 영상, 음성, 또는 데이터 신호의 임시 저장을 위한 기능을 수행할 수도 있으며, 채널 기억 기능을 통하여 소정 이미지 에 관한 정보를 저장할 수도 있다. 저장부는 외부장치 인터페이스부 또는 네트워크 인터페이스부로부터 입력되는 애플리케이션 또 는 애플리케이션 목록을 저장할 수 있다. 디스플레이 장치는 저장부 내에 저장되어 있는 컨텐츠 파일(동영상 파일, 정지영상 파일, 음악 파일, 문서 파일, 애플리케이션 파일 등)을 재생하여 사용자에게 제공할 수 있다. 사용자입력 인터페이스부는 사용자가 입력한 신호를 제어부로 전달하거나, 제어부로부터의 신호 를 사용자에게 전달할 수 있다. 예를 들어, 사용자입력 인터페이스부는 블루투스(Bluetooth), WB(Ultra Wideband), 지그비(ZigBee) 방식, RF(Radio Frequency) 통신 방식 또는 적외선(IR) 통신 방식 등 다양한 통신 방식에 따라, 원격제어장치로부터 전원 온/오프, 채널 선택, 화면 설정 등의 제어 신호를 수신하여 처리하 거나, 제어부로부터의 제어 신호를 원격제어장치로 송신하도록 처리할 수 있다. 또한, 사용자입력 인터페이스부는, 전원키, 채널키, 볼륨키, 설정치 등의 로컬키(미도시)에서 입력되는 제 어 신호를 제어부에 전달할 수 있다. 제어부에서 영상 처리된 영상 신호는 디스플레이부로 입력되어 해당 영상 신호에 대응하는 영상으로 표시될 수 있다. 또한, 제어부에서 영상 처리된 영상 신호는 외부장치 인터페이스부를 통하여 외부 출력장치로 입력될 수 있다. 제어부에서 처리된 음성 신호는 오디오 출력부로 오디오 출력될 수 있다. 또한, 제어부에서 처 리된 음성 신호는 외부장치 인터페이스부를 통하여 외부 출력장치로 입력될 수 있다. 그 외, 제어부는, 디스플레이 장치 내의 전반적인 동작을 제어할 수 있다. 또한, 제어부는 사용자입력 인터페이스부를 통하여 입력된 사용자 명령 또는 내부 프로그램에 의하여 디스플레이 장치를 제어할 수 있으며, 네트워크에 접속하여 사용자가 원하는 애플리케이션 또는 애플리케 이션 목록을 디스플레이 장치 내로 다운받을 수 있도록 할 수 있다. 제어부는 사용자가 선택한 채널 정보 등이 처리한 영상 또는 음성신호와 함께 디스플레이부 또는 오 디오 출력부를 통하여 출력될 수 있도록 한다. 또한, 제어부는 사용자입력 인터페이스부를 통하여 수신한 외부장치 영상 재생 명령에 따라, 외부장 치 인터페이스부를 통하여 입력되는 외부 장치, 예를 들어, 카메라 또는 캠코더로부터의, 영상 신호 또는 음성 신호가 디스플레이부 또는 오디오 출력부를 통해 출력될 수 있도록 한다. 한편, 제어부는 영상을 표시하도록 디스플레이부를 제어할 수 있으며, 예를 들어 튜너를 통해 입력되는 방송 영상, 또는 외부장치 인터페이스부를 통해 입력되는 외부 입력 영상, 또는 네트워크 인터페 이스부를 통해 입력되는 영상, 또는 저장부에 저장된 영상이 디스플레이부에서 표시되도록 제어할 수 있다. 이 경우, 디스플레이부에 표시되는 영상은 정지 영상 또는 동영상일 수 있으며, 2D 영상 또는 3D 영 상일 수 있다. 또한, 제어부는 디스플레이 장치 내에 저장된 컨텐츠, 또는 수신된 방송 컨텐츠, 외부로 부터 입력되 는 외부 입력 컨텐츠가 재생되도록 제어할 수 있으며, 상기 컨텐츠는 방송 영상, 외부 입력 영상, 오디오 파일, 정지 영상, 접속된 웹 화면, 및 문서 파일 등 다양한 형태일 수 있다. 무선 통신부는 유선 또는 무선 통신을 통해 외부 기기와 통신을 수행할 수 있다. 무선 통신부는 외부 기기와 근거리 통신(Short range communication)을 수행할 수 있다. 이를 위해, 무선 통신부는 블루투스 (Bluetooth™), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra Wideband), ZigBee, NFC(Near Field Communication), Wi-Fi(Wireless-Fidelity), Wi-Fi Direct, Wireless USB(Wireless Universal Serial Bus) 기술 중 적어도 하나를 이용하여, 근거리 통신을 지원할 수 있 다. 이러한, 무선 통신부는 근거리 무선 통신망(Wireless Area Networks)을 통해 디스플레이 장치와 무선 통신 시스템 사이, 디스플레이 장치와 다른 디스플레이 장치 사이, 또는 디스플레이 장치 와 디스플레이 장치(100, 또는 외부서버)가 위치한 네트워크 사이의 무선 통신을 지원할 수 있다. 근거리 무선 통신망은 근거리 무선 개인 통신망(Wireless Personal Area Networks)일 수 있다. 여기에서, 다른 디스플레이 장치는 본 개시에 따른 디스플레이 장치와 데이터를 상호 교환하는 것이 가능한(또는 연동 가능한) 웨어러블 디바이스(wearable device, 예를 들어, 스마트워치(smartwatch), 스마트 글 래스(smart glass), HMD(head mounted display)), 스마트 폰과 같은 이동 단말기가 될 수 있다. 무선 통신부 는 디스플레이 장치 주변에, 통신 가능한 웨어러블 디바이스를 감지(또는 인식)할 수 있다. 나아가, 제어부는 감지된 웨어러블 디바이스가 본 개시에 따른 디스플레이 장치와 통신하도록 인증된 디바이 스인 경우, 디스플레이 장치에서 처리되는 데이터의 적어도 일부를, 무선 통신부를 통해 웨어러블 디 바이스로 송신할 수 있다. 따라서, 웨어러블 디바이스의 사용자는, 디스플레이 장치에서 처리되는 데이터 를, 웨어러블 디바이스를 통해 이용할 수 있다. 디스플레이부는 제어부에서 처리된 영상 신호, 데이터 신호, OSD 신호 또는 외부장치 인터페이스부 에서 수신되는 영상 신호, 데이터 신호 등을 각각 R,G,B 신호로 변환하여 구동 신호를 생성할 수 있다. 한편, 도 1에 도시된 디스플레이 장치는 본 개시의 일실시예에 불과하므로. 도시된 구성요소들 중 일부는 실제 구현되는 디스플레이 장치의 사양에 따라 통합, 추가, 또는 생략될 수 있다. *56즉, 필요에 따라 2 이상의 구성요소가 하나의 구성요소로 합쳐지거나, 혹은 하나의 구성요소가 2 이상의 구 성요소로 세분되어 구성될 수 있다. 또한, 각 블록에서 수행하는 기능은 본 개시의 실시예를 설명하기 위한 것 이며, 그 구체적인 동작이나 장치는 본 개시의 권리범위를 제한하지 아니한다. 본 개시의 또 다른 실시예에 따르면, 디스플레이 장치는 도 1에 도시된 바와 달리, 튜너와 복조부 를 구비하지 않고 네트워크 인터페이스부 또는 외부장치 인터페이스부를 통해서 영상을 수신하 여 재생할 수도 있다. 예를 들어, 디스플레이 장치는 방송 신호 또는 다양한 네트워크 서비스에 따른 컨텐츠들을 수신하기 위한 등과 같은 셋탑 박스 등과 같은 영상 처리 장치와 상기 영상 처리 장치로부터 입력되는 컨텐츠를 재생하는 컨텐 츠 재생 장치로 분리되어 구현될 수 있다. 이 경우, 이하에서 설명할 본 개시의 실시예에 따른 디스플레이 장치의 동작 방법은 도 1을 참조하여 설명한 바 와 같은 디스플레이 장치뿐 아니라, 상기 분리된 셋탑 박스 등과 같은 영상 처리 장치 또는 디스플레이부 및 오디오출력부를 구비하는 컨텐츠 재생 장치 중 어느 하나에 의해 수행될 수도 있다. 다음으로, 도 2 내지 도 3을 참조하여, 본 개시의 일 실시 예에 따른 원격제어장치에 대해 설명한다. 도 2은 본 개시의 일 실시 예에 따른 원격제어장치의 블록도이고, 도 3은 본개시의 일 실시 예에 따른 원격제어 장치의 실제 구성 예를 보여준다. 먼저, 도 2를 참조하면, 원격제어장치는 지문인식부, 무선통신부, 사용자 입력부, 센서부 , 출력부, 전원공급부, 저장부, 제어부, 음성 획득부를 포함할 수 있다. 도 2을 참조하면, 무선통신부는 전술하여 설명한 본 개시의 실시 예들에 따른 디스플레이 장치 중 임의의 어느 하나와 신호를 송수신한다. 원격제어장치는 RF 통신규격에 따라 디스플레이 장치와 신호를 송수신할 수 있는 RF 모듈을 구 비하며, IR 통신규격에 따라 디스플레이 장치와 신호를 송수신할 수 있는 IR 모듈을 구비할 수 있다. 또한, 원격제어장치는 블루투스 통신규격에 따라 디스플레이 장치와 신호를 송수신할 수 있는 블루투 스 모듈를 구비할 수 있다. 또한, 원격제어장치는 NFC(Near Field Communication) 통신 규격에 따라 디스플레이 장치와 신호를 송수할 수 있는 NFC 모듈을 구비하며, WLAN(Wireless LAN) 통신 규격에 따 라 디스플레이 장치와 신호를 송수신할 수 있는 WLAN 모듈을 구비할 수 있다. 또한, 원격제어장치는 디스플레이 장치로 원격제어장치의 움직임 등에 관한 정보가 담긴 신호를 무선 통신부를 통해 전송한다. 한편, 원격제어장치는 디스플레이 장치가 전송한 신호를 RF 모듈을 통하여 수신할 수 있으며, 필요에 따라 IR 모듈을 통하여 디스플레이 장치로 전원 온/오프, 채널 변경, 볼륨 변경 등에 관한 명 령을 전송할 수 있다. 사용자 입력부는 키패드, 버튼, 터치 패드, 또는 터치 스크린 등으로 구성될 수 있다. 사용자는 사용자 입 력부를 조작하여 원격제어장치으로 디스플레이 장치와 관련된 명령을 입력할 수 있다. 사용자 입력부가 하드키 버튼을 구비할 경우 사용자는 하드키 버튼의 푸쉬 동작을 통하여 원격제어장치으로 디스플레이 장치와 관련된 명령을 입력할 수 있다. 이에 대해서는 도 3을 참조하여 설명한다. 도 3을 참조하면, 원격제어장치는 복수의 버튼을 포함할 수 있다. 복수의 버튼은 지문 인식 버튼, 전 원 버튼, 홈 버튼, 라이브 버튼, 외부 입력 버튼, 음량 조절 버튼, 음성 인식 버튼 , 채널 변경 버튼, 확인 버튼 및 뒤로 가기 버튼을 포함할 수 있다. 지문 인식 버튼은 사용자의 지문을 인식하기 위한 버튼일 수 있다. 일 실시예로, 지문 인식 버튼은 푸쉬 동작이 가능하여, 푸쉬 동작 및 지문 인식 동작을 수신할 수도 있다. 전원 버튼은 디스플레이 장치 의 전원을 온/오프 하기 위한 버튼일 수 있다. 홈 버튼은 디스플레이 장치의 홈 화면으로 이동 하기 위한 버튼일 수 있다. 라이브 버튼은 실시간 방송 프로그램을 디스플레이 하기 위한 버튼일 수 있다. 외부 입력 버튼은 디스플레이 장치에 연결된 외부 입력을 수신하기 위한 버튼일 수 있다. 음량 조절 버튼은 디스플레이 장치가 출력하는 음량의 크기를 조절하기 위한 버튼일 수 있다. 음성 인식 버튼 은 사용자의 음성을 수신하고, 수신된 음성을 인식하기 위한 버튼일 수 있다. 채널 변경 버튼은 특정 방송 채널의 방송 신호를 수신하기 위한 버튼일 수 있다. 확인 버튼은 특정 기능을 선택하기 위한 버튼일 수 있고, 뒤로 가기 버튼은 이전 화면으로 되돌아가기 위한 버튼일 수 있다. 다시 도 2를 설명한다. 사용자 입력부가 터치스크린을 구비할 경우 사용자는 터치스크린의 소프트키를 터치하여 원격제어장치 로 디스플레이 장치와 관련된 명령을 입력할 수 있다. 또한, 사용자 입력부는 스크롤 키나, 조 그 키 등 사용자가 조작할 수 있는 다양한 종류의 입력수단을 구비할 수 있으며 본 실시 예는 본 개시의 권리범 위를 제한하지 아니한다. 센서부는 자이로 센서 또는 가속도 센서를 구비할 수 있으며, 자이로 센서는 원격제어장치 의 움직임에 관한 정보를 센싱할 수 있다. 예를 들어, 자이로 센서는 원격제어장치의 동작에 관한 정보를 x,y,z 축을 기준으로 센싱할 수 있으 며, 가속도 센서는 원격제어장치의 이동속도 등에 관한 정보를 센싱할 수 있다. 한편, 원격제어장치 는 거리측정센서를 더 구비할 수 있어, 디스플레이 장치의 디스플레이부와의 거리를 센싱할 수 있다. 출력부는 사용자 입력부의 조작에 대응하거나 디스플레이 장치에서 전송한 신호에 대응하는 영 상 또는 음성 신호를 출력할 수 있다. 출력부를 통하여 사용자는 사용자 입력부의 조작 여부 또는 디스플레이 장치의 제어 여부를 인지할 수 있다. 예를 들어, 출력부는 사용자 입력부가 조작되거나 무선 통신부를 통하여 디스플레이 장치 와 신호가 송수신되면 점등되는 LED 모듈, 진동을 발생하는 진동 모듈, 음향을 출력하는 음향 출력 모듈, 또는 영상을 출력하는 디스플레이 모듈을 구비할 수 있다. 또한, 전원공급부는 원격제어장치으로 전원을 공급하며, 원격제어장치이 소정 시간 동안 움직이 지 않은 경우 전원 공급을 중단함으로서 전원 낭비를 줄일 수 있다. 전원공급부는 원격제어장치에 구 비된 소정 키가 조작된 경우에 전원 공급을 재개할 수 있다. 저장부는 원격제어장치의 제어 또는 동작에 필요한 여러 종류의 프로그램, 애플리케이션 데이터 등이 저장될 수 있다. 만일 원격제어장치가 디스플레이 장치와 RF 모듈을 통하여 무선으로 신호를 송수신할 경우 원격제어장치과 디스플레이 장치는 소정 주파수 대역을 통하여 신호를 송수신한다. 원격제어장치의 제어부는 원격제어장치과 페어링된 디스플레이 장치와 신호를 무선으로 송 수신할 수 있는 주파수 대역 등에 관한 정보를 저장부에 저장하고 참조할 수 있다. 제어부는 원격제어장치의 제어에 관련된 제반사항을 제어한다. 제어부는 사용자 입력부의 소정 키 조작에 대응하는 신호 또는 센서부에서 센싱한 원격제어장치의 움직임에 대응하는 신호를 무 선 통신부를 통하여 디스플레이 장치로 전송할 수 있다. 또한, 원격제어장치의 음성 획득부는 음성을 획득할 수 있다. 음성 획득부는 적어도 하나 이상의 마이크을 포함할 수 있고, 마이크를 통해 음성을 획득할 수 있다. 다음으로 도 4를 설명한다. 도 4는 본 개시의 실시 예에 따라 원격 제어 장치를 활용하는 예를 보여준다. 도 4의 (a)는 원격 제어 장치에 대응하는 포인터가 디스플레이부에 표시되는 것을 예시한다. 사용자는 원격 제어 장치를 상하, 좌우로 움직이거나 회전할 수 있다. 디스플레이 장치의 디스플레이 부에 표시된 포인터는 원격 제어 장치의 움직임에 대응한다. 이러한 원격 제어 장치는, 도 면과 같이, 3D 공간 상의 움직임에 따라 해당 포인터가 이동되어 표시되므로, 공간 리모콘이라 명명할 수 있다. 도 4의 (b)는 사용자가 원격 제어 장치를 왼쪽으로 이동하면, 디스플레이 장치의 디스플레이부 에 표시된 포인터도 이에 대응하여 왼쪽으로 이동하는 것을 예시한다. 원격 제어 장치의 센서를 통하여 감지된 원격 제어 장치의 움직임에 관한 정보는 디스플레이 장치 로 전송된다. 디스플레이 장치는 원격 제어 장치의 움직임에 관한 정보로부터 포인터의 좌 표를 산출할 수 있다. 디스플레이 장치는 산출한 좌표에 대응하도록 포인터를 표시할 수 있다. 도 4의 (c)는, 원격 제어 장치 내의 특정 버튼을 누른 상태에서, 사용자가 원격 제어 장치를 디스플 레이부에서 멀어지도록 이동하는 경우를 예시한다. 이에 의해, 포인터에 대응하는 디스플레이부 내의 선택 영역이 줌인되어 확대 표시될 수 있다. 이와 반대로, 사용자가 원격 제어 장치를 디스플레이부에 가까워지도록 이동하는 경우, 포인터 에 대응하는 디스플레이부 내의 선택 영역이 줌아웃되어 축소 표시될 수 있다. 한편, 원격 제어 장치가 디스플레이부에서 멀어지는 경우, 선택 영역이 줌아웃되고, 원격 제어 장치 가 디스플레이부에 가까워지는 경우, 선택 영역이 줌인될 수도 있다. 또한, 원격 제어 장치 내의 특정 버튼을 누른 상태에서는 상하, 좌우 이동의 인식이 배제될 수 있다. 즉, 원격 제어 장치가 디스플레이부에서 멀어지거나 접근하도록 이동하는 경우, 상, 하, 좌, 우 이동은 인식되지 않고, 앞뒤 이동만 인식되도록 할 수 있다. 원격 제어 장치 내의 특정 버튼을 누르지 않은 상태 에서는, 원격 제어 장치의 상, 하, 좌, 우 이동에 따라 포인터만 이동하게 된다. 한편, 포인터의 이동속도나 이동방향은 원격 제어 장치의 이동속도나 이동방향에 대응할 수 있다. 한편, 본 명세서에서의 포인터는, 원격 제어 장치의 동작에 대응하여, 디스플레이부에 표시되는 오브 젝트를 의미한다. 따라서, 포인터로 도면에 도시된 화살표 형상 외에 다양한 형상의 오브젝트가 가능하다. 예를 들어, 점, 커서, 프롬프트, 두꺼운 외곽선 등을 포함하는 개념일 수 있다. 그리고, 포인터 가 디스플레이부 상의 가로축과 세로축 중 어느 한 지점(point)에 대응하여 표시되는 것은 물론, 선 (line), 면(surface) 등 복수 지점에 대응하여 표시되는 것도 가능하다. 도 5는 본 개시의 일 실시 예에 따른 AI 서버의 구성을 설명하는 블록도이다. 도 5를 참조하면, AI(Artificial Intelligence) 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습 시키거나 학습된 인공 신경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행할 수도 있고, 5G 네트워크로 정의될 수 있 다. 이때, AI 서버는 디스플레이 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함 께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 디스플레이 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부(63-1)를 포함할 수 있다. 모델 저장부(63-1)는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 63-2)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(63-2)을 학습시킬 수 있다. 학습 모델은 인공 신경망 의 AI 서버에 탑재된 상태에서 이용되거나, 디스플레이 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리(6 3)에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 6은 본 개시의 또 다른 실시 예에 따른 인공 지능 시스템의 구성을 설명하기 위한 도면이다. 도 6을 참조하면, 인공 지능 시스템은 디스플레이 장치, 데이터 변환 서버, NLP 서버를 포함 할 수 있다. 디스플레이 장치는 사용자가 발화한 음성 명령어에 상응하는 음성 데이터를 데이터 변환 서버에 전송 할 수 있다. 데이터 변환 서버는 디스플레이 장치로부터, 음성 데이터를 수신할 수 있다. 데이터 변환 서버 는 수신된 음성 데이터를 텍스트 데이터로 변환할 수 있다. 데이터 변환 서버는 NLP 서버로부터 수신된 텍스트 형태의 의도 수행 결과를 오디오 형태의 음성 데 이터로 변환하고, 변환된 음성 데이터를 디스플레이 장치에 전송할 수 있다. 데이터 변환 서버는 AI 에이전트 변경을 나타내는 음성 데이터를 디스플레이 장치에 전송할 수 있다. NLP(Natural Language Process) 서버는 제1 AI 에이전트 서버 및 제2 AI 에이전트 서버를 포함 할 수 있다. NLP 서버는 데이터 변환 서버로부터, 텍스트 데이터를 수신하고, 자연어 처리 엔진을 이용하여, 수신 된 텍스트 데이터의 의도를 분석할 수 있다. NLP 서버는 하나 이상의 AI 에이전트 서버를 포함할 수 있다. 예를 들어, NLP 서버는 제1 AI 에이전트 서버 및 제2 AI 에이전트 서버를 포함할 수 있다. 제1 AI 에이전트 서버는 디스플레이 장치의 제조 업체 이외의 제조 업체를 통해 자연어 처리 서비스 를 제공하는 서버일 수 있다. 제2 AI 에이전트 서버는 디스플레이 장치의 제조 업체를 통해 자연어 처리 서비스를 제공하는 서버일 수 있다.제1 AI 에이전트 서버 및 제2 AI 에이전트 서버 각각은 도 5에 도시된 AI 서버의 구성 요소들을 포함할 수 있다. 데이터 변환 서버는 텍스트 데이터를 제1 AI 에이전트 서버에 전송할 수 있다. 제1 AI 에이전트 서버는 텍스트 데이터의 의도를 획득하고, 획득된 의도에 상응하는 동작을 처리할 수 있 는지를 판단할 수 있다. 제1 AI 에이전트 서버는 획득된 의도에 상응하는 동작을 처리할 수 있다고 판단하는 경우, 의도에 상응하 는 의도 분석 결과를 획득할 수 있다. 제1 AI 에이전트 서버는 획득된 의도에 상응하는 동작을 처리할 수 없다고 판단하는 경우, 제2 AI 에이전 트 서버에 텍스트 데이터의 의도를 전송할 수 있다. 제2 AI 에이전트 서버는 수신된 텍스트 데이터의 의도에 상응하는 의도 분석 결과를 획득하고, 획득된 의 도 분석 결과를 제1 AI 에이전트 서버에 전송할 수 있다. 제1 AI 에이전트 서버는 의도 분석 결과를 데이터 변환 서버에 전송할 수 있다. 데이터 변환 서버는 의도 분석 결과를 디스플레이 장치의 NLP 클라이언트에 전송할 수 있다. 디스플레이 장치는 NLP 클라이언트, 음성 에이전트 및 렌더러를 더 포함할 수 있다. NLP 클라이언트, 음성 에이전트 및 렌더러는 도 1에 도시된 제어부에 포함될 수 있다. 또 다른 예로, NLP 클라이언트는 도 1에 도시된 네트워크 인터페이스부에 포함될 수 있다. NLP 클라이언트는 데이터 변환 서버와 통신을 수행할 수 있다. 음성 에이전트는 원격 제어 장치로부터 음성 인식 모드로의 진입을 위한 신호를 수신하고, 수신된 신 호에 따라 디스플레이 장치에 구비된 마이크의 동작을 활성화 시킬 수 있다. 음성 에이전트는 디스플레이 장치에 구비된 마이크로부터 수신된 음성 명령 또는 원격 제어 장치 로부터 수신된 음성 명령어를 NLP 클라이언트에 전송할 수 있다. 음성 에이전트는 NLP 클라이언트가 NLP 서버로부터 수신한 의도 분석 결과 정보 또는 검색 정보 를 전달받을 수 있다. 음성 에이전트는 의도 분석 결과 정보에 기초하여, 어플리케이션을 실행하거나, 원격 제어 장치의 버 튼 키에 대응하는 기능을 수행할 수 있다. 음성 에이전트는 NLP 클라이언트의 구성에 포함될 수도 있다. 렌더러는 수신된 검색 정보를 디스플레이부 상에 표시하기 위해 GUI 모듈을 통해, UI를 생성하고, 생 성된 UI를 디스플레이부에 출력할 수 있다. 도 7은 본 개시의 실시 예에 따른 인공 지능 시스템의 동작 방법을 위한 래더 다이어 그램이다. 이하에서는 도 5 및 도 6의 내용을 참조하여, 본 개시의 실시 예에 따른 시스템의 동작 방법을 설명한다. 또한, 이하에서, AI 에이전트는 사용자가 발화한 음성 명령어를 인식하고, 인식된 음성 명령어의 의도에 따른 정보를 제공할 수 있는 하드웨어 또는 소프트웨어일 수 있다. 디스플레이 장치 또는 NLP 서버에는 복수의 AI 에이전트들이 구비될 수 있다. 한편, 도 7의 단계들 중 일부 단계들은 동시에 수행되거나, 일부 단계들의 순서는 뒤 바뀌어 수행될 수 있다. 디스플레이 장치의 제어부는 프로그램을 디스플레이부 상에 표시한다(S701). 즉, 제어부는 프로그램을 디스플레이부를 통해 재생 중일 수 있다. 디스플레이 장치의 제어부는 검색 결과 UI가 디스플레이부 상에 표시되어 있는지를 판단한다 (S703). 검색 결과 UI는 사용자의 발화 또는 원격 제어 장치로부터 수신된 검색 명령에 따라 표시되는 검색 결과를 나타내는 사용자 인터페이스일 수 있다. 검색 결과는 프로그램과 같은 컨텐트의 검색 결과를 나타낼 수 있다. 검색 결과 UI는 검색 결과에 따른 복수의 컨텐트 항목들을 포함할 수 있다. 제어부는 사용자가 발화한 검색어 또는 원격 제어 장치로부터 검색 명령을 수신하고, 그에 따른 검색 결과를 출력한 경우, 검색 결과 UI를 표시한 것으로 판단할 수 있다. 디스플레이 장치의 제어부는 검색 결과 UI가 디스플레이부 상에 표시된 경우, 제1 시청 정보를 네트워크 인터페이스부를 통해 NLP 서버에 전송한다(S705). 제1 시청 정보는 검색 결과 UI에 포함된 컨텐트 정보, 시청 중인 프로그램의 정보, 사용자가 이전에 발화한 이 전 검색어 중 하나 이상을 포함할 수 있다. 검색 결과 UI에 포함된 컨텐트 정보는 복수의 컨텐트 항목들 각각에 대응하는 복수의 타이틀들을 포함하는 타이 틀 리스트, 복수의 컨텐트 항목들 중 포커스된 항목의 타이틀, 컨텐트 항목들의 배치 관계(또는 배치 순서) 중 하나 이상을 포함할 수 있다. 타이틀은 컨텐트 항목을 식별하는 명칭일 수 있다. 시청 중인 프로그램의 정보는 프로그램을 식별하는 정보로, 프로그램의 명칭을 포함할 수 있다. 이전 검색어는 검색 결과 UI의 표시를 유발한 사용자가 발화한 명령어일 수 있다. 이전 검색어는 디스플레이 장 치가 새로운 검색어를 수신하기 직전 수신한 검색어일 수 있다. 디스플레이 장치의 제어부는 검색 결과 UI가 디스플레이부 상에 표시되지 않은 경우, 제2 시청 정보를 네트워크 인터페이스부를 통해 NLP 서버에 전송한다(S707). 제2 시청 정보는 시청 중인 프로그램의 정보 및 사용자가 이전에 발화한 이전 검색어 중 하나 이상을 포함할 수 있다. 디스플레이 장치의 제어부는 사용자가 발화한 검색 명령어를 수신한다(S709). 일 실시 예에서, 디스플레이 장치는 마이크를 구비할 수 있고, 마이크를 통해 사용자가 발화한 검색 명령 어를 수신할 수 있다. 또 다른 실시 예에서 디스플레이 장치의 무선 통신부는 원격 제어 장치로부터 검색 명령어를 수 신할 수 있다. 즉, 사용자는 원격 제어 장치를 통해 검색 명령어를 발화하고, 발화된 검색 명령어는 원격 제어 장치를 통해 디스플레이 장치로 전달될 수 있다. 디스플레이 장치의 제어부는 검색 명령어에 상응하는 음성 데이터를 네트워크 인터페이스부를 통해 NLP 서버에 전송한다(S711). NLP 서버의 프로세서는 수신된 음성 데이터를 텍스트 데이터로 변환하여, 텍스트 데이터를 획득한다 (S713). NLP 서버는 STT 엔진을 통해, 음성 데이터를 텍스트 데이터로 변환할 수 있다. NLP 서버의 프로세서는 텍스트 데이터의 의도 분석에 따른 제1 검색 쿼리를 획득한다(S715). 제1 검색 쿼리는 사용자가 발화한 검색 명령어의 검색 의도를 반영한 쿼리일 수 있다. NLP 서버의 프로세서는 획득된 제1 시청 정보 또는 제2 시청 정보에 기반하여, 제1 검색 쿼리를 제2 검색 쿼리로 변환한다(S717). 프로세서는 디스플레이 장치로부터, 제1 시청 정보를 수신한 경우, 제1 시청 정보에 기반하여, 제1 검 색 쿼리를 제2 검색 쿼리로 변환할 수 있다. 즉, 프로세서는 디스플레이 장치가 검색 결과 UI를 표시하고 있는 경우, 제1 시청 정보에 기반하여, 제1 검색 쿼리를 제2 검색 쿼리로 변환할 수 있다. 프로세서는 디스플레이 장치로부터, 제2 시청 정보를 수신한 경우, 제2 시청 정보에 기반하여, 제1 검 색 쿼리를 제2 검색 쿼리로 변환할 수 있다.즉, 프로세서는 디스플레이 장치가가 검색 결과 UI를 표시하고 있지 않은 경우, 제2 시청 정보에 기반 하여, 제1 검색 쿼리를 제2 검색 쿼리로 변환할 수 있다. 제2 검색 쿼리는 사용자가 발화한 검색 명령어에 컨텐트의 명칭을 반영한 쿼리일 수 있다. 즉, 제1 검색 쿼리를 제2 검색 쿼리로 변환하는 것은 제1 검색 쿼리에 포함되지 않은 컨텐트 항목의 명칭을 포 함시켜, 제2 검색 쿼리를 생성하는 것을 나타낼 수 있다. 단계 S715 및 S717에 대해서는 도 8을 참조하여, 더 상세하게 설명한다. 도 8은 본 개시의 실시 예에 따라 NLP 서버가 제1 시청 정보 또는 제2 시청 정보에 기초하여, 검색 쿼리를 완성 하는 과정을 설명하는 방법을 설명하는 도면이다. 도 8은 단계 S715 및 S717을 보다 세분화한 단계들이다. 도 8을 참조하면, NLP 서버의 프로세서는 검색 명령어의 의도 분석에 따라 검색 명령어가 검색 결과 UI에 포함된 복수의 컨텐트 항목들 중 N 번째 컨텐트 항목을 나타내는 쿼리였는지를 판단한다(S801). 프로세서는 자연어 처리 엔진을 이용하여, 검색 명령어의 의도가, 특정 위치의 컨텐트 항목을 선택하는 의 도인지를 판단할 수 있다. NLP 서버의 프로세서는 검색 명령어의 의도가 N 번째 컨텐트 항목을 선택하는 쿼리인 경우, 제1 시청 정보에 포함된 타이틀 리스트에 기초하여, N 번째 컨텐트 항목을 추출한다(S803). 타이틀 리스트는 디스플레이 장치가 표시하는 검색 결과 UI에 포함된 복수의 컨텐트 항목들의 타이틀들을 포함하는 리스트일 수 있다. 프로세서는 N 번째 컨텐트 항목을 선택하는 의도에 따라, 타이틀 리스트에 포함된 N 번째 컨텐트 항목의 타 이틀을 추출할 수 있다. NLP 서버의 프로세서는 추출된 N 번째 항목의 타이틀을 이용하여, 제1 검색 쿼리를 제2 검색 쿼리로 변환한다(S805). 프로세서는 제1 검색 쿼리에 N 번째 컨텐트 항목의 타이틀을 포함시켜, 제2 검색 쿼리를 생성할 수 있다. 한편, NLP 서버의 프로세서는 검색 명령어의 의도가 N 번째 컨텐트 항목을 선택하는 쿼리가 아닌 경우, 검색 결과 UI에 포함된 복수의 컨텐트 항목들 중 포커스된 항목이 존재하는지를 판단한다(S807). 일 실시 예에서, 포커스된 컨텐트 항목은 원격 제어 장치에 의해 제어되는 포인터에 의해 선택되거나, 하이라이트 박스를 통해, 선택된 항목일 수 있다. NLP 서버의 프로세서는 포커스된 항목이 존재하는 경우, 포커스된 컨텐트 항목을 추출한다(S809). 프로세서는 제1 시청 정보로부터 포커스된 컨텐트 항목의 타이틀을 추출할 수 있다. NLP 서버의 프로세서는 추출된 컨텐트 항목의 타이틀을 이용하여, 제1 검색 쿼리를 제2 검색 쿼리로 변환한다(S811). 프로세서는 제1 검색 쿼리에 추출된 컨텐트 항목의 타이틀을 포함시켜, 제2 검색 쿼리를 생성할 수 있다. 한편, NLP 서버의 프로세서는 검색 결과 UI 상에 포커스된 컨텐트 항목이 존재하지 않는 경우, 이전 검색어가 존재하는지를 판단한다(S813). 프로세서는 검색 명령어의 의도가, N 번째 컨텐트 항목의 선택도 아니고, 포커스된 컨텐트 항목도 없는 경 우, 제2 시청 정보에 기초하여, 이전 검색어가 존재하는지를 판단할 수 있다. NLP 서버의 프로세서는 이전 검색어가 존재하는 경우, 이전 검색어를 추출하고(S815), 추출된 이전 검 색어를 이용하여, 제1 검색 쿼리를 제2 검색 쿼리로 변환한다(S817). 프로세서는 제1 검색 쿼리에 이전 검색어를 포함시켜, 제2 검색 쿼리를 생성할 수 있다. NLP 서버의 프로세서는 이전 검색어가 존재하지 않는 경우(S813), 텍스트 데이터의 의도 분석에 따른 의도 분석 결과를 획득한다(S819). 프로세서는 의도 분석 결과에 따른 의도 수행 결과(또는 검색 결과)를 제1 AI 에이전트 또는 제2 AI 에이전 트로부터 획득하고, 획득된 의도 수행 결과를 디스플레이 장치에 전송할 수 있다. 다시, 도 7을 설명한다. NLP 서버의 프로세서는 제1 AI 에이전트가 변환된 제2 검색 쿼리에 상응하는 검색을 수행할 수 있는지 를 판단한다(S719). 프로세서는 제2 검색 쿼리를 제1 AI 에이전트 서버에 전송하여, 제2 검색 쿼리에 따른 검색이 가능한 지를 문의할 수 있다. 제1 AI 에이전트 서버는 제2 검색 쿼리에 따른 검색이 가능한 경우, 검색 결과를 획득하고, 획득된 검색 결과를 프로세서에 전달할 수 있다. 또 다른 예로, 프로세서는 제2 검색 쿼리의 타입에 따라 제1 AI 에이전트 및 제2 AI 에이전트 중 제2 검색 쿼리에 따른 검색을 수행할 수 있는 에이전트를 결정할 수 있다. 예를 들어, 제2 검색 쿼리가 영화와 관계된 경우, 검색 수행의 대상을 제1 AI 에이전트로 결정하고, 제2 검색 쿼리가 날씨와 관계된 경우, 검색 수행의 대상을 제2 AI 에이전트로 결정할 수 있다. NLP 서버의 프로세서는 제1 AI 에이전트가 제2 검색 쿼리에 상응하는 검색이 수행 가능하다고 판단한 경우, 제1 AI 에이전트 서버로부터 제2 검색 쿼리에 상응하는 검색 결과를 획득하고, 제2 검색 쿼리 및 제 1 AI 에이전트의 검색 결과를 통신부를 통해 디스플레이 장치에 전송한다(S721). 디스플레이 장치의 제어부는 NLP 서버로부터 수신된 제2 검색 쿼리를 저장부에 저장하고, 제1 AI 에이전트의 검색 결과를 디스플레이부 상에 표시한다(S723). 제어부는 제2 검색 쿼리를 이전 검색어로 저장부에 저장할 수 있다. 제어부는 제2 검색 쿼리를 가장 최근에 검색한 검색어로 업데이트할 수 있다. 제1 AI 에이전트의 검색 결과는 사용자가 발화한 검색 명령어에 응답하여, 제공되는 정보일 수 있다. NLP 서버의 프로세서는 제1 AI 에이전트가 제2 검색 쿼리에 상응하는 검색이 수행 불가능하다고 판단 한 경우, 제2 AI 에이전트 서버로부터, 제2 검색 쿼리에 상응하는 검색 결과를 획득한다(S725). NLP 서버의 프로세서는 제2 검색 쿼리 및 제2 AI 에이전트의 검색 결과를 통신부를 통해 디스플레 이 장치에 전송한다(S727). 디스플레이 장치의 제어부는 제2 검색 쿼리를 저장부에 저장하고, 제2 AI 에이전트의 검색 결과 를 디스플레이부 상에 표시한다(S729). 제어부는 제2 검색 쿼리를 가장 최근에 검색한 검색어로 업데이트할 수 있다. 이하에서는, 도 7을 보다 상세하게 설명한다. 도 9 내지 도 11은 본 개시의 실시 예에 따라, 검색 결과 UI의 표시 또는 이전 검색어에 기초하여, 사용자가 발 화한 검색 명령어에 상응하는 동작을 수행하는 과정을 설명하는 도면들이다. 먼저, 도 9 및 도 10은 검색 결과 UI가 디스플레이부 상에 표시된 상태에서, 사용자가 검색 명령어를 발화 한 경우를 설명하는 시나리오이다. 도 9 및 10을 참조하면, 디스플레이 장치의 디스플레이부는 프로그램 및 검색 결과 UI를 표시하고 있다. 검색 결과 UI는 사용자의 발화에 의해 검색된 컨텐트 항목들을 포함하는 컨텐트 항목 리스트일 수 있다. 검색 결과 UI는 복수의 컨텐트들 각각을 식별하는 복수의 컨텐트 항목들(911 내지 915)를 포함할 수 있다. 디스플레이 장치는 도 7의 단계 S705에 따라, 검색 결과 UI에 포함된 컨텐트 항목들의 타이틀들, 컨텐트 항목들의 배치 관계(또는 배치 순서), 시청 중인 프로그램의 정보, 사용자가 이전에 발화한 이전 검색어 중 하나 이상을 포함하는 제1 시청 정보를 NLP 서버에 전송할 수 있다. NLP 서버는 디스플레이 장치로부터 수신된 제1 시청 정보를 수신하여, 저장할 수 있다. 도 9에서, 디스플레이 장치는 검색 결과 UI를 표시한 상태에서, <두번째꺼 등장인물은?> 이라는 검색 명령어를 수신할 수 있고, 수신된 검색 명령어에 상응하는 음성 데이터를 NLP 서버에 전송할 수 있다. NLP 서버는 수신된 음성 데이터를 텍스트 데이터로 변환하여, 제1 검색 쿼리를 획득할 수 있다. 제1 검색 쿼리는 특정 컨텐트 항목의 등장인물의 검색 의도를 나타내는 쿼리일 수 있다. NLP 서버는 검색 결과 UI에 포함된 복수의 컨텐트 항목들의 배치 관계 및 복수의 컨텐트 항목들의 타 이틀들을 이용하여, 2번째에 배치된 컨텐트 항목에 상응하는 타이틀을 획득할 수 있다. NLP 서버는 제1 검색 쿼리에 획득된 타이틀을 부가한 제2 검색 쿼리를 획득할 수 있다. 도 9에서, 제2 검색 쿼리는 두번째 위치한 컨텐트 항목의 타이틀인 BB를 포함하는 <BB의 등장인물은?>일 수 있다. 즉, 제2 검색 쿼리는 BB라는 타이틀을 갖는 컨텐트 항목의 등장 인물에 대한 정보를 검색하는 쿼리일 수 있다. NLP 서버는 제2 검색 쿼리에 따라 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버로부터, BB 라는 컨텐트 항목의 등장 인물에 대한 정보를 획득하고, 획득된 등장 인물에 대한 정보를 디스플레이 장치(10 0)에 전송할 수 있다. 디스플레이 장치는 NLP 서버로부터 수신된 등장 인물에 대한 정보를 디스플레이부 상에 표 시할 수 있다. 이와 같이, 디스플레이 장치 상에서, 검색 결과가 표시되어 있을 때, 검색 결과를 NLP 서버에 전송하 여, 사용자의 발화 의도가 분석될 수 있다. 이에 따라, 사용자는 컨텐트 항목의 타이틀을 발화하지 않고도, 원하는 정보를 얻을 수 있는 향상된 경험을 누 릴 수 있다. 다음으로, 도 10을 설명한다. 특히, 도 10은 검색 결과 UI에 포함된 제1 내지 제3 컨텐트 항목들(911 내지 915) 중 제2 컨텐트 항목 이 하이라이트 박스를 통해 포커스된 상태임을 가정한다. 도 10에서, 디스플레이 장치는 검색 결과 UI를 표시한 상태에서, <등장인물은?> 이라는 검색 명령어 를 수신할 수 있고, 수신된 검색 명령어에 상응하는 음성 데이터를 NLP 서버에 전송할 수 있다. NLP 서버는 수신된 음성 데이터를 텍스트 데이터로 변환하여, 제1 검색 쿼리를 획득할 수 있다. 제1 검색 쿼리는 특정 컨텐트 항목의 등장인물의 검색 의도를 나타내는 쿼리일 수 있다. NLP 서버는 검색 결과 UI에 포함된 복수의 컨텐트 항목들의 포커스 여부 및 복수의 컨텐트 항목들의 타이틀들을 이용하여, 포커스된 컨텐트 항목에 상응하는 타이틀을 획득할 수 있다. NLP 서버 제1 검색 쿼리에 획득된 타이틀을 부가한 제2 검색 쿼리를 획득할 수 있다. 도 10에서, 제2 검색 쿼리는 포커스된 제2 컨텐트 항목의 타이틀인 BB를 포함하는 <BB의 등장인물은?>일 수 있다. 즉, 제2 검색 쿼리는 BB라는 타이틀을 갖는 컨텐트 항목의 등장 인물에 대한 정보를 검색하는 쿼리일 수 있다. NLP 서버는 제2 검색 쿼리에 따라 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버로부터, BB 라는 컨텐트 항목의 등장 인물에 대한 정보를 획득하고, 획득된 등장 인물에 대한 정보를 디스플레이 장치(10 0)에 전송할 수 있다. 디스플레이 장치는 NLP 서버로부터 수신된 등장 인물에 대한 정보를 디스플레이부 상에 표 시할 수 있다. 이와 같이, 디스플레이 장치 상에서, 검색 결과 중 포커스된 항목이 있을 때, 포커스된 항목에 대한 검색 결과를 NLP 서버에 전송하여, 사용자의 발화 의도가 분석될 수 있다. 이에 따라, 사용자는 컨텐트 항목의 타이틀을 발화하지 않고도, 간단한 발화만으로, 원하는 정보를 얻을 수 있 는 향상된 경험을 누릴 수 있다.다음으로, 도 11을 설명한다. 특히, 도 11은 도 9 및 도 10의 실시 예와는 달리, 검색 결과 UI가 디스플레이부 상에 표시되지 않은 상태 에서 사용자가 <등장 인물은?>이라는 검색 명령어를 발화한 예이다. 또한, 도 11에서, 이전에 사용자가 발화한 이전 검색어는 제2 컨텐트 항목의 타이틀인 <BB>임을 가정한다. 디스플레이 장치는 시청 중인 프로그램의 정보 및 이전 검색어 중 하나 이상을 포함하는 제2 시청 정 보를 NLP 서버에 전송할 수 있다. 도 11에서, 디스플레이 장치는 <등장인물은?> 이라는 검색 명령어를 수신할 수 있고, 수신된 검색 명령어 에 상응하는 음성 데이터를 NLP 서버에 전송할 수 있다. NLP 서버는 수신된 음성 데이터를 텍스트 데이터로 변환하여, 제1 검색 쿼리를 획득할 수 있다. 제1 검색 쿼리는 등장인물의 검색 의도를 나타내는 쿼리일 수 있다. NLP 서버는 디스플레이 장치로부터, 검색 결과 UI에 대한 정보를 수신하지 못했으므로, 이전 검 색어인 <BB>를 이용하여, 제2 검색 쿼리를 생성할 수 있다. 즉, NLP 서버는 제1 검색 쿼리에 획득된 이전 검색어인 <BB>를 부가한 제2 검색 쿼리를 획득할 수 있다. 도 11에서, 제2 검색 쿼리는 제2 컨텐트 항목의 타이틀인 BB를 포함하는 <BB의 등장인물은?>일 수 있다. 즉, 제2 검색 쿼리는 BB라는 타이틀을 갖는 컨텐트 항목의 등장 인물에 대한 정보를 검색하는 쿼리일 수 있다. NLP 서버는 제2 검색 쿼리에 따라 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버로부터, BB 라는 컨텐트 항목의 등장 인물에 대한 정보를 획득하고, 획득된 등장 인물에 대한 정보를 디스플레이 장치(10 0)에 전송할 수 있다. 디스플레이 장치는 NLP 서버로부터 수신된 등장 인물에 대한 정보를 디스플레이부 상에 표 시할 수 있다. 이와 같이, 본 개시의 실시 예에 따르면, 이전 검색어를 활용하여, 사용자의 발화 의도가 분석될 수 있다. 이에 따라, 사용자는 컨텐트 항목의 타이틀을 발화하지 않고도, 간단한 발화만으로, 원하는 정보를 얻을 수 있 는 향상된 경험을 누릴 수 있다. 도 12a 및 도 12b는 본 개시의 실시 예에 따라, 연속적인 발화를 통해, 검색 결과를 제공하는 예를 설명하는 도 면이다. 도 12a 는 도 9 내지 도 11 중 어느 하나의 실시 예의 이후에 수행되는 시나리오일 수 있다. 도 12a를 참조하면, 디스플레이 장치는 제2 컨텐트 항목의 등장 인물에 대한 검색 결과를 나타내는 정보를 표시하고 있다. 디스플레이 장치는 <감독은?>이라는 추가 검색 명령어를 수신할 수 있다. 디스플레이 장치는 추가 검 색 명령어에 상응하는 음성 데이터를 NLP 서버에 전송할 수 있다. NLP 서버는 현재 제2 컨텐트 항목이 선택된 상태임을 인지하고, 수신된 음성 데이터의 의도를 제2 컨 텐트 항목을 연출한 감독에 대한 정보를 검색할 수 있다. 즉, NLP 서버는 제1 내지 제3 컨텐트 항목(911 내지 915) 중 제2 컨텐트 항목이 선택된 상태에서, 추 가 검색 명령어 <감독은?>가 수신된 경우, 추가 검색 명령어를 제2 컨텐트 항목과 관련된 정보의 검색을 요구하는 검색 쿼리로 인식할 수 있다. NLP 서버는 제2 컨텐트 항목의 선택을 해제하는 의도가 파악되기 전 까지, 수신된 추가 검색 명령어 에 대해서는, 제2 컨텐트 항목과 관련된 검색 정보를 획득할 수 있다. NLP 서버는 제2 컨텐트 항목을 연출한 감독에 대한 검색 정보를 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버로부터 획득하고, 획득된 감독에 대한 검색 정보를 디스플레이 장치에 전송할 수 있 다. 디스플레이 장치는 수신된 감독에 대한 검색 정보를 디스플레이부 상에 표시할 수 있다. 이 상태에서, 디스플레이 장치는 <흥행 실적은?> 이라는 이라는 추가 검색 명령어를 수신할 수 있다. 디스 플레이 장치는 추가 검색 명령어에 상응하는 음성 데이터를 NLP 서버에 전송할 수 있다. NLP 서버는 현재 제2 컨텐트 항목이 선택된 상태임을 인지하고, 수신된 음성 데이터의 의도를 제2 컨 텐트 항목의 타이틀에 기초하여, 제2 컨텐트 항목의 흥행 실적을 검색할 수 있다. 즉, NLP 서버는 제1 내지 제3 컨텐트 항목(911 내지 915) 중 제2 컨텐트 항목이 선택된 상태에서, 추 가 검색 명령어 <흥행 실적은?>이 수신된 경우, 추가 검색 명령어를 제2 컨텐트 항목과 관련된 정보의 검 색을 요구하는 검색 쿼리로 인식할 수 있다. NLP 서버는 제2 컨텐트 항목의 선택을 해제하는 의도가 파악되기 전 까지, 수신된 추가 검색 명령어 에 대해서는, 제2 컨텐트 항목과 관련된 검색 정보를 획득할 수 있다. NLP 서버는 제2 컨텐트 항목의 흥행 실적을 나타내는 검색 정보를 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버로부터 획득하고, 획득된 흥행 실적에 대한 검색 정보를 디스플레이 장치에 전 송할 수 있다. 디스플레이 장치는 수신된 흥행 실적에 대한 검색 정보를 디스플레이부 상에 표시할 수 있다. 이와 같이, 본 실시 예에 따르면, 멀티 AI 에이전트 구조에서, 사용자는 연속적인 발화를 통해, 확인하고 싶은 정보를 연속적으로 검색할 수 있다. 이에 따라, 사용자는 다양한 검색 결과를 확인할 수 있는 향상된 경험을 느낄 수 있다. 한편, 제2 컨텐트 항목의 선택을 해제하는 의도는 검색 결과 UI의 표시를 재 요청하는 경우, 식별될 수 있다. 또 다른 예로, 제2 컨텐트 항목의 선택을 해제하는 의도는 제2 컨텐트 항목 이외의 다른 컨텐트 항목 의 선택이 요청되는 경우, 식별될 수 있다. 이에 대해서는 후술한다. 도 12c는 컨텐트 항목의 선택을 해제하는 과정을 설명하는 실시 예이다. 도 12c를 참조하면, 디스플레이 장치는 제2 컨텐트 항목에 대한 흥행 실적을 나타내는 정보를 표시하고 있다. 이 상태에서, 사용자는 <첫번째 항목> 이라는 발화를 할 수 있다. 디스플레이 장치는 <첫번째 항목> 이라는 음성 명령어를 수신하고, 수신된 음성 명령어에 따라 제2 컨텐트 항목의 선택을 해제할 수 있다. 구체적으로, 디스플레이 장치는 <첫번째 항목> 이라는 음성 명령어의 음성 데이터를 NLP 서버에 전송 할 수 있다. NLP 서버는 수신된 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터의 의도가 제1 컨텐트 항목을 선택하는 의도로 파악할 수 있다. 즉, NLP 서버는 텍스트 데이터의 의도를 제2 컨텐트 항목의 선택을 해제하는 의도로 파악할 수 있다. NLP 서버는 제2 컨텐트 항목의 선택을 해제하고, 검색 결과 UI를 표시하도록 하는 요청을 디스 플레이 장치에 전송할 수 있다. 디스플레이 장치는 NLP 서버로부터 수신된 요청에 응답하여, 흥행 실적을 나타내는 정보를 검 색 결과 UI로 전환할 수 있다. 즉, 디스플레이 장치는 검색 결과 UI를 디스플레이부 상에 표시할 수 있다. 동시에, 디스플레이 장치는 검색 결과 UI의 첫번째 위치한 제1 컨텐트 항목을 포커싱 할 수 있 다. 즉, 사용자의 <첫번째 항목> 이라는 발화에 의해 제2 컨텐트 항목의 선택이 해제됨과 동시에, 제1 컨 텐트 항목이 자동으로 선택될 수 있다. 이 후, 사용자는 검색 명령어를 발화하여, 제1 컨텐트 항목에 대한 검색 결과를 제공받을 수 있다. 이와 같이, 본 개시의 실시 예에 따르면, 사용자는 간단한 발화만으로, 컨텐트 항목을 선택 또는 해제하여, 원 하는 컨텐트 항목의 정보를 검색할 수 있다. 또 다른 예로, NLP 서버는 디스플레이 장치로부터 제2 컨텐트 항목의 선택을 해제하는 요청을 수신할 수 있다. 디스플레이 장치는 원격 제어 장치로부터 선택 해제 요청을 수신하고, 수신된 선택 해제 요청을 NLP 서버에 전달할 수 있다. 다음으로, 본 개시의 또 다른 실시 예에 따른 인공 지능 시스템의 동작 방법을 설명한다. 도 13은 본 개시의 또 다른 실시 예에 따른 인공 지능 시스템의 동작 방법을 설명하기 위한 래더 다이어그램이 다. 도 13을 참조하면, 디스플레이 장치의 제어부는 프로그램 영상을 디스플레이부 상에 표시한다 (S1301). 디스플레이 장치의 제어부는 프로그램 영상에 포함된 오브젝트의 정보를 획득한다(S1303). 일 실시 예에서, 제어부는 프로그램 영상을 캡쳐하고, 캡쳐된 이미지를 영상 인식 서버에 전송할 수 있다. 영상 인식 서버는 캡쳐된 이미지로부터, 이미지에 포함된 하나 이상의 오브젝트를 인식할 수 있다. 영상 인식 서버는 딥 러닝 알고리즘 또는 머신 러닝 알고리즘에 의해 지도 학습된 영상 인식 모델을 이용하여, 이미지로부 터, 오브젝트를 인식할 수 있다. 즉, 영상 인식 서버는 이미지로부터, 오브젝트를 식별하는 명칭을 획득할 수 있다. 영상 인식 서버는 오브젝트를 식별하는 명칭을 디스플레이 장치에 전송할 수 있다. 또 다른 실시 예에서, 디스플레이부 상에는 원격 제어 장치에 의해 제어되는 포인터가 표시될 수 있다. 프로그램 영상의 캡쳐 이미지는 포인터가 포함될 수 있다. 영상 인식 서버는 영상 인식 모델을 이용하여, 포인터의 위치에 상응하는 오브젝트를 식별할 수 있다. 영상 인식 서버는 캡쳐된 이미지로부터, 포인터를 식별하고, 포인터의 위치에 상응하는 오브젝트를 식별할 수 있다. 영상 인식 서버는 식별된 오브젝트의 명칭을 디스플레이 장치에 전송할 수 있다. 디스플레이 장치의 제어부는 음성 명령어를 수신하고(S1305), 수신된 음성 명령어에 상응하는 음성 데이터 및 오브젝트의 정보를 NLP 서버에 전송한다(S1307). NLP 서버의 프로세서는 디스플레이 장치로부터 수신된 음성 데이터를 텍스트 데이터로 변환하여, 텍스트 데이터를 획득한다(S1309). NLP 서버는 STT 엔진을 이용하여, 음성 데이터를 텍스트 데이터로 변환할 수 있다. NLP 서버의 프로세서는 텍스트 데이터의 의도 분석에 기초하여, 제1 쿼리를 획득한다(S1311). 제1 쿼리는 사용자가 발화한 음성 명령어의 의도 분석 결과를 반영할 수 있다. NLP 서버의 프로세서는 오브젝트의 정보에 기초하여, 제1 쿼리를 제2 쿼리로 변환한다(S1313). 프로세서는 제1 쿼리에 오브젝트의 명칭을 결합하여, 제2 쿼리를 생성할 수 있다. NLP 서버의 프로세서는 복수의 AI 에이전트들 중 어느 하나로부터, 제2 쿼리에 상응하는 의도 수행 결 과를 획득한다(S1315). 프로세서는 제1 AI 에이전트 또는 제2 AI 에이전트에 제2 쿼리를 전송하고, 제1 AI 에이전트 또는 제2 AI 에이전트로부터, 제2 쿼리에 상응하는 의도 수행 결과를 획득할 수 있다. 제2 쿼리는 오브젝트의 상세 정보를 검색하는 의도를 반영한 경우, 의도 수행 결과는 오브젝트의 상세 정보의 검색 결과일 수 있다. NLP 서버의 프로세서는 통신부를 통해 의도 수행 결과를 디스플레이 장치에 전송한다 (S1317). 디스플레이 장치의 제어부는 NLP 서버로부터 수신된 의도 수행 결과를 디스플레이부 상에 표시한다(S1319). 한편, 도 13에 도시된 단계들 중 일부 단계들은 동시에 수행될 수 있고, 단계의 순서가 뒤 바뀌어 실시될 수 있 다. 도 14 및 도 15는 오브젝트 인식 기술을 이용하여, 사용자의 발화 의도를 파악하는 실시 예를 설명하는 도면이 다. 도 14를 참조하면, 디스플레이 장치는 프로그램 영상을 디스플레이부 상에 표시한다. 사용자는 원격 제어 장치의 조작을 통해 포인터를 프로그램 영상에 포함된 운동화에 위 치시킬 수 있다. 디스플레이 장치는 프로그램 영상을 캡쳐하고, 캡쳐된 이미지를 영상 인식 서버에 전송할 수 있다. 디스플레이 장치는 포인터의 좌표를 획득하고, 캡쳐된 이미지와 포인터의 좌표를 함께 영상 인 식 서버에 전송할 수 있다. 디스플레이 장치는 사용자의 음성 명령어를 수신한 시점에, 프로그램 영상을 캡쳐할 수 있다. 즉, 사용자가 발화한 음성 명령어는 프로그램 영상을 캡쳐하는 트리거가 될 수 있다. 영상 인식 서버는 NLP 서버에 포함될 수도 있다. 영상 인식 서버는 영상 인식 모델을 이용하여, 캡쳐된 이미지를 분석하고, 이미지에 포함된 포인터의 위치 에 상응하는 운동화를 식별할 수 있다. 영상 인식 서버는 운동화의 명칭, 브랜드 중 하나 이상을 포함하는 운동화의 정보를 디스플레이 장치에 전 송할 수 있다. 디스플레이 장치는 <저거 쇼핑 목록에 추가해줘> 라는 음성 명령어를 수신하고, 수신된 음성 명령어의 음 성 데이터 및 운동화의 정보를 NLP 서버에 전송할 수 있다. NLP 서버는 음성 데이터를 텍스트 데이터로 변환하고, 의도 분석 작업에 따라 오브젝트를 쇼핑 목록에 추 가하라는 의도를 반영한 제1 쿼리를 획득할 수 있다. NLP 서버는 제1 쿼리에 운동화의 정보를 결합하여, 제2 쿼리를 생성할 수 있다. 제2 쿼리는 A 브랜드 운동 화를 쇼핑 목록에 추가해 달라는 의도를 반영할 수 있다. NLP 서버는 제2 쿼리를 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버에 전송하고, A 브랜드 운동화에 대한 상세 정보를 수신할 수 있다. NLP 서버는 수신된 A 브랜드의 상세 정보를 쇼핑 리스트에 추가시키고, A 브랜드의 상세 정보가 반영된 쇼 핑 리스트를 디스플레이 장치에 전송할 수 있다. 디스플레이 장치는 A 브랜드의 상세 정보를 포함하는 쇼핑 리스트를 디스플레이부 상에 표시할 수 있다. 이와 같이, 본 개시의 실시 예에 따르면, 사용자는 프로그램의 시청 중, 간단한 발화만으로, 프로그램 영상에 포함된 오브젝트에 대한 원하는 액션 또는 오브젝트의 상세 정보를 확인할 수 있다. 다음으로, 도 15를 설명한다. 도 15를 참조하면, 디스플레이 장치는 프로그램 영상을 디스플레이부 상에 표시한다. 디스플레이 장치는 프로그램 영상을 캡쳐하고, 캡쳐된 이미지를 영상 인식 서버에 전송할 수 있다. 디스플레이 장치는 사용자의 음성 명령어를 수신한 시점에, 프로그램 영상을 캡쳐할 수 있다. 즉, 사용자가 발화한 음성 명령어는 프로그램 영상을 캡쳐하는 트리거가 될 수 있다. 영상 인식 서버는 NLP 서버에 포함될 수도 있다. 영상 인식 서버는 영상 인식 모델을 이용하여, 캡쳐된 이미지를 분석하고, 이미지에 포함된 랜드마크를 인식할 수 있다. 영상 인식 서버는 랜드마크의 명칭을 포함하는 랜드마크의 정보를 디스플레이 장치에 전송할 수 있다. 디스플레이 장치는 <저기까지 얼마나 걸려> 라는 음성 명령어를 수신하고, 수신된 음성 명령어의 음성 데 이터 및 랜드마크의 정보를 NLP 서버에 전송할 수 있다. NLP 서버는 음성 데이터를 텍스트 데이터로 변환하고, 의도 분석 작업에 따라 현재 위치에서, 랜드마크까 지 가는데 걸리는 시간을 요청하는 의도를 반영한 제1 쿼리를 획득할 수 있다. NLP 서버는 제1 쿼리에 랜드마크의 명칭을 결합하여, 제2 쿼리를 생성할 수 있다. 제2 쿼리는 현재 위치에 서, B 브릿지까지 가는데 걸리는 시간을 원하는 의도를 반영할 수 있다. NLP 서버는 제2 쿼리를 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버에 전송하고, A 브릿지 까지의 가는데 걸리는 시간을 포함하는 상세 정보를 수신할 수 있다. NLP 서버는 수신된 상세 정보를 디스플레이 장치에 전송할 수 있다. 디스플레이 장치는 A 브릿지까지의 거리 및 비행기를 통해 가는데 걸리는 시간을 포함하는 상세 정보 를 디스플레이부 상에 표시할 수 있다. 이와 같이, 본 개시의 실시 예에 따르면, 사용자는 프로그램의 시청 중, 간단한 발화만으로, 프로그램 영상에 포함된 오브젝트에 대한 원하는 액션 또는 오브젝트의 상세 정보를 확인할 수 있다. 도 16은 도 13 내지 도 15의 실시 예와 관련된 또 다른 형태의 인공 지능 시스템을 설명하는 도면이다. 도 16의 인공 지능 시스템은 도 6의 인공 지능 시스템에 비해, 영상 인식 서버 및 영상 인식기 의 구성이 추가되었다. 영상 인식기는 디스플레이 장치의 제어부에 포함될 수 있다. 영상 인식기는 디스플레이부 상에 표시된 프로그램 영상을 캡쳐하고, 캡쳐된 이미지를 영상 인식 서 버에 전송할 수 있다. 영상 인식기는 프로그램 영상을 실시간 또는 주기적으로 캡쳐할 수 있다. 또 다른 예로, 영상 인식기는 사용자의 음성 명령어를 수신한 시점에, 프로그램 영상을 캡쳐할 수도 있다. 영상 인식기는 캡쳐 당시, 포인터의 좌표를 획득하고, 캡쳐 이미지 및 포인터의 좌표를 영상 인 식 서버에 전송할 수 있다. 영상 인식기는 제어부와 별도로 존재하는 구성일 수 있다. 영상 인식 서버는 영상 인식 모델을 이용하여, 영상 인식기로부터 수신된 캡쳐 이미지에 포함된 오 브젝트를 인식할 수 있다. 영상 인식 서버는 캡쳐 이미지 및 포인터의 좌표를 함께 수신한 경우, 포인터의 좌표에 상응하 는 오브젝트를 인식할 수 있다. 영상 인식 서버는 인식된 오브젝트의 명칭을 포함하는 오브젝트의 식별 정보를 영상 인식기에 전송 할 수 있다. 영상 인식기는 오브젝트의 식별 정보를 NLP 클라이언트에 전달할 수 있다. NLP 클라이언트는 오브젝트의 식별 정보 및 사용자가 발화한 음성 명령어에 상응하는 음성 데이터를 데이 터 변환 서버에 전송할 수 있다. 데이터 변환 서버는 음성 데이터를 텍스트 데이터로 변환하고, 변환된 텍스트 데이터 및 오브젝트의 식별 정보를 NLP 서버에 전달할 수 있다. NLP 서버는 텍스트 데이터의 의도 분석 결과를 나타내는 제1 쿼리를 획득하고, 오브젝트의 식별 정보 및 제1 쿼리에 기초하여, 제2 쿼리를 생성할 수 있다. NLP 서버는 제2 쿼리를 제1 AI 에이전트 서버 또는 제2 AI 에이전트 서버에 전송하고, 어느 하 나로부터 제2 쿼리에 대한 의도 수행 결과를 획득할 수 있다. NLP 서버는 의도 수행 결과를 데이터 변환 서버에 전송하고, 데이터 변환 서버는 의도 수행 결 과를 텍스트 데이터의 형태로, NLP 클라이언트에 전송할 수 있다. 본 개시의 일 실시 예에 의하면, 전술한 방법은, 프로그램이 기록된 매체에 프로세서가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 프로세서가 읽을 수 있는 매체의 예로는, ROM, RAM, CD-ROM, 자기 테이프, 플로피 디 스크, 광 데이터 저장장치 등이 있으며, 캐리어 웨이브(예를 들어, 인터넷을 통한 전송)의 형태로 구현되는 것 도 포함한다. 상기와 같이 설명된 디스플레이 장치는 상기 설명된 실시 예들의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시 예들은 다양한 변형이 이루어질 수 있도록 각 실시 예들의 전부 또는 일부가 선택적으로 조 합되어 구성될 수도 있다."}
{"patent_id": "10-2019-0136432", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 디스플레이 장치의 구성을 블록도로 도시한 것이다. 도 2은 본 개시의 일 실시 예에 따른 원격제어장치의 블록도이다. 도 3은 본 개시의 일 실시 예에 따른 원격제어장치의 실제 구성 예를 보여준다. 도 4는 본 개시의 실시 예에 따라 원격 제어 장치를 활용하는 예를 보여준다. 도 5는 본 개시의 일 실시 예에 따른 AI 서버의 구성을 설명하는 블록도이다. 도 6은 본 개시의 또 다른 실시 예에 따른 인공 지능 시스템의 구성을 설명하기 위한 도면이다. 도 7은 본 개시의 실시 예에 따른 인공 지능 시스템의 동작 방법을 위한 래더 다이어 그램이다. 도 8은 본 개시의 실시 예에 따라 NLP 서버가 제1 시청 정보 또는 제2 시청 정보에 기초하여, 검색 쿼리를 완성 하는 과정을 설명하는 방법을 설명하는 도면이다. 도 9 내지 도 11은 본 개시의 실시 예에 따라, 검색 결과 UI의 표시 또는 이전 검색어에 기초하여, 사용자가 발화한 검색 명령어에 상응하는 동작을 수행하는 과정을 설명하는 도면들이다. 도 12a 및 도 12b는 본 개시의 실시 예에 따라, 연속적인 발화를 통해, 검색 결과를 제공하는 예를 설명하는 도 면이다. 도 12c는 컨텐트 항목의 선택을 해제하는 과정을 설명하는 실시 예이다. 도 13은 본 개시의 또 다른 실시 예에 따른 인공 지능 시스템의 동작 방법을 설명하기 위한 래더 다이어그램이 다. 도 14 및 도 15는 오브젝트 인식 기술을 이용하여, 사용자의 발화 의도를 파악하는 실시 예를 설명하는 도면이 다. 도 16은 도 13 내지 도 15의 실시 예와 관련된 또 다른 형태의 인공 지능 시스템을 설명하는 도면이다."}
