{"patent_id": "10-2023-0012492", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0120775", "출원번호": "10-2023-0012492", "발명의 명칭": "지식관리 서비스 제공 방법 및 이를 위한 장치", "출원인": "최홍휘", "발명자": "최홍휘"}}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "온라인 지식관리 플랫폼을 제공하는 지식관리 서버에 의한 지식관리 서비스 제공 방법에 있어서,사용자가 상기 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이지에 대한 북마크(bookmark)를 수행하는 단계;상기 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트를 생성 및 저장하는 단계;상기 사용자의 명령에 따라 상기 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성하기 위한 지식 노트 편집 툴을 제공하는 단계;상기 사용자가 상기 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터추출된 주요 키워드와 상기 검색 키워드와의 유사도를 기반으로, 상기 복수의 북마크 노트에 대한 인공지능 기반의 문맥 검색을 수행하는 단계; 및상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트를 추출 및 상기 사용자에게 제공하는 단계;를 포함하는 지식관리 서비스 제공 방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 문맥 검색을 수행하는 단계는,상기 사용자가 상기 온라인 지식관리 플랫폼 내 업로드한 복수의 문서 파일 및 상기 지식 노트 편집 툴로부터생성된 지식 노트 내 텍스트를 탐색하여 추출된 주요 키워드와 상기 검색 키워드와의 유사도를 기반으로, 상기복수의 문서 파일 및 상기 지식 노트에 대한 인공지능 기반의 문맥 검색을 더 수행하고,상기 적어도 하나의 북마크 노트를 제공하는 단계는,상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 문서 파일 및 상기 지식 노트에 대한 정보를 상기 사용자에게 더 제공하는 것을 특징으로 하는 지식관리 서비스 제공 방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 문맥 검색을 수행하는 단계는,상기 문서 파일이 텍스트 이미지 기반의 파일인 경우, OCR(Optical Character Recognition)에 기반하여 상기문서 파일 내 텍스트를 탐색하는 것을 특징으로 하는 지식관리 서비스 제공 방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 저장된 복수의 북마크 노트를 상기 복수의 북마크 노트로부터 추출된 주요 키워드 별로 분류하는 단계; 및상기 추출된 주요 키워드 간 관계를 연결한 지식 네트워크를 시각화하여 표시하고, 상기 지식 네트워크 내 주요키워드에 대응되는 상기 복수의 북마크 노트를 링크시켜 계층화하는 단계;를 더 포함하는 것을 특징으로 하는지식관리 서비스 제공 방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2024-0120775-3-상기 북마크를 수행하는 단계는,웹 브라우저에서 제공하는 북마크 메뉴를 통해 상기 웹 브라우저에 표시된 상기 특정 웹 페이지에 대한 북마크를 수행하거나 상기 온라인 지식관리 플랫폼 내에서 제공하는 북마크 주소 입력 메뉴를 통해 상기 특정 웹 페이지의 URL(Uniform Resource Locator)를 입력하여 북마크를 수행하는 것을 특징으로 하는 지식관리 서비스 제공방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서,상기 지식 노트 편집 툴에서 입력된 검색 키워드 별 또는 상기 검색 키워드를 포함하는 문장 별로 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트 또는 적어도 하나의 문서 파일에 대한 정보를 각각 링크하는 단계;를 더 포함하는 것을 특징으로 하는 지식관리 서비스 제공 방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 문서 파일 및 상기 지식 노트에 대한 정보는,상기 문서 파일 및 상기 지식 노트 내 텍스트를 탐색하여 상기 문맥 검색에 따라 추출된 문장 또는 단락을 포함하는 것을 특징으로 하는 지식관리 서비스 제공 방법."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "온라인 지식관리 플랫폼을 제공하는 지식관리 서버에 있어서,사용자가 상기 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이지에 대한 북마크(bookmark)를 수행하면, 상기 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트를 생성 및 저장하는 북마크 노트 생성부;상기 사용자의 명령에 따라 상기 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성하기 위한 지식 노트 편집 툴을 제공하는 지식 노트 편집부; 및상기 사용자가 상기 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터추출된 주요 키워드와 상기 검색 키워드와의 유사도를 기반으로, 상기 복수의 북마크 노트에 대한 인공지능 기반의 문맥 검색을 수행하고, 상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트를추출 및 상기 사용자에게 제공하는 북마크 노트 검색부;를 포함하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 북마크 노트 검색부는,상기 사용자가 상기 온라인 지식관리 플랫폼 내 업로드한 복수의 문서 파일 및 상기 지식 노트 편집 툴로부터생성된 지식 노트 내 텍스트를 탐색하여 추출된 주요 키워드와 상기 검색 키워드와의 유사도를 기반으로, 상기복수의 문서 파일에 대한 인공지능 기반의 문맥 검색을 더 수행하고, 상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 문서 파일 및 상기 지식 노트에 대한 정보를 상기 사용자에게 더 제공하는 것을 특징으로 하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 북마크 노트 검색부는,상기 문서 파일이 텍스트 이미지 기반의 파일인 경우, OCR(Optical Character Recognition)에 기반하여 상기문서 파일 내 텍스트를 탐색하는 것을 특징으로 하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2024-0120775-4-제8항에 있어서,상기 저장된 복수의 북마크 노트를 상기 복수의 북마크 노트로부터 추출된 주요 키워드 별로 분류하고, 상기 추출된 주요 키워드 간 관계를 연결한 지식 네트워크를 시각화하여 표시하며, 상기 지식 네트워크 내 주요 키워드에 대응되는 상기 복수의 북마크 노트를 링크시켜 계층화하는 지식 네트워크 생성부;를 더 포함하는 것을 특징으로 하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 북마크 노트 생성부는,웹 브라우저에서 제공하는 북마크 메뉴를 통해 상기 웹 브라우저에 표시된 상기 특정 웹 페이지에 대한 북마크를 수행하거나 상기 온라인 지식관리 플랫폼 내에서 제공하는 북마크 주소 입력 메뉴를 통해 상기 특정 웹 페이지의 URL(Uniform Resource Locator)를 입력하여 북마크를 수행하는 것을 특징으로 하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 지식 노트 편집부는,상기 지식 노트 편집 툴에서 입력된 검색 키워드 별 또는 상기 검색 키워드를 포함하는 문장 별로 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트 또는 적어도 하나의 문서 파일에 대한 정보를 각각 링크하는 것을특징으로 하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 문서 파일 및 상기 지식 노트에 대한 정보는,상기 문서 파일 및 상기 지식 노트 내 텍스트를 탐색하여 상기 문맥 검색에 따라 추출된 문장 또는 단락을 포함하는 것을 특징으로 하는 지식관리 서버."}
{"patent_id": "10-2023-0012492", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제7항 중 어느 한 항의 지식관리 서비스 제공 방법을 실행시키는 기록매체에 저장된 컴퓨터 프로그램."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "온라인 지식관리 플랫폼을 제공하는 지식관리 서버에 의한 지식관리 서비스 제공 방법이 개시된다. 본 발명의 지 식관리 서비스 제공 방법은 사용자가 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이지에 대한 북마크 (bookmark)를 수행하는 단계, 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트를 생성 및 저장하는 단 계, 사용자의 명령에 따라 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하기 위한 지식 노트 편집 툴을 제공하는 단계, 사용자가 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터 추출된 주요 키워드와 검색 키워드와의 유사도를 기반으로, 복수의 북마크 노트에 대한 인공지능 기 반의 문맥 검색을 수행하는 단계 및, 문맥 검색에 따라 검색 키워드에 대응되는 적어도 하나의 북마크 노트를 추 출 및 사용자에게 제공하는 단계를 포함한다."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 지식관리 서비스 제공 방법 및 이를 위한 장치에 관한 것으로, 더욱 상세하게는 분산화된 지식 정보 를 관리하기 위한 지식관리 서비스 제공 방법 및 이를 위한 장치에 관한 것이다."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "21세기 디지털 경제에 있어서, 무형의 생산 요소인 지식이나 아이디어 등이 경쟁력의 결정적인 요소가 되면서, 새로운 지식을 창조, 수집, 공유 및 활용하여 경쟁력을 길러 나가기 위한 방법에 대한 관심이 고조되고 있다. 이에 따라 지식의 체계적 관리와 새로운 지식의 창출을 통한 경쟁우위 전략이 대두되면서, 무형의 자산인 지적 자본을 체계적으로 관리함으로써 기업의 경쟁력을 제고시키거나 연구활동에 있어서 높은 성과를 낼 수 있도록 인프라를 구축하는 것의 중요성이 높아지고 있다. 최근에는 지식정보를 관리할 수 있는 지식관리 서비스가 출현하고 있다. 이러한 지식관리 서비스는 지식을 저장 하고 검색하여 이해 협업, 프로세스 정렬 등을 향상시키는 모든 종류의 서비스를 통칭할 수 있으며, 조직이나 팀 내에서 사용되거나 사용자나 고객을 위한 지식 정보를 집중시키는 데에 사용되고 있다. 그러나, 이러한 지식관리 서비스는 대체로 사용자가 파일을 업로드하거나 필요한 정보를 작성하여 분류하고, 필 요한 정보를 특정 키워드 검색을 통해 찾아주는 데에 그 역할이 그칠 뿐이어서, 산재되어 있는 다양한 정보를 새로운 지식 정보를 생산하는 사용자가 손쉽게 참조하거나 특정 키워드를 기억하지 못하더라도 보다 쉽게 찾을 수 있도록 하는 기능은 제공하지 못하고 있다."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제를 해결하기 위한 것으로, 본 발명의 목적은 사용자가 산재되어 있는 정보 중 원하는 정 보를 정확하게 기억하지 못하더라도 보다 손쉽고 빠르게 검색하여 제공해주고, 사용자가 등록한 지식 정보를 보 다 쉽게 참조할 수 있도록 도와주는 지식관리 서비스 제공 방법 및 이를 위한 장치를 제공하는 데에 있다"}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 발명의 일 실시 예에 따른 온라인 지식관리 플랫폼을 제공하는 지식관리 서버 에 의한 지식관리 서비스 제공 방법은 사용자가 상기 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이 지에 대한 북마크(bookmark)를 수행하는 단계, 상기 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트 를 생성 및 저장하는 단계, 상기 사용자의 명령에 따라 상기 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성하기 위한 지식 노트 편집 툴을 제공하는 단계, 상기 사용자가 상기 지식 노트 편 집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터 추출된 주요 키워드와 상기 검색 키워드와의 유사도를 기반으로, 상기 복수의 북마크 노트에 대한 인공지능 기반의 문맥 검색을 수행하는 단계 및, 상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트를 추출 및 상기 사용자에 게 제공하는 단계를 포함한다. 이때, 상기 문맥 검색을 수행하는 단계는 상기 사용자가 상기 온라인 지식관리 플랫폼 내 업로드한 복수의 문서 파일 및 상기 지식 노트 편집 툴로부터 생성된 지식 노트 내 텍스트를 탐색하여 추출된 주요 키워드와 상기 검 색 키워드와의 유사도를 기반으로, 상기 복수의 문서 파일 및 상기 지식 노트에 대한 인공지능 기반의 문맥 검 색을 더 수행하고, 상기 적어도 하나의 북마크 노트를 제공하는 단계는 상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어 도 하나의 문서 파일 및 상기 지식 노트에 대한 정보를 상기 사용자에게 더 제공할 수 있다. 또한, 상기 문맥 검색을 수행하는 단계는 상기 문서 파일이 텍스트 이미지 기반의 파일인 경우, OCR(Optical Character Recognition)에 기반하여 상기 문서 파일 내 텍스트를 탐색할 수 있다. 또한, 상기 지식관리 서비스 제공 방법은 상기 저장된 복수의 북마크 노트를 상기 복수의 북마크 노트로부터 추 출된 주요 키워드 별로 분류하는 단계 및, 상기 추출된 주요 키워드 간 관계를 연결한 지식 네트워크를 시각화 하여 표시하고, 상기 지식 네트워크 내 주요 키워드에 대응되는 상기 복수의 북마크 노트를 링크시켜 계층화하 는 단계를 더 포함할 수 있다. 또한, 상기 북마크를 수행하는 단계는 웹 브라우저에서 제공하는 북마크 메뉴를 통해 상기 웹 브라우저에 표시 된 상기 특정 웹 페이지에 대한 북마크를 수행하거나 상기 온라인 지식관리 플랫폼 내에서 제공하는 북마크 주 소 입력 메뉴를 통해 상기 특정 웹 페이지의 URL(Uniform Resource Locator)를 입력하여 북마크를 수행할 수 있 다. 또한, 상기 지식관리 서비스 제공 방법은 상기 지식 노트 편집 툴에서 입력된 검색 키워드 별 또는 상기 검색 키워드를 포함하는 문장 별로 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트 또는 적어도 하나의 문 서 파일에 대한 정보를 각각 링크하는 단계를 더 포함할 수 있다. 또한, 상기 문서 파일 및 상기 지식 노트에 대한 정보는 상기 문서 파일 및 상기 지식 노트 내 텍스트를 탐색하 여 상기 문맥 검색에 따라 추출된 문장 또는 단락을 포함할 수 있다. 한편, 본 발명의 일 실시 예에 따른 온라인 지식관리 플랫폼을 제공하는 지식관리 서버는 사용자가 상기 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이지에 대한 북마크(bookmark)를 수행하면, 상기 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트를 생성 및 저장하는 북마크 노트 생성부, 상기 사용자의 명령에 따라 상기 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성하기 위한 지식 노트 편집 툴을 제공하는 지식 노트 편집부 및, 상기 사용자가 상기 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터 추출된 주요 키워드와 상기 검색 키워드와의 유사도를 기반으로, 상 기 복수의 북마크 노트에 대한 인공지능 기반의 문맥 검색을 수행하고, 상기 문맥 검색에 따라 상기 검색 키워 드에 대응되는 적어도 하나의 북마크 노트를 추출 및 상기 사용자에게 제공하는 북마크 노트 검색부를 포함한다. 이때, 상기 북마크 노트 검색부는 상기 사용자가 상기 온라인 지식관리 플랫폼 내 업로드한 복수의 문서 파일 및 상기 지식 노트 편집 툴로부터 생성된 지식 노트 내 텍스트를 탐색하여 추출된 주요 키워드와 상기 검색 키 워드와의 유사도를 기반으로, 상기 복수의 문서 파일에 대한 인공지능 기반의 문맥 검색을 더 수행하고, 상기 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 문서 파일 및 상기 지식 노트에 대한 정보를 상 기 사용자에게 더 제공할 수 있다. 또한, 상기 북마크 노트 검색부는 상기 문서 파일이 텍스트 이미지 기반의 파일인 경우, OCR(Optical Character Recognition)에 기반하여 상기 문서 파일 내 텍스트를 탐색할 수 있다. 또한, 상기 지식관리 서버는 상기 저장된 복수의 북마크 노트를 상기 복수의 북마크 노트로부터 추출된 주요 키 워드 별로 분류하고, 상기 추출된 주요 키워드 간 관계를 연결한 지식 네트워크를 시각화하여 표시하며, 상기 지식 네트워크 내 주요 키워드에 대응되는 상기 복수의 북마크 노트를 링크시켜 계층화하는 지식 네트워크 생성 부를 더 포함할 수 있다. 또한, 상기 북마크 노트 생성부는 웹 브라우저에서 제공하는 북마크 메뉴를 통해 상기 웹 브라우저에 표시된 상 기 특정 웹 페이지에 대한 북마크를 수행하거나 상기 온라인 지식관리 플랫폼 내에서 제공하는 북마크 주소 입 력 메뉴를 통해 상기 특정 웹 페이지의 URL(Uniform Resource Locator)를 입력하여 북마크를 수행할 수 있다. 또한, 상기 지식 노트 편집부는 상기 지식 노트 편집 툴에서 입력된 검색 키워드 별 또는 상기 검색 키워드를 포함하는 문장 별로 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트 또는 적어도 하나의 문서 파일에 대한 정보를 각각 링크할 수 있다. 또한, 상기 문서 파일 및 상기 지식 노트에 대한 정보는 상기 문서 파일 및 상기 지식 노트 내 텍스트를 탐색하 여 상기 문맥 검색에 따라 추출된 문장 또는 단락을 포함할 수 있다."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같은 본 발명의 다양한 실시 예에 따르면, 사용자가 지식정보를 생산하는 과정에서 관련된 정보를 보다 쉽고 빠르게 참조할 수 있게 된다. 또한, 문맥 검색에 따라 사용자가 의도한 지식 정보를 검색하여 제공해줄 수 있으므로, 지식정보 생산 과정에서 사용자가 정확하게 키워드를 기억하지 못하더라도 원하는 정보를 찾기 수월해질 수 있다. 또한, 사용자에 의해 누적된 지식 정보를 자동으로 분류 및 그 관계를 네트워크 정보로 보여줌으로써, 지식 정 보의 관리가 편리해질 수 있다."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 본 명세서 및 청구범위에서 사용되는 용어는 본 발명의 다양한 실시 예들에서의 기능을 고려하여 일반적 인 용어들을 선택하였다. 하지만, 이러한 용어들은 당 분야에 종사하는 기술자의 의도나 법률적 또는 기술적 해 석 및 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 일부 용어는 출원인이 임의로 선정한 용어일 수 있 다. 이러한 용어에 대해서는 본 명세서에서 정의된 의미로 해석될 수 있으며, 구체적인 용어 정의가 없으면 본 명세서의 전반적인 내용 및 당해 기술 분야의 통상적인 기술 상식을 토대로 해석될 수도 있다. 또한, 본 명세서에 첨부된 각 도면에 기재된 동일한 참조 번호 또는 부호는 실질적으로 동일한 기능을 수행하는 부품 또는 구성요소를 나타낸다. 설명 및 이해의 편의를 위해서 서로 다른 실시 예들에서도 동일한 참조번호 또 는 부호를 사용하여 설명하도록 한다. 즉, 복수의 도면에서 동일한 참조 번호를 가지는 구성 요소를 모두 도시 하고 있다고 하더라도, 복수의 도면들이 하나의 실시 예를 의미하는 것은 아니다. 또한, 본 명세서 및 청구범위에서는 구성요소들 간의 구별을 위하여 '제1', '제2' 등과 같이 서수를 포함하는 용어가 사용될 수 있다. 이러한 서수는 동일 또는 유사한 구성 요소들을 서로 구별하기 위하여 사용하는 것이며, 이러한 서수 사용으로 인하여 용어의 의미가 한정 해석되어서는 안될 것이다. 일 예로, 이러한 서수와 결합된 구성 요소는 그 숫자에 의해 사용 순서나 배치 순서 등이 제한 해석되어서는 안된다. 필요에 따라서는, 각 서수들은 서로 교체되어 사용될 수도 있다. 본 명세서에서 단수의 표현은 문맥상 명백하게 다름을 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, '포함하다' 또는 '구성하다' 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성 요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구 성 요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한 다. 또한, 본 발명의 실시 예에서, 어떤 부분이 다른 부분과 연결되어 있다고 할 때, 이는 직접적인 연결뿐 아니라, 다른 매체를 통한 간접적인 연결의 경우도 포함한다. 또한 어떤 부분이 어떤 구성 요소를 포함한다는 의미는, 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있다 는 것을 의미한다. 이하, 첨부된 도면을 참조하여 본 발명을 더욱 구체적으로 설명하기로 한다. 도 1은 본 발명의 일 실시 예에 따른 지식관리 서비스 제공 시스템을 나타낸 도면이다. 본 발명의 지식관리 서비스 제공 시스템은 도 1에 도시된 바와 같이, 지식관리 서버 및 사용자 단말 을 포함한다. 지식관리 서버 및 사용자 단말은 서로 네트워크를 통해 연결될 수 있다. 네트워크는 유선 또는 무선일 수 있다. 네트워크의 통신 방식은 제한되지 않으며, 네트워크 가 포함할 수 있는 통신망(일례로, 이동통신망, 무선 온라인, 방송망)을 활용하는 통신 방식이 활용될 수 있다. 예를 들어, 네트워크는 WAN(Wide Area Network), MAN(Metropolitan Area Network), LAN(Local Area Network) 중 하나 이상 또는 이들의 결합으로 구성될 수 있다. 또한, 네트워크는 WLAN(Wireless LAN)(WiFi), Wibro(Wireless broadband) 및/또는 Wimax(World Interoperability for Microwave Access) 등의 무선 인터넷 기술, CDMA(Code Division Multiple Access), GSM(Global System for Mobile communication), LTE(Long Tern Evolution) 및/또는 LTE-Advanced 등의 이동 통신 기술, 및/또는 V2I(Vehicle to Infra) 등의 V2X(Vehicle to Everything) 통신 기술로 구현될 수 있다. 본 발명의 일 실시 예에 따른 지식관리 서버는 네트워크 드라이브에 포함된 지식 데이터를 관리하는 컴퓨 팅 장치일 수 있다. 지식관리 서버는 지식 데이터를 관리하는 각 사용자의 아이디, 패스워드, 성명 등을 포함한 사용자 정보를 저장할 수 있다. 이에 지식관리 서버는 사용자가 직접 작성하거나 업로드 또는 북마크한 지식 데이터를 저장 및 등록하기 위한 온라인 지식관리 플랫폼을 사용자의 사용자 단말에 제공할 수 있다. 예를 들어, 사용자는 사용자 단말을 통해 지식관리 서버로부터 제공되는 온라인 지식관리 웹 사이트 에 접속하여, 지식 데이터를 작성하거나 지식 데이터를 업로드 또는 북마크하여 등록할 수 있다. 본 발명의 일 실시 예에 따른 지식관리 서버 또는 지식관리 서버와 연동되어 동작하는 다른 서버(미 도시)가 비밀 데이터 기반 로그인 어플리케이션, 프로그램, 웹 페이지 등을 포함한 온라인 지식관리 플랫폼을 사용자 단말로 전송하면, 사용자 단말은 해당 온라인 지식관리 플랫폼을 설치하거나 열 수 있다. 웹브라우저 또는 어플리케이션에서 실행되는 스크립트를 이용하여 비밀 데이터 기반 로그인 프로그램이 사용자 단 말에서 구동될 수 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프 (Netscape), 익스플로러(Explorer), 크롬(Chrome) 등을 포함한다. 또한, 어플리케이션은 단말 상의 응용 프로그 램(Application)을 의미하며, 예를 들어 모바일 단말(스마트 폰)에서 실행되는 앱(App)을 의미한다. 본 발명의 일 실시 예에 따른 지식관리 서버는 하드웨어적으로 통상적인 웹 서버와 동일한 구성을 가지며, 소프트웨어적으로는 C, C++, Java, Visual Basic, Visual C 등과 같은 다양한 형태의 언어를 통해 구현되어 여 러 가지 기능을 하는 프로그램 모듈을 포함할 수 있다. 또한, 일반적인 서버용 하드웨어에 도스(Dos), 윈도우 (Window), 리눅스(Linux), 유닉스(Unix), 매킨토시(Macintosh), 안드로이드(Android), 아이오에스(iOS) 등의 운영 체제에 따라 다양하게 제공되고 있는 웹 서버 프로그램을 이용하여 구현될 수 있다. 지식관리 서버는 데이터베이스를 포함하여 구현될 수 있고, 데이터베이스와 독립적으로 구현될 수 있다. 데이터베이스와 독립적으로 구현된 경우, 지식관리 서버는 데이터베이스와 유선 또는 무선으로 연결되어 파일을 주고받을 수 있다. 사용자 단말은 지식관리 서버에 접근하는 사용자에 의해 사용될 수 있는 전자장치로서, 스마트폰 (Smart Phone), 태블릿 PC, 노트북 컴퓨터(Laptop Computer), 전자북 단말기, 디지털방송용 단말기, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player)로 구현될 수 있으며, 이에 한정되지 않 는다. 사용자 단말은 온라인 지식관리 플랫폼에 접속하여 인터넷 상의 특정 웹 페이지에 대한 북마크(bookmark) 를 수행할 수 있다. 지식관리 서버는 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트를 생성 및 저장할 수 있다. 한편, 지식관리 서버는 사용자 단말에 지식 노트 편집 툴을 제공할 수 있다. 사용자는 사용자 단말 을 통해 사용자 명령을 입력하여, 온라인 지식관리 플랫폼 내에서 지식 노트 편집 툴을 실행하고 지식 노 트 편집 툴 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성할 수 있다. 또한, 지식관리 서버는 온라인 지식관리 플랫폼 내에서 사용자 단말로부터 문서 파일을 업로드받을 수 있다. 지식관리 서버는 사용자가 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트, 지식 노트 및 문서 파일로부터 추출된 주요 키워드와 검색 키워드와의 유사도를 기반으로, 복수의 북마크 노트, 지식 노트 및 문서 파일에 대한 인공지능(AI) 기반의 문맥 검색을 수행할 수 있다. 지식관리 서버는 문맥 검색에 따라 검색 키워드에 대응되는 적어도 하나의 북마크 노트, 지식 노트 및/또 는 문서파일을 추출하여 사용자 단말에 제공할 수 있다. 도 2는 본 발명의 일 실시 예에 따른 지식관리 서버의 구성을 간략히 나타낸 블록도이다. 지식관리 서버는 도 2에 도시된 바와 같이, 북마크 노트 생성부, 지식 노트 편집부, 북마크 노 트 검색부, 지식 네트워크 생성부 및 데이터베이스를 포함한다. 다만, 지식관리 서버의 구 성요소가 전술한 예에 한정되는 것은 아니다. 예를 들어, 지식관리 서버는 전술한 구성요소보다 더 많은 구성요소를 포함하거나 더 적은 구성요소를 포함할 수 있다. 북마크 노트 생성부는 사용자가 사용자 단말을 통해 온라인 지식관리 플랫폼 내에서 인터넷 상의 특 정 웹 페이지에 대한 북마크(bookmark)를 수행하면, 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트 를 생성 및 저장하는 구성이다. 여기서, 사용자는 온라인 지식관리 플랫폼에 등록 계정을 보유한 회원일 수 있으며, 지식 데이터를 관리하는 각 회원의 아이디, 패스워드, 성명 등을 포함한 회원 정보는 데이터베이스의 회원 DB에 저장될 수 있다. 이때, 북마크 노트 생성부는 사용자 단말에서 실행된 웹 브라우저에서 제공하는 북마크 메뉴를 통해 웹 브라우저에 표시된 특정 웹 페이지에 대한 북마크를 수행하면, 해당 북마크된 웹 페이지에 포함된 텍스트를 스크래핑(scraping) 또는 크롤링(crawling)한후, 스크래핑된 텍스트로 구성된 북마크 노트를 생성하게 된다.또한, 북마크 노트 생성부는 사용자 단말에 제공된 온라인 지식관리 플랫폼 내 북마크 주소 입력 메 뉴에서 사용자가 특정 웹 페이지의 URL(Uniform Recource Locator)을 입력(복사하여 붙여넣기 등)하면, 입력된 해당 웹 페이지에 포함된 텍스트를 스크래핑(scraping) 또는 크롤링(crawling)하여 북마크 노트를 생성할 수도 있다. 이때, 북마크 주소 입력 메뉴는 지식 노트 편집 툴에서 제공되는 별도의 메뉴거나 지식 노트 편집 툴 내 텍스트 작성 화면 그 자체로 구성될 수도 있다. 이렇게 생성된 북마크 노트는 데이터베이스의 북마크 노트 DB에 저장될 수 있다. 또한 북마크 노트 DB는 사용자에 의해 생성된 지식 노트를 저장할 수도 있다. 사용자에 의해 업로드된 문서 파일(doc, hwp, pdf 등)의 경우, 데이터베이스의의 문서 파일 DB에 저장될 수 있다. 지식 노트 편집부는 사용자의 명령에 따라 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성하기 위한 지식 노트 편집 툴을 제공하는 구성이다. 구체적으로, 도 3을 참조하면, 온라인 지식관리 플랫폼 내 지식 노트 편집 툴에는 사용자가 직접 지식 정보 가 담긴 노트를 생성할 수 있는 화면이 표시될 수 있다. 이때, 사용자는 작성하고자 하는 지식 정보와 관련된 키워드(keyword)를 선정하여 입력할 수 있으며, 사용자가 선정된 키워드는 지식 노트 편집 툴의 일부 영역에 선택 가능한 아이콘 형식으로 표시될 수 있다. 또한, 지식 노트 편집 툴에 표시되는 키워드는 사용자가 입력한 지식 정보로부터 자동적으로 추출된 키 워드 또는 연관 키워드일 수 있다. 도 3에 도시된 바와 같이, 아이콘 형식으로 표시된 키워드 중 사용자가 적어도 하나의 키워드를 선택하 면, 선택된 키워드와 관련한 북마크 노트에 대한 정보(33-1, 33-4), 지식 노트에 대한 정보(33-2) 및/또는 문서 파일에 대한 정보(33-3)가 참조 정보로서 별도의 창으로 제공될 수 있다. 북마크 노트에 대한 정보(33-1, 33-4), 지식 노트에 대한 정보(33-2) 및/또는 문서 파일에 대한 정보(33-3)는 각각의 북마크 노트, 지식 노트 및/또는 문서 파일로부터 추출된 텍스트 정보 중 선택된 키워드와 가장 유사도 가 높은 문장의 일부로 구성될 수 있다. 한편, 사용자가 지식 노트 편집 툴 내 작성한 텍스트 중 일부를 드래그(drag)하면, 드래그된 부분에 대 한 편집을 수행할 수 있는 편집 도구가 표시될 수 있으며, 이때, 편집 도구 내 드래그된 부분에 대 한 검색을 수행할 수 있는 검색 메뉴가 제공될 수 있다. 사용자가 해당 검색 메뉴를 선택하면, 지식 노트 편집 툴은 드래그된 부분과 관련된 지식 정보를 포함하는 북마크 노트, 지식 노트 및/또는 문서 파일에 대한 정보를 제공할 수 있다. 한편, 도 4에 도시된 바와 같이, 북마크 노트 생성부는 지식 노트 편집 툴의 일부 영역에 사용자 가 특정 웹 페이지의 URL을 입력(복사하여 붙여넣기 등)하면, 해당 URL로 북마크 노트를 바로 생성할지 여부를 묻는 확인창을 표시할 수 있으며, 확인창에서 사용자가 북마크 노트를 생성할 것을 선택하면, 해당 URL 과 연결된 웹 페이지 내 텍스트를 스크래핑하여 북마크 노트를 생성할 수 있다. 한편, 북마크 노트 검색부는 사용자가 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 문맥 검 색에 따라 검색 키워드에 대응되는 적어도 하나의 북마크 노트, 사용자가 업로드한 문서 파일 및/또는 지식 노 트 편집 툴로부터 생성된 지식 노트를 추출 및 사용자에게 제공하는 구성이다. 이때, 북마크 노트 검색부는 기 저장된 복수의 북마크 노트로부터 추출된 주요 키워드와 검색 키워드와의 유사도를 기반으로, 복수의 북마크 노트에 대한 인공지능 기반의 문맥 검색을 수행할 수 있다."}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "구체적으로, 북마크 노트 검색부는 텍스트 요약 알고리즘 중 하나인 추출적 요약(Extractive"}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "Summarization)에 기초하여 기 저장된 복수의 북마크 노트로부터 대표성을 갖는 문장이나 구를 추출하여 요약을 생성하고, 그로부터 키워드의 등장 횟수에 기반한 자연어 특징 추출 알고리즘(CounterVectorize)에 따라 주요 키워드를 추출하게 된다. 이러한 방식으로 추출된 주요 키워드와 검색 키워드의 유사도를 비교하여 문맥 검색을 수행하는 과정에는 엘라 스틱서치 벡터(Elasticsearch DenseVector) 기반의 컨텍스트(Context) 분산 처리 검색 모델 등의 인공지능 모 델이 적용될 수 있다.또한, 북마크 노트 검색부는 문서 파일이 PDF, JPG, PNG 등의 텍스트 이미지 기반의 파일인 경우, 광학 문 자 인식(Optical Character Recognition; OCR)에 기반하여 문서 파일 내 텍스트를 탐색할 수 있다. 한편, 지식 노트 편집부는 지식 노트 편집 툴에서 입력된 검색 키워드 별 또는 검색 키워드를 포함하 는 문장 별로 검색 키워드에 대응되는 적어도 하나의 북마크 노트, 지식 노트 및/또는 문서 파일에 대한 정보를 각각 링크할 수 있다. 도 5를 참조하면, 사용자가 지식 노트 편집 툴의 화면에서 특정 텍스트의 일부를 선택하면, 선택된 일 부를 작성할 때 사용자가 참조한 북마크 노트, 지식 노트 및/또는 문서 파일에 대한 정보를 제공할 수 있는 링크 메뉴가 표시될 수 있다. 북마크 노트 검색부는 사용자가 해당 링크 메뉴를 선택하면, 선택된 일부의 내용을 기반으로 하는 문맥 검색을 수행하고, 그로부터 선택된 일부에 포함된 검색 키워드에 대응되는 북마크 노트, 지식 노트 및 /또는 문서 파일에 대한 정보의 일부 내용을 포함하는 참조 문서를 도출하여 새 창의 형태로 제공할 수 있 다. 이때, 링크되는 문서 파일에 대한 정보는 문서 파일 내 텍스트를 탐색하여 문맥 검색에 따라 추출된 문장 또는 단락을 포함할 수 있다. 사용자는 뷰어 메뉴를 통해, 참조 문서로 도출된 북마크 노트, 지식 노트 및/또는 문서 파일의 전체 내용을 확인할 수 있다. 지식 네트워크 생성부는 복수의 북마크 노트, 지식 노트 및/또는 문서 파일로부터 추출된 주요 키워드에 기초하여, 주요 키워드 간 관계를 연결한 지식 네트워크를 시각화하여 제공하는 구성이다. 구체적으로, 지식 네트워크 생성부는 저장된 복수의 북마크 노트, 지식 노트 및/또는 문서 파일을 복수의 북마크 노트, 지식 노트 및/또는 문서 파일로부터 추출된 주요 키워드 별로 분류할 수 있다. 지식 네트워크 생성부는 분류된 복수의 북마크 노트, 지식 노트 및/또는 문서 파일로부터 추출된 주요 키 워드 간 관계를 상기 분류 정보에 따라 연결한 지식 네트워크로 시각화하여 표시할 수 있다. 도 6을 참조하면, 사용자가 온라인 지식관리 플랫폼에 저장 또는 등록한 북마크 노트, 지식 노트 및/또는 문서 파일을 주요 키워드 간의 유사도(관련도)를 기반으로 트리(tree) 내지는 온톨로지(ontology) 형태의 구조의 계 층화된 네트워크로 시각화할 수 있다. 이때, 지식 네트워크 생성부는 지식 네트워크 내 주요 키워드에 대응되는 북마크 노트, 지식 노트 및/또는 문서 파일을 해당 주요 키워드 별로 링크시킬 수 있다. 도 7은 본 발명의 일 실시 예에 따른 지식관리 서비스의 제공 방법을 간략히 설명하기 위한 흐름도이다. 먼저, 사용자가 사용자 단말을 통해 제공되는 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이지에 대 한 북마크를 수행한다(S710). 이때, 웹 브라우저에서 제공하는 북마크 메뉴를 통해 웹 브라우저에 표시된 특정 웹 페이지에 대한 북마크를 수 행하거나 온라인 지식관리 플랫폼 내에서 제공하는 북마크 주소 입력 메뉴를 통해 특정 웹 페이지의 URL을 입력 하여 북마크를 수행할 수 있다. 이후, 북마크된 웹 페이지를 스크래핑하여 북마크 노트를 생성한다(S720). 이후, 사용자의 명령에 따라 온라인 지식관리 플랫폼 내에서 지식 정보를 작서 및 편집하여 지식 노트를 생성하 기 위한 지식 노트 편집 툴을 제공한다(S730). 이후, 사용자가 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터 추 출된 주요 키워드와 검색 키워드와의 유사도를 기반으로, 복수의 북마크 노트에 대한 인공지능 기반의 문맥 검 색을 수행한다(S740). 이때, 사용자가 온라인 지식관리 플랫폼 내 업로드한 복수의 문서 파일 및 지식 노트 편집 툴로부터 생성된 지 식 노트 내 텍스트를 탐색하여 추출된 주요 키워드와 검색 키워드와의 유사도를 기반으로, 복수의 문서 파일 및 지식 노트에 대한 인공지능 기반의 문맥 검색을 더 수행할 수 있다. 또한, 문서 파일이 텍스트 이미지 기반의 파일인 경우, OCR에 기반하여 문서 파일 내 텍스트를 탐색할 수 있다. 이후, 문맥 검색에 따라 검색 키워드에 대응되는 적어도 하나의 북마크 노트를 추출 및 사용자 단말에 제공한다 (S750). 이때, 문맥 검색에 따라 검색 키워드에 대응되는 적어도 하나의 문서 파일 및 지식 노트에 대한 정보를 사용자 에게 더 제공할 수 있다. 이때, 문서 파일 및 지식 노트에 대한 정보는 문서 파일 내 텍스트를 탐색하여 문맥 검색에 따라 추출된 문장 또는 단락을 포함할 수 있다. 도 8은 본 발명의 일 실시 예에 따른 컴퓨팅 장치를 구현할 수 있는 하드웨어 구성도이다. 본 실시 예에 따른 컴퓨팅 장치는 하나 이상의 프로세서, 시스템 버스, 네트워크 인터페이스 , 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(load)하는 메모리와, 컴퓨터 프로그램을 저장하는 스토리지를 포함할 수 있다. 도 8에는 실시 예와 관련 있는 구성요소들 만이"}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "도시되어 있다. 따라서, 본 명세서의 실시예들이 속한 기술분야의 통상의 기술자라면 도 8에 도시된 구성요소들 외에 다른 범용적인 구성요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 컴퓨팅 장치의 각 구성의 전반적인 동작을 제어할 수 있다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 명세서의 기술 분야에 잘 알려진 임의의 형태의 프로세서 중 적어도 하나를 포함하여 구성될 수 있다. 또한, 프로세서는 다양한 실시예들에 따른 방법/동작을 실행하기 위한 적어도 하나의 애 플리케이션 또는 프로그램에 대한 연산을 수행할 수 있다. 컴퓨팅 장치는 둘 이상의 프로세서를 구비할 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 명세서의 다양한 실시예들에 따른 방법/동작들을 실행하기 위하여 스토리지로부터 하나 이상의 프로그램을 로드(load) 할 수 있 다. 메모리의 예시는 RAM이 될 수 있으나, 이에 한정되는 것은 아니다. 시스템 버스는 컴퓨팅 장치 의 구성 요소 간 통신 기능을 제공한다. 상기 버스는 주소 버스(Address Bus), 데이터 버스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형 태의 버스로 구현될 수 있다. 네트워크 인터페이스는 통신망과 연결할 수 있다. 스토리지는 하나 이상의 컴퓨터 프로그램을 비임시적으로 저장할 수 있다. 스토리지는 플래시 메모리 등과 같은 비 휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 명세서의 실시예들이 속하는 기술 분야에서 잘 알려진 임 의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 본 명세서의 다양한 실시예들에 따른 방법/동작들이 구현된 하나 이상의 인스트럭션들 (instructions)을 포함할 수 있다. 컴퓨터 프로그램이 메모리에 로드 되면, 프로세서는 상기 하나 이상의 인스트럭션들을 실행시킴으로써 본 명세서의 다양한 실시예들에 따른 방법/동작들을 수행할 수 있 다. 컴퓨터 프로그램은, 도 2 내지 도 7을 참조하여 설명한 방법을 위한 인스트럭션들을 포함할 수 있다. 이상과 같은 본 발명의 다양한 실시 예에 따르면, 사용자가 지식정보를 생산하는 과정에서 관련된 정보를 보다 쉽고 빠르게 참조할 수 있게 된다. 또한, 문맥 검색에 따라 사용자가 의도한 지식 정보를 검색하여 제공해줄 수 있으므로, 지식정보 생산 과정에서 사용자가 정확하게 키워드를 기억하지 못하더라도 원하는 정보를 찾기 수월해질 수 있다. 또한, 사용자에 의해 누적된 지식 정보를 자동으로 분류 및 그 관계를 네트워크 정보로 보여줌으로써, 지식 정 보의 관리가 편리해질 수 있다. 한편, 상술한 다양한 실시 예에 따른 지식관리 서비스 제공 방법은 프로그램으로 구현되어 다양한 기록 매체에 저장될 수 있다. 즉, 각종 프로세서에 의해 처리되어 상술한 지식관리 서비스 제공 방법을 실행할 수 있는 컴퓨 터 프로그램이 기록 매체에 저장된 상태로 사용될 수도 있다. 일 예로, ⅰ) 사용자가 온라인 지식관리 플랫폼 내에서 인터넷 상의 특정 웹 페이지에 대한 북마크(bookmark)를 수행하는 단계, ⅱ) 북마크된 웹 페이지를 스크래핑(scraping)하여 북마크 노트를 생성 및 저장하는 단계, ⅲ) 사용자의 명령에 따라 온라인 지식관리 플랫폼 내에서 지식 정보를 작성 및 편집하여 지식 노트를 생성하기 위 한 지식 노트 편집 툴을 제공하는 단계, ⅳ) 사용자가 지식 노트 편집 툴에서 특정 검색 키워드를 입력하면, 기 저장된 복수의 북마크 노트로부터 추출된 주요 키워드와 검색 키워드와의 유사도를 기반으로, 복수의 북마크 노 트에 대한 인공지능 기반의 문맥 검색을 수행하는 단계 및, ⅴ) 문맥 검색에 따라 상기 검색 키워드에 대응되는 적어도 하나의 북마크 노트를 추출 및 사용자에게 제공하는 단계를 수행하는 프로그램이 저장된 비일시적 판독가능 매체(non-transitory computer readable medium)가 제공될 수 있다. 비일시적 판독 가능 매체란 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니 라 반영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상 술한 다양한 어플리케이션 또는 프로그램들은 CD, DVD, 하드 디스크, 블루레이 디스크, USB, 메모리카드, ROM 등과 같은 비일시적 판독 가능 매체에 저장되어 제공될 수 있다. 이상에서는 본 발명의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0012492", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 발명의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2023-0012492", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 상세한 설명에서 인용되는 도면을 보다 충분히 이해하기 위하여 각 도면의 간단한 설명이 제공된다. 도 1은 본 발명의 일 실시 예에 따른 지식관리 서비스 제공 시스템을 나타낸 도면, 도 2는 본 발명의 일 실시 예에 따른 지식관리 서버의 구성을 간략히 나타낸 블록도, 도 3은 본 발명의 일 실시 예에 따른 지식 노트 편집 툴의 화면을 나타낸 도면, 도 4는 본 발명의 일 실시 예에 따른 지식 노트 편집 툴에서 북마크 노트를 생성하는 화면을 나타낸 도면, 도 5는 본 발명의 일 실시 예에 따른 지식 노트 편집 툴에서 링크 정보를 표시하는 화면을 나타낸 도면, 도 6은 본 발명의 일 실시 예에 따른 지식 네트워크를 시각화하여 제공하는 화면을 나타낸 도면, 도 7은 본 발명의 일 실시 예에 따른 지식관리 서비스의 제공 방법을 간략히 설명하기 위한 흐름도, 도 8은 본 발명의 일 실시 예에 따른 컴퓨팅 장치를 구현할 수 있는 하드웨어 구성도이다."}
