{"patent_id": "10-2019-0161803", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0071525", "출원번호": "10-2019-0161803", "발명의 명칭": "영상물 등급 판정 방법 및 장치", "출원인": "가톨릭대학교 산학협력단", "발명자": "성재열"}}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컴퓨팅 시스템의 영상물 등급 판정 방법에 있어서,영상물의 대본으로부터 키워드들을 추출 및 매핑하는 단계;상기 추출된 키워드들의 분석에 기초하여 상기 영상물의 등급을 1차 결정하는 단계;적어도 하나의 상기 키워드에 해당하는 장면의 이미지 데이터를 인공지능 시스템으로 분석하는 단계;영상물 등급 상기 인공지능 시스템의 분석 결과를 사용하여 상기 영상물의 등급을 2차 결정하는 단계를 포함하며, 상기 인공지능 시스템은 신경망 모델로서 구현되며, 상기 신경망 모델은, 등급이 결정된 영상물의 이미지 데이터를 입력 데이터로 사용하고, 상기 등급을 정답 데이터로 사용하여 사전에 학습된, 영상물 등급 판정 방법."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 키워드는 장면 번호, 등급 값, 및 특성 값의 3개의 값들로 매핑되는, 영상물 등급 판정 방법."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 영상물 등급의 1차 결정은, 상기 영상물의 대본에 포함된 키워드들의 상기 장면 번호, 상기 등급 값 및 특성 값에 기초하여 수행되는, 영상물 등급 판정 방법."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 인공지능 시스템의 분석은, 상기 등급 값 또는 상기 특성 값이 특정 범위 내인 장면에 대해 수행되거나,특정 유형의 키워드가 포함된 장면에 대해 수행되는, 영상물 등급 판정 방법."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4 항에 있어서,상기 인공지능 시스템 분석의 결과인 등급이 상기 키워드에 기초한 등급보다 높은 경우, 상기 인공지능 시스템분석의 결과인 등급이 우선 적용되는, 영상물 등급 판정 방법."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기 2차 결정된 영상물 등급을 국가별 차이에 기초하여 조정하는 단계를 더 포함하며, 상기 국가별 차이는 문화적 차이, 제도적 차이, 지역적 차이, 또는 경제적 차이 중 적어도 하나를 더 포함하는, 영상물 등급 판정 방법."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서, 상기 신경망 모델은, 국가별로 등급이 결정된 영상물의 이미지 데이터를 입력 데이터로 사용하고, 상기 국가별등급을 정답 데이터로 사용하여 학습됨으로써, 대상 국가에 따라 다르게 모델링되는, 영상물 등급 판정 방법.공개특허 10-2021-0071525-3-청구항 8 영상물 등급을 판정하는 컴퓨팅 장치에 있어서,데이터를 저장하는 메모리, 및상기 메모리에 저장된 데이터를 저장하는 프로세서를 포함하고, 상기 컴퓨팅 장치는, 영상물의 대본으로부터 키워드들을 추출 및 매핑하고,상기 추출된 키워드들의 분석에 기초하여 상기 영상물의 등급을 1차 결정하고,적어도 하나의 상기 키워드에 해당하는 장면의 이미지 데이터를 인공지능 시스템으로 분석하고,영상물 등급 상기 인공지능 시스템의 분석 결과를 사용하여 상기 영상물의 등급을 2차 결정하며,상기 인공지능 시스템은 신경망 모델로서 구현되며, 상기 신경망 모델은, 등급이 결정된 영상물의 이미지 데이터를 입력 데이터로 사용하고, 상기 등급을 정답 데이터로 사용하여 사전에 학습된, 컴퓨팅 장치."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 키워드는 장면 번호, 등급 값, 및 특성 값의 3개의 값들로 매핑되고,상기 영상물 등급의 1차 결정은, 상기 영상물의 대본에 포함된 키워드들의 상기 장면 번호, 상기 등급 값 및 특성 값에 기초하여 결정되는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0161803", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 인공지능 시스템의 분석은, 상기 등급 값 또는 상기 특성 값이 특정 범위 내인 장면에 대해 수행되거나,특정 유형의 키워드가 포함된 장면에 대해 수행되는, 컴퓨팅 장치."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "컴퓨팅 시스템의 영상물 등급 판정 방법이 개시된다. 본 발명의 실시예에 따른 방법은, 영상물 대본으로부터 키 워드들을 추출 및 매핑하는 단계, 키워드 분석에 기초하여 등급을 1차 결정하는 단계; 키워드에 해당하는 장면의 이미지 데이터를 인공지능 시스템으로 분석하는 단계 및 인공 지능 시스템의 분석 결과를 사용하여 영상물 등급 을 2차 결정하는 단계를 포함한다."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상물 등급 판정 방법 및 장치에 대한 것으로, 특히, 시나리오의 키워드와 영상물의 이미지 데이터 를 사용하여 영상물 등급 판정을 완전히 자동화하는 방법 및 장치에 대한 것이다."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신경망은 인간의 뇌에서 뉴런들이 연결된 것처럼 구성한 네트워크를 말한다. 수학적 모델로서의 뉴런이 상호 연 결되어 네트워크를 형성하며, 생물학적 신경망과 구별하여 인공 신경망이라고도 지칭할 수 있다. 최근 인공지능 의 적용 범위가 증가함에 따라서 인공지능 구현을 위한 알고리즘 중 하나인 신경망 또한 많은 기술 분야에 적용 되고 있다. 그리고 신경망을 사용해 구현된 인공지능을 통해, 많은 프로세스들이 자동화되고 있다."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "현재 대한민국 영상물 등급분류는 영상물등급위원회에서 전문가 위원회를 구성해 영상을 확인하는 방식으로 진 행되고 있다. 이 같은 분류방법은 많은 시간과 비용이 소요될 뿐만 아니라 심사위원회의 주관적 판단이 개입될 가능성도 높다. 이로 인해 영상물 제작사는 등급분류의 명확성을 담보하기 힘들어 사업 계획에도 혼선을 유발할 수 있다."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 해결하기 위하여, 본 발명의 실시예에 따른 컴퓨팅 시스템의 영상물 등급 판정 방법은, 영상물의 대본으로부터 키워드들을 추출 및 매핑하는 단계; 상기 추출된 키워드들의 분석에 기초하여 상기 영상물의 등급을 1차 결정하는 단계; 적어도 하나의 상기 키워드에 해당하는 장면의 이미지 데이터를 인공지능 시스 템으로 분석하는 단계; 영상물 등급 상기 인공지능 시스템의 분석 결과를 사용하여 상기 영상물의 등급을 2차 결정하는 단계를 포함하며, 상기 인공지능 시스템은 신경망 모델로서 구현되며, 상기 신경망 모델은, 등급이 결 정된 영상물의 이미지 데이터를 입력 데이터로 사용하고, 상기 등급을 정답 데이터로 사용하여 사전에 학습된다. 본 발명의 실시예에 따른 영상물 등급 판정 방법에 있어서, 상기 키워드는 장면 번호, 등급 값, 및 특성 값의 3 개의 값들로 매핑된다. 본 발명의 실시예에 따른 영상물 등급 판정 방법에 있어서, 상기 영상물 등급의 1차 결정은, 상기 영상물의 대 본에 포함된 키워드들의 상기 장면 번호, 상기 등급 값 및 특성 값에 기초하여 수행된다. 본 발명의 실시예에 따른 영상물 등급 판정 방법에 있어서, 상기 인공지능 시스템의 분석은, 상기 등급 값 또는 상기 특성 값이 특정 범위 내인 장면에 대해 수행되거나, 특정 유형의 키워드가 포함된 장면에 대해 수행되된다. 본 발명의 실시예에 따른 영상물 등급 판정 방법에 있어서, 상기 인공지능 시스템 분석의 결과인 등급이 상기 키워드에 기초한 등급보다 높은 경우, 상기 인공지능 시스템 분석의 결과인 등급이 우선 적용된다. 본 발명의 실시예에 따른 영상물 등급 판정 방법에 있어서, 상기 2차 결정된 영상물 등급을 국가별 차이에 기초 하여 조정하는 단계를 더 포함하며, 상기 국가별 차이는 문화적 차이, 제도적 차이, 지역적 차이, 또는 경제적 차이 중 적어도 하나를 더 포함한다. 본 발명의 실시예에 따른 영상물 등급 판정 방법에 있어서, 상기 신경망 모델은, 국가별로 등급이 결정된 영상 물의 이미지 데이터를 입력 데이터로 사용하고, 상기 국가별 등급을 정답 데이터로 사용하여 학습됨으로써, 대 상 국가에 따라 다르게 모델링된다. 상술한 기술적 과제를 해결하기 위하여, 본 발명의 실시예에 따른 영상물 등급을 판정하는 컴퓨팅 장치는, 데이 터를 저장하는 메모리, 및 상기 메모리에 저장된 데이터를 저장하는 프로세서를 포함하고, 상기 컴퓨팅 장치는, 영상물의 대본으로부터 키워드들을 추출 및 매핑하고, 상기 추출된 키워드들의 분석에 기초하여 상기 영상물의 등급을 1차 결정하고, 적어도 하나의 상기 키워드에 해당하는 장면의 이미지 데이터를 인공지능 시스템으로 분 석하고, 영상물 등급 상기 인공지능 시스템의 분석 결과를 사용하여 상기 영상물의 등급을 2차 결정하며, 상기 인공지능 시스템은 신경망 모델로서 구현되며, 상기 신경망 모델은, 등급이 결정된 영상물의 이미지 데이터를 입력 데이터로 사용하고, 상기 등급을 정답 데이터로 사용하여 사전에 학습된다."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 영상물 등급 판정이 자동화될 수 있다. 따라서 심사위원의 특성에 따라서 주관적으로 변경됨 이 없이, 일정한 결과가 기대될 수 있다. 또한, 심사 프로세스가 전산화 됨에 따라서 비용 및 시간 등의 필요한 자원이 모두 절약될 수 있다."}
{"patent_id": "10-2019-0161803", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 바람직한 실시예에 대해 구체적으로 설명하며, 그 예는 첨부된 도면에 나타낸다. 첨부된 도면을 참조 한 아래의 상세한 설명은 본 발명의 실시예에 따라 구현될 수 있는 실시예만을 나타내기보다는 본 발명의 바람 직한 실시예를 설명하기 위한 것이다. 다음의 상세한 설명은 본 발명에 대한 철저한 이해를 제공하기 위해 세부 사항을 포함하지만, 본 발명이 이러한 세부 사항을 모두 필요로 하는 것은 아니다. 본 발명은 이하에서 설명되 는 실시예들은 각각 따로 사용되어야 하는 것은 아니다. 복수의 실시예 또는 모든 실시예들이 함께 사용될 수있으며, 특정 실시예들은 조합으로서 사용될 수도 있다. 본 발명에서 사용되는 대부분의 용어는 해당 분야에서 널리 사용되는 일반적인 것 들에서 선택되지만, 일부 용 어는 출원인에 의해 임의로 선택되며 그 의미는 필요에 따라 다음 설명에서 자세히 서술한다. 따라서 본 발명은 용어의 단순한 명칭이나 의미가 아닌 용어의 의도된 의미에 근거하여 이해되어야 한다. 도 1은 본 발명의 실시예에 따른 신경망 모델 및 각 노드의 동작을 나타낸다. 도 1(a)는 본 발명의 실시예에 따른 신경망을 나타낸다. 신경망은 뉴런들을 포함하며, 도 1(a)에서 각각의 원들 이 뉴런들을 나타낸다. 그리고 복수의 뉴런들의 집합을 레이어라고 한다. 뉴런들은 이하에서 노드라고 지칭할 수 있다. 입력 데이터를 받는 레이어를 입력 레이어, 신경망의 연산 결과가 출력되는 레이어를 출력 레이어라고 지칭한다. 도 1(b)는 신경망에서 뉴런의 동작을 나타낸다. 뉴런은 입력(i_0, i_1)에 가중치(w_0, w_1)를 적용하고, 활성함 수(f(x)) 연산을 수행하여 출력을 제공한다. 활성 함수는 실제 신경 세포처럼 일정 수준 이상의 자극이 주어졌 을 때 값이 급격히 커지는 함수가 사용될 수 있다. 선형 함수를 사용하면 분석 능력이 감소할 수 있어, 비선형 함수가 사용될 수 있다. 실시예로서, 활성 함수는 시그모이드(sigmoid), tenh, 렐루(relu) 등의 함수가 사용될 수 있다. 활성 함수는 입력 신호의 총합을 그대로 사용하지 않고, 출력 신호로 변환한다. 즉 활성 함수는 가중 치가 적용된 입력들에 대해 활성화 여부를 결정한다. 신경망은 특정 태스크의 수행을 위해 학습한다. 즉 시스템이 특정 태스크의 수행을 위해 신경망을 구성하고, 신 경망을 트레이닝할 수 있다. 예를 들면, 사진을 보고 개인지 고양이인지를 알아내는 태스크가 수행될 수 있다. 시스템은 복수의 사진들과 복수의 사진에 대한 정답 데이터(개 또는 고양이)를 사용함으로써 입력 데이터 연산 (프로세싱), 출력 데이터와 정답 데이터의 비교 및 가중치의 조정 동작을 반복하여 수행한다. 이렇게 트레이닝 된 신경망은 태스크를 수행할 준비가 된다. 본 명세서에서, 신경망의 학습/트레이닝을 위한 입력 및 정답을 포 함하는 데이터를 데이터 세트 또는 트레이닝 데이터라고 지칭할 수 있다. 도 2는 본 발명의 실시예에 따른 인공지능 시스템/신경망을 나타낸다. 도2는 본 발명의 실시예에 따른 인공지능 시스템 또는 신경망을 나타낸다. 도 1에서, 신경망은 입력 레이어(input), 출력 레이어(output) 및 히든 레이어들(layer1~layer3)을 포함한다. 입력 레이어(input)는 들어온 신호/데이터를 다음 레이어로 전달할 수 있다. 출력 레이어의 노드들의 출력이 신 경망의 최종 결과값에 해당할 수 있다. 입력 레이어와 출력 레이어 사이의 적어도 하나의 레이어를 히든 레이어 라고 지칭한다. 특히 히든 레이어가 복수인 신경망을 심층 신경망이라고 부를 수도 있으며, 본 발명에서는 심층 신경망을 실시예로 설명한다. 신경망은 학습 또는 트레이닝에 의해 모델링될 수 있다. 신경망이 모델링되면, 그 신경망은 시스템이 원하는 태 스크를 수행할 준비가 된 것으로 볼 수 있다. 즉 모델링된 신경망은 입력에 대해 추론된 출력을 제공할 수 있다. 신경망은 목표 태스크를 수행하기 위해 모델링될 수 있다. 목표 태스크를 달성하도록 신경망을 트레이닝하기 위 해 데이터 세트가 준비될 수 있으며, 이러한 데이터 세트를 트레이닝 데이터라고 지칭할 수 있다. 데이터 세트 는 복수의 데이터 쌍(Data Pair 1, Data Pair 2, Data Pair3..)을 포함하며, 데이터 쌍은 입력 데이터와 라벨 데이터를 포함한다. 라벨 데이터는 원 핫 인코딩된(one hot encoded) 데이터로서 하나의 정답을 나타낼 수 있다. 실시예로서, 라벨 데이터는 원 핫 인코딩된 데이터로서, 복수의 바이너리 값들을 포함할 수 있다. 라벨 데이터는 정답 데이터라고 지칭할 수도 있다. 트레이닝 데이터는 복수의 데이터 쌍을 포함할 수 있다. 다만, 데이터의 분류에 따라서 트레이닝 데이터는 입력 데이터와 라벨 데이터를 포함할 수도 있다. 입력 데이터와 라벨 데이터는 서로 매칭될 수 있다. 즉 n번째 입력 데이터에 대한 정답이 n번째 라벨 데이터에 해당할 수 있다. 신경망의 히든 레이어는 노드들을 포함하며, 노드들은 가중치(weight)를 갖는다. 노드들의 가중치는 트레이닝 단계에서 학습을 통해 결정/조정될 수 있다. 신경망은 라벨 데이터와 출력 데이터의 차이가 적어지도록 각 노드 들의 가중치들을 조정할 수 있다. 노드들에 대한 적어도 하나의 가중치를 신경망의 파라미터로 지칭할 수도 있다. 즉, 시스템/신경망은 각각의 입력 데이터, 출력 데이터 및 라벨 데이터에 대해 신경망의 파라미터 조정을 수행할 수 있으며, 이러한 파라미터 조정은 트레이닝 데이터에 포함된 입력 데이터, 출력 데이터 및 라벨 데이 터의 수만큼 반복 수행될 수 있다. 도 2의 실시예에서, 신경망은 (1,3,0,6,5,4,7,2)를 입력 데이터로, (0,0,1,0)을 정답 데이터로 사용하여 학습된 다. 입력 데이터에 대해 (0.1,0.2,0.6,0.1)이 출력되고, 신경망은 정답 데이터를 참고하여 신경망의 파라미터를 조정할 수 있다. 본 발명의 실시예에서, 입력 데이터는 영상물의 이미지 데이터가 사용되고, 정답 데이터로는 영상물의 등급이 사용될 수 있다. 도 3은 본 발명의 실시예에 따른 인공지능 시스템의 학습 방법을 나타낸다. 본 발명의 실시예에 따른 인공지능 시스템은 신경망을 포함하며, 입력 데이터 및 정답 데이터에 의해 학습될 수 있다. 입력 데이터로서는 기존에 등급이 판정된 영상물의 이미지 데이터가 사용될 수 있다. 그리고 정답 데이터 로서는 기존에 판정된 등급이 사용될 수 있다. 특히, 등급 판정의 이유가 된 장면의 이미지 데이터가 입력 데이 터로 사용될 수도 있다. 예를 들면, 특정 영화가 특정 장면으로 인해 \"15 세 이상 관람가\" 판정을 받은 경우, 그 장면에 해당하는 이미지들이 입력 데이터로 사용되고, \"15세 이상 관람가\"의 등급이 정답 데이터로 사용될 수 있다. 인공지능 시스템이 충분히 학습되고 나면, 새로운 영상물의 이미지 데이터를 입력하면, 해당 이미지에 대한 영 상물 등급이 출력될 수 있다. 다만, 영상보다 대사나 음성으로 인해 등급 판정이 결정될 수도 있다. 또한, 스토 리나 맥락으로 인해 등급 판정이 영향받을 수도 있다. 이를 모두 학습을 통해 인공지능 시스템으로 해결하는 것 은, 매우 어려운 일로서, 방대한 양의 데이터와 신경망 및 학습이 필요할 수 있다. 다시 말하면, 영상물을 이미지로만 인식하여 인식하는 경우, 등장 인물이나 캐릭터의 개성이 강하고 스토리의 맥락(context)를 명확히 파악하기 힘들어, 정확성을 높이기 위해 딥러닝을 위해 막대한 데이터 및 신경망이 요 구된다. 따라서, 본 발명에서는 시나리오에 포함된 단어를 중심으로 등급을 1차 분류하고, 추가 분석이 필요한 경우에만 영상 분석을 추가로 수행함으로써, 영상물 등급 판정의 정확성 및 효율성을 향상시킬 수 있다. 즉, 백 프로퍼게이션(back propagation)에서 텍스트 활용의 비중을 높이고, 이미지 분석은 검증 및 패드백의 역할을 받 도록 구성할 수 있다. 본 발명에서는, 인공지능 시스템을 통한 등급 판정을 사용하되, 이에 전적으로 의존하지 않고, 시나리오의 텍스 트 분석 및 텍스트에 기초한 등급 판정의 보충 수단으로 사용하고자 한다. 이하에서는, 텍스트 추출을 통한 영 상물 분석 방법에 대해 설명한다. 등급 판정은 컴퓨팅 시스템에 의해 수행되며, 컴퓨팅 시스템은 상술한 인공지 능 시스템을 포함할 수 있다. 도 4는 본 발명의 실시예에 따른 영상물 등급 판정 방법을 나타낸다. 본 발명의 컴퓨팅 시스템은, 시나리오/대본으로부터 단어를 추출 및 분석할 수 있다(S4010). 시나리오에 표시된 단어들은 해당 단어가 추출된 장면(scene) 번호, 단어의 등급 분류 및 단어의 특성으로 매핑 될 수 있다. 즉, 등급 선정에 필요한 단어들은 장면 번호, 등급 값 및 특성 값의 3개의 값들로 매핑될 수 있다. 장면 번호의 경우, 해당 단어가 몇 번째 장면에서 사용되는지를 숫자로 표시할 수 있다. 장면 번호는 주요 단어 가 몇 번의 장면에 걸쳐 등장하는지를 참고하는데 사용될 수도 있다. 예를 들면, 선정적이거나 폭력적인 단어가 복수의 장면에 걸쳐 등장하는 경우, 등급 분류가 상향될 수 있기 때문이다. 등급 값은 국가별 관람 등급에 따라 설정될 수 있다. 본 발명의 실시예에서는, 영상물 등급 위원회의 등급 분류 인 전체 관람가, 12세이상 관람가, 15세 이상 관람가, 청소년 관람불가, 제한상영가로 분류하였다. 그리고 이들 을 각각 6, 12, 15, 18, 12의 등급 값으로 매핑하여 표시한다. 단어는 특성에 따라서 양성(positive), 음성(negative), 중성(neutral)로 구분 및 매핑된다. 즉, 단어는 그 특 성에 따라서 +, -, 0(또는 N)으로 표시 및 매핑될 수 있다. 양성의 경우 관람 등급의 하향 조정에 영향을 미치 는 단어를, 음성의 경우 관람 등급의 상향 조정에 영향을 미치는 단이다. 중성은 상황이나 텍스트에 따라서 판 단될 수 있는 단어가 될 수 있다. 예를 들면, 자유 민주주의는 +, 독재주의는 -, 페미니즘은 N으로 표시될 수 있다. 본 발명의 실시예에서, 등급 자동화를 위해 등급에 영향을 주는 주요 단어들을 미리 분류하여, 3가지 값으로 매 핑해둔 후, 컴퓨팅 시스템에서 이 매핑 테이블에 기초하여 단어를 분석할 수 있다. 특히, 영상물 등급위원회의 등급 분류엔 주제, 선정성, 폭력성, 대사, 공포, 약물, 모방위험의 7가지 유형으로 단어를 분류하고, 아래와 예 시적인 표와 같이 매핑할 수 있다. 표 1 유형 예시 주제 주제는 사회, 가족, 국가, 민족, 종교 등에 대한 가치관에 영향을 미치는 내용을 기반으로 한다.주체사상(#, 15, -), 무정부주의(#, 15, -), 허무주의(#, 15, -), 염세주의(#, 15, -), 무신론(#, 15, -), 자본주의(#, 12, +), 사 회주의(#, 12, -), 공산주의(#, 12, -), 물질만능주의(#, 12, -), 위안부(#, 12, -), 세월호(#, 12, -), 노예(#, 12, -), 낙관주의 (#, 12, +), 공리주의(#, 12, +), 민주주의(#, 6, +), 시장경제 (#, 6, +), 페미니즘(#, 12, N) 등 선정성 성적 단어 및 행위에 대한 선정성 을 기준으로 한다.수간(#, 21, -), 로리타(#, 18, -), 근친상간(#, 18, -), 원조교 제(#, 18, -), SM(#, 18, -), 섹스(#, 18, -), 사창가(#, 18, -), 성접대(#, 18, -), 동성애(#, 18, -), 룸살롱(#, 18, -), 호 스트바(#, 18, -) 애무(#, 15, -), 창녀/창놈(#, 15, -), 능욕 (#, 15, -), 자위(#, 12, -), 란제리(#, 12, -), 브래지어(#, 12, -), 뽀뽀(#, 6, +) 등 폭력성 신체부위, 도구 등을 이용해 상해, 유혈, 신체훼손 등을 표현한 정도 를 분석한다.살인(#, 18, -), 절단(#, 18, -), 성폭행(#, 18, -), 고문(#, 15, -), 찰과상(#, 12, -), 타박상(#, 12, -), 강도(#, 15, -), 절상(#, 15, -), 자상(#, 15, -), 열상(#, 15, -), 화상(#, 15, -), 성추행(#, 15, -), 골절(#, 12, -), 탈구(#, 12, -), 긁힘 (#, 6, -) 등 대사 욕설, 비속어, 저속어 등 대인관계 등을 통해 접할 수 있는 수준으로 구분한다.니미(#, 19, -), 니애미(#, 19, -), 앰창(#, 19, -), 걸레년(#, 15, -), 창년(#, 15, -), 좆병신(#, 15, -), 개병신(#, 15, -), 병신(#, 12, -), 씨발(#, 12, -), 지랄(#, 12, -), 또라이(#, 12, -), 개새끼(#, 12, -) 공포 심리적 불안이나 긴장을 발생시키는 정도로 구분한다.교수형(#, 18, -), 총살(#, 18, -), 죽음(#, 15, -), 사이코패스 (#, 15, -), 소시오패스(#, 15, -), 삐에로포비아(#, 15, -), 고 소공포증(#, 12, -), 환공포증(#, 12, -), 상어(#, 12, -), 호랑 이(#, 12, -), 귀신(#, 12, -), 강시(#, 12, -), 구미호(#, 12, -), 추락(#, 12, -) 약물 음주, 흡연을 비롯해 향정신성 의 약품의 오남용, 마약 등 불법 약물 의 제조 및 이용 등에 대한 내용으 로 구분한다.뽕(#, 15, -), 대마초(#, 15, -), 떨(#, 15, -), 코카인(#, 15, -), LSD(#, 15, -), 헤로인(#, 15, -), 필로폰(#, 15, -), 아편 (#, 15, -), 음주(#, 12, -), 흡연(#, 12, -) 모방위험 모방위험의 요소가 있으며 이를 조 장하거나 정당화하는 정도로 구분한 다.자살(#, 19, -), 강제구금(#, 19, -), 폭발물(#, 15, ), 총기(#, 15, -), 소매치기(#, 15, -), 집단폭행(#, 15, -), 왕따(#, 15, -) 등 본 발명의 컴퓨팅 시스템은, 분석된 단어를 사용하여 관람 등급을 분류할 수 있다(S4020). 컴퓨팅 시스템은, 특성 값이 '-'인 단어들을 관람등급 나이와 빈도로 점검하여, 영상물 등급을 판단할 수 있다. 관람등급의 '나이'보다 '빈도'가 우선시되며, 7개 항목 중 가장 높은 등급이 전체 관람 등ㄱ브을 결정한다. 예 를 들면, 선정성이 청소년 관람불가인데 나머지 6개 항목이 모두 전체관람가가 되어도, 해당 영상물은 청소년 관람불가 판정을 받는다. 또한, 실시예로서, 특성 값이 '-'인 단어들이 3개 장면에서 반복 등장하거나, 한 장면 에서 3번이상 반복되는 경우, 관람 연령대를 1단계 상향조정할 수도 있다. 예를 들면, '12세 관람가' 등급의 ' 개새끼'라는 단어가 3개 장면에 걸쳐 지속적으로 반복되는 경우, 영상물 등급은 '15세 이상 관람가'로 상향 조 정될 수 있다. 표2는 주요단어 등급별 영상물 관람등급 분류의 예시를 나타낸다. 표 2 관람등급 주제 선정성폭력성대사 공포 약물 모방위험합계 6 (전체관 람)12 (12세 이 상 관람가)-물질만 능주의(#) -노예(#) -노예(#)-개새끼 (#) -개새끼 (#) -개새끼 (#) -씨발(#)7 15 (15세 이 상 관람가)-무신론 (#) -주체사상 (#)-걸레년 (#) -창년(#)-대마초 (#) -마약(#)-집단폭행 (#)7 18 (청소년 관람 불가)-성접대 (#)-성폭행 (#) -성폭행 (#) -성폭행 (#)-교수형 (#) -총살(#)-강제구금 (#)7 21 (제한 상 영가) 합계 5 1 3 6 2 2 2 <표 2>의 경우, 주제~모방위험까지 7개의 유형 중에 18(청소년관람불가)가 있기 때문에 본 영상의 등급은 빈도 와 상관없이 컴퓨팅 시스템은 '청소년관람불가' 판단을 내린다. 그러나 이처럼 전체 스토리의 맥락을 고려하지 않은 채 주요 단어의 등장만으로 평가할 경우 표현의 자유를 침해할 위험이 있다. 따라서 가장 높은 등급을 받 은 단어에 대한 맥락 분석이 필요할 수도 있다. 컴퓨팅 시스템은 등급 분류된 영상물의 등급을 조정할 수 있다(S4030). 컴퓨팅 시스템은 단어가 추출된 시나리오의 맥락(context)에 기초하여 등급을 조정할 수도 있다. 동일한 단어임에도 불구하고 맥락(context)에 따라 전혀 다른 의미를 전달할 수 있다. 따라서 동일한 문장 및 장면에서 단어 간 조합을 통해 맥락을 분석한다. 단어 간 맥락 분석은 ‘단어의 등급분류(6, 12, 15, 18, 21)’ 와 ‘단어의 특성(+, -, N)’의 조합을 중심으로 한다. 두 단어의 맥락을 분석할 때 등급분류는 더 높은 값을 따르며, 단어의 특성은 두 단어의 조합을 중심으로 정리한다. 두 단어의 조합의 경우 주체와 행동 간 결과가 긍정적일 경우 +로, 부정적일 경우 -로 표현된다. 예를 들면 아 래와 같다. 여고생(#, 6, +) * 공부(#, 6, +) → (6, +): 전체 관람가 여고생(#, 6, +) * 원조교제(#, 19, -) → (19, -): 청소년 관람불가 또한, 동일한 장면이 아닌 다른 장면과 연결했을 때 맥락에 영향을 미칠 경우 등급을 조정할 수 있다. 즉, 전체 맥락에서 선행 장면이 부정적이거나 중립적인데 결과도 부정적일 경우 관람등급이 한 단계 상승할 수 있으며, 선행 장면이 부정적이거나 중립이라도 결과가 긍정적일 경우 관람등급이 한 단계 하락할 수 있다. 예를 들면 아 래와 같다. 세상(#, 6, +) * 허무(#, 15, -) → (15, -): 15세 이상 관람가 허무(#, 15, -) * 자살(#, 19, -) → (19, -): 청소년 관람불가 허무(#, 15, -) * 극복(#, 6, +) → (12, +): 12세 이상 관람가 또한, 전체 맥락에서 결과가 인간의 보편적 존엄, 사회적 가치, 선량한 풍속 또는 국민정서를 현저하게 해치는 경우 등급을 상향 조정한다. 예를 들면 아래와 같다. 주체사상(#, 15, -) * 실패(#, 6, -) → (12, +): 12세 이상 관람가 → 관람등급 하락 주체사상(#, 15, -) * 찬양(#, 6, +) → (21, -): 제한상영가 → 관람등급 상승 또는 상영금지 단어 간 맥락분석을 통해 상황의 정도에 따라 등급분류를 상향시킬 수 있다. 특히 선정성이나 폭력성의 경우 판 단 기준이 될 수 있다. 예를 들면 아래와 같다. 손가락(#, 6, +) * 절단(#, 6, -) → (15, -): 15세 이상 관람가 목(#, 6, +) * 절단(#, 6, -) → (18, -): 청소년 관람불가 목(#, 6, +) * 애무(#, 15, -) → (15, -): 15세 이상 관람가 성기(#, 12, -) * 애무(#, 15, -) → (18, -): 청소년 관람불가 컴퓨팅 시스템은 이미지 데이터 분석을 통해 등급을 조정할 수 있다(S4040). 시나리오의 단어만으로 등급을 평가할 경우 시각적 이미지를 정확히 판단할 수 없기 때문에 등급조정에 오류가 발생할 수 있다. 예를 들어, 시나리오에서는 끝이 예리한 물체에 의해 피부가 잘려서 생기는 상처를 ‘자상’이 라는 단어로만 표현한다. 시나리오에서는 의료인들이 자상을 센티미터(cm) 단위로 정량화시키는 것처럼 크기를 살펴보기 힘들 뿐만 아니라 상처를 얼마나 상세히 묘사했는지도 평가하기 힘들다. 즉, 팔이나 다리 등 신체 일 부 중 몇 %의 크기로 상처가 났는지, 그리고 상처를 묘사할 경우 선혈, 피부, 혈관, 뼈 등을 묘사했는지를 상술 한 인공지능시스템을 통해 분석해 등급을 구분할 수 있다. 따라서 상술한 분석결과로 주의가 필요한 경우에 한 해 선택적으로 동영상 이미지 분석을 진행할 수 있다. 동영상 이미지 분석의 예는 아래와 같다. (ex) 폭력성의 경우 아래와 같이 분석한다. 전체 관람가: 코피, 가벼운 충돌, 긁힘에 의한 상처 등 가벼운 상해 12세 이상 관람가: 뼈가 부러지는 것에 대한 표현은 있으나 선혈이나 기타 신체가 훼손되는 것을 직접적으로 보 여주지 않을 경우 15세 이상 관람가: 무기류를 활용해 발생하는 상처, 선혈, 기타 신체 훼손 등이 나타나지만, 반복적이지 않아야 함 청소년관람불가: 상처 부위를 확대해 자세히 묘사, 목이나 머리 등 주요부위 절단 (ex) 선정성의 경우 아래와 같이 분석한다. 전체 관람가: 포옹, 가벼운 입맞춤 12세 이상 관람가: 연인, 부부 간 키스, 옷을 착용한 상태의 간단한 애무 15세 이상 관람가: 노출된 하반신이 구체적으로 묘사되지 않은 것, 성적행위를 간접적이고 간결하게 표현, 옷을 착용한 상태의 성적 애무나 성행위 청소년관람불가: 성매매, 근친상간, 혼음 등 사회윤리에 반하는 성적표현 실시예로서, 영상물을 인공지능으로 분석한 등급을 바탕으로 1~4단계를 통해 매겨진 등급을 재조정할 수 있다. 폭력성을 예로 들면 4단계에서 ‘손가락 절단’은 아래와 같이 ‘15세 이상 관람가’였다. 그러나 AI로 분석한 결과 표현의 정도에 따라 등급이 달리 결정된다. 손가락(#, 6, +) * 절단(#, 6, -) → (15, -): 15세 이상 관람가 → AI 이미지 분석 결과: 손가락 절단이 간접적으로 추정할 수 있게 보여진 경우 (12, -)로 다시 판정 → AI 이미지 분석 결과: 손가락 절단면을 확대해서 자세히 묘사한 경우 (18, -)로 다시 판정 선정성 역시 폭력성과 마찬가지로 표현의 정도에 따라 등급을 재조정한다. 성기(#, 12, -) * 애무(#, 15, -) → (18, -): 청소년 관람불가 → AI 이미지 분석 결과: 옷을 착용한 상태에서 짧은 시간 동안 적은 움직임으로 묘사된 경우 (15, -)로 다시 판정 → AI 이미지 분석 결과: 헤어 및 성기가 직접적으로 드러나고 긴 시간 동안 많은 움직임으로 묘사된 경우 (21, -)로 다시 판정 관람 등급의 현지화 도 4에서는 도시하지 않았으나, 실시예로서, 본 발명의 컴퓨팅 시스템은 관람 등급의 현지화를 수행할 수도 있 다. 단계에서 단계까지의 관람등급 평가는 대한민국을 기준으로 정리되었다. 따라서 국내 시장에서 영상을 제 작, 배포할 경우 본 프레임워크의 4단계까지의 결과물을 활용할 수 있다. 그러나 콘텐츠 상품을 다른 나라로 수 출하기 위해서는 현지의 문화, 제도, 지역, 경제적 특성을 반영해 등급을 재조정할 필요가 있다. 특히 국가별로 금기시하는 항목이 포함될 경우 등급을 상향 조정한다. 관람등급의 현지화 과정 역시 시나리오 분석을 선행분석 하고, 영상물 이미지 분석을 추가로 진행한다. 1) 시나리오 분석을 통한 관람등급 재조정 가) 문화적 차이 - 문화권에 따라 주제, 선정성, 폭력성에 대한 기준에서 차이가 발생할 수 있음 - 언어에 따른 차이점을 고려해야 함. 예를 들어, 치약 브랜드로 유명한 Colgate의 경우 영미권에서는 문제가 없으나 스페인어로는 ‘목을 매서 죽다’라는 의미가 될 수 있음. 또한 높임말이나 존칭에 대한 구분 역시 필요 함 - 종교적 금기도 살펴봐야 함. 예를 들어 인도에서 소를 먹는 장면이나 이슬람 문화권에서 돼지를 먹는 장면 역 시 조정할 필요가 있음 나) 제도적 차이 - 정치, 제도적인 차이로 인해 발생할 수 있는 갈등 또한 고려해야 함 - 대한민국이 북한의 독재 권력에 비판적인 것처럼 각 국가별 정치, 제도적 상황에 따른 금기 역시 고려해야 함. 예를 들어 중국의 경우, 대만 및 홍콩과의 관계에 대한 표현, 공산당 독재 권력에 대한 비판적 시각을 표현 할 경우 문제가 발생할 수 있음. 또한 과거 문화대혁명이나 천안문 사건 등에 대한 언급 역시 주의해야 함 - 자본주의, 사회주의, 민주주의, 공산주의 등 사회적 시스템과 이데올로기적 비판에 대한 수용성이 국가별로 차이가 있음을 고려해야 함 - 군사적, 경제적으로 대치중인 국가를 미화하는 스토리가 있을 경우 조정이 필요 다) 지역적 차이 - 국경선에 대한 시각차이 역시 존재함. 대한민국의 영토인 독도를 일본이 다케시마로 주장하듯이 센카쿠 열도 와 댜오위다오 등 국가별 이해관계가 첨예하게 대립된 영토 분쟁, 해양선 분쟁 지역의 경우 정확한 표현이 필요 함 라) 경제적 차이 - 국가별로 빈부격차에 대해 받아들이는 정도가 다를 수 있음. 따라서 빈곤과 소외, 사회적 배제 등 경제적 형 평성에 대한 비판적 시각에 대한 수용도가 다를 수 있으니 주의해야 함 2) 영상물 이미지 분석을 통한 관람등급 재조정 텍스트를 활용한 AI분석은 이미지를 분석하지 않고서는 한계를 가질 수 있다. 따라서 시나리오 단어 분석을 기 반으로 이미지 분석을 보완하는 방식으로 영상물 등급을 자동적으로 판단하는 알고리즘을 설계한다. 예를 들어, 신체 노출이나 폭력적인 장면의 경우 언어만이 아닌 실제 이미지를 통해 분석해야 문화적 상대성을 높일 수 있 다. 또한 CG(Computer Graphic)나 애니메이션 등을 활용할 경우 실제 존재하지 않는 가공의 존재나 배경을 창작 하는 경우가 있다. 이 경우 캐릭터가 갖고 있는 이미지를 함께 분석하지 않고서는 전체 맥락을 파악하기 힘들다. 예를 들어, 힌두교의 코끼리 등 종교적 특성을 갖춘 동물에서 디자인 테마를 가지고 온 캐릭터가 이에 반하는 행동이나 대사를 한다고 가정할 경우 갈등을 유발할 수 있다. 따라서 텍스트에서 문제가 발생할 수 있는 단어를 선정해 이미지 분석 내용과 대조해 보는 것이 전체 맥락의 안정성을 담보하기 위해 필요하다. 이처럼 문 화, 제도, 지역, 경제적 차이로 인해 문제가 발생할 경우 현지국 관람등급에 맞춰 상향조정하거나 콘텐츠의 수 정을 요청한다. 영상물 이미지를 통해 살펴봐야 할 항목들은 아래와 같다. 가) 문화적 차이 - 신체 노출 정도 및 폭력적인 장면에 대한 수용성이 국가별로 큰 차이가 있으므로 주의해야 함 - 종교적 상징물에 대한 이미지를 재조정할 필요가 있음. 예를 들어, 1997년 운동화 제조/판매를 하는 NIKE가 불꽃 모양 디자인을 부착한 운동화를 출시했을 때 이슬람 권역에서는 ‘알라’를 아랍어로 썼을 때와 유사한 모 양을 청결하지 못한 발에 사용했다고 반발했음 - 종교적으로 신성시하는 동물을 희화화 할 경우 문화적 충돌이 발생할 수 있음. 예를 들어 코끼리의 경우 힌두 교나 불교, 비둘기의 경우 그리스도교에서 중요한 성격을 지닌 동물이므로 주의할 필요가 있음 - 등장하는 캐릭터 역시 종교적 관점에서 고려해야 함. 성직자로 표현되는 캐릭터가 비사회적, 비윤리적 행동을 하는 것을 보여줄 경우 문제가 발생할 수 있음. 또한 등장인물의 성별 특성 또한 고려해야 함. 과거 사우디아라 비아의 경우 스타벅스 로고가 여성을 형상화했기 때문에 사용하지 못하고 다른 로고를 제작해 사용했음 - 문화권에 따라 왼손으로 음식을 먹는 것이 결례로 인식되는 경우도 있음 - 제스처(gesture)의 경우 역시 문화적 차이가 있음. 긍정의 표시도 한국의 경우 고개를 위아래로 끄덕이지만 그리스, 터키, 불가리아, 인도의 경우 고개를 좌우로 흔드는 것임. 손으로 O의 표현을 하는 것은 미국과 한국은 O.K.로 동의를 의미하지만, 일본은 돈, 프랑스는 가치 없는 것, 레바논은 여성 성기를 의미하는 욕이 되며, 시 대에 따라 미국의 경우 백인우월주의 등 부정적인 표현으로 전달될 수도 있음 나) 제도적 차이 - 정치, 제도적 차이로 인해 발생하는 사건을 적나라하게 표현할 경우 문제 발생 여지가 있음. 특히 독재 권력 의 민간인에 대한 폭력적 행위가 여과 없이 보여주는 경우, 혹은 다양성을 인정하지 않는 전체주의 권력의 비윤 리적 행위를 보여줄 경우 등 해당 국가의 정치권에서 금기로 여기는 내용에 대해 등장인물이나 행위가 실제와 유사할 경우 문제가 발생할 수 있음. 예를 들어, 중국의 모택동처럼 현재 정권에서 비호하는 사람에 대해 외모 가 유사한 사람이나 캐릭터를 내세워 당시 상황을 재연할 경우 문제 발생 여지가 있음. 마찬가지로 중국의 시진 핑 주석에 대해 희화화 요소가 있는 ‘곰돌이 푸’의 디자인 등은 참고할 수 있는 사례임 다) 지역적 차이 - 국가별 전통의상, 건물 등에서의 차이 역시 살펴볼 필요가 있음. 예를 들어, 한국, 중국, 일본이 같은 아시아 권으로 분류되긴 하지만 복식이나 문화에서 차이가 있는데 이에 대한 세심한 고려 없이 동일한 이미지로 표현하 는 것은 문제 발생 여지가 있음. 유럽의 여러 국가들 역시 이와 같은 차이가 있음 - 자연경관 역시 지역적으로 차이가 있으므로 배경이 되는 지역과 스토리상의 지역이 잘 매칭되도록 조정해야 함. 예를 들어, 아마존을 배경으로 하는 스토리를 보르네오 섬을 배경으로 보여주기 힘듬. 라) 경제적 차이 - 빈곤과 소외를 극단적인 이미지로 보여줄 경우 거부감이 발생할 수 있음 - 군사, 경제적으로 갈등이 있는 지역에서 상대국을 지나치게 미화할 경우 제재 대상이 될 수 있음 상술한 바와 같이, 문화적, 제도적, 지역적, 경제적 차이에 따른 등급 조정을 위해, 인공지능 시스템이 별도로 학습될 수도 있다. 예를 들면, 인도에서의 등급을 위한 인공지능 시스템은 인도에서 관람등급이 분류된 이미지 데이터 및 등급을 각각 입력 데이터와 라벨 데이터로 하여 학습할 수도 있다. 국가별로 인공지능 시스템을 학습 시킴으로써, 국가별로 최적화된 관람등급 분류가 가능할 수 있다. 도 5는 본 발명의 실시예에 따른 컴퓨팅 시스템의 영상물 등급 판정 방법을 나타낸다. 도 5는, 도 4 및 상술한 본 발명의 실시예들 및 동작을 정리하여 설명하는 것으로서, 상술한 내용은 도 5의 방 법 및 실시예에 추가/보충적으로 적용될 수 있다. 컴퓨팅 시스템은 영상물의 시나리오/대본으로부터 복수의 키워드들을 추출 및 매핑할 수 있다(S5010). 상술한 바와 같이, 컴퓨팅 시스템은 영상물 등급 분류에 영향을 주는 단어들을 기저장하고, 이 단어들에 대한 매핑 테이블을 포함한다. 이렇게 매핑되는, 영상물 등급 분류에 영향을 주는 단어들을 키워드로 지칭할 수 있다. 키워드들은 표1에서와 같이 장면번호, 등급 값, 및 특성 값의 3개의 값들로 매핑될 수 있다. 컴퓨팅 시스템은 키워드 분석에 기초하여 영상물 등급을 1차로 결정할 수 있다(S5020). 상술한 바와 같이, 컴퓨팅 시스템은 추출된 복수의 키워드의 장면 번호, 등급 값 및 특성 값에 기초하여 영상물 등급을 결정할 수 있다. 실시예로서, 컴퓨팅 시스템은 키워드들의 등급 값들 중 가장 높은 등급으로 영상물 등 급을 결정할 수 있다. 또한, 상술한 바와 같이, 특정 등급의 키워드들이 특정 빈도 이상 검출되는 경우, 해당 등급보다 등급을 상향조정할 수도 있다. 또한, 특정 키워드들의 간격에 따라서도 등급을 조정할 수 있음은 상술 한 바와 같다. 컴퓨팅 시스템은 적어도 하나의 키워드에 해당하는 장면의 이미지 데이터를 인공지능 시스템으로 분석할 수 있 다(S5030). 상술한 바와 같이, 컴퓨팅 시스템은 내장 또는 연동하는 인공지능 시스템을 사용하여 적어도 하나의 키워드에 해당하는 장면의 이미지 데이터를 분석할 수 있다. 인공지능 시스템은 신경망 모델로서 구현될 수 있다. 등급 판정이라는 태스크를 수행하기 위해, 신경망 모델은 등급이 결정된 영상물의 이미지 데이터를 입력 데이터로 사 용하고, 결정된 등급을 정답/라벨 데이터로 사용하여 사전에 학습될 수 있다. 이미지 데이터의 분석은, 키워드에 대해서만 수행할 수 있다. 특히, 폭력성이나 선정성의 경우 키워드만으로 판 정이 어려운 경우가 많다. 예를 들면 '살해'라는 키워드는 관람등급 15에 해당할 수도 있으나, 그 장면이 매우 잔인한 경우에는 18 또는 21로 등급이 상향조정되어야 할 수 있다. 실시예로서, 본 발명의 시스템은, 선정성/폭 력성/약물/모방위험 중 적어도 하나의 종류에 속하는 키워드들이 속한 장면의 이미지 데이터를 인공지능 시스템 으로 분석하고, 분석 결과로 나온 등급을 참고할 수 있다. 컴퓨팅 시스템은 이미지 데이터 분석에 기초하여 등급을 2차 결정할 수 있다(S5040). 상술한 이미지 데이터 분석 결과로, 특정 키워드가 사용된 장면에 대한 등급이 출력될 수 있다. 예를 들면, '때 린다'라는 키워드는 등급 값 15에 해당하는데, 이미지 분석 결과 전혀 폭력적이지 않은 상황인 경우, 인공지능 시스템은 12의 등급 값을 출력할 수 있다. 또한, '때린다'라는 키워드는 등급 값 15에 해당하는데, 해당 장면이 매우 잔혹하게 구성되어, 이미지 분석 결과 등급 값 18을 출력할 수도 있다. 실시예로서, 컴퓨팅 시스템은 이미 지 데이터 분석 결과인 등급 값을 우선 적용할 수 있다. 다른 실시예로서, 컴퓨팅 시스템은 이미지 데이터의 분 석 결과인 등급 값이 키워드 분석된 등급 값보다 높은 경우에만 이를 우선 적용할 수도 있다. 이렇게 이미지 데 이터 분석 결과를 적용함으로써, 컴퓨팅 시스템은 등급을 2차로 결정할 수 있다. 상술한 바와 같이, 2차 결정된 영상물 등급은 국가별 차이에 기초하여 추가로 조정될 수도 있다. 국가별 차이는 문화적 차이, 제도적 차이, 지역적 차이, 또는 경제적 차이 중 적어도 하나를 포함한다. 이러한 조정을 위해, 신경망 모델은 국가별로 등급이 결정된 영상물의 이미지 데이터를 입력 데이터로서 사용하고, 국가별 등급을 라 벨 데이터로서 사용하여 학습됨으로써, 대상 국가에 따라 다르게 모델링될 수도 있다. 도 6은 본 발명의 실시예에 따른 컴퓨팅 시스템 또는 컴퓨팅 시스템이 구동되는 컴퓨팅 장치를 나타낸다. 컴퓨팅 장치/시스템은 프로그램 코드를 실행함으로써 일련의 명령을 수행하는 임의의 전자 기기를 나타내 거나, 임의의 전자기기에 의해 실행되는 프로그램 또는 애플리케이션 일체를 나타낼 수도 있다. 본 명세서에서 컴퓨팅 시스템은 시스템으로 약칭될 수도 있다. 컴퓨팅 시스템은 컴퓨팅 디바이스에서 구현될 수 있다. 메모리는 프로세서와 연결되어, 프로세서를 구동하기 위한 다양한 정보/데이터를 저장한다. 메모리는 프로세서의 내부에 포함되거나 또는 프로세서의 외부에 설치되어 프로세서와 공지의 수단에 의해 연결될 수 있다. 메모리는 휘발성 및 비휘발성 메모리를 통칭한다. 본 발명에서 메모 리는 신경망, 신경망에 대한 트레이닝 정보, 신경망 구현 및 트레이닝을 위한 애플리케이션과 같은 데이 터를 저장할 수 있다. 프로세서는 메모리과 연결되어 본 발명에 따른 신경망, 신경망의 트레이닝 방법, 등급 판정 방법을 수행할 수 있다. 상술한 본 발명의 다양한 실시예에 따른 시스템의 동작을 구현하는 모듈, 데이터, 프로 그램 또는 소프트웨어 중 적어도 하나가 메모리에 저장되고, 프로세서에 의하여 실행될 수 있다. 프로세서은 본 발명의 방법을 수행하기 위한 애플리케이션/소프트웨어를 구동함으로써, 본 발명의 방법을 실시할 수 있다. 통신 유닛은 시스템의 외부 기기와 유선 통신 또는 무선 통신을 수행할 수 있다. 통신 유닛은 디바 이스의 구성에 따라서 구비되지 않을 수도 있다. 또한, 통신 유닛은 복수의 통신 칩셋들로 구성될 수도있다. 컴퓨팅 시스템 또는 시스템의 프로세서는 도 1 내지 도 5에서 상술한 본 발명의 등급 판정 방법을 수행한다. 신경망 시스템은 컴퓨팅 시스템의 이상에서 설명된 실시예들은 본 발명의 구성요소들과 특징들이 소정 형태로 결합된 것들이다. 각 구성요소 또는 특징은 별도의 명시적 언급이 없는 한 선택적인 것으로 고려되어야 한다. 각 구성요소 또는 특징은 다른 구성요 소나 특징과 결합되지 않은 형태로 실시될 수 있다. 또한, 일부 구성요소들 및/또는 특징들을 결합하여 본 발명 의 실시예를 구성하는 것도 가능하다. 본 발명의 실시예들에서 설명되는 동작들의 순서는 변경될 수 있다. 어느 실시예의 일부 구성이나 특징은 다른 실시예에 포함될 수 있고, 또는 다른 실시예의 대응하는 구성 또는 특징과 교체될 수 있다. 특허청구범위에서 명시적인 인용 관계가 있지 않은 청구항들을 결합하여 실시예를 구성하거나 출원 후의 보정에 의해 새로운 청구항으로 포함시킬 수 있음은 자명하다. 본 발명에 따른 실시예는 다양한 수단, 예를 들어, 하드웨어, 펌웨어(firmware), 소프트웨어 또는 그것들의 결 합 등에 의해 구현될 수 있다. 하드웨어에 의한 구현의 경우, 본 발명의 일 실시예는 하나 또는 그 이상의 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 프로세서, 콘트롤러, 마이크로 콘트롤러, 마이크로 프로세서 등에 의해 구현될 수 있다. 펌웨어나 소프트웨어에 의한 구현의 경우, 본 발명의 일 실시예는 이상에서 설명된 기능 또는 동작들을 수행하 는 모듈, 절차, 함수 등의 형태로 구현될 수 있다. 소프트웨어 코드는 메모리에 저장되어 프로세서에 의해 구동 될 수 있다. 상기 메모리는 상기 프로세서 내부 또는 외부에 위치하여, 이미 공지된 다양한 수단에 의해 상기 프로세서와 데이터를 주고받을 수 있다. 본 발명은 본 발명의 필수적 특징을 벗어나지 않는 범위에서 다른 특정한 형태로 구체화될 수 있음은 당업자에 게 자명하다. 따라서, 상술한 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니 되고 예시적인 것으로 고려되어야 한다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0161803", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 신경망 모델 및 각 노드의 동작을 나타낸다. 도 2는 본 발명의 실시예에 따른 인공지능 시스템/신경망을 나타낸다. 도 3은 본 발명의 실시예에 따른 인공지능 시스템의 학습 방법을 나타낸다. 도 4는 본 발명의 실시예에 따른 영상물 등급 판정 방법을 나타낸다. 도 5는 본 발명의 실시예에 따른 컴퓨팅 시스템의 영상물 등급 판정 방법을 나타낸다."}
