{"patent_id": "10-2023-0116494", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0033853", "출원번호": "10-2023-0116494", "발명의 명칭": "외부 장치를 제어하는 단말 장치 및 그 장치 제어 방법", "출원인": "삼성전자주식회사", "발명자": "김현태"}}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "단말 장치에 있어서,통신부;디스플레이; 및 프로세서;를 포함하며,상기 프로세서는,외부 장치의 화면을 공유하는 미러링 동작을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을표시하도록 상기 디스플레이를 제어하며,상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 외부 장치에 대한 제어 신호를 생성하고, 상기상대 장치가 상기 제어 신호를 상기 외부 장치로 전달하도록 상기 제어 신호를 상기 통신부를 통해 상기 상대장치로 전송하는, 단말 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 상대 장치의 영상 및 상기 외부 장치의 화면에 대한 데이터를 저장하기 위한 메모리;를 더 포함하며,상기 프로세서는,상기 상대 장치의 영상 및 상기 외부 장치의 화면을 포함하는 상기 화상 통화 화면을 구성하고, 상기 구성된 화상 통화 화면을 표시하도록 상기 디스플레이를 제어하며,상기 프로세서는, 상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 외부 장치에 대한 제어 허용 여부를 문의하는메시지를 표시하도록 상기 상대 장치를 제어하고, 상기 상대 장치로부터 상기 외부 장치에 대한 제어를 허용하는 응답이 수신되면, 상기 제어 신호를 생성하는, 단말 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 프로세서는,상기 상대 장치가 복수개의 장치이고, 상기 복수개의 상대 장치들 중에서 적어도 하나가 외부 장치와 연결되어상기 미러링 동작을 수행하는 중에, 상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면,상기 외부 장치에 대한 제어권을 가지는 장치의 유무를 식별하고, 상기 제어권을 가지는 장치가 없거나 상기 제어권을 가지는 장치의 우선 순위보다 상기 단말 장치의 우선 순위가 높으면, 상기 제어 신호를 생성하여 상기외부 장치가 연결된 상대 장치로 전송하고,상기 제어권을 가지는 장치의 우선 순위가 상기 단말 장치의 우선 순위보다 높으면, 상기 외부 장치에 대한 제어가 불가능하다는 것을 알리는 안내 메시지를 표시하도록 상기 디스플레이를 제어하는, 단말 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,카메라;를 더 포함하고공개특허 10-2025-0033853-3-상기 프로세서는, 상기 카메라에서 촬영되는 영상을 상기 통신부를 통해서 외부 서버로 전송하고,상기 프로세서는,상기 카메라에서 촬영되는 영상, 상기 상대 장치에서 촬영되는 영상, 상기 외부 장치의 화면을 모두 포함하는화상 통화 화면에 대한 데이터를 상기 외부 서버로부터 수신하고, 상기 데이터에 기초하여 상기 화상 통화 화면을 표시하도록 상기 디스플레이를 제어하며,상기 화상 통화 화면 상에서 상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 사용자 조작에 대응되는 제어 신호를 생성하여, 상기 제어 신호를 상기 통신부를 통해 상기 상대 장치로 전송하는, 단말 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2항에 있어서,카메라;를 더 포함하고,상기 프로세서는,상기 메모리에 저장된 레이아웃 정보에 기초하여, 상기 카메라에 의해 촬영되는 영상을 상기 화상 통화 화면 내의 제1 영역에 표시하고, 상기 상대 장치로부터 수신된 영상을 상기 화상 통화 화면 내의 제2 영역에 표시하고,상기 외부 장치의 화면을 상기 화상 통화 화면 내의 제3 영역에 표시하며,상기 제1 내지 제3 영역 중 하나에 하이라이트 표시를 부가하여 표시하고, 상기 하이라이트 표시를 이동시키기위한 이동 조작이 입력되면 상기 이동 조작에 따라 상기 하이라이트 표시를 다른 영역으로 이동하여 표시하고,상기 제3 영역에 상기 하이라이트 표시가 부가된 상태에서 사용자 선택이 입력되면, 상기 외부 장치를 제어하기위한 사용자 조작이 입력된 것으로 인식하는, 단말 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 외부 장치의 화면이 복수의 객체를 포함하면,상기 프로세서는,상기 제3 영역에 상기 하이라이트 표시가 부가된 상태에서 상기 사용자 선택이 입력되면, 상기 복수의 객체 중하나에 상기 하이라이트 표시를 부가하여 표시하고, 상기 이동 조작이 입력되면 상기 복수의 객체 중 다른 객체로 상기 하이라이트 표시를 이동시켜 표시하며,상기 복수의 객체 중 하나에 상기 하이라이트 표시가 부가된 상태에서 상기 사용자 선택이 입력되면, 상기 하이라이트 표시가 부가된 객체에 대응되는 동작을 수행하도록 하는 제어 신호를 생성하여, 상기 제어 신호를 상기외부 장치로 전달하도록 상기 통신부를 통해 상기 상대 장치로 전송하는, 단말 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "모바일 디바이스에 있어서,외부 장치와 통신을 수행하기 위한 통신부;디스플레이; 및프로세서를 포함하며, 상기 프로세서는, 제1 외부 장치와 화상 통화를 수행 중인 제2 외부 장치에 대한 미러링 기능이 수행되면, 상기디스플레이의 화면을 상기 통신부를 통해 상기 제2 외부 장치로 제공하고, 상기 사용자 단말 장치에 대한 제어권이 상기 제1 외부 장치에 부여되면, 상기 제1 외부 장치에 의한 제어를 제한적으로 허용하는, 모바일 디바이스."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,공개특허 10-2025-0033853-4-데이터 및 어플리케이션이 저장된 메모리;를 더 포함하며,상기 프로세서는, 상기 데이터 및 상기 어플리케이션 중에서 보안 등급이 기 설정된 기준 이하인 데이터 및 어플리케이션에 대해서는 상기 저장된 메모리에 기초하여 상기 제1 외부 장치에 의한 제어를 허용하고, 상기 보안 등급이 상기 기준을 초과하는 데이터 및 어플리케이션에 대한 상기 제1 외부 장치의 제어 신호가 수신되면, 제어 불가능 상태임을 알리는 메시지를 상기 제2 외부 장치를 통해 상기 제1 외부 장치로 제공하는, 모바일 디바이스."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "서버 장치에 있어서,복수의 단말 장치와 통신을 수행하기 위한 통신부;메모리; 및프로세서;를 포함하며,상기 프로세서는,상기 복수의 단말 장치들 사이에서 화상 통화가 수행되면, 각 단말 장치들에서 제공하는 영상을 포함하는 화상통화 화면을 생성하여 상기 통신부를 통해 각 단말 장치로 전송하고,상기 복수의 단말 장치들 중 적어도 하나의 단말 장치에서 외부 장치의 화면을 공유하는 미러링 동작을 수행하면, 상기 외부 장치의 화면에 대한 정보를 상기 적어도 하나의 단말 장치로부터 상기 통신부를 통해 수신하여상기 메모리에 저장하고, 저장된 상기 외부 장치의 화면을 추가하도록 상기 화상 통화 화면을 재구성하여, 상기재구성된 화상 통화 화면을 상기 통신부를 통해 각 단말 장치로 전송하며,상기 복수의 단말 장치들 중 하나로부터 상기 외부 장치를 제어하기 위한 사용자 조작이 전송되면, 상기 외부장치가 상기 사용자 조작에 대응되는 동작을 수행하도록 하는 제어 신호를 생성하여, 상기 통신부를 통해서, 상기 외부 장치와 미러링된 단말 장치로 상기 제어 신호를 전송하는, 서버 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 메모리는, 상기 복수의 단말 장치 각각의 우선 순위에 대한 정보를 저장하며,상기 프로세서는,상기 외부 장치를 제어하기 위한 사용자 조작을 전송한 단말 장치가 복수개이면, 상기 메모리에 저장된 정보에기초하여 각 단말 장치들의 우선 순위를 비교하고, 상기 우선 순위가 높은 단말 장치에 대해서 상기 외부 장치에 대한 제어 권한을 부여하는, 서버 장치."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "단말 장치의 장치 제어 방법에 있어서,외부 장치의 화면을 공유하는 미러링 동작을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을표시하는 단계; 및상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 사용자 조작에 대응되는 제어 신호를 생성하고,상기 상대 장치가 상기 제어 신호를 상기 외부 장치로 전달하도록 상기 제어 신호를 상기 상대 장치로 전송하는단계;를 포함하는, 장치 제어 방법."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 상대 장치가 복수개의 장치이고, 상기 복수개의 상대 장치들 중에서 적어도 하나가 외부 장치와 연결되어공개특허 10-2025-0033853-5-상기 미러링 동작을 수행하는 중에, 상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 복수의 상대 장치들 중에서 상기 외부 장치에 대한 제어권을 가지는 장치의 유무를 식별하고, 상기 제어권을 가지는 장치가 없거나 상기 제어권을 가지는 장치의 우선 순위보다 상기 단말 장치의 우선 순위가 높으면,상기 제어 신호를 생성하여 상기 외부 장치가 연결된 상대 장치로 전송하는 단계; 및상기 제어권을 가지는 장치의 우선 순위가 상기 단말 장치의 우선 순위보다 높으면, 상기 외부 장치에 대한 제어가 불가능하다는 것을 알리는 안내 메시지를 표시하는 단계;를 더 포함하는, 장치 제어 방법."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11항에 있어서,상기 화상 통화 화면에 추가 표시하는 단계는,상기 단말 장치의 카메라에 의해 촬영되는 영상을 상기 화상 통화 화면 내의 제1 영역에 표시하고, 상기 상대장치로부터 수신된 영상을 상기 화상 통화 화면 내의 제2 영역에 표시하고, 상기 외부 장치의 화면을 상기 화상통화 화면 내의 제3 영역에 표시하며,상기 제어 신호를 상기 상대 장치로 전송하는 단계는,상기 제1 내지 제3 영역 중 하나에 하이라이트 표시를 부가하여 표시하는 단계;상기 하이라이트 표시를 이동시키기 위한 이동 조작이 입력되면 상기 이동 조작에 따라 상기 하이라이트 표시를다른 영역으로 이동하여 표시하는 단계; 및상기 제3 영역에 상기 하이라이트 표시가 부가된 상태에서 사용자 선택이 입력되면, 상기 외부 장치를 제어하기위한 사용자 조작이 입력된 것으로 인식하는 단계;를 포함하는, 장치 제어 방법."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 제어 신호를 상기 상대 장치로 전송하는 단계는,상기 제3 영역에 상기 하이라이트 표시가 부가된 상태에서 상기 사용자 선택이 입력되면, 상기 외부 장치의 화면에 포함된 복수의 객체 중 하나에 상기 하이라이트 표시를 부가하여 표시하는 단계;상기 이동 조작이 입력되면 상기 복수의 객체 중 다른 객체로 상기 하이라이트 표시를 이동시켜 표시하는 단계;상기 복수의 객체 중 하나에 상기 하이라이트 표시가 부가된 상태에서 상기 사용자 선택이 입력되면, 상기 하이라이트 표시가 부가된 객체에 대응되는 동작을 수행하도록 하는 제어 신호를 생성하는 단계; 및상기 제어 신호를 상기 상대 장치로 전송하는 단계;를 더 포함하는, 장치 제어 방법."}
{"patent_id": "10-2023-0116494", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "단말 장치의 프로세서에 의해 실행되는 경우 상기 단말 장치가 동작을 수행하도록 하는 컴퓨터 명령을 저장하는비일시적 컴퓨터 판독가능 기록매체에 있어서, 상기 동작은,외부 장치의 화면을 공유하는 미러링 동작을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을표시하는 단계; 및상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 사용자 조작에 대응되는 제어 신호를 생성하고,상기 상대 장치가 상기 제어 신호를 상기 외부 장치로 전달하도록 상기 제어 신호를 상기 상대 장치로 전송하는단계;를 포함하는, 비일시적 컴퓨터 판독가능 기록매체."}
{"patent_id": "10-2023-0116494", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "외부 장치를 제어하는 단말 장치가 개시된다. 본 장치의 프로세서는, 외부 장치의 화면을 공유하는 미러링 동작 을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을 표시하도록 상기 디스플레이를 제어하며, 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 외부 장치에 대한 제어 신호를 생성하고, 통신부를 통해 상 대 장치로 전송한다."}
{"patent_id": "10-2023-0116494", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 외부 장치를 제어하기 위한 단말 장치 및 그 장치 제어 방법에 대한 것이다."}
{"patent_id": "10-2023-0116494", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 전자 기술의 발달로 다양한 전자 장치들이 개발되고 있다. 특히, 최근에는 화상 통화 서비스나 미러링 (mirroring) 서비스 등 다양한 서비스를 지원하는 전자 장치가 개발되고 있다. 화상 통화 서비스란, 복수의 사 용자들이 자신의 단말 장치를 통해 서로의 얼굴을 보면서 통화를 할 수 있는 서비스를 의미한다. 미러링 서비스 는, 전자 장치의 디스플레이에서 표시 중인 영상을 타 전자 장치의 디스플레이에 동일하게 표시하는 서비스를 의미한다. 다르게는 화면 공유(Sharing) 기능이라고도 한다. 미러링 서비스를 통해 사용자는 예를 들어, 노트북, 태블릿 또는 모바일 디바이스와 같은 전자 장치의 디스플레이에서 표시 중인 영상을 텔레비전이나 모니터와 같은 디스 플레이 장치의 디스플레이를 통해 공유할 수 있게 되었다. 이상과 같이 다양한 서비스들이 제공되고 있는 가운데, 이러한 서비스들을 좀 더 다양하고 편리하게 활용할 수 있는 방법에 대한 필요성이 대두되었다."}
{"patent_id": "10-2023-0116494", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시에 따르면, 적어도 하나의 실시 예에 따른 단말 장치는 통신부, 디스플레이, 프로세서를 포함한다. 상기 프로세서는, 외부 장치의 화면을 공유하는 미러링 동작을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을 표시하도록 상기 디스플레이를 제어하며, 상기 외부 장치를 제어하기 위한 사용자 조작이 입 력되면, 상기 외부 장치에 대한 제어 신호를 생성하고, 상기 상대 장치가 상기 제어 신호를 상기 외부 장치로 전달하도록 상기 제어 신호를 상기 통신부를 통해 상기 상대 장치로 전송한다. 한편, 본 개시의 적어도 하나의 실시 예에 따른 모바일 디바이스 장치는 외부 장치와 통신을 수행하기 위한 통 신부, 디스플레이, 프로세서를 포함한다. 상기 프로세서는, 제1 외부 장치와 화상 통화를 수행 중인 제2 외부 장치에 대한 미러링 기능이 수행되면, 상기 디스플레이의 화면을 상기 통신부를 통해 상기 제2 외부 장치로 제공하고, 상기 사용자 단말 장치에 대한 제어 권이 상기 제1 외부 장치에 부여되면, 상기 제1 외부 장치에 의한 제어를 제한적으로 허용한다. 한편, 본 개시의 적어도 하나의 실시 예에 따른 서버 장치는 복수의 단말 장치와 통신을 수행하기 위한 통신부, 메모리, 프로세서를 포함한다. 상기 프로세서는, 상기 복수의 단말 장치들 사이에서 화상 통화가 수행되면, 각 단말 장치들에서 제공하는 영상 을 포함하는 화상 통화 화면을 생성하여 상기 통신부를 통해 각 단말 장치로 전송하고, 상기 복수의 단말 장치 들 중 적어도 하나의 단말 장치에서 외부 장치의 화면을 공유하는 미러링 동작을 수행하면, 상기 외부 장치의 화면에 대한 정보를 상기 적어도 하나의 단말 장치로부터 상기 통신부를 통해 수신하여 상기 메모리에 저장하고, 저장된 상기 외부 장치의 화면을 추가하도록 상기 화상 통화 화면을 재구성하여, 상기 재구성된 화상 통화 화면을 상기 통신부를 통해 각 단말 장치로 전송하며, 상기 복수의 단말 장치들 중 하나로부터 상기 외부 장치를 제어하기 위한 사용자 조작이 전송되면, 상기 외부 장치가 상기 사용자 조작에 대응되는 동작을 수행하 도록 하는 제어 신호를 생성하여, 상기 통신부를 통해서, 상기 외부 장치와 미러링된 단말 장치로 상기 제어 신 호를 전송한다. 한편, 본 개시의 적어도 하나의 실시 예에 따른 단말 장치의 그 제어 방법은 외부 장치의 화면을 공유하는 미러 링 동작을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을 표시한다. 상기 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 상기 사용자 조작에 대응되는 제어 신호를 생성하고, 상기 상대 장치가 상기 제어 신호를 상기 외부 장치로 전달하도록 상기 제어 신호를 상기 상대 장치로 전송한다. 한편, 본 개시의 일 실시 예에 따르면, 단말 장치가 외부 장치를 제어하기 위한 컴퓨터 프로그램이 저장된 비일 시적 컴퓨터 판독가능 기록매체를 제공한다. 상기 컴퓨터 프로그램은, 외부 장치의 화면을 공유하는 미러링 동 작을 수행하는 상대 장치(Correspondent Device)와의 화상 통화 화면을 표시하는 단계, 상기 외부 장치를 제어 하기 위한 사용자 조작이 입력되면, 상기 사용자 조작에 대응되는 제어 신호를 생성하고, 상기 상대 장치가 상 기 제어 신호를 상기 외부 장치로 전달하도록 상기 제어 신호를 상기 상대 장치로 전송하는 단계를 순차적으로수행할 수 있다."}
{"patent_id": "10-2023-0116494", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시(Disclosure)의 다양한 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널 리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술 의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당 되는 개시의 설명 부분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어 의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 개시에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 개시에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 개시에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 그 사람이 사용하는 장치를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 일 실시 예에 따른 외부 장치를 제어하는 단말 장치를 설명하기 위한 도면이다. 단말 장치는 디스플레이를 포함한 TV로 구현 될 수 있으나, 이에 한정되는 것은 아니며 비디오 월(video wall), LFD(large format display), Digital Signage(디지털 간판), DID(Digital Information Display), 프로 젝터 디스플레이 등과 같이 디스플레이 기능을 갖춘 장치라면 한정되지 않고 적용 가능하다. 또한, 단말 장치 는 LCD(liquid crystal display), OLED(organic light-emitting diode), LCoS(Liquid Crystal on Silicon), DLP(Digital Light Processing), QD(quantum dot) 디스플레이 패널, QLED(quantum dot light- emitting diodes) 등과 같은 다양한 형태의 디스플레이를 포함할 수 있다. 이에 한정되지 않으며, 단말 장치 는 다양한 유형의 출력 장치로 구현될 수 있다. 또한, 단말 장치는 사용자 단말 장치 또는, 음향 출력 장치(예를 들어, 사운드 바, 홈씨어터 시스템, 룸 스피커, 헤드폰, 이어폰 등)으로 구현될 수 있음은 물론이다. 이상과 같이, 본 개시의 일 실시 예에 따른 단말 장치는 다양한 형태로 구현될 수 있으며, 그 형태에 따라 자체적으로 컨텐츠 디스플레이 등 다양한 서비스를 제공할 수 있다. 또한, 단말 장치는 타 단말 장치와 연 동하는 서비스도 제공할 수 있다. 예를 들어, 단말 장치는 화상 통화 서비스나 화상 회의 서비스, 일반 채 팅 또는 화상 채팅 서비스 등을 제공할 수 있다. 도 1을 참조하면, 사용자가 자신의 단말 장치를 이용하여 타 사용자와 화상 통화를 수행하는 상태를 나타낸다. 본 개시에서는 설명의 편의를 위하여, 타 사용자가 사용하는 장치를 상대 장치라 한다. 예를 들어, 사용자와 상대방이 화상 통화를 하는 경우, 단말 장치는 내장 또는 연결된 카메라를 이용 하여 사용자를 촬영한 영상과, 마이크(미도시)를 통해 입력되는 음성을 상대 장치로 전송한다. 상대 장 치도 카메라를 이용하여 상대방을 촬영한 영상 및 그 음성을 단말 장치로 제공한다. 이러한 화상 통화 서비스는 별도의 중계 서버(미도시)를 통해서 수행될 수도 있고, 단말 장치들 사이에서 직접적인 연 결을 통해 수행될 수도 있다. 본 개시에서는 이에 제한되지 않는다. . 사용자 및 상대방은 각자를 촬영한 영상 이외에 각 장치들(100, 200)에 저장된 문서나 이미지, 기타 파일 들을 공유할 수도 있으며, 또 다른 장치를 미러링 방식으로 연결하여, 해당 장치의 화면을 함께 볼 수도 있다. 도 1에서는 상대방이 또 다른 단말 장치의 화면을 상대 장치와 미러링 동작을 수행하는 상태를 나 타낸다. 설명의 편의를 위하여, 또 다른 단말 장치는 이하에서 외부 장치라 한다. 도 1에서는 단말 장치 와 상대 장치는 각각 TV이고, 외부 장치는 모바일 폰인 것처럼 도시하였으나, 각 장치들은 다양 한 형태로 구현될 수 있다. 도 1에 도시된 바와 같이, 상대방이 미러링 기능을 실행시켜 외부 장치의 화면을 상대 장치가 공 유할 수 있게 하면, 공유된 화면 내용이 화상 통화를 하고 있는 사용자의 단말 장치에도 그대로 디스플 레이 될 수 있다. 사용자는 상대방과 함께 상대방의 외부 장치의 화면을 함께 시청할 수 있으며, 필요한 경우, 사 용자가 직접 제어할 수 있다. 단말 장치는 사용자가 외부 장치를 제어하기 위한 사용자 조작을 입력하면, 그 사용자 조작에 대응되는 제어 신호를 생성한다. 예를 들어, 단말 장치는 외부 장치의 화면 내에 표시된 특정 컨텐츠를 확대 표시하거나, 특정 어플리케이션 아이콘을 선택하여 어플리케이션을 실행하도록 하는 제어 신호를 생성할 수 있 다. 단말 장치는 생성한 제어 신호를 상대 장치로 전달하고, 상대 장치는 이를 제어 장치로 전 달한다. 제어 장치는 수신된 제어 신호에 대응되는 동작을 수행한다. 도 2는 본 개시의 일 실시 예에 따른 단말 장치의 구성을 나타내는 블록도이다. 도 2를 참조하면, 단말 장치는 통신부, 프로세서, 디스플레이 및 메모리를 포함하고 있다. 통신부는 다양한 규격에 따른 유선 또는 무선의 입출력 인터페이스(또는, 입출력 단자)를 포함할 수 있다. 예를 들어, 통신부는 HDMI(High Definition Multimedia Interface), MHL(Mobile High-Definition Link), USB(Universal Serial Bus), DP(Display Port), 썬더볼트(Thunderbolt), VGA(Video Graphics Array)포트, RGB 포트, D-SUB(D-subminiature), DVI(Digital Visual Interface) AP 기반의 Wi-Fi(와이파이, Wireless LAN 네트 워크), 블루투스(Bluetooth), 지그비(Zigbee), 유/무선 LAN(Local Area Network), WAN(Wide Area Network), 이 더넷(Ethernet), IEEE 1394, AES/EBU(Audio Engineering Society/European Broadcasting Union), 옵티컬(Optical), 코액셜(Coaxial) 등과 같은 다양한 인터페이스를 포함할 수 있다. 프로세서가 상대 장치와의 화상 통화 기능을 실행하면, 통신부는 상대 장치에서 제공하는 영상과 음성 및 기타 데이터를 수신하고, 단말 장치를 통해 생성되는 사용자의 영상과 음성 및 기타 데 이터는 상대 장치로 전송할 수 있다. 또는, 프로세서가 별도의 외부 장치에 대한 미러링 기능을 실행하면, 통신부는 외부 장치의 화면에 대한 데이터를 수신하거나, 단말 장치의 디스플레이에 표시되는 화면에 대한 데이터를 외부 장치로 전송하여 줄 수도 있다. 디스플레이는 각종 화면을 디스플레이하기 위한 구성이다. 일 예로, 프로세서가 상대 장치와의 화상 통화 기능을 실행하면, 디스플레이는 화상 통화 화면을 표시할 수 있다. 디스플레이는 LCD(liquid crystal display), OLED(organic light-emitting diode), LCoS(Liquid Crystal on Silicon), DLP(Digital Light Processing), QD(quantum dot) 디스플레이 패널, QLED(quantum dot light-emitting diodes), μLED(Micro light-emitting diodes), Mini LED 등과 같은 다양한 형태의 디스플레이로 구현될 수 있 다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플렉시블 디스플레이(flexible display), 롤러 블 디스플레이(rollable display), 3차원 디스플레이(3D display), 복수의 디스플레이 모듈이 물리적으로 연결 된 디스플레이 등으로 구현될 수도 있다. 메모리는 단말 장치의 동작에 필요한 각종 데이터 및 프로그램을 저장하기 위한 구성이다. 메모리는 S-RAM(Static Random Access Memory), D-RAM(Dynamic Random Access Memory) 등의 휘발성 메모리와, Flash Memory, ROM(Read Only Memory), EPROM(Erasable Programmable Read Only Memory), EEPROM(Electrically Erasable Programmable Read Only Memory) 등의 비휘발성 메모리, 하드디스크 드라이브(HDD) 또는 솔리드 스테 이트 드라이브(SSD) 등으로 구현될 수 있다. 메모리는 프로세서에 의해 액세스 될 수 있다. 프로세서는 메모리에 대해 데이터의 독취/ 기록/수정/삭제/갱신 등의 동작을 수행할 수 있다. 도 2에서는 메모리가 프로세서를 별개로 하나만 포함된 상태를 도시하였으나, 실시 예에 따라서 메모리는 복수로 구현될 수 있으며, 그 중 ROM이나 RAM과 같은 메모리는 프로세서 내에 탑재될 수도 있다. 프로세서는 단말 장치의 동작을 제어하기 위한 구성이다. 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프로세서(microprocessor), TCON(Timing controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)), ARM 프로 세서, AI(Artificial Intelligence) 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 프로세서 는 메모리에 저장된 컴퓨터 실행가능 명령어(computer executable instructions)를 실행함으로써 다양한 기능을 수행할 수 있다. 본 개시의 일 실시 예에 따른 방법이 복수의 동작을 포함하는 경우, 복수의 동작은 하나의 프로세서에 의해 수 행될 수도 있고, 복수의 프로세서에 의해 수행될 수도 있다. 예를 들어, 일 실시 예에 따른 방법에 의해 제 1 동작, 제 2 동작, 제 3 동작이 수행될 때, 제 1 동작, 제 2 동작, 및 제 3 동작 모두 제 1 프로세서에 의해 수 행될 수도 있고, 제 1 동작 및 제 2 동작은 제 1 프로세서(예를 들어, 범용 프로세서)에 의해 수행되고 제 3 동 작은 제 2 프로세서(예를 들어, 인공지능 전용 프로세서)에 의해 수행될 수도 있다. 프로세서는 하나의 코어를 포함하는 단일 코어 프로세서(single core processor)로 구현될 수도 있고, 복 수의 코어(예를 들어, 동종 멀티 코어 또는 이종 멀티 코어)를 포함하는 하나 이상의 멀티 코어 프로세서 (multicore processor)로 구현될 수도 있다. 하나 이상의 프로세서가 멀티 코어 프로세서로 구현되는 경우, 멀티 코어 프로세서에 포함된 복수의 코어 각각은 캐시 메모리, 온 칩(On-chip) 메모리와 같은 프로세서 내부 메모리를 포함할 수 있으며, 복수의 코어에 의해 공유되는 공통 캐시가 멀티 코어 프로세서에 포함될 수 있다. 또한, 멀티 코어 프로세서에 포함된 복수의 코어 각각(또는 복수의 코어 중 일부)은 독립적으로 본 개시 의 일 실시 예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있고, 복수의 코어 전체(또 는 일부)가 연계되어 본 개시의 일 실시 예에 따른 방법을 구현하기 위한 프로그램 명령을 판독하여 수행할 수도 있다. 프로세서는 단말 장치를 통해 입력되는 사용자 조작에 대응되는 동작을 수행한다. 사용자가 화상 통화 기능을 수행하기 위한 어플리케이션을 선택한 경우, 프로세서는 그 어플리케이션을 실 행시켜, 실행 화면을 디스플레이에 표시한다. 사용자는 실행 화면 상에서 통화할 상대방의 이름이나 전화 번호, ID, 메일 주소, 메신저 ID 등 다양한 식별 정보를 입력할 수 있다. 프로세서는 입력된 식별 정보에 기초하여 상대 장치를 탐색한 후, 식별 정보에 대응되는 상대 장치가 탐색되면, 그 상대 장치에 화상 통화 연결을 위한 리퀘스트를 전송한다. 상대 장치는 해당 리퀘스트가 수신되면 화상 통화 어플리케이션을 자동 실행시킨 후, 사용자의 응답을 대기한다. 사용자, 즉, 상대방이 화상 통화에 응하게 되면, 상대 장치 는 리퀘스트에 대한 응답 신호를 전송한다. 프로세서는 통신부를 통해서 응답 신호가 수신되면, 상대 장치의 화상 통화 세션을 연결하도록 통신부를 제어한다. 프로세서는 단말 장치에 내 장 또는 연결된 카메라 및 마이크를 활성화시켜 사용자의 영상을 포함하는 화상 통화 화면을 구성한 후, 디 스플레이에 표시하는 한편, 사용자의 영상 및 음성을 상대 장치로 전송하도록 통신부를 제어한 다. 프로세서는 화상 통화 세션을 통해서 상대 장치에서 상대방의 영상 및 음성이 전달되면, 화상 통화 화면에 추가로 표시한다. 실시 예에 따라서, 화상 통화 기능은 이와 상이한 매커니즘으로 수행될 수도 있 으며, 본 개시의 여러 실시 예들은 어느 하나의 매커니즘으로 제한되는 것은 아니다. 이러한 방식으로 화상 통화가 수행되는 중에, 상대 장치가 외부 장치의 화면을 공유하는 미러링 기능 을 실행하게 되면, 상대 장치의 디스플레이 화면에 외부 장치의 화면이 공유된다. 상대 장치는 미러링 기능에 의해 공유되는 외부 장치의 화면에 대한 정보를 단말 장치로 전송한다. 프로세서는 통신부를 통해서 외부 장치의 화면에 대한 정보가 수신되면, 이를 메모리에 저 장한다. 프로세서는 수신된 외부 장치의 화면을 화상 통화 화면에 추가하여 표시하도록 디스플레이를 제어한 다. 사용자는 화상 통화 화면 상에서 상대방의 영상 이외에, 상대방이 별도로 사용하는 외부 장치의 화면까지 함께 확인할 수 있다. 이 경우, 사용자가 직접 외부 장치를 제어하고자 하는 상황이 발생할 수도 있다. 예를 들어, 사용자가 상대방에게 외부 장치의 사용방법을 설명하고자 하는 경우, 외부 장치를 직접 제어하면서 상대방에게 설명하는 것이 좀 더 편리할 수 있다. 이 밖에, 상대방이 애완동물이나 의사 능력이 약한 노약자의 경우, 사용자는 상대방이 위치한 장소에 놓여진 외부 장치의 동작을 제어하여, 긴급 전화를 걸거나, 컨텐츠를 재생하는 등 다양한 기능을 실행시킬 수도 있다. 이 경우, 사용자는 외부 장치를 제어하기 위한 사용자 조작을 입력할 수 있다. 사용자 조작은 단말 장치의 종류 및 특징에 따라 다양한 형태로 입력될 수 있다. 이에 대해서는 후술하는 부분에서 구체적으로 설명한다. 프로세서는 이러한 사용자 조작이 입력되면, 외부 장치가 사용자 조작에 대응되는 동작을 수행하도록 하는 제어 신호를 생성한다. 프로세서는 사용자 조작에 대응하는 제어 신호를 생성하여 상대 장치가 외부 장치로 전달 하도록 통신부를 통해 상대 장치로 전송한다. 구체적으로, 사용자가 단말 장치를 통해 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 프 로세서는 외부 장치에 대한 제어 허용 여부를 문의하는 메시지를 상대 장치에서 자체 디스플레 이를 통해 표시하도록 통신부를 통해 상대 장치로 송신한다. 상대 장치는 수신된 메시지를 표시하며, 상대방은 그 메시지에 대한 응답으로 제어 허용 여부를 선택할 수 있다. 상대방이 외부 장치에 대한 제어를 허용하는 선택을 하면, 상대 장치는 제어 허용 여부 에 대한 응답을 전송한다. 프로세서는, 제어를 허용하지 않는 응답 신호가 수신되면, 프로세서는 제어가 허락되지 않았음을 알 리는 메시지를 표시하도록 디스플레이를 제어한다. 반면, 프로세서는 제어를 허용하는 응답 신호가 수신되면, 프로세서는 외부 장치 에 대한 제어 권을 확보할 수 있다. 제어권이 확보된 상태에서 사용자 조작이 입력되면, 프로세서는 외부 장치가 그 사용자 조작에 대응되는 동작을 수행하도록 하는 제어 신호를 생성할 수 있다. 제어 신호는 외부 장치의 종류에 따라 상이한 포맷으로 생성될 수 있다. 예를 들어, 외부 장치가 터치스크린을 구비하고, 그 터 치 스크린 상에 복수의 아이콘들이 표시되어 있으며, 외부 장치의 프로세서가 그 중 하나의 아이콘이 선택 되었다는 사실을 식별하였을 때, 해당 아이콘에 대응되는 어플리케이션을 실행시키거나, 컨텐츠를 재생하는 등 의 제어 동작을 수행하도록 구현되어 있을 수 있다. 이 경우, 프로세서는 외부 장치에서 현재 디스플 레이된 화면 내에 사용자가 특정 아이콘을 선택하였음을 알리는 제어 코드 또는 인터럭션이 포함된 제어 신호를 생성할 수 있다. 또는, 프로세서는 외부 장치에서 현재 디스플레이된 화면 내에서의 터치 또는 선택 된 지점의 좌표에 대한 정보가 포함된 제어 신호를 생성할 수도 있다. 또는, 외부 장치와 단말 장치 가 동일 제조 회사의 제품이거나 동일한 신호 체계를 사용하는 제품일 경우, 프로세서는 외부 장치 자체의 프로세서가 직접 생성하는 제어 명령과 동일하게, 특정 어플리케이션에 대한 실행 명령 또는 컨텐츠에 대한 재생 명령 등에 대응되는 제어 신호를 동일하게 생성할 수도 있다. 프로세서는 이러한 제어 신호의 헤더 부분에 외부 장치에 대응되는 플래그를 설정하거나 인디케이터를 추가함으로써, 상대 장치가 수 신된 제어 신호를 외부 장치로 전달하도록 할 수 있다. 한편, 이러한 제어 신호의 생성 방법 및 전달 방법 은 일 예에 불과하며, 이에 한정되는 것은 아니다. 한편, 외부 장치를 제어하는 단말 장치에 있어서, 프로세서는 영상 및 음성을 통신부를 통 해서 상대 장치에 직접 전송하는 것이 아닌, 외부 서버를 이용하여 전송 할 수도 있다. 통신부는 단 말 장치의 카메라에서 촬영되는 영상, 상대 장치 에서 촬영되는 영상, 외부 장치의 화면을 모두 포함하는 화상 통화 화면에 대한 데이터를 외부 서버로부터 수신할 수 있다. 프로세서는 수신된 데이터에 기초하여 화상 통화 화면을 표시하도록 디스플레이를 제어 한다. 이후, 화상 통화 화면 상에서 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 사용자 조작에 대응되는 제어 신호를 생성하고, 제어 신호를 통신부를 통해 상대 장치로 전송한다. 이하에서 단말 장치와 상대 장치의 화상 통화 화면 공유 과정에 대해 구체적으로 설명하도록 한다. 도 3은 본 개시의 다양한 실시 예에 따른 단말 장치의 화면을 공유하는 과정을 설명하기 위한 도면이다. 도 3을 참조하면, 단말 장치와 상대 장치가 화상 통화를 하면서, 상대 장치와 외부 장치가 미러링 통신을 수행하는 경우, 단말 장치의 디스플레이 화면과 상대 장치의 디스플레이 화면 은 도시하는 바와 같이 나타난다. 프로세서는 단말 장치에 내장 또는 연결된 카메라에 의해 촬영되는 영상과, 상대 장치로부터 수신되 는 영상, 외부 장치의 화면을 모두 화상 통화 화면 내에 포함시켜 표시하도록 디스플레이를 제어한다. 본 개시에서는, 촬영 영상, 상대 장치 영상, 외부 장치 화면이 표시되는 영역을 각각 제1 영역, 제2 영역, 제3 영역이라고 구분하여 지칭한다. 프로세서는 메모리에 저장된 레이아웃 정보에 기초하여, 화상 통화 화면 내의 각 영역에 상술한 촬영 영상, 외부 장치 화면, 상대 장치 영상을 표시할 수 있다. 한편, 외부 장치 화면이 표시되는 제3 영역의 크기는 외부 장치의 실제 화면 크기와 같을 수도 있으나, 단 말 장치의 디스플레이 사이즈가 훨씬 큰 경우라면, 프로세서는 외부 장치의 화면을 확대 스케일링 하여 제3 영역에 표시하여 줄 수 있다. 이 경우, 가로 세로 비율은 그대로 유지할 수 있으나, 반드시 이에 한정되는 것은 아니다. 도 3을 참고하면, 단말 장치의 디스플레이 화면에는 사용자의 영상 이 오른쪽 상단의 제1 영역에 배치되고, 상대방의 영상은 오른쪽 하단의 제2 영역에 배치된다. 외부 장치의 화면은 왼쪽의 제3 영역 에 배치된다. 상대 장치의 디스플레이 화면에는 상대방의 화상 통화 화면이 제1 영역 에 배치되고, 그 아래인 제2 영역에 사용자의 화상 통화 화면이 배치되며, 왼쪽의 제3 영역에는 상대 장치와 미러링 통신을 수행하는 외부 장치의 디스플레이 화면이 배치된다. 배치되는 각 화면의 위치는 이에 한정되는 것 은 아니며 다른 위치에도 배치될 수 있다. 한편, 배치되는 화면 중 사용자 또는 상대방 본인의 화상 통화 영상 (132,232)은 선택적으로 디스플레이 화면에 표시될 수 있다. 프로세서는 사용자가 자신의 영상이 보이지 않게 설정하거나, 상대방이 자신의 영상이 보이지 않게 설정한 경우, 그 설정 상태에 기초하여, 사용자 본인의 영상 또는 상대방 영상을 제외한 화상 통화 화면을 표시하도록 디스플레이를 제어할 수 있다. 또한, 도 3에서는 모바일 폰의 화면의 가로 세로 비율을 고려하여, 외부 장치 화면이 왼쪽의 제3 영역(134, 234)에 표시된 상태를 도시하였으나, 외부 장치의 종류가 변경되어 가로 세로 비율이 변경되는 경우, 프로세서는 그에 대응되는 레이아웃으로 각 영상들을 배치할 수도 있다. 도 4 내지 7은 본 개시의 다양한 실시 예에 따른 단말 장치의 사용자 조작을 설명하기 위한 도면이다. 도 4를 참조하면, 프로세서는 각 영상들이 영역별로 배치된 화상 통화 화면 상에 하이라이트 표시를 추가하도록 디스플레이를 제어한다. 구체적으로는, 프로세서는 제1 내지 제3 영역들(131, 132, 133) 중 적어도 하나의 영역의 가장자리 부분에 하이라이트 표시를 부가할 수 있다. 하이라이트 표시란 해당 영역을 타 영역에 비해 식별력 있게 표시하기 위한 그래픽 처리를 포함한다. 예를 들어, 일 영역의 가장자리 부분을 굵은 테두리로 표시하거나, 가장자리 색상을 다른 영역들의 가장자리 색상과 다르게 표시하거나, 밝은 색상의 그래픽 오브젝트를 점등시키거나, 해당 영역의 전체 컬러를 변경하거나, 해당 영역 전체를 점등시키거나, 타 영역들을 불투명 상태로 표시하는 등, 다양한 그 래픽 처리가 사용될 수 있다. 도 4 내지 6에서는 굵은 테두리 표시가 사용된 경우를 도시하였다. 설명의 편의를 위하여 본 개시에서는 하이라이트 표시라고 기재하였으나, 이와 달리 선택 영역 표시, 강조 표시 등으로 지칭할 수도 있다. 사용자는 하이라이트 표시를 확인하여, 현재 선택된 영역이 어디인지를 알 수 있다. 도 4의 좌측 도면을 참고하 면 제1 영역에 하이라이트 표시가 부가된 상태를 나타낸다. 이러한 상태에서 사용자가 좌우/상하 이동 조 작을 할 수 있는 장치를 이용해 이동 조작을 입력하면, 하이라이트 표시가 기존에 하이라이트가 표시된 영역이 아닌 다른 영역으로 이동하게 된다. 도 4에서는 제3 영역으로 하이라이트 표시가 이동된 상태를 나타낸다. 이러한 상태에서 사용자가 선택 명령을 입력하면, 프로세서는 외부 장치의 제어권을 획득하기 위한 사용자 조작이 입력된 것으로 인식할 수 있다. 한편, 외부 장치가 복수의 객체들(예를 들어, 아이콘, 썸네일, 텍스트, 이미지 등)들이 포함된 화면을 제 공하는 경우, 사용자는 화상 통화 화면 상의 제3 영역 내에서, 해당 객체들 중 하나를 직접 선택할 수도 있다. 도 5는 이러한 과정을 설명하기 위한 도면이다. 도 4에서 설명한 바와 같이 제3 영역으로 하이라이트 표시가 이동된 상태에서 사용자가 선택 명령을 입력 하면, 프로세서는 제3 영역 내의 외부 장치 화면에 표시된 각 객체들(135-1 ~ 135-n) 중 하나(135- 1)로 하이라이트를 이동하여 표시한 상태를 나타낸다. 이러한 상태에서 사용자가 다시 좌우/상하 이동 조작을 할 수 있는 장치를 이용해 이동 조작을 입력하면 프로세서는 하이라이트 표시를 다음 객체(135-2)로 이동 하여 표시하도록 디스플레이를 제어한다. 이러한 상태에서 다시 선택 명령이 입력되면, 프로세서는 하이라이트 표시가 위치한 객체(135-2)에 대응되는 동작을 수행하도록 하는 제어 신호를 생성하여, 통신부(11 0)를 통해 상대 장치로 전송한다. 상대 장치는 제어 신호가 수신되면, 이를 외부 장치로 전달한다. 외부 장치는 제어 신호에 기초 하여 사용자가 선택한 객체에 대응되는 동작을 수행한다. 구체적으로, 사용자가 웹 브라우저 아이콘을 선택하였 다면, 외부 장치는 웹 브라우저를 실행시킨 후 디폴트로 설정된 웹 페이지를 디스플레이한다. 또는, 사용 자가 음악 재생을 위한 아이콘을 선택하거나, 사진 컨텐츠 확인을 위한 아이콘을 선택하였다면, 외부 장치(30 0)는 음악을 재생하거나 사진 컨텐츠를 디스플레이하는 등의 동작을 수행할 수 있다. 상술한 이동 조작 및 선택 명령은 단말 장치를 제어하기 위한 리모컨이나 단말 장치와 통신을 수행 하는 휴대폰, 단말 장치 본체에 구비된 버튼이나 터치 스크린 등 다양한 입력 장치를 통해서 입력될 수 있다. 도 4 내지 도 5에서는 하이라이트 표시와 같은 인디케이터를 이동시켜서 객체를 선택하는 방법을 설명하였으나, 단말 장치 자체의 디스플레이가 터치 조작 입력이 가능하다면, 사용자가 제3 영역을 직접 터치 하여 제어 시도를 할 수도 있다. 또는 리모컨 등의 입력 장치를 이용할 수도 있다. 도 6은 리모컨 등의 입력 장 치의 움직임에 따라 이동하는 조작 커서를 이용하는 경우에 대하여 도시하였다. 도 6을 참조하면, 프로세서는 화상 통화 화면 내에 커서를 표시할 수 있다. 사용자는 입력 장치를 이 용하여 커서를 이동시켜, 선택하고자 하는 영역(132, 133, 134)과 객체들(135-1 ~ 135-n)을 바로 선택할 수 있다. 예를 들어, 이동 조작을 할 수 있는 장치 중 하나인 리모컨을 이용해 커서를 움직여 외부 장치의 화면 상 에서 하나의 객체(예를 들어, 135-1) 상에 커서를 이동시킨 후, 리모컨 버튼을 눌러서 해당 객체를 선택할 수 있다. 디스플레이가 터치 스크린으로 구현되었다면, 사용자가 직접 객체를 터치할 수도 있다. 도 6과 같은 방식으로 구현된 경우, 프로세서는 스케일링된 제3 영역의 크기와, 외부 장치의 실 체 화면 크기 사이의 비율을 고려하여, 사용자가 직접 터치 또는 선택한 지점의 좌표값에 대응되는 실제 화면 내에서의 좌표 값을 식별할 수 있다. 예를 들어, 3배로 확대 스케일링 하였다고 가정할 경우, 사용자가 직접 터 치 또는 선택한 지점의 좌표값이 (3x, 3y)라면, 프로세서는 실제 외부 장치의 화면 내에서는 (x, y) 지점이 터치 또는 선택되었다고 인식할 수 있다. 이에 따라, 프로세서는 인식된 좌표값에 대한 정보를 포 함하는 제어 신호를 생성할 수 있다. 만약, 외부 장치에서 각 객체들의 배치 위치와 객체 종류에 대한 정 보가 수신되어 메모리에 저장되어 있는 상태라면, 프로세서는 그 정보 및 인식된 좌표 값에 기초하여, 해당 객체에 대응되는 동작을 수행하도록 하는 제어 신호를 직접 생성하여 전송할 수도 있다. 도 7은 본 개시의 일 실시 예에 따른 단말 장치의 사용자 조작을 설명하기 위한 도면이다. 도 7을 참조하면, 외부 장치가 모바일 폰이 아니라 데스크탑 또는 랩탑과 같은 디바이스인 경우를 나타낸 다. 이러한 경우에도, 도 4 내지 6에서 상술한 내용들을 모두 적용 할 수 있다. 예를 들어, 상대 장치와 미러링 통신을 수행하는 외부 장치가 랩탑인 경우, 랩탑의 디스플레이 화면을 사용자가 제어권을 획득해 디 스플레이 제어를 할 수 있다. 이상에서는 단말 장치와 상대 장치가 1 대 1로 화상 통화를 수행하는 경우를 기준으로 설명하였으나, 다자간 화 상 통화 기능 또는 화상 회의 기능이 수행될 수도 있다. 이 경우, 단말 장치를 기준으로 보면, 상대 장치 가 복수 개일 수 있다. 도 8은 복수 개의 장치들이 연결된 상태에서의 단말 장치 동작의 일 예를 설명하기 위한 흐름도이다. 상대 장치가 복수개의 장치인 경우, 단말 장치가 복수 개의 상대 장치들 중 적어도 하나가 외부 장치와 미 러링을 수행할 수 있다. 예를 들어, 하나의 상대 장치가 외부 장치와 미러링하는 경우를 가정하면, 나머지 상대 장치들과 단말 장치가 서로 제어권을 확보하기 위한 시도를 할 수도 있다. 도 8은 이러한 경우, 제어권의 우선순위 부여에 대한 과정을 나타낸 것이다. 프로세서는 복수 개의 상대 장치와 화상 통화를 수행하는 도중에 복수개의 상대 장치들 중에서 적어 도 하나가 외부 장치와 연결되어 미러링 통신을 수행하면, 그에 따라 각 상대 장치의 사용자들의 화면과 외부 장치 화면들 중 적어도 하나를 포함하는 화상 통화 화면을 표시하도록 디스플레이를 제어한다(S810). 이러한 상태에서 사용자가 외부 장치를 제어하기 위한 사용자 조작을 입력하면, 프로세서는 나머지 상대 장치들 중에서 제어권을 가지는 장치가 있는지 여부를 식별한다(S820). 제어권을 가지는 장치가 없다면, 상술한 여러 실시 예들에서 설명한 바와 같이 프로세서는 사용자 조작에 따라서 제어 신호를 상대 장치로 전송함으로써, 외부 장치를 제어할 수 있다(S840). 반면, 외부 장치를 제어 할 수 있는 제어권을 가지는 특정 장치가 있다면, 특정 장치와 단말 장치 사 이에 제어권 우선순위를 비교한다(S830). 단말 장치의 우선 순위에 대한 정보는 메모리에 미리 저장 될 수 있다. 우선 순위는 각 단말 장치들의 종류나 위치, 사용자들의 관계 등 다양한 기준에 따라 미리 설정되 어 저장될 수 있다. 또는, 우선 순위는 화상 통화에 참여한 순서나 참여 횟수 등 다른 기준에 따라 매 통화시에 적응적으로 결정될 수도 있다. 또는, 각 단말 장치들의 사용자들간의 협의에 따라 결정될 수도 있다. 우선 순위를 비교한 결과, 단말 장치의 우선순위가 특정 장치 우선순위보다 높은 경우, 사용자는 외부 장치의 디스플레이를 제어할 수 있는 제어권을 가지게 된다(S840). 반면, 우선 순위를 비교한 결과, 단말 장치의 제어권 우선 순위가 특정 장치보다 낮다면, 프로세서는 외부 장치에 대한 제어가 불가능하다는 것을 알리는 안내 메시지를 표시하도록 디스플레이를 제어한 다(S850). 도 9는 본 개시의 일 실시 예에 따른 외부 장치를 제어하는 서버 장치를 설명하기 위한 도면이다. 상술한 여러 실시 예들에서는 장치들 간의 직접적인 연결이 이루어지는 것으로 도시 및 설명하였으나, 다수의 장치들 간의 통신은 서버 장치에 의해 중계될 수 있다. 이하에서는 서버 장치를 통한 외부 장치를 제어하는 방식에 대해 설명하도록 한다. 서버 장치는 모든 네트워크 시스템에서 각종 운영 체계와 어플리케이션간의 상호 작용을 담당하는 중앙 서 버(또는 통합 서버) 또는 클라우드 컴퓨팅 기술을 이용하는 클라우드 서버 등으로 구현 될 수 있다. 여기서, 클 라우드 컴퓨팅(cloud computing)은 인터넷 기반의 컴퓨팅 기술을 의미하는 것으로, 인터넷 상의 유틸리티 데이터 서버(utility data server)에 프로그램을 두고 그때 그때 컴퓨터나 휴대폰 등에 불러 와서 사용하는 웹에 기 반한 소프트웨어 서비스이다. 또한, 서버 장치는 복수의 단말 장치와 통신을 수행할 수 있다. 복수의 단말 장치는 서버 장치로 복 수의 단말 장치의 식별 정보를 전송할 수 있다. 또는, 복수의 단말 장치는 서버 장치로 복수의 단말 장치 가 아닌 다른 디바이스의 식별 정보를 전송하거나 사용자의 계정에 액세스하기 위한 인증 정보를 전송할 수 있 다. 도 9를 참조하면, 서버 장치는 사용자의 단말 장치, 상대방의 상대 장치, 데스크탑 및 랩탑와 같이 복수의 단말 장치와 연결돼 있다. 연결될 수 있는 디바이스 장치는 이에 한정되는 것은 아 니며 다양한 단말 장치와 연결 될 수 있다. 복수 개의 단말 장치 중 적어도 하나의 장치가 외부 장치와 미러링 통신을 수행하는 경우, 각각의 단말 장치는 외부 장치를 제어할 수 있는 제어권을 획득해 외부 장치의 디스플레 이 제어가 가능하다. 예를 들어, 복수 개의 단말 장치 중 적어도 하나의 장치인 데스크탑과 미러링 통신을 수행하는 외부 장치가 존재하면, 각각의 단말 장치는 외부 장치를 제어할 수 있는 제어권을 획득할 수도 있다. 도 9에 도시된 바와 같이 서버 장치가 개입하는 경우, 단말 장치 및 상대 장치에서 표시하는 화 상 통화 화면에 포함되는 각 영상들은 서버 장치에서 제공되는 데이터에 기초하여 생성될 수 있다. 서버 장치는 화상 통화 화면의 제1 내지 제3 영역 중 적어도 하나에 표시될 영상들을 한꺼번에 전송할 수도 있 고, 그 중 일부 영상만 전송할 수도 있다. 또는, 서버 장치는 화상 통화 화면 자체를 구성하여 그 화면에 대한 데이터를 단말 장치 및 상대 장치(100, 200)에 각각 제공할 수도 있다. 예를 들어, 상대 장치가 외부 장치와 미러링 통신을 수행하고 있는 경우가 아니라면, 서버 장치(90 0)는 상대 장치에서 촬영된 상대 장치 영상을 상대 장치로부터 수신하여, 단말 장치로 전송할 수 있다. 또는, 상대 장치가 외부 장치와 미러링 통신을 수행하고 있는 경우라면, 외부 장치 화면 및 상대 장치 영상 모두를 한번에 또는 순차적으로 단말 장치로 전송할 수도 있다. 도 10은 본 개시의 일 실시 예에 따른 서버 장치의 구성을 나타내는 블록도이다. 도 10을 참조하면, 서버 장치는 복수의 단말 장치와 통신을 수행하기 위한 통신부, 프로세서, 메모리 를 포함한다. 프로세서는 복수의 단말 장치들이 참여하는 화상 통화가 수행되면, 각 단말 장치들에서 제공하는 영상을 포함하는 화상 통화 화면을 생성하여 통신부를 통해 각 단말 장치로 전송한다. 이후, 복수의 단말 장치들 중 적어도 하나의 단말 장치에서 외부 장치의 화면을 공유하는 미러링 통신을 수행하면, 외부 장치의 디스플레 이에 대한 정보를 적어도 하나의 단말 장치로부터 통신부를 통해 수신하여 메모리에 저장한다. 프로 세서는 저장된 외부 장치의 화면을 추가하도록 화상 통화 화면을 재구성하여, 재구성된 화상 통화 화면을 통신부를 통해 각 단말 장치로 전송한다. 프로세서는 복수의 단말 장치들 중 하나로부터 외부 장치를 제어하기 위한 사용자 조작이 전송되면, 외부 장치가 사용자 조작에 대응되는 동작을 수행하도록 하는 제어 신호를 생성하여, 통신부를 통해서, 외부 장 치와 미러링된 단말 장치로 제어 신호를 전송한다. 이에 따라, 다수의 사용자들이 상호간에 화상 통화와 스크린 쉐어를 수행하면서, 단말 장치와 미러링 통신을 하 는 외부 장치를 제어할 수 있다. 프로세서는 외부 장치를 제어하기 위한 사용자 조작을 전송한 단말 장치가 복수개이면, 복수의 단말 장치 각각의 우선 순위에 대한 정보를 저장한 메모리의 정보에 기초하여 각 단말 장치들의 우선 순위를 비교하 고, 우선 순위가 높은 단말 장치에 대해서 외부 장치에 대한 제어 권한을 부여한다. 서버장치에는 MCU(Multipoint Control Unit), SFU(Selective Forwarding Unit)와 같은 다양한 방식의 서버가 존재한다. MCU(Multipoint Control Unit)의 경우 서버를 이용하여 다수의 사용자 영상을 하나로 믹싱하여 1개의 미디어스트림을 전송하는 구조이다. 이 방식은 다수의 사용자 간의 화상 통화 영상을 믹싱해 상호간의 데이터 또는 영상을 주고받음에 있어 트래픽을 줄일 수 있다. SFU(Selective Forwarding Unit)의 경우 마찬가지로 서버 를 이용하여 복수의 단말 장치가 개별적으로 서버 장치와 연결돼 각각의 커넥션을 유지하면 서버를 통해 상호간 의 화상 통화 영상 또는 데이터를 송수신한다. 이 방식은 대규모 연결에 적합하며, 각 단말 장치 별로 서버 장 치에 연결돼 있기 때문에 개별 레이아웃 조정이 가능하다.외부 장치를 제어하는 단말 장치의 연결 방식에 있어, P2P(Peer to Peer)와 같은 직접적인 연결 방식도 있고, 상술한 바와 같이 MCU(Multipoint Control Unit), SFU(Selective Forwarding Unit) 방식도 존재하는데, 본 개 시의 다양한 실시 예들은 이러한 방식들 어디에도 적용 가능하다. 한편, 단말 장치가 외부 장치를 제어할 수 있는 제어권을 획득해, 외부 장치의 디스플레이를 제 어할 수 있게 되면, 상대방의 외부 장치에 대한 보안 문제가 발생할 위험이 있다. 예를 들어, 외부 장 치가 모바일 디바이스인 경우, 모바일 디바이스 내에 있는 사진이나 메일, 메신저 내용 등 다양한 데이터 및 정보가 유출될 수 있다. 상대방이 자신의 모바일 디바이스에 대한 제어를 허용하였다고 하더라도, 개인 데이터의 유출 위험에 대해서까지 미처 생각하지 못할 수 있으므로, 이에 대한 예방이 필요할 수 있다. 따라서, 외부 장치를 제어하는 단말 장치의 보안 문제를 해결하기 위해 아래에서는 외부 장치를 모바일 디 바이스로 상정하여 설명하도록 한다. 도 11은 본 개시의 일 실시 예에 따른 모바일 디바이스의 구성을 나타내는 블록도이다. 도 11을 참조하면, 모바일 디바이스는 데이터 및 어플리케이션이 저장된 메모리, 프로세서, 디스플레 이, 통신부를 포함한다. 프로세서는 제1 외부 장치와 화상 통화를 수행 중인 제2 외부 장치에 대한 미러링 통신이 수행되면, 디스 플레이의 화면을 제2 외부 장치로 제공한다. 프로세서는 이러한 상태에서 모바일 디바이스에 대 한 제어권이 제1 외부 장치에 부여되면, 제1 외부 장치에 의한 제어를 제한적으로만 허용한다. 즉, 프로세서 는 모바일 디바이스에 구비된 터치 스크린이나 기타 사용자 인터페이스를 통해서 자체적으로 입력되는 사 용자 조작에 따른 제어 동작은, 사용자 인증(지문 인식, 패스워드 입력, 패턴 입력, 얼굴 인식 등)이 이루어진 이후에는 제한 없이 수행한다. 따라서, 사용자는 모바일 디바이스에 저장된 각종 데이터나 어플리케이션 등을 자유롭게 이용할 수 있다. 하지만, 프로세서는 미러링 통신을 수행하고 있는 제2 외부 장치와 화상 통화 중인 제1 외부 장치에서 제 어권이 부여되어 있는 경우, 제1 외부 장치에서 전송된 제어 신호가 제2 외부 장치를 통해 수신되었을 경우에는, 일부 데이터나 어플리케이션에 대한 제어를 허용하지 않을 수 있다. 구체적으로는, 프로세서는 데이터 및 어플리케이션 중에서 보안 등급이 기 설정된 기준 이하인 데이터 및 어플리케이션에 대해서는 데이터 및 어플리케이션에 대한 정보가 저장된 메모리에 기초하여 제1 외부 장치에 의 한 제어를 허용할 수 있다. 만약 보안 등급이 기 설정된 기준을 초과하는 데이터 및 어플리케이션에 대한 제1 외부 장치의 제어 신호가 수 신되면, 프로세서는 제어 불가능 상태임을 알리는 메시지를 제2 외부 장치를 통해 제1 외부 장치로 제공한 다. 보안 등급은 데이터의 종류 및 어플리케이션의 종류에 따라 디폴트로 설정될 수도 있고, 사용자가 설정할 수도 있다. 예를 들어, 사진이나 동영상 컨텐츠나, 연락처 정보, 메시지 송수신 내용 등의 데이터나, SNS 어플리케이 션, 주식 거래 어플리케이션, 금융 관련 어플리케이션, 메일 송수신 프로그램 등에 대해서는 높은 보안 등급이 설정될 수 있다. 한편, 개인 정보 및 각종 데이터와 어플리케이션에 대한 보안 문제에 대해, 사용자 또는 상 대방이 User 등록 과정을 통해 상호 허용된 특정인 또는 특정 계정에 대해서만 접근을 허용하거나, User 등 록시 key 인증 방법을 통해 등록을 허용하고 접근을 허용하게 할 수 도 있다. 접근이 허용된 보안 등급을 가지 는 데이터나 어플리케이션을 실행하기 위한 제어 신호가 입력되면, 프로세서는 그 데이터를 열람하기 위한 화면을 디스플레이하거나, 선택된 어플리케이션을 실행시켜 그 실행 화면을 디스플레이하도록 디스플레이 를 제어할 수 있다. 반면, 접근이 허용되지 않은 보안 등급을 가지는 데이터나 어플리케이션을 실행하기 위한 제어 신호가 입력되면, 프로세서는 제어 불가능한 데이터 또는 어플리케이션임을 알리는 메시지를 상대 장 치를 통해서 단말 장치로 전송할 수 있다. 외부 장치의 보안에 관한 방법에 대해서는 상술한 내용에 한정되지 않고, 다양한 방법으로 보안 문제를 해결할 수 있다. 도 12는 본 개시의 일 실시 예에 따른 외부 장치를 제어하는 단말 장치의 장치 제어방법을 설명하기 위한 흐름 도이다. 도 12을 참조하면, 단말 장치가 상대 장치와의 화상 통화가 수행되면 상대 장치에서 수신되는 영상을 포함하는 화상 통화 화면을 단말 장치의 디스플레이에 표시한다(S1210). 상대 장치가 외부 장치의 화면을 공유하는 미러링 통신을 수행하면(S1220), 외부 장치의 화면에 대한 정보 를 상대 장치를 통해서 단말 장치에 수신하여 단말 장치의 디스플레이의 화상 통화 화면에 추가 표시한다(S1230). 이후, 사용자가 단말 장치를 통해 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 사용자 조작에 대응되는 제어 신호를 생성하고, 상대 장치가 제어 신호를 외부 장치로 전달하도록 제어 신호를 상대 장치 로 전송하여 외부 장치를 제어한다(S1240). 이에 따르면, 사용자는 상대방에게 외부 장치의 사용 방법을 설명하여 줄 수도 있고, 상대방 대신 외부 장치를 직접 제어하면서 외부 장치의 컨텐츠를 재생해주거나, 긴급 연락 등을 수행함으로써 상대방을 케어해 줄 수도 있게 된다. 사용자가 제어권을 획득하기 위한 방법에 대해서 는 상술한 부분에서 구체적으로 설명한 바 있으므로 중복 설명은 생략한다. 한편, 상대 장치가 복수개의 장치인 경우, 복수개의 상대 장치들 중에서 적어도 하나가 외부 장치와 연결되어 미러링 동작을 수행하는 중에, 외부 장치를 제어하기 위한 사용자 조작이 입력되면, 복수의 상대 장치들 중에서 외부 장치에 대한 제어권을 가지는 장치의 유무를 식별한다. 외부 장치를 제어 할 수 있는 제어권을 가지는 특 정 장치가 없거나, 특정 장치의 우선 순위보다 단말 장치의 우선 순위가 높으면, 제어 신호를 생성하여 외 부 장치가 연결된 상대 장치로 전송한다. 이후, 제어권을 가지는 특정 장치의 우선 순위가 단말 장치의 우선 순위보다 높으면, 외부 장치에 대한 제 어가 불가능하다는 것을 알리는 안내 메시지를 표시한다. 메시지 알림 표시에 대해서 상술한 부분에서 구체적으 로 설명한 바 있으므로 중복 설명은 생략한다. 도 13은 복수의 장치들이 서로 연결된 상태에서의 장치 제어 방법의 일 예를 설명하기 위한 흐름도이다. 도 13에 따르면, 단말 장치는 복수 개의 상대 장치와 화상 통화를 수행할 수 있으며, 각 장치들이 가지는 우선 순위에 따라 제어권을 획득 할 수 있다. 단말 장치는 복수개의 상대 장치들과 화상 통화가 개시되면, 각 장치들의 화면을 공유할 수 있다 (S1310). 이러한 상태에서, 복수개의 상대 장치들 중에서 적어도 하나가 외부 장치와 연결되어 미러링 동작을 수행하면, 단말 장치는 미러링된 외부 장치의 화면까지 화상 통화 화면에 추가하여 표시할 수도 있다. 이러한 상태에서, 단말 장치의 사용자가 상대 장치에 미러링된 외부 장치를 제어하기 위한 사용자 조작을 입력하면(S1320), 단말 장치는 제어권을 획득하기 위한 동작을 수행한다(S1340). 제어권을 획득하는 과정 에 대해서는 상술한 여러 실시 예들에서 설명한 바 있으므로 중복 설명은 생략한다. 단말 장치가 외부 장치를 제어하기 위한 제어권이 없다면 디스플레이만 공유하게 된다(S1330). 반면, 단말 장치가 외부 장치를 제어하기 위한 제어권이 있다면, 외부 장치의 디스플레를 제어할 수 있는 제어권을 획 득하게 된다(S1340). 다만, 단말 장치를 비롯한 상대 장치가 복수개인 경우 제어권을 획득하기 위한 최상위 우선순위가 필요하 다(S1350). 복수개의 장치들 중에서 단말 장치가 다른 상대 장치들 보다 제어권 획득의 최상위 우선순위가 아니라면, 최상위 우선순위가 될 때까지 외부 장치와 미러링 통신을 수행하는 상대 장치를 통해 외부 장치로 제 어권 획득을 위한 제어 허용 여부 요청을 재시도 하게 된다(S1360). 반면, 단말 장치가 제어권 획득의 최 상위 우선순위라면 외부 장치의 디스플레이를 제어하고 컨트롤 데이터를 전달 할 수 있다(S1370). 단말 장치 가 최상위 우선순위가 아니더라도, 제어권을 요청한 타 장치들에 비해 우선 순위가 높다면 제어권을 획득 할 수도 있다. 한편, 단말 장치의 디스플레이의 화상 통화 화면에 추가 표시하는 단계는 단말 장치의 카메라에 의해 촬영되는 영상을 화상 통화 화면 내의 제1 영역에 표시하고, 상대 장치로부터 수신된 영상을 화상 통화 화 면 내의 제2 영역에 표시하며, 외부 장치의 화면을 화상 통화 화면 내의 제3 영역에 표시한다. 또한, 제어 신호를 상대 장치로 전송하는 단계는 제1 내지 제3 영역 중 하나에 하이라이트 표시를 부가하여 표 시한다. 하이라이트 표시를 이동시키기 위한 이동 조작이 입력되면 이동 조작에 따라 하이라이트 표시를 다른 영역으로 이동하여 표시한다. 이후, 제3 영역에 하이라이트 표시가 부가된 상태에서 사용자 선택이 입력되면, 외부 장치를 제어하기 위한 사용자 조작이 입력된 것으로 인식한다. 한편, 제어 신호를 상대 장치로 전송하는 단계는 제 3영역에 하이라이트 표시가 부가된 상태에서 사용자 선택이 입력되면, 외부 장치의 화면에 포함된 복수의 객체 중 하나에 하이라이트 표시를 부가하여 표시하고, 이동 조작 이 입력되면 복수의 객체 중 다른 객체로 하이라이트 표시를 이동시켜 표시한다. 이후, 복수의 객체 중 하나에 하이라이트 표시가 부가된 상태에서 사용자 선택이 입력되면, 하이라이트 표시가 부가된 객체에 대응되는 동작을 수행하도록 하는 제어 신호를 생성하고, 생성된 제어 신호를 상대 장치로 전송 한다. 한편, 상술한 다양한 실시 예들은 실시 예 단독으로 제품에 적용될 수도 있으나, 적어도 일부의 내용이 본 개시 의 다른 실시 예와 조합되어 함께 구현될 수도 있다. 본 개시는 외부 장치를 제어하는 단말 장치와 장치 제어 방법에 관한 것이다. 단말 장치와 복수 개의 상대 장치 가 있고, 상호간에 화상 통화와 스크린 공유를 하는 경우, 적어도 하나의 상대 장치와 미러링 통신을 하는 외부 장치에 대해서, 외부 장치의 디스플레이를 단말 장치가 제어 할 수 있다는 점에서 본 개시의 효과가 있다. 즉, 원거리의 있는 상대방의 장치를 제어 할 수 있는 것을 넘어, 상대 장치와 미러링 통신을 하고 있는 다른 외부 장치까지도 제어할 수 있는 것이다. 한편, 상술한 다양한 실시 예에 따른 방법들은 각 단계들을 수행하기 위한 프로그램 코드 형태로 구현되어, 기 록 매체에 저장되고 배포될 수도 있다. 이 경우, 기록 매체가 탑재된 장치는 상술한 외부 장치를 제어하는 단말 장치의 제업 방법을 수행 할 수 있다. 이러한 기록 매체는, ROM, RAM, 메모리 칩, 메모리 카드, 외장형 하드, 하드, CD, DVD, 자기 디스크 또는 자기 테이프 등과 같은 다양한 유형의 컴퓨터 판독 가능 매체가 될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2023-0116494", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안될 것이다."}
{"patent_id": "10-2023-0116494", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 외부 장치를 제어하는 단말 장치를 설명하기 위한 도면이다. 도 2는 본 개시의 일 실시 예에 따른 단말 장치의 구성을 나타내는 블록도이다. 도 3은 본 개시의 다양한 실시 예에 따른 단말 장치의 화면을 공유하는 과정을 설명하기 위한 도면이다. 도 4 내지 7은 본 개시의 다양한 실시 예에 따른 단말 장치의 사용자 조작을 설명하기 위한 도면이다. 도 8은 복수 개의 장치들이 연결된 상태에서의 단말 장치 동작의 일 예를 설명하기 위한 흐름도이다. 도 9는 본 개시의 일 실시 예에 따른 외부 장치를 제어하는 서버 장치를 설명하기 위한 도면이다. 도 10은 본 개시의 일 실시 예에 따른 서버 장치의 구성을 나타내는 블록도이다. 도 11은 본 개시의 일 실시 예에 따른 모바일 디바이스의 구성을 나타내는 블록도이다. 도 12 본 개시의 일 실시 예에 따른 단말 장치의 장치 제어방법을 설명하기 위한 흐름도이다. 도 13은 복수의 장치들이 서로 연결된 상태에서의 장치 제어 방법의 일 예를 설명하기 위한 흐름도이다."}
