{"patent_id": "10-2019-0093444", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0096871", "출원번호": "10-2019-0093444", "발명의 명칭": "복수의 로봇들을 관제하는 인공 지능 서버 및 그 방법", "출원인": "엘지전자 주식회사", "발명자": "채종훈"}}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 로봇들을 관제하는 인공 지능 서버에 있어서,상기 복수의 로봇들과 통신하는 통신부; 및상기 복수의 로봇들 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신하고, 제1 로봇에 상응하는 제1동작이 상기 제1 로봇에 상응하는 제1 배치 구역 밖으로 이동하는 동작을 포함하는 경우, 상기 제1 동작에 상응하는 제1 경로를 결정하고, 상기 결정된 제1 경로상에 존재하고 적어도 하나 이상의 로봇이 배치된 구역을 결정하고, 상기 결정된 구역에 배치된 제2 로봇과 상기 제1 로봇 사이의 연계 동작을 결정하고, 상기 결정된 연계동작에 기초하여 상기 제2 로봇에 상응하는 제2 동작 또는 상기 제2 로봇에 상응하는 제2 배치 구역을 갱신하는프로세서를 포함하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 배치 구역은관제 구역의 일부이고, 적어도 하나 이상의 단위 구역들을 포함하고,상기 관제 구역은상기 복수의 로봇들의 최대 활동 범위인, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 제2 배치 구역은상기 제1 배치 구역과 인접한, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 연계 동작은상기 제1 로봇과 상기 제2 로봇 사이의 동작을 인계하는 제1 연계 동작 또는 상기 제1 로봇과 상기 제2 로봇 사이의 배치 구역을 스위칭하는 제2 연계 동작을 포함하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 프로세서는상기 연계 동작이 상기 제1 연계 동작인 경우, 상기 제2 동작을, 상기 제2 로봇을 상기 제1 로봇으로 이동시키고 상기 제2 로봇이 상기 제1 로봇과 만나면 상기 제1 동작을 이어 받도록 갱신하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 프로세서는공개특허 10-2019-0096871-3-상기 제2 동작을 갱신한 이후, 제1 동작을 제1 배치 구역으로 복귀하는 동작으로 갱신하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 4에 있어서,상기 프로세서는상기 연계 동작이 상기 제2 연계 동작인 경우, 상기 제2 배치 구역과 상기 제1 배치 구역을 서로 바꾸는, 인공지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 4에 있어서,상기 프로세서는상기 제1 배치 구역의 밀집도를 산출하고, 상기 산출된 밀집도가 제1 기준 값을 초과하는 경우에는 상기 연계동작을 상기 제1 연계 동작으로 결정하고, 상기 산출된 밀집도가 제1 기준 값을 초과하지 않는 경우에는 상기연계 동작을 제2 연계 동작으로 결정하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 프로세서는상기 통신부를 통해, 상기 복수의 로봇들 중에서 일부 또는 상기 관제 구역 내부에 설치된 카메라로부터 상기관제 구역에 관한 이미지 데이터를 수신하고, 상기 이미지 데이터를 이용하여 상기 제1 배치 구역의 밀집도를산출하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 프로세서는상기 이미지 데이터를 이용하여 상기 단위 구역별로 밀집도를 산출하고, 상기 단위 구역별로 산출된 밀집도에기초하여 상기 제1 배치 구역의 밀집도를 산출하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9에 있어서,상기 프로세서는얼굴 인식 모델을 이용하여 상기 이미지 데이터에서 상기 제1 배치 구역에 포함된 사용자들의 얼굴을 인식하고,상기 인식된 얼굴의 숫자에 기초하여 상기 제1 배치 구역의 밀집도를 결정하는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서,상기 얼굴 인식 모델은머신 러닝 알고리즘 또는 딥 러닝 알고리즘을 이용하여 학습되고, 인공 신경망으로 구성되는, 인공 지능 서버."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "복수의 로봇들을 관제하는 방법에 있어서,상기 복수의 로봇들과 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신하는 단계;상기 복수의 로봇들 중에서 제1 로봇에 상응하는 제1 동작이 상기 제1 로봇에 상응하는 제1 배치 구역 밖으로이동하는 동작을 포함하는 경우, 상기 제1 동작에 상응하는 제1 경로를 결정하는 단계;공개특허 10-2019-0096871-4-상기 결정된 제1 경로상에 존재하고 적어도 하나 이상의 로봇이 배치된 구역을 결정하는 단계;상기 결정된 구역에 배치된 제2 로봇과 상기 제1 로봇 사이의 연계 동작을 결정하는 단계; 및상기 결정된 연계 동작에 기초하여 상기 제2 로봇에 상응하는 제2 동작 또는 상기 제2 로봇에 상응하는 제2 배치 구역을 갱신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0093444", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "복수의 로봇들을 관제하는 방법을 수행하기 위한 프로그램이 기록된 기록 매체에 있어서,상기 복수의 로봇들을 관제하는 방법은상기 복수의 로봇들과 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신하는 단계;상기 복수의 로봇들 중에서 제1 로봇에 상응하는 제1 동작이 상기 제1 로봇에 상응하는 제1 배치 구역 밖으로이동하는 동작을 포함하는 경우, 상기 제1 동작에 상응하는 제1 경로를 결정하는 단계;상기 결정된 제1 경로상에 존재하고 적어도 하나 이상의 로봇이 배치된 구역을 결정하는 단계;상기 결정된 구역에 배치된 제2 로봇과 상기 제1 로봇 사이의 연계 동작을 결정하는 단계; 및상기 결정된 연계 동작에 기초하여 상기 제2 로봇에 상응하는 제2 동작 또는 상기 제2 로봇에 상응하는 제2 배치 구역을 갱신하는 단계를 포함하는, 기록 매체."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예는 복수의 로봇들을 관제하는 인공 지능 서버에 있어서, 상기 복수의 로봇들과 통신하는 통신 부; 및 상기 복수의 로봇들 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신하고, 제1 로봇에 상응하 는 제1 동작이 상기 제1 로봇에 상응하는 제1 배치 구역 밖으로 이동하는 동작을 포함하는 경우, 상기 제1 동작 에 상응하는 제1 경로를 결정하고, 상기 결정된 제1 경로상에 존재하고 적어도 하나 이상의 로봇이 배치된 구역 을 결정하고, 상기 결정된 구역에 배치된 제2 로봇과 상기 제1 로봇 사이의 연계 동작을 결정하고, 상기 결정된 연계 동작에 기초하여 상기 제2 로봇에 상응하는 제2 동작 또는 상기 제2 로봇에 상응하는 제2 배치 구역을 갱신 하는 프로세서를 포함하는, 인공 지능 서버를 제공한다."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 복수의 로봇들을 관제하는 인공 지능 서버 및 그 방법에 관한 것이다. 구체적으로, 본 발명은 복수의 로봇들의 동작 또는 배치 구역 중에서 적어도 하나 이상을 유기적으로 관제하는 인공 지능 서버 및 그 방법에 관한 것이다."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 공항 이용객의 폭발적인 증가 추세 및 스마트 공항으로의 도약을 위한 노력으로, 공항이나 멀티플렉스 내 에서 인공 지능 로봇을 통해 서비스를 제공하는 방안이 논의되고 있다. 공항이나 멀티플렉스에 인공 지능 로봇을 도입하는 경우, 기존의 컴퓨터 시스템이 대체할 수 없었던 사람의 고 유 역할을 로봇이 대신 수행할 수 있어, 제공되는 서비스의 양적 및 질적 향상에 기여할 수 있을 것으로 기대된 다. 인공 지능 로봇은 공항뿐만 아니라 사람들이 많이 모이는 다양한 장소에서 사용자에게 길을 알려주는 등의 다양 한 동작을 수행할 수 있다. 그러나, 일반적으로, 인공 지능 로봇은 자신에게 할당된 구역에만 위치하고 있어, 사람들의 밀집도가 증가하여 보다 많은 로봇들의 안내 서비스가 필요한 상황에 능동적으로 대처하지 못하는 문제가 있었다."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 특정 로봇이 자신의 배치 구역을 벗어나는 동작을 수행해야 하는 경우에, 해당 배치 구역의 공백을 줄이도록 로봇들의 동작 또는 배치 구역을 관제하는 인공 지능 서버 및 그 방법을 제공하고자 한다."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시 예는 복수의 로봇들 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신하고, 수신 한 정보에 기초하여 자신에게 배정된 배치 구역을 벗어나는 동작을 수행하는 제1 로봇이 존재하는지 판단하고,제1 로봇의 배치 구역과 인접하고 제1 로봇의 동작에 상응하는 제1 경로에 위치한 구역에 배치된 제2 로봇을 결 정하고, 제1 로봇과 제2 로봇 사이의 연계 동작을 결정하여 제2 로봇의 동작 또는 배치 구역을 갱신하는 인공 지능 서버 및 그 방법을 제공한다. 또한, 본 발명의 일 실시 예는 인접한 구역에 배치된 두 로봇 각각의 동작을 서로 인계하는 제1 연계 동작을 이 용하여, 제2 로봇의 동작을 제1 로봇의 동작을 이어 받도록 갱신하는 인공 지능 서버 및 그 방법을 제공한다. 또한, 본 발명의 일 실시 예는 인접한 구역에 배치된 두 로봇 각각의 배치 구역을 서로 바꾸는 제2 연계 동작을 이용하여, 제1 로봇의 배치 구역과 제2 로봇의 배치 구역을 교환하는 인공 지능 서버 및 그 방법을 제공한다."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시 예에 따르면, 특정 로봇이 자신의 배치 구역을 벗어나는 동작을 수행해야 하더라도, 다 른 로봇들과 연계하여 공백 구역을 없앰으로써, 사용자들에게 서비스를 안정적으로 제공할 수 있다. 또한, 본 발명의 다양한 실시 예에 따르면, 관제 구역의 밀집도를 고려하여 로봇들 사이의 동작 또는 배치 구역 을 인계함으로써, 각 로봇들 사이의 부하를 효과적으로 분배할 수 있다."}
{"patent_id": "10-2019-0093444", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시 예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 '모듈' 및 '부'는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시 예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 '직접 연결되어' 있다거나 '직접 접속되어' 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. <인공 지능(AI: Artificial Intelligence)> 인공 지능은 인공적인 지능 또는 이를 만들 수 있는 방법론을 연구하는 분야를 의미하며, 머신 러닝(기계 학습, Machine Learning)은 인공 지능 분야에서 다루는 다양한 문제를 정의하고 그것을 해결하는 방법론을 연구하는 분야를 의미한다. 머신 러닝은 어떠한 작업에 대하여 꾸준한 경험을 통해 그 작업에 대한 성능을 높이는 알고리 즘으로 정의하기도 한다. 인공 신경망(ANN: Artificial Neural Network)은 머신 러닝에서 사용되는 모델로써, 시냅스의 결합으로 네트워 크를 형성한 인공 뉴런(노드)들로 구성되는, 문제 해결 능력을 가지는 모델 전반을 의미할 수 있다. 인공 신경 망은 다른 레이어의 뉴런들 사이의 연결 패턴, 모델 파라미터를 갱신하는 학습 과정, 출력값을 생성하는 활성화 함수(Activation Function)에 의해 정의될 수 있다. 인공 신경망은 입력층(Input Layer), 출력층(Output Layer), 그리고 선택적으로 하나 이상의 은닉층(Hidden Layer)를 포함할 수 있다. 각 층은 하나 이상의 뉴런을 포함하고, 인공 신경망은 뉴런과 뉴런을 연결하는 시냅 스를 포함할 수 있다. 인공 신경망에서 각 뉴런은 시냅스를 통해 입력되는 입력 신호들, 가중치, 편향에 대한 활성 함수의 함숫값을 출력할 수 있다. 모델 파라미터는 학습을 통해 결정되는 파라미터를 의미하며, 시냅스 연결의 가중치와 뉴런의 편향 등이 포함된 다. 그리고, 하이퍼파라미터는 머신 러닝 알고리즘에서 학습 전에 설정되어야 하는 파라미터를 의미하며, 학습 률(Learning Rate), 반복 횟수, 미니 배치 크기, 초기화 함수 등이 포함된다. 인공 신경망의 학습의 목적은 손실 함수를 최소화하는 모델 파라미터를 결정하는 것으로 볼 수 있다. 손실 함수 는 인공 신경망의 학습 과정에서 최적의 모델 파라미터를 결정하기 위한 지표로 이용될 수 있다. 머신 러닝은 학습 방식에 따라 지도 학습(Supervised Learning), 비지도 학습(Unsupervised Learning), 강화 학습(Reinforcement Learning)으로 분류할 수 있다. 지도 학습은 학습 데이터에 대한 레이블(label)이 주어진 상태에서 인공 신경망을 학습시키는 방법을 의미하며, 레이블이란 학습 데이터가 인공 신경망에 입력되는 경우 인공 신경망이 추론해 내야 하는 정답(또는 결과 값)을 의미할 수 있다. 비지도 학습은 학습 데이터에 대한 레이블이 주어지지 않는 상태에서 인공 신경망을 학습시키 는 방법을 의미할 수 있다. 강화 학습은 어떤 환경 안에서 정의된 에이전트가 각 상태에서 누적 보상을 최대화 하는 행동 혹은 행동 순서를 선택하도록 학습시키는 학습 방법을 의미할 수 있다. 인공 신경망 중에서 복수의 은닉층을 포함하는 심층 신경망(DNN: Deep Neural Network)으로 구현되는 머신 러닝 을 딥 러닝(심층 학습, Deep Learning)이라 부르기도 하며, 딥 러닝은 머신 러닝의 일부이다. 이하에서, 머신 러닝은 딥 러닝을 포함하는 의미로 사용된다. <로봇(Robot)> 로봇은 스스로 보유한 능력에 의해 주어진 일을 자동으로 처리하거나 작동하는 기계를 의미할 수 있다. 특히, 환경을 인식하고 스스로 판단하여 동작을 수행하는 기능을 갖는 로봇을 지능형 로봇이라 칭할 수 있다. 로봇은 사용 목적이나 분야에 따라 산업용, 의료용, 가정용, 군사용 등으로 분류할 수 있다. 로봇은 액츄에이터 또는 모터를 포함하는 구동부를 구비하여 로봇 관절을 움직이는 등의 다양한 물리적 동작을 수행할 수 있다. 또한, 이동 가능한 로봇은 구동부에 휠, 브레이크, 프로펠러 등이 포함되어, 구동부를 통해 지 상에서 주행하거나 공중에서 비행할 수 있다. <자율 주행(Self-Driving)> 자율 주행은 스스로 주행하는 기술을 의미하며, 자율 주행 차량은 사용자의 조작 없이 또는 사용자의 최소한의 조작으로 주행하는 차량(Vehicle)을 의미한다. 예컨대, 자율 주행에는 주행중인 차선을 유지하는 기술, 어댑티브 크루즈 컨트롤과 같이 속도를 자동으로 조절 하는 기술, 정해진 경로를 따라 자동으로 주행하는 기술, 목적지가 설정되면 자동으로 경로를 설정하여 주행하 는 기술 등이 모두 포함될 수 있다. 차량은 내연 기관만을 구비하는 차량, 내연 기관과 전기 모터를 함께 구비하는 하이브리드 차량, 그리고 전기 모터만을 구비하는 전기 차량을 모두 포괄하며, 자동차뿐만 아니라 기차, 오토바이 등을 포함할 수 있다. 이때, 자율 주행 차량은 자율 주행 기능을 가진 로봇으로 볼 수 있다. <확장 현실(XR: eXtended Reality)> 확장 현실은 가상 현실(VR: Virtual Reality), 증강 현실(AR: Augmented Reality), 혼합 현실(MR: Mixed Reality)을 총칭한다. VR 기술은 현실 세계의 객체나 배경 등을 CG 영상으로만 제공하고, AR 기술은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR 기술은 현실 세계에 가상 객체들을 섞고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. MR 기술은 현실 객체와 가상 객체를 함께 보여준다는 점에서 AR 기술과 유사하다. 그러나, AR 기술에서는 가상 객체가 현실 객체를 보완하는 형태로 사용되는 반면, MR 기술에서는 가상 객체와 현실 객체가 동등한 성격으로 사용된다는 점에서 차이점이 있다. XR 기술은 HMD(Head-Mount Display), HUD(Head-Up Display), 휴대폰, 태블릿 PC, 랩탑, 데스크탑, TV, 디지털 사이니지 등에 적용될 수 있고, XR 기술이 적용된 장치를 XR 장치(XR Device)라 칭할 수 있다. 도 1은 본 발명의 일 실시 예에 따른 AI 장치를 나타낸다. AI 장치는 TV, 프로젝터, 휴대폰, 스마트폰, 데스크탑 컴퓨터, 노트북, 디지털방송용 단말기, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 셋톱박스(STB), DMB 수신기, 라디오, 세탁기, 냉장고, 데스크탑 컴퓨터, 디지털 사이니지, 로봇, 차량 등 과 같은, 고정형 기기 또는 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, 단말기는 통신부, 입력부, 러닝 프로세서, 센싱부, 출력부, 메모리 및 프로세서 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 AI 장치(100a 내지 100e)나 AI 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신할 수 있다. 이때, 통신부가 이용하는 통신 기술에는 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), LTE(Long Term Evolution), 5G, WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), 블 루투스(Bluetooth쪠), RFID(Radio Frequency Identification), 적외선 통신(Infrared Data Association; IrDA), ZigBee, NFC(Near Field Communication) 등이 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여,카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 입력부는 모델 학습을 위한 학습 데이터 및 학습 모델을 이용하여 출력을 획득할 때 사용될 입력 데이터 등을 획득할 수 있다. 입력부는 가공되지 않은 입력 데이터를 획득할 수도 있으며, 이 경우 프로세서 또는 러닝 프로세서는 입력 데이터에 대하여 전처리로써 입력 특징점(input feature)을 추출할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망으로 구성된 모델을 학습시킬 수 있다. 여기서, 학습 된 인공 신경망을 학습 모델이라 칭할 수 있다. 학습 모델은 학습 데이터가 아닌 새로운 입력 데이터에 대하여 결과 값을 추론해 내는데 사용될 수 있고, 추론된 값은 어떠한 동작을 수행하기 위한 판단의 기초로 이용될 수 있다. 이때, 러닝 프로세서는 AI 서버의 러닝 프로세서과 함께 AI 프로세싱을 수행할 수 있다. 이때, 러닝 프로세서는 AI 장치에 통합되거나 구현된 메모리를 포함할 수 있다. 또는, 러닝 프로세서 는 메모리, AI 장치에 직접 결합된 외부 메모리 또는 외부 장치에서 유지되는 메모리를 사용하 여 구현될 수도 있다. 센싱부는 다양한 센서들을 이용하여 AI 장치 내부 정보, AI 장치의 주변 환경 정보 및 사용자 정보 중 적어도 하나를 획득할 수 있다. 이때, 센싱부에 포함되는 센서에는 근접 센서, 조도 센서, 가속도 센서, 자기 센서, 자이로 센서, 관성 센 서, RGB 센서, IR 센서, 지문 인식 센서, 초음파 센서, 광 센서, 마이크로폰, 라이다, 레이더 등이 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 AI 장치의 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력 부에서 획득한 입력 데이터, 학습 데이터, 학습 모델, 학습 히스토리 등을 저장할 수 있다. 프로세서는 데이터 분석 알고리즘 또는 머신 러닝 알고리즘을 사용하여 결정되거나 생성된 정보에 기초하 여, AI 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 프로세서는 AI 장치(10 0)의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 이를 위해, 프로세서는 러닝 프로세서 또는 메모리의 데이터를 요청, 검색, 수신 또는 활용할 수 있고, 상기 적어도 하나의 실행 가능한 동작 중 예측되는 동작이나, 바람직한 것으로 판단되는 동작을 실행 하도록 AI 장치의 구성 요소들을 제어할 수 있다. 이때, 프로세서는 결정된 동작을 수행하기 위하여 외부 장치의 연계가 필요한 경우, 해당 외부 장치를 제 어하기 위한 제어 신호를 생성하고, 생성한 제어 신호를 해당 외부 장치에 전송할 수 있다. 프로세서는 사용자 입력에 대하여 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 사용자의 요구 사 항을 결정할 수 있다. 이때, 프로세서는 음성 입력을 문자열로 변환하기 위한 STT(Speech To Text) 엔진 또는 자연어의 의도 정 보를 획득하기 위한 자연어 처리(NLP: Natural Language Processing) 엔진 중에서 적어도 하나 이상을 이용하여, 사용자 입력에 상응하는 의도 정보를 획득할 수 있다. 이때, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 적어도 일부가 머신 러닝 알고리즘에 따라 학습된 인 공 신경망으로 구성될 수 있다. 그리고, STT 엔진 또는 NLP 엔진 중에서 적어도 하나 이상은 러닝 프로세서 에 의해 학습된 것이나, AI 서버의 러닝 프로세서에 의해 학습된 것이거나, 또는 이들의 분산 처리에 의해 학습된 것일 수 있다. 프로세서는 AI 장치의 동작 내용이나 동작에 대한 사용자의 피드백 등을 포함하는 이력 정보를 수집 하여 메모리 또는 러닝 프로세서에 저장하거나, AI 서버 등의 외부 장치에 전송할 수 있다. 수 집된 이력 정보는 학습 모델을 갱신하는데 이용될 수 있다. 프로세서는 메모리에 저장된 응용 프로그램을 구동하기 위하여, AI 장치의 구성 요소들 중 적어 도 일부를 제어할 수 있다. 나아가, 프로세서는 상기 응용 프로그램의 구동을 위하여, AI 장치에 포함된 구성 요소들 중 둘 이상을 서로 조합하여 동작시킬 수 있다. 도 2는 본 발명의 일 실시 예에 따른 AI 서버를 나타낸다. 도 2를 참조하면, AI 서버는 머신 러닝 알고리즘을 이용하여 인공 신경망을 학습시키거나 학습된 인공 신 경망을 이용하는 장치를 의미할 수 있다. 여기서, AI 서버는 복수의 서버들로 구성되어 분산 처리를 수행 할 수도 있고, 5G 네트워크로 정의될 수 있다. 이때, AI 서버는 AI 장치의 일부의 구성으로 포함되어, AI 프로세싱 중 적어도 일부를 함께 수행할 수도 있다. AI 서버는 통신부, 메모리, 러닝 프로세서 및 프로세서 등을 포함할 수 있다. 통신부는 AI 장치 등의 외부 장치와 데이터를 송수신할 수 있다. 메모리는 모델 저장부를 포함할 수 있다. 모델 저장부는 러닝 프로세서을 통하여 학습 중 인 또는 학습된 모델(또는 인공 신경망, 231a)을 저장할 수 있다. 러닝 프로세서는 학습 데이터를 이용하여 인공 신경망(231a)을 학습시킬 수 있다. 학습 모델은 인공 신경 망의 AI 서버에 탑재된 상태에서 이용되거나, AI 장치 등의 외부 장치에 탑재되어 이용될 수도 있다. 학습 모델은 하드웨어, 소프트웨어 또는 하드웨어와 소프트웨어의 조합으로 구현될 수 있다. 학습 모델의 일부 또는 전부가 소프트웨어로 구현되는 경우 학습 모델을 구성하는 하나 이상의 명령어(instruction)는 메모리 에 저장될 수 있다. 프로세서는 학습 모델을 이용하여 새로운 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기 초한 응답이나 제어 명령을 생성할 수 있다. 도 3은 본 발명의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 3을 참조하면, AI 시스템은 AI 서버, 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰 (100d) 또는 가전(100e) 중에서 적어도 하나 이상이 클라우드 네트워크와 연결된다. 여기서, AI 기술이 적 용된 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스마트폰(100d) 또는 가전(100e) 등을 AI 장치(100a 내지 100e)라 칭할 수 있다. 클라우드 네트워크는 클라우드 컴퓨팅 인프라의 일부를 구성하거나 클라우드 컴퓨팅 인프라 안에 존재하는 네트워크를 의미할 수 있다. 여기서, 클라우드 네트워크는 3G 네트워크, 4G 또는 LTE(Long Term Evolution) 네트워크 또는 5G 네트워크 등을 이용하여 구성될 수 있다. 즉, AI 시스템을 구성하는 각 장치들(100a 내지 100e, 200)은 클라우드 네트워크를 통해 서로 연결될 수 있다. 특히, 각 장치들(100a 내지 100e, 200)은 기지국을 통해서 서로 통신할 수도 있지만, 기지국을 통하지 않 고 직접 서로 통신할 수도 있다. AI 서버는 AI 프로세싱을 수행하는 서버와 빅 데이터에 대한 연산을 수행하는 서버를 포함할 수 있다. AI 서버는 AI 시스템을 구성하는 AI 장치들인 로봇(100a), 자율 주행 차량(100b), XR 장치(100c), 스 마트폰(100d) 또는 가전(100e) 중에서 적어도 하나 이상과 클라우드 네트워크을 통하여 연결되고, 연결된 AI 장치들(100a 내지 100e)의 AI 프로세싱을 적어도 일부를 도울 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)를 대신하여 머신 러닝 알고리즘에 따라 인공 신경망을 학습시킬 수 있고, 학습 모델을 직접 저장하거나 AI 장치(100a 내지 100e)에 전송할 수 있다. 이때, AI 서버는 AI 장치(100a 내지 100e)로부터 입력 데이터를 수신하고, 학습 모델을 이용하여 수신한 입력 데이터에 대하여 결과 값을 추론하고, 추론한 결과 값에 기초한 응답이나 제어 명령을 생성하여 AI 장치 (100a 내지 100e)로 전송할 수 있다. 또는, AI 장치(100a 내지 100e)는 직접 학습 모델을 이용하여 입력 데이터에 대하여 결과 값을 추론하고, 추론 한 결과 값에 기초한 응답이나 제어 명령을 생성할 수도 있다. 이하에서는, 상술한 기술이 적용되는 AI 장치(100a 내지 100e)의 다양한 실시 예들을 설명한다. 여기서, 도 3에 도시된 AI 장치(100a 내지 100e)는 도 1에 도시된 AI 장치의 구체적인 실시 예로 볼 수 있다. <AI+로봇> 로봇(100a)은 AI 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. 로봇(100a)은 동작을 제어하기 위한 로봇 제어 모듈을 포함할 수 있고, 로봇 제어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 로봇(100a)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 로봇(100a)의 상태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계획을 결정하거나, 사용 자 상호작용에 대한 응답을 결정하거나, 동작을 결정할 수 있다. 여기서, 로봇(100a)은 이동 경로 및 주행 계획을 결정하기 위하여, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 로봇(100a)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있 다. 예컨대, 로봇(100a)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 동작을 결정할 수 있다. 여기서, 학습 모델은 로봇(100a)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 로봇(100a)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등 의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 로봇(100a)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적 어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로와 주행 계 획에 따라 로봇(100a)을 주행시킬 수 있다. 맵 데이터에는 로봇(100a)이 이동하는 공간에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 벽, 문 등의 고정 객체들과 화분, 책상 등의 이동 가능한 객체들에 대한 객체 식별 정보 가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위치 등이 포함될 수 있다. 또한, 로봇(100a)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 로봇(100a)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+자율주행> 자율 주행 차량(100b)은 AI 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있다. 자율 주행 차량(100b)은 자율 주행 기능을 제어하기 위한 자율 주행 제어 모듈을 포함할 수 있고, 자율 주행 제 어 모듈은 소프트웨어 모듈 또는 이를 하드웨어로 구현한 칩을 의미할 수 있다. 자율 주행 제어 모듈은 자율 주 행 차량(100b)의 구성으로써 내부에 포함될 수도 있지만, 자율 주행 차량(100b)의 외부에 별도의 하드웨어로 구 성되어 연결될 수도 있다. 자율 주행 차량(100b)은 다양한 종류의 센서들로부터 획득한 센서 정보를 이용하여 자율 주행 차량(100b)의 상 태 정보를 획득하거나, 주변 환경 및 객체를 검출(인식)하거나, 맵 데이터를 생성하거나, 이동 경로 및 주행 계 획을 결정하거나, 동작을 결정할 수 있다. 여기서, 자율 주행 차량(100b)은 이동 경로 및 주행 계획을 결정하기 위하여, 로봇(100a)과 마찬가지로, 라이다, 레이더, 카메라 중에서 적어도 하나 이상의 센서에서 획득한 센서 정보를 이용할 수 있다. 특히, 자율 주행 차량(100b)은 시야가 가려지는 영역이나 일정 거리 이상의 영역에 대한 환경이나 객체는 외부 장치들로부터 센서 정보를 수신하여 인식하거나, 외부 장치들로부터 직접 인식된 정보를 수신할 수 있다. 자율 주행 차량(100b)은 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수 행할 수 있다. 예컨대, 자율 주행 차량(100b)은 학습 모델을 이용하여 주변 환경 및 객체를 인식할 수 있고, 인식된 주변 환경 정보 또는 객체 정보를 이용하여 주행 동선을 결정할 수 있다. 여기서, 학습 모델은 자율 주행 차량(100b)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, 자율 주행 차량(100b)은 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서 버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. 자율 주행 차량(100b)은 맵 데이터, 센서 정보로부터 검출한 객체 정보 또는 외부 장치로부터 획득한 객체 정보 중에서 적어도 하나 이상을 이용하여 이동 경로와 주행 계획을 결정하고, 구동부를 제어하여 결정된 이동 경로 와 주행 계획에 따라 자율 주행 차량(100b)을 주행시킬 수 있다. 맵 데이터에는 자율 주행 차량(100b)이 주행하는 공간(예컨대, 도로)에 배치된 다양한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 예컨대, 맵 데이터에는 가로등, 바위, 건물 등의 고정 객체들과 차량, 보행자 등의 이 동 가능한 객체들에 대한 객체 식별 정보가 포함될 수 있다. 그리고, 객체 식별 정보에는 명칭, 종류, 거리, 위 치 등이 포함될 수 있다. 또한, 자율 주행 차량(100b)은 사용자의 제어/상호작용에 기초하여 구동부를 제어함으로써, 동작을 수행하거나 주행할 수 있다. 이때, 자율 주행 차량(100b)은 사용자의 동작이나 음성 발화에 따른 상호작용의 의도 정보를 획득하고, 획득한 의도 정보에 기초하여 응답을 결정하여 동작을 수행할 수 있다. <AI+XR> XR 장치(100c)는 AI 기술이 적용되어, HMD(Head-Mount Display), 차량에 구비된 HUD(Head-Up Display), 텔레비 전, 휴대폰, 스마트 폰, 컴퓨터, 웨어러블 디바이스, 가전 기기, 디지털 사이니지, 차량, 고정형 로봇이나 이동 형 로봇 등으로 구현될 수 있다. XR 장치(100c)는 다양한 센서들을 통해 또는 외부 장치로부터 획득한 3차원 포인트 클라우드 데이터 또는 이미 지 데이터를 분석하여 3차원 포인트들에 대한 위치 데이터 및 속성 데이터를 생성함으로써 주변 공간 또는 현실 객체에 대한 정보를 획득하고, 출력할 XR 객체를 렌더링하여 출력할 수 있다. 예컨대, XR 장치(100c)는 인식된 물체에 대한 추가 정보를 포함하는 XR 객체를 해당 인식된 물체에 대응시켜 출력할 수 있다. XR 장치(100c)는 적어도 하나 이상의 인공 신경망으로 구성된 학습 모델을 이용하여 상기한 동작들을 수행할 수 있다. 예컨대, XR 장치(100c)는 학습 모델을 이용하여 3차원 포인트 클라우드 데이터 또는 이미지 데이터에서 현실 객체를 인식할 수 있고, 인식한 현실 객체에 상응하는 정보를 제공할 수 있다. 여기서, 학습 모델은 XR 장 치(100c)에서 직접 학습되거나, AI 서버 등의 외부 장치에서 학습된 것일 수 있다. 이때, XR 장치(100c)는 직접 학습 모델을 이용하여 결과를 생성하여 동작을 수행할 수도 있지만, AI 서버 등의 외부 장치에 센서 정보를 전송하고 그에 따라 생성된 결과를 수신하여 동작을 수행할 수도 있다. <AI+로봇+자율주행> 로봇(100a)은 AI 기술 및 자율 주행 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터 테인먼트 로봇, 펫 로봇, 무인 비행 로봇 등으로 구현될 수 있다. AI 기술과 자율 주행 기술이 적용된 로봇(100a)은 자율 주행 기능을 가진 로봇 자체나, 자율 주행 차량(100b)과 상호작용하는 로봇(100a) 등을 의미할 수 있다. 자율 주행 기능을 가진 로봇(100a)은 사용자의 제어 없이도 주어진 동선에 따라 스스로 움직이거나, 동선을 스 스로 결정하여 움직이는 장치들을 통칭할 수 있다. 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차량(100b)은 이동 경로 또는 주행 계획 중 하나 이상을 결정 하기 위해 공통적인 센싱 방법을 사용할 수 있다. 예컨대, 자율 주행 기능을 가진 로봇(100a) 및 자율 주행 차 량(100b)은 라이다, 레이더, 카메라를 통해 센싱된 정보를 이용하여, 이동 경로 또는 주행 계획 중 하나 이상을 결정할 수 있다. 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)과 별개로 존재하면서, 자율 주행 차 량(100b)의 내부에서 자율 주행 기능에 연계되거나, 자율 주행 차량(100b)에 탑승한 사용자와 연계된 동작을 수행할 수 있다. 이때, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)을 대신하여 센서 정보를 획득 하여 자율 주행 차량(100b)에 제공하거나, 센서 정보를 획득하고 주변 환경 정보 또는 객체 정보를 생성하여 자 율 주행 차량(100b)에 제공함으로써, 자율 주행 차량(100b)의 자율 주행 기능을 제어하거나 보조할 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)에 탑승한 사용자를 모니터링하 거나 사용자와의 상호작용을 통해 자율 주행 차량(100b)의 기능을 제어할 수 있다. 예컨대, 로봇(100a)은 운전 자가 졸음 상태인 경우로 판단되는 경우, 자율 주행 차량(100b)의 자율 주행 기능을 활성화하거나 자율 주행 차 량(100b)의 구동부의 제어를 보조할 수 있다. 여기서, 로봇(100a)이 제어하는 자율 주행 차량(100b)의 기능에는 단순히 자율 주행 기능뿐만 아니라, 자율 주행 차량(100b)의 내부에 구비된 네비게이션 시스템이나 오디오 시스 템에서 제공하는 기능도 포함될 수 있다. 또는, 자율 주행 차량(100b)과 상호작용하는 로봇(100a)은 자율 주행 차량(100b)의 외부에서 자율 주행 차량 (100b)에 정보를 제공하거나 기능을 보조할 수 있다. 예컨대, 로봇(100a)은 스마트 신호등과 같이 자율 주행 차 량(100b)에 신호 정보 등을 포함하는 교통 정보를 제공할 수도 있고, 전기 차량의 자동 전기 충전기와 같이 자 율 주행 차량(100b)과 상호작용하여 충전구에 전기 충전기를 자동으로 연결할 수도 있다. <AI+로봇+XR> 로봇(100a)은 AI 기술 및 XR 기술이 적용되어, 안내 로봇, 운반 로봇, 청소 로봇, 웨어러블 로봇, 엔터테인먼트 로봇, 펫 로봇, 무인 비행 로봇, 드론 등으로 구현될 수 있다. XR 기술이 적용된 로봇(100a)은 XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇을 의미할 수 있다. 이 경 우, 로봇(100a)은 XR 장치(100c)와 구분되며 서로 연동될 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 로봇(100a)은 카메라를 포함하는 센서들로부터 센서 정보를 획 득하면, 로봇(100a) 또는 XR 장치(100c)는 센서 정보에 기초한 XR 영상을 생성하고, XR 장치(100c)는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 로봇(100a)은 XR 장치(100c)를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 예컨대, 사용자는 XR 장치(100c) 등의 외부 장치를 통해 원격으로 연동된 로봇(100a)의 시점에 상응하는 XR 영 상을 확인할 수 있고, 상호작용을 통하여 로봇(100a)의 자율 주행 경로를 조정하거나, 동작 또는 주행을 제어하 거나, 주변 객체의 정보를 확인할 수 있다. <AI+자율주행+XR> 자율 주행 차량(100b)은 AI 기술 및 XR 기술이 적용되어, 이동형 로봇, 차량, 무인 비행체 등으로 구현될 수 있 다. XR 기술이 적용된 자율 주행 차량(100b)은 XR 영상을 제공하는 수단을 구비한 자율 주행 차량이나, XR 영상 내 에서의 제어/상호작용의 대상이 되는 자율 주행 차량 등을 의미할 수 있다. 특히, XR 영상 내에서의 제어/상호 작용의 대상이 되는 자율 주행 차량(100b)은 XR 장치(100c)와 구분되며 서로 연동될 수 있다. XR 영상을 제공하는 수단을 구비한 자율 주행 차량(100b)은 카메라를 포함하는 센서들로부터 센서 정보를 획득 하고, 획득한 센서 정보에 기초하여 생성된 XR 영상을 출력할 수 있다. 예컨대, 자율 주행 차량(100b)은 HUD를 구비하여 XR 영상을 출력함으로써, 탑승자에게 현실 객체 또는 화면 속의 객체에 대응되는 XR 객체를 제공할 수 있다. 이때, XR 객체가 HUD에 출력되는 경우에는 XR 객체의 적어도 일부가 탑승자의 시선이 향하는 실제 객체에 오버 랩되도록 출력될 수 있다. 반면, XR 객체가 자율 주행 차량(100b)의 내부에 구비되는 디스플레이에 출력되는 경 우에는 XR 객체의 적어도 일부가 화면 속의 객체에 오버랩되도록 출력될 수 있다. 예컨대, 자율 주행 차량 (100b)은 차로, 타 차량, 신호등, 교통 표지판, 이륜차, 보행자, 건물 등과 같은 객체와 대응되는 XR 객체들을 출력할 수 있다. XR 영상 내에서의 제어/상호작용의 대상이 되는 자율 주행 차량(100b)은 카메라를 포함하는 센서들로부터 센서 정보를 획득하면, 자율 주행 차량(100b) 또는 XR 장치(100c)는 센서 정보에 기초한 XR 영상을 생성하고, XR 장 치(100c)는 생성된 XR 영상을 출력할 수 있다. 그리고, 이러한 자율 주행 차량(100b)은 XR 장치(100c) 등의 외 부 장치를 통해 입력되는 제어 신호 또는 사용자의 상호작용에 기초하여 동작할 수 있다. 도 4는 본 발명의 일 실시 예에 따른 AI 장치를 나타낸다. 도 1과 중복되는 설명은 생략한다. 이하에서, AI 장치는 AI 로봇이라 칭할 수 있으며, AI 장치라는 용어와 AI 로봇이라는 용어는 별도의 구분이 없으면 동일한 의미로 사용될 수 있다. 도 4를 참조하면, 인공 지능 로봇은 주행 구동부를 더 포함할 수 있다. 입력부는 영상 신호 입력을 위한 카메라(Camera, 121), 오디오 신호를 수신하기 위한 마이크로폰 (Microphone, 122), 사용자로부터 정보를 입력 받기 위한 사용자 입력부(User Input Unit, 123)를 포함할 수 있다. 입력부에서 수집한 음성 데이터나 이미지 데이터는 분석되어 사용자의 제어 명령으로 처리될 수 있다. 입력부는 영상 정보(또는 신호), 오디오 정보(또는 신호), 데이터, 또는 사용자로부터 입력되는 정보의 입 력을 위한 것으로서, 영상 정보의 입력을 위하여, AI 장치는 하나 또는 복수의 카메라들을 구비할 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서에 의해 얻어지는 정지영상 또는 동영상 등의 화 상 프레임을 처리한다. 처리된 화상 프레임은 디스플레이부(Display Unit, 151)에 표시되거나 메모리에 저 장될 수 있다. 마이크로폰은 외부의 음향 신호를 전기적인 음성 데이터로 처리한다. 처리된 음성 데이터는 AI 장치 에서 수행 중인 기능(또는 실행 중인 응용 프로그램)에 따라 다양하게 활용될 수 있다. 한편, 마이크로폰 에는 외부의 음향 신호를 입력 받는 과정에서 발생되는 잡음(noise)을 제거하기 위한 다양한 잡음 제거 알고리 즘이 적용될 수 있다. 사용자 입력부는 사용자로부터 정보를 입력 받기 위한 것으로서, 사용자 입력부를 통해 정보가 입력 되면, 프로세서는 입력된 정보에 대응되도록 AI 장치의 동작을 제어할 수 있다. 사용자 입력부는 기계식 (mechanical) 입력수단(또는, 메커니컬 키, 예컨대, AI 장치의 전/후면 또는 측면에 위치하는 버튼, 돔 스위치 (dome switch), 조그 휠, 조그 스위치 등) 및 터치식 입력수단을 포함할 수 있다. 일 예로서, 터치식 입력수단은, 소프트웨어적인 처리를 통해 터치스크린에 표시되는 가상 키(virtual key), 소프트 키(soft key) 또는 비주얼 키(visual key)로 이루어지거나, 상기 터치스크린 이외의 부분에 배치 되는 터치 키(touch key)로 이루어질 수 있다. 센싱부는 센서부라고 칭할 수 있다. 출력부는 디스플레이부(Display Unit, 151), 음향 출력부(Sound Output Unit, 152), 햅틱 모듈(Haptic Module, 153), 광 출력부(Optical Output Unit, 154) 중 적어도 하나를 포함할 수 있다. 디스플레이부는 AI 장치에서 처리되는 정보를 표시(출력)한다. 예컨대, 디스플레이부는 AI 장치 에서 구동되는 응용 프로그램의 실행화면 정보, 또는 이러한 실행화면 정보에 따른 UI(User Interface), GUI(Graphic User Interface) 정보를 표시할 수 있다. 디스플레이부는 터치 센서와 상호 레이어 구조를 이루거나 일체형으로 형성됨으로써, 터치 스크린을 구현 할 수 있다. 이러한 터치 스크린은, AI 장치와 사용자 사이의 입력 인터페이스를 제공하는 사용자 입력부 로써 기능함과 동시에, 단말기와 사용자 사이의 출력 인터페이스를 제공할 수 있다. 음향 출력부는 호신호 수신, 통화모드 또는 녹음 모드, 음성인식 모드, 방송수신 모드 등에서 통신부(11 0)로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력할 수 있다. 음향 출력부는 리시버(receiver), 스피커(speaker), 버저(buzzer) 중 적어도 하나 이상을 포함할 수 있다.햅틱 모듈(haptic module)은 사용자가 느낄 수 있는 다양한 촉각 효과를 발생시킨다. 햅틱 모듈이 발 생시키는 촉각 효과의 대표적인 예로는 진동이 될 수 있다. 광출력부는 AI 장치의 광원의 빛을 이용하여 이벤트 발생을 알리기 위한 신호를 출력한다. AI 장치 에서 발생 되는 이벤트의 예로는 메시지 수신, 호 신호 수신, 부재중 전화, 알람, 일정 알림, 이메일 수신, 애플리케이션을 통한 정보 수신 등이 될 수 있다. 주행 구동부는 인공 지능 로봇를 특정 방향으로 또는 특정 거리만큼 이동시킬 수 있다. 주행 구동부는 인공 지능 로봇의 좌륜을 구동시키는 좌륜 구동부 및 우륜을 구동시키는 우륜 구 동부를 포함할 수 있다. 좌륜 구동부는 좌륜을 구동시키기 위한 모터를 포함할 수 있고, 우륜 구동부는 우륜을 구동시키기 위 한 모터를 포함할 수 있다. 도 4에서는 주행 구동부가 좌륜 구동부 및 우륜 구동부를 포함하는 것을 예로 들어 설명하였으 나, 본 발명이 이에 한정되지 않는다. 즉, 일 실시 예에서 주행 구동부는 하나의 휠 만으로 구성될 수도 있으며, 3개 이상의 휠로 구성될 수도 있다. 도 5는 본 발명의 일 실시 예에 따른 복수의 로봇들을 관제하는 방법을 나타낸 동작 흐름도이다. 인공 지능 서버는 적어도 하나 이상의 로봇 또는 인공 지능 로봇과 통신하며, 인공 지능 서버가 로봇 또는 인공 지능 로봇의 경로를 결정할 수 있다. 즉, 인공 지능 서버는 인공 지능 기능을 탑재하지 않은 통상의 로봇과 인공 지능 기능을 탑재한 인공 지능 로봇 중에서 적어도 하나 이상의 경로를 결정할 수 있다. 이하에서, 특별한 구분이 없는 한 로봇은 인공 지능 로봇을 포함한다. 이때, 인공 지능 서버는 공항이나 빌딩에 배치된 적어도 하나 이상의 로봇을 제어하기 위한 관제 시스템을 구성하는 서버일 수 있다. 그리고, 인공 지능 서버는 적어도 하나 이상의 로봇을 제어할 수 있다. 도 5를 참조하면, 인공 지능 서버의 프로세서는 관제 구역에 포함된 복수의 로봇들 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신한다(S501). 관제 구역은 인공 지능 서버가 로봇들 이용하여 안내 서비스를 제공하는 구역 전체를 의미할 수 있으며, 전체 구역이라 칭할 수도 있다. 즉, 인공 지능 서버는 로봇의 동작, 동선, 배치 구역 등을 관제 구역 이내 에서 결정할 수 있다. 즉, 관제 구역은 로봇의 최대 활동 범위를 의미할 수 있다. 관제 구역은 복수의 단위 구역들을 포함할 수 있으며, 각 단위 구역들은 미리 정해진 모양 및 크기로 설정될 수 있다. 이때, 각 단위 구역은 직사각형 또는 정사각형의 형태를 가질 수 있으나, 본 발명이 이에 한정되지 않는다. 이때, 각 단위 구역의 면적은 서로 동일할 수도 있으나, 본 발명이 이에 한정되지 않는다. 인공 지능 서버의 메모리는 복수의 단위 구역들 각각의 위치를 나타내는 위치 정보를 저장하고 있을 수 있다. 위치 정보는 단위 구역의 좌표일 수 있다. 로봇에 상응하는 배치 구역은 해당 로봇이 동작을 수행하는 범위를 의미할 수 있다. 즉, 각 로봇들은 자신의 배 치 구역 내에서 이동하며 사용자들에게 서비스를 제공할 수 있다. 배치 구역은 적어도 하나 이상의 단위 구역들로 구성될 수 있다. 이때, 프로세서는 메모리에 복수의 로봇들 각각에 대한 동선 및 배치 구역에 대한 정보가 저장된 경 우라면, 메모리로부터 저장된 동선 및 배치 구역에 대한 정보를 수신할 수 있다. 이때, 프로세서는 메모리에 복수의 로봇들 각각에 대한 동선 및 배치 구역에 대한 정보가 저장되어있 지 않은 경우라면, 통신부를 통해 각 로봇들로부터 동선 및 배치 구역에 대한 정보를 수신할 수 있다.그리고, 인공 지능 서버의 프로세서는 제1 로봇에 상응하는 제1 동작이 제1 로봇에 상응하는 제1 배 치 구역 밖으로 이동하는 동작을 포함하는 경우, 제1 동작에 상응하는 제1 경로를 결정한다(S503). 여기서, 제1 로봇은 자신에게 설정된 배치 구역(제1 배치 구역)을 벗어나는 동작(제1 동작)을 갖는 로봇을 의미 할 수 있다. 제1 동작은 제1 로봇에 상응하는 동작을 지칭하며, 제1 로봇에 상응하는 동작이 다른 동작으로 바뀌더라도 제1 동작이라 칭할 수 있다. 마찬가지로, 제1 배치 구역은 제1 로봇에 상응하는 배치 구역을 지칭하며, 제1 로봇에 상응하는 배치 구역이 다른 구역으로 바뀌더라도, 제1 배치 구역이라 칭할 수 있다. 이때, 프로세서는 로봇들로부터 획득한 정보에 제1 동작에 대한 제1 경로 정보가 포함된 경우에는, 획득한 정보에서 제1 경로 정보를 추출함으로써 제1 경로를 결정할 수 있다. 이때, 프로세서는 로봇들로부터 획득한 정보에 제1 동작에 대한 제1 경로 정보가 포함되지 않은 경우, 제1 동작에 상응하는 제1 경로를 결정할 수 있다. 제1 동작이 제1 배치 구역 밖으로 이동하는 동작을 포함하기 때문에, 결정된 제1 경로에는 제1 배치 구역 밖으 로 이동하는 경로가 포함되어 있다. 그리고, 인공 지능 서버의 프로세서는 결정된 제1 경로상에 존재하고 적어도 하나 이상의 로봇이 배 치된 구역을 결정한다(S505). 여기서, 결정된 구역은 제1 로봇에 상응하는 제1 배치 구역과 동일하지 않은 구역을 의미할 수 있다. 이때, 결정된 구역은 제1 배치 구역과 겹치지 않는 구역을 의미할 수 있다. 이때, 결정된 구역은 제1 배치 구역과 인접한 구역을 의미할 수 있다. 여기서, 두 구역이 인접하다는 것은 두 구역의 경계선들이 적어도 일부가 접하거나 만난다는 것을 의미할 수 있다. 그리고, 인공 지능 서버의 프로세서는 결정된 구역에 배치된 제2 로봇과 제1 로봇 사이의 연계 동작 을 결정한다(S507). 제2 로봇은 결정된 구역에 배치된 적어도 하나 이상의 로봇들 중의 하나를 의미할 수 있다. 이때, 제2 로봇은 동작을 수행하지 않는 유휴 로봇일 수 있다. 이때, 제2 로봇에 상응하는 제2 배치 구역은 제2 배치 구역과 인접할 수 있다. 제2 동작은 제2 로봇에 상응하는 동작을 지칭하며, 제2 로봇에 상응하는 동작이 다른 동작으로 바뀌더라도 제2 동작이라 칭할 수 있다. 마찬가지로, 제2 배치 구역은 제2 로봇에 상응하는 배치 구역을 지칭하며, 제2 로봇에 상응하는 배치 구역이 다른 구역으로 바뀌더라도, 제2 배치 구역이라 칭할 수 있다. 연계 동작은 제1 로봇과 제2 로봇이 서로 연계하는 동작을 의미한다. 이때, 연계 동작은 두 로봇들 사이의 동작을 인계하는 제1 연계 동작 또는 두 로봇 사이의 배치 구역을 스위칭 하는 제2 연계 동작을 포함할 수 있다. 제1 연계 동작은 제2 로봇에 상응하는 제2 동작을, 제2 로봇을 제1 로봇으로 이동시키고, 제2 로봇이 제1 로봇 과 만나면 제1 동작을 이어 받는 동작을 의미할 수 있다. 이때, 제1 연계 동작에 따르면, 제2 로봇은 제1 로봇과 만나서 제1 로봇의 동작을 이어 받고, 제1 로봇은 제2 로봇에 동작을 인계하고 유휴 상태로 전환될 수 있다. 이때, 제1 연계 동작에 따르면, 제2 로봇은 제1 로봇과 만나서 제1 로봇의 동작을 이어 받고, 제1 로봇은 제1 배치 구역으로 복귀할 수 있다. 제1 배치 구역으로의 복귀는 제1 배치 구역의 미리 설정된 지점으로의 이동 또 는 제1 배치 구역 내에서 미리 설정된 경로에 따라 이동 또는 무작위로 이동하며, 사용자와의 상호작용을 대기 하는 상태를 의미할 수 있다. 이때, 제1 연계 동작에 따르면, 제1 로봇과 제2 로봇은 제1 로봇에 상응하는 제1 배치 구역과 제2 로봇에 상응 하는 제2 배치 구역 사이의 경계선에서 만나고, 해당 경계선에서 서로의 동작을 인계할 수 있다. 또한, 제1 연계 동작에 따르면, 제2 로봇은 제1 로봇에 상응하는 제1 동작을 인계 받으며, 인공 지능 서버(20 0)의 프로세서는 제2 로봇이 인계 받은 동작에 기초하여 제2 로봇에 상응하는 제2 동작이 제2 배치 구역을벗어나는지 여부를 판단할 수 있다. 만약, 제2 로봇에 상응하는 제2 동작(인계 이후의 제2 동작)이 제2 배치 구 역을 벗어나는 동작을 포함한다면, 프로세서는 연계 동작을 결정하는 단계들 등(S503 내지 S509)을 수행할 수 있다. 제2 연계 동작은 제2 로봇에 상응하는 제2 배치 구역과 제1 로봇에 상응하는 제1 배치 구역을 서로 바꾸는 동작 을 의미할 수 있다. 즉, 제2 연계 동작에 따르면, 제2 로봇은 제1 로봇에 상응하는 배치 구역(제1 배치 구역)으로 재배치되고, 제1 로봇은 제2 로봇에 상응하는 배치 구역(제2 배치 구역)으로 재배치된다. 이에 따라, 제1 로봇이 제1 동작에 따 라 제1 배치 구역을 벗어나게 되더라도, 제2 로봇이 제1 로봇에 상응하는 제1 배치 구역으로 재배치됨으로써, 제1 배치 구역에 배치된 로봇들의 숫자가 유지될 수 있다. 또한, 제2 연계 동작에 따르면, 제1 로봇은 제2 로봇에 상응하는 배치 구역(제2 배치 구역)으로 재배치되며, 인 공 지능 서버의 프로세서는 재배치된 배치 구역에 기초하여 제1 로봇에 상응하는 제1 동작이 재배치 된 배치 구역(제2 배치 구역)을 벗어나는지 여부를 다시 판단할 수 있다. 만약, 제1 로봇에 상응하는 제1 동작 이 재배치된 배치 구역을 벗어나는 동작을 포함한다면, 프로세서는 연계 동작을 결정하는 단계들 등(S503 내지 S509)을 수행할 수 있다. 프로세서는 제1 로봇에 상응하는 제1 배치 구역의 밀집도를 산출하고, 산출한 밀집도에 기초하여 연계 동 작을 결정할 수 있다. 이때, 프로세서는 제1 배치 구역에 대하여 산출된 밀집도가 제1 기준 값을 초과하는 경우에는 연계 동작을 제1 연계 동작으로 결정할 수 있고, 제1 배치 구역에 대하여 산출된 밀집도가 제1 기준 값을 초과하지 않는 경 우에는 연계 동작을 제2 연계 동작으로 결정할 수 있다. 이는, 제1 배치 구역의 밀집도가 높은 경우에는, 제1 로봇이 자신의 배치 구역(제1 배치 구역)을 벗어나지 않는 것이 제1 구역에 위치하는 다른 사용자들에게 빠르게 서비스를 제공할 수 있기 때문이다. 또는, 프로세서는 제1 배치 구역에 대하여 산출된 밀집도를 제1 배치 구역에 배치된 로봇들의 숫자로 나누 고, 이 나눈 값이 제2 기준 값을 초과하는지 여부에 기초하여 연계 동작을 결정할 수도 있다. 이는, 제1 배치 구역의 밀집도가 높다고 하더라도, 제1 배치 구역에 배치된 로봇마다 분담되는 밀집도가 낮다면, 제1 로봇이 자신의 배치 구역(제1 배치 구역)을 벗어나더라도 사용자들에게 빠르게 서비스를 제공할 수 있기 때문이다. 또는, 프로세서는 제1 로봇이 자신의 배치 구역(제1 배치 구역)을 벗어나더라도 제2 로봇이 그 빈 공백을 메우는데 걸리는 시간을 산출하고, 산출된 시간이 제3 기준 값을 초과하는지 여부에 기초하여 연계 동작을 결정 할 수도 있다. 이는, 제1 로봇이 제1 배치 구역을 떠나더라도 제2 로봇이 제1 배치 구역으로 재배치되는데 오래 걸리지 않는 경우라면, 제1 로봇이 자신의 배치 구역(제1 배치 구역)을 벗어나더라도 사용자들에게 빠르게 서비스를 제공할 수 있기 때문이다. 프로세서는 관제 구역에 대한 이미지 데이터 음성 데이터를 수집하고, 수집한 데이터를 이용하여 관제 구 역에 포함된 단위 구역마다 밀집도를 산출할 수 있다. 그리고, 단위 구역별로 산출된 밀집도에 기초하여 제1 배 치 구역의 밀집도를 산출할 수 있다. 이때, 프로세서는 관제 구역에 배치된 로봇들 또는 관제 구역을 비추는 카메라로부터 관제 구역에 대하여 촬영된 이미지 데이터를 수신할 수 있고, 관제 구역에 배치된 로봇들 또는 관제 구역에 설치된 마이크로폰으로 부터 관제 구역에 대하여 수집된 사용자들이 발화한 음성 데이터를 수신할 수 있다. 로봇들에는 카메라 또는 마이크로폰이 포함될 수 있으며, 관제 구역을 비추는 카메라는 폐쇄회로 텔레비전 (CCTV: Closed-Circuit Television)을 포함할 수 있다. 프로세서는 수신한 이미지 데이터 또는 음성 데이터 중에서 적어도 하나 이상을 이용하여 각 단위 구역에 포함된 사용자의 수를 산출하고, 산출한 사용자의 숫자를 각 단위 구역의 밀집도로 결정할 수 있다. 그리고, 프 로세서는 산출된 각 단위 구역들의 밀집도에 기초하여 제1 배치 구역의 밀집도를 산출할 수 있다. 이때, 프로세서는 수신한 이미지 데이터에 포함된 사용자들의 얼굴을 추출하고, 추출된 얼굴의 수에 기초 하여 각 단위 구역에 포함된 사용자들의 숫자를 결정할 수 있다. 이때, 프로세서는 영상 인식 모델을 이용하여, 이미지 데이터로부터 사용자들의 얼굴을 추출할 수 있다. 영상 인식 모델은 딥 러닝 알고리즘 또는 머신 러닝 알고리즘을 이용하여 학습된, 인공 신경망 기반의 모델일 수 있다. 이때, 프로세서는 수신한 음성 데이터를 이용하여 각 단위 구역에 포함된 사용자들의 숫자를 결정할 수 있 다. 예컨대, 수신한 음성 데이터가 존재하는 경우, 프로세서는 수신한 음성 데이터에서 복수의 주파수 대역들 을 추출하고, 추출된 복수의 주파수 대역의 수에 기초하여 각 단위 구역에 포함된 사용자들의 숫자를 결정할 수 있다. 이때, 프로세서는 수신한 음성 데이터의 소리 크기에 기초하여 각 단위 구역에 포함된 사용자들의 숫자를 결정할 수 있다. 그리고, 인공 지능 서버의 프로세서는 결정된 연계 동작에 기초하여 제2 로봇에 상응하는 제2 동작 또는 제2 로봇에 상응하는 제2 배치 구역을 갱신한다(S509). 상술한 바와 같이, 상기 결정된 연계 동작이 제1 연계 동작인 경우, 프로세서는 제2 로봇에 상응하는 제2 동작을, 제2 로봇을 제1 로봇으로 이동시키고, 제2 로봇과 제1 로봇이 만나면 제1 로봇에 상응하는 제1 동작을 이어 받는 것으로 결정할 수 있다. 상술한 바와 같이, 상기 결정된 연계 동작이 제2 연계 동작인 경우, 프로세서는 제1 로봇에 상응하는 제1 배치 구역과 제2 로봇에 상응하는 제2 배치 구역을 서로 교환할 수 있다. 도 5는 제2 로봇에 상응하는 동작 또는 배치 구역을 갱신하는 과정을 1번의 사이클(cycle)로만 나타낸 것으로, 도 5에 도시된 단계들(S501 내지 S509)는 반복적으로 수행될 수 있다. 즉, 도 5에 도시된 단계들(S501 내지 S509)은 관제 구역에 포함된 복수의 로봇들의 동작이나 배치 구역이 변경될 때마다 반복적으로 수행될 수 있다. 예컨대, 단계(S509)에 따라 제2 로봇에 상응하는 제2 동작 또는 제2 로봇에 상응하는 제2 배치 구역이 갱신된 경우, 인공 지능 서버는 다시 도 5에 도시된 단계들(S501 내지 S509)를 수행할 수 있다. 도 6은 본 발명의 실시 예에 각 따른 단위 구역별로 측정된 밀집도를 나타낸 도면이다. 도 6을 참조하면, 전체 구역은 복수의 단위 구역들을 포함할 수 있다. 도 6에서는 전체 구역이 5x5의 형태로 배치된 25개의 단위 구역들들로 구성되어 있으나, 본 발명이 이에 한정되지 않는다. 각 단위 구역에는 단위 구역별로 측정된 밀집도가 대응된다. 예컨대, 전체 구역의 첫 번째 행을 구성하는 단위 구역들은 측정된 밀집도가 [1, 3, 0, 2, 5]이다. 메모리는 각 단위 구역의 위치를 나타내는 위치 정보를 저장하고 있을 수 있다. 여기서, 각 단위 구 역의 위치 정보는 각 단위 구역의 중심 좌표일 수 있다. 프로세서는 GPS 모듈 등과 같은 위치 측정 모듈을 이용하여, 각 단위 구역의 위치 정보를 획득할 수 있다. 도 7 내지 9는 본 발명의 일 실시 예에 따른 그룹 구역의 밀집도를 산출하는 방법을 나타낸 도면이다. 도 7 내지 9는 도 6에 도시된 전체 구역의 예시를 이용하여 복수의 단위 그룹들로 구성된 그룹 구역 들의 밀집도를 산출하는 방법을 나타낸다. 도 7을 참조하면, 5x5 형태의 전체 구역은 4개의 4x4 형태의 그룹 구역들(710, 730, 750 및 770)로 구분 될 수 있다. 각 그룹 구역들(710 내지 770)은 4x4 형태로, 16개의 단위 구역들을 포함할 수 있다. 메모리는 각 그룹 구역의 위치를 나타내는 위치 정보가 저장하고 있을 수 있다. 여기서, 각 그룹 구역의 위치 정보는 각 그룹 구역의 중심 좌표일 수 있다. 프로세서는 각 그룹 구역에 포함된 단위 구역들의 밀집도의 평균을 계산하고, 그 평균 값을 해당 그룹 구 역의 밀집도로 결정할 수 있다. 제1 그룹 구역의 밀집도는 제1 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도 들의 평균 값일 수 있다. 즉, 제1 그룹 구역의 밀집도는 (1+3+0+2+4+3+2+1+0+8+2+1+5+3+2+5)/16 = 2.625 로 산출될 수 있다. 제2 그룹 구역의 밀집도는 제2 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도 들의 평균 값일 수 있다. 즉, 제2 그룹 구역의 밀집도는 3.375로 산출될 수 있다. 제3 그룹 구역의 밀집도는 제3 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도 들의 평균 값일 수 있다. 즉, 제3 그룹 구역의 밀집도는 2.813으로 산출될 수 있다. 제4 그룹 구역의 밀집도는 제4 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도 들의 평균 값일 수 있다. 즉, 제4 그룹 구역의 밀집도는 3.250으로 산출될 수 있다. 산출된 제1 내지 제4 그룹 구역들(710 내지 770)의 밀집도는, 프로세서가 전체 구역 내에서 로봇을 우선적으로 이동시켜야 하는 영역이나 로봇의 동선을 결정할 때 이용될 수 있다. 또한, 산출된 제1 내지 제4 그룹 구역들(710 내지 770)의 밀집도는, 프로세서가 각 그룹 구역들(710 내지 770) 사이의 우선 순위를 결정할 때 이용될 수 있다. 여기서, 우선 순위는 로봇이 이동해야 하는 목적지로써의 우선 순위를 의미할 수 있다. 예컨대, 산출된 밀집도가 클수록 해당 그룹 구역에 높은 우선 순위가 부여될 수 있다. 즉, 전체 구역 내에서는, 제2 그룹 구역이 제1 순위, 제4 그룹 구역이 제2 순위, 제3 그룹 구역 이 제3 순위, 제1 그룹 구역이 제4 순위로 결정될 수 있다. 나아가, 도 8을 참조하면, 4x4 형태의 제2 그룹 구역은 4개의 3x3 형태의 하위 그룹 구역들(810, 830, 850 및 870)로 구분될 수 있다. 도 8에서는 제2 그룹 구역을 하위 그룹 구역들로 구분하는 예시만을 도시하였으나, 제2 그룹 구역뿐 만 아니라, 다른 제1, 제3 및 제4 그룹 구역(710, 750 및 770) 각각에 대하여도 마찬가지로 4개의 3x3 형태의 하위 그룹 구역들로 구분할 수 있다. 각 하위 그룹 구역들(810 내지 870)은 3x3 형태로, 9개의 단위 구역들을 포함할 수 있다. 메모리는 각 하위 그룹 구역의 위치 정보를 저장하고 있을 수 있다. 여기서, 각 하위 그룹 구역의 위치 정 보는 각 하위 그룹 구역의 중심 좌표일 수 있다. 프로세서는 제2 그룹 구역 내에서도, 보다 밀집한 구역을 확인하기 위해, 제2 그룹 구역을 구성 하는 복수의 하위 그룹 구역들(810 내지 870) 각각의 밀집도를 산출할 수 있다. 프로세서는 각 하위 그룹 구역에 포함된 단위 구역들의 밀집도의 평균을 계산하고, 그 평균 값을 해당 하 위 그룹 구역의 밀집도로 결정할 수 있다. 제1 하위 그룹 구역의 밀집도는 제1 하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측 정된 밀집도들의 평균 값일 수 있다. 즉, 제1 하위 그룹 구역의 밀집도는 (3+0+2+3+2+1+8+2+1)/9=2.444로 산출될 수 있다. 제2 하위 그룹 구역의 밀집도는 제2 하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측 정된 밀집도들의 평균 값일 수 있다. 즉, 제2 하위 그룹 구역의 밀집도는 3.111로 산출될 수 있다. 제3 하위 그룹 구역의 밀집도는 제3 하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측 정된 밀집도들의 평균 값일 수 있다. 즉, 제3 하위 그룹 구역의 밀집도는 3.0으로 산출될 수 있다. 제4 하위 그룹 구역의 밀집도는 제4 하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측 정된 밀집도들의 평균 값일 수 있다. 즉, 제4 하위 단위 그룹 구역의 밀집도는 3.333으로 산출될 수 있다. 산출된 제1 내지 제4 하위 그룹 구역들(810 내지 870)의 밀집도는, 프로세서가 제2 그룹 구역 내에서 로봇을 우선적으로 이동시켜야 하는 영역이나 로봇의 동선을 결정할 때 이용될 수 있다. 또한, 산출된 제1 내지 제4 하위 그룹 구역들(810 내지 870)의 밀집도는, 프로세서가 각 하위 그룹 구역들 (810 내지 870) 사이의 우선 순위를 결정할 때 이용될 수 있다. 여기서, 우선 순위는 로봇이 이동해야 하는 목 적지로써의 우선 순위를 의미할 수 있다. 예컨대, 산출된 밀집도가 클수록 해당 하위 그룹 구역에 높은 우선 순위가 부여될 수 있다. 즉, 제2 그룹 구역 내에서는, 제4 하위 그룹 구역이 제1 순위, 제2 하위 그룹 구역이 제2 순위, 제3 하위 그룹 구역이 제3 순위, 제1 하위 그룹 구역이 제4 순위로 결정될 수 있다. 나아가, 도 9를 참조하면, 3x3 형태의 제4 하위 그룹 구역은 4개의 2x2 형태의 최하위 그룹 구역들(910, 930, 950 및 970))로 구분될 수 있다. 도 9에서는 제4 하위 그룹 구역을 최하위 그룹 구역들로 구분하는 예시만을 도시하였으나, 제4 하위 그룹 구역뿐만 아니라, 다른 제1 내지 제3 하위 그룹 구역(810, 830 및 850) 각각에 대하여도 마찬가지로 4개의 2x2 형태의 최하위 그룹 구역들로 구분할 수 있다. 각 최하위 그룹 구역들(910 내지 970)은 2x2 형태로, 4개의 단위 구역들을 포함할 수 있다. 메모리는 각 최하위 그룹 구역의 위치 정보를 저장하고 있을 수 있다. 각 최하위 그룹 구역의 위치 정보는 각 최하위 그룹 구역의 중심 좌표일 수 있다. 프로세서는 제4 하위 그룹 구역 내에서도, 보다 밀집한 구역을 확인하기 위해, 제4 하위 그룹 구역 을 구성하는 복수의 최하의 그룹 구역들(910 내지 970) 각각의 밀집도를 산출할 수 있다. 프로세서는 각 최하위 그룹 구역에 포함된 단위 구역들의 밀집도의 평균을 계산하고, 그 평균 값을 해당 최하위 그룹 구역의 밀집도로 결정할 수 있다. 제1 최하위 그룹 구역의 밀집도는 제1 최하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도들의 평균 값일 수 있다. 즉, 제1 최하위 그룹 구역의 밀집도는 (2+1+2+5)/4=2.5로 산출될 수 있다. 제2 최하위 그룹 구역의 밀집도는 제2 최하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도들의 평균 값일 수 있다. 즉, 제2 최하위 그룹 구역의 밀집도는 3.75로 산출될 수 있다. 제3 최하위 그룹 구역의 밀집도는 제3 최하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도들의 평균 값일 수 있다. 즉, 제3 최하위 그룹 구역의 밀집도는 1.5로 산출될 수 있다. 제4 최하위 그룹 구역의 밀집도는 제4 최하위 그룹 구역에 포함된 복수의 단위 구역들 각각에 대하여 측정된 밀집도들의 평균 값일 수 있다. 제4 최하위 그룹 구역의 밀집도는 4.25로 산출될 수 있다. 산출된 제1 내지 제4 최하위 그룹 구역들(910 내지 970)의 밀집도는, 프로세서가 제4 하위 그룹 구역 내에서 로봇을 우선적으로 이동시켜야 하는 영역이나 로봇의 동선을 결정할 때 이용될 수 있다. 또한, 산출된 제1 내지 제4 최하위 그룹 구역들(910 내지 970)의 밀집도는, 프로세서가 각 최하위 그룹 구 역들(910 내지 970) 사이의 우선 순위를 결정할 때 이용될 수 있다. 여기서, 우선 순위는 로봇이 이동해야 하는 목적지로써의 우선 순위를 의미할 수 있다. 예컨대, 산출된 밀집도가 클수록 해당 최하위 그룹 구역에 높은 우선 순위가 부여될 수 있다. 즉, 제4 하위 그룹 구역 내에서는, 제4 최하위 그룹 구역이 제1 순위, 제2 최하위 그룹 구역이 제2 순위, 제1 최하위 그룹 구역이 제3 순위, 제3 최하위 그룹 구역이 제4 순위로 결정될 수 있다. 이와 같이, 전체 구역에서 사용자들이 밀집한 구역을 세분화하여, 사용자들에게 안내가 필요한 상황에 대 해 효과적으로 대응할 수 있는 로봇들의 동선을 결정할 수 있다.이에 따라, 로봇들이 사용자들이 밀집한 구역으로 이동하고, 사용자들이 원하는 안내 서비스를 제공할 수 있다. 도 10은 본 발명의 일 실시 예에 따른 밀집도가 동일한 그룹 구역들 사이의 우선 순위를 결정하는 방법을 나타 낸다. 도 10을 참조하면, 전체 구역에 포함된 3x3 형태의 제5 그룹 구역과 제6 최하위 그룹 구역은 각각 산출된 밀집도가 3.000으로 동일하다. 이와 같이, 그룹 구역들 사이에 산출된 밀집도가 동일한 경우에, 프로세서는 각 그룹 구역들에 대하여 하 위 밀집도 평균을 계산하고, 계산된 하위 밀집도 평균을 비교하여 우선 순위를 결정할 수 있다. 여기서, 하위 밀집도 평균은 그룹 구역에 포함되는 바로 하위의 그룹 구역들에 대하여 산출된 밀집도들의 평균 을 의미한다. 그리고, 바로 하위의 그룹 구역이라 함은 크기가 한 단위 작은 그룹 구역들을 의미할 수 있다. 예컨대, 4x4 형태의 그룹 구역에 대한 하위 밀집도를 산출할 때, 프로세서는 해당 그룹 구역에 포함된 4개 의 3x3 형태의 하위 그룹 구역들 각각에 대하여 밀집도를 산출하고, 산출된 밀집도들에 대하여 평균을 계산함으 로써 하위 밀집도 평균을 계산할 수 있다. 도 10의 예시에서, 프로세서는 제5 그룹 구역 및 제6 그룹 구역 간의 우선 순위를 결정하기 위해, 제5 그룹 구역과 제6 그룹 구역 각각에 대하여 하위 밀집도 평균을 계산할 수 있다. 즉, 프로세서는 제5 그룹 구역에 포함된 하위 그룹 구역들의 밀집도들의 평균(2.2875)과 제6 그룹 구역에 포함된 하위 그룹 구역들의 밀집도들의 평균(3.438)을 비교할 수 있다. 프로세서는 제6 그룹 구역의 하위 밀집도 평균(3.438)이 제5 그룹 구역의 하위 밀집도 평균 (2.2875)보다 더 크므로, 제5 그룹 구역보다 제6 그룹 구역에 더 높은 우선 순위를 부여할 수 있다. 또는, 프로세서는 최하위 그룹 구역이 아닌 그룹 구역들 사이에 밀집도가 동일한 상황에서, 후술하는 도 11의 방법과 같이, 인접한 단위 영역들의 밀집도를 이용하여 그룹 구역들 사이의 우선 순위를 결정할 수 있다. 도 11은 본 발명의 일 실시 예에 따른 밀집도가 동일한 그룹 구역들 사이의 우선 순위를 결정하는 방법을 나타 낸다. 도 11은 그룹 구역들 사이의 우선 순위를 결정하는 방법을 나타내며, 도 10에서 설명한 하위 밀집도 평균을 계 산하는 방법을 적용할 수 없는 최하위 그룹 구역들 사이의 우선 순위를 결정할 때 적용할 수 있다. 물론, 도 11 의 우선 순위를 결정하는 방법은 최하위 그룹 구역이 아닌 그룹 구역들 사이의 우선 순위를 결정할 때에도 적용 할 수 있다. 도 11을 참조하면, 전체 구역에 포함된 2x2 형태의 제7 그룹 구역과 제8 그룹 구역은 각각 산 출된 밀집도가 4.000으로 동일하다. 이와 같이, 그룹 구역들 사이에 산출된 밀집도가 동일한 경우에, 프로세서는 각 그룹 구역들에 대하여 인 접 밀집도 평균을 계산하고, 계산된 인접 밀집도 평균을 비교하여 우선 순위를 결정할 수 있다. 여기서, 인접 밀집도 평균은 그룹 구역에 인접한 단위 구역들에 대하여 산출된 밀집도들의 평균을 의미한다. 이때, 그룹 구역에 인접한 단위 구역들은 해당 그룹 구역으로부터 인접한 상하좌우 및 대각 위치의 인접 단위 구역들을 의미할 수도 있고, 또는 해당 그룹 구역으로부터 인접한 상하좌우 위치의 인접 단위 구역들만을 의미 할 수도 있다. 도 11의 예시에서, 프로세서는 제7 그룹 구역 및 제8 그룹 구역 간의 우선 순위를 결정하기 위해, 제7 그룹 구역과 제8 그룹 구역 각각에 대하여 인접 밀집도 평균을 계산할 수 있다. 일 실시 예에서, 제7 그룹 구역의 인접 밀집도 평균은 제7 그룹 구역의 상하좌우로 인접한 단위 구 역들의 밀집도의 평균인 (0+2+1+7)/4=2.5로 산출될 수 있다. 그리고, 제8 그룹 구역의 인접 밀집도 평균 은 제8 그룹 구역의 상하좌우로 인접한 단위 구역들의 밀집도의 평균인 (4+3+2+2+2+4)/6=2.833으로 산출될 수 있다. 즉, 프로세서는 제7 그룹 구역와 인접한 단위 구역들의 밀집도들의 평균(2.5)과 제8 그룹 구역 와 인접한 단위 구역들의 밀집도들의 평균(2.833)을 비교할 수 있다. 프로세서는 제8 그룹 구역의 인접 밀집도 평균(2.833)이 제7 그룹 구역의 인접 밀집도 평균 (2.5)보다 더 크므로, 제7 그룹 구역보다 제8 그룹 구역에 더 높은 우선 순위를 부여할 수 있다. 도 12는 특정 로봇의 동작이 자신의 배치 구역을 벗어나는 동작을 포함하는 상황을 나타낸 도면이다. 도 12를 참조하면, 관제 구역은 복수의 구역들(1211, 1212 및 1213)로 구분될 수 있다. 제1 구역에는 제1 로봇이 배치되어 있고, 제2 구역에는 제2 로봇이 배치되어 있고, 제 3 구역에는 제3 로봇이 배치되어 있다. 즉, 제1 로봇에 상응하는 제1 배치 구역은 제1 구역이고, 제2 로봇에 상응하는 제2 배치 구 역은 제2 구역이고, 제3 로봇에 상응하는 제3 배치 구역은 제3 구역이다. 제1 로봇은 제1 구역 내에서 정지하거나 이동하며 사용자들에게 다양한 서비스를 제공할 수 있다. 마찬가지로, 제2 로봇은 제2 구역 내에서 정지하거나 이동하며 사용자들에게 다양한 서비스를 제공 할 수 있고, 제3 로봇은 제3 구역 내에서 정지하거나 이동하며 사용자들에게 다양한 서비스를 제공 할 수 있다. 만약, 특정 사용자이 제1 로봇에게 \"목적지까지 데려 줘.\" 와 같이 발화한 경우, 제1 로봇에 상응하는 제1 동작은 사용자와 함께 목적지까지 이동하는 동작으로 결정될 수 있다. 이에 따라, 제1 동작에 상응하는 제1 경로는 제1 구역에서 출발하여 제2 구역을 지나쳐 제3 구역에 포함된 목적지로 이동하는 경로로 결정될 수 있다. 만약, 제1 로봇이 제1 동작에 따라 목적지로 이동하게 될 경우, 제1 로봇이 배치되어 있던 제1 배치 구역에는 배치되는 로봇이 1개만큼 줄어들게 된다. 특히 도 12와 같은 상황이라면, 제1 배치 구역에는 배치된 로봇이 없게 되어, 사용자들에게 서비스를 제 공하지 못하는 공백 기간이 발생하는 문제가 발생할 수 있다. 도 13은 도 12의 상황에서, 본 발명의 일 실시 예에 따른 제1 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 13을 참조하면, 인공 지능 서버의 프로세서는, 제1 연계 동작에 따라, 제2 로봇에 상응하는 제2 동작을, 제1 로봇으로 이동하고, 제2 로봇이 제1 로봇과 만나면 제1 로봇에 상응 하는 제1 동작을 이어 받도록 결정할 수 있다. 제1 로봇과 제2 로봇는 각자 배치된 제1 구역과 제2 구역의 경계 지점에서 만 날 수 있고, 이를 위해 프로세서는 제1 로봇의 제1 동선을 경계 지점으로 이동하는 동선 으로 결정하고, 제2 로봇의 제2 동선을 경계 지점으로 이동하는 동선으로 결정할 수 있다. 그리고, 프로세서는 제2 로봇이 경계 지점에서 제1 로봇과 만나게 되면, 제2 로봇 의 제2 동작을 제1 로봇의 제1 동작을 이어 받아, 사용자와 함께 목적지로 이동하는 동작으로 갱신할 수 있다. 이에 따라, 제1 로봇은 자신이 배치된 제1 구역을 벗어나지 않으면서 제2 로봇에 자신의 동 작을 인계할 수 있고, 그에 따라 제1 로봇은 제1 구역에 대하여 공백 없이 서비스를 제공할 수 있 다. 도 13에는 도시되지 않았으나, 만약 제1 구역에 군중이 밀집한 구역이 있다면, 제1 로봇이 제2 로 봇에게 동작을 인계한 이후, 프로세서는 제1 로봇의 제1 동작을 제1 구역 내에서 군중 이 밀집한 구역으로 이동하는 동작으로 결정할 수 있다.도 13에 따르면, 제2 로봇은 제1 로봇의 동작을 이어 받아, 사용자와 함께 제3 구역에 위치한 목적지로 이동할 수 있다. 그리고, 제2 로봇에 상응하는 제2 동작에 자신의 배치 구역인 제 2 구역을 벗어나는 동작이 포함되어 있으므로, 도 14 또는 도 15와 같이, 인공 지능 서버의 프로세 서는 제2 로봇과 제3 로봇 사이의 연계 동작을 결정하여, 로봇들을 관제할 수 있다. 이 경우, 제2 로봇과 제3 로봇 사이의 연계 동작은 제1 연계 동작에 한정되지 않는다. 도 14는 도 13의 상황에서, 본 발명의 일 실시 예에 따른 제1 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 14를 참조하면, 인공 지능 서버의 프로세서는, 제1 연계 동작에 따라, 제3 로봇에 상응하는 제3 동작을, 제2 로봇으로 이동하고, 제3 로봇이 제2 로봇과 만나면 제2 로봇에 상응 하는 제2 동작을 이어 받도록 결정할 수 있다. 제2 로봇과 제3 로봇는 각자 배치된 제2 구역과 제3 구역의 경계 지점에서 만 날 수 있고, 이를 위해 프로세서는 제2 로봇의 제2 동선을 경계 지점으로 이동하는 동선 으로 결정하고, 제3 로봇의 제3 동선을 경계 지점으로 이동하는 동선으로 결정할 수 있다. 그리고, 프로세서는 제3 로봇이 경계 지점에서 제2 로봇과 만나게 되면, 제3 로봇 의 제3 동작을 제2 로봇의 제2 동작을 이어 받아, 사용자와 함께 목적지로 이동하는 동작으로 갱신할 수 있다. 이에 따라, 제2 로봇은 자신이 배치된 제2 구역을 벗어나지 않으면서 제3 로봇에 자신의 동 작을 인계할 수 있고, 그에 따라 제2 로봇은 제2 구역에 대하여 공백 없이 서비스를 제공할 수 있 다. 도 14에는 도시되지 않았으나, 만약 제2 구역에 군중이 밀집한 구역이 있다면, 제2 로봇이 제3 로 봇에게 동작을 인계한 이후, 프로세서는 제2 로봇의 제2 동작을 제2 구역 내에서 군중 이 밀집한 구역으로 이동하는 동작으로 결정할 수 있다. 도 15는 도 13의 상황에서, 본 발명의 일 실시 예에 따른 제2 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 15를 참조하면, 인공 지능 서버의 프로세서는, 제2 연계 동작에 따라, 제2 로봇에 상응하는 제2 배치 구역과 제3 로봇에 상응하는 제3 배치 구역 서로 바꿀 수 있다. 즉, 프로세서은 제2 로봇에 상응하는 제2 배치 구역을 제3 구역으로 설정하고, 제3 로봇 에 상응하는 제3 배치 구역을 제2 구역으로 설정할 수 있다. 그리고, 프로세서는 제2 로봇에 상응하는 제2 동선을 제3 구역으로 이동하는 동선 및 제3 구역에서 목적지로 이동하는 동선으로 결정하고, 제3 로봇에 상응하는 제3 동선을 제2 구역으로 이동하는 동선으로 결정할 수 있다. 이에 따라, 제3 로봇은 제2 로봇이 제2 구역을 벗어나더라도 그 공백을 메워줌으로써, 제3 로봇이 제2 구역에 대하여 공백을 최소화하며 서비스를 제공할 수 있다. 도 16은 도 12의 상황에서, 본 발명의 일 실시 예에 따른 제2 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 16을 참조하면, 인공 지능 서버의 프로세서는, 제2 연계 동작에 따라, 제1 로봇에 상응하는 제1 배치 구역과 제2 로봇에 상응하는 제2 배치 구역 서로 바꿀 수 있다. 즉, 프로세서은 제1 로봇에 상응하는 제1 배치 구역을 제2 구역으로 설정하고, 제2 로봇 에 상응하는 제2 배치 구역을 제1 구역으로 설정할 수 있다.그리고, 프로세서는 제1 로봇에 상응하는 제1 동선을 제2 구역으로 이동하는 동선 및 제2 구역에서 목적지로 이동하는 동선으로 결정하고, 제2 로봇에 상응하는 제2 동선을 제1 구역으로 이동하는 동선으로 결정할 수 있다. 이에 따라, 제2 로봇은 제1 로봇이 제1 구역을 벗어나더라도 그 공백을 메워줌으로써, 제2 로봇이 제1 구역에 대하여 공백을 최소화하며 서비스를 제공할 수 있다. 도 16에 따르면, 제1 로봇은 제2 로봇과 배치 구역을 서로 교체하고, 사용자와 함께 제3 구 역에 위치한 목적지로 이동할 수 있다. 그리고, 제1 로봇에 상응하는 제1 동작에 자신의 배 치 구역인 제2 구역을 벗어나는 동작이 포함되어 있으므로, 인공 지능 서버의 프로세서는 제1 로봇과 제3 로봇 사이의 연계 동작을 결정하여, 로봇들을 관제할 수 있다. 도 17은 본 발명의 일 실시 예에 따른 복수의 로봇들을 관제하는 방법을 나타낸 동작 흐름도이다. 도 5와 중복되는 설명은 생략한다. 도 17을 참조하면, 인공 지능 서버의 프로세서는 관제 구역에 포함된 복수의 로봇들 각각에 상응하는 동작 및 배치 구역을 포함하는 정보를 수신한다(S1701). 이는 도 5의 단계(S501)에 대응된다. 그리고, 인공 지능 서버의 프로세서는 제1 로봇에 상응하는 제1 동작이 제1 로봇에 상응하는 제1 배 치 구역 밖으로 이동하는 동작을 포함하는 경우, 제1 동작의 자체 수행 여부를 결정한다(S1703). 프로세서는 제1 로봇이 제1 동작을 수행하는데 걸리는 시간 또는 제1 로봇이 배치된 제1 배치 구역의 밀집 도 중에서 적어도 하나 이상에 기초하여 제1 로봇이 제1 동작을 자체적으로 수행할 것인지 여부를 결정할 수 있 다. 예컨대, 프로세서는 제1 로봇이 제1 동작을 수행하는데 걸리는 시간이 제4 기준 값을 초과하거나, 제1 로 봇이 배치된 제1 배치 구역의 밀집도가 제5 기준 값을 초과하는 경우, 제1 로봇이 제1 동작을 자체적으로 수행 하지 않는 것으로 결정할 수 있다. 그리고, 인공 지능 서버의 프로세서는 제1 로봇이 제1 동작을 자체 수행할 것인지 여부를 판단한다 (S1705). 프로세서는 단계(S1703)에서 결정된 결과에 기초하여 제1 로봇이 제1 동작을 자체 수행할 것인지 여부를 판단할 수 있다. 단계(S1705)의 판단 결과, 제1 로봇이 제1 동작을 자체 수행하는 것으로 결정된 경우, 인공 지능 서버의 프로세서는 제1 로봇이 제1 동작을 수행하도록 제어한다(S1707). 단계(S1705)의 판단 결과, 제1 로봇이 제1 동작을 자체 수행하지 않는 것으로 결정된 경우, 인공 지능 서버 의 프로세서는 제1 동작에 상응하는 제1 경로를 결정한다(S1709). 이는 도 5의 단계(S503)에 대응된다. 그리고, 인공 지능 서버의 프로세서는 결정된 제1 경로상에 존재하고 적어도 하나 이상의 로봇이 배 치된 구역을 결정한다(S1711). 이는 도 5의 단계(S505)에 대응된다. 그리고, 인공 지능 서버의 프로세서는 결정된 구역에 배치된 제2 로봇과 제1 로봇 사이의 연계 동작 을 결정한다(S1713). 이는 도 5의 단계(S507)에 대응된다. 그리고, 인공 지능 서버의 프로세서는 결정된 연계 동작에 기초하여 제2 로봇에 상응하는 제2 동작 또는 제2 로봇에 상응하는 제2 배치 구역을 갱신한다(S1715). 이는 도 5의 단계(S509)에 대응된다. 도 17은 제2 로봇에 상응하는 동작 또는 배치 구역을 갱신하는 과정을 1번의 사이클(cycle)로만 나타낸 것으로, 도 17에 도시된 단계들(S1701 내지 S1715)는 반복적으로 수행될 수 있다. 즉, 도 17에 도시된 단계들(S1701 내 지 S1715)은 관제 구역에 포함된 복수의 로봇들의 동작이나 배치 구역이 변경될 때마다 반복적으로 수행될 수 있다. 예컨대, 단계(S1715)에 따라 제2 로봇에 상응하는 제2 동작 또는 제2 로봇에 상응하는 제2 배치 구역이 갱신된 경우, 인공 지능 서버는 다시 도 17에 도시된 단계들(S1701 내지 S1715)를 수행할 수 있다. 한편, 이상의 실시 예에서, 도 5의 단계들 및 도 17의 단계들이 인공 지능 서버에 의해 수행되는 것으로 설명하였으나, 복수의 로봇들 중 어느 하나의 인공 지능 로봇(100 or 100a)에 의하여 수행될 수도 있다. 이 경우, 어느 하나의 인공 지능 로봇은 다른 로봇들을 제어할 수 있는 마스터 로봇일 수 있고, 마스터 로 봇은 기 설정된 인공 지능 로봇일 수 있다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다."}
{"patent_id": "10-2019-0093444", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 AI 장치를 나타낸다. 도 2는 본 발명의 일 실시 예에 따른 AI 서버를 나타낸다. 도 3은 본 발명의 일 실시 예에 따른 AI 시스템을 나타낸다. 도 4는 본 발명의 일 실시 예에 따른 AI 장치를 나타낸다. 도 5는 본 발명의 일 실시 예에 따른 복수의 로봇들을 관제하는 방법을 나타낸 동작 흐름도이다. 도 6은 본 발명의 실시 예에 각 따른 단위 구역별로 측정된 밀집도를 나타낸 도면이다. 도 7 내지 9는 본 발명의 일 실시 예에 따른 그룹 구역의 밀집도를 산출하는 방법을 나타낸 도면이다. 도 10은 본 발명의 일 실시 예에 따른 밀집도가 동일한 그룹 구역들 사이의 우선 순위를 결정하는 방법을 나타 낸다. 도 11은 본 발명의 일 실시 예에 따른 밀집도가 동일한 그룹 구역들 사이의 우선 순위를 결정하는 방법을 나타 낸다. 도 12는 특정 로봇의 동작이 자신의 배치 구역을 벗어나는 동작을 포함하는 상황을 나타낸 도면이다. 도 13은 도 12의 상황에서, 본 발명의 일 실시 예에 따른 제1 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 14는 도 13의 상황에서, 본 발명의 일 실시 예에 따른 제1 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 15는 도 13의 상황에서, 본 발명의 일 실시 예에 따른 제2 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 16은 도 12의 상황에서, 본 발명의 일 실시 예에 따른 제2 연계 동작에 기초하여 로봇들을 관제하는 방법을 나타낸다. 도 17은 본 발명의 일 실시 예에 따른 복수의 로봇들을 관제하는 방법을 나타낸 동작 흐름도이다."}
