{"patent_id": "10-2017-0087819", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0006741", "출원번호": "10-2017-0087819", "발명의 명칭": "커넥티비티 통합관리 방법 및 커넥티드 카", "출원인": "현대자동차주식회사", "발명자": "이동철"}}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량에 탑재되어 차량 시동과 함께 활성화된 인공지능 커넥티비티 시스템에서 운전자의 음성명령 중 차량진단명령이 인식되면, 상기 차량에 탑재된 차량 탑재 센서가 측정한 소음 및 진동 데이터를 기반으로 한 고장진단이진단결과로 생성되고, 상기 진단결과로 상기 차량의 차량고장여부를 판단하고 상기 운전자에게 알려주는 차량진단 인공지능이 수행되는것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 차량진단 인공지능은 (A) 상기 인공지능 커넥티비티 시스템에서 상기 차량진단명령이인식되는 단계, (B) 상기 인공지능 커넥티비티 시스템에서 상기 차량 탑재 센서로 작동명령이 전달되는 단계,(C) 상기 차량 탑재 센서의 상기 소음 및 진동 데이터에 기반한 이상 소음과 이상 진동으로 상기 고장 진단이이루어져 상기 진단결과가 생성되는 단계, (D) 상기 진단결과가 상기 이상 소음과 이상 진동이 발생하지 않은차량 정상모드와 상기 이상 소음과 이상 진동이 발생된 차량 점검모드로 구분되어 상기 차량으로 피드백되는 단계, (E) 상기 차량 정상모드와 상기 차량 점검모드의 각각이 상기 운전자에게 음성 출력으로 알려지는 단계로 수행되는 것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 차량진단명령은 인공지능 화자인식 기능으로 인식되는 것을 특징으로 하는 커넥티비티통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서, 상기 고장 진단은 상기 소음 및 진동 데이터에 대한 외란 제거 후 수행되는 것을 특징으로하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 2에 있어서, 상기 진단결과는 상기 소음 및 진동 데이터에 대해 소음 및 진동신호 추출 기능이 적용되어상기 이상 소음과 이상 진동의 발생 유무가 획득되는 것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서, 상기 소음 및 진동신호 추출 기능은 상기 소음 및 진동 데이터에 대한 딥러닝 기법 적용을통한 이미지의 처리와 상기 이미지에 대한 머신러닝 기법 적용을 통한 소음 신호의 처리이며, 상기 소음 신호는소음 및 진동 발생원에 대한 유형별 소음 구분 모델로 표현되는 것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 2에 있어서, 상기 진단결과는 빅 데이터 DB(Data Base)로 생성되어 개발차량의 빅 데이터 기반 이상소음공개특허 10-2019-0006741-3-및 이상 진동 판단 기준으로 활용되는 것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에 있어서, 상기 인공지능 커넥티비티 시스템에서 상기 차량진단 인공지능이 수행된 후 상기 진단결과로 상기 차량의 차량고장이 판단되지 않으면 차량음성제어 인공지능으로 전환되고, 상기 차량음성제어 인공지능은 상기 차량의 스마트 기기 제어와 인포테이먼트 제어 기능을 음성인식으로 수행해 주는것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 상기 인공지능 커넥티비티 시스템에서 상기 차량진단 인공지능이 수행된 후 상기 진단결과로 상기 차량의 차량고장이 판단되면, GPS(Global Positioning System)에 기반한 위치 파악이 이루어지도록 클라우드 센터로 접속되고, 서비스 예약이 이루어지도록 상기 클라우드 센터에 연계된 콜 센터로 접속되는 서비스망 인공지능이 수행되는것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서, 상기 서비스망 인공지능은 (F) 상기 차량고장의 판단에 따른 수리 메시지를 상기 차량으로피드백시켜 주는 단계, (G) 상기 차량고장의 수리를 위한 서비스 센터의 정보를 상기 차량으로 제공해주는단계, (H) 상기 운전자의 음성예약명령을 인식하는 단계, (I) 상기 음성예약명령으로 상기 콜 센터를 통한 서비스 센터의 예약이 이루어지고, 상기 서비스 센터로 상기 차량의 네비게이션 자동설정이 이루어지는 단계, (J)상기 클라우드 센터로 상기 차량고장의 상기 진단결과를 전송해주는 단계로 수행되는 것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 서비스 센터의 정보는 상기 운전자에게 운전자 맞춤형 비즈니스모델로 제공되는 것을특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 10에 있어서, 상기 수리 메시지는 상기 운전자에게 음성 출력으로 알려지는 것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 9에 있어서, 상기 인공지능 커넥티비티 시스템에서는 상기 서비스망 인공지능이 수행된 후 차량음성제어인공지능으로 전환되고, 상기 차량음성제어 인공지능은 상기 차량의 스마트 기기 제어와 인포테이먼트 제어 기능을 음성인식으로 수행해 주는것을 특징으로 하는 커넥티비티 통합관리 방법."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "공개특허 10-2019-0006741-4-차량의 음성 인식용 마이크와 함께 소음 및 진동의 측정용 차량 탑재 센서가 각각 연결되고, 상기 마이크로 입력된 상기 운전자의 차량진단명령으로 상기 차량 탑재 센서에서 측정된 소음 및 진동 데이터에 기반한 이상 소음과 이상 진동의 발생여부로 상기 차량의 수리여부를 위한 진단결과가 획득되며, 상기 진단결과를 수리를 요하지 않는 차량 정상모드와 수리를 요하는 차량 점검모드로 구분하고, 상기 차량 점검모드시 GPS(GlobalPositioning System)에 기반한 위치 파악이 이루어지도록 클라우드 센터에 접속하면서 서비스 예약이 이루어지도록 상기 클라우드 센터에 연계된 콜 센터에 접속하여 서비스 예약을 수행하는 인공지능 커넥티비티 시스템;이 포함되는 것을 특징으로 하는 커넥티드 카."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 상기 인공지능 커넥티비티 시스템은 상기 차량 탑재 센서의 소음 및 진동 데이터에 대한딥러닝 기법 적용으로 이미지 처리가 이루어지는 딥 러닝 학습부, 상기 딥 러닝 학습부의 상기 이미지에 대한머신러닝 기법 적용으로 소음 및 진동 발생원에 대한 유형별 소음 구분 모델로 표현되는 소음 신호 처리가 이루어지는 머신러닝 학습부, 상기 머신러닝 학습부의 상기 소음 신호에 대해 상기 차량 정상모드와 상기 차량 점검모드를 구분하면서 상기 클라우드 센터와 상기 콜 센터의 접속과 상기 서비스 예약을 위한 출력이 이루어지는고장진단출력 판단부로 구성되는 것을 특징으로 하는 커넥티드 카."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 15에 있어서, 상기 딥러닝 기법은 GBFB(Gabor Filter Feature Map) 기법인 것을 특징으로 하는 커넥티드카."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서, 상기 머신러닝 기법은 DNN(Deep Neural Network)과 CNN(Convolution Neural Network) 기법인 것을 특징으로 하는 커넥티드 카."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 15에 있어서, 상기 인공지능 커넥티비티 시스템은 차량 개발 클라우드 시스템과 연결되고, 상기 차량 개발 클라우드 시스템은 상기 인공지능 커넥티비티 시스템의 빅 데이터 DB와 접목되어 차량 개발 목표 항목 분류및 개발 프로세스를 위한 DB 구축과 입출력 제어 및 데이터 처리와 분석이 이루어지는 것을 특징으로 하는 커넥티드 카."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 18에 있어서, 상기 차량 개발 클라우드 시스템은 상기 인공지능 커넥티비티 시스템에 개발차량의 진단조건을 제공하는 것을 특징으로 하는 커넥티드 카."}
{"patent_id": "10-2017-0087819", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 18에 있어서, 상기 차량 개발 클라우드 시스템은 상기 인공지능 커넥티비티 시스템과 연계된 차량 개발자료를 양산차량의 품질편차 통계 관리 목적 DB로 구축 및 활용하는 것을 특징으로 하는 커넥티드 카."}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 커넥티드 카는 마이크로 입력된 운전자의 차량진단명령으로 차량 탑재 센서에서 측정된 소 음 및 진동 데이터에 기반한 이상 소음과 이상 진동의 발생여부로 차량의 고장여부에 대한 진단결과를 생성하고, GPS(Global Positioning System)에 기반한 위치 파악이 이루어지도록 클라우드 센터과 콜 센터에 접 속하여 차량 수리를 위한 서비스 예약이 이루어지는 인공지능 커넥티비티 시스템을 포함함으로써 음성인식에 기반한 스마트 기기 및 인포테이먼트 기능 제어 서비스에 더해 실시간 기반 차량 문제 상태 점검 인공지능 서비 스와 통합형 비즈니스 기반 서비스로 확장되고, 특히 운전자 명령에 의해 소음/진동신호로부터 실시간 차량상태 점검 및 고장진단 판단시 GPS 기반 서비스 센터 클라우드 시스템정보공유로 실시간 예약 서비스등 비즈니스 비서 기능을 제공하는 비즈니스형 커넥티비티 통합관리가 이루어지는 특징을 구현한다."}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 커넥티드 카에 관한 것으로, 특히 비즈니스 비서 기능으로 서비스 영역을 확장한 커넥티비티 통합관 리 방법이 구현되는 커넥티드 카에 관한 것이다."}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 급증하고 있는 차량의 IT(Information Technology)화는 차량에서 음성으로 모바일 애플리케이션의 사 용이 가능한 커넥티드 카(Connected Car)의 실현을 가속화하고 있다. 이러한 예로 차량에 화자인식이 적용된 음성인식 기술을 사용한 모바일 IT 기술 접목이 이루어진 커넥티드 카가 있다. 일례로, 상기 커넥티드 카는 음성인식을 통안 모바일 어플리케이션 연동 활용과 차량의 주요 엔터테이먼 트 기능 어플리케이션 연동 활용이 이루어짐으로써 음성인식에 의한 네비게이션 검색과 오디오 조작에 더해 스 마트폰 블루투스 연동에 의한 어플리케이션 조작 등을 구현할 수 있도록 한다. 그 결과 상기 커넥티드 카는 음성인식 기능을 이용한 음성명령으로 차량에 탑재된 차량 멀티미디어에 대한 스마 트 기기 제어 및 외부통신기기에 대한 인포테이먼트 기능 제어로 사용자 기반 편의 기능성을 크게 높여 준다. 선행기술문헌 특허문헌 (특허문헌 0001) 일본공개특허 2003-267162(2003.9.25)"}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "하지만 현 시점에서 커넥티드 카의 음성명령 기술을 활용한 스마트 기기 제어 및 인포테이먼트 기능 제어는 스 마트 기기 및 외부통신기기에 대한 온,오프와 같은 단순 기능 제어로 국한됨으로써 내비게이션, 도난차량, 위치 추적, 차량 점검, 차량 문 개폐 등과 같은 보다 발전된 서비스 구현 요구를 따라 가지 못하고 있는 실정이다. 특히 차량이 빠르게 IT화됨으로써 블루투스, WiFi 등의 차량 연결로 외부에서도 차량의 원격 조정이 가능한 기 술 발전 향상을 고려할 때, 커넥티드 카의 기술은 단순한 인포테이먼트 기능과 스마트기기 작동에 국한되지 않 고 실시간 소음/진동 기반 차량 및 엔진상태 진단 기능은 물론 GPS(Global Positioning System) 기반 차량위치 추적 기반 서비스 센터와 필요지점 파악 및 실시간 정보 송/수신을 통한 통합 커넥티비티(connectivity) 시스템 으로 발전되어야 할 당위성 및 필요성이 요구되고 있다. 이에 상기와 같은 점을 감안한 본 발명은 음성인식(화자인식)에 인공지능 기술과 빅 데이터 기술 및 서비스센터 클라우드 기술을 함께 접목함으로써 음성인식에 기반한 스마트 기기 및 인포테이먼트 기능 제어 서비스에 더해 실시간 기반 차량 문제 상태 점검 인공지능 서비스와 통합형 비즈니스 기반 서비스로 확장되고, 특히 운전자 명 령에 의해 소음 및 진동신호로부터 실시간 차량상태 점검 및 고장진단 판단시 GPS 기반 서비스 센터 클라우드 시스템정보공유로 실시간 예약 서비스등 비즈니스 비서 기능을 제공하는 커넥티비티 통합관리 방법 및 커넥티드 카의 제공에 목적이 있다."}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위한 본 발명의 커넥티비티 통합관리 방법은 차량에 탑재되어 차량 시동과 함께 활성화된 인공지능 커넥티비티 시스템에서 운전자의 음성명령 중 차량진단명령이 인식되면, 상기 차량에 탑재된 차량 탑재 센서가 측정한 소음 및 진동 데이터를 기반으로 한 고장진단이 진단결과로 생성되고, 상기 진단결과 로 상기 차량의 차량고장여부를 판단하고 상기 운전자에게 알려주는 차량진단 인공지능이 수행되고; 상기 진단 결과에 의한 상기 차량의 차량고장 판단시 GPS에 기반한 위치 파악이 이루어지도록 클라우드 센터로 접속되고, 서비스 예약이 이루어지도록 상기 클라우드 센터에 연계된 콜 센터로 접속되는 서비스망 인공지능이 수행되며; 상기 차량진단 인공지능과 상기 서비스망 인공지능이 수행된 후 상기 차량의 스마트 기기 제어와 인포테이먼트 제어 기능을 음성인식으로 수행해 주는 차량음성제어 인공지능으로 전환되는 것을 특징으로 한다. 바람직한 실시예로서, 상기 차량진단 인공지능은 (A) 상기 인공지능 커넥티비티 시스템에서 상기 차량진단명령 이 인공지능 화자인식 기능으로 인식되는 단계, (B) 상기 인공지능 커넥티비티 시스템에서 상기 차량 탑재 센서 로 작동명령이 전달되는 단계, (C) 상기 차량 탑재 센서의 상기 소음 및 진동 데이터에 대한 외란 제거 후 상기소음 및 진동 데이터에 기반한 이상 소음과 이상 진동으로 상기 고장 진단이 이루어지고, 상기 소음 및 진동 데 이터에 대해 소음 및 진동신호 추출 기능이 적용되어 상기 이상 소음과 이상 진동의 발생 유무로 상기 진단결과 가 생성되는 단계, (D) 상기 진단결과가 상기 이상 소음과 이상 진동이 발생하지 않은 차량 정상모드와 상기 이 상 소음과 이상 진동이 발생된 차량 점검모드로 구분되어 상기 차량으로 피드백되는 단계, (E) 상기 차량 정상 모드와 상기 차량 점검모드의 각각이 상기 운전자에게 음성 출력으로 알려지는 단계로 수행된다. 바람직한 실시예로서, 상기 소음 및 진동신호 추출 기능은 상기 소음 및 진동 데이터에 대한 딥러닝 기법 적용 을 통한 이미지의 처리와 상기 이미지에 대한 머신러닝 기법 적용을 통한 소음 신호의 처리이며, 상기 소음 신 호는 소음 및 진동 발생원에 대한 유형별 소음 구분 모델로 표현된다. 바람직한 실시예로서, 상기 진단결과는 빅 데이터 DB(Data Base)로 생성되어 개발차량의 빅 데이터 기반 이상소 음 및 이상 진동 판단 기준으로 활용된다. 바람직한 실시예로서, 상기 서비스망 인공지능은 (F) 상기 차량고장의 판단에 따른 수리 메시지를 상기 차량으 로 피드백시켜 상기 운전자에게 음성 출력으로 알려주는 단계, (G) 상기 차량고장의 수리를 위한 서비스 센터의 정보가 상기 차량에서 상기 운전자에게 운전자 맞춤형 비즈니스모델로 제공되는 단계, (H) 상기 운전자의 음성 예약명령을 인식하는 단계, (I) 상기 음성예약명령으로 상기 콜 센터를 통한 서비스 센터의 예약이 이루어지고, 상기 서비스 센터로 상기 차량의 네비게이션 자동설정이 이루어지는 단계, (J) 상기 클라우드 센터로 상기 차량 고장의 상기 진단결과를 전송해주는 단계로 수행된다. 그리고 상기와 같은 목적을 달성하기 위한 본 발명의 커넥티드 카는 차량의 음성 인식용 마이크와 함께 소음 및 진동의 측정용 차량 탑재 센서가 각각 연결되고, 상기 마이크로 입력된 상기 운전자의 차량진단명령으로 상기 차량 탑재 센서에서 측정된 소음 및 진동 데이터에 기반한 이상 소음과 이상 진동의 발생여부로 상기 차량의 수 리여부를 위한 진단결과가 획득되며, 상기 진단결과를 수리를 요하지 않는 차량 정상모드와 수리를 요하는 차량 점검모드로 구분하고, 상기 차량 점검모드시 GPS에 기반한 위치 파악이 이루어지도록 클라우드 센터에 접속하면 서 서비스 예약이 이루어지도록 상기 클라우드 센터에 연계된 콜 센터에 접속하여 서비스 예약을 수행하는 인공 지능 커넥티비티 시스템; 이 포함되는 것을 특징으로 한다. 바람직한 실시예로서, 상기 인공지능 커넥티비티 시스템은 상기 차량 탑재 센서의 소음 및 진동 데이터에 대한 GBFB 기법을 딥러닝 기법으로 적용하여 이미지 처리가 이루어지는 딥 러닝 학습부, 상기 딥 러닝 학습부의 상기 이미지에 대한 DNN 과 CNN 기법을 머신러닝 기법으로 적용하여 소음 및 진동 발생원에 대한 유형별 소음 구분 모델로 표현되는 소음 신호 처리가 이루어지는 머신러닝 학습부, 상기 머신러닝 학습부의 상기 소음 신호에 대 해 상기 차량 정상모드와 상기 차량 점검모드를 구분하면서 상기 클라우드 센터와 상기 콜 센터의 접속과 상기 서비스 예약을 위한 출력이 이루어지는 고장진단출력 판단부로 구성된다. 바람직한 실시예로서, 상기 인공지능 커넥티비티 시스템은 차량 개발 클라우드 시스템과 연결되고, 상기 차량 개발 클라우드 시스템은 상기 인공지능 커넥티비티 시스템의 빅 데이터 DB와 접목되어 개발차량의 진단조건을 제공하면서 차량 개발 목표 항목 분류 및 개발 프로세스를 위한 DB 구축과 입출력 제어 및 데이터 처리와 분석 이 이루어진다. 바람직한 실시예로서, 상기 차량 개발 클라우드 시스템은 상기 인공지능 커넥티비티 시스템과 연계된 차량 개발 자료를 양산차량의 품질편차 통계 관리 목적 DB로 구축 및 활용된다."}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이러한 본 발명의 커넥티드 카는 커넥티비티 통합관리 방법을 구현함으로써 하기와 같은 작용 및 효과가 구현된 다. 첫째, 차량의 빠른 IT화에 맞춘 커넥티드 카를 구현할 수 있다. 둘째, 실시간 인공지능 차량 소음 및 진동 데이 터 기반 이상 소음, 이상 진동에 대한 고장여부 판단 기술을 제공한다. 셋째, 인포테이먼트에 국한된 기존 기능 을 다양한 클라우드 서버와 동기화시켜 운전자에게 필요한 정보 제공 및 필요 기능을 수행할 수 있다. 넷째, 음 성인식(화자인식)에 인공지능 기술과 빅 데이터 기술 및 서비스센터 클라우드 기술을 함께 접목함으로써 스마트 기기 및 인포테이먼트 기능 제어 서비스에 더해 실시간 기반 차량 문제 상태 점검 인공지능 서비스와 통합형 비즈니스 기반 서비스로 확장될 수 있다. 다섯째, 운전자 명령에 의해 소음/진동신호로부터 실시간 차량상태 점 검 및 고장진단 판단시 GPS 기반 서비스 센터 클라우드 시스템정보공유로 실시간 예약 서비스등 개인 비서 서비 스 기술을 제공할 수 있다. 여섯째, 차량 개발단계의 목표 만족 시스템 데이터가 빅 데이터화됨으로써 차량의이상 소음 및 이상 진동 판단을 위해 적용될 수 있다. 일곱째, 차량의 GPS 기능과 네비게이션 검색 및 실행 기 능이 동기화된 통합 정보 기술로 구현된다. 여덟째, 화자인식 인공지능 기법에 의한 운전자의 명확한 의지 파악 및 측정데이터 정확도 향상을 위한 노이즈 제거나 억제에 인공지능 기법이 적용됨으로써 정확한 기능으로 동작 된다."}
{"patent_id": "10-2017-0087819", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 실시 예를 첨부된 예시도면을 참조로 상세히 설명하며, 이러한 실시 예는 일례로서 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 여러 가지 상이한 형태로 구현될 수 있으므로, 여기에서 설명하 는 실시 예에 한정되지 않는다. 도 1과 도 2를 참조하면, 커넥티비티 통합관리 방법은 차량의 엔진 시동과 함께 인공지능 커넥티비티 시스템 온 (ON)(S1)이 이루어지고, 인공지능 커넥티비티 시스템의 운전자 음성 명령 인식을 통해 차량 탑재 센서에 기반된 차량진단 인공지능의 로직 수행(S10-1)이 이루어지며, 차량진단 인공지능의 수행 결과로부터 차량음성제어 인공 지능(S200-1)으로 전환되거나 또는 서비스망 인공지능의 로직 수행(S100-1)이 이루어진 후 차량음성제어 인공지 능(S200-1)으로 전환되고, 차량진단 인공지능의 수행 결과가 빅 데이터 DB(Data Base)로 생성되어 인공지능 차 량 개발 시스템으로 구축(S200)됨에 특징이 있다. 그 결과 커넥티비티 통합관리 방법은 소음/진동 기반 인공지능 차량진단 기술로부터 차량 상태 실시간 점검 구 현. 음성인식 기반 인공지능 시스템 구현, 빅 데이터 기반으로 GPS 위치 기반 사용자 목적지점 검색과 서비스 센터 예약 및 필요정보 제공 등이 결합된 비즈니스형 커넥티비티 통합관리를 구현한다. 그러므로 비즈니스형 커 넥티비티 통합관리를 구현하는 인공지능 커넥티비티 시스템이 탑재된 차량은 기존과 같이 단순한 인포테이먼트 및 스마트기기 제어로 국한된 기술이 아닌 인공지능형 통합 비즈니스 모델 기반 서비스 기술로 확장되고, 실시 간 소음/진동 기반 차량 및 엔진상태 진단 기능과 정보제공 기능 제공, GPS 및 차량위치 추적 기반 서비스 센터 및 필요지점 파악 및 실시간 정보 송/수신을 통한 통합 처리가 이루어 질 수 있다. 도 3을 참조하면, 커넥티드 카(Connected Car)는 위치기반 서비스 시스템과 네트워크로 묶어진다. 일례로, 상기 커넥티드 카는 음성 입력을 위한 마이크로폰 타입의 마이크, 커넥티드 카의 엔진 작동 시 실시간 측정된 마이크로폰 소음과 가속도계 진동 기반 문제소음 발생원을 검출하는 소음과 진동 및 가속도의 센서가 포함된 차량 탑재 센서, 커넥티비티 통합관리 로직을 탑재하여 도 6의 차량 멀티미디어와 외부 통신기기에 대한 음성 제어와 함께 차량 진단과 비즈니스 서비스를 구현하는 인공지능 커넥티비티 시스템 을 포함한다. 특히 상기 인공지능 커넥티비티 시스템은 마이크에 대한 운전자의 음성 명령 인식 기 능과 인식된 음성명령에 따른 차량 탑재 센서의 동작 명령 출력 기능을 기본적인 기능으로 포함하며, 이러 한 기능은 일반적인 음성인식 및 출력 기능과 동일하다. 특히 상기 인공지능 커넥티비티 시스템은 딥 러닝 학습부, 머신러닝 학습부 및 고장진단출력 판단 부를 포함하여 실시간 인공지능 차량 이상상태 진단을 통한 통합 비즈니스형 서비스 제공 시스템으로 작동 한다. 이 경우 통합 비즈니스형 서비스는 음성인식(화자인식) 기능과 함께 필요 소음데이터 추출을 위한 환경소 음 제거 알고리즘이 적용된 인공지능 진단 알고리즘 수행 진행으로 차량 탑재 센서로부터 실시간 소음과 진 동 데이터 측정 및 분석, 차량 개발목표 레벨 기준으로 적용되는 빅 데이터에 기반된 측정과 분석된 소음 및 진 동데이터 기준으로 고장여부 판단 진행, 진단 결과에 대해 운전자에게 음성으로 제공하면서 서비스센터 클라우 드 접속을 통해 수리필요 내역 및 예약 업무 진행 등을 포함한다. 또한 상기 인공지능 커넥티비티 시스템의 명령으로 동작하여 데이터를 검출하는 차량 탑재 센서는 소음센서와 진동센서를 포함하여 엔진룸과 실내 소 음 및 진동 측정이 이루어진다. 일례로, 상기 위치기반 서비스 시스템은 클라우드 센터와 콜 센터로 구축된 서비스 센터와 GPS 위성으로 구축된다. 상기 클라우드 센터는 인공지능 커넥티비티 시스템의 요청으로 GPS 위성과 접속하면서 차량 진단 정보와 함께 전송된 예약 명령에 의거하여 실시간 예약 업무를 진행하고, 콜 센 터의 요청에 의해 처리된 정보를 콜 센터로 제공한다. 상기 콜 센터는 커넥티드 카에 대해 클라우드 센터의 클라우드 서비스 지원을 통한 개인 비즈니스 비서 역할을 수행한다. 상기 GPS 위성 은 클라우드 센터의 요청으로 GPS 기반으로 추적한 차량 위치를 클라우드 센터와 콜 센터의 각 각으로 제공한다. 그러므로 상기 커넥티드 카는 마이크를 통한 운전자의 음성명령이 인공지능 커넥티비티 시스템에서 인식됨으로써 차량 탑재 센서의 센서 데이터에 기반한 차량 진단이 이루어지고, 또한 커넥티드 카는 GPS 위성에 기반으로 위치가 인공지능 커넥티비티 시스템에서 검출됨으로써 클라우드 센터와 콜 센터 를 이용한 차량 진단 정보 공유 및 차량 예약 등의 의 비즈니스 서비스가 이루어진다. 따라서 상기 커넥티드 카는 인공지능 커넥티비티 시스템과 연계됨으로써 음성명령에 기반한 사용자 기반 편의 기능과 통합 비지니스형 서비스 기능을 보다 효과적으로 제공한다. 여기서 상기 사용자 기반 편의 기능은 도 6의 차량 멀티미디어와 외부통신기기에 대한 스마트 기기 및 인포테이먼트 기능 제어를 의미한다. 상기 통합 비지니스형 서비스 기능은 실시간 인공지능 차량 진단과 함께 커넥티비티 기능을 통한 통합 비지니스 형 서비스 제공기능, 운전자 명령에 의한 차량 탑재 센서의 소음과 진동 신호로부터 실시간 차량상태 점검 및 고장진단 판단시 GPS 기반 서비스 센터 클라우드 시스템 정보공유로 실시간 예약 서비스 등의 비즈니스 비 서 기능을 의미 한다. 이하 도 1과 도 2의 커넥티비티 통합관리 방법을 도 3내지 도 7을 통해 상세히 설명한다. 이 경우 제어 주체는 커넥티드 카에 탑재된 인공지능 커넥티비티 시스템이고, 제어 대상은 인공지능 커넥티비티 시스템으 로 제어되는 커넥티드 카이다. 도 1을 참조하면, 인공지능 커넥티비티 시스템은 S1과 같이 커넥티드 카의 차량 시동(예, 엔진 시동)과 함께 오프(OFF)에서 온(ON)으로 전환됨으로써 활성화된다. 그러면 인공지능 커넥티비티 시스템은 마이크 를 통한 음성인식의 제1단계, 차량 탑제 센서를 통한 센서명령전단의 제2단계, 인공지능 고장진단의 제 3단계, 진단결과 피드백의 제4단계, GPS 위치 기반 클라우드 연결의 제5단계, 인포테이먼트 및 스마트기기 제어 의 제6단계, 빅 데이터 DB 생성의 제7단계로 구분되는 동작 상태로 전환된다. 이 경우 상기 제1단계에서 제4단 계는 S10-1의 차량진단 인공지능의 로직 수행단계로 설명되고, 상기 제5단계는 S100-1의 서비스망 인공지능의 로직 수행단계로 설명되며, 상기 제6단계는 S200-1의 차량음성제어 인공지능의 로직 수행단계로 설명되고, 상기 제7단계는 S200의 인공지능 차량 개발 시스템의 구축 단계로 설명된다. S10-1의 차량진단 인공지능의 로직 수행단계에서 인공지능 커넥티비티 시스템은 S10-1의 차량진단 인공지능 의 로직 수행단계에 대해 S10의 운전자 음성진단명령 단계, S20의 차량진단센서 명령전달 단계, S30의 인공지능 고장 진단 단계, S40의 인공지능 진단 결과 생성 단계, S50의 인공지능 진단 결과 피드백 및 운전자 알림 단계, S50-1의 빅 데이터 DB 생성 단계, S60의 차량 정상모드 단계에 이어지는 S70-1의 정상 메세지 출력 단계를 수행 한다. 이 경우 S50-1의 빅 데이터 DB 생성 단계는 S200의 인공지능 차량 개발 시스템 구축 단계로 이어지며, S60의 차량 정상모드 단계에 반하는 S70-2의 차량 점검모드 단계는 S100-1의 서비스망 인공지능의 로직 수행단 계로 이어지고, S70-1의 정상 메세지 출력 단계는 S200-1의 차량음성제어 인공지능의 로직 수행단계로 이어진다. 도 3을 참조로 S10-1의 차량진단 인공지능의 로직 수행단계는 하기와 같이 구체화된다. S10의 운전자 음성진단명령 단계에서 인공지능 커넥티비티 시스템은 S10-1의 인공지능 화자인식 기능을 활 성화함으로써 커넥티드 카의 마이크로 입력된 운전자의 음성 명령을 인식한다. 이 경우 운전자의 음성 명령은 음성 명령은 “내차 진단 부탁해”와 같은 진단 문장으로 이루어지고, 상기 화자인식 기능은 진단 문장 에 대한 정확한 인식을 위해 커넥티드 카의 차량 소음(noise) 성분을 제거하여 준다. S20의 차량진단센서 명령전달 단계에서 인공지능 커넥티비티 시스템은 진단 문장에 일치하는 동작 명령을 출력함으로써 차량 탑재 센서를 작동시켜 준다. 그 결과 상기 차량 탑재 센서는 커넥티드 카의 엔진 룸과 실내의 실시간 소음과 진동을 검출하고, 인공지능 커넥티비티 시스템은 차량 탑재 센서의 센서 데 이터를 입력 데이터로 처리한다. S30의 인공지능 고장 진단 단계에서 인공지능 커넥티비티 시스템은 S30-1의 외란(예, 노이즈)제거 기능을 활성화함으로써 차량 탑재 센서가 검출한 실시간 소음과 진동의 센서 데이터에 대한 측정값의 정확도를 향 상시켜 준다.S40의 인공지능 진단 결과 생성 단계에서 인공지능 커넥티비티 시스템은 S40-1의 소음 및 진동신호 추출 기 능을 활성화함으로써 실시간 소음과 진동 데이터 기반 인공지능 진단 결과 출력이 이루어지고, S50의 인공지능 진단 결과 피드백 및 운전자 알림을 통해 진단 결과에 대해 문제점 발견의 유(수리필요)와 무(수리 불필요)로 구분된 진단 결과를 음성과 문자로 커넥티드 카에 회신하면서 그 진단 결과를 S50-1의 빅 데이터 DB 생성 단 계로 함께 제공한다. 그러면 인공지능 커넥티비티 시스템은 S60의 차량 정상모드 단계에서 회신된 진단 결 과로부터 무(수리 불필요)가 판단된 경우 S70-1의 정상 메세지 출력 단계를 수행하는 반면 회신된 진단 결과로 부터 유(수리필요)가 판단된 경우 S70-2의 차량 점검모드 단계로 진입 하여 S100-1의 서비스망 인공지능의 로직 수행단계로 전환된다. 여기서 S70-1의 정상 메시지는 수리불필요 메세이로서 “마스터 차량상태 정상입니다.”로 출력될 수 있다. 도 4를 참조하면, 상기 인공지능 커넥티비티 시스템은 딥 러닝 학습부, 머신러닝 학습부 및 고장진 단출력 판단부로 구분된다. 그러므로 차량 탑재 센서가 실시간 측정한 마이크로폰 소음과 문제소음 발 생원에 대해 검출한 가속도계 진동 기반의 소음과 진동의 센서 데이터는 딥 러닝 학습부로 입력된다. 상기 딥 러닝 학습부는 이미지 데이터 처리를 통한 인공지능 학습 알고리즘으로 차량 탑재 센서의 실시 간 소음과 진동 데이터에 대한 이미지 처리하고, Time domain 이미지 분석 알고리즘과 Frequency domain 이미지 분석 알고리즘으로 구분된 GBFB(Gabor Filter Feature Map) 기법 적용으로 수행된다. 그 결과 상기 딥 러닝 학 습부는 차량의 청각 특성을 고려한 추출이 이루어지는 Gabor Filter를 이용한 Feature Map 추출이 이루어짐 으로써 이미지 패턴에 의한 소음의 특징 벡터 추출이 가능하면서 소음 분류도 우수한 성능으로 이루어진다. 이어 상기 머신러닝 학습부는 소음데이터 신호처리를 통한 인공지능 학습 알고리즘으로 차량 탑재 센서(2 0)의 실시간 소음과 진동 데이터에 대한 신호 처리하고, DNN(Deep Neural Network),CNN(Convolution Neural Network) 기법 적용으로 수행된다. 그 결과 상기 머신러닝 학습부는 딥 러닝 학습부의 Gabor Filter를 이용한 Feature Map으로부터 이미지 추출로 소음측정데이터 변환이 이루어진 후 신호처리의 학습모델을 통한 머 신러닝 모델 추출 결과를 유형별 소음 구분 모델로 구분하여 획득된다. 그러므로 딥 러닝기법 기반 머신러닝 학 습 원리시험 결과는 다양한 소음 및 진동 발생원에 대한 유형별 소음 구분 모델의 독립성을 뚜렷이 하면서 유형 별 소음 및 진동구분 모델 기반 인공지능 학습 개발이 가능함을 증명한다. 이후 상기 고장진단출력 판단부는 머신러닝 학습부의 분석된 소음과 진동데이터에 대해 차량 개발목표 레벨 기준이 제시된 빅 데이터 기반으로 고장여부 판단을 진행하고, 그 진단 결과에 대해 커넥티드 카의 운 전자에게 음성으로 제공하면서 클라우드 센터와 콜 센터와 연계된 수리필요 내역 및 예약 업무 진행 이 이루어지도록 GPS 위성 기반에 의한 커넥티드 카의 위치주척이 이루어지는 클라우드 센터와 클 라우드 접속을 수행한다. S60의 차량 정상모드 단계에 반하는 S70-2의 차량 점검모드 단계는 S100-1의 서비스망 인공지능의 로직 수행단 계로 이어진다. 도 2를 참조하면, 인공지능 커넥티비티 시스템은 S100-1의 서비스망 인공지능의 로직 수행단계에 대해 S100 의 수리 메시지 출력 단계, S110의 자차 위치기반 서비스 센터 검색 및 서비스 센터 정보 표시 단계, S120의 운 전자 맞춤형 비즈니스모델 제공 단계, S130의 운전자 음성예약명령 단계, S140의 서비스 센터 예약 및 네비게이 션 자동설정 단계, S150의 해당 서비스 센터로 비정상 메시지 전송 단계로 수행한다. S100의 수리 메시지 출력 단계에서 인공지능 커넥티비티 시스템은 고장진단출력 판단부를 통해 S70-2의 차량 점검 모드에 따른 수리 메시지를 커넥티드 카로 음성과 문자에 더해 서비스 필요 여부 결정의 운전자 피드백을 출력한다. 이 경우 상기 수리 메시지는 “마스터 차량상태 비정상입니다.”로 출력되며, 수리 메시지 의 내용을 \" 문제소음은 ㅇㅇ관련 소음으로 추정되며 정확도 ㅇㅇ% 임, 문제소음은 x x 관련 소음으로 추정되며 정확도 x x% 임\"등으로 출력 및 표시한다. 이어 S110 내지 S150의 단계는 도 5를 참조로 설명된다. S110의 자차 위치기반 서비스 센터 검색 및 서비스 센터 정보 표시 단계에서 인공지능 커넥티비티 시스템은 고장진단출력 판단부의 피드백 출력을 통해 자차 위치기반 서비스 센터 검색을 수행하면서 운전자에게 서비 스 센터 정보를 표시하여 준다. 이를 위해 상기 고장진단출력 판단부는 GPS 위성을 통한 GPS 위치기반 차량 추적을 위해 클라우드 센터와 접속함으로써 커넥티비티 카의 자차 현재위치 판단이 이루어진다. S120의 운전자 맞춤형 비즈니스모델 제공 단계에서 인공지능 커넥티비티 시스템은 클라우드 센터에 저 장된 DB를 피드백 받아 고장진단출력 판단부의 출력을 통해 커넥티비티 카의 운전자에게 운전자 맞춤형 비즈니스모델을 피드백 하여 준다. 이 경우 상기 운전자 맞춤형 비즈니스모델은 서비스센터 별 거리 및 만족도, 정비사 경력 및 만족도, 수리비용, 수리시간 등을 서비스 항목으로 하고, 이들에 대해 운전자 개인의 선호도로 분류함으로써 운전자가 매번 선택해야 하는 번거로운 절차를 해소시켜 준다. S130의 운전자 음성예약명령 단계에서 인공지능 커넥티비티 시스템은 운전자의 음성예약명령을 인식한다. 이 경우 상기 음성예약명령은 운전자 맞춤형 비즈니스모델 중 나열된 항목에 대한 “Thank you, ㅇㅇ 예약모드 진행해”이거나 또는 하나의 선정 항목에 대한 “Thank you, 예약모드 진행해”일 수 있다. S140의 서비스 센터 예약 및 네비게이션 자동설정 단계에서 인공지능 커넥티비티 시스템은 고장진단출력 판 단부를 통해 콜 센터와 접속하고 동시에 커넥티비티 카의 차량 멀티미디어(도 6 참조)를 구성 하는 네비게이션에서 예약된 서비스 센터 경로를 자동 설정하여 준다. 이 경우 상기 서비스 센터 예약은 콜 센 터의 상담원과 서비스 예약 절차를 위한 대화 과정으로 수행된다, S150의 해당 서비스 센터로 비정상 메시지 전송 단계에서 인공지능 커넥티비티 시스템은 고장진단출력 판단 부를 통해 접속된 클라우드 센터에 수리 메시지를 전송한다. 이 경우 상기 수리 메시지는 \" 문제소 음은 ㅇㅇ관련 소음으로 추정되며 정확도 ㅇㅇ% 임, 문제소음은 x x 관련 소음으로 추정되며 정확도 x x% 임\"등 같은 진단 결과이다, 이어 인공지능 커넥티비티 시스템은 S70-1의 정상 메시지 출력 또는 S150의 해당 서비스 센터로 비정상 메 시지 전송 후 S200-1의 차량음성제어 인공지능의 로직 수행 단계로 전환된다. 상기 차량음성제어 인공지능의 로 직 수행 단계는 인공지능 커넥티비티 시스템의 음성명령인식 기능에 기반한 스마트 기기 및 인포테이먼트 기능으로서 일반적인 음성인식기술과 동일하다. 도 6을 참조하면, S10-1의 차량진단 인공지능, S100-1의 서비스망 인공지능, S200-1의 차량음성제어 인공지능이 구현되는 인공지능 커넥티비티 시스템을 활용한 커넥티드 카의 통합 커넥티비티(connectivity) 기능이 예시된다. 도시된 바와 같이, 커넥티드 카의 운전자는 차량 인포테이먼트 작동과 스마트 기기 어플리케이션 연동 작동 을 기본으로 활용하면서 실시간 인공지능에 기반한 비즈니스형 커넥티비티 통합관리 구현이 이루어진다. 이로부터 상기 커넥티드 카에서는 상기 차량 인포테이먼트 작동의 기능은 네비게이션이 포함된 차량 멀티미 디어의 제어 편리를 제공하고, 상기 스마트 기기 어플리케이션 연동 작동 기능은 스마트 폰이 포함된 외부 통신기기의 제어 편리를 제공한다. 더 나아가 상기 비즈니스형 커넥티비티 통합관리 구현은 자차의 실시간 문제 진단과 함께 서비스센터 클라우드 접속을 통해 수리필요 내역 및 예약 업무 진행과 같은 개인 비즈니스 비 서 역할을 위한 클라우드 서비스 지원에 더해 차량의 IT화에 따른 원격 조정 및 GPS 기반 실시간 차량위치 추적 기반 서비스 등확장성을 제공한다. 그러므로 상기 커넥티드 카는 인공지능 커넥티비티 시스템을 활용함으로써 음성인식을 이용한 단순 기능 제어의 한계성을 벗어나 내비게이션, 도난차량, 위치 추적, 차량 점검, 차량 문 개폐 등과 같은 보다 발전된 서 비스 구현 요구를 충족할 수 있다. 한편 인공지능 커넥티비티 시스템은 S50의 인공지능 진단 결과에 대해 S50-1의 빅 데이터 DB 생성 단계를 거쳐 S200의 인공지능 차량 개발 시스템의 구축 단계로 더 확장됨으로써 개발차량의 빅 데이터 기반 이상소음 및 이상진동 판단 기준이 제시될 수 있다. 도 7을 참조하면, 인공지능 차량개발 시스템은 컨셉트 카(Concept Car)(1-1), 차량 탑재 센서, 인공지능 커 넥티비티 시스템 및 차량 개발 클라우드 시스템(30-1)으로 구성된다. 상기 컨셉트 카(1-1)는 이상소음 및 이상진동을 해소하고자 하는 개발 차량이다. 상기 차량 탑재 센서는 엔 진 작동시 실시간 측정된 마이크로폰 소음과 가속도계 진동 기반 문제소음 발생원을 검출하는 소음과 진동 및 가속도의 센서로서 컨셉트 카(1-1)에 장착된다. 상기 인공지능 커넥티비티 시스템은 커넥티비티 카의 인 공지능 진단결과가 빅 데이터 DB로 저장된 도 1 내지 도 6을 통해 기술된 인공지능 커넥티비티 시스템이다. 상기 차량 개발 클라우드 시스템(30-1)은 인공지능 커넥티비티 시스템의 빅 데이터 DB와 접목되어 차량 개 발 목표 항목 분류 및 개발 프로세스를 위한 DB 구축과 입출력 제어 및 데이터 처리와 분석이 이루어지도록 구 축된다. 일례로 상기 컨셉트 카(1-1)의 차량 개발 목표 항목이 체인 소음이고, 상기 체인 소음의 목포 값 조건이 차량 OA(Operations Analysis) 레벨 대비 10dB 이상 차이를 10dB 이내 수준으로 하는 경우를 적용하면 하기와 같은 개발 흐름으로 이루어진다. 먼저 상기 차량 개발 클라우드 시스템(30-1)은 컨셉트 카(1-1)의 엔진회전수, 차속, 환경 조건, 내구를 위한 차 량 주행거리 조건을 주행조건 데이터로 추출하고, 상기 주행조건 데이터를 입력값으로 하여 인공지능 커넥티비 티 시스템에 진단조건으로 제공한다. 그러면 상기 인공지능 커넥티비티 시스템은 차량 개발 클라우드 시스템(30-1)의 진단 명령을 받아 컨셉트 카(1-1)에 탑재된 차량 탑재 센서에 작동명령을 주고, 차량 탑재 센서에서 검출된 엔진룸/실내 소음 및 진동 측정값을 입력값으로 처리하면서 상기 입력값을 차량 탑재 센서의 실시간 측정 데이터로 차량 개발 클 라우드 시스템(30-1)에 제공한다. 이어 상기 인공지능 커넥티비티 시스템은 도 1 내지 도 6을 통해 기술된 S10-1의 차량진단 인공지능과 S100-1의 서비스망 인공지능을 수행함으로써 컨셉트 카(1-1)에 대한 진단결과를 획득하고, 상기 진단결과를 컨셉트 카(1-1)의 운전자와 차량 개발 클라우드 시스템(30-1)의 운영자가 각각 확인 할 수 있도록 컨셉트 카(1-1)와 차량 개발 클라우드 시스템(30-1)으로 피드백하여 준다. 이어 차량 개발 클라우드 시스템(30-1)은 인공지능 커넥티비티 시스템의 진단결과와 실시간 측정데이터를 참조 및 비교하고, 이를 개발목표 값인 10dB 이내 수준의 체인 소음에 적합한지 여부를 분석 및 판단한 후 10dB 이내 수준의 개발목표 값에 도달될 때 까지 인공지능 커넥티비티 시스템과 연계 작업을 지속적으로 수행한 다. 그 결과 차량 개발 클라우드 시스템(30-1)은 인공지능 커넥티비티 시스템의 진단결과 활용을 통해 컨셉트 카(1-1)의 체인 소음을 목표 값에 맞출 수 있고, 특히 목표 체인 소음의 개발과정에서 획득된 목표 불만족 결과 와 목표 만족 결과 등이 모두 포함된 빅 데이터를 차량 개발 자료로 축적함으로써 양산차량의 품질편차 통계 관 리 목적 DB로 구축 및 활용된다. 전술된 바와 같이, 본 실시예에 따른 커넥티드 카는 마이크로 입력된 운전자의 차량진단명령으로 차량 탑재 센서에서 측정된 소음 및 진동 데이터에 기반한 이상 소음과 이상 진동의 발생여부로 차량의 고장여부 에 대한 진단결과를 생성하고, GPS(Global Positioning System)에 기반한 위치 파악이 이루어지도록 클라우드 센터과 콜 센터에 접속하여 차량 수리를 위한 서비스 예약이 이루어지는 인공지능 커넥티비티 시스템 을 포함함으로써 음성인식에 기반한 스마트 기기 및 인포테이먼트 기능 제어 서비스에 더해 실시간 기반 차량 문제 상태 점검 인공지능 서비스와 통합형 비즈니스 기반 서비스로 확장되고, 특히 운전자 명령에 의해 소 음/진동신호로부터 실시간 차량상태 점검 및 고장진단 판단시 GPS 기반 서비스 센터 클라우드 시스템정보공유로 실시간 예약 서비스등 비즈니스 비서 기능을 제공하는 비즈니스형 커넥티비티 통합관리가 이루어진다."}
{"patent_id": "10-2017-0087819", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1과 도 2는 본 발명에 따른 커넥티비티 통합관리 방법의 순서도이고, 도 3은 본 발명에 따른 커넥티비티 통 합관리를 수행하는 인공지능 커넥티비티 시스템이 적용된 커넥티드 카의 예이며, 도 4는 본 발명에 따른 커넥티 비티 카의 인공지능 커넥티비티 시스템 구성도이고, 도 5는 본 발명에 따른 인공지능 커넥티비티 시스템의 서비 스망 인공지능 동작 상태이며, 도 6은 본 발명에 따른 커넥티드 카의 커넥티비티 통합관리 서비스의 예이고, 도 7은 본 발명에 따른 인공지능 커넥티비티 시스템에 기반된 인공지능 차량개발 시스템의 활용예이다."}
