{"patent_id": "10-2021-0028187", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0124488", "출원번호": "10-2021-0028187", "발명의 명칭": "전자 장치 및 전자 장치에서 PD 기반 충전 방법", "출원인": "삼성전자주식회사", "발명자": "김경원"}}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,배터리;USB(universal serial bus) 커넥터;상기 USB 커넥터와 연결되어 외부 전자 장치와 PD(power delivery) 통신을 수행하는 PDIC(power deliveryintegrated chip);제1 충전 타입에 대응된 제1 충전 회로;제2 충전 타입에 대응된 제2 충전 회로; 및상기 USB 커넥터, 상기 PDIC, 상기 제1 충전 회로, 및 상기 제2 충전 회로와 작동적으로 연결된 프로세서를 포함하고,상기 프로세서는 상기 USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하고, 상기 외부 전자 장치가 상기 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 회로를 이용하여 상기 고정된 제1 전압을 기반으로 상기 제1 전력을 상기 외부 전자 장치에전송하고, 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압을 기반으로 상기 제2 전력을 상기 외부 전자 장치에 전송하도록 설정된전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 프로세서는 상기 PDIC를 통해 상기 외부 전자 장치로부터 BCD(binary coded decimal) 정보를 수신하고, 상기 BCD 정보에 기반하여 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 프로세서는 상기 외부 전자 장치가 제1 충전 타입 및 상기 제2 충전 타입을 지원하고, 상기 배터리의 전압이 지정된 전압보다 높거나 상기 배터리의 충전량이 지정된 충전량 보다 많은 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압을 기반으로 상기 제2 전력을 상기 외부 전자 장치에 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 프로세서는 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 상기 제2 전력을 전송하는 도중 상기배터리의 전압, 상기 전자 장치의 발열 온도, 상기 외부 전자 장치로부터의 요청 중 적어도 하나에 기반하여 제2 충전 타입에서 제1 충전 타입으로 전환하고, 상기 제1 충전 회로를 이용하여 상기 고정된 제1 전압를 기반으공개특허 10-2022-0124488-3-로 상기 제1 전력을 상기 외부 전자 장치에 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 프로세서는 상기 제2 충전 타입의 지원이 가능한 경우 상기 외부 전자 장치의 고속 충전 지원 여부를 더확인하고,상기 고속 충전이 지원되는 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 고속 충전 전압으로 상기 제2 전력을 제공하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 프로세서는 상기 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반하여, 상기 PDIC를 통해상기 외부 전자 장치에 BCD 정보를 전송하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 프로세서는 상기 전자 장치의 역할이 sink로 결정된 상태에서 상기 외부 전자 장치로부터 상기 제1 충전타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압을 기반으로 제3 전력을 수신하고, 상기 수신된 제3 전력을 이용하여 상기 배터리를 충전하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 프로세서는 상기 전자 장치의 역할이 sink로 결정된 상태에서 상기 외부 전자 장치로부터 상기 제2 충전타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압을 기반으로 제4 전력을 수신하고, 상기 수신된 제4 전력을 이용하여 상기 배터리를 충전하도록 설정된전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 프로세서는 상기 수신된 제4 전력을 이용하여 상기 배터리 충전 중 상기 배터리 충전 상태가 완충 상태이거나, 상기 전자 장치의 소모 전류가 지정된 소모 전류 이상이거나, 상기 전자 장치의 발열 온도가 지정된 온도이상이면 상기 PDIC를 이용하여 상기 제2 충전 타입을 상기 제1 충전 타입으로 전환하기 위한 요청을 상기 외부전자 장치에 송신하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 제1 충전 회로는 PMIC(power management integrated chip)을 포함하고, 상기 제2 충전 회로는공개특허 10-2022-0124488-4-DCIC(direct charger integrated chip)을 포함하는 전자 장치."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에서 PD(power delivery) 기반 전력 송신 방법에 있어서,USB 커넥터를 통해 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는동작; 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전타입의 제1 충전 회로를 이용하여 고정된 제1 전압을 기반으로 제1 전력을 상기 외부 전자 장치에 전송하는 동작; 및상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 타입의 제2 충전 회로를 이용하여상기 외부 전자 장치와 협상된 제2 전압을 기반으로 제2 전력을 상기 외부 전자 장치에 전송하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 전자 장치의 PDIC를 통해 상기 외부 전자 장치로부터 BCD(binary coded decimal) 정보를 수신하는 동작;및상기 BCD 정보에 기반하여 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 외부 전자 장치가 제1 충전 타입 및 상기 제2 충전 타입을 지원하고, 상기 배터리의 전압이 지정된 전압보다 높거나 상기 배터리의 충전량이 지정된 충전량 보다 많은 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압을 기반으로 상기 제2 전력을 상기 외부 전자 장치에 전송하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서, 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 상기 제2 전력을 전송하는 도중 상기 배터리의 전압, 상기 전자 장치의 발열 온도, 상기 외부 전자 장치로부터의 요청 중 적어도 하나에 기반하여 충전 타입을 제2 충전 타입에서 제1 충전 타입으로 전환하고, 상기 제1 충전 회로를 이용하여 상기 고정된 제1 전압을 기반으로 상기 제1 전력을 상기 외부 전자 장치에 전송하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 제2 충전 타입의 지원이 가능한 경우 상기 외부 전자 장치의 고속 충전 지원 여부를 확인하는 동작; 및상기 고속 충전이 지원되는 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 고속 충전 전압으로 상기 제2 전력을 전송하는 동작을 더 포함하는 방법.공개특허 10-2022-0124488-5-청구항 16 전자 장치에서 PD(power delivery) 기반 전력 수신 방법에 있어서,USB 커넥터를 통해 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반하여, 상기 외부 전자 장치에 BCD 정보를 전송하는 동작; 및상기 외부 전자 장치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압을 기반으로 제3 전력을 수신하거나,상기 외부 전자 장치로부터 상기 제2 충전 타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압을 기반으로 제4 전력을 수신하는 동작을 포함하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 수신된 제3 전력 또는 제4 전력을 이용하여 상기 배터리를 충전하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 수신된 제4 전력을 이용하여 상기 배터리 충전 중 상기 배터리 충전 상태가 완충 상태이거나, 상기 전자장치의 소모 전류가 지정된 소모 전류 이상이거나, 상기 전자 장치의 발열 온도가 지정된 온도 이상이면 PD 통신을 이용하여 상기 제2 충전 타입을 상기 제1 충전 타입으로 전환하기 위한 요청을 상기 외부 전자 장치에 송신하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도하나의 동작은, USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작; 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전타입의 제1 충전 회로를 이용하여 고정된 제1 전압을 기반으로 제1 전력을 상기 외부 전자 장치에 전송하는 동작; 및상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 타입의 제2 충전 회로를 이용하여상기 외부 전자 장치와 협상된 제2 전압을 기반으로 제2 전력을 상기 외부 전자 장치에 전송하는 동작을 포함하는 저장 매체."}
{"patent_id": "10-2021-0028187", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도하나의 동작은, USB 커넥터를 통해 상기 외부 전자 장치가 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에공개특허 10-2022-0124488-6-기반하여, 상기 외부 전자 장치에 BCD 정보를 전송하는 동작; 및상기 외부 전자 장치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압을 기반으로 제3 전력을 수신하거나,상기 외부 전자 장치로부터 상기 제2 충전 타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압을 기반으로 제4 전력을 수신하는 동작을 포함하는 저장매체."}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는 배터리, USB(universal serial bus) 커넥터, 상기 USB 커넥터와 연결되어 외부 전자 장치와 PD(power delivery) 통신을 수행하는 PDIC(power delivery integrated chip), 제1 충전 타입 에 대응된 제1 충전 회로, 제2 충전 타입에 대응된 제2 충전 회로, 및 상기 USB 커넥터, 상기 PDIC, 상기 제1 충 (뒷면에 계속)"}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은 전자 장치의 충전에 관한 것이다."}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 휴대폰, MP3 플레이어, PMP(Portable Multimedia Player), 태블릿 PC, 갤럭시 탭, 스마트폰, 아이패드 및 전자책 단말기와 다양한 전자 장치가 사용자에게 제공되고 있으며, 사용자는 이러한 다양한 전자 장치를 휴대하 면서 다양한 콘텐츠를 접할 수 있다. 전자 장치는 재충전 가능한 배터리를 포함함으로써, 별도의 외부 전원을 제공받지 않더라도 사용자는 지정된 시간 동안 전자 장치를 사용할 수 있다. 전자 장치는 다양한 충전 방식(예: 유선 충전 방식 또는 무선 충전 방식)으로 외부 전자 장치로부터 전력을 제공받아 배터리를 재충전할 수 있다. 전자 장치는 인터페이스 장치 예컨대 커넥터(connector)를 통해 다양한 외부 전자 장치와 연결될 수 있으며, 외 부 전자 장치와 연결을 통해 전력을 제공받을 수 있다."}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는 USB(universal serial bus) 커넥터(예: USB 타입 C 커넥터)를 구비하고, USB 커넥터를 통해 스마 트폰, 컴퓨터, 노트북, 충전기, 메모리, 선풍기 등의 배터리를 포함하는 외부 전자 장치와 연결되어 외부 전자 장치와 충전을 위한 전력을 송신 또는 수신할 수 있다. 전자 장치는 외부 전자 장치와 충전을 위한 전력의 송신 또는 수신을 위해 지정된(또는 고정된) 제1 전압(및/또 는 제1 전류)(예: OTG(on the go) 기반의 고정된 전압 및/또는 전류)을 이용할 수 있다. 이와 같이 전자 장치가 외부 전자 장치와 고정된 제1 전압(및/또는 제1 전류)을 이용하여 전력을 송신 또는 수신할 경우, 전자 장치 및 /또는 외부 전자 장치의 충전 성능, 배터리 충전량, 및/또는 발열 등에 따른 충전 효율 저하를 방지하지 못할 수 있다. 다양한 실시예에 따르면 외부 전자 장치와 충전을 위한 전력의 송신 또는 수신 시 전압(및/또는 전류)을 PD(power delivery) 통신을 이용하여 전자 장치 및/또는 외부 전자 장치의 충전 성능, 배터리 충전량, 및/또는 발열에 기반하여 적절한 전압(및/또는 전류)으로 변경함으로써 충전 효율을 높일 수 있는 전자 장치 및 전자 장 치에서 PD 기반 충전 방법을 제공할 수 있다."}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따르면, 배터리, USB(universal serial bus) 커넥터, 상기 USB 커넥터와 연결되어 외부 전자 장치와 PD(power delivery) 통신을 수행하는 PDIC(power delivery integrated chip), 제1 충전 타입에 대응된 제1 충전 회로, 제2 충전 타입에 대응된 제2 충전 회로, 및 상기 USB 커넥터, 상기 PDIC, 상기 제1 충전 회로, 및 상기 제2 충전 회로와 작동적으로 연결된 프로세서를 포함하고, 상기 프로세서는 상기 USB 커넥터를 통해 상 기 외부 전자 장치와 연결 시 상기 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하고, 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 회로를 이용 하여 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 상기 제1 전력을 상기 외부 전자 장치에 전송하고, 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장 치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 상기 제2 전력을 상기 외부 전자 장치에 전송하도록설정될 수 있다. 다양한 실시예에 따르면, 전자 장치에서 PD(power delivery) 기반 전력 송신 방법은 USB 커넥터를 통해 상기 외 부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작, 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 타입의 제1 충전 회로를 이용하여 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제1 전력을 상기 외부 전자 장치에 전송하는 동작, 및 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 타입의 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 제2 전압(및/또는 제2 전류)를 기반으로 제2 전력을 상기 외부 전자 장 치에 전송하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 PD(power delivery) 기반 전력 수신 방법은 USB 커넥터를 통해 상기 외 부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반하여, 상기 외부 전자 장치에 BCD 정보를 전송하는 동작, 및 상기 외부 전자 장치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전 압(및/또는 제1 전류)를 기반으로 제3 전력을 수신하거나, 상기 외부 전자 장치로부터 상기 제2 충전 타입에 기 반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압(및 /또는 제2 전류)를 기반으로 제4 전력을 수신하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작, 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 타입의 제1 충전 회로를 이용하여 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제1 전력을 상기 외부 전자 장치에 전송하는 동작, 및 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 타입의 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 제2 전압(및/또는 제2 전류)를 기반으로 제2 전력을 상기 외부 전자 장치에 전송하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반하여, 상기 외부 전자 장치에 BCD 정보를 전송하는 동작, 및 상 기 외부 전자 장치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제3 전 력을 수신하거나, 상기 외부 전자 장치로부터 상기 제2 충전 타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 제4 전력을 수신하는 동작을 포함할 수 있다."}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따르면 전자 장치는 외부 전자 장치와 충전을 위한 전력의 송신 또는 수신 시 전압(및/또는 전 류)을 PD 통신을 이용하여 전자 장치 및/또는 외부 전자 장치의 충전 성능, 배터리 충전량, 및/또는 발열에 기 반하여 적절한 전압으로 변경함으로써 충전 효율을 높일 수 있다. 예를 들면, 전자 장치는 외부 전자 장치와 충전 시 제1 충전 회로를 이용하여 지정된 제1 전압(및/또는 제1 전 류)으로 제1 전력 전송 중 전자 장치 및/또는 외부 전자 장치의 충전 성능이 고속 충전 지원, 배터리 충전량이 지정된 충전량 이상, 및/또는 발열 온도가 지정된 온도 미만인 것에 기반하여 제1 충전 회로 대신 제2 충전 회 로를 통해 고정된 제1 전압(및/또는 제1 전류)이 아닌 협상된 제2 전압(및/또는 제2 전류)로 제2 전력을 전송함 으로써 충전 효율을 높일 수 있다. 예를 들면, 전자 장치는 외부 전자 장치와 충전 시 제2 충전 회로를 이용하여 협상된 제2 전압(및/또는 제2 전 류)으로 제2 전력 전송 중 전자 장치 및/또는 외부 전자 장치의 충전 상태, 배터리 충전량이 지정된 충전량 미 만, 및/또는 발열 온도가 지정된 온도 이상인 것에 기반하여 제2 충전 회로 대신 제1충전 회로를 통해 고정된 제1 전압(및/또는 제1 전류)로 제1 전력을 전송함으로써 충전 효율을 높일 수 있다.본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0028187", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명의 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 일반적으로 사용되는 사전에 정 의된 용어들은 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미를 가지는 것으로 해석될 수 있으며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따 라서, 본 문서에서 정의된 용어일지라도 본 발명의 실시예들을 배제하도록 해석될 수 없다. 도 1은 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입 력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자11)가 생략되거나, 하나 이상의 다른 구성요소가 추가 될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 1eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 일 실시예에 따른 전자 장치와 외부 전자 장치의 PD 동작을 설명하기 위한 개략적인 도면이다. 도 2를 참조하면, 일 실시예에 따른 전자 장치(이하, 제1 전자 장치라고 칭할 수도 있음)는 인터페이스 장 치(예: 커넥터, 또는 USB(universal serial bus) 커넥터(예: USB 타입 C 커넥터))를 통해 외부 전자 장치 (이하, 제2 전자 장치라고 칭할 수도 있음)와 연결될 수 있다. 일 실시예에 따르면 전자 장치와 외부 전자 장치는 USB PD(power delivery)(예: USB PD 3.0 규격) 프로토콜을 이용하여 각각 소스(source)(또는 호스트(host)) 또는 싱크(sink)(또는 클라이언트(client))로 동작 할 수 있다. 일 실시예에 따르면, 전자 장치가 소스 장치로 동작하고, 외부 전자 장치가 싱크 장치로 동작하거나, 전자 장치가 싱크 장치로 동작하고, 외부 전자 장치가 소스 장치로 동작할 수 있다. 예 를 들면, 소스 장치는 전원의 역할을 하는 장치 또는 전력을 송신하는 장치일 수 있고, 싱크는 전원을 공급받는 장치 또는 전력을 수신하는 장치일 수 있다. 일 실시예에 따른 전자 장치와 외부 전자 장치는 USB PD 프로토콜을 이용하여 전력 전송을 위한 전압 및/또는 전류 크기를 협상할 수 있으며, 최대 100W(예: 20V, 5A)의 전력을 송수신할 수 있다. 일 실시예에 따르면 전자 장치와 외부 전자 장치는 각각 연결 단자(예: 도 1의 연결 단자(예: USB 타입 C 포트(예: USB 타입 C 리셉터클 또는 USB 타입 C 플러그))를 포함할 수 있다. 일 실시예에 따르면 전 자 장치와 외부 전자 장치 각각의 연결 단자가 인터페이스 장치를 통해 연결됨에 기반하여 전자 장치와 외부 전자 장치간에 USB PD 프로토콜(또는 PD 동작)이 개시될 수 있다. 도 3은 일 실시예에 따른 연결 단자를 나타낸 도면이다. 도 3을 참조하면, 일 실시예에 따른 연결 단자(예: 도 1의 연결 단자는 USB 타입 C 포트(예: USB 타 입 C 리셉터클 또는 USB 타입 C 플러그)를 포함할 수 있다. 일 실시예에 따른 연결 단자는 A면과 B면에 각각 12개의 핀(단자)을 포함할 수 있다. A면의 12개의 핀은 GND(A1), SSTXp1(A2), SSTXn1 (A3), VBUS(A4), CC(A5), Dp1(A6), Dn1(A7), SBU1(A8), VBUS(A9), SSRXn2 (A10), SSRXp2 (A11), GND(A12)를 포함할 수 있다. B면의 12개의 핀은 GND(B1), SSTXp2(B2), SSTXn2(B3), VBUS(B4), CC(B5), Dp1(B6), Dn1(B7), SBU2(B8), VBUS(B9), SSRXn1(B10), SSRXp1(B11), GND(B12)를 포함할 수 있다. 일 실시예에 따른 전자 장치와 외부 전자 장치 각각은 CC(A5)(또는 CC(B5)) 핀을 통해 PD 통신 또는 PPS 통신을 수행할 수 있고, VBUS(A4)(또는 VBUS(B4)) 핀을 통해 전력을 송수신할 수 있고, Dp1(A6) 핀 및 Dn1(A7) 핀(또는 Dp1(B6) 핀 및 Dn1(B7) 핀)을 통해 데이터를 송수신할 수 있다. 도 4는 일 실시예에 따른 전자 장치의 블록도이다. 도 4를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치)는 연결 단자(예: 도 1의 연결 단자, 또는 도 3의 연결 단자), 인터페이스(예: 도 1의 인터페이스), 프로세서 (예: 도 1의 프로세서), 전력 관리 모듈(예: 도 1의 전력 관리 모듈), 배터리(예: 도 1의 배터리)를 포함할 수 있다. 일 실시예에 따른 전자 장치는 도 1의 전자 장치에 포함된 적어도 하나의 구성 요소를 더 포함할 수 있다. 일 실시예에 따른 연결 단자는 USB 타입 C 커넥터(예: USB 타입 C 포트)를 포함할 수 있다. 일 실시예에 따르면 USB 타입 C 포트는 소스 또는 싱크 역할에 따라 다운스트림 방향 포트(DFP: downstream facing port) 또는 업스트림 방향 포트(UFP: upstream facing port)로 이용되거나, DFP 및 UFP 기능을 모두 가진 이중 역할 데이터 포트(DRD: dual role data port)로 이용될 수 있다. 예를 들면, USB 타입 C 포트는 USB 타입 C 리셉터 클 또는 USB 타입 C 플러그 형태일 수 있다. 일 실시예에 따른 인터페이스는 전자 장치가 외부 전자 장치와 연결되기 위해 사용될 수 있는 USB 인터페이스 회로를 포함할 수 있다. USB 인터페이스 회로는 USB 프로토콜(예: USB 2.0, USB 3.1, 및/또는 다른 버전의 USB 프로토콜)을 지원할 수 있다. 일 실시예에 따르면 USB 인터페이스 회로는 PDIC(power delivery integrated chip) 및 MUIC(mux integrated chip)를 포함할 수 있다. 일 실시예에 따르면 PDIC는 연결 단자의 CC(configuration channel) 핀 및 프로세서와 각각 연 결될 수 있다. 일 실시예에 따르면 PDIC는 CC 라인(472-1)을 통해 외부 전자 장치와의 USB 타입 C 기 반의 연결을 검출할 수 있다. 일 실시예에 따르면 PDIC는 외부 전자 장치와 USB 타입 C 기반의 연결 시 프로세서의 제어에 기반하여 CC 라인(472-1)을 통해 PD(power delivery)(예: PD0) 통신(또는 PD 프로 토콜 기반 통신) 또는 PPS(programmable power supply)(예: PD3) 통신(또는 PPS 프로토콜 기반 통신)을 수행할 수 있다. 예를 들면, PDIC는 PD 통신 시 BMC(biphase mark code, 또는 2 위상 마크 코드) 인코딩 방식을 이용할 수 있다. 일 실시예에 따르면 MUIC는 연결 단자의 Dp1(또는 D+) 핀 및/또는 Dn1(또는 D-) 핀과 연결될 수 있고, 프로세서(예: AP_D+ 핀 및 AP_D- 핀)와 연결될 수 있다. 일 실시예에 따르면 MUIC는 Dp1(또는 D+) 핀 및/또는 Dn1(또는 D-) 핀의 입력을 전달 받아 먹싱(muxing)하여 프로세서로 출력할 수 있다. 일 실 시예에 따르면 MUIC는 프로세서의 제어에 기반하여 전자 장치와 외부 전자 장치가 전력 송 수신 중 전자 장치와 외부 전자 장치 사이에 데이터 송수신을 수행할 수 있다. 일 실시예에 따른 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있고, 배터리를 충 전하는 적어도 하나의 충전 회로를 포함할 수 있다. 예를 들면, 전력 관리 모듈은 제1 충전 회로(예: PMIC(power management IC)(또는 IF PMIC(interface power management IC)) 및 제2 충전 회로(예: direct charger IC)를 포함할 수 있다. 일 실시예에 따른 전력 관리 모듈은 OVP IC(over voltage protection integrated chip)을 더 포함할 수 있다. 일 실시예에 따르면, 제1 충전 회로는 source로 동작 시 배터리로부터의 전력을 이용하여 OTG 기능 기반의 제1 전력을 제공할 수 있고, sink로 동작 시 OTG 기능 기반의 제3 전력을 수신하여 배터리를 충전 할 수 있다. 일 실시예에 따르면, 제2 충전 회로는 source로 동작 시 배터리로부터의 전력을 이용하여 reverse boosting 기능을 이용하여 전자 장치와 외부 전자 장치간에 협상된 제2 전력을 제공할 수 있고, sink로 동작 시 외부로부터 수신된 제 4전력을 voltage divider(예: 2:1 voltage divider) 기능을 이용 하여 배터리를 충전할 수 있다. 일 실시예에 따르면 프로세서는 PDIC를 통해 외부 전자 장치의 연결을 확인하고, 전자 장치 와 외부 전자 장치간의 전력 프로필을 교환을 수행할 수 있다. 예를 들면, 프로세서는 PDIC를 통해 전자 장치와 외부 전자 장치 각각이 얼마만큼의 전력(또는 전압 및 전류)를 줄 수 있고 필요로 하는지 교환할 수 있다. 예를 들면, 프로세서는 두 장치의 전력 프로필을 교환에 의해 전자 장치의 역할(role)을 source 또는 sink로 결정할 수 있다. 전자 장치의 역할이 source로 결정된 경 우 외부 전자 장치의 역할은 sink로 결정될 수 있고, 전자 장치의 역할이 sink로 결정된 경우 외부 전자 장치의 역할은 source로 결정될 수 있다. 일 실시예에 따른 프로세서는 전자 장치가 source로 결정된 경우 PDIC를 통해 BMC 인코딩을 이 용하여 외부 전자 장치에 source capability message(예: 제1 source capability message)를 전송할 수 있다. 예를 들면, 제1 source capability message는 제1 충전 타입에 대응된 제1 PDO(power data object)(예: FPDO(fixed power data object)값을 포함할 수 있다. 예를 들면, 제1 충전 타입은 OTG 기반의 고정된 제1 전압 (및/또는 제1 전류)으로 제1 충전 회로(예: PMIC(power management IC)(또는 IF PMIC(interface power management IC))를 이용하여 제1 전력을 전송하는 타입일 수 있다. 예를 들면, 제1 전압 및/또는 제1 전류는 5V 및/또는 500mA, 9V 및/또는 500mA, 또는 OTG 기반의 고정된 전압 및/또는 고정된 전류를 포함할 수 있다. 외부 전자 장치에 제1 source capability message가 전달됨에 따라 전자 장치와 외부 전자 장치간에 제1 PD contract가 이루어질 수 있다. 일 실시예에 따른 프로세서는 제1 PD contract 후, PDIC를 통해 외부 전자 장치로부터 외부 전 자 장치와 연관된 정보를 수신할 수 있다. 외부 전자 장치와 연관된 정보는 BCD(binary coded decimal) 정보를 포함할 수 있다. 예를 들면, BCD 정보는 제1 충전 회로(PMIC: power management IC) 정보, 제 2 충전 회로(DCIC: direct charger IC) 정보, 및/또는 고속 충전 여부 정보를 포함할 수 있다. 일 실시예에 따 른 프로세서는 제1 충전 회로 정보, 제2 충전 회로 정보, 및/또는 고속 충전 여부 정보를 이용하여 외부 전자 장치의 제2 충전 타입 지원 여부를 확인할 수 있다. 예를 들면, 제2 충전 타입은 전자 장치와 외부 전자 장치간에 협상된(negotiated) 제2 전압(및/또는 제2 전류)으로 제2 충전 회로의 reverse boosting 기능을 이용하여 제2 전력을 전송하는 타입일 수 있다. 일 실시예에 따른 프로세서는 외부 전자 장치의 제2 충전 타입 지원 여부를 확인 결과, 외부 전자 장 치가 제2 충전 타입을 지원하지 않고, 제1 충전 타입만을 지원하는 경우 제1 충전 타입에 기반하여 OTG 기 반의 고정된 제1 전압(및/또는 제1 전류)으로 제1 충전 회로를 이용하여 제1 전력의 전송을 지속할 수 있다. 일 실시예에 따른 프로세서는 외부 전자 장치가 제2 충전 타입을 지원하는 경우 전자 장치의 배 터리 전압 또는 배터리 충전량을 확인하고, 배터리 전압이 지정된 전압보다 높거나 배터리 충전량이 지정된 충 전량보다 많으면, 충전 타입을 제1 충전 타입에서 제2 충전 타입으로 변경하고, 외부 전자 장치에 source capability message(예: 제2 source capability message)를 전송할 수 있다. 예를 들면, 제2 source capability message는 제2 충전 타입에 대응된 제2 PDO(예: APDO(Augmented power data object))값을 포함할 수 있다. 외부 전자 장치에 제2 source capability message가 전달됨에 따라 전자 장치와 외부 전자 장치간에 협상을 통해 제2 전압(및/또는 제2 전류)가 결정되는 제2 PD contract가 이루어질 수 있다. 예를 들면, 제2 전압(및/또는 제2 전류)은 전자 장치와 외부 전자 장치간에 협상을 통해 일반 충전 전압 (및/또는 일반 충전 전류), 고속 충전 전압(및/또는 고속 충전 전류), 또는 허용 범위의 다른 전압(및/또는 전 류)로 결정될 수 있다. 일 실시예에 따른 프로세서는 제2 PD contract에 기반하여 제2 전압(및/또는 제2 전류)으로 제2 충전 회로 (예: direct charger IC)의 reverse boosting 기능을 이용하여 제2 전력을 전송할 수 있다. 일 실시예에 따른 프로세서는 제1 충전 타입에 기반하여 OTG 기반의 고정된 제1 전압(또는 제1 전압 및 제 1 전류)으로 제1 충전 회로를 이용하여 제1 전력을 전송하는 경우, PDIC를 통해 PD 통신(또는 FPDO(fixed power data object) 통신)을 수행할 수 있다. 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 협 상된 제2 전압(및/또는 제2 전류)으로 제2 충전 회로의 reverse boosting 기능을 이용하여 제2 전력을 전송하는 경우, PDIC를 통해 PPS 통신을 수행하거나, variable PDO, battery PDO를 이용한 통신을 수행할 수 있다.일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제2 전력을 전송하는 도중 배터리의 전압, 전자 장치의 발열 온도, 및/또는 외부 전자 장치로부터의 요청에 기반하여 충전 타입을 제2 충전 타 입에서 제1 충전 타입으로 전환(또는 변경)할 수 있다. 일 실시예에 따른 프로세서는 제2 충전 타입에 기 반하여 제2 전력을 전송하는 도중 배터리의 전압이 지정된 전압(예: 3.8V) 이하이거나 전자 장치의 발열 온도가 지정된 온도 이상이거나 외부 전자 장치로부터의 충전 타입 전환 요청이 있는 경우 제2 충전 타입에서 제1 충전 타입으로 전환할 수 있다. 예를 들면, 프로세서는 제2 충전 타입에서 제1 충전 타입으 로 전환됨에 따라 PD 통신을 통해 외부 전자 장치에 source capability message(예: 제3 source capability message)를 전송할 수 있다. 예를 들면, 제3 source capability message는 제1 충전 타입에 대응된 제3 PDO(예: FPDO)값을 포함할 수 있다. 외부 전자 장치에 제3 source capability message가 전달됨에 따 라 전자 장치와 외부 전자 장치간에 전력 전송을 위한 전압이 다시 제1 전압(및/또는 제1 전류)로 결 정되는 제3 PD contract가 이루어질 수 있다. 예를 들면, 제2 source capability message는 Source PDO Number 값으로 5V/500mA 및 9V/1A를 포함할 수 있고, 배터리의 전압이 지정된 전압 이하이거나 전자 장치의 발열 온도가 지정된 온도 이상이거나 외부 전 자 장치로부터의 요청이 있는 경우 제3 source capability message는 Source PDO Number 값으로 5V/500mA 만 포함할 수 있다. 다른 예를 들면, 제2 source capability message는 Source PDO Number 값으로 5V/500mA 및 9V/1.2A를 포함할 수 있고, 배터리의 전압이 지정된 전압 이하이거나 전자 장치의 발열 온도가 지정 된 온도 이상이거나 외부 전자 장치로부터의 요청이 있는 경우 제3 source capability message는 Source PDO Number 값으로 5V/500mA 및 9V/800mA를 포함할 수 있다. 또 다른 예를 들면, 제2 source capability message는 Source PDO Number 값으로 5V/500mA를 포함하고 APDO값으로 3.3~11V/1A를 포함할 수 있고, 배터리 의 전압이 지정된 전압 이하이거나 전자 장치의 발열 온도가 지정된 온도 이상이거나 외부 전자 장치 로부터의 요청이 있는 경우 제3 source capability message는 Source PDO Number 값으로 5V/500mA 및 9V/800mA를 포함할 수 있다. 또 다른 예를 들면, 프로세서는 제2 source capability message 및 제3 source capability message 대신 VDM(vendor data messages) 또는 UVDM(unstructured vendor data message)을 이용하여 충전 타입이 제2 충전 타입에서 제1 충전 타입으로 변경됨에 따른 전압(또는 전류)값이 전달되도록 할 수도 있다. 예를 들면 VDM 또는 UVDM는 제조사에 의해 지정된 데이터 메시지일 수 있다. 일 실시예에 따른 프로세서는 전자 장치가 sink로 결정된 경우 외부 전자 장치로부터 PDIC(47 2)를 통해 BMC 인코딩을 이용한 source capability message(예: 제1 source capability message)를 수신할 수 있다. 예를 들면, 제1 source capability message는 제1 충전 타입에 대응된 제1 PDO(power data object)(예: FPDO(fixed power data object))값을 포함할 수 있다. 예를 들면, 제1 충전 타입은 OTG 기반의 고정된 제1 전 압(및/또는 제1 전류)으로 제1 충전 회로((예: PMIC(power management IC) 또는 (IF PMIC(interface power management IC))를 이용하여 제3 전력을 전송하는 타입일 수 있다. 예를 들면, 제1 전압 및/또는 제1 전류는 5V 및/또는 500mA, 9V 및/또는 500mA, 또는 OTG 기반의 지정된 전압 및/또는 지정된 전류를 포함할 수 있다. 전자 장치는 제1 source capability message가 수신됨에 따라 전자 장치와 외부 전자 장치간에 제1 PD contract가 이루어질 수 있다. 제1 PD contract에 기반하여 전자 장치는 제1 충전 회로를 이용하여 외 부 전자 장치로부터 제1 전압(및/또는 제1 전류)의 제3 전력을 수신하여 배터리를 충전할 수 있다. 일 실시예에 따른 프로세서는 제1 PD contract 후, PDIC를 통해 외부 전자 장치에 전자 장치 와 연관된 정보를 송신할 수 있다. 전자 장치와 연관된 정보는 BCD(binary coded decimal) 정보를 포함할 수 있다. 예를 들면, BCD 정보는 제1 충전 회로(PMIC: power management IC) 정보, 제2 충전 회로 (DCIC: direct charger IC) 정보, 및/또는 고속 충전 여부 정보를 포함할 수 있다. 일 실시예에 따른 프로세서 는 전자 장치가 제2 충전 타입을 지원하지 않고, 제1 충전 타입만을 지원하는 경우 제1 충전 타입에 기반하여 OTG 기반의 고정된 제1 전압(및/또는 제1 전류)으로 제1 충전 회로를 이용한 제3 전력의 수신을 지속 할 수 있다. 일 실시예에 따른 프로세서는 전자 장치가 제2 충전 타입을 지원하고, 외부 전자 장치 로부터 충전 타입을 제1 충전 타입에서 제2 충전 타입으로 변경함에 따른 source capability message(예: 제2 source capability message)가 수신됨에 따라 외부 전자 장치와의 협상을 통해 제2 전압(및/또는 제2 전류)를 결정하는 제2 PD contract를 수행할 수 있다. 예를 들면, 제2 전압(및/또는 제2 전류)은 전자 장치 와 외부 전자 장치간에 협상을 통해 일반 충전 전압(및/또는 일반 충전 전류), 고속 충전 전압(및/또 는 고속 충전 전류), 또는 허용 범위의 다른 전압(및/또는 전류)로 결정될 수 있다. 일 실시예에 따른 프로세서는 제2 PD contract에 기반하여 제2 전압(및/또는 제2 전류)으로 제2 충전 회로 (예: direct charger IC)를 이용하여 제4 전력을 수신할 수 있고, 수신된 제4 전력을 이용하여 배터리를충전할 수 있다. 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제4 전력을 수신하는 도중 배터리가 완충되 는 경우 외부 전자 장치에 충전 타입을 제2 충전 타입에서 제1 충전 타입으로 전환하도록 요청할 수 있다. 예를 들면, 프로세서는 PDIC를 통해 Request Data Object 값 9V APDO에서 변경된 Request Data Object 값 5V FPDO를 외부 전자 장치에 전송할 수 있다. 일 실시예에 따른 프로세서는 제1 충전 타입 으로의 전환에 기반하여 제1 전압(및/또는 제1 전류)으로 제1 충전 회로를 이용하여 제3 전력을 수신할 수 있다. 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제4 전력을 수신하는 도중 고속 충전 모드에서 전 자 장치의 소모 전류(예: 시스템 소모 전류)가 지정된 소모 전류 이상이거나 전자 장치의 발열 온도 가 지정된 온도 이상인 경우 외부 전자 장치에 고속 충전 모드에 대응된 전압/전류를 일반 충전 모드에 대 응된 전압/전류로 전환하도록 요청할 수 있다. 예를 들면, 프로세서는 PDIC를 통해 Request Data Object 값 9V/1.2A 에서 변경된 Request Data Object 값 9V/800mA를 외부 전자 장치에 전송할 수 있다. 일 실시예에 따른 프로세서는 전환된 전압/전류에 기반한 전력을 수신하여 배터리를 충전할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)는 배터리(예: 도 1의 배터리, 또는 도 4의 배터리), USB(universal serial bus) 커넥터(예: 도 1의 연결 단자, 또는 도 4의 연결 단자), 상기 USB 커넥터와 연결되어 외부 전자 장치와 PD(power delivery) 통신을 수행 하는 PDIC(power delivery integrated chip)(예: 도 4의 PDIC), 제1 충전 타입에 대응된 제1 충전 회로 (예: 도 4의 제1 충전 회로), 제2 충전 타입에 대응된 제2 충전 회로(예: 도 4의 제1 충전 회로), 및 상기 USB 커넥터, 상기 PDIC, 상기 제1 충전 회로, 및 상기 제2 충전 회로와 작동적으로 연결된 프로세서(예: 도 1의 프로세서, 또는 도 4의 프로세서)를 포함하고, 상기 프로세서는 상기 USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하고, 상기 외부 전자 장치가 상기 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 회로를 이용하여 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 상기 제1 전력을 상기 외부 전자 장치에 전송하고, 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제 2 전압(및/또는 제2 전류)를 기반으로 상기 제2 전력을 상기 외부 전자 장치에 전송하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 PDIC를 통해 상기 외부 전자 장치로부터 BCD(binary coded decimal) 정보를 수신하고, 상기 BCD 정보에 기반하여 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입 의 지원 여부를 확인할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 외부 전자 장치가 제1 충전 타입 및 상기 제2 충전 타입을 지원 하고, 상기 배터리의 전압이 지정된 전압보다 높거나 상기 배터리의 충전량이 지정된 충전량 보다 많은 경우 상 기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 상기 제2 전력을 상기 외부 전자 장치에 전송할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 상기 제2 전 력을 전송하는 도중 상기 배터리의 전압, 상기 전자 장치의 발열 온도, 및/또는 상기 외부 전자 장치로부터의 요청에 기반하여 제2 충전 타입에서 제1 충전 타입으로 전환하고, 상기 제1 충전 회로를 이용하여 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 상기 제1 전력을 상기 외부 전자 장치에 전송할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 제2 충전 타입의 지원이 가능한 경우 상기 외부 전자 장치의 고 속 충전 지원 여부를 더 확인하고, 상기 고속 충전이 지원되는 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 고속 충전 전압(및/또는 고속 충전 전류)로 상기 제2 전력을 제공하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반 하여, 상기 PDIC를 통해 상기 외부 전자 장치에 BCD 정보를 전송하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 전자 장치의 역할이 sink로 결정된 상태에서 상기 외부 전자 장 치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이 용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제3 전력을 수신하고, 상기 수신된 제3 전력을 이용하여 상기 배터리를 충전하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 전자 장치의 역할이 sink로 결정된 상태에서 상기 외부 전자 장 치로부터 상기 제2 충전 타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전 자 장치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 제4 전력을 수신하고, 상기 수신된 제4 전력을 이용하여 상기 배터리를 충전하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 상기 수신된 제4 전력을 이용하여 상기 배터리 충전 중 상기 배터리 충전 상태가 완충 상태이거나, 상기 전자 장치의 소모 전류가 지정된 소모 전류 이상이거나, 상기 전자 장치의 발열 온도가 지정된 온도 이상이면 상기 PDIC를 이용하여 상기 제2 충전 타입을 상기 제1 충전 타입으로 전환하 기 위한 요청을 상기 외부 전자 장치에 송신하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 제1 충전 회로는 PMIC(power management integrated chip)을 포함하고, 상기 제 2 충전 회로는 DCIC(direct charger integrated chip)을 포함할 수 있다. 도 5는 일 실시예에 따른 전자 장치에서 외부 전자 장치와 연결 시 PD 기반 전력 전송 동작을 나타낸 도면이다. 도 5를 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)의 프 로세서(예: 도 1의 프로세서, 도 4의 프로세서)는 510 내지 570 동작 중 적어도 하나의 동작을 수행 할 수 있다. 510 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치의 연결에 기반하여 source 역할을 확인 할 수 있다. 예를 들면, 프로세서는 PDIC를 통해 외부 전자 장치의 연결을 확인하고, 전자 장치 와 외부 전자 장치간의 전력 프로필을 교환을 수행할 수 있다. 예를 들면, 프로세서는 PDIC를 이용한 PD 통신을 통해 전자 장치와 외부 전자 장치 각각이 얼마만큼의 전력(또는 전압 및 전류)를 줄 수 있고 필요로 하는지 교환할 수 있다. 예를 들면, 프로세서는 두 장치의 전력 프로필을 교환에 의해 전자 장치가 전력을 제공하여야 하는 경우 역할(role)을 source로 확인(또는 결정)할 수 있다. 전자 장치의 역할이 source로 결정된 경우 외부 전자 장치의 역할은 sink로 결정될 수 있다. 520 동작에서, 일 실시예에 따른 프로세서는 PDIC를 이용한 PD 통신을 통해 외부 전자 장치에 제1 충전 타입에 대응된 제1 PDO(power data object)(예: FPDO(fixed power data object))를 전송할 수 있다. 예를 들면, 제1 충전 타입에 대응된 제1 PDO는 source capability message(예: 제1 source capability message)를 이용하여 전송될 수 있다. 예를 들면, 제1 충전 타입은 OTG 기반의 고정된 제1 전압(및/또는 제1 전 류)으로 제1 충전 회로(예: PMIC(power management IC)(또는 IF PMIC(interface power management IC))를 이용하여 제1 PDO 기반의 제1 전력을 전송하는 타입일 수 있다. 예를 들면, 제1 전압(및/또는 제1 전류)는 5V 및/또는 500mA, 9V 및/또는 500mA, 또는 OTG 기반의 다른 고정된 전압 및/또는 고정된 전류를 포함할 수 있다. 외부 전자 장치에 제1 source capability message가 전달됨에 따라 전자 장치와 외부 전자 장치 간에 제1 PD contract가 이루어질 수 있다. 530 동작에서, 일 실시예에 따른 프로세서는 PDIC를 이용한 PD 통신을 통해 외부 전자 장치로부 터 BCD(binary coded decimal) 정보를 수신할 수 있다. 예를 들면, BCD 정보는 제1 충전 회로(PMIC: power management IC) 정보, 제2 충전 회로(DCIC: direct charger IC) 정보, 및/또는 고속 충전 여부 정보를 포함할 수 있다. 일 실시예에 따른 프로세서는 외부 전자 장치로부터 외부 전자 장치와 연관된 정보를 수신하고 외부 전자 장치와 연관된 정보로부터 BCD 정보를 확인할 수 있다. 예를 들면, 외부 전자 장치와 연관 된 정보는 하기 표 1과 같을 수 있다. 표 1 No. Vendor P/N BCD Device IF PMICVersionDC ICVersion 1 A A01 01 01 - - A02 02 01 - - 2 B B01 03 01 - - B02 04 01 - - B03 05 01 - - B04 06 01 - - B05 07 01 - - B06 08 01 - - 3 C C01 09 01 - -C02 10 01 - - C03 - - 01 01 C04 - - 02 01 4 D D01 11 01 - - D02 12 01 - - D03 - - 03 01 5 E E01 13 01 - - 6 F E02 14 01 - - 7 G E03 - - 04 01 상기 표 1을 참조하면, 외부 전자 장치와 연관된 정보는 제조사(vendor), 부품 번호(P/N:part number), 및 BCD 정보(BCD Device)를 포함할 수 있다. BCD 정보(BCD Device)는 IF PMIC 값, IF PMIC의 버전값, DC IC값, DC IC의 버전값, 및 고속 충전 여부를 포함할 수 있다. 일 실시예에 따른 프로세서는 외부 전자 장치와 연 관된 정보로부터 외부 전자 장치의 제1 충전 회로 정보(예: IF PMIC 값 및 IF PMIC의 버전값), 제2 충전 회로 정보(예: DC IC값 및 DC IC의 버전값), 및/또는 고속 충전 여부 정보(DC IC값 및 DC IC의 버전값을 기반으 로 식별될 수도 있음)를 확인할 수 있다. 540 동작에서, 일 실시예에 따른 프로세서는 제1 충전 회로 정보, 제2 충전 회로 정보, 및/또는 고속 충전 여부 정보를 이용하여 외부 전자 장치의 제2 충전 타입 지 원 여부를 확인할 수 있다. 예를 들면, 제2 충전 타입은 전자 장치와 외부 전자 장치간에 협상된 (negotiated)(또는 협상에 의해 가변되는) 제2 전압(및/또는 제2 전류)으로 제2 충전 회로(또는 제2 충전 회로의 reverse boosting 기능)를 이용하여 제2 전력을 전송하는 타입일 수 있다. 550 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치가 제2 충전 타입을 지원하지 않는 경우, 제1 충전 타입에 기반하여 제1 충전 회로를 이용하여 제1 전력을 전송할 수 있다. 예를 들면, 프로세서 는 제1 충전 회로를 이용하여 OTG 기반의 고정된 제1 전압(및/또는 제1 전류)으로 제1 전력을 전송할 수 있다. 560 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치가 제2 충전 타입을 지원하는 경우 PDIC를 통해 외부 전자 장치에 제2 충전 타입에 대응된 제2 PDO(power data object(예: APDO(Augmented power data object))를 전송할 수 있다. 일 실시예에 따르면, 프로세서는 외부 전자 장치 가 제2 충전 타입을 지원하는 경우 전자 장치의 배터리 전압 또는 배터리 충전량을 확인하고, 배터리 전압이 지정된 전압보다 높거나 배터리 충전량이 지정된 충전량보다 많은 경우 외부 전자 장치에 제2 충전 타입에 대응된 제2 PDO를 전송할 수 있다. 예를 들면 제2 PDO는 source capability message(예: 제2 source capability message)를 통해 전송될 수 있다. 예를 들면, 제2 충전 타입에 대응된 제2 PDO는 제2 충전 타입에 대응된 제2 전압(및/또는 제2 전류)를 포함할 수 있다. 예를 들면, 제2 전압(및/또는 제2 전류)는 제2 충전 회 로에 의해 제공 가능한 일반 충전 전압(및/또는 일반 충전 전류), 고속 충전 전압(및/또는 고속 충전 전류), 또는 전압(및/또는 전류)의 가능 범위를 포함할 수 있다. 외부 전자 장치에 제2 source capability message가 전달됨에 따라 전자 장치와 외부 전자 장치간에 협상을 통해 제2 전압(및/또는 제2 전류) 가 결정되는 제2 PD contract가 이루어질 수 있다. 예를 들면, 제2 전압(및/또는 제2 전류)은 전자 장치와 외부 전자 장치간에 협상을 통해 일반 충전 전압(및/또는 일반 충전 전류), 고속 충전 전압(및/또는 고속 충전 전류), 또는 가능 범위의 다른 전압(및/또는 전류)로 결정될 수 있다. 570 동작에서, 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제 2 전력을 전송할 수 있다. 예를 들면, 프로세서는 전자 장치와 외부 전자 장치간에 협상을 통해 결정된 제2 전압(및/또는 제2 전류)으로 제2 충전 회로(예: direct charger IC의 reverse boosting 기 능)을 이용하여 제2 전력을 전송할 수 있다. 도 6은 일 실시예에 따른 전자 장치에서 외부 전자 장치에 PD 기반 전력 전송 중 충전 타입 변경 동작을 나타낸 도면이다. 도 6을 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)의 프 로세서(예: 도 1의 프로세서, 도 4의 프로세서)는 610 내지 640 동작 중 적어도 하나의 동작을 수행 할 수 있다. 610 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치에 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제2 전력을 전송할 수 있다. 620 동작에서, 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제 2 전력을 전송하는 도중 외부 전자 장치로부터의 충전 타입 전환(또는 변경) 요청이 있는지 확인할 수 있 다. 일 실시예에 따르면 프로세서는 외부 전자 장치로부터의 충전 타입 전환(또는 변경) 요청이 있는 경우 650 동작을 수행할 수 있다. 630 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치로부터의 배터리의 전압이 지정된 전압 이하인지 확인할 수 있다. 일 실시예에 따르면 프로세서는 외부 전자 장치로부터의 배터리(48 9)의 전압이 지정된 전압 이하인 경우 650 동작을 수행할 수 있다. 640 동작에서, 일 실시예에 따른 프로세서는 전자 장치의 발열 온도가 지정된 온도(예: 38도)이상인 지 확인할 수 있다. 일 실시예에 따르면 프로세서는 전자 장치의 발열 온도가 지정된 온도(예: 38 도)이상인 경우 650 동작을 수행할 수 있다. 650 동작에서, 일 실시예에 따른 프로세서는 충전 타입을 제2 충전 타입에서 제1 충전 타입으로 전환(또는 변경)하고, 제1충전 타입에 기반하여 제1 충전 회로를 이용하여 제1 전력을 외부 전자 장치에 전송할 수 있다. 예를 들면, 프로세서는 제2 충전 타입에서 제1 충전 타입으로 전환됨에 따라 PD 통신을 통해 외부 전자 장 치에 source capability message(예: 제3 source capability message)를 전송할 수 있다. 예를 들면, 제3 source capability message는 제1 충전 타입에 대응된 제3 PDO(예: FPDO)값을 포함할 수 있다. 외부 전자 장치 에 제3 source capability message가 전달됨에 따라 전자 장치와 외부 전자 장치간에 전력 전 송을 위한 전압이 다시 제1 전압(및/또는 제1 전류)로 결정되는 제3 PD contract가 이루어질 수 있다. 예를 들 면, 배터리의 전압이 지정된 전압 이하이거나 전자 장치의 발열 온도가 지정된 온도 이상이거나 외부 전자 장치로부터의 요청이 있는 경우 제3 source capability message는 Source PDO Number 값으로 5V/500mA만 포함할 수 있다. 다른 예를 들면, 배터리의 전압이 지정된 전압 이하이거나 전자 장치의 발열 온도가 지정된 온도 이상이거나 외부 전자 장치로부터의 요청이 있는 경우 제3 source capability message는 Source PDO Number 값으로 5V/500mA 및 9V/800mA를 포함할 수 있다. 또 다른 예를 들면, 배터리 의 전압이 지정된 전압 이하이거나 전자 장치의 발열 온도가 지정된 온도 이상이거나 외부 전자 장치 로부터의 요청이 있는 경우 제3 source capability message는 Source PDO Number 값으로 5V/500mA 및 9V/800mA를 포함할 수 있다. 또 다른 예를 들면, 프로세서는 source capability message 대신 VDM(vendor defined message) 또는 UVDM(unstructured vendor defined message)을 이용하여 충전 타입이 제2 충전 타입에 서 제1 충전 타입으로 변경됨에 따른 전압(또는 전류)값이 전달되도록 할 수도 있다. 예를 들면 VDM 또는 UVDM 는 제조사에 의해 지정된 데이터 메시지일 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)에서 PD(power data) 기반 전력 송신 방법은 USB 커넥터(예: 도 1의 연결 단자, 또는 도 4의 연결단자)를 통해 외부 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 외부 전자 장치)와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작, 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 타입의 제1 충전 회로를 이용하여 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제1 전력을 상기 외부 전자 장치에 전송하는 동작, 및 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 타입의 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 제2 전압 (및/또는 제2 전류)를 기반으로 제2 전력을 상기 외부 전자 장치에 전송하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 전자 장치의 PDIC(예: 도 4의 PDIC)를 통해 상기 외부 전자 장 치로부터 BCD(binary coded decimal) 정보를 수신하는 동작, 및 상기 BCD 정보에 기반하여 상기 제1 충전 타입 의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법에서 상기 외부 전자 장치가 제1 충전 타입 및 상기 제2 충전 타입을 지원하 고, 상기 배터리의 전압이 지정된 전압보다 높거나 상기 배터리의 충전량이 지정된 충전량 보다 많은 경우 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 상기 제 2 전력을 상기 외부 전자 장치에 전송할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치에 상기 제2 전력을 전송하는 도중 상기 배터리의 전압, 상기 전자 장치의 발열 온도, 및/또는 상기 외부 전자 장치로부터의 요청에 기반하여 충전 타입을 제2 충전 타입에서 제1 충전 타입으로 전환하고, 상기 제1 충전 회로를 이용하여 상기 고 정된 제1 전압(및/또는 제1 전류)를 기반으로 상기 제1 전력을 상기 외부 전자 장치에 전송하는 동작을 더 포함 할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 제2 충전 타입의 지원이 가능한 경우 상기 외부 전자 장치의 고속 충전 지원 여부를 확인하는 동작, 및 상기 고속 충전이 지원되는 경우 상기 제2 충전 회로를 이용하여 상기 외 부 전자 장치에 고속 충전 전압(및/또는 고속 충전 전류)로 상기 제2 전력을 전송하는 동작을 더 포함할 수 있 다. 도 7은 일 실시예에 따른 전자 장치에서 외부 전자 장치와 연결 시 PD 기반 전력 수신 동작을 나타낸 도면이다. 도 7을 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)의 프 로세서(예: 도 1의 프로세서, 도 4의 프로세서)는 710 내지 770 동작 중 적어도 하나의 동작을 수행 할 수 있다. 710 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치의 연결에 기반하여 sink 역할을 확인할 수 있다. 예를 들면, 프로세서는 PDIC를 통해 외부 전자 장치의 연결을 확인하고, 전자 장치 와 외부 전자 장치간의 전력 프로필을 교환을 수행할 수 있다. 예를 들면, 프로세서는 PDIC를 이용한 PD 통신을 통해 전자 장치와 외부 전자 장치 각각이 얼마만큼의 전력(또는 전압 및 전류)를 줄 수 있고 필요로 하는지 교환할 수 있다. 예를 들면, 프로세서는 두 장치의 전력 프로필을 교환에 의해 전자 장치가 전력을 수신하여야 하는 경우 역할(role)을 sink로 확인(또는 결정)할 수 있다. 전자 장치의 역할이 sink로 결정된 경우 외부 전자 장치의 역할은 source로 결정될 수 있다. 720 동작에서, 일 실시예에 따른 프로세서는 PDIC를 이용한 PD 통신을 통해 외부 전자 장치로부 터 제1 충전 타입에 대응된 제1 PDO(power data object)(예: FPDO(fixed power data object))를 수신할 수 있 다. 예를 들면, 제1 충전 타입에 대응된 제1 PDO는 source capability message(예: 제1 source capability message)를 이용하여 수신될 수 있다. 예를 들면, 제1 충전 타입은 OTG 기반의 고정된 제1 전압(및/또는 제1 전 류)으로 제1 충전 회로(예: PMIC(power management IC)(또는 IF PMIC(interface power management IC))를 이용하여 제1 PDO 기반의 제3 전력을 수신하는 타입일 수 있다. 예를 들면, 제1 전압(및/또는 제1 전류)는 5V 및/또는 500mA, 9V 및/또는 500mA, 또는 OTG 기반의 다른 고정된 전압 및/또는 고정된 전류를 포함할 수 있다. 외부 전자 장치로부터 제1 source capability message가 수신됨에 따라 전자 장치와 외부 전자 장치 간에 제1 PD contract가 이루어질 수 있다. 730 동작에서, 일 실시예에 따른 프로세서는 PDIC를 이용한 PD 통신을 통해 외부 전자 장치에 BCD 정보를 제공(또는 송신)할 수 있다. 예를 들면, BCD 정보는 제1 충전 회로(PMIC: power management IC) 정 보, 제2 충전 회로(DCIC: direct charger IC) 정보, 및/또는 고속 충전 여부 정보를 포함할 수 있다. 일 실시예 에 따른 프로세서는 외부 전자 장치에 외부 전자 장치와 연관된 정보를 제공하고 외부 전자 장 치와 연관된 정보로부터 BCD 정보가 확인되도록 할 수도 있다. 예를 들면, 외부 전자 장치와 연관된 정보는 제조사(vendor), 부품 번호(P/N:part number), 및 BCD 정보를 포함할 수 있다. BCD 정보는 IF PMIC 값, IF PMIC의 버전값, DC IC값, DC IC의 버전값, 및 고속 충전 여부를 포함할 수 있다. 740 동작에서, 일 실시예에 따른 프로세서는 PDIC를 통해 외부 전자 장치로부터 제2 충전 타입 에 대응된 제2 PDO(power data object(예: APDO(augmented power data object))의 수신을 확인할 수 있다. 외 부 전자 장치는 전자 장치의 제1 충전 회로 정보, 제2 충전 회로 정보, 및/또는 고속 충전 여부 정보 를 이용하여 전자 장치의 제2 충전 타입 지원 여부를 확인하고, 제2 충전 타입이 지원되는 경우 PDIC(47 2)를 통해 외부 전자 장치로부터 제2 충전 타입에 대응된 제2 PDO를 전자 장치로 전송할 수 있다. 750 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치로부터 제2 충전 타입에 대응된 제2 PDO 가 수신되지 않는 경우 제1 PDO에 따라 제1 충전 회로를 이용하여 제3 전력을 수신할 수 있다. 예를 들면, 프로세서는 제1 충전 회로를 이용하여 OTG 기반의 고정된 제1 전압(및/또는 제1 전류)으로 제3 전력 을 수신할 수 있다. 760 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치로부터 제2 충전 타입에 대응된 제2 PDO 가 수신된 경우 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제2 전력(이하 '제4 전력'이라고도 함)을 수신할 수 있다. 예를 들면, 프로세서는 제2 PDO 기반으로 외부 전자 장치간에 협상을 통해 결정된 제2 전압(및/또는 제2 전류)으로 제2 충전 회로를 이용하여 제4 전력을 수신할 수 있다. 770 동작에서, 일 실시예에 따른 프로세서는 수신된 제3 전력 또는 제4 전력을 이용하여 배터리 충전 을 수행할 수 있다. 도 8은 일 실시예에 따른 전자 장치에서 외부 전자 장치로부터 PD 기반 전력 수신 중 충전 타입 변경 동작을 나 타낸 도면이다. 도 8을 참조하면, 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)의 프 로세서(예: 도 1의 프로세서, 도 4의 프로세서)는 810 내지 850 동작 중 적어도 하나의 동작을 수행 할 수 있다. 810 동작에서, 일 실시예에 따른 프로세서는 외부 전자 장치로부터 제2 충전 타입에 기반하여 제2 충 전 회로를 이용하여 제4 전력을 수신할 수 있다. 820 동작에서, 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제 4 전력을 수신하는 도중 배터리 충전 상태가 완충 상태인지 확인할 수 있다. 일 실시예에 따른 프로세서 는 배터리 충전 상태가 완충 상태이면 850 동작을 수행할 수 있다. 830 동작에서, 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제 4 전력을 수신하는 도중 전자 장치의 소모 전류(예: 시스템 소모 전류)가 지정된 소모 전류 이상인지 확인 할 수 있다. 일 실시예에 따른 프로세서는 전자 장치의 소모 전류(예: 시스템 소모 전류)가 지정된 소모 전류 이상이면 850 동작을 수행할 수 있다. 840 동작에서, 일 실시예에 따른 프로세서는 제2 충전 타입에 기반하여 제2 충전 회로를 이용하여 제 4 전력을 수신하는 도중 전자 장치의 발열 온도가 지정된 온도 이상인지 확인할 수 있다. 일 실시예에 따 른 프로세서는 전자 장치의 발열 온도가 지정된 온도 이상이면 850 동작을 수행할 수 있다. 850 동작에서, 일 실시예에 따른 프로세서는 충전 타입을 제2 충전 타입에서 제1 충전 타입으로 전환(또는 변경)하고, 제1 충전 타입에 기반하여 제1 충전 회로를 이용하여 제3 전력을 외부 전자 장치로부터 수신할 수 있다. 예를 들면, 프로세서는 PDIC를 통해 Request Data Object 9V APDO에서 변경된 Request Data Object 5V FPDO를 외부 전자 장치에 전송하고, 외부 전자 장치로부터 5V에 대응된 제3 전력을 수신하여 충전 을 수행할 수 있다. 다른 예를 들면, 프로세서는 충전 타입이 제2 충전 타입이면서 고속 충전 모드인 경우 제1 충전 타입으로 전환하지 않고, 제2 충전 타입에서 고속 충전 모드를 일반 충전 모드로 전환하기 위해 PDIC를 통해 PPS 통 신으로 Request Data Object 9V/1.2A 에서 변경된 Request Data Object 9V/800mA를 외부 전자 장치에 전 송하고, 외부 전자 장치로부터 9V/800mA 에 대응된 제4 전력을 수신하여 배터리를 충전할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)에서 PD(power delivery) 기반 전력 수신 방법은 USB 커넥터(예: 도 1의 연결 단자, 또는 도 4의 연결단자)를 통해 외부 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 외부 전자 장치)와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반하여, 상기 외부 전자 장치에 BCD 정보를 전송하는 동작, 및 상기 외 부 전자 장치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제3 전력을 수신하거나, 상기 외부 전자 장치로부터 상기 제2 충전 타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 제4 전력을 수신 하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 수신된 제3 전력 또는 제4 전력을 이용하여 상기 배터리를 충전하는 동작을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방법은 상기 수신된 제4 전력을 이용하여 상기 배터리 충전 중 상기 배터리 충전 상태가 완충 상태이거나, 상기 전자 장치의 소모 전류가 지정된 소모 전류 이상이거나, 상기 전자 장치의 발열 온도가 지정된 온도 이상이면 PD 통신을 이용하여 상기 제2 충전 타입을 상기 제1 충전 타입으로 전환하기 위한 요청을 상기 외부 전자 장치에 송신하는 동작을 더 포함할 수 있다.도 9는 일 실시예에 따른 전자 장치에서 외부 전자 장치와 PD 기반 전력 송수신 중 충전 홀딩 동작을 설명하기 위한 도면이다. 도 9를 참조하면, 910 동작에서 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장 치)는 외부 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 외부 전자 장치)와 PD 기반 전력 송 수신 중 외부 전자 장치에 배터리 상태 정보를 요청할 수 있다(get battery status). 920 동작에서, 일 실시예에 따른 전자 장치는 외부 전자 장치로부터 배터리 상태 정보를 수신할 수 있다(battery status). 930 동작에서, 일 실시예에 따른 전자 장치는 외부 전자 장치로부터 수신된 배터리 상태 정보에 기반 하여 충전 홀딩(또는 중단) 정보를 송신할 수 있다(RDO 5V/0A). 예를 들면, 전자 장치는 외부 전자 장치 로부터 수신된 배터리 상태 정보가 완충 상태 또는 충전 중단(또는 홀딩)이 필요한 상태를 포함하는 경우 RDO(request data object) 값을 5V/0A으로 전송할 수 있다. 외부 전자 장치는 RDO 값이 5V/0A으로 수신된 경우 제1 충전 회로(예: 도 4의 제1 충전 회로가 Buck-off되도록 하고, 제2충전 회로(예: 도 4의 제2 충전 회로가 Charger off되도록 하여 충전을 홀딩(또는 중단)할 수 있다. 940 동작에서, 일 실시예에 따른 전자 장치는 외부 전자 장치로부터 충전이 홀딩(또는 중단)됨을 알 리는 메시지를 수신할 수 있다(good CRC). 도 10은 일 실시예에 따른 전자 장치에서 외부 전자 장치와 PD 기반 전력 송수신 중 충전 종료 동작을 설명하기 위한 도면이다. 도 10을 참조하면, 1010 동작에서 일 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 전자 장치)는 외부 전자 장치(예: 도 1의 전자 장치, 또는 도 4의 외부 전자 장치)와 PD 기반 전력 송수신 중 외부 전자 장치에 배터리 상태 정보를 요청할 수 있다(get battery status). 1020 동작에서, 일 실시예에 따른 전자 장치는 외부 전자 장치로부터 배터리 상태 정보를 수신할 수 있다(battery status). 1030 동작에서, 일 실시예에 따른 전자 장치는 외부 전자 장치로부터 수신된 배터리 상태 정보에 기 반하여 충전 종료 정보를 송신할 수 있다(Alert(EOC: emergency operation center)). 예를 들면, 전자 장치 는 외부 전자 장치로부터 수신된 배터리 상태 정보가 충전 종료 상태 또는 충전 종료가 필요한 상태 를 포함하는 경우 EOC type을 포함하는 Alert 메시지를 외부 전자 장치에 전송할 수 있다. 외부 전자 장치 는 EOC type을 포함하는 Alert 메시지가 수신된 경우 충전 동작을 종료할 수 있다. 1040 동작에서, 일 실시예에 따른 전자 장치는 외부 전자 장치로부터 충전 동작이 종료됨을 알리는 메시지를 수신할 수 있다(good CRC). 다양한 실시예에 따르면 전자 장치는 외부 전자 장치와 충전을 위한 전력의 송신(또는 수신) 시 전자 장치 및/또는 외부 전자 장치의 충전 성능, 배터리 충전량, 및/또는 발열에 기반하여 PD 통신을 이용하여 제1 충전 회로(예: IF-PMIC) 및 제2 충전 회로(예: DCIC) 중 하나를 선택하여 전력 전송을 위한 전압(및/또는 전 류)를 적절한 전압으로 변경함으로써 충전 효율을 높일 수 있다. 예를 들면, 하기 표 2는 전자 장치가 source 역할 시 충전 효율을 설명하기 위한 표일 수 있다. 표 2 Source Sink IF-PMIC 5V 87.36 9V 79.98 DCIC 7V~8.8V 89.28 상기 표 2를 참조하면, IF-PMIC를 이용하는 제1 충전 타입의 경우보다 DCIC를 이용하는 제2 충전 타입의 경우가 외부 전자 장치(예: sink) 입장에서 충전 효율이 높을 수 있으나, 전자 장치의 배터리 충전량이 작거 나 배터리 전압이 낮은 경우에는 제1 충전 타입의 IF-PMIC를 이용하여 전력은 전송하는 것이 전자 장치의 시스템 안정성을 위해서 필요할 수 있다.본 문서에 개시된 다양한 실시예에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들 면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어 러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 본 문서의 다양한 실시예 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한정 하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도 면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개 를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",\"A 또는 B 중 적어도 하나,\"\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,\"및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하 는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사 용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구 성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시예는 기기(machine)(예: 전자 장치)에 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태 로 제공될 수 있다. 여기서, ‘비일시적’은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자 기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복 수의 개체를 포함할 수 있다. 다양한 실시예에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또 는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통 합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수 의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정된 것으로서, 상기 적어도 하나의 동작은, USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 source로 결정됨에 기반하여, 상기 외부 전자 장치의 상기 제1 충전 타입의 지원 여부 및 상기 제2 충전 타입의 지원 여부를 확인하는 동작, 상기 외부 전자 장치가 제1 충전 타입을 지원하고, 상기 제2 충전 타입을 지원하지 않는 경우 상기 제1 충전 타입의 제1 충전 회로를 이용하여 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제1 전력을 상기 외부 전자 장치에 전송하는 동작, 및 상기 제1 충전 타입 및 상기 제2 충전 타입을 지원하는 경우 상기 제2 충전 타입의 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 제2 전압(및/또는 제2 전류)를 기반으로 제2 전력을 상기 외부 전자 장치에 전송하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 명령들을 저장하고 있는 비휘발성 저장 매체에 있어서, 상기 명령들은 적어도 하나의 프로세서에 의하여 실행될 때에 상기 적어도 하나의 프로세서로 하여금 적어도 하나의 동작을 수행하도록 설정 된 것으로서, 상기 적어도 하나의 동작은, USB 커넥터를 통해 상기 외부 전자 장치와 연결 시 PD 통신을 통해 상기 전자 장치의 역할이 sink로 결정됨에 기반하여, 상기 외부 전자 장치에 BCD 정보를 전송하는 동작, 및 상 기 외부 전자 장치로부터 상기 제1 충전 타입에 기반한 제1 PD0(power data object) 수신에 기반하여 상기 제1 충전 회로를 이용하여 상기 외부 전자 장치로부터 상기 고정된 제1 전압(및/또는 제1 전류)를 기반으로 제3 전 력을 수신하거나, 상기 외부 전자 장치로부터 상기 제2 충전 타입에 기반한 제2 PD0 수신에 기반하여 상기 제2 충전 회로를 이용하여 상기 외부 전자 장치와 협상된 상기 제2 전압(및/또는 제2 전류)를 기반으로 제4 전력을 수신하는 동작을 포함할 수 있다. 그리고 본 명세서와 도면에 발명된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 발명된 실시예들 이외에도 본 발명의 다양 한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범위 에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2021-0028187", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 일 실시예에 따른 전자 장치와 외부 전자 장치의 PD 동작을 설명하기 위한 개략적인 도면이다. 도 3은 일 실시예에 따른 연결 단자를 나타낸 도면이다. 도 4는 일 실시예에 따른 전자 장치의 블록도이다. 도 5는 일 실시예에 따른 전자 장치에서 외부 전자 장치와 연결 시 PD 기반 전력 송신 동작을 나타낸 도면이다. 도 6은 일 실시예에 따른 전자 장치에서 외부 전자 장치에 PD 기반 전력 전송 중 충전 타입 변경 동작을 나타낸 도면이다. 도 7은 일 실시예에 따른 전자 장치에서 외부 전자 장치와 연결 시 PD 기반 전력 수신 동작을 나타낸 도면이다. 도 8은 일 실시예에 따른 전자 장치에서 외부 전자 장치로부터 PD 기반 전력 수신 중 충전 타입 변경 동작을 나 타낸 도면이다. 도 9는 일 실시예에 따른 전자 장치에서 외부 전자 장치와 PD 기반 전력 송수신 중 충전 홀딩 동작을 설명하기 위한 도면이다. 도 10은 일 실시예에 따른 전자 장치에서 외부 전자 장치와 PD 기반 전력 송수신 중 충전 종료 동작을 설명하기 위한 도면이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다."}
