{"patent_id": "10-2024-0044227", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0047346", "출원번호": "10-2024-0044227", "발명의 명칭": "공기 조화기 및 그 제어 방법", "출원인": "삼성전자주식회사", "발명자": "주영주"}}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "실외기와 연결된 공기 조화기에 있어서,프로세서;를 포함하고,상기 프로세서는,상기 실외기에 포함된 온도 센서를 통해 냉방 기능을 시작하는 시점의 제1 온도 값을 획득하고,상기 냉방 기능을 시작하는 시점에서 임계 시간이 경과하면, 상기 온도 센서를 통해 상기 임계 시간이 경과한시점의 제2 온도 값을 획득하고,상기 제1 온도 값 및 상기 제2 온도 값 간 차이가 제3 기준값 이상이면 상기 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공하는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제3 기준값은,임계 횟수의 학습 동작에 기초하여 결정되는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 알림 정보는,상기 실외기가 설치된 환경과 관련된 정보를 포함하는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 알림 정보는,상기 실외기가 설치된 공간의 비정상 환경임을 나타내는 정보를 포함하는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로세서는,상기 비정상 환경에 대한 텍스트, 이미지, 동영상, 상기 비정상 환경에 대한 해결책 중 적어도 하나를 포함하는UI를 제공하는; 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0047346-3-제1항에 있어서,상기 제1 온도는 상기 제2 온도보다 작고,상기 프로세서는,상기 제2 온도에서 상기 제1 온도를 뺄셈한 값이 상기 제3 기준값 이상이면, 상기 알림 정보를 제공하는, 공기조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,임계 시간이 경과한 시점에서 실외기의 초기 온도에 대응되는 예상 온도를 나타내는 적어도 하나의 기준 온도를포함하는 기준 온도 테이블을 저장하는 메모리;를 더 포함하고,상기 프로세서는,상기 제1 온도에 대응하는 기준 온도를 식별하고,상기 식별된 기준 온도 및 상기 제2 온도의 차이가 제4 기준값 이상이면, 상기 알림 정보를 제공하는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 적어도 하나의 기준 온도는,상기 공기 조화기의 상기 냉방 기능과 관련하여 상기 실외기의 온도 데이터를 포함하는 히스토리 데이터에 기초하여 학습된 값인, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,스피커;를 더 포함하고,상기 프로세서는,상기 환경과 관련된 상기 알림 정보를 출력하도록 상기 스피커를 제어하는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,통신 인터페이스;를 더 포함하고,상기 프로세서는,상기 환경과 관련된 상기 알림 정보를 외부 장치로 제공하도록 상기 통신 인터페이스를 제어하는, 공기 조화기."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "실외기와 연결된 공기 조화기의 제어 방법에 있어서,상기 실외기에 포함된 온도 센서를 통해 냉방 기능을 시작하는 시점의 제1 온도 값을 획득하는 단계;공개특허 10-2024-0047346-4-상기 냉방 기능을 시작하는 시점에서 임계 시간이 경과하면, 상기 온도 센서를 통해 상기 임계 시간이 경과한시점의 제2 온도 값을 획득하는 단계; 및상기 제1 온도 값 및 상기 제2 온도 값 간 차이가 제3 기준값 이상이면 상기 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공하는 단계;를 포함하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제3 기준값은,임계 횟수의 학습 동작에 기초하여 결정되는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 알림 정보는,상기 실외기가 설치된 환경과 관련된 정보를 포함하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 알림 정보는,상기 실외기가 설치된 공간의 비정상 환경임을 나타내는 정보를 포함하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 비정상 환경에 대한 텍스트, 이미지, 동영상, 상기 비정상 환경에 대한 해결책 중 적어도 하나를 포함하는UI를 제공하는 단계;를 더 포함하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 제1 온도는 상기 제2 온도보다 작고,상기 알림 정보를 제공하는 단계는,상기 제2 온도에서 상기 제1 온도를 뺄셈한 값이 상기 제3 기준값 이상이면, 상기 알림 정보를 제공하는, 제어방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 공기 조화기는,임계 시간이 경과한 시점에서 실외기의 초기 온도에 대응되는 예상 온도를 나타내는 적어도 하나의 기준 온도를공개특허 10-2024-0047346-5-포함하는 기준 온도 테이블을 저장하고,상기 알림 정보를 제공하는 단계는,상기 제1 온도에 대응하는 기준 온도를 식별하고,상기 식별된 기준 온도 및 상기 제2 온도의 차이가 제4 기준값 이상이면, 상기 알림 정보를 제공하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 적어도 하나의 기준 온도는,상기 공기 조화기의 상기 냉방 기능과 관련하여 상기 실외기의 온도 데이터를 포함하는 히스토리 데이터에 기초하여 학습된 값인, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 알림 정보를 제공하는 단계는,상기 환경과 관련된 상기 알림 정보를 출력하도록 상기 공기 조화기에 포함된 스피커를 제어하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 알림 정보를 제공하는 단계는,상기 환경과 관련된 상기 알림 정보를 외부 장치로 제공하는, 제어 방법."}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "공기 조화기가 개시된다. 본 공기 조화기는 온도 센서, 공기 조화기에 대한 턴 온 명령이 수신되면, 온도 센서를 통해 턴 온 명령이 수신된 시점의 제1 온도 값을 획득하고, 턴 온 명령이 수신된 시점에서 임계 시간이 경과하면, 온도 센서를 통해 임계 시간이 경과한 시점의 제2 온도 값을 획득하고, 제1 온도 값 및 제2 온도 값에 기초하여 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공하는 프로세서를 포함한다."}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 공기 조화기 및 그 제어방법에 관한 것으로, 더욱 상세하게는 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공하는 공기 조화기 및 이의 제어 방법에 관한 것이다."}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "여름철 쾌적한 공간을 유지하기 위한 공기 조화기(에어컨)의 사용이 증가하고 있다. 국내의 경우 여름철 에어컨 의 사용기간이 집중되므로 고장, 제품 상담 및 유지관리를 위한 서비스가 특정기간에 집중이 된다. 특히, 여름 철 에는 사용자 불만 사항에 대한 대응 방안을 안내하는데 많은 비용이 들어간다. 에어컨 사용자의 불만은 제품자체의 불량, 에어컨 제품의 설치과정에서 발생한 설치 불량, 제품 설치 환경의 이 해 부족 또는 제품 자체의 이해 부족 등 이 있을 수 있다. 기존 공기 조화기는 공기 조화기 자체의 하드웨어 부품들이 가지고 있는 자체 진단 기능을 이용하여 제품의 고 장 여부를 진단하고, 서비스 기사 혹은 서비스 상담원은 에러 코드를 이용하여 서비스를 제공하였다. 예를 들면, 제품이 모터, 압축기, 센서류 등의 디지털 신호를 통해 제품의 고장 여부를 판단하고 고장 항목에 대응되 는 에러 코드를 표시하였다. 종래 기술은 제품의 사용자가 에러 코드를 확인하고, 사용자 매뉴얼 혹은 해당 제조사의 홈페이지를 통해 에러 코드의 정보를 확인한다. 종래 기술은 제품이 설치된 환경에 대한 이상 부분 및 해결 방안을 알려주지 않는다. 이로 인하여 서비스기사가 직접 제품이 설치된 곳을 방문하게 되어 제조사에는 경제적 손실이 발생하는 문제점 이 있다. 한편, 제품이 설치된 환경에 의하여 공기 조화기의 성능이 저하되는 경우가 있을 수 있다. 예를 들어, 실내의 창문이 열린 상태에서 실내기가 가동되는 경우 공기 조화기가 정상적으로 동작한다 하여도 실내 온도가 설정 온도까지 떨어지지 않을 수 있다. 이 경우, 공기 조화기가 계속 가동하게 되어 공기 조화기의 전력이 많이 소모될 수 있다. 또한, 실외기실의 창문이 닫혀진 상태에서 실외기가 가동되는 경우가 있을 수 있다. 실외기실의 환경으로 인하 여 환기 불량이 발생하고 이로 인한 제품의 성능저하가 발생할 수 있다. 그리고, 환기 불량은 제품의 효율을 저 하시켜 제품의 온전한 성능 및 효율을 유지하지 못하는 원인이 될 수 있다. 하지만, 제품 자체의 고장이 아닌 제품이 설치된 환경에 대한 문제점을 판단하기 어렵다는 문제가 있다. 또한, 고객센터에서는 제품이 설치된 환경에 대한 문제가 발생한 경우, 제품이 설치된 환경에 대한 정보를 쉽게 알 수 없어 정확한 해결 방안을 제공하는 것이 어렵다는 문제가 있다."}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제를 개선하기 위해 고안된 것으로, 본 개시의 목적은 공기 조화기에 포함된 온도 센서로부 터 획득된 온도 값에 기초하여 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공하는 공기 조화기 및 그의 제어 방법을 제공함에 있다."}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위한 본 실시 예에 따른 공기 조화기는 온도 센서, 상기 공기 조화기에 대한 턴 온 명 령이 수신되면, 상기 온도 센서를 통해 상기 턴 온 명령이 수신된 시점의 제1 온도 값을 획득하고, 상기 턴 온 명령이 수신된 시점에서 임계 시간이 경과하면, 상기 온도 센서를 통해 상기 임계 시간이 경과한 시점의 제2 온 도 값을 획득하고, 상기 제1 온도 값 및 상기 제2 온도 값에 기초하여 상기 공기 조화기가 설치된 환경과 관련 된 알림 정보를 제공하는 프로세서를 포함한다. 여기서, 상기 온도 센서는 실내기에 포함된 온도 센서일 수 있고, 상기 프로세서는 상기 제1 온도 값 및 상기 임계 시간이 경과한 시점의 설정 온도 값 간 차이가 제1 기준값 이상이고, 상기 제1 온도 값 및 상기 제2 온도 값 간 차이가 제2 기준값 이하이면, 상기 실내기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 또한, 공기 조화기는 초기 온도 별 기준 냉방 속도에 대한 정보를 저장하는 메모리를 더 포함할 수 있고, 상기 프로세서는 상기 제1 온도 값 및 상기 제2 온도 값에 기초하여 상기 임계 시간에 대응되는 현재 냉방 속도를 식 별할 수 있고, 상기 메모리에 저장된 정보에 기초하여 상기 제1 온도 값에 대응되는 기준 냉방 속도를 식별할 수 있고, 상기 현재 냉방 속도, 상기 기준 냉방 속도, 상기 임계 시간이 경과한 시점의 설정 온도 값에 기초하 여 실내기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 상기 온도 센서는 실외기에 포함된 온도 센서일 수 있으며 상기 프로세서는 상기 제1 온도 값 및 상기 임 계 시간이 경과한 시점의 제2 온도 값 간 차이가 제3 기준값 이상이면 상기 실외기가 설치된 환경과 관련된 알 림 정보를 제공할 수 있다. 한편, 공기 조화기는 초기 온도 별 실외기의 기준 온도에 대한 정보를 저장하는 메모리를 더 포함할 수 있고, 상기 프로세서는 상기 제1 온도 값에 대응되는 상기 실외기의 기준 온도 및 상기 제2 온도 값의 차이에 기초하 여 상기 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 공기 조화기는 압축기를 더 포함할 수 있고, 상기 프로세서는 상기 제1 온도 값, 상기 제2 온도 값 및 상 기 압축기의 주파수에 기초하여 상기 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 상기 온도 센서는 실내기에 포함된 제1 온도 센서 및 실외기에 포함된 제2 온도 센서를 포함할 수 있고, 상기 프로세서는 상기 제2 온도 센서를 통해 획득된 상기 제1 온도 값 및 상기 제2 온도 값에 기초하여 상기 실 외기가 설치된 환경이 기설정된 조건을 만족하지 않는 것으로 식별되면 상기 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있고, 상기 실내기가 설치된 환경과 관련된 알림 정보를 제공하지 않을 수 있다. 여기서, 상기 제1 온도 센서에 대응되는 임계 시간은 상기 제2 온도 센서에 대응되는 임계 시간보다 길 수 있다. 한편, 공기 조화기는 스피커를 더 포함할 수 있고, 상기 프로세서는 상기 환경과 관련된 알림 정보를 음성으로 제공하도록 상기 스피커를 제어할 수 있다. 한편, 공기 조화기는 통신 인터페이스를 더 포함할 수 있고, 상기 프로세서는 상기 환경과 관련된 알림 정보를 외부 장치로 제공하도록 상기 통신 인터페이스를 제어할 수 있다. 한편, 본 개시의 일 실시 예에 따른 공기 조화기의 제어 방법은 상기 공기 조화기에 대한 턴 온 명령이 수신되 면, 온도 센서를 통해 상기 턴 온 명령이 수신된 시점의 제1 온도 값을 획득하는 단계, 상기 턴 온 명령이 수신 된 시점에서 임계 시간이 경과하면, 상기 온도 센서를 통해 상기 임계 시간이 경과한 시점의 제2 온도 값을 획 득하는 단계 및 상기 제1 온도 값 및 상기 제2 온도 값에 기초하여 상기 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공하는 단계를 포함한다. 여기서, 상기 온도 센서는 실내기에 포함된 온도 센서일 수 있으며, 상기 알림 정보를 제공하는 단계는 상기 제 1 온도 값 및 상기 임계 시간이 경과한 시점의 설정 온도 값 간 차이가 제1 기준값 이상이고, 상기 제1 온도 값 및 상기 제2 온도 값 간 차이가 제2 기준값 이하이면, 상기 실내기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 또한, 초기 온도 별 기준 냉방 속도에 대한 정보를 저장하는 공기 조화기의 제어 방법은 상기 제1 온도 값 및 상기 제2 온도 값에 기초하여 상기 임계 시간에 대응되는 현재 냉방 속도를 식별하는 단계, 상기 저장된 정보에 기초하여 상기 제1 온도 값에 대응되는 기준 냉방 속도를 식별하는 단계를 포함할 수 있다. 그리고, 상기 알림 정보를 제공하는 단계는 상기 현재 냉방 속도, 상기 기준 냉방 속도, 상기 임계 시간이 경과한 시점의 설정 온 도 값에 기초하여 실내기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 상기 온도 센서는 실외기에 포함된 온도 센서일 수 있으며, 상기 알림 정보를 제공하는 단계는 상기 제1 온도 값 및 상기 임계 시간이 경과한 시점의 제2 온도 값 간 차이가 제3 기준값 이상이면 상기 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 초기 온도 별 실외기의 기준 온도에 대한 정보를 저장하는 공기 조화기의 제어 방법에 있어서, 상기 알림 정보를 제공하는 단계는 상기 제1 온도 값에 대응되는 상기 실외기의 기준 온도 및 상기 제2 온도 값의 차이에 기초하여 상기 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 또한, 상기 알림 정보를 제공하는 단계는 상기 제1 온도 값, 상기 제2 온도 값 및 압축기의 주파수에 기초하여 상기 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 상기 온도 센서는 실내기에 포함된 제1 온도 센서 및 실외기에 포함된 제2 온도 센서를 포함할 수 있고, 상기 공기 조화기의 제어 방법은 상기 제2 온도 센서를 통해 획득된 상기 제1 온도 값 및 상기 제2 온도 값에 기초하여 상기 실외기가 설치된 환경이 기설정된 조건을 만족하지 않는 것으로 식별되면 상기 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있고, 상기 실내기가 설치된 환경과 관련된 알림 정보를 제공하지 않는 단계를 더 포함할 수 있다. 여기서, 상기 제1 온도 센서에 대응되는 임계 시간은 상기 제2 온도 센서에 대응되는 임계 시간보다 길 수 있다. 또한, 상기 알림 정보를 제공하는 단계는 상기 환경과 관련된 알림 정보를 음성으로 제공하도록 스피커를 제어 할 수 있다. 또한, 상기 알림 정보를 제공하는 단계는 상기 환경과 관련된 알림 정보를 외부 장치로 제공하도록 통신 인터페 이스를 제어할 수 있다."}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부 도면을 참조하여 본 개시를 상세히 설명한다. 본 개시의 실시 예에서 사용되는 용어는 본 개시에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달 라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 개시의 설명 부 분에서 상세히 그 의미를 기재할 것이다. 따라서 본 개시에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가지는 의미와 본 개시의 전반에 걸친 내용을 토대로 정의되어야 한다. 본 명세서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수 치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. A 또는/및 B 중 적어도 하나라는 표현은 \"A\" 또는 \"B\" 또는 \"A 및 B\" 중 어느 하나를 나타내는 것으로 이해되어 야 한다. 본 명세서에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 어떤 구성요소가 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함하다\" 또 는 \"구성되다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것 이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시에서 \"모듈\" 혹은 \"부\"는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되 거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 \"모듈\" 혹은 복수의 \"부\"는 특정한 하드 웨어로 구현될 필요가 있는 \"모듈\" 혹은 \"부\"를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하나의 프 로세서(미도시)로 구현될 수 있다. 본 명세서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 이하 첨부된 도면들을 참조하여 본 개시의 일 실시 예를 보다 상세하게 설명한다. 도 1은 본 개시의 일 실시 예에 따른 공기 조화기를 도시한 블록도이다. 도 1을 참조하면, 공기 조화기는 실내기 및 실외기로 구성될 수 있다. 공기 조화기는 실내의 공기를 조화하기 위한 동작을 수행한다. 구체적으로, 공기 조화기는 일 실시 예에 따라 실내 공기의 온도를 낮추는 냉방 기기일 수 있다. 다른 실시 예에 따라 공기 조화기는 실내 공 기의 온도를 높이는 난방, 실내에 기류를 형성하는 송풍 및 실내 습도를 낮추는 제습 중 적어도 하나의 공기 조 화를 수행할 수 있다. 구체적으로, 공기 조화기는, 냉매를 이용하여 외부 공기와 열을 교환하는 실외기 및 실외기와 냉매를 교류하며 실내 공기의 조화 동작을 수행하는 실내기를 포함할 수 있다. 실내기는 냉매를 전달받아 실내 공기와 열 교환하는 실내 열 교환기를 포함할 수 있다. 그리고, 실내기 는 실내 열 교환기에서 열 교환이 이루어지도록 실내 팬 모터에 의해 실내 공기를 강제 토출하는 실내 팬 을 포함할 수 있다. 실내기의 구체적인 구성에 대해서는 도3에서 후술한다. 실외기는 냉매를 고온 고압의 기체상태로 압축하는 압축기를 포함할 수 있다. 그리고, 실외기는 압축 기에서 압축된 고온 고압의 기체 냉매를 전달받아 실외 공기와 열 교환하는 실외 열 교환기를 포함할 수 있다. 그리고, 실외기는 실외 열 교환기에서 열 교환이 이루어지도록 실외 팬 모터에 의해 실외 공기를 강제 송 풍 시키는 실외 팬을 포함할 수 있다. 실외기의 구체적인 구성에 대해서는 도3에서 후술한다. 일 실시 예에 따라 실외기는 실외 공간에 설치될 수 있다. 한편, 다른 실시 예에 따라 실외기는 실내 공간에 설치될 수 있다. 구체적으로, 실외기는 실외기실(air-conditioning plant room)이라는 실내 공간에 배치되는 형태로 구현될 수 있다. 도 2는 본 개시의 일 실시 예에 따른 공기 조화기를 도시한 블록도이다. 도 2를 참조하면, 실내기는 온도 센서 및 프로세서로 구성될 수 있다. 온도 센서는 실내 공간의 온도를 감지하는 구성일 수 있다. 구체적으로, 온도 센서는 프로세서 의 제어 명령에 기초하여 실내기가 배치된 공간의 실내 온도를 측정할 수 있다. 한편, 온도 센서는 실내 공기의 온도를 감지할 수 있는 곳이라면 어디든 설치될 수 있다. 프로세서는 의 전반적인 제어 동작을 수행할 수 있다. 구체적으로, 프로세서는 실내기의 전반적 인 동작을 제어하는 기능을 한다. 프로세서는 디지털 신호를 처리하는 디지털 시그널 프로세서(digital signal processor(DSP), 마이크로 프 로세서(microprocessor), TCON(Time controller)으로 구현될 수 있다. 다만, 이에 한정되는 것은 아니며, 중앙 처리장치(central processing unit(CPU)), MCU(Micro Controller Unit), MPU(micro processing unit), 컨트롤러(controller), 어플리케이션 프로세서(application processor(AP)), GPU(graphics-processing unit) 또는 커 뮤니케이션 프로세서(communication processor(CP)), ARM 프로세서 중 하나 또는 그 이상을 포함하거나, 해당 용어로 정의될 수 있다. 또한, 프로세서는 프로세싱 알고리즘이 내장된 SoC(System on Chip), LSI(large scale integration)로 구현될 수도 있고, FPGA(Field Programmable gate array) 형태로 구현될 수도 있다. 또 한, 프로세서는 메모리에 저장된 컴퓨터 실행가능 명령어(computer executable instructions)를 실 행함으로써 다양한 기능을 수행할 수 있다. 프로세서는 공기 조화기가 설치된 장소의 주변 환경을 분석할 수 있다. 여기서, 공기 조화기 가 설치된 장소는 실내기 또는 실외기가 설치된 각각의 장소를 의미할 수 있다. 공기 조화기가 설치된 장소는 복수의 장소(실내기가 설치된 장소 및 실외기가 설치된 장소)를 의미할 수 있다. 여기서 환경이란, 공기 조화기에 영향을 미치는 다양한 상황을 의미할 수 있다. 예를 들어, 환경은 온도, 습도와 같은 물리적인 상황, 실내 공간에 포함된 창문의 열림(또는 닫힘) 상태, 실외기실에 포함된 창문의 열림 (또는 닫힘) 상태를 의미할 수 있다. 여기서, 주변 환경을 분석하는 동작은 공기 조화기가 설치된 장소(또는 공간)의 주변이 어떠한 환경(상태)인지를 분석하는 것을 의미할 수 있으며, 주변 환경이 정상 환경인지 아니면 비정상 환경인지 여부를 판단하는 것을 의미할 수 있다. 여기서, 정상 환경이란 공기 조화기가 효율적으로 작동할 수 있는 환경을 의미할 수 있다. 공기 조화기 가 효율적으로 작동하기 위해선, 실내기가 설치된 실내 공간이 외부 공기가 유입 되지 않아야 하며 실외기가 토출하는 공기가 실외로 빠져나갈 수 있는 상태여야 한다. 따라서, 정상 환경이란 실내기가 설치된 장소의 창문이 닫혀 있는 상태 또는 실외기가 토출하는 공기가 실외로 빠져나갈 수 있는 상태를 의미할 수 있다. 여기서, 비정상 환경이란 공기 조화기가 설치된 장소의 주변 환경이 정상적이지 않은 환경인 것을 의미할 수 있다. 구체적으로, 비정상 환경이란 공기 조화기가 설치된 장소에서 실내 공간이 밀폐 되어 있지 않거 나 실외기가 토출하는 공기가 실외로 빠져나가지 못하는 상태일 수 있다. 비정상 환경은 실내기가 설 치된 공간의 비정상 환경과 실외기가 설치된 공간의 비정상 환경으로 구분될 수 있다. 예를 들어, 실내기가 설치된 공간에서 창문이 열린 경우, 창문 밖의 뜨거운 공기가 계속 실내로 유입 될 수 있다. 따라서, 실내기가 오랜 시간 냉방 동작을 수행함에도 불구하고, 실내 온도는 설정 온도까지 떨어 지지 않을 수 있다. 창문이 닫혀 있는 경우(정상 환경의 경우) 실내 온도는 설정 온도까지 떨어질 것이다. 따라 서, 실내기의 비정상 환경이란 실내 온도가 정상적으로 떨어지지 않는 상황을 의미할 수 있다. 실내기 의 비정상 환경은 실내기 커튼 막힘, 실내 필터 막힘, 실내 창문 열림, 실내 방문 열림 중 어느 하나일 수 있다. 다른 예를 들어, 실외기가 실외기실에 설치 되어 있는 경우, 실외기실의 창문이 열려 있지 않은 상태에서 실외기가 작동하면, 뜨거운 공기가 외부로 빠져나가지 못하므로, 실외기실의 온도가 상승할 수 있다. 실외 기실의 온도가 상승하면, 실외기의 제품 고장을 야기할 수 있다. 구체적으로, 실외기실의 창문이 닫힌 상 태인 경우, 실외기실의 온도가 상승될 수 있다. 따라서, 실외기의 비정상 환경이란 실외기 온도가 기준보 다 높은 상황을 의미할 수 있다. 실외기의 비정상 환경은 실외기 환기 불량, 실외기실 갤러리 막힘 중 어느 하나일 수 있다. 프로세서는 실내기의 비정상 환경 또는 실외기의 비정상 환경을 판단할 수 있다. 우선, 실내기 에 대한 비정상 환경에 대하여 기술한다. 프로세서는 설정 온도, 측정 온도 및 기준 냉방 속도 중 적어도 하나에 기초하여 실내기의 비정상 환 경을 판단할 수 있다. 여기서, 설정 온도는 공기 조화기의 냉방 기능의 출력을 제어하는데 고려되는 온도를 의미할 수 있다. 설 정 온도가 높으면 냉방 기능의 출력이 약하고, 설정 온도가 낮으면 냉방 기능의 출력이 강할 수 있다. 일 실시 예에 따른, 설정 온도는 사용자 입력에 의하여 수신될 수 있다. 다른 실시 예에 따른, 설정 온도는 이전 냉방 동작을 수행할 때 마지막으로 메모리에 저장된 온도가 될 수 있다. 한편, 설정 온도는 최초의 설정 온도와 임계 시간이 경과한 시점의 설정 온도로 구분될 수 있다. 설정 온도가 변경되는 실시 예에 대해서는 도 15 및 도 16 에서 구체적으로 후술한다.여기서, 측정 온도는 실내기의 온도 센서로부터 측정되는 온도를 의미할 수 있다. 측정 온도는 제1 온도(초기 온도, 턴 온 명령 수신 시점 온도)와 제2 온도(비정상 환경 검지 시점 온도)로 구분 될 수 있다. 제1 온도를 측 정하는 시점은 턴 온 명령이 공기 조화기에 수신된 시점을 의미할 수 있다. 제2 온도를 측정하는 시점은 턴 온 명령이 공기 조화기에 수신된 이후 임계 시간이 경과한 시점을 의미할 수 있다. 여기서, 임계 시간은 충분히 냉방이 이루어지는 시간을 의미할 수 있다. 일 예로, 임계 시간은 기 설정된 값일 수 있다. 임계 시간은 샘플 데이터를 통해 얻어진 평균 냉방 가동 시간의 평균 데이터(또는 가중 평균 데이터)에 기초하여 획득된 값일 수 있다. 다른 예로, 임계 시간은 학습된 값일 수 있다. 여기서, 학습된 값이란 공기 조화기의 설치 이후 이용 데이터(히스토리 데이터)에 기초하여 획득된 데이터를 의미할 수 있다. 프로세서는 제1 온도를 측정하는 시점부터 설정 온도까지 실내 온도가 떨어지는 시간을 측정할 수 있고, 프로세서는 이용 데이터(히스토리 데이터)의 평균 값에 기초하여 임계 시간을 결 정할 수 있다. 여기서, 기준 냉방 속도는 임계 시간 동안 실내 온도가 어느 정도 떨어지는 지를 나타내기 위한 값일 수 있다. 기준 냉방 속도는 초기 온도에 다른 값을 가질 수 있다. 공기 조화기는 기준 냉방 속도에 기초하여 예상 온도를 획득할 수 있다. 여기서, 예상 온도는 특정 시점에 실내 온도가 어느 정도 인지를 나타내는 온도 일 수 있다. 일 실시 예에 따라, 기준 냉방 속도는 기설정된 값일 수 있다. 기 설정된 값은 제조사 측에서 제품에 적용하는 기 정의된 값을 의미할 수 있다. 기 설정된 값은 테스트 환경에서의 샘플 데이터 및 평균 데이터에 기초하여 획 득된 값일 수 있다. 기 설정된 값은 공기 조화기의 종류 또는 설치된 위치에 따라 달라질 수 있다. 기준 냉방 속도는 제품 출고 당시 이미 메모리에 저장된 상태일 수 있다. 다른 실시 예에 따라, 기준 냉방 속도는 학습된 값을 의미할 수 있다. 여기서, 학습된 값이란 공기 조화기 의 설치 이후 이용 데이터(히스토리 데이터)에 기초하여 획득된 데이터를 의미할 수 있다. 사용자가 공기 조화기를 반복적으로 동작하면 반복 횟수만큼 이용 데이터(히스토리 데이터)가 메모리에 저장될 수 있다. 여기서, 이용 데이터(히스토리 데이터)는 사용자가 턴 온 명령을 공기 조화기에 입력하는 시점부터 임계 시간이 경과한 후 턴 오프 명령을 공기 조화기에 입력하는 시점까지의 온도 데이터를 의미할 수 있다. 또 다른 실시 예에 따라, 기준 냉방 속도의 종류는 2가지 일 수 있다. 제1 기준 냉방 속도는 기설정된 값이고 제2 기준 냉방 속도는 학습된 값일 수 있다. 그리고, 프로세서는 실시 예에 따라 제1 기준 냉방 속도 또는 제2 기준 냉방 속도 중 적어도 하나에 기초하여 비정상 환경을 판단할 수 있다. 한편, 프로세서는 일정 조건(비정상 환경을 판단하기 위한 전제 조건)을 만족하는 경우에만 비정상 환경 판단 동작을 수행할 수 있다. 프로세서는 설정 온도 및 제1 온도 사이의 차이값이 기준값 이상인 경우, 실내기가 설치된 공간의 주 변 환경이 비정상 환경인지 여부를 판단할 수 있다. 여기서, 설정 온도는 제1 온도 보다 작거나 같을 수 있다. 예를 들어, 기준값 3, 제1 온도 30, 설정 온도 28을 가정한다. 기준값과 제1 온도의 차이값이 2이므로 기준값 3 보다 작다. 따라서, 프로세서는 비정상 환경 판단 동작을 수행하지 않을 수 있다. 다른 예를 들어, 기준값 3, 제1 온도 30, 설정 온도 25를 가정한다. 기준값과 제1 온도의 차이값이 5이므로 기준값 3 이상에 해당한다. 따라서, 프로세서는 비정상 환경 판단 동작을 수행할 수 있다. 또한, 프로세서는 제1 온도가 기준값 이상인 경우, 실내기가 설치된 공간의 주변 환경이 비정상 환경 인지 여부를 판단할 수 있다. 예를 들어, 기준값 26, 제1 온도 24를 가정한다. 제1 온도가 기준값보다 작으므로, 프로세서는 비정상 환경을 판단하지 않을 수 있다. 다른 예를 들어, 기준값 26, 제1 온도 26을 가정한다. 제1 온도가 기준값 이상에 해당하므로, 프로세서는 비정상 환경을 판단할 수 있다. 한편, 프로세서는 다양한 조건 중 적어도 하나의 조건을 만족하는 경우, 실내기가 설치된 공간의 주 변 환경(이후, 현재 환경으로 기술)을 비정상 환경으로 식별할 수 있다. 다양한 조건 중 제1 조건에 따라, 제1 온도 및 제2 온도 사이의 차이값이 기준값 이하이면, 프로세서는 현 재 환경을 비정상 환경으로 식별할 수 있다. 여기서, 제2 온도는 제1 온도보다 작거나 같을 수 있다. 예를 들어, 기준값 2, 제1 온도 30, 제2 온도 29를 가정한다. 제1 온도 및 제2 온도의 차이값 1은 기준값 2 이하이므 로, 프로세서는 현재 환경을 비정상 환경으로 식별할 수 있다. 다른 예를 들어, 기준값 2, 제1 온도 30, 제2 온도 27을 가정한다. 제1 온도 및 제2 온도의 차이값 3은 기준값 2보다 크므로, 프로세서는 현재 환경을 정상 환경으로 식별할 수 있다. 다양한 조건 중 제2 조건에 따라, 현재 냉방 속도가 기준 냉방 속도의 50% 이하인 경우, 프로세서는 현재 환경을 비정상 환경으로 식별할 수 있다. 여기서, 기준 냉방 속도는 제1 온도에 대응되는 값일 수 있다. 그리고, 현재 냉방 속도는 제1 온도 및 제2 온도의 차이값을 시간으로 나눈 값일 수 있다. 그리고, 제2 온도는 제1 온도보다 작거나 같을 수 있다. 예를 들어, 현재 냉방 속도 0.1, 기준 냉방 속도 0.26을 가정한다. 기준 냉 방 속도의 50%는 0.13이고 현재 냉방 속도는 기준 냉방 속도의 50% 이하이므로, 프로세서는 현재 환경을 비정상 환경으로 식별할 수 있다. 다른 예를 들어, 현재 냉방 속도 0.3, 기준 냉방 속도 0.26을 가정한다. 기준 냉방 속도의 50%는 0.13이고 현재 냉방 속도는 기준 냉방 속도의 50% 이상이므로, 프로세서는 현재 환경을 정상 환경으로 식별할 수 있다. 다양한 조건 중 제3 조건에 따라, 현재 냉방 속도 및 기준 냉방 속도의 차이값이 기준값 이상이면, 프로세서 는 현재 환경을 비정상 환경으로 식별할 수 있다. 예를 들어, 기준값 0.1, 현재 냉방 속도 0.1, 기준 냉방 속도 0.27을 가정한다. 현재 냉방 속도 및 기준 냉방 속도의 차이값 0.17은 기준값 0.1 이상이므로, 프로세서 는 현재 환경을 비정상 환경으로 식별할 수 있다. 다른 예를 들어, 기준값 0.1, 현재 냉방 속도 0.3, 기준 냉방 속도 0.27을 가정한다. 현재 냉방 속도 및 기준 냉방 속도의 차이값 0.03은 기준값 0.1 이하이므로, 프로 세서는 현재 환경을 정상 환경으로 식별할 수 있다. 한편, 현재 냉방 속도 및 기준 냉방 속도의 차이값을 이용하여 비정상 환경을 식별하는 다른 실시 예는 도 24에서 후술한다. 다양한 조건 중 제4 조건에 따라, 비정상 환경 검지 시점의 압축기 주파수가 기준값 이상이면, 프로세서는 현재 환경을 비정상 환경으로 식별할 수 있다. 여기서, 압축기 주파수의 단위는 Hz일 수 있다. 예를 들어, 기준 값 58, 비정상 환경 검지 시점의 압축기 주파수 60을 가정한다. 비정상 환경 검지 시점의 압축기 주파수가 기준 값보다 크므로, 프로세서는 현재 환경을 비정상 환경으로 식별할 수 있다. 다른 예를 들어, 기준값 58, 비 정상 환경 검지 시점의 압축기 주파수 55를 가정한다. 비정상 환경 검지 시점의 압축기 주파수가 기준값보다 작 으므로, 프로세서는 현재 환경을 정상 환경으로 식별할 수 있다. 다양한 조건 중 제5 조건에 따라, 설정 온도 및 제2 온도 사이의 차이값이 기준값 이상이면, 프로세서는 현재 환경을 비정상 환경으로 식별할 수 있다. 예를 들어, 기준값 3, 설정 온도 24, 제2 온도 28을 가정한다. 설정 온도 및 제2 온도 사이의 차이값이 4가 기준값 3 이상이므로, 프로세서는 현재 환경을 비정상 환경으 로 식별할 수 있다. 다른 예를 들어, 기준값 3, 설정 온도 24, 제2 온도 25를 가정한다. 설정 온도 및 제2 온도 사이의 차이값 1은 기준값 3 이하이므로, 프로세서는 현재 환경을 정상 환경으로 식별할 수 있다. 프로세서는 상술한 다양한 조건 중 적어도 하나의 조건이 만족되는 경우, 실내기의 환경이 비정상 환 경이라고 식별할 수 있다. 상술한 기준값은 명칭이 동일하나 모두 동일한 숫자를 의미하는 것은 아니다. 각 조 건에서 이용되는 기준값은 서로 동일하지 않을 수 있다. 그리고, 각 기준값들은 설정 온도 또는 제1 온도(초기 온도)에 따라 상이할 수 있다. 상술한 제1 조건 내지 제5조건은 실내기와 관련된 조건을 의미하며 제1온도 및 제2 온도는 실내기 온도 센서로 부터 획득된 것이고 현재 환경은 실내기의 주변 환경을 의미할 수 있다. 한편, 상술한 바와 같이 프로세서(12 0)는 실내기 주변 환경 이외에 실외기 주변 환경을 분석할 수 있다. 혼동을 피하기 위하여 다음 단락 에서 실외기 제1 온도, 실외기 제2 온도, 실외기 주변 환경이라는 단어를 이용하여 설명한다. 한편, 프로세서는 다양한 조건 중 적어도 하나의 조건을 만족하는 경우, 실외기가 설치된 공간의 주 변 환경(이후, 실외기 현재 환경으로 기술)을 비정상 환경으로 식별할 수 있다. 프로세서는 실외기 온도 센서로부터 실외기 제1 온도(턴 온 명령이 수신된 시점) 및 실외기 제2 온도(턴 옴 명령이 수신된 후 임계 시간이 경과한 시점)를 수신할 수 있다. 그리고, 실외기 제1 온도, 실외기 제2 온도 또는 실외기 기준 온도 중 적어도 하나에 기초하여 실외기가 설치된 주변 환경이 비정상 환경인지 여부를 판단할 수 있다. 실외기의 기준 온도는 공기 조화기가 턴 온 명령을 수신한 이후 임계 시간이 경과한 시점의 실외기 예상 온도를 의미할 수 있다. 여기서, 실외기의 기준 온도는 초기 시점의 온도(실외기 제1 온도)에 따라 다를 수 있 다. 일 실시 예에 따라, 실외기의 기준 온도는 기설정된 값일 수 있다. 기 설정된 값은 제조사 측에서 제품에 적용 하는 기 정의된 값을 의미할 수 있다. 기 설정된 값은 테스트 환경에서의 샘플 데이터 및 평균 데이터에 기초하 여 획득된 값일 수 있다 기 설정된 값은 공기 조화기의 종류 또는 설치된 위치에 따라 달라질 수 있다.실외기의 기준 온도는 제품 출고 당시 이미 메모리에 저장된 상태일 수 있다. 다른 실시 예에 따라, 실외기의 기준 온도는 학습된 값을 의미할 수 있다. 여기서, 학습된 값이란 공기 조화기 의 설치 이후 이용 데이터(히스토리 데이터)에 기초하여 획득된 데이터를 의미할 수 있다. 사용자가 공기 조화기를 반복적으로 동작하면 반복 횟수만큼 이용 데이터(히스토리 데이터)가 메모리에 저장될 수 있다. 여기서, 이용 데이터(히스토리 데이터)는 사용자가 턴 온 명령을 공기 조화기에 입력하는 시점부터 임계 시간이 경과한 후 턴 오프 명령을 공기 조화기에 입력하는 시점까지의 온도 데이터를 의미할 수 있다. 또 다른 실시 예에 따라, 실외기의 기준 온도의 종류는 2가지 일 수 있다. 제1 실외기의 기준 온도는 기설정된 값이고 제2 실외기의 기준 온도는 학습된 값일 수 있다. 그리고, 프로세서는 실시 예에 따라 제1 실외기의 기준 온도 또는 제2 실외기의 기준 온도 중 적어도 하나에 기초하여 비정상 환경을 판단할 수 있다. 한편, 프로세서는 다양한 조건 중 적어도 하나의 조건을 만족하는 경우, 실외기가 설치된 공간의 주 변 환경(이후, 현재 환경으로 기술)을 비정상 환경으로 식별할 수 있다. 다양한 조건 중 제1 조건에 따라, 실외기 제1 온도 및 실외기 제2 온도의 차이값이 기준값 이상이면, 프로세서 는 실외기의 주변 환경이 비정상인 것으로 식별할 수 있다. 예를 들어, 기준값 5, 제1 온도 30, 제2 온도 40을 가정한다. 실외기 제1 온도 및 실외기 제2 온도의 차이값 10은 기준값 5보다 크므로, 프로세서 는 실외기 현재 환경을 비정상으로 식별할 수 있다. 다른 예를 들어, 기준값 5, 제1 온도 30, 제2 온도 33을 가 정한다. 실외기 제1 온도 및 실외기 제2 온도의 차이값 3은 기준값 5보다 작으므로, 프로세서는 실외기 현 재 환경을 정상으로 식별할 수 있다. 다양한 조건 중 제2 조건에 따라, 실외기 제2 온도 및 실외기의 기준 온도의 차이값이 기준값 이상이면, 프로세 서는 실외기의 주변 환경이 비정상인 것으로 식별할 수 있다. 예를 들어, 기준값이 3, 실외기 제2 온 도 40, 실외기 기준 온도 33을 가정한다. 실외기 제2 온도 및 실외기 기준 온도의 차이값 7은 기준값보다 크므 로, 프로세서는 실외기 주변 환경이 비정상이라고 식별할 수 있다. 다른 예를 들어, 기준값이 3, 실외기 제2 온도 35, 실외기 기준 온도 33을 가정한다. 실외기 제2 온도 및 실외기 기준 온도의 차이값 2는 기준값보다 낮으므로, 프로세서는 실외기 주변 환경이 정상이라고 식별할 수 있다. 상술한 예에서는 실외기 기준 온도 가 초기 온도(실외기 제1 온도)와 관계 없이 실외기 기준 온도가 일정함을 가정하여 설명하였다. 초기 온도에 따라 실외기 기준 온도가 달라진다면, 제2 조건에서 설정 온도를 고려하는 동작이 추가될 수 있다. 지금까지, 실내기 및 실외기의 주변 환경이 비정상인지 여부를 판단하는 다양한 조건을 설명하였다. 프로세서는 상술한 조건을 종합하여 공기 조화기의 주변 환경이 비정상인지 여부를 식별할 수 있다. 그리고, 공기 조화기의 주변 환경이 비정상인 경우, 알림 정보를 제공할 수 있다. 여기서, 공기 조화기 의 주변 환경은 실내기의 주변 환경 또는 실외기의 주변 환경 중 적어도 하나일 수 있다. 프로 세서는 비정상 환경을 식별하기 위하여, 제1 온도 값 및 제2 온도 값을 이용할 수 있다. 프로세서는 공기 조화기에 대한 턴 온 명령이 수신되면, 온도 센서를 통해 턴 온 명령이 수신된 시 점의 제1 온도 값을 획득할 수 있다. 또한, 턴 온 명령이 수신된 시점에서 임계 시간이 경과하면, 온도 센서를 통해 임계 시간이 경과한 시점의 제2 온도 값을 획득할 수 있다. 여기서, 제1 온도는 턴 온 명령이 수신된 시점 (최초 시점)에 측정된 온도이고 제2 온도는 턴 온 명령이 수신된 이후 임계 시간이 경과한 시점(비정상 환경 검 지 시점)에 측정된 온도를 의미할 수 있다. 여기서, 턴 온 명령은 사용자가 냉방 기능을 수행하도록 공기 조화기를 제어하는 명령일 수 있다. 여기서, 임계 시간은 기 설정된 값 또는 공기 조화기의 사용 데이터(히스토리 데이터)등에 의하여 정해진 값일 수 있다. 그리고, 임계 시간은 실내기와 실외기가 다르게 정해질 수 있다. 예를 들어, 실외기 의 임계 시간은 15분이고 실내기의 임계 시간은 30분일 수 있다. 다만, 반드시 실내기 및 실외 기의 임계 시간이 달라야 하는 것은 아니며, 경우에 따라 공기 조화기는 임계 시간이 동일하게 구현 될 수 있다. 한편, 공기 조화기는 복수의 온도 센서를 포함할 수 있다. 구체적으로, 공기 조화기는 실내기(10 0)에 포함된 제1 온도 센서(실내기 온도 센서) 및 실외기에 포함된 제2 온도 센서(실외기 온도 센서)를 포 함할 수 있다. 제1 온도 값은 실내기 제1온도 값 또는 실외기 제1 온도 값 중 적어도 하나를 포함할 수 있으며, 제2 온도 값은 실내기 제2 온도 값 또는 실외기 제2 온도 값 중 적어도 하나를 포함할 수 있다. 프로세서는 제1 온도 값(실내기 초기 온도 또는 실외기 초기 온도) 및 제2 온도 값(실내기 검지 시점 온도 또는 실외기 검지 시점 온도)에 기초하여 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 프로세서는 실외기의 비정상 환경 및 실내기의 비정상 환경을 판담함에 있어, 우선 순위를 정할 수 있다. 프로세서는 실내기의 비정상 환경을 먼저 판단할 것인지 실외기의 비정상 환경을 먼저 판 단할 것인지 결정할 수 있다. 이러한 결정은 임계 시간에 따라 정해질 수 있다. 여기서, 제1 온도 센서(실내기 온도 센서)에 대응되는 임계 시간은 제2 온도 센서(실외기 온도 센서)에 대응되는 임계 시간보다 길 수 있다. 실외기 온도 센서의 임계 시간을 작게 하는 것은 실외기실의 온도가 급격히 상승하여 실외기의 고장을 방 지하기 위한 것일 수 있다. 따라서, 프로세서는 실내기의 비정상 환경보다 실외기의 비정상 환 경을 먼저 판단하여, 공기 조화기의 고장을 미리 방지할 수 있다. 구체적으로, 프로세서는 제2 온도 센서(실외기 온도 센서)를 통해 획득된 제1 온도 값 및 제2 온도 값에 기초하여 실외기가 설치된 환경이 기설정된 조건을 만족하지 않는 것으로 식별되면 프로세서는 실외 기가 설치된 환경과 관련된 알림 정보를 제공할 수 있고, 실내기가 설치된 환경과 관련된 알림 정보 를 제공하지 않을 수 있다. 실외기가 고장 난 것으로 식별되면, 실내 환경 역시 비정상 환경일 확률이 높 다. 따라서, 프로세서는 실외기의 주변 환경이 비정상인 경우, 실내기의 주변 환경에 대해서 분 석하지 않을 수 있다. 이와 관련하여 구체적인 설명은 도 26에서 후술 한다. 실내기의 주변 환경이 비정상 환경인지 여부를 식별하는 동작과 관련된 내용을 설명한다. 프로세서는 실내 기 온도 센서로부터 획득한 실내기 제1 온도 값 및 임계 시간이 경과한 시점의 설정 온도 값 간 차이가 제1 기 준값 이상이고(상술한 비정상 환경 판단의 전제 조건에 대응), 실내기 제1 온도 값 및 실내기 제2 온도 값 간 차이가 제2 기준값 이하이면(상술한 비정상 환경 판단의 제 1조건에 대응), 실내기가 설치된 환경과 관련 된 알림 정보를 제공할 수 있다. 또한, 공기 조화기는 초기 온도 별 기준 냉방 속도에 대한 정보를 저장하는 메모리를 더 포함할 수 있고, 프로세서는 제1 온도 값 및 제2 온도 값에 기초하여 임계 시간에 대응되는 현재 냉방 속도를 식별할 수 있 다. 임계 시간에 대응되는 현재 냉방 속도는 임계 시간 동안 변경된 온도 값에 기초한 온도 변화율을 의미할 수 있다. 그리고, 프로세서는 메모리에 저장된 정보에 기초하여 제1 온도 값에 대응되는 기준 냉방 속도를 식별할 수 있고, 현재 냉방 속도, 기준 냉방 속도, 임계 시간이 경과한 시점(비정상 환경 검지 시점)의 설정 온도 값에 기초하여 실내기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 최초 설정 온도를 유지한 경우 최 초 설정 온도와 임계 시간이 경과한 시점의 설정 온도 값은 동일하지만, 임계 시간이 경과하기 전에 설정 온도 를 변경하는 경우, 임계 시간이 경과한 시점의 설정 온도 값은 최초 설정 온도와 다를 수 있다. 설정 온도가 변 경되는 실시 예에 대해서는 도 15 및 도 16에서 후술한다. 한편, 공기 조화기는 압축기를 더 포함할 수 있고, 프로세서는 제1 온도 값, 제2 온도 값 및 압축기의 주 파수에 기초하여 공기 조화기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 압축기 주파수와 관 련된 조건은 상술한 비정상 환경 판단의 제 4조건에 대응될 수 있다. 한편, 프로세서는 실외기 온도 센서로부터 획득한 실외기 제1 온도 값 및 임계 시간이 경과한 시점의 실외기 제 2 온도 값 간 차이가 제3 기준값 이상이면 실외기의 현재 환경이 비정상이라고 식별하고 알림 정보를 제공 할 수 있다. 한편, 공기 조화기는 초기 온도 별 실외기의 기준 온도에 대한 정보를 저장하는 메모리를 더 포함할 수 있고, 프로세서는 실외기 제1 온도 값에 대응되는 실외기의 기준 온도 및 실외기 제2 온도 값의 차이에 기초하여 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 여기서, 실외기 기준 온도는 도 12 에서 구체적으로 후술한다. 한편, 공기 조화기는 알림 정보를 제공함에 있어 다양한 방법을 이용할 수 있다. 일 실시 예에 따라, 공 기 조화기는 스피커를 더 포함할 수 있고, 프로세서는 환경과 관련된 알림 정보를 음성으로 제공하도록 스피커를 제어할 수 있다. 다른 실시 예에 따라, 공기 조화기는 통신 인터페이스를 더 포함할 수 있고, 프로세서는 환경과 관련된 알림 정보를 외부 장치로 제공하도록 통신 인터페이스를 제어할 수 있다. 알림 제공 방법에 대한 다양한 실시 예는 도 4 내지 도 10에서 구체적으로 후술한다. 한편, 공기 조화기의 알림 정보 제공 또는 데이터 저장에 있어서 예외에 해당하는 조건에 대하여 설명한 다. 실외기 주변 환경이 비정상이라고 식별되면, 프로세서는 실내기와 관련된 알림 정보를 제공 하지 않을 수 있다. 또한, 실외기 주변 환경이 비정상이라고 식별되면, 프로세서는 실내기와 관련된 데이터를 메모리에 저장하지 않을 수 있다 (학습하지 않을 수 있다). 또한, 공기 조화기가 특정 모 드(저소음 모드, 취침 모드, 열대야 쾌면 모드 등)인 경우 비정상 환경을 식별해도 음성으로 알림을 제공하지 않을 수 있다. 이 경우, 공기 조화기는 공기 조화기의 디스플레이 또는 외부 장치의 디스플레이를 이용하여 알림 정보를 제공할 수 있다. 또한, 공기 조화기는 기 설정된 횟수만큼 연속으로 동일한 비정상 환경을 식별하면, 메모리에 저장된 이용 데이터(히스토리 데이터)를 초기화 할 수 있다. 예를 들어, 프로세서 가 실내기 주변 환경에서 창문 열림을 연속 3번 판단하였다면 기존 메모리에 저장된 이용 데이터를 모두 초기화 할 수 있다. 반복하여 비정상 환경이 식별되는 것은 사용 환경이 변경된 것으로 볼 수 있으므로, 공기 조화기는 새로운 데이터에 기초하여 분석하기 위하여 기존 데이터를 초기화 할 수 있다. 한편, 실외기의 온도 센서로부터 획득한 온도 값을 분석하는 동작의 주체가 공기 조화기로 설명하였다. 여기서, 공기 조화기는 실내기, 실외기 또는 별도의 제어 장치일 수 있으므로, 온도 값을 분석 하는 동작은 실내기, 실외기 또는 별도의 제어 장치 중 적어도 하나에서 수행할 수 있다. 다만, 본 명세서에서는 설명의 편의를 위하여 분석 동작(비정상 환경 판단 동작)을 실내기의 프로세서가 수행하는 것으로 기재한다. 한편, 본 개시에 따른 공기 조화기는 사용자에게 직접 알림 정보를 제공하기 때문에 사용자는 제품 자체 의 고장이 아닌 비정상 환경에 대한 정보를 제공 받을 수 있으며 사용자는 알림 정보에 기초하여 자가 조치를 수행할 수 있다. 따라서, 서비스 상담 센터에서 발생되는 상담 비용 또는 서비스 비용을 절감할 수 있다. 그리 고, 사용자가 알림 정보에 따라 해결 동작을 수행하면 공기 조화기의 전력량이 줄게 되어 에너지가 절감 될 수 있다. 한편, 상술한 설명에서는 실내기 온도 센서 또는 실외기 온도 센서 만을 기재하였지만, 공기 조화기는 열 교환기 온도 센서, 습도 센서 등을 추가로 포함할 수 있으며, 열 교환기 온도 센서 또는 습도 센서로부터 획득 되는 데이터에 기초하여 비정상 환경에 대한 판단 동작을 수행할 수 있다. 도 3은 도 2의 실내기의 구체적인 구성 및 실외기의 구체적인 구성을 설명하기 위한 블록도이다. 도 3을 참조하면, 공기 조화기는 실내기 및 실외기를 포함할 수 있다. 그리고, 실내기는 실내기 온도 센서, 프로세서, 메모리, 통신 인터페이스, 냉방부 , 사용자 인터페이스, 디스플레이 및 스피커를 포함할 수 있다. 온도 센서 및 프로세서의 동작 중에서 앞서 설명한 것과 동일한 동작에 대해서는 중복 설명은 생략한 다. 프로세서는 메모리에 저장된 각종 프로그램을 이용하여 공기 조화기의 동작을 전반적으로 제어 한다. 구체적으로, 프로세서는 RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스, 버스를 포함할 수 있다. RAM, ROM, 메인 CPU, 제1 내지 n 인터페이스 등은 버스를 통해 서로 연결될 수 있다. ROM에는 시스템 부팅을 위한 명령어 세트 등이 저장된다. 턴 온 명령이 입력되어 전원이 공급되면, 메인 CPU는 ROM에 저장된 명령어에 따라 메모리에 저장된 O/S를 RAM에 복사하고, O/S를 실행시켜 시스템을 부팅시킨다. 부팅이 완료되면, 메인 CPU는 메모리에 저장된 각종 어플리케이션 프로그램을 RAM에 복사하고, RAM에 복사된 어플리케이션 프로그램을 실행시켜 각종 동작을 수행한다. 메인 CPU는 메모리에 액세스하여, 메모리에 저장된 O/S를 이용하여 부팅을 수행한다. 그리고, 메모리 에 저장된 각종 프로그램, 컨텐츠 데이터 등을 이용하여 다양한 동작을 수행한다. 제1 내지 n 인터페이스는 상술한 각종 구성 요소들과 연결된다. 인터페이스들 중 하나는 네트워크를 통해 외부 장치와 연결되는 네트워크 인터페이스가 될 수도 있다. 한편, 프로세서는 그래픽 처리 기능(비디오 처리 기능)을 수행할 수 있다. 예를 들어, 프로세서는 연 산부(미도시) 및 렌더링부(미도시)를 이용하여 아이콘, 이미지, 텍스트 등과 같은 다양한 객체를 포함하는 화면 을 생성할 수 있다. 여기서, 연산부(미도시)는 수신된 제어 명령에 기초하여 화면의 레이아웃에 따라 각 객체들 이 표시될 좌표 값, 형태, 크기, 컬러 등과 같은 속성값을 연산할 수 있다. 그리고, 렌더링부(미도시)는 연산부 (미도시)에서 연산한 속성값에 기초하여 객체를 포함하는 다양한 레이아웃의 화면을 생성할 수 있다. 또한, 프 로세서는 비디오 데이터에 대한 디코딩, 스케일링, 노이즈 필터링, 프레임 레이트 변환, 해상도 변환 등과같은 다양한 이미지 처리를 수행할 수 있다. 한편, 프로세서는 오디오 데이터에 대한 처리를 수행할 수 있다. 구체적으로, 프로세서는 오디오 데 이터에 대한 디코딩이나 증폭, 노이즈 필터링 등과 같은 다양한 처리가 수행될 수 있다. 메모리는 프로세서에 포함된 롬(ROM)(예를 들어, EEPROM(electrically erasable programmable read- only memory)), 램(RAM) 등의 내부 메모리로 구현되거나, 프로세서와 별도의 메모리로 구현될 수도 있다. 이 경우, 메모리는 데이터 저장 용도에 따라 실내기에 임베디드된 메모리 형태로 구현되거나, 실내기 에 탈부착이 가능한 메모리 형태로 구현될 수도 있다. 예를 들어, 실내기의 구동을 위한 데이터의 경 우 실내기에 임베디드된 메모리에 저장되고, 실내기의 확장 기능을 위한 데이터의 경우 실내기 에 탈부착이 가능한 메모리에 저장될 수 있다. 한편, 실내기에 임베디드된 메모리의 경우 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또 는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나로 구현되고, 실내기 에 탈부착이 가능한 메모리의 경우 메모리 카드(예를 들어, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 등), USB 포트에 연결 가능한 외부 메모리(예를 들어, USB 메모리) 등과 같은 형태로 구현될 수 있다. 통신 인터페이스는 오디오 신호를 포함하는 오디오 컨텐츠를 입력 받을 수 있다. 예를 들어 통신 인터페이 스는 AP 기반의 Wi-Fi(와이파이, Wireless LAN 네트워크), 블루투스(Bluetooth), 지그비(Zigbee), 유/무 선 LAN(Local Area Network), WAN, 이더넷, IEEE 1394, HDMI, USB, MHL, AES/EBU, 옵티컬(Optical), 코액셜 (Coaxial) 등과 같은 통신 방식을 통해 외부 장치(예를 들어, 소스 장치), 외부 저장 매체(예를 들어, USB), 외 부 서버(예를 들어 웹 하드) 등으로부터 스트리밍 또는 다운로드 방식으로 오디오 신호를 포함하는 오디오 컨텐 츠를 입력 받을 수 있다. 통신 인터페이스는 다양한 유형의 통신 방식에 따라 다양한 유형의 외부 장치와 통신을 수행하는 구성이다. 통신 인터페이스는 와이파이 모듈, 블루투스 모듈, 적외선 통신 모듈 및 무선 통신 모듈 등을 포함한다. 여기서, 각 통신 모듈은 적어도 하나의 하드웨어 칩 형태로 구현될 수 있다. 프로세서는 통신 인터페이스를 이용하여 각종 외부 장치와 통신을 수행할 수 있다. 와이파이 모듈, 블루투스 모듈은 각각 WiFi 방식, 블루투스 방식으로 통신을 수행한다. 와이파이 모듈이나 블루 투스 모듈을 이용하는 경우에는SSID 및 세션 키 등과 같은 각종 연결 정보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 적외선 통신 모듈은 시 광선과 밀리미터파 사이에 있는 적외선을 이용하여 근거리에 무선으로 데이터를 전송하 는 적외선 통신(IrDA, infrared Data Association)기술에 따라 통신을 수행한다. 무선 통신 모듈은 상술한 통신 방식 이외에 지그비(zigbee), 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), LTE-A(LTE Advanced), 4G(4th Generation), 5G(5th Generation)등과 같은 다양한 무선 통신 규격에 따라 통신을 수행하는 적어도 하나의 통신 칩을 포함할 수 있다. 그 밖에 통신 인터페이스는LAN(Local Area Network) 모듈, 이더넷 모듈, 또는 페어 케이블, 동축 케이블 또는 광섬유 케이블 등을 이용하여 통신을 수행하는 유선 통신 모듈 중 적어도 하나를 포함할 수 있다. 일 예에 따라 통신 인터페이스는 리모컨과 같은 외부 장치 및 외부 서버와 통신하기 위해 동일한 통신 모 듈(예를 들어, Wi-Fi 모듈)을 이용할 수 있다. 다른 예에 따라 통신 인터페이스는 리모컨과 같은 외부 장치 및 외부 서버와 통신하기 위해 상이한 통신 모듈(예를 들어, Wi-Fi 모듈)을 이용할 수 있다. 예를 들어, 통신 인터페이스는 외부 서버와 통신하기 위 해 이더넷 모듈 또는 WiFi 모듈 중 적어도 하나를 이용할 수 있고, 리모컨과 같은 외부 장치와 통신하기 위해 BT 모듈을 이용할 수도 있다. 다만 이는 일 실시 예에 불과하며 통신 인터페이스는 복수의 외부 장치 또는 외부 서버와 통신하는 경우 다양한 통신 모듈 중 적어도 하나의 통신 모듈을 이용할 수 있다.냉방부는 온도가 제어된 공기를 배출하여 실내 공기를 조화하는 구성이다. 구체적으로, 냉방부는 실 내 열 교환기, 팽창 밸브, 송풍 팬 등을 포함할 수 있다. 여기서, 실내 열 교환기는 실내기에 유입된 공기와 실외기에서 제공된 냉매와의 열을 교환할 수 있다. 구 체적으로, 실내 열 교환기는 냉방시에 증발기의 역할을 수행할 수 있다. 즉, 실내 열 교환기는 저압 저온의 안 개 상태인 냉매가 기체로 증발하는 상전이에 필요한 잠열을 실내기에 유입된 공기로부터 흡수하도록 할 수 있다. 반대로, 실내 열 교환기는 난방 시에 응축기의 역할을 수행할 수 있다. 즉, 냉방과 반대로 냉매의 흐름이 역전되면 실내 열 교환기를 통과하는 냉매의 열이 실내기에 유입된 공기로 방출될 수 있다. 팽창 밸브는 냉매의 압력을 조절한다. 구체적으로, 팽창 밸브는 냉방시에 실외 열 교환기를 통과한 고압 저온의 냉매를 팽창시켜 압력을 낮출 수 있다. 또한, 실내 열 교환기로 유입되는 냉매량을 조절할 수도 있다. 반대로, 팽창 밸브는 난방 시에 실내 열 교환기를 통과한 냉매를 실외 열 교환기로 전달하기 전에 저압 고온의 냉매를 팽창시켜 압력을 낮출 수 있다. 또한, 실외 열 교환기로 유입되는 냉매량을 조절할 수 있다. 송풍 팬은 외부 공기를 실내기의 내부로 유입시키고, 열 교환에 의해 온도가 달라진 공기를 실내기 밖으로 배출할 수 있다. 그리고, 냉방부는 프로세서의 제어에 따라, 실내 공간에 배출되는 공기의 온도 및 바람의 세기 등을 조절할 수 있다. 한편, 설명의 편의를 위해 공기의 온도를 제어하는 구성을 냉방부라고 지칭하였으나, 냉방에 한정되지 않 고, 실내 공기의 온도를 높이는 난방, 실내에 기류를 형성하는 송풍 및 실내 습도를 낮추는 제습 중 적어도 하 나의 공기 조화를 수행할 수도 있다. 사용자 인터페이스는 버튼, 터치 패드, 마우스 및 키보드와 같은 장치로 구현되거나, 상술한 디스플레이 기능 및 조작 입력 기능도 함께 수행 가능한 터치 스크린으로도 구현될 수 있다. 여기서, 버튼은 실내기의 본체 외관의 전면부나 측면부, 배면부 등의 임의의 영역에 형성된 기계적 버튼, 터치 패드, 휠 등과 같은 다양 한 유형의 버튼이 될 수 있다. 디스플레이는 LCD(Liquid Crystal Display), OLED(Organic Light Emitting Diodes) 디스플레이, PDP(Plasma Display Panel) 등과 같은 다양한 형태의 디스플레이로 구현될 수 있다. 디스플레이내에는 a- si TFT, LTPS(low temperature poly silicon) TFT, OTFT(organic TFT) 등과 같은 형태로 구현될 수 있는 구동 회로, 백라이트 유닛 등도 함께 포함될 수 있다. 한편, 디스플레이는 터치 센서와 결합된 터치 스크린, 플 렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display) 등으로 구현될 수 있다. 스피커는 각종 오디오 데이터뿐만 아니라 각종 알림 음이나 음성 메시지 등을 출력하는 구성요소일 수 있 다. 구체적으로, 스피커는 비정상 환경에 대한 알림 정보를 음성으로 출력할 수 있다. 한편, 실외기는 실외기 온도 센서, 실외 팬, 압축기 및 메모리를 구성될 수 있다. 실외기 온도 센서는 실외기가 설치된 공간의 온도를 감지하기 위한 구성일 수 있다. 일 실시 예에 따 라, 실외기가 실외에 설치된 경우 실외기 온도 센서는 실외 온도를 감지할 수 있다. 다른 실시 예에 따라, 실외기가 실외기실에 설치된 경우, 실외기 온도 센서는 실외기실의 온도를 감지할 수 있다. 한 편, 실외기 온도 센서는 온도를 감지할 수 있는 위치라면 어디든지 배치(또는 설치)될 수 있다. 실외 팬은 실외 열 교환기에서 열 교환이 이루어지도록 실외 팬 모터에 의해 실외 공기를 강제로 토출하는 구성일 수 있다. 또한, 실외 팬의 회전 속도는 프로세서로부터 전달되는 제어 신호에 기초하여 변경 될 수 있다. 압축기는 냉매를 고온 고압의 기체상태로 압축하는 구성일 수 있다. 메모리는 실외기와 관련된 설정 정보, 제어 정보 또는 각종 정보를 저장하는 구성일 수 있다. 도 4는 일 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 4를 참조하면, 실내기는 스피커를 포함할 수 있다. 스피커는 실내기의 외부에 배치될 수 있다. 구체적으로, 공기 조화기가 설치된 환경이 비정상 환경으로 식별되면, 공기 조화기는 공 기 조화기가 설치된 환경과 관련된 알림을 스피커를 통해 출력할 수 있다. 그리고, 알림은 비정상 환경의 감지 여부 및 해결 방안에 대한 정보를 동시에 포함할 수 있다. 알림 정보가 음성으로 출력되면 사용자가 바로 대응 동작을 수행할 수 있으므로, 공기 조화기의 전력을 절약할 수 있다. 한편, 도 4에서 일 실시 예에 따른 스피커가 실내기의 상단부에 배치되어 있는 것으로 도시하였다. 하지만, 다른 실시 예에 따른 스피커는 상단부 이외에 하단부 또는 후면부에 배치될 수 있다. 도 5는 다른 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 5를 참조하면, 실내기는 디스플레이를 포함할 수 있다. 디스플레이는 실내기의 외부에 배치될 수 있다. 구체적으로, 공기 조화기가 설치된 환경이 비정상 환경으로 식별되면, 공기 조화기 는 공기 조화기가 설치된 환경과 관련된 알림을 디스플레이를 통해 출력할 수 있다. 그리고, 알림은 비정상 환경의 감지 여부 및 해결 방안에 대한 정보를 동시에 포함할 수 있다. 한편, 다른 실시 예에 따라, 실내기는 스피커 및 디스플레이를 동시에 포함할 수 있다. 그리고, 공기 조화기가 설치된 환경이 비정상 환경으로 식별되면, 공기 조화기는 공기 조화기가 설치 된 환경과 관련된 알림을 스피커 또는 디스플레이 중 적어도 하나를 통해 출력할 수 있다. 도 6은 또 다른 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 6을 참조하면, 실내기는 비정상 환경에 대한 알림을 제공하기 위하여 서버를 이용할 수 있다. 구 체적으로, 공기 조화기가 설치된 환경이 비정상 환경으로 식별되면, 실내기는 비정상 환경에 대한 알림 정보를 서버에 전송할 수 있다. 여기서, 서버는 클라우드 서버일 수 있다. 그리고, 서버에 전송되는 비정상 환경에 대한 알림 정보 는 비정상 환경에 대응되는 코드 정보 일 수 있다. 서버는 수신한 코드 정보에 기초하여 공기 조화기 의 비정상 환경이 무엇인지 식별하고 식별된 비정상 환경의 해결책을 식별할 수 있다. 그리고, 서버 는 식별된 비정상 환경 및 비정상 환경에 대응되는 해결책에 대한 정보를 사용자 단말 장치에 전송 할 수 있다. 서버는 특정 공기 조화기에 대응되는 사용자 단말 장치를 하나의 그룹으로 저장할 수 있다. 서버는 그룹으로 저장된 정보 중 특정 공기 조화기에 대응되는 사용자 단말 장치를 식별하고, 식별된 사용자 단말 장치에 비정상 환경에 대한 알림 정보를 제공할 수 있다. 사용자 단말 장치는 서버로부터 수신되는 정보에 기초하여 비정상 환경에 대한 알림 정보를 출력할 수 있다. 여기서, 사용자 단말 장치는 스피커 또는 디스플레이 중 적어도 하나를 포함할 수 있다. 그 리고, 사용자 단말 장치는 스피커 또는 디스플레이 중 적어도 하나를 이용하여 비정상 환경에 대한 알림 정보를 출력할 수 있다. 일 실시 예에 따라, 사용자 단말 장치는 스피커를 통해 비정상 환경에 대한 알림 정보를 출력할 수 있다. 다른 실시 예에 따라, 사용자 단말 장치는 디스플레이에 표시되는 UI를 이용하여 비정상 환경에 대한 알림 정보를 출력할 수 있다. 여기서, UI는 알림 제공 여부를 나타내는 정보(예를 들어, “공기 조화 시스 템 관리, 새로운 알림 도착”), 비정상 환경의 감지 여부(예를 들어, “비정상 환경이 감지되었습니다”) 또는 비정상 환경에 대응되는 해결책 정보(예를 들어, “창문을 닫아주세요”) 중 적어도 하나를 포함할 수 있다. 도 7은 또 다른 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 7을 참조하면, 실내기는 사용자 단말 장치에 직접 비정상 환경에 대한 알림 정보를 전송할 수 있 다. 여기서, 사용자 단말 장치는 실내기와 페어링 된 장치를 의미할 수 있다. 공기 조화기가 설치된 환경이 비정상 환경으로 식별되면, 실내기는 페어링 된 사용자 단말 장치에 비정상 환경에 대 한 알림 정보를 통신 인터페이스를 통해 직접 전송할 수 있다. 한편, 사용자 단말 장치에서 출력되는 비정상 환경에 대한 알림 정보는 도 6에서 설명한 것과 중복되므로 구체적인 설명은 생략한다. 도 8은 일 실시 예에 따른 디스플레이에 표시되는 알림 정보를 설명하기 위한 도면이다. 도 8을 참조하면, 사용자 단말 장치는 비정상 환경에 대한 알림 정보를 UI를 이용하여 출력할 수 있다. 사 용자 단말 장치를 디스플레이에 UI를 표시하여 사용자에게 비정상 환경에 대한 알림 정보를 제공할 수 있 다. 비정상 환경에 대한 알림 정보를 제공하는 UI는 실내기에 대한 정보를 제공하는 UI 또는 실외기에 대한 정보를 제공하는 UI 중 적어도 하나를 포함할 수 있다. 사용자 단말 장치는 실내기에 대한 정보를 제공하는 UI를 이용하여 실내기가 설치된 환경 의 비정상 여부 또는 해결책 중 적어도 하나를 표시할 수 있다. 사용자 단말 장치는 실외기에 대한 정보를 제공하는 UI를 이용하여 실외기가 설치된 환경 의 비정상 여부 또는 해결책 중 적어도 하나를 표시할 수 있다. 도 9는 다른 실시 예에 따른 디스플레이에 표시되는 알림 정보를 설명하기 위한 도면이다. 도 9를 참조하면, 실내기는 실내 공간에 배치될 수 있다. 실내 공간은 창문을 통해 공기를 환기시킬 수 있다. 창문은 외부 공기가 실내 공간으로 들어오는 통로 또는 내부 공기가 실외로 나가 는 통로가 될 수 있다. 더운 여름철에 공기 조화기가 가동되는 경우를 가정한다. 창문이 닫혀져 있 지 않다면, 외부공기가 계속 실내 공간으로 유입될 수 있다. 따라서, 공기 조화기의 가동에도 불구 하고 실내 온도가 떨어지지 않을 수 있다. 만약, 사용자에게 아무런 알림이 제공되지 않는다면, 공기 조화기 가 계속 가동되므로 전력량이 크게 낭비될 수 있다. 따라서, 본 개시의 일 실시 예에 따른 공기 조화기는 실내기의 온도 센서를 이용하여 실내 온도를 측정할 수 있다. 그리고, 공기 조화기는 실내 온도의 변화량 및 설정 온도에 기초하여 실내기가 설 치된 장소 주변의 환경이 정상인지 비정상인지 여부를 판단할 수 있다. 만약, 실내기가 설치된 장소 주변 의 환경이 비정상이라면, 공기 조화기는 사용자에게 비정상 환경에 대한 알림 정보를 제공할 수 있다. 예 를 들어, 실내기는 실내기 가 설치된 실내 공간의 주변 환경이 정상인지 비정상인지 판단할 수 있다. 실내기는 실내기에 포함된 온도 센서를 이용하여 온도 변화량을 측정할 수 있으며, 측정된 온도 변 화량 및 설정 온도를 분석할 수 있다. 실내기는 임계 시간 이후에도 설정 온도에 비하여 실내 온도가 크게 떨어 지지 않는 경우, 실내 공간의 창문이 열린 것으로 판단할 수 있다. 실내 공간의 창문(90 6)이 열린 상황은 실내기의 동작에 있어 정상적이지 않은 상황일 수 있으므로, 실내기는 실내기(10 0)가 설치된 실내 공간의 주변 환경이 비정상으로 결정할 수 있다. 그리고, 실내기는 비정상 환경에 대한 알림 정보를 사용자에게 제공할 수 있다. 사용자에게 알림 정보를 제공하는 방법은 도 4 내지 도 7에서 설명한 바와 같이 다양할 수 있다. 다만, 설명의 편의를 위하여 도 9 및 도10을 설명함에 있어, 사용자에게 알림 정보를 제공하는 방법은 페어링 된 사용자 단말 장치의 디스플레이에 정보를 디스플레이하는 것일 수 있다. 실내기는 비정상 환경에 대한 알림 정보를 사용자 단말 장치에 전송하고, 사용자 단말 장치는 비정상 환경에 대한 알림 정보를 디스플레이에 표시할 수 있다. 구체적으로, 비정상 환경에 대한 알림 정보는 비정상 환경에 대응되는 해결책을 그림 또는 동영상으로 표시하는 UI, 실내기에 대한 정보를 제공하 는 UI, 실외기에 대한 정보를 제공하는 UI를 포함할 수 있다. 비정상 환경에 대응되는 해결책을 그림으로 표시하는 UI는 사용자가 비정상 환경에 어떻게 행동해야 하는 지 직관적인 그림 또는 동영상을 포함할 수 있다. 그림이나 동영상으로 사용자의 행동을 제공하면, 사용자는 쉽 게 비정상 환경에 대한 해결책을 이해할 수 있다. 실내기에 대한 정보를 제공하는 UI는 실내기가 설치된 공간 주변의 환경의 이상 여부 또는 해결 책에 대한 정보를 표시할 수 있다. 여기서, 정보는 텍스트 정보를 의미할 수 있다. 실외기에 대한 정보를 제공하는 UI 실외기가 설치된 공간 주변의 환경의 이상 여부 또는 해결책 에 대한 정보를 표시할 수 있다. 여기서, 정보는 텍스트 정보를 의미할 수 있다. 일 실시 예에 따른 비정상 환경에 대한 알림 정보는 그림 또는 동영상을 제공하는 UI , 실내기에 대 한 정보를 제공하는 UI 및 실외기에 대한 정보를 제공하는 UI가 서로 구분되어 제공될 수 있다. 한편, 다른 실시 예에 따른 비정상 환경에 대한 알림 정보는 그림 또는 동영상을 제공하는 UI , 실내기 에 대한 정보를 제공하는 UI 및 실외기에 대한 정보를 제공하는 UI가 결합되어 제공될 수 있다. 예를 들어, 비정상 환경에 대한 알림 정보는 실내기에 대한 정보(텍스트 정보) 및 비정상 환경에 대 한 해결책을 포함하는 그림 또는 동영상이 결합된 형태의 UI를 이용하여 제공될 수 있다. 도 10은 또 다른 실시 예에 따른 디스플레이에 표시되는 알림 정보를 설명하기 위한 도면이다. 도 10을 참조하면, 실내기는 실내 공간에 배치될 수 있고, 실외기는 실외기실에 배치될 수 있다. 실외기는 실외에 배치된 형태로 이용될 수 있다. 다만, 경우에 따라 실외기는 실외가 아닌 실내기실 또는 실내 공간에 배치될 수 있다. 도 10은 실외기가 실내에 배치된 경우를 가정하여 설명한다. 실외기실은 실내 공간일 수 있으며 공기를 외부로 순환시킬 수 있도록 창문을 포함할 수 있다. 실 외기는 창문으로 뜨거운 공기를 외부로 토출할 수 있다. 만약, 창문이 열려 있지 않은 경우, 실외기가 토출하는 뜨거운 공기는 외부로 나갈 수 없다. 실외기로부터 토출된 뜨거운 공기가 실외기 실에 쌓이면, 실외기실의 온도가 상승하여 실외기의 성능을 저하시킬 수 있다. 따라서, 실외 기실의 창문이 닫혀 있는 상황은 비정상 환경으로 분류될 수 있다. 본 개시의 일 실시 예에 따른 공기 조화기는 실외기의 온도 센서를 이용하여 실외기실 온도를 측정할 수 있다. 그리고, 공기 조화기는 실외기실 온도의 변화량에 기초하여 실외기가 설치된 장소 주변의 환경이 정상인지 비정상인지 여부를 판단할 수 있다. 만약, 실외기가 설치된 장소 주변의 환 경이 비정상이라면, 공기 조화기 는 사용자에게 비정상 환경에 대한 알림 정보를 제공할 수 있다. 공기 조화기는 실외기에 포함된 온도 센서를 이용하여 온도 변화량을 측정할 수 있으며, 측정된 온 도 변화량을 분석할 수 있다. 공기 조화기는 실외기실 온도가 임계 시간 동안 기준값 이상으로 오 르는 경우, 실외기실의 창문이 닫힌 것으로 판단할 수 있다. 실외기실의 창문이 닫힌 상황은 실외기의 동작에 있어 정상적이지 않은 상황일 수 있으므로, 공기 조화기는 실외기가 설치된 실외기실의 주변 환경이 비정상으로 결정할 수 있다. 그리고, 공기 조화기는 비정상 환경에 대한 알림 정보를 사용자에게 제공할 수 있다. 공기 조화기는 비정상 환경에 대한 알림 정보를 사용자 단말 장치에 전송하고, 사용자 단말 장치 는 비정상 환경에 대한 알림 정보를 디스플레이에 표시할 수 있다. 구체적으로, 비정상 환경에 대한 알림 정보는 비정상 환경에 대응되는 해결책을 그림 또는 동영상으로 표시하는 UI, 실내기에 대한 정보를 제공하는 UI, 실외기에 대한 정보를 제공하는 UI를 포함할 수 있다. 일 실시 예에 따른 비정상 환경에 대한 알림 정보는 그림 또는 동영상을 제공하는 UI, 실내기에 대 한 정보를 제공하는 UI 및 실외기에 대한 정보를 제공하는 UI가 서로 구분되어 제공될 수 있 다. 한편, 다른 실시 예에 따른 비정상 환경에 대한 알림 정보는 그림 또는 동영상을 제공하는 UI , 실내기 에 대한 정보를 제공하는 UI 및 실외기에 대한 정보를 제공하는 UI가 결합되어 제공될 수 있다. 예를 들어, 비정상 환경에 대한 알림 정보는 실외기에 대한 정보(텍스트 정보) 및 비정상 환경에 대한 해결책을 포함하는 그림 또는 동영상이 결합된 형태의 UI를 이용하여 제공될 수 있다. 도 10에서 개시하는 각 UI에 대한 설명은 도9에서 기재한 설명과 중복되므로, 자세한 내용은 생략한다. 도 11은 실내 온도와 관련된 기준 냉방 속도를 설명하기 위한 도면이다. 도 11을 참조하면, 공기 조화기는 초기 온도에 따른 기준 냉방 속도를 메모리에 저장할 수 있다. 냉방 속 도란, 시간에 따른 온도 변화를 의미할 수 있다. 본 명세서에서는 냉방 속도를 분당 온도 변화량으로 계산한다. 예를 들어, 30분 동안 온도가 30도에서 21도로 변하였다고 가정한다. 여기서, 30분 동안 온도가 9도 떨어졌으므 로, 냉방 속도는 0.3일 수 있다. 한편, 기준 냉방 속도는 실내기가 설치된 환경이 정상인 경우에 측정된 냉방 속도를 의미할 수 있다. 그리 고, 초기 온도는 공기 조화기가 턴 온 명령을 수신한 시점의 실내 온도 또는 공기 조화기가 냉방을 시작하는 시점의 실내 온도를 의미할 수 있다. 실내 온도는 실내기의 온도 센서를 통해 획득될 수 있다. 일 실시 예에 따른 기준 냉방 속도는 최초 공기 조화기가 설치된 이후 공기 조화기의 동작에 따라 획득된 데이터일 수 있다. 사용자가 최초로 공기 조화기를 설치하면, 공기 조화기는 기 설정된 횟 수만큼 공기 조화기를 가동하여 샘플 데이터를 메모리에 저장한다. 그리고, 공기 조화기는 저장된 샘플 데이터를 분석하여 정상적인 환경에서의 냉방 속도를 분석할 수 있다. 그리고, 공기 조화기는 평균 적인 냉방 속도를 기준 냉방 속도로 결정하고 결정된 기준 냉방 속도를 메모리에 저장할 수 있다. 다른 실시 예에 따른 기준 냉방 속도는 기 정해진 데이터일 수 있다. 기준 냉방 속도는 샘플 데이터들의 평균 계산을 통해 얻어진 데이터 일 수 있으며, 공기 조화기의 종류에 따라 미리 설정된 값일 수 있다. 한편, 기준 냉방 속도는 초기 온도에 따라 다를 수 있다. 일반적으로 공기 조화기의 설정 온도가 20도에 서 24도임을 가정하면, 초기 온도가 높을수록 냉방 속도가 클 수 있다. 따라서, 기준 냉방 속도는 초기 온도에따라 다르게 저장될 수 있다. 도 11에서 개시한 표는 초기 온도 별 기준 냉방 속도를 테이블로 정리한 것이다. 기준 냉방 속도는 초기 온도가 높을수록 빠를 수 있다. 그리고, 기준 냉방 속도는 비정상 환경 여부를 판단하는 동작에 이용될 수 있다. 구체적으로, 공기 조화기는 실내기 온도센서로부터 온도 변화량을 획득할 수 있다. 그리고, 공기 조화기는 획득된 온도 변화량에 기초하여 현재 냉방 속도를 획득할 수 있다. 그리고, 공기 조화기 는 표에 저장된 기준 냉방 속도 및 획득된 현재 냉방 속도를 비교할 수 있다. 공기 조화기는 기준 냉방 속도 및 현재 냉방 속도의 차이가 기준값 이상이면 실내기가 설치된 장소의 주변 환경이 비정상 인 것으로 판단할 수 있다. 도 12는 실외기와 관련된 기준 온도를 설명하기 위한 표이다. 도 12를 참조하면, 표는 초기 온도에 따른 실외기 기준 온도를 테이블로 정리한 것이다. 공기 조화기 는 메모리에 실외기 기준 온도를 저장할 수 있다. 실외기 기준 온도는 공기 조화기가 턴 온 명령을 수신한 이후 임계 시간이 경과한 시점의 실외기 예상 온도를 의미할 수 있다. 공기 조화기는 실외기 온도 를 실내기의 온도 센서로부터 획득할 수 있다. 구체적으로, 실외기는 공기 조화기로부터 온도 를 측정하라는 제어 명령을 수신할 수 있고, 제어 명령이 수신되면, 실외기는 실외기의 온도 센서를 이용하여 온도를 측정할 수 있다. 그리고, 실외기는 측정된 온도 센서를 공기 조화기에 전송할 수 있다. 일 실시 예에 따른 실외기 기준 온도는 기 설정된 데이터일 수 있다. 예를 들어, 제품 설치 단계 또는 소프트웨 어 업그레이드 등을 통해 정해진 값이 실외기 기준 온도로 설정될 수 있다. 제조사는 테스트를 수행하거나 사용 자들의 데이터를 수집하여 샘플 데이터로서 실외기 기준 온도를 정할 수 있다. 다른 실시 예에 따른 실외기 기준 온도는 제품 설치 후 기 설정된 횟수만큼 냉방 동작을 수행하여 획득된 데이 터에 기초하여 정해질 수 있다. 구체적으로, 실외기의 온도 센서가 냉방 동작을 수행할 때마다 턴 온 명령 이후 임계 시간이 경과한 시점의 실외기 온도를 기 설정된 횟수만큼 측정할 수 있다. 그리고, 공기 조화기 는 기 설정된 횟수만큼 측정된(또는 저장된) 데이터를 종합하여 초기 온도에 따른 실외기 기준 온도를 정 할 수 있다. 공기 조화기는 실외기 온도 센서로부터 획득한 온도 변화량에 기초하여 실외기가 설치된 장소의 주 변 환경의 비정상 여부를 판단할 수 있다. 공기 조화기는 턴 온 명령이 수신된 시점의 실외기 온도를 초 기 온도로 판단하고, 임계 시간이 경과한 시점의 실외기 온도와 초기 온도에 대응되는 실외기 기준 온도의 차이 값이 기준값 이상이면 실외기가 설치된 장소의 주변 환경이 비정상이라고 판단할 수 있다. 예를 들어, 턴 온 명령이 수신된 시점에 실외기 온도가 30도이고 임계 시간이 30분이며 기준값은 3으로 가정한 다. 초기 온도는 30도이며 표 그룹 4에 해당할 수 있다. 따라서, 초기 온도 30도에 대응되는 실외기 기준 온도는 34도일 수 있다. 턴 온 명령이 수신된 시점으로부터 30분후 실외기 온도가 34도라면, 실외기 온도(34도)와 실외기 기준 온도(34 도)의 차이값은 0일 수 있다. 따라서, 공기 조화기는 실외기가 설치된 장소의 주변 환경이 정상이라고 판 단할 수 있다. 하지만, 턴 온 명령이 수신된 시점으로부터 30분후 실외기 온도가 38도라면, 실외기 온도(38도) 와 실외기 기준 온도(34도)의 차이값은 4도 일 수 잇다. 차이값(4도)이 기준값보다 크므로, 공기 조화기 는 실외기가 설치된 장소의 주변 환경이 비정상이라고 판단할 수 있다. 도 13은 실내기의 온도 변화에 따라 비정상 환경을 감지하는 일 실시 예를 설명하기 위한 도면이다. 도 13을 참조하면, 그래프는 실내기의 온도 센서로부터 획득된 온도 정보를 표시한 것이다. 그래프 의 x축은 시간이며 단위는 분이고 y축은 온도이며 단위는 섭씨온도일 수 있다. 여기서, “t_check”은 턴 온 명령이 수신된 시점으로부터 임계 시간이 지난 시점(이후, 검지 시점 또는 비정상 환경 검지 시점으로 기술 한다)일 수 있다. 그래프는 설정 온도, 측정 온도, 예상 온도를 포함할 수 있다. 설정 온도는 사 용자가 직접 설정한 온도, 이전 냉방 동작에서 저장된 온도 또는 기 설정된 온도 중 적어도 하나를 의미할 수 있다. 그리고, 측정 온도는 현재 실내기의 온도 센서로부터 획득되는 온도를 의미할 수 있다. 그리 고, 예상 온도는 공기 조화기의 주변 환경이 정상인 경우 예상되는 실내 온도를 의미할 수 있다. 예상 온도는 시간에 따라 변화하는 공기 조화기의 이전 온도 데이터일 수 있다. 즉, 예상 온도는 정상 환경에서 작동된 공기 조화기의 실내기 온도 데이터를 의미할 수 있다. 공기 조화기는 임계 시간 후 실내기의 주변 환경이 비정상인지 여부를 판단할 수 있다(이후, 비정상 환경 판단으로 기술한다). 구체적으로, 공기 조화기는 설정 온도, 최초 온도 및 검지 시점 온도에 기초하 여 공기 조화기의 비정상 환경을 판단할 수 있다. 여기서, 최초 온도는 공기 조화기가 턴 온 명령 을 수신한 시점에 측정된 온도를 의미할 수 있다. 공기 조화기는 설정 온도 와 최초 온도의 차이값이 기준값 이상인 경우에만 비정상 환경을 판단할 수 있다. 기준값을 설정한 이유는 설정 온도와 최초 온도의 차이값이 작으면 비정상 환경에 대한 판단의 정확성 이 낮아질 수 있기 때문이다. 예를 들어, 기준값이 3도 라고 가정하면, 그래프에서는 설정 온도가 24도이 고 최초 실내 온도가 35도이므로 차이값(11도)이 기준값(3도)보다 크다. 따라서, 공기 조화기는 비정상 환경인지 여부를 판단할 수 있다. 또한, 공기 조화기는 설정 온도와 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경이 비 정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 5도 라고 가정한다. 도 13에서 설정 온도는 24도이고 검지 시점 온도는 33도이므로 차이값(9도)이 기준값 (5도)보다 크다. 따라서, 공기 조화기는 현재 환경 (실내기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 또한, 공기 조화기는 예상 온도와 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경이 비정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 4도라고 가정한다. 도 13에서 예상 온도는 24도이고 검지 시점 온도는 33도이므로 차이값(9도)이 기준값 (4도)보다 크다. 따라서, 공기 조화기는 현재 환경(실내기 의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 또한, 공기 조화기는 기준 냉방 속도와 현재 냉방 속도의 차이값이 기준값 이상인 경우, 현재 환경이 비 정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 0.1로 가정한다. 기준 냉방 속도는 초기 온도에 따라 결정될 수 있다. 도 11의 표에 따르면, 초기 온도 35도에 대응되는 기준 냉방 속도는 0.27일 수 있다. 그 리고, 현재 냉방 속도는 (35-33)/30=0.067(소수점 4번째 자리에서 반올림) 일 수 있다. 따라서, 기준 냉방 속도 (0.27)와 현재 냉방 속도(0.067)의 차이값은 0.203일 수 있다. 차이값(0.203)이 기준값(0.1)보다 크므로, 공기 조화기는 현재 환경(실내기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 한편, 도 13에서 설명한 다양한 비정상 환경 판단 조건 들은 사용자의 설정에 따라 개별적으로 적용되거나 조합 되어 적용될 수 있다. 그리고, 도 13에서 설명한 각각의 기준값들은 서로 다른 값일 수 있으며 초기 온도에 따 라 달라질 수 있다. 도 14는 실내기의 온도 변화에 따라 비정상 환경을 감지하는 다른 실시 예를 설명하기 위한 도면이다. 도 14를 참고하면, 그래프는 실내기의 온도 센서로부터 획득된 온도 정보를 표시한 것이다. 그래프 는 설정 온도, 측정 온도, 예상 온도를 포함할 수 있다. 구체적인 설명은 도 13에서 설명한 바와 동일하므로 생략한다. 공기 조화기는 설정 온도 와 최초 온도의 차이값이 기준값 이상인 경우에만 비정상 환경을 판단할 수 있다. 예를 들어, 기준값이 3도 라고 가정하면, 그래프에서는 설정 온도가 24도이고 최초 실내 온도가 27도이므로 차이값(3도)이 기준값(3도)와 동일하다. 따라서, 공기 조화기는 비정상 환경인지 여부를 판단 할 수 있다. (만약, 기준값이 4였다면, 공기 조화기는 비정상 환경인지 여부를 판단하지 않을 것이다.) 또한, 공기 조화기는 설정 온도와 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경이 비 정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 2도(초기 온도가 다르므로, 도 13의 기준값과 상이하 다) 라고 가정한다. 도 14에서 설정 온도는 24도이고 검지 시점 온도는 27도이므로 차이값(3도)이 기준값 (2 도)보다 크다. 따라서, 공기 조화기는 현재 환경(실내기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 또한, 공기 조화기는 예상 온도와 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경이 비정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 2도(초기 온도가 다르므로, 도 13의 기준값과 상이하다)라 고 가정한다. 예상 온도는 24도이고 검지 시점 온도는 27도이므로 차이값(3도)이 기준값 (2도)보다 크다. 따라 서, 공기 조화기는 현재 환경(실내기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 또한, 공기 조화기는 기준 냉방 속도와 현재 냉방 속도의 차이값이 기준값 이상인 경우, 현재 환경이 비 정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 0.1로 가정한다. 기준 냉방 속도는 초기 온도에 따라결정될 수 있다. 도 11의 표에 따르면, 초기 온도 27도에 대응되는 기준 냉방 속도는 0.17일 수 있다. 그 리고, 현재 냉방 속도는 (27-27)/30=0 일 수 있다. 따라서, 기준 냉방 속도(0.17)와 현재 냉방 속도의 차이 값은 0.17일 수 있다. 차이값(0.17)이 기준값(0.1)보다 크므로, 공기 조화기는 현재 환경(실내기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 한편, 도 14에서 설명한 다양한 비정상 환경 판단 조건 들은 사용자의 설정에 따라 개별적으로 적용되거나 조합 되어 적용될 수 있다. 그리고, 도 14에서 설명한 각각의 기준값들은 서로 다른 값일 수 있으며 초기 온도에 따 라 달라질 수 있다. 도 15는 실내기의 온도 변화에 따라 비정상 환경을 감지하는 또 다른 실시 예를 설명하기 위한 도면이다. 도 15를 참조하면, 그래프는 실내기의 온도 센서로부터 획득된 온도 정보를 표시한 것이다. 그래프 는 설정 온도, 측정 온도를 포함할 수 있다. 그래프에 대한 기본적인 설명은 도13과 동일하므로 생략한다. 설정 온도는 특정 시점에서 변경될 수 있다. 도 15는 임계 시간이 경과하기 이전에 설정 온도가 낮아진 경우(도 15에서는 25도에서 20도로 설정 온도가 변경된 경우를 가정)를 설명한 것이다. 그래프에서는 턴 온 명령이 수신된 시점을 t1으로 정하고, 설정 온도가 변경된 시점을 t2로 정할 수 있다. 그리고, 턴 온 명령이 수신된 후 임계 시간(도 15에서는 30분을 가정)이 경과한 시점을 t3로 정하고, 설정 온도가 변경된 후 임계 시 간이 경과한 시점을 t4로 정할 수 있다. 공기 조화기는 온도 변화량에 기초하여 비정상 환경을 판단할 수 있다. 여기서, 온도 변화량은 제1 시점 과 제2 시점의 시간 간격에서 변환된 온도 차이를 의미할 수 있다. 상술한 제1 시점과 제2 시점의 기준을 어떻 게 정할 것인지에 따라서 온도 변화량이 달라질 수 있다. 공기 조화기는 설정 온도가 변경 된 경우, 4개의 구간으로 온도 변화량을 획득할 수 있다. 제1구간 은 턴 온 명령이 수신된 시점 (t1)부터 설정 온도가 변경된 시점 (t2)까지 일 수 있다. 제1구간 에 따른 온도 변화량은 설정 온도가 변경되기 전까지 변화를 의미할 수 있다. 따라서, 공기 조화기는 t2 시점에서 빠르게 비정상 환경을 판단할 수 있다. 다만, 설정 온도 변경 시점이 빠를 경우, 비정상 환경에 대한 판단의 정확성이 낮을 수 있다. 제2 구간 은 턴 온 명령이 수신된 시점 (t1)부터 턴 온 명령이 수신된 후 임계 시간이 경과한 시점(t3) 까지 일 수 있다. 도 15에서는 설정 온도를 기존보다 더 낮춘 경우를 가정하였으므로, 제2구간의 온도 변화량은 제1 구간보다 정확성이 더 높을 수 있다. 제2군이 정확성이 높은 이유는 제1 구간은 임계 시간보다 작지만, 제2 구간은 적어도 임계 시간만큼 경과하였기 때문이다. 제3 구간 은 턴 온 명령이 수신된 시점 (t1)부터 설정 온도가 변경된 후 임계 시간이 경과한 시점(t4)까 지 일 수 있다. 제3 구간의 온도 변화량은 제1 구간 및 제2 구간보다 정확성이 더 높을 수 있다. 하지만, 비정상 환경을 판단하는 시간이 길면 공기 조화기가 비정상 환경으로 동작되는 시간이 길 수 있 다. 따라서, 제3 구간으로 비정상 환경을 판단하는 공기 조화기는 전력량이 많이 소모되는 경우가 있을 수 있다. 제4 구간은 설정 온도가 변경된 시점 (t2)부터 설정 온도가 변경된 후 임계 시간이 경과한 시점(t4)까지 일 수 있다. 제4 구간에 따른 온도 변화량은 변경된 설정 온도를 중점적으로 고려한 것일 수 있다. 다만, 도15 에서와 같이 이미 실내 온도가 많이 내려간 상태에서 설정 온도가 변경된 것이라면 온도 변화량이 작게 측정될 수 있다. 공기 조화기는 제1 구간 내지 제4구간 중 어느 구간에 따라 온도 변화량을 측정할 것인지 다양한 방법으 로 결정할 수 있다. 일 실시 예에 따라, 공기 조화기는 기 설정된 구간에 기초하여 온도 변화량을 측정할 수 있다. 또한, 다른 실시 예에 따른 공기 조화기는 설정 온도가 변경된 시점에 기초하여 온도 변화량을 획득하는 계산 구간을 결정할 수 있다. 구체적인 결정 과정은 그래프을 통해 도시한다. 공기 조화기는 설정 온도가 변경된 시점 (t2)이 제1 기준값 미만이면 제4 구간으로 온도 변화량을 측정할 수 있다. 설정 온도가 빨리 변경 되면 설정 온도가 변경 되기 전의 데이터의 중요성이 덜하므로, 공기 조화기는 설정 온도가 변경 된 이후의 데이터만을 이용하여 온도 변화량을 측정할 수 있다.또한, 공기 조화기는 설정 온도가 변경된 시점 (t2)이 제1 기준값 이상이면 제2 구간으로 온도 변 화량을 측정할 수 있다. 설정 온도의 변경 시점이 일정 시간 경과하면 이미 실내 온도가 떨어진 상태일 수 있으 므로, 공기 조화기는 설정 온도 변경 시점을 무시하고 임계 시간이 반영된 제2 구간에 기초하여 온 도 변화량을 측정할 수 있다. 또한, 공기 조화기는 설정 온도가 변경된 시점 (t2)이 제2 기준값 이상이면 제1 구간으로 온도 변 화량을 측정할 수 있다. 한편, 또 다른 실시 예에 따른 공기 조화기는 변경된 설정 온도의 차이값에 기초하여 온도 변화량을 획득 하는 계산 구간을 결정할 수 있다. 공기 조화기는 설정 온도의 차이값이 기준값 미만이면 제2 구간으로 온도 변화량을 측정할 수 있다. 설정 온도의 차이가 적으면, 설정 온도의 변경이 크게 작용하지 않으므로, 공기 조화기는 설정 온 도의 차이가 적은 경우 제2 구간에 기초하여 온도 변화량을 측정할 수 있다. 또한, 공기 조화기는 설정 온도의 차이값이 기준값 이상이면 제4 구간으로 온도 변화량을 측정할 수 있다. 설정 온도의 차이가 크면 냉방 출력이 크게 달라질 수 있으므로, 공기 조화기는 제 4구간(153 5)에 기초하여 공기 조화기을 측정할 수 있다. 도 16은 실내기의 온도 변화에 따라 비정상 환경을 감지하는 또 다른 실시 예를 설명하기 위한 도면이다. 도 16을 참조하면, 그래프는 실내기의 온도 센서로부터 획득된 온도 정보를 표시한 것이다. 그래프 는 설정 온도, 측정 온도를 포함할 수 있다. 그래프에 대한 기본적인 설명은 도15와 동일하므로 생략한다. 설정 온도는 특정 시점에서 변경될 수 있다. 도 16은 임계 시간이 경과하기 이전에 설정 온도가 높아진 경우(도 16에서는 20도에서 25도로 설정 온도가 변경된 경우를 가정)를 설명한 것이다. 그래프에서는 턴 온 명령이 수신된 시점을 t1으로 정하고, 설정 온도가 변경된 시점을 t2로 정할 수 있다. 그리고, 턴 온 명령이 수신된 후 임계 시간(도 16에서는 30분을 가정)이 경과한 시점을 t3로 정하고, 설정 온도가 변경된 후 임계 시 간이 경과한 시점을 t4로 정할 수 있다. 공기 조화기는 설정 온도가 변경 된 경우, 4개의 구간으로 온도 변화량을 획득할 수 있다. 제1 구간 , 제2 구간, 제3 구간, 제4 구간에 대한 설명은 도 15와 중복되므로 생략한다. 공기 조화기는 설정 온도가 변경된 시점에 기초하여 온도 변화량을 획득하는 계산 구간을 결정할 수 있다. 구체적인 결정 과정은 그래프을 통해 도시한다. 공기 조화기는 설정 온도가 변경된 시점 (t2)이 제1 기준값 미만이면 제4 구간으로 온도 변화량을 측정할 수 있다. 설정 온도가 빨리 변경 되면 설정 온도가 변경 되기 전의 데이터의 중요성이 덜하므로, 공기 조화기는 설정 온도가 변경 된 이후의 데이터만을 이용하여 온도 변화량을 측정할 수 있다. 또한, 공기 조화기는 설정 온도가 변경된 시점 (t2)이 제1 기준값 이상이면 제1 구간으로 온도 변 화량을 측정할 수 있다. 설정 온도의 변경 시점이 일정 시간 경과하면 이미 실내 온도가 떨어진 상태일 수 있으 므로, 공기 조화기는 설정 온도 변경 시점을 무시하고 임계 시간이 반영된 제1구간에 기초하여 온 도 변화량을 측정할 수 있다. 도 15에서는, 공기 조화기가 제1 기준값 및 제2 기준값을 이용하여 설정 온도가 변경된 시점 (t2)에 따라 3가지 계산 구간을 결정하는 동작을 설명하였다. 하지만, 도 15와 달리 도 16에서는 설정 온도가 높아진 경우를 가정하였다. 설정 온도가 높아진 경우, 최초 실내 온도와 설정 온도 변경 후의 온도 차이가 줄어 들었다. 따라 서, 비정상 환경에 대한 판단 정확성이 떨어질 수 있다. 따라서, 실내기는 설정 변경 온도가 증가한 경우, 정확성을 높이기 위하여 제2 구간을 고려하지 않을 수 있다. 도 15 및 도16을 종합하면, 공기 조화기는 설정 온도의 변화(설정 온도의 변화 방향, 설정 온도의 변화 차이값)에 기초하여 온도 변화량의 계산 기준을 결정할 수 있다. 구체적으로, 공기 조화기는 설정 온도가 낮아진 경우 그래프에 따른 기준으로 계산 구간을 결정할 수 있고, 설정 온도가 높아진 경우 그래프 에 따른 기준으로 계산 구간을 결정할 수 있다. 도 17은 실외기의 온도 변화에 따라 비정상 환경을 감지하는 일 실시 예를 설명하기 위한 도면이다. 도 17을 참조하면, 그래프는 실외기의 온도 센서로부터 획득된 온도 정보를 표시한 것이다. 그래프 의 x축은 시간이며 단위는 분이고 y축은 온도이며 단위는 섭씨온도일 수 있다. 여기서, “t_check”은 턴 온 명령이 수신된 시점으로부터 임계 시간이 지난 시점(이후, 검지 시점으로 기술한다)일 수 있다. 그래프는 최초 온도, 측정 온도, 예상 온도를 포함할 수 있다. 최초 온도는 턴 온 명령이 수신된 시점 또는 공기 조화기로부터 온도 측정에 대한 제어 명령을 수신한 시점에 실외기 온 도 센서에서 획득한 온도를 의미할 수 있다. 측정 온도는 각 시간에 따라 실외기 온도 센서에서 획득되는 온도를 의미할 수 있다. 예상 온도는 시간에 따라 변화하는 공기 조화기의 이전 온도 데이터일 수 있다. 즉, 예상 온도는 정상 환경에서 작동된 공기 조화기의 실외기 온도 데이터를 의미할 수 있다. 공기 조화기는 임계 시간 후 실외기의 주변 환경이 비정상인지 여부를 판단할 수 있다(이후, 비정상 환경 판단으로 기술한다). 구체적으로, 공기 조화기는 최초 온도 및 검지 시점 온도에 기초하여 공기 조화기의 비정상 환경을 판단할 수 있다. 공기 조화기는 최초 온도 및 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경 이 비정상 환경인 것으로 판단할 수 있다. 예를 들어, 기준값이 4도 라고 가정한다. 도 17에서 최초 온도는 30 도이고 검지 시점 온도는 40도이므로, 차이값(10도)는 기준값(4도)보다 크다. 따라서, 공기 조화기는 현 재 환경(실외기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 또한, 공기 조화기는 예상 온도 및 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경이 비정상 환경인 것으로 판단할 수 있다. 여기서, 예상 온도는 정상 환경에서 작동한 공기 조화기의 실외기 온도 데이터를 의미할 수 있다. 정상 환경에서 검지 시점 온도가 33도로 메모리에 저장되어 있다고 가정하고 기준값 은 5도 라고 가정한다. 도 17에서 예상 온도는 33도이고 검지 시점 온도는 40도이므로 차이값(7도)은 기준값(5 도)보다 크다. 따라서, 공기 조화기는 현재 환경(실외기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 또한, 공기 조화기는 실외기 기준 온도 및 검지 시점 온도의 차이값이 기준값 이상인 경우, 현재 환경이 비정상 환경인 것으로 판단할 수 있다. 실외기 기준 온도는 도 12에서 설명하였다. 도 12의 표를 참고하 면, 초기 온도(최초 온도)가 30도인 경우, 실외기 기준 온도는 34도이다. 기준값이 5도 라고 가정한다. 도 17에 서는 실외기 기준 온도가 34도이고 검지 시점 온도가 40도 이므로 차이값(6도)는 기준값(5도)보다 크다. 따라서, 공기 조화기는 현재 환경(실외기의 주변 환경)이 비정상 환경이라고 식별할 수 있다. 한편, 실외기 기준 온도는 기 설정된 데이터 또는 공기 조화기의 냉방 동작을 수행하여 획득된 데이터라고 설명 한 바 있으므로, 실외기 기준 온도가 냉방 동작을 수행하여 획득된 데이터인 경우, 예상 온도와 실외기 기준 온 도는 동일한 값일 수 있다. 한편, 도 17에서 설명한 다양한 비정상 환경 판단 조건 들은 사용자의 설정에 따라 개별적으로 적용되거나 조합 되어 적용될 수 있다. 그리고, 도 17에서 설명한 각각의 기준값들은 서로 다른 값일 수 있으며 초기 온도에 따 라 달라질 수 있다. 도 18은 실내 온도와 관련된 냉방 속도의 분포를 설명하기 위한 도면이다. 도 18을 참조하면, 그래프는 샘플 데이터 (또는 테스트 데이터) 이용하여 초기 온도에 따른 냉방 속도의 분포를 표시한 것이다. 초기 온도는 기 설정된 구간에 따라 7개의 그룹으로 구분하였다. 냉방 속도는 최초 온도 와 임계 시간이 경과한 시점의 온도의 차이에 기초하여 획득될 수 있다. 그래프를 참고하면 초기 온도가 높을수록 냉방 속도의 평균이 높아짐을 알 수 있다. 일반 적으로 설정 온 도가 20도에서 24도라고 설정되므로, 정상 환경에서 임계 시간 이후의 온도는 20도에서 24도 사이일 수 있다. 따라서, 초기 온도가 높을수록 냉방 속도가 증가할 수 있다. 공기 조화기는 초기 온도에 따라 냉방 속도가 달라진다는 점을 고려하여, 초기 온도에 따라 기준 냉방 속 도를 다르게 설정할 수 있다. 기준 냉방 속도에 따른 구체적인 설명은 도 11에서 기재 하였으므로 자세한 내용 은 생략한다. 도19는 테스트 데이터를 처리하는 동작을 설명하기 위한 도면이다. 도 19를 참조하면, 공기 조화기는 도 11에서 설명한 기준 냉방 속도 또는 도 12에서 설명한 실외기 기준 온도를 획득하기 위하여 샘플 데이터를 획득할 수 있다. 샘플 데이터를 획득하기 위하여, 테스트 환경에서 다양한 동작이 수행될 수 있다. 구체적으로, 다양한 동작은 비정상 환경 또는 정상 환경을 세팅한 상태에서 공기 조 화기를 가동하여 데이터를 획득하는 것을 의미할 수 있다. 여기서, 4가지 상황이 있을 수 있다. 첫째, 비정상 환경이나 공기 조화기가 정상 환경으로 식별한 경우 가 있을 수 있다. 이 경우, 공기 조화기가 오검지한 것이므로, 획득한 데이터는 메모리에 저장하지 않을 수 있다. 둘째, 비정상 환경이고 공기 조화기가 비정상 환경으로 식별한 경우 가 있을 수 있다. 이 경우, 공 기 조화기가 정검지한 것이므로, 획득한 데이터는 메모리에 저장할 수 있다. 셋째, 정상 환경이나 공기 조화기가 비정상 환경으로 식별한 경우 가 있을 수 있다. 이 경우, 공기 조화기가 오검지한 것이므로, 획득한 데이터는 메모리에 저장하지 않을 수 있다. 넷째, 정상 환경이며 공기 조화기가 정상 환경으로 식별한 경우 가 있을 수 있다. 이 경우, 공기 조화기가 정검지한 것이므로, 획득한 데이터는 메모리에 저장할 수 있다. 도 20은 실내기에 대응되는 임계 시간을 결정하는 동작을 설명하기 위한 도면이다. 도 20을 참조하면, 임계 시간을 결정하기 위하여 테스트 기기가 5만개를 이용하여 테스트 동작을 8만회 수행한 것으로 가정한다. 여기서, 테스트 동작이란 턴 온 명령을 수행하고 턴 오프 명령을 수행하여 하나의 냉방 동작 이 이루어 지는 것을 의미할 수 있다. 테스트 기기가 5만개를 이용하여 테스트 동작을 8만회 수행하면, 다양한 샘플 데이터를 획득할 수 있으며, 테스 트 동작은 대략 비정상 환경이 9% 내지 11% 사이가 되게끔 이루어 질 수 있다. 한편, 검지 시점(턴 온 명령이 수신된 이후 임계 시간이 경과한 시점)에 기초하여 공기 조화기는 실내기 가 설치된 주변 환경이 비정상 환경인지 여부를 판단할 수 있다. 여기서, 검지 시점(임계 시간)을 언제로 정하느냐에 따라 비정상 환경을 식별하는 횟수가 달라 질 수 있다. 테스트 기기가 5만개를 이용하여 테스트 동작을 8만회 수행한 것을 샘플 데이터라고 기술한다. 샘플 데이터에서 비정상 환경이라고 판단된 동작 횟수와 비정상 환경을 식별한 기기의 개수를 조사할 수 있다. 검지 시간을 15분 으로 한 경우, 비정상 환경이라고 판단된 동작 횟수 및 비정상 환경을 식별한 기기의 개수를 정리하면 표(200 5)와 같다. 그리고, 검지 시간을 30분으로 한 경우, 비정상 환경이라고 판단된 동작 횟수 및 비정상 환경을 식 별한 기기의 개수를 정리하면 표와 같다. 그리고, 검지 시간을 45분으로 한 경우, 비정상 환경이라고 판 단된 동작 횟수 및 비정상 환경을 식별한 기기의 개수를 정리하면 표와 같다. 표에 따라 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율을 분석하여 정리하면 표와 같다. 검지 시간이 15분인 경우, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율은 56%이고, 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율은 35%이다. 표에 따라 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율을 분석하여 정리하면 표와 같다. 검지 시간이 30분인 경우, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율은 10%이고, 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율은 10%이다. 표에 따라 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율을 분석하여 정리하면 표와 같다. 검지 시간이 45분인 경우, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율은 6%이고, 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율은 6%이다. 8만회의 테스트 동작 중에서 비정상 환경으로 테스트 동작을 수행한 것은 9%~11%이므로, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율 이 10%에 가장 가까운 검지 시간을 최종 검지 시간으로 결정하는 것이 바람직할 수 있다. 도 20을 참조하면, 가 장 바람직한 실내기에 대응되는 임계 시간은 30분일 수 있다. 검지 시간을 너무 짧게 설정하면 냉방이 덜 된 상태에서 온도를 측정하게 되어 판단의 정확성이 떨어질 수 있다. 검지 시간을 너무 길게 설정하면 낭비되는 전력이 많아 질 수 있으며 사용자가 비정상 환경을 감지하여 이미 조치를 취하는 경우가 발생할 수 있어 데이터의 신뢰도가 낮아질 수 있다.도21은 실외기에 대응되는 임계 시간을 결정하는 동작을 설명하기 위한 도면이다. 도 21은 실외기 데이터를 측정하는 것 이외에 도 20과 설명이 중복되어 구체적인 내용은 설명을 생략한다. 테스트 기기가 5만개를 이용하여 테스트 동작을 8만회 수행한 것을 샘플 데이터라고 기술한다. 샘플 데이터에서 비정상 환경이라고 판단된 동작 횟수와 비정상 환경을 식별한 기기의 개수를 조사할 수 있다. 검지 시간을 15분 으로 한 경우, 비정상 환경이라고 판단된 동작 횟수 및 비정상 환경을 식별한 기기의 개수를 정리하면 표(210 5)와 같다. 그리고, 검지 시간을 30분으로 한 경우, 비정상 환경이라고 판단된 동작 횟수 및 비정상 환경을 식 별한 기기의 개수를 정리하면 표와 같다. 그리고, 검지 시간을 45분으로 한 경우, 비정상 환경이라고 판 단된 동작 횟수 및 비정상 환경을 식별한 기기의 개수를 정리하면 표와 같다. 표에 따라 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율을 분석하여 정리하면 표와 같다. 검지 시간이 15분인 경우, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율은 21%이고, 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율은 8%이다. 표에 따라 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율을 분석하여 정리하면 표와 같다. 검지 시간이 30분인 경우, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율은 16%이고, 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율은 7%이다. 표에 따라 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율을 분석하여 정리하면 표와 같다. 검지 시간이 45분인 경우, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율은 11%이고, 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율은 5%이다. 8만회의 테스트 동작 중에서 비정상 환경으로 테스트 동작을 수행한 것은 9%~11%이므로, 전체 샘플 데이터에서 비정상 환경이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율 이 10%에 가장 가까운 검지 시간을 최종 검지 시간으로 결정하는 것이 바람직할 수 있다. 여기서, 도 20의 실내기 데이터와 달리 도 21의 실외기 데이터는 전체 샘플 데이터에서 비정상 환경 이라고 판단된 동작의 횟수 비율 및 전체 샘플 데이터에서 비정상 환경을 식별한 기기의 개수 비율이 유사하지 않는다. 따라서, 비정상 환경이라고 판단된 동작의 횟수 비율이 10%와 유사한 것은 검지 시간 45분이며, 비정상 환경을 식별한 기기의 개수 비율이 10%와 유사한 것은 검지 시간 15분 일 수 있다. 실내기와 달리 실외기 의 오검지는 실외기 자체의 과열을 일으켜, 제품의 내구성에 문제가 발생할 수 있다. 따라서, 실외기 에 대한 검지 시간은 보수적으로 최대한 빨리 설정하는 것이 바람직하다. 따라서, 검지 시간을 15분으로 설정하는 것이 바람직할 수 있다. 도 22는 비정상 환경에서 실내기의 전력량을 설명하기 위한 도면이다. 도 22를 참조하면, 비정상 환경을 식별한 경우와 비정상 환경을 식별하지 못한 경우의 전력량을 비교할 수 있다. 그래프는 실내기와 관련된 비정상 환경을 공기 조화기가 식별한 경우의 온도 변화를 나 타낸다. 그래프는 설정 온도 및 실내 온도를 포함할 수 있다. 그래프를 참조하면, 임 계 시간이 30분인 경우, 임계 시간 전까지 비정상 환경으로 인하여 실내 온도가 떨어 지지 않는다. 하지만, 본 원 공기 조화기는 임계 시간(검지 시간)이 경과하면, 비정상 환경에 대한 해결책을 사용자에게 제시하므 로 사용자는 바로 비정상 환경에 대한 대응 동작을 수행할 수 있다. 30분이후 사용자의 대응 동작에 따라서 실 내 온도가 떨어질 수 있다. 한편, 그래프는 설정 온도 및 실내 온도를 포함할 수 있다. 그래프와 달리 사용자에게 비정상 환경에 대한 알림을 전혀 제공하지 않으면 비정상 환경이 유지될 가능성이 높다. 따라서, 실내온도 는 설정 온도로 떨어 지지 않고 냉방 기능이 계속 수행될 가능성이 높다. 그래프는 그래프에 대응되는 전력량과 그래프에 대응되는 전력량을 비교한 것이다. 비정상 환경을 식별하여 비정상 환경에 대한 알림을 제공한 경우 전력량은 2690Wh일 수 있다. 비정상 환경 을 식별하지 않고 비정상 환경에 대한 알림을 제공하지 않은 경우 전력량은 4292 Wh일 수 있다. 따라서, 본 개 시의 일 실시 예에 따른 공기 조화기는 비정상 환경에 대한 알림을 제공하지 않은 경우보다 37%의 에너지 를 절감할 수 있다.도 23은 비정상 환경에서 실외기의 전력량을 설명하기 위한 도면이다. 도 23을 참조하면, 비정상 환경을 식별한 경우와 비정상 환경을 식별하지 못한 경우의 전력량을 비교할 수 있다. 그래프는 실외기와 관련된 비정상 환경을 공기 조화기가 식별한 경우의 온도 변화를 나 타낸다. 그래프는 압축기 주파수 및 실외기 온도를 포함할 수 있다. 그래프을 참조하 면 임계 시간(15분) 전까지 실외기 온도가 높이 유지 된다. 그리고, 임계 시간을 기점으로 사용자가 대응 동작 을 수행(실외기실 창문을 여는 동작을 수행)하면 실외기 온도는 떨어진다. 한편, 그래프는 실외기와 관련된 비정상 환경을 공기 조화기가 식별하지 못한 경우의 온도 변 화를 나타낸다. 그래프는 압축기 주파수 및 실외기 온도를 포함한다. 공기 조화기가 비정상 환경을 식별하지 않으면 실외기 온도는 계속하여 높이 유지된다. 여기서, 압축기 주파수 떨어지는 구간 은 실외기 고장을 예방하기 위하여 자동으로 압축기 주파수를 제어하는 동작이 반영된 것이다. 하지 만, 압축기 주파수를 제어하여도 실외기 온도를 떨어뜨릴 순 없으므로, 실외기 온도는 계속 높이 유지된다. 그래프는 그래프에 대응되는 전력량과 그래프에 대응되는 전력량을 비교한 것이다. 비정상 환경을 식별하여 비정상 환경에 대한 알림을 제공한 경우 전력량은 1860Wh일 수 있다. 비정상 환경 을 식별하지 않고 비정상 환경에 대한 알림을 제공하지 않은 경우 전력량은 2820 Wh일 수 있다. 따라서, 본 개 시의 일 실시 예에 따른 공기 조화기는 비정상 환경에 대한 알림을 제공하지 않은 경우보다 34%의 에너지 를 절감할 수 있다. 도 24는 실내기가 설치된 환경이 비정상인지 판단하는 계산 과정을 설명하기 위한 도면이다. 도 24를 참조하면, 표는 실내기와 관련된 데이터를 처리하는 과정을 정리한 것일 수 있다. 학습 회 수는 냉방 동작을 1회 수행한 것을 의미할 수 있다. 학습 회수가 1회부터 5회까지는 데이터를 저장하는 구간 에 해당하며, 공기 조화기는 학습 회수가 5회 저장될 때까지 비정상 환경에 대한 알림을 제공하지 않을 수 있다. 그리고, 공기 조화기는 학습 회수가 6회 이후부터 비정상 환경을 판단하여 비정상 환경에 대한 알림을 제공할 수 있다. 학습 1회부터 5회까지 최초 실내온도가 35도이고 임계 시간(30분)후 실내 온도가 26도로 동일하다고 가정한다. 냉방 속도는 (35-26)/30=0.3일 수 있다. 1회의 학습 테이블 값은 0.17로 기 설정된 값을 설정할 수 있다. 검지 기준 상수 0.21 역시 기 설정된 값일 수 있다. 기준값은 학습 테이블 값에서 검지 기준 상수를 뺀 값에 기초하여 획득될 수 있다. 구체적으로, 공기 조 화기는 기준값은을 결정하기 위하여 학습 테이블 값에서 검지 기준 상수를 뺀 값이 0.01 미만인지 판단하는 동작을 수행할 수 있다. 학습 테이블 값에서 검지 기준 상수를 뺀 값이 0.01 미만이면, 기준값 은은 0.01로 결정될 수 있다. 그리고, 학습 테이블 값에서 검지 기준 상수를 뺀 값이 0.01 이상이면, 기 준값은은 학습 테이블 값에서 검지 기준 상수를 뺀 값으로 결정될 수 있다. 판정 결과는 냉방 속도 및 기준값에 기초하여 결정될 수 있다. 구체적으로, 공기 조화기는 판정 결과를 획득하기 위하여 냉방 속도가 기준값보다 작은지 여부를 판단하는 동작을 수행 할 수 있다. 냉방 속도가 기준값보다 작으면, 공기 조화기는 실내기의 주변 환경이 비정상이 라고 식별할 수 있다. 그리고, 냉방 속도가 기준값이상 이면, 공기 조화기는 실내기의 주변 환경이 정상이라고 식별할 수 있다. 학습값은 판정 결과에 기초하여 획득될 수 있다. 구체적으로, 공기 조화기는 판정 결과 에 따라 이전 학습값을 그대로 유지할 것인지 새로운 학습값으로 변경할 것인지 결정하는 동작을 수행할 수 있다. 판정 결과가 비정상이면 공기 조화기는 이전의 학습값을 그대로 유지할 수 있다. 판정 결과가 정상이면 공기 조화기는 학습 테이블값(이전 학습값)*0.75+현재 냉방 속도*0.25를 새 로운 학습값으로 저장할 수 있다. 학습 테이블값(이전 학습값)에 대한 가중치를 0.75(75%)로 설정하고 현재 냉 방 속도에 대한 가중치를 0.25(25%)로 설정할 수 있다. 그리고, 학습값은 다음 동작에서 학습 테이블값으 로 이용될 수 있다. 표에서 1회 학습 동작을 계산한다. 학습 테이블 값이 0.17이고 검지 기준 상수가 0.21이므로 학습 테이블 값에서 검지 기준 상수를 뺀 값은 -0.04이다. -0.04는 0.01보다 작으므로 기준값은 0.01이 된다. 그리고, 냉방 속도(0.3)가 기준값(0.01)보다 크므로 판정 결과는 정상이 된다. 그리고, 판정 결과가 정상이므로 학습값은 0.17*0.75+0.3*0.25=0.2(소수점 2번째에서 반올림) 일 수 있다. 획득된 학습값 0.2는 2회 학습 동작에서 학습테이블 값으로 이용될 수 있다. 표에서 2회 학습 내지 5회 학습 동작은 상술한 계산과정이 반복된다. 표에서 6회 학습 동작을 계산한다. 학습 테이블값(0.27)에서 검지 기준 상수(0.21)를 빼면 0.06이며, 0.06은 0.01보다 크므로 기준값은 0.06이 된다. 그리고, 6회 학습 동작에서 30분후 실내 온도가 34도이므로 냉 방 속도는 0.03이 된다. 냉방 속도(0.03)가 기준값(0.06)보다 작으므로, 공기 조화기는 실내기의 주 변 환경이 비정상이라고 식별할 수 있다. 그리고, 판정 결과가 비정상이므로, 학습값은 이전 학습값인 0.27을 유지할 수 있다. 도 25는 실외기가 설치된 환경이 비정상인지 판단하는 계산 과정을 설명하기 위한 도면이다. 도 25를 참조하면, 표는 실외기와 관련된 데이터를 처리하는 과정을 정리한 것일 수 있다. 학습 회 수가 1회부터 5회까지는 데이터를 저장하는 구간에 해당하며, 공기 조화기는 학습 회수가 5회 저장 될 때까지 비정상 환경에 대한 알림을 제공하지 않을 수 있다. 그리고, 공기 조화기는 학습 회수가 6회 이후부터 비정상 환경을 판단하여 비정상 환경에 대한 알림을 제공할 수 있다. 표와 관련된 구체적인 계산 동작은 도 24의 설명과 중복되므로, 자세한 내용은 생략한다. 도 26은 본 개시의 일 실시 예에 따른 실내기 및 실외기의 제어 동작을 순서대로 설명하기 위한 흐름도이다. 도 26을 참조하면, 실내기는 턴 온 명령을 수신할 수 있다 (S2605). 턴 온 명령이 수신되면, 실내기 는 실내기 온도 센서로부터 실내기 제1 온도를 획득할 수 있다 (S2610). 그리고, 턴 온 명령이 수신되면, 실내 기는 실외기 제1 온도를 요청하는 제어 명령을 실외기에 전송할 수 있다 (S2615). 실외기가 S2615의 제어 명령을 수신하면, 실외기는 실외기 온도 센서로부터 실외기 제1 온도를 획득 할 수 있다 (S2620). 그리고, 실외기는 획득한 실외기 제1 온도를 실내기로 전송할 수 있다 (S2625). 실내기가 실외기로부터 실외기 제1 온도를 수신하면, 실내기는 실외기 임계 시간(예를 들어, 15 분)이 경과했는지 판단할 수 있다 (S2630). 그리고, 실외기 임계 시간이 경과하면, 실내기는 실내기 는 실외기 제2 온도를 요청하는 제어 명령을 실외기에 전송할 수 있다 (S2635). 실외기가 S2635의 제어 명령을 수신하면, 실외기는 실외기 온도 센서로부터 실외기 제2 온도를 획득 할 수 있다 (S2640). 그리고, 실외기는 획득한 실외기 제2 온도를 실내기로 전송할 수 있다 (S2645). 실내기가 실외기로부터 실외기 제2 온도를 수신하면, 실내기는 실외기 제1 온도 및 실외기 제2 온도에 기초하여 실외기의 비정상 환경을 식별할 수 있다 (S2650). 만약, 실외기의 주변 환경이 비정 상이라고 식별되면, 실내기는 실외기가 설치된 주변 환경이 비정상이라는 알림을 제공할 수 있다 (S2655). 여기서, 실외기에 대한 비정상 환경이 식별되면, 실내기는 더 이상 실내기에 대한 비 정상 환경을 판단하지 않고 처리 동작을 종료할 수 있다. 한편, S2650 단계에서 실외기의 주변 환경이 정상이라고 식별되면, 실내기는 실내기의 임계 시 간(예를 들어, 30분)이 경과했는지 여부를 판단할 수 있다 (S2660). 실내기의 임계 시간이 경과하면, 실내 기는 실내기 온도 센서로부터 실내기 제2 온도를 획득할 수 있다 (S2665). 그리고, 실내기는 실내기 제1 온도 및 실내기 제2 온도에 기초하여 실내기의 비정상 환경을 식별할 수 있다 (S2670). 만약, 실내기 의 주변 환경이 비정상이라고 식별되면, 실내기는 실내기가 설치된 주변 환경이 비정상이라는 알림을 제공할 수 있다 (S2675). 그리고, 실내기의 주변 환경이 정상이라고 식별되면, 실내기는 판단 동작을 종료할 수 있다. 한편, 도 26에서 설명한 동작은 실외기의 임계 시간(예를 들어, 15분)과 실내기의 임계 시간(예를 들 어, 30분)이 상이함을 가정하였다. 공기 조화기는 실외기의 임계 시간을 실내기의 임계 시간보 다 작도록 설정할 수 있다. 한편, 도 26에서 설명한 모든 동작들은 명세서 전반에 걸쳐 설명한 동작이 추가적으로 반영되어 구현될 수 있다. 도 27은 본 개시의 일 실시 예에 따른 공기 조화기의 제어 방법을 설명하기 위한 흐름도이다. 도 27을 참조하면, 본 개시의 일 실시 예에 따른 공기 조화기의 제어 방법은 공기 조화기에 대한 턴 온 명령이 수신되면, 온도 센서를 통해 턴 온 명령이 수신된 시점의 제1 온도 값을 획득할 수 있다 (S2705).턴 온 명령이 수신된 시점에서 임계 시간이 경과하면, 온도 센서를 통해 임계 시간이 경과한 시점의 제2 온도 값을 획득할 수 있다 (S2710). 제1 온도 값 및 제2 온도 값에 기초하여 공기 조화기가 설치된 환경과 관 련된 알림 정보를 제공할 수 있다 (S2715). 여기서, 온도 센서는 실내기에 포함된 온도 센서일 수 있으며, 알림 정보를 제공하는 단계(S2715)는 제1 온도 값 및 임계 시간이 경과한 시점의 설정 온도 값 간 차이가 제1 기준값 이상이고, 제1 온도 값 및 제2 온도 값 간 차이가 제2 기준값 이하이면, 실내기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 또한, 초기 온도 별 기준 냉방 속도에 대한 정보를 저장하는 공기 조화기의 제어 방법은 제1 온도 값 및 제2 온도 값에 기초하여 임계 시간에 대응되는 현재 냉방 속도를 식별할 수 있다. 저장된 정보에 기초하여 제1 온도 값에 대응되는 기준 냉방 속도를 식별하는 단계를 포함할 수 있다. 그리고, 알림 정보를 제공하는 단계 (S2715)는 현재 냉방 속도, 기준 냉방 속도, 임계 시간이 경과한 시점의 설정 온도 값에 기초하여 실내기 가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 온도 센서는 실외기에 포함된 온도 센서일 수 있으며, 알림 정보를 제공하는 단계(S2715)는 제1 온 도 값 및 임계 시간이 경과한 시점의 제2 온도 값 간 차이가 제3 기준값 이상이면 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 초기 온도 별 실외기의 기준 온도에 대한 정보를 저장하는 공기 조화기의 제어 방법에 있어서, 알림 정보를 제공하는 단계(S2715)는 제1 온도 값에 대응되는 실외기의 기준 온도 및 제2 온도 값 의 차이에 기초하여 실외기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 또한, 알림 정보를 제공하는 단계(S2715)는 제1 온도 값, 제2 온도 값 및 압축기의 주파수에 기초하여 공기 조 화기가 설치된 환경과 관련된 알림 정보를 제공할 수 있다. 한편, 온도 센서는 실내기에 포함된 제1 온도 센서 및 실외기에 포함된 제2 온도 센서를 포함할 수 있고, 공기 조화기의 제어 방법은 제2 온도 센서를 통해 획득된 제1 온도 값 및 제2 온도 값에 기초하여 실외기가 설치된 환경이 기설정된 조건을 만족하지 않는 것으로 식별되면 실외기가 설치된 환경과 관 련된 알림 정보를 제공할 수 있고, 실내기가 설치된 환경과 관련된 알림 정보를 제공하지 않는 단계를 더 포함할 수 있다. 여기서, 제1 온도 센서에 대응되는 임계 시간은 제2 온도 센서에 대응되는 임계 시간보다 길 수 있다. 또한, 알림 정보를 제공하는 단계(S2715)는 환경과 관련된 알림 정보를 음성으로 제공하도록 스피커를 제어할 수 있다. 또한, 알림 정보를 제공하는 단계(S2715)는 환경과 관련된 알림 정보를 외부 장치로 제공하도록 통신 인터페이 스를 제어할 수 있다. 한편, 도 27과 같은 공기 조화기의 제어 방법은 도 2 또는 도 3의 구성을 가지는 공기 조화기 상에 서 실행될 수 있으며, 그 밖의 구성을 가지는 공기 조화기 상에서도 실행될 수 있다. 한편, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 공기 조화기에 설치 가능한 어플리케이 션 형태로 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들에 따른 방법들은, 기존 공기 조화기에 대한 소프트웨어 업그레 이드, 또는 하드웨어 업그레이드 만으로도 구현될 수 있다. 또한, 상술한 본 개시의 다양한 실시 예들은 공기 조화기에 구비된 임베디드 서버, 또는 공기 조화기 및 디스플레이 장치 중 적어도 하나의 외부 서버를 통해 수행되는 것도 가능하다. 한편, 본 개시의 일시 예에 따르면, 이상에서 설명된 다양한 실시 예들은 기기(machine)(예: 컴퓨터)로 읽을 수 있는 저장 매체(machine-readable storage media에 저장된 명령어를 포함하는 소프트웨어로 구현될 수 있다. 기 기는, 저장 매체로부터 저장된 명령어를 호출하고, 호출된 명령어에 따라 동작이 가능한 장치로서, 개시된 실시 예들에 따른 전자 장치(예: 공기 조화기)를 포함할 수 있다. 명령이 프로세서에 의해 실행될 경우, 프로 세서가 직접, 또는 프로세서의 제어 하에 다른 구성요소들을 이용하여 명령에 해당하는 기능을 수행할 수 있다. 명령은 컴파일러 또는 인터프리터에 의해 생성 또는 실행되는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저 장 매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적'은 저장 매체가 신호(signal)를 포함하지 않으며 실재(tangible)한다는 것을 의미할 뿐 데이터가 저장매체에 반영구적 또는 임시적으로 저장됨을 구분하지 않는다. 또한, 본 개시의 일 실시 예에 따르면, 이상에서 설명된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품 (computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 온라인으로 배포될 수 있 다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 또한, 상술한 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단수 또는 복수의 개체로 구 성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요 소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로 그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동 작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2024-0044227", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시에 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어져서는 안될 것이다."}
{"patent_id": "10-2024-0044227", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 공기 조화기를 도시한 블록도이다. 도 2는 본 개시의 일 실시 예에 따른 실내기를 도시한 블록도이다.도 3은 도 2의 실내기의 구체적인 구성 및 실외기의 구체적인 구성을 설명하기 위한 블록도이다. 도 4는 일 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 5는 다른 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 6은 또 다른 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 7은 또 다른 실시 예에 따른 알림 정보 제공 방법을 설명하기 위한 도면이다. 도 8은 일 실시 예에 따른 디스플레이에 표시되는 알림 정보를 설명하기 위한 도면이다. 도 9는 다른 실시 예에 따른 디스플레이에 표시되는 알림 정보를 설명하기 위한 도면이다. 도 10은 또 다른 실시 예에 따른 디스플레이에 표시되는 알림 정보를 설명하기 위한 도면이다. 도 11은 실내 온도와 관련된 기준 냉방 속도를 설명하기 위한 도면이다. 도 12는 실외기와 관련된 기준 온도를 설명하기 위한 표이다. 도 13은 실내기의 온도 변화에 따라 비정상 환경을 감지하는 일 실시 예를 설명하기 위한 도면이다. 도 14는 실내기의 온도 변화에 따라 비정상 환경을 감지하는 다른 실시 예를 설명하기 위한 도면이다. 도 15는 실내기의 온도 변화에 따라 비정상 환경을 감지하는 또 다른 실시 예를 설명하기 위한 도면이다. 도 16은 실내기의 온도 변화에 따라 비정상 환경을 감지하는 또 다른 실시 예를 설명하기 위한 도면이다. 도 17은 실외기의 온도 변화에 따라 비정상 환경을 감지하는 일 실시 예를 설명하기 위한 도면이다. 도 18은 실내 온도와 관련된 냉방 속도의 분포를 설명하기 위한 도면이다. 도19는 테스트 데이터를 처리하는 동작을 설명하기 위한 도면이다. 도 20은 실내기에 대응되는 임계 시간을 결정하는 동작을 설명하기 위한 도면이다. 도21은 실외기에 대응되는 임계 시간을 결정하는 동작을 설명하기 위한 도면이다. 도 22는 비정상 환경에서 실내기의 전력량을 설명하기 위한 도면이다. 도 23은 비정상 환경에서 실외기의 전력량을 설명하기 위한 도면이다. 도 24는 실내기가 설치된 환경이 비정상인지 판단하는 계산 과정을 설명하기 위한 도면이다. 도 25는 실외기가 설치된 환경이 비정상인지 판단하는 계산 과정을 설명하기 위한 도면이다. 도 26은 본 개시의 일 실시 예에 따른 실내기 및 실외기의 제어 동작을 순서대로 설명하기 위한 흐름도이다. 도 27은 본 개시의 일 실시 예에 따른 공기 조화기의 제어 방법을 설명하기 위한 흐름도이다."}
