{"patent_id": "10-2021-0111984", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0029459", "출원번호": "10-2021-0111984", "발명의 명칭": "컬러 배너 생성 시스템 및 그 방법", "출원인": "주식회사 아이클레이브", "발명자": "최윤내"}}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 단말기(100)와 데이터 통신을 수행하며 의류의 판매를 위한 웹페이지를 운용하는 서버(200)와, 상기서버(200)와 연동되어 의류 판매용 웹페이지의 데이터와 배너를 이용하여 판매하고자 하는 의류의 판매정보가저장되어 있는 데이터베이스(300)를 가지는 의류 상품의 배너를 생성하기 위한 시스템에 있어서,배너생성의 시작을 위한 명령어를 입력받는 명령입력부(10);상기 명령입력부(10)로부터 배너생성의 시작을 위한 명령어를 전달받아 배너에 포함될 상품의 기준을 선정하는배너상품 기준선정부(20);상기 배너상품 기준선정부(20)로부터 배너를 생성할 상품의 기준이 선정되면, 데이터베이스(300)에 저장된 의류의 판매정보에 기초하여 해당 의류의 색상을 추출하는 의류색상추출부(30);상기 의류색상추출부(30)에서 배너에 표시될 의류에 부합되는 배너용 템플릿(template)을 선택하는 배너템플릿선택부(40);상기 배너템플릿선택부(40)에 의하여 의류에 부합되는 배너용 템플릿(template)이 선택되면, 상품과 함께 배너에 표시될 문구의 폰트의 색상을 조절하는 폰트색상조절부(50);상기 폰트색상조절부(50)에 의하여 폰트의 색상이 조절된 배너를 단말기(100)에 표시하고, 사용자에 의하여 배너를 최종적으로 승인받는 배너출력부(60); 를 포함하여 구성되는 것을 특징으로 하는 컬러배너 생성시스템."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 배너상품 기준선정부(20)는,서버(200)에서 실행되는 상품 판매용 웹페이지에서 가장 많이 판매되는 상품을 순위별로 정렬시킨 베스트 상품기준으로 선정하거나 또는 가장 최신의 상품을 순위별로 정렬시킨 최신 상품 기준으로 선정하는 것을 특징으로하는 컬러배너 생성시스템."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서, 상기 의류색상추출부(30)는,기계적학습기법을 이용한 인공지능 엔진(engine)을 이용하여 의류의 색상을추출하는 구성을 특징으로 하는 컬러배너 생성시스템."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서, 상기 배너템플릿선택부(40)는,배너템플릿선택부(40)와 연동된 템플릿데이터베이스(41)에 저장된 템플릿을 선택하는 구성을 특징으로 하는 컬러배너 생성시스템."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서, 상기 폰트색상조절부(50)는,상기 폰트의 색상의 조절을 기계적학습기법을 이용하여 인공지능 엔진(engine)이 의류의 색상 및 종류에 따라서폰트의 색상을 조절하는 구성을 특징으로 하는 컬러배너 생성시스템.공개특허 10-2023-0029459-3-청구항 6 사용자의 단말기(100)와 데이터 통신을 수행하며 의류의 판매를 위한 웹페이지를 운용하는 서버(200)와, 상기서버(200)와 연동되어 의류 판매용 웹페이지의 데이터와 배너를 이용하여 판매하고자 하는 의류의 판매정보가저장되어 있는 데이터베이스(300)를 가지는 의류 상품의 배너를 생성하기 위한 방법에 있어서,배너생성의 시작을 위한 명령어를 입력받는 명령입력단계(S1);상기 명령입력단계(S1)로부터 배너생성의 시작을 위한 명령어를 전달받아 배너에 포함될 상품의 기준을 선정하는 배너상품 기준선정단계(S2);상기 배너상품 기준선정단계(S2)로부터 배너를 생성할 상품의 기준이 선정되면, 데이터베이스(300)에 저장된 의류의 판매정보에 기초하여 해당 의류의 색상을 추출하는 의류색상추출단계(S3);상기 의류색상추출단계(S3)에서 배너에 표시될 의류에 부합되는 배너용 템플릿(template)을 선택하는 배너템플릿선택단계(S4);상기 배너템플릿선택단계(S4)에 의하여 의류에 부합되는 배너용 템플릿(template)이 선택되면, 상품과 함께 배너에 표시될 문구의 폰트의 색상을 조절하는 폰트색상조절단계(S5);상기 폰트조절단계(S5)에 의하여 폰트의 색상이 조절된 배너를 단말기(100)에 표시하고, 사용자에 의하여 배너를 최종적으로 승인받는 배너출력단계(S6);를 포함하여 구성되는 것을 특징으로 하는 컬러배너 생성방법."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서, 상기 배너상품 기준선정단계(S2)는, 서버(200)에서 실행되는 상품 판매용 웹페이지에서 가장 많이 판매되는 상품을 순위별로 정렬시킨 베스트 상품기준으로 선정하거나 또는 가장 최신의 상품을 순위별로 정렬시킨 최신 상품 기준으로 선정하는 것을 특징으로하는 컬러배너 생성방법."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서, 상기 의류색상추출단계(S3)는,단말기(100)로부터 의류색상추출의 요청이 입력되면(S30), 데이터베이스(300)로부터 해당 의류의 사진이 업로드되고(S31), 인공지능 엔진은 업로드된 의류의 색상을 추출하고(S32), 인공지능엔진은 업로드된 의류의 색상이정확하게 추출되었는지를 확인하는 단계(S33);상기 S33 단계의 확인결과, 추출된 색상이 의류의 색상과 일치하도록 추출되었다고 판단되면, 추출된 색상이 정확한 색상임을 알려주는 메세지를 단말기(100)에 표시하는 단계(S34); 를 포함하여 구성되는 것을 특징으로 하는 컬러배너 생성방법."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 6 항에 있어서, 상기 폰트색상조절단계(S5)는, 기계적학습기법을 이용하여 인공지능 엔진(engine)이 의류의 색상 및 종류에 따라서 폰트의 색상을 조절하는 것을 특징으로 하는 컬러배너 생성방법."}
{"patent_id": "10-2021-0111984", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 6 항 내지 제 9 항중 어느 한 항의 컬러배너 생성방법을 수행하는 컴퓨터프로그램이 저장된 기록매체.공개특허 10-2023-0029459-4-"}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인터넷상의 쇼핑몰을 위한 컬러 배너를 생성하는 시스템 및 그 방법에 관한 것으로서, 보다 상세하게 는, 배너생성의 시작을 위한 명령어를 입력받는 명령입력부와, 상기 명령입력부로부터 배너생성의 시작을 위한 명령어를 전달받아 배너에 포함될 상품의 기준을 선정하는 배너상품 기준선정부와, 상기 배너상품 기준선정부로 (뒷면에 계속)"}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인터넷상의 쇼핑몰을 위한 컬러 배너를 생성하는 시스템 및 그 방법에 관한 것으로서, 보다 상세하게 는, 배너생성의 시작을 위한 명령어를 입력받는 명령입력부와, 상기 명령입력부로부터 배너생성의 시작을 위한 명령어를 전달받아 배너에 포함될 상품의 기준을 선정하는 배너상품 기준선정부와, 상기 배너상품 기준선정부로 부터 배너를 생성할 상품의 기준이 선정되면, 데이터베이스에 저장된 의류의 판매정보에 기초하여 해당 의류의 색상을 추출하는 의류색상추출부와, 상기 의류색상추출부에서 배너에 표시될 의류에 부합되는 배너용 템플릿 (template)을 선택하는 배너템플릿선택부와, 상기 배너템플릿선택부에 의하여 의류에 부합되는 배너용 템플릿 (template)이 선택되면, 상품과 함께 배너에 표시될 문구의 폰트의 색상을 조절하는 폰트색상조절부와, 상기 폰 트색상조절부에 의하여 폰트의 색상이 조절된 배너를 단말기에 표시하고, 사용자에 의하여 배너를 최종적으로 승인받는 배너출력부를 포함하여 구성되는 것을 특징으로 하는 컬러배너 생성시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 인터넷 등의 통신망을 이용하여 전자상거래가 수행되는 온라인쇼핑몰은 해당 시기별, 상품의 카테 고리별, 유행별로 소비자가 구매를 원하는 상품에 대하여 배너 광고를 생성하고, 생성된 배너 광고를 쇼핑몰의 메인 화면에 표시한다. 이러한 배너 광고는 대표적으로 의류 판매용 쇼핑몰에서 가장 효과적으로 사용되고 있는데, 예를 들어, 시기별 로 '봄철 의류', '여름철 의류', '가을철 의류', '겨울철 의류', 'S/S(Spring/Summer) 상품전', 'F/W(Fall/Winter) 상품전', '간절기 의류' 등으로 배너가 제작되고, 카테고리별로 '아웃도어 상품전', '남성복 할인전', '여성복 할인전', '팬츠류 상품전' 등으로 배너가 제작되고, 유행별로는 '유행 스커트 기획전', 'ㅇㅇ 무늬 의류 할인전' 등으로 배너가 제작되어, 소비자가 쇼핑몰 메인 화면에서 해당 배너를 선택하게 되면 해당 기획 판매를 위한 컨텐츠가 표시되면서 소비자가 구매를 수행할 수 있도록 한다. 종래에는 쇼핑몰의 판매를 기획자(Merchandiser, MD)가 시기별, 카테고리별, 유행별로 인기있는 상품을 분석하 고 조사하여 인기 상품을 선정한 후, 선정된 인기 상품을 부각시킬 수 있는 컬러와 폰트를 사용하여 배너를 작 성하였으나, 기획가 일일히 수작업으로 배너의 컬러와 폰트를 작성하기 때문에, 배너 작성에 시간이 많이 소요 되는 문제점이 있었다. 이로 인하여 쇼핑몰에서 배너 광고를 이용한 기획 판매를 빈번하게 실시할 수 없었으며, 기획 판매의 구매 결과 를 피드백하여 반영하는 과정도 느리게 이루어질 수 밖에 없었다. 또한, 오프라인 매장을 운영하는 판매자들은 온라인 영역으로 사업을 진출하고자 자체적으로 쇼핑몰을 제작하여 운영하고 있으나, 배너 작성을 위한 포토샵 편집기술, 웹디자인 기술 등이 부족하여 배너 작성을 외부 위탁 업 체를 통하여 수행하는 실정이며 이에 따라서 쇼핑몰의 운영 비용이 증가되게 된다. 한편, 상술한 바와 같이 인터넷상의 전자상거래를 위한 배너제작방법으로서, 대한민국 특허공개 제 10-2016- 95662 호의 광고 배너 자동제작방법 및 광고배너 자동제작서버의 기술과, 대한민국특허공개 제 10-2000-7069 호 의 무료 웹호스팅서비스와 연계된 홈페이지 자동셋업과 광고배너 생성방법 및 그에 관한 운용방식의 기술이 공 지되어 있다."}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래의 제반 문제점을 해소하기 위하여 창안된 것으로서, 종래 인력에 의하여 수작업으 로 이루어졌던 배너 광고를 인공지능을 이용하여 자동적으로 컬러와 폰트를 작성할 수 있는 컬러 배너의 생성 시스템 및 그 방법을 제공한다."}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 기술적 과제를 달성하기 위한 본 발명의 컬러 배너 생성 시스템 및 그 방법은, 배너생성의 시작을 위한 명령어를 입력받는 명령입력부와, 상기 명령입력부로부터 배너생성의 시작을 위한 명령어를 전달받아 배너 에 포함될 상품의 기준을 선정하는 배너상품 기준선정부와, 상기 배너상품 기준선정부로부터 배너를 생성할 상품의 기준이 선정되면, 데이터베이스에 저장된 의류의 판매정보에 기초하여 해당 의류의 색상을 추출하는 의류 색상추출부와, 상기 의류색상추출부에서 배너에 표시될 의류에 부합되는 배너용 템플릿(template)을 선택하는 배너템플릿선택부와, 상기 배너템플릿선택부에 의하여 의류에 부합되는 배너용 템플릿(template)이 선택되면, 상품과 함께 배너에 표시될 문구의 폰트의 위치를 조절하는 폰트조절부와, 상기 폰트조절부에 의하여 폰트의 위 치가 조절된 배너를 단말기에 표시하고, 사용자에 의하여 배너를 최종적으로 승인받는 배너출력부를 포함하여 구성되는 것을 특징으로 하는 컬러배너 생성시스템 및 그 방법에 관한 것이다."}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성을 가지는 본 발명의 컬러 배너 생성 시스템 및 그 방법의 효과는, 인공지능을 이용하여 인터 넷상의 쇼핑몰을 위한 배너 광고의 색상과 폰트를 자동적으로 작성함으로써 종래 쇼핑몰의 담당자가 일일히 수 작업으로 상품에 대한 색상 및 폰트를 작성하는 과정이 생략되어 쇼핑몰 업체가 해당 상품에 부합되는 색상과 폰트를 가지는 배너 광고를 신속하게 작성할 수 있는 효과가 있다. 또한, 인공지능을 이용하여 해당 상품에 적합한 컬러와 폰트를 가지는 배너를 제작함으로써, 배너의 디자인 및 가독성의 품질이 제고되며 이를 통하여 소비자의 구매 욕구를 향상시켜 쇼핑몰 매출의 증가를 도모할 수 있게 된다."}
{"patent_id": "10-2021-0111984", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명의 컬러 배너 생성 시스템 및 그 방법의 구성을 설명한다. 단, 개시된 도면들은 당업자에게 본 발명의 사상이 충분하게 전달될 수 있도록 하기 위한 예로서 제공되는 것이다. 따라서, 본 발명은 이하 제시되는 도면들에 한정되지 않고 다른 태양으로 구체화될 수도 있다. 또한, 본 발명 명세서에서 사용되는 용어에 있어서 다른 정의가 없다면, 본 발명이 속하는 기술 분야에서 통상 의 지식을 가진 자가 통상적으로 이해하고 있는 의미를 가지며, 하기의 설명 및 첨부 도면에서 본 발명의 요지 를 불필요하게 흐릴 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 컬러 배너 생성 시스템 및 그 방법은, 인터넷상의 쇼핑몰의 상품에 부합되는 컬러 및 폰트로서 배너 를 인공지능을 이용하여 자동적으로 작성할 수 있는 시스템이다. 즉, 인터넷상의 쇼핑몰의 기획자가 주관적인 판단으로 상품 배너의 색상 및 폰트를 작성하였던 것을 본 발명은 인공지능을 이용하여 처리함으로써 소비자의 주목성이 높은 배너 광고가 자동적으로 생성된다. 도 1 은 본 발명의 컬러 배너 생성 시스템의 블럭다이어그램이다. 본 발명의 컬러 배너 생성 시스템은, 통상의 컴퓨터와 같이 사용자에 의하여 운용되는 단말기에 본 발명의 컬러배너생성시스템을 구현하기 위한 어플리케이션 프로그램(application program)이 인스톨되어 실행됨으로써 시스템이 구현된다. 그리고, 사용자의 단말기와 데이터 통신을 수행하며 의류의 판매를 위한 웹페이지를 운용하는 서버와, 상기 서버와 연동된 데이터베이스를 포함하고, 상기 데이터베이스에는 의류 판매 용 웹페이지의 데이터와 배너를 이용하여 판매하고자 하는 의류의 판매정보가 저장되어 있다. 상기 의류의 판매정보는 의류의 사진, 종류(상의, 하의, 바지, 치마, 코트, 점퍼 등의 의류의 품목), 브랜드, 색상, 사이즈, 가격, 생산연도, 타겟 연령층 등의 정보이다.또한, 본 발명의 컬러 배너 생성 시스템에 의하여 생성되는 배너 광고는 인터넷을 통하여 웹상에서 표시되는 웹 페이지로 생성되거나 또는 휴대폰 표시용 화면으로 구현될 수 있다. 이하, 도면을 참조하여 본 발명의 시스템을 개조식으로 상세하게 설명하기로 한다. 1-1) 명령입력부 상기 명령입력부는 배너생성의 시작을 위한 명령어를 본 발명의 시스템이 실행중인 단말기를 이용하여 입력받는 부분이다. 1-2) 배너상품 기준선정부 상기 명령입력부로부터 배너생성의 시작을 위한 명령어를 전달받아 배너에 포함될 상품의 기준을 선정하는 부분이다. 본 발명의 실시예는 서버에서 실행되는 상품 판매용 웹페이지에서 가장 많이 판매되는 상품을 순위별로 정 렬시킨 베스트 상품 기준으로 선정하거나 또는 가장 최신의 상품을 순위별로 정렬시킨 최신 상품 기준으로 선정 하되, 사용자가 단말기를 이용하여 베스트 상품 기준 또는 최신 상품 기준을 선택할 수 있도록 한다. 1-3) 의류색상추출부 상기 배너상품 기준선정부로부터 배너를 생성할 상품의 기준이 선정되면, 선정된 상품들 중 적어도 하나 이 상의 상품을 판매하기 위한 배너를 제작하기 위하여 데이터베이스에 저장된 의류의 판매정보상의 해당 의 류의 사진데이터 및 판매정보의 색상데이터에 기초하여 해당 의류의 색상을 추출하는 부분이다. 이때, 본 발명의 실시예의 배너생성시스템은 상기 의류의 색상추출을 통상의 기계적학습기법을 이용한 인공지능 엔진(engine)을 이용하여 의류의 색상을 자동적으로 추출한다. 1-4) 배너템플릿선택부 상기 의류색상추출부에서 배너에 표시될 의류에 부합되는 배너용 템플릿(template)을 선택하는 부분이며, 배너템플릿선택부와 연동된 템플릿데이터베이스에 저장된 템플릿을 선택한다. 상기 템플릿에는 배너에 표시되는 상품의 설명을 위한 문구를 포함하고 있다. 이때, 상기 의류색상추출부와 마찬가지로, 본 발명의 실시예의 배너생성시스템은 상기 템플릿의 선택을 통 상의 기계적학습기법을 이용하여 인공지능 엔진(engine)이 의류의 색상 및 종류에 따라서 자동적으로 선택한다. 1-5) 폰트색상조절부 상기 배너템플릿선택부에 의하여 의류에 부합되는 배너용 템플릿(template)이 선택되면, 상품과 함께 배너 에 표시될 문구의 색상을 조절하는 부분이다. 본 발명의 실시예의 배너생성시스템은 상기 폰트의 색상의 조절을 통상의 기계적학습기법을 이용하여 인공지능 엔진(engine)이 의류의 색상 및 종류에 따라서 자동적으로 조절하게 된다. 1-6) 배너출력부 폰트색상조절부에 의하여 폰트의 색상이 조절된 배너를 단말기에 표시하고, 사용자에 의하여 배너를 최종적으로 승인받는 부분이다. 그리고, 단말기의 사용자가 표시된 배너를 확인하고 이를 배너로서 승인하면, 해당 배너는 서버로 전 달되어 의류 판매용 웹페이지에 개시되게 된다. 다음으로, 본 발명의 컬러 배너 생성 방법을 각 단계별로 개조식으로 설명하되, 전술한 본 발명 시스템에서 설 명한 부분과 동일한 구성 부분의 설명은 생략한다. 도 2 는 본 발명의 컬러 배너 생성 방법의 순서도이다. 2-1) 명령입력단계(S1) 배너생성의 시작을 위한 명령어를 본 발명의 시스템이 실행중인 단말기를 이용하여 입력받는 단계이다. 2-2) 배너상품 기준선정단계(S2) 상기 명령입력단계(S1)로부터 배너생성의 시작을 위한 명령어를 전달받아 배너에 포함될 상품의 기준을 선정하 는 단계이다. 본 발명의 실시예는 서버에서 실행되는 상품 판매용 웹페이지에서 가장 많이 판매되는 상품을 순위별로 정 렬시킨 베스트 상품 기준으로 선정하거나 또는 가장 최신의 상품을 순위별로 정렬시킨 최신 상품 기준으로 선정 하되, 사용자가 단말기를 이용하여 베스트 상품 기준 또는 최신 상품 기준을 선택할 수 있도록 한다. 2-3) 의류색상추출단계(S3) 상기 배너상품 기준선정단계(S2)로부터 배너를 생성할 상품의 기준이 선정되면, 선정된 상품들 중 적어도 하나 이상의 상품을 판매하기 위한 배너를 제작하기 위하여 데이터베이스에 저장된 의류의 판매정보상의 해당 의류의 사진데이터 및 판매정보의 색상데이터에 기초하여 해당 의류의 색상을 추출하는 단계이다. 이때, 본 발명의 실시예의 배너생성단계는 상기 의류의 색상추출을 통상의 기계적학습기법을 이용한 인공지능 엔진(engine)을 이용하여 의류의 색상을 자동적으로 추출하며, 이러한 본 발명 실시예의 의류색상추출단계는 도 3 을 이용하여 설명하면 다음과 같다. 도 3 은 본 발명의 컬러 배너 생성 방법의 의류 색상 추출 단계의 순서도이다. 도면을 참조하면, 본 발명의 의류색상추출단계(S3)는, 단말기로부터 의류색상추출의 요청이 입력되면 (S30), 데이터베이스로부터 해당 의류의 사진이 업로드되고(S31), 인공지능 엔진은 업로드된 의류의 색상 을 추출한다(S32). 그리고, 인공지능엔진은 업로드된 의류의 색상이 정확하게 추출되었는지를 확인한다(S33). 상기 S33 단계의 색상의 추출 확인은 인공지능엔진이 데이터베이스에 저장된 룰(rule) 기반 색상 사전 (dictionary)의 데이터와 추출된 의류의 색상을 비교하여 추출된 의류의 색상이 정확한지의 여부를 판단하게 된 다. 이후, 상기 S33 단계의 확인결과, 추출된 색상이 의류의 색상과 일치하도록 추출되었다고 판단되면, 추출된 색 상이 정확한 색상임을 알려주는 메세지를 단말기에 표시한다(S34). 또한, 상기 S33 단계에서 인공지능엔진은 추출된 색상이 의류의 색상과 불일치하게 추출되었다고 판단되면 추출 이 잘못되었음을 표시하는 에러메세지를 단말기에 표시한다(S35). 또한, 상기 S33 단계의 확인결과, 인공지능엔진은 추출된 색상이 의류의 색상과 불일치하게 추출되었다고 판단 되면 의류의 색상을 추천하여 주는 메세지를 단말기에 표시하여 줄 수도 있다. 2-4) 배너템플릿선택단계(S4) 상기 의류색상추출단계(S3)에서 배너에 표시될 의류에 부합되는 배너용 템플릿(template)을 선택하는 단계이다. 이때, 상기 탬플릿은 배너템플릿선택부와 연동된 템플릿데이터베이스에 저장된 템플릿중에서 적어도 하 나 이상의 템프릿을 선택하게 되며, 상기 템플릿에는 배너에 표시되는 상품의 설명을 위한 문구를 포함하고 있다. 또한, 상기 의류색상추출단계(S3)와 마찬가지로, 상기 템플릿의 선택을 통상의 기계적학습기법을 이용하여 인공 지능 엔진(engine)이 의류의 색상 및 종류에 따라서 자동적으로 선택하게 된다. 2-5) 폰트색상조절단계(S5) 상기 배너템플릿선택단계(S4)에 의하여 의류에 부합되는 배너용 템플릿(template)이 선택되면, 상품과 함께 배 너에 표시될 문구의 폰트의 색상을 조절하는 단계이다. 또한, 본 발명의 실시예는 폰트의 색상의 조절을 통상의 기계적학습기법을 이용하여 인공지능 엔진(engine)이 의류의 색상 및 종류에 따라서 자동적으로 조절하는 것이 바람직하다. 2-6) 배너출력단계(S6) 상기 폰트색상조절단계(S5)에 의하여 문구의 폰트의 색상이 조절된 배너를 단말기에 표시하고, 사용자에 의하여 배너를 최종적으로 승인받는 단계이다. 그리고, 단말기의 사용자가 최종적으로 배너를 승인하면, 해당 배너는 서버로 전달되어 의류 판매용 웹페이지에 개시되게 된다. 한편, 도 4 는 본 발명의 시스템 및 방법에 의하여 '오피스룩'에 관한 배너광고가 자동적으로 생성된 화면의 일 례를 나타낸다."}
{"patent_id": "10-2021-0111984", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 본 발명의 컬러 배너 생성 시스템의 블럭다이어그램, 도 2 는 본 발명의 컬러 배너 생성 방법의 순서도, 도 3 은 본 발명의 컬러 배너 생성 방법의 의류 색상 추출 단계의 순서도, 도 4 는 본 발명의 컬러 배너 생성 방법에 의하여 생성된 배너의 일례를 나타내는 도면이다."}
