{"patent_id": "10-2021-0155167", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0068897", "출원번호": "10-2021-0155167", "발명의 명칭": "인플루언서 영향력 분석 서비스 제공 방법", "출원인": "주식회사 클라코퍼레이션", "발명자": "심성준"}}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "분석 서비스 제공 서버에서 실행되는 분석 서비스 제공 방법에 있어서,검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요청하는 단계;상기 인플루언서의 게시물에 부착된 적어도 하나의 종류의 반응 데이터를 추출하는 단계;상기 적어도 하나의 종류의 반응 데이터를 분석하여 상기 인플루언서의 영향력 척도를 산출하는 단계; 및산출된 상기 영향력 척도를 상기 검색 단말로 전송하는 단계;를 포함하는 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 적어도 하나의 종류의 반응 데이터를 분석하여 상기 인플루언서의 영향력 척도를 산출하는 단계는,상기 인플루언서의 게시물 중 최근순으로 정렬하여 기 설정된 수의 게시물을 추출하는 단계;추출된 상기 기 설정된 수의 게시물에 포함된 적어도 하나의 반응 데이터의 평균인 평균 반응수를 산출하는 단계;상기 기 설정된 수의 게시물에 부착된 적어도 하나의 반응 데이터를 부착시킨 구독자의 국적 및 언어를 기반으로 국내 구독자 수를 추출하는 단계;상기 국내 구독자 수에 상기 평균 반응수를 곱한 후, 상기 인플루언서의 구독자 수 평균을 상기 평균 반응수로나눈 값을 곱하는 단계;를 포함하는 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 기 설정된 수의 게시물의 기 설정된 수는 10 개이고,상기 적어도 하나의 반응 데이터의 반응은 좋아요 인 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 국내 구독자 수는, 500 명을 상한으로 추출한 숫자이고,상기 국내 구독자 수에 상기 평균 반응수를 곱하기 전, 상기 국내 구독자수에 500으로 나누는 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0068897-3-제 1 항에 있어서,상기 적어도 하나의 종류의 반응 데이터를 분석하여 상기 인플루언서의 영향력 척도를 산출하는 단계 이후에,상기 기 설정된 개수의 게시물의 카테고리를 기 저장된 이미지 분석 알고리즘을 이용하여 추출 및 분류하는 단계;상기 기 설정된 개수의 게시물 내 포함된 제품명을 추출하는 단계;상기 카테고리와 상기 제품명 간 적합도인 카테고리 적합도를 파악하는 단계;상기 영향력 척도 및 카테고리 적합도를 합산하여 제품별 영향력 척도를 산출하는 단계;를 더 포함하는 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요청하는 단계 이후에,상기 인플루언서의 구독자 수, 게시물 수 및 참여율(Engagement Rate)에 기반하여 허위 또는 가짜 구독자(FakeFollower)가 존재하는 계정인지의 여부를 확인하는 단계;를 더 포함하는 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 확인은 상기 게시물 수 대비 상기 참여율의 비율이 기 설정된 허용범위를 도과했는지의 여부로 판단하는것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 6 항에 있어서,상기 확인은 적어도 하나의 종류의 인공지능 알고리즘으로 가짜 구독자 탐지하는 방법으로 판단하는 것을 특징으로 하는 인플루언서 영향력 분석 서비스 제공 시스템."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인플루언서 영향력 분석 서비스 제공 방법이 제공되며, 검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요청하는 단계, 인플루언서의 게시물에 부착된 적어도 하나의 종류의 반응 데이터를 추출하는 단계, 적어 도 하나의 종류의 반응 데이터를 분석하여 인플루언서의 영향력 척도를 산출하는 단계 및 산출된 영향력 척도를 검색 단말로 전송하는 단계를 포함한다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인플루언서 영향력 분석 서비스 제공 시스템에 관한 것으로, 인플루언서의 구독자 중 허수를 제외하 고 실제로 영향력을 끼치는 구독자를 게시물에 부착된 반응 데이터로 예측하는 방법을 제공한다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소셜미디어의 콘텐츠는 디지털 커뮤니케이션의 보편화를 토대로 지속적인 성장을 보이고 있으며, 더불어 소셜 미디어 콘텐츠를 생산하는 인플루언서의 활동이 주목받고 있다. 각 기관과 기업과 같은 조직은 인플루언서를 활용한 전략적 마케팅 커뮤니케이션을 실행하고 있는데, 저비용 고효율을 획득할 수 있고, 잠재 고객과의 높은 관계성을 보유함으로 고객과 조직과의 신뢰가 비례하여 축적되기 때문이다. 인플루언서와 사용자 간의 지속적 인 관계형성은 콘텐츠를 통해 노출되는 브랜드와의 관계에도 영향을 미치게 된다. 주요고객 뿐 아니라 잠재고 객까지 영향력을 미치는 SNS 인플루언서는 특정한 개인 중심의 마케팅 활동을 시행하여 효과성을 입증하고 있으 며, 특히 소셜 미디어 중에서 유튜브를 활용한 인플루언서 마케팅 활동은 지속적인 증가추세를 보이고 있는데,유튜브 채널은 상호작용을 통한 양방향성의 특성뿐 아니라, 서비스 및 콘텐츠 채널의 다양성을 통해 마케팅 효 과를 창출하는 것으로 평가받는다. 이때, 인플루언서의 영향력이나 사용자의 반응을 이용하여 광고의 진정성 지수를 산출하거나 소셜미디어 데이터 로 인플루언서를 평가하는 방법이 연구 및 개발되었는데, 이와 관련하여, 선행기술인 한국공개특허 제2021- 0067575호(2021년06월08일 공개) 및 한국공개특허 제2021-0074080호(2021년06월21일 공개)에는 인플루언서 단 말로부터 소셜미디어에 게시된 광고열람정보를 수신하고, 광고 캠페인의 관심수 및 댓글수를 추출하며, 관심수 와 댓글수에 서로 다른 가중치를 적용한 후 합산함으로써 광고 반응지수로 산출하고, 광고 캠페인 외 다른 게시 물의 평균 관심수 및 댓글수를 합산한 후 평균 반응지수로 산출하며, 광고 반응지수를 평균 반응지수로 나누어 진정성 지수를 산출하는 구성과, 인플루언서의 소셜미디어 주소가 포함된 인플루언서 정보를 생성하고, 인플루 언서 단말로부터 소셜미디어 데이터를 수집하여 인플루언서 정보의 신뢰도를 평가하며, 광고주 단말로부터 광고 발주정보를 수신받아 광고발주정보에 대응되는 인플루언서 정보를 추출하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 댓글의 내용이나 관심을 표시한 구독자의 정성적으로 분석하는 것이 아니라, 단순히 정량적 분석으로 댓글수 및 관심수만 고려하는 것이기 때문에 실제 댓글을 쓰거나 관심을 보인 사용자의 국적, 언어, 국내에서 실제로 활동하는 유효활동사용자인지의 여부, 허위나 가짜 계정인지의 여부 등 인플루언서가 실제로 몇 명의 구독자에게 영향을 미치는지에 대한 정보는 알 수가 없다. 후자의 경우에도 기 설정된 유효키워드와의 매칭율, 추천수, 공유수, 구독자수, 댓글수에 기반하여 신뢰도를 측정하게 되므로 이 역시 정량적 분석에 불과 하다. 이에, 허수가 섞여있는 인플루언서의 구독자를 정성적 분석으로 필터링하여 실제 영향력을 받고 있는 구 독자의 수를 산정하고, 광고주에게 노출함으로써 적합한 인플루언서를 선택할 수 있도록 하며, 마케팅 비용의 누수를 최소화할 수 있는 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 인플루언서의 최근 게시물의 반응의 평균인 평균 반응수를 산출하고, 최근 게시물의 반 응에 기여한 사용자의 국적 및 언어를 분석하여 국내에서 활동하는 구독자 수를 추출하며, 평균 반응 수에 대해 추출한 국적 및 언어를 대입하여 영향력이 도달하는 구독자의 수를 확보하고, 구독자 수 평균을 평균 반응수로 나눈 값을, 영향력이 도달하는 사용자의 수에 곱해 주며, 국내 구독자가 타 언어로 계정을 생성했을 경우를 대 비하여 가중치를 곱함으로써 인플루언서의 영향력 척도로 도출할 수 있고, 허수가 섞여있는 인플루언서의 구독 자를 정성적 분석으로 필터링하여 실제 영향력을 받고 있는 구독자의 수를 산정하고, 광고주에게 노출함으로써 적합한 인플루언서를 선택할 수 있도록 하며, 마케팅 비용의 누수를 최소화할 수 있는, 인플루언서 영향력 분석 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기 술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요청하는 단계, 인플루언서의 게시물에 부착된 적어도 하나의 종류의 반응 데 이터를 추출하는 단계, 적어도 하나의 종류의 반응 데이터를 분석하여 인플루언서의 영향력 척도를 산출하는 단 계 및 산출된 영향력 척도를 검색 단말로 전송하는 단계를 포함한다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 허수가 섞여있는 인플루언서의 구독자를 정성적 분석 으로 필터링하여 실제 영향력을 받고 있는 구독자의 수를 선정하고, 광고주에게 노출함으로써 적합한 인플루언 서를 선택할 수 있도록 하고 마케팅 비용의 누수를 최소화할 수 있다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 인플루언서 영향력 분석 서비스 제공 시스템은, 적어도 하나의 검색 단말, 분석 서비 스 제공 서버, 적어도 하나의 소셜미디어 플랫폼을 포함할 수 있다. 다만, 이러한 도 1의 인플루언 서 영향력 분석 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 검색 단말은 네트워크를 통하여 분석 서비스 제공 서버와 연결될 수 있다. 그리고, 분석 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 검색 단말, 적 어도 하나의 소셜미디어 플랫폼과 연결될 수 있다. 또한, 적어도 하나의 소셜미디어 플랫폼은, 네트워크를 통하여 분석 서비스 제공 서버와 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 검색 단말은, 인플루언서 영향력 분석 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 인플루언서의 아이디나 계정 등을 입력한 후, 해당 인플루언서의 구독자 중 허수, 즉 가짜나 허위 계정을 제외한 나머지의 구독자 중 몇 명에게 실질적으로 영향을 미치고 있는지에 대한 영향력 척 도를 확인하고자 하는 개인, 기업, 기관 등의 단말일 수 있다. 이때, 검색 단말의 검색자는 재미를 위해 인플루언서를 검색하는 사람일 수도 있고, 광고를 의뢰하기 위하여 구독자를 분석하고 영향력 척도를 파악하기 위한 이해관계를 가진 자일 수도 있다. 여기서, 적어도 하나의 검색 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 검색 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 검색 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 분석 서비스 제공 서버는, 인플루언서 영향력 분석 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케 이션을 제공하는 서버일 수 있다. 그리고, 분석 서비스 제공 서버는, 영향력 척도를 계산할 수 있는 수학 식 및 알고리즘을 저장해두고, 검색 단말에서 인플루언서의 아이디나 계정이름 등을 입력하는 경우, 소셜 미디어 플랫폼에 접속하여 인플루언서의 페이지를 검색하는 서버일 수 있다. 그리고, 분석 서비스 제공 서버는, 인플루언서의 페이지, 예를 들어, 페이스북이라면 Post 페이지 내 최근 게시물을 N 개 선정하고, 최근 게시물에 부착된, 즉 좋아요, 댓글, 공유 등 반응 데이터를 수집하는 서버일 수 있다. 또한, 분석 서비스 제공 서버는, 반응을 나타낸 구독자의 국적 및 언어를 파악한 후, 한국인 구독자가 몇 명인지 파악하는 서 버일 수 있다. 이는 최근 허위 또는 사기 구독자가 붙은 인플루언서 계정을 돈을 주고 거래하기도 하는데, 외 국 계정 구독자가 붙은 계정은 한국인 구독자가 붙은 계정보다 더 싸게 거래된다. 한국의 경우 휴대폰을 이용 한 본인인증절차가 일반화되어 있지만 국외의 경우에는 이메일 주소만 있으면 한 사람이 몇 개든 구독자 계정을 허위로 만들어 붙일 수 있기 때문이다. 이에, 분석 서비스 제공 서버는, 한국인 구독자의 수를 파악한 후, 평균 반응수, 구독자 수 평균, 국내 구독자의 파라미터에 기초하여 영향력 척도를 검색 단말로 출력하 는 서버일 수 있다. 여기서, 분석 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 소셜미디어 플랫폼은, 인플루언서 영향력 분석 서비스 관련 웹 페이지, 앱 페이지, 프로그 램 또는 애플리케이션을 이용하거나 이용하지 않고 분석 서비스 제공 서버에서 인플루언서의 아이디 또는계정이름을 검색하는 경우 그 결과인 인플루언서 페이지를 제공하는 소셜미디어 플랫폼일 수 있다. 이때, 소셜 미디어는, 페이스북, 인스타그램, 트위터, 틱톡, 유튜브 등일 수 있으나 이에 한정되지는 않는다. 여기서, 적 어도 하나의 소셜미디어 플랫폼은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 분석 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 분석 서비스 제공 서버는, 요청부, 추출부, 산출부, 전송부, 제품 관리부 및 허수판별부를 포함할 수 있다. 본 발명의 일 실시예에 따른 분석 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하 나의 검색 단말 및 적어도 하나의 소셜미디어 플랫폼로 인플루언서 영향력 분석 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 검색 단말 및 적어도 하나의 소셜미디어 플랫폼은, 인플루언서 영향력 분석 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페 이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나의 검색 단말 및 적어도 하나의 소셜미디어 플랫폼에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러(Explorer), 크롬(Chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램 (Application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 도 2를 설명하기 이전에, 본 발명의 일 실시예가 도출된 배경을 설명한다. 최근 소셜미디어의 팔로워(Follower, Subscriber, 구독자)를 늘려주는 업체가 성행하고 있다. 팔로워 250명 늘 리는데 5 시간 걸리고 4 만원이라는 광고가 붙은 곳이 대다수이다. 한국인 팔로워 250명(3만9800원)이고, 인스 타그램 팔로어는, 한 명당 160원 정도이다. 소셜미디어 마케팅 업체는, 24시간 안에 팔로어 숫자를 확실히 늘 려준다며 광고하고 있으며, 언팔로우(팔로우를 끊는 행위)에 대비해 약속보다 많은 숫자를 팔로우시키고, 한 달 사이 5％ 넘게 숫자가 줄면 A/S로 다시 채워주고 있다. 업체가 채워준 팔로어는 상품 설명대로 모두 한국인을 가장하고 있다. 다만, 타인의 인스타그램 사용자의 사진과 글을 마구잡이로 짜깁기한 계정이었지만 전체 팔로 어 목록만 보면 진짜와 가짜를 구분할 수 없다. 맞춤형 조작이 안 되는 곳 없다. 페이스북도 마찬가지인데, 맛집 소개하는 페이스북 페이지를 운영하는데 팔로 어를 빨리 늘리고 싶은 경우에도, 한국인 팔로어 1명당 70원, 유령 한국인 30원, 외국인 20원이라는 가격표를 받을 수 있다. 조작 업체는 동남아 외국인 팔로어로 채우면 값은 싸지만 의심을 받으니 차라리 한국인 유령 팔 로어를 추천하라고 조언도 한다. 업체끼리 경쟁도 치열하다. 수년간 쌓은 노하우로 페이스북, 인스타그램 감 시를 피해서 '좋아요', 댓글 숫자로 딱 맞춰 올려준다거나, 매크로(Macro) 쓰는 곳과 달리 실제 계정을 이용해 품앗이 형태로 자연스럽게 작업한다거나, 페이스북, 인스타그램, 유튜브뿐만 아니라 텀블러, 사운드 클라우드, 비메오 등 모두 조작 가능하다는 곳 등 업체마다 내세우는 경쟁력도 다르다. 온라인 음악 플랫폼 사운드 클라우드 재생(Play) 횟수도 조작하는데 가격은 1 만번에 5000 원이다. 또 태국에 서 적발된 클릭 팜(Click Farm)은, 스마트폰 500여 대 및 유심카드 40만 개로 운영되었고 좋아요와 공유를 대량 조작했다. 태국까지 넘어온 중국인 3명은 이곳에서 특정 중국 상품을 띄우기 위해 광고 게시글을 반복해서 공 유하고 좋아요를 눌렀다. 또, 미국 마케팅 회사 미디어킥스는 조작으로 만든 가짜가 어디까지 통하는지 실험했 는데, 인스타그램에 패션모델과 여행가 계정 2 개를 만들어 가짜 팔로어를 꾸준히 구매하는 실험이었다. 팔로 어가 1 만명을 넘자 광고 제안이 들어왔고, 광고주들에게는 인플루언서라고 홍보했다. 가짜 계정은 3 개월 만 에 수영복, 식음료 등 각각 2 개씩 광고를 따냈다. 한국PR학회 총무이사 홍문기 한세대 교수는 가짜 팔로어로 이익을 챙기는 비즈니스 모델은 시장 기본 질서를 훼손하고 결국 피해는 소비자에게 돌아갈 것이라고 말했고, 조창환 연세대 언론홍보영상학부 교수는 현재 포털과 소셜미디어는 가짜 계정이 판치면서 신뢰를 잃고 있다며 실제 사용자(Active User)와 가짜를 더 적극적으로 가려내는 시스템이 필요하다고 언급했다. 이에, 본 발명의 일 실시예는, 구독자 수, 공유 수, 댓글 수, 좋아요 수와 같은 정량적인 데이터 보다는 실제 인플루언서가 영향력을 끼치는 구독자의 수가 몇 명인지를 정성적으로 분석하여 개인이나 이해관계자에게 제공 하기로 한다. 도 2를 참조하면, 요청부는, 검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요청할 수 있다. 예를 들어, \"법률의 중심 테헤란\"이라는 인플루언서가 존재하고, 소셜미디어가 인스타그램이라면 @teheran_law가 해당 인플루언서의 아이디 또는 계정이다. 추출부는, 인플루언서의 게시물에 부착된 적어도 하나의 종류의 반응 데이터를 추출할 수 있다. 이때, 반 응 데이터는, 좋아요의 수 일 수도 있지만, 공유 수, 댓글 수 등일 수도 있다. 산출부는, 적어도 하나의 종류의 반응 데이터를 분석하여 인플루언서의 영향력 척도를 산출할 수 있다. 산출부는, 적어도 하나의 종류의 반응 데이터를 분석하여 인플루언서의 영향력 척도를 산출할 때, 인플루 언서의 게시물 중 최근순으로 정렬하여 기 설정된 수의 게시물을 추출할 수 있다. 예를 들어, 기 설정된 수의 게시물의 기 설정된 수가 10 개라면, 최근순으로 정렬하여 10 개의 게시물(Posting)을 추출할 수 있다. 산출부는, 추출된 기 설정된 수의 게시물에 포함된 적어도 하나의 반응 데이터의 평균인 평균 반응수를 산 출할 수 있다. 이때, 적어도 하나의 반응 데이터의 반응은 좋아요일 수 있다. 예를 들어, 10 개의 게시물이 있고, 1 번째 게시물에는 반응 데이터의 수, 예를 들어 \"좋아요\" 버튼이 A 번 눌렸고, 2 번째 게시물에는 B 번,...,10 번째 게시물에는 J 번 눌렸다고 가정하면, 평균 반응수는, (A+B+....+J)에서 나누기 10을 한 결과이 다. 산출부는, 기 설정된 수의 게시물에 부착된 적어도 하나의 반응 데이터를 부착시킨 구독자의 국적 및 언어를 기반으로 국내 구독자 수를 추출할 수 있다. 국내 구독자는 바람직하게는 한국인 구독자일 수 있다. 예를 들어, 페이스북, 인스타그램, 틱톡, 유튜브 등을 다운로드받기 위해서는 기본적으로 안드로이드에서는 구 글플레이, iOS에서는 애플스토어에 가입하는 계정(이메일 주소 등)이 필요하다. 그 다음 페이스북에 가입하기 위해서는 다시 이메일 주소와 비밀번호가 필요한데, 이 두 개를 거치면 가입한 사용자의 국적을 파악할 수 있다. 또, 국내 구독자 수는, 500 명을 상한으로 추출한 숫자인데, 데이터 확보 속도 고속화를 위해 500 명까지의 구 독자(국내 구독자 아님)의 국적 및 언어만을 추출한다. 또, 국내 구독자 수에 평균 반응수를 곱하기 전, 국내 구독자수에 500으로 나눌 수 있다. 산출부는, 국내 구독자 수에 평균 반응수를 곱한 후, 인플루언서의 구 독자 수 평균을 평균 반응수로 나눈 값을 곱하고 기 설정된 가중치를 곱할 수 있다. 기 설정된 가중치는, 국내 구독자가 한국어 이외의 언어로 계정을 생성했을 경우를 대비하여 부가되는 가중치이고, 기 설정된 가중치는 1.7일 수 있다. 최근, 특허권이나 저작권 문제 또는 사업권을 해당 국가에서 따내지 못하여 아직 해당 국가에 진입하지 못하는 애플리케이션들이 있고, 이에 따라 각 국가마다 지원하는 애플리케이션들이 서로 다르기 때문 에, 각 국가가 서로 바뀔 때마다 다운로드받을 수 있는 애플리케이션이 오픈 또는 제한된다. 이에, 최근에는 한국인일지라도 한국에서 사용하지 못하는 애플리케이션, 예를 들어, Spotifiy와 같은 뮤직플레 이 애플리케이션을 다운로드받기 위해 계정을 미국이나 호주 계정으로 변경하는 경우가 많다. 이에, 한국인일 지라도 외국계정을 사용하는 경우를 대비하여 가중치를 곱해준다. 예를 들어, 한국인인 A씨가 미국계정을 사용 하여 구글플레이에 가입했고, 페이스북을 다운로드받았으며, 페이스북을 사용하면서 \"좋아요\"를 눌렀는데, 실제 로는 한국인이지만 미국계정을 사용하기 때문에 국내 구독자로 분류되지 않았다. 이 경우 배제가 되는데 이를 대비하기 위해, 실제 국내 구독자로 걸러진 수에 1.7배라는 가중치를 더 곱하는 것이다. 즉, 100 명이 국내 구 독자로 필터링되었다면, 70명 정도는 국외(해외) 이용자로 오인되어 필터링되고 걸러졌다는 것을 전제하고 이를 도로 채워주는 것이다. 이를 수학식으로 정리하면 이하 수학식 1과 같다. 수학식 1"}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이때, 구독자수 평균이란 기 설정된 기간동안 구독자수의 평균을 의미할 수도 있고, 현재를 기준으로 총 구독자 수를 의미할 수도 있다. 가중치는 상술한 바와 같이 1.7이지만 실시예에 따라 변경될 수도 있다. 여기서, 가 중치를 곱하는 것을 대체하거나 이에 부가하여 계정의 위치태그와 게시물의 언어를 분석하여 국내 계정을 추출 할 수도 있다. 예를 들어, 계정은 \"Denworth\"로 영어인데, 게시물의 언어가 \"날씨 좋다\"라는 텍스트로 한글이 고, 게시물에 달린 해시태그가 #이태원, #송리단길이라면 이는 한국인 계정으로 보고 국내 구독자수에 포함시킬 수도 있다. 전송부는, 산출된 영향력 척도를 검색 단말로 전송할 수 있다. 영향력 척도는 수치로 계산되어 검색 단말로 전송될 수 있다. 이때, 검색 결과를 리셋하고 다시 검색을 실시할 수도 있지만, 검색자가 검색한 결과를 히스토리 로그로 누적하고 이후 검색 결과를 비교분석하는 시각화도 가능할 수 있다. 예를 들어, 인플 루언서 A 내지 Z를 검색했다면, 영향력 척도를 내림차순으로 정렬해줄 수도 있고, 검색 결과가 계속 동일하지 않으므로(최근 게시물 10 개를 분석하기 때문에) 주기적으로 또는 실시간으로 변동되는 경우 변동된 데이터를 반영하여 순위를 재정렬해줄 수도 있다. 또, 검색했던 인플루언서의 영향력 척도가 변경되는 것을 주식 그래프 와 같이 차트로 제공할 수도 있는데, 만약 영향력 척도가 오차범위를 벗어나 떨어지는 경우, 인플루언서에게 어 떠한 사건사고가 발생하지 않았는지에 대하여 웹크롤링으로 검색한 후 그 이유에 대해 그래프가 떨어진 시점에 키워드를 태깅하여 정보를 제공할 수도 있다. 제품관리부는, 산출부에서 적어도 하나의 종류의 반응 데이터를 분석하여 인플루언서의 영향력 척도 를 산출한 이후, 기 설정된 개수의 게시물의 카테고리를 기 저장된 이미지 분석 알고리즘을 이용하여 추출 및 분류할 수 있다. 이때, 이미지 분석 알고리즘은, 이미지 내에서 객체를 인식 및 추출하는 딥러닝을 이용할 수 있다. <딥러닝> 이미지에서 객체 인식을 하는 방법으로 최근에는 인공지능을 활용한 방식이 빈번하게 사용되고 있는데, 그 중 가장 폭넓게 활용하는 방식은 R-CNN 계열의 알고리즘을 들 수 있다. 영역 기반의 합성곱을 활용한 방식으로 여 러 개의 신경망이 연속적으로 이어져 있고, 각 신경망에 해당하는 가중치 값들이 존재한다. 이 가중치 값은 학 습에 의하여 결정되고, 이렇게 결정된 값들은 객체 인식에 이용되는데, Fast R-CNN, Faster R-CNN, Mask R-CNN 이 등이 존재한다. 첫 번째 Fast R-CNN은 단일 단계 학습을 통해 백본 네트워크(Backbone Network)를 확보할 수 있다. 단일 단계 학습을 할 수 있어 간단하게 인공지능 모델을 확보할 수 있는 장점이 있지만, 다수의 관심 영역(Region of Interest, ROI) 경계 상자(Boundary Box) 후보군을 생성하는데 시간이 소요된다는 단점이 있다. 이는 주로 긴 연산 시간을 갖는 선택적 검색(Selective Search) 알고리즘 수행에 기인한다. 이 점을 개선하기 위하여 Faster R-CNN에서는 새로운 방법을 제시했는데, 특히 관심 영역 경계 상자 후보군을 생성하는데, 새로운 심층 신경망을 사용한다. 즉, 기존의 알고리즘은 주로 CPU 자원을 활용한 연산을 사용하여 비교적 많은 연산 시간이 소요되었지만, 심층 신경망을 통한다면 GPU를 사용하기 때문에 연산 시간이 단축된다. 이 같은 심층 신경망은 관심 영역의 후보군을 제공하는 기능을 한다고 하여 영역 제안 네트워크(Region Proposal Network)라고 하는데, 백본 네트워크에 비해 상대적으로 적은 신경망 층을 가지고 있다. 이 신경망을 통해 객체 인식을 하는 필요한 하드웨어 자원의 대부분이 CPU에서 GPU로 이동할 수 있다. 다만, 이 같은 구조 로 완성된 모델을 만들기 위해서는 여러 단계를 거친 학습 수행이 필요하다. Faster R-CNN은 백본 네트워크, 영역 제안 네트워크, 분류 네트워크(Classifier Network)로 구성되며 이 3 개의 심층 신경망을 학습하기 위해서 는 여러 단계의 수행이 필요하므로 다중 단계 학습 기법으로 완성된 모델을 구하는데 시간이 연장될 수도 있다. R-CNN 계열 방법의 마지막인 Mask R-CNN의 가장 큰 특징은 객체 인식의 분할(Segmentation)까지 가능하다는 점 이다. 그 전까지 객체 인식은 영상 내에서 사각 박스를 통해 객체의 위치를 추정하고 그 종류를 구분하였지만, Mask R-CNN에서는 객체 인식 기술에 객체의 위치를 화소 단위로 구분할 수 있도록 심층 신경망을 설계한다. 이 심층 신경망의 역할은 각 화소가 객체에 해당되는 것인지 아닌지를 구분하는 것으로 바이너리 마스크(Binary Mask)라고 한다. 백본 네트워크로부터 얻은 특징 지도(Feature Map)에 바이너리 마스크를 씌워서 화소 단위로 구분을 짓는다. 다만, 일반적인 특징 지도의 크기는 원본 영상의 크기도 4분의 1일에서 16분의 1크기의 수준으 로 작다. 이렇게 작아진 특징 지도에서 화소 단위로 객체 영역을 결정하더라도 원본 영상에서는 그 오차가 크 게 나타난다. 이 같은 오차를 감소시키기 위하여 관심 영역 정렬(ROI Align)이라는 기법을 사용하는데, 이는 ROI 풀(Pool) 영역에서 생기는 소수점 오차를 2차 선형보간법으로 감소시키는 방법이다. YOLO 중 YOLO-v3은, 하나의 합성곱 신경망이 동시에 여러 개의 경계 상자 (Bounding Box)를 예측하고, 각 경계 상자에 대하여 분류 확률(Class Probability)을 예측하는 알고리즘이다. 이때, 사용되는 합성곱 신경망은 특징 지도를 생성하는 용도로 활용되는데 알고리즘의 중추를 담당한다고 하여 백본 네트워크라고 부른다. 이 특징 지도는 여러 개의 그리드 셀(Grid Cell)로 구성되는데, 각 셀마다 스코어(Score) 방식을 적용하여 대상 객체의 종류와 위치를 동시에 결정하는 알고리즘이다. 이 알고리즘은 학습된 객체를 매 영상 프레임마다 인식하도록 구성될 수 있다. <GAN(Generative Adversarial Network)> 빅데이터의 학습 데이터셋 및 테스트 데이터셋이 충분하지 않은 경우, GAN을 이용하여 학습할 데이터 양을 늘릴 수도 있다. 예를 들어, StarGAN은 상반되는 목적을 가진 두 개의 모듈이 서로 경쟁하며 이미지를 생성하는 네 트워크로, 생성기(Generator)와 판별기(Discriminator)로 구성된다. 생성기는 가짜 이미지를 생성하며, 판별기 는 생성된 이미지와 실제 이미지를 구별하는 모듈이다. 생성기는 판별기가 구별하지 못할 만큼 실제와 같은 가 짜 이미지를 생성하는 것이 목적이며, 판별기는 생성기가 생성한 이미지와 실제 이미지를 구별해내는 것이 목적 이다. 이렇게 학습된 생성기는 판별기로 하여금 실제인지 생성된 이미지인지 구분하지 못할 만큼 실제와 같은 가짜 이미지 생성이 가능해진다. 여기서, 네트워크를 학습시킬 때 Wasserstein GAN의 손실값(Loss)를 사용하여 학습할 수 있다. 제품관리부는, 기 설정된 개수의 게시물 내 포함된 제품명을 추출하고, 카테고리와 제품명 간 적합도인 카테고리 적합도를 파악하며, 영향력 척도 및 카테고리 적합도를 합산하여 제품별 영향력 척도를 산출할 수 있 다. 예를 들어, 인플루언서 A가 수의사이고, A의 최근 게시물(포스팅)에는 반려동물 영양제에 대한 주제가 주 류를 이루었다고 가정하자. 이때, 카테고리를 추출할 때 반려동물 영양제로 추출하고, 각 제품명은 B,C,D,E.. 등으로 추출할 수 있다. 여기서, 반려동물 영양제(카테고리)와 제품명 B,C,D,E... 간의 적합도를 파악할 수 있 다. 가짜나 허위 계정에 게시물을 보면 매크로봇(MacroBot)이 다른 게시물을 가져와 짜깁기하는 경우가 많기 때문에 게시물의 카테고리와 그 내용이 일치하지 않는 경우도 많다. 또는, 실제 가짜 계정이 아닌 진정한 인플 루언서이지만 다른 방향으로 글이 전개되는 경우가 많아 주제에 벗어난 포스팅을 하는 경우도 있다. 이런 경우 에는 적합도가 낮아지게 된다. 게시물의 카테고리와 제품의 적합도를 파악하기 위해서는 사진(이미지) 외에도 텍스트의 분석을 해야할 때가 있 다. 이를 위하여, 본 발명에서는 텍스트 분석을 더 수행힐 수 있다. 예를 들어, 양적 분석인 데이터 크롤링, 수치 데이터 분석 과 함께 댓글이나 게시글 분석인 텍스트의 질적 분석까지 함께 수행할 수 있다. 이때, 은닉 데이터 분석 기법을 이용하여 인플루언서의 제품별 영향력 척도를 제공하는 것을 그 목표로 할 수 있다. 이를 위해, 게시물 및 댓글 내용의 상관관계가 평균적으로 높은 인플루언서의 계정을 분석한 후 해당 결과를 TF- IDF(Term Frequency- Inverse Document Frequency)로 검증하여 일치도가 높을수록 높은 가중치를 부여할 수 있 다. 이는 구독자가 단순히 게시물을 보고 관심도가 높음은 물론 해당 게시물의 유일한 특징 및 속성으로도 일 치하기때문에 다른 구독자들에게도 인플루언서 추천 시 활용되면 더욱 좋다는 것을 의미한다. 특히, 인플루언 서 계정별 TF-IDF(Term Frequency - Inverse Document Frequency) 분석 결과에 최종적으로 LDA(Latent Dirichlet Allocation) 기반 유사도 기반 토픽 모델링을 수행하여 최종적으로 제품별 영향력 척도를 추출할 수 있다. 이를 위하여, 데이터 수집 및 시각화는 해당 기능에 특화된 R언어를, TF-IDF 및 LDA 분석의 경우 분석의 편의를 위해 추가적으로 파이썬 작업이 병행될 수 있다. 테스트는 크게 두 개의 단계로 나뉘는데, 첫 번째는 소셜미디 어에서 제공하는 수치데이터를 통한 변수 간의 관계분석으로 PCA의 경우 Scree와 적재 그림을 통해 시각화를 진 행할 수 있다. 다음으로는 변수(수치 데이터)별로 상관 계수를 구해 수치데이터를 통해 유의미한 결론을 도출 한다. 두 번째의 경우 TF-IDF 분석을 통해 인플루언서 계정별 주요 단어를 추출하고 해당 단어를 바탕으로 LDA 토픽 모델링을 진행하고 이를 바탕으로 제품별 영향력 척도를 계산하고자 한다. 인스타그램, 페이스북, 유튜브 등에 는 평점 정보(Rating Information)는 없기 때문에 해당 성능 평가의 경우 인플루언서 계정의 주제별로 게시물에 게시물 내용과 평균적으로 상관관계가 높은 댓글을 작성한 사람은 높은 평점을, 그 반대일수록 낮은 평점을 매 겼다고 가정하고 평점 매트릭스를 생성한다. 예를 들어, 구독자 A가 인플루언서 B 계정에 등록된 게시물에 게 시물 내용과 연관성이 높은 댓글을 달았다면 해당 평균값의 정규화(Normalization) 값을 구독자 A가 인플루언서 B 계정에 매긴 평점으로 가정한다. 인스타그램, 페이스북, 유튜브에서는 좋아요를 더 자주 누르고 대부분 댓글을 달지 않는 경향이 더 강하지만 본 발명의 일 실시예에서는 어느 정도 인지도 높은 인플루언서 게시물 중 평균 임계치 이상의 댓글들이 달린 게시 물만 고려했기 때문에, 문제가 되는 Sparse Matrix Problem은 없다고 가정한다. 만약, 구독자 A가인플루언서 B 계정의 여러 게시물에 댓글을 달았다면 평균 정규화 값을 평점으로 이용한다. 본 발명의 일 실시예에 따른 방 법을 진행하다보면, 단순히 인지도 높은 인플루언서를 추천해주는 단계를 뛰어넘어 인플루언서 속성을 가진 게 시물 중에서 카테고리 및 제품별로 인플루언서가 어느 정도의 영향력을 가지고 있는지를 파악해줄 수 있다는 장 점을 지닌다. 또한, 새로운 아이템에 대해서 인플루언서 기반 마케팅을 하고자 하는 업체들에게도 제품별로 인 지도 높은 인플루언서 속성들을 추천해줌으로써 마케팅 효과의 만족도를 극대화할 수 있다.허수판별부는, 요청부에서 검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요청 한 후, 인플루언서의 구독자 수, 게시물 수 및 참여율(Engagement Rate)에 기반하여 허위 또는 가짜 구독자 (Fake Follower)가 존재하는 계정인지의 여부를 확인할 수 있다. 이때, 확인은 게시물 수 대비 참여율의 비율 이 기 설정된 허용범위를 도과했는지의 여부로 판단할 수 있다. 예를 들어, 게시글은 10 개인데 좋아요가 100 만개라면 이는 가짜 계정이라고 판단할 수 있다. 또는 확인은 적어도 하나의 종류의 인공지능 알고리즘으로 가 짜 구독자 탐지하는 방법으로 판단할 수 있다. 최근 인공지능을 이용하여 매크로봇을 걸러내거나 가짜 또는 허 위 계정을 탐지하는 방법들이 늘어나고 있다. 이에 영향력 척도를 계산하기 이전에, 구독자 중 몇 퍼센트가 진 정한 계정이고 몇 퍼센트가 그렇지 않은 계정인지를 미리 안내해줄 수도 있다. 이하, 상술한 도 2의 분석 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명 하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 분석 서비스 제공 서버는 검색 단말로부터 인플루언서의 아이디를 입력받고 영 향력 척도를 확인하기 위하여 (b)와 같이 최근 게시물 10 개에 달린 평균 반응수를 계산한다. (c) 그리고 나서, 10 개의 게시물에 반응 중 언어 및 국적을 추출하여 국내(한국인) 구독자를 추출하는데, 이때 데이터 처 리 속도 확보를 위해 500 명까지만 추출한다. 그리고, (d)와 같이 국내 구독자수와 평균 반응수를 곱할 때, 500 명까지만 추출했으므로 500으로 나누어준다. 그 다음에는 도 4의 (a)와 같이 구독자수 평균을 평균 반응수로 나누는데, 만약 이 수가 10 이었다면, 구독자 중 10%가 게시물에 반응을 했다는 의미이다. 그 다음 (b)와 같이 외국계정으로 계정을 만들어 소셜미디어에 가 입한 한국인이 도 3의 (c)에서 탈락(필터링)되었을 경우를 대비하여, 500 명 내 포함된 한국인의 숫자에 1.7배 를 해줌으로써 필터링되었을지도 모르는 한국인의 숫자를 보상(보충)해준다. 그리고 (c) 제품별 영향력 척도를 계산하기 위하여 카테고리 적합도를 더 계산하여 (b)에서 산출한 영향력 척도와 합산할 수 있으며, (d)와 같이 인플루언서의 구독자 중 허수를 판별하여 영향력 척도값과 함께 제공할 수도 있다. 이와 같은 도 2 내지 도 4의 인플루언서 영향력 분석 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 인플루언서 영향력 분석 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부 터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 인플루언서 영향력 분석 서비스 제공 시스템에 포함된 각 구성들 상 호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수 신되는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다"}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "양한 실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자 에게 자명하다. 도 5를 참조하면, 분석 서비스 제공 서버는, 검색 단말에서 인플루언서의 아이디를 입력하여 구독자 분석을 요 청하고(S5100), 인플루언서의 게시물에 부착된 적어도 하나의 종류의 반응 데이터를 추출한다(S5200). 그리고, 분석 서비스 제공 서버는, 적어도 하나의 종류의 반응 데이터를 분석하여 인플루언서의 영향력 척도를 산출하고(S5300), 산출된 영향력 척도를 검색 단말로 전송한다(S5400). 상술한 단계들(S5100~S5400)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5400)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 인플루언서 영향력 분석 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 인플루언서 영향력 분석 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부 터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 인플루언서 영향력 분석 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애 플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현 될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매 체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기 타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리 형 매체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음) 에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서 버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행 될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스 제공 방 법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단 말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2021-0155167", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2021-0155167", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 분석 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 인플루언서 영향력 분석 서비스 제공 방법을 설명하기 위한 동작 흐름도이 다."}
