{"patent_id": "10-2020-0124445", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0041353", "출원번호": "10-2020-0124445", "발명의 명칭": "방열 구조를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "박윤선"}}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1공간을 포함하는 제1하우징;상기 제1하우징으로부터 지정된 왕복 거리로 슬라이딩 가능하게 배치되고, 상기 제1공간과 연결된 제2공간을 포함하는 제2하우징;일단은 상기 제1공간에 고정되고, 타단은 상기 제2공간에 고정되며, 상기 제2하우징의 슬라이딩 동작에 따라 방열 면적이 가변되는 방열 구조(heat dissipation structure); 및상기 제1공간 및/또는 상기 제2공간에 배치되고, 상기 방열 구조의 적어도 일부에 열적으로 연결되는(thermallyconnected) 적어도 하나의 발열 소자를 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1하우징 및 상기 제2하우징의 지지를 받도록 배치되는 플렉서블 디스플레이를 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 제2하우징의 상기 제2공간에 배치되고, 인입 상태(slide-in state)에서, 상기 제2하우징의 제2공간으로 수용되고, 인출 상태(slide-out state)에서 상기 제1하우징과 동일한 평면을 갖도록 외측으로 인출되는 밴딩 가능부재를 포함하고,상기 플렉서블 디스플레이는 상기 인입 상태에서, 상기 밴딩 가능 부재의 지지를 통해, 적어도 부분적으로 상기제2공간으로 수용되고, 상기 인출 상태에서, 상기 밴딩 가능 부재의 지지를 통해, 외부로부터 보일 수 있게 적어도 부분적으로 노출되는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1하우징의 상기 제1공간에 배치되는 기판;상기 기판에 배치되는 상기 발열 소자; 및상기 발열 소자와 상기 방열 구조를 열적으로 연결하는 접촉 플레이트를 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제2공간에서, 상기 방열 구조 근처에 배치되는 방열 팬을 더 포함하는 전자 장치.공개특허 10-2022-0041353-3-청구항 6 제1항에 있어서,상기 방열 구조는,상기 제1공간으로부터 상기 제2공간의 적어도 일부까지 연장되고, 제1가이드 슬릿을 포함하는 제1가이드 레일;및상기 제1가이드 슬릿을 따라 이동하는 복수의 방열 플레이트들을 포함하고,상기 복수의 방열 플레이트들은 상기 제2하우징의 인출 동작에 따라 확장되는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 복수의 방열 플레이트들 각각은, 제1방열 플레이트의 제1힌지암과, 상기 제1방열 플레이트와 이웃하는 제2방열 플레이트의 제1힌지암이 회전 가능하게 결합되고,상기 제2방열 플레이트의 제2힌지암이, 상기 제2방열 플레이트와 이웃하는 제3방열 플레이트의 제2힌지암과 회전 가능하게 결합되고,상기 제3방열 플레이트의 제1힌지암이, 상기 제3방열 플레이트와 이웃하는 제4방열 플레이트의 제1힌지암과 회전 가능하게 결합되는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 복수의 방열 플레이트들 각각은, 상기 제1힌지암 및 상기 제2힌지암을 관통하는 방식으로 결합되는 힌지샤프트를 통해 서로에 대하여 회전 가능하게 결합되는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 방열 플레이트의 제1힌지암들이 결합된 부분에서, 상기 힌지 샤프트의 양단부에 각각 회전 가능하게 배치되는 제1복수의 가이드 롤러들을 포함하고,상기 제1복수의 가이드 롤러들은 상기 제1가이드 슬릿을 따라 이동 가능하게 배치되는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 제1복수의 가이드 롤러들 각각은, 상기 복수의 방열 플레이트가 확장되는 방향으로, 점진적으로 직경이 작아지는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 제1가이드 슬릿은, 상기 복수의 방열 플레이트들이 확장되는 방향을 따라 가이드 폭이 작아지도록 단차부공개특허 10-2022-0041353-4-가 형성되고,상기 제1복수의 가이드 롤러들은, 상기 단차부를 통해 순차적으로 단속됨으로써, 상기 방열 플레이트가 순차적으로 확장되는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 제1가이드 레일과 지정된 간격으로 평행하게 이격되고 제2가이드 슬릿을 포함하는 제2가이드 레일; 및상기 방열 플레이트의 제2힌지암들이 결합된 부분에서, 상기 힌지 샤프트의 양단부에 각각 회전 가능하게 배치되는 제2복수의 가이드 롤러들을 포함하고,상기 제2복수의 가이드 롤러들은 상기 제2가이드 레일의 상기 제2가이드 슬릿을 따라 이동 가능하게 배치되는전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 복수의 방열 플레이트 각각은 확장 및 축소에 따른 길이 변화를 보상하기 위한 길이 보상 구조를 포함하는전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 복수의 방열 플레이트들 각각은 제1서브 플레이트 및 제2서브 플레이트를 포함하고,상기 길이 보상 구조는 상기 제1서브 플레이트와 상기 제2서브 플레이트를 유동 가능하게 단속하는 플레이트 하우징을 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 플레이트 하우징에 배치되고, 상기 제1서브 플레이트와 상기 제2서브 플레이트를 외측으로 가압하는 탄성부재를 더 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,상기 방열 구조는 지그재그 형상으로 탄성을 가지고 접히는 방식으로 형성된 판 스프링을 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제1항에 있어서,상기 방열 구조는 적어도 하나의 슬릿을 통해 외측으로 탄성을 가지고 돌출되는 적어도 하나의 플레이트를 포함하는 적어도 하나의 방열 플레이트를 포함하는 전자 장치.공개특허 10-2022-0041353-5-청구항 18 전자 장치에 있어서,하우징;상기 하우징의 내부 공간에서 지정된 왕복 거리로 이동 가능하게 배치되는 슬라이드 구조물;상기 하우징의 내부 공간에 배치되고, 상기 슬라이드 구조물의 슬라이딩 동작과 연동하여, 방열 면적이 가변되는 방열 구조를 포함하는 방열 구조(heat dissipation structure); 및상기 내부 공간에 배치되고, 상기 방열 구조의 적어도 일부에 열적으로 연결되는(thermally connected) 적어도하나의 발열 소자를 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 방열 구조는,상기 내부 공간에서, 상기 슬라이드 구조물의 슬라이딩 방향과 평행한 방향으로 길이를 갖도록 배치되는 가이드레일; 및상기 제1가이드 슬릿을 따라 지정된 간격으로 확장되는 복수의 방열 플레이트들을 포함하는 전자 장치."}
{"patent_id": "10-2020-0124445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 내부 공간에 배치되는 방열 구조에 있어서,상기 내부 공간에 배치되는 가이드 레일; 및상기 가이드 레일을 따라 지정된 간격으로 확장가능하게 배치되는 복수의 방열 플레이트들을 포함하고, 상기 복수의 방열 플레이트들 중 적어도 일부는 상기 내부 공간에 배치된 적어도 하나의 발열 소자와 열적으로연결되는 방열 구조."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는, 제1공간을 포함하는 제1하우징과, 상기 제1하우징으로부터 지정된 왕복 거리로 슬라이딩 가능하게 배치되고, 상기 제1공간과 연결된 제2공간을 포함하는 제2하우징과, 일단은 상기 제1 공간에 고정되고, 타단은 상기 제2공간에 고정되며, 상기 제2하우징의 슬라이딩 동작에 따라 방열 면적이 가변되 는 방열 구조(heat dissipation structure) 및 상기 제1공간 및/또는 상기 제2공간에 배치되고, 상기 방열 구조 의 적어도 일부에 열적으로 연결되는(thermally connected) 적어도 하나의 발열 소자를 포함할 수 있다. 그 밖에 다양한 실시예들이 가능할 수 있다."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 방열 구조를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 점차 슬림화되어가고 있으며, 강성을 증가시키고, 디자인적 측면을 강화시킴과 동시에 그 기능적 요소를 차별화시키기 위하여 개선되고 있다. 전자 장치는 획일적인 장방형 형상에서 벗어나, 점차 다양한 형상 으로 변모되어 가고 있다. 전자 장치는 휴대가 편리하면서, 대화면 디스플레이를 이용할 수 있는 변형 가능한 구조를 가질 수 있다. 예컨대, 변형 가능한 구조의 일환으로, 전자 장치는 슬라이딩 방식으로 동작하는 하우징 결합 구조 및 이에 지지를 받는 플렉서블 디스플레이를 통해 디스플레이 면적이 확장되는 구조(예: 롤러블 구조)를 가질 수 있다. 이러한 전자 장치는 내부 공간에 배치되는 전자 부품들(electronic components)의 효율 적인 배치가 요구될 수 있다."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전자 장치는, 사용될 경우에, 디스플레이 면적이 확장될 수 있는 변형 가능한 슬라이더블 전자 장치(slidable electronic device)(예: 롤러블 전자 장치(rollable electronic device))를 포함할 수 있다. 슬라이더블 전자 장치는 적어도 부분적으로 끼워 맞춰지는(fitted together) 방식으로 서로에 대하여 유동 가능하게 결합될 수 있는 제1하우징(예: 베이스 하우징)과 제2하우징(예: 슬라이드 하우징)을 포함할 수 있다. 예컨대, 제1하우징의 적어도 일부로부터 제2하우징이 지정된 방향 및 지정된 왕복 거리로 인입되거나(slide-in), 인출됨(slide- out)으로써, 플렉서블 디스플레이(flexible display 또는 expandable display)의 디스플레이 면적을 가변시킬 수 있다. 예컨대, 제2하우징은 사용자에 의해 수동으로 개폐되거나, 내부 구동 메카니즘을 통해 자동으로 인입 상태(slide-in state) 또는 인출 상태(slide-out state)로 천이됨으로서, 디스플레이 면적이 가변되도록 유도할 수 있다. 슬라이더블 전자 장치는 복수의 전자 부품들 및/또는 전기 소자들을 포함할 수 있다. 이러한 전자 부품들 및/또 는 전기 소자들은 제1하우징 및/또는 제2하우징의 내부 공간에 배치될 수 있으며, 발열이 심한 부품들은 주변에 배치되는 방열 구조물을 통해 열을 확산시키거나 외부로 방출시키도록 배치될 수 있다. 슬라이더블 전자 장치의 경우, 슬라이딩 동작에 따라 내부 공간이 가변될 수 있으며, 방열 구조(물)는 슬라이딩 동작에 따라 전자 장치의 내부 공간의 가변되는 체적에 능동적으로 대처하지 못함으로써, 방열 효율이 저하될 수 있다. 본 발명의 다양한 실시예들은 방열 구조를 포함하는 전자 장치를 제공할 수 있다. 다양한 실시예에 따르면, 슬라이딩 동작에 따라 가변됨으로써 최적의 방열 효율을 갖는 방열 구조를 포함하는 전자 장치를 제공할 수 있다."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따르면, 전자 장치는, 제1공간을 포함하는 제1하우징과, 상기 제1하우징으로부터 지정된 왕복 거리로 슬라이딩 가능하게 배치되고, 상기 제1공간과 연결된 제2공간을 포함하는 제2하우징과, 일단은 상기 제1 공간에 고정되고, 타단은 상기 제2공간에 고정되며, 상기 제2하우징의 슬라이딩 동작에 따라 방열 면적이 가변 되는 방열 구조(heat dissipation structure) 및 상기 제1공간 및/또는 상기 제2공간에 배치되고, 상기 방열 구 조의 적어도 일부에 열적으로 연결되는(thermally connected) 적어도 하나의 발열 소자를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는 하우징과, 상기 하우징의 내부 공간에서 지정된 왕복 거리로 이동 가능하 게 배치되는 슬라이드 구조물과, 상기 하우징의 내부 공간에 배치되고, 상기 슬라이드 구조물의 슬라이딩 동작 과 연동하여, 방열 면적이 가변되는 방열 구조를 포함하는 방열 구조(heat dissipation structure) 및 상기 내 부 공간에 배치되고, 상기 방열 구조의 적어도 일부에 열적으로 연결되는(thermally connected) 적어도 하나의 발열 소자를 포함할 수 있다. 다양한 실시예에 따르면, 상기 방열 구조는, 상기 내부 공간에서, 상기 슬라이드 구조물의 슬라이딩 방향과 평 행한 방향으로 길이를 갖도록 배치되는 가이드 레일 및 상기 제1가이드 슬릿을 따라 지정된 간격으로 확장되는 복수의 방열 플레이트들을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치의 내부 공간에 배치되는 방열 구조는 상기 내부 공간에 배치되는 가이드 레 일 및 상기 가이드 레일을 따라 지정된 간격으로 확장가능하게 배치되는 복수의 방열 플레이트들을 포함하고, 상기 복수의 방열 플레이트들 중 적어도 일부는 상기 내부 공간에 배치된 적어도 하나의 발열 소자와 열적으로 연결될 수 있다."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 예시적인 실시예들에 따른 방열 구조는 전자 장치의 슬라이딩 동작에 따라 가변되는 내부 공간의 체 적에 따라 방열 면적이 변경됨으로써, 슬라이딩 동작에 따른 효율적인 방열 동작이 수행되어 전자 장치의 신뢰 성 향상에 도움을 줄 수 있다.이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2020-0124445", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하 여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스 , 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈 , 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치 에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모 듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2a 및 도 2b는 본 발명의 다양한 실시예에 따른 인입 상태(slide-in state) 및 인출 상태(slide-out stat e)를 나타낸 전자 장치의 전면 사시도이다. 도 3a 및 도 3b는 본 발명의 다양한 실시예에 따른 인입 상태 및 인 출 상태를 나타낸 전자 장치의 후면 사시도이다. 도 2a 내지 도 3b를 참고하면, 전자 장치는 제1하우징(예: 베이스 하우징), 제1하우징으로부터 지정된 방향(예: X 축 방향) 및 지정된 왕복 거리로 이동 가능하게 결합되는 제2하우징(예: 슬라이드 구조 물) 및 제1하우징과 제2하우징의 적어도 일부의 지지를 받는 플렉서블 디스플레이(flexible diaplay)(예: expandable display)를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는, 인출 상태 (slide-out state)에서 제1하우징의 적어도 일부와 실질적으로 동일한 평면을 형성하고, 인입 상태(slide- in state)에서 제2하우징의 내부 공간(예: 도 4a의 제2공간으로 수용되는 밴딩 가능 부재(bendable member 또는 bendable support member)(예: 도 4a의 밴딩 가능 부재)(예: 힌지 레일 또는 다관절 힌지 모 듈)를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 적어도 일부는 인입 상태에서, 밴딩 가능 부재(예: 도 4a의 밴딩 가능 부재)의 지지를 받으면서 제2하우징의 내부 공간으로 수용됨으로써 외부로부터 보이지 않게 배치될 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는 인출 상태에서, 제1 하우징과 실질적으로 동일한 평면을 형성하는 밴딩 가능 부재(예: 도 4a의 밴딩 가능 부재)의 지지를 받으면서, 외부로부터 보일 수 있게 배치될 수 있다.다양한 실시예에 따르면, 전자 장치는 전면(200a)(예: 제1면), 전면(200a)과 반대 방향을 향하는 후면 (200b)(예: 제2면) 및 전면(200a)과 후면(200b) 사이의 공간을 둘러싸는 측면(미도시 됨)을 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제1측면 부재를 포함하는 제1하우징 및 제2측면 부재를 포 함하는 제2하우징을 포함할 수 있다. 한 실시예에 따르면, 제1측면 부재는 제1방향(① 방향)을 따라 제1길이를 갖는 제1측면, 제1측면으로부터 실질적으로 수직한 방향을 따라 제1길이보다 긴 제2길이 를 갖도록 연장된 제2측면 및 제2측면으로부터 제1측면과 실질적으로 평행하게 연장되고 제1 길이를 갖는 제3측면을 포함할 수 있다. 한 실시예에 따르면, 제2측면 부재는 제1측면과 대면 하고, 실질적으로 평행하게 연장되고 제3길이를 갖는 제4측면, 제4측면으로부터 제2측면과 실질적으로 평행한 방향으로 연장되고, 제3길이보다 긴 제4길이를 갖는 제5측면 및 제5측면으로부 터 제3측면과 대면하고, 실질적으로 평행하게 연장되고 제3길이를 갖는 제6측면을 포함할 수 있다. 한 실시예에 따르면, 제1측면과 제4측면 및 제3측면과 제6측면은 서로에 대하여 슬라 이딩 가능하게 결합될 수 있다. 한 실시예에 따르면, 전면(200a) 및 후면(200b)은 전자 장치의 인입 상태 및 인출 상태에 따라 면적이 가변될 수 있다. 한 실시예에 따르면, 측면은 제1하우징의 제1측면 부재 및 제2하우징의 제2측면 부재의 결합 구조를 통해 형성될 수 있다. 다양한 실시예에 따르면, 전자 장치는 후면(200b) 중 제1하우징의 적어도 일부에 배치되는 제1후면 커버 및 제2하우징의 적어도 일부에 배치되는 제2후면 커버를 포함할 수 있다. 한 실시예에 따 르면, 제1후면 커버는 제1측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따르면, 제2후면 커버 는 제2측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따르면, 제1후면 커버 및/또는 제2후 면 커버는 폴리머, 코팅 또는 착색된 유리, 세라믹, 금속(예: 알루미늄, 스테인레스 스틸(STS), 또는 마그 네슘), 또는 상기 소재들 중 적어도 둘의 조합에 의하여 형성될 수 있다. 어떤 실시예에서, 제1후면 커버 및/또는 제2후면 커버는 각 측면 부재들(212, 222)의 적어도 일부까지 연장될 수도 있다. 다양한 실시예에 따르면, 전자 장치는 제1하우징 및 제2하우징의 적어도 일부의 지지를 받도록 배치되는 플렉서블 디스플레이를 포함할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이는 제1하 우징의 지지를 받는 제1영역(230a)(예: 평면부) 및 제1영역(230a)으로부터 연장되고, 제2하우징에 배 치된 밴딩 가능 부재(예: 도 4a의 밴딩 가능 부재)의 지지를 받는 제2영역(230b)(예: 굴곡 가능부)을 포함 할 수 있다. 한 실시예에 따르면, 플렉서블 디스플레이의 제2영역(230b)은, 전자 장치의 인입 상태에 서, 제2하우징의 내부 공간(예: 도 4a 또는 도 4b의 제2 공간)으로 적어도 일부 인입되고, 외부로 노출되지 않도록 배치될 수 있으며, 전자 장치의 인출 상태에서, 밴딩 가능 부재(예: 도 4a 또는 도 4b의 밴딩 가능 부재)의 지지를 받으면서 제1영역(230a)으로부터 연장되고, 실질적으로 동일한 평면을 형성하도 록 외부로 노출될 수 있다. 예를 들면, 전자 장치는 제1하우징으로부터 제2하우징의 이동에 따 라 플렉서블 디스플레이의 디스플레이 면적이 가변될 수 있다. 다양한 실시예에 따르면, 제2하우징은 제1하우징으로부터 적어도 부분적으로 인입되거나 인출되도록 슬라이딩 방식으로 결합될 수 있다. 예컨대, 전자 장치는, 인입 상태에서, 제2측면으로부터 제5측면 까지의 제1폭(W1)를 갖도록 구성될 수 있다. 한 실시예에 따르면, 전자 장치는, 인출 상태에서, 제2 하우징의 내부 공간에 인입된 밴딩 가능 부재(예: 도 4a의 밴딩 가능 부재)가, 제2폭(W2)을 갖도록 지정된 제1방향(① 방향)(예: X 축 방향)으로 이동됨으로써, 제1폭(W1)보다 큰 제3폭(W3)을 갖도록 작동될 수 있다. 예를 들면, 플렉서블 디스플레이는 인입 상태에서, 실질적으로 제1폭(W1)의 디스플레이 면적을 가질 수 있으며, 인출 상태에서, 실질적으로 제3폭(W3)의, 확장된 디스플레이 면적을 가질 수 있다. 다양한 실시예에 따르면, 제2하우징은 사용자의 조작을 통해 동작될 수 있다. 예컨대, 전자 장치는 플렉서블 디스플레이의 외면을 지정된 방향으로 가압하는 사용자의 조작을 통해, 인입 상태 또는 인출 상 태로 천이될 수 있다. 어떤 실시예에서, 전자 장치는 외부로 노출된 로커(locker)(미도시 됨)의 버튼(미도 시 됨) 조작을 통해, 제2하우징이 지정된 방향(예: ① 방향)으로 자동으로 인출될 수도 있다. 어떤 실시예 에서, 제2하우징은 제1하우징의 내부 공간에 배치되는 구동 메커니즘(미도시 됨)(예: 구동 모터, 감 속 모듈 및/또는 기어 조립체)을 통해 자동으로 동작될 수도 있다. 한 실시예에 따르면, 전자 장치는 프로 세서(예: 도 1의 프로세서)를 통해, 전자 장치의 인입/인출 상태의 천이를 위한 이벤트를 검출하면, 구동 메카니즘을 통해 제2하우징의 동작을 제어하도록 설정될 수 있다. 어떤 실시예에서, 전자 장치 의 프로세서(예: 도 1의 프로세서)는 인입 상태, 인출 상태 또는 중간 상태에 따라, 플렉서블 디스플레이 의 변화된 표시 면적에 대응하여, 다양한 방식으로 객체를 표시하고, 응용 프로그램을 실행하도록 플렉서 블 디스플레이를 제어할 수도 있다.다양한 실시예에 따르면, 전자 장치는, 입력 장치(미도시 됨), 음향 출력 장치(예: 도 1의 음향 출력 모듈), 센서 모듈(204, 217)(예: 도 1의 센서 모듈), 카메라 모듈(205, 216)(예: 도 1의 카메라 모 듈), 커넥터 포트(미도시 됨), 키 입력 장치(미도시 됨), 또는 인디케이터(미도시 됨) 중 적어도 하나를 포함할 수 있다. 다른 실시예로, 전자 장치는, 상술한 구성 요소들 중 적어도 하나가 생략하거나, 다른 구 성 요소들이 추가적으로 포함되도록 구성될 수도 있다. 다양한 실시예에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 어떤 실시예에서는, 입력 장치는 소리의 방향 을 감지할 수 있도록 배치되는 복수의 마이크들을 포함할 수도 있다. 음향 출력 장치는 스피커를 포함할 수 있다. 음향 출력 장치는, 통화용 리시버를 포함할 수 있다. 어떤 실시예에서, 음향 출력 장치 는 외부 스피커를 포함할 수도 있다. 어떤 실시예에서, 음향 출력 장치는 별도의 스피커 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피커)를 포함할 수도 있다. 다양한 실시예에 따르면, 센서 모듈(204, 217)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태 에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 센서 모듈(204, 217)은, 예를 들어, 전자 장치 의 전면(200a)에 배치된 제1센서 모듈(예: 근접 센서 또는 조도 센서) 및/또는 후면(200b)에 배치된 제2센 서 모듈(예: HRM(heart rate monitoring) 센서)를 포함할 수 있다. 한 실시예에 따르면, 제1센서 모듈 은 전자 장치의 전면(200a)에서, 플렉서블 디스플레이 아래에 배치될 수 있다. 한 실시예에 따 르면, 제1센서 모듈 및/또는 제2센서 모듈은 근접 센서, 조도 센서, TOF(time of flight) 센서, 초 음파 센서, 지문 인식 센서, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서 또는 습도 센서 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 카메라 모듈(205, 216)은, 전자 장치의 전면(200a)에 배치된 제1카메라 모듈 및 후면(200b)에 배치된 제2카메라 모듈을 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2카메라 모듈 근처에 위치되는 플래시를 포함할 수 있다. 한 실시예에 따르면, 카메라 모듈들(205, 216)은, 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 한 실시예 에 따르면, 제1카메라 모듈은 플렉서블 디스플레이 아래에 배치되고, 플렉서블 디스플레이의 활 성화 영역 중 일부를 통해 피사체를 촬영하도록 구성될 수도 있다. 한 실시예에 따르면, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 다양한 실시예에 따르면, 카메라 모듈들(205, 216) 중 일부 카메라 모듈, 센서 모듈(204, 217)들 중 일부 센서 모듈은 플렉서블 디스플레이를 통해 외부 환경을 검출하도록 배치될 수 있다. 예컨대, 일부 카 메라 모듈 또는 일부 센서 모듈은 전자 장치의 내부 공간에서, 플렉서블 디스플레이에 천 공된 오프닝 또는 투과 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 한 실시예에 따르면, 플렉서 블 디스플레이의 일부 카메라 모듈과 대면하는 영역은 컨텐츠를 표시하는 영역의 일부로서 지정된 투 과율을 갖는 투과 영역으로 형성될 수도 있다. 한 실시예에 따르면, 투과 영역은 약 5% 내지 약 20% 범위의 투 과율을 갖도록 형성될 수 있다. 이러한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위한 광이 통과하 는, 일부 카메라 모듈의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 플렉서 블 디스플레이의 투과 영역은 주변보다 픽셀의 밀도 및/또는 배선 밀도가 낮은 영역을 포함할 수 있다. 예 를 들어, 투과 영역은 상술한 오프닝을 대체할 수 있다. 예를 들어, 일부 카메라 모듈은 언더 디스플레이 카메라(UDC, under display camera)를 포함할 수 있다. 다른 실시예로, 일부 센서 모듈은 전자 장치(20 0)의 내부 공간에서 플렉서블 디스플레이를 통해 시각적으로 노출되지 않고 그 기능을 수행하도록 배치될 수도 있다. 본 발명의 예시적인 실시예들에 따른 전자 장치는 제1하우징 및 제2하우징에 의해 형성되는 내 부 공간(예: 도 4a의 제1공간 및 제2공간)에 배치되는 방열 구조(예: 도 4a 또는 4b의 방열 구조 )를 포함할 수 있다. 한 실시예에 따르면, 방열 구조(예: 도 4a 또는 4b의 방열 구조)는 전자 장치 가 인출 상태일 때, 확장된 내부 공간에 대응하도록 방열 면적이 확장되는 가변 구조를 가짐으로써 효율적 인 방열 동작에 도움을 줄 수 있다. 도 4a는 본 발명의 다양한 실시예에 따른 도 2a의 라인 4a-4a를 따라 바라본 전자 장치의 단면도이다. 도 4b는 본 발명의 다양한 실시예에 따른 도 2b의 라인 4b-4b를 따라 바라본 전자 장치의 단면도이다. 도 4a 및 도 4b를 참고하면, 전자 장치는 제1공간을 포함하는 제1하우징, 제2공간을 포 함하고, 제1하우징으로부터 지정된 제1방향(① 방향)으로 슬라이딩 가능하게 배치되는 제2하우징 및 제1하우징과 제2하우징의 적어도 일부의 지지를 받도록 배치되는 플렉서블 디스플레이를 포함할 수 있다. 한 실시예에 따르면, 제2하우징은 제2공간에서 회전 가능하게 배치되는 지지 롤러 및 지지 롤러의 지지를 받으면서 동작하는 밴딩 가능 부재(예: 멀티바 조립체)를 포함할 수 있다. 한 실 시예에 따르면, 벤딩 가능 부재는 지지 롤러의 회전 축(미도시)과 실질적으로 동일한 방향(예: +Y/-Y 축 방향)으로 연장된 바(bar)가 복수 개 배열된 형태를 포함할 수 있다. 예를 들면, 벤딩 가능 부재는 복 수의 바들 사이의 상대적으로 얇은 두께를 가지는 부분들에서 휘어질 수 있다. 한 실시예에 따르면, 밴딩 가능 부재는 제1하우징 및/또는 제2하우징의 적어도 일부와 연결되도록 배치되고, 제2하우징의 슬라이딩 동작에 따라 지지 롤러의 지지를 받으면서 제2공간으로 인입될 수 있다. 예컨대, 밴딩 가 능 부재는, 인출 상태일 경우, 제1하우징의 적어도 일부와 실질적으로 동일한 평면을 형성하도록 외 부로 인출됨으로써, 플렉서블 디스플레이의 확장된 영역(예: 도 2b의 제2영역(230b))을 지지할 수 있다. 한 실시예에 따르면, 밴딩 가능 부재의 적어도 일부는, 인입 상태일 경우, 플렉서블 디스플레이가 외 부로부터 보이지 않게 제2하우징의 제2공간으로 수용되도록 지지할 수 있다. 어떤 실시예에서, 밴딩 가능 부재는 제1하우징에 배치될 수 있으며, 이러한 경우, 플렉서블 디스플레이의 적어도 일부 는, 인입 상태에서, 제1하우징의 제1공간으로 수용될 수도 있다. 한 실시예에 따르면, 제1하우징 의 제1공간은 제2하우징의 제2공간과 연결될 수 있다. 따라서, 전자 장치는 인입 상태일 때, 제1공간과 제2공간을 포함하는 제1체적의 내부 공간을 가질 수 있으며, 인출 상태일 때, 제1공간과 제2공간을 포함하고, 제1체적보다 큰 제2체적의 내부 공간을 가질 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1공간에 배치되는 기판 및 기판에 배치되는 적어 도 하나의 발열 소자를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 발열 소자와 열적으 로 연결되고(thermally connected), 인입/인출 동작에 따라 방열 면적이 가변되도록 배치되는 방열 구조 (물)을 포함할 수 있다. 예컨대, 방열 구조는, 인출 상태에서, 확장된 제1공간 및 제2공간 의 적어도 일부를 통해 제2하우징을 따라 적어도 부분적으로 확장됨으로써, 발열 소자로부터 발생되는 열을 효율적으로 확산시키도록 구성될 수 있다. 예를 들면, 방열 구조의 일단은 제1하우징 의 지정된 위치에 고정될 수 있으며, 타단은 제2하우징의 지정된 위치에 고정될 수 있다. 이러한 지정된 위치는 전자 장치의 설계에 따라 제1하우징의 제1공간 및 제2하우징의 제2공간에서 적절히 결정될 수 있다. 한 실시예에 따르면, 제1하우징의 제1공간에 배치된 발열 소자는 그 상부에 접촉되는 접촉 플레이트를 포함할 수 있으며, 방열 구조의 일단은 접촉 플레이트에 고정 될 수 있다. 한 실시예에 따르면, 접촉 플레이트는 발열 소자로부터 발생된 열을 빠르게 방열 구조 로 전달하기 위한 열 전달 소재(예: 금속)로 형성될 수 있다. 어떤 실시예에서, 전자 장치는 방열 구 조 근처에 배치되는 방열 팬을 포함함으로써, 발열 소자로부터 접촉 플레이트을 통해 방열 구조로 전달된 열을 빠르게 식히는데 도움을 줄 수 있다. 예를 들면, 방열 팬은, 제1하우징의 제1공간의 적어도 일부 및/또는 제2하우징의 제2공간의 적어도 일부에 대류 현상을 발생시켜, 방열 구조로 전달된 열을 식히는데 도움을 줄 수 있다. 예를 들면, 방열 팬은, 마이크로 펌프(micro pump), 또는 피에조 펌프(piezo pump)를 포함할 수 있다. 도 5a는 본 발명의 다양한 실시예에 따른 방열 구조의 분리 사시도이다. 도 5b는 본 발명의 다양한 실시예에 따 른 방열 구조의 결합 사시도이다. 도 5a를 참고하면, 방열 구조는 지정된 면적을 갖는 복수의 방열 플레이트들과, 복수의 방열 플레이 트들 각각을 서로에 대하여 회동 가능하게 결합하는 힌지 샤프트 및 힌지 샤프트의 양단에 회전 가능하게 고정되고, 제1하우징(예: 도 4b의 제1하우징)의 제1공간(예: 도 4b의 제1공간으로부터 제2 하우징(예: 도 4b의 제2하우징)의 제2공간(예: 도 4b의 제2공간)으로 연장된 제1가이드 레일(예: 도 6의 제1가이드 레일)을 따라 이동되는 복수의 제1 가이드 롤러들을 포함할 수 있다. 한 실시예에 따 르면, 복수의 방열 플레이트들 각각은 열 전달에 유리한 금속 소재로 형성될 수 있다. 한 실시예에 따르면, 복수의 방열 플레이트들 각각은 플레이트부(3111, 3121), 플레이트부(3111, 3121)의 일단에 배치 되는 제1힌지암(3112, 3122) 및 플레이트부(3111, 3121)의 타단에 배치되는 제2힌지암(3113, 3123)을 포함할 수 있다. 한 실시예에 따르면, 제1힌지암(3112, 3122)과 제2힌지암(3113, 3123)은 복수 개로 형성될 수 있으며, 플레이트부(3111, 3121)와 일체로 형성될 수 있다. 한 실시예에 따르면, 복수의 방열 플레이트들 중, 제1 방열 플레이트의 제1힌지암과, 제1방열 플레이트와 이웃하는 제2방열 플레이트의 제1힌지암은 서로에 대하여 끼워맞춰지는 방식으로 배치될 수 있으며, 제1방열 플레이트와 제2방열 플레이 트는 제1힌지암들(3112, 3122)을 관통하는 힌지 샤프트를 통해 서로에 대하여 회동 가능하게 결합될 수 있다. 도 5b를 참고하면, 복수의 방열 플레이트들 각각은 제1방열 플레이트의 플레이트부에 배치된 제1힌지암이, 제1방열 플레이트와 이웃하는 제2방열 플레이트의 플레이트부에 배치된 제 1힌지암과 힌지 샤프트(예: 도 5a의 힌지 샤프트)를 통해 회전 가능하게 결합될 수 있다. 한 실시예 에 따르면, 힌지 샤프트(예: 도 5a의 힌지 샤프트)의 양단에는 제1가이드 롤러가 회전 가능하게 결합 될 수 있다. 한 실시예에 따르면, 제2방열 플레이트의 제2힌지암은 제2방열 플레이트와 이웃하 는 제3방열 플레이트의 플레이트부에 배치된 제2힌지암과 회전 가능하게 결합될 수 있다. 한 실시예에 따르면, 제3방열 플레이트의 제1힌지암은 제3방열 플레이트와 이웃하는 제4방열 플레 이트의 플레이트부에 배치된 제1힌지암과 힌지 샤프트(예: 도 5a의 힌지 샤프트)를 통해 회전 가능하게 결합될 수 있다. 한 실시예에 따르면, 힌지 샤프트(예: 도 5a의 힌지 샤프트)의 양단에는 제2가이드 롤러가 회전 가능하게 결합될 수 있다. 한 실시예에 따르면, 제4방열 플레이트의 제2힌지 암은 이웃하는 제5방열 플레이트(미도시 됨)의 제2힌지암과 회전 가능하게 결합될 수 있다. 예컨대, 복수 의 방열 플레이트들은 제1힌지암들과의 결합(3112와 3122의 결합 및 3132와 3142의 결합)과 제2힌지암들과 의 결합(3123과 3133의 결합)이 교번하여 이루어지는 결합 구조를 가질 수 있다. 한 실시예에 따르면, 복수의 방열 플레이트들 중 일단의 방열 플레이트를 제1방향으로 당길 경우, 복수의 방열 플레이트들(311, 312, 313, 314) 각각은 도시된 바와 같이, 이웃하는 방열 플레이트와 지정된 각도를 가지며 펼쳐지는 방식 으로 동작될 수 있다. 예를 들면, 복수의 방열 플레이트들 중 일단에 배치된 방열 플레이트가 제1하 우징(예: 4b의 제1하우징)의 제1공간(예: 도 4b의 제1공간)에 배치된 접촉 플레이트(예: 도 4b의 접 촉 플레이트)에 고정되고, 복수의 방열 플레이트들 중 타단에 배치된 방열 플레이트가 제2하우 징(예: 도 4b의 제2하우징)의 제2공간(예: 도 4b의 제2공간)에 고정될 수 있다. 이러한 경우, 방열 구조는 제2하우징(예: 도 4b의 제2하우징)이 제1하우징(예: 도 4b의 제1하우징)으로부터 인출되 면, 복수의 방열 플레이트들(311, 312, 313, 314) 각각이 서로에 대하여 지정된 각도를 가지고 펼쳐지는 방식으 로 방열 면적이 확장될 수 있다. 도 6은 본 발명의 다양한 실시예에 따른 방열 구조가 전자 장치의 내부 공간에 배치된 상태를 도시한 일부 사시 도이다. 도 7은 본 발명의 다양한 실시예에 따른 방열 구조의 작동 관계를 도시한 작동도이다. 도 6 및 도 7을 참고하면, 복수의 방열 플레이트들은 제1하우징(예: 도 4b의 제1하우징)의 제1공간 (예: 도 4b의 제1공간)으로부터 제2하우징(예: 도 4b의 제2하우징)의 제2공간(예: 도 4b의 제2공간 )으로 연장되도록 배치된 제1가이드 레일을 따라 이동되도록 배치될 수 있다. 한 실시예에 따르면, 방열 구조는 복수의 방열 플레이트들 중 제1힌지암들(예: 도 5b의 제1힌지암들(3112, 3122, 3132, 3142)끼리 결합된 부분에 회전 가능하게 배치된 복수의 제1 가이드 롤러들(318, 319)을 포함할 수 있으며, 제1 가이드 레일에 길이 방향으로 형성된 제1가이드 슬릿을 타고 이동될 수 있다. 한 실시예에 따르면, 복수의 제1 가이드 롤러들(318, 319)은 제1방향(① 방향)(예: 제2하우징이 인출되는 방향)을 따라 상대적 으로 직경이 작아지는 가이드 롤러들을 포함할 수 있다. 다양한 실시예에 따르면, 복수의 방열 플레이트들은 제1방향(① 방향)으로 확장될 때, 순차적으로 펼쳐지 도록 구성될 수 있다. 한 실시예에 따르면, 가이드 레일의 제1가이드 슬릿은 지정된 간격으로 형성되 는 단차부들(3211, 3212)을 통해 복수의 제1 가이드 롤러들(318, 319)을 가이드하기 위한 서로 다른 폭들(g1, g2, g3)을 갖도록 형성될 수 있다. 예컨대, 제1가이드 슬릿의 폭들(g1, g2, g3)은 제1방향(① 방향)으로 진행할수록 단차부들(3211, 3212)을 통해 점진적으로 작아지도록 형성될 수 있다. 따라서, 복수의 제1 가이드 롤러들(318, 319)이 제1가이드 슬릿을 따라 이동될 때, 단차부들(3211, 3212)을 통해 점진적으로 작은 폭 들(g1, g2, g3)을 갖도록 형성된 제1가이드 슬릿에 복수의 제1 가이드 롤러들(318, 319)이 순차적으로 걸 리면서, 복수의 방열 플레이트들은 순차적으로 펼쳐질 수 있다. 예컨대, 복수의 방열 플레이트들이 제1방향(① 방향)으로 이동될 때, 제1방향(① 방향)을 향할수록 직경이 점진적으로 작아지도록 형성된 복수의 제1 가이드 롤러들(318, 319)이, 제1방향(① 방향)을 향할수록 폭들(g1, g2, g3)이 점진적으로 작아지는 제1가 이드 슬릿의 가이드를 받을 수 있다. 예를 들면, 복수의 방열 플레이트들은, 제1방향(① 방향)으로 이동될 때, 제1방열 플레이트로부터 제2방열 플레이트, 제3방열 플레이트, 제4방열 플레이트 , 제5방열 플레이트 및 제6방열 플레이트 순으로 순차적으로 지정된 각도로 펼쳐지도록 가이드될 수 있다. 도 8a는 본 발명의 다양한 실시예에 따른 방열 구조의 배치 관계를 도시한 일부 구성도이다. 도 8b는 본 발명의 다양한 실시예에 따른 도 8a의 8b 영역을 확대한 도면이다. 도 8a 및 도 8b를 참고하면, 방열 구조(300-1)는 복수의 방열 플레이트들 중 제2힌지암들(예: 도 5b의 제2 힌지암들(3113, 3123, 3133, 3143))끼리 결합된 부분에 회전 가능하게 배치된 복수의 제2 가이드 롤러들 및 복수의 제2 가이드 롤러들을 가이드하기 위하여, 제1가이드 레일과 지정된 간격으로 나란히 이격 배치되는 제2가이들 레일을 포함할 수 있다. 한 실시예에 따르면, 복수의 제2 가이드 롤러는 제2가이 드 레일에 형성된 제2가이드 슬릿을 따라 이동될 수 있다. 예컨대, 복수의 제2 가이드 롤러들 및 이를 가이드하는 제2가이드 레일의 결합 구조는 전술한 바와 같은 복수의 제1 가이드 롤러들(318, 319) 및 이를 가이드하는 제1가이드 레일의 결합 구조와 실질적으로 동일할 수 있다. 다양한 실시예에 따르면, 복수의 방열 플레이트들(311, 312, 313, 314, 315, 316)이 제1방향(① 방향)으로 이동 될 때, 복수의 제2 가이드 롤러들은 제1방향(① 방향)과 수직한 제2방향(② 방향)으로 이동될 수 있다. 한 실시예에 따르면, 복수의 제2 가이드 롤러들은 제2가이드 레일의 단속을 받기때문에 제2방향(② 방향)으로 이동되어야 하나, 그렇지 못하다. 따라서, 방열 구조(300-1)는 복수의 제2 가이드 롤러가 제2방 향(② 방향)으로 이동되기 위한 거리를 보상하기 위한 길이 보상 구조를 더 포함할 수 있다. 한 실시예에 따르면, 복수의 방열 플레이트들(311, 312, 313, 314, 315, 316) 각각은 제1서브 플레이트, 및 제2서브 플레이 트를 포함할 수 있다. 예를 들면, 도 8b를 참고하면, 제1방열 플레이트는 제1서브 플레이트(311a) 및 제1 서브 플레이트(311a)와 분할된 제2서브 플레이트(311b)를 포함할 수 있다. 한 실시예에 따르면, 길이 보상 구조 는 제1서브 플레이트(311a)와 제2서브 플레이트(311b)의 일단을 유동 가능하게 수용하기 위한 플레이트 하 우징을 포함할 수 있다. 한 실시예에 따르면, 복수의 방열 플레이트들(311, 312, 313, 314, 315, 316)이 제1방향(① 방향)으로 이동될 때, 제1서브 플레이트(311a)와 제2서브 플레이트(311b)는 플레이트 하우징내 에서 제3방향(③ 방향)으로 이동됨으로써, 복수의 제2 가이드 롤러들은 제1방향(① 방향)과 수직한 제2방 향(② 방향)으로 이동되지 않게 하기 위한 거리가 보상될 수 있다. 한 실시예에 따르면, 길이 보상 구조는 플레이트 하우징의 내부 공간에서, 제1서브 플레이트(311a)와 제2서브 플레이트(311b)를 가압하도록 배치 되는 탄성 부재를 포함할 수 있다. 한 실시예에 따르면, 탄성 부재는 압축 코일 스프링을 포함함으로 써, 복수의 방열 플레이트들(311, 312, 313, 314, 315, 316)이 제1방향(① 방향)으로 펼쳐지려는 힘을 보조할 수 있다. 다른 실시예에 따르면, 탄성 부재는 판 스프링 또는 접이 가능한 시트(sheet)를 포함할 수 있다. 한 실시예에 따르면, 탄성 부재는 열 전달이 용이한 탄성 물질을 포함함으로써, 제1서브 플레이트(311a)와 제2서브 플레이트(311b)간의 열 전달에 도움을 줄 수 있다. 한 실시예에 따르면, 열 전달에 용이한 탄성 물질은 써멀 그리스(thermal grease)를 포함할 수 있다. 어떤 실시예에서, 전자 장치(예: 도 4a 및 도 4b의 전자 장치)는 도 7에 도시된 바와 같이 복수의 방열 플 레이트들이 제1가이드 레일을 통해 확장되는 제1방열 구조와, 도 8a에 도시된 바와 같이, 복수 의 방열 플레이트들이 길이 보상 구조를 가지며, 제1가이드 레일과 제2가이드 레일을 통해 확장되는 제2방열 구조(300-1)를 포함할 수 있다. 한 실시예에 따르면, 제1방열 구조와 제2방열 구조(300- 1)는 전자 장치(예: 도 4a 및 도 4b의 전자 장치)의 내부 공간(예: 도 4a 및 도 4b의 제1공간 및/ 또는 제2공간)에서 분리 배치될 수 있다. 예컨대, 제1방열 구조는 접촉 플레이트(예: 도 4a 및 도 4b의 접촉 플레이트)로부터 제2영역(예: 도 2b의 제2영역(230b))의 제2폭(예: 도 2b의 제2폭(W2))의 1/2 이동 거리만큼의 확장 영역을 갖도록 배치될 수 있으며, 제2방열 구조(300-1)는 제2영역(예: 도 2b의 제2영역 (230b))의 제2폭(예: 도 2b의 제2폭(W2))의 나머지 1/2 이동 거리 만큼의 확장 영역을 갖도록 배치될 수도 있다. 도 9a는 본 발명의 다양한 실시예에 따른 방열 구조가 전자 장치의 내부 공간에 배치된 상태를 도시한 일부 사 시도이다. 도 9b는 본 발명의 다양한 실시예에 따른 도 9a의 방열 구조의 측면도이다. 도 9a 및 도 9b를 참고하면, 전자 장치는 제1하우징(예: 도 4b의 제1하우징)의 제1공간에 배치 되는 기판, 기판에 배치되는 발열 소자, 발열 소자와 접촉되는 접촉 플레이트 및 접 촉 플레이트에 일단이 고정되고, 타단이 제2하우징(예: 도 4b의 제2하우징)의 제2공간의 지정된 위치에 고정되는 방열 구조를 포함할 수 있다. 한 실시예에 따르면, 발열 소자와 접촉 플레이트 사이에는 열 전달 물질(예: TIM(thermal interface material))이 더 개재될 수도 있다. 예를 들면, 열 전달 물질은, 기판 상의 발열 소자로부터 발생되는 열을 흡수하여, 접촉 플레이트 및/또는 방열 구조으로 전달할 수 있다. 한 실시예에 따르면, 열 전달 물질은 Z축 방향(예: 도 4의 Z축 방향)으로 복수개로 형성될 수 있다. 예를 들면, 열 전달 물질은 접촉 플레이트와 접촉되는 제1 열 전달 물질, 및 제1 열 전달 물질과 발열 소자 사이에 배치되는 제2 열 전달 물질을 포함할 수 있다. 예를 들면, 제1 열 전달 물질과 제2 열 전달 물질은 Z축 방향으로 배치/도포될 수 있다. 한 실시예에서, 제2 열 전달 물질은 발열 소자로부터 발생되는 열을 흡수하여, 제1 열 전달 물질로 전달할 수 있고, 제1 열 전달 물질은 제2 열 전달 물질로부터 전달된 열을 접촉 플레이트 및/또는 방열 구조으로 전달할 수 있다. 한 실시예에 따르면, 열 전달 물질은, 공기보다 열 전도율이 좋은 물질을 포함할 수 있으며, 저탄성이나 고탄성의 접착제로 이루어질 수 있다. 예를 들면, 열 전달 물질은, 탄소 섬유 TIM(carbon fiber TIM), 실 리콘 TIM(silicone TIM), 또는 아크릴(acryl) TIM와 같은 고상(solid) TIM 및/또는 젤과 같이 유동성을 가지면 서 고점성을 갖는 액상(liquid) TIM을 포함할 수 있다. 한 실시예에 따르면, 열 전달 물질은, 구리 플레이 트(Cu plate), 써멀 그리스(thermal grease), 열 전도성 필러(filler)를 포함하는 엘라스토머(elastomer), 및 접착 필름 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 방열 구조는 지그재그 방식으로 탄성을 가지고 접히는 방식으로 배치된 판형 스프링 을 포함할 수 있다. 한 실시예에 따르면, 판형 스프링을 포함하는 방열 구조는 제2하우징(예: 도 4b의 제2 하우징)이 제1하우징(예: 도 4a의 제1하우징)으로부터 제1방향(① 방향)으로 인출될 때, 탄성을 보유 하며 확장되도록 배치될 수 있다. 도 10a 및 도 10b는 본 발명의 다양한 실시예에 따른 방열 구조의 확장 전, 후의 상태를 도시한 사시도이다. 도 10c는 본 발명의 다양한 실시예에 따른 방열 구조가 확장된 상태를 나타낸 측면도이다. 도 10a 내지 도 10c를 참고하면, 방열 구조는 지정된 형상을 갖는 적어도 하나의 슬릿이 형성된 방 열 플레이트를 포함할 수 있다. 한 실시예에 따르면, 방열 플레이트는 적어도 하나의 슬릿을 통해 외측으로 탄성을 가지며 돌출되는 제1플레이트, 및 제1플레이트로부터 적어도 하나의 슬릿 을 통해 외측으로 탄성을 가지며 돌출되는 제2플레이트를 포함할 수 있다. 한 실시예에 따르면, 방 열 플레이트의 제1플레이트와 제2플레이트는 적어도 하나의 슬릿을 통해 서로 끊어짐 없 이 연결된 상태를 유지하도록 형성될 수 있다. 한 실시예에 따르면, 방열 플레이트는 기판의 발열 소 자와 열적으로 연결된 접촉 플레이트에 고정되고, 제2플레이트는 제2하우징(예: 도 4b의 제2하 우징)의 제2공간(예: 도 4b의 제2공간)의 적어도 일부에 고정될 수 있다. 다양한 실시예에 따르면, 제2하우징(예: 도 4b의 제2하우징)이 제1하우징(예: 도 4a의 제1하우징)으 로부터 제1방향(① 방향)으로 인출될 때, 방열 플레이트로부터 제1플레이트와 제2플레이트가 돌 출됨으로써, 방열 구조는 연장된 거리(d1)를 갖도록 방열 면적이 확장될 수 있다. 어떤 실시예에서, 방열 구조는 적어도 하나의 슬릿을 통해, 서로 연결되고, 외측으로 탄성을 보유하 며 돌출 가능하게 배치되는 3개 이상의 플레이트들을 포함할 수도 있다. 도 11a 및 도 11b는 본 발명의 다양한 실시예에 따른 방열 구조의 확장 전, 후의 상태를 도시한 사시도이다. 도 11c는 본 발명의 다양한 실시예에 따른 방열 구조가 확장된 상태를 나타낸 측면도이다. 도 11a 내지 도 11c를 참고하면, 방열 구조는 두 개의 방열 플레이트들(531, 532)이 서로 연결된 형태로 배치될 수 있다. 한 실시예에 따르면, 제1방열 플레이트는 제1플레이트, 제1플레이트로부터 적어도 하나의 제1슬릿을 통해 외측으로 탄성을 가지며 순차적으로 돌출되는 제2플레이트, 및 제3 플레이트를 포함할 수 있다. 한 실시예에 따르면, 제2방열 플레이트는 제4플레이트, 및 제4플 레이트로부터 적어도 하나의 제2슬릿을 통해 외측으로 탄성을 가지며 제1방향(① 방향)과 반대 방 향으로 돌출되는 제5플레이트를 포함할 수 있다. 한 실시예에 따르면, 제5플레이트와 제3플레이트 는 일체로 형성됨으로써, 제1플레이트, 제2플레이트, 제3플레이트, 제4플레이트 및 제5플레이트는 서로 연결되는 구조로 형성될 수 있다. 예를 들면, 방열 구조는 제1방열 플레이트의 제1플레이트가 기판의 발열 소자와 열적으로 연결된 접촉 플레이트에 고정되고, 제4플레이트가 제2하우징(예: 도 4b의 제2하우징)의 제2공간(예: 도 4b의 제2공간)의 적어도 일부에 고정될 수 있다. 다양한 실시예에 따르면, 제2하우징(예: 도 4b의 제2하우징)이 제1하우징(예: 도 4a의 제1하우징)으 로부터 제1방향(① 방향)으로 인출될 때, 제1방열 플레이트의 제1플레이트로부터 제2플레이트 , 및 제3플레이트가 순차적으로 돌출되고, 제2방열 플레이트의 제5플레이트가 제4플레 이트로부터 돌출됨으로써, 방열 구조는 연장된 거리(d2)를 갖도록 방열 면적이 확장될 수 있다. 어떤 실시예에서, 방열 구조는 실질적으로 동일한 방식으로 5개 이상의 방열 플레이트들이 연결될 수도 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 4a의 전자 장치)는, 제1공간(예: 도 4a의 제1공간을 포 함하는 제1하우징(예: 도 4a의 제1하우징)과, 상기 제1하우징으로부터 지정된 왕복 거리로 슬라이딩 가능 하게 배치되고, 상기 제1공간과 연결된 제2공간(예: 도 4a의 제2공간)을 포함하는 제2하우징(예: 도 4a의 제2하우징)과, 일단은 상기 제1공간에 고정되고, 타단은 상기 제2공간에 고정되며, 상기 제2하우징의 슬라 이딩 동작에 따라 방열 면적이 가변되는 방열 구조(heat dissipation structure)(예: 도 4a의 방열 구조) 및 상기 제1공간 및/또는 상기 제2공간에 배치되고, 상기 방열 구조의 적어도 일부에 열적으로 연결되는 (thermally connected) 적어도 하나의 발열 소자(예: 도 4a의 발열 소자)를 포함할 수 있다. 다양한 실시예에 따르면, 상기 제1하우징 및 상기 제2하우징의 지지를 받도록 배치되는 플렉서블 디스플레이를 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2하우징의 상기 제2공간에 배치되고, 인입 상태(slide-in state)에서, 상기 제 2하우징의 제2공간으로 수용되고, 인출 상태(slide-out state)에서 상기 제1하우징과 동일한 평면을 갖도록 외 측으로 인출되는 밴딩 가능 부재를 포함하고, 상기 플렉서블 디스플레이는 상기 인입 상태에서, 상기 밴딩 가능 부재의 지지를 통해, 적어도 부분적으로 상기 제2공간으로 수용되고, 상기 인출 상태에서, 상기 밴딩 가능 부재 의 지지를 통해, 외부로부터 보일 수 있게 적어도 부분적으로 노출될 수 있다. 다양한 실시예에 따르면, 상기 제1하우징의 상기 제1공간에 배치되는 기판과, 상기 기판에 배치되는 상기 발열 소자 및 상기 발열 소자와 상기 방열 구조를 열적으로 연결하는 접촉 플레이트를 포함할 수 있다. 다양한 실시예에 따르면, 상기 제2공간에서, 상기 방열 구조 근처에 배치되는 방열 팬을 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 복수의 방열 플레이트들 각각은, 하나의 방열 플레이트의 제2힌지암이 이웃하는 방열 플레이트의 제2힌지암에 서로에 대하여 회전 가능하게 결합될 수 있다. 다양한 실시예에 따르면, 상기 복수의 방열 플레이트들 각각은, 제1방열 플레이트의 제1힌지암과, 상기 제1방열 플레이트와 이웃하는 제2방열 플레이트의 제1힌지암이 회전 가능하게 결합되고, 상기 제2방열 플레이트의 제2힌 지암이, 상기 제2방열 플레이트와 이웃하는 제3방열 플레이트의 제2힌지암과 회전 가능하게 결합되고, 상기 제3 방열 플레이트의 제1힌지암이, 상기 제3방열 플레이트와 이웃하는 제4방열 플레이트의 제1힌지암과 회전 가능하 게 결합될 수 있다. 다양한 실시예에 따르면, 상기 복수의 방열 플레이트들 각각은, 상기 제1힌지암 및 상기 제2힌지암을 관통하는 방식으로 결합되는 힌지 샤프트를 통해 서로에 대하여 회전 가능하게 결합될 수 있다. 다양한 실시예에 따르면, 상기 방열 플레이트의 제1힌지암들이 결합된 부분에서, 상기 힌지 샤프트의 양단부에 각각 회전 가능하게 배치되는 제1복수의 가이드 롤러들을 포함하고, 상기 제1복수의 가이드 롤러들은 상기 제1 가이드 슬릿을 따라 이동 가능하게 배치될 수 있다. 다양한 실시예에 따르면, 상기 제1복수의 가이드 롤러들 각각은, 상기 복수의 방열 플레이트가 확장되는 방향으 로, 점진적으로 직경이 작아질 수 있다. 다양한 실시예에 따르면, 상기 제1가이드 슬릿은, 상기 복수의 방열 플레이트들이 확장되는 방향을 따라 가이드 폭이 작아지도록 단차부가 형성되고, 상기 제1복수의 가이드 롤러들은, 상기 단차부를 통해 순차적으로 단속됨 으로써, 상기 방열 플레이트가 순차적으로 확장될 수 있다.다양한 실시예에 따르면, 상기 제1가이드 레일과 지정된 간격으로 평행하게 이격되고 제2가이드 슬릿을 포함하 는 제2가이드 레일 및 상기 방열 플레이트의 제2힌지암들이 결합된 부분에서, 상기 힌지 샤프트의 양단부에 각 각 회전 가능하게 배치되는 제2복수의 가이드 롤러들을 포함하고, 상기 제2복수의 가이드 롤러들은 상기 제2가 이드 레일의 상기 제2가이드 슬릿을 따라 이동 가능하게 배치될 수 있다. 다양한 실시예에 따르면, 상기 복수의 방열 플레이트 각각은 확장 및 축소에 따른 길이 변화를 보상하기 위한 길이 보상 구조를 포함할 수 있다. 다양한 실시예에 따르면, 상기 복수의 방열 플레이트들 각각은 제1서브 플레이트 및 제2서브 플레이트를 포함하 고, 상기 길이 보상 구조는 상기 제1서브 플레이트와 상기 제2서브 플레이트를 유동 가능하게 단속하는 플레이 트 하우징을 포함할 수 있다. 다양한 실시예에 따르면, 상기 플레이트 하우징에 배치되고, 상기 제1서브 플레이트와 상기 제2서브 플레이트를 외측으로 가압하는 탄성 부재를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 방열 구조는 지그재그 형상으로 탄성을 가지고 접히는 방식으로 형성된 판 스프 링을 포함할 수 있다. 다양한 실시예에 따르면, 상기 방열 구조는 적어도 하나의 슬릿을 통해 외측으로 탄성을 가지고 돌출되는 적어 도 하나의 플레이트를 포함하는 적어도 하나의 방열 플레이트를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는 하우징과, 상기 하우징의 내부 공간에서 지정된 왕복 거리로 이동 가능하 게 배치되는 슬라이드 구조물과, 상기 하우징의 내부 공간에 배치되고, 상기 슬라이드 구조물의 슬라이딩 동작 과 연동하여, 방열 면적이 가변되는 방열 구조를 포함하는 방열 구조(heat dissipation structure) 및 상기 내 부 공간에 배치되고, 상기 방열 구조의 적어도 일부에 열적으로 연결되는(thermally connected) 적어도 하나의 발열 소자를 포함할 수 있다. 다양한 실시예에 따르면, 상기 방열 구조는, 상기 내부 공간에서, 상기 슬라이드 구조물의 슬라이딩 방향과 평 행한 방향으로 길이를 갖도록 배치되는 가이드 레일 및 상기 제1가이드 슬릿을 따라 지정된 간격으로 확장되는 복수의 방열 플레이트들을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치의 내부 공간에 배치되는 방열 구조는 상기 내부 공간에 배치되는 가이드 레 일 및 상기 가이드 레일을 따라 지정된 간격으로 확장가능하게 배치되는 복수의 방열 플레이트들을 포함하고, 상기 복수의 방열 플레이트들 중 적어도 일부는 상기 내부 공간에 배치된 적어도 하나의 발열 소자와 열적으로 연결될 수 있다. 그리고 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 실시예에 따른 기술 내용을 쉽게 설명하고 본 발명의 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 발명의 다양한 실시예의 범위는 여기에 개시된 실시예들 이외에도 본 발명의 다 양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태가 본 발명의 다양한 실시예의 범 위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0124445", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은 본 발명의 다양한 실시예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a 및 도 2b는 본 발명의 다양한 실시예에 따른 전자 장치의 인입 상태(slide-in state) 및 인출 상태 (slide-out state)를 나타낸 도면이다. 도 3a 및 도 3b는 본 발명의 다양한 실시예에 따른 전자 장치의 인입 상태 및 인출 상태를 나타낸 도면이다. 도 4a는 본 발명의 다양한 실시예에 따른 도 2a의 라인 4a-4a를 따라 바라본 전자 장치의 단면도이다. 도 4b는 본 발명의 다양한 실시예에 따른 도 2b의 라인 4b-4b를 따라 바라본 전자 장치의 단면도이다. 도 5a는 본 발명의 다양한 실시예에 따른 방열 구조의 분리 사시도이다. 도 5b는 본 발명의 다양한 실시예에 따른 방열 구조의 결합 사시도이다. 도 6은 본 발명의 다양한 실시예에 따른 방열 구조가 전자 장치의 내부 공간에 배치된 상태를 도시한 일부 사시 도이다. 도 7은 본 발명의 다양한 실시예에 따른 방열 구조의 작동 관계를 도시한 작동도이다. 도 8a는 본 발명의 다양한 실시예에 따른 방열 구조의 배치 관계를 도시한 일부 구성도이다. 도 8b는 본 발명의 다양한 실시예에 따른 도 8a의 8b 영역을 확대한 도면이다. 도 9a는 본 발명의 다양한 실시예에 따른 방열 구조가 전자 장치의 내부 공간에 배치된 상태를 도시한 일부 사 시도이다. 도 9b는 본 발명의 다양한 실시예에 따른 도 9a의 방열 구조의 측면도이다. 도 10a 및 도 10b는 본 발명의 다양한 실시예에 따른 방열 구조의 확장 전, 후의 상태를 도시한 사시도이다. 도 10c는 본 발명의 다양한 실시예에 따른 방열 구조가 확장된 상태를 나타낸 측면도이다. 도 11a 및 도 11b는 본 발명의 다양한 실시예에 따른 방열 구조의 확장 전, 후의 상태를 도시한 사시도이다. 도 11c는 본 발명의 다양한 실시예에 따른 방열 구조가 확장된 상태를 나타낸 측면도이다."}
