{"patent_id": "10-2021-0163310", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0076411", "출원번호": "10-2021-0163310", "발명의 명칭": "매뉴얼 제공 시스템", "출원인": "주식회사 딥파인", "발명자": "김현배"}}
{"patent_id": "10-2021-0163310", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "체감형 디지털 매뉴얼을 제공하는 매뉴얼 제공 시스템에 있어서,사용자가 휴대하며, 사용자의 요청 또는 선택에 따라 사용자의 등록 제품 또는 요구 제품에 대한 매뉴얼이 증강현실 및 혼합현실 중 적어도 하나로 표현되고, 상기 등록 제품을 촬영한 실물영상 및 상기 요구 제품이 표현될장소를 촬영한 장소영상 중 적어도 하나를 하기 정보제공서버에 송신하는 사용자 단말기; 및상기 사용자 단말기로부터 상기 실물영상 및 상기 장소영상 중 적어도 하나를 수신하여 분석하고, 상기 실물영상에 대응하는 증강현실 매뉴얼 프로그램 및 상기 장소영상에 대응하는 혼합현실 매뉴얼 프로그램 중 적어도 하나를 상기 사용자 단말기에 제공하는 정보제공서버;를 포함하는, 매뉴얼 제공 시스템."}
{"patent_id": "10-2021-0163310", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사용자 단말기는,상기 등록 제품을 촬영하여 실물영상을 생성하거나, 상기 보유 제품을 가상객체로 표현할 장소를 촬영하여 장소영상을 생성하는 카메라모듈;상기 정보제공서버로부터 수신한 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 매뉴얼 프로그램 중 적어도하나를 표시하는 디스플레이모듈;사용자의 조작 및/또는 음성을 감지하여 사용자의 명령 및/또는 지시를 입력 처리하는 입력모듈;상기 정보제공서버와 통신하여 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 매뉴얼 프로그램 중 적어도 하나를 수신하는 단말기통신모듈; 및사용자의 명령에 대응하여 기 설정된 기능이 작동되도록 처리하고, 상기 단말기통신모듈을 통해 수신한 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적어도 하나가 상기 디스플레이모듈에 표시되도록 처리하는 단말기제어모듈;을 포함하는 것을 특징으로 하는, 매뉴얼 제공 시스템."}
{"patent_id": "10-2021-0163310", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 단말기제어모듈은,상기 정보제공서버로부터 수신한 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적어도하나가 상기 디스플레이모듈에서 표시되도록 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램중 적어도 하나를 신호처리하여 상기 디스플레이모듈로 제공하는 영상처리부;상기 입력모듈로부터 수신한 사용자의 명령 및/또는 지시를 입력 신호로 신호처리하여 상기 단말기통신모듈을통해 상기 정보제공서버로 송신하는 입력처리부; 및상기 입력모듈을 통해 사용자의 명령 및/또는 지시가 입력되면, 입력된 사용자의 명령 및/또는 지시를 신호처리하도록 상기 입력처리부를 제어하거나, 상기 영상처리부를 통해 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적어도 하나를공개특허 10-2023-0076411-3-신호처리하여 상기 디스플레이모듈로 표시할 때 상기 입력모듈을 통해 프로그램에 대한 실행을 명령하는 사용자의 명령 및/또는 지시가 입력되면 해당 프로그램을 실행하도록 상기 영상처리부를 제어하는 메인제어부;을 포함하는 것을 특징으로 하는, 매뉴얼 제공 시스템."}
{"patent_id": "10-2021-0163310", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 사용자 단말기는,상기 등록 제품에서 표시되는 경고등을 촬영하여 표시된 경고등의 의미를 설명하거나, 표시된 경고등의 출력을해제할 수 있는 방법을 설명하는 경고등 스캐너 기능을 수행하되,경고등을 촬영하여 경고등영상을 생성하고, 상기 경고등영상을 상기 정보제공서버로 송신하며, 상기 정보제공서버로부터 수신한 경고등 스캐너 프로그램을 표시하고, 사용자의 선택에 따라 서비스센터로 통신을 연결하거나,서비스센터를 찾을 수 있도록 지도 정보를 안내하는 것을 특징으로 하는, 매뉴얼 제공 시스템."}
{"patent_id": "10-2021-0163310", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 정보제공서버는,상기 사용자 단말기와 무선 통신하는 서버통신모듈;기 설정된 이미지 인식 모델을 이용하여 상기 사용자 단말기로부터 수신된 상기 실물영상 및 상기 장소영상 중적어도 하나로부터 객체를 분석하고, 분석결과를 하기 프로그램제공모듈 및/또는 하기 서버제어모듈로 제공하는영상분석모듈;상기 사용자 단말기로부터 수신한 입력신호로부터 사용자의 조작 및/또는 발화에 포함된 명령 및/또는 지시를분석하고, 분석결과를 하기 프로그램제공모듈 및/또는 하기 서버제어모듈로 제공하는 입력명령분석모듈;상기 영상분석모듈 및/또는 상기 입력명령분석모듈의 분석결과를 수신하여 기 저장된 증강현실 매뉴얼 프로그램및 혼합현실 매뉴얼 프로그램 중 적어도 하나를 상기 사용자 단말기에 제공하는 프로그램제공모듈; 및상기 영상분석모듈 및/또는 상기 입력명령분석모듈로부터 분석결과를 수신하여 영상정보 및 입력신호 중 적어도하나에 대응하는 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 매뉴얼 프로그램 중 적어도 하나를 매칭하여상기 사용자 단말기에 제공하도록 상기 프로그램제공모듈을 제어하는 서버제어모듈;을 포함하는 것을 특징으로 하는, 매뉴얼 제공 시스템."}
{"patent_id": "10-2021-0163310", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 영상분석모듈은,형체 인식을 위한 이미지 분석 인공지능 프로그램으로 설정되는 상기 이미지 인식 모델을 이용하여 객체를 분석하되,상기 이미지 인식 모델은,상품 인식을 위한 1,2차원 바코드 데이터를 자동으로 생성하는 테스트 이미지 자동생성, 이미지 증식 기법을 포함하여 이미지 해상도 변경에 따른 패딩 자동 처리하는 데이터 아규먼트(data argument), 트레이닝 이미지의 해상도를 변경하였을 때 발생되는 바운딩 박스의 위치변화를 보정하기 위한 알고리즘을 도입하는 해상도 변경, 상품 및 형상 인식을 하기 위해 촬영된 이미지의 업스케일링을 위한 트레이닝 데이터를 자동 분류하는 이미지 복원을 위한 데이터셋 분리 중 적어도 하나를 포함하는 항목을 지원하는 것을 특징으로 하는, 매뉴얼 제공공개특허 10-2023-0076411-4-시스템."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 체감형 디지털 매뉴얼을 매뉴얼 제공 시스템에 관한 것으로, 본 발명의 일 실시예는 체감형 디지털 매 뉴얼을 제공하는 매뉴얼 제공 시스템에 있어서, 사용자가 휴대하며, 사용자의 요청 또는 선택에 따라 사용자의 등록 제품 또는 요구 제품에 대한 매뉴얼이 증강현실 및 혼합현실 중 적어도 하나로 표현되고, 상기 등록 제품을 촬영한 실물영상 및 상기 요구 제품이 표현될 장소를 촬영한 장소영상 중 적어도 하나를 하기 정보제공서버에 송 신하는 사용자 단말기; 및 상기 사용자 단말기로부터 상기 실물영상 및 상기 장소영상 중 적어도 하나를 수신하 여 분석하고, 상기 실물영상에 대응하는 증강현실 매뉴얼 프로그램 및 상기 장소영상에 대응하는 혼합현실 매뉴 얼 프로그램 중 적어도 하나를 상기 사용자 단말기에 제공하는 정보제공서버를 포함하는, 매뉴얼 제공 시스템을 제공한다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 매뉴얼 제공 시스템에 관한 것으로, 더욱 상세하게는 체감형 디지털 매뉴얼을 제공하는 매뉴얼 제공 시스템에 관한 것이다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최신 자동차의 경우 다양하고 편리한 기능을 제공하지만, 기능의 복잡성으로 인하여 유저가 활용을 제대로 못하 고 있다는 단점이 있다. 자동차를 운행하기 위한 기본 기능은 쉽게 파악할 수 있으나, 편의 사양 중심의 부가 기능은 일부 사용자를 제외하고는 용도 자체를 모르는 경우가 많다. 현재 대부분의 설명서는 나열식으로 기술된 형태로 제공된다. 일반적으로 사용자가 기능을 이해하기 위해서는 나열된 설명들을 학습하여야 한다. 이에 따라 현재 일부 시스템에서는 전자 설명서를 제공하고 있으며, 사용 동 영상 등을 추가하여 보다 직관적으로 쉬운 형태를 취하고 있지만 사용자에게 많은 이점은 주지 못한다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 제10-2001-0110035호"}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 사용자가 기능을 직관적으로 이해할 수 있도록 증강현실 또는 혼합현 실로 매뉴얼을 제공하는 매뉴얼 제공 시스템을 제공하는 것이다. 또한, 본 발명이 해결하고자 하는 기술적 과제는 경고등의 의미 및 해제 방법을 설명하는 경고등 스캐너 기능을 제공하는 매뉴얼 제공 시스템을 제공하는 것이다. 본 발명이 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다 른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위하여, 본 발명의 일 실시예는 체감형 디지털 매뉴얼을 제공하는 매뉴얼 제공 시 스템에 있어서, 사용자가 휴대하며, 사용자의 요청 또는 선택에 따라 사용자의 등록 제품 또는 요구 제품에 대 한 매뉴얼이 증강현실 및 혼합현실 중 적어도 하나로 표현되고, 상기 등록 제품을 촬영한 실물영상 및 상기 요 구 제품이 표현될 장소를 촬영한 장소영상 중 적어도 하나를 하기 정보제공서버에 송신하는 사용자 단말기; 및 상기 사용자 단말기로부터 상기 실물영상 및 상기 장소영상 중 적어도 하나를 수신하여 분석하고, 상기 실물영 상에 대응하는 증강현실 매뉴얼 프로그램 및 상기 장소영상에 대응하는 혼합현실 매뉴얼 프로그램 중 적어도 하 나를 상기 사용자 단말기에 제공하는 정보제공서버를 포함하는, 매뉴얼 제공 시스템을 제공한다. 본 발명의 실시예에 있어서, 상기 사용자 단말기는, 상기 등록 제품을 촬영하여 실물영상을 생성하거나, 상기 보유 제품을 가상객체로 표현할 장소를 촬영하여 장소영상을 생성하는 카메라모듈; 상기 정보제공서버로부터 수신한 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 매뉴얼 프로그램 중 적어도 하나를 표시하는 디스플레이 모듈; 사용자의 조작 및/또는 음성을 감지하여 사용자의 명령 및/또는 지시를 입력 처리하는 입력모듈; 상기 정 보제공서버와 통신하여 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 매뉴얼 프로그램 중 적어도 하나를 수 신하는 단말기통신모듈; 및 사용자의 명령에 대응하여 기 설정된 기능이 작동되도록 처리하고, 상기 단말기통신 모듈을 통해 수신한 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적어도 하나가 상기 디스플레이모듈에 표시되도록 처리하는 단말기제어모듈을 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 단말기제어모듈은, 상기 정보제공서버로부터 수신한 상기 증강현실 매뉴얼 프 로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적어도 하나가 상기 디스플레이모듈에서 표시되도록 상기 증강현 실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적어도 하나를 신호처리하여 상기 디스플레이모듈로 제공하는 영상처리부; 상기 입력모듈로부터 수신한 사용자의 명령 및/또는 지시를 입력 신호로 신호처리하여 상 기 단말기통신모듈을 통해 상기 정보제공서버로 송신하는 입력처리부; 및 상기 입력모듈을 통해 사용자의 명령 및/또는 지시가 입력되면, 입력된 사용자의 명령 및/또는 지시를 신호처리하도록 상기 입력처리부를 제어하거나, 상기 영상처리부를 통해 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 메뉴얼 프로그램 중 적 어도 하나를 신호처리하여 상기 디스플레이모듈로 표시할 때 상기 입력모듈을 통해 프로그램에 대한 실행을 명 령하는 사용자의 명령 및/또는 지시가 입력되면 해당 프로그램을 실행하도록 상기 영상처리부를 제어하는 메인 제어부을 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 소비자 단말기는, 상기 등록 제품에서 표시되는 경고등을 촬영하여 표시된 경 고등의 의미를 설명하거나, 표시된 경고등의 출력을 해제할 수 있는 방법을 설명하는 경고등 스캐너 기능을 수 행하되, 경고등을 촬영하여 경고등영상을 생성하고, 상기 경고등영상을 상기 정보제공서버로 송신하며, 상기 정 보제공서버로부터 수신한 경고등 스캐너 프로그램을 표시하고, 사용자의 선택에 따라 서비스센터로 통신을 연결 하거나, 서비스센터를 찾을 수 있도록 지도 정보를 안내할 수 있다. 본 발명의 실시예에 있어서, 상기 정보제공서버는, 상기 사용자 단말기와 무선 통신하는 서버통신모듈; 기 설정 된 이미지 인식 모델을 이용하여 상기 사용자 단말기로부터 수신된 상기 실물영상 및 상기 장소영상 중 적어도 하나로부터 객체를 분석하고, 분석결과를 하기 프로그램제공모듈 및/또는 하기 서버제어모듈로 제공하는 영상분 석모듈; 상기 사용자 단말기로부터 수신한 입력신호로부터 사용자의 조작 및/또는 발화에 포함된 명령 및/또는 지시를 분석하고, 분석결과를 하기 프로그램제공모듈 및/또는 하기 서버제어모듈로 제공하는 입력명령분석모듈; 상기 영상분석모듈 및/또는 상기 입력명령분석모듈의 분석결과를 수신하여 기 저장된 증강현실 매뉴얼 프로그램 및 혼합현실 매뉴얼 프로그램 중 적어도 하나를 상기 사용자 단말기에 제공하는 프로그램제공모듈; 및 상기 영 상분석모듈 및/또는 상기 입력명령분석모듈로부터 분석결과를 수신하여 영상정보 및 입력신호 중 적어도 하나에 대응하는 상기 증강현실 매뉴얼 프로그램 및 상기 혼합현실 매뉴얼 프로그램 중 적어도 하나를 매칭하여 상기 사용자 단말기에 제공하도록 상기 프로그램제공모듈을 제어하는 서버제어모듈을 포함할 수 있다. 본 발명의 실시예에 있어서, 상기 영상분석모듈은, 형체 인식을 위한 이미지 분석 인공지능 프로그램으로 설정 되는 상기 이미지 인식 모델을 이용하여 객체를 분석하되, 상기 이미지 인식 모델은, 상품 인식을 위한 1,2차원 바코드 데이터를 자동으로 생성하는 테스트 이미지 자동생성, 이미지 증식 기법을 포함하여 이미지 해상도 변경 에 따른 패딩 자동 처리하는 데이터 아규먼트(data argument), 트레이닝 이미지의 해상도를 변경하였을 때 발생 되는 바운딩 박스의 위치변화를 보정하기 위한 알고리즘을 도입하는 해상도 변경, 상품 및 형상 인식을 하기 위 해 촬영된 이미지의 업스케일링을 위한 트레이닝 데이터를 자동 분류하는 이미지 복원을 위한 데이터셋 분리 중 적어도 하나를 포함하는 항목을 지원할 수 있다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 사용자가 기능을 직관적으로 이해할 수 있도록 증강현실 또는 혼합현실로 매뉴얼을 제공할 수 있다. 또한, 본 발명의 실시예에 따르면, 경고등의 의미 및 해제 방법을 설명하는 경고등 스캐너 기능을 제공할 수 있 다. 또한, 본 발명의 실시예에 따르면, 무겁고 두꺼운 매뉴얼 책자를 휴대하지 않아도 제품의 기능을 쉽게 확인할 수 있다.또한, 본 발명의 실시예에 따르면, 원하는 기능을 쉽고 빠르게 검색할 수 있다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 특허청구범위에 기재된 발 명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 설명하기로 한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 따라서 여기에서 설명하는 실시예로 한정되는 것은 아니다. 그리고 도면에서 본 발명을 명확 하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유 사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉, 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연 결\"되어 있는 경우뿐 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 구비할 수 있다는 것을 의미한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하 첨부된 도면을 참고하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 매뉴얼 제공 시스템의 구성을 나타내는 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 매뉴얼 제공 시스템은 사용자 단말기 및 정보제공서버(20 0)를 포함할 수 있다. 상기 사용자 단말기는 사용자가 휴대하며 상기 정보제공서버와 통신망으로 연결될 수 있다. 특히, 상 기 사용자 단말기는 HMD, 스마트폰, 테블릿 등과 같이 사용자의 등록 제품 또는 사용자의 요구 제품에 대 한 매뉴얼(사용 설명서) 프로그램(어플리케이션)이 증강현실(AR) 및/또는 혼합현실(MR)로 표현될 수 있는 최소 요구 조건을 충족하는 기기일 수 있다. 여기서, 상기 등록 제품은 사용자가 현재 보유하여 직접 취급 가능한 제 품으로서, 예컨대 사용자가 구매하여 등록시킨 자동차, 전자기기 등을 포함할 수 있다. 또한, 상기 요구 제품은 사용자가 현재 보유하지 않아서 직접 취급이 어려운 제품으로서, 예컨대 사용자가 구매를 희망하거나, 사정상 현재 취급하지 못하는 상황에서 메뉴얼을 확인하고 싶은 자동차, 전자기기 등을 포함할 수 있다. 이러한 상기 사용자 단말기는 사용자가 보유한 자동차 또는 전자기기에 부여된 차대번호, 모델 번호, 시리얼 번호, 제 품 번호 등의 식별번호를 상기 정보제공서버에 송신하여 보유한 제품을 상기 등록 제품으로 등록시킬 수 있다. 여기서, 상기 사용자 단말기는 사용자의 요청 및/또는 선택에 따라 매뉴얼 프로그램을 증강현실 및 혼합현 실 중 어느 하나로 표현할 수 있다. 만약, 사용자가 상기 등록 제품에 대한 메뉴얼을 확인하고자 하는 경우, 상 기 사용자 단말기는 사용자로부터 증강현실 매뉴얼 프로그램을 선택하는 명령을 입력받고, 상기 정보제공서버로부터 수신한 증강현실 매뉴얼 프로그램을 구동시킬 수 있다. 만약, 사용자가 상기 요구 제품에 대한 메뉴얼을 확인하고자 하는 경우, 상기 사용자 단말기는 사용자로부터 혼합현실 매뉴얼 프로그램을 선택하 는 명령을 입력받고, 상기 정보제공서버로부터 수신한 혼합현실 매뉴얼 프로그램을 구동시킬 수 있다. 이 때, 상기 사용자 단말기는 상기 등록 제품을 촬영한 영상을 상기 정보제공서버에 실시간으로 송신할 수 있다. 또한, 상기 사용자 단말기는 상기 요구 제품이 표현될 장소를 촬영한 장소영상을 상기 정보제공 서버에 실시간으로 송신할 수 있다. 또한, 상기 사용자 단말기는 사용자에게 경고등 스캐너 기능을 제공할 수 있다. 여기서, 상기 경고등 스캐 너 기능은 상기 등록 제품에서 표시되는 경고등을 촬영하여 표시된 경고등의 의미를 설명하거나, 표시된 경고등 의 출력을 해제할 수 있는 방법을 설명할 수 있다. 또한, 상기 경고등 스캐너 기능은 제조사의 서비스센터로 방 문하여 경고등의 표시를 해제해야 하는 경우, 사용자의 편의를 위하여 제조사의 서비스센터로 통신(전화)을 연 결하거나, 서비스센터를 찾을 수 있도록 지도(위치) 정보를 안내할 수 있다. 상기 경고등 스캐너 기능을 수행하기 위하여, 상기 사용자 단말기는 경고등을 실시간으로 촬영하여 경고등 영상을 생성하고, 상기 경고등영상을 상기 정보제공서버로 송신할 수 있다. 또한, 상기 사용자 단말기 는 상기 정보제공서버로부터 수신한 경고등 스캐너 프로그램을 표시하고, 사용자의 선택에 따라 서비 스센터로 통신(전화)을 연결하거나, 서비스센터를 찾을 수 있도록 지도 정보를 안내할 수 있다. 상기와 같은 기능(작동) 수행을 위하여, 상기 사용자 단말기는 카메라모듈, 디스플레이모듈, 입 력모듈, 단말기통신모듈, 및 단말기제어모듈을 포함할 수 있다. 도 2를 더 참조하면, 상기 카메라모듈은 상기 등록 제품을 실시간으로 촬영하여 실물영상을 생성하거나, 상기 보유 제품을 가상객체로 표현할 장소를 촬영하여 장소영상을 생성할 수 있다. 여기서, 상기 카메라모듈 은 상기 등록 제품을 촬영하여 상기 제품에 대한 실물영상을 생성하고, 상기 실물영상을 상기 정보제공서 버로 송신할 수 있다. 또한, 상기 카메라모듈은 상기 보유 제품을 가상객체로 표현할 장소를 촬영하 여 장소영상을 생성하고, 상기 장소영상을 상기 정보제공서버로 송신할 수 있다. 상기 디스플레이모듈은 상기 단말기통신모듈을 통해 상기 정보제공서버로부터 수신한 증강현실 매뉴얼 프로그램 및/또는 혼합현실 매뉴얼 프로그램을 표시할 수 있다. 여기서, 상기 디스플레이모듈은 사 용자가 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적 어도 하나를 쉽게 선택할 수 있도록 설정된 유저 인터페이스를 이용하여 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램의 선택 메뉴를 표시할 수 있다. 상기 입력모듈은 사용자의 명령 및/또는 지시를 입력 처리할 수 있다. 여기서, 입력모듈은 상기 디스 플레이모듈의 유저인터페이스를 통해 사용자의 조작(터치)를 감지하여 입력 처리하거나, 마이크 등의 음성 입력장치를 이용하여 사용자의 발화로부터 음성을 감지하여 입력 처리할 수 있다. 또한, 상기 입력모듈은 키보드, 마우스 등의 입력장치를 이용한 사용자의 명령을 수신하여 입력 처리할 수 있다. 이때, 상기 입력모듈 은 사용자에 의한 발화와, 사용자 이외에 다양한 요인에 의해 발생하는 소리를 구분지어 입력 처리할 수 있다. 상기 단말기통신모듈은 상기 정보제공서버와 무선 통신하여 상기 실물영상, 상기 장소영상 및 상기 경고등영상 중 적어도 하나를 상기 정보제공서버로 송신하고, 상기 정보제공서버로부터 상기 증강현 실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하나를 수신할 수 있다. 이러한 상기 단말기통신모듈은 상기 정보제공서버의 통신 프로토콜(protocol)에 따라서 유 선/무선을 통한 광역/근거리 네트워크나 로컬 접속 방식으로 상기 정보제공서버에 접속할 수 있다. 상기 단말기제어모듈은 사용자의 명령에 대응하여 기 설정된 기능이 작동되도록 처리하고, 상기 단말기통 신모듈을 통해 수신한 상기 증강현실 매뉴얼 프로그램 및/또는 상기 혼합현실 메뉴얼 프로그램이 상기 디 스플레이모듈에 표시되도록 처리할 수 있다. 만약, 사용자가 상기 증강현실 매뉴얼 프로그램을 선택한 경 우, 상기 단말기제어모듈은 상기 디스플레이모듈에 상기 등록 제품에 대한 상기 증강현실 매뉴얼이 표시되도록 상기 증강현실 매뉴얼 프로그램을 구동시킬 수 있다. 만약, 사용자가 상기 혼합현실 매뉴얼 프로그 램을 선택한 경우, 상기 단말기제어모듈은 상기 디스플레이모듈에 상기 요구 제품에 대한 상기 혼합 현실 매뉴얼이 표시되도록 상기 증강현실 매뉴얼 프로그램을 구동시킬 수 있다. 상기와 같은 기능(작동) 수행을 위하여, 상기 단말기제어모듈은 도 3에 도시된 바와 같이 영상처리부 , 입력처리부, 및 메인제어부를 포함할 수 있다.상기 영상처리부는 상기 정보제공서버로부터 수신한 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하나가 상기 사용자 단말기에서 표시되도록 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하 나를 신호처리하여 상기 디스플레이모듈로 제공할 수 있다. 여기서, 상기 영상처리부는 수신된 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하나에 포함된 영상신호에 대해 다양한 영상처리 프로세스를 수행할 수 있다. 또한, 상기 영상처리부는 이러한 프 로세스를 수행한 영상신호를 상기 디스플레이모듈을 통해 출력시킬 수 있다. 이를 통해, 상기 영상처리부 는 상기 디스플레이모듈에 해당 영상신호에 기초하는 영상을 표시되게 만들 수 있다. 예를 들면, 상 기 영상처리부는 수신한 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하나로부터 해당 프로그램에 대응하는 영상, 음성 및 부가데이터 중 적어도 하나를 추출하고, 기 설정된 해상도로 조정하여 상기 디스플레이모듈을 통해 출력시킬 수 있다. 상기 영상처리부가 수행하는 영상처리 프로세스의 종류는 한정되지 않으며, 예를 들면 영상데이터의 영상 포맷에 대응하는 디코딩(decoding), 인터레이스(interlace) 방식의 영상데이터를 프로그레시브(progressive) 방 식으로 변환하는 디인터레이싱(de-interlacing), 영상데이터를 기 설정된 해상도로 조정하는 스케일링 (scaling), 영상 화질 개선을 위한 노이즈 감소(noise reduction), 디테일 강화(detail enhancement), 프레임 리프레시 레이트(frame refresh rate) 변환 등을 포함할 수 있다. 상기 입력처리부는 상기 입력모듈로부터 수신한 사용자의 명령 및/또는 지시를 입력 신호로 신호처리 하여 상기 단말기통신모듈을 통해 상기 정보제공서버로 송신할 수 있다. 구체적으로, 상기 입력처리부는 상기 입력모듈에 입력되는 터치 및/또는 음성에 대한 입력처리 프로 세스를 수행할 수 있다. 여기서, 상기 입력처리부는 상기 입력모듈에 터치 및/또는 음성이 입력되면, 입력된 터치 및/또는 음성이 사용자에 의한 조작 및/또는 발화인지 판단할 수 있다. 예를 들면, 상기 입력처리 부는 상기 입력모듈에 음성이 입력되면, 입력된 음성이 사용자의 발화인지 아니면 기타 요인에 의하 여 발생한 소리인지 여부를 판단할 수 있다. 그러나, 이러한 판단 방법은 다양한 구조가 적용될 수 있으므로 입 력된 음성 및/또는 소리가 사람의 목소리에 대응하는 파장 및/또는 주파수 대역에 해당하는지 판단하거나, 또는 사전에 지정된 사용자의 음성의 프로파일에 해당하는지 판단하는 등의 방법을 사용할 수 있다. 또한, 상기 입력처리부는 사용자의 조작 및/또는 발화가 입력된 것으로 판단되면, 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하나의 실행명령에 대한 터치 및/또는 키워드(실행명령 키워드)를 추출하여 입력신호로 신호처리하고 상기 정보제공서버에 입력신 호를 송신할 수 있다. 이를 통해, 상기 입력처리부는 사용자의 조작 및/또는 발화에 따라 기 설정된 대응 동작이 수행될 수 있도록 지원할 수 있다. 상기 메인제어부는 상기 입력모듈을 통해 사용자의 명령 및/또는 지시가 입력되면, 입력된 사용자의 명령 및/또는 지시를 신호처리하도록 상기 입력처리부를 제어할 수 있다. 또한, 상기 메인제어부는 상기 영상처리부를 통해 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램 및 상기 경고등 스캐너 프로그램 중 적어도 하나를 영상신호로 신호처리하여 상기 디스플레이모듈로 표시할 때 상기 입력 모듈을 통해 프로그램에 대한 실행을 명령하는 사용자의 명령 및/또는 지시가 입력되면 해당 프로그램을 실행하도록 상기 영상처리부를 제어할 수 있다. 상기와 같은, 상기 단말기제어모듈은 이러한 여러 기능을 통합시킨 SOC(system-on-chip), 또는 이러한 각 프로세스를 독자적으로 수행할 수 있는 개별적인 구성들이 인쇄회로기판 상에 장착됨으로써 영상처리보드(미도 시)로 구현될 수 있다. 상기 정보제공서버는 상기 사용자 단말기와 통신망으로 연결되고 상기 사용자 단말기로부터 상 기 실물영상, 상기 장소영상, 상기 경고등영상 및 상기 입력신호 중 적어도 하나를 수신하여 상기 실물영상, 상 기 장소영상, 상기 경고등영상 및 상기 입력신호 중 적어도 하나를 분석하고, 상기 실물영상에 대응하는 증강현 실 메뉴얼 프로그램, 상기 장소영상에 대응하는 혼합현실 메뉴얼 프로그램, 상기 경고등영상에 대응하는 경고등 스캐너 프로그램을 상기 사용자 단말기에게 제공할 수 있다. 이를 위하여, 상기 정보제공서버는 서버통신모듈, 영상분석모듈, 입력명령분석모듈, 프로 그램제공모듈, 서버제어모듈을 포함할 수 있다. 상기 서버통신모듈은 상기 단말기통신모듈과 무선 통신할 수 있다. 여기서, 상기 서버통신모듈 은 상기 단말기통신모듈로부터 영상 및/또는 음성명령을 수신하고, 증강현실 컨텐츠를 영상신호로 송신할 수 있다. 상기 영상분석모듈은 상기 사용자 단말기로부터 수신된 영상으로부터 객체를 분석하고, 분석결과를 상기 프로그램제공모듈 및/또는 상기 서버제어모듈로 제공할 수 있다. 여기서, 상기 영상분석모듈은 기 설정된 이미지 인식 모델을 이용하여 상기 실물영상, 상기 장소영상, 상 기 경고등영상 중 적어도 하나로부터 객체를 구분하고, 구분된 객체를 생명체와 사물로 분석할 수 있다. 상기 실물영상을 분석하는 경우, 상기 영상분석모듈은 상기 실물영상으로부터 원점좌표로 기 설정된 객체, 예컨 대 자동차의 스타트버튼, 송풍구 등과 같이 움직이지 않는 장치를 분석하여 위치를 확인하고, 기 저장된 제품별 정보를 이용하여 원점좌표로부터 설정된 거리만큼 떨어진 위치의 다양한 객체를 해당 제품의 부속품으로 분석할 수 있다. 예를 들면, 상기 영상분석모듈이 스타트버튼을 원점좌표로 분석한 경우, 상기 영상분석모듈(22 0)은 상기 실물영상에서 스타트버튼을 기준으로 제1 거리만큼 이격된 위치의 스티어링휠, 제2 거리만큼 이격된 계기반, 제3 거리만큼 이격된 디스플레이패널, 제4 거리만큼 이격된 컨트롤패널 각각을 분석할 수 있다. 여기서, 상기 이미지 인식 모델은 형체 인식을 위한 이미지 분석 인공지능 프로그램으로 설정될 수 있으며, 상 품 인식을 위한 1,2차원 바코드 데이터를 자동으로 생성하는 테스트 이미지 자동생성, 이미지 증식 기법을 포함 하여 이미지 해상도 변경에 따른 패딩 자동 처리하는 데이터 아규먼트(data argument), 트레이닝 이미지의 해상 도를 변경하였을 때 발생되는 바운딩 박스의 위치변화를 보정하기 위한 알고리즘을 도입하는 해상도 변경, 상품 및 형상 인식을 하기 위해 촬영된 이미지의 업스케일링을 위한 트레이닝 데이터를 자동 분류하는 이미지 복원을 위한 데이터셋 분리, (오브젝트 디텍션, OCR, 바코드 또는 QR코드, 객체 추적 등을) 시뮬레이션하는 인식처리 등의 항목을 지원할 수 있다. 예를 들면, 상기 이미지 인식 모델은 상기 데이터 아규먼트가 적용된 이미지 데이터셋 약 1만장 기준으로 약 94% 이상의 정확도를 확보할 수 있다. 상기 입력명령분석모듈은 상기 사용자 단말기로부터 수신한 입력신호로부터 사용자의 조작 및/또는 발화에 포함된 명령 및/또는 지시를 분석하고, 상기 프로그램제공모듈 및/또는 상기 서버제어모듈로 제공할 수 있다. 예를 들면, 상기 입력명령분석모듈은 음성명령에 포함된 좌표영역 키워드 또는 실행명령 키워드를 분석할 수 있다. 이때, 상기 입력명령분석모듈은 자연어 인식에 관련된 처리모델(이하, 자연어 처리모델)을 이용하여 음성명령을 분석할 수 있다. 여기서, 상기 자연어 처리모델은 노이즈와 음성을 분리하여 딥러닝 학습할 수 있다. 또한, 상기 자연어 처리모 델은 딥러닝을 통해 학습된 인공지능 모델에 음성인식(speech-to-text) 기법을 적용하여 음성 데이터를 텍스트 로 변환할 수 있다. 또한, 상기 입력명령분석모듈은 음성에 대한 감정 판별 엔진의 음성 감정 인식 특성(Voice Emotion Recognition Feature: VERF)을 이용하여 사용자의 감정을 분석할 수 있다. 예를 들면, 사용자의 음성에서 피치(pitch) 측면으로 소리가 떨리고 더듬거리며 같은 단어를 반복하는 경우, 또 는 음색(timbre) 측면으로 사용자의 고유 습관이 있는 경우, 톤(tone) 측면으로 목소리 톤 변화가 크게 없거나 목소리 톤의 높낮이가 느껴지지만 인위적인 경우에, 상기 입력명령분석모듈은 사용자의 다양한 감정을 분 석할 수 있다. 즉, 입력명령분석모듈은 사용자가 발화했을 때 불안해하는 부분, 서두르는 부분, 애매한 부분 등을 분석하여 분석 결과를 생성할 수 있다. 상기 프로그램제공모듈은 상기 영상분석모듈 및/또는 상기 입력명령분석모듈의 분석결과를 수신 하여 기 저장된 증강현실 매뉴얼 프로그램, 혼합현실 매뉴얼 프로그램, 경고등 스캐너 프로그램 중 적어도 하나 를 상기 사용자 단말기에 제공할 수 있다. 여기서, 상기 프로그램제공모듈은 상기 사용자 단말기에서 촬영한 영상에 대한 정보(이하, 영상정 보)를 저장하고, 상기 영상정보 및 상기 입력신호 중 적어도 하나에 대응하는 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램, 상기 경고등 스캐너 프로그램 중 적어도 하나를 저장하며, 상기 서버제어모듈 의 제어에 따라 상기 혼합현실 매뉴얼 프로그램, 상기 경고등 스캐너 프로그램 중 적어도 하나를 상기 사 용자 단말기로 제공할 수 있다. 이때, 상기 프로그램제공모듈은 상기 영상정보 및 상기 입력신호 중 적어도 하나와, 상기 증강현실 매뉴얼 프로그램, 상기 혼합현실 매뉴얼 프로그램, 상기 경고등 스캐너 프로그램 중 적어도 하나를 상호 대응하게 맵핑하는 관계 데이터베이스를 저장할 수 있다.상기 서버제어모듈은 상기 영상분석모듈 및/또는 상기 입력명령분석모듈로부터 분석결과를 수신 하여 상기 영상정보 및 상기 입력신호 중 적어도 하나에 대응하는 상기 증강현실 매뉴얼 프로그램, 상기 혼합현 실 매뉴얼 프로그램, 상기 경고등 스캐너 프로그램 중 적어도 하나를 매칭하여 상기 사용자 단말기에 제공 하도록 상기 프로그램제공모듈을 제어할 수 있다. [실시예 1] 도 3 내지 도 9는 본 발명의 일 실시예에 따른 증강현실 매뉴얼 프로그램의 작동을 나타내는 도면들이다. 본 발명의 일 실시예에 따른 매뉴얼 제공 시스템에서는 사용자가 사용자 단말기를 통해 표시된 메뉴에서 증강현 실 매뉴얼 프로그램을 선택하여 등록 제품에 대한 매뉴얼을 증강현실로 확인할 수 있다. 구체적으로, 사용자가 사용자 단말기의 메뉴에서 증강현실 매뉴얼 프로그램을 선택한 후 사용자 단말기로 본인 이 구매한 자동차를 촬영하면, 사용자 단말기에는 정보제공서버로부터 수신한 증강현실 매뉴얼 프로그램이 작동 하여 자동차의 기능을 설명하기 위한 증강객체가 실물영상에 정합되어 표시될 수 있다. 사용자가 도 3에 도시된 바와 같이 제1 가이드 마커에 맞춰지도록 사용자 단말기를 조작하여 제품을 촬영 하고 실물영상을 생성할 수 있다. 사용자 단말기는 실물영상을 정보제공서버로 송신하고, 정보제공서버는 실물 영상을 분석하여 원점좌표를 기준으로 기 저장된 위치의 객체들 각각에 제1 내지 제4 증강마커 (510,520,530,540)가 생성된 증강현실 매뉴얼 프로그램을 사용자 단말기로 제공할 수 있다. 이때, 사용자 단말 기는 도 4에 도시된 바와 같이 정보제공서버로부터 수신한 증강현실 매뉴얼 프로그램을 이용하여 실물영상에 제 1 내지 제4 증강마커(510,520,530,540)를 정합시켜 표시할 수 있다. 여기서, 제1 내지 제4 증강마커 (510,520,530,540) 각각은 원점좌표를 기준으로 제1 거리만큼 이격된 위치의 스티어링휠, 제2 거리만큼 이격된 계기반, 제3 거리만큼 이격된 디스플레이패널, 제4 거리만큼 이격된 컨트롤패널에 위치할 수 있다. 제1 내지 제4 증강마커(510,520,530,540) 각각은 사용자의 터치로 입력을 받게 되면 해당 객체에 대한 설명을 정보제공서버에 저장된 텍스트, 이미지, 동영상 중 적어도 하나로 나타낼 수 있다. 예를 들면, 제3 증강마커을 사용자가 터치한 경우, 사용자 단말기에는 도 5에 도시된 바와 같이 디스플레 이패널에서 선택할 수 있는 메뉴가 표시되고, 시트 설정에 대한 아이콘을 터치하면 도 6에 도시된 바와 같이 시 트 설정에 대한 세부 설명이 표시될 수 있다. 글러브박스에 대한 설명을 확인하고 싶은 경우, 도 7에 도시된 바와 같이 사용자는 조작(터치) 및/또는 음성을 통해 유저 인터페이스의 검색창에 글러브박스를 입력할 수 있다. 글러브박스에 대한 입력신호를 수신한 정 보제공서버는 도 8에 도시된 바와 같이 기 저장된 글러브박스의 위치를 실물영상과 비교한 후 실물영상에 가이 드 박스가 없는 것으로 판단하여 글러브박스의 위치를 안내하는 제2 가이드 마커를 생성하여 사용자 단말 기로 제공할 수 있다. 사용자가 도 9에 도시된 바와 같이 제2 가이드 마커가 표시된 사용자 단말기를 글러브박스의 위치로 회전 시키면 사용자 단말기에는 글러브박스에 제5 증강마커가 위치하여 표시될 수 있다. 이때, 제5 증강마커 는 사용자의 터치로 입력을 받게 되면 글러브박스에 대한 설명, 예컨대 글러브박스를 잠그는 방법을 정보 제공서버에 저장된 텍스트, 이미지, 동영상 중 적어도 하나로 나타낼 수 있다. [실시예 2] 도 10 및 도 11은 본 발명의 일 실시예에 따른 혼합현실 매뉴얼 프로그램의 작동을 나타내는 도면들이다. 본 발명의 일 실시예에 따른 매뉴얼 제공 시스템에서는 사용자가 사용자 단말기를 통해 표시된 메뉴에서 혼합현 실 매뉴얼 프로그램을 선택하여 요구 제품에 대한 매뉴얼을 혼합현실로 확인할 수 있다. 구체적으로, 사용자가 사용자 단말기의 메뉴에서 혼합현실 매뉴얼 프로그램을 선택한 후 사용자 단말기로 본인 이 원하는 자동차를 선택하면, 사용자 단말기에는 정보제공서버로부터 수신한 혼합현실 매뉴얼 프로그램이 작동 하여 자동차를 증강시킬 공간을 설정하기 위한 가상객체가 장소영상에 정합되어 표시될 수 있다. 사용자가 도 10에 도시된 바와 같이 제3 가이드 마커가 원하는 장소에 위치하도록 사용자 단말기를 조작하 여 장소를 촬영하고 장소영상을 생성할 수 있다. 사용자 단말기는 장소영상을 정보제공서버로 송신하고, 정보제공서버는 장소영상을 분석하여 제3 가이드 마커를 기준으로 기 저장된 자동차 데이터를 이용하여 가상객체 가 생성된 혼합현실 매뉴얼 프로그램을 사용자 단말기로 제공할 수 있다. 이때, 사용자 단말기는 도 11에 도시 된 바와 같이 정보제공서버로부터 수신한 혼합현실 매뉴얼 프로그램을 이용하여 장소영상에 자동차 객체를 표시 할 수 있다. 여기서, 혼합현실 매뉴얼 프로그램의 자동차 객체는 도 4에 도시된 증강현실 매뉴얼 프로그램의 제 1 내지 제4 증강마커(510,520,530,540) 각각을 동일하게 구현하고, 각 객체에 대한 설명을 나타낼 수 있다. [실시예 3] 도 12 및 도 13은 본 발명의 일 실시예에 따른 경고등 스캐너 프로그램의 작동을 나타내는 도면들이다. 본 발명의 일 실시예에 따른 매뉴얼 제공 시스템에서는 사용자가 사용자 단말기를 통해 표시된 메뉴에서 경고등 스캐너 프로그램을 선택하여 등록 제품의 경고등에 대한 설명을 확인할 수 있다. 사용자가 도 12에 도시된 바와 같이 사용자 단말기로 자동차의 계기반에 표시된 경고등을 촬영하여 경고등영상 을 생성할 수 있다. 사용자 단말기는 경고등영상을 정보제공서버로 송신하고, 정보제공서버는 경고등영상을 분석하여 표시된 경고등 의 의미를 설명하거나, 표시된 경고등의 출력을 해제할 수 있는 방법을 설명하는 경고등 스캐너 프로그램을 사 용자 단말기로 제공할 수 있다. 또한, 정보제공서버는 제조사의 서비스센터로 방문하여 경고등의 표시를 해제해 야 하는 경우, 경고등 스캐너 프로그램을 통해 사용자에게 편의를 제공하기 위하여 제조사의 서비스센터로 전화 를 연결하거나, 서비스센터를 찾을 수 있도록 지도 정보를 안내하는 메뉴를 표시할 수 있다. 본 발명의 실시예에 따르면, 사용자가 기능을 직관적으로 이해할 수 있도록 증강현실 또는 혼합현실로 매뉴얼을 제공할 수 있다. 또한, 본 발명의 실시예에 따르면, 경고등의 의미 및 해제 방법을 설명하는 경고등 스캐너 기능을 제공할 수 있 다. 또한, 본 발명의 실시예에 따르면, 무겁고 두꺼운 매뉴얼 책자를 휴대하지 않아도 제품의 기능을 쉽게 확인할 수 있다. 또한, 본 발명의 실시예에 따르면, 원하는 기능을 쉽고 빠르게 검색할 수 있다."}
{"patent_id": "10-2021-0163310", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2021-0163310", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 매뉴얼 제공 시스템의 구성을 나타내는 도면이다. 도 2는 도 1의 단말기제어모듈의 세부 구성을 예시적으로 나타내는 도면이다. 도 3 내지 도 9는 본 발명의 일 실시예에 따른 증강현실 매뉴얼 프로그램의 작동을 나타내는 도면들이다. 도 10 및 도 11은 본 발명의 일 실시예에 따른 혼합현실 매뉴얼 프로그램의 작동을 나타내는 도면들이다. 도 12 및 도 13은 본 발명의 일 실시예에 따른 경고등 스캐너 프로그램의 작동을 나타내는 도면들이다."}
