{"patent_id": "10-2020-0171834", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0082195", "출원번호": "10-2020-0171834", "발명의 명칭": "산업용 스트레스 분석 시스템", "출원인": "이준희", "발명자": "이준희"}}
{"patent_id": "10-2020-0171834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 손에 착용하여 손에 가해지는 압력을 측정하는 장갑;상기 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가해지는 스트레스 정보를 분석하여 사용자에게 피드백을 제공하는 피드백 장치;를 포함하는 것을 특징으로 하는 산업용 스트레스 분석 시스템."}
{"patent_id": "10-2020-0171834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 피드백 장치는,상기 장갑에 가해지는 압력의 세기와, 압력이 가해지는 시간을 모니터링하여 폭로시간에 따른 피해량을 분석하고, 반발력에 의한 충격량을 분석하는 것을 특징으로 하는 산업용 스트레스 분석 시스템."}
{"patent_id": "10-2020-0171834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 장갑은,외측면에 사용자에게 피드백을 제공하기 위한 적어도 하나의 출력 모듈을 포함하는 것을 특징으로 하는 산업용스트레스 분석 시스템."}
{"patent_id": "10-2020-0171834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 피드백 장치는,상기 폭로시간에 따른 피해량 또는 상기 반발력에 의한 충격량이 기 설정된 값 이상인 경우 상기 출력 모듈을통해 사용자에게 경고를 출력하는 것을 특징으로 하는 산업용 스트레스 분석 시스템."}
{"patent_id": "10-2020-0171834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 피드백 장치는,사용자 별 작업 시간을 토대로 작업 숙련도를 결정하고, 사용자 별 숙련도에 따른 상기 피해량 및 상기 충격량을 누적 저장하고, 저장된 누적 데이터를 통해 인공지능 엔진을 학습시키고, 학습된 인공지능 엔진을 이용하여사용자 별 경고를 출력하는 것을 특징으로 하는 산업용 스트레스 분석 시스템."}
{"patent_id": "10-2020-0171834", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 피드백 장치는,산업기계와 연동되어, 상기 장갑에 지정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 상기 산업기계의 작동을 중지시키는 것을 특징으로 하는 산업용 스트레스 분석 시스템."}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자가 산업 현장에서 공작기계, 드릴, 망치 등의 장비를 조작하면서 인체에 가해지는 스트레스를 분석하고, 나아가 위급 상황을 판단하여 사용자에게 피드백을 제공하기 위한 산업용 스트레스 분석 시스템에 관 한 것이다. 본 발명에 따른 산업용 스트레스 분석 시스템은 사용자의 손에 착용하여 손에 가해지는 압력을 측정 하는 장갑, 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가해지는 스트레 스 정보를 분석하여 사용자에게 피드백을 제공하는 피드백 장치를 포함한다."}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 산업용 스트레스 분석 시스템에 관한 것으로, 더욱 상세하게는 사용자가 산업 현장에서 공작기계, 드 릴, 망치 등의 장비를 조작하면서 인체에 가해지는 스트레스를 분석하고, 나아가 위급 상황을 판단하여 사용자 에게 피드백을 제공하기 위한 산업용 스트레스 분석 시스템에 관한 것이다."}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 산업의 고도화, 복잡화, 기계화, 대형화로 인한 산업재해 발생빈도가 높아지고 있고, 사회적으로 안전 불 감증이 만연한 상태이므로, 산업재해로 인한 경제적 손실액과 부상 및 사망하는 근로자의 수가 점차 늘어나고 있다. 이에, 산업현장에서는 최첨단 기술을 융합하여 산업현장에서 발생되는 재해를 사전에 예측하고, 작업자의 사고 를 미연에 방지하며, 사고 발생 시 상황별, 유형별로 빠른 대응이 가능한 종합적인 산업안전 관리체계를 개발 및 확립 할 필요성이 증대하고 있다. 따라서, 각종 센서 기술과 영상기술을 기반으로 산업현장에서의 화재, 폭발, 질식 등의 산업재해를 예방하기 위 한 기술들이 개발되고 있으나, 이러한 종래의 기술은 고도화, 복잡화된 현재의 산업현장에서 적용하기 어려울 뿐 아니라, 근로자와 산업기기 간의 지능형, 능동형 소통이 되지 않으므로, 근로자의 순간의 실수로 만들어지는 위기상황에 따른 적절한 사고예측을 하는데 한계가 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허공보 제10-1639746호(2016.07.08.)"}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명의 목적은 사용자가 산업 현장에서 공작기계, 드릴, 망치 등의 장비를 조작하면서 인체에 가해지 는 스트레스를 분석하고, 나아가 위급 상황을 판단하여 사용자에게 피드백을 제공하기 위한 산업용 스트레스 분 석 시스템을 제공하는 데 있다."}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 산업용 스트레스 분석 시스템은 사용자의 손에 착용하여 손에 가해지는 압력을 측정하는 장갑, 상기 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가해지는 스트레스 정 보를 분석하여 사용자에게 피드백을 제공하는 피드백 장치를 포함하는 것을 특징으로 한다. 본 발명에 따른 산업용 스트레스 분석 시스템에 있어서, 상기 피드백 장치는, 상기 장갑에 가해지는 압력의 세 기와, 압력이 가해지는 시간을 모니터링하여 폭로시간에 따른 피해량을 분석하고, 반발력에 의한 충격량을 분석 하는 것을 특징으로 한다. 본 발명에 따른 산업용 스트레스 분석 시스템에 있어서, 상기 장갑은 외측면에 사용자에게 피드백을 제공하기 위한 적어도 하나의 출력 모듈을 포함하는 것을 특징으로 한다. 본 발명에 따른 산업용 스트레스 분석 시스템에 있어서, 상기 피드백 장치는, 상기 폭로시간에 따른 피해량 또 는 상기 반발력에 의한 충격량이 기 설정된 값 이상인 경우 상기 출력 모듈을 통해 사용자에게 경고를 출력하는 것을 특징으로 한다. 본 발명에 따른 산업용 스트레스 분석 시스템에 있어서, 상기 피드백 장치는, 사용자 별 작업 시간을 토대로 작 업 숙련도를 결정하고, 사용자 별 숙련도에 따른 상기 피해량 및 상기 충격량을 누적 저장하고, 저장된 누적 데 이터를 통해 인공지능 엔진을 학습시키고, 학습된 인공지능 엔진을 이용하여 사용자 별 경고를 출력하는 것을 특징으로 한다.본 발명에 따른 산업용 스트레스 분석 시스템에 있어서, 상기 피드백 장치는, 산업기계와 연동되어, 상기 장갑 에 지정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 상기 산업기계의 작동을 중지시키는 것을 특징으로 한다."}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 산업용 스트레스 분석 시스템은 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통 해 사용자의 신체에 가해지는 스트레스 정보를 분석하여 사용자에게 피드백을 제공함으로써, 안정성과 작업 효 율을 향상시킬 수 있다. 또한 본 발명에 따른 산업용 스트레스 분석 시스템은 산업기계와 연동되어, 장갑에 지정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 산업기계의 작동을 중지시킴으로써, 위급 상황을 사전에 방지할 수 있다."}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 상세한 설명에 앞서, 이하에서 설명되는 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거 나 사전적인 의미로 한정해서 해석되어서는 아니 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명 하기 위해 용어의 개념으로 적절하게 정의할 수 있다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의 미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가장 바람직한 실시예에 불과할 뿐, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형 예들이 있을 수 있음을 이해하여야 한다. 이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예들을 상세히 설명한다. 이때, 첨부된 도면에서 동일한 구성 요소는 가능한 동일한 부호로 나타내고 있음을 유의해야 한다. 또한, 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략할 것이다. 마찬가지의 이유로 첨부 도면에 있어서 일부 구성요소 는 과장되거나 생략되거나 또는 개략적으로 도시되었으며, 각 구성요소의 크기는 실제 크기를 전적으로 반영하 는 것이 아니다. 도 1은 본 발명의 실시예에 따른 산업용 스트레스 분석 시스템의 구성을 나타낸 블록도이다. 도 1을 참조하면, 본 발명의 실시예에 따른 산업용 스트레스 분석 시스템은 산업 현장에 구비되어, 장갑 을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가해지는 스트레스 정보를 분석하여 사용자에게 피드백을 제공할 수 있다. 또한 본 발명의 실시예에 따른 산업용 스트레스 분석 시스템은 산업기계와 연동되어, 장갑에 지 정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 산업기계의 작동을 중지시킴으로써, 위급 상황을 사전에 방지할 수 있다. 이러한 산업용 스트레스 분석 시스템은 장갑, 산업기계 및 피드백 장치를 포함하여 구성될 수 있다. 장갑은 사용자의 손에 착용하여 손에 가해지는 압력을 측정할 수 있다. 즉 장갑은 내측면에 손에 가 해지는 압력을 측정하기 위한 적어도 하나의 센서를 포함하여, 사용자가 장비를 사용함에 따라 손에 가해지는 압력을 측정할 수 있다. 예를 들어, 장갑은 압전저항 또는 압전용량성 소자가 내장되어, 압력에 따른 저항 변화를 감지하거나, 압력에 따른 캐패시터의 변화를 감지할 수 있다. 또한 장갑은 외측면에 사용자에게 피드백을 제공하기 위한 적어도 하나의 출력 모듈을 포함할 수 있다. 즉 장갑은 피드백 장치로부터 분석된 스트레스 정보에 따라 장갑을 착용한 사용자에게 피드백 또는경보를 제공할 수 있다. 이때 장갑은 출력 모듈을 통해 색상, 점멸 또는 진동을 통해 피드백을 제공할 수 있다. 예를 들어 장갑은 출력 모듈을 통해 색상, 점멸 또는 진동을 통해 인체에 미치는 손상을 경고하고, 나아가 서 작업 중간중간에 적절한 시점에 스트레칭, 휴식 등을 권고할 수 있다. 산업 기계는 풍수력기계(압축기 ·송풍기 ·펌프 등), 광산기계(착암기 ·콜커터 등), 토목 ·건설기계(굴 착기 ·건설용 트랙터 등), 화학기계(여과기 ·반응장치 등), 섬유기계(방직기 ·메리야스기 등), 운반기계(크 레인 등), 금속가공기계(압연기 등), 농업기계(경운기 등), 식품가공기계(통조림 제조기 등), 인쇄 ·제본기계 (인쇄기 ·제본기 등), 포장 ·짐꾸리기 기계(포장기 등), 목공기계(제재기 등), 원동기(보일러 ·내연기관 등), 동력전도장치, 공업용 용광로, 주조장치 등 다양한 산업의 생산공정상 사용되는 기계가 해당될 수 있다. 이러한 산업 기계는 피드백 장치에 의해 사용자가 위급 상황으로 판단되면, 그에 따른 동작을 수행할 수 있다. 예를 들어 산업 기계는 선반 작업시 회전하는 비트에 접촉한 경우 즉시 정지하거나, 프레스 등 압착기에 의한 사고 시 프레스 정지 또는 역방향 이송 및 알람을 제공할 수 있다. 또한 산업 기계는 사고 시 공작물에 양손이 고정되어 도움요청이 어려운 경우 경보를 출력하여 인근 작업자에게 알릴 수 있다. 피드백 장치는 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가 해지는 스트레스 정보를 분석하여 사용자에게 피드백을 제공할 수 있다. 즉 피드백 장치는 장갑에 가해지는 압력의 세기와, 압력이 가해지는 시간을 모니터링하여 폭로시간에 따른 피해량을 분석하고, 반발력에 의한 충격량을 분석할 수 있다. 예를 들어, 피드백 장치는 사용자가 드릴 작업에 의한 지속적인 진동을 모니터링하고 폭로시간에 따른 피 해량을 분석할 수 있다. 또한 피드백 장치는 해머드릴/망치 등 반발력에 의한 충격이 발생하는 경우 충격 량을 모니터링하고 사용자에게 피드백할 수 있다. 또한 피드백 장치는 폭로시간에 따른 피해량 또는 반발력에 의한 충격량이 기 설정된 값 이상인 경우 장갑 의 출력 모듈을 통해 사용자에게 경고를 출력할 수 있다. 또한 피드백 장치는 사용자 별 작업 시간을 토대로 작업 숙련도를 결정하고, 사용자 별 숙련도에 따른 피 해량 및 충격량을 누적 저장하고, 저장된 누적 데이터를 통해 인공지능 엔진을 학습시킬 수 있다. 또한 피드백 장치는 학습된 인공지능 엔진을 이용하여 사용자 별 경고를 출력할 수 있다. 또한 피드백 장치는 산업기계와 연동되어, 장갑에 지정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 산업기계의 작동을 중지시킬 수 있다. 이와 같이 본 발명의 실시예에 따른 산업용 스트레스 분석 시스템은 장갑을 통해 측정된 압력의 세기 와, 압력이 가해지는 시간을 통해 사용자의 신체에 가해지는 스트레스 정보를 분석하여 사용자에게 피드백을 제 공함으로써, 안정성과 작업 효율을 향상시킬 수 있다. 또한 본 발명의 실시예에 따른 산업용 스트레스 분석 시스템은 산업기계와 연동되어, 장갑에 지 정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 산업기계의 작동을 중지시킴으로써, 위급 상황 을 사전에 방지할 수 있다. 한편 장갑, 산업 기계 및 피드백 장치는 통신망을 통해 데이터 전송 및 정보 교환을 위한 일련 의 데이터 송수신 동작을 수행할 수 있다. 특히, 통신망은 다양한 형태의 통신망이 이용될 수 있으며, 예컨대, 무선랜(WLAN, Wireless LAN), 와이파이(Wi-Fi), 와이브로(Wibro), 와이맥스(Wimax), 고속하향패킷접속(HSDPA, High Speed Downlink Packet Access) 등의 무선 통신방식 또는 이더넷(Ethernet), xDSL(ADSL, VDSL), HFC(Hybrid Fiber Coax), FTTC(Fiber to The Curb), FTTH(Fiber To The Home) 등의 유선 통신방식이 이용될 수 있다. 한편, 통신망은 상기에 제시된 통신방식에 한정되는 것은 아니며, 상술한 통신 방식 이외에도 기타 널리 공지되었거나 향후개발될 모든 형태의 통신 방식을 포함할 수 있다. 이하 본 발명의 실시예에 따른 장갑에 대하여 더욱 상세히 설명하도록한다. 도 2는 본 발명의 실시예에 따른 장갑의 구성의 내부 구성을 나타낸 블록도이고, 도 3은 본 발명의 실시예에 따 른 장갑의 외형을 나타내기 위한 도면이다. 도 2 및 도 3을 참조하면, 본 발명의 실시예에 따른 장갑은 통신부, 전원부, 센서부, 출력 부 및 제어부를 포함할 수 있다. 통신부는 통신망에 접속하여 데이터를 송수신하는 기능을 수행하고, 센서부로부터 측정된 데이터를 피드백 장치로 전송하는 역할을 수행한다. 특히 통신부는 무선망 통신 모듈, 무선랜 통신 모듈 및 무 선팬 통신 모듈 중 어느 하나를 이용하여 피드백 장치에 측정된 손에 가해지는 압력을 피드백 장치에 전송할 수 있다. 전원부는 통신부, 센서부 및 제어부에 전원을 공급하여 각각의 기능을 수행하도록 지원할 수 있다. 바람직하게 전원부는 박막 배터리(Thin-Film Battery)가 사용될 수 있다. 센서부는 압력 센서(130a) 및 굽힘 센서(130b)를 포함할 수 있다. 여기서 압력 센서(130a) 및 굽힘 센서 (130b)는 도 3의 (b)에 도시된 바와 같이, 장갑의 내측면에 구비될 수 있으며, 각 손가락의 악력 정보를 측정하기 위하여, 각 손가락에 어레이되어 배열될 수 있다. 여기서 압력 센서(130a) 및 굽힘 센서(130b)는 탄소 나노소재 기반의 유연, 신축한 박막형 센서가 사용될 수 있다. 출력부는 도 3의 (a)에 도시된 바와 같이, 장갑의 외측면에 구비되어 사용자에게 피드백을 제공할 수 있다. 이러한 출력부는 색상, 점멸 또는 진동을 통해 사용자에게 피드백을 제공할 수 있다. 제어부는 전원부로부터 전원을 공급받고, 센서부로부터 측정된 압력을 통신부를 통해 피드 백 장치에 전달하고, 피드백 장치로부터 수신되는 피드백 정보를 출력부를 통해 출력하는 것을 제어할 수 있다. 도 4는 본 발명의 실시예에 따른 피드백 장치의 내부 구성을 나타낸 블록도이고, 도 5는 본 발명의 실시예에 따 른 심층신경망(DNN)의 구성을 설명하기 위한 도면이다. 도 4 및 도 5를 참조하면, 도 5 및 도 6을 참조하면, 본 발명의 실시예에 따른 피드백 장치는 단말 통신부 , 단말 입력부, 단말 표시부, 단말 저장부 및 단말 제어부를 포함한다. 단말 통신부는 통신망에 접속하여 데이터를 송수신하는 기능을 제공하고, 이를 통해서 장갑 및 산업 기계에 접속한다. 이러한 단말 통신부는 무선망 통신 모듈, 무선랜 통신 모듈 및 무선팬 통신 모듈 중 어느 하나를 이용하여 장갑 및 산업기계와 정보를 송수신할 수 있다. 특히 단말 통신부는 장 갑으로부터 압력 정보를 수신하고, 피드백 정보를 장갑으로 송신하거나, 피드백에 따른 제어 정보를 산업기계에 전송할 수 있다. 단말 입력부는 숫자 및 문자 정보 등의 다양한 정보를 입력 받고, 각종 기능을 설정 및 피드백 장치 의 기능 제어와 관련하여 입력되는 신호를 단말 제어부로 전달한다. 단말 입력부는 터치 또는 조작에 따른 입력 신호를 발생하는 키패드와 터치패드 중 적어도 하나를 포함하여 구성될 수 있다. 이 때, 단말 입력부 는 단말 표시부와 함께 하나의 터치패널(또는 터치스크린(touch screen))의 형태로 구성되어 입력과 표시 기능을 동시에 수행할 수 있다. 단말 입력부는 키보드, 키패드, 마우스, 조이스틱 등과 같은 입력 장 치 외에도 향후 개발될 수 있는 모든 형태의 입력 수단이 사용될 수 있다. 특히 단말 입력부는 사용자별 데이터를 저장하기 위하여 사용자 정보를 입력받을 수 있다. 단말 표시부는 피드백 장치의 기능 수행 중에 발생하는 일련의 동작 상태 및 동작 결과 등에 대한 정 보를 표시한다. 특히 단말 표시부는 사용자 별로 스트레스 정보를 모니터링할 수 있도록 화면상에 표시할 수 있다. 여기서 단말 표시부는 액정표시장치(LCD, Liquid Crystal Display), 초박막 액정표시장치(TFT- LCD, Thin Film Transistor LCD), 발광다이오드(LED, Light Emitting Diode), 유기 발광다이오드(OLED, Organic LED), 능동형 유기발광다이오드(AMOLED, Active Matrix OLED), 레티나 디스플레이(Retina Display), 플렉시블 디스플레이(Flexible display) 및 3차원(3 Dimension) 디스플레이 등으로 구성될 수 있다. 이 때, 단 말 표시부가 터치스크린(Touch screen) 형태로 구성된 경우, 단말 입력부의 기능 중 일부 또는 전부 를 수행할 수 있다. 단말 저장부는 데이터를 저장하기 위한 장치로, 피드백 장치의 기능 동작에 필요한 응용 프로그램을 저장한다. 단말 저장부는 사용자의 요청에 상응하여 각 기능을 활성화하는 경우, 단말 제어부의 제어 하에 해당 응용 프로그램을들을 실행하여 각 기능을 제공하게 된다. 특히 단말 저장부는 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가해지는 스트레스 정보를 분석하여 사용 자에게 피드백을 제공하기 위한 프로그램을 저장한다. 또한 단말 저장부는 사용자 별 숙련도에 따른 피해 량 및 충격량을 누적 저장하고, 저장된 누적 데이터를 통해 학습된 인공지능 엔진을 포함할 수 있다. 이러한단말 저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램 (Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 저장매체를 포함할 수 있다. 단말 제어부는 장갑을 통해 측정된 압력의 세기와, 압력이 가해지는 시간을 통해 사용자의 신체에 가 해지는 스트레스 정보를 분석하여 사용자에게 피드백을 제공할 수 있다. 즉 단말 제어부는 장갑에 가해지는 압력의 세기와, 압력이 가해지는 시간을 모니터링하여 폭로시간에 따른 피해량을 분석하고, 반발력에 의한 충격량을 분석할 수 있다. 예를 들어, 단말 제어부는 사용자가 드릴 작업에 의한 지속적인 진동을 모니터링하고 폭로시간에 따른 피 해량을 분석할 수 있다. 또한 단말 제어부는 해머드릴/망치 등 반발력에 의한 충격이 발생하는 경우 충격 량을 모니터링하고 사용자에게 피드백할 수 있다. 또한 단말 제어부는 폭로시간에 따른 피해량 또는 반발력에 의한 충격량이 기 설정된 값 이상인 경우 장갑 의 출력 모듈을 통해 사용자에게 경고를 출력할 수 있다. 또한 단말 제어부는 사용자 별 작업 시간을 토대로 작업 숙련도를 결정하고, 사용자 별 숙련도에 따른 피 해량 및 충격량을 누적 저장하고, 저장된 누적 데이터를 통해 인공지능 엔진을 학습시킬 수 있다. 또한 단말 제어부는 학습된 인공지능 엔진을 이용하여 사용자 별 경고를 출력할 수 있다. 또한 단말 제어부는 산업기계와 연동되어, 장갑에 지정된 시간 동안 기 설정된 이상의 압력이 감지되는 경우 연동된 산업기계의 작동을 중지시킬 수 있다. 본 발명의 실시예에 따른 심층신경망(DNN)에 대해 보다 상세하게 설명하기로 한다. 심층신경망(DNN)은 다층퍼셉트론(MLP: Multilayer Perceptron)이 될 수 있다. 심층신경망(DNN)은 복수의 계층 (IL, HL, OL)을 포함한다. 이러한 복수의 계층은 입력층(IL), 복수의 은닉 계층(HL: HL1 내지 HLk) 및 출력층 (OL)을 포함한다. 또한, 복수의 계층(IL, HL, OL) 각각은 복수의 노드를 포함한다. 예컨대, 도시된 바와 같이, 입력층(IL)은 m개 의 입력노드(i1 ~ im)를 포함하며, 출력층(OL)은 n개의 출력노드(o1~on)를 포함할 수 있다. 또한, 은닉층(HL) 중 제1 은닉계층(HL1)은 a개의 노드(h11 ~ h1a)를 포함하고, 제2 은닉계층(HL2)은 b개의 노드(h21 ~ h2b)를 포 함하고, 제k 은닉계층(HLk)은 l개의 노드(hk1 ~ hkl)를 포함할 수 있다. 복수의 계층의 복수의 노드 각각은 연산을 수행한다. 특히, 서로 다른 계층의 복수의 노드는 가중치(W: weigh t)를 가지는 채널(점선으로 표시)로 연결된다. 다른 말로, 어느 하나의 노드의 연산 결과는 가중치가 적용되어 다음 계층 노드의 입력이 된다. 즉, 심층신경망(DNN)의 어느 한 계층의 어느 하나의 노드는 이전 계층의 노드로 부터의 입력에 가중치를 적용한 값을 입력받고, 이를 합산하여 활성화함수를 취하고, 이러한 결과를 다음 계층 의 입력으로 전달한다. 이에 따라, 사용자 정보, 사용자별 작업 숙련도 등이 입력층(IL)에 입력되면, 심층신경망(DNN)은 입력된 데이터 에 대해 복수의 계측(IL, HL, OL)의 가중치가 적용되는 복수의 연산을 수행하여 사용자 별로 피드백을 나타내는 출력값을 산출한다. 보다 구체적으로 설명하면, 사용자 정보, 사용자별 작업 숙련도 등이 심층신경망(DNN)의 입력층(IL)의 복수의 입력노드(i1 ~ im)에 입력되면, 제1 은닉층(HL1)의 복수의 제1 은닉노드(h11 ~ h1a) 각각은 복수의 입력노드(i1 ~ im)의 각 얼굴 영상에 가중치가 적용된 값을 입력받고(점선으로 표시), 입력된 값을 모두 합산한 후, 합산된 값에 대해 활성화함수에 따른 연산을 수행하여 복수의 제1 은닉노드값을 산출한다. 이어서, 제2 은닉층(HL2)의 복수의 제2 은닉노드(h21 ~ h2b) 각각은 복수의 제1 은닉노드(h11 ~ h1a)의 복수의 제1 은닉노드값 각각에 가중 치가 적용된 값을 입력받고(점선으로 표시), 입력된 값을 모두 합산하고, 합산된 값에 대해 활성화함수에 따른 연산을 수행하여 복수의 제2 은닉노드값을 산출한다. 이와 같은 방식으로, 은닉층(HL) 내에서 이전의 노드값이 가중치가 적용되어 전달되고, 연산을 통해 현재의 노드값이 산출된다. 이러한 과정을 반복하여, 제k 은닉계층 (HLk)의 복수의 제k 은닉노드(hk1 ~ hkl)의 복수의 제k 은닉노드값을 산출할 수 있다. 복수의 출력노드(o1~on) 각각은 제k 은닉계층(HLk)의 복수의 제k 은닉노드(hk1 ~ hkl)의 복수(l개)의 제k 은닉 노드값에 가중치 w=[w1, w2, … , wl]가 적용된 값을 입력받고(점선으로 표시), 입력된 값을 모두 합산한 후, 합산된 값에 대해 활성화함수에 따른 연산을 수행하여 출력값을 산출한다. 출력층(OL)의 n개의 출력노드(o1~on) 각각은 피드백을 나타내는 정보 즉, 경고, 휴식 권고, 스트레칭 권고, 산업기계 중단 등에 대응할 수 있다. 이상 본 발명을 몇 가지 바람직한 실시예를 사용하여 설명하였으나, 이들 실시예는 예시적인 것이며 한정적인"}
{"patent_id": "10-2020-0171834", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "것이 아니다. 이와 같이, 본 발명이 속하는 기술분야에서 통상의 지식을 지닌 자라면 본 발명의 사상과 첨부된 특허청구범위에 제시된 권리범위에서 벗어나지 않으면서 균등론에 따라 다양한 변화와 수정을 가할 수 있음을 이해할 것이다."}
{"patent_id": "10-2020-0171834", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 산업용 스트레스 분석 시스템의 구성을 나타낸 블록도이다. 도 2는 본 발명의 실시예에 따른 장갑의 구성의 내부 구성을 나타낸 블록도이다. 도 3은 본 발명의 실시예에 따른 장갑의 외형을 나타내기 위한 도면이다. 도 4는 본 발명의 실시예에 따른 피드백 장치의 내부 구성을 나타낸 블록도이다. 도 5는 본 발명의 실시예에 따른 심층신경망(DNN)의 구성을 설명하기 위한 도면이다."}
