{"patent_id": "10-2022-0147211", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0067179", "출원번호": "10-2022-0147211", "발명의 명칭": "초실감 로코모션 플랫폼 서비스 제공 방법 및 장치", "출원인": "주식회사 페이크아이즈", "발명자": "김석중"}}
{"patent_id": "10-2022-0147211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "초실감 콘텐츠를 플랫폼에 업로드하는 단계;상기 콘텐츠를 검수하는 단계;상기 콘텐츠를 상기 플랫폼에서 사용자 단말에 노출하는 단계;상기 사용자 단말로부터 상기 콘텐츠에 대한 이용 요청을 수신하는 단계; 및상기 사용자 단말에 상기 콘텐츠를 제공하는 단계를 포함하는, 초실감 로코모션 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0147211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 콘텐츠를 제공하는 단계 후,상기 콘텐츠에 대한 사용자의 경험에 기초하여, 인공지능 학습 데이터를 이용한 코칭 정보를 생성하는 단계; 및상기 사용자 단말에 상기 코칭 정보를 제공하는 단계를 포함하고,상기 인공지능 학습 데이터는,모든 사용자의 상기 콘텐츠에 대한 사용자 경험 및 상기 콘텐츠의 올바른 이용 방법에 대하여 학습한 데이터를포함하는, 초실감 로코모션 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0147211", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 콘텐츠를 제공하는 단계 후,상기 콘텐츠를 다른 사용자들과 함께 즐길 수 있도록 공유 방을 생성하는 단계; 및상기 사용자 및 상기 다른 사용자들에게 멀티플레이 서비스를 제공하는 단계를 포함하는, 초실감 로코모션 플랫폼 서비스 제공 방법."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "초실감 로코모션 플랫폼 서비스 제공 방법이 개시된다. 본 발명의 일 실시예에 따른 초실감 로코모션 플랫폼 서 비스 제공 방법은 초실감 콘텐츠를 플랫폼에 업로드하는 단계, 상기 콘텐츠를 검수하는 단계, 상기 콘텐츠를 상 기 플랫폼에서 사용자 단말에 노출하는 단계, 상기 사용자 단말로부터 상기 콘텐츠에 대한 이용 요청을 수신하는 단계 및 상기 사용자 단말에 상기 콘텐츠를 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 초실감 로코모션 플랫폼 서비스 제공 방법에 관한 것이다."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이하에 기술되는 내용은 단순히 본 발명에 따른 일 실시예와 관련되는 배경 정보만을 제공할 뿐 종래기술을 구 성하는 것은 아니다. 최근 스크린 골프, 스크린 야구 등 실내 체육시설에서 실감형 실내스포츠를 즐기는 사람들이 늘어나고 있다. 이 러한 실내스포츠는 계절, 기후 및 공간의 제약을 극복하여 스포츠를 즐길 수 있는 장점이 있다. 그러나 제공되는 콘텐츠는 한정되어 있으며, 이를 즐기는 사용자들은 더 높은 만족도를 원할 수 있다. 따라서, 다양한 콘텐츠를 지속적으로 제공하면서, 사용자들에게 더 높은 만족도를 제공할 수 있는 초실감형 실내스포츠콘텐츠 제공 서비스가 요구된다."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 초실감 로코모션 플랫폼 서비스를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일 실시예에 따른 초실감 로코모션 플랫폼 서비스 제공 방법은 초실감 콘텐츠를 플랫폼에 업로드하는 단계, 상기 콘텐츠를 검수하는 단계, 상기 콘텐츠를 상기 플랫폼에서 사용자 단 말에 노출하는 단계, 상기 사용자 단말로부터 상기 콘텐츠에 대한 이용 요청을 수신하는 단계 및 상기 사용자 단말에 상기 콘텐츠를 제공하는 단계를 포함할 수 있다. 상기 콘텐츠를 제공하는 단계 후, 상기 콘텐츠에 대한 사용자의 경험에 기초하여, 인공지능 학습 데이터를 이용 한 코칭 정보를 생성하는 단계 및 상기 사용자 단말에 상기 코칭 정보를 제공하는 단계를 포함하고, 상기 인공 지능 학습 데이터는 모든 사용자의 상기 콘텐츠에 대한 사용자 경험 및 상기 콘텐츠의 올바른 이용 방법에 대하 여 학습한 데이터를 포함할 수 있다. 상기 콘텐츠를 제공하는 단계 후, 상기 콘텐츠를 다른 사용자들과 함께 즐길 수 있도록 공유 방을 생성하는 단 계 및 상기 사용자 및 상기 다른 사용자들에게 멀티플레이 서비스를 제공하는 단계를 포함할 수 있다."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 초실감 로코모션 플랫폼 서비스를 제공할 수 있다."}
{"patent_id": "10-2022-0147211", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성 요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일 실시예에 따른 서비스 플랫폼을 나타낸 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 서비스 플랫폼은 PC Web 또는 모바일 Web 서비스 포털 시스템을 통해 사용자에게 콘텐츠 및 서비스를 안내할 수 있다. 또한, 사용자용 통합 런처(Launcher)를 이용하여 사용자의 회원가입, 로그인, 결제, 콘텐츠 연동 및 설치를 실 행할 수 있다. 사용자는 콘텐츠가 설치되면 초실감 콘텐츠를 이용할 수 있다. 이 때, 초실감 콘텐츠는 복수의 콘텐츠를 포함할 수 있고, 서비스 가능한 콘텐츠가 지속적으로 추가될 수 있다. 서비스 플랫폼은 콘텐츠 배포 및 스트리밍을 위한 CDN(Content Delivery Network)를 포함할 수 있다. 또한, 사용자 관리 및 통계 관리를 위해 Admin(관리자) 및 콘텐츠 관리용 CMS(Content Management System)을 포함할 수 있다. 그리고, 사용자 정보 및 통계 데이터 수집을 위한 SDK(Software Development Kit)을 포함하고, 콘텐츠 정보 연 계를 위한 API(Application Programming Interface)를 포함하고, 서비스 운영을 위한 클라우드 환경을 구성할 수 있다. 도 2는 본 발명의 일 실시예에 따른 고도화된 로코모션 플랫폼을 나타낸 도면이다. 도 2를 참조하면, 본 발명의 일 실시예에 따른 초실감 로코모션 플랫폼은 CDN 서버를 통한 콘텐츠 업데이트 기 능을 포함할 수 있다. 이는 로코모션 장치에 대한 콘텐츠를 개발하는 경우, 즉시 로코모션 플랫폼에 적용할 수 있는 장점이 있다. 도 3은 본 발명의 일 실시예에 따른 초실감 로코모션 플랫폼 서비스에서 인공지능 코칭 방법을 나타낸 도면이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 인공지능 코칭 방법은 사용자의 스포츠 콘텐츠 플레이 정보와 모 션 스테이터스 정보를 학습하여 보다 운동 효과를 높이고 정확한 동작을 취할 수 있도록 인공지능을 이용한 코 칭 정보를 제공할 수 있다. 카메라 비전을 기반으로 인공지능 모션인식 및 분석을 통해 콘텐츠 코스 안내 및 콘텐츠 플레이 방식에 대한 조 언을 제공할 수 있다. 이를 통해, 사용자는 정확한 동작으로 콘텐츠를 이용할 수 있고 더 나은 만족도를 느낄 수 있다. 일 실시예에 따르면, 초실감 로코모션 플랫폼 서비스 제공 방법은 먼저, 초실감 콘텐츠를 플랫폼에 업로드할 수 있다. 다음으로, 상기 콘텐츠를 검수할 수 있다. 다음으로, 상기 콘텐츠를 상기 플랫폼에서 사용자 단말에 노출할 수 있다. 다음으로, 상기 사용자 단말로부터 상기 콘텐츠에 대한 이용 요청을 수신할 수 있다. 다음으로, 상기 사용자 단말에 상기 콘텐츠를 제공할 수 있다. 일 실시예에 따르면, 초실감 로코모션 플랫폼 서비스 제공 방법은 상기 콘텐츠를 제공하는 단계 후, 상기 콘텐 츠에 대한 사용자의 경험에 기초하여, 인공지능 학습 데이터를 이용한 코칭 정보를 생성할 수 있다. 다음으로, 상기 사용자 단말에 상기 코칭 정보를 제공할 수 있다. 여기서, 상기 인공지능 학습 데이터는 모든 사용자의 상기 콘텐츠에 대한 사용자 경험 및 상기 콘텐츠의 올바른 이용 방법에 대하여 학습한 데이터를 포함할 수 있다. 일 실시예에 따르면, 초실감 로코모션 플랫폼 서비스 제공 방법은 상기 콘텐츠를 제공하는 단계 후, 상기 콘텐 츠를 다른 사용자들과 함께 즐길 수 있도록 공유 방을 생성할 수 있다. 다음으로, 상기 사용자 및 상기 다른 사용자들에게 멀티플레이 서비스를 제공할 수 있다. 일 실시예에 따르면, 초실감 로코모션 플랫폼 서비스는 5G를 기반으로 하여 다수의 사용자들이 멀티플레이를 즐 길 수 있도록 지원할 수 있다. 유선 또는 무선 네트워크를 활용하여 서버를 경유하여 각 탑승장치를 네트워크상에 연동하고 이를 토대로 1대1 혹은 다대다 멀티플레이 콘텐츠를 지원할 수 있다. 본 발명에서 설명하는 특정 실행들은 일 실시예들로서, 어떠한 방법으로도 본 발명의 범위를 한정하는 것은 아 니다. 명세서의 간결함을 위하여, 종래 전자적인 구성들, 제어 시스템들, 소프트웨어, 상기 시스템들의 다른 기 능적인 측면들의 기재는 생략될 수 있다. 또한, 도면에 도시된 구성 요소들 간의 선들의 연결 또는 연결 부재들 은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것으로서, 실제 장치에서는 대체 가 능하거나 추가의 다양한 기능적인 연결, 물리적인 연결, 또는 회로 연결들로서 나타내어질 수 있다. 또한, \"필 수적인\", \"중요하게\" 등과 같이 구체적인 언급이 없다면 본 발명의 적용을 위하여 반드시 필요한 구성 요소가 아닐 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다."}
{"patent_id": "10-2022-0147211", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 서비스 플랫폼을 나타낸 도면이다. 도 2는 본 발명의 일 실시예에 따른 고도화된 로코모션 플랫폼을 나타낸 도면이다. 도 3은 본 발명의 일 실시예에 따른 초실감 로코모션 플랫폼 서비스에서 인공지능 코칭 방법을 나타낸 도면이다."}
