{"patent_id": "10-2023-0111003", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0031024", "출원번호": "10-2023-0111003", "발명의 명칭": "복수의 센서를 이용한 공기청정기 및 이를 구비하는 환경모니터링시스템", "출원인": "(주)대경일렉", "발명자": "안솔"}}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "함체형태로 제공되는 본체부;상기 본체부의 내부에 구비되는 복수의 유해가스 센서모듈을 통해 복수의 유해가스를 검출하고, 상기 검출된 복수의 유해가스에 대응하는 유해가스 측정결과를 제공하는 유해정보획득부;상기 본체부의 내부에 구비되는 복수의 환경센서모듈을 통해 온도 및 습도를 포함하는 환경정보를 검출하고, 상기 검출된 환경정보에 대응하는 환경정보 측정결과를 제공하는 환경정보획득부;상기 본체부의 내부에 구비되어 상기 유해가스 측정결과 및 환경정보 측정결과를 제공받아 기 설정된 기준값 범위와 비교한 후, 상기 기준값 범위를 벗어나는 경우 공기순환을 위한 송풍제어신호를 제공하는 제어부;상기 제어부로부터 제공되는 표시제어신호에 따라 상기 유해가스 측정결과 및 환경정보 측정결과를 표시하는 디스플레이부;상기 본체부의 내부에 구비되어 외부공기를 내부로 유입시킨 후 청정공기를 외부로 배출하는 송풍부; 및상기 송풍부의 공기유로 상에 구비되어 상기 외부공기의 여과 및 정화를 통해 상기 청정공기로 변화시키는 필터부;를 포함하는 복수의 센서를 이용한 공기청정기."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 제어부의 제어에 따라 상기 복수의 센서를 이용한 공기청정기에서 발생되는 모니터링정보를 환경모니터링서버로 전송하는 통신모듈부;를 더 포함하는 복수의 센서를 이용한 공기청정기."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1 또는 2에 있어서,상기 유해정보획득부는,이산화탄소(CO2), 일산화탄소(CO), 황화수소(H2S), 암모니아(NH3), 휘발성유기화합물(VOC) 및 메탄(CH4)을 측정하는 상기 복수의 유해가스 센서모듈을 구비하는복수의 센서를 이용한 공기청정기."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 환경정보획득부는,상기 온도, 상기 습도, 초미세먼지(PM2.5) 및 미세먼지(PM10)를 측정하는 상기 복수의 환경센서모듈을 구비하는공개특허 10-2025-0031024-3-복수의 센서를 이용한 공기청정기."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서,상기 송풍부는,BLDC 모터 기반의 송풍팬을 구비하여 상기 외부공기를 상기 본체부의 내부로 유입시키고, 상기 필터부를 통해정화된 상기 청정공기를 상기 본체부의 외부로 배출시키는복수의 센서를 이용한 공기청정기."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서,상기 필터부는,적어도 하나의 HEPA필터 및 적어도 하나의 활성탄필터를 포함하는복수의 센서를 이용한 공기청정기."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 상기 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되는 모니터링정보를 전송하는 공기청정기;상기 공기청정기로부터 전송되는 상기 모니터링정보를 수신하여 저장 및 관리하되, 기 설정된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하는 환경모니터링서버;상기 환경모니터링서버로부터 전송되는 상기 경보알림신호에 따라 위험경보를 제공하는 관리자단말기; 및상기 공기청정기, 환경모니터링서버 및 관리자단말기 상호 간의 통신환경을 제공하는 통신망;을 포함하는 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 공기청정기는,함체형태로 제공되는 본체부;상기 본체부의 내부에 구비되는 상기 복수의 유해가스 센서모듈을 통해 복수의 유해가스를 검출하고, 상기 검출된 복수의 유해가스에 대응하는 유해가스 측정결과를 제공하는 유해정보획득부;상기 본체부의 내부에 구비되는 상기 복수의 환경센서모듈을 통해 온도 및 습도를 포함하는 환경정보를 검출하고, 상기 검출된 환경정보에 대응하는 환경정보 측정결과를 제공하는 환경정보획득부;상기 본체부의 내부에 구비되어 상기 유해가스 측정결과 및 환경정보 측정결과를 제공받아 기 설정된 기준값 범위와 비교한 후, 상기 기준값 범위를 벗어나는 경우 공기순환을 위한 송풍제어신호를 제공하는 제어부;상기 제어부로부터 제공되는 표시제어신호에 따라 상기 유해가스 측정결과 및 환경정보 측정결과를 표시하는 디스플레이부;공개특허 10-2025-0031024-4-상기 본체부의 내부에 구비되어 외부공기를 내부로 유입시킨 후 청정공기를 외부로 배출하는 송풍부; 및상기 송풍부의 공기유로 상에 구비되어 상기 외부공기의 여과 및 정화를 통해 상기 청정공기로 변화시키는 필터부;를 포함하는 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서,상기 환경모니터링서버는,상기 공기청정기와 관련된 각종 기기정보와 상기 모니터링정보를 저장하는 환경정보데이터베이스를 구비하는복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템."}
{"patent_id": "10-2023-0111003", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 7 내지 청구항 9 중 어느 한 항에 있어서,상기 설치공간에 구비되어 상기 공기청정기로부터 전송되는 경보알람 제어신호 또는 상기 환경모니터링서버로부터 전송되는 상기 경보알림신호에 따라 시각경보 및 청각경보를 출력하는 경보장치;를 더 포함하는 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템."}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 복수의 센서를 이용한 공기청정기 및 이를 구비하는 환경모니터링시스템에 관한 것으로, 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 상기 설치공간의 공기를 순환 시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되는 모니터링정보를 전송하는 (뒷면에 계속)"}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 공기 청정기를 통해 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되 는 모니터링정보를 전송하고, 이 모니터링정보를 환경모니터링서버에서 수신하여 저장 및 관리하되, 기 설정된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하며, 경보알림신호에 따라 위험경보를 관리자단말기 및 설치공간에 구비되는 경보장치를 통해 제공함으로써, 산업현장, 농가 등에서 간편하게 설치하여 각종 유해가스 를 감지하여 경보알림을 제공할 뿐만 아니라 설치공간 내부의 공기를 순환시키거나 배출시킬 수 있으면서 설치 공간에 대한 유해정보와 환경정보를 지속적으로 모니터링하여 관리할 수 있는 복수의 센서를 이용한 공기청정기 및 이를 구비하는 환경모니터링시스템에 관한 것이다."}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "잘 알려진 바와 같이, 세계보건기구는 2012년 실내외 공기 오염이 원인이 된 질병으로 숨진 사람이 세계적으로 700만 명에 이른다는 분석 결과를 내놓았으며, 실외보다 상대적으로 공기 순환이 잘 이루어지지 않을 뿐만 아니 라 협소한 공간이 많은 실내에서 공기 오염에 따른 건강 피해가 상대적으로 더 심각한 수준으로 알려져 있다. 현대사회는 지속적인 산업화로 대기오염이 악화되고 있으며, 2014년 기준 연간 800만 명이 대기질 오염으로 사 망하고 있으며, 국내의 경우 2000년대 중국의 급격한 성장과 국내의 화력발전소, 디젤자동차 등으로 미세먼지 관련 질병이 증가하고 있으며, 이에 따른 사회적 비용도 꾸준하게 증가하고 있다. 아울러, 좁은 공간에서 용접 작업 등과 같은 유해가스를 발생시키는 작업이 이루어지는 산업현장이나, 비닐하우 스와 같이 밀폐된 공간에서 작업을 하는 농촌에서는 공기 순환이 안되어 질식사고의 위험이 더욱 증가할 수밖에 없으며, 축산농가에서는 가축의 분뇨 등으로 인해 암모니타, 메탄가스 등과 같이 사람에게 유해한 가스가 발생 하는 문제점과 함께 악취로 인한 생활상 불편함이 가중되고 있다. 아울러, 2019년 이래로 유행한 코로나로 인해 공기에 대한 환기 문제 또한 그 중요성이 높아지고 있다. 상술한 바와 같은 상황에서 산업현장, 농가 등에서 간편하게 설치하여 각종 유해가스를 감지하여 경보알림을 제 공할 뿐만 아니라 설치공간 내부의 공기를 순환시키거나 배출시킬 수 있으면서 설치공간에 대한 유해정보와 환경정보를 지속적으로 모니터링하여 관리하기 위한 시스템의 구축이 요구되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 1. 한국공개특허 제10-2022-0139323호(2022.10.14.공개)"}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 공기 청정기를 통해 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되 는 모니터링정보를 전송하고, 이 모니터링정보를 환경모니터링서버에서 수신하여 저장 및 관리하되, 기 설정된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하며, 경보알림신호에 따라 위험경보를 관리자단말기 및 설치공간에 구비되는 경보장치를 통해 제공함으로써, 산업현장, 농가 등에서 간편하게 설치하여 각종 유해가스 를 감지하여 경보알림을 제공할 뿐만 아니라 설치공간 내부의 공기를 순환시키거나 배출시킬 수 있으면서 설치 공간에 대한 유해정보와 환경정보를 지속적으로 모니터링하여 관리할 수 있는 복수의 센서를 이용한 공기청정기 및 이를 구비하는 환경모니터링시스템을 제공하고자 한다. 본 발명의 실시예들의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아 래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 측면에 따르면, 함체형태로 제공되는 본체부; 상기 본체부의 내부에 구비되는 복수의 유해가스 센 서모듈을 통해 복수의 유해가스를 검출하고, 상기 검출된 복수의 유해가스에 대응하는 유해가스 측정결과를 제 공하는 유해정보획득부; 상기 본체부의 내부에 구비되는 복수의 환경센서모듈을 통해 온도 및 습도를 포함하는 환경정보를 검출하고, 상기 검출된 환경정보에 대응하는 환경정보 측정결과를 제공하는 환경정보획득부; 상기 본체부의 내부에 구비되어 상기 유해가스 측정결과 및 환경정보 측정결과를 제공받아 기 설정된 기준값 범위와 비교한 후, 상기 기준값 범위를 벗어나는 경우 공기순환을 위한 송풍제어신호를 제공하는 제어부; 상기 제어부 로부터 제공되는 표시제어신호에 따라 상기 유해가스 측정결과 및 환경정보 측정결과를 표시하는 디스플레이부; 상기 본체부의 내부에 구비되어 외부공기를 내부로 유입시킨 후 청정공기를 외부로 배출하는 송풍부; 및 상기 송풍부의 공기유로 상에 구비되어 상기 외부공기의 여과 및 정화를 통해 상기 청정공기로 변화시키는 필터부;를 포함하는 복수의 센서를 이용한 공기청정기가 제공될 수 있다. 또한, 본 발명의 일 측면에 따르면, 상기 제어부의 제어에 따라 상기 복수의 센서를 이용한 공기청정기에서 발 생되는 모니터링정보를 환경모니터링서버로 전송하는 통신모듈부;를 더 포함하는 복수의 센서를 이용한 공기청 정기가 제공될 수 있다. 또한, 본 발명의 일 측면에 따르면, 상기 유해정보획득부는, 이산화탄소(CO2), 일산화탄소(CO), 황화수소(H2S), 암모니아(NH3), 휘발성유기화합물(VOC) 및 메탄(CH4)을 측정하는 상기 복수의 유해가스 센서모듈을 구비하는 복 수의 센서를 이용한 공기청정기가 제공될 수 있다. 또한, 본 발명의 일 측면에 따르면, 상기 환경정보획득부는, 상기 온도, 상기 습도, 초미세먼지(PM2.5) 및 미세 먼지(PM10)를 측정하는 상기 복수의 환경센서모듈을 구비하는 복수의 센서를 이용한 공기청정기가 제공될 수 있 다. 또한, 본 발명의 일 측면에 따르면, 상기 송풍부는, BLDC 모터 기반의 송풍팬을 구비하여 상기 외부공기를 상기 본체부의 내부로 유입시키고, 상기 필터부를 통해 정화된 상기 청정공기를 상기 본체부의 외부로 배출시키는 복 수의 센서를 이용한 공기청정기가 제공될 수 있다. 또한, 본 발명의 일 측면에 따르면, 또한, 본 발명의 일 측면에 따르면, 상기 필터부는, 적어도 하나의 HEPA필 터 및 적어도 하나의 활성탄필터를 포함하는 복수의 센서를 이용한 공기청정기가 제공될 수 있다.본 발명의 다른 측면에 따르면, 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 상기 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되는 모니터링정보를 전송하는 공기청정기; 상기 공기청정기로부터 전송되는 상기 모니터링정보를 수신하여 저장 및 관리하되, 기 설정된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하는 환경모니터링서버; 상 기 환경모니터링서버로부터 전송되는 상기 경보알림신호에 따라 위험경보를 제공하는 관리자단말기; 및 상기 공 기청정기, 환경모니터링서버 및 관리자단말기 상호 간의 통신환경을 제공하는 통신망;을 포함하는 복수의 센서 를 이용한 공기청정기를 구비하는 환경모니터링시스템이 제공될 수 있다. 또한, 본 발명의 다른 측면에 따르면, 상기 공기청정기는, 함체형태로 제공되는 본체부; 상기 본체부의 내부에 구비되는 상기 복수의 유해가스 센서모듈을 통해 복수의 유해가스를 검출하고, 상기 검출된 복수의 유해가스에 대응하는 유해가스 측정결과를 제공하는 유해정보획득부; 상기 본체부의 내부에 구비되는 상기 복수의 환경센서 모듈을 통해 온도 및 습도를 포함하는 환경정보를 검출하고, 상기 검출된 환경정보에 대응하는 환경정보 측정결 과를 제공하는 환경정보획득부; 상기 본체부의 내부에 구비되어 상기 유해가스 측정결과 및 환경정보 측정결과 를 제공받아 기 설정된 기준값 범위와 비교한 후, 상기 기준값 범위를 벗어나는 경우 공기순환을 위한 송풍제어 신호를 제공하는 제어부; 상기 제어부로부터 제공되는 표시제어신호에 따라 상기 유해가스 측정결과 및 환경정 보 측정결과를 표시하는 디스플레이부; 상기 본체부의 내부에 구비되어 외부공기를 내부로 유입시킨 후 청정공 기를 외부로 배출하는 송풍부; 및 상기 송풍부의 공기유로 상에 구비되어 상기 외부공기의 여과 및 정화를 통해 상기 청정공기로 변화시키는 필터부;를 포함하는 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시 스템이 제공될 수 있다. 또한, 본 발명의 다른 측면에 따르면, 상기 환경모니터링서버는, 상기 공기청정기와 관련된 각종 기기정보와 상 기 모니터링정보를 저장하는 환경정보데이터베이스를 구비하는 복수의 센서를 이용한 공기청정기를 구비하는 환 경모니터링시스템이 제공될 수 있다. 또한, 본 발명의 다른 측면에 따르면, 상기 설치공간에 구비되어 상기 공기청정기로부터 전송되는 경보알람 제 어신호 또는 상기 환경모니터링서버로부터 전송되는 상기 경보알림신호에 따라 시각경보 및 청각경보를 출력하 는 경보장치;를 더 포함하는 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템이 제공될 수 있 다."}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해측정된 측정결과에 따라 공기 청정기를 통해 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되 는 모니터링정보를 전송하고, 이 모니터링정보를 환경모니터링서버에서 수신하여 저장 및 관리하되, 기 설정된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하며, 경보알림신호에 따라 위험경보를 관리자단말기 및 설치공간에 구비되는 경보장치를 통해 제공함으로써, 산업현장, 농가 등에서 간편하게 설치하여 각종 유해가스 를 감지하여 경보알림을 제공할 뿐만 아니라 설치공간 내부의 공기를 순환시키거나 배출시킬 수 있으면서 설치 공간에 대한 유해정보와 환경정보를 지속적으로 모니터링하여 관리할 수 있다."}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 실시예들에 대한 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후 술되어 있는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하"}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되 는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다.본 발명의 실시예들을 설명함에 있어서 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요 하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명의 실시예에서의 기능을 고려하여 정의된 용어들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내용을 토대로 내려져야 할 것이다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기의 블록구성도이고, 도 2는 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기의 상세구성을 설명하기 위한 도면이다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기는 본체부, 유해정보획득부, 환경정보획득부, 제어부, 디스플레이부, 송풍부, 필터부, 통신 모듈부 등을 포함할 수 있다. 본체부는 함체형태로 제공되는 구성부로, 예를 들면, 도 4에 도시한 바와 같이 교실, 공장, 비닐하우스, 축사 등을 포함하는 설치장소(설치공간)에 안정적으로 설치 및 작동시키기 위해 상하길이가 좌우길이보다 긴 직 사각형 함체형태로 제공될 수 있다. 이러한 본체부의 내부에는 유해정보획득부, 환경정보획득부, 제어부, 송풍부, 필터부 , 통신모듈부 등의 구성부가 상호 간 간섭이 없도록 배치될 수 있으며, 디스플레이부는 현재 측 정된 유해가스 측정결과와 환경정보 측정결과를 빠르게 인식하도록 전면에 구비될 수 있다. 유해정보획득부는 본체부의 내부에 구비되는 복수의 유해가스 센서모듈을 통해 복수의 유해가스를 검 출하고, 검출된 복수의 유해가스에 대응하는 유해가스 측정결과를 제공하는 구성부로, 예를 들면, 이산화탄소 (CO2), 일산화탄소(CO), 황화수소(H2S), 암모니아(NH3), 휘발성유기화합물(VOC) 및 메탄(CH4)을 측정하는 복수 의 유해가스 센서모듈을 구비할 수 있다. 여기에서, 이산화탄소(CO2)의 경우 이산화탄소가 흡수하는 특정 적외선 파장을 검출하여 이산화탄소를 감지 및 측정하는 적외선(IR) 가스분석 방식을 구현하는 센서모듈을 구비할 수 있다. 일산화탄소(CO)의 경우 일산화탄소가 흡수하는 특정 적외선 파장을 검출하여 일산화탄소를 감지 및 측정하는 적 외선(IR) 가스분석 방식, 혹은 일산화탄소 분자와 전기화학 반응을 통해 발생하는 전류나 전압 변화를 통해 일 산화탄소를 감지 및 측정하는 전기 화학적 방식을 구현하는 센서모듈을 구비할 수 있다. 황화수소(H2S)의 경우 황화수소 분자와 전기화학 반응을 통해 발생하는 전류나 전압 변화를 통해 황화수소를 감 지 및 측정하는 전기 화학적 방식을 구현하는 센서모듈을 구비할 수 있다. 암모니아(NH3)의 경우 암모니아 분자와 전기화학 반응을 통해 발생하는 전류나 전압 변화를 통해 암모니아를 감 지 및 측정하는 전기 화학적 방식을 구현하는 센서모듈을 구비할 수 있다. 휘발성유기화합물(VOC)의 경우 휘발성유기화합물이 흡수하는 특정 적외선 파장을 검출하여 휘발성유기화합물을 감지 및 측정하는 적외선(IR) 가스분석 방식, 혹은 휘발성유기화합물 분자와 전기화학 반응을 통해 발생하는 전 류나 전압 변화를 통해 휘발성유기화합물을 감지 및 측정하는 전기 화학적 방식을 구현하는 센서모듈을 구비할 수 있다. 메탄(CH4)의 경우 메탄 분자가 흡수하는 특정 적외선 파장을 검출하여 메탄을 감지 및 측정하는 적외선(IR) 가 스분석 방식, 혹은 메탄 분자와 전기화학 반응을 통해 발생하는 전류나 전압 변화를 통해 메탄을 감지 및 측정 하는 전기 화학적 방식을 구현하는 센서모듈을 구비할 수 있다. 상술한 바와 같은 유해정보획득부는 제어부로부터 측정제어신호가 제공될 경우 실시간으로 또는 기 설정된 주기(예를 들면, 1시간, 3시간 등)에 따라 설치장소(설치공간) 내부의 각종 유해가스를 복수의 유해가스 센서모듈을 통해 각각 측정한 후, 그 유해가스 측정결과를 제어부로 전달할 수 있다. 환경정보획득부는 본체부의 내부에 구비되는 복수의 환경센서모듈을 통해 온도 및 습도를 포함하는 환경정보를 검출하고, 검출된 환경정보에 대응하는 환경정보 측정결과를 제공하는 구성부로, 예를 들면, 온도, 습도, 초미세먼지(PM2.5) 및 미세먼지(PM10)를 측정하는 복수의 환경센서모듈을 구비할 수 있다. 여기에서, 온도의 경우 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기에 적용할 수 있도록 예를 들면, 저항온도계, 적외선온도계, 열파전도체온도계, 유체확장온도계, 초음파온도계 등에서 선택된 어느하나의 방식을 구현하는 센서모듈을 구비할 수 있다. 습도의 경우 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기에 적용할 수 있도록 예를 들면, 습도센서, 형광습도계, 하카오 온도 및 습도계, 비접촉식 적외선습도계, 화학흡수습도계 등에서 선택된 어느 하나의 방식을 구현하는 센서모듈을 구비할 수 있다. 초미세먼지(PM2.5)와 미세먼지(PM10)의 경우 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기 에 적용할 수 있도록 예를 들면, 레이저입자센서, 베타굴절미세먼지측정기, 집진필터 및 가중필터 등에서 선택된 어느 하나의 방식을 구현하는 센서모듈을 구비할 수 있다. 상술한 바와 같은 환경정보획득부는 제어부로부터 측정제어신호가 제공될 경우 실시간으로 또는 기 설정된 주기(예를 들면, 1시간, 3시간 등)에 따라 설치장소(설치공간) 내부의 각종 환경정보를 복수의 환경센서 모듈을 통해 각각 측정한 후, 그 환경정보 측정결과를 제어부로 전달할 수 있다. 제어부는 본체부의 내부에 구비되어 유해가스 측정결과 및 환경정보 측정결과를 제공받아 기 설정된 기준값 범위와 비교한 후, 기준값 범위를 벗어나는 경우 공기순환을 위한 송풍제어신호를 제공하는 구성부로, 제어보드로 구현하여 본체부의 내부에 장착될 수 있다. 이러한 제어부는 실시간 또는 기 설정된 주기에 따라 각종 유해가스와 각종 환경정보를 측정하기 위한 측 정제어신호를 유해정보획득부 및 환경정보획득부에 제공하고, 이에 대응하여 유해정보획득부로 부터 전달되는 유해가스 측정결과와 환경정보획득부로부터 전달되는 환경정보 측정결과를 기 설정된 기준 값 범위와 각각 비교한 후에, 각각의 측정값이 기 설정된 기준값 범위를 벗어나는 경우 공기순환을 위한 송풍제 어신호를 송풍부로 제공할 수 있다. 아울러, 제어부는 유해정보획득부로부터 전달되는 유해가스 측정결과와 환경정보획득부로부터 전달되는 환경정보 측정결과를 실시간 또는 기 설정된 주기에 따라 표시하기 위한 표시제어신호를 디스플레이부 로 제공할 수 있다. 또한, 제어부는 각각의 측정값이 기 설정된 기준값 범위를 벗어나는 경우 그 위험을 알리는 경보알람을 출 력하도록 통신망을 통해 접속된 별도의 경보장치로 경보알람 제어신호를 통신모듈부를 통해 전송할 수 있 으며, 이러한 경보알람을 비롯하여 공기청정기에 대한 각종 기기정보(예를 들면, 기기고유번호, 설치장소 등)와 모니터링정보(예를 들면, 유해가스 측정결과, 환경측정결과, 유해가스 또는 환경 경고 여부, 경고항목, 위험항 목 등)를 통신망을 통해 접속된 환경모니터링서버에 전송하도록 제어할 수 있다. 여기에서, 제어부는 모니터링정보를 제공할 경우 복수의 유해가스 및 복수의 환경정보 중에서 기준값 범위 를 벗어나는 항목에 대한 정보를 함께 전송할 수 있으며, 기준값 범위에서 ±10-20 % 범위만큼 벗어나는 경우 경고상태로 판단할 수 있고, 기준값 범위에서 ±20 % 이상인 범위만큼 벗어나는 경우 위험상태로 판단할 수 있 으며, 경고상태 또는 위험상태에 대응하는 동작 제어(예를 들면, 송풍세기 조절, 서로 다른 경보 알람 등)를 수 행할 수 있다. 한편, 제어부는 기 설정된 기준값 범위를 벗어난 상태에서 송풍부의 송풍동작을 제어하는 중에, 기 설정된 주기(예를 들면, 1시간, 3시간 등)보다 상대적으로 더 빠른 주기(예를 들면, 10분, 30분 등)에 따라 지 속적으로 유해정보획득부와 환경정보획득부를 통해 유해가스 측정결과와 환경정보 측정결과를 제공받 을 수 있으며, 복수의 유해가스와 복수의 환경정보 중 기준값 범위를 벗어나는 항목에 대해 다시 체크한 후에, 해당 항목이 기 설정된 기준값 범위 내로 측정될 경우에만 송풍부의 동작을 단계별로 감소시키는 동작 제 어를 수행할 수 있다. 예를 들면, 제어부는 해당 항목이 기 설정된 기준값 범위 내로 측정될 경우 현재 송풍세기보다 50 % 감소 된 송풍세기로 30 분동안 송풍하도록 동작 제어를 수행한 후에, 50 % 감소된 송풍세기보다 다시 50 % 감소된 송 풍세기로 30 분동안 송풍하도록 동작 제어를 수행하는 방식으로 단계별로 송풍부의 동작을 제어할 수 있다. 한편, 제어부는 필터부에 장착된 각종 필터의 수명정보를 저장해 둔 상태에서 해당 수명정보에 따른 시간이 전체수명 대비 5 % 이내인 경우 세척시기(또는 교체시기)를 알려주는 세척알람 표시제어신호(또는 교체 알람 표시제어신호)를 디스플레이부로 제공할 수 있다. 상술한 바와 같은 제어부는 이산화탄소(CO2)의 경우 350-1000 ppm의 범위를 안전범위로, 1000-2000 ppm의 범위를 경고범위로, 2000 ppm 이상의 범위를 위험범위로 하여 설정할 수 있고, 일산화탄소(CO)의 경우 15 ppm이내의 범위를 안전범위로, 15-50 ppm의 범위를 경고범위로, 50 ppm 이상의 범위를 위험범위로 하여 설정할 수 있으며, 황화수소(H2S)의 경우 3 ppm 이내의 범위를 안전범위로, 3-10 ppm의 범위를 경고범위로, 10 ppm 이상의 범위를 위험범위로 하여 설정할 수 있고, 암모니아(NH3)의 경우 25 ppm 이내의 범위를 안전범위로, 25-50 ppm의 범위를 경고범위로, 50 ppm 이상의 범위를 위험범위로 하여 설정할 수 있으며, 휘발성유기화합물(VOC)의 경우 0.1 ppm 이내의 범위를 안전범위로, 0.1-1 ppm의 범위를 경고범위로, 1 ppm 이상의 범위를 위험범위로 하여 설 정할 수 있고, 메탄(CH4)의 경우 500 ppm 이내의 범위를 안전범위로, 500-1000 ppm의 범위를 경고범위로, 1000 ppm 이상의 범위를 위험범위로 하여 설정할 수 있다. 또한, 제어부는 온도의 경우 20-26 ℃의 범위를 안전범위로, 15-20 ℃와 26-30 ℃를 경고범위로, 15 ℃ 미 만과 30 ℃ 초과를 위험범위로 하여 설정할 수 있고, 습도의 경우 30-60 %의 범위를 안전범위로, 10-30 %와 60- 80 %를 경고범위로, 10 % 미만과 80 % 초과를 위험범위로 하여 설정할 수 있으며, 초미세먼지(PM2.5)의 경우 24 시간 평균으로 25 ㎍/㎥ 이내의 범위를 안전범위로, 25-50 ㎍/㎥의 범위를 경고범위로, 50 ㎍/㎥ 이상의 범위를 위험범위로 하여 설정할 수 있고, 미세먼지(PM10)의 경우 24시간 평균으로 50 ㎍/㎥ 이내의 범위를 안전범위로, 50-80 ㎍/㎥의 범위를 경고범위로, 80 ㎍/㎥ 이상의 범위를 위험범위로 하여 설정할 수 있다. 디스플레이부는 제어부로부터 제공되는 표시제어신호에 따라 유해가스 측정결과 및 환경정보 측정결 과를 표시하는 구성부로, 예를 들면, 터치스크린, LCD디스플레이, OLED디스플레이 등을 이용하여 구비될 수 있 다. 예를 들면, 디스플레이부는 제어부의 제어에 따라 전달되는 유해가스 측정결과와 환경정보 측정결과 를 실시간 또는 기 설정된 주기에 따라 표시할 수 있는데, 예를 들면, 각종 유해가스 및 각종 환경정보의 각 항 목에 대응하여 위험(Danger), 경고(Warning), 안전(safety) 등으로 검출범위를 표시할 수 있고, 산소(O2), 일산 화탄소(CO), 이산화탄소(CO2), 가연성가스(EX), 황화수소(H2S), 초미세먼지(PM2.5) 등의 농도를 표시할 수 있다. 또한, 디스플레이부는 전력절감모드 여부, 필터세척 알람, 제거물질 종류(예를 들면, 용접홈, 부유먼지, 유해가스 등), 예약모드 설정(예를 들면, 시작시간, 종료시간 등), 송풍시간 표시, 흡입부 공기상태 표시, 송풍 세기 표시(예를 들면, 약, 중, 강 등), 절전모드 표시, 인공지능 여부 표시, UV 광촉매 사용여부 표시, 흡입작 동 여부, 전원 등의 각종 동작 제어에 관련된 정보를 표시할 수 있다. 한편, 제어부는 필터세척 알람을 통해 필터부에 장착된 각종 필터의 수명정보를 저장해 둔 상태에서 해당 수명정보에 따른 시간이 전체수명 대비 5 % 이내인 경우 세척시기(또는 교체시기)를 알려주는 세척알람 표 시제어신호(또는 교체알람 표시제어신호)를 디스플레이부로 제공할 수 있다. 송풍부는 본체부의 내부에 구비되어 외부공기를 내부로 유입시킨 후 청정공기를 외부로 배출하는 구 성부로, 예를 들어 BLDC 모터 기반의 송풍팬을 구비하여 외부공기를 본체부의 내부로 유입시키고, 필터부 를 통해 정화된 청정공기를 본체부의 외부로 배출시킬 수 있다. 이러한 송풍부는 제어부로부터 제공되는 공기순환을 위한 송풍제어신호에 따라 송풍팬을 작동시켜 본 체부의 내외부 공기를 순환시킬 수 있는데, 도 2의 우측 도면에 도시한 바와 같이 본체부의 하단부 전면 또는 측면에 구비되는 흡입구를 통해 본체부의 외부공기를 내부로 유입시키고, 공기유로에 따라 외부 공기를 유동시킨 후에, 정화된 청정공기를 본체부의 상부에 구비되는 배출구를 통해 배출시킬 수 있다. 여기에서, 송풍부는 제어부의 제어에 따라 위험, 경고 등의 단계별로 송풍세기를 서로 달리하여 송풍 동작을 수행할 수 있는데, 평상시에는 약세기로 동작하고, 위험상태에서는 강세기로 동작하며, 경고상태에서는 중세기로 동작할 수 있다. 이러한 약세기, 강세기, 중세기 등은 복수의 유해가스 및 복수의 환경정보에 대응하 는 각 항목별로 필요에 따라 적절하게 설정될 수 있다. 이러한 송풍부는 제어부로부터 단계별로 감소시키는 동작 제어신호가 제공될 경우 예를 들면, 현재 송풍세기보다 50 % 감소된 송풍세기로 30 분동안 송풍한 후에, 50 % 감소된 송풍세기보다 다시 50 % 감소된 송 풍세기로 30 분동안 송풍하는 방식으로 단계별로 본체부의 내외부 공기를 송풍 및 순환시킬 수 있다. 필터부는 송풍부의 공기유로 상에 구비되어 외부공기의 여과 및 정화를 통해 청정공기로 변화시키는 구성부로, 예를 들면, 적어도 하나의 HEPA(High Efficiency Particulate Air)필터 및 적어도 하나의 활성탄필 터를 포함할 수 있다. 이러한 필터부는 송풍부의 외부공기가 본체부의 내부에서 유동하는 공기유로 상에 장착될 수 있 으며, 외부공기에 포함된 각종 유해가스, 미세먼지 등을 여과 및 정화하는 역할을 수행할 수 있다. 예를 들면, 필터부는 적어도 하나의 HEPA필터 및 적어도 하나의 활성탄필터를 장착할 수 있는데, HEPA필터 는 먼지, 꽃가루, 곰팡이, 스포어 등의 미세한 입자와 미세먼지 및 초미세먼지를 필터링하여 제거할 수 있고, 활성탄필터는 휘발성유기화합물(VOC), 일산화탄소(CO), 아황산가스(H2S), 암모니아(NH3)와 같은 기체상 오염물 질을 흡착하여 제거할 수 있을 뿐만 아니라 습도를 일정 수준으로 조절할 수 있다. 또한, 필터부는 광촉매필터(Photocatalytic filter) 및 제올라이트필터(Zeolite filter)를 추가적으로 장 착할 수 있는데, 광촉매필터는 자외선 또는 빛을 이용하여 공기 중의 오염물질을 촉매반응을 통해 효과적으로 제거할 수 있으며, 제올라이트필터는 냄새와 휘발성유기화합물(VOC)을 흡착하여 효과적으로 제거할 수 있다. 통신모듈부는 제어부의 제어에 따라 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기 에서 발생되는 모니터링정보를 환경모니터링서버로 전송할 수 있다. 이러한 통신모듈부는 환경모니터링서버에 접속하기 위해 네트워킹되는 통신망에 대응하는 통신모듈을 구비 함으로써, 제어부의 제어에 따라 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기에 대 응하는 각종 기기정보 및 이를 통해 발생하는 각종 모니터링정보(예를 들면, 유해가스 측정결과, 환경측정결과, 유해가스 또는 환경 경고 여부, 경고항목, 위험항목 등)를 환경모니터링서버에 전송할 수 있다. 이러한 통신망은 예를 들면, 이동통신망, 유선인터넷통신망, 무선인터넷통신망, 방송망, 행정망 등을 포함할 수 있으며, 구체적으로 PAN(personal area network), LAN(local area network), CAN(campus area network), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷, LoRaWAN 등의 네트워크 중 하나 이상의 네트워크를 포함할 수 있고, 버스 네트워크, 스타 네트워크, 링 네트워크, 메쉬 네트 워크, 스타-버스 네트워크, 트리 네트워크, 계층적(hierarchical) 네트워크 등을 포함하는 네트워크 토폴로지 중 하나 이상을 포함할 수 있다. 따라서, 본 발명의 일 실시예에 따르면, 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 공기청정기를 통해 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되는 모니터링정보를 전송함으로써, 산업현장, 농가 등에서 간편하게 설치하여 각종 유해가스를 감지하여 설치공간 내부의 공기를 순환시키거나 배출시킬 수 있으면서 설치공간에 대한 유해정보와 환경정보를 지속적으로 모니터링하여 관리할 수 있다. 도 3은 본 발명의 다른 실시예에 따른 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템의 블록 구성도이다. 도 3을 참조하면, 본 발명의 다른 실시예에 따른 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시 스템은 공기청정기, 통신망, 환경모니터링서버, 관리자단말기, 경보장치 등을 포함할 수 있다. 공기청정기는 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 측정된 측정결과에 따라 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통해 발생되는 모니터 링정보를 전송하는 것으로, 본체부, 유해정보획득부, 환경정보획득부, 제어부, 디스플레이 부, 송풍부, 필터부, 통신모듈부 등을 포함할 수 있다. 이러한 공기청정기의 상세 구성은 본 발명의 일 실시예에서 상술한 바와 같이 구체적으로 상세하게 설명하 였으므로, 여기서는 생략하기로 한다. 통신망은 공기청정기, 환경모니터링서버 및 관리자단말기 상호 간의 통신환경을 제공하는 구성부로, 예를 들면, 이동통신망, 유선인터넷통신망, 무선인터넷통신망, 방송망, 행정망 등을 포함할 수 있으 며, 구체적으로 PAN(personal area network), LAN(local area network), CAN(campus area network), MAN(metropolitan area network), WAN(wide area network), BBN(broadband network), 인터넷, LoRaWAN 등의 네트워크 중 하나 이상의 네트워크를 포함할 수 있고, 버스 네트워크, 스타 네트워크, 링 네트워크, 메쉬 네트 워크, 스타-버스 네트워크, 트리 네트워크, 계층적(hierarchical) 네트워크 등을 포함하는 네트워크 토폴로지 중 하나 이상을 포함할 수 있다. 이러한 통신망을 통해 공기청정기, 환경모니터링서버 및 관리자단말기 상호 간의 통신환경 을 제공할 수 있을 뿐만 아니라, 경보장치와의 통신환경 또한 제공할 수 있다.환경모니터링서버는 공기청정기로부터 전송되는 모니터링정보를 수신하여 저장 및 관리하되, 기 설정 된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하는 서버로, 공기청정기와 관련된 각종 기기정 보와 모니터링정보를 저장하는 환경정보데이터베이스를 구비할 수 있다. 이러한 환경모니터링서버는 공기청정기로부터 각종 기기정보(예를 들면, 기기고유번호, 설치장소 등)와 모니터링정보(예를 들면, 유해가스 측정결과, 환경측정결과, 유해가스 또는 환경 경고 여부, 경고항목, 위험항목 등)를 수신한 후에, 이를 환경정보데이터베이스에 기기별, 설치장소별 등으로 데이터베이스화하 여 저장 관리할 수 있다. 또한, 환경모니터링서버는 모니터링정보를 체크하여 경보알림을 전송해야만 하는 상황이 발생할 경우 해당 기기정보에 대응하는 관리자정보(예를 들면, 단말기 휴대전화번호 등)를 추출한 후에, 해당 관리자단말기 로 팝업창, 문자메시지 등의 방식으로 경보알림메시지 등을 출력하도록 경보알림신호를 전송할 수 있다. 아울러, 환경모니터링서버는 모니터링정보를 체크하여 경보알림을 전송해야만 하는 상황이 발생할 경우 해 당 기기정보에 대응하는 경보장치정보(예를 들면, 경보장치 기기고유번호, 설치장소 등)를 추출한 후에, 해당 경보장치로 시각경보 및 청각경보를 출력하도록 경보알림신호를 전송할 수 있다. 관리자단말기는 환경모니터링서버로부터 전송되는 경보알림신호에 따라 위험경보를 제공하는 단말기 로서, 웹사이트, 환경모니터링앱 등을 통해 환경모니터링서버에 접속하여 공기청정기의 기기정보에 대응하여 관리자정보를 등록하고, 관리자로 등록된 상태에서 환경모니터링서버로부터 경보알림신호가 전송 될 경우 팝업창, 문자메시지 등의 방식으로 경보알림메시지 등을 출력할 수 있다. 경보장치는 설치공간에 구비되어 공기청정기로부터 전송되는 경보알람 제어신호 또는 환경모니터링서 버로부터 전송되는 경보알림신호에 따라 시각경보 및 청각경보를 출력하는 장치로서, 공기청정기로부 터 전송되는 경보알람 제어신호에 따라 경광등을 이용한 시각경보와 스피커를 이용한 청각경보를 출력할 수 있 다. 아울러, 경보장치는 환경모니터링서버로부터 전송되는 경보알림신호에 따라 경광등을 이용한 시각경 보와 스피커를 이용한 청각경보를 출력할 수 있다. 이러한 경보 출력은 공기청정기로부터 전송되는 경보알람 제어신호 또는 환경모니터링서버로부터 전 송되는 경보알림신호에 따라 수행되는 것으로 하여 설명하였으나, 어느 하나의 장치 결함으로 인한 오작동을 대 비하여 어느 하나만 수신되어도 출력할 수 있도록 설정할 수 있음은 물론이다. 따라서, 본 발명의 다른 실시예에 따르면, 설치공간에서 복수의 유해가스 센서모듈과 복수의 환경센서모듈을 통 해 측정된 측정결과에 따라 공기청정기를 통해 설치공간의 공기를 순환시키며, 복수의 유해가스 센서모듈과 복 수의 환경센서모듈을 통해 발생되는 모니터링정보를 전송하고, 이 모니터링정보를 환경모니터링서버에서 수신하 여 저장 및 관리하되, 기 설정된 경보기준값 범위를 벗어나는 경우 경보알림신호를 전송하며, 경보알림신호에 따라 위험경보를 관리자단말기 및 설치공간에 구비되는 경보장치를 통해 제공함으로써, 산업현장, 농가 등에서 간편하게 설치하여 각종 유해가스를 감지하여 경보알림을 제공할 뿐만 아니라 설치공간 내부의 공기를 순환시키 거나 배출시킬 수 있으면서 설치공간에 대한 유해정보와 환경정보를 지속적으로 모니터링하여 관리할 수 있다. 이상의 설명에서는 본 발명의 다양한 실시예들을 제시하여 설명하였으나 본 발명이 반드시 이에 한정되는 것은"}
{"patent_id": "10-2023-0111003", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "아니며, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면 본 발명의 기술적 사상을 벗어나지 않는 범 위 내에서 여러 가지 치환, 변형 및 변경이 가능함을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2023-0111003", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기의 블록구성도이고, 도 2는 본 발명의 일 실시예에 따른 복수의 센서를 이용한 공기청정기의 상세구성을 설명하기 위한 도면이며, 도 3은 본 발명의 다른 실시예에 따른 복수의 센서를 이용한 공기청정기를 구비하는 환경모니터링시스템의 블록 구성도이다."}
