{"patent_id": "10-2021-0164377", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0148042", "출원번호": "10-2021-0164377", "발명의 명칭": "블록체인 기반의 데이터 모델 생성 시스템", "출원인": "주식회사 에이젠글로벌", "발명자": "권찬영"}}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "블록체인 기반의 데이터 모델 생성 시스템으로서,블록체인망에 접속되어 소정의 데이터를 제공하는 하나 이상의 데이터 제공 노드;상기 블록체인망에 접속되어, 상기 데이터 제공 노드로부터 수신한 상기 데이터를 이용하여 데이터 분석 모델을생성하고, 상기 데이터 분석 모델을 통해 상기 데이터를 분석하는 모델 생성 노드; 및상기 블록체인망에 접속되어, 상기 모델 생성 노드가 생성한 상기 데이터 분석 모델을 사용하는 사용자 노드;를포함하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 모델 생성 노드는,상기 하나 이상의 데이터 제공 노드가 제공하는 상기 데이터가 결합되는 결합 공간을 포함하고,상기 하나 이상의 데이터 제공 노드는,상기 데이터가 상기 결합 공간에서 결합되도록 상기 데이터를 상기 모델 생성 노드로 전송하는 것인 블록체인기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 하나 이상의 데이터 제공 노드는,상기 결합 공간의 주소로 상기 데이터를 제공하되, 상기 결합 공간의 주소를 암호키로 이용하여 상기 데이터를암호화하여 제공하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 데이터 제공 노드는, 다른 데이터 제공 노드에서 제공하는 데이터와 자신의 데이터가 결합될 수 있는 결합조건 정보를 함께 제공하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 모델 생성 노드는,상기 블록체인망에서 미리 결정된 결합 조건이 충족되면, 수신한 상기 데이터를 복호화하여 상기 데이터 제공노드로부터 수신한 데이터를 상기 결합 조건에 기초하여 결합하는 것인 블록체인 기반의 데이터 모델 생성 시스템.공개특허 10-2021-0148042-3-청구항 6 제1항에 있어서,상기 모델 생성 노드는, 하나 이상의 상기 데이터 제공 노드로부터 수신된 데이터를 결합하여, 인공지능 학습을통한 학습 모델을 포함하는 분석 데이터를 생성하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 분석 데이터는, 상기 분석 데이터에 대한 정보와 상기 분석 데이터를 사용할 수 있는 사용 조건이 부여된상태로 상기 사용자 노드에 전송되는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 분석 데이터와 상기 사용자 노드의 상기 분석 데이터 사용 이력은, 상기 블록체인망에 공개되어 기록되는것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서,상기 사용자 노드는, 복수의 상기 데이터 제공 노드들 중에서, 상기 사용자가 원하는 데이터를 소유한 상기 데이터 제공 노드를 선택하되, 소정의 구간에 해당하는 상기 데이터를 특정하고,상기 데이터 제공 노드는, 상기 소정의 구간에 해당하는 상기 데이터만 선별되어 상기 모델 생성 노드에게 전송하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 사용자 노드는, 상기 데이터 분석 모델로부터 수신된 데이터를 상기 블록체인망에 제공하는 상기 데이터제공 노드의 역할도 수행가능한 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 데이터 제공 노드가 제공하는 데이터의 속성과 상기 모델 생성 노드가 생성하는 상기 데이터 분석 모델 속성을 제공하는 블록체인 관리 노드;를 더 포함하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "블록체인 기반의 데이터 모델 생성 시스템으로서,블록체인망에 접속되어 소정의 데이터를 제공하는 하나 이상의 데이터 제공 노드; 공개특허 10-2021-0148042-4-상기 블록체인망에 접속되어, 상기 데이터 제공 노드로부터 수신한 상기 데이터를 이용하여 데이터 분석 모델을생성하고, 상기 데이터 분석 모델을 통해 상기 데이터를 분석하는 모델 생성 노드; 및상기 데이터 제공 노드가 제공하는 데이터의 속성과 상기 모델 생성 노드가 생성하는 상기 데이터 분석 모델 속성을 제공하는 블록체인 관리 노드;를 포함하고,상기 모델 생성 노드는, 상기 데이터 제공 노드에 상기 데이터의 전송을 요청하거나,상기 데이터 제공 노드는, 상기 모델 생성 노드에 상기 데이터를 제공하며 상기 데이터 분석 모델의 생성을 요청하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 모델 생성 노드는,상기 하나 이상의 데이터 제공 노드가 제공하는 상기 데이터가 결합되는 결합 공간을 포함하고,상기 하나 이상의 데이터 제공 노드는,상기 데이터가 상기 결합 공간에서 결합되도록 상기 데이터를 상기 모델 생성 노드로 전송하는 것인 블록체인기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 데이터 제공 노드는, 다른 데이터 제공 노드에서 제공하는 데이터와 자신의 데이터가 결합될 수 있는 결합조건 정보를 함께 제공하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,상기 데이터 제공 노드는, 자신의 데이터와 결합시킬 데이터를 보유하는 다른 데이터 제공 노드에 대한 정보와,상기 데이터를 이용하여 상기 데이터 분석 모델을 생성할 상기 모델 생성 노드에 대한 정보를 암호화 하여, 상기 다른 데이터 제공 노드와, 상기 모델 생성 노드에 전송하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 모델 생성 노드는,수신한 상기 데이터를 복호화하고, 상기 블록체인망에서 미리 결정된 결합 조건이 충족되면 ,상기 데이터 제공노드로부터 수신한 데이터를 상기 결합 조건에 기초하여 결합하는 것인 블록체인 기반의 데이터 모델 생성 시스템."}
{"patent_id": "10-2021-0164377", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 모델 생성 노드는, 하나 이상의 상기 데이터 제공 노드로부터 수신된 데이터를 결합하여, 인공지능 학습을통한 학습 모델을 포함하는 분석 데이터를 생성하는 것인 블록체인 기반의 데이터 모델 생성 시스템.공개특허 10-2021-0148042-5-"}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "블록체인 기반의 데이터 모델 생성 시스템이 개시된다. 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모 델 생성 시스템은 블록체인망에 접속되어 소정의 데이터를 제공하는 하나 이상의 데이터 제공 노드, 상기 블록체 인망에 접속되어, 상기 데이터 제공 노드로부터 수신한 상기 데이터를 이용하여 데이터 분석 모델을 생성하고, 상기 데이터 분석 모델을 통해 상기 데이터를 분석하는 모델 생성 노드 및 상기 블록체인망에 접속되어, 상기 모 델 생성 노드를 통해 상기 데이터 분석 모델을 사용하는 사용자 노드를 포함한다."}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 블록체인 기반의 데이터 모델 생성 시스템에 관한 것이다. 보다 상세하게는, 블록체인망에 접속되어 데이터를 제공하고, 상기 블록체인망으로 데이터를 수신하여 상기 수신한 데이터를 이용해 분석 모델을 생성하 는 시스템에 관한 것이다."}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "데이터의 중요성은 날로 높아지고 있다. 서비스 제공자는 자사의 서비스를 이용하는 사용자의 개인 정보와 지역 성과 시간성이 포함되는 행동 기록을 데이터로 저장하고 있다. 최근에는 이렇게 서비스 제공자가 저장하는 데이 터를 인공 지능을 구축하는 것에 이용하고자 하는 움직임이 있다. 인공 지능은 일반적으로 데이터를 기계 학습 하여 구축하는데, 목적에 부합하는 인공 지능을 생성하기 위해서는 관련성 높은 데이터의 수집과 선별이 중요하 다. 또한, 인공 지능 또는 기계 학습을 통해 생성하는 예측 모델이 보다 정확하고 목적에 부합하려면, 다양한 케이스와 다양한 시간대에 관한 사용자의 행동 기록 데이터가 필요하다. 그러나 하나의 서비스 제공자는 보유할 수 있는 사용자에 관한 데이터는 한계가 있을 수 밖에 없다. 이에 따라 한 서비스 제공자의 데이터를 이용하기보단, 복수의 서비스 제공자가 보유하고 있는 다량의 데이터를 이용하여 인공 지능을 구축하는 것이 필수적이다. 복수의 서비스 제공자가 보유하는 데이터를 이용하여 인공 지 능을 구축하기 위해서는, 먼저 각 서비스 제공자가 보유하고 있는 데이터를 한 곳으로 결합해야 한다. 데이터 결합을 하려면 각 서비스 제공자의 서버에서 다른 서버로 데이터의 이동이 필수적이다. 그렇지만, 서비스 제공 자의 데이터는 각각의 목적에 따라 사용자의 동의에 따라 저장되므로 사용자 동의 없는 임의적인 데이터의 복제 및 전송은 엄격히 규제되고 있다. 또한, 데이터를 제공하는 데이터 제공자(서비스 제공자)는 각자의 이해관계 (경쟁사에 이용될 우려)에 따라 제공하고자 하는 데이터의 범위와 데이터의 가공 범위를 제한하고 싶어 한다. 따라서, 복수의 데이터 제공자가 보유한 데이터를 이용해 인공 지능을 구축하기 위해서는 각 사용자의 동의를 얻고, 데이터 제공자의 의도에 따라 데이터에 대한 제한이 가능하며, 사용자, 데이터 제공자, 데이터 가공자가 서로의 데이터 처리과정을 투명하게 볼 수 있는 기술이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1993293 B1 (2019.06.20.)"}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 해결하기 위한 것으로서, 블록체인망을 이용해 데이터를 결합하고 가공하므로 데이 터 제공자, 데이터 가공자 및 사용자에게 투명한 데이터 결합 내역 및 사용 내역을 공개할 수 있는 데이터 모델 생성 시스템을 제공하고자 한다. 또한, 데이터 이동 및 전송 시 발생할 수 있는 데이터 누출 사고를 예방하고, 누출되어도 안전한 데이터 모델 생성 시스템을 제공하고자 한다. 또한, 데이터 가공 목적에 따라 다수의 사용자 및 다수의 데이터 제공자의 동의 얻거나 또는 가공 권한을 부여 할 수 있는 데이터 모델 생성 시스템을 제공하고자 한다. 또한, 다양한 분야의 데이터 제공자와 통합 데이터를 이용한 인공지능 분석 모델 제공자, 이러한 통합 데이터의 분석 산출물들이 필요한 수요자들이 하나의 데이터 플랫폼에 참여하여, 그 이전에는 파편적인 데이터에서 얻는 분석에서 도출할 수 없었던 유의미한 분석 결과물을 산출해 비지니스 및 연구개발에 활용할 수 있는 데이터 모 델 생성 시스템을 제공하고자 한다.본 발명의 해결하고자 하는 과제들은 상술한 내용으로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템은, 블록체인망에 접속되어 소정의 데이 터를 제공하는 하나 이상의 데이터 제공 노드; 상기 블록체인망에 접속되어, 상기 데이터 제공 노드로부터 수신 한 상기 데이터를 이용하여 데이터 분석 모델을 생성하고, 상기 데이터 분석 모델을 통해 상기 데이터를 분석하 는 모델 생성 노드; 및 상기 블록체인망에 접속되어, 상기 모델 생성 노드를 통해 상기 데이터 분석 모델을 사 용하는 사용자 노드;를 포함할 수 있다. 또한, 상기 모델 생성 노드는, 상기 하나 이상의 데이터 제공 노드가 제공하는 상기 데이터가 결합되는 결합 공 간을 포함하고, 상기 하나 이상의 데이터 제공 노드는, 상기 데이터가 상기 결합 공간에서 결합되도록 상기 데 이터를 상기 모델 생성 노드로 전송할 수 있다. 또한, 상기 하나 이상의 데이터 제공 노드는, 상기 결합 공간의 주소로 상기 데이터를 제공하되, 상기 결합 공 간의 주소를 암호키로 이용하여 상기 데이터를 암호화하여 제공할 수 있다. *또한, 상기 데이터 제공 노드는, 다른 데이터 제공 노드에서 제공하는 데이터와 자신의 데이터가 결합될 수 있 는 결합 조건 정보를 함께 제공할 수 있다. 또한, 상기 모델 생성 노드는, 상기 블록체인망에서 미리 결정된 결합 조건이 충족되면, 수신한 상기 데이터를 복호화하여 상기 데이터 제공 노드로부터 수신한 데이터를 상기 결합 조건에 기초하여 결합할 수 있다. 또한, 상기 모델 생성 노드는, 하나 이상의 상기 데이터 제공 노드로부터 수신된 데이터를 결합하여, 인공지능 학습을 통한 학습 모델을 포함하는 분석 데이터를 생성할 수 있다. 또한, 상기 분석 데이터는, 상기 분석 데이터에 대한 정보와 상기 분석 데이터를 사용할 수 있는 사용 조건이 부여된 상태로 상기 사용자 노드에 전송될 수 있다. 또한, 상기 분석 데이터와 상기 사용자 노드의 상기 분석 데이터 사용 이력은, 상기 블록체인망에 공개되어 기 록될 수 있다. 또한, 상기 사용자 노드는, 복수의 상기 데이터 제공 노드들 중에서, 상기 사용자가 원하는 데이터를 소유한 상 기 데이터 제공 노드를 선택하되, 소정의 구간에 해당하는 상기 데이터를 특정하고, 상기 데이터 제공 노드는, 상기 소정의 구간에 해당하는 상기 데이터만 선별되어 상기 모델 생성 노드에게 전송할 수 있다. 또한, 상기 사용자 노드는, 상기 데이터 분석 모델로부터 수신된 상기 분석 데이터를 제공하는 하나의 데이터 제공 노드의 역할도 수행할 수 있다. 또한, 상기 데이터 제공 노드가 제공하는 데이터의 속성과 상기 모델 생성 노드가 생성하는 상기 데이터 분석 모델 속성을 제공하는 블록체인 관리 노드;를 더 포함할 수 있다. 본 발명의 일 실시예에 따른 블록체인 기반의 인공지능 모델 생성 시스템은, 블록체인망에 접속되어 소정의 데 이터를 제공하는 하나 이상의 데이터 제공 노드; 상기 블록체인망에 접속되어, 상기 데이터 제공 노드로부터 수 신한 상기 데이터를 이용하여 데이터 분석 모델을 생성하고, 상기 데이터 분석 모델을 통해 상기 데이터를 분석 하는 모델 생성 노드; 및 상기 데이터 제공 노드가 제공하는 데이터의 속성과 상기 모델 생성 노드가 생성하는 상기 데이터 분석 모델 속성을 제공하는 블록체인 관리 노드;를 포함하고, 상기 모델 생성 노드는, 상기 데이터 제공 노드에 상기 데이터의 전송을 요청하거나, 상기 데이터 제공 노드는, 상기 모델 생성 노드에 상기 데이터 를 제공하며 상기 데이터 분석 모델의 생성을 요청할 수 있다. 또한, 상기 모델 생성 노드는, 상기 하나 이상의 데이터 제공 노드가 제공하는 상기 데이터가 결합되는 결합 공 간을 포함하고, 상기 하나 이상의 데이터 제공 노드는, 상기 데이터가 상기 결합 공간에서 결합되도록 상기 데 이터를 상기 모델 생성 노드로 전송할 수 있다. 또한, 상기 데이터 제공 노드는, 다른 데이터 제공 노드에서 제공하는 데이터와 자신의 데이터가 결합될 수 있 는 결합 조건 정보를 함께 제공할 수 있다.또한, 상기 데이터 제공 노드는, 자신의 데이터와 결합시킬 데이터를 보유하는 다른 데이터 제공 노드에 대한 정보와, 상기 데이터를 이용하여 상기 데이터 분석 모델을 생성할 상기 모델 생성 노드에 대한 정보를 암호화 하여, 상기 다른 데이터 제공 노드와, 상기 모델 생성 노드에 전송할 수 있다. 또한, 상기 모델 생성 노드는, 수신한 상기 데이터를 복호화하고, 상기 블록체인망에서 미리 결정된 결합 조건 이 충족되면 ,상기 데이터 제공 노드로부터 수신한 데이터를 상기 결합 조건에 기초하여 결합할 수 있다. 또한, 상기 모델 생성 노드는, 하나 이상의 상기 데이터 제공 노드로부터 수신된 데이터를 결합하여, 인공지능 학습을 통한 학습 모델을 포함하는 분석 데이터를 생성할 수 있다."}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템은 블록체인망을 이용해 데이터를 결합하 고 가공하므로 데이터 제공자, 데이터 가공자 및 사용자에게 투명한 데이터 결합 및 사용 내역을 공개할 수 있 다. 또한, 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템은 데이터 이동 및 전송 시 발생할 수 있는 데이터 누출 사고를 예방하고, 누출되어도 안전할 수 있다. 또한, 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템은 데이터 가공 목적에 따라 다수 의 사용자 및 다수의 데이터 제공자의 동의 얻거나 또는 가공 권한을 부여할 수 있다. 다양한 분야의 데이터 제공자와 통합 데이터를 이용한 인공지능 분석 모델 제공자, 이러한 통합 데이터의 분석 산출물들이 필요한 수요자들이 하나의 데이터 플랫폼에 참여하여, 그 이전에는 파편적인 데이터에서 얻는 분석 에서 도출할 수 없었던 유의미한 분석 결과물을 산출하여 비지니스 및 연구개발에 활용할 수 있다."}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 내용들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0164377", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예가 상세하게 설명된다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으 며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고, 도면에서 본 발명의 실시예를 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략되었다. 본 명세서에서 사용된 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 로 사용된 것이 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 명세서에서, \"포함하다\", \"가지다\" 또는 \"구비하다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동 작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것으로서, 하나 또는 그 이상의 다른 특징들 이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않 는 것으로 이해될 수 있다. 또한, 본 발명의 실시예에 나타나는 구성부들은 서로 다른 특징적인 기능들을 나타내기 위해 독립적으로 도시되 는 것으로, 각 구성부들이 분리된 하드웨어나 하나의 소프트웨어 구성단위로 이루어짐을 의미하지 않는다. 즉, 각 구성부는 설명의 편의상 각각의 구성부로 나열하여 기술되고, 각 구성부 중 적어도 두 개의 구성부가 합쳐져 하나의 구성부로 이루어지거나, 하나의 구성부가 복수 개의 구성부로 나뉘어져 기능을 수행할 수 있다. 이러한각 구성부의 통합된 실시예 및 분리된 실시예도 본 발명의 본질에서 벗어나지 않는 한 본 발명의 권리 범위에 포함된다. 또한, 이하의 실시예들은 당 업계에서 평균적인 지식을 가진 자에게 보다 명확하게 설명하기 위해서 제공되는 것으로서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 이하, 첨부된 도면을 참조하여, 본 발명에 따른 바람직한 실시예에 대하여 설명한다. 이하, 데이터는 데이터의 포맷이나 종류에 관계 없이 다양한 정보를 포함하는 디지털 자료를 의미한다. 데이터 는 개인 정보, 개인이 생산한 정보, 개인의 행동으로 발생한 정보, 조직이 생산한 정보, 특정 기간의 현상 정보 등을 포함할 수 있다. 데이터는 금융 기관이 내부에서 보유하거나 생성한 데이터 또는 금융 기관의 생산하지 않 은 데이터도 포함할 수 있다. 예컨대, 금융 기관이 내부에서 보유하거나 생성한 데이터는 금융 기관을 이용하는 고객의 개인 정보, 신용 정보, 연체 정보, 상환 정보, 상품 정보 및 특정 상황에 따른 행동 기록 중 적어도 하 나일 수 있다. 개인 정보는 이름, 나이, 연령, 거주지, 성별, 소득, 직장, 직장근무기간, 자산현황 정보 등을 포함할 수 있다. 신용 정보는 신용 평가사 등급, 내부 신용 등급, 상환 의지에 대한 능력을 산출한 수치 등을 포함할 수 있다. 또한, 연체 정보는 과거 금융 기관에 대한 연체 정보, 부도 정보, 부채 정보 등을 포함할 수 있으며, 상품 정보는 대출 상품, 대출 실행 금액, 가산 금리, 이자 납부 금액, 잔액 등을 포함할 수 있다. 금융 기관 내부에서 자체적으로 생산하지 않은 데이터는 통신사 이용 내역, 카드 이용 내역, 상품 및 서비스의 이용 패턴, 경제지표, SNS 정보, 이자율, 기준 금리, 금융 상품의 행위가 일어나는 채널에 대한 정보일 수 있으며, 각 증권사별로 관리하고 있는 등급, 주식의 과거 특정 기간의 변동성 같은 정보일 수 있다. 상기 데이터의 형태는 보안이 필요한 문서 파일일 수 있으나 이에 제한되지 않으며, 이미지 파일, 동영상 파일 등일 수 있다. 도 1은 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템의 개략적인 블록도를 나타낸 것 이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템은 데이터 제공 노 드, 모델 생성 노드 및 사용자 노드를 포함할 수 있다. 데이터 제공 노드, 모델 생성 노드 및 사용자 노드는 각각이 블록체인망에 연결 또는 참여할 수 있다. 블록체인망은 데이터 제공 노드, 모델 생성 노드 및 사용자 노드를 포함할 뿐 아니라, 그 외의 복수의 일반 노드 와 블록체인 관리 노드를 포함할 수 있다. 블록체인망은 퍼블릭 블록체인(Public Blockchain), 프라이빗 블록체인(Private Blockchain) 또는 하이브리드 블록체인(Hybrid Blockchain)과 같은 형태일 수 있으 며, 프라이빗 블록체인의 형태가 바람직할 수 있다. 여기서, 데이터 제공 노드, 모델 생성 노드, 사용자 노드노드, 일반 노드 및 블록체인 관 리 노드는 블록체인망에 참여하는 구성요소로서, 각 노드는 블록체인망에서 발생되는 트랙잭션 데이터를 저장할 수 있다. 또한, 각 노드는 서로간 동일한 트랙잭션 데이터를 저장할 수 있다. 예컨대, 트랙잭 션 데이터는 각 노드간에 발생하는 트랜잭션의 기록이거나 각 노드의 로컬에 저장된 상기 데이터의 접근 주소의 해쉬값 등일 수 있다. 각 노드는 상기 트랜잭션 데이터에 대해서 항상 최신 버전으로 유지하도록 블록체인망을 통해 동기화할 수 있다. 또한, 블록체인망의 각 노드는 서버(Server), 스마트폰(Smart phone), 태블릿 (Tablet) 컴퓨터, 데스크탑(Desktop) 컴퓨터, 랩탑(Laptop) 컴퓨터, 노트북, 워크스테이션(workstation), PDA (Personal Digital Assistants), 포터블(Portable) 컴퓨터, 무선 전화기(Wireless phone), 모바일 폰(Mobile phone), e-북(e-book), PMP(Portable Multimedia Player), 휴대용 게임기, 내비게이션(Navigation) 장치, 블랙 박스(Black box), 디지털 카메라(Digital camera), 텔레비전(Television), 웨어러블 디바이스(Wearable device) 중 하나일 수 있으며, 이들에 제한되지 않는다. 특히, 블록체인 관리 노드는 블록체인망을 통해 서비스되는 데이터의 공유, 데이터 분석 요청, 데이 터 분석 모델 생성 또는 데이터 분석을 수행하기 위해 데이터 제공 노드, 모델 생성 노드, 사용자 노 드의 관련 데이터를 수신하여 각각의 노드로 전파할 수 있다. 데이터 제공 노드는 적어도 하나 이상일 수 있으며, 블록체인망을 통해 소유하고 있는 데이터를 제공 또는 공급하는 노드일 수 있다. 모델 생성 노드는 데이터 제공 노드가 소유하고 있는 데이터를 블록 체인망을 통해 제공받을 수 있다. 모델 생성 노드는 데이터 제공 노드로부터 수신한 데이터를 이용하여 데이터 분석 모델을 생성할 수 있다. 또한, 모델 생성 노드는 생성한 데이터 분석 모델을 통해 수신한 데이터를 분석할 수 있다.상기 데이터 분석 모델은 기계 학습을 통해 생성한 예측 모델일 수 있다. 여기서, 기계 학습은 심층 신경망 (DNN; Deep Neural Network), 합성곱 신경망(CNN; Convolution Neural Network), 순환 신경망(RNN; Recurrent Neural Network), 제한 볼츠만 머신(RBM; Restricted Boltzmann Machine) 및 심층 신뢰 신경망(DBN; Deep Brief Network) 중 하나 이상을 사용하여 수행될 수 있다. 기계 학습을 통해 생성된 예측 모델은 사람이 모든 판단 기준을 정해주지 않아도 상기 예측 모델에서 산출되는 분석 결과 데이터를 이용해 컴퓨터가 스스로 인지· 추론·판단할 수 있다. 사용자 노드는 상기 데이터 분석 모델을 통한 데이터 분석을 필요로 하는 노드일 수 있다. 여기서, 사용자 는 분석 의뢰자이자 데이터 수요자로서, 특정한 목적에 따른 데이터 분석이 필요할 수 있다. 그러나 사용자는 분석에 필요한 데이터를 보유하고 있지 않아 분석할 수 없을 수 있다. 따라서, 사용자는 데이터 모델 생성 시스 템을 이용하여, 하나 이상의 타인 또는 타사가 보유하고 있는 데이터를 이용하여 상기 특정한 목적에 따른 통합적인 데이터 분석하고자 할 수 있다. 이를 위해, 사용자 노드는 블록체인 관리 노드를 통해 해당 블록체인망에서 분석에 사용할 수 있는 데이터들의 목록과 데이터를 보유하고 있는 주체에 대한 정보를 얻을 수 있다. 이를 위해, 블록체인 관리 노드는 블록체인망에 참여하고 있는 데이터 보유자, 즉, 데이터 제공 노드의 역할이 가능한 노 드가 보유하고 있는 데이터의 속성과 해당 노드의 주소를 수신하고 관리하여 블록체인망에 공개할 수 있다. 이때, 블록체인 관리 노드는 데이터 제공 노드가 제공하는 데이터가 어떤 데이터인지 알 수 있 는 데이터의 속성과 해당 데이터를 보유하고 있는 데이터 보유자의 정보만 공개할 수 있다. 데이터 제공 노드 는 상기 데이터의 속성과 데이터 보유자 정보를 제외한 데이터의 내용은 암호화하여 블록체인 관리 노드 에 제공할 수 있다. 각기 성격이 다른 데이터를 통합하여 사용자의 분야에 필요한 분석 정보를 도출할 수 있으므로, 사용자의 입장 에서 시장 조사, 매출 확대 전략, 새로운 시장 진출 전략에 큰 기여를 할 수 있다. 예를 들면, 이커머스사는 항 공사 데이터로 특정 물건을 살 고객을 파악할 수 있으며, 금융사는 항공사 정보 및 이커머스사 정보를 결합하여, 금융이 필요한 고객을 파악할 수 있다. 또한, 자동차 회사 또는 자동차 금융회사는 항공사 정보, 이 커머스사 정보 및 금융사 정보를 결합하여 자동차가 필요한 고객을 파악할 수 있다. 사용자 노드는 블록체인 관리 노드에서 공개하는 데이터 제공 노드의 속성과 데이터 제공자의 정보를 확인 후, 블록체인망에 참여하고 있는 모델 생성 노드에게 데이터 분석 요청을 할 수 있다. 이때, 데이터 제공 노드, 모델 생성 노드 및 사용자 노드 간에 분석에 사용할 데이터, 데이터 분석 모델 생성에 필요한 데이터의 종류, 제한될 데이터의 종류 및 형태 등을 합의할 수 있으며, 합의된 정보는 블록체인망에 기록될 수 있다. 사용자 노드는 블록체인망을 통해 모델 생성 노드가 생성한 데이터 분석 모델을 사용할 수 있다. 여기서, 사용자 노드가 데이터 분석 모델을 사용한다는 것은 사용자 노드측에서 블록체인망 으로 모델 생성 노드에 접근하여 데이터 분석 모델을 이용한 분석 수행을 요청하거나, 해당 분석의 결과 데이터를 조회하거나 이용할 수 있는 것일 수 있다. 실시예에 따라서 데이터 제공 노드는 사용자 노드가 될 수 있고, 사용자 노드가 데이터 제공 노 드의 역할을 할 수 있다. 또한, 사용자 노드는 상기 데이터 분석 모델로부터 수신된 분석 데이터를 새로운 데이터 분석 모델의 생성을 위한 데이터로 제공하는 하나의 데이터 제공 노드의 역할도 수행할 수 있다. 또한, 실시예에 따라서 데이터 모델 생성 시스템은 결합 노드를 더 포함할 수 있으며, 후술되는 결합 공간 이 결합 노드로 대체될 수 있다. 이 경우, 데이터 제공 노드의 데이터는 모델 생성 노드로 전송되는 것이 아니라 결합 노드로 전송되며, 모델 생성 노드는 결합 노드의 데이터를 결합하여, 결합 데이터를 생 성하고, 데이터 분석 모델을 생성할 수 있다. 도 2는 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템이 수행되는 흐름도를 나타낸 것 이다. 도 1 및 도 2를 참조하면, 본 발명의 일 실시예에 있어서, 이커머스사가 항공사와 금융사가 소유한 고객 정보의 데이터를 분석하여, 현금 자산의 보유 금액에 따른 등급을 분류하고, 각 등급에 따른 고객들 중 여행자의 목적 지에 따른 특정 상품을 살만한 고객에 대한 추정을 위한 분석을 인공지능 분석 플랫폼사에 의뢰한다고 가정한다.여기서, 데이터 제공 노드는 데이터 제공 노드 A, 데이터 제공 노드 B 및 데이터 제공 노드 C를 포함할 수 있다. 예를 들어, 데이터 제공 노드 A가 항공사의 서버, 데이터 제공 노드 B가 이커머스사의 서버 그리고 데이터 제공 노드 C가 금융사의 서버일 수 있다. 이때, 데이터 제공 노드 A는 항공사를 이용하는 이용객들의 정보 데이터를 제공할 수 있다. 예컨대, 상기 이용객들의 정보 데이터 는 각 이용객들의 방문지 정보, 탑승 날짜 또는 시각 정보, 좌석 등급 정보 등 이용객이 항공사 서비스를 이용 하며 생산되는 정보일 수 있다. 데이터 제공 노드 B는 이커머스사를 이용하는 소비자들의 정보 데이터를 제공할 수 있다. 예컨대, 소비자들의 정보 데이터는 각 소비자가 자주 구매하는 상품 정보, 구매 시 구입 금액 정보, 상품 구매 날짜 정보, 결제 수단 정보 등 소비자들이 이커머스사를 이용하며 생산되는 정보일 수 있다. 데이터 제공 노드 C는 금융사를 이용하는 고객들의 정보 데이터를 제공할 수 있다. 예컨대, 고객들의 정보 데이터는 각 고객들의 계좌 잔액 정보, 대출 금액 정보. 자산 현황 정보 등 고객들이 금융사를 이용하며 생산되 는 정보일 수 있다. 데이터 제공 노드가 제공하는 데이터의 속성과 목록, 데이터 보유자 정보는 블록체인 관리 노드를 통해 사용자 노드가 확인할 수 있다. 이때, 이커머스사 서버인 데이터 제공 노드 B(12 0)는 분석 의뢰자의 서버인 사용자 노드로 수행된다. 이커머스사는 사용자 노드로 블록체인망에 참여하여 항공사 서버인 데이터 제공 노드 A가 소유 한 관련 데이터 및 금융사 서버인 데이터 제공 노드 C가 소유한 관련 데이터를 인공지능 분석 플랫폼사의 서버인 모델 생성 노드 A로 전송하고, 미리 개인 정보 처리가 동의된 데이터들에 대해서 분석이 가능하도 록 결합하는 합의를 할 수 있고, 상기 합의를 결합 조건으로 하여 블록체인망에 상기 결합 조건의 트랙잭 션 데이터를 공개할 수 있다. 데이터 제공 노드 A와 데이터 제공 노드 C는 각각의 데이터를 블록체인망을 통해 전송하기 위해 각각의 데이터의 주소를 블록체인망에 공개, 기록할 수 있다(S201, S202). 여기서, 주소는 블록체인망 에 프로그래밍된 규칙에 따라 각 노드에서 생성하여 블록체인망의 각 노드에 공개할 수 있다. 인공지 능 분석 플랫폼사의 서버인 모델 생성 노드 A는 데이터 제공 노드 A와 데이터 제공 노드 C가 전 송하는 데이터를 수신하고 그 데이터를 결합하기 위한 결합 공간을 따로 마련하고, 블록체인망에 상기 결 합 공간의 주소를 블록체인망에 공개할 수 있다(S203). 데이터 제공 노드 A 및 데이터 제공 노드 C는 상기 결합 공간의 주소로 데이터들을 전송하기 전, 전 송된 데이터를 특정 조건을 만족해야 결합이 가능하도록 결합 조건을 설정 또는 기록할 수 있다(S204, S205). 일 실시예에서 결합 조건은 ‘개인 정보 이용 동의를 한 개인의 데이터에 한정하여, 데이터를 전송받은 모델 생 성 노드가 모델 생성 노드 A일 때’일 수 있으며, 모델 생성 노드 A가 모델 생성 노드 A의 프라 이빗 키(Private Key)로 암호화된 데이터를 복호화할 때 이를 ‘계약’의 청약에 대한 승낙 표시로 간주되어 데 이터들이 결합될 수 있다. 이러한 결합 조건은 하나의 예시일 뿐이며 이에 한정되지 않으며, 결합 조건을 설정 에 따라 달라질 수 있다. 데이터 제공 노드 A 및 데이터 제공 노드 C는 데이터의 보안를 위해 상기 결합 공간의 주소를 암호키 로 이용하여 제공하는 데이터를 암호화하여 데이터 제공 노드 A의 상기 결합공간으로 전송할 수 있다 (S206, S207). 예컨대, 블록체인망 상의 결합 공간의 주소가 ‘0xe456064545f872b311ae7432689a0fece90c9a29’라면 데이 터 제공 노드는 상기 ‘0xe456064545f872b311ae7432689a0fece90c9a29’을 퍼블릭 키(Public Key)로 하여 전송하고자 하는 데이터를 SHA-256(Secure Hash Algorithm 256)방식으로 암호화하여 전송할 수 있다. 블록체인 망의 특성상 관계 없는 노드가 해당 데이터에 접근할 수 있으므로, 데이터 전송 및 공유 시 암호화는 관계 없는 노드의 접근을 차단할 수 있다. 모델 생성 노드 A는 결합 공간으로 수신한 데이터에 설정된 결합 조건을 조회하고 복호화할 수 있다 (S208). 여기서, 데이터의 복호화는 상기 결합 공간의 프라이빗 키(Private Key)를 사용하여 복호화할 수 있다. 퍼블릭 키 및 프라이빗 키를 이용한 암호화는 데이터를 전송하고자 하는 수신자를 확인함과 동시에 보안을 지킬 수 있다. 모델 생성 노드는 확인된 결합 조건에 따라 복호화한 데이터를 결합할 수 있다(S209). 예컨대, 결합 조건에 개인 정보 처리를 동의한 고객들의 정보만 결합이 가능한 것으로 설정되어 있으면, 수신한 데이터 중 개인 정보 처리 동의된 고객의 정보만 선별되어 결합될 수 있다. 모델 생성 노드 A는 사용자 노드가 접근하여 이용할 수 있는 서비스 공간을 위한 주소를 생성하여 블 록체인망에 공개할 수 있다(S210). 또한, 모델 생성 노드 A는 결합한 데이터를 이용하여 인공지능 학 습을 통한 학습 모델을 포함하는 분석 데이터를 생성할 수 있다(S211). 여기서, 학습 모델은 전술한 기계 학습을 통해 생성한 예측 모델인 데이터 분석 모델일 수 있다. 데이터 분석 모델인 예측 모델은 예측하고자 하는 결과값을 출력값으로 설정하고, 나머지 변수들을 입력값으로 설정하여 예측하고자 하는 항목들에 대한 확률값을 산출할 수 있다. 예컨대, 일 실시예에서 예측하고자 하는 결 과값은 등급에 따른 고객들 중 여행자의 목적지에 따른 특정 상품을 살만한 고객의 추정값 등일 수 있다. 입력 값은 각 고객의 항공 이용 내역, 자산현황, 근무조건, 나이, 계좌 잔액, 부채액 등일 수 있다. 예측모델을 만들 때는 샘플링, 알고리즘 적용, 모델성과분석을 통해 최적의 알고리즘으로 적용할 수 있다. 모델 생성 노드 A가 산출한 분석 데이터는, 상기 분석 데이터에 대한 정보와 상기 분석 데이터를 사용 또 는 조회할 수 있는 사용 조건이 부여된 상태로 사용자 노드에 전송될 수 있다. 보다 구체적으로는, 사용자 노드가 모델 생성 노드 A의 서비스 공간에 접근하여 분석 서비스를 이용할 수 있다. 분석 서비스를 이용한다는 것은 생성된 데이터 분석 모델을 사용하거나 분석 데이터를 사용 또는 조회할 수 있다는 것을 의미 할 수 있다. 서비스 공간은 결합 공간으로부터 데이터 분석 모델을 사용할 수 있도록 결합된 데이터를 수신할 수 있다. 이때, 결합된 데이터는 서비스에 대한 이용과 관련된 정보 및 사용 권한이 설정된 사용 조건이 부여되 어 서비스 공간으로 전송될 수 있다(S212). 일 실시예에서는 이커머스사인 사용자 노드가 상기 사용 조건 을 만족하는 사용자일 수 있다. 또한, 사용 조건에는 분석을 요청한 사용자라도 권한이 없는 개인 정보 데이터 는 조회하거나 열람할 수 없도록 설정되는 것도 추가될 수 있다. 사용자 노드는 부여된 사용 조건에 기초하여 서비스 공간에서 분석 서비스를 이용할 수 있다(S213). 예컨 대, 등급에 따른 고객들 중 여행자의 목적지에 따른 특정 상품을 살만한 고객의 추정값을 기초로 특정 상품을 구매하는 고객이 구매할 가능성이 높은 다른 상품을 예측하는 분석 서비스를 이용할 수 있다. 이와 다른 예시로 사용자의 목적이 현재 판매중인 신용대출 상품 금리 5% 상품에 대해 연체-부도율이 2% 이하로 리스크 관리 하는 것이 목적일 수 있다. 이때, 사용자는 금융사일 수 있으며, 데이터 제공 노드측은 또 다른 금융사일 수 있다. 이 경우, 데이터 분석 모델이 연체-부도율의 예측모델을 통한 향후 포트폴리오의 연체-부도율 예측결과치가 리 스크 관리를 하지 않을 경우 3%까지 상승하는 것으로 예측한다면, 상기 데이터 분석 모델은 입력값을 변경하며 가상 시뮬레이션을 반복적으로 수행하여 연체-부도율을 2%이하로 낮출 수 있는 최적의 입력값을 찾아내는 분석 을 할 수 있다. 상기 분석 데이터와 사용자 노드의 상기 분석 데이터 사용 이력은, 상기 블록체인망에 공개되어 기록될 수 있다. 이를 통해 사용자 노드의 민감한 개인 정보가 포함된 데이터에 대한 사용이 투명하게 공개되므로 데 이터의 사용의 투명성을 향상시킬 수 있다. 도 3은 본 발명의 일 실시예에 따른 시간 파라미터를 가진 데이터 결합을 개략적으로 나타내는 도면이다. 도 1 및 도 3을 참조하면, 본 발명의 일 실시예에 있어서, 사용자 노드는 데이터 제공 노드 중에서, 사용자가 원하는 데이터를 소유한 데이터 제공 노드(110, 130)를 선택할 수 있다. 또한, 사용자 노드는 제 공되는 데이터에서 분석에 필요한 미리 정해진 시간대 구간에 해당하는 데이터를 특정할 수 있다. 특정된 데이 터들에 대해서 분석이 가능하도록 모델 생성 노드로 전송하고 결합하는 합의를 할 수 있고, 상기 합의에 따른 트랙잭션 데이터를 블록체인망에 기록할 수 있다. 예컨대, 데이터 제공 노드 A의 데이터베이스 a 및 데이터베이스 b 중 t1 ~ t2에 해당하는 데이 터베이스 b의 데이터와 데이터 제공 노드 C의 데이터베이스 c 및 데이터베이스 d 중 t1 ~ t2에 해당하는 데이터베이스 c의 데이터를 모델 생성 노드 B로 전송하여 분석하는 합의를 데이터 제 공 노드 A, 데이터 제공 노드 C, 모델 생성 노드 B 및 사용자 노드 동의 하에 할 수 있다. 이에 따라, 데이터 제공 노드 A는 t1 ~ t2에 해당하는 데이터베이스 b의 데이터를, 데이터 제공 노드 C는 t1 ~ t2에 해당하는 데이터베이스 c의 데이터를 선별하여 모델 생성 노드 B로 전송할 수 있 다. 모델 생성 노드 B는 상기 선별된 데이터를 수신하고, 이를 이용해 데이터 분석 모델을 생성하고, 분석 할 수 있다. 이 경우, 사용자가 결합하고자 하는 데이터베이스의 종류와 시간 구간을 자유롭게 조합이 가능하므로 사용자는 보다 구체적이며 효율성이 높은 인공지능 모델링 서비스를 이용할 수 있다. 본 명세서에 기재된 다양한 실시예들은 하드웨어, 미들웨어, 마이크로코드, 소프트웨어 및/또는 이들의 조합에 의해 구현될 수 있다. 예를 들어, 다양한 실시예들은 하나 이상의 주문형 반도체(ASIC)들, 디지털 신호 프로세 서(DSP)들, 디지털 신호 프로세싱 디바이스(DSPD)들, 프로그램어블 논리 디바이스(PLD)들, 필드 프로그램어블 게이트 어레이(FPGA)들, 프로세서들, 컨트롤러들, 마이크로컨트롤러들, 마이크로프로세서들, 여기서 제시되는기능들을 수행하도록 설계되는 다른 전자 유닛들 또는 이들의 조합 내에서 구현될 수 있다. 또한, 예를 들어, 다양한 실시예들은 명령들을 포함하는 컴퓨터-판독가능한 매체에 수록되거나 인코딩될 수 있 다. 컴퓨터-판독가능한 매체에 수록 또는 인코딩된 명령들은 프로그램 가능한 프로세서 또는 다른 프로세서로 하여금 예컨대, 명령들이 실행될 때 방법을 수행하게끔 할 수 있다. 컴퓨터-판독가능한 매체는 컴퓨터 저장 매 체 및 하나의 장소로부터 다른 장소로 컴퓨터 프로그램의 이송을 용이하게 하는 임의의 매체를 포함하는 통신 매체 모두를 포함한다. 저장 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수도 있다. 예를 들어, 이러한 컴퓨터-판독가능한 매체는 RAM, ROM, EEPROM, CD-ROM 또는 기타 광학디스크 저장 매체, 자기 디스 크 저장 매체 또는 기타 자기 저장 디바이스 또는 원하는 프로그램 코드를 컴퓨터에 의해 액세스가능한 명령들 또는 데이터 구조들의 형태로 반송하거나 저장하는데 이용될 수 있는 임의의 다른 매체를 포함할 수 있다. 이러한 하드웨어, 소프트웨어, 펌웨어 등은 본 명세서에 기술된 다양한 동작들 및 기능들을 지원하도록 동일한 디바이스 내에서 또는 개별 디바이스들 내에서 구현될 수 있다. 추가적으로, 본 발명에서 \"~부\"로 기재된 구성 요소들, 유닛들, 모듈들, 컴포넌트들 등은 함께 또는 개별적이지만 상호 운용가능한 로직 디바이스들로서 개별 적으로 구현될 수 있다. 모듈들, 유닛들 등에 대한 서로 다른 특징들의 묘사는 서로 다른 기능적 실시예들을 강 조하기 위해 의도된 것이며, 이들이 개별 하드웨어 또는 소프트웨어 컴포넌트들에 의해 실현되어야만 함을 필수 적으로 의미하지 않는다. 오히려, 하나 이상의 모듈들 또는 유닛들과 관련된 기능은 개별 하드웨어 또는 소프트 웨어 컴포넌트들에 의해 수행되거나 또는 공통의 또는 개별의 하드웨어 또는 소프트웨어 컴포넌트들 내에 통합 될 수 있다. 특정한 순서로 동작들이 도면에 도시되어 있지만, 이러한 동작들이 원하는 결과를 달성하기 위해 도시된 특정한 순서, 또는 순차적인 순서로 수행되거나, 또는 모든 도시된 동작이 수행되어야 할 필요가 있는 것으로 이해되지 말아야 한다. 임의의 환경에서는, 멀티태스킹 및 병렬 프로세싱이 유리할 수 있다. 더욱이, 상술한 실시예에서 다양한 구성요소들의 구분은 모든 실시예에서 이러한 구분을 필요로 하는 것으로 이해되어서는 안되며, 기술된 구성요소들이 일반적으로 단일 소프트웨어 제품으로 함께 통합되거나 다수의 소프트웨어 제품으로 패키징될 수 있다는 것이 이해되어야 한다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시 예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위는 첨부된 특허청구범위의 기술적 사상에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2021-0164377", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템의 개략적인 블록도를 나타낸 것 이다. 도 2는 본 발명의 일 실시예에 따른 블록체인 기반의 데이터 모델 생성 시스템이 수행되는 흐름도를 나타낸 것 이다. 도 3는 본 발명의 일 실시예에 따른 시간 파라미터를 가진 데이터 결합을 개략적으로 나타내는 도면이다."}
