{"patent_id": "10-2015-0081072", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2016-0144655", "출원번호": "10-2015-0081072", "발명의 명칭": "사물인터넷용 초저전력 유연압전 음성인식 센서", "출원인": "한국과학기술원", "발명자": "이건재"}}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "플렉서블 박막(600);상기 플렉서블 박막(600) 상에 적층되는 압전 물질층(300); 및상기 압전 물질층(300) 상에 적층되는 전극(500);을 포함하고,상기 전극(500)은 일렬로 배치된 복수의 주파수 분리 채널들을 포함하며,상기 복수의 주파수 분리 채널은 그 길이가 상이한 상태인,사물인터넷용 초저전력 유연압전 음성인식 센서."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 복수의 주파수 분리 채널들은 각 단위 채널의 길이가 점점 증가하거나 감소하도록 배치되는,사물인터넷용 초저전력 유연압전 음성인식 센서."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 복수의 주파수 분리 채널의 전체적인 배치형태는 사다리꼴 형상인,사물인터넷용 초저전력 유연압전 음성인식 센서."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 압전 음성인식 센서는,상기 전극(500)을 전체적으로 덮는 형태로 적층되는 보호층(Passivation layer)을 더 포함하는,사물인터넷용 초저전력 유연압전 음성인식 센서."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "희생 기판(100)을 제공하는 단계;상기 희생 기판(100) 상에 버퍼층(200)을 적층하는 단계;압전 물질층인 PZT 박막(300)을 상기 버퍼층(200) 상에 증착하는 단계;상기 PZT 박막(300) 상에 니켈 금속층(400)을 적층하는 단계;상기 PZT 박막(300) 상에서 상기 버퍼층(200)을 분리하는 단계; 및상기 PZT 박막(300) 상에서 복수의 주파수 분리 채널들로 이루어진 전극(500)을 일렬로 배치되게 형성하는공개특허 10-2016-0144655-2-단계;를 포함하며,상기 분리 단계는, 니켈 박리 공정 또는 LLO(laser lift off) 공정을 통해 상기 PZT 박막(300) 상에서 상기 버퍼층(200)을 분리하는 단계를 포함하고,상기 복수의 주파수 분리 채널은 그 길이가 상이한 상태인,사물인터넷용 초저전력 유연압전 음성인식 센서의 제조 방법."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 방법은,상기 전극(500) 형성 단계 이후에,상기 전극(500) 상에 보호층(Passivation layer)를 증착하는 단계를 포함하는,사물인터넷용 초저전력 유연압전 음성인식 센서의 제조 방법."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5 항에 있어서,상기 버퍼층(200)은 실리콘산화물인,사물인터넷용 초저전력 유연압전 음성인식 센서의 제조 방법."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항 내지 제 4 항 중 어느 한 항에 따른 사물인터넷용 초저전력 유연압전 음성인식 센서를 포함하는,음성인식 기반의 사물 인터넷(IoT)이 적용된 모바일용 초소형 음성 센서 시스템."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 따른 음성 센서 시스템을 포함하는,유비쿼터스 장치."}
{"patent_id": "10-2015-0081072", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 따른 음성 센서 시스템을 포함하는,웨어러블 전자소자."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 압전 음성인식 센서는 플렉서블 박막; 상기 플렉서블 박막 상에 적층되는 압전 물질층 ; 및 상기 압전 물질층 상에 적층되는 전극;을 포함하고, 상기 전극은 일렬로 배치된 복수 의 주파수 분리 채널들을 포함하며, 상기 복수의 주파수 분리 채널은 그 길이가 상이한 상태이다. 본 발명은 사다리꼴 형태로 이루어진 복수의 주파수 분리 채널을 이용하여 감지되는 음성을 주파수에 따라 상기 복수의 채널을 통해 분리하는 것과 동시에 상기 분리된 음성 신호를 압전 소자를 통해 기계적 진동 신호에서 전 기적 신호로 변환하게 하여 인식하게 한다."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사물인터넷(IoT, Internet of Thing) 응용을 위한 초저전력 유연압전 음성인식 센서에 관한 것으로, 보다 상세하게는 기존 마이크로폰, ADC, DSP 회로 기반의 고전력 음성인식 센서를 대체하기 위하여 유연한 압전 박막을 이용하여 복수의 주파수 분리 채널을 통하여 음성을 주파수에 따라 복수의 채널을 통해 분리하는 것과 동시에 상기 분리된 음성 신호를 기계적 진동 신호에서 전기적 신호로 변환하게 하여, 음성인식 회로의 간편화를 통한 전력소모를 줄인 유연압전 기반 초저전력 음성인식 센서에 관한 것이다."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "음성인식 센서란 인간의 음성에 포함된 음향학적 정보로부터 언어적 정보를 추출하여 이를 인지하고 반응하게 만드는 센서를 의미한다. 쉽고 편리하게 사용할 수 있는 Natural UI(user interface)가 필요해진 오늘날에 음성 으로 대화하는 것은 미래 IoT시대의 수많은 인간과 기계의 정보 교환 매체 중 가장 자연스럽고 간편한 방법으로 여겨지고 있다. 하지만 기계와 음성으로 소통하기 위해서는 인간의 음성을 기계가 처리할 수 있는 형식으로 변 환을 해줘야 하는데 이 과정이 바로 음성 인식이다. 애플의 시리(Siri)로 대표되는 음성인식은 마이크로폰, ADC(Analog to Digital Converter), DSP (Digital Signal Processing)의 조합으로 구성되어 있으며, 모바일용 상시 대기로 활용하기에는 소모 전력이 높아 사용자 가 시작과 종료 버튼을 누르며 조작하고 있다. 이는 진정한 의미의 음성인식 기반 IoT(internet of Things,사물 인터넷) 구현에 가장 큰 난관 중에 하나이며, 초저전력 상시구동 음성인식시스템을 개발하는 경우에는 무궁무진 한 IoT 응용처를 열 수 있을 것으로 예상된다. 별도의 학습이나 훈련 없이도 쉽게 사용할 수 있는 음성인식 시스템은 혁신적인 차세대 IT 제품을 위한 UI 개발 및 구축에 대한 요구가 높아진 IoT 시대에 미래 산업을 선도할 유망 기술로서 손이 자유롭지 않은 상황이나 이 동시에도 정보를 입력할 수 있으며 입력 속도가 타이핑보다 빠르기 때문에 고속 또는 실시간으로 정보처리가 가 능하다는 장점이 있다. 근래 스마트폰 단말기 성능의 진화, 인공지능 및 지식 검색 기술의 발전, 클라우드 기반의 음성인식 시스템을 통한 대용량 데이터 처리는 지능형 에이전트로서 사용자가 원하는 답을 정확하고 신속하게 찾을 수 있게 해주지 만, 이런 장점과 가능성에도 불구하고 아직 음성인식 기술은 다음과 같은 한계점을 가지고 있다. 먼저, 하드웨어적인 관점에서 볼 때 마이크로폰, ADC, DSP의 조합을 이용한 기존 음성인식 기술은 전력소비가 매우 높아 별도의 충전기 없이는 상시대기 상태에서 음성인식이 현실적으로 불가능하며, 더더구나 모바일용 음 성인식 센서에 응용은 에너지 문제로 인하여 매우 제한적이다. 또한 음성 인식 시작 버튼을 누르는 등의 예비동 작이 필요하고 그 정확성, 신뢰도, 속도 등이 떨어진다. 즉, IoT를 기반으로 하는 스마트폰, TV, 자동차, 기타 웨어러블 디바이스에 적용하기 위해서는 고감도는 필수이며, Sleep 상태에서도 큰 전력 소모 없이 상시 대기 상 태를 유지하여 초전력으로 사용자의 음성을 인식할 수 있어야 한다. 다음으로, 음향학과 언어학적 관점에서 바라볼 때 현재의 마이크로폰, ADC, DSP 조합의 음성인식은 복잡한 알고 리즘을 기반으로 하고 있기에 자연스런 대화체를 인식하는 데에 한계가 있다. 이에 반해 인간의 달팽이관은 복잡한 언어를 주파수 분리 후 단순한 알고리즘을 통하여 효율적으로 신호처리하 고 있다. 이런 달팽이관의 원리를 이용한 여러 장치에도 불구하고, 이를 모사하여 인공와우에 응용한 선례는 있 지만 아직까지 IoT용 초저전력용 음성인식 센서로 활용된 케이스는 전무한 상태이다. 유연한 압전박막 인공와우 응용사례는 H. Lee et. al의 Advanced Functional Materials 저널의 논문 Vol. 24, No. 44, pg 6914, 2014에서 참조할 수 있다. 사다리꼴 모양의 얇은 실리콘 멤브레인 위에 3개의 압전소자를 붙 여 주파수에 따라서 가청주파수대의 음성 신호를 분리하였다. 상기 문헌에서는, 실리콘 멤브레인 위에 3개의 개 별 압전소자를 붙여 주파수를 분리하여 인공와우에 적용하였지만, 이를 IoT용 초저전력 음성센서로서 알고리듬, 회로 설계가 고려되지 않았다. 또한 복수의 공진 주파수를 이용하여 햅틱 피드백 효과를 출력하게 하는 압전 장치를 제시하는 종래의 문헌으로 는 공개특허 제10-2012-0099036호(2012.09.06)를 참조할 수 있다. 한편 상기 문헌에서는 촉각, 힘, 운동감 등에 기반한 햅틱 피드백 기술을 제공하지만, 인식된 음성을 복수의 주파수로 분리한 상태에서 인식하는 방안에 대해 서는 별도로 개시하고 있지 않다는 한계가 있다. (논문) H. Lee et. al, Advanced Functional Materials, 24, 6914, 2014 (특허문헌 1) KR10-2012-0099036 A"}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기 종래의 문제점을 해소하고자 하는 것으로서, 단일 소자로 구현된 유연한 압전 박막을 이용하여 사다리꼴 형태로 이루어진 복수의 주파수 분리 채널을 통하여 감지되는 음성을 주파수에 따라 상기 복수의 채널 을 통해 분리하는 것과 동시에 상기 분리된 음성 신호를 유연 압전 소자를 통해 기계적 진동 신호에서 전기적 신호로 변환하게 하여 인식하게 하여, 음성인식 회로의 간편화를 통한 전력소모를 줄인 IoT 용 초저전력 압전 음성인식 센서를 제공하는 것이 목적이다. 즉, 본 발명은 인간 음성의 스펙트럼에 대해 디지털 샘플링 및 음향 신호 처리 수행을 하기 이전에 주파수 별로 분리된 형태로 음향 신호를 감지 및 검출하여 기존 마이크로폰, ADC, DSP 회로 기반의 고전력 음성인식 센서보 다 음성인식 회로의 간편화를 통하여 소비하는 전력을 크게 줄이는 압전 음성인식 센서를 제공하는 것이 목적이 다. 또한, 본 발명은 유연한 무기 압전 소재를 이용해 마이크로폰, ADC, DSP의 조합으로 구성된 종래의 음성센서를 대체할 수 있는 차세대 초저전력 음성인식 센서를 제공한다."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위하여, 본 발명의 일 관점에 따른 사물인터넷용 초저전력 유연압전 음성인식 센서는 플 렉서블 박막; 상기 플렉서블 박막 상에 적층되는 압전 물질층; 및 상기 압전 물질층 상에 적층되는 전극;을 포함하고, 상기 전극은 일렬로 배치된 복수의 주파수 분리 채널들을 포함하며, 상 기 복수의 주파수 분리 채널은 그 길이가 상이한 상태이다. 상기 복수의 주파수 분리 채널들은 각 단위 채널의 길이가 점점 증가하거나 감소하도록 배치된다. 상기 복수의 주파수 분리 채널의 전체적인 배치형태는 사다리꼴 형상이다. 상기 압전 음성인식 센서는, 상기 전극을 전체적으로 덮는 형태로 적층되는 보호층(Passivation layer)을 더 포함한다. 본 발명의 다른 관점에 따른 사물인터넷용 초저전력 유연압전 음성인식 센서의 제조 방법은 희생 기판을 제공하는 단계; 상기 희생 기판 상에 버퍼층을 적층하는 단계; 압전 물질층인 PZT 박막을 상기 버퍼층 상에 증착하는 단계; 상기 PZT 박막 상에 니켈 금속층을 적층하는 단계; 상기 PZT 박막 상에서 상기 버퍼층을 분리하는 단계; 및 상기 PZT 박막 상에서 복수의 주파수 분리 채널들로 이루어진 전극을 일렬로 배치되게 형성하는 단계;를 포함하며, 상기 분리 단계는, 니켈 박리 공정 또는 LLO(laser lift off) 공정을 통해 상기 PZT 박막 상에서 상기 버퍼층을 분리하는 단계를 포함하고, 상기 복수의 주파수 분리 채널은 그 길이가 상이한 상태이다. 상기 방법은, 상기 전극 형성 단계 이후에, 상기 전극 상에 보호층(Passivation layer)를 증착하는 단계를 포함한다. 상기 버퍼층은 실리콘산화물일 수 있다. 본 발명은 상기 압전 음성인식 센서를 포함하는 음성인식 기반의 사물 인터넷(IoT)이 적용된 모바일용 초소형 음성 센서 시스템을 제공한다. 본 발명은 상기 모바일용 초소형 음성 센서 시스템을 포함하는 유비쿼터스 장치를 제공한다. 본 발명은 상기 모바일용 초소형 음성 센서 시스템을 포함하는 웨어러블 전자소자를 포함한다."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 사물인터넷용 초저전력 유연압전 음성인식 센서는 사다리꼴 형태로 이루어진 복수의 주파수 분 리 채널을 이용하여 감지되는 음성을 주파수에 따라 상기 복수의 채널을 통해 분리하는 것과 동시에 상기 분리 된 음성 신호를 압전 소자를 통해 기계적 진동 신호에서 전기적 신호로 변환하게 하여 인식하게 한다. 본 발명은 인간의 신체 중에서 달팽이관의 소리전달 메커니즘을 채용하여, 주파수 분리가 가능한 유연 압전 음 성인식 센서 및 이에 호환하는 센서모듈을 제작하여 상시 구동 가능한 사물인터넷 구현을 위한 초저전력 음성 UI를 실현한다. 또한, 유연한 압전 소재를 이용해 마이크로폰, ADC, DSP의 조합 없이 음파의 주파수를 초저전력으로 분리해내어 음성인식을 함으로써, 이를 이용하면 전력의 소모량을 최대로 줄인 대기 상태에서 언어 및 화자를 기계가 식별 해낼 수 있으며, 양방향의 소통과 대응이 가능한 내장형(Embedded) 음성인식센서 및 모듈을 구현할 수 있다. 본 발명은 주파수 별로 음성 스펙트럼의 분리 및 디지털 샘플링에 의해 보다 빠르고 정확한 음향 신호처리 및 고감도 인식을 가능하게 하며, 음향 분석 모듈이 단순화되어 비용을 절감할 수 있다. 이를 통해 주변 잡음 등의 변이(variability)에도 불구하고 화자 식별을 가능하게 한다. 또한, 본 발명은 Sleep 상태에서도 전력 소모가 거의 없어 상시 대기하며 음성인식을 가능하게 한다. 본 발명은 음성 인식 시작 및 종료 버튼을 조작하는 등의 예비동작 없이 쉽고 편리하게 화자 및 기본 명령을 인 식할 수 있게 한다."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 실시예를 더욱 상세히 설명하기로 한다. 그러나, 본 발명은 이하에서 개시되는 실시예에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 것이며, 단지 본 실시예들은 본 발명 의 개시가 완전하도록 하며, 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 도면 상에서 동일 부호는 동일한 요소를 지칭한다. 도 1은 종래의 음성인식 시스템과 본 발명과의 차이점을 보이는 비교도이다. 도 1에서는, 기존의 음성인식 시스 템은 마이크로 음성 신호를 아날로그 형태로 받아서 이를 ADC(Analog to digital converter)를 통해 디지털 신 호로 변환한 후, DSP(digital signal processing)를 통해 디지털 신호를 처리하여 주파수를 분리해내는데 이 때 높은 전력이 소모된다는 단점이 있다. 반면, 본 발명에서의 초저전력 음성인식 센서는 압전 센서로서 바로 음성인식이 가능하여 초저전력 구동이 가능 하다는 장점을 가진다. 종래의 마이크, ADC, DSP를 거쳐 주파수 분리를 하는 과정을 압전 음성인식 센서 하나로 통합하여 가능하게 한 것이다. 즉, 먼저 음성 신호를 주파수에 따라 복수의 전극채널에서 분리가 되는데, 이와 동시에 압전소자로 이루어진 박막에서 기계적 움직임이 전기적 신호로 변환되어 각각의 주파수 대역에서 전기적 신호가 검출되게 된다. 즉, 종래의 마이크로폰의 경우에는 주파수 밴드필터, ADC, DSP가 사용되므로 고전력이 소모되나, 본 발명은 주 파수별로 분리되어 전류를 생선하는 복수개의 압전소자를 사용하므로, 밴드필터나 ADC, DSP에 소요되는 전력을감소시킬 수 있다. 또한, 주파수 추출에 소요되는 전력을 저감시킬 수 있다. 도 2 내지 10은 본 발명의 일 실시예에 따른 압전 음성인식 센서의 제조방법을 설명하는 단계별 단면도이다. 도 2를 참조하면, 희생기판인 실리콘 기판이 개시된다. 본 발명에서 상기 희생기판은 추후 적층되는 금속층과의 응력 편차를 제공하나, 나노제너레이터 소자와 직접 접합되지는 않는다. 본 발명의 일 실시예에서 상기 실리콘 기판의 압축응력은 소자 상부에 접합되는 금속층의 인장응력과 부조화를 이루며, 이후 인가되 는 외부 에너지에 의하여 실리콘 기판상에 접합된 별도의 버퍼층(본 발명의 일 실시예에서 실리콘 산화물 층)이 크랙되는데, 버퍼층의 수평 방향 크랙은 다음에 보다 상세히 설명된다. 본 발명은 특히 상기 금속층과 희 생기판 사이의 응력차이에 따라 상기 크랙되는 부위를 조절, 제어할 수 있다. 상기 실리콘 기판 상에 실리콘 산화물과 같은 버퍼층이 적층된다. 본 발명에서 상기 버퍼층은 응력차이에 따라 발생하는 물리적 힘에 따라 떨어질 수 있는 수준으로, 나노제너레이터 소자와 접합된다. 본 발 명의 일 실시예에서, 상기 버퍼층으로 실리콘 산화물층을 사용하였으며, 실리콘 산화물층과 나노제너레이 터간 접합력은 상기 하부 기판과 금속층 사이의 응력 차이에 의하여 나노제너레이터 소자가 효과적으로 분리될 수 있는 수준이다. 도 3을 참조하면, 버퍼층 상에서 공지된 기술인 sol-gel 공정을 통해 압전 물질층인 PZT 박막이 증착 된다. sol-gel 용액 박막으로부터 유기성분을 제거하기 위해, 0.4M의 PZT sol-gel 용액(10 mol% 초과 PbO 의 52:48 몰비의 Zr:Ti)이 10분 동안 450 ℃의 공기 분위기에서의 열분해 과정과 함께 2500rpm에서 웨이퍼 상에 스 핀 캐스트된다. 상기 증착 및 열분해 단계는 2㎛ 두께의 PZT 박막을 형성하기 위해 수회 반복된다. PZT 박막의 결정화는 공기 중에서 650℃, 45분 동안 수행된다. 열분해 및 결정화 공정을 위해 급속 열처리(RTA)가 이용된다. 도 4를 참조하면, PZT 박막의 상부면에 금속층인 니켈층을 적층한다. 본 발명의 일 실시예에 따르면, 상기 니켈층 적층은 스퍼터링이나 PVD 공정 등과 같은 통상의 반도체 공정을 통하여 수행될 수 있으며, 이 외에도 통상적인 금속 도포 방식에 따라서도 적층될 수 있다. 상기 적층에 따라 PZT 박막 상에 접합된 니 켈이 형성된다. 도 5를 참조하면, 상기 잔류 인장응력을 가지는 금속층인 니켈층에 기계적 에너지(예를 들어 물리적 충격) 또는 열 에너지를 인가한다. 그 결과, 니켈의 잔류 인장응력이 발생하며, 상기 버퍼층을 통하여 나노제너레이터 소자와 간접적으로 접합된 실리콘 기판의 잔류 압축응력과 상기 잔류 인장 응력 간의 부조화(mismatch) 또는 비 대칭 효과가 발생하며, 이에 따라 실리콘 산화물인 버퍼층과 PZT 박막 사이의 경계면에서 두 층간의 접합이 떨어지는 현상이 발생한다. 본 발명은 이와 같이 실리콘 기판의 잔류 압축응력과 상이한 인장응력을 갖 는 금속층으로, 원하는 소자와 기판을 적층한 후, 외부로부터 에너지를 인가하여 약한 접합면에서 소자를 분리 한다. 특히 이러한 소자의 분리를 발생시키는 분리면을, PZT 박막과 가장 약한 힘으로 접합된 버퍼층의 경 계면으로 설정하므로, 실리콘 기판 상에서 제조된 소자를 원형 그대로 분리, 전사시킬 수 있는 장점이 있다. 또 한 상기 소자 분리 위치는 금속층과 희생기판 사이의 응력차이에 따라 제어될 수 있다. 도 6을 참조하면, 상기 실리콘 기판과 접촉하는 금속층의 잔류 인장응력 부조화에 따라 접합이 떨어진 PZT 박막 을 실리콘산화물 버퍼층으로부터 분리한다(도 7 참조). 한편, PZT 박막을 실리콘산화물 버퍼층으로부터 분리하는 과정은 LLO(laser lift off) 공정에 의해서 도 가능할 수 있다. 즉, PZT 박막을 버퍼층로부터 분리하기 위해 XeCl-펄스 엑시머 레이저를 통한 실 리콘산화물 버퍼층 후면에 대한 조사는, 예를 들어 XeCl 레이저의 광자에너지(4.03eV)가 버퍼층의 밴 드-갭 에너지보다 작고, PZT 박막의 그것보다 크기 때문에, PZT박막이 플렉시블 플라스틱 기재로 이동되는 것을 가능하게 한다. 결과적으로, 레이저 빔은 실리콘산화물 버퍼층을 관통하고, 다음으로 국소 용융 및 버퍼층 과의 경계에서 PZT의 해리가 일어난다.상기와 같이 PZT 박막을 플라스틱 기판으로 전환하기 위한 LLO(laser lift off) 공정이 일어난다. 도 8을 참조하면, 상기 분리된 PZT 박막-니켈층을, 플렉서블한 플라스틱 기판으로 물리적으로 이동시켜 접합시킨다. 이로써 플렉서블한 플라스틱 기판 상에 전사된 플렉서블 나노제너레이터가 완성된다. 도 9를 참조하면, 상기 니켈층은 통상의 화학적 식각 공정인 에칭(etching)을 통하여 제거된다. 예를 들어 상기 니켈층을 식각하기 위한 특정 식각액에 상기 플라스틱 기판에 접합된 소자의 상부를 침지시켜 니켈층을 제거할 수 있다. 하지만, 이 외에도 통상적인 다양한 금속층 제거 방식에 따라 상기 니켈층(40 0)을 선택적으로 제거할 수 있으며, 이 또한 본 발명의 범위에 속한다."}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다음으로, 도 10을 참조하면, PZT 박막 상에 전극이 적층되며, 이로써 하부에서부터 플렉서블 박막인 플라스틱 기판, PZT 박막, 및 전극의 형태로 적층된다. 여기에서, 상기 전극은 복수의 주 파수 분리 채널을 이루게 된다. 한편, 도 11을 참조하면 본 발명인 압전 음성인식 센서는 전극을 전체적으로 덮는 형태로 보호층 (Passivation layer)를 선택적으로 부가할 수 있다. 도 12는 본 발명의 일 실시예에 따른 압전 음성인식 센서의 실 제작품을 보이는 사진, 및 도 13은 압전 음성인 식 센서를 구성하는 복수의 채널 구성을 보이는 도면이다. 도 12를 참조하면, 사각형 모양의 투명한 플라스틱 기판 상에 원형의 PZT 박막 및 상기 플라스틱 기 판와 PZT 박막을 접합하기 위한 PU 접착제가 위치해 있고, PZT 박막 상단에 상기 PZT 박막 로부터 발생하는 전기적 에너지를 Cr/Au 전극을 통해서 수집하게 된다. 그리고, 이를 보호하는 보호 층(Passivation layer)를 추가적으로 증착해서 소자를 보호하는 역할을 하게 된다. 한편, 플라스틱 기판, UV 감수성 PU 접착제, PZT 박막, 보호층은 투명한 재질로 이루어질 수 있다. Cr/Au 전극 층은 Cr 위에 Au이 올라 있는 형태이기 때문에 육안으로는 전극의 색상이 금색으로 보일 수 있 다. 도 13을 참조하면, Cr/Au 전극 층의 전체적인 형상은 사다리꼴로 형성된 인공 달팽이관 형상일 수 있는데, 구체적으로는 일정한 간격으로 분리된 6개의 채널을 구비할 수 있다. 상기 분리된 6개의 전극채널은 실로폰 모 양을 닮은 인공 달팽이 관이 너비가 달라짐에 따라 고주파음과 저주파음이 공명하는 위치가 달라져서 물리적으 로 인간의 음성을 분리하는 것이 가능하게 된다. 각각 분리된 6개의 전극채널을 통해 감지된 음향은 주파수 별 로 아날로그 회로를 통해 증폭되고 필터링을 거친후 디지털 신호로 전환되어 처리된다. 본 발명에서는 주파수 분리와 더불어 전기 신호가 측정된 것이 의미가 있을 수 있는데, 0.9 내지 2.7Hz 대역의 주파수가 의미있을 수 있다. 또한, 채널의 개수를 늘리면 더욱 세밀한 주파수 분리가 가능할 것이다. 도 14는 본 발명에 따라 음성 파장으로부터의 주파수별 분리과정을 나타낸 도식도이다. 도 14에서와 같이, 감지되는 음성 파장에 대응하여 일렬로 배치된 복수의 전극채널 상에서는 각자 주파수별로 분리된 파장 신호를 추출하는 것을 보인다. 본 발명은 인간의 청각기관인 달팽이관을 모사하여 음성인식을 구현하는 것에 착안한 것으로서, 주파수 분리를 위한 기존 마이크로폰, ADC, DSP 조합 방식이 아닌 유연 압전 음성 센서 기반의 간편한 회로로 전력 소비를 크 게 줄일 수 있다. 또한, 이에 호환되는 효율적인 인식 알고리즘을 구현하게 된다면 인간의 자연스런 언어를 높 은 선택성과, 민감도, 감지속도 및 안정성을 가지고 인식해낼 수 있다. 본 기술을 실생활에 적용할 수 있는데, 예를 들어 운전 중에 음성으로 안전하게 차량 정보 시스템 사용을 상시 대기 상태에서 음성으로만 가능하게 하며, 이를 통해 TV, 청소기, 세탁기, 에어컨 등을 원거리에서 사람의 목소 리로만 초저전력 제어를 할 수 있게 된다. 특히, 손발이 불편한 장애인 및 환자들의 케어링(Caring)이나 음성을 등록함으로써 엘리베이터 등의 시설을 보다 편리하게 사용할 수 있다. 본 기술은 IT-NT-BT-소재 전반을 아우르는 주제로서 자연으로부터 영감을 얻어 인간의 삶을 풍요롭게 하는 융합 적 기술이다. 화자의 음성을 통해 적은 전력으로 상시 대기 상태에서 신원, 심리, 건강상태, 언어능력 등을 파 악할 수 있어 개인 맞춤형 서비스 제공이 가능해지고, 보안, 금융, 의료 교육 등의 분야에 이르기까지 센서의 전 분야에 활용될 수 있게 한다. 특히, 빅데이터에 음성 패턴을 검출후 분석 및 저장하여 정서 상태를 분석하고 피드백 시스템을 통해 심리적인 안정을 이끌어내는 등 모바일 헬스케어로의 응용이 가능하고, 음성인증 및 화자식별을 통한 보안 시스템이 강화 되어져 개인정보 및 사생활 보호에 도움이 될 것으로 기대된다. 본 발명은 상기의 특징들을 통해 음성인식 기반의 사물 인터넷(IoT,internet of Things) 및 모바일용 초소형 음 성 센서 시스템을 구현할 수 있다. 본 발명은 유연한 기판 상에 고효율 무기 압전 소재로 만들어진 음성인식 센서가 인간 음성의 스펙트럼을 디지 털 샘플링 및 음향신호 처리 이전에 압전 소재를 이용하여 음성으로 인한 기계적 진동에너지를 주파수 별로 각 각 다른 위치에 분리한 뒤 전기적인 신호로 변환하여 각각 주파수 별로 평행하게 음성신호를 처리한다. 본 발명에서는 복수의 주파수 분리 채널을 실로폰 모양을 닮은 인공 달팽이 관의 형상을 이루게 하고, 상기 복 수의 주파수 분리 채널의 크기가 달라짐에 따라 고주파음과 저주파음이 공명하는 위치가 달라져서 물리적으로 인간의 음성을 분리하게 한다. 여기에서, 분리되는 각각의 음향은 주파수 별로 아날로그 회로를 통해 증폭되고 필터링을 거친후 디지털 신호로 전환되어 처리된다. 이 과정은 기존의 마이크로폰, ADC, DSP 조합을 이용한 방 식보다 전력 소모가 크게 줄어들게 된다. 본 발명은 플렉서블한 박막 상에 결합된 압전 음성인식 센서를 제공하는 것으로서, 의복 등에 부착한 상태에서 도 사용할 수 있다. 즉, 의복 상에 부착된 상태에서 주위에서 쉽게 발생되는 음파, 초음파 영역의 물리적인 에 너지를 수확하여 전기에너지로 변환하는 기술로의 응용이 가능하다. 일반적으로 '어디에나 존재하는' 유비쿼터스 네트워크의 실현을 위해서는 '어디에나 존재하며 작동하는' 유비쿼 터스 전원의 존재가 필수 불가결하다. 한편, 도처에 존재하는 유비쿼터스 네트워크 구성요소의 전원은 충전을 필요로 하지 않는 자급자족 형태이어야 한다. 즉, 발전능력 및 축전능력이 공히 구비되어야 한다. 상술한 바와 같이, 본 발명에 따른 압전 음성인식 센서는 사다리꼴 형태로 이루어진 복수의 주파수 분리 채널을 이용하여 감지되는 음성을 주파수에 따라 상기 복수의 채널을 통해 분리하는 것과 동시에 상기 분리된 음성 신 호를 압전 소자를 통해 기계적 진동 신호에서 전기적 신호로 변환하게 하여 인식하게 한다. 이상에서 본 발명의 바람직한 실시 예에 대하여 설명하였으나, 본 발명은 상술한 특정의 실시 예에 한정되지 아"}
{"patent_id": "10-2015-0081072", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "니한다. 즉, 본 발명이 속하는 기술분야에서 통상의 지식을 가지는 자라면 첨부된 특허청구범위의 사상 및 범주 를 일탈함이 없이 본 발명에 대한 다수의 변경 및 수정이 가능하며, 그러한 모든 적절한 변경 및 수정의 균등물 들도 본 발명의 범위에 속하는 것으로 간주되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2015-0081072", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래의 음성인식 시스템과 본 발명과의 차이점을 보이는 비교도, 도 2 내지 10은 본 발명의 일 실시예에 따른 압전 음성인식 센서의 제조방법을 설명하는 단계별 단면도, 도 11은 본 발명의 일 실시예에 따른 압전 음성인식 센서의 도식도, 도 12는 본 발명의 일 실시예에 따른 압전 음성인식 센서의 실 제작품을 보이는 사진, 도 13은 압전 음성인식 센서를 구성하는 복수의 전극채널 구성을 보이는 도면, 및 도 14는 본 발명에 따라 음성 파장으로부터의 주파수별 분리과정을 나타낸 도식도이다."}
