{"patent_id": "10-2021-0115066", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0032331", "출원번호": "10-2021-0115066", "발명의 명칭": "내비게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법", "출원인": "주식회사 써브", "발명자": "박연수"}}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다수의 내비게이션들과 연결된 복수의 타사 내비게이션 서버;상기 타사 내비게이션 서버들로부터 운전자의 목적지 입력에 따라 상이한 다수의 경로에 대한 교통정보를 수집하고, 운전자의 설정에 따라 대체 경로, 최적 경로, 또는 운전 가이드 서비스를 제공하는 AI 내비게이션 서버;및경로 및 운전 가이드 제공 어플리케이션이 설치되고, 상기 AI 내비게이션 서버에 접속하여 상기 대체 경로, 최적 경로, 또는 운전 가이드 서비스 제공을 요청하여 제공받아 운전자에게 전달하는 AI 내비게이션;을 포함하는것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 AI 내비게이션 서버는 상기 AI 내비게이션를 통한 운전자의 대체 경로 요청 설정에 따라 혼잡 지점이 발생한 경우 교통정보를 수집하여 새로운 대체 경로를 제안하는 대체 경로 제공 모듈; 운전자의 목적지 입력에 따른 운행 경로를 복수의 구간으로 분류하고, 구간별 기계학습을 통해 최적 경로를 예측하여 상기 AI 내비게이션에 제공하는 최적 경로 제공 모듈; 및 운전자의 운전패턴을 분석하여 훈련패턴 모델을 도출하여 운전자의 운전을 가이드하는 운전 가이드 제공 모듈;을 포함하는 것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 대체 경로 제공 모듈은 다수의 내비게이션들과 연결된 복수의 상기 타사 내비게이션 서버들로부터 상기 AI 내비게이션을 통해 입력한목적지까지 경로와 겹치는 경로 구간의 교통정보를 수집하는 교통정보 수집부;상기 교통정보 수집부가 수집한 빅데이터의 교통정보를 바탕으로 출발지에서 목적지까지의 경로 중 혼잡 지점을결정하는 혼잡 지점 결정부; 상기 타사 내비게이션 서버들로부터 수집한 교통정보에서 동시간대에 해당 혼잡 지점을 통과할 것으로 판단되는차량의 수로 최적 경로를 파악하는 최적 경로 파악부;상기 최적 경로 파악부의 최적 경로 파악에 따라 최적 경로별로 예상되는 차량 수를 예측하고, 예측한 차량 수를 바탕으로 혼잡도를 예측하는 예측부; 및 상기 예측부에서 예측한 최적 경로별 혼잡도를 기반으로 혼잡도가 낮은 경로를 대체 경로로 제안하거나, 혼잡지점만을 다른 구간 경로로 변경하여 새로운 대체 경로로 제안하는 경로 제안부;를 포함하는 것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2023-0032331-3-제 3항에 있어서, 상기 교통정보 수집부는각종 SNS 서버와 연결되어 상기 AI 내비게이션을 통해 입력한 목적지까지 경로와 겹치는 경로 구간의 교통정보가 업로드된 경우 추가로 수집하여 대체 경로 제안에 반영될 수 있도록 하는 것을 특징으로 하는 내비게이션을통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서, 상기 최적 경로 제공 모듈은 운전자의 목적지 입력에 따라 운전자의 위치를 출발지로 하여 목적지까지의 복수의 경로를 획득하는 경로 획득부;상기 경로 획득부가 획득한 복수의 경로에 대하여 구간을 복수로 나누어 분류하는 구간 분류부;상기 구간 분류부에 의해 분류된 구간별로 딥러닝을 통한 기계학습을 통해 최적 경로를 예측하는 학습부; 및 상기 학습부가 예측한 최적 경로를 상기 AI 내비게이션에 제공하여 안내하는 경로 안내부;를 포함하는 것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 학습부는 상기 구간 분류부가 분류하여 생성된 복수의 구간에 대해 출발지 구간에서부터 순차적으로 최적 경로를 예측하고, 차량이 다음 구간으로 진입하기 일정 거리 또는 시간 전에 해당 다음 구간에 대한 최적 경로를 예측하는 과정을 목적지에 도착할 때까지 반복수행하는 것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 구간 분류부는 경로 상의 분기점, 또는 톨게이트를 기준으로 구간을 분류하거나, 출발지에서 목적지까지의 거리를 소정간격으로 나누어 구간을 분류하는 것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 학습부는 학습을 통해 도로상황에 영향을 미치는 각종 파라미터 마다, 상이한 가중치를 도출하고, 교통사고, 낙상, 날씨,또는 공사에 해당하는 이벤트에 높은 가중치를 부여하되, 상기 교통사고에 가장 높은 가중치를 부여하는 것을특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2023-0032331-4-제 2항에 있어서,상기 운전 가이드 제공 모듈은상기 타사 내비게이션 서버에 연결된 내비게이션 각각의 경로에 대한 다수의 운전자 습관을 획득하는 운전습관획득부;인공지능 알고리즘을 통해 모범적으로 주행하는 최적 운전 패턴 모델을 생성하고, 상기 운전습관 획득부에서 획득한 실제 다수의 운전자 습관 중에서 상기 최적 운전 패턴 모델과 매칭되는 상위 운전자들의 운전 패턴 모델을도출하는 운전 패턴 모델 도출부;상기 상위 운전자들의 운전 패턴 모델을 기반으로 상기 AI 내비게이션 사용 운전자의 운전 패턴을 비교하여 운전자의 운전습관을 분석하는 운전습관 분석부; 및 상기 운전습관 분석부의 분석 결과에 따라, 상위 운전자들의 운전 패턴과 대비되는 잘못된 운전자 운전습관의개선방안을 도출하고, 상기 개선방안을 반영하여 운전시 이를 직접적으로 안내하도록 하는 훈련패턴 모델을 도출하는 훈련패턴 모델 생성부;를 포함하는 것을 특징으로 하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 훈련패터 모델 생성부에 의해 생성된 훈련패턴 모델은 상기 AI 내비게이션 작동시 구동되어 해당 AI 내비게이션의 소리 출력부를 통해 음성 메시지를 출력함으로써 운전을 가이드 하는 것을 특징으로 내비게이션을 통한 경로 및 운전가이드 제공 시스템."}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템은 다수의 내비게이션들과 연결된 복수의 타 사 내비게이션 서버; 상기 타사 내비게이션 서버들로부터 운전자의 목적지 입력에 따라 상이한 다수의 경로에 대 한 교통정보를 수집하고, 운전자의 설정에 따라 대체 경로, 최적 경로, 또는 운전 가이드 서비스를 제공하는 AI 내비게이션 서버; 및 경로 및 운전 가이드 제공 어플리케이션이 설치되고, 상기 AI 내비게이션 서버에 접속하여 상기 대체 경로, 최적 경로, 또는 운전 가이드 서비스 제공을 요청하여 제공받아 운전자에게 전달하는 AI 내비게 이션;을 포함하여 임의의 구간에 도로 상황(도로 상태/사고 혼잡도/도로 사용자) 등에 따라 기계학습 분석을 기 반으로 가중치를 두어 혼잡도를 예측/계산하여 해당 구간을 회피 할 수 있는 효과가 있다."}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 내비게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법에 관한 것으로써, 더욱 상세하게는 복수 의 내비게이션 서버로부터 사용자가 입력한 출발지에서 목적지까지의 경로와 중첩되는 구간에 대한 도로 상황 데이터를 수집하고 수집한 데이터를 기계학습 분석하여 대체 또는 최적의 경로를 제공하면서, 운전자의 설정에 따라 운전가이드 서비스를 제공하는 내비게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재, 내비게이션 경로 제공 시스템은 출발지부터 도착지까지 시시각각 변하는 교통상황을 반영하여, 실시간 최 적 경로 안내를 안내하고 있다. 실시간으로 최적 경로를 제공하는 종래의 내비게이션 경로 제공 시스템은 도로공사의 실시간 도로정보, 특정 분 기점 상황정보, 사고 정보 또는 혼잡 정보 등을 고려하여, 이를 회피하고 다음 경로에 대한 최적 경로를 실시간 으로 수정하여 제공하고 있다. 하지만, 상술한 바와 같이 정보를 반영한 최적 경로 제공의 경우, 정확한 길안내를 하기에는 데이터 반영이 늦 어지는 문제점이 있다. 선행기술문헌 특허문헌(특허문헌 0001) 대한민국 공개특허공보 제10-2017-0046929호(2017.05.04)"}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 문제점을 해결하기 위해 본 발명은 도로 상황 데이터에 따른 최적의 경로를 예측할 수 있는 기계 학습 분석을 통하여, 도로 상황 데이터의 가중치를 도출하고, 가중치를 도로 상황 데이터에 적용하여 최적 경로 예측에 대하여 반복학습하여, 계산식을 도출함으로써, 현재 도로 상태 데이터를 수집하여, 가중치를 반영 하고 기계학습 계산식에 적용하여, 정확도 높은 최적의 경로를 계산/예측하여 사용자에게 제공 할 수 있는 내비 게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법을 제공하는 데 목적이 있다."}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 목적을 달성하기 위해 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템은 다수의 내 비게이션들과 연결된 복수의 타사 내비게이션 서버; 상기 타사 내비게이션 서버들로부터 운전자의 목적지 입력 에 따라 상이한 다수의 경로에 대한 교통정보를 수집하고, 운전자의 설정에 따라 대체 경로, 최적 경로, 또는 운전 가이드 서비스를 제공하는 AI 내비게이션 서버; 및 경로 및 운전 가이드 제공 어플리케이션이 설치되고, 상기 AI 내비게이션 서버에 접속하여 상기 대체 경로, 최적 경로, 또는 운전 가이드 서비스 제공을 요청하여 제 공받아 운전자에게 전달하는 AI 내비게이션;을 포함하되, 상기 AI 내비게이션 서버는 상기 AI 내비게이션을 통 한 운전자의 대체 경로 요청 설정에 따라 혼잡 지점이 발생한 경우 교통정보를 수집하여 새로운 대체 경로를 제 안하는 대체 경로 제공 모듈; 운전자의 목적지 입력에 따른 운행 경로를 복수의 구간으로 분류하고, 구간별 기 계학습을 통해 최적 경로를 예측하여 상기 AI 내비게이션에 제공하는 최적 경로 제공 모듈; 및 운전자의 운전패 턴을 분석하여 훈련패턴 모델을 도출하여 운전자의 운전을 가이드하는 운전 가이드 제공 모듈;을 포함하는 것을 특징으로 한다. 바람직하게, 상술한 목적을 달성하기 위해 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템 의 대체 경로 제공 모듈은 다수의 내비게이션들과 연결된 복수의 상기 타사 내비게이션 서버들로부터 상기 AI 내비게이션을 통해 입력한 목적지까지 경로와 겹치는 경로 구간의 교통정보를 수집하는 교통정보 수집부; 상기 교통정보 수집부가 수집한 빅데이터의 교통정보를 바탕으로 출발지에서 목적지까지의 경로 중 혼잡 지점을 결정 하는 혼잡 지점 결정부; 상기 타사 내비게이션 서버들로부터 수집한 교통정보에서 동시간대에 해당 혼잡 지점을 통과할 것으로 판단되는 차량의 수로 최적 경로를 파악하는 최적 경로 파악부; 상기 최적 경로 파악부의 최적 경로 파악에 따라 최적 경로별로 예상되는 차량 수를 예측하고, 예측한 차량 수를 바탕으로 혼잡도를 예측하는 예측부; 및 상기 예측부에서 예측한 최적 경로별 혼잡도를 기반으로 혼잡도가 낮은 경로를 대체 경로로 제안하 거나, 혼잡 지점만을 다른 구간 경로로 변경하여 새로운 대체 경로로 제안하는 경로 제안부;를 포함하는 것을 특징으로 하는 한다. 더욱 바람직하게, 술한 목적을 달성하기 위해 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스 템의 최적 경로 제공 모듈은 운전자의 목적지 입력에 따라 운전자의 위치를 출발지로 하여 목적지까지의 복수의 경로를 획득하는 경로 획득부; 상기 경로 획득부가 획득한 복수의 경로에 대하여 구간을 복수로 나누어 분류하 는 구간 분류부; 상기 구간 분류부에 의해 분류된 구간별로 딥러닝을 통한 기계학습을 통해 최적 경로를 예측하는 학습부; 및 상기 학습부가 예측한 최적 경로를 상기 AI 내비게이션에 제공하여 안내하는 경로 안내 부;를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법은 임의의 구간에 도로 상황(도로 상태/사고 혼잡도/도로 사용자) 등에 따라 기계학습 분석을 기반으로 가중치를 두어 혼잡도를 예측/계산하여 해 당 구간을 회피 할 수 있는 효과가 있다. 또한, 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법은 실제 운전자의 상위패턴 모델을 기반으로 하여 초보 운전자나 운전 습관의 개선이 필요한 운전자에 대해서 운전자 맞춤형으로 훈련패턴 모델을 도출하고 이를 내비게이션에 적용하여 운전자의 운전시 음성을 통해 운전을 가이드하도록 함으로써 운전 실력을 향상시킬 수 있는 효과가 있다."}
{"patent_id": "10-2021-0115066", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정하여 해석되어서는 아니 되 며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 발명의 가 장 바람직한 일 실시예에 불과할 뿐 이고 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다 양한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템 및 방법에 대해 설명한다. 도 1은 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템 도면이다. 도 1에 도시된 바와 같이 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템은 복수의 타사 내 비게이션 서버, AI 내비게이션 서버, AI 내비게이션 및 SNS 서버를 포함한다. 복수의 상기 타사 내비게이션 서버는 내비게이션 단말기들과 연결되어 단순히 사용자가 입력하는 출발지에 서 목적지까지의 경로를 적어도 하나 이상 제공하고, 사용자가 선택한 경로를 내비게이션 단말기를 제공한다. 특히, 상기 타사 내비게이션 서버는 운전자가 입력하는 출발지에서 목적지까지의 정보, 및 운전자가 선택 한 경로를 저장관리한다. 상기 타사 내비게이션 서버는 차량의 경로를 안내하는 서비스를 제공하는 상이한 업체의 서버들에 해당될 수 있다. 한편, 상기 타사 내비게이션 서버는 복수의 네비게이션 단말기들로부터 운전자의 규정속도 준수, 속도위반, 신호준수, 신호위반, 급출발, 급정지, 안전벨트 착용 여부 정보를 수집하고, 수집한 정보에 기반하여 점수를 부여하고, 점수에 따라 해당 내비게이션을 이용하는 모든 운전자들의 순위를 결정하여 제공할 수 있다. 상기 AI 내비게이션 서버는 통신망을 통해 상술한 타사 내비게이션 서버들로부터 출발지에서 목적지 까지의 정보와 경로 정보를 수집하고 딥러닝 분석을 통해 대체 경로와 최적 경로 그리고 운전 가이드와 같은 부 가적인 서비스를 제공한다. 상기 AI 내비게이션 서버에 대해 좀더 상세히 살펴보면, 도 2에 도시된 바와 같이 상기 AI 내게이션 서버 는 제어모듈, 대체 경로 제공 모듈, 최적 경로 제공 모듈, 데이터베이스부 및 운전 가이드 제공모듈을 포함한다. 상기 제어모듈은 복수의 AI 내비게이션 접속을 감지하고, AI 내비게이션을 통한 운전자의 네비 게이션 설정을 입력받거나, 대체 경로, 최적 경로, 또는 운전 가이드 서비스 요청을 입력받아 상기 대체 경로제공 모듈, 최적 경로 제공 모듈, 또는 운전 가이드 제공모듈의 구동을 제어한다. 본 발명에 따른 AI 내비게이션에 통해 운전자가 목적지를 입력하면, 상기 AI 내비게이션 서버는 현재 상기 AI 내비게이션의 위치정보를 출발지로 자동판단하고 해당 출발지에서 입력한 목적지까지의 경로를 탐 색한다. 참고로, 상기 AI 내비게이션은 차량에 탑재된 내비게이션 단말기일 수 있고, 탈장착이 가능한 스마트폰 또 는 태블릿 PC에 상당하는 단말기일 수 있다. 먼저, 운전자의 상기 AI 내비게이션 조작에 따른 모드 선택에 따라 도 3과 같이 대체 경로를 제공하는 상 기 대체 경로 제공 모듈은 교통정보 수집부, 혼잡 지점 결정부, 최적 경로 파악부, 예측부 , 및 경로 제안부를 포함한다. 상기 교통정보 수집부는 길안내 서비스를 제공하는 다수의 내비게이션들로부터 우선적으로 수집한 교통정 보를 복수의 상기 타사 내비게이션 서버들로부터 수집한다. 상기 교통정보 수집부는 상기 타사 내비게이션 서버들이 수집한 모든 교통정보를 수집하는 것이 아니 라, 데이터 용량을 고려하여 출발지에서 상기 AI 내비게이션을 통해 입력한 목적지까지 경로와 겹치는 경 로 구간의 교통정보를 수집한다. 이때, 상기 교통정보 수집부는 출발지에서 목적지까지 전 구간과 일치하는 구간의 교통정보만을 수집하는 것이 아니라, 상이한 출발지에서 목적지까지 이동하는 경로이지만 일부 중첩되는 경로 구간에 대한 교통정보도 수집하는 것이 바람직하다. 또한, 이때 상기 교통정보 수집부은 상기 AI 내게이션 서버에 연결된 상기 SNS 서버로부터 교통 정보를 수집할 수도 있다. 즉, 트위터, 페이스북 등 SNS 사용자가 특정 도로에서 교통사고가 발생 했다거나 공사 중임을 해시태그와 함께 업로드한 경우, 상기 교통정보 수집부는 운전자가 입력한 목적지까지 이동하는 경로에 포함된 경우 이를 수집한다. 상술한 바와 같이 상기 교통정보 수집부가 SNS 서버로부터 교통정보를 수집하는 것은 상기 AI 내비게 이션 서버가 교통사고 정보를 좀더 신속하게 반영하여 대체 경로를 제공할 수 있도록 하기 위함이다. 이때, 상기 교통정보 수집부는 SNS 정보의 신뢰도를 향상을 위해 적어도 2명 이상의 SNS 사용자가 동일한 지점에서의 교통정보를 업로드 하는 경우에 이를 수집한다. 상기 혼잡 지점 결정부는 상기 교통정보 수집부가 수집한 빅데이터의 교통정보를 바탕으로 출발지에 서 목적지까지의 경로에서 혼잡 지점을 결정한다. 즉, 상기 혼자 지점 결정부는 수집한 다수의 상기 출발지에서 목적지까지의 경로 구간에 대한 교통정보 중, 특정 구간에서 사고가 발생하거나 공사 등을 이유로 공통적으로 평소와 다르게 차량의 평균속도가 낮거나 평균 이동시간 오래 걸리는 경우 혼잡 지점으로 결정한다. 상기 최적 경로 파악부는 상기 타사 내비게이션 서버들로부터 수집한 교통정보에서, 복수의 운전자가 입력하나 출발지와 목적지 경로 중, 동시간대에 해당 혼잡 지점을 통과할 것으로 판단되는 차량의 수, 상기 혼 잡 지점을 통과할 것으로 예상되는 차량과 대응되는 각 업체의 내비게이션의 종류 및 해당 내비게이션에서 제공 되는 최적 경로를 파악한다. 상기 타사 내비게이션 서버가 경로 요청한 복수의 내비게이션들에 이미 다양한 경로를 제공한 상태이기 때 문에, 상기 최적 경로 파악부는 상기 타사 내비게이션 서버들로부터 수집한 교통정보로부터 동시간대 에 혼잡 지점을 통과할 것으로 예상되는 차량을 수를 용이하게 파악할 수 있다. 상기 예측부는 상기 최적 경로 파악부의 최적 경로 파악에 따라 최적 경로별로 예상되는 차량의 대수 (내비게이션 수)를 예측하고, 예측한 차량의 대수를 바탕으로 혼잡도를 예측한다. 즉, 상기 예측부는 예측한 차량의 대수가 많을수록 혼잡도가 높고 예측한 차량의 대수가 적을수록 혼잡도 가 낮은 것으로 예측한다.다시 말해, 각 최적경로별 차량의 숫자(즉, 제1 내비게이션에서 제공되는 제1 최적경로를 이용할 것으로 예상되 는 차량의 숫자, 제2 내비게이션에서 제공되는 제2 최적경로를 이용할 것으로 예상되는 차량의 숫자)를 파악한 후, 이를 기초로 각 최적경로에서의 혼잡도를 예측한다. 상기 경로 제안부는 상기 예측부에서 예측한 최적 경로별 예상되는 차량의 대수 및 혼잡도를 기반으 로 혼잡도가 가장 낮은 경로를 운전자가 목적지를 입력함에 따라 최초 제안한 경로의 대체 경로도 제안하거나, 혼잡 지점을 다른 구간 경로로 대체하여 새로운 대체 경로를 제안한다. 상기 최적 경로 제공 모듈은 운전자의 상기 AI 내비게이션 조작에 따른 모드 선택에 따라 최적 경로 제공 요청이 있는 경우 가중치를 도로 상황 데이터에 적용하여 최적 경로를 예측하여 제공한다. 도 4와 같이 최적 경로를 제공하는 상기 최적 경로 제공 모듈은 경로 획득부, 구간 분류부, 학 습부, 및 경로 안내부를 포함한다. 상기 경로 획득부는 운전자의 목적지 입력에 따라 현재 운전자가 위치한 장소를 출발지로 하여 목적지까지 의 복수의 경로를 획득한다. 상기 경로 획득부는 상기 타사 내비게션 서버에서 업체별로 추천하거나, 일반적으로 제공하는 경로일 수 있고, 또는 본 발명에 따른 AI 내비게이션 서버에 자체적으로 데이터베이스화되어 저장된 경로일 수 있 다. 상기 구간 분류부는 상기 경로 획득부가 획득한 복수의 경로에 대하여 분기점, 또는 톨게이트를 기준 으로 구간을 분류하거나, 출발지에서 목적지까지의 거리를 소정간격으로 나누어 구간을 분류할 수 있다. 상기 학습부는 상기 구간 분류부에 의해 분류된 구간별로 딥러닝을 통한 기계학습을 통해 최적 경로 를 예측한다. 보다 구체적으로, 상기 학습부는 파이썬 또는 텐서플로우 등과 같은 프로그래밍 언어에 의해 교통사고, 공 사구간 등 각종 이벤트가 파라미터로 반영되어 설계된 알고리즘에 의해 학습을 수행하여 최적 경로를 예측한다. 이때, 상기 학습부는 학습을 통해 도로상황에 영향을 미치는 각종 파라미터 마다, 상이한 가중치를 계산하 여 도출하고, 그 중에서 교통사고에 가장 높은 가중치를 부여한다. 특히, 상기 학습부는 데이터베이스부의 도로교통 관련 데이터 DB에 저장된 데이터를 파라미터로 사용하여 가중치를 계산한다. 상기 데이터베이스부의 도로교통 관련 데이터 DB에는 최단거리(km), 최단시간(교통신호, 제한속도), 도로 특성(기하학적 특성, 터널, 스쿨존, 카메라), 이벤트(사고, 낙상, 날씨, 공사), 도로교통공사 데이터, 내 비게이션 데이터(회사별 GPS 정보, 도로 이용자 비중), 차량 데이터(회사별 GPS 정보, 도로 이용자 비중)가 수 집되어 저장되어 있다. 상기 학습부는 기계학습(딥러닝) 분석으로 도로 상황에 영향을 미치는 도로 상황 데이터에 대해서 가중치 를 도출하되 상기 이벤트에 가장 높은 가중치를 부여한다. 상기 학습부는 도출한 가중치를 도로 상황 데이터에 적용하여 최적 경로를 반복 학습하여 정확도 높은 최 적 경로를 예측한다. 상기 경로 안내부는 상기 학습부가 도출한 가중치를 적용하여 예측한 최적 경로를 상기 AI 내비게이 션에 제공하여 안내한다. 상기 경로 안내부의 경로 안내에 따라 상기 AI 내비게이션을 보고 운전자가 제1 구간을 주행하면, 상 기 학습부는 운전자(차량 또는 AI 내비게이션)가 제1 구간에서 제2 구간으로 진입하기 일정 거리 또는 일 정시간 전에 상기 제2 구간에 대한 최적 경로를 재탐색한다. 상기 학습부는 최적 경로 도출 데이터를 기반으로 기계학습 분석을 통해 다음 구간의 최적 경로를 계산하 되, 경로의 기존 구간에서 변경구간으로 갈 때 발생하는 추가 발생 시간을 고려하여 계산한다. 상술한 바와 같이 상기 학습부는 출발지에서 도착지까지 도착할 때까지 상기 구간 분류부가 분류한 구간에 대해 반복적으로 학습을 수행하여 최적 구간 경로를 예측한다. 예를 들어 더욱 상세히 설명하면, 도 4에 도시된 바와 같이 상기 경로 획득부는 타사 내비게이션 서버로부 터 출발지와 목적지가 동일하지만 이동 경로가 상이한 내비게이션 A, B, C의 경로 1, 2, 및 3을 각각 획득한다. 상기 구간 분류부는 상기 경로 1, 2, 및 3을 분기점, 톨게이트, 또는 이동거리 등 특정 기준에 따라 분류 한다. 상기 학습부는 차량의 출발이 이루어지는 제1구간으로 하여 학습을 수행하고 최적을 경로를 예측하고, 제3 구간에서 교통사고가 발생한 경우, 해당 교통사고에 가중치를 적용하여 학습을 통해 2 경로의 제 3구간을 최적 의 구간 경로로 예측하고, 2 경로의 제4 구간에서 열악한 날씨가 발생한 경우 해당 열악한 날씨에 해당되는 가 중치를 적용하여 학습을 통해 3 경로 제4 구간을 최적의 구간 경로로 예측하여 최종적으로 경로 1의 제1 및 제2 구간과, 경로 2의 제3 구간 그리고 경로 3의 제4 구간을 최적 경로로 예측한다. 상기 경로 안내부 상기 학습부 구간 단위로 예측한 최적 경로를 상기 AI 내비게이션에 제공한다. 또한, 상기 운전 가이드 제공 모듈은 운전자의 상기 AI 내비게이션 조작에 따른 모드 선택에 따라 출 발지에서 목적지까지 운전 가이드를 제공한다. 도 5에 도시된 바와 같이 운전 가이드를 제공하는 상기 운전 가이드 제공 모듈은 운전습관 획득부, 운전 패턴 모델 도출부, 운전습관 분석부, 및 훈련패턴 모델 생성부를 포함한다. 상기 운전 습관 획득부는 상기 타사 내비게이션 서버에 연결된 내비게이션 각각의 경로에 대한 다수 의 운전자 습관을 획득한다. 즉, 상기 운전 습관 획득부는 경로 형태 및 신호에 대한 차선 맞춤 여부, 급출발 및 급브레이크 빈도, 경 로 이탈 빈도, 유턴/좌회전/우회전시 깜빡이 사용 여부, 차선변경 빈도 등을 통해 운전자의 운전습관을 획득한 다. 상기 운전 패턴 모델 도출부는 운전자가 선택하는 특정 목적지에 대한 각 경로별 최적의 운전패턴 모델과 획득한 다수의 운전자 습관을 매칭하여 상위 운전자들의 운전 패턴 모델을 도출한다. 상기 경로별 최적의 운전패턴 모델은 인공지능 알고리즘을 통해 임의의 경로를 규정속도를 준수하고, 교통신호 를 준수하면서 모범적으로 주행하는 최적의 운전패턴 모델이다. 참고로, 상기 운전자 패턴 모델은 내비게이션이 사용될수록 일정주기로 업데이트 된다. 상기 운전습관 분석부는 상기 상위 운전자들의 운전 패턴 모델을 기반으로 현재 본 발명에 따른 AI 내비게 이션 사용자의 운전 패턴을 비교하여 운전자의 운전습관을 분석한다. 예를 들어 상기 운전습관 분석부는 상위운전자 패턴 모델과 비교하여 경로 운행시 불필요하게 차선을 벗 어나는지, 방향전환구간에서 깜빡이 작동이 이루어졌는지, 제동구간에서 브레이크 작동이 제대로 이루어졌는지, 습관적(반복적)으로 사용자(운전 초보자 또는 운전 습관의 개선이 필요한 운전자 등)가 잘 틀리는 운전구간 또 는 습관이 있는지 분석한다. 상기 훈련패턴 모델 생성부는 상기 운전습관 분석부의 분석 결과에 따라, 상위운전자 패턴과 대비되 는 잘못된 사용자 운전습관의 개선방안을 도출하고, 상기 개선방안을 반영하여 운전시 이를 직접적으로 안내하 도록 하는 훈련패턴 모델을 도출한다. 예를 들어, 상기 훈련패턴 모델 생성부에 의해 도출된 훈련패턴 모델은 상기 AI 내비게이션 작동시 구동되어 해당 내비게이션의 소리 출력부를 통해 \"차선이 오른쪽으로 치우쳤습니다. 오른쪽 깜빡이 작동 후 백미러를 확인하여 차선을 변경해 주세요\"와 같은 음성 메시지를 출력한다. 즉, 본 발명에 따른 AI 내비게이션은 경로 주행시 상기 AI 내비게이션 서버에서 전달된 훈련패턴 모 델을 구동하여 음성으로 운전을 안내하여 사용자의 운전이 모범적으로 이루어질 수 있도록 돕는다. 상기 AI 내비게이션은 특별한 단말기가 아니고, 상술한 상기 AI 내비게이션 서버에서 제공되는 AI 방 식으로 경로를 안내하는 어플리케이션이 구동될 수 있는 단말기에 해당 된다. 상기 AI 내비게이션은 상술한 상기 AI 내비게이션 서버에서 이루어지는 대체 경로 제공, 최적 경로 제공, 및 운전 가이드 제공을 경로 안내 어플리케이션을 설치함으로써 가상으로 모듈을 생성하여 라이트한 수준 에서 AI 내비게이션 서버의 기능을 부분적으로 수행할 수도 있다.이상에서는 본 발명에 대한 기술사상을 첨부 도면과 함께 서술하였지만 이는 본 발명의 바람직한 실시 예를 예 시적으로 설명한 것이지 본 발명을 한정하는 것은 아니다. 또한 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자라면 누구나 본 발명의 기술적 사상의 범주를 이탈하지 않는 범위 내에서 다양한 변형 및 모방이 가능함 은 명백한 사실이다."}
{"patent_id": "10-2021-0115066", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템 도면이다. 도 2는 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템의 내비게이션 서버의 블록도이다. 도 3은 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템의 대체 경로 제공을 설명하기 위한 도면이다. 도 4는 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템의 최적 경로 제공을 설명하기 위한 도면이다. 도 5는 본 발명에 따른 내비게이션을 통한 경로 및 운전가이드 제공 시스템의 운전 가이드 제공을 설명하기 위 한 도면이다."}
