{"patent_id": "10-2021-0189845", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0100165", "출원번호": "10-2021-0189845", "발명의 명칭": "면 오염원의 대기오염물질 배출량 산출시스템", "출원인": "(주)휴엔릭스", "발명자": "김승진"}}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "지표상의 일정 면적을 차지하는 면 오염원의 외부에서 상기 면 오염원 내부의 적어도 어느 한 지점에 대한 대기오염물질 배출량을 산출하는 면 오염원의 대기오염물질 배출량 산출시스템에 있어서,상기 면 오염원의 둘레를 따라, 서로 이격되어 배치되는 복수의 지지유니트;복수의 상기 지지유니트 중 적어도 어느 하나에 배치되어 오염물질 농도를 측정하는 오염물질센서;복수의 상기 지지유니트에 분산 배치되며, 상기 오염물질센서로 측정되지 않는 표준물질을 생성하여 상기 지지유니트 주변으로 확산시키는 복수의 표준물질생성모듈;복수의 상기 지지유니트에 분산 배치되어 상기 표준물질 농도를 측정하는 복수의 표준물질센서;복수의 상기 지지유니트에 분산 배치되어 상기 지지유니트 및 주변의 대기유동정보 및 환경정보를 수집하는 복수의 환경센서; 및상기 대기유동정보, 상기 환경정보, 및 측정된 상기 표준물질 농도로부터 상기 지지유니트로 둘러싸인 지표상에서 위치변화에 따라 나타나는 상기 표준물질의 농도변화패턴을 산출하고, 측정된 상기 오염물질 농도를 기준으로 상기 표준물질의 농도변화패턴에 따라 상기 면 오염원 내부 특정지점의오염물질 농도를 예측하는 연산을 하는 연산모듈을 포함하는 면 오염원의 대기오염물질 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 연산모듈은, 상기 대기유동정보, 상기 환경정보, 및 측정된 상기 표준물질 농도의 상관관계를 인공지능 학습 알고리즘으로 학습하여 상기 표준물질의 농도변화패턴을 산출하며, 상기 표준물질의 농도변화패턴은 상기 지표상의 위치변화에 대해 비선형 상관성을 갖는 농도변화패턴을 포함하는, 면 오염원의 대기오염물질 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,복수의 상기 지지유니트는, 상기 면 오염원의 둘레에 불규칙적으로 배치되는 면 오염원의 대기오염물질 배출량산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 인공지능 학습 알고리즘은 인공신경망 알고리즘을 포함하며, 상기 인공신경망 알고리즘은, 순방향신경망(Feed-forward neural network), 심층신경망(Deep neural network), 및 장단기메모리(long short-term memory)중의 적어도 어느 하나를 포함하는 면 오염원의 대기오염물질 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 오염물질센서는 복수로 형성되어 하나의 상기 지지유니트에, 상기 오염물질센서, 상기 표준물질생성모듈,상기 표준물질센서, 및 상기 환경센서가 적어도 하나씩 배치되는 면 오염원의 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0100165-3-제5항에 있어서,상기 지지유니트는, 하나의 상기 표준물질생성모듈이 위치하는 기준플레이트, 및 상기 표준물질생성모듈을 수용가능한 입방체 형상으로 형성되고 상기 기준플레이트에 연결되어 꼭지점마다 상기 표준물질센서가 배치되는 적어도 하나의 표준물질센서 지지체를 포함하는 면 오염원의 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 표준물질센서 지지체는, 상기 표준물질생성모듈에 대해 중력방향 및 중력과 수직한 방향 중 적어도 어느한 방향으로 반복되는 구조를 이루는 면 오염원의 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제5항에 있어서,상기 환경센서는, 풍향계, 풍속계, 위치측정기, 및 고도계를 포함하는 면 오염원의 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 환경센서는, 온도계, 습도계, 및 광센서를 더 포함하는 면오염원의 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 오염물질은 암모니아 및 황화수소 중 적어도 어느 하나를 포함하고, 상기 표준물질은 일산화탄소 및 산소중 적어도 어느 하나를 포함하는 면 오염원의 배출량 산출시스템."}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "면 오염원의 외부에서 면 오염원 내부의 대기오염물질 배출량을 산출하는 면 오염원의 대기오염물질 배출량 산출 시스템이 제공된다. 면 오염원의 대기오염물질 배출량 산출시스템은, 면 오염원의 둘레를 따라 배치되는 복수의 지지유니트, 복수의 지지유니트 중 적어도 어느 하나에 배치되는 오염물질센서, 복수의 지지유니트에 분산 배치 (뒷면에 계속)"}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 대기오염원에서 배출되는 대기오염물질 배출량을 산출하는 시스템에 관한 것으로서, 더욱 상세하게는, 면 오염원 내부로 접근하지 않고, 외부에서 면 오염원 내부의 오염물질 배출량을 정확하게 산출 가 능한 면 오염원의 대기오염물질 배출량 산출시스템에 관한 것이다."}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "대기오염물질을 생성하는 원천은 지표 상에 다양하게 분포되어 있다. 일반적으로는 점 오염원(point source), 면 오염원(are source), 선 오염원(line source)으로 오염원의 구분이 가능하며 배출형태에 따라 고정 및 이동 오염원으로도 구분할 수 있다. 면 오염원은 일정지역 안에 위치한 고정오염원일 수 있으며 지표면의 대기오염물질 확산에 직접적인 영향을 미 치는 것으로 알려져 있다. 면 오염원의 예는 다양하지만, 이를 테면 축사나 일부 공장(별도 배출구가 없는 개방 형일 수 있음)등을 포함할 수 있다. 축사의 경우에는 암모니아가 주된 배출물질일 수 있다. 이러한 면 오염원들은 대기오염의 원천이므로 지속적인 모니터링의 대상이지만, 여러 가지 이유(사유지침해, 축 사 내 가축에 대한 부정적 영향 등)로 오염원 내부에 접근하기 어려운 문제도 생겨나고 있다. 이로 인해 오염원 외부에서 내부 오염물질을 측정해야 하는 상황도 자주 생겨나고 있다. 그러나 면 오염원 내부와 외부 간 오염물질 농도에는 차이가 발생할 수 밖에 없고 간접적인 예측 등에도 한계가 있기 때문에 종래의 일반적인 측정장치(예, 대한민국실용신안 20-0465003등)로는 정확한 배출량 산출이 곤란한 문제가 있었다. 따라서 이에 대한 기술적 대안이 요구되고 있다. 한편, 본 발명의 발명자들은 2021년도 정부(과학기술정보통신부)의 재원으로 정보통신산업진흥원의 지원을 받아 연구(No. S0837-21-1034, 소규모 배출 사업장의 미세먼지 저감을 위한 IoT 모니터링 시스템 개발)를 수행하였다.선행기술문헌 특허문헌 (특허문헌 0001) 대한민국등록실용신안공보 제20-0465003호, (2013. 02. 06), 명세서"}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 기술적 과제는, 이러한 문제점을 해결하기 위한 것으로서, 면 오염원 내부로 접근하지 않고, 외부에 서 면 오염원 내부의 오염물질 배출량을 정확하게 산출 가능한 면 오염원의 대기오염물질 배출량 산출시스템을 제공하는 것이다. 본 발명의 기술적 과제는 이상에서 언급한 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아 래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 의한 면 오염원의 대기오염물질 배출량 산출시스템은, 지표상의 일정 면적을 차지하는 면 오염원의 외부에서 상기 면 오염원 내부의 적어도 어느 한 지점에 대한 대기오염물질 배출량을 산출하는 면 오염원의 대 기오염물질 배출량 산출시스템에 있어서, 상기 면 오염원의 둘레를 따라, 서로 이격되어 배치되는 복수의 지지 유니트; 복수의 상기 지지유니트 중 적어도 어느 하나에 배치되어 오염물질 농도를 측정하는 오염물질센서; 복 수의 상기 지지유니트에 분산 배치되며, 상기 오염물질센서로 측정되지 않는 표준물질을 생성하여 상기 지지유 니트 주변으로 확산시키는 복수의 표준물질생성모듈; 복수의 상기 지지유니트에 분산 배치되어 상기 표준물질 농도를 측정하는 복수의 표준물질센서; 복수의 상기 지지유니트에 분산 배치되어 상기 지지유니트 및 주변의 대 기유동정보 및 환경정보를 수집하는 복수의 환경센서; 및 상기 대기유동정보, 상기 환경정보, 및 측정된 상기 표준물질 농도로부터 상기 지지유니트로 둘러싸인 지표상에서 위치변화에 따라 나타나는 상기 표준물질의 농도 변화패턴을 산출하고, 측정된 상기 오염물질 농도를 기준으로 상기 표준물질의 농도변화패턴에 따라 상기 면 오 염원 내부 특정지점의 오염물질 농도를 예측하는 연산을 하는 연산모듈을 포함한다. 상기 연산모듈은, 상기 대기유동정보, 상기 환경정보, 및 측정된 상기 표준물질 농도의 상관관계를 인공지능 학 습 알고리즘으로 학습하여 상기 표준물질의 농도변화패턴을 산출하며, 상기 표준물질의 농도변화패턴은 상기 지 표상의 위치변화에 대해 비선형 상관성을 갖는 농도변화패턴을 포함할 수 있다. 복수의 상기 지지유니트는, 상기 면 오염원의 둘레에 불규칙적으로 배치될 수 있다. 상기 인공지능 학습 알고리즘은 인공신경망 알고리즘을 포함하며, 상기 인공신경망 알고리즘은, 순방향신경망 (Feed-forward neural network), 심층신경망(Deep neural network), 및 장단기메모리(long short-term memory) 중의 적어도 어느 하나를 포함할 수 있다. 상기 오염물질센서는 복수로 형성되어 하나의 상기 지지유니트에, 상기 오염물질센서, 상기 표준물질생성모듈, 상기 표준물질센서, 및 상기 환경센서가 적어도 하나씩 배치될 수 있다. 상기 지지유니트는, 하나의 상기 표준물질생성모듈이 위치하는 기준플레이트, 및 상기 표준물질생성모듈을 수용 가능한 입방체 형상으로 형성되고 상기 기준플레이트에 연결되어 꼭지점마다 상기 표준물질센서가 배치되는 적 어도 하나의 표준물질센서 지지체를 포함할 수 있다. 상기 표준물질센서 지지체는, 상기 표준물질생성모듈에 대해 중력방향 및 중력과 수직한 방향 중 적어도 어느 한 방향으로 반복되는 구조를 이룰 수 있다. 상기 환경센서는, 풍향계, 풍속계, 위치측정기, 및 고도계를 포함할 수 있다. 상기 환경센서는, 온도계, 습도계, 및 광센서를 더 포함할 수 있다. 상기 오염물질은 암모니아 및 황화수소 중 적어도 어느 하나를 포함하고, 상기 표준물질은 일산화탄소 및 산소 중 적어도 어느 하나를 포함할 수 있다."}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 면 오염원의 외부에 배치되는 장비들로부터 면 오염원 내부에서 발생되는 대기오염물질의 배 출량을 보다 정확하게 산출할 수 있다. 따라서 종래 접근이 어려웠던 특정 면 오염원들의 대기오염물질 배출량 에 대한 모니터링, 및 해당 면 오염원들에 대한 관리감독 등이 가능해진다. 특히 본 발명은 인공지능에 의한 데 이터 분석 및 학습을 통해 종래 예측이 곤란하였던 다양한 상황에서 보다 정확한 배출량의 예측된 값들을 제공 함으로써 종래와는 다른 수준의 정확한 대기오염물질 배출량 산출이 가능하다."}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징 그리고 그것들을 달성하기 위한 방법들은 첨부되는 도면과 함께 상세하게 후술되어 있 는 실시예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니 라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고 본 발명"}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 단지 청구항에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조부호는 동일 구성요소를 지칭한다. 본 명세서에서 '면 오염원의 대기오염물질 배출량 산출시스템'은 '면 오염원의 대기오염물질 배출량 산출장치' 로도 지칭될 수 있다. 이하, 도 1 내지 7을 참조하여 본 발명에 의한 면 오염원의 대기오염물질 배출량 산출시스템에 대해 상세히 설 명한다. 도 1은 본 발명의 일 실시예에 의한 면 오염원의 대기오염물질 배출량 산출시스템의 배치를 예시한 평면도이고, 도 2는 도 1의 대기오염물질 배출량 산출시스템을 경사가 있는 지표면에 적용한 예를 도시한 측면도이다. 도 1을 참조하면, 본 발명에 의한 면 오염원의 대기오염물질 배출량 산출시스템은 면 오염원(S)의 둘레에 배 치된 복수의 지지유니트들을 포함한다. 지지유니트들은 면 오염원(S)의 배출량 예측에 필요한 정보들을 (센서들을 통해)수집하고 수집된 정보는 연산모듈로 전송되어 연산된다. 각 지지유니트에서 수집되는 정보들에는 오염물질과 유사성이 있는 표준물질에 관한 정보가 포함되어 있다. 수집된 정보는 분석되어 확산에 의해 변동되는 오염물질 농도를 예측할 수 있는 패턴으로 산출된다. 오염물질 농도를 예측할 수 있는 패턴은 표준물질에 관한 정보, 대기유동정보, 및 환경정보 전체가 인공지능 학 습 알고리즘으로 학습되어 산출된다. 따라서 종래 분석방법(선형 회귀분석 등)으로 상관성이 명확히 도출되지 않거나 비선형 상관성을 갖는 데이터들(농도와, 지표상의 위치, 풍향, 풍속, 고도, 온도, 습도, 일사량 등)로부 터도 유의미한 패턴을 산출하여 정확한 예측에 사용할 수 있다. 이러한 본 발명의 면 오염원의 대기오염물질 배출량 산출시스템은 구체적으로 다음과 같이 구성된다. 면 오 염원의 대기오염물질 배출량 산출시스템은, 지표상의 일정 면적을 차지하는 면 오염원(S)의 외부에서 면 오 염원(S) 내부의 적어도 어느 한 지점에 대한 대기오염물질 배출량을 산출하는 면 오염원의 대기오염물질 배출량 산출시스템에 있어서, 면 오염원(S)의 둘레를 따라, 서로 이격되어 배치되는 복수의 지지유니트, 복수의 지지유니트 중 적어도 어느 하나에 배치되어 오염물질 농도를 측정하는 오염물질센서, 복수의 지지유니 트에 분산 배치되며, 오염물질센서로 측정되지 않는 표준물질을 생성하여 지지유니트 주변으로 확산시키는 복수의 표준물질생성모듈, 복수의 지지유니트에 분산 배치되어 표준물질 농도를 측정하는 복 수의 표준물질센서, 복수의 지지유니트에 분산 배치되어 지지유니트 및 주변의 대기유동정보 및 환 경정보를 수집하는 복수의 환경센서, 및 상기 대기유동정보, 상기 환경정보, 및 측정된 상기 표준물질 농도 로부터 지지유니트로 둘러싸인 지표상에서 위치변화에 따라 나타나는 표준물질의 농도변화패턴을 산출하고, 측정된 오염물질 농도를 기준으로 표준물질의 농도변화패턴에 따라 면 오염원(S) 내부 특정지점의 오염물질 농 도를 예측하는 연산을 하는 연산모듈을 포함한다. 본 발명의 일 실시예에서 연산모듈은, 대기유동정보, 환경정보, 및 측정된 표준물질 농도의 상관관계를 인 공지능 학습 알고리즘으로 학습하여 표준물질의 농도변화패턴을 산출하며, 표준물질의 농도변화패턴은 지표상의 위치변화에 대해 비선형 상관성을 갖는 농도변화패턴을 포함할 수 있다. 또한, 본 발명의 일 실시예에서 오염물질센서는, 복수로 형성되어 하나의 지지유니트에 오염물질센서 , 표준물질생성모듈, 표준물질센서, 및 환경센서가 적어도 하나씩 배치될 수 있다. 이하 이러 한 본 발명의 일 실시예에 기초하여 본 발명의 구성 및 작용효과 등을 보다 상세히 설명한다. 본 발명의 면 오염원(S)은 대기오염원 중에서 지표상에 면으로 나타나는 것을 의미한다. 면 오염원(S)은 지표상 의 일정 면적을 차지하는 것으로서 예를 들면, 공장, 축사 등일 수 있다. 본 실시예에서는 축사를 예시로 하여 설명한다. 면 오염원(S)은 지표상에 형성된 것이므로 지표의 고저가 반영된다. 즉 도 2에 도시된 바와 같이 산지에 형성된 축사 등 여러 경우에 면 오염원(S)은 완전한 평면형태가 아닐 수 있다. 따라서 오염물질 농도 예측 시 지면과 수직한 방향으로의 확산, 고저 차에 의한 습도 및 온도 변화가 미치는 영향 등도 고려할 필요가 있다. 종래에는 면 오염원(S)에 대해 이러한 정밀한 조건들이 고려되지 않았기 때문에, 외부에서 내부 배출량을 예측 하더라도 오차가 심하였다. 또한 예측방식도 외부 측정값을 단순 거리비례로 내삽 또는 외삽하는 방식에 불과하 였기 때문에 오차가 더욱 심하였다. 본 발명은 이러한 조건들을 모두 데이터화하여 저장, 학습(머신 러닝)하고 학습 결과에 따라 물질확산과 농도변화를 예측하므로, 매우 정확하게 면 오염원(S)의 대기오염물질 배출량을 산 출할 수 있다. 지지유니트는 도 1 및 도 2에 도시된 것처럼, 면 오염원(S)의 둘레를 따라, 복수 개가 서로 이격되어 배치 된다. 각각의 지지유니트는 자체로도 물질의 확산 거동을 파악할 수 있는 측정공간을 형성하며 복수 지지유 니트들 전체가 면 오염원(S) 둘레에 분산 배치되어 상호 연계되므로 지지유니트들의 연계에 의해 보다 확대된 측정공간도 동시에 형성된다. 따라서 개별 지지유니트 및/또는 복수 지지유니트들로부터 배출량 예측에 필요한 정보들을 효과적으로 수집할 수 있다. 오염물질센서는 복수의 지지유니트 중 적어도 어느 하나에 배치될 수 있다. 본 실시예에서는 지지유니 트마다 오염물질센서가 각각 배치된 예를 기준으로 설명하지만, 다른 실시예에서는 복수 지지유니트 전체를 서로 연계되어 확장된 측정공간을 이루는 일종의 망 구조로 고려하여 그 중 필요한 지지유니트(1 0)에만 오염물질센서를 배치하는 것도 가능하다. 오염물질센서는 타겟인 오염물질을 측정 가능한 다양한 방식으로 형성된다. 예를 들어, 면 오염원(S)이 축 사인 경우, 주된 오염물질은 암모니아(NH3), 황화수소(H2S)등일 수 있으며, 오염물질센서는 해당 오염물질을 측정 가능한 센서로 형성될 수 있다. 오염물질센서는 복수의 센서들이 조합되어 있는 것을 배제하지 않으므 로 복수 센서의 조합으로 형성되어도 무방하다. 표준물질생성모듈은 복수 개가 복수의 지지유니트에 분산 배치되며, 오염물질센서로 측정되지 않는 표준물질을 생성하여 지지유니트 주변으로 확산시킨다. 표준물질생성모듈 역시 본 실시예에서는 지지유 니트마다 각각 배치된 예를 기준으로 설명하지만, 다른 실시예에서는 복수 지지유니트 전체를 서로 연 계되어 확장된 측정공간을 이루는 망 구조로 고려하고 복수의 선택된 지지유니트에 표준물질생성모듈을 배치하는 것도 가능하다. 표준물질생성모듈은 표준물질을 생성할 수 있는 다양한 형태로 형성될 수 있으므로 구조나 작동방식 등으로 한정될 필요는 없다. 예를 들어, 기화에 의해 표준물질 입자를 확산시키는 고체물질이 포함된 형태, 용기 내 표 준물질 기체가 담긴 형태, 액체로부터 기화시켜 표준물질을 생성하는 형태 등 표준물질에 따라 가능한 여러 형 태로 표준물질생성모듈을 구현할 수 있다. 표준물질은 표준물질센서로 측정가능한 물질로, 바람직하게는 오염물질센서로는 탐지되지 않는 물질을 사용 한다. 따라서 오염물질센서의 불필요한 작동을 유발하지 않고 주변공간으로 확산시킬 수 있다. 또한, 표준 물질은 인체나 환경에 미치는 위해도가 적은 것이 바람직하다. 또한, 표준물질은 타겟인 오염물질과 분자량이 유사한 것일수록 바람직하며, 따라서 오염물질에 따라 종류가 상이한 표준물질이 적용될 수도 있다. 예를 들어, 오염물질이 암모니아 및 황화수소 중 적어도 어느 하나를 포함하는 경우, 표준물질은 일산화탄소(CO) 및 산소 (O2) 중 적어도 어느 하나를 포함할 수 있다. 일산화탄소는 유독성물질이지만 적정 농도로 희석하여 야외의 넓은 공간에 확산시키면 실질적인 피해 없이 표준물질로도 사용이 가능하다. 즉, 물질 자체의 유해성과 관계 없이, 실질적으로 유해성을 피할 수 있다면, 표준물질로 적용 가능하다. 만족스러운 표준물질을 찾기 어려운 경우에는, 임의의 물질을 표준물질로 선정하고 오염물질과 선정된 표준물질 사이의 거동 유사성 등을 파악한 후 추가적인 보정을 해주는 것도 가능하다. 예를 들어, 동일조건에서 오염물질 과 표준물질을 동일공간에 확산시키고, 각각에 대한 센서로 둘 사이의 거동 차이를 파악하고, 차이를 보정하는 보정계수 등을 산출하여 추가적인 보정을 해 줄 수 있다. 이러한 보정 시에도 인공지능 학습 알고리즘으로 데이 터를 학습시켜 서로 간의 차이를 패턴 등으로 도출하고 차이를 제거하는 보정을 하는 것도 얼마든지 가능하다. 표준물질센서는 복수 개가 복수의 지지유니트에 분산 배치되어 표준물질 농도를 측정한다. 표준물질센 서는 표준물질을 측정할 수 있는 한도 내에서 방식 등이 특별히 제한될 필요는 없다. 특히 표준물질센서 는 하나의 지지유니트 상에도 복수 개가 배치될 수 있으며, 후술하는 것처럼 공간 상에 주기적으로 배 열되어 표준물질생성모듈을 둘러싸는 구조적 배치를 형성할 수 있다. 지지유니트의 구조적 특징은 후술 하여 좀더 상세히 설명한다. 환경센서는 복수 개가 복수의 지지유니트에 분산 배치되어, 지지유니트 주변의 대기유동정보 및 환 경정보를 수집한다. 환경센서 역시 복수 센서들의 조합으로 형성될 수 있으며, 예를 들면 다음과 같은 장치 들의 복합으로 형성될 수 있다. 환경센서는 풍향계, 풍속계, 위치측정기, 및 고도계를 포함할 수 있으며, 필요에 따라 온도계, 습도계, 및 광센서를 더 포함할 수 있다. 즉 환경센서는 원하는 환경조건을 측정할 수 있는 다양한 기기들의 조합으로 형성될 수 있다. 그러나 그와 같이 한정될 필요는 없으며 환경센서는 데이터 통신 등을 통해 국가전산망 등 에 연결되어 필요한 환경정보를 제공받는 형태로도 구현이 가능하다. 다만 본 실시예에서는 복수 기기들이 조합 된 형태로 설명한다. 환경센서는, 면 오염원(S) 둘레에 배치된 지지유니트 상에서 측정지역의 대기유동정보를 풍향계 및 풍 속계로 수집할 수 있고, 지표상의 위치와 고저에 대한 정보를 위치측정기(예, GPS장치) 및 고도계로 수집할 수 있다. 또한, 온도, 습도, 및 일사량(광량으로부터 측정)에 대한 정보를 온도계, 습도계, 및 광센서로 수집할 수 있다. 따라서 환경정보는 지표상의 위치와 고저, 및 온도, 습도, 일사량 등 면 오염원(S)이 위치한 지역과 그 주변 환 경의 획득 가능한 정보를 대부분 포함할 수 있다. 나열된 외에도 환경정보는 대응하는 측정기 등을 이용하여 필 요에 따라 얼마든지 추가될 수 있다. 연산모듈은, 환경센서로부터 수집된 대기유동정보와 환경정보, 및 표준물질센서로부터 측정된 표준 물질 농도로부터, 지지유니트로 둘러싸인 지표상에서 위치변화에 따라 나타나는 표준물질의 농도변화패턴을 산출한다. 또한 연산모듈은 오염물질센서에서 측정된 오염물질 농도를 기준으로, 산출된 표준물질의 농 도변화패턴에 따라 면 오염원(S) 내부 특정지점의 오염물질 농도를 예측하는 연산도 병행한다. 연산모듈의 연산과정과 구성을 도 3을 참조하여 좀더 상세히 설명한다. 도 3은 도 1의 대기오염물질 배출량 산출시스템의 연산모듈에 의한 농도변화패턴의 산출과정을 도시한 개념도이 다. 우선 연산모듈은 일종의 컴퓨터장치로 형성될 수 있다. 연산모듈에서 수행되는 연산은 하나 또는 둘 이 상의 cpu 상에서 실행되는 하나 또는 둘 이상의 연산프로그램에 의할 수 있다. 연산모듈은 지지유니트 와는 떨어져서 원격으로 배치될 수 있으나, 지지유니트에 위치한 오염물질센서, 표준물질센서, 환 경센서들과는 유선 또는 무선으로 데이터통신이 가능하게 연결될 수 있다. 따라서 도 3과 같이 오염물질센 서, 표준물질센서, 환경센서 각각이 수집하여 전송한 데이터들을 알고리즘에 의해 연산할 수 있다. 연산모듈은 특히 인공지능 학습 알고리즘으로 각 센서들이 전송한 데이터를 반복하여 학습한다. 다수 데이 터들의 관계를 일종의 패턴으로 파악하고 패턴 학습, 학습된 패턴의 비교 등을 통해 패턴을 분류하는 것도 가능하다. 이러한 인공지능 학습 알고리즘에 의한 기계 학습을 통해서, 연산모듈은 지지유니트(도 1 및 도 2의 10참조)로 둘러싸인 지표(즉, 면 오염원이 위치한 측정공간)상에서 위치변화에 따라 나타나는 표준물질의 농도 변화패턴을 산출한다. 연산모듈의 인공지능 학습 알고리즘은, 입력층과 출력층 사이에 복수의 계산 노드들로 이루어진 은닉층이 적어도 하나 형성된 인공신경망(ANN: Artificial neural network) 알고리즘을 포함하며, 인공신경망 알고리즘은, 순방향신경망(Feed-forward neural network), 심층신경망(Deep neural network), 및 장단기메모리 (long short-term memory) 중의 적어도 어느 하나를 포함할 수 있다. 보다 상세히 설명하면, 인공신경망 알고리즘에서 각 층의 노드들은 가중치 부여된 함수들일 수 있다. 이들은 네 트워크 형태로 인공적인 뉴런을 구성하며 알고리즘에 따라 이들의 합성에 의한 연산이 수행된다. 데이터는 입력 층의 노드들에 입력된 후 이로부터 은닉층에 형성된 복수의 노드들을 거쳐, 출력층의 노드들로 전파되며 연산된 다. 연산과정에서 노드의 가중치는 역전파법(back propagation) 등에 의해 갱신되어 결과가 최적화되도록 구성될 수 있다. 따라서 연산에 의한 결과로부터 예를 들면, 비선형 상관관계 등 입력데이터간 다양한 상관관계가 나타난 모델링 등이 가능하고, 다수, 다종의 입력데이터에서 종래 손쉽게 파악하기 어려운 데이터간 연관성, 유사성 등 도 파악된다. 각 노드나 노드를 합성하거나 노드의 결과를 처리하는 함수 등을 적절히 조정하거나 선택하여, 원 하는 종류의 연산을 수행하는 인공신경망을 구성할 수 있다. 순방향신경망, 심층신경망, 장단기메모리는 알려진 인공신경망들 중 하나로 각각 다음과 같은 특징이 있다. 순 방향신경망은 예를 들어 근사와 추정에 적합하게 사용될 수 있고, 심층신경망은 딥 러닝을 통해 복잡한 데이터 에서 보다 핵심적인 내용을 추출하는 데 효과적일 수 있다. 장단기메모리는 순환신경망(RNN: Recurrent neural network)을 개선시킨 것으로 순환신경망과 같이 시간이 포함된 데이터 처리에 유리하며 순환신경망보다 장기의 데이터를 고려하므로 경로 예측 등에 효과적일 수 있다. 연산모듈은 이러한 인공신경망 알고리즘 중 적어도 어느 하나로 면 오염원 둘레에서 수집된 데이터를 학습 하여 면 오염원 주변 및/또는 내부까지 지표상의 위치변화에 따라 나타나는 표준물질의 농도변화패턴을 산출할 수 있다. 상기한 신경망들에 의해, 학습에는 수집된 데이터에 의한 예측도 포함될 수 있다. 농도변화패턴은, 학 습된 데이터들의 조합으로 구성된 것일 수 있으며, 면 오염원 둘레에서 수집한 측정공간에 대한 정보의 총체가 반영되어 있으므로 변동하는 정보(예, 풍향, 풍속 등 대기유동정보 및 온도, 습도, 일사량 등 환경정보)들의 세 트에 대응하여 복수로 산출될 수 있다. 예를 들어, 온도, 습도, 일사량, 및 풍향, 풍속이 특정된 환경조건(환경조건1)에서 지표상의 위치변화에 따른 표준물질의 농도변화분포가 나타난 농도변화패턴(농도변화패턴1)이 산출되면, 온도, 습도, 일사량, 및 풍향, 풍 속이 변화된 환경조건(환경조건2)에서는 대응하여 지표상의 위치변화에 따른 표준물질의 농도변화분포가 바뀐 변화된 농도변화패턴(농도변화패턴2)이 산출될 수 있다. 이러한 산출이 데이터 학습과정에서 반복, 갱신될 수 있다. 환경조건의 조합에 따라 무수히 많은 농도변화패턴을 산출, 저장, 및 갱신하면서, 오염물질 배출량 예측 시점의 환경조건과 매칭되는 정확한 농도변화패턴으로 오염물질 배출량을 예측할 수 있다. 표준물질의 농도변화패턴은 예를 들어, 온도, 습도, 일사량, 풍향, 풍속 등 환경조건이 특정된 상태에서, 지표 상에서 위치가 바뀔 때 확산에 의해 바뀌는 농도 변화량 또는 변화비율의 분포가 일종의 맵 형태로 나타난 것일 수도 있다. (전술한 바와 같이 학습은 예측을 포함하므로 농도 변화량 또는 변화비율 분포는 학습과정에서 예측 된 데이터도 적어도 부분적으로 포함될 수 있다) 예를 들면, 측정공간(면 오염원이 위치한 지표상의 공간) 내 한 점과 다른 점간 변위에 대응하는 농도변화의 비율이 각 점마다 정의되어 있는 농도변화패턴도 얼마든지 산출 가능하다. 따라서 농도변화패턴에 따라서 공간 상의 농도 변화량을 역으로 추적하면 면 오염원 바깥에서 측정한 오염물질 농도값으로부터 면 오염원 내부 특정지점의 오염물질 배출량도 편리하게 예측할 수 있다. 즉, 면 오염원 내부 특정지점의 오염물질의 배출량은, 오염물질센서가 면 오염원 바깥에서 측정한 오염물질 농도를 기준으로, 산출된 표준물질의 농도변화패턴에 따라 예측할 수 있다. 표준물질과 오염물질의 분자량이 거 의 유사한 경우, 산출된 표준물질의 농도변화패턴을 오염물질에 그대로 적용하여 면 오염원 내 지점의 오염물질 배출량을 예측할 수 있다. 또한, 전술한 것처럼 오염물질과 표준물질 사이에 차이가 있어 바로 적용이 어려운 경우에는 차이를 제거할 수 있는 보정을 전술한 인공지능 학습 알고리즘 등으로 수행하고 역시 산출된 농도변화패턴을 이용하여 면 오염원내 오염물질 배출량을 예측할 수 있다. 이상의 농도변화패턴 산출 및 적용방식은 구체적인 상황을 개념적으로 예시한 것이며, 구체적인 적용방식은 지 지유니트를 어떻게 활용하는 지에 따라 달라질 수 있다. 전술한 것처럼 각 지지유니트 자체가 물질의 확산 거동 을 파악할 수 있는 공간을 형성하므로 각 지지유니트에서 수집한 데이터를 지지유니트 별로 학습시킨 후 복수 지지유니트들의 학습결과를 종합하여 농도변화패턴을 산출하는 것도 가능하며, 또한, 면 오염원 둘레에 분산 배 치된 복수 지지유니트들 전체가 (면 오염원까지 포함하는)확대된 측정공간을 형성하는 것으로도 볼 수 있으므로, 복수 지지유니트들 전체에서 수집된 데이터를 한꺼번에 학습시켜 면 오염원이 포함된 전체 공간에 대 한 표준물질의 농도변화패턴을 바로 산출하는 것도 가능하다. 이하, 지지유니트의 구조를 좀더 상세히 설명한 후, 표준물질의 농도변화패턴 산출 및 적용방식 등을 좀더 구체 적으로 예시 설명한다. 도 4는 도 1의 대기오염물질 배출량 산출시스템의 지지유니트의 구조와 그 변형례를 오염물질센서, 표준물질센 서, 및 환경센서와 함께 도시한 도면이다. 도 4를 참조하면, 지지유니트는 하나의 표준물질생성모듈이 위치하는 기준플레이트 및 표준물질생 성모듈을 수용가능한 입방체 형상의 표준물질센서 지지체를 포함한다. 표준물질센서 지지체는 기 준플레이트에 연결되며 입방체의 꼭지점마다 표준물질센서가 배치된다. 지지유니트는 표준물질센 서 지지체를 적어도 하나 포함할 수 있다. 모든 표준물질센서 지지체가 기준플레이트와 반드시 직접 연결될 필요는 없지만 적어도 하나는 기준 플레이트와 직접 연결된다. 추가된 표준물질센서 지지체는 다른 표준물질센서 지지체에 결합되 어 간접적으로 기준플레이트에 연결될 수 있다. 표준물질센서 지지체와 기준플레이트의 연결은 이러한 직, 간접 연결을 포함한다. 표준물질센서 지지체의 한 변은 예를 들어, 미터 단위의 길이를 가질 수 있다. 따라서 도 4의 (a), (b), (c)에 예시된 형태 각각은 수직 및 수평방향으로 수 미터 길이의 입체적인 점유공간을 갖게 된다. 이러한 공간 은 표준물질센서 지지체의 꼭지점마다 배치되는 다수의 표준물질센서에 의해 둘러싸여 있으므로, 표준 물질생성모듈에서 확산된 표준물질의 농도 변화를 측정하기 매우 유리하다. 표준물질센서 지지체는, 표준물질생성모듈에 대해 중력방향 및 중력과 수직한 방향 중 적어도 어느 한 방향으로 반복되는 구조를 이룰 수 있다. 그에 따라 예를 들어, 도 4의 (b)와 같이 수직방향으로 연장된 다층구 조인 지지유니트(10-1) 나, 도 4의 (C)와 같이 수직 및 수평방향으로 모두 연장된 복합적 다층구조인 지지유니 트(10-2) 등으로 다양하게 변형할 수 있다. 이러한 구조의 지지유니트는 실질적으로 표준물질생성모듈을 상하 좌우로 다수의 표준물질센서가 둘러싸는 구조이기 때문에, 표준물질의 확산경로에 위치한 표준물질센서들로 위치변화에 따른 표준물질의 농도변화를 효과적으로 측정할 수 있다. 표준물질센서 지지체를 반복적으로 다수 연결하거나 변의 길이를 증가시키면, 지지유니트가 점유하는 공간도 확대할 수 있고, (실측되는 공간이 증가하므로)표준물질의 농도 변화패턴의 정확도도 향상시킬 수 있다. 지지유니트의 다른 지점에는 오염물질센서 및 환경센서를 배치할 수 있으며, 남은 공간에는 또 다 른 센서나 데이터 통신용 기기, 전원 기기와 같은 추가기기도 편리하게 배치할 수 있다. 본 발명의 지지유 니트는 자체적으로 이와 같이 공간을 입체적으로 점유하도록 구성되어 있다. 도 5는 각 지지유니트에서 이루어지는 표준물질의 측정상황을 예시한 도면이다. 이러한 지지유니트의 구조를 이용하여 우선적으로, 도 5와 같이 지지유니트가 점유하는 공간 내에서 표 준물질생성모듈이 생성한 표준물질이 어떻게 확산되고 농도가 변화되는지 측정할 수 있다. 표준물질은 도 5 의 (a)처럼 평면 상에서 바뀌는 바람(W)방향으로 더 많이 확산되므로, 표준물질센서들은 표준물질생성모듈 과 (입방체 형상의 표준물질 지지체에 의해) 대략 동일간격으로 떨어져 있더라도 서로 다른 농도값(A, B, C, D)을 검출할 수 있다. 마찬가지로, 표준물질은 도 5의 (b)와 같이 측면 상에서 바뀌는 바람(W) 방향으로도 더 많이 확산된다. 따라서 표준물질센서들은 표준물질생성모듈과 상하방향으로 대략 동일간격 떨어져 있더라도 역시 서로 다른 농 도값(A, B, A', B', A\", B\")을 검출할 수 있다. 이와 같이 표준물질센서들은 표준물질생성모듈 둘레에서 입체적으로 농도변화를 검출할 수 있다. 측정 된 농도값들은 측정시 환경센서가 수집한 대기유동정보(풍향 및 풍속) 및 환경정보(지표상의 위치, 고도, 온도, 습도, 일사량 등)와 함께 연산모듈(도 1 내지 도 3의 30참조)로 전송되어 학습된다. 반복되는 데이터 수 집, 전송, 및 학습과정을 통해서, 연산모듈은 각 표준물질센서가 배치된 지점뿐만 아니라 표준물질센서 사이의 지점 등 학습을 통해 예측이 가능한 지점의 농도변화들도 함께 산출할 수 있다. 이를 통해 표준물 질의 농도변화분포가 산출될 수 있다. 이러한 표준물질의 농도변화분포는 서로 다른 복수의 지지유니트 각각에서 수집된 정보에 의해 개별적으로 산출된 후 서로 종합될 수 있다. 모든 지지유니트들은 면 오염원의 둘레에 인접하고 있으므로, 이와 같이 지지유니트들에 대해 산출된 표준물질의 농도변화분포를 지지유니트로 둘러싸인 지표상에서 위치변화에 따라 나타나는 표준물질의 농도변화패턴으로 환산 적용할 수 있다. 이러한 경우에는 예를 들어, 지지유니트(1 0)의 거리단위를 거리비례를 통해 면 오염원 내부의 확대된 거리단위로 환산시켜 오염물질의 농도를 예측하는 데 사용할 수 있다. 도 6 및 도 7은 복수의 지지유니트가 연동되어 이루어지는 표준물질의 측정상황들을 예시한 도면이다. 한편 농도변화패턴은 예를 들어, 도 6에 도시된 바와 같이 면 오염원(S) 둘레에 분산 배치된 복수 지지유니트 들 전체를 한꺼번에 활용하여 산출될 수도 있다. 복수 지지유니트들은 확장된 공간에 서로 떨어져 있기 때문에, 공간 상에서 보다 넓게 형성되는 대기유동 (도시된 바람(W)방향을 따라 면 오염원을 연속적으로 가로지는 유선으로 생각할 수 있다)을 복수 지지유니트 들로부터 예측해 볼 수 있다. 예를 들면, 각 지지유니트들을 면 오염원(S)을 둘러싸는 전체공간의 한 점으로 보고, 바람방향은 서로 인접한 점들을 통과할 때 방향이 급격히 변하지 않는 일반적인 상황을 가정하면 데이터학습을 통해 면 오염원(S)을 통과하는 대기유동의 예측도 가능하다. 전술한 것처럼 학습은 예측을 포함하 므로 풍향 및 풍속 데이터의 반복된 학습을 통해 측정되지 않은 면 오염원(S) 내부의 유동방향도 예측될 수 있 다. 이와 같이 면 오염원을 통과하는 대기유동이 예측 가능하므로, 각 지지유니트에서 전송된 표준물질센서(2 3)들의 농도값의 변화를 한꺼번에 학습시키면, 복수 지지유니트들로 둘러싸인 면 오염원(S)과 그 주변 전체 가 단일한 측정공간으로 학습되어 해당 전체공간에 대해 면 오염원(S)을 가로지르는 대기유동에 의해 발생되는 표준물질의 농도변화분포가 바로 산출될 수도 있다. 즉 복수 지지유니트들 전체가 서로 다른 바람(W)에 의해 각 방향으로 더 많이 확산되는 표준물질센서들 의 농도값들을 측정하고, 농도측정값은 측정시 대기유동정보(풍향 및 풍속) 및 환경정보(지표상의 위치, 고도, 온도, 습도, 위치 일사량 등)와 함께 연산모듈(도 1 내지 도 3의 30참조)로 전송되어 한꺼번에 학습될 수 있다. (각 지지유니트 들에서 확산의 차이에 의해 서로 다르게 나타나는 표준물질의 농도측정값들은 각각 A1~D1, A2~D2, A3~D3로 표시되었으며 이는 도7도 같다) 이러한 농도변화패턴 산출방식은 실질적으로 전술한 지지유니트로 점유된 공간에 대한 학습방식과도 크게 다르지 않다. 단지 지지유니트가 점유한 공간이 면 오염원이 분포한 전공간으로, 지지유니트의 점유공간을 둘러 싸는 표준물질센서가 면 오염원을 둘러싸는 복수의 지지유니트로 각각 대응하여 바뀐 정도로 볼 수도 있다. 따라서 데이터 학습을 통해 지지유니트들이 배치되지 않은 지역(면 오염원 내부 지역을 포함함)의 표준물질 농도변화분포도 예측하여 산출할 수 있고, 확장된 공간 전체에 대해 산출된 표준물질의 농도변화분포를 지지유 니트로 둘러싸인 지표상에서 위치변화에 따라 나타나는 표준물질의 농도변화패턴으로 바로 적용할 수도 있 다. 이처럼 표준물질의 농도변화패턴이 산출되면 역시 면 오염원(S) 내부 특정지점에 대한 오염물질 농도는 면 오염 원(S) 둘레에서 측정한 오염물질 농도로부터 역산하여 바로 예측할 수 있다. 지지유니트들은 환경센서에 포함된 위치측정기(GPS등)에 의해 지표상의 위치나 상대거리 등이 정확하게 알려져 있으므로, 이들을 정확히 등간격으로 배치할 필요는 없다. 따라서 도 7에 도시된 바와 같이, 비정형적 형상의 면 오염원(S-1) 둘레에도 지지유니트들을 원하는 위치에 자유롭게 배치하여 측정할 수 있다. 복수의 지지유니트는 면 오염원(S)의 둘레에 이와 같이 불규칙적으로 배치될 수 있을 뿐만 아니라, 전술한 바와 같이 각각 개별적으로 데이터를 수집하여 개별 점유공간에 대한 농도변화분포 등의 산출도 가능하므로, 얼 마든지 개별 배치하여 사용할 수 있다. 즉 측정공간의 바람(W)방향 등을 고려하여 확산이 더 많이 일어나는 쪽으로 지지유니트의 개수를 추가하여 측정하는 것도 얼마든지 가능하다. 이러한 방식으로 복수의 지지유니트를 다양한 형태의 면 오염원(S) 둘레에 배치하여 오염원(S) 내부 특정 지점의 오염물질 농도를 산출할 수 있다."}
{"patent_id": "10-2021-0189845", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상 첨부된 도면을 참조하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있 다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적 이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2021-0189845", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 의한 면 오염원의 대기오염물질 배출량 산출시스템의 배치를 예시한 평면도이다. 도 2는 도 1의 대기오염물질 배출량 산출시스템을 경사가 있는 지표면에 적용한 예를 도시한 측면도이다. 도 3은 도 1의 대기오염물질 배출량 산출시스템의 연산모듈에 의한 농도변화패턴의 산출과정을 도시한 개념도이 다. 도 4는 도 1의 대기오염물질 배출량 산출시스템의 지지유니트의 구조와 그 변형례를 오염물질센서, 표준물질센 서, 및 환경센서와 함께 도시한 도면이다. 도 5는 각 지지유니트에서 이루어지는 표준물질의 측정상황을 예시한 도면이다. 도 6 및 도 7은 복수의 지지유니트가 연동되어 이루어지는 표준물질의 측정상황들을 예시한 도면이다."}
