{"patent_id": "10-2022-0122623", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0043488", "출원번호": "10-2022-0122623", "발명의 명칭": "멀티모달 딥 러닝 모델을 이용한 녹내장 환자의 미래 시야 예측 방법", "출원인": "사회복지법인 삼성생명공익재단", "발명자": "한종철"}}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 모델을 이용한 녹내장 환자의 미래 시야 예측 방법에 있어서,OCT 데이터에 포함된 특징을 추출하여 OCT 특징 데이터를 획득하는 단계;시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 단계;상기 예측모델의 출력결과를 이용하여 최근 시야검사 데이터 및 상기 최근 시야검사 데이터에 대응하는 최근 시간 정보(Last time info)에 기초하여 최종 시야예측 결과를 획득하는 단계를 포함하는,녹내장 환자의 미래 시야 예측 방법."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 단계는,상기 OCT 특징 데이터, 상기 시야검사 데이터 및 상기 시간 정보를 연결하여 다차원 벡터를 생성하는 단계 및상기 다차원 벡터를 LSTM 네트워크에 입력하는 단계를 포함하는,녹내장 환자의 미래 시야 예측 방법."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 OCT 특징 데이터가 누락된 경우 마스크 정보를 이용하여 가상의 OCT 데이터를 생성하는 단계를 더 포함하고,상기 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 단계는,상기 시야검사 데이터, 상기 가상의 OCT 데이터 및 시간 정보를 예측모델에 입력하는 단계를 포함하는,녹내장 환자의 미래 시야 예측 방법."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 OCT 특징 데이터는 환자의 전체 시야에 대한 정보를 제공하는 두께맵 특징 및 환자 시야의 특정 영역에 대한 정보를 제공하는 수직 및 수평 단층맵 특징을 포함하는,녹내장 환자의 미래 시야 예측 방법."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 인공지능 모델은 노이즈의 정도에 기초하여 가중치가 재지정된 시야검사 데이터 샘플에 의해 훈련된, 녹내장 환자의 미래 시야 예측 방법."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서공개특허 10-2024-0043488-3-상기 인공지능 모델의 손실함수는 weighted MSE를 포함하고, 상기 weighted MSE는 수학식 1을 포함하는,[수학식 1](는 재조정된 가중치, 는 예측된 시야검사 데이터, 는 정답 값)녹내장 환자의 미래 시야 예측 방법."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "인공지능 모델을 이용한 녹내장 환자의 미래 시야 예측 장치에 있어서,OCT 데이터 및 시야검사 데이터가 입력되는 입력부;시야예측 결과를 출력하는 출력부 및OCT 데이터에 포함된 특징을 추출하여 OCT 특징 데이터를 획득하고, 시야검사 데이터, 상기 OCT 특징 데이터 및시간 정보를 예측모델에 입력하고, 상기 예측모델의 출력결과를 이용하여 최근 시야검사 데이터 및 상기 최근시야검사 데이터에 대응하는 최근 시간 정보(Last time info)에 기초하여 최종 시야예측 결과를 획득하는 제어부를 포함하는,녹내장 환자의 미래 시야 예측 장치."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 제어부가 상기 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 동작은,상기 OCT 특징 데이터, 상기 시야검사 데이터 및 상기 시간 정보를 연결하여 다차원 벡터를 생성하는 단계 및상기 다차원 벡터를 LSTM 네트워크에 입력하는 동작을 포함하는,녹내장 환자의 미래 시야 예측 장치."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7항에 있어서, 상기 제어부가 상기 OCT 특징 데이터가 누락된 경우 마스크 정보를 이용하여 가상의 OCT 데이터를 생성하고, 상기 시야검사 데이터, 상기 가상의 OCT 데이터 및 시간 정보를 예측모델에 입력하는,녹내장 환자의 미래 시야 예측 장치."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 7항에 있어서,상기 OCT 특징 데이터는 환자의 전체 시야에 대한 정보를 제공하는 두께맵 특징 및 환자 시야의 특정 영역에 대한 정보를 제공하는 수직 및 수평 단층맵 특징을 포함하는,녹내장 환자의 미래 시야 예측 장치."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 7항에 있어서,상기 인공지능 모델은 공개특허 10-2024-0043488-4-노이즈의 정도에 기초하여 가중치가 재지정된 시야검사 데이터 샘플에 의해 훈련된, 녹내장 환자의 미래 시야 예측 장치."}
{"patent_id": "10-2022-0122623", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 7항에 있어서상기 인공지능 모델의 손실함수는 weighted MSE를 포함하고, 상기 weighted MSE는 수학식 1을 포함하는,[수학식 1](는 재조정된 가중치, 는 예측된 시야검사 데이터, 는 정답 값)녹내장 환자의 미래 시야 예측 장치."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예는 인공지능 모델을 이용한 녹내장 환자의 미래 시야 예측 방법에 있어서, OCT 데이터에 포함 된 특징을 추출하여 OCT 특징 데이터를 획득하는 단계, 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 단계, 상기 예측모델의 출력결과를 이용하여 최근 시야검사 데이터 및 상기 최근 시야검사 데이터에 대응하는 최근 시간 정보(Last time info)에 기초하여 최종 시야예측 결과를 획득하는 단계를 포함하는, 녹내장 환자의 미래 시야 예측 방법 및 장치를 개시한다."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 멀티모달 딥 러닝 모델을 이용한 녹내장 환자의 미래 시야 예측 방법에 관한 것이다."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "녹내장은 실명으로 이어질 수 있는 진행성 시신경병증에 해당한다. 상기녹내장을 모니터링하기 위해 시야 (Visual Field) 테스트와 광간섭 단층촬영(OCT) 이미지를 사용하는 것이 일반적이다. 한편 종래의 인공지능을 이용한 녹내장 판단 방법에 있어서, 시야검사(VF test)는 일반적으로 초기 결함 패턴을 기반으로 진행되기 때문 에 미래 시야를 예측하기 위해 이전 시야검사 데이터가 일반적으로 요구되었다. 또한 다른 방법으로 VAE(variational autoencoder), 시계열 데이터를 관리하기 위한 RNN(Recurrent Neural Network) 모델을 사용되었다. 한편 상기 방법들은 장기간의 시간이 요구되며, 환자의 상태에 따라 일관되지 않 은 결과를 얻는 등 VF 데이터를 획득하는 데 어려움이 존재하였다. 본 발명은 상기 문제점을 해결하기 위하여 안출된 것으로써, 시야검사 외에도 녹내장과 관련된 시신경두 손상 에 관한 구조적 정보를 제공하는 빛간섭 단층촬영(OCT, optical coherence tomography) 데이터를 함께 활용한 방법을 개시하고자 한다."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 실명으로 악화될 수 있는 녹내장 질환에 대해 미래의 시야손상 패턴을 예측하는 멀티모달 딥러닝 모 델을 개발하기 위함이다."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 인공지능 모델을 이용한 녹내장 환자의 미래 시야 예측 방법에 있어서, OCT 데이 터에 포함된 특징을 추출하여 OCT 특징 데이터를 획득하는 단계, 시야검사 데이터, 상기 OCT 특징 데이터 및 시 간 정보를 예측모델에 입력하는 단계, 상기 예측모델의 출력결과를 이용하여 최근 시야검사 데이터 및 상기 최 근 시야검사 데이터에 대응하는 최근 시간 정보(Last time info)에 기초하여 최종 시야예측 결과를 획득하는 단 계를 포함하는, 녹내장 환자의 미래 시야 예측 방법을 개시한다. 또한, 상기 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 단계는, 상기 OCT 특 징 데이터, 상기 시야검사 데이터 및 상기 시간 정보를 연결하여 다차원 벡터를 생성하는 단계 및 상기 다차원벡터를 LSTM 네트워크에 입력하는 단계를 포함할 수 있다. 또한, 상기 OCT 특징 데이터가 누락된 경우 마스크 정보를 이용하여 가상의 OCT 데이터를 생성하는 단계를 더 포함하고, 상기 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 단계는, 상기 시 야검사 데이터, 상기 가상의 OCT 데이터 및 시간 정보를 예측모델에 입력하는 단계를 포함할 수 있다. 또한, 상기 OCT 특징 데이터는 환자의 전체 시야에 대한 정보를 제공하는 두께맵 특징 및 환자 시야의 특정 영 역에 대한 정보를 제공하는 수직 및 수평 단층맵 특징을 포함할 수 있다. 또한, 상기 인공지능 모델은 노이즈의 정도에 기초하여 가중치가 재지정된 시야검사 데이터 샘플에 의해 훈련될 수 있다. 또한, 상기 인공지능 모델의 손실함수는 weighted MSE를 포함하고, 상기 weighted MSE는 수학식 1을 포함할 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "( 는 재조정된 가중치, 는 예측된 시야검사 데이터, 는 정답 값) 본 발명의 실시 예에 따른 미래 시야 예측 장치는, 아래와 같은 구성을 포함할수있다. 인공지능 모델을 이용한 녹내장 환자의 미래 시야 예측 장치에 있어서, OCT 데이터 및 시야검사 데이터가 입력되는 입력부 , 시야예측 결과를 출력하는 출력부 및 OCT 데이터에 포함된 특징을 추출하여 OCT 특징 데이터를 획득하고, 시야검사 데이 터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하고, 상기 예측모델의 출력결과를 이용하여 최근 시 야검사 데이터 및 상기 최근 시야검사 데이터에 대응하는 최근 시간 정보(Last time info)에 기초하여 최종 시 야예측 결과를 획득하는 제어부를 포함하는 녹내장 환자의 미래 시야 예측 장치. 또한, 상기 제어부가 상기 시야검사 데이터, 상기 OCT 특징 데이터 및 시간 정보를 예측모델에 입력하는 동작은, 상기 OCT 특징 데이터, 상기 시야검사 데이터 및 상기 시간 정보를 연결하여 다차원 벡터를 생성하는 단계 및 상기 다차원 벡터를 LSTM 네트워크에 입력하는 동작을 포함할 수 있다. 또한, 상기 제어부가 상기 OCT 특징 데이터가 누락된 경우 마스크 정보를 이용하여 가상의 OCT 데이터를 생성하 고, 상기 시야검사 데이터, 상기 가상의 OCT 데이터 및 시간 정보를 예측모델에 입력할 수 있다. 또한, 상기 OCT 특징 데이터는 환자의 전체 시야에 대한 정보를 제공하는 두께맵 특징 및 환자 시야의 특정 영 역에 대한 정보를 제공하는 수직 및 수평 단층맵 특징을 포함할 수 있다. 또한, 상기 인공지능 모델은 노이즈의 정도에 기초하여 가중치가 재지정된 시야검사 데이터 샘플에 의해 훈련 될 수 있다. 또한, 상기 인공지능 모델의 손실함수는 weighted MSE를 포함하고, 상기 weighted MSE는 수학식 1을 포함할 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 3, "content": "( 는 재조정된 가중치, 는 예측된 시야검사 데이터, 는 정답 값)."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 실명으로 악화될 수 있는 녹내장 질환에 대해 미래의 시야손상 패턴을 예측하는 AI (인공지능)기법 중 멀티모달 딥러닝 모델을 개발함으로써 녹내장 환자의 현 상태를 기반으로 병증의 진행상태를 정량화/시각화 하여 보여줌으로 개별맞춤 진료를 가능하게 한다. 녹내장 환자에서 미래의 시야 손상 진행 패턴을 예측하고, 중심부를 침범하거나 위/아래 시야를 모두 침범하는 실명 가능한 환자군을 미리 찾아내 더 적극적인 치료를 함으로써 환자맞춤형 진료를 시행할 수 있다."}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 설명하는 기술은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면 에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 이하 설명하는 기술을 특정한 실시 형태에 대해 한정하려 는 것이 아니며, 이하 설명하는 기술의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하 는 것으로 이해되어야 한다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요소들은 상기 용어 들에 의해 한정되지는 않으며, 단지 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예 를 들어, 이하 설명하는 기술의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, \"포함한다\" 등의 용어는 설명된 특징, 개수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요 소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이 하에서 설명할 구성부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전 부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성부에 의 해 전담되어 수행될 수도 있음은 물론이다. 또, 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정들은 문맥상 명백하게 특정 순서를 기 재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 먼저, 이하 설명에서 사용되는 용어에 대한 정의는 아래와 같다. 단층촬영 데이터는 빛간섭 단층촬영(OCT)를 이용하여 획득된 이미지 데이터를 의미할 수 있다(이하 OCT 데이터 와 혼용하여 사용한다). 빛간섭 단층촬영(OCT)는 두께 지도, 단층 촬영(가로 및 세로)과 같은 시신경 머리에 대한 다양한 유형의 데이터 를 제공하는 검사를 의미할 수 있다. 예를 들어, OCT의 두께 지도(thickness maps)는 일반적으로 녹내장 손상과 직접적으로 관련된 시신경유두 주변 의 망막신경섬유층(RNFL) 두께에 대한 정보를 제공하며, 단층촬영은 수평 단층 촬영(horizontal tomograms) 및 수직 단층 촬영(vertical tomograms)을 포함하고, 시신경유두의 구조적 특징에 대한 정보를 제공할 수 있다. 시야검사 데이터는 환자의 시야 검사(Visual Field Test) 결과 데이터를 의미할 수 있다. 본 발명의 실시 예에 따라 환자당 시야검사는 시간 간격을 두고 복수번 수행될 수 있으며, 각 타임라인에 대응되어 저장될 수 있다. 이하 본 발명의 시야예측 모델에 대하여 설명한다. 본 발명이 개시하는 시야예측 모델은 상기와 같은 데이터(시야검사 데이터 및 OCT 데이터 등)를 이용하여 시신 경 형태를 기반으로 미래의 시야 패턴의 예측이 가능한 딥러닝모델의 동작 방법을 개시한다. 구체적으로 상기 시야예측 모델은 녹내장 환자의 이미지 정보를 이용한 녹내장 예후 예측 모델의 개발에 해당하 며, 기존의 시야검사 데이터와 두께 지도, 단층 촬영 등의 OCT 영상 데이터를 이용하여 녹내장 환자의 미래 시 야 결함 패턴을 예측하는 딥 러닝 모델에 해당할 수 있다. 이를 통해서 궁극적으로, 녹내장 환자의 이후 녹내장 진행 가능성 및 진행 속도, 시야진행 패턴을 예측할 수 있 다. 본 발명의 실시 예에 따른 시야예측 모델은 이미지 데이터와 직렬 데이터에서 특징을 추출하기 위해 CNN과 RNN 의 조합으로 구성될 수 있다. 상기 시야예측모델은 노이즈가 있는 데이터를 관리하기 위해 가중 손실이 있는 효율적인 훈련 메커니즘을 적용 될 수 있다. 상기 훈련 메커니즘은 추후 설명토록 한다. 본 발명의 실시 예에 따르면, 다중 입력(OCT 데이터 및 시야검사 데이터)이 있는 시야예측 모델은 구조-기능 관 계를 더 잘 학습하는 데 도움이 될 수 있으며, 정량적 결과를 기반으로 제안된 모델의 성능을 향상시킬 수 있다. 이하 시야예측 장치가 상기 시야예측 모델을 탑재한 것으로 설명한다. 상기 시야예측 장치는 입력된 데이터를 일정하게 처리하고 특정 모델이나 알고리즘에 따라 녹내장 환자의 시야패턴 예측에 필요한 연산을 수행하는 장 치이다. 예컨대, 시야예측 장치는 PC, 네트워크상의 서버, 스마트기기, 설계 프로그램이 임베딩된 칩셋 등과 같 은 형태로 구현될 수 있다. 도 1은 본 발명의 일 실시 예에 따른 시야예측 장치의 구성도에 대한 예이다. 시야예측 장치는 휴대폰, 스마트폰, PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 태블릿 PC, 웨어러블 장치, 차량 등 이동 가능한 기기 등으로 구현될 수 있다. 도 1을 참조하면, 시야예측 장치는 통신부, 입력부, 제어부, 인터페이스부, 출력부 및 메모리 등을 포함할 수 있다. 통신부는 유무선 통신 기술을 이용하여 다른 전자장치나 서버 등의 외부 장치들과 데이터를 송수신할 수 있다. 예컨대, 통신부는 외부 장치들과 센서 정보, 사용자 입력, 학습 모델, 제어 신호 등을 송수신할 수 있다. 입력부는 다양한 종류의 데이터를 획득할 수 있다. 이때, 입력부는 영상 신호 입력을 위한 카메라, 오디오 신호를 수신하기 위한 마이크로폰, 사용자로부터 정보를 입력 받기 위한 사용자 입력부 등을 포함할 수 있다. 여기서, 카메라나 마이크로폰을 센서로 취급하여, 카메라나 마이크로폰으로부터 획득한 신호를 센싱 데이터 또는 센서 정보라고 할 수도 있다. 출력부는 시각, 청각 또는 촉각 등과 관련된 출력을 발생시킬 수 있다. 이때, 출력부에는 시각 정보를 출력하는 디스플레이부, 청각 정보를 출력하는 스피커, 촉각 정보를 출력하 는 햅틱 모듈 등이 포함될 수 있다. 메모리는 다양한 기능을 지원하는 데이터를 저장할 수 있다. 예컨대, 메모리는 입력부에서 획득 한 입력 데이터, 서버 또는 연결된 장치에서 획득된 다양한 데이터를 저장할 수 있다. 제어부는 시야예측 장치의 적어도 하나의 실행 가능한 동작을 결정할 수 있다. 그리고, 제어부 는 시야패턴 예측장치의 구성 요소들을 제어하여 결정된 동작을 수행할 수 있다. 도 2는 본 발명의 실시 예에 따른 시야예측 방법의 흐름도를 나타낸 것이다. 도 3은 본 발명의 실시 예에 따른 시야예측 모델을 나타낸 것이다. 먼저, 도 3을 참고하면, 본 발명의 실시 예에 따른 시야예측 모델은 OCT 데이터의 특징을 추출하기 위한 전처리 를 수행하는 전처리부와 이미지의 시리즈 및 시야검사 데이터를 처리하는 예측부를 포함할 수 있다. 그리고 최종 예측결과를 도출하는 결과도출부를 포함할 수 있다. 이하 구체적으로 설명한다. 먼저, 본 발명의 실시 예에 따른 시야예측장치는 시야예측모델에 상기 OCT 데이터를 피드(입력)하기 전에 이미지 전처리를 수행할 수 있다(S210). 구체적으로 시야예측 모델은 입력된 데이터를 이용하여 상기 데이터에 대응하는 환자의 미래 시야패턴을 예측하 기 위한 데이터 전처리 과정을 수행할 수 있다. 예를 들어, 시야예측 모델은 OCT 데이터의 전처리를 통한 특징 추출할 수 있다. OCT 데이터는 두께 지도 (thickness maps), 수평 단층 촬영(horizontal tomograms) 및 수직 단층 촬영(vertical tomograms)을 포함할 수 있다. 구체적으로 상기 이미지 전처리에서 모든 이미지는 정규화되고(-1에서 1까지의 픽셀 값) 224 Х 224로 크기가 조정될 수 있다. 본 발명의 실시 예에 따르면, 시야예측모델의 전처리 시 이미지 데이터 분석을 위해 CNN(convolution neural network) 모델이 사용될 수 있다. 도 3을 참조하면, 본 발명의 실시 예에 따르면, OCT 데이터 중 두께 지도, 수평단층 촬영 및 수직 단층촬영 이 미지 각각은 미리 정해진 전처리모델에 입력될 수 있으며, 각각의 특징(Features from image data)이 추출 될 수 있다. 상기 특징은 OCT 특징 데이터로 정의될 수 있다. 예를 들어, 시야패턴 예측장치는 전처리 모델로 사전 훈련된 'ResNet-50'을 특징추출기로 사용할 수 있다. 상기 특징추출기는 입력으로 각 이미지에 대해 특징 벡터를 제공할 수 있다. 구체적으로 상기 OCT 특징 데이터 는 환자의 전체 시야에 대한 정보를 제공하는 두께맵 특징 및 환자 시야의 특정 영역에 대한 정보를 제공하는 수직 및 수평 단층맵 특징을 포함할 수 있다. 본 발명의 실시 예에 따르면, 시야예측 모델은 전처리 시, OCT 데이터 중 두께 맵 특징에 비중을 둔 특징 벡터 를 생성할 수 있다. 예를 들어,두께 맵, 수직 단층 촬영 및 수평 단층 촬영의 출력 벡터는 각각 512-d 벡터, 128-d 벡터 및 128-d 벡터로 구성될 수 있다. 본 발명의 실시 예에 따른 시야예측 모델은 상기 전처리 과정을 통하여 OCT 데이터를 기초로 한 OCT 특징 데이 터를 생성할 수 있다. 한편, 본 발명의 실시 예에 따른, 데이터셋트는 과적합을 피하기 위해 몇 가지 일반적인 데이터 증강(Data Augmentation) 기술(이동, 크기 조정, 회전)이 적용될 수 있다. 본 발명의 실시 예에 따른 시야예측 방법에 있어서, 시야검사 데이터, OCT 특징 데이터 및 시간 정보가 예측모 델에 입력될 수 있다(S220). 상기 예측모델은 예측부일 수 있다. 이때, 상기 예측모델에 입력되는 시야검사 데이터는 환자의 이전 시야검사 데이터(Previous VFs test data)일 수 있으며 상기 시야검사 데이터는 벡터로 재구성되고, 평균이 0이고 표준 편차가 1로 정규화될 수 있다. 상기 시간 정보에는 타임라인(time line) 및 시간간격(time interval)의 두 가지 유형의 정보가 포함될 수 있다. 상기 타임라인 정보는 선택된 이미지와 첫번째 이미지 사이의 시간을 의미할 수 있다. 또한 상기 간격 정보는 선택된 이미지와 이전 이미지 사이의 시간을 의미할 수 있다. 본 발명의 실시 예에 따른 시야예측 모델은 각 시간 단계에 대해 OCT 특징 데이터, 시야검사 데이터 및 시간 정 보를 연결하여 다차원 벡터를 생성할 수 있다. 상기 다차원 벡터는 LSTM(Long Short-Term Memory) 네트워크의 입력으로 사용될 수 있다. 상기 LSTM의 출력은 128-d 벡터일 수 있다.한편, 본 발명의 실시 예에 따르면, 시야예측 모델은 pair-데이터(시야검사 데이터 및 OCT 데이터)가 입력되는 경우가 이상적이나, 상기 pair-데이터 중 어느 하나가 누락된 경우, 마스크 정보를 사용하여 누락된 데이터를 대체할 수 있다. 상기 마스크 정보는 상기 OCT 데이터가 누락되었거나 사용 가능한지 여부를 나타내는 벡터를 의미할 수 있다. 예를 들어, 마스크에서 1을 사용 가능 상태로, 0을 누락된 상태로 정의할 수 있다. 구체적으로, OCT 데이터가 누락된 경우, 누락된 OCT 이미지를 생성하기 위하여 가상의 OCT 데이터를 생성할 수 있다. 이때, 가상의 OCT 데이터는 검은색 으로 채워진 이미지일 수 있다. 본 발명의 실시 예에 따르면, OCT 데이터가 누락되어 마스크 정보가 '0'을 가리키는 경우, OCT 데이터는 가상의 OCT 데이터로 대체되어 시야예측 모델에 입력될 수 있을 것이다. 본 발명의 실시 예에 따른 시야 예측모델은 LSTM 출력결과를 획득할 수 있다(S230). 이후, 본 발명의 실시 예에 따른 시야예측 모델은 LSTM 출력결과와 최근 시야검사 데이터(Last VF) 및 상기 최 근 시야검사 데이터에 대응하는 최근 시간 정보(Last time info)에 기초하여 최종 시야 예측결과를 획득할 수 있다(S240). 한편, 시야와 두께 맵 사이에는 구조-기능 관계가 존재하며, 상기 구조-기능 관계는 사람마다 상이할 수 있다. 또한 녹내장은 몇 가지 일반적인 패턴 중 하나로 발생하지만 각 환자는 개인의 고유한 특성을 가지고 있으므로 커스터마이징이 필요하였다. 본 발명은 종래의 인공지능모델과 달리, 본 발명은 OCT 데이터 및 시야검사 데이터 를 함계 사용함으로써 상기 문제를 해결할 수 있다. 구체적으로 상기 커스터마이징 문제를 해결하기 위해 이전 시야검사 데이터(마지막 시야검사 데이터만)를 미래 시야를 예측하는 기준 시야검사 데이터로 사용할 수 있다. LSTM 출력과 상기 기준 시야검사 데이터를 기반으로 예측 정확도가 크게 향상될 수 있다. 상기와 같이 본 발명의 실시 예에 따른 시야예측모델은 LSTM 출력, 이전 시야검사 데이터 및 시간 정보를 결합 하여 미래 시야를 예측할 수 있으며, 의료진은 이에 기초하여 녹내장 환자의 진행정도를 진단할 수 있다. 한편 상기 미래 시야는 향후 진행될 시야검사에 대한 참고데이터로 사용되기 위하여 시야검사 데이터 형태로 생 성될 수 있을 것이다. 이하 본 발명의 실시 예에 따른 시야패턴 예측모델의 훈련방법에 대하여 설명한다. 도 4 내지 도 5는 본 발명의 실시 예에 따른 시야예측 모델의 훈련방법을 나타낸 도면이다. 도 4를 참조하면, 시야검사에 있어서 환자의 현재 상태에 따라 노이즈(잡음) 시야검사 데이터가 생성될 수 있으 므로 안정적인 데이터를 획득하는데 어려움이 존재한다. 따라서, 본 발명의 실시 예에 따른 시야예측 모델은 상기 상황을 반영하고자, 잡음이 있는 데이터를 처리하기 위해 샘플에 가중치를 재지정하였으며, 시야예측 모델은 노이즈의 정도에 기초하여 가중치가 재지정된 시야검사 데이터 샘플에 의해 훈련될 수 있다. 한편, OCT 데이터는 시야검사 데이터와 비교하여, 두께 맵은 일관되고 신뢰할 수 있으므로 상기 과정은 생략될 수 있다. 본 발명의 실시 예에 따른 시야예측 모델은 회귀모델로 구성될 수 있으며,상기회귀모델은 두께 맵을 기반으로 시야검사 데이터를 예측할 수 있다. 상기 회귀모델의 입력값은 두께 맵이고 출력은 상기 두께맵에 대응하는 시 야검사 데이터 일 수 있다. 상기 회귀 모델의 중추는 사전 훈련된 ResNet-50[7]일 수 있다. 손실함수는 평균제곱오차(MSE loss)이며, 메인모델과 같이 데이터 증강(Data Augmentation)이 적용될 수 있다. 상기 시야예측 모델은 상기 회귀 모델을 사용하여 구조-기능 관계를 학습할 수 있을 것이다. 훈련 후 모델은 두 께 맵을 기반으로 일반적인 녹내장 패턴을 예측할 수 있다. 이하 도 5의 알고리즘의 진행 절차에 기초하여 시야검사 데이터 샘플의 가중치 재지정에 대하여 설명한다. 본 발명의 실시 예에 따르면, 먼저 각 환자에 대해 ground truth와 예측된 시야검사 데이터 사이의 평균 절대 오차(mean absolute error, MAE)를 계산할 수 있다. 계산된 평균절대 오차 값()은 환자마다 상이하므로 이를 정규화( 할 수 있다. 본 발명의 실시 예에 따르면, 잡음이 있는 샘플을 식별하기 위해 정규화된 오류 '가 임계값(TH)보다 작은 오류 가 있는 샘플은 양호한 샘플로 간주하고 나머지는 노이즈가 있는 것으로 간주될 수 있다. 이때 양호한 샘플의 가중치는 노이즈가 있는 샘플의 가중치보다 높게 설정될 수 있다. 도 4를 참조하면, 예를 들어, 좋은 샘플의 가중치는 1일 수 있으며 , 노이즈가 있는 샘플의 가중치는 지수 함수 를 기초로 설정될 수 있다. 본 발명의 실시 예에 따르면, 모든 가중치를 얻은 후 시야예측모델은 노이즈 데이터 의 영향을 줄이기 위해 가중 손실이 반영된 훈련 데이터를 이용하여 학습될 수 있으며 상기 시야예측 모델을 훈 련하는 데 사용되는 손실 함수는 다음과 같이 가중 MSE가 사용될 수 있다. 수학식 1"}
{"patent_id": "10-2022-0122623", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "( 는 재조정된 가중치, 는 예측된 시야검사 데이터, 는 정답 값) 본 발명의 실시 예에 따른 미래 시야예측 모델은 이전 시야검사 데이터 및 OCT 데이터(두께 맵, 수직 및 수평 단층 영상)를 사용하여 다중 입력을 기반으로 미래 시야검사 데이터를 예측하는 딥 러닝 모델을 개시합니다. 시 리즈 데이터(이전 시야검사 데이터)와 이미지 데이터(OCT 데이터)를 모두 분석하기 위해 CNN-RNN 모델을 개시한 다. 또한, 잡음이 있는 데이터를 처리하기 위해 샘플을 감지하고 다시 가중치를 부여하는 메커니즘을 도입하였 다. 상기 모델을 이용하여 re-weighting 방법이 OCT 이미지가 있거나 없는 경우에 성능을 향상시킬 수 있다. 본 개시의 기술 분야에서 통상의 지식을 가진 자는 여기에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 프로세서들, 수단들, 회로들 및 알고리즘 단계들이 전자 하드웨어, (편의를 위해, 여기에 서 소프트웨어로 지칭되는) 다양한 형태들의 프로그램 또는 설계 코드 또는 이들 모두의 결합에 의해 구현될 수 있다는 것을 이해할 것이다. 전술한 본 발명은, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨터 가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있다.도면 도면1 도면2 도면3 도면4 도면5"}
{"patent_id": "10-2022-0122623", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시 예에 따른 AI 장치를 나타낸다. 도 2는 본 발명의 일 실시 예에 따른 시야 예측 방법의 순서도를 나타낸다. 도 3은 본 발명의 일 실시 예에 따른 시야 예측 모델을 나타낸다. 도 4는 본 발명의 실시 예에 따른 시야 예측 모델의 학습방법을 나타낸다. 도 5는 본 발명의 실시 예에 따른 시야 예측 모델의 학습방법을 나타낸다."}
