{"patent_id": "10-2022-7008439", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0064370", "출원번호": "10-2022-7008439", "발명의 명칭": "성인용 애플리케이션을 위한 라이트필드 디스플레이 시스템", "출원인": "라이트 필드 랩 인코포레이티드", "발명자": "카라핀 조나단 션"}}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "라이트필드(LF) 디스플레이 시스템으로서,성인용 홀로그래픽 콘텐츠를 생성하도록 구성된 처리 엔진; 및하나 이상의 디스플레이 모듈들을 포함하는 라이트필드 디스플레이 어셈블리를 포함하고, 상기 라이트필드 디스플레이 어셈블리는 성인용 시뮬레이션 환경의 상기 하나 이상의 LF 디스플레이 모듈들의 가시 부피 내에 위치된하나 이상의 관찰자들에게 상기 홀로그래픽 성인용 콘텐츠를 제공하도록 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,네트워크를 통해 상기 LF 디스플레이 시스템에 연결되고, 상기 관찰자에게 제공하기 위해 상기 홀로그래픽 콘텐츠를 상기 LF 디스플레이 시스템에 제공하도록 구성되는, 온라인 시스템을 더 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 홀로그래픽 콘텐츠는 거래 수수료에 대한 대가로 상기 온라인 시스템으로부터 수신되는,LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 LF 디스플레이 시스템은 상기 네트워크를 통해 상기 홀로그래픽 콘텐츠를 인코딩된 포맷으로 수신하도록 구성되고, 상기 홀로그래픽 콘텐츠를 상기 관찰자에게 제공하기 위한 포맷으로 디코딩하도록더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 인코딩된 포맷은 벡터화된 포맷이고, 상기 디코딩된 포맷은 래스터화된 포맷인, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 홀로그래픽 콘텐츠는 상기 LF 디스플레이 시스템의 하드웨어 구성에 기초하여 제공되는,LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 하드웨어 구성은해상도;각도 당 투사되는 광선의 수;시야;상기 디스플레이 표면 상의 편향 각도; 및상기 디스플레이 표면의 치수 중 하나 이상을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들에 관한 정보를 획득하도록 구성된 추적 시스템을 더 포함하는, LF공개특허 10-2022-0064370-3-디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 추적 시스템에 의해 얻어진 상기 관찰자들에 관한 정보는,홀로그래픽 콘텐츠에 대한 관찰자 반응, 또는상기 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 관찰자들에 관한 정보는 상기 관찰자의 위치, 상기 관찰자의 움직임, 상기 관찰자의 제스처, 상기 관찰자의 표정, 상기 관찰자의 나이, 상기 관찰자의 성별, 상기 관찰자의 선호도, 및 상기 관찰자가착용한 의복 중 임의의 것을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 처리 엔진에 의해 생성된 상기 홀로그래픽 콘텐츠는 상기 추적 시스템에 의해 식별된 하나 이상의 관찰자들의 나이, 성별, 선호도, 위치, 움직임, 제스처, 의복, 또는 얼굴 표정에 응답하여 변경되는,LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 관찰자들에 관한 정보는 AI 모델에 대한 입력으로서 사용되고, 상기 홀로그래픽 콘텐츠는 상기 AI 모델에 기초하여 생성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서, 상기 추적 시스템은 하나 이상의 라이트필드 카메라들, 2D 카메라들, 또는 상기 하나 이상의LF 디스플레이 모듈들의 전방에 있는 영역의 이미지들을 캡처하도록 구성된 깊이 센서들을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 하나 이상의 라이트필드 카메라들, 2D 카메라들, 또는 깊이 센서들은 상기 LF 디스플레이 어셈블리의 외부에 있는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제8항에 있어서, 상기 하나 이상의 LF 디스플레이 모듈들은 상기 하나 이상의 LF 디스플레이 모듈들의 전방에있는 영역으로부터의 라이트필드를 캡처하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,관찰자 프로파일링 시스템을 더 포함하고, 상기 관찰자 프로파일링 시스템은,상기 LF 디스플레이 모듈들에 의해 제공되는 홀로그래픽 콘텐츠를 보는 관찰자들을 식별하고,각각의 상기 식별된 관찰자들에 대한 관찰자 프로파일을 생성하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 관찰자 프로파일링 시스템은, 상기 홀로그래픽 콘텐츠에 대한 관찰자 반응들 또는 상기홀로그래픽 콘텐츠를 보는 관찰자들의 특성을 식별하도록 구성되며, 관찰자 프로파일들 내에 상기 식별된 반응들 또는 특성을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서, 상기 관찰자 프로파일링 시스템은 관찰자 프로파일을 생성하기 위해 상기 하나 이상의 식별된공개특허 10-2022-0064370-4-관찰자들의 소셜 미디어 계정들에 액세스하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서, 상기 처리 엔진에 의해 생성된 상기 홀로그래픽 콘텐츠는 상기 LF 디스플레이 어셈블리에 의해 디스플레이되는 상기 홀로그래픽 콘텐츠를 보는 관찰자들의 하나 이상의 관찰자 프로파일에 응답하여 변경되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제17항에 있어서, 상기 관찰자 프로파일들 내의 관찰자들에 관한 정보는 AI 모델에 대한 입력으로서 사용되고,상기 홀로그래픽 콘텐츠는 상기 AI 모델에 기초하여 생성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제1항에 있어서, 상기 LF 처리 엔진은 상기 관찰자들 중에 식별된 하나 이상의 관찰자들에 부분적으로 기초하여상기 홀로그래픽 콘텐츠를 생성하도록 구성되며, 각각의 식별된 관찰자는 상기 LF 디스플레이 시스템에 의해 디스플레이되고 하나 이상의 특성을 포함하는 관찰자 프로파일과 연관되는 상기 홀로그래픽 콘텐츠를 관찰하는,LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서, 상기 특성은 상기 관찰자의 위치, 상기 관찰자의 움직임, 상기 관찰자의 제스처, 상기 관찰자의 선호도, 상기 사용자의 얼굴 표정, 상기 사용자의 성별, 상기 사용자의 연령, 및 상기 사용자의 의복 중 임의의 것을 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제1항에 있어서, 상기 LF 디스플레이 시스템은감각 피드백 시스템을 더 포함하고, 상기 감각 피드백 시스템은 상기 홀로그래픽 콘텐츠가 제공될 때 제2 에너지로서 감각 피드백을 제공하도록 구성되는 적어도 하나의 감각 피드백 장치를 포함하는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서, 상기 처리 엔진은 촉각 자극, 음향 자극, 온도 자극, 후각 자극, 압력 자극, 힘 자극, 또는이들의 임의의 조합을 포함하는 감각 콘텐츠를 이용하여 상기 생성된 홀로그래픽 콘텐츠를 증강시키도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제23항에 있어서, 상기 감각 피드백 시스템은 제공된 홀로그래픽 객체의 표면에 가깝거나 또는 제공된 홀로그래픽 객체의 표면과 일치하는 부피 촉각 표면을 생성하도록 구성된 초음파 에너지 투사 장치를 더 포함하는, LF디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제25항에 있어서,상기 LF 디스플레이 시스템의 상기 가시 부피 내의 상기 관찰자의 움직임을 추적하는 단계; 및상기 홀로그래픽 콘텐츠에 대한 상기 관찰자의 반응들을 모니터링하는 단계 중 하나 이상을 수행하도록 구성된추적 시스템을 더 포함하고,상기 부피 촉각 표면은 상기 관찰자의 상기 추적된 움직임 또는 상기 관찰자의 상기 홀로그래픽 콘텐츠에 대한모니터링된 반응들에 응답하여 변경되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 관찰자의 상기 추적된 움직임 또는 상기 관찰자의 상기 모니터링된 반응들은 AI 모델에공개특허 10-2022-0064370-5-입력되고, 상기 부피 촉각 표면은 상기 AI 모델에 기초하여 부분적으로 투사되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제25항에 있어서, 상기 초음파 에너지 투사 장치는, 상기 컨트롤러에 수신된 파라미터의 값에 기초하여, 상기생성된 부피 촉각 표면의 사용자 터치에 대한 저항, 상기 생성된 부피 촉각 표면의 텍스처, 또는 상기 생성된촉각 표면의 촉각 강도 중 하나 이상을 조절하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제1항에 있어서, 상기 홀로그래픽 디스플레이는 환경에서 하나 이상의 표면들을 형성하는 복수의 LF 디스플레이모듈들이고, 상기 LF 디스플레이 모듈들은 하나의 LF 디스플레이 모듈의 디스플레이 영역보다 더 큰 유효 디스플레이 영역을 갖는 이음매 없는 디스플레이 표면을 형성하도록 타일링되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "라이트필드(LF) 디스플레이 시스템으로서,디스플레이 영역을 갖는 LF 디스플레이 - 상기 LF 디스플레이는 상기 디스플레이 영역으로부터의 홀로그래픽 객체 부피 내의 하나 이상의 관찰자들에게 성인용 홀로그래픽 콘텐츠를 제공함 -;상기 홀로그래픽 디스플레이에 의해 제공하기 위해 상기 성인용 홀로그래픽 콘텐츠를 생성하도록 구성된 콘텐츠엔진; 및상기 성인용 홀로그래픽 콘텐츠를 보는 상기 홀로그래픽 객체 부피 내의 상기 하나 이상의 관찰자들에 관한 정보를 획득하도록 구성된 추적 시스템을 포함하며, 상기 정보는 상기 성인용 홀로그래픽 콘텐츠의 하나 이상의객체들과의 하나 이상의 관찰자 상호작용을 포함하고,상기 성인용 홀로그래픽 콘텐츠는 상기 추적 시스템에 의해 얻어진 정보에 기초하여 생성되는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제30항에 있어서, 상기 성인용 홀로그래픽 콘텐츠는 상기 환경의 상기 홀로그래픽 객체 부피 내의 특정 위치에제공되는 홀로그래픽 이미지인 적어도 하나의 홀로그래픽 성인 공연자를 포함하는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제31항에 있어서, 상기 추적 시스템은상기 하나 이상의 관찰자들 중의 한 관찰자로부터 상기 홀로그래픽 성인 공연자와의 하나 이상의 상호작용을 수신하고,인공지능(AI) 모델을 사용하여, 상기 관찰자로부터의 상기 하나 이상의 상호작용에 기초하여 상기 관찰자와 관련된 상기 홀로그래픽 공연자에 의해 수행될 응답을 생성하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제30항에 있어서, 상기 성인용 홀로그래픽 콘텐츠의 상기 하나 이상의 객체들은 상기 환경 내의 제1 관찰자에제공되는 제2 관찰자의 라이브 홀로그래픽 뷰이고, 상기 제2 관찰자는 상기 제1 관찰자로부터 원격 위치에 있으며, 상기 LF 디스플레이 시스템은상기 제2 관찰자의 라이브 이미지 데이터를 수신하고,상기 제1 관찰자에 대한 프리젠테이션을 위해 상기 환경 내에 상기 제2 관찰자의 라이브 홀로그래픽 표현을 생성하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제31항에 있어서, 상기 추적 시스템은하나 이상의 컨텍스트 관찰자 특성을 식별하고 - 상기 하나 이상의 컨텍스트 관찰자 특성은 상기 관찰자의 몸짓공개특허 10-2022-0064370-6-언어의 하나 이상의 분류된 인스턴스들, 상기 관찰자의 하나 이상의 분류된 얼굴 표정들, 상기 관찰자의 발성분석, 또는 이들의 일부 조합 중 적어도 하나를 포함함 -;인공지능(AI) 모델을 사용하여, 상기 홀로그래픽 공연자로 하여금 상기 관찰자로부터의 상기 식별된 하나 이상의 컨텍스트 관찰자 특성에 반응하여 응답하거나 또는 하나 이상의 동작을 수행하게 하도록 더 구성되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제34항에 있어서, 상기 홀로그래픽 공연자로부터의 응답은 구두 발언, 가청 사운드, 상기 홀로그래픽 공연자에의해 수행되는 동작, 또는 이들의 일부 조합 중 적어도 하나인, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제30항에 있어서,관찰자 프로파일링 시스템을 더 포함하고, 상기 관찰자 프로파일링 시스템은,상기 홀로그래픽 콘텐츠에 대한 관찰자 반응들 및 상기 홀로그래픽 콘텐츠를 보는 관찰자들의 특성을 식별하고,상기 식별된 특성 및 반응들에 기초하여 상기 홀로그래픽 콘텐츠를 보는 관찰자들의 특성 및 선호도들을 기술하는 관찰자 프로파일들을 생성하도록 구성되는, 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제30항에 있어서,상기 홀로그래픽 디스플레이에 의해 제공되는 상기 성인용 홀로그래픽 콘텐츠와 협력하여 동작하기 위해 상기콘텐츠 엔진으로부터 동작 명령들을 수신하도록 구성되는 감각 시뮬레이션 장치를 더 포함하는, LF 디스플레이시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제37항에 있어서, 상기 감각 시뮬레이션 장치는 부피 촉각 표면을 생성하도록 구성된 초음파 에너지 투사 장치에 의해 제공되거나 또는 적어도 증강되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제38항에 있어서, 상기 부피 촉각 표면은 제공된 홀로그래픽 객체의 표면에 가깝게, 또는 제공된 홀로그래픽 객체의 표면과 일치하게 투사되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제30항에 있어서, 상기 홀로그래픽 객체 부피 내의 상기 하나 이상의 관찰자들에 관한, 상기 추적 시스템에 의해 얻어진 정보는 에너지를 방출하고 흡수하는 상기 홀로그래픽 디스플레이의 양방향 에너지 요소들을 통해 얻어지는, 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "라이트필드(LF) 디스플레이 시스템으로서,디스플레이 영역을 갖는 LF 디스플레이 - 상기 홀로그래픽 디스플레이는 홀로그래픽 콘텐츠를 상기 디스플레이영역으로부터의 홀로그래픽 객체 부피 내의 하나 이상의 관찰자들에게 제공함 -;상기 홀로그래픽 디스플레이에 의한 프리젠테이션을 위해 상기 홀로그래픽 콘텐츠를 생성하도록 구성된 콘텐츠엔진; 및상기 홀로그래픽 콘텐츠를 보는 상기 홀로그래픽 객체 부피 내의 상기 하나 이상의 관찰자들에 관한 정보를 획득하도록 구성된 추적 시스템을 포함하고, 상기 정보는 상기 홀로그래픽 콘텐츠와의 하나 이상의 관찰자 상호작용을 포함하는, 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "공개특허 10-2022-0064370-7-제41항에 있어서, 상기 홀로그래픽 콘텐츠는 제1 관찰자에 제공되는 제2 관찰자의 라이브 홀로그래픽 뷰이고,상기 제2 관찰자는 상기 제1 관찰자로부터 원격 위치에 있으며, 상기 LF 디스플레이 시스템은,상기 제2 관찰자의 라이브 이미지 데이터를 수신하고,상기 제1 관찰자에 제공하기 위해 상기 제2 관찰자의 라이브 홀로그래픽 표현을 생성하도록 더 구성되는, 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제41항에 있어서, 상기 홀로그래픽 객체 부피 내의 상기 하나 이상의 관찰자들에 관한, 상기 추적 시스템에 의해 얻어진 정보는 에너지를 방출하고 흡수하는 상기 홀로그래픽 디스플레이의 양방향 에너지 요소들을 통해 얻어지는, 시스템."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "방법으로서,라이트필드(LF) 디스플레이 시스템에 의해, 환경에서 상기 LF 디스플레이 시스템에 의해 제공될 홀로그래픽 콘텐츠에 대한 관찰자의 관찰자 선호도를 획득하는 단계 - 상기 홀로그래픽 콘텐츠는 하나 이상의 홀로그래픽 공연자들을 포함함 -;상기 LF 디스플레이 시스템의 홀로그래픽 디스플레이에 의해, 상기 홀로그래픽 콘텐츠를 제공하는 단계 - 상기홀로그래픽 디스플레이는 디스플레이 영역을 가지며, 상기 홀로그래픽 콘텐츠를 상기 LF 디스플레이 시스템의홀로그래픽 객체 부피 내의 상기 관찰자에게 제공함 --상기 LF 디스플레이 시스템의 추적 시스템에 의해, 상기하나 이상의 홀로그래픽 공연자들에 반응하는 상기 관찰자의 하나 이상의 컨텍스트 특성을 포함하여, 상기 홀로그래픽 콘텐츠를 보는 상기 관찰자에 대한 감각 정보를 획득하는 단계; 및상기 LF 디스플레이 시스템에 의해, 상기 하나 이상의 홀로그래픽 공연자들의 적어도 하나의 행동을 포함하는상기 획득된 감각 정보에 응답하여 상기 홀로그래픽 콘텐츠의 프리젠테이션을 조절하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "제44항에 있어서, 상기 홀로그래픽 콘텐츠를 보는 상기 관찰자에 대한 상기 감각 정보를 획득하는 단계는,상기 관찰자로부터 상기 하나 이상의 홀로그래픽 공연자들과의 하나 이상의 상호작용을 수신하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "제45항에 있어서, 상기 획득된 감각 정보에 응답하여 상기 홀로그래픽 콘텐츠의 프리젠테이션을 조절하는 단계는,인공지능(AI) 모델을 이용하여, 상기 관찰자로부터의 상기 하나 이상의 상호작용에 기초하여 상기 관찰자와 관련한 상기 하나 이상의 홀로그래픽 공연자들에 의해 수행될 응답을 생성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "제44항에 있어서, 상기 홀로그래픽 콘텐츠를 보는 상기 관찰자에 대한 상기 감각 정보를 획득하는 단계는,하나 이상의 컨텍스트 관찰자 특성을 식별하는 단계를 포함하고, 상기 하나 이상의 컨텍스트 관찰자 특성은, 상기 관찰자의 몸짓 언어의 하나 이상의 분류된 인스턴스들, 상기 관찰자의 하나 이상의 분류된 얼굴 표정들, 상기 관찰자의 발성 분석, 또는 이들의 일부 조합 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제47항에 있어서, 상기 획득된 감각 정보에 응답하여 상기 홀로그래픽 콘텐츠의 프리젠테이션을 조절하는 단계는,인공지능(AI) 모델을 이용하여, 상기 하나 이상의 홀로그래픽 공연자들로 하여금 상기 관찰자로부터의 상기 하나 이상의 식별된 컨텍스트 관찰자 특성에 응답하여 적어도, 반응하거나 또는 하나 이상의 행동이나 동작을 수공개특허 10-2022-0064370-8-행하게 하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제44항에 있어서, 상기 획득된 관찰자 선호도는 상기 하나 이상의 홀로그래픽 공연자들을 포함하고, 각각의 상기 하나 이상의 홀로그래픽 공연자들은 실제 사람의 홀로그래픽 표현인, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제44항에 있어서, 상기 홀로그래픽 디스플레이는 환경에서 하나 이상의 표면들을 형성하는 복수의 LF 디스플레이 모듈들이고, 상기 LF 디스플레이 모듈들은 하나의 LF 디스플레이 모듈의 디스플레이 영역보다 더 큰 유효 디스플레이 영역을 갖는 이음매 없는 디스플레이 표면을 형성하도록 타일링되는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "제44항에 있어서, 상기 홀로그래픽 객체 부피 내의 상기 하나 이상의 관찰자들에 관한, 상기 추적 시스템에 의해 얻어진 정보는 에너지를 방출하고 흡수하는 상기 홀로그래픽 디스플레이의 양방향 에너지 요소들을 통해 얻어지는, 방법."}
{"patent_id": "10-2022-7008439", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "제44항에 있어서, 부피 촉각 표면을 생성하도록 구성된 초음파 에너지 투사 장치를 더 포함하고,상기 홀로그래픽 콘텐츠의 프리젠테이션은 홀로그래픽 공연자와 가깝거나 또는 일치하는 부피 촉각 표면의 투사에 의해 수반되는, LF 디스플레이 시스템."}
{"patent_id": "10-2022-7008439", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "성인용 엔터테인먼트 컨텍스트 내에 홀로그래픽 콘텐츠를 디스플레이하기 위한 라이트필드(LF) 디스플레이 시스 템이 개시된다. LF 디스플레이 시스템은 일 실시예에서, 환경 내의 LF 디스플레이들의 어레이를 형성하도록 타일 링되는 복수의 LF 디스플레이들을 포함하고, LF 디스플레이 시스템은 다양한 센서들(예를 들어, 카메라, 마이크, LF 디스플레이 센서 등)을 통해 환경 내의 각각의 관찰자들의 움직임 및/또는 요청을 추적 및 응답하는 인공지능 (AI) 및 머신러닝(ML) 모델들을 사용하여 관찰자의 경험을 사용자 맞춤화할 수 있다. 따라서, 그 결과는 환경 내 에서 관찰자들과 결합하는 AI 홀로그래픽 공연자를 포함하는, 각각의 관찰자에 대해 사용자 맞춤화된 성인용 엔 터테인먼트 환경이다."}
{"patent_id": "10-2022-7008439", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "관련 출원의 교차 참조 본 출원은 국제출원들 PCT/US2017/042275, PCT/US2017/042276, PCT/US2017/042418, PCT/US2017/042452, PCT/US2017/042462, PCT/US2017/042466, PCT/US2017/042467, PCT/US2017/042468, PCT/US2017/042469, PCT/US2017/042470, 및 PCT/US2017/042679에 관련되며, 이들 모두는 그 전체 내용이 본원에 인용되어 포함된다. 배경 본 개시는 홀로그래픽 환경에 관한 것이며, 보다 구체적으로는 성인용 환경 내에서 구현되는 라이트필드 디스플 레이에 관한 것이다. 현실을 증강하고 가상 환경을 시뮬레이션하기 위한 다양한 기술들이 제안되었다. 이러한 기술들은 종종, 깊이의 착시를 시뮬레이션하기 위해 헤드셋의 내부에 디스플레이되는 입체 이미지들을 포함하고, 머리 및 눈 추적 센서 들은 가상 환경 내의 어떤 부분 또는 객체가 관찰자에 의해 관찰되고 있는지를 추정하는 데 사용될 수 있다. 그 러나, 이러한 통상적인 접근법들은 콘텐츠를 보기 위해 착용되는 어떤 종류의 외부 장치(예를 들어, 3D 안경, 근안 디스플레이, 헤드마운트 디스플레이 등)의 디스플레이(예를 들어, 입체, 가상 현실, 증강 현실, 또는 혼합 현실)를 필요로 한다. 가상 현실에서, 외부 장치를 착용하는 것은 관찰자를 현실로부터 완전히 제거하며, 이는 관찰자가 알지 못한 채 환경 내의 다른 객체들 또는 사람들과 부딪힐 수 있기 때문에 일부 활동들 및 스포츠들 을 시뮬레이션할 때에는 위험할 수 있다(예를 들어, 가상 테니스 게임은 게임하기 위한 실제 테니스 코트의 크 기를 필요로 할 수 있다). 성인용 엔터테인먼트 컨텍스트 내에 홀로그래픽 콘텐츠를 디스플레이하기 위한 라이트필드(LF: light field) 디 스플레이 시스템이 개시된다. LF 디스플레이 시스템은, 일 실시예에서, 환경 내에서 LF 디스플레이들의 어레이 를 형성하도록 타일링되는 복수의 LF 디스플레이들을 포함한다. LF 디스플레이 시스템은 다양한 센서(예를 들어, 카메라, 마이크, LF 디스플레이 센서 등)를 통해 그들의 행동(예를 들어, 몸짓 언어, 얼굴 표정, 음성 톤 등)뿐만 아니라 환경 내의 각각의 관찰자의 움직임 및/또는 요청을 추적 및 응답하는 인공지능(AI) 및 머신러닝(ML) 모델을 사용하여 관찰자의 경험을 사용자 맞춤화할 수 있다. 이에 따라, 그 결과는 환경 내 관찰자들과 결 합(engage)하는 AI 홀로그래픽 공연자를 포함하여 각각의 관찰자에 사용자 맞춤화된 성인용 엔터테인먼트 환경 이다. 일 실시예에서, LF 디스플레이 시스템은 홀로그래픽 콘텐츠에 대한 관찰자의 선호도를 얻는다. 이는, 그들이 단 골 고객인 경우 관찰자에 대해 저장된 정보를 획득하는 단계를 포함할 수 있거나, 또는 시스템은, 예를 들어 카 탈로그로부터의, 하나 이상의 홀로그래픽 공연자들에 대한 관찰자의 선택을 수신할 수 있다. 홀로그래픽 공연자 들은 상이한 원격 위치들로부터의 LF 디스플레이 시스템에 대해 라이브 홀로그래픽 콘텐츠를 스트리밍하는 라이 브 모델, 실제 사람(예를 들어, 모델, 여배우, 남자 배우 등)의 AI 표현, 또는 컴퓨터 생성된 모델(예를 들어, 애니메이션 만화 등)일 수 있다. 관찰자의 선호도에 응답하여, LF 디스플레이 시스템은 홀로그래픽 공연자를 포함하는 홀로그래픽 콘텐츠를 관찰 자에게 제공하며, 이는 관람자에게 홀로그래픽 공연자가 방에 서서 그들과 대화하는 실제 사람인 것처럼 보이게 할 수 있는 환경의 홀로그래픽 객체 부피 내의 위치에 제공된 이미지이다. 홀로그래픽 콘텐츠의 프리젠테이션 동안에, LF 디스플레이 시스템의 추적 시스템은 관찰자에 대해 공간적으로뿐 만 아니라 행동적으로 AI를 안내하기 위해 관찰자에 대한 감각 정보를 획득한다. 따라서, 감각 정보는 얼굴 표 정, 음성 분석 및 인식을 포함하는 몸짓 언어(예를 들어, 즐거움, 흥분, 실망, 지루함 등을 나타낼 수 있음), 관찰자에 의해 명시적으로 언급될 수 있는 다른 일반적인 피드백(예를 들어, 홀로그래픽 공연자로 하여금 동작 을 수행하게 하기 위한 명령 등) 등과 같은 관찰자의 컨텍스트 특성을 식별하면서, 환경 내의 홀로그래픽 공연 자 및 다른 객체와의 관찰자의 상호작용을 포함한다. 따라서, LF 디스플레이 시스템은 추적 시스템에 의해 얻어진 관찰자의 감각 정보에 응답하여 홀로그래픽 공연자 의 행동과 같은 홀로그래픽 콘텐츠의 프리젠테이션을 조절한다. 이는 관찰자로부터의 코멘트에 응답하는 홀로그 래픽 공연자의 미소 또는 웃음만큼 미묘한 것일 수 있고, 관찰자로부터의 요청에 응답하여 동작을 수행하는 홀 로그래픽 공연자를 포함하는 보다 큰 규모의 행동 조절일 수 있다. 따라서, 일 실시예에서, 홀로그래픽 공연자 에 의해 수행되는 응답은 관찰자로부터의 상호작용에 기초하여 AI 모델을 사용하여 생성된다. 따라서, 관찰자는 홀로그래픽 공연자를 보고 그와 상호작용하기 위해 외부 장치를 착용할 필요가 없다. LF 디스플레이 시스템은 실제의 사람이 관찰자들에게 보일 것과 거의 동일한 방식으로 관찰자들에게 보이는 방식으로, 홀로그래픽 공연 자를 제공한다. 따라서, 본 개시는 홀로그래픽 디스플레이, 다수의 상이한 센서들(예를 들어, 햅틱, 오디오, 시각 등), 네트워 크, 및 다양한 실시예들에서, 특별한 아이웨어, 안경, 또는 헤드마운트 액세서리를 필요로 하지 않고 물리적인 것을 가상으로 대체 및/또는 증강하는 홀로그래픽 성인용 제품을 생성하는 AI 및 ML 모델들의 조합을 설명한다."}
{"patent_id": "10-2022-7008439", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "개요 라이트필드(LF: light field) 디스플레이 시스템은 홀로그래픽 공연자 또는 모델과 같은 홀로그래픽 콘텐츠를 사용자에게 제공하기 위해 성인용 엔터테인먼트 환경에서 구현된다. LF 디스플레이 시스템은, 성인용 엔터테인 먼트 환경의 가시 부피 내의 하나 이상의 관찰자들에게 보이게 될 하나 이상의 홀로그래픽 객체들을 포함하는 홀로그래픽 콘텐츠를 제공하도록 구성된 LF 디스플레이 어셈블리를 포함한다. 홀로그래픽 모델은 또한 다른 감 각 자극(예를 들어, 촉각, 청각, 또는 후각)으로 증강될 수 있다. 예를 들어, LF 디스플레이 시스템 내의 초음 파 방출기들은 환경 내의 홀로그래픽 공연자 또는 다른 홀로그래픽 객체들의 일부 또는 전부에 대한 촉각 표면 을 제공하는 초음파 압력파를 방출할 수 있다. 홀로그래픽 콘텐츠는 추가적인 시각적 콘텐츠(즉, 2D 또는 3D 시 각 콘텐츠)를 포함할 수 있다. 결맞은(cohesive) 경험이 제공되도록 보장하기 위한 방출기들의 조정은(즉, 홀로 그래픽 객체들의 투사와 함께 수반되고 매칭되는 부피 햅틱 투사 시스템으로부터 생성된 촉각 표면, 임의의 주 어진 시점에서의 다중 감각 자극들의 제공) 다수의 방출기들이 있는 구현예들의 시스템의 일부이다. LF 디스플 레이 어셈블리는 홀로그래픽 콘텐츠를 생성하기 위한 하나 이상의 LF 디스플레이 모듈들을 포함할 수 있다. LF 디스플레이 어셈블리는 단일 측면의 또는 다중 측면의 이음매 없는(seamless) 표면 환경을 형성할 수 있다. 예를 들어, LF 디스플레이 어셈블리는 성인용 엔터테인먼트 환경의 인클로저를 봉지(encapsulate)하는 다중 측 면의 이음매 없는 표면 환경을 형성할 수 있다. LF 디스플레이 시스템의 관찰자들은 LF 디스플레이 시스템에 의 해 생성된 홀로그래픽 콘텐츠로 부분적으로 또는 완전히 변환될 수 있는 인클로저(enclosure) 내에 들어갈 수 있다. 홀로그래픽 콘텐츠는 인클로저 내에 존재하는 물리적 객체들(예를 들어, 의자들 또는 벤치들)을 증강시키 거나 향상시킬 수 있다. 또한, 관찰자들은 인클로저 내부를 자유롭게 응시하여 안경 장치 및/또는 헤드셋을 필 요로 하지 않고도 홀로그래픽 콘텐츠를 볼 수 있다. 또한, 성인용 엔터테인먼트 환경 인클로저는 LF 디스플레이 어셈블리의 LF 디스플레이 모듈들에 의해 커버되는 표면들을 가질 수 있다. 예를 들어, 일부 예에서 벽, 천장 및 바닥의 일부 또는 전부가 LF 디스플레이 모듈들로 덮여진다. LF 디스플레이 시스템은 추적 시스템 및/또는 감각 피드백 어셈블리를 통해 입력을 수신할 수 있다. 입력에 기 초하여, LF 디스플레이 시스템은 관련 구성요소들에 피드백을 제공할 뿐만 아니라 홀로그래픽 콘텐츠를 조정할 수 있다. 또한, LF 디스플레이 시스템은 각각의 관찰자에 개인화된 콘텐츠를 제공하기 위해 각각의 관찰자를 식 별하기 위한 관찰자 프로파일링 시스템을 포함할 수 있다. 관찰자 프로파일링 시스템은 홀로그래픽 콘텐츠를 개 인화하기 위한 후속 방문에 사용될 수 있는, 성인용 엔터테인먼트 환경에 대한 관찰자의 방문에 관한 다른 정보 를 더 기록할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 시스템이 적어도 하나의 유형의 에너지를 동시에 방출하면서도, 동 시에, 관찰자들에게 반응하고 반응형 경험을 생성하기 위해 적어도 하나의 유형의 에너지를 흡수할 수 있게 하 는 구성요소들을 포함할 수 있다. 예를 들어, LF 디스플레이 시스템은 햅틱 감각을 위한 초음파뿐만 아니라, 관 찰하기 위한 홀로그래픽 객체들을 모두 방출할 수 있고, 동시에, 관찰자들에 의한 터치 반응을 검출하기 위해초음파를 흡수하면서 관찰자들 추적 및 다른 장면 분석을 위한 이미징 정보를 흡수할 수 있다. 예를 들어, 이러 한 시스템은, 가상으로, 관찰자에 의해 \"터치\"될 때, 터치 자극에 따라 그의 \"행동\"을 수정하는 홀로그래픽 공 연자를 투사할 수 있다. 주변 환경의 에너지 감지를 수행하는 디스플레이 시스템 구성요소들은 에너지를 방출하 고 흡수하는 양방향 에너지 구성요소를 통해 디스플레이 표면에 통합될 수 있거나, 초음파 스피커 및 카메라와 같은 이미징 캡처 장치와 같은, 디스플레이 표면과 분리되어 있는 전용 센서들일 수 있다. LF 디스플레이 시스템은 또한 홀로그래픽 객체 부피 및/또는 LF 디스플레이 시스템의 가시 부피 내의 관찰자의 움직임을 추적하기 위한 시스템을 포함할 수 있다. 관찰자들의 추적된 움직임은 몰입형 성인용 엔터테인먼트 경 험을 향상시키기 위해 사용될 수 있다. 예를 들어, LF 디스플레이 시스템은 홀로그래픽 콘텐츠와의 관찰자 상호 작용(예를 들어, 홀로그래픽 버튼을 누르는 것)을 용이하게 하기 위해 추적 정보를 사용할 수 있다. LF 디스플 레이 시스템은 추적된 정보를 사용하여 홀로그래픽 객체에 대한 손가락 위치를 모니터링할 수 있다. 예를 들어, 홀로그래픽 객체는 관찰자에 의해 \"눌러질(push)\" 수 있는 버튼일 수 있다. LF 디스플레이 시스템은 상기 버튼 에 대응하고 상기 버튼과 실질적으로 동일한 공간을 점유하는 촉각 표면을 생성하기 위해 초음파 에너지를 투사 할 수 있다. LF 디스플레이 시스템은 추적 정보를 사용하여, 관찰자에 의해 \"눌러질\" 때 상기 버튼을 동적으로 이동시키는 것에 따라 촉각 표면의 위치를 동적으로 이동시킬 수 있다. LF 디스플레이 시스템은 추적 정보를 사 용하여, 눈을 마주치고/마주치거나 또는 관찰자들과 다른 방식으로 상호작용하는 홀로그래픽 객체를 렌더링할 수 있다. LF 디스플레이 시스템은 추적 정보를 사용하여, 관찰자를 \"터치\"하는 홀로그래픽 객체를 렌더링할 수 있는데, 여기서 초음파 스피커는 홀로그래픽 객체가 터치를 통해 관찰자와 상호작용할 수 있는 촉각 표면을 생 성한다. 라이트필드 디스플레이 시스템 개요 도 1은 하나 이상의 실시예들에 따른, 홀로그래픽 객체를 나타내는 라이트필드(LF, light field) 디스플레 이 모듈의 도면이다. LF 디스플레이 모듈은 라이트필드(LF) 디스플레이 시스템의 일부이다. LF 디스플레이 시스템은 하나 이상의 LF 디스플레이 모듈들을 사용하여 적어도 하나의 홀로그래픽 객체를 포함하는 홀로그래픽 콘텐츠를 제공한다. LF 디스플레이 시스템은 하나 또는 다수의 관찰자들에게 홀로그래픽 콘텐츠를 제공할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 또한 다른 감각 콘텐츠(예를 들어, 터치, 음향, 냄새, 온도 등)로 홀로그래픽 콘텐츠를 증강시킬 수 있다. 예를 들어, 이하에서 설명되는 바와 같이, 포커싱된 초음파 음파의 투사는 홀로그래픽 객체의 일부 또는 전부의 표면을 시뮬레이션할 수 있는 공중(mid-air)의 촉감 을 생성할 수 있다. LF 디스플레이 시스템은 하나 이상의 LF 디스플레이 모듈들을 포함하고, 이는 도 2 내 지 도 5와 관련하여 아래에서 상세히 설명된다. LF 디스플레이 모듈은 홀로그래픽 객체들(예를 들어, 홀로그래픽 객체)을 하나 이상의 관찰자들(예를 들어, 관찰자)에 제공하는 홀로그래픽 디스플레이이다. LF 디스플레이 모듈은 에너지 장치층(예를 들 어, 방출형 전자적 디스플레이 또는 음향 투사 장치) 및 에너지 도파층(예를 들어, 광학 렌즈 어레이)을 포함한 다. 추가적으로, LF 디스플레이 모듈은 다수의 에너지 소스들 또는 검출기들을 함께 조합하여 단일 표면을 형성하기 위해, 에너지 중계(relay) 층을 포함할 수 있다. 높은 레벨에서, 에너지 장치(device) 층은 에너지(예 를 들어, 홀로그래픽 콘텐츠)를 생성한 다음, 에너지 도파층을 이용하여 하나 이상의 4차원(4D) 라이트필드 기 능들에 따른 공간 내의 영역으로 이를 유도한다. LF 디스플레이 모듈은 또한 하나 이상의 유형의 에너지를 동시에 투사 및/또는 감지할 수 있다. 예를 들어, LF 디스플레이 모듈은 가시 부피 내의 초음파 촉각 표면 뿐만 아니라 홀로그래픽 이미지를 투사할 수 있는 한편, 동시에 가시 부피로부터 이미징 데이터를 검출할 수 있 다. LF 디스플레이 모듈의 동작은 도 2 내지 도 3과 관련하여 아래에서 더 상세히 설명된다. LF 디스플레이 모듈은 하나 이상의 4D 라이트필드 기능들(예를 들어, 플렌옵틱(plenoptic) 기능으로부터 도출된)을 이용하여 홀로그래픽 객체 부피 내에 홀로그래픽 객체들을 생성한다. 홀로그래픽 객체는 3차원 (3D), 2차원(2D), 또는 이들의 일부 조합일 수 있다. 또한, 홀로그래픽 객체들은 다색(예를 들어, 풀(full) 컬 러)일 수 있다. 홀로그래픽 객체는 스크린 평면의 전방에, 스크린 평면 뒤에 투사되거나, 스크린 평면에 의해 분할될 수 있다. 홀로그래픽 객체는 홀로그래픽 객체 부피 내의 어디에서나 인식되도록 제공될 수 있 다. 홀로그래픽 객체 부피 내의 홀로그래픽 객체는 관찰자에게 공간 내에 떠있는 것처럼 보일 수 있 다. 홀로그래픽 객체 부피는 홀로그래픽 객체가 관찰자에 의해 인지될 수 있는 부피를 나타낸다. 홀로그 래픽 객체 부피는 홀로그래픽 객체가 디스플레이 영역의 평면 앞에 표시될 수 있도록 디스플레이 영 역의 표면 앞에서(즉, 관찰자를 향하여) 연장될 수 있다. 또한, 홀로그래픽 객체 부피는 디스플레이 영역의 표면 뒤에(즉, 관찰자로부터 멀어지게) 연장될 수 있어서, 홀로그래픽 객체가 마치 디스 플레이 영역의 평면 뒤에 있는 것처럼 표시될 수 있다. 즉, 홀로그래픽 객체 부피는 디스플레이 영역 으로부터 기원하는(예를 들어, 투사되는) 그리고 홀로그래픽 객체를 생성하도록 수렴하는 모든 광선을 포 함할 수 있다. 여기서, 광선은 디스플레이 표면의 전방에, 디스플레이 표면에, 또는 디스플레이 표면 뒤에 있는 지점에서 수렴할 수 있다. 보다 단순하게, 홀로그래픽 객체 부피는 홀로그래픽 객체가 관찰자에 의해 인식 될 수 있는 모든 부피를 내포한다. 가시 부피는 LF 디스플레이 시스템에 의해 홀로그래픽 객체 부피 내에 표시되는 홀로그래픽 객체들 (예를 들어, 홀로그래픽 객체)이 완전히 보일 수 있는 공간의 부피이다. 홀로그래픽 객체들은 실제 객체들 과 구별할 수 없도록 홀로그래픽 객체 부피 내에 표시될 수 있고, 가시 부피 내에서 보일 수 있다. 홀로그래픽 객체는 물리적으로 존재할 경우에 해당 객체의 표면으로부터 생성되는 것과 동일한 광선을 투사함으 로써 형성된다. 일부 경우에, 홀로그래픽 객체 부피 및 대응하는 가시 부피는 단일 관찰자를 위해 설계되도록 상대적 으로 작을 수 있다. 다른 실시예들에서, 예를 들어, 도 4, 도 6, 도 7a, 도 7b 및 도 8에 대해 상세히 후술하는 바와 같이, LF 디스플레이 모듈들은 대규모 관찰자들(예를 들어, 1명 내지 수천 명)을 수용할 수 있는 더 큰 홀 로그래픽 객체 부피들 및 대응하는 가시 부피들을 생성하도록 확장 및/또는 타일링될 수 있다. 본 개시에서 제 공된 LF 디스플레이 모듈들은, LF 디스플레이의 전체 표면이 홀로그래픽 이미징 광학부(holographic imaging optics)를 포함하고, 비활성 또는 데드(dead) 공간이 없으며, 베젤(bezel)이 필요하지 않도록 제조될 수 있다. 이러한 실시예들에서, LF 디스플레이 모듈들은 이미징 영역이 LF 디스플레이 모듈들 사이의 이음매(seam)에 걸 쳐 연속적이도록 타일링될 수 있고, 타일형 모듈들 사이의 접합선은 눈의 시력으로는 실질적으로 검출될 수 없 다. 특히, 일부 구성들에서, 디스플레이 표면의 일부는 홀로그래픽 이미징 광학부를 포함하지 않을 수 있지만, 이들은 본원에서 상세히 설명되지 않는다. 가시 부피의 플렉시블한 크기 및/또는 형상은 관찰자로 하여금 가시 부피 내에 제한되지 않게 할 수 있다. 예를 들어, 관찰자는 가시 부피 내에서 다른 위치로 이동할 수 있고, 대응하는 관점으로부터 홀로그래픽 객체의 상이한 뷰를 볼 수 있다. 예를 들어, 도 1을 참조하면, 관찰자는 홀로그래픽 객체 가 돌고래의 정면인 것처럼 보이도록 홀로그래픽 객체에 대해 제1 위치에 있다. 관찰자는 돌고 래의 상이한 뷰를 보기 위해 홀로그래픽 객체에 대해 다른 위치로 이동할 수 있다. 예를 들어, 관찰자 가 실제 돌고래를 보고 있고, 그 돌고래의 상이한 측면을 보기 위해 실제 돌고래에 대한 자신의 상대적 위 치를 변경하는 것과 같이, 관찰자는 돌고래의 좌측, 돌고래의 우측 등을 보도록 이동할 수 있다. 일부 실 시예들에서, 홀로그래픽 객체는 홀로그래픽 객체에 대해 시야에서 차단되지 않은 선(즉, 객체/사람에 의해 차단되지 않음)을 갖는, 가시 부피 내의 모든 관찰자들에게 보일 수 있다. 이들 관찰자는 홀로그래픽 객체의 상이한 관점을 보기 위해 가시 부피 내에서 움직일 수 있도록, 제한되지 않을 수 있다. 따라서, LF 디스플레이 시스템은 마치 홀로그래픽 객체들이 물리적으로 존재하는 것처럼 복수의 제한되지 않은 관찰자들이 실세계 공간에서 홀로그래픽 객체들의 상이한 관점들을 동시에 볼 수 있도록, 홀로그래픽 객체들을 제공할 수 있다. 이와 달리, 일반적으로, 통상적인 디스플레이(예를 들어, 입체, 가상 현실, 증강 현실 또는 혼합 현실)에서는 콘텐츠를 보기 위해서 각각의 관찰자가 특정 종류의 외부 장치(예를 들어, 3-D 안경, 근안(near-eye) 디스플레 이, 또는 헤드마운트형 디스플레이)를 착용할 필요가 있다. 추가적으로 및/또는 대안적으로, 통상적인 디스플레 이들은 관찰자가 특정 가시 위치로(예를 들어, 디스플레이에 대해 고정된 위치를 갖는 의자에서) 제한될 것을 필요로 할 수도 있다. 예를 들어, 스테레오스코픽 디스플레이에 의해 도시된 객체를 관찰할 때, 관찰자는 객체 상에서보다는 디스플레이 표면 상에 항상 초점을 맞추고, 디스플레이는 항상 그 인식된 객체 주위를 이동하려고 시도하는 관찰자를 따르는 객체의 두 개의 뷰들만을 제공할 것인데, 이는 그 객체에 대한 인식의 왜곡을 초래할 것이다. 그러나, 라이트필드 디스플레이를 이용하면, LF 디스플레이 시스템에 의해 제공된 홀로그래픽 객체의 관찰자들은 홀로그래픽 객체를 보기 위해서 외부 장치를 착용할 필요가 없고, 특정 위치에 국한될 필요도 없다. LF 디스플레이 시스템은, 특별한 아이웨어(eyewear), 안경, 또는 헤드마운팅형 액세서리에 대한 어떠한 요건도 없이, 물리적 객체가 관찰자들에게 보일 수 있는 것과 거의 동일한 방식으로 관찰자들에게 보이는 방식으로 홀 로그래픽 객체를 제공한다. 또한, 관찰자는 가시 부피 내의 임의의 위치로부터 홀로그래픽 콘텐츠를 볼 수 있다. 특히, 홀로그래픽 객체 부피 내의 홀로그래픽 객체들에 대한 잠재적인 위치들은 부피의 크기에 의해 제한 된다. 홀로그래픽 객체 부피의 크기를 증가시키기 위해서, LF 디스플레이 모듈의 디스플레이 영역의 크기가 증가될 수 있고/있거나, 다수의 LF 디스플레이 모듈들이 이음매 없는 디스플레이 표면을 형성하 는 방식으로 함께 타일링될 수 있다. 이음매 없는 디스플레이 표면은 개별적인 LF 디스플레이 모듈들의 디스플 레이 영역들보다 더 큰 유효 디스플레이 영역을 갖는다. LF 디스플레이 모듈들을 타일링(tiling)하는 것에 관한 일부 실시예들은 도 4, 및 도 6 내지 도 7과 관련하여 이하에서 설명된다. 도 1에 도시된 바와 같이, 디스플레 이 영역은 피라미드인 홀로그래픽 객체 부피를 야기하는 직사각형이다. 다른 실시예들에서, 디스플레 이 영역은 소정의 다른 형상(예를 들어, 육각형)을 가질 수 있으며, 이는 또한 대응하는 가시 부피의 형상에 영 향을 미친다. 또한, 상기 설명은 LF 디스플레이 모듈과 관찰자 사이에 있는 홀로그래픽 객체 부피의 일부 내 에 홀로그래픽 객체를 제공하는 것에 초점을 맞추지만, LF 디스플레이 모듈은 디스플레이 영역 의 평면 뒤에서 홀로그래픽 객체 부피에 콘텐츠를 추가적으로 제공할 수 있다. 예를 들어, LF 디스플레이 모듈은, 디스플레이 영역이 홀로그래픽 객체가 점프해서 나오는 바다의 표면인 것으로 보이게 할 수 있다. 그리고 디스플레이된 콘텐츠는 물 아래에 있는 해양 생물을 보기 위해 관찰자가 디스플레이된 표면을 관통하여 볼 수 있도록 할 수 있다. 또한, LF 디스플레이 시스템은 디스플레이 영역의 평면의 후방 및 전방을 포함하는 홀로그래픽 객체 부피 주위로 이음매 없이 이동하는 콘텐츠를 생성할 수 있다. 도 2a는 하나 이상의 실시예들에 따른, LF 디스플레이 모듈의 일 부분의 일 단면을 도시한다. LF 디 스플레이 모듈은 LF 디스플레이 모듈일 수 있다. 다른 실시예들에서, LF 디스플레이 모듈은 디 스플레이 영역과 다른 디스플레이 영역 형상을 갖는 다른 LF 디스플레이 모듈일 수 있다. 예시된 실시예에 서, LF 디스플레이 모듈은 에너지 장치층, 에너지 중계층, 및 에너지 도파층을 포함한다. LF 디스플레이 모듈의 일부 실시예들은 여기에서 설명되는 것들과는 상이한 구성요소들을 갖는다. 예를 들 어, 일부 실시예들에서, LF 디스플레이 모듈은 에너지 중계층을 포함하지 않는다. 유사하게, 기능들 은 본원에 설명된 것과 다른 방식으로 구성요소들 중에 분배될 수 있다. 여기에서 설명되는 디스플레이 시스템은 실세계에서 일반적으로 물체를 둘러싸고 있는 에너지를 복제하는 에너 지의 방출을 제공한다. 여기서, 방출된 에너지는 디스플레이 표면 상의 모든 좌표로부터 특정 방향을 향해 지향 된다. 디스플레이 표면으로부터 지향된 에너지는 많은 광선들이 수렴될 수 있게 하며, 이에 의해, 홀로그래픽 객체들을 생성할 수 있다. 가시광의 경우, 예를 들어, LF 디스플레이는 홀로그래픽 객체 부피 내의 임의의 지점 에 수렴할 수 있는 매우 많은 수의 광선을 투사할 것이고, 따라서 이들은 투사되는 객체보다 더 멀리 위치한 관 찰자의 관점에서 이 공간의 영역에 위치된 실세계 물체의 표면으로부터 온 것처럼 보일 것이다. 이런 식으로, LF 디스플레이는 관찰자의 관점으로부터 그러한 물체의 표면을 벗어나는 반사된 광의 광선들을 생성하고 있다. 관찰자 관점은 임의의 주어진 홀로그래픽 객체 상에서 변할 수 있고, 관찰자는 해당 홀로그래픽 객체의 상이한 뷰를 볼 것이다. 에너지 장치층은 하나 이상의 전자 디스플레이(예를 들어, OLED와 같은 발광 디스플레이) 및 본원에 설명 된 바와 같은 하나 이상의 다른 에너지 투사 및/또는 에너지 수신 장치를 포함한다. 하나 이상의 전자 디스플레 이들은 (예를 들어, LF 디스플레이 시스템의 컨트롤러로부터의) 디스플레이 명령들에 따른 콘텐츠를 디스플레이 하도록 구성된다. 하나 이상의 전자 디스플레이는 각각 개별적으로 제어되는 강도(intensity)를 갖는 복수의 픽 셀을 포함한다. 발광 LED 및 OLED 디스플레이와 같은 여러 유형의 상업용 디스플레이가 LF 디스플레이에 사용될 수 있다. 에너지 장치층은 또한, 하나 이상의 음향 투사 장치 및/또는 하나 이상의 음향 수신 장치를 포함할 수 있 다. 음향 투사 장치는 홀로그래픽 객체를 보완하는 하나 이상의 압력파를 생성한다. 생성된 압력파는 예를 들어, 가청, 초음파, 또는 이들의 일부 조합일 수 있다. 초음파 압력파들의 어레이는 (예를 들어, 홀로그래픽 객체의 표면에서) 부피 촉각 감각을 위해 사용될 수 있다. 가청 압력파는 홀로그래픽 객체를 보완할 수 있는 오디오 콘텐츠(예를 들어, 몰입형 오디오)를 제공하기 위해 사용된다. 예를 들어, 홀로그래픽 객체 가 돌고래라고 가정하면, 하나 이상의 음향 투사 장치는 관찰자가 홀로그래픽 객체를 터치할 수 있도록 돌고래의 표면과 동일하게 위치하는 촉각 표면을 생성하고, 클릭, 처핑(chirpping) 또는 채터 (chatter)와 같은 돌고래의 소리에 대응하는 오디오 콘텐츠를 제공하기 위해 사용될 수 있다. 음향 수신 장치 (예를 들어, 마이크 또는 마이크 어레이)는 LF 디스플레이 모듈의 로컬 영역 내의 초음파 및/또는 가청 압 력파를 모니터링하도록 구성될 수 있다. 에너지 장치층은 또한, 하나 이상의 이미징 센서들을 포함할 수 있다. 이미징 센서는 가시광 대역에서의 광에 민감할 수 있고, 일부 경우에는 다른 대역(예를 들어, 적외선)에서의 광에 민감할 수 있다. 이미징 센서는예를 들어 시모스(CMOS, complementary metal oxide semi-conductor) 어레이, 전하 결합 소자(CCD), 광검출기 들의 어레이, 광을 포획하는 몇몇 다른 센서, 또는 이들의 일부 조합일 수 있다. LF 디스플레이 시스템은 관찰 자들의 위치 추적을 위해 하나 이상의 이미징 센서에 의해 캡처된 데이터를 사용할 수 있다. 에너지 중계층은 에너지 장치층과 에너지 도파층 사이에서 에너지(예를 들어, 전자기 에너지, 기계적 압력파 등)를 중계한다. 에너지 중계층은 하나 이상의 에너지 중계 요소들을 포함한다. 각각 의 에너지 중계 요소는 제1 표면 및 제2 표면을 포함하고, 이는 2개의 표면들 사이의 에너지를 중계 한다. 각각의 에너지 중계 요소의 제1 표면은 하나 이상의 에너지 장치들(예를 들어, 전자 디스플레이 또 는 음향 투사 장치)에 연결될 수 있다. 에너지 중계 요소는 예를 들어, 유리, 탄소, 광섬유, 광학 필름, 플라스 틱, 폴리머, 또는 이들의 일부 조합으로 구성될 수 있다. 추가적으로, 일부 실시예들에서, 에너지 중계 요소는 제1 표면과 제2 표면 사이를 통과하는 에너지의 확대(증가 또는 감소)를 조절할 수 있다. 중계부가 확대를 제공하는 경우, 중계부는 테이퍼(taper)라고 불리는 접합된 테이퍼형(tapered) 중계부들의 어레이의 형 태를 취할 수 있으며, 테이퍼의 일 단부의 면적은 반대쪽 단부보다 실질적으로 클 수 있다. 테이퍼의 큰 단부는 이음매 없는 에너지 표면을 형성하기 위해 함께 접합할 수 있다. 하나의 장점은 다수의 디스플레이의 베젤 과 같은 다수의 에너지 소스의 기계적인 엔벨로프(envelope)를 수용하기 위해, 각각의 테이퍼의 다수의 작은 단 부들 상에 공간이 생성된다는 것이다. 이러한 여분의 공간은 에너지 소스가 작은 테이퍼 면 위에 나란히 배치될 수 있게 하며, 각각의 에너지 소스는 작은 테이퍼 표면으로 에너지를 지향시키고 큰 이음매 없는 에너지 표면으 로 중계되도록 하는 활성(active) 영역을 가진다. 테이퍼형 중계를 사용하는 또 다른 장점은 테이퍼들의 큰 단 부에 의해 형성된 조합된 이음매 없는 에너지 표면 상에 비-이미징 데드(dead) 공간이 존재하지 않는다는 점이 다. 테두리 또는 베젤이 존재하지 않으며, 따라서 이음매 없는 에너지 표면이 함께 타일링되어, 눈의 시력에 따 라서는 실질적으로 이음매가 없는 더 큰 표면을 형성할 수 있다. 인접한 에너지 중계 요소들의 제2 표면들은 함께 모여서 에너지 표면을 형성한다. 일부 실시예들에서, 인 접한 에너지 중계 요소들의 엣지들 사이의 분리는, 예를 들어, 20/40 비전을 갖는 인간의 눈의 시력에 의해 정 의되는 바와 같은 인지 가능한 최소 윤곽보다 더 작고, 따라서 에너지 표면은 가시 부피 내의 관찰자 의 관점으로부터 효과적으로 매끄럽게(seamless) 된다. 일부 실시예들에서, 하나 이상의 에너지 중계 요소들은 에너지 국소화(energy localization)를 나타내며, 여기 서 표면들(265, 270)에 실질적으로 수직한 세로(longitudinal) 방향에서의 에너지 전달 효율은 수직한 가로 (transverse) 평면에서의 전달 효율보다 훨씬 더 높고, 에너지 밀도는 에너지 파동이 표면과 표면 사 이에서 전파될 때 이 가로 평면 내에 매우 국소화된다. 이러한 에너지의 국소화는 이미지와 같은 에너지 분배가 해상도에서의 어떠한 큰 손실 없이도 이들 표면들 사이에서 효율적으로 중계될 수 있게 한다. 에너지 도파층은 에너지 도파층 내의 도파(waveguide) 요소들을 사용하여 에너지 표면 상의 위 치(예를 들어, 좌표)로부터, 디스플레이 표면으로부터 홀로그래픽 가시 부피까지의 바깥으로의 특정 전파 경로로 에너지를 지향시킨다. 일 예로서, 전자기 에너지의 경우, 에너지 도파층 내의 도파 요소들은 가시 부피를 관통하여 상이한 전파 방향들을 따라 이음매 없는 에너지 표면 상의 위치들로부터 광을 지향 시킨다. 다양한 예들에서, 광은 홀로그래픽 객체 부피 내에 홀로그래픽 객체를 형성하기 위해 4D 라 이트필드 기능에 따라 지향된다. 에너지 도파층 내의 각각의 도파 요소는, 예를 들어, 하나 이상의 구성요소들로 구성된 렌즈릿(lenslet)일 수 있다. 일부 구성들에서, 렌즈릿은 볼록 렌즈일 수 있다. 볼록 렌즈는 구면, 비구면 또는 자유 형태인 표면 프로파일을 가질 수 있다. 추가적으로, 일부 실시예들에서, 도파 요소들의 일부 또는 전부는 하나 이상의 추가 적인 광학 요소들을 포함할 수 있다. 추가적인 광학 요소는 예를 들어, 배플(baffle), 볼록 렌즈, 오목 렌즈, 구면 렌즈, 비구면 렌즈, 자유 형태 렌즈, 액정 렌즈, 액체 렌즈, 굴절 요소, 회절 요소, 또는 이들의 일부 조 합과 같은 에너지-억제 구조일 수 있다. 일부 실시예들에서, 렌즈릿 및/또는 추가적인 광학 요소들 중 적어도 하나는 자신의 광학 출력을 동적으로 조절할 수 있다. 예를 들어, 렌즈릿은 액정 렌즈 또는 액체 렌즈일 수 있 다. 렌즈릿 및/또는 적어도 하나의 추가적인 광학 요소의 표면 프로파일의 동적 조정은 도파 요소로부터 투사되 는 광의 추가적인 지향성 제어를 제공할 수 있다. 도시된 예에서, LF 디스플레이의 홀로그래픽 객체 부피는 광선 및 광선에 의해 형성되는 경계를 갖지만, 다른 광선에 의해 형성될 수도 있다. 홀로그래픽 객체 부피는 에너지 도파층의 전방(즉, 관 찰자 쪽으로) 및 후방으로(즉, 관찰자로부터 멀리) 연장되는 연속적인 부피이다. 도시된 예에서, 광 선 및 광선은 사용자에 의해 인지될 수 있는 디스플레이 표면의 법선에 대해 가장 높은 각도로LF 디스플레이 모듈의 서로 반대되는 엣지들로부터 투사되지만, 이들은 다른 투사된 광선들일 수 있다. 광 선들은 디스플레이의 시야를 정의하고, 따라서 홀로그래픽 가시 부피에 대한 경계를 정의한다. 일부 경우 에, 광선들은 전체 디스플레이가 비네팅(vignetting) 없이 관찰될 수 있는 홀로그래픽 가시 부피(예를 들어, 이 상적인 가시 부피)를 정의한다. 디스플레이의 시야가 증가함에 따라, 광선과 광선의 수렴 지점이 디 스플레이에 더 근접할 것이다. 따라서, 더 큰 시야를 갖는 디스플레이는 관찰자가 더 가까운 가시 거리에 서 전체 디스플레이를 볼 수 있게 한다. 또한, 광선(256, 257)은 이상적인 홀로그래픽 객체 부피를 형성할 수 있다. 이상적인 홀로그래픽 객체 부피 내에 제공된 홀로그래픽 객체는 가시 부피의 임의의 위치에서 볼 수 있다. 일부 예들에서, 홀로그래픽 객체들은 가시 부피의 일부에만 제공될 수 있다. 즉, 홀로그래픽 객체 부피는 임의의 수의 가시 서브 부피(예를 들어, 가시 서브 부피)로 분할될 수 있다. 또한, 홀로그래픽 객체는 홀 로그래픽 객체 부피의 외부에 투사될 수 있다. 예를 들어, 홀로그래픽 객체는 홀로그래픽 객체 부피 의 외부에 제공된다. 홀로그래픽 객체가 홀로그래픽 객체 부피의 외부에 제공되기 때문에, 이는 가시 부피의 모든 위치에서 보이지 않는다. 예를 들어, 홀로그래픽 객체는 가시 서브 부피의 위 치에서 보일 수 있지만, 관찰자의 위치에서는 보이지 않을 수 있다. 예를 들어, 도 2b를 참조하면, 상이한 가시 서브 부피들로부터의 홀로그래픽 콘텐츠를 보는 것이 예시된다. 도 2b는 하나 이상의 실시예들에 따른 LF 디스플레이 모듈의 일 부분의 단면을 도시한다. 도 2b의 단면은 도 2a의 단면과 동일하다. 그러나, 도 2b는 LF 디스플레이 모듈로부터 투사된 상이한 광선들의 세트를 도시한 다. 광선과 광선은 여전히 홀로그래픽 객체 부피 및 가시 부피를 형성한다. 그러나, 도시 된 바와 같이, LF 디스플레이 모듈의 상부 및 LF 디스플레이 모듈의 하부로부터 투사된 광선들은 가 시 부피 내에서 다양한 가시 서브 부피들(예를 들어, 가시 서브 부피들(290A, 290B, 290C, 및 290D))을 형 성하도록 오버랩된다. 제1 가시 서브 부피(예를 들어, 290A) 내의 관찰자는 다른 가시 서브 부피들(예를 들어, 290B, 290C, 및 290D) 내의 관찰자들이 인지할 수 없는 홀로그래픽 객체 부피 내에 제공된 홀로그래픽 콘 텐츠를 인지할 수 있다. 더 간단히, 도 2a에 도시된 바와 같이, 홀로그래픽 객체 부피는 홀로그래픽 객체들이 가시 부피 내의 관찰자들(예를 들어, 관찰자)에 의해 인지될 수 있도록 LF 디스플레이 시스템에 의해 제공될 수 있는 부피 이다. 이런 식으로, 가시 부피는 이상적인 가시 부피의 일 예이고, 홀로그래픽 객체 부피는 이상적인 객체 부피의 일 예이다. 그러나, 다양한 구성들에서, 관찰자들은 다른 예시적인 홀로그래픽 객체 부피들에서 LF 디스플레이 시스템에 의해 제공되는 홀로그래픽 객체들을 인지할 수 있고, 다른 예시적인 가시 부피들 내 의 관찰자들도 홀로그래픽 콘텐츠를 인지할 수 있다. 보다 일반적으로, \"눈-선(eye-line) 가이드라인\"은 LF 디 스플레이 모듈로부터 투사된 홀로그래픽 콘텐츠를 볼 때 적용된다. 눈-선(eye-line) 가이드라인은 관찰자의 눈 위치 및 보고 있는 홀로그래픽 객체에 의해 형성되는 선이 LF 디스플레이 표면과 교차해야 한다고 강조한다. LF 디스플레이 모듈에 의해 제공되는 홀로그래픽 콘텐츠를 보는 경우, 관찰자의 각각의 눈은 홀로그 래픽 객체의 상이한 관점을 보게 되는데, 그 이유는 홀로그래픽 콘텐츠가 4D 라이트필드 기능에 따라 제공 되기 때문이다. 또한, 관찰자가 가시 부피 내에서 이동함에 따라, 그는 또한 가시 부피 내의 다 른 관찰자들과 마찬가지로 홀로그래픽 객체의 상이한 관점들을 볼 수 있다. 통상의 기술자에 의해 이해되 는 바와 같이, 4D 라이트필드 기능은 당업계에 잘 알려져 있으며, 본원에서는 더 상세히 설명되지 않을 것이다. 본원에 더 상세하게 설명되는 바와 같이, 일부 실시예들에서, LF 디스플레이는 하나 이상의 유형의 에너지를 투 사할 수 있다. 예를 들어, LF 디스플레이는 예를 들어, 기계적 에너지 및 전자기 에너지와 같은 2가지 유형의 에너지를 투사할 수 있다. 이러한 구성에서, 에너지 중계층은, 에너지 표면에서 함께 인터리빙 (interleaved)되되 에너지가 2개의 상이한 에너지 장치층들로 중계되도록 분리되는, 2개의 개별적인 에너 지 중계부들을 포함한다. 여기서, 하나의 중계부는 전자기 에너지를 전달하도록 구성될 수 있는 반면, 다른 중 계부는 기계적 에너지를 수송하도록 구성될 수 있다. 일부 실시예들에서, 기계적 에너지는 에너지 도파층 상의 전자기 도파 요소들 사이의 위치들로부터 투사될 수 있고, 하나의 전자기 도파 요소로부터 다른 전자기 도 파 요소로 광이 전송되는 것을 억제하는 구조들의 형성을 돕는다. 일부 실시예들에서, 에너지 도파층은 또 한 컨트롤러로부터의 디스플레이 명령들에 따른 특정 전파 경로들을 따라서 집속된 초음파를 수송하는 도파 요 소들을 포함할 수 있다. 다른 실시예들(도시되지 않음)에서, LF 디스플레이 모듈은 에너지 중계층을 포함하지 않음에 유의해 야 한다. 이 경우에, 에너지 표면은 에너지 장치층 내에 하나 이상의 인접한 전자 디스플레이를 사용하여 형성된 방출 표면이다. 그리고 일부 실시예들에서, 인접한 전자적 디스플레이들의 엣지들 사이의 구분은 20/40 비전을 갖는 사람 눈의 시력에 의해 정의되는 바와 같은 최소의 인지 가능한 윤곽보다 더 작으며, 이에 따라 에너지 표면은 가시 부피 내의 관찰자의 관점에서 효과적으로 이음매 없이 보이게 된다. LF 디스플레이 모듈 도 3a는 하나 이상의 실시예들에 따른 LF 디스플레이 모듈(300A)의 사시도이다. LF 디스플레이 모듈(300A)은 LF 디스플레이 모듈 및/또는 LF 디스플레이 모듈일 수 있다. 다른 실시예들에서, LF 디스플레이 모듈 (300A)은 일부 다른 LF 디스플레이 모듈일 수 있다. 예시된 실시예들에서, LF 디스플레이 모듈(300A)은 에너지 장치층, 에너지 중계층, 및 에너지 도파층을 포함한다. LF 디스플레이 모듈(300A)은 본원에 기 술된 바와 같이 디스플레이 표면으로부터 홀로그래픽 콘텐츠를 제공하도록 구성된다. 편의상, 디스플레이 표면은 LF 디스플레이 모듈(300A)의 프레임 상의 점선으로 도시되지만, 보다 정확하게는, 프레임 의 내부 림(rim)에 의해 한정된 도파 요소들의 전방에 직접 위치된다. LF 디스플레이 모듈(300A)의 일부 실시예들은 여기에서 설명되는 것들과는 상이한 구성요소들을 갖는다. 예를 들어, 일부 실시예들에서, LF 디스 플레이 모듈(300A)은 에너지 중계층을 포함하지 않는다. 유사하게, 기능들은 본원에 설명된 것과 다른 방 식으로 구성요소들 중에 분배될 수 있다. 에너지 장치층은 에너지 장치층의 일 실시예이다. 에너지 장치층은 4개의 에너지 장치들 (도면에는 3개가 도시됨)을 포함한다. 에너지 장치들은 모두 동일한 유형(예를 들어, 모두 전자 디스플레 이들)일 수 있거나, 하나 이상의 상이한 유형들을 포함(예를 들어, 전자 디스플레이들 및 적어도 하나의 음향 에너지 장치를 포함)할 수 있다. 에너지 중계층은 에너지 중계층의 일 실시예이다. 에너지 중계층은 4개의 에너지 중계 장치들 (도면에는 3개가 도시됨)을 포함한다. 에너지 중계 장치들은 모두 동일한 유형의 에너지(예를 들어, 광)를 중계하거나, 하나 이상의 상이한 유형들(예를 들어, 광 및 소리)을 중계할 수 있다. 중계 장치들 각 각은 제1 표면 및 제2 표면을 포함하고, 에너지 중계 장치들의 제2 표면은 단일의 이음매 없는 에너지 표 면을 형성하도록 배열된다. 도시된 실시예에서, 에너지 중계 장치들 각각은 제1 표면이 제2 표면보다 더 작은 표면 영역을 갖도록 테이퍼화되며, 이는 테이퍼들의 작은 단부 상에 에너지 장치들의 기계적인 엔 벨로프들을 수용하게 한다. 이는 또한, 전체 영역이 에너지를 투사할 수 있기 때문에, 이음매 없는 에너지 표면 에 경계가 없어지게 한다. 이는, 전부피로 조합된 표면에 이음매가 없도록, 데드 스페이스(dead space) 또는 베 젤 없이 LF 디스플레이 모듈(300A)의 다수의 인스턴스들을 함께 배치함으로써, 이러한 이음매 없는 에너지 표면 이 타일링(tiled)될 수 있다는 것을 의미한다. 다른 실시예들에서, 제1 표면 및 제2 표면은 동일한 표면적을 갖 는다. 에너지 도파층은 에너지 도파층의 일 실시예이다. 에너지 도파층은 복수의 도파 요소들을 포함한다. 도 2와 관련하여 위에서 설명된 바와 같이, 에너지 도파층은 홀로그래픽 객체를 형성하기 위해, 이음매 없는 에너지 표면으로부터의 에너지를 4D 플렌옵틱 기능에 따른 특정 전파 경로를 따라 지향시키도 록 구성된다. 도시된 실시예에서, 에너지 도파층은 프레임에 의해 한정되는 것에 유의해야 한다. 다 른 실시예들에서는, 프레임이 없고/없거나, 프레임의 두께가 감소된다. 프레임의 두께의 제거 또는 감소는 LF 디스플레이 모듈(300A)을 추가적인 LF 디스플레이 모듈과 함께 타일링하는 것을 용이하게 할 수 있다. 도시된 실시예에서, 이음매 없는 에너지 표면 및 에너지 도파층은 평면형(planar)이다. 다른 실시예 들에서, 도시되지는 않았지만, 이음매 없는 에너지 표면 및 에너지 도파층은 하나 이상의 차원들에서 만곡될 수 있다. LF 디스플레이 모듈(300A)은 이음매 없는 에너지 표면의 표면 상에 상주하는 추가적인 에너지 소스들로 구성될 수 있고, 라이트필드에 대해 에너지 필드의 추가적인 투사를 허용한다. 일 실시예에서, 음향 에너지 필드는 이 음매 없는 에너지 표면 상의 임의의 수의 위치들에 장착된 정전기 스피커들(도시되지 않음)로부터 투사될 수 있다. 또한, LF 디스플레이 모듈(300A)의 정전기 스피커들은 듀얼 에너지 표면이 동시에 소리 필드들 및 홀 로그래픽 콘텐츠를 투사하도록, 라이트필드 디스플레이 모듈(300A) 내에 위치된다. 예를 들어, 정전기 스피커는 전자기 에너지의 일부 파장에 대해 투과성인 하나 이상의 다이어프램 요소들을 이용하여 형성될 수 있으며, 전 도성 요소들로 구동될 수 있다. 정전기 스피커들은 다이어프램 요소들이 도파 요소들의 일부를 덮도록 이음매 없는 에너지 표면에 장착될 수 있다. 스피커들의 전도성 전극들은 전자기 도파들 사이의 광 전송을 억제하 도록 설계되고/되거나 전자기 도파 요소들(예를 들어, 프레임) 사이의 위치들에 위치하는 구조물들과 함께배치될 수 있다. 다양한 구성들에서, 스피커들은 가청 소리를 투사하고/하거나 햅틱 표면을 생성하는 집속된 초 음파 에너지의 여러 소스들을 투사할 수 있다. 일부 구성들에서, 에너지 장치는 에너지를 감지할 수 있다. 예를 들어, 에너지 장치는 마이크, 광 센서, 음향 트랜스듀서 등일 수 있다. 이와 같이, 에너지 중계 장치들은 또한 이음매 없는 에너지 표면으로부터 에너지 장치층으로 에너지를 중계할 수 있다. 즉, 에너지 장치들 및 에너지 중계 장치들이 에너지를 방출하고 동시에 감지(예를 들어, 라이트필드들을 방출하고 소리를 감지)하도록 구성될 때, LF 디스플레이 모듈 의 이음매 에너지 표면은 양방향성 에너지 표면을 형성한다. 보다 광범위하게, LF 디스플레이 모듈의 에너지 장치는 에너지 소스 또는 에너지 센서일 수 있다. LF 디스플레이 모듈(300A)은 사용자에게 고품질 홀로그래픽 콘텐츠의 투사를 용이하게 하기 위해 에너지 소스들 및 /또는 에너지 센서들로서 작용하는 다양한 유형들의 에너지 장치들을 포함할 수 있다. 다른 소스들 및/또는 센 서들은 열 센서들 또는 소스들, 적외선 센서들 또는 소스들, 이미지 센서들 또는 소스들, 음향 에너지를 생성하 는 기계적 에너지 트랜스듀서들, 피드백 소스들 등을 포함할 수 있다. 많은 다른 센서들 또는 소스들이 가능하 다. 또한, LF 디스플레이 모듈들은, LF 디스플레이 모듈이 커다란 집합된 이음매 없는 에너지 표면으로부터 여 러 유형의 에너지를 투사하고 감지하는 어셈블리를 형성할 수 있도록 타일링(tiled)될 수 있다. LF 디스플레이 모듈(300A)의 다양한 실시예들에서, 이음매 없는 에너지 표면은 다양한 표면 부분들을 가질 수 있으며, 각각의 표면 부분은 특정 유형의 에너지를 투사 및/또는 방출하도록 구성된다. 예를 들어, 이음매 없는 에너지 표면이 듀얼-에너지 표면일 때, 이음매 없는 에너지 표면은 전자기 에너지를 투사하는 하나 이상의 표면 부분들, 및 초음파 에너지를 투사하는 하나 이상의 다른 표면 부분들을 포함한다. 초음파 에너지를 투사하는 표면 부분들은 도파 요소들 사이에서 이음매 없는 에너지 표면 상에 위치될 수 있고/있거나 도파 요소들 사이에서 광 투과를 억제하도록 설계된 구조물들과 함께 위치될 수 있다. 이음매 없는 에너지 표면이 양 방향 에너지 표면인 예에서, 에너지 중계층은 이음매 없는 에너지 표면에서 인터리빙되는 2개의 유형 의 에너지 중계 장치들을 포함할 수 있다. 다양한 실시예들에서, 이음매 없는 에너지 표면은 특정 도파 요 소들 아래의 표면의 부분들이 모두 에너지 소스들, 모두 에너지 센서들, 또는 에너지 소스들과 에너지 센 서들의 혼합이 되도록 구성될 수 있다. 도 3b는 하나 이상의 실시예들에 따른, 인터리빙된 에너지 중계 장치들을 포함하는 LF 디스플레이 모듈(300B)의 단면도이다. LF 디스플레이 모듈(300B)은 둘 이상의 유형의 에너지를 투사하기 위한 듀얼 에너지 투사 장치로서, 또는 한 유형의 에너지를 투사하고 동시에 다른 유형의 에너지를 감지하기 위한 양방향 에너지 장치 로서, 구성될 수 있다. LF 디스플레이 모듈(300B)은 LF 디스플레이 모듈 및/또는 LF 디스플레이 모듈(21 0)일 수 있다. 다른 실시예들에서, LF 디스플레이 모듈은 일부 다른 LF 디스플레이 모듈일 수 있다. LF 디스플레이 모듈(300B)은 도 3a의 LF 디스플레이 모듈(300A)의 것들과 유사하게 구성된 많은 구성요소들을 포함한다. 예를 들어, 예시된 실시예에서, LF 디스플레이 모듈(300B)은 적어도 도 3a에 관해 기술된 것들의 동 일한 기능을 포함하는, 에너지 장치층, 에너지 중계층, 이음매 없는 에너지 표면, 및 에너지 도 파층을 포함한다. 추가적으로, LF 디스플레이 모듈(300B)은 디스플레이 표면에 에너지를 제공하고/하 거나 그로부터 에너지를 수신한다. 특히, LF 디스플레이 모듈(300B)의 구성요소들은 대안적으로, 도 3a의 LF 디 스플레이 모듈(300A)의 구성요소들과 연결되고/되거나 지향(orient)된다. LF 디스플레이 모듈(300B)의 일부 실 시예들은 여기에서 설명되는 것들과는 상이한 구성요소들을 갖는다. 유사하게, 기능들은 본원에 설명된 것과 다 른 방식으로 구성요소들 중에 분배될 수 있다. 도 3b는 듀얼 에너지 투사 표면 또는 더 큰 면적을 갖는 양방향 에너지 표면을 생성하도록 타일링될 수 있는 단일 LF 디스플레이 모듈의 설계를 도시한다. 일 실시예에서, LF 디스플레이 모듈(300B)은 양방향 LF 디스플레이 시스템의 LF 디스플레이 모듈이다. 양방향 LF 디스플레이 시스템은 디스플레이 표면으로부터 에너지를 투사함과 동시에 에너지를 감지할 수 있다. 이 음매 없는 에너지 표면은 이음매 없는 에너지 표면 상에 근접하게 인터리빙되는 에너지 투사 위치 및 에너지 감지 위치 모두를 포함한다. 따라서, 도 3b의 예에서, 에너지 중계층은 도 3a의 에너지 중계층과는 상이한 방식으로 구성된다. 편의상, LF 디스플레이 모듈(300B)의 에너지 중계층은 본원에서 \"인터리빙된 에너지 중계층\"으로 지칭될 것이다. 인터리빙된 에너지 중계층은 두 개의 레그들, 즉, 제1 에너지 중계 장치(350A) 및 제2 에너지 중계 장치 (350B)를 포함한다. 각각의 레그들은 밝은 음영 영역으로 도시되어 있다. 각각의 레그들은 플렉시블 중계 물질 로 제조될 수 있고, 다양한 크기들 및 형상들의 에너지 장치들과 함께 사용하기에 충분한 길이로 형성될 수 있 다. 인터리빙된 에너지 중계층의 일부 영역들에서, 두 개의 레그들은 이음매 없는 에너지 표면에 접근함에따라 함께 조밀하게(tightly) 인터리빙(interleaved)된다. 도시된 예에서, 인터리빙된 에너지 중계 장치들(35 2)은 어두운 음영 영역으로 도시되어 있다. 이음매 없는 에너지 표면에서 인터리빙되는 동안, 에너지 중계 장치들은 상이한 에너지 장치들로부터/그에 대해 에너지를 중계하도록 구성된다. 에너지 장치들은 에너지 장치층에 존재한다. 도시된 바와 같이, 에너 지 장치(340A)는 에너지 중계 장치(350A)에 연결되고, 에너지 장치(340B)는 에너지 중계 장치(350B)에 연결된다. 다양한 실시예들에서, 각각의 에너지 장치는 에너지 소스 또는 에너지 센서일 수 있다. 에너지 도파층은 일련의 수렴 지점들을 향하여 투사된 경로들을 따라 이음매 없는 에너지 표면으로부 터 에너지 파들을 조향(steer)하기 위한 도파 요소들을 포함한다. 이 예에서, 홀로그래픽 객체는 일 련의 수렴 지점들에 형성된다. 특히, 도시된 바와 같이, 홀로그래픽 객체에서의 에너지의 수렴은 디스플레 이 표면의 관찰자 측에서 발생한다. 그러나, 다른 예에서, 에너지의 수렴은, 디스플레이 표면의 전방 및 디스플레이 표면의 후방 둘 모두에서 연장되는, 홀로그래픽 객체 부피 내의 어느 곳에도 존재할 수 있 다. 도파 요소들은 후술하는 바와 같이 에너지 장치(예를 들어, 에너지 센서)로 들어오는 에너지를 동시에 조향할 수 있다. LF 디스플레이 모듈(300B)의 일 예시적인 실시예에서는, 에너지 소스로서 발광 디스플레이가 사용되고, 에너지 센서로서 이미징 센서가 사용된다. 이런 식으로, LF 디스플레이 모듈(300B)은 홀로그래픽 콘텐츠를 투사함과 동 시에 디스플레이 표면의 전방에서 해당 부피로부터 광을 검출할 수 있다. 일 실시예에서, LF 디스플레이 모듈(300B)은 디스플레이 표면의 전방에 라이트필드를 투사하고 동시에 디 스플레이 표면의 전방으로부터 라이트필드를 캡처하도록 구성된다. 이 실시예에서, 에너지 중계 장치 (350A)는 도파 요소들 아래에 위치된 이음매 없는 에너지 표면에서의 제1 세트의 위치들을 에너지 장 치(340A)에 연결한다. 일 예에서, 에너지 장치(340A)는 소스 픽셀들의 어레이를 갖는 방출형(emissive) 디스플 레이이다. 에너지 중계 장치(340B)는 도파 요소들 아래에 위치된 이음매 없는 에너지 표면에서의 제2 세트의 위치들을 에너지 장치(340B)에 연결한다. 일 예에서, 에너지 장치(340B)는 센서 픽셀들의 어레이를 갖는 이미징 센서이다. LF 디스플레이 모듈은 특정한 도파 요소 아래에 있는 이음매 없는 에너지 표면 에서의 위치들이 모두 발광 디스플레이 위치들, 모두 이미징 센서 위치들, 또는 위치들의 일부 조합이 되 도록 구성될 수 있다. 다른 실시예들에서, 양방향 에너지 표면은 다양한 다른 형태의 에너지를 투사하고 수신할 수 있다. LF 디스플레이 모듈(300B)의 다른 예시적인 실시예에서, LF 디스플레이 모듈은 2개의 상이한 유형의 에너지를 투사하도록 구성된다. 예를 들어, 에너지 장치(340A)는 전자기 에너지를 방출하도록 구성된 방출 디스플레이이 고, 에너지 장치(340B)는 기계적 에너지를 방출하도록 구성된 초음파 변환기이다. 이와 같이, 광 및 소리는 이 음매 없는 에너지 표면에서의 다양한 위치들로부터 투사될 수 있다. 이러한 구성에서, 에너지 중계 장치 (350A)는 에너지 장치(340A)를 이음매 없는 에너지 표면에 연결하고 전자기 에너지를 중계한다. 에너지 중 계 장치는 전자기 에너지를 수송하는 데에 효율적인 특성들(예를 들어, 가변 굴절률)을 갖도록 구성된다. 에너 지 중계 장치(350B)는 에너지 장치(340B)를 이음매 없는 에너지 표면에 연결하고 기계적 에너지를 중계한 다. 에너지 중계 장치(350B)는 초음파 에너지의 효율적인 수송(예를 들어, 상이한 음향 임피던스를 갖는 물질들 의 분포)을 위한 특성들을 갖도록 구성된다. 일부 실시예들에서, 기계적 에너지는 에너지 도파층 상의 도 파 요소들 사이의 위치들로부터 투사될 수 있다. 기계적 에너지를 투사하는 위치들은 광이 하나의 전자기 도파 요소로부터 다른 전자기 도파 요소로 전송되는 것을 억제하는 역할을 하는 구조물들을 형성할 수 있다. 일 예에서, 초음파 기계적 에너지를 투사하는 공간적으로 분리된 위치들의 어레이는 공중(mid-air)의 3차원 햅틱 형상들 및 표면들을 생성하도록 구성될 수 있다. 표면들은 투사된 홀로그래픽 객체(예를 들어, 홀로그래픽 객체 )와 일치할 수 있다. 일부 예들에서, 어레이에 걸친 위상 지연들 및 진폭 변동들은 햅틱 형상들의 생성을 보조할 수 있다. 다양한 실시예들에서, 양방향 LF 디스플레이 모듈은 특정 유형의 에너지 장치를 포함하는 각각의 에너지 장치층을 갖는 다수의 에너지 장치층들을 포함할 수 있다. 이러한 예들에서, 에너지 중계층들은 이음매 없는 에 너지 표면과 에너지 장치층 사이에서 적절한 유형의 에너지를 중계하도록 구성된다. 타일형 LF 디스플레이 모듈 도 4a는 하나 이상의 실시예들에 따른, 단일-측면의 이음매 없는 표면 환경을 형성하기 위해 2차원으로 타일링 (tiled)되는 LF 디스플레이 시스템의 일 부분의 사시도이다. LF 디스플레이 시스템은 어레이를형성하도록 타일링되는 복수의 LF 디스플레이 모듈들을 포함한다. 보다 명시적으로, 어레이 내의 작은 사 각형들 각각은 타일형 LF 디스플레이 모듈을 나타낸다. 어레이는 예를 들어, 방의 표면(예를 들어, 벽)의 일부 또는 전부를 커버할 수 있다. LF 어레이는, 예를 들어, 테이블 상판, 게시판, 로툰다(rotunda) 등과 같은 다른 표면들을 커버할 수 있다. 어레이는 하나 이상의 홀로그래픽 객체들을 투사할 수 있다. 예를 들어, 도시된 실시예에서, 어레이 는 홀로그래픽 객체 및 홀로그래픽 객체를 투사한다. LF 디스플레이 모듈들의 타일링은 훨씬 더 큰 가시 부피뿐만 아니라, 객체들이 어레이로부터 더 먼 거리로 투사될 수 있게 한다. 예를 들어, 도시된 실시예에서, 가시 부피는 근사적으로, LF 디스플레이 모듈의 전방(및 후방)의 국소화된 부피가 아니라, 어 레이의 전방 및 후방에 있는 전체 영역이다. 일부 실시예들에서, LF 디스플레이 시스템은 홀로그래픽 객체를 관찰자 및 관찰자에 제공 한다. 관찰자 및 관찰자는 홀로그래픽 객체의 상이한 관점들을 수신한다. 예를 들어, 관찰자 에게는 홀로그래픽 객체의 직접적인 뷰가 제공되는 반면, 관찰자에게는 홀로그래픽 객체의 더 경사진 뷰가 제공된다. 관찰자 및/또는 관찰자가 이동함에 따라, 그들은 홀로그래픽 객체의 상이한 관점들을 제공받는다. 이는 관찰자가 홀로그래픽 객체에 대해 이동함으로써 홀로그래픽 객체와 시각적으 로 상호작용할 수 있게 한다. 예를 들어, 관찰자가 홀로그래픽 객체 주위를 걸어갈 때, 관찰자 는 홀로그래픽 객체가 어레이의 홀로그래픽 객체 부피 내에 남아 있는 한, 홀로그래픽 객체의 상이한 측면들을 보게 된다. 따라서, 관찰자 및 관찰자는 마치 실제로 존재하는 것처럼 실제 공간에 서 홀로그래픽 객체를 동시에 볼 수 있다. 또한, 홀로그래픽 객체는 물리적 객체가 보이는 것과 거의 동일한 방식으로 관찰자들에게 보이기 때문에 관찰자 및 관찰자는 홀로그래픽 객체를 보기 위해 외부 장치를 착용할 필요가 없다. 또한, 여기에서, 홀로그래픽 객체는 어레이의 가시 부피가 어레이의 표 면 뒤로 연장되기 때문에, 어레이 뒤에 도시되어 있다. 이런 식으로, 홀로그래픽 객체는 어레이의 표 면보다 관찰자들로부터 더 멀리 떨어져 있는 것처럼 관찰자 및/또는 관찰자에게 제공될 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 관찰자 및 관찰자의 위치들을 추적하는 추적 시스 템을 포함할 수 있다. 일부 실시예들에서, 추적되는 위치는 관찰자의 위치이다. 다른 실시예들에서, 추적되는 위치는 관찰자의 눈의 위치이다. 눈의 위치 추적은 눈이 어디를 보고 있는지를 추적하는 시선 추적(예를 들어, 응시 위치를 결정하기 위해 방향을 사용함)과는 상이하다. 관찰자의 눈과 관찰자의 눈은 서로 다른 위치에 있다. 다양한 구성들에서, LF 디스플레이 시스템은 하나 이상의 추적 시스템들을 포함할 수 있다. 예를 들어, 도 4a의 예시된 실시예에서, LF 디스플레이 시스템은 어레이 외부에 있는 추적 시스템을 포함한다. 여기 서, 추적 시스템은 어레이에 연결된 카메라 시스템일 수 있다. 외부의 추적 시스템들은 도 5a와 관련하여 더 상세히 설명된다. 다른 예시적인 실시예들에서, 추적 시스템은 본원에 기술된 바와 같이 어레이 내에 통합될 수 있다. 예를 들어, 어레이에 포함된 LF 디스플레이 모듈의 에너지 장치(예를 들어, 에너지 장치)는 어레이의 전방에 있는 관찰자들의 이미지들을 캡처하도록 구성될 수 있다. 어느 경우든, LF 디스플레이 시스템의 추적 시스템(들)은 어레이에 의해 제공되는 홀로그래픽 콘텐츠를 보는 관찰자 (예를 들어, 관찰자 및/또는 관찰자)에 관한 추적 정보를 결정한다. 추적 정보는 관찰자의 위치에 대한(예를 들어, 추적 시스템에 대한) 공간 내의 위치, 또는 관찰자의 일 부분의 위치(예를 들어, 관찰자의 한쪽 또는 양쪽 눈, 또는 관찰자의 말단부들)를 기술한다. 추적 시스템은 추적 정보 를 결정하기 위해 임의의 수의 깊이 결정 기술들을 이용할 수 있다. 깊이 결정 기술들은 예를 들어, 구조화된 광, 비행 시간, 스테레오 이미징, 일부 다른 깊이 결정 기술, 또는 이들의 몇몇 조합을 포함할 수 있다. 추적 시스템은 추적 정보를 결정하도록 구성된 다양한 시스템들을 포함할 수 있다. 예를 들어, 추적 시스템은 하나 이상의 적외선 소스들(예를 들어, 구조화된 광원들), 적외선에서의 이미지들을 캡처할 수 있는 하나 이상의 이 미징 센서들(예를 들어, 적-청-녹-적외선 카메라), 및 추적 알고리즘을 실행하는 프로세서를 포함할 수 있다. 추적 시스템은 관찰자들의 위치들을 결정하기 위해 깊이 추정 기술들을 사용할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 본원에 설명된 바와 같이 관찰자 및/또는 관찰자의 추적된 위치들, 동작들, 또는 제스처들에 기초하여 홀로그래픽 객체들을 생성한다. 예를 들어, LF 디스플레이 시스템은 어 레이 및/또는 특정 위치의 임계 거리 내에 들어오는 관찰자에 응답하여 홀로그래픽 객체를 생성할 수 있다. LF 디스플레이 시스템은 추적 정보에 부분적으로 기초하여 각각의 관찰자에 맞춤화된 하나 이상의 홀로그 래픽 객체들을 제공할 수 있다. 예를 들어, 관찰자에게는 홀로그래픽 객체가 제공될 수 있지만, 홀로 그래픽 객체는 제공되지 않을 수 있다. 유사하게, 관찰자에게는 홀로그래픽 객체가 제공될 수 있지만, 홀로그래픽 객체는 제공되지 않을 수 있다. 예를 들어, LF 디스플레이 시스템은 관찰자 및 관찰자 각각의 위치를 추적한다. LF 디스플레이 시스템은 홀로그래픽 객체가 제공될 위치에 대한 그들의 상대적인 위치에 기초하여 관찰자에게 보여야 하는 홀로그래픽 객체의 관점을 결정한다. LF 디스플레이 시스템은 결정된 관점에 대응하는 특정 픽셀들로부터 광을 선택적으로 투사한다. 따라서, 관찰자 및 관찰자는 동시에, 잠재적으로 완전히 상이한 경험을 가질 수 있다. 즉, LF 디스플레이 시스템은 가시 부피의 가시 서브부피에 홀로그래픽 콘텐츠를 제공할 수 있다. 예를 들어, 예시된 바와 같이, 가시 부피는 어레 이의 전방 및 후방의 모든 공간으로 표현된다. 이 예에서, LF 디스플레이 시스템이 관찰자의 위치를 추적할 수 있기 때문에, LF 디스플레이 시스템은 관찰자 주위의 가시 서브-부피에 공간 콘텐츠(예를 들어, 홀로그래픽 객체)를, 그리고 관찰자 주위의 가시 서브-부피에 사파리 콘텐츠(예를 들어, 홀로 그래픽 객체)를 제공할 수 있다. 이와 달리, 통상적인 시스템들은 유사한 경험을 제공하기 위해 개별 헤드 셋을 사용해야 한다. 일부 실시예들에서, LF 디스플레이 시스템은 하나 이상의 감각 피드백 시스템들을 포함할 수 있다. 감각 피드백 시스템들은 홀로그래픽 객체들(420, 422)을 증강시키는 다른 감각 자극들(예를 들어, 촉각, 청각, 또는 후각)을 제공한다. 예를 들어, 도 4a의 예시된 실시예에서, LF 디스플레이 시스템은 어레이 외부의 감각 피드백 시스템을 포함한다. 일 예에서, 감각 피드백 시스템은 어레이에 연결된 정전기 스 피커일 수 있다. 외부 감각 피드백 시스템은 도 5a와 관련하여 더욱 상세히 설명된다. 다른 예시적인 실시예들 에서, 감각 피드백 시스템은 본원에 기술된 바와 같이 어레이 내에 통합될 수 있다. 예를 들어, 어레이 에 포함된 LF 디스플레이 모듈의 에너지 장치(예를 들어, 도 3b의 에너지 장치(340A))는 어레이의 전 방에서 관찰자들에게 초음파 에너지를 투사하고 및/또는 어레이의 전방에서 관찰자들로부터 이미징 정보를 수신 하도록 구성될 수 있다. 어느 경우든, 감각 피드백 시스템은 어레이에 의해 제공되는 홀로그래픽 콘텐츠 (예를 들어, 홀로그래픽 객체 및/또는 홀로그래픽 객체)를 보는 관찰자(예를 들어, 관찰자 및/ 또는 관찰자)에게 감각 콘텐츠를 제공하고/하거나 그로부터 감각 콘텐츠를 수신한다. LF 디스플레이 시스템은 어레이의 외부에 있는 하나 이상의 음향 투사 장치들을 포함하는 감각 피드백 시 스템을 포함할 수 있다. 대안적으로 또는 추가적으로, LF 디스플레이 시스템은 본원에 기술된 바와 같이 어레이 내에 통합된 하나 이상의 음향 투사 장치들을 포함할 수 있다. 음향 투사 장치는 관찰자의 일 부분 이 하나 이상의 표면들의 임계 거리 내에 도달하는 경우 홀로그래픽 객체의 하나 이상의 표면들에 대해(예를 들 어, 홀로그래픽 객체의 표면에) 부피 촉각 감각을 생성하는 초음파 압력파를 투사할 수 있다. 부피 촉각 감각은 사용자로 하여금 홀로그래픽 객체의 표면들을 만지고 느낄 수 있게 한다. 또한, 복수의 음향 투사 장치 들은 관찰자들에게 오디오 콘텐츠(예를 들어, 몰입형 오디오)를 제공하는 가청 압력파를 투사할 수 있다. 따라 서, 초음파 압력파 및/또는 가청 압력파는 홀로그래픽 객체를 보완하는 작용을 할 수 있다. 다양한 실시예들에서, LF 디스플레이 시스템은 관찰자의 추적된 위치에 부분적으로 기초하여 다른 감각 자 극들을 제공할 수 있다. 예를 들어, 도 4a에 도시된 홀로그래픽 객체는 사자이고, LF 디스플레이 시스템 은 시각적으로(즉, 홀로그래픽 객체가 으르렁거리는(roar) 것으로 보임) 및 청각적으로(즉, 하나 이 상의 음향 투사 장치들은 관찰자가 홀로그래픽 객체로부터 나오는 사자의 으르렁거림으로서 인지하는 압력파를 투사함) 으르렁거리는 홀로그래픽 객체를 가질 수 있다. 도시된 구성에서, 홀로그래픽 가시 부피는 도 2의 LF 디스플레이 시스템의 가시 부피와 유사한 방식 으로 제한될 수 있음에 유의해야 한다. 이는 관찰자가 단일의 벽면 디스플레이 유닛으로 경험하게 될 인식된 몰 입의 정도를 제한할 수 있다. 이를 해결하기 위한 한 가지 방법은 도 4b 내지 도 4f와 관련하여 아래에서 설명 되는 바와 같이 다수의 측면들을 따라 타일링되는 다수의 LF 디스플레이 모듈들을 사용하는 것이다. 도 4b는 하나 이상의 실시예들에 따른, 다중-측면의 이음매 없는 표면 환경에서의 LF 디스플레이 시스템의 일 부분의 사시도이다. LF 디스플레이 시스템은 복수의 LF 디스플레이 모듈들이 다중 측면의 이음매 없는 표면 환경을 생성하도록 타일링되는 것을 제외하고는, LF 디스플레이 시스템과 실질적으로 유사하다. 보다 구체적으로, LF 디스플레이 모듈들은 6개의 면의 집합된(aggregated) 이음매 없는 표면 환경인 어레이를 형성하 도록 타일링된다. 도 4b의 각각의 사각형에서, 복수의 LF 디스플레이 모듈들은 방의 벽, 천장, 및 바닥을 모두 커버한다. 다른 실시예들에서, 복수의 LF 디스플레이 모듈들은 벽, 바닥, 천장, 또는 이들의 일부 조합의 전부 가 아닌 일부를 커버할 수 있다. 다른 실시예들에서, 복수의 LF 디스플레이 모듈들은 일부 다른 집합된 이음매 없는 표면을 형성하도록 타일링된다. 예를 들어, 벽들은 원통형의 집합된 에너지 환경이 형성되도록 만곡될 수있다. 또한, 도 6 내지 도 9와 관련하여 후술하는 바와 같이, 일부 실시예들에서, LF 디스플레이 모듈들은 특정 장소 또는 개인용 시청 룸(예를 들어, 벽 등)에 표면을 형성하도록 타일링될 수 있다. LF 디스플레이 시스템은 하나 이상의 홀로그래픽 객체들을 투사할 수 있다. 예를 들어, 도시된 실시예에서, LF 디스플레이 시스템은 홀로그래픽 객체를 6개의 면의 집합된 이음매 없는 표면 환경에 의해 둘러싸인 영역으로 투사한다. 따라서, LF 디스플레이 시스템의 가시 부피는 또한, 6면의 집합된 이음매 없 는 표면 환경 내에 포함된다. 도시된 구성에서, 관찰자는 홀로그래픽 객체와, 홀로그래픽 객체 를 형성하기 위해 사용되는 에너지(예를 들어, 광 및/또는 압력파)를 투사하는 LF 디스플레이 모듈의 사이 에 위치될 수 있음에 유의해야 한다. 따라서, 관찰자의 위치로 인해, 관찰자는 LF 디스플레이 모듈 로부터의 에너지로부터 형성된 홀로그래픽 객체를 인지하는 것을 방해받을 수 있다. 그러나, 도시된 구성에서, (예를 들어, 관찰자에 의해) 방해받지 않고, 홀로그래픽 객체를 형성하기 위해 에너지를 투사할 수 있는 적어도 하나의 다른 LF 디스플레이 모듈, 예를 들어 LF 디스플레이 모듈이 있다. 이런 식 으로, 공간 내의 관찰자들에 의한 막힘(occlusion)은 홀로그래픽 투사들의 일부 부분이 사라지게 할 수 있지만, 그 효과는 부피의 단지 한쪽 면만 홀로그래픽 디스플레이 패널들로 채워지는 경우보다는 훨씬 더 작다. 홀로그 래픽 객체는 홀로그래픽 객체 부피가 집합된 표면 뒤로 연장되기 때문에 6개의 면의 집합된 이음매 없는 표면 환경의 벽들 \"외부에\" 도시되어 있다. 따라서, 관찰자 및/또는 관찰자는 홀로그래픽 객체 를 그들이 통과할 수 있는 6면 환경의 \"외부\"로서 인지할 수 있다. 도 4a를 참조하여 전술한 바와 같이, 일부 실시예들에서, LF 디스플레이 시스템은 관찰자들의 위치들을 능 동적으로 추적하고, 추적된 위치들에 기초하여 홀로그래픽 콘텐츠를 제공하도록 상이한 LF 디스플레이 모듈들에 동적으로 지시할 수 있다. 따라서, 다중-측면의 구성은 제한되지 않은 관찰자들이 다중-측면의 이음매 없는 표 면 환경에 의해 둘러싸인 영역을 관통하여 자유롭게 이동할 수 있는 홀로그래픽 객체들을 제공하기 위한 보다 강건한(robust)(예를 들어, 도 4a에 비해) 환경을 제공할 수 있다. 특히, 다양한 LF 디스플레이 시스템들은 상이한 구성들을 가질 수 있다. 또한, 각각의 구성은, 집합적으로, 이 음매 없는 디스플레이 표면(\"집합 표면\")을 형성하는, 표면들의 특정 배향을 가질 수 있다. 즉, LF 디스플레이 시스템의 LF 디스플레이 모듈들은 다양한 집합 표면들을 형성하도록 타일링될 수 있다. 예를 들어, 도 4b에서, LF 디스플레이 시스템은 방의 벽들을 근사화하는 6개의 면의 집합 표면을 형성하도록 타일링된 LF 디스플 레이 모듈들을 포함한다. 일부 다른 예들에서, 집합 표면은 전체 표면(예를 들어, 전체 벽)이 아니라 표면의 일 부(예를 들어, 벽의 절반)에서만 발생할 수 있다. 일부 예들은 본원에서 설명된다. 일부 구성들에서, LF 디스플레이 시스템의 집합 표면은 국부화된 가시 부피를 향해 에너지를 투사하도록 구성된 집합 표면을 포함할 수 있다. 국부적인 가시 부피에 에너지를 투사하는 것은, 예를 들어, 특정 가시 부피 내의 투사된 에너지의 밀도를 증가시키고, 그 부피 내의 관찰자들에 대한 FOV를 증가시키며, 가시 부피를 디스플레이 표면에 더 가깝게 하는 것에 의해, 더 높은 품질의 가시 경험을 가능하게 한다. 예를 들어, 도 4c는 \"날개형(winged)\" 구성으로 집합 표면을 갖는 LF 디스플레이 시스템(450A)의 평면도를 도시 한다. 이 예에서, LF 디스플레이 시스템(450A)은 전면 벽, 후면 벽, 제1 측벽, 제2 측벽, 천장(도시되지 않음), 및 바닥(도시되지 않음)을 갖는 방에 위치된다. 제1 측벽, 제2 측벽, 후면 벽 , 바닥 및 천장은 모두 수직한다. LF 디스플레이 시스템(450A)은 전면 벽을 덮는 집합 표면을 형성하 도록 타일링된 LF 디스플레이 모듈들을 포함한다. 전면 벽, 및 따라서 집합 표면은 3개의 부분들, 즉, (i) 후면 벽과 근사적으로 평행한 제1 부분(즉, 중앙 표면), (ii) 제1 부분을 제1 측벽 에 연결하고 방의 중심을 향해 에너지를 투사하기 위한 각도에 위치되는 제2 부분(즉, 제1 측면), 및 (iii) 제1 부분을 제2 측벽에 연결하고 방의 중심을 향해 에너지를 투사하기 위한 각도에 위치되는 제3 부분(즉, 제2 측면)을 포함한다. 제1 부분은 방 안의 수직한 평면이고, 수평 및 수직 축을 가진다. 제 2 부분 및 제3 부분은 수평 축을 따라 방의 중심을 향해 각진다. 이 예에서, LF 디스플레이 시스템(450A)의 가시 부피(468A)는 방의 중앙에 있고, 집합 표면의 세 부분들에 의해 부분적으로 둘러싸인다. 관찰자를 적어도 부분적으로 둘러싸는 집합 표면(\"주위 표면\")은 관찰자들의 몰입 적 경험을 증가시킨다. 설명을 위해, 예를 들어, 단지 중앙 표면만을 갖는 집합 표면을 고려한다. 도 2a를 참조하면, 디스플레이 표면 의 어느 한쪽 단부로부터 투사되는 광선들은 전술한 바와 같이 이상적인 홀로그래픽 부피 및 이상적인 가시 부 피를 생성한다. 이제, 예를 들어, 중앙 표면이 관찰자를 향해 각진 2개의 측면들을 포함하는 경우를 고려한다. 이 경우에, 광선 및 광선은 중앙 표면의 법선으로부터 더 큰 각도로 투사될 것이다. 따라서, 가시 부피의 시야는 증가할 것이다. 유사하게, 홀로그래픽 가시 부피는 디스플레이 표면에 더 가까울 것이다. 추가적으 로, 2개의 제2 부분 및 제3 부분이 가시 부피에 더 가까이 경사지기 때문에, 디스플레이 표면으로부터 고정된 거리에 투사되는 홀로그래픽 객체들은 해당 가시 부피에 더 가깝다. 단순화를 위해, 단지 중앙 표면만을 갖는 디스플레이 표면은 평면형의(planar) 시야, (중앙의) 디스플레이 표면 과 가시 부피 사이의 평면형의 임계 간격, 및 홀로그래픽 객체와 가시 부피 사이의 평면형의 근접성을 갖는다. 관찰자를 향해서 각진 하나 이상의 측면들을 추가하는 것은 평면형의 시야에 비해 시야를 증가시키고, 평면형의 간격에 비해 디스플레이 표면과 가시 부피 사이의 간격을 감소시키며, 평면형의 근접성에 비해 디스플레이 표면 과 홀로그래픽 객체 사이의 근접성을 증가시킨다. 관찰자를 향해 측면들을 더 경사지게 하는 것은 시야를 더 증 가시키고, 간격을 더 감소시키며, 근접성을 더 증가시킨다. 즉, 측면들의 각진 배치는 관찰자들에 대한 몰입적 경험을 증가시킨다. 또한, 도 6과 관련하여 아래에서 설명되는 바와 같이, 편향 광학계는 LF 디스플레이 파라미터들(예를 들어, 치 수들 및 FOV)에 대한 가시 부피의 크기 및 위치를 최적화하기 위해 사용될 수 있다. 도 4d를 참조하면, 유사한 예에서, 도 4d는 \"경사진\" 구성으로 집합 표면을 갖는 LF 디스플레이 시스템(450B)의 측면도를 도시한다. 이 예에서, LF 디스플레이 시스템(450B)은 전면 벽, 후면 벽, 제1 측벽(도시되지 않음), 제2 측벽(도시되지 않음), 천장, 및 바닥을 갖는 방에 위치된다. 제1 측벽, 제2 측벽, 후면 벽, 바닥, 및 천장은 모두 수직이다. LF 디스플레이 시스템(450B)은 전면 벽을 커버하는 집합 표면을 형성하도록 타일링된 LF 디스플레이 모듈들을 포함한다. 전면 벽 및 이에 따른 집합 표면 은 3개의 부분들, 즉, (i) 후면 벽(즉, 중앙 표면)과 거의 평행한 제1 부분, (ii) 제1 부분 을 천장에 연결하고 방의 중심을 향해 에너지를 투사하도록 각진 제2 부분(즉, 제1 측면), 및 (iii) 제1 부분을 바닥으로 연결하고 방의 중심을 향해 에너지를 투사하도록 각진 제3 부분(즉, 제2 측면)을 포함한다. 제1 부분은 방 안의 수직한 평면이고, 수평 및 수직 축을 가진다. 제2 부분 및 제3 부분 은 수직축을 따라 방의 중심을 향하여 각진다. 이 예에서, LF 디스플레이 시스템(450B)의 가시 부피(468B)는 방의 중심에 있고 집합 표면의 세 부분들에 의해 부분적으로 둘러싸인다. 도 4c에 도시된 구성과 유사하게, 2개의 측면 부분들(예를 들어, 제2 부분 및 제3 부분)은 관찰자를 둘러싸고 주위 표면을 형성하도록 각진다. 주위 표면은 홀로그래픽 가시 부피 (468B) 내의 임의의 관찰자의 관점으로부터 가시 FOV를 증가시킨다. 추가적으로, 주위 표면은 투사된 객체들이 더 가깝게 보이도록 가시 부피(468B)가 디스플레이의 표면에 더 가깝게 되게 한다. 즉, 측면들의 각진 배치는 시야를 증가시키고, 간격을 감소시키며, 집합 표면의 근접성을 증가시키며, 그에 따라 관찰자들에 대한 몰입형 경험을 증가시킨다. 또한, 아래에서 설명되는 바와 같이, 가시 부피(468B)의 크기 및 위치를 최적화하기 위해 편향 광학계가 사용될 수 있다. 집합 표면의 측면 부분들의 경사진 구성은, 제3 부분이 경사지지 않은 경우보다, 홀로그래픽 콘텐츠 가 가시 부피(468B)에 더 가깝게 제공될 수 있게 한다. 예를 들어, 경사진 구성에서 LF 디스플레이 시스템으로 부터 제공된 캐릭터의 하단 말단부들(예를 들어, 다리)은, 평평한 전면 벽을 갖는 LF 디스플레이 시스템이 사용 된 경우보다, 더 가깝고 더 현실적으로 보일 수 있다. 또한, LF 디스플레이 시스템의 구성 및 그것이 위치되는 환경은 가시 부피들 및 가시 서브 부피들의 형태 및 위 치들을 알려줄 수 있다. 예를 들어, 도 4e는 방의 전면 벽 상에 집합 표면을 갖는 LF 디스플레이 시스템(450C)의 평면도를 도 시한다. 이 예에서, LF 디스플레이 시스템(450D)은 전면 벽, 후면 벽, 제1 측벽, 제2 측벽 , 천장(도시되지 않음), 및 바닥(도시되지 않음)을 갖는 방 안에 위치된다. LF 디스플레이 시스템(450C)은 집합 표면으로부터 다양한 광선들을 투사한다. 집합 표면의 좌측으로 부터 투사된 광선들은 수평 각도 범위를 가지며, 집합 표면의 우측으로부터 투사된 광선들은 수평 각도 범 위를 가지며, 집합 표면의 중심으로부터 투사된 광선들은 수평 각도 범위를 가진다. 이러한 지 점들 사이에서, 도 6과 관련하여 아래 설명되는 바와 같이, 투사된 광선들은 각도 범위의 중간 값을 취할 수 있 다. 이런 식으로 디스플레이 표면에 걸쳐 투사된 광선들에서 경사진 편향 각도를 갖는 것은 가시 부피(468C)를 생성한다. 또한, 이러한 구성은 측면 벽들(456, 458)로 광선을 투사하여 디스플레이의 해상도를 낭비하는 것을 방지한다. 도 4f는 방의 전면 벽 상에 집합 표면을 갖는 LF 디스플레이 시스템(450D)의 일 측면도를 도시한다. 이 예에서, LF 디스플레이 시스템(450E)은 전면 벽, 후면 벽, 제1 측벽(도시되지 않음), 제2 측벽(도 시되지 않음), 천장, 및 바닥을 갖는 방 안에 위치된다. 이 예에서, 바닥에는 각각의 층이 전면 벽으 로부터 후면 벽으로 이동함에 따라 계단 상승하도록 층이 형성된다. 여기서, 바닥의 각각의 층은 가시 서브 부 피(예를 들어, 가시 서브 부피(470A 및 470B))를 포함한다. 계단형 바닥은 가시 서브 부피들이 오버랩되지 않게 한다. 즉, 각각의 가시 서브 부피는 해당 가시 서브 부피로부터, 다른 가시 서브 부피를 통과하지 않는 집합 표 면으로의 시야 라인(line of sight)을 갖는다. 즉, 이러한 배향은 계층들 간의 수직 오프셋으로 인해 각각 의 계층이 다른 계층들의 가시 서브 부피들을 \"너머 볼 수\" 있게 하는 \"경기장 좌석\" 효과를 생성한다. 오버랩 되지 않는 가시 서브 부피들을 포함하는 LF 디스플레이 시스템들은 오버랩되는 가시 부피들을 갖는 LF 디스플레 이 시스템들보다 더 높은 품질의 가시 경험을 제공할 수 있다. 예를 들어, 도 4f에 도시된 구성에서, 가시 서브 부피들(470A 및 470B)의 관찰자들에게 상이한 홀로그래픽 콘텐츠가 투사될 수 있다. LF 디스플레이 시스템의 제어 도 5a는 하나 이상의 실시예들에 따른, LF 디스플레이 시스템의 블록도이다. LF 디스플레이 시스템은 LF 디스플레이 어셈블리 및 컨트롤러를 포함한다. LF 디스플레이 어셈블리는 라이트필드(light field)를 투사하는 하나 이상의 LF 디스플레이 모듈들을 포함한다. LF 디스플레이 모듈은 다른 유형 의 에너지를 투사 및/또는 감지하는 통합된 에너지 소스(들) 및/또는 에너지 센서(들)를 포함하는 소스/센서 시 스템을 포함할 수 있다. 컨트롤러는 데이터 저장부, 네트워크 인터페이스, 및 LF 처리 엔 진을 포함한다. 컨트롤러는 또한, 추적 모듈, 및 관찰자 프로파일링 모듈을 포함할 수 있 다. 일부 실시예들에서, LF 디스플레이 시스템은 또한, 감각 피드백 시스템 및 추적 시스템을 포함한다. 도 1, 도 2, 도 3 및 도 4와 관련하여 설명된 LF 디스플레이 시스템들은 LF 디스플레이 시스템 의 실시예들이다. 다른 실시예들에서, LF 디스플레이 시스템은 본원에 설명된 것들보다 더 많은 또는 더 적은 모듈들을 포함한다. 유사하게, 기능들은 본원에 설명된 것과 다른 방식으로 모듈들 및/또는 다른 엔티티들 중에 분배될 수 있다. LF 디스플레이 시스템의 응용예들은 또한 도 6 내지 도 10과 관련하여 아래에서 상 세히 설명된다. LF 디스플레이 어셈블리는 가시 부피 내에 위치된 관찰자들에게 보일 수 있는 홀로그래픽 객체 부피 내에 홀로그래픽 콘텐츠를 제공한다. LF 디스플레이 어셈블리는 컨트롤러로부터 수신된 디스플레이 명령들 을 실행함으로써 홀로그래픽 콘텐츠를 제공할 수 있다. 홀로그래픽 콘텐츠는, LF 디스플레이 어셈블리의 집합 표면의 전방에, LF 디스플레이 어셈블리의 집합 표면 뒤에, 또는 이들의 일부 조합에 투사되는, 하나 이상의 홀로그래픽 객체들을 포함할 수 있다. 컨트롤러를 이용하여 디스플레이 명령들을 생성하는 것은 이 하에서 더 상세히 설명된다. LF 디스플레이 어셈블리는 LF 디스플레이 어셈블리에 포함된 하나 이상의 LF 디스플레이 모듈들(예를 들면, LF 디스플레이 모듈, LF 디스플레이 시스템, 및 LF 디스플레이 모듈 중 임의의 것)을 사 용하여 홀로그래픽 콘텐츠를 제공한다. 편의상, 하나 이상의 LF 디스플레이 모듈들은 본원에서 LF 디스플레이 모듈로 설명될 수 있다. LF 디스플레이 모듈은 LF 디스플레이 어셈블리를 형성하도록 타일링될 수 있다. LF 디스플레이 모듈들은 다양한 이음매 없는 표면 환경들(예를 들어, 한 면, 여러 면, 특정 장소 의 벽, 만곡된 표면 등)로서 구조화될 수 있다. 즉, 타일형 LF 디스플레이 모듈들은 집합 표면을 형성한다. 전 술한 바와 같이, LF 디스플레이 모듈은 홀로그래픽 콘텐츠를 제공하는 에너지 장치층(예를 들어, 에너지 장치층) 및 에너지 도파층(예를 들어, 에너지 도파층)을 포함한다. 또한, LF 디스플레이 모듈은 홀로그래픽 콘텐츠를 제공할 때 에너지 장치층과 에너지 도파층 간에 에너지를 전달하는 에너지 중계층(예를 들 어, 에너지 중계층)을 포함할 수 있다. 또한, LF 디스플레이 모듈은 전술한 바와 같이 에너지 투사 및/또는 에너지 감지를 위해 구성된 다른 통합 시스템들을 포함할 수 있다. 예를 들어, 라이트필드 디스플레이 모듈은 에너지를 투사 및/또는 감지하도록 구성된 임의의 수의 에너지 장치들(예를 들어, 에너지 장치)을 포함할 수 있다. 편의상, LF 디스플레이 모 듈의 통합된 에너지 투사 시스템들 및 통합된 에너지 감지 시스템들은, 본원에서 집합적으로, 소스/센서 시스템으로서 기술될 수 있다. 소스/센서 시스템은 소스/센서 시스템이 LF 디스플레이 모듈 과 동일한 이음매 없는 에너지 표면을 공유하도록LF 디스플레이 모듈 내에 통합된다. 즉, LF 디스플 레이 어셈블리의 집합 표면은 LF 디스플레이 모듈 및 소스/센서 모듈 모두의 기능을 포함한다. 즉, 소스/센서 시스템을 갖는 LF 디스플레이 모듈을 포함하는 LF 어셈블리는 라이트필드를 투사 하면서 동시에 에너지를 투사 및/또는 감지할 수 있다. 예를 들어, LF 디스플레이 어셈블리는 전술한 바와 같이 듀얼-에너지 표면 또는 양방향 에너지 표면으로서 구성된 LF 디스플레이 모듈 및 소스/센서 시스템을 포함할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 감각 피드백 시스템을 이용하여, 생성된 홀로그래픽 콘 텐츠를 다른 감각 콘텐츠(예를 들어, 조정된 촉각, 청각, 또는 후각)로 증강한다. 감각 피드백 시스템은 컨트롤러로부터 수신된 디스플레이 명령들을 실행함으로써 홀로그래픽 콘텐츠의 투사를 증강시킬 수 있다. 일반적으로, 감각 피드백 시스템은 LF 디스플레이 어셈블리(예를 들어, 감각 피드백 시스템) 외 부에 있는 임의의 개수의 감각 피드백 장치를 포함한다. 일부 예시적인 감각 피드백 장치들은 조정된 음향 투사 및 수신 장치, 방향제 투사 장치, 온도 조절 장치, 힘 작동 장치, 압력 센서, 변환기 등을 포함할 수 있다. 일 부 경우에, 감각 피드백 시스템은 라이트필드 디스플레이 어셈블리와 유사한 기능을 가질 수 있고, 그 반대도 가능하다. 예를 들어, 감각 피드백 시스템 및 라이트필드 디스플레이 어셈블리 모두는 소 리 필드를 생성하도록 구성될 수 있다. 또 다른 예로서, 감각 피드백 시스템은, 라이트필드 디스플레이 어셈블리가 햅틱 표면을 생성하도록 구성되지 않는 동안, 햅틱 표면을 생성하도록 구성될 수 있다. 예를 들어, 라이트필드 디스플레이 시스템의 예시적인 실시예에서, 감각 피드백 시스템은 음향 투사 장치를 포함할 수 있다. 음향 투사 장치는 컨트롤러로부터 수신된 디스플레이 명령들을 실행할 때 홀로그 래픽 콘텐츠를 보완하는 하나 이상의 압력파를 생성하도록 구성된다. 생성된 압력파들은 예를 들어, 가청(소리 의 경우), 초음파(터치의 경우), 또는 이들의 일부 조합일 수 있다. 유사하게, 감각 피드백 시스템은 방향 제 투사 장치를 포함할 수 있다. 방향제 투사 장치는 컨트롤러로부터 수신된 디스플레이 명령들을 실행할 때 타 겟 영역의 일부 또는 전부에 향기를 제공하도록 구성될 수 있다. 방향제 장치들은 공기 순환 시스템(예를 들어, 덕트, 팬(fan), 또는 벤트)에 연결되어 타겟 영역 내의 기류를 조정할 수 있다. 또한, 감각 피드백 시스템(57 0)은 온도 조절 장치를 포함할 수 있다. 온도 조절 장치는 컨트롤러로부터 수신된 디스플레이 명령들을 실 행할 때 타겟 영역의 일부 또는 전부에서 온도를 증가 또는 감소시키도록 구성된다. 일부 실시예들에서, 감각 피드백 시스템은 LF 디스플레이 시스템의 관찰자들로부터 입력을 수신하도 록 구성된다. 이러한 경우에, 감각 피드백 시스템은 관찰자들로부터 입력을 수신하기 위한 다양한 감각 피 드백 장치들을 포함한다. 감각 피드백 장치들은 음향 수신 장치들(예를 들어, 마이크), 압력 센서, 조이스틱, 모션 검출기, 트랜스듀서 등과 같은 장치를 포함할 수 있다. 감각 피드백 시스템은 홀로그래픽 콘텐츠 및/또는 감각 피드백을 조정하기 위해 검출된 입력을 컨트롤러에 전송할 수 있다. 예를 들어, 라이트필드 디스플레이 어셈블리의 예시적인 실시예에서, 감각 피드백 시스템은 마이크를 포함 한다. 마이크는 하나 이상의 관찰자들에 의해 생성된 오디오(예를 들어, 숨 막힘, 비명, 웃음 등)를 녹음하도록 구성된다. 감각 피드백 시스템은 녹음된 오디오를 관찰자 입력으로서 컨트롤러에 제공한다. 컨트롤러 는 홀로그래픽 콘텐츠를 생성하기 위해 관찰자 입력을 사용할 수 있다. 유사하게, 감각 피드백 시스템 은 압력 센서를 포함할 수 있다. 압력 센서는 관찰자에 의해 압력 센서로 인가되는 힘을 측정하도록 구성 된다. 감각 피드백 시스템은 측정된 힘을 관찰자 입력으로서 컨트롤러에 제공할 수 있다. 일부 실시예들에서, LF 디스플레이 시스템은 추적 시스템을 포함한다. 추적 시스템은 타겟 영역 내의 관찰자들의 위치, 이동 및/또는 특성들을 결정하도록 구성된 임의의 수의 추적 장치들을 포함한다. 일반적 으로, 추적 장치들은 LF 디스플레이 어셈블리의 외부에 있다. 일부 예시적인 추적 장치들은 카메라 어셈블 리(\"카메라\"), 하나 이상의 2D 카메라, 라이트필드 카메라, 깊이 센서, 구조화된 광, LIDAR 시스템, 카드 스캐 닝 시스템, 또는 타겟 영역 내의 관찰자들을 추적할 수 있는 임의의 다른 추적 장치를 포함한다. 추적 시스템은 타겟 영역의 일부 또는 전부에 빛을 비추는 하나 이상의 에너지 소스들을 포함할 수 있다. 그러나, 일부 경우에, 타겟 영역은 홀로그래픽 콘텐츠를 제공할 때 LF 디스플레이 어셈블리로부터의 자연 광 및/또는 주변광으로 조명된다. 에너지 소스는 컨트롤러로부터 수신된 명령들을 실행할 때 광을 투사한 다. 광은 예를 들어, 구조화된 광 패턴, 빛의 펄스(예를 들어, IR 플래시), 또는 이들의 일부 조합일 수 있다. 추적 시스템은 가시 대역(~380 nm 내지 750 nm), 적외선(IR) 대역(~750 nm 내지 1700 nm), 자외선 대역(10 nm 내지 380 nm), 전자기 스펙트럼의 일부 다른 부분, 또는 이들의 일부 조합의 광을 투사할 수 있다. 소스는 예를 들어, 발광 다이오드(LED), 마이크로 LED, 레이저 다이오드, TOF 깊이 센서, 튜닝가능한 레이저 등을 포함할 수 있다. 추적 시스템은 컨트롤러로부터 수신된 명령들을 실행할 때 하나 이상의 방출 파라미터를 조절할 수 있다. 방출 파라미터는 추적 시스템의 소스로부터 광이 어떻게 투사되는지에 영향을 주는 파라미터이다. 방출 파라미터는 예를 들어, 밝기, 펄스 속도(연속적인 조명을 포함하기 위함), 파장, 펄스 길이, 광이 소스 어 셈블리로부터 어떻게 투사되는지에 영향을 주는 일부 다른 파라미터, 또는 이들의 일부 조합을 포함할 수 있다.일 실시예에서, 소스는 비행 시간(time-of-flight) 동작으로 광의 펄스들을 투사한다. 추적 시스템의 카메라는 타겟 영역으로부터 반사된 광(예를 들어, 구조화된 광 패턴)의 이미지들을 캡처한 다. 카메라는 컨트롤러로부터 수신된 추적 명령들을 실행할 때 이미지들을 캡처한다. 전술한 바와 같이, 광은 추적 시스템의 소스에 의해 투사될 수 있다. 카메라는 하나 이상의 카메라들을 포함할 수 있다. 즉, 카메라는 예를 들어, 포토다이오드들의 어레이(1D 또는 2D), CCD 센서, CMOS 센서, 추적 시스템에 의해 광 투사의 일부 또는 전부를 검출하는 일부 다른 장치, 또는 이들의 일부 조합일 수 있다. 일 실시예에서, 추적 시 스템은 LF 디스플레이 어셈블리의 외부에 있는 라이트필드 카메라를 포함할 수 있다. 다른 실시예들 에서, 카메라는 LF 디스플레이 어셈블리에 포함된 LF 디스플레이 모듈의 일부로서 포함된다. 예를 들어, 전술한 바와 같이, 라이트필드 모듈의 에너지 중계 요소가 에너지 장치층에서 발광 디스플레이 및 이 미징 센서 모두를 인터리빙하는 양방향 에너지 층인 경우, LF 디스플레이 어셈블리는 라이트필드를 투사하 고 동시에 디스플레이 전방의 가시 영역으로부터의 이미징 정보를 기록하도록 구성될 수 있다. 일 실시예에서, 양방향 에너지 표면으로부터의 캡처된 이미지들은 라이트필드 카메라를 형성한다. 카메라는 캡처된 이미지들을 컨트롤러에 제공한다. 추적 시스템의 카메라는 컨트롤러로부터 수신된 추적 명령들을 실행할 때 하나 이상의 이미징 파라미 터들을 조절할 수 있다. 이미징 파라미터는 카메라가 이미지를 어떻게 캡처하는지에 영향을 주는 파라미터이다. 이미징 파라미터는 예를 들어, 프레임 레이트, 구경(aperture), 게인, 노출 길이, 프레임 타이밍, 롤링 셔터 또 는 전역 셔터 캡처 모드들, 카메라가 이미지들을 어떻게 캡처하는지에 영향을 주는 일부 다른 파라미터, 또는 이들의 일부 조합을 포함할 수 있다. 컨트롤러는 LF 디스플레이 어셈블리 및 LF 디스플레이 시스템의 임의의 다른 구성요소를 제어한 다. 컨트롤러는 데이터 저장부, 네트워크 인터페이스, 추적 모듈, 관찰자 프로파일링 모듈 , 및 라이트필드 처리 엔진을 포함한다. 다른 실시예들에서, 컨트롤러는 본원에 설명된 것들보 다 더 많은 또는 더 적은 모듈들을 포함한다. 유사하게, 기능들은 본원에 설명된 것과 다른 방식으로 모듈들 및 /또는 다른 엔티티들 중에 분배될 수 있다. 예를 들어, 추적 모듈은 LF 디스플레이 어셈블리 또는 추 적 시스템의 일부일 수 있다. 데이터 저장부는 LF 디스플레이 시스템에 대한 정보를 저장하는 메모리이다. 저장되는 정보는 디스플 레이 명령들, 추적 명령들, 방출 파라미터들, 이미징 파라미터들, 타겟 영역의 가상 모델, 추적 정보, 카메라에 의해 캡처된 이미지들, 하나 이상의 관찰자 프로파일들, 라이트필드 디스플레이 어셈블리를 위한 보정 데 이터, LF 모듈들의 해상도 및 배향을 포함하는 LF 디스플레이 시스템을 위한 구성 데이터, 원하는 가 시 부피 기하학, 3D 모델들, 장면들 및 환경들을 포함하는 그래픽 생성을 위한 콘텐츠, 재료들 및 텍스쳐들, LF 디스플레이 시스템에 의해 사용될 수 있는 다른 정보, 또는 이들의 일부 조합을 포함할 수 있다. 데이터 저장부는 읽기 전용 메모리(ROM), 동적 랜덤 액세스 메모리(DRAM), 정적 랜덤 액세스 메모리(SRAM), 또는 이들의 몇몇 조합과 같은 메모리이다. 네트워크 인터페이스는 라이트필드 디스플레이 시스템이 네트워크를 통해 다른 시스템들 또는 환경들과 통 신하게 한다. 일 예에서, LF 디스플레이 시스템은 네트워크 인터페이스를 통해 원격 라이트필드 디스 플레이 시스템으로부터 홀로그래픽 콘텐츠를 수신한다. 다른 예에서, LF 디스플레이 시스템은 네트워크 인 터페이스를 사용하여 홀로그래픽 콘텐츠를 원격 데이터 저장부에 전송한다. 추적 모듈은 LF 디스플레이 시스템에 의해 제공되는 콘텐츠를 관찰하는 관찰자들을 추적한다. 이를 위해, 추적 모듈은 추적 시스템의 소스(들) 및/또는 카메라(들)의 동작을 제어하는 추적 명령들을 생 성하고, 추적 시스템에 추적 명령들을 제공한다. 추적 시스템은 추적 명령들을 실행하고 추적 모듈 에 추적 입력을 제공한다. 추적 모듈은 타겟 영역 내의 하나 이상의 관찰자들의 위치(예를 들어, 앉아있거나 서 있음)를 결정할 수 있다. 결정된 위치는 예를 들어, 일부 기준점(예를 들어, 디스플레이 표면)에 대해 상대적일 수 있다. 다른 실 시예들에서, 결정된 위치는 타겟 영역의 가상 모델 내에 있을 수 있다. 추적되는 위치는, 예를 들어, 관찰자의 추적된 위치 및/또는 관찰자의 일 부분의 추적된 위치(예를 들어, 눈 위치, 손 위치 등)일 수 있다. 추적 모듈 은 추적 시스템의 카메라들로부터 하나 이상의 캡처된 이미지들을 사용하여 위치를 결정한다. 추적 시스템의 카메라들은 LF 디스플레이 시스템 주위에 분포될 수 있고, 스테레오 내의 이미지들을 캡처 할 수 있으며, 추적 모듈이 관찰자들을 수동적으로 추적할 수 있게 한다. 다른 실시예들에서, 추적 모듈 은 관찰자들을 능동적으로 추적한다. 즉, 추적 시스템은 타겟 영역의 일부 부분을 비추고, 타겟 영역을 이미징하며, 추적 모듈은 비행시간 및/또는 구조화된 광 깊이 결정 기술들을 이용하여 위치를 결정한다. 추적 모듈은 결정된 위치들을 이용하여 추적 정보를 생성한다. 추적 모듈은 또한, LF 디스플레이 시스템의 관찰자들로부터의 입력들로서 추적 정보를 수신할 수 있 다. 추적 정보는 관찰자가 LF 디스플레이 시스템에 의해 제공되는 다양한 입력 옵션들에 대응하는 신체 움 직임들을 포함할 수 있다. 예를 들어, 추적 모듈은 관찰자의 신체 움직임을 추적하고, LF 처리 엔진 에 대한 입력으로서 임의의 다양한 이동을 할당할 수 있다. 추적 모듈은 추적 정보를 데이터 저장부, LF 처리 엔진, 관찰자 프로파일링 모듈, LF 디스플레이 시스템의 임의의 다른 구성요소, 또는 이들의 일부 조합에 제공할 수 있다. 관찰자의 손에 제한되지 않지만, 추적 시스템은 관찰자의 손의 움직임을 기록하고, 기록을 추적 모듈(52 6)에 전송할 수 있다. 추적 모듈은 이 기록에서 관찰자의 손의 움직임을 추적하고, 해당 입력을 LF 처리 엔진으로 전송한다. 후술하는 바와 같이, 관찰자 프로파일링 모듈은 관찰자의 손의 움직임이 긍정 반 응과 연관되어 있는 것으로 이미지 내의 정보가 나타내는 것으로 결정한다. 따라서, 충분한 관찰자들이 긍정적 인 반응을 갖는 것으로 인식되는 경우, LF 처리 엔진은 긍정에 대한 적절한 홀로그래픽 콘텐츠를 생성한다. 예를 들어, LF 처리 엔진은 해당 장면에서 컨페티(confetti)를 투사할 수 있다. LF 디스플레이 시스템은 관찰자들을 식별하고 프로파일링하도록 구성된 관찰자 프로파일링 모듈을 포 함한다. 관찰자 프로파일링 모듈은 LF 디스플레이 시스템에 의해 디스플레이되는 홀로그래픽 콘텐츠 를 관찰하는 관찰자(또는 관찰자들)의 프로파일을 생성한다. 관찰자 프로파일링 모듈은 관찰자 입력 및 모 니터링된 관찰자 행동, 동작, 및 반응에 부분적으로 기초하여 관찰자 프로파일을 생성한다. 관찰자 프로파일링 모듈은 추적 시스템(예를 들어, 기록된 이미지, 비디오, 소리 등)으로부터 획득된 정보에 액세스하고, 해당 정보를 처리하여 다양한 정보를 결정할 수 있다. 다양한 예들에서, 관찰자 프로파일링 모듈 은 관찰자 행동, 동작들, 및 반응들을 결정하기 위해 임의의 수의 머신 비전 알고리즘 또는 머신 히어링 (hearing) 알고리즘을 사용할 수 있다. 모니터링된 관찰자 행동은, 예를 들어, 미소, 응원, 박수, 웃음, 두려움, 비명, 흥분 레벨, 움츠림, 제스처의 다른 변화, 또는 관찰자들의 움직임 등을 포함할 수 있다. 보다 일반적으로, 관찰자 프로파일은 LF 디스플레이 시스템으로부터의 홀로그래픽 콘텐츠를 보는 관찰자에 대해 수신 및/또는 결정된 임의의 정보를 포함할 수 있다. 예를 들어, 각각의 관찰자 프로파일은 LF 디스플레이 시스 템에 의해 디스플레이되는 콘텐츠에 대해 해당 관찰자의 동작들 또는 반응들을 기록(log)할 수 있다. 관찰 자 프로파일에 포함될 수 있는 일부 예시적인 정보는 아래에서 제공된다. 일부 실시예들에서, 관찰자 프로파일은 표시되는 캐릭터, 배우, 장면 등에 대하여 관찰자의 반응을 기술할 수 있다. 예를 들어, 관찰자 프로파일은 관찰자가 일반적으로 특정 장면(예를 들어, 기간, 위치, 이들의 일부 조합 등)에서 취해진 콘텐츠에 대해 긍정적인 반응을 갖는다는 것을 나타낼 수 있다. 일부 실시예들에서, 관찰자 프로파일은 관찰자의 특성을 나타낼 수 있다. 예를 들어, 관찰자는 대학교 로고를 표시하는 스웨트셔츠를 입고 있다. 이 경우에, 관찰자 프로파일은 관찰자가 스웨트셔츠를 입고 있다는 것을 표 시할 수 있고, 스웨트셔츠에 있는 로고의 대학교와 관련된 홀로그래픽 콘텐츠를 선호할 수 있다. 보다 광범위하 게, 관찰자 프로파일에 표시될 수 있는 관찰자의 특성들은 예를 들어, 나이, 성별, 인종, 옷, 장소에서의 가시 위치 등을 포함할 수 있다. 일부 실시예들에서, 관찰자 프로파일은 장면의 원하는 특성과 관련하여 관찰자에 대한 선호도를 나타낼 수 있다. 예를 들어, 관찰자 프로파일은 홀로그래픽 콘텐츠를 표시할 홀로그래픽 객체 부피(예를 들어, 벽 위) 및 홀로그래픽 콘텐츠를 표시하지 않을 홀로그래픽 객체 부피(예를 들어, 그들의 머리 위)를 나타낼 수 있다. 관찰 자 프로파일은 또한 관찰자가 그들 가까이에 제공된 햅틱 인터페이스를 선호하거나, 이들을 회피하는 것을 선호 함을 나타낼 수 있다. 다른 예에서, 관찰자 프로파일은 특정 관찰자에 대한 관찰된 콘텐츠의 이력을 나타낸다. 예를 들어, 관찰자 프 로파일링 모듈은 관찰자가 시스템을 이용하여 이전에 콘텐츠를 관찰했다는 것을 결정한다. 이에 따라, LF 디스플레이 시스템은 관찰자가 시스템을 이용하여 콘텐츠를 본 이전 시간과는 상이한 홀로그래픽 콘텐츠를 디스플레이할 수 있다. 일부 실시예들에서, 데이터 저장부는 관찰자 프로파일링 모듈에 의해 생성되고, 업데이트되고, 및/또 는 유지되는 관찰자 프로파일들을 저장하는 관찰자 프로파일 저장부를 포함한다. 관찰자 프로파일은 관찰자 프 로파일링 모듈에 의해 임의의 시간에 데이터 저장부에서 업데이트될 수 있다. 예를 들어, 일 실시예에서,관찰자 프로파일 저장부는 특정 관찰자가 LF 디스플레이 시스템에 의해 제공되는 홀로그래픽 콘텐츠를 볼 때 그들의 관찰자 프로파일에 있는 특정 관찰자에 관한 정보를 수신 및 저장한다. 이 예에서, 관찰자 프로파일 링 모듈은 관찰자들을 인식할 수 있는 얼굴 인식 알고리즘을 포함하고, 관찰자들이 제시된 홀로그래픽 콘 텐츠를 바라볼 때 긍정 식별할 수 있다. 예를 들어, 관찰자가 LF 디스플레이 시스템의 타겟 영역에 진입함 에 따라, 추적 시스템은 관찰자의 이미지를 획득한다. 관찰자 프로파일링 모듈은 캡처된 이미지를 입 력하고, 얼굴 인식 알고리즘을 이용하여 관찰자의 얼굴을 식별한다. 식별된 얼굴은 프로파일 저장부 내의 관찰 자 프로파일과 연관되며, 그에 따라, 해당 관찰자에 대해 획득된 모든 입력 정보가 그들의 프로파일에 저장될 수 있다. 관찰자 프로파일링 모듈은 또한, 관찰자를 긍정적으로 식별하기 위해 카드 식별 스캐너, 음성 식별자, 무선-주파수 식별(RFID) 칩 스캐너, 바코드 스캐너 등을 이용할 수 있다. 관찰자 프로파일링 모듈이 관찰자들을 긍정 식별할 수 있기 때문에, 관찰자 프로파일링 모듈은 LF 디 스플레이 시스템에 대한 각각의 관찰자의 각각의 방문을 결정할 수 있다. 그 후, 관찰자 프로파일링 모듈 은 각각의 관찰자에 대한 관찰자 프로파일 내의 각각의 방문의 시간 및 날짜를 저장할 수 있다. 유사하게, 관찰자 프로파일링 모듈은 관찰자로부터 수신된 감각 피드백 시스템, 추적 시스템 및/또는 LF 디스플레이 어셈블리의 임의의 조합으로부터의 입력들이 발생할 때마다 그들을 저장할 수 있다. 관찰자 프 로파일 시스템은 또한 관찰자 프로파일과 함께 저장될 수 있는 컨트롤러의 다른 모듈들 또는 구성요 소들로부터 특정 관찰자에 관한 추가적인 정보를 수신할 수 있다. 그 후, 컨트롤러의 다른 구성요소들은 또한 해당 관찰자에게 제공될 후속 콘텐츠를 결정하기 위해, 저장된 관찰자 프로파일들에 액세스할 수 있다. LF 처리 엔진은, LF 디스플레이 어셈블리에 의해 실행될 때, LF 디스플레이 어셈블리로 하여금 홀로그래픽 콘텐츠를 제공하게 하는 래스터화된 포맷(\"래스터화된 데이터\")으로 4D 좌표들을 생성한다. LF 처리 엔진은 데이터 저장부로부터 래스터화된 데이터에 액세스할 수 있다. 추가적으로, LF 처리 엔진(53 0)은 벡터화된 데이터 세트로부터 래스터화된 데이터를 구성할 수 있다. 벡터화된 데이터는 이하에 설명된다. LF 처리 엔진은 또한, 홀로그래픽 객체들을 증강시키는 감각 콘텐츠를 제공하기 위해 필요한 감각 명령들 을 생성할 수 있다. 전술한 바와 같이, 감각 명령들은 LF 디스플레이 시스템에 의해 실행될 때, 햅틱 표면 들, 소리 필드들, 및 LF 디스플레이 시스템에 의해 지원되는 다른 형태의 감각 에너지를 생성할 수 있다. LF 처리 엔진은 데이터 저장부로부터의 감각 명령들에 액세스하거나, 감각 명령들을 구성하여 벡터화 된 데이터 세트를 형성할 수 있다. 종합하면, 4D 좌표들 및 감각 데이터는 홀로그래픽 및 감각 콘텐츠를 생성하 기 위해 LF 디스플레이 시스템에 의해 실행될 수 있는 디스플레이 명령들로서 홀로그래픽 데이터를 나타낸다. LF 디스플레이 시스템 내의 다양한 에너지 소스들을 통한 에너지의 흐름을 기술하는 래스터화된 데이터의 양은 매우 크다. 데이터 저장부로부터 액세스될 때 LF 디스플레이 시스템 상에 래스터화된 데이터를 디스플레이할 수 있지만, LF 디스플레이 시스템 상에서 효율적으로 전송하고 수신하며(예를 들어, 네트워 크 인터페이스를 통해), 이어서 래스터화된 데이터를 디스플레이할 수는 없다. 예를 들어, LF 디스플레이 시스템에 의한 홀로그래픽 투사를 위한 짧은 영화를 나타내는 래스터화된 데이터를 예로 들 수 있다. 이 예에서, LF 디스플레이 시스템은 수 기가비트 픽셀들을 포함하는 디스플레이를 포함하고, 래스터화된 데이 터는 디스플레이 상의 각각의 픽셀 위치에 대한 정보를 포함한다. 래스터화된 데이터의 대응하는 크기는 방대하 며(예를 들어, 영화 디스플레이 시간의 초당 수 기가바이트), 네트워크 인터페이스를 통해 상용 네트워크 상에서 효율적으로 전송되도록 관리될 수 없다. 효율적인 전송의 문제는 홀로그래픽 콘텐츠의 라이브 스트리밍 을 포함하는 응용들에서 증폭될 수 있다. 데이터 저장부 상에 래스터화된 데이터를 단지 저장하는 추가적 인 문제점은, 감각 피드백 시스템 또는 추적 모듈로부터의 입력들을 이용하여 반응형 경험이 요구될 때 발생한다. 반응형 경험을 가능하게 하기 위해, LF 처리 엔진에 의해 생성된 라이트필드 콘텐츠는 감각 또는 추적 입력에 응답하여 실시간으로 변경될 수 있다. 즉, 일부 경우에, LF 콘텐츠는 단순히 데이터 저장부 로부터 판독되지 못할 수 있다. 따라서, 일부 구성들에서, LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 나타내 는 데이터는 벡터화된 데이터 포맷(\"벡터화된 데이터\")으로 LF 처리 엔진에 전송될 수 있다. 벡터화된 데 이터는 래스터화된 데이터보다 여러 배(order)만큼 더 작을 수 있다. 또한, 벡터화된 데이터는 데이터의 효율적 인 공유를 가능하게 하는 데이터 세트 크기를 가지면서 높은 이미지 품질을 제공한다. 예를 들어, 벡터화된 데 이터는 보다 밀도 높은 데이터 세트로부터 도출된 희소 데이터 세트일 수 있다. 따라서, 벡터화된 데이터는, 조 밀한 래스터화된 데이터로부터 얼마나 희소한 벡터화된 데이터가 샘플링되는지에 기초하여, 이미지 품질과 데이 터 전송 크기 사이에 조정 가능한 균형을 가질 수 있다. 벡터화된 데이터를 생성하기 위한 조정 가능한 샘플링 은 주어진 네트워크 속도에 대한 이미지 품질의 최적화를 가능하게 한다. 결과적으로, 벡터화된 데이터는 네트워크 인터페이스를 통해 홀로그래픽 콘텐츠의 효율적인 전송을 가능하게 한다. 벡터화된 데이터는 또한 홀 로그래픽 콘텐츠가 상용 네트워크를 통해 라이브 스트리밍될 수 있게 한다."}
{"patent_id": "10-2022-7008439", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "요약하면, LF 처리 엔진은 데이터 저장부로부터 액세스된 래스터화된 데이터, 데이터 저장부로 부터 액세스된 벡터화된 데이터, 또는 네트워크 인터페이스를 통해 수신된 벡터화된 데이터로부터 도출된 홀로그래픽 콘텐츠를 생성할 수 있다. 다양한 구성들에서, 벡터화된 데이터는 데이터 전송 전에 인코딩될 수 있 고, LF 컨트롤러에 의한 수신 후에 디코딩될 수 있다. 일부 예들에서, 벡터화된 데이터는 데이터 압축과 관련된 추가된 데이터 보안 및 성능 향상을 위해 인코딩된다. 예를 들어, 네트워크 인터페이스에 의해 수신된 벡터화된 데이터는 홀로그래픽 스트리밍 애플리케이션으로부터 수신된 인코딩된 벡터화된 데이터일 수 있다. 일 부 예들에서, 벡터화된 데이터 내의 인코딩된 정보 콘텐츠에 액세스하기 위해, 벡터화된 데이터는 디코더, LF 처리 엔진, 또는 이들 모두를 필요로 할 수 있다. 인코더 및/또는 디코더 시스템들은 고객들에게 이용 가 능하거나 제3자 벤더들에게 라이센스 부여될 수 있다. 벡터화된 데이터는, 대화형 경험을 지원할 수 있는 방식으로 LF 디스플레이 시스템에 의해 지원되는 각각 의 감각 도메인에 대한 모든 정보를 포함한다. 예를 들어, 대화형 홀로그래픽 경험에 대한 벡터화된 데이터는 LF 디스플레이 시스템에 의해 지원되는 각각의 감각 도메인에 대한 정확한 물리적 특성을 제공할 수 있는 임의의 벡터화된 속성들을 포함할 수 있다. 벡터화된 속성들은 합성적으로 프로그램되고, 캡처되며, 컴퓨터로 평가되는 등일 수 있는 임의의 속성들을 포함할 수 있다. LF 처리 엔진은 벡터화된 데이터 내의 벡터화된 속성들을 래스터화된 데이터로 변환하도록 구성될 수 있다. 그 후, LF 처리 엔진은 LF 디스플레이 어셈블 리를 사용하여, 벡터화된 데이터로부터 변환된 홀로그래픽 콘텐츠를 투사할 수 있다. 다양한 구성들에서, 벡터화된 속성들은 하나 이상의 적색/녹색/청색/알파 채널(RGBA) + 깊이 이미지, 하나의 고해상도 중심 이미지 및 더 낮은 해상도의 다른 뷰들을 포함할 수 있는 다양한 해상도에서 깊이 정보를 갖거나 갖지 않는 다중 뷰 이 미지들, 알베도 및 반사도와 같은 재료 특성, 표면 법선, 다른 광학적 효과, 표면 식별, 기하학적 객체 좌표, 가상 카메라 좌표, 디스플레이 평면 위치, 조명 좌표, 표면에 대한 촉각적 강성(stiffness), 촉각적 연성, 촉각 적 강도, 소리 필드의 진폭 및 좌표, 환경 조건, 텍스처에 대한 기계 수용체와 관련된 체성감각 에너지 벡터, 또는 온도, 청각 및 임의의 다른 감각 도메인 속성을 포함할 수 있다. 많은 다른 벡터화된 속성들이 또한 가능 하다. LF 디스플레이 시스템은 또한 대화형 관찰 경험을 생성할 수 있다. 즉, 홀로그래픽 콘텐츠는 관찰자 위치, 제스처, 상호작용, 홀로그래픽 콘텐츠와의 상호작용, 또는 관찰자 프로파일링 모듈 및/또는 추적 모듈 로부터 도출된 다른 정보를 포함하는 입력 자극에 응답할 수 있다. 예를 들어, 일 실시예에서, LF 처리 시 스템은 네트워크 인터페이스를 통해 수신된 실시간 성능의 벡터화된 데이터를 이용하여 반응형 가시 경험을 생성한다. 다른 예에서, 홀로그래픽 객체가 관찰자 상호작용에 응답하여 즉시 특정 방향으로 이동할 필 요가 있는 경우, LF 처리 엔진은 장면의 렌더링을 업데이트하여 홀로그래픽 객체가 그 요구된 방향으로 이 동하게 할 수 있다. 이는, LF 처리 엔진으로 하여금 벡터화된 데이터 세트를 사용하여, 적절한 객체 배치 및 이동, 충돌 검출, 폐색(occlusion), 색상, 음영, 조명 등으로 관찰자 상호작용에 정확하게 응답하여, 3D 그 래픽 장면에 기초한 실시간으로 라이트필드들을 렌더링하는 것을 필요로 할 수 있다. LF 처리 엔진은 벡터 화된 데이터를 LF 디스플레이 어셈블리에 의한 표시를 위해 래스터화된 데이터로 변환한다. 래스터화된 데이터는 실시간 성능을 나타내는 홀로그래픽 콘텐츠 명령들 및 감각 명령들(디스플레이 명령들)을 포함한다. LF 디스플레이 어셈블리는 디스플레이 명령들을 실행함으로써 실시간 공연의 홀로그래픽 및 감 각 콘텐츠를 동시에 투사한다. LF 디스플레이 시스템은 추적 모듈 및 관찰자 프로파일링 모듈을 이용하여 제공된 실시간 성능으로 관찰자 상호작용(예를 들어, 음성 응답, 터치 등)을 모니터링한다. 관찰자 상 호작용에 응답하여, LF 처리 엔진은 관찰자들에게 디스플레이하기 위해 추가적인 홀로그래픽 콘텐츠 및/또는 감 각 콘텐츠를 생성함으로써 대화형 경험을 생성한다. 설명을 위해, 천장으로부터 떨어지는 풍선들을 나타내는 복수의 홀로그래픽 객체들을 생성하는, LF 처리 엔진 을 포함하는 LF 디스플레이 시스템의 예시적인 실시예를 고려한다. 관찰자는 풍선을 나타내는 홀로그 래픽 객체를 터치하기 위해 이동할 수 있다. 이에 대응하여, 추적 시스템은 홀로그래픽 객체에 대한 관찰 자의 손의 움직임을 추적한다. 관찰자의 움직임은 추적 시스템에 의해 기록되고 컨트롤러로 전송된다. 추적 모듈은 관찰자의 손의 움직임을 연속적으로 판단하고 판단된 움직임들을 LF 처리 엔진 에 전송한다. LF 처리 엔진은 장면 내의 관찰자의 손의 배치를 결정하고, 홀로그래픽 객체의 임의의 필요한 변화(위치, 색, 또는 폐색)를 포함하도록 그래픽의 실시간 렌더링을 조절한다. LF 처리 엔진은 (예 를 들어, 초음파 스피커를 사용하여) 부피 햅틱 투사 시스템을 사용하여 촉각 표면을 생성하도록 LF 디스플레이어셈블리(및/또는 감각 피드백 시스템)에 지시한다. 생성된 촉각 표면은 홀로그래픽 객체의 적어도 일부에 대응하고, 홀로그래픽 객체의 외부 표면의 일부 또는 전부와 실질적으로 동일한 공간을 점유한다. LF 처 리 엔진은 추적 정보를 사용하여, 관찰자가 풍선을 터치하는 시각적 및 촉각적 감각 모두를 인지하도록, 렌더링된 홀로그래픽 객체의 위치와 함께 촉각 표면의 위치를 이동시키도록 LF 디스플레이 어셈블리에 동 적으로 명령한다. 보다 단순하게, 관찰자가 자신의 손이 홀로그래픽 풍선을 터치하는 것을 볼 때, 관찰자는 그 들의 손이 홀로그래픽 풍선을 터치하는 것을 나타내는 햅틱 피드백을 느끼고, 동시에 풍선은 터치에 응답하여 위치 또는 움직임을 변경한다. 일부 예들에서, 데이터 저장부로부터 액세스되는 콘텐츠 내의 반응형 풍선 을 제공하는 것이 아니라, 반응형 풍선은 네트워크 인터페이스를 통해 라이브 스트리밍 애플리케이션으로 부터 수신된 홀로그래픽 콘텐츠의 일부로서 수신될 수 있다. 홀로그래픽 콘텐츠 트랙 내의 홀로그래픽 콘텐츠는 홀로그래픽 콘텐츠를 디스플레이하기 위해 임의의 개수의 시 간적, 청각적, 시각적 등의 신호들과 연관될 수 있다. 예를 들어, 홀로그래픽 콘텐츠 트랙은 콘텐츠 내의 특정 시간에 디스플레이될 홀로그래픽 콘텐츠를 포함할 수 있다. 다른 예에서, 홀로그래픽 콘텐츠 트랙은 감각 피드 백 시스템이 특정 오디오 신호를 기록할 때 제공될 홀로그래픽 콘텐츠를 포함한다. 다른 예에서, 홀로그래 픽 콘텐츠 트랙은 추적 시스템이 특정 시각적 신호를 기록할 때 디스플레이할 홀로그래픽 콘텐츠를 포함한 다. 청각 및 시각적 신호를 결정하는 것은 아래에 더 상세히 설명된다. 홀로그래픽 콘텐츠 트랙은 또한 공간 렌더링 정보를 포함할 수 있다. 즉, 홀로그래픽 콘텐츠 트랙은 홀로그래픽 콘텐츠를 제공하기 위한 공간적 위치를 나타낼 수 있다. 예를 들어, 홀로그래픽 콘텐츠 추적은 특정 홀로그래픽 콘텐츠가 다른 것들이 아닌 몇몇 홀로그래픽 가시 부피에 제공되어야 한다는 것을 나타낼 수 있다. 유사하게, 홀로그래픽 콘텐츠 트랙은 다른 것들에는 제공되지 않는 일부 가시 부피들에 제공되는 홀로그래픽 콘텐츠를 나 타낼 수 있다. LF 처리 엔진은 또한 홀로그래픽 콘텐츠를 제공하고 있는 장소 또는 위치에 맞게 홀로그래픽 콘텐츠를 변 경할 수 있다. 예를 들어, 모든 위치들이 동일한 크기인 것은 아니거나, 동일한 레이아웃이지는 않거나, 동일한 기술적 사양을 갖지는 않는다. 따라서, LF 처리 엔진은 특정 위치에 적절히 디스플레이될 수 있도록 홀로 그래픽 콘텐츠를 변경할 수 있다. 일 실시예에서, LF 처리 엔진은 레이아웃, 해상도, 시야, 다른 기술적 사양 등을 포함하는, 특정 위치의 구성 파일에 액세스할 수 있다. LF 처리 엔진은 구성 파일에 포함된 정 보에 기초하여 홀로그래픽 콘텐츠를 렌더링 및 제공할 수 있다. LF 처리 엔진은 또한, LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성 할 수 있다. 여기서 중요한 것은, 디스플레이를 위한 홀로그래픽 콘텐츠를 생성하는 것이 디스플레이를 위한 홀 로그래픽 콘텐츠에 액세스하거나, 수신하는 것과는 다르다는 것이다. 즉, 콘텐츠를 생성할 때, LF 처리 엔진 은 이전에 생성된 및/또는 수신된 콘텐츠에 액세스하는 것과 달리, 디스플레이를 위해 완전히 새로운 콘텐 츠를 생성한다. LF 처리 엔진은 추적 시스템, 감각 피드백 시스템, 관찰자 프로파일링 모듈 , 추적 모듈, 또는 이들의 일부 조합으로부터의 정보를 이용하여, 디스플레이를 위한 홀로그래픽 콘 텐츠를 생성할 수 있다. 일부 예들에서, LF 처리 엔진은 LF 디스플레이 시스템의 구성요소들(예를 들 어, 추적 정보 및/또는 관찰자 프로파일)로부터 정보를 액세스하고, 그 정보에 기초하여 홀로그래픽 콘텐츠를 생성하며, LF 디스플레이 시스템을 사용하여 생성된 홀로그래픽 콘텐츠를 응답으로서 디스플레이할 수 있 다. 생성된 홀로그래픽 콘텐츠는 LF 디스플레이 시스템에 의해 디스플레이될 때 다른 감각 콘텐츠(예를 들 어, 터치, 오디오 또는 냄새)로 증강될 수 있다. 또한, LF 디스플레이 시스템은 나중에 디스플레이될 수 있도록, 생성된 홀로그래픽 콘텐츠를 저장할 수 있다. 추가적으로, LF 처리 엔진은, 예를 들어, 관리자, 관찰자, 또는 둘 모두로부터 수신된 동작 요청에 응답하 여 애플리케이션 내에서 동작을 수행할 수 있다. 일부 실시예들에서, 동작 요청은 타겟 영역 내의 관찰자에 의 해 제공되는 구두 명령일 수 있다. 구두 명령은 음향 장치를 사용하여 검출될 수 있다. 예를 들어, 관찰자는 하 나 이상의 구두 명령(예를 들어, 일시정지, 또는 일시정지 해제)을 사용하여 LF 디스플레이 시스템에 의해 제공되는 콘텐츠를 일시정지 및/또는 일시정지 해제할 수 있다. 일부 실시예들에서, 동작 요청은 타겟 영역 내 의 관찰자에 의해 제공되는 신체 움직임일 수 있다. 신체 움직임은 추적 시스템에 의해 기록될 수 있다. 예를 들어, 관찰자는 특정 동작을 수행하고 다양한 서비스를 제공하기 위해 홀로그래픽 성인 공연자와 대화할 수 있다. 이들은, 홀로그래픽 공연자에 의해 수행될 콘텐츠 기반 동작들 또는 요청들이거나, 예를 들어 조명을 흐리게 하거나, 풍경을 변화시키거나, 또는 심지어 스낵이나 음료를 요청하는, 물리적으로 기반한 동작들 또는 요청들일 수 있다.일부 실시예들에서, 하나 이상의 감각 장치들은, LF 처리 엔진에 의해 실행되는 애플리케이션들과 함께 관 찰자에 의해 사용된다. 이러한 감각 장치는 개인용 마사지기, 삽입 장치, 돌출 장치, 애니매트로닉 (animatronic) 물체, 로봇, 및 인간의 성적 쾌락을 촉진하기 위해 사용되는 임의의 다른 물체를 포함한다. 하나 이상의 감각 장치들이 LF 디스플레이 시스템과는 독립적으로 작동될 수 있지만, 일부 실시예들에서, 하나 이상의 감각 장치들은 LF 처리 엔진에 의해 제공되는 홀로그래픽 콘텐츠와 함께 동작한다. 일 실시예에서, 하나 이상의 감각 장치들은 LF 처리 엔진에 의해 실행되는 애플리케이션에 따라 동작하기 위해 LF 처리 엔 진으로부터 동작 명령들을 수신할 수 있다. 또 다른 실시예에서, 하나 이상의 LF 디스플레이 모듈들은 감 각 시뮬레이션 장치의 외관을 증강하기 위해 하나 이상의 감각 장치들 내에 또는 그 위에 통합될 수 있으며, 또 는 LF 디스플레이 시스템은 환경 내의 감각 시뮬레이션 장치의 위치를 추적할 수 있고, 하나 이상의 디스 플레이 모듈들로 하여금 감각 시뮬레이션 장치의 외관을 증강하게 할 수 있다. LF 디스플레이 시스템을 위한 동적 콘텐츠 생성 일부 실시예들에서, LF 처리 엔진은 LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성하기 위해 인공지능(artificial intelligence, AI) 모델을 포함한다. AI 모델은 회귀 모델, 신경 망, 분류기, 또는 임의의 다른 AI 알고리즘을 포함하지만 이에 제한되지 않는, 지도 또는 비-지도 학습 알고리 즘을 포함할 수 있다. AI 모델은, 관찰자의 행동에 대한 정보를 포함할 수 있는, LF 디스플레이 시스템에 의해(예를 들어, 추적 시스템에 의해) 기록된 관찰자 정보에 기초하여 관찰자 선호도를 결정하는 데에 사 용될 수 있다. AI 모델은 홀로그래픽 콘텐츠를 생성하기 위해 데이터 저장부로부터의 정보에 액세스할 수 있다. 예를 들 어, AI 모델은 데이터 저장부 내의 관찰자 프로파일 또는 프로파일들로부터 관찰자 정보에 액세스할 수 있 거나, 또는 LF 디스플레이 시스템의 다양한 구성요소들로부터 관찰자 정보를 수신할 수 있다. 설명을 위해, AI 모델은 관찰자가, 콘텐츠 내의 배우 또는 모델이 나비넥타이를 착용한 홀로그래픽 콘텐츠를 관찰하는 것을 즐기는 것으로 결정할 수 있다. AI 모델은 앞서 관람한 나비 넥타이를 착용한 배우를 포함한 홀로그래픽 콘텐츠에 대한 관찰자의 긍정 반응 또는 반응들의 그룹에 기초하여 선호도를 결정할 수 있다. 즉, AI 모델은 그 러한 관찰자들의 학습된 선호도들에 따라 일 세트의 관찰자들에게 맞춘 개인화된 홀로그래픽 콘텐츠를 생성할 수 있다. 따라서, 예를 들어, AI 모델은 LF 디스플레이 시스템을 사용하여 관찰자들의 그룹에 의해 관람되 는 홀로그래픽 콘텐츠에 디스플레이되는 배우들을 위한 나비 넥타이들을 생성할 수 있다. AI 모델은 또한, 데이 터 저장부의 관찰자 프로파일 저장부 내의 각각의 관찰자의 학습된 선호도들을 저장할 수 있다. 일부 예들 에서, AI 모델은 관찰자들의 그룹이 아니라 개별 관찰자에 대한 홀로그래픽 콘텐츠를 생성할 수 있다. 관찰자들의 특성들을 식별하고, 반응을 식별하며, 및/또는 식별된 정보에 기초하여 홀로그래픽 콘텐츠를 생성하 는 데에 사용될 수 있는 AI 모델의 일 예는 노드 계층들을 갖는 콘볼루션(convolutional) 신경망 모델이며, 여 기서 현재 층의 노드들에서의 값들은 이전 층의 노드들에서의 값들의 변환이다. 모델의 변환은 현재 계층과 이 전 계층을 연결하는 가중치 및 파라미터 세트를 통해 결정된다. 예를 들어, AI 모델은 5개 층의 노드들, 즉, A, B, C, D, 및 E층들을 포함할 수 있다. A층으로부터 B층으로의 변환은 함수(W1)에 의해 주어지고, B층으로부터 C 층으로의 변환은 W2에 의해 주어지며, C층으로부터 D층으로의 변환은 W3에 의해 주어지고, D층으로부터 E층으로 의 변환은 W4에 의해 주어진다. 일부 예들에서, 변환은 또한, 모델의 이전 계층들 사이에서 변환하는 데 사용된 가중치들 및 파라미터들의 세트를 통해 결정될 수 있다. 예를 들어, D층으로부터 E층으로의 변환 W4는 A층으로부 터 B층으로의 변환 W1을 달성하기 위해 사용되는 파라미터들에 기초할 수 있다. 모델에 대한 입력은 콘볼루션 층(A) 상에 인코딩되는 시스템 추적에 의해 얻어진 이미지일 수 있고, 모델 의 출력은 출력 층(E)으로부터 디코딩되는 홀로그래픽 콘텐츠이다. 대안적으로 또는 추가적으로, 출력은 이미지 내의 관찰자의 결정된 특성일 수 있다. 이 예에서, AI 모델은 식별 계층(C) 내의 관찰자 특성을 나타내는 이미 지 내의 잠재 정보를 식별한다. AI 모델은 이미지 내의 임의의 특성, 동작, 반응 등을 식별하기 위해 콘볼루션 층(A)의 차원을 식별 층(C)의 차원으로 감소시킨다. 일부 예들에서, AI 모델은 그 다음에 홀로그래픽 콘텐츠를 생성하기 위해 식별 층(C)의 차원을 증가시킨다. 추적 시스템으로부터의 이미지는 콘볼루션 층(A)으로 인코딩된다. 콘볼루션 층(A) 내의 이미지들은 식별 층(C) 내의 다양한 특성들 및/또는 반응 정보 등과 관련될 수 있다. 이러한 요소들 간의 관련성 정보는 대응하 는 계층들 간에 일 세트의 변환들을 적용하여 인출될 수 있다. 즉, AI 모델의 콘볼루션 층(A)은 인코딩된 이미 지를 나타내고, 모델의 식별 층(C)은 미소짓는 관찰자를 나타낸다. 주어진 이미지 내의 미소짓는 관찰자들은,컨볼루션 층(A)의 공간에서 이미지의 픽셀 값들에 변환들(W1 및 W2)을 적용함으로써 식별될 수 있다. 변환들을 위한 가중치들 및 파라미터들은 이미지에 포함된 정보와, 미소짓는 관찰자의 식별 사이의 관계를 나타낼 수 있 다. 예를 들어, 가중치들 및 파라미터들은 이미지 내의 미소짓는 관찰자를 나타내는 정보에 포함된 형상, 색상, 크기 등의 양자화(quantization)일 수 있다. 가중치들 및 파라미터들은 이력 데이터(예를 들어, 이전에 추적된 관찰자들)에 기초할 수 있다. 이미지 내의 미소짓는 관찰자들은 식별 층(C)에서 식별된다. 식별 층(C)은 이미지 내의 미소짓는 관찰자들에 대 한 잠재적인 정보에 기초하여 미소짓는 관찰자들을 식별한다. 이미지 내의 미소짓는 관찰자들을 식별하는 것은 홀로그래픽 콘텐츠를 생성하는 데에 사용될 수 있다. 홀로그래 픽 콘텐츠를 생성하기 위해, AI 모델은 식별 층(C)에서 시작하고, 식별 층(C) 내의 주어진 식별된 미소짓는 관 찰자들의 값에 변환들(W2 및 W3)을 적용한다. 변환들로 인해 출력 층(E)에서의 노드들의 세트가 생성된다. 변환 들에 대한 가중치들 및 파라미터들은 식별된 미소짓는 관찰자들 및 특정 홀로그래픽 콘텐츠 및/또는 선호도들 사이의 관계들을 나타낼 수 있다. 일부 경우에, 홀로그래픽 콘텐츠는 출력 층(E)의 노드들로부터 직접 출력되는 반면, 다른 경우에, 콘텐츠 생성 시스템은 출력 층(E)의 노드들을 홀로그래픽 콘텐츠로 디코딩한다. 예를 들어, 출력이 식별된 특성들의 세트이면, LF 처리 엔진은 그 특성들을 이용하여 홀로그래픽 콘텐츠를 생성할 수 있다. 추가적으로, AI 모델은 중간 층들로 알려진 층들을 포함할 수 있다. 중간 층들은 이미지, 특성/반응의 식별 등, 또는 홀로그래픽 콘텐츠의 생성에 대응하지 않는 층들이다. 예를 들어, 주어진 예에서, B층은 콘볼루션 층(A)과 식별 층(C) 사이의 중간 층이다. D층은 식별 층(C)과 출력 층(E) 사이의 중간 층이다. 은닉 층들은, 데이터에서 관찰되지는 않지만 특성들을 식별하고 홀로그래픽 콘텐츠를 생성할 때 이미지의 구성요소들 사이의 관계들을 지 배할 수 있는 상이한 식별의 측면들에 대한 잠재적인 표현들이다. 예를 들어, 은닉 층 내의 노드는 \"미소 짓고 웃는 사람들\"의 공통점을 공유하는 입력 값들 및 식별 값들에 대해 강한 연결들(예를 들어, 큰 가중치 값들)을 가질 수 있다. 다른 예로서, 은닉 층 내의 다른 노드는 \"소리지르고 겁먹은 사람들\"의 공통점을 공유하는 입력 값들 및 식별 값들에 대해 강한 연결들을 가질 수 있다. 물론, 신경망에는 임의의 수의 연결이 존재한다. 추가 적으로, 각각의 중간 층은, 예를 들어, 잔여 블록들, 콘볼루션 층들, 풀링 동작들, 연결들 건너뛰기, 뒤에 이어 붙이기(concatenation) 등과 같은 기능들의 조합이다. 임의의 수의 중간 층들(B)이 식별 층에 대한 콘볼루션 층 의 연결을 감소시키는 기능을 할 수 있고, 임의의 수의 중간 층들(D)이 출력 층에 대한 식별 층의 연결을 증가 시키는 기능을 할 수 있다. 일 실시예에서, AI 모델은 강화 학습으로 훈련된 결정론적 방법들을 포함한다(따라서, 강화 학습 모델을 생성한 다). 모델은 입력들로서 추적 시스템으로부터의 측정들 및 출력들로서 생성된 홀로그래픽 콘텐츠에 대한 변화들을 사용하여 성능의 품질을 증가시키도록 훈련된다. 강화 학습은 기계가 수치적 보상 신호를 최대화하기 위해 '무엇을 할 것인가'(상황을 동작에 어떻게 매핑하는지)를 학습하는 머신러닝 시스템이다. 학습자(예를 들어, LF 처리 엔진)는 어떤 동작(예를 들어, 기술된 홀로그래픽 콘텐츠를 생성)을 취하도록 지시되지 않고, 대신에 동작들을 시도하여 어떤 동작들이 가장 많은 보상을 산출하는지를 발견(예를 들어, 더 많은 사람들을 응원함으로써 홀로그래픽 콘텐츠의 품질을 증가시 킴)한다. 일부 경우에, 동작들은 즉각적인 보상뿐만 아니라 그 다음 상황에도 영향을 미칠 수 있으며, 그 결과, 모든 후속 보상들에 영향을 줄 수 있다. 이러한 두 가지 특성(시행착오 검색 및 지연된 보상)은 강화 학습의 2 개의 주된 특징들이다. 강화 학습은 학습 방법을 특징짓는 것이 아니라 학습 문제를 특징 지음으로써 정의된다. 기본적으로, 강화 학습 시스템은 목표를 달성하기 위해 그 환경과 상호작용하는 학습 에이전트가 직면하는 문제의 중요한 측면들을 포 착한다. 즉, 공연자를 위한 노래를 생성하는 예에서, 강화 학습 시스템은 장소 내의 관찰자들에 대한 정보(예를 들어, 나이, 성향 등)를 캡처한다. 이러한 에이전트는 환경의 상태를 감지하고, 목표 또는 목표들을 달성하기 위해 상태에 영향을 주는(예를 들어, 관찰자들이 환호하는 팝송을 생성하는) 동작을 취한다. 가장 기본적인 형 태에서, 강화 학습의 공식은 학습자에 대한 세 가지 측면들, 즉, 감지, 동작, 목표를 포함한다. 노래의 예를 계 속하면, LF 처리 엔진은 추적 시스템의 센서들을 이용하여 환경의 상태를 감지하고, 환경 내의 관찰 자들에게 홀로그래픽 콘텐츠를 디스플레이하며, 그 노래에 대한 관찰자들의 인지의 척도인 목표를 달성한다. 강화 학습에서 발생하는 과제들 중 하나는 탐색(exploration)과 이용(exploitation) 간의 트레이드오프이다. 시 스템에서 보상을 증가시키기 위해, 강화 학습 에이전트는 과거에 시도했고 보상을 생산하는 데에 효과적인 것으 로 밝혀졌던 동작들을 선호한다. 그러나 보상을 생성하는 동작들을 발견하기 위해 학습 에이전트는 이전에 선택하지 않은 동작들을 선택한다. 에이전트는 보상을 획득하기 위해 이미 알고 있는 정보를 '이용'하지만, 미래에 더 나은 동작 선택들을 하기 위해서 정보를 '탐색' 한다. 학습 에이전트는 다양한 동작들을 시도하고, 새 동작 들을 시도하는 동안 최상으로 보이는 것을 점진적으로 선호한다. 확률적 태스크에서, 각각의 동작은 일반적으로, 예상되는 보상에 대한 신뢰할 수 있는 추정을 얻기 위해 여러 번 시도된다. 예를 들어, LF 처리 엔 진이, 긴 시간 주기 후에 관찰자로 하여금 웃게 만드는 효과를 유도하는, LF 처리 엔진이 알고 있는 홀로그래픽 콘텐츠를 생성하는 경우, LF 처리 엔진은 관찰자가 웃을 때까지의 시간이 감소하도록 홀로그래픽 콘텐츠를 변경 할 수 있다. 또한, 강화 학습은 불확실한 환경과 상호작용하는 목표 지향적 에이전트의 전체 문제를 고려한다. 강화 학습 에 이전트는 명확한 목표를 갖고 있으며, 자신들의 환경의 측면들을 감지할 수 있고, 높은 보상(즉, 환호하는 군중)을 받을 수 있는 동작들을 선택할 수 있다. 또한, 에이전트들은 일반적으로 이들이 마주하는 환경에 대한 상당한 불확실성에도 불구하고 동작한다. 강화 학습이 계획을 포함하는 경우, 시스템은 환경 요소들이 어떻게 획득되고 개선되는지에 대한 질문뿐만 아니라, 계획 및 실시간 동작 선택 간의 상호작용을 해결한다. 강화 학습 이 진행되도록 하려면, 중요한 하위 문제들을 분리하고 연구해야 하는데, 하위 문제들은 완벽한 반응형의 목표 를 추구하는 에이전트에서 명확한 역할을 수행한다. 강화 학습 문제는 상호작용들이 처리되고 목표를 달성하기 위해 동작들이 수행되는 머신러닝 문제의 프레임을 작성하는 것이다. 학습자 및 의사 결정자는 에이전트(예를 들어, LF 처리 엔진)로 불린다. 에이전트 외부 의 모든 것을 포함하여 상호작용하는 것은 환경(예를 들어, 장소 내의 관찰자 등)이라고 불린다. 이들 둘은 연 속적으로 상호작용하며, 에이전트는 동작들(예를 들어, 홀로그래픽 콘텐츠를 생성)을 선택하고, 환경은 이러한 동작들에 응답하여 에이전트에게 새로운 상황들을 제공한다. 환경은 또한, 에이전트가 시간 경과에 따라 최대화 하려고 시도하는 특별한 숫자 값인 보상을 제공한다. 특정 상황에서, 보상은 홀로그래픽 콘텐츠에 대한 관찰자 의 긍정적인 반응을 최대화하도록 작용한다. 환경의 전부피인 사양은 강화 학습 문제점의 한 인스턴스인 태스크 를 정의한다. 더 많은 컨텍스트를 제공하기 위해, 에이전트(예를 들어, 콘텐츠 생성 시스템) 및 환경은 이산적인 시간 단계들의 시퀀스, 즉 t =0, 1, 2, 3 등의 각각에서 상호작용한다. 각각의 시간 단계 t에서, 에이전트는 환경의 상태 st의 일부 표현(예를 들어, 추적 시스템으로부터의 측정치들)을 수신한다. 상태들 st는 S 내에 있고, 여기서 S는 가능한 상태들의 세트이다. 상태 st 및 시간 단계 t에 기초하여, 에이전트는 (예를 들어, 공연자가 다리찢기를 하도록 하는) 동작을 선택한다. 동작은 A(st) 내에 있으며, 여기서 A(st)는 가능한 동작들의 세트이 다. 하나의 시간 상태 후에, 자신의 동작의 결과로서 부분적으로, 에이전트는 수치적 보상 rt+1을 수신한다. 상 태 rt+1은 R 내에 있으며, 여기서 R은 가능한 보상들의 집합이다. 에이전트가 보상을 수신하면, 에이전트는 새로 운 상태 st+1에서 선택한다. 각각의 시간 단계에서, 에이전트는 상태들로부터 각각의 가능한 동작을 선택하는 확률들로의 매핑을 구현한다. 이 매핑은 에이전트의 정책이라고 부르며, πt로 표시되는데, 여기서 πt(s, a)는 st = s인 경우에 at = a일 확 률이다. 강화 학습 방법은 에이전트가 에이전트 동작들로 인해 발생한 상태들 및 보상들의 결과로서 자신의 정 책을 변경하는 방법을 지시할 수 있다. 에이전트의 목표는 시간이 경과함에 따라 수신하는 총 보상의 양을 최대 화하는 것이다. 이러한 강화 학습 프레임워크는 플렉시블하며, 여러 상이한 방식으로 많은 상이한 문제점들에 적용될 수 있다 (예를 들어 홀로그래픽 콘텐츠의 생성). 이 프레임워크는 센서, 메모리 및 제어 장치의 세부사항이 무엇이든 간 에, 목표 지향 행동을 학습하는 임의의 문제(또는 목적)가 에이전트와 그의 환경 사이를 오가는 세 개의 신호, 즉, 에이전트에 의해 행해진 선택을 나타내는 하나의 신호(동작), 선택이 이루어지는 기초를 나타내는 하나의 신호(상태), 및 에이전트의 목표를 정의하기 위한 하나의 신호(보상)로 감소될 수 있음을 제안한다. 물론, AI 모델은 임의의 개수의 머신 러닝 알고리즘을 포함할 수 있다. 사용될 수 있는 일부 다른 AI 모델들은 선형 회귀 및/또는 로지스틱 회귀, 분류 트리 및 회귀 트리, k-평균 클러스터링, 벡터 양자화 등이다. 어떤 경 우든, 일반적으로, LF 처리 엔진은 추적 모듈 및/또는 관찰자 프로파일링 모듈로부터 입력을 받 고, 머신 러닝 모델은 응답으로서 홀로그래픽 콘텐츠를 생성한다. 유사하게, AI 모델은 홀로그래픽 콘텐츠의 렌 더링을 지시할 수 있다. LF 처리 엔진은 영화에 기초하여 홀로그래픽 콘텐츠를 생성할 수 있다. 예를 들어, 영화관에서 상영되는 영화는 영화의 특성을 기술하는 메타데이터의 세트와 연관될 수 있다. 메타데이터는 예를 들어, 설정, 장르, 배 우, 여배우, 테마, 제목, 상영시간, 등급 등을 포함할 수 있다. LF 처리 엔진은 영화를 기술하는 임의의 메타데이터에 액세스할 수 있고, 그에 응답하여 해당 장소에 제공할 홀로그래픽 콘텐츠를 생성할 수 있다. 예를 들어, LF 디스플레이 시스템을 이용하여 증강된 장소에서 \"The Last Merman\"이라는 제목의 영화가 상영될 예정이다. LF 처리 엔진은 해당 장소의 벽들에 대한 홀로그래픽 콘텐츠를 생성하기 위해 영화의 메타데이 터에 액세스한다. 여기서, 메타데이터는 배경이 수중에 있고, 장르는 로맨스인 것을 포함한다. LF 처리 엔진 은 메타데이터를 AI 모델로 입력하고, 이에 반응하여 장소의 벽들 위에 디스플레이하기 위해 홀로그래픽 콘텐츠를 수신한다. 이 예에서, LF 처리 엔진은 장소의 벽들 상에 디스플레이하기 위한 해변가 일몰을 생 성한다. 일 예에서, LF 처리 엔진은 통상적인 2차원(2D) 콘텐츠를, LF 디스플레이 시스템에 의해 디스플레이하기 위한 홀로그래픽 콘텐츠로 변환할 수 있다. 예를 들어, LF 처리 엔진은 통상적인 영화 또는 다른 콘텐츠를 AI 모델에 입력할 수 있고, AI 모델은 통상적인 영화의 임의의 부분을 홀로그래픽 콘텐츠로 변환한다. 일 예에 서, AI 모델은 2차원 데이터를 홀로그래픽 데이터로 변환함으로써 훈련된 머신러닝 알고리즘을 사용하여 통상적 인 영화를 홀로그래픽 콘텐츠로 변환할 수 있다. 다양한 상황에서, 훈련 데이터는 이미 생성되었거나, 생성되거 나, 또는 이들의 일부 조합일 수 있다. 이어서, LF 디스플레이 시스템은 통상적인 2차원 버전의 영화가 아 니라, 영화와 연관된 홀로그래픽 콘텐츠를 디스플레이할 수 있다. 예를 들어, 홀로그래픽 콘텐츠는 영화의 장면 에서의 설정을 이용한 성인용 장면일 수 있다. 콘텐츠를 생성하는 이전 실시예들은 제한적이지 않다. 가장 광범위하게, LF 처리 엔진은 LF 디스플레이 시 스템의 관찰자들에게 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성한다. 홀로그래픽 콘텐츠는 LF 디스플 레이 시스템에 포함된 임의의 정보에 기초하여 생성될 수 있다. 홀로그래픽 성인용 시뮬레이션 콘텐츠 배포 네트워크 도 5b는 하나 이상의 실시예들에 따른, 성인용 시뮬레이션을 위한 라이트필드 디스플레이 시스템을 포함하는 라 이트필드 환경의 블록도이다. 도 5b에 도시된 LF 성인용 시뮬레이션 콘텐츠 배포 시스템은 하나 이상의 클 라이언트 LF 디스플레이 시스템(500A 및 500B), 네트워크, 하나 이상의 제3자 시스템, 및 온라인 시 스템을 포함한다. 대안적인 구성에서, 상이한 및/또는 추가적인 구성요소들이 LF 성인용 시뮬레이션 콘텐 츠 배포 시스템에 포함될 수 있다. 예를 들어, 온라인 시스템은 소셜 네트워킹 시스템, 콘텐츠 공유 네트워크, 또는 관찰자들에게 콘텐츠를 제공하는 다른 시스템을 포함할 수 있다. 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 홀로그래픽 콘텐츠를 디스플레이하고, 입력을 수신하며, 네트워크를 통해 데이터를 전송 및/또는 수신할 수 있다. 클라이언트 LF 디스플레이 시스템(500A 및 500 B)은 LF 디스플레이 시스템의 실시예들이다. 따라서, 각각의 클라이언트 LF 디스플레이 시스템은 네트워크 및 LF 디스플레이 어셈블리(예를 들어, LF 디스플레이 어셈블리)를 통해 홀로그래픽 콘텐츠를 수신 하도록 구성된 컨트롤러를 포함한다. LF 디스플레이 어셈블리는 가시 부피 내에 위치된 관찰자에 대한 홀로그래 픽 객체 부피 내에 성인용 시뮬레이션으로서 홀로그래픽 콘텐츠를 디스플레이하는, 하나 이상의 LF 디스플레이 모듈들(예를 들어, LF 디스플레이 모듈들)을 포함할 수 있다. 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 네트워크를 통해 통신하도록 구성된다. 일부 실시예들에서, 클라이언트 LF 디스플레이 시스템들 (500A 및 500B)은 클라이언트 LF 디스플레이 시스템의 관찰자로 하여금 온라인 시스템과 상호작용하게 하 는 애플리케이션을 실행한다. 예를 들어, 클라이언트 LF 디스플레이 시스템(500A)은 네트워크를 통해 클라 이언트 LF 디스플레이 시스템(500A)과 온라인 시스템 사이에서 상호작용할 수 있도록 브라우저 애플리케이 션을 실행한다. 다른 실시예들에서, 클라이언트 LF 디스플레이 시스템(500A)은 IOS® 또는 ANDROID™와 같은 클 라이언트 LF 디스플레이 시스템(500A)의 네이티브 운영체제 상에서 동작하는 API(application programming interface)를 통해 온라인 시스템과 상호작용한다. 효율적인 전송 속도를 위해, 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 대한 데이터는 벡터화된 데이터로서 네트워크를 통해 전송될 수 있다. 각각의 클라이언트 LF 디스플레이 시스템에서 LF 처리 엔진(예를 들어, LF 처리 엔진)은 벡터화된 데이터를 디코 딩하고, 이를 대응하는 LF 디스플레이 어셈블리(예를 들어, LF 디스플레이 어셈블리) 상에 디스플레이하기 위해 래스터화된 포맷으로 변환할 수 있다. 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 유선 및/또는 무선 통신 시스템 모두를 사용하여, 근거리 및/또는 광역 네트워크의 임의의 조합을 포함할 수 있는, 네트워크를 통해 통신하도록 구성된다. 일부 실 시예들에서, 네트워크는 표준 통신 기술들 및/또는 프로토콜들을 사용한다. 예를 들어, 네트워크는이더넷, 802.11, WiMAX(worldwide interoperability for microwave access), 3G, 4G, 코드 분할 다중 접속 (CDMA), 디지털 가입자 회선(DSL) 등과 같은 기술들을 사용하는 통신 링크들을 포함한다. 네트워크를 통해 통신하기 위해 사용되는 네트워킹 프로토콜들의 예들은 다중프로토콜 라벨 스위칭(MPLS), 전송 제어 프로토콜/ 인터넷 프로토콜(TCP/IP), 하이퍼텍스트 전송 프로토콜(HTTP), 간단한 메일 전송 프로토콜(SMTP), 및 파일 전송 프로토콜(FTP)을 포함한다. 네트워크를 통해 교환된 데이터는 HTML(hypertext markup language) 또는 XML(extensible markup language)과 같은 임의의 적합한 포맷을 사용하여 표현될 수 있다. 일부 실시예들에서, 네트워크의 통신 링크들 모두 또는 일부는 임의의 적절한 기술들을 사용하여 암호화될 수 있다. 하나 이상의 제3자 시스템들은 온라인 시스템과 통신하기 위해 네트워크에 연결될 수 있다. 일 부 실시예들에서, 제3자 시스템은 네트워크를 통해 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 배포될 홀로그래픽 콘텐츠를 전송하는 성인용 콘텐츠 제어 시스템, 예를 들어, 콘텐츠 제공자이다. 일 부 실시예들에서, 제3자 시스템은 또한 홀로그래픽 콘텐츠를 온라인 시스템에 전달할 수 있으며, 이 는 이어서, 홀로그래픽 콘텐츠를 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 배포할 수 있다. 각각의 제3자 시스템은 클라이언트 LF 디스플레이 시스템(500A 및 500B)에 제공하기 위해 배포될 수 있는 홀로그 래픽 콘텐츠 아이템들을 저장할 수 있는 콘텐츠 저장부를 갖는다. 제3자 시스템은 지불에 대한 대가 로 하나 이상의 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 홀로그래픽 콘텐츠를 제공할 수 있다. 일 실시예에서, 홀로그래픽 콘텐츠 아이템들은 프리젠테이션을 위해 클라이언트 LF 디스플레이 시스템(500A 및 500B)에 배포될 때 온라인 시스템에 의해 수집될 수 있는 비용과 연관될 수 있다. 온라인 시스템은 지불에 대한 대가로 홀로그래픽 콘텐츠를 클라이언트 LF 디스플레이 시스템(500A 및 500B)에 제공함으로써 홀로그래픽 콘텐츠의 배포를 중재할 수 있다. 홀로그래픽 콘텐츠는 네트워크를 통해 제공된다. 온라인 시스템은 관찰자 프로파일 저장부, 콘텐츠 저장부, 거래 모듈, 및 콘텐 츠 배포 모듈을 포함한다. 다른 실시예들에서, 온라인 시스템은 다양한 애플리케이션들에 대한 추가 적인, 더 적은, 또는 상이한 구성요소들을 포함할 수 있다. 네트워크 인터페이스, 보안 기능, 로드 밸런서, 장 애 복구 서버, 관리 및 네트워크 운영 콘솔 등과 같은 통상적인 구성요소들은 시스템 아키텍처의 세부사항을 모 호하게 하지 않게 하도록, 표시되지 않는다. 온라인 시스템의 관찰자는 관찰자 프로파일 저장부에 저장되어 있는 관찰자 프로파일과 연관될 수 있 다. 관찰자 프로파일은 관찰자에 의해 명시적으로 공유된 관찰자에 대한 선언적 정보를 포함하고, 또한 온라인 시스템에 의해 추론되는 프로파일 정보를 포함할 수 있다. 일부 실시예들에서, 관찰자 프로파일은 대응하 는 온라인 시스템 관찰자의 하나 이상의 속성들을 각각 기술하는, 다수의 데이터 필드들을 포함한다. 관찰자 프 로파일에 저장된 정보의 예들은 생물학적, 인구통계학적 정보, 및 업무 경험, 교육 이력, 성별, 취미 또는 선호 도, 위치 등과 같은 다른 유형의 설명 정보를 포함한다. 관찰자 프로파일은 또한 관찰자에 의해 제공되는 다른 정보, 예를 들어, 이미지 또는 비디오를 저장할 수 있다. 특정 실시예들에서, 관찰자들의 이미지들은 이미지 내 에 디스플레이된 온라인 시스템 관찰자들을 식별하는 정보로 태깅될 수 있고, 해당 정보는 관찰자의 관찰자 프 로파일에 저장되어 있고 관찰자가 태깅되어 있는 이미지들을 식별시킨다. 관찰자 프로파일 저장부 내의 관 찰자 프로파일은 또한 추적 시스템(예를 들어, 추적 시스템)으로 캡처되고 추적 모듈(예를 들어, 추적 모 듈)에 의해 결정되는, 관찰자의 모니터링된 반응들 또는 관찰자의 특성을 포함하여, 콘텐츠 저장부 내의 콘텐츠 아이템들에 대해 수행되는 대응하는 관찰자에 의한 동작들에 대한 참조를 유지할 수 있다. 관찰자 의 모니터링된 반응들은 가시 부피 내의 관찰자의 위치, 관찰자의 움직임, 관찰자의 제스처, 관찰자의 얼굴 표 정, 및 관찰자의 시선을 포함할 수 있다. LF 디스플레이 어셈블리는 관찰자의 모니터링된 반응에 응답하여 홀로 그래픽 콘텐츠의 프리젠테이션을 업데이트할 수 있다. 관찰자의 특성은 관찰자의 인구 통계 정보, 업무 경험, 교육 이력, 성별, 수입, 구매에 소비되는 돈, 취미, 위치, 나이, 시청 기록, 아이템에 소비된 시간, 이전에 관 찰한 아이템의 카테고리, 및 구매 이력을 포함할 수 있다. LF 디스플레이 어셈블리는 관찰자의 특성에 응답하여 홀로그래픽 콘텐츠의 프리젠테이션을 업데이트할 수 있다. 일부 실시예들에서, 관찰자 프로파일 저장부는 온라인 시스템에 의해 추론되는 관찰자의 특성 및 관찰자 정보를 저장할 수 있다. 일부 실시예들에서, 관찰자 프로파일은 제공된 정보 및/또는 관찰자 프로파일링 모듈(예를 들어, 관찰자 프로파일링 모듈)에 기록되거 나 그로부터 추론되는 정보를 포함할 수 있는, 하나 이상의 클라이언트 LF 디스플레이 시스템들에 의해 제공되 는 정보를 저장할 수 있다. 관찰자 프로파일 저장부 내의 관찰자 프로파일들은 개인들과 빈번하게 연관되어 있고, 개인들이 온라인 시 스템을 통해 서로 상호작용할 수 있게 하는 반면, 관찰자 프로파일들은 또한 기업들 또는 조직들과 같은 엔티티들을 위해 저장될 수 있다. 이는 엔티티로 하여금 다른 온라인 시스템에 접속하고 그의 관찰자들과 콘텐츠를 교환하기 위해 온라인 시스템 상에 존재를 확립할 수 있게 한다. 엔티티는 그 자신 또는 그의 제품들 에 관한 정보를 게시할 수 있거나, 엔티티의 관찰자 프로파일과 연관된 브랜드 페이지를 이용하여 다른 정보를 온라인 시스템의 관찰자들에게 제공할 수 있다. 브랜드 페이지와 연관된 관찰자 프로파일은 엔티티 자체에 대한 정보를 포함할 수 있고, 그 엔티티에 대한 배경 또는 정보 데이터를 관찰자들에게 제공한다. 일 실시예에 서, 온라인 시스템의 다른 관찰자들은 브랜드 페이지와 상호작용할 수 있다(예를 들어, 브랜드 페이지에 게시된 정보를 수신하거나 브랜드 페이지로부터 정보를 수신하기 위해 브랜드 페이지에 접속함). 관찰자 프로파 일 저장부 내의 관찰자 프로파일은 대응하는 관찰자에 의해 수행되는 상호작용들에 대한 참조를 유지할 수 있다. 위에서 설명된 바와 같이, 관찰자 프로파일에(예를 들어, 관찰자 프로파일링 모듈에) 저장된 임의의 정보는 관찰자에게 디스플레이하기 위한 홀로그래픽 콘텐츠를 생성하기 위해 머신러닝 또는 AI 모델의 입력으로 서 사용될 수 있다. 콘텐츠 저장부는 하나 이상의 클라이언트 LF 디스플레이 시스템들(500A 및 500B)의 관찰자들에게 배포될 홀로그래픽 콘텐츠와 같은 홀로그래픽 콘텐츠를 저장한다. 홀로그래픽 성인용 콘텐츠 이외에, 홀로그래픽 콘텐 츠의 예들은 광고(예를 들어, 다가오는 할인 판매 홍보, 브랜드의 홍보 등), 공지사항(예를 들어, 정치적 연설, 동기부여 연설 등), 공중 서비스 경보(예를 들어, 토네이도 경보, AMBER 경보 등), 뉴스에 관한 정보(예를 들어, 뉴스 헤드라인, 스포츠 점수 등), 날씨에 관한 정보(예를 들어, 지역 날씨 예보, 대기질 지수 등), 장소 에 관한 정보(예를 들어, 박스오피스 시간, 다가오는 쇼 스케줄 등), 교통 또는 여행 조건에 관한 정보(예를 들 어, 교통 상황 리포트, 도로 폐쇄 등), 기업 엔티티에 대한 정보(예를 들어, 사무실 디렉토리, 운영 시간 등), 공연(예를 들어, 콘서트, 연극 등), 예술적 콘텐츠(예를 들어, 조각, 세라믹 등), 임의의 다른 홀로그래픽 콘텐 츠, 또는 이들의 임의의 조합을 포함할 수 있다. 일부 실시예들에서, 온라인 시스템 관찰자들은 콘텐츠 저장부 에 의해 저장될 홀로그래픽 콘텐츠를 생성할 수 있다. 다른 실시예들에서, 홀로그래픽 콘텐츠는 온라인 시 스템과 구분되는 제3자 시스템으로부터 수신된다. 콘텐츠 저장부 내의 객체들은 콘텐츠 또는 콘 텐츠 \"아이템들\"의 단일 조각들을 나타낼 수 있다. 거래 모듈은 지불에 대한 대가로 하나 이상의 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 홀로그 래픽 콘텐츠를 제공한다. 일 실시예에서, 거래 모듈은 콘텐츠 저장부에 저장된 홀로그래픽 콘텐츠가 네트워크를 통해 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 배포되는 거래를 관리한다. 일 실시 예에서, 클라이언트 LF 디스플레이 시스템들(500A 및/또는 500B), 또는 클라이언트 LF 디스플레이 시스템들 (500A 및 500B)의 네트워크 연결된 엔티티 소유자는 특정 홀로그래픽 콘텐츠 아이템들에 대한 지불을 제공할 수 있고, 거래는 거래 모듈에 의해 관리될 수 있다. 대안적으로, 제3자 시스템은 거래 모듈에 제공 되는 거래 수수료에 대한 대가로 콘텐츠 저장부로부터 LF 디스플레이 시스템들(500A 및/또는 500B)로 콘텐 츠를 제공할 수 있다. 다른 실시예들에서, 온라인 시스템은 거래 모듈이 특정 엔티티의 계정에 과금 하는 것과 함께 또는 과금 없이 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 직접 콘텐츠를 배포할 수 있다. 일부 실시예들에서, 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 하나 이상의 관찰자 프로파일들 과 연관되고, 대응하는 관찰자 계정들에는 거래 모듈에 의해 홀로그래픽 콘텐츠 아이템들의 프리젠테이션 을 위한 비용이 과금된다. 일부 실시예들에서, 홀로그래픽 콘텐츠 아이템들은 무기한으로 구입되어 사용될 수 있거나, 특정 기간 동안 대여될 수 있다. 그 후, 거래 모듈에 의해 수집된 전체 또는 부분에서의 보수가 홀로그래픽 콘텐츠 아이템의 제공자에게 제공될 수 있다. 예를 들어, 콘텐츠 저장부로부터 성인용 홀로그 래픽 콘텐츠 아이템을 제공한 제3자 시스템은, 성인용 홀로그래픽 콘텐츠 아이템의 구매를 위해 클라이언 트 LF 디스플레이 시스템들(500A 및 500B)로부터 수집된 보수의 일 부분을 수신할 수 있다. 콘텐츠 배포 모듈은 클라이언트 LF 디스플레이 시스템들(500A 및 500B)에 홀로그래픽 콘텐츠 아이템들을 제공한다. 콘텐츠 배포 모듈은 거래 모듈로부터 클라이언트 LF 디스플레이 시스템들(500A 및/또는 500B)에 제공될 홀로그래픽 콘텐츠 아이템의 요청을 수신할 수 있다. 콘텐츠 배포 모듈은 콘텐츠 저장부 로부터 홀로그래픽 콘텐츠 아이템을 검색하고, 관찰자들에게 디스플레이하기 위해 클라이언트 LF 디스플레 이 시스템들(500A 및/또는 500B)에 홀로그래픽 콘텐츠 아이템을 제공한다. 일부 실시예들에서, 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 입력이 수신되는지 여부에 부분적으로 의존하는 홀로그래픽 콘텐츠의 프리젠테이션의 인스턴스들을 기록할 수 있다. 일 실시예에서, 클라이언트 LF 디 스플레이 시스템들(500A 및 500B)은 홀로그래픽 콘텐츠의 프리젠테이션에 응답하여 입력을 수신하도록 구성될 수 있다. 일부 실시예들에서, 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은, 관찰자가 홀로그래픽 콘텐 츠의 프리젠테이션 동안에 제공된 프롬프트에 대한 반응을 제공하는 경우, 홀로그래픽 콘텐츠의 프리젠테이션의 인스턴스를 승인(confirm)할 수 있다. 예를 들어, 클라이언트 LF 디스플레이 시스템(500A)은 홀로그래픽 콘텐츠의 프리젠테이션을 승인하기 위해 클라이언트 LF 디스플레이 시스템(500A)에 의해 사용되는 관찰자로부터의 음 성 입력을 수신한다. 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 수신된 입력들의 조합을 다른 메트릭 들(예를 들어, 추적 시스템에 의해 획득된 정보)과 함께 사용하여 홀로그래픽 콘텐츠의 프리젠테이션의 인 스턴스들을 승인할 수 있다. 다른 실시예들에서, 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 수신된 입력에 응답하여 홀로그래픽 콘텐츠의 프리젠테이션을 업데이트하도록 구성될 수 있다. 일부 구성들에서, 성인용 콘텐츠 배포 시스템 내의 클라이언트 LF 디스플레이 시스템들(500A 및 500B)은 상이한 하드웨어 구성을 가질 수 있다. 홀로그래픽 콘텐츠는 클라이언트 LF 디스플레이 시스템들(500A 및 500 B)의 하드웨어 구성에 기초하여 제공될 수 있다. 하드웨어 구성들은 해상도, 각도 당 투사되는 광선들의 수, 시 야, 디스플레이 표면 상의 편향 각도, 및 디스플레이 표면의 치수를 포함할 수 있다. 각각의 하드웨어 구성은 상이한 데이터 포맷들로 감각 데이터를 생성하거나 이용할 수 있다. 전술한 바와 같이, 모든 감각 데이터(예를 들어, 홀로그래픽, 오디오 및 촉각 데이터)를 포함하는 홀로그래픽 콘텐츠는 인코딩된 벡터화된 포맷으로서 클 라이언트 LF 디스플레이 시스템들(500A 및 500B)에 전송될 수 있다. 따라서, 각각의 클라이언트 LF 디스플레이 시스템을 위한 LF 처리 엔진(예를 들어, LF 처리 엔진)은, 클라이언트 LF 디스플레이 시스템(500A또는 500B)의 대응하는 하드웨어 구성을 고려하여, 그것이 제공될 LF 디스플레이 시스템을 위한 인코딩된 데이터를 디코딩할 수 있다. 예를 들어, 제1 클라이언트 LF 디스플레이 시스템(500A)은 제1 하드웨어 구성을 가질 수 있 고, 제2 클라이언트 LF 디스플레이 시스템(500B)은 제2 하드웨어 구성을 가질 수 있다. 제1 클라이언트 LF 디스 플레이 시스템(500A)은 제2 클라이언트 LF 디스플레이 시스템과 동일한 홀로그래픽 콘텐츠를 수신할 수 있다. 제1 및 제2 하드웨어 구성에서의 차이에도 불구하고, 각각의 LF 디스플레이 시스템(500A 및 500B)의 LF 처리 엔 진은 예를 들어, 상이한 시야로, 가능하게는 상이한 해상도로, 홀로그래픽 콘텐츠를 제공해야 한다. 성인용 엔터테인먼트를 위한 라이트필드 디스플레이 시스템 도 6은 하나 이상의 실시예들에 따른, 성인용 엔터테인먼트 장소에서 다중 측면의 이음매 없는 표면을 형 성하도록 타일링되는 LF 디스플레이 시스템의 일 부분의 사시도이다. LF 디스플레이 시스템은 LF 디 스플레이 모듈들의 어레이를 형성하도록 타일링되는 복수의 LF 디스플레이 모듈들을 포함한다. 어레 이는 예를 들어, 방의 표면(예를 들어, 하나 이상의 벽, 바닥 및/또는 천장)의 일부 또는 전부를 커버할 수 있 다. 이 예에서, 관찰자는 홀로그래픽 공연자의 형태의 홀로그래픽 콘텐츠를 보고 있다. 이 예에서, 컴퓨터 스크린 상에서 또는 가상 현실(VR: virtual reality) 헤드셋을 통해서 포르노를 보는 대신에, 관찰자 는 LF 디스플레이 모듈들의 어레이에 의해 디스플레이되는 홀로그래픽 공연자가 있는 방 안에 서 있다. 위에서 설명된 바와 같이, LF 디스플레이 시스템은 성인용 엔터테인먼트 장소에서 홀로그래픽 콘텐츠 와 상호작용할 때 각각의 관찰자들의 움직임을 기록하는 추적 시스템으로부터의 추적 정보를 이용하는 인 공지능(AI: artificial intelligence) 및 머신러닝(ML: machine learning) 모델들을 사용하여 관찰자의 경험을 사용자 맞춤화할 수 있다. 이는 다양한 센서들을 통해 추적되는 그들의 행동(예를 들어, 몸짓 언어, 얼굴 표정, 음성 톤 등)을 포함한다. 일반적으로, 추적 시스템에 의해 얻어진 관찰자들에 관한 정보는 홀로그래픽 콘텐츠에 대한 관찰자 반응, 및 홀로그래픽 콘텐츠를 관찰하는 관찰자의 특성을 포함한다. 관찰자 반응은 관찰자의 위치, 관찰자의 움직임, 관찰자의 제스처, 또는 관찰자의 얼굴 표정을 포함할 수 있다. 관찰자의 특성은 관찰자의 나 이, 관찰자의 성별, 관찰자의 선호도 등을 포함한다. 다른 실시예에서, 전술한 바와 같이, 이미지 감각 요소들 은 디스플레이 표면과 구분되는 전용 센서들(예를 들어, 카메라 및/또는 마이크)일 수 있고, 추적 시스템 의 이미지 감각 요소들은 에너지를 방출하고 흡수하는 양방향 에너지 요소들을 통해 LF 디스플레이 모듈들(61 0)의 디스플레이 표면 내에 통합될 수 있다. 이러한 실시예에서, 이미지 데이터는 환경 전체에 걸쳐 배열된 몇 몇 2D 카메라에 비해 잠재적으로 다수의 더 많은 각도로부터 캡처될 수 있다. 일부 실시예들에서, 라이트필드 이미지 데이터는 LF 디스플레이 모듈들에 의해 기록된다. LF 디스플레이 모듈들의 디스플레이 표면에 의해 캡처된 이미지 또는 라이트필드 데이터는 성인용 엔터테인먼트 환경에서 객체들 및 다른 관찰자들에 의해 차단 되지 않는 잠재적으로 모든 각도들로부터의 것일 수 있다. 따라서, 그 결과는 성인용 엔터테인먼트 장소 내의 관찰자들의 관찰된 행동에 기초하여 그들과 몰입(engage)시키는 사용자 맞춤형 AI(예를 들어, 홀로그래픽 공연자)이다. 따라서, 관찰자가 헤드셋을 통해 디스플레이되는 가상 장면을 보는 것으로 제한되는 가상 현 실(VR) 환경에서와는 달리, LF 디스플레이 시스템은 관찰자에 의해 만들어지는 훨씬 더 미묘한 단서 들 및 움직임들, 예를 들어, 그들의 몸짓 언어, 음성 톤 등에 의해, 홀로그래픽 공연자들과 같은 실제 객체들을 이용하여 훨씬 더 실감나는 센서 시스템을 통해 추적 및 응답할 수 있다. 또한, 관찰자는, VR 시스템에서 흔한 특수 아이웨어, 안경, 또는 헤드마운트 액세서리의 무게 또는 이와 관련된 불편함에 의해 방해받지않는다. 따라서, 일 실시예에서, LF 처리 엔진은 홀로그래픽 공연자를 생성하고, 추적 시스템은 관찰자 와 홀로그래픽 공연자 간의 상호작용을 위한 이미지 데이터를 획득한다. 이러한 상호작용은 그들 간 의 대화와 같은 명시적인 상호작용들일 수 있거나, 또는 상호작용은 홀로그래픽 공연자로부터의 움직임 또 는 코멘트에 반응하는 관찰자의 몸짓 언어와 같은 더 미묘한 것일 수 있다. LF 처리 엔진은 또한 AI 및/또 는 ML 모델을 이용하여 상호작용에 응답하여 공연하도록 홀로그래픽 공연자를 위한 응답을 생성한다. 다른 실시예에서, 홀로그래픽 공연자는 다른 사람의 홀로그래픽 표현일 수 있는데, 예를 들어, 관찰자 의 애인이 원격 위치로부터의 커플 세션에 참여하는 것일 수 있다. 예를 들어, 도 6의 홀로그래픽 공연자 는 관찰자가 위치하는 성인용 엔터테인먼트 장소로부터 이격된 위치에 있는 제2 관찰자의 라이 브 홀로그래픽 표현일 수 있다. 이 실시예에서, 컨트롤러는 제2 관찰자가 위치하는 위치에서 시스템의 하 나 이상의 이미지 캡처 요소들에 의해 캡처된 제2 관찰자의 이미지 데이터를 수신한다. 따라서, LF 처리 엔진 은 이 이미지 데이터를 획득하고, 관찰자에게 제공하기 위해 성인용 엔터테인먼트 장소 내의 제 2 관찰자의 라이브 홀로그래픽 표현을 생성한다. 이 예에서, 관찰자의 라이브 홀로그래픽 표현이 생성될 수 있고, 제2 관찰자에게 동시에 프리젠테이션하기 위해 제2 관찰자의 위치에서 제공될 수 있다. 이 실시예에서, 세션이 포르노일 필요는 없고, 커플은 함께 게임을 하거나, 앉아서, 물리적으로 상이한 위치들에서 함께 식사를 공유할 수 있다. 따라서, 관찰자와 제2 관찰자는 서로로부터 수백 마일 떨어져서 물리적으로 위치할 수 있고, 그들이 서로 같은 방에 있는 것처럼 서로 대화하고, 저녁 식사를 할 수 있다. 대안적으로, 도 6에 표현된 장면은 스피드 데이팅 또는 가상 연애 컨텍스트 내에서 추가적으로 사용될 수 있다. 도 6은 방의 다 수의 표면(벽, 천장, 바닥)이 LF 디스플레이 모듈들로 커버되는 장소를 도시하지만, 더 적은 표면들 또는 표면의 일부분만이 LF 디스플레이 모듈들로 커버되는 구현을 가질 수도 있다. 엔터테인먼트 장소 내의 LF 디스플레이 시스템은 전술한 바와 같이 관찰자 프로파일링 모듈을 포함할"}
{"patent_id": "10-2022-7008439", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수 있다. 요약하면, 위의 설명에 따라, 관찰자 프로파일링 시스템은 홀로그래픽 콘텐츠를 관찰하는 관찰자들의 특성 또는 홀로그래픽 콘텐츠에 대한 관찰자 반응들을 식별하고, 식별된 반응들 또는 특성을 관찰자 프로파일들 내에 포함시키도록 구성된다. 특성은 관찰자의 위치, 관찰자의 움직임, 관찰자의 제스처, 관찰자의 선호도, 사 용자의 얼굴 표정, 사용자의 성별, 사용자의 나이, 및 사용자의 의복 중 임의의 것을 포함한다. 일 실시예에서, 관찰자 프로파일들 내의 관찰자들에 관한 정보는 AI 모델에 대한 입력으로서 사용되고, 홀로그래픽 콘텐츠는 AI 모델에 기초하여 부분적으로 생성된다. 일 예로서, 엔터테인먼트 장소에서, 일단 관찰자가 식별되면, 홀로 그래픽 공연자는 말할 수 있고, 신체 움직임을 수행하거나, 관찰자의 즐거움을 최대화하기 위한 방식 으로 동작할 수 있다. 엔터테인먼트 장소(예를 들어, 엔터테인먼트 장소) 내의 LF 디스플레이 시스템은 홀로그래픽 콘텐츠가 제 공될 때 제2 에너지로서 감각 피드백을 제공하도록 구성되는 적어도 하나의 감각 피드백 장치를 포함하는, 감각 피드백 시스템을 포함할 수 있다. 예를 들어, 처리 엔진은 촉각 자극, 음향 자극, 온도 자극, 후각 자극, 압력 자극, 힘 자극, 또는 이들의 임의의 조합을 포함하는 감각 콘텐츠를 이용하여, 생성된 홀로그래픽 콘텐츠를 증 강시키도록 구성될 수 있다. 앞서 설명된 예를 사용하여, LF 디스플레이 표면은 홀로그래픽 콘텐츠(가시적 전자 기 에너지)뿐만 아니라 음파 형태의 기계적 에너지를 동시에 투사하는 듀얼 에너지 표면일 수 있다. 일 실시예 에서, 음파는 디스플레이 표면 상에 장착될 수 있는 투명한 초음파 트랜스듀서로부터 생성되고, 부피 촉각 표면 이 생성되도록 구동될 수 있다. 결과적인 촉각 표면은 하나 이상의 홀로그래픽 객체들과 일치할 수 있거나, 홀 로그래픽 공연자와 같은 홀로그래픽 객체 근처에 투사될 수 있다. 2개의 감각 도메인으로 투사하는 것은, 특히, 부피 촉각 표면이 홀로그래픽 콘텐츠에 대한 관찰자의 추적된 움직임 또는 관찰자의 모니터링된 반응에 응답하 여 변경되는 경우에, 관찰자에게 더욱 몰입적인 경험을 초래할 수 있다. 관찰자의 추적된 움직임 또는 관찰자의 모니터링된 반응은 AI 모델에 입력될 수 있으며, 여기서, 부피 촉각 표면은 부분적으로 AI 모델에 기초하여 투 사되어, 관찰자에 대한 홀로그래픽 공연자의 매력을 최대화한다. 촉각 표면은 사용자 터치에 응답하 여 생성된 부피 촉각 표면의 저항의 변화, 생성된 부피 촉각 표면의 선택된 텍스처, 또는 컨트롤러에 수신 된 파라미터의 값에 기초하여 생성된 촉각 표면의 촉각 강도의 조절을 포함하여, LF 처리 엔진에 의해 변 경될 수 있다. 일 예로서, 홀로그래픽 공연자는 관찰자에 근접하게 신체 부분을 밀 수 있고, 촉각 표 면은, 아마도 관찰자 프로파일링 모듈에 저장된 정보에 맞추어, 공연자로부터의 터치의 대응하는 감각을 시뮬레이션하도록 생성될 수 있다. 다른 예로서, 홀로그래픽 공연자는 자신의 신체의 일부를 이동시킬 수 있고, 부피 촉각 표면은 이러한 빠른 움직임을 따르도록 조절될 수 있거나, (예를 들어, 진동의 감각을 제공함 으로써) 관찰자를 흥분시키는 방식으로 이러한 움직임의 변형(예를 들어, 홀로그래픽 콘텐츠보다 더 신속하게 움직임)을 적용하도록 조절될 수 있다. 관찰자 프로파일 내의 정보뿐만 아니라 관찰자의 추적된 반응(즉, 신체 움직임, 얼굴 표정)은 관찰자의 즐거움을 최대화하기 위해 홀로그래픽 콘텐츠 및 수반된 감각 자극을 조절 하도록 AI 모델에 의해 사용될 수 있다. 도 7a는 하나 이상의 실시예들에 따른, 홀로그래픽 콘텐츠와 함께 동작하는 감각 시뮬레이션 장치를 포함 하는, 관찰자에 홀로그래픽 콘텐츠를 제공하는 LF 디스플레이 시스템의 일 실시예인 장소의 제1 예시이다. 도 7a는 홀로그래픽 콘텐츠와 관련하여 관찰자에 의해 사용될 수 있는(예를 들어, 홀로그래픽 공연자가 더 빨리 이동함에 따라, 더 강한 자극이 감각 시뮬레이션 장치에 의해 제공되는 등) 감각 시뮬레 이션 장치를 갖는 장소 내의 관찰자를 추가적으로 도시한다. 일 실시예에서, 감각 시뮬레이션 장치는 개인 마사지기, 인형, 삽입 장치, 돌출 장치, 애니매트로닉 물체, 로봇 인형, 또는 사람의 성적 쾌 락을 촉진하는 데 사용될 수 있는 임의의 다른 물체일 수 있다. 감각 시뮬레이션 장치는 LF 디스플레이 시 스템과 독립적으로 동작될 수 있지만, 일부 실시예들에서, 감각 시뮬레이션 장치는 LF 처리 엔진 에 의해 제공되는 홀로그래픽 콘텐츠와 함께 동작할 수도 있다. 일 실시예에서, 감각 시뮬레이션 장치 는 LF 처리 엔진에 의해 실행되는 애플리케이션에 따라 동작하기 위해 LF 처리 엔진으로부터 동 작 명령들을 수신할 수 있다. 다른 실시예에서, 하나 이상의 LF 디스플레이 모듈들은 감각 장치의 외관을 증강 하기 위해 감각 시뮬레이션 장치 내에 또는 그 위에 통합될 수 있다. 다른 실시예에서, LF 디스플레이 시 스템은 도 7b에 도시된 바와 같이, 홀로그래픽 콘텐츠로 하여금 감각 시뮬레이션 장치를 통해 제공되 게 하여 그의 외관을 증강하거나 심지어 은폐하게 할 수 있다. 도 7b는 하나 이상의 실시예들에 따른, 감각 시뮬레이션 장치가 홀로그래픽 콘텐츠로 증강된, 도 7a와 관 련하여 위에서 설명된 LF 디스플레이 시스템을 갖는 장소를 도시한다. 이 실시예에서, 홀로그래픽 콘텐츠 의 감각 시뮬레이션 장치는, 일 실시예에서, 감각 시뮬레이션 장치를 은폐하고, 감각 시뮬레이션 장 치 대신에 홀로그래픽 공연자가 관찰자에게 물리적 자극을 제공하는 착시를 생성하기 위한, 도 6과 관련하여 위에서 설명된 홀로그래픽 공연자이다. 감각 시뮬레이션 장치의 위치는 LF 디스플레이 시스템에 대해 알려져 있다. 일 실시예에서, 추적 시스템은 장소 내의 감각 시뮬레이션 장치 의 위치(예를 들어, 장치의 위치 좌표)를 식별하고, 장치의 위치를 LF 처리 엔진에 제공한 다. 일부 실시예들에서, LF 처리 엔진은 추적 모듈을 사용하여 환경 내에서 사용자의 위치를 식별한다. 관 찰자는 홀로그래픽 공연자로 하여금 그의 홀로그래픽 신체를 움직이도록 안내하기 위한 명령들을 발행할 수 있으며, 이는 홀로그래픽 공연자가 신체 위치를 이동시키거나, 또는 특정의 반복적인 신체 운동을 달성하는 것을 포함할 수 있다. 명령들은, 인식된 물리적 움직임, 제스처, 신체 위치 등을 포함하여, 감각 피드백 시스템 에 의해 기록된 명령들(예를 들어, 구두 명령들), 또는 추적 시스템에 의해 기록되고 추적 모듈(52 6)에 의해 해석되는 명령들 중 임의의 것을 포함할 수 있다. 일부 실시예들에서, 관찰자의 위치, 장치 의 위치, 또는 홀로그래픽 공연자의 신체를 움직이기 위한 관찰자로부터의 명령들, 또는 이들의 임의의 조 합에 기초하여, LF 처리 엔진은 관찰자에게 즐거움을 제공할 수 있는 방식으로 제공될 홀로그래픽 공 연자에 대한 렌더링 명령들을 생성한다. LF 처리 엔진은 또한 관찰자에게 즐거움을 제공하는 방 식으로 감각 시뮬레이션 장치에 대한 제어 명령들을 생성할 수 있다. 다른 실시예들에서, AI 모델은, 감각 피드백 시스템(예를 들어, 오디오 정보)에 의해 기록된 자극들, 또는 추적 시스템에 의해 기록되고 추적 모듈에 의해 해석되는 물리적 움직임, 제스처, 신체 위치 등, 또는 이들 모두를 입력으로서 사용하여, 관찰자의 즐거움을 최대화하기 위해 홀로그래픽 콘텐츠를 렌더링하도록 LF 처리 엔진 내에 서 사용될 수 있다. 추가적으로, 홀로그래픽 공연자가 원격 위치로부터의 커플 세션에 참여하는 다른 사람(예를 들어, 애인, 라이브 채팅 파트너 등)의 홀로그래픽 표현인 실시예에서, 원격 관찰자(예를 들어, 애인, 라이브 채팅 파트너 등)는 감각 시뮬레이션 장치를 통해 관찰자에게 제공되는 자극의 강도를 원격으로 제어할 수 있을 것 이다. 다른 실시예에서, LF 처리 엔진은 관찰자에 대해 감각 시뮬레이션 장치에 의해 제공되는 자극의 강도를, 움직임 속도나 강도 및/또는 원격 관찰자의 다른 컨텍스트 특성(예를 들어, 가청 사운드, 소음 크기, 얼굴 표정 등)에 기초하여(예를 들어, 비례하여, 등) 변화시킬 수 있다. 도 8은 LF 네트워크(예를 들어, LF 네트워크)의 맥락에서 관찰자에게 성인용 홀로그래픽 콘텐츠를 디 스플레이하기 위한 방법의 흐름도이다. 방법은 추가적인 또는 더 적은 단계들을 포함할 수 있으며, 단계들은 상이한 순서로 발생할 수 있다. 또한, 다양한 단계들, 또는 단계들의 조합이 상기 방법의 실행 동안에 임의의 횟수로 반복될 수 있다. 시작하면, LF 디스플레이 시스템을 포함하는 장소는, 장소 내의 LF 디스플레이 시스템에 의해 제공될 홀로그래픽 콘텐츠에 대한 관찰자의 관찰자 선호도를 획득한다. 이는 LF 디스플레이 시 스템이 관찰자 프로파일링 시스템에 저장된 관찰자에 대한 정보를 획득하는 단계, 또는 시스템 이 예를 들어, 공연자들 또는 모델들의 카탈로그나 다른 목록으로부터 하나 이상의 홀로그래픽 공연자들 에 대한 관찰자 선택을 수신하는 단계를 포함할 수 있다. 홀로그래픽 공연자는 네트워크 시스템 상에서 LF 디스플레이 시스템에 자신의 라이브 홀로그래픽 콘텐츠를 스트리밍하는 라이브 모델일 수 있고, 실제 사람(예를 들어, 모델, 여배우, 남자 배우 등)의 기록된 AI 표현, 또는 컴퓨터 생성된 모델(예를 들어, 애 니메이션 만화 등)일 수 있다. 관찰자의 선호도에 응답하여, LF 디스플레이 시스템은 홀로그래픽 콘텐츠를 장소 내의 홀로그래픽 객 체 부피 내의 관찰자에게 제공한다. 위에 설명된 바와 같이, 일 실시예에서, 홀로그래픽 디스플레이는 단 일 LF 디스플레이 모듈의 디스플레이 영역보다 더 큰 유효 디스플레이 영역을 갖는 이음매 없는 디스플레 이 표면을 형성하도록 타일링되는, 장소 내에 하나 이상의 표면들을 형성하는 복수의 LF 디스플레이 모듈 들이다. 따라서, 홀로그래픽 공연자는 관찰자가 임의의 헤드웨어(headwear) 또는 장치를 착용할 필요없이 관찰자가 방 안에 실제 사람이 서 있고 말하는 것처럼 볼 수 있는, 장소의 홀로그래픽 객체 부피 내의 위치에 제공되는 홀로그램이다. 추적 시스템 또는 LF 디스플레이 시스템의 감각 피드백 시스템은 홀로그래픽 콘텐츠를 보는 관 찰자에 대한 감각 정보를 얻는다. 이는 관찰자의 하나 이상의 컨텍스트 특성을 식별하는 동안의 홀로그래픽 공연자와의 관찰자의 상호작용을 포함한다. 이러한 컨텍스트 관찰자 특성은 분류된 얼굴 표정, 관찰자의 발성 분석(예를 들어, 그들이 무엇을 말하는지, 어떻게 말하는지, 톤 등), 홀로그래픽 공연자에 대한 관찰자의 움직임, 사용자에 의해 명시적으로 표현될 수 있는 다른 일반적인 피드백(예를 들어, 동작을 수 행하기 위한 홀로그래픽 공연자에 대한 사용자 명령 등) 등을 포함하여, 즐거움, 흥분, 실망, 지루함 등을 나타낼 수 있는 관찰자의 몸짓 언어의 ML 분류된 인스턴스들을 포함한다. 따라서, LF 디스플레이 시스템은 추적 시스템으로부터 얻어진 획득된 감각 정보에 응답하여 홀로그래 픽 공연자의 행동과 같은 홀로그래픽 콘텐츠의 프리젠테이션을 조절한다. 이는 관찰자로부터의 요청에 응답하여 동작을 수행하는(예를 들어, 조명을 흐리게 하거나, 풍경을 변경하고, 음료수를 주문하는 등) 홀로그래픽 공연자에 대한 관찰자로부터의 코멘트에 응답하는, 홀로그래픽 공연자의 미소나 웃 음처럼 미묘한 것일 수 있다. 전술한 바와 같이, 홀로그래픽 공연자에 의해 이루어진 응답은 관찰자 로부터의 상호작용에 기초하여 AI 모델을 사용하여 생성될 수 있다. 따라서, 홀로그래픽 공연자는 관찰자 가 임의의 헤드웨어(headwear) 또는 장치를 착용할 필요없이 관찰자가 방 안에 실제 사람이 서 있고 말하는 것처럼 볼 수 있는, 장소의 홀로그래픽 객체 부피 내의 위치에 제공되는 홀로그램이다. AI 모델은 관찰자로 하여금 그들과 함께 방에 서 있는 실제 사람인 것처럼 홀로그래픽 공연자와 매끄럽게 대화 하게 할 수 있다. 추가 구성 정보 본 개시의 실시예들에 대한 전술한 설명은 예시의 목적으로 제공되었지만, 개시된 정확한 형태들로 배타적으로 또는 본 개시를 제한하는 것으로 의도되는 것은 아니다. 통상의 기술자는 위의 개시 내용에 비추어 많은 수정 및 변형이 가능하다는 것을 이해할 수 있다. 본 설명의 일부 부분들은 정보에 대한 동작들의 알고리즘들 및 기호 표현들의 관점에서 본 개시의 실시예들을 기술한다. 이러한 알고리즘 설명들 및 표현들은 작업 내용을 다른 통상의 기술자들에게 효과적으로 전달하기 위 해, 데이터 처리 분야의 통상의 기술자들에 의해 통상적으로 사용된다. 이러한 동작들은, 기능적으로, 계산적으 로, 또는 논리적으로 기술되지만, 컴퓨터 프로그램들 또는 균등한 전기 회로들, 마이크로코드 등에 의해 구현되 는 것으로 이해된다. 나아가, 일반성을 잃지 않고, 이러한 동작들의 모듈들을 모듈들로 지칭하는 것이 종종 편 리하다는 것이 입증되었다. 설명된 동작들 및 그들의 연관된 모듈들은 소프트웨어, 펌웨어, 하드웨어, 또는 이 들의 임의의 조합으로 구현될 수 있다. 본원에 설명된 단계들, 동작들, 또는 프로세스들 중 임의의 것은 하나 이상의 하드웨어 또는 소프트웨어 모듈들 로, 단독으로 또는 다른 장치들과 조합하여 수행되거나 구현될 수 있다. 일 실시예에서, 소프트웨어 모듈은, 기 술된 단계들, 동작들, 또는 프로세스들 중 임의의 것 또는 전부를 수행하기 위해 컴퓨터 프로세서에 의해 실행 될 수 있는 컴퓨터 프로그램 코드를 포함하는 컴퓨터-판독가능 매체를 포함한, 컴퓨터 프로그램 제품으로 구현 된다.본 개시의 실시예들은 또한, 본원에서의 동작들을 수행하기 위한 장치에 관한 것일 수 있다. 이 장치는 필요한 목적을 위해 특별히 구성될 수 있고/있거나, 컴퓨터에 저장된 컴퓨터 프로그램에 의해 선택적으로 활성화되거나 재구성되는 범용 컴퓨팅 장치를 포함할 수 있다. 이러한 컴퓨터 프로그램은 비-일시적, 유형의 컴퓨터 판독가능 저장 매체, 또는 컴퓨터 시스템 버스에 연결될 수 있는 전자 명령들을 저장하기에 적합한 임의의 유형의 매체에 저장될 수 있다. 또한, 본 명세서에서 언급되는 임의의 컴퓨팅 시스템들은 단일 프로세서를 포함할 수 있거나, 증가된 컴퓨팅 능력을 위해 다수의 프로세서 설계들을 이용하는 아키텍처일 수 있다. 본 개시의 실시예들은 또한, 본원에 기술된 컴퓨팅 프로세스에 의해 생성되는 제품에 관한 것일 수 있다. 이러 한 제품은 컴퓨팅 프로세스로부터 발생하는 정보를 포함할 수 있으며, 여기서 해당 정보는 비-일시적인 유형의 컴퓨터 판독가능 저장 매체 상에 저장되고, 본원에 기술된 컴퓨터 프로그램 제품 또는 다른 데이터 조합의 임의 의 실시예를 포함할 수 있다. 마지막으로, 본 명세서에서 사용되는 언어는 주로 가독성 및 교육 목적을 위해 선택되었고, 본 발명의 청구 대 상을 기술하거나 제한하기 위해 선택되지 않았을 수 있다. 따라서, 본 개시의 범위는 이러한 상세한 설명에 의 해 제한되는 것이 아니라, 본원에 기초하여 발행하는 임의의 청구항들에 의해 제한되는 것으로 의도된다. 따라 서, 실시예들의 개시는 다음의 청구항들에 제공된 본 개시의 범위를 제한하는 것이 아니라 예시적인 것이다.도면 도면1 도면2a 도면2b 도면3a 도면3b 도면4a 도면4b 도면4c 도면4d 도면4e 도면5a 도면5b 도면6 도면7a 도면7b 도면8"}
{"patent_id": "10-2022-7008439", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 하나 이상의 실시예들에 따른 홀로그래픽 객체를 제공하는 라이트필드 디스플레이 모듈의 도면이다. 도 2a는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 모듈의 일부분의 단면도이다. 도 2b는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 모듈의 일부분의 단면도이다. 도 3a는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 모듈의 사시도이다. 도 3b는 하나 이상의 실시예들에 따른, 인터리빙(interleaved)된 에너지 중계 장치들을 포함하는 라이트필드 디 스플레이 모듈의 단면도이다. 도 4a는 하나 이상의 실시예들에 따른, 단일 측면의 이음매 없는 표면 환경을 형성하기 위해 2차원으로 타일링 (tiled)되는 라이트필드 디스플레이 시스템의 일부의 사시도이다. 도 4b는 하나 이상의 실시예들에 따른, 다중-측면의 이음매 없는 표면 환경에서의 라이트필드 디스플레이 시스 템의 일부의 사시도이다. 도 4c는 하나 이상의 실시예들에 따른, 날개형 구성의 집합 표면을 갖는 라이트필드 디스플레이 시스템의 평면 도이다. 도 4d는 하나 이상의 실시예들에 따른, 경사진 구성의 집합 표면을 갖는 라이트필드 디스플레이 시스템의 측면 도이다.도 4e는 하나 이상의 실시예들에 따른, 방의 전면 벽 상에 집합 표면을 갖는 라이트필드 디스플레이 시스템의 평면도이다. 도 5a는 하나 이상의 실시예들에 따른, 라이트필드 디스플레이 시스템의 블록도이다. 도 5b는 하나 이상의 실시예들에 따른, 성인용 시뮬레이션을 위한 라이트필드 디스플레이 시스템을 포함하는 라 이트필드 환경의 블록도이다. 도 6은 하나 이상의 실시예들에 따른, 관찰자에게 홀로그래픽 공연자를 제공하는 성인용 엔터테인먼트 환경에서 의 LF 디스플레이 시스템의 예시이다. 도 7a는 하나 이상의 실시예들에 따른, 홀로그래픽 콘텐츠와 협력하여 동작하는 감각 시뮬레이션 장치를 포함하 고, 관찰자에게 홀로그래픽 콘텐츠를 제공하는 LF 디스플레이 시스템의 일 실시예의 제1 예시이다. 도 7b는 하나 이상의 실시예들에 따른, 감각 시뮬레이션 장치가 홀로그래픽 콘텐츠로 증강된 도 7a에 기술된 LF 디스플레이 시스템의 실시예의 제2 예시이다. 도 8은 하나 이상의 실시예들에 따른, 성인용 홀로그래픽 콘텐츠를 관찰자에게 디스플레이하기 위한 흐름도이다."}
