{"patent_id": "10-2021-0058203", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0150799", "출원번호": "10-2021-0058203", "발명의 명칭": "콘텐츠 공유가 가능한 엘이디전광판 시스템", "출원인": "주식회사 코런", "발명자": "김재두"}}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "고유의 코드를 가지면서 무선통신이 가능하며, 복수의 엘이디(LED)가 실장된 복수의 엘이디 픽셀패널과 상기 복수의 엘이디 픽셀패널의 엘이디를 온(ON)/오프(OFF)시키는 신호를 출력하는 각각의 구동부로 이루어져 전광판프레임에 결합되는 엘이디전광판;PC, 리모컨, USB, 휴대용 단말기로 이루어지되, 편집기능이 가능하게 이루어지고, 상기 엘이디전광판의 구동부와 무선으로 연계되어 상기 엘이디전광판을 통해 출력되는 콘텐츠를 입력하는 입력부;상기 복수의 엘이디전광판이나 상기 입력부와 무선으로 연계되어 양방향으로 데이터 통신이 가능하고, 상기 엘이디전광판에 출력하는 콘텐츠와 상기 입력부에 입력하는 콘텐츠를 저장 및 공유하는 클라우드서버부; 상기 엘이디전광판과 회로적으로 연결되어 구동을 위한 전원을 공급하는 전원부; 및상기 복수의 엘이디전광판, 상기 클라우드서버부, 상기 전원부에 연계되고, 상기 복수의 엘이디전광판을 개별이나 그룹으로 제어가 가능하며, 상기 복수의 엘이디전광판, 상기 클라우드서버부, 상기 전원부를 원격으로 관리가 가능한 제어부; 를 포함하여 이루어지는 것을 특징으로 하는 콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 엘이디전광판은 복수로, 상기 클라우드서버부에 무선으로 각각 연계되어 양방향으로 데이터 통신이 가능하되, 상기 복수의 엘이디전광판 중 상기 클라우드서버부에 등록되는 엘이디전광판과 데이터 통신이 가능한 것을특징으로 하는 콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 엘이디전광판이나 상기 클라우드서버부에 구비되어 상기 엘이디전광판을 통해 출력되는 내용이거나 상기클라우드서버부에 저장되는 내용 중 불건전한 내용을 필터링하는 필터링부를 더 포함하는 것을 특징으로 하는콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 필터링부는 인공지능(AI)를 이용하여 상기 엘이디전광판을 통해 출력되는 내용이거나 상기 클라우드서버부에 저장되는 내용 중 불건전한 내용을 자동으로 필터링하는 것을 특징으로 하는 콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 복수의 엘이디전광판 중 어느 하나의 엘이디전광판은 상기 클라우드서버부로부터 전송되는 출력내용 중 전송받지 못한 출력내용을 상기 클라우드서버부로부터 동일한 출력내용을 전송받은 다른 엘이디전광판으로부터 전송받는 것을 특징으로 하는 콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 입력부에서 편집된 콘텐츠를 상기 클라우드서버부에 업로드가 가능한 것을 특징으로 하는 콘텐츠 공유가공개특허 10-2022-0150799-3-가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 제어부는 상기 복수의 엘이디전광판을 개별이나 그룹으로 제어가 가능하여 상기 콘텐츠를 상기 복수의 엘이디전광판의 개별이나 그룹으로 출력시키는 것을 특징으로 하는 콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 엘이디전광판의 구동부는 무선으로 연계되는 상기 입력부 중 PC, 리모컨, 휴대용 단말기를 통해 전원이 온(ON)/오프(OFF)될 수 있는 것을 특징으로 하는 콘텐츠 공유가 가능한 엘이디전광판 시스템."}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 콘텐츠 공유가 가능한 엘이디전광판 시스템에 관한 것으로, 고유의 코드를 가지면서 무선통신이 가능 하며, 복수의 엘이디(LED)가 실장된 복수의 엘이디 픽셀패널과 상기 복수의 엘이디 픽셀패널의 엘이디를 온(ON)/ 오프(OFF)시키는 신호를 출력하는 각각의 구동부로 이루어져 전광판프레임에 결합되는 엘이디전광판; PC, (뒷면에 계속)"}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 콘텐츠 공유가 가능한 엘이디전광판 시스템에 관한 것으로, 보다 상세하게는 엘이디전광판에 출력되 는 문자, 이미지, 동영상 등의 각종 콘텐츠를 공유가 가능하여 콘텐츠 제작 및 운용에 따른 비용과 시간을 절감 시킬 수 있는 콘텐츠 공유가 가능한 엘이디전광판 시스템에 관한 것이다."}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 전광판(電光板)은 건물이나 교통수단 등에 설치되어 소정의 정보를 제공하는 것으로, 주로 광고용 으로 많이 사용되고 있는 것으로, 전광판의 발광소자는 빛을 표출하는 다이오드로써 적색, 녹색, 청색 및 백색 등 많은 종류의 색상과 크기가 있으나 전광판의 발광소자로는 RED, GREEN, 그리고 RGB 색상이 주로 사용되며, 약 50,000시간 이상의 반영구적인 수명과, 적은 전력소비로 인해 미래의 광고산업에 크게 기여할 최첨단 소자로 그 적용범위가 날로 확대되고 있다. 전광판의 발광소자를 발광 수단으로 이용하여 문자, 기호, 이미지, 동영상 등을 출력하는 장치로 일반적으로 다 수의 엘이디(LED/Light Emitting Diode)가 실장된 다수의 엘이디 픽셀패널, 상기 엘이디 픽셀패널의 엘이디를 on/off하는 신호를 출력하는 구동 드라이버 모듈, 엘이디 전광판의 전체적인 제어를 위한 전광판 제어 모듈 및 전원 공급을 위한 전원 모듈과 이들을 설치하기 위한 전광판 케이스로 이루어진다. 이와 같은 엘이디 전광판은 종래 엘이디 전광판의 데이터 송수신 방식 예로, 데이터의 송수신방식에 따라 PC 제 어 방식이 있다. 상기 PC 제어 방식은 퍼스널 컴퓨터(PC/2)에 엘이디 전광판이 통신이 되도록 연결이 되어 PC에 설치된 구동프로 그램(인터페이스 프로그램)에 의해 엘이디 전광판이 구동되는 방식이다. 이와 같은 PC 제어 방식은 PC에 설치된 프로그램을 이용해 엘이디 전광판에 출력 데이터를 전송 내지 변경시킴 으로 각종 문자 및 내장된 그림, 기호, 애니메이션의 선택 및 제어가 가능하다. 종래의 엘이디 전광판에 출력되는 각종 문자 및 내장된 그림, 기호, 애니메이션은 각각 제작해야 하므로 제작 및 운용에 따른 비용과 시간이 많이 소요되는 문제점이 있다. 관련 선행기술로는 등록특허공보 제10-1092941호(발명의 명칭: 전광판 시스템 및 그 제어 방법, 등록일자: 2011 년 12월 06일) 및 등록특허공보 제10-0424279호(발명의 명칭: 인터넷을 이용한 무선 전광판 시스템의 양방향 메 시지서비스 방법, 등록일자: 2004년 03월 11일)가 있다."}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래기술의 문제점을 해결하기 위해 창안된 것으로, 엘이디 전광판에 출력되는 문자, 이 미지, 동영상 등의 각종 콘텐츠를 공유가 가능하여 콘텐츠 제작 및 운용에 따른 비용과 시간을 절감시킬 수 있는 콘텐츠 공유가 가능한 엘이디전광판 시스템을 목적으로 한다. 본 발명의 다른 목적은 본 발명의 특징을 통해 이해될 수 있으며, 본 발명의 실시 예를 통해 보다 분명하게 알 수 있고, 특허청구범위에 나타난 수단 및 조합에 의해 실현될 수 있다."}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 본 발명이 해결하고자 하는 과제를 달성하기 위하여 본 발명은 아래와 같은 기술적 특징을 갖는다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템은, 고유의 코드를 가지면서 무선통신이 가능하며, 복수의 엘이디(LED)가 실장된 복수의 엘이디 픽셀패널과 상기 복수의 엘이디 픽셀패널의 엘이디를 온(ON)/오프 (OFF)시키는 신호를 출력하는 각각의 구동부로 이루어져 전광판프레임에 결합되는 엘이디전광판; PC, 리모컨, USB, 휴대용 단말기로 이루어지되, 편집기능이 가능하게 이루어지고, 상기 엘이디전광판의 구동부와 무선으로 연계되어 상기 엘이디전광판을 통해 출력되는 콘텐츠를 입력하는 입력부; 상기 복수의 엘이디전광판이나 상기 입력부와 무선으로 연계되어 양방향으로 데이터 통신이 가능하고, 상기 엘이디전광판에 출력하는 콘텐츠와 상기 입력부에 입력하는 콘텐츠를 저장 및 공유하는 클라우드서버부; 상기 엘이디전광판과 회로적으로 연결되어 구동 을 위한 전원을 공급하는 전원부; 및 상기 복수의 엘이디전광판, 상기 클라우드서버부, 상기 전원부에 연계되고, 상기 복수의 엘이디전광판을 개별이나 그룹으로 제어가 가능하며, 상기 복수의 엘이디전광판, 상기 클라우드서버부, 상기 전원부를 원격으로 관리가 가능한 제어부; 를 포함하여 이루어진다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 복수의 상기 엘이디전광판은 상기 클라우 드서버부에 무선으로 연계되어 양방향으로 데이터 통신이 가능하되, 복수의 상기 엘이디전광판 중 상기 클라우 드서버부에 등록되는 엘이디전광판과 데이터 통신이 가능하다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 상기 엘이디전광판이나 상기 클라우드서 버부에 구비되어 상기 엘이디전광판을 통해 출력되는 내용이거나 상기 클라우드서버부에 저장되는 내용 중 불건 전한 내용을 필터링하는 필터링부를 더 포함한다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 상기 필터링부는 인공지능(AI)를 이용하 여 상기 엘이디전광판을 통해 출력되는 내용이거나 상기 클라우드서버부에 저장되는 내용 중 불건전한 내용을 자동으로 필터링하다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 복수의 상기 엘이디전광판 중 어느 하나 의 엘이디전광판은 상기 클라우드서버부로부터 전송되는 동일한 출력내용 중 전송받지 못한 출력내용을 다른 엘 이디전광판과 공유한다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 상기 입력부에서 편집된 콘텐츠를 상기 클라우드서버부에 업로드가 가능하다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 상기 제어부는 상기 복수의 엘이디전광판 을 개별이나 그룹으로 제어하되, 시간이나 장소에 따라 상기 콘텐츠를 개별이나 그룹으로 제어한다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템에 있어서, 상기 엘이디전광판의 구동부는 무선으로 연계되는 상기 입력부 중 PC, 리모컨, 휴대용 단말기를 통해 전원이 온(ON)/오프(OFF)될 수 있다."}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 상기와 같은 과제의 해결 수단을 통해 엘이디 전광판에 출력되는 문자, 이미지, 동영상 등의 각종 콘 텐츠를 공유가 가능하여 콘텐츠 제작 및 운용에 따른 비용과 시간을 절감시킬 수 있는 효과가 있다. 또한, 본 발명의 다른 효과는 관공서, 부동산, 병원 등 관련 광고 내용을 접속을 통해 신속하면서 간단하게 사 용할 수 있는 편리함이 제공될 수 있다. 본 발명의 또 다른 효과는 본 발명의 특징을 통해 이해될 수 있으며, 본 발명의 실시 예를 통해 보다 분명하게 알 수 있고, 특허청구범위에 나타난 수단 및 조합에 의해 발휘될 수 있다."}
{"patent_id": "10-2021-0058203", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도면 을 참조한다. 이들 실시 예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다 양한 실시 예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있 는 특정 형상, 구조 및 특성은 일 실시 예에 관련하여 본 발명의 기술적 사상 및 범위를 벗어나지 않으면서 다 른 실시 예로 구현될 수 있다. 또한, 각각의 개시된 실시 예 내의 개별 구성요소의 위치 또는 배치는 본 발명의 기술적 사상 및 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미로서 취하려는 것이 아니며, 본 발명의 범위는 그 청구항들이 주장하는 것과 균등한 모든 범위와 더불어 첨부된 청구항에 의해서만 한정된다. 도면에서 유사한 참조부호는 여러 측면에서 걸쳐서 동일하거나 유 사한 기능을 지칭한다. 도 1은 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템의 일 실시예의 블록도이고, 도 2는 도 1에 따른 필터링부가 더 포함된 상태를 나타내는 블록도이며, 도 3은 도 1에 따른 엘이디전광판이 건물에 설치되는 상태를 나타내는 사시도이고, 도 4는 도 1에 따른 엘이디전광판의 구성을 나타내는 사시도이며, 도 5는 도 1에 따른 제어부가 복수의 엘이디전광판을 개별적으로 제어하는 상태를 나타내는 도면이고, 도 6은 도 1에 따른 제 어부가 복수의 엘이디전광판을 그룹으로 제어하는 상태를 나타내는 도면이다. 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템은, 도 1 내지 도 6에 도시된 바와 같이, 엘이 디전광판, 입력부, 클라우드서버부, 전원부, 제어부를 포함하여 이루어진다. 엘이디전광판은 고유의 코드를 가지면서 무선통신이 가능하며, 복수의 엘이디(LED, 111a)가 실장된 복수의 엘이디 픽셀패널과 복수의 엘이디 픽셀패널의 엘이디(111a)를 온(ON)/오프(OFF)시키는 신호를 출력하 는 각각의 구동부로 이루어져 전광판프레임에 결합된다. 엘이디전광판은 건물의 옥내 또는 옥외 등에 설치되어 소정의 정보를 제공하기 위해 운용되는 것으로, 주 로 옥외용 광고간판으로 많이 사용되고 있다. 옥외용 광고간판으로 사용되는 엘이디전광판은 노출된 벽면에 부착설치(1-1)되거나 수평(1-2) 또는 수직 (1-3)으로 벽면 등에 돌출되어 설치되어 사용자가 설정한 문장, 이미지, 동영상 등을 엘이디전광판을 통해 외부로 출력(디스플레이)한다. 이와 같은 엘이디전광판은 기본적인 구성으로, 다수의 엘이디(LED, 111a)가 실장된 여러 장의 엘이디 픽셀 패널과 엘이디 픽셀패널의 엘이디(도트, 111a)를 온(ON)/오프(OFF)시키는 신호를 출력하는 구동부 와 엘이디전광판 전체적인 제어를 위한 제어부 및 전원 공급을 위한 전원부와 이들을 설치 하기 위한 전광판프레임을 포함하여 이루어진다. 엘이디 픽셀패널과 구동부는 1 대 1로 대응되며, 엘이디 픽셀패널은 256픽셀 패널이 범용적인 규격으로 사용되고 있다. 엘이디 픽셀패널을 결합시켜 발광면을 구성함에 있어, 엘이디 픽셀패널은 길이 방향(가로 방향)으로 설치하는 수에 따라 '열'이 결정되고, 높이 방향(세로 방향)으로 설치하는 수에 따라 '단'이 결정되어 1단 6열 엘이디전광판가 된다. 복수의 엘이디 픽셀패널과 각 엘이디 픽셀패널을 구동하기 위한 구동부는 각 엘이디 픽셀패널 의 배면 즉, 엘이디가 실장되지 않은 면(뒷면)에 소정의 높이로 이격되어 고정설치되고, 이렇게 설치된 각구동부는 데이터케이블로 연결이 된다. 데이터케이블은 제어부에서 출력되는 데이터와 전원부에서 출력되는 직류 전원을 엘이디(111a)로 전 달하는 수단으로 케이블 역할을 하는 FPCB(Flexible Printed Circuits Board)로 하는 것이 바람직하다. 복수의 엘이디 픽셀패널은 엘이디(111a)의 조합을 통해 단색, 삼색 또는 풀컬러 등을 발광시켜 문장, 이미 지, 동영상 등을 출력한다. 복수의 엘이디전광판 중 어느 하나의 엘이디전광판은 아래에서 설명하게 되는 클라우드서버부로부터 전송되는 출력내용(콘텐츠) 중 전송받지 못한 출력내용(콘텐츠)을 클라우드서버부로부터 동일한 출력내용 을 전송받은 다른 엘이디전광판으로부터 전송받는다. 구체적으로 살펴보면, 복수의 엘이디전광판은 클라우드서버부로부터 동일한 출력내용을 전송받아 외 부로 각각 출력하는데, 클라우드서버부로부터 출력내용을 전송받는 과정에서 복수의 엘이디전광판 중 어느 하나의 엘이디전광판이 정상적으로 출력내용을 전송받지 못하는 경우에 출력내용을 정상적으로 전송받은 다른 어느 하나의 엘이디전광판으로부터 나머지 출력내용을 공유 또는 전송받는다. 엘이디전광판에 출력되는 내용은 관공서, 부동산, 병원의 관련 광고이다. 엘이디전광판은 클라우드서버부에 등록된 관공서의 공익광고나 부동산 및 병원의 관련 광고를 다운받 아 출력할 수 있다. 이는 클라우드서버부에 등록된 각종 콘텐츠(광고)를 공유가 가능하여 콘텐츠 제작 및 운용에 따른 비용과 시간을 절감시킬 수 있을 뿐만 아니라 접속을 통해 신속하면서 간단하게 사용할 수 있는 편리함이 제공되는 효 과가 있다. 엘이디전광판은 하나의 출력 영역을 복수개로 분할이 가능하여 하나의 콘텐츠를 분할되는 복수개의 출력 영역에 출력하거나 복수의 콘텐츠를 분할되는 복수개의 출력 영역에 출력할 수 있다. 엘이디전광판에 출력되는 콘텐츠는 엘이디전광판에 출력되기 전에 사용자나 담당자의 휴대용 단말기 를 통해 미리 확인하여 수정 및 추가 등의 보완 최종적으로 확인한 상태에서 출력한다. 복수의 엘이디전광판은 클라우드서버부에 무선으로 각각 연계되어 양방향으로 데이터 통신이 가능하 되, 복수의 엘이디전광판 중 클라우드서버부에 등록되는 엘이디전광판과 데이터 통신이 가능하 다. 엘이디전광판의 구동부는 무선으로 연계되는 입력부 중 PC, 리모컨, 휴대용 단말기를 통해 전원 이 온(ON)/오프(OFF)될 수 있다. 구체적으로 살펴보면, 엘이디전광판의 구동부는 복수의 엘이디(111a)를 온(ON)/오프(OFF)시키는 것으 로, 입력부 중 USB를 제외한 무선으로 연계가 가능한 PC, 리모컨, 휴대용 단말기를 이용하여 원격으로 복 수의 엘이디(111a)를 온(ON)/오프(OFF)시킬 수 있어 불필요한 전력 낭비를 최소화시킬 수 있다. 엘이디전광판은 아래에서 설명하게 되는 제어부에 의해 스케줄러된 콘텐츠가 출력되어 심미감을 사람 들에게 제공한다. 엘이디전광판은 인터넷 등 연결이 가능하면 원격으로 관리가 가능한 장점이 있다. 입력부는 PC, 리모컨, USB, 휴대용 단말기로 이루어지되, 편집기능이 가능하게 이루어지고, 엘이디전광판 의 구동부와 무선으로 연계되어 엘이디전광판을 통해 출력되는 콘텐츠를 입력한다. 입력부는 PC, 리모컨, USB, 휴대용 단말기로 이루어져 1 대 1 방식 및 무선방식으로 폰트, 기호, 이미지, 동영상 등과 같은 콘텐츠를 입력한다. 입력부는 편집 프로그램을 통해 꽃축제, 과일축제 등의 지역 행사, 폭우, 폭설 등의 기상 특보에 맞춰 폰 트, 기호, 이미지, 동영상 등 콘텐츠를 신속하게 편집이 가능하다. PC, 리모컨, USB, 휴대용 단말기로 이루어지는 입력부는 고장시 다른 입력부로 신속하게 대체가 가능하다. 이를 테면 입력부 중 PC를 이용하여 엘이디전광판의 출력내용을 입력하는 과정에서 PC 입력부가 고장 나면 휴대용 단말기 입력부로 입력을 대체하여 신속하게 처리하는 것이다.구체적으로 살펴보면, 입력부는 수신되는 신호에 따라 선택적으로 동작하는 PC 제어모드, 리모컨 제어모드, USB 제어모드, 휴대용 단말기 제어모드 중 어느 하나의 제어모드 고장시 다른 제어모드로 대체가 가 능하다. 본 발명은 입력부를 PC, 리모컨, USB, 휴대용 단말기로 이루어지는 것으로 예시하고 있으나 경우에 따라 서 입력할 수 있다면 다른 수단으로도 이루어질 수 있다. 입력부는 엘이디전광판을 통해 출력되는 콘텐츠가 출력되는 환경이나 시간 등으로 인해 편집 프로그 램의 편집을 통해 아래에서 설명하게 되는 클라우드서버부에 저장(업로드)된다. 입력부에서 편집된 콘텐츠를 클라우드서버부에 업로드가 가능하다. 클라우드서버부는 복수의 엘이디전광판이나 입력부와 무선으로 연계되어 양방향으로 데이터 통 신이 가능하고, 엘이디전광판에 출력되는 콘텐츠와 입력부에 입력하는 콘텐츠를 저장 및 공유한다. 클라우드서버부는 엘이디전광판에 출력되는 콘텐츠, 입력부에서 입력하는 콘텐츠 등을 충분히 저장할 수 있도록 대용량으로 이루어진다. 전원부는 엘이디전광판와 회로적으로 연결되어 구동을 위한 전원을 공급한다. 전원부는 외부 전원(예를 들어 220V)과 연결되고, 전광판프레임 내에 설치되며, 엘이디전광판 및 아래에서 설명하게 되는 제어부와 회로적으로 연결되어 엘이디전광판 시스템의 구동을 위한 직류 전원을 공급한다. 본 발명의 전원부는 교류 전원을 입력받아 이를 정류하여 직류 전원으로 변환시켜 공급하는 것으로, 직류 전원을 공급할 수 있는 것이라면 다른 종류로도 변환이 가능하다. 엘이디전광판, 제어부 중 어느 하나에 전원부로부터 공급되는 전원이 비정상적이면 전원부(14 0)로부터 정상적으로 전원이 공급되는 다른 하나에서 전원이 공급된다. 구체적으로 살펴보면, 전원부는 엘이디전광판과 제어부와 회로적으로 연결되는 것으로, 전원부 로부터 전원을 각각 공급받는 엘이디전광판과 제어부 중 엘이디전광판에 예기치 않은 상황 으로 인해 비정상적으로 즉, 전원이 정상적으로 공급되지 않을 경우 정상적으로 전원이 공급되는 제어부에 서 구동이 가능할 정도의 전원이 엘이디전광판에 공급된다. 제어부에서 엘이디전광판에 공급되는 전원은 임시이므로 엘이디전광판 관리자는 신속하게 대처해야 한다. 엘이디전광판 관리자는 전원부로부터 정상적으로 전원이 공급되지 않는 엘이디전광판, 제어부에 대해 임시로 신속하게 대처할 뿐만 아니라 네트워크에서 연결되는 복수의 엘이디전광판을 검색하여 해당 엘이디전광판으로 광고 및 리소스를 전송할 수 있다. 제어부는 복수의 엘이디전광판, 클라우드서버부, 전원부에 연계되고, 복수의 엘이디전광판 을 개별이나 그룹으로 제어가 가능하며, 복수의 엘이디전광판, 클라우드서버부, 전원부를 원격으로 관리가 가능하다. 구체적으로 살펴보면, 제어부는 복수의 엘이디전광판을 개별이나 그룹으로 제어가 가능한 구성으로, 하나의 콘텐츠를 개별이나 그룹 전체에 출력하도록 하거나 복수의 콘텐츠를 개별이나 그룹별로 출력하도록 한다. 제어부는 엘이디전광판의 전체적인 제어를 한다. 구체적으로 살펴보면, 제어부는 전광판프레임 내에 설치되고, 엘이디(111a)와 FPCB와 같은 수단으로 회로적으로 연결되며, 엘이디전광판 시스템을 운용하기 위한 운용프로그램이 탑재되어 있어 엘이디전광판 시스템의 운용관리, 엘이디(111a)를 통해 출력되는 출력정보 관리 등 운용을 위한 전체적인 제어를 원격으 로 담당한다. 제어부는 클라우드서버부에 저장된 다양한 콘텐츠를 엘이디전광판에 선택을 통해 출력할 수 있 도록 하고, 전원부의 전원을 제어하여 불필요한 전원 낭비를 최소화시킨다. 제어부는 무선신호를 이용하는 무선 통신 수단을 더 포함하여 사용자에 의해 엘이디전광판 시스템이 무선으로 제어될 수 있도록 한다. 제어부는 입력부의 PC, 리모컨, USB, 휴대용 단말기 중 수신되는 신호에 따라 제어모드로 선택하여 동작시킨다. 제어부는 PC와 데이터 통신을 위한 데이터 송수신부와, 리모컨으로부터 신호를 입력받기 위한 적외선 신호 수신부와, USB와 데이터를 받기 위한 데이터 수신부 및 휴대용 단말기로부터 신호를 입력받기 위한 신호 수신부 를 각각 구비하고, 데이터 송수신부로 신호가 입력되면 PC 제어모드로, 적외선 신호 수신부로 신호가 입력되면 리모컨 제어모드로, 데이터 수신부로 신호가 입력되면 USB 제어모드로, 신호 수신부로 신호가 입력되면 휴대용 단말기 제어모드로 각각 동작한다. 제어부는 PC, 리모컨, USB 및 휴대용 단말기에서 신규 출력 데이터를 입력받아 업데이트 및 저장이 가능하 다. PC와 데이터 통신을 위해 구비하는 제어부의 데이터 송수신부와 휴대용 단말기로부터 신호를 입력받기 위 해 구비되는 제어부의 신호 수신부는 와이파이(Wi-Fi), 블루투스(Bluetooth)로 이루어진다. PC와 데이터 통신을 위해 구비하는 제어부의 데이터 송수신부는 범용 비동기화 송수신부이다. 범용 비동기화 송수신부는 \"RS232C\" 라고 일컫는 것으로, PC와 직접 연결이 되어 PC와 시리얼 통신을 한다. 제어부는 풀 칼라 HDMI로 이루어진다. 제어부는 엘이디전광판의 복수의 엘이디 픽셀패널 중 수명이 다하거나 고장난 엘이디 픽셀패널 이 확인되면 해당 엘이디 픽셀패널에 공급되는 전원을 차단하거나 엘이디 발광신호를 통해 관리자에게 알린다. 제어부는 복수의 엘이디 픽셀패널마다 구비되는 센서에 의해 복수의 엘이디 픽셀패널의 수명과 고장여부를 확인하여 전원을 차단하거나 발광신호를 통해 관리자에게 알려 수명과 고정여부에 대해 신속하게 대 처하도록 한다. 필터링부는 엘이디전광판나 클라우드서버부에 구비되어 엘이디전광판를 통해 출력되는 내 용이거나 클라우드서버부에 저장되는 내용 중 불건전한 내용을 필터링한다. 필터링부는 인공지능(AI,Artifical Intelligence)를 이용하여 엘이디전광판를 통해 출력되는 내용이 거나 클라우드서버부에 저장되는 내용 중 불건전한 내용을 자동으로 필터링한다. 인공지능(AI)은 ‘학습’을 기반으로 구현되는 것으로, 학습 정도에 따라 기계학습(머신러닝), 심화학습(딥러닝) 등으로 구분지으며, 컴퓨터 학습은 대용량 서버로 구성된 클라우드 인프라에서 이루어지고 있 고, 인공지능(AI)은 스마트폰, 테블릿 등 스마트기기에서 수집한 정보를 분석 후 다시 기기에서 받는 방식으로 진행된다. 이상에서는 본 발명을 바람직한 실시 예에 의거하여 설명하였으나, 본 발명의 기술적 사상은 이에 한정되지 아 니하고, 청구항에 기재된 범위 내에서 변형이나 변경 실시가 가능함은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명백한 것이며, 그러한 변형이나 변경은 첨부된 특허청구범위에 속한다 할 것이다."}
{"patent_id": "10-2021-0058203", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 콘텐츠 공유가 가능한 엘이디전광판 시스템의 일 실시예의 블록도, 도 2는 도 1에 따른 필터링부가 더 포함된 상태를 나타내는 블록도, 도 3은 도 1에 따른 엘이디전광판이 건물에 설치되는 상태를 나타내는 사시도, 도 4는 도 1에 따른 엘이디전광판의 구성을 나타내는 사시도, 도 5는 도 1에 따른 제어부가 복수의 엘이디전광판을 개별적으로 제어하는 상태를 나타내는 도면, 도 6은 도 1에 따른 제어부가 복수의 엘이디전광판을 그룹으로 제어하는 상태를 나타내는 도면."}
