{"patent_id": "10-2021-0031791", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0127469", "출원번호": "10-2021-0031791", "발명의 명칭": "전자 장치 및 그 케이스 장치", "출원인": "삼성전자주식회사", "발명자": "허세윤"}}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,외부 전자 장치의 적어도 일부를 수용할 수 있는 형상을 구비하는 하우징;상기 하우징의 일부 영역에 형성된 개구부; 상기 개구부의 적어도 일부를 개방 또는 폐쇄하도록 상기 하우징에 슬라이딩 가능하게 부착된 덮개부; 상기 덮개부의 일 영역에 부착된 발광부; 상기 외부 전자 장치와 통신하기 위한 통신 인터페이스; 및상기 발광부 및 상기 통신 인터페이스와 작동적으로 연결된 컨트롤러;를 포함하고,상기 덮개부는, 슬라이딩에 의해 상기 개구부가 개방된 상태에서 상기 외부 전자 장치의 적어도 하나의 후면 카메라를 노출하도록 구성되며, 상기 컨트롤러는 상기 덮개부의 개폐 여부에 기초하여 상기 외부 전자 장치와의 통신을 통해 상기 발광부의 동작을 제어하도록 설정된, 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 덮개부는, 슬라이딩에 의해 상기 개구부가 개방된 상태에서 상기 외부 전자 장치의 카메라 모듈의 적어도일부를 노출하고, 상기 외부 전자 장치의 장치 플래쉬를 폐쇄하도록 구성된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 덮개부의 상기 발광부가 부착된 상기 일 영역 외곽에 부착된 반사부를 더 포함하고,상기 반사부는 상기 외부 전자 장치의 상기 플래쉬로부터 방출된 광이 입사 및 반사되도록 구성된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 반사부는 원형 형태로 구성된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 외부 전자 장치로부터 전원을 공급받아 상기 발광부 및 상기 컨트롤러에 공급하는 전원 공급부를 더 포함하는 전자 장치. 공개특허 10-2022-0127469-3-청구항 6 제1항에 있어서,상기 덮개부는, 상기 하우징의 상하 또는 좌우 중 하나의 방향으로 슬라이딩되도록 상기 하우징에 부착되어 상기 개구부를 개폐하도록 구성된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 덮개부의 개폐를 감지하는 센서를 더 포함하는 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 발광부는 복수의 발광 소자를 포함하며, 상기 컨트롤러는 상기 외부 전자 장치와의 통신에 기초하여 상기발광부의 광량을 조절하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "전자 장치에 있어서,하우징; 상기 하우징의 전면에 구비되는 적어도 하나의 전면 카메라 및 상기 하우징의 후면에 구비되는 적어도 하나의후면 카메라 및 장치 플래쉬; 상기 하우징의 상기 전면에 부착된 디스플레이; 및상기 적어도 하나의 전면 카메라, 상기 적어도 하나의 후면 카메라, 상기 장치 플래쉬 및 상기 디스플레이를 제어하는 프로세서;를 포함하고,상기 프로세서는: 상기 하우징의 후면 및 측면의 적어도 일부를 수용하고, 상기 적어도 하나의후면 카메라를 노출하는 개구부를 포함하며, 상기 개구부의 적어도 일부 영역을 개폐하여 상기 적어도 하나의 후면 카메라를 개방 또는 폐쇄하도록 슬라이딩 가능하게 부착된 덮개부 및 상기 덮개부의 일부 영역에 부착된 발광부를 포함하는케이스 장치가 장착되면, 상기 케이스 장치의 상기 덮개부의 개폐 여부에 기초하여 상기 케이스 장치와의 통신을 통해 상기 장치 플래쉬또는 상기 발광부의 동작을 선택적으로 제어하도록 설정된, 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 프로세서는, 상기 케이스 장치의 상기 덮개부가 개방되는 것을 확인하면, 상기 적어도 하나의 후면 카메라를 활성화시키도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2022-0127469-4-제10항에 있어서,상기 프로세서는, 상기 적어도 하나의 후면 카메라로부터 입력되는 프리뷰 이미지를 상기 디스플레이에 표시하고, 상기 장치 플래쉬 또는 상기 발광부를 선택적으로 동작시키기 위한 메뉴 아이콘을 상기 디스플레이에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서,상기 프로세서는, 상기 케이스 장치의 상기 덮개부가 폐쇄된 상태에서, 카메라 앱이 실행되면 상기 전면 카메라를 활성화하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 전면 카메라가 활성화된 상태에서 상기 적어도 하나의 후면 카메라로의 전환 명령을 수신하면, 상기 덮개부가 폐쇄되어 있음을 표시하는 알림을 상기 디스플레이에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서,상기 프로세서는, 상기 케이스 장치의 상기 덮개부가 폐쇄된 상태에서, 상기적어도 하나의 후면 카메라에 대한활성화 명령을 수신하면, 상기 덮개부가 폐쇄되어 있음을 표시하는 알림을 상기 디스플레이에 표시하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제9항에 있어서,상기 프로세서는, 지정된 앱의 실행에 따른 알림이 발생하면 상기 장치 플래쉬를 턴온하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제9항에 있어서,음량을 업 또는 다운시키기 위한 볼륨 키를 더 포함하고,상기 프로세서는, 상기 발광부 동작 중 상기 볼륨 키에 대한 업 또는 다운 명령을 수신하면, 상기 발광부의 광량을 조절하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제9항에 있어서,상기 프로세서는, 지정된 앱이 실행되는 경우, 상기 덮개부가 개방된 상태로확인되면 상기 덮개부가 개방된 상태임을 표시하는 알림을 상기 디스플레이에 표시하도록 설정된 전자 장치. 공개특허 10-2022-0127469-5-청구항 18 제9항에 있어서,상기 프로세서는 플래쉬 아이콘을 상기 디스플레이에 표시하고, 상기 플래쉬아이콘이 선택되면, 상기 케이스 장치와의 통신을 통해 상기 발광부가 동작하도록 제어하는 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제9항에 있어서,배터리를 더 포함하고,상기 프로세서는 상기 배터리의 전력을 상기 케이스 장치로 공급하도록 제어하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제9항에 있어서,센서 모듈을 더 포함하고,상기 프로세서는 상기 센서 모듈의 센싱 신호에 기초하여 상기 덮개부의 개폐를 확인하도록 설정된 전자 장치."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시 예에 따른 케이스 장치는, 외부 전자 장치의 적어도 일부를 수용할 수 있는 형상 을 구비하는 하우징, 상기 하우징의 일부 영역에 형성된 개구부, 상기 개구부의 적어도 일부를 개방 또는 폐쇄하 도록 상기 하우징에 슬라이딩 가능하게 부착된 덮개부, 상기 덮개부의 일 영역에 부착된 발광부, 상기 외부 전자 장치와 통신하기 위한 통신 인터페이스, 및 상기 발광부 및 상기 통신 인터페이스와 작동적으로 연결된 컨트롤러 를 포함하고, 상기 덮개부는, 슬라이딩에 의해 상기 개구부가 개방된 상태에서 상기 외부 전자 장치의 적어도 하 나의 후면 카메라를 노출하도록 구성되며, 상기 컨트롤러는 상기 덮개부의 개폐 여부에 기초하여 상기 외부 전자 장치와의 통신을 통해 상기 발광부의 동작을 제어하도록 설정될 수 있다."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들은, 전자 장치 및 그 케이스 장치에 관한 것으로, 예를 들어 전자 장치에 장 착되는 케이스 장치, 및 장착된 케이스 장치와 연동하여 동작을 제어하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기술의 발달과 함께 전자 장치는 손쉽게 휴대할 수 있도록 크기가 작아지면서, 사용자 니즈에 따라 다양한 사용 형태로 다양한 기능을 수행할 수 있도록 진화하고 있다. 휴대하는 전자 장치의 특성상 전자 장치의 외관을 보호 하고 심미감 향상을 위해 다양한 보호 케이스가 사용되고 있다."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "최근에는 스마트폰과 같은 전자 장치에서 카메라의 비중이 높아지면서 카메라가 돌출하는 경향이 있으며 카메라 가 차지하는 면적도 넓어지는 추세이다. 이러한 스마트폰에서 카메라를 보호하기 위한 다양한 형태의 케이스가 제안되고 있다. 본 문서에 개시된 다양한 실시예들은 전자 장치의 외관을 보호하는 기능 이외에도 전자 장치와 연동하여 동작하 는 케이스 장치 및 그 전자 장치를 제공하기 위한 것이다. 본 개시에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시 예에 따른 케이스 장치는, 외부 전자 장치의 적어도 일부를 수용할 수 있는 형상 을 구비하는 하우징; 상기 하우징의 일부 영역에 형성된 개구부; 상기 개구부의 적어도 일부를 개방 또는 폐쇄 하도록 상기 하우징에 슬라이딩 가능하게 부착된 덮개부; 상기 덮개부의 일 영역에 부착된 발광부; 상기 외부 전자 장치와 통신하기 위한 통신 인터페이스; 및 상기 발광부 및 상기 통신 인터페이스와 작동적으로 연결된 컨트롤러;를 포함하고, 상기 덮개부는, 슬라이딩에 의해 상기 개구부가 개방된 상태에서 상기 외부 전자 장치의 적어도 하나의 후면 카메라를 노출하도록 구성되며, 상기 컨트롤러는 상기 덮개부의 개폐 여부에 기초하여 상기 외부 전자 장치와의 통신을 통해 상기 발광부의 동작을 제어하도록 설정될 수 있다. 다양한 실시예에 따른 전자 장치는, 하우징; 상기 하우징의 전면에 구비되는 적어도 하나의 전면 카메라 및 상 기 하우징의 후면에 구비되는 적어도 하나의 후면 카메라 및 장치 플래쉬; 상기 하우징의 상기 전면에 부착된 디스플레이; 및 상기 전면 카메라, 적어도 하나의 후면 카메라, 상기 장치 플래쉬 및 상기 디스플레이를 제어하 는 프로세서를 포함하며, 상기 프로세서는, 상기 하우징의 후면 및 측면의 적어도 일부를 수용하고, 상기 적어 도 하나의후면 카메라를 노출하는 개구부를 포함하며, 상기 개구부의 적어도 일부 영역을 개폐하여 상기 적어도 하나의 후면 카메라를 개방 또는 폐쇄하도록 슬라이딩 가능하게 부착된 덮개부 및 상기 덮개부의 일부 영역에 부착된 발광부를 포함하는 케이스 장치가 장착되면, 상기 케이스 장치의 상기 덮개부의 개폐 여부에 기초하여 상기 케이스 장치와의 통신을 통해 상기 장치 플래쉬 또는 상기 발광부의 동작을 선택적으로 제어할 수 있다."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따르면, 전자 장치에 장착되어 전자 장치와 연동하여 동작할 수 있는 케이스 장치 및 그 제어 방법을 제공할 수 있다. 다양한 실시 예에 따르면, 전자 장치와 연동하여 동작하는 케이스 장치를 제공함으로써 전자 장치의 외관 보호 기능 외에도 전자 장치의 기능을 확장 또는 보완할 수 있는 다양한 기능을 제공할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2021-0031791", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전 자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈 , 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연 결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입 자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어 떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래쉬들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhancedmobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. . 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다.본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 2a는 본 발명의 다양한 실시예에 따른 전자 장치(예: 도 1의 전자 장치) 및 이에 장착되는 케이스 장치의 분리 사시도이다. 도 2b 및 도 2c는 본 발명의 다양한 실시예에 따른 전자 장치가 장착된 케 이스 장치의 후면도이다. 도 2a, 도 2b 및 도 2c를 참고하면, 케이스 장치는 하우징를 포함할 수 있다. 다양한 실시예에 따르 면, 케이스 장치의 하우징은 예를 들면 크래들(cradle) 형상으로 구현될 수 있으며, 전자 장치 의 후면 및 측면의 적어도 일부를 수용할 수 있는 형상으로 구현될 수 있다. 다양한 실시예에 따르면 하우징은 플레이트부 및 플레이트부의 가장자리의 적어도 일부로부터 수직한 방향으로 연장된 측면부를 포함할 수 있다. 일 실시예에 따르면, 측면부는 전자 장치의 측면의 적어도 일부와 대응하는 형상으로 형성될 수 있다. 일 실시예에 따르면, 측면부는 곡형으로 형성될 수 있다. 일 실시예에 따르면, 케이스 장치의 하우징의 적어도 일부는 폴리머 및/또는 금속 소재로 형성될 수 있다. 예를 들면, 하우징의 적어도 일부는 금속 소재, GFRP, CFRP, 러버, 실리콘, PC, PC_ABS 또는 PC_FG 중 적어도 하나의 소재로 형성될 수 있다. 일 실시예에 따르면, 케이스 장치의 하우징의 플레이트부의 일부에는 전자 장치의 카메라 영역과 대응하는 크기 및/또는 형상으로 개구부가 형성될 수 있다. 일 실시예에 따르면, 개구부 외부에는 슬라이딩이 가능한 덮개부가 장착될 수 있다. 일 실시예에 따르면, 덮개부는 슬라이딩되어 폐쇄되면 개구부 전체를 덮어 가림으로써, 전자 장치의 카메라 영역이 노출되지 않도록 하고, 슬라이딩되어 개방되면 개구부의 적어도 일부 영역을 외부로 노출하여, 전자 장치의 카메라 영역 의 적어도 일부가 외부로 노출되도록 할 수 있다. 일 실시예에 따르면 덮개부는 슬라이딩되어 개방되 면, 전자 장치의 카메라 영역의 후면 카메라들(예: 도 2b의 카메라(241, 242, 243 및/또는 244)이 외부로 노출되도록 할 수 있다. 일 실시예에 따르면 덮개부는 슬라이딩되어 개방되면, 전자 장치의 카메라 영역의 후면 카메라들(예: 도 2c의 카메라(245, 246 및/또는 247)이 외부로 노출되도록 할 수 있다. 일 실시예에 따르면, 덮개부는 발광부 및 반사부를 포함할 수 있다. 일 실시예에 따르면 발광부 는 복수의 발광 소자(예: LED)를 포함할 수 있으며 발광부가 차지하는 영역 내에 다수의 발광 소자를 예를 들면 매트릭스 형태로 배열하여 큰 광량을 확보하도록 구현할 수 있다. 일 실시예에 따르면 반사부는 빛의 투과성과 반사율이 높은 투명한 소재, 예를 들면 투명 PC 소재 또는 네 온(neon)을 함유한 투명 PC (polycarbonate) 소재로 구성될 수 있으며, 전자 장치의 플래쉬(예: 도 3a, 도 3b, 도 4a 또는 도 4b의 장치 플래쉬)로부터 방출된 광이 입사 및 반사되면서 발광 효과를 보다 강화할 수 있도록 구현될 수 있다. 도 2b에 도시된 바와 같이, 덮개부는 예를 들면 케이스 장치의 하우징의 세로 방향(A)으로 슬라 이딩되어 개방되거나, 도 2c에 도시된 바와 같이 가로 방향(B)으로 슬라이딩되어 개방되도록 구현될 수 있다. 일 실시예에 따르면 덮개부의 형상 및/또는 슬라이딩 방향은 전자 장치의 카메라 영역의 크기, 위치, 복수의 카메라(241, 242, 243, 244, 245, 246 및/또는 247)의 배열 및/또는 장치 플래쉬의 위치에 따라 적절하게 구현될 수 있다. 다양한 실시예에 따르면, 전자 장치는 지정된 방향을 향하는 전면, 전면과 반대 방향을 향하는 후면 및 전면과 후면 사이의 공간을 둘러싸는 측면을 포함하는 측면 부재를 포함하는 하우징(예: 하우징 구조)을 포함할 수 있다. 한 실시예에 따르면, 전자 장치는, 실질적으로 전면 의 전체 영역을 통해 외부로부터 보일 수 있게 배치되는 디스플레이를 포함할 수 있다. 일 실시예에 따르면 전자 장치의 전면에는 전면 카메라가 배치될 수 있다. 일 실시예에 따르면 전자 장치 의 후면에는 복수의 후면 카메라들(241, 242, 243, 244, 245, 246 및/또는 247)과 장치 플래쉬(24 8)가 배치될 수 있다. 다양한 실시예에 따르면, 케이스 장치는 전자 장치의 적어도 일부를 수용할 수 있다. 일 실시예에 따 르면, 전자 장치는 크래들 형상의 케이스 장치의 하우징에 끼워지는 방식으로 고정될 수 있다. 일 실시예에 따르면 전자 장치는 케이스 장치의 하우징의 플레이트부와 측면부에 장 착되는 방식으로 고정될 수 있다. 예를 들면, 전자 장치는 후면이 케이스 장치의 하우징의 플레이트부와 대면하고, 측면의 적어도 일부가 케이스 장치의 하우징의 측면부에 타 이트하게 끼워짐으로써 케이스 장치에 고정될 수 있다. 다양한 실시예에 따르면, 전자 장치는 동작 상태에서, 센서 모듈(예: 도 1의 센서 모듈)을 통해 케이 스 장치의 덮개부의 개폐를 확인하거나 케이스 장치와의 통신에 기초하여 덮개부의 개폐를 확인할 수 있으며, 이에 기초하여 전자 장치 및 케이스 장치의 동작을 제어할 수 있다. 다양한 실시예에 따르면, 전자 장치는 비활성 상태(예: 저전력 모드 또는슬립 상태)에서 전자 장치의 장치 플래쉬 작동을 통해 사용자에게 알림을 제공할 수 있다. 다양한 실시예에 따르면, 케이스 장치는 전자 장치로부터 유선 및/또는 무선으로 연결되어, 전원을 공급받거나 데이터를 송수신할 수 있다. 도 3a 및 도 3b는 본 발명의 다양한 실시예에 따른 전자 장치가 장착된 케이스 장치의 후면도이다. 도 3c는 카 메라 촬영 대상 객체를 나타내는 도면이다. 일 실시예에 따르면, 케이스 장치의 하우징의 개구부에는 슬라이딩 가능한 덮개부가 장착 될 수 있다. 도 3a를 참조하면, 덮개부는 닫힌 상태에서 개구부 전체를 덮어 전자 장치의 카메라 영역 이 노출되지 않도록 할 수 있다. 일 실시예에 따르면, 덮개부는 반사부를 포함할 수 있다. 일 실시예에 따르면 반사부의 형태는 예를 들면 원형으로 구현될 수 있다. 일 실시예에 따르면 반사부는 빛의 투과성과 반사율이 높은 투명한 소재, 예를 들면 투명 PC 소재 또는 네온(neon)을 함유한 투명 PC (polycarbonate) 소재로 구성될 수 있으며, 전자 장치의 플래쉬(예: 도 3a, 도 3b, 도 4a 또는 도 4b의 장치 플래쉬)로부터 방출된 광이 입사 및 반사되면서 발광 효과를 보다 강화할 수 있도록 구현될 수 있다. 도 3b를 참조하면, 덮개부는 개방된 상태에서 개구부의 적어도 일부 영역을 외부로 노출하여 카메라 영역의 적어도 일부가 노출되도록 할 수 있다. 예를 들면 복수의 카메라(241, 242 및 243)가 개구부 의 덮개부(가 개방된 영역을 통해 외부로 노출되어 카메라 촬상 동작을 수행할 수 있다. 일 실시예에 따르 면 덮개부는 슬라이딩되어 개방된 상태에서도 여전히 전자 장치의 장치 플래쉬를 덮어 가리도록 구현될 수 있다. 일 실시예에 따르면, 발광 효과를 보다 강화할 수 있도록, 반사부의 위치는 덮개부 가 개방되었을 때 상기 반사부가 전자 장치의 플래쉬의 적어도 일부를 가릴 수 있도록 구현될 수 있다. 일 실시예에 따라 반사부의 형태가 원형으로 구현됨으로써, 장치 플래쉬로부터 방출된 광이 반사부 를 통과하여 원형 형상으로 발광함에 따라 도 3c에 도시된 바와 같이 촬영 대상 객체의 눈동자에 원형 형 상으로 빛의 띠 형태 (C)가 맺혀, 인물 사진 촬영시 보정 없이도 특수 효과를 발현하도록 할 수 있다. 도 4a 및 도 4b는 본 발명의 다양한 실시예에 따른 전자 장치가 장착된 케이스 장치의 후면도이다. 일 실시예에 따르면, 케이스 장치의 하우징에 형성된 개구부에는 슬라이딩 가능한 덮개부 가 장착될 수 있다. 도 4a를 참조하면, 덮개부는 하우징의 세로 아래쪽 방향(A)으로 슬라이딩되어 개방된 상태에서 개구 부 일부 영역을 노출하여 전자 장치의 카메라 영역의 일부가 노출되도록 할 수 있다. 일 실시예에 따르면, 덮개부가 개방되면 개구부를 통해 전자 장치의 복수의 후면 카메라(241, 242, 243 및 244)가 노출되어 촬상 동작을 수행할 수 있다. 일 실시예에 따르면, 덮개부는 발광부 및 반사부를 포함할 수 있다. 일 실시예에 따르면 반사부 는 덮개부의 발광부 외곽에 부착될 수 있다. 일 실시예에 따르면 반사부는 덮개부의 가장자리 둘레의 형상에 대응되는 형태로 부착될 수 있다. 일 실시예에 따르면 반사부의 형태는 예를 들면 원형, 사각형 또는 가장자리가 둥글게 처리된 사각형 형태로 구현될 수 있다. 일 실시예에 따르면 덮개부 는 슬라이딩되어 개방된 상태에서도, 덮개부는 여전히 전자 장치의 장치 플래쉬를 덮어 가리도 록 구현될 수 있다. 일 실시예에 따르면, 반사부의 위치는 덮개부가 개방되었을 때 상기 반사부(33 2)가 전자 장치의 플래쉬의 적어도 일부를 가릴 수 있도록 구현될 수 있다. 이에 따라 전자 장치 의 장치 플래쉬가 작동되어 광이 방출되면 방출된 광이 반사부로 입사 및 반사하여 발광 효과가 증대되도록 구현될 수 있다. 도 4b를 참조하면, 덮개부는 하우징의 가로 오른쪽 방향(A)으로 슬라이딩되어 개방된 상태에서 개구 부 일부 영역을 노출하여 전자 장치의 카메라 영역의 일부가 노출되도록 할 수 있다. 일 실시예에 따르면, 덮개부가 개방되면 개구부를 통해 복수의 카메라(245, 246 및 247)가 노출되어 촬상 동작을 수행할 수 있다. 일 실시예에 따르면, 덮개부는 발광부 및 반사부를 포함할 수 있다. 일 실시예에 따르면 반사부 는 덮개부의 가장자리를 따라 부착될 수 있다. 일 실시예에 따르면 반사부는 덮개부의 가 장자리 둘레의 형상에 대응되는 형태로 부착될 수 있다. 일 실시예에 따르면 반사부의 형태는 예를 들면 사각형 또는 가장자리가 둥글게 처리된 사각형 형태 또는 곡형으로 구현될 수 있다. 일 실시예에 따르면 덮개부는 슬라이딩되어 개방된 상태에서도 여전히 전자 장치의 장치 플래쉬(24 8)를 가리도록 구현될 수 있다. 일 실시예에 따르면, 반사부의 위치는 덮개부가 개방되었을 때 상기 반사부가 전자 장치의 플래쉬의 적어도 일부를 가릴 수 있도록 구현될 수 있다. 이에 따라 전자 장치의 장치 플래쉬가 작동되어 광이 방출되면 방출된 광이 반사부로 입사 및 반사하여 발광 효 과가 증대되도록 구현될 수 있다. 일 실시예에 따르면 반사부는 빛의 투과성과 반사율이 높은 투명한 소재, 예를 들면 투명 PC 소재 또는 네 온(neon)을 함유한 투명 PC (polycarbonate) 소재로 구성될 수 있으며, 전자 장치의 플래쉬로부터 방출된 광이 입사 및 반사되면서 발광 효과를 보다 강화할 수 있도록 구현될 수 있다. 도 5a 및 도 5b는 다양한 실시예에 따른 케이스 장치(예: 도 2a 내지 도 4b의 케이스 장치)와 전자 장치 (예: 도 2a의 전자 장치)의 구성을 나타내는 블록도이다. 다양한 실시예에 따르면, 케이스 장치는 전원 공급부, 통신 인터페이스, 컨트롤러(예: 마 이크로 컨트롤 유닛) 및 덮개부를 포함할 수 있다. 다양한 실시예에 따르면, 케이스 장치는 전원 공급부를 통해 전자 장치(예: 도 2a 및 도 2b의 전자 장치)와 무선 및/또는 유선으로 연결되어 전원을 공급받을 수 있다. 전원 공급부는 예를들어 교류 전 류를 공급받아 직류로 변환하고 직류로 변환된 전원을 동작 가능한 전압으로 변환하여 케이스 장치의 각 구성요소의 동작을 위해 공급할 수 있다. 다양한 실시예에 따르면, 케이스 장치는 통신 인터페이스를 통해 전자 장치와 무선 및/또는 유 선으로 연결되어 각종 데이터를 송수신할 수 있다. 일 실시예에 따르면 케이스 장치는 통신 인터페이스를 통해 전자 장치와 무선으로 연결되어 예 를 들면 NFC(near field communication), 무선 충전(예: Wireless Power Consortium) 및/또는 전자 결제(예: magnetic secure transmission) 기능을 제공할 수 있다. 일 실시예에 따르면 케이스 장치의 전원 공급부 및/또는 통신 인터페이스는 무선 안테나와 연결될 수 있으며, 무선 안테나를 통해 전자 장치와 무선으로 연결되어 전류를 공급받거나 데이터를 송수신할 수 있다. 일 실시예에 따르면 무선 안테나는 예를 들면 NFC, 무선 충전 및/또는 전자 결제 기능에 따른 무선 신호를 송신 및/또는 수신하기 위한 복수의 안테나 모듈 또는 패턴들을 포함할 수 있다. 예를 들면 무선 안테나는 도전체 또는 도전성 패턴으로 이루어진 방사체로 구현되는 안테나 및/또는 다른 부품(예: RFIC(radio frequency integrated circuit))으로 구성된 안테나를 포함하는 복수의 안테나들을 포함할 수 있다. 일 실시예에 따르면, 전원 공급부 및/또는 통신 인터페이스는, 복수의 안테나들 중 송신 및/또는 수신하고자 하는 신호 또 는 전력 통신 방식에 적합한 적어도 하나의 안테나를 선택하여 신호 또는 전력을 송신 또는 수신할 수 있다. 다양한 실시예에 따르면, 케이스 장치는 발광부를 포함할 수 있다. 일 실시예에 따르면, 발광부(33 1)는 케이스 장치의 플레이트부 상의 일 영역, 예를 들어 덮개부의 적어도 일부 영역에 부착될 수 있다. 일 실시예에 따르면, 발광부는 예를 들면 매트릭스 형태로 배치되어 면 발광체로 구현된 복수의 발광 소자(예: LED)를 포함할 수 있다. 다양한 실시예에 따르면, 케이스 장치는 반사부를 포함할 수 있다. 일 실시예에 따르면, 반사부(33 2)는 케이스 장치의 플레이트부 상의 일 영역, 예를 들어 덮개부의 일부 영역에 부착될 수 있다. 예를 들면, 반사부는 덮개부의 가장자리 둘레를 따라 원형, 사각형 또는 가장자리가 곡형인 사 각형의 형태로 부착될 수 있다. 일 실시예에 따르면 일 실시예에 따르면, 덮개부가 개방되면 전자 장치의 복수의 카메라(예: 도 2b 내지 도 4b의 카메라들(241, 242, 243, 244, 245, 246 및 247)가 노출되어 촬상 동작을 수행할 수 있다. 일 실시예에 따르면, 덮개부가 슬라이딩 개방된 상태에서도, 덮개부는 전자 장치의 장치 플래쉬 (예: 도 4a 또는 도 4b의 장치 플래쉬)를 덮어 가리도록 구현될 수 있다. 이에 따라 전자 장치의 장 치 플래쉬가 작동되어 광이 방출되면 방출된 광이 반사부로 입사 및 반사하여 발광 효과가 증대되도 록 구현될 수 있다. 다양한 실시예에 따르면, 케이스 장치는 덮개부의 개폐를 감지하기위한 센서를 포함할 수 있다. 일 실시예에 따르면 센서는 덮개부의 이동에 따라 예를 들면 자기장 변화를 감지하여 개폐를 감지할 수 있는 홀 센서(또는 마그네틱 센서), 근접 센서 및/또는 이미지 센서를 포함할 수 있다. 일 실시예에 따르면, 케이스 장치는 센서를 통해 덮개부의 개폐를 감지하고 개폐 여부를 통신 인터페이스를 통 해 전자 장치에 전달하도록 구현될 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 1의 전자 장치)는 센서 모듈(예: 도 1의 센서 모듈(17 6))의 예를 들면, 마그네틱 센서, 전자기 공명 방식(electro-magnetic resonance) 센서, 또는 근접 센서, 카메 라 모듈(예: 도 1의 카메라 모듈)의 적어도 하나의 이미지 센서(예: 전면 카메라), 및/또는 디스플레이 모 듈(예: 도 1의 디스플레이 모듈)의 터치를 감지하도록 설정된 터치 센서에 의한 터치(또는 호버링) 인식에 의해, 상기 케이스 장치의 덮개부의 개폐를 감지하도록 구현될 수도 있다. 일 실시예에 따르면, 케이스 장치의 구성 요소 중 일부 구성 요소 및/또는 일부 구성 요소의 적어도 일부 기능은 단일 칩으로 구현될 수 있다. 예를 들어 전원 공급부, 통신 인터페이스 및/또는 컨트롤 러의 기능 중 적어도 일부는 단일 칩에 포함될 수 있다. 다양한 실시예에 따르면, 컨트롤러는 케이스 장치의 구성 요소들을 제어하고 통신 인터페이스를 통해 전자 장치와 통신하여 발광부의 동작을 제어할 수 있다. 일 실시예에 따르면 컨트롤러는 발광부의 제어를 위해 별도의 구동부(미도시)를 포함할 수 있다. 일 실시예에 따르면, 케이스 장치는 컨트롤러에 의한 발광부의 동작 제어 신호를 발광부로 전송하기 위한 와이어를 포함할 수 있다. 일 실시예에 따르면 컨트롤러는 센서에 의해 발생된 센서 신호를 와이어를 통해 수신할 수 있다. 다양한 실시예에 따르면, 전자 장치는 메모리(예: 도 1의 메모리), 프로세서(예: 도 1의 프로세서), 통신 모듈(예: 도 1의 통신 모듈), 카메라 모듈(예: 도 1의 카메라 모듈 ) 및/또는 배터리(예: 도 1의 배터리)를 포함할 수 있다. 다양한 실시예에 따르면, 메모리는 전자 장치의 프로세서가 케이스 장치와 연동하여 전자 장치의 구성 요소 및/또는 케이스 장치의 구성 요소를 제어하기 위한 인스트럭션들을 저장할 수 있다. 일 실시예에 따르면, 메모리는 통신 모듈로부터 수신된 명령 또는 데이터를 휘발성 메모리(예: 도 1 의 휘발성 메모리)에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터 를 비휘발성 메모리(예: 도 1의 비휘발성 메모리)에 저장할 수 있다. 다양한 실시예에 따르면, 전자 장치는 통신 모듈을 통해 케이스 장치와 무선 및/또는 유선 연결 하여 데이터를 송수신 할 수 있다. 일 실시예에 따르면 전자 장치의 통신 모듈은 케이스 장치의 통신 인터페이스와 제어 명령 을 포함하는 각종 데이터를 송수신 할 수 있다. 일 실시예에 따르면, 전자 장치는 배터리의 전력을 안테나 모듈(예: 도 1의 안테나 모듈)을 통 해 케이스 장치로 전달할 수 있으며, 케이스 장치는 안테나를 통해 전력을 수신하여, 전원 공급 부를 통해 구성요소들에 공급할 수 있다. 다양한 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부의 개폐를 확인하 고, 이에 기초하여 카메라 모듈의 동작을 제어할 수 있다. 일 실시예에 따르면, 전자 장치의 카메라 모듈은 전자 장치의 전면에 배치되는 전면 카메라(예: 도 2a의 전면 카메라) 및/또는 전자 장치 의 후면에 배치되는 복수의 후면 카메라들(241, 242, 243, 244, 245, 246 및/또는 247)을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 개방됨을 확인 하면 카메라 모듈의 전면 카메라 및/또는 후면 카메라(241, 242, 243, 244, 245, 246 및/또는 247) 중 적어도 하나를 활성화할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 개방되면 카메라 모 듈의 후면 카메라(241, 242, 243, 244, 245, 246 및/또는 247) 중 적어도 하나를 활성화할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 닫힌 상태에서, 예 를 들면 카메라 앱이 실행됨에 따라, 카메라 모듈에 대한 활성화 명령을 수신하면, 전면 카메라를 우 선적으로 활성화하도록 구현될 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 닫힌 상태에서, 예 를 들면 카메라 앱이 실행된 이후, 카메라 모듈 중 전면 카메라가 아닌, 후면 카메라(241, 242, 243, 244, 245, 246 및/또는 247) 중 적어도 하나에 대한 활성화 명령 또는 전환 명령을 수신할 수 있다. 이경우 프 로세서는, 케이스 장치의 덮개부가 닫힌 상태임을, 예를 들면 디스플레이(예: 도 1의 디스플레 이 모듈)를 통해 안내하도록 할 수 있다. 이에 따라, 덮개부가 닫혀있는 상태에서, 사용자가 후면 카 메라를 사용하여 이미지를 촬상하고자 하는 경우, 덮개부를 슬라이딩 개방하도록 유도할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 개방된 상태에서 카 메라 모듈의 후면 카메라(241, 242, 243, 244, 245, 246 및/또는 247) 중 적어도 하나가 활성화되어 동작 하는 경우, 광량이 부족하거나 또는 사용자의 선택에 따라, 장치 플래쉬 또는 케이스 장치의 발광부 중 하나를 선택적으로 동작시킬 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 발광부의 광량을 예를 들면 사이드 볼륨 키를 통해 조절할 수 있다. 예를 들면 전자 장치의 프로세서는 케이스 장치의 덮개 부가 개방되거나 또는 닫힌 상태에서 발광부가 동작하여 광을 방출하는 동안, 예를 들면 사이드 볼륨 키를 통해 입력된 볼륨 업 또는 다운 명령을 케이스 장치의 통신 인터페이스를 통해 컨트롤러로 전달하고 전달된 명령에 따라 발광부의 광량을 조절하도록 할 수 있다. 일 실시예에 따르면, 전자 장치 의 프로세서는 지정된 앱의 실행에 따라 알림이 발생하는 경우 장치 플래쉬를 턴온하여 장치 플 래쉬로부터 방출된 광이 케이스 장치의 덮개부의 반사부로 입사 및 반사되면서 발광 효과 를 나타내도록 할 수 있다. 예를 들어 프로세서는 전화 앱을 통해 호가 수신됨에 따라, 사용자에게 수신 호가 발생하였음을 알리기 위해 장치 플래쉬를 턴온할 수 있다. 일 실시예에 따르면, 케이스 장치의 덮개부가 개방된 상태에서 카메라 앱이 실행되지 않는 경우 또는 다른 앱이 실행되는 경우, 프로세서는 덮개부가 개방된 상태임을, 예를 들면 디스플레이를 통해 안내하도록 할 수 있다. 이에 따라, 덮개부가 개방된 상태에서 예를 들면 호가 수신되는 경우, 사용자가 덮개부를 슬라이딩하여 닫도록 유도할 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 2a, 도 2b, 도 2c, 도 3a, 도 3b, 도 4a, 도 4b, 도 5a, 또는 도 5b의 케이스 장치)은, 외부 전자 장치(예: 도 1의 전자 장치, 또는 도 2a 또는 도 5b의 전자 장치 ) 의 적어도 일부를 수용할 수 있는 형상을 구비하는 하우징(예: 도 2a의 하우징); 상기 하우징의 일 부 영역에 형성된 개구부(예: 도 2a 또는 도 2b의 개구부); 상기 개구부의 적어도 일부를 개방 또는 폐쇄 하도록 상기 하우징에 슬라이딩 가능하게 부착된 덮개부(예: 도 2a, 도 2b, 도 2c, 도 3a, 도 3b, 도 4a, 도 4b, 도 5a, 또는 도 5b의 덮개부); 상기 덮개부의 일 영역에 부착된 발광부(예: 도 2b, 도 2c, 도 3a, 도 3b, 도 4a, 도 4b, 도 5a, 또는 도 5b의 발광부); 상기 외부 전자 장치와 통신하기 위한 통신 인터페이스 (예: 도 5b의 통신 인터페이스); 및 상기 발광부 및 상기 통신 인터페이스와 작동적으로 연결된 컨트롤러 (예: 도 5b의 컨트롤러);를 포함하고, 상기 덮개부는, 슬라이딩에 의해 상기 개구부가 개방된 상태에서 상 기 외부 전자 장치의 적어도 하나의 후면 카메라(예: 도 2a, 도 2b, 도 3a, 도 3b, 도 4a 또는 도 4b의 카메라 들(241, 242, 243, 244, 245, 246 및 247) 또는 도 5b의 카메라 모듈)를 노출하도록 구성되며, 상기 컨트 롤러는 상기 덮개부의 개폐 여부에 기초하여 상기 외부 전자 장치와의 통신을 통해 상기 발광부의 동작을 제어 하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 덮개부는, 슬라이딩에 의해 상기 개구부가 개방된 상태에서 상기 외부 전자 장치 의 카메라 모듈의 적어도 일부를 노출하고, 상기 외부 전자 장치의 장치 플래쉬(예: 도 3b, 도 4a, 도 4b 또는 도 5b의 플래쉬)를 폐쇄하도록 구성될 수 있다. 다양한 실시예에 따르면, 상기 덮개부의 상기 발광부가 부착된 상기 일 영역 외곽에 부착된 반사부(예: 도 2b, 도 2c, 도 3a, 도 3b, 도 4a, 도 4b, 또는 도 5a의 반사부)를 더 포함하고, 상기 반사부는 상기 외부 전자 장치의 상기 플래쉬로부터 방출된 광이 입사 및 반사되도록 구성될 수 있다. 다양한 실시예에 따르면, 상기 반사부는 원형 형태로 구성될 수 있다. 다양한 실시예에 따르면, 전자 장치는 상기 외부 전자 장치로부터 전원을 공급받아 상기 발광부 및 상기 컨트롤 러에 공급하는 전원 공급부(예: 도 5b의 전원 공급부)를 더 포함할 수 있다. 다양한 실시예에 따르면, 상기 덮개부는, 상기 하우징의 상하 또는 좌우 중 하나의 방향으로 슬라이딩되도록 상 기 하우징에 부착되어 상기 개구부를 개폐하도록 구성될 수 있다. 다양한 실시예에 따르면, 전자 장치는, 상기 덮개부의 개폐를 감지하는 센서(예: 도 5b의 센서)를 더 포함 할 수 있다. 다양한 실시예에 따르면, 상기 발광부는 복수의 발광 소자를 포함하며, 상기 컨트롤러는 상기 외부 전자 장치와 의 통신에 기초하여 상기 발광부의 광량을 조절하도록 설정될 수 있다. 다양한 실시예에 따르면, 전자 장치(예: 도 1의 전자 장치, 또는 도 2a 또는 도 5b의 전자 장치)는, 하우징(예: 도 2a의 하우징; 상기 하우징의 전면에 구비되는 적어도 하나의 전면 카메라(예: 도 2a의 전면 카메라) 및 상기 하우징의 후면에 구비되는 적어도 하나의 후면 카메라(예: 도 2a, 도 2b, 도 3a, 도 3b, 도 4a 또는 도 4b의 카메라들(241, 242, 243, 244, 245, 246 및 247)) 및 장치 플래쉬 (예: 도 3b, 도 4a, 도 4b 또는 도 5b의 플래쉬); 상기 하우징의 상기 전면에 부착된 디스플레이(예: 도 2a의 디스플레이); 및 상기 하우징의 후면 및 측면의 적어도 일부를 수용하고, 상기 적어도 하나의후면 카메라를 노출하는 개구부 를 포함하며, 상기 개구부의 적어도 일부 영역을 개폐하여 상기 적어도 하나의 후면 카메라를 개방 또는 폐쇄하 도록 슬라이딩 가능하게 부착된 덮개부 및 상기 덮개부의 일부 영역에 부착된 발광부를 포함하는 케이스 장치 (예: 도 2a, 도 2b, 도 2c, 도 3a, 도 3b, 도 4a, 도 4b, 도 5a, 또는 도 5b의 케이스 장치)가 장착되면, 상기 케이스 장치의 상기 덮개부의 개폐 여부에 기초하여 상기 케이스 장치와의 통신을 통해 상기 장치 플래쉬 또는 상기 발광부의 동작을 선택적으로 제어하는 프로세서를 포함할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 케이스 장치의 상기 덮개부가 개방되는 것을 확인하면, 상기 적어도 하나의 후면 카메라를 활성화시키도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 적어도 하나의 후면 카메라로부터 입력되는 프리뷰 이미지를 상기 디스플레이에 표시하고, 상기 장치 플래쉬 또는 상기 발광부를 선택적으로 동작시키기 위한 메뉴 아이콘을 상기 디스플레이에 표시하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 케이스 장치의 상기 덮개부가 폐쇄된 상태에서, 카메라 앱이 실행되면 상기 전면 카메라를 활성화하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 전면 카메라가 활성화된 상태에서 상기 적어도 하나의 후면 카메라로의 전환 명 령을 수신하면, 상기 덮개부가 폐쇄되어 있음을 표시하는 알림을 상기 디스플레이에 표시하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 케이스 장치의 상기 덮개부가 폐쇄된 상태에서, 상기적어도 하 나의 후면 카메라에 대한 활성화 명령을 수신하면, 상기 덮개부가 폐쇄되어 있음을 표시하는 알림을 상기 디스 플레이에 표시하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 지정된 앱의 실행에 따른 알림이 발생하면 상기 장치 플래쉬를 턴온 하도록 설정될 수 있다. 다양한 실시예에 따르면, 전자 장치는 음량을 업 또는 다운시키기 위한 볼륨 키를 더 포함하고, 상기 프로세서 는, 상기 발광부 동작 중 상기 볼륨 키에 대한 업 또는 다운 명령을 수신하면, 상기 발광부의 광량을 조절하도 록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 지정된 앱이 실행되는 경우, 상기 덮개부가 개방된 상태로확인되면 상기 덮개부가 개방된 상태임을 표시하는 알림을 상기 디스플레이에 표시하도록 설정될 수 있다. 다양한 실시예에 따르면, 상기 프로세서는 플래쉬 아이콘을 상기 디스플레이에 표시하고, 상기 플래쉬아이콘이 선택되면, 상기 케이스 장치와의 통신을 통해 상기 발광부가 동작하도록 제어할 수 있다. 다양한 실시예에 따르면, 전자 장치는 배터리를 더 포함하고, 상기 프로세서는 상기 배터리의 전력을 상기 케이 스 장치로 공급하도록 제어하도록 설정될 수 있다. 다양한 실시예에 따르면, 전자 장치는, 센서 모듈을 더 포함하고, 상기 프로세서는 상기 센서 모듈의 센싱 신호 에 기초하여 상기 덮개부의 개폐를 확인하도록 설정될 수 있다. 도 6은 다양한 실시예에 따른 케이스 장치(예: 도 2a 내지 도 5b의 케이스 장치)가 장착된 전자 장치(예: 도 2a 또는 도 5b의 전자 장치)의 제어 방법을 설명하기 위한 흐름도이다. 도 7a 내지 도 7d는 다양한 실 시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도면이다. 다양한 실시예에 따르면, 전자 장치의 프로세서(예: 도 5b의 프로세서)는 동작 601에서 케이스 장치 의 덮개부(예: 도 5a 및 도 5b의 덮개부)의 개방 여부를 확인할 수 있다. 일 실시예에 따르면, 프로세서는 케이스 장치와의 통신에 기초하여덮개부의 개방 여부를 확인할 수 있다. 예를 들어, 케이스 장치는 덮개부의 개폐를 감지하기 위한 센서를 통해 덮개부의 개방 여부를 확인하고 이를 통신 인터페이스(예: 도 도 5b의 통신 인터페이스)를 통해 전자 장치에 전달할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 닫힌 경우 도 7a에 도시된 바와 같이 별도의 동작 수행 없이 예를들면 홈 화면을 디스플레이(예: 도 1의 디스플레이 모듈 )을 통해 표시하도록 할 수 있다. 일 실시예에 따르면, 전자 장치는 센서 모듈(예: 도 1의 센서 모듈), 카메라 모듈(예: 도 1의 카메라 모듈) 및/또는 디스플레이 모듈(예: 도 1의 디스플레이 모듈)을 통해 케이스 장치의 덮개부 의 개방 여부를 확인할 수 있다. 다양한 실시예에 따르면, 케이스 장치의 덮개부가 개방된 경우, 전자 장치의 프로세서는 동작 603에서, 전자 장치의 후면에 배치된 복수의 후면 카메라들(241, 242, 243, 244, 245, 246 및/또는 247) 중 적어도 하나를 활성화하고 카메라 앱을 실행할 수 있다. 일 실시예에 따르면, 케이스 장치의 덮개부가 도 7b에 도시된 바와 같이 개방된 경우, 전자 장치 의 프로세서는 카메라 앱을 실행하고, 후면 카메라(241, 242, 243 및/또는 244)를 활성화하여, 프리 뷰 이미지를 디스플레이 화면에 표시할 수 있다. 다양한 실시예에 따르면, 전자 장치의 프로세서는 동작 605에서 플래쉬가 턴온되어야 하는지 확인할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 플래쉬를 턴온하는 사용자 입력에 따라 플래쉬 턴온 동 작을 수행하는 것으로 확인할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 예를 들면 센서 모듈에 의한 센서 값에 기초하여, 현재 광량이 부족한 경우 플래쉬 턴온 동작을 수행하는 것으로 확인할 수 있다. 일 실시예에 따르면, 케이스 장치의 덮개부가 도 7b에 도시된 바와 같이 개방된 경우, 전자 장치 의 프로세서는 카메라 앱의 실행에 따라 후면 카메라(241, 242, 243 및/또는 244)를 통해 입력되는 프리뷰 이미지를 디스플레이 화면에 표시하고, 화면 상단에 예를 들면 케이스 장치의 발광부 를 선택하여 턴온시킬 수 있는 메뉴 아이콘 및 장치 플래쉬를 선택하여 턴온시킬 수 있는 메뉴 아이콘를 표시할 수 있다. 다양한 실시예에 따르면, 플래쉬 턴온 동작 수행에 따라, 전자 장치의 프로세서는 동작 607에서 전자 장치의 장치 플래쉬 및 케이스 플래쉬인 케이스 장치의 발광부 중 턴온할 플래쉬를 선택할 수 있다. 일 실시예에 따르면, 프로세서는 사용자의 선택에 따라 전자 장치의 장치 플래쉬 및 케이스 장 치의 발광부 중 턴온할 플래쉬를 결정할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 플래쉬 턴온 동작을 수행하기 위해, 장치 플래쉬 또는 케이스 장치의 발광부 중 턴온할 플래쉬를 선택하기 위한 메뉴(예: 아이콘)를 디스플레이를 통해 제공할 수 있다. 일 실시예에 따르면, 케이스 장치의 덮개부가 도 7c에 도시된 바와 같이 개방된 경우, 사용자는 카메 라 앱의 실행 화면 상단에 표시된 케이스 장치의 발광부를 선택하여 턴온시킬 수 있는 메뉴 아 이콘 및 장치 플래쉬를 선택하여 턴온시킬 수 있는 메뉴 아이콘 중 케이스 장치의 발광부 를 선택하여 턴온시킬 수 있는 메뉴 아이콘을 터치하여 선택할 수 있다. 다양한 실시예에 따르면, 케이스 장치의 발광부를 턴온하는 것으로확인된 경우, 전자 장치의 프 로세서는 동작 609에서 케이스 장치의 발광부를 턴온하는 명령을 케이스 장치로 전달할 수 있다. 일 실시예에 따르면, 도 7d에 도시된 바와 같이 개방된 경우, 사용자는 카메라 앱의 실행 화면 상단에 표 시된 케이스 장치의 발광부를 선택하여 턴온시킬 수 있는 메뉴 아이콘 및 장치 플래쉬를 선택하여 턴온시킬 수 있는 메뉴 아이콘 중 장치 플래쉬를 선택하여 턴온시킬 수 있는 메뉴 아이콘 을 터치하여 선택할 수 있다. 다양한 실시예에 따르면, 장치 플래쉬를 턴온하는 것으로 확인된 경우, 전자 장치의 프로세서는 동작 611에서 전자 장치의 장치 플래쉬가 턴온되도록 할 수 있다. 도 8은 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 다른 흐름도이다. 도 9a 내지 도 9e는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도면 이다. 다양한 실시예에 따르면, 전자 장치의 프로세서(예: 도 5b의 프로세서)는 동작 801에서 케이스 장치 의 덮개부(예: 도 5a 및 도 5b의 덮개부)의 개방 여부를 확인할 수 있다. 일 실시예에 따르면, 프로세서는 케이스 장치와의 통신에 기초하여덮개부의 개방 여부를 확인할 수 있다. 예를 들어, 케이스 장치는 덮개부의 개폐를 감지하기 위한 센서를 통해 덮개부의 개방 여부를 확인하고 이를 통신 인터페이스(예: 도 도 5b의 통신 인터페이스)를 통해 전자 장치에 전달할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 덮개부가 도 9a에 도시된 바 와 같이 닫힌 경우, 도 9b에 도시된 바와 같이 별도의 동작 수행 없이 예를들면 홈 화면을 디스플레이(예: 도 1의 디스플레이 모듈)을 통해 표시하도록 할 수 있다. 일 실시예에 따르면, 전자 장치는 센서 모듈(예: 도 1의 센서 모듈), 카메라 모듈(예: 도 1의 카메라 모듈) 및/또는 디스플레이 모듈(예: 도 1의 디스플레이 모듈)을 통해 케이스 장치의 덮개부 의 개방 여부를 확인할 수 있다. 다양한 실시예에 따르면, 케이스 장치의 덮개부가 닫힌 상태에서, 전자 장치의 프로세서는 동작 803에서, 카메라 앱 실행 명령이 입력되는지 확인할 수 있다. 일 실시예에 따르면, 사용자는 예를 들면 도 9b의 홈 화면 상에 표시된 카메라 앱 아이콘을 터치하여 카메라 앱을 실행시킬 수 있다. 다양한 실시예에 따르면, 케이스 장치의 덮개부가 닫힌 상태에서 카메라 앱 실행 명령이 입력되면, 전자 장치의 프로세서는 전면 카메라(예: 도 2a의 전면 카메라)를 활성화(예: 턴온)할 수 있다. 일 실시예에 따르면, 도 9c에 도시된 바와 같이 전면 카메라가 활성화됨에 따라 디스플레이에는 전면 카메라를 통해 입력되는 프리뷰 이미지 화면이 표시될 수 있다. 다양한 실시예에 따르면, 전자 장치의 프로세서는 동작 807에서 전면 카메라가 아닌, 후면 카메 라(241, 242, 243, 244, 245, 246 및/또는 247) 중 적어도 하나에 대한 활성화 명령 또는 카메라 전환 명령을 수신할 수 있다. 일 실시예에 따르면, 도 9d에 도시된 바와 같이 사용자는 카메라 앱 화면 하단의 카메라 전환 메뉴 아이콘 을 터치함으로써, 현재 활성화된 전면 카메라가 아닌 후면 카메라(241, 242, 243 및/또는 244)에 대 한 활성화 또는 카메라 전환 명령을 입력할 수 있다. 다양한 실시예에 따르면, 케이스 장치의 덮개부가 닫혀있는 상태에서 후면 카메라 활성화가 요구됨에 따라, 전자 장치의 프로세서는 동작 809에서, 전자 장치의 디스플레이에 케이스 장치(30 0)의 덮개부를 개방할 것을 안내하는 메시지를 표시할 수 있다. 일 실시예에 따르면, 도 9e에 도시된 바와 같이, 전자 장치의 프로세서는 카메라 앱의 프리뷰 이미지 상의 일부 영역에 예를 들면 팝업 가이드(pop-up guide)를 표시하여 케이스 장치의 덮개부 를 개방할 것을 사용자에게 안내할 수 있다. 다양한 실시예에 따르면, 전자 장치의 프로세서는 동작 811에서 케이스 장치의 덮개부가 개방되었는지 여부를 확인할 수 있다. 다양안 실시예에 따르면, 케이스 장치의 덮개부가 개방된 경우, 전자 장치의 프로세서는 동작 813에서 후면 카메라(241, 242, 243, 244, 245, 246 및/또는 247)를 활성화하여 이미지를 촬상하도록 할 수 있다. 도 10a 내지 도 10c는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도 면이다. 다양한 실시예에 따르면, 전자 장치의 프로세서는 도 10a에 도시된 바와 같이 예를 들면 탑다운 디스 플레이 메뉴 화면 상에서 플래쉬 턴온 메뉴 아이콘을 제공할 수 있다. 일 실시예에 따르면, 디스플레이 상에서 사용자는 화면 상단으로부터 아래쪽으로 예를 들면 터치 및 드래깅 방식으로 탑다운 디스플레이 메뉴 화면을 디스플레이하고, 메뉴 화면에 표시된 플래쉬 아이콘 을 터치하여 플래쉬를 턴온하도록 할 수 있다. 일 실시예에 따르면, 플래쉬 아이콘의 선택에 따라, 케이스 장치의 덮개부가 폐쇄되거나 개방된 상태에서, 도 10b에 도시된 바와 같이 전자 장치의 프로세서는 케이스 장치의 발광부가 턴 온되도록 할 수 있다. 일 실시예에 따르면, 플래쉬 아이콘이 선택된 경우 케이스 장치의덮개부가 폐쇄된 상태로 확인 되면, 전자 장치의 프로세서는 케이스 장치의 발광부가 우선적으로 턴온되도록 제어할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 발광부의 턴온 명령을 케이스 장치의 통신 인터페이스를 통해 컨트롤러로 전달하고 전달된 명령에 따라 발광부가 턴온되 도록 할 수 있다. 일 실시예에 따르면, 도 10c에 도시된 바와 같이, 전자 장치의 프로세서는 케이스 장치의 발광 부의 광량을 조절할 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 케이스 장치의 발광부가 동작하여 광을 방출 하는 동안 예를 들면 사이드 볼륨 키를 통해 입력된 볼륨 업 또는 다운 명령을 케이스 장치의 통신 인터페이스를 통해 컨트롤러로 전달하고 전달된 명령에 따라 발광부의 광량을 조절하도록 할 수 있다. 도 11a 및 도 11b는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도면 이다. 일 실시예에 따르면, 도 11a에 도시된 바와 같이, 수신 호가 발생함에 따라전화 앱이 실행되는 경우, 전자 장치 의 프로세서는 수신 호의 착신을 알리기 위해 디스플레이에 호의 수신을 알리는 전화 앱 화면 을 표시할 수 있다. 일 실시예에 따르면, 도 11a에 도시된 바와 같이, 전자 장치의 프로세서는 수신 호의 착신을 알리기 위해 장치 플래쉬를 턴온할 수 있다. 일 실시예에 따르면, 장치 플래쉬가 턴온됨에 따라, 장치 플래쉬로부터 방출된 광이 케이스 장치 의 덮개부의 반사부로 입사 및 반사되면서 발광 효과를 나타낼 수 있으며, 이에 따라 사용자에 게 수신 호가 있음을 효과적으로 알릴 수 있다. 다양한 실시예에 따르면, 케이스 장치의 덮개부가 개방된 상태에서 카메라 앱이 실행되지 않는 경우 또는 다른 앱이 실행되는 경우, 전자 장치의 프로세서는 덮개부가 덮개부가 개방된 상태임 을 디스플레이를 통해 안내하도록 할 수 있다. 일 실시예에 따라, 덮개부가 개방된 상태에서 예를 들 면 호가 수신되어 전화 앱이 실행되는 경우, 전자 장치의 프로세서는 수신 호의 착신을 알리기 위해 디스플레이에 호의 수신을 알리는 전화 앱 화면을 표시하는 외에도, 전화 앱 화면 상의 일부 영 역에 케이스 장치의 덮개부가 개방되어 있음을 알리는 팝업 가이드를 표시하여 케이스 장치 의 덮개부를 닫을 것을 사용자에게 안내할 수 있다. 본 문서에 개시된 실시 예들은 기술 내용을 쉽게 설명하고 이해를 돕기 위한 예로서 제시한 것일 뿐이며, 본 문 서에 개시된 기술의 범위를 한정하고자 하는 것은 아니다. 따라서 본 문서에 개시된 기술의 범위는 여기에 개 시된 실시 예들 이외에도 본 문서에 개시된 다양한 실시 예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변형된 형태를 포함되는 것으로 해석되어야 한다.도면 도면1 도면2a 도면2b 도면2c 도면3a 도면3b 도면3c 도면4a 도면4b 도면5a 도면5b 도면6 도면7a 도면7b 도면7c 도면7d 도면8 도면9a 도면9b 도면9c 도면9d 도면9e 도면10a 도면10b 도면10c 도면11a 도면11b"}
{"patent_id": "10-2021-0031791", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 2a는 본 발명의 다양한 실시예에 따른 전자 장치 및 이에 장착되는 케이스 장치의 분리 사시도이다. 도 2b 및 도 2c는 다양한 실시예에 따른 전자 장치가 장착된 케이스 장치의 후면도의 일 예이다. 도 3a 및 도 3b는 다양한 실시예에 따른 전자 장치가 장착된 케이스 장치의 후면도의 다른 예이다. 도 4a 및 도 4b는 다양한 실시예에 따른 전자 장치가 장착된 케이스 장치의 후면도의 또 다른 예이다. 도 5a 및 도 5b는 다양한 실시예에 따른 케이스 장치와 전자 장치의 구성을 나타내는 블록도이다. 도 6은 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 흐름도이다. 도 7a 내지 도 7d는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도면 이다. 도 8은 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 다른 흐름도이다. 도 9a 내지 도 9e는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도면 이다. 도 10a 내지 도 10c는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도 면이다. 도 11a 및 도 11b는 다양한 실시예에 따른 케이스 장치가 장착된 전자 장치의 제어 방법을 설명하기 위한 도면 이다."}
