{"patent_id": "10-2019-0024191", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0104765", "출원번호": "10-2019-0024191", "발명의 명칭": "구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템", "출원인": "차명규", "발명자": "차명규"}}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "카메라 및 마이크를 이용하여 데이터를 생성시키며, 무선통신이 가능한 구성원의 스마트기기;상기 스마트기기와 무선통신을 통해 전송된 상기 데이터를 저장하고, 상기 스마트기기로부터 데이터 요청시 요청된 데이터를 스마트기기에 제공하는 서버; 및상기 스마트기기에 설치되어, 상기 서버로부터 제공받는 데이터를 상기 스마트기기의 디스플레이부와 스피커를통해 확인할 수 있도록 사용자인터페이스를 제공하는 어플리케이션;를 포함하고,상기 서버는,상기 서버에 가입한 각각의 구성원에게 데이터 저장이 가능한 개인폴더를 제공하는 폴더제공부와,상기 개인폴더에 접속할 때, 상기 개인폴더를 제공받은 주인구성원과 상기 주인구성원으로부터 허가받은 허가구성원만 접속할 수 있도록 접속여부를 관리하는 접속관리부와,상기 개인폴더에 텍스트를 제외한 영상, 사진 및 음성 데이터를 저장하되, 상기 허가구성원의 스마트기기로부터업로드되는 데이터만 저장하는 데이터저장부와,상기 개인폴더에 저장된 데이터 중, 상기 주인구성원에게는 모든 데이터를 제공하고, 상기 허가구성원이 직접업로드한 데이터만 제공하는 데이터제공부를 포함하는 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 어플리케이션은, 상기 데이터를 상기 스마트기기의 디스플레이부와 스피커로 제공하되, 상기 데이터에 대해서 댓글을 입력할 수 없도록 하여 일방향의 의사소통만 이루어질 수 있는 폐쇄형의 사용자인터페이스를 제공하고,상기 주인구성원은, 상기 허가구성원이 업로드한 데이터에 대해서 답변 또는 응답을 하고자 할 경우에, 상기 허가구성원으로부터 허가받은 상태에서 상기 허가구성원의 개인폴더에 접속하여 접속한 상기 허가구성원의 개인폴더에 데이터를 업로드하는 것을 특징으로 하는 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 폴더제공부는, 다수의 구성원을 대표하는 대표구성원이 다른 구성원들과 데이터 공유를 요청할 경우, 대표구성원 및 다른 구성원에게 데이터 공유가 가능한 공유폴더를 제공하고,상기 접속관리부는, 상기 대표구성원과 다른 구성원이 상기 공유폴더에 접속하도록 접속여부를 관리하고,상기 다른 구성원은, 상기 대표구성원으로부터 공유폴더의 접속이 허가된 구성원인 것을 특징으로 하는 구성원간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 어플리케이션은, 상기 개인폴더 접속이 가능하도록 구성원을 식별할 수 있는 제1아이콘으로 제공하고, 상기 제1아이콘이 선택되면, 선택된 접속아이콘에 해당되는 구성원의 개인폴더에 저장된 데이터를 리스트로 제공하되 제2아이콘으로 제공하고,공개특허 10-2020-0104765-3-상기 제1아이콘은, 구성원의 사진을 제공하는 사진부와 상기 구성원의 이름을 제공하는 이름부를 포함하고,상기 제2아이콘은, 상기 제1아이콘과 동일한 사진부와 이름부 및 데이터의 종류를 나타내는 종류부를 포함하는구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제2항에 있어서,상기 서버는,상기 주인구성원이 망자로 변경되면 망자구성원으로 분류하는 구성원분류부와,상기 망자구성원의 개인폴더에 허가구성원으로부터 업로드된 제1데이터와, 상기 망자구성원이 주인구성원일 때허가구성원의 개인폴더에 업로드한 제2데이터의 패턴과 선후관계를 분석하는 분석부와,상기 분석부로부터 분석된 제1데이터와 제2데이터가 패턴 또는 선후관계에 해당하는 경우, 상기 망자구성원을대신하여 허가구성원의 개인폴더에 상기 제2데이터를 자동으로 재업로드하거나, 재노출되도록 하여 허가구성원의 어플리케이션을 통해 상기 제2데이터를 확인할 수 있도록 데이터를 관리하는 데이터관리부를 더 포함하는 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분석부는, 상기 제1데이터와 제2데이터의 패턴과 선후관계를 분석할 때, 인공지능(AI)으로 분석하고,상기 서버는, 상기 주인구성원이 망자구성원으로 변경되면, 망자구성원을 대신하여 데이터의 패턴 또는 선후관계를 바탕으로 망자구성원과 허가구성원과의 소통이 계속되도록 관리하는 것을 특징으로 하는 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 어플리케이션은, 상기 스마트기기가 일정시간동안 작동하지 않거나, 스마트기기의 배터가 일정량보다 낮을경우, 기 지정된 연락처 또는 구성원의 어플리케이션으로 기 설정된 알림데이터를 전송하는 것을 특징으로 하는구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 서버는, 업로드되는 데이터가 특정시간에 구성원의 어플리케이션에 알려지도록 특정시간을 설정할 수 있는것을 특징으로 하는 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 어플리케이션은, 타 구성원에게 선물할 수 있는 쇼핑몰의 사용자인터페이스를 제공하되, 구성원간의 관계가 부모와 자녀 관계일 때 자녀에게만 제공하고, 공유폴더를 접속하는 구성원들에게는 모두 제공하는 것을 특징으로 하는 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템."}
{"patent_id": "10-2019-0024191", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 어플리케이션은, GPS를 통해 상기 스마트기기의 위치를 파악하고, 파악하는 위치가 기 설정된 영역을 벗어날 경우, 기 설정된 영역을 벗어난 스마트기기의 카메라와 마이크를 활성화시켜 입력되는 음성 및 영상을 기 지정된 구성원의 스마트기기 또는 어플리케이션으로 확인할 수 있도록 제공하는 것을 특징으로 하는 구성원 간의소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템.공개특허 10-2020-0104765-4-"}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템에 따르면, 카메라 및 마이크를 이용 하여 데이터를 생성시키며, 무선통신이 가능한 구성원의 스마트기기; 상기 스마트기기와 무선통신을 통해 전송된 상기 데이터를 저장하고, 상기 스마트기기로부터 데이터 요청시 요청된 데이터를 스마트기기에 제공하는 서버; (뒷면에 계속)"}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템에 관한 것이다."}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "폐쇄형 SNS의 가장 큰 특징은 페이스북, 트위터 등의 기존 SNS에서 일어나는 사생활 노출 문제라는 단점을 상쇄 시킬 수 있다는 점이다. 폐쇄형 SNS는 아는 사람끼리 관계를 맺기 때문에 원치 않는 관계 맺기로 인한 스트레스 를 받을 필요가 없다. 예를 들어, 개방형 SNS는 직장 상사의 친구신청에 수락해야 할지, 거절해야 할 지에 대한 고민을 만들어낸다. 또한 비즈니스관계 등 이해관계가 있는 타인과의 소통은 때로는 큰 스트레스로 작용한다. 현대사회에서 소통은 아주 중요한 요소이지만 마음을 터놓기가 힘든 상황이다. 폐쇄형 SNS의 예로 들면 '밴드'가 있다. 관계에 따라 가족·친구·동호회·회사 등 각기 다른 지인 그룹을 만들 어 별도의 공간에서 소통할 수 있는 것이 특징이다. 또한 직장인 등 PC 사용이 많은 사용자들을 위해 PC버전도 출시해 사용자들이 더욱 편리하게 소통할 수 있도록 만들어 더욱 많은 사용자를 만들 수 있었다. 이와 유사한 카카오톡을 기반으로 하는 카카오그룹 '그룹' 멤버끼리 소식이나 사진 등을 공유할 수 있는 서비스이다. 누구나 손쉽게 이용할 수 있는 단순한 기능과 사용법은 물론이고 전 연령층을 아우르는 카카오톡의 사용자 기반을 중심 으로 차세대 폐쇄형 SNS로 떠오르고 있다. 이전에는 페이스북이나 트위터를 비롯한 개방형 SNS가 대세였다. 그러나 상업적인 메시지와 로봇 계정, 알바 계 정의 범람으로 인한 문제점으로 폐쇄형 SNS가 또 다른 이슈가 되어가고 있다. 개방형 SNS의 문제점은 원치 않는 사람에게 정보공개, 잦은 해킹으로 인한 정보유출 및 도용이 있으며, 사용자들이 점차 개방형 SNS에서 이탈하는 현상이 발생하고 있다. 그래서 기존의 방식으로 설계된 폐쇄형 SNS로도 부모와 형제간인 가족과의 소통이 가능하지만 기존의 폐쇄형 SNS는 가족 혹은 자신과 친분이 있는 사람들, 그리고 회사나 조직으로 한정되어 구성되어 위의 개방형 SNS같은 문제점들은 발생하지 않는다 하여도 개방형 SNS처럼 즉각적인 소통을 위한 기능위주로 설계되고 사용되고 있어 응답에 대한 스트레스를 야기하는 문제점은 여전히 발생하고 있다. 또한, 부모와 자녀, 즉, 노인층과 기성세대층이 서로 소통할 수 있는 사용자인터페이스를 제공하는 종래의 SNS 가 드물다. 즉, 기존 모든 개방형 및 폐쇄형 SNS의 개발이 노령층의 시각을 배제한 형태로 개발되어져 디자인 및 기능의 복잡성 등으로 인해 원하는 가족 간의 소통이 어려움을 갖게 하는 문제점이 있었다. 노령층의 스마트폰 사용 상황을 노년층의 신체적, 인지적 특성에 맞춰 연구한 결과, 스마트폰의 인터페이스의 사용성에 있어서 세부적인 디자인과 기능의 복잡성이 가장 큰 문제점이었다. 그리고, 70세 이상 노령층이 스마트폰 기능 중 주로 사용하는 기능은 음성통화와 사진촬영인 반면에, 종래의 SNS는 기본적으로 텍스트위주이기 때문에 사용에 불편함을 더하고 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2016-0126790"}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 문제점을 해결하기 위해 안출된 본 발명의 목적은, 종래의 폐쇄형 또는 개방형 SNS와 같이 업 로드되는 데이터에 대한 댓글 기능이 없으며, 구성원 간에 응답을 바라지 않고 전달하고 싶은 내용만 전달함으 로써, 상대방에게 반응을 해야 하는 강박관념에 의한 스트레스를 해소시킬 수 있으며, 구성원 간에 평상시에 표 현하기 어렵거나 원하는 내용을 부담없이 전달하여, 특히 가족 구성원 간의 소통과 더불어 사랑을 공유할 수 있도록 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템을 제공하기 위함이다."}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위한 본 발명의 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템에 따르면, 카메라 및 마이크를 이용하여 데이터를 생성시키며, 무선통신이 가능한 구성원의 스마트기기; 상기 스마트기기와 무선통신을 통해 전송된 상기 데이터를 저장하고, 상기 스마트기기로부터 데이터 요청시 요 청된 데이터를 스마트기기에 제공하는 서버; 및 상기 스마트기기에 설치되어, 상기 서버로부터 제공받는 데이터 를 상기 스마트기기의 디스플레이부와 스피커를 통해 확인할 수 있도록 사용자인터페이스를 제공하는 어플리케 이션;를 포함하고, 상기 서버는, 상기 서버에 가입한 각각의 구성원에게 데이터 저장이 가능한 개인폴더를 제공 하는 폴더제공부와, 상기 개인폴더에 접속할 때, 상기 개인폴더를 제공받은 주인구성원과 상기 주인구성원으로 부터 허가받은 허가구성원만 접속할 수 있도록 접속여부를 관리하는 접속관리부와, 상기 개인폴더에 텍스트를 제외한 영상, 사진 및 음성 데이터를 저장하되, 상기 허가구성원의 스마트기기로부터 업로드되는 데이터만 저장 하는 데이터저장부와, 상기 개인폴더에 저장된 데이터 중, 상기 주인구성원에게는 모든 데이터를 제공하고, 상 기 허가구성원이 직접 업로드한 데이터만 제공하는 데이터제공부를 포함한다. 또한, 상기 어플리케이션은, 상기 데이터를 상기 스마트기기의 디스플레이부와 스피커로 제공하되, 상기 데이터 에 대해서 댓글을 입력할 수 없도록 하여 일방향의 의사소통만 이루어질 수 있는 폐쇄형의 사용자인터페이스를 제공하고, 상기 주인구성원은, 상기 허가구성원이 업로드한 데이터에 대해서 답변 또는 응답을 하고자 할 경우 에, 상기 허가구성원으로부터 허가받은 상태에서 상기 허가구성원의 개인폴더에 접속하여 접속한 상기 허가구성 원의 개인폴더에 데이터를 업로드하는 것을 특징으로 한다. 또한, 상기 폴더제공부는, 다수의 구성원을 대표하는 대표구성원이 다른 구성원들과 데이터 공유를 요청할 경우, 대표구성원 및 다른 구성원에게 데이터 공유가 가능한 공유폴더를 제공하고, 상기 접속관리부는, 상기 대 표구성원과 다른 구성원이 상기 공유폴더에 접속하도록 접속여부를 관리하고, 상기 다른 구성원은, 상기 대표구 성원으로부터 공유폴더의 접속이 허가된 구성원인 것을 특징으로 한다. 또한, 상기 어플리케이션은, 상기 개인폴더 접속이 가능하도록 구성원을 식별할 수 있는 제1아이콘으로 제공하 고, 상기 제1아이콘이 선택되면, 선택된 접속아이콘에 해당되는 구성원의 개인폴더에 저장된 데이터를 리스트로 제공하되 제2아이콘으로 제공하고, 상기 제1아이콘은, 구성원의 사진을 제공하는 사진부와 상기 구성원의 이름 을 제공하는 이름부를 포함하고, 상기 제2아이콘은, 상기 제1아이콘과 동일한 사진부와 이름부 및 데이터의 종 류를 나타내는 종류부를 포함한다. 또한, 상기 서버는, 상기 주인구성원이 망자로 변경되면 망자구성원으로 분류하는 구성원분류부와, 상기 망자구 성원의 개인폴더에 허가구성원으로부터 업로드된 제1데이터와, 상기 망자구성원이 주인구성원일 때 허가구성원 의 개인폴더에 업로드한 제2데이터의 패턴과 선후관계를 분석하는 분석부와, 상기 분석부로부터 분석된 제1데이 터와 제2데이터가 패턴 또는 선후관계에 해당하는 경우, 상기 망자구성원을 대신하여 허가구성원의 개인폴더에 상기 제2데이터를 자동으로 재업로드하거나, 재노출되도록 하여 허가구성원의 어플리케이션을 통해 상기 제2데 이터를 확인할 수 있도록 데이터를 관리하는 데이터관리부를 더 포함한다. 또한, 상기 분석부는, 상기 제1데이터와 제2데이터의 패턴과 선후관계를 분석할 때, 인공지능(AI)으로 분석하고, 상기 서버는, 상기 주인구성원이 망자구성원으로 변경되면, 망자구성원을 대신하여 데이터의 패턴 또 는 선후관계를 바탕으로 망자구성원과 허가구성원과의 소통이 계속되도록 관리하는 것을 특징으로 한다. 또한, 상기 어플리케이션은, 상기 스마트기기가 일정시간동안 작동하지 않거나, 스마트기기의 배터가 일정량보 다 낮을 경우, 기 지정된 연락처 또는 구성원의 어플리케이션으로 기 설정된 알림데이터를 전송하는 것을 특징 으로 한다. 또한, 상기 서버는, 업로드되는 데이터가 특정시간에 구성원의 어플리케이션에 알려지도록 특정시간을 설정할 수 있는 것을 특징으로 한다. 또한, 상기 어플리케이션은, 타 구성원에게 선물할 수 있는 쇼핑몰의 사용자인터페이스를 제공하되, 구성원간의 관계가 부모와 자녀 관계일 때 자녀에게만 제공하고, 공유폴더를 접속하는 구성원들에게는 모두 제공하는 것을 특징으로 한다. 또한, 상기 어플리케이션은, GPS를 통해 상기 스마트기기의 위치를 파악하고, 파악하는 위치가 기 설정된 영역 을 벗어날 경우, 기 설정된 영역을 벗어난 스마트기기의 카메라와 마이크를 활성화시켜 입력되는 음성 및 영상을 기 지정된 구성원의 스마트기기 또는 어플리케이션으로 확인할 수 있도록 제공하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상 살펴본 바와 같은 본 발명의 효과는, 종래의 폐쇄형 또는 개방형 SNS와 같이 업로드되는 데이터에 대한 댓 글 기능이 없으며, 구성원 간에 응답을 바라지 않고 전달하고 싶은 내용만 전달함으로써, 상대방에게 반응을 해 야 하는 강박관념에 의한 스트레스를 해소시킬 수 있으며, 구성원 간에 평상시에 표현하기 어렵거나 원하는 내 용을 부담없이 전달하여, 특히 가족 구성원 간의 소통과 더불어 사랑을 공유할 수 있도록 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템을 제공할 수 있다."}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하"}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이하, 본 발명의 실시예들에 의하여 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템을 설명하 기 위한 도면들을 참고하여 본 발명에 대해 설명하도록 한다. 도 1은 본 발명의 바람직한 실시예에 따른 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템을 나타낸 구성도이다. 도 2 내지 도 5는 본 발명의 바람직한 실시예에 따른 구성원 간의 소통을 폐쇄형으로 제공 하는 폐쇄형 소통제공 시스템의 어플리케이션을 나타낸 예시도이다. 도 1을 참조하면, 본 발명에 따른 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템은, 스마트 기기, 서버 및 어플리케이션을 포함한다. 먼저, 스마트기기는 카메라 및 마이크를 이용하여 데이터를 생성시키며, 무선통신이 가능하다. 즉, 스마트기기는 구성원이 이용하는 기기이며, 스마트폰일 수 있다. 서버는, 스마트기기와 무선통신을 통해 전송된 상기 데이터를 저장하고, 스마트기기로부터 데이터 요청시 요청된 데이터를 스마트기기에 제공한다. 어플리케이션은, 스마트기기에 설치되어, 서버로부터 제공받는 데이터를 스마트기기의 디스플 레이부와 스피커를 통해 확인할 수 있도록 사용자인터페이스를 제공한다. 즉, 구성원은 자신의 스마트기기에 어플리케이션을 설치하고, 어플리케이션을 구동한 상태에서, 데 이터를 서버로 업로드하고, 서버로부터 다운로드하여 확인할 수 있다. 또한, 데이터가 다운로드될 때는, 스마트기기의 메모리에 저장될 수 있으며, 이미 저장된 데이터가 삭제될 수도 있다. 또한, 어플리케이션은, 데이터를 스마트기기의 디스플레이부와 스피커로 제공하되, 데이터에 대해서 댓 글을 입력할 수 없도록 하여 일방향의 의사소통만 이루어질 수 있는 폐쇄형의 사용자인터페이스를 제공한다. 도 3 및 4를 참조하면, 어플리케이션은, 개인폴더 접속이 가능하도록 구성원을 식별할 수 있는 제1아이콘으 로 제공하고, 제1아이콘이 선택되면, 선택된 접속아이콘에 해당되는 구성원의 개인폴더에 저장된 데이터를 리스 트로 제공하되 제2아이콘으로 제공할 수 있다. 이때, 제1아이콘은, 구성원의 사진을 제공하는 사진부와 구성원의 이름을 제공하는 이름부를 포함한다. 그리고 제2아이콘은, 제1아이콘과 동일한 사진부와 이름부 및 데이터의 종류를 나타내는 종류부를 포함한다. 한편, 어플리케이션의 사용자인터페이스는 노인층이 용이하게 사용할 수 있도록 단순하게 설계되는 것이 바 람직하다. 이에 따라, 사용자인터페이스는, 첫째, 노인층 사용자들은 일관성이 있고 효율적으로 조작할 수 있는 인터페이 스 디자인을 제공한다. 둘째, 아이콘의 크기, 텍스트의 서체와 크기, 사진 찍는 메뉴 등을 노인층을 기준으로 설계되어 제공된다. 셋째, 노인층의 사용빈도수가 높은 음성, 사진, 영상촬영만 데이터로 생성시킬 수 있도록 제공한다. 즉, 음성통화 기능과 관련해 연락처에 있는 정보를 검색할 때 텍스트 서체와 글자 크기 때문에 가시성이 떨어지 고, 홈 화면에 전화 버튼을 찾을 때 아이콘의 사이즈가 작아 에러(error)가 발생하고, 색채 때문에 카메라 아이 콘이나 사진 촬영 메뉴를 식별하기 어려운 경우가 빈번히 발생함으로써, 사용자인터페이스 디자인은 노인층에 맞춰 설계된 후, 제공되는 것이 바람직하다. 이와 같은 사용자인터페이스를 제공함에 따라, 노령의 부모님과의 소통에서 사용빈도수를 높임으로써, 부모와 자식간의 소통에 큰 도움을 주는 수단으로서 사용된다. 또한, 본 발명을 이용하는 주 구성원은 가족임에 따라, 어플리케이션의 사용자인터페이스는 가족의 대분류 (친가/처가), 가족 구성원의 세부 분류 등으로 나뉘고, 대분류에서 세부분류로 접근할 수 있도록 설계될 수 있 다. 여기서, 도 2와 같이, 노래 등을 제공하는 별도의 부가서비스가 제공될 수 있도록 설계될 수 있다. 또한, 신규 데이터와 이미 확인한 기존 데이터는 서로 다른 색상을 통해 구분시킬 수 있다. 한편, 서버는, 폴더제공부, 접속관리부, 데이터저장부 및 데이터제공부를 포함한다. 폴더제공부는, 서버에 가입한 각각의 구성원에게 데이터 저장이 가능한 개인폴더를 제공한다. 즉, 폴더제공부는 서버의 저장공간을 각각의 구성원에게 제공하는 것이다. 접속관리부는, 개인폴더에 접속할 때, 개인폴더를 제공받은 주인구성원이 접속할 수 있도록 접속여부를 관 리한다. 더불어, 접속관리부는, 주인구성원으로부터 허가받은 허가구성원만 접속할 수 있도록 접속여부를 관리한다. 이때, 허가구성원은 주인구성원의 개인폴더에 접속할 수 있도록 주인구성원으로부터 개인폴더의 접속을 기 허락 받은 구성원이다. 이에 따라, 접속관리부는, 어느 하나의 개인폴더에 구성원이 접속하려고 할 때, 개인폴더를 제공받은 주인 구성원과 주인구성원으로부터 이미 접속을 허가받은 허가구성원만 접속하도록 접속여부를 관리하는 것이다. 데이터저장부는, 개인폴더에 영상, 사진 및 음성 데이터를 저장하되, 허가구성원의 스마트기기로부터 업로드되는 데이터만 저장한다. 이때, 텍스트 데이터는 업로드를 불가하도록 한다. 즉, 개인폴더에는 허가구성원만이 접속이 가능하며, 허가구성원만이 주인구성원의 개인폴더에 데이터를 업로드 하여 저장시킬 수 있다. 이때, 주인구성원은 자신의 개인폴더에는 데이터를 저장할 수도 있다. 또한, 주인구성원은 허가구성원의 개인폴더에 접속을 허가되어 있다면, 주인구성원은 허가구성원의 개인폴더에 접속하여 데이터를 업로드하고 저장시킬 수 있다. 이때, 주인구성원은, 허가구성원이 업로드한 데이터에 대해서 답변 또는 응답을 하고자 할 경우에, 허가구성원 으로부터 허가받은 상태에서 허가구성원의 개인폴더에 접속하여 접속한 허가구성원의 개인폴더에 데이터를 업로 드할 수 있다. 데이터제공부는, 개인폴더에 저장된 데이터 중, 주인구성원에게는 모든 데이터를 제공하고, 허가구성원이 직접 업로드한 데이터만 제공한다. 예를 들어, 주인구성원은 다수의 허가구성원이 업로드함에 따라 저장된 데이터를 어플리케이션을 통해서 확 인할 수 있다. 반면에, 허가구성원은 허가구성원이 직접 업로드한 데이터만 확인하고 또 다른 허가구성원이 업 로드하여 저장된 데이터는 확인할 수 없다.이와 같이, 본 발명은, 구성원 간의 소통을 제공하되, 주인구성원은 허가구성원들이 주인구성원의 개인폴더에 업드한 데이터를 확인하는 반면, 허가구성원은 허가구성원이 업로드한 데이터만 확인할 수 있도록 제공하여, 폐 쇄형의 SNS가 이루어지도록 한 것이다. 더불어, 종래의 폐쇄형 SNS는 포스팅된 하나의 데이터에 댓글을 남기는 형식으로, 데이터 아래에 내용들이 열거 되는 방식인 반면에, 본 발명의 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템은 주인구성원 의 개인폴더에 데이터가 업로드되면, 업로드된 데이터에 주인구성원이 댓글을 남길 수 없고, 확인만 할 수 있으 며, 업로드된 데이터에 응답을 하고자 한다면 데이터를 업로드한 허가구성원의 개인폴더에 접속하여 데이터를 업로드할 수 있다. 즉, 본 발명은, 종래의 폐쇄형 또는 개방형 SNS와 같이 업로드되는 데이터에 대한 즉각적인 댓글 또는 꼭 데이 터에 대한 반응을 하여 소통해야 하는 강박관념에 의한 스트레스를 해소시킬 수 있다. 이로 인해, 본 발명의 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템은 자신이 전달하고자 하는 내용을 응답을 바라지 않고 다른 구성원에게 전달함으로써, 구성원 간에 평상시에 표현하기 어렵거나 원하 는 내용을 부담없이 전달하여, 특히 가족 구성원 간의 소통과 더불어 사랑을 공유할 수 있도록 제공할 수 있다. 예를 들어, 가족의 구성원 중에서 부모, 특히 노령층이된 부모와 자녀간의 소통은 그 무엇보다 중요하다 할 수 있다. 또한, 고령인 부모의 죽음은 자녀들에게는 엄청난 슬픔을 야기하는 것은 물론이고 생전의 추억을 가지고 살아가게 될 것이다. 그러한 부모의 죽음이나 가족의 죽음으로 발생하는 결핍, 즉 상실감은 가족 구성원 개개인 에게 커다란 그리움으로 다가올 것이다. 이때, 발생하는 상실감을 생전의 추억으로 남겨진 데이터로 충족될 수 있다. 좀 더 자세하게, 부모와 자녀의 구성원 입장에서 설명한다. 먼저, 부모 구성원의 입장에 설명하면, 부모는 항상 자녀의 일상이 궁금하고 자녀도 노인이 된 부모의 안부가 궁금하지만, 기존의 전화로서 직접 통화가 의외로 서먹서먹한 경우가 많이 있다. 부모의 입장은 혹시라도 자녀 의 바쁜 일상에 방해를 주는 것을 염려와 배려로 소통이 원활하지 않은 경우가 많다. 또한 실제로 자녀가 부모 의 직접적인 통화에 불친절한 대응도 빈번하게 일어나는 것이 부모와 자녀간의 소통의 방식도 흔하게 볼 수 있 다. 자녀가 부모의 자녀걱정을 잔소리로 여기는 경우, 직접 통화보다는 문자(텍스트)가 효율적일지 모르지만 실제로 노인층의 문자 사용은 의외로 상당히 적기 때문에 텍스트를 통한 소통은 원활하게 이루어지지 않는다. 이에 따 라, 본 발명은 텍스트를 제외한 영상, 음성 및 사진으로만 소통을 할 수 있도록 제공한다. 노인층의 텍스트를 꺼려 하는 이유는 노안에 의한 문자 거부감과, 현재 SNS 대부분의 사용방법이 어려워 기계에 대한 두려움이 많기 때문에 사용 빈도가 적은 것이다. 또한, 부모들은 자녀에게 본인이 가진 어려움(건강 및 재정 등)을 잘 토로하지 않는 경향이 많은데, 부모는 항 상 내리사랑을 하는 존재로 생각하고 자식에게 짐이 되고 싶지 않아 하기 때문이다. 이런 상황에서 현재 노인층이 사용하는 직접 음성통화보다는 하고 싶은 내용을 SNS를 통해 영상, 음성, 사진으 로 등록해놓고 그것을 자녀들이 확인할 수 있는 본 발명의 폐쇄형 SNS를 이용한다면 상술한 구두, 텍스트, 통화, 개방형 SNS이 갖고 있는 부족한 부분을 보충할 수 있는 효과가 있다. 특히, 독거노인의 경우, 활동성이 적어지는 야간에는 외롭고 혼잣말을 하는 경우도 있어, 자녀의 개인폴더에 본 인이 하고 싶은 내용을 등록해 놓고, 확인함에 따라, 독고노인의 결핍을 보완해주는 효과가 있다. 또한, 자녀의 입장에서는, 부모의 건강 및 활동 등에 많은 걱정을 하지만 실제 생활에서는 전화 등의 소통 빈도 수가 현저히 적은 경우가 많다. 하지만 항상 부모를 생각하는 마음은 누구나 애틋하고 특히 고령의 부모를 가진 자녀일수록 더욱 그러하다. 그러나, 막상 소통을 하는 데에 있어, 서툰 자녀들이 많은데, 그 이유는 부모와의 세대차이 및 노령화된 부모의 자식에 대한 지나친 걱정 및 염려 등이 오히려 소통을 가로막는 장애요소가 되기 때문이다. 마음과는 달리 부모와 통화 시에 언쟁을 벌이는 경우도 생기기 때문에, 가족 간의 종래 소통은 왜곡을 주기도하 는 경향이 있다. 자식도 부모에게 하고 싶은 말이나, 혹은 일상생활 중 부모에 대한 그리움 등이 크지만 실제 전화를 하는 경우 가 드물다. 그 이유는 바쁜 일상에서 쌍방이 라이브 상태로 소통하는 것에 대한 막연한 부담감이 작용하기 때문이다. 본 발명과 같이, 자녀가 자신이 하고 싶은 내용을 일방적으로 부모에게 전달할 수 있고 그것을 부모가 자유롭게 전달받고 자녀를 이해한다면 부모와 자녀 구성원 간의 소통 질을 더욱 향상시킨다. 또한, 본 발명은 부모의 입장에서 몸이 아프거나 힘든 일이 생기거나 자녀가 보고 싶을 때, 자녀의 입장에서는 먼저 부모의 건강과 안부를 걱정하는 마음을 여과 없이 전달함으로써 서로 사랑을 확인하는 소통의 창구를 제공 할 수 있다. 또한, 폴더제공부는, 다수의 구성원을 대표하는 대표구성원이 다른 구성원들과 데이터 공유를 요청할 경우, 대표구성원 및 다른 구성원에게 데이터 공유가 가능한 공유폴더를 제공한다. 그리고, 접속관리부는, 대표구성원과 다른 구성원이 공유폴더에 접속하도록 접속여부를 관리한다. 여기서, 다른 구성원은, 대표구성원으로부터 공유폴더의 접속이 허가된 구성원일 수 있다. 도 5와 같이, 공유된 모든 구성원이 데이터를 업로드, 공유 및 확인할 수 있다. 또한, 공유폴더는 본 발명을 이용하는 모든 구성원이 자유롭게 데이터를 업로드, 공유 및 확인 할 수 있으나, 공유폴더를 대표하는 대표구성원은 공유폴더를 이용하 는 구성원들의 가입, 퇴장 등의 권한이 부여될 수 있다. 공유폴더는 모든 구성원이 알아야 할 내용을 어느 한 구성원이 일일이 구성원 개인폴더에 업로드하는 대신, 한 번의 데이터 업로드로 그 외 모든 구성원이 데이터를 쉽게 확인 및 공유할 수 있도록 제공하는 폴더이다. 또한, 공유폴더는 대표구성원이 최초 개설할 때, 비밀번호를 설정할 수 있다. 그리고, 공유폴더에 참여하고 싶 은 다른 구성원은 대표구성원으로부터 비밀번호를 부여받고, 공유폴더를 이용할 수 있다. 한편, 서버는, 구성원분류부와, 분석부 및 데이터관리부를 더 포함한다. 구성원분류부는, 주인구성원이 망자로 변경되면 망자구성원으로 분류한다. 분석부는, 망자구성원의 개인폴더에 허가구성원으로부터 업로드된 제1데이터와, 망자구성원이 주인구성원일 때 허가구성원의 개인폴더에 업로드한 제2데이터의 패턴과 선후관계를 분석한다. 이때, 분석부는, 제1데이터와 제2데이터의 패턴과 선후관계를 분석할 때, 인공지능(AI)으로 분석한다. 데이터관리부는, 분석부로부터 분석된 제1데이터와 제2데이터가 패턴 또는 선후관계에 해당하는 경우, 망자구성 원을 대신하여 허가구성원의 개인폴더에 제2데이터를 자동으로 재업로드하거나, 재노출되도록 하여 허가구성원 의 어플리케이션을 통해 제2데이터를 확인할 수 있도록 데이터를 관리한다. 이때, 망자구성원은, 망자로 변경되기 이전의 주인구성원인 상태에서 허가구성원으로부터 허가구성원의 개인폴 더에 접속을 허가받은 구성원이다. 예를 들어, 제1데이터가 업로드된 후, 제2데이터가 업로드되었다면, 허가구성원이 제1데이터와 유사한 유사데이 터를 업로드했을 때, 분석부는 유사데이터와 유사한 제1데이터를 찾아낸 후, 데이터관리부는 제2데이터를 허가 구성원의 개인폴더에 망자구성원을 대신하여 업로드한다. 또한, 허가구성원의 생일, 결혼기념일, 자녀탄생일 등의 특정한 날에 망자구성원이 제2데이터를 업로드되었다면, 분석부는 허가구성원의 특정한 날에 그에 해당되는 제2데이터의 유사데이터를 찾아낸 후, 데이 터관리부는 제2데이터를 허가구성원의 개인폴더에 망자구성원을 대신하여 업로드한다. 이에 따라, 서버는, 주인구성원이 망자구성원으로 변경되면, 망자구성원을 대신하여 데이터의 패턴 또는 선 후관계를 바탕으로 망자구성원과 허가구성원과의 소통이 계속되도록 관리한다. 이러한 본 발명의 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템은, 사회적인 공적 순기능으 로 작용하여 가족 구성원의 결핍으로 생긴 그리움과 외로움을 치유하여 결핍을 해소할 수 있고, 개개인의 삶에 선한 영향을 줄 수 있다. 한편, 망자구성원과 더이상의 소통을 원하지 않을 경우에는, 허가구성원이 망자구성원과의 소통유지여부에 대해 서 결정할 수 있다. 한편, 어플리케이션은, 스마트기기가 일정시간동안 작동하지 않거나, 스마트기기의 배터가 일정량 보다 낮을 경우, 기 지정된 연락처 또는 구성원의 어플리케이션으로 기 설정된 알림데이터를 전송한다.여기서, 주인구성원 또는 허가구성원은 알림데이터가 허가구성원 또는 주인구성원으로부터 전달되지 않으면, 허 가구성원 또는 주인구성원이 스마트기기를 계속적으로 작동시키고 있는 것이므로, 안부 등을 간접적으로 확 인할 수 있다. 또한, 서버는, 업로드되는 데이터가 특정시간에 구성원의 어플리케이션에 알려지도록 특정시간을 설정 할 수 있다. 예를 들어, 자녀는 미리 부모의 생신이나, 결혼기념일 등 특정기념일에 미리 생성시킨 데이터를 부모의 개인폴 더에 업로드한 후, 특정시간에 부모에게 전달되도록 할 수 있다. 또한, 어플리케이션은, 타 구성원에게 선물할 수 있는 쇼핑몰의 사용자인터페이스를 제공하되, 구성원간의 관계가 부모와 자녀 관계일 때 자녀에게만 제공하고, 공유폴더를 접속하는 구성원들에게는 모두 제공할 수 있다. 예를 들어, 부모와 자녀 관계가 주인구성원과 허가구성원의 관계일 때, 타 구성원은 주인구성원이 될 수 있다. 즉, 자녀인 허가구성원의 스마트기기에 설치된 어플리케이션은 선물할 수 있는 쇼핑몰을 제공하고, 부 모인 주인구성원의 스마트기기에 설치된 어플리케이션은 쇼핑몰이 제공되지 않는다. 또한, 공유폴더를 접속하는 구성원들에게만 쇼핑몰이 제공될 수 있다. 이때, 선물은, 가구, 전자제품, 용돈 등 다양하게 이루어질 수 있다. 또한, 어플리케이션은, GPS를 통해 상기 스마트기기의 위치를 파악하고, 파악하는 위치가 기 설정된 영 역을 벗어날 경우, 기 설정된 영역을 벗어난 스마트기기의 카메라와 마이크를 활성화시켜 입력되는 음성 및 영상을 기 지정된 구성원의 스마트기기 또는 어플리케이션으로 확인할 수 있도록 제공한다. 이로 인해, 구성원에게 불미스러운 일이 발생했을 때, 빠르게 대처할 수 있으며, 구성원의 현재 상태를 신속하 게 파악할 수 있다."}
{"patent_id": "10-2019-0024191", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하 지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실 시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구의 범위에 의하여 나타내어지며, 특허청구의 범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다. 더 불어, 상술하는 과정에서 기술된 구성의 작동순서는 반드시 시계열적인 순서대로 수행될 필요는 없으며, 각 구 성 및 단계의 수행 순서가 바뀌어도 본 발명의 요지를 충족한다면 이러한 과정은 본 발명의 권리범위에 속할 수 있음은 물론이다."}
{"patent_id": "10-2019-0024191", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 바람직한 실시예에 따른 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템을 나타낸 구성도이다. 도 2 내지 도 5는 본 발명의 바람직한 실시예에 따른 구성원 간의 소통을 폐쇄형으로 제공하는 폐쇄형 소통제공 시스템의 어플리케이션을 나타낸 예시도이다."}
