{"patent_id": "10-2020-0115659", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0033359", "출원번호": "10-2020-0115659", "발명의 명칭": "부스기반 자가 구강검진장치", "출원인": "주식회사 큐티티", "발명자": "고태연"}}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "이용자의 구강을 촬영하고, 촬영된 이용자의 구강 이미지를 보정 한 후 보정한 구강 이미지와 진단 요청 정보를매핑하여 구강검진 진단요청정보를 생성하고, 생성한 구강검진 진단요청정보를 구강관리 서비스서버에 전송하는구강 검진 부스;상기 구강 검진 부스로부터 제공되는 구강검진 진단요청정보를 구강건강 관리서버에 전송하여 구강검진 진단을요청하고, 구강검진 진단결과를 이용자에게 전송하는 구강관리 서비스서버; 및상기 구강관리 서비스서버로부터 전송된 구강검진 진단요청정보에 포함된 구강이미지를 진단하여 구강건강정보를 생성하고, 생성한 구강건강정보를 암호화하여 구강검진 진단결과로 상기 구강관리 서비스서버에 전송하는 구강건강 관리서버를 포함하는 것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에서, 상기 구강 검진 부스와 구강관리 서비스서버 및 구강건강 관리서버는 암호화된 구강검진 진단결과의 송수신을 통해 해킹에 의한 자료 누출시에도 보안성을 향상하는 것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에서, 상기 이용자는 구강검진 진단결과를 이용자 단말로 전송토록 전송위치를 설정하거나 종이 인쇄로현장 출력을 전송위치로 설정하는 것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에서, 상기 구강 검진 부스는,몸체;상기 몸체에 내장되며, 이용자의 구강을 촬영하는 카메라;상기 몸체에 내장되며, 상기 카메라에 의해 촬영된 이용자의 구강 이미지의 보정 및 전송을 제어하며, 구강검진진단결과의 출력을 제어하는 제어기; 및상기 몸체에 설치되며, 상기 제어기의 제어에 따라 구강검진 진단결과를 종이에 인쇄해주는 프린터를 포함하는것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "에서, 상기 제어기는,상기 제어부의 제어에 따라 상기 카메라를 통해 촬영된 이용자의 구강 이미지를 보정하여 선명도를 높이는 구강이미지 보정부;상기 제어부의 제어에 따라 상기 구강이미지 보정부에 의해 보정된 구강 이미지와 진단 요청 정보를 포함한 구강검진 진단요청정보를 상기 구강관리 서비스서버로 전송하여 구강검진 진단을 요청하고, 수신한 구강검진 진단결과를 상기 제어부에 전달하는 통신부를 포함하는 것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 5에서, 상기 제어기는 구강검진 문진에 대한 이용자의 답변 정보를 조작부를 통해 획득하고, 획득한 이용자의 답변 정보를 이용하여 문진 응답 정보를 생성하여 상기 제어부에 전달하는 문진 응답부를 포함하는 것을특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 1에서, 상기 구강건강 관리서버는 구강검진 진단결과 전송 시 구강 검진 부스 ID와 이용자 정보를 이용한 접근 토큰(access token)을 이용하여 접근 대상의 권한을 제한하여 보안성을 향상하는 것을 특징으로 하는부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에서, 상기 구강건강 관리서버는 수신한 구강 이미지를 인공지능 알고리즘인 CNN(Convolutional NeuralNetwork) 알고리즘으로 학습하여 사진의 분석 가능 여부와 교정 여부 및 발치 여부를 판단하고, 판단한 결과 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태정보를 획득하고, 획득한 치아우식 상태정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로 학습하여 구강건강 상태를 판정하는 구강건강 연산부; 상기 구강건강 연산부에서 판정한 구강건강정보를 구강검진 진단결과로생성하고, 생성한 구강검진 진단결과를 암호화하여 상기 구강관리 서비스서버에 전송하는 구강건강정보 제공부를 포함하는 것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에서, 상기 구강건강 연산부는 상기 구강 검진 부스로부터 전송된 구강 이미지를 구강건강 예측대상으로 등록하는 이미지 등록부; 상기 이미지 등록부에 등록된 이미지를 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 이미지의 분석 가능 여부와 교정 여부 및 발치 여부를 판단하고, 판단한 결과 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태정보를 획득하며, 획득한 교정 여부 정보및 발치 여부 정보와 치아우식 상태정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로학습하여 구강건강 상태를 판정하는 구강 진단부를 포함하는 것을 특징으로 하는 부스기반 자가 구강검진장치."}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "비대면으로 구강 검진 부스(Booth)를 통해 누구나가 쉽게 자가 구강검진을 하여 구강을 최적으로 관리할 수 있도 록 하고, 이를 통해 구강건강 증진을 도모하도록 한 부스기반 자가 구강검진장치에 관한 것으로서, 이용자의 구 강을 촬영하고, 촬영된 이용자의 구강 이미지를 보정 한 후 보정한 구강 이미지와 진단 요청 정보를 매핑하여 구 강검진 진단요청정보를 생성하고, 생성한 구강검진 진단요청정보를 구강관리 서비스서버에 전송하는 구강 검진 부스, 구강 검진 부스로부터 제공되는 구강검진 진단요청정보를 구강건강 관리서버에 전송하여 구강검진 진단을 요청하고, 구강검진 진단결과를 이용자에게 전송하는 구강관리 서비스서버 및 구강검진 진단요청정보에 포함된 구강이미지를 진단하여 구강건강정보를 생성하고, 생성한 구강건강정보를 암호화하여 구강검진 진단결과로 구강 관리 서비스서버에 전송하는 구강건강 관리서버를 포함하여, 부스기반의 자가 구강검진장치를 구현한다."}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 부스기반 자가 구강검진장치에 관한 것으로, 더욱 상세하게는 비대면으로 구강 검진 부스(Booth)를 통해 누구나가 쉽게 자가 구강검진을 하여 구강을 최적으로 관리할 수 있도록 하고, 이를 통해 구강건강 증진을도모하도록 한 부스기반 자가 구강검진장치에 관한 것이다."}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "구강 질환은 적절한 예방 치료 및 꾸준한 관리를 통해서 높은 예방 효과를 얻을 수 있지만, 많은 구강 질환 환 자들은 구강 건강에 문제가 발생하지 않으면 의사에게 진단을 받거나 치료를 의뢰하지 않는 등 아직까지는 구강 예방에 대해 인식이 부족한 실정이다. 구강질환은 기타 질병과는 다르게 그 예방법이 매우 중요하며 스케일링과 같은 간단한 시술로도 치주질환을 예 방할 수 있으며, 부정교합이 예측되는 어린이에게 간단한 예방적 치료를 시행하면 성장기 이후 교정치료를 받지 않아도 되어 구강건강관리뿐 아니라 비용적 편익도 매 큰 것을 알 수 있다. 환자의 현재 구강 상태를 예측함에 있어 치과 의사나 치위생사의 주관적 견해가 아닌, 정확한 검사 및 진단 결 과와 그에 따른 객관적 수치 정보가 필요하지만 구강의 건강 상태를 객관적으로 산출하는 시스템이 부재한 상황 이다. 구강의 2대 질환은 충치(치아우식), 치주질환을 의미한다. 특히, 치주염과 치은염을 의미하는 치주질환은 초기 에는 동통도 없고 만성적으로 진행하기 때문에 발견이 늦어져, 치주질환을 사전에 예방하는 것은 매우 어려운 상황이다. 따라서 이러한 구강 질환의 상태를 사전에 진단하고, 이를 기반으로 구강건강 증진 및 구강질환 예방을 위한 다 양한 방법들이 연구 및 제안되고 있으며, 이러한 연구를 토대로 종래에 제안된 기술이 하기의 <특허문헌 1> 내 지 <특허문헌 3> 에 개시되어 있다. <특허문헌 1> 은 사용자 단말기로부터 사용자의 성별, 나이, 치주질환 및 목표 설정 정보 중 적어도 하나에 대 한 정보를 포함하는 사용자 조건 정보와 사용자의 가맹 의료기관에서의 치료 정보를 입력받는다. 아울러 구강 관리 용품 가맹점으로부터 구강 관리 용품에 대한 정보를 입력받는다. 이후, 사용자의 조건 정보 및 치료 정보 에 대응하는 특정 카테고리에 포함되는 특정 구강 관리 용품의 정보를 사용자 단말기에 제공하여, 사용자 맞춤 형 구강 관리 서비스를 제공한다. 또한, <특허문헌 2> 는 환자의 구강 상태를 검진하고, 환자의 구강 검진 자료를 포함하는 구강 검진 지수 산정 기준 데이터, 거주 지역 및 연령 정보를 빅데이터화한 후, 이를 분석하여 현재 시점에서 환자의 거주 지역 및 연령에 따라 구강 검진 지수 산정 기준 데이터가 구강 건강에 미치는 영향력을 판단한다. 이어, 구강 검진 지수 산정 기준데이터에 가중치를 부여하여 구강 검진 지수 산정을 위한 기준 데이터를 수치화하여 구강 건강을 관리 하도록 한다. 또한, <특허문헌 3> 은 사용자의 개인정보, 사용자의 구강 위생 행동 데이터 및 구강 문진 데이터, 사용자가 전 문 의료기관을 방문하여 생성된 구강검진 데이터를 수집한다. 이렇게 수집한 각각의 정보들을 통합 분석하여 사 용자의 구강질환 위험도를 평가하고, 개인별 맞춤 서비스를 제공한다. 그러나 상기와 같은 종래의 구강 질환 관리 시스템들은 사용자의 개인 정보나 구강 데이터 및 문진 데이터, 전 문 의료기관을 통해 생성된 구강검진 데이터를 분석하여 구강 질환 관리정보를 생성하는 방식으로서, 실시간성 이 떨어지고 현재 사용자의 구강 이미지를 분석하는 방식이 아니므로 구강 질환의 분석에 정확성이 결여되는 단 점이 있다. 또한, 종래의 기술들은 사용자가 실시간으로 자신의 치주질환 상태를 인지하는 것도 어려운 단점이 있다. 또한, 종래의 기술들은 비대면으로 자신의 치주질환 상태를 정확하게 확인할 수 없는 단점도 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2017-0050467(2017.05.11. 공개)(사용자 맞춤형 구강 관리 서비스 제공 방법 및 구강 관리 서비스 제공서버) (특허문헌 0002) 대한민국 등록특허 10-1868979(2018.06.12. 등록)(딥러닝 알고리즘을 이용한 구강 건강관리 시 스템 및 방법) (특허문헌 0003) 대한민국 등록특허 10-1788030(2017.10.13. 등록)(구강질환 위험도 진단 및 구강관리 시스템과그 방법)"}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 발명은 상기와 같은 종래기술에서 발생하는 제반 문제점을 해결하기 위해서 제안된 것으로서, 비대면 으로 구강 검진 부스(Booth)를 통해 누구나가 쉽게 자가 구강검진을 하여 구강을 최적으로 관리할 수 있도록 하 고, 이를 통해 구강건강 증진을 도모하도록 한 부스기반 자가 구강검진장치를 제공하는 데 그 목적이 있다."}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 목적을 달성하기 위하여, 본 발명에 따른 \"부스기반 자가 구강검진장치\"는, 이용자의 구강을 촬영하고, 촬영된 이용자의 구강 이미지를 보정 한 후 보정한 구강 이미지와 진단 요청 정보를 매핑하여 구강검진 진단요청정보를 생성하고, 생성한 구강검진 진단요청정보를 구강관리 서비스서버에 전송하는 구강 검진 부스; 상기 구강 검진 부스로부터 제공되는 구강검진 진단요청정보를 구강건강 관리서버에 전송하여 구강검진 진단을 요청하고, 구강검진 진단결과를 이용자에게 전송하는 구강관리 서비스서버; 및 상기 구강관리 서비스서버로부터 전송된 구강검진 진단요청정보에 포함된 구강이미지를 진단하여 구강건강정보 를 생성하고, 생성한 구강건강정보를 암호화하여 구강검진 진단결과로 상기 구강관리 서비스서버에 전송하는 구 강건강 관리서버를 포함하는 것을 특징으로 한다. 상기에서 구강 검진 부스와 구강관리 서비스서버 및 구강건강 관리서버는 암호화된 구강검진 진단결과의 송수신 을 통해 해킹에 의한 자료 누출시에도 보안성을 향상하는 것을 특징으로 한다. 상기에서 이용자는 구강검진 진단결과를 이용자 단말로 전송토록 전송위치를 설정하거나 종이 인쇄로 전송위치 를 설정하는 것을 특징으로 한다. 상기에서 구강 검진 부스는, 몸체; 상기 몸체에 내장되며, 이용자의 구강을 촬영하는 카메라; 상기 몸체에 내장되며, 상기 카메라에 의해 촬영된 이용자의 구강 이미지의 보정 및 전송을 제어하며, 구강검진 진단결과의 출력을 제어하는 제어기; 상기 몸체에 설치되며, 상기 제어기의 제어에 따라 구강검진 진단결과를 종이에 인쇄해주는 프린터를 포함하는 것을 특징으로 한다. 상기에서 제어기는, 이용자가 구강 검진을 위해 조작하기 위한 복수의 기능 버튼을 포함하고, 상기 기능 버튼의 조작에 대응하는 기 능 입력 신호를 출력하는 조작부; 상기 조작부에서 출력된 기능 입력 신호에 따라 입력 기능을 인식하고, 상기 카메라에 의해 촬영된 이용자의 구 강 이미지의 보정 및 전송을 제어하며, 구강검진 진단결과의 출력을 제어하는 제어부를 포함하는 것을 특징으로 한다. 상기에서 제어기는, 상기 제어부의 제어에 따라 상기 카메라를 통해 촬영된 이용자의 구강 이미지를 보정하여 선명도를 높이는 구강 이미지 보정부; 상기 제어부의 제어에 따라 상기 구강이미지 보정부에 의해 보정된 구강 이미지와 진단 요청 정보를 포함한 구 강검진 진단요청정보를 상기 구강관리 서비스서버로 전송하여 구강검진 진단을 요청하고, 수신한 구강검진 진단 결과를 상기 제어부에 전달하는 통신부를 포함하는 것을 특징으로 한다.상기에서 제어기는 구강검진 문진에 대한 이용자의 답변 정보를 조작부를 통해 획득하고, 획득한 이용자의 답변 정보를 이용하여 문진 응답 정보를 생성하여 상기 제어부에 전달하는 문진 응답부를 포함하는 것을 특징으로 한 다. 상기에서 구강건강 관리서버는 구강검진 진단결과 전송 시 구강 검진 부스 ID와 이용자 정보를 이용한 접근 토 큰(access token)을 이용하여 접근 대상의 권한을 제한하여 보안성을 향상하는 것을 특징으로 한다. 상기에서 구강건강 관리서버는 수신한 구강 이미지를 인공지능 알고리즘인 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 사진의 분석 가능 여부와 교정 여부 및 발치 여부를 판단하고, 판단한 결과 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태정보를 획득하고, 획득한 치아우식 상태 정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로 학습하여 구강건강 상태를 판정하는 구강건강 연산부; 상기 구강건강 연산부에서 판정한 구강건강정보를 구강검진 진단결과로 생성하고, 생성한 구 강검진 진단결과를 암호화하여 상기 구강관리 서비스서버에 전송하는 구강건강정보 제공부를 포함하는 것을 특 징으로 한다. 상기에서 구강건강 연산부는 상기 구강 검진 부스로부터 전송된 구강 이미지를 구강건강 예측대상으로 등록하는 이미지 등록부; 상기 이미지 등록부에 등록된 이미지를 CNN(Convolutional Neural Network) 알고리즘으로 학습 하여 이미지의 분석 가능 여부와 교정 여부 및 발치 여부를 판단하고, 판단한 결과 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태정보를 획득하며, 획득한 교정 여부 정보 및 발치 여 부 정보와 치아우식 상태정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로 학습하여 구 강건강 상태를 판정하는 구강 진단부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 구강 검진 부스(Booth)를 통해 비대면으로 누구나가 쉽게 자가 구강검진을 하여 구강 상태를 점검할 수 있도록 함으로써, 구강건강 증진을 도모해주는 효과가 있다. 또한, 본 발명에 따르면 실시간으로 이용자의 구강건강을 분석할 수 있으며, 구강 이미지로 구강 건강을 분석함 으로써 구강 질환의 분석에 정확성도 도모해주는 효과가 있다. 또한, 본 발명에 따르면 구강 검진 부스를 통해 예방적 구강 관리를 도모해줌으로써, 이용자의 편의성을 향상해 줄 수 있는 효과도 있다."}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 본 발명의 바람직한 실시 예에 따른 부스기반 자가 구강검진장치를 첨부된 도면을 참조하여 상세하게 설명 한다. 이하에서 설명되는 본 발명에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 안 되며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념으로 적절하게 정의할 수 있 다는 원칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야만 한다. 따라서 본 명세서에 기재된 실시 예와 도면에 도시된 구성은 본 발명의 바람직한 실시 예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원 시점에서 이들을 대체할 수 있는 다양한 균등물과 변형 예들이 있을 수 있음을 이해하여야 한다. 도 1은 본 발명의 바람직한 실시 예에 따른 부스기반 자가 구강검진장치의 전체 구성도로서, 구강 검진 부스 , 구강관리 서비스서버 및 구강건강 관리서버를 포함할 수 있다. 구강 검진 부스는 이용자의 구강을 촬영하고, 촬영된 이용자의 구강 이미지를 보정 한 후, 보정한 구강 이 미지와 진단 요청 정보를 매핑하여 구강검진 진단요청정보를 생성하고, 생성한 구강검진 진단요청정보를 구강관 리 서비스서버에 전송하는 역할을 한다. 여기서 이용자는 구강 검진 부스를 이용하여 이용자 개인정보(이용자 스마트폰 정보, 이메일 정보 등), 문 진 데이터와 같은 일반 데이터 등을 제공할 수 있다. 구강 검진의 형태는 간편 검진과 일반 검진이 있으며, 간 편 검진일 경우에는 단순히 이용자 개인 정보(기기 ID, 이용자 정보)와 구강 이미지만을 제공하면 되고, 일반 검진일 경우에는 이용자 개인 정보와 문진 데이터와 구강 이미지를 제공하면 된다. 이용자는 구강 검진 부스 또는 이용자 단말을 이용하여 구강검진 진단결과를 수신하고, 이를 통해 자신의 구강건강 상태를 인지하며, 구강건강 상태가 좋지 않은 것으로 예측되면 치과병원 등을 방문하여 후속 조치를 취하여 구강건강을 관리하는 것이 바람직하다. 여기서 이용자 단말은 스마트폰 및 스마트 패드와 같은 모바일 기기, 인터넷이 가능한 퍼스널컴퓨터 및 노트북 컴퓨터 등으로 구현할 수 있으며, 본 발명에서는 실시 예로 모 바일 애플리케이션을 이용하는 스마트폰으로 구현된 것으로 가정한다. 상기 구강 검진 부스는 공공장소 및 기관(예를 들어, 학교, 관공서, 보건소, 회사, 공단 등)에 설치된 하 드웨어 형태로서 공공장소 및 기관 등 다양한 장소에서 간편하게 구강질환을 검사할 수 있도록 한 부스 형태의 검진 장비이다. 여기서 이용자는 구강 검진 부스를 통해 구강검진을 요청하고, 구강검진 진단결과를 이용자 단말(예를 들 어, 이용자 스마트폰)로 전송토록 전송위치를 설정하거나, 종이 인쇄(프린트 출력)로 전송위치를 설정할 수 있 다. 즉, 이용자는 구강검진 진단결과를 수신할 수단으로 이용자 스마트폰을 선택하여 구강검진 진단결과를 이용자의 스마트폰에서 직접 수신할 수 있으며, 프린트 출력을 선택하여 구강 검진 부스의 소정 위치에 구비된 프린 트를 통해 현장에서 실시간으로 구강검진 결과를 인쇄물로 확인할 수 있다. 이러한 구강 검진 부스는 이용자가 들어가서 구강을 촬영하고 구강 검진을 요청하며, 구강검진 결과를 인 쇄물로 현장에서 실시간으로 확인할 수 있는 다양한 장비가 내장 또는 설치된 몸체를 구비한다. 이러한 몸 체는 이용자 1인이 들어가서 구강을 촬영할 때 불편함이 없도록 충분한 공간이 마련된다. 상기 몸체의 소정 위치에는 이용자의 구강을 촬영하는 카메라가 설치된다. 이용자는 카메라를 통해 구강을 촬영함으로써, 별도의 구강 촬영 장비를 준비할 필요가 없다. 상기 몸체에는 상기 카메라에 의해 촬영된 이용자의 구강 이미지의 보정 및 전송을 제어하며, 구강검 진 진단결과의 출력을 제어하는 제어장치인 제어기가 소정 위치에 구비된다. 이러한 제어기에는 사용 자가 터치를 통해 기능을 선택하거나 구강검진 진단결과의 전송 위치를 선택할 수 있다. 또한, 상기 몸체의 임의 위치에는 상기 제어기의 제어에 따라 구강검진 진단결과를 종이에 인쇄해주 는 프린터가 설치되어 있다. 이러한 프린터를 통해 이용자는 현장에서 실시간으로 구강검진 진단결과 를 인쇄물로 확인할 수 있다. 한편, 상기 제어기는 도 2에 도시한 바와 같이, 이용자가 구강 검진을 위해 조작하기 위한 복수의 기능 버 튼을 포함하고, 상기 기능 버튼의 조작에 대응하는 기능 입력 신호를 출력하는 조작부를 포함한다. 여기서 조작부는 입력장치가 터치 패널일 경우, 터치 패널에 아이콘으로 표시되는 기능 버튼을 터치하는 것으로 다양한 기능을 선택 또는 설정할 수 있다. 조작부가 터치 패널이 아닐 경우에는, 기능을 확인하거나 기타 정보 확인이나 진단 장비의 사용법을 위한 정보를 디스플레이해주는 표시장치와 기능 입력을 위한 다수의 버튼 등이 별도로 마련되어야 한다. 본 발명에서는 조작부가 터치 패널로 구현되어, 정보 입력과 정보 표시가 가능한 것으로 가정한다. 상기 제어기는 상기 조작부에서 출력된 기능 입력 신호에 따라 입력 기능을 인식하고, 상기 카메라 에 의해 촬영된 이용자의 구강 이미지의 보정 및 전송을 제어하며, 구강검진 진단결과의 출력을 제어하는 제어부를 포함한다. 상기 제어부는 이용자가 검진 모드 중 간편 검진을 선택하면 상기 구강이미지 보정부에 의해 보정된 구강 이미지와 이용자 개인정보만을 이용하여 구강검진을 요청한다. 이용자가 검진 모드 중 일반 검진을 선택하 면 상기 구강이미지 보정부에 의해 보정된 구강 이미지와 상기 문진 응답부에서 생성한 문진 응답 정 보와 이용자 개인정보를 이용하여 구강 검진을 요청한다. 여기서 이용자 개인정보에는 이용자 정보와 기기 ID 정보(구강 검진 부스 ID 정보)를 포함할 수 있다. 이러한 이용자 개인정보는 추후 구강검진 결과정보의 전송 시보안을 위한 웹 토큰(접근 토큰)의 발행 정보로 활용될 수 있다. 아울러 상기 제어기는 상기 제어부의 제어에 따라 상기 카메라를 통해 촬영된 이용자의 구강 이 미지를 보정하여 선명도를 높이는 구강이미지 보정부, 상기 제어부의 제어에 따라 상기 구강이미지 보정부에 의해 보정된 구강 이미지와 진단 요청 정보를 포함한 구강검진 진단요청정보를 상기 구강관리 서 비스서버로 전송하여 구강검진 진단을 요청하고, 수신한 구강검진 진단결과를 상기 제어부에 전달하 는 통신부를 포함한다. 여기서 통신부는 네트워크를 통해 구강관리 서비스서버와 접속된다. 구강 검진 부스와 구강건강 서비스서버는 다양한 유무선 네트워크로 연결될 수 있으며, 실시간성을 갖고 통신 인터페이스가 이루어질 수 있다. 구강관리 서비스서버와 구강건강 관리서버로 서버를 복수로 구현한 이유는 진단 결과의 보안성을 높 여 개인정보의 유출을 방지하고자 한 것이다. 실제 건강관리 및 개인정보는 구강건강 관리서버에서 모두 관리하되 웹 토큰을 통해 정보를 전송하여 보안성을 향상하고, 구강관리 서비스 서버는 단순히 정보의 인 터페이스와 병원 예약 등의 단순 서비스만을 처리하도록 하여, 신속한 서비스가 이루어지도록 하였다. 또한, 상기 제어기는 다양한 정보 저장을 위한 메모리, 구강검진 문진에 대한 이용자의 답변 정보를 조작부를 통해 획득하고, 획득한 이용자의 답변 정보를 이용하여 문진 응답 정보를 생성하여 상기 제어부 에 전달하는 문진 응답부, 상기 제어부의 제어에 따라 구강검진 진단결과를 프린터로 전송 하는 인쇄 출력부를 포함한다. 구강관리 서비스서버는 상기 구강 검진 부스로부터 제공되는 구강검진 진단요청정보를 구강건강 관리 서버에 전송하여 구강검진 진단을 요청하고, 구강검진 진단결과를 이용자에게 전송하는 역할을 한다. 이러한 구강관리 서비스서버는 상기 구강 검진 부스로부터 전송된 구강검진 진단요청정보에 포함된 구강검진 진단결과의 전송 위치를 확인하고, 상기 구강검진 진단결과의 전송 위치에 따라 구강검진 진단결과를 상기 구강 검진 부스로 전송하거나 이용자가 등록한 이용자 단말로 전송해준다. 구강건강 관리서버는 상기 구강관리 서비스서버로부터 전송된 구강검진 진단요청정보에 포함된 구강 이미지를 진단하여 구강건강정보를 생성하고, 생성한 구강건강정보를 암호화하여 구강검진 진단결과로 상기 구 강관리 서비스서버에 전송하는 역할을 한다. 여기서 구강 검진 부스와 구강관리 서비스서버 및 구강건강 관리서버는 암호화된 구강검진 진단 결과의 송수신을 통해 해킹에 의한 자료 누출시에도 보안성을 향상하는 것이 바람직하다. 상기 구강건강 관리서버는 구강검진 진단결과 전송 시 구강 검진 부스 ID와 이용자 정보를 이용한 접근 토 큰(access token)을 이용하여 접근 대상의 권한을 제한하여 보안성을 향상하는 것이 바람직하다. 이러한 구강건강 관리서버는 수신한 구강 이미지를 인공지능 알고리즘인 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 사진의 분석 가능 여부와 교정 여부 및 발치 여부를 판단하고, 판단한 결과 정 보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태정보를 획득하고, 획득한 치 아우식 상태정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로 학습하여 구강건강 상태 를 판정하는 구강건강 연산부, 상기 구강건강 연산부에서 판정한 구강건강정보를 구강검진 진단결과 로 생성하고, 생성한 구강검진 진단결과를 암호화하여 상기 구강관리 서비스서버에 전송하는 구강건강정보 제공부, 구강진단을 위한 빅 데이터, 개인 정보, 암호화 알고리즘 등이 저장된 데이터베이스를 포함 할 수 있다. 상기 구강건강정보 제공부는 상기 구강검진 진단결과를 상기 구강관리 서비스서버에 전송해주는 역할 을 한다. 상기 구강건강 연산부는 도 3에 도시한 바와 같이, 상기 구강 검진 부스로부터 전송된 구강 이미지를 구강건강 예측대상으로 등록하는 이미지 등록부, 상기 이미지 등록부에 등록된 이미지를 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 이미지의 분석 가능 여부와 교정 여부 및 발치 여부 를 판단하고, 판단한 결과 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태 정보를 획득하며, 획득한 교정 여부 정보 및 발치 여부 정보와 치아우식 상태정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로 학습하여 구강건강 상태를 판정하는 구강 진단부를 포함할 수 있다.이와 같이 구성된 본 발명에 따른 부스기반 자가 구강검진장치의 동작을 구체적으로 설명하면 다음과 같다. 먼저, 구강 검진을 자가 진단하기 위한 구강 검진 부스를 학교, 관공서, 보건소, 회사, 공단 등의 공공장 소 및 기관에 설치해 놓는다. 해당 시설을 이용하는 이용자는 자신의 구강건강 상태를 자가 검진하고 관리하기 위해서, 시설에 설치된 구강 검진 부스를 방문한다. 이후, 이용자는 구강건강 상태를 확인하기 위해서, 제어기에 마련된 조작부를 통해 구강 검진 요청을 한다. 조작부를 통해 구강 검진 요청이 발생하면, 제어기 내의 제어부에서 터치 패널로 이루어진 조작 부의 화면을 통해 구강검진 방법을 안내한다. 여기서 구강검진 방법의 안내로서 이용자의 개인 정보를 요청하고, 구강검진 진단결과의 정보를 전송할 위치를 선택하도록 한다. 이용자는 이러한 요청에 따라 간단한 개인정보(성명, 생년월일, 전화번호 등)를 입력한다, 필 요에 따라 이용자가 지문과 같은 생체정보를 입력하는 것으로 개인정보 입력을 대체할 수도 있다. 여기서 이용자는 개인정보로서 기본적인 사용자 개인 정보를 입력하고, 더욱 정확한 구강검진을 위해 병력사항 이나 복약중인 약 또는 신체의 특이 사항(고혈압, 저혈압, 당뇨, 심장질환, 변비, 임신, 기타) 등을 등록할 수 도 있다. 이후, 이용자는 구강검진 진단결과의 정보를 전송할 위치 즉, 구강검진 진단결과를 수신할 위치를 선택한다. 예 컨대, 현장의 구강 검진 부스에서 인쇄물로 구강검진 진단결과를 직접 수령하거나 이용자가 휴대한 스마트 폰과 같은 이용자 단말을 구강검진 진단결과 수신 위치로 선택할 수 있다. 이러한 개인정보 입력 및 구강검진 진단결과 전송 위치의 선택이 종료되면, 제어부는 조작부의 화면 을 통해 카메라에 구강을 촬영하도록 안내한다. 즉, 카메라의 중심에 입을 벌려 구강 촬영이 이루어 지도록 안내한다. 여기서 구강 검진 부스는 다수의 대중이 사용하는 시설이므로, 오염이 쉽게 이루어질 수 있으며, 특히 구 강진단 장비이므로 입속 세균에 의해 더욱 오염이 심화 될 수 있다. 이러한 카메라의 오염 문제로 인해 이 용자의 이용이 망설여질 수 있다. 따라서 이러한 카메라의 오염 문제를 해결하기 위해서 구강 검진 부스의 몸체의 소정 위치에는 상기 카메라의 오염을 제거할 수 있는 카메라 살균장치를 구비시킨다. 여기서 카메라 살균 장치(10 3)는 카메라에 살균액을 분사하고 건조 기능을 통해 살균하는 화학적인 살균 방법, 자외선과 같은 파장을 이용하여 살균을 하는 물리적인 살균 방법을 이용할 수 있다. 이러한 살균 방법을 이용하여 카메라를 살균함으로써, 카메라가 오염이 되는 것을 방지함과 동시에 이용자가 항상 청결한 상태의 카메라를 이용할 수 있도록 한다. 이용자는 조작부를 통해 안내되는 안내 정보에 따라 카메라에 구강을 촬영한다. 구강 촬영이 이루어지면 제어부는 카메라를 통해 획득한 구강 이미지를 구강이미지 보정부에 전 달한다. 상기 구강이미지 보정부는 입력된 구강 이미지를 보정하여 선명도를 높인다. 즉, 입력된 구강 이미지는 비 정형화된 이미지로서, 카메라나 촬영자에 의해 화질이나 촬영 위치 등이 달라져 검진 결과가 달라질 수 있다. 따라서 비정형화된 사진에 대하여 보정이 필요하다. 비정형화된 사진의 보정을 위해, 입력된 구강 이미지를 미리 설정된 크기로 분할하고, 방향 조절을 하여 정면 이미지가 되도록 한다. 방향 조절은 구강 구조를 통해 위치를 인식하는 방법으로 인식하여 정면으로 조절을 할 수 있다. 이어, 방향이 조절된 분할 이미지를 이미지 샤핀 필터(Image Sharpen Filter)로 필터링 처리하여 선명 도를 높인다. 여기서 이미지 샤핀 필터로 사진의 선명도를 높이는 기법은 이미 영상 처리분야에 알려진 공지의 기술이므로, 그에 대한 구체적인 설명은 생략하기로 한다. 여기서 이용자는 구강 촬영이 종료된 상태에서, 검진 모드를 선택한다. 즉, 구강 촬영이 종료되면 화면에 검진 목록이 디스플레이되고, 이러한 화면에서 이용자는 검진 모드를 선택한 다. 여기서 검진 목록은 간편 검진과 일반 검진 모드가 있다. 간편 검진은 이용자의 개인 정보와 구강 이미지만을 이용하여 자가 검진을 요청하는 모드이며, 일반 검진은 이 용자의 개인 정보와 구강 이미지 및 문진 정보를 제공하고 자가 검진을 요청하는 모드이다. 일반 검진 모드 시 문진 응답부는 조작부에 문진을 표시하고, 이용자가 응답을 선택하도록 한다. 이 용자는 조작부에 표시되는 문진 응답 요청에 대하여 응답을 한다. 응답은 답변을 선택하는 터치만으로 간 단하게 진행할 수 있다. 문진 응답 요청에 따라 응답을 완료하고 구강검진 진단을 요청한다. 간편 검진이 선택되거나 일반 검진의 문진 응답이 종료되면 제어부는 이용자의 행위는 종료된 것으로 판단 한다. 이후, 제어부는 간편 진단 모드 시 이용자 개인정보와 구강검진 진단결과 전송 위치 정보, 보정된 구강 이 미지 정보 및 병력사항이나 복용약 정보 등을 포함하여 구강검진 진단요청정보를 생성한다. 아울러 일반 검진 모드 시에는 이용자 개인정보와 구강검진 진단결과 전송 위치정보, 보정된 구강 이미지 정보, 문진 응답 정보 및 병력사항이니 복용약 정보 등을 포함하여 구강검진 진단요청정보를 생성한다. 이후 생성한 구강검진 진단요청정보를 통신부를 통해 구강관리 서비스 서버로 전송한다. 상기 구강관리 서비스 서버는 네트워크를 통해 접속한 구강 검진 부스로부터 구강검진 진단요청정보 가 수신되면 이를 구강건강 관리서버로 전송한다. 구강건강 관리서버의 구강건강 연산부의 이미지 등록부는 전송된 구강검진 진단요청정보에 포함 된 구강 이미지만을 추출하여 구강건강 검진대상 이미지로 내부 데이터베이스에 등록한다. 여기서 구강 이미지 는, 개인이 직접 촬영하기에 촬영 환경이 각각 달라 실제 촬영 이미지 색상의 기준이 없다. 따라서 기준점을 잡 아서 모든 사진들이 기준점과 동일하도록 색상 보정을 자동으로 진행한 후 저장한다. 이어, 구강 진단부는 구강 이미지를 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 사진의 분석 가능 여부와 교정 여부 및 발치 여부를 판단한다. 다음으로, 판단한 결과 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보, 치주염 상태 정보, 보철물 상태정보를 획득하고, 획득한 치아우식 상태정보 및 보철물 상태정보를 ANN(Artificial Neural Network) 알고리즘으로 학습하여 구강건강 상태를 판정 한다. 예컨대, 구강 이미지를 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 구강 이미지 유무를 판단한 다. 구강 이미지를 CNN 알고리즘으로 학습하여 구강 이미지 유무를 판단하는 과정이 도 4에 도시되어 있다. 이 를 위해 촬영되어 등록 요청된 이미지가 구강 이미지인지 판정하는 CNN 모델이 구축된 것으로 가정한다. 사전 훈련된 CNN 모델은 VGG16(https://neurohive.io/en/popular-networks/vgg16/), ResNet50 등과 같이 이미 알려 진 CNN 모델에 구강 이미지 범주를 추가하여 사용하는 것이 바람직하다. 학습 데이터로는 구강 이미지 데이터, 추가할 범주의 이미지 데이터일 수 있다. 이러한 구강 이미지 데이터를 이용하여 CNN 모델로 학습을 하여 구강 이미지 유무를 판단한다. 여기서 추가되는 학습 데이터의 양에 따라 학습시간이 달라질 수 있다. 구강 이미지 유무를 확인한 결과 구강 이미지로 판정이 되면, 구강 이미지를 도 5에 도시한 CNN(Convolutional Neural Network) 알고리즘으로 학습하여 교정 여부를 판단한다. 여기서 도 5는 입력된 구강 이미지로부터 교정 여부를 판정하는 CNN 모델의 예시이다. 이러한 CNN 모델은 AutoKeras를 이용하여 CNN 모델을 구축할 수 있다. 사전 훈련된 VGG16, ResNet50 등을 이용한 전이학습(transfer learning 가능)을 이용할 수도 있다. 필요 데이 터는 교정기 착용/미착용 구강 사진 데이터이며, CNN 모델에 구강 사진 범주 2가지(교정기 착용/미착용)를 추가 함으로써, 간단하게 교정 여부를 판단할 수 있다. 이러한 CNN 모델을 이용하여 교정 여부를 판정할 수 있으나, 이 또한 충분한 학습 시간 및 데이터가 필요하고, 학습 데이터의 증가는 결과적으로 계산량 증가를 유발한다. 따라서 이용자의 문진표 작성을 통해 교정 여부를 선택하도록 유도하여, 교정 여부를 판단하기 위한 CNN(Convolutional Neural Network) 알고리즘의 학습 과정을 생략할 수도 있다. 문진표 작성을 통해 문진 정보가 제공된 경우, 문진 정보를 FFNN(Feed Forward Neural Network) 알고리즘으로 분류한다. 여기서 FFNN 알고리즘은 설문 응답(사용자 정보)이 입력이고, 진단 결과가 출력이 되는 기계학습 알 고리즘이다. Tensorflow, Keras 등의 Python 기반 라이브러리를 사용하여 입출력 구조에 적합한 FFNN를 설계하여 사용하는 것이 바람직하다. 활성화 함수, 손실 함수, 최적화 방법, 병렬 컴퓨팅 구조, 과적합 문제 등에 대 해서는 최근 연구 및 분석된 FFNN 알고리즘을 이용할 수 있다. 입력 데이터(설문 응답)를 전처리하고, 전처리 데이터를 학습 데이터와 검증 데이터로 분할한다. 이어, 학습 데이터는 신경 회로망 학습을 통해 학습이 이루어 지고, 검증 데이터와 학습 결과 데이터를 검증 및 보완 절차를 통해 새롭게 설계된 신경 회로망으로 학습 된다. 그리고 검증 및 보완이 완료되면 최종 모델이 설문 진단 결과로 출력된다. 여기서 구축된 CNN 모델을 이용하여 교정 여부를 판정하는 것도 가능하나, 부가적으로 동일한 CNN 모델을 이용 하여 발치 여부도 판정할 수 있다. CNN 모델에 발치 구강 이미지 범주를 추가하면, 간단하게 발치 여부도 판정 할 수 있다. 다음으로, 판단한 교정 여부 정보와 발치 여부 정보를 개체 탐지(Object Detection)로 분석하여 치아우식 상태 정보 및 보철물 상태정보를 획득한다. 이를 위해 도 6과 같은 입력된 구강 이미지로부터 구강질환(치아우식) 및 보철물 탐지를 판정하는 개체 탐지(Object Detection) 알고리즘을 구축한다. 구강질환 및 보철물 탐지를 판정하 는 개체 탐지 알고리즘은 기개발된 Faster R-CNN, SSD, YOLO(W.Liu et al., 2015, arXiv(http://arxiv.org/abs/1512.02325)) 등을 이용할 수 있다. 상기 개체 탐지 알고리즘으로 치아우식 상태 정보 및 보철물 상태 정보를 획득하기 위한 필요 데이터로는 구강질환 및 보철물이 표시된 구강 이미지 데이터 를 이용할 수 있다. 교정기 착용 여부를 구분하여 학습함으로써 정확도를 향상시킬 수 있다. 하나의 알고리즘으 로 치아우식과 보철물을 모두 탐지할 수 있는 장점이 있다. 여기서 치아우식 상태정보는 치아우식의 존재 유무 정보와 치아우식이 존재할 경우 치아우식 개수정보를 포함할 수 있으며, 상기 보철물 상태정보는 보철물 존재 유무 정보와 보철물이 존재할 경우 보철물 개수정보를 포함할 수 있다. 치아우식 이미지 학습은 이용자가 제공 한 구강 이미지가 전체 구강 부위의 어느 부위인지를 확인하고, 구강 부위 이미지의 위치를 확인한 후 이미지 학습을 수행하고, 이를 통해 치아우식 존재 유무와 치아우식 개수를 추출한다. 동일한 방법으로, 보철물 존재 유무와 보철물 개수도 추출한다. 이어, 상기 교정 여부 정보 및 발치 여부 정보와 치아우식 상태정보 및 보철물 상태정보를 도 7과 같은 ANN(Artificial Neural Network) 알고리즘(2019년 NIMS 산업수학 문제해결 워크숍 제안 모델)으로 학습하여 구 강건강 상태를 판정한다. 여기서 인공지능 알고리즘인 ANN 알고리즘은 상기 교정 여부 정보와 발치 여부 정보와 치아우식 상태정보 및 보철물 상태정보를 입력(input)으로 하여, 구강 건강상태(구강건강도)를 판정한다. 이를 위해 전문의 또는 전공의로부터 획득한 신뢰할 수 있는 구강 이미지 데이터에 해당하는 환자의 구강건강도 판정 자료를 이용할 수 있다. 구강 진단의 정확성을 도모하기 위해서, 획득한 구강 이미지 데이터에 교수급의 전문의 가 환부 부위에 마킹을 한 구강 이미지 데이터를 이용할 수 있다. 마킹도 단순 질병의 유무가 아닌 질병의 정도 (우식의 경우 치아우식을 판별하는 체계인 ICDAS 등급을 활용) 및 보철, 레진, 저광화 등 치아 및 잇몸과 관련 된 대부분의 경우의 수를 마킹한 것이다. 상기 구강 건강 상태 판정이 완료되면 구강건강 예측정보를 생성하여 내부 데이터베이스에 저장한다. 다음으로, 구강건강정보 제공부는 상기 판정을 통해 획득한 구강검진 진단결과를 구강관리 서비스 서버 에 전송한다. 이때, 구강검진 진단결과의 무단 유출을 방지하기 위해서, 암호화 모듈을 이용하여 구강검진 진단결과를 암호화 한다. 암호화는 전달받거나 미리 등록된 이용자 단말의 기기 ID와 이용자 정보를 이용하여 256비트의 웹 접근 토큰을 발생하는 방식을 이용한다. 이렇게 암호화된 구강검진 진단결과는 구강관리 서비스 서버에 전달된다. 구강관리 서비스 서버는 구강검진 진단요청정보에 포함된 구강검진 진단결과 전송 위치 정보를 확인하여, 현장에 직접 인쇄물로 수령이면 구강검진 진단결과를 구강 검진 부스로 전송한다. 이와는 달리 구강검진 진단결과 전송 위치가 이용자의 단말일 경우, 구강검진 진단결과를 MMS 데이터로 변환하고, 이를 이용자가 등록 한 이용자 단말로 전송한다. 여기서 구강검진 진단결과는 구강 검진 보고서 형태일 수 있다. 구강건강 관리서버에서 구강검진 진단결과가 이용자 단말이나 구강 검진 부스까지 전송되기 이전에 해킹 등과 같은 방식에 의해 무단으로 허가되지 않은 자에게 유출되어도, 이용자 기기 ID(구강 검진 부스 ID)와 이용자 정보로 웹 토큰이 암호화되어 있어서, 이용자 기기 ID와 이용자 정보를 모르는 타인은 구강검진 결과 정 보를 확인할 수 없어, 보안성 향상을 도모할 수 있게 된다. 구강 검진 부스의 통신부는 수신한 구강검진 진단결과를 제어부에 전달한다. 제어부는 수신한 구강검진 진단결과를 복호화 모듈을 이용하여 등록된 이용자 기기 ID(구강 검진 부스 I D)와 이용자 정보를 이용하여 웹 접근 토큰을 복호화한다. 복호화하는 암호화의 역순이 된다. 이용자 기기 ID와 이용자 정보가 일치하는 경우에는 암호화된 구강검진 결과를 확인할 수 있다. 이렇게 웹 토큰 발행 시 암호화 정보를 이용함으로써, 허가받지 않은 사용자가 구강검진 진단결과에 접근하는 것을 원천적으로 방지할 수 있다. 제어부는 복호화한 구강검진 진단결과를 인쇄 출력부로 전달하여 인쇄가 이루어지도록 한다. 인쇄 출 력부는 수신한 구강검진 진단결과를 프린터의 형식에 맞는 데이터 포맷으로 변환하여 프린터로 전달한다. 프린터는 전달되는 구강검진 진단결과를 종이에 인쇄한 후 출력해준다. 이로써 이용자는 현장의 구강 검진 부스를 통해 구강 진단 결과를 실시간으로 인쇄물로 확인할 수 있다. 만약, 이용자가 이용자 단말로 구강검진 진단결과의 전송 위치를 선택하였으면, 이용자는 자신이 휴대한 이용자 단말을 이용하여 구강검진 진단결과를 수신한다. 이후, 미리 등록된 복호화 모듈을 이용하여 등록된 이용자 기 기 ID와 이용자 정보를 이용하여 웹 접근 토큰을 복호화한다. 복호화하는 암호화의 역순이 된다. 사용자 기기 ID와 사용자 정보가 일치하는 경우에는 암호화된 구강검진 결과를 열어볼 수 있다. 이렇게 웹 토큰 발행 시 암호화정보를 이용함으로써, 허가받지 않은 사용자가 구강검진 진단결과에 접근하는 것 을 원천적으로 방지할 수 있다. 이용자는 구강진단 결과를 토대로 구강상태를 판단한다. 여기서 구강진단 결과는 보고서 형태이며, 구강의 어느 질병이 있다는 전문의가 진단하는 정보가 아니며, 어느 부분에 문제가 있을 수 있으며, 이러한 상태가 지속되면 추후 다음 문제가 발생한다는 등의 상태 정보이다. 예컨대, 구강진단 결과는 10단계로 구분할 수 있다. 1 ~ 3단계는 좋음, 4 ~ 7단계는 보통, 8 ~ 10단계는 위험 등으로 표시된다. 따라서 이용자는 구강진단 결과를 보고 단계를 확인하고, 이를 통해 구강 관리를 한다. 특히, 사용자는 이러한 구강진단 결과 보고서를 통해 구강 상태에 문제가 있다고 판단이 되면( 구강진단 결과 8 ~ 10단계 범위), 즉시 치과를 방문하여 자신의 구강건강을 관리하고, 구강건강 악화를 사전에 예방할 수 있게 되는 것이다. 이상 본 발명자에 의해서 이루어진 발명을 상기 실시 예에 따라 구체적으로 설명하였지만, 본 발명은 상기 실시"}
{"patent_id": "10-2020-0115659", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "예에 한정되는 것은 아니고 그 요지를 이탈하지 않는 범위에서 여러 가지로 변경 가능한 것은 이 기술분야에서 통상의 지식을 가진 자에게 자명하다."}
{"patent_id": "10-2020-0115659", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 부스기반 자가 구강검진장치의 전체 구성도, 도 2는 도 1의 검진 부스의 실시 예 구성도, 도 3은 도 1의 구강건강 연산부의 실시 예 구성도, 도 4 내지 도 7은 본 발명에서 구강 이미지를 분석하기 위한 인공지능 알고리즘 예시 도이다."}
