{"patent_id": "10-2024-7039361", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0016149", "출원번호": "10-2024-7039361", "발명의 명칭": "기계 학습 또는 인공 지능 지원 CSI 피드백을 지원하는 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "로 갈렙"}}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 장치(UE)에 있어서,채널 상태 정보(CSI) 보고와 연관된 기계 학습(ML) 기반 파라미터 설정을 지원하도록 UE의 능력을 나타내는 능력 정보를 송신하고,상기 CSI 보고와 연관된 상기 ML 기반 파라미터 설정에 대한 파라미터를 나타내는 설정 정보를 수신하며,CSI 기준 신호(RS)를 수신하도록 설정된 송수신기; 및상기 송수신기에 동작적으로 결합된 프로세서를 포함하며, 상기 프로세서는,상기 CSI-RS를 측정하고,상기 설정 정보, 상기 측정된 CSI-RS, 및 하나 이상의 도메인에서 채널 통계의 국소적 관찰과 관련된 정보를 기반으로 상기 CSI 보고에 대한 상기 하나 이상의 도메인에서의 설정 파라미터를 결정하고,상기 하나 이상의 도메인에서의 설정 파라미터를 기반으로 CSI 보고를 결정하도록 설정되며,상기 송수신기는 상기 CSI 보고를 송신하도록 설정되는, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 하나 이상의 도메인은 공간 도메인 또는 주파수 도메인을 포함하고,상기 파라미터는 상기 CSI 보고와 연관된 공간 도메인 벡터의 수 또는 주파수 도메인 벡터의 수를 나타내는 명령을 포함하고,상기 프로세서는 상기 공간 도메인 벡터의 수 또는 상기 주파수 도메인 벡터의 수를 결정하도록 더 설정되며,상기 CSI 보고는 상기 공간 도메인 벡터의 수 또는 상기 주파수 도메인 벡터의 수에 대한 지시자(indication)를포함하는, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 파라미터는 공간 도메인 벡터 또는 주파수 도메인 벡터와 연관된 0이 아닌 계수의 수 또는 위상 코드북의크기를 나타내는 명령을 포함하고,상기 프로세서는 상기 0이 아닌 계수의 수 또는 상기 위상 코드북의 크기를 결정하도록 더 설정되고,상기 CSI 보고는 상기 0이 아닌 계수의 수 또는 상기 위상 코드북의 크기를 포함하는, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 파라미터는 포트 선택 코드북의 크기 또는 랭크 지시자에 대한 제한을 나타내는 명령을 포함하고,상기 프로세서는 상기 포트 선택 코드북의 크기 또는 상기 랭크 지시자에 대한 제한을 결정하도록 더 설정되며,상기 CSI 보고는 상기 포트 선택 코드북의 크기 또는 상기 랭크 지시자에 대한 제한의 지시자를 포함하는, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0016149-3-제 1 항에 있어서,상기 파라미터는 (i) 자원 활용 임계값, (ii) 채널 유사도 임계값 및 (iii) 채널 유사도 메트릭 중 적어도 하나를 포함하고;상기 파라미터가 상기 자원 활용 임계값을 포함하는 경우,자원 활용 레벨이 상기 자원 활용 임계값 이상인 경우, 상기 프로세서는 제1 방법에 따라 상기 CSI 보고를 결정하도록 더 설정되고,상기 자원 활용 레벨이 상기 자원 활용 임계값보다 낮은 경우, 상기 프로세서는 제2 방법에 따라 상기 CSI 보고를 결정하도록 더 설정되며;상기 파라미터가 상기 채널 유사도 임계값과 상기 채널 유사도 메트릭 중 적어도 하나를 포함하는 경우,상기 프로세서는 상기 채널 유사도 메트릭을 기반으로 채널 유사도 값을 결정하도록 더 설정되고,상기 채널 유사도 값이 상기 채널 유사도 임계값 이상인 경우, 상기 프로세서는 상기 제1 방법에 따라 상기 CSI보고를 결정하도록 더 설정되고,상기 채널 유사도 값이 상기 채널 유사도 임계값보다 낮은 경우, 상기 프로세서는 상기 제2 방법에 따라 상기CSI 보고를 결정하도록 더 설정되며;상기 제1 방법은 비-ML 기반 방법이고, 상기 제2 방법은 ML 기반 방법인, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 파라미터는 공간 도메인 벡터 또는 주파수 도메인 벡터와 연관된 0이 아닌 계수에 대한 비트맵을 권장하는명령을 포함하고,상기 프로세서는 상기 0이 아닌 계수에 대한 권장된 비트맵을 결정하도록 더 설정되며,상기 CSI 보고는 상기 0이 아닌 계수에 대한 상기 권장된 비트맵의 지시자를 포함하는, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 파라미터는 상기 CSI 보고와 연관된 공간 도메인, 주파수 도메인 또는 시간 도메인 기반을 권장하는 명령을 포함하고,상기 프로세서는 상기 CSI 보고와 연관된 권장된 공간 도메인, 주파수 도메인 또는 시간 도메인 기반을 결정하도록 더 설정되며,상기 송수신기는 상기 권장된 공간 도메인, 주파수 도메인 또는 시간 도메인 기반을 보고하도록 더 설정되는,사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 파라미터는 UE가 설정 타입을 권장하도록 하는 명령을 포함하고,상기 권장된 설정 타입은 비주기적, 반영구적 또는 주기적을 포함하고,상기 프로세서는 상기 권장된 설정 타입을 결정하도록 더 설정되고,상기 송수신기는 상기 권장된 설정 타입을 보고하도록 더 설정되며,상기 프로세서는 상기 권장된 설정 타입 및 상기 설정 파라미터를 기반으로 상기 CSI 보고를 결정하도록 더 설정되는, 사용자 장치(UE)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2025-0016149-4-기지국(BS)에 있어서,채널 상태 정보(CSI) 보고와 연관된 기계 학습(ML) 기반 파라미터 설정을 지원하도록 사용자 장치(UE)의 능력을나타내는 능력 정보를 수신하고,상기 CSI 보고와 연관된 상기 ML 기반 파라미터 설정에 대한 파라미터를 나타내는 설정 정보를 송신하고,CSI 기준 신호(RS)를 송신하며,하나 이상의 도메인에서의 설정 파라미터와 연관된 상기 CSI 보고, 상기 설정 정보와 연관된 상기 하나 이상의도메인에서의 설정 파라미터, 상기 CSI-RS, 및 상기 하나 이상의 도메인에서 채널 통계의 국소적 관찰과 관련된정보를 수신하도록 설정된 송수신기를 포함하는, 기지국(BS)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 하나 이상의 도메인은 공간 도메인 또는 주파수 도메인을 포함하고,상기 파라미터는 상기 CSI 보고와 연관된 공간 도메인 벡터의 수 또는 주파수 도메인 벡터의 수를 나타내는 명령을 포함하며,상기 CSI 보고는 상기 공간 도메인 벡터의 수 또는 상기 주파수 도메인 벡터의 수에 대한 지시자(indication)를포함하는, 기지국(BS)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 파라미터는 공간 도메인 벡터 또는 주파수 도메인 벡터와 연관된 0이 아닌 계수의 수 또는 위상 코드북의크기를 나타내는 명령을 포함하고,상기 CSI 보고는 상기 0이 아닌 계수의 수 또는 상기 위상 코드북의 크기를 포함하는, 기지국(BS)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,상기 파라미터는 포트 선택 코드북의 크기 또는 랭크 지시자에 대한 제한을 나타내는 명령을 포함하고,상기 CSI 보고는 상기 포트 선택 코드북의 크기 또는 상기 랭크 지시자에 대한 제한의 지시자를 포함하는, 기지국(BS)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9 항에 있어서,상기 파라미터는 (i) 자원 활용 임계값, (ii) 채널 유사도 임계값 및 (iii) 채널 유사도 메트릭 중 적어도 하나를 포함하고;상기 파라미터가 상기 자원 활용 임계값을 포함하는 경우,자원 활용 레벨이 상기 자원 활용 임계값 이상인 경우, 상기 CSI 보고는제1 방법을 기반으로 하고;상기 자원 활용 레벨이 상기 자원 활용 임계값보다 낮은 경우, 상기 CSI 보고는 제2 방법을 기반으로 하고;상기 파라미터가 상기 채널 유사도 임계값과 상기 채널 유사도 메트릭 중 적어도 하나를 포함하는 경우;채널 유사도 값은 상기 채널 유사도 메트릭을 기반으로 결정되며,채널 유사도 값이 상기 채널 유사도 임계값 이상인 경우, 상기 CSI 보고는 상기 제1 방법을 기반으로 하고,상기 채널 유사도 값이 상기 채널 유사도 임계값보다 낮은 경우, 상기 CSI 보고는 상기 제2 방법을 기반으로 하며,공개특허 10-2025-0016149-5-상기 제1 방법은 비-ML 기반 방법이고, 상기 제2 방법은 ML 기반 방법인, 기지국(BS)."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "사용자 장치(UE)에 의해 수행되는 방법에 있어서,채널 상태 정보(CSI) 보고와 연관된 기계 학습(ML) 기반 파라미터 설정을 지원하도록 UE의 능력을 나타내는 능력 정보를 송신하는 단계;상기 CSI 보고와 연관된 상기 ML 기반 파라미터 설정에 대한 파라미터를 나타내는 설정 정보를 수신하는 단계;상기 CSI-RS를 측정하는 단계;상기 설정 정보, 상기 측정된 CSI-RS, 및 하나 이상의 도메인에서 채널 통계의 국소적 관찰과 관련된 정보를 기반으로 상기 CSI 보고에 대한 상기 하나 이상의 도메인에서의 설정 파라미터를 결정하는 단계;상기 하나 이상의 도메인에서의 설정 파라미터를 기반으로 CSI 보고를 결정하는 단계; 및상기 CSI 보고를 송신하는 단계를 포함하는, 사용자 장치(UE)에 의해 수행되는 방법."}
{"patent_id": "10-2024-7039361", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "기지국(BS)에 의해 수행되는 방법에 있어서,채널 상태 정보(CSI) 보고와 연관된 기계 학습(ML) 기반 파라미터 설정을 지원하도록 사용자 장치(UE)의 능력을나타내는 능력 정보를 수신하는 단계,상기 CSI 보고와 연관된 상기 ML 기반 파라미터 설정에 대한 파라미터를 나타내는 설정 정보를 송신하는 단계,CSI 기준 신호(RS)를 송신하는 단계, 및하나 이상의 도메인에서의 설정 파라미터와 연관된 상기 CSI 보고, 상기 설정 정보와 연관된 상기 하나 이상의도메인에서의 설정 파라미터, 상기 CSI-RS, 및 상기 하나 이상의 도메인에서 채널 통계의 국소적 관찰과 관련된정보를 수신하는 단계를 포함하는, 기지국(BS)에 의해 수행되는 방법."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 더 높은 데이터 송신률을 지원하기 위한 5G 또는 6G 통신 시스템에 관한 것이다. 기계 학습(ML) 또는 인공 지능(AI) 지원 채널 상태 정보(CSI) 피드백을 지원하는 방법 및 장치가 제공된다. 사용자 장치(UE)에 의해 수행되는 방법은 CSI 보고와 연관된 ML 기반 파라미터 설정을 지원하도록 UE의 능력을 나타내는 능력 정보를 송 신하는 단계; CSI 보고와 연관된 ML 기반 파라미터 설정에 대한 파라미터를 나타내는 설정 정보를 수신하는 단계; 및 CSI-RS를 수신하는 단계를 포함한다. 방법은 또한 CSI-RS를 측정하는 단계; 설정 정보, 측정된 CSI-RS, 및 하나 이상의 도메인에서 채널 통계의 국소적 관찰과 관련된 정보를 기반으로 CSI 보고에 대한 하나 이상의 도 메인에서의 설정 파라미터를 결정하는 단계; 하나 이상의 도메인에서의 설정 파라미터를 기반으로 CSI 보고를 결 정하는 단계; 및 CSI 보고를 송신하는 단계를 포함한다."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 일반적으로 무선 통신 시스템에 관한 것으로서, 보다 구체적으로는 기계 학습(machine learning; ML) 또는 인공 지능(artificial intelligence; AI) 지원 채널 상태 정보(channel state information; CSI) 피드백 을 지원하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동 통신 기술은 높은 송신률(transmission rate)과 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의 하고 있으며, 3.5GHz와 같은 \"Sub 6GHz\" 대역뿐만 아니라 28GHz 및 39GHz를 포함하는 mmWave라고 하는 \"Above 6GHz\" 대역에서도 구현될 수 있다. 또한, 5G 이동 통신 기술보다 50배 빠른 송신률과 5G 이동 통신 기술의 10분 의 1의 초저지연을 달성하기 위해 테라헤르츠 대역(예를 들어, 95GHz 내지 3THz 대역)에서 6G 이동 통신 기술 (Beyond 5G 시스템이라고 함)을 구현하는 것이 고려되었다. 5G 이동 통신 기술 개발의 초기에, eMBB(enhanced Mobile BroadBand), URLLC(Ultra Reliable Low Latency Communications), mMTC(massive Machine-Type Communications)와 관련하여 서비스를 지원하고 성능 요구 사항 을 충족하기 위해, mmWave에서 전파(radio-wave) 경로 손실을 완화하고 전파 송신 거리를 늘리기 위한 빔포밍 (beamforming) 및 대규모 MIMO에 관한 표준화가 진행 중이며, mmWave 자원의 효율적인 활용과 슬롯 포맷의 동적 동작을 위한 수비학(예를 들어, 다수의 부반송파 간격의 동작), 다중 빔 송신 및 광대역 지원을 위한 초기 액세 스 기술, BWP(BandWidth Part)의 정의 및 동작, 대용량 데이터 송신을 위한 LDPC(Low Density Parity Check) 코드, 제어 정보의 신뢰성 높은 송신을 위한 폴라 코드(polar code), L2 전처리, 특정 서비스에 특화된 전용 네 트워크를 제공하기 위한 네트워크 슬라이싱과 같은 새로운 채널 코딩 방식을 지원하고 있다. 현재, 5G 이동 통신 기술에 의해 지원될 서비스 측면에서 초기 5G 이동 통신 기술의 개선 및 성능 향상에 관한 논의가 진행 중이며, 차량에 의해 송신되는 차량의 위치 및 상태에 관한 정보를 기반으로 자율 주행 차량에 의 한 주행 결정을 돕고 사용자 편의성을 향상시키기 위한 V2X(Vehicle-to-everything), 비면허 대역의 다양한 규 제 관련 요구 사항에 부합하는 시스템 동작을 목표로 하는 NR-U(New Radio Unlicensed), NR UE Power Saving, 지상 네트워크와의 통신이 불가능한 지역에 커버리지를 제공하고 포지셔닝(positioning)을 위한 UE-위성 직접 통신인 NTN(Non-Terrestrial Network)와 같은 물리적 계층 표준화가 있었다. 또한, 다른 산업과의 연동 및 융합을 통해 새로운 서비스를 지원하기 위한 IIoT(Industrial Internet of Things), 무선 백홀 링크와 액세스 링크를 통합적으로 지원함으로써 네트워크 서비스 영역 확장을 위한 노드를 제공하기 위한 IAB(Integrated Access and Backhaul), 조건부 핸드오버 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함한 이동성 향상 기술, 및 랜덤 액세스 절차를 단순화하기 위한 2단계 랜덤 액세스(NR용 2단계 RACH)와 같은 기술에 관한 무선 인터페이스 아키텍처/프로토콜의 표준화가 진행되고 있었다. 또한, NFV(Network Functions Virtualization)와 SDN(Software-Defined Networking) 기술을 결합하기 위한 5G 기본 아키텍처(예를 들어, 서비스 기반 아키텍처 또는 서비스 기반 인터페이스), 및 UE 위치에 기반한 서비스를 수신하기 위한 MEC(Mobile Edge Computing)에 관한 시스템 아키텍처/서비스에서의 표준화가 진행되고 있었다. 5G 이동통신 시스템이 상용화됨에 따라, 기하급수적으로 증가하고 있는 커넥티드 장치(connected device)는 통 신 네트워크에 연결될 것이며, 이에 따라 5G 이동 통신 시스템의 기능 및 성능의 향상과 커넥티드 장치의 통합 동작이 필요할 것으로 예상된다. 이를 위해, AR(Augmented Reality), VR(Virtual Reality), MR(Mixed Reality) 등을 효율적으로 지원하기 위한 XR(eXtended Reality), 인공 지능(Artificial Intelligence; AI)과 머신 러닝 (Machine Learning; ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지원, 메타버스 서비스 지원 및 드 론 통신과 관련하여 새로운 연구가 스케줄링되어 있다. 또한, 이러한 5G 이동 통신 시스템 개발은 6G 이동 통신 기술의 테라헤르츠 대역의 커버리지를 제공하기 위한 새로운 파형, FD-MIMO(Full Dimensional MIMO), 어레이 안테나 및 대규모 안테나, 테라헤르츠 대역 신호의 커버 리지를 개선하기 위한 메타물질 기반 렌즈 및 안테나, OAM(Orbital Angular Momentus)을 이용한 고차원 공간 다 중화 기술, 및 RIS(Reconfigurable Intelligent Surface)과 같은 다중 안테나 송신 기술 뿐만 아니라, 6G 이동 통신 기술의 주파수 효율을 높이고 시스템 네트워크를 개선하기 위한 전이중 기술, 설계 단계로부터 위성과 AI(Artificial Intelligence)를 활용함으로써 시스템 최적화를 구현하고 단대단(End-to-End) AI 지원 기능을 내재화하기 위한 AI 기반 통신 기술, 및 초고성능 통신과 컴퓨팅 자원을 활용함으로써 UE 동작 능력의 한계를 뛰어넘는 복잡도 레벨의 서비스를 구현하기 위한 차세대 분산 컴퓨팅 기술을 개발하기 위한 기반이 될 것이다. 5세대(5G) 또는 NR(new radio) 이동 통신은 최근에 산학연의 다양한 후보 기술에 대한 전 세계적인 기술 활동이 활발해짐에 따라 더욱 탄력을 받고 있다. 5G/NR 이동 통신을 위한 후보 인에이블러(candidate enabler)는 기존 셀룰러 주파수 대역에서 고주파수까지 빔포밍 이득을 제공하고 증가된 용량을 지원하기 위한 대규모 안테나 기 술, 다양한 요구 사항을 가진 다양한 서비스/애플리케이션을 유연하게 수용하는 새로운 파형(예를 들어, 새로운 무선 액세스 기술(radio access technology; RAT)), 대규모 연결을 지원하는 새로운 다중 액세스 방식 등을 포 함한다."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "gNB에서의 안테나 포트의 수와 SB의 수는 향후 시스템이 더 엄격한 성능 요구 사항을 충족하도록 증가할 것으로 예상되지만, 미리 정의된 코드북으로부터의 오버헤드 감소는 이에 따라 확장(scale)되지 않을 수 있다. 따라서, DL CSI를 압축하는 대안적인 방법을 지원하도록 UE를 설정하는 것이 유리할 수 있다. 예를 들어, 공간, 주파수 및 시간 도메인에 걸쳐 공동 압축을 수행하는 AI/ML 기반 코드북을 사용하도록 UE를 설정하면 오버헤드가 추가 로 감소할 수 있다. 다른 예로서, Type II 코드북 파라미터를 결정하기 위해 AI/ML 기반 방법을 사용하도록 UE 를 설정하면 오버헤드가 추가로 감소할 수 있으며, 여기서 이러한 코드북은 공간, 주파수 및 시간 도메인에 걸 쳐 압축을 수행한다. 오버헤드 감소와 시간 도메인 상관 관계 간의 연결은 AI/ML 기술을 적용하여 시간 CSI 피 드백을 생성/보고하도록 동기를 부여한다. 부가적인 예로서, 특히 중간/고속 시나리오에서 미래 CSI 인스턴스(instance)를 예측하기 위한 AI/ML 기반 방법 을 사용하도록 UE를 설정하면 성능이 향상될 수 있으며; 이는 시간적 CSI 피드백을 생성/보고하기 위해 AI/ML 기술을 사용하는 경우를 강화한다.본 개시의 다양한 실시예는 CSI 피드백을 생성/보고하기 위한 AI/ML 기반 기술이 5G-NR 표준에서 지원되지 않는 다는 것을 인식한다. 또한, 본 개시의 다양한 실시예는 CSI 피드백을 생성/보고하기 위한 UE 지원 CSI 설정(UE- assisted CSI configuration)이 5G-NR 표준에서 지원되지 않는다는 것을 인식한다. 더욱이, 본 개시의 다양한 실시예는 시간적 CSI 피드백을 생성/보고하기 위한 AI/ML 기반 기술이 5G-NR 표준에서 지원되지 않는다는 것을 인식한다."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시는 ML 또는 AI 지원 CSI 피드백(AI-assisted CSI feedback)의 지원과 관련이 있다. 일 실시예에서, 사용자 장치(user equipment; UE)가 제공된다. UE는 CSI 보고와 연관된 ML 기반 파라미터 설정 을 지원하도록 UE의 능력을 나타내는 능력 정보를 송신하고, CSI 보고와 연관된 ML 기반 파라미터 설정에 대한 파라미터를 나타내는 설정 정보를 수신하며, CSI 기준 신호(reference signal; RS)를 수신하도록 설정된 송수신 기를 포함한다. UE는 또한 송수신기에 동작적으로 결합된 프로세서를 포함한다. 프로세서는 CSI-RS를 측정하고; 설정 정보, 측정된 CSI-RS, 및 하나 이상의 도메인에서 채널 통계의 국소적 관찰(localized observation)과 관 련된 정보를 기반으로 CSI 보고에 대한 하나 이상의 도메인에서의 설정 파라미터를 결정하며; 하나 이상의 도메 인에서의 설정 파라미터를 기반으로 CSI 보고를 결정하도록 설정된다. 송수신기는 CSI 보고를 송신하도록 설정 된다. 다른 실시예에서, 기지국(base station; BS)이 제공된다. BS는 CSI 보고와 연관된 ML 기반 파라미터 설정을 지 원하도록 UE의 능력을 나타내는 능력 정보를 수신하고, CSI 보고와 연관된 ML 기반 파라미터 설정에 대한 파라 미터를 나타내는 설정 정보를 송신하며, 하나 이상의 도메인에서 설정 파라미터와 연관된 CSI 보고를 수신하도 록 설정된 송수신기를 포함한다. 하나 이상의 도메인에서의 설정 파라미터는 설정 정보, CSI-RS, 및 하나 이상 의 도메인에서 채널 통계의 국소적 관찰과 관련된 정보와 연관되어 있다. 또 다른 실시예에서, UE에 의해 수행되는 방법이 제공된다. 이 방법은 CSI 보고와 연관된 ML 기반 파라미터 설 정을 지원하도록 UE의 능력을 나타내는 능력 정보를 송신하는 단계; CSI 보고와 연관된 ML 기반 파라미터 설정 에 대한 파라미터를 나타내는 설정 정보를 수신하는 단계; 및 CSI-RS를 수신하는 단계를 포함한다. 방법은 또한 CSI-RS를 측정하는 단계; 설정 정보, 측정된 CSI-RS, 및 하나 이상의 도메인에서 채널 통계의 국소적 관찰과 관 련된 정보를 기반으로 CSI 보고에 대한 하나 이상의 도메인에서의 설정 파라미터를 결정하는 단계; 하나 이상의 도메인에서의 설정 파라미터를 기반으로 CSI 보고를 결정하는 단계; 및 CSI 보고를 송신하는 단계를 포함한다. 다른 기술적 특징은 다음의 도면, 설명 및 청구항으로부터 통상의 기술자에게 용이하게 명백할 수 있다."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 다양한 실시예는 네트워크가 미리 정의된 코드북과 함께 AI/ML 기반 기술을 사용하여 CSI 피드백을 생성하도록 UE를 설정하는 데 사용할 수 있는 기술을 제공한다. 또한, 본 개시의 다양한 실시예는 네트워크가 CSI 피드백을 생성/보고할 때 CSI 설정을 적용하는 데 도움이 되 는 UE를 설정하는 데 사용할 수 있는 기술을 제공한다. 또한, 본 개시의 다양한 실시예는 네트워크가 미리 정의된 코드북과 함께 AI/ML 기반 기술을 사용하여 시간적 CSI 피드백을 생성하도록 UE를 설정하는 데 사용할 수 있는 기술을 제공한다. 상응하는 시그널링 상세 사항이 또한 논의된다."}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 상세한 설명을 착수하기 전에, 본 특허 문서 전체에 걸쳐 사용된 특정 단어 및 문구를 정의하는 것이 유 리할 수 있다. \"결합(couple)\"이라는 용어 및 이의 파생어는 둘 이상의 요소가 서로 물리적으로 접촉하든 접촉 하지 않든 둘 이상의 요소 간의 어떤 직접 또는 간접 통신을 지칭한다. \"송신한다\", \"수신한다\" 및 \"통신한다\" 이라는 용어뿐만 아니라 이의 파생어는 직접 및 간접 통신 둘 다를 포함한다. \"포함한다(include)\" 및 \"구성한 다(comprise)\"이라는 용어뿐만 아니라 이의 파생어는 제한 없이 포함(inclusion)을 의미한다. \"또는\"이라는 용 어는 포괄적이며, 및/또는(and/or)을 의미한다. \"~와 관련된(associated with)\"이라는 용어뿐만 아니라 이의 파 생어는, \"~를 포함하고(include)\", \"~내에 포함되고(included within)\", \"~와 상호 연결하고(interconnect with)\", \"~을 함유하고(contain)\", \"~내에 함유되고(be contained within)\", \"~에 또는, ~와 연결하고(connect to or with)\", \"~에 또는, ~와 결합하고(couple to or with)\", \"~와 통신 가능하고(be communicable with)\", \"~와 협력하고(cooperate with)\", \"~를 인터리브하고(interleave)\", \"~와 병치하고(juxtapose)\", \"~에 가까이 있고(be proximate to)\", \"~에 또는, ~와 묶이고(be bound to or with)\", \"가지고(have)\", \"소유하고 있고 (have a property of)\", \"~에 또는, ~와 관계를 가지고(have a relationship to or with)\" 등인 것을 의미한다. \"제어부\"라는 용어는 적어도 하나의 동작을 제어하는 임의의 장치, 시스템 또는 이의 일부를 의미한 다. 상기 제어부는 하드웨어 또는 하드웨어 및 소프트웨어의 조합 및/또는 펌웨어로 구현될 수 있다. 임의의 특 정 제어부와 관련된 기능은 로컬로든 원격으로든 중앙 집중화되거나 분산될 수 있다. \"적어도 하나(at least one of)\"라는 문구는, 항목의 리스트와 함께 사용될 때, 나열된 항목 중 하나 이상의 상이한 조합이 사용될 수 있고, 리스트 내에는 하나의 항목만이 필요할 수 있다는 것을 의미한다. 예를 들어, \"A, B 및 C 중 적어도 하나\"는 다음의 조합: A, B, C, A 및 B, A 및 C, B 및 C, 및 A 및 B 및 C 중 어느 하나를 포함한다. 더욱이, 아래에서 설명되는 다양한 기능은 하나 이상의 컴퓨터 프로그램에 의해 구현되거나 지원될 수 있으며, 각각의 컴퓨터 프로그램은 컴퓨터 판독 가능 프로그램 코드(computer readable program code)로부터 형성되고, 컴퓨터 판독 가능 매체(computer readable medium)에서 구현된다. \"애플리케이션\" 및 \"프로그램\"이라는 용어는 적절한 컴퓨터 판독 가능 프로그램 코드에서 구현을 위해 적응된 하나 이상의 컴퓨터 프로그램, 소프트웨어 구 성 요소(software components), 명령어 세트(sets of instructions), 절차, 기능, 객체(object), 클래스, 인스 턴스(instance), 관련된 데이터 또는 이의 일부를 지칭한다. 문구 \"컴퓨터 판독 가능 프로그램 코드\"는 소스 코 드(source code), 객체 코드(object code) 및 실행 가능 코드(executable code)를 포함하는 임의의 타입의 컴 퓨터 코드를 포함한다. 문구 \"컴퓨터 판독 가능 매체\"는 판독 전용 메모리(read only memory; ROM), 랜덤 액세 스 메모리(random access memory; RAM), 하드 디스크 드라이브, 콤팩트 디스크(compact disc; CD), 디지털 비 디오 디스크(digital video disc; DVD), 또는 임의의 다른 타입의 메모리와 같이 컴퓨터에 의해 액세스될 수 있 는 임의의 타입의 매체를 포함한다. \"비일시적(non-transitory)\" 컴퓨터 판독 가능 매체는 일시적 전기적 또는 다른 신호를 송신하는 유선, 무선, 광학 또는 다른 통신 링크를 배제한다. 비일시적 컴퓨터 판독 가능 매체는 데이터가 영구적으로 저장될 수 있는 매체, 및 재기록 가능 광 디스크 또는 소거 가능 메모리 장치와 같이 데이 터가 저장되고 나중에 중복 기록(overwriting)될 수 있는 매체를 포함한다.다른 특정 단어 및 문구에 대한 정의는 본 특허 문서 전체에 걸쳐 제공된다. 통상의 기술자는 대부분의 경우는 아니지만 이러한 정의가 이러한 정의된 단어 및 문구의 이전 및 이후의 사용에 적용된다는 것을 이해해야 한다. 아래에서 논의되는 도 1 내지 도 32, 및 본 특허 문서에서 본 개시의 원리를 설명하기 위해 사용된 다양한 실시 예는 예시만을 위한 것이고, 어떤 식으로든 본 개시의 범위를 제한하는 것으로 해석되지 않아야 한다. 통상의 기술자는 본 개시의 원리가 적절히 배치된 임의의 시스템 또는 장치에서 구현될 수 있다는 것을 이해할 것이다. 다음의 문서 및 표준 설명은 본 명세서에 충분히 설명된 바와 같이 본 개시에 기준으로 통합된다: [1] 3GPP, TS 38.211 v17.4.0, 5G; NR; \"Physical channels and modulation\"; [2] 3GPP, TS 38.331 v17.4.0, 5G; NR; Radio Resource Control (RRC); Protocol specification; [3] 3GPP, TS 38.321 v17.4.0, 5G; NR; Medium Access Control (MAC); Protocol specification; [4] 3GPP, TS 38.214 v17.2.0, 5G; NR; 무선 통신은 현대 역사상 가장 성공적인 혁신 중 하나였다. 최근, 무선 통신 서비스에 대한 가입자의 수는 50억 명을 넘어섰고 계속해서 빠르게 증가하고 있다. 소비자와 기업 사이에서 스마트폰과, 태블릿, \"노트패드\" 컴퓨 터, 넷북, 전자책 리더, 기계 타입의 장치와 같은 다른 모바일 데이터 장치의 인기가 높아지면서 무선 데이터 트래픽에 대한 수요가 빠르게 증가하고 있다. 모바일 데이터 트래픽의 높은 성장을 충족하고 새로운 애플리케이 션과 배포(deployment)를 지원하기 위해서는 무선 인터페이스 효율성과 커버리지의 개선이 무엇보다 중요하다. 4G 통신 시스템의 상용화 이후 증가한 무선 데이터 트래픽에 대한 수요를 충족하고, 다양한 수직적 애플리케이 션(vertical application)을 가능하게 하기 위해, 5G/NR 통신 시스템이 개발되어 현재 배치되고 있다. 5G/NR 통신 시스템은 더 높은 데이터 송신률을 달성하기 위해 더 높은 주파수(mmWave) 대역, 예를 들어, 28GHz 또는 60GHz 대역에서 구현되거나 강력한 커버리지 및 이동성 지원을 가능하게 하기 위해 6GHz와 같은 더 낮은 주파수 대역에서 구현되는 것으로 간주된다. 무선파의 전파 손실을 감소시키고 송신 거리를 증가시키기 위해, 5G/NR 통 신 시스템에서는 빔포밍, 거대한 MIMO(multiple-input multiple-output), FD-MIMO(full dimensional MIMO), 어 레이 안테나, 아날로그 빔포밍 및 대규모 안테나 기술이 논의되고 있다. 또한, 5G/NR 통신 시스템에서는 진보된 소형 셀, 클라우드 무선 액세스 네트워크(RAN), 초고밀도 네트워크, 기 기 간(D2D) 통신, 무선 백홀, 이동 네트워크, 협력 통신, CoMP(coordinated multi-point), 수신 단 간섭 제거 등을 기반으로 하여 시스템 네트워크 개선을 위한 개발이 이루어지고 있다. 5G 시스템 및 이와 연관된 주파수 대역에 대한 논의는 본 개시의 특정 실시예가 5G 시스템에서 구현될 수 있음 에 따라 참조를 위한 것이다. 그러나, 본 개시는 5G 시스템 또는 이와 연관된 주파수 대역에 한정되지 않으며, 본 개시의 실시예는 임의의 주파수 대역과 관련하여 활용될 수 있다. 예를 들어, 본 개시의 양태는 또한 테라헤 르츠(THz) 대역을 사용할 수 있는 5G 통신 시스템, 6G 또는 그 이후 릴리스(release)의 배치에 적용될 수 있다. 아래의 도 1 내지 도 3은 무선 통신 시스템에서 OFDM(orthogonal frequency division multiplexing) 또는 OFDMA(orthogonal frequency division multiple access) 통신 기술을 사용하여 구현되는 다양한 실시예를 설명 한다. 도 1 내지 도 3의 설명은 상이한 실시예가 구현될 수 있는 방식에 대한 물리적 또는 구조적 제한을 의미 하지 않는다. 본 개시의 상이한 실시예는 적절하게 배치된 임의의 통신 시스템에서 구현될 수 있다. 도 1은 본 개시에 따른 예시적인 무선 네트워크를 도시한다. 도 1에 도시된 무선 네트워크의 실시예는 예시만을 위한 것이다. 무선 네트워크의 다른 실시예는 본 개시의 범위를 벗어나지 않고 사용될 수 있다. 도 1에 도시된 바와 같이, 무선 네트워크는 gNB(예를 들어, 기지국(BS)), TRP 및 gNB를 포함한 다. gNB는 TRP 및 gNB와 통신한다. gNB는 또한 인터넷, 독점적 IP(Internet Protocol) 네 트워크 또는 다른 데이터 네트워크와 같은 적어도 하나의 네트워크와 통신한다. gNB는 gNB의 커버리지 영역 내의 제1 복수의 사용자 장치(UE)에 대한 네트워크에 무선 광 대역 액세스(wireless broadband access)를 제공한다. 제1 복수의 UE는 소기업(small business)에 위치될 수 있는 UE; 기업(enterprise)에 위치될 수 있는 UE; WiFi 핫 스폿(hotspot)일 수 있는 UE; 제1 거주지(residence)에 위치될 수 있는 UE; 제2 거주지에 위치될 수 있는 UE; 및 셀 폰(cell phone), 무선 랩톱(wireless laptop), 무선 PDA 등과 같은 모바일 장치(mobile device)일 수 있는 UE를 포함한다. gNB는 gNB의 커버리지 영역 내의 제2 복수의 UE에 대한 네트워크에 무선 광대역 액세스를 제공한다. 제2 복수의 UE는 UE 및 UE를 포함한다. 일부 실시예에서, gNB(101-103) 중 하나 이상은 서로 통신하고, 5G/NR, LTE(long term evolution), LTE-A(long term evolution-advanced), WiMAX, WiFi 또는 다른 무선 통신 기술을 사용하여 UE(111-116)와 통신할 수 있다.네트워크 타입에 따라, \"기지국\" 또는 \"BS\"라는 용어는 송신 포인트(transmit point, TP), 송수신 포인트 (transmit-receive point, TRP), 향상된 기지국(enhanced base station, eNodeB 또는 eNB), 5G/NR 기지국 (gNB), 매크로셀(macrocell), 펨토셀(femtocell), WiFi 액세스 포인트(access point, AP) 또는 다른 무선 가능 한 장치(wirelessly enabled device)와 같이 네트워크에 무선 액세스를 제공하도록 설정된 임의의 구성 요소(또 는 구성 요소의 세트)를 지칭할 수 있다. 기지국은 하나 이상의 무선 통신 프로토콜(wireless communication protocol), 예를 들어, 5G/NR 3GPP(3rd generation partnership project) NR, LTE(long term evolution), LTE-A(LTE-advanced), 고속 패킷 액세스(high speed packet access, HSPA), Wi-Fi 802.11a/b/g/n/ac 등에 따라 무선 액세스를 제공할 수 있다. 편의상, \"BS\" 및 \"TRP\"라는 용어는 본 특허 문서에서 원격 단말(remote terminal)에 무선 액세스를 제공하는 네트워크 인프라 구성 요소(network infrastructure component)를 나타내 는데 사용된다. 또한, 네트워크 타입에 따라, \"사용자 장치\" 또는 \"UE\"라는 용어는 \"이동국(mobile station)\", \"가입자국(subscriber station)\", \"원격 단말\", \"무선 단말\", \"수신 포인트(receive point)\"또는 \"사용자 장치\"와 같은 임의의 구성 요소를 지칭할 수 있다. 편의상, \"사용자 장치\" 및 \"UE\"라는 용어는 본 특허 문서에 서 UE가(이동 전화 또는 스마트 폰과 같은) 모바일 장치이든 일반적으로(데스크톱 컴퓨터(desktop computer) 또 는 자동 판매기(vending machine)와 같은) 고정 장치(stationary device)로 간주되든 BS에 무선으로 액세스하 는 원격 무선 장치를 지칭하는데 사용된다. 점선은 예시 및 설명만을 위해 거의 원형으로 도시되는 커버리지 영역(120 및 125)의 대략적인 범위를 보여준다. 커버리지 영역(120 및 125)과 같은 gNB와 연관된 커버리지 영역은 gNB의 설정 및 자연적 및 인공적 방해물(man-made obstruction)과 연관된 무선 환경의 변화에 따라 불규칙한 형상을 포함하는 다른 형상을 가질 수 있다는 것이 명확히 이해되어야 한다. 아래에서 더욱 상세하게 설명되는 바와 같이, UE(111-116) 중 하나 이상은 ML 또는 AI 지원 CSI 피드백을 지원 하기 위한 회로, 프로그래밍, 또는 이의 조합을 포함한다. 특정 실시예에서, gNB(101-103) 중 하나 이상은 ML 또는 AI 지원 CSI 피드백을 지원하기 위한 회로, 프로그래밍 또는 이의 조합을 포함한다. 도 1은 무선 네트워크의 일 예를 도시하지만, 도 1에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 무선 네트워크는 임의의 수의 gNB 및 임의의 수의 UE를 임의의 적절한 배치에 포함시킬 수 있다. 또한, gNB는 임의의 수의 UE와 직접 통신할 수 있고, 네트워크에 대한 무선 광대역 액세스를 이러한 UE에 제공할 수 있다. 유사하게, 각각의 gNB(102-103)는 네트워크와 직접 통신할 수 있고, 네트워크에 대한 직 접 무선 광대역 액세스를 UE에 제공할 수 있다. 또한, gNB(101, 102 및/또는 103)는 외부 전화 네트워크 또는 다른 타입의 데이터 네트워크와 같은 다른 또는 부가적인 외부 네트워크에 대한 액세스를 제공할 수 있다. 도 2는 본 개시의 실시예에 따른 예시적인 gNB를 도시한다. 도 2에 도시된 gNB의 실시예는 예시만을 위한 것이며, 도 1의 gNB(101 및 103)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, gNB는 다양한 설정을 가지며, 도 2는 본 개시의 범위를 gNB의 임의의 특정 구현으로 제한하지 않는다. 도 2에 도시된 바와 같이, gNB는 다수의 안테나(205a-205n), 다수의 송수신기(210a-210n), 제어부/프로세 서, 메모리 및 백홀 또는 네트워크 인터페이스를 포함한다. 송수신기(210a-210n)는 안테나(205a-205n)로부터, 네트워크에서 UE에 의해 송신된 신호와 같은 들어오는 (incoming) RF 신호를 수신한다. 송수신기(210a-210n)는 IF 또는 기저 대역 신호를 생성하도록 들어오는 RF 신 호를 하향 변환시킨다. IF 또는 기저 대역 신호(baseband signal)는 기저 대역 또는 IF 신호를 필터링, 디코딩 및/또는 디지털화함으로써 처리된 기저 대역 신호를 생성하는 송수신기(210a-210n) 및/또는 제어부/프로세서 의 수신(RX) 처리 회로에 의해 처리된다. 제어부/프로세서는 기저 대역 신호를 더 처리할 수 있다. 송수신기(210a-210n) 및/또는 제어부/프로세서의 송신(TX) 처리 회로는 제어부/프로세서로부터 (음성 데이터(voice data), 웹 데이터, 이메일 또는 대화형 비디오 게임 데이터(interactive video game data)와 같 은) 아날로그 또는 디지털 데이터를 수신한다. TX 처리 회로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는(outgoing) 기저 대역 데이터를 인코딩, 다중화 및/또는 디지털화한다. 송수신기(210a-210n)는 기저 대역 또는 IF 신호를 안테나(205a-205n)를 통해 송신되는 RF 신호로 상향 변환한다. 제어부/프로세서는 gNB의 전체 동작을 제어하는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있다. 예를 들어, 제어부/프로세서는 잘 알려진 원리에 따라 송수신기(210a-210n)에 의해 UL 채널 신호 의 수신 및 DL 채널 신호의 송신을 제어할 수 있다. 제어부/프로세서는 더욱 진보된 무선 통신 기능과 같 은 부가적인 기능을 또한 지원할 수 있다. 예를 들어, 제어부/프로세서는 다수의 안테나(205a-205n)로부터/로의 나가는(outgoing)/들어오는(incoming) 신호가 원하는 방향으로 나가는 신호를 효과적으로 조정(steer)하 기 위해 상이하게 가중되는 빔 포밍 또는 방향성 라우팅 동작을 지원할 수 있다. 다른 예로서, 제어부/프로세서 는 ML 또는 AI 지원 CSI 피드백을 위한 방법을 지원할 수 있다. 다양한 다른 기능 중 임의의 기능은 제어 부/프로세서에 의해 gNB에서 지원될 수 있다. 제어부/프로세서는 또한 OS와 같이 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 제어부/프로세서는 실행 프로세스에 의해 요구되는 바와 같이 메모리 내외로 데이터를 이동시킬 수 있다. 제어부/프로세서는 또한 백홀 또는 네트워크 인터페이스에 결합된다. 백홀 또는 네트워크 인터페이스 는 gNB가 백홀 연결(backhaul connection) 또는 네트워크를 통해 다른 장치 또는 시스템과 통신할 수 있게 한다. 인터페이스는 임의의 적절한 유선 또는 무선 연결을 통한 통신을 지원할 수 있다. 예를 들 어, gNB가(5G, LTE 또는 LTE-A를 지원하는 것과 같은) 셀룰러 통신 시스템(cellular communication system)의 부분으로서 구현될 때, 인터페이스는 gNB가 유선 또는 무선 백홀 연결을 통해 다른 gNB와 통신할 수 있게 한다. gNB가 액세스 포인트로서 구현될 때, 인터페이스는 gNB가 유선 또는 무선 로컬 영역 네트워크(local area network) 또는 유선 또는 무선 연결을 통해 (인터넷과 같은) 더 큰 네트워크로 전달할 수 있게 할 수 있다. 인터페이스는 이더넷(Ethernet) 또는 송수신기와 같은 유선 또는 무선 연결을 통한 통신을 지원하는 임의의 적절한 구조를 포함한다. 메모리는 제어부/프로세서에 결합된다. 메모리의 부분은 RAM을 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리(Flash memory) 또는 다른 ROM을 포함할 수 있다. 도 2는 gNB의 일 예를 도시하지만, 도 2에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, gNB는 도 2에 도시된 임의의 수의 각각의 구성 요소를 포함할 수 있다. 또한, 도 2의 다양한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가될 수 있다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 3에 도시된 UE의 실시예는 예시만을 위 한 것이며, 도 1의 UE(111-115)는 동일하거나 유사한 설정을 가질 수 있다. 그러나, UE는 다양한 설정을 가지며, 도 3은 본 개시의 범위를 UE의 임의의 특정 구현으로 제한하지 않는다. 도 3에 도시된 바와 같이, UE는 안테나, 송수신기, 및 마이크로폰을 포함한다. UE는 또한 스피커, 프로세서, 입출력(input/output, I/O) 인터페이스(interface; IF), 입력, 디스플레이 및 메모리를 포함한다. 메모리는 동작 체제(operating system, OS) 및 하나 이상의 애플리케이션을 포함한다. 송수신기는 안테나로부터 네트워크의 gNB에 의해 송신된 들어오는 RF 신호를 수신한다. 송수신 기는 중간 주파수(intermediate frequency; IF) 또는 기저 대역 신호를 생성하기 위해 들어오는 RF 신호 를 하향 변환한다. IF 또는 기저 대역 신호는 기저 대역 또는 IF 신호를 필터링, 디코딩 및/또는 디지털화함으 로써 처리된 기저 대역 신호를 생성하는 송수신기 및/또는 프로세서의 RX 처리 회로에 의해 처리된다. RX 처리 회로는 처리된 기저 대역 신호를 (음성 데이터에 대해서와 같은) 스피커로 송신하거나 (웹 브라우징 데이터(web browsing data)에 대해서와 같은) 프로세서에 의해 처리된다. 송수신기 및/또는 프로세서의 TX 처리 회로는 마이크로폰으로부터 아날로그 또는 디지털 음성 데이터를 수신하거나 프로세서로부터 (웹 데이터, 이메일 또는 대화형 비디오 게임 데이터와 같은) 다른 나가는 기저 대역 데이터를 수신한다. TX 처리 회로는 처리된 기저 대역 또는 IF 신호를 생성하기 위해 나가는 기저 대역 데이터를 인코딩, 다중화 및/또는 디지털화한다. 송수신기는 기저 대역 또는 IF 신호를 안테나 를 통해 송신되는 RF 신호로 상향 변환한다. 프로세서는 하나 이상의 프로세서 또는 다른 처리 장치를 포함할 수 있고, UE의 전체 동작을 제어하 기 위해 메모리에 저장된 OS를 실행할 수 있다. 예를 들어, 프로세서는 잘 알려진 원리에 따라 송수신기에 의해 DL 채널 신호의 수신 및 UL 채널 신호의 송신을 제어할 수 있다. 일부 실시예에서, 프로 세서는 적어도 하나의 마이크로 프로세서 또는 마이크로 제어부를 포함한다. 프로세서는 또한 메모리에 상주하는 프로그램 및 다른 프로세스를 실행할 수 있다. 예를 들어, 프로 세서는 본 개시의 실시예에서 설명된 바와 같이 ML 또는 AI 지원 CSI 피드백을 위한 프로세스를 실행할 수 있다. 프로세서는 실행 프로세스(executing process)에 의해 요구되는 바와 같이 메모리 내외로 데이 터를 이동시킬 수 있다. 일부 실시예에서, 프로세서는 OS에 기초하거나 gNB 또는 오퍼레이터로부터수신된 신호에 응답하여 애플리케이션을 실행하도록 설정된다. 프로세서는 또한 랩톱 컴퓨터 및 핸드 헬드 컴퓨터(handheld computer)와 같은 다른 장치에 연결하는 능력을 UE에 제공하는 I/O 인터페이스(34 5)에 결합된다. I/O 인터페이스는 이러한 액세서리(accessory)와 프로세서 사이의 통신 경로 (communication path)이다. 프로세서는 또한 예를 들어 터치스크린, 키패드 등을 포함하는 입력 및 디스플레이에 결합된다. UE의 오퍼레이터는 입력을 사용하여 데이터를 UE에 입력할 수 있다. 디스플레이는 액정 디 스플레이(liquid crystal display), 발광 다이오드 디스플레이(light emitting diode display), 또는 웹 사이 트(web site)로부터와 같이 텍스트 및/또는 적어도 제한된 그래픽을 렌더링(rendering)할 수 있는 다른 디스플 레이일 수 있다. 메모리는 프로세서에 결합된다. 메모리의 일부는 랜덤 액세스 메모리(random access memory; RAM)를 포함할 수 있고, 메모리의 다른 부분은 플래시 메모리 또는 다른 판독 전용 메모리(read-only memory; ROM)를 포함할 수 있다. 도 3은 UE의 일 예를 도시하지만, 도 3에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 도 3의 다양 한 구성 요소는 조합되거나, 더 세분화되거나, 생략될 수 있으며, 특정 필요에 따라 부가적인 구성 요소가 부가 될 수 있다. 특정 예로서, 프로세서는 하나 이상의 중앙 처리 유닛(central processing unit; CPU) 및 하 나 이상의 그래픽 처리 유닛(graphics processing unit; GPU)과 같은 다수의 프로세서로 분할될 수 있다. 다른 예에서, 송수신기는 임의의 수의 송수신기 및 신호 처리 체인(chain)을 포함할 수 있고, 임의의 수의 안테 나에 연결될 수 있다. 또한, 도 3은 이동 전화 또는 스마트 폰으로서 설정된 UE를 도시하지만, UE는 다른 타입의 이동 또는 고정 장치로서 동작하도록 설정될 수 있다. 5G NR에서, MU-MIMO 송신을 지원함으로써 처리량(throughput)이 상당히 개선될 수 있으며, 여기서 하나의 gNB는 다수의 데이터 스트림을 동시에 다수의 UE로 송신한다. MU-MIMO 송신은 gNB에서 정확한 DL CSI의 가용성에 의존 하고; 주파수 도메인 듀플렉스(frequency domain duplex; FDD) 시스템에서, 각각의 UE는 DL CSI를 측정하여 측 정값을 보고한다. 각각의 CSI 보고는 PMI(주요 채널 방향(dominant channel direction)), RI(주요 채널 방향의 수) 및/또는 CQI(채널이 지원할 수 있는 최상의 변조 및 코드율(modulation and code rate))을 포함할 수 있다. DL CSI의 오버헤드는 gNB에서의 안테나 포트의 수와 SB의 수에 따라 증가한다. 현재 5G 시스템은 gNB에서 수십 개의 SB와 최대 32개의 안테나 포트를 지원한다. 각각의 UE는 gNB에 보고되기 전에 DL CSI를 압축하기 위해 미 리 정의된 코드북(예를 들어, Type I 및 Type II)을 사용한다. 이러한 코드북은 공간 및 주파수 도메인에서 채 널 상관 관계를 활용하고; 이러한 코드북을 적용하면 DL CSI 피드백의 오버헤드가 상당히 감소되었다. 릴리스- 18)에서, 이러한 코드북은 시간 도메인에서 채널 상관 관계를 활용하도록 확장되고 있으며; 이러한 코드북을 적 용하면 DL CSI 피드백의 오버헤드가 부가적으로 감소될 수 있다. CBSR은 PMI를 생성할 때 적용될 수 있으며; 예를 들어, gNB는 다른 셀 간(inter-cell) 간섭 조건에 대한 지식을 사용하여 UE에 의해 보고될 수 있는 공간 도메인(SD)/주파수 도메인(FD) 정보를 제한할 수 있다. 또한, gNB는 UE에 의해 보고될 수 있는 계수 진폭(coefficient amplitudes)의 범위를 제한할 수 있다. UE가 적절한 CSI 설정을 결정하도록 gNB를 지원할 수 있으면 gNB가 적절한 CSI 설정을 자율적으로 결정하는 것 보다 여러 가지 이점을 제공할 수 있다. 예를 들어, gNB는 SRS를 사용하여 UE로부터 UL(및 상호성에 따라 DL) 채널을 추정할 수 있다. SRS의 최소 주기는 2ms인 반면, 연속적인 DMRS 간의 간격은 1ms 미만으로 설정될 수 있 다. 따라서, UE는 수신된 SRS를 사용하여 UL 채널을 측정하는 gNB에 비해 수신된 DMRS를 사용하여 DL 채널의 세 분화된 측정(finer-grained measurements)을 수행할 수 있다. 다른 예로서, UE는 gNB에 사용할 수 없는 로컬(local) 정보를 보고할 수 있다. UE는 카메라를 사용하여 T초 내 에 gNB와 LOS 경로를 교차하는 다가오는 차량을 검출할 수 있다. 그런 다음, UE는 이러한 정보를 gNB에 보고하 고 CSI 설정에 대한 선제 권장(pre-emptive recommendation)을 할 수 있다(예를 들어, T초 내에 gNB와 LOS 경 로가 중첩하는 SD 빔을 보고하지 않음). gNB에서의 안테나 포트의 수와 SB의 수는 향후 시스템이 더 엄격한 성능 요구 사항을 충족하도록 증가할 것으로 예상되지만, 미리 정의된 코드북으로부터의 오버헤드 감소는 이에 따라 확장되지 않을 수 있다. 따라서, DL CSI 를 압축하는 대안적인 방법을 지원하도록 UE를 설정하는 것이 유리할 수 있다. 예를 들어, 공간, 주파수 및 시 간 도메인에 걸쳐 공동 압축을 수행하는 AI/ML 기반 코드북을 사용하도록 UE를 설정하면 오버헤드가 추가로 감소할 수 있다. 다른 예로서, Type II 코드북 파라미터를 결정하기 위해 AI/ML 기반 방법을 사용하도록 UE를 설 정하면 오버헤드가 추가로 감소할 수 있으며, 여기서 이러한 코드북은 공간, 주파수 및 시간 도메인에 걸쳐 압 축을 수행한다. 오버헤드 감소와 시간 도메인 상관 관계 간의 연결은 AI/ML 기술을 적용하여 시간 CSI 피드백을 생성/보고하도록 동기를 부여한다. 부가적인 예로서, 특히 중간/고속 시나리오에서 미래 CSI 인스턴스를 예측하기 위한 AI/ML 기반 방법을 사용하 도록 UE를 설정하면 성능이 향상될 수 있으며; 이는 임시적인 CSI 피드백을 생성/보고하기 위해 AI/ML 기술을 사용하는 경우를 강화한다. 본 개시의 다양한 실시예는 CSI 피드백을 생성/보고하기 위한 AI/ML 기반 기술이 5G-NR 표준에서 지원되지 않는 다는 것을 인식한다. 또한, 본 개시의 다양한 실시예는 CSI 피드백을 생성/보고하기 위한 UE 지원 CSI 설정이 5G-NR 표준에서 지원되지 않는다는 것을 인식한다. 더욱이, 본 개시의 다양한 실시예는 시간적 CSI 피드백을 생 성/보고하기 위한 AI/ML 기반 기술이 5G-NR 표준에서 지원되지 않는다는 것을 인식한다. 따라서, 본 개시의 다양한 실시예는 네트워크가 미리 정의된 코드북과 함께 AI/ML 기반 기술을 사용하여 CSI 피 드백을 생성하도록 UE를 설정하는 데 사용할 수 있는 기술을 제공한다. 상응하는 시그널링 상세 사항이 또한 논 의된다. 또한, 본 개시의 다양한 실시예는 네트워크가 CSI 피드백을 생성/보고할 때 CSI 설정을 적용하는 데 도 움이 되는 UE를 설정하는 데 사용할 수 있는 기술을 제공한다. 상응하는 시그널링 상세 사항이 또한 논의된다. 또한, 본 개시의 다양한 실시예는 네트워크가 미리 정의된 코드북과 함께 AI/ML 기반 기술을 사용하여 시간적 CSI 피드백을 생성하도록 UE를 설정하는 데 사용할 수 있는 기술을 제공한다. 상응하는 시그널링 상세 사항이 또한 논의된다. 예시를 위해, 용어 \"AI/ML 기반 CSI 피드백/보고\"라는 용어는 PMI에 의해 열거된 프리코딩 벡터/매트릭스의 고 정/미리 결정된 코드북을 활용하는 기존 CSI와 상이한 CSI 보고를 생성하는 방법을 지칭하는 데 사용된다. 예를 들어, \"AI/ML 기반 CSI 피드백/보고\"는 오프라인 트레이닝(offline training)의 목적을 위해 미리 계산 및/또는 미리 저장된 CSI를 활용하는 머신을 활용할 수 있다. \"AI/ML 기반 CSI 피드백/보고\"는 또한 온라인 트레이닝의 목적을 위해 새롭게 수집된 CSI를 활용하는 머신을 활용할 수 있다. \"AI/ML 기반 CSI 피드백/보고\"는 또한 연합 학습(federated learning)의 목적을 위해 다수의 머신, 예를 들어 gNB 및 다수의 UE를 활용할 수 있다. AI/ML 모델 아키텍처의 측면에서, \"AI/ML 기반 CSI 피드백/보고\"는 단일 또는 다수의 계층의 컨볼루션 자동 인코더 (convolutional auto-encoder)를 활용할 수 있다. \"AI/ML 기반 CSI 피드백/보고\"는 또한 순환 자동 인코더 (recurrent auto-encoder)를 활용할 수 있다. \"AI/ML 기반 CSI 피드백/보고\"는 또한 변환기 신경망 (transformer neural network)을 활용할 수 있다. 동일한 방법을 지칭하는 다른 용어가 또한 사용될 수 있다. 도 4는 본 개시의 실시예에 따라 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 BS에서 의 예시적인 동작 방법을 도시한다. 도 4에 도시된 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환 을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 4는 본 개시의 범위를 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 BS에서의 예시적인 동작 방법 의 특정 구현으로 제한하지 않는다. 도 4에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드백 을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작에서, BS 는 설정 정보를 UE로 송신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이 블(enabling/disabling), 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메시지는 Type II 코드북(5.2.2.2.3/4/5/6/7, [4] 참조)에 기반 한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북(5.2.2.2.1/2, [4] 참조) 또는 Type II 코드북(5.2.2.2.3/4/5/6/7, [4] 참조)에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기존 피드백/보고 방법에 기반하여 생성된 CSI 보고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 UE로부터 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타 내는 메시지를 수신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기 서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI포맷이 이 메시지에 사용되는 경우, 이러한 지시자(indication)는 UCI의 일부로서 포함될 수 있으므로 CSI 피드 백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, BS는 AI/ML 기반 피드 백/보고 방법에 따라 생성된 CSI 보고를 UE로부터 수신한다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작이 수행될 필요가 없고; BS는 동작에서 미리 결정/설정된 시간에 UE로부터 AI/ML 기반 CSI 보고를 수신할 수 있다. 다른 예에서, 동작과 동작 사이에서, BS는 동작을 수행할 수 있으며, 여기서 BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 ACK/NACK을 UE로 송신할 수 있다. BS가 ACK를 송신하면, UE는 AI/ML 기반 CSI 피드백/보고 방법으로 전환하고; BS는 동작에서 UE로부 터 AI/ML 기반 CSI 보고를 수신한다. BS가 NACK를 송신하면, BS는 동작에서 UE로부터 기존 CSI 보고를 수 신한다. 동작에서, 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법에 대한 설정 메시지를 UE로 송신 할 수 있다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(410, 411 및 412)을 인에이블/디스에이블 (enable/disable)할 수 있다. 이러한 동작이 디스에이블 되면, BS는 동작에서 UE로부터 기존 CSI 보고를 계속 수신한다. 도 5는 본 개시의 실시예에 따라 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서 의 예시적인 동작 방법을 도시한다. 도 5에 도시된 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환 을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 5는 본 개시의 범위를 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서의 예시적인 동작 방법 의 특정 구현으로 제한하지 않는다. 도 5에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 CSI 피드백을 생성/보고하기 위한 ML 접근 방 식의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 동작에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 메시지를 BS로 송신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용 되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고 를 BS로 송신한다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작이 수행될 필요가 없고; UE는 동작에서 미리 결정/설정된 시간에 AI/ML 기반 CSI 보고를 BS로 송신할 수 있다. 다른 예에서, 동작과 동작 사이에서, UE는 동작을 수행할 수 있으며, 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 BS로부터 ACK/NACK을 수신할 수 있다. UE가 ACK를 수신하면, UE는 AI/ML 기반 CSI 피드백/보고 방법으로 전환하고; UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 기존 CSI 보 고를 BS로 송신한다. 동작에서, 다른 예에서, UE는 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 대한 설정 메시지를 수신할 수 있다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있 다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(510, 511 및 512)을 인에이블/디스에이블할 수 있다. 이러 한 동작이 디스에이블되면, UE는 동작에서 기존 CSI 보고를 BS로 계속 송신한다. 도 6은 본 개시의 실시예에 따라 AI/ML 기반 CSI 피드백/보고 방법으로의 BS 개시 전환을 지원하기 위한 BS에서 의 예시적인 동작 방법을 도시한다. 도 6에 도시된 AI/ML 기반 CSI 피드백/보고로의 BS 개시 전환을 지원 하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 6은 본 개시의 범위를 AI/ML 기반 CSI 피드백/보고 방법으로의 BS 개시 전환을 지원하기 위한 BS에서의 예시적인 동작 방법의 특 정 구현으로 제한하지 않는다. 도 6에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드백 을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작에서, BS 는 설정 정보를 UE로 송신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이 블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시 지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기존 피 드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백 에 상응할 수 있다. 동작에서, BS는 UE로부터 지원 정보(assistance information)를 수신하고; 이 지원 정보는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 위한 권장을 포함할 수 있으며, 이는 본 개시의 후반부 에서 \"UE 지원 정보\" 섹션에 설명될 것이다. 동작에서, BS는 AI/ML 기반 CSI 피드백 설정 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시작할 수 있다. 도 7은 본 개시의 실시예에 따라 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서 의 예시적인 동작 방법을 도시한다. 도 7에 도시된 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환 을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 7는 본 개시의 범위를 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서의 예시적인 동작 방법 의 특정 구현으로 제한하지 않는다. 도 7에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 동작에서, UE는 BS로부터 설정 정보 를 수신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모 델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방 법에 의해 생성된 CSI 보고를 UE로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상 응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있 다. 동작에서, UE는 지원 정보를 BS로 송신하고; 이 지원 정보는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 위한 권장을 포함할 수 있으며, 이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명될 것이다. 동작 에서, UE는 BS로부터 AI/ML 기반 CSI 피드백 설정 메시지를 수신한다. UE는 (i) AI/ML 기반 CSI 피드백 설정 메시지에서 수신된 설정, (ii) 전처리된 CSI-RS 측정, 및 (iii) 관찰된 채널 통계 중 하나 이상을 트레이 닝된 모델에 공급한다. 트레이닝된 모델은 CSI 보고에 상응하는 파라미터(예를 들어, 벡터, 계수 또는 위상)를 출력한다. UE는 트레이닝된 모델에 의해 출력된 파라미터를 기반으로 CSI 보고를 식별한다. 일 예에서, 식별된 CSI 보고는 특정 포맷을 준수하거나 특정 제약 조건(constraint)을 충족하도록 사후(post) 처리된다. 예를들어, 설정이 CSI 보고에 대한 최대 크기를 포함하는 경우, 결정된 CSI 보고는 CSI 보고의 최대 크기 제약 조건 이 충족되도록 사후 처리된다. 다른 예에서, UE는 식별된 CSI 보고가 추론된 파라미터를 기반으로 하도록 로컬 관찰에 따라 출력 파라미터를 추론할 수 있다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생성 된 CSI 보고를 BS로 송신한다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있 다. 도 8은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예 시적인 동작 방법을 도시한다. 도 8에 도시된 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 8은 본 개시의 범위를 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 8에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드백 을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작에서, BS 는 설정 정보를 UE로 송신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이 블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시 지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기존 피 드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백 에 상응할 수 있다. 동작에서, BS는 UE로부터 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 메 시지를 수신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로 운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 UE로부터 기존 CSI 피드백/보고 방법으로 폴 백(fall back)하라는 요청에 상응하는 메시지를 수신하며, 이는 본 개시의 후반부에서 \"기존 CSI 폴백 요청\" 섹 션에서 설명될 것이다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에 서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS 는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드 백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응 할 수 있다. 동작에서, BS는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 일 예 에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작이 수행될 필요가 없고; BS는 동작에서 미리 결정/설정된 시간에 UE로부터 AI/ML 기반 CSI 보고를 수신할 수 있다. 다른 예에서, 동작과 동작 사이에서, BS는 동작을 수행할 수 있다. 동작에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 ACK/NACK을 UE로 송신 할 수 있다. BS가 ACK를 송신하면, UE는 AI/ML 기반 CSI 피드백/보고 방법으로 전환하고; BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신한다. BS가 NACK를 송신하면, BS는 동작에서 UE로부터 기존 CSI 보고 를 수신한다. 동작에서, 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법에 대한 설정 메시지를 UE로 송신할 수 있다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시작할 수 있다.다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(810, 811 및 812)을 인에이블/디스에이블할 수 있다. 이러 한 동작이 디스에이블되면, BS는 동작에서 UE로부터 기존 CSI 보고를 계속 수신한다. 도 9는 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예 시적인 동작 방법을 도시한다. 도 9에 도시된 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 9은 본 개시의 범위를 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 9에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 UE(예를 들어, UE)는 BS로부터 설 정 정보를 수신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같 은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수신한 다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/ 보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드 백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 메시지를 BS로 송신한 다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용 될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사 용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백과 함께 예를 들어, CSI 보고에서 의 1비트 지시자로서 보고될 수 있다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보 고를 BS로 송신한다. 동작에서, UE는 기존 CSI 피드백/보고 방법으로 폴백하라는 요청에 상응하는 메시지 를 BS로 송신하며, 이는 본 개시의 후반부에서 \"기존 CSI 폴백 요청\" 섹션에서 설명될 것이다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지 를 수신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기 존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백 에 상응할 수 있다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작이 수행될 필요가 없고; UE는 동작에서 미리 결정/설정된 시간에 AI/ML 기반 CSI 보고를 BS로 송신할 수 있다. 다른 예에서, 동작과 동작 사이에서, UE는 동작을 수행할 수 있다. 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 BS로부터 ACK/NACK을 수신할 수 있다. UE가 ACK를 수신하면, UE는 AI/ML 기반 CSI 피드백/보고 방법으로 전환하고; UE는 동작에 서 AI/ML 기반 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 기존 CSI 보고를 BS로 송신한다. 동작에서, 다른 예에서, UE는 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 대한 설정 메시지를 수신할 수 있다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있 다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(910, 911 및 912)을 인에이블/디스에이블할 수 있다. 이러 한 동작이 디스에이블되면, UE는 동작에서 기존 CSI 보고를 BS로 계속 송신한다. 도 10은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하기 위한 BS에서의 예 시적인 동작 방법을 도시한다. 도 10에 도시된 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하 기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 10은 본 개시의 범위를 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 10에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드 백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에 이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될 지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE 로 송신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기 존 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기 반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피 드백에 상응할 수 있다. 동작에서, BS는 UE로부터 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내 는 메시지를 수신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이 러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포 맷이 이 메시지에 사용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 기존 CSI 피드백/보고 방법으로 폴백(fall back)하라는 명령에 상응하는 메시지를 UE로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피 드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응 할 수 있다. 동작에서, BS는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 일 예 에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작이 수행될 필요가 없고; BS는 동작에서 미리 결정/설정된 시간에 UE로부터 AI/ML 기반 CSI 보고를 수신할 수 있다. 다른 예에서, 동작과 동작 사이에서, BS는 동작을 수행할 수 있다. 동작에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 ACK/NACK을 UE 로 송신할 수 있다. BS가 ACK를 송신하면, UE는 AI/ML 기반 CSI 피드백/보고 방법으로 전환하고; BS는 동작 에서 UE로부터 AI/ML 기반 CSI 보고를 수신한다. BS가 NACK를 송신하면, BS는 동작에서 UE로부터 기존 CSI 보고를 수신한다. 동작에서, 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법에 대한 설정 메시지를 UE로 송신할 수 있다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(1010, 1011 및 1012)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스에이블되면, BS는 동작에서 UE로부터 기존 CSI 보고를 계속 수신한다. 도 11는 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하기 위한 UE에서의 예 시적인 동작 방법을 도시한다. 도 11에 도시된 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하 기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 11은 본 개시의 범위를 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구 현으로 제한하지 않는다. 도 11에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 동작에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용 될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수 신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지 는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상 응할 수 있다. 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 메시지를 BS로 송신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지 에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시 지에 사용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생성 된 CSI 보고를 BS로 송신한다. 동작에서, UE는 기존 CSI 피드백/보고 방법으로 폴백하라는 명령에 상응하 는 메시지를 BS로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작 에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코 드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반 한 CSI 피드백에 상응할 수 있다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작이 수행될 필요가 없고; UE는 동작에서 미리 결정/설정된 시간에 AI/ML 기반 CSI 보고를 BS로 송신할 수 있다. 다른 예에서, 동작과 동작 사이에서, UE는 동작을 수행할 수 있다. 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 BS로부터 ACK/NACK을 수신할 수 있다. UE가 ACK를 수신하면, UE는 AI/ML 기반 CSI 피드백/보고 방법으로 전환하고; UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 기존 CSI 보고를 BS로 송신한다. 동작에서, 다른 예에서, UE는 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 대한 설정 메시지를 수신할 수 있다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(1110, 1111 및 1112)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스에이블되면, UE는 동작에서 기존 CSI 보고를 BS로 계속 송신한다. 일 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 CSI 피드백/보고 방법으로 전환하는 지시자를 송신하도록 UE 를 설정할 수 있다. 표 1은 이러한 전환 지시자를 송신하도록 UE를 설정하기 위해 IE PUCCH-Config를 수정하는 예이다. 이 예에서, format5는, 있는 경우, 이러한 전환 지시자에 대한 새로운 PUCCH 포맷에 상응한다. mlCBSwitchResourceToAddModList 및 mlCBSwitchResourceToReleaseList는, 있는 경우, 이러한 전환 지시자에 대 해 각각 부가되거나 해제될 수 있는 PUCCH 자원에 상응한다. 일 예에서, 기존 PUCCH 포맷(예를 들어, 포맷 3 또 는 4)은 이러한 지시자에 사용될 수 있다. [표 1] 일 실시예에서, BS는 MAC CE 활성화 명령을 통해 AI/ML 기반 CSI 피드백/보고 방법으로 전환하는 지시자를 송신 하도록 UE를 설정할 수 있다. 일 실시예에서, BS는 DCI를 통해 AI/ML 기반 CSI 피드백/보고 방법으로 전환하는 지시자를 송신하도록 UE를 설 정할 수 있다. 다른 실시예에서, BS는 PDCCH 주문(order)을 통해 AI/ML 기반 CSI 피드백/보고 방법을 사용하도록 UE를 설정할 수 있으며, 여기서 새로운 DCI 포맷이 정의될 수 있고, 이러한 PDCCH 주문은 이러한 새로운 DCI 포맷에 의해 트 리거될 수 있다. 다른 예에서, BS는 MAC CE 활성화 명령을 통해 AI/ML 기반 CSI 피드백/보고 방법을 사용하도록 UE를 설정할 수 있다. 다른 예에서, BS는 RRC 설정을 통해 UE가 AI/ML 기반 CSI 피드백/보고 방법을 사용하도록 UE를 설정할 수 있다. 표 2는 CSI 피드백을 생성/보고하기 위해 AI/ML 기반 코드북을 사용하도록 UE를 설정하기 위해 IE CodebookConfig를 수정하는 예이다. CodebookConfig의 경우, enabledCodebooks는, 있는 경우, 어떤 AI/ML 기반 코드북이 인에이블되는지를 결정하고; switchSlot는, 있는 경우 이러한 AI/ML 기반 코드북이 인에이블되는 슬롯 세트를 결정한다. csi-ResourceConfigId는, 있는 경우, 이러한 AI/ML 기반 코드북의 ID에 상응한다. 일 예에서, 각각의 CSI-ResourceConfig(csi-ResourceConfigId에 상응하는 엔트리를 가짐)에 대해 하나의 AI/ML 기반 코드 북이 정의된다. 다른 예에서, 모든 CSI-ResourceConfig(여기서 각각의 CSI-ResourceConfig는 csi- ResourceConfigId에 엔트리를 가짐)에 대해 하나의 AI/ML 기반 코드북이 정의된다. [표 2]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(n1, n2)는 제1(n1) 및 제2(n2) 차원의 안테나 포트의 수를 나타낸다고 한다. 일 예에서, (n1, n2)의 각각의 지 원된 조합에 대해 하나의 AI/ML 기반 코드북이 정의될 수 있다. 다른 예에서, (n1, n2)의 모든 지원된 조합에 대해 하나의 AI/ML 기반 코드북이 정의될 수 있으며, 여기서 이러한 AI/ML 기반 코드북에 대한 입력 상에서 적 절한 전처리(pre-processing)가 수행될 수 있다. CodebookConfig IE는 또한 다중 TRP 시스템에서 CSI 피드백을 생성/보고하기 위해 AI/ML 기반 코드북을 사용하 도록 UE를 설정하기 위해 수정될 수 있으며, 여기서 UE는 다수의 TRP로부터 DL 수신을 수신하거나 UL 송신을 다 수의 TRP로 송신할 수 있다. 일 예에서, TRP는 NZP CSI-RS 자원 또는 CSI-RS 자원 세트 또는 안테나 포트 그룹 과 기능적으로 동등하다(또는 이에 상응한다). 일 예에서, 각각의 TRP에 대해 하나의 AI/ML 기반 코드북이 정의 된다(여기서 각각의 TRP는 특정 CORESET 풀에 속할 수 있고; 각각의 코드북은 상응하는 CORESET 풀 ID를 가질수 있음). 다른 예에서, 모든 TRP에 대해 하나의 AI/ML 기반 코드북이 정의된다(여기서 각각의 TRP에 대한 CORESET 풀 ID는 이 코드북에 매핑됨). 다른 실시예에서, BS는 RRC 설정을 통해 코드북의 AI/ML 기반 CSI 구성 요소를 사용하도록 UE를 설정할 수 있다. 일 예에서, 코드북은 AI/ML 기반 CSI 구성 요소와 기존 코드북 구성 요소를 포함할 수 있다. 표 3은 CSI 피드백을 생성/보고하기 위해 기존 코드북의 AI/ML 기반 구성 요소를 사용하도록 UE를 설정하기 위해 IE CodebookConfig를 수정하는 예이다. typeII-AI-r16은 Type II 코드북에 상응하는 type2의 AI/ML 기반 구성 요 소에 상응한다. typeII-AI-r16이 인에이블되는 경우, 특정 입력이 주어지면 AI/ML 기반 방법을 사용하여 Type II 코드북의 출력을 결정한다. 일 예에서, 기존 코드북의 AI/ML 기반 구성 요소는 SD 빔의 수를 학습하고 SD 빔 그룹 선택을 수행하도록 설정될 수 있고; 이는 또한 FD 빔의 수를 학습하고 FD 빔 그룹 선택을 수행하도록 설정 될 수 있다. 다른 예에서, 기존 코드북의 AI/ML 기반 구성 요소는 SD/FD 빔의 수를 공동으로 학습하고 SD/FD 빔 그룹 선택을 수행하도록 설정될 수 있다. reportNumSDBeams가 인에이블되는 경우, UE는 추론된 SD 빔의 수를 보 고한다. reportNumFDBeams가 인에이블되는 경우, UE는 추론된 FD 빔의 수를 보고한다. 기존 코드북의 AI/ML 기 반 구성 요소는 또한 SD 및 FD 빔의 선형 조합을 계산하기 위한 0이 아닌 계수(nonzero coefficient)의 수를 학 습하도록 설정될 수 있다. reportNumNZCoefs가 인에이블되는 경우, UE는 SD 및 FD 빔의 선형 조합을 계산하기 위한 0이 아닌 계수의 추론된 수를 보고한다. 기존 코드북의 AI/ML 기반 구성 요소는 또한 PSK 알파벳(예를 들 어, QPSK 또는 8-PSK)의 크기를 학습하도록 설정될 수 있다. reportPhaseAlphabet이 인에이블되는 경우, UE는 PSK 알파벳(예를 들어, QPSK 또는 8-PSK)의 크기를 보고한다. [표 3]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "표 4는 CSI 피드백을 생성/보고하기 위해 기존 코드북의 AI/ML 기반 구성 요소를 사용하도록 UE를 설정하기 위 해 IE CodebookConfig를 수정하는 다른 예이다. typeII-PortSelect-r16은 Type II 코드북의 Port Selection 서 브타입에 상응한다. enableAI가 인에이블되는 경우, 특정 입력이 주어지면 AI/ML 기반 방법을 사용하여 Type II 코드북의 Port Selection 서브타입의 출력을 결정한다. 일 예에서, AI/ML 기반 방법은 포트 선택 코드북의 크기 (5.2.2.2.4/6, [4] 참조) 및/또는 파라미터 TypeII-PortSelection-RI-Restriction에 대한 RI의 제한 (5.2.2.2.4/6, [4] 참조)을 결정할 수 있다. [표 4]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다른 예에서, IE CodebookConfig는 특정 입력이 주어진 경우 Type II 코드북의 typeII-r16 서브타입의 출력을 결정하는 데 사용되는 AI/ML 기반 방법을 지원하도록 수정될 수 있다. 이 경우, 부울(Boolean) 파라미터 enableAI는 typeII-r16)에서 정의될 수 있다. 다른 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 CSI 피드백을 생성할 때 CQI를 포함하도록 UE를 설정할 수 있다. 표 5는 CSI 피드백을 생성/보고할 때 CQI를 포함하는 AI/ML 기반 코드북을 설정하도록 IE CodebookConfig 를 수정하는 예이다. CodebookConfig의 경우, encodeCQI는, 있는 경우, CSI 피드백이 생성될 때 CQI가 포함되 어야 하는지 여부를 결정하고; cqi-FormatIndicator는, 있는 경우, 광대역 CQI 또는 부대역별(per-subband) CQI가 계산되었는지 여부를 나타낸다. cqi-Table은, 있는 경우, CQI를 계산하는 데 사용된 CQI 테이블을 나타내 고; 이는 AI/ML 기반 CSI 피드백/보고 방법을 트레이닝하기 위한 지원 정보로서 사용될 수 있다.[표 5]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "다른 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 코드북에 대한 주파수 호핑(hopping)을 지원하도록 UE를 설 정할 수 있으며, 여기서 이러한 BS는 이미 이러한 UE에 대한 CSI-RS의 주파수 호핑을 설정했다. 표 6)은 CSI-RS 에 대한 주파수 호핑을 지원하는 CSI 피드백을 생성/보고하기 위한 AI/ML 기반 코드북을 설정하도록 IE CodebookConfig를 수정하는 예이다. CodebookConfig의 경우, frequencyHopping은, 있는 경우, 이러한 AI/ML 기 반 코드북에 상응하는 CSI-RS 패턴이 슬롯 내에서 호핑하는지 또는 슬롯 사이에서 호핑하는지 여부를 결정하고; frequencyHoppingOffset은, 있는 경우, 사용 가능한 SB에 걸친 이러한 CSI-RS 패턴의 호핑 패턴을 결정한다. 다른 예에서, 주파수 호핑은 NZP CSI-RS 자원을 설정하는 IE NZP-CSI-RS-Resource를 통해 설정되거나, CSI 자원 세트를 설정하는 IE CSI-ResourceConfig를 통해 설정되거나, CSI 보고를 설정하는 IE CSI- ReportConfig를 통해 설정될 수 있다.[표 6]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "다른 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 코드북을 트레이닝하도록 UE를 설정할 수 있다. 표 7은 AI/ML 기반 코드북의 트레이닝을 설정하기 위해 IE PDSCH-ServingCellConfig를 수정하는 예이다. PDSCH- ServingCellConfig의 경우, mlEncoderParams는, 있는 경우, 적어도 하나의 mlEncoderTrainParams 세트를 포함 할 수 있고; 각각의 mlEncoderTrainParams 세트는 AI 기반 코드북을 트레이닝한 다른 UE에 대한 트레이닝된 인 코더 가중치 및 바이어스를 포함할 수 있다. 이러한 트레이닝된 인코더 가중치 및 바이어스는 AI/ML 기반 코드 북을 트레이닝하는 데 이러한 UE를 도울 수 있다. MlDecoderParams는, 있는 경우, 트레이닝된 디코더 가중치와 바이어스를 포함할 수 있고; 일 예에서, 이러한 디코더 가중치와 바이어스는 BS에서 트레이닝하여 획득될 수 있 다. 다른 예에서, 각각의 UE는 자체 디코더를 트레이닝한 다음, 트레이닝된 디코더 가중치와 바이어스를 BS에 보고할 수 있으며, BS는 이를 평균화하여 mlDecoderParams에 이러한 평균화된 값을 보고할 수 있다. mlEncoderParams 및 mlDecoderParams의 정보는 상응하는 코드북에 대한 ID, 예를 들어, 상응하는 CSI- ResourceConfig의 ID, 상응하는 CORESET 풀의 ID 등으로 태그(tag)될 수 있다.[표 7]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "일 예에서, PDSCH-ServingCellConfig IE는 트레이닝 오류(예를 들어, 코사인 유사도(cosine similarity), NMSE 등), 하이퍼파라미터(예를 들어, 학습률(learning rate), 트레이닝 에포크(epoch)의 수, 트레이닝과 테스트 데 이터 간의 분할(split) 등) 등을 포함하는 다른 UE로부터의 트레이닝/추론 지원 정보를 포함할 수 있다. 다른 예에서, PDSCH-ServingCellConfig IE는 UE가 AI/ML 기반 코드북에 대한 인코더와 디코더를 모두 트레이닝한 다 음 트레이닝된 인코더/디코더 파라미터를 BS에 보고하기 위한 명령을 포함하는 트레이닝 명령어를 포함할 수 있 고; UE는 또한 AI/ML 기반 코드북에 대한 인코더만을 트레이닝(및 BS로부터 트레이닝된 디코더에 대한 파라미터 를 사용)하도록 명령을 받을 수 있다. 일 실시예에서, UE 지원 정보 보고에 대해 새로운 MAC CE가 정의될 수 있다. 이 MAC CE는 [3]의 표 6.2.1-2에 명시될 수 있는 논리적 채널 ID를 갖는 MAC 서브헤더에 의해 식별될 수 있다. 이 MAC CE는 가변적인 크기를 가 질 수 있으며, 다음의 필드로 구성될 수 있다. 블록 오류율(Block Error Rate): 이 필드는 UE의 관찰된 블록 오류율, 예를 들어, 마지막 1000개의 수신된 전송 블록에 대해 계산된 블록 오류율을 나타낸다. 처리량(Throughput): 이 필드는 UE의 관찰된 처리량, 예를 들어, 마지막 1000개의 수신된 전송 블록에 대해 계 산된 메가비트/초의 처리량을 나타낸다. 추정된 코히어런스 시간(Estimated Coherence Time): 이 필드는 UE의 DL 채널 코히어런스 시간 추정치를 밀리초 로 나타낸다. 추정된 코히어런스 대역폭(Estimated Coherence Bandwidth): 이 필드는 UE의 DL 채널 코히어런스 대역폭 추정 치를 킬로헤르츠로 나타낸다. IR1: 이 필드는 권장된 코드북 필드를 포함하는 옥텟이 존재를 나타낸다. IR1 필드가 1로 세팅되면, 권장된 코 드북 필드를 포함하는 옥텟은 존재한다. IR1 필드가 0으로 세팅되면, 권장된 코드북 필드를 포함하는 옥텟은 존 재하지 않는다. 권장된 코드북: 이 필드는 CSI 피드백을 생성/보고하기 위한 UE의 권장된 코드북, 예를 들어, 코드북의 테이블 에 대한 인덱스를 나타낸다. IR2: 이 필드는 AI 기반 CB 파라미터 필드를 포함하는 옥텟의 존재를 나타낸다. IR2 필드가 1로 세팅되면, AI 기반 CB 파라미터 필드를 포함하는 옥텟은 존재한다. IR2 필드가 0으로 세팅되면, AI 기반 CB 파라미터 필드를 포함하는 옥텟은 존재하지 않는다. AI 기반 CB 파라미터: 이 필드는 이 UE의 트레이닝된 AI/ML 기반 CSI 피드백/보고 방법에 상응하는 파라미터, 예를 들어, 트레이닝된 가중치 및 바이어스 세트를 나타낸다. IR3: 이 필드는 Train/Infer Assistance Info 필드를 포함하는 옥텟의 존재를 나타낸다. IR3 필드가 1로 세팅 되면, Train/Infer Assistance Info 필드를 포함하는 옥텟은 존재한다. IR3 필드가 0으로 세팅되면, Train/Infer Assistance Info 필드를 포함하는 옥텟은 존재하지 않는다. Train/Infer Assistance Info: 이 필드는 이 UE의 트레이닝된 AI/ML 기반 CSI 피드백/보고 방법에 상응하는 트 레이닝/추론 지원 정보, 예를 들어, 트레이닝 오류, 하이퍼파라미터 등을 나타낸다. 도 12는 본 개시의 실시예에 따른 UE 지원 정보 보고를 위한 새로운 MAC CE의 예를 도시한다. 도 12에 도 시된 UE 지원 정보 보고를 위한 새로운 MAC CE의 예의 실시예는 단지 예시를 위한 것이다. 도 12는 본 개 시의 범위를 UE 지원 정보 보고를 위한 새로운 MAC CE의 예의 특정 구현으로 제한하지 않는다. 도 12에 도시된 바와 같이, 블록 오류율, UE 처리량, 추정된 코히어런스 시간 및 추정된 코히어런스 대역폭 필 드는 각각 8비트 길이를 갖는다. 권장된 코드북, AI 기반 CB 파라미터 및 Train/Infer Assistance Info 필드는 각각 7비트 길이를 갖는다. 일 실시예에서, 기존 CSI 폴백 요청에 대해 새로운 MAC CE가 정의될 수 있다. 이 MAC CE는 [3]의 표 6.2.1-2에 명시될 수 있는 논리 채널 ID를 갖는 MAC 서브헤더에 의해 식별될 수 있다. 이 MAC CE는 가변적인 크기를 가질 수 있으며 다음의 필드로 구성될 수 있다. 기존 CB 폴백: 이 필드는 다음의 정보 중 하나 이상을 포함할 수 있다. o 기존 코드북 타입, 예를 들어, Type II o 기존 코드북 서브타입, 예를 들어, 기존 코드북의 구성 요소 예를 들어, 각각의 CSI-ResourceConfig에 대해 하나의 코드북이 설정된 경우, 기존 CB 폴백 필드는 특정 CSI- ResourceConfig에 대한 기존 코드북의 ID를 포함할 수 있다. 다른 예에서, 각각의 CORESET 풀에 대해 하나의 코 드북이 설정된 경우, 기존 CB 폴백 필드는 특정 CORESET 풀에 대한 기존 코드북의 ID를 포함할 수 있다. 도 13은 본 개시의 실시예에 따른 기존 CSI 폴백 보고를 위한 새로운 MAC CE의 예를 도시한다. 도 13에 도시된 기존 CSI 폴백 보고를 위한 새로운 MAC CE의 예의 실시예는 단지 예시를 위한 것이다. 도 13은 본 개시의 범위를 기존 CSI 폴백 보고를 위한 새로운 MAC CE의 예의 특정 구현으로 제한하지 않는다. 도 13에 도시된 바와 같이, 기존 CB 폴백 필드는 8비트의 길이를 갖는다. 도 14는 본 개시의 실시예에 따른 기존 코드북의 서브타입을 지원하기 위한 AI/ML 모델 아키텍처의 예를 도시한다. 도 14에 도시된 기존 코드북의 서브타입을 지원하기 위한 AI/ML 모델 아키텍처의 예의 실시예 는 단지 예시를 위한 것이다. 도 14는 본 개시의 범위를 기존 코드북의 서브타입을 지원하기 위한 AI/ML 모델 아키텍처의 예의 특정 구현으로 제한하지 않는다. 도 14는 기존 코드북의 서브타입의 트레이닝/추론을 지원할 수 있는 AI/ML 모델 아키텍처의 예를 도시한다. 이 예에서 표준 CNN은 보조 정보로 증강될 수 있으며; 보조 정보의 예는 아래에 포함되어 있다. 각각의 슬롯에서, 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원(Rx 차원 수 × Tx 차원 수) 채널은 이 AI/ML 모델 아키텍처에 대한 입력으로서 제공되며, 여기서 CSI-RS를 포함하지 않는 모든 RE는 0으로 채워진다. 기존 코드북의 서브타입에 대한 트레이닝/추론을 지원할 수 있는 AI/ML 모델에 대한 입력의 예는 다음의 것을 포함한다: 하나의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 수신 채널, o CSI-RS를 포함하지 않는 모든 RE는 0으로 채워지고, 하나의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 채널의 지상 실측 정보(Ground truth), o 예를 들어, 이는 이상적인 채널 추정을 통해 획득될 수 있고, o 다른 예에서, 이는 현실적인 채널 추정 방법(예를 들어, LS, LMMSE)을 통해 획득될 수 있고, o 이는 트레이닝 레이블(label)일 수 있고, 보조 정보, o UE 속도, o UE 가속/감속, o UE 궤적, o UE 위치, o 코히어런스 시간, o 코히어런스 대역폭, o 지연 확산, o 도플러 확산, o 블록 오류율, o 처리량. 기존 코드북의 서브타입에 대한 트레이닝/추론을 지원할 수 있는 AI/ML 모델로부터의 출력 예는 다음의 것을 포 함한다: 하나의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 추정 채널, 기존 코드북의 서브타입에 대한 파라미터, o 이러한 파라미터는 도 14의 아키텍처에서 \"선형\" 계층으로부터 결정될 수 있고, ■ SD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐 (Eigen)/SVD 기반), ■ FD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), ■ DD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), ■ SD 빔 또는 기반 벡터의 수, ■ FD 빔 또는 기반 벡터의 수, ■ 시간 도메인(time domain; TD) 또는 도플러 도메인(Doppler domain; DD) 빔 또는 기반 벡터의 수, ■ 2개 또는 3개(SD, FD, TD/DD)에 걸친 별개의 SD/FD/TD/DD 기반 또는 공동 기반인지 여부. ■ 0이 아닌 계수의 수, ■ 계수 위상에 대한 PSK 알파벳의 크기, ■ 계수 진폭 코드북의 해상도 또는 크기(비트의 수), ■ 계층의 수(랭크 값) 또는 최대 계층의 수(또는 최대 랭크 값). 일 예에서, BS는 현재 자원 활용(utilization)(예를 들어, FLOP, 메모리 사용, 전력 소비)을 보고하도록 UE를 설정할 수 있다. 보고된 자원 활용을 고려하면, BS는 AI/ML 기반 CSI 피드백/보고 방법(예를 들어, BS는 여러 후보 AI/ML 기반 CSI 피드백/보고 방법 중에서 선택할 수 있으며, 여기서 각각의 방법은 특정 자원 활용 레벨에 상응함) 또는 기존 CSI 피드백/보고 방법을 적용하도록 UE를 설정할 수 있다. 다른 예에서, BS는 UE에 대한 설정 정보에 자원 활용 임계값을 포함할 수 있다. UE가 자원 활용이 자원 활용 임 계값과 같거나 더 높다고 결정하는 경우, UE는 자원 활용을 악화시키지 않기 위해 (ML 기반 방법을 사용하는 것 이 자원 집약적일 수 있으므로) 기존 방법을 사용하여 CSI 보고를 결정할 수 있다. 반면, UE가 자원 활용이 자 원 활용 임계값보다 낮다고 결정하는 경우, UE는 ML 기반 방법을 사용하여 CSI 보고를 결정할 수 있다. 다른 예에서, BS는 여러 후보 AI/ML 기반 CSI 피드백/보고 방법(여기서 각각의 방법은 특정 자원 활용 레벨에 상응함) 중에서 AI/ML 기반 CSI 피드백/보고 방법을 선택하거나 기존 CSI 피드백/보고 방법을 선택하도록 UE를 설정할 수 있다. BS는 또한 선택된 방법의 지시자와 함께 현재 자원 활용을 보고하도록 UE를 설정할 수 있다.다른 예에서, BS는 자원 활용 레벨 세트, 예를 들어, {25%, 50%, 75%, 100%})로 UE를 설정할 수 있으며, UE는 해당 세트로부터 단일 값을 보고한다. 보고된 값을 기반으로, BS는 AI/ML 기반 CSI 피드백/보고 방법(예를 들어, BS는 여러 후보 AI/ML 기반 CSI 피드백/보고 방법 중에서 선택할 수 있으며, 여기서 각각의 방법은 특정 자원 활용 레벨에 상응함) 또는 기존 CSI 피드백/보고 방법을 적용하도록 UE를 설정할 수 있다. 다른 예에서, BS는 여러 DL 채널 통계(예를 들어, 코히어런스 대역폭, 코히어런스 거리)를 측정하고 보고하도록 UE를 설정할 수 있다. 보고된 DL 채널 통계를 기반으로, BS는 AI/ML 기반 CSI 피드백/보고 방법 또는 기존 CSI 피드백/보고 방법을 적용하도록 UE를 설정할 수 있다(예를 들어, DL 채널의 코히어런스 대역폭이 작은 경우, AI/ML 기반 CSI 피드백/보고 방법의 주파수 도메인 압축 성능이 제한될 수 있음). 다른 예에서, BS는 여러 DL 채널 통계에 대한 임계값으로 UE를 설정할 수 있으며; 그런 다음 UE는 설정된 임계 값에 대한 측정된 DL 채널 통계에 따라 AI/ML 기반 CSI 피드백/보고 방법 또는 기존 CSI 피드백/보고 방법을 적 용할 수 있다(예를 들어, DL 채널의 코히어런스 대역폭이 상응하는 설정된 임계값 아래에 있는 경우, UE는 기존 CSI 피드백/보고 방법을 적용할 수 있음). 다른 예에서, BS는 UE에 대한 설정 정보에 채널 유사도 임계값(channel similarity threshold)을 포함할 수 있 다. UE가 채널 유사도 값이 채널 유사도 임계값 이상이라고 결정하는 경우, UE는 기존 방법을 사용하여 CSI 보 고를 결정할 수 있다. 반면, UE가 채널 유사도 값이 채널 유사도 임계값보다 낮다고 결정하는 경우, 채널이 유 사하지 않거나 비선형일 때 채널 동작을 예측하는 데 ML 기반 방법이 기존 방법보다 우수할 수 있기 때문에 UE 는 CSI 보고를 결정하기 위해 ML 기반 방법을 사용할 수 있다. 다른 예에서, BS는 기준 채널 세트(예를 들어, 해당 세트의 각각의 요소는 N×K 복소 매트릭스일 수 있으며, 여 기서 N은 안테나의 수에 상응하고, K는 SB의 수에 상응함), 유사도 메트릭(예를 들어, NMSE) 및 유사도 임계값 으로 UE를 설정할 수 있다. 그런 다음, UE는 측정된 DL 채널과 기준 채널 세트의 각각의 요소 간의 유사도를 계 산할 수 있으며; 이러한 유사도 값 중 임의의 것이 유사도 임계값을 초과하면, UE는 AI/ML 기반 CSI 피드백/보 고 방법을 적용할 수 있다(그렇지 않으면, UE는 기존 CSI 피드백/보고 방법을 적용할 수 있음). BS는 또한 선택 한 CSI 피드백/보고 방법과 함께 계산된 유사도 값을 보고하도록 UE를 설정할 수 있다. 다른 실시예에서, 예시를 위해, \"AI/ML 기반 CSI 설정 권장\"이라는 용어는 CSI 설정 권장을 생성하는 방법을 나 타내는 데 사용되며, 여기서, \"AI/ML 기반 CSI 설정 권장이자\"는 오프라인 트레이닝을 위해 미리 계산 및/또는 미리 저장된 CSI를 활용하는 머신을 활용할 수 있다. \"AI/ML 기반 CSI 설정 권장이자\"는 또한 온라인 트레이닝을 위해 새롭게 수집된 CSI를 활용하는 머신을 활용할 수 있다. \"AI/ML 기반 CSI 설정 권장이자\"는 또한 연합 학습을 위해 다수의 머신, 예를 들어, gNB 및 다수의 UE를 활용할 수 있다. AI/ML 모델 아키텍처의 측면에서, \"AI/ML 기반 CSI 설정 권장이자\"는 CNN의 단일 또는 다중 계층을 활용할 수 있다. \"AI/ML 기반 CSI 설정 권장이자\"는 또한 RNN을 활용할 수 있다. \"AI/ML 기반 CSI 설정 권장이자\"는 또한 TNN을 활용할 수 있다. 동일한 방법을 지칭하는 다른 용어가 또한 사용될 수 있다. 도 15는 본 개시의 실시예에 따라 UE 지원 CSI 설정 권장을 지원하기 위한 BS에서의 예시적인 동작 방법 을 도시한다. 도 15에 도시된 UE 지원 CSI 설정 권장을 지원하기 위한 BS에서의 예시적인 동작 방법의 실 시예는 단지 예시를 위한 것이다. 도 15는 본 개시의 범위를 UE 지원 CSI 설정 권장을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 15에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드 백을 위한 CSI 설정 권장을 생성하는 방법의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, BS는 설정 정보를 BS로 송신하며, 이 정보는 CSI 설정 권장을 생성하는 방법의 인에이블/디스에이블, 사용될 방법, 방법 파라미터, 및/또는 UE에 의해 보고된 방 법 파라미터 업데이트가 사용될지 여부와 같은 설정 정보를 포함할 수 있다. 일 예에서, 이 방법은 ML 접근 방 식에 상응할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메 시지는 Type II 코드북(5.2.2.2.3/4/5/6/7, [4] 참조)을 기반으로 하는 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북(5.2.2.2.1/2, [4] 참조) 또는 Type II 코드북(5.2.2.2.3/4/5/6/7, [4] 참조)에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기존 피드백/보고 방법에 기반하여 생성된 CSI 보 고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예 에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 나타내는 메시지를 UE로부터 수신한다. CSI 설정 권장의 일 예는 계수 매트릭스에 대한 비트맵이며, 이는 본 개시의 후반부에서 \"비트맵 변형\" 섹션에 설명될 것이다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션 에 설명됨), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 대해 정의될 수 있거나, 기존 UCI 포맷이 이 메시지 에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으 며, 따라서 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 다른 예에서, 이 메시지는 CSI 보고와 독립적으로 송신될 수 있다. 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 대한 응답을 나타내는 메시지를 UE로 송신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거 나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명됨), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다 른 예에서, 이 메시지는 PDCCH 상에서 송신될 수 있으며, 여기서 이 메시지에 대해 새로운 DCI 포맷이 정의될 수 있거나, 이 메시지에 대해 기존 DCI 포맷이 사용될 수 있다. 이 메시지에 대해 기존 DCI 포맷이 사용되는 경 우, 이 지시자는 DCI의 일부, 예를 들어 1비트 지시자로서 포함될 수 있다. 동작에서, BS는 UE가 이 보고 를 생성하기 위해 CSI 설정 권장을 적용한 CSI 보고를 UE로부터 수신한다. 다른 예에서, 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하여 ACK/NACK를 UE로 송신할 수 있다. BS가 ACK를 송신하면, BS는 UE로부터 CSI 보고를 수신하며, 여기서 UE는 동작에서 이 보고를 생 성하기 위해 CSI 설정 권장을 적용했다. BS가 NACK를 송신하면, BS는 동작에서 UE로부터 기존 CSI 보고를 수신한다. 다른 예에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하지 않는다. 이 경우, 동작은 수행될 필 요가 없다. 일 예에서, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용하지 않는다. 다른 예 에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 자동으로 적용하도록 UE를 설정할 수 있으며; 이 경우, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용할 것이다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(1510 및 1514)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스에이블되면, BS는 동작에서 UE로부터 기존 CSI 보고를 계속 수신한다. 도 16은 본 개시의 실시예에 따라 UE 지원 CSI 설정 권장을 지원하기 위한 UE에서의 예시적인 동작 방법 을 도시한다. 도 16에 도시된 UE 지원 CSI 설정 권장을 지원하기 위한 UE에서의 예시적인 동작 방법의 실 시예는 단지 예시를 위한 것이다. 도 16은 본 개시의 범위를 UE 지원 CSI 설정 권장을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 16에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 CSI 피드백을 위한 CSI 설정 권장을 생성하 는 방법의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 일 예에서, 이 방법은 ML 접 근 방식에 상응할 수 있다. 동작에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 CSI 설정 권장을 생성하는 방법의 인에이블/디스에이블, 사용될 방법, 방법 파라미터, 및/또는 UE에 의해 보고된 방법 파라미터 업데이트가 사용되는지 여부와 같은 설정 정보를 포함할 수 있다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장을 나타내는 메시지를 BS로 송신한다. CSI 설정 권장 의 일 예는 계수 매트릭스에 대한 비트맵이며, 이는 본 개시의 후반부에서 \"비트맵 변형\" 섹션에 설명될 것이다. 일 예에서, 전용/새로운 MAC CE는 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원정보\" 섹션에 설명될 것임), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 이 메시지에 대한 새로운 UCI 포맷이 정의될 수 있거나, 기존 UCI 포맷 이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포 함될 수 있으므로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 다른 예에 서, 이 메시지는 CSI 보고와 독립적으로 송신될 수 있다. 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장에 대한 응답을 나타내는 메시지를 BS로부터 수신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용 될 수 있거나(본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명될 것임), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PDCCH 상에서 송신될 수 있으며, 여기서 새로운 DCI 포맷이 이 메시지에 대 해 정의될 수 있거나, 기존 DCI 포맷이 이 메시지에 사용될 수 있다. 기존 DCI 포맷이 이 메시지에 사용되는 경 우, 이 지시자는 DCI의 일부로서 예를 들어 1비트 지시자로서 포함될 수 있다. 동작에서, UE는 UE가 이 보고를 생성하기 위해 CSI 설정 권장을 적용한 CSI 보고를 BS로 송신한다. 다른 예에서, 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하여 BS로부터 ACK/NACK를 수신 할 수 있다. UE가 ACK를 수신하면, UE는 CSI 보고를 BS로 송신하며, 여기서 UE는 동작에서 이 보고를 생 성하기 위해 CSI 설정 권장을 적용했다. UE가 NACK를 수신하면, UE는 동작에서 기존 CSI 보고를 BS로 송 신한다. 다른 예에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하지 않는다. 이 경우, 동작은 수행될 필 요가 없다. 일 예에서, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용하지 않는다. 다른 예 에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 자동으로 적용하도록 UE를 설정할 수 있다. 이 경우, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용할 것이다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(1610 및 1614)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스인에이블되는 경우, UE는 동작에서 기존 CSI 보고를 BS로 계속 송신한다. 도 17은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예 시적인 동작 방법을 도시한다. 도 17에 도시된 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하 기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 17은 본 개시의 범위를 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구 현으로 제한하지 않는다. 도 17에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드 백을 위한 CSI 설정 권장을 생성하는 방법의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 CSI 설정 권장을 생성하는 방법의 인에이블/디스에이블, 사용될 방법, 방법 파라미터, 및/또는 UE에 의해 보고된 방 법 파라미터 업데이트가 사용될지 여부와 같은 설정 정보를 포함할 수 있다. 일 예에서, 이 방법은 ML 접근 방 식에 상응할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메 시지는 Type II 코드북을 기반으로 하는 CSI 피드백에 상응할 수 있다(5.2.2.2.3/4/5/6/7, [4] 참조). 일 예에 서, 이 메시지는 Type I 코드북(5.2.2.2.1/2, [4] 참조) 또는 Type II 코드북(5.2.2.2.3/4/5/6/7, [4] 참조)에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기존 피드백/보고 방법에 기반하여 생성된 CSI 보 고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예 에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 나타내는 메시지를 UE로부터 수신한다. CSI 설정 권장의 일 예는 계수 매트릭스에 대한 비트맵이며, 이는 본 개시의 후반부에서 \"비트맵 변형\" 섹션에 설명될 것이다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설 명됨), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 대해 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용 될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으며, 따라 서 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 다른 예에서, 이 메시지는 CSI 보고와 독립적으로 송신될 수 있다. 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 대한 응답을 나타내는 메시지를 UE로 송신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명됨), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에 서, 이 메시지는 PDCCH 상에서 송신될 수 있으며, 여기서 이 메시지에 대해 새로운 DCI 포맷이 정의될 수 있거 나, 이 메시지에 대해 기존 DCI 포맷이 사용될 수 있다. 이 메시지에 대해 기존 DCI 포맷이 사용되는 경우, 이 지시자는 DCI의 일부로서 예를 들어 1비트 지시자로서 포함될 수 있다. 동작에서, BS는 UE가 이 보고를 생성하기 위해 CSI 설정 권장을 적용한 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 기존 CSI 피드백/ 보고 방법으로 폴백하라는 요청에 상응하는 메시지를 UE로부터 수신하며, 이는 본 개시의 후반부에서 \"기존 CSI 폴백 요청\" 섹션에 설명된다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메시지는 Type II 코드북 에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북을 기반으 로 한 CSI 피드백에 상응할 수 있다. 동작에서, BS는 UE로부터 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 다른 예에서, 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하여 ACK/NACK를 UE로 송신할 수 있다. BS가 ACK를 송신하는 경우, BS는 UE가 동작에서 이 보고를 생성하기 위해 CSI 설정 권장을 적용 한 CSI 보고를 UE로부터 수신한다. BS가 NACK를 송신하는 경우, BS는 동작에서 UE로부터 기존 CSI 보고를 수신한다. 다른 예에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하지 않는다. 이 경우, 동작은 수행될 필 요가 없다. 일 예에서, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용하지 않는다. 다른 예 에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 자동으로 적용하도록 UE를 설정할 수 있다. 이 경우, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용한다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(1710 및 1714)을 인에이블/디스에이블할 수 있다. 이러한 동작이 불가능해지는 경우, BS는 동작에서 UE로부터 기존 CSI 보고를 계속 수신한다. 도 18은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예 시적인 동작 방법을 도시한다. 도 18에 도시된 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하 기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 18은 본 개시의 범위를 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구 현으로 제한하지 않는다. 도 18에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 UE(예를 들어, UE)는 CSI 피드 백을 위한 CSI 설정 권장을 생성하는 방법의 지원을 포함하는 능력 정보를 BS에 보고한다. 일 예에서, 이 방법 은 ML 접근 방식에 상응할 수 있다. 동작에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 CSI 설정 권장을 생성하는 방법의 인에이블/디스에이블, 사용될 방법, 방법 파라미터, 및/또는 UE에 의해 보고된 방법 파 라미터 업데이트가 사용될지 여부와 같은 설정 정보를 포함할 수 있다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수신한다. 일 예에서, 이 메시 지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서 UE는 후속 CSI 보고에 대한 CSI 설정 권장을 나타내는 메시지를 BS로 송신한다. CSI 설정 권장의 일 예는 계수 매트릭스에 대한 비트맵이며, 이는 본 개시의 후반부에서 \"비트맵 변형\" 섹션에 설명될 것이다. 일 예에서, 전 용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명됨). 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있 으며, 여기서 이 메시지에 대한 새로운 UCI 포맷이 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백과 함께, 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 다른 예에서, 이 메시지는 CSI 보고 와 독립적으로 송신될 수 있다. 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장에 대한 응답을 나타 내는 메시지를 BS로부터 수신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개 시의 후반부에서 \"UE 지원 정보\" 섹션에 설명됨), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PDCCH 상에서 송신될 수 있으며, 여기서 새로운 DCI 포맷이 이 메시지에 대해 정의될 수 있거나, 기존 DCI 포맷이 이 메시지에 사용될 수 있다. 기존 DCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 DCI의 일부 로서 예를 들어 1비트 지시자로서 포함될 수 있다. 동작에서, UE는 UE가 이 보고를 생성하기 위해 CSI 설 정 권장을 적용한 CSI 보고를 BS로 송신한다. 동작에서, UE는 기존 CSI 피드백/보고 방법으로 폴백하라는 요청에 상응하는 메시지를 BS로 송신하며, 이는 본 개시의 후반부에서 \"기존 CSI 폴백 요청\" 섹션에 설명될 것 이다. 일 예에서, 이 방법은 Type II 코드북을 기반으로 하는 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방 법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 BS로부 터 기존 CSI 피드백 설정 메시지를 수신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 다른 예에서, 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하여 BS로부터 ACK/NACK를 수신 할 수 있다. UE가 ACK를 수신하면, UE는 UE가 동작에서 이 보고를 생성하기 위해 CSI 설정 권장을 적용한 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 기존 CSI 보고를 BS로 송신한다. 다른 예에서 BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하지 않는다. 이 경우, 동작은 수행될 필요 가 없다. 일 예에서, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용하지 않는다. 다른 예에 서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 자동으로 적용하도록 UE를 설정할 수 있고; 이 경우, UE는 동 작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용할 것이다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없고; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있 다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(1810 및 1814)을 인에이블/디스에이블할 수 있다. 이러한 동작이 불가능해지는 경우, UE는 동작에서 기존 CSI 보고를 BS로 계속 송신한다. 도 19는 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위 한 BS에서의 예시적인 동작 방법을 도시한다. 도 19에 도시된 기존 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 19는 기존 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 본 개시의 범위를 제한하지 않는다. 도 19에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 CSI 피드 백을 위한 CSI 설정 권장을 생성하는 방법의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 CSI 설정 권장을 생성하는 방법의 인에이블/디스에이블, 사용될 방법, 방법 파라미터, 및/또는 UE에 의해 보고된 방 법 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, BS는 기존 CSI 피드백 설정 메시지를 UE로 송신한다. 일 예에서, 이 메시지는 Type II 코드북을 기반으로 하는 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코 드북 또는 Type II 코드북을 기반으로 하는 CSI 피드백에 상응할 수 있다. 동작에서, BS는 UE로부터 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피 드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응 할 수 있다. 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 나타내는 메시지를 UE로부터 수신한 다. CSI 설정 권장의 일 예는 계수 매트릭스에 대한 비트맵이며, 이는 본 개시의 후반부에서 \"비트맵 변형\" 섹 션에 설명될 것이다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에 서 \"UE 지원 정보\" 섹션에 설명될 것임), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지 는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 대해 정의될 수 있거나,기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으며 따라서 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 다른 예에서, 이 메시지는 CSI 보고와 독립적으로 송신될 수 있다. 동작에서, BS는 후속 CSI 보고 에 대한 CSI 설정 권장에 대한 응답을 나타내는 메시지를 UE로 송신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명됨), 기존 MAC CE가 이 메시 지에 사용될 수 있다. 다른 예에서, 이 메시지는 PDCCH 상에서 송신될 수 있으며, 여기서 새로운 DCI 포맷이 이 메시지에 대해 정의될 수 있거나, 기존 DCI 포맷이 이 메시지에 사용될 수 있다. 기존 DCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 DCI의 일부로서 예를 들어, 1비트 지시자로서 포함될 수 있다. 동작에서, BS 는 CSI 설정 권장이 적용된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 기존 CSI 피드백/보고 방법으 로 폴백하라는 명령에 상응하는 메시지를 UE로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상 응할 수 있다. 동작에서, BS는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드 북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 다른 예에서, 동작에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하여 ACK/NACK를 UE로 송신할 수 있다. BS가 ACK를 송신하면, BS는 동작에서 CSI 설정 권장이 적용된 CSI 보고를 UE로부터 수신한다. BS가 NACK를 송신하면, BS는 동작에서 UE로부터 기존 CSI 보고를 수신한다. 다른 예에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하지 않는다. 이 경우, 동작는 수행될 필 요가 없다. 일 예에서 UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용하지 않는다. 다른 예에 서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 자동으로 적용하도록 UE를 설정할 수 있다. 이 경우, UE는 동 작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용할 것이다. 다른 예에서, BS는 동작에서 UE에 대한 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없고; BS는 동작에서 UE로부터 기존 CSI 보고를 수신하기 시 작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(1910 및 1914)을 인에이블/디스에이블할 수 있다. 이러한 동작이 불가능해지는 경우, BS는 동작에서 UE로부터 기존 CSI 보고를 계속 수신한다. 도 20은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위 한 UE에서의 예시적인 동작 방법을 도시한다. 도 20에 도시된 기존 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 20)은 본 개시의 범위를 UE에서 BS 개시 또는 BS 제어 폴백을 기존 CSI 피드백/보고 방법으로 지원하기 위한 예시적인 방법의 특정 구현으로 제한하지 않는다. 도 20에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 CSI 피드백을 위한 CSI 설정 권장을 생성하 는 방법의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 일 예에서, 이 방법은 ML 접 근 방식에 상응할 수 있다. 동작에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 CSI 설정 권장을 생성하는 방법의 인에이블/디스에이블, 사용될 방법, 방법 파라미터, 및/또는 UE에 의해 보고된 방법 파라미터 업데이트가 사용될지 여부와 같은 설정 정보를 포함할 수 있다. 일 예에서, 이 방법은 ML 접근 방식에 상응할 수 있다. 동작에서, UE는 BS로부터 기존 CSI 피드백 설정 메시지를 수신한다. 일 예에서, 이 메시지는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 메시지는 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장을 나타내는 메시지를 BS로 송신한다. CSI 설정 권장 의 일 예는 계수 매트릭스에 대한 비트맵이며, 이는 본 개시의 후반부에서 \"비트맵 변형\" 섹션에 설명될 것이다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명될 것임), 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 이 메시지에 대해 새로운 UCI 포맷이 정의될 수 있거나, 이 메시지에 대해 기존 UCI 포맷이 사용될 수 있다. 이 메시지에 대해 기존 UCI 포맷이 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으며 따라서 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수있다. 다른 예에서, 이 메시지는 CSI 보고와 독립적으로 송신될 수 있다. 동작에서, UE는 후속 CSI 보고 에 대한 CSI 설정 권장에 대한 응답을 나타내는 메시지를 BS로부터 수신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나(이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명됨), 이 메시지에 대해 기존 MAC CE가 사용될 수 있다. 다른 예에서, 이 메시지는 PDCCH 상에서 송신될 수 있으며, 여기서 이 메시지에 대해 새로운 DCI 포맷이 정의될 수 있거나, 이 메시지에 대해 기존 DCI 포맷이 사용될 수 있다. 기존 DCI 포맷 이 이 메시지에 사용되는 경우, 이 지시자는 DCI의 일부로서 예를 들어 1비트 지시자로서 포함될 수 있다. 동작 에서, UE는 UE가 이 보고를 생성하기 위해 CSI 설정 권장을 적용한 CSI 보고를 BS로 송신한다. 동작 에서, UE는 기존 CSI 피드백/보고 방법으로 폴백하라는 명령에 상응하는 메시지를 BS로부터 수신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 예에서, 이 방법은 Type I 코드 북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 동작에서, UE는 기존 피드백/보고 방법 에 의해 생성된 CSI 보고를 BS로 송신한다. 일 예에서, 이 방법은 Type II 코드북에 기반한 CSI 피드백에 상응 할 수 있다. 일 예에서, 이 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 다른 예에서, 동작에서, UE는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하여 BS로부터 ACK/NACK를 수신 할 수 있다. UE가 ACK를 수신하면, UE는 UE가 동작에서 이 보고를 생성하기 위해 CSI 설정 권장을 적용한 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 기존 CSI 보고를 BS로 송신한다. 다른 예에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장에 응답하지 않는다. 이 경우, 동작은 수행될 필 요가 없다. 일 예에서, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용하지 않는다. 다른 예 에서, BS는 후속 CSI 보고에 대한 CSI 설정 권장을 자동으로 적용하도록 UE를 설정할 수 있으며; 이 경우, UE는 동작에서 후속 CSI 보고에 대한 CSI 설정 권장을 적용할 것이다. 다른 예에서, UE는 동작에서 BS로부터 기존 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없고; UE는 동작에서 기존 CSI 보고를 BS로 송신하기 시작할 수 있 다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(2010 및 2014)을 인에이블/디스에이블할 수 있다. 이러한 동작이 불가능해지는 경우, UE는 동작에서 기존 CSI 보고를 BS로 계속 송신한다. UE가 Type II 코드북을 기반으로 CSI 피드백을 생성할 때, 이는 보고하는 계수 매트릭스 C에서 0이 아닌 계수를 식별하기 위해 비트맵을 사용한다. 이 비트맵의 차원은 C의 차원과 동일하다. CSI 설정 권장은 Type II 코드북에 대한 비트맵과 상이할 수 있는 C에 대한 비트맵을 포함할 수 있다. 일 실시 예에서, 비트맵은 C의 열(또는 행) 세트로 구성될 수 있다. BS는 이러한 C의 열(또는 행) 세트로 UE를 설정할 수 있거나, UE는 이러한 C의 열(또는 행) 세트를 BS에 권장할 수 있다. 일 실시예에서, 비트맵은 C의 다수의 열(또는 행) 세트로 구성될 수 있다. BS는 이러한 C의 열(또는 행) 세트로 UE를 설정할 수 있거나, UE는 이러한 C의 열(또는 행) 세트를 BS에 권장할 수 있다. 이러한 C의 열(또는 행) 세 트 간의 전환은 주기적, 반영구적 또는 비주기적으로서 설정될 수 있다. UE는 또한 이러한 C의 열(또는 행) 세 트 간의 전환 설정을 BS에 권장할 수 있다. 일 실시예에서, 비트맵은 C의 인덱스 세트로 구성될 수 있다. BS는 이러한 C의 인덱스 세트로 UE를 설정할 수 있거나, UE는 이러한 C의 인덱스 세트를 BS에 권장할 수 있다. 일 실시예에서, 비트맵은 C의 다수의 인덱스 세트로 구성될 수 있다. BS는 이러한 C의 인덱스 세트로 UE를 설정 할 수 있거나, UE는 이러한 C의 인덱스 세트를 BS에 권장할 수 있다. 이러한 C의 인덱스 세트 간의 전환은 주기 적, 반영구적 또는 비주기적으로서 설정될 수 있다. UE는 또한 이러한 C의 인덱스 세트 간의 전환 설정을 BS에 권장할 수 있다. 일 실시예에서, BS는 RRC 설정을 통해 전환 지시자를 CSI 설정 권장자에게 송신하도록 UE를 설정할 수 있다. 표 8은 이러한 전환 지시자를 송신하도록 UE를 설정하기 위해 IE PUCCH-Config를 수정하는 예이다. 이 예에서 format5는, 있는 경우, 이러한 전환 지시자에 대한 새로운 PUCCH 포맷에 상응한다. CSICfgRecSwitchResourceToAddModList 및 CSICfgRecSwitchResourceToReleaseList는, 있는 경우, 이러한 전환 지시자에 대해 각각 부가되거나 해제될 수 있는 PUCCH 자원에 상응한다. 일 예에서, 기존 PUCCH 포맷(예를 들어, 포맷 3 또는 4)은 이 지시자에 사용될 수 있다.[표 8]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "일 실시예에서, BS는 MAC CE 활성화 명령을 통해 CSI 설정 권장자로 전환하는 지시자를 송신하도록 UE를 설정할 수 있다. 일 실시예에서, BS는 DCI를 통해 CSI 설정 권장자로 전환하는 지시자를 송신하도록 UE를 설정할 수 있다. 다른 실시예에서, BS는 PDCCH 주문을 통해 CSI 설정 권장자를 사용하도록 UE를 설정할 수 있으며, 여기서 새로 운 DCI 포맷이 정의될 수 있고, 이러한 PDCCH 주문은 이러한 새로운 DCI 포맷에 의해 트리거될 수 있다. 다른 예에서, BS는 MAC CE 활성화 명령을 통해 UE가 CSI 설정 권장자를 사용하도록 UE를 설정할 수 있다. 다른 예에서, BS는 RRC 설정을 통해 CSI 설정 권장자를 사용하도록 UE를 설정할 수 있다. 표 9는 CSI 피드백을 생성/보고하기 위해 CSI 설정 권장자를 사용하도록 UE를 설정하기 위해 IE CodebookConfig를 수정하는 예이다. 이 예에서, CSI 설정 권장자는 Type II 코드북의 Rel-16 서브타입에 적용될 수 있다. CodebookConfig의 경우, enabledRecs는, 있는 경우, 어떤 CSI 설정 권장자가 인에이블되는지를 결정하고; switchSlot은, 있는 경우, 이 러한 CSI 설정 권장자가 인에이블되는 슬롯 세트를 결정하고, csi-ResourceConfigId는, 있는 경우, 이러한 CSI 설정 권장자의 ID에 상응한다. 일 예에서, 하나의 CSI 설정 권장자는 각각의 CSI-ResourceConfig에 대해 정의된 다(csi-ResourceConfigId에 상응하는 엔트리를 가짐). 다른 예에서, 모든 CSI-ResourceConfig에 대해 하나의 CSI 설정 권장자가 정의된다(여기서 각각의 CSI-ResourceConfig는 csi-ResourceConfigId에 엔트리를 가짐).[표 9]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "(n1, n2)는 제1(n1) 및 제2(n2) 차원의 안테나 포트의 수를 나타낸다고 한다. 일 예에서, (n1, n2)의 각각의 지 원된 조합에 대해 하나의 CSI 설정 권장자가 정의될 수 있다. 다른 예에서, (n1, n2)의 모든 지원된 조합에 대 해 하나의 CSI 설정 권장자가 정의될 수 있으며, 여기서 이러한 CSI 설정 권장자에 대한 입력 상에서 적절한 전 처리가 수행될 수 있다. 다른 예에서, (n1, n2)의 모든 지원된 조합은 분리된 세트로 분할될 수 있으며; 각각의 세트에 대해 하나의 CSI 설정 권장자가 정의될 수 있으며, 여기서 이러한 CSI 설정 권장자에 대한 입력 상에서 적절한 전처리가 수행될 수 있다 CSI-ReportConfig IE는 CSI 피드백을 생성/보고하기 위한 SB의 수를 설정하는 필드 csi-ReportingBand를 포함 한다. 일 예에서, 지원되는 각각의 SB의 수(및/또는 PRB의 각각의 SB의 크기)에 대해 하나의 CSI 설정 권장자가 정의될 수 있다. 다른 예에서, 지원되는 모든 SB의 수(및/또는 PRB의 각각의 SB의 크기)에 대해 하나의 CSI 설 정 권장자가 정의될 수 있으며, 여기서 이러한 CSI 설정 권장자에 대한 입력 상에서 적절한 전처리가 수행될 수 있다. 다른 예에서, 지원되는 모든 SB의 수(및/또는 PRB의 각각의 SB의 크기)는 분리된 세트로 분할될 수 있으 며; 각각의 세트에 대해 하나의 CSI 설정 권장자가 정의될 수 있으며, 여기서 이러한 CSI 설정 권장자에 대한 입력 상에서 적절한 전처리가 수행될 수 있다 CodebookConfig IE는 또한 다중 TRP 시스템에서 CSI 피드백을 생성/보고하기 위해 CSI 설정 권장자를 사용하도 록 UE를 설정하기 위해 수정될 수 있으며, 여기서 UE는 다수의 TRP로부터 DL 수신을 수신하거나 UL 송신을 다수 의 TRP로 송신할 수 있다. 일 예에서, TRP는 NZP CSI-RS 자원 또는 CSI-RS 자원 세트 또는 안테나 포트 그룹과 기능적으로 동등하다(또는 이에 상응한다). 일 예에서, 각각의 TRP에 대해 하나의 CSI 설정 권장자가 정의된다 (여기서 각각의 TRP는 특정 CORESET 풀에 속할 수 있고; 각각의 코드북은 상응하는 CORESET 풀 ID를 가질 수 있 음). 다른 예에서, 모든 TRP에 대해 하나의 CSI 설정 권장자가 정의된다(여기서 각각의 TRP에 대한 CORESET 풀 ID는 이 코드북에 매핑됨).다른 실시예에서, BS는 RRC 설정을 통해 CSI 설정 권장자에 대한 주파수 호핑을 지원하도록 UE를 설정할 수 있 으며, 여기서 이러한 BS는 이미 이 UE에 대한 CSI-RS에 대한 주파수 호핑을 설정했다. 표 10은 CSI-RS에 대한 주파수 호핑을 지원하는 CSI 피드백을 생성/보고하기 위한 CSI 설정 권장자를 설정하기 위해 IE CodebookConfig 를 수정하는 예이다. 이 예에서, CSI 설정 권장자는 Type II 코드북의 Rel-16 서브타입에 적용될 수 있다. CodebookConfig의 경우, frequencyHopping는, 있는 경우, 이러한 CSI 설정 권장자에 상응하는 CSI-RS 패턴이 슬롯 내에서 호핑하는지 또는 슬롯 사이에서 호핑하는지 여부를 결정하며; frequencyHoppingOffset은, 있는 경 우, 사용 가능한 SB에 걸친 이러한 CSI-RS 패턴의 호핑 패턴을 결정한다. 다른 예에서, 주파수 호핑은 NZP CSI- RS 자원을 설정하는 IE NZP-CSI-RS-Resource를 통해 설정되거나, CSI 자원 세트를 설정하는 IE CSI- ResourceConfig를 통해 설정되거나, CSI 보고를 설정하는 IE CSI-ReportConfig를 통해 설정될 수 있다. [표 10]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "다른 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 CSI 설정 권장자를 트레이닝하도록 UE를 설정할 수 있다. 표 11은 AI/ML 기반 CSI 설정 권장자의 트레이닝을 설정하기 위해 IE PDSCH-ServingCellConfig를 수정하는 예 이다. PDSCH-ServingCellConfig의 경우, mlCSICfgParams는, 있는 경우, 적어도 하나의 mlCSICfgTrainParams 세 트를 포함할 수 있고; 각각의 mlCSICfgTrainParams 세트는 AI 기반 CSI 설정 권장자를 트레이닝한 다른 UE에 대 한 트레이닝된 가중치 및 바이어스를 포함할 수 있다. 이러한 트레이닝된 가중치 및 바이어스는 AI/ML 기반 CSI 설정 권장자를 트레이닝하는 데 UE를 도울 수 있다. mlCSICfgParams의 정보는 상응하는 코드북에 대한 ID, 예를 들어, 상응하는 CSI-ResourceConfig의 ID, 상응하는 CORESET 풀의 ID 등으로 태그(tag)될 수 있다.[표 11]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "일 예에서, PDSCH-ServingCellConfig IE는 트레이닝 오류(예를 들어, 코사인 유사도, NMSE 등), 하이퍼파라미 터(예를 들어, 학습률, 트레이닝 에포크의 수, 트레이닝과 테스트 데이터 간의 분할 등) 등을 포함하는 다른 UE 로부터의 트레이닝/추론 지원 정보를 포함할 수 있다. 다른 예에서, PDSCH-ServingCellConfig IE는 UE가 AI/ML 기반 CSI 설정 권장자에 대한 계수 펑처링(coefficient puncturing)을 위한 모델과 계수 복구를 위한 모델을 모 두 트레이닝하여, 두 모델에 대한 트레이닝된 파라미터를 BS에 보고하라는 명령을 포함하는 트레이닝 명령어를 포함할 수 있고; UE는 또한 AI/ML 기반 CSI 설정 권장자에 대한 계수 펑처링을 위한 모델만을 트레이닝(및 BS로 부터 계수 복구를 위한 트레이닝된 모델에 대한 파라미터를 사용)하도록 명령을 받을 수 있다. UE가 계수 복구를 위한 모델에 대한 트레이닝된 파라미터를 BS에 보고하도록 명령을 받는 경우, 이러한 파라미 터는 BS에 대한 권장의 역할을 할 수 있다. 다른 예에서, UE는 계수 복구를 위한 모델(트레이닝된 파라미터 및 모델 구조를 포함함)을 BS에 보고하도록 명령을 받을 수 있다. 다른 예에서, BS는 AI/ML 기반 CSI 설정 권장자에 대한 계수 펑처링을 위한 모델과 계수 복구를 위한 모델을 모 두 트레이닝할 수 있다. 그런 다음, BS는 계수 펑처링을 위한 모델에 대한 트레이닝된 파라미터를 UE로 시그널 링할 수 있고, 그런 다음, BS는 추론 모드에서 계수 펑처링을 위한 모델을 동작하기 위한 명령어(예를 들어, 드 롭아웃(dropout), 배치 정규화(batch normalization) 등과 관련된 명령어)와 함께 계수 펑처링을 위한 모델에 대한 트레이닝된 파라미터를 UE로 시그널링할 수 있다. BS는 또한 계수 펑처링을 위한 모델(트레이닝된 파라미 터 및 모델 구조를 포함함)을 UE로 시그널링할 수 있다. 일 실시예에서, UE 지원 정보 보고에 대해 새로운 MAC CE가 정의될 수 있다. 이 MAC CE는 [3]의 표 6.2.1-2에 명시될 수 있는 논리적 채널 ID를 갖는 MAC 서브헤더에 의해 식별될 수 있다. 이 MAC CE는 가변적인 크기를 가 질 수 있으며, 다음의 필드로 구성될 수 있다. 블록 오류율: 이 필드는 UE의 관찰된 블록 오류율, 예를 들어, 마지막 1000개의 수신된 전송 블록에 대해 계산 된 블록 오류율을 나타낸다. 처리량: 이 필드는 UE의 관찰된 처리량, 예를 들어, 마지막 1000개의 수신된 전송 블록에 대해 계산된 메가비트 /초의 처리량을 나타낸다. 추정된 코히어런스 시간: 이 필드는 UE의 DL 채널 코히어런스 시간 추정치를 밀리초로 나타낸다. 추정된 코히어런스 대역폭: 이 필드는 UE의 DL 채널 코히어런스 대역폭 추정치를 킬로헤르츠로 나타낸다. IR1: 이 필드는 권장된 비트맵 필드를 포함하는 옥텟이 존재를 나타낸다. IR1 필드가 1로 세팅되면, 권장된 비 트맵 필드를 포함하는 옥텟은 존재한다. IR1 필드가 0으로 세팅되면, 권장된 비트맵 필드를 포함하는 옥텟은 존 재하지 않는다. 권장된 비트맵: 이 필드는 CSI 피드백을 생성/보고하기 위한 UE의 권장된 비트맵, 예를 들어, 계수 매트릭스의 열의 세트를 나타낸다. IR2: 이 필드는 권장된 빔 필드를 포함하는 옥텟의 존재를 나타낸다. IR2 필드가 1로 세팅되면, 권장된 빔 필드 를 포함하는 옥텟은 존재한다. IR2 필드가 0으로 세팅되면, 권장된 빔 필드를 포함하는 옥텟은 존재하지 않는다. 권장된 빔: 이 필드는 UE의 권장된(SD, FD 및/또는 TD/DD) 빔, 예를 들어 빔 인덱스의 세트를 나타낸다. IR3: 이 필드는 권장된 계층(Recommended Layers) 필드를 포함하는 옥텟의 존재를 나타낸다. IR3 필드가 1로 세 팅되면, 권장된 계층 필드를 포함하는 옥텟은 존재한다. IR3 필드가 0으로 세팅되면, 권장된 계층 필드를 포함 하는 옥텟은 존재하지 않는다. 권장된 계층: 이 필드는 CSI 피드백을 생성/보고하기 위한 UE의 권장된 계층, 예를 들어 계층 인덱스의 세트를 나타낸다. IR4: 이 필드는 권장된 설정 타입(Recommended Configuration Type) 필드를 포함하는 옥텟의 존재를 나타낸다. IR4 필드가 1로 세팅되면, 권장된 설정 타입을 포함하는 옥텟은 존재한다. IR4 필드가 0으로 세팅되면, 권장된 설정 타입을 포함하는 옥텟은 존재하지 않는다. 권장된 설정 타입: 이 필드는 CSI 설정 권장으로 CSI 피드백을 생성/보고하기 위한 UE의 권장된 설정 타입(예를 들어, 비주기적, 반영구적, 주기적)을 나타낸다. 일 예에서, 이러한 권장은 UE의 궤적 예측을 기반으로 할 수 있다(예를 들어, UE는 BS에 대한 LOS 경로를 가질 때에만 CSI 설정 권장이 트리거되도록 권장함). o 다른 예에서, UE는 다수의 CSI 설정 권장(예를 들어, 다수의 권장된 비트맵)을 생성하고 CSI 피드백을 생성/ 보고할 때 특정 CSI 설정 권장을 주기적으로 적용하도록 권장할 수 있다(예를 들어, UE에 BS에 대한 LOS 경로를 가질 경우 비트맵 #1을 적용하고, UE가 BS에 대한 LOS 경로를 갖지 않을 경우 비트맵 #2를 적용함). IR5: 이 필드는 권장된 기반(Recommended Basis) 필드를 포함하는 옥텟의 존재를 나타낸다. IR5 필드가 1로 세 팅되면, 권장된 기반 필드를 포함하는 옥텟은 존재한다. IR5 필드가 0으로 세팅되면, 권장된 기반 필드를 포함 하는 옥텟은 존재하지 않는다. 권장된 기반: 이 필드는 CSI 피드백을 생성/보고하기 위한 UE의 권장된(SD, FD 및/또는 TD/DD) 기반(예를 들어, 직교/비직교 DFT, DFT의 오버샘플링/회전 계수, DCT)을 나타낸다. 일 예에서, (SD, FD 및/또는 TD/DD) 기반의 세트는 미리 정의될 수 있으며, UE는 해당 세트에서의 권장된 인덱스를 시그널링할 수 있다. o 다른 예에서, UE는 CSI 피드백을 생성/보고하기 위해 (SD, FD 및/또는 TD/DD)에 걸친 공동 기반(joint basis)을 권장할 수 있다. 이 권장은 공간-시간-주파수 채널의 통계적 속성에 대한 UE의 관찰에 기반할 수 있다. 일 예에서, (SD, FD 및/또는 TD/DD)에 걸친 공동 기반에 대한 옵션은 미리 정의된 세트에 포함될 수 있으 며, UE는 해당 세트에서 이러한 옵션 중 하나에 대한 권장된 인덱스를 시그널링할 수 있다. 도 21a는 본 개시의 실시예에 따라 UE 지원 정보 보고를 위한 새로운 MAC CE의 예를 도시한다. 도 21a에 도시된 UE 지원 정보 보고를 위한 새로운 MAC CE의 예의 실시예는 단지 예시를 위한 것이다. 도 21a는 본 개시의 범위를 UE 지원 정보 보고를 위한 새로운 MAC CE의 예의 특정 구현으로 제한하지 않는다. 도 21a는 UE 지원 정보 보고를 위한 새로운 MAC CE의 예를 도시하며, 여기서 블록 오류율, UE 처리량, 추정된 코히어런스 시간 및 추정된 코히어런스 대역폭 필드는 각각 8비트 길이를 갖는다. 권장된 비트맵, 권장된 빔 및 권장된 계층 필드는 각각 7비트 길이를 갖는다. 도 21b는 본 개시의 실시예에 따라 BS에서 UE 지원 정보 보고로의 응답을 위한 새로운 MAC CE의 예를 도 시한다. 도 21b에 도시된 바와 같이 BS에서 UE 지원 정보 보고로의 응답을 위한 새로운 MAC CE의 예의 실 시예는 단지 예시를 위한 것이다. 도 21b는 본 개시의 범위를 BS에서 UE 지원 정보 보고로의 응답을 위한 새로 운 MAC CE의 예의 특정 구현으로 제한하지 않는다. 도 21b는 BS에서 UE 지원 정보 보고로의 응답을 위한 새로운 MAC CE의 예를 도시하며, 여기서 선택된 비트맵 (Selected Bitmap), 선택된 빔(Selected Beam) 및 선택된 계층(Selected Layer) 필드는 각각 7비트 길이를 갖 는다. 일 실시예에서, 기존 CSI 폴백 요청에 대해 새로운 MAC CE가 정의될 수 있다. 이 MAC CE는 [3]의 표 6.2.1-2에 명시될 수 있는 논리적 채널 ID를 갖는 MAC 서브헤더에 의해 식별될 수 있다. 이 MAC CE는 가변적인 크기를 가 질 수 있으며, 다음의 필드로 구성될 수 있다. 기존 CB 폴백: 이 필드는 다음의 정보 중 하나 이상을 포함할 수 있다: o CSI 피드백을 생성/보고하기 위한 권장된 비트맵의 디스에이블링 지시자, 예를 들어, 계수 매트릭스의 열 세 트, 및 o 기존 코드북에 대한 파라미터 표에 대한 요청된 인덱스 지시자 (예를 들어, [4]의 표 5.2.2.2.5-1에 있는 paramCombination-r16). 예를 들어, 각각의 CSI-ResourceConfig에 대해 하나의 코드북이 설정된 경우, 기존 CB 폴백 필드는 특정 CSI- ResourceConfig에 대한 기존 코드북의 ID를 포함할 수 있다. 다른 예에서, 각각의 CORESET 풀에 대해 하나의 코 드북이 설정된 경우, 기존 CB 폴백 필드는 특정 CORESET 풀에 대한 기존 코드북의 ID를 포함할 수 있다. 도 22는 본 개시의 실시예에 따라 CSI 설정 권장자를 지원하기 위한 AI/ML 모델 아키텍처의 예를 도시한 다. 도 22에 도시된 CSI 설정 권장자를 지원하기 위한 AI/ML 모델 아키텍처의 예의 실시예는 단지 예시를 위한 것이다. 도 22는 본 개시의 범위를 CSI 설정 권장자를 지원하기 위한 AI/ML 모델 아키텍처의 예의 특정 구현으로 제한하지 않는다. 도 22는 CSI 설정 권장자의 트레이닝/추론을 지원할 수 있는 AI/ML 모델 아키텍처의 예를 도시한다. 이 예에서 표준 CNN은 보조 정보로 증강될 수 있으며; 보조 정보의 예는 아래에 포함된다. 각각의 슬롯에서, 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원(Rx 차원 수 × Tx 차원 수) 채널은 이 AI/ML 모델 아키텍처에 대한 입력으로서 제공되며, 여기서 CSI-RS를 포함하지 않는 모든 RE는 0으로 채워진다. 기존 코드북의 서브타입에 대한 트레이닝/추론을 지원할 수 있는 AI/ML 모델에 대한 입력의 예는 다음의 것을 포함한다: 하나의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 수신 채널, o CSI-RS를 포함하지 않는 모든 RE는 0으로 채워지고, 하나의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 채널의 지상 실측 정보, o 예를 들어, 이는 이상적인 채널 추정을 통해 획득될 수 있고, o 다른 예에서, 이는 현실적인 채널 추정 방법(예를 들어, LS, LMMSE)을 통해 획득될 수 있고, o 이는 트레이닝 레이블(label)일 수 있고, 보조 정보, o UE 속도, o UE 가속/감속, o UE 궤적, o UE 위치, o 코히어런스 시간, o 코히어런스 대역폭, o 지연 확산, o 도플러 확산, o 블록 오류율, o 처리량. CSI 설정 권장자에 대한 트레이닝/추론을 지원할 수 있는 AI/ML 모델로부터의 출력 예는 다음의 것을 포함한다: SD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), FD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반),DD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), SD 빔 또는 기반 벡터의 수, FD 빔 또는 기반 벡터의 수, TD 또는 DD 빔 또는 기반 벡터의 수, 2개 또는 3개(SD, FD, TD/DD)에 걸친 별개의 SD/FD/TD/DD 기반 또는 공동 기반인지 여부, 0이 아닌 계수의 비트맵 또는 0이 아닌 계수의 수, 계수 위상에 대한 PSK 알파벳의 크기, 계수 진폭 코드북의 해상도 또는 크기(비트의 수), 계층의 수(랭크 값) 또는 최대 계층의 수(또는 최대 랭크 값). 다른 실시예에서, \"AI/ML 기반 CSI 피드백/보고\"는 CSI 피드백을 생성/보고할 때 하나의 CSI 관찰을 처리하고, 이 CSI 피드백은 해당 CSI 관찰에 상응한다. \"AI/ML 기반 다중 시간 CSI 피드백/보고\"라는 용어는 PMI에 의해 열거된 프리코딩 벡터/매트릭스의 고정/미리 결정된 코드북을 활용하는 기존 CSI와 상이한 CSI 보고를 생성하는 방법을 나타내는 데 사용된다. \"AI/ML 기반 다중 시간 CSI 피드백/보고\" 방법은 \"AI/ML 기반 CSI 피드백/보고\" 방법에 의해 활용될 수 있는 상술한 머신, 자동 인코더 및 신경망을 활용할 수 있다. \"AI/ML 기반 다중 시간 CSI 피드백/보고\"는 1) CSI 피드백을 생성/보고할 때 다수의 CSI 관찰을 처리하거나, 2) 하나 이상의 향후 CSI 관찰에 상응하는 CSI 피드백을 생성/보고하거나, 3) 과 둘 다를 지원한다. 동일한 방법을 지칭하는 다른 용어가 또한 사용될 수 있다. 도 23은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 23에 도시된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것 이다. 도 23는 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 23에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 다중 시 간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작 에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파 라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 AI/ML 기 반 CSI 피드백 설정 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 기반하여 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 UE로부터 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 메시지를 수신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사 용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므 로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, BS는 AI/ML 기반 다중 시간 피드백/보고 방법에 따라 생성된 CSI 보고를 UE로부터 수신한다. 다른 예에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정 할 수 있다. 이 경우, 동작이 수행될 필요가 없고; BS는 동작에서 미리 결정/설정된 시간에 UE로부 터 AI/ML 기반 다중 시간 CSI 보고를 수신할 수 있다. 다른 예에서, 동작과 동작 사이에서, BS는 동작을 수행할 수 있다. 동작에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 ACK/NACK을 UE로 송신할 수 있다. BS가 ACK를 송신하면, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하고; BS는 동작에서 UE로부터 AI/ML 기반 다중 시간 CSI 보고를 수신한다. BS가 NACK를 송신하면,BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신한다. 동작에서, 다른 예에서, BS는 AI/ML 기 반 다중 시간 CSI 피드백/보고 방법에 대한 설정 메시지를 UE로 송신할 수 있다. 다른 예에서, BS는 동작에서 UE에 대한 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(2310, 2311 및 2312)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스에이블되면, BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 계속 수신한다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북(5.2.2.2.1/2, [4] 참조) 또는 Type II 코드북 (5.2.2.2.3/4/5/6/7, [4] 참조)을 기반으로 하는 CSI 피드백에 상응할 수 있다. 도 24는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 24에 도시된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것 이다. 도 24는 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 24에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 다중 시간 CSI 피드백을 생성/보고하기 위 한 ML 접근 방식의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 동작에서, UE 는 BS로부터 설정 정보를 수신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인 에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데 이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 AI/ML 기반 CSI 피드백 설정 메시지를 수신한다. 동작에서, UE는 AI/ML 기반 CSI 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 동작에서, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나 타내는 메시지를 BS로 송신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으 며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므로 CSI 피드백 과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, UE는 AI/ML 기반 다중 시간 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 다른 예에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정 할 수 있다. 이 경우, 동작이 수행될 필요가 없고; UE는 동작에서 미리 결정/설정된 시간에 AI/ML 기반 다중 시간 CSI 보고를 BS로 송신할 수 있다. 다른 예에서, 동작과 동작 사이에서, UE는 동작을 수행할 수 있다. 동작에서, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 BS로 부터 ACK/NACK을 수신할 수 있다. UE가 ACK를 수신하면, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하고; UE는 동작에서 AI/ML 기반 다중 시간 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신한다. 동작에서, 다른 예에서, UE는 BS로부터 AI/ML 기 반 다중 시간 CSI 피드백/보고 방법에 대한 설정 메시지를 수신할 수 있다. 다른 예에서, UE는 동작에서 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신하 기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(2410, 2411 및 2412)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스에이블되면, UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 계속 송신한다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 도 25는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 전 환을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 25에 도시된 AI/ML 기반 다중 시간 CSI 피드백/보고로의 BS 개시 또는 BS 제어 전환을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 25은 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개 시 또는 BS 제어 전환을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않는다. 도 25에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 다중 시 간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작 에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라 미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 AI/ML 기반 CSI 피드백 설정 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 UE로부터 지원 정보를 수신하고; 이 지원 정보는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 위한 권장을 포함할 수 있으며, 이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹션에 설명될 것이다. 동작에서, BS는 AI/ML 기반 다중 시간 CSI 피드백 설정 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 다중 시간 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로 부터 수신한다. 다른 예에서, BS는 동작에서 UE에 대한 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 도 26은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 전 환을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 26에 도시된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 전환을 지원하기 위한 UE에서의 예시적인 동작 방법의 실 시예는 단지 예시를 위한 것이다. 도 26는 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 전환을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구현으로 제한하지 않 는다. 도 26에 도시된 바와 같이, 방법은 UE(예를 들어, UE)가 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 능력 정보를 BS에 보고하는 동작에서 시작한다. 동작에서, UE는 BS로 부터 설정 정보를 수신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/ 디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 AI/ML 기반 CSI 피 드백 설정 메시지를 수신한다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 동작에서, UE는 지원 정보를 BS로 송신하고; 이 지원 정보는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 위한 권장을 포함할 수 있으며, 이는 본 개시의 후반부에서 \"UE 지원 정보\" 섹 션에 설명될 것이다. 동작에서, UE는 BS로부터 AI/ML 기반 다중 시간 CSI 피드백 설정 메시지를 수신한다. 동작에서, UE는 AI/ML 기반 다중 시간 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신 한다. 다른 예에서, UE는 동작에서 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신하 기 시작할 수 있다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 도 27은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 27에 도시 된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 27은 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드 백/보고 방법으로부터의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현으로 제 한하지 않는다. 도 27에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS)는 다중 시 간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작 에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라 미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 AI/ML 기반 CSI 피드백 설정 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 UE로부터 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으 로의 전환을 나타내는 메시지를 수신한다. 일 예에서, 전용/새로운 MAC CE는 이러한 메시지에 사용될 수 있거나, 기존 MAC CE는 이러한 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사 용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이러한 지시자는 UCI의 일부로서 포함될 수 있으므 로 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, BS는 AI/ML 기반 다중 시간 피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 UE로부터 AI/ML 기반 CSI 피드백/보고 방법으로 폴백하라는 요청에 상응하는 메시지를 수신하며, 이는 본 개시 의 후반부에서 \" AI/ML 기반 CSI 폴백 요청\" 섹션에 설명될 것이다. 동작에서, BS는 AI/ML 기반 CSI 피드 백 설정 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고 를 UE로부터 수신한다. 다른 예에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정 할 수 있다. 이 경우, 동작이 수행될 필요가 없고; BS는 동작에서 미리 결정/설정된 시간에 UE로부 터 AI/ML 기반 다중 시간 CSI 보고를 수신할 수 있다. 다른 예에서, 동작과 동작 사이에서, BS는 동작을 수행할 수 있다. 동작에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 ACK/NACK을 UE로 송신할 수 있다. BS가 ACK를 송신하면, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하고; BS는 동작에서 UE로부터 AI/ML 기반 다중 시간 CSI 보고를 수신한다. BS가 NACK를 송신하면, BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신한다. 동작에서, 다른 예에서, BS는 AI/ML 기 반 다중 시간 CSI 피드백/보고 방법에 대한 설정 메시지를 UE로 송신할 수 있다. 다른 예에서, BS는 동작에서 UE에 대한 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없으며; BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어, RRC 설정을 통해 동작(2710, 2711 및 2712)을 인에이블/디스에이블할 수 있다. 이러한 동작이 디스에이블되면, BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 계속 수신한다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 도 28는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 28에 도시 된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 28은 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/ 보고 방법으로부터 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구현으로 제한하 지 않는다. 도 28에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 UE(예를 들어, UE)는 다중 시 간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 능력 정보를 BS에 보고한다. 동작 에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방 식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 AI/ML 기반 CSI 피드백 설정 메시지를 수신한다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생 성된 CSI 보고를 BS로 송신한다. 동작에서, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 을 나타내는 메시지를 BS로 송신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나, 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 대해 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으며, 따라서 CSI 피드 백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, UE는 AI/ML 기반 다 중 시간 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 동작에서 UE는 AI/ML 기반 CSI 피드 백/보고 방법으로 폴백하라는 요청에 상응하는 메시지를 BS로 송신하며, 이는 본 개시의 후반부에서 \"AI/ML 기 반 CSI 폴백 요청\" 섹션에 설명될 것이다. 동작에서, UE는 BS로부터 AI/ML 기반 CSI 피드백 설정 메시지 를 수신한다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 다른 예에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정 할 수 있다. 이 경우, 동작은 수행될 필요가 없고; UE는 동작에서 미리 결정/설정된 시간에 AI/ML 기반 다중 시간 CSI 보고를 BS로 송신할 수 있다. 다른 예에서, 동작과 동작 사이에서, UE는 동작을 수행할 수 있다. 동작에서, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 BS로 부터 ACK/NACK를 수신할 수 있다. UE가 ACK를 수신하면, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하며; UE는 동작에서 AI/ML 기반 다중 시간 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신한다. 동작에서, 다른 예에서, UE는 BS로부터 AI/ML 기 반 다중 시간 CSI 피드백/보고 방법에 대한 설정 메시지를 수신할 수 있다. 다른 예에서, UE는 동작에서 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없고; UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(2810, 2811 및 2812)을 인에이블/디스에이블할 수 있다. 이 러한 동작이 불가능해지는 경우, UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 계속 송신한다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 도 29는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 29에 도시된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/보고 방법으로 BS 개시 또는 BS 제어 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것 이다. 도 29는 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법의 특정 구현 으로 제한하지 않는다. 도 29에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 BS(예를 들어, BS는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 UE 능력 정보를 UE로부터 수신한다. 동작 에서, BS는 설정 정보를 UE로 송신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라 미터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, BS는 AI/ML 기반 CSI 피드백 설정 메시지를 UE로 송신한다. 동작에서, BS는 UE로부터 AI/ML 기반 피드백/보고 방법에 의해 생성된 CSI 보고를 수신한다. 동작에서, BS는 UE로부터 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 의 전환을 나타내는 메시지를 수신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나, 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로 포함될 수 있으며, 따라서 CSI 피드백과 함 께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, BS는 AI/ML 기반 다중 시간피드백/보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 동작에서, BS는 AI/ML 기반 CSI 피드백/ 보고 방법으로 폴백하라는 명령에 상응하는 메시지를 UE로 송신한다. 동작에서, BS는 AI/ML 기반 피드백/ 보고 방법에 의해 생성된 CSI 보고를 UE로부터 수신한다. 다른 예에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정 할 수 있다. 이 경우, 동작은 수행될 필요가 없고; BS는 동작에서 미리 결정/설정된 시간에 UE로부 터 AI/ML 기반 다중 시간 CSI 보고를 수신할 수 있다. 다른 예에서, 동작과 동작 사이에서, BS는 동작을 수행할 수 있다. 동작에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 ACK/NACK를 UE로 송신할 수 있다. BS가 ACK를 송신하는 경우, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법 으로 전환하고; BS는 동작에서 UE로부터 AI/ML 기반 다중 시간 CSI 보고를 수신한다. BS가 NACK를 송신하 는 경우, BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수신한다. 동작에서, 다른 예에서, BS는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법에 대한 설정 메시지를 UE로 송신할 수 있다. 다른 예에서, BS는 동작에서 UE에 대한 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 포함할 수 있다. 이 경우, 동작은 수행될 필요가 없고; BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 수 신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(2910, 2911 및 2912)을 인에이블/디스에이블할 수 있다. 이 러한 동작이 불가능해지는 경우, BS는 동작에서 UE로부터 AI/ML 기반 CSI 보고를 계속 수신한다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 도 30은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 30에 도시된 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 실시예는 단지 예시를 위한 것이다. 도 30)은 본 개시의 범위를 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드 백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법의 특정 구 현으로 제한하지 않는다. 도 30에 도시된 바와 같이, 방법은 동작에서 시작하며, 여기서 UE(예를 들어, UE)는 다중 시 간 CSI 피드백을 생성/보고하기 위한 ML 접근 방식의 지원을 포함하는 능력 정보를 BS에 보고한다. 동작 에서, UE는 BS로부터 설정 정보를 수신하며, 이 정보는 다중 시간 CSI 피드백을 생성/보고하기 위한 ML 접근 방 식의 인에이블/디스에이블, 사용될 ML 모델, 트레이닝된 모델 파라미터, 및/또는 UE에 의해 보고된 모델 파라미 터 업데이트가 사용될지 여부와 같은 ML 관련 설정 정보를 포함할 수 있다. 동작에서, UE는 BS로부터 AI/ML 기반 CSI 피드백 설정 메시지를 수신한다. 동작에서, UE는 AI/ML 기반 피드백/보고 방법에 의해 생 성된 CSI 보고를 BS로 송신한다. 동작에서, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환 을 나타내는 메시지를 BS로 송신한다. 일 예에서, 전용/새로운 MAC CE가 이 메시지에 사용될 수 있거나, 기존 MAC CE가 이 메시지에 사용될 수 있다. 다른 예에서, 이 메시지는 PUCCH 또는 PUSCH 상에서 송신될 수 있으며, 여기서 새로운 UCI 포맷이 이 메시지에 정의될 수 있거나, 기존 UCI 포맷이 이 메시지에 사용될 수 있다. 기존 UCI 포맷이 이 메시지에 사용되는 경우, 이 지시자는 UCI의 일부로서 포함될 수 있으며, 따라서 CSI 피드백과 함께 예를 들어, CSI 보고에서의 1비트 지시자로서 보고될 수 있다. 동작에서, UE는 AI/ML 기반 다중 시 간 피드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 동작에서, UE는 AI/ML 기반 CSI 피드백/ 보고 방법으로 폴백하라는 명령에 상응하는 메시지를 BS로부터 수신한다. 동작에서, UE는 AI/ML 기반 피 드백/보고 방법에 의해 생성된 CSI 보고를 BS로 송신한다. 다른 예에서, BS는 AI/ML 기반 CSI 피드백/보고 방법으로의 전환 시간에 대한 정보를 미리 결정/설정할 수 있다. 이 경우, 동작은 수행될 필요가 없고; UE는 동작에서 미리 결정/설정된 시간에 AI/ML 기반 CSI 보고를 BS로 송신할 수 있다. 다른 예에서, 동작과 동작 사이에서, UE는 동작을 수행할 수 있다. 동작에서, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 전환을 나타내는 UE로부터의 수신된 메시지에 응답하여 BS로부터 ACK/NACK를 수신할 수 있다. UE가 ACK를 수신하면, UE는 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하고; UE는 동작에서 AI/ML 기반 다중 시간 CSI 보고를 BS로 송신한다. UE가 NACK를 수신하면, UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신한다. 동작에서, 다른 예에서, UE는 BS로부터 AI/ML 기 반 다중 시간 CSI 피드백/보고 방법에 대한 설정 메시지를 수신할 수 있다. 다른 예에서, UE는 동작에서 BS로부터 AI/ML 기반 CSI 피드백/보고 방법에 관한 설정 메시지를 수신할 수 있다. 이 경우, 동작은 수행될 필요가 없고; UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 송신하기 시작할 수 있다. 다른 예에서, BS는 예를 들어 RRC 설정을 통해 동작(3010, 3011 및 3012)을 인에이블/디스에이블할 수 있다. 이 러한 동작이 불가능해지는 경우, UE는 동작에서 AI/ML 기반 CSI 보고를 BS로 계속 송신한다. 다른 예에서, AI/ML 기반 CSI 피드백/보고 방법은 이전 예에서 기존 CSI 피드백/보고 방법으로 대체될 수 있다. 일 예에서, 이 기존 CSI 피드백/보고 방법은 Type I 코드북 또는 Type II 코드북에 기반한 CSI 피드백에 상응할 수 있다. 일 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하는 지시자를 송신 하도록 UE를 설정할 수 있다. 표 12는 이 전환 지시자를 송신하도록 UE를 설정하기 위해 IE PUSCH-Config를 수 정하는 예이다. 이 예에서, multTimeMLCBSwitch는, 있는 경우, 이 전환 지시자에 상응한다. 다른 예에서, IE PUCCH-Config는 이 전환 지시자를 송신하도록 UE를 설정하기 위해 수정될 수 있다. [표 12]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "일 실시예에서, BS는 MAC CE 활성화 명령을 통해 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하는 지 시자를 송신하도록 UE를 설정할 수 있다. 일 실시예에서, BS는 DCI를 통해 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로 전환하는 지시자를 송신하도 록 UE를 설정할 수 있다. 다른 실시예에서, BS는 PDCCH 주문을 통해 AI/ML 기반 다중 시간 CSI 피드백/보고 방법을 사용하도록 UE를 설정 할 수 있으며, 여기서 새로운 DCI 포맷이 정의될 수 있고, 이 PDCCH 주문은 이 새로운 DCI 포맷에 의해 트리거 될 수 있다. 다른 예에서, BS는 MAC CE 활성화 명령을 통해 AI/ML 기반 다중 시간 CSI 피드백/보고 방법을 사용하도록 UE를 설정할 수 있다. 다른 예에서, BS는 RRC 설정을 통해 AI/ML 기반 다중 시간 CSI 피드백/보고 방법을 사용하도록 UE를 설정할 수 있다. 표 13은 다중 시간 CSI 피드백을 생성/보고하기 위해 AI/ML 기반 코드북을 사용하도록 UE를 설정하기 위 해 IE CodebookConfig를 수정하는 예이다. CodebookConfig의 경우, enabledCodebooks는, 있는 경우, 어떤 AI/ML 기반 코드북이 인에이블되는지를 결정하고; switchSlot은, 있는 경우, 이러한 AI/ML 기반 코드북이 인에 이블되는 슬롯 세트를 결정한다. csi-ResourceConfigId는, 있는 경우, 이러한 AI/ML 기반 코드북의 ID에 상응한 다. NumInpCSI는, 있는 경우, 이러한 AI/ML 기반 코드북에 의해 처리되어야 하는 과거 CSI 인스턴스의 수에 상 응한다. numOutCSI는, 있는 경우, 이러한 AI/ML 기반 코드북에 의해 출력되어야 하는 현재/미래 CSI 인스턴스의 수에 상응한다. 일 예에서, 각각의 CSI-ResourceConfig(csi-ResourceConfigId에 상응하는 엔트리를 가짐)에 대 해 하나의 AI/ML 기반 코드북이 정의된다. 다른 예에서, 모든 CSI-ResourceConfig에 대해 하나의 AI/ML 기반 코 드북이 정의된다(여기서 각각의 CSI-ResourceConfig는 csi-ResourceConfigId에 엔트리를 가짐).[표 13]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "일 예에서, numInpCSI 및/또는 numOutCSI는 비주기적, 반영구적 또는 주기적으로서 설정될 수 있다. 이는 시간 가변(time-varying) 채널 통계에 대한 적응을 용이하게 할 수 있다. 각각의 CSI-ResourceConfig에 대해 하나의 AI/ML 기반 코드북이 정의되면, 이는 주파수 가변(frequency-varying) 채널 통계에 대한 적응을 용이하게 할 수 있다. 일 예에서, numInpCSI 및/또는 numOutCSI는 상수로서 명시될 수 있다. 다른 예에서, numInpCSI 및/또는 numOutCSI는 값 세트(예를 들어, 세트의 모든 값, (시작 값, 종료 값, 차이 값)과 같은 3-튜플(tuple) 등)로서 명시될 수 있다. numInpCSI 및/또는 numOutCSI가 값 세트로서 명시되는 경우, UE는 해당 세트로부터 값을 선택 하여 보고하도록 설정될 수 있다. gNB는 또한 해당 세트로부터의 값을 비주기적, 반영구적 또는 주기적으로서 설정할 수 있다. 일 예에서, UE는 해당 세트의 값을 순환할 수 있으며, 여기서 각각의 값에 대한 주기는 gNB에 의해 설정된다. 다른 예에서, numInpCSI 및/또는 numOutCSI는 슬롯 인덱스 또는 슬롯 인덱스 세트로서 명시될 수 있다. 다른 예에서, 모든 CSI-ResourceConfig 세트는 분리된 서브세트로 분할될 수 있고, 하나의 AI/ML 기반 코드북은 이러한 서브세트 중 하나에 매핑될 수 있다. 이러한 분할은 비주기적, 반영구적 또는 주기적으로서 설정될 수 있다. (n1, n2)는 제1(n1) 및 제2(n2) 차원의 안테나 포트의 수를 나타낸다고 한다. 일 예에서, (n1, n2)의 각각의 지 원된 조합에 대해 하나의 AI/ML 기반 코드북이 정의될 수 있다. 다른 예에서, (n1, n2)의 모든 지원된 조합에 대해 하나의 AI/ML 기반 코드북이 정의될 수 있으며, 여기서 이러한 AI/ML 기반 코드북에 대한 입력 상에서 적 절한 전처리가 수행될 수 있다. CodebookConfig IE는 또한 다중 TRP 시스템에서 다중 시간 CSI 피드백을 생성/보고하기 위해 AI/ML 기반 코드북 을 사용하도록 UE를 설정하기 위해 수정될 수 있으며, 여기서 UE는 다수의 TRP로부터 DL 수신을 수신하거나 UL 송신을 다수의 TRP로 송신할 수 있다. 일 예에서, TRP는 NZP CSI-RS 자원 또는 CSI-RS 자원 세트 또는 안테나포트 그룹과 기능적으로 동등하다(또는 이에 상응한다). 일 예에서, 각각의 TRP에 대해 하나의 AI/ML 기반 코드 북이 정의된다(여기서 각각의 TRP는 특정 CORESET 풀에 속할 수 있고; 각각의 코드북은 상응하는 CORESET 풀 ID 를 가질 수 있음). 다른 예에서, 모든 TRP에 대해 하나의 AI/ML 기반 코드북이 정의된다(여기서 각각의 TRP에 대한 CORESET 풀 ID는 이 코드북에 매핑됨). 다른 실시예에서, BS는 RRC 설정을 통해 코드북의 AI/ML 기반 다중 시간 CSI 구성 요소를 사용하도록 UE를 설정 할 수 있다. 일 예에서, 코드북은 AI/ML 기반 다중 시간 CSI 구성 요소와 기존 코드북 구성 요소를 포함할 수 있다. 표 14는 다중 시간 CSI 피드백을 생성/보고하기 위해 기존 코드북의 AI/ML 기반 구성 요소를 사용하도록 UE를 설정하기 위해 IE CodebookConfig를 수정하는 예이다. typeII-AI-r16은 Type II 코드북에 상응하는 type2 의 AI/ML 기반 구성 요소에 상응한다. typeII-AI-r16이 인에이블되는 경우, 특정 입력이 주어지면 AI/ML 기반 방법을 사용하여 Type II 코드북의 출력을 결정한다. 일 예에서, 기존 코드북의 AI/ML 기반 구성 요소는 SD 빔 의 수를 학습하고 SD 빔 그룹 선택을 수행하도록 설정될 수 있고; 이는 또한 FD 빔의 수를 학습하고 FD 빔 그룹 선택을 수행하도록 설정될 수 있다. 다른 예에서, 기존 코드북의 AI/ML 기반 구성 요소는 SD/FD 빔의 수를 공동 으로 학습하고 SD/FD 빔 그룹 선택을 수행하도록 설정될 수 있다. 기존 코드북의 AI/ML 기반 구성 요소는 또한 SD 및 FD 빔의 선형 조합을 계산하기 위한 0이 아닌 계수의 수를 학습하도록 설정될 수 있다. 기존 코드북의 AI/ML 기반 구성 요소는 또한 PSK 알파벳(예를 들어, QPSK 또는 8-PSK)의 크기를 학습하도록 설정될 수 있다. numOutCSI는 이 기존 코드북에 의해 출력되는 현재/미래 CSI 인스턴스의 수에 상응하고; numOutCSI가 1보다 큰 경우, 미래 CSI 보고가 지원된다. [표 14]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "일 예에서, 각각의 CSI-ResourceConfig에 대해, 다음의 옵션, 즉. 1) 기존 코드북(예를 들어, 기존 구성 요소, 미래 CSI 보고를 지원하는 AI 기반 구성 요소), 2) CSI 피드백을 생성/보고하는 AI/ML 기반 코드북, 또는 3) 다 중 시간 CSI 피드백을 생성/보고하는 AI/ML 기반 코드북 중 하나가 설정될 수 있다. 이 설정은 주기적, 반영구 적 또는 비주기적일 수 있다.다른 예에서, 각각의 CSI-ResourceConfig에 대해, 기존 코드북 또는 CSI 피드백을 생성/보고하는 AI/ML 기반 코 드북이 설정된 경우, 다음의 옵션, 즉, 1) 기존 CSI 예측자(predictor) 또는 2) AI/ML 기반 CSI 예측자 중 하 나가 부가적으로 설정될 수 있다. 이 설정된 예측자의 출력은 이 설정된 코드북에 입력될 수 있다. 이 예측자는 주기적, 반영구적 또는 비주기적으로서 설정될 수 있다. 표 15는 AI/ML 기반 CSI 예측자를 사용하도록 UE를 설 정하기 위해 IE CSI-ReportConfig를 수정하는 예이다. MlAlgParams는, 있는 경우, 다른 UE로부터 트레이닝된 AI/ML 기반 CSI 예측자에 대한 파라미터를 포함할 수 있다. [표 15]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "다른 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 다중 시간 CSI 피드백을 생성할 때 CQI를 포함하도록 UE를 설정할 수 있다. 표 16은 다중 시간 CSI 피드백을 생성/보고할 때 CQI를 포함하는 AI/ML 기반 코드북을 설정하 기 위해 IE CodebookConfig를 수정하는 예이다. CodebookConfig의 경우, encodeInpCQI는, 있는 경우, 다중 시 간 CSI 피드백이 생성될 때 과거 CSI에 대한 CQI가 포함되어야 하는지를 결정한다. 일 예에서, 과거 CSI의 서브 세트가 설정될 수 있으며, 여기서 해당 서브세트의 과거 CSI에 대한 CQI는 다중 시간 CSI 피드백이 생성될 때 포함되어야 한다. EncodeOutCQI는, 있는 경우, 다중 시간 CSI 피드백이 생성될 때 현재/미래 CSI에 대한 CQI가 포함되어야 하는지를 결정한다. 일 예에서, 현재/미래 CSI의 서브세트가 설정될 수 있으며, 여기서 해당 서브세 트의 현재/미래 CSI에 대한 CQI는 다중 시간 CSI 피드백이 생성될 때 포함되어야 한다.[표 16]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "다른 실시예에서, BS는 RRC 설정을 통해 AI/ML 기반 코드북을 학습하도록 UE를 설정할 수 있다. 표 17은 AI/ML 기반 코드북의 트레이닝을 설정하기 위해 IE PDSCH-ServingCellConfig를 수정하는 예이다. PDSCH- ServingCellConfig의 경우, NumInpCSI(AI/ML 기반 코드북에 의해 처리되어야 하는 과거 CSI 인스턴스의 수에 상응함) 및 NumOutCSI(AI/ML 기반 코드북에 의해 출력되어야 하는 현재/미래 CSI 인스턴스의 수에 상응함)는 AI 기반 코드북을 트레이닝한 다른 UE에 대한 트레이닝된 값을 포함할 수 있다. 이러한 트레이닝된 값은 AI/ML 기 반 코드북을 트레이닝하는 데 이러한 UE를 도울 수 있다. NumInpCSI 및 NumOutCSI의 정보는 상응하는 코드북에 대한 ID, 예를 들어 상응하는 CSI-ResourceConfig의 ID, 상응하는 CORESET 풀의 ID 등으로 태그될 수 있다. [표 17]"}
{"patent_id": "10-2024-7039361", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "일 실시예에서, AI/ML 기반 CSI 폴백 요청에 대해 새로운 MAC CE가 정의될 수 있다. 이 MAC CE는 [3]의 표 6.2.1-2에 명시될 수 있는 논리 채널 ID를 가진 MAC 서브헤더에 의해 식별될 수 있다. 이 MAC CE는 가변 크기를 가질 수 있고, 다음의 필드로 구성될 수 있다: AI 기반 CB 폴백: 이 필드는 다음의 정보: o AI/ML 기반 코드북 타입(여기서 이 코드북은 다중 시간 CSI 피드백을 생성/보고하지 않음), 및 o 기존 코드북 서브타입, 예를 들어, 기존 코드북의 AI/ML 기반 구성 요소(여기서 이 구성 요소는 다중 시간 CSI 피드백을 생성/보고하지 않음) 중 하나 이상을 포함할 수 있다. 예를 들어, 각각의 CSI-ResourceConfig에 대해 하나의 AI/ML 기반 코드북이 설정된 경우, AI 기반 CB 폴백 필드 는 특정 CSI-ResourceConfig에 대한 AI/ML 기반 코드북의 ID를 포함할 수 있다. 다른 예에서, 각각의 CORESET 풀에 대해 하나의 코드북이 설정된 경우, AI 기반 CB Fallback 필드는 특정 CORESET 풀에 대한 AI/ML 기반 코드 북의 ID를 포함할 수 있다. 도 31은 본 개시의 실시예에 따른 AI/ML 기반 CSI 폴백 요청에 대한 새로운 MAC CE의 예를 도시한다. 도 31에 도시된 AI/ML 기반 CSI 폴백 요청에 대한 새로운 MAC CE의 예의 실시예는 단지 예시를 위한 것이다. 도 31은 본 개시의 범위를 AI/ML 기반 CSI 폴백 요청에 대한 새로운 MAC CE의 예의 특정 구현으로 제한하 지 않는다. 도 31은 AI/ML 기반 CSI 폴백 요청에 대한 새로운 MAC CE의 예를 도시하며, 여기서 AI 기반 CB 폴백 필드는 8비 트 길이를 갖는다. 다른 예에서, 새로운 MAC CE는 (AI/ML 기반 코드북을 통과하여) 기존 코드북으로 직접 폴백하는 요청에 대해 정 의될 수 있다. 도 32는 본 개시의 실시예에 따라 기존 코드북의 서브타입을 지원하는 AI/ML 모델 아키텍처의 예를 도시 한다. 도 32에 도시된 기존 코드북의 서브타입을 지원하는 AI/ML 모델 아키텍처의 예의 실시예는 단지 예 시를 위한 것이다. 도 32는 본 개시의 범위를 기존 코드북의 서브타입을 지원하는 AI/ML 모델 아키텍처의 예 의 특정 구현으로 제한하지 않는다. 도 32는 (다중 시간 CSI 피드백을 생성/보고할 수 있는) 기존 코드북의 서브타입의 트레이닝/추론을 지원할 수 있는 AI/ML 모델 아키텍처의 예를 도시한다. 이 예에서 표준 CNN은 보조 정보로 증강될 수 있으며; 보조 정보의 예는 아래에 포함되어 있다. 각각의 슬롯에서, 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원(Rx 차원 수 × Tx 차원 수) 채널은 이 AI/ML 모델 아키텍처에 대한 입력으로서 제공되며, 여기서 CSI-RS를 포함하지 않는 모든 RE는 0으로 채워진다. 기존 코드북의 서브타입에 대한 트레이닝/추론을 지원할 수 있는 AI/ML 모델에 대한 입력의 예는 다음의 것을 포함한다: 하나 이상의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 수신 채널, o CSI-RS를 포함하지 않는 모든 RE는 0으로 채워지고, o 이 입력이 둘 이상의 슬롯에 대한 CSI를 포함하는 경우, 시간 도메인 압축은 지원되며, o 하나 이상의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 채널의 지상 실측 정보, o 예를 들어, 이는 이상적인 채널 추정을 통해 획득될 수 있고, o 다른 예에서, 이는 현실적인 채널 추정 방법(예를 들어, LS, LMMSE)을 통해 획득될 수 있고, o 이는 트레이닝 레이블일 수 있고, 보조 정보, o UE 속도, o UE 가속/감속, o UE 궤적, o UE 위치, o 코히어런스 시간, o 코히어런스 대역폭, o 지연 확산, o 도플러 확산, o 블록 오류율, o 처리량. 기존 코드북의 서브타입에 대한 트레이닝/추론을 지원할 수 있는 AI/ML 모델로부터의 출력 예는 다음의 것을 포 함한다: 하나 이상의 슬롯에 대한 모든 부반송파 및 OFDM 심볼에 대한 전체 2차원 추정 채널, o 이러한 슬롯 중 적어도 하나가 현재 슬롯 이후에 발생하는 경우, 채널 예측이 지원되고, 기존 코드북의 서브타입에 대한 파라미터 o 이러한 파라미터는 도 14의 아키텍처에서 \"선형\" 계층으로부터 결정될 수 있고, ■ SD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), ■ FD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), ■ DD 기반 타입(예를 들어, 직교 DFT 또는 비직교 DFT, DFT 기반의 오버샘플링/회전 계수, DCT, 아이겐/SVD 기 반), ■ SD 빔 또는 기반 벡터의 수, ■ FD 빔 또는 기반 벡터의 수, ■ TD 또는 DD 빔 또는 기반 벡터의 수, ■ 2개 또는 3개(SD, FD, TD/DD)에 걸친 별개의 SD/FD/TD/DD 기반 또는 공동 기반인지 여부. ■ 0이 아닌 계수의 수, ■ 계수 위상에 대한 PSK 알파벳의 크기, ■ 계수 진폭 코드북의 해상도 또는 크기(비트의 수), ■ 계층의 수(랭크 값) 또는 최대 계층의 수(또는 최대 랭크 값). 상술한 흐름도는 본 개시의 원리에 따라 구현될 수 있는 예시적인 방법을 도시하며, 본 명세서에서의 흐름도에 도시된 방법에 대해 다양한 변경이 이루어질 수 있다. 예를 들어, 일련의 단계로서 도시되었지만, 각각의 도면 의 다양한 단계는 중첩하거나, 병렬로 발생하거나, 상이한 순서로 발생하거나, 여러 번 발생할 수 있다. 다른 예에서, 단계는 생략되거나 다른 단계로 대체될 수 있다. 도면은 사용자 장치의 상이한 예를 예시하지만, 도면에 대한 다양한 변경이 이루어질 수 있다. 예를 들어, 사용 자 장치는 임의의 적절한 배치로 임의의 수의 각각의 구성 요소를 포함할 수 있다. 일반적으로, 도면은 본 개시 의 범위를 임의의 특정 설정으로 제한하지 않는다. 더욱이, 도면은 본 특허 문서에 개시된 다양한 사용자 장치 특징이 사용될 수 있는 동작 환경을 예시하지만, 이러한 특징은 임의의 다른 적절한 시스템에서 사용될 수 있다. 본 개시가 예시적인 실시예로 설명되었지만, 다양한 변경 및 수정이 통상의 기술자에게 제시될 수 있다. 본 개 시는 첨부된 청구항의 범주 내에 속하는 이러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원에서의 설명 은 임의의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 암시하는 것으로 해석되지 않아야 한다. 특허된 주제(patented subject matter)의 범위는 청구항에 의해 정의된다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16 도면17 도면18 도면19 도면20 도면21a 도면21b 도면22 도면23 도면24 도면25 도면26 도면27 도면28 도면29 도면30 도면31 도면32"}
{"patent_id": "10-2024-7039361", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시 및 그 이점에 대한 더욱 완전한 이해를 위해, 동일한 도면 부호가 동일한 부분을 나타내는 첨부된 도면 과 관련하여 취해진 다음의 설명에 대한 기준이 이제 이루어진다. 도 1은 본 개시의 실시예에 따른 무선 네트워크의 예를 도시한다. 도 2는 본 개시의 실시예에 따른 예시적인 gNodeB(gNB)를 도시한다. 도 3은 본 개시의 실시예에 따른 예시적인 UE를 도시한다. 도 4는 본 개시의 실시예에 따른 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환(UE-initiated switch) 을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다.도 5는 본 개시의 실시예에 따른 AI/ML 기반 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서 의 예시적인 동작 방법을 도시한다. 도 6은 본 개시의 실시예에 따른 AI/ML 기반 CSI 피드백/보고 방법으로의 BS 개시 전환을 지원하기 위한 BS에서 의 예시적인 동작 방법을 도시한다. 도 7은 본 개시의 실시예에 따른 AI/ML 기반 CSI 피드백/보고 방법으로의 BS 개시 전환을 지원하기 위한 UE에서 의 예시적인 동작 방법을 도시한다. 도 8은 본 개시의 실시예에 따른 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예 시적인 동작 방법을 도시한다. 도 9는 본 개시의 실시예에 따른 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예 시적인 동작 방법을 도시한다. 도 10은 본 개시의 실시예에 따른 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하기 위한 BS에서의 예 시적인 동작 방법을 도시한다. 도 11은 본 개시의 실시예에 따른 기존 CSI 피드백/보고 방법으로의 BS 개시 폴백을 지원하기 위한 UE에서의 예 시적인 동작 방법을 도시한다. 도 12는 본 개시의 실시예에 따른 UE 지원 정보 보고를 위한 새로운 MAC CE의 예를 도시한다. 도 13은 본 개시의 실시예에 따른 기존 CSI 폴백 보고를 위한 새로운 MAC CE의 예를 도시한다. 도 14는 본 개시의 실시예에 따라 기존 코드북의 서브타입을 지원하기 위한 AI/ML 모델 아키텍처의 예를 도시한 다. 도 15는 본 개시의 실시예에 따라 UE 지원 CSI 설정 권장(recommendation)을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 16은 본 개시의 실시예에 따라 UE 지원 CSI 설정 권장을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시 한다. 도 17은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예 시적인 동작 방법을 도시한다. 도 18은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예 시적인 동작 방법을 도시한다. 도 19는 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위 한 BS에서의 예시적인 동작 방법을 도시한다. 도 20은 본 개시의 실시예에 따라 기존 CSI 피드백/보고 방법으로의 BS-개시 또는 BS 제어 폴백을 지원하기 위 한 UE에서의 예시적인 동작 방법을 도시한다. 도 21a는 본 개시의 실시예에 따라 UE 지원 정보 보고를 위한 새로운 MAC CE의 예를 도시한다. 도 21b는 본 개시의 실시예에 따라 UE 지원 정보 보고에 대한 BS로부터의 응답을 위한 새로운 MAC CE의 예를 도 시한다. 도 22는 본 개시의 실시예에 따라 CSI 설정 권장이자(recommender)를 지원하기 위한 AI/ML 모델 아키텍처의 예 를 도시한다. 도 23은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 24는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 UE 개시 전환을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 25는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 전 환을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다.도 26은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로의 BS 개시 또는 BS 제어 전 환을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 27은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 UE 개시 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 28은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 UE 개시 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 29는 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 BS에서의 예시적인 동작 방법을 도시한다. 도 30은 본 개시의 실시예에 따라 AI/ML 기반 다중 시간 CSI 피드백/보고 방법으로부터 AI/ML 기반 CSI 피드백/ 보고 방법으로의 BS 개시 또는 BS 제어 폴백을 지원하기 위한 UE에서의 예시적인 동작 방법을 도시한다. 도 31은 본 개시의 실시예에 따른 AI/ML 기반 CSI 폴백 요청을 위한 새로운 MAC CE의 예를 도시한다. 도 32는 본 개시의 실시예에 따라 기존 코드북의 서브타입을 지원하기 위한 AI/ML 모델 아키텍처의 예를 도시한 다."}
