{"patent_id": "10-2021-0113077", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0030884", "출원번호": "10-2021-0113077", "발명의 명칭": "유휴토지 또는 폐가에 용이하게 설치할 수 있는 모듈식 숙박시설을 기반으로 하는 숙박 공유", "출원인": "백승희", "발명자": "백승희"}}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "게스트단말;통신부, 전자식도어록, 냉난방기기, 조명기기 및 마이컴을 구비하는 모듈식 숙박시설;통신망을 통해 게스트단말 및 모듈식 숙박시설과 통신하는 것으로서, 게스트단말로 예약 인터페이스를 제공하는예약관리부와, 전자식 도어록의 개폐에 필요한 도어록 보안코드를 생성하여 게스트단말과 모듈식 숙박시설로 전송하는 숙박시설관리부를 구비하는 플랫폼 서버를 포함하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 모듈식 숙박시설의 마이컴은, 상기 플랫폼 서버로부터 수신한 도어록 보안코드와 상기 게스트단말로부터획득한 도어록 보안코드가 일치한 경우에 한하여 전자식 도어록을 개방하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 모듈식 숙박시설은 홀로그램 기기를 포함하고, 상기 마이컴은 게스트 입실이 확인된 후에 홀로그램 기기를 제어하여 상기 플랫폼 서버로부터 수신한 홀로그램데이터를 홀로그램 영상으로 출력하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 모듈식 숙박시설의 마이컴은, 상기 플랫폼 서버로부터 수신한 선호환경 정보에 따라 냉난방기기 및 조명기기를 제어하여 내부의 온도, 습도 및 조도를 조절하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 플랫폼 서버는, 게스트가 입실한 이후에 모듈식 숙박시설의 환경정보를 획득하고, 수신한 환경정보를 이용하여 인공지능학습 또는 통계처리를 수행함으로써 각 게스트마다 시간대별, 계절별, 지역별 선호환경을 판단하여 저장하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 모듈식 숙박시설은 외부에 설치된 추억영상용 촬영기기를 포함하고,상기 플랫폼 서버는 상기 추억영상용 촬영기기에서 촬영된 영상을 대상으로 안면 인식기법을 적용하여 설정기준보다 얼굴이 선명한 외부활동 영상을 추출하고, 추출한 외부활동 영상과 게스트가 묵었던 모듈식 숙박시설의 영상을 합해서 추억영상을 편집하는 영상편집부를 포함하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서, 공개특허 10-2023-0030884-3-상기 모듈식 숙박시설은, 숙박시설의 기울기를 검출하는 기울기센서와, 숙박시설의 하부를 지지하는 다수의 높이조절장치를 포함하며,상기 마이컴은 기울기센서의 검출결과를 이용하여 상기 다수의 높이조절장치 중에서 적어도 하나를 제어하여 숙박시설 바닥의 수평을 유지하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 플랫폼 서버는, 회원 또는 게스트를 대상으로 온라인 커뮤니티를 지원하는 커뮤니티지원부를 포함하고, 상기 커뮤니티지원부에서 지원하는 온라인 커뮤니티는, 게시판, 온라인 게임 배틀, 홀로그램 반려동물 키우기,취미 자랑 중에서 적어도 하나를 포함하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 플랫폼 서버는 부지선정계약부를 포함하고,상기 부지선정계약부는, 유휴토지나 폐가의 부지를 소유한 토지소유자의 단말로 부지후보 등록을 위한 인터페이스를 제공하고, 부동산정보제공서버에 접속하여 토지소유자의 단말에서 입력한 부지에 대한 세부 정보를 수집하고, 인공지능 기반 사업성 검토 모델을 이용하여 해당 부지에 대한 사업성 여부를 판단하고, 사업성 기준이 충족되는 것으로 판단되면 토지 임대차 또는 매매를 위한 계약서를 토지소유자의 단말로 전송하여 임대차 또는 매매계약을 체결하고, 계약이 체결된 부지는 모듈식 숙박시설의 후보 부지로서 후보부지 DB에 저장하는 것을 특징으로 하는 숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 플랫폼 서버는 시설설치계약부를 포함하고, 상기 시설설치계약부는, 모듈식 숙박시설의 매수희망자 또는 임차희망자의 단말로 후보부지 리스트를 제공하고,매수희망자 또는 임차희망자의 단말에서 선택한 후보부지에 대한 세부정보, 증강현실 이미지, 및 영상을 매수희망자 또는 임차희망자의 단말로 전송하고, 계약을 원하는 경우에 매수희망자 또는 임차희망자의 단말로 모듈식숙박시설의 임대차 또는 매매를 위한 계약서를 전송하여 임대차 또는 매매계약을 체결하는 것을 특징으로 하는숙박 공유 플랫폼 시스템."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "게스트단말과, 통신부, 전자식도어록 및 마이컴을 구비하는 모듈식 숙박시설과, 플랫폼 서버를 포함하는 숙박공유 플랫폼 시스템을 이용한 숙박 공유 서비스 방법에 있어서,플랫폼 서버가 도어록 보안코드를 생성하는 단계;플랫폼 서버가 게스트단말과 모듈식 숙박시설로 도어록 보안코드를 전송하는 단계;모듈식 숙박시설의 마이컴이 근접한 게스트단말로부터 도어록 보안코드를 획득하는 단계;모듈식 숙박시설의 마이컴이 게스트단말로부터 획득한 도어록 보안코드와 플랫폼 서버에서 수신한 도어록 보안코드를 대비하여 일치하면 전자식도어록을 제어하여 현관을 개방하는 단계를 포함하는 숙박 공유 서비스 방법."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,플랫폼 서버가 모듈식 숙박시설로 게스트가 등록해둔 홀로그램 영상을 전송하는 단계;게스트가 모듈식 숙박시설에 설정거리 이내로 근접한 때, 전자식도어록이 개방된 때, 게스트 입실이 확인된 때공개특허 10-2023-0030884-4-중에서 적어도 하나의 경우에 모듈식 숙박시설의 마이컴이 모듈식 숙박시설의 내부에 구비된 홀로그램기기를 제어하여 저장된 홀로그램 영상을 출력하는 단계를 포함하는 숙박 공유 서비스 방법."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,플랫폼 서버가 모듈식 숙박시설로 게스트의 선호환경 정보를 전송하는 단계;모듈식 숙박시설의 마이컴이 모듈식 숙박시설의 내부에 구비된 냉난방기기, 조명기기 중에서 적어도 하나를 제어하여 내부의 온도, 습도 및 조도를 조절하는 단계를 포함하는 숙박 공유 서비스 방법."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,모듈식 숙박시설의 마이컴이 모듈식 숙박시설에 구비된 환경센서를 통해 획득한 환경정보를 플랫폼 서버로 전송하는 단계;플랫폼 서버가 모듈식 숙박시설로부터 수신한 환경정보를 이용하여 인공지능학습 또는 통계처리를 수행함으로써각 게스트마다 시간대별, 계절별, 지역별 선호환경을 판단하여 저장하는 단계를 포함하는 것을 특징으로 하는 숙박 공유 서비스 방법."}
{"patent_id": "10-2021-0113077", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,모듈식 숙박시설의 마이컴이 외부에 설치된 추억영상용 촬영기기에서 획득한 영상을 플랫폼 서버로 전송하는 단계;플랫폼 서버가 수신한 영상을 대상으로 안면 인식기법을 적용하여 설정기준보다 얼굴이 선명한 외부활동 영상을추출하고, 추출한 외부활동 영상과 게스트가 묵었던 모듈식 숙박시설의 영상을 합해서 추억영상을 편집하는 단계를 포함하는 숙박 공유 서비스 방법."}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 유휴토지나 폐가를 활용하는 숙박 공유 플랫폼 시스템을 개시한다. 본 발명에 따른 숙박 공유 플랫폼 시스템은, 게스트단말; 통신부, 전자식도어록, 냉난방기기, 조명기기 및 마이컴을 구비하는 모듈식 숙박시설; 통 신망을 통해 게스트단말 및 모듈식 숙박시설과 통신하는 것으로서, 게스트단말로 예약 인터페이스를 제공하는 예 (뒷면에 계속)"}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 숙박 공유 플랫폼에 관한 것으로서, 구체적으로는 유휴토지나 폐가의 부지에 간편하게 설치할 수 있 는 모듈식 숙박시설을 활용하여 숙박 공유 서비스를 제공함으로써 유휴토지나 폐가를 기반으로 새로운 수익 모 델을 창출할 수 있는 숙박 공유 플랫폼 시스템과 이를 이용한 숙박 공유 서비스 방법에 관한 것이다."}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 코로나(COVID-19) 사태로 인해 사회적 거리두기가 보편화됨에 따라 인구 밀집 지역을 대신하여 한적한 시 골이나 미개발 관광지에 대한 여행 수요가 증가하고 있는 추세이다. 그런데 이러한 지역에는 펜션, 모텔, 호텔 등의 숙박 인프라가 부족한 경우가 많기 때문에 사람들이 장시간 체 류하기 어려운 한계가 있다. 또한 최근 전국의 농어촌 지역에는 인구 감소로 인해 빈집이 크게 증가하고 있고, 관리 소홀로 인해 폐가가 되 어 주변경관을 해치는 것은 물론이고 안전사고와 범죄를 유발하여 지역사회의 골칫거리로 대두되고 있다. 이에 따라 정부나 지방자치단체 등에서 빈집정비사업을 시행하고는 있으나 예산이 부족하거나 소유주가 적극적 으로 나서지 않은 경우가 많기 때문에 큰 효과를 거두지 못하고 있는 실정이다.선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2038597호(2019.11.26 공고)"}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이러한 배경에서 고안된 것으로서, 전국의 유휴토지와 폐가의 부지를 생산적으로 활용할 수 있고 이 를 통해 새로운 수익을 창출할 수 있는 숙박 공유 플랫폼을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위하여, 본 발명은, 게스트단말; 통신부, 전자식도어록, 냉난방기기, 조명기기 및 마이 컴을 구비하는 모듈식 숙박시설; 통신망을 통해 게스트단말 및 모듈식 숙박시설과 통신하는 것으로서, 게스트단 말로 예약 인터페이스를 제공하는 예약관리부와, 전자식 도어록의 개폐에 필요한 도어록 보안코드를 생성하여 게스트단말과 모듈식 숙박시설로 전송하는 숙박시설관리부를 구비하는 플랫폼 서버를 포함하는 숙박 공유 플랫 폼 시스템을 제공한다. 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 모듈식 숙박시설의 마이컴은, 상기 플랫폼 서버로부터 수신 한 도어록 보안코드와 상기 게스트단말로부터 획득한 도어록 보안코드가 일치한 경우에 한하여 전자식 도어록을 개방할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 모듈식 숙박시설은 홀로그램 기기를 포함하고, 상기 마이컴은 게스트 입실이 확인된 후에 홀로그램 기기를 제어하여 상기 플랫폼 서버로부터 수신한 홀로그램 데이 터를 홀로그램 영상으로 출력할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 모듈식 숙박시설의 마이컴은, 상기 플랫폼 서버로부터 수신한 선호환경 정보에 따라 냉난방기기 및 조명기기를 제어하여 내부의 온도, 습도 및 조도를 조절할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 플랫폼 서버는, 게스트가 입실한 이후에 모듈식 숙박 시설의 환경정보를 획득하고, 수신한 환경정보를 이용하여 인공지능학습 또는 통계처리를 수행함으로써 각 게스 트마다 시간대별, 계절별, 지역별 선호환경을 판단하여 저장할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 모듈식 숙박시설은 외부에 설치된 추억영상용 촬영기 기를 포함하고, 상기 플랫폼 서버는 상기 추억영상용 촬영기기에서 촬영된 영상을 대상으로 안면 인식기법을 적 용하여 설정기준보다 얼굴이 선명한 외부활동 영상을 추출하고, 추출한 외부활동 영상과 게스트가 묵었던 모듈 식 숙박시설의 영상을 합해서 추억영상을 편집하는 영상편집부를 포함할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 모듈식 숙박시설은, 숙박시설의 기울기를 검출하는 기 울기센서와, 숙박시설의 하부를 지지하는 다수의 높이조절장치를 포함하며, 상기 마이컴은 기울기센서의 검출결 과를 이용하여 상기 다수의 높이조절장치 중에서 적어도 하나를 제어하여 숙박시설 바닥의 수평을 유지할 수 있 다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 플랫폼 서버는, 회원 또는 게스트를 대상으로 온라인 커뮤니티를 지원하는 커뮤니티지원부를 포함하고, 상기 커뮤니티지원부에서 지원하는 온라인 커뮤니티는, 게시 판, 온라인 게임 배틀, 홀로그램 반려동물 키우기, 취미 자랑 중에서 적어도 하나를 포함할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 플랫폼 서버는 부지선정계약부를 포함하고, 상기 부지 선정계약부는, 유휴토지나 폐가의 부지를 소유한 토지소유자의 단말로 부지후보 등록을 위한 인터페이스를 제공 하고, 부동산정보제공서버에 접속하여 토지소유자의 단말에서 입력한 부지에 대한 세부 정보를 수집하고, 인공 지능 기반 사업성 검토 모델을 이용하여 해당 부지에 대한 사업성 여부를 판단하고, 사업성 기준이 충족되는 것으로 판단되면 토지 임대차 또는 매매를 위한 계약서를 토지소유자의 단말로 전송하여 임대차 또는 매매계약을체결하고, 계약이 체결된 부지는 모듈식 숙박시설의 후보 부지로서 후보부지 DB에 저장할 수 있다. 또한 본 발명에 따른 숙박 공유 플랫폼 시스템에서, 상기 플랫폼 서버는 시설설치계약부를 포함하고, 상기 시설 설치계약부는, 모듈식 숙박시설의 매수희망자 또는 임차희망자의 단말로 후보부지 리스트를 제공하고, 매수희망 자 또는 임차희망자의 단말에서 선택한 후보부지에 대한 세부정보, 증강현실 이미지, 및 영상을 매수희망자 또 는 임차희망자의 단말로 전송하고, 계약을 원하는 경우에 매수희망자 또는 임차희망자의 단말로 모듈식 숙박시 설의 임대차 또는 매매를 위한 계약서를 전송하여 임대차 또는 매매계약을 체결할 수 있다."}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 숙박 공유 플랫폼 시스템을 활용하면 다음과 같은 효과를 얻을 수 있다. 첫째, 유휴토지나 폐가의 소유자 입장에서는 숙박 공유 플랫폼 운영자에게 토지(대지)를 판매 또는 임대함으로 써 새로운 수익을 얻을 수 있고 관리 부담을 줄일 수 있다. 둘째, 지방자치단체나 지역주민의 입장에서는 유휴토지와 폐가로 인한 경관 훼손이나 사고 위험을 줄일 수 있고 여행객 증가로 인한 지역경제 활성화를 기대할 수 있다. 셋째, 모듈식 숙박시설의 소유자 입장에서는 임대수익을 얻을 수도 있고, 자신의 숙박시설을 임대해주는 대가로 숙박 공유 플랫폼에 가입된 전국의 수많은 모듈식 숙박시설에 대한 일종의 이용권을 확보할 수 있는 효과가 있 다. 넷째, 캠핑용 트레일러나 캐러밴의 소유자의 입장에서는 이를 보관하거나 주차할 공간이 없는 경우에 본 발명의 숙박 공유 플랫폼 시스템에 가입하여 모듈식 숙박시설로 제공할 수 있고, 이를 통해 주차나 보관 문제를 해결할 수 있을 뿐만 아니라 수익을 얻을 수 있는 이점이 있다. 다섯째, 플랫폼 운영자의 입장에서는 설치가 용이한 모듈식 숙박시설을 활용하여 단기간에 전국 규모의 광범위 한 숙박 인프라를 구축할 수 있고, 플랫폼 서버를 통해 전체 숙박시설을 체계적이고 효과적으로 관리할 수 있는 이점이 있다. 또한 플랫폼 운영자는 농어촌 지역을 중심으로 전국 규모의 숙박 인프라를 갖추게 되므로 이를 기반으로 농어촌 의 생산품을 소비자와 직거래할 수 있는 플랫폼을 구축할 수도 있다. 여섯째, 지역주민을 모듈식 숙박시설의 관리자로 선정하고 관리비용을 지급함으로써 고용창출 효과를 얻을 수 있을 뿐만 아니라 플랫폼 운영자의 관리부담을 줄이면서도 모듈식 숙박시설을 보다 안정적으로 관리할 수 있다. 일곱째, 고객의 입장에서는 모듈식 숙박시설이 고객의 취향에 최적화된 숙박 환경을 제공하므로 심리적 안정감 을 얻을 수 있고, 인터넷 등 통신설비가 구비된 모듈식 숙박시설을 일과 여가를 병행하면서 장기간 체류하는 워 케이션(workation) 공간으로 활용할 수도 있다."}
{"patent_id": "10-2021-0113077", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 도면을 참조하여 본 발명의 바람직한 실시예를 상세히 설명한다. 참고로 본 명세서에서 하나의 구성요소(element)가 다른 구성요소와 연결, 결합, 또는 통신하는 경우는, 다른 구성요소와 직접적으로 연결, 결합, 또는 통신하는 경우만 아니라 중간에 다른 요소를 사이에 두고 간접적으로 연결, 결합, 또는 통신하는 경우도 포함한다. 또한 하나의 구성요소가 다른 구성요소와 직접 연결 또는 직접 결 합되는 경우는 중간에 다른 요소가 개재되지 않는 것을 의미한다. 또한 어떤 부분이 어떤 구성요소를 포함 또는 구비하는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포 함하거나 구비할 수 있는 것을 의미한다. 또한 본 명세서에 첨부된 도면은 발명의 요지를 이해하기 쉽도록 예시 한 것에 불과하므로 이로 인해 본 발명의 권리범위가 제한되어서는 아니 됨을 미리 밝혀 둔다. 본 발명은 유휴토지 또는 폐가를 활용하는 숙박 공유 플랫폼 시스템에 관한 것이다. 본 발명의 실시예에 따른 숙박 공유 플랫폼 시스템은, 도 1의 개략 구성도에 나타낸 바와 같이, 게스트단말 , 관리자단말, 토지소유자단말, 숙박시설소유자단말, 부동산정보제공서버, 모듈식 숙 박시설, 통신망, 플랫폼 서버 등을 포함할 수 있다. 게스트단말은 모듈식 숙박시설에서 숙박하려는 게스트가 사용하는 단말이고, 관리자단말은 모듈 식 숙박시설을 관리하는 관리자가 사용하는 단말이고, 토지소유자단말은 유휴토지의 소유자나 폐가 부지의 소유자가 사용하는 단말이고, 숙박시설소유자단말은 모듈식 숙박시설의 소유자가 사용하는 단 말이다. 게스트단말, 관리자단말, 토지소유자단말, 및 숙박시설소유자단말은 각각 통신망을 통해 플랫폼 서버에 접속하여 데이터를 송수신할 수 있는 기능을 구비한 전자기기인 것이 바람직하다. 구 체적으로는, 스마트폰, 태블릿, 데스크톱컴퓨터, 노트북컴퓨터 중에서 적어도 하나가 사용될 수도 있고, 기타 다른 종류의 전자기기가 사용될 수도 있다. 부동산정보제공서버는 토지정보, 건물정보, 토지이용계획, 지적도, 공시지가 등의 정보를 제공하는 서버로 서, 정부, 지방자치단체, 공공기관, 공공단체 등에서 운영하는 서버일 수도 있고 기업이나 민간에서 운영하는 서버일 수도 있다. 모듈식 숙박시설은 숙식에 필요한 공간과 부속설비를 구비한 것으로서, 농어촌 지역의 유휴토지나 폐가의 부지에 대규모 공사 없이 간편하게 설치할 수 있고 필요에 따라 이동이나 철거가 용이한 것이 바람직하다. 따라서 차량으로 견인할 수 있는 트레일러, 캐러밴 등을 모듈식 숙박시설로 활용하거나, 차량에 탑재하여 이송할 수 있는 소형 모듈러 주택, 컨테이너 하우스 등을 모듈식 숙박시설로 활용하는 것이 바람직하다. 다만, 본 발명의 숙박 공유 플랫폼 시스템이 반드시 이동식 주택에 한정되는 것은 아니며, 유휴토지 또는 폐가 의 부지에 고정된 주택을 모듈식 숙박시설로 활용하는 것도 가능하다. 한편, 차량으로 견인하거나 탑재가 가능한 모듈식 숙박시설은 도로상에서 이동해야 하므로 크기면에서 근 본적인 한계를 안고 있다. 이러한 한계를 극복하기 위해서는 이러한 유형의 모듈식 숙박시설에는 공간확장 이 가능한 구조를 적용하는 것이 바람직하다. 예를 들어, 도 2 및 도 3에 예시한 바와 같이, 모듈식 숙박시설은, 메인프레임과, 메인프레임의 내부에 수용된 상태에서 가이드레일을 따라 수평으로 이동하여 메인프레임의 전방으로 돌출될 수 있는 제1 가동프레임과, 메인프레임의 내부에 수용된 상태에서 가이드레일을 따라 수직으로 상승하여 메인프레 임의 상부로 돌출될 수 있는 제2 가동프레임을 포함할 수 있다. 이러한 모듈식 숙박시설을 사용하면, 이동할 때는 메인프레임의 내부에 제1 및 제2 가동프레임 (680,690)을 수용함으로써 전체 부피를 줄일 수 있고, 설치한 상태에서는 도 3에 예시한 바와 같이 메인프레임 의 외부로 제1 및 제2 가동프레임(680,690)을 이동시킴으로써 내부공간을 극대화할 수 있는 이점이 있다. 한편 모듈식 숙박시설은. 도 4의 블록도에 나타낸 바와 같이, 전원공급부, 통신부, 전자식도어 록, 조명기기, 냉난방기기, 오디오플레이어, 디스플레이, 홀로그램기기, 촬영기 기, 환경센서, 기울기센서, 수평조절장치, 상기 각 구성요소의 동작을 제어하는 마이컴 등을 포함할 수 있다. 전원공급부의 종류는 특별히 한정되지 않으며, 상용전원, 태양광패널, 축전지, 발전기 중에서 적어도 하나 를 포함할 수 있다. 통신부는 원격의 플랫폼 서버와 마이컴과의 통신을 지원한다. 또한 통신부는 게스트단말 , 관리자단말 등과의 근거리 통신을 지원할 수도 있고 기타 다른 방식의 통신을 지원할 수도 있다. 통신부의 통신규격은 특별히 한정되지 않으며, 인터넷, 이동통신, 근거리 무선통신(와이파이, 블루투스, 지그비, 지웨이브 등), 저전력 장거리통신(LoRa, LTE-M, LTE Cat.M1 등), 전용망통신, 사설망통신 등을 지원할 수 있다. 전자식도어록은 모듈식 숙박시설의 현관문 등에 설치되는 것으로서, 마이컴의 제어신호에 의해 서만 개폐동작을 수행하는 것이 바람직하다. 다만, 관리자의 출입 편의를 위해서는 카드키 또는 번호키 방식의 전자식도어록을 설치할 수도 있으며, 이 경우에는 관리자에게만 출입카드나 비밀번호를 제공해야 함은 물 론이다. 조명기기는 모듈식 숙박시설의 내부에 설치되는 조명등과 외부에 설치되는 조명등을 포함할 수 있다. 내부에 설치되는 조명등은 조도 또는 조명색상을 조절할 수 있는 것이 바람직하며, 특히 마이컴의 제어에 의해 조도 및/또는 조명색상을 조절할 수 있도록 설치되는 것이 보다 바람직하다. 냉난방기기는 에어컨, 난방기 등을 포함하며. 본 발명의 실시예에서는 마이컴의 제어신호에 의해 온 도조절이 가능한 것이 바람직하다. 도면에는 나타내지 않았지만 습도조절을 위한 제습기가 설치될 수도 있다. 오디오플레이어는 음악파일이나 음성파일을 재생하여 스피커를 통해 출력하는 역할을 하며, 마이컴의 제어에 의해 선택된 음악파일이나 음성파일을 재생하여 출력할 수도 있고, 사용자가 선택한 음악파일을 재생하 여 출력할 수도 있다. 디스플레이는 TV 프로그램이나 영화 등을 시청하기 위한 것으로서, 마이컴의 제어에 의해 선택된 채 널이나 영화를 출력할 수도 있고, 사용자가 선택한 채널이나 영화를 출력할 수도 있다. 홀로그램기기는 게스트가 입실하였을 때 마이컴의 제어에 따라 가상 반려동물 등의 홀로그램 영상을 출력하는 장치이다. 홀로그램기기가 홀로그램 영상을 구현하는 방식은 특별히 한정되지 않으며, 예를 들어 유사 홀로그램, 아날로그 홀로그램, 디지털 홀로그램 중에서 선택된 어느 하나의 방식으로 홀로그램 영상을 구 현할 수 있다. 촬영기기는 모듈식 숙박시설의 주변에 설치되는 카메라, CCTV 등을 포함하며, 촬영기기의 종류, 개수, 위치 등은 한정되지 않는다. 다수의 촬영기기 중에서 일부는 보안감시용으로 활용하고, 일부는 게스 트의 추억영상을 촬영하는 용도로 활용할 수도 있다. 환경센서는 모듈식 숙박시설 내부 및/또는 외부의 각종 환경 정보를 검출하기 위한 것으로서, 온도센 서, 습도센서, 조도센서, CO센서, CO2센서, 가스센서, 미세먼지센서 등을 포함할 수 있다. 도면에는 나타내지 않았지만, 모듈식 숙박시설의 내부에는 적외선센서 등과 같은 보안용 센서가 설치될 수 도 있다. 마이컴은 환경센서의 측정결과를 기반으로 냉난방기기나 환기장치(도면에는 나타내지 않았음)를 제어하여 내부의 환경을 조절할 수도 있고, 조명기기를 제어하여 조명의 밝기나 색상을 조절할 수도 있고, CO가스가 검출되는 등의 위험상황인 경우에는 오디오플레이어 등을 제어하여 경보를 발생시키거나 게스트 단말 및/또는 관리자단말로 경보메시지를 전송할 수도 있다. 기울기센서는 모듈식 숙박시설의 바닥이 수평에서 기울어진 정도를 검출하는 것으로서, 마이컴 은 기울기센서의 측정결과를 기반으로 높이조절장치를 제어하여 모듈식 숙박시설의 기울기를 조 절할 수 있다. 높이조절장치는 모듈식 숙박시설의 하부로 돌출되어 모듈식 숙박시설을 지지하는 것으로서, 예 를 들어 모듈식 숙박시설의 네 모서리에 각각 설치될 수 있다. 높이조절장치의 종류는 특별히 한정되 지 않으며, 예를 들어 공압실린더, 유압실린더, 전동(모터)실린더 등이 사용될 수 있다. 본 발명의 실시예에서는, 마이컴가 공압실린더, 유압실린더, 전동(모터)실린더 등의 왕복직선운동을 제어 하도록 설치하는 것이 바람직하다. 마이컴은 프로세서와 메모리를 포함하며, 프로세서는 메모리에 저장된 컴퓨터프로그램을 실행하여 소정의 연산을 수행함으로써 모듈식 숙박시설의 각종 설비를 제어할 수 있다. 마이컴의 프로세서와 메모리는 단일 칩(one chip)으로 패키징될 수도 있다. 통신망은 유선, 무선, 통신규격의 종류를 불문하고 다양하게 설계될 수 있다. 예를 들어 인터넷망, 이동통 신망, 근거리 무선통신망(와이파이, 블루투스, 지그비, 지웨이브 등), 저전력 장거리통신망(LoRa, LTE-M, LTE Cat.M1 등), 전용통신망, 사설통신망 등이 제한없이 선택적으로 조합되어 구성될 수 있다. 플랫폼 서버는 본 발명의 실시예에 따른 숙박 공유 서비스 운영자의 서버로서, 통신망을 통해 게스트 단말, 관리자단말, 토지소유자단말, 숙박시설소유자단말, 부동산정보제공서버, 모듈 식 숙박시설 등과 통신할 수 있다. 플랫폼 서버는 회원DB, 예약DB, 숙박시설DB, 후보부지DB 등과 연동할 수 있다. 도면에는 나타내지 않았지만, 플랫폼 서버는 하드웨어 측면에서 프로세서, 메모리, 통신수단 등을 포함한 다. 프로세서는 메모리에 저장된 컴퓨터프로그램을 실행하여 소정의 연산이나 데이터 처리를 실행하고, 통신수 단은 외부 단말 또는 외부 서버와의 통신을 지원한다. 또한 도 5의 블록도에 나타낸 바와 같이, 플랫폼 서버는 기능적인 측면에서, 회원관리부, 예약관리부 , 숙박시설관리부, 커뮤니티지원부, 부지선정계약부, 시설설치계약부, 결제 및 정산 처리부, 영상편집부 등을 포함할 수 있다. 회원관리부는 본 발명에 따른 숙박 공유 서비스를 이용하고자 하는 게스트의 접속, 회원가입, 탈퇴, 정보 수정, 인증 등의 절차를 수행한다. 즉, 회원관리부는 플랫폼 서버에 접속한 게스트단말로 회원가입을 위한 인터페이스를 제공하거 나 소정의 애플리케이션을 제공하고, 게스트단말에서 입력된 정보(성명, 성별, 전화번호, 이메일주소 등) 를 수신하여 회원DB에 저장한다. 또한 회원관리부는 본인확인을 위한 소정의 인증절차를 수행할 수도 있다. 예약관리부는 플랫폼 서버에 접속한 게스트단말로 숙박 예약을 위한 인터페이스를 제공하고, 게 스트단말에서 입력된 정보(모듈식 숙박시설의 식별정보, 예약날짜, 기간, 인원 등)를 수신하여 예약 DB에 저장한다. 또한 예약관리부는 예약날짜가 도래한 게스트단말로 예약확인메시지를 전송할 수 있다. 숙박시설관리부는 설정 조건에 따라 모듈식 숙박시설에 구비된 각종 기기의 동작을 제어할 수 있다. 일 예로서, 숙박시설관리부는 게스트단말의 입실 요청이 있는 경우 또는 설정조건을 충족한 경우에 도어록 보안코드를 생성하여 게스트단말과 모듈식 숙박시설의 통신부로 전송할 수 있다. 도어록 보안코드는 관리자가 없는 경우에도 게스트가 모듈식 숙박시설을 출입할 수 있도록 하기 위한 것으 로서, 도어록 보안코드의 구체적인 유형이나 생성 방식은 특별히 한정되지 않는다. 도어록 보안코드는 게스트가 예약한 모듈식 숙박시설의 정보와 게스트단말의 정보를 포함하는 것이 바람직하며, 바이너리 코드일 수도 있고, QR코드일 수도 있고, 바코드일 수도 있고, 기타 다른 형식일 수도 있 다. 또한 도어록 보안코드는 암호화되어 전송될 수도 있다. 모듈식 숙박시설의 마이컴은, 게스트단말과의 근거리 무선통신이나 바코드 또는 QR코드 인식장 치를 통해 확인한 도어록 보안코드와 플랫폼 서버로부터 수신한 도어록 보안코드를 대비하고, 일치하면 전 자식도어록을 제어하여 현관문을 개방하고 플랫폼 서버와 관리자단말로 게스트 입실 사실을 통 지할 수 있다. 다른 예로서, 숙박시설관리부는 게스트 퇴실이 확인된 경우에 모듈식 숙박시설로 숙박종료명령을 전 송할 수 있다. 이 경우 모듈식 숙박시설의 마이컴은 전원공급부를 제어하여 내부 설비에 대한 전원연결을 차단하는 한편 전자식도어록을 제어하여 현관문을 폐쇄하고, 플랫폼 서버와 관리자단말 로 게스트 퇴실을 통지할 수 있다. 커뮤니티지원부는 회원관리부를 통해 가입한 회원 및/또는 예약관리부를 통해 1회 이상 숙박예 약을 한 게스트를 대상으로 하는 온라인 커뮤니티를 지원한다. 온라인 커뮤니티의 구체적인 유형이나 방식은 특별히 한정되지 않는다. 예를 들어, 게시판, 온라인 게임 배틀, 홀로그램 반려동물 키우기, 취미 자랑 등의 카테고리를 포함할 수 있다. 이때, 게시판은 글쓰기, 사진 올리기, 댓글 달기 등의 인터페이스를 제공하고, 온라인 게임 배틀은 다양한 종류 의 대전 게임 인터페이스를 제공하고, '홀로그램 반려동물 키우기'는 가상의 반려동물에게 먹이주기, 용변치우 기, 산책시키기 등 가상의 양육 인터페이스를 제공할 수 있다. 또한 취미 자랑은 다양한 취미를 주제로 하는 글이나 사진을 게시하고 공유하는 인터페이스를 제공한다. 예를 들어 반려동물과 관련하여 각자의 실제 반려동물이나 홀로그램 반려동물을 주제로 글이나 사진을 게시하고 공유 하는 인터페이스를 제공할 수도 있고, 스포츠, 레저 등을 주제로 글이나 사진을 게시하고 공유하는 인터페이스 를 제공할 수도 있다. 한편, 커뮤니티지원부는 회원 및/또는 게스트의 적극적인 커뮤니티 활동을 유도하기 위하여 커뮤니티 활동 에 대한 보상으로서 가상코인을 지급할 수 있다. 또한 회원 및/또는 게스트는 플랫폼 서버에서 판매하는 물품, 서비스, 아이템 등에 대한 대가를 가상코인으로 지불할 수도 있고, 관리자에 대한 감사 팁을 가상코인으 로 지불할 수도 있다. 부지선정계약부는 모듈식 숙박시설을 설치할 유휴토지나 폐가의 부지를 매입하거나 임대하는 절차를 처리하는 역할을 한다. 예를 들어, 부지선정계약부는 유휴토지나 폐가의 부지를 소유한 토지소유자의 단말로 부지후보 등록 을 위한 인터페이스를 제공하고, 부동산정보제공서버에 접속하여 해당 부지에 대한 세부 정보를 수집할 수 있다. 또한 부지선정계약부는 인공지능 기반 사업성 검토 모델을 이용하여 해당 부지에 대한 사업성 여부를 판단 하고, 사업성 기준이 충족되는 것으로 판단되면 토지 임대차 또는 매매를 위한 계약서를 토지소유자단말로 전송하여 임대차 또는 매매계약을 체결하고, 계약이 체결된 부지는 모듈식 숙박시설의 후보 부지로서 후보 부지 DB에 저장할 수 있다. 시설설치계약부는 등록된 후보 부지에 모듈식 숙박시설을 설치하는데 필요한 계약 등을 수행하는 인 터페이스를 제공한다. 또한 시설설치계약부는 후보부지에 설치된 모듈식 숙박시설을 관리자를 선정하고 등록하는 인터페이 스를 제공할 수도 있다. 이때, 관리자의 범위는 특별히 한정되지 않지만 가급적 해당지역의 주민이 관리자로 선 정되는 것이 바람직하다. 후보 부지를 임대한 경우에는 후보 부지의 소유권자나 관리자가 모듈식 숙박시설(60 0)의 관리자로 선정될 수도 있고, 해당 지역의 다른 주민이 관리자로 선정될 수도 있다. 본 발명의 실시예에 따른 모듈식 숙박시설의 소유 형태는 여러 방식이 가능하며, 시설설치계약부는 소유 형태에 따라 서로 다른 형식의 계약 인터페이스를 제공할 수도 있다. 일 예로서, 플랫폼 운영자는 자신의 자금으로 후보 부지에 모듈식 숙박시설을 설치하고 직접 운용할 수도 있다. 다른 예로서, 플랫폼 운영자는 후보 부지에 모듈식 숙박시설을 설치한 후에 이를 타인에게 임대 또는 판매 할 수도 있다. 모듈식 숙박시설의 임차인이나 매수인의 범위는 한정되지 않으며, 회원일 수도 있고, 비회 원일 수도 있고, 후보 부지의 토지 소유자일 수도 있다. 시설설치계약부는 매수희망자 또는 임차희망자의 단말로 모듈식 숙박시설의 리스트를 제공하고, 매수 희망자 또는 임차희망자의 단말에서 선택한 모듈식 숙박시설에 대한 세부정보, 후보부지 정보, 증강현실 이미지, 영상 등을 제공할 수 있다. 또한 시설설치계약부는 매수희망자 또는 임차희망자의 단말로 모듈식 숙박시설의 임대차 또는 매매를 위한 계약서를 전송하여 임대차 또는 매매계약을 체결할 수 있다. 또 다른 예로서, 플랫폼 운영자는 후보 부지에 모듈식 숙박시설을 설치하기 전에 모듈식 숙박시설의 임차인이나 매수인을 미리 모집하여 계약을 체결한 후에 모듈식 숙박시설을 설치할 수도 있다. 이 경우에 도 모듈식 숙박시설의 임차인이나 매수인의 범위는 한정되지 않으며, 회원일 수도 있고, 비회원일 수도 있 고, 후보 부지의 토지 소유자일 수도 있다. 시설설치계약부는 모듈식 숙박시설의 매수희망자 또는 임차희망자의 단말로 후보부지 리스트를 제공 하고, 매수희망자 또는 임차희망자의 단말에서 선택한 후보부지에 대한 정보, 증강현실 이미지, 영상 등을 제공 할 수 있다. 또한 시설설치계약부는 매수희망자 또는 임차희망자의 단말로 모듈식 숙박시설의 임대차 또는 매매를 위한 계약서를 전송하여 임대차 또는 매매계약을 체결할 수 있다. 계약이 체결된 이후에는, 플랫폼 운영자가 계약된 후보 부지에 모듈식 숙박시설을 설치하고 CCTV 등 필요 한 주변설비를 설치할 수 있다. 또 다른 예로서, 플랫폼 운영자는 타인 소유의 캠핑 트레일러나 캐러밴 등을 임차하여 모듈식 숙박시설로 활용할 수 있다. 이 경우 시설설치계약부는 캠핑 트레일러나 캐러밴 등의 임대희망자의 단말로 후보부지 리스트를 제공하고, 임대희망자의 단말에서 선택한 후보부지에 대한 세부정보, 증강현실 이미지, 영상 등을 제공할 수 있 다. 또한 시설설치계약부는 임대희망자의 단말로 계약서를 전송하여 임대차 계약을 체결할 수 있다. 계약이 체결된 이후에는, 임대인은 계약된 후보 부지에서 자신의 캠핑 트레일러나 캐러밴 등을 플랫폼 운영자에 게 인계하고, 플랫폼 운영자는 도 4에 나타낸 바와 같이 전원공급부, 통신부, 전자식도어록, 조 명기기, 냉난방기기, 오디오플레이어, 디스플레이, 홀로그램기기, 촬영기기, 환 경센서, 기울기센서, 수평조절장치, 상기 각 구성요소의 동작을 제어하는 마이컴 등을 설 치하여 모듈식 숙박시설을 완성해야 한다. 한편, 시설설치계약부는 모듈식 숙박시설에 대한 소유권을 이전하였거나 타인의 모듈식 숙박시설 을 임대하여 활용하는 경우에는 소유권자가 원하는 바에 따라 임대기간, 임대료, 임대료 산정방식 등을 다 양하게 설정할 수 있다. 예를 들어, 계약된 임대기간에만 숙박 공유 시설로 제공하고, 이외의 기간에는 모듈식 숙박시설의 소유권 자만 전용으로 사용하는 것으로 계약할 수 있다. 또한 소유권자에게 지급할 임대료는 정액제로 계약할 수도 있고, 실제 렌탈 수익 대비 일정 비율로 계약할 수도 있고, 기타 다른 방식으로 계약할 수도 있다. 또한 소유권자에게 임대료를 지불하는 대신 본 발명에 따른 숙박 공유 플랫폼에서 운영하는 다른 지역의 모듈식 숙박시설에 대한 이용권을 설정 조건에 따라 지급하는 것으로 계약할 수도 있다. 결제 및 정산처리부는 게스트에게 청구되는 각종 비용의 결제과정을 지원하며, 예를 들어 신용카드결제, 계좌이체, 휴대폰 소액결제 등과 같은 통상의 결제과정을 처리하거나, 가상코인 지급 또는 결제 과정을 처리할 수도 있다. 또한 결제 및 정산처리부는 각 모듈식 숙박시설의 실제 렌탈 수익을 설정 계약에 따라 정산하여 플랫 폼 운영자, 모듈식 숙박시설의 소유권자, 토지소유권자 등의 계좌로 정산액을 송금할 수도 있다. 영상편집부는 해당 모듈식 숙박시설의 주변에 설치된 촬영기기에서 촬영된 영상을 편집하여 소 정 분량(예, 약 15초 분량)으로 추억영상을 제작하는 역할을 한다. 이때, 영상편집부는 모듈식 숙박시설의 외부에서 촬영된 영상을 대상으로 안면 인식기법을 적용하여 얼굴이 선명한 외부활동 영상을 추출하고, 추출한 외부활동 영상과 게스트가 묵었던 모듈식 숙박시설의 영 상을 합해서 추억영상을 편집할 수 있다. 영상편집부는 게스트단말로부터 추억영상 편집요청이 있거나 허락이 있는 경우에만 영상편집 작업을 하는 것이 바람직하지만 반드시 이에 한정되는 것은 아니다. 이상에서는 플랫폼 서버의 주요 구성을 중심으로 설명하였으나 플랫폼 서버의 구성요소가 이에 한정 되는 것은 아니므로 필요에 따라 다양한 기능을 수행하는 다른 구성이 추가될 수도 있다. 한편 플랫폼 서버의 상기 구성요소들 중에서 적어도 하나는 메모리에 저장되어 프로세서에 의해 실행되는 컴퓨터프로그램의 형태로 제공될 수 있다. 또한 상기 구성요소들 중에서 적어도 하나는 고속연산을 위해 특수 설계된 하드웨어의 형태로 제공될 수도 있고, 소프트웨어와 하드웨어가 통합된 형태로 제공될 수도 있다. 또한 플랫폼 서버의 상기 구성요소들은 단일 컴퓨팅 장치에서 구현될 수도 있고, 통신망을 통해 연결 된 분산형 또는 클라우드 컴퓨팅 장치의 형태로 구현될 수도 있다. 이하에서는 본 발명의 일 실시예에 따른 숙박공유 시스템의 여러 동작을 설명한다. 먼저 도 6을 참조하여 모듈식 숙박시설을 설치할 부지를 선정하는 과정을 설명한다. 모듈식 숙박시설을 설치할 부지는 플랫폼 운영자가 오프라인 상에서 후보지역 선정, 현장조사, 토지소유자 와의 계약 절차를 수행할 수도 있고, 토지소유자의 참여를 유도하여 온라인 상에서 대부분의 절차를 수행할 수 도 있다. 도 6을 참조하면, 먼저 유휴토지나 폐가 부지를 임대하거나 매매할 의사가 있는 토지소유자는 플랫폼 서버(80 0)에 접속하여 부지선정계약부에서 제공하는 등록 인터페이스를 통해 자신의 토지를 부지후보로 등록한다. (ST11) 이때 토지소유자는 임대 또는 매매를 선택하여 등록신청을 할 수 있고, 조경필요 여부, 폐가철거 여부, 기초공 사필요 여부 등과 같은 옵션을 선택하여 등록신청을 할 수도 있다. (ST12) 이어서 플랫폼 서버의 부지선정계약부는 등록된 후보부지의 주소정보 등을 이용하여 부동산정보제공 서버에 접속하여 해당 부지에 대한 세부 정보를 수집한다. (ST13) 이어서 부지선정계약부는 인공지능 기반 사업성 검토 모델을 이용하여 토지소유자단말을 통해 입력된 정보와 부동산정보제공서버로부터 수집한 정보를 토대로 등록된 각 후보부지에 대한 사업성 검토를 수행한 다. (ST14) 사업성 검토 결과 사업성 기준을 충족하는 것으로 판단되면, 부지선정계약부는 토지 임대차 또는 매매를 위한 계약서를 토지소유자단말로 전송하여 임대차 또는 매매계약을 체결한다. 만일 사업성 기준이 충족되 지 않는 것으로 판단되면 계약거절을 통지할 수 있다. (ST15, ST16, ST18) 또한 부지선정계약부는 계약이 체결된 부지를 모듈식 숙박시설의 후보 부지로서 후보부지 DB에 저장 할 수 있다. 이때, 후보 부지의 현황을 증강현실(AR) 데이터와 함께 저장할 수도 있다. (ST17) 다음으로 위 과정을 거쳐 선정된 후보 부지에 모듈식 숙박시설을 설치하는 과정을 설명한다. 예를 들어 플 랫폼 운영자가 후보 부지에 모듈식 숙박시설을 설치하기 전에 임차인이나 매수인을 미리 모집하여 계약하 는 경우를 설명한다. 도 7을 참조하면, 먼저 모듈식 숙박시설을 임대하거나 매수할 의사가 있는 자는 플랫폼 서버에 접속 하여 후보부지 리스트를 요청하여 수신한다. (ST21) 이어서 플랫폼 서버의 시설설치계약부는 매수희망자 또는 임차희망자의 단말로 선택된 후보부지에 대 한 정보, 증강현실(AR) 이미지, 영상 등을 제공한다. (ST22) 매수희망자 또는 임차희망자는 수신한 정보를 기초로 계약 조건을 검토하고 계약조건이 합치된다고 판단되면 계 약을 요청한다. 계약 요청이 수신되면, 시설설치계약부는 매수희망자 또는 임차희망자의 단말로 모듈식 숙 박시설의 임대차 또는 매매를 위한 계약서를 전송하여 임대차 또는 매매계약을 체결한다. (ST23, ST24) 이상의 과정을 거쳐 계약이 체결되면, 플랫폼 운영자는 계약된 후보 부지에 모듈식 숙박시설과 CCTV 등 필 요한 주변설비를 설치하고, 관리자를 선정한 후 인적사항, 연락처 등을 등록한다. (ST25, ST26) 이후에는 해당 모듈식 숙박시설의 렌탈 운용은 플랫폼 운영자의 책임으로 진행되며, 플랫폼 서버의 결제 및 정산처리부는 모듈식 숙박시설의 운용 수익을 사전 계약된 바에 따라 분배하여 각자의 계좌 로 송금한다. (ST27) 이하에서는 도 8을 참조하여 본 발명의 실시예에 따른 숙박 공유 서비스를 이용하는 게스트가 모듈식 숙박시설 에 입실하는 과정을 설명한다. 먼저 본 발명의 실시예에 따른 모듈식 숙박시설을 이용하고자 하는 게스트는 게스트단말을 통해 플 랫폼 서버에 접속하여, 원하는 숙박시설, 숙박기간, 서비스옵션 등을 선택한다. 필요한 경우에는 본인확인 을 위한 인증절차, 개인정보활용을 위한 동의절차, 비용약정절차 등을 수행할 수도 있다. 한편 서비스옵션은 게스트가 선택한 경우에만 유료 또는 무료로 제공되는 것으로서 그 종류는 특별히 한정되지 는 않는다. 예를 들어. 추억영상 제작, 간이수영장, 타프, 장작, 바비큐, 해먹, 게임기, 블루투스 프린터, 낚시 등이 서비스옵션으로 제공될 수 있다. (ST31)이어서, 게스트단말을 통해 결제가 이루어지면, 플랫폼 서버는 예약DB에 예약정보를 등록하는 한편 게스트단말로 예약 확정통지를 전송한다. 결제가 이루어지기 전에 가계약 정보를 예약 DB에 등 록하고 게스트단말로 가계약 통지를 전송하는 것도 가능하다. (ST32, ST33) 이어서 플랫폼 서버는 예약DB를 통해 입실시간이 도래하는 예약이 있는지 여부를 지속적으로 확인하 고, 입실시간이 도래한 예약이 있으면 설정된 시점에 해당 모듈식 숙박시설의 관리자단말로 서비스옵 션의 셋팅을 요청할 수 있다. 관리자는 서비스옵션을 셋팅한 후에 관리자단말로 플랫폼 서버에 접속 하여 셋팅 완료를 통지할 수도 있다. 이와 달리 관리자는 관리자단말로 제공되는 전용 애플리케이션을 통해 예약 현황과 서비스옵션을 확인하고, 해당 애플리케이션을 통해 플랫폼 서버로 셋팅 완료를 통지할 수도 있다. (ST34, ST35) 또한 플랫폼 서버의 숙박시설관리부는 입실시간이 도래하는 예약이 있으면 설정된 시점에 해당 모듈 식 숙박시설의 전자식도어록을 해제하기 위한 도어록 보안코드를 생성하여 게스트단말과 모듈식 숙박시설로 전송할 수 있다. 앞서 설명한 바와 같이, 도어록 보안코드는 게스트가 예약한 모듈식 숙박시설의 정보와 게스트단말의 정보를 포함하는 것이 바람직하며, 바이너리 코드일 수도 있고, QR코드일 수도 있고, 바코드일 수도 있고, 기타 다른 형식일 수도 있다. 플랫폼 서버는 도어록 보안코드와 함께 예약 리마인더 메시지를 게스트단말로 전송할 수도 있다. (ST36, ST37, ST38) 게스트는 예약한 모듈식 숙박시설에 도착한 후에 도어록 보안코드를 활용하여 현관문을 개방하고 입실할 수 있다. 예를 들어, 게스트가 게스트단말에서 실행되는 전용 애플리케이션에서 현관문 개방 메뉴를 선택하면 게스 트단말은 와이파이, 블루투스 등의 근거리 무선통신을 통해 도어록 보안코드와 함께 도어록 개방 요청신호 를 송출할 수 있다. 모듈식 숙박시설의 마이컴은, 게스트단말로부터 근거리 무선통신으로 수신하였거나 게스트단말 의 디스플레이에 표시된 QR코드 또는 바코드를 인식장치로 인식하여 획득한 도어록 보안코드를 플랫폼 서 버로부터 수신하여 저장해둔 도어록 보안코드와 대비하고, 서로 일치하면 전자식 도어록을 제어하여 현관문을 개방할 수 있다. 다만, 반드시 게스트단말과 모듈식 숙박시설의 근거리 무선통신을 통해 도어록을 개방해야 하는 것은 아니며, 다른 방식으로 도어록을 개방하는 것도 가능하다. 예를 들어, 게스트단말이 플랫폼 서버로 입실 요청을 전송하면, 플랫폼 서버의 숙박시설관리부 가 게스트단말의 실시간 위치정보를 이용하여 게스트가 예약한 모듈식 숙박시설에 도착하였는지 여부를 판단하고, 게스트가 도착한 것으로 판단되면 플랫폼 서버가 해당 모듈식 숙박시설로 도어록 개방 명령을 전송하고, 해당 모듈식 숙박시설의 마이컴이 도어록 개방 명령에 따라 전자식 도어록 을 제어하여 현관문을 개방할 수도 있다. (ST39) 다음으로 도 9를 참조하여 게스트가 모듈식 숙박시설에 입실한 이후의 과정을 설명한다. 먼저, 현관문이 개방되고 게스트가 모듈식 숙박시설의 내부로 입실하면, 모듈식 숙박시설의 마이컴 은 게스트의 입실 여부를 확인한다. 게스트의 입실 여부를 확인하는 방법은 특별히 한정되지 않으므로 다양한 방법이 적용될 수 있다. 일 예로서, 근거리 무선통신을 기반으로 게스트단말과 모듈식 숙박시설의 통신부 간의 거리를 산출하여 게스트가 입실하였는지 여부를 판단할 수 있다. 다른 예로서, 게스트가 게스트단말에서 실행되는 전용 애플리케이션에서 입실 확인 메뉴를 선택하거나, 모 듈식 숙박시설의 내부에 설치된 홈패드에서 입실확인 메뉴를 선택하면 게스트가 입실한 것으로 판단할 수 있다. 또 다른 예로서, 게스트단말과의 통신을 거쳐 도어록을 개방한 이후에 모듈식 숙박시설의 내부에 구 비된 적외선센서 등에서 움직임이 감지되면 게스트가 입실한 것으로 판단할 수 있다. 그 밖에 다른 방식으로 게스트 입실 여부를 확인할 수 있다. (ST40) 모듈식 숙박시설의 마이컴은 게스트가 입실한 것으로 확인되면, 플랫폼서버로 게스트 입실을 통 지할 수 있다 (ST41) 플랫폼 서버의 숙박시설관리부는 게스트 입실이 확인되면, 회원 DB 등을 조회하여 해당 게스트 가 등록한 홀로그램 영상이 있는지 여부를 확인하고, 등록된 홀로그램이 있으면 해당 데이터를 모듈식 숙박시설 로 전송할 수 있다. 게스트가 등록한 홀로그램이 없으면 플랫폼 운영자가 제작한 홀로그램 영상을 전송할 수도 있다. (ST42, ST43) 이어서 모듈식 숙박시설의 마이컴은 홀로그램기기를 제어하여 수신한 홀로그램을 출력한다. 홀로그램은 예를 들어 반려동물 홀로그램일 수 있으며, 이 경우 게스트는 모듈식 숙박시설에 입실하였을 때 가상의 반려동물이 자신을 반기는 영상을 볼 수 있고 이를 통해 새로운 재미와 감동을 느낄 수 있게 된다. 특히 오디오플레이어와 연동하여 반려동물 홀로그램을 출력하면 게스트의 입장에서는 보다 생생한 느낌을 받을 수 있다. 다만, 홀로그램의 종류가 반드시 반려동물에 한정되는 것은 아니므로 다른 종류의 홀로그램 영상을 출력할 수도 있음은 물론이다. 한편 이상에서는 플랫폼 서버가 게스트 입실 이후에 홀로그램 영상을 전송하는 것으로 설명하였으나 반드 시 이에 한정되는 것은 아니다. 따라서, 예약이 확정된 후에 게스트 입실 여부와 상관없이 게스트가 등록한 홀로그램 영상을 미리 모듈식 숙박 시설로 전송하는 것도 가능하다. 또한 이 경우 모듈식 숙박시설의 마이컴은, 게스트가 모듈식 숙박시 설에 설정 거리 이내로 근접한 때, 현관문의 전자식도어록이 개방된 때, 게스트 입실이 확인된 때, 기타 설정된 조건을 충족한 때를 선택하여 저장해둔 홀로그램 영상을 출력할 수 있다. (ST44) 다음으로, 플랫폼 서버의 숙박시설관리부는 게스트 입실이 확인되면, 회원 DB 등을 조회하여 해 당 게스트가 선호하는 환경이 등록되어 있는지 여부를 확인할 수 있다. (ST45) 만일 등록된 선호환경이 있으면 해당 환경정보를 모듈식 숙박시설로 전송하고, 모듈식 숙박시설의 마 이컴은 조명기기, 냉난방기기 등을 제어하여 내부의 조도, 조명색상, 온도, 습도 등을 게스트가 선호하는 환경으로 셋팅한다. (ST46, ST47) ST45에서 해당 게스트의 선호환경이 등록되어 있지 않은 경우에는 플랫폼 서버의 숙박시설관리부가 게스트단말로 환경설정을 요청할 수도 있다. (ST48) 이 경우 게스트는 게스트단말에서 실행되는 전용 애플리케이션에서 제공되는 환경설정 메뉴를 통해 원하는 조도, 온도, 습도 등의 환경정보를 입력하고, 게스트단말이 입력된 환경정보를 플랫폼서버로 전송하 면 플랫폼서버가 이를 모듈식 숙박시설로 전송할 수 있다. (ST49) 이와 달리, 게스트단말이 모듈식 숙박시설의 내부에 위치한 경우에는, 게스트단말은 전용 애플 리케이션을 통해 입력된 환경정보를 근거리 무선통신으로 송출하고, 모듈식 숙박시설의 마이컴이 수 신한 환경정보에 따라 조명기기, 냉난방기기 등을 제어하여 조도, 조명색상, 온도, 습도 등을 조절할 수도 있다. (ST49a) 이상의 과정을 거쳐 설정된 환경은 이후에 게스트에 의해 다시 변경될 수도 있으며, 모듈식 숙박시설의 마 이컴은 주기적으로 또는 실시간으로 실내 환경정보를 확인하여 플랫폼 서버로 전송할 수 있다. (ST50) 또한 플랫폼 서버의 숙박시설관리부는 모듈식 숙박시설로부터 수신한 환경정보를 토대로 인공지 능 학습을 수행하거나 통계처리 기법을 적용하여 각 게스트마다 시간대별, 지역별, 계절별 선호환경을 판단하고, 선호환경 정보를 회원DB에 등록하거나 예전에 등록된 정보를 갱신할 수 있다. (ST51) 한편, 이상에서는 게스트가 모듈식 숙박시설에 입실한 이후에 마이컴이 선호환경 셋팅을 개시하는 것으로 설명하였으나 반드시 이에 한정되는 것은 아니므로 게스트 입실 여부와 상관없이 선호환경 셋팅을 개시할 수도 있다. 예를 들어, 설정 시간이 도래한 때, 게스트단말로부터 요청이 있는 때, 기타 설정된 조건을 충족한 때를 선택하여 게스트가 입실하기 전에 미리 선호환경 셋팅을 개시할 수도 있다. 이하에서는 도 10을 참조하여 본 발명의 실시예에 따른 숙박 공유 서비스를 이용하는 게스트가 모듈식 숙박시설 에서 퇴실하는 과정을 설명한다. 플랫폼 서버의 숙박시설관리부는 예약DB를 통해 퇴실시간이 도래하는 예약이 있는지 여부를 지 속적으로 확인하고, 퇴실시간이 도래한 예약이 있으면 게스트단말로 퇴실 안내 메시지를 전송한다. (ST61, ST62) 또한 숙박시설관리부는 퇴실시간이 도래하면 관리자단말로 퇴실 및 청소요청 메시지를 전송할 수 있 다. 이와 달리 관리자는 관리자단말에서 실행되는 전용 애플리케이션을 통해 퇴실 시간 및/또는 예약 현황 을 확인하고, 청소를 완료한 후에 해당 애플리케이션을 통해 플랫폼 서버로 청소 완료를 통지할 수도 있다. (ST63) 이어서 플랫폼 서버의 영상편집부는 퇴실하는 게스트의 추억영상 편집을 위하여 모듈식 숙박시설 로 추억영상 데이터를 요청한다. 영상편집부는 게스트단말로부터 추억영상 제작 요청을 수신하였거나 추억영상 제작에 대해 사전 승인 을 받은 경우에 한하여 모듈식 숙박시설로 추억영상 데이터를 요청하는 것이 바람직하지만 반드시 이에 한 정되는 것은 아니다. 모듈식 숙박시설의 마이컴은 모듈식 숙박시설의 외부에 설치된 촬영기기 중에서 추억영상 제작을 목적으로 설치된 촬영기기에서 획득한 영상 데이터만 플랫폼 서버로 전송하는 것이 바람직하 다. 다만 반드시 이에 한정되는 것은 아니므로 보안감시용 CCTV에서 촬영된 영상데이터를 플랫폼 서버로 전송하는 것도 가능하다. (ST64, ST65) 플랫폼 서버의 영상편집부는 모듈식 숙박시설로부터 수신한 영상을 대상으로 안면 인식기법을 적용하여 얼굴이 선명한 외부활동 영상을 추출하고, 추출한 외부활동 영상과 게스트가 묵었던 모듈식 숙박시설 의 영상을 합해서 추억영상을 편집할 수 있다. (ST66) 또한 플랫폼 서버의 영상편집부는 추억영상 편집을 완료한 이후에는 개인정보 보호를 위해 촬영원본 삭제 명령을 모듈식 숙박시설로 전송하고, 모듈식 숙박시설의 마이컴은 이에 응하여 저장된 추 억영상용 촬영원본을 완전히 삭제한다. (ST67, ST68) 이어서 플랫폼 서버의 영상편집부는 편집된 추억영상을 게스트단말로 전송하고, 게스트단말 의 요청이 있는 경우에 한하여 커뮤니티에 추억영상을 업로드한다. (ST69, ST70, ST71) 한편, 본 발명의 실시예에 따른 숙박 공유 플랫폼 시스템을 통해 제공되는 숙박 공유 서비스 방법은 프로그램 명령 등의 형태로 구현되어 컴퓨터로 판독 가능한 기록 매체에 기록될 수 있다. 이때, 컴퓨터로 판독 가능한 기록매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하 여 포함할 수 있다. 기록매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거 나 컴퓨터 소프트웨어 관련 통상의 기술자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터로 판독 가능한 기록매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(Magnetic Media), CD-ROM, DVD와 같은 광기록 매체(Optical Media), 플롭티컬 디스크(Floptical Disk)와 같은 자기-광 매체(Magneto-Optical Media), 롬(ROM), 램(RAM), 플래시 메모리 등에서 적어도 하나를 포함할 수 있다. 또한 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수도 있다. 이상에서는 본 발명의 바람직한 실시예를 설명하였으나, 본 발명은 구체적인 적용에 있어서 다양한 형태로 변형 또는 수정될 수 있으며, 변형 또는 수정된 실시예도 후술하는 특허청구범위에 포함된 본 발명의 기술적 사상을 포함한다면 본 발명의 권리범위에 속함은 당연하다."}
{"patent_id": "10-2021-0113077", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 숙박 공유 플랫폼 시스템의 구성도 도 2는 모듈식 숙박시설을 예시한 도면 도 3은 모듈식 숙박시설의 확장프레임을 이동시킨 상태를 예시한 도면 도 4는 모듈식 숙박시설의 제어계통을 예시한 블록도 도 5는 플랫폼 서버의 구성을 나타낸 블록도 도 6은 모듈식 숙박시설의 부지선정 과정을 예시한 흐름도 도 7은 모듈식 숙박시설의 설치과정을 예시한 흐름도 도 8은 게스트가 모듈식 숙박시설에 입실하는 과정을 예시한 흐름도 도 9는 모듈식 숙박시설의 내부 환경 설정을 예시한 흐름도. 도 10은 게스트가 모듈식 숙박시설에서 퇴실하는 과정을 예시한 흐름도"}
