{"patent_id": "10-2019-0106447", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0026120", "출원번호": "10-2019-0106447", "발명의 명칭": "관리 장치 및 관리 방법", "출원인": "한국로봇융합연구원", "발명자": "서갑호"}}
{"patent_id": "10-2019-0106447", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복수의 콘텐츠와 관련된 제1 정보를 획득하는 제1 획득부;복수의 하드웨어와 관련된 제2 정보를 획득하는 제2 획득부;상기 제1 정보와 상기 제2 정보 간의 매칭 상태를 분석하고, 상기 매칭 상태에 따라 복수의 상기 콘텐츠와 복수의 상기 하드웨어를 연계시키는 관리부;를 포함하는 관리 장치."}
{"patent_id": "10-2019-0106447", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1 획득부는 상기 콘텐츠를 제작하는 저작 단말기와 통신하고, 상기 저작 단말기에 특정 제2 정보를 제공하며,상기 제1 획득부는 상기 특정 제2 정보에 기반해 제작된 특정 콘텐츠의 특정 제1 정보를 획득하고,상기 특정 제1 정보에는 상기 특정 제2 정보에 매칭되는 매칭 정보가 포함되며,상기 관리부는 상기 매칭 정보를 이용해서 복수의 상기 제2 정보 중 상기 특정 제2 정보를 탐색하고, 탐색된 상기 특정 제2 정보의 제공자와 동일한 종류의 하드웨어를 상기 특정 콘텐츠에 연계시키는 관리 장치."}
{"patent_id": "10-2019-0106447", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 획득부는 재활 장치에 적용 가능한 재활 훈련 콘텐츠의 등록 정보를 획득하고,상기 제2 획득부는 상기 재활 장치의 훈련 정보를 획득하며,상기 등록 정보 및 상기 훈련 정보는 정보 분류 코드 및 장치 분류 코드 중 적어도 하나를 포함하고,상기 정보 분류 코드는 사용자 입력형, 운동 측정형, 힘 측정형으로 구분되는 상기 재활 장치에서 출력되는 로우 데이터(Raw data)를 포함하며,상기 장치 분류 코드는 상기 재활 장치의 상태 정보를 가공하여 생성되는 정보를 포함하고,상기 관리부는 상기 정보 분류 코드 및 상기 장치 분류 코드를 이용해서 복수의 상기 재활 훈련 콘텐츠와 복수의 상기 재활 장치를 서로 연계시키는 관리 장치."}
{"patent_id": "10-2019-0106447", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 정보 및 상기 제2 정보는 정보 분류 코드와 장치 분류 코드 중 적어도 하나를 포함하고,상기 정보 분류 코드는 사용자 입력형, 운동 측정형, 힘 측정형으로 구분되며,상기 사용자 입력형은 온/오프 타입, 누른 힘 타입, 누른 시간 타입으로 구분되고,상기 운동 측정형은 속도 타입, 가속도 타입, 현재 각도 타입, 운동 시간 타입으로 구분되며,공개특허 10-2021-0026120-3-상기 힘 측정형은 인장력 타입, 힘의 유지 시간 타입으로 구분되고,상기 장치 분류 코드는 입력이 유지되는 시간 타입, 동작 수행 여부 타입, 반복 횟수 타입으로 구분되며,상기 관리부는 상기 정보 분류 코드와 상기 장치 분류 코드를 이용해 복수의 상기 콘텐츠 및 상기 하드웨어를복수 종류로 분류하고, 상기 관리부는 동일 종류로 분류된 특정 콘텐츠와 특정 하드웨어를 서로 연계시키는 관리 장치."}
{"patent_id": "10-2019-0106447", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 정보는 상기 콘텐츠로 입력되는 정보의 종류를 나타내고,상기 제2 정보는 상기 하드웨어로부터 출력되는 정보의 종류를 나타내며,상기 관리부는 특정 하드웨어로부터 상기 콘텐츠의 제공이 요청되면, 상기 특정 하드웨어의 제2 정보를 분석해서 상기 특정 하드웨어로부터 출력되는 정보의 종류를 추출하고,상기 관리부는 상기 특정 하드웨어로부터 출력되는 정보와 동일한 종류의 정보를 입력 대상으로 하는 특정 콘텐츠를 탐색하며,상기 관리부는 탐색된 상기 특정 콘텐츠의 리스트를 상기 특정 하드웨어에 제공하는 관리 장치."}
{"patent_id": "10-2019-0106447", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "관리 장치에 의해 수행되는 관리 방법에 있어서,복수의 재활 훈련 콘텐츠와 관련된 제1 정보를 획득하고, 복수의 재활 장치로부터 서로 구분되는 제2 정보를 획득하는 획득 단계;상기 제1 정보의 종류를 이용해서 상기 재활 훈련 콘텐츠를 분류하고, 상기 제2 정보의 종류를 이용해서 상기재활 장치를 분류하는 분류 단계;서로 동일한 분류 체계를 갖는 상기 제1 정보와 상기 제2 정보의 분류 결과를 이용해서 특정 재활 훈련 콘텐츠와 특정 재활 장치를 매칭시키는 매칭 단계;를 포함하는 관리 방법."}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "관리 장치가 제공된다. 상기 관리 장치는 복수의 콘텐츠와 관련된 제1 정보를 획득하는 제1 획득부; 복수의 하드 웨어로부터 서로 구분되는 제2 정보를 획득하는 제2 획득부; 상기 제1 정보와 상기 제2 정보 간의 매칭 상태를 분석하고, 상기 매칭 상태에 따라 복수의 상기 콘텐츠와 복수의 상기 하드웨어를 연계시키는 관리부;를 포함할 수 있다."}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소프트웨어에 해당하는 콘텐츠와 하드웨어를 관리하는 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "가상 현실, 증강 현실, 게임 등의 재활 훈련 콘텐츠를 이용한 재활 장치 시스템은 보편적인 기술이며, 많은 부 분에서 발전을 거듭하고 있다. 하지만, 해당 발전은 재활 장치와 콘텐츠간의 독립화를 통한 개발 편의성 확보가 아닌 인공지능 기술등을 이용 한 재활 콘텐츠의 효율성 고도화에 집중되고 있다. 또한, 재활 시스템내 개발의 편의성을 고려하여 장치에서 획 득되는 훈련 정보를 일반화하고 다수의 콘텐츠를 활용 가능한 재활 시스템 구현의 적용예는 찾기 힘든 현실이다. 한국공개특허공보 제2017-0070916호에는 사용자 인증이 완료된 재활 운동 사용자 장치에 대해 다양한 재활 콘텐 츠가 업데이트되는 내용이 나타나 있다. 그러나, 재활 콘텐츠의 업데이트 대상이 기설정된 특정 재활 운동 사용자 장치로 한정되는 일대일 대응 문제를 그대로 갖는다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국공개특허공보 제2017-0070916호"}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 일대일 대응을 벗어나 다대다 대응이 가능한 독립적 재활 시스템을 구현할 수 있는 재활 장치 및 재 활 방법을 제공하기 위한 것이다."}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 관리 장치는 복수의 콘텐츠와 관련된 제1 정보를 획득하는 제1 획득부; 복수의 하드웨어로부터 서로 구분되는 제2 정보를 획득하는 제2 획득부; 상기 제1 정보와 상기 제2 정보 간의 매칭 상태를 분석하고, 상기 매칭 상태에 따라 복수의 상기 콘텐츠와 복수의 상기 하드웨어를 연계시키는 관리부;를 포함할 수 있다. 상기 관리부는 특정 콘텐츠의 제1 정보를 분석해서 상기 제1 정보의 종류를 파악할 수 있다. 관리부는 상기 제1 정보와 동일한 종류의 정보를 출력하는 불특정다수의 하드웨어가 상기 특정 콘텐츠를 다운받을 수 있는 상태로 상기 특정 콘텐츠를 관리할 수 있다. 본 발명의 관리 방법은 복수의 재활 훈련 콘텐츠와 관련된 제1 정보를 획득하고, 복수의 재활 장치로부터 서로 구분되는 제2 정보를 획득하는 획득 단계; 상기 제1 정보의 종류를 이용해서 상기 재활 훈련 콘텐츠를 분류하고, 상기 제2 정보의 종류를 이용해서 상기 재활 장치를 분류하는 분류 단계; 서로 동일한 분류 체계를 갖는 상기 제1 정보와 상기 제2 정보의 분류 결과를 이용해서 특정 재활 훈련 콘텐츠와 특정 재활 장치를 매칭 시키는 매칭 단계;를 포함할 수 있다."}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 콘텐츠와 하드웨어가 일대일로 대응되던 기존 환경을 벗어나, 콘텐츠와 하드웨어가 다대다로 대응될 수 있다. 콘텐츠와 하드웨어 간의 다대다 대응을 위해 콘텐츠를 제1 정보와 하드웨어의 제2 정보를 분류 하고, 두 정보의 분류 결과에 대한 매칭 여부에 따라 특정 하드웨어에 대한 특정 콘텐츠의 제공 여부가 결정될 수 있다. 불특정다수의 콘텐츠와 불특정다수의 하드웨어 간의 대응에 의해 특정 콘텐츠는 다양한 하드웨어에 적용될 수 있으며, 특정 하드웨어는 다양한 콘텐츠의 적용 타겟이 될 수 있다. 본 실시예에 따르면, 콘텐츠 제작자는 자신의 마음대로 콘텐츠를 제작할 수 있다. 하드웨어 제작자 역시 마음내 키는 대로 하드웨어를 제작할 수 있다. 특정 하드웨어에서 특정 콘텐츠가 정상적으로 수행되는 상태가 호환성 만족 상태로 정의될 수 있다. 호환성을 만족시키기 위해 콘텐츠와 하드웨어 간에는 연결 고리가 요구될 수 있다. 본 발명에서는 해당 연결 고리의 일반화를 위해 콘텐츠로 입력되는 정보 자체가 아닌 해당 정보의 종류가 제1 정보로 사용될 수 있다. 마찬가지로 하드웨어로부터 출력되는 정보 자체가 아닌 해당 정보의 종류가 제2 정보로 사용될 수 있다. 따라서, 제1 정보와 제2 정보 간의 연결 고리는 특정 정보의 종류이므로 종류별로 묶인 복수의 콘텐츠 그룹과 복수의 하드웨어 그룹이 서로 매칭될 수 있다. 이때의 매칭 상태는 콘텐츠의 입력 정보의 종류와 하드웨어의 출력 정보의 종류가 서로 매칭된 상태이므로, 입출력 정보의 호환성이 보장되며 물리적으로 정상적인 하드웨어의 동작이 보장할 수 있다. 특정 콘텐츠 제작자는 자신이 제작한 콘텐츠가 단일의 하드웨어에 적용되는 것에 그치지 않고 해당 콘텐츠가 적 어도 콘텐츠의 입력 정보와 동일한 종류의 출력 정보를 갖는 분류 그룹 내의 복수의 하드웨어에 적용되므로, 높 은 생산성을 제공받을 수 있다. 해당 상황을 반대로 해석하면, 특정 하드웨어에서 정상 동작하는 콘텐츠가 복수 의 콘텐츠 제작자로부터 제공될 수 있다. 따라서, 하드웨어 제작자는 수많은 콘텐츠가 제공되는 환경에서 하드웨어를 개발할 수 있다. 정리하면, 본 발명의 관리 장치 및 관리 방법에 따르면, 최소한의 조건을 충족하는 범위 내에서 다양한 콘텐츠 와 다양한 하드웨어가 서로 독립적으로 자유롭게 제작될 수 있는 환경이 마련될 수 있다. 본 발명의 관리 장치 및 방법은 콘텐츠 측과 하드웨어 측의 사이에서 둘을 매칭 또는 연계시키는 관리부를 통해 재활 장치 개발의 독립화를 실현하고 재사용성을 개선할 수 있다. 또한, 본 발명에 따르면, 재활 장치의 개선 외에도 재활 콘텐츠 개발의 독립화 및 재사용성이 개선될 수 있다. 본 발명에 따르면, 재활 훈련 정보의 관리가 자동화될 수 있다. 본 발명에 따르면, 재활 훈련 장치 개발을 위한 인력의 작업량이 감소될 수 있다. 본 발명에 따르면, 전문 지식이 없는 콘텐츠 개발자의 개발 효율성이 증가될 수 있다."}
{"patent_id": "10-2019-0106447", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서에서, 동일한 구성요소에 대해서 중복된 설명은 생략한다. 또한 본 명세서에서, 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존 재할 수도 있다고 이해되어야 할 것이다. 반면에 본 명세서에서, 어떤 구성요소가 다른 구성요소에 '직접 연결 되어' 있다거나 '직접 접속되어' 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되 어야 할 것이다. 또한, 본 명세서에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용되는 것으로써, 본 발명을 한정 하려는 의도로 사용되는 것이 아니다.또한 본 명세서에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 또한 본 명세서에서, '포함하다' 또는 '가지다' 등의 용어는 명세서에 기재된 특징, 숫자, 단계, 동작, 구성요 소, 부품, 또는 이들을 조합한 것이 존재함을 지정하려는 것일 뿐, 하나 또는 그 이상의 다른 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이 해되어야 할 것이다. 또한 본 명세서에서, '및/또는' 이라는 용어는 복수의 기재된 항목들의 조합 또는 복수의 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서, 'A 또는 B'는, 'A', 'B', 또는 'A와 B 모두'를 포함할 수 있다. 또한 본 명세서에서, 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략될 것 이다. 도 1은 본 발명의 관리 장치를 나타낸 블록도이다. 도 1에 도시된 관리 장치는 제1 획득부, 제2 획득부, 관리부를 포함할 수 있다. 제1 획득부는 복수의 콘텐츠와 관련된 제1 정보를 획득할 수 있다. 일 예로, 제1 획득부는 콘텐츠를 제작하는 저작 단말기와 통신하거나, 콘텐츠가 저장된 보관 단말기와 유무선 통신하는 제1 통신 모듈을 포함할 수 있다. 제1 획득부는 저작 단말기 또는 보관 단말기로부터 제1 정보를 획득할 수 있다. 콘텐츠를 보관하는 별도의 보관 단말기 또는 데이터베이스가 존재하는 경우, 제1 획득부는 제1 정보만을 획득할 수 있다. 물론, 제1 획득부 또는 관리부는 제1 정보 및 해당 콘텐츠 자체를 획득하고 보관할 수도 있다. 제1 정보는 콘텐츠와 관련된 정보로, 콘텐츠마다 획득될 수 있다. 따라서, 제1 획득부에 의해 획득되는 제 1 정보의 개수는 콘텐츠의 개수 이하일 수 있다. 본 발명의 콘텐츠와 하드웨어 간의 일대일 대응을 최대한 배제하고 진정한 다대다 대응을 구현하기 위해, 제1 정보는 국부적이기보다는 일반화되는 것이 좋다. 일 예로, 제1 정보는 콘텐츠로 입력되는 정보 자체인 것보다는 콘텐츠로 입력되는 정보의 종류를 나타내는 것이 바람직하다. 제2 획득부는 복수의 하드웨어와 관련된 제2 정보를 획득할 수 있다. 하드웨어는 정상적인 동작을 위해 소 프트웨어에 해당하는 콘텐츠의 설치가 요구되는 물리적 기구, 기계 등을 포함할 수 있다. 제2 획득부는 복 수의 하드웨어로부터 서로 구분되는 제2 정보를 획득할 수 있다. 일 예로, 제2 획득부는 하드웨어와 유무 선 통신하는 제2 통신 모듈을 포함할 수 있다. 제2 정보는 하드웨어와 관련된 정보로, 하드웨어마다 획득될 수 있다. 다라서, 제2 획득부에 의해 획득되 는 제2 정보의 개수는 하드웨어의 개수 이하일 수 있다. 콘텐츠와 하드웨어 간의 다대다 대응을 실현하기 위해서, 제2 정보는 일반화되는 것이 좋다. 일 예로, 제2 정보 는 하드웨어로부터 출력되는 정보 자체인 것보다는 하드웨어로부터 출력되는 정보의 종류를 나타내는 것이 좋다. 관리부는 제1 정보와 제2 정보를 이용해서 복수의 콘텐츠와 복수의 하드웨어를 다대다로 대응시킬 수 있다. 제1 정보와 제2 정보 간의 매칭 여부는 하드웨어에 설치된 특정 콘텐츠의 정상 동작 여부를 결정할 수 있 다. 따라서, 다대다 대응은 제1 정보와 제2 정보와 관련된 특정 조건을 만족하는 범위 내에서 이루어질 수 있다. 일 예로, 관리부는 제1 정보와 제2 정보 간의 매칭 상태를 분석하고, 매칭 상태에 따라 복수의 콘텐츠와 복수의 하드웨어를 연계시킬 수 있다. 콘텐츠와 하드웨어의 '연계'는 복수의 콘텐츠 중 선택된 특정 콘텐츠가 정상적으로 동작될 수 있는 하나 이상의 하드웨어를 탐색하는 것을 나타낼 수 있다. 또는, 탐색 결과에 해당되는 하드웨어의 식별 정보와 특정 콘텐츠의 식별 정보를 하나의 그룹으로 묶어서 저장하거나 관리하는 것을 나타낼 수 있다. 콘텐츠와 하드웨어의 '연계'는 복수의 하드웨어 중 선택된 특정 하드웨어에서 정상적으로 동작될 수 있는 하나 이상의 콘텐츠를 탐색하는 것을 나타낼 수 있다. 또는, 탐색 결과에 해당되는 콘텐츠의 식별 정보와 특정 하드 웨어의 식별 정보를 하나의 그룹으로 묶어서 저장하거나 관리하는 것을 나타낼 수 있다.'연계'는 콘텐츠와 하드웨어 중 어느 한쪽이 다른 쪽을 찾을 때, 쉽게 찾을 수 있는 표식 정보를 적어도 어느 한쪽에 부가하는 것을 나타낼 수 있다. 일 예로, 관리부는 콘텐츠와 하드웨어를 종류별로 분류할 수 있다. 이때, 동일한 종류로 분류된 콘텐츠와 하드웨어는 서로에게 필요한 어느 한쪽과 다른 한쪽을 형성할 수 있다. 여기서, 콘텐츠의 분류 정보 또는 하드웨어의 분류 정보가 표식 정보에 해당될 수 있다. 제1 획득부는 콘텐츠를 제작하는 저작 단말기와 유무선 통신할 수 있다. 저작 단말기와 통신하는 제1 획득 부는 저작 단말기에 특정 제2 정보를 제공할 수 있다. 제2 정보는 하드웨어로부터 제공받은 것으로, 하드 웨어 고유의 각종 정보를 포함할 수 있다. 따라서, 제2 정보를 이용하면 해당 하드웨어에서 정상적으로 동작할 수 있는 콘텐츠가 제작될 수 있다. 다른 관점에서 살펴보면, 콘텐츠의 제작자는 저작 단말기를 통해 관리 장치 에 접속하고, 제1 획득부를 통해 특정 제2 정보를 획득할 수 있다. 콘텐츠 제작자는 특정 제2 정보에 기반 해 특정 콘텐츠를 제작할 수 있다. 제1 획득부는 특정 제2 정보에 기반해 제작된 특정 콘텐츠의 제1 정보에 해당하는 특정 제1 정보를 획득할 수 있다. 특정 제1 정보에는 특정 제2 정보에 매칭되는 매칭 정보가 포함될 수 있다. 관리부는 매칭 정보를 이용해서 복수의 제2 정보 중 특정 제2 정보를 탐색할 수 있다. 관리부는 탐색 된 특정 제2 정보의 제공자로 분류된 특정 하드웨어를 특정 콘텐츠에 연계시킬 수 있다. 본 실시예에 따르면, 특정 하드웨어에 대한 정보를 이용해서 특정 콘텐츠가 제작될 수 있다. 이때, 특정 콘텐츠는 특정 하드웨어에 기반한 것이지만, 가능한 많은 수의 다른 하드웨어에도 사용 가능한 것이 여러 방면에 유리하다. 특정 콘텐츠의 호환성을 확장시키기 위해, 관리부는 특정 제2 정보의 제공자(특정 하드웨어에 해당)와 동 일한 종류의 하드웨어를 특정 콘텐츠에 연계시킬 수 있다. 본 실시예에 따르면, 특정 하드웨어와 동일한 종류로 분류된 다른 하드웨어도 특정 콘텐츠에 연계될 수 있다. 본 실시예에 따르면, 제1 하드웨어를 타겟으로 제작된 제1 콘텐츠는 제1 하드웨어와 동일한 종류로 분류된 제2 하드웨어에서도 정상적으로 동작될 수 있다. 제2 하드웨어를 타겟으로 제작된 제2 콘텐츠는 제1 하드웨어에서도 정상적으로 동작될 수 있다. 따라서, 제1 하드웨어는 자신을 직접 타겟으로 한 제1 콘텐츠뿐만 아니라 다른 하 드웨어를 타겟으로 한 제2 콘텐츠 역시 정상적으로 사용할 수 있다. 마찬가지로, 제2 하드웨어는 자신을 직접 타겟으로 한 제2 콘텐츠뿐만 아니라 다른 하드웨어를 타겟으로 한 제1 콘텐츠 역시 정상적으로 사용할 수 있다. 이상에서 설명된 콘텐츠는 재활 훈련 콘텐츠를 포함할 수 있으며, 하드웨어는 재활 훈련에 사용되는 재활 장치 를 포함할 수 있다. 재활 로봇, 재활의료기기 등의 재활 장치는 의사의 진단을 기반으로 고령자 및 장애인의 재활 필요 부위에 대해 재활 훈련 콘텐츠를 통한 반복적인 재활 훈련 서비스를 제공할 수 있다. 하드웨어에 해당하는 재활 장치는 훈련 목적별로 종속적으로 콘텐츠가 개발되므로, 기본적으로 재활 장치에는 신규 콘텐츠가 새롭게 적용되기 어렵다. 또한, 신규 재활 장치에 대해 기개발된 콘텐츠가 재사용되기 어렵다. 본 발명의 관리 장치는 재활 장치에서 제공 가능한 훈련 정보를 일반화하고, 제공 가능한 훈련 정보를 기반으로 하는 콘텐츠를 재활 장치로부터 독립화함으로써, 하드웨어/콘텐츠 독립적인 재활 훈련 프레임워크 시스템을 제 안할 수 있다. 일 예로, 제1 획득부는 재활 장치에 적용 가능한 재활 훈련 콘텐츠의 등록 정보를 획득할 수 있다. 재활 훈련 콘텐츠의 등록 정보는 제1 정보에 해당될 수 있다. 제2 획득부는 재활 장치의 훈련 정보를 획득할 수 있다. 재활 장치의 훈련 정보는 제2 정보에 해당될 수 있다. 등록 정보 및 훈련 정보는 정보 분류 코드 및 장치 분류 코드 중 적어도 하나를 포함할 수 있다. 즉, 제1 정보 및 제2 정보는 정보 분류 코드와 장치 분류 코드 중 적어도 하나를 포함할 수 있다. 정보 분류 코드는 사용자 입력형, 운동 측정형, 힘 측정형으로 구분되는 재활 장치에서 출력되는 로우 데이터 (Raw data)를 포함할 수 있다. 도 2는 재활 장치의 종류를 나타낸 개략도이다. 사용자 입력형은 버튼 등의 입력 수단이 구비되며, 입력 수단에 대한 압력의 상태(On/Off) 또는 압력 강도 등을 측정하는 제1 측정 수단을 기반으로 하는 분류의 재활 장치 그룹을 나타낼 수 있다. 사용자 입력형으로 분류된 재활 장치들은 입력 수단의 온오프(On/Off) 정보, 입력 수단을 누른 힘의 정보(가압 력 정보), 입력 수단을 누르고 있는 유지 시간 정보(가압 유지 시간 정보) 등을 출력할 수 있다. 이때, 재활 장 치로부터 출력되는 온오프(On/Off) 정보, 가압력 정보, 가압 유지 시간 정보 등이 로우 데이터(Raw data)에 해 당될 수 있다. 정리하면, 사용자 입력형은 온오프 정보를 출력하는 온오프(On/Off) 타입(U-0001, 누른 힘 타입 (U-0002), 누른 시간 타입(U-0003)으로 구분되거나 세분화될 수 있다. 운동 측정형에 속한 재활 장치들은 사용자의 팔 운동, 다리 운동, 허리 운동 등의 운동 상태를 측정하는 제2 측 정 수단을 구비할 수 있다. 운동 측정형은 속도, 가속도, 각도 등을 측정하는 제2 측정 수단을 기반으로 하는 분류의 재활 장치 그룹을 나타낼 수 있다. 운동 측정형에는 팔 운동, 다리 운동 등의 각종 운동을 가이드하는 손잡이 등의 가이드 수단이 구비될 수 있다. 제2 측정 수단은 사용자의 신체의 물리적 운동을 직접 측정하거나 가이드 수단의 움직임을 측정할 수 있다. 운동 측정형으로 분류된 재활 장치들은 신체 또는 가이드 수단을 대상으로 측정된 속도 정보, 속력 정보, 가속 도 정보, 지면에 대한 현재의 각도 정보 또는 초기 각도에 대한 현재의 각도 정보, 신체의 운동이 유지된 시간 정보 등을 출력할 수 있다. 이때, 재활 장치로부터 출력되는 속도 정보, 속력 정보, 가속도 정보, 각도 정보, 신체의 운동이 유지된 시간 정보 등이 로우 데이터(Raw data)에 해당될 수 있다. 운동 측정형은 속도 정보를 출 력하는 속도 타입(V-0001), 속력 정보를 출력하는 속력 타입(V-0002), 가속도 정보를 출력하는 가속도 타입(V- 0003), 현재 각도 정보를 출력하는 현재 각도 타입(V-0004), 운동 유지 시간 정보를 출력하는 운동 시간 타입 (V-0005)으로 구분되거나 세분화될 수 있다. 힘 측정형은 신체에 부하를 인가하는 탄성체 등의 운동 부하 수단, 운동 부하 수단에 가해진 힘의 세기 등을 특 정하는 제3 측정 수단을 구비할 수 있다. 힘 측정형은 운동 부하 수단, 제3 측정 수단을 기반으로 하는 분류의 재활 장치 그룹을 나타낼 수 있다. 힘 측정형으로 분류된 재활 장치들은 탄성체의 힘에 저항하는 신체의 힘의 세기 정보(해당 힘의 세기는 탄성력 의 변화량과 관련되므로 탄성체의 신축과 관련된 인장력 정보로 대체될 수 있음), 인장력이 가해진 시간 정보 등을 출력할 수 있다. 이때, 재활 장치로부터 출력되는 인장력 정보, 시간 정보 등이 로우 데이터(Raw data)에 해당될 수 있다. 힘 측정형은 인장력 정보를 출력하는 인장력 타입(E-0001), 힘의 유지 시간 정보를 출력하는 힘의 유지 시간 타입(E-0002)으로 구분되거나 세분화될 수 있다. 관리부는 재활 장치를 사용자 입력형, 운동 측정형, 힘 측정형 등으로 구분할 수 있다. 관리부는 종 류별로 분류된 재활 장치로부터 출력된 로우 데이터를 정보 분류 코드로 정의하고 분류할 수 있다. 해당 정보 분류 코드는 다음의 표 1과 같을 수 있다. 표 1의 '분류 코드'가 정보 분류 코드에 해당될 수 있다. 표 1 분류 코드 정의 프로토콜(Output) U-0001 사용자 입력형 On/Off 측정기 번호/측정 정보 (정보 정의)/정보 타입 (Analog/Digital)U-0002 누른 힘 U-0003 시간 V-0001 운동 측정형 속도 V-0002 속력 V-0003 가속도 V-0004 현재 각도 V-0005 시간 E-0001 힘 측정형 인장력 E-0002 시간 ... 장치 분류 코드는 재활 장치의 상태 정보를 가공하여 생성되는 정보를 포함할 수 있다. 해당 장치 분류 코드는 다음의 표 2와 같을 수 있다. 표 2의 '분류 코드'가 장치 분류 코드에 해당될 수 있다.표 2 프로토콜(Input) 분류 코드 정의(Information) 측정기 번호/측정 정보(정보 정의)/정보 타입 (Analog/Digital)I-0001 입력 유지 시간 I-0002 동작 수행 여부 I-0003 반복횟수 ... 재활 장치의 상태 정보는 각 재활 장치에 마련된 각종 측정 모듈, 측정 모듈의 측정값을 가공하는 가공 모듈에 의해 결정될 수 있다. 일 예로, 제1 측정 수단이 마련된 상태에서 사용자가 입력 수단을 누른 경우를 가정한다. 제1 측정 수단은 입력 수단이 눌려지면 입력 수단이 눌려진 상태를 나타내는 온 신호를 출력할 수 있다. 가공 모듈은 온 신호가 수신되면, 온 신호의 분석을 통해 입력이 유지된 시간을 파악하거나 동작이 수행된 여부를 파 악하거나 반복 횟수를 파악할 수 있다. 즉, 측정 모듈로부터 출력된 온 신호는 가공 모듈에 의해 입력이 유지된 시간 정보로 가공될 수 있다. 또는, 해당 입력 신호는 동작이 수행된 여부를 나타내는 정보 또는 반복 횟수를 나타내는 정보로 가공, 변환, 변경될 수 있다. 관리부는 제1 정보와 제2 정보를 이용하여 정보 분류 코드 와 장치 분류 코드를 분석하고, 분석 결과에 따라 콘텐츠 또는 하드웨어를 적절하게 분류할 수 있다. 관리부는 재활 장치의 출력 정보를 정보 분류 코드와 장치 분류 코드로 명시할 수 있다. 관리부는 콘텐츠의 입력 정보를 정보 분류 코드와 장치 분류 코드로 명시할 수 있다. 표 1을 살펴보면, 장치 분류 코드는 입력이 유지되는 시간 타입(I-0001), 동작 수행 여부 타입(I-0002), 반복 횟수 타입(I-0003)으로 구분될 수 있다. 관리부는 정보 분류 코드와 장치 분류 코드를 이용해 복수의 콘텐 츠 및 하드웨어를 복수의 종류로 분류할 수 있다. 관리부는 동일 종류로 분류된 특정 콘텐츠와 특정 하드 웨어를 서로 연계시킬 수 있다. 도 3은 관리부의 동작을 나타낸 개략도이다. 도 4는 본 발명의 관리 장치의 동작을 나타낸 흐름도이다. 제1 정보는 콘텐츠로 입력되는 정보의 종류를 나타낼 수 있다(도 3의 '콘텐츠 입력'). 제2 정보는 하드웨어로부터 출력되는 정보의 종류를 나타낼 수 있다(도 3의 'H/W 출력'). 관리부는 특정 하드웨어로부터 콘텐츠의 제공이 요청되면, 특정 하드웨어의 제2 정보를 분석해서 특정 하 드웨어로부터 출력되는 정보의 종류를 분석할 수 있다. 해당 종류는 정보 분류 코드(도 3의 'Data 분류 코드') 에 해당될 수 있다. 관리부는 각 하드웨어로부터 출력된 정보 분류 코드를 이용해서 장치 분류 코드를 생성할 수 있다. 예를 들어, 정보 분류 코드 U-0001, U0002, V-0003, E-0002는 공통적으로 장치 분류 코드 I-0001로 취합되어 재분류 될 수 있다. 관리부는 특정 하드웨어로부터 출력되는 정보와 동일한 종류의 정보를 입력 대상으로 하는 특정 콘텐츠를 탐색할 수 있다. 탐색 과정에서 관리부는 정보 분류 코드 또는 장치 분류 코드를 이용할 수 있다. 일 예로, 도 3에서 재활 장치1에 적용 가능한 재활 훈련 콘텐츠는 재활 장치1의 정보 분류 코드 U-0001, U-0002 를 입력으로 하거나, 해당 분류 코드를 이용해 생성된 장치 분류 코드 I-0001을 입력으로 하는 콘텐츠로 제한될 수 있다. 해당 조건을 만족하는 콘텐츠가 도 3과 같이 콘텐츠1과 콘텐츠2로 탐색되면, 관리부는 탐색된 특 정 콘텐츠에 해당하는 콘텐츠1과 콘텐츠2가 포함된 리스트를 생성하고, 해당 리스트를 특정 하드웨어에 제공할 수 있다. 본 발명의 관리 장치는 하드웨어에 마련될 수 있다. 또는, 관리 장치는 콘텐츠를 생성하거나 보관하는 단말기와 하드웨어 사이에 배치된 서버에 마련될 수 있다. 후자의 경우, 서버와 통신할 수 있는 수단이 하드웨어에 구비 되기만 하면, 새롭게 제조된 하드웨어뿐만 아니라 기존의 하드웨어도 자신과 직접 1:1로 대응된 관계가 아닌 수 많은 콘텐츠를 이용할 수 있다. 다음과 같은 사용 시나리오가 가능하다. 재활 장치의 개발자는 재활 훈련 목적에 맞게 장치를 개발할 수 있다. 이때, 콘텐츠와의 다대다 대응을 위해 주 의해야 할 부분은 하드웨어에서 출력되는 정보를 특정하고, 특정된 정보를 미리 정의한 프로토콜(표 1, 표 2 참조)에 맞게 서버로 전송하는 동작 모드를 마련하는 것 정도이다. 일 예로, 하드웨어 개발자 A는 두 개의 버튼에 의해 측정되는 정보가 온오프 정보와 가압력 정보인 사용자 입력 형 하드웨어를 개발할 수 있다. A는 서버를 대상으로 해당 하드웨어의 모델명(이름)을 M-2780과 같이 정의(사용 자 정의)할 수 있다. A는 M-2780이 특정 타입 U-0001, U-0002 타입의 정보 분류 코드를 가지며, 이를 활용한 장 치 분류 코드 I-0001을 해당 하드웨어의 출력값으로 명시할 수 있다. 다른 예로, 정보 분류 코드 및 장치 분류 코드는 본 발명의 관리부에 의해 자동으로 분석될 수 있다. 콘텐츠의 개발자 B는 콘텐츠에서 활용하기 위한 입력값으로 정보 분류 코드, 장치 분류 코드를 명시하고 등록할 수 있다. 이때, 하드웨어 측에서 명시된 코드와 콘텐츠 측에서 명시된 코드는 제한된 범주 내에 존재하지만, 어 느 특정 하드웨어, 어느 특정 콘텐츠만을 대상으로 하는 것과 거리가 멀 수 있다. 하드웨어 측에서는 콘텐츠에 대해 독립적으로 코드를 명시하고, 콘텐츠 측에서도 하드웨어에 대해 독립적으로 코드를 명시할 수 있다. 서로 독립적으로 명시된 코드는 제한된 범주 내에 존재하므로, 결국 우연하게 일치되는 코드들이 발생되며, 우연하게 일치된 코드들의 제공자에 해당하는 하드웨어와 콘텐츠 간의 연계 관계가 관리부에 의해 형성될 수 있다. 일 예로, B는 설정 위치에 도달한 정보를 입력으로 하는 재활 훈련 콘텐츠를 제작할 수 있다. B는 해당 콘텐츠 에 대해 정보 분류 코드 U-0001과 장치 분류 코드 I-0001을 입력값으로 명시할 수 있다. 재활 장치의 사용자 C는 구매한 재활 장치의 화면에서 적용 가능한 재활 콘텐츠 리스트를 확인할 수 있다. 해당 리스트는 관리부에 의해 제공되며, 현재의 재활 장치에 연계된 콘텐츠들의 목록을 포함할 수 있다. C는 리 스트에서 원하는 재활 훈련 콘텐츠를 선택할 수 있다. 선택된 재활 훈련 콘텐츠 자체는 관리부에 보관되거 나 별도의 데이터베이스, 별도의 보관 단말기에 보관된 상태일 수 있다. C에 의해 특정 재활 훈련 콘텐츠가 선 택되면, 관리부는 특정 재활 훈련 콘텐츠를 재활 장치로 제공하거나, 특정 재활 훈련 콘텐츠에 접근할 수 있는 링크 정보를 재활 장치에 제공할 수 있다. 관리부를 통해 획득되거나 링크 정보를 통해 획득된 재활 훈련 콘텐츠는 정보 분류 코드, 장치 분류 코드 중 적어도 하나가 재활 장치와 일치하는 것이므로 정상적으로 재활 장치에서 동작될 수 있다. 도 5는 재활 장치에 표시되는 재활 훈련 콘텐츠의 리스트를 나타낸 개략도이다. 재활 장치에 마련된 콘텐츠 리스트 버튼이 클릭되면, 재활 장치에 마련된 디스플레이에는 관리부에 의해 생성되고 콘텐츠의 리스트가 표시될 수 있다. 관리부는 해당 재활 장치의 제2 정보 및 데이터베이스화된 콘텐츠의 제1 정보를 이용해서 서로 호환 가능한 콘텐츠들을 탐색할 수 있다. 재활 장치에 표시되는 리스트가 관리부의 탐색 결과물에 해당될 수 있다. 일 예로, 재활 장치1에는 콘텐츠1, 콘텐츠2의 리스트가 표시될 수 있다. 재활 장치2에는 콘텐츠1, 콘텐츠2의 리스트가 표시될 수 있다. 재활 장치3에는 콘텐츠1, 콘텐츠2, 콘텐츠3의 리스트가 표시될 수 있다. 일 예로, 재활 장치1의 개발자는 데이터베이스에 보관된 각종 콘텐츠를 의식하지 않고 재활 장치1을 개발할 수 있다. 이때, 콘텐츠1과 콘텐츠2는 재활 장치1 전용으로 개발된 것은 아니지만, 분류 체계상 재활 장치1에서 사 용 가능한 콘텐츠가 되어버릴 수 있다. 다른 예로, 재활 장치1의 개발자는 데이터베이스 등에서 콘텐츠1을 확인하고, 콘텐츠1이 동작하도록 재활 장치1 을 개발할 수 있다. 콘텐츠1의 정상 동작을 위해 재활 장치1은 콘텐츠1에서 요구하는 정보를 출력하도록 제작되 며, 그 과정에서 특정 종류로 분류될 수 있다. 개발이 완료된 재활 장치1은 애초 의도했던 콘텐츠1을 정상적으 로 이용할 수 있을 뿐만 아니라, 특정 종류로 분류된 콘텐츠2와 같은 다양한 다른 콘텐츠들도 이용할 수 있다. 도 6은 하드웨어 독립적인 재활 훈련 소프트웨어 프레임 워크 시스템을 나타낸 개략도이다. 도 7은 재활 훈련 소프트웨어 프레임 워크 시스템의 동작을 나타낸 흐름도이다. 도 6에 도시된 재활 훈련 소프트웨어 프레임 워크 시스템은 도 1의 관리 장치를 포함할 수 있다. 도 6의 프레임 워크 시스템은 재활 장치 및 해당 재활 장치의 구동을 위한 펌웨어(firmware)를 포함하여 장치 정보 및 재활운동 수행정보를 전송하는 재활 장치 등록부, 재활 장치 정보에 따른 활용 가능한 콘텐츠 전송 및 콘텐츠 수행하는 재활 장치-콘텐츠 연계부, 재활 콘텐츠 개발 및 등록을 수행하는 재활 콘텐츠 등록부로 이에 속하는 인터페이스 장치 등으로 하드웨어 장치, 소프트웨어 장치 등의 시스템에서 연동되는 모든 장치를 포함할 수 있다.재활 콘텐츠 등록부는 제1 획득부를 포함할 수 있다. 재활 장치 등록부는 제2 획득부를 포함할 수 있 다. 재활 장치-콘텐츠 연계부는 관리부를 포함할 수 있다. 재활 장치에서 획득 가능한 훈련 상태 정보(도 6의 '훈련 정보')는 재활 장치 이름(모델명)에 따라 훈련 정보 데이터베이스(Database)에서 파악되며, 훈련 정보에 따라 적용 가능한 재활 훈련 콘텐츠는 콘텐츠-훈련정보 데 이터베이스에서 파악될 수 있다. 이때, 적용 가능한 재활 훈련 콘텐츠가 선택적으로 재활 장치로 전송되고, 재 활 장치는 전송받은 재활 훈련 콘텐츠를 이용해 재활 훈련을 수행할 수 있다. 하드웨어 독립적 재활 장치 프레임워크 시스템의 수행 방식은 다음과 같다. 재활 장치 개발자는 일반화된 재활 장치의 훈련 정보를 기반으로 장치를 개발하고 개발된 재활 장치를 서버에 등록할 수 있다. 등록된 재활 장치의 장치명 및 훈련 정보 등의 장치 정보가 서버에 전송될 수 있다. 재활 장치에서 생성되는 훈련 정보를 이용하여 재활 장치에서 활용 가능한 재활 콘텐츠가 검색되고, 검색된 재활 콘텐츠 중에서 재활 장치에 적용될 재활 콘텐 츠가 선택되고 전송될 수 있다. 재활 장치 또는 사용자는 의사 진단에 의한 재활 훈련을 수행하며 훈련 수행 정 보에 따른 재활 콘텐츠 대응을 통한 재활 훈련을 수행할 수 있다. 도 8은 본 발명의 관리 방법을 나타낸 흐름도이다. 도 8은 도 1에 도시된 관리 장치의 동작으로 설명될 수 있다. 다시 말해, 본 발명의 관리 방법은 관리 장치에 의해 수행될 수 있다. 도 8에 도시된 관리 방법은 획득 단계(S 510), 분류 단계(S 520), 매칭 단계(S 530)를 포함할 수 있다. 획득 단계(S 510)는 복수의 재활 훈련 콘텐츠와 관련된 제1 정보를 획득할 수 있다. 획득 단계(S 510)는 복수의 재활 장치로부터 서로 구분되는 제2 정보를 획득할 수 있다. 획득 단계(S 510)는 제1 획득부 및 제2 획득 부에 의해 수행될 수 있다. 제1 정보의 획득 시점과 제2 정보의 획득 시점은 동일하거나 서로 다를 수 있 다. 각 획득 시점의 선후 관계도 뒤바뀔 수 있다. 분류 단계(S 520)는 제1 정보의 종류를 이용해서 재활 훈련 콘텐츠를 분류할 수 있다. 분류 단계(S 520)는 제2 정보의 종류를 이용해서 재활 장치를 분류할 수 있다. 분류 단계(S 520)는 관리부에 의해 수행될 수 있다. 매칭 단계(S 530)는 서로 동일한 분류 체계를 갖는 제1 정보와 제2 정보의 분류 결과를 이용해서 특정 재활 훈 련 콘텐츠와 특정 재활 장치를 매칭시킬 수 있다. 매칭 단계(S 530)는 관리부에 의해 수행될 수 있다. 일 예로, 관리부는 서로 동일한 종류로 분류된 제1 정보와 제2 정보와 관련된 재활 훈련 콘텐츠와 재활 장치 를 서로 연계시킬 수 있다. 재활 훈련 콘텐츠의 입장에선 연계된 재활 장치에 한정해서 제공될 수 있다. 재활 장치의 입장에선 연계된 재활 훈련 콘텐츠에 대한 정보만 제공받을 수 있다. 미연계된 재활 훈련 콘텐츠는 해당 재활 장치에서 정상 동작이 불가능하므로, 재활 장치에 대한 관련 자료의 제공이 불필요하다. 도 9는 본 발명의 실시예에 따른, 컴퓨팅 장치를 나타내는 도면이다. 도 9의 컴퓨팅 장치(TN100)는 본 명세서 에서 기술된 장치(예, 관리 장치 등) 일 수 있다. 도 9의 실시예에서, 컴퓨팅 장치(TN100)는 적어도 하나의 프로세서(TN110), 송수신 장치(TN120), 및 메모리 (TN130)를 포함할 수 있다. 또한, 컴퓨팅 장치(TN100)는 저장 장치(TN140), 입력 인터페이스 장치(TN150), 출 력 인터페이스 장치(TN160) 등을 더 포함할 수 있다. 컴퓨팅 장치(TN100)에 포함된 구성 요소들은 버스 (bus)(TN170)에 의해 연결되어 서로 통신을 수행할 수 있다. 프로세서(TN110)는 메모리(TN130) 및 저장 장치(TN140) 중에서 적어도 하나에 저장된 프로그램 명령(program command)을 실행할 수 있다. 프로세서(TN110)는 중앙 처리 장치(CPU: central processing unit), 그래픽 처리 장치(GPU: graphics processing unit), 또는 본 발명의 실시예에 따른 방법들이 수행되는 전용의 프로세서를 의 미할 수 있다. 프로세서(TN110)는 본 발명의 실시예와 관련하여 기술된 절차, 기능, 및 방법 등을 구현하도록 구성될 수 있다. 프로세서(TN110)는 컴퓨팅 장치(TN100)의 각 구성 요소를 제어할 수 있다. 메모리(TN130) 및 저장 장치(TN140) 각각은 프로세서(TN110)의 동작과 관련된 다양한 정보를 저장할 수 있다. 메모리(TN130) 및 저장 장치(TN140) 각각은 휘발성 저장 매체 및 비휘발성 저장 매체 중에서 적어도 하나로 구 성될 수 있다. 예를 들어, 메모리(TN130)는 읽기 전용 메모리(ROM: read only memory) 및 랜덤 액세스 메모리 (RAM: random access memory) 중에서 적어도 하나로 구성될 수 있다. 송수신 장치(TN120)는 유선 신호 또는 무선 신호를 송신 또는 수신할 수 있다. 송수신 장치(TN120)는 네트워크 에 연결되어 통신을 수행할 수 있다. 한편, 본 발명의 실시예는 지금까지 설명한 장치 및/또는 방법을 통해서만 구현되는 것은 아니며, 본 발명의 실 시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있으며, 이러한 구현은 상술한 실시예의 기재로부터 본 발명이 속하는 기술 분야의 통상의 기술자라면 쉽게 구 현할 수 있는 것이다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 통상의 기술자의 여러 변형 및 개량 형태 또 한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2019-0106447", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 관리 장치를 나타낸 블록도이다. 도 2는 재활 장치의 종류를 나타낸 개략도이다. 도 3은 관리부의 동작을 나타낸 개략도이다. 도 4는 본 발명의 관리 장치의 동작을 나타낸 흐름도이다. 도 5는 재활 장치에 표시되는 재활 훈련 콘텐츠의 리스트를 나타낸 개략도이다. 도 6은 하드웨어 독립적인 재활 훈련 소프트웨어 프레임 워크 시스템을 나타낸 개략도이다. 도 7은 재활 훈련 소프트웨어 프레임 워크 시스템의 동작을 나타낸 흐름도이다. 도 8은 본 발명의 관리 방법을 나타낸 흐름도이다. 도 9는 본 발명의 실시예에 따른, 컴퓨팅 장치를 나타내는 도면이다."}
