{"patent_id": "10-2023-7002506", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0028469", "출원번호": "10-2023-7002506", "발명의 명칭": "트레이닝된 인공 지능 기반 프로세싱을 통한 비파괴 테스트", "출원인": "일리노이즈 툴 워크스 인코포레이티드", "발명자": "스완텍 앤드류"}}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비파괴 테스트(NDT, non-destructive testing)에 사용하기 위한 시스템에 있어서,물품의 비파괴 테스트(NDT) 검사 동안 상기 물품의 스캔을 획득하도록 구성되는 스캐너; 및하나 이상의 회로 ― 상기 하나 이상의 회로는:상기 물품의 획득된 스캔(scan)에 기초하여 상기 물품 내의 가능한 이상(anomaly)들을 식별하고;상기 물품과 관련된 검사 관련 피드백을 생성하도록구성되며, 상기 검사 관련 피드백은 각각의 식별된 가능한 이상에 대응하는 이상의 표시를 포함함 ―를 포함하며,상기 가능한 이상들을 식별하는 단계는 상기 물품의 획득된 스캔에 대한 분석에 기초하여 적응형 학습 알고리즘을 적용하는 단계를 포함하고,상기 분석에 기초한 적응형 학습 알고리즘은 참조 스캔들을 사용하지 않고 적용을 위해 구성되는 것인, 비파괴테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 분석에 기초한 적응형 학습 알고리즘은 컨볼루션 신경망(CNN, convolutional neural network)의 사용을 포함하고, 상기 하나 이상의 회로는 상기 컨볼루션 신경망(CNN)을 구현하도록 구성되는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 하나 이상의 회로는 스캔 향상 프로세싱을 수행하지 않고 상기 분석에 기초한 적응형 학습 알고리즘을 적용하도록 구성되는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 하나 이상의 회로는 상기 획득된 스캔을 원격 시스템에 송신하도록 구성되고, 상기 원격 시스템은 상기 분석에 기초한 적응형 학습 알고리즘을 구현 및/또는 조정하기 위한 정보를 생성하도록 구성되는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 하나 이상의 회로는 원격 시스템으로부터 상기 분석에 기초한 적응형 학습 알고리즘을 구현하기 위한 또는조정하기 위한 또는 구현 및 조정하기 위한 제어 정보를 획득하도록 구성되는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 하나 이상의 회로는 상기 원격 시스템으로부터 상기 제어 정보를 주기적으로 획득하도록 구성되는 것인,공개특허 10-2023-0028469-3-비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 스캐너는 시각적 스캐닝 디바이스를 포함하고, 상기 스캔은 시각적 스캔을 포함하는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 시각적 스캐닝 디바이스는 카메라를 포함하고, 상기 시각적 스캔은 상기 물품의 이미지를 포함하는 것인,비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 비파괴 테스트(NDT) 검사 동안 상기 시스템의 조작자에게 검사 관련 피드백을 제공하도록 구성되는 피드백컴포넌트를 포함하는, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 피드백 컴포넌트는 시각적 출력 디바이스를 포함하는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 피드백 컴포넌트는 가청(audible) 출력 디바이스를 포함하는 것인, 비파괴 테스트(NDT)에 사용하기 위한시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 시스템은 침투 탐상 검사(LPI, liquid penetrant inspection)를 수행하도록 구성되는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 시스템은 자기 탐상 검사(MPI, magnetic particle inspection)를 수행하도록 구성되는 것인, 비파괴 테스트(NDT)에 사용하기 위한 시스템."}
{"patent_id": "10-2023-7002506", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "트레이닝된 인공 지능 기반 프로세싱을 통한 비파괴 테스트(NDT, non-destructive testing)를 위한 시스템들 및 방법들이 제공된다."}
{"patent_id": "10-2023-7002506", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "우선권 주장 이 특허 출원은 2020년 6월 26일자로 출원된 미국 가특허 출원 번호 제63/044,476 및 2021년 6월 17일자로 출원 된 미국 특허 출원 번호 제17/350,536를 참조하고 우선권을 주장하며 그로부터 이익을 주장한다. 상기 식별된 출원들은 이로써 전체가 참조로 본 명세서에 포함된다."}
{"patent_id": "10-2023-7002506", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "비파괴 테스트(NDT, non-destructive testing)는 테스트된 항목을 손상시키거나 변경하지 않고 재료, 컴포넌트 들 및/또는 시스템들의 특성들 및/또는 특성들을 평가하는 데 사용된다. 비파괴 테스트는 검사되고 있는 물품을 영구적으로 변경하지 않기 때문에, 제품 평가, 문제 해결 및 연구를 위해 사용될 때 비용 및/또는 시간을 절약 하는 것을 허용하는 고도로 유용한 기법이다. 자주 사용되는 비파괴 테스트 방법들은 자기 탐상 검사들, 와전류 테스트, 침투 탐상 검사(또는 염색 침투 탐상 검사), 방사선 검사, 초음파 테스트, 및 시각적 테스트를 포함한 다. 비파괴 테스트(NDT)는 일반적으로 기계 공학, 석유 공학, 전기 공학, 시스템 공학, 항공 공학, 의학, 예술 등과 같은 분야들에서 사용된다. 도면들을 참조하여 이 명세서의 나머지 부분에 설명된 방법들 및 시스템들의 몇몇 양상들과 그러한 접근법들의 비교를 통해 종래 접근법들의 한계들 및 단점들은 당업자들에게 명백해질 것이다. 본 개시물의 양상들은 제품 테스트 및 검사에 관한 것이다. 보다 구체적으로, 본 개시물에 따른 다양한 구현들 은 실질적으로 적어도 하나의 도면에 의해 예시되거나 설명된 바와 같이 그리고 청구범위에 보다 완전하게 기재 된 바와 같이, 트레이닝된 인공 지능 기반 프로세싱을 이용한 비파괴 테스트(NDT)를 위한 방법들 및 시스템들에 관한 것이다. 본 개시물의 이들 및 다른 이점들, 양상들 및 신규 피처들 뿐만 아니라 그의 예시된 구현의 세부사항들은 다음 의 설명 및 도면들로부터 더욱 완전히 이해될 것이다."}
{"patent_id": "10-2023-7002506", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시물에 따른 다양한 구현들은 특히 트레이닝된 인공 지능 기반 프로세싱으로 비파괴 테스트(NDT) 기반 셋 업들을 구현하고 동작시킴으로써, 향상되고 최적화된 비파괴 테스트(NDT) 검사들을 제공하는 것에 관한 것이다. 이와 관련하여, 상기 언급된 바와 같이, 비파괴적 테스트(NDT, non-destructive testing)는 테스트된 항목을 손 상시키거나 변경하지 않고 재료, 컴포넌트들 및/또는 시스템들의 특성들 및/또는 특성들을 평가하는 데 사용된 다. 경우에 따라 비파괴 테스트를 수행하기 위해 전용 재료 및/또는 제품들이 필요하거나 사용될 수 있다. 예를 들어, 특정 타입의 물품들에 대한 비파괴 테스트는 비파괴 테스트의 수행을 용이하게 하도록 구성되는 검사될 물품 또는 부품 재료에의 적용(예를 들어, 분무, 붓기, 통과 등에 의한)을 수반할 수 있다. 이러한 재료(이하 \"NDT 재료\"로 지칭됨)는 비파괴 테스트에 적합한 특정 특성들(예를 들어, 자기적, 시각적 등) - 비파괴 테스트 (NDT) 동안 검사된 물품의 결함들, 불규칙성들 및/또는 불완전성들(이하 \"이상\"으로 총칭됨) - 을 갖거나 나타 낼 수 있다. 비파괴 테스트(NDT)는 이상들이 검출될 수 있는 방식과 관련하여 상이한 방식으로 수행될 수 있다. 예를 들어, 몇몇 경우에는 NDT 기반 검사들이 시각적으로 수행된다 - 즉, 검사된 물품들을 시각적으로 검사함으로써 이상들 의 검출이 수행된다. 이러한 시각적 기반 NDT는 적합한 NDT 재료를 사용하여 가능할(또는 향상될) 수 있다. 예 를 들어, 이러한 NDT 재료를 적용하면 특히 NDT 재료의 특정 특성들에 기초하여 검사된 물품들의 임의의 이상들 을 보다 쉽게 검출되게 할 수 있다. 예를 들어 색상 콘트라스트 또는 일부 광 관련 동작에 기초하여 이상들이 시각적으로 식별될 수 있다. 몇몇 경우에는 주변 광이 이러한 시각적 검사들에 사용될 수 있다 - 즉, 사용자들은 NDT 재료를 적용한 후와 같 이 조명이 밝은(well-lit) 영역에서 물품을 단순히 시각적으로 검사할 수 있다. 대안적으로 또는 추가적으로, NDT 검사를 수행하는 데 사용되는 시스템 또는 셋업 내에서 광원(예를 들어, 특수 램프)가 사용될 수 있다. 이 와 관련하여 이러한 광원은 검사들을 수행하기 위한 특정 기준들을 충족하는 광을 제공할 수 있다. 그러나 비파괴 테스트(NDT)는 약간의 도전과제들을 부과할 수 있고 그리고/또는 일부 제한들을 가질 수 있다. 예를 들어, 몇몇 경우에 NDT는 이상들이 존재하는지 여부를 (특히 초기에) 결정하는 것과 같이 검사된 물품을 평가할 때 복잡한 프로세싱을 수반할 수 있다. 이것은 특히 시각적 데이터(예를 들어, 이미지들)의 캡처 및 프로세싱에 기초하는 검사 솔루션들의 경우일 수 있다. 본 명세서에서 사용되는 \"회로들\" 및 \"회로부(circuitry)\"라는 용어는 물리적 전자 컴포넌트들(예를 들어, 하드 웨어), 및 하드웨어를 구성할 수 있는 하드웨어에 의해 실행될 수 있는 또는 그렇지 않으면 하드웨어와 연관될 수 있는 임의의 소프트웨어 및/또는 펌웨어(\"코드\")를 지칭한다. 본 명세서에서 사용되는 바와 같이, 예를 들어, 특정 프로세서 및 메모리(예를 들어, 휘발성 또는 비휘발성 메모리 디바이스, 일반 컴퓨터 판독 가능 매 체 등)는 제1 하나 이상의 코드 라인을 실행할 때 제1 \"회로\"를 포함할 수 있고, 제2 하나 이상의 코드 라인을 실행할 때 제2 \"회로\"를 포함할 수 있다. 부가적으로, 회로는 아날로그 및/또는 디지털 회로부를 포함할 수 있 다. 이러한 회로는 예를 들어 아날로그 및/또는 디지털 신호에서 동작할 수 있다. 회로는 단일 디바이스 또는 칩에, 단일 마더보드 상에, 단일 섀시에, 단일 지리적 위치에 있는 복수의 인클로저들에, 복수의 지리적 위치들 에 걸쳐 분산된 복수의 인클로저들 내 등에 있을 수 있음을 이해해야 한다. 유사하게, 용어 \"모듈\"은 예를 들어 하드웨어를 구성할 수 있고 하드웨어에 의해 실행될 수 있고 그렇지 않으면 하드웨어와 연관될 수 있는 물리적 전자 컴포넌트들(예를 들어, 하드웨어) 및 임의의 소프트웨어 및/또는 펌웨어(\"코드\")를 지칭할 수 있다. 본 명세서에서 이용되는 바와 같이, 회로부 또는 모듈은 기능의 수행이 (예를 들어, 사용자-구성가능 설정, 공 장 트림(factory trim) 등에 의해) 디스에이블되는 또는 인에이블되지 않는지 여부에 관계없이, 회로부 또는 모 듈이 기능을 수행하기 위해 필요한 하드웨어 및 코드(필요한 경우)를 포함할 때마다 기능을 수행하도록 \"동작가 능\"하다. 본 명세서에서 사용되는 바와 같이, \"및/또는\"은 \"및/또는\"에 의해 결합된 목록의 항목들 중 임의의 하나 이상 을 의미한다. 예를 들어, \"x 및/또는 y\"는 3개 요소 집합 {(x), (y), (x, y)}의 임의의 요소를 의미한다. 즉, \"x 및/또는 y\"는 \"x 및 y 중 하나 또는 둘 모두\"를 의미한다. 또 다른 예로서 \"x, y 및/또는 z\"는 7개 요소 집 합 {(x), (y), (z), (x, y), (x, z), (y , z), (x, y, z)}의 임의의 요소를 의미한다. 즉, \"x, y 및/또는 z\"는 \"x, y 및 z 중 하나 이상\"을 의미한다. 본 명세서에서 사용되는 바와 같이, 용어 \"예시적인\"은 비제한적인 예, 실례 또는 예시의 역할을 하는 것을 의미한다. 본 명세서에서 사용되는 바와 같이, 용어 \"예를 들어\"는 하나 이 상의 비제한적인 예, 실례 또는 예시의 목록들을 설정한다. 도 1은 예시적인 시각 기반 비파괴 테스트(NDT) 검사 셋업을 예시한다. 시각 기반 NDT 검사들을 수행하는데 사 용될 수 있는 비파괴 테스트(NDT) 셋업이 도 1에 도시되어 있다. NDT 셋업은 특정 NDT 검사 방법 및/또는 기법들에 따라 물품들(예를 들어, 기계 부품들 등)의 비파괴 테스 트(NDT) 검사를 위해 구성된 다양한 컴포넌트들을 포함할 수 있다. 구체적으로, NDT 셋업은 시각 기반 NDT 검사들을 위해 구성될 수 있다. 이와 관련하여 시각 기반 NDT 검사들에서, 검사된 물품들의 이상들은 시각적으 로, 즉 물품의 시각적 검사에 의해 검출될 수 있다. 따라서 시각 기반 NDT 검사들은 특정 조명 조건들의 사용을 수반할 수 있다. 이와 관련하여, 일부 시각 기반 NDT 검사들은 가시광선(예를 들어, 백색) 파장들을 사용하여 수행될 수 있지만, 몇몇 경우들에는 다른 파장들(예를 들어, 자외선(UV), X선 등)이 사용될 수 있다. 따라서, 몇몇 경우들에는 주 변 광을 사용하여 시각 기반 NDT 검사들이 수행될 수 있다. 그러나, 다른 경우에, 검사된 물품들에 광을 투사하 도록 구성된 전용 광원 또는 복사원이 검사 셋업에서 사용될 수 있다. 예를 들어, 특별히 설계된 광원들(예를 들어, 램프들 등)은 특정 방식으로 광을 방출하도록 구성된 검사 셋업들에 통합될 수 있다. 방출된 광은 가시 (예를 들어, 백색) 광, 광 및/또는 다른 파장의 복사선(예를 들어, 자외선(UV) 광, X선 복사선), 또는 이들의 임의의 조합일 수 있다. 몇몇 경우에, 시각 기반 NDT 검사들은 검사 대상 물품들에 적용되는 NDT 재료의 사용을 수반할 수 있다. 이와 관련하여, 이상들은 예를 들어 적용된 NDT 재료에 의해 야기되거나 강화될 수 있는 색상 콘트라스트 또는 다른 조명 관련 동작에 기초하여 시각적으로 식별될 수 있다. 다양한 시각 기반 NDT 검사 기법들이 사용된다. 2개 주요 기법들은 \"자기 탐상 검사\"(MPI, magnetic particle inspection) 기법과 \"침투 탐상 검사\"(LPI, liquid penetrant inspection) 기법이며, MPI 기법은 전형적으로 철 재료에 사용되며 LPI 기술은 일반적으로 비철 재료(예를 들어, 알루미늄, 황동 등)에 사용된다. 2개 기법들 모두 목표는 물품이 시각적으로 검사될 때(예를 들어, 광원 아래에서) 이상들을 볼 수 있도록 하는 것이다. 따 라서, 다양한 구현들에서 NDT 셋업은 MPI 기반 검사들 및/또는 LPI 기반 검사들을 수행하도록 구성될 수 있다. 도 1에 도시된 예시적인 구현에 도시된 바와 같이, NDT 셋업은 NDT 셋업을 사용하는 NDT 검사들 동안 특정 물품(예를 들어, 기계 부품)을 고정하도록 구성될 수 있는 홀더들을 포함한다. 이와 관련하여, 물품은 특정 방식으로 배치 - 예를 들어 홀더들을 사용하여 특정 위치에 고정 - 되어, 특정 기법에 따라 검사될 수 있다. 예를 들어, 도 1에 도시되지는 않았지만, NDT 셋업은 예컨대 바싱(bathing) 기법(예 를 들어, NDT 셋업은 습식 벤치 기반 셋업임)을 사용하여 자기 탐상 검사(MPI)를 위해 또는 침투 탐상 검 사(LPI)를 위해 구성될 수 있다. NDT 셋업은 또한 특정 물품(예를 들어, 기계 부품)을 검사할 때와 같이 시각 기반 NDT 검사들을 수행 할 때 사용자를 보조하는 데 사용될 수 있는 비전 시스템을 포함한다. 비전 시스템은 검사 동안 검사 되는 물품의 시각적 스캔을 얻고 대응하는 스캐닝 데이터를 생성하기 위한 적합한 하드웨어(회로부 포함)를 포 함할 수 있다. 이와 관련하여, 비전 시스템은 향상된 이상 검출을 위해 구성된 - 예를 들어, 사용자가 검 사된 물품에서 이상을 정확하게 식별하는 데 도움을 주는, (옵션적으로) 예컨대 관련 피드백을 제공하는 것, 자 율적 시정 조치들을 취하는 것 등과 같이 향상된 검출을 보장하기 위해 사용자에게 추가 액션들을 취하거나 트 리거링하는 전용 비전 장비를 포함할 수 있다. 예시적인 구현에서, 비전 시스템은 검사 동안 검사된 물품의 스틸 사진들 또는 비디오를 획득하도록 구성 되는 카메라를 포함하고, 그러한 스캐닝 데이터는 사진 또는 비디오 데이터를 포함할 수 있다. 일단 획득되면, 스캐닝 데이터는 예컨대 관심 있는 이상의 식별에 관련된 정보를 획득하기 위해 및/또는 시각적 검사의 신뢰성 및 성능을 향상시키기 위해 프로세싱될 수 있다. 이와 관련하여 위에서 설명한 바와 같이, NDT 셋업들에서 시각 적 검사들을 수행하기 위한 기존의 접근법들은 특히 놓친 이상들 및/또는 거짓 네거티브(false negative)들과 관련하여 신뢰성 및 정확성 관련 문제들을 겪을 수 있다. 이는 조명 조건들과 관련된 문제들, 셋업 문제들, 작 동자 에러들(예를 들어, 특정 물품들에 대한 친숙성 부족 및/또는 이상들에 대응하는 예상 동작으로 인한) 때문 일 수 있다. 비전 시스템은 고정 컴포넌트일 수 있다. 이와 관련하여, 비전 시스템은 검사 표면 위 또는 홀더들 위와 같이 NDT 셋업에 영구적으로 고정(예를 들어, 다른 컴포넌트들 중 하나에 부착)될 수 있다. 그 러나 다른 구현들에서, 비전 시스템은 이동가능 및/또는 조정가능하여, NDT 셋업 내에서의 그 위치의 임시 배치 및/또는 조정을 가능하게 할 수 있다. 예를 들어, 비전 시스템은 NDT 셋업의 특정 지점들에의 부착을 가능하게 할 수 있도록 부착 엘리먼트 (예를 들어, 클립형 컴포넌트)를 포함할 수 있다. 이는 예컨대 사용자 선호도에 기초하여 (예를 들어, 센서가 검사를 방해하지 않도록 보장하기 위해), 검사를 최적화하기 위해(예를 들어, 검사되고 있는 물품, 검사 파라미 터들 등에 기초하여), 등의 이유로 NDT 셋업 내에 비전 시스템을 배치 및/또는 위치설정하는 장소 및 방법을 결정하는 데 있어서 사용자에게 약간의 유연성을 허용할 수 있다. NDT 셋업은 또한 광원(들)을 포함할 수 있으며, 이는 검사고 있는 물품들 상에 광을 방출 및/또는 투 사하도록 구성될 수 있다. 광원(들)은 특정 타입의, 특정 특성들을 갖는 그리고/또는 특정 방식으로 광을 생성 및 방출하도록 구성될 수 있다. 예를 들어, 광원(들)은 백색 광 및/또는 자외선(UV) 광을 방출하고 방출된 광을 대부분 검사 부품를 고정하는 데 사용되는 홀딩 구조물 상으로 아래쪽으로 투사하도록 구성될 수 있다. 또한, 도 1에 도시되지는 않았지만, 전용 광원들(예를 들어, NDT 셋업 내의 도 1의 광원(들))을 사용 할 때와 같이, 성능을 향상시키기 위해(예를 들어, 이상들을 검출하는 능력을 향상시키기 위해) 몇몇 경우에 검 사 인클로저가 사용될 수 있다. 이와 관련하여 검사 인클로저는 예컨대 주변 광을 차단하거나 다른 방식으로 제 한함으로써 검사를 위한 적합한 및/또는 일관된 조명 환경을 제공하는 데 사용될 수 있다. 이것은 예를 들어 주 변 광을 차단하여 NDT 셋업 내의 대부분의 광이 내부에서 사용되는 광원들로부터 나오는 것임을 보장함으 로써 조명 조건들을 제어하기 위해 수행될 수 있으므로, 검사들을 위해 제어된 조명 환경을 허용한다. 이러한 검사 인클로저는 예를 들어, 텐트형 구조 또는 충분한 차광을 제공하는 임의의 다른 구조일 수 있다. 또한 검사 인클로저는 예를 들어, 사용자의 선호도, 주변 공간 등에 기초하여 조정가능할 수 있다. NDT 셋업은 또한 NDT 셋업 및 그 다양한 컴포넌트들을 제어하도록 구성된 제어기 유닛을 포함할 수 있으며, 특히 셋업을 사용하여 NDT 검사들의 수행을 용이하게 한다. 예를 들어, 제어기 유닛은 검사를 수행하는 것과 관련된 데이터(예를 들어, 미리 저장된 데이터, 검사 동안 획득된 데이터 등)의 프로세싱을 위한 그리고/또는 검사들(예를 들어, 데이터의 프로세싱에 기초) 동안 다양한 액션들 수행 및/또는 제어하기 위한 적 합한 회로부를 포함할 수 있다. 제어기는 또한 키패드(또는 이와 유사한 것), 스크린 또는 디스플레이 등과 같은 입력 및/또는 출력 컴포넌트들을 통합할 수 있다. 이와 관련하여, 디스플레이는 (예컨대,획득된 센서 데이터의 프로세싱에 기초하여) 검사를 수행하는 동안 결정된 정보를 포함하여, 검사들과 관련된 정보를 디스플레이하는 데 사용될 수 있다. 예를 들어, 디스플레이는 임의의 검출된 표시들 및/또는 대응 하는 식별된 이상들에 관한 정보(예를 들어, 상기 설명된 바와 같은 경보들 및/또는 피드백 데이터)를 디스플레 이하는 데 사용될 수 있다. 그러나, 개시물은 그에 제한되지 않으며, 이와 같이 다른 조합 또는 변형들이 지원 될 수 있다. 예를 들어, \"제어기\"는 이미 포함된 제어기 회로부(예를 들어, 광원(들)을 위한 제어기 회로 부)를 포함할 수 있으며, 이는 일부 필요한 프로세싱 기능들을 수행하도록 구성될 수 있다. 또한, 몇몇 경우에, 프로세싱의 적어도 일부는 비전 시스템 중 적어도 하나 내에서 수행될 수 있다. 예를 들어, 스캐닝 데이터의 프로세싱은 예컨대 특정 식별 기준에 기초하여 검사된 물품에서 가능한 이상들(예 를 들어, 도 1에 도시된 바와 같은 이상)의 특정 표시들을 식별하는 것을 가능하게 하도록 구성될 수 있다. 이와 관련하여, 각각의 표시는 해당 영역 내의 이상 또는 표시를 나타낼 수 있는 특정 특성들(예를 들어, 특정 색상 또는 그 변형)을 나타내는 검사된 물품 상의 영역에 대응할 수 있다. 식별된 표시들은 그 후 평가되 어 실제 이상들(또는 허용할 수 없는 이상들)에 대응하는지 여부를 결정할 수 있다. 이와 관련하여, 각각의 표 시는 검사되고 있는 특정 물품과 연관된 허용 기준에 기초하여 평가될 수 있다. 허용 기준은 예컨대, 어느 물품 이 거부될 수 있는지(또는 그렇지 않으면 허용되지 않는 것으로 간주되는지)에 기초하여 이상들을 구성하는 적 용가능한 문턱치들을 규정하는 것에 의해 각각의 이상이 허용되는지 여부를 규정할 수 있다. 이와 관련하여, 상 이한 식별 기준 및/또는 허용 기준은 예컨대, 상이한 물품들(예를 들어, 상이한 타입의 물품들, 상이한 부품들, 상이한 제품들 등) 및/또는 상이한 조작자들(예를 들어, 상이한 선호도들)에 대해 규정될 수 있다. 또한 식별 기준은 사용자 정의되거나, 시스템 정의되거나, AI 정의되거나, 기본값이거나, 또는 이들의 일부 조합일 수 있 다. 그러나 시각적 검사들은 몇몇 도전과제들을 가질 수 있다. 예를 들어, 시스템(예를 들어, 비전 시스템 및 제어기 유닛)에 의한 이상들의 검출을 처리하는 것은 모든 이상들의 정확한 검출을 보장하기 위해 많은 복 잡성(및 리소스들)을 요구할 수 있다. 시스템이 이상들의 검출을 완전히 처리했다면 이는 훨씬 더 시급할 수 있 다(그리고 결과적으로 훨씬 더 복잡하고 더 많은 시간이 필요함). 따라서 이상들의 검출을 최적화하기 위해 시 스템(및 이에 의해 수행되는 동작들)의 복잡성을 줄이는 것이 바람직할 수 있지만, 이러한 검출의 정확성 또는 신뢰성에는 영향을 미치지 않는다. 본 개시물에 따른 구현들에서, 이는 인공 지능 기반 기법들을 사용하여, 특히 검사 동안 검출의 정확도를 유지 (심지어 향상)시키면서 이상들의 검출 동안 필요한 프로세싱의 복잡성을 크게 줄이는 방식으로 수행될 수 있다. 특정한 예시적인 구현이 도 2와 관련하여 설명된다. 도 2는 본 개시물에 따른 트레이닝된 인공 지능 기반 프로세싱을 갖는 예시적인 시각 기반 비파괴 테스트(NDT) 검사 설정을 예시한다. 시각 기반 NDT 검사들을 수행하는데 사용될 수 있는 비파괴 테스트(NDT) 셋업이 도 2에 도시되어 있다. NDT 셋업은 도 1의 NDT 셋업과 실질적으로 유사할 수 있고, 따라서 실질적으로 특정 방식으로 배치될 수 있는 - 예컨대, 지지/보유 구조를 사용하여 특정 위치에 고정되는 - 테스트 물품과 같은 물품들(예를 들어, 기계 부품)의 시각적 검사를 지원하도록 구성된 시각적 시스템(예를 들어, 카메라)을 포함하여, 이 는 특정 검사 기법(예를 들어, 자기 탐상 검사(MPI) 기법 또는 침투 탐상 검사(LPI)에 기초)에 따라 검사될 수 있다. 또한, 광원들은 특히 특정 조명 조건들(예를 들어, 특정 타입, 강도 등)이 필요할 수 있는 검사 동 안 조명을 제공하는 데 사용될 수 있다. 시각적 시스템을 통해 획득된 센서 시각적 데이터(예를 들어, 이미지들)는 테스트 물품에서 임의의 가능한 이상들의 식별을 위해 프로세싱될 수 있다. 이는 도 1의 제어 유닛과 실질적으로 유사할 수 있는 로컬 제어 유닛을 통해 행해질 수 있다. 예를 들어, 제어 유닛은 카메라를 통해 캡처된 이미지 들을 수신하고 이미지들을 프로세싱하도록, 예컨대 테스트 물품에 이상들이 있는지 여부를 결정하도록 구 성될 수 있는 컴퓨터를 포함할 수 있다. 컴퓨터는 결정(예를 들어, 이상 없음 표시 또는 이상 표시)에 기초하여 피드백을 생성하도록 구성될 수 있다. 이와 관련하여, 생성된 피드백은 초기 평사의 역 할을 할 수 있고, 조작자는 검사를 실시하고 그 후 (예를 들어, 비정상의 표시가 생성될 때) 테스트 물품 에 대한 보다 상세하고 주의 깊은 검사를 수행한다. 생성된 표시들은 시각적, 청각적 등일 수 있다. 예를 들어, 도 1의 NDT 셋업에서와 같이, NDT 셋업은 또한 이상 없음 표시 및 이상 표시를 시각 적으로 제공하는 데 사용될 수 있는 디스플레이 또는 스크린(미도시)을 통합할 수 있다. 본 개시물에 따르면, 특히 이미징 관련 프로세싱과 관련하여 검사들 동안 성능을 향상 및/또는 최적화시키는 데 학습 기법들이 사용될 수 있다. 예를 들어, 제어 유닛(및/또는 컴퓨터와 같은 그 컴포넌트들)은 예를 들어, 심층 신경망들(예를 들어, 도 2에 도시된 바와 같은 컨볼루션 신경망(CNN, convolutional neural network))을 사용함으로써 심층 학습 기법들 및/또는 알고리즘들을 구현 및/또는 사용하도록 구성될 수 있 고, 그리고/또는 임의의 적절한 형태의 인공 지능 이미지 분석 기법들 또는 머신 러닝 프로세싱 기능을 활용할 수 있으며, 이는 캡처된 이미지들을 분석하도록, 예컨대 검사된 테스트 물품들에서 가능한 이상들을 식별하도록 구성될 수 있다. 몇몇 경우에, NDT 셋업에 사용되는 심층 신경망들(예를 들어, CNN)은 가능한 이상들 을 식별하는 데 도움이 되도록 이미지들의 분석 동안 모델들을 활용할 수 있다. 이와 관련하여 이들 모델들은 검사된 테스트 물품들에 존재할 수 있는 특정 이상들(또는 그 타입들)에 대응하는 특정 특성들을 규정하거나 설 명할 수 있다. 본 개시물에 따르면, 인공 지능 기반 이미지 분석(모델들 및/또는 모델의 후속 개정들의 생성)과 함께 사용되는 모델들의 트레이닝은 원격 중앙 시스템들(예를 들어, 도 2에 예시된 원격 시스템)에서 수행될 수 있다. 원 격 시스템은 적합한 회로부 - 예를 들어 통신 회로부(예를 들어, 통신 동작을 용이하게 하기 위한, 예컨대 인터넷 연결들을 통해, 예를 들어 적합한 통신 매체, 인터페이스들 및/또는 네트워크들을 사용하여 NDT 셋업들 과 통신하기 위한), 프로세싱 회로부(예를 들어, 이미지들의 프로세싱, 모델들의 생성 및 업데이트 등과 같은 필요한 프로세싱 기능들을 수행하기 위한), 저장 회로부(예를 들어, 저장 기능들을 수행하기 위한) 등 - 를 포 함할 수 있다. 원격 시스템은 NDT 셋업들에서 캡처된 이미지들을 수신하고 이들 이미지들을 저장하도록(예를 들어, 내부 에 구현된 원격 이미지 저장 모듈에) 구성될 수 있다. 이와 관련하여, 원격 이미지 저장 모듈은 (예 를 들어, 소스에 기초하여) 이미지들을 저장하기 위해 그리고/또는 그에 기초하여 생성된 데이터베이스들을 유 지하기 위해 구성될 수 있다. 또한, 원격 시스템은 (예를 들어, 내부에 구현된 모델 트레이닝 및 검증 모 듈을 통해) 모델들을 생성하고 업데이트하도록 구성될 수 있다. 이와 관련하여, 모델 트레이닝 및 검증 모 듈은 딥 러닝에 사용되는 모델들(예를 들어, 컨볼루션 신경망(CNN)(예를 들어, NDT 셋업의 CNN(23 4))과 같은 심층 신경망용 모델들)을 트레이닝하도록 구성되는 적합한 회로부를 포함할 수 있다. 모델들은 예를 들어, 특히 테스트 물품들의 이미지들의 프로세싱 동안 식별될 수 있는, 특정 테스트 물품들(또 는 그 타입들)에 대한 특정 이상들(또는 그 타입들)과 연관된 특정 구조들, 피처들 및/또는 특성들을 식별하도 록 트레이닝될 수 있다. 모델들은 NDT 셋업들(예를 들어, NDT 셋업)에 제공될 수 있고 시각적 검사들을 수 행할 때 사용하기 위해 미리 트레이닝된 딥 러닝 컴포넌트들(예를 들어, CNN)에 사용될 수 있다. 예시적인 사용 시나리오에서, 카메라는 검사에 앞서 자기 탐상 또는 액체 침투 탐상 프로세스의 모든 단계 들을 거친 테스트 물품의 이미지를 캡처한다. 캡처된 이미지는 컴퓨터로 송신되고 컴퓨터는 사전 트 레이닝된 컨볼루션 신경망(CNN)을 통해 이미지를 전달한다. 그 후 CNN은 조작자에게 제공되는 표시를 생성할 수 있으며, 이상 표시가 나타나면 조작자에게 통지하고, 이상의 표시가 존재한다면 트레이닝된 조 작자(동일하거나 다른 사람)는 후속적인 보다 주의 깊은 검사를 수행한다. 이미지는 또한 원격 이미지 저장소에 저장하기 위해 원격 시스템으로 송신된다. 원격 이미지 저장소 는 (예를 들어, 추적가능성을 위해) 이미지를 유지한다. 그 후 원격 이미지 저장소에 저장된 이미지 들은 추가 이미지들이 획득됨에 따라 CNN을 재 트레이닝하는 데 사용될 수 있으며, 모델의 정확도를 더욱 증가 시키고 거짓 포지티브(false positive)들 및 거짓 네거티브(false negative)들을 줄인다. 이와 관련하여, 주기 적인 모델 업데이트들이 NDT 셋업들(예를 들어, NDT 셋업)으로 전송되어 내부에서 사용되는 CNN을 지속적 으로 (재)트레이닝할 수 있다. 따라서, 본 개시물에 따른 구현들은 NDT 검사들(예를 들어, MPI 또는 LPI NDT 검사) 동안 이상들의 표시를 제공 하기 위해 컨벌루션 신경망(커스텀 또는 전이 학습으로 구축)의 사용을 허용한다. 또한, 몇몇 구현들에서, NDT 검사 동안 사용되는 CNN은 피처 추출을 위한 컨볼루션 동작들을 수행하는 섹션을 포함할 수 있다. CNN은 또한 완전히 연결되어 분류를 수행하는 섹션을 포함할 수 있다. 본 개시물 및 이에 기초한 구현들은 또한 이미지 데 이터베이스들을 생성하고 유지하는 능력을 허용하고 통합하며, 후속하여 모델 (재)트레이닝을 위해 그리고/또는 인공 지능 기반 이미지 분석 동안 구현 및 사용되는 알고리즘을 업데이트하기 위해 이러한 데이터베이스들을 사 용한다. 본 개시물에 따른 해법들은 종래의 해법들(존재하는 경우)에 비해 다양한 이점들을 갖는다. 예를 들어, (예를 들어, 딥 러닝 신경망들을 통해) 인공 지능 구현을 사용하여 검사들 동안 캡처된 이미지들을 프로세싱하는 본 개시물에 따르면, 종래 해법들의 경우에서와 같이 참조 이미지들의 사용을 수반하거나 요구하지 않는다. 또한,본 개시물에 따르면, 검사 동안 캡처된 이미지들을 프로세싱하는 것은 종래 해법들의 경우와 같이 다양한 이미 징 향상 프로세싱 기능들(예를 들어, 그레이스케일 밸런스, 에지 검출 등)을 수행하는 것을 수반하거나 요구하 지 않는다. 또한, 본 개시물에 따른 구현들은 종래 해법들의 경우에서와 같이 분류 알고리즘들의 사용을 필요로 하지 않는다. 이는 분류 알고리즘이 개발자가 알고리즘에 대한 입력 피처들을, 예를 들어, 검사 시 이상을 검출 하거나 식별하기 위해 기하학적 특성들, 강도 특성들 등을 선택하도록 요구할 수 있으므로 유리할 수 있다. 이와 관련하여, 본 발명에 따른 신경망들(예를 들어, CNN)의 사용은 향상된 성능을 허용하고 최적의 방식(예를 들어, 덜 복잡한, 적은 비용의, 등)으로 그렇게 하는 것을 허용한다. 예를 들어, 상기 설명된 바와 같이, 본 개 시물에 따른 신경망들(예를 들어, CNN)의 사용은 단일 이미지(참조 이미지 없음)의 사용만을 필요로 하고, 어떤 피처들이 중요한지 알고리즘 개발자가 규정할 필요를 제거한다(중요 피처들은 컨볼루션 레이어에서 자동으 로 결정되기 때문에). 또한, 본 개시물에 따른 신경망들(예를 들어, CNN)의 사용은 이미지 잡음에 대한 민 감성이 더 낮고, 많은 애플리케이션들에서 더 강력하다(예를 들어, 상이한 제품들 및/또는 형상에 대한 재트레 이닝을 요구하지 않고; 오히려, 여러 항목에 작용한다). 본 개시물에 따른 신경망들(예를 들어, CNN)의 사용은 또한 이미지 프로세싱의 필요성을 감소시키고, 이는 프로세싱 속도를 증가시킨다(따라서 검사 시간을 감소시킨다). 또한, 본 개시물에 따른 신경망들(예를 들어, CNN)의 사용은 (예를 들어, 카메라 상의) 광학 필터들에 대한 필요성을 감소시키고, 조작자가 육안으 로 검사할 필요성을 감소시킨다(예를 들어, 초기 /베이스라인 시각적 검사 스테이지 제거). 또한, 본 개시물에 따른 신경망들(예를 들어, CNN)의 사용은 더 빠른 실행을 산출할 수 있고, 거짓 포지티브(false positive), 거짓 네거티브(false negative) 및 정확성의 균형을 맞추기 위해 향상된 튜닝을 허용할 수 있다(예 를 들어, 무언가가 가능한 이상으로 분류되는 시기를 결정하기 위해 문턱치(들)를 사용하여). 본 개시물에 따른 신경망들(예를 들어, CNN)의 사용은 또한 매우 복잡하고 특별히 설계된 비전/스캐닝 시스템(예를 들어, 카 메라들)의 사용 필요성을 제거할 수 있으므로, 규격품(off-the-shelf) 비전/스캐닝 시스템들(예를 들어, 카메라 들)의 사용을 허용하며, 이는 비용을 절감시킨다. 본 개시물에 따른 해법들이 제공하는 또 다른 이점은 특히 중앙집중식(centralized) 위치(예를 들어, 원격 시스 템)에서 캡처된 이미지들의 수집(그리고 옵션적으로 다중 셋업들로부터의), 및 그에 기반한 이미지들의 데 이터베이스의 생성이다. 이는 모델 (재)트레이닝 및 업데이트를 가능하게 하고 촉진하며(그리고 특히 보다 정확 하고 경제적인 방식으로, 이는 (재)트레이닝에 필요한 모든 복잡한 프로세싱이 집중되어야 하는 중앙집중식 위 치/서버에서 이것이 수행되기 때문이고, 상이한 셋업들로부터의 이미지들이 유지될 수 있음), 따라서 정확도 메 트릭들 및/또는 추적가능성을 증가시킨다. 본 개시물에 따른 비파괴 테스트(NDT)에 사용하기 위한 예시적인 시스템은 물품의 비파괴 테스트(NDT) 검사 동 안 물품의 스캔을 획득하도록 구성되는 스캐너, 및 물품의 획득된 스캔에 기초하여 물품의 가능한 이상들을 식 별하고 물품과 관련된 검사 관련 피드백을 생성하도록 구성되는 하나 이상의 회로를 포함할 수 있고, 검사 관련 피드백은 각각의 식별된 가능한 이상에 대응하는 이상 표시를 포함한다. 가능한 이상들의 식별은 적응형 학습 알고리즘 기반 분석을 획득된 물품 스캔에 적용하는 것을 포함하며, 적응형 학습 알고리즘 기반 분석은 참조 스 캔들을 사용하지 않고 적용하도록 구성된다. 예시적인 구현에서, 분석에 기초한 적응형 학습 알고리즘은 컨볼루션 신경망(CNN, convolutional neural network)의 사용을 포함하고, 하나 이상의 회로는 컨볼루션 신경망(CNN)을 구현하도록 구성된다. 예시적인 구현에서, 하나 이상의 회로는 스캔 향상 프로세싱을 수행하지 않고 분석에 기초한 적응형 학습 알고 리즘을 적용하도록 구성된다. 예시적인 구현에서, 하나 이상의 회로는 획득된 스캔을 원격 시스템에 송신하도록 구성되고, 원격 시스템은 분 석에 기초한 적응형 학습 알고리즘을 구현 및/또는 조정하기 위한 정보를 생성하도록 구성된다. 예시적인 구현에서, 하나 이상의 회로는 원격 시스템으로부터 분석에 기초한 적응형 학습 알고리즘을 구현하기 위한 또는 조정하기 위한 또는 구현 및 조정하기 위한 제어 정보를 획득하도록 구성된다. 예시적인 구현에서, 하나 이상의 회로는 원격 시스템으로부터 제어 정보를 주기적으로 획득하도록 구성된다. 예시적인 구현에서, 스캐너는 시각적 스캐닝 디바이스를 포함하고, 스캔은 시각적 스캔을 포함한다. 예시적인 구현에서, 시각적 스캐닝 디바이스는 카메라를 포함하고, 시각적 스캔은 물품의 이미지를 포함한다. 예시적인 구현에서, 시스템은 비파괴 테스트(NDT) 검사 동안 시스템의 조작자에게 검사 관련 피드백을 제공하도 록 구성되는 피드백 컴포넌트를 더 포함한다. 예시적인 구현에서, 피드백 컴포넌트는 시각적 출력 디바이스를 포함한다. 예시적인 구현에서, 피드백 컴포넌트는 가청 출력 디바이스를 포함한다. 예시적인 구현에서, 시스템은 침투 탐상 검사(LPI, liquid penetrant inspection)를 수행하도록 구성된다. 예시적인 구현에서, 시스템은 자기 탐상 검사(MPI, magnetic particle inspection)를 수행하도록 구성된다. 본 개시물에 따른 다른 구현들은 그에 저장된 비일시적 컴퓨터 판독가능 매체 및/또는 저장 매체, 및/또는 비일 시적 기계 판독가능 매체 및/또는 저장 매체, 및/또는 기계 코드 및/또는 기계 및/또는 컴퓨터에 의해 실행 가 능한 적어도 하나의 코드 섹션을 가진 컴퓨터 프로그램을 제공할 수 있어, 이로써 기계 및/또는 컴퓨터가 본 명 세서에 설명된 프로세스들을 수행하게 할 수 있다. 따라서, 본 개시물에 따른 다양한 구현들은 하드웨어, 소프트웨어, 또는 하드웨어와 소프트웨어의 조합으로 실 현될 수 있다. 본 개시물은 적어도 하나의 컴퓨팅 시스템에서 중앙 집중 방식으로, 또는 상이한 엘리먼트들이 여러 상호연결된 컴퓨팅 시스템들에 걸쳐 분산되어 있는 분산된 방식으로 구현될 수 있다. 본 명세서에 설명된 방법들을 수행하는 데 맞춰진 모든 종류의 컴퓨팅 시스템 또는 기타 장치가 적합하다. 하드웨어와 소프트웨어의 전형적인 조합은 로딩되고 실행될 때 본 명세서에 설명된 방법들을 수행하도록 컴퓨팅 시스템을 제어하는 프로 그램 또는 기타 코드를 가진 범용 컴퓨팅 시스템일 수 있다. 다른 전형적인 구현은 주문형 집적 회로 또는 칩을 포함할 수 있다. 본 개시물에 따른 다양한 구현들은 또한 본 명세서에 설명된 방법들의 구현을 인에이블시키는 모든 피처들을 포 함하고 컴퓨터 시스템에 로딩될 때 이들 방법들을 수행할 수 있는 컴퓨터 프로그램 제품에 임베딩될 수 있다. 현재 문맥에서 컴퓨터 프로그램은 정보 처리 능력을 가진 시스템이 직접 또는 다음 중 하나 또는 둘 모두 이후 에 특정 기능을 수행하도록 의도된 명령어들의 세트를 임의의 언어, 코드 또는 표기법으로 표현한 것을 의미한 다: a) 다른 언어, 코드 또는 표기법으로의 변환 b) 다른 물질 형태로 재생산. 본 개시물은 특정 구현들을 참조하여 설명되었지만, 본 개시물의 범위를 벗어나지 않고 다양한 변경들이 이루어 질 수 있고 등가물로 대체될 수 있음을 당업자는 이해할 것이다. 예를 들어, 개시된 예들의 블록 및/또는 컴포 넌트들은 결합, 분할, 재배열 및/또는 달리 수정될 수 있다. 또한, 그 범위를 벗어나지 않고 본 발명의 교시에 특정 상황 또는 재료를 적응시키기 위해 많은 수정들이 이루어질 수 있다. 따라서, 본 개시물은 개시된 특정 구 현으로 제한되지 않고, 본 개시물은 첨부된 청구 범위 내에 있는 모든 구현들을 포함할 것으로 의도된다.도면 도면1 도면2"}
{"patent_id": "10-2023-7002506", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 예시적인 시각 기반 비파괴 테스트(NDT) 검사 셋업을 예시한다. 도 2는 본 개시물에 따른 트레이닝된 인공 지능 기반 프로세싱을 갖는 예시적인 시각 기반 비파괴 테스트(NDT) 검사 셋업을 예시한다."}
