{"patent_id": "10-2012-0074856", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2014-0008003", "출원번호": "10-2012-0074856", "발명의 명칭": "카드 게임을 제공하는 방법, 서버 및 장치", "출원인": "주식회사 네오위즈인터넷", "발명자": "김형수"}}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버가 카드 게임을 제공하는 방법에 있어서,상기 카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 단계;제1플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신하는 단계;상기 제1플레이어의 순서에서 제2단말로부터 제2아이템에 대한 사용 요청을 수신하는 단계; 및상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 단계를 포함하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 제1아이템에 대한 사용 요청을 수신하는 단계 이후에 상기 제1아이템에 대한 사용 요청 정보를 상기 제2단말로 출력 제어하는 단계를 더 포함하는 것을 특징으로 하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1아이템은 상기 카드 게임에 대해 미리 정해진 룰을 벗어나서 상기 카드 게임이 진행되도록 하는 공격아이템이고, 상기 제2아이템은 상기 공격 아이템이 상기 카드 게임에 적용되는 것을 무효화하는 방어 아이템인것을 특징으로 하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1아이템은 상기 복수의 플레이어 중 상기 제1단말로 제어되는 플레이어가 보유한 어느 한 패를 상기 복수의 플레이어가 보유하지 않은 패 중 어느 한 패와 교환하도록 하는 체인지 아이템인 것을 특징으로 하는 카드게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1아이템은 상기 복수의 플레이어가 보유하지 않은 패 중 일부 혹은 전부의 패에 대한 정보를 상기 제1단말로 출력하도록 하는 투시 아이템인 것을 특징으로 하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 제1플레이어의 순서는 상기 제1단말로 제어되는 플레이어의 순서이거나 상기 제2단말로 제어되는 플레이어의 순서인 것을 특징으로 하는 카드 게임을 제공하는 방법.공개특허 10-2014-0008003-2-청구항 7 제1항에 있어서,상기 제1아이템을 무효 처리하는 단계에서,상기 제1아이템에 대한 사용 요청을 수신한 후 일정 시간이내에 상기 제2아이템에 대한 사용 요청이 수신되는경우에, 상기 제1아이템을 무효 처리하는 것을 특징으로 하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 카드 게임을 진행하는 단계에서,상기 플레이어들에게 패를 분배하면서 상기 제1아이템을 상기 제1단말로 제어되는 플레이어에게 분배하는 것을특징으로 하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 카드 게임을 진행하는 단계에서,상기 제1단말로 제어되는 플레이어에게 미션을 제공하고, 상기 미션이 완료되면 상기 제1아이템을 상기 제1단말로 제어되는 플레이어에게 지급 처리하는 것을 특징으로 하는 카드 게임을 제공하는 방법."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 제어부;제1플레이어의 순서에서, 제1단말로부터 제1아이템에 대한 사용 요청을 수신하고 제2단말로부터 제2아이템에 대한 사용 요청을 수신하는 아이템 사용 요청 수신부; 및상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 아이템 무효 처리부를 포함하는 카드 게임을 제공하는 서버."}
{"patent_id": "10-2012-0074856", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 제어부;상기 복수의 플레이어 중 어느 한 플레이어의 순서에서, 인공지능 모듈에 의해 제어되는 제1플레이어의 제1아이템 사용 요청을 표시 제어하고 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템에 대한 사용 요청을입력받는 아이템 사용 요청 입력부; 및상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 아이템 무효 처리부를 포함하는 카드 게임을 제공하는 장치.명 세 서기 술 분 야본 발명은 카드 게임을 제공하는 기술에 관한 것이다. 더욱 상세하게는 카드 게임에서 아이템을 사용하는 것에 [0001]관한 기술이다.공개특허 10-2014-0008003-3-배 경 기 술전통적인 카드 놀이가 온라인 혹은 오프라인 상의 카드 게임으로 개발되고 있다. 포커, 고스톱 등이 카드 게임 [0002]으로 개발된 대표적인 사례들이다. 이러한 카드 게임은 전통적인 카드 놀이의 룰 혹은 규칙을 그대로 모방하고있어서 사용자들이 대면하지 않고 온라인을 통해 전통적인 카드 놀이의 재미를 똑같이 느낄 수 있게 해 준다.발명의 내용카드 게임이 전술한 바와 같이 전통적인 카드 놀이의 룰 혹은 규칙을 그대로 모방하고 있는 것이 장점일 수도 [0003]있으나, 정형화된 카드 놀이 방법으로 인해 플레이어들은 게임에 대해 실증을 느낄 수 있다. 이러한 문제를 해결하기 위해 카드 게임에서 아이템을 적용할 필요가 있다. 아이템을 사용하여 플레이어들은 미리 정해진 룰 혹은 규칙에서 벗어나도록 카드 게임을 진행할 수 있다. 그런데, 카드 게임은 다수의 플레이어가 함께 하는 게임임으로 어느 한 플레이어가 아이템을 사용하면 다른 한 플레이어에게 카드 게임이 불리하게 진행될 가능성이 있다. 따라서, 어느 한 플레이어의 아이템 사용에 대해 다른 한 플레이어가 이를 저지할 수 있는 아이템을 제공할필요가 있다.전술한 목적을 달성하기 위하여, 일 측면에서, 본 발명은, 서버가 카드 게임을 제공하는 방법에 있어서, 상기 [0004]카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 단계; 제1플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신하는 단계; 상기 제1플레이어의 순서에서 제2단말로부터 제2아이템에 대한 사용 요청을 수신하는 단계; 및 상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 단계를 포함하는 카드 게임을 제공하는 방법을 제공한다.다른 측면에서, 본 발명은, 카드 게임에 참여한 복수의 플레이어들에 대해 정해진 순서에 따라 카드 게임을 진 [0005]행하는 제어부; 제1플레이어의 순서에서, 제1단말로부터 제1아이템에 대한 사용 요청을 수신하고 제2단말로부터제2아이템에 대한 사용 요청을 수신하는 아이템 사용 요청 수신부; 및 상기 제2아이템의 사용 요청에 따라 상기제1아이템을 무효 처리하는 아이템 무효 처리부를 포함하는 카드 게임을 제공하는 서버를 제공한다.또 다른 측면에서, 본 발명은, 카드 게임에 참여한 복수의 플레이어들에 대해 정해진 순서에 따라 카드 게임을 [0006]진행하는 제어부; 상기 복수의 플레이어 중 어느 한 플레이어의 순서에서, 인공지능 모듈에 의해 제어되는 제1플레이어의 제1아이템 사용 요청을 표시 제어하고 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템에 대한 사용 요청을 입력받는 아이템 사용 요청 입력부; 및 상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 아이템 무효 처리부를 포함하는 카드 게임을 제공하는 장치를 제공한다.이상에서 설명한 바와 같이 본 발명에 의하면, 플레이어가 아이템을 사용하여 게임의 진행을 다이나믹하게 만들 [0007]수 있고, 또, 어느 한 플레이어의 아이템 사용에 대해 다른 한 플레이어가 그 사용을 저지할 수 있어, 게임에참여한 모든 플레이어가 게임을 보다 재미있게 즐길 수 있게 하는 효과가 있다.도면의 간단한 설명도 1은 본 발명의 일 실시예에 따른 카드 게임을 제공하는 네트워크 시스템에 대한 구성도이다. [0008]도 2는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버의 내부 블록도이다.도 3은 정해진 순서에 따라 아이템을 사용하면서 카드 게임을 진행하는 것을 도시한 흐름도이다.도 4는 고스톱 카드 게임에서 방어 아이템을 사용하는 예시 도면이다.도 5는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다.도 6는 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치의 내부 블록도이다.도 7은 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다.발명을 실시하기 위한 구체적인 내용이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 [0009]를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구공개특허 10-2014-0008003-4-체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다.또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. [0010]이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성 요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다.도 1은 본 발명의 일 실시예에 따른 카드 게임을 제공하는 네트워크 시스템(100)에 대한 구성도이다. 도 1을 참 [0011]조하면, 서버(110) 및 단말(120)이 네트워크(130)를 통해 연결되어 있다. 단말(120)은 복수일 수 있다. 단말(120)은 네트워크(130)를 통해 서버(110)에 접속하여, 서버(110)에서 제공하는 각종 서비스들을 출력하거나, 서버(110)와 연동하여 서비스에 필요한 일부 기능을 수행하거나, 서비스 수행에 필요한 입력 사항을 서버(110)로송신할 수 있다.전술한 단말(120)는, 일반적인 데스크 탑이나 노트북 등의 일반 PC를 포함하고, 스마트 폰, 태블릿 PC, [0012]PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기 등을 포함할 수 있으며, 이에 제한되지 않고, 서버(110)와 통신 가능한 어떠한 전자 기기로 폭넓게 해석되어야 할 것이다. 전술한 서버(110)는 하드웨어적으로는 통상적인 웹 서버(Web Server) 또는 웹 어플리케이션 서버(Web [0013]Application Server) 또는 왑 서버(WAP Server)와 동일한 구성을 하고 있다. 그러나, 소프트웨어적으로는, 도2와 관련하여 아래에서 상세하게 설명할 바와 같이, C, C++, Java, PHP, .Net, Python, Ruby 등 여하한 언어를통하여 구현되어 여러 가지 기능을 하는 프로그램 모듈(Module)을 포함할 수 있다.또한, 서버(110)는, 네트워크(130)를 통하여 불특정 다수 클라이언트(단말(120)을 포함) 및/또는 다른 서버와 [0014]연결될 수 있는데, 이에 따라, 서버(110)는 클라이언트 또는 다른 서버의 작업수행 요청을 접수하고 그에 대한작업 결과를 도출하여 제공하는 컴퓨터 시스템 또는 이러한 컴퓨터 시스템을 위하여 설치되어 있는 컴퓨터 소프트웨어(서버 프로그램)를 뜻하는 것일 수도 있다. 또한, 서버(110)는, 전술한 서버 프로그램 이외에도, 서버(110) 상에서 동작하는 일련의 응용 프로그램 [0015](Application Program)과, 경우에 따라서는 내부 또는 외부에 구축되어 있는 각종 데이터베이스를 포함하는 넓은 개념으로 이해되어야 할 것이다. 또한, 서버(110)는 콘텐츠, 각종 정보 및 데이터를 데이터베이스에 저장시키고 관리할 수 있다. 여기서, 데이터 [0016]베이스는 서버(110)의 내부 또는 외부에 구현될 수 있다.또한, 서버(110)는 일반적인 서버용 하드웨어에 도스(DOS), 윈도우(windows), 리눅스(Linux), 유닉스(UNIX), [0017]매킨토시(Macintosh) 등의 운영체제에 따라 다양하게 제공되고 있는 서버 프로그램을 이용하여 구현될 수 있으며, 대표적인 것으로는 윈도우 환경에서 사용되는 웹 사이트(Website), IIS(Internet Information Server)와유닉스환경에서 사용되는 Apache, Nginx, Light HTTP 등이 이용될 수 있다. 한편, 네트워크(130)는 서버(110)와 단말(120)을 연결해주는 망(Network)으로서, LAN(Local Area Network), [0018]WAN(Wide Area Network)등의 폐쇄형 네트워크일 수도 있으나, 인터넷(Internet)과 같은 개방형 네트워크일 수도있다. 여기서, 인터넷은 TCP/IP 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText TransferProtocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail TransferProtocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(NetworkInformation Service)를 제공하는 전 세계적인 개방형 컴퓨터 네트워크 구조를 의미한다. 또한, 단말(120)이 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 [0019]단말기를 포함하는 경우, 네트워크(130)는 이동 통신망이나 와이파이(WiFi) 망 등의 무선 액세스 망을 더 포함할 수도 있다. 도 2는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버(110)의 내부 블록도이다. [0020]도 2를 참조하면, 서버(110)는 제어부(210), 아이템 사용 요청 수신부(220), 아이템 무효 처리부(230) 등을 포 [0021]함할 수 있다. 제어부(210)는 카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진공개특허 10-2014-0008003-5-행하고, 아이템 사용 요청 수신부(220)는 제1플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을수신하고, 제2단말로부터 제2아이템에 대한 사용 요청을 수신한다. 그리고, 아이템 무효 처리부(230)는 제2아이템의 사용 요청에 따라 제1아이템을 무효 처리한다. 여기서, 플레이어는 카드 게임에 참여하는 가상의 캐릭터로서 단말에서의 사용자 조작 신호를 수신받아 제어되거나, 서버(110)에 포함되어 있는 인공지능 모듈에 따라 제어된다. 아래 명세서에서 사용자는 카드 게임을 이용하는 사람을 의미하고, 플레이어는 전술한 바와 같이 카드게임에 참여하는 가상의 캐릭터임으로 이를 구별하여 이해해야 할 것이다.서버(110)의 각 블록들의 실시예들을 좀더 자세히 설명한다. [0022]카드 게임은 컴퓨터 등의 전산 장비에서 카드 놀이를 할 수 있게 만든 게임인데, 포커라든지 고스톱 등이 이러 [0023]한 대표적인 카드 놀이라고 할 수 있다. 포커를 먼저 살펴 보면, 플레이어들에게 카드 패를 분배하고, 정해진순위 값에 따라 다른 플레이어들에 비해 높은 순위의 카드 패를 가지고 있는 플레이어가 이기는 방식이다. 여러플레이어가 함께 참여하는 방식이기 때문에 플레이어들에 대해 순서를 정해 놓고, 이렇게 정해진 순서에 따라한 플레이어씩 플레이를 하게 된다. 플레이어들에게는 각자 자신에게 배정되는 카드 패가 있고, 게임의 진행에따라 플레이어들에게 배정되거나 혹은 다른 용도로 사용될 예정인 패가 있다. 이렇게 포커는 정해진 순서에 따라 각 플레이어가 카드 게임을 진행하고, 또한, 카드 게임에 사용되는 카드 패는 플레이어들에게 배정된 패와배정되지 않은 나머지 패로 나누어진다는 기본적인 특성을 가지고 있다. 고스톱 또한, 포커와 유사한 특성을 가지고 있다. 고스톱은 플레이어들에게 카드 패가 분배되고, 각 플레이어들은 분배된 패를 활용하여 아직 분배되지 않은 카드 패를 획득하는 방식으로 카드 게임이 진행되는데, 이러한 과정을 통해 다른 플레이들 보다 높은점수에 해당되는 카드 패를 획득하면 이기게 되는 방식을 따른다. 고스톱 또한 여러 플레이어가 함께 참여하는방식이기 때문에 플레이어들에 대해 순서를 정해 놓고, 이렇게 정해진 순서에 따라 한 플레이어씩 플레이를 하게 된다. 플레이어들에게는 각자 자신에게 배정되는 카드 패가 있고, 게임의 진행에 따라 플레이어들에게 배정되거나 혹은 다른 용도로 사용될 예정인 패가 있다. 결국 포커와 유사하게 정해진 순서에 따라 각 플레이어가카드 게임을 진행하고, 또한, 카드 게임에 사용되는 카드 패는 플레이어들에게 배정된 패와 배정되지 않은 나머지 패로 나누어진다는 기본적인 특성을 가지고 있다. 이외에도, 카드를 이용하여 게임을 진행하는 카드 게임들은 위와 같은 특성을 가지고 있는 경우가 많다. 아이들 사이에서 유행되는 일부 애니메이션을 모티브로한 카드게임이나 성인들 사이에서 도박의 형태로 진행되는 다양한 카드 게임들도 모두 전술한 특성들을 가지고 있다고할 수 있다.제어부(210)는 특정 룰을 적용하여 카드 게임을 진행한다. 특정 룰이란 카드 놀이를 통해 알려진 카드 놀이 방 [0024]법일 수도 있으나, 이에 변칙을 넣어 카드 놀이보다 더 흥미를 가질 수 있도록 새롭게 만든 룰일 수도 있다. 카드 게임은 정해진 순서에 따라 각 플레이어별로 진행됨으로 제어부(210)는 이렇게 정해진 순서에 따라 각 플레이어가 카드 게임을 진행할 수 있도록 제어하는 역할을 한다.카드 게임이 전통적인 카드 놀이의 기본 룰을 따르고 있지만, 이러한 기본 룰만 적용된다면 플레이어들은 카드 [0025]게임에 대해 쉽게 실증을 낼 수 있다. 이러한 문제를 개선하기 위해 카드 게임에서 각 플레이어가 아이템을 사용할 수 있게 할 수 있다. 고스톱 카드 게임을 통해 아이템의 예시에 대해 설명하기로 한다. 하지만, 이러한 아이템들은 포커 등 다른 카드 게임에도 적용될 수 있으므로, 아래에서 제시한 예시를 고스톱 카드 게임에 한정하여 이해할 필요는 없다.고스톱은 카드 게임의 시작과 함께 참여 플레이어들에게 일정 수의 패를 분배하고, 각 플레이어들은 분배된 일 [0026]정 수의 패를 이용하여, 분배되지 않은 패를 획득하면서 획득된 패들의 점수로 승패를 가리게 된다. 이러한 카드 게임의 진행에 있어, 각 플레이어들에게 분배되지 않고 어떤 패인지 알지 못하게 쌓여 있는 패들이 있다. 어떤 패인지 알지 못하게 쌓아 놓는 것이 기본 룰인데, 여기에 투시 아이템을 적용할 수 있다. 투시 아이템은 플레이어들이 보유하지 않은 패 중 일부 혹은 전부의 패에 대한 정보를 투시 아이템을 사용하는 플레이어에게 공개하는 것이다. 이렇게 되면, 해당 투시 아이템을 사용하는 플레이어는 다른 플레이어들에 비해 유리한 상황에서 카드 게임을 진행할 수 있게 된다. 적용할 수 있는 아이템의 다른 예시로서, 체인지 아이템이 있다. 체인지아이템은 어느 한 플레이어가 보유한 어느 한 패를 플레이어들이 보유하지 않은 패 중의 한 패와 교환하도록 하는 것이다. 카드 게임의 시작과 함께 자신에게 일정 수의 카드 패가 분배되는데, 분배받은 패가 마음에 들지 않을 수 있다. 이 때, 이 체인지 아이템을 사용하는 플레이어는 마음에 들지 않는 패를 다른 패로 교환할 수 있게되는 것이다. 이외에도, 카드 게임에서 획득하는 점수에 비례하여 승자에게 캐시(cash)를 지급하기로 한 경우,특정 판에 대해서 캐시를 두 배로 올리게 하는 더블판 아이템을 적용할 수도 있다. 카드 게임이 시작되고, 자신이 승리할 것이라는 확신이 드는 경우, 이러한 더블판 아이템을 적용하여 보다 많은 캐시를 획득할 수 있는 장점이 있다. 또 다른 예시로, 카드 패 뺏기 아이템은 다른 플레이어가 카드 진행에 따라 획득한 특정 패를 이 아공개특허 10-2014-0008003-6-이템을 사용하는 플레이어에게 옮겨주느 역할을 한다. 이외에도, 아이템을 사용하는 플레이어에게 게임의 진행이 유리하게 될 수 있는 다양한 아이템을 생각해 볼 수 있을 것이다.아이템으로 사용될 수 있는 것에 대해 몇 가지 예시를 들어 설명하였다. 그런데, 카드 게임이 컴퓨터로 계산되 [0027]고 제어되는 플레이어를 상대로 진행된다면, 전술한 아이템의 사용에 별 문제가 없을 것이다. 문제는 다수의 사용자가 각자의 플레이어를 제어하여 카드 게임을 진행할 때 발생한다. 어느 한 플레이어가 전술한 것과 같이 자신에게 유리한 상황을 만들 수 있는 아이템을 사용한다면 그 반대로 다른 플레이어에게는 카드 게임이 불리한상황으로 진행된다는 것을 의미한다. 이렇게 되면, 아이템을 사용하지 않은 플레이어는 게임에 대해 불만을 가지게 되고, 게임에 대한 흥미를 잃을 수 있다. 따라서, 이러한 아이템의 사용을 저지할 수 있는 아이템이 있을필요가 있다. 본 발명에서 이에 대한 것을 어떻게 적용하고 있는지 아이템 사용 요청 수신부(220)와 아이템 무효 처리부(230)에 대한 설명과 함께 살펴본다.아이템 사용 요청 수신부(220)는 사용자로부터 아이템에 대한 사용 요청을 수신하는 블록이다. 아이템 사용 요 [0028]청 수신부(220)는 어느 한 플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신하고, 제2단말로부터 제2아이템에 대한 사용 요청을 수신한다. 제2아이템은 제1아이템의 적용을 무효화하는 아이템으로 제2아이템을 제1아이템과 같은 어느 한 플레이어의 순서에서 그 사용 요청을 수신하는 것은 카드 게임의 특성상 어느 한 플레이어의 순서가 마무리되고, 다음 플레이어의 순서가 되면 어느 한 플레이어의 순서에서 진행된 내용은 모두 확정되기 때문이다. 따라서, 다음 플레이어의 순서로 넘어가기 전에 어느 한 플레이어의 순서에서 제1아이템에 사용되었다면, 같은 순서에서 제2아이템에 대한 사용 요청을 받아 제1아이템을 게임에 적용할 것인지적용하지 않을 것인지 확정해야하기 때문이다.아이템 무효 처리부(230)는 이렇게 제2아이템의 사용 요청이 아이템 사용 요청 수신부(220)로 수신되면, 제1아 [0029]이템을 무효 처리한다.제1아이템이 사용되고, 제2아이템이 다시 사용되어 제1아이템이 무효 처리되는 과정을 도 3을 참조하여 설명한 [0030]다. 도 3은 정해진 순서에 따라 아이템을 사용하면서 카드 게임을 진행하는 것을 도시한 흐름도이다. [0031]도 3을 참조하면, 먼저 게임에 참여할 플레이어들이 확정되고 게임이 시작된다(S300). 그리고, 제어부(210)에 [0032]의해 정해진 순서에 따라 각 플레이어의 플레이가 진행된다. 카드 게임이 진행되다가 제1플레이어의 순서가 된다(S302). 아이템 사용 요청 수신부(220)는 제1플레이어 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을수신한다(S304에서 Yes). 여기서는 카드 게임에 대해 미리 정해진 룰을 벗어나서 카드 게임이 진행되도록 하는공격 아이템을 제1아이템으로 가정하였다. 제1단말은 제1플레이어를 제어하는 단말일 수 있다. 자신의 순서에서공격 아이템을 사용하는 것이 바람직할 수 있으나, 이로 제한되는 것은 아니며, 다른 플레이어의 순서에서 공격아이템을 사용할 수도 있는 것이다. 제1단말로부터 제1아이템에 대한 사용 요청이 없다면(S304에서 No), 제1플레이어의 플레이가 마무리되고, 게임은 다음 플레이어인 제2플레이어 순서로 변경된다(S312). 제1아이템에 대한사용 요청이 수신된 후, 다른 플레이어로부터 제2아이템에 대한 사용 요청을 대기하게 되는데, 이때 제2아이템에 대한 사용 요청이 수신되지 않으면(S306에서 No), 제1아이템에 해당되는 공격 아이템은 게임에 적용되고(S308), 카드 게임은 다음 순서인 제2플레이어의 순서로 변경된다(S312). 아이템 사용 요청 수신부(220)를 통해제2단말로부터 제2아이템에 대한 사용 요청이 수신되면(S306에서 Yes), 제1아이템에 해당되는 공격 아이템이 아직 게임에 적용되지 않았기 때문에, 아이템 무효 처리부(230)는 공격 아이템은 무효 처리하여 게임에 적용하지않고(S310), 제1플레이어의 플레이가 마무리되는데로, 다음 순서인 제2플레이어 순서로 변경된다(S312). 제1아이템으로서의 공격 아이템을 무효화한다는 측면에서 제2아이템은 방어 아이템이라고 부를 수 있다. 이후 제2플레이어의 순서가 진행되고, 이후 카드 게임 전체가 마무리되면 게임이 종료된다(S314).도 4는 고스톱 카드 게임에서 방어 아이템을 사용하는 예시 도면인데, 도 3과 같이 카드 게임이 진행되는 과정 [0033]에서 제1플레이어가 투시 아이템을 사용하고 이에 대응하여 제2플레이어가 방어 아이템을 사용하고자 하는 것을나타낸다. 도 4를 참조하면, 제1플레이어는 10개의 패(402)를 보유하고 있고, 제2플레이어 또한 10개의 패(404)를 보유하고 있다. 카드 게임의 중앙 화면에는 게임에 참여한 제1플레이어 및 제2플레이어에게 분배되지 않은더미 패(406)가 표시되고 있다. 화면은 제1플레이어가 투시 아이템을 사용 요청한 상황을 묘사하고 있는데, 제1플레이어가 투시 아이템을 사용 요청함에 따라 서버(110)는 이러한 정보를 제2플레이어를 제어하는 단말로 접속한 사용자가 알 수 있도록 화면에 표시(410)하고 있다. 제1플레이어의 투시 아이템 사용 요청에 대응하여 제2플공개특허 10-2014-0008003-7-레이어는 방어 아이템(408)을 보유하고 있음으로 이를 사용하여 투시 아이템이 카드 게임에 적용되는 것을 저지할 수 있다.서버(110)의 기본 블록들에 대해 설명하였는데, 부가적으로 서버(110)의 몇 가지 실시예들을 더 설명하기로 한 [0034]다.서버(110)는 제1단말로부터 제1아이템에 대한 사용 요청을 수신한 후, 이러한 제1아이템 사용 요청 정보를 제2 [0035]단말로 출력 제어할 수 있다. 제1단말을 통해 제1플레이어가 제어되고, 제2단말을 통해 제2플레이어가 제어된다고 할 때, 제1플레이어가 제1아이템을 사용하여 자신에게 유리한 상황을 구축하려고 할 때, 제2플레이어에게 이러한 정보를 알려 제2플레이어가 이를 저지할 수 있는 기회를 제공하기 위함이다.아이템 사용 요청 수신부(220)는 어느 한 플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수 [0036]신하고, 같은 순서에서 제2단말로부터 제2아이템에 대한 사용 요청을 수신하게 되는데, 이러한 어느 한 플레이어의 순서는 제1단말로 제어되는 플레이어의 순서이거나 제2단말로 제어되는 플레이어의 순서일 수 있다. 어느한 플레이어의 순서가 제1단말로 제어되는 플레이어의 순서라는 것은 자신의 순서에서 제1아이템을 사용할 수있다는 것으로 제1아이템이 공격 아이템인 경우, 자신의 순서에서 공격 아이템을 쓸 수 있다는 것이다. 반대로어느 한 플레이어의 순서가 제2단말로 제어되는 플레이어의 순서라는 것은 상대방에게 불리함을 주고자 하는 플레이어의 순서에 제1단말로 제어되는 플레이어가 제1아이템을 사용하고, 그 순서에 해당되는 플레이어인 제2단말로 제어되는 플레이어가 제2아이템(예를 들어, 방어 아이템)을 사용할 수 있게 되는 것이다.아이템 사용 요청 수신부(220)를 통해 제1아이템에 대한 사용 요청을 수신한 후 일정 시간 이내에 제2아이템에 [0037]대한 사용 요청이 수신되는 경우에 아이템 무효 처리부(230)는 제1아이템을 무효 처리할 수 있다. 이러한 방식은 게임의 신속한 진행을 위해 타임 제도를 도입하는 것으로서 아이템 무효 처리부(230)는 일정 시간 이내에 제2아이템에 대한 사용 요청이 수신되지 않았음을 파악하게 되는 경우 제1아이템을 무효화하지 않게 되고, 서버(110)는 제1아이템을 게임에 적용하게 된다.자신에게 유리한 상황을 만들 수 있는 제1아이템을 어떻게 획득하는지도 관심이 가는 사항일 수 있다. 제어부 [0038](210)는 플레이어들에게 패를 분배하면서 제1아이템을 제1단말로 제어되는 플레이어에게 분배할 수 있다. 게임의 상황으로 묘사한다면, 게임 시작하면서 몇 개의 제1아이템을 랜덤 혹은 일정 규칙에 따라 게임에 참여한 플레이어들에게 분배하여 사용하게 할 수 있다. 제2아이템도 마찬가지이다. 제어부(210)는 제2아이템도 제1아이템처럼 게임 시작과 함께 플레이어들에게 분배시켜 줄 수 있다. 플레이어가 제1아이템 혹은 제2아이템을 획득하는다른 경우도 있다. 카드 게임 도중에 일정 미션을 제공하고 이러한 미션을 달성하는 경우 제1아이템 혹은 제2아이템을 미션을 성공시킨 플레이어에게 배부할 수도 있다. 예를 들어, 포커에서 원 페어(one pair)에 해당되는패를 보유하게 되었다면, 해당 패를 보유한 플레이어에게 제1아이템을 제공할 수 있다.이상에서는, 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버(110)에 대하여 설명하였으며, 이하에서는, [0039]본 발명의 일 실시예에 따른 서버(110)가 카드 게임을 제공하는 방법에 대하여 설명한다. 후술하게 될 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법은, 도 2에 도시된 본 발명의 일 실시예에 따른 서버(110)에 의해 모두 수행될 수 있다. 도 5는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다. [0040]도 5를 참조하면, 서버(110)는 참가가 확정된 플레이이들에 대해 카드 게임을 진행한다(S500). 플레이어들에 대 [0041]해 정해진 순서에 따라 카드 게임이 진행되다가, 서버(110)는 어느 한 플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신한다(S502). 그리고, 서버(110)는 어느 한 플레이어의 같은 순서에서 제2단말로부터 제2아이템에 대한 사용 요청을 수신하게 된다(S504). 이렇게 제2아이템에 대한 사용 요청을 수신한 서버(110)는 제1아이템을 무효 처리하고(S506), 다음 순서에 따라 게임을 계속 진행하게 된다.이상에서는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법이 도 5에서와 같은 절차로 수행되는 것으로 [0042]설명되었으나, 이는 설명의 편의를 위한 것일 뿐, 본 발명의 본질적인 개념을 벗어나지 않는 범위 내에서, 구현방식에 따라 각 단계의 수행 절차가 바뀌거나 둘 이상의 단계가 통합되거나 하나의 단계가 둘 이상의 단계로 분리되어 수행될 수도 있다. 이상에서 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버(110) 및 방법에 대해 설명하였다. 이하에서는 [0043]본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치(600) 및 방법, 그리고 그 방법을 실행시키기 위한 프공개특허 10-2014-0008003-8-로그램을 기록한 기록매체에 대해 설명한다. 앞서 설명한 단말(120)과 장치(500)는 하드웨어적으로 같은 종류일수 있으나, 장치(500)가 전술한 서버(110)와 연동하여 본 발명의 일 실시예에 따른 네트워크 시스템을 구성하는것은 아니다. 따라서, 본 발명의 다른 실시예에 따른 장치(500)와 앞서 설명한 단말(120)은 구별하여 인식할 필요가 있다.도 6은 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치(600)의 내부 블록도이다. [0044]장치(600)의 대표적인 실시예는 네트워크 연결이 없이 단독으로 운전되는 컴퓨팅 장치일 수 있다. 태블릿 피씨 [0045]이나 네트워크 연결이 없는 형태가 대표적인 장치(600)의 예시일 수 있다. 이런 경우, 장치(600)를 사용하는 사용자의 조작에 따라 제어되는 플레이어 외에 다른 플레이어는 인공지능 모듈과 같은 장치(600) 내에 포함되어있는 모듈에 의해 제어되는 형태일 수 있다. 물론 본 발명의 다른 실시예에 따른 장치(600)도 네트워크로 연결된 다른 단말에 의해 조작 신호를 받아 특정 플레이어를 제어할 수 있다. 따라서, 아래에서 장치(600)에 연결된신호 입력 장치(예를 들어, 마우스, 키보드 등)를 통해 입력되는 사용자 조작 신호에 따라 제어되는 플레이어외에 다른 플레이어는 장치(600)에 포함된 인공지능 모듈 혹은 특정 프로그램에 의해 제어된다고 가정하여 실시예를 설명하였다고 하여 장치(600)를 이러한 구성으로 제한하여 해석할 필요는 없다.도 6을 참조하면, 장치(600)는 제어부(610), 아이템 사용 요청 입력부(620), 아이템 무효 처리부(630) 등을 포 [0046]함할 수 있다.제어부(610)는 카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행한다. [0047]아이템 사용 요청 입력부(520)는 어느 한 플레이어의 순서에서, 인공지능 모듈에 의해 제어되는 제1플레이어의 [0048]제1아이템 사용 요청을 표시 제어하고, 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템에 대한 사용 요청을 입력받는다. 또는 아이템 사용 요청 입력부(520)는 그 반대로 어느 한 플레이어의 순서에서, 사용자조작에 따라 제어되는 제2플레이어의 제1아이템에 대한 사용 요청을 수신하고, 인공지능 모듈에 의해 제어되는제1플레이어의 제2아이템 사용 요청을 처리한다.플레이어가 둘이라고 가정하고, 제1플레이어가 장치(600)에 포함된 인공지능 모듈에 의해 제어되며 제2플레이어 [0049]가 사용자 조작에 따라 제어된다고 가정할 때, 아이템 사용 요청 입력부(520)는 어느 한 플레이어의 순서에서인공지능 모듈에 의해 제어되는 제1플레이어가 사용 요청한 제1아이템에 대한 정보를 사용자가 인식할 수 있도록 화면으로 출력하고, 사용자가 이에 대해 제2아이템을 사용하겠다는 사용자 조작을 하면, 이러한 사용자 조작에 따라 제2아이템에 대한 사용 요청을 입력받는다.반대로 제2플레이어가 장치(600)에 포함된 인공지능 모듈에 의해 제어되고, 제1플레이어가 사용자 조작에 따라 [0050]제어된다고 가정할 때, 아이템 사용 요청 입력부(520)는 어느 한 플레이어의 순서에서 사용자 조작을 인식하고이러한 사용자 조작에 따를 제1아이템 사용 요청을 수신하고, 이에 반응하는 인공지능 모듈의 제어에 따라 제2플레이어가 제2아이템을 사용 요청하는 것을 처리할 수 있다.아이템 무효 처리부(530)는 이러한 제2아이템의 사용 요청에 따라 제1아이템을 무효 처리한다. 제1아이템이 무 [0051]효 처리됨에 따라, 제어부(510)는 제1아이템의 효과를 적용하지 않고, 계속해서 다음 순서의 플레이어를 통해카드 게임을 진행하게 된다.이상에서는, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치(600)에 대하여 설명하였으며, 이하에서 [0052]는, 본 발명의 다른 실시예에 따른 장치(600)가 카드 게임을 제공하는 방법에 대하여 설명한다. 후술하게 될 본발명의 다른 실시예에 따른 카드 게임을 제공하는 방법은, 도 6에 도시된 본 발명의 다른 실시예에 따른 장치(600)에 의해 모두 수행될 수 있다.도 7은 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다. [0053]도 7을 참조하면, 장치(600)는 플레이어들에 대해 정해진 순서에 따라 카드 게임을 진행한다(S600). 장치(600) [0054]는 카드 게임이 진행되는 과정에서 어느 한 플레이어의 순서에서 제1아이템에 대한 특정 플레이어의 사용 요청을 화면으로 표시제어하고(S702), 사용자 조작에 따라 제2아이템에 대한 사용 요청을 입력받는다(S704). 이렇게제2아이템에 대한 사용 요청이 입력됨에 따라 장치(600)는 제1아이템을 무효 처리하고(S706), 다음 순서의 플레이어에 대한 카드 게임을 계속해서 진행한다.공개특허 10-2014-0008003-9-이상에서는 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법이 도 7에서와 같은 절차로 수행되는 것으 [0055]로 설명되었으나, 이는 설명의 편의를 위한 것일 뿐, 본 발명의 본질적인 개념을 벗어나지 않는 범위 내에서,구현 방식에 따라 각 단계의 수행 절차가 바뀌거나 둘 이상의 단계가 통합되거나 하나의 단계가 둘 이상의 단계로 분리되어 수행될 수도 있다. 이상에서 전술한 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법은, 장치(600)에 기본적으로 설치된 [0056]애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼에 포함되거나 운영체제 등에 포함되거나 호환되는 프로그램일 수 있음)에 의해 실행될 수 있고, 또한, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 장치(600)의 운영체제와 호환 가능하고 장치(600)에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 여기서, 장치(600)의 운영체제는,데스크 탑 등의 일반 PC에 설치되는 윈도우(Window), 매킨토시(Macintosh) 등의 운영체제이거나, 스마트폰, 태블릿 PC 등의 모바일 단말기에 설치되는 iOS, 안드로이드(Android) 등의 모바일 전용 운영체제 등일 수도 있다. 이러한 의미에서, 전술한 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법은 장치(600)에 기본적으로 [0057]설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고, 장치(600) 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다. 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 구현한 프로그램은, 카드 게임에 참여한 복수의 플 [0058]레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 기능과, 상기 복수의 플레이어 중 어느 한 플레이어의순서에서 인공지능 모듈에 의해 제어되는 제1플레이어의 제1아이템 사용 요청을 표시 제어하는 기능과, 상기 어느 한 플레이어의 순서에서 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템에 대한 사용 요청을 입력받는 기능과, 상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 기능 등을 실행한다. 이뿐만 아니라, 도 6 내지 도 7을 참조하여 전술한 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법에 대응되는 모든 기능을 실행할 수 있다. 이러한 프로그램은 컴퓨터에 의해 읽힐 수 있는 기록매체에 기록되고 컴퓨터에 의해 실행됨으로써 전술한 기능 [0059]들이 실행될 수 있다. 이와 같이, 컴퓨터가 기록매체에 기록된 프로그램을 읽어 들여 프로그램으로 구현된 카드 게임을 제공하는 방법 [0060]을 실행시키기 위하여, 전술한 프로그램은 컴퓨터의 프로세서(CPU)가 읽힐 수 있는 C, C++, JAVA, 기계어 등의컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 전술한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Function Code)를 포함할 수 있고, 전 [0061]술한 기능들을 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할수도 있다. 또한, 이러한 코드는 전술한 기능들을 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 컴퓨터 [0062]의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조 되어야 하는지에 대한 메모리 참조 관련 코드를 더포함할 수 있다. 또한, 컴퓨터의 프로세서가 전술한 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서 [0063]버 등과 통신이 필요한 경우, 코드는 컴퓨터의 프로세서가 컴퓨터의 통신 모듈(예: 유선 및/또는 무선 통신 모듈)을 이용하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야만 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등에 대한 통신 관련 코드를 더 포함할 수도 있다. 그리고, 본 발명을 구현하기 위한 기능적인(Functional) 프로그램과 이와 관련된 코드 및 코드 세그먼트 등은, [0064]기록매체를 읽어서 프로그램을 실행시키는 컴퓨터의 시스템 환경 등을 고려하여, 본 발명이 속하는 기술분야의프로그래머들에 의해 용이하게 추론되거나 변경될 수도 있다.또한 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는 네트워크로 커넥션된 컴퓨터 시스 [0065]템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이 경우, 다수의 분산된컴퓨터 중 어느 하나 이상의 컴퓨터는 상기에 제시된 기능들 중 일부를 실행하고, 그 결과를 다른 분산된 컴퓨터들 중 하나 이상에 그 실행 결과를 전송할 수 있으며, 그 결과를 전송받은 컴퓨터 역시 상기에 제시된 기능들중 일부를 실행하여, 그 결과를 역시 다른 분산된 컴퓨터들에 제공할 수 있다. 이상에서 전술한 바와 같은, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로 [0066]그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광공개특허 10-2014-0008003-10-미디어 저장장치 등이 있다. 또한, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로그램인 애플리케이션을 [0067]기록한 컴퓨터로 읽을 수 있는 기록매체는, 애플리케이션 스토어 서버(Application Store Server), 애플리케이션 또는 해당 서비스와 관련된 웹 서버(Web Server) 등을 포함하는 애플리케이션 제공 서버(ApplicationProvider Server)에 포함된 저장매체(예: 하드디스크 등)이거나, 애플리케이션 제공 서버 그 자체일 수도 있으며, 프로그램을 기록한 다른 컴퓨터 또는 그 저장매체일 수도 있다.본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로그램인 애플리케이션을 기록 [0068]한 기록매체를 읽을 수 있는 컴퓨터는, 일반적인 데스크 탑이나 노트북 등의 일반 PC 뿐만 아니라, 스마트 폰,태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기를 포함할 수 있으며,이뿐만 아니라, 컴퓨팅(Computing) 가능한 모든 기기로 해석되어야 할 것이다. 만약, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로그램인 애플리케이션을 [0069]기록한 기록매체를 읽을 수 있는 컴퓨터가 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기인 경우, 모바일 단말기는 애플리케이션 스토어 서버, 웹 서버 등을 포함하는애플리케이션 제공 서버로부터 해당 애플리케이션을 다운로드 받아 설치할 수 있고, 경우에 따라서는, 애플리케이션 제공 서버에서 일반 PC로 다운로드 된 이후, 동기화 프로그램을 통해 모바일 단말기에 설치될 수도 있다. 이상에서, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설명 [0070]되었다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성요소들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖는 컴퓨터 프로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실시예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 등이 포함될 수 있다.또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, [0071]해당 구성 요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과동일한 의미를 가진다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥 상의 의미와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다.이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 [0072]서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의권리범위에 포함되는 것으로 해석되어야 할 것이다.공개특허 10-2014-0008003-11-도면도면1도면2공개특허 10-2014-0008003-12-도면3공개특허 10-2014-0008003-13-도면4도면5도면6공개특허 10-2014-0008003-14-도면7공개특허 10-2014-0008003-15-"}
{"patent_id": "10-2012-0074856", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 카드 게임을 제공하는 기술에 관한 것이다. 더욱 상세하게는 카드 게임에서 아이템을 사용하는 것에 관한 기술이다. 본 발명에 의하면, 어느 한 플레이어의 순서에서 제1플레이어가 제1아이템을 사용하는 것에 대응 하여, 제2플레이이어가 제2아이템을 사용하면 제1아이템의 효력이 발휘되지 않도록 한다. 이를 통해, 카드 게임 에서 제1플레이어의 아이템 사용을 제2플레이어가 방어할 수 있게 되는데, 이러한 새로운 기능으로 인해 게임에 대한 재미가 높아지는 효과가 발생한다."}
{"patent_id": "10-2012-0074856", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 카드 게임을 제공하는 기술에 관한 것이다. 더욱 상세하게는 카드 게임에서 아이템을 사용하는 것에 관한 기술이다."}
{"patent_id": "10-2012-0074856", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전통적인 카드 놀이가 온라인 혹은 오프라인 상의 카드 게임으로 개발되고 있다. 포커, 고스톱 등이 카드 게임 으로 개발된 대표적인 사례들이다. 이러한 카드 게임은 전통적인 카드 놀이의 룰 혹은 규칙을 그대로 모방하고 있어서 사용자들이 대면하지 않고 온라인을 통해 전통적인 카드 놀이의 재미를 똑같이 느낄 수 있게 해 준다. 카드 게임이 전술한 바와 같이 전통적인 카드 놀이의 룰 혹은 규칙을 그대로 모방하고 있는 것이 장점일 수도 있으나, 정형화된 카드 놀이 방법으로 인해 플레이어들은 게임에 대해 실증을 느낄 수 있다. 이러한 문제를 해 결하기 위해 카드 게임에서 아이템을 적용할 필요가 있다. 아이템을 사용하여 플레이어들은 미리 정해진 룰 혹 은 규칙에서 벗어나도록 카드 게임을 진행할 수 있다. 그런데, 카드 게임은 다수의 플레이어가 함께 하는 게임 임으로 어느 한 플레이어가 아이템을 사용하면 다른 한 플레이어에게 카드 게임이 불리하게 진행될 가능성이 있 다. 따라서, 어느 한 플레이어의 아이템 사용에 대해 다른 한 플레이어가 이를 저지할 수 있는 아이템을 제공할 필요가 있다. 전술한 목적을 달성하기 위하여, 일 측면에서, 본 발명은, 서버가 카드 게임을 제공하는 방법에 있어서, 상기 카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 단계; 제1플레이어의 순 서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신하는 단계; 상기 제1플레이어의 순서에서 제2단말로부 터 제2아이템에 대한 사용 요청을 수신하는 단계; 및 상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무 효 처리하는 단계를 포함하는 카드 게임을 제공하는 방법을 제공한다. 다른 측면에서, 본 발명은, 카드 게임에 참여한 복수의 플레이어들에 대해 정해진 순서에 따라 카드 게임을 진 행하는 제어부; 제1플레이어의 순서에서, 제1단말로부터 제1아이템에 대한 사용 요청을 수신하고 제2단말로부터 제2아이템에 대한 사용 요청을 수신하는 아이템 사용 요청 수신부; 및 상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 아이템 무효 처리부를 포함하는 카드 게임을 제공하는 서버를 제공한다. 또 다른 측면에서, 본 발명은, 카드 게임에 참여한 복수의 플레이어들에 대해 정해진 순서에 따라 카드 게임을 진행하는 제어부; 상기 복수의 플레이어 중 어느 한 플레이어의 순서에서, 인공지능 모듈에 의해 제어되는 제1 플레이어의 제1아이템 사용 요청을 표시 제어하고 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템 에 대한 사용 요청을 입력받는 아이템 사용 요청 입력부; 및 상기 제2아이템의 사용 요청에 따라 상기 제1아이 템을 무효 처리하는 아이템 무효 처리부를 포함하는 카드 게임을 제공하는 장치를 제공한다. 이상에서 설명한 바와 같이 본 발명에 의하면, 플레이어가 아이템을 사용하여 게임의 진행을 다이나믹하게 만들 수 있고, 또, 어느 한 플레이어의 아이템 사용에 대해 다른 한 플레이어가 그 사용을 저지할 수 있어, 게임에 참여한 모든 플레이어가 게임을 보다 재미있게 즐길 수 있게 하는 효과가 있다."}
{"patent_id": "10-2012-0074856", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 또한, 본 발명의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본 질이나 차례 또는 순서 등이 한정되지 않는다. 어떤 구성 요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\" 된다고 기재된 경우, 그 구성 요소는 그 다른 구성요소에 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구 성 요소 사이에 또 다른 구성 요소가 \"연결\", \"결합\" 또는 \"접속\"될 수도 있다고 이해되어야 할 것이다. 도 1은 본 발명의 일 실시예에 따른 카드 게임을 제공하는 네트워크 시스템에 대한 구성도이다. 도 1을 참 조하면, 서버 및 단말이 네트워크를 통해 연결되어 있다. 단말은 복수일 수 있다. 단말 은 네트워크를 통해 서버에 접속하여, 서버에서 제공하는 각종 서비스들을 출력하거나, 서 버와 연동하여 서비스에 필요한 일부 기능을 수행하거나, 서비스 수행에 필요한 입력 사항을 서버로 송신할 수 있다. 전술한 단말는, 일반적인 데스크 탑이나 노트북 등의 일반 PC를 포함하고, 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기 등을 포함할 수 있으며, 이에 제한 되지 않고, 서버와 통신 가능한 어떠한 전자 기기로 폭넓게 해석되어야 할 것이다. 전술한 서버는 하드웨어적으로는 통상적인 웹 서버(Web Server) 또는 웹 어플리케이션 서버(Web Application Server) 또는 왑 서버(WAP Server)와 동일한 구성을 하고 있다. 그러나, 소프트웨어적으로는, 도 2와 관련하여 아래에서 상세하게 설명할 바와 같이, C, C++, Java, PHP, .Net, Python, Ruby 등 여하한 언어를 통하여 구현되어 여러 가지 기능을 하는 프로그램 모듈(Module)을 포함할 수 있다. 또한, 서버는, 네트워크를 통하여 불특정 다수 클라이언트(단말을 포함) 및/또는 다른 서버와 연결될 수 있는데, 이에 따라, 서버는 클라이언트 또는 다른 서버의 작업수행 요청을 접수하고 그에 대한 작업 결과를 도출하여 제공하는 컴퓨터 시스템 또는 이러한 컴퓨터 시스템을 위하여 설치되어 있는 컴퓨터 소프 트웨어(서버 프로그램)를 뜻하는 것일 수도 있다. 또한, 서버는, 전술한 서버 프로그램 이외에도, 서버 상에서 동작하는 일련의 응용 프로그램 (Application Program)과, 경우에 따라서는 내부 또는 외부에 구축되어 있는 각종 데이터베이스를 포함하는 넓 은 개념으로 이해되어야 할 것이다. 또한, 서버는 콘텐츠, 각종 정보 및 데이터를 데이터베이스에 저장시키고 관리할 수 있다. 여기서, 데이터 베이스는 서버의 내부 또는 외부에 구현될 수 있다. 또한, 서버는 일반적인 서버용 하드웨어에 도스(DOS), 윈도우(windows), 리눅스(Linux), 유닉스(UNIX), 매킨토시(Macintosh) 등의 운영체제에 따라 다양하게 제공되고 있는 서버 프로그램을 이용하여 구현될 수 있으 며, 대표적인 것으로는 윈도우 환경에서 사용되는 웹 사이트(Website), IIS(Internet Information Server)와 유닉스환경에서 사용되는 Apache, Nginx, Light HTTP 등이 이용될 수 있다. 한편, 네트워크는 서버와 단말을 연결해주는 망(Network)으로서, LAN(Local Area Network), WAN(Wide Area Network)등의 폐쇄형 네트워크일 수도 있으나, 인터넷(Internet)과 같은 개방형 네트워크일 수도 있다. 여기서, 인터넷은 TCP/IP 프로토콜 및 그 상위계층에 존재하는 여러 서비스, 즉 HTTP(HyperText Transfer Protocol), Telnet, FTP(File Transfer Protocol), DNS(Domain Name System), SMTP(Simple Mail Transfer Protocol), SNMP(Simple Network Management Protocol), NFS(Network File Service), NIS(Network Information Service)를 제공하는 전 세계적인 개방형 컴퓨터 네트워크 구조를 의미한다. 또한, 단말이 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기를 포함하는 경우, 네트워크는 이동 통신망이나 와이파이(WiFi) 망 등의 무선 액세스 망을 더 포함 할 수도 있다. 도 2는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버의 내부 블록도이다. 도 2를 참조하면, 서버는 제어부, 아이템 사용 요청 수신부, 아이템 무효 처리부 등을 포 함할 수 있다. 제어부는 카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행하고, 아이템 사용 요청 수신부는 제1플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신하고, 제2단말로부터 제2아이템에 대한 사용 요청을 수신한다. 그리고, 아이템 무효 처리부는 제2아이 템의 사용 요청에 따라 제1아이템을 무효 처리한다. 여기서, 플레이어는 카드 게임에 참여하는 가상의 캐릭터로 서 단말에서의 사용자 조작 신호를 수신받아 제어되거나, 서버에 포함되어 있는 인공지능 모듈에 따라 제 어된다. 아래 명세서에서 사용자는 카드 게임을 이용하는 사람을 의미하고, 플레이어는 전술한 바와 같이 카드 게임에 참여하는 가상의 캐릭터임으로 이를 구별하여 이해해야 할 것이다. 서버의 각 블록들의 실시예들을 좀더 자세히 설명한다. 카드 게임은 컴퓨터 등의 전산 장비에서 카드 놀이를 할 수 있게 만든 게임인데, 포커라든지 고스톱 등이 이러 한 대표적인 카드 놀이라고 할 수 있다. 포커를 먼저 살펴 보면, 플레이어들에게 카드 패를 분배하고, 정해진 순위 값에 따라 다른 플레이어들에 비해 높은 순위의 카드 패를 가지고 있는 플레이어가 이기는 방식이다. 여러 플레이어가 함께 참여하는 방식이기 때문에 플레이어들에 대해 순서를 정해 놓고, 이렇게 정해진 순서에 따라 한 플레이어씩 플레이를 하게 된다. 플레이어들에게는 각자 자신에게 배정되는 카드 패가 있고, 게임의 진행에 따라 플레이어들에게 배정되거나 혹은 다른 용도로 사용될 예정인 패가 있다. 이렇게 포커는 정해진 순서에 따 라 각 플레이어가 카드 게임을 진행하고, 또한, 카드 게임에 사용되는 카드 패는 플레이어들에게 배정된 패와 배정되지 않은 나머지 패로 나누어진다는 기본적인 특성을 가지고 있다. 고스톱 또한, 포커와 유사한 특성을 가 지고 있다. 고스톱은 플레이어들에게 카드 패가 분배되고, 각 플레이어들은 분배된 패를 활용하여 아직 분배되 지 않은 카드 패를 획득하는 방식으로 카드 게임이 진행되는데, 이러한 과정을 통해 다른 플레이들 보다 높은 점수에 해당되는 카드 패를 획득하면 이기게 되는 방식을 따른다. 고스톱 또한 여러 플레이어가 함께 참여하는 방식이기 때문에 플레이어들에 대해 순서를 정해 놓고, 이렇게 정해진 순서에 따라 한 플레이어씩 플레이를 하 게 된다. 플레이어들에게는 각자 자신에게 배정되는 카드 패가 있고, 게임의 진행에 따라 플레이어들에게 배정 되거나 혹은 다른 용도로 사용될 예정인 패가 있다. 결국 포커와 유사하게 정해진 순서에 따라 각 플레이어가 카드 게임을 진행하고, 또한, 카드 게임에 사용되는 카드 패는 플레이어들에게 배정된 패와 배정되지 않은 나머 지 패로 나누어진다는 기본적인 특성을 가지고 있다. 이외에도, 카드를 이용하여 게임을 진행하는 카드 게임들 은 위와 같은 특성을 가지고 있는 경우가 많다. 아이들 사이에서 유행되는 일부 애니메이션을 모티브로한 카드 게임이나 성인들 사이에서 도박의 형태로 진행되는 다양한 카드 게임들도 모두 전술한 특성들을 가지고 있다고 할 수 있다. 제어부는 특정 룰을 적용하여 카드 게임을 진행한다. 특정 룰이란 카드 놀이를 통해 알려진 카드 놀이 방 법일 수도 있으나, 이에 변칙을 넣어 카드 놀이보다 더 흥미를 가질 수 있도록 새롭게 만든 룰일 수도 있다. 카 드 게임은 정해진 순서에 따라 각 플레이어별로 진행됨으로 제어부는 이렇게 정해진 순서에 따라 각 플레 이어가 카드 게임을 진행할 수 있도록 제어하는 역할을 한다. 카드 게임이 전통적인 카드 놀이의 기본 룰을 따르고 있지만, 이러한 기본 룰만 적용된다면 플레이어들은 카드 게임에 대해 쉽게 실증을 낼 수 있다. 이러한 문제를 개선하기 위해 카드 게임에서 각 플레이어가 아이템을 사 용할 수 있게 할 수 있다. 고스톱 카드 게임을 통해 아이템의 예시에 대해 설명하기로 한다. 하지만, 이러한 아 이템들은 포커 등 다른 카드 게임에도 적용될 수 있으므로, 아래에서 제시한 예시를 고스톱 카드 게임에 한정하 여 이해할 필요는 없다. 고스톱은 카드 게임의 시작과 함께 참여 플레이어들에게 일정 수의 패를 분배하고, 각 플레이어들은 분배된 일 정 수의 패를 이용하여, 분배되지 않은 패를 획득하면서 획득된 패들의 점수로 승패를 가리게 된다. 이러한 카 드 게임의 진행에 있어, 각 플레이어들에게 분배되지 않고 어떤 패인지 알지 못하게 쌓여 있는 패들이 있다. 어 떤 패인지 알지 못하게 쌓아 놓는 것이 기본 룰인데, 여기에 투시 아이템을 적용할 수 있다. 투시 아이템은 플 레이어들이 보유하지 않은 패 중 일부 혹은 전부의 패에 대한 정보를 투시 아이템을 사용하는 플레이어에게 공 개하는 것이다. 이렇게 되면, 해당 투시 아이템을 사용하는 플레이어는 다른 플레이어들에 비해 유리한 상황에 서 카드 게임을 진행할 수 있게 된다. 적용할 수 있는 아이템의 다른 예시로서, 체인지 아이템이 있다. 체인지 아이템은 어느 한 플레이어가 보유한 어느 한 패를 플레이어들이 보유하지 않은 패 중의 한 패와 교환하도록 하 는 것이다. 카드 게임의 시작과 함께 자신에게 일정 수의 카드 패가 분배되는데, 분배받은 패가 마음에 들지 않 을 수 있다. 이 때, 이 체인지 아이템을 사용하는 플레이어는 마음에 들지 않는 패를 다른 패로 교환할 수 있게 되는 것이다. 이외에도, 카드 게임에서 획득하는 점수에 비례하여 승자에게 캐시(cash)를 지급하기로 한 경우, 특정 판에 대해서 캐시를 두 배로 올리게 하는 더블판 아이템을 적용할 수도 있다. 카드 게임이 시작되고, 자신 이 승리할 것이라는 확신이 드는 경우, 이러한 더블판 아이템을 적용하여 보다 많은 캐시를 획득할 수 있는 장 점이 있다. 또 다른 예시로, 카드 패 뺏기 아이템은 다른 플레이어가 카드 진행에 따라 획득한 특정 패를 이 아이템을 사용하는 플레이어에게 옮겨주느 역할을 한다. 이외에도, 아이템을 사용하는 플레이어에게 게임의 진행 이 유리하게 될 수 있는 다양한 아이템을 생각해 볼 수 있을 것이다. 아이템으로 사용될 수 있는 것에 대해 몇 가지 예시를 들어 설명하였다. 그런데, 카드 게임이 컴퓨터로 계산되 고 제어되는 플레이어를 상대로 진행된다면, 전술한 아이템의 사용에 별 문제가 없을 것이다. 문제는 다수의 사 용자가 각자의 플레이어를 제어하여 카드 게임을 진행할 때 발생한다. 어느 한 플레이어가 전술한 것과 같이 자 신에게 유리한 상황을 만들 수 있는 아이템을 사용한다면 그 반대로 다른 플레이어에게는 카드 게임이 불리한 상황으로 진행된다는 것을 의미한다. 이렇게 되면, 아이템을 사용하지 않은 플레이어는 게임에 대해 불만을 가 지게 되고, 게임에 대한 흥미를 잃을 수 있다. 따라서, 이러한 아이템의 사용을 저지할 수 있는 아이템이 있을 필요가 있다. 본 발명에서 이에 대한 것을 어떻게 적용하고 있는지 아이템 사용 요청 수신부와 아이템 무 효 처리부에 대한 설명과 함께 살펴본다. 아이템 사용 요청 수신부는 사용자로부터 아이템에 대한 사용 요청을 수신하는 블록이다. 아이템 사용 요 청 수신부는 어느 한 플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신하고, 제2단 말로부터 제2아이템에 대한 사용 요청을 수신한다. 제2아이템은 제1아이템의 적용을 무효화하는 아이템으로 제2 아이템을 제1아이템과 같은 어느 한 플레이어의 순서에서 그 사용 요청을 수신하는 것은 카드 게임의 특성상 어 느 한 플레이어의 순서가 마무리되고, 다음 플레이어의 순서가 되면 어느 한 플레이어의 순서에서 진행된 내용 은 모두 확정되기 때문이다. 따라서, 다음 플레이어의 순서로 넘어가기 전에 어느 한 플레이어의 순서에서 제1 아이템에 사용되었다면, 같은 순서에서 제2아이템에 대한 사용 요청을 받아 제1아이템을 게임에 적용할 것인지 적용하지 않을 것인지 확정해야하기 때문이다. 아이템 무효 처리부는 이렇게 제2아이템의 사용 요청이 아이템 사용 요청 수신부로 수신되면, 제1아 이템을 무효 처리한다. 제1아이템이 사용되고, 제2아이템이 다시 사용되어 제1아이템이 무효 처리되는 과정을 도 3을 참조하여 설명한 다. 도 3은 정해진 순서에 따라 아이템을 사용하면서 카드 게임을 진행하는 것을 도시한 흐름도이다. 도 3을 참조하면, 먼저 게임에 참여할 플레이어들이 확정되고 게임이 시작된다(S300). 그리고, 제어부에 의해 정해진 순서에 따라 각 플레이어의 플레이가 진행된다. 카드 게임이 진행되다가 제1플레이어의 순서가 된 다(S302). 아이템 사용 요청 수신부는 제1플레이어 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수신한다(S304에서 Yes). 여기서는 카드 게임에 대해 미리 정해진 룰을 벗어나서 카드 게임이 진행되도록 하는 공격 아이템을 제1아이템으로 가정하였다. 제1단말은 제1플레이어를 제어하는 단말일 수 있다. 자신의 순서에서 공격 아이템을 사용하는 것이 바람직할 수 있으나, 이로 제한되는 것은 아니며, 다른 플레이어의 순서에서 공격 아이템을 사용할 수도 있는 것이다. 제1단말로부터 제1아이템에 대한 사용 요청이 없다면(S304에서 No), 제1플 레이어의 플레이가 마무리되고, 게임은 다음 플레이어인 제2플레이어 순서로 변경된다(S312). 제1아이템에 대한 사용 요청이 수신된 후, 다른 플레이어로부터 제2아이템에 대한 사용 요청을 대기하게 되는데, 이때 제2아이템 에 대한 사용 요청이 수신되지 않으면(S306에서 No), 제1아이템에 해당되는 공격 아이템은 게임에 적용되고 (S308), 카드 게임은 다음 순서인 제2플레이어의 순서로 변경된다(S312). 아이템 사용 요청 수신부를 통해 제2단말로부터 제2아이템에 대한 사용 요청이 수신되면(S306에서 Yes), 제1아이템에 해당되는 공격 아이템이 아 직 게임에 적용되지 않았기 때문에, 아이템 무효 처리부는 공격 아이템은 무효 처리하여 게임에 적용하지 않고(S310), 제1플레이어의 플레이가 마무리되는데로, 다음 순서인 제2플레이어 순서로 변경된다(S312). 제1아 이템으로서의 공격 아이템을 무효화한다는 측면에서 제2아이템은 방어 아이템이라고 부를 수 있다. 이후 제2플 레이어의 순서가 진행되고, 이후 카드 게임 전체가 마무리되면 게임이 종료된다(S314). 도 4는 고스톱 카드 게임에서 방어 아이템을 사용하는 예시 도면인데, 도 3과 같이 카드 게임이 진행되는 과정 에서 제1플레이어가 투시 아이템을 사용하고 이에 대응하여 제2플레이어가 방어 아이템을 사용하고자 하는 것을 나타낸다. 도 4를 참조하면, 제1플레이어는 10개의 패를 보유하고 있고, 제2플레이어 또한 10개의 패(40 4)를 보유하고 있다. 카드 게임의 중앙 화면에는 게임에 참여한 제1플레이어 및 제2플레이어에게 분배되지 않은 더미 패가 표시되고 있다. 화면은 제1플레이어가 투시 아이템을 사용 요청한 상황을 묘사하고 있는데, 제1 플레이어가 투시 아이템을 사용 요청함에 따라 서버는 이러한 정보를 제2플레이어를 제어하는 단말로 접속 한 사용자가 알 수 있도록 화면에 표시하고 있다. 제1플레이어의 투시 아이템 사용 요청에 대응하여 제2플레이어는 방어 아이템을 보유하고 있음으로 이를 사용하여 투시 아이템이 카드 게임에 적용되는 것을 저지 할 수 있다. 서버의 기본 블록들에 대해 설명하였는데, 부가적으로 서버의 몇 가지 실시예들을 더 설명하기로 한 다. 서버는 제1단말로부터 제1아이템에 대한 사용 요청을 수신한 후, 이러한 제1아이템 사용 요청 정보를 제2 단말로 출력 제어할 수 있다. 제1단말을 통해 제1플레이어가 제어되고, 제2단말을 통해 제2플레이어가 제어된다 고 할 때, 제1플레이어가 제1아이템을 사용하여 자신에게 유리한 상황을 구축하려고 할 때, 제2플레이어에게 이 러한 정보를 알려 제2플레이어가 이를 저지할 수 있는 기회를 제공하기 위함이다. 아이템 사용 요청 수신부는 어느 한 플레이어의 순서에서 제1단말로부터 제1아이템에 대한 사용 요청을 수 신하고, 같은 순서에서 제2단말로부터 제2아이템에 대한 사용 요청을 수신하게 되는데, 이러한 어느 한 플레이 어의 순서는 제1단말로 제어되는 플레이어의 순서이거나 제2단말로 제어되는 플레이어의 순서일 수 있다. 어느 한 플레이어의 순서가 제1단말로 제어되는 플레이어의 순서라는 것은 자신의 순서에서 제1아이템을 사용할 수 있다는 것으로 제1아이템이 공격 아이템인 경우, 자신의 순서에서 공격 아이템을 쓸 수 있다는 것이다. 반대로 어느 한 플레이어의 순서가 제2단말로 제어되는 플레이어의 순서라는 것은 상대방에게 불리함을 주고자 하는 플 레이어의 순서에 제1단말로 제어되는 플레이어가 제1아이템을 사용하고, 그 순서에 해당되는 플레이어인 제2단 말로 제어되는 플레이어가 제2아이템(예를 들어, 방어 아이템)을 사용할 수 있게 되는 것이다. 아이템 사용 요청 수신부를 통해 제1아이템에 대한 사용 요청을 수신한 후 일정 시간 이내에 제2아이템에 대한 사용 요청이 수신되는 경우에 아이템 무효 처리부는 제1아이템을 무효 처리할 수 있다. 이러한 방식 은 게임의 신속한 진행을 위해 타임 제도를 도입하는 것으로서 아이템 무효 처리부는 일정 시간 이내에 제 2아이템에 대한 사용 요청이 수신되지 않았음을 파악하게 되는 경우 제1아이템을 무효화하지 않게 되고, 서버 는 제1아이템을 게임에 적용하게 된다. 자신에게 유리한 상황을 만들 수 있는 제1아이템을 어떻게 획득하는지도 관심이 가는 사항일 수 있다. 제어부 는 플레이어들에게 패를 분배하면서 제1아이템을 제1단말로 제어되는 플레이어에게 분배할 수 있다. 게임 의 상황으로 묘사한다면, 게임 시작하면서 몇 개의 제1아이템을 랜덤 혹은 일정 규칙에 따라 게임에 참여한 플 레이어들에게 분배하여 사용하게 할 수 있다. 제2아이템도 마찬가지이다. 제어부는 제2아이템도 제1아이템 처럼 게임 시작과 함께 플레이어들에게 분배시켜 줄 수 있다. 플레이어가 제1아이템 혹은 제2아이템을 획득하는 다른 경우도 있다. 카드 게임 도중에 일정 미션을 제공하고 이러한 미션을 달성하는 경우 제1아이템 혹은 제2아 이템을 미션을 성공시킨 플레이어에게 배부할 수도 있다. 예를 들어, 포커에서 원 페어(one pair)에 해당되는 패를 보유하게 되었다면, 해당 패를 보유한 플레이어에게 제1아이템을 제공할 수 있다. 이상에서는, 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버에 대하여 설명하였으며, 이하에서는, 본 발명의 일 실시예에 따른 서버가 카드 게임을 제공하는 방법에 대하여 설명한다. 후술하게 될 본 발명 의 일 실시예에 따른 카드 게임을 제공하는 방법은, 도 2에 도시된 본 발명의 일 실시예에 따른 서버에 의 해 모두 수행될 수 있다. 도 5는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다. 도 5를 참조하면, 서버는 참가가 확정된 플레이이들에 대해 카드 게임을 진행한다(S500). 플레이어들에 대 해 정해진 순서에 따라 카드 게임이 진행되다가, 서버는 어느 한 플레이어의 순서에서 제1단말로부터 제1 아이템에 대한 사용 요청을 수신한다(S502). 그리고, 서버는 어느 한 플레이어의 같은 순서에서 제2단말로 부터 제2아이템에 대한 사용 요청을 수신하게 된다(S504). 이렇게 제2아이템에 대한 사용 요청을 수신한 서버 는 제1아이템을 무효 처리하고(S506), 다음 순서에 따라 게임을 계속 진행하게 된다. 이상에서는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법이 도 5에서와 같은 절차로 수행되는 것으로 설명되었으나, 이는 설명의 편의를 위한 것일 뿐, 본 발명의 본질적인 개념을 벗어나지 않는 범위 내에서, 구현 방식에 따라 각 단계의 수행 절차가 바뀌거나 둘 이상의 단계가 통합되거나 하나의 단계가 둘 이상의 단계로 분 리되어 수행될 수도 있다. 이상에서 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버 및 방법에 대해 설명하였다. 이하에서는 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치 및 방법, 그리고 그 방법을 실행시키기 위한 프로그램을 기록한 기록매체에 대해 설명한다. 앞서 설명한 단말과 장치는 하드웨어적으로 같은 종류일 수 있으나, 장치가 전술한 서버와 연동하여 본 발명의 일 실시예에 따른 네트워크 시스템을 구성하는 것은 아니다. 따라서, 본 발명의 다른 실시예에 따른 장치와 앞서 설명한 단말은 구별하여 인식할 필 요가 있다. 도 6은 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치의 내부 블록도이다. 장치의 대표적인 실시예는 네트워크 연결이 없이 단독으로 운전되는 컴퓨팅 장치일 수 있다. 태블릿 피씨 이나 네트워크 연결이 없는 형태가 대표적인 장치의 예시일 수 있다. 이런 경우, 장치를 사용하는 사 용자의 조작에 따라 제어되는 플레이어 외에 다른 플레이어는 인공지능 모듈과 같은 장치 내에 포함되어 있는 모듈에 의해 제어되는 형태일 수 있다. 물론 본 발명의 다른 실시예에 따른 장치도 네트워크로 연결 된 다른 단말에 의해 조작 신호를 받아 특정 플레이어를 제어할 수 있다. 따라서, 아래에서 장치에 연결된 신호 입력 장치(예를 들어, 마우스, 키보드 등)를 통해 입력되는 사용자 조작 신호에 따라 제어되는 플레이어 외에 다른 플레이어는 장치에 포함된 인공지능 모듈 혹은 특정 프로그램에 의해 제어된다고 가정하여 실시 예를 설명하였다고 하여 장치를 이러한 구성으로 제한하여 해석할 필요는 없다. 도 6을 참조하면, 장치는 제어부, 아이템 사용 요청 입력부, 아이템 무효 처리부 등을 포 함할 수 있다. 제어부는 카드 게임에 참여한 복수의 플레이어에 대해 정해진 순서에 따라 카드 게임을 진행한다. 아이템 사용 요청 입력부는 어느 한 플레이어의 순서에서, 인공지능 모듈에 의해 제어되는 제1플레이어의 제1아이템 사용 요청을 표시 제어하고, 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템에 대한 사 용 요청을 입력받는다. 또는 아이템 사용 요청 입력부는 그 반대로 어느 한 플레이어의 순서에서, 사용자 조작에 따라 제어되는 제2플레이어의 제1아이템에 대한 사용 요청을 수신하고, 인공지능 모듈에 의해 제어되는 제1플레이어의 제2아이템 사용 요청을 처리한다. 플레이어가 둘이라고 가정하고, 제1플레이어가 장치에 포함된 인공지능 모듈에 의해 제어되며 제2플레이어 가 사용자 조작에 따라 제어된다고 가정할 때, 아이템 사용 요청 입력부는 어느 한 플레이어의 순서에서 인공지능 모듈에 의해 제어되는 제1플레이어가 사용 요청한 제1아이템에 대한 정보를 사용자가 인식할 수 있도 록 화면으로 출력하고, 사용자가 이에 대해 제2아이템을 사용하겠다는 사용자 조작을 하면, 이러한 사용자 조작 에 따라 제2아이템에 대한 사용 요청을 입력받는다. 반대로 제2플레이어가 장치에 포함된 인공지능 모듈에 의해 제어되고, 제1플레이어가 사용자 조작에 따라 제어된다고 가정할 때, 아이템 사용 요청 입력부는 어느 한 플레이어의 순서에서 사용자 조작을 인식하고 이러한 사용자 조작에 따를 제1아이템 사용 요청을 수신하고, 이에 반응하는 인공지능 모듈의 제어에 따라 제2 플레이어가 제2아이템을 사용 요청하는 것을 처리할 수 있다. 아이템 무효 처리부는 이러한 제2아이템의 사용 요청에 따라 제1아이템을 무효 처리한다. 제1아이템이 무 효 처리됨에 따라, 제어부는 제1아이템의 효과를 적용하지 않고, 계속해서 다음 순서의 플레이어를 통해 카드 게임을 진행하게 된다. 이상에서는, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치에 대하여 설명하였으며, 이하에서 는, 본 발명의 다른 실시예에 따른 장치가 카드 게임을 제공하는 방법에 대하여 설명한다. 후술하게 될 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법은, 도 6에 도시된 본 발명의 다른 실시예에 따른 장치 에 의해 모두 수행될 수 있다. 도 7은 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다. 도 7을 참조하면, 장치는 플레이어들에 대해 정해진 순서에 따라 카드 게임을 진행한다(S600). 장치 는 카드 게임이 진행되는 과정에서 어느 한 플레이어의 순서에서 제1아이템에 대한 특정 플레이어의 사용 요청 을 화면으로 표시제어하고(S702), 사용자 조작에 따라 제2아이템에 대한 사용 요청을 입력받는다(S704). 이렇게 제2아이템에 대한 사용 요청이 입력됨에 따라 장치는 제1아이템을 무효 처리하고(S706), 다음 순서의 플레 이어에 대한 카드 게임을 계속해서 진행한다.이상에서는 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법이 도 7에서와 같은 절차로 수행되는 것으 로 설명되었으나, 이는 설명의 편의를 위한 것일 뿐, 본 발명의 본질적인 개념을 벗어나지 않는 범위 내에서, 구현 방식에 따라 각 단계의 수행 절차가 바뀌거나 둘 이상의 단계가 통합되거나 하나의 단계가 둘 이상의 단계 로 분리되어 수행될 수도 있다. 이상에서 전술한 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법은, 장치에 기본적으로 설치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼에 포함되거나 운영체제 등에 포함되거나 호환되는 프로 그램일 수 있음)에 의해 실행될 수 있고, 또한, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 장치의 운영체제와 호환 가능하고 장치 에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 여기서, 장치의 운영체제는, 데스크 탑 등의 일반 PC에 설치되는 윈도우(Window), 매킨토시(Macintosh) 등의 운영체제이거나, 스마트폰, 태 블릿 PC 등의 모바일 단말기에 설치되는 iOS, 안드로이드(Android) 등의 모바일 전용 운영체제 등일 수도 있다. 이러한 의미에서, 전술한 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법은 장치에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고, 장치 등의 컴퓨터로 읽 을 수 있는 기록매체에 기록될 수 있다. 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 구현한 프로그램은, 카드 게임에 참여한 복수의 플 레이어에 대해 정해진 순서에 따라 카드 게임을 진행하는 기능과, 상기 복수의 플레이어 중 어느 한 플레이어의 순서에서 인공지능 모듈에 의해 제어되는 제1플레이어의 제1아이템 사용 요청을 표시 제어하는 기능과, 상기 어 느 한 플레이어의 순서에서 사용자 조작에 따라 제어되는 제2플레이어에 대해 제2아이템에 대한 사용 요청을 입 력받는 기능과, 상기 제2아이템의 사용 요청에 따라 상기 제1아이템을 무효 처리하는 기능 등을 실행한다. 이뿐 만 아니라, 도 6 내지 도 7을 참조하여 전술한 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법에 대 응되는 모든 기능을 실행할 수 있다. 이러한 프로그램은 컴퓨터에 의해 읽힐 수 있는 기록매체에 기록되고 컴퓨터에 의해 실행됨으로써 전술한 기능 들이 실행될 수 있다. 이와 같이, 컴퓨터가 기록매체에 기록된 프로그램을 읽어 들여 프로그램으로 구현된 카드 게임을 제공하는 방법 을 실행시키기 위하여, 전술한 프로그램은 컴퓨터의 프로세서(CPU)가 읽힐 수 있는 C, C++, JAVA, 기계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 전술한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Function Code)를 포함할 수 있고, 전 술한 기능들을 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수도 있다. 또한, 이러한 코드는 전술한 기능들을 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 컴퓨터 의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조 되어야 하는지에 대한 메모리 참조 관련 코드를 더 포함할 수 있다. 또한, 컴퓨터의 프로세서가 전술한 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서 버 등과 통신이 필요한 경우, 코드는 컴퓨터의 프로세서가 컴퓨터의 통신 모듈(예: 유선 및/또는 무선 통신 모 듈)을 이용하여 원격(Remote)에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야만 하는지, 통신 시 어떠 한 정보나 미디어를 송수신해야 하는지 등에 대한 통신 관련 코드를 더 포함할 수도 있다. 그리고, 본 발명을 구현하기 위한 기능적인(Functional) 프로그램과 이와 관련된 코드 및 코드 세그먼트 등은,"}
{"patent_id": "10-2012-0074856", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기록매체를 읽어서 프로그램을 실행시키는 컴퓨터의 시스템 환경 등을 고려하여, 본 발명이 속하는 기술분야의 프로그래머들에 의해 용이하게 추론되거나 변경될 수도 있다. 또한 전술한 바와 같은 프로그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는 네트워크로 커넥션된 컴퓨터 시스 템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장되고 실행될 수 있다. 이 경우, 다수의 분산된 컴퓨터 중 어느 하나 이상의 컴퓨터는 상기에 제시된 기능들 중 일부를 실행하고, 그 결과를 다른 분산된 컴퓨 터들 중 하나 이상에 그 실행 결과를 전송할 수 있으며, 그 결과를 전송받은 컴퓨터 역시 상기에 제시된 기능들 중 일부를 실행하여, 그 결과를 역시 다른 분산된 컴퓨터들에 제공할 수 있다. 이상에서 전술한 바와 같은, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로 그램을 기록한 컴퓨터로 읽힐 수 있는 기록매체는, 일 예로, ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광미디어 저장장치 등이 있다. 또한, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로그램인 애플리케이션을 기록한 컴퓨터로 읽을 수 있는 기록매체는, 애플리케이션 스토어 서버(Application Store Server), 애플리케이 션 또는 해당 서비스와 관련된 웹 서버(Web Server) 등을 포함하는 애플리케이션 제공 서버(Application Provider Server)에 포함된 저장매체(예: 하드디스크 등)이거나, 애플리케이션 제공 서버 그 자체일 수도 있으 며, 프로그램을 기록한 다른 컴퓨터 또는 그 저장매체일 수도 있다. 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로그램인 애플리케이션을 기록 한 기록매체를 읽을 수 있는 컴퓨터는, 일반적인 데스크 탑이나 노트북 등의 일반 PC 뿐만 아니라, 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동통신 단말기 등의 모바일 단말기를 포함할 수 있으며, 이뿐만 아니라, 컴퓨팅(Computing) 가능한 모든 기기로 해석되어야 할 것이다. 만약, 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법을 실행시키기 위한 프로그램인 애플리케이션을 기록한 기록매체를 읽을 수 있는 컴퓨터가 스마트 폰, 태블릿 PC, PDA(Personal Digital Assistants) 및 이동 통신 단말기 등의 모바일 단말기인 경우, 모바일 단말기는 애플리케이션 스토어 서버, 웹 서버 등을 포함하는 애플리케이션 제공 서버로부터 해당 애플리케이션을 다운로드 받아 설치할 수 있고, 경우에 따라서는, 애플리케 이션 제공 서버에서 일반 PC로 다운로드 된 이후, 동기화 프로그램을 통해 모바일 단말기에 설치될 수도 있다. 이상에서, 본 발명의 실시예를 구성하는 모든 구성 요소들이 하나로 결합되거나 결합되어 동작하는 것으로 설명 되었다고 해서, 본 발명이 반드시 이러한 실시예에 한정되는 것은 아니다. 즉, 본 발명의 목적 범위 안에서라면, 그 모든 구성 요소들이 하나 이상으로 선택적으로 결합하여 동작할 수도 있다. 또한, 그 모든 구성 요소들이 각각 하나의 독립적인 하드웨어로 구현될 수 있지만, 각 구성 요소들의 그 일부 또는 전부가 선택적으 로 조합되어 하나 또는 복수 개의 하드웨어에서 조합된 일부 또는 전부의 기능을 수행하는 프로그램 모듈을 갖 는 컴퓨터 프로그램으로서 구현될 수도 있다. 그 컴퓨터 프로그램을 구성하는 코드들 및 코드 세그먼트들은 본 발명의 기술 분야의 당업자에 의해 용이하게 추론될 수 있을 것이다. 이러한 컴퓨터 프로그램은 컴퓨터가 읽을 수 있는 저장매체(Computer Readable Media)에 저장되어 컴퓨터에 의하여 읽혀지고 실행됨으로써, 본 발명의 실 시예를 구현할 수 있다. 컴퓨터 프로그램의 저장매체로서는 자기 기록매체, 광 기록매체, 등이 포함될 수 있다. 또한, 이상에서 기재된 \"포함하다\", \"구성하다\" 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소가 내재될 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요 소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문맥 상의 의미 와 일치하는 것으로 해석되어야 하며, 본 발명에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적 인 의미로 해석되지 않는다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하 기 위한 것이고, 이러한 실시예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2012-0074856", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 카드 게임을 제공하는 네트워크 시스템에 대한 구성도이다. 도 2는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 서버의 내부 블록도이다. 도 3은 정해진 순서에 따라 아이템을 사용하면서 카드 게임을 진행하는 것을 도시한 흐름도이다. 도 4는 고스톱 카드 게임에서 방어 아이템을 사용하는 예시 도면이다. 도 5는 본 발명의 일 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다. 도 6는 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 장치의 내부 블록도이다. 도 7은 본 발명의 다른 실시예에 따른 카드 게임을 제공하는 방법의 흐름도이다."}
