{"patent_id": "10-2019-0042321", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0120009", "출원번호": "10-2019-0042321", "발명의 명칭": "다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구", "출원인": "주식회사 센서위드유", "발명자": "이윤식"}}
{"patent_id": "10-2019-0042321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "공중부유형 탄소 나노 구조체 표면에 유해가스와 반응하여 전기적 전도도가 변하는 기능성 가스 감지물질(금속, 산화물 반도체 나노선, 산화물 반도체 박막), 피독현상을 제거하기 위한 피독물질, 선택적으로 패터닝하여 다중의 나노 물질, 하이브리드(hybrid) 나노 구조 및 계층형 나노 구조로 이루어지는 히터(10) 일체형센서(10)를 형성하는 것을 특징으로 하는 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센서."}
{"patent_id": "10-2019-0042321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 히터 일체형 센서(10)는, 공중부유형 탄소 나노와이어 기반 히터 및 절연층 코팅 공정까지 수행한 이후, 금속산화물 반도체의 씨앗층(seed layer)(11)을 감지물질(ZnO, CuO, SNO2 등)로 나누어 각각 증착한 후, 각 반도체 물질을 포함한 수용액상에서 나노물질을 각각 성장시켜 금속 전극을 패터닝하여 감지물질(ZnO, CuO, SNO2 등)을 나노와이어 형태로 구성하고, 피독현상의 제거하기 위한 피독물질을 혼합 또는 융합하여 감도를 지속적으로 장시간 유지가 가능한 신뢰성을 보유하는 것을 특징으로 하는 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을가진 병렬 센서 구조의 센서."}
{"patent_id": "10-2019-0042321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "단위센서(10)가 어레이 형식으로 복수센서로 구현되어, 개별 센서의 감지물질과 피독물질, 병렬로 연결된 단위센서(10)의 감도 차이를 축소하여 복합센서의 성능을 최적화하고, 피독현상을 제거하고 신뢰성을 위하여 융합된감지물질과 피독물질의 특성 확보를 위하여, 학습 된 알고리즘과 인공지능 기법을 사용하여 실시간으로 여러 종류의 가스를 측정하는 센서 어레이모듈(100)과;센서 어레이모듈(100)로부터 인가되는 여러 종류의 가스의 농도 값을 확인할 수 있도록 신호를 변환하고, 변환된 신호를 시리얼 통신을 이용하여 사용자 단말(300)로 인가하는 신호처리칩(200)과; 출력 값을 시리얼 통신을 이용하여 PC 또는 스마트폰으로 전달받아 매트랩(MATLAB) 상에서 뉴런 네트워크 패턴인식을 수행하고 이를 통해 예측되는 가스의 농도 값을 그래프 및 정량적인 수치로 나타냄으로 패턴인식을 수행하는 사용자 단말(300);를 포함하는 것을 특징으로 하는 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센서 플랫폼."}
{"patent_id": "10-2019-0042321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 신호처리칩(200)은, 8ch MUX(210)와, 기준회로 블럭(220), 초저전력 회로변환블럭(230) 및 확대기반 고해상도 회로변환블럭(240)를포함하고,센서를 통해 입력되는 다중의 입력신호 중에서 조건에 맞는 특정의 입력신호만을 선택적으로 출력하는 8ch공개특허 10-2020-0120009-3-MUX(210)와; 센서 신호를 통해 동작 타이밍을 결정, 클럭신호를 생성, 전압을 분배, 입력신호에서 차이를 가인으로 증폭할있도록 클럭발진기(CLK GEN: Clock Gennrator)(221), 저잡음 LDO(Low Dropout) 레귤레이터(222) 및 밴드갭회로(BGR: Bandgap voltage reference)(223)로 이루어지는 기준회로 블럭(220)와; 8ch MUX(210)에서 인가되는 신호의 분배, 전력소모를 최소화 및 디스차지(discharge)되는 시간을 슈키트트리거인버터 회로(Schmitt trigger inverter)와 카운터(counter)룰 통해 측정하여 저항값을 분석할 수 있도록 모드컨트롤러(Mode Control)(231)와 레지스터 디지털컨버터(232)로 구성되는 초저전력 회로변환블럭(Low PowerMonitoring mode)(230)와; 센서 저항 신호를 전압 신호로 변환, 전압신호의 증폭, 입력 저항에 상관 없이 전체 저항범위에서 동일하게 고해상도로 센서 신호를 분석 및 아나로그신호를 디지털신호로 변환할 수 있도록 R-to-V(241)와, 줌-인CDS(Zoom-in CDS)(242)와, 증분식ADC(Incremental ADC(Analog-to-Digital Converter))(243)로 이루어지는 확대기반 고해상도 회로변환블럭(Zoom-in based High Resolution Mode)(240);를 포함하는 것을 특징으로 하는 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센서 플랫폼."}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 의한 다종 복합가스 감지를 위한 복합센서 및 복합센서 플랫폼에 관한 것으로, 본 발명은 공중부유형 탄소 나노 구조체 표면에 유해가스와 반응하여 전기적 전도도가 변하는 기능성 가스 감지 물질(금속, 산화물 반 도체 나노선, 산화물 반도체 박막) 및 촉매 물질을 선택적으로 패터닝하여 다중의 나노 물질, 하이브리드 (뒷면에 계속)"}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센 서에 관한 것으로, 다종의 유해가스(NOx, SOx, CO, CH4, H2, 등)을 검출할 수 있도록 탄소 1D 나노구조의 센서 를 MEMS 공정을 사용하여 공중부유형 형태로 어레이 형식의 디바이스를 제작하여 통상적인 마이크로 포토리쏘그 래피, 박막 증착 또는 드랍 코팅 등의 일괄공정을 사용하여 나노와이어를 대면적으로 제작하여 선택적 패터닝이 가능한 센서 디바이스와 신뢰성이 확보된 MEMS 공정만을 사용하여 웨이퍼 기반을 둔 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센서에 관한 것이다. 또한, 공기에 포함된 여러 종의 유해가스에서 목표가스를 감지하기 위하여서, 목표가스에 최적화된 감지 물질을 어레이의 개별 센서에 장착하여 목표가스의 감지와 농도를 측정하며, 한 개의 센서를 이용하여 두 개 이상의 다 종 유해가스를 감지하기 위하여 개별 목표가스에 최적화된 각기 다른 감지 물질을 개별 센서에 장착하고, 목표 가스의 수만큼 개별 센서를 병렬 형태로 구성하여 여러 개의 목표가스를 동시에 감지 할 수 있는 방법을 제공한 다."}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 발명의 실시 예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 현대 사회에서 가스의 사용이 날로 늘어나면서 가스는 우리의 일상생활에 도움이 되기도 하지만 잘못 사용하였 을 경우에는 심각한 피해를 입히기도 한다. 이러한 위험성 때문에, 가스 피해를 사전에 예방하기 위하여 가연성 또는 유해성 가스를 조기에 감지 또는 검출하기 위한 수단으로서 센서의 활용이 늘고 있다. 최근 유해가스에 의 한 미세먼지가 급증하여 사회적인 대가 및 비용 손실이 크고, 국민의 생활 및 건강에 매우 중대하다. 미세먼지 의 발생은 자동차의 매연에 의한 질소산화물(NOx), 공단에서 발생되는 아황산가스(SOx), 메탄(CH4), 일산화탄소 (CO), 수소(H2) 등의 유해가스에 의하여 주로 발생하기 때문에, 유해가스가 생활과 건강에 직접 영향을 줄 뿐아 니라, 미세먼지를 통한 영향 또한 매우 크다. 통상적으로 유해가스 센서는 크게 고체 전해질, 접촉 연소식, 전기 화학식, 반도체식으로 분류된다. 이중에서 최근에 가장 많이 연구되고 있는 것은 반도체식 센서이다. 이는 반도체식 센서가 실리콘칩 위에 제조되거나 집 적됨으로써 일반 신호처리용 반도체 IC와 호환으로 다양한 응용에 적용하고, 제조와 동작에 있어서 저비용, 고 효율의 특성을 나타내기 때문이다. 종래의 반도체식 센서는 최저로부터 절연막, 실리콘 기판, 절연막이 순차적으로 적층되어 있는 구조이며, 히 터전극상에는 또 다른 절연막이 증착되고, 그 절연막상에는 감지전극과 경우에 실시 예에 따라 가스 감지막이 더 적층되는 다층 구조이다. 종래의 반도체식 센서에서는 가스 감지막을 형성하기 위하여 통상적인 방법으로 마이크로 주사기를 이용하여 감 지전극의 중심부에 정확하게 감지물질을 드롭(drop)하여야 하는 공정상의 어려움이 있다. 이에 따라 감지물질인 나노 입자들이 불필요한 위치에 남게 되는 현상이 발생하기도 한다. 아울러 상술한 구조의 센서는 다층 박막구조를 이루고 있다. 즉, 히터전극과 감지전극이 동일한 평면상에 형성 된 것이 아니라, 적층된 복층 구조를 가지고 있다. 이러한 복층 구조의 센서는 제작 또는 제품 동작 중에 있어 서, 반도체식 가스 센서의 주된 문제점 중 하나는 가스 감지를 위하여 100도~ 200℃ 온도를 위한 히터가 필요하 고, 히터를 구성하는 구조에서 히터전극과 감지전극 간에 단락 현상이 발생할 가능성이 있어, 제품의 불량률이 높아지는 문제가 많다. 상기와 같은 문제점을 해결하기 위한 선행문헌으로 대한민국 등록특허공보 제10-1786803호(2017.11.15. 공고)의 \"Coffee-Ring Effect를 활용할 수 있는 가스 센서 플랫폼 및 그 제조방법\"의 센서는 서브스트레이트; 가스 센서 패턴베이스; 상기 패턴베이스의 동일 평면상에 패터닝되는 마이크로 전열기 전극 패턴과 센서 전극 패턴; 및 상 기 센서 전극 패턴 상에 코팅되는 감지물질;을 포함하되, 상기 마이크로 전열기 전극 패턴은 상기 패턴베이스의 일측에 마련되는 열원과 전기적으로 연결되는 구성으로서, 상기 열원으로부터 연장되는 전열선 및 상기 전열선 단부에 위치하는 가열부를 포함하고, 상기 센서 전극 패턴은 상기 패턴베이스의 일측에 마련되는 소스와 전기적 으로 연결되는 구성으로서, 상기 소스로 부터 연장되는 전극회로 및 상기 전극회로 단부에 위치하되 상기 가열 부의 외측을 둘러싸도록 형성되는 감지부를 포함하고, 상기 감지물질은 상기 감지부의 +극과 -극 사이에 드랍 (drop) 코팅되어 형성되는 것을 특징으로 한다. 상기의 선행문헌은 외부히터를 사용하여 히터 온도에 따른 금속산화물 나노물질 기반 센서부의 저항변화와 일체 형 히터의 인가전압에 따른 센서부 저항변화를 비교하여 인가전압에 따른 일체형 히터의 온도를 예측하였다. 또한, 인가전압에 따른 히터의 온도가 기하급수적으로 상승하나 온도 상승 비율이 낮으며 상대적으로 예측 값보 다 높은데, 이는 외부히터를 이용하여 온도에 따른 센서부 저항변화에 따른 센서부의 구조 전체가 가열되는 반 면, 히터 일체형 센서의 경우 온도분포가 균일하지 않기 때문에 오차가 발생하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-1786803호(2017.11.15. 공고)"}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 문제점을 해결하기 위한 본 발명은 공기 중에 있는 다종의 유해가스 (NOx, SOx, CO, CH4, H2)등을 검출할 수 있도록 탄소 1D 나노구조 또는 마이크로 전극을 공중부유형으로 일반적인 저가격의 MEMS 공정을 사용하여 구 현하고, 이러한 공중부유형 형태로 구성하여 일반적인 마이크로 포토리쏘그래피, 박막 증착 또는 드랍 코팅 등 의 일괄공정을 사용하며, 반도체 나노선을 넓은 면적으로 선택적 패터닝이 가능한 구조를 고안하여 신뢰성이 확 보된 MEMS 공정만을 사용하고, 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센서 를 제공하는 데 목적이 있다. 본 발명은 여러 종류의 가스가 혼재하고 있는 실내와 실외 공기의 유해가스(NOx, SOx, CO, CH4, H2, 등) 중 목 표가스 감지와 농도 측정을 위한 센서를 개발한다. 목표가스가 여럿인 경우에는 개별 센서를 목표 가스의 수만 큼 여러 개를 장착하여, 다종 가스의 감지와 농도 측정을 수행하게 된다. 다종 가스 측정이 가능하려면 개별 센 서를 목표가스에 최적화된 디바이스 구조에 감지물질을 장착한 개별 센서를 개발하고, 다종가스는 목표가스의 수만큼의 디바이스 구조에 다른 감지물질을 장착한 개별 센서를 병렬로 연결하여 다종의 목표가스의 감지와 농 도를 측정하게 된다. 병렬로 연결된 센서들의 감지 신호는 신호처리용 반도체 회로의 개별 채널에 연결되어 노이즈제거, 신호 등 회로의 전달을 위한 가공을 거치게 된다. 특히, 본 발명은 병렬로 연결된 개별 센서들은 제작 및 설치 후 시간이 경과함에 따라서, 감지물질이 산소와 반 응하여 감지부에 이산화규소가 생성되어 감지부의 감도를 떨어뜨리는 현상을 보인다. 이러한 피독 메커니즘의 제거를 위한 기술적인 고안이 필요하여, 센서 감지물질에 고산화성 물질을 코팅하여 피독 메커니즘을 발생시키 는 활성화 에너지를 낮추어, 산소와 반응하기 전에 센서의 감지 표면으로부터 증발시켜 피독을 방지하는 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 센서와 센서 플랫폼을 제공하는 데 목적이 있다. 또한, 다수의 개별 센서에 포함된 감지물질이 동일한 수준의 피독현상을 나타내는 것이 아니기 때문에 개별 센 서의 감지물질의 종류에 따른 피독현상의 분석이 필요하고, 개별 센서의 상이한 피독 현상과 감도 저하량을 분 석하고 적용하기 위한 기술이 있어야 다종의 가스 감지를 동시에 수행할 수 있고, 개별 센서의 피독 증상과 분 석을 위하여 인공지능 기법(PCA, CNN)을 사용하여 센서 감지부의 시간에 따른 피독현상과 감지부의 감도 저항량, 피독 방지와 센서의 감도유지가 필요한 목적을 갖는다."}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 상기한 목적을 달성하기 위한 수단으로, 공중부유형 탄소 나노 구조체 표면에 유해가스와 반응하여 전기적 전도도가 변하는 기능성 가스 감지 물질(금속, 산화물 반도체 나노선, 산화물 반도체 박막) 및 피독현상을 제거하기 위한 피독물질을 선택적으로 패터닝하여 다중의 나노 물질, 하이브리드(hybrid) 나노 구조 및 계층형 나노 구조로 이루어지는 히터 일체형 센서를 형성하는 것을 특징으로 하는 다종 복합가스 감지용 나노 센서의 감도와 신뢰성 향상을 위한 피독기능을 가진 병렬 센서 구조의 센서를 제공한다. 본 발명의 개별 센서는 히터 일체형 센서로써, 공중부유형 탄소 나노와이어 기반 히터 및 절연층 코팅 공정까지 수행한 이후, 금속산화물 반도체의 감지물질(ZnO, CuO, SnO2 등)을 각각 증착한 후, 각 반도체 물질을 포함한 수용액상에서 나노물질을 각각 성장시켜 금속 전극을 패터닝하여 감지물질을 나노와이어 형태나 나노플레이크 (nanoflake) 형태로 구성하여 목표 가스가 온도, 습도변화에 따라 변화하는 특성을 많은 데이터를 추출, 저장, 분석, 군집화하여 복합가스 내에서 목표가스를 선택할 수 있는 것을 특징으로 한다. 본 발명은 상기한 목적을 달성하기 위한 또 다른 수단으로, 개별 센서가 어레이 형식으로 병렬 연결되어 복수의 센서로 구성되어, 개별 센서의 감지물질과 피독물질, 병렬 로 연결된 개별 센서의 센서 감도의 차이를 최소화하여 복합 센서의 성능을 최적화뿐 아니라, 피독현상에 의한 센서 성능저하를 최소화하여 신뢰성을 제공한다. 또한, 본 발명은 병렬 연결된 다수의 개별 센서의 저항변화에 의한 전류 신호를 처리하기 위한 다채널의 반도체 회로는 센서 전류신호를 저전력 또는 고성능 처리를 가능하게 하며, 학습 알고리즘과 인공지능 기법을 포함하여 실시간으로 여러 종류의 유해가스를 측정하는 센서 모듈과; 센서모듈로부터 인가되는 여러 종류의 가스의 농도 값을 확인할 수 있도록 신호를 변환하고, 변환된 신호를 시리얼 통신을 이용하여 사용자 단말로 인가하는 신호 처리칩과; 출력 값을 유,무선 통신을 이용하여 PC 또는 스마트폰으로 전달받아 매트랩(MATLAB) 상에서 뉴런 네 트워크 패턴인식을 수행하고 이를 통해 예측되는 가스의 농도 값을 그래프 및 정량적인 수치로 나타냄으로 패턴 인식을 수행하는 사용자 단말기;를 포함하는 것을 특징으로 하는 다종 복합가스 감지를 위한 복합센서 플랫폼을 제공한다. 본 발명의 상기 신호처리칩은, 8ch MUX와, 변환부, 초저전력 모니터링 모드부 및 확대기반 고해상도 모드부를 포함하고, 센서를 통해 입력되는 다중의 입력신호 중에서 조건에 맞는 특정의 입력신호만을 선택적으로 출력하 는 8ch MUX와; 센서 신호를 통해 동작 타이밍을 결정, 클럭신호를 생성, 전압을 분배, 입력신호에서 차이를 가 인으로 증폭할 있도록 클럭발진기, 저잡음 LDO 레귤레이터 및 비지알로 이루어지는 변환부와; 8ch MUX에서 인가 되는 신호의 분배, 전력소모를 최소화 및 디스차지되는 시간을 슈키트 트리거 인버터와 카운터를 통해 측정하여 저항값을 분석할 수 있도록 모드컨트롤러와 리졸버 디지털 컨버터로 구성되는 초저전력 모니터링 모드부와; 센 서 저항 신호를 전압 신호로 변환, 전압신호의 증폭, 입력 저항에 상관 없이 전체 저항범위에서 동일하게 고해 상도로 센서 신호를 분석 및 아나로그신호를 디지털신호로 변환할 수 있도록 R-to-V와, 줌-인CDS와, 증폭ADC로 이루어지는 확대기반 고해상도 모드부를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 나노와이어를 공중부유형으로 기판과 떨어뜨려 브릿지 형태로 두 전극을 연결하도록 위치시키면 기판 으로부터의 오염, 노이즈 등의 영향을 줄이고, 가스 감지 면적의 확대로 인한 목표 가스 감도의 향상과, 반도체 식 가스 감지에 필요한 온도인 100~200℃를 일체형으로 효율적 구성과 기능 구현이 구조적으로 용이함과 동시에 나노와이어 부분만을 가열할 수 있어 소비전력을 획기적으로 감소시키는 효과가 있다. 특히, 센서가 공중부유형 구조로 구현됨으로써 기판부착형 대비 제작을 쉽게 할 수 있 수 있는 장점이 있어서 양산성을 가지고 있으며, 시간이 지남에 따라서 센서의 감도가 저하되는 센서의 피독현상을 방지하기 위하여 센 서의 수명을 장시간으로 높은 감도를 유지할 수 있는 내구성과 신뢰성을 가진 센서를 구현할 수 있는 효과가 있 다. 또한, 일반 대기환경인 복합가스 환경에서 다종의 가스가 혼합되어 있어서, 혼합된 가스에서 목표가스의 존재여 부, 농도의 측정, 온도나 습도 등 외부 환경에 따라서 실시간으로 변화하는 목표가스의 변화를 측정을 위한 기 술이며, 휴대용으로 구현 시에 국민과 산업 종사자 개개인의 건강, 산업 환경의 유해성 감지와 대응 등에 대처 할 수 있다. 인공지능과의 접목을 통하여, 감도의 향상, 외부 환경과의 접목, 목표가스와 센서의 동적인 변수를 적용하여, 매우 높은 감도와 적응성을 확보하여, IoT환경에서 최적으로 동작할 수 있는 효과가 있다. 또한, 공중부유형 복합 나노와이어 기반 히터 일체형 센서, 반도체 회로 기술(ROIC) 및 어레이 플랫폼 기술이 확보되어 고감도/고신뢰성/고선택도의 초소형 저전력 센서소자 생산이 가능하다."}
{"patent_id": "10-2019-0042321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명에 의한 다종 복합가스 감지를 위한 단위센서의 구조도이고, 도 2는 본 발명에 의한 다종 유해가 스 감지를 위한 어레이 형식의 센서 구조도이며, 도 3은 본 발명에 의한 센서와 피독현상을 제거하기 위한 피독 물질을 적용 전후의 유해가스 감지 감도 변화 그래프이며, 피독물질을 구성함에 있어서 1개에서 3개까지의 혼합 을 이용한 성능의 차이를 보여 주고 있으며, 도 4는 본 발명에 의한 감지물질 ZnO, CuO, SNO2 등으로 구현된 유 해가스 센서의 실시 예를 나타낸 도면이며, 도 5는 본 발명의 피독현상 설명도와 센서의 감도저하 현상을 나타 낸 도면이고, 도 6은 본 발명의 피독물질의 적용 효과에 대한 성능 그래프이다. 도 7은 다종 가스감지를 위한 다수의 센서와 연결되는 반도체 회로의 구성이며, 도 8은 센서와 반도체회로의 내부 구성을 나타낸다. 도 1 내지 8을 참조하여 상세하게 설명하면, 본 발명에 의한 다종 복합가스 감지를 위한 개별 센서로 구성되어 병렬로 연결된 복합 센서는 공중부유형 탄소 나노 구조체 표면에 유해가스와 반응하여 전기적 전도도가 변하는 기능성 가스 감지 물질(금속, 산화물 반도체 나노선, 산화물 반도체 박막) 및 촉매 물질을 선택적으로 패터닝하 여 다중의 나노 물질, 하이브리드(hybrid) 나노 구조 및 계층형 나노 구조로 이루어지는 히터 일체형 단위센서 를 형성한다.상기 단위센서는 히터 일체형 센서로써, 공중부유형 탄소 나노와이어 기반 히터 및 절연층 코팅 공 정까지 수행한 이후, 금속산화물 반도체의 감지물질인 ZnO, CuO, SNO2 등으로 나누어 각각 증착한 후, 각 반도체 물질을 포함한 수용액 상에서 감지물질을 각각 성장시키고, 금속 전극을 패터닝하여 감지물질을 나노와이어 형 태와 나노플레이크 나노플레이크(nanoflake) 형태로 이루어지는 감지부를 구성하여 목표가스가 온도, 습도 변화에 따라 변화하는 특성에 따른 많은 데이터를 추출, 저장, 분석 군집화하여 복합가스 내에서 목표가스를 선 택한다. 상기와 같이 구성된 단위센서에 대하여 히터의 소비전력이 약 1.3 mW (예상 히터 온도 100~200 oC)이 되도록 전압을 인가하여 여러 종류의 가스 (예를 들면 CH4, CO, H2, NO2, SO2)의 농도에 따른 나노와이어 기반의 저항 변화를 도 2와 같이 측정하였다. 도 2와 같이 어레이 형식으로 이루어진 단위센서는 여러 종류의 가스 모두 500ppb에서 100ppm까지 선형적인 저항 변화율을 보이는 것을 볼 수 있다. 특히 감지물질 ZnO으로 증착된 센서는 NO2에 대한 저항변화율이 높아 선택적인 NO2 가스 센싱이 가능하다. 그리고 히터가 일체형 단위센서의 동작 온도에 따른 센서 성능 안전성을 평가하기 위해, 도 3과 같이 측정 가스의 온도를 히팅배쓰(heating bath)를 이용하여 변화시켜 가며 여러 종류의 가스(CO, H2, SO2, NO2, CH4)에 대한 센서 특성을 측정하였다. 상기 히터의 인가전압을 소비전력이 약 1.3 mW (예상 히터 온도 ~ 200 oC)가 되도록 조정하였다. 상기 ZnO, CuO, SNO2 등 나노구조 기반의 히터가 일체형으로 이루어진 단위센서의 감지도는 -5 oC, 25 oC (상온), 60 oC 세 가지 온도 조건에서 일정 농도의 여러 종류의 유해 가스(CH4 1,000 ppm, CO 1ppm, H2 1ppm, NO2 1 ppm, SO2 1 ppm)에 대해 측정하여 도 3과 같이 비교하였다. 상기 감지부에서의 감지도는 상온 가스에 비해 -5℃ 가스 온도에서 약 24% 정도 감소하였으며 60℃에서는 약 18% 감소함. 이러한 결과는 히터 온도에 따른 나노물질의 감지도 변화특성이 있는 것을 알 수 있다. 상기 히터가 일체형으로 이루어진 단위센서의 습도에 따른 신뢰성 평가를 위해 고습환경(상대습도 85 %)과 저습환경(상대습도 25%)에서의 감지도 특성을 측정한다. 사용된 센서 종류, 측정 가스 종류, 히터 인가전 압 조건은 앞서 기술한 가스 온도에 따른 감지도 측정 조건과 동일하게 하였다. 상기 저습 환경에 비해 고습 환경에서 감지도가 30%가량 감소하였다. 특히, H2, SO2 CH4 가스에 대한 ZnO 기반 센서의 감지도 감소율이 컷다. 그러나, 이러한 각 센서의 습도에 따른 특성을 감안하고 센서의 신호를 빅데이터 화하여 패턴인식기법이나 인공지능 알고리즘을 처리하여 반영하므로 다종가스 환경에서의 목표가스 감지와 비 목표가스와의 구별을 해야 하는 센서의 선택도 성능을 향상시킬 수 있다. 상기 히터 일체형 센서의 신뢰성 평가를 위해 고습 환경(상대습도 85%) 및 저습 환경(상대습도 25%)에서의 1ppm NO2에 대한 ZnO 기반 센서의 저항 변화 특성을 7일간 측정한 값은 도 4와 같다. 동 발명은, 상기 습도에 따른 감지도 변화는 발생하였으나 측정 기간에 따른 감지도 변화율은 약 7%로 매우 안 정되는 것을 확인할 수 있고, 따라서 장기간 사용에 대한 센서 기능의 신뢰성이 높은 것을 알 수 있다. 본 발명은 공중부유형 구조로 설계하여 히터가 일체형으로 이루어진 단위센서의 제작 공정을 이용하여 센서와 어레이로 구현이 가능한 온도 센서를 개발하고, 병렬로 장착하여 온도 변화를 감안한 목표가스 센서의 특성 평가가 가능하다. 또한, 히터가 일체형으로 이루어진 단위센서의 1D 탄소 구조는 절연층(원자층 증착법 기반 300 nm Al2O3)에 의하여 분리되며, 반도체식 센서가 목표가스에 의한 저항변화나 전류변화 감지를 위한 온도 제공 기능(100~200°을 제공하고 있으며, 상기 절연층이 코팅된 공중부유형 탄소 나노와이어의 저항을 기판 온도를 -20℃부터 100℃까지 변화시키는데, 이때 기판과 공중부유형 탄소 나노와이어의 온도가 평 형을 이룰 수 있도록 탄소 나노와이어의 저항이 안정화될 때까지 기판온도를 유지시킨다. 도 3은 가스 센서의 감지물질 성능 평가를 수행하고, 센서의 감지물질이 공기중의 산소와 반응하여 센서 성능이 급감하는 현상인 피독현상을 파악하고, 제거하기 위한 센서의 감지물질에 별도 물질을 융합하여 감도를 유지하고, 피독현상에 강한 감지물질을 발명하기 위한 실험결과이다. 피독현상은 별도 물질 뿐 아니라, 감지물질의 종 류, 피독을 위하여 추가되는 별도 물질의 종류, 융합 물질의 두께에 상관관계가 매우 높다. 도 4는 가스 센서의 공중부유형 구조, 히터 동작, 히터와 일체형으로 동작하는 센서 구조, 센서의 감지물질인 CuO와 ZnO을 이용한 목표가스 감지 성능 평가를 위한 단위센서를 이용하여 평가하기 위하고, 제작공정을 이 용하여 양산성 성능평가를 시행하였다. 도 5는 센서의 감지물질이 시간이 경과함에 따라서, 산소와 반응하여 감도가 떨어지는 현상을 나타내는 그림으 로, 센서의 성능유지 및 신뢰성 확보를 위한 현상을 나타낸다. 도 5에 도시된 바와 같이, 피독은 200℃ 이상의 고온에서 금속산화물 표면에는 있는 전자가 공기 중의 산소와 반응하여 다양한 옥시젠 이온(oxygen ions(O2-, O-, O2-))를 형성하게 되는 것을 확인하고, 고온에서 금속산화 물에 HMDSO(Hexamethyldisiloxane)에 노출될 경우, 산소 이온들과 반응을 하여 초기의 전류 값을 변화시키고, 전자 공핍층의 두께가 줄어듦에 따라 센서의 감도가 줄어드는 특성을 보이고 있어서 이를 해결하기 위한 방법을 고안하였다. 도 6은, 피독 현상의 제거를 위하여 고안된 사항은 금속산화물 나노선위에 반응성이 매우 높은 금속산화물과 카본 소재와의 복합체 형성을 통해 HMDSO의 활성화 에너지를 낮추어 센싱 감지물질에 도달하기 이전에 해당 가 스를 증발시킨다. 이를 위해서는 피독 제거용 소재의 발굴과 피독 증진을 위한 소재를 혼합하여 나노필터 기능이 첨가된 소재를 제조하였으며, 피독 제거 성능 우위의 비교를 위하여 단일 소재에 의한 피독 방지 성능을 비교 측정하였고, 한 개의 피독물질의 합성 결과는 12%의 저항 감소가 나타났으며, 센서 감도 또한 36%가 감소하였고, 피독 방지 소 재를 혼합하고 장착한 이후 저항이 감소하고 센서의 감도가 감소하는 현상이 나타나며, 피독방지 소재 중 감도 저하가 적은 개별 피독 소재별 HMDSO 노출 전후의 목표 가스 반응 실험 결과 단일 피독 소재와는 달리 복합 피 독 소재가 코팅된 센서의 경우에는 센서의 감도와 저항의 변화가 나타나지 않아서 가장 좋은 피독방지 효과가 있다. 도 7과 8은, 상기와 같이 구성되는 본 발명에 의한 다종 복합가스 감지를 위한 히터 일체형 센서를 이용하 여 플랫폼으로 구성하여 PC 또는 스마트폰을 포함하는 사용자 단말에서 가스의 농도 값을 그래프 및 정량 적인 수치를 확인할 수 있도록 다종 복합가스 감지를 위한 복합센서 플랫폼을 구성할 수 있다. 도 7은 본 발명의 센서와 센서 신호처리를 위한 반도체 회로를 구성을 나타낸 도면이고, 도 8은 도 7의 내부 회 로 구성을 나타낸 도면이다. 도 7 및 8을 참조하여 설명하면, 공중부유형 탄소 나노와이어 기반 히터 및 절연층 코팅 공정까지 수행 한 이후, 금속산화물 반도체의 감지물질인 ZnO, CuO, SNO2 등으로 나누어 각각 증착한 후, 각 반도체 물질을 포 함한 수용액 상에서 감지물질을 각각 성장시키고, 금속 전극을 패터닝하여 감지물질을 나노와이어 형태와 나노 플레이크 (nanoflake) 형태로 이루어지는 감지부로 이루어져 목표가스가 온도, 습도변화에 따라 변화하는 특성에 따른 많은 데이터를 추출, 저장, 분석 군집화하여 복합가스 내에서 목표가스를 선택할 수 있도록 히터 일체형 센서로 구성되는 상기 단위센서와, 센서 어레이모듈로부터 인가되는 여러 종류의 가스의 농도 값을 확인할 수 있도록 신호를 변환하고, 변환된 신호를 시리얼 통신을 이용하여 사용자 단말로 인가하는 신호처리칩과; 출력 값을 시리얼 통신을 이용하여 PC 또는 스마트폰으로 전달받아 매트랩(MATLAB) 상에서 뉴런 네트워크 패턴인식을 수행하고 이를 통해 예측되는 가스의 농도 값을 그래프 및 정량적인 수치로 나타냄으 로 패턴인식을 수행하는 사용자 단말을 포함한다. 상기 신호처리칩은 8ch MUX와, 기준회로 블럭, 초저전력 회로변환블럭 및 확대기반 고해상 도 회로변환블럭를 포함하여 구성된다. 상기 8ch MUX는 센서를 통해 입력되는 다중의 입력신호 중에서 조건에 맞는 특정의 입력신호만을 선택적으 로 출력하는 초저전력 회로변환블럭(Low Power Monitoring mode)로 출력한다. 상기 기준회로 블럭는 클럭발진기(CLK GEN: Clock Gennrator), 저잡음 LDO(Low Dropout) 레귤레이터 및 밴드갭회로(BGR: Bandgap voltage reference)로 이루어진다. 상기 클럭발진기는 8ch MUX에서 인가되는 센서 신호를 통해 동작 타이밍을 결정하기 위한 클럭신호를 생성하여 저잡음 LDO 레귤레이터로 인가한다. 상기 저잡음 LDO 레귤레이터는 상승한 전압이 출력단으로 전압을 분배하여 밴드갭회로로 인가한다. 상기 밴드갭회로(BGR: Bandgap voltage reference)는 저잡음 LDO 레귤레이터에서 인가되는 입력신호 의 차이를 증폭하여 출력한다. 상기 초저전력 회로변환블럭(Low Power Monitoring mode)는 모드컨트롤러(Mode Control)와 레지스터 디지털컨버터(RDC: Resistor ADC)로 이루어진다. 상기 모드컨트롤러는 8ch MUX에서 인가되는 신호를 레지스터 디지털컨버터와 R-to-V로 분 배하여 인가한다. 상기 레지스터 디지털컨버터는 전력소모를 최소화 하였고, 센서 저항을 통해 전하가 충전, 방전되는 시간 을 슈키트트리거인버터 회로(Schmitt trigger inverter)와 카운터(counter)를 통해 측정하여 저항값을 분석한다. 상기 확대기반 고해상도 회로변환블럭(Zoom-in based High Resolution Mode)는 R-to-V와, 줌-인 CDS(Zoom-in CDS)와, 증분식ADC(Incremental ADC(Analog-to-Digital Converter))로 이루어진다. 상기 R-to-V는 센서 저항 신호를 전압 신호로 변환하고 변환된 전압 신호를 줌-인CDS로 인가하고, 상 기 줌-인CDS는 R-to-V로 부터 인가되는 전압신호를 증폭시켜 증분식ADC로 인가하며, 상기 증분 식ADC는 신호를 출력을 통해 입력 저항에 상관 없이 전체 저항범위에서 동일하게 고해상도로 센서 신호를 분석할 수 있도록 아나로그신호를 디지털신호로 변환하여 출력한다. 또한, 상기 증분식ADC는 노이즈형태(Noise shaping)을 통해 높은 해상도를 구현하기 위해 16bit로 설계 및 제작 되었고 6.3KHz의 인밴드(in band)를 가지고 92.1dB의 SNDR 및 15.01의 ENOB로 동작이 가능하며, 아날로그 로 입력되는 전압을 디지털로 환산한다. 상기 신호처리칩은 센서 어레이모듈로부터 인가되는 여러 종류의 가스 농도 값을 그래프 및 정량적인 수치로 변환하여 패턴의 인식 및 여러 종류의 가스값을 시리얼 통신을 통해 사용자 단말로 인가할 수 있도록 MCU와 블루투스로 이루어지는 송신부를 더 포함할 수 있다. 상기 사용자 단말은 PC 또는 스마트폰으로 이루어지고, 상기 MCU와 블루투스를 포함하는 송신부에서 인가 되는 값을 멀티-채널 모니터링과 싱글-채널 모니터링 모드로 변환할 수 있도록 이루어져 가스의 농도 값을 그래 프 및 정량적인 수치로 낸다. 상기와 같이 유해가스 통합 신호처리 칩 내부에 온습도센서를 부가하여센서 어레이모듈 내부 온도를 실시간으로 정밀하게 확인할 수 있도록 하였고 이를 통해 온도에 따른 반도체 형태의 센서 어레이모듈의 동작 변화를 확인할 수 있도록 하여 전체 동작의 신뢰성 확보하는 장점이 있다. 본 발명에 의한 다종 복합가스 감지를 위한 복합센서의 패턴인식은 학습 된 네트워크를 사용하여 실시간으로 측 정되는 센서 어레이모듈의 출력 값을 시리얼 통신을 이용하여 PC로 전달받아 매트랩(MATLAB) 상에서 뉴런 네트워크 패턴인식을 수행한다. 이를 통해 예측되는 가스의 농도 값을 그래프 및 정량적인 수치로 나타냄으로 패턴인식을 수행하고, 실시간 센 서 패턴인식을 통해 예측되는 가스의 농도는 가시화되며, 이를 통해 예측되는 농도를 실시간으로 확인할 수 있 는 장점이 있다. 상기에서 설명한 바와 같이 반도체 나노와이어를 공중부유형으로 기판과 떨어뜨려 브릿지 형태로 두 전극을 연 결하도록 위치시키면 기판으로부터의 영향을 줄이고 검지 가스의 히터 일체형 센서의 나노와이어로의 물질 전달 효율을 향상시켜 감도 및 신뢰성을 최대화할 수 있으며, 나노와이어 부분만을 가열할 수 있어 소비전력을 획기적으로 감소시킨다. 또한, 공중부유형 복합 나소와이어를 포함하는 히터 일체형 센서 및 어레이 플랫폼 기술을 확보할 경우 고민감 도/고신뢰성/고선택도의 초소형 저전력 센서소자의 제작이 가능해진다. 상기와 같은 다종 복합가스 감지를 위한 복합센서 플랫폼을 통해 응용 분야에 따라 거치형 또는 휴대용 형태로 구현되어 대기환경관리시스템, 소방방재 및 재해예방, 산업제품 품질 유지 및 안전 관리 등에 적용되고 최근 수 요가 급증하고 있는 자동차 내부 공기질 관리시스템에 적용이 가능하다. 본 명세서는 다수의 특정한 구현물의 세부사항들을 포함하지만, 이들은 어떠한 발명이나 청구 가능한 것의 범위 에 대해서도 제한적인 것으로서 이해되어서는 안되며, 오히려 특정한 발명의 특정한 실시형태에 특유할 수 있는 특징들에 대한 설명으로서 이해되어야 한다. 개별적인 실시형태의 문맥에서 본 명세서에 기술된 특정한 특징들 은 단일 실시형태에서 조합하여 구현될 수도 있다. 반대로, 단일 실시형태의 문맥에서 기술한 다양한 특징들 역 시 개별적으로 혹은 어떠한 적절한 하위 조합으로도 복수의 실시형태에서 구현 가능하다. 나아가, 특징들이 특 정한 조합으로 동작하고 초기에 그와 같이 청구된 바와 같이 묘사될 수 있지만, 청구된 조합으로부터의 하나 이 상의 특징들은 일부 경우에 그 조합으로부터 배제될 수 있으며, 그 청구된 조합은 하위 조합이나 하위 조합의 변형물로 변경될 수 있다. 한편, 본 명세서와 도면에 개시된 본 발명의 실시 예들은 이해를 돕기 위해 특정 예를 제시한 것에 지나지 않으 며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 여기에 개시된 실시 예들 이외에도 본 발명의 기술적 사상 에 바탕을 둔 다른 변형 예들이 실시 가능하다는 것은, 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자 에게 자명한 것이다."}
{"patent_id": "10-2019-0042321", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 의한 다종 복합가스 감지를 위한 단위센서의 구조도이고, 도 2는 본 발명에 의한 다종 유해가스 감지를 위한 어레이 형식의 센서 구조도이며, 도 3은 본 발명에 의한 센서와 피독현상을 제거하기 위한 피독물질을 적용 전후의 유해가스 감지 감도 변화 그 래프이고, 도 4는 본 발명에 의한 감지물질인 ZnO, CuO, SNO2 등으로 구현된 유해가스 센서의 실시 예를 나타낸 도면이며, 도 5는 본 발명의 피독현상 설명도와 센서의 감도저하 현상을 나타낸 도면이고, 도 6은 본 발명의 피독물질의 적용 효과에 대한 성능 그래프이며, 도 7은 본 발명의 센서와 센서 신호처리를 위한 반도체 회로를 구성을 나타낸 도면이고, 도 8은 도 7의 내부 회로 구성을 나타낸 도면이다."}
