{"patent_id": "10-2022-0147125", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0065879", "출원번호": "10-2022-0147125", "발명의 명칭": "정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이를 수행하는 서비스서버 및 컴", "출원인": "주식회사 제네시스랩", "발명자": "유대훈"}}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자단말과 통신을 수행하고, 1 이상의 프로세서 및 1 이상의 메모리를 포함하는 서비스서버에서 수행하는 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법으로서,복수의 질문노드를 포함하고, 특정 질문노드에 대한 사용자의 인터랙션에 따라 상기 특정 질문노드에 대한 다음질문노드가 결정되는 인터랙티브 질문콘텐츠를 상기 사용자단말에 제공하는 질문제공단계;상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 해당 사용자와의 인터랙션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙션정보를 수신하는 인터랙션단계;상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해당 사용자에게 예측되는 정신질환을 도출하는정신질환도출단계; 및상기 1 이상의 인터랙션정보 각각에 대하여 상기 도출된 정신질환을 레이블링하고, 상기 레이블링된 1 이상의인터랙션정보를 학습데이터로 하여 제1기계학습모델을 학습시키는 제1기계학습모델학습단계;를 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 인터랙션정보는,해당 질문노드에 대하여 상기 사용자가 음성 및 영상 가운데 어느 하나의 형태로 입력한 답변정보를 포함하는,사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 인터랙션단계는,현재 제공된 질문노드에 대한 사용자의 인터랙션에 따라 다음 질문노드를 결정하고, 이전에 사용자가 수행한 1이상의 인터랙션정보에 기초하여 상기 결정된 다음 질문노드에 대한 답변추론정보를 도출하는 답변추론단계; 및상기 답변추론정보가 기설정된 제1기준을 충족하는 경우에, 상기 결정된 다음 질문노드를 상기 사용자단말에 제공하지 않고, 상기 결정된 다음 질문노드에 대한 답변추론정보에 상응하는 그 다음 질문노드를 상기 사용자단말에 제공하는 질문스킵단계;를 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 인터랙션단계는,상기 답변추론단계에서 도출된 답변추론정보가 상기 제1기준을 충족하지 않는 경우에, 상기 결정된 다음 질문노드 및 이전에 사용자가 수행한 1 이상의 인터랙션정보에 기초하여 상기 결정된 다음 질문노드에 대한 변형질문공개특허 10-2024-0065879-3-노드를 생성하고, 상기 변형질문노드를 현재 제공된 질문노드의 다음 질문노드로 상기 사용자단말에 제공하는변형질문단계;를 더 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 제1기계학습모델학습단계는,상기 인터랙션을 수행한 사용자의 사용자특성정보를 추가적인 학습데이터로 하여 상기 제1기계학습모델을 학습시키는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기위한 방법."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 질문제공단계는,상기 인터랙티브 질문콘텐츠에 포함된 질문노드의 질문텍스트를 발화하는 인터랙티브객체를 상기 사용자단말에제공하는 인터랙티브객체제공단계;를 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "1 이상의 프로세서 및 1 이상의 메모리를 포함하고, 사용자단말과 통신을 수행하여 사용자의 인터랙션에 따라획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 수행하는 서비스서버로서,복수의 질문노드를 포함하고, 특정 질문노드에 대한 사용자의 인터랙션에 따라 상기 특정 질문노드에 대한 다음질문노드가 결정되는 인터랙티브 질문콘텐츠를 상기 사용자단말에 제공하는 질문제공단계;상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 해당 사용자와의 인터랙션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙션정보를 수신하는 인터랙션단계;상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해당 사용자에게 예측되는 정신질환을 도출하는정신질환도출단계; 및상기 1 이상의 인터랙션정보 각각에 대하여 상기 도출된 정신질환을 레이블링하고, 상기 레이블링된 1 이상의인터랙션정보를 학습데이터로 하여 제1기계학습모델을 학습시키는 제1기계학습모델학습단계;를 수행하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을수행하는 서비스서버."}
{"patent_id": "10-2022-0147125", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "사용자단말과 통신을 수행하고, 1 이상의 프로세서 및 1 이상의 메모리를 포함하는 서비스서버에서 수행하는 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 구현하기 위한 컴퓨터-판독가능 매체로서, 상기 컴퓨터-판독가능 매체는 상기 서비스서버로 하여금 이하의단계들을 수행하도록 하는 컴퓨터 실행가능 명령어들을 포함하고,상기 이하의 단계들은:복수의 질문노드를 포함하고, 특정 질문노드에 대한 사용자의 인터랙션에 따라 상기 특정 질문노드에 대한 다음공개특허 10-2024-0065879-4-질문노드가 결정되는 인터랙티브 질문콘텐츠를 상기 사용자단말에 제공하는 질문제공단계;상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 해당 사용자와의 인터랙션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙션정보를 수신하는 인터랙션단계;상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해당 사용자에게 예측되는 정신질환을 도출하는정신질환도출단계; 및상기 1 이상의 인터랙션정보 각각에 대하여 상기 도출된 정신질환을 레이블링하고, 상기 레이블링된 1 이상의인터랙션정보를 학습데이터로 하여 제1기계학습모델을 학습시키는 제1기계학습모델학습단계;를 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을구현하기 위한 컴퓨터-판독가능 매체."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이를 수행하는 서비스서버 및 컴퓨터-판 독가능 매체에 관한 것으로서, 더욱 상세하게는 사용자에게 1 이상의 질문을 제공하고, 각 질문에 대한 사용자의 인터랙션에 따라 해당 사용자가 보유하고 있는 정신질환을 판단하고, 사용자에게 제공된 각 질문에 대한 사용자 의 인터랙션에 따른 답변 각각에 판단된 정신질환을 레이블링하며, 레이블링된 답변들을 학습데이터로 하여 정신 질환을 추론하는 기계학습모델을 학습시킴으로써, 용이하게 학습데이터를 수집하여 정신질환을 추론하는 기계학 습모델의 성능이 고도화될 수 있도록 하는, 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이를 수 행하는 서비스서버 및 컴퓨터-판독가능 매체에 관한 것이다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이를 수행하는 서비스서버 및 컴퓨터-판 독가능 매체에 관한 것으로서, 더욱 상세하게는 사용자에게 1 이상의 질문을 제공하고, 각 질문에 대한 사용자 의 인터랙션에 따라 해당 사용자가 보유하고 있는 정신질환을 판단하고, 사용자에게 제공된 각 질문에 대한 사 용자의 인터랙션에 따른 답변 각각에 판단된 정신질환을 레이블링하며, 레이블링된 답변들을 학습데이터로 하여 정신질환을 추론하는 기계학습모델을 학습시킴으로써, 용이하게 학습데이터를 수집하여 정신질환을 추론하는 기 계학습모델의 성능이 고도화될 수 있도록 하는, 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이 를 수행하는 서비스서버 및 컴퓨터-판독가능 매체에 관한 것이다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사회가 고도화되고, 복잡해짐에 따라 정신적 스트레스를 받는 사람들이 늘어나고 있고, 의료기관을 통해 정신질 환을 적극적으로 치료받는 것에 대한 사회적 인식이 긍정적으로 바뀌어 감에 따라 정신질환을 치료받고자 하는 사람들의 수가 꾸준히 증가하고 있는 추세이다. 따라서, 환자의 정신질환을 효과적으로 진단할 수 있는 다양한 방법들이 소개되고 있다. 현재 정신질환을 진단하는 일반적인 방법은, 정신과 의사들이 임상 관찰하거나, 병력이나 증상을 통해 환자의 정신질환을 판별하고 진단하는 것이다. 한편, 환자의 병력이나 증상을 확인하기 위한 방법으로는, 표준화된 설 문조사를 사용하는 것이 대표적이다. 환자의 정신질환을 진단하기 위하여 제공되는 설문조사의 경우, 수많은 문항을 포함하고, 설문조사를 수행하는 환자는 모든 문항에 대해 답을 해야 한다. 예를 들어, 우울척도를 판단하기 위한 설문조사도구에 해당하는 'CES-D'의 경우, 20 개의 문항을 갖고 있으며, 20 개의 문항 전체에 대한 답변을 통해서 환자의 우울척도가 어 느정도 인지를 진단할 수 있다. 한편, 환자가 측정하고자 하는 모든 영역(우울, 불안, 자존감 등)에 대해 설문 조사를 하는 경우에, 많게는 100 개 이상의 문항에 대한 설문조사를 해야 하는 상황이다. 이와 같이, 환자는 정신질환을 진단받기 위해서는, 직접 정신과에 방문하여 의사와의 긴 시간 동안의 상담 혹은 검사를 받아야 하기 때문에, 적극적으로 병원에 방문하여 정신질환을 진단받는 환자의 수는 여전히 많지 않은 상황이다. 이러한 문제를 해결하기 위하여, 환자들이 부담감 없이 정신질환을 진단받을 수 있도록 하기 위하여 원격으로 진단받거나, 더 나아가 의사를 포함한 제3자의 개입 없이 인공지능을 기반으로 환자의 상태에 따라 해당 환자가 가지고 있는 정신질환을 판단하는 서비스들이 등장하고 있다. 이와 같이, 인공지능을 기반으로 환자의 정신질환 을 판단하는 서비스의 경우, 환자의 입장에서 부담감이 없기 때문에 정신질환을 진단받는 행위에 대한 두려움을 경감시킬 수 있으며, 해당 서비스를 통해 진단받은 정신질환이 법적으로 인정되지 않는다고 하더라도, 일종의 선제적 진단으로써 환자가 추후에 의사와 대면하여 정신질환을 진단받도록 유도할 수 있도록 하는 효과가 있다. 다만, 환자의 상태에 따라 환자가 가지고 있는 정신질환을 추론하는 인공지능모델의 경우 성능을 고도화하기 위 해서는, 환자의 상태 및 해당 상태와 관련된 정신질환이 무엇인지에 대한 일종의 학습데이터가 충분히 구축되어 있어야 한다. 한편, 종래의 정신질환을 판단하기 위한 인공지능모델의 학습데이터를 구축하기 위한 방법으로, 정신질환을 갖 고 있는 환자의 상태 혹은 행동을 직접 촬영 혹은 녹음하거나, 의사에게 진단을 받고 있는 과정에서의 환자의 모습이나 행동을 촬영 혹은 녹음하여 학습데이터를 구축하는 방법 등이 있다. 그러나, 상술한 종래의 방식의 경우, 모든 환자에 대하여 비슷한 수준의 촬영 혹은 녹음환경을 구축해야 하나 이는 현실적으로 어려운 문제점이 있고, 의사의 진단 과정에서 환자를 촬영 혹은 녹음하는 경우에, 진단을 받고 있는 환자뿐만 아니라, 환자를 진단하는 의사에게 심리적 부담감을 가중시켜 진료에 방해가 될 수 있는 문제점 이 존재하며, 궁극적으로 직접 일일이 환자의 상태 혹은 행동을 촬영 혹은 녹음하기에는 물리적 시간이 많이 소 요되는 문제점이 존재한다. 또한, 상술한 바와 같이 직접 환자의 행동에 대한 데이터를 수집하였다고 하더라도, 해당 데이터에 대한 레이블링 작업은 직접 사람이 수행해야하기 때문에, 학습데이터를 구축하기 위한 시간 및 비용이 크게 소요되는 문제점이 존재한다. 따라서, 상술한 문제점을 개선하여 정신질환을 추론하는 인공지능모델을 학습하기 위한 학습데이터를 구축하기 위한 새로운 방법의 개발이 필요한 상황이다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이를 수행하는 서비스서버 및 컴퓨터-판 독가능 매체에 관한 것으로서, 더욱 상세하게는 사용자에게 1 이상의 질문을 제공하고, 각 질문에 대한 사용자 의 인터랙션에 따라 해당 사용자가 보유하고 있는 정신질환을 판단하고, 사용자에게 제공된 각 질문에 대한 사 용자의 인터랙션에 따른 답변 각각에 판단된 정신질환을 레이블링하며, 레이블링된 답변들을 학습데이터로 하여 정신질환을 추론하는 기계학습모델을 학습시킴으로써, 용이하게 학습데이터를 수집하여 정신질환을 추론하는 기 계학습모델의 성능이 고도화될 수 있도록 하는, 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법, 이 를 수행하는 서비스서버 및 컴퓨터-판독가능 매체를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 사용자단말과 통신을 수행하고, 1 이상의 프 로세서 및 1 이상의 메모리를 포함하는 서비스서버에서 수행하는 사용자의 인터랙션에 따라 획득한 데이터를 기 반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법으로서, 복수의 질문노드를 포함하고, 특정 질문노드에 대한 사용자의 인터랙션에 따라 상기 특정 질문노드에 대한 다음 질문노드가 결정되는 인터랙티브 질문콘텐츠를 상기 사용자단말에 제공하는 질문제공단계; 상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 해당 사용자와의 인터랙션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙션정보를 수신하는 인터랙션단계; 상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해 당 사용자에게 예측되는 정신질환을 도출하는 정신질환도출단계; 및 상기 1 이상의 인터랙션정보 각각에 대하여 상기 도출된 정신질환을 레이블링하고, 상기 레이블링된 1 이상의 인터랙션정보를 학습데이터로 하여 제1기계학 습모델을 학습시키는 제1기계학습모델학습단계;를 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으 로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 제공한다. 본 발명의 일 실시예에서는, 상기 인터랙션정보는, 해당 질문노드에 대하여 상기 사용자가 음성 및 영상 가운데 어느 하나의 형태로 입력한 답변정보를 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 인터랙션단계는, 현재 제공된 질문노드에 대한 사용자의 인터랙션에 따라 다 음 질문노드를 결정하고, 이전에 사용자가 수행한 1 이상의 인터랙션정보에 기초하여 상기 결정된 다음 질문노 드에 대한 답변추론정보를 도출하는 답변추론단계; 및 상기 답변추론정보가 기설정된 제1기준을 충족하는 경우 에, 상기 결정된 다음 질문노드를 상기 사용자단말에 제공하지 않고, 상기 결정된 다음 질문노드에 대한 답변추 론정보에 상응하는 그 다음 질문노드를 상기 사용자단말에 제공하는 질문스킵단계;를 포함할 수 있다.본 발명의 일 실시예에서는, 상기 인터랙션단계는, 상기 답변추론단계에서 도출된 답변추론정보가 상기 제1기준 을 충족하지 않는 경우에, 상기 결정된 다음 질문노드 및 이전에 사용자가 수행한 1 이상의 인터랙션정보에 기 초하여 상기 결정된 다음 질문노드에 대한 변형질문노드를 생성하고, 상기 변형질문노드를 현재 제공된 질문노 드의 다음 질문노드로 상기 사용자단말에 제공하는 변형질문단계;를 더 포함할 수 있다. 본 발명의 일 실시예에서는, 상기 제1기계학습모델학습단계는, 상기 인터랙션을 수행한 사용자의 사용자특성정 보를 추가적인 학습데이터로 하여 상기 제1기계학습모델을 학습시킬 수 있다. 본 발명의 일 실시예에서는, 상기 질문제공단계는, 상기 인터랙티브 질문콘텐츠에 포함된 질문노드의 질문텍스 트를 발화하는 인터랙티브객체를 상기 사용자단말에 제공하는 인터랙티브객체제공단계;를 포함할 수 있다. 상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 1 이상의 프로세서 및 1 이상의 메모리를 포 함하고, 사용자단말과 통신을 수행하여 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하 는 기계학습모델을 학습시키기 위한 방법을 수행하는 서비스서버로서, 복수의 질문노드를 포함하고, 특정 질문 노드에 대한 사용자의 인터랙션에 따라 상기 특정 질문노드에 대한 다음 질문노드가 결정되는 인터랙티브 질문 콘텐츠를 상기 사용자단말에 제공하는 질문제공단계; 상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반 으로 해당 사용자와의 인터랙션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙션정보를 수신하는 인터랙션단계; 상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해당 사 용자에게 예측되는 정신질환을 도출하는 정신질환도출단계; 및 상기 1 이상의 인터랙션정보 각각에 대하여 상기 도출된 정신질환을 레이블링하고, 상기 레이블링된 1 이상의 인터랙션정보를 학습데이터로 하여 제1기계학습모 델을 학습시키는 제1기계학습모델학습단계;를 수행하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 수행하는 서비스서버를 제공한다. 상기와 같은 과제를 해결하기 위하여, 본 발명의 일 실시예에서는, 사용자단말과 통신을 수행하고, 1 이상의 프 로세서 및 1 이상의 메모리를 포함하는 서비스서버에서 수행하는 사용자의 인터랙션에 따라 획득한 데이터를 기 반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 구현하기 위한 컴퓨터-판독가능 매체로서, 상기 컴퓨터-판독가능 매체는 상기 서비스서버로 하여금 이하의 단계들을 수행하도록 하는 컴퓨터 실행가능 명 령어들을 포함하고, 상기 이하의 단계들은: 복수의 질문노드를 포함하고, 특정 질문노드에 대한 사용자의 인터 랙션에 따라 상기 특정 질문노드에 대한 다음 질문노드가 결정되는 인터랙티브 질문콘텐츠를 상기 사용자단말에 제공하는 질문제공단계; 상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 해당 사용자와의 인터랙 션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙션정보를 수신하는 인 터랙션단계; 상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해당 사용자에게 예측되는 정신질환 을 도출하는 정신질환도출단계; 및 상기 1 이상의 인터랙션정보 각각에 대하여 상기 도출된 정신질환을 레이블 링하고, 상기 레이블링된 1 이상의 인터랙션정보를 학습데이터로 하여 제1기계학습모델을 학습시키는 제1기계학 습모델학습단계;를 포함하는, 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학 습모델을 학습시키기 위한 방법을 구현하기 위한 컴퓨터-판독가능 매체를 제공한다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 사용자에게 제공된 인터랙티브 질문콘텐츠를 제공하고, 사용자가 상기 인터랙티 브 질문콘텐츠 상에서의 인터랙션에 따라 해당 사용자가 갖고 있는 정신질환을 판단하므로, 사용자가 거부감 없 이 정신질환을 진단받을 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠에 대한 사용자의 인터랙션에 따른 답변 각각에 도출된 진단정보를 해당 답변에 레이블링하고, 레이블링된 답변을 정신질환 학습데이터로 사용하므로, 용이하게 학습데 이터를 구축할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠에 포함된 질문은 사용자단말 상에서 해당 질문을 발화하 는 인터랙티브객체에 의해 표시되므로, 사용자가 더욱 몰입감 있게 인터랙션을 수행할 수 있도록 하는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠의 특정 질문노드에 대하여 사용자가 수행한 인터랙션에 따라 다음 질문노드에 대한 답변추론정보를 도출하고, 상기 답변추론정보가 제1기준을 충족하는 경우에, 상기 다음 질문노드는 사용자단말에 표시되지 않고, 상기 답변추론정보에 따른 그 다음 질문노드가 표시되므로, 사용자가 모든 질문에 대한 답변을 수행하는 것이 아니라, 답변이 요구되는 일부 질문에 대해서만 선택적으로 답변 을 수행할 수 있도록 하여, 사용자가 더욱 편리하게 정신질환을 진단받을 수 있도록 하는 효과를 발휘할 수 있 다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠의 특정 질문노드에 대하여 사용자가 수행한 인터랙션에 따라 다음 질문노드의 질문을 변형하고, 상기 다음 질문노드에 대하여 변형된 질문을 사용자단말 상에 표시하므 로, 사용자가 자신의 답변의 내용이 반영된 질문을 받아볼 수 있으므로, 더욱 몰입감 있게 인터랙션을 수행할 수 있는 효과를 발휘할 수 있다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 다양한 실시예들 및/또는 양상들이 이제 도면들을 참조하여 개시된다. 하기 설명에서는 설명을 목 적으로, 하나 이상의 양상들의 전반적 이해를 돕기 위해 다수의 구체적인 세부사항들이 개시된다. 그러나, 이러 한 양상(들)은 이러한 구체적인 세부사항들 없이도 실행될 수 있다는 점 또한 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 인식될 수 있을 것이다. 이후의 기재 및 첨부된 도면들은 하나 이상의 양상들의 특정한 예 시적인 양상들을 상세하게 기술한다. 하지만, 이러한 양상들은 예시적인 것이고 다양한 양상들의 원리들에서의 다양한 방법들 중 일부가 이용될 수 있으며, 기술되는 설명들은 그러한 양상들 및 그들의 균등물들을 모두 포함 하고자 하는 의도이다. 또한, 다양한 양상들 및 특징들이 다수의 디바이스들, 컴포넌트들 및/또는 모듈들 등을 포함할 수 있는 시스템 에 의하여 제시될 것이다. 다양한 시스템들이, 추가적인 장치들, 컴포넌트들 및/또는 모듈들 등을 포함할 수 있 다는 점 그리고/또는 도면들과 관련하여 논의된 장치들, 컴포넌트들, 모듈들 등 전부를 포함하지 않을 수도 있 다는 점 또한 이해되고 인식되어야 한다. 본 명세서에서 사용되는 \"실시예\", \"예\", \"양상\", \"예시\" 등은 기술되는 임의의 양상 또는 설계가 다른 양상 또 는 설계들보다 양호하다거나, 이점이 있는 것으로 해석되지 않을 수도 있다. 아래에서 사용되는 용어들 '~부', '컴포넌트', '모듈', '시스템', '인터페이스' 등은 일반적으로 컴퓨터 관련 엔티티(computer-related entity)를 의미하며, 예를 들어, 하드웨어, 하드웨어와 소프트웨어의 조합, 소프트웨어를 의미할 수 있다. 또한, \"포함한다\" 및/또는 \"포함하는\"이라는 용어는, 해당 특징 및/또는 구성요소가 존재함을 의미하지만, 하나 이상의 다른 특징, 구성요소 및/또는 이들의 그룹의 존재 또는 추가를 배제하지 않는 것으로 이해되어야 한다. 또한, 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구 성요소들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구 별하는 목적으로만 사용된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요 소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 또한, 본 발명의 실시예들에서, 별도로 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기 서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되 는 것과 동일한 의미를 가지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술 의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 발명의 실시예에서 명백하게 정 의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 도 1은 본 발명의 일 실시예에 따른 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 수행하기 위한 구성요소들을 개략적으로 도시한다. 도 1에 도시된 바와 같이, 본 발명의 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 수행하는 서비스서버는 1 이상의 사용자단말과 통신을 수 행하며, 질문제공부, 인터랙션부, 정신질환도출부, 기계학습모델학습부 및 DB를 포함할 수 있다. 상기 질문제공부는, 질문제공단계(S100)를 수행하여 상기 사용자단말에 정신질환을 진단하기 위한 1 이상의 질문을 제공한다. 구체적으로, 상기 질문제공부는 복수의 질문을 포함하는 복수의 질문노드로 구성된 인터랙티브 질문콘텐츠를 사용자단말에 제공하고, 사용자단말의 사용자는 상기 인터랙티브 질문콘텐츠를 사용하여 상기 서비스서버로 하여금 정신질환을 진단받을 수 있다. 한편, 상기 질문제공부 에서 사용자단말에 제공하는 인터랙티브 질문콘텐츠에 대해서는 도 3에서 자세하게 설명하도록 한 다. 상기 인터랙션부는, 인터랙션단계(S200)를 수행하여 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 사용자와의 인터랙션을 수행한다. 구체적으로, 상기 인터랙션부는 인터랙티브 질문콘텐츠에 포 함된 어느 질문이 사용자단말에 표시되고, 사용자는 표시된 질문에 대한 답변을 다양한 형태로 입력(인터 랙션)할 수 있으며, 이와 같이 입력된 정보를 포함하는 인터랙션정보를 상기 사용자단말로부터 수신할 수 있다. 한편, 상기 사용자단말에는 사용자의 인터랙션에 따라 순차적으로 복수의 질문이 표시될 수 있으며, 각 질문 별로 해당 질문에 대한 사용자의 인터랙션에 따른 각각의 인터랙션정보를 상기 인터랙션부 에서 수신할 수도 있다. 이와 같이, 상기 인터랙션부에서 수신하는 인터랙션정보는 상기 인터랙티 브 질문콘텐츠를 사용한 사용자의 정신질환을 판단하기 위한 정보로 사용되며, 이와 동시에 사용자의 상태 혹은 행동에 대한 영상 혹은 음성을 입력받아 해당 사용자의 정신질환을 추론하는 기계학습모델을 학습시키기 위한 학습데이터로 사용될 수 있다. 상기 정신질환도출부는, 정신질환도출단계(S300)를 수행하여 상기 인터랙션부에서 수신한 1 이상의 인터랙션정보에 기초하여 해당 사용자가 갖고 있을 것으로 판단되는 정신질환을 도출한다. 구체적으로, 상기 정 신질환도출부는 규칙기반(Rule-Based)의 모델을 사용하여 사용자의 정신질환을 판단하거나, 혹은 기계학 습 기반으로 구현되는 제2추론모델을 사용하여 사용자의 정신질환을 판단할 수도 있다. 상기 정신질환도출부 에서 도출된 정신질환에 대한 정보는 상기 사용자단말에 제공되어 사용자가 자신이 갖고 있는 것으 로 판단되는 정신질환을 인지할 수 있도록 하며, 이와 함께 상기 정신질환도출부에서 도출된 정신질환에 대한 정보는 상기 인터랙션정보에 레이블링되는 것으로 학습데이터를 구축하는데 사용될 수 있다. 상기 기계학습모델학습부는 기계학습모델을 학습시키며, 특히 제1기계학습모델학습단계(S400)를 수행하여 학습데이터를 구축하고, 구축한 학습데이터를 사용하여 기계학습 기반으로 구현되는 제1기계학습모델을 학습시킬 수 있다. 구체적으로 상기 기계학습모델학습부는 상기 인터랙션부에서 수신한 인터랙션정보 각 각에 상기 정신질환도출부에서 도출된 정신질환을 레이블링하고, 레이블링된 인터랙션정보는 상술한 제1 기계학습모델을 학습시키기 위한 학습데이터로 사용될 수 있다. 이어서, 상기 기계학습모델학습부는 상기 학습데이터를 사용하여 사용자의 상태, 행동 등의 영상 혹은 음성을 기반으로 해당 사용자의 정신질환을 추론하 는 제1기계학습모델을 학습시킬 수 있다. 여기서, 상기 제1기계학습모델은 기계학습 기반으로 구현되는 인공지 능 모델에 해당할 수 있다. 한편, 상기 DB에는 상기 서비스서버가 본 발명의 사용자의 인터랙션에 따라 획득한 데이터를 기반 으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 수행하는 데 필요한 1 이상의 정보들이 저장 될 수 있다. 구체적으로, 상기 DB에는 상기 질문제공부에서 사용자단말에 제공하는 인터랙티 브 질문콘텐츠, 사용자단말에 제공된 인터랙티브 질문콘텐츠에 대하여 사용자가 수행한 인터랙션에 대한 인터랙션정보, 상기 정신질환도출부에서 도출된 정신질환정보, 상기 기계학습모델학습부에서 구축 한 학습데이터, 상기 정신질환도출부에서 사용자의 인터랙션에 따라 정신질환을 도출하는 제2추론모델, 상기 기계학습모델학습부에서 수행하는 기계 학습의 대상이 되고, 인터랙션이 아니라 사용자의 영상 혹은 음성을 입력받아 해당 사용자의 정신질환을 추론하는 제1기계학습모델이 저장될 수 있다. 추가적으로 상기 DB에는 사용자단말로부터 제공받은 사용자특성정보가 저장될 수 있으며, 상기 사용자특성정보는 사 용자의 성별, 나이 등과 같이 사용자를 특정할 수 있는 복수의 특성정보들을 포함하며, 상기 사용자특성정보는 상술한 제1기계학습모델에 대한 추가적인 학습데이터로 사용되거나, 상기 정신질환도출부에서 사용자의 인터랙션에 따라 정신질환을 판단하는데 사용될 수 있다. 한편, 상기 사용자단말의 사용주체는, 서비스서버와의 인터랙션, 바람직하게는 서비스서버에 서 제공하는 인터랙티브 질문콘텐츠와의 인터랙션에 따라 정신질환을 진단받고자 하는 사용자일 수 있다. 또한 상기 사용자단말에 설치된 본 발명의 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추 론하는 기계학습모델을 학습시키기 위한 방법을 수행하는 서비스서버와 통신을 수행하기 위한 별도의 애 플리케이션 혹은 상기 사용자단말에 설치되어 있는 웹브라우저를 통해 구현되는 별도의 웹페이지를 통해 상기 서비스서버와 통신을 수행할 수 있다. 이를 통해, 상기 사용자단말은 서비스서버로부터 인터랙티브 질문콘텐츠를 제공받아 표시하고, 상기 인터랙티브 질문콘텐츠에 대한 사용자의 인터랙션에 대한 정 보를 상기 서비스서버로 송신하며, 상기 서비스서버에서 인터랙션에 따라 판단된 사용자의 정신질 환에 대한 정보를 제공받아 표시할 수 있다. 도 2는 본 발명의 일 실시예에 따른 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법의 세부 단계들을 개략적으로 도시한다. 도 2에 도시된 바와 같이, 사용자단말과 통신을 수행하고, 1 이상의 프로세서 및 1 이상의 메모리를 포함 하는 서비스서버에서 수행하는 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법으로서, 복수의 질문노드를 포함하고, 특정 질문노드에 대한 사용자의 인 터랙션에 따라 상기 특정 질문노드에 대한 다음 질문노드가 결정되는 인터랙티브 질문콘텐츠를 상기 사용자단말 에 제공하는 질문제공단계(S100); 상기 사용자단말에 제공된 인터랙티브 질문콘텐츠를 기반으로 해 당 사용자와의 인터랙션을 수행하여, 해당 사용자가 인터랙션을 수행한 1 이상의 질문노드 각각에 대한 인터랙 션정보를 수신하는 인터랙션단계(S200); 상기 1 이상의 질문노드 각각에 대한 인터랙션정보에 기초하여 해당 사 용자에게 예측되는 정신질환을 도출하는 정신질환도출단계(S300); 및 상기 1 이상의 인터랙션정보 각각에 대하 여 상기 도출된 정신질환을 레이블링하고, 상기 레이블링된 1 이상의 인터랙션정보를 학습데이터로 하여 제1기 계학습모델을 학습시키는 제1기계학습모델학습단계(S400);를 포함할 수 있다. 구체적으로, 상기 질문제공단계(S100)는 사용자단말에 인터랙티브 질문콘텐츠를 제공한다. 이때, 상기 인 터랙티브 질문콘텐츠는 복수의 정신질환 가운데 어느 하나의 정신질환을 판단하기 위한 콘텐츠에 해당하거나, 혹은 특정 정신질환에 대한 세부 정신질환을 판단하기 위한 콘텐츠에 해당할 수도 있다. 또한, 상기 서비스서버에는 복수의 인터랙티브 질문콘텐츠가 저장되어 있고, 사용자의 선택 혹은 사용자의 입력(예를 들어, 인 터랙티브 질문콘텐츠를 결정하기 위한 질문에 대한 답변 입력)에 기초하여 선택된 어느 하나의 인터랙티브 질문 콘텐츠가 상기 사용자단말에 제공될 수 있다. 상기 인터랙션단계(S200)는 사용자가 상기 사용자단말에 표시되는 인터랙티브 질문콘텐츠를 소비, 즉, 인 터랙티브 질문콘텐츠에 포함된 질문노드가 표시되고, 상기 질문노드에 대한 답변(인터랙션)을 수행하는 경우에, 상기 사용자단말로부터 인터랙션정보를 수신한다. 한편, 상기 인터랙션단계(S200)에서는 사용자단말 에 순차적으로 표시되는 질문노드 별로 각각의 인터랙션정보를 상기 사용자단말로부터 수신할 수 있다. 상기 정신질환도출단계(S300)는 인터랙티브 질문콘텐츠에 포함된 복수의 질문노드 가운데 사용자단말에 표시된 일부 질문노드에 대한 인터랙션정보에 기초하여 해당 사용자의 정신질환을 도출한다. 본 발명의 일 실시 예에서는 각 질문노드에 대한 인터랙션을 규칙 기반의 모델에 입력하여 정신질환을 도출할 수 있으며, 이때, 인 터랙션이 질문노드에서 어떤 답변을 의미하는 것인지를 추론하는 것은 제2추론모델에서 상기 인터랙션정보를 입 력받아 추론할 수 있다. 상기 제1기계학습모델학습단계(S400)는, 상기 인터랙션단계(S200)에서 수신한 각 질문노드에 대한 인터랙션정보 에 상기 정신질환도출단계(S300)에서 도출한 정신질환을 레이블링하여 학습데이터를 구축한다. 즉, 사용자가 인 터랙션의 일환으로 수행한 질문노드에 대한 답변에 해당 답변과 관련된 정신질환을 레이블링함으로써, 해당 학 습데이터를 학습하는 기계학습모델은 해당 답변과 정신질환 사이의 관계 등을 학습할 수 있게 된다. 이어서, 상기 제1기계학습모델학습단계(S400)는, 구축한 상기 학습데이터를 사용하여 제1기계학습모델을 학습시 킨다. 여기서, 상기 제1기계학습모델은 상기 제2추론모델과는 상이하게, 어떤 사용자의 영상 혹은 음성을 기반 으로 정신질환을 추론할 수 있는 기계학습모델에 해당할 수 있다. 이와 같이, 본 발명은 사용자의 영상 혹은 음성을 기반으로 정신질환을 추론하는 제1기계학습모델을 구현하는데 있어서 필요로 하는 학습데이터를 구축하기 위한 것이다. 즉, 본 발명은 상술한 바와 같이, 종래에 직접적으로 의사에게 진단을 받는 사용자를 직접적으로 촬영 혹은 녹음하고, 이에 대하여 수동적으로 레이블링하여 학습데 이터를 구축하는 번거로움을 개선하기 위하여, 규칙기반 모델을 통해 인터랙션에 따른 정신질환을 도출하고, 인 터랙션 과정에서의 사용자의 음성 혹은 영상데이터(인터랙션정보)에 도출된 정신질환을 레이블링하여 학습데이 터를 자동적으로 구축할 수 있는 것이다. 또한, 자동적으로 구축된 학습데이터를 사용하여 입력된 영상 혹은 음성을 분석하여 사용자의 정신질환을 추론 하는 제1기계학습모델을 학습시킬 수 있고, 이와 같이 학습된 제1기계학습모델은 의사가 환자와 면담하여 진단 하는 과정에서 보조적인 역할로 사용될 수 있다. 예를 들어, 의사가 판단한 결과와 학습된 제1기계학습모델이 판단한 결과가 상이한 경우에, 의사는 사용자에게 추가적인 진단을 하는 것으로, 상기 제1기계학습모델을 더욱 정확하게 정신질환을 판단할 수 있도록 하는 수단으로 사용할 수도 있다. 도 3은 본 발명의 일 실시예에 따른 인터랙티브 질문콘텐츠를 개략적으로 도시한다. 도 3에 도시된 바와 같이, 상기 질문제공단계(S100)에서 사용자단말에 인터랙티브 질문콘텐츠를 제공하며, 상기 인터랙티브 질문콘텐츠는 복수의 질문노드를 포함하며, 복수의 질문노드 가운데 특정 질문노드 에 대한 사용자의 인터랙션에 따라 상기 특정 질문노드에 대한 다음 질문노드로써 복수의 질문노드 가운데 어느 하나의 질문노드가 결정될 수 있다. 상기 인터랙티브 질문콘텐츠는 복수의 정신질환 가운데 어느 하나의 정신질환을 진단하기 위한 도구로써 사용될 수 있다. 상기 인터랙티브 질문콘텐츠는 복수의 질문노드를 포함하고, 각각의 질문노드, 바람직하게는 최종적으 로 사용자단말에 제공되는 질문노드를 제외한 나머지 질문노드 각각에는 타 질문노드와 연결되는 2 이상 의 분기가 설정될 수 있다.더 구체적으로, 상기 인터랙티브 질문콘텐츠는 최초로 사용자단말에 제공되는 질문노드(도 3에서 Q1) 및 최종적으로 사용자단말에 제공되는 질문노드(도 3에서 질문#12 내지 #21)를 포함하며, 최초의 질문노드에 대한 사용자의 인터랙션에 따라 상기 최초의 질문노드에 설정된 복수의 분기 가운데 어느 하나의 분기가 결정되 고, 결정된 분기에 따른 다음 질문노드가 사용자단말에 제공되며, 상기 다음 질문노드에서의 사용자의 인 터랙션에 따라 상기 다음 질문노드에 설정된 복수의 분기 가운데 어느 하나의 분기가 결정되어, 결정된 분기에 상응하는 그 다음 질문노드가 사용자단말에 제공되며, 이러한 과정은 상기 인터랙티브 질문콘텐츠에 포함 된 어느 하나의 최종적인 질문노드가 사용자단말에 제공될 때까지 수행될 수 있다. 도 3에 도시된 인터랙티브 질문콘텐츠를 예로 들면, 최초의 질문노드에 해당하는 질문#1(Q1)이 사용자단말 에 처음 제공되고, 상기 질문#1(Q1)에 대한 사용자의 인터랙션에 따라 상기 질문#1(Q1)에 설정된 3 개의 분기 가운데 어느 하나의 분기가 결정되고, 결정된 분기에 상응하는 다음 질문인 질문#2(Q2)가 상기 사용자단말 에 제공되고, 해당 질문#2(Q2)에 대한 사용자의 인터랙션에 따라 2 개의 분기 가운데 어느 하나의 분기가 결정되고, 결정된 분기에 상응하는 그 다음 질문인 질문#6(Q6)이 사용자단말에 제공되고, 해당 질문 #6(Q6)에 대한 사용자의 인터랙션에 따라 2 개의 분기 가운데 어느 하나의 분기가 결정되어 최종적으로 질문 #14(Q14)가 사용자단말에 제공될 수 있다. 또한, 상기 사용자단말에 표시되는 인터랙티브 질문콘텐츠의 질문노드는 다양한 방식으로 표시될 수 있다. 구체적으로, 질문노드의 질문이 텍스트, 음성, 영상 형태 가운데 1 이상의 형태로 사용자단말 상에 표시될 수 있으며, 바람직하게는 질문노드의 질문을 발화(發話)하는 인터랙티브객체가 사용자단말에 표시 될 수 있다. 한편, 상기 인터랙션정보는, 해당 질문노드에 대하여 상기 사용자가 음성 및 영상 가운데 어느 하나의 형태로 입력한 답변정보를 포함할 수 있다. 구체적으로, 인터랙티브 질문콘텐츠를 제공받은 사용자는 사용자단말 상에 질문노드에 대한 인터랙션의 입력 유형을 설정할 수 있다. 상기 입력 유형은 음성 및 영상 유형에 해당하며, 사용자는 음성 유형 및 영상 유 형 가운데 어느 하나의 유형을 선택하고, 이후에 질문노드에 대한 인터랙션(답변)은 사용자가 선택한 유형으로 입력될 수 있다. 예를 들어, 사용자가 음성 유형을 선택한 경우에, 사용자단말에 표시된 질문노드에 대하여 사용자는 사용 자단말에 구비된 마이크모듈을 통해 질문노드에 대한 음성 기반의 답변을 인터랙션으로 입력할 수 있으며, 반대로 사용자가 영상 유형을 선택한 경우에, 사용자단말에 표시된 질문노드에 대하여 사용자는 사용자단말에 구비된 마이크모듈 및 카메라모듈을 통해 질문노드에 대한 영상 기반의 답변을 인터랙션으 로 입력할 수도 있다. 이와 같이, 사용자가 입력한 질문노드에 대한 인터랙션은 해당 질문노드에 대한 답변으로 이해될 수 있으며, 이 러한 답변은 해당 질문노드에 대한 인터랙션정보에 포함될 수 있다. 도 4는 본 발명의 일 실시예에 따른 인터랙티브 질문콘텐츠의 질문노드가 인터랙티브객체를 통해 표시되고, 질 문노드에 대한 사용자의 인터랙션을 개략적으로 도시한다. 도 4에 도시된 바와 같이, 상기 질문제공단계(S100)는, 상기 인터랙티브 질문콘텐츠에 포함된 질문노드의 질문 텍스트를 발화하는 인터랙티브객체를 상기 사용자단말에 제공하는 인터랙티브객체제공단계;를 포함할 수 있다. 구체적으로, 상기 질문제공단계(S100)에서는 사용자단말에 인터랙티브 질문콘텐츠를 제공하며, 사용자단 말에 상기 인터랙티브 질문콘텐츠의 질문노드가 표시되는 경우에, 상기 인터랙티브객체제공단계가 수행되 어, 상기 질문노드의 질문을 발화하는 인터랙티브객체를 사용자단말에 제공할 수 있다.도 4를 예로 들면, 상기 인터랙티브객체제공단계를 통해 사용자단말에는 인터랙티브객체가 표시될 수 있 으며, 상기 인터랙티브객체는 사람, 동물, 가상의 캐릭터 등과 같이 다양한 객체 중 어느 하나에 해당하는 것으 로 이해될 수 있다. 한편, 상기 인터랙티브객체는 현재의 질문노드의 질문텍스트를 발화할 수 있다. 이때, 상기 인터랙티브객체는 질문텍스트의 맥락을 고려하여, 입모양, 어조 등의 비언어적요소를 고려하여 발화할 수 있다. 한편, 사용자는 인터랙티브객체가 발화하는 질문에 따라 사용자가 선택한 음성 혹은 영상 형태로 인터랙션을 수 행할 수 있다. 예를 들어, 도 4에서는 인터랙티브객체가 \"어떤 증상으로 오셨나요?\"라는 질문(도 4의 Q)을 발화 하고, 이에 따라 사용자는 \"요즘 들어서 가족들에게 짜증을 많이 내서 괴롭습니다.\"라는 인터랙션(도 4의 A)을 수행할 수 있으며, 이때 사용자가 음성 형태로 입력하는 것으로 결정한 경우에, 사용자의 인터랙션에 따른 음성 이 사용자단말에 입력될 수 있으며, 반대로 사용자가 영상 형태로 입력하는 것으로 결정한 경우에, 사용 자의 인터랙션에 따른 영상이 사용자단말에 입력될 수 있고, 이에 따라 사용자단말은 입력된 정보 를 포함하는 인터랙션정보를 상기 서비스서버에 송신할 수 있다. 한편, 상기 인터랙티브객체는 질문노드의 질문을 발화하는 것뿐만 아니라, 사용자의 인터랙션에 따른 추가적인 인터랙션(피드백)을 수행할 수 있다. 예를 들어, 사용자의 답변이 종료된 이후에 답변을 잘 청취하였음을 표현 하기 위한 언어적, 비언어적 요소들을 상기 인터랙티브객체가 표현할 수도 있다. 또한, 본 발명의 일 실시예에서는 상기 인터랙티브 질문콘텐츠가 사용자단말에 제공되고, 상기 사용자단 말에 인터랙티브 질문콘텐츠의 질문노드가 표시되고자 하는 경우에 상기 인터랙티브객체제공단계가 수행 되어 인터랙티브객체를 사용자단말에 송신할 수 있으나, 본 발명의 다른 실시예에서 상기 인터랙티브객체 는 상기 인터랙티브 질문콘텐츠에 포함될 수 있고, 상기 인터랙티브 질문콘텐츠가 상기 사용자단말에 제 공되는 경우에, 서비스서버로부터 인터랙티브객체를 수신하지 않고도 사용자단말 상에 인터랙티브 객체를 표시할 수도 있다. 도 5는 본 발명의 일 실시예에 따른 정신질환도출단계(S300)에서 사용자에게 예측되는 정신질환을 도출하는 과 정을 개략적으로 도시한다. 도 5에 도시된 바와 같이, 정신질환도출단계(S300)에서는 인터랙티브 질문콘텐츠에 대한 사용자의 인터랙션에 기초하여 해당 사용자가 갖고 있을 것으로 판단되는 정신질환을 도출한다. 구체적으로, 정신질환도출단계(S300)에서는 제2추론모델을 사용하여 정신질환을 도출할 수 있으며, 본 발명의 일 실시예에서 상기 제2추론모델은 규칙기반으로 구현되는 인공지능 모델에 해당할 수 있다. 즉, 상기 제2추론모델은 인터랙티브 질문콘텐츠에 포함된 복수의 노드 가운데 사용자에게 제공된 복수의 질문노 드에 따른 사용자의 답변을 기설정된 규칙에 적용하여 어느 하나의 정신질환을 도출할 수 있다. 도 3에 도시된 인터랙티브 질문콘텐츠를 예로 들면, 사용자가 인터랙션을 수행한 질문노드(질문#1 -> 질문#2 -> 질문#6 -> 질 문#14) 각각에 대한 사용자의 인터랙션(답변#1 -> 답변#2 -> 답변#3 -> 답변#4)에 따라 정신질환을 도출할 수 있다. 또한, 상기 제2추론모델은 제1세부추론모델을 포함할 수 있으며, 상기 제1세부추론모델은 사용자의 인터랙션에 따른 음성 혹은 영상을 입력받아, 해당 인터랙션이 해당 질문노드에 설정된 복수의 분기 가운데 어느 분기에 해 당하는 것인지를 판단할 수 있다. 즉, 제1세부추론모델은 인터랙티브 질문콘텐츠에서 최초 질문노드에서부터 최 종 질문노드까지의 경로를 사용자의 인터랙션에 따라 결정할 수 있으며, 상기 제2추론모델은 경로에 포함된 질 문노드 각각에 대한 인터랙션에 따라 사용자의 정신질환을 판단할 수 있다. 도 6은 본 발명의 일 실시예에 따른 인터랙티브 질문콘텐츠에서 사용자에게 제공되는 질문노드의 일부가 스킵되 는 과정을 개략적으로 도시한다. 도 6에 도시된 바와 같이, 상기 인터랙션단계(S200)는, 현재 제공된 질문노드에 대한 사용자의 인터랙션에 따라 다음 질문노드를 결정하고, 이전에 사용자가 수행한 1 이상의 인터랙션정보에 기초하여 상기 결정된 다음 질문 노드에 대한 답변추론정보를 도출하는 답변추론단계; 및 상기 답변추론정보가 기설정된 제1기준을 충족하는 경우에, 상기 결정된 다음 질문노드를 상기 사용자단말에 제공하지 않고, 상기 결정된 다음 질문노드에 대 한 답변추론정보에 상응하는 그 다음 질문노드를 상기 사용자단말에 제공하는 질문스킵단계;를 포함할 수 있다. 구체적으로, 상술한 바와 같이, 상기 인터랙션단계(S200)에서는 현재 사용자단말에 표시된 질문노드에 대 하여 사용자가 인터랙션을 수행하는 경우에, 상기 사용자단말로부터 인터랙션정보를 수신하며, 상기 인터 랙션정보에 기초하여 현재의 질문노드에 복수의 분기로 연결된 복수의 질문노드 가운데 어느 하나의 질문노드를 현재 질문노드의 다음 질문노드로 결정한다. 더 구체적으로, 상기 인터랙션단계(S200)는 상술한 제2추론모델, 바람직하게는 상기 제2추론모델에 포함된 제1 세부추론모델에 인터랙션정보를 입력하고, 상기 제1세부추론모델은 사용자가 입력한 인터랙션정보가 해당 질문 노드에 부여된 복수의 분기 가운데 어느 분기에 해당하는지를 추론할 수 있다. 도 6을 예로 들면, 인터랙티브 질문콘텐츠의 질문#A가 사용자단말에 제공되고, 사용자는 상기 질문#A에 대한 답변, 즉 인터랙션을 수행 한다. 이에 따라, 상기 인터랙션단계(S200)에서는 사용자단말로부터 질문#A에 대한 인터랙션정보를 수신 하며, 상기 인터랙션정보에 기초하여 상기 질문#A에 부여된 복수의 분기(분기#1 내지 분기#3) 가운데 어느 하나 의 분기에 해당하는 지를 판단한다. 또한, 상기 인터랙션단계(S200)는 답변추론단계를 포함하며, 상기 답변추론단계는 결정된 다음 질문노드에 대한 답변의 추론결과에 해당하는 답변추론정보를 도출할 수 있다. 구체적으로, 상기 답변추론단계에서는 제2추론모 델에 현재 질문노드에 대하여 사용자가 입력한 인터랙션정보를 입력하고, 상기 제2추론모델로부터 상기 인터랙 션정보에 따른 답변추론정보를 도출할 수 있다. 더 구체적으로, 상기 제2추론모델은 제2세부추론모델을 포함하 며, 상기 제2세부추론모델은 상기 인터랙션정보에 따른 답변추론정보를 도출할 수 있다. 한편, 상기 답변추론단계에서는 현재 질문노드에서의 인터랙션정보만을 사용하는 것이 아니라, 이전에 제공된 1 이상의 질문노드에 대한 1 이상의 인터랙션정보를 포함하여 상기 현재 질문노드의 다음 질문노드에 대한 답변추 론정보를 도출할 수 있다. 이와 같이, 본 발명의 상기 답변추론단계는 지금까지 사용자가 입력한 질문노드 각각에 대한 인터랙션(답변)을 고려하여, 다음에 제공될 질문노드에 대한 일종의 예상 답변에 해당하는 답변추론정보를 도출하며, 상기 답변추 론정보는 다음에 제공될 질문노드를 건너뛰거나, 혹은 다음에 제공될 질문노드의 질문 내용을 사용자 경험이 반 영된 개인화된 질문 내용으로 변형하기 위한 요소로 사용될 수 있다. 구체적으로, 상기 인터랙션단계(S200)는 질문스킵단계를 포함하며, 상기 질문스킵단계는 상기 답변추론단계에서 도출한 다음 질문노드에 대한 답변추론정보에 기초하여 상기 답변추론정보가 기설정된 규칙을 만족하는 경우에 다음 질문노드를 건너뛰고, 상기 답변추론정보에 의해 결정된 다음 질문노드의 다음 질문노드, 즉, 현재 질문노 드를 기준으로 두번째의 다음 질문노드가 사용자단말에 제공될 수 있다. 구체적으로, 상기 답변추론정보는 다음 질문노드에 부여된 복수의 분기 별로 해당 분기에 대한 확률적 정보를 포함할 수 있다. 도 6을 예로 들면, 질문#A의 다음 질문노드에 해당하는 질문#C에 대하여 도출된 답변추론정보 에는 상기 질문#C에 설정된 2 개의 분기인 분기#4 및 분기#5 각각에 대한 확률적 정보가 포함될 수 있다. 한편, 상기 질문스킵단계는 상기 답변추론정보에 포함된 각 분기에 대한 확률적 정보가 가운데 어느 하나의 확 률적 정보가 기설정된 제1기준을 충족하는 경우에, 상기 다음 질문을 사용자단말에 제공하지 않고, 상기 다음 질문에 대한 답변추론정보에 의해 결정된 그 다음 질문이 사용자단말에 제공될 수 있다. 도 6을 예 로 들면, 질문#C에 대한 답변추론정보에서 분기#4에 대한 확률적 정보가 70%, 분기 #5에 대한 확률적 정보가 25%이고, 기설정된 제1기준이 65% 이상인 경우에, 분기#4에 대한 확률적 정보가 기설정된 제1기준을 충족하므로, 상기 질문#C는 사용자단말에 표시되지 않고, 상기 답변추론정보에 따라 결정된 그 다음 질문 노드인 질문#E가 사용자단말에 제공될 수 있다. 이와 같이, 본 발명의 질문스킵단계를 통해 사용자는 경로에 포함된 모든 질문에 대한 답변(인터랙션)을 수행하 는 것이 아니라, 필수적인 질문에 대한 답변만을 수행할 수 있으므로, 사용자 친화적으로 정신질환을 진단할 수 있는 효과를 발휘할 수 있다.도 7은 본 발명의 일 실시예에 따른 변형질문단계의 수행과정을 개략적으로 도시한다. 도 7에 도시된 바와 같이, 상기 인터랙션단계(S200)는, 상기 답변추론단계에서 도출된 답변추론정보가 상기 제1 기준을 충족하지 않는 경우에, 상기 결정된 다음 질문노드 및 이전에 사용자가 수행한 1 이상의 인터랙션정보에 기초하여 상기 결정된 다음 질문노드에 대한 변형질문노드를 생성하고, 상기 변형질문노드를 현재 제공된 질문 노드의 다음 질문노드로 상기 사용자단말에 제공하는 변형질문단계;를 더 포함할 수 있다. 구체적으로, 상기 인터랙션단계(S200)는 변형질문단계를 포함하며, 상기 변형질문단계는 상술한 바와 같이, 상 기 답변추론단계에서 도출한 답변추론정보에 기초하여, 상기 답변추론정보에 포함된 분기 각각에 대한 확률적 정보가 기설정된 제1기준을 충족하지 않는 경우에 수행될 수 있다. 즉, 상기 변형질문단계에서는 다음 질문에 대한 답변추론정보에 따라 어느 하나의 분기가 결정되지 않는 경우에, 사용자에게 다음 질문을 그대로 제공하는 것이 아니라, 사용자가 이전에 수행했던 인터랙션들을 고려하 여 사용자에게 다음 질문에 대한 정확한 답변을 유도하기 위하여 다음 질문의 내용을 변형하여 사용자에게 제공 하고자 하는 것이다. 더 구체적으로, 상기 변형질문단계는 현재 질문노드에 대한 사용자의 인터랙션에 따라 결정된 다음 질문노드의 질문내용 및 현재까지 사용자의 인터랙션에 따라 수신한 1 이상의 인터랙션정보에 기초하여 상기 다음 질문노드 의 질문내용이 변형된 변형질문노드를 도출한다. 이와 같이 도출된 변형질문노드는 상기 다음 질문노드 대신에 사용자단말에 제공되어 표시될 수 있다. 한편, 상기 변형질문단계는 도 7의 (A)에 도시된 바와 같이, 상기 제2추론모델을 통해 변형질문노드를 생성할 수 있으며, 바람직하게는 상기 제2추론모델은 제3세부추론모델을 포함하고, 상기 제3세부추론모델에 상술한 다 음 질문의 질문내용 및 지금까지 수신한 1 이상의 인터랙션정보를 입력하여 변형질문노드를 도출할 수 있다. 이와 같이, 상기 변형질문단계에서 도출된 변형질문노드에는 과거에 사용자가 입력한 인터랙션의 내용이 반영이 그 다음 질문노드의 질문 내용에 반영된 형태로 변형될 수 있다. 도 7의 (B)에 도시된 내용을 예로 들면, 다음 질문노드의 질문 내용이 \"과민하거나 짜증이 자주나십니까?\"이고, 사용자가 과거에 어렸을 때 짜증이 났던 경험 을 발언했던 경우에, 상기 변형질문단계를 통해 도출된 변형질문노드의 질문내용은 \"어렸을때부터 짜증이 많다 고 하셨는데, 요즘은 어떠신가요?\"와 같이, 이전의 사용자의 인터랙션이 반영된 질문내용으로 변형될 수 있다. 또한, 본 발명의 다른 실시예에서, 상기 변형질문단계에서는 변형질문노드 자체를 생성하는 것이 아니라, 상기 다음 질문노드의 질문 내용이 변형된 질문 내용만을 도출하고, 상기 변형된 질문 내용이 상기 다음 질문노드의 질문 내용을 대신하여 사용자단말에 표시하는 것으로 이해될 수도 있다. 이와 같이, 본 발명의 변형질문단계에서는 답변추론정보를 통해 다음 질문에 대한 분기를 결정할 수 없는 경우 에, 더욱 용이하게 사용자의 인터랙션에 따라 다음 질문에 대한 분기를 결정하기 위하여, 사용자의 과거 인터랙 션의 내용이 반영된 변형질문노드를 생성하여 다음 질문노드 대신에 사용자단말에 제공함으로써, 개인화 된 질문을 사용자가 받아볼 수 있고, 이를 통해 사용자가 인터랙티브 질문콘텐츠에 대하여 높은 몰입감을 가질 수 있도록 하는 효과를 발휘할 수 있다. 도 8은 본 발명의 일 실시예에 따른 레이블링된 인터랙션정보를 사용하여 기계학습모델을 학습시키는 과정을 개 략적으로 도시한다. 도 8에 도시된 바와 같이, 제1기계학습모델학습단계(S400)는 상기 제1기계학습모델을 학습시키기 위한 학습데이 터를 구축하고, 구축된 학습데이터를 사용하여 제1기계학습모델을 학습시킬 수 있다. 구체적으로, 제1기계학습모델학습단계(S400)에서는 상기 인터랙티브 질문콘텐츠에 포함된 복수의 질문노드 가운 데 사용자가 인터랙션을 수행한 복수의 질문노드 각각에 대한 인터랙션정보에 상기 정신질환도출단계(S300)에서 도출된 정신질환을 레이블링한다. 도 8을 예로 들면, 사용자는 인터랙티브 질문콘텐츠에 포함된 복수의 질문노 드 가운데 N 개의 질문노드에 대한 인터랙션을 수행하였고, 상기 정신질환도출단계(S300)에서 N 개의 인터랙션 정보에 기초하여 해당 사용자가 우울증을 갖고 있는 것으로 판단한 경우에, 도 8에 도시된 바와 같이, 제1기계 학습모델학습단계(S400)에서는 N 개의 인터랙션정보 각각에 우울증이라는 레이블을 할당한다. 한편, 상술한 바 와 같이, 인터랙션정보에는 사용자가 해당 질문노드에 대하여 영상 혹은 음성 형태로 입력한 답변정보가 포함될 수 있다. 이와 같이, 정신질환이 레이블링된 인터랙션정보들은 제1기계학습모델을 학습시키기 위한 학습데이터셋에 포함 되며, 상기 제1기계학습모델학습단계(S400)에서는 상기 학습데이터셋을 사용하여 제1기계학습모델을 학습시킬 수 있다. 상기 제1기계학습모델학습단계(S400)를 통해 학습된 제1기계학습모델은, 질문에 대한 답변 등과 같은 사용자의 발언에 대한 음성 형태의 입력정보 또는 상기 사용자의 발언에 대한 음성 및 행동에 대한 영상 형태의 입력정보를 입력받아 해당 사용자의 정신질환을 추론할 수 있다. 추가적으로, 상기 제1기계학습모델학습단계(S400)는, 상기 인터랙션을 수행한 사용자의 사용자특성정보를 추가 적인 학습데이터로 하여 상기 제1기계학습모델을 학습시킬 수 있다. 구체적으로 도 8에 도시된 바와 같이, 상기 제1기계학습모델을 학습시키기 위한 학습데이터에는 상술한 바와 같 이, 정신질환이 레이블링된 1 이상의 인터랙션정보 및 해당 인터랙션을 수행한 사용자의 사용자특성정보가 포함 될 수 있다. 상기 사용자특성정보는 사용자의 특징에 대한 다양한 정보들을 포함할 수 있다. 예를 들어, 상기 사용자특성정보는 사용자의 성별, 연령, 과거 정신질환 이력, 흡연 등의 생활습관 등에 대한 정보를 포함할 수 있다. 이와 같이, 사용자특성정보를 포함하는 학습데이터에 의해 학습된 제1기계학습모델은 입력받는 영상 혹은 음성 에 포함된 사용자의 발언내용 및 사용자의 표정, 어조 등의 비언어적 요소와 더불어 추가적으로 사용자특성정보 를 고려하여 더욱 정확하게 사용자의 정신질환을 판단할 수 있는 효과를 발휘할 수 있다. 도 9는 본 발명의 일 실시예에 따른 컴퓨팅장치의 내부 구성을 개략적으로 도시한다. 상술한 도 1에 도시된 서비스서버는 도 9에 도시된 컴퓨팅장치의 구성요소들을 포함할 수 있다. 도 9에 도시된 바와 같이, 컴퓨팅장치는 적어도 하나의 프로세서(processor), 메모리 (memory), 주변장치 인터페이스(peripheral interface), 입/출력 서브시스템(I/O subsystem), 전력 회로 및 통신 회로를 적어도 포함할 수 있다. 이때, 컴퓨팅장치 는 도 1에 도시된 서비스서버에 해당될 수 있다. 메모리는 일례로 고속 랜덤 액세스 메모리(high-speed random access memory), 자기 디스크, 에스램 (SRAM), 디램(DRAM), 롬(ROM), 플래시 메모리 또는 비휘발성 메모리를 포함할 수 있다. 메모리는 컴퓨팅 장치의 동작에 필요한 소프트웨어 모듈, 명령어 집합 또는 그 밖에 다양한 데이터를 포함할 수 있다. 이때, 프로세서나 주변장치 인터페이스 등의 다른 컴포넌트에서 메모리에 액세스하는 것 은 프로세서에 의해 제어될 수 있다. 주변장치 인터페이스는 컴퓨팅장치의 입력 및/또는 출력 주변장치를 프로세서 및 메모리 에 결합시킬 수 있다. 프로세서는 메모리에 저장된 소프트웨어 모듈 또는 명령어 집합을 실행하여 컴퓨팅장치를 위한 다양한 기능을 수행하고 데이터를 처리할 수 있다. 입/출력 서브시스템은 다양한 입/출력 주변장치들을 주변장치 인터페이스에 결합시킬 수 있다. 예를 들 어, 입/출력 서브시스템은 모니터나 키보드, 마우스, 프린터 또는 필요에 따라 터치스크린이나 센서 등의 주변 장치를 주변장치 인터페이스에 결합시키기 위한 컨트롤러를 포함할 수 있다. 다른 측면에 따르면, 입/출 력 주변장치들은 입/출력 서브시스템을 거치지 않고 주변장치 인터페이스에 결합될 수도 있다.전력 회로는 단말기의 컴포넌트의 전부 또는 일부로 전력을 공급할 수 있다. 예를 들어 전력 회로 는 전력 관리 시스템, 배터리나 교류(AC) 등과 같은 하나 이상의 전원, 충전 시스템, 전력 실패 감지 회 로(power failure detection circuit), 전력 변환기나 인버터, 전력 상태 표시자 또는 전력 생성, 관리, 분배 를 위한 임의의 다른 컴포넌트들을 포함할 수 있다. 통신 회로는 적어도 하나의 외부 포트를 이용하여 다른 컴퓨팅장치와 통신을 가능하게 할 수 있다. 또는 상술한 바와 같이 필요에 따라 통신 회로는 RF 회로를 포함하여 전자기 신호(electromagnetic signal)라고도 알려진 RF 신호를 송수신함으로써, 다른 컴퓨팅장치와 통신을 가능하게 할 수도 있다. 이러한 도 9의 실시예는, 컴퓨팅장치의 일례일 뿐이고, 컴퓨팅장치는 도 9에 도시된 일부 컴포넌 트가 생략되거나, 도 9에 도시되지 않은 추가의 컴포넌트를 더 구비하거나, 2개 이상의 컴포넌트를 결합시키는 구성 또는 배치를 가질 수 있다. 예를 들어, 모바일 환경의 통신 단말을 위한 컴퓨팅장치는 도 9에 도시된 컴포 넌트들 외에도, 터치스크린이나 센서 등을 더 포함할 수도 있으며, 통신 회로에 다양한 통신방식(WiFi, 3G, LTE, Bluetooth, NFC, Zigbee 등)의 RF 통신을 위한 회로가 포함될 수도 있다. 컴퓨팅장치에 포함 가능한 컴포넌트들은 하나 이상의 신호 처리 또는 어플리케이션에 특화된 집적 회로를 포함하는 하드웨어, 소프 트웨어, 또는 하드웨어 및 소프트웨어 양자의 조합으로 구현될 수 있다. 본 발명의 실시예에 따른 방법들은 다양한 컴퓨팅장치를 통하여 수행될 수 있는 프로그램 명령(instruction) 형 태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 특히, 본 실시예에 따른 프로그램은 PC 기반의 프로그 램 또는 모바일 단말 전용의 어플리케이션으로 구성될 수 있다. 본 발명이 적용되는 어플리케이션은 파일 배포 시스템이 제공하는 파일을 통해 컴퓨팅장치에 설치될 수 있다. 일 예로, 파일 배포 시스템은 컴퓨팅장치 의 요청에 따라 상기 파일을 전송하는 파일 전송부(미도시)를 포함할 수 있다. 이상에서 설명된 장치는 하드웨어 구성요소, 소프트웨어 구성요소, 및/또는 하드웨어 구성요소 및 소프트웨어구 성요소의 조합으로 구현될 수 있다. 예를 들어, 실시예들에서 설명된 장치 및 구성요소는, 예를 들어, 프로세서, 콘트롤러, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 마이크 로컴퓨터, FPGA(field programmable gate array), PLU(programmable logic unit), 마이크로프로세서, 또는 명 령(instruction)을 실행하고 응답할 수 있는 다른 어떠한 장치와 같이, 하나 이상의 범용 컴퓨터 또는 특수 목 적컴퓨터를 이용하여 구현될 수 있다. 처리 장치는 운영 체제(OS) 및 상기 운영 체제 상에서 수행되는 하나 이 상의 소프트웨어 어플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설"}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "명된 경우도 있지만, 해당 기술분야에서 통상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소 (processing element) 및/또는 복수 유형의 처리 요소를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 콘트롤러를 포함할 수 있다. 또한, 병렬 프로세서 (parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령(instruction), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결합적으로 (collectively) 처리 장치를 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석되거나 처 리 장치에 명령 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상장 치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영구적으로, 또 는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨팅장치 상에 분산되어서, 분산 된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 컴퓨터 판독 가능 기록 매체에 저장될 수 있다. 실시예에 따른 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판 독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예를 위하여 특별히 설계 되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가 능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD- ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체 (magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도 록 구성될 수 있으며, 그 역도 마찬가지이다. 본 발명의 일 실시예에 따르면, 사용자에게 제공된 인터랙티브 질문콘텐츠를 제공하고, 사용자가 상기 인터랙티 브 질문콘텐츠 상에서의 인터랙션에 따라 해당 사용자가 갖고 있는 정신질환을 판단하므로, 사용자가 거부감 없 이 정신질환을 진단받을 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠에 대한 사용자의 인터랙션에 따른 답변 각각에 도출된 진단정보를 해당 답변에 레이블링하고, 레이블링된 답변을 정신질환 학습데이터로 사용하므로, 용이하게 학습데 이터를 구축할 수 있는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠에 포함된 질문은 사용자단말 상에서 해당 질문을 발화하 는 인터랙티브객체에 의해 표시되므로, 사용자가 더욱 몰입감 있게 인터랙션을 수행할 수 있도록 하는 효과를 발휘할 수 있다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠의 특정 질문노드에 대하여 사용자가 수행한 인터랙션에 따라 다음 질문노드에 대한 답변추론정보를 도출하고, 상기 답변추론정보가 제1기준을 충족하는 경우에, 상기 다음 질문노드는 사용자단말에 표시되지 않고, 상기 답변추론정보에 따른 그 다음 질문노드가 표시되므로, 사용 자가 모든 질문에 대한 답변을 수행하는 것이 아니라, 답변이 요구되는 일부 질문에 대해서만 선택적으로 답변 을 수행할 수 있도록 하여, 사용자가 더욱 편리하게 정신질환을 진단받을 수 있도록 하는 효과를 발휘할 수 있 다. 본 발명의 일 실시예에 따르면, 인터랙티브 질문콘텐츠의 특정 질문노드에 대하여 사용자가 수행한 인터랙션에 따라 다음 질문노드의 질문을 변형하고, 상기 다음 질문노드에 대하여 변형된 질문을 사용자단말 상에 표시하므 로, 사용자가 자신의 답변의 내용이 반영된 질문을 받아볼 수 있으므로, 더욱 몰입감 있게 인터랙션을 수행할 수 있는 효과를 발휘할 수 있다."}
{"patent_id": "10-2022-0147125", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9"}
{"patent_id": "10-2022-0147125", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법을 수행하기 위한 구성요소들을 개략적으로 도시한다. 도 2는 본 발명의 일 실시예에 따른 사용자의 인터랙션에 따라 획득한 데이터를 기반으로 정신질환을 추론하는 기계학습모델을 학습시키기 위한 방법의 세부 단계들을 개략적으로 도시한다. 도 3은 본 발명의 일 실시예에 따른 인터랙티브 질문콘텐츠를 개략적으로 도시한다. 도 4는 본 발명의 일 실시예에 따른 인터랙티브 질문콘텐츠의 질문노드가 인터랙티브객체를 통해 표시되고, 질 문노드에 대한 사용자의 인터랙션을 개략적으로 도시한다. 도 5는 본 발명의 일 실시예에 따른 정신질환도출단계에서 사용자에게 예측되는 정신질환을 도출하는 과정을 개 략적으로 도시한다. 도 6은 본 발명의 일 실시예에 따른 인터랙티브 질문콘텐츠에서 사용자에게 제공되는 질문노드의 일부가 스킵되 는 과정을 개략적으로 도시한다. 도 7은 본 발명의 일 실시예에 따른 변형질문단계의 수행과정을 개략적으로 도시한다. 도 8은 본 발명의 일 실시예에 따른 레이블링된 인터랙션정보를 사용하여 기계학습모델을 학습시키는 과정을 개 략적으로 도시한다. 도 9는 본 발명의 일 실시예에 따른 컴퓨팅장치의 내부 구성을 개략적으로 도시한다."}
