{"patent_id": "10-2020-0169034", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0079350", "출원번호": "10-2020-0169034", "발명의 명칭": "심리학적으로 사용자의 머니패턴을 분석하는 컴퓨터 프로그램", "출원인": "이요셉", "발명자": "이요셉"}}
{"patent_id": "10-2020-0169034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말에서 제1설문이 수행되고, 서버에서 상기 제1설문의 결과값을 수신하여 사용자의 행동기질과 관련된제1머니패턴 데이터를 상기 사용자 단말로 송신하는 단계;상기 사용자 단말에서 제2설문이 수행되고, 상기 서버에서 상기 제2설문의 결과값을 수신하여 사용자의 결핍욕구와 관련된 제2머니패턴 데이터를 상기 사용자 단말로 송신하는 단계; 및상기 사용자 단말에서 제3설문이 수행되고, 상기 서버에서 상기 제3설문의 결과값을 수신하여 사용자의 금융습관과 관련된 제3머니패턴 데이터를 상기 사용자 단말로 송신하는 단계를 포함하는 것을 특징으로 하는 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법."}
{"patent_id": "10-2020-0169034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 서버에서 상기 제1 내지 제3머니패턴 데이터 중 적어도 하나에 대응하는 솔루션을 상기 사용자 단말로 송신하는 단계를 더 포함하는 것을 특징으로 하는 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법."}
{"patent_id": "10-2020-0169034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 내지 제3설문 중 적어도 하나는 사용자의 무의식을 분석하기 위한 설문인 것을 특징으로 하는 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법."}
{"patent_id": "10-2020-0169034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,사용자 단말에서 약식 설문이 수행되고, 서버에서 상기 약식 설문의 결과값을 수신하여 사용자의 행동기질과 관련된 약식 머니패턴 데이터를 상기 사용자 단말로 송신하는 단계를 더 포함하는 것을 특징으로 하는 심리학적으로 사용자의 머티패턴을 분석하는 비즈니스모델의 제공방법."}
{"patent_id": "10-2020-0169034", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 서버에서 복수의 사용자의 안면 촬상에 의한 안면 이미지 데이터와 복수의 사용자의 상기 제1 내지 제3설문의 수행에 의한 상기 제1 내지 제3머니패턴 데이터가 매칭된 데이터를 인공지능 머신러닝에 의해 지도학습하여, 다른 사용자의 얼굴 이미지 데이터에서 상기 제1 내지 제3머니패턴 데이터를 도출하는 것을 특징으로 하는심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "1. 행동심리학적으로 인간의 무의식에서 발현되는 부정적인 머니패턴을 찾아냄으로써 부의 축적에 관한 실질적인 솔루션을 도출할 수 있는 머니패턴을 분석하는 비즈니스모델의 방법을 제공한다. 2. 무의식심리학적으로 어느 방향으로 가장 에너지가 집중되는지 찾아 자신에게 적합한 투자방향과 투자의 비중 (뒷면에 계속)"}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 심리학적으로 사용자의 머니패턴을 분석하는 컴퓨터 프로그램에 관한 것이다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "패턴이란 사전적으로 일정한 형태나 양식 또는 유형을 의미한다. 나아가 \"행동패턴\"은 완전히 습관화되어 '무엇 을 해야지'라고 의식적으로 생각하지 않아도 몸이 저절로 일정한 흐름대로 움직이는 것을 의미한다. 이런 패턴은 생활에서뿐만 아니라 일, 관계, 건강, 자아, 재정(돈)에 대해서도 비슷한 행동패턴이 있다. 즉, 우 리가 돈을 쓰는 것과 버는 것에서도 패턴이 있으며, 가난에도 패턴이 있고 부에도 패턴이 있는데 이를 \"머니패 턴\"이라고 부리그로 한다. 사람들은 누구나 부를 축적하고 싶어하지만 돈이 모아지지 않는다. 부자가 되는 사람은 극소수일 뿐이다. 한편, 종래에는 부를 이루기 위해서 부에 대한 공부를 열심히 하고, 근검절약하고 투자해서 부자가 된 사람들도 있다. 그러나 인간의 심리적인 요인을 배제한, 즉, 머니패턴에 대한 깊이 있는 심리학적 탐구가 없는 피상적인 솔루션 은 돈에 대한 관리나 유지가 되지 않는다. 관계가 다 깨어진 부자에 불과하다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 심리학적으로 인간의 무의식에서 발현되는 부정적인 머니패턴을 찾아 냄으로 써, 부의 축적에 관한 실질적인 솔루션을 도출할 수 있는 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스 모델의 제공방법을 제공하는 것이다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법 은 사용자 단말에서 제1설문이 수행되고, 서버에서 상기 제1설문의 결과값을 수신하여 사용자의 행동기질과 관 련된 제1머니패턴 데이터를 상기 사용자 단말로 송신하는 단계; 상기 사용자 단말에서 제2설문이 수행되고, 상 기 서버에서 상기 제2설문의 결과값을 수신하여 사용자의 결핍욕구와 관련된 제2머니패턴 데이터를 상기 사용자 단말로 송신하는 단계; 상기 사용자 단말에서 제3설문이 수행되고, 상기 서버에서 상기 제3설문의 결과값을 수 신하여 사용자의 금융습관과 관련된 제3머니패턴 데이터를 상기 사용자 단말로 송신하는 단계를 포함하는 것을 특징으로 할 수 있다. 상기 서버에서 상기 제1 내지 제3머니패턴 데이터 중 적어도 하나에 대응하는 솔루션을 상기 사용자 단말로 송 신하는 단계를 더 포함하는 것을 특징으로 할 수 있다. 상기 제1 내지 제3설문 중 적어도 하나는 사용자의 무의식을 분석하기 위한 설문인 것을 특징으로 할 수 있다. 사용자 단말에서 약식 설문이 수행되고, 서버에서 상기 약식 설문의 결과값을 수신하여 사용자의 행동기질과 관 련된 약식 머니패턴 데이터를 상기 사용자 단말로 송신하는 단계를 더 포함하는 것을 특징으로 할 수 있다. 상기 서버에서 복수의 사용자의 안면 촬상에 의한 안면 이미지 데이터와 복수의 사용자의 상기 제1 내지 제3설 문의 수행에 의한 상기 제1 내지 제3머니패턴 데이터가 매칭된 데이터를 인공지능 머신러닝에 의해 지도학습하 여, 다른 사용자의 얼굴 이미지 데이터에서 상기 제1 내지 제3머니패턴 데이터를 도출하는 것을 특징으로 할 수 있다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법에서는 제1 내지 제3심리학적 설문을 통해, 사용자의 행동기질과 결핍욕구와 금융습관과 관련된 제 1 내지 제3머니패턴 데이터를 도출하여, 사용자의 내면의 감정을 컨트롤할 수 있는 솔루션을 제공함으로써, 사용자에게 부를 축적할 수 있는 마인드컨트 롤과 행동 개선을 실질적으로 코칭할 수 있다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 이하, 도면을 참조하여다. 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법 을 설명한다. 도 1은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법을 나타낸 개념도이고, 도 2는 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법의 시스템을 나타낸 블록도이고, 도 3은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제 공방법을 나타낸 순서도이고, 도 4는 본 발명의 약식 설문이 수행 및 약식 머니패턴이 도출되는 과정에 대한 웹 리스트를 나타낸 사진이고, 도 5는 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공 방법이 인공지능을 이용하여 구현되는 것을 나타낸 순서도이고, 도 6은 본 발명의 심리학적으로 사용자의 머니 패턴을 분석하는 비즈니스모델의 제공방법에 의해 구현된 전문가 매칭 플랫폼을 나타낸 개념도이고, 도 7은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법에 의해 구현된 전문가 매칭 플랫 폼의 매칭 단계를 나타낸 순서도이다.도 1에서 나타내는 바와 같이, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법 은 사용자 단말과 네트워크와 서버를 포함하는 머니패턴 시스템 내에서 수행될 수 있다. 사용자 단말은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션이 사용자에게 제공되는 단말일 수 있다. 사용자 단말은 네트워크를 통하여 원격지의 서버에 접속할 수 있는 컴퓨터로 구현될 수 있으며, 일 예로, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 상세하게, 사용자 단말은 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(smartphone), 스마트 패드(smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있으나 이에 한 정되는 것은 아니다. 사용자 단말은 네트워크를 통해 서버와 연결될 수 있다. 네트워크는 사용자 단말과 서버와 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 RF, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5GPP(5rd Generation Partnership Project) 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), 블루투스 (Bluetooth) 네트워크, NFC 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 서버는 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법관련 웹 페이 지, 앱 페이지, 프로그램 또는 애플리케이션을 제공하는 서버일 수 있다. 나아가 서버는 딥러닝 인공신경망 알고리즘을 이용하여 데이터 학습을 진행할 수 있다. 상세하게, 서버(3 0)는 인공지능이 내재되어 있어, 복수의 사용자의 안면 이미지 데이터와 머니패턴 데이터가 매칭된 데이터를 딥 러닝 지도학습으로 기계학습할 수 있다. 도 2에서 나타내는 바와 같이, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법 은 약식 설문 단계(S0), 제1설문 단계(S1), 제2설문 단계(S2), 제3설문 단계(S3) 및 솔루션 제공 단계(S 4)를 포함할 수 있다. 약식 설문 단계(S0)는 공중의 관심을 불러일으키기 위한 것으로서, 사용자 단말에서 약식 설문이 수행되고, 서버에서 약식 설문의 결과값을 수신하여 사용자의 행동기질과 관련된 약식 머니패턴 데이터를 사용자 단말 로 송신할 수 있다. 약식 설문은 후술하는 제1설문보다 문항수가 적고 간단하며, 약식 머니패턴 데이터 또한 제1머니패턴 데이터보 다 더 많은 정보를 제공하지 않는다. 이에 따라, 약식 설문 단계(S0)는 공중의 가벼운 흥미를 불러일으켜 본 발 명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법으로 공중의 접근을 용이하게 할 수 있다. 한편, 약식 설문 단계(S0)에서는 별도의 솔루션이 제공되지는 않는 것을 특징으로 한다. 제1설문 단계(S1)는 설문을 통해 사용자의 무의식에서 나오는 행동기질을 알아보는 단계로서, 사용자 단말 에서 제1설문이 수행되고, 서버에서 제1설문의 결과값을 수신하여 사용자의 행동기질과 관련된 제1머니패턴 데이터를 사용자 단말로 송신하는 단계일 수 있다. 이 경우, 사용자의 행동기질과 관련된 제1머니패턴 데이터에서는 사용자의 행동기질을 복수의 유형으로 구분할 수 있다. 일 예로, 제1머니패턴 데이터에서는 사용자의 행동기질을 피해자형 머니패턴(열등감이라는 무의식에서 발현; 한 가지에 몰입하여 성취는 하지만 끊임없는 부족함을 느끼기 때문에 과소비를 하거나 과도히 아낄 수 있 는 유형), 팔랑귀형 머니패턴(외로움이라는 무의식에서 발현; 인간관계 때문에 보증 등을 거절하지 못하여 돈이새어나가는 유형), 질러형 머니패턴(억울함이라는 무의식에서 발현; 느낌이 오면 충동적으로 행동으로 옮기는 유형), 완벽형 머니패턴(두려움이라는 무의식에서 발현; 돈을 버는 것도 쓰는 것도 두려워하여 저축만할 뿐 투 자 등을 하지 못하는 유형) 및 쟁취형 머니패턴(경쟁심이라는 무의식에서 발현; '돈을 가진 자가 힘이다.'라는 신념 때문에 부를 이루는데 수단과 방법을 가리지 않고 도전은 하지만 관계의 문제가 생겨 돈이 샐 수 있는 유 형)으로 구분할 수 있으나, 이에 한정되는 것은 아니다. 심리가 건강한 유형도 있기 때문이다. 제2설문 단계(S2)는 설문을 통해 사용자의 무의식에서 나오는 결핍욕구를 가지고 올바른 투자 유형을 알아보는 단계로서, 결핍욕구는 평생을 통해 이루고자 하는 강한 심리적 욕구가 있기 때문에 투자 방향도 무의식의 심리 를 사용해야 돈을 증식할 수 있다. 사용자 단말에서 제2설문이 수행되고, 서버에서 제2설문의 결과값을 수신하여 사용자의 결핍욕구와 관련된 제2머니패턴 데이터를 상기 사용자 단말로 송신하는 단계일 수 있다. 이 경우, 사용자의 결핍욕구와 관련된 제2머니패턴 데이터에서는 사용자의 결핍 욕구과 관련된 올바른 투자 유 형을 복수의 유형으로 구분할 수 있다. 일 예로, 제2머니패턴 데이터에서는 사용자의 올바른 투자 유형을 안전 형 투자(로우 리스크 로우 리턴), 공격형 투자(하이 리스크 하이 리턴) 및 안전공격형 투자(미들 리스크 미들 리턴)로 구분할 수 있으나, 이에 한정되는 것은 아니다. 제3설문 단계(S3)는 설문을 통해 사용자의 금융습관을 알아보는 단계로서, 사용자 단말에서 제3설문이 수행 되고, 서버에서 제3설문의 결과값을 수신하여 사용자의 금융습관과 관련된 제3머니패턴 데이터를 상기 사용 자 단말로 송신하는 단계일 수 있다. 이 경우, 사용자의 금융습관이란 사용자가 자신의 자본을 관리(돈을 벌거나 소비하는 등의 행위)하는 습관을 패 턴화한 것을 의미할 수 있다. 이 경우, 사용자의 금융습관과 관련된 제3머니패턴 데이터는 사용자의 관리 패턴, 증식 패턴, 부의 그릇 패턴, 공헌 패턴, 소비 패턴에 대한 수치를 포함할 수 있으나, 이에 한정되는 것은 아니다. 한편, 최소량의 법칙(독일 화학자 리비히의 법칙으로서 질소, 인산 칼리 등 식물 성장에 필요한 필수 영양소 중 성장을 좌우하는 것은 넘 치는 요소가 아닌 부족한 요소라는 법칙)에 의해, 상술한 5가지 패턴에 대한 수치는 최소량 이상이어야 하며 결 핍되는 경우 자산 관리 실패로 부를 축적하지 못할 수 있다. 솔루션 제공 단계(S4)는 사용자가 제1 내지 제3설문을 수행하여 도출된 제1 내지 제3머니패턴 중 적어도 하나에 대응하는 솔루션을 제공하는 단계로서, 서버에서 제1 내지 제3머니패턴 데이터 중 적어도 하나에 대응하는 솔루션을 사용자 단말로 송신하는 단계일 수 있다. Part1. 일 예로 나잘라형 머니패턴의 행동기질을 가진 사용자에게는 인간관계를 잘 하는 팔랑귀의 보완이 필요 하며 사람을 신뢰하고 많은 정보를 받아들이는 부를 창출할 수 있는 솔루션을 제공(믿을 만한 사람의 조언으로 투자 진행)할 수 있고, 팔랑귀형 머니패턴의 행동기질을 가진 사용자에게는 분명한 목표를 가지고 뜻을 이뤄내 는 쟁취형의 솔루션을 제공할 수 있고, 질러형 머니패턴의 행동기질을 가진 사용자에게는 직감에 의존하지 않고 정확한 정보를 찾는 완벽형의 솔루션을 제공할 수 있고, 완벽형 머니패턴의 행동기질을 가진 사용자에게는 생각 한 것을 행동으로 옮기는 질러형의 솔루션을 제공(일상탈출, 안정적인 투자 진행)할 수 있고, 쟁취형 머니패턴 의 행동기질을 가진 사용자에게는 공동체와 진짜 행복이 무엇인지 건강한 부자가 되기 위한 솔루션을 제공(쟁취 형 머니패턴은 돈을 벌 수 있는 여러가지 방법과 남보다 앞선 도전의 힘이 탁월)할 수 있다. Part2. 강한 무의식의 에너지원인 결핍욕구에서는 4가지로 나눌 수 있다. 안정욕구결핍, 사회욕구결핍, 힘의욕 구결핍, 자유욕구결핍이 있다. 이 결핍욕구에 따라 감정과 사고, 행동방향이 다르기 때문에 투자방향도 달라야 부에 대한 에너지가 생긴다. 한 예로 안전형 투자 성향을 가진 사용자에게는 부동산은 월세나 임대수익이 적합 하고, 보험은 연금식의 보험이 적합하고, 주식은 성장주보다 가치주(우량주) 투자나 ETF등의 Low리스트에 Low리 턴의 안정적인 재테크 수단을 추천하는 솔루션을 제공할 수 있다. 반면 힘의 욕구결핍이나 자유욕구결핍은 공격 형 투자 성향을 가진 자들인데 이들은 장외주식, 성장주식, 가상화폐, 갭투자등 불안정하지만 하이 리턴을 기대 할 수 있는 재테크 수단을 추천하는 솔루션을 제공할 수 있다. Part3. 사용자의 제3머니 패턴 중의 관리 패턴, 증식 패턴, 부의 그릇 패턴, 공헌 패턴, 소비 패턴 중 기대값에 서 결핍되는 패턴을 보강하는 솔루션을 제공할 수 있다. 한편, 약식 설문과 제1 내지 제3설문 중 적어도 하나는 사용자의 무의식을 분석하기 위한 설문일 수 있다. 즉, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법은 심리학적으로 사용자의무의식을 파악하는 설문을 통하여 사용자의 무의식에 잠재된 네거티브한 머니패턴을 도출하고, 이에 대한 솔루 션을 제공함으로써, 사용자 스스로의 자각과 심리학적 학습에 의해 포지티브한 머니패턴을 형성하도록 코칭할 수 있다. 한편, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법은 인공지능 기계학 습을 통해 사용자가 자신의 안면을 촬상하는 간단한 방법으로 제1 내지 제3머니패턴 데이터를 도출할 수 있다. 기계학습은 명시적으로 프로그램되지 않아도 컴퓨터가 스스로 학습할 수 있도록 능력을 부여하는 방법론으로 정 의될 수 있으며, 이는 데이터를 기반으로 프로그램이 스스로 데이터의 패턴을 학습하도록 하는 방식이다. 기계 학습은 학습에 필요한 데이터에 정답의 명시 여부에 따라 지도학습(Supervised Learning)과 비지도학습 (Unsupervised Learning)으로 구되고, 사용 목적에 따라 데이터를 유한개의 카테고리로 나누는 분류 (Classification), 연속적인 값으로 맵핑하는 리그레션(Regression), 유사한 데이터를 묶는 군집화 (Clustering), 다차원의 데이터를 대표성 있는 낮은 차원으로 사상하는 차원축소(Dimension Reduction) 방법론 으로 구분된다. 딥러닝은 기계학습 기법 중 하나로 한동안 정체되었던 기계학습의 성능을 획기적으로 향상시켰는데, 딥러닝은 인간의 뇌 구조에서 시냅스의 중첩을 흉내 낸 인공신경망(ANN : Artificial Neural Network) 알고리즘에 기반한 방법론이며, 딥러닝 구조로는 입력 계층(Input Layer)과 출력 계층(Output Layer) 사이에 복수의 은닉 계층 (Hidden Layer)이 존재하는 심층신경망(DNN : Deep Neural Network), 은닉계층 앞에 요인 추출에 필요한 필터 를 두고 필터를 함께 학습하는 나선형신경망(CNN : Convolutional Neural Network), 각 시간의 인공신경망을 적층해 시계열 데이터 처리가 가능한 재귀신경망(RNN : Recurrent Neural Network)을 포함할 수 있다. 여기서, 딥러닝 모델의 높은 성능은 두 가지로 설명되는데, 첫째, 인경신경망은 각 계층에 있는 함수들의 가중합의 중첩 으로 모든 종류의 함수가 근사 가능한 범용근사법(Universal Approximator)으로 충분히 일반적인 데이터가 주어 진다면 높은 정확도로 데이터를 모사할 수 있다. 둘째, 데이터를 잘 구분하기 위해서는 데이터를 대표하는 요인 을 적절하게 추출하는 것이 중요한데 나선형신경망을 이용하여 필터 학습을 통해 최적의 요인을 추출할 수 있다 는 것이다. 또한, 딥러닝은 인공신경망(neural network)이라는 인공지능분야의 모형이 발전된 형태로서, 계층구 조로 이루어진 인공신경망의 내부계층(hidden layer)이 여러 단계로 이루어진 구조이다. 최근의 딥러닝 모형은 내부계층이 많아져서 노드(node)를 연결하는 가중치(weight, 연결강도를 의미함)의 수가 최대 수십억 개가 되기 도 한다. 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법에서는 인공지능 머신러닝 에 의한 지도학습을 이용하여, 사용자가 사용자 단말에 내장된 카메라 모듈로 안면을 촬상하는 간단한 과정 만으로 해당 사용자에 대한 머니패턴 분석이 이뤄질 수 있다. 이를 위해, 서버에서 복수의 사용자의 안면 촬상에 의한 안면 이미지 데이터와 복수의 사용자의 제1 내지 제3설문의 수행에 의한 제1 내지 제3머니패턴 데이터가 매칭된 데이터(지도학습 소스 데이터)를 인공지능 머신 러닝에 의해 지도학습하여, 다른 사용자의 얼굴 이미지 데이터에서 제1 내지 제3머니패턴 데이터를 도출할 수 있다. 즉, 복수의 사용자가 약식 설문 단계(S0), 제1설문 단계(S1), 제2설문 단계(S2), 제3설문 단계(S3)를 반복하여 진행한 다음, 상술한 서버에서 인공지능 머신러닝에 의해 지도학습하여 다른 사용자의 얼굴 이미지 데이터 에서 다른 사용자의 제1 내지 제3머니패턴 데이터를 도출하는 단계(S10)를 진행한 다음, 다른 사용자에 대한 솔 루션 제공 단계(S4)가 진행될 수 있다. 한편, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법의 변형례(미도시)에서는 공중의 개인 머니패턴 정보를 보호하기 위한 기능이 내장되어 있을 수 있다. 이는 특정 사용자가 도촬한 다른 사용자의 얼굴 이미지 데이터를 이용하여 무단으로 다른 사용자의 머니패턴 데이터를 획득하는 것을 방지하기 위함이다. 이를 위해, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법의 변형례(미도시) 에서는 서버에서 인공지능 머신러닝에 의해 지도학습하는 단계(S10-1); 다른 사용자의 동적 이미지 데이터 를 획득하는 단계(S10-2); 다른 사용자의 동적 이미지 데이터가 특정 검증 패턴과 합치하는지 검증하는 단계 (S10-3); 검증이 완료된 다른 사용자의 동적 이미지 데이터에서 얼굴 이미지 데이터를 추출하여 다른 사용자의 제1 내지 제3머니패턴 데이터를 도출하는 단계(S10-4);를 포함할 수 있다.즉, 다른 사용자가 머니패턴 데이터를 도출해도 좋다는 검증 패턴에 해당하는 동적 신호(일 예로, 손을 흔드는 행위)를 포함한 동적 이미지 데이터를 이용하여 검증 패턴과의 합치 여부를 검증한 다음, 검증이 되면 다른 사 용자가 머니패턴 데이터를 도출해도 좋다는 동의의 의미로 해석하여, 머니패턴 데이터를 도출할 수 있다. 또한, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법의 변형례(미도시)에서는 검증이 완료된 다른 사용자의 동적 이미지 데이터에서 얼굴 이미지 데이터를 추출하는 과정에서 머니패턴 분석 에 사용할 얼굴 이미지 데이터에 대한 프레임을 다른 사용자가 선택할 수 있다. 즉, 동적 이미지 데이터는 다른 사용자의 얼굴을 다양한 각도에서 촬상한 프레임의 집합체이기 때문에 특정 프레임은 다른 사용자의 얼굴을 제 대로 표현하지 못할 수 있다. 이 경우, 다른 사용자가 동적 이미지 데이터에서 자신의 얼굴을 가장 잘 표현한 프레임을 선택함으로써, 다른 사용자의 진짜 얼굴에 정합하는 얼굴 이미지 데이터를 통해 정확한 머니패턴 결과 를 얻을 수 있다. 나아가 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법의 변형례(미도시)에서 는 인공지능이 동적 이미지 데이터의 복수의 프레임 중에서 자신이 가장 많이 학습하여 정확도가 높은, 즉, 가 장 많은 량의 학습데이터를 가지고 있는, 각도의 얼굴 이미지 데이터와 관련된 프레임을 선택하여 다른 사용자 에게 추천해줄 수도 있다. 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법을 이용하여 사용자를 전 문가와 매칭하는 매칭 플랫폼을 운영할 수 있다. 즉, 전문가 매칭 플랫폼에서는 복수의 사용자 각각의 제1 내지 제3머니패턴 데이터에 대응되는 각각의 전 문가가 구비된 전문가풀이 형성되어 있고, 해당 사용자의 제1 내지 제3머니패턴 데이터에 대응되는 전문가를 자 동으로 매칭시킬 수 있다. 이에 따라, 전문가 매칭 플랫폼의 매칭 단계는 사용자가 약식 설문 단계(S0), 제1설문 단계(S1), 제2설문 단계 (S2), 제3설문 단계(S3), 솔루션 제공 단계(S4)를 진행한 다음, 해당 사용자의 제1 내지 제3머니패턴 데이터에 대응되는 전문가를 매칭하는 단계(S20)가 진행될 수 있으며, 이 경우, 약식 설문 단계(S0)와 솔루션 제공 단계 (S4) 중 적어도 하나는 생략될 수 있으며, 전문가를 매칭하는 단계(S20) 이 후에 솔루션 제공 단계(S4)가 진행 될 수도 있다. 한편, 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법을 이용하여 사용자를 전 문가와 매칭하는 매칭 플랫폼의 변형례(미도시)에서는 복수의 사용자에서 제1 내지 제3머니패턴 데이터의 유사 도가 높은 사용자 복수의 그룹을 형성하는 단계; 복수의 그룹 내의 사용자끼리 커뮤니케이션할 수 있는 채팅서 비스를 제공하는 단계; 복수의 그룹 각각에서 제1 내지 제3머니패턴 데이터가 동일한 부분을 추출하여 추출된 제1 내지 제3머니패턴 데이터에 대응되는 전문가를 매칭한 클래스를 제공하는 단계;를 더 포함할 수 있다. 즉, 복수의 사용자 중에서 머니패턴 데이터가 유사한 사용자들을 그룹핑하여 상호 간 채팅(커뮤니케이션)을 통 해 자신과 동일한 성향을 가진 동료에 대해 알아가고, 그들을 통해 자신을 되돌아보는 계기를 형성할 수 있다. 나아가 그룹 내의 사용자 중에서 동일한 제1 내지 제3머니패턴 데이터를 추출하고 이에 대응되는 전문가를 매칭 함으로써 집중적인 솔루션을 제공할 수 있다. 이상에서 전술한 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법은 하드 웨어인 서버와 결합되어 실행되기 위한 프로그램(또는 어플리케이션)으로 구현되어 매체에 저장될 수 있다. 상기 전술한 프로그램은, 상기 컴퓨터가 프로그램을 읽어 들여 프로그램으로 구현된 상기 방법들을 실행시키기 위하여, 상기 컴퓨터의 프로세서(CPU)가 상기 컴퓨터의 장치 인터페이스를 통해 읽힐 수 있는 C, C++, JAVA, 기 계어 등의 컴퓨터 언어로 코드화된 코드(Code)를 포함할 수 있다. 이러한 코드는 상기 방법들을 실행하는 필요 한 기능들을 정의한 함수 등과 관련된 기능적인 코드(Functional Code)를 포함할 수 있고, 상기 기능들을 상기 컴퓨터의 프로세서가 소정의 절차대로 실행시키는데 필요한 실행 절차 관련 제어 코드를 포함할 수 있다. 또한, 이러한 코드는 상기 기능들을 상기 컴퓨터의 프로세서가 실행시키는데 필요한 추가 정보나 미디어가 상기 컴퓨 터의 내부 또는 외부 메모리의 어느 위치(주소 번지)에서 참조되어야 하는지에 대한 메모리 참조관련 코드를 더 포함할 수 있다. 또한, 상기 컴퓨터의 프로세서가 상기 기능들을 실행시키기 위하여 원격(Remote)에 있는 어떠 한 다른 컴퓨터나 서버 등과 통신이 필요한 경우, 코드는 상기 컴퓨터의 통신 모듈을 이용하여 원격에 있는 어떠한 다른 컴퓨터나 서버 등과 어떻게 통신해야 하는지, 통신 시 어떠한 정보나 미디어를 송수신해야 하는지 등 에 대한 통신 관련 코드를 더 포함할 수 있다. 상기 저장되는 매체는, 레지스터, 캐쉬, 메모리 등과 같이 짧은 순간 동안 데이터를 저장하는 매체가 아니라 반 영구적으로 데이터를 저장하며, 기기에 의해 판독(reading)이 가능한 매체를 의미한다. 구체적으로는, 상기 저 장되는 매체의 예로는 ROM, RAM, CD-ROM, 자기 테이프, 플로피디스크, 광 데이터 저장장치 등이 있지만, 이에 제한되지 않는다. 즉, 상기 프로그램은 상기 컴퓨터가 접속할 수 있는 다양한 서버 상의 다양한 기록매체 또는 사용자의 상기 컴퓨터상의 다양한 기록매체에 저장될 수 있다. 또한, 상기 매체는 네트워크로 연결된 컴퓨터 시 스템에 분산되어, 분산방식으로 컴퓨터가 읽을 수 있는 코드가 저장될 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다."}
{"patent_id": "10-2020-0169034", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7"}
{"patent_id": "10-2020-0169034", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법을 나타낸 개념도이다. 도 2는 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법의 시스템을 나타낸 블 록도이다. 도 3은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법을 나타낸 순서도이다. 도 4는 본 발명의 약식 설문이 수행 및 약식 머니패턴이 도출되는 과정에 대한 웹 리스트를 나타낸 사진이다. 도 5는 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법이 인공지능을 이용하여 구현되는 것을 나타낸 순서도이다. 도 6은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법에 의해 구현된 전문가 매칭 플랫폼을 나타낸 개념도이다. 도 7은 본 발명의 심리학적으로 사용자의 머니패턴을 분석하는 비즈니스모델의 제공방법에 의해 구현된 전문가 매칭 플랫폼의 매칭 단계를 나타낸 순서도이다."}
