{"patent_id": "10-2023-0030221", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0140986", "출원번호": "10-2023-0030221", "발명의 명칭": "농기계 자율주행 방법 및 농기계 자율주행을 위한 장치", "출원인": "충남대학교산학협력단", "발명자": "원문철"}}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "농기계가 주행하면서 토지를 촬영하여 촬영 이미지를 생성하는 촬영 이미지 생성단계; 토지 이미지로부터 경작지 및 비경작지를 분할하도록 인공지능 학습된 분할 이미지 생성부가 상기 촬영 이미지를 기초로 경작지와 비경작지를 분할한 분할 이미지를 생성하는 분할 이미지 생성단계; 상기 분할 이미지를 기초로 2차원의 점유 격자 지도를 생성하는 점유 격자 지도 생성단계; 상기 점유 격자 지도에서 상기 경작지의 경계를 추출하는 경계 추출단계; 상기 경작지의 경계 내측에서 상기 농기계의 주행을 위한 조향각을 생성하는 조향 정보 생성단계; 및 생성되는 상기 조향각에 기초하여 상기 농기계의 조향부를 제어하는 조향 제어단계를 포함하는 것을 특징으로하는 농기계 자율주행 방법."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 조향 정보 생성단계는 상기 점유 격자 지도에, 주행중인 상기 농기계의 현재 위치를 나타내는 기준점을 생성하는 기준점 생성단계와, 상기 점유 격자 지도에, 상기 농기계의 조향 방향을 생성하기 위한 시작점, 끝점 및 평균점을 생성하는 3점 생성단계와, 상기 시작점, 상기 끝점 및 상기 평균점을 미리 설정된 크기만큼 오프셋(Offset)하는 오프셋 단계와, 상기 평균점과 상기 끝점 사이에 경유점을 설정하는 경유점 설정단계와, 상기 기준점에서 상기 경유점을 연결하는 연결선분과 상기 기준점을 지나는 수직선분 사이의 각도를 상기 조향각으로 생성하는 조향각 생성단계를 가지는 것을 특징으로 하는 농기계 자율주행 방법."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 3점 생성단계에서는, 상기 점유 격자 지도에서, 상기 기준점을 지나는 수평선분이 상기 경계와 교차하는 지점을 상기 시작점으로 생성하고, 상기 점유 격자 지도에서, 상기 시작점에서 상기 경계를 따라 가장 먼 지점을 상기 끝점으로 생성하는 것을 특징으로 하는 농기계 자율주행 방법."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서, 상기 오프셋 단계에서는, 상기 시작점을 상기 수평선분을 따라 상기 경계의 내측 방향을 판별한 후, 상기 내측 방향으로 미리 설정된 거리만큼 오프셋하고, 상기 시작점이 오프셋되는 만큼 상기 끝점 및 상기 평균점도 오프셋하는 것을 특징으로 하는 농기계 자율주행 방법."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2024-0140986-3-제3항에 있어서, 상기 경유점 설정단계는, 상기 시작점과 상기 평균점을 이은 선분과, 상기 기준점에서 상기 선분에 수직한 선이 교차하는 교차점에서부터상기 평균점을 지나 상기 끝점 방향을 따라 미리 설정된 지향 거리의 종단점을 상기 경유점으로 설정하는 것을특징으로 하는 농기계 자율주행 방법."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "농기계에 구비되고, 상기 농기계가 주행하면 토지를 촬영하여 촬영 이미지를 생성하는 촬영 이미지 생성부; 토지 이미지로부터 경작지 및 비경작지를 분할하도록 인공지능 학습되고, 상기 촬영 이미지를 기초로 경작지와비경작지를 분할한 분할 이미지를 생성하는 분할 이미지 생성부; 상기 분할 이미지를 기초로 2차원의 점유 격자 지도를 생성하는 점유 격자 지도 생성부; 상기 점유 격자 지도에서 상기 경작지의 경계를 추출하는 경계 추출부; 상기 경작지의 경계 내측에서 상기 농기계의 주행을 위한 조향각을 생성하는 조향 정보 생성부; 및 생성되는 상기 조향각에 기초하여 상기 농기계의 조향부를 제어하는 조향 제어부를 포함하는 것을 특징으로 하는 농기계 자율주행을 위한 장치."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 조향 정보 생성부는 상기 점유 격자 지도에, 주행중인 상기 농기계의 현재 위치를 나타내는 기준점을 생성하고, 상기 점유 격자 지도에, 상기 농기계의 조향 방향을 생성하기 위한 시작점, 끝점 및 평균점을 생성하며, 상기 시작점, 상기 끝점 및 상기 평균점을 미리 설정된 크기만큼 오프셋(Offset)하고, 상기 평균점과 상기 끝점 사이에 경유점을 설정하며, 상기 기준점에서 상기 경유점을 연결하는 연결선분과 상기 기준점을 지나는 수직선분 사이의 각도를 상기 조향각으로 생성하는 것을 특징으로 하는 농기계 자율주행을 위한 장치."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 조향 정보 생성부는 상기 점유 격자 지도에서, 상기 기준점을 지나는 수평선분이 상기 경계와 교차하는 지점을 상기 시작점으로 생성하고, 상기 점유 격자 지도에서, 상기 시작점에서 상기 경계를 따라 가장 먼 지점을 상기 끝점으로 생성하는 것을 특징으로 하는 농기계 자율주행을 위한 장치."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 조향 정보 생성부는 상기 시작점을 상기 수평선분을 따라 상기 경계의 내측 방향을 판별한 후, 상기 내측 방향으로 미리 설정된 거리만큼 오프셋하고, 상기 시작점이 오프셋되는 만큼 상기 끝점 및 상기 평균점도 오프셋하는 것을 특징으로 하는 농기계 자율주행을 위한 장치."}
{"patent_id": "10-2023-0030221", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2024-0140986-4-제8항에 있어서, 상기 조향 정보 생성부는 상기 시작점과 상기 평균점을 이은 선분과, 상기 기준점에서 상기 선분에 수직한 선이 교차하는 교차점에서부터상기 평균점을 지나 상기 끝점 방향을 따라 미리 설정된 지향 거리의 종단점을 상기 경유점으로 설정하는 것을특징으로 하는 농기계 자율주행을 위한 장치."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일실시예는 비정형의 경작지에 대해서 자율 경작을 위한 경로 계획을 수립하기 위해 필요한 경작지 경 계에 대한 정보를 자율 획득할 수 있는 농기계 자율주행 방법 및 농기계 자율주행을 위한 장치를 제공한다. 여기 서, 농기계 자율주행 방법은 농기계가 주행하면서 토지를 촬영하여 촬영 이미지를 생성하는 단계와, 토지 이미지 로부터 경작지 및 비경작지를 분할하도록 인공지능 학습된 분할 이미지 생성부가 촬영 이미지를 기초로 경작지와 비경작지를 분할한 분할 이미지를 생성하는 단계와, 분할 이미지를 기초로 2차원의 점유 격자 지도를 생성하는 단계와, 점유 격자 지도에서 경작지의 경계를 추출하는 단계와, 경작지의 경계 내측에서 농기계의 주행을 위한 조향각을 생성하는 단계와, 생성되는 조향각에 기초하여 농기계의 조향부를 제어하는 단계를 포함한다."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농기계 자율주행 방법 및 농기계 자율주행을 위한 장치에 관한 것으로, 더욱 상세하게는 비정형의 경 작지에 대해서 자율 경작을 위한 경로 계획을 수립하기 위해 필요한 경작지 경계에 대한 정보를 자율 획득할 수 있는 농기계 자율주행 방법 및 농기계 자율주행을 위한 장치에 관한 것이다."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 농기계는 갈수록 줄어드는 농업인구와 농업인의 노령화 문제로 농업인구가 줄어드는 현시대에서, 농사 작업 효율을 증대시키기 위해서 광범위하게 사용되고 있다. 일 예로, 트랙터 또는 이앙기는 드넓은 농지에서 작동하는 장비로서, 농민들에게 필수적인 장비이다. 최근에는, 작업 효율성을 높이기 위해, 자율적으로 주행하여 작업효율을 향상시킬 수 있는 자율주행 트랙터나 자율주행 이 앙기가 개발되고 있다. 도 1은 농기계에 적용되고 있는 종래의 자율주행 방법을 설명하기 위한 예시도이다. 도 1의 (a)에서 보는 바와 같이, 종래의 농기계 자율주행 방법에서는 농기계가 직진 자율주행만 수행이 가 능하다. 그리고, 종래의 농기계 자율주행을 위해서는 작업자가 농기계를 직접 운전하여 경작지의 각 모서리 (11,12,13,14)에 대한 좌표를 획득해서 경작지의 경계를 확정하였다. 이러한 과정을 통해 경작지의 경계 가 획득된 후에는, 농기계는 경계의 내측에서 직진 구간(31,32)과 곡선/회전 구간에서 자율주 행하며 작업을 하게 된다. 한편, 도 1의 (a)에서와 같은 정형의 경작지의 경우, 획득되는 경작지의 경계가 경작지의 실제 형상과 어느 정도 유사할 수 있다. 반면, 경작지가 비정형인 경우에는, 경작지 내에 4개의 모서리(11,12,13,14)로 이루어지 는 획득 경계가 실제 경작지의 경계와 차이가 많이 발생하기 때문에, 실제 경작지의 경계와 획득 경계 사이의 영역에서는 농기계가 자율 주행을 하지 않아 농작업이 이루어지지 못하는 문제점이 있다. 따라서, 경작지의 경계를 생성하기 위한 GPS 좌표를 얻기 위해 작업자가 직접 운전하는 수고를 덜면서도, 정형 의 경작지뿐만 아니라 비정형의 경작지에 대해서도 효과적으로 자율주행이 가능한 농기계 자율주행 방법 및 농 기계 자율주행을 위한 장치 기술이 요구된다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제2022-0039926호(2022.03.30. 공개)"}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위하여, 본 발명이 이루고자 하는 기술적 과제는 비정형의 경작지에 대해서 자 율 경작을 위한 경로 계획을 수립하기 위해 필요한 경작지 경계에 대한 정보를 자율 획득할 수 있는 농기계 자 율주행 방법 및 농기계 자율주행을 위한 장치를 제공하는 것이다.본 발명이 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다 른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 기술적 과제를 달성하기 위하여, 본 발명의 일실시예는 농기계가 주행하면서 토지를 촬영하여 촬영 이미지 를 생성하는 촬영 이미지 생성단계; 토지 이미지로부터 경작지 및 비경작지를 분할하도록 인공지능 학습된 분할 이미지 생성부가 상기 촬영 이미지를 기초로 경작지와 비경작지를 분할한 분할 이미지를 생성하는 분할 이미지 생성단계; 상기 분할 이미지를 기초로 2차원의 점유 격자 지도를 생성하는 점유 격자 지도 생성단계; 상기 점유 격자 지도에서 상기 경작지의 경계를 추출하는 경계 추출단계; 상기 경작지의 경계 내측에서 상기 농기계의 주 행을 위한 조향각을 생성하는 조향 정보 생성단계; 및 생성되는 상기 조향각에 기초하여 상기 농기계의 조향부 를 제어하는 조향 제어단계를 포함하는 것을 특징으로 하는 농기계 자율주행 방법을 제공한다. 본 발명의 실시예에 있어서, 상기 조향 정보 생성단계는 상기 점유 격자 지도에, 주행중인 상기 농기계의 현재 위치를 나타내는 기준점을 생성하는 기준점 생성단계와, 상기 점유 격자 지도에, 상기 농기계의 조향 방향을 생 성하기 위한 시작점, 끝점 및 평균점을 생성하는 3점 생성단계와, 상기 시작점, 상기 끝점 및 상기 평균점을 미 리 설정된 크기만큼 오프셋(Offset)하는 오프셋 단계와, 상기 평균점과 상기 끝점 사이에 경유점을 설정하는 경 유점 설정단계와, 상기 기준점에서 상기 경유점을 연결하는 연결선분과 상기 기준점을 지나는 수직선분 사이의 각도를 상기 조향각으로 생성하는 조향각 생성단계를 가질 수 있다. 본 발명의 실시예에 있어서, 상기 3점 생성단계에서는, 상기 점유 격자 지도에서, 상기 기준점을 지나는 수평선 분이 상기 경계와 교차하는 지점을 상기 시작점으로 생성하고, 상기 점유 격자 지도에서, 상기 시작점에서 상기 경계를 따라 가장 먼 지점을 상기 끝점으로 생성할 수 있다. 본 발명의 실시예에 있어서, 상기 오프셋 단계에서는, 상기 시작점을 상기 수평선분을 따라 상기 경계의 내측 방향을 판별한 후, 상기 내측 방향으로 미리 설정된 거리만큼 오프셋하고, 상기 시작점이 오프셋되는 만큼 상기 끝점 및 상기 평균점도 오프셋할 수 있다. 본 발명의 실시예에 있어서, 상기 경유점 설정단계는, 상기 시작점과 상기 평균점을 이은 선분과, 상기 기준점 에서 상기 선분에 수직한 선이 교차하는 교차점에서부터 상기 평균점을 지나 상기 끝점 방향을 따라 미리 설정 된 지향 거리의 종단점을 상기 경유점으로 설정할 수 있다. 한편, 상기 기술적 과제를 달성하기 위하여, 본 발명의 일실시예는 농기계에 구비되고, 상기 농기계가 주행하면 토지를 촬영하여 촬영 이미지를 생성하는 촬영 이미지 생성부; 토지 이미지로부터 경작지 및 비경작지를 분할하 도록 인공지능 학습되고, 상기 촬영 이미지를 기초로 경작지와 비경작지를 분할한 분할 이미지를 생성하는 분할 이미지 생성부; 상기 분할 이미지를 기초로 2차원의 점유 격자 지도를 생성하는 점유 격자 지도 생성부; 상기 점유 격자 지도에서 상기 경작지의 경계를 추출하는 경계 추출부; 상기 경작지의 경계 내측에서 상기 농기계의 주행을 위한 조향각을 생성하는 조향 정보 생성부; 및 생성되는 상기 조향각에 기초하여 상기 농기계의 조향부 를 제어하는 조향 제어부를 포함하는 것을 특징으로 하는 농기계 자율주행을 위한 장치를 제공한다. 본 발명의 실시예에 있어서, 상기 조향 정보 생성부는 상기 점유 격자 지도에, 주행중인 상기 농기계의 현재 위 치를 나타내는 기준점을 생성하고, 상기 점유 격자 지도에, 상기 농기계의 조향 방향을 생성하기 위한 시작점, 끝점 및 평균점을 생성하며, 상기 시작점, 상기 끝점 및 상기 평균점을 미리 설정된 크기만큼 오프셋(Offset)하 고, 상기 평균점과 상기 끝점 사이에 경유점을 설정하며, 상기 기준점에서 상기 경유점을 연결하는 연결선분과 상기 기준점을 지나는 수직선분 사이의 각도를 상기 조향각으로 생성할 수 있다. 본 발명의 실시예에 있어서, 상기 조향 정보 생성부는 상기 점유 격자 지도에서, 상기 기준점을 지나는 수평선 분이 상기 경계와 교차하는 지점을 상기 시작점으로 생성하고, 상기 점유 격자 지도에서, 상기 시작점에서 상기 경계를 따라 가장 먼 지점을 상기 끝점으로 생성할 수 있다. 본 발명의 실시예에 있어서, 상기 조향 정보 생성부는 상기 시작점을 상기 수평선분을 따라 상기 경계의 내측 방향을 판별한 후, 상기 내측 방향으로 미리 설정된 거리만큼 오프셋하고, 상기 시작점이 오프셋되는 만큼 상기 끝점 및 상기 평균점도 오프셋할 수 있다. 본 발명의 실시예에 있어서, 상기 조향 정보 생성부는 상기 시작점과 상기 평균점을 이은 선분과, 상기 기준점 에서 상기 선분에 수직한 선이 교차하는 교차점에서부터 상기 평균점을 지나 상기 끝점 방향을 따라 미리 설정된 지향 거리의 종단점을 상기 경유점으로 설정할 수 있다."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 경작지의 경계를 생성하기 위한 GPS 좌표를 얻기 위해 작업자가 직접 운전하는 수 고를 덜 수 있고, 농기계의 주행 시에 실시간으로 촬영되는 토지 정보를 기초로 실시간으로 조향각이 생성되어 자율주행이 가능하기 때문에, 비정형의 경작지에 대해서도 효과적이고 안정적으로 자율주행이 가능하다."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과는 상기한 효과로 한정되는 것은 아니며, 본 발명의 상세한 설명 또는 청구범위에 기재된 발명의 구성으로부터 추론 가능한 모든 효과를 포함하는 것으로 이해되어야 한다."}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 발명을 설명하기로 한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 따라서 여기에서 설명하는 실시예로 한정되는 것은 아니다. 그리고 도면에서 본 발명을 명확 하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유 사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉, 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연 결\"되어 있는 경우뿐 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 구비할 수 있다는 것을 의미한다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 명세서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들 을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요 소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 이하 첨부된 도면을 참고하여 본 발명의 실시예를 상세히 설명하기로 한다. 도 2는 본 발명의 일실시예에 따른 농기계 자율주행 방법을 나타낸 흐름도이고, 도 3은 본 발명의 일실시예에 따른 농기계 자율주행을 위한 장치를 나타낸 구성도이다. 도 2 및 도 3에서 보는 바와 같이, 농기계 자율주행 방법은 촬영 이미지 생성단계(S110), 분할 이미지 생성단계 (S120), 점유 격자 지도 생성단계(S130), 경계 추출단계(S140), 조향 정보 생성단계(S150) 및 조향 제어단계 (S160)를 포함할 수 있다. 그리고, 농기계 자율주행 방법을 구현하기 위한 농기계 자율주행을 위한 장치는 촬영 이미지 생성부, 분할 이미지 생성부, 역원근 변환부, 점유 격자 지도 생성부, 경계 추출부, 조향 정보 생성부 및 조향 제어부를 포함할 수 있다. 먼저, 촬영 이미지 생성단계(S110)는 농기계가 주행하면서 토지를 촬영하여 촬영 이미지를 생성하는 단계일 수 있다. 촬영 이미지 생성단계(S110)는 농기계에 구비되는 촬영 이미지 생성부가 농기계가 주행하면 토지를 촬영하여 촬영 이미지를 생성함으로써 수행될 수 있다. 촬영 이미지 생성부는 스테레오 카메라를 포함할 수 있으며, 추가적으로 웹 카메라, 적외선 카메라 중 하 나 이상을 포함할 수 있다. 스테레오 카메라는 RGB 정보, 깊이 정보를 생성할 수 있다. 분할 이미지 생성단계(S120)는 토지 이미지로부터 경작지 및 비경작지를 분할하도록 인공지능 학습된 분할 이미 지 생성부가 촬영 이미지를 기초로 경작지와 비경작지를 분할한 분할 이미지를 생성하는 단계일 수 있다. 분할 이미지 생성부는 딥 러닝(Deep learning)을 통한 경작지 분할 알고리즘을 포함할 수 있다. 도 4는 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 분할 이미지 생성단계를 설명하기 위한 예시도인 데, 도 4의 (a)는 촬영 이미지이고, 도 4의 (b)는 도 4의 (a)는 촬영 이미지를 기초로 분할 이미지 생성부(22 0)에서 생성하는 분할 이미지이다. 분할 이미지 생성부는 토지 이미지로부터 경작지 및 비경작지를 분할하도록 인공지능 학습될 수 있다. 분 할 이미지 생성부는 유넷(UNet), 피아이넷(PINet), 모바일넷브이쓰리(MobileNetV3) 등과 같은 이미지 분할 딥 러닝 모델을 이용하여 촬영 이미지로부터 분할 이미지를 생성할 수 있다. 분할 이미지 생성부는 농기계가 주행하면서 촬영되는 촬영 이미지(도 4의 (a) 참조)를 제공받아 분할 이미 지(도 4의 (b) 참조)를 생성할 수 있다. 분할 이미지 생성부에서 생성되는 분할 이미지(도 4의 (b) 참조) 는 도 4의 (a)에서와 같이 촬영된 토지 이미지에서의 실제 경작지 영역에 대응되는 경작지 영역과, 실 제 비경작지 영역에 대응되는 비경작지 영역 정보를 포함할 수 있다. 그리고 농기계 자율주행 방법은 분할 이미지를 원근을 가지지 않는 분할 이미지로 변화하는 역원근 변환단계 (S125)를 더 포함할 수 있으며, 역원근 변환단계(S125)는 역원근 변환부에 의해 수행될 수 있다. 도 5는 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 역원근 변환단계를 설명하기 위한 예시도인데, 도 5의 (a)는 농기계에 구비되는 촬영 이미지 생성부에서 촬영된 촬영 이미지이고, 도 5의 (b)는 도 5의 (a) 의 촬영 이미지를 역원근 변환한 것이다. 촬영 이미지 생성부가 지면보다 높은 위치에서 농기계에 설치되면, 생성되는 촬영 이미지는 도 5의 (a)에 서와 같이 상측에서 비스듬하게 하측을 촬영한 원근을 가지는 이미지가 된다. 역원근 변환단계(S125)에서는 도 5의 (a)에서와 같은 촬영 이미지를 역원근 변환(Inverse Perspective Transformation)하여 상측에서 수직하게 하측으로 촬영하고, 원근을 가지지 않는 분할 이미지가 되도록 변환할 수 있다. 역원근 변환단계(S125)에서는 촬영 이미지가 롤링(Rolling) 및 피칭(Pitching)이 없다는 가정 하에 고정된 변환 행렬을 사용하여 역원근 변환할 수 있다. 한편, 촬영 이미지 생성부가 처음부터 원근을 가지지 않는 형태로 촬영 이미지를 생성할 수 있으면, 생성 되는 분할 이미지도 원근을 가지지 않는 형태, 즉, 역원근 변환단계(S125)를 통해 생성되는 분할 이미지와 같은 형태를 얻을 수 있기 때문에, 이 경우에는 역원근 변환단계(S125)는 생략될 수도 있다. 점유 격자 지도 생성단계(S130)는 원근을 가지지 않는 형태의 분할 이미지를 기초로 2차원의 점유 격자 지도 (Occupancy Grid Map)를 생성하는 단계일 수 있으며, 점유 격자 지도 생성단계(S130)는 점유 격자 지도 생성부 에 의해 수행될 수 있다. 점유 격자 지도 생성단계(S130)에서, 점유 격자 지도는 GPS, IMU(관성 측정 장치) 중 하나 이상을 포함하는 정 보 측정부에서 측정되는 정보를 통하여 생성될 수 있다. 도 6은 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 점유 격자 지도 생성단계를 설명하기 위한 예시도 이다. 도 6에서 보는 바와 같이, 분할 이미지는 경작지에 대응되는 영역과, 비경작지에 대응되는 영역를 가 질 수 있다. 여기서, 경작지에 대응되는 영역 및 비경작지에 대응되는 영역은 촬영 이미지 생성부에 포함되는 촬영부의 촬영범위 내에서의 영역일 수 있다. 예를 들어, 촬영부가 도 4의 (a)에서와 같은 촬영범위에서 토지를 촬영하여 촬영 이미지를 생성했다면, 도 4의 (b)에서와 같이 생성되는 분할 이미지에서 흰 색 영역은 경작지에 대응되는 영역으로 되고, 검은색 영역은 비경작지에 대응되는 영역으로 될 수 있다. 점유 격자 지도 생성단계(S130)에서는 촬영범위에서 경작지 영역을 농기계의 현재 위치를 기준으로 점유 격자 지도로 생성할 수 있다. 그리고, 각 격자는 점유 상태(장애물에 의한 막힘의 유무)를 확률로 나타낼 수 있다. 예를 들면, 격자로 나뉘는 셀은 완전히 빈 공간이거나, 막힌 공간일 수 있다. 즉, 각각의 셀은 이진 확률 변수를 가질 수 있다. 빈 공간은 경작지에 대응되는 영역일 수 있고, 막힌 공간은 비경작지에 대응되는 영역일 수 있다. 그 리고, 촬영범위를 벗어난 부분은 알려지지 않은 영역이며, 이를 통해, 점유 격자 지도는 도 6의 (b)에서와 같이 생성될 수 있다. 도 7은 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 조향 정보 생성단계를 나타낸 흐름도이고, 도 8은 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 경계 추출단계 및 조향 정보 생성단계를 설명하기 위한 예시도이다. 도 2 및 도 3과 함께, 도 7 및 도 8을 참조하면, 경계 추출단계(S140)는 점유 격자 지도에서 경작지의 경계를 추출하는 단계일 수 있으며, 경계 추출단계(S140)는 경계 추출부에 의해 수행될 수 있다. 도 8의 (a)를 참조하면, 점유 격자 지도에는 경작지 및 비경작지를 분할하는 경계가 추출 될 수 있다. 도 8의 (a)의 점유 격자 지도는 농기계에 구비되는 촬영부가 촬영한 촬영범위에 대응되어 생 성된 것일 수 있다. 조향 정보 생성단계(S150)는 경작지의 경계 내측에서 농기계의 주행을 위한 조향각을 생성하는 단계 일 수 있으며, 조향 정보 생성단계(S150)는 조향 정보 생성부에 의해 수행될 수 있다. 조향 정보 생성단계(S150)는 기준점 생성단계(S151), 3점 생성단계(S152), 오프셋(Offset) 단계(S153), 경유점 설정단계(S154) 및 조향각 생성단계(S155)를 가질 수 있다. 기준점 생성단계(S151)는 점유 격자 지도에, 주행중인 농기계의 현재 위치를 나타내는 기준점을 생성하는 단계일 수 있다. 점유 격자 지도는 농기계에 구비되는 촬영부의 촬영범위에 대응되어 생성되고, 기준점은 농기계의 현재 위치를 나타내는 것이므로, 기준점은 점유 격자 지도의 하단 중앙에 위치될 수 있다. 기준점 생성단계(S151)에서는 기준점을 경유하는 수직선분을 더 생성할 수 있다. 수직선분은 촬 영 순간 농기계의 주행 방향(Heading) 일 수 있다(도 8의 (a) 및 (b) 참조). 3점 생성단계(S152)는 점유 격자 지도에, 농기계의 조향 방향을 생성하기 위한 시작점, 끝점 및 평균 점을 생성하는 단계일 수 있다. 시작점 및 끝점은 점유 격자 지도의 경계의 양단점일 수 있다. 구체적으로, 시작점은 점유 격자 지도에서 기준점을 지나는 수평선분과 경계가 교차하는 지점일 수 있다. 그리고, 끝점 은 점유 격자 지도에서 시작점에서 경계를 따라 가장 먼 지점일 수 있다. 또한 평균점은 시작점과 끝점의 중점일 수 있다(도 8의 (c) 참조). 오프셋 단계(S153)는 시작점, 끝점 및 평균점을 미리 설정된 크기만큼 오프셋하는 단계일 수 있 다. 오프셋 단계(S153)에서는, 시작점을 수평선분을 따라 경계의 내측 방향을 판별한 후, 내측 방향 으로 미리 설정된 거리만큼 오프셋, 즉, 이동하고, 시작점이 오프셋되는 만큼 끝점 및 평균점도 오프셋할 수 있다. 오프셋 크기, 즉, 이동 거리는 농기계의 폭을 기준으로 적절하게 설정될 수 있다. 경유점 설정단계(S154)는 평균점과 끝점 사이에 경유점을 설정하는 단계일 수 있다. 경유점 설 정단계(S154)는, 시작점에서부터 평균점을 지나 끝점 방향을 따르는 지향 거리를설정하고, 지향 거리의 종단점을 경유점으로 설정할 수 있다. 구체적으로, 경유점 설정단계(S154)는, 시작점과 평균점을 이은 선분과, 기준점에서 선분에 수 직한 선이 교차하는 교차점에서부터 평균점을 지나 끝점 방향을 따라 미리 설정된 지향 거 리의 종단점을 경유점으로 설정할 수 있다. 지향 거리는 농기계의 주행 속도와, 촬영 이미지를 생성하여 분할 이미지를 생성하고, 점유 격자 지도를 생성하며, 경계를 추출하는 알고리즘의 동작 주기에 따라 적절하게 설정될 수 있다. 본 발명에서는, 이러한 전 체 알고리즘은 0.08초의 주기로 동작하고, 농기계의 주행 속도는 1.5m/s 로 일정하였는데, 이를 기초로, 지향 거리는 5m로 설정되었다. 조향각 생성단계(S155)는 기준점에서 경유점을 연결하는 연결선분과 기준점을 지나는 수직 선분 사이의 각도(θ)를 조향각으로 생성하는 단계일 수 있다. 지향 거리가 짧게 설정될수록 조향각은 작게 생성될 수 있기 때문에, 농기계의 미세한 조향이 가능할 수 있지만, 이 경우 데이터 처리량이 많아지고, 데이터의 높은 처리 속도를 요할 수 있다. 반면, 지향 거리 가 길게 설정될수록 조향각은 크게 생성될 수 있기 때문에, 상대적으로 농기계의 미세한 조향은 어려 울 수 있지만, 이 경우 데이터 처리량이 적어지고, 데이터의 높은 처리 속도를 요하지 않을 수 있다. 조향 제어단계(S160)는 생성되는 조향각에 기초하여 농기계의 조향부를 제어하는 단계일 수 있다. 이를 통해, 농기계는 일정한 수행 속도로 경작지의 경계를 따라 자율 주행이 가능할 수 있다. 도 9는 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 추출된 경계와 실제 경계를 비교하기 위한 것이고, 도 10은 본 발명의 일실시예에 따른 농기계 자율주행 방법과 종래의 농기계 자율주행 방법의 차이를 설 명하기 위한 예시도이다. 먼저, 도 9의 (a)에서 보는 바와 같이, 경작지의 경계에서 일정 거리 이격되어 기준점이 형 성되도록 하면서, 트랙터를 시계방향으로 주행시켰다. 이때, GPS와 IMU는 트랙터의 무게 중심에 위치되었고, 카 메라는 트랙터의 전방 중앙에 설치되었다. 카메라와 IMU 와의 거리는 1.5m였고, 카메라는 지면으로부터 1m 높이 에 30도 기울여서 설치되었다. 트랙터가 시계방향으로 주행하면서, 전술한 농기계 자율주행 방법을 수행하였으며, 전체 알고리즘은 0.08초의 주기로 동작하였고, 트랙터의 속도는 1.5m/s 로 일정하였다. 그 결과, 시계 방향으로 트랙터가 주행하면서 얻어진 점유 격자 지도(도 9의 (b))로부터 얻어진 경작지 영역 은, 실제 경작지의 경계를 따라 걷으면서 얻은 GPS 좌표에 따른 경작지 영역은 흰 색으로 표시되는 영 역 만큼만 오차를 가질 뿐, 거의 비슷하였다. 이는 반시계 방향으로 트랙터가 주행하면서 얻어진 점유 격 자 지도(미도시)와 GPS 좌표에 따른 경작지 영역을 비교하였을 때에도 마찬가지였다. 이와 같이, 도 10의 (a)에서 보는 바와 같이, 종래의 농기계 자율주행 방법에서는 농기계가 직진 자율주행만 수 행이 가능하기 때문에, 경작지가 비정형인 경우에 경작지 내에 4개의 모서리(11,12,13,14)로 이루어지는 획득 경계가 실제 경작지의 경계와 차이가 많이 발생하는 문제점이 있다. 따라서, 농기계가 자율주행하더라 도 농기계는 획득된 경계 내에서만 자율주행하기 때문에, 실제 경작지의 경계와 획득된 경계 사이 의 영역에서는 농기계가 자율 주행을 하지 않아 작업이 이루어지지 못하는 문제점이 있다. 반면, 본 발명에 따른 농기계 자율주행 방법에 따르면, 비정형의 경작지의 경계를 따라 농기계가 자율 주행 이 가능하므로, 비정형의 경작지의 실제 경계에 대응되는 경계가 획득될 수 있다. 그리고, 이렇게 획 득되는 경계 내에서 농기계가 자율주행하게 되므로 실제 비정형의 경작지 전체에서 작업이 이루어질 수 있다. 이처럼, 본 발명에 따르면, 경작지의 경계를 생성하기 위한 GPS 좌표를 얻기 위해 작업자가 직접 운전하는 수고 를 덜 수 있고, 농기계의 주행 시에 실시간으로 촬영되는 토지 정보를 기초로 실시간으로 조향각이 생성되어 자 율주행이 가능하기 때문에, 경작지의 형태에 무관하게 자율주행으로 경작지 경계의 GPS 좌표를 수집하고, 이를 기초 정보로 활용하여 자율 경작 경로 계획을 수립하여 효과적이고 안정적으로 자율주행이 가능하다. 한편, 이 방법은 명확성을 위해 일련의 번호가 붙여진 단계로 묘사되어 있지만 번호 순서가 각 단계의 순서를 지정하는 것은 아니다. 이들 단계 중 일부는 스킵되거나, 병렬로 수행되거나, 엄격히 전후 순서를 유지할 필요"}
{"patent_id": "10-2023-0030221", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "없이 수행될 수 있다. 그러나, 일반적으로 이 방법은 표시된 단계의 번호 순서에 따라 진행된다.전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 후술하는 청구범위에 의하여 나타내어지며, 청구범위의 의미 및 범위 그리고 그 균등 개념으 로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0030221", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 농기계에 적용되고 있는 종래의 자율주행 방법을 설명하기 위한 예시도이다. 도 2는 본 발명의 일실시예에 따른 농기계 자율주행 방법을 나타낸 흐름도이다. 도 3은 본 발명의 일실시예에 따른 농기계 자율주행을 위한 장치를 나타낸 구성도이다. 도 4는 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 분할 이미지 생성단계를 설명하기 위한 예시도이 다. 도 5는 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 역원근 변환단계를 설명하기 위한 예시도이다. 도 6은 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 점유 격자 지도 생성단계를 설명하기 위한 예시도 이다. 도 7은 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 조향 정보 생성단계를 나타낸 흐름도이다. 도 8은 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 경계 추출단계 및 조향 정보 생성단계를 설명하기 위한 예시도이다. 도 9는 본 발명의 일실시예에 따른 농기계 자율주행 방법에서 추출된 경계와 실제 경계를 비교하기 위한 것이다. 도 10은 본 발명의 일실시예에 따른 농기계 자율주행 방법과 종래의 농기계 자율주행 방법의 차이를 설명하기 위한 예시도이다."}
