{"patent_id": "10-2019-0115472", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0033769", "출원번호": "10-2019-0115472", "발명의 명칭": "전자 장치 및 전자 장치의 동작 방법", "출원인": "삼성전자주식회사", "발명자": "조현제"}}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치가 기상 예보 정보(weather forecast information)를 획득하는 단계;상기 전자 장치가 상기 기상 예보 정보를 제1 공기조화기(air conditioner)가 소비할 전력량을 예측(predict)하는 인공지능 모델(artificial intelligence model)에 입력하는 단계; 및상기 전자 장치가 상기 인공지능 모델로부터 출력된 제1 공기조화기의 예측 전력 소비량을 디스플레이하는단계;를 포함하고,상기 인공지능 모델은,기상 이력 및 상기 기상 이력과 연관된 복수의 공기조화기들의 동작에 기초하여, 기상 상태와 공기조화기의 소비 전력량 간의 연관 정보(correlation information)를 획득하고, 상기 연관 정보와 상기 기상 예보 정보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 것인, 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 인공지능 모델은,기상 이력 정보(weather history information), 상기 복수의 공기조화기들의 각각이 소비한 전력량, 상기 복수의 공기조화기들의 각각의 동작 이력 정보(operation history information), 상기 복수의 공기조화기들의 각각의 상태 정보(status information) 및 상기 복수의 공기조화기들의 각각의 종류 정보(type information)를 학습함으로써, 상기 연관 정보를 획득하도록 학습된, 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,상기 인공지능 모델은, 제1 기간의 기상 이력 정보 및 상기 제1 기간의 상기 복수의 공기조화기들의 각각의 동작 이력 정보를 학습함으로써, 기상 상태에 따른 복수의 공기조화기들의 동작 패턴(operation pattern)을 획득하고,상기 인공지능 모델이 상기 획득된 동작 패턴에 기초하여 제1 연관 정보를 획득하도록 학습된,전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 인공지능 모델은, 제1 기간 이후인 제2 기간의 기상 이력, 상기 제2 기간의 기상 이력과 연관된 복수의 공기조화기들의 동작 및상기 제1 연관 정보에 기초하여, 제2 연관 정보를 획득하고,공개특허 10-2021-0033769-3-상기 제2 연관 정보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된, 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서,상기 인공지능 모델은,제3 기간의 기상 예보 정보와 상기 연관 정보에 기초하여, 상기 제1 공기조화기가 상기 제3 기간에 소비할 제1전력량을 예측하여 출력하고, 상기 제3 기간의 이후인 제4 기간의 기상 예보 정보, 상기 예측된 제1 전력량 및 상기 연관 정보에 기초하여,상기 제1 공기조화기가 상기 제4 기간에 소비할 제2 전력량을 예측하여 출력하도록 학습된, 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 동작 방법은,상기 전자 장치가 사용자로부터 입력된 임계값과 상기 예측 전력 소비량을 비교함으로써, 상기 예측 전력 소비량이 임계값 이상이 되는 시점을 출력하는 단계를 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 인공지능 모델은,상기 기상 이력 및 상기 기상 이력과 연관된 제1 공기조화기의 동작에 기초하여, 제1 공기조화기의 동작 패턴에관한 제1 특징 정보를 획득하고,상기 제1 특징 정보에 기초하여 상기 제1 공기조화기가 수행할 절전 동작에 관한 제1 제어 신호를 생성하고,상기 제1 제어 신호를 출력하도록 학습되고,상기 동작 방법은, 상기 전자 장치가 상기 제1 제어 신호를 상기 제1 공기조화기로 전송하는 단계를 더 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,상기 동작 방법은,상기 전자 장치가 사용자의 개인 정보(personal information)를 획득하는 단계;상기 전자 장치가 상기 사용자의 개인 정보를 상기 인공지능 모델에 입력하는 단계; 및상기 전자 장치가 상기 인공지능 모델로부터 출력된 상기 제1 공기조화기가 수행할 절전 동작 절차에 관한 제1공개특허 10-2021-0033769-4-제어 신호를 상기 제1 공기조화기로 전송하는 단계를 더 포함하고,상기 인공지능 모델은,상기 개인 정보에 기초하여 상기 제1 제어 신호를 생성하도록 학습된, 전자 장치의 동작 방법"}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1 항에 있어서,상기 인공지능 모델은,상기 복수의 공기조화기들의 각각의 동작 이력 정보로부터 상기 복수의 공기조화기들의 각각의 동작 패턴에 관한 특징 정보를 획득하고,상기 획득된 특징 정보에 기초하여 상기 제1 공기조화기와 동작 패턴이 유사한 공기조화기와 상기 제1 공기조화기를 클러스터링(clustering)함으로써, 상기 제1 공기조화기가 포함된 제1 클래스를 생성하고,상기 기상 이력 및 상기 제1 클래스에 포함된 공기조화기들의 특징 정보에 기초하여, 상기 기상 상태와 상기 제1 클래스에 포함된 공기조화기의 소비 전력량 간의 제1 연관 정보를 획득하고, 상기 제1 연관 정보와 상기 기상 예보 정보에 기초하여 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된,전자 장치의 동작 방법."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "컴퓨터로 읽을 수 있는 저장 매체에 있어서, 상기 저장 매체는, 전자 장치가 기상 예보 정보(weather forecast information)를 획득하는 단계;상기 전자 장치가 상기 기상 예보 정보를 제1 공기조화기(air conditioner)가 소비할 전력량을 예측(predict)하는 인공지능 모델(artificial intelligence model)에 입력하는 단계; 및상기 전자 장치가 상기 인공지능 모델로부터 출력된 제1 공기조화기의 예측 전력 소비량을 디스플레이하는단계;를 포함하고,상기 인공지능 모델은,기상 이력 및 상기 기상 이력과 연관된 복수의 공기조화기들의 동작에 기초하여, 기상 상태와 공기조화기의 소비 전력량 간의 연관 정보(correlation information)를 획득하고, 상기 연관 정보와 상기 기상 예보 정보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 것인, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치에 있어서,적어도 하나의 인스트럭션(instruction)을 저장하는 메모리;디스플레이부; 및상기 메모리에 저장된 적어도 하나의 인스트럭션을 실행함으로써, 기상 예보 정보(weather forecastinformation)를 획득하고, 상기 기상 예보 정보를 제1 공기조화기(air conditioner)가 소비할 전력량을 예측(predict)하는 적어도 하나의 인공지능 모델(artificial intelligence model)에 입력하고, 상기 적어도 하나의 인공지능 모델에서 출력된 제1 공기조화기의 예측 전력 소비량을 디스플레이하도록 상기 디스플레이부를 제공개특허 10-2021-0033769-5-어하는 프로세서를 포함하고,상기 적어도 하나의 인공지능 모델은,기상 이력 및 상기 기상 이력과 연관된 복수의 공기조화기들의 동작에 기초하여, 기상 상태와 공기조화기의 소비 전력량 간의 연관 정보(correlation information)를 획득하고, 상기 연관 정보와 상기 기상 예보 정보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 것인, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11 항에 있어서,상기 적어도 하나의 인공지능 모델은,기상 이력 정보(weather history information), 복수의 공기조화기들의 각각이 소비한 전력량, 상기 복수의 공기조화기들의 각각의 동작 이력 정보(operation history information), 상기 복수의 공기조화기들의 각각의 상태 정보(status information) 및 상기 복수의 공기조화기들의 각각의 종류 정보(type information)를 학습함으로써, 상기 연관 정보를 획득하도록 학습된, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 적어도 하나의 인공지능 모델은,제1 기간의 기상 이력 정보 및 상기 제1 기간의 상기 복수의 공기조화기들의 각각의 동작 이력 정보를 학습함으로써, 기상 상태에 따른 복수의 공기조화기들의 동작 패턴(operation pattern)을 획득하고, 상기 획득된 동작패턴에 기초하여 제1 연관 정보를 획득하도록 학습된 패턴 분석 모델(pattern analysis model)을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13 항에 있어서,상기 패턴 분석 모델은, 제1 기간 이후인 제2 기간의 기상 이력, 상기 제2 기간의 기상 이력과 연관된 복수의 공기조화기들의 동작 및상기 제1 연관 정보에 기초하여, 제2 연관 정보를 획득하도록 학습되고,상기 적어도 하나의 인공지능 모델은,상기 제2 연관 정보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 예측 모델(predicting model)을 더 포함하는, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11 항에 있어서,상기 적어도 하나의 인공지능 모델은,제3 기간의 기상 예보 정보와 상기 연관 정보에 기초하여 상기 제1 공기조화기가 상기 제3 기간에 소비할 제1공개특허 10-2021-0033769-6-전력량을 예측하여 출력하고, 상기 제3 기간의 이후인 제4 기간의 기상 예보 정보, 상기 예측된 제1 전력량 및상기 연관 정보에 기초하여 상기 제1 공기조화기가 상기 제4 기간에 소비할 제2 전력량을 예측하여 출력하도록학습된 예측 모델(predicting model)을 포함하는, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11 항에 있어서,상기 프로세서는, 사용자로부터 입력된 임계값과 상기 예측 전력 소비량을 비교함으로써, 상기 예측 전력 소비량이 임계값 이상이되는 시점을 출력하도록 상기 디스플레이부를 제어하는, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11 항에 있어서,상기 전자 장치는 상기 제1 공기조화기와 데이터를 송수신하는 통신부를 더 포함하고, 상기 프로세서는, 사용자의 개인 정보(personal information)를 획득하고, 상기 사용자의 개인 정보를 상기 적어도 하나의 인공지능 모델에 입력하고,상기 적어도 하나의 인공지능 모델로부터 출력된 상기 제1 공기조화기가 수행할 절전 동작 절차에 관한 제1 제어 신호를 상기 제1 공기조화기로 전송하도록 상기 통신부를 제어하고,상기 적어도 하나의 인공지능 모델은,상기 개인 정보에 기초하여 상기 제1 제어 신호를 생성하도록 학습된 제어 모델을 더 포함하는, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제11 항에 있어서,상기 전자 장치는 상기 제1 공기조화기와 데이터를 송수신하는 통신부를 더 포함하고,상기 적어도 하나의 인공지능 모델은,상기 기상 이력 및 상기 기상 이력과 연관된 제1 공기조화기의 동작에 기초하여, 제1 공기조화기의 동작 패턴에관한 제1 특징 정보를 획득하고,상기 제1 특징 정보에 기초하여 상기 제1 공기조화기가 수행할 절전 동작에 관한 제1 제어 신호를 생성하여 출력하도록 학습되고,상기 프로세서는,상기 제1 제어 신호를 상기 제1 공기조화기로 전송하도록 상기 통신부를 제어하는, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2021-0033769-7-제11 항에 있어서,상기 적어도 하나의 인공지능 모델은,상기 복수의 공기조화기들의 각각의 동작 이력 정보로부터 상기 복수의 공기조화기들의 각각의 동작 패턴에 관한 특징 정보를 획득하고, 상기 획득된 특징 정보에 기초하여 상기 제1 공기조화기와 동작 패턴이 유사한 공기조화기를 클러스터링(clustering)함으로써, 상기 제1 공기조화기가 포함된 제1 클래스를 생성하고, 기상 이력및 상기 제1 클래스에 포함된 공기조화기들의 특징 정보에 기초하여 기상 상태와 상기 제1 클래스에 포함된 공기조화기의 소비 전력량 간의 제1 연관 정보를 획득하도록 학습된 패턴 학습 모델 및상기 제1 연관 정보와 상기 기상 예보 정보에 기초하여 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 예측 모델을 포함하는,전자 장치."}
{"patent_id": "10-2019-0115472", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11 항에 있어서,상기 전자 장치는 서버와 데이터를 송수신하는 통신부를 더 포함하고,상기 프로세서는,상기 제1 공기조화기의 동작 이력 정보를 획득하고, 상기 동작 이력 정보를 제1 인공지능 모델에 입력하고,상기 제1 인공지능 모델로부터 출력된 상기 제1 공기조화기의 동작 패턴에 관한 제1 특징 정보를 서버로 전송하고, 상기 서버가 제2 인공지능 모델을 이용하여 획득한 상기 제1 공기조화기의 예측 전력 소비량에 관한 정보를상기 서버로부터 수신하도록 상기 통신부를 제어하고,상기 제1 인공지능 모델은,상기 제1 공기조화기의 동작 이력 정보에 기초하여 상기 제1 특징 정보를 획득하여 출력하도록 학습되고,상기 제2 인공지능 모델은,상기 제1 특징 정보 및 상기 기상 예보 정보에 기초하여, 상기 제1 공지조화기의 예측 전력 소비량에 관한 정보를 획득하여 출력하도록 학습된, 전자 장치."}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "전자 장치의 동작 방법의 일 실시예는, 전자 장치가 기상 예보 정보(weather forecast information)를 획득하는 단계, 상기 전자 장치가 상기 기상 예보 정보를 제1 공기조화기(air conditioner)가 소비할 전력량을 예측 (predict)하는 인공지능 모델(artificial intelligence model)에 입력하는 단계 및 상기 전자 장치가 상기 인 공지능 모델로부터 출력된 제1 공기조화기의 예측 전력 소비량을 디스플레이하는 단계를 포함하고, 상기 인공지 능 모델은, 기상 이력 및 상기 기상 이력과 연관된 복수의 공기조화기들의 동작에 기초하여, 기상 상태와 공기조 화기의 소비 전력량 간의 연관 정보(correlation information)를 획득하고, 상기 연관 정보와 상기 기상 예보 정 보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 것 일 수 있다."}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 전자 장치 및 전자 장치의 동작 방법에 관한 것이다."}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "세계적으로 부각되고 있는 에너지 사용의 문제에 대하여 세계의 각국에서는 다양한 에너지 절약 정책을 펼치고 있다. 전기 에너지 소비를 감축하기 위해서, 세계적으로 다양한 에너지 절감 기술이 개발되고, 에너지 효율이 높은 각종 기기들이 개발 및 보급되고 있다. 에너지 소비의 절약을 위해서 소비될 전력량을 예측하는 기술이 중요해지고 있다. 소비될 전력량을 예측함으로 써, 안정적인 전력 공급을 도모할 수 있으며, 불필요하게 소모될 전력을 절약할 수 있다. 기저 전력은 생활을 영위하는데 필요한 기본적으로 소비되는 전력을 의미하고, 변동 전력은 상황에 따라서 소비 될 수 있는 전력을 의미한다. 소비될 전력량을 정확하게 예측하기 위해서는 기저 전력보다는 변동 전력을 정확히 예측하는 기술이 필요하다. 예를 들면, 날씨에 따라서 소비되는 전력량의 변동이 큰 냉난방 공기조화기가 소비할 전력량을 정확히 예측하는 기술이 필요하다. 또한, 예측된 변동 전력을 절감하는 기술이 필요하다. 예를 들면, 냉난방 공기조화기의 동작 패턴, 사용자 정 보 등에 기초하여 냉난방 공기조화기가 절전 동작하도록 제어하는 기술이 필요하다."}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전자 장치 및 전자 장치의 동작 방법에 관한 것이다. 개시된 일 실시예는 냉난방 공기조화기가 소비할 전력량을 예측하는 방법을 제공하고자 한다. 또한, 개시된 다른 실시예는 냉난방 공기조화기가 절전 동작하도록 제어하는 방법을 제공하고자 한다. 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 외부 조건에 따 라서 소비하는 전력량이 변동되는 장비(equipment)에도 유추적용 될 수 있다. 또한, 이하의 실시예들로부터 또 다른 기술적 과제들이 유추될 수 있다."}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서 개시된 전자 장치의 동작 방법은, 전자 장치가 기상 예 보 정보(weather forecast information)를 획득하는 단계, 상기 전자 장치가 상기 기상 예보 정보를 제1 공기조 화기(air conditioner)가 소비할 전력량을 예측(predict)하는 인공지능 모델(artificial intelligence mode l)에 입력하는 단계 및 상기 전자 장치가 상기 인공지능 모델로부터 출력된 제1 공기조화기의 예측 전력 소비량 을 디스플레이하는 단계를 포함하고, 상기 인공지능 모델은, 기상 이력 및 상기 기상 이력과 연관된 복수의 공 기조화기들의 동작에 기초하여, 기상 상태와 공기조화기의 소비 전력량 간의 연관 정보(correlation information)를 획득하고, 상기 연관 정보와 상기 기상 예보 정보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 것일 수 있다. 한편, 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서 개시된 전자 장치는, 적어도 하나의 인스트럭션 (instruction)을 저장하는 메모리, 디스플레이부 및 상기 메모리에 저장된 적어도 하나의 인스트럭션을 실행함 으로써, 기상 예보 정보(weather forecast information)를 획득하고, 상기 기상 예보 정보를 제1 공기조화기 (air conditioner)가 소비할 전력량을 예측(predict)하는 적어도 하나의 인공지능 모델(artificial intelligence model)에 입력하고, 상기 적어도 하나의 인공지능 모델에서 출력된 제1 공기조화기의 예측 전력 소비량을 디스플레이하도록 상기 디스플레이부를 제어하는 프로세서를 포함하고, 상기 적어도 하나의 인공지능 모델은, 기상 이력 및 상기 기상 이력과 연관된 복수의 공기조화기들의 동작에 기초하여, 기상 상태와 공기조화 기의 소비 전력량 간의 연관 정보(correlation information)를 획득하고, 상기 연관 정보와 상기 기상 예보 정 보에 기초하여, 상기 제1 공기조화기가 소비할 전력량을 예측하도록 학습된 것 일 수 있다. 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 컴퓨터로 읽을 수 있는 기록매체는 개시된 방법의 실 시예들 중에서 적어도 하나를 컴퓨터에서 실행시키기 위한 프로그램을 기록한 것일 수 있다. 상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 기록매체에 저장된 어플리케이션은 개시된 방법의 실 시예들 중에서 적어도 하나의 기능을 실행시키기 위한 것일 수 있다."}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서는 본 발명의 권리범위를 명확히 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 실시할 수 있도록, 본 발명의 원리를 설명하고, 실시예들을 개시한다. 개시된 실시예들은 다양한 형태 로 구현될 수 있다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성요소를 지칭한다. 본 명세서가 실시예들의 모든 요소들을 설명"}
{"patent_id": "10-2019-0115472", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "하는 것은 아니며, 본 발명이 속하는 기술분야에서 일반적인 내용 또는 실시예들 간에 중복되는 내용은 생략한 다. 명세서에서 사용되는 '부'(part, portion)라는 용어는 소프트웨어 또는 하드웨어로 구현될 수 있으며, 실시 예들에 따라 복수의 '부'가 하나의 요소(unit, element)로 구현되거나, 하나의 '부'가 복수의 요소들을 포함하 는 것도 가능하다. 이하 첨부된 도면들을 참고하여 본 발명의 작용 원리 및 실시예들에 대해 설명한다. 본 개시의 일부 실시예는 기능적인 블록 구성들 및 다양한 처리 단계들로 나타내어질 수 있다. 이러한 기능 블 록들의 일부 또는 전부는, 특정 기능들을 실행하는 다양한 개수의 하드웨어 및/또는 소프트웨어 구성들로 구현 될 수 있다. 예를 들어, 본 개시의 기능 블록들은 하나 이상의 마이크로프로세서들에 의해 구현되거나, 소정의 기능을 위한 회로 구성들에 의해 구현될 수 있다. 또한, 예를 들어, 본 개시의 기능 블록들은 다양한 프로그래 밍 또는 스크립팅 언어로 구현될 수 있다. 기능 블록들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 또한, 본 개시는 전자적인 환경 설정, 신호 처리, 및/또는 데이터 처리 등을 위하여 종래 기술 을 채용할 수 있다. “매커니즘”, “요소”, “수단” 및 “구성”등과 같은 용어는 넓게 사용될 수 있으며, 기계적이고 물리적인 구성들로서 한정되는 것은 아니다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 또한, 도면에 도시된 구성 요소들 간의 연결 선 또는 연결 부재들은 기능적인 연결 및/또는 물리적 또는 회로적 연결들을 예시적으로 나타낸 것일 뿐이다. 실제 장치에서는 대체 가능하거나 추가된 다양한 기능적인 연결, 물 리적인 연결, 또는 회로 연결들에 의해 구성 요소들 간의 연결이 나타내어질 수 있다. 또한, 본 명세서에서 사용되는 “제1” 또는 “제2” 등과 같이 서수를 포함하는 용어는 다양한 구성 요소들을 설명하는데 사용할 수 있지만, 상기 구성 요소들은 상기 용어들에 의해 한정되어서는 안 된다. 상기 용어들은 하나의 구성 요소를 다른 구성 요소로부터 구별하는 목적으로 사용될 수 있다. 예를 들면, 본 명세서에서는 제1 공기조화기를 기재하였으나, 이는 다른 공기조화기들과 구분하기 위해서 사용 한 것일 뿐이므로, 이에 의해서 한정되어서는 안된다. 또한, 본 명세서에서는 제1 제어 신호 및 제2 제어 신호 를 기재하였으나, 이는 각각 다른 제어 신호임을 구분하기 위해서 사용한 것일 뿐이므로, 이에 의해서 한정되어 서는 안된다. 그리고, 본 명세서에서는 제1 시간, 제2 시간, 제3 시간 및 제4 시간을 기재하였으나, 이는 서로 다른 시간임을 구분하기 위해서 사용한 것일 뿐이므로, 이에 의해서 한정되어서는 안된다. 또한, 본 명세서에 서는 제1 인공지능 모델 및 제2 인공지능 모델을 기재하였으나, 이는 서로 다른 인공지능 모델임을 구분하기 위 해서 사용한 것일 뿐이므로, 이에 의해서 한정되어서는 안된다. 이하에서는 도면을 참조하여 실시 예들을 상세히 설명한다. 도 1은 공기조화기가 소비할 전력량을 예측하는 방법의 예시를 설명하는 도면이다. 도 1을 참조하면, 전자 장치는 기상 예보 정보(weather forecast information)를 획득할 수 있다. 전자 장치는 획득된 기상 예보 정보에 기초하여 공기조화기가 소비할 전력량을 예측하여 출력할 수 있다. 일 실시예에 따르면, 전자 장치는 인공지능 모델을 포함하는 모바일 장치(예를 들면, 스마트폰, 태블릿PC 등), 범용 컴퓨터(PC, Personal Computer), 서버(Server)와 같은 연산 장치를 포함할 수 있다. 또한, 전자 장치는 인공지능 모델을 포함하는 서버와 네트워크를 통해서 데이터를 송수신 할 수 있는 모바일 장치(예를 들면, 스마트폰, 태블릿PC 등), 범용 컴퓨터(PC, Personal Computer)와 같은 연산 장치를 포 함할 수 있다. 또한, 전자 장치는 사물 인터넷(ioT, internet of Things) 장치, 다양한 사물 인터넷 장치 및 서버와 연결되는 홈 허브 장치(예를 들면, 라우터, 대화형 인공지능 스피커 등)를 포함할 수 있다. 또한, 공기조화기가 전자 장치에 해당될 수 있다. 공기조화기에 포함된 적어도 하나의 하드웨어 모듈 및 소프트웨어 모듈 중에서 적어도 하나가 이하에서 개시된 실시예의 전자 장치로 동작할 수 있다. 서버는 전자 장치 및 공기조화기와 데이터를 송수신할 수 있다. 서버는 수신된 데이터를 데이 터 베이스에 저장할 수 있다. 또한, 서버는 수신된 데이터에 대해서 다양한 연산을 수행할 수 있다. 공기조화기는 공조 공간인 실내의 냉방 또는 난방을 수행하기 위한 목적으로 사용되는 장치이다. 공기조화 기는 실내기 및 실외기 상호간에 냉매를 순환시켜 액상의 냉매가 증발할 때 주위의 열을 흡수하고 기상의 냉매가 응축할 때 주위에 열을 방출하는 특성을 이용하여 냉방 또는 난방을 수행한다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost)값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 일 실시예에 따르면, 인공지능 모델은 서버에 포함될 수 있다. 전자 장치는 기상 예보 정보를 서버(2 0)로 전송할 수 있다. 서버는 전자 장치로부터 수신된 데이터를 인공지능 모델에 적용하고, 인공지능 모델로부터 출력된 데이터를 전자 장치로 전송할 수 있다. 일 실시예에 따르면, 인공지능 모델은 전자 장치에 포함될 수 있다. 전자 장치는 내부 메모리에 인공 지능 모델을 구성하는 데이터를 저장하고 이용할 수 있다. 예를 들면, 전자 장치는 서버로부터 인공지 능 모델을 구성하는 데이터를 수신함으로써, 인공지능 모델을 내부 메모리에 저장하고 이용할 수 있다. 또한, 전자 장치는 서버로부터 인공지능 모델을 갱신하는 데이터를 수신할 수 있다. 개시된 인공지능 모델은 학습 데이터로서 입력된 복수의 텍스트 데이터 및 이미지 데이터를 소정의 기준에 의해 학습함으로써 생성된 것일 수 있다. 인공지능 모델은 전자 장치로부터 입력된 데이터에 대응하여, 학습된 기능을 수행함으로써 결과 데이터를 생성하고, 결과 데이터를 출력할 수 있다. 예를 들면, 인공지능 모델은 기 상 예보 정보에 대응하여, 공기조화기가 소비할 전력량을 예측한 결과 데이터를 생성하고, 전자 장치로 출력할 수 있다. 개시된 인공지능 모델은 적어도 하나의 기능을 수행하도록 학습된(trained) 복수개의 인공지능 모델을 포함할 수 있다. 예를 들면, 인공지능 모델은 기상 이력 정보(weather history information), 복수의 공기조화기들의 각각이 소비한 전력량, 복수의 공기조화기들의 각각의 동작 이력 정보(operation history information), 복수의 공기조화기들의 각각의 상태 정보(status information) 및 복수의 공기조화기들의 각각의 종류 정보(type information)를 학습함으로써, 기상 상태에 따른 공기조화기의 소비 전력량을 나타내는 연관 정보(correlation information)를 획득하도록 학습된 인공지능 모델인 패턴 분석 모델(pattern analysis model), 연관 정보와 기 상 예보 정보에 기초하여, 공기조화기가 소비할 전력량을 예측하도록 학습된 인공지능 모델인 예측 모델 (predicting model) 및 공기조화기가 수행할 절전 동작 절차에 관한 제어 신호를 생성하여 출력하는 인공지능 모델인 제어 모델(control model)을 포함할 수 있다. 일 실시예에 따르면, 패턴 분석 모델은 공기조화기의 동작 이력 정보로부터 기상 상태에 따른 공기조화기의 동 작 패턴에 관한 특징 정보를 획득하도록 학습된 것일 수 있다. 패턴 분석 모델은 공기조화기의 동작 패턴에 관 한 특징 정보에 기초하여 기상 상태에 따른 공기조화기의 소비 전력량을 나타내는 연관 정보를 획득하도록 학습 된 것일 수 있다. 공기조화기의 동작 패턴은 공기조화기가 기상 상태에 대응하여 시간의 흐름에 따라서 수행한 유사한 동작 절차 들을 의미한다. 예를 들면, 실내와 실외의 최대 온도 차이값, 실내와 실외의 최소 온도 차이값에 따라서 공기 조화기가 동작을 시작한 시각, 공기조화기가 동작을 종료한 시각, 공기조화기의 압축기의 전류 제어, 압축기의 압력 제어, 냉매온도 제어 및 냉방 운행/정지와 같이 공기조화기가 실내의 온도제어를 하기 위해서 행한 일련의 동작 절차가 공기조화기의 동작 패턴에 해당할 수 있다. 또한, 공기조화기의 동작 패턴에 관한 특징 정보는 공 기조화기가 기상 상태에 대응하여 시간의 흐름에 따라서 수행한 유사한 동작 절차가 벡터(vector)를 이용하여 표현된 것을 의미한다. 또한, 패턴 분석 모델은 공기조화기의 동작 패턴에 관한 특징 정보에 기초하여 동작 패턴이 유사한 공기조화기 들을 클러스터링(clustering) 함으로써, 적어도 하나의 클래스를 생성하도록 학습된 것일 수 있다. 패턴 분석 모델은 클래스에 포함된 공기조화기들의 동작 패턴에 관한 특징 정보에 기초하여, 기상 상태에 따른 공기조화기 의 소비 전력량을 나타내는 연관 정보를 클래스 별로 획득하도록 학습된 것일 수 있다. 일 실시예에 따르면, 인공지능 모델은 복수의 장치에 포함될 수 있다. 예를 들면, 패턴 분석 모델, 예측 모델 및 제어 모델은 서로 다른 장치에 각각 포함될 수 있다. 구체적으로, 패턴 분석 모델은 공기조화기에 구축 (build)되고, 예측 모델은 서버에 구축되고, 제어 모델은 전자 장치에 구축될 수 있다. 하나의 장치에 두 개 이상의 인공지능 모델이 포함될 수 있음은 자명하다. 다른 예를 들면, 기상 상태에 따른 공기조화기의 동작 패턴에 관한 특징 정보를 획득하는 제1 패턴 분석 모델은 공기조화기에 구축되고, 공기조화기의 동작 패턴에 관한 특징 정보에 기초하여 기상 상태에 따른 공기조화기의 소비 전력량을 나타내는 연관 정보를 획득하는 제2 패턴 분석 모델은 서버에 구축될 수 있다. 기상 이 력 정보는 과거의 기상 이력에 관한 정보를 의미한다. 기상 이력 정보는 지역별 온도, 습도, 미세먼지 농도, 오존 농도, 자외선 지수, 풍속 등을 포함하는 기상 상태(weather condition)의 이력을 나타내는 정보를 포함할 수 있다. 기상 이력 정보는 시간(hour), 일(day), 주(week), 월(month)과 같이 소정의 시간 단위로 기록된 것 일 수 있다. 기상 예보 정보는 미래의 예측된 기상 상태를 나타내는 정보를 의미한다. 기상 예보 정보는 지역별 온도, 습도, 미세먼지 농도, 오존 농도, 자외선 지수, 풍속 등을 포함하는 기상 상태(weather condition)에 대해 예측 된 정보를 포함할 수 있다. 기상 예보 정보는 시간(hour), 일(day), 주(week), 월(month)과 같이 소정의 시간 단위로 획득될 수 있다. 공기조화기의 동작 이력 정보는 공기조화기에서 실행된 동작들의 이력을 나타내는 정보이다. 공기조화 기의 동작 이력 정보는 공기조화기의 로그(log) 데이터를 포함할 수 있다. 예를 들면, 공기조화기(3 0)의 동작 이력 정보는 사용자가 공기조화기를 사용한 시각, 사용자가 사용을 종료한 시각, 사용자가 설정 한 최고 희망 온도, 사용자가 설정한 최저 희망 온도, 실내와 실외의 최대 온도 차이값, 실내와 실외의 최소 온 도 차이값, 소정의 시간 동안 공기조화기가 동작한 운전 모드(operation mode)와 같이 공기조화기가 동 작하면서 기록하는 일련의 정보를 포함할 수 있다. 공기조화기의 동작 이력 정보는 시간(hour), 일(day), 주(week), 월(month)과 같이 소정의 시간 단위로 기록된 것일 수 있다. 공기조화기의 상태 정보는 공기조화기의 상태를 나타내는 정보일 수 있다. 공기조화기의 상태 정보 는 공기조화기 자체의 상태에 관한 정보 및 공기조화기 주변의 상태에 관한 정보일 수 있다. 공기조화 기 자체의 상태에 관한 정보는, 예를 들어, 공기조화기의 전원 상태, 공기조화기가 실행 중인 동작 에 관한 정보, 정보는 사용자가 공기조화기를 사용한 시각, 사용자가 사용을 종료한 시각, 사용자가 설정한 최고 희망 온도, 사용자가 설정한 최저 희망 온도 등에 관한 정보를 포함할 수 있다. 공기조화기 주변의 상태에 관한 정보는, 예를 들어, 공기조화기가 설치된 지역(region, 예를 들면, 서 울, 부산, 대전, 대구, 광주, 인천, 울산, 강릉, 제주도)에 관한 정보, 공기조화기가 설치된 장소 (location, 예를 들면, 단독 주택, 아파트, 사무실 등)에 관한 정보를 포함할 수 있다. 공기조화기의 종류(type) 정보는 공기조화기를 종류를 나타내는 정보일 수 있다. 예를 들면, 공기조화 기의 종류 정보는 벽걸이, 창문형, 스탠드형과 같이 공기조화기의 종류를 나타내는 정보를 포함할 수 있다. 개시된 실시예에 따르면, 전자 장치는 인공지능 모델을 이용함으로써, 공기조화기가 소비할 전력량을 빠르고 정확하게 예측할 수 있다. 도 2는 일 실시예에 따른, 전자 장치가 공기조화기가 소비할 전력량을 예측하는 방법의 순서도이다. 단계 210을 참조하면, 전자 장치는 기상 예보 정보를 획득할 수 있다. 일 실시예에 따르면, 전자 장치는 기상 예보 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상청의 서 버)로부터 기상 예보 정보를 획득할 수 있다. 예를 들면, 전자 장치는 기 설정된 시간이 경과할 때 마다 기 상청의 서버에 접속하여 기상 예보 정보를 획득할 수 있다. 단계 250을 참조하면, 전자 장치는 획득한 기상 예보 정보를 인공지능 모델에 적용할 수 있다. 인공지능 모델은 기상 예보 정보에 기초하여 공기조화기가 소비할 전력량을 예측하도록 학습된(trained) 적어도 하나의 예측 모델(predicting model)을 포함할 수 있다. 인공지능 모델에 대해서는 도 3을 참조하여 구체적으로 설명한다. 단계 210 및 250은 필수적인 단계에는 해당되지 않는다. 단계 210 및 250이 진행되지 않고, 단계 290이 진행될 수 있다. 즉, 전자 장치가 기상 예보 정보를 획득하는 대신 서버가 기상 예보 정보를 획득할 수 있다. 예를 들면, 전자 장치는 인공지능 모델을 포함하는 서버가 기상 예보 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상청의 서버)로부터 기상 예보 정보를 획득하도록 제어할 수 있다. 또는, 서버는 전자 장치의 제어 없이, 기상 예보 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상 청의 서버)로부터 기상 예보 정보를 획득할 수 있다.또는, 인공지능 모델은 기 설정된 시간이 경과할 때 마다 기상 예보 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상청의 서버)에 접속하여 기상 예보 정보를 획득하도록 학습된 것일 수 있다. 단계 290을 참조하면, 전자 장치는 인공지능 모델로부터 출력된, 공기조화기의 예측된 전력 소비량을 디스플레이부를 통해서 디스플레이할 수 있다. 일 실시예에 따르면, 전자 장치는 현재 이후의 소정의 기간 동안 공기조화기가 소비할 예측된 전력 소 비량을 디스플레이할 수 있다. 일 실시예에 따르면, 전자 장치는 시간(hour), 일(day), 주(week), 월(month)과 같이 소정의 시간 단위로 예측된 전력 소비량을 디스플레이할 수 있다. 전자 장치가 예측된 전력 소비량을 디스플레이하는 방법은 도 10을 참조하여 구체적으로 설명한다. 도 3은 일 실시예에 따른, 공기조화기가 소비할 전력량을 예측하는 인공지능 모델의 블록도이다. 도 3을 참조하면, 인공지능 모델은 기상 예보 정보에 기초하여, 공기조화기가 소비할 전력량을 예측하 여 출력할 수 있다. 인공지능 모델은 패턴 분석 모델(pattern analysis model, 300a) 및 예측 모델(predicting model, 300b) 를 포함할 수 있다. 패턴 분석 모델(300a)은 학습 데이터들(310, 320)을 학습함으로써, 기상 상태(weather condition)와 공기조화기 의 소비 전력량 사이의 연관성을 나타내는 연관 정보(correlation information)를 획득하도록 학습된 (trained) 모델이다. 패턴 분석 모델(300a)은 기설정된 시간 단위 별로 공기조화기가 소비한 전력량, 공기조화기의 동작 이 력 정보를 학습 데이터로 학습함으로써, 연관 정보를 획득할 수 있다. 또는 패턴 분석 모델(300a)은 기설정된 시간 단위 마다 공기조화기의 동작 이력 정보를 학습 데이터로 학습함으로써, 공기조화기의 동작 패턴 에 관한 특징 정보(feature information)를 획득할 수 있다. 또한, 예측 모델(300b)은 연관 정보와 기상 예보 정보에 기초하여, 공기조화기가 소비할 전력량을 예측하도 록 학습된(trained) 모델이다. 학습 데이터(310, 320)는 기상 이력 정보(weather history information), 복수의 공기조화기들의 각각이 소비 한 전력량, 복수의 공기조화기들의 각각의 동작 이력 정보(operation history information), 복수의 공기조화기 들의 각각의 상태 정보(status information) 및 복수의 공기조화기들의 각각의 종류 정보(type information) 중에서 적어도 하나를 포함할 수 있다. 하나의 공기조화기로부터 획득된 학습 데이터로는 기상 상태와 공기조화기의 소비 전력량 사이의 연관 정보를 정확하게 획득하기 어려우므로, 복수의 공기조화기로부터 획득된 학습 데이터를 이용하여 패턴 분석 모델(300 a)이 데이터를 학습하는 것이 바람직하다. 또한, 인공지능 모델은 공기조화기가 수행할 절전 동작 절차에 관한 제어 신호를 생성하여 출력하는 제어 모델(control model, 미도시)을 포함할 수 있다. 예를 들면, 제어 모델은 공기조화기가 냉방 운행을 시작 할 조건(예를 들면, 냉방 운행 시작 시각, 실내외 온도 차, 시간당 실내 온도의 상승 정도), 냉방 운행을 종료 할 조건(예를 들면, 냉방 운행 종료 시각, 실내외 온도 차, 시간당 실내 온도의 하강 정도)에 관한 제어 신호를 생성하여 출력할 수 있다. 일 실시예에 따르면, 패턴 분석 모델(300a) 및 예측 모델(300b)은 함께 하나의 장치에 구축(build)될 수 있다. 예를 들면, 패턴 분석 모델(300a) 및 예측 모델(300b)은 전자 장치에 함께 구축될 수 있다. 또는 패턴 분 석 모델(300a) 및 예측 모델(300b)은 서버에 함께 구축될 수 있다. 또는 패턴 분석 모델(300a) 및 예측 모 델(300b)은 공기조화기에 함께 구축될 수 있다. 일 실시예에 따르면, 패턴 분석 모델(300a) 및 예측 모델(300b)은 서로 다른 장치에 각자 구축(build)될 수 있 다. 예를 들면, 패턴 분석 모델(300a)은 서버에 구축되고, 예측 모델(300b)은 전자 장치에 구축될 수 있다. 일 실시예에 따르면, 패턴 분석 모델(300a) 및 예측 모델(300b)은 시간이 진행됨에 따라서 새로운 학습 데이터 를 학습함으로써, 갱신(refine)될 수 있다. 일 실시예에 따르면, 패턴 분석 모델(300a) 및 예측 모델(300b)은 시간의 흐름에 따라서 데이터를 순차적으로 학습하는 인공지능 알고리즘을 이용하여 구축될 수 있다. 예를 들면, 패턴 분석 모델(300a)은 RNNs(Recurrent Neural Networks), LSTM(Long Short term Memory)과 같은 인공지능 알고리즘을 이용하여, 소정의 시간에 대한 학습 데이터를 학습할 수 있다. 또한, 예측 모델(300b)은 RNNs, LSTM과 같은 인공지능 알고리즘을 이용하여 공기조화기가 소비할 전력량을 순차적으로 예측할 수 있 다. 구체적으로, 패턴 분석 모델(300a)은 현재보다 이전인 제1 기간에 대한 학습 데이터를 LSTM 유닛에 입력할 수 있다. LSTM 유닛은 학습 데이터를 학습함으로써, 제1 기간의 기상 상태에 따른 공기조화 기의 소비 전력량을 나타내는 연관 정보를 획득할 수 있다. 또한, 패턴 분석 모델(300a)은 제1 기간 이후인 제2 기간에 대한 학습 데이터를 LSTM 유닛에 입력할 수 있다. LSTM 유닛은 학습 데이터를 학습함으로써, 제1 기간 및 제2 기간의 기상 상태에 따른 공기 조화기의 소비 전력량을 나타내는 연관 정보를 획득하고, 출력할 수 있다. 패턴 분석 모델(300a)은 LSTM 유닛(311, 321)을 이용함으로써, 다양한 시계열 데이터를 포함하는 학습 데이터 (310, 320)으로부터 기상조건에 따른 공기조화기의 소비 전력량을 나타내는 연관성을 정확하게 분석할 수 있다. 일 실시예에 따르면, LSTM 유닛(311, 321)은 획득한 연관 정보를 학습 데이터로서 재이용함으로써 복수의 연관 정보를 획득할 수 있다. LSTM 유닛(311, 321)은 획득한 복수의 연관 정보들의 각각을 출력할 수 있다. 예를 들면, LSTM 유닛(311, 321)은 LSTM 유닛(311, 321)으로부터 출력되는 연관 정보를 다시 학습 데이터로 입 력 받을 수 있다. 다른 예를 들면, LSTM 유닛(311, 321)은 내부에 포함된 복수개의 LSTM 유닛을 이용하여 출력되는 연관 정보를 다시 학습 데이터로 입력 받을 수 있다. 구체적으로, LSTM 유닛은 제1 LSTM 유닛(311a) 및 제2 LSTM 유닛(311b)을 포함할 수 있다. LSTM 유닛 은 학습 데이터를 제1 LSTM 유닛(311a)으로 입력할 수 있다. 제1 LSTM 유닛(311a)은 학습 데이터 에 기초하여 획득한 제1 연관 정보를 LSTM 유닛 및 제2 LSTM 유닛(311b)에 입력할 수 있다. 제2 LSTM 유닛(311b)은 제1 연관 정보에 기초하여 획득한 제2 연관 정보를 LSTM 유닛에 입력할 수 있다. 또한, LSTM 유닛은 제1 LSTM 유닛(321a) 및 제2 LSTM 유닛(321b)을 포함할 수 있다. 제1 LSTM 유닛 (321a)은 학습 데이터, 제1 연관 정보에 기초하여 획득한 제3 연관 정보를 제2 LSTM 유닛(321b)에 입력할 수 있다. 제2 LSTM 유닛(321b)은 학습 데이터, 제2 연관 정보 및 제3 연관 정보에 기초하여 제4 연관 정 보를 획득할 수 있다. LSTM 유닛은 제4 연관 정보를 예측 모델(300b)의 LSTM 유닛에 입력할 수 있다. 학습 데이터(310, 320)의 종류 및 양에 따라서, LSTM 유닛(311, 321)의 내부에 포함되는 복수개의 LSTM 유닛의 개수가 결정될 수 있다. 하지만, 과적합(overfitting)을 방지하기 위해서, 개시된 실시예의 LSTM 유닛(311, 321)의 각각은 2개의 LSTM 유닛(311a, 311b, 321a, 322b)를 포함하는 것이 바람직하다. LSTM 유닛(311, 321)은 획득한 연관 정보를 다시 학습 데이터로서 이용함으로써, 다양한 시계열 데이터를 포함 하는 학습 데이터(310, 320)으로부터 기상조건에 따른 공기조화기의 소비 전력량을 나타내는 연관성을 정확하게 분석할 수 있다. 한편, 예측 모델(300b)은 현재보다 이후인 제3 기간의 기상 예보 정보 를 LSTM 유닛에 입력할 수 있 다. LSTM 유닛은 기상 예보 정보와 패턴 분석 모델(300a)로부터 출력되는 연관 정보에 기초하여, 제 3 기간 동안에 공기조화기가 소비할 전력량을 예측하여 출력할 수 있다. 또한, 예측 모델(300b)은 제3 기간보다 이후인 제4 기간에 대한 기상 예보 정보와 LSTM 유닛로부터 출력되는 연관 정보를 LSTM 유 닛에 입력할 수 있다. LSTM 유닛은 기상 예보 정보와 연관 정보에 기초하여, 제4 기간 동안에 공기조화기가 소비할 전력량을 예측하여 출력할 수 있다. 일 실시예에 따르면, 패턴 분석 모델(data learning model, 300a)은 현재보다 이전인 제1 기간 동안의 기상 이 력 정보 및 제1 기간 동안의 복수의 공기조화기들의 각각의 동작 이력 정보를 학습함으로써, 기상 상태에 따른 복수의 공기조화기들의 동작 패턴에 관한 특징 정보(feature information)을 획득하도록 학습된 것일 수 있다. 패턴 분석 모델(300a)은 기상 상태에 따른 복수의 공기조화기들의 일반적인 동작 패턴에 관한 특징 정보를 획득 할 수 있다. 공기조화기의 동작 패턴에 관한 특징 정보는 공기조화기가 동작을 시작한 시각, 공기조화기가 동작을 종료한 시 각, 공기조화기의 압축기의 전류 제어, 압축기의 압력 제어, 냉매온도 제어 및 냉방 운행/정지와 같이 공기조화 기가 실내의 온도제어를 하기 위해서 행한 일련의 동작 절차들로 구성된 패턴에 관한 정보를 포함할 수 있다. 동작 패턴 정보는 벡터(vector)로 표현될 수 있다. 예를 들면, 패턴 분석 모델(300a)은 제1 기간 동안의 최고 온도에 따른 공기조화기가 압축기의 전류, 압력 및 냉매온도를 제어한 동작 패턴에 관한 특징 정보를 획득할 수 있다. 또한, 패턴 분석 모델(300a)은 제1 기간 동 안의 실내 온도와 실외 온도의 차이에 따른 공기조화기가 압축기의 전류, 압력 및 냉매온도를 제어 및 냉방 운 행/정지와 같은 동작 패턴 정보를 획득할 수 있다. 또한, 패턴 분석 모델(300a)은 제1 기간 동안의 습도에 따 른 공기조화기가 압축기의 전류, 압력 및 냉매온도를 제어한 동작 패턴에 관한 특징 정보를 획득할 수 있다. 또한, 패턴 분석 모델(300a)은 제1 기간 동안의 최고 온도에 따른 사용자의 최저 희망 온도의 변화에 관한 정보 를 획득할 수 있다. 또한, 패턴 분석 모델(300a)은 제1 기간 동안의 실내 온도와 실외 온도의 차이에 따른 사용 자의 최저 희망 온도의 변화에 관한 정보를 획득할 수 있다. 또한, 패턴 분석 모델(300a)은 제1 기간 동안의 습도에 따른 사용자의 최저 희망 온도의 변화에 관한 정보를 획득할 수 있다. 일 실시예에 따르면, 패턴 분석 모델(300a)은 공기조화기의 동작 패턴에 따른 공기조화기가 소비한 전력량에 대 한 정보를 획득할 수 있다. 예를 들면, 패턴 분석 모델(300a)은 공기조화기의 압축기의 전류 제어, 압축기의 압력 제어, 냉매온도 제어 및 냉방 운행/정지에 따른 전력 소비량에 관한 정보를 획득할 수 있다. 일 실시예에 따르면, 패턴 분석 모델(300a)은 공기조화기의 동작 패턴에 기초하여, 기상 상태에 따른 공기조화 기의 소비 전력량을 나타내는 연관 정보(correlation information)를 획득할 수 있다. 패턴 분석 모델(300a)은 기상 상태에 따른 공기조화기의 동작 패턴에 관한 특징 정보와 동작 패턴에 따른 공기조화기가 소비한 전력량에 대한 정보로부터 기상 상태에 따른 공기조화기의 소비 전력량을 나타내는 연관 정보를 획득할 수 있다. 한편, 예측 모델(300b)은 공기조화기의 동작 패턴에 기초하여 획득된 연관 정보 및 기상 예보 정보에 기초 하여, 공기조화기가 소비할 전력량을 예측할 수 있다. 예를 들면, 예측 모델(300b)은 공기조화기의 동 작 패턴에 관한 특징 정보 및 공기조화기의 동작 패턴에 따른 공기조화기가 소비한 전력량에 대한 정보 를 포함하는 연관 정보와 기상 예보 정보로부터 획득된 기상 상태에 기초하여, 공기조화기가 소비할 전력량 을 예측할 수 있다. 도 4 및 도 5는 인공지능 모델에 입력되는 정보들에 전처리를 수행하는 것을 나타낸 것이다. 구체적으로, 도 4 는 인공지능 모델에 입력되는 공기조화기의 동작 이력 정보를 행렬로 변환하는 것을 나타낸 것이고, 도 5는 인 공지능 모델에 입력되는 기상 이력 정보를 행렬로 변환하는 것을 나타낸 것이다. 도 4 및 도 5를 참조하면, 패턴 분석 모델(300a)에 학습 데이터가 적용되기 위해서 학습 데이터에 전처리가 수 행될 수 있다. 일 실시예에 따르면, 전자 장치의 프로세서는 공기조화기로부터 획득한 공기조화기의 동작 이 력 정보에 대해서 전처리를 수행할 수 있다. 또한, 전자 장치의 프로세서는 기상 이력 정보를 전 송하는 적어도 하나의 서버(예를 들면, 기상청의 서버)로부터 획득한 기상 이력 정보에 대해서 전처리를 수행할 수 있다. 일 실시예에 따르면, 서버의 프로세서는 학습 데이터에 대해서 전처리를 수행할 수 있다. 서버의 프로세서는 전자 장치 또는 공기조화기로부터 수신된 공기조화기의 동작 이력 정보에 대 해서 전처리를 수행할 수 있다. 또한, 서버의 프로세서는 기상 이력 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상청의 서버)로부터 획득한 기상 이력 정보에 대해서 전처리를 수행할 수 있다. 일 실시예에 따르면, 인공지능 모델은 입력된 학습 데이터를 전처리하도록 학습된 것일 수 있다. 예를 들 면, 인공 지능 모델은 전자 장치 또는 서버로부터 입력된 공기조화기의 동작 이력 정보 에 대해서 전처리를 수행하도록 학습된 것일 수 있다. 또한, 인공지능 모델은 전자 장치 또는 서버 로부터 입력된 기상 이력 정보에 대해서 전처리를 수행하도록 학습된 것일 수 있다. 도 4를 참조하면, 공기조화기의 동작 이력 정보가 행렬로 변환되는 전처리가 수행될 수 있다. 공기조화기의 동작 이력 정보는 실시간으로 수집되어, 시간(hour), 일(day), 주(week), 월(month)과 같이 소정의 시간 단위로 기록된 것 일 수 있다. 공기조화기의 동작 이력 정보는 소정의 기간 및 소정의 기간 동안에 공기조화기가 동작하면서 기 록된 일련의 정보가 포함되도록 행렬로 변환될 수 있다. 행렬로 변환되는 공기조화기의 동작 이 력 정보는 공기조화기가 동작하면서 기록된 일련의 정보가 가공된 데이터(예를 들면, 최소값, 최대값, 합, 평균값, 변화량)일 수 있다. 예를 들면, 공기조화기의 전력 소비량, 사용자의 최저 희망 온도, 최고 희망 온도, 실내와 실외의 최대 온 도차이, 실내와 실외의 최소 온도 차이, 공기조화기의 사용시간이 일별로 기록된 공기조화기의 동작 이력 정보가 행렬로 변환될 수 있다. 또한, 공기조화기가 수행한 압축기의 전류 제어 시각, 압축기의 전류 량, 압축기의 압력 제어 시각, 압축기의 압력량, 냉매온도 제어 시각, 냉매의 실시간 온도, 및 냉방 운행/정지 시각을 포함하는 공기조화기의 동작 이력 정보가 행렬로 변환될 수 있다. 도 5를 참조하면, 기상 이력 정보가 행렬로 변환되는 전처리가 수행될 수 있다. 기상 이력 정보 는 시간(hour), 일(day), 주(week), 월(month)과 같이 소정의 시간 단위로 수집 및 기록된 것 일 수 있다. 기상 이력 정보는 지역별 온도, 습도, 미세먼지 농도, 오존 농도, 자외선 지수, 풍속, 기상 상태 (weather condition)과 같이 기상을 기록하는데 이용되는 일련의 정보가 포함되도록 행렬로 변환될 수 있 다. 예를 들면, 일별로 획득된 기상 상태, 최고 온도, 최저 온도, 최고 습도, 최저 습도, 미세먼지 농도, 오존 농도, 자외선 지수, 풍속을 포함하는 기상 이력 정보가 행렬로 변환될 수 있다. 한편, 인공지능 모델에 적용되는 기상 예보 정보에도 전처리가 수행될 수 있다. 전자 장치의 프로세 서, 서버의 프로세서는 기상 예보 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상청의 서버)로부터 획득한 기상 예보 정보에 대해서 전처리를 수행할 수 있다. 인공지능 모델은 전자 장치 또는 서버 로부터 입력된 기상 예보 정보에 대해서 전처리를 수행할 수 있다. 기상 예보 정보에 수행되는 전처리는 도 5를 참조하여 설명한 기상 이력 정보에 대해서 수행되는 전처리와 유사 하게 수행될 수 있다. 예를 들면, 시간별, 일별로 획득된 기상 상태, 최고 온도, 최저 온도, 최고 습도, 최저 습도, 미세먼지 농도, 오존 농도, 자외선 지수, 풍속을 포함하는 기상 예보 정보가 행렬로 변환될 수 있다. 도 6a는 일 실시예에 따른, 인공지능 모델을 이용하는 전자 장치와 서버의 동작에 관련된 순서도이고, 도 6b는 일 실시예에 따른, 인공지능 모델을 이용하는 전자 장치와 서버의 동작을 나타낸 것이다. 개시된 실시예에 따르면, 전자 장치는 공기조화기로부터 공기조화기의 동작 이력 정보를 수신할 수 있 고, 서버와 네트워크를 통해서 데이터를 송수신할 수 있는 모바일 장치, 범용 컴퓨터와 같은 연산 장치를 포함할 수 있다. 또는, 다른 실시예에 따르면, 전자 장치는 공기조화기이거나, 공기조화기에 포함된 적어도 하나의 하드웨어 모듈 또는 소프트웨어 모듈에 해당될 수 있다. 도 6a를 참조하면, 전자 장치는 제1 인공지능 모델을 이용하여 사용자의 공기조화기의 사용 패턴 또는 공기 조화기의 동작 패턴에 관한 특징 정보(feature information)를 획득할 수 있다. 전자 장치는 공기조화 기로부터 동작 이력 정보를 획득하고, 동작 이력 정보를 제1 인공지능 모델에 입력할 수 있다. 제1 인공지 능 모델은 공기조화기의 동작 이력 정보로부터 공기조화기의 동작 패턴에 관한 특징 정보를 획득하도록 학습된 것일 수 있다. 공기조화기의 동작 패턴에 관한 특징 정보는 벡터(vector)로 표현될 수 있다. 예를 들면, 제1 인공지능 모델을 포함하는 모바일 장치는 홈 네트워크를 통해서 제1 공기조화기로부터 제1 공기 조화기의 동작 이력 정보를 획득할 수 있다. 모바일 장치는 제1 공기조화기의 동작 이력 정보를 제1 인공지능 모델에 적용하고, 제1 인공지능 모델로부터 출력되는 제1 공기조화기의 동작 패턴을 나타내는 벡터 값을 획득할 수 있다. 다른 예를 들면, 제1 인공지능 모델을 포함하는 제1 공기조화기는 제1 공기조화기의 동작을 로그 데이터로 저장 할 수 있다. 제1 공기조화기는 로그 데이터를 제1 인공지능 모델에 입력하고, 제1 인공지능 모델로부터 출력되 는 제1 공기조화기의 사용 패턴을 나타내는 벡터 값을 획득할 수 있다. 도 6b를 참조하여 설명하면, 공기조화기들(30a, 30b, 30c)의 각각은 제1 인공지능 모델(34a, 34b, 34c)을 포함 할 수 있다. 제1 인공지능 모델은 전술한 패턴 분석 모델의 기능 중의 적어도 일부를 수행하는 인공지능 모델 일 수 있다. 예를 들면, 제1 인공지능 모델은 공기조화기의 동작 이력 정보로부터 공기조화기의 동작 패턴에관한 특징 정보를 획득하도록 학습된 것일 수 있다. 전자 장치는 제1 인공지능 모델(34a, 34b, 34c)으로부터 출력된 공기조화기의 동작 패턴에 관한 특징 정보 를 서버로 송신할 수 있다. 예를 들면, 모바일 장치는 제1 공기조화기의 사용 패턴을 나타내는 벡터 값을 서버로 송신할 수 있다. 다 른 예를 들면, 제1 공기조화기는 제1 인공지능 모델로부터 출력되는 제1 공기조화기의 사용 패턴을 나타내는 벡 터 값을 서버로 송신할 수 있다. 또는, 공기조화기들(30a, 30b, 30c)의 각각은 공기조화기들(30a, 30b, 30c)의 각각의 제1 인공지능 모델(34a, 34b, 34c)으로부터 출력된 공기조화기의 동작 패턴에 관한 특징 정보를 서버로 송신할 수 있다. 전자 장치가 기설정된 시간 단위 별 제1 공기조화기의 동작 이력 정보를 서버로 전송하는 대신, 제1 인 공지능 모델을 이용하여 생성된 제1 공기조화기의 사용 패턴을 나타내는 벡터 값을 서버로 송신함으로써, 사용자의 프라이버시를 보호할 수 있다. 또한, 전자 장치가 서버로 송신하는 데이터 양이 줄어들고, 서버가 처리할 데이터 량이 줄어드는 효과도 존재한다. 서버는 전자 장치로부터 수신한 제1 공기조화기의 사용 패턴에 관한 특징 정보를 제2 인공지능 모델에 적용함으로써, 제1 공기조화기의 예측 전력 소비량을 획득할 수 있다. 또는, 서버는 공기조화기들(30a, 30b, 30c)의 각각으로부터 수신한 공기조화기들(30a, 30b, 30c)의 각각의 사용 패턴에 관한 특징 정보를 제2 인공지능 모델에 적용함으로써 공기조화기들(30a, 30b, 30c)의 각각이 소비할 예측 전력량을 획득할 수 있다. 제2 인공지능 모델은 제1 공기조화기의 사용 패턴에 관한 특징 정보, 기상 이력 정보(weather history information) 및 제1 공기조화기가 소비한 전력량을 학습함으로써, 기상 상태에 따른 제1 공기조화기의 소비 전 력량을 나타내는 제1 연관 정보(correlation information)를 획득할 수 있다. 또한, 제2 인공지능 모델은 제1 연관 정보와 기상 예보 정보에 기초하여, 제1 공기조화기가 소비할 전력량을 예측함으로써, 제1 공기조화기의 예측 전력 소비량을 출력할 수 있다. 서버는 제1 공기조화기의 예측 전력 소비량을 전자 장치로 송신할 수 있다. 예를 들면, 서버(2 0)는 기설정된 시간 단위 별 제1 공기조화기의 예측 전력 소비량을 전자 장치로 송신할 수 있다. 또한, 서버는 전자 장치로 제1 공기조화기가 수행할 절전 동작 절차에 관한 제어 신호를 제1 공기조화 기의 예측 전력 소비량과 함께 송신할 수 있다. 제어 신호는 제2 인공지능 모델에서 생성된 것일 수 있다. 전자 장치는 서버로부터 송신된 제1 공기조화기의 예측 전력 소비량을 출력할 수 있다. 전자 장치(1 0)는 제1 공기조화기의 예측 전력 소비량을 문자, 숫자, 도형 및 그래프와 같은 다양한 표시 수단을 이용하여 디스플레이부를 통해 출력할 수 있다. 또한, 전자 장치는 스피커를 통해서 제1 공기조화기의 예측 전력 소 비량을 소리로 출력할 수 있다. 예를 들면, 모바일 장치는 기설정된 시간 별 제1 공기조화기의 예측 전력 소비량을 디스플레이부를 통해서 출력 할 수 있다. 다른 예를 들면, 제1 공기조화기는 공기조화기의 디스플레이부를 통해서 제1 공기조화기의 예측 전력 소비량을 디스플레이 할 수 있다. 또 다른 예를 들면, 제1 공기조화기는 제1 공기조화기와 연결된 모바일 장치의 디스플레이부를 통해서 제1 공기조화기의 예측 전력 소비량을 디스플레이 할 수 있다. 도 7은 일 실시예에 따른, 공기조화기의 예측 소비 전력량을 획득하는 방법에 관한 순서도이고, 도 8은 클래스 별로 인공지능 모델을 생성하는 것을 나타내는 것이다. 서버는 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 각각의 동작 이력 정보를 획득할 수 있다. 예를 들면, 서버는 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 각각으로부터 동작 이력 정보를 수신 할 수 있다. 또는 서버는 전자 장치로부터 제1 공기조화기의 동작 이력 정보를 획득할 수 있다. 전자 장치 는 제1 공기조화기로부터 제1 공기조화기의 동작 이력 정보를 수신할 수 있고, 서버와 네트워크를 통해서 데이터를 송수신할 수 있는 모바일 장치, 범용 컴퓨터와 같은 연산 장치를 포함할 수 있다. 또는, 전자 장치는 공기조화기(30a, 30b, 30c, 30d, 30e)이거나, 공기조화기(30a, 30b, 30c, 30d, 30e)에 포함된 적어 도 하나의 하드웨어 모듈 또는 소프트웨어 모듈에 해당될 수 있다. 서버는 획득된 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 각각의 동작 이력 정보를 인공지능 모델 에 적용함으로써, 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 각각의 동작 패턴에 관한 특징 정보 (feature information)를 획득할 수 있다. 특징 정보는 벡터(vector)로 표현될 수 있다. 단계 710 및 720은 필수적인 과정은 아니다. 서버는 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 각 각의 동작 이력 정보에 기초하여 생성된 복수의 공기조화기들의 각각의 동작 패턴에 관한 특징 정보를 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)로부터 수신할 수 있다. 또는, 서버는 제1 공기조화기로부터 동작 이력 정보를 수신하는 전자 장치로부터 제1 공기조화기의 동작 패턴에 관한 특징 정보를 수신할 수 있다. 서버로 특징 정보를 송신하는 제1 공기조화기 또는 전자 장치는 제1 공기조화기의 동작 이력 정보에 기초하여 생성된 동작 패턴에 관한 특징 정보를 출력하도록 학습된 인공지능 모델을 포함 할 수 있다. 서버는 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 각각의 동작 패턴에 관한 특징 정보에 기초하여, 동작 패턴이 유사한 공기조화기들을 클러스터링(clustering)함으로써, 클래스(30-1, 30-2, 30-3)를 생성할 수 있다. 예를 들면, 서버는 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)의 동작 패턴을 나타내는 벡터 값이 유사 한 정도를 식별할 수 있다. 서버는 동작 패턴에 관한 특징 정보가 유사한 복수의 공기조화기들에 동일한 라벨(label)을 할당하고, 동일한 라벨이 할당된 복수의 공기조화기들을 동일한 클래스로 분류할 수 있다. 공 기조화기는 복수개의 라벨이 할당될 수 있다. 서버는 복수의 공기조화기들의 동작 패턴을 나타내는 벡터 값 들이 유사한 정도를 식별하고, 라벨을 할당하도록 학습된(trained) 인공지능 모델을 포함할 수 있다. 구체적으로, 서버는 복수의 공기조화기들(30a, 30b, 30c, 30d, 30e)들 중에서 공기조화기들(30a, 30b)를 제1 클래스(30-1)로 클러스터링 하고, 공기조화기들(30c, 30d)를 제2 클래스(30-2)로 클러스터링 하고, 공기조 화기(30e)를 제3 클래스(30-3)로 클러스터링 할 수 있다. 서버는 동일한 클래스로 분류된 복수의 공기조화 기들의 소비 전력량을 예측하는 적어도 하나의 인공지능 모델(41, 42, 43)을 포함할 수 있다. 서버는 기상 상태에 따른 동일한 클래스로 분류된 복수의 공기조화기들의 소비 전력량을 나타내는 연관 정 보를 획득할 수 있다. 예를 들면, 서버는 클래스(30-1, 30-2, 30-3) 별로 연관 정보를 획득하여 출력 하도록 학습된 패턴 분석 모델(41a, 42a, 43a)을 포함할 수 있다. 패턴 분석 모델(41a)은 제1 클래스(30-1)에 포함된 공기조화기들(30a, 30b)의 각각이 소비한 전력량, 공기조화기들(30a, 30b)의 각각의 동작 이력 정보 및 공기조화기들(30a, 30b)의 각각의 상태 정보와 기상 이력 정보에 기초하여, 기상 상태에 따른 상기 제1 클래스 (30-1)에 포함된 공기조화기(30a, 30b)의 소비 전력량을 나타내는 제1 연관 정보를 획득하여 출력할 수 있다. 서버는 연관 정보 및 기상 예보 정보에 기초하여 공기조화기가 소비할 전력량을 예측할 수 있다. 예 를 들면, 서버는 클래스(30-1, 30-2, 30-3) 별로 획득한 연관 정보와 기상 예보 정보에 기초하여 공기조화 기가 소비할 전력량을 예측하도록 학습된 예측 모델(41b, 42b, 43b)을 포함할 수 있다. 예측 모델(41a)은 제1 연관 정보 및 기상 예보 정보에 기초하여, 제1 클래스(30-1)에 포함된 제1 공기조화기(30a)의 예측 전력 소비량 을 획득하고, 출력할 수 있다. 서버는 공기조화기의 예측 전력 소비량을 출력할 수 있다. 예를 들면, 서버는 제1 공기조화기 (30a)의 예측 전력 소비량을 제1 공기조화기(30a)로 송신할 수 있다. 다른 예를 들면, 서버는 제1 공기조 화기(30a)와 연결된 전자 장치로 제1 공기조화기(30a)의 예측 전력 소비량을 송신할 수 있다. 서버는 제1 공기조화기(30a)의 예측 전력 소비량에 관한 정보를 출력하는 웹서버를 포함할 수 있다. 전자 장치는 웹서버에 접속함으로써, 제1 공기조화기(30a)의 예측 전력 소비량에 관한 정보를 획득하고, 디스플레이 할 수 있다. 개시된 실시예에 따르면, 서버는 동작 패턴이 유사한 공기조화기들을 분류함으로써, 공기조화기의 동작 패 턴에 따른 예측 소비 전력량을 정확하게 획득할 수 있다. 또한, 서버는 동작 패턴이 유사한 공기조화기에 대한 맞춤형 제어 신호를 생성할 수 있다. 도 9a및 도 9b는 인공지능 모델을 이용하여 공기조화기가 소비할 전력량을 예측한 결과를 나타내는 그래프이다. 구체적으로, 도 9a은 공기조화기가 소비한 전력량을 일별로 예측한 결과를 나타내는 그래프이고, 도 9b는 공기 조화기가 소비한 전력량을 누적하여 예측한 결과를 나타내는 그래프이다. 도 9a및 도 9b는 8월 1일 내지 8월 14일까지의 기상 이력 정보, 공기조화기의 동작 이력 정보, 공기조화기 의 상태 정보, 공기조화기가 소비한 전력량에 기초하여, 8월 14일 내지 8월 21까지 공기조화기가 소비한 전력량을 예측한 결과와 8월 14일 내지 8월 21까지 공기조화기가 실제 소비한 전력량을 비교한 결과 를 그래프로 나타낸 것이다. 도 9a를 참조하면, 개시된 인공지능 모델을 이용하여 공기조화기가 일별로 소비한 전력량을 예측한 그래프 는 공기조화기가 실제 일별로 소비한 전력량을 나타내는 그래프와 유사함을 알 수 있다. 또한, 도 9b를 참조하면, 개시된 인공지능 모델을 이용하여 공기조화기가 소비한 누적 전력량을 예측한 그 래프는 공기조화기가 실제 소비한 누적 전력량을 나타내는 그래프와 유사함을 알 수 있다. 구체적으로, 일주일 동안 개시된 인공지능 모델을 이용하여 공기조화기가 소비한 전력량을 예측한 결과는 공기조화기가 실제 소비한 전력량과 약 4.2kW의 차이가 존재한다. 차이값을 백분율로 환산하면 약 26%의 차이가 존재한다. 이러한, 전력량의 차이는 일반적인 공기조화기가 1시간동안 소비하는 전력량에 해당하기 때문에, 개시된 인공지능 모델을 이용하여 정확하게 전력 소비량을 예측한 것임이 확인된다. 기상 예보 정보를 이용하여 공기조화기가 소비할 전력량을 예측하는 다른 알고리즘과 결과를 비교하면 표 1 과 같다. 표 1 Measurement Linear Regression DNN Random Forest Seq2Seq MAE 6.1kWatt 5.4kWatt 4.7kWatt 4.2kWatt MAPE 122% 104% 88% 26% 표 1을 참조하면, 일주일 동안 Linear Regression 알고리즘을 이용하여 공기조화기가 소비할 전력량을 예측 한 결과는 공기조화기가 실제 소비한 전력량과 약 6.1kW의 차이가 존재한다. 차이값을 백분율로 환산하면 약 122%의 차이가 존재한다. 또한, 일주일 동안 DNN 알고리즘을 이용하여 공기조화기가 소비할 전력량을 예측한 결과는 공기조화기 가 실제 일별로 소비한 전력량과 약 5.4kW의 차이가 존재한다. 차이값을 백분율로 환산하면 약 104%의 차이가 존재한다. 또한, 일주일 동안 Random Forest 알고리즘을 이용하여 공기조화기가 소비할 전력량을 예측한 결과는 공기 조화기가 실제 일별로 소비한 전력량과 약 4.7kW의 차이가 존재한다. 차이값을 백분율로 환산하면 약 88% 의 차이가 존재한다. 따라서, 개시된 인공지능 모델을 이용하여 공기조화기가 소비한 전력량을 예측하는 방법이 다른 알고리즘을 이용하여 공기조화기가 소비한 전력량을 예측하는 방법보다 정확한 것임을 알 수 있다. 도 10은 일 실시예에 따른, 전자 장치가 인공지능 모델을 이용하여 예측된 공기조화기가 소비할 전력량을 디스 플레이 하는 것을 나타낸 것이다. 도 10을 참조하면, 전자 장치는 인공지능 모델로부터 출력된 공기조화기의 예측된 전력 소비량에 관한 정보를 디스플레이 할 수 있다. 예를 들면, 전자 장치는 현재 이후의 소정의 시간 동안 공기조화기 가 소비할 예측 전력량을 그래프로 디스플레이할 수 있다. 또한, 전자 장치는 예측 전력량을 수 치로 출력할 수 있다. 일 실시예에 따르면, 전자 장치는 사용자로부터 임계값을 설정하는 입력을 수신할 수 있다. 전자 장치(1 0)는 임계값과 공기조화기의 예측된 전력 소비량을 비교할 수 있다. 전자 장치는 예측된 전력 소비량 이 임계값 이상이 되는 시점을 출력할 수 있다. 예를 들면, 전자 장치는 예측된 전력 소비량이 임계값 이상 이 되는 시점을 소정의 도형, 색채와 같은 방법으로 출력할 수 있다. 또한, 전자 장치는 예측된 전력 소비 량이 임계값과 소정의 범위(예를 들면, 임계값의 90%)내인 경우, 알림(notification)을 표시할 수 있다. 개시된 실시예에 따르면, 사용자는 공기조화기의 예측 전력량이 설정된 임계값을 초과할 가능성을 정확하고 용이하게 인식할 수 있다. 따라서, 사용자가 공기조화기를 절전 운행하도록 유도함으로써 에너지를 절약할 수 있다. 전자 장치는 공기조화기가 절전 동작하도록 제어 신호를 전송할 수 있다. 예를 들면, 전자 장치는 공기조화기의 압축기의 전류를 제어(예를 들면, 압축기의 회전수를 제어하는 전류값을 설정)하는 제어 신호, 압축기의 압력을 제어(예를 들면, 압축기에서 냉매가 토출되는 토출 밸브를 제어)하는 제어 신호, 냉매 온도를 제어(예를 들면, 냉매 온도를 제어하기 위해서 실내기 팽창 밸브를 제어)하는 제어 신호, 공기조화기 의 냉방 동작을 수행/종료하는 제어 신호를 공기조화기로 전송할 수 있다. 일 실시예에 따르면, 전자 장치는 예측된 전력 소비량이 임계값과 소정의 범위 내인 경우, 절전운행을 위한 제어 신호를 생성하여 공기조화기로 전송할 수 있다. 또는, 서버가 절전운행을 위한 제어 신호를 생성 하여 전자 장치 또는 공기조화기로 전송할 수 있다. 전자 장치 및 서버는 제어 신호를 생성하 는 인공지능 모델인 제어 모델(control model)을 포함할 수 있다. 일 실시예에 따르면, 전자 장치는 인공지능 모델을 이용하여 획득된 공기조화기의 동작 패턴에 기초하 여 생성된 공기조화기가 수행할 절전 동작 절차에 관한 제어 신호를 공기조화기로 전송할 수 있다. 제 어 신호는 인공지능 모델이 생성하여 전자 장치를 통해서 공기조화기로 전송될 수 있다. 또는 전자 장 치가 공기조화기의 동작 패턴에 기초하여 제어 신호를 생성하고, 공기조화기로 전송할 수 있다. 인공지능 모델은 공기조화기의 동작 이력 정보로부터 공기조화기의 압축기의 전류 제어, 압축기의 압력 제어, 냉매온도 제어 및 냉방 운행/정지와 같이 공기조화기가 실내의 온도제어를 하기 위해서 행한 일련의 동작 절차들로 구성된 패턴을 획득할 수 있다. 인공지능 모델은 동작 패턴으로부터 실내, 실외의 기온에 따른 공기조화기의 동작 시간, 사용자가 설정한 희망 온도, 사용자가 설정한 바람의 세기에 관한 정보, 사용자의 취침시간에 관한 정보, 사용자의 민감도, 사용 자의 실내 온도 적응 시간에 관한 정보와 같이 사용자의 취향 정보를 획득할 수 있다. 인공지능 모델은 동작 패턴과 기상 이력 정보로부터 공기조화기가 과냉방 운행되는지 여부를 식별할 수 있다. 인공지능 모델은 사용자의 취향 정보에 기초하여, 공기조화기가 과냉방을 하지 않는 절전 운행하기 위한 제어 신호를 생성할 수 있다. 예를 들면, 인공지능 모델은 강한 바람을 좋아하는 사용자의 취향 정보에 기초하여, 공기조화기가 초 기에만 냉방을 강하게 운행하고, 강한 바람을 지속적으로 발생시키도록 제어하는 제어 신호를 생성할 수 있다. 다른 예를 들면, 인공지능 모델은 바람을 싫어하는 사용자의 취향 정보에 기초하여, 공기조화기가 무 풍 운행과 습도를 제거하는 운행을 하도록 제어하는 제어 신호를 생성할 수 있다. 다른 예를 들면, 인공지능 모 델은 사용자의 취침시간에 관한 정보에 기초하여, 공기조화기를 무풍 운행하고, 희망 온도를 상향하도 록 제어하는 제어 신호를 생성할 수 있다. 도 11 내지 도 13은 일 실시예에 따른, 전자 장치가 사용자의 개인 정보를 이용하여 제어 신호를 생성하는 것을 나타낸 것이다. 전자 장치는 예측된 전력 소비량이 임계값과 소정의 범위 내인 경우, 절전운행을 위한 제어 신호를 생성하 여 공기조화기로 전송할 수 있다. 또는, 서버가 절전운행을 위한 제어 신호를 생성하여 전자 장치 또는 공기조화기로 전송할 수 있다. 전자 장치 및 서버는 공기조화기가 수행할 절전 동작 절차에 관한 제어 신호를 생성하여 출력하는 인공지능 모델인 제어 모델(control model)을 포함할 수 있다. 전자 장치는 사용자의 개인 정보(personal information)을 이용하여 제어 신호를 생성하고, 공기조화기(3 0)로 전송할 수 있다. 또는, 전자 장치는 사용자의 개인 정보를 인공지능 모델에 입력하고, 인공지능 모델 로부터 출력된 제어 신호를 공기조화기로 전송할 수 있다. 사용자의 개인 정보는 공기조화기를 이용하는 사용자와 관련된 정보를 의미한다. 사용자의 개인 정보는 사 용자의 일정 정보(schedule information), 사용자의 위치 정보(location information), 및 사용자의 동작 정보 (motion information)를 포함할 수 있다. 전자 장치는 사용자의 개인 정보를 획득할 수 있다. 예를 들면, 전자 장치는 사용자의 일정 기록 어플 리케이션(예를 들면, 캘린더 어플리케이션) 또는 메일 어플리케이션으로부터 사용자의 일정 정보를 획득할 수 있다. 다른 예를 들면, 전자 장치는 GPS와 같은 위치 센서를 이용하여 사용자의 위치 정보를 획득할 수 있 다. 다른 예를 들면, 전자 장치는 동작 감지 센서, 자이로 센서, 카메라와 같은 다양한 장치를 이용하여 사용자의 동작 정보를 획득할 수 있다. 도 11은 일 실시예에 따른, 전자 장치가 사용자의 일정 정보(schedule information)에 기초하여 제어 신호를 생 성하는 것을 나타낸 것이다. 도 11을 참조하면, 전자 장치는 사용자의 일정 정보(schedule information)에 기초하여 공기조화기가 수행할 절전 동작 절차에 관한 제어 신호를 공기조화기로 전송할 수 있다. 일 실시예에 따르면, 전자 장치는 사용자의 일정 정보로부터 사용자가 집을 비우는 시간(예를 들면, 사용자 가 여행을 떠나는 기간)을 식별하고, 사용자가 집을 비운 시간 동안에는 공기조화기가 운행하지 않도록 제 어 신호를 생성할 수 있다. 예를 들면, 전자 장치는 사용자의 캘린더 어플리케이션으로부터 사용자의 일정 정보를 획득할 수 있 다. 전자 장치는 사용자의 출장 일정에 관한 정보를 획득할 수 있다. 전자 장치는 사용자의 휴 가 일정에 관한 정보를 획득할 수 있다. 전자 장치는 사용자의 퇴근 후 모임 일정에 관한 정보 를 획득할 수 있다. 또한, 전자 장치는 사용자의 출장 일정에 관한 정보로부터 사용자가 집을 비우는 시간에 관한 정보를 획득할 수 있다. 전자 장치는 사용자의 휴가 일정에 관한 정보로부터 사용자가 집을 비우는 시간에 관한 정보를 획득할 수 있다. 전자 장치는 사용자의 퇴근 후 모임 일정에 관한 정보로부터 사용자의 귀가 시간에 관한 정보를 획득할 수 있다. 전자 장치는 사용자가 출장, 휴가 및 모임 등의 이유로 집을 비운 시간 동안에는 공기조화기가 동작하지 않 도록 제어 신호를 생성하여 공기조화기로 송신할 수 있다. 일 실시예에 따르면, 전자 장치는 사용자의 일정 정보로부터 사용자의 요일별 귀가 시간 패턴에 관한 정보 를 획득할 수 있다. 예를 들면, 전자 장치는 매주 월요일 저녁에 모임이 있는 사용자의 일정 정보로부터 사용자가 월요일 저녁의 귀가 시간에 관한 정보를 획득할 수 있다. 전자 장치는 사용자의 일정 정보를 인 공지능 모델에 적용함으로써, 사용자의 요일별 귀가 시간 패턴에 관한 정보를 획득할 수 있다. 전자 장치 는 귀가 시간 패턴에 관한 정보에 기초하여, 사용자의 귀가 시간 이전에 공기조화기가 예냉(precooling) 운 행을 하도록 제어 신호를 생성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 도 12는 일 실시예에 따른, 전자 장치가 사용자의 위치 정보(location information)에 기초하여 제어 신호를 생 성하는 것을 나타낸 것이다. 도 12를 참조하면, 전자 장치는 사용자의 위치 정보(location information)에 기초하여 공기조화기가 수행할 절전 동작 절차에 관한 제어신호를 공기조화기로 전송할 수 있다. 예를 들면, 전자 장치는 사용자의 현재 위치에 관한 사용자의 위치 정보를 획득할 수 있다. 전자 장 치는 사용자의 위치 정보에 기초하여, 사용자의 귀가할 때까지 남은 시간을 식별할 수 있다. 전자 장치 는 사용자의 귀가 시간 이전에 공기조화기가 예냉 운행을 하도록 제어 신호를 생성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 다른 예를 들면, 전자 장치는 사용자의 위치 정보에 기초하여, 현재 사용자가 집을 비웠는지 여부를 식별할 수 있다. 전자 장치는 사용자가 집을 비운 시간 동안에는 공기조화기가 운행하지 않도록 제어 신호를 생성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 또 다른 예를 들면, 전자 장치는 사용자의 위치 정보를 인공지능 모델에 적용함으로써, 사용자의 요일별 귀 가 시간 패턴에 관한 정보를 획득할 수 있다. 전자 장치는 귀가 시간 패턴에 관한 정보에 기초하여, 사용 자의 귀가 시간보다 소정의 시간 이전에 공기조화기가 예냉(precooling) 운행을 하도록 제어 신호를 생성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 도 13은 일 실시예에 따른, 전자 장치가 사용자의 동작 정보(motion information)에 기초하여 제어 신호를 생성 하는 것을 나타낸 것이다. 도 13을 참조하면, 전자 장치는 사용자의 동작 정보(motion information)에 기초하여 공기조화기가 수 행할 절전 동작 절차에 관한 제어신호를 공기조화기로 전송할 수 있다. 예를 들면, 전자 장치는 카메라를 이용하여 획득한 이미지로부터 사용자의 동작 정보를 획득할 수 있 다. 전자 장치는 이미지로부터 사용자가 취침상태인지 여부를 식별할 수 있다. 사용자가 취침 상태 인 경우, 전자 장치는 공기조화기를 무풍 운행하고, 희망 온도를 상향하도록 제어하는 제어 신호를 생 성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 다른 예를 들면, 전자 장치는 카메라를 이용하여 취침 중인 사용자가 이불을 덮는 동작을 식별할 수 있다. 전자 장치는 사용자의 동작에 기초하여, 공기조화기를 무풍 운행하고, 희망 온도를 상향하도록 제어하 는 제어 신호를 생성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 다른 예를 들면, 전자 장치는 전자 장치에 포함된 자이로 센서를 이용하여 사용자의 동작 정보를 획득 할 수 있다. 사용자가 전자 장치를 이용하는 경우, 자이로 센서에 의해서 사용자의 동작 정보를 획득할 수 있다. 전자 장치는 소정시간 동안 사용자의 동작이 감지되지 않는 경우, 사용자가 취침 중인 것으로 식별 하고, 공기조화기를 무풍 운행하고, 희망 온도를 상향하도록 제어하는 제어 신호를 생성할 수 있다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 다른 예를 들면, 전자 장치는 동작 감지 센서와 같은 사물 인터넷 장치를 이용하여 사용자의 동작 정보를 획득할 수 있다. 전자 장치는 소정시간 동안 사용자의 동작이 감지되지 않는 경우, 사용자가 취침 중인 것으로 식별하고, 공기조화기를 무풍 운행하고, 희망 온도를 상향하도록 제어하는 제어 신호를 생성할 수 있 다. 전자 장치는 제어 신호를 공기조화기로 전송할 수 있다. 전자 장치는 사용자의 일정 정보(schedule information)와 사용자의 위치 정보(location information), 사 용자의 동작 정보(motion information)를 모두 고려하여 제어 신호를 생성할 수 있다. 도 14는 일 실시예에 따른, 전자 장치의 블록도이다. 도 14를 참조하면, 전자 장치는, 사용자 입력부, 출력부, 프로세서, 통신부 및 메모리(1 7)를 포함할 수 있다. 그러나, 도 14에 도시된 구성 요소 모두가 전자 장치의 필수 구성 요소인 것은 아니 다. 도 14에 도시된 구성 요소보다 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 도 14에 도시된 구성 요소보다 적은 구성 요소에 의해 전자 장치가 구현될 수도 있다. 사용자 입력부는, 사용자가 전자 장치를 제어하기 위한 데이터를 입력하는 수단을 의미한다. 예를 들어, 사용자 입력부에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방식 등), 터치스크린, 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 사용자 입력부는 도 1 내지 도 13을 참조하여 설명한 실시예들을 전자 장치가 수행하기 위해 필요한 사 용자 입력을 수신할 수 있다. 예를 들면, 사용자 입력부는 사용자가 임계값을 설정하기 위한 입력을 수신 할 수 있다. 중복되는 내용은 생략한다. 출력부는 전자 장치에서 처리되는 정보를 출력한다. 출력부는 공기조화기가 소비할 전력량에 관한 정보를 출력하는 디스플레이부(12-1)를 포함할 수 있다. 예를 들면, 디스플레이부(12-1)는 공기조화기 의 예측된 전력 소비량을 그래프로 출력할 수 있다. 또는 디스플레이부(12-1)는 공기조화기의 예측된 전력 소비량을 수치로 출력할 수 있다. 프로세서는 범용적으로 이용되는 적어도 하나의 프로세서일 수 있다. 또한, 프로세서는 공기조화기 가 소비할 전력량을 예측하기 위한 특수 목적으로 제작된 프로세서 일 수 있다. 또한, 프로세서는 인공 지능 모델의 기능을 수행하기 위해서 제작된 적어도 하나의 프로세서를 포함할 수 있다. 프로세서는, 통상적으로 전자 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 메모리 에 저장된 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력부, 출력부, 통신부, 메모리 등을 전반적으로 제어할 수 있다. 프로세서는 서버에 구축된 인공지능 모델로부터 출력되는 공기 조화기의 예측된 전력 소비량에 관한 정보를 수신하도록 통신부를 제어할 수 있다. 프로세서는 인 공지능 모델로부터 출력된 공기조화기의 예측된 전력 소비량에 관한 정보를 출력하도록 디스플레이부(12- 1)를 제어할 수 있다. 프로세서는 공기조화기로부터 획득한 공기조화기의 동작 이력 정보, 공기조화기의 상태 정보 및 공기조 화기가 소비한 전력량에 관한 정보, 기상 이력 정보를 학습 데이터로서 인공지능 모델에 적용할 수 있다. 프로 세서는 학습 데이터에 대해서 전처리를 수행한 후 인공지능 모델에 적용할 수 있다. 프로세서는 기상 예보 정보를 전송하는 적어도 하나의 서버(예를 들면, 기상청의 서버)로부터 획득한 기상 예보 정보를 인공지능 모델에 적용할 수 있다. 프로세서는 기상 예보 정보에 대해서 전처리를 수행한 후 인 공지능 모델에 적용할 수 있다. 프로세서는 도 1 내지 도 13을 참조하여 위에서 설명한 인공지능 모델의 기능을 수행할 수 있다. 프로세서 는 인공지능 모델의 기능을 수행하기 위해서 제작된 적어도 하나의 프로세서를 포함할 수 있다. 프로세서 는 메모리에 저장된 일련의 명령어를 실행함으로써 소프트웨어 모듈 형태로 존재하는 인공지능 모델의 기능을 수행할 수 있다. 프로세서는 서버에 저장된 인공지능 모델의 기능을 수행하기 위해서 통신부를 제어할 수 있다. 프 로세서는 인공지능 모델의 기능을 수행하기 위해서 서버로 데이터를 송신하도록 통신부를 제어할 수 있다. 프로세서는 서버에 저장된 인공지능 모델로부터 출력된 데이터를 수신하도록 통신부를 제어할 수 있다. 프로세서는 인공지능 모델을 갱신하기 위한 데이터를 서버로부터 수신하도록 통신부 를 제어할 수 있다. 프로세서는 인공지능 모델이 새로운 학습 데이터를 학습하도록 일련의 인스트럭션를 실행할 수 있다. 통신부는, 전자 장치가 다른 장치(미도시) 및 서버와 통신을 하게 하는 하나 이상의 구성요소를 포 함할 수 있다. 다른 장치(미도시)는 전자 장치와 같은 컴퓨팅 장치일 수 있으나, 이에 제한되지 않는다. 메모리는, 프로세서의 처리 및 제어를 위한 적어도 하나의 인스트럭션 및 적어도 하나의 프로그램을 저 장할 수 있고, 전자 장치로 입력되거나 전자 장치로부터 출력되는 데이터를 저장할 수도 있다. 메모리는 램(RAM, Random Access Memory) SRAM(Static Random Access Memory)과 같이 일시적으로 데이터를 저장하는 메모리 및 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 롬 (ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크과 같이 비일시적으로 데이터를 저 장하는 데이터 스토리지 중에서 적어도 하나의 타입의 저장매체를 포함할 수 있다. 도 15는 일 실시예에 따른, 전자 장치와 연동하는 서버의 블록도이다. 도 15를 참조하면, 일부 실시예에 따른 서버는 통신부, DB 및 프로세서를 포함할 수 있다. 통신부는 서버가 전자 장치와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. DB는 공기조화기가 소비할 전력량을 예측하기 위한 데이터 및 프로그램을 저장할 수 있다. 프로세서는 통상적으로 서버의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 서버의 DB에 저장된 프로그램들을 실행함으로써, DB 및 통신부 등을 전반적으로 제어할 수 있다. 프로세서 는 DB에 저장된 프로그램들을 실행함으로써, 도 1 내지 도 14를 참조하여 설명한 전자 장치의 동작 의 일부를 수행할 수 있다. 한편, 전자 장치 및 서버는 데이터 인식 모델의 학습 및 데이터 인식을 위한 작업을 효과적으로 분배하 여 수행할 수 있으며, 이를 통하여, 사용자의 의도에 부합하는 서비스를 제공하기 위하여 데이터 처리를 효율적 으로 수행할 수 있다. 도 16은 일 실시예에 따른, 공기조화기의 블록도이다. 도 16을 참조하면, 일부 실시예에 따른 공기조화기는 실내기 및 실외기를 포함할 수 있다. 실내기는 실내 공간에 위치되어 실내 공기와 냉매 사이의 열교환을 수행하는 장치를 의미한다. 실내기(3 8)는 실내 공기와 냉매 사이의 열교환을 수행하는 실내 열교환기와, 냉방 시 실내 열교환기로 제공되는 냉매를 감압하는 실내 팽창밸브를 포함할 수 있다. 실외기는 일반적으로 실외 공간에 위치되어 실외 공기와 냉매 사이의 열교환을 수행하는 장치를 의미한다. 실외기는 기상 냉매를 압축하는 압축기, 실외 공기와 냉매 사이의 열교환을 수행하는 실외 열교환기, 압축 기에서 토출된 냉매를 실외 열교환기와 실내기 중에서 어느 하나로 선택적으로 안내하는 사방밸브, 난방 시에 실외 열교환기로 안내되는 냉매를 감압하는 실외 팽창밸브, 액상 냉매가 압축기로 유입되는 것을 방지하는 어큐 뮬레이터를 포함할 수 있다. 실외기는 압축기, 실외 열교환기, 사방밸브, 실외 팽창 밸브 및 어큐뮬레이터 의 동작을 제어하는 실외기 제어부(미도시)를 포함할 수 있다. 실외기 제어부는 제어부에 의해서 생성된 제어 명령에 기초하여 실외기를 제어할 수 있다. 실내기는 사용자 입력부, 출력부, 제어부, 통신부 및 메모리를 포함할 수 있다. 그러 나, 도 16에 도시된 구성 요소 모두가 공기조화기의 필수 구성 요소인 것은 아니다. 도 16에 도시된 구성 요소보다 많은 구성 요소에 의해 공기조화기가 구현될 수도 있고, 도 16에 도시된 구성 요소보다 적은 구성 요소에 의해 공기조화기가 구현될 수도 있다. 또한, 일부 실시예에 따른 공기조화기는 도 1 내지 도 14를 참조하여 설명한 전자 장치의 기능 중에서 적어도 일부를 수행할 수 있다. 공기조화기는 적어도 하나의 하드웨어 모듈 또는 소프트웨어 모듈로서 전 자 장치를 포함할 수 있다. 사용자 입력부는 사용자가 공기조화기를 제어하기 위한 데이터를 입력하는 수단을 의미한다. 예를 들 면, 사용자 입력부는 실내기에 대한 사용자의 동작 명령을 입력받을 수 있다. 일 실시예에 따르면, 전자 장치는 사용자 입력부일 수 있다. 전자 장치는 공기조화기와 통신 연결되고, 사용자로부터 수신한 제어 명령을 공기조화기로 송신할 수 있다. 출력부는 공기조화기에서 처리되는 정보를 출력한다. 예를 들면, 출력부는 공기조화기의 현재 상 태에 관한 정보를 출력할 수 있다. 또한, 출력부는 공기조화기가 소비할 전력량에 관한 정보를 출력할 수 있다. 일 실시예에 따르면, 전자 장치는 출력부일 수 있다. 전자 장치는 공기조화기와 통신 연결되 고, 공기조화기로부터 수신된 공기조화기에서 처리된 정보를 출력할 수 있다. 제어부는 범용적으로 이용되는 적어도 하나의 프로세서일 수 있다. 또한, 제어부는 공기조화기가 소비할 전력량을 예측하기 위한 특수 목적으로 제작된 프로세서 일 수 있다. 또한, 제어부는 인공지능 모델 의 기능을 수행하기 위해서 제작된 적어도 하나의 프로세서를 포함할 수 있다. 제어부는, 통상적으로 공기조화기의 전반적인 동작을 제어한다. 예를 들어, 제어부는, 메모리 에 저장된 적어도 하나의 인스트럭션을 실행함으로써, 사용자 입력부, 출력부, 통신부, 메모리 등을 전반적으로 제어할 수 있다. 예를 들면, 제어부는 서버에 구축된 인공지능 모델로부터 출력되는 공기조화기의 예측된 전력 소비량에 관한 정보를 수신하도록 통신부를 제어할 수 있다. 제어부는 인공지능 모델로부터 출력된 공기조화기의 예측된 전력 소비량에 관한 정보를 출력하도록 출력부를 제 어할 수 있다. 제어부는 적어도 하나의 소프트웨어 모듈로서 포함된 전자 장치의 기능 중에서 적어도 일부를 수행할 수 있다. 또한 제어부는 도 1 내지 도 14를 참조하여 설명한 전자 장치의 기능 중에서 적어도 일부를 수행하도록 적어도 하나의 하드웨어 모듈을 제어할 수 있다. 통신부는 공기조화기가 전자 장치, 서 버 및 다른 장치(미도시)와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 예를 들면, 통신부 는 전자 장치 및 서버 중에서 적어도 하나로부터 제어 신호를 수신할 수 있다. 또한, 통신부 는 전자 장치 및 서버 중에서 적어도 하나로부터 공기조화기의 예측된 전력 소비량에 관한 정보를 수신할 수 있다. 또한, 통신부는 전자 장치 및 서버 중에서 적어도 하나로 공기조화기에서 처 리된 정보를 송신할 수 있다. 메모리는, 제어부의 처리 및 제어를 위한 적어도 하나의 인스트럭션 및 프로그램을 저장할 수 있고, 공 기조화기로 입력되거나 공기조화기로부터 출력되는 데이터를 저장할 수도 있다. 일부 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기 록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매 체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매 체는 컴퓨터 저장 매체를 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리 형 및 비분리형 매체를 모두 포함한다. 또한, 본 명세서에서, “부”는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다. 전술한 본 명세서에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6a 도면6b 도면7 도면8 도면9a 도면9b 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2019-0115472", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 공기조화기가 소비할 전력량을 예측하는 방법의 예시를 설명하는 도면이다. 도 2는 일 실시예에 따른, 전자 장치가 공기조화기가 소비할 전력량을 예측하는 방법의 순서도이다. 도 3은 일 실시예에 따른, 공기조화기가 소비할 전력량을 예측하는 인공지능 모델의 블록도이다. 도 4는 일 실시예에 따른, 인공지능 모델에 입력되는 공기조화기의 동작 이력 정보를 행렬로 변환하는 것을 나 타낸 것이다. 도 5는 일 실시예에 따른, 인공지능 모델에 입력되는 기상 이력 정보를 행렬로 변환하는 것을 나타낸 것이다. 도 6a는 일 실시예에 따른, 인공지능 모델을 이용하는 전자 장치와 서버의 동작에 관련된 순서도이다.도 6b는 일 실시예에 따른, 인공지능 모델을 이용하는 전자 장치와 서버의 동작을 나타낸 것이다. 도 7은 일 실시예에 따른, 공기조화기의 예측 소비 전력량을 획득하는 방법에 관한 순서도이다. 도 8은 일 실시예에 따른, 공기조화기들이 분류된 클래스별로 인공지능 모델을 생성하는 것을 나타낸 것이다. 도 9a는 일 실시예에 따른, 인공지능 모델을 이용하여 공기조화기가 소비할 전력량을 예측한 결과를 나타내는 그래프이다. 도 9b는 일 실시예에 따른, 인공지능 모델을 이용하여 공기조화기가 소비할 전력량을 예측한 결과를 나타내는 그래프이다. 도 10은 일 실시예에 따른, 전자 장치가 인공지능 모델을 이용하여 예측된 공기조화기가 소비할 전력량을 디스 플레이 하는 것을 나타낸 것이다. 도 11은 일 실시예에 따른, 전자 장치가 사용자의 일정 정보에 기초하여 제어 신호를 생성하는 것을 나타낸 것 이다. 도 12는 일 실시예에 따른, 전자 장치가 사용자의 위치 정보에 기초하여 제어 신호를 생성하는 것을 나타낸 것 이다. 도 13은 일 실시예에 따른, 전자 장치가 사용자의 동작 정보에 기초하여 제어 신호를 생성하는 것을 나타낸 것 이다. 도 14는 일 실시예에 따른, 전자 장치의 블록도이다. 도 15는 일 실시예에 따른, 전자 장치와 연동하는 서버의 블록도이다. 도 16은 일 실시예에 따른, 공기조화기의 블록도이다."}
