{"patent_id": "10-2022-0080274", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0003145", "출원번호": "10-2022-0080274", "발명의 명칭": "인공 지능 기반의 개인 안면 인식을 통한 보안 및 개인화 서비스 제공 방법 및 그를 위한 장", "출원인": "주식회사 엘지유플러스", "발명자": "신종수"}}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "프로필 인증 장치에서의 보안 및 개인화 서비스 제공 방법에 있어서,프로필 설정 정보를 등록하는 단계;카메라 촬영된 영상으로부터 사용자의 안면을 인식하여 상기 프로필 설정 정보에 상응하는 안면 등록 절차를 수행하는 단계;상기 안면 등록에 성공한 프로필을 잠금 설정하는 단계;특정 메뉴 선택에 따라 상기 카메라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하는 단계;및상기 안면 인증에 성공한 것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 잠금 설정이 해제된 것에 기반하여 상기 사용자 선택된 프로필에 상응하는 개인 맞춤형 사용자 인터페이스화면을 구성하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 프로필 설정 정보는 시청 연령 및 시청 시간을 제한하기 위한 설정 정보 및 성인 콘텐츠 시청을 제한하기설정 정보 중 적어도 하나를 포함하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 프로필 설정 정보를 등록하는 단계는,프로필 등록 메뉴 선택에 따라 휴대 전화 번호 입력을 위한 사용자 인터페이스 화면을 출력하는 단계;사용자 입력된 휴대 전화 번호에 상응하는 프로필 설정 정보 데이터베이스를 생성하는 단계;제한 설정 메뉴를 포함하는 프로필 설정 사용자 인터페이스 화면을 출력하는 단계; 및사용자 입력된 제한 설정 정보를 상기 프로필 설정 정보 데이터베이스에 등록하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 프로필 설정 사용자 인터페이스 화면은 얼굴 등록 메뉴를 포함하고, 상기 안면 등록 절차는 상기 얼굴 등록 메뉴 선택에 따라 상기 카메라를 구동하여 수행되는 것을 특징으로하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0003145-3-제1항에 있어서,상기 안면 등록에 실패한 것에 기반하여 안면 등록 실패 메시지를 생성하여 출력하는 단계를 더 포함하고, 상기안면 등록에 실패한 프로필은 잠금 해제 상태가 유지되는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 안면 인증을 수행하는 단계는,프로필 자동 전환 모드가 활성화되지 않은 것에 기반하여 상기 사용자 선택된 프로필만을 대상으로 안면 인증을수행하는 현재 프로필 안면 인증 절차; 및상기 프로필 자동 전환 모드가 활성화된 것에 기반하여 사전 등록된 전체 프로필을 대상으로 안면 인증을 수행하는 전체 프로필 안면 인증 절차를 포함하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 전체 프로필 안면 인증 절차는,상기 전체 프로필을 대상으로 안면 인식을 수행하여 자동 전환 대상 프로필을 식별하는 단계;상기 사용자 선택된 프로필을 상기 식별된 프로필로 자동 전환하는 단계를 포함하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 현재 프로필 안면 인증 절차 및 상기 전체 프로필 안면 인증 절차 중 어느 하나를 통해 상기 안면 인증에실패한 것에 기반하여, 모든 프로필에 공통으로 적용되는 공용 설정 값을 설정하는 단계를 더 포함하되, 상기공용 설정 값 설정 후 홈 화면으로 진입하는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 안면 인증은 외부 서버와의 연동 없이 상기 프로필 인증 장치가 탑재된 셋톱박스 내 안면 인식 엔진을 이용하여 수행되는 것을 특징으로 하는, 방법."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "적어도 하나의 프로세서에 의해 실행될 때, 상기 적어도 하나의 프로세서가 프로필 인증 장치에서 보안 및 개인화 서비스를 제공하기 위한 동작들을 수행하게 하는 명령을 포함하는 적어도 하나의 컴퓨터 프로그램을 저장하는 비휘발성 컴퓨터 판독 가능 저장 매체에 있어서,상기 동작들은,프로필 설정 정보를 등록하는 단계;카메라 촬영된 영상으로부터 안면을 인식하여 상기 프로필 설정 정보에 상응하는 안면 등록 절차를 수행하는 단계;상기 안면 등록에 성공한 프로필을 잠금 설정하는 단계;특정 메뉴 선택에 따라 상기 카메라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하는 단계;및상기 안면 인증에 성공한 것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제하는 단계공개특허 10-2024-0003145-4-를 포함하는, 저장 매체."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "프로필 설정 정보를 등록하고, 카메라 촬영된 영상으로부터 사용자 안면을 인식하여 상기 프로필 설정 정보에상응하는 안면 등록 절차를 수행하고, 상기 안면 등록에 성공한 프로필을 잠금 설정하고, 특정 메뉴 선택에 따라 상기 카메라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하고, 상기 안면 인증에 성공한것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제하는 것을 특징으로 하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 잠금 설정이 해제된 것에 기반하여 상기 사용자 선택된 프로필에 상응하는 개인 맞춤형 사용자 인터페이스화면을 구성하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12항에 있어서,상기 프로필 설정 정보는 시청 연령 및 시청 시간을 제한하기 위한 설정 정보 및 성인 콘텐츠 시청을 제한하기설정 정보 중 적어도 하나를 포함하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제12항에 있어서,상기 TV 앱의 마이 메뉴 화면의 프로필 등록 메뉴가 선택된 것에 기반하여 휴대 전화 번호 입력을 위한 사용자인터페이스 화면을 구성하여 출력하고, 사용자 입력된 휴대 전화 번호에 상응하는 프로필 설정 정보 데이터베이스를 생성하고, 소정 제한 설정 메뉴를 포함하는 프로필 설정 사용자 인터페이스 화면을 구성하여 상기 출력하고, 사용자 입력된 제한 설정 정보를 상기 프로필 설정 정보 데이터베이스에 등록하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 프로필 설정 사용자 인터페이스 화면은 얼굴 등록 메뉴를 포함하고, 상기 안면 등록 절차는 상기 얼굴 등록 메뉴 선택에 따라 상기 카메라를 구동하여 수행되는 것을 특징으로하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제12항에 있어서,상기 안면 등록에 실패한 것에 기반하여 안면 등록 실패 메시지를 생성하여 출력하고, 상기 안면 등록에 실패한프로필은 잠금 해제 상태가 유지되는 것을 특징으로 하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제12항에 있어서,상기 안면 인증은,프로필 자동 전환 모드가 활성화되지 않은 것에 기반하여 상기 사용자 선택된 프로필만을 대상으로 안면 인증을수행하는 현재 프로필 안면 인증 절차; 및상기 프로필 자동 전환 모드가 활성화된 것에 기반하여 사전 등록된 전체 프로필을 대상으로 안면 인증을 수행하는 전체 프로필 안면 인증 절차를 포함하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "공개특허 10-2024-0003145-5-제18항에 있어서,상기 전체 프로필 안면 인증 절차는,상기 전체 프로필을 대상으로 안면 인식을 수행하여 자동 전환 대상 프로필을 식별하는 단계;상기 사용자 선택된 프로필을 상기 식별된 프로필로 자동 전환하는 단계를 포함하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 현재 프로필 안면 인증 절차 및 상기 전체 프로필 안면 인증 절차 중 어느 하나를 통해 상기 안면 인증에실패한 것에 기반하여, 모든 프로필에 공통으로 적용되는 공용 설정 값을 설정한 후 홈 화면으로 진입시키는 것을 특징으로 하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제12항에 있어서,상기 안면 인증은 외부 서버와의 연동 없이 상기 프로필 인증 장치가 탑재된셋톱박스 내 안면 인식 엔진을 이용하여 수행되는 것을 특징으로 하는, 프로필 인증 장치."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 인공 지능 기반의 개인 안면 인식을 통한 보안 및 개인화 서비스 제공 방법 및 그를 위한 장치에 관한 것으로서, 본 개시의 일 측면에 따른 프로필 인증 장치에서의 보안 및 개인화 서비스 제공 방법은 프로필 설정 정보를 등록하는 단계와 카메라 촬영된 영상으로부터 안면을 인식하여 상기 프로필 설정 정보에 상응하는 안면 등록 절차를 수행하는 단계와 상기 안면 등록에 성공한 프로필을 잠금 설정하는 단계와 특정 메뉴 선택에 따라 상기 카메라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하는 단계와 상기 안면 인증에 성공 한 것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제하는 단계를 포함할 수 있다. 따라서, 본 발명 은 인공 지능 기반으로 보다 강화된 보안 및 개인화 서비스를 제공할 수 있는 장점이 있다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공 지능에 기반한 개인 안면 인식을 통해 보안 및 개인화 서비스를 강화하기 위한 기술에 관한 것 이다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "셋톱박스(Set-Top Box, STB)는 말 그대로 바닥 위에 올려놓는 박스라는 의미로 일반적으로 디지털 방송을 수신 하기 위한 장치를 일컫는다. 셋톱박스는 댁내에서 지상파 방송, 케이블 방송, 위성 방송 등을 수신해 연결된 TV를 통해 시청하기 위한 장치 이다. 최근에는 셋톱박스와 전화선(또는 전용선)을 연결해 TV를 통해 방송 프로그램 시청은 물론 인터넷 접속을 통해 유튜브, 영화, 음악, 쇼핑, 교육, 게임 등의 각종 컨텐츠를 조회/선택/시청 가능하게 하는 장치로 활용되 고 있다. 디지털 방송 서버는 영상, 음성, 데이터 신호를 다중 송신(multiplex)으로 압축한 후 이를 변조(modulation)해 송신하는 역할을 한다. 셋톱박스는 디지털 방송 서버에 의해 송신된 신호를 디지털 튜너를 통해 수신한 후 복조 (demodulation) 과정을 거쳐 각각의 신호를 압축 해제하고 분리하는 작업을 수행한다. 최근 통신 사업자들을 중심으로 스마트 스피커-즉, 인공 지능 스피커-가 탑재된 셋탑박스가 출시되고 있으며, 셋톱박스는 스피커를 통해 입력된 사용자 음성을 전용 음성 인식 서버와의 연동을 통해 인식하고, 인식 결과를 기초로 방송 채널 조회 서비스, 음원 재생 서비스, 각종 컨텐츠 조회 서비스, 인터넷 정보 검색 서비스, 조명 및 홈 어플라이언스 제어 서비스 등을 제공할 수 있었다. 하지만, 현재 상용화된 셋톱박스에 적용된 보안 기술은 도 1에 도시된 바와 같이, 홈 화면 진입 후 프로필 등록 시 리모콘을 통해 숫자 타입의 프로필 잠금 비밀 번호를 설정하고, 이후, 사용자가 설정된 잠금 비밀 번호를 리 모콘 키 버튼을 통해 직접 입력하여 해당 프로필에 대한 잠금 설정을 해제할 수 있도록 구현되었다. 따라서, 잠 금 비밀 번호가 다른 사람에게 쉽게 노출될 수 있으며, 이에 따라 보안에 취약한 문제점이 있었다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 인공 지능 기반의 개인 안면 인식을 통한 보안 및 개인화 서비스 제공 방법 및 그를 위한 장 치 및 시스템을 제공하는 것이다. 본 발명의 다른 목적은 개인 안면 인식을 위해 외부 서버와의 연동 없이 프로필 인증 장치가 탑재된 셋톱박스가 카메라 촬영된 안면을 직접 인식 및 분석하여 보안 및 개인화 서비스를 제공하는 것이 가능한 온-디바이스(On- Device) 안면 인식 기반의 보안 및 개인화 서비스를 제공 방법을 제공하는 것이다. 본 발명의 또 다른 목적은 별도 서버와의 연동 없이 프로필 인증 장치가 탑재된 셋톱박스 내 안면 인식 엔진을 통해 실제 사용자를 식별하여 정확하고 빠른 프로필 전환 및 개인 맞춤형 서비스를 제공하는 것이 가능한 온-디 바이스(On-Device) 안면 인식 기능이 탑재된 셋톱박스를 제공하는 것이다. 본 발명의 또 다른 목적은 개인 안면 인식을 통한 프로필 잠금 설정 및 해제를 통해 종래 비밀 번호 입력 방식 에 비해 개인 프로필에 대한 보안을 강화할 수 있을뿐만 아니라 개인 안면 인식을 통한 프로필 자동 전환을 통 해 고객 맞춤형 개인화 서비스를 보다 빠르고 편리하게 제공하는 것이 가능한 온-디바이스(On-Device) 안면 인 식 기반의 보안 및 개인화 서비스 제공 방법 및 그를 위한 장치를 제공하는 것이다. 본 발명의 또 다른 목적은 인공 지능 기반의 개인 안면 인식을 통해 실제 사용자의 연령대/성별을 식별함으로써, 미성년자의 성인 콘텐츠 접근을 미연에 방지할 수 있을뿐만 아니라 연령대 및 성별에 맞는 개인 맞춤형 콘텐츠를 자동으로 제공하는 것이 가능한 프로필 인증 장치 및 그를 이용한 보안 및 개인화 서비스를 제 공 방법을 제공하는 것이다. 본 발명의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 측면에 따른 프로필 인증 장치에서의 보안 및 개인화 서비스 제공 방법은 프로필 설정 정보를 등 록하는 단계와 카메라 촬영된 영상으로부터 안면을 인식하여 상기 프로필 설정 정보에 상응하는 안면 등록 절차 를 수행하는 단계와 상기 안면 등록에 성공한 프로필을 잠금 설정하는 단계와 특정 메뉴 선택에 따라 상기 카메 라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하는 단계와 상기 안면 인증에 성공한 것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제하는 단계를 포함할 수 있다. 실시 예로, 상기 방법은 상기 잠금 설정이 해제된 것에 기반하여 상기 사용자 선택된 프로필에 상응하는 개인 맞춤형 사용자 인터페이스 화면을 구성하여 출력하는 단계를 더 포함할 수 있다. 실시 예로, 상기 프로필 설정 정보는 시청 연령 및 시청 시간을 제한하기 위한 설정 정보 및 성인 콘텐츠 시청 을 제한하기 설정 정보 중 적어도 하나를 포함할 수 있다. 실시 예로, 상기 프로필 설정 정보를 등록하는 단계는 프로필 등록 메뉴 선택에 따라 휴대 전화 번호 입력을 위 한 사용자 인터페이스 화면을 출력하는 단계와 사용자 입력된 휴대 전화 번호에 상응하는 프로필 설정 정보 데 이터베이스를 생성하는 단계와 제한 설정 메뉴를 포함하는 프로필 설정 사용자 인터페이스 화면을 출력하는 단 계와 사용자 입력된 제한 설정 정보를 상기 프로필 설정 정보 데이터베이스에 등록하는 단계를 포함할 수 있다. 실시 예로, 상기 프로필 설정 사용자 인터페이스 화면은 얼굴 등록 메뉴를 포함하고, 상기 안면 등록 절차는 상 기 얼굴 등록 메뉴 선택에 따라 상기 카메라를 구동하여 수행될 수 있다. 실시 예로, 상기 방법은 상기 안면 등록에 실패한 것에 기반하여 안면 등록 실패 메시지를 생성하여 출력하는 단계를 더 포함하고, 상기 안면 등록에 실패한 프로필은 잠금 해제 상태가 유지될 수 있다. 실시 예로, 상기 안면 인증을 수행하는 단계는 프로필 자동 전환 모드가 활성화되지 않은 것에 기반하여 상기 사용자 선택된 프로필만을 대상으로 안면 인증을 수행하는 현재 프로필 안면 인증 절차와 상기 프로필 자동 전 환 모드가 활성화된 것에 기반하여 사전 등록된 전체 프로필을 대상으로 안면 인증을 수행하는 전체 프로필 안 면 인증 절차를 포함할 수 있다. 실시 예로, 상기 전체 프로필 안면 인증 절차는 상기 전체 프로필을 대상으로 안면 인식을 수행하여 자동 전환 대상 프로필을 식별하는 단계와 상기 사용자 선택된 프로필을 상기 식별된 프로필로 자동 전환하는 단계를 포함 하고, 상기 자동 전환된 프로필에 상응하는 프로필 설정 정보에 기반으로 개인 맞춤형 사용자 인터페이스 화면 이 구성되어 출력될 수 있다. 실시 예로, 상기 방법은 상기 현재 프로필 안면 인증 절차 및 상기 전체 프로필 안면 인증 절차 중 어느 하나를 통해 상기 안면 인증에 실패한 것에 기반하여, 모든 프로필에 공통으로 적용되는 공용 설정 값을 설정하는 단계 를 더 포함하되, 상기 공용 설정 값 설정된 후 홈 화면으로 진입될 수 있다. 실시 예로, 상기 안면 인증은 외부 서버와의 연동 없이 상기 프로필 인증 장치가 탑재된 상기 셋톱박스 내 안면 인식 엔진을 이용하여 수행될 수 있다. 본 개시의 다른 측면에 따른 적어도 하나의 프로세서에 의해 실행될 때, 상기 적어도 하나의 프로세서가 프로필 인증 장치에서 보안 및 개인화 서비스를 제공하기 위한 동작들을 수행하게 하는 명령을 포함하는 적어도 하나의 컴퓨터 프로그램을 저장하는 비휘발성 컴퓨터 판독 가능 저장 매체에 있어서, 상기 동작들은 프로필 설정 정보 를 등록하는 단계와 카메라 촬영된 영상으로부터 안면을 인식하여 상기 프로필 설정 정보에 상응하는 안면 등록 절차를 수행하는 단계와 상기 안면 등록에 성공한 프로필을 잠금 설정하는 단계와 특정 메뉴 선택에 따라 상기 카메라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하는 단계와 상기 안면 인증에 성공한 것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제하는 단계를 포함할 수 있다. 본 개시의 또 다른 측면에 따른 프로필 인증 장치는 프로필 설정 정보를 등록하고, 카메라 촬영된 영상으로부터 사용자 안면을 인식하여 상기 프로필 설정 정보에 상응하는 안면 등록 절차를 수행하고, 상기 안면 등록에 성공 한 프로필을 잠금 설정하고, 특정 메뉴 선택에 따라 상기 카메라를 구동하여 현재 사용자 선택된 프로필에 대한 안면 인증을 수행하고, 상기 안면 인증에 성공한 것에 기반하여 상기 사용자 선택된 프로필의 잠금 설정을 해제 할 수 있다. 실시 예로, 상기 프로필 인증 장치는 상기 잠금 설정이 해제된 것에 기반하여 상기 사용자 선택된 프로필에 상 응하는 개인 맞춤형 사용자 인터페이스 화면을 구성하여 출력할 수 있다. 실시 예로, 상기 프로필 설정 정보는 시청 연령 및 시청 시간을 제한하기 위한 설정 정보 및 성인 콘텐츠 시청 을 제한하기 설정 정보 중 적어도 하나를 포함할 수 있다. 실시 예로, 상기 프로필 인증 장치는 프로필 등록 메뉴가 선택된 것에 기반하여 휴대 전화 번호 입력을 위한 사 용자 인터페이스 화면을 구성하여 출력하고, 사용자 입력된 휴대 전화 번호에 상응하는 프로필 설정 정보 데이 터베이스를 생성하고, 소정 제한 설정 메뉴를 포함하는 프로필 설정 사용자 인터페이스 화면을 구성하여 출력하 고, 사용자 입력된 제한 설정 정보를 상기 프로필 설정 정보 데이터베이스에 등록할 수 있다. 실시 예로, 상기 프로필 설정 사용자 인터페이스 화면은 얼굴 등록 메뉴를 포함하고, 상기 안면 등록 절차는 상 기 얼굴 등록 메뉴 선택에 따라 상기 카메라를 구동하여 수행될 수 있다. 실시 예로, 상기 프로필 인증 장치가 상기 안면 등록에 실패한 것에 기반하여 안면 등록 실패 메시지를 출력하 고, 상기 안면 등록에 실패한 프로필은 잠금 해제 상태가 유지될 수 있다. 실시 예로, 상기 안면 인증은 프로필 자동 전환 모드가 활성화되지 않은 것에 기반하여 상기 사용자 선택된 프 로필만을 대상으로 안면 인증을 수행하는 현재 프로필 안면 인증 절차와 상기 프로필 자동 전환 모드가 활성화 된 것에 기반하여 사전 등록된 전체 프로필을 대상으로 안면 인증을 수행하는 전체 프로필 안면 인증 절차를 포 함할 수 있다. 실시 예로, 상기 전체 프로필 안면 인증 절차는 상기 전체 프로필을 대상으로 안면 인식을 수행하여 자동 전환 대상 프로필을 식별하는 단계와 상기 사용자 선택된 프로필을 상기 식별된 프로필로 자동 전환하는 단계를 포함 할 수 있다. 실시 예로, 상기 현재 프로필 안면 인증 절차 및 상기 전체 프로필 안면 인증 절차 중 어느 하나를 통해 상기 안면 인증에 실패한 것에 기반하여, 상기 프로필 인증 장치가 모든 프로필에 공통으로 적용되는 공용 설정 값을 설정한 후 홈 화면으로 진입시킬 수 있다. 실시 예로, 상기 안면 인증은 외부 서버와의 연동 없이 상기 프로필 인증 장치가 탑재된 셋톱박스 내 안면 인식 엔진을 이용하여 수행될 수 있다. 본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확 하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 인공 지능 기반의 개인 안면 인식을 통한 보안 및 개인화 서비스 제공 방법 및 그를 위한 장치를 제 공하는 장점이 있다. 또한, 본 발명은 개인 안면 인식을 위해 외부 서버와의 별도 연동 없이 셋톱박스가 카메라 촬영된 안면을 직접 인식 및 분석하여 프로필에 대한 보안 및 개인화 서비스를 제공하는 것이 가능한 온-디바이스(On-Device) 안면 인식 기반의 셋톱박스 보안 및 개인화 서비스 제공 방법 및 그를 위한 장치 및 시스템을 제공할 수 있는 장점이 있다. 또한, 본 발명은 별도 서버와의 연동 없이도 프로필 인증 장치가 탑재된 셋톱박스 내 개인 안면 인식 기능을 통 해 자동으로 실제 사용자를 정확하고 빠르게 식별함으로써 개인 보안 및 사용자 편의성을 강화할 수 있는 장점 이 있다. 또한, 본 발명은 개인 안면 인식을 통한 프로필 잠금 설정 및 해제를 통해 종래 비밀 번호 입력 방식에 비해 개 인 프로필에 대한 보안을 강화할 수 있을뿐만 아니라 개인 안면 인식을 통한 프로필 자동 전환을 통해 고객 맞 춤형 개인화 서비스를 보다 빠르고 편리하게 제공할 수 있는 장점이 있다. 본 발명의 또 다른 목적은 인공 지능 기반의 개인 안면 인식을 통해 실제 사용자의 연령대, 성별 등을 자동 식 별함으로써, 미성년자의 성인 콘텐츠 접근을 미연에 방지할 수 있을뿐만 아니라 연령대 및 성별에 맞는 개인 맞 춤형 콘텐츠를 자동으로 제공할 수 있는 장점이 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일부 실시 예들을 예시적인 도면을 통해 상세하게 설명한다. 각 도면의 구성요소들에 참조부호 를 부가함에 있어서, 동일한 구성요소들에 대해서는 비록 다른 도면상에 표시되더라도 가능한 한 동일한 부호를 가지도록 하고 있음에 유의해야 한다. 또한, 본 발명의 실시 예를 설명함에 있어, 관련된 공지 구성 또는 기능 에 대한 구체적인 설명이 본 발명의 실시 예에 대한 이해를 방해한다고 판단되는 경우에는 그 상세한 설명은 생 략한다. 본 발명의 실시 예의 구성 요소를 설명하는 데 있어서, 제 1, 제 2, A, B, (a), (b) 등의 용어를 사용할 수 있 다. 이러한 용어는 그 구성 요소를 다른 구성 요소와 구별하기 위한 것일 뿐, 그 용어에 의해 해당 구성 요소의 본질이나 차례 또는 순서 등이 한정되지 않는다. 또한, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어 를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일 반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가진 것으로 해석되어야 하며, 본 출원에서 명백하게 정의 하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 개시의 다양한 예에서, “/” 및 “,”는 “및/또는”을 나타내는 것으로 해석되어야 한다. 예를 들어, “ A/B”는 “A 및/또는 B”를 의미할 수 있다. 나아가, “A, B”는 “A 및/또는 B”를 의미할 수 있다. 나아가, “A/B/C”는 “A, B 및/또는 C 중 적어도 어느 하나”를 의미할 수 있다. 나아가, “A, B, C”는 “A, B 및/또 는 C 중 적어도 어느 하나”를 의미할 수 있다. 본 개시의 다양한 예에서, “또는”은 “및/또는”을 나타내는 것으로 해석되어야 한다. 예를 들어, “A 또는 B ”는 “오직 A”, “오직 B”, 및/또는 “A 및 B 모두”를 포함할 수 있다. 다시 말해, “또는”은 “부가적으 로 또는 대안적으로”를 나타내는 것으로 해석되어야 한다. 이하, 도 1 내지 도 11을 참조하여, 본 발명의 실시 예들을 구체적으로 설명하기로 한다. 도 1은 종래 비밀 번호 기반의 프로필 잠금 설정 및 해제 방법을 설명하기 위한 도면이다. 도 1을 참조하면, 사용자는 TV 화면에 표시된 프로필 이미지들 중 자신의 프로필 이미지를 선택할 수 있다 (S110). 사용자는 프로필 잠금 비밀 번호 설정 화면에서 잠금 설정 비밀 번호를 설정할 수 있다(S120). 이때, 사용자는 리모콘에 구비된 번호 버튼을 이용하여 비밀 번호를 입력할 수 있다. 사용자는 다중 프로필이 등록된 상태에서 홈 화면에 표시된 잠금 설정된 프로필 이미지 중 잠금 해제하고자 하 는 프로필 이미지를 선택할 수 있다(S130). 사용자는 프로필 잠금 해제 화면에서 선택된 프로필 이미지에 상응하여 기 설정된 잠금 비밀 번호를 입력하여 프로필 잠금 설정을 해제할 수 있다(S140). 이때, 사용자는 리모콘에 구비된 번호 버튼을 이용하여 비밀 번호를 입력할 수 있다. 사용자는 비밀 번호가 기억나지 않아 자신의 프로필에 상응하는 비밀 번호를 재등록 하고자 하는 경우, 삭제 버 튼을 이용하여 프로필 삭제 후 재 등록 절차를 통해 프로필 잠금 비밀 번호를 다시 설정할 수 있다. 이상에서 설명한 바와 같이, 종래의 셋톱박스 프로필 잠금 해제 절차는 홈 화면 진입 단계와 프로필 잠금 해제 화면에서의 잠금 비밀 번호 입력 단계의 2 뎁스 잠금 해제 절차를 제공하므로, 사용자 편의성이 떨어질뿐만 아 니라 프로필 잠금 설정 변경에 따라 TV 시청이 방해되는 문제점이 있었다. 또한, 종래의 셋톱박스에 적용된 보안 기술은 숫자만으로 구성된 비밀 번호가 탈취 및/또는 도용을 통해 타인인 프로필 권한을 쉽게 사용할 수 있으므로 보안에 매우 취약한 문제점이 있었다. 또한, 종래의 셉톱박스에 적용된 보안 기술은 프로필 변경을 위해 홈 화면에 진입한 후 프로필 변경 메뉴를 선 택하여 프로필을 변경해야 하는 불편함이 있었다. 또한, 종래의 셋톱박스에 적용된 보안 기술은 현재 방송 콘텐츠를 시청하는 실제 사용자가 누구인지를 판별하지 않으므로 사용자가 미성년자라도 성인 콘텐츠가 그대로 노출되는 등 현재 시청자에 맞는 개인 맞춤형 서비스를 제공할 수 없는 문제점이 있었다. 도 2는 실시 예에 따른 개인 안면 인식을 통한 보안 및 개인화 서비스 제공을 위한 시스템 구성도이다. 도 2를 참조하면, 시스템은 TV, 카메라, 셋톱박스, 리모콘, 디지털 방송 서버, 안면 인 식 서버 및 통신망을 포함하여 구성될 수 있다. 셋톱박스는 TV와 전용선-예를 들면, HDMI 케이블-을 통해 연결될 수 있으며, 디지털 방송 서버로부 터 수신된 신호를 분리 및 복호하여 TV에 제공할 수 있다. 일 예로, 리모콘은 셋톱박스, TV 및 카메라와 동시에 페어링되어, 무선으로 제어 신호를 셋톱 박스, TV 및 카메라에 전송할 수 있는 통합 리모콘으로서의 기능이 탑재될 수 있다. 다른 일 예로, 리모콘은 셋톱박스 및 카메라에 페어링되며, TV를 제어하기 위한 리모콘(미도시)이 별도 구비될 수도 있다. 다른 일 예로, 리모콘은 셋톱박스에 페어링되고, 셋톱박스는 카메라와 페어링될 수도 있다. 다른 일 예로, 카메라는 TV와 유선 또는 무선으로 연결되고, 카메라에 의해 촬영된 영상은 TV 로 전송될 수 있다. 이때, TV는 카메라에 의해 촬영된 영상을 셋톱박스에 제공할 수 있다. 다른 실시 예에 따른 셋톱박스는 카메라에 의해 촬영된 영상을 무선 통신을 통해 수신할 수도 있으나, 이는 하나의 실시 예에 불과하며, 다른 실시 예에 따른 셋톱박스에는 별도의 유선 연결 단자가 구비되어 카 메라에 의해 촬영된 영상을 유선으로 직접 수신할 수도 있다. 일 예로, 셋톱박스는 블루투스 통신 또는 와이파이 통신을 통해 카메라에 의해 촬영된 영상을 수신할 수 있으나, 이는 하나의 실시 예에 불과하며, 이동통신망-예를 들면, LTE, LTE-A, 5G NR(New Radio Access Technology) 등을 포함함-을 통해 카메라에 의해 촬영된 영상을 수신할 수도 있다. 리모콘은 셋톱박스 및 TV의 전원을 ON/OFF 제어하기 위한 TV 전원 버튼, 카메라 전원을 ON/OFF 제어하기 위한 카메라 전원 버튼, 사용자 음성 명령을 입력 받아 셋톱박스로 전송하기 위한 푸시투 토크(Push-to-Talk) 버튼, 채널 선택 버튼, 음량 조절 버튼, 검색 버튼, 디스플레이 조정 버튼, 외부 입력 제어 버튼, 홈 메뉴 선택 버튼, 설정 버튼 중 적어도 하나를 포함하여 구성될 수 있으나, 이에 한정되지는 않는다. 사용자는 리모콘에 구비된 설정 버튼을 이용하여 홈 화면의 설정 메뉴에 진입할 수 있으며, 사용자는 설정 메뉴의 특정 항목 선택을 통해 프로필 등록/해제 절차, 프로필 별 안면 등록 절차, 안면 인식 기반의 자동 프로 필 전환 설정 절차 등을 수행할 수 있다. 셋톱박스는 마이크 및 스피커가 구비될 수 있으며, 셋톱박스가 활성화된 경우-즉, 음성 인식 기능이 활 성화된 경우-, 마이크를 통해 입력된 사용자 음성 신호를 통신망을 통해 음성 인식 서버로 전송될 수 있다. 음성 인식 서버는 수신된 사용자 음성 신호에 대한 음성 인식을 수행하여 사용자 명령을 식별하고, 식별된 사용자 명령에 상응하는 결과를 통신망을 통해 셋톱박스로 전송할 수 있다. 셋톱박스는 수신된 음 성 인식 결과를 스피커 및/또는 TV 화면을 출력할 수 있다. 실시 예에 따른 사용자는 음성 명령을 통해 카메라의 구동을 제어할 수도 있다. 셋톱박스의 마이크가 음성 인식을 위해 활성화된 상태에서 사용자가 리모콘에 구비된 특정 버튼-예를 들면, Push-to-Talk 버튼-이 누른 경우, 리모콘은 소정 제어 신호를 셋톱박스로 전송하여, 셋톱박스 에 구비된 마이크를 비활성화시킬 수도 있다. 리모콘에 구비된 마이크를 통해 입력된 사용자 음성 명령 은 셋톱박스로 전송될 수 있다. 실시 예로, 셋톱박스가 활성된 경우, 사용자는 소정 음성 명령을 통해 셋톱박스의 개인 안면 인식 기능 을 활성화시킬 수도 있다. 실시 예로, 셋톱박스는 사용자의 메뉴 설정에 따라 개인 안면 인식 기능을 자동 활성화시킬 수도 있다. 일 예로, 셋톱박스는 홈 화면 진입 시 카메라를 자동으로 구동한 후 개인 안면 인식 기능을 활성화시킬 수 있다. 실시 예로, 셋톱박스는 개인 안면 인식을 통해 프로필 잠금 설정, 프로필 잠금 해제 및 프로필 자동 전환 등의 동작을 제어할 수 있다. 실시 예에 따른 셋톱박스는 인공 지능 기반의 개인 안면 인식 엔진이 탑재되어 카메라에 의해 촬영된 사용자 얼굴 이미지에 기반하여 개인 안면 인식을 수행하는 프로필 인증 장치(미도시)가 구비될 수 있다. 이하 의 실시 예에 따른 설명에서는 인공 지능에 기반한 개인 안면 인식을 통해 프로필 잠금 제어 및 프로필 자동 전 환을 수행하고, 식별 또는 전환된 프로필에 상응하는 개인 맞춤형 콘텐츠를 제공하는 주체를 셋톱박스를 예 를 들어 설명하고 있으나, 이는 하나의 실시 예에 불과하며, 다른 실시 예는 셋톱박스 또는 사용자 단말(미 도시)에 장착 또는 탑재된 프로필 인증 장치를 통해 해당 기능들이 수행될 수도 있다. 실시 예로, 이하의 실시 예에서는 셋톱박스에 의해 생성된 화면 및/또는 메시지가 TV 화면을 통해 출력 되는 것으로 설명되고 있으나, 이는 하나의 실시 예에 불과하며, 프로필 인증 장치가 사용자 단말에 탑재된 경 우, 프로필 인증 장치에 의해 구성된 화면 및/또는 메시지가 사용자 단말의 화면에 출력될 수도 있다. 셋톱박스는 개인 안면 인식을 통해 사용자를 식별하고, 식별된 사용자에 상응하는 프로필 잠금 설정을 자동 해제할 수 있다.또한, 셋톱박스는 개인 안면 인식을 통해 사용자의 연령대 및 성별을 식별하고, 식별된 연령대 및 성별에 상응하는 개인 맞춤형 콘텐츠를 적응적으로 구성하여 제공할 수 있다. 일 예로, 셋톱박스는 개인 안면 인식을 통해 사용자의 연령대가 미성년자로 판단되는 경우, TV 화면에 성인 콘텐츠가 노출되는 것을 차단할 수 있다. 일 예로, 셋톱박스는 개인 안면 인식을 통해 성별이 식별된 경우, 식별된 성별에 상응하는 추천 콘텐츠 화 면을 생성하여 TV 화면에 출력할 수도 있다. 일 예로, 셋톱박스는 개인 안면 인식을 통해 사용자가 식별된 경우, 식별된 사용자의 과거 TV 채널 선택 이 력 및 VOD 등의 콘텐츠 재생 이력 등에 기초하여 콘텐츠 이어 보기, 추천 채널 정보 및 추천 VOD 콘텐츠 정보 를 생성할 수 있으며, 생성된 정보를 TV 화면에 출력할 수도 있다. 일 예로, 셋톱박스는 개인 안면 인식을 통한 사용자 식별이 실패한 경우, 음성 키워드에 기반한 사용자 식 별을 자동으로 수행할 수도 있다. 이를 위해, 셋톱박스에는 인공 지능 기반의 음성 키워드 인식 엔진이 탑 재될 수 있다. 일 예로, 셋톱박스는 음성 키워드 인식에 실패한 경우, 비밀 번호 기반의 사용자(프로필) 잠금 해제 화면으 로 자동 전환시킬 수도 있다. 실시 예에 따른, 셋톱박스는 개인 안면 인식, 음성 키워드 인식 및 비밀 번호 확인에 모두 실패한 경우, 소 정 경고 알람 메시지를 생성하여 사전 등록된 사용자의 단말로 전송할 수 있다. 다른 실시 예로, 셋톱박스는 개인 안면 인식, 음성 키워드 인식 및 비밀 번호 확인 중 적어도 하나에 실패 한 경우, 해당 실패에 상응하는 경고 알람 메시지를 생성하여 사전 등록된 사용자의 단말로 전송할 수도 있다."}
{"patent_id": "10-2022-0080274", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "실시 예로, 음성 키워드 인식에 사용되는 음성 키워드는 모든 사용자에 대해 동일하도록 구현될 수 있으나, 이 는 하나의 실시 예에 불과하며, 사용자 설정에 따라 사용자 별 서로 상이한 음성 키워드가 등록되어 사용될 수 도 있다. 일 예로, 프로필 잠금 설정을 위한 음성 키워드는 \"프로필 잠금 설정해줘\", 프로필 잠금 해제를 위한 음성 키워 드는 \"프로필 잠금 해제해줘\", 프로필 전환을 위한 음성 키워드는 \"프로필 전환해줘\"로 사전 정의될 수 있으나, 이는 하나의 실시 예에 불과하며, 각 사용자가 각 동작에 상응하는 음성 키워드를 각자 사전 선택 또는 입력하 여 등록할 수도 있다. 실시 예로, 사용자는 자신의 프로필이 잠금 설정된 상태에서, 리모콘의 특정 버튼을 누른 상태에서 사전 정 의된 잠금 키워드를 발화하여 해당 프로필의 잠금 설정을 해제할 수 있다. 여기서, 잠금 키워드 입력을 위한 특 정 버튼-예를 들면, 지우기 버튼-이 눌려지면, 리모콘의 마이크는 활성화되고, 셋톱박스의 마이크는 해 당 특정 버튼이 눌려져 있는 동안 비활성화될 수 있다. 실시 예로, 잠금 키워드 입력을 위한 리모콘 버튼은 당업자의 설계에 따라 상이한 버튼으로 사전 정의되거나 소정 설정 메뉴를 통해 변경될 수 있다. 다른 실시 예로, 사용자는 자신의 프로필이 잠금 설정된 상태에서 홈 화면의 프로필 변경 메뉴를 선택한 후 리 모콘의 특정 버튼-예를 들면, 지우기 버튼-을 누른 상태에서 사전 정의된 잠금 키워드를 발화하여 해당 프 로필에 대한 잠금 설정을 해제할 수 있다. 여기서, 잠금 키워드 입력을 위한 특정 버튼이 눌려지면, 리모콘(3 0)의 마이크는 활성화되고, 셋톱박스의 마이크는 해당 특정 버튼이 눌려져 있는 동안 비활성화될 수 있다. 또 다른 실시 예로, 사용자는 자신의 프로필이 잠금 설정된 상태에서 홈 화면의 프로필 변경 메뉴를 선택한 후 리모콘의 특정 버튼을 누르지 않은 상태에서 잠금 키워드를 발화하여 해당 프로필의 잠금 설정을 해제할 수 도 있다. 이 경우, 사용자에 의해 발화된 음성은 셋톱박스의 마이크에 직접 입력되어 바로 감지될 수 있으 며, 셋톱박스는 입력된 사용자 음성이 미리 설정된 또는 사전 등록된 잠금 키워드인 경우, 해당 사용자의 프로필에 대한 잠금 설정을 해제할 수 있다. 실시 예로, 잠금 키워드에 대한 사용자 별 음성 녹음 파일이 셋톱박스의 소정 기록 영역에 사전 등록되어 유지될 수 있다. 복수의 프로필에 대한 잠금 설정이 해제된 상태에서 셋톱박스는 사용자 발화된 잠금 키워 드를 음성 인식할 수 있다. 셋톱박스는 인식된 잠금 키워드에 상응하여 사용자 별 사전 등록된 음성 녹음 파일을 비교/분석하여 해당 잠금 키워드를 발화한 화자를 인증 및 식별할 수 있다. 셋톱박스는 인증 및 식별된 화자의 프로필에 상응하는 고객 맞춤형 화면을 구성할 수 있다. 실시 예로, 고객 맞춤형 화면은 사용자 별 사전 수집된 서비스 이용 데이터 및 통계에 기반하여 동적으로 구성 될 수 있다. 일 예로, 고객 맞춤형 화면은 콘텐츠 이어보기 정보, 추천 콘텐츠 큐레이션 이미지, 추천 장르에 관한 정보 등을 포함할 수 있으나, 이에 한정되지는 않는다. 상술한 시스템을 통해, 본원 발명은 TV 시청 중에도 프로필 변경이 필요한 경우, 홈 화면에 진입하지 않고, 사용자가 리모콘의 특정 버튼을 누르거나, 또는 특정 버튼을 누른 후 잠금 키워드를 발화하여 자신의 프로 필로 즉시 변경함으로써, 개인 맞춤형 서비스를 제공받을 수 있는 장점이 있다. 또한, 본원 발명은 종래 홈 화면 진입->프로필 변경 메뉴 선택의 2 뎁스(depth) 프로필 변경이 아닌 개인 안면 인식 및/또는 음성 키워드 인식을 통한 1 뎁스 프로필 변경이 가능하므로 유저 시나리오를 보다 개선할 수 있는 장점이 있다. 도 3은 실시 예에 따른 개인 안면 인식을 통한 보안 및 개인화 서비스 제공을 위한 IPTV 시스템 구성도이다. 도 3을 참조하면, IP TV 시스템은 TV, 카메라, 셋톱박스, 리모콘, 서버, 사용자 단 말 및 통신망을 포함하여 구성될 수 있다. 본 개시의 프로필 인증 장치가 탑재된(또는 프로필 인증 수단이 구비된) 셋톱박스는 TV와 전용 케이 블-예를 들면, HDMI 케이블-을 통해 연결될 수 있으며, 랜선을 통해 통신망에 연결되어 서버와 각종 정보를 교환할 수 있다. 일 예로, 서버는 디지털 방송 정보를 제공하는 디지털 방송 서버, VOD, 게임, 음 원 등 다양한 콘텐츠를 제공하는 콘텐츠 서버 및 음성 인식 엔진, 검색 엔진 등 다양한 클라우드 기반의 분산 연산 처리를 수행하는 클라우드 서버 중 적어도 하나를 포함할 수 있으나, 이에 한정되지는 않는다. 일 예로, 리모콘은 셋톱박스, TV 및 카메라의 구동을 제어하기 위해 사용될 수 있다. 카메라는 TV와 일체형으로 구성될 수 있으나, 이는 하나의 실시 예에 불과하며, 다른 실시 예에 따른 카메라는 유선 또는 무선으로 TV 또는 셋톱박스와 연결되고, 카메라에 의해 촬영된 영상은 TV 또는 셋톱박스로 전송될 수 있다. 이때, 카메라가 TV에 일체형으로 장착되어 있거나 TV에 유선 또는 무선으로 연결된 경우, 카메라에 의해 촬영된 영상은 TV로부터 셋톱박스에 제공할 수 있다. 만약, 카메라가 유선 또는 무선으로 셋톱박스에 연결된 경우, 카메라에 의해 촬영된 영상은 셋 톱박스에 의해 TV의 화면 일측에 표시될 수 있다. 일 예로, 셋톱박스는 근거리 무선 통신(블루투스 통신 또는 와이파이 통신)을 통해 카메라와 연결되 어 카메라에 의해 촬영된 영상을 수신할 수 있으나, 이는 하나의 실시 예에 불과하며, 이동통신망-예를 들 면, LTE, LTE-A, 5G NR(New Radio Access Technology) 등을 포함함-을 통해 카메라에 의해 촬영된 영상을 수신할 수도 있다. 리모콘은 셋톱박스 및 TV의 전원을 ON/OFF 제어하기 위한 TV 전원 버튼, 카메라 전원을 ON/OFF 제어하기 위한 카메라 전원 버튼, 사용자 음성 명령을 입력 받아 셋톱박스로 전송하기 위한 푸시투 토크(Push-to-Talk) 버튼, 채널 선택 버튼, 음량 조절 버튼, 검색 버튼, 디스플레이 조정 버튼, 외부 입력 제어 버튼, 홈 메뉴 선택 버튼, 설정 버튼 중 적어도 하나를 포함하여 구성될 수 있으나, 이에 한정되지는 않는다. 사용자는 리모콘에 구비된 설정 버튼을 이용하여 IPTV 홈 화면의 설정 메뉴에 진입할 수 있으며, 사용자는 설정 메뉴의 특정 항목 선택을 통해 프로필 키 값 등록 절차, 프로필 잠금 비밀 번호 등록/해제 절차, 기본 프 로필 정보 설정 절차, 초기 프로필 안면 등록 절차, 프로필 안면 등록 해제 절차, 프로필 안면 재등록 절차 및 안면 인식 기반의 자동 프로필 전환 설정 절차 중 적어도 하나를 수행할 수 있다. 셋톱박스는 마이크 및 스피커가 구비될 수 있으며, 셋톱박스가 구동되어 음성 인식 기능이 활성화된 경우, 셋톱박스는 마이크를 통해 입력된 사용자 음성 신호를 통신망을 통해 서버로 전송할 수 있다. 서버는 수신된 사용자 음성 신호에 대한 음성 인식을 수행하여 사용자 명령을 식별하고, 식별된 사 용자 명령에 상응하여 처리된 결과를 통신망을 통해 셋톱박스로 전송할 수 있다. 셋톱박스는 수 신된 음성 인식 결과를 스피커 및/또는 TV 화면을 통해 출력할 수 있다. 실시 예에 따른 사용자는 음성 명령을 통해 카메라의 구동을 제어할 수 있으나, 이는 하나의 실시 예에 불 과하며, 다른 실시 예에 따른 카메라는 IPTV 앱 구동 후 사용자 메뉴 선택에 따라 셋톱박스에 자동으로 구동될 수 있다. 일 예로, 셋톱박스는 “마이” 메뉴 선택, “실시간 TV “메뉴 선택, “VOD 홈” 메뉴 선택, “프로필 설정” 메뉴 선택, “사용자 인증” 메뉴 선택 및 “VOD 콘텐츠” 선택 등의 동작을 감지하면 자동으로 카메라를 구동하여 사용자 안면 인식을 수행할 수 있다. 실시간으로 사용자의 안면을 인식하여 사용자를 인증하거나 사용자를 식별하여 프로필을 자동 전환하는 기능의 적용 화면(또는 메뉴) 범위는 당업자의 설계에 따라 변경될 수 있다. 실시 예에 따른 셋톱박스는 프로필 자동 전환 모드가 비활성화된 경우, 카메라에 의해 촬영되어 입력 된 얼굴 이미지 파일을 탑재된 안면 인식 엔진을 통해 분석하여 안면 특징 데이터를 실시간 추출하고, 현재 프 로필에 상응하여 사전 등록된 안면 특징 데이터와 추출된 안면 특징 데이터를 비교/분석하여 현재 프로필에 대 한 사용자 인증을 수행할 수 있다. 만약, 사용자 인증에 실패한 경우, 셋톱박스는 안면 인식에 실패하였음 을 알리는 소정 경고 알림 메시지를 TV 화면 일측에 출력할 수 있다. 만약, 사용자 인증에 성공한 경우, 셋톱박스는 별도 안면 인식 성공을 알리는 UI를 출력하지 않고 해당 메뉴 선택에 따른 동작을 수행할 수 있다. 또한, 실시 예에 따른 셋톱박스는 프로필 자동 전환 모드가 활성화된 경우, 카메라에 의해 촬영되어 입력된 얼굴 이미지 파일을 탑재된 안면 인식 엔진을 통해 분석하여 안면 특징 데이터를 실시간 추출하고, 모든 프로필에 대해 사전 등록된 안면 특징 데이터와 추출된 안면 특징 데이터를 비교/분석하여 현재 사용자에 상응 하는 프로필을 식별하고, 식별된 프로필을 활성화시킬 수 있다. 만약, 사용자 식별에 실패한 경우, 셋톱박스 는 안면 인식에 실패하였음을 알리는 소정 경고 알림 메시지를 TV 화면 일측에 출력할 수 있다. 만약, 사용자 식별에 성공한 경우, 셋톱박스는 별도 안면 인식 성공을 알리는 UI를 출력하지 않고, 식별된 프로필을 현재 프로필로 활성화시킬 수 있다. 실시 예에 따른 셋톱박스는 새로운 프로필 등록 시(또는 기 등록된 프로필 변경 시) 사용자의 휴대 전화 번호를 키 값으로 프로필을 등록 또는 갱신할 수 있다. 물론, 프로필에 상응하는 안면 특징 데이터도 해당 휴대 전화 번호를 키 값으로 데이터베이스화하여 셋톱박스 내부에 저장되어 유지될 수 있다. 실시 예에 다른 셋톱박스는 새로운 프로필 등록 시 입력된 휴대 전화 번호에 상응하는 사용자 단말과 통신 채널을 설정하고, 설정된 통신 채널을 통해 사용자 단말에 구비된 카메라(미도시)에 의해 촬영된 사 용자의 안면 이미지 파일을 수신할 수도 있다. 셋톱박스는 사용자 단말로부터 수신된 사용자의 안면 이미지 파일을 탑재된 안면 인식 엔진을 통해 분석하여 안면 특징 데이터를 추출하고, 추출된 안면 특징 데이터를 해당 휴대 전화 번호를 키 값으로 설정하여 내부 데이터베이스에 저장할 수 있다. 일 예로, 안면 인식 엔진은 매우 많은 수의 층(Layer)으로 구성된 깊은 신경망 구조를 대용량의 데이터를 이용한 사전 학습시키는 딥러닝 기술에 기반으로 구현될 수 있으나, 이에 한 정되지는 않는다. 도 4는 본 개시의 실시 예에 따른 안면 인식 엔진의 동작을 설명하기 위한 도면이다. 실시 예에 따른 안면 인식 엔진은 셋톱박스 내 탑재될 수 있으나, 이는 하나의 실시 예에 불과하며, 스마트폰, 랩탑 등과 같은 사용자 단말에 탑재될 수도 있다. 상세하게, 도 4는 안면 인식 파이프라인(pipeline)을 설명하기 위한 도면이다. 도 4를 참조하면, 안면 인식 엔진은 크게 학습 파이프 라인과 검증 파이프 라인으로 구성될 수 있다. 검증 파이프 라인은 학습 파이프 라인에 의해 학습된 모델에 기반하여 안면 인증 및 식별 동작을 수 행할 수 있다. 안면 인식 엔진은 상기 도 4에 도시된 바와 같이 사전 수집된 훈련 영상 데이터셋 또는 검증 영상 데 이터셋으로부터 입력 정지 영상 또는 비디오 내에 존재하는 얼굴 영역을 검출하는 얼굴 검출부(412, 422) 와 검출된 얼굴 영역에서 추출된 랜드마크(Landmarks) 정보를 이용한 얼굴 정렬, 광도 보정, 그리고 영상 정규 화 같은 전처리를 수행하는 얼굴 전처리부(413, 423)와 전처리된 얼굴 영상으로부터 특징(Feature)을 추출하는 특징추출부(414, 415)와 추출된 특징을 이용하여 학습 단계에서는 분류 모델을 학습시키는 분류모델학습부(41 5)와 검증 단계에서는 학습 모델을 이용하여 안면을 분류 및 식별하여 사용자 인증 및 사용자 식별을 수행 하는 분류 및 식별부를 포함하여 구성될 수 있다. 특징 추출부(414, 424)는 얼굴 영역 내의 지역적인 특징을 효과적으로 추출하기 위하여 다수의 층으로 구성된 국소 연결(Locally Connected) 컨볼루션 신경망으로 구현될 수 있다. 얼굴 인식 엔진은 응용에 따라 크게 얼굴 검증(Face Verification) 엔진과 얼굴 식별(Face Identification) 엔진으로 구분될 수 있다. 얼굴 검증 엔진은 입력으로 들어오는 두 개의 얼굴 영상을 비교/분석하여 동일 인물인지 여부를 판단하는 1:1 검증 동작을 수행하고, 얼굴 식별 엔진은 입력으로 들어오는 하나의 얼굴 영상과 사전에 등록된 N명의 얼굴 영 상을 비교/분석하여 해당 얼굴 영상이 어떤 인물에 해당하는지를 판단하는 1:N의 검증 동작을 수행할 수 있다. 얼굴 식별 엔진은 학습된 모델을 이용하여 검증의 대상이 되는 프로브(Probe) 영상-예를 들면, TV 카메라에 의 해 촬영된 사용자 얼굴 영상-과 사전에 등록된 N명에 대한 갤러리(Gallery) 영상-즉, 사전 등록된 N명의 프로필 에 상응하는 N개의 얼굴 영상-을 비교하는 동작을 수행한다. 딥러닝 기반의 얼굴 인식 기술은 특징 추출과 분류 모델 학습을 다양한 환경에서 구축한 대용량의 얼굴 데이터 를 이용하여 End-to-End로 학습함에 따라 매우 고차원적인 특징을 스스로 학습할 수 있다. 이에 따라 와일드 환 경에서의 얼굴 인식 성능은 매우 높으며, 사람의 인지 능력을 뛰어넘는 성능을 제공할 수 있는 장점이 있다. 도 5는 실시 예에 따른 프로필 안면 등록 절차를 설명하기 위한 도면이다. 도 5를 참조하면, 사용자는 IPTV 앱의 마이메뉴 화면상에서 프로필 등록 버튼을 이용하여 새로운 프 로필을 등록할 수 있다. 여기서, 등록된 프로필에 대한 정보는 셋톱박스내에 유지될 수 있다. 사용자는 프로필 등록 버튼을 이용하여 새로운 프로필에 상응하는 프로필 키 값을 등록할 수 있다. 일 예 로, 프로필 키 값은 사용자의 휴대폰 번호일 수 있으나, 이에 한정되지는 않으며, 당업자의 설계에 따라 아이디, 이메일, 일반 전화 번호 등의 다른 정보가 프로필 키 값으로 사용될 수도 있다. 사용자의 휴대 전화 번호가 등록되면, 해당 휴대 전화 번호에 상응하여 새로 추가된 프로필 이미지 및 설 정 버튼이 마이메뉴 화면에 표시될 수 있다. 설정 버튼이 선택되면, 프로필 설정 팝업 UI가 출력될 수 있다. 프로필 설정 팝업 UI는 설정 메뉴 버튼 표시 영역과 메뉴 별 상세 설정 화면 표시 영역을 포함할 수 있다. 설정 메뉴 버튼 표시 영역에는 시청 연령 제한 설정 버튼, 성인 콘텐츠 제안 설정 버튼 및 얼굴 등록 하기 버튼이 표시될 수 있다. 얼굴 등록하기 버튼이 선택되면, 화면 일측에는 안면 등록 팝업 UI가 출력될 수 있다. 안면 등록 팝업 UI는 프로필 잠금 설정을 위해 얼굴 등록이 진행됨을 알리는 안내 메시지 표시 영역 및 카메라에 의해 촬영된 영상이 표시되는 카메라 영상 표시 영역을 포함할 수 있다. 얼굴 등록하기 버튼이 선택되면, 셋톱박스는 자동으로 카메라를 구동시킬 수 있다. 셋톱박스는 카메라에 의해 촬영된 영상 내 얼굴을 인식하고, 인식된 얼굴 영상으로부터 특징을 추출하여 안면 특징 데이터를 추출할 수 있다. 안면 특징 데이터가 정상적으로 추출된 경우, 셋톱박스는 안면 등록 확인 UI를 출력할 수 있다. 안면 등록 확인 UI는 사용자의 안면 등록 수락을 위한 확인 버튼과 사용자의 안면 등록 취소를 위한 취소 버튼을 포함할 수 있다. 시청 연령 제한 설정 버튼 및 성인 콘텐츠 제안 설정 버튼 선택에 따른 동작은 후술할 도 6을 통해 상세히 설명하기로 한다. 도 6은 실시 예에 따른 프로필 설정 팝업 UI의 구성을 설명하기 위한 도면이다. 도 6을 참조하면, 프로필 설정 팝업 UI에서 사용자가 시청 연령 제한 설정 버튼을 선택하면, 도면 번 호 610에 보여지는 바와 같이, 콘텐츠 시청 제한 등급(연령)을 설정하기 위한 선택 메뉴가 표시될 수 있다. 여 기서, 시청 제한 등급은 제한 없음 등급, 19세 이상 등급, 15세 이상 등급, 12세 이상 등급, 7세 이상 등급 및 키즈 등급으로 구분될 수 있다. 본 개시의 실시 예에 따른 셋톱 박스는 시청 제한 등급이 제한 없음으로 선택된 경우, 해당 프로필은 부모 프로 필인 것으로 판단하고, 나머지 등급으로 선택된 경우, 자녀 프로필인 것으로 판단할 수 있다. 프로필 설정 팝업 UI에서 사용자가 성인 컨텐츠 제한 설정 버튼을 선택하면, 도면 번호 620에 도시된 바와 같이, 성인 콘텐츠의 숨김 여부를 설정하기 위한 선택 메뉴가 표시될 수 있다. 실시 예에 따른 셋톱 박스는 성인 콘텐츠 제한은 부모 프로필에게만 설정 권한이 부여되도록 구현될 수 있으나, 이는 하나의 실시 예에 불과하며, 부모 프로필 및 19세 이상으로 시청 연령 제한이 설정된 프로필에게만 설정 권한이 부여되도록 구현될 수 있다. 이때, 나머지 프로필의 경우, 디폴트로 성인 콘텐츠 숨김으로 설정될 수 있 다. 성인 콘텐츠 제한 설정에 따라, 셋톱박스는 안면 인식을 통해 성인 콘텐츠 노출이 제한된 프로필로 전환되면 자 동으로 해당 프로필에 대한 성인 콘텐츠를 일괄 비노출로 처리할 수 있다. 일 예로, 프로필 자동 전환 모드가 활성화된 상태에서, 안면 인식을 통해 프로필이 전환되는 경우, 셋톱박스는 전환 대상 프로필의 이전 시청 이력을 기반으로 화면에 이전에 시청 중이던 콘텐츠를 노출시키거나 이어보기를 제안하는 UI를 생성하여 디바이스 화면에 출력할 수 있다. 다른 일 예로, 프로필 자동 전환 모드가 활성화된 상태에서, 안면 인식을 통해 프로필이 전환된 경우, 셋톱박스 는 전환 대상 프로필이 선호하는 장르에 상응하는 콘텐츠를 추천하는 소정 UI를 생성하여 디바이스 화면에 노출 시킬 수 있다. 도 7은 본 개시의 실시 예에 따른 프로필 등록 절차를 설명하기 위한 흐름도이다. 상세하게, 도 7은 셋톱박스에 탑재된 IPTV 메인 APP을 통해 안면 등록을 포함한 사용자 프로필을 등록하는 절차 를 설명하기 위한 도면이다. 이하 설명의 편의를 IPTV 메인 APP을 간단히, “APP’이라 명하여 설명하기로 한다. 실시 예에 따른 셋톱박스는 APP과 연동되어 일련의 사용자 프로필 등록 절차를 수행하는 프로필 등록 모듈을 포 함할 수 있다. 프로필 등록 모듈은 안면 로그인 관리 모듈과 프로필 설정 모듈을 포함하여 구성될 수 있다. 안면 로그인 관린 모듈은 프로필 별 안면 등록 절차 및 안면 인증 절차를 수행할 수 있다. 프로필 설정 모듈은 프로필 등록/삭제/ 갱신 동작을 수행하고, 프로필 설정 정보를 데이터베이스화하여 관리할 수 있다. 프로필 설정 모듈은 사용자의 휴대 전화 번호를 키 값으로 프로필 설정 정보를 관리할 수 있다. 도 7을 참조하면, IPTV 메인 APP의 홈 화면상에서 사용자에 의해 마이 메뉴가 선택되면, 셋톱박스는 마이메뉴 화면으로 진입하고, 마이메뉴 화면상의 프로필 등록 메뉴를 선택받을 수 있다(S701 내지 S702). APP은 프로필 등록 메뉴가 선택되면, 휴대전화 번호 입력 UI를 팝업 화면으로 구성하여 출력할 수 있다(S703). APP은 사용자 입력된 휴대전화 번호를 프로필 설정 모듈-상세하게, 안면 로그인 관린 모듈-로 전송할 수 있다 (S704). 프로필 설정 모듈은 수신된 휴대전화 번호에 상응하는 프로필 설정 정보 DB를 생성한 후 휴대폰 번호 설정 완료 메시지를 APP으로 전송할 수 있다(S705 내지 S706). APP은 휴대폰 번호 설정이 완료되면, 프로필 설정 UI 팝업 화면을 구성하여 마이 메뉴 화면의 일측에 출력할 수 있다(S707). APP은 사용자에 의해 제한 설정 메뉴가 설정된 경우, 해당 제한 설정 메뉴에 상응하는 선택 메뉴를 프로필 설 정 UI 팝업 화면의 일측에 출력할 수 있다(S708). 일 예로, 제한 설정 메뉴는 상술한 시청 연령 제한 설정 메뉴 및 성인 콘텐츠 제한 설정 메뉴를 포함할 수 있다. APP은 선택된 제한 설정 메뉴에 상응하여 사용자 입력된 제한 설정 정보를 프로필 설정 모듈로 전송할 수 있다 (S709). 프로필 설정 모듈은 수신된 제한 설정 정보를 기 등록된 휴대전화 번호에 상응하여 생성된 프로필 설정 정보 DB에 저장할 수 있다(S710). 이때, 프로필 설정 모듈은 제한 설정 정보가 정상 등록되었음을 알리는 소정 응답 메시지를 APP으로 전송할 수 있다. 실시 예에 따른 프로필 설정 모듈은 시청 연령 제안 등급을 기반으로 해당 프로필이 부모인지 자녀인지를 판단 하고, 판단 결과를 해당 프로필 설정 정보 DB에 저장할 수도 있다(S711). 일 예로, 프로필 설정 모듈은 시청 제한 등급이 제한 없음으로 선택된 경우, 해당 프로필은 부모 프로필인 것으 로 판단하고, 나머지 등급으로 선택된 경우, 자녀 프로필인 것으로 판단할 수 있다. APP은 프로필 설정 UI 팝업 화면상에서 얼굴 등록 메뉴가 선택된 경우, 안면 로그인 관리부로 안면 등록을 요청 할 수 있다(S712 내지 S713). 안면 로그인 관리 모듈은 카메라 촬영된 영상으로부터 사용자의 안면을 인식하고, 인식된 안면의 특징을 추출하 여 안면 특징 데이터를 생성할 수 있다(S714). 여기서, 안면 특징 데이터는 사전 학습된 안면 인식 엔진을 이용하여 추출될 수 있다. 안면 인식 엔진의 구체적 인 구성 및 동작은 상기 도 4의 설명으로 대체한다. 안면 로그인 관리 모듈은 해당 프로필에 상응하는 안면 등록이 정상 완료되었음을 지시하는 소정 응답 메시지를 APP으로 전송할 수 있다(S716). APP은 안면 등록이 정상적으로 완료된 경우, 얼굴 등록 완료 토스트 팝업 화면을 구성하여 출력할 수 있다 (S717). APP은 안면 등록이 완료된 경우, 해당 프로필에 대한 프로필 잠금 설정을 수행하고, 프로필 등록이 완료되었음 을 알리는 프로필 등록 완료 토스트 팝업 화면을 출력할 수 있다(S718 내지 S720). 만약, 안면 등록이 완료되지 않았거나 안면 등록에 실패한 경우, APP은 안면 등록이 정상적으로 완료되었음을 지시하는 안면 등록 실패 메시지를 출력하고(S721) 상술한 707 단계로 회귀할 수 있다. 도 8은 본 개시의 실시 예에 따른 안면 인식 기반 프로필 자동 전환 절차를 설명하기 위한 도면이다. 도 9는 본 개시의 실시 예에 따른 안면 등록 안내 팝업 UI를 보여준다. 도 10은 본 개시의 실시 예에 따른 프로필 등록 안내 팝업 UI를 보여준다. 실시 예에 따른 APP은 도 8에 도시된 바와 같이 ‘마이 메뉴’, ‘실시간TV’, ‘VOD홈’, ‘VOD콘텐츠 선택‘, ‘설정’ 및 ’사용자 인증’ 중 어느 하나의 메뉴가 사용자에 의해 선택되면 해당 메뉴로의 진입과 동시에 카 메라 구동 후 사용자의 얼굴을 촬영하여 해당 사용자에 대한 안면 인식을 수행할 수 있다. 셋톱박스는 프로필 자동 전환 모드가 비활성화되어 있고, 현재 프로필이 잠금 설정되어 있는 경우, 실시간 촬영 된 카메라 영상으로부터 인식된 사용자의 안면과 현재 프로필에 상응하여 기 등록된 안면의 일치 여부를 판단할 수 있다. 판단 결과, 일치하는 경우, 셋톱박스는 별도의 알림 없이 사용자 선택된 메뉴에 대응하는 화면을 구성하여 출력 하고, 일치하지 않는 경우, 현재 프로필에 상응하는 안면 인식에 실패하였음을 지시하는 소정 경고 알람 메시지 를 출력할 수 있다. 실시 예에 따른 셋톱박스는 현재 카메라 촬영된 사용자의 안면과 현재 프로필의 안면이 일치하지 않는 경우, 후 술할 도 9에 도시된 바와 같이, 새로운 프로필 등록을 요청하는 소정 프로필 등록 안내 팝업 UI를 생성하 여 출력할 수 있다. 도 9를 참조하면, 프로필 등록 안내 팝업 UI는 상술한 프로필 등록 메뉴를 바로 선택하기 위한 프로 필 등록 바로 가기 버튼을 포함하여 구성될 수 있다. 셋톱박스는 프로필 자동 전환 모드가 활성화되어 있는 경우, 실시간 촬영된 카메라 영상으로부터 실시간으로 인 식된 사용자의 안면과 기 등록된 모든 사용자의 안면을 비교하여 전환 대상 프로필을 식별할 수 있다. 셋톱박스 는 기 등록된 모든 프로필의 안면 중 현재 카메라 촬영된 사용자의 안면과 일치하는 프로필이 식별된 경우, 별 도의 알림 없이 식별된 프로필로 프로필 자동 전환을 수행한 후 사용자 선택된 메뉴 화면을 구성하여 출력할 수 있다. 만약, 기 등록된 모든 프로필의 안면 중 현재 카메라 촬영된 사용자의 안면과 일치하는 프로필 식별에 실패한 경우, 셋톱박스는 안면 인식 기반 프로필 전환에 실패하였음을 알리는 소정 경고 알람을 출력하고, 현재 화면을 그대로 유지시킬 수 있다.실시 예에 따른 셋톱박스는 현재 카메라 촬영된 사용자의 안면과 일치하는 프로필 식별에 실패한 경우, 후술할 도 10에 도시된 바와 같이, 사용자의 안면 등록을 요청하는 소정 안면 등록 안내 팝업 UI를 생성하여 화면 에 출력할 수 있다. 도 10을 참조하면, 안면 등록 안내 팝업 UI는 상술한 얼굴 등록 하기 메뉴를 바 로 선택하기 위한 안면 등록 바로 가기 버튼을 포함하여 구성될 수 있다. 본 개시의 다른 실시 예에 따른 셋톱박스는 프로필 자동 전환 모드가 활성화되어 있고, 현재 프로필이 잠금 설 정되어 있는 경우, 우선 실시간 촬영된 카메라 영상으로부터 실시간으로 인식된 사용자의 안면과 현재 프로필에 상응하여 기 등록된 안면의 일치 여부를 판단할 수 있다. 만약, 카메라 촬영 영상으로부터 실시간 인식된 사용 자 안면과 현재 프로필 안면이 일치하지 않는 경우, 셋톱박스는 카메라 촬영 영상으로부터 실시간 인식된 사용 자 안면과 기 등록된 모든 프로필에 대한 안면을 비교하여 전환 대상 프로필을 식별할 수도 있다. 이때, 프로필 전환에 실패한 경우, 셋톱박스는 상술한 프로필 등록 안내 팝업 UI을 생성하여 출력할 수 있다. 실시 예에 따른 안면 등록 안내 팝업 UI 및/또는 프로필 등록 안내 팝업 UI는 해당 팝업 UI를 종료하 기 위한 종료 버튼(미도시)을 더 포함할 수 있다. 만약, 사용자에 의해 종료 버튼이 선택되면, 셋톱박스는 공용 설정 값으로 설정한 후 홈 화면으로 진입할 수 있다. 도 11은 본 개시의 실시 예에 따른 안면 인식 기반 프로필 인증 절차를 설명하기 위한 흐름도이다. 도 11을 참조하면, APP은 프로필이 선택된 후 화면상에서의 특정 메뉴가 선택되면 현재 프로필이 잠금 설정되었 는지 판단할 수 있다(S1101 내지 S1103). APP은 현재 프로필이 잠금 설정되어 있는 경우, 프로필 자동 전환 모드가 활성화되었는지 판단할 수 있다 (S1104). APP은 프로필 자동 전환 모드가 활성화되지 않은 경우, 프로필 등록 모듈과 연동하여 현재 프로필에 대한 안면 인증 절차를 수행할 수 있다(S1105). APP은 현재 프로필에 대한 안면 인식에 성공한 경우, 사용자 선택된 메뉴 화면으로 진입할 수 있다(S1106 및 S1112). 만약, 현재 프로필에 대한 안면 인식에 실패한 경우, APP는 공용 설정 값 설정 절차를 수행하여 홈 화면에 진입 할 수 있다(S1116 내지 S1117). 상기 1104 단계의 판단 결과, 프로필 자동 전환 모드가 활성화된 경우, APP는 전체 프로필에 대한 안면 인증 절 차를 수행할 수 있다(S1107). 전체 프로필 안면 인증 절차를 수행한 결과, 전환 대상 프로필이 식별된 경우, APP은 현재 프로필을 식별된 프 로필로 자동 전환한 후 전환 대상 프로필에 대한 설정 값을 프로필 등록 모듈-상세하게, 프로필 설정 모듈-에 요청하여 획득할 수 있다(S1108 내지 S1111). 전체 프로필 안면 인증 절차를 수행한 결과, 전환 대상 프로필이 식별되지 않은 경우, APP는 프로필 등록 안내 팝업 UI를 출력할 수 있다(S1108 및 S1113). 만약, 프로필 등록 안내 팝업 UI를 통해 프로필 등록 절차로 진입하지 않은 경우, APP는 공용 설정 값 설정 절 차를 수행하여 홈 화면에 진입할 수 있다(S1114, S1116 및 S1117). 만약, 프로필 등록 안내 팝업 UI를 통해 프로필 등록 절차로 진입한 경우, APP는 프로필 등록 화면을 출력할 수 있다(S1115). 상기 1103 단계에서 현재 프로필에 대한 잠금이 해제되어 있는 경우, APP는 선택 메뉴 화면으로 바로 진입할 수 있다. 본 명세서에 개시된 실시 예들과 관련하여 설명된 서버는 디스플레이, 외부 유/무선 통신망을 통해 네트워크 장 비 및 사용자 디바이스-예를 들면, 셋톱 박스-와 신호를 송수신하기 위한 송수신기 및 디스플레이 및 송수신기 와 연결되어 전체적인 동작을 제어하는 적어도 하나의 프로세서 및 상기 프로세서의 동작을 위한 프로그램이 기 록된 메모리를 포함하여 구성될 수 있다. 본 명세서에 개시된 실시 예들과 관련하여 설명된 셋톱박스는 외부 유/무선 통신망 및(또는) 근거리 무선 통신 및(또는) 전용선/케이블을 통해 외부 장치-예를 들면, 디지털 방송 서버, 음성 인식 서버, 리모콘, TV 등-과 신 호를 송수신하기 위한 송수신기 및 송수신기와 연결되어 전체적인 동작을 제어하는 적어도 하나의 프로세서(또는 제어기 또는 제어부) 및 상기 프로세서의 동작을 위한 프로그램이 기록된 메모리를 포함하여 구성될 수 있다. 본 명세서에 개시된 실시 예들과 관련하여 설명된 사용자 단말은 외부 유/무선 통신망 및(또는) 근거리 무선 통 신 등을 통해 외부 장치-예를 들면, 디지털 방송 서버, 음성 인식 서버 등-과 신호를 송수신하기 위한 송수신기 및 송수신기와 연결되어 전체적인 동작을 제어하는 적어도 하나의 프로세서(또는 제어기 또는 제어부) 및 상기 프로세서의 동작을 위한 프로그램이 기록된 메모리를 포함하여 구성될 수 있다. 본 명세서에 개시된 실시 예들과 관련하여 설명된 방법 또는 알고리즘의 단계는 프로세서에 의해 실행되는 하드 웨어, 소프트웨어 모듈, 또는 그 2 개의 결합으로 직접 구현될 수 있다. 소프트웨어 모듈은 RAM 메모리, 플래시 메모리, ROM 메모리, EPROM 메모리, EEPROM 메모리, 레지스터, 하드 디스크, 착탈형 디스크, CD-ROM과 같은 저 장 매체(즉, 메모리 및/또는 스토리지)에 상주할 수도 있다. 예시적인 저장 매체는 프로세서에 커플링되며, 그 프로세서는 저장 매체로부터 정보를 판독할 수 있고 저장 매 체에 정보를 기입할 수 있다. 다른 방법으로, 저장 매체는 프로세서와 일체형일 수도 있다. 프로세서 및 저장 매체는 주문형 집적회로(ASIC) 내에 상주할 수도 있다. ASIC는 사용자 디바이스 내에 상주할 수도 있다. 다른 방법으로, 프로세서 및 저장 매체는 사용자 디바이스 내에 개별 컴포넌트로서 상주할 수도 있다. 이상의 설명은 본 발명의 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 발명이 속하는 기술 분야에 서 통상의 지식을 가진 자라면 본 발명의 본질적인 특성에서 벗어나지 않는 범위에서 다양한 수정 및 변형이 가 능할 것이다. 따라서, 본 발명에 개시된 실시 예들은 본 발명의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이 고, 이러한 실시 예에 의하여 본 발명의 기술 사상의 범위가 한정되는 것은 아니다. 본 발명의 보호 범위는 아 래의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2022-0080274", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 첨부되는 도면은 본 발명에 대한 이해를 제공하기 위한 것으로서 본 발명의 다양한 실시형태들을 나타내고 명세서의 기재와 함께 본 발명의 원리를 설명하기 위한 것이다. 도 1은 종래 비밀 번호 기반의 프로필 잠금 설정 및 해제 방법을 설명하기 위한 도면이다. 도 2는 실시 예에 따른 개인 안면 인식을 통한 보안 및 개인화 서비스 제공을 위한 시스템 구성도이다. 도 3은 실시 예에 따른 개인 안면 인식을 통한 보안 및 개인화 서비스 제공을 위한 IPTV 시스템 구성도이다. 도 4는 본 개시의 실시 예에 따른 안면 인식 엔진의 동작을 설명하기 위한 도면이다. 도 5는 실시 예에 따른 프로필 안면 등록 절차를 설명하기 위한 도면이다. 도 6은 실시 예에 따른 프로필 설정 팝업 UI의 구성을 설명하기 위한 도면이다. 도 7은 본 개시의 실시 예에 따른 프로필 등록 절차를 설명하기 위한 흐름도이다. 도 8은 본 개시의 실시 예에 따른 안면 인식 기반 프로필 자동 전환 절차를 설명하기 위한 도면이다. 도 9는 본 개시의 실시 예에 따른 안면 등록 안내 팝업 UI를 보여준다. 도 10은 본 개시의 실시 예에 따른 프로필 등록 안내 팝업 UI를 보여준다. 도 11은 본 개시의 실시 예에 따른 안면 인식 기반 프로필 인증 절차를 설명하기 위한 흐름도이다."}
