{"patent_id": "10-2022-0181257", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0100510", "출원번호": "10-2022-0181257", "발명의 명칭": "모바일 애플리케이션 트래픽 데이터의 전처리 방법", "출원인": "주식회사 이노와이어리스", "발명자": "심유정"}}
{"patent_id": "10-2022-0181257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "모바일 앱 별 트래픽 데이터를 수집한 후 플로우 단위로 분할하는 (a) 단계;(a) 단계에서 분할된 각 플로우에 포함된 각 패킷의 시작 시간과 패킷 수를 계산하는 (b) 단계;(b) 단계에서 분할된 각 플로우의 패킷 수가 유의미한 학습 데이터를 구분하는 기준치(L) 이하인 경우에는 해당플로우를 삭제 처리하는 (c) 단계;(b) 단계에서 분할된 각 플로우의 패킷 수가 기준치(L)를 초과하는 경우에는 해당 플로우를 인공지능 학습에 적합한 수의 패킷 묶음의 적정 지속 시간(T) 단위로 분할하는 (d) 단계;(d) 단계에서 적정 지속 시간(T) 단위로 분할된 패킷 묶음이 기준치(L)를 초과하고 또한 인공지능 학습에 필요한 최소 지속 시간(MIN_T; 단, MIN_T > 적정 지속 시간(T))을 초과하는 경우에 해당 패킷 묶음을 인공지능 학습에 유의미한 데이터로 분류하는 (e) 단계 및(d) 단계에서 적정 지속 시간(T) 단위로 분할된 패킷 묶음이 기준치(L) 이하이거나 최소 지속 시간(MIN_T) 이하인 경우에는 해당 패킷 묶음을 삭제 처리하는 (f) 단계를 포함하여 이루어진 모바일 애플리케이션 트래픽 데이터의 전처리 방법."}
{"patent_id": "10-2022-0181257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,(a) 단계에서 분할된 플로우는 5-튜플이 동일한 단방향 플로우인 것을 특징으로 하는 모바일 애플리케이션 트래픽 데이터의 전처리 방법."}
{"patent_id": "10-2022-0181257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,각 패킷의 시작 시간은 최초 패킷의 시작 시간을 기준으로 가공되는 것을 특징으로 하는 모바일 애플리케이션트래픽 데이터의 전처리 방법."}
{"patent_id": "10-2022-0181257", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1 내지 3 중 어느 한 항에 있어서,상기 인공지능 모델은 CNN(Convolutional Neural Network)인 것을 특징으로 하는 모바일 애플리케이션 트래픽데이터의 전처리 방법."}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 모바일 애플리케이션 트래픽 데이터 중에서 단 두 가지의 트래픽 특징만을 사용하여 고정확도의 애플 리케이션 분류용 AI 모델을 구축하는데 도움을 주는 양질의 학습용 데이터만을 추출하여 제공할 수 있도록 한 모 바일 애플리케이션 트래픽 데이터의 전처리 방법에 관한 것이다. (뒷면에 계속)"}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 모바일 애플리케이션 트래픽 데이터의 전처리 방법에 관한 것으로, 특히 모바일 애플리케이션 트래픽 데이터 중에서 단 두 가지의 트래픽 특징만을 사용하여 고정확도의 모바일 애플리케이션 분류용 AI 모델을 구축 하는데 도움을 주는 양질의 학습용 데이터만을 추출하여 제공할 수 있도록 한 모바일 애플리케이션 트래픽 데이 터의 전처리 방법에 관한 것이다."}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "네트워크 플로우(Network flow)의 유형이나 사용자들에 의해 많이 사용되는 애플리케이션 소프트웨어(이하 간단 히 \"앱\"(APP)이라고도 한다)를 식별하는 것은 상업 또는 통계적인 측면에서 중요하지만 최근에는 VPN(Virtual Private Network, 가상 사설망)과 같은 암호화 통신망의 사용으로 인해 어려움을 겪고 있다.이를 감안하여 최근에는 인공지능(AI; Artificial Intelligence) 기술을 네트워크 트래픽 분류를 위해 활용하는 사례가 점차 증가하고 있다. 보통 인공지능을 생각할 때 데이터가 많고 알고리즘이 좋으면 인공지능의 성능이 좋을 것이라고 판단한다. 하지만 인공지능에 양질의 데이터가 입력되지 않으면 인공지능의 출력 또한 엉망이 되 는데, 이것을 기고(GIGO; Garbage In & Garbage Out) 현상이라고 한다. 이와 같이 인공지능이 좋은 성능을 나타내기 위해서는 좋은 알고리즘만큼이나 입력되는 데이터의 수준이 중요하 다. 즉, '데이터 분석의 80%는 데이터 전처리'라는 말이 존재할 만큼 데이터 전처리가 중요하다. 종래 모바일 앱 트래픽 데이터를 분류함에 있어서는 주로 네트워크 트래픽의 패킷을 직접 검사하여 분류하는 트래픽 페이로드 기반 방식(Traffic payload-based methods)이 사용되었다. 이에 따르면, 사용자의 개인 정보에 위험을 초래하는 패킷 페이로드를 기반으로 하는 개인 정보의 여러 특징 (feature)을 사용하기 때문에 보안 상의 문제가 발생할 수 있을 뿐 아니라 계산의 복잡성이 증가할 수 있다. 또 한, 전송 제어 프로토콜(TCP) 세션에서 데이터 및 벡터의 생성을 포함하여 많은 트래픽 특징을 추출하기 위해 복잡한 메커니즘이 사용된다는 문제점이 있다. 선행기술문헌 선행기술문헌 1: 10-2022-0147662호 공개특허공보(발명의 명칭: 빅 데이터의 전달을 제어하는 경량 인공 지능 레이어) 선행기술문헌 2: 10-2398361호 등록특허공보(발명의 명칭: GUI 기반 인공지능 추천 시스템 및 그 방법) 선행기술문헌 3: 10-2412433호 등록특허공보(발명의 명칭: 인공지능 데이터 자동 분석 방법 및 분석 시스템)"}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하기 위해 창출된 것으로서, 모바일 애플리케이션 트래픽 데이터 중에서 단 두 가지의 트래픽 특징만을 사용하여 고정확도의 애플리케이션 분류용 AI 모델을 구축하는데 도움을 주는 양질의 학습용 데이터만을 추출하여 제공할 수 있도록 한 모바일 애플리케이션 트래픽 데이터의 전처리 방법을 제공함 을 목적으로 한다."}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 목적을 달성하기 위한 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법은 모바일 앱 별 트 래픽 데이터를 수집한 후 플로우 단위로 분할하는 (a) 단계; (a) 단계에서 분할된 각 플로우에 포함된 각 패킷 의 시작 시간과 패킷 수를 계산하는 (b) 단계; (b) 단계에서 분할된 각 플로우의 패킷 수가 유의미한 학습 데이 터를 구분하는 기준치(L) 이하인 경우에는 해당 플로우를 삭제 처리하는 (c) 단계; (b) 단계에서 분할된 각 플 로우의 패킷 수가 기준치(L)를 초과하는 경우에는 해당 플로우를 인공지능 학습에 적합한 수의 패킷 묶음의 적 정 지속 시간(T) 단위로 분할하는 (d) 단계; (d) 단계에서 적정 지속 시간(T) 단위로 분할된 패킷 묶음이 기준 치(L)를 초과하고 또한 인공지능 학습에 필요한 최소 지속 시간(MIN_T; 단, MIN_T > 적정 지속 시간(T))을 초과 하는 경우에 해당 패킷 묶음을 인공지능 학습에 유의미한 데이터로 분류하는 (e) 단계 및 (d) 단계에서 적정 지 속 시간(T) 단위로 분할된 패킷 묶음이 기준치(L) 이하이거나 최소 지속 시간(MIN_T) 이하인 경우에는 해당 패 킷 묶음을 삭제 처리하는 (f) 단계를 포함하여 이루어진다. 전술한 구성에서, (a) 단계에서 분할된 플로우는 5-튜플이 동일한 단방향 플로우이다. 각 패킷의 시작 시간은 최초 패킷의 시작 시간을 기준으로 상대 값으로 가공된다. 상기 인공지능 모델은 CNN(Convolutional Neural Network)이다."}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에 따르면, 각 패킷의 시작 시간과 각 플로우의 패 킷 수만을 특징으로 추출하여 사용하기 때문에 전처리에 사용되는 스토리지 요구량이 적을 뿐 아니라 계산량이 적어서 신속하게 모바일 앱 분류를 위한 양질의 AI 학습 데이터 셋을 구축할 수 있고, 결과적으로 높은 정확도를 갖는 모바일 앱 분류용 AI 모델을 구축하는데 도움을 줄 수가 있다. 또한, 전술한 바와 같이 각 패킷의 시작 시간과 각 플로우의 패킷 수와 같은 메터데이터만을 사용할 뿐 민감한 개인 정보가 담긴 패킷 페이로드에 대한 접근을 요구하지 않기 때문에 개인 정보 유출에 대한 위험을 제거할 수 가 있다."}
{"patent_id": "10-2022-0181257", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에는 첨부한 도면을 참조하여 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법의 바람직한 실 시예에 대해 상세하게 설명한다. 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에서는 개인 정보가 담긴 패킷 페이로드에 접근함 이 없이 모바일 트래픽 데이터 플로우의 패킷 수 및 각 패킷의 시작 시간이라는 두 가지 트래픽 특징만을 사용 하는, 즉 낮은 계산 리소스만을 필요로 하면서도 사용자의 개인 정보를 보호하는 솔루션을 제안한다. 이하에서는 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에서 사용되는 주요 용어에 대해 정의 한다. - 유의미한 데이터: AI 모델 학습 시 성능을 높이는데 영향을 주는 데이터를 의미한다. - 무의미한 데이터: AI 모델 학습 시 성능을 높이는데 영향을 주지 않거나 성능을 떨어뜨리는 데이터를 의미한 다. - 플로우(Flow): 5 튜플(5-Tuple), 즉 근원지 IP(Source IP)와 근원지 포트(Source port), 목적지 IP(Destination IP)와 목적지 포트(Destination port) 및 사용 프로토콜(Protocol)이 동일한 트래픽 데이터 흐 름을 나타내는데, 본 발명의 방법에서는 단방향 흐름만을 사용한다. - 시간(Time): 시간 관련 특징(feature)을 의미하는데, 본 발명의 방법에서는 각 패킷의 시작 시간을 사용한다. - 길이(Length): 크기 관련 특징(feature)을 의미하는데, 본 발명의 방법에서는 각 플로우의 길이(flow length), 즉 각 플로우의 패킷 수를 추출하여 사용한다. - L: 인공지능 학습에 유의미한 데이터를 구분하기 위한 기준 패킷 수로서, 모바일 앱의 종류나 통신 속도 수준 에 따라 적절한 값으로 정해질 수 있다. - T: 인공지능 학습에 적합한 수의 패킷 묶음(packet bundle)의 적정 지속 시간(T)으로서, 모바일 앱의 종류나 통신 속도 수준에 따라 적절한 값으로 정해질 수 있으며, 이를 초과하는 경우에는 이러한 적정 지속 시간(T) 단 위로 각 플로우를 분할하여 유의미한 데이터 여부를 판단한다. MIN_T: 인공지능 학습에 필요한 각 패킷 묶음의 최소 지속 시간으로서, 모바일 앱의 종류나 통신 속도 수준에 따라 적정 지속 시간(T)보다 작은 범위에서 적절한 값으로 정해질 수 있다. 도 1은 본 발명의 애플리케이션 트래픽 데이터의 전처리 방법의 개요를 설명하기 위한 시퀀스 다이어그램이다. 도 1에 도시한 바와 같이, 본 발명에 따르면 유저가 많이 사용하는 모바일 앱을 분류하기 위해 각 모바일 앱 별 로 트래픽 데이터를 수집한 후 이를 본 발명의 제안 솔루션인 모바일 애플리케이션 트래픽 데이터의 전처리 방 법을 통해 전처리함으로써 양질의 학습 데이터 제공할 수 있고, 이에 따라 모바일 앱 분류를 위한 AI 모델의 성 능을 향상시킬 수가 있다. 도 2는 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법을 설명하기 위한 흐름도이다. 도 2에 도시 한 바와 같이, 먼저 단계 S100에서는 각 모바일 앱 별 트래픽 데이터를 수집하고, 다시 단계 S110에서는 이렇게 수집된 트래픽 데이터를 동일한 5-튜플을 갖는 트래픽 데이터인 플로우 단위로 분할하는데, 본 발명의 방법에서 는 단 방향 플로우만을 사용한다. 단계 S120에서는 각 플로우에 포함된 각 패킷의 시작 시간과 패킷 수를 계산한다. 도 3은 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에서 사용되는 특징을 예시적으로 보인 도 표이다. 도 3에 예시한 바와 같이, 모바일 앱에서 사용되는 트래픽 데이터 플로우에는 전술한 5-튜플 이외에 각 플로우에 포함된 각 패킷의 시작 시간(Packet start time) 및 각 패킷의 바이트 수(Packet byte) 등과 같은 수 많은 특징이 포함될 수 있는데, 본 발명의 방법에서는 이 중에서 플로우 길이인 패킷 수와 각 패킷의 시작 시간 만을 추출하여 전처리를 수행한다. 다시 도 2로 돌아가서, 단계 S130에서는 각 플로우 길이, 즉 패킷 수가 유의미한 학습 데이터를 구분하는 기준 치(L), 예를 들어 60개를 초과하는지를 판단하여 이하인 경우에는 해당 플로우가 실제 사용자 데이터가 아닌 것으로 간주하여 해당 플로우를 삭제 처리(단계 S140)한다. 이에 따르면, 도 4의 도표에 나타낸 바와 같이 도 3의 도표의 첫번째 행 및 여섯번째 행의 플로우의 패킷 수가 각각 3개 및 28개로 기준치(L)인 60개에 미달하여 삭제 처리됨을 알 수 있다. 다시 도 2로 돌아가서, 단계 S130에서 플로우의 길이, 즉 패킷 수가 기준치(L), 예를 들어 60개를 초과하는 경 우에는 다시 단계 S150을 수행하여 플로우의 전체 지속 시간, 즉 첫 번째 패킷부터 마지막 패킷 도착까지의 시 간이 인공지능 학습에 적합한 수의 패킷 묶음(packet bundle)의 적정 지속 시간(T), 예를 들어 60초를 초과하는 지를 판단하는데, 초과하는 경우에는 단계 S160으로 진행하여 이를 적정 지속 시간(T) 단위로 분할한 후 단계 S170으로 진행하는 반면에 미달하는 경우에는 단계 S170으로 직행한다. 도 5는 도 4의 첫 번째 행의 플로우에 대한 각 패킷의 시작 시간(Packet start time)과 각 패킷의 바이트 수 (Packet byte)를 상세하게 펼쳐 보인 표인바, 각 패킷의 시작 시간의 경우 계산을 쉽게 하기 위해 최초 패킷 시 작 시간을 기준으로 한 상대값으로 가공하여 적용한다. 도 6은 도 5의 플로우를 적절 지속 시간(T) 단위로 분할한 결과를 보인 도표이고, 도 7은 이를 각 묶음 단위로 구분하여 표시한 도표인바, 이에 따르면 도 5의 플로우는 총 3개의 패킷 묶음으로 분할됨을 알 수 있다. 즉, 1 번 패킷 묶음(도 6의 적색 박스)은 패킷의 시작 시간이 0~60초 범위에 속한 패킷 묶음이고, 2번 패킷 묶음(도 6 의 청색 박스)는 패킷의 시작 시간이 61~120초 범위에 속한 패킷 묶음이며, 3번 패킷 묶음(도 6의 황색 박스)는 121~180초 범위에 속한 패킷 묶음이다. 다시 도 2로 돌아가서, 단계 S170에서는 적정 지속 시간(T) 단위로 분할된 각 패킷 묶음에 속한 패킷의 수가 유 의미한 학습 데이터를 구분하는 기준치(L), 예를 들어 60개를 초과하는지를 판단하여 그 이하인 경우에는 단계 S180으로 진행하여 해당 패킷 묶음을 삭제 처리한다. 도 8a 및 도 8b는 각각 도 7에서 잔류된 패킷 묶음과 삭제된 패킷 묶음을 보인 도표인바, 도 8에서 알 수 있듯 이 1번 패킷 묶음과 2번 패킷 묶음은 그 패킷 수가 각각 94 및 90로 기준치(L)인 60개를 초과하여 잔류된 반면 에, 3번 패킷 묶음은 그 패킷 수가 22개로 기준치(L)인 60개에 미달하여 삭제 처리되었음을 알 수 있다. 다시 도 2로 돌아가서, 단계 S170에서 각 패킷 묶음의 패킷 수가 기준치(L)를 초과하는 경우에는 다시 단계 S190으로 진행하여 각 패킷 묶음의 지속 시간, 즉 해당 패킷 묶음의 첫 번째 패킷부터 마지막 패킷 도착까지의 시간이 인공지능 학습에 필요한 최소 지속 시간(MIN_T; 단, MIN_T > 적정 지속 시간(T)), 예를 들어 50초를 초 과하는지를 판단한다. 단계 S190에서 해당 패킷 묶음의 지속 시간이 최소 최소 지속 시간(MIN_T)을 초과하는 경우에는 단계 S210에서 해당 패킷 묶음을 인공지능 학습에 유의미한 데이터로 분류하는 반면에, 최소 지속 시간 이하(MIN_T)인 경우에 는 해당 패킷 묶음을 무의미한 데이터로 간주하고 단계 S200으로 진행하여 해당 패킷 묶음을 삭제 처리한다. 도 9a 및 도 9b는 각각 도 8a에서 유의미한 데이터로 분류된 패킷 묶음과 무의미한 데이터로 삭제 처리된 패킷 묶음을 나타내는바, 도 9a에서 알 수 있듯이 해당 패킷 묶음의 지속 시간은 55.37721초로서 최소 지속 시간 (MIN_T)인 50초를 초과하여 유의미한 학습 데이터로 분류(단계 S210)된다. 반면에, 도 9b에서 알 수 있듯이 해 당 패킷 묶음의 지속 시간은 5.6575초로서 최소 지속 시간(MIN_T)인 50초에 미달하기에 삭제 처리(단계 S200)된 다. 다시 도 2로 돌아가서, 단계 S220에서는 해당 플로우의 모든 패킷 묶음의 처리가 완료되었는지를 판단하여 완료 되지 않은 경우에는 단계 S170으로 복귀하는 반면에 완료된 경우에는 다시 단계 S230으로 진행하여 모든 플로우 의 처리가 완료되었는지를 판단한다. 단계 S230에서 모든 플로우의 처리가 완료되지 않은 경우에는 단계 S120을 반복 수행하는 반면에 완료된 경우에 는 프로그램을 종료한다. 도 10은 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법의 예상 처리 결과로서, 세로축은 적정 지 속 시간(T) 단위로 분할된 시간(time)을 나타내고, 가로축은 적정 지속 시간(T) 단위로 분할된 패킷 묶음의 패 킷 수를 나타낸다. 도 10에서 좌측 그래프는 본 발명의 방법을 적용하기 전의 트래픽 데이터를 2차원 매트릭스로 시각화한 것이고, 우측의 그래프는 본 발명의 방법을 적용한 후의 트래픽 데이터를 2차원 매트릭스로 시각화한 것인바, 좌측 그래 프보다 우측 그래프의 데이터가 더 촘촘하게 이미지화된 것을 알 수 있다. 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에 의해 전처리된 결과는 이미지 데이터로서 표현 될 수 있고, 이러한 이미지 데이터를 적용하기 적합한 AI 모델은 신경망 모델 중 하나인 CNN(Convolutional Neural Network)이다. CNN에는 AlexNet, VGGNet, ResNet 및 GoogleNet 등이 있고, 차원에 따라 1D-CNN 및 2D- CNN 등이 있다. 도 11은 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에 의해 전처리된 모바일 앱 트래픽 데이 터를 인공지능 분류 모델에 입력하였을 때의 결과(출력)를 예시적으로 보인 도이다. 도 11에 예시한 바와 같이, 본 발명의 전처리 방법에 의해 전처리된 이미지 데이터를 모바일 앱 분류용 AI 모델, 예를 들어 CNN 분류 모델 에 입력하였을 때 사용된 모바일 앱을 정확하게 분류하고 있음을 알 수 있다. 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법은 전술한 실시예에 국한되지 않고 본 발명의 기술 사상이 허용하는 범위 내에서 다양하게 변형하여 실시할 수가 있다. 예를 들어, 도 2에서 단계 S170 및 단계 S180은 그 순서가 바뀌거나 동시에 실행될 수도 있다."}
{"patent_id": "10-2022-0181257", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 애플리케이션 트래픽 데이터의 전처리 방법의 개요를 설명하기 위한 시퀀스 다이어그램. 도 2는 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법을 설명하기 위한 흐름도. 도 3 내지 도 9는 도 2에 도시한 본 발명의 각 단계를 알기 쉽게 설명하기 위한 예시적인 데이터 도표. 도 10은 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법의 예상 처리 결과를 보인 그래프. 도 11은 본 발명의 모바일 애플리케이션 트래픽 데이터의 전처리 방법에 의해 전처리된 모바일 앱 트래픽 데이 터를 인공지능 분류 모델에 입력하였을 때의 결과(출력)를 예시적으로 보인 도."}
