{"patent_id": "10-2021-0009442", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0106483", "출원번호": "10-2021-0009442", "발명의 명칭": "호흡에 따라 공기량 조절이 가능한 마스크", "출원인": "주식회사 디아이티그린", "발명자": "김승섭"}}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "본체(2)와; 본체(2)에 구비되어 호흡시 발생하는 소리를 수집하고, 수집된 음향 데이터를 전송하는 마이크(9)와; 본체(2)에 연결되어 본체(2)의 내측에 공기를 공급하는 공기 공급기(7)와; 본체(2)에 연결되어 마이크(9)로부터 전송된 음성 데이터를 분석하여 들숨 및 날숨 여부를 파악하고, 이에 따라공기 공급기(7)에 신호를 전송하여 마스크 내측에 공급되는 공기 공급량을 제어하는 제어기(5)를 포함하는 마스크."}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,본체(2)의 하부에는 마이크(9)가 구비되며, 마이크(9)는 제어기(5)와 연결되는 제 1포트(11a)와; 공기 공급기가연결되는 제 2포트(11b)를 포함하는 마스크."}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,제어기(5)는 마이크(9)로부터 음향 데이터를 수신하는 입력부(23)와; 수신된 음향 데이터를 인공지능 방식에 의하여 분석하여 들숨 및 날숨여부를 파악하여 공기 공급량을 연산하는 연산부(25)와; 연산된 결과값을 공기 공급기에 전송함으로써 들숨 및 날숨에 따라 공기 공급량을 제어하는 출력부(27)를 포함하는 마스크."}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,공기 공급기는 공기가 온도의 상승에 따라 밀도가 낮아져서 상승하는 공기 통로(17)와; 공기 통로(17)의 하부에배치되어 공기가 유입되는 유입구(19)와; 공기 통로(17)의 상부에 배치되어 공기가 배출됨으로써 제 2포트(11b)를 통하여 마스크 내부로 공기가 공급되는 배출구(23)와; 제어기(5)의 신호에 따라 유입구(19) 및 배출구(23)의 개폐를 제어하는 회로부(18)를 포함하는 마스크."}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 공기 통로(17)는 직선형상, 지그 재그형상, 또는 Coil 형상을 포함하는 마스크."}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4항에 있어서, 공기 통로(17)의 일측에 UV 살균기(8)가 추가로 배치되며, UV 살균기(8)에 의하여 조사된 자외선이 공기에 전달되어 가열시킴으로써 공기의 밀도가 낮아져서 상승함으로써 배출구(23)를 통하여 마스크의 내부로 공급되는 마스크."}
{"patent_id": "10-2021-0009442", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 4항에 있어서,유입구(19)의 하부에는 필터(21)가 배치됨으로써 유입되는 바이러스를 1차적으로 제거하는 마스크.공개특허 10-2022-0106483-3-"}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 마스크에 관한 것이다. 그러한 마스크는, 본체와; 본체에 구비되어 호흡시 발생하는 소리 를 수집하고, 수집된 음향 데이터를 전송하는 마이크와; 본체에 연결되어 본체의 내측에 공기를 공급하 는 공기 공급기와; 본체에 연결되어 마이크로부터 전송된 음성 데이터를 분석하여 들숨 및 날숨 여부를 파악하고, 이에 따라 공기 공급기에 신호를 전송하여 마스크 내측에 공급되는 공기 공급량을 제어하는 제어기 를 포함한다."}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 마스크에 관한 것으로서, 보다 상세하게는 마스크 본체에 마이크를 배치하여 음향 데이터를 수집하고, 이 마이크를 인공지능이 탑재된 통신기기에 연결함으로써 착용자의 호흡에 따른 음향 데이터를 분석 하여 날숨 및 들숨 여부를 파악한 후, 이 호흡에 따라 공기 공급량을 조절하여 마스크에 공급할 수 있는 기술에 관한 것이다."}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 마스크(Mask)는 얼굴 또는 머리의 전반에 착용하는 것으로서, 다양한 목적으로 사용한다. 예를 들면, 바이러스 혹은 오염 물질이 착용자의 호흡 경로에 들어가는 것을 방지하거나, 착용자가 토해낸 병원 균이나 기타의 오염 물질에 다른 사람들이 노출되지 않도록 하는 목적으로 사용한다. 이러한 마스크는 통상적으로 얼굴에 착용하는 본체와, 본체의 양측에 연결되어 귀에 걸리는 착용대와, 본체의 내부에 배치되는 정전필터 등으로 구성된다. 본체는 주로 폴리프로필렌(PP;Polypropylene) 재질로서, 안감, 정전필터, 지지체, 겉감으로 이루어진다. 그러나, 종래의 마스크는 착용자가 호흡할 때 마스크 내측의 공기가 외부로 배출되거나 흡입되는 바, 이때 마스 크 자체의 탄력만큼만 공기의 흡입이 가능하므로 착용자의 실제 호흡상태는 반영되지 못한 상태로 호흡이 진행 되므로 원활한 호흡이 어려운 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허등록 제10-434937호(호흡 마스크 및 사람의 얼굴에 대한 호흡마스크의 착용상태 평가방법)"}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서, 본 발명은 이러한 문제점을 해결하기 위하여 제안된 것으로서, 본 발명의 목적은 마스크의 구조를 개선 함으로써 인공지능에 의하여 착용자의 호흡을 분석함으로써 들숨 및 날숨에 따라 공기 공급량을 조절하여 마스 크로 공급함으로써 원활한 호흡이 가능한 기술을 제공하는 것이다. 본 발명의 다른 목적은 마스크에 공급되는 공기에 함유된 바이러스, 예를 들면 코로나 바이러스, 코로나 변이 바이러스 등을 효율적으로 제거할 수 있는 기술을 제공하는 것이다."}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 본 발명의 일 실시 예는, 본체와; 본체에 구비되어 호흡시 발생하는 소리를 수집하고, 수집된 음향 데이터를 전송하는 마이크와; 본체에 연결되어 본체의 내측에 공기를 공급하는 공기 공급기와; 본체에 연결되어 마이크로부터 전송된 음성 데이터를 분석하여 들숨 및 날숨 여부를 파악하고, 이에 따라 공기 공급기에 신호를 전송하여 마스크 내측에 공급되는 공기 공급량을 제어하는 제어기를 포함하는 마스 크를 제공한다."}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명의 일 실시 예에 따른 마스크는 다음과 같은 효과가 있다. 첫째, 마스크에 마이크를 장착하여 호흡시 발생하는 음향 데이터를 수집하고, 수집된 음향 데이터를 스마트폰과 같은 제어기에 전송하여 인공지능 방식에 의하여 분석함으로써 날숨 및 들숨 여부를 파악하고, 날숨 및 들숨 여 부에 따라 공기 공급기를 제어함으로써 마스크 본체에 공급되는 공기의 양을 조절할 수 있어서 마스크를 착용한 상태에서도 호흡을 효과적 실시할 수 있는 효과가 있다. 둘째, 공기 공급기의 하부에 필터를 배치하여 유입되는 공기중에 함유된 바이러스(코로나 바이러스, 코로나 변 이 바이러스 등)를 1차적으로 제거하고, 공기 공급기에 UV 살균기를 추가로 배치함으로써 마스크 본체에 공급되 는 공기를 자외선에 의하여 살균함으로써 바이러스를 2차적으로 제거함으로써 복수회에 걸쳐서 바이러스를 제거 하므로 건강에 이로운 효과가 있다. 셋째, 마스크에 형상 기억합금으로 된 가변 플레이트를 부착함으로써 체온에 따라 본래의 형상으로 회복되도록 하여 가변 플레이트와 얼굴 피부 사이에 공간을 형성하여 공기를 외부로 효율적으로 배출할 수 있는 효과가 있 다."}
{"patent_id": "10-2021-0009442", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 일 실시예에 따른 마스크를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1 내지 도 4에 도시된 바와 같이, 본 발명이 제안하는 마스크는 얼굴에 착용하는 본체와; 본체에 구비되어 호흡시 발생하는 소리를 수집하고, 수집된 음향 데이터를 전송하는 마이크와; 본체에 연결되어 본체의 내측에 공기를 공급하는 공기 공급기와; 본체에 연결되어 마이크로부터 전송된 음성 데이터 를 분석하여 들숨 및 날숨 여부를 파악하고, 이에 따라 공기 공급기에 신호를 전송하여 공기 공급량을 제어 하는 제어기를 포함한다. 이러한 구조를 갖는 마스크에 있어서, 마스크 본체는 통상적인 마스크 재질로 구성되는 바, 예를 들면 폴리프로필렌(PP;Polypropylene) 재질이다. 이때, 마스크 본체는 투명한 재질로 형성되는 것이 바람직하다. 그리고, 마스크 본체는 겉감, 지지체, 정전필터, 안감 등이 구비될 수 있다. 또한, 마스크 본체의 상부에는 가변 플레이트가 부착됨으로써 온도에 따라 형상이 변형될 수 있다. 이때, 가변 플레이트는 형상 기억합금을 포함한다. 따라서, 마스크를 착용할 때 가변 플레이트를 절곡시켜서 코 등에 밀착시키는 바, 이 상태에서 날숨 때 혹은 체온이 상승하는 경우, 열이 가변 플레이트에 전달되는 경우, 가변 플레이트는 본래의 형상으로 회복되며, 이때 가변 플레이트와 얼굴 피부 사이에 공간을 형성하여 공기를 외부로 효율적으로 배출할 수 있 다. 그리고, 마이크는 이러한 본체의 내측에 배치됨으로써 착용자가 호흡할 때 발생하는 소리를 수집하고, 수 집된 음향 데이터를 제어기로 전송한다. 이때, 마이크는 케이블에 의하여 제어기에 연결되는 바, 직접 연결될 수도 있고, 또는 본체의 하부에 구비된 포트를 통하여 제어기와 연결될 수 있다. 포트에 의하여 연결되는 경우를 설명하면, 포트에는 제어기와 연결되는 제 1포트(11a)와, 공기 공급 기가 연결되는 제 2포트(11b)가 구비된다. 즉, 제 1포트(11a)에는 제어기가 연결됨으로써 마이크로부터 음향 데이터를 수신하여 공기 공급기 및 살 균기를 제어한다.이러한 제어기는 마이크의 음향신호를 수신하고, 연산 및 제어할 수 있는 전자 디바이스를 포함한다. 예 를 들면, 스마트폰과 같은 모바일 통신기기, 혹은 노트북, 탭, 패드 등과 같은 PC도 적용가능하다. 보다 상세하게 설명하면, 제어기는 마이크로부터 음향 데이터를 수신하는 입력부와; 수신된 음향 데 이터를 인공지능 방식에 의하여 분석하여 들숨 및 날숨여부를 파악하여 공기 공급량을 연산하는 연산부와; 연산된 결과값을 공기 공급기에 전송함으로써 들숨 및 날숨에 따라 공기 공급량을 제어하는 출력부를 포함 한다. 이러한 제어기에 있어서, 입력부는 마이크로부터 전송된 디지털 방식의 음향 데이터를 수신하게 된다. 그리고, 연산부는 수신된 음향 데이터를 인공지능에 의하여 분석함으로써 들숨 및 날숨 여부를 파악한다. 예를 들면, 이러한 연산부는 인공지능 소프트웨어가 탑재된 인공지능 모듈을 포함하며, 음향 분석엔진 과, GPU와, ISP(Image Signal Processor) 등으로 구성된다. 그리고, 연산부에서는 음향의 형태 분석을 다양한 알고리즘을 사용할 수 있는 바, 예를 들면 딥러닝(Deep learning) 방식에 의하여 들숨과 날숨인 경우의 음향 데이터를 비교하여 그 유사도를 판단함으로써 형태를 분석 하는 방식이다. 즉, 딥러닝은 컴퓨터가 여러 데이터를 이용해 인간처럼 스스로 학습할 수 있게 하기 위해 인공 신경망(ANN: artificial neural network)을 기반으로 구축한 한 기계 학습방법이다. 인공 신경망을 이용하면 음향 데이터의 분류(classification) 및 군집화(clustering)가 가능한 바, 분류나 군집 화를 원하는 데이터 위에 여러 가지 층(layer)을 얹어서 유사도 판단을 실시할 수 있다. 즉, 인공 신경망으로 음향 데이터의 형상 특징을 추출하고 그 특징을 다시 다른 기계학습 알고리즘의 입력값으 로 사용하여 형상 별로 분류나 군집화를 함으로써 유사도를 판단할 수 있다. 이러한 인공 신경망은 심층 신경망을 포함하는 바, 심층 신경망은 신경망 알고리즘 중에서 여러 개의 층으로 이 루어진 신경망을 의미한다. 즉, 인공 신경망은 다층으로 구성되는 바, 각각의 층은 여러 개의 노드로 구성되고, 각 노드에서는 실제로 형상 을 분류하는 연산이 일어나며, 이 연산 과정은 인간의 신경망을 구성하는 뉴런에서 일어나는 과정을 모사하도록 설계된다. 노드는 일정 크기 이상의 자극을 받으면 반응을 하는데, 그 반응의 크기는 입력 값과 노드의 계수(또는 가중치, weights)를 곱한 값과 대략 비례한다. 일반적으로 노드는 여러 개의 입력을 받으며 입력 갯수만큼의 계수를 갖는다. 따라서, 이 계수를 조절함으로써 여러 입력에 서로 다른 가중치를 부여할 수 있다. 최종적으로 곱한 값들은 전부 더해지고 그 합은 활성 함수(activation function)의 입력으로 들어가게 된다. 활 성 함수의 결과가 노드의 출력에 해당하며 이 출력값이 궁극적으로 분류나 회귀 분석에 쓰인다. 각 층은 여러 개의 노드로 이루어지며 입력값에 따라 각 노드의 활성화/비활성화 여부가 결정된다. 이때, 입력 데이터는 첫 번째 층의 입력이 되며, 그 이후엔 각 층의 출력이 다시 다음 층의 입력이 되는 방식이다. 모든 계수는 음향 데이터의 형상 학습 과정에서 계속 조금씩 변하는데, 결과적으로 각 노드가 어떤 입력을 중요 하게 여기는지를 반영한다. 그리고 신경망의 학습(training)은 이 계수를 업데이트하는 과정이다. 음향 데이터의 형상 학습시 이러한 심층 신경망에서는 각 층마다 서로 다른 층위의 특징이 학습된다. 즉, 낮은 층위의 특징은 단순하고 구체적인 특징이 학습되며 {예: 음향 데이터의 주파수 곡선을 형성하는 피치 형상}, 높은 층위의 특징은 더욱 복잡하고 추상적인 특징이 학습된다. {예: 날숨 혹은 들숨시의 음향 데이터의 주파수 형상} 이런 추상화 학습과정을 통해 심층 신경망이 고차원의 데이터를 이해하며, 이 과정에는 수 억, 수 십억 개의 계 수가 관여하게 된다. (이 과정에서 비선형함수가 사용된다.) 또한, 심층 신경망은 데이터를 이용해 데이터의 잠재적인 구조(latent structures)를 파악할 수 있다. 즉, 들숨 혹은 날숨시의 음향 데이터의 주파수 곡선의 윤곽, 주기 등 잠재적인 구조를 파악할 수 있다. 이를 통해 데이터가 라벨링되어 있지 않아도 데이터간의 유사성을 효과적으로 파악할 수 있으며, 결과적으로 심층 신경망은 들 숨 및 날숨 데이터의 군집화에 효과적이다. 예를 들어, 신경망을 이용해 대량의 음향 데이터를 입력받아 비슷한 음향 데이터끼리 모아서 분류할 수 있다. 이러한 심층 신경망이 일반적인 기계 학습과 다른 점은 특징 추출(feature extraction)이 자동적으로 이루어진 다는 점이다. 기존에는 효과적인 특징을 추출하기 위해 관련 분야 전문가가 오랜 시간동안 직접 음향 특징을 추출하는 방식을 적용했다. 이 방법은 개발, 평가 및 보완에 많은 시간이 걸리는 문제점이 있다. 심층 신경망은 이런 과정을 컴퓨터가 대신 하도록 알고리즘을 짠 것으로, 사람에 비해 훨씬 빠르고 효과적으로 수행하도록 학습시킨다. 라벨링이 되어있지 않은 데이터를 학습하는 경우에도 신경망은 음향 데이터의 특징을 자동적으로 추출할 수 있 다. 이 자동 추출은 여러 가지 방법이 있는데, 보통 이 과정은 신경망을 통과시켰을 때의 출력이 입력과 같아지 도록 학습하게 된다. 라벨이 어떤 종류이든지(입력을 그대로 사용/별도의 라벨을 사용) 신경망은 입력과 출력의 상관관계를 찾는다. 경우에 따라서는 라벨링된 데이터로 신경망을 어느 정도 학습시킨 뒤 라벨링이 되어있지 않은 데이터를 추가하 여 계속 학습시킬 수도 있다. 이 방법을 이용하면 신경망의 성능을 극대화할 수 있다. 심층 신경망의 마지막 층은 출력층이다. 출력층의 활성 함수는 로지스틱(logistic) 혹은 소프트 맥스(softmax) 인 경우가 대부분이며 출력층에서는 최종적으로 특정 라벨의 확률을 구할 수 있다. 예를 들어 음향 데이터를 입 력하였을 때 주파수 곡선의 주기가 긴지 혹은 짧은지, 피크의 높낮이 등을 각각의 확률로 구할 수 있다. 상기한 인공지능을 이용한 음향 분석과정을 설명하면, 우선 학습이 시작되기 전에 뉴럴넷의 모든 계수를 초기화한다. 그리고 음향 데이터를 반복하여 입력하여 학습을 진행한다. 만일 학습이 원활하게 진행되었다면 계수는 적절한 값으로 업데이트 되어 있을 것이고, 이 인공 신경 망으로 각종 분류와 예측이 가능하다. 그리고, 학습 과정 내부에선 이러한 계수의 업데이트 과정이 반복적으로 일어난다. 계수 업데이트의 원리는 우선 계수를 추정하고 그 계수를 사용했을 때 발생하는 에러를 측정한 뒤 그 에러에 기 반해서 계수를 약간씩 업데이트 하는 방식이다. 이때, 신경망의 여러 계수를 합쳐서 모델이라고 부르며, 모델은 초기화 된 상태일 수도 있고, 학습이 완료된 상 태일 수도 있다. 초기화된 모델은 의미있는 작업을 못하지만 학습이 진행될수록 모델은 임의의 값이 아닌, 실제와 유사한 결과를 출력하게 된다. 이는 인공 신경망이 데이터가 입력되기 전에는 초기화 상태이기 때문이며, 계수를 임의의 값으로 초기화하는 이 유도 마찬가지이다. 그리고 데이터를 읽어가면서 계수를 조금씩 올바른 방향으로 업데이트하게 된다. 이러한 업데이트 과정을 통하여 인공 신경망은 입력된 음향 데이터들을 분류함으로써 유사한 음향 데이터들을 군집화할 수 있다. 따라서 음향 데이터들은 유형별로 군집화될 수 있는 바, 예를 들면, 날숨시의 음향과, 들숨시의 음향으로 군집 화되어 분류될 수 있다. 그리고 분류된 음향 데이터는 데이터 베이스에 등록된다. 이와 같이, 연산부는 입력된 음향 데이터를 분석하여 들숨 혹은 날숨 여부를 파악한다. 그리고, 파악된 결과에 따라 공기 공급기에 신호를 전송함으로써 공기의 공급량을 조절하게 된다. 이러한 공기 공급기는 MEMS(Micro-Electro Mechanical Systems;미세전자제어기술) 방식으로서 소형화된 전자 회로를 이용한 구조이다. 즉, 공기 공급기는 공기가 온도의 상승에 따라 밀도가 낮아져서 상승하는 공기 통로와; 공기 통로의 하 부에 배치되어 공기가 유입되는 유입구와; 공기 통로의 상부에 배치되어 공기가 배출됨으로써 제 2포트(11b)를 통하여 마스크 내부로 공기가 공급되는 배출구와; 제어기의 신호에 따라 유입구 및 배출구 의 개폐를 제어하는 회로부를 포함한다. 상기 공기 통로는 내부에 빈 공간이 형성되어 공기가 흐르며, 일측에 구비된 자외선 살균기에 의하여 공 기가 가열되는 경우 밀도가 낮아져서 별도의 펌프없이 상승하게 된다. 이때, 공기 통로는 다양한 형상으로 적용가능하며, 예를 들면 직선형상, 지그 재그형상, 또는 Coil 형상으 로 구현될 수 있다. 이는 마스크의 용도 및 공기 공급량에 따라 적절하게 선택될 수 있다. 그리고, 공기 통로의 상하부에 구비되는 유입구 및 배출구는 MEMS 방식의 게이트로서 제어기의 신호에 의하여 개방 혹은 닫힘량이 제어될 수 있다. 즉, 호흡이 들숨이라고 판단되면 배출구의 개방량을 증가시켜서 보다 많은 량의 공기가 마스크의 내측으로 공급될 수 있도록 한다. 반대로 호흡이 날숨이라고 판단되면 유입구의 개방량을 보통의 마스크와 같은 정도로 공기가 공급될 수 있 도록 한다. 이와 같이, 제어기의 신호에 의하여 유입구 및 배출구의 개폐량이 제어됨으로써 날숨 혹은 들숨에 따라 마스크에 공급되는 공기의 량을 적절하게 조절할 수 있다. 한편, 이러한 공기 공급기의 일측에는 자외선 살균기가 배치됨으로써 공기 통로의 내부에 흐르는 공기를 가열할 수 있다. 즉, 자외선 살균기는 다양한 방식이 적용될 수 있으며, 예를 들면 자외선 램프 방식의 살균기가 적용 될 수 있다. 이러한 자외선 살균기는 공기 공급기의 일측에 나란하게 배치됨으로써 자외선 살균기로부터 발생된 자외 선은 공기 통로의 내측에 흐르는 공기의 온도를 상승시킨다. 따라서, 온도가 상승된 공기는 밀도가 낮아져서 상승하게 되어 배출구를 통하여 외부로 배출될 수 있다. 이때, 공기중에 함유된 바이러스 등의 유해한 미생물이 자외선에 의하여 살균될 수 있다. 즉, 자외선은 바이러스의 DNA의 이중나선구조를 파괴하여 이합체(시클로부탄 피리미딘)를 생성하게 된다. 이때 자외선의 특정 파장이 보다 효과적으로 바이러스를 사멸시키게 된다.(도 4참조) 상기에서는 자외선 살균기로 설명하였지만, 본 발명은 이에 한정되는 것은 아니고 공기 공급기의 공기를 살 균할 수 있는 장치이면 모두 적용가능하다. 그리고, 공기 통로의 유입구 하부에는 필터가 배치됨으로써 바이러스 등의 유해한 미생물을 1차적 으로 살균할 수 있다. 이때, 필터는 다양한 종류의 필터가 포함가능하며, 예를 들면 헤파필터 등을 적용할 수 있다.도면 도면1 도면2 도면3 도면4"}
{"patent_id": "10-2021-0009442", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 마스크를 보여주는 도면이다. 도 2는 도 1에 도시된 공기 공급기 및 UV 살균기와, 통신기기의 구조를 보여주는 도면이다. 도 3은 도 2에 도시된 통신기기의 내부 구조를 개략적으로 보여주는 도면이다. 도 4는 도 2에 도시된 UV 살균기로부터 조사되는 특정 주파수에 의하여 바이러스를 살균하는 상태를 보여주는 그래프이다."}
