{"patent_id": "10-2023-0010661", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0118340", "출원번호": "10-2023-0010661", "발명의 명칭": "아젠다 선택에 대한 회원별 차등 포인트 적립 방법", "출원인": "아젠다북 주식회사", "발명자": "문인식"}}
{"patent_id": "10-2023-0010661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "웹 페이지를 통하여 아젠다에 대한 선택으로 응답한 회원을 대상으로, 포인트를 적립해주는 방식이 서로 상이한제1 유형의 아젠다와 제2 유형의 아젠다를 제시하는 아젠다 선택에 대한 회원별 차등 포인트 적립 방법으로서,상기 제1 유형의 아젠다에 대해, 선택과 무관하게 제1 유형의 아젠다에 대해 선택으로 응답한 회원을 대상으로각각의 회원에게 포인트를 개별적으로 적립해주는 제1 아젠다 포인트 적립 단계; 및상기 제2 유형의 아젠다에 대해, 제2 유형의 아젠다에 대해 선택으로 응답한 회원 중에서, i) 최다 선택으로 응답한 회원을 대상으로 누적된 포인트를 배분하는 단계 또는 ii) 제2 유형의 아젠다와 관련된 게임의 결과와 정합되는 선택으로 응답한 회원을 대상으로 누적된 포인트를 배분하는 제2 아젠다 포인트 적립 단계를 포함하는아젠다 선택에 대한 회원별 차등 포인트 적립 방법."}
{"patent_id": "10-2023-0010661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 제1 및 제2 아젠다 포인트 적립 단계는,상기 제1 유형의 아젠다에 대해, 회원의 선택과 무관하게 포인트를 적립해주고, 상기 제2 유형의 아젠다에 대해, 회원의 선택에 따라 포인트의 적립 여부를 판단하는 것을 특징으로 하는 아젠다 선택에 대한 회원별 차등 포인트 적립 방법."}
{"patent_id": "10-2023-0010661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제2 아젠다 포인트 적립 단계는,상기 제2 유형의 아젠다에 대해, 아젠다에 대한 선택의 종료 시기 이후에, 취합된 선택 중에서 집단적 의견 또는 집단 지성에 해당되는 최다 선택 또는 스포츠 게임의 결과와 정합되는 선택으로 응답한 회원을 선별하고,선별된 회원을 대상으로, 상기 제2 유형의 아젠다에 대해 선택으로 응답한 각각의 회원에게 할당된 포인트의 총누적을 몰아서 적립해주는 것을 특징으로 하는 아젠다 선택에 대한 회원별 차등 포인트 적립 방법."}
{"patent_id": "10-2023-0010661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 제2 아젠다 포인트 적립 단계는, 상기 제2 유형의 아젠다에 대해, 최다 선택 또는 게임의 결과와 정합되는 선택으로 응답한 회원에게 포인트의총 누적을 균등하게 배분하여 적립해주는 것을 특징으로 하는 아젠다 선택에 대한 회원별 차등 포인트 적립 방법."}
{"patent_id": "10-2023-0010661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 제1 아젠다 포인트 적립 단계는,상기 제1 유형의 아젠다에 대한 선택지의 순서를 변경한 중복 체크를 통하여 회원의 선택이 일관성 있게 유지되지 않으면, 중복 체크의 실패(fail)를 웹 페이지 상으로 출력해주고, 중복 체크에 실패한 아젠다의 선택으로 적립된 포인트를 회수하는 것을 특징으로 하는 아젠다 선택에 대한 회원별 차등 포인트 적립 방법.공개특허 10-2024-0118340-3-"}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에서는 아젠다 선택에 대한 회원별 차등 포인트 적립 방법이 개시된다. 상기 회원별 포인트 적립 방법은, 웹 페이지를 통하여 아젠다에 대한 선택으로 응답한 회원을 대상으로, 포인트를 적립해주는 방식이 서로 상이한 제1 유형의 아젠다와 제2 유형의 아젠다를 제시하되, 상기 제1 유형의 아젠다에 대해, 선택과 무관하게 제1 유형 (뒷면에 계속)"}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 아젠다 선택에 대한 회원별 차등 포인트 적립 방법에 관한 것이다."}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "설문 조사에서는 설문 대상의 질의에 앞서, 응답자의 개인 정보를 요청하고, 설문 대상의 질의에 대한 답변을 응답자의 개인 정보에 기반하여 교차 분석할 수 있다. 그러나, 이러한 방식의 교차 분석을 위해서는 매 설문마 다 반복적으로 동일한 개인 정보에 대한 요청 및 응답이 이루어질 필요가 있으며, 응답자의 개인 정보는 대부분 객관적인 정보에 그치는 경우가 많고, 응답자의 개인적인 성향과 같은 주관적인 정보에 대한 데이터는 존재하지 않기 때문에, 설문 질의의 답변에 대한 심층적인 교차 분석을 기대하기는 어렵다."}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시형태는 서로 다른 제1, 제2 아젠다 사이의 유사도를 산출하고, 제1, 제2 아젠다에 대한 동일 한 선택을 한 데이터(회원 정보) 간의 공유되는 속성을 분석하며, 제1, 제2 아젠다에 대한 선택의 결과에 따라 회원별로 포인트를 차등 적립할 수 있는 회원별 포인트 적립 방법을 포함한다. 본 발명의 일 실시형태는 제1 아젠다에 대한 회원의 선택을 회원 정보의 일 속성으로 누적시키고, 제1 아젠다에 대한 선택과 이후에 진행되는 제2 아젠다에 대한 선택 사이의 교차 분석을 통하여 심층적인 교차 분석을 구현하 는 방법을 포함한다."}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적 및 그 밖의 목적을 달성하기 위하여, 본 발명의 아젠다 선택에 대한 회원별 차등 포인트 적립 방법은, 웹 페이지를 통하여 아젠다에 대한 선택으로 응답한 회원을 대상으로, 포인트를 적립해주는 방식이 서로 상이한 제1 유형의 아젠다와 제2 유형의 아젠다를 제시하되, 상기 제1 유형의 아젠다에 대해, 선택과 무관하게 제1 유 형의 아젠다에 대해 선택으로 응답한 회원을 대상으로 각각의 회원에게 포인트를 개별적으로 적립해주는 제1 아 젠다 포인트 적립 단계; 및 상기 제2 유형의 아젠다에 대해, 제2 유형의 아젠다에 대해 선택으로 응답한 회원 중에서, i) 최다 선택으로 응답한 회원을 대상으로 누적된 포인트를 배분하는 단계 또는 ii) 제2 유형의 아젠다 와 관련된 게임의 결과와 정합되는 선택으로 응답한 회원을 대상으로 누적된 포인트를 배분하는 제2 아젠다 포 인트 적립 단계를 포함할 수 있다. 예를 들어, 상기 제1 및 제2 아젠다 포인트 적립 단계는, 상기 제1 유형의 아젠다에 대해, 회원의 선택과 무관하게 포인트를 적립해주고, 상기 제2 유형의 아젠다에 대해, 회원의 선택에 따라 포인트의 적립 여부를 판단할 수 있다. 예를 들어, 상기 제2 아젠다 포인트 적립 단계는, 상기 제2 유형의 아젠다에 대해, 아젠다에 대한 선택의 종료 시기 이후에, 취합된 선택 중에서 집단적 의견 또 는 집단 지성에 해당되는 최다 선택 또는 스포츠 게임의 결과와 정합되는 선택으로 응답한 회원을 선별하고, 선별된 회원을 대상으로, 상기 제2 유형의 아젠다에 대해 선택으로 응답한 각각의 회원에게 할당된 포인트의 총 누적을 몰아서 적립해줄 수 있다. 예를 들어, 상기 제2 아젠다 포인트 적립 단계는, 상기 제2 유형의 아젠다에 대해, 최다 선택 또는 게임의 결과와 정합되는 선택으로 응답한 회원에게 포인트의 총 누적을 균등하게 배분하여 적립해줄 수 있다. 예를 들어, 상기 제1 아젠다 포인트 적립 단계Sms, 상기 제1 유형의 아젠다에 대한 선택지의 순서를 변경한 중복 체크를 통하여 회원의 선택이 일관성 있게 유지되 지 않으면, 중복 체크의 실패(fail)를 웹 페이지 상으로 출력해주고, 중복 체크에 실패한 아젠다의 선택으로 적립된 포인트 를 회수할 수 있다."}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 아젠다 선택에 대한 회원별 차등 포인트 적립 시스템에 의하면, 제1, 제2 아젠다에 대한 선택의 결과 에 따라 회원별로 포인트를 차등 적립하여 참여율이 높은 아젠다를 제공하고, 이로 인한 신뢰도 높은 데이터를 제공할 수 있다. 본 발명의 교차 분석 시스템에 의하면, 제1 아젠다에 대한 회원의 선택을 회원 정보의 일 속성으로 누적시키고, 제1 아젠다에 대한 선택과 이후에 진행되는 제2 아젠다에 대한 선택 사이의 교차 분석을 통하여 심층적인 교차 분석을 구현할 수 있다. 본 발명의 교차 분석 시스템에 의하면, 서로 다른 제1, 제2 아젠다 사이의 유사도를 산출하고, 제1, 제2 아젠다 에 대한 동일한 선택을 한 데이터(회원 정보) 사이에서 공유되는 속성을 분석하여, 제1, 제2 아젠다에 대한 선 택의 결과에 대한 신뢰도를 평가하거나 또는 경시적인 트랜드 내지는 추세의 변화를 감지할 수 있다."}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면들을 참조하여, 본 발명의 일 실시형태에 따른 아젠다의 취합된 선택 결과에 대한 교차 분석 시스템에 대해 설명하기로 한다. 도 1에는 본 발명의 일 실시형태에서, 아젠다의 취합된 선택 결과에 대한 교차 분석 시스템의 기능적인 블록을 보여주는 블록 다이어그램이 도시되어 있다. 도 2에는 본 발명의 일 실시형태에서 처리 서버와 연결된 데 이터 베이스에 저장된 회원 정보의 예시적인 데이터 구조를 보여주는 도면이 도시되어 있다. 도 3에는 특정한 아젠다에 대해 동일한 선택을 한 데이터(회원 정보)를 대상으로 하는 클러스터링을 이해하기 쉽도록 데이터가 갖는 속성을 2차원으로 축소시킨 클러스터링 프로세스를 예시적으로 보여주는 도면이 도시되어 있다. 도 4에는 본 발명의 일 실시형태에서 클러스터링을 통하여 산출된 서로 다른 군집의 중심이 속성 n을 공유하는 것으로 판 단되는 공유 기준을 설명하기 위한 도면이 도시되어 있다. 도 5에는 본 발명의 다른 국면에 따른 서로 다른 제 1, 제2 아젠다의 선택 결과에 대한 교차 분석 시스템의 기능적인 블록을 보여주는 블록 다이어그램이 도시되어 있다. 도 6 및 도 7에는 본 발명의 일 실시형태에서, 아젠다 문장의 문장 표현에 관한 컨텍스트 벡터(context vector)를 추출하기 위하여 적용될 수 있는 BERT 모델을 설명하기 위한 서로 다른 도면들이 도시되어 있다. 도 8 및 도 9에는 아젠다에 대한 선택으로 응답한 회원을 대상으로 포인트를 적립해주는 방식이 서로 상이한 제1유형의 아젠다와 제2 유형의 아젠다를 각각 예시적으로 보여주는 도면들이 도시되어 있다. 도 1을 참조하면, 본 발명의 일 실시형태에 따른 교차 분석 시스템은, 회원의 단말 상에서 구동되는 웹 브 라우저를 통하여 특정한 아젠다(청구범위의 제1 아젠다에 해당됨)를 제시하기 위한 웹 컴포넌트를 포함하는 웹 페이지를 랜더링하고, 아젠다에 대한 회원의 선택 결과를 취합하여 회원의 단말 상으로 선택 결과를 반환 해주는 처리 서버를 포함할 수 있다. 본 발명의 일 실시형태에서, 아젠다(agenda)란 특정한 분야에 한정되지 않으며, 정치, 경제, 사회, 문화, 스포 츠 등과 같은 다양한 분야와, 신제품이나 맛집과 같은 다양한 소재를 포괄할 수 있으며, 현재 이슈가 되고 있는 대중적인 관심사만을 의미하거나 또는 대중적인 관심사에 관한 의견을 취합하기 위한 설문에 제한되지 않으며, 예를 들어, 아젠다를 의뢰하는 회원, 예를 들어, 기업체 회원이나 광고주와 같이, 기획, 개발, 유통과 같은 상 품에 관한 고객 의견 청취를 위하여 또는 광고 효과를 목적으로 하는 다양한 설문을 포괄할 수 있으며, 예를 들 어, 본 발명의 일 실시형태에서, 아젠다(agenda)란 현재 이슈가 되고 있는 대중적인 관심사 외에도, 다양한 목 적, 예를 들어, 제품 기획, 광고, 유통, 판매 등과 같은 다양한 상업적인 목적으로 제시되는 설문을 포괄하는 광의적인 의미로 해석될 수 있다. 본 발명의 일 실시형태에서는, 아젠다를 의뢰하는 회원 내지는 유료 회원의 요청에 따라, 해당되는 아젠다에 대 한 참여 조건을 특정한 회원의 범위로 제한할 수 있으며, 예를 들어, 특정한 지역, 특정한 성별, 특정한 제품의 사용 경험 등과 같이 다양한 범위에 걸쳐서 해당되는 아젠다에 대한 참여 조건을 특정한 회원의 범위를 제한할 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버 내지는 처리 서버가 관리하는 웹 페이지를 통하여 제시 되는 아젠다는, 선택 가능한 몇가지의 선택지와 함께 제시될 수 있으며, 예를 들어, 상기 아젠다에 대한 선택의 결과는 각각의 선택지에 관한 선택의 수치적인 결과가 수반되는 형태로 제공될 수 있다. 예를 들어, 상기 처리 서버는 회원의 단말 상에서 구동되는 웹 브라우저를 통하여, 회원의 단말 상에, 회원의 선택을 위한 웹 컴포넌트를 랜더링해줄 수 있으며, 예를 들어, 상기 처리 서버로부터 제공되는 HTML과 같은 웹 문 서는 아젠다의 제시를 위한 웹 컴포넌트와 함께, 회원의 선택을 위한 웹 컴포넌트를 함께 랜더링해줄 수 있으며, 상기 처리 서버는 웹 문서를 통하여 회원의 단말 상에서 아젠다를 제시하기 위한 웹 컴포넌 트와 회원의 선택을 수신하기 위한 웹 컴포넌트를 서로 이웃한 위치로 랜더링해줄 수 있다. 예를 들어, 상기 처 리 서버는 회원의 선택을 수신하기 위한 웹 컴포넌트로서, 각각의 아젠다에 대한 회원의 선택을 위한 둘 이상 다수의 선택지에 관한 선택 버튼을 출력해줄 수 있다. 그리고, 상기 회원의 단말(200, 단말 상에서 구동되 는 웹 브라우저)은 선택 버튼의 클릭 이벤트에 따라 처리 서버로부터 수신된 웹 문서의 함수를 호출하고, 호출된 함수 내의 접속 경로를 통하여 처리 서버로 접근하여, 해당되는 회원의 아이디와 함께, 선택된 선 택지에 관한 정보를 전달해줄 수 있으며, 전달된 선택지에 관한 정보, 예를 들어, 특정한 아젠다에 관한 회원의 선택은 해당되는 회원의 아이디와 연계된 회원 정보로 데이터 베이스에 저장됨과 함께, 회원의 선택 결과를 포 함하는 집계 정보를 회원의 단말로 전송하여, 회원의 단말 상에서 회원의 선택과 연동하여 현재까지 집계된 선택 결과가 반환될 수 있도록 할 수 있다. 이와 같이, 특정한 아젠다에 대한 회원의 선택은 해당되는 회원의 아이디와 연계되어 저장될 수 있으며, 회원의 선택과 회원의 아이디가 서로 연계되어 저장된다는 것은, 특정한 아젠다에 대한 선택의 결과가 해당되는 회원의 회원 정보로 저장된다는 것을 의미할 수 있으며, 또한, 회원 정보를 데이터로 하여 데이터의 일 속성(데이터의 필드)으로 저장된다는 것을 의미할 수 있다. 상기 처리 서버는 회원의 아이디와 연계하여 회원 정보를 저장해두는 데이터 베이스와 연결될 수 있다. 본 발명의 일 실시형태에서, 상기 회원 정보란, 회원 가입을 위하여 처리 서버가 관리하는 웹 페이지를 통하 여 회원이 입력한 회원 가입 정보를 포함하고, 처리 서버 내지는 처리 서버가 관리하는 웹 페이지로 부터 제시된 특정한 아젠다(청구범위의 제1 아젠다에 해당됨)에 대한 회원의 선택 결과를 반영하여 누적적으로 축적되는 데이터를 포함할 수 있다. 예를 들어, 상기 처리 서버와 연결된 데이터 베이스에는 해당되는 회 원의 회원 정보로서, 특정한 아젠다에 대한 선택의 결과가 누적적으로 축적될 수 있으며, 회원 정보를 데이터로 하여 데이터의 일 속성(데이터의 필드)으로 특정한 아젠다에 대한 선택의 결과가 누적적으로 축적될 수 있다. 본 발명의 일 실시형태에서, 회원 정보란 성명, 연락처 등과 같이 회원 가입 정보로서의 객관적 회원 정보를 포 함하고, 회원 개인의 성향에 대한 주관적 회원 정보를 포함할 수 있다. 본 발명의 일 실시형태에서, 주관적인 회원 정보란, 해당되는 회원의 성향이나 견해 등을 포함할 수 있으며, 정치, 경제, 사회, 문화, 스포츠 등과 같 은 다양한 분야와, 신제품이나 맛집과 같은 다양한 소재를 포괄하는 아젠다에 대한 해당되는 회원의 선택의 결과를 포함할 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버는 특정 아젠다에 관하여 집계된 회원의 선택 결과를 회원 정 보와 연계하여 교차 분석할 수 있다. 예를 들어, 상기 처리 서버는, 특정 아젠다에 관하여 동일한 선택지 를 선택한 회원(회원 정보 내지는 데이터)을 대상으로 클러스터링(clustering)을 수행할 수 있으며, 클러스터링 (clustering)을 통하여 동일한 선택지를 선택한 회원의 회원 정보를 이용하여 교차 분석을 수행할 수 있다. 본 발명의 일 실시형태에서, 교차 분석이란, 특정 아젠다에 관한 선택과, 회원 정보 사이의 상관관계를 분석하는 것으로 이해될 수 있으며, 예를 들어, 특정 아젠다에 관한 선택과 회원의 객관적 및 주관적 정보(회원의 개인 성향 등) 사이의 상관관계를 분석하는 것으로 이해될 수 있다. 도 2를 참조하면, 본 발명의 일 실시형태에서, 데이터 베이스에 저장되는 회원 정보(또는 데이터)는 다수의 회 원에 대한 회원 정보가 열 방향을 따라 열거된 테이블 형태로 저장될 수 있으며, 각각의 회원에 대한 회원 정보 (또는 데이터)는 데이터 레코드에 해당되는 열 요소로 저장될 수 있고, 각각의 회원에 대한 회원 정보 내지는 하나의 데이터 레코드는 행 방향을 따라 서로 다른 유형의 속성을 포함할 수 있으며, 각각의 속성을 정해진 필 드 내지는 정해진 행 요소로 하여, 다수의 속성이 배열된 형태를 가질 수 있다. 예를 들어, 다수의 속성이 배열 된 데이터 레코드는 각각의 회원의 아이디와 연계되어 저장될 수 있으며, 각각의 회원 정보(또는 데이터)에 해 당되는 다수의 데이터 레코드는 처리 서버와 연결된 데이터 베이스에 저장될 수 있다. 예를 들어, 회원 정 보(또는 데이터)에 포함되는 각각의 속성은, 서로 다른 유형의 회원 정보에 해당될 수 있다. 본 발명의 일 실시 형태에서, 회원 정보로 저장되는 속성으로는, 성별, 연령대, 관계(부부, 커플, 싱글), 주거지역, 직업군, 소득, 학력, 종교, 정치성향, 부동산, 투자 등과 같은 다양한 유형의 속성을 포함할 수 있다. 본 발명의 일 실시형태 에서, 상관관계의 분석 대상이 되는 특정 아젠다에 관한 선택은, 처리 서버 내지는 처리 서버에 의해 관리되는 웹 페이지를 통하여 제시된 다수의 선택지 중에서 어느 하나의 선택지에 관한 선택을 의미할 수 있으 며, 이에 따라, 본 발명의 일 실시형태에서, 특정 아젠다와 관련한 선택 결과에서 회원의 선택이란, 연속적인 데이터라기 보다는 각각의 데이터 값이 서로 불연속적인 이산 데이터에 해당된다고 할 수 있다. 예를 들어, 특 정 아젠다에 대한 찬성과 반대의 선택지에 대한 선택과 같이, 회원의 선택은 제시된 선택지(찬성 및 반대) 중에 서 어느 하나의 선택에 관한 것이며, 불연속적인 이산 데이터에 해당된다고 할 수 있다. 또한, 본 발명의 일 실 시형태에서, 회원 정보로서 각각의 속성은 이산 데이터에 해당될 수 있다. 예를 들어, 회원 정보로서 각각의 속 성은 성별, 연령대, 관계(부부, 커플, 싱글)와 같이 서로 연속적이지 않은 이산 데이터에 해당될 수 있다. 이와 같이, 상호 상관관계의 분석 대상이 되는 회원의 선택과 회원 정보는 이산 데이터에 해당될 수 있으며, 본 발명 의 일 실시형태에서는, 클러스터링을 통하여 이산 데이터를 효과적으로 분석할 수 있다. 도 2에서 각각의 속성에 동반하여 표시된 UI(Unit Interval)란 각각의 속성의 유형에 따라 각각의 속성이 갖는 속성 값의 단위 간격을 의미할 수 있으며, 이와 같이, 본 발명의 일 실시형태에서는 각각의 속성이 갖는 속성 값이 적어도 단위 간격만큼 이격된 이산 데이터에 해당될 수 있다. 본 발명의 일 실시형태에서, 클러스터링 대상이 되는 데이터(또는 회원 정보)는 동일한 선택지를 선택한 회원을 대상으로 하는 것이며, 예를 들어, 특정 아젠다에 대해 찬성과 반대의 선택지 중에서 찬성의 선택지를 선택한 일군의 회원을 대상으로 클러스터링을 수행할 수 있으며, 반대의 선택지를 선택한 일군의 회원을 대상으로 또 다른 클러스터링을 수행할 수 있고, 예를 들어, 서로 다른 찬성과 반대의 선택지를 선택한 회원을 대상으로 클 러스터링을 수행하지는 않을 수 있다. 이와 같이, 본 발명의 일 실시형태에서 동일한 선택지를 선택한 회원을 대상으로 클러스터링을 수행함으로써, 클러스터링의 결과로부터 해당되는 선택지를 선택한 회원의 객관적 및/또 는 주관적 정보(회원 정보)와 해당되는 선택 사이의 상관관계를 분석할 수 있다. 본 발명의 일 실시형태에서는 특정 아젠다에 대해 동일한 선택지를 선택한 회원을 대상으로 클러스터링을 수행하므로, 본 발명의 일 실시형태 에서 클러스터링의 대상은 각각의 속성을 배열로 갖는 회원 정보(또는 데이터) 내지는 회원이 대상이 될 수 있 다. 예를 들어, 본 발명의 일 실시형태에서는, 특정 아젠다에 대한 동일한 선택을 한 회원을 대상으로 회원이 갖고 있는 속성(회원 정보의 속성)을 분석하여, 선택과 속성(동일한 선택을 한 회원 사이에서 공유되는 속성) 사이의 상관관계를 정성적으로 분석함으로써, 속성(동일한 선택을 한 회원 사이에서 공유되는 속성)과 선택 사 이의 트랜드 내지는 추세를 파악하는 것이 일 목적일 수 있으며, 이에 따라, 본 발명의 일 실시형태에서는 동일 한 선택을 한 회원 내지는 회원 정보를 데이터로 하여 클러스터링을 수행하고, 동일한 선택을 한 다수의 회원 내지는 회원 정보가 갖고 있는 공통적인 속성(공유되는 속성)을 추출하여, 선택과 속성 사이의 상관관계를 분석 할 수 있다. 본 발명의 일 실시형태에서, 특정한 아젠다에 대한 동일한 선택과, 동일한 선택을 한 회원 정보의 속성(동일한 선택을 한 회원 사이에서 공유되는 속성) 사이의 상관관계를 분석한다는 것은, 아젠다에 대한 동일한 선택과,동일한 선택을 한 회원 사이에서 공유되는 속성 사이에서 서로에 대한 연관성 내지는 상관관계를 추론한다는 것 을 의미할 수 있다. 앞서 설명된 바와 같이, 본 발명의 일 실시형태에서, 동일한 선택을 한 다수의 회원(내지는 회원 정보)을 대상 으로 클러스터링을 수행하는 것은, 처리 서버를 통하여 제시되는 아젠다에 대한 선택이 일군의 선택지 중 에서 어느 하나의 선택지에 관한 선택으로 이루어지기 때문이고, 이에 따라 선택 결과에 관한 데이터는 연속적 인 데이터라기 보다는 불연속적인 이산 데이터에 해당될 수 있기 때문에, 이산 데이터로 취합되는 선택 결과에 서 동일한 선택을 한 다수의 회원을 대상으로 클러스터링을 수행할 수 있다. 보다 구체적으로, 본 발명의 일 실시형태에서는 동일한 선택을 한 회원을 대상으로 클러스터링을 수행하고, 클 러스터링으로부터 생성된 서로 다른 군집의 중심(centroid)이 갖는 속성들 중에서 공유되는 속성을 추출하여, 동일한 선택을 한 회원 사이에서 공유되는 속성을 탐지할 수 있고, 공유되는 속성과 선택 사이의 상관관계, 예 를 들어, 공유되는 속성과 선택 사이의 트랜드 내지는 추세 등을 유추할 수 있다. 본 발명의 일 실시형태에서, 회원 정보로서 다수의 속성은 연속적인 데이터라기 보다는 불연속적인 이산 데이터에 해당될 수 있기 때문에, 회원 정보에 대한 클러스터링 내지는 이산 데이터에 대한 클러스터링을 수행하면, 서로 다른 군집 간의 경계가 용이하게 생성될 수 있으며, 또한 동일한 속성을 공유하는 서로 다른 군집이 형성되기 용이할 수 있다. 다만, 서로 다른 군집 간의 경계는 설명의 편이를 위해 도입된 것이며, 본 발명의 일 실시형태에 따른 클러스터링에서 서로 다른 군집 간의 경계는 생성되지 않을 수 있다. 예를 들어, 본 발명의 일 실시형태에서는 군집의 중심을 산출하고, 회원 정보 내지는 회원 정보를 데이터로 하여 데이터의 서로 다른 속성을 차원으로 하는 다차원 공간 상에 분포된 각각의 데이터를, 해당되는 데이터와 최 근접한 중심의 군집으로 라벨링(또는 클러스터링)하므로, 각각의 군집의 중심을 산출하고 산출된 군집의 중심으로부터의 거리에 따라 각각의 데이터 내지는 회원 정보를 라벨링(또는 클러스터링)하면서 별도로 각각의 군집의 경계를 생성하지는 않을 수 있다(도 3 참조). 도 4를 참조하면, 본 발명의 일 실시형태에서는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심이 공유 하는 속성(속성 m)을 동일한 선택을 한 회원 내지는 회원 정보 사이에서 공유되는 속성으로 인식할 수 있으며, 이에 따라, 동일한 속성을 공유하는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)이 생성되는 것이 유리할 수 있는데, 동일한 속성을 공유하면서 공유되지 않는 속성의 값의 차이로 인한 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 생성은, 연속적인 데이터가 아닌, 불연속적인 이산 데이터에서 보다 촉진될 수 있으며, 예를 들어, 이산 데이터는 서로 다른 속성의 값을 갖는 데이터 간의 경계를 형성하는데 보다 유리할 수 있다. 예를 들어, 본 발명의 일 실시형태에서는, 동일한 선택을 한 회원 내지는 회원 정보를 대상으로 클러스터링을 수행할 수 있으며(도 3 참조), 각각의 서로 다른 유형의 다수의 속성을 포함하는 회원 정보는 다차원 데이터에 해당될 수 있으므로, 다차원의 회원 정보에 대한 클러스터링을 수행할 수 있다. 이때, 각각의 속성의 값이 연속적이지 않고 불연속적인 이산 데이터에 해당될 수 있기 때문에, 불연속적인 값을 갖는 속성에 따라 다차원의 공간 상으 로 플롯된 각각의 데이터(회원 정보에 해당됨) 사이에는 데이터가 없는 빈 공간이 존재하면서, 이들 사이에서 서로 다른 군집을 분류하는 경계가 생성될 가능성이 높을 수 있다. 또한, 본 발명의 일 실시형태에서, 클러스터 링 대상이 되는 데이터에 해당되는 회원 정보는 서로 다른 유형의 다수의 속성을 포함할 수 있고, 회원 정보에 포함된 다수의 속성 중에서 어느 하나의 속성이 공유된다고 하더라도, 공유되지 않는 나머지 다른 속성이 서로 다른 값을 가질 수 있기 때문에, 어느 하나의 속성을 공유하는 데이터(회원 정보)가 하나의 군집으로 분류되기 보다는, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)으로 분류될 가능성이 높을 것으로 이해될 수 있으며, 이에 따라, 본 발명의 일 실시형태에서는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심이 공유하는 속 성을 추출하여, 동일한 선택을 한 회원들 사이에서 공유되는 속성으로 인식할 수 있다. 본 명세서를 통하여 클러스터링의 대상이 되는 데이터란, 회원 정보를 의미할 수 있으며, 상기 클러스터링은 다 수의 속성을 갖는 다차원의 데이터(회원 정보)를 플롯(plot)한 다차원의 공간 상에서, 다시 말하면, 각각의 속 성의 값에 따라 플롯(plot)된 다차원 공간 상에서 서로로부터의 거리에 기반하여, 다수의 데이터 중에서 서로 인접한 데이터를 하나의 군집으로 분류할 수 있다. 보다 구체적으로, 본 발명의 일 실시형태에서, 다수의 데이 터(회원 정보) 각각과 서로 다른 k개의 군집의 중심과의 거리에 기반하여, 각각의 데이터(회원 정보)는, 각각의 데이터와 가장 가까운 중심의 군집으로 분류될 수 있다(도 3 참조). 도 1을 참조하면, 본 발명의 일 실시형태에서, 상기 처리 서버는 클러스터링(clustering)을 수행하기 위한 클러스터링 알고리즘을 수행할 수 있으며, 클러스터링 알고리즘은 스케일링 모듈과, 중심 산출 모듈 과 라벨링 모듈을 포함할 수 있다. 예를 들어, 본 발명의 일 실시형태에서, 상기 클러스터링 알고리즘 내 지는 클러스터링 알고리즘을 수행하는 처리 서버는, 스케일링 모듈과, 중심 산출 모듈과, 라벨 링 모듈을 포함할 수 있으며, 상기 스케일링 모듈은 클러스터링 대상이 되는 다수의 데이터에 대한전처리로서, 각각의 데이터가 갖는 속성의 값을 스케일링 하여 각각의 속성에 대응되는 차원이 동등하게 취급될 수 있도록 할 수 있다. 상기 라벨링 모듈은, 동일한 선택지를 선택한 회원 정보를 데이터로 하여, 각각의 데이터가 갖는 속성의 개수에 해당되는 다차원의 공간 상으로 플롯된 다수의 데이터를 k개의 군집으로 클러스터 링(clustering)할 수 있으며, 상기 중심 산출 모듈은, 클러스터링(clustering)으로부터 생성된 k개의 군집 에 대한 군집의 중심(centroid), 그러니까, 각각의 군집에 대한 k개의 군집의 중심(centroid)을 산출할 수 있다. 본 발명의 일 실시형태에서 상기 처리 서버에 의해 수행되는 클러스터링(clustering) 및 클러스터링 이후 의 교차 분석의 프로세스에 대해 보다 구체적으로 설명하면 이하와 같다. 먼저, 상기 처리 서버는 클러스 터링 대상이 되는 데이터(회원 정보)에 대한 전처리로서, 데이터의 스케일링을 수행할 수 있다. 예를 들어, 본 발명의 일 실시형태에서, 상기 데이터의 스케일링은 각각의 속성에 대응되는 차원을 동등하게 취급하고 각각의 속성이 갖는 속성 값의 수치적인 편차를 제거하여, 각각의 차원에 대한 스케일 편차에 따른 분류의 편중이나 오 류를 차단하기 위하여, 각각의 속성을 정규화된 사이즈로 재편할 수 있다. 예를 들어, 서로 다른 스케일을 갖는 서로 다른 유형의 속성이 스케일링 없이 그대로 클러스터링 된다면, 서로 다른 유형의 속성이 갖는 스케일에 따 라 상대적으로 큰 스케일을 갖는 속성 또는 상대적으로 작은 스케일을 갖는 속성에 의존하여 클러스터링이 수행 될 수 있기 때문에, 클러스터링에 앞서 데이터의 속성에 대한 스케일링을 통하여 각각의 차원에 해당되는 속성 이 동등하게 취급될 수 있도록 하고, 각각의 차원에 해당되는 속성 간의 스케일 편차에 따라 클러스터링이 어느 하나의 속성에 의존하지 않도록 할 수 있다. 도 2를 참조하면, 상기 데이터(회원 정보)에 대한 스케일링에서는, 각각의 서로 다른 유형의 속성의 값을 정규 화시킬 수 있으며, 예를 들어, 각각의 서로 다른 유형의 속성 값을 일정한 스케일로 정규화시킬 수 있고, 예를 들어, 각각의 속성 값에 정의된 최소 값과 최대 값 사이의 스팬(span)을 단위 크기 1로 스케일링시킬 수 있다. 본 발명의 일 실시형태에서, 성별과 같이, 두 개의 클래스를 갖는 유형의 속성의 값에서, 서로 다른 두 개의 클 래스는 0과 1의 값으로 정규화될 수 있으며(UI: 1), 관계(부부, 커플, 싱글)와 같이, 세 개의 클래스를 갖는 유 형의 값에서, 서로 다른 세 개의 클래스는 0, 0.5. 1의 값으로 정규화될 수 있다(UI: 0.5). 도 1 및 도 3을 참조하면, 본 발명의 일 실시형태에서, 데이터(회원 정보)의 속성의 값에 대한 스케일링 후에는, k개의 군집의 중심을 산출할 수 있다. 예를 들어, k개는 분류하고자 하는 군집의 개수에 해당될 수 있 으며, 처리 서버에 대한 입력으로 설정될 수 있는 하이퍼 파라메타(hyper parameter)에 해당될 수 있다. 다만, 본 발명의 다양한 실시형태에서, 상기 k의 값은 군집의 개수를 최적화시키는 또 다른 알고리즘을 통하여 최적으로 산출될 수도 있으며, 예를 들어, 엘보우 매서드(elbow method) 또는 실루엣 분석(silhouette analysis) 등을 이용하여 최적화된 군집의 개수를 산출할 수도 있다. 상기 처리 서버는 하이퍼 파라메타(hyper parameter)로 입력되거나 또는 상기한 바와 같은 최적화된 군집 의 개수를 산출하기 위한 알고리즘을 통하여 출력된 k의 값으로부터 k개의 군집을 분류할 수 있다. 예를 들어, 상기 처리 서버는 클러스터링의 개시 단계에서 다수의 속성을 갖는 데이터가 플롯(plot)된 다차원의 공간 상에서 k개의 군집의 중심을 임의로 선택하게 된다. 예를 들어, 다수의 데이터(회원 정보)에 대한 라벨링이 없 는 상태에서, 다시 말하면, 다수의 데이터 각각에 대한 군집의 분류가 없는 클러스터링의 개시 단계에서, 상기 처리 서버는 각각의 속성 값에 따른 데이터가 플롯된 다차원 공간 상의 임의 위치에 k개의 군집의 중심을 설정할 수 있으며, 이후의 프로세스에서는 이전 단계에서 산출된 k개의 군집의 중심을 기준으로, 그러니까, 각 각의 데이터와 k개의 군집의 중심 사이의 최 근접 거리에 기반하여, 각각의 데이터(회원 정보)를 k개의 군집으 로 분류할 수 있다. 본 명세서를 통하여, 다수의 속성을 갖는 데이터(회원 정보)를 다차원의 공간 상에 플롯(plot)한다는 것은, 상 기 처리 서버로부터 각각의 데이터(회원 정보)가 플롯(plot)된 다차원의 공간이 랜더링된다는 것을 의미한 다기 보다는 처리 서버의 연산 처리를 보다 용이하게 이해하기 위한 이해의 편의를 위하여 도입된 것으로 이해될 수 있으며, 상기 처리 서버는 수치 연산을 통하여 다수의 데이터가 갖는 속성의 값으로부터 k개의 군집을 분류하고, k개의 군집의 중심을 산출하는 것으로 이해될 수 있다. 상기 처리 서버는 각각의 데이터와 k개의 군집의 중심 사이의 거리에 기반하여(최 근접 거리 기반), 각각 의 데이터를 k개의 군집으로 분류할 수 있다. 예를 들어, 상기 처리 서버는 각각의 속성을 차원으로 하는 다차원 공간 상에서 각각의 데이터와 k개의 군집의 중심 사이의 거리에 기초하여, 각각의 데이터를 서로 다른 k 개의 군집으로 분류할 수 있으며, 예를 들어, 각각의 데이터를 각각의 데이터와 가장 인접한 중심을 갖는 군집 으로 분류할 수 있다. 즉, 각각의 데이터는 각각의 데이터와 가장 인접한 중심을 갖는 군집에 속하는 것으로 분류될 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버는 k개의 군집의 중심을 산출하는 제1 프로세스와, 산출된 k의 군집의 중심에 근거하여 각각의 데이터를 k개의 군집으로 분류하는 제2 프로세스를 반복적으로 실행하면서, 제 1, 제2 프로세스의 반복적인 연산을 통하여 더 이상 k개의 군집의 중심이 이동하지 않도록 수렴된 k개의 군집의 중심이 산출될 때까지 상기와 같은 제1, 제2 프로세스의 연산을 반복적으로 수행할 수 있다. 최종적으로, 상기 처리 서버는 각각의 데이터가 속하는, 예를 들어, 하드 클러스터링(hard clustering)을 통하여 각각의 데 이터가 배타적으로 속하는 k개의 군집(k개로 분류된 데이터 세트)과 k개의 군집의 중심(k개로 분류된 데이터 세 트가 형성하는 군집의 중심)을 생성할 수 있으며, 도 2 및 도 4를 참조하면, k개의 군집의 중심은, 각각의 군집 을 형성하는 데이터와 같이 서로 다른 유형의 속성들을 포함할 수 있고, 예를 들어, 각각의 서로 다른 유형의 속성에 대해 서로 다른 속성의 값을 가질 수 있으며, 예를 들어, 해당되는 군집 내지는 데이터 세트를 형성하는 다수의 데이터의 각각의 속성의 값의 평균적인 속성의 값을 가질 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버는 이하에서 설명되는 제1, 제2 프로세스를 수행할 수 있으며, 각각의 제1, 제2 프로세스는 처리 서버의 중심 산출 모듈과 라벨링 모듈을 통하여 수행될 수 있 다. 보다 구체적으로, 상기 중심 산출 모듈은 k개의 군집의 중심을 산출하는 제1 프로세스를 수행할 수 있 고, 상기 라벨링 모듈은 제1 프로세스에서 산출된 군집의 중심에 근거하여 각각의 데이터를 k개의 군집으 로 분류하는 제2 프로세스를 수행할 수 있다. 본 발명의 일 실시형태에서, 상기 k개의 군집의 중심을 산출하는 제1 프로세스는 동일한 군집에 속하는 다수의 데이터와의 거리를 최소화시키는 위치로 산출될 수 있으며, 예를 들어, 동일한 군집에 속하는 각각의 데이터로 부터의 거리의 제곱합을 최소화시키는 위치, 예를 들어, 동일한 군집에 속하는 각각의 데이터로부터의 거리의 제곱합을 최소화시키도록 군집의 중심을 변화시키면서 제곱 합의 미분 값을 제로(zero)로 하는 군집의 중심을 찾을 수 있다. 결과적으로, 동일한 군집에 속하는 데이터로부터의 거리를 최소화시키는 군집의 중심이란, 동일 한 군집에 속한 데이터의 평균 값을 산출하는 것으로 이해될 수 있다. 예를 들어, 군집의 중심이란 동일한 군집 에 속하는 데이터(회원 정보)의 각각의 속성 값의 평균 값을 속성 값으로 가질 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버는 상기한 바와 같은 프로세스를 통하여 산출된 k개의 군집의 중심으로부터 동일한 선택을 한 다수의 회원이 공유하는 속성을 추출할 수 있다. 도 2 및 도 4에서 볼 수 있듯 이, 본 발명의 일 실시형태에서 상기 k개의 군집의 중심(centroid)은 데이터(회원 정보)와 동일하게 다수의 속 성 내지는 각각의 속성에 해당되는 차원을 갖는 다차원 데이터에 해당될 수 있으며, 각각의 군집의 중심은 데이 터와 동일하게 각각의 속성 값을 갖는 배열의 형태를 가질 수 있다. 다만, 본 발명의 일 실시형태에서, 상기 k 개의 군집의 중심은, 각각의 데이터의 속성 값과 같이, 각각의 데이터의 속성에 부여된 값, 예를 들어, 각각의 데이터의 속성에 대해 불연속적인 이산 데이터(예를 들어, 성별의 속성에서 0 및 1이라는 2개의 클래스로 분류 된 이산 데이터)로 부여된 속성의 값만을 갖지 않으며, 예를 들어, 각각의 데이터(회원 정보)의 속성 값의 평균 값과 같이, 각각의 데이터에 부여된 값(불연속적인 이산 데이터) 사이의 값(예를 들어, 성별의 속성에서 0과 1 이라는 2개의 클래스 분류 사이의 값, 예를 들어, 0.5)을 가질 수 있으며, 예를 들어, 성별과 같은 유형의 속성 에 대해, 각각의 데이터는 0과 1의 두 개의 클래스에 대해 두 가지의 값만을 가질 수 있지만, 군집의 중심은 각 각의 데이터의 평균 값을 갖기 때문에, 0과 1 사이의 임의 값을 가질 수 있다. 도 4를 참조하면, 본 발명의 일 실시형태에서, 상기 처리 서버는 산출된 k개의 군집의 중심에 관한 속성의 값으로부터 k개의 군집의 중심 중에서 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심에서 공유되는 속 성(속성 m)을 추출할 수 있다. 예를 들어, 본 발명의 일 실시형태에서, k개의 군집의 중심 중에서 서로 다른 군 집(제i 군집, 제n 군집, 제k 군집)의 중심에서 공유되는 속성(속성 m)이란 k개의 군집의 중심에 속하는 서로 다 른 군집(제i 군집, 제n 군집, 제k 군집)의 중심에서 상대적으로 높은 유사도를 갖는 속성을 의미할 수 있다. 도 4에 도시된 바와 같이, 본 발명의 일 실시형태에서, k개의 군집의 중심에 대해, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심을 쌍으로 하고, 각각의 쌍을 이루는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심에 대해 각각의 속성 별로 유사도를 산출하고, 특정한 속성(속성 m)에 대해 산출된 유사도가 사전에 설정된 공유 기준을 만족할 때, 해당되는 속성(속성 m)이 쌍을 이루는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집) 의 중심에서 공유되는 것으로 이해될 수 있다. 본 발명의 일 실시형태에서, k개의 군집의 중심에 대한 유사도의 산출은 군집의 중심이 갖는 각각의 속성 별로 이루어질 수 있으며, 본 발명의 일 실시형태에서, 각각의 군집의 중심이 갖는 속성 1 내지 속성 n 중에서, 임의의 속성 m에 대한 유사도 산출에서 상기 처리 서버는 k개의 군집의 중심으로부터 k개의 속성 m의 값을 추출하고, 서로 다른 k개의 군집의 중심으로부터 산출된 k개의 속성 m의 값의 차이가 사전에 설정된 공유 기준을 만족하는지 여부를 판단할 수 있다. 예를 들어, k개의 속성 m의 값은 1차원적으로 배열될 수 있으며, 대소 관계에 따라 1차원으로 정렬될 수 있다. 본 발명의 일 실시형태에서, k 개의 군집의 중심으로부터 추출된 k개의 속성 m의 값 중에서 공유 기준을 만족하는 p개(p≤k)의 속성 m의 값을 추출하고, 공유 기준을 만족하는 p개의 속성 m의 값을 갖는 p개의 군집의 중심에 대해 속성 m을 공유하는 것으 로 판단할 수 있다. 이때, 상기 속성 m을 공유하는 중심을 갖는 p개의 군집에 속하는 데이터의 개수에 따라, 예 를 들어, p개의 군집에 속하는 데이터의 개수가 전체 데이터 개수의 절반(50%)을 넘는 경우, 예를 들어, 전체 데이터 개수의 60%~70%를 넘을 경우, 상기 처리 서버는 아젠더에 대한 동일한 선택과 p개의 군집의 중심이 공유하는 속성 m의 값이 서로 상관관계를 갖는 것으로 이해될 수 있다. 예를 들어, 본 발명의 일 실시형태에서, 특정 아젠더에 대해 동일한 선택을 한 전체 데이터(회원 정보)를 k개의 군집으로 분류(클러스터링)할 때, 각각의 군집의 중심이 갖는 속성은, 각각의 군집에 속한 데이터를 대표하는 것으로 이해될 수 있으며, 이에 따라, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심에서 공유되는 속 성(속성 m)은 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 데이터가 공유하는 것으로 이해될 수 있고, 서 로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 데이터의 개수에 따라 전체 데이터 중에서 둘 이상 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)에서 공유되는 속성(속성 m)은, 전체 데이터가 공유하는 특정 아젠더에 대 한 동일한 선택과 상관관계가 있는 것으로 이해될 수 있다. 다만, 본 발명의 일 실시형태에서, 전체 데이터를 분류한 k개의 군집의 중심 중에서 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심이 공유하는 특정한 속 성(속성 m)을 추출한다고 하더라도, 특정한 속성(속성 m)을 공유하는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심 내지는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)에 속하는 데이터의 비율이 상대적으로 낮 다면, 예를 들어, 특정한 속성(속성 m)을 공유하는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심 내지 는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)에 속하는 데이터의 개수가 전체 데이터의 절반(50%)에 미치 지 못한다면, 예를 들어, 전체 데이터의 동일한 선택과의 상관관계가 있다고 하기 위해서는 적어도 전체 데이터 의 절반(50%)을 넘는, 예를 들어, 전체 데이터의 60%~70%를 넘는 데이터가 특정한 속성(속성 m)을 공유할 필요 가 있다고 판단하여 사전에 입력된 수치에 따라 상기 처리 서버로서는 특정한 속성(속성 m)을 공유하는 서 로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심 내지는 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)에 속하는 데이터의 비율이 60%~70%에 미치지 못하면, 상기 특정한 속성(속성 m)이 전체 데이터의 동일한 선택과 상관관계가 있다고 판단하지 않을 수 있다. 본 발명의 일 실시형태에서 특정 아젠다에 대해 동일한 선택을 한 전체 데이터(회원 정보)를 대상으로 k개의 군 집의 중심을 산출하고, k개의 군집의 중심을 대상으로 서로 다른 군집의 중심이 갖는 각각의 속성 별로 유사도 를 산출하며, 산출된 유사도가 사전에 설정된 공유 기준을 만족하면, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심은 해당되는 속성(속성 m)을 공유하는 것으로 인식할 수 있다. 예를 들어, 상기 공유 기준에 대해, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심이 갖는 속성 값의 차이가 해당되는 속성의 단위 간격 (UI, Unit Interval, 예를 들어, 동일한 선택을 한 다수의 데이터에 대한 클러스터링 이전의 전처리에서 각각의 속성의 값은 단위 크기 1로 스케일링될 수 있음)의 절반 이하일 경우, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심은 해당되는 속성(속성 m)을 공유하는 것으로 인식할 수 있다. 도 2를 참조하면, 속성의 단위 간격 (UI)이란, 해당되는 속성의 값이 가질 수 있는 이산 데이터의 간격으로, 예를 들어, 속성의 유형에 따라 달라질 수 있다. 예를 들어, 성별과 같은 속성은 0과 1의 두 개의 클래스를 가질 수 있고, 성별의 속성에서 단위 간격 (UI)은 1에 해당될 수 있다. 이와 달리, 관계와 같은 속성은, 부부, 커플, 싱글의 세 개의 클래스를 가질 수 있 으며, 0과 0.5와 1의 세 개의 클래스를 가질 수 있고, 단위 간격(UI)은 0.5에 해당될 수 있다. 본 발명의 일 실 시형태에서, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심을 대상으로 동일한 유형의 속성(속성 m)의 속성 값의 차이가 해당되는 유형의 속성의 단위 간격(UI)의 절반 이하로 산출되면 서로 다른 군집(제i 군집, 제 n 군집, 제k 군집)의 중심은 해당되는 속성(속성 m)을 공유하는 것으로 볼 수 있지만, 이와 달리, 서로 다른 군 집(제i 군집, 제n 군집, 제k 군집)의 중심이 갖는 속성 값의 차이가 해당되는 속성의 단위 간격(UI)의 절반을 넘으면, 예를 들어, 성별의 속성에서, 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중심이 갖는 성별의 속 성 값의 차이가 0.8이라면, 성별의 속성에서 스케일링된 단위 크기(스팬) 1에 인접하므로, 이들 서로 다른 군집 은 성별이라는 속성을 공유하지 않는 것으로 볼 수 있다. 본 발명의 일 실시형태에서 k개의 군집의 중심을 대상으로 서로 다른 군집(제i 군집, 제n 군집, 제k 군집)의 중 심이 갖는 속성의 유사도를 산출할 때, 상기 유사도는 각각의 속성 별로 산출될 수 있으며, 이에 따라, 서로 다 른 군집(제i 군집, 제n 군집, 제k 군집)의 중심은 서로 다른 둘 이상의 속성을 공유할 수 있다. 예를 들어, 특 정 아젠다에 대해 동일한 선택을 한 데이터(회원 정보)는 둘 이상의 속성을 공유할 수 있으며, 이에 따라, 상기 동일한 선택과 대부분의 데이터에서 공유되는 둘 이상의 속성은 서로 상관관계를 가질 수 있다.도 1을 참조하면, 상기 처리 서버는 다수의 회원의 단말을 대상으로 처리 서버가 관리하는 웹을 통하여 아젠다를 제시할 수 있으며, 아젠다에 대한 선택을 취합할 수 있고, 다수의 회원의 단말로부터 각 각의 아젠다에 대한 선택의 결과를 취합하기 위한 집계 모듈을 포함할 수 있으며, 집계 모듈로부터 취합된 특정한 아젠다(예를 들어, 청구범위의 제1 아젠다)에 대한 선택의 결과에 대한 교차 분석을 수행하기 위 하여, 각각의 특정한 연산 처리를 담당하는 다수의 모듈들을 포함할 수 있다. 예를 들어, 상기 처리 서버는 교 차 분석 내지는 클러스터링 대상의 데이터(예를 들어, 특정한 아젠다에 대해 동일한 선택을 한 일군의 데이터) 를 추출하기 위한 대상 데이터 추출 모듈을 포함할 수 있으며, 대상 데이터의 속성의 값이 갖는 스팬(최대 와 최소 사이)을 단위 크기 1로 스케일링하기 위한 스케일링 모듈을 포함할 수 있고, 또한, 상기 처리 서 버는 분석 대상이 되는 일군의 데이터에 대해 k개의 군집으로 분류하기 위한 라벨링 모듈과 각각의 k 개의 군집의 중심을 산출하기 위한 중심 산출 모듈을 포함할 수 있다. 그리고, 상기 처리 서버는 k개 의 군집 중심으로부터 각각의 속성 1 내지 속성 n 중에서 어느 하나의 속성, 예를 들어, 속성 m에 관한 속성의 값(k개의 속성의 값)을 추출하여 속성의 값의 대소 관계에 따라 정렬하는 속성 추출/정렬 모듈을 포함할 수 있고, 속성 m에 관한 k개의 속성의 값으로부터 공유 기준을 만족하는지 여부를 판단하고 공유 기준을 만족하 는 p개의 군집의 중심을 추출하며, p개의 군집의 중심이 갖는 데이터의 개수에 따라, 예를 들어, 전체 데이터 중에서 60%~70%의 데이터가 공유하는 것으로 판단되면(속성 m을 공유하는 p개의 군집에 속하는 데이터의 개수가 전체 데이터 중의 60%~70%), 특정한 아젠다(청구범위의 제1 아젠다)에 대한 동일한 선택과 속성 m 사이에는 상 관관계가 있다고 판단될 수 있으며, 이를 위해, 상기 처리 서버는 유사도 판단 모듈을 더 포함할 수 있다. 본 발명의 일 실시형태에서, 상기 회원 정보는 회원 가입 정보와 함께, 아젠다에 대한 선택 결과가 누적적으로 축적되는 데이터를 포함할 수 있다. 본 발명의 일 실시형태에서는, 특정 아젠다에 대해 동일한 선택을 한 데이 터를 k개의 군집으로 분류하는데, 이때, 각각의 군집의 중심은 각각의 군집을 대표하는 것으로 이해될 수 있으 며, 보다 구체적으로, 각각의 군집의 중심이 갖는 속성은 해당되는 군집의 속성을 대표하는 것으로 이해될 수 있다(예를 들어, 각각의 군집의 중심은 각각의 군집에 속하는 데이터가 갖는 속성의 평균 값을 가질 수 있음). 본 발명의 일 실시형태에서, 상기 회원 정보 내지는 회원 정보를 데이터로 하는 각각의 데이터에는, 회원 정보 의 일 속성 내지는 데이터의 일 속성으로, 특정 아젠다에 대한 선택의 결과가 누적적으로 축적될 수 있으며, 예 를 들어, 제1 아젠다에 대한 선택의 결과는 회원 정보의 또 다른 유형의 속성으로 저장될 수 있으며, 제1 아젠 다에 대한 선택의 결과가 하나의 속성으로 회원 정보화 내지는 회원 정보를 데이터로 하여 데이터화 되면서 이 후의 제2 아젠다에 대한 선택의 결과에 대한 교차 분석의 대상이 될 수 있다. 즉, 본 발명의 일 실시형태에서, 제2 아젠다에 대해 동일한 선택을 한 데이터(회원 정보)를 대상으로 k개의 군집의 중심을 산출하고 군집의 중심 에서 공유되는 속성을 추출하여 동일한 선택과 공유되는 속성 사이의 상관관계를 분석하는데(예를 들어, 상관관 계를 추론), 본 발명의 일 실시형태에서, 제2 아젠다 이전의 제1 아젠다에 대한 선택 결과가 데이터(회원 정 보)의 속성으로 저장되어 있기 때문에, 결과적으로, 제2 아젠다에 대한 선택의 결과는 제1 아젠다에 대한 선택 의 결과(데이터의 속성)와 교차 분석되는 것으로 이해될 수 있다. 이와 같이, 다수의 아젠다에 대한 선택의 결 과가 데이터(회원 정보)의 속성으로 누적되면서 서로 다른 아젠다 사이의 선택에 대한 교차 분석이 자연스럽게 이루어질 수 있다는 점에서, 본 발명에 의하면, 어느 하나의 아젠다에 대한 선택의 결과를 다차원적으로 분석할 수 있는 분석의 툴이 제공될 수 있다. 도 5 내지 도 7을 참조하면, 본 발명의 일 실시형태에서, 상기 처리 서버는 서로 다른 아젠다 사이의 유사 도를 산출하고, 사전에 설정된 임계 값 이상의 유사도(예를 들어, 공유 기준을 만족하는 유사도)를 갖는 서로 다른 아젠다에 대한 선택의 결과를 교차 분석할 수 있다. 예를 들어, 상기 처리 서버는 서로 다른 제1, 제 2 아젠다 사이의 유사도를 산출할 수 있다. 본 발명의 일 실시형태에서, 상기 제1, 제2 아젠다 사이의 유사도는 자연어 처리(NLP, Natural Language Processing)를 위한 인공지능 모델로부터 컨텍스트 벡터(context vector) 를 추출하고, 추출된 컨텍스트 벡터(context vector) 사이의 유사도(similarity)를 산출하며, 서로 다른 제1, 제2 아젠다 사이의 유사도(similarity)가 사전에 설정된 임계 값 이상으로 산출되면, 이들 제1, 제2 아젠다는 서로 유사한 것으로 판단될 수 있다. 예를 들어, 상기 아젠다로부터 컨텍스트 벡터(context vector)를 추출하는 프로세스는, 아젠다 문장을 입력으로 하여, 아젠다 문장에 대한 문장 표현을 출력하는 자연어 처리(NLP, Natural Language Processing)를 위한 인공지능 모델을 이용하여 수행될 수 있다. 본 발명의 일 실시형태에서 아젠다 문장으로부터 컨텍스트 벡터(context vector)를 추출하기 위한 인공지능 모델로는, BERT(Bidirectional Encoder Representation from Transformer), RNN(Recurrent Neural Network), LSTM(Long Short Term Memory), CNN(Convolution Neural Network) 등이 예시될 수 있다. 도 6을 참조하면, BERT(Bidirectional Encoder Representation from Transformer) 모델을 적용하는 실시형태에 서, 상기 BERT 모델로는, 토큰 임베딩(token embedding), 위치 임베딩(positional embedding), 세그먼트 임베 딩(segment embedding)이 합산된 입력 임베딩이 입력될 수 있으며, BERT 모델은 각각의 토큰(단어)에 대한 표현 값(R)을 출력할 수 있다. 예를 들어, 상기 토큰 임베딩은 하위 단어 토큰화 알고리즘으로 워드피스 토크나이징(word piece tokening)을 적용하여 아젠다 문장을 구성하는 각각의 단어에 대한 토큰화된 표현에 해당될 수 있다. 그리고, 상기 위치 임 베딩은 아젠다 문장 내에서 각각의 단어 내지는 토큰의 순서 정보를 포함하는 위치 인코딩에 해당될 수 있다. 또한, 상기 세그먼트 임베딩은 아젠다 문장이 둘 이상의 문장으로 구성될 때, 아젠다를 구성하는 서로 이웃한 문장 간의 구분 정보에 해당될 수 있다. 상기 BERT 모델은 입력 임베딩을 입력으로 하여, 아젠다 문장을 구성하는 각각의 단어(토큰)의 표현 값(R)을 출 력하는데, 이때, 상기 입력 임베딩에서는 토큰화된 아젠다 문장의 시작 부분에, [CLS] 토큰을 추가하고, 토큰화 된 아젠다 문장의 끝 부분에 [SEP] 토큰을 추가할 수 있으며, [CLS] 토큰의 표현 값, 즉, [CLS] 토큰이 입력된 BERT 모델로부터 출력되는 [CLS] 토큰의 표현 값(R[CLS])을 아젠다 문장의 문장 표현으로 할 수 있다. 즉, 상기 BERT 모델에서, [CLS] 토큰의 표현 값(R[CLS])을 아젠다 문장의 문장 표현으로 사용할 수 있으며, 본 발명의 일 실시형태에서, 아젠다 문장에 대한 컨텍스트 벡터(context vector)로 사용할 수 있다. 도 7을 참조하면, 상기 BERT 모델에서 인코더의 아키텍쳐는, 다수의 어텐션 행렬을 생성하고, 다수의 어텐션 행 렬을 서로 연결하고(concatenate), 가중치 행렬(Wo)을 곱하여, 출력에 해당되는 각각의 단어 내지는 토큰의 표 현 값을 산출하는 멀티 헤드 어텐션을 포함할 수 있다. 멀티 헤드 어텐션 = concatenate(Z1,Z2,쪋,Zs)Wo 상기 BERT 모델에서 어텐션 행렬은 이하와 같은 셀프 어텐션(self- attention)으로부터 생성될 수 있다. 즉, 셀 프 어텐션에서는 쿼리 행렬(Q), 키 행렬(K), 밸류 행렬(V)을 생성하기 위해, WQ, WK, WV라는 3개의 가중치 행렬 을 생성하고, 이 가중치 행렬(WQ, WK, WV)을 입력 행렬에 곱하여 쿼리 행렬(Q), 키 행렬(K), 밸류 행렬(V)을 생 성할 수 있다. 그리고, 쿼리 행렬(쿼리 벡터)과 키 행렬(키 벡터)의 내적(QKT)을 계산하여 유사도 값을 산출하 며, 산출된 내적(QKT)을 키 행렬(키 벡터)의 차원(dK)의 제곱근으로 나누고, 이렇게 산출된 스코어 행렬에 소프 트맥스 함수를 적용하여 정규화를 진행하며, 마지막으로 정규화된 소프트맥스 함수에 밸류 행렬을 곱하여 어텐 션 행렬(Z)을 산출할 수 있다."}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "상기 BERT 모델에서 상기 인코더의 아키텍쳐는 두 개의 서브 레이어를 포함할 수 있는데, 앞서 설명된 멀티 헤 드 어텐션과 피드 포워드 네트워크(FFNN, feed forward neural network)를 포함할 수 있으며, 각각 멀티 헤드 어텐션과 피드 포워드 네트워크를 포함하며 입출력이 순차로 연결된 다수의 인코더 블록을 포함할 수 있다. 예 를 들어, 상기 피드 포워드 네트워크(FFNN)는 전결합층(dense layer)과 활성화 함수로 구성될 수 있다. 이외에, 각각의 인코더는 멀티 헤드 어텐션의 입력 값과 출력 값을 서로 연결하고, 피드 포워드의 입력 값과 출력 값을 서로 연결하는 Add와 정규화를 위한 norm의 구성 요소(Add & norm)를 포함할 수 있다(layer normalization, residual connection). 도 5를 참조하면, 앞서 설명된 바와 같이, 상기 처리 서버는, BERT 모델이나 그 외의 다른 인공지능의 신 경망을 통하여 아젠다 문장의 문장 표현을 추출할 수 있으며, 서로 다른 제1, 제2 아젠다의 문장 표현에 해당되 는 제1, 제2 컨텍스트 벡터(context vector)를 각각 출력할 수 있다. 그리고, 상기 처리 서버는 각각 제1, 제2 아젠다 문장으로부터 추출된 제1, 제2 컨텍스트 벡터 간의 유사도(similarity)를 산출할 수 있는데, 본 발 명의 일 실시형태에서, 제1, 제2 컨텍스트 벡터 간의 코사인 유사도(cosine similarity)를 산출할 수 있다. 예 를 들어, 제1, 제2 컨텍스트 벡터 간의 코사인 유사도(cosine similarity)는 제1, 제2 컨텍스트 벡터 간의 코사 인 각도를 산출하는 것으로, 제1, 제2 컨텍스트 벡터 간의 내적(dot product)으로 산출될 수 있다.상기 처리 서버는, 제1, 제2 아젠다 문장으로부터 추출된 제1, 제2 컨텍스트 벡터 간의 유사도가 사전에 설정된 임계 값 이상이면, 제1, 제2 아젠다가 서로 유사한 것으로 판단할 수 있다. 그리고, 상기 처리 서버 는 서로 유사한 것으로 판단된 제1, 제2 아젠다에 대한 선택의 결과에 대해 교차 분석을 수행할 수 있다. 예를 들어, 제1 아젠다에 대해 동일한 선택(예를 들어, 동일한 찬성의 선택지를 선택)을 한 제1 군의 데이터(회 원 정보)가 공유하는 속성을 추출하고, 유사하게, 제2 아젠다에 대해 동일한 선택(예를 들어, 동일한 찬성의 선 택지를 선택)을 한 제2 군의 데이터(회원 정보)가 공유하는 속성을 추출함으로써, 제1 군의 데이터가 공유하는 제1 속성과 제2 군의 데이터가 공유하는 제2 속성 간의 동일 내지는 유사(실질적 동일) 여부에 따라, 서로 유사 한 제1, 제2 아젠다에 대한 신뢰성을 평가하거나 또는 서로 유사한 제1, 제2 아젠다가 제시된 시간 흐름에 따라 경시적인 트랜드의 변화를 포착할 수 있다. 예를 들어, 상기 처리 서버는, 제1 아젠다에 대해 동일한 선택(예를 들어, 동일한 찬성의 선택지를 선택) 을 한 제1 군의 데이터(회원 정보)를 대상으로 k개의 군집의 중심을 산출하고, 산출된 k개의 군집의 중심을 대 상으로, 서로 다른 군집의 중심이 갖는 속성에 대한 유사도를 산출하며, 산출된 유사도가 사전에 설정된 공유 기준을 만족하면, 서로 다른 군집의 중심은 해당되는 속성을 공유하는 것으로 이해될 수 있으며, 나아가 제1 군 의 데이터는 대체로 해당되는 속성을 공유하는 것으로 이해될 수 있다. 유사하게, 상기 처리 서버는 제2 아젠다에 대해 동일한 선택(예를 들어, 동일한 찬성의 선택지를 선택)을 한 제2 군의 데이터(회원 정보)를 대상으로 k개의 군집의 중심을 산출하고, 산출된 k개의 군집의 중심을 대상으 로, 서로 다른 군집의 중심이 갖는 속성에 대한 유사도를 산출하며, 산출된 유사도가 사전에 설정된 공유 기준 을 만족하면, 서로 다른 군집의 중심은 해당되는 속성을 공유하는 것으로 이해될 수 있으며, 나아가 제2 군의 데이터는 대체로 해당되는 속성을 공유하는 것으로 이해될 수 있다. 상기와 같은 프로세스를 통하여, 서로 유사한 것으로 판단된 서로 다른 제1, 제2 아젠다에 있어서, 제1 아젠다 에 대해 동일한 선택을 한 제1 군의 데이터는 제1 속성을 공유하는 것으로 판단되고, 제2 아젠다에 대해 동일한 선택을 한 제2 군의 데이터 역시 제1 속성을 공유하는 것으로 판단되면, 제1, 제2 아젠다에 대한 선택의 결과가 높은 신뢰도를 갖는 것으로 평가할 수 있다. 이와 달리, 서로 유사한 제1, 제2 아젠다에 있어서, 제1 아젠다에 대해 동일한 선택을 한 제1 군의 데이터는 제 1 속성을 공유하지만, 제2 아젠다에 대해 동일한 선택을 한 제2 군의 데이터는 제1 속성을 공유하지 않고 대신 에, 제1 속성과는 다른 제2 속성을 공유하는 것으로 판단되면, 제1, 제2 아젠다에 대한 선택의 결과가 낮은 신 뢰도를 갖는 것으로 평가할 수 있다. 그러나, 제1, 제2 아젠다가 제시된 시간적인 격차가 상당한 것으로 평가된 다면, 제1, 제2 아젠다의 선택의 결과에 대한 신뢰도 문제라기 보다는, 제1, 제2 아젠다가 제시된 시간 흐름에 따라, 경시적인 트랜드의 변화가 감지된 것으로 이해될 수 있다. 본 발명의 일 실시형태에서, 각각의 아젠다에 대한 선택의 결과는 실시간으로 취합될 수 있으며, 취합된 아젠다 에 대한 교차 분석도 실시간으로 이루어지거나 또는 충분한 데이터 세트의 취합을 통하여 분석 결과에 대한 신 뢰성을 보장할 수 있도록, 각각의 아젠다의 선택에 대한 종료 시간 이후에, 취합된 모든 선택의 결과를 종합하 여 교차 분석을 수행할 수 있다. 이에 따라, 상기 제1 아젠다에 대한 교차 분석이 이루어지고 제1 아젠다에 대 한 선택이 데이터(회원 정보)의 속성으로 누적된 이후에, 제2 아젠다에 대한 교차 분석에서는 데이터(회원 정보)의 속성화된 제1 아젠다와의 교차 분석이 자연스럽게 이루어질 수 있으며, 앞서 설명된 바와 같이, 상기 제1, 제2 아젠다에 대한 유사도를 산출하여 제1, 제2 아젠다가 유사한 것으로 인식한 처리 서버로서는, 예 를 들어, 선행하는 제1 아젠다에 대한 교차 분석을 통하여 데이터 속성화된 제1 아젠다에서 동일한 선택지(예를 들어, 찬성의 선택지)를 선택한 속성(예를 들어, 데이터가 갖는 서로 다른 유형의 속성, 즉, 속성 1 내지 속성 n 중에서 속성 m)을, 후행하는 제2 아젠다에서 동일한 선택지(예를 들어, 찬성의 선택지)를 선택한 데이터가 공 유하지 않는 것으로 판단하면(제2 아젠다에 대해 동일한 선택을 한 데이터가 속성 m을 공유하지 않음), 앞서 설 명된 바와 같이, 제1, 제2 아젠다의 신뢰도를 낮게 평가하거나 또는 제1, 제2 아젠다가 제시된 시간적인 격차를 고려하여, 경시적인 트랜드의 변화가 감지된 것으로 평가할 수 있다. 예를 들어, 선행하는 제1 아젠다에 대한 선택의 결과가 데이터의 속성 m으로 속성화되어, 찬성의 선택지에 대해 0의 속성 값이 부여되고, 반대의 선택지 에 대해 1의 속성 값이 부여되어 각각의 데이터(회원 정보)의 속성 m으로 저장된 이후에, 제2 아젠다에 대한 교 차 분석에서, 예를 들어, 제2 아젠다에 대해 동일한 선택을 한 일군의 데이터에 대한 교차 분석에서 속성 m을 공유하지 않는 것으로 판단되면, 제1, 제2 아젠다가 서로 유사한 것으로 판단되었음에도 불구하고, 제1, 제2 아 젠다에 대한 선택의 결과가 서로 어긋나는 것이므로, 제1, 제2 아젠다의 선택의 결과에 대해 신뢰도가 낮은 것으로 평가할 수 있다. 만일, 제2 아젠다에 대해 동일한 선택을 한 일군의 데이터가 속성 m이 아닌 속성 n을 공 유하는 것으로 판단되면, 그리고, 제1, 제2 아젠다가 제시된 시간적인 격차가 상당한 것으로 판단되면, 제1, 제2 아젠다에 대한 선택의 결과가 서로 어긋나는 현상에 대해, 경시적인 트랜드의 변화가 감지된 것으로 평가할 수 있다. 도 5를 참조하면, 앞서 설명된 바와 같이, 상기 처리 서버는 서로 다른 제1, 제2 아젠다에 대한 유사도를 산출하기 위하여, 서로 다른 제1, 제2 아젠다 문장으로부터 제1, 제2 컨텍스트 벡터를 추출하는 컨텍스트 벡터 추출 모듈(180a)을 포함할 수 있으며, 서로 다른 제1, 제2 컨텍스트 벡터로부터 유사도, 예를 들어, 코사인 유 사도를 산출하는 컨텍스트 벡터 유사도 산출 모듈(180b)을 포함할 수 있다. 그리고, 제1, 제2 아젠다 문장으로 부터 추출된 제1, 제2 컨텍스트 벡터 간의 유사도가 사전에 설정된 임계 이상의 유사도를 갖는 것으로 판단한 처리 서버는, 각각의 제1, 제2 아젠다에 대한 동일한 선택을 한 제1, 제2 군의 데이터로부터 공유되는 속 성을 추출할 수 있고, 이를 위해, 상기 처리 서버는 공유 속성 추출 모듈(180c)을 포함할 수 있다. 또한, 상기 처리 서버는 제1, 제2 아젠다에 대한 동일한 선택을 한 제1, 제2 군의 데이터가 서로 동일한 속성 m 을 공유하는지 또는 서로 다른 속성 m 및 속성 n을 공유하는지에 따라, 제1, 제2 아젠다에 대한 선택의 결과에 대해 높은 신뢰도를 부여하거나 또는 낮은 신뢰도를 부여할 수 있으며, 예를 들어, 제1, 제2 아젠다가 제시된 시점 사이의 시간적인 격차에 따라 트랜드의 변화를 감지할 수 있으며, 이러한 제1, 제2 아젠다에 대한 교차 분 석을 수행하기 위하여, 상기 처리 서버는 교차 분석 모듈(180d)을 더 포함할 수 있다. 이하에서는 교차 분석 외에, 본 발명의 다른 측면에 대해 설명하기로 한다. 본 발명의 일 실시형태에서, 상기 처리 서버 또는 처리 서버에 의해 관리되는 웹을 통한 회원 가입은 간편가입을 통하여 이루어질 수 있으며, 예를 들어, 포털 서비스 등과 같은 다른 서비스를 제공하는 웹 또는 다 른 웹을 관리하는 처리 서버와의 API(Application Programming Interface)를 통하여 회원 정보의 입력이 없이도 간편하게 회원 가입이 이루어질 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버는 처리 서버에 의해 관리되는 웹을 통하여 제시되는 아 젠다의 선택에 대한 신뢰도를 높일 수 있도록, 아젠다의 선택으로 응답하는 회원을 대상으로 적정의 포인트를 적립해줄 수 있다. 예를 들어, 상기 처리 서버로서는 아젠다의 선택 결과에 대한 교차 분석이 충분한 신뢰 성을 확보할 수 있도록 아젠다에 대한 충분한 데이터의 선택을 취합할 필요가 있기 때문에, 아젠다의 선택으로 응답하는 회원을 대상으로 각각의 아젠다에 할당된 포인트를 응답한 회원의 아이디와 연계하여 데이터 베이스에 저장해둘 수 있다. 이와 같이, 상기 처리 서버는 아젠다에 대한 교차 분석의 신뢰성을 높일 수 있도록 충분한 데이터의 선택 의 결과를 취합할 수 있으며, 이를 위해, 아젠다의 선택으로 응답하는 회원을 대상으로 적정의 포인트를 적립해 주는 한편으로, 각각의 아젠다의 선택에 대한 질적인 신뢰성을 확보할 수 있도록 각각의 아젠다와 함께, 웹 상 에 제시되는 선택지의 순서를 변경하여 특정한 아젠다에 대한 회원의 선택이 일관성 있게 이루어지는지에 대해 확인하는 중복 체크를 수행할 수 있다. 이와 같이, 웹 상에서 제시되는 특정 아젠다에 대한 선택지의 순서를 변 경한 중복 체크를 통하여 각각의 회원의 선택이 일관성 있게 이루어지지 않을 경우, 상기 처리 서버로서는, 아젠다의 선택에 응하는 회원의 주의를 환기시키려는 목적에서, 또는 각각의 아젠다에 대한 선택의 질적인 신뢰성을 높이기 위한 목적에서, 해당되는 아젠다에 대한 중복 체크의 실패(fail)를 웹 상으로 출력해주고, 중복 체크에 실패한 아젠다의 선택으로 적립된 포인트를 회수할 수 있다. 후술하는 바와 같이, 상 기 처리 서버는, 처리 서버를 통하여 웹 페이지 상으로 제시된 제1 유형의 아젠다에 대해, 제1 유형 의 아젠다에 대해 선택으로 응답한 회원을 대상으로 선택과 무관하게 선택 자체로 할당된 포인트를 각각의 회원 에게 포인트로 적립해줄 수 있으며, 이러한 제1 유형의 아젠다에 대해 서로 다른 시간에 선택지의 순서를 변경 한 실질적으로 동일한 제1 유형의 아젠다를 제시할 수 있으며, 이러한 중복 체크에 대해 선택이 일관성 있게 이 루어지지 않은 회원을 대상으로, 상기 처리 서버는 중복 체크에 실패(fail)한 제1 유형의 아젠다로부터 적 립된 포인트를 회수할 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버는, 서로 다른 유형의 아젠다에 대한 서로 다른 포인트 정책을 통하여, 많은 회원으로부터 관심도를 유도할 수 있으며, 회원 가입을 촉진할 수 있다. 본 발명의 일 실시형태에 서, 상기 처리 서버 또는 상기 처리 서버에 의해 관리되는 웹을 통하여 제시되는 아젠다는, 각각의 아젠다에 대한 선택으로 응답한 회원을 대상으로 포인트를 적립해주는 제1 유형의 아젠다(소셜 아젠다, 도 8 참 조)와, 각각의 아젠다에 대해 최다 선택(집단적 의견 내지는 집단 지성)으로 응답한 회원을 대상으로 누적된 포 인트를 배분해주거나 또는 스포츠 게임에서와 같이 추후의 게임 결과에 따라 추후의 게임 결과와 정합되는 선택 으로 응답한 회원을 대상으로 누적된 포인트를 적립해주는 제2 유형의 아젠다(아젠다 리그, 도 9 참조)를 포함 할 수 있다. 예를 들어, 상기 제1 유형의 아젠다(도 8 참조)는 회원의 선택과 포인트 적립 여부가 서로 영향을주지 않으며, 예를 들어, 각각의 아젠다에 대한 선택만으로 포인트가 적립될 수 있으나, 제2 유형의 아젠다(도 9 참조)에서는 회원의 선택과 포인트 적립 여부가 서로 연관되어 있으며, 예를 들어, 집단적인 의견이나 집단 지성에 관한 아젠다에서는, 선택의 종료 시기 이후에, 취합된 선택 중에서 집단적인 의견인 집단 지성으로 볼 수 있는 최다 선택 또는 스포츠 게임의 결과와 정합되는 선택으로 응답한 회원을 선별하여 해당되는 제2 유형의 아젠다에 대해 선택으로 응답한 각각의 회원에게 할당된 포인트의 총 누적을 몰아서 적립해줄 수 있으며, 예를 들어, 상기 처리 서버는 아젠다에 대한 각각의 선택으로부터 누적된 포인트를, 집단적인 의견 내지는 집단 지성에 해당되는 최다 선택으로 응답한 회원에게 균등하게 배분하여 적립해줄 수 있다. 또한, 상기 처리 서버 는 스포츠 게임 관련된 아젠다에서, 스포츠 게임의 결과와 정합되는 선택으로 응답한 회원을 선별하고, 각 각의 선택으로부터 누적된 포인트를, 스포츠 게임의 결과와 정합되는 선택으로 응답한 회원을 대상으로 균등하 게 배분해줄 수 있다. 본 발명의 일 실시형태에서, 상기 처리 서버를 통하여 관리되는 포인트 정책은, 웹을 통하여 제시되는 각 각의 아젠다에 대한 선택을 유도하는 한편으로, 포인트의 누적을 통하여 회원의 등급을 상향시켜주는 회원 관리 정책과 맞물려서 각각의 아젠다에 대한 회원의 선택 내지는 응답의 질적인 신뢰성을 확보할 수 있으며, 각각의 회원의 신뢰도 높은 선택을 통하여 아젠다의 취합된 선택 결과에 대한 교차 분석을 통하여 신뢰도 높은 통계 자 료가 작성될 수 있으며, 상대적으로 소수의 표본을 통한 집계로부터 다수의 의견이나 집단 지성을 간파할 수 있 는 통계 자료를 작성할 수 있다. 본 발명의 일 실시형태에서, 회원 정보 내지는 회원 정보를 데이터로 하는 데이터의 속성에 관한 정보(속성의 값)는, 아젠다를 의뢰하는 회원, 예를 들어, 기업체 회원이나 광고주와 같이, 기획, 개발, 유통과 같은 상품에 관한 고객 의견 청취를 위하여 또는 광고 효과를 목적으로, 아젠다를 의뢰하는 회원 내지는 유료 회원의 요청에 따라, 아젠다의 참여 조건이 사전에 설정될 수 있으며, 해당되는 아젠다의 참여 조건의 만족 여부(예를 들어, 성별, 지역, 직업, 관계, 특정 제품의 사용 경험과 같은 참여 조건)를 사전에 확인하는 프로세스를 통하여 해당 되는 회원의 회원 정보 내지는 회원 정보를 데이터로 하는 데이터의 일 속성으로, 해당되는 회원 정보 내지는 데이터의 속성에 관한 정보(속성의 값)가 누적적으로 증가될 수 있고, 이와 같이, 본 발명의 일 실시형태에서는 처리 서버 또는 처리 서버에 의해 관리되는 웹을 통한 회원 가입 시에 많은 정보의 입력을 요구하거 나 또는 각각의 개별적인 아젠다에 수반하여, 중복적으로 개인 정보를 입력하는 번거로움을 피하고, 회원의 가 입시로부터 각각의 아젠다에 대한 선택을 전후로 하여 회원 정보 내지는 회원 정보를 데이터로 하여 데이터의 속성에 관한 정보(속성의 값)를 누적적으로 증가시키는 방식으로, 예를 들어, 각각의 아젠다에 대한 참여 조건 을 입력하거나 또는 각각의 아젠다에 대한 선택을 통하여 회원 정보 또는 데이터의 속성에 관한 정보(속성의 값)를 누적적으로 증가시킬 수 있고, 누적된 회원 정보 또는 데이터의 속성을 이용하여 향후의 아젠다의 선택에 대한 교차 분석을 수행할 수 있다. 본 발명은 첨부된 도면에 도시된 실시예를 참고로 설명되었으나, 이는 예시적인 것에 불과하며, 본 발명이 속하"}
{"patent_id": "10-2023-0010661", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "는 기술분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이 해할 수 있을 것이다."}
{"patent_id": "10-2023-0010661", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1에는 본 발명의 일 실시형태에서, 아젠다의 취합된 선택 결과에 대한 교차 분석 시스템의 기능적인 블록을 보여주는 블록 다이어그램이 도시되어 있다. 도 2에는 본 발명의 일 실시형태에서 처리 서버와 연결된 데이터 베이스에 저장된 회원 정보의 예시적인 데이터 구조를 보여주는 도면이 도시되어 있다. 도 3에는 특정한 아젠다에 대해 동일한 선택을 한 데이터(회원 정보)를 대상으로 하는 클러스터링을 이해하기 쉽도록 데이터가 갖는 속성을 2차원으로 축소시킨 클러스터링 프로세스를 예시적으로 보여주는 도면이 도시되어 있다. 도 4에는 본 발명의 일 실시형태에서 클러스터링을 통하여 산출된 서로 다른 군집의 중심이 속성 n을 공유하는 것으로 판단되는 공유 기준을 설명하기 위한 도면이 도시되어 있다. 도 5에는 본 발명의 다른 국면에 따른 서로 다른 제1, 제2 아젠다의 선택 결과에 대한 교차 분석 시스템의 기능 적인 블록을 보여주는 블록 다이어그램이 도시되어 있다. 도 6 및 도 7에는 본 발명의 일 실시형태에서, 아젠다 문장의 문장 표현에 관한 컨텍스트 벡터(context vecto r)를 추출하기 위하여 적용될 수 있는 BERT 모델을 설명하기 위한 서로 다른 도면들이 도시되어 있다. 도 8 및 도 9에는 아젠다에 대한 선택으로 응답한 회원을 대상으로 포인트를 적립해주는 방식이 서로 상이한 제 1 유형의 아젠다와 제2 유형의 아젠다를 각각 예시적으로 보여주는 도면들이 도시되어 있다."}
