{"patent_id": "10-2023-0071391", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0172839", "출원번호": "10-2023-0071391", "발명의 명칭": "욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법", "출원인": "계명대학교 산학협력단", "발명자": "문경자"}}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)으로서,욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가상현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교육 콘텐츠를 제공하는플랫폼을 운영하는 가상현실 서버(11); 및상기 플랫폼에 접속해, 상기 가상현실 서버(11)에서 제공하는 상기 게임화 욕창 교육 콘텐츠를 학습자에게 가상현실로 제공하는 가상현실 장치(12)를 포함하며,상기 가상현실 장치(12)는,상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 욕창에 관한 강의와 퀴즈를 제공하고, 욕창 사정 및 간호 수행 시의 체크리스트를 가상현실 기반으로 제공하는 프리브리핑부(100);상기 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하고, 부여된 미션에 대응한 간호 수행 결과에 따라 포인트 제공,배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 제공하는 시뮬레이션부(200); 및상기 시뮬레이션부(200)의 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을 대화식으로 실행하는 디브리핑부(300)를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실교육 플랫폼 시스템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 가상현실 서버(11)는,상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 상기 학습자에게 간호사 아바타를 할당하며,상기 가상현실 장치(12)에서는,상기 게임화 욕창 교육 콘텐츠 내에서 상기 간호사 아바타와 상기 대상자의 상호작용 및 상기 학습자의 데이터입력에 따라 상기 욕창 시나리오가 진행되는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 시뮬레이션부(200)는,상기 게임화 욕창 교육 콘텐츠의 욕창 케이스에 따른 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하는 시뮬레이션 진행부(210);상기 게임화 욕창 교육 콘텐츠 내의 대상자의 상호작용에 따라 상기 학습자가 대상자의 정보를 수집하여 욕창발생 위험을 사정한 데이터를 입력받는 욕창 사정부(220);상기 학습자가 상기 대상자에 대한 욕창 간호 수행을 시행하는 데이터를 입력받는 간호 수행부(230); 및상기 욕창 사정부(220) 및 간호 수행부(230)에서 입력받은 데이터를 이용해 상기 시뮬레이션 진행부(210)가 상기 학습자에게 부여한 미션의 수행 결과를 판정하며, 판정한 미션 수행 결과에 따라 리워드를 제공 및 관리하는리워드 관리부(240)을 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10).공개특허 10-2024-0172839-3-청구항 4 제3항에 있어서, 상기 프리브리핑부(100)는,상기 학습자에게 욕창에 관한 강의와 퀴즈를 가상현실 기반으로 제공하는 준비부(110); 및상기 욕창 사정 및 간호 수행 시의 체크리스트를 제공하고, 체크리스트 내용을 가상현실 기반으로 브리핑하는브리핑부(120)를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 욕창 사정부(220)는,상기 가상현실 장치(12)에서 상기 간호사 아바타가 손 소독, 상기 대상자에게 자기소개 및 상기 대상자의 확인을 진행하는 환자 안전부(221);상기 간호사 아바타와 상기 대상자와의 상호작용에 따라 상기 대상자의 불편감을 파악하고 통증 사정에 따른 데이터를 입력받는 대상자 사정부(222);상기 가상현실 내에서 영상으로 제공되는 욕창 사정 도구(Braden Scale)를 이용해, 상기 대상자의 욕창 발생 위험 정도의 사정에 따른 데이터를 입력받는 욕창 발생 위험 사정부(223);상기 대상자의 신체에서 미리 설정된 개수의 욕창 부위를 찾고, 상기 가상현실 내에서 영상으로 제공되는 욕창단계를 이용해 욕창 부위별 욕창 단계를 입력받는 욕창 단계 분류부(224);상기 가상현실을 통해 제공되는 측정장치를 사용해 욕창 부위별 크기를 측정하여 입력받는 욕창 크기 측정부(225); 및상기 대상자 사정부(222), 욕창 발생 위험 사정부(223), 욕창 단계 분류부(224) 및 욕창 크기 측정부(225)에서입력받은 데이터를 입력해 욕창 간호 기록지를 작성하는 기록지 작성부(226)를 포함하는 것을 특징으로 하는,욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 시뮬레이션 진행부(210)는,상기 욕창 단계 분류부(224)에서 찾은 욕창 부위 및 욕창 부위별 욕창 단계에 기초하여, 부위별 단계별 치료 알고리즘에 따른 간호 수행과 관련된 미션을 상기 학습자에게 부여하며,상기 간호 수행부(230)는,상기 간호사 아바타가, 상기 욕창 단계 분류부(224)에서 찾은 욕창 부위에 욕창 부위별 욕창 단계에 기초하여,드레싱 및 바이오포토닉스 센서 부착을 포함하는 욕창 간호 중 어느 하나를 시행하는 간호 시행부(231); 및상기 간호사 아바타가 상기 대상자에게 욕창 예방 교육을 시행하는 예방 교육 시행부(232)를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 디브리핑부(300)는,상기 리워드 관리부(240)가 판정한 상기 학습자의 미션 수행 결과 및 상기 학습자가 제공받은 리워드 정보를 이용해 해당 학습자의 욕창 간호 수행을 분석 및 평가하는 분석부(310); 및상기 분석부(310)의 분석 및 평가 결과를 기초로, 인공지능 챗봇을 통해 상기 학습자와 대화 방식으로 디브리핑을 진행하는 챗봇부(320)를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스공개특허 10-2024-0172839-4-템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항에 있어서, 상기 가상현실 장치(12)는,상기 게임화 욕창 교육 콘텐츠를 이용한 욕창 교육의 효과에 대한 평가 정보를 입력받는 교육 평가부(400)를 더포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "욕창 간호를 위한 게임화 가상현실 교육 방법으로서,욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가상현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교육 콘텐츠를 제공하는플랫폼을 운영하는 가상현실 서버(11); 및상기 플랫폼에 접속해, 상기 가상현실 서버(11)에서 제공하는 상기 게임화 욕창 교육 콘텐츠를 학습자에게 가상현실로 제공하는 가상현실 장치(12)를 포함하는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템(10)에서각 단계가 수행되며,(1) 상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 욕창에 관한 강의와 퀴즈를제공하고, 욕창 사정 및 간호 수행 시의 체크리스트를 가상현실 기반으로 제공하는 단계;(2) 상기 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창 시나리오에 따른욕창 사정 및 간호 수행과 관련된 미션을 부여하고, 부여된 미션에 대응한 간호 수행 결과에 따라 포인트 제공,배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 제공하는 단계; 및(3) 상기 단계 (2)의 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을대화식으로 실행하는 단계를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 단계 (1) 이전에는,(0) 상기 가상현실 서버(11)는, 상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 상기 학습자에게 간호사 아바타를 할당하는 단계를 더 포함하며,상기 단계 (2)에서는,상기 게임화 욕창 교육 콘텐츠 내에서 상기 간호사 아바타와 상기 대상자의 상호작용 및 상기 학습자의 데이터입력에 따라 상기 욕창 시나리오가 진행되는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 단계 (2)는,(2-1) 상기 게임화 욕창 교육 콘텐츠의 욕창 케이스에 따른 욕창 시나리오를 진행하면서, 상기 학습자에게 상기욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하는 단계;(2-2) 상기 게임화 욕창 교육 콘텐츠 내의 대상자의 상호작용에 따라 상기 학습자가 대상자의 정보를 수집하여욕창 발생 위험을 사정한 데이터를 입력받는 단계;(2-3) 상기 학습자가 상기 대상자에 대한 욕창 간호 수행을 시행하는 데이터를 입력받는 단계; 및공개특허 10-2024-0172839-5-(2-4) 상기 단계 (2-3) 및 단계 (2-4)에서 입력받은 데이터를 이용해 상기 단계 (2-1)에서 상기 학습자에게 부여한 미션의 수행 결과를 판정하며, 판정한 미션 수행 결과에 따라 리워드를 제공 및 관리하는 단계를 포함하는것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 단계 (1)은,(1-1) 상기 학습자에게 욕창에 관한 강의와 퀴즈를 가상현실 기반으로 제공하는 단계; 및(1-2) 상기 욕창 사정 및 간호 수행 시의 체크리스트를 제공하고, 체크리스트 내용을 가상현실 기반으로 브리핑하는 단계를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서, 상기 단계 (2-2)는,(2-2-1) 상기 가상현실 장치(12)에서 상기 간호사 아바타가 손 소독, 상기 대상자에게 자기소개 및 상기 대상자의 확인을 진행하는 단계;(2-2-2) 상기 간호사 아바타와 상기 대상자와의 상호작용에 따라 상기 대상자의 불편감을 파악하고 통증 사정에따른 데이터를 입력받는 단계;(2-2-3) 상기 가상현실 내에서 영상으로 제공되는 욕창 사정 도구(Braden Scale)를 이용해, 상기 대상자의 욕창발생 위험 정도의 사정에 따른 데이터를 입력받는 단계;(2-2-4) 상기 대상자의 신체에서 미리 설정된 개수의 욕창 부위를 찾고, 상기 가상현실 내에서 영상으로 제공되는 욕창 단계를 이용해 욕창 부위별 욕창 단계를 입력받는 단계;(2-2-5) 상기 가상현실을 통해 제공되는 측정장치를 사용해 욕창 부위별 크기를 측정하여 입력받는 단계; 및(2-2-6) 상기 단계 (2-2-3) 내지 단계 (2-2-5)에서 입력받은 데이터를 입력해 욕창 간호 기록지를 작성하는 단계를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 단계 (2-1)에서는,상기 욕창 부위 및 욕창 부위별 욕창 단계에 기초하여, 부위별 단계별 치료 알고리즘에 따른 간호 수행과 관련된 미션을 상기 학습자에게 부여하며,상기 단계 (2-3)은,(2-3-1) 상기 간호사 아바타가, 상기 단계 (2-2-4)에서 찾은 욕창 부위에 욕창 부위별 욕창 단계에 기초하여,드레싱 및 바이오포토닉스 센서 부착을 포함하는 욕창 간호 중 어느 하나를 시행하는 단계; 및(2-3-2) 상기 간호사 아바타가 상기 대상자에게 욕창 예방 교육을 시행하는 단계를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 단계 (3)은,(3-1) 상기 단계 (2-4)에서 판정한 상기 학습자의 미션 수행 결과 및 상기 학습자가 제공받은 리워드 정보를 이용해 해당 학습자의 욕창 간호 수행을 분석 및 평가하는 단계; 및(3-2) 상기 단계 (3-1)의 분석 및 평가 결과를 기초로, 인공지능 챗봇을 통해 상기 학습자와 대화 방식으로 디공개특허 10-2024-0172839-6-브리핑을 진행하는 단계를 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서, 상기 단계 (3) 이후에는,(4) 상기 게임화 욕창 교육 콘텐츠를 이용한 욕창 교육의 효과에 대한 평가 정보를 입력받는 단계를 더 포함하는 것을 특징으로 하는, 욕창 간호를 위한 게임화 가상현실 교육 방법."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에 관한 것으로서, 보다 구체적으로는 욕창 간 호를 위한 게임화 가상현실 교육 플랫폼 시스템으로서, 욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가상현실 기반으로 구현하되, 간호 수행 결과에 따라 (뒷면에 계속)"}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가상현실 교육 플랫폼 시스템 및 교육 방법에 관한 것으로서, 보다 구체적으로는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에 관한 것이다."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 발명의 일실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 욕창(Pressure Injury, Pressure Ulcer, Pressure Sore, 압박궤양)이란, 오랫동안의 부동자세로 인해 신체 한 부위에 압력을 지속해서 받으면 그 부위에 혈액순환 장애가 오고 산소와 영양공급이 부족하여 압력을 받는 부위 의 피부, 피하지방, 근육의 허혈로 인하여 발생하는 피부 손상을 의미한다. 대개 중증 환자가 오래 병상에 누 워있을 때 바닥에 직접 닿는 부위에 생기는 압박 괴사이다. 오랫동안 움직임이 없는 경우, 뼈가 튀어나온 부위 의 피부가 눌려 혈액순환이 되지 않아 산소 부족으로 인해 피부가 죽고, 썩어서 욕창이 생기게 된다. 욕창은 어느 부위에서나 발생할 수 있으나 주로 엉치뼈, 넓적다리뼈의 큰 돌기, 무릎뼈, 발꿈치, 정강이뼈 등의 뼈 돌출부와 같이 압박이 많이 가해지는 부위에서 자주 발생한다. 욕창의 초기에는 압력을 받는 부위의 피부가 붉어지고, 이어서 그 부위의 피부에 오려낸 듯한 궤양이 생기며, 더 나아가 피부의 괴사가 진행되게 된다. 욕창은 4단계의 과정을 거친다. 욕창 1단계에서는, 피부 손상은 관찰되지 않으나 피부가 따듯하고 단단하다. 압력을 제거한 후 5분이 지나도 계속 피부가 붉은색을 띠게 된다. 압력이 완화되면 원래 상태로 회복되며 체위 변경으로 회복될 수 있다. 욕창 2단계에서는, 피부가 파열되어 찰과상과 물집 등이 나타난다. 부종이 심하고 지방층까지 침범하면 통증이 발생한다. 이 경우 압력이 완화되면 1~2주 이내에 회복될 수 있다. 욕창 3단계에 서는 피하조직까지 괴사가 일어나 악취를 동반한 삼출물이 나타난다. 통증은 없으나 부종이 심하고 괴사조직이 관찰되며, 이 괴사조직을 제거하고 회복하는 데 수개월이 걸리게 된다. 욕창 4단계에서는, 근육, 뼈, 지지조직 (건, 관절) 등의 광범위한 조직 괴사가 일어난다. 괴사조직을 볼 수 있으며 수술적인 치료(피부이식, 피판술 등)가 필요하다. 최근에는, 기존의 4단계의 욕창 단계에 심부 조직 의심과 미분류 욕창이 추가되어 총 6단계로 분류하기도 한다. 욕창은 전체 환부가 일정한 손상을 입기보다는 부분적으로 욕창의 정도가 다르게 나타난다. 즉, 동일한 환부라 도 부위에 따라 1단계에서 4단계까지의 다양한 형태를 보인다. 따라서, 동일한 환부라도 적절한 처치와 치료 방법이 요구된다. 특히, 욕창은 환부의 크기와 정도가 다양하게 나타나므로, 이에 대한 정확한 진단과 그에 맞 는 치료의 적용이 필요하다. 이같이 욕창 단계의 진단에는 명확한 기준이 있으며, 의료진이 육안으로 욕창을 진단하고 그 단계를 결정한다. 또한, 욕창을 예방하기 위해서는 욕창 발생 위험 정도를 사정하고 파악된 욕창의 위험 정도나 진단된 욕창 단계에 따라 적절한 예방 간호를 수행해야 한다. 이러한 욕창의 간호는 간호사에 의해 수행되므로, 교재 등의 이론 적인 교육을 벗어나 좀 더 현실적으로 욕창 예방을 위해 간호사가 훈련할 수 있는 시스템 및 방법이 필요하다. 본 발명과 관련된 선행특허로, 공개특허 제10-2012-0072701호(발명의 명칭: 욕창 관리 장치 및 방법, 공개일자: 2012년 07월 04일) 등이 개시된 바 있다. 전술한 배경 기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지 기술이라 할 수는 없다."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 욕창 발생 임상 케 이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가상현실 기반으로 구 현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교육 콘텐츠를 제공하고, 가상현실 장치에서 게임화 욕창 교육 콘텐츠를 통해 학습자가 콘텐츠 내의 대상자와 상호작용하며 학습하도록 함으로써, 욕창의 사 정과 간호를 가상현실 기반으로 실감 나게 수행할 수 있어 이론적인 교육을 벗어나 현실적인 교육을 할 수 있고, 게임 요소를 통해 교육 효과를 높일 수 있는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법을 제공하는 것을 그 목적으로 한다. 또한, 본 발명은, 게임화 욕창 교육 콘텐츠에서 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지 능 챗봇을 통해 디브리핑을 대화식으로 진행함으로써, 교수자나 다른 학습자 없이 단독 학습 시에도 충분한 성 찰, 토론, 피드백 등을 통한 학습 촉진을 할 수 있는, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법을 제공하는 것을 또 다른 목적으로 한다. 다만, 본 발명이 이루고자 하는 기술적 과제는 상기한 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술 적 과제들이 존재할 수 있고, 명시적으로 언급하지 않더라도"}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이나 실시 형태로부터 파악될 수 있는 목적이나 효과도 이에 포함됨은 물론이다."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "과제의 해결 수단 상기한 목적을 달성하기 위한 본 발명의 특징에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템은, 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템으로서, 욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가 상현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교육 콘텐츠를 제공하는 플랫폼을 운영하는 가상현실 서버; 및 상기 플랫폼에 접속해, 상기 가상현실 서버에서 제공하는 상기 게임화 욕창 교육 콘텐츠를 학습자에게 가상현실 로 제공하는 가상현실 장치를 포함하며, 상기 가상현실 장치는, 상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 욕창에 관한 강의와 퀴즈를 제공하고, 욕 창 사정 및 간호 수행 시의 체크리스트를 가상현실 기반으로 제공하는 프리브리핑부; 상기 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창 시나리오에 따른 욕 창 사정 및 간호 수행과 관련된 미션을 부여하고, 부여된 미션에 대응한 간호 수행 결과에 따라 포인트 제공, 배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 제공하는 시뮬레이션부; 및 상기 시뮬레이션부의 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을 대화식으로 실행하는 디브리핑부를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 가상현실 서버는, 상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 상기 학습자에게 간호사 아바타를 할당하며, 상기 가상현실 장치에서는, 상기 게임화 욕창 교육 콘텐츠 내에서 상기 간호사 아바타와 상기 대상자의 상호작용 및 상기 학습자의 데이터 입력에 따라 상기 욕창 시나리오가 진행될 수 있다. 더욱 바람직하게는, 상기 시뮬레이션부는, 상기 게임화 욕창 교육 콘텐츠의 욕창 케이스에 따른 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하는 시뮬레이션 진행부; 상기 게임화 욕창 교육 콘텐츠 내의 대상자의 상호작용에 따라 상기 학습자가 대상자의 정보를 수집하여 욕창 발생 위험을 사정한 데이터를 입력받는 욕창 사정부; 상기 학습자가 상기 대상자에 대한 욕창 간호 수행을 시행하는 데이터를 입력받는 간호 수행부; 및 상기 욕창 사정부 및 간호 수행부에서 입력받은 데이터를 이용해 상기 시뮬레이션 진행부가 상기 학습자에게 부 여한 미션의 수행 결과를 판정하며, 판정한 미션 수행 결과에 따라 리워드를 제공 및 관리하는 리워드 관리부을 포함할 수 있다. 더더욱 바람직하게는, 상기 프리브리핑부는, 상기 학습자에게 욕창에 관한 강의와 퀴즈를 가상현실 기반으로 제공하는 준비부; 및 상기 욕창 사정 및 간호 수행 시의 체크리스트를 제공하고, 체크리스트 내용을 가상현실 기반으로 브리핑하는 브리핑부를 포함할 수 있다. 더더욱 바람직하게는, 상기 욕창 사정부는, 상기 가상현실 장치에서 상기 간호사 아바타가 손 소독, 상기 대상자에게 자기소개 및 상기 대상자의 확인을 진 행하는 환자 안전부; 상기 간호사 아바타와 상기 대상자와의 상호작용에 따라 상기 대상자의 불편감을 파악하고 통증 사정에 따른 데 이터를 입력받는 대상자 사정부; 상기 가상현실 내에서 영상으로 제공되는 욕창 사정 도구(Braden Scale)를 이용해, 상기 대상자의 욕창 발생 위 험 정도의 사정에 따른 데이터를 입력받는 욕창 발생 위험 사정부; 상기 대상자의 신체에서 미리 설정된 개수의 욕창 부위를 찾고, 상기 가상현실 내에서 영상으로 제공되는 욕창 단계를 이용해 욕창 부위별 욕창 단계를 입력받는 욕창 단계 분류부; 상기 가상현실을 통해 제공되는 측정장치를 사용해 욕창 부위별 크기를 측정하여 입력받는 욕창 크기 측정부; 및 상기 대상자 사정부, 욕창 발생 위험 사정부, 욕창 단계 분류부 및 욕창 크기 측정부에서 입력받은 데이터를 입 력해 욕창 간호 기록지를 작성하는 기록지 작성부를 포함할 수 있다. 더욱더 바람직하게는, 상기 시뮬레이션 진행부는, 상기 욕창 단계 분류부에서 찾은 욕창 부위 및 욕창 부위별 욕창 단계에 기초하여, 부위별 단계별 치료 알고리 즘에 따른 간호 수행과 관련된 미션을 상기 학습자에게 부여하며,상기 간호 수행부는, 상기 간호사 아바타가, 상기 욕창 단계 분류부에서 찾은 욕창 부위에 욕창 부위별 욕창 단계에 기초하여, 드레 싱 및 바이오포토닉스 센서 부착을 포함하는 욕창 간호 중 어느 하나를 시행하는 간호 시행부; 및 상기 간호사 아바타가 상기 대상자에게 욕창 예방 교육을 시행하는 예방 교육 시행부를 포함할 수 있다. 더더욱 바람직하게는, 상기 디브리핑부는, 상기 리워드 관리부가 판정한 상기 학습자의 미션 수행 결과 및 상기 학습자가 제공받은 리워드 정보를 이용해 해당 학습자의 욕창 간호 수행을 분석 및 평가하는 분석부; 및 상기 분석부의 분석 및 평가 결과를 기초로, 인공지능 챗봇을 통해 상기 학습자와 대화 방식으로 디브리핑을 진 행하는 챗봇부를 포함할 수 있다. 더더욱 바람직하게는, 상기 가상현실 장치는, 상기 게임화 욕창 교육 콘텐츠를 이용한 욕창 교육의 효과에 대한 평가 정보를 입력받는 교육 평가부를 더 포함 할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 특징에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법은, 욕창 간호를 위한 게임화 가상현실 교육 방법으로서, 욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가 상현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교육 콘텐츠를 제공하는 플랫폼을 운영하는 가상현실 서버; 및 상기 플랫폼에 접속해, 상기 가상현실 서버에서 제공하는 상기 게임화 욕창 교육 콘텐츠를 학습자에게 가상현실 로 제공하는 가상현실 장치를 포함하는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서 각 단계가 수행되며, 상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 욕창에 관한 강의와 퀴즈를 제공하고, 욕창 사정 및 간호 수행 시의 체크리스트를 가상현실 기반으로 제공하는 단계; 상기 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하고, 부여된 미션에 대응한 간호 수행 결과에 따라 포인트 제공, 배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 제공하는 단계; 및 상기 단계 의 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을 대화식으로 실행하는 단계를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 단계 이전에는, 상기 가상현실 서버는, 상기 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 상기 학습자에게 간호사 아바타를 할당하는 단계를 더 포함하며, 상기 단계 에서는, 상기 게임화 욕창 교육 콘텐츠 내에서 상기 간호사 아바타와 상기 대상자의 상호작용 및 상기 학습자의 데이터 입력에 따라 상기 욕창 시나리오가 진행될 수 있다. 더욱 바람직하게는, 상기 단계 는, (2-1) 상기 게임화 욕창 교육 콘텐츠의 욕창 케이스에 따른 욕창 시나리오를 진행하면서, 상기 학습자에게 상기 욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하는 단계; (2-2) 상기 게임화 욕창 교육 콘텐츠 내의 대상자의 상호작용에 따라 상기 학습자가 대상자의 정보를 수집하여 욕창 발생 위험을 사정한 데이터를 입력받는 단계; (2-3) 상기 학습자가 상기 대상자에 대한 욕창 간호 수행을 시행하는 데이터를 입력받는 단계; 및 (2-4) 상기 단계 (2-3) 및 단계 (2-4)에서 입력받은 데이터를 이용해 상기 단계 (2-1)에서 상기 학습자에게 부 여한 미션의 수행 결과를 판정하며, 판정한 미션 수행 결과에 따라 리워드를 제공 및 관리하는 단계를 포함할 수 있다. 더더욱 바람직하게는, 상기 단계 은, (1-1) 상기 학습자에게 욕창에 관한 강의와 퀴즈를 가상현실 기반으로 제공하는 단계; 및 (1-2) 상기 욕창 사정 및 간호 수행 시의 체크리스트를 제공하고, 체크리스트 내용을 가상현실 기반으로 브리핑 하는 단계를 포함할 수 있다. 더더욱 바람직하게는, 상기 단계 (2-2)는, (2-2-1) 상기 가상현실 장치에서 상기 간호사 아바타가 손 소독, 상기 대상자에게 자기소개 및 상기 대상자의 확인을 진행하는 단계; (2-2-2) 상기 간호사 아바타와 상기 대상자와의 상호작용에 따라 상기 대상자의 불편감을 파악하고 통증 사정에 따른 데이터를 입력받는 단계; (2-2-3) 상기 가상현실 내에서 영상으로 제공되는 욕창 사정 도구(Braden Scale)를 이용해, 상기 대상자의 욕창 발생 위험 정도의 사정에 따른 데이터를 입력받는 단계; (2-2-4) 상기 대상자의 신체에서 미리 설정된 개수의 욕창 부위를 찾고, 상기 가상현실 내에서 영상으로 제공되 는 욕창 단계를 이용해 욕창 부위별 욕창 단계를 입력받는 단계; (2-2-5) 상기 가상현실을 통해 제공되는 측정장치를 사용해 욕창 부위별 크기를 측정하여 입력받는 단계; 및 (2-2-6) 상기 단계 (2-2-3) 내지 단계 (2-2-5)에서 입력받은 데이터를 입력해 욕창 간호 기록지를 작성하는 단 계를 포함할 수 있다. 더욱더 바람직하게는, 상기 단계 (2-1)에서는, 상기 욕창 단계 분류부에서 찾은 욕창 부위 및 욕창 부위별 욕창 단계에 기초하여, 부위별 단계별 치료 알고리 즘에 따른 간호 수행과 관련된 미션을 상기 학습자에게 부여하며, 상기 단계 (2-3)은, (2-3-1) 상기 간호사 아바타가, 상기 단계 (2-2-4)에서 찾은 욕창 부위에 욕창 부위별 욕창 단계에 기초하여, 드레싱 및 바이오포토닉스 센서 부착을 포함하는 욕창 간호 중 어느 하나를 시행하는 단계; 및 (2-3-2) 상기 간호사 아바타가 상기 대상자에게 욕창 예방 교육을 시행하는 단계를 포함할 수 있다. 더더욱 바람직하게는, 상기 단계 은, (3-1) 상기 단계 (2-4)에서 판정한 상기 학습자의 미션 수행 결과 및 상기 학습자가 제공받은 리워드 정보를 이 용해 해당 학습자의 욕창 간호 수행을 분석 및 평가하는 단계; 및 (3-2) 상기 단계 (3-1)의 분석 및 평가 결과를 기초로, 인공지능 챗봇을 통해 상기 학습자와 대화 방식으로 디 브리핑을 진행하는 단계를 포함할 수 있다.더더욱 바람직하게는, 상기 단계 이후에는, 상기 게임화 욕창 교육 콘텐츠를 이용한 욕창 교육의 효과에 대한 평가 정보를 입력받는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에 따르면, 욕 창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가상 현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교육 콘텐츠를 제공하고, 가상현실 장치에서 게임화 욕창 교육 콘텐츠를 통해 학습자가 콘텐츠 내의 대상자와 상호작용하며 학습하도록 함으로써, 욕창의 사정과 간호를 가상현실 기반으로 실감 나게 수행할 수 있어 이론적인 교육을 벗어나 현실적 인 교육을 할 수 있고, 게임 요소를 통해 교육 효과를 높일 수 있다. 또한, 본 발명에서 제안하고 있는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에 따르 면, 게임화 욕창 교육 콘텐츠에서 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을 대화식으로 진행함으로써, 교수자나 다른 학습자 없이 단독 학습 시에도 충분한 성찰, 토론, 피드백 등을 통한 학습 촉진을 할 수 있다. 더불어, 본 발명의 다양하면서도 유익한 장점과 효과는 상술한 내용에 한정되지 않으며, 본 발명의 구체적인 실 시 형태를 설명하는 과정에서 보다 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수있으며, 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였 다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 이하의 실시예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아니다. 따라서 본 발명과 동일한 기능을 수행하는 동일 범위의 발명 역시 본 발명의 권리 범위에 속할 것이다. 또한, 본 발명의 각 실시예에 포함된 각 구성, 과정, 공정 또는 방법 등은 기술적으로 상호간 모순되지 않는 범 위 내에서 공유될 수 있다. 또한, 본 발명에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단 말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수 있다. 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 특히, 본 발명의 각 실시예에 따른 시스템을 실행시키기 위한 수단으로는 애플리케이션(Application), 또는 웹 서버일 수 있으며, 이 애플리케이션, 또는 웹 서버를 기록한 기록매체를 읽을 수 있는 수단인 단말로는, 일반적 인 데스크톱이나 노트북 등의 일반 PC뿐만 아니라, 스마트 폰, 태블릿 PC, 등의 모바일 단말기를 포함할 수 있 다. 이하, 첨부된 도면을 참고하여 본 발명의 실시예들을 상세히 설명하도록 한다. 도 1은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템의 구성을 도시한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫 폼 시스템은, 가상현실 서버 및 가상현실 장치를 포함하여 구성될 수 있다. 가상현실 서버는, 욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사 정 및 간호 수행을 가상현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교 육 콘텐츠를 제공하는 플랫폼을 운영할 수 있다. 보다 구체적으로, 가상현실 서버는, 욕창의 단계별, 부위 별, 간호 수행이 이루어지는 병원 종류별, 대상자 특징별로 욕창 발생 임상 케이스를 나누고, 욕창 발생 임상 케이스에 따라 여러 대상자의 욕창 시나리오를 여러 가지로 구성할 수 있다. 가상현실 서버는, 이와 같이 구성된 각 욕창 시나리오에 따른 욕창 사정 및 간호 수행을 가상현실 기반으로 구현한 게임화 욕창 교육 콘텐츠 를 제작 및 저장하고, 네트워크를 통해 플랫폼에 접속한 가상현실 장치에 게임화 욕창 교육 콘텐츠를 제공 할 수 있다. 예를 들어, 욕창 발생 임상 케이스에 따라 THR(Total Hip Replacement) 수술(고관절 치환술) 후 대상자의 욕창 시나리오를 구성해 게임화 욕창 교육 콘텐츠를 제공할 수 있다. 여기서, 가상현실 서버가 운영하는 플랫폼은 네트워크를 통해 게임화 욕창 교육 콘텐츠를 제공하고, 콘텐츠 운영 서비스를 제공하는 온라인 플랫폼일 수 있다. 따라서 학습자는 온라인 게임 서비스를 이용하는 것처럼, 플랫폼에 접속해 가상현실 장치를 통해 편리하게 게임화 욕창 교육 콘텐츠를 이용할 수 있다. 이때, 가상 현실 장치에서 실행되는 게임화 욕창 교육 콘텐츠에서 학습자는 욕창 시나리오를 선택해 학습할 수 있으며, 미리 설정된 순서, 임의로 또는 교수자에 의해 해당 학습자에게 할당된 욕창 시나리오를 학습할 수도 있다. 한편, 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN) 또는 부가 가치 통신망(Value Added Network; VAN) 등과 같은 유선 네트워크나 이동 통신망(mobile radio communication network), 위성 통신망, 블루투스(Bluetooth), Wibro(Wireless Broadband Internet), HSDPA(High Speed Downlink Packet Access), LTE(Long Term Evolution), 3/4/5/6G(3/4/5/6th Generation Mobile Telecommunication) 등과 같은 모든 종류의 무선 네트워크로 구현될 수 있다. 가상현실 서버가 제공하는 게임화 욕창 교육 콘텐츠는, 가상현실 장치를 통해 학습자에게 제공되면서 학습자와의 상호작용을 통해 욕창 사정 및 간호 수행을 할 수 있도록 복수의 미션을 제공하며, 이러한 미션의 수행 결과에 따라 포인트 제공, 배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 포함하는 가상현실 콘텐츠일 수 있다. 즉, 게임화 욕창 교육 콘텐츠는 게임 요소를 포함하여 게임화한 교육 콘 텐츠이며, 여기서 게임 요소는 미션과 리워드로 구성될 수 있다. 예를 들어, 욕창 발생 가능성이 있는 환자인 THR 수술 후 대상자를 가상현실 내의 NPC(Non-Player Character)로 구현하고, 콘텐츠 내에서 학습자가 간호사 역할을 하여 대상자에 대한 욕창 사정 및 간호를 수행하는 욕창 시나리오를 가상현실 콘텐츠로 구현하면서, 욕 창 사정 및 간호 수행과 관련된 미션을 제공하고, 미션 수행 결과에 따라 리워드를 제공할 수 있다. 여기서, 욕창 시나리오는 실제 THR 수술 후 대상자의 욕창 발생 임상 케이스를 기반으로 구성될 수 있다. 가상현실 서버는, 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 간호사 아바타를 할당하 며, 가상현실 장치에서는, 게임화 욕창 교육 콘텐츠 내에서 간호사 아바타와 대상자 사이의 상호작용 및 학 습자의 데이터 입력에 따라 욕창 시나리오가 진행될 수 있다. 즉, 게임화 욕창 교육 콘텐츠 내에서 대상자는 NPC와 같은 콘텐츠 내부 캐릭터로 구현되며, 학습자는 플레이어로서 간호사 역할을 하여 학습을 할 수 있다. 이를 위해, 가상현실 서버는 간호사 아바타를 학습자에게 할당하여 가상현실 게임화 욕창 교육 콘텐츠 내에 서 간호사 아바타가 학습자의 제어에 따라 욕창 사정 및 간호를 수행하도록 할 수 있다. 본 발명에서는, 대퇴경부골절로 THR 수술을 받은 고령 환자의 욕창 발생 임상 케이스를 기반으로 욕창 시나리오 를 구성하고, 교수 설계 모형인 ADDIE를 활용해 욕창의 사정, 분류, 측정, 예방 간호를 학습할 수 있도록 가상 현실 기반으로 게임화 욕창 교육 콘텐츠를 개발하였다. 개발된 게임화 욕창 교육 콘텐츠는 학습자의 플레이에 따라 정도의 차이가 있으나, 약 7분에서 10분 정도일 수 있다. 가상현실 장치는, 플랫폼에 접속해 가상현실 서버에서 제공하는 게임화 욕창 교육 콘텐츠를 실행하여 학습자에게 가상현실로 제공할 수 있다. 여기서, 가상현실 장치는, 도 1에 도시된 바와 같이 머리에 착용 해 착용자의 시야를 통한 가상현실을 제공하는 착용형 VR 장치일 수 있으며, 원활한 상호작용을 위한 컨트롤러 등의 입력 장치를 포함할 수 있다. 실시예에 따라서, 가상현실 장치는, 컴퓨터, 태블릿 PC, 스마트폰, 탑 승형 가상현실 시뮬레이터 등 다양할 수 있으며, 다양한 실시예들에서 가상현실 장치는 가상현실로 구현된 게임화 욕창 교육 콘텐츠를 출력해 학습자에게 제공할 수 있다면 전술한 기기들에 한정되지는 않는다. 또한, 구체적인 단말기의 형태는 제한되지 않고, 전술한 다양한 장치 중 둘 이상의 조합일 수도 있다. 도 2는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에 서 사용된 MDA 프레임워크를 설명하기 위해 도시한 도면이다. 도 2에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에서는, 메카닉스(Mechanics), 다 이나믹스(Dynamics) 및 애스태틱(Aesthetic)을 활용하는 MDA 프레임워크와 프리브리핑(Prebriefing) 시뮬레이션 (Simulation), 디브리핑(Debriefing) 및 평가(Evalutaion)로 구성되는 가상현실 시뮬레이션을 결합하여 게임화욕창 교육 콘텐츠를 개발하고 제공, 운영할 수 있다. 여기서, 메카닉스는 게임의 구성요소로, 미션, 배지, 레벨, 포인트 등 학습자의 콘텐츠 플레이에 따라 제공되는 미션과 그에 따른 리워드일 수 있다. 다이나믹스는 게임 진행 중 게임 메카닉스들이 게임 참여자(학습자)에 따 라 작동하는 과정으로, 프리브리핑, 시뮬레이션, 디브리핑 및 평가의 단계별로 적용될 수 있다. 애스태틱은 게 임 참여자(학습자)와 게임시스템의 상호작용, 감정 경험으로, 시뮬레이션을 통해 도전, 새로운 발견, 판타시(가 상현실 몰입) 등이 일어나게 된다. 도 3은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서, 가상현실 장치의 세부적인 구성을 도시한 도면이다. 도 3에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간 호를 위한 게임화 가상현실 교육 플랫폼 시스템의 가상현실 장치는, 프리브리핑부, 시뮬레이션부 및 디브리핑부를 포함하여 구성될 수 있으며, 교육 평가부를 더 포함하여 구성될 수 있다. 프리브리핑부는, 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 욕창에 관한 강의와 퀴 즈를 제공하고, 욕창 사정 및 간호 수행 시의 체크리스트를 가상현실 기반으로 제공할 수 있다. 도 3에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템의 프리브리 핑부는, 준비부 및 브리핑부를 포함하여 구성될 수 있다. 준비부는, 학습자에게 욕창에 관한 강의와 퀴즈를 가상현실 기반으로 제공할 수 있다. 욕창에 관한 강의 는, 학습자에게 시뮬레이션을 이용한 실습 전에 학습자가 알고 있는 욕창과 관련된 사전 지식을 간단히 상기하 는 강의로, 1~5분 정도의 짧은 미니강의로 구성할 수 있다. 욕창에 관한 강의가 종료되면 간단한 퀴즈를 제공 해 반드시 기억해야 할 사항을 학습자가 다시 한번 확인하도록 할 수 있다. 브리핑부는, 욕창 사정 및 간호 수행 시의 체크리스트를 제공하고, 체크리스트 내용을 가상현실 기반으로 브리핑할 수 있다. 즉, 브리핑부는 게임화 욕창 교육 콘텐츠에 따라 간호사 역할을 하는 학습자에게 학습 목표 및 욕창 시나리오에 따른 대상자 정보 등을 제공하고, 욕창 사정 및 간호 수행을 위한 수행 점검표 (Performance checklist)를 제공하여, 본격적으로 욕창 시나리오를 진행하기 전에 학습자가 학습 목표를 확인하 고, 기본적인 내용을 파악할 수 있다. 게임화 욕창 교육 콘텐츠에서 학습 목표는 다음과 같다: 1) 대상자의 욕창 발생 위험 정도를 Braden Scale을 사 용하여 사정할 수 있다. 2) 대상자의 욕창 단계를 미국 욕창 자문 위원단(NPUAP)의 욕창 단계에 따라 정확하게 분류할 수 있다. 3) 대상자의 욕창 환부에 정확한 드레싱을 적용할 수 있다. 4) 대상자에게 욕창 예방 교육 및 예방 간호를 수행할 수 있다. 또한, 대상자 정보는, 게임화 욕창 교육 콘텐츠의 사례 개요와 대상자의 의무 기록 차트를 포함할 수 있으며, 간호사가 환자를 간호하기 전에 환자의 의무기록 등을 확인하는 절차와 유사할 수 있다. 시뮬레이션부는, 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행하면서, 학습자에게 욕창 시나리오에 따 른 욕창 사정 및 간호 수행과 관련된 미션을 부여하고, 부여된 미션에 대응한 간호 수행 결과에 따라 포인트 제 공, 배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 제공할 수 있다. 즉, 시뮬레 이션부는 가상현실 장치에서 욕창 시나리오에 따른 가상현실을 실행하는 구성으로, 시뮬레이션부(20 0)를 통해 학습자가 가상현실 기반으로 욕창 시나리오에 따른 실습을 해 볼 수 있다. 도 3에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템의 시뮬레이션부 는, 시뮬레이션 진행부, 욕창 사정부, 간호 수행부 및 리워드 관리부를 포함하여 구 성될 수 있다.시뮬레이션 진행부는, 게임화 욕창 교육 콘텐츠의 욕창 케이스에 따른 욕창 시나리오를 진행하면서, 욕창 시나리오와 학습 목표에 따라 학습자에게 미션을 부여할 수 있다. 보다 구체적으로, 시뮬레이션 진행부는, 욕창 사정과 관련된 미션을 부여할 수 있고, 추후 상세히 설명할 욕창 사정부의 욕창 단계 분류부에서 찾은 욕창 부위 및 욕창 부위별 욕창 단계에 기초하여, 부위별 단계별 치료 알고리즘에 따른 간호 수행과 관련된 미션을 학습자에게 부여할 수 있다. 욕창 사정부는, 게임화 욕창 교육 콘텐츠 내의 대상자의 상호작용에 따라 학습자가 대상자의 정보를 수집 하여 욕창 발생 위험을 사정한 데이터를 입력받을 수 있다. 즉, 욕창 사정부는, 학습자가 게임화 욕창 교 육 콘텐츠를 통해 욕창 사정을 학습할 수 있도록 하는 구성으로, 가상현실 장치에서 게임화 욕창 교육 콘텐 츠의 욕창 시나리오를 진행하면서, 학습자가 부여받은 욕창 사정과 관련된 미션에 대응해, 게임화 욕창 교육 콘 텐츠 내의 대상자와의 상호작용에 따라 학습자가 대상자의 정보를 수집하여 욕창 발생 위험을 사정한 데이터를 입력받을 수 있다. 욕창 사정부의 세부적인 구성에 대해서는 추후 도 4를 참조하여 상세히 설명하도록 한 다. 간호 수행부는, 학습자가 대상자에 대한 욕창 간호 수행을 시행하는 데이터를 입력받을 수 있다. 즉, 간 호 수행부는, 학습자가 욕창 사정부에서 사정한 내용에 따라 대상자에 대한 적절한 욕창 간호의 수행 을 학습할 수 있도록 하는 구성이다. 가상현실 장치에서 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행 하면서, 학습자가 부여받은 욕창 간호와 관련된 미션에 대응해 간호사 아바타를 제어하여 대상자에게 욕창 간호 를 할 수 있으며, 간호 수행부는 이와 관련된 데이터를 입력받을 수 있다. 간호 수행부의 세부적인 구성에 대해서는 추후 도 5를 참조하여 상세히 설명하도록 한다. 리워드 관리부는, 욕창 사정부 및 간호 수행부에서 입력받은 데이터를 이용해 시뮬레이션 진행 부가 학습자에게 부여한 미션의 수행 결과를 판정하며, 판정한 미션 수행 결과에 따라 리워드를 제공 및 관리할 수 있다. 보다 구체적으로, 리워드 관리부는, 욕창 사정부 및 간호 수행부에서 입력받 은 데이터를 이용해, 욕창 사정 및 간호 수행과 관련된 미션의 수행 결과를 판정할 수 있다. 여기서, 리워드 관리부가 제공 및 관리하는 리워드는, 학습자의 미션 수행 결과에 따라 제공되는 것으로, 포인트 제공, 배지 제공 및 레벨 이동 중 적어도 어느 하나일 수 있다. 리워드는 학습자의 학습을 촉진하기 위 한 게임 요소로, 미션과 미션 수행에 따른 리워드 제공을 통해 학습 효과를 극대화할 수 있다. 디브리핑부는, 시뮬레이션부의 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇 을 통해 디브리핑을 대화식으로 실행할 수 있다. 디브리핑은 시나리오를 이용한 시뮬레이션 실습의 가장 중요 한 과정 중 하나로서, 시뮬레이션 실습의 마지막 단계에서 학습을 촉진하기 위하여 시나리오 구현이 끝난 후 학 습자와 교수자 사이에 경험한 내용을 성찰, 토론, 피드백을 통하여 의미 있게 구조화하는 시간을 말하며, 시나 리오 진행을 멈추고 토의하거나 학습자에게 도움을 주는 방법도 디브리핑이라고 부른다. 본 발명에서의 디브리 핑은 디브리핑부가 인공지능 챗봇을 통해 진행하기 때문에, 교수자와의 대화나 다른 학습자와의 토론 등이 없이도, 인공지능 챗봇과 대화식으로 토론하여 디브리핑을 진행할 수 있다. 디브리핑은 꼭 필요한 과정이기는 하지만, 다른 학습자 앞에서 지적받는 것 등에 부담을 느끼는 학습자도 있으므로, 인공지능 챗봇을 통해 심리적 부담이 적은 환경에서 정확하고 효과적인 성찰을 할 수 있다. 도 3에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템의 디브리핑부는, 분석부 및 챗봇부 를 포함하여 구성될 수 있다. 분석부는, 리워드 관리부가 판정한 학습자의 미션 수행 결과 및 학습자가 제공받은 리워드 정보를 이 용해 해당 학습자의 욕창 간호 수행을 분석 및 평가할 수 있다. 즉, 분석부는 미션 수행 결과 및 리워드정보를 이용해 학습자의 성취도를 평가할 수 있으며, 학습자가 잘한 부분, 학습자에게 부족한 부분, 재학습이 필요한 부분 등을 분석할 수 있다. 실시예에 따라서, 분석부는 분석 결과 학습자에게 부족한 부분 또는 재학습이 필요한 부분에 대한 리플레이(re-play) 기회를 시뮬레이션부와 연동해 제공할 수도 있다. 챗봇부는, 분석부의 분석 및 평가 결과를 기초로, 인공지능 챗봇을 통해 학습자와 대화 방식으로 디 브리핑을 진행할 수 있다. 인공지능 챗봇은 대규모 언어 모델(Large Language Model, LLM) 기반으로 동작할 수 있으며, 입력되는 언어를 분석하고 그에 대한 답변을 문장으로 생성해 제공할 수 있다. 이때, 챗봇부는 분석부의 분석 및 평가 결과를 이용해, 학습자와 대화하면서 시뮬레이션 과정에 관한 성찰을 진행할 수 있 다. 따라서 학습자가 진행한 구체적인 간호 수행에 대해 교수자나 다른 학습자들과 토론하는 것 같은 효과적인 디브리핑을 할 수 있다. 이때, 챗봇부는 인공지능 기반으로 STT(Sound to Text) 및 TTS(Text to Sound) 변환을 처리하는 음성 변환 엔진을 이용해, 가상현실 장치의 마이크와 스피커를 통한 음성 대화 형식으로 디브리핑을 진행할 수 있다. 또한, 교수자 또는 다른 학습자를 가상현실로 구현한 NPC를 제공해 디브리핑 상황 의 현실감을 높일 수 있다. 교육 평가부는, 게임화 욕창 교육 콘텐츠를 이용한 욕창 교육의 효과에 대한 평가 정보를 입력받을 수 있 다. 이때, 시뮬레이션 효과 분석을 위한 도구를 활용한 평가지를 제공하고, 학습자가 설문 작성을 함으로써 평 가 정보를 입력받을 수 있다. 도 4는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서, 욕창 사정 부의 세부적인 구성을 도시한 도면이다. 도 4에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호 를 위한 게임화 가상현실 교육 플랫폼 시스템의 가상현실 장치의 욕창 사정부는, 환자 안전부 , 대상자 사정부, 욕창 발생 위험 사정부, 욕창 단계 분류부, 욕창 크기 측정부 및 기록지 작성부를 포함하여 구성될 수 있다. 환자 안전부는, 가상현실 장치에서 간호사 아바타가 손 소독, 대상자에게 자기소개 및 대상자의 확인 을 진행할 수 있다. 즉, 환자 안전부는, 게임화 욕창 교육 콘텐츠 내에서 간호사 아바타가 손 소독, 대상 자에게 간호사 본인 소개, 대상자 성명 확인 등을 차례로 진행하도록, 학습자를 가이드하고 간호사 아바타의 제 어 신호를 수신해 실시간으로 반영할 수 있다. 대상자 사정부는, 간호사 아바타와 대상자와의 상호작용에 따라 대상자의 불편감을 파악하고 통증 사정에 따른 데이터를 입력받을 수 있다. 보다 구체적으로, 대상자 사정부는, 간호사 아바타가 대상자의 생체신 호를 확인하는 단계(S222-1), 간호사 아바타가 대상자의 표정 및 대상자와의 대화를 통해 대상자의 불편감에 관 한 정보를 확보하는 단계(S222-2), NRS 통증 평가 척도에 의한 통증 사정에 따라, 통증 점수 및 통증 부위를 포 함하는 데이터를 입력받는 단계(S222-3)를 수행할 수 있다(미도시). 단계 S222-1에서는, 간호사 아바타가 대상자의 생체신호를 확인할 수 있다. 즉, 학습자는 간호사 아바타를 제 어해 대상자의 비정상 바이탈 사인 수치를 확인할 수 있다. 단계 S222-2에서는, 간호사 아바타가 대상자의 표정 및 대상자와의 대화를 통해 대상자의 불편감에 관한 정보를 확보할 수 있다. 예를 들어, 대상자가 불편해 보이는 표정으로 얼굴을 찡그리고 있다면, 학습자는 대상자의 표 정을 인식하고 대상자와 대화하여, 대상자가 호소하는 불편감을 파악할 수 있다. 단계 S222-3에서는, 단계 S222-2에서 확보한 정보에 기초하여, 가상현실 내에서 영상으로 제공되는 NRS 통증 평 가 척도에 의한 통증 사정에 따라, 통증 점수 및 통증 부위를 포함하는 데이터를 입력받을 수 있다. 여기서,NRS 통증 평가 척도는 통증을 10점으로 표현한 수치 평가 척도로, 학습자는 가상현실로 제공되는 NRS 통증 평가 척도에 입력 장치를 사용해 표시하여 통증 점수를 입력하고, 대상자 관찰 및 불편감 호소로부터 통증 부위를 파 악해 입력할 수 있다. 욕창 발생 위험 사정부는, 가상현실 내에서 영상으로 제공되는 욕창 사정 도구(Braden Scale)를 이용해, 대상자의 욕창 발생 위험 정도의 사정에 따른 데이터를 입력받을 수 있다. 보다 구체적으로, 간호사 아바타가 대상자와의 상호작용에 따라, 둔부의 습한 상태, 사례 개요, 의무기록 차트의 lab 수치 등을 통해 욕창 발생 위 험 정도를 사정할 수 있다. 이때, 정확한 욕창 발생 위험 사정을 위해서 욕창 사정 도구가 가상현실 화면으로 제공되며, 학습자는 게임화 욕창 교육 콘텐츠 내의 대상자의 상태를 육안으로 보는 동시에, 욕창 사정 도구를 화면에서 함께 확인하면서 학습을 할 수 있다. Braden Scale은 감각 인지 상태, 습기 정도, 활동 상태, 움직임, 영양상태, 마찰력과 전단력의 6가지 항목에 각 각 점수를 매긴 다음 점수를 합산하여 욕창을 사정하는 것이다. 총점 23점 만점에 점수가 낮을수록 욕창 발생 위험이 크며, 15~18점은 저위험군, 13~14점은 중위험군, 10~12점은 고위험군, 9점 이하는 초고위험군으로 분류 할 수 있다. 욕창 발생 위험 사정부는, 이러한 욕창 사정 도구를 쉽게 활용할 수 있도록 가상현실로 Braden Scale을 표로 제공하면서, 참고되는 설명이나 이미지 등을 함께 제공할 수 있다. 학습자는 대상자를 관 찰하면서, 제공된 Braden Scale 표의 6가지 항목에 컨트롤러 등의 입력 장치를 사용해 각각 점수를 입력함으로 써, 욕창 발생 위험을 사정할 수 있다. 욕창 단계 분류부는, 대상자의 신체에서 미리 설정된 개수의 욕창 부위를 찾고, 가상현실 내에서 영상으로 제공되는 욕창 단계를 이용해 욕창 부위별 욕창 단계를 입력받을 수 있다. 이때, 욕창 단계 분류부는, 미 국 욕창 자문 위원단(NPUAP)의 욕창 단계를 영상으로 제공할 수 있다. 즉, 게임화 욕창 교육 콘텐츠는, 욕창 시나리오에 기초해 대상자의 자세 등에 따라 대상자가 미리 설정된 개수 의 욕창 부위를 갖도록 구성되며, 그에 따라 대상자가 통증을 호소하도록 구현될 수 있다. 학습자는 대상자의 통증 호소 및 자세에 따른 욕창의 호발 부위를 추론하여 두 곳(미리 설정된 개수)의 욕창 부위를 찾고, 영상으 로 제공되는 미국 욕창 자문 위원단(NPUAP)의 욕창 단계를 참고하여 각 욕창 부위별로 욕창 단계를 분류해, 입 력 장치를 사용해 분류 결과를 입력할 수 있다. 이때, 제공되는 영상은 미국 욕창 자문 위원단(NPUAP)의 욕창 단계별 설명, 상처 촬영 이미지 등을 포함할 수 있다. 실시예에 따라서, 욕창 단계 분류부는, 기존 욕창 환자 사진 자료로 머신러닝을 통해 학습 완료된 욕창 예 측 모델을 이용해, 욕창 예측 모델의 욕창 예측값을 제공할 수 있다. 즉, 욕창 예측 모델은 대량의 욕창 환자 의 환부 사진을 입력 데이터로 하고, 진단된 욕창 단계를 출력 데이터로 하여 머신러닝으로 학습 완료된 모델일 수 있다. 욕창 단계 분류부는, 학습자가 찾은 대상자의 욕창 부위별 이미지를 욕창 예측 모델의 입력 데 이터로 하여 예측된 욕창 단계(욕창 예측값)를 참고로 학습자에게 제공해, 학습자가 정확하게 욕창 단계를 분류 하도록 도와줄 수 있다. 욕창 크기 측정부는, 가상현실을 통해 제공되는 측정장치를 사용해 욕창 부위별 크기를 측정하여 입력받을 수 있다. 보다 구체적으로, 욕창 크기 측정부는, 가상현실로 구현된 전자 자를 측정장치로 제공할 수 있 다. 즉, 간호사 아바타는 학습자의 제어에 따라 전자 자를 두 곳의 욕창 부위에 각각 가져가 욕창 사이즈를 측 정하며, 입력 장치를 사용해 측정 결과를 입력할 수 있다. 기록지 작성부는, 대상자 사정부, 욕창 발생 위험 사정부, 욕창 단계 분류부 및 욕창 크기 측정부에서 입력받은 데이터를 입력해 욕창 간호 기록지를 작성할 수 있다. 기록지 작성부는, 대상 자 사정부, 욕창 발생 위험 사정부, 욕창 단계 분류부, 욕창 크기 측정부 등에서 입력된데이터를 자동으로 삽입해 욕창 간호 기록지를 작성할 수 있으며, 작성된 욕창 간호 기록지를 학습자에게 가상 현실 영상으로 제공하고 수정, 편집이 가능하도록 할 수 있다. 한편, 리워드 관리부는, 욕창 사정부의 환자 안전부, 대상자 사정부, 욕창 발생 위험 사정 부, 욕창 단계 분류부, 및 욕창 크기 측정부에서 입력받은 데이터를 이용해, 욕창 사정과 관련 된 미션의 수행 결과를 판정할 수 있다. 도 5는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서, 간호 수행 부의 세부적인 구성을 도시한 도면이다. 도 5에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호 를 위한 게임화 가상현실 교육 플랫폼 시스템의 가상현실 장치의 간호 수행부는, 간호 시행부 및 예방 교육 시행부를 포함하여 구성될 수 있다. 간호 시행부는, 간호사 아바타가, 욕창 단계 분류부에서 찾은 욕창 부위에 욕창 부위별 욕창 단계에 기초하여, 드레싱 및 바이오포토닉스 센서 부착을 포함하는 욕창 간호 중 어느 하나를 시행할 수 있다. 게임화 욕창 교육 콘텐츠에서 두 곳의 욕창 부위는 각각 1단계 욕창과 2단계 욕창일 수 있다. 학습자는 간호사 아바타 를 제어해, 2단계 욕창 부위에 정해진 순서에 따라 드레싱을 시행할 수 있다. 또한, 1단계 욕창에는 바이오포 토닉스 센서를 부착해 욕창의 진단과 치료를 동시에 할 수 있다(등록특허 제10-2001512호, “욕창의 진단 및 치 료가 동시에 가능한 바이오 포토닉스 장치” 참고). 예방 교육 시행부는, 간호사 아바타가 대상자에게 욕창 예방 교육을 시행할 수 있다. 욕창 예방 교육은, 대상자와 대상자의 보호자 등에게 욕창 예방을 위해 할 수 있는 사항을 안내하고 교육하는 것으로, 게임화 욕창 교육 콘텐츠에서는 점검표로 대상자 교육 사항을 표시하고, 학습자가 간호사 아바타를 제어해 점검표에 있는 교 육 사항을 빠짐없이 시행하도록 할 수 있다. 한편, 리워드 관리부는, 간호 수행부의 간호 시행부 및 예방 교육 시행부를 통한 간호사 아바타의 시행 데이터를 전달받아, 간호 수행과 관련된 미션의 수행 결과를 판정할 수 있다. 도 6은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법의 흐름을 도시한 도면이다. 도 6에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법은, 가상현 실 서버 및 가상현실 장치를 포함하는 게임화 가상현실 교육 시스템에서 각 단계가 수행되며, 프리 브리핑 단계(S100), 시뮬레이션 단계(S200) 및 디브리핑 단계(S300)를 포함하여 구현될 수 있으며, 교육 평가 단계(S400)를 더 포함하여 구현될 수 있다. 보다 구체적으로, 단계 S100에서는, 게임화 욕창 교육 콘텐츠 내에서 간호사 역할을 하는 학습자에게 욕창에 관 한 강의와 퀴즈를 제공하고, 욕창 사정 및 간호 수행 시의 체크리스트를 가상현실 기반으로 제공할 수 있다. 단계 S200에서는, 게임화 욕창 교육 콘텐츠의 욕창 시나리오를 진행하면서, 학습자에게 욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여하고, 부여된 미션에 대응한 간호 수행 결과에 따라 포인트 제공, 배지 제공 및 레벨 이동 중 적어도 어느 하나의 리워드를 제공해 게임 요소를 제공할 수 있다. 단계 S300에서 는, 단계 S200의 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을 대화 식으로 실행할 수 있다. 단계 S400에서는, 게임화 욕창 교육 콘텐츠를 이용한 욕창 교육의 효과에 대한 평가 정보를 입력받을 수 있다. 각각의 단계들과 관련된 상세한 내용들은, 앞서 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템과 관련하여 충분히 설명되었으므로, 상세한 설명은 생략하기로 한다.도 7은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S100 이전에 수행되 는 단계 S10의 구성을 도시한 도면이다. 도 7에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위 한 게임화 가상현실 교육 방법은, 단계 S100 이전에, 가상현실 서버는 게임화 욕창 교육 콘텐츠 내에서 간 호사 역할을 하는 학습자에게 간호사 아바타를 할당하는 단계(S10)를 더 포함하여 구현될 수 있다. 도 8은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S100의 세부적인 흐 름을 도시한 도면이다. 도 8에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현 실 교육 방법의 단계 S100은, 학습자에게 욕창에 관한 강의와 퀴즈를 가상현실 기반으로 제공하는 단계(S110) 및 욕창 사정 및 간호 수행 시의 체크리스트를 제공하고, 체크리스트 내용을 가상현실 기반으로 브리핑하는 단 계(S120)를 포함하여 구현될 수 있다. 도 9는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S200의 세부적인 흐 름을 도시한 도면이다. 도 9에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현 실 교육 방법의 단계 S200은, 학습자에게 욕창 시나리오에 따른 욕창 사정 및 간호 수행과 관련된 미션을 부여 하는 단계(S210), 대상자의 상호작용에 따라 학습자가 대상자의 정보를 수집하여 욕창 발생 위험을 사정한 데이 터를 입력받는 단계(S220), 학습자가 대상자에 대한 욕창 간호 수행을 시행하는 데이터를 입력받는 단계(S230) 및 학습자에게 부여한 미션의 수행 결과를 판정하며, 판정한 미션 수행 결과에 따라 리워드를 제공 및 관리하는 단계(S240)를 포함하여 구현될 수 있다. 도 10은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S300의 세부적인 흐름을 도시한 도면이다. 도 10에 도시된 바와 같이, 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가 상현실 교육 방법의 단계 S300은, 학습자의 미션 수행 결과 및 학습자가 제공받은 리워드 정보를 이용해 해당 학습자의 욕창 간호 수행을 분석 및 평가하는 단계, 분석 및 평가 결과를 기초로 인공지능 챗봇을 통해 학 습자와 대화 방식으로 디브리핑을 진행하는 단계(S320)를 포함하여 구현될 수 있다. 전술한 바와 같이, 본 발명에서 제안하고 있는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에 따르면, 욕창 발생 임상 케이스에 따른 욕창 시나리오를 구성하고, 욕창 시나리오에 따른 욕창 사 정 및 간호 수행을 가상현실 기반으로 구현하되, 간호 수행 결과에 따라 게임 요소가 제공되는 게임화 욕창 교 육 콘텐츠를 제공하고, 가상현실 장치에서 게임화 욕창 교육 콘텐츠를 통해 학습자가 콘텐츠 내의 대상자와 상호작용하며 학습하도록 함으로써, 욕창의 사정과 간호를 가상현실 기반으로 실감 나게 수행할 수 있어 이론적 인 교육을 벗어나 현실적인 교육을 할 수 있고, 게임 요소를 통해 교육 효과를 높일 수 있다. 또한, 본 발명에서 제안하고 있는 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에 따르면, 게임화 욕창 교육 콘텐츠에서 욕창 시나리오 진행에 따른 경험 내용을 디브리핑하되, 인공지능 챗봇을 통해 디브리핑을 대화식으로 진행함으로써, 교수자나 다른 학습자 없이 단독 학습 시에도 충분한 성찰, 토론, 피드백 등을 통한 학습 촉진을 할 수 있다. 한편, 본 발명은 다양한 통신 단말기로 구현되는 동작을 수행하기 위한 프로그램 명령을 포함하는 컴퓨터에서 판독 가능한 매체를 포함할 수 있다. 예를 들어, 컴퓨터에서 판독 가능한 매체는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD_ROM, DVD와 같은 광기록 매체(optical media), 플롭티 컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다.이와 같은 컴퓨터에서 판독 가능한 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합 하여 포함할 수 있다. 이때, 컴퓨터에서 판독 가능한 매체에 기록되는 프로그램 명령은 본 발명을 구현하기 위 하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 예를 들어, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다."}
{"patent_id": "10-2023-0071391", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명된 각 구성요소는 분산되어 실시될 수도 있으며, 마찬가지로 분 산된 것으로 설명된 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0071391", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템의 구성을 도시한 도 면. 도 2는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템 및 교육 방법에서 사 용된 MDA 프레임워크를 설명하기 위해 도시한 도면. 도 3은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서, 가상현실 장치 의 세부적인 구성을 도시한 도면. 도 4는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서, 욕창 사정부의 세부적인 구성을 도시한 도면. 도 5는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 플랫폼 시스템에서, 간호 수행부의 세부적인 구성을 도시한 도면. 도 6은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법의 흐름을 도시한 도면. 도 7은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S100 이전에 수행되 는 단계 S10의 구성을 도시한 도면. 도 8은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S100의 세부적인 흐 름을 도시한 도면. 도 9는 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S200의 세부적인 흐 름을 도시한 도면. 도 10은 본 발명의 일실시예에 따른 욕창 간호를 위한 게임화 가상현실 교육 방법에서, 단계 S300의 세부적인 흐름을 도시한 도면."}
