{"patent_id": "10-2022-0174218", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0088463", "출원번호": "10-2022-0174218", "발명의 명칭": "디지털 콘텐츠 제작 지원 플랫폼", "출원인": "주식회사 조인트리", "발명자": "윤여표"}}
{"patent_id": "10-2022-0174218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 기반의 디지털 콘텐츠 저작도구를 제공하는 저작도구 제공부;상기 저작도구를 통해 입력된 저작명령에 기초하여 디지털 콘텐츠를 제작하는 콘텐츠 제작부;상기 디지털 콘텐츠의 가치를 평가하는 가치 평가부; 및상기 평가된 가치에 기초하여 상기 디지털 콘텐츠를 거래 서버에 게시하여 거래를 중개하는 콘텐츠 유통부를 포함하는디지털 콘텐츠 제작 지원 플랫폼."}
{"patent_id": "10-2022-0174218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 저작도구 제공부는 밑그림, 채색, 인물, 배경, 캐릭터 및 소품 오브젝트 중 적어도 하나를 제공하는디지털 콘텐츠 제작 지원 플랫폼."}
{"patent_id": "10-2022-0174218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 가치 평가부는 기존 유사 디지털 콘텐츠의 거래량 및 거래가격 데이터에 기초하여 상기 디지털 콘텐츠의가치를 평가하는디지털 콘텐츠 제작 지원 플랫폼."}
{"patent_id": "10-2022-0174218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 콘텐츠 유통부는 상기 디지털 콘텐츠의 제작자와 거래 토큰을 이용하여 상기 디지털 콘텐츠를 거래하는디지털 콘텐츠 제작 지원 플랫폼."}
{"patent_id": "10-2022-0174218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 거래 토큰은 블록체인 및 NFT 기술을 기반으로 동작하는디지털 콘텐츠 제작 지원 플랫폼."}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 소비자에게 디지털 콘텐츠 기획, 제작 및 유통을 지원하는 플랫폼에 관한 것이다. 본 발명의 실시예에 따른 디지털 콘텐츠 제작 지원 플랫폼은 인공지능 기반의 디지털 콘텐츠 저작도구를 제공하는 저작도구 제공부, 상기 저작도구를 통해 디지털 콘텐츠를 제작하는 콘텐츠 제작부, 디지털 콘텐츠의 가치를 평가하는 가치 평가부 (뒷면에 계속)"}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소비자에게 디지털 콘텐츠 기획, 제작 및 유통을 지원하는 플랫폼에 관한 것이다."}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현대에는 IT 인프라 개선으로 인해 소비자의 콘텐츠 접근성이 향상되고 있으며, 스마트기기가 다양화, 경량화됨 에 따라 이동 편의성 또한 높아지고 있어 소비자가 장소의 제약없이 디지털 콘텐츠를 쉽게 소비할 수 있다. 이와 같이 디지털 콘텐츠에 관심도가 높아짐에 따라 소비자의 디지털 콘텐츠 제작 참여율이 점차 증가하고 있는 추세이다. 하지만, 해당분야에 비전문적인 소비자가 디지털 콘텐츠를 제작하는 데에는 종래의 저작도구는 조작방법이 다소 어려워 소비자가 디지털 콘텐츠에 대한 아이디어를 보유하고 있어도 직접 디지털 콘텐츠를 제작할 수 없다는 문 제점이 있다."}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 소비자에게 디지털 콘텐츠 제작 서비스를 지원하는 것을 목적으로 한다. 또한, 본 발명은 소비자에게 디지털 콘텐츠 유통 서비스를 지원하는 것을 목적으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 인공지능 기반의 디지털 콘텐츠 저작도구를 제공함으로써, 소비자에게 디지털 콘텐츠 제작 서비스를 지원할 수 있다. 본 발명은 디지털 콘텐츠의 가치를 평가하여 가치평가지표를 생성함으로써, 소비자에게 디지털 콘텐츠 유통 서 비스를 지원할 수 있다."}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 소비자에게 디지털 콘텐츠 제작 서비스를 지원함으로써, 비전문가가 디지털 콘텐츠를 제작할 수 있도록 한다. 본 발명에 의하면 소비자에게 디지털 콘텐츠 유통 서비스를 지원함으로써, 디지털 콘텐츠 및 다른 디지털 콘텐 츠 오브젝트를 해당 디지털 콘텐츠 제작자와 거래할 수 있도록 한다. 상술한 효과와 더불어 본 발명의 구체적인 효과는 이하"}
{"patent_id": "10-2022-0174218", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 본 명세서에서 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용 하는 것으로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 또한, 본 명세서에서 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개 재\"되거나, 각 구성요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 본 명세서에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B 를 의미하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 본 발명은 소비자에게 디지털 콘텐츠 기획, 제작 및 유통을 지원하는 플랫폼에 관한 것이다. 도 1은 본 발명의 컴퓨터 제작 시스템을 도시한 도면이다. 도 2는 본 발명의 디지털 콘텐츠 제작 지원 플랫폼의 구성을 도시한 도면이다. 도 3은 본 발명의 저작도구 제공부의 구성을 도시한 도면이다. 도 1을 참조하면, 컴퓨터 제작 시스템은 플랫폼 및 소비자 단말을 포함할 수 있다. 다만, 도 1에 도 시된 컴퓨터 제작 시스템은 일 실시예에 따른 것이고, 그 구성요소들이 도 1에 도시된 실시예에 한정되는 것 은 아니며, 필요에 따라 일부 구성요소가 부가, 변경 또는 삭제될 수 있다. 도 2를 참조하면, 본 발명의 디지털 콘텐츠 제작 지원 플랫폼은 저작도구 제공부, 콘텐츠 제작부 , 가치 평가부 및 콘텐츠 유통부을 포함할 수 있다. 플랫폼은 후술하는 동작을 수행하기 위하여 ASICs(application specific integrated circuits), DSPs(digital signal processors), DSPDs(digital signal processing devices), PLDs(programmable logic devices), FPGAs(field programmable gate arrays), 제어기(controller), 프로세서(processor), 마이크로 프로 세서(microprocessor), 마이크로 컨트롤러(micro-controllers), 중 적어도 하나의 물리적인 요소를 포함할 수 있다. 저작도구 제공부는 인공지능 기반의 디지털 콘텐츠 저작도구를 제공할 수 있다. 저작도구 제공부는 인공지능 기반의 저작도구 기술에 대한 데이터를 토대로 저작도구 프로그램 다운로드, 웹 기반 저작도구 사용 및 저작도구 사용 가이드를 제공하여 비전문가도 쉽게 디지털 콘텐츠를 제작할 수 있다. 즉, 저작도구 제공부는 사용자단말에 밑그림, 채색, 인물, 배경, 캐릭터 및 소품 오브젝트 중 적어도 하나를 제공할 수 있다. 도 3를 참조하면, 저작도구 제공부는 캐릭터 생성모듈, 웹툰 컷 생성모듈, 배경 제작모듈, 오브젝트 저작모듈을 포함할 수 있다. 캐릭터 생성모듈은 사용자단말에 3D 객체 이동, 회전 및 크기조정을 이용한 레퍼런스 이미지를 제공함으로 써, 사용자가 손쉽게 디지털 드로잉을 수행하도록 할 수 있다. 이는 비전문가가 밑그림 스케치(예컨대, 인물의자세, 물체, 손 등)를 보다 쉽게 수행하도록 할 수 있다. 자세히 말하자면, 캐릭터 생성모듈은 사용자단말에 캐릭터 생성 및 변환 기술을 제공함으로써, 비전문 가가 캐릭터의 생동감 있는 표정을 보다 쉽게 구현할 수 있도록 함으로써, 캐릭터 모사에 대한 부담을 줄일 수 있다. 또한, 캐릭터 생성모듈은 사용자단말에 3D 캐릭터의 표정 및 동작 생성 기술을 제공함으로써, 자연스러운 표정 및 감정을 연출할 수 있도록 서비스를 지원할 수 있다. 웹툰 컷 생성모듈은 사용자단말에 인물 이미지와 유사한 웹툰 이미지를 실시간으로 제공할 수 있다. 이를 통해 비전문가가 인물의 포즈를 스케치하는 연습을 보다 쉽게 수행할 수 있다. 웹툰 컷 생성모듈은 미리 학습된 인공지능 모델에 텍스트로 입력된 제작자의 시놉시스를 이미지로 출력할 수 있다. 자세히 말하자면, 웹툰 컷 생성모듈은 콘티 및 미니 웹툰 제작을 위해 웹툰 밑그림 및 자세 모델링을 제공 하고, 말풍선을 배치한 밑그림 이미지를 제공할 수 있다. 배경 제작모듈과 오브젝트 저작모듈은 실제 환경에서 측정한 3D 배경 및 소품 데이터를 오브젝트로 변환할 수 있다. 자세히 말하자면, 배경 제작모듈는 3D 배경 데이터를 기반으로 제작자의 의도에 따라 디지털 콘텐츠의 배 경을 다양한 화풍으로 변환할 수 있다. 오브젝트 저작모듈은 오브젝트의 크기, 위치, 명도 및 채도 등을 생성 및 삭제하는 편집기능을 포함할 수 있다. 콘텐츠 제작부는 저작도구를 통해 입력된 저작명령에 기초하여 디지털 콘텐츠를 제작할 수 있다. 콘텐츠 제작부는 제작자가 저작도구 제공 서비스를 통해 제작한 디지털 콘텐츠를 파일로 변환할 수 있고, 이를 빅데이터 관리 시스템에 저장할 수 있다. 이때, 빅데이터 관리 시스템은 SIP(Submission Information Package; 제출 정보 패키지)를 통해 다양한 디지털 콘텐츠를 수집, 저장 및 관리할 수 있으며, AIP(Archival Information Package; 보관 정보 패키지)를 통해 디 지털 콘텐츠를 저장 및 검색할 수 있다. 또한 빅데이터 관리 시스템은 이용자의 요구사항에 적합한 형태인 DIP(Dissemination Information Package; 배포 정보 패키지)로 변환함으로써, 디지털 콘텐츠의 정보 요청 및 전송을 지원할 수 있다. 한편, 빅데이터 관리 시스템은 디지털 콘텐츠의 주요 행정정보 및 시스템 정보가 수록된 데이터베이스를 기반으 로 관리할 수 있다. 가치 평가부는 디지털 콘텐츠의 가치를 평가할 수 있다. 자세히 말하자면 가치 평가부는 기존 유사 디지털 콘텐츠의 거래량 및 거래가격 데이터에 기초하여 디지털 콘텐츠의 가치를 평가할 수 있고, 이를 통해 가치평가지표를 생성할 수 있다. 이때, 디지털 콘텐츠의 가치평가지표는 NFT 기술을 기반으로 생성될 수 있다. 콘텐츠 유통부는 평가된 가치에 기초하여 디지털 콘텐츠를 거래 서버에 게시하여 거래를 중개할 수 있다. 자세히 말하자면 디지털 콘텐츠 거래는 거래 서버 내에서 사용가능한 거래 토큰을 이용하여 디지털 콘텐츠 및 다른 디지털 콘텐츠의 오브젝트를 해당 디지털 콘텐츠 제작자와 거래할 수 있다. 이때 거래 토큰은 블록체인 및 NFT 기술을 기반으로 동작할 수 있다. 이상과 같이 본 발명에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 발명이 한정되는 것은 아니며, 본 발명의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 발명의 실시 예를 설명하면서 본 발명의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2022-0174218", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 디지털 콘텐츠 제작 시스템을 도시한 도면. 도 2는 본 발명의 디지털 콘텐츠 제작 지원 플랫폼의 구성을 도시한 도면. 도 3은 본 발명의 저작도구 제공부의 구성을 도시한 도면."}
