{"patent_id": "10-2020-0138236", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0053907", "출원번호": "10-2020-0138236", "발명의 명칭": "신약 예측 방법 및 이러한 방법을 수행하는 장치", "출원인": "디어젠 주식회사", "발명자": "박성수"}}
{"patent_id": "10-2020-0138236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "신약 예측 방법은, 신약 예측 장치가 화합물의 화합물 정보를 전처리하여 화합물 정보(전처리)를 생성하는 단계;상기 신약 예측 장치가 단백질의 단백질 정보를 전처리하여 단백질 정보(전처리)를 생성하는 단계;상기 신약 예측 장치가 상기 화합물 정보(전처리) 및 상기 단백질 정보(전처리)를 연접하는 단계; 및 상기 신약 예측 장치가 연접된 상기 화합물 정보(전처리) 및 상기 단백질 정보(전처리)를 기반으로 결합력을 예측하는 단계를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0138236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서상기 신약 예측 장치가 상기 결합력을 기반으로 상기 화합물의 상기 단백질에 대응되는 질병에 대한 신약 가능성을 결정하는 단계를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0138236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 화합물은 기존 화합물 또는 상기 기존 화합물을 변형한 신규 화합물을 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2020-0138236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "신약 예측을 수행하는 신약 예측 장치는, 화합물의 화합물 정보를 전처리하여 화합물 정보(전처리)를 생성하도록 구현되는 화합물 정보 전처리부;단백질의 단백질 정보를 전처리하여 단백질 정보(전처리)를 생성하도록 구현되는 단백질 정보 전처리부;상기 화합물 정보(전처리) 및 상기 단백질 정보(전처리)를 연접하는 연접부; 및연접된 상기 화합물 정보(전처리) 및 상기 단백질 정보(전처리)를 기반으로 결합력을 예측하도록 구현되는 결합력 예측부를 포함하는 것을 특징으로 하는 신약 예측 장치."}
{"patent_id": "10-2020-0138236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서상기 결합력을 기반으로 상기 화합물의 상기 단백질에 대응되는 질병에 대한 신약 가능성을 결정하도록 구현되는 신약 가능성 판단부를 더 포함하는 것을 특징으로 하는 신약 예측 장치."}
{"patent_id": "10-2020-0138236", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 화합물은 기존 화합물 또는 상기 기존 화합물을 변형한 신규 화합물을 포함하는 것을 특징으로 하는 신약예측 장치."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 신약 예측 방법 및 이러한 방법을 수행하는 장치에 관한 것이다. 신약 예측 방법은 신약 예측 장치가 화합물의 화합물 정보를 전처리하여 화합물 정보(전처리)를 생성하는 단계, 신약 예측 장치가 단백질의 단백질 정보를 전처리하여 단백질 정보(전처리)를 생성하는 단계, 신약 예측 장치가 화합물 정보(전처리) 및 단백질 정 보(전처리)를 연접하는 단계와 신약 예측 장치가 연접된 화합물 정보(전처리) 및 단백질 정보(전처리)를 기반으 로 결합력을 예측하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 신약 예측 방법 및 이러한 방법을 수행하는 장치에 관한 것이다. 보다 상세하게는 단백질 데이터와 화합물 데이터 각각에 대한 학습을 기반으로 단백질과 화합물 간의 결합력을 예측하고, 화합물의 신약으로서의가능성을 예측하는 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "신약 시장의 구조를 살펴보면, 소수의 글로벌 상위 제약사가 신약 개발을 주도하며 전체 시장을 과점하는 형태 이다. 2016년 글로벌 10대 제약사의 매출액 합계는 3,364억 달러로 전체 시장의 30%를 차지하고 있다. 이들 기 업은 주로 미국, 일본, 독일, 스위스, 영국, 프랑스 등 탄탄한 기초 과학을 축적한 국가에 속하고, 글로벌 상위 50개 제약회사의 국가별 분포는 미국 16개, 일본 10개, 독일 4개, 스위스와 아일랜드 각 3개, 영국과 프랑스가 각 2개이다. 하나의 신약을 시판하기까지 10년 이상의 기간, 2조원 이상의 개발 비용이 투입된다. 후보 물질 발굴 단계로 5 천~1만 개의 후보 물질을 탐색하여 대상 질환의 치료에 효과를 보일 수 있는 유효 물질을 선별하는 단계로 약 5 년 정도의 기간이 소요된다. 전임상 시험 단계로 후보 물질을 사람에게 투여하기 전에 동물을 대상으로 독성 및 약효 등을 시험하는 단계로 약 2년 정도의 기간이 소요된다. 임상 시험 단계로 건강한 사람에게 투여하여 독성 을 파악하는 1상, 소수의 환자를 대상으로 약효를 파악하는 2상, 2상의 결과를 대규모 환자를 대상으로 확인하 는 3상으로 구성되며, 대략 7년 정도의 기간이 필요하다. 신약 개발에 성공한 제약 회사는 소수에 불과하며, 대부분의 신약 후보 물질은 신약 개발 과정에서 중도 탈락하 게 된다. 1950년 이후 혁신 신약 개발을 위하여 투자한 약 4,300여 개의 제약 회사 중에서 약 6%에 해당하는 261개 기업만이 신약 개발에 성공하였다. 약 5천 여 개의 후보 물질 중에서 임상 시험 단계에 진입하는 물질은 10개 이내이며 최종적으로 1개의 약품만이 신약으로 출시된다. 신약 개발의 생산성이 하락하는 상황에서 인공지능, 빅데이터 등 디지털 기술을 활용하여 신약 개발의 패러다임 을 전환하려는 시도가 증가하고 있다. 빅데이터 및 인공지능을 활용한 신약 개발에 전문화한 약 80여 개의 스타 트업이 활동하고 있다. 주요 제약회사는 인공지능 기술을 확보한 이들 스타트업과 적극적인 협력을 통해 신약개 발의 돌파구를 마련하고 있다. 구체적으로 후보물질 탐색 단계에서 인공지능을 활용하여 기존의 화합물 정보를 수집·학습하고, 신약 표적에 맞는 최적의 화합물 조합을 예측함으로써, 후보물질 발굴 기간을 기존 5년에서 1년 내외로 단축할 수 있다. 따라서, 기존의 신약 개발의 생산성을 개선하고, 보다 빠른 신약 개발을 위한 인공 지능 기반의 신약 개발 기술 에 대한 연구가 필요하다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 문제점을 모두 해결하는 것을 그 목적으로 한다. 또한, 본 발명은, 단백질과 화합물의 결합력 예측을 기반으로 기존의 화합물 또는 새로운 화합물의 신약 가능성 을 예측하는 것을 목적으로 한다. 또한, 본 발명은, 단백질과 화합물 간의 예측된 결합력뿐만 아니라 ADMET(흡수(absorption), 분포 (distribution), 대사(metabolism), 배설(excretion), 독성(toxicity)) 정보와 같은 추가적인 정보를 기반으로 강화 학습을 통해 새로운 화합물의 신약 가능성을 예측하는 것을 목적으로 한다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 대표적인 구성은 다음과 같다. 본 발명의 일 실시예에 따르면, 신약 예측 방법은 신약 예측 장치가 화합물의 화합물 정보를 전처리하여 화합물 정보(전처리)를 생성하는 단계, 상기 신약 예측 장치가 단백질의 단백질 정보를 전처리하여 단백질 정보(전처리)를 생성하는 단계, 상기 신약 예측 장치가 상기 화합물 정보(전처리) 및 상기 단백질 정보(전처 리)를 연접하는 단계와 상기 신약 예측 장치가 연접된 상기 화합물 정보(전처리) 및 상기 단백질 정보(전처리) 를 기반으로 결합력을 예측하는 단계를 포함할 수 있다. 한편, 신약 예측 방법은 상기 신약 예측 장치가 상기 결합력을 기반으로 상기 화합물의 상기 단백질에 대응되는 질병에 대한 신약 가능성을 결정하는 단계를 더 포함할 수 있다.또한, 상기 화합물은 기존 화합물 또는 상기 기존 화합물을 변형한 신규 화합물을 포함할 수 있다. 본 발명의 다른 실시예에 따르면, 신약 예측을 수행하는 신약 예측 장치는 화합물의 화합물 정보를 전처리하여 화합물 정보(전처리)를 생성하도록 구현되는 화합물 정보 전처리부, 단백질의 단백질 정보를 전처리하여 단백질 정보(전처리)를 생성하도록 구현되는 단백질 정보 전처리부, 상기 화합물 정보(전처리) 및 상기 단백질 정보(전 처리)를 연접하는 연접부와 연접된 상기 화합물 정보(전처리) 및 상기 단백질 정보(전처리)를 기반으로 결합력 을 예측하도록 구현되는 결합력 예측부를 포함할 수 있다. 한편, 신약 예측 장치는 상기 결합력을 기반으로 상기 화합물의 상기 단백질에 대응되는 질병에 대한 신약 가능 성을 결정하도록 구현되는 신약 가능성 판단부를 더 포함할 수 있다. 또한, 상기 화합물은 기존 화합물 또는 상기 기존 화합물을 변형한 신규 화합물을 포함할 수 있다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 단백질과 화합물의 결합력을 기반으로 기존의 화합물 또는 새로운 화합물의 신약 가능성이 예측될 수 있다. 또한, 본 발명에 의하면, 단백질과 화합물 간의 예측된 결합력 뿐만 아니라 ADMET(흡수(absorption), 분포 (distribution), 대사(metabolism), 배설(excretion), 독성(toxicity)) 정보와 같은 추가적인 정보를 기반으로 강화 학습을 통해 새로운 화합물의 신약 가능성이 예측될 수 있다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명이 실시될 수 있는 특정 실시예를 예시로서 도시하는 첨부 도 면을 참조한다. 이러한 실시예는 당업자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 본 발명의 다양한 실시예는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 본 명세서에 기재되 어 있는 특정 형상, 구조 및 특성은 본 발명의 정신과 범위를 벗어나지 않으면서 일 실시예로부터 다른 실시예 로 변경되어 구현될 수 있다. 또한, 각각의 실시예 내의 개별 구성요소의 위치 또는 배치도 본 발명의 정신과 범위를 벗어나지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미 로서 행하여 지는 것이 아니며, 본 발명의 범위는 특허청구범위의 청구항들이 청구하는 범위 및 그와 균등한 모 든 범위를 포괄하는 것으로 받아들여져야 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유 사한 구성요소를 나타낸다."}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이하에서는, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있도록 하 기 위하여, 본 발명의 여러 바람직한 실시예에 관하여 첨부된 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 신약 예측 장치를 나타낸 개념도이다. 도 1에서는 화합물과 단백질 간의 결합력(affinity score)을 예측하여 신약 개발을 수행하는 신약 예측 장치가 개시된다. 도 1을 참조하면, 신약 예측 장치는 화합물 정보 전처리부, 단백질 정보 전처리부, 연접부, 결 합력 예측부, 신약 가능성 판단부, 프로세서를 포함할 수 있다. 화합물 정보 전처리부는 결합력 예측을 위해 화합물 정보를 전처리하기 위해 구현될 수 있다. 화합물 정보 전처리부는 화합물 정보를 보다 정확한 결합력 예측이 가능한 데이터 포맷인 화합물 정보(전처리)로 변환 할 수 있다. 화합물 정보 전처리부는 제1 학습 방법을 기반으로 입력된 화합물 정보에 대응되는 SMILE 시 퀀스를 임베딩하여 화합물 정보(전처리)로 변환할 수 있다. 화합물 정보 전처리부의 생성 방법은 후술된다. 단백질 정보 전처리부는 결합력 예측을 위해 단백질 정보를 전처리하기 위해 구현될 수 있다. 단백질 정보 전처리부는 단백질 정보를 보다 정확한 결합력 예측이 가능한 데이터 포맷인 단백질 정보(전처리)로 변환 할 수 있다. 단백질 정보 전처리부는 제2 학습 방법을 기반으로 생성될 수 있다. 단백질 정보 전처리부의 생성 방법은 후술된다. 연접부는 화합물 정보(전처리)와 단백질 정보(전처리)를 연접하기 위해 구현될 수 있다. 특정 화합물과 특 정 단백질의 결합력을 예측하기 위해 화합물 정보(전처리)과 단백질 정보(전처리)에 대한 연접이 수행될 수 있 다. 결합력 예측부는 화합물과 단백질 간의 결합력을 예측하기 위해 구현될 수 있다. 화합물 정보(전처리)과 단백질 정보(전처리)는 연접되어 결합력 예측부에 입력되고, 결합력 예측부 상의 결합력 예측 모델을 기반으로 화합물 정보(전처리)과 단백질 정보(전처리)의 결합력을 예측할 수 있다. 결합력 예측부는 제3 학습 방법을 기반으로 생성될 수 있다. 제3 학습 방법은 후술된다. 신약 가능성 판단부는 결합력 예측부에 의해 예측된 결합력을 기반으로 화합물의 신약 가능성을 판단 할 수 있다. 특정 화합물이 타겟 질병에 대응되는 단백질과의 결합력이 높은 경우, 특정 화합물은 높은 신약 가 능성을 가지는 것으로 판단될 수 있다. 프로세서는 화합물 정보 전처리부, 단백질 정보 전처리부, 연접부, 결합력 예측부 또 는 신약 가능성 판단부와 동작 가능하게(operatively) 연결되어 화합물 정보 전처리부, 단백질 정보 전처리부, 연접부, 결합력 예측부 또는 신약 가능성 판단부의 동작을 제어하기 위해 구현 될 수 있다. 도 2는 본 발명의 실시예에 따른 화합물 정보 전처리부를 나타낸 개념도이다. 도 2에서는 화합물 정보를 화합물 정보(전처리)로 변환하는 화합물 정보 전처리부의 생성 방법이 개시된다. 도 2를 참조하면, 화합물 정보 전처리부는 제1 하위 화합물 정보 전처리부, 제2 하위 화합물 정보 전처리 부, 제3 하위 화합물 정보 전처리부 및 프리-트레이닝부(pre-training)를 포함할 수 있다. 제1 하위 화합물 정보 전처리부는 캐릭터 임베딩부(character embedding)이고, 제2 하위 화합물 정보 전처리부는 셀프 어텐션 레이어(self-attention layer), 피드-포워드 레이어(feed forward layer)와 같은 기계 학습된 레이어 그룹을 포함하고, 제3 하위 화합물 정보 전처리부는 파인 튜닝부(fine tunning) 일 수 있다. 구체적으로 제1 하위 화합물 정보 전처리부는 캐릭터 임베딩부로서 입력된 화합물 정보를 임베딩하여 제1 화합물 벡터 정보로 변환하기 위해 구현될 수 있다. 캐릭터 임베딩부는 몰큘 토큰 임베딩(molecule token embedding) 및 포지셔널 임베딩(positional embedding)을 통해 화합물 정보(SMILE(simplified molecular-input line-entry system) sequence)를 하나의 벡터로 생성하기 위해 구현될 수 있다. 캐릭터 임베 딩부를 기반으로 화합물 정보는 화합물에 포함된 원소의 종류, 화합물에 포함된 원소의 위치, 화합물에 포 함된 원소 간의 관계 등에 대한 정보를 포함하는 제1 화합물 벡터 정보로 변환될 수 있다. 캐릭터 임베딩부 의 화합물 정보 임베딩 동작은 후술된다. 제2 하위 화합물 전처리부는 제1 화합물 벡터 정보를 적어도 하나의 학습된 레이어 그룹을 기반으로 제2 화합물 벡터 정보로 생성하기 위해 구현될 수 있다. 레이어 그룹은 셀프 어텐션 레이어와 피드-포워드 레이어를 포함할 수 있다. 제2 화합물 전처리부는 제1 화합물 벡터 정보를 레이어 그룹 상에 설정된가중치를 기반으로 전처리하여 원자 간의 관계에 대한 정보를 반영한 제2 화합물 벡터 정보로 생성하기 위해 구 현될 수 있다. 제2 하위 화합물 전처리부에 포함된 셀프 어텐션 레이어와 피드-포워드 레이어의 동작은 후 술된다. 제3 하위 화합물 정보 전처리부는 파인 튜닝부로서 제2 화합물 벡터 정보를 튜닝하여 화합물 정보(전 처리)로 생성하기 위해 구현될 수 있다. 파인 튜닝부는 연접부로 입력되기 전에 벡터의 길이를 맞추는 것 과 같은 튜닝 절차를 진행하기 위해 구현될 수 있다. 파인 튜닝부는 후술할 [REP] 토큰을 사용할 수 있다. [REP] 토큰은 새롭게 정의된 토큰으로서 주어진 몰큘 시퀀스에서 양방향 인코딩 정보를 전달할 수 있다. 몰큘 시퀀스는 화합물에 대한 정보를 나타내는 몰큘 토큰(원소, 결합 등)에 대한 시퀀스일 수 있다. 프리-트레이닝부는 화합물 정보(전처리)를 생성하기 위한 초기 설정값(예를 들어, 초기 가중치값)을 학습 하기 위해 구현될 수 있다. 구체적으로 프리-트레이닝부는 제2 화합물 벡터 정보를 생성하는 레이어 그룹 에 대한 초기 설정값을 학습할 수 있다. 또한, 프리-트레이닝부는 제1 화합물 벡터 정보를 생성하는 캐릭터 임베딩부의 몰큘 토큰 임베딩 및 포지셔널 임베딩에 대한 학습을 위해 구현될 수도 있다. 프리-트 레이닝부의 학습 동작은 후술된다. 도 3은 본 발명의 실시예에 따른 제1 하위 화합물 정보 전처리부의 동작을 나타낸 개념도이다. 도 3에서는 제1 하위 화합물 정보 전처리부의 캐릭터 임베딩 동작이 개시된다. 도 3을 참조하면, 제1 하위 화합물 정보 전처리부는 몰큘 토큰 임베딩부 및 포지셔널 임베딩부를 포 함할 수 있다. 제1 하위 화합물 정보 전처리부로 화합물 정보(SMILE sequence)가 입력되는 경우, 몰큘 토큰 임베딩부와 포지셔널 임베딩부 각각을 통해 임베딩 절차가 수행될 수 있다. 몰큘 토큰 임베딩부는 화합물 정보를 MTE(molecule token embedding) 벡터로 생성할 수 있다. 포지셔널 임베딩부는 화합물 정보를PE(positional embedding) 벡터로 생성할 수 있다. MTE 벡터는 화합물에 대한 제1 임베딩 정보를 포함할 수 있다. 제1 임베딩 정보는 화합물 내의 원소 종류 를 기반으로 한 임베딩 정보일 수 있다. 예를 들어, 제1 임베딩 정보는 methyl isocyanate를 구성하는 원자 탄 소(C), 산소(O), 질소(N) 각각을 원소 종류를 기반으로 화합물의 몰큘 시퀀스를 임베딩한 정보일 수 있다. MTE 벡터는 RVMxDM 으로 표현될 수 있고, VM은 SMILE 보케불러리(vocabulrary)의 사이즈이고, DM은 몰큘 임베딩 (molecule embedding) 사이즈일 수 있다. PE 벡터는 화합물에 대한 제2 임베딩 정보를 포함할 수 있다. 제2 임베딩 정보는 화합물 내의 원소 위치를 기반으로 한 임베딩 정보일 수 있다. MTE 벡터만을 사용하는 경우, 화합물의 몰큘 시퀀스 상의 원소 위치에 대 한 정보가 표현하기 충분하지 않아 추후 MTE 벡터만을 제2 하위 화합물 정보 전처리부의 셀프 어텐션 레이 어로 입력시 화합물과 단백질 간의 결합력의 예측 정확도가 감소될 수 있다. 따라서 본 발명에서는 MTE 벡터 에 PE 벡터를 추가하여 제1 화합물 벡터 정보가 생성될 수 있다. PE 벡터는 일 수 있고, 는 몰큘 시퀀스의 최대 길이값일 수 있다. 즉, PE 벡터(32 5)는 몰큘 시퀀스 상에서 해당 원소가 어떠한 위치에 있는지에 대한 정보를 임베딩한 제2 임베딩 정보를 포함할 수 있다. 몰큘 토큰은 화합물의 몰큘 시퀀스 상의 원소 및 원소 간의 관계에 대한 정보에 대응될 뿐만 아니라, 추가적으 로 본 발명의 실시예에서는 보다 정확한 화합물과 단백질 간의 결합력 예측을 위해 추가적인 몰큘 토큰이 정의 될 수 있다. 아래는 본 발명에서 제1 화합물 벡터 정보를 생성하기 위해 새롭게 정의된 몰큘 토큰이다. 우선, [PAD]는 고정된 길이의 제1 화합물 벡터 정보를 생성하기 위해 패딩되는 더미(dummy) 값일 수 있다. [REP]는 파인 튜닝(fine tunning)이 수행됨을 지시하는 토큰이다. [BEGIN/END]는 몰큘 시퀀스의 시작과 끝을 나타내거나 절단의 지시를 위해 사용되는 토큰이다. methyl isocyanate(CN=C=0)는 이러한 추가 토큰을 활용하여 9개의 몰큘 토큰으로 [REP] [BEGIN] C N = C = O [END] 표현될 수 있다. methyl isocyanate(CN=C=0)와 같은 하나의 화합물은 MTE 벡터(en)와 PE 벡터(pn) 각각으로 표현되고 9개의 토큰 각각에 대한 MTE 벡터와 PE 벡터의 결합으로 제1 화합물 벡터 정보(xn)가 결정될 수 있다. 본 발명의 실시예에 따르면, 몰큘 토큰 임베딩부, 포지셔널 임베딩부에 대한 기계 학습을 통해 결합 력 예측의 정확도가 향상될 수도 있다. 몰큘 토큰 임베딩부, 포지셔널 임베딩부에서 결합력 예측 결 과를 기반으로 임베딩 방법에 대한 학습이 수행될 수 있다. 전술한 프리-트레이닝부 또는 별도의 기계 학습 결 과를 기반으로 화합물 시퀀스에 대한 특성 정보가 결합력 예측을 위해 보다 정확하게 임베딩될 수 있다. 도 4는 본 발명의 실시예에 따른 제2 하위 화합물 정보 전처리부를 나타낸 개념도이다. 도 4에서는 제1 화합물 벡터 정보를 적어도 하나의 학습된 레이어 그룹을 기반으로 제2 화합물 벡터 정보로 생 성하는 제2 하위 화합물 정보 전처리부가 개시된다. 도 4를 참조하면, 제2 하위 화합물 정보 전처리부는 입력된 제1 화합물 벡터 정보를 적어도 하나의 레이어 그룹을 통해 제2 화합물 벡터 정보로 생성할 수 있다. 레이어 그룹은 셀프 어텐션 레이어 와 피드포워드 레이어를 포함할 수 있다. 셀프 어텐션 레이어는 제1 화합물 벡터 정보에 대한 프로젝션 및 가중치 부여를 통해 화합물의 몰큘 시퀀 스 상의 원자 간의 정보를 전체 시퀀스로 전달할 수 있다. 셀프 어텐션 레이어 상에서 3개의 서로 다른 벡터(쿼리 벡터(query vector, qi), 키 벡터(key vector, kh) 및 벨류 벡터(value vector, vi))에 의해 제1 화합물 벡터 정보에 대한 서로 다른 프로젝션이 수행될 수 있다. 여기서 i는 일 수 있다. 쿼리 벡터는 현재 처리 대상인 토큰을 나타내는 벡터이고, 키 벡터는 일종의 레이블(label)로, 시퀀스 내에 있 는 모든 토큰에 대한 아이덴티티(Identity)를 나타내는 벡터이고, 마지막으로 밸류 벡터는 키와 연결된 실제 토 큰을 나타내는 벡터이다. 는 쿼리 벡터에 대한 가중치이고, 는 키 벡터에 대한 가중 치이고, 는 벨류 벡터에 대한 가중치일 수 있다. 3개의 서로 다른 벡터에 서로 다른 가중치가 적용된 이후, 셀프 어텐션 가중치(self attention weight)가 적용될 수 있다. 셀프 어텐션 가중치는 아래와 같은 수학식1에 의해 결정될 수 있다. <수학식 1>"}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "여기서 Dk는 키의 차원(dimension)이고, 셀프 어텐션 가중치를 통해 원자 간의 관계에 대한 정보가 셀프 어텐션 가중치를 통해 전체 시퀀스 상에 전달될 수 있다. 셀프 어텐션 웨이트는 복수번 적용될 수 있고 이러한 경우, 멀티 헤드 어텐션이라는 용어로 표현될 수 있다. H 번 적용되는 경우, H-헤드 어텐션이고, 이러한 경우, Z는로 표현될 수 있다. 피드 포워드 레이어는 상에서 Zh는 를 기반으로 프로젝팅되어 로 출력될 수 있다. 위와 같은 셀프 어텐션 레이어 및 피드 포워드 레이어를 통한 절차는 반복될 수도 있다. 위와 같은 절차를 통해 추출된 Xout은 제2 화합물 벡터 정보일 수 있다. 도 5는 본 발명의 실시예에 따른 프리-트레이닝부를 나타낸 개념도이다. 도 5에서는 프리-트레이닝부에 제2 하위 화합물 정보 전처리부에 대한 초기 학습을 위한 가중치 값을 프리-트레 이닝하는 방법이 개시된다. 도 5를 참조하면, 프리-트레이닝부는 마스킹된 토큰은 예측하는 절차를 통해 제2 화위 화합물 정보 전처리부에 서 사용되는 셀프 어텐션 레이어에 대한 학습이 수행될 수 있다. 구체적으로 화합물의 몰큘 시퀀스에 포함되는 몰큘 토큰은 두개의 토큰 그룹(제1 토큰 그룹 및 제2 토큰 그룹)으로 나눌 수 있다. 제1 토큰 그룹은 마스킹이 수행되는 마스크 토큰을 생성하기 위한 그룹일 수 있다. 제2 토큰 그룹은 별도의 마스킹 처리하지 않은 오리지날 토큰을 유지하는 그룹일 수 있다. 제1 토큰 그룹에 포함되는 토큰은 마스크 토큰, 랜덤 토큰, 오리지날 토큰으로 나뉠 수 있 다. 마스크 토큰은 몰큘 토큰에 대한 정보를 지워서 추후에 예측 대상이 되는 토큰일 수 있다. 랜덤 토큰은 랜덤하게 결정된 토큰(랜덤)으로 교환되는 토큰일 수 있다. 오리지날 토큰은 원래 토큰이 그대로 보존된 토큰일 수 있다. 제1 토큰 그룹과 제2 토큰 그룹은 제1 임계 퍼센트(예를 들어, 제1 토큰 그룹:15%, 제2 토큰 그 룹:85%)로 분류될 수 있다. 이후, 제1 토큰 그룹 상에서 마스크 토큰에 대해 제2 임계 퍼센트(예를 들어, x퍼센트), 랜덤 토큰 에 대해 제3 임계 퍼센트(예를 들어, (100-x)/2퍼센트), 오리지날 토큰에 대해 제4 임계 퍼센트(예를 들어, (100-x)/2퍼센트)를 설정하여 토큰 별로 비율을 설정할 수 있다. 위와 같은 방식으로 토큰을 설정한 후 마스크 토큰을 찾는 절차를 통해 제2 하위 화합물 정보 전처리부에 서 사용되는 셀프 어텐션 레이어에 대한 학습이 수행되고, 초기 학습값이 전달되어 제2 화합물 벡터 정보가 생 성될 수 있다. 예를 들어, methyl isocyanate(CN=C=0)에서 'C'에 대응되는 부분이 마스킹되어 [REP] [BEGIN] C N = [MASK] = O [END] 입력되어 'C'에 대응되는 부분을 예측하는 방식으로 프리-트레이닝이 수행될 수 있다. 도 6은 본 발명의 실시예에 따른 단백질 정보 전처리부의 동작을 나타낸 개념도이다. 도 6에서는 단백질 정보 전처리부에서 단백질 시퀀스(protein sequence)를 처리하기 위한 방법이 개시된다. 도 6을 참조하면, 단백질 정보 전처리부는 임베딩(embedding) 레이어, CNN(convolutional neural network) 레이어 및 맥스 풀링(max pooling) 레이어를 포함할 수 있다. 임베딩 레이어는 단백질 시퀀스인 FASTA 시퀀스를 입력받고, FASTA 시퀀스에 포함되는 프로테인 토큰 (protein token)을 프로테인 임베딩 벡터로 변경할 수 있다. 프로테인 토큰(protein token)을 프로테인 임베딩벡터로 변경하기 위해 PTE( )가 사용될 수 있다. 여기서, VP는 FASTA 보케불러리(vocabulary) 사이즈 이고, DP는 프로테인 임베딩 사이즈일 수 있다. 임베딩 레이어를 통해서 프로테인 매트릭스(protein matrix) P가 생성될 수 있다. 프로테인 매트릭스는 일 수 있고, 는 프로테인 시퀀스의 최대 길이일 수 있다. 프로테인 매트릭스(P)는 CNN 레이어로 입력될 수 있다. 프로테인 매트릭스(P)는 CNN 레이어를 통해 가중치 c1으로 콘볼루션될 수 있고, 로 s1은 필터의 길이일 수 있다. 이러한 CNN 레이어를 통한 콘볼루션 절차는 m번 반복될 수 있다. 첫번째 콘볼루션 레이어를 통과한 경우, 벡터 PC1( )이 생성되고, 벡터 PC1은 시퀀스 상의 s1-gram 특징을 전달할 수 있다. 복수개의 CNN 레이어를 거친 이후 최종 벡터는 일 수 있다. 최종 벡터(PC1)은 맥스 풀링 레이어로 전달되고, 맥스 풀링 레이어에서 핵심 피처 특징(the most salient feature)가 추출될 수 있다. 맥스 풀링 레이어를 통해 추출된 결과는 단백질 정보(전처리) 로서 일 수 있다. 도 7은 본 발명의 실시예에 따른 연접부, 결합력 결정부의 동작을 나타낸 개념도이다. 도 7에서는 화합물 정보 전처리부 및 단백질 정보 전처리부를 통해 나온 전처리 결과를 연접하고, 연접한 결과 를 기반으로 화합물과 단백질 간의 결합력을 예측하는 방법이 개시된다. 도 7을 참조하면 화합물 정보 전처리부를 통해 생성된 화합물 정보(전처리)와 단백질 정보 전처리부를 통 해 생성된 단백질 정보(전처리)를 연접하고, 결합력 결정부에 입력하여 결합력에 대한 예측을 수행할 수 있다. 결합력 결정부는 드롭 아웃 레귤레이션(dropout regulation)을 적용한 멀티-레이어드 피드 포워드 네트워크 (multi-layered feed forward network)와 리그레션 레이어(regression layer)를 포함할 수 있다. 멀티-레이어드 피드 포워드 네트워크는 화합물과 단백질 간의 실제 결합력과 화합물과 단백질 간의 예측 결합력의 차이(예를 들어, MSE(mean square error))를 기반으로 최적화될 수 있다. 화합물과 단백질과의 결합력이 높은 경우는 신약 후보 물질로 판단될 수 있다. 이러한 방식으로 기존의 화합물 의 새로운 질병에 대한 신약으로 사용 가능성에 대한 판단이 가능하다. 도 1 내지 도 7에서 전술한 방법에서는 기존에 존재하는 화합물, 신규 화합물과 단백질 간의 결합력을 예측하여 신약 가능성이 판단되나 신규 화합물을 생성하고, 신규 화합물의 신약 가능성을 결합력뿐만 아니라 다른 다양한 요소를 고려하여 신약 가능성에 대해서도 판단 가능하다. 이하, 도 8에서는 신규 화합물을 생성하고, 생성된 신규 화합물에 대해 결합력 외의 다른 요소를 함께 고려하여 신약 가능성을 판단하는 방법이 개시된다. 도 8은 본 발명의 실시예에 따른 신약 예측 장치를 나타낸 개념도이다. 도 8에서는 기존 화합물을 기준으로 신규 화합물을 생성하고, 신규 화합물의 신약으로서 가능성을 예측하기 위 한 신약 예측 장치가 개시된다. 도 8을 참조하면, 신약 예측 장치는 신규 화합물 생성부, 타겟 신규 화합물 결정부, 신약 가능성 예 측부를 포함할 수 있다. 신규 화합물 생성부는 기존 화합물 정보를 수신하고, 기존 화합물을 변형하여 신규 화합물을 생성하기 위 해 구현될 수 있다. 신규 화합물 생성부는 본드 추가(bond addition), 본드 삭제(bond deletion), 원자 추가(atom addition), 원자 삭제(atom deletion)를 통해 기존 화합물을 변형하여 신규 화합물을 생성시킬 수 있다. 신규 화합물 생성부는 신규 화합물에 대한 신약 가능성 판단부의 판단 결과를 반영하여 보상 함수(reward function)에 의해 강화 학습을 수행할 수 있다. 즉, 신규 화합물 생성부는 생성한 신규 화합물의 평 가 결과를 반영하여 신약으로 가능성이 높은 물질을 생성할 수 있다. 타겟 신규 화합물 결정부는 신규 화합물 생성부에 의해 생성된 복수의 신규 화합물 중 신약 가능성 판단부의 판단을 받을 타겟 신규 화합물을 결정하기 위해 구현될 수 있다. 예를 들어, 타겟 신규 화합물 결정부 는 신규 화합물 생성부에 의해 생성된 복수의 신규 화합물 중 구조적으로 가능한 물질, 생성이 가능 한 물질 등인지 여부를 판단하여 타겟 신규 화합물을 결정할 수 있다. 신약 가능성 예측부는 타겟 신규 화합물에 대한 신약 가능성을 판단하기 위해 구현될 수 있다. 예를 들어, 신약 가능성 예측부는 결합력(bonding affinity) 정보, ADMET 정보, QED(quantitative estimate of druglikeness) 정보, SAS(synthetic accessibility scores) 정보 등을 기반으로 신약 가능성을 판단할 수 있 다. 판단된 신약 가능성은 다시 신규 화합물 생성부로 전달되고 신규 화합물 생성부는 신약 가능성을 기반으로 한 보상 함수를 기반으로 강화 학습을 수행할 수 있다. 결합력 정보는 도 1 내지 도 7에서 전술한 방법을 기반으로 타겟 신규 화합물과 타겟 질병의 단백질 구조의 결 합력에 대한 예측값을 포함할 수 있다. ADMET 정보는 신규 화합물의 흡수(absorption), 분포(distribution), 대사(metabolism), 배설(excretion), 독 성(toxicity)에 대한 정보를 포함할 수 있다. QED정보는 물질의 약물 유사성에 대한 정보를 포함할 수 있다. SAS 정보는 화합물의 합성 가능성에 대한 정보를 포함할 수 있다. 도 9는 본 발명의 실시예에 따른 신약 판단 장치의 신약 판단 방법을 나타낸 순서도이다. 도 9를 참보하면, 신약 예측 장치가 오리지날 화합물 정보를 수신한다(단계 S900) 오리지날 화합물 정보는 몰큘 토큰이 변형이 되지 않은 몰큘 시퀀스로서 신약으로 사용 가능할 것으로 판단된 화합물에 대한 정보일 수 있다. 신약 예측 장치가 오리지날 화합물을 변형하여 제1 신규 화합물을 결정한다(단계 S910). 신약 예측 장치는 마르코프 결정 프로세스를 사용하여 오리지날 화합물을 기준으로 본드 추가(bond addition), 본드 삭제(bond deletion), 원자 추가(atom addition), 원자 삭제(atom deletion)를 통해 적어도 하나의 제1 신규 화합물을 생성할 수 있다. 적어도 하나의 제1 신규 화합물 중 제1 타겟 신규 화합물을 결정할 수 있다(단계 S920). 제1 신규 화합물 중 신약 가능성 판단부의 판단을 받을 타겟 신규 화합물로서 복수의 신규 화합물 중 구조적으 로 가능한 물질, 생성이 가능한 물질 등인지 여부를 판단하여 제1 타겟 신규 화합물이 결정될 수 있다. 신약 예측 장치가 제1 타겟 신규 화합물과 타겟 단백질에 대한 제1 판단 정보를 결정한다(단계 S930). 제1 판단 정보는 하위 판단 정보로서 제1 타겟 신규 화합물과 타겟 단백질의 결합력 정보, 제1 타겟 신규 화합 물과 타겟 단백질의 ADMET 예측 정보, QED정보, SAS 정보 등을 포함할 수 있다.신약 예측 장치가 제1 판단 정보를 기반으로 제1 타겟 신규 화합물의 신약의 활용 가능성을 결정한다(단계 S940). 제1 판단 정보를 기반으로 제1 타겟 신규 화합물이 신약으로서 활용 가능한지 여부가 결정될 수 있다. 하위 판 단 정보1 내지 하위 판단 정보n 각각에 대한 기준이 설정될 수 있고, 하위 판단 정보 각각에 대한 기준을 만족 하는지 여부를 기반으로 신약의 활용 가능성이 결정될 수 있다. 제1 타겟 신규 화합물의 보상 함수 결과값이 생성된다(단계 S950). 제1 타겟 신규 화합물에 대한 제1 판단 정보를 기반으로 보상 함수를 적용한 보상 함수 적용 결과가 결정될 수 있다. 보상 함수는 하위 판단 정보 각각에 대해 높은 신약 가능성을 가질수록 높은 보상값을 가지도록 설정될 수 있다. 신약 예측 장치가 제1 판단 정보를 기반으로 제2 신규 화합물을 결정한다(단계 S960). 제2 신규 화합물은 제1 판단 정보에 대한 보상 함수 적용 결과를 고려하여 마르코프 결정 프로세스를 기반으로 결정되고, 제1 타겟 신규 화합물에 대해 본드 추가, 본드 삭제, 원자 추가, 원자 삭제를 적용하여 생성될 수 있 다. 제2 신규 화합물은 보상 함수 결과값을 적용한 강화 학습을 사용하여 하위 판단 정보 중 신약 기준에 맞지 않는 부분을 고려한 학습을 통해 생성될 수 있다. 마찬가지로 신약 판단 장치가 적어도 하나의 제2 신규 화합물 중 제2 타겟 신규 화합물을 결정할 수 있다(단계 S970). 동일하게 신약 판단 장치가 제2 타겟 신규 화합물과 타겟 단백질의 제2 판단 정보를 결정한다(단계 S980). 제2 판단 정보는 하위 판단 정보로서 제2 타겟 신규 화합물과 타겟 단백질의 결합력 정보, 제2 타겟 신규 화합 물과 타겟 단백질의 ADMET 예측 정보, QED정보, SAS 정보 등을 포함할 수 있다. 제2 판단 정보를 기반으로 제2 타겟 신규 화합물이 신약으로서 활용 가능한지 여부가 결정될 수 있다. 제2 타겟 신규 화합물의 보상 함수 결과값이 생성된다(단계 S990). 제2 타겟 신규 화합물에 대한 제2 판단 정보를 기반으로 보상 함수를 적용한 보상 함수 적용 결과가 결정될 수 있다. 보상 함수는 하위 판단 정보 각각에 대해 높은 신약 가능성을 가질수록 높은 보상값을 가지도록 설정될 수 있다. 다시 제2 판단 정보로 제3 신규 화합물 및 제3 타겟 신규 화합물을 결정하는 절차를 반복할 수 있다. 즉, 제n 판단 정보로 제n+1 신규 화합물 및 제 n+1 타겟 신규 화합물을 결정하는 절차를 반복하여 신약 가능성이 높은 신규 화합물을 결정할 수 있다. 이러한 반복 절차를 통해 계속적으로 강화 학습이 수행되어 최종적으로 신약 가능성이 존재하는 최종 신규 화합 물이 결정될 수 있다. 도 10은 본 발명의 실시예에 따른 강화 학습 방법을 나타낸 개념도이다. 도 10에서는 본 발명의 실시예에 따른 판단 정보를 기반으로 강화학습을 수행하기 위한 방법이 개시된다. 도 10을 참조하면, 결합력 정보, ADMET 정보, QED정보 . SAS 정보 등과 같은 판단 정보가 그룹핑되어 강화학습 이 수행될 수 있다. 판단 정보에 대한 그룹핑을 수행함에 있어서 결합력 정보, ADMET 정보, QED정보, SAS 정보 등과 같은 하위 판단 정보가 분류될 수 있다. 하위 판단 정보 중 특정 범위 기준을 만족하면 신약으로서 사용 가능성을 판단하는 제1 하위 판단 정보와 존재 여부를 기반으로 신약으로서 사용 가능성을 판단하는 제2 하위 판단 정보가 분류될 수 있다. 제1 하위 판단 정보는 제1 판단 그룹으로 그룹핑되고, 제2 하위 판단 정보는 제2 판단 그룹으로 그 룹핑될 수 있다. 이러한 제1 하위 판단 정보와 제2 하위 판단 정보는 타겟 질병에 따라 다르게 설정되어 그룹핑 될 수 있다 예를 들어, 특정 신약에 대해 결합력의 경우 특정 범위를 만족하면 되는 제1 하위 판단 정보이고, 독성은 존재 하면 안되는 제2 하위 판단 정보일 수 있다. 이러한 경우, 결합력 정보는 제1 판단 그룹에 포함되고, 독 성 정보를 제2 판단 그룹에 포함될 수 있다. 제1 판단 그룹 내의 적어도 하나의 하위 판단 정보는 신약 가능성에 영향을 많이 끼치는 순서를 고려하여 우선 순위가 설정되어 제1 하위 판단 정보(우선 순위1), 쪋, 제1 하위 판단 정보(우선 순위n)으로 결정될 수 있 다. 마찬가지로 제2 판단 그룹 내의 적어도 하나의 하위 판단 정보는 신약 가능성에 영향을 많이 끼치는 순서 를 고려하여 우선 순위가 설정되어 제2 하위 판단 정보(우선 순위1), 쪋, 제2 하위 판단 정보(우선 순위n)으로 결정될 수 있다. 제1 판단 그룹과 제2 판단 그룹 각각이 설정된 이후, 제1 판단 그룹에 포함되는 제1 하위 판 단 정보 각각 및 제1 판단 그룹에 포함되는 제2 하위 판단 정보 각각에 대한 별도의 보상 함수가 적용될 수 있 다. 제1 판단 그룹에 포함되는 제1 하위 판단 정보에 대해서는 특정 범위 만족 여부 및 특정 범위를 벋어 난 정도를 고려하는 제1 타입 보상 함수가 설정될 수 있고, 각 우선 순위를 고려하여 보상 함수별 가중치 가 설정될 수 있다. 제2 판단 그룹에 포함되는 제2 하위 판단 정보에 대해서는 특정값이 존재하는지 여부 를 판단하는 제2 타입 보상 함수가 설정될 수 있고, 각 우선 순위를 고려하여 보상 함수별 가중치가 설정 될 수 있다. 또한 본 발명의 실시예에 따르면, 단계별 강화학습이 수행될 수도 있다. 강화 학습 효과를 높이기 위해 n차를 설정하여 강화학습이 수행될 수 있다. n차를 전반기(1차~a차)와 하반기(a+1차~n차)로 분류하여 상대적으로 전반기 강화학습에서는 제1 판단 그룹, 제2 판단 그룹에 대해 제1 타입 보상 함수를 설정하되, 만족 여부를 결정하는 특정 범위의 기준을 계속적으로 높이 는 방식이 사용될 수 있다. 하반기 강화학습에서는 제1 판단 그룹에 제1 타입 보상 함수가 사용되고, 제2 판단 그룹에 대해 제2 타입 보상 함수가 사용되어 제1 타입 보상 함수는 만족 여부를 결정하는 특정 범위의 기준을 계속적으로 높이고, 제2 타입 보상 함수의 경우, 특정값이 존재하는지 여부를 판단하는지 기준을 적용하여 학습을 수행할 수 있다. 이러한 강 화 학습 방식을 통해 강화 학습을 통해 신약 후보로서 활용될 수 있는 화합물의 풀이 좀 더 넓혀져서 판단 대상 으로 설정될 수 있다. 도 11은 본 발명의 실시예에 따른 강화학습 모델을 나타낸 개념도이다. 도 11에서는 하위 판단 정보를 순차적으로 판단하기 위한 강화 학습 모델이 개시된다. 도 11을 참조하면, 강화 학습을 수행함에 있어서 하위 판단 정보에 대해 순차적인 강화 학습을 수행하기 위한 방법이 개시된다. 특정 하위 판단 정보에 대한 신뢰도(또는 정확도)가 높은 경우, 높은 신뢰도를 가지는 하위 판단 정보를 기반으 로 1차 강화 학습이 수행될 수 있다. 전술한 화합물과 단백질의 결합력의 예측값에 대한 신뢰도가 높은 경우 1차 강화 학습으로 결합력에 대한 보상 함수만을 적용하여 1차 강화 학습을 수행하여 1차 타 겟 신규 화합물이 결정될 수 있다. 적어도 하나의 1차 타겟 신규 화합물의 결정 이후, 다음 신뢰도 범위를 가지는 적어도 하나의 하위 판단 정보에 대해 보상 함수를 적용한 2차 강화 학습이 수행되어 2차 타겟 신규 화합물이 결정될 수 있 다. 이러한 방식으로 높은 신뢰도를 가지는 하위 판단 정보를 우선 순위로 강화 학습을 적용함으로서 최종적으로 결 정된 화합물에 대한 신뢰도를 높일 수 있다. 하위 판단 정보의 신뢰도가 유사 범위일 경우 동일한 n-x 차 강화학습에 포함시키거나 두개의 별도 학습 경로로 설정하여 이후 단계에서는 독립적인 강화 학습을 수행하도록 할 수 있다. 즉, n-x 차 강화학습(하위 판단 정보 a), n-x 차 강화학습(하위 판단 정보b)로 독립적인 강화 학습 경로가 설정하고 n-x+1 차 강화 학습이 n 차 강화 학습(하위 판단 정보a), n 차 강화학습(하위 판단 정보b) 각각의 이후 절차로 수행될 수 있다. 또는 하위 판단 정보의 중요도가 높은 경우 동일한 n-x 차 강화학습에 포함시키거나 두개의 별도 학습 경로로 설정하여 이후 단계에서는 독립적인 강화 학습을 수행하도로 할 수 있다. 예를 들어, 제2 하위 판단 정보(예를 들어 독성)와 같은 존재하지 않아야 하는 특성의 경우에 신뢰도 여부와 별도로 독립된 경로로 분할하여 강화학 습이 수행될 수 있다. 이상 설명된 본 발명에 따른 실시예는 다양한 컴퓨터 구성요소를 통하여 실행될 수 있는 프로그램 명령어의 형 태로 구현되어 컴퓨터 판독 가능한 기록 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능한 기록 매체는 프로그 램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 컴퓨터 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 본 발명을 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨 어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 판독 가능한 기록 매체의 예에는, 하드 디스 크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크 (floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프 로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령어의 예에는, 컴 파일러에 의하여 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실 행될 수 있는 고급 언어 코드도 포함된다. 하드웨어 장치는 본 발명에 따른 처리를 수행하기 위하여 하나 이상 의 소프트웨어 모듈로 변경될 수 있으며, 그 역도 마찬가지이다. 이상에서 본 발명이 구체적인 구성요소 등과 같은 특정 사항과 한정된 실시예 및 도면에 의하여 설명되었으나, 이는 본 발명의 보다 전반적인 이해를 돕기 위하여 제공된 것일 뿐, 본 발명이 상기 실시예에 한정되는 것은 아"}
{"patent_id": "10-2020-0138236", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "니며, 본 발명이 속하는 기술분야에서 통상적인 지식을 가진 자라면 이러한 기재로부터 다양한 수정과 변경을 꾀할 수 있다. 따라서, 본 발명의 사상은 상기 설명된 실시예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 발명의 사상의 범주에 속한 다고 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2020-0138236", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 신약 예측 장치를 나타낸 개념도이다. 도 2는 본 발명의 실시예에 따른 화합물 정보 전처리부를 나타낸 개념도이다. 도 3은 본 발명의 실시예에 따른 제1 하위 화합물 정보 전처리부의 동작을 나타낸 개념도이다. 도 4는 본 발명의 실시예에 따른 제2 하위 화합물 정보 전처리부를 나타낸 개념도이다. 도 5는 본 발명의 실시예에 따른 프리-트레이닝부를 나타낸 개념도이다. 도 6은 본 발명의 실시예에 따른 단백질 정보 전처리부의 동작을 나타낸 개념도이다. 도 7은 본 발명의 실시예에 따른 연접부, 결합력 결정부의 동작을 나타낸 개념도이다. 도 8은 본 발명의 실시예에 따른 신약 예측 장치를 나타낸 개념도이다. 도 9는 본 발명의 실시예에 따른 신약 판단 장치의 신약 판단 방법을 나타낸 순서도이다."}
