{"patent_id": "10-2022-0189526", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0106591", "출원번호": "10-2022-0189526", "발명의 명칭": "디자인권 도면 매칭 장치 및 방법", "출원인": "(주)네오와인", "발명자": "이효승"}}
{"patent_id": "10-2022-0189526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "현품 촬영 장치로부터 수신한 현품 이미지를 제1 인공지능 모델을 이용해 분석하여 물품 분류 코드를 출력하는품목 분석부와,상기 물품 분류 코드에 근거해 특허청 데이터베이스로부터 디자인권 정보를 검색하는 디자인권 검색부와,상기 현품 이미지와 상기 검색한 디자인권 정보를 이용해 획득한 디자인 도면 이미지 간의 유사도를 제2 인공지능 모델을 이용해 분석하는 유사도 분석부와, 상기 유사도 분석 결과에 근거해 상기 현품 촬영 장치로 전송할 디자인권 정보를 출력하는 디자인권 정보 출력부를 포함하는 디자인권 도면 매칭 장치."}
{"patent_id": "10-2022-0189526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 디자인권 검색부는 디자인 도면 이미지에 접근할 수 있는 URL 정보를 획득하고 이를 이용해 상기 특허청데이터베이스로부터 디자인 도면 이미지를 다운로드 받아 내부 저장소에 저장하는 것을 특징으로 하는 디자인권도면 매칭 장치."}
{"patent_id": "10-2022-0189526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 유사도 분석부는 디자인 도면 이미지로부터 추출한 특징 정보와 현품 이미지의 컬러 영상 및 깊이맵 영상으로부턱 각각 추출한 특징 정보를 비교 분석하여 상기 현품 이미지와 유사도가 높은 순서대로 디자인권 정보를정렬하는 것을 특징으로 하는 디자인권 도면 매칭 장치."}
{"patent_id": "10-2022-0189526", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "유사도 분석 서버에 의해 수행되는 디자인권 도면 매칭 방법에 있어서, 현품 촬영 장치로부터 현품의 컬러 영상 및 깊이맵 영상으로 구성된 현품 이미지를 수신하는 단계와,상기 현품 이미지를 제1 인공지능 모델을 이용해 분석하여 현품과 관련된 물품 분류 코드를 출력하는 단계와, 상기 물품 분류 코드에 근거해 특허청 데이터베이스로부터 디자인 도면 이미지에 접근할 수 있는 URL 정보를 포함하는 디자인권 정보를 검색하는 단계와, 상기 URL 정보를 이용해 상기 특허청 데이터베이스로부터 디자인 도면 이미지를 다운로드 받아 저장하는단계와, 상기 현품 이미지와 상기 저장된 디자인 도면 이미지 간의 유사도를 제2 인공지능 모델을 이용해 분석하는 단계와, 상기 유사도 분석 결과에 근거해 상기 현품 촬영 장치로 전송할 디자인권 정보를 출력하는 단계를 포함하는 디자인권 도면 매칭 방법."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 카메라로 촬영된 현품의 사진과 데이터베이스에 등록된 디자인권의 도면 간의 유사도를 인공지능 기반 으로 분석하여 매칭된 디자인권 정보를 사용자에게 제공하는 디자인권 도면 매칭 장치 및 방법에 관한 것이다. 이를 위해, 본 발명에 따른 디자인권 도면 매칭 장치는 현품 촬영 장치로부터 수신한 현품 이미지를 제1 인공지 능 모델을 이용해 분석하여 물품 분류 코드를 출력하는 품목 분석부와, 상기 물품 분류 코드에 근거해 특허청 데 이터베이스로부터 디자인권 정보를 검색하는 디자인권 검색부와, 상기 현품 이미지와 상기 검색한 디자인권 정보 를 이용해 획득한 디자인 도면 이미지 간의 유사도를 제2 인공지능 모델을 이용해 분석하는 유사도 분석부와, 상 기 유사도 분석 결과에 근거해 상기 현품 촬영 장치로 전송할 디자인권 정보를 출력하는 디자인권 정보 출력부를 포함한다."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 카메라로 촬영된 현품의 사진과 데이터베이스에 등록된 디자인권의 도면 간의 유사도를 인공지능 기 반으로 분석하여 매칭된 디자인권 정보를 사용자에게 제공하는 디자인권 도면 매칭 장치 및 방법에 관한것이다."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "세관에서는 수입 물건에 대하여 X-Ray 검사를 통해 지식재산권 침해가 예상되는 특정 물품에 대하여 개장검사를 실시하고 있다. 이 때 해당 제품의 디자인권자에게 연락하여 디자인권자가 불법복제 여부를 확인하게 된다. 이러한 절차를 위해 디자인권자가 세관 작업자에게 제품의 상표 및 디자인에 대한 교육을 실시하여 세관 작업자 는 수입 제품이 어떤 회사의 제품인지 알 수 있게 된다. 하지만 세관 작업자가 특허청에 등록된 상표 및 디자인 정보를 학습할 수 없다. 따라서 수입 제품과 디자인권 도면을 비교하여 유사도를 분석할 수 있는 기술 또는 시 스템이 필요하다. 유사도 분석을 위해 촬영된 현품 영상과 도면 영상에 대하여 영상처리 또는 인공지능 기술을 적용할 수 있으며, 인공지능의 경우 영상을 처리하는 컨벌루션(Convolution) 으로 구성된 AI 모델을 적용할 수 있다. AI 모델은 현품 영상과 도면 영상에 대하여 특징을 추출하고, 유사도를 비교해야 하는데, 현품의 경우 사용자가 다양한 환경에서 사진을 촬영할 수 있으므로 다양한 전처리 방법을 고려해야 한다. 특히, 특징을 잘 추출하기 위해서는 기본적으로 많은 데이터가 있을수록 더 많은 특징을 추출할 수 있다. 일반적으로 인공지능 기술에는 그레이스케일(Grayscale) 영상이나 컬러 영상을 주로 사용하지만 더 많은 특징을 추출하기 위해 스테레오 카메라로 깊이맵(Depth-map) 영상을 사용할 수 있다. 깊이맵(Depth-map) 영상은 일반적으로 스테레오 카메라, 라이다(Lidar) 센서 등을 통해 얻을 수 있으며, 이는 객체의 3차원 정보를 추출할 수 있어 더 많은 특징 추출에 유효하다. 이에 따라 스테레오 카메라로 구성된 장치 통해 촬영된 현품의 컬러 영상과 깊이맵(Depth) 영상에서 더 많은 특 징을 추출하여 디자인권 도면과 매칭 유사도를 분석할 수 있는 기술에 대한 개발이 필요한 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) (선행기술 1) 한국공개특허공보 제10-2021-0145974호"}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기의 실정을 감안하여 창안된 것으로서, 본 발명의 목적은 카메라로 촬영된 현품 사진과 매칭되는 디자인권 정보를 관련 담당자에게 신속하고 정확하게 제공하는 것이다."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해, 본 발명에 따른 디자인권 도면 매칭 장치는 현품 촬영 장치로부터 수신한 현품 이미지를 제1 인공지 능 모델을 이용해 분석하여 물품 분류 코드를 출력하는 품목 분석부와, 상기 물품 분류 코드에 근거해 특허청 데이터베이스로부터 디자인권 정보를 검색하는 디자인권 검색부와, 상기 현품 이미지와 상기 검색한 디자인권 정보를 이용해 획득한 디자인 도면 이미지 간의 유사도를 제2 인공지능 모델을 이용해 분석하는 유사도 분석부 와, 상기 유사도 분석 결과에 근거해 상기 현품 촬영 장치로 전송할 디자인권 정보를 출력하는 디자인권 정보 출력부를 포함한다. 또한 본 발명에 따른 디자인권 도면 매칭 방법은 유사도 분석 서버에 의해 수행되는 디자인권 도면 매칭 방법으 로서, 현품 촬영 장치로부터 현품의 컬러 영상 및 깊이맵 영상으로 구성된 현품 이미지를 수신하는 단계와, 상 기 현품 이미지를 제1 인공지능 모델을 이용해 분석하여 현품과 관련된 물품 분류 코드를 출력하는 단계와, 상 기 물품 분류 코드에 근거해 특허청 데이터베이스로부터 디자인 도면 이미지에 접근할 수 있는 URL 정보를 포함 하는 디자인권 정보를 검색하는 단계와, 상기 URL 정보를 이용해 상기 특허청 데이터베이스로부터 디자인 도면 이미지를 다운로드 받아 저장하는 단계와, 상기 현품 이미지와 상기 저장된 디자인 도면 이미지 간의 유사도를 제2 인공지능 모델을 이용해 분석하는 단계와, 상기 유사도 분석 결과에 근거해 상기 현품 촬영 장치로 전송할디자인권 정보를 출력하는 단계를 포함한다."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면 세관을 통과하는 현품을 촬영하여 인공지능으로 분석을 수행하면 현품과 매칭되는 디자인권 정보를 즉시 확인할 수 있기 때문에 현품 관련 지적재산권 담당자에게 통지하여 신속한 후속조치가 가능한 효과 가 있다."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명에 따른 실시예를 상세하게 설명한다. 본 발명의 구성 및 그에 따른 작용 효과는 이하의 상세한 설명을 통해 명확하게 이해될 것이다. 본 발명의 상세한 설명에 앞서, 동일한 구성요소에 대해서는 다른 도면상에 표시되더라도 가능한 동일한 부호로 표시하며, 공지된 구성에 대해서는 본 발명의 요지를 흐릴 수 있다고 판단되는 경우 구체적인 설명은 생략하기 로 함에 유의한다. 도 1은 본 발명에 따른 디자인권 도면 매칭 장치의 개략적인 구성을 나타낸 것이다. 도 1을 참조하면, 디자인권 도면 매칭 장치는 현품 촬영 장치와 유사도 분석 서버를 포함한다. 현품 촬영 장치는 현품을 촬영하여 현품 이미지를 생성하고 이를 유사도 분석 서버로 전송한다. 현품 촬영 장치는 유사도 분석 서버로부터 수신한 디자인권 정보를 출력한다. 현품 촬영 장치는 현품 이미지를 생성하는 카메라 및 디자인권 정보를 표시하는 디스플레이를 구비하고 있다. 유사도 분석 서버는 현품 촬영 장치로부터 현품 이미지를 수신하고 이를 분석하여 특허청 데이터베이 스로부터 현품과 유사한 디자인권 정보를 검색한다. 유사도 분석 서버는 검색한 디자인권 정보를 현 품 촬영 장치로 전송한다. 현품 촬영 장치은 세관에 설치되어 있다. 현품 촬영 장치가 세관을 통과하는 현품을 촬영하여 유 사도 분석 서버로 전송하면, 유사도 분석 서버는 현품과 관련한 디자인권이 존재하는지 확인하여 현품 촬영 장치로 통지한다. 세관 직원은 현품 촬영 장치로 통지되는 디자인권 정보를 확인하여 해당 디자인권 관련 업체 담당자에게 세관 통과 사실을 알릴 수 있다. 도 2는 본 발명에 따른 현품 촬영 장치의 내부 구성을 개략적으로 나타낸 것이다. 도 2를 참조하면, 본 발명에 따른 현품 촬영 장치는 이미지 생성부, 통신부, 표시부 등을 포함한다. 이미지 생성부는 현품을 촬영하여 현품 이미지를 생성한다. 현품 이미지는 컬러 영상 및 깊이맵 영상을 포 함할 수 있다. 깊이맵(Depth-map) 영상은 일반적으로 스테레오 카메라 또는 라이다(Lidar) 센서를 이용해 획득할 수 있다. 현 품 이미지의 컬러 영상과 깊이맵 영상의 예는 도 5에 도시되어 있다. 이에 따라 본 발명에 따른 이미지 생성부는 스테레오 카메라이거나 일반 카메라 및 라이더 센서로 구성될 수 있다. 통신부는 이미지 생성부에서 생성한 현품 이미지를 유사도 분석 서버로 전송한다. 또한 통신부 는 유사도 분석 서버로부터 디자인권 정보를 수신한다. 표시부는 유사도 분석 서버로부터 수신한 디자인권 정보를 디스플레이 화면에 표시한다. 표시부(10 6)에 표시되는 디자인권 정보는 현품 이미지와 유사도가 높은 디자인 도면을 가진 디자인권 관련 정보이다. 이 러한 디자인권 정보는 도 8과 같이 구성될 수 있다. 도 3은 본 발명에 따른 유사도 분석 서버의 내부 구성을 개략적으로 나타낸 것이다. 도 3을 참조하면, 본 발명에 따른 유사도 분석 서버는 품목 분석부, 디자인권 검색부, 유사도 분석부, 디자인권 정보 출력부, 저장소 등을 포함한다. 품목 분석부는 현품 촬영 장치로부터 수신한 현품 이미지를 제1 인공지능 모델을 이용해 분석하여 현 품과 관련된 품목 즉, 물품 분류 코드를 출력한다. 품목 분석부는 내림차순으로 현품과 관련도가 높은 물 품 분류 코드를 Top-N으로 출력할 수 있다. 여기서 물품 분류 코드는 한국 분류 코드 또는 국제 분류 코드를 포 함할 수 있다. 품목 분석부에 적용되는 제1 인공지능 모델은 도 6에 도시된 바와 같이, 현품 이미지(3채널 RGB 영상)로부 터 특징정보를 추출하는 컨벌루션 레이어, 추출한 특징정보를 분석하기 위한 특징분석 레이어, 품목 정보(물품 분류 코드)를 출력하는 출력 레이어 등으로 구성된다. 디자인권 검색부는 특허청 데이터베이스로부터 물품 분류 코드 리스트에 근거해 물품 분류 코드에 해 당하는 모든 디자인권 정보를 검색한다. 디자인권 검색부는 물품 분류 코드에 해당하는 디자인권 정보로서 디자인 도면 이미지에 접근할 수 있는 URL 정보를 획득한다. URL 정보가 포함된 디자인권 정보는 도 9에 도시되어 있다. 도 9를 참조하면, 각 물품 분류 코드에 그에 해당하 는 디자인권 정보가 포함되어 있고, 각 디자인권 정보에는 해당하는 디자인 도면 이미지를 다운로드 받을 수 있 는 URL 정보가 포함되어 있다. 디자인권 검색부는 획득한 URL 정보를 이용하여 특허청 데이터베이스로부터 디자인 도면 이미지를 다 운로드 받아 내부 저장소에 저장한다. 유사도 분석부는 제2 인공지능 모델을 이용하여 현품 이미지와 내부 저장소에 저장된 디자인 도면 이 미지 간의 유사도를 분석한다. 유사도 분석부는 디자인 도면 이미지와 현품 이미지의 컬러 영상 및 깊이맵 영상을 분석하여 유사도가 높 은 순으로 디자인권 리스트를 Top-N으로 출력할 수 있다. 유사도 분석부에 적용되는 제2 인공지능 모델은 도 7에 도시된 바와 같이, 현품 이미지(4채널 RGB 영상 및 깊이맵 영상)로부터 특징정보를 추출하는 현품 이미지용 컨벌루션 레이어, 디자인 도면 이미지(1채널 그레이스 케일 영상)로부터 특징정보를 추출하는 도면용 컨벌루션 레이어, 추출한 두 특징정보를 비교 분석하기 위한 유 사도 비교 레이어, 유사도 결과(0~1)를 출력하는 출력 레이어 등으로 구성된다. 현품 이미지와 디자인 도면 이미지의 각 특징정보는 유사도 비교 레이어에 입력된다. 유사도 비교 레이어는 학 습과정을 통해 결정된 가중치(weight) 및 바이어스(bias) 값과 활성함수(activation function)에 근거한 복수의 은닉 레이어(hidden layer)으로 구성되며 이러한 은닉 레이어를 거쳐 출력 레이어로 출력된다. 출력 레이어로 출력된 분류값은 0~1 사이의 실수 값으로서 0의 값은 완전히 유사하지 않다는 것이고, 1의 값은 완전히 유사하 다는 것이다. 디자인권 정보 출력부는 유사도 분석 결과에 근거해 현품 촬영 장치로 전송할 디자인권 정보를 출력 한다. 디자인권 정보 출력부는 유사도 높은 순서대로 Top-N 방식으로 도 8에 도시된 디자인권 정보를 현품 촬영 장치에 제공한다. 도 4는 본 발명에 따른 디자인권 도면 매칭 처리 과정을 나타낸 것이다. 도 4에 도시된 각 처리 단계는 본 발명에 따른 디자인권 도면 매칭 장치 또는 유사도 분석 서버에서 수행 될 수 있다. 도 4를 참조하면, 유사도 분석 서버는 현품 촬영 장치로부터 현품의 컬러 영상 및 깊이맵 영상으로 구성된 현품 이미지를 수신한다(S10). 유사도 분석 서버는 현품 이미지를 제1 인공지능 모델을 이용해 분석하여 현품과 관련된 유사 물품 분류 코드를 출력한다(S20). 유사도 분석 서버는 물품 분류 코드에 근거해 유사 품목의 디자인권 검색 과정을 수행한다(S30). 구체적으로 유사도 분석 서버는 특허청 데이터베이스로부터 디자인 도면 이미지에 접근할 수 있는 URL 정보를 포함하는 디자인권 정보를 검색하고, 디자인권 정보에 포함된 URL 정보를 이용해 특허청 데이터베이 스로부터 디자인 도면 이미지를 다운로드 받아 내부 저장소에 저장한다. 유사도 분석 서버는 현품 이미지와 내부 저장소에 저장된 디자인 도면 이미지 간의 유사도를 제2 인 공지능 모델을 이용해 분석한다(S40). 유사도 분석 서버는 유사도 분석 결과에 따른 출력값에 근거해 디자 인권 정보를 정렬할 수 있다. 유사도 분석 서버는 유사도 분석 결과에 근거해 현품 촬영 장치로 전송할 디자인권 정보를 출력하는 한다."}
{"patent_id": "10-2022-0189526", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상의 설명은 본 발명을 예시적으로 설명한 것에 불과하며, 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에 의해 본 발명의 기술적 사상에서 벗어나지 않는 범위에서 다양한 변형이 가능할 것이다. 따라서 본 발명의 명세서에 개시된 실시예들은 본 발명을 한정하는 것이 아니다. 본 발명의 범위는 아래의 특허 청구범위에 의해 해석되어야 하며, 그와 균등한 범위 내에 있는 모든 기술도 본 발명의 범위에 포함되는 것으로 해석해야 할 것이다."}
{"patent_id": "10-2022-0189526", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 디자인권 도면 매칭 장치의 개략적인 구성도. 도 2는 본 발명에 따른 현품 촬영 장치의 개략적인 구성도. 도 3은 본 발명에 따른 유사도 분석 서버의 개략적인 구성도. 도 4는 본 발명에 따른 디자인권 도면 매칭 처리 과정을 나타낸 도면. 도 5는 본 발명에 따른 현품 이미지를 구성하는 컬러 영상 및 깊이맵 영상의 예시를 나타내는 도면 도 6은 본 발명에 따른 품목 분석부의 내부 구성을 나타낸 도면. 도 7은 본 발명에 따른 유사도 분석부의 내부 구성을 나타낸 도면. 도 8은 본 발명에 따라 현품 촬영 장치의 디스플레이에 표시되는 디자인권 정보를 나타낸 도면. 도 9는 본 발명에 따른 물품 분류 코드에 근거해 획득한 디자인권별 URL 정보를 나타낸 도면."}
