{"patent_id": "10-2021-0086182", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0005451", "출원번호": "10-2021-0086182", "발명의 명칭": "다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 및 방법", "출원인": "동서대학교 산학협력단", "발명자": "박성환"}}
{"patent_id": "10-2021-0086182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전면이 개구되어 물품을 보관할 수 있도록 구비되는 본체와 상기 본체에 냄새 센서, 소리 센서, 카메라 및 X-RAY 검색기를 포함하는 물품 보관함;다수 개의 상기 물품 보관함을 대상으로 각각의 상기 냄새 센서와 소리 센서 중 적어도 하나로부터 감지된 감지데이터를 전송받아 기 설정된 감지 데이터와 비교한 후 물품여부 정보를 생성하고, 각각의 상기 카메라와 X-RAY검색기 중 적어도 하나로부터 촬영된 촬영본을 전송받은 후 저장하는 통합 제어부; 및상기 물품여부 정보가 생성된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는 알림을 제공하고, 관리자의입력에 따라 상기 촬영본을 표시하는 관리자 단말기;를 포함하는 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템."}
{"patent_id": "10-2021-0086182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 다수 개의 상기 물품 보관함은 행과 열을 이루며 배열되고,임의의 물품 보관함은 상하좌우로 인접한 물품 보관함에서 발생되는 소리를 차음하도록 본체의 벽체에 차음재가구비되는 것을 특징으로 하는 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템."}
{"patent_id": "10-2021-0086182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서, 상기 X-RAY 검색기는,인공지능 기술기반으로 기 저장된 물품의 형상과 상기 촬영본에 포함된 물품의 형상을 비교한 후 일치율과 물품종류 정보를 생성하고, 상기 통합 제어부에 전송하는 것을 특징으로 하는 다중 센서 기반 물품 보관함을 이용한유기 알림 시스템."}
{"patent_id": "10-2021-0086182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 통합 제어부는,상기 물품 보관함의 관리를 위한 유저 인터페이스를 제공하는 어플리케이션과 연동되고, 상기 관리자 단말기에 설치된 어플리케이션을 통해서 물품 보관함의 개방과 잠금 중 하나가 입력되면, 기 저장된 관리자 정보를 확인한 후 상기 물품 보관함을 개방 또는 잠금 하는 것을 특징으로 하는 다중 센서 기반 물품보관함을 이용한 유기 알림 시스템."}
{"patent_id": "10-2021-0086182", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "통합 제어부에 의하여, 다수 개의 물품 보관함 내 냄새 센서와 소리 센서 중 적어도 하나로부터 감지 데이터가기 설정된 감지 데이터와 비교된 후 물품여부 정보가 각각 생성되는 물품여부 정보 생성단계;관리자 단말기에 의하여, 상기 물품여부 정보가 생성된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는알림이 제공되는 알림 제공단계;상기 관리자 단말기에 의하여, 상기 물품여부 정보가 생성된 물품 보관함 내 보관된 물품의 종류를 확인하도록어플리케이션을 통해서 제어 데이터가 생성되는 제어 데이터 생성단계;상기 통합 제어부에 의하여, 상기 물품여부 정보가 생성된 물품 보관함 내 카메라와 X-RAY 검색기가공개특허 10-2023-0005451-3-활성화되고, 상기 물품여부 정보가 생성된 물품 보관함 내부가 촬영된 촬영본이 저장되는 촬영본 저장단계; 및상기 관리자 단말기에 의하여, 상기 어플리케이션을 통해서 상기 촬영본이 제공되는 촬영본 제공단계;를 포함하는 다중 센서 기반 물품 보관함을 이용한 유기 알림 방법."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 및 방법에 관한 것으로, 보다 구체적으로 전 면이 개구되어 물품을 보관할 수 있도록 구비되는 본체와 상기 본체에 냄새 센서, 소리 센서, 카메라 및 X-RAY 검색기를 포함하는 물품 보관함, 다수 개의 상기 물품 보관함을 대상으로 각각의 상기 냄새 센서와 소리 센서 중 적어도 하나로부터 감지된 감지 데이터를 전송받아 기 설정된 감지 데이터와 비교한 후 물품여부 정보를 생성하 고, 각각의 상기 카메라와 X-RAY 검색기 중 적어도 하나로부터 촬영된 촬영본을 전송받은 후 저장하는 통합 제어 부 및 상기 물품여부 정보가 생성된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는 알림을 제공하고, 관 리자의 입력에 따라 상기 촬영본을 표시하는 관리자 단말기를 포함하는 다중 센서 기반 물품 보관함을 이용한 유 기 알림 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 및 방법에 관한 것으로, 보다 구체적으로, 다수 개의 물품 보관함 중 임의의 물품 보관함에 유기된 영아, 애완동물, 버려진 음식물, 대테러 폭발물 등을 실시간으로 감지하여 물품 보관함을 관리하는 관리자의 단말기에 알림하고, 곧바로 후속조치가 이루어질 수 있 도록 하는 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 물품보관함은 일정공간으로 다수 구획되고, 구획된 각 공간에는 잠금장치가 구비된 도어를 설치하여 도난을 방지하도록 한다. 이는 학교, 기숙사, 회사, 지하철, 공공휴식처, 마트 등 공공장소에서 개인물품을 단 시간 보관하기 위한 수단으로 사용되고 있다. 또한, 근래에는 공동주택에 우편함과 별도로 물품보관함을 설치하여 택배원이 배송할 물품을 보관하도록 한다. 이는 온라인 당일 배송 또는 예약 배송 등 다양한 형태의 물류 유통과 어플리케이션이 연동된 쇼핑문화가 새로 운 생활패턴으로 자리 잡아 물품을 배송시키는 일이 빈번하지만, 배송된 물품을 받는 과정에서 주문자는 거주공 간이 노출되는 것을 꺼리거나 배달원을 마주하게 되는 상황을 원하지 않는 경우가 많고 거주자가 집을 비우는 경우도 많기 때문이다. 물품보관함의 편리함에도 불구하고, 물품보관함은 프라이버시에 따라 물품을 보관한 사람이 해당 물품을 찾지 않는 이상 물품보관함 내 물품을 간섭하거나 관리하지 않는다는 점을 이용하여 악용되는 사례가 종종 발생하고 있다. 예컨대, 공공장소에 설치된 물품보관함에 폭발물을 설치하거나, 영아의 시신을 유기하거나, 살아있는 애 완동물을 키울 수 없다는 이유로 유기한다. 관련문헌 1은 장바구니 배달물품분실을 방지한 물품보관함 패킹시스템에 관한 것으로, 상온보관물과 냉장보관물 이 함께 배달되어 보관될 때 보관자가 보관장소인 상온보관함과 냉장보관함을 인접하게 설정하여 미수령하는 것 을 방지할 수 있으나, 물품보관함은 물품을 찾는 것을 목적으로 하는 것이 아닌 은폐 및 유기의 목적으로 사용 하게 되면 보관되어 있는 물품이 방치되게 되는데 시간이 지날수록 일부 물품보관함을 사용할 수 없게 되거나 악취 등이 발생할 경우 실 사용자들에게 불편함과 불쾌함을 줄 수 있으므로, 이를 실시간으로 관리할 수 있는 장치 및 시스템이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-1912601"}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위한 것으로 다수 개의 물품 보관함을 모두 확인해 볼 필요가 없이 전송된 번호의 물품 보관함만을 개방하여 신속하고 효율적인 후속조치를 진행할 수 있도록 다수 개의 상기 물품 보관함을 대상으로 각각의 상기 냄새 센서와 소리 센서 중 적어도 하나로부터 감지된 감지 데이터를 전송받아 기 설정된 감지 데이터와 비교한 후 물품여부 정보를 생성하고, 각각의 상기 카메라와 X-RAY 검색기 중 적어도 하나로부터 촬영된 촬영본을 관리자 단말기에 제공하는 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 및 방법을 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템은 전면이 개 구되어 물품을 보관할 수 있도록 구비되는 본체와 상기 본체에 냄새 센서, 소리 센서, 카메라 및 X-RAY 검색기 를 포함하는 물품 보관함; 다수 개의 상기 물품 보관함을 대상으로 각각의 상기 냄새 센서와 소리 센서 중 적어 도 하나로부터 감지된 감지 데이터를 전송받아 기 설정된 감지 데이터와 비교한 후 물품여부 정보를 생성하고, 각각의 상기 카메라와 X-RAY 검색기 중 적어도 하나로부터 촬영된 촬영본을 전송받은 후 저장하는 통합 제어부; 및 상기 물품여부 정보가 생성된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는 알림을 제공하고, 관리 자의 입력에 따라 상기 촬영본을 표시하는 관리자 단말기;를 제공한다. 상기 목적을 달성하기 위하여, 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 방법은 통합 제어부 에 의하여, 다수 개의 물품 보관함 내 냄새 센서와 소리 센서 중 적어도 하나로부터 감지 데이터가 기 설정된 감지 데이터와 비교된 후 물품여부 정보가 각각 생성되는 물품여부 정보 생성단계; 관리자 단말기에 의하여, 상 기 물품여부 정보가 생성된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는 알림이 제공되는 알림 제공단 계; 상기 관리자 단말기에 의하여, 상기 물품여부 정보가 생성된 물품 보관함 내 보관된 물품의 종류를 확인하 도록 어플리케이션을 통해서 제어 데이터가 생성되는 제어 데이터 생성단계; 상기 통합 제어부에 의하여, 상기 물품여부 정보가 생성된 물품 보관함 내 카메라와 X-RAY 검색기가 활성화되고, 상기 물품여부 정보가 생성된 물 품 보관함 내부가 촬영된 촬영본이 저장되는 촬영본 저장단계; 및 상기 관리자 단말기에 의하여, 상기 어플리케 이션을 통해서 상기 촬영본이 제공되는 촬영본 제공단계;를 제공한다."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이상과 같이 본 발명에 의하면 다수 개의 상기 물품 보관함을 대상으로 각각의 상기 냄새 센서와 소리 센서 중 적어도 하나로부터 감지된 감지 데이터를 전송받아 기 설정된 감지 데이터와 비교한 후 물품여부 정보를 생성하 고, 각각의 상기 카메라와 X-RAY 검색기 중 적어도 하나로부터 촬영된 촬영본을 관리자 단말기에 제공함으로써, 다수 개의 물품 보관함을 모두 확인해 볼 필요가 없이 전송된 번호의 물품 보관함만을 개방하여 신속하고 효율 적인 후속조치를 진행할 수 있고, 타 사용자의 프라이버시가 보호될 수 있는 효과가 있다. 또한, 물품 보관함을 개방하여 직접 해당 물품을 확인하기 전에 미리 해당 물품의 종류를 파악하여 신중하게 해 당 물품을 처리할 수 있도록 하는 현저한 효과가 있다."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서에서 사용되는 용어는 본 발명에서의 기능을 고려하면서 가능한 현재 널리 사용되는 일반적인 용어들 을 선택하였으나, 이는 당 분야에 종사하는 기술자의 의도 또는 판례, 새로운 기술의 출현 등에 따라 달라질 수 있다. 또한, 특정한 경우는 출원인이 임의로 선정한 용어도 있으며, 이 경우 해당되는 발명의 설명 부분에서 상 세히 그 의미를 기재할 것이다. 따라서 본 발명에서 사용되는 용어는 단순한 용어의 명칭이 아닌, 그 용어가 가 지는 의미와 본 발명의 전반에 걸친 내용을 토대로 정의되어야 한다. 다르게 정의되지 않는 한 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속 하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일반 적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의 미로 해석되지 않는다. 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템 구성도이다. 도 2는 본 발명의 일실시예에 따른 다수 개의 물품 보관함과 통합 제어부를 표시한 도면이다. 도 1을 보면, 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템은 물품 보관함, 통합 제 어부 및 관리자 단말기를 포함한다. 보다 구체적으로, 상기 물품 보관함은 전면이 개구되어 물품을 보관할 수 있도록 구비되는 본체와 상 기 본체에 냄새 센서, 소리 센서, 카메라 및 X-RAY 검색기를 포함한다. 여기서, 상 기 카메라는 가장 바람직하게, 상기 본체 내부의 상면, 하면, 측면을 모두 빠짐없이 촬영할 수 있도 록 본체의 개구된 전면 상단 모서리에 설치되는 것이 가장 바람직하다. 상기 물품은 음식물, 유아, 애완동물, 폭발물을 포함할 수 있다. 상기 냄새 센서는 음식물 또는 사체가 부패되거나 물품이 폭발되면서 발생하는 휘발성유기화합물(VOCs), 암모니아(NH3), 황화수소(H2S) 중 적어도 하나를 감지할 수 있다. 또한, 상기 소리 센서는 살아있는 유아 또는 애완동물의 울음소리를 감지하기 위한 것으로 100Hz 내지 10,000Hz 범위 이내의 소리를 감지할 수 있다. 그리고 해당 소리에 대한 진폭, 주파수, 위상이 모두 추출될 수 있다. 여기서, 다수 개의 상기 물품 보관함은 행과 열을 이루며 배열될 수 있는데, 각각의 물품 보관함 내 소리 센서가 구비되므로 소리의 간섭이 발생되거나 노이즈가 함께 감지될 수 있다. 즉, 임의의 물품 보관 함(100a)은 상하좌우로 인접한 물품 보관함(100b, 100c)에서 발생되는 소리를 차음하도록 상기 본체의 내 부 벽체에 차음재가 각각 구비될 수 있다. 상기 차음재는 외부 및 인접한 물품 보관함(100b, 100c)에 서 발생되는 소리를 차음할 뿐만 아니라 암막 역할을 동시에 하여 상기 카메라와 X-RAY 검색기가 물 품을 촬영하기 용이한 환경을 만들 수 있는 효과가 있다. 또한, 상기 카메라는 가장 바람직하게 적외선 카메라일 수 있다. 상기 도어에 의하여 상기 본체(11 0)가 폐쇄되면 상기 본체 내부는 어둡고, 상기 본체와 도어 사이의 미세한 틈 사이로 약간의 빛 이 유입되는 정도이기 때문에, 어두운 공간에서도 물체를 촬영할 수 있는 적외선 카메라를 사용할 수 있다. 또한, 상기 X-RAY 검색기는 가장 바람직하게 160/80 keV의 듀얼에너지로 물품을 촬영하며 수직과 수평으로 양방향 촬영본을 획득할 수 있고, 상기 촬영본은 RGB 기반으로 표시될 수 있다. 그리고 상기 X-RAY 검색기(15 0)는 인공지능 기술기반으로 기 저장된 물품의 형상과 상기 촬영본에 포함된 물품의 형상을 비교한 후 일치율과 물품종류 정보를 생성하고, 상기 통합 제어부에 전송할 수 있다. 예컨대, 상기 X-RAY 검색기는 ‘개 68%’와 같이 상기 일치율과 물품종류 정보를 생성할 수 있다. 상기 X-RAY 검색기는 상기 별도의 업데이트 를 통해서 기 저장된 물품의 형상을 추가할 수 있고, 새로운 물품의 종류를 추가할 수 있다. 도 2를 보면, 상기 물품 보관함은 다수 개가 구비될 수 있고, 행과 열을 이루며 배열될 수 있다. 그리고 상기 물품 보관함 각각은 세로와 가로 길이가 상이할 수 있지만, 설치공간의 일측면에 부착될 수 있도록 폭은 동일할 수 있다. 한편, 상기 물품 보관함은 전면에 개구된 부분을 개폐하기 위하여 상기 본체의 일측에 잠금장치(16 1)가 구비된 도어가 구비될 수 있다. 상기 잠금장치는 상기 통합 제어부와 전기적으로 연결되고, 상기 통합 제어부 또는 상기 통합 제어부와 연동된 어플리케이션을 통해서 제어될 수 있다. 다음으로, 상기 통합 제어부는 다수 개의 상기 물품 보관함을 대상으로 각각의 상기 냄새 센서 와 소리 센서 중 적어도 하나로부터 감지된 감지 데이터를 전송받아 기 설정된 감지 데이터와 비교한 후 물품여부 정보를 생성하고, 각각의 상기 카메라와 X-RAY 검색기 중 적어도 하나로부터 촬영된 촬영본 을 전송받은 후 저장한다. 우선, 상기 통합 제어부는 다수 개의 상기 물품 보관함의 상기 냄새 센서와 소리 센서 중 적어도 하나로부터 감지된 감지 데이터를 각각 실시간 또는 기 설정된 시간간격마다 전송받을 수 있다. 상기 물품여부 정보를 생성하는데 있어서, 상기 통합 제어부는 전자코 원리를 이용하여 냄새 센서의 감지 데이터로부터 상기 물품여부 정보를 생성할 수 있다. 예컨대, 상기 통합 제어부는 휘발성유기화합물 (VOCs)을 특정 성분으로 선정하고, 상기 특정 성분을 기초로 판별함수를 생성하여 DFA(Discriminant FactorialAnalysis; DFA) 모델을 생성할 수 있다. 그리고 상기 DFA 모델상의 상기 특정 성분의 분포양상이 기 저장된 음 식물 또는 사체의 부패 냄새, 폭발물의 화약 냄새에서의 상기 특정 성분의 분포양상과 오차범위 이내로 유사하 다면 상기 물품 보관함 내부에 일반적인 물품이 아닌 의심스러운 물품이 있다는 상기 물품여부 정보를 생 성할 수 있다. 또한, 상기 통합 제어부는 소리의 진폭, 주파수, 위상이 모두 기 설정된 진폭, 주파수, 위상 이상일 경우 상기 물품여부 정보를 생성할 수 있다. 다만, 상기 통합 제어부는 상기 관리자 단말기의 어플리케이션으로부터 생성된 제어 데이터가 전송될 경우에만 상기 카메라와 X-RAY 검색기를 활성화 시킬 수 있다. 이는, 물품 보관함에 보관하는 사용자의 프라이버시를 보호하기 위함이다. 따라서 상기 통합 제어부는 상기 물품여부 정보가 생성된 물품 보관함을 대상으로 촬영이 가능하도록 할 수 있다. 또한, 상기 통합 제어부는 물품여부 정보가 생성된 물품 보관함의 번호를 상기 물품여부 정보와 함께 상기 관리자 단말기에 전송할 수 있다. 따라서 관리자는 다수 개의 물품 보관함을 모두 확인해 볼 필 요가 없이 전송된 번호의 물품 보관함만을 개방하여 신속하고 효율적인 후속조치를 진행할 수 있고, 타 사 용자의 프라이버시가 보호될 수 있도록 하는 현저한 효과가 있다. 다음으로, 상기 관리자 단말기는 상기 물품여부 정보가 생성된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는 알림을 제공하고, 관리자의 입력에 따라 상기 촬영본을 표시할 수 있다. 상기 알림은 단순 알림음일 수 있고, 상기 관리자 단말기에 설치된 어플리케이션의 메시지 알림일 수 있고, 상기 소리 센서로부터 감지된 소리의 진폭, 주파수, 위상과 동일한 알림이 제공될 수 있다. 본원발 명에서 알림의 형태는 특정한 방법에 한정되지 않는다. 여기서, 상기 통합 제어부는, 상기 물품 보관함의 관리를 위한 유저 인터페이스를 제공하는 어플리케 이션과 연동되고, 상기 관리자 단말기에 설치된 어플리케이션을 통해서 물품 보관함의 개방과 잠금 중 하나가 입력되면, 기 저장된 관리자 정보를 확인한 후 상기 물품 보관함을 개방 또는 잠금 할 수 있다. 이는, 정상적인 경우에는 상기 물품 보관함을 사용하고자 하는 사용자만이 해당 물품 보관함을 개폐 할 수 있도록 하나, 상기 관리자 단말기를 통해서 음식물, 유아, 애완동물, 폭발물 등 비정상적인 물품이 보관되어 있는 것으로 확인된 경우에는 관리자가 신속한 후속조치를 취해야함으로 별도의 권한을 부여하는 것이다. 다중 센서 기반 물품 보관함을 이용한 유기 알림 방법 이하, 본 발명에 따른 실시예를 첨부한 도면을 참조하여 상세히 설명하기로 한다. 도 3은 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 방법 흐름도이다. 도 3을 보면, 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 방법은 물품여부 정보 생성단계 (S100), 알림 제공단계(S200), 제어 데이터 생성단계(S300), 촬영본 저장단계(S400) 및 촬영본 제공단계(S500) 를 포함한다. 보다 구체적으로, 상기 물품여부 정보 생성단계(S100)는 통합 제어부에 의하여, 다수 개의 물품 보관함 내 냄새 센서와 소리 센서 중 적어도 하나로부터 감지 데이터가 기 설정된 감지 데이터와 비교 된 후 물품여부 정보가 각각 생성될 수 있다. 상기 냄새 센서는 음식물 또는 사체가 부패되거나 물품이 폭발되면서 발생하는 휘발성유기화합물(VOCs), 암모니아(NH3), 황화수소(H2S) 중 적어도 하나를 감지할 수 있다. 그리고 가장 바람직하게, 상기 물품여부 정보 생성단계(S100)는 전자코 원리를 이용하여 냄새 센서의 감지 데이터로부터 상기 물품여부 정보가 생성될 수 있다. 예컨대, 상기 물품여부 정보 생성단계(S100)는 휘발성유기화합물(VOCs)이 특정 성분으로 선정되고, 상기 특정 성분을 기초로 판별함수가 생성되어 DFA(Discriminant Factorial Analysis; DFA) 모델이 생성될 수 있다. 그리 고 상기 DFA 모델상의 상기 특정 성분의 분포양상이 기 저장된 음식물 또는 사체의 부패 냄새, 폭발물의 화약 냄새에서의 상기 특정 성분의 분포양상과 오차범위 이내로 유사하다면 상기 물품 보관함 내부에 일반적인물품이 아닌 의심스러운 물품이 있다는 상기 물품여부 정보가 생성될 수 있다. 또한, 상기 소리 센서는 살아있는 유아 또는 애완동물의 울음소리를 감지하기 위한 것으로 100Hz 내지 10,000Hz 범위 이내의 소리를 감지할 수 있다. 그리고 가장 바람직하게, 상기 물품여부 정보 생성단계(S100)는 소리의 진폭, 주파수, 위상이 모두 기 설정된 진폭, 주파수, 위상 이상일 경우 상기 물품여부 정보가 생성될 수 있다. 상기 물품여부 정보 생성단계(S100)는 모든 물품 보관함에 대해서 실시간 또는 기 설정된 시간간격마다 감 지된 감지 데이터를 기반으로 물품여부 정보를 생성하여 상기 통합 제어부에 전송할 수 있다. 다음으로, 상기 알림 제공단계(S200)는 관리자 단말기에 의하여, 상기 물품여부 정보가 생성된 물품 보관 함의 번호와 상기 물품여부 정보를 포함하는 알림이 제공된다. 즉, 상기 알림 제공단계(S200)는 상기 물품여부 정보 생성단계(S100)로부터 임의의 물품 보관함에서 상기 물품여부 정보가 생성됨에 따라 전송된 물품 보관함의 번호와 상기 물품여부 정보를 포함하는 알림이 제공 될 수 있다. 상기 알림은 단순 알림음일 수 있고, 상기 관리자 단말기에 설치된 어플리케이션의 메시지 알 림일 수 있고, 상기 소리 센서로부터 감지된 소리의 진폭, 주파수, 위상과 동일한 알림이 제공될 수 있다. 본원발명에서 알림의 형태는 특정한 방법에 한정되지 않는다. 다음으로, 상기 제어 데이터 생성단계(S300)는 상기 관리자 단말기에 의하여, 상기 물품여부 정보가 생성 된 물품 보관함 내 보관된 물품의 종류를 확인하도록 어플리케이션을 통해서 제어 데이터가 생성된다. 즉, 관리자는 상기 알림 제공단계(S200)로부터 해당 물품 보관함의 물품여부를 인지할 수 있다. 이때. 관 리자가 곧바로 물품 보관함에 접근할 수 있다면 별도의 상기 제어 데이터 생성단계(S300)를 거치지 않을 수 있다. 그러나 부득이한 상황으로 곧바로 물품 보관함에 접근할 수 없거나 상기 도어를 열면 폭발 물이 폭발할 수 있도록 설치될 수도 있으므로 신중하게 처리하기 위해서 상기 제어 데이터 생성단계(S300)가 진 행될 수 있다. 여기서, 상기 제어 데이터는 상기 물품여부 정보가 생성된 물품 보관함 내 카메라와 X-RAY 검색기 를 활성화하라는 명령일 수 있다. 다음으로, 상기 촬영본 저장단계(S400)는 상기 통합 제어부에 의하여, 상기 물품여부 정보가 생성된 물품 보관함 내 카메라와 X-RAY 검색기가 활성화되고, 상기 물품여부 정보가 생성된 물품 보관함 내부가 촬영된 촬영본이 저장된다. 이는, 물품 보관함에 보관하는 타 사용자의 프라이버시를 보호하기 위함이다. 즉, 상기 촬영본 저장단계 (S400)는 상기 물품여부 정보가 생성된 물품 보관함 및 상기 제어 데이터가 생성된 물품 보관함을 대 상으로 촬영이 가능하도록 할 수 있다. 여기서, 상기 촬영본은 상기 카메라가 적외선으로 물품을 촬영한 촬영본일 수 있고, 상기 X-RAY 검색기 가 160/80 keV의 듀얼에너지로 물품을 촬영하며 수직과 수평으로 양방향으로 촬영된 RGB 기반 촬영본일 수 있다. 한편, 상기 촬영본 저장단계(S400)는 상기 X-RAY 검색기로부터 인공지능 기술기반으로 기 저장된 물 품의 형상과 상기 촬영본에 포함된 물품의 형상을 비교한 후 일치율과 물품종류 정보가 함께 저장될 수 있다. 다음으로, 상기 촬영본 제공단계(S500)는 상기 관리자 단말기에 의하여, 상기 어플리케이션을 통해서 상기 촬영본이 제공된다. 즉, 상기 촬영본 제공단계(S500)는 물품의 적외선기반으로 촬영된 쵤영본, X-RAY 기반으로 형상이 촬영된 촬영본, 및 일치율과 물품종류 정보가 어플리케이션을 통해서 제공될 수 있다. 따라서 본 발명에 의하면 관리자는 다수 개의 물품 보관함을 모두 확인해 볼 필요가 없이 전송된 번호의 물품 보관함만을 개방하여 신속하고 효율적인 후속조치를 진행할 수 있고, 타 사용자의 프라이버시가 보호 될 수 있도록 하는 현저한 효과가 있다. 또한, 물품 보관함을 개방하여 직접 해당 물품을 확인하기 전에 미리 해당 물품의 종류를 파악하여 신중하 게 해당 물품을 처리할 수 있도록 하는 현저한 효과가 있다."}
{"patent_id": "10-2021-0086182", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 으로 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2021-0086182", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 시스템에 구성도이다. 도 2는 본 발명의 일실시예에 따른 다수 개의 물품 보관함과 통합 제어부를 표시한 도면이다. 도 3은 본 발명의 다중 센서 기반 물품 보관함을 이용한 유기 알림 방법 흐름도이다."}
