{"patent_id": "20-2020-0004468", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "20-2022-0001373", "출원번호": "20-2020-0004468", "출원인": "주식회사 토이트론"}}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "주행 방향을 변경하면서 감지된 문양을 그릴 수 있는 코딩 로봇본체;상기 코딩 로봇본체에 구비되며 문양을 그리는 펜부재; 및 상기 코딩 로봇본체에 상기 코딩 로봇본체가 그릴 수 있는 문양을 입력하는 문양 입력부를 포함하는 것을 특징으로 하는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 코딩 로봇본체에는 상기 펜부재가 결합되는 펜 결합구멍이 위치되어 상기 펜 결합구멍 내에 상기 펜부재가삽입되어 상기 펜부재의 펜이 상기 코딩 로봇본체의 하부면으로 돌출되는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "에 있어서, 상기 코딩 제어부는,상기 문양 감지부에서 감지되는 문양을 하나만 도시하는 일반 문양 그림모드; 및 상기 문양 감지부에서 감지되는 문양을 코딩 로봇본체가 기설정된 각도로 회전하면서 해당 문양을 복수로 도시하는 연속 문양 그림모드를 포함하고, 상기 일반 문양 그림모드, 상기 연속 문양 그림모드 중 하나의 작동 모드를 선택하여 작동시키는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 문양 감지부는 색상을 감지할 수 있는 색상 센서부이고, 상기 문양 입력부는 해당 문양에 대응되는 색상을상기 문양 감지부로 감지시킴으로써 코딩 로봇본체에 그리게 되는 문양을 입력하는 문양 그리기가 가능한 코딩교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 상기 문양 입력부는 서로 다른 색상을 가져 상기 코딩 로봇본체가 그릴 수 있는 서로 다른 문양을 입력하는 복수의 문양 입력 카드를 포함하는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 4에 있어서, 상기 문양 입력부는 보드 상에 문양을 입력할 수 있는 서로 다른 색상의 복수의 문양 입력용 색상 패턴이 도시된 문양 입력 보드인 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 3에 있어서, 상기 코딩 로봇본체에는 문양 감지부에서 문양이 감지될 때 해당 문양을 음성으로 출력하는 스피커부가 구비된문양 그리기가 가능한 코딩 교육장치.공개실용신안 20-2022-0001373-3-청구항 8"}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서, 상기 연속 문양 그림모드는 상기 코딩 로봇본체를 시작 지점에서 시작해서 시작 지점에서 그림이 마무리되면서하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로 회전되어 문양을 도시하되, 시작 지점에서시작하여 다시 시작지점에서 마무리되도록 문양을 도시하는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 8에 있어서, 상기 코딩 제어부는 문양 감지부를 통해 복수의 문양을 순서대로 입력시키고, 입력된 복수의 문양을 코딩 로봇본체가 기설정된 각도로 회전하면서 순서대로 도시하는 코딩 연속 그림모드를 더 포함하고, 상기 일반 문양 그림모드, 상기 연속 문양 그림모드, 상기 코딩 연속 그림모드 중 하나의 작동 모드를 선택하여작동시키는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 10에 있어서, 상기 연속 문양 그림모드와 상기 코딩 연속 그림모드는 상기 코딩 로봇본체를 시작 지점에서 시작해서 시작 지점에서 그림이 마무리되면서 하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로 회전되어 문양을 도시하되, 시작 지점에서 시작하여 다시 시작지점에서 마무리되도록 문양을 도시하는 문양 그리기가 가능한코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 8 또는 청구항 10에 있어서, 상기 코딩 제어부는 상기 코딩 로봇본체의 작동 모드를 선택할 수 있는 작동 스위치를 포함하는 것을 특징으로하는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서, 상기 작동 스위치는 상기 코딩 로봇본체의 하부면으로 돌출되는 누름식 버튼 스위치로 코딩 로봇본체의 윗부분을 누르면 눌려져 조작되는 문양 그리기가 가능한 코딩 교육장치."}
{"patent_id": "20-2020-0004468", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서, 상기 코딩 제어부는 상기 코딩 로봇본체의 작동 모드를 표시할 수 있는 작동 표시램프가 위치되고, 복수의 작동모드에서 각각 다른 색상의 빛을 발생시켜 각각 다른 작동 모드를 표시하는 문양 그리기가 가능한 코딩 교육장치.고안의 설명공개실용신안 20-2022-0001373-4-기 술 분 야본 고안은 문양 그리기가 가능한 코딩 교육장치에 관한 것으로 더 상세하게는 문양의 코딩을 통해 코딩 로봇본 [0001]체에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 초등학교 저학년의 아동이 쉽게 이해할 수 있도록한 문양 그리기가 가능한 코딩 교육장치에 관한 고안이다.배 경 기 술일반적으로 코딩은 컴퓨터 프로그래밍 즉, 주어진 명령을 컴퓨터가 이해할 수 있는 언어로 입력하는 것을 의미 [0002]하는 것으로, C언어, 자바, 파이선 등의 컴퓨터 언어로 프로그램을 만드는 것을 말한다.코딩 교육은 논리력, 창의력 문제 해결력을 키울 수 있어 근래에 들어 중요성이 크게 증가하고 있다. [0003]그리고, 코딩은 인공지능, 사물인터넷, 지능형 로봇, 빅 데이터 분석 및 활용 등 4차 산업혁명시대를 대변하는 [0004]것들이 ICT(정보통신기술)을 바탕으로 한 소프트웨어를 통해 구현되기 때문에 그 중요성이 더 증가하고 있다.코딩 교육은 퍼즐이나 블록 맞추기 등의 게임 방식으로 유치원 또는 초등학교 학생들을 대상으로 기초적인 프로 [0005]그램의 원리를 이해할 수 있도록 접근되고 있다.그러나, 퍼즐이나 블록 맞추기 등의 게임 방식은 입력과 입력에 따른 프로그램의 변화를 정확하게 표현할 수 없 [0006]어 코딩의 원리를 교육하는데 한계가 있었다. 또한, 퍼즐이나 블록 맞추기 등의 게임 방식은 유치원 또는 초등학교 저학년이 쉽고 간편하게 접근하는데 어려 [0007]움이 있어 코딩에 대한 기초를 쉽게 이해시키는데 있어 어려움이 있었다.선행기술문헌특허문헌(특허문헌 0001) 국내특허등록 제1683022호 '코딩 학습용 교구'(2016년 11월 30일 등록) [0008]고안의 내용해결하려는 과제본 고안의 목적은 문양의 코딩을 통해 코딩 로봇본체에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 [0009]초등학교 저학년의 아동이 쉽게 이해할 수 있도록 한 문양 그리기가 가능한 코딩 교육장치를 제공하는 데 있다.본 고안의 다른 목적은 사용자가 카드, 보드 등을 이용하여 문양 그리기를 실행하는 문양 그리기 코딩모드, 연 [0010]속 문양 그리기 코딩모드 등의 다양한 모드를 선택해서 사용할 수 있어 유치원 또는 초등학교 저학년의 아동에게 코딩 학습에 대한 흥미를 유발할 수 있는 문양 그리기가 가능한 코딩 교육장치를 제공하는 데 있다.과제의 해결 수단상기와 같은 목적을 달성하기 위하여 본 고안은 주행 방향을 변경하면서 감지된 문양을 그릴 수 있는 코딩 로봇 [0011]본체, 상기 코딩 로봇본체에 구비되며 문양을 그리는 펜부재, 상기 코딩 로봇본체에 상기 코딩 로봇본체가 그릴수 있는 문양을 입력하는 문양 입력부를 포함하는 것을 특징으로 하는 문양 그리기가 가능한 코딩 교육장치를제공하는 데 있다.본 고안에서 상기 코딩 로봇본체에는 상기 펜부재가 결합되는 펜 결합구멍이 위치되어 상기 펜 결합구멍 내에 [0012]상기 펜부재가 삽입되어 상기 펜부재의 펜이 상기 코딩 로봇본체의 하부면으로 돌출될 수 있다. 본 고안에서 상기 코딩 로봇본체는 주행바퀴를 포함하는 로봇 주행부, 상기 문양 입력부에 의해 입력되는 문양 [0013]정보를 감지할 수 있는 문양 감지부 및 상기 문양 감지부에서 감지된 문양을 그릴 수 있도록 상기 로봇 주행부의 작동을 제어하는 코딩 제어부를 포함할 수 있다. 본 고안에서 상기 문양 감지부는 색상을 감지할 수 있는 색상 센서부이고, 상기 문양 입력부는 해당 문양에 대 [0014]응되는 색상을 상기 문양 감지부로 감지시킴으로써 코딩 로봇본체에 그리게 되는 문양을 입력할 수 있다. 공개실용신안 20-2022-0001373-5-본 고안에서 상기 문양 입력부는 서로 다른 색상을 가져 상기 코딩 로봇본체가 그릴 수 있는 서로 다른 문양을 [0015]입력하는 복수의 문양 입력 카드를 포함할 수 있다. 본 고안에서 상기 문양 입력부는 보드 상에 문양을 입력할 수 있는 서로 다른 색상의 복수의 문양 입력용 색상 [0016]패턴이 도시된 문양 입력 보드일 수 있다. 본 고안에서 상기 코딩 로봇본체에는 문양 감지부에서 문양이 감지될 때 해당 문양을 음성으로 출력하는 스피커 [0017]부가 구비될 수 있다. 본 고안에서 상기 코딩 제어부는 상기 문양 감지부에서 감지되는 문양을 하나만 도시하는 일반 문양 그림모드 [0018]및 상기 문양 감지부에서 감지되는 문양을 코딩 로봇본체가 기설정된 각도로 회전하면서 해당 문양을 복수로 도시하는 연속 문양 그림모드를 포함하고, 상기 일반 문양 그림모드, 상기 연속 문양 그림모드 중 하나의 작동 모드를 선택하여 작동시킬 수 있다. 본 고안에서 상기 연속 문양 그림모드는 상기 코딩 로봇본체를 시작 지점에서 시작해서 시작 지점에서 그림이 [0019]마무리되면서 하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로 회전되어 문양을 도시하되,시작 지점에서 시작하여 다시 시작지점에서 마무리되도록 문양을 도시할 수 있다. 본 고안에서 상기 코딩 제어부는 문양 감지부를 통해 복수의 문양을 순서대로 입력시키고, 입력된 복수의 문양 [0020]을 코딩 로봇본체가 기설정된 각도로 회전하면서 순서대로 도시하는 코딩 연속 그림모드를 더 포함하고, 상기일반 문양 그림모드, 상기 연속 문양 그림모드, 상기 코딩 연속 그림모드 중 하나의 작동 모드를 선택하여 작동시킬 수 있다. 본 고안에서 상기 연속 문양 그림모드와 상기 코딩 연속 그림모드는 상기 코딩 로봇본체를 시작 지점에서 시작 [0021]해서 시작 지점에서 그림이 마무리되면서 하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로회전되어 문양을 도시하되, 시작 지점에서 시작하여 다시 시작지점에서 마무리되도록 문양을 도시할 수 있다. 본 고안에서 상기 코딩 제어부는 상기 코딩 로봇본체의 작동 모드를 선택할 수 있는 작동 스위치를 포함할 수 [0022]있다. 본 고안에서 상기 작동 스위치는 상기 코딩 로봇본체의 하부면으로 돌출되는 누름식 버튼 스위치로 코딩 로봇본 [0023]체의 윗부분을 누르면 눌려져 조작될 수 있다. 본 고안에서 상기 코딩 제어부는 상기 코딩 로봇본체의 작동 모드를 표시할 수 있는 작동 표시램프가 위치되고, [0024]복수의 작동 모드에서 각각 다른 색상의 빛을 발생시켜 각각 다른 작동 모드를 표시할 수 있다. 고안의 효과본 고안은 문양의 코딩을 통해 코딩 로봇본체에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 초등학교 [0025]저학년의 아동이 쉽게 이해할 수 있어 코딩 학습 효과를 향상시키는 효과가 있다. 본 고안의 다른 목적은 사용자가 카드, 보드 등을 이용하여 문양 그리기를 실행하는 문양 그리기 코딩모드, 연 [0026]속 문양 그리기 코딩모드 등의 다양한 모드를 선택해서 사용할 수 있어 유치원 또는 초등학교 저학년의 아동에게 코딩 학습에 대한 흥미를 유발함으로써 코딩 학습에 대한 접근성을 증대시키며, 다양한 코딩 학습이 가능하여 코딩에 대한 이해와 접근을 쉽게 하도록 하고 코딩 학습 효과를 더 향상시키는 효과가 있다. 도면의 간단한 설명도 1은 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치의 일 실시예를 도시한 도면. [0027]도 2는 본 고안에 따른 음악 연주 코딩을 이용한 코딩 교육장치에서 코딩 로봇본체의 일 실시예를 도시한 도면.도 3은 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치로 도시될 수 있는 문양의 일 실시예를 도시한도면. 도 4는 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치로 도시된 문양의 다른 실시예를 도시한 도면. 도 5는 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치로 도시된 문양또 다른 실시예를 도시한 도면. 고안을 실시하기 위한 구체적인 내용공개실용신안 20-2022-0001373-6-본 고안을 더욱 상세히 설명한다. [0028]본 고안의 바람직한 실시 예를 첨부된 도면에 의하여 상세히 설명하면 다음과 같다. 본 고안의 상세한 설명에 [0029]앞서, 이하에서 설명되는 본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정해서 해석되어서는 아니된다. 따라서, 본 명세서에 기재된 실시예와 도면에 도시된 구성은 본 고안의 가장 바람직한 일실시예에 불과할 뿐이고 본 고안의 기술적 사상을 모두 대변하는 것은 아니므로, 본 출원시점에 있어서 이들을 대체할 수 있는 다양한 균등물과 변형예들이 있을 수 있음을 이해하여야 한다.도 1은 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치의 일 실시예를 도시한 도면이고, 도 2는 본 고안에 [0030]따른 음악 연주 코딩을 이용한 코딩 교육장치에서 코딩 로봇본체(100)의 일 실시예를 도시한 도면이다.더 상세하게, 도 2의 (a)는 코딩 로봇본체(100)의 정면도이고, 도 2의 (b)는 코딩 로봇본체(100)의 배면도이고, [0031]도 2의 (c)는 코딩 로봇본체(100)의 저면도이며, 도 3은 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치로도시될 수 있는 문양의 일 실시예를 도시한 도면이다. 도 1 및 도 2를 참고하면 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치의 일 실시예는 주행 방향을 변경 [0032]하면서 감지된 문양을 그릴 수 있는 코딩 로봇본체(100)를 포함한다. 코딩 로봇본체(100)는 로봇본체 하우징(101)과 로봇본체 하우징(101)의 하부면에 돌출되게 위치되어 로봇본체 [0033]하우징(101)을 주행시키는 주행바퀴(102a)를 포함하는 로봇 주행부(102)를 포함할 수 있다.로봇본체 하우징(101)은 동물을 이용한 캐릭터로 형성되는 것을 일 예로 하고, 이외에도 자동차 형상, 로봇 캐 [0034]릭터 형상 등 아이들의 흥미를 유발할 수 있는 다양한 형상으로 형성될 수 있음을 밝혀둔다. 로봇 주행부(102)는 도시되지 않았지만 주행바퀴(102a)를 회전시키는 모터를 포함하고, 주행바퀴(102a)의 방향 [0035]을 변경하여 코딩 로봇본체(100)의 주행 방향을 변경할 수 있다.로봇 주행부(102)는 공지의 완구에서 주행 방향을 변경하여 주행하는 공지의 주행 구조를 이용해서 다양하게 변 [0036]형되어 실시될 수 있는 바 더 상세한 설명은 생략함을 밝혀둔다.로봇 주행부(102)는 코딩 로봇본체(100) 내에 위치되는 코딩 제어부에 의해 작동이 제어된다. [0037]코딩 로봇본체(100)는 문양 입력부(200)에 의해 입력되는 문양 정보를 감지할 수 있는 문양 감지부(110), 문양 [0038]감지부(110)에서 감지된 문양을 그릴 수 있도록 로봇 주행부(102)의 작동을 제어하는 코딩 제어부(미도시)를 포함한다. 주행바퀴(102a)는 로봇본체 하우징(101)의 하부로 돌출되게 위치되어 로봇본체 하우징(101)을 코딩 로봇본체 [0039](100)가 올려지는 바닥면과 이격되게 위치시켜 바닥면과 로봇본체 하우징(101)의 사이로 코딩 로봇본체(100)에문양을 입력할 수 있는 문양 입력부(200)를 삽입시켜 문양 감지부(110)로 문양 입력부(200)의 문양을 용이하게감지할 수 있다. 문양 입력부(200)는 코딩 로봇본체(100)에 코딩 로봇본체(100)가 그릴 수 있는 문양을 입력하는 것으로 카드, [0040]보드 등의 형태로 제작된 것을 일 예로 하고, 본 고안에서는 서로 다른 문양을 입력시킬 수 있는 문양 입력 카드(210)인 것을 일 예로 한다.또한, 문양 감지부(110)는 색상을 감지할 수 있는 색상 센서부이고, 문양 입력부(200)는 해당 문양에 대응되는 [0041]색상을 문양 감지부(110)로 감지시킴으로써 코딩 로봇본체(100)에 그리게 되는 문양을 입력하는 것을 일 예로한다.그리고, 복수의 문양 입력 카드(210)는 서로 다른 색상을 가져 코딩 로봇본체(100)가 그릴 수 있는 서로 다른 [0042]문양을 입력할 수 있다. 문양 감지부(110)는 문양 입력 카드(210)의 색상을 감지하여 해당 문양 입력 카드(210)에 도시된 문양을 감지하 [0043]도록 한다.즉, 코딩 제어부는 문양 감지부(110)에서 감지된 색상에 대응되는 문양이 기저장되고, 문양 감지부(110)에서 감 [0044]지된 색상에 대응되는 문양이 도시될 수 있도록 로봇 주행부(102)의 작동을 제어한다. 한편, 코딩 로봇본체(100)에는 하부로 돌출되어 바닥면에 문양을 그릴 수 있는 펜부재(300)가 구비되고, 펜부재 [0046]공개실용신안 20-2022-0001373-7-(300)는 그림을 그릴 수 있는 연필, 색연필, 볼펜, 싸인펜, 화이트 보드마커 등의 공지된 펜을 이용하여 다양하게 변형되어 실시될 수 있음을 밝혀둔다. 본 고안에 따른 음악 연주 코딩을 이용한 코딩 교육장치는 코딩 로봇본체(100)부재가 상면에 올려지고 펜부재 [0047](300)로 그림이 그려지는 그림 그리기용 받침부재(미도시)를 더 포함하고, 그림 그리기용 받침부재는 종이 재질로 제조된 도화지인 것을 일 예로 하고, 이외에도 화이트 보드 등 공지의 펜을 이용하여 그림이 그려질 수 있는공지의 부재로 다양하게 변형되어 실시될 수 있음을 밝혀둔다. 본 고안에서 펜부재(300)는 화이트 보드 마커이고, 그림 그리기용 받침부재는 화이트 보드인 것을 일 예로 [0048]한다.화이트 보드는 화이트 보드 마커로 그려진 문양을 쉽게 지울 수 있어 반복해서 재사용이 가능한 장점이 있다. [0049]펜부재(300)는 코딩 로봇본체(100)에 분리 가능하게 결합되어 다른 색상 또는 다른 종류의 펜으로 교체되어 사 [0050]용될 수 있어 사용자가 원하는 펜으로 원하는 문양을 도시할 수 있도록 한다.코딩 로봇본체(100)에는 펜부재(300)가 결합되는 펜 결합구멍(103)이 위치되어 펜 결합구멍(103) 내에 펜부재 [0051](300)를 삽입하여 펜부재(300)의 펜이 하부면으로 돌출되게 위치시킨다. 펜 결합구멍(103)은 코딩 로봇본체(100)의 중앙부분에 상, 하로 관통된 형태로 형성되고, 펜부재(300)는 코딩 [0052]로봇본체(100)의 상부 측에서 펜이 아래로 향하게 펜 결합구멍(103)으로 삽입되어 코딩 로봇본체(100)의 하부면으로 펜이 돌출되어 바닥면에 접촉될 수 있다.펜부재(300)는 코딩 로봇본체(100)의 하부면으로 펜이 돌출되어 코딩 로봇본체(100)가 올려지는 그림 그리기용 [0053]받침부재의 상면에 접촉되고 코딩 로봇본체(100)가 주행하면서 그림 그리기용 받침부재의 상면에 문양을 그리게된다. 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치는 원, 삼각형, 사각형, 오각형, 별 모양, 꽃모양 중 어느 [0054]한 문양을 그릴 수 있는 것을 일 예로 한다. 그리고, 코딩 제어부는 색상 인식을 통해 코딩 로봇본체(100)로 그릴 수 있는 문양과 해당 문양에 대응되는 색 [0055]상이 기저장되어 문양 감지부(110)에서 감지된 색상을 통해 해당 색상에 대응되는 문양을 코딩 로봇본체(100)가그릴 수 있도록 로봇 주행부(102)의 작동을 제어한다. 문양 입력부(200)는 제1문양 즉, 원을 그리게 하는 제1색상이 구비된 제1문양 입력카드(211), 제2문양 즉, 삼각 [0057]형을 그리게 하는 제2색상이 구비된 제2문양 입력카드(212), 제3문양, 즉, 사각형을 그리게 하는 제3색상이 구비된 제3문양 입력카드(213), 제4문양 즉, 오각형을 그리게 하는 제4색상이 구비된 제4문양 입력카드(214), 제5문양 즉, 별모양을 그리게 하는 제5문양 입력카드(215), 제6문양 즉, 꽃모양을 그리게 하는 제6문양 입력카드(216)를 포함하는 것을 일 예로 한다.복수의 문양 입력 카드(210)는 제1문양 입력카드(211) 내지 제6문양 입력카드(216) 중 어느 하나를 문양 감지부 [0058](110)에 감지시킴으로써 해당 문양 입력 카드에 대응되는 문양을 코딩 제어부에 입력시킬 수 있다. 그리고, 제1색상은 초록색(GREEN)이고, 제2색상은 빨간색(RED)이며, 제3색상은 파란색(BLUE)이고, 제4색상은 노 [0059]란색(YELLOW)이며, 제5색상은 하늘색(CYAN)이고, 제6색상은 자주색(MAGENTA)인 것을 일 예로 한다. 또한, 문양 입력부(200)는 보드 상에 문양을 입력할 수 있는 서로 다른 색상의 복수의 문양 입력용 색상 패턴이 [0060]도시된 문양 입력 보드(220)인 것을 일 예로 하고, 사용자는 문양 입력 보드(220) 상에 해당 문양 입력용 색상패턴을 문양 감지부(110)로 감지시켜 코딩 로봇본체(100)가 그리는 문양을 입력시킬 수 있다. 문양 입력용 색상 패턴은 해당 색상이 그리게 하는 즉, 해당 색상에 대응되는 문양으로 도시되어 사용자가 해당 [0061]색상으로 그릴 수 있는 문양을 용이하게 확인할 수 있다.일 예로, 문양 입력 보드(220)에는 제1문양 즉, 원을 그리게 하는 제1색상으로 제1문양으로 도시된 제1문양 입 [0062]력용 색상패턴(221), 제2문양 즉, 삼각형을 그리게 하는 제2색상으로 제2문양으로 도시된 제2문양 입력용 색상패턴(222), 제3문양 즉, 사각형을 그리게 하는 제3색상으로 제3문양으로 도시된 제3문양 입력용 색상패턴(223),제4문양 즉, 오각형을 그리게 하는 제4색상으로 제4문양으로 도시된 제4문양 입력용 색상패턴(224), 제5문양즉, 별모양을 그리게 하는 제5색상으로 제5문양으로 도시된 제5문양 입력용 색상패턴(225), 제6문양 즉, 꽃모양공개실용신안 20-2022-0001373-8-을 그리게 하는 제6색상으로 제6문양으로 도시된 제6문양 입력용 색상패턴(226)이 구비된다.문양 입력 보드(220)는 제1문양 입력용 색상패턴(221) 내지 제6문양 입력용 색상패턴(226) 중 어느 하나를 문양 [0063]감지부(110)에 감지시킴으로써 해당 색상패턴에 대응되는 문양을 코딩 제어부에 입력시킬 수 있다. 제1문양은 원모양, 제2문양은 삼각형 모양, 제3문양은 사각형 모양, 제4문양은 오각형 모양, 제5모양은 별모양, [0064]제6모양은 꽃모양인 것을 일 예로 한다. 한편, 주행 제어부는 문양 감지부(110), 로봇 주행부(102)로 전원을 공급하는 전원 공급부를 포함하고, 전원 공 [0066]급부는 충전 케이블로 충전될 수 있는 충전지인 것을 일 예로 한다.코딩 로봇본체(100)의 외측면에는 충전지 케이블을 연결할 수 있는 충전 단자(130)가 위치되고, 충전 단자(13 [0067]0)는 마이크로 5핀, C타입 충전 케이블 등 공지의 충전 케이블을 연결할 수 있는 공지의 단자로 더 상세한 설명은 생략함을 밝혀둔다. 코딩 로봇본체(100)에는 문양 감지부(110)에서 문양이 감지될 때 해당 문양을 음성으로 출력하는 스피커부(12 [0068]0)가 구비된다.스피커부(120)는 문양 감지부(110)에서 문양이 감지될 때 해당 문양을 음성으로 출력하여 사용자가 입력되는 문 [0069]양 즉, 그릴려는 문양을 다시 한번 정확하게 확인할 수 있게 한다.또한, 스피커부(120)는 코딩 로봇본체(100)가 문양을 도시할 때 각 문양 마다 다른 음악을 출력하여 작동 시 흥 [0070]미를 유발할 수 있다. 코딩 제어부는 초록색이 문양 감지부(110)에서 감지되면 로봇 주행부(102)로 코딩 로봇분체를 원형으로 주행시 [0071]켜 펜부재(300)로 원을 그릴 수 있도록 하고, 빨간색이 문양 감지부(110)에서 감지되면 로봇 주행부(102)로 코딩 로봇분체를 삼각형으로 주행시켜 펜부재(300)로 삼각형을 그릴 수 있도록 하며, 파란색이 문양 감지부(110)에서 감지되면 로봇 주행부(102)로 코딩 로봇분체를 사각형으로 주행시켜 펜부재(300)로 사각형을 그릴 수 있도록 하며, 노란색이 문양 감지부(110)에서 감지되면 로봇 주행부(102)로 코딩 로봇분체를 오각형으로 주행시켜펜부재(300)로 오각형을 그릴 수 있도록 하고, 하늘색이 문양 감지부(110)에서 감지되면 로봇 주행부(102)로 코딩 로봇분체를 별모양으로 주행시켜 펜부재(300)로 별모양을 그릴 수 있도록 하며, 자주색이 문양 감지부(110)에서 감지되면 로봇 주행부(102)로 코딩 로봇분체를 꽃모양으로 주행시켜 펜부재(300)로 꽃모양을 그릴 수 있도록 한다.또한, 코딩 제어부는 코딩 로봇본체(100)의 외측면에 노출되게 구비되고, 코딩 로봇본체(100)의 작동을 온/오프 [0072]하는 전원 스위치부(140)를 포함한다. 그리고, 코딩 제어부는 코딩 로봇본체(100)를 작동시키고 코딩 로봇본체(100)의 작동 모드를 선택할 수 있는 작 [0073]동 스위치(150)를 더 포함할 수 있다. 코딩 제어부는 문양 감지부(110)에서 감지되는 문양을 하나만 도시하는 일반 문양 그림모드, 문양 감지부(110) [0074]에서 감지되는 문양을 코딩 로봇본체(100)가 기설정된 각도로 회전하면서 해당 문양을 복수로 도시하는 연속 문양 그림모드를 포함하고, 일반 문양 그림모드, 연속 문양 그림모드 중 하나의 모드를 선택하여 작동시킬 수 있다. 또한, 코딩 제어부는 문양 감지부(110)를 통해 복수의 문양을 순서대로 입력시키고, 입력된 복수의 문양을 코딩 [0075]로봇본체(100)가 기설정된 각도로 회전하면서 순서대로 도시하는 코딩 연속 그림모드를 더 포함하고, 일반 문양그림모드, 연속 문양 그림모드, 코딩 연속 그림모드 중 하나의 모드를 선택하여 작동시킬 수 있다. 작동 스위치(150)는 전원 스위치부(140)가 온 상태로 위치된 상태에서 조작되어 복수의 작동 모드 중 어느 하나 [0076]의 작동 모드로 코딩 로봇본체(100)가 작동될 수 있도록 한다. 작동 스위치(150)는 코딩 로봇본체(100)의 하부면으로 돌출되는 누름식 버튼 스위치로 코딩 로봇본체(100)의 윗 [0077]부분을 누르면 눌려져 조작될 수 있다. 즉, 작동 스위치(150)는 전원 스위치부(140)가 온 상태로 위치된 상태에서 조작되어 일반 문양 그림모드, 연속 [0078]문양 그림모드, 코딩 연속 그림모드 중 하나의 모드로 코딩 로봇본체(100)가 작동될 수 있도록 한다.일 예로 작동 스위치(150)는 눌러지는 버튼 스위치이고, 전원 스위치부(140)가 온 상태에서 기설정된 시간 이상 [0079]공개실용신안 20-2022-0001373-9-으로 눌러지면 일반 문양 그림모드가 선택되게 하고, 전원 스위치부(140)가 온 상태에서 기설정된 시간 이상으로 눌러진 후 다시 한번 눌러지면 연속 문양 그림모드가 선택되게 한다. 또한, 작동 스위치(150)는 전원 스위치부(140)가 온 상태에서 기설정된 시간 이상으로 눌러진 후 다시 두번 눌 [0080]러지면 코딩 연속 그림모드가 선택되게 한다. 더 상세하게 코딩 제어부는 사용자가 작동 스위치(150)를 3초간 누르고 떼면 일반 문양 그림모드로 코딩 로봇본 [0081]체(100)가 작동되어 하나의 문양을 그리도록 하고, 사용자가 작동 스위치(150)를 3초간 누르고 뗀 후 다시 작동스위치(150)를 누르면 연속 문양 그림모드로 코딩 로봇본체(100)가 작동되어 하나의 문양을 기설정된 각도로 회전하면서 복수로 도시하도록 한다. 또한, 코딩 제어부는 사용자가 작동 스위치(150)를 3초간 누르고 뗀 후 다시 작동 스위치(150)를 두번 누르면 [0082]코딩 연속 그림모드로 코딩 로봇본체(100)가 작동되어 입력된 문양의 순서대로 서로 다른 복수의 문양을 기설정된 각도로 회전하면서 도시하도록 한다. 연속 문양 그림모드와 코딩 연속 그림모드에서 코딩 제어부는 코딩 로봇본체(100)를 시작 지점에서 시작해서 시 [0083]작 지점에서 그림이 마무리되면서 하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로 회전되어문양을 도시하되, 시작 지점에서 시작하여 다시 시작지점에서 마무리되도록 문양을 도시한다. 이 과정을 반복하면서 코딩 로봇본체(100)는 시작 지점에서 원주방향으로 동일한 간격으로 이격된 복수의 문양 [0084]을 그리게 된다. 한편, 코딩 제어부는 코딩 로봇본체(100)의 작동 상태를 표시할 수 있는 작동 표시램프(160)가 위치되고, 작동 [0086]표시램프(160)는 복수의 작동 모드에 대응되도록 복수로 구비되어 복수의 작동 모드에서 각각 서로 다른 램프가점등되어 해당 작동 모드의 작동을 표시할 수 있다.일 예로 코딩 제어부는 일반 문양 그림모드에서 점등되어 일반 문양 그림모드가 설정되어 있음을 표시하는 제1 [0087]작동 표시램프, 연속 문양 그림모드에서 점등되어 연속 문양 그림모드가 설정되어 있음을 표시하는 제2작동 표시램프를 포함할 수 있다.또한, 코딩 제어부는 코딩 연속 그림모드에서 점등되어 코딩 연속 그림모드가 설정되어 있음을 표시하는 제3작 [0088]동 표시램프를 더 포함할 수도 있다.작동 표시램프(160)는 복수의 작동 모드에서 각각 다른 색상의 빛을 발생시켜 각각 다른 작동 모드를 표시할 수 [0089]도 있다.코딩 제어부는 전원 스위치의 온/오프 상태를 표시하는 전원 표시램프(170), 충전지의 충전 상태를 표시하는 충 [0090]전 표시램프(180)를 더 포함할 수 있다.전원 표시램프(170)는 전원 스위치가 온상태에서 점등되어 복수의 색상으로 점등되어 코딩 로봇본체(100)가 전 [0091]원이 온상태가 되어 작동 대기 중임을 확인할 수 있도록 한다. 전원 표시램프(170)는 문양 감지부(110)에서 감지되는 색상 즉, 문양에 대응되는 복수의 색상에 대응되는 빛을 [0092]점등하여 문양 감지부(110)에서 감지되는 색상을 사용자가 확인할 수 있도록 한다.일 예로, 원형, 삼각형, 사각형, 오각형, 별모양, 꽃모양에 대응되는 색상으로 초록색(GREEN), 빨간색(RED), 파 [0093]란색(BLUE), 노란색(YELLOW), 하늘색(CYAN), 자주색(MAGENTA)이 기설정되므로 전원 표시램프(170)는 초록색(GREEN) 빛, 빨간색(RED) 빛, 파란색(BLUE) 빛, 노란색(YELLOW) 빛, 하늘색(CYAN) 빛, 자주색(MAGENTA) 빛 중어느 하나의 빛을 발생시킬 수 있다. 즉, 전원 표시램프(170)는 문양 감지부(110)로 초록색(GREEN)이 감지되면 초록색(GREEN) 빛을 발생시키고, 빨간 [0094]색(RED)이 감지되면 빨간색(RED) 빛을 발생시키고, 파란색(BLUE)이 감지되면 파란색(BLUE) 빛을 발생시키고, 노란색(YELLOW)이 감지되면 노란색(YELLOW) 빛을 발생시키고, 하늘색(CYAN)이 감지되면 하늘색(CYAN) 빛을 발생시키고, 자주색(MAGENTA)이 감지되면 자주색(MAGENTA) 빛을 발생시킴으로써 사용자가 문양 감지부(110)에서 감지되는 색상이 정확하게 감지되는 확인할 수 있도록 한다. 도 4는 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치로 도시된 문양의 다른 실시예를 도시한 도면이고, [0095]더 상세하게 도 4는 연속 문양 그림모드에서 코딩 로봇본체(100)가 동일한 복수의 문양을 그린 예를 도시한 것공개실용신안 20-2022-0001373-10-이다. 도 4의 (a)는 연속 문양 그림모드에서 정삼각형을 60도 간격으로 회전하면서 연속적으로 그린 예이고, 도 4의 [0096](b)는 코딩 연속 그림모드에서 정사각형을 30도 간격으로 회전하면서 연속적으로 그린 예이며, 도 4의 (c)는 코딩 연속 그림모드에서 별모양을 120도 간격으로 회전하면서 연속적으로 그린 예이다. 더 상세하게 도 4의 (a)는 연속 문양 그림모드에서 코딩 로봇본체(100)가 시작 지점에서 그리기 시작해서 시작 [0097]지점에서 그림을 마무리하면서 하나의 정삼각형을 그린 후 60도로 회전되고, 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 다른 하나의 정삼각형을 그린 후 60도로 회전되며 다시 시작 지점에서그리기 시작해서 시작 지점에서 그림을 마무리하면서 또 다른 하나의 정삼각형을 그린 것이다.또한, 도 4의 (b)는 연속 문양 그림모드에서 코딩 로봇본체(100)가 시작 지점에서 그리기 시작해서 시작 지점에 [0098]서 그림을 마무리하면서 하나의 정사각형을 그린 후 30도로 회전되고, 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 다른 하나의 정사각형을 그린 후 30도로 회전되며 다시 시작 지점에서 그리기시작해서 시작 지점에서 그림을 마무리하면서 또 다른 하나의 정사각형을 그린 것이다.도 4의 (c)는 연속 문양 그림모드에서 코딩 로봇본체(100)가 시작 지점에서 그리기 시작해서 시작 지점에서 그 [0099]림을 마무리하면서 하나의 별모양을 그린 후 120도로 회전되고, 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 다른 하나의 별모양을 그린 후 120도로 회전되며 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 또 다른 하나의 별모양을 그린 것이다.도 5는 본 고안에 따른 문양 그리기가 가능한 코딩 교육장치로 도시된 문양또 다른 실시예를 도시한 도면이고, [0101]더 상세하게 도 5는 코딩 연속 그림모드에서 코딩 로봇본체(100)가 서로 다른 복수의 문양을 입력된 순서대로그린 예를 도시한 것이다. 도 5의 (a)는 코딩 연속 그림모드에서 정삼각형, 정사각형, 별모양을 순서대로 문양 감지부(110)로 입력하고, [0102]코딩 로봇본체(100)가 120도 간격으로 회전하면서 정삼각형, 정사각형, 별모양으로 그린 예이고, 도 5의 (b)는코딩 연속 그림모드에서 정사각형, 오각형, 정삼각형을 순서대로 문양 감지부(110)로 입력하고, 코딩 로봇본체(100)가 120도 간격으로 회전하면서 정사각형, 오각형, 정삼각형을 순서대로 그린 예이며, 도 5의 (c)는 코딩연속 그림모드에서 별모양, 꽃모양, 정삼각형을 순서대로 문양 감지부(110)로 입력하고, 코딩 로봇본체(100)가120도 간격으로 회전하면서 별모양, 꽃모양, 정삼각형을 순서대로 그린 예이다. 더 상세하게 도 5의 (a)는 딩 연속 그림모드에서 코딩 로봇본체(100)가 시작 지점에서 그리기 시작해서 시작 지 [0103]점에서 그림을 마무리하면서 정삼각형을 그린 후 60도로 회전되고, 다시 시작 지점에서 그리기 시작해서 시작지점에서 그림을 마무리하면서 정사각형을 그린 후 165도로 회전되며 다시 시작 지점에서 그리기 시작해서 시작지점에서 그림을 마무리하면서 별모양을 그린 것이다.또한, 도 5의 (b)는 연속 문양 그림모드에서 코딩 로봇본체(100)가 시작 지점에서 그리기 시작해서 시작 지점에 [0104]서 그림을 마무리하면서 정사각형을 그린 후 30도로 회전되고, 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 오각형을 그린 후 150도로 회전되며 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 정삼각형을 그린 것이다.도 5의 (c)는 연속 문양 그림모드에서 코딩 로봇본체(100)가 시작 지점에서 그리기 시작해서 시작 지점에서 그 [0105]림을 마무리하면서 별모양을 그린 후 120도로 회전되고, 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 꽃모양을 그린 후 120도로 회전되며 다시 시작 지점에서 그리기 시작해서 시작 지점에서 그림을 마무리하면서 정삼각형을 그린 것이다.본 고안은 문양의 코딩을 통해 코딩 로봇본체(100)에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 초 [0107]등학교 저학년의 아동이 쉽게 이해할 수 있어 코딩 학습 효과를 향상시킬 수 있다. 본 고안의 다른 목적은 사용자가 카드, 보드 등을 이용하여 문양 그리기를 실행하는 문양 그리기 코딩모드, 연 [0108]속 문양 그리기 코딩모드 등의 다양한 모드를 선택해서 사용할 수 있어 유치원 또는 초등학교 저학년의 아동에게 코딩 학습에 대한 흥미를 유발함으로써 코딩 학습에 대한 접근성을 증대시키며, 다양한 코딩 학습이 가능하여 코딩에 대한 이해와 접근을 쉽게 하도록 하고 코딩 학습 효과를 더 향상시킬 수 있다. 공개실용신안 20-2022-0001373-11-본 고안은 상기한 실시 예에 한정되는 것이 아니라, 본 고안의 요지에 벗어나지 않는 범위에서 다양하게 변경하 [0109]여 실시할 수 있으며 이는 본 고안의 구성에 포함됨을 밝혀둔다.부호의 설명100 : 코딩 로봇본체 101 : 로봇본체 하우징 [0110]102 : 로봇 주행부 102a : 주행바퀴103 : 펜 결합구멍 110 : 문양 감지부120 : 스피커부 130 : 충전 단자140 : 전원 스위치부 150 : 작동 스위치160 : 작동 표시램프 170 : 전원 표시램프180 : 충전 표시램프 200 : 문양 입력부210 : 문양 입력 카드 211 : 제1문양 입력카드212 : 제2문양 입력카드 213 : 제3문양 입력카드214 : 제4문양 입력카드 215 : 제5문양 입력카드216 : 제6문양 입력카드 220 : 문양 입력 보드 221 : 제1문양 입력용 색상패턴222 : 제2문양 입력용 색상패턴 223 : 제3문양 입력용 색상패턴224 : 제4문양 입력용 색상패턴 225 : 제5문양 입력용 색상패턴226 : 제6문양 입력용 색상패턴300 : 펜부재공개실용신안 20-2022-0001373-12-도면도면1공개실용신안 20-2022-0001373-13-도면2도면3공개실용신안 20-2022-0001373-14-도면4공개실용신안 20-2022-0001373-15-도면5공개실용신안 20-2022-0001373-16-"}
{"patent_id": "20-2020-0004468", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 고안은 문양 그리기가 가능한 코딩 교육장치에 관한 것으로 주행 방향을 변경하면서 감지된 문양을 그릴 수 있는 코딩 로봇본체, 상기 코딩 로봇본체에 구비되며 문양을 그리는 펜부재, 상기 코딩 로봇본체에 상기 코딩 로 봇본체가 그릴 수 있는 문양을 입력하는 문양 입력부를 포함하여 문양의 코딩을 통해 코딩 로봇본체에서 문양 그 리기를 실행하여 코딩의 기초를 유치원 또는 초등학교 저학년의 아동이 쉽게 이해할 수 있어 코딩 학습 효과를 향상시킬 수 있다."}
{"patent_id": "20-2020-0004468", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 고안은 문양 그리기가 가능한 코딩 교육장치에 관한 것으로 더 상세하게는 문양의 코딩을 통해 코딩 로봇본 체에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 초등학교 저학년의 아동이 쉽게 이해할 수 있도록 한 문양 그리기가 가능한 코딩 교육장치에 관한 고안이다."}
{"patent_id": "20-2020-0004468", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 코딩은 컴퓨터 프로그래밍 즉, 주어진 명령을 컴퓨터가 이해할 수 있는 언어로 입력하는 것을 의미 하는 것으로, C언어, 자바, 파이선 등의 컴퓨터 언어로 프로그램을 만드는 것을 말한다. 코딩 교육은 논리력, 창의력 문제 해결력을 키울 수 있어 근래에 들어 중요성이 크게 증가하고 있다. 그리고, 코딩은 인공지능, 사물인터넷, 지능형 로봇, 빅 데이터 분석 및 활용 등 4차 산업혁명시대를 대변하는 것들이 ICT(정보통신기술)을 바탕으로 한 소프트웨어를 통해 구현되기 때문에 그 중요성이 더 증가하고 있다. 코딩 교육은 퍼즐이나 블록 맞추기 등의 게임 방식으로 유치원 또는 초등학교 학생들을 대상으로 기초적인 프로 그램의 원리를 이해할 수 있도록 접근되고 있다. 그러나, 퍼즐이나 블록 맞추기 등의 게임 방식은 입력과 입력에 따른 프로그램의 변화를 정확하게 표현할 수 없 어 코딩의 원리를 교육하는데 한계가 있었다. 또한, 퍼즐이나 블록 맞추기 등의 게임 방식은 유치원 또는 초등학교 저학년이 쉽고 간편하게 접근하는데 어려 움이 있어 코딩에 대한 기초를 쉽게 이해시키는데 있어 어려움이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내특허등록 제1683022호 '코딩 학습용 교구'(2016년 11월 30일 등록) 고안의 내용"}
{"patent_id": "20-2020-0004468", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 고안의 목적은 문양의 코딩을 통해 코딩 로봇본체에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 초등학교 저학년의 아동이 쉽게 이해할 수 있도록 한 문양 그리기가 가능한 코딩 교육장치를 제공하는 데 있다. 본 고안의 다른 목적은 사용자가 카드, 보드 등을 이용하여 문양 그리기를 실행하는 문양 그리기 코딩모드, 연 속 문양 그리기 코딩모드 등의 다양한 모드를 선택해서 사용할 수 있어 유치원 또는 초등학교 저학년의 아동에 게 코딩 학습에 대한 흥미를 유발할 수 있는 문양 그리기가 가능한 코딩 교육장치를 제공하는 데 있다."}
{"patent_id": "20-2020-0004468", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여 본 고안은 주행 방향을 변경하면서 감지된 문양을 그릴 수 있는 코딩 로봇 본체, 상기 코딩 로봇본체에 구비되며 문양을 그리는 펜부재, 상기 코딩 로봇본체에 상기 코딩 로봇본체가 그릴 수 있는 문양을 입력하는 문양 입력부를 포함하는 것을 특징으로 하는 문양 그리기가 가능한 코딩 교육장치를 제공하는 데 있다. 본 고안에서 상기 코딩 로봇본체에는 상기 펜부재가 결합되는 펜 결합구멍이 위치되어 상기 펜 결합구멍 내에 상기 펜부재가 삽입되어 상기 펜부재의 펜이 상기 코딩 로봇본체의 하부면으로 돌출될 수 있다. 본 고안에서 상기 코딩 로봇본체는 주행바퀴를 포함하는 로봇 주행부, 상기 문양 입력부에 의해 입력되는 문양 정보를 감지할 수 있는 문양 감지부 및 상기 문양 감지부에서 감지된 문양을 그릴 수 있도록 상기 로봇 주행부 의 작동을 제어하는 코딩 제어부를 포함할 수 있다. 본 고안에서 상기 문양 감지부는 색상을 감지할 수 있는 색상 센서부이고, 상기 문양 입력부는 해당 문양에 대 응되는 색상을 상기 문양 감지부로 감지시킴으로써 코딩 로봇본체에 그리게 되는 문양을 입력할 수 있다. 공개실용신안 20-2022-0001373 -5-본 고안에서 상기 문양 입력부는 서로 다른 색상을 가져 상기 코딩 로봇본체가 그릴 수 있는 서로 다른 문양을 입력하는 복수의 문양 입력 카드를 포함할 수 있다. 본 고안에서 상기 문양 입력부는 보드 상에 문양을 입력할 수 있는 서로 다른 색상의 복수의 문양 입력용 색상 패턴이 도시된 문양 입력 보드일 수 있다. 본 고안에서 상기 코딩 로봇본체에는 문양 감지부에서 문양이 감지될 때 해당 문양을 음성으로 출력하는 스피커 부가 구비될 수 있다. 본 고안에서 상기 코딩 제어부는 상기 문양 감지부에서 감지되는 문양을 하나만 도시하는 일반 문양 그림모드 및 상기 문양 감지부에서 감지되는 문양을 코딩 로봇본체가 기설정된 각도로 회전하면서 해당 문양을 복수로 도 시하는 연속 문양 그림모드를 포함하고, 상기 일반 문양 그림모드, 상기 연속 문양 그림모드 중 하나의 작동 모 드를 선택하여 작동시킬 수 있다. 본 고안에서 상기 연속 문양 그림모드는 상기 코딩 로봇본체를 시작 지점에서 시작해서 시작 지점에서 그림이 마무리되면서 하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로 회전되어 문양을 도시하되, 시작 지점에서 시작하여 다시 시작지점에서 마무리되도록 문양을 도시할 수 있다. 본 고안에서 상기 코딩 제어부는 문양 감지부를 통해 복수의 문양을 순서대로 입력시키고, 입력된 복수의 문양 을 코딩 로봇본체가 기설정된 각도로 회전하면서 순서대로 도시하는 코딩 연속 그림모드를 더 포함하고, 상기 일반 문양 그림모드, 상기 연속 문양 그림모드, 상기 코딩 연속 그림모드 중 하나의 작동 모드를 선택하여 작동 시킬 수 있다. 본 고안에서 상기 연속 문양 그림모드와 상기 코딩 연속 그림모드는 상기 코딩 로봇본체를 시작 지점에서 시작 해서 시작 지점에서 그림이 마무리되면서 하나의 문양을 도시하고, 하나의 문양을 도시한 후 기설정된 각도로 회전되어 문양을 도시하되, 시작 지점에서 시작하여 다시 시작지점에서 마무리되도록 문양을 도시할 수 있다. 본 고안에서 상기 코딩 제어부는 상기 코딩 로봇본체의 작동 모드를 선택할 수 있는 작동 스위치를 포함할 수 있다. 본 고안에서 상기 작동 스위치는 상기 코딩 로봇본체의 하부면으로 돌출되는 누름식 버튼 스위치로 코딩 로봇본 체의 윗부분을 누르면 눌려져 조작될 수 있다. 본 고안에서 상기 코딩 제어부는 상기 코딩 로봇본체의 작동 모드를 표시할 수 있는 작동 표시램프가 위치되고, 복수의 작동 모드에서 각각 다른 색상의 빛을 발생시켜 각각 다른 작동 모드를 표시할 수 있다. 고안의 효과 본 고안은 문양의 코딩을 통해 코딩 로봇본체에서 문양 그리기를 실행하여 코딩의 기초를 유치원 또는 초등학교 저학년의 아동이 쉽게 이해할 수 있어 코딩 학습 효과를 향상시키는 효과가 있다. 본 고안의 다른 목적은 사용자가 카드, 보드 등을 이용하여 문양 그리기를 실행하는 문양 그리기 코딩모드, 연 속 문양 그리기 코딩모드 등의 다양한 모드를 선택해서 사용할 수 있어 유치원 또는 초등학교 저학년의 아동에 게 코딩 학습에 대한 흥미를 유발함으로써 코딩 학습에 대한 접근성을 증대시키며, 다양한 코딩 학습이 가능하 여 코딩에 대한 이해와 접근을 쉽게 하도록 하고 코딩 학습 효과를 더 향상시키는 효과가 있다."}
