{"patent_id": "10-2022-0163904", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0080492", "출원번호": "10-2022-0163904", "발명의 명칭": "비대면 태권도 품새 평가 및 단 부여 자동화 방법 및 장치", "출원인": "주식회사 그루크리에이티브랩", "발명자": "손정아"}}
{"patent_id": "10-2022-0163904", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "인공지능 알고리즘을 기반으로 동작을 학습하고, 이를 Input 데이터를 통해 사람의 자세를 추출하는 추출부;추출부를 통해 들어온 사용자 동작 패턴과 정답 데이터 동작 패턴과의 차이를 구하여 동작 횟수, 수행 속도를분석하여 점수화하는 분석부;를 포함하는 비대면 태권도 품새 평가 및 단 부여 자동화 방법 및 장치"}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 일 실시예에 따른 비대면 태권도 품새 평가 및 단 부여 자동화 방법 및 장치에 관한 것으로, 인공지능 알고리즘을 기반으로 동작을 학습하고, 이를 Input 데이터를 통해 사람의 자세를 추출하는 추출부; 추출부를 통 해 들어온 사용자 동작 패턴과 정답 데이터 동작 패턴과의 차이를 구하여 동작 횟수, 수행 속도를 분석하여 점수 화하는 분석부; 를 포함한다."}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인식된 사용자 동작 측정을 통해 비대면 태권도 품새 평가 및 단 부여 자동화 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "COVID19 사태로 인해 대다수의 태권도 수련생들은 수련을 포기하거나, 화상회의 기반의 원격수업을 받고 있으나 상호 소통을 활용한 형태의 교육으로 발전하기에는 동작을 가르침에 있어 정확성을 판단하기가 어려웠으며, 이 러한 불편함은 전국 약 1만 개의 태권도장의 현재 고사 직전의 상황으로 비대면 방식에 기댈 수밖에 없는 교육 환경에서의 큰 걸림돌이 되었다. 이에 대한 해결책으로 현재 문제가 되고 있는 비대면 환경에서의 사용자 동작 의 정확도를 평가하기 위한 인공지능 기반 포즈 인식 및 추정 기술로 정답 데이터 셋의 사용자 동작과 측정된 사용자 동작을 비교하여 유사도를 정량 평가하여 태권도 품새 평가 및 단을 부여하는 자동화 방법 및 장치에 대 해 안출하고자 한다."}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 바와 같은 문제점을 해결하기 위한 본 발명은 인공지능 기반 포즈 인식 및 추정 기술을 이용해 사용자 동작 측정과 정답 패턴의 사용자 동작 데이터 셋 사이 차이 나는 동작 패턴을 추출해 동작의 유사도를 정량평가 하여 품새 평가 및 단을 부여에 있어 자동화하는 프로세스를 이용하여 상술한 문제점들을 해결하고자 한다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 언급되지 않은 또 다른 과제들 은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 비대면 태권도 품새 평가 및 단 부여 자동화 방법 및 장치에 관한 것으로, 인공지능 알고리즘을 기반으로 동작을 학습하고, 이를 Input 데이터를 통해 사람의 자세를 추출하는 추출부; 추출부를 통해 들어온 사용자 동작 패턴과 정답 데이터 동작 패턴과의 차이를 구하여 동작 횟 수, 수행 속도를 분석하여 점수화하는 분석부; 를 포함한다. 이 외에도, 본 발명을 구현하기 위한 다른 방법, 다른 시스템 및 상기 방법을 실행하기 위한 컴퓨터 프로그램을 기록하는 컴퓨터 판독 가능한 기록 매체가 더 제 공될 수 있다."}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "고안된 기술은 N개의 실증 데이터를 기반으로 변형에 강인한 VSG 인공지능 네트워크에 학습하여 Input 이미지를 통해 자세를 추출하는 Pose Estimation Inference을 통해 포즈 인식 추정 후, 이를 통해 정답 데이터에 대한 동 작 패턴과 사용자 패턴과의 차이를 구하기 위한 Pose Differnetial MAp 추출하는 기술을 개발하여, 이 결과를 2D RGB 영상 시퀀스를 통해 반복 동작 횟수, 동작 수행 속도를 분석하여 점수화해 비대면으로 태권도 품새를 평가하는 것을 목표로 하며, 이를 서비스 플랫폼에 자동화 프로세스로 구축하여 비대면으로 사용자 동작 인식과 정확도 판단을 하나의 플랫폼에서 All-in-One으로 진행 가능하도록 하는 방법 및 장치를 제공한다."}
{"patent_id": "10-2022-0163904", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다 코로나19가 심화됨에 따라 거리 두기가 지속되어 화상회의 솔루션을 이용한 교육분야에 특화된 서비스 개발이 활발하였으며, 확진자가 다시 늘어나는 추세에 화상회의를 활용하여 온라인 커리큘럼 구성을 통한 비대면 방식 은 하나의 수업방식으로 자리 잡고 있다. 특히 체육 분야는 비대면 교육을 진행하기 위해 일방향 방식의 실기 교육이 성행하였으나, 화상회의 기반의 원격 수업을 통한 비대면 교육이 부상하면서 이러한 문제점을 해결할 수 있게 되었다. 이러한 화상회의 기반의 원격 수업을 통한 비대면 교육 플랫폼이 증가하고 있으며, Social SNS(Social Network Service), Telepresence 원격 교육과 강의, 사이버 인터랙션 등의 응용 분야의 원격 공간 에서 사용자가 소통하는 다양한 서비스 개발을 위해 집중 투자하고 있다. 이러한 선행 발명에서는 원격 수업을 이용하여 오프라인 중심의 체육 분야를 온라인 커리큘럼 구성을 통해 비대 면 수업 방식으로 보완하고자 하며 이러한 방식을 적용하여 시행된 무술 학원, 체육 수업 등 다양한 분야에서 활용 중이며, 코로나19 사태로 인해 주춤했던 체육계에 숨통을 트여주는 계기가 되었다. 하지만, 상기 장점을 활용한 비대면 교육 시장은 급격히 성장하여 ZOOM이나 구글밋업 등의 화상회의 기반의 다 양한 서비스가 제공되고 있으나, 다수 인원이 참여할 경우 소통이 어렵고, 동작 하나하나를 체크하기 어렵다. 이러한 불편함은 체육 수업의 특성상 4K급 고퀄리티의 영상 제공이 필수인데 반해, 선행 발명의 방식은 영상과 Data를 별도로 제공하는 방식이기 때문에 실시간 스트리밍 방식의 전송시 개별 패킷의 크기가 커서 SD 영상 제 공을 한계점으로 지적되어 아쉬움이 있으며, 사용자들이 사용하기에는 높은 난이도로 인해 사업화가 쉽지 않은 단점이 있다. 따라서 본 발명에서는 인공지능 기반 포즈 인식과 사용자 동작 측정 및 평가 기술을 이용하여, 이를 비대면 태 권도 품새 평가 및 단 부여 자동화 방법 및 장치를 제안한다. 부호의 설명도면 도면1"}
{"patent_id": "10-2022-0163904", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 인공지능 기반 포즈 인식 추정과 사용자 동작 측정 및 평가하는 방법의 시스템 통합 예시도이다."}
