{"patent_id": "10-2023-0127909", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0045086", "출원번호": "10-2023-0127909", "발명의 명칭": "블랙 플라스틱 선별 방법 및 장치", "출원인": "(주)우림아이씨티", "발명자": "김도훈"}}
{"patent_id": "10-2023-0127909", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버에 의해 수행되는 블랙 플라스틱 선별 방법에 있어서,a) 인공지능 모델을 학습시키기 위한 MIR 스펙트럼 데이터를 수집하는 단계;b) 상기 MIR 스펙트럼 데이터를 입력으로 하여 물질의 특징을 구별하기 위한 특징 벡터를 추출하는 인공지능 모델을 학습시키는 단계; 및c) 상기 인공지능 모델에 기초하여 입력된 분류 대상 MIR 스펙트럼 데이터의 특징 벡터를 추출하고, 추출된 상기 특징 벡터의 블랙 유무를 판단하는 단계를 포함하는, 블랙 플라스틱 선별 방법."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 일 실시예는, 블랙 플라스틱 선별 방법을 제공한다. 본 방법은, 인공지능 모델을 학습시키기 위한 MIR 스펙트럼 데이터를 수집하는 단계, 상기 MIR 스펙트럼 데이터를 입력으로 하여 물질의 특징을 구별하기 위한 특 징 벡터를 추출하는 인공지능 모델을 학습시키는 단계 및 상기 인공지능 모델에 기초하여 입력된 분류 대상 MIR 스펙트럼 데이터의 특징 벡터를 추출하고, 추출된 상기 특징 벡터의 블랙 유무를 판단하는 단계를 포함한다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 블랙 플라스틱 선별 방법 및 장치에 관한 것으로, 보다 상세하게는, MIR 스펙트럼 데이터를 입력으로 하고 특징 벡터를 출력하는 인공지능 모델을 학습시키고, 학습된 인공지능 모델에 기초하여 블랙 플라스틱을 선 별하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "재활용 폐기물에 대한 수거 방식은 가장 일반적으로 사용자가 집안에서 재활용 폐기물을 저장 및 보관한 후 한 꺼번에 건물 외부에 설치된 재활용 폐기물 수거함에 버리는 방식이다. 그러나, 수거함에 버리는 것을 일일이 관리할 수 없고 수거 시에 직접 분류할 수 없어 재활용 폐기물에 대한 분 리 및 수거가 제대로 이루어지지 못하고 있다. 종래에는 광학 선별 방식을 통해 재활용 폐기물을 분리하는 기술을 개발하였으나, 광학 선별 방식은 검정색의 플라스틱을 선별하는 것이 불가능 했다. 일 예로, 대부분의 범퍼, 가전 및 용기는 검정색인 경우가 대부분인데, 광학 선별 방식을 통해 검정색의 플라스 틱을 선별하지 못함에 따라 잔재물 처리량이 증가하는 문제점이 발생하게 되고, 잔재물은 매립/소각 처리되므로 환경오염을 발생시키게 된다. 이에 따라, 재활용 폐기물 중 검정색 플라스틱을 분류할 수 있는 방법을 구현해야 할 필요가 있다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 전술한 종래 기술의 문제점을 해결하기 위한 것으로, MIR 스펙트럼 데이터를 입력으로 하고 특징 벡 터를 출력하는 인공지능 모델을 학습시키고, 학습된 인공지능 모델에 기초하여 블랙 플라스틱을 선별하기 위한 방법 및 장치를 제공하고자 한다. 본 발명이 이루고자 하는 기술적 과제들은 상기한 기술적 과제로 제한되지 않으며, 이하의 설명으로부터 본 발 명의 또 다른 기술적 과제들이 도출될 수 있다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 해결하기 위한 기술적 수단으로서, 본 개시의 제1 측면에 따른 실시예는, 블랙 플라스틱 선별 방법을 제공한다. 본 방법은, 인공지능 모델을 학습시키기 위한 MIR 스펙트럼 데이터를 수집하는 단계, 상 기 MIR 스펙트럼 데이터를 입력으로 하여 물질의 특징을 구별하기 위한 특징 벡터를 추출하는 인공지능 모델을 학습시키는 단계 및 상기 인공지능 모델에 기초하여 입력된 분류 대상 MIR 스펙트럼 데이터의 특징 벡터를 추출하고, 추출된 상기 특징 벡터의 블랙 유무를 판단하는 단계를 포함한다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 투명 및 유색 플라스틱들 중 검정색 플라스틱만을 분류할 수 있다. 또한, 본 발명에 따르면, 잔재물 처리량을 줄이고, 환경오염 문제를 줄일 수 있다. 또한, 본 발명에 따르면, 학습된 인공지능 모델을 통해 검정색 플라스틱을 자동으로 분류할 수 있다. 또한, 본 발명에 따르면, 검정색 플라스틱을 자동으로 분류함에 따라 재활용 폐기물의 분류에 소비되는 시간을 줄일 수 있다. 또한, 본 발명에 따르면, 작업자의 숙련도에 따른 선별 정확도를 개선할 수 있다. 또한, 본 발명에 따르면, 열악한 작업환경의 개선할 수 있다. 또한, 본 발명에 따르면, 연속적인 육체적인 노동으로 낮은 작업 효율성을 향상시킬 수 있다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 상술한 효과들로 제한되지 않으며, 이하의 기재로부터 이해되는 모든 효과들을 포함한다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는 첨부한 도면을 참조하여 본 개시를 상세히 설명하기로 한다. 다만, 본 개시는 여러 가지 상이한 형 태로 구현될 수 있으며, 여기에서 설명하는 실시예들로 한정되는 것은 아니다. 또한, 첨부된 도면은 본 명세서 에 개시된 실시예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않는다. 여기에 사용되는 기술용어 및 과학용어를 포함하는 모든 용어들은 본 개시가 속하는"}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "기술분야에서 통상의 지식을 가진 자가 일반적으로 이해하는 의미로 해석되어야 한다. 사전에 정의된 용어들은 관련기술문헌과 현재 개시된 내용에 부합하는 의미를 추가적으로 갖는 것으로 해석되어야 하며, 별도로 정의되 지 않는 한 매우 이상적이거나 제한적인 의미로 해석되지 않는다. 도면에서 본 개시를 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 도면에 나타난 각 구성요 소의 크기, 형태, 형상은 다양하게 변형될 수 있다. 명세서 전체에 대하여 동일/유사한 부분에 대해서는 동일/ 유사한 도면 부호를 붙였다. 이하의 설명에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\" 등은 명세서 작성의 용이함만이 고려되어 부 여되거나 혼용되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시 예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략하였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결(접속, 접촉 또는 결합)\"되어 있다고 할 때, 이는 \"직접적으로 연결(접속, 접촉 또는 결합)\"되어 있는 경우뿐만 아니라, 그 중간에 다른 부재를 사이에 두고 \"간접적으로 연결 (접속, 접촉 또는 결합)\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함(구비 또는 마 련)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소 를 더 \"포함(구비 또는 마련)\"할 수 있다는 것을 의미한다. 본 명세서에서 사용되는 제1, 제2 등과 같이 서수를 나타내는 용어들은 하나의 구성 요소를 다른 구성요소로부 터 구별하는 목적으로만 사용되며, 구성 요소들의 순서나 관계를 제한하지 않는다. 예를 들어, 본 개시의 제1구 성요소는 제2구성요소로 명명될 수 있고, 유사하게 제2구성요소도 제1구성 요소로 명명될 수 있다. 본 명세서에 서 사용되는 단수 표현의 형태들은 명백히 반대의 의미를 나타내지 않는 한 복수 표현의 형태들도 포함하는 것으로 해석되어야 한다. 도 1은 본 발명의 일 실시예에 따른 폐기물 재활용 처리 장치와 이와 통신 연결된 카메라를 설명하기 위해 도시 한 도면이다. 도 1을 참조하면, 폐기물 재활용 처리 장치는 카메라와 기설정된 네트워크를 통해 통신 연결될 수 있 다. 폐기물 재활용 처리 장치는 서버, 컴퓨팅 장치 또는 각종 스마트 디바이스의 형태로 구현될 수 있고, SaaS (Software as a Service), PaaS (Platform as a Service) 또는 IaaS (Infrastructure as a Service)와 같은 클라우드 컴퓨팅 서비스 모델에서 동작 할 수 있다. 또한, 웹 실시간 통신 기반 이메일 전화 서비스 제공 시스 템은 사설(private) 클라우드, 공용(public) 클라우드 또는 하이브리드(hybrid) 클라우드 시스템과 같은 형태로 구축될 수도 있으나, 본 발명의 범위가 이에 제한되는 것은 아니다. 폐기물 재활용 처리 장치는 인공지능 모델을 학습시키기 위한 MIR 스펙트럼 데이터를 수집한다. 폐기물 재활용 처리 장치는 MIR 스펙트럼 데이터를 입력으로 하여 물질의 특징을 구별하기 위한 특징 벡터 를 추출하는 인공지능 모델을 학습시킨다. 폐기물 재활용 처리 장치는 인공지능 모델에 기초하여 입력된 분류 대상 MIR 스펙트럼 데이터의 특징 벡터 를 추출하고, 추출된 특징 벡터의 블랙 유무를 판단한다. 폐기물 재활용 처리 장치는 제1 카메라에 대한 영상 데이터를 수신한다. 여기서, 제1 카메라는 RGB 카메라 로, 폐기물 재활용 처리 장치는 제1 카메라를 통해 400nm 내지 700nm의 스펙트럼 영역에 대응하는 데이터 를 수신할 수 있다. 폐기물 재활용 처리 장치는 제1 카메라와 상이한 스펙트럼 영역을 가지는 제2 카메라에 대한 영상 데이터 를 수신한다. 여기서, 제2 카메라는 NIR 카메라로, 폐기물 재활용 처리 장치는 제2 카메라를 통해 700nm 내지 1000nm의 스펙트럼 영역에 대응하는 데이터를 수신할 수 있다. 폐기물 재활용 처리 장치는 제1 및 제2 카메라와 상이한 스펙트럼 영역을 가지는 제3 카메라에 대한 영상 데이터를 수신한다. 여기서, 제3 카메라는 SWIR 카메라로, 폐기물 재활용 처리 장치는 제3 카메라를 통해 900nm 내지 1900nm의 스펙트럼 영역에 대응하는 데이터를 수신할 수 있다. 폐기물 재활용 처리 장치는 제1 내지 제4 카메라와 상이한 스펙트럼 영역을 가지는 제4 카메라에 대한 영 상 데이터를 수신한다. 여기서, 제4 카메라는 MIR 카메라로, 폐기물 재활용 처리 장치는 제4 카메라를 통 해 2900nm 내지 4200nm의 스펙트럼 영역에 대응하는 데이터를 수신할 수 있다. 폐기물 재활용 처리 장치는 제1 카메라 내지 제4 카메라 각각에 대한 영상 데이터를 융합할 수 있다. 폐기물 재활용 처리 장치는 수신된 초분광 데이터를 전처리한다. 폐기물 재활용 처리 장치는 전처리된 초분광 데이터를 분석하여 유효 파장 대역을 추출한다. 폐기물 재활용 처리 장치는 유효 파장 대역에 대응하는 초분광 데이터의 초분광 데이터의 데이터 차원을 축소한다. 폐기물 재활용 처리 장치는 플라스틱에 대한 광대역 스펙트럼의 플라스틱 데이터를 수집한다. 폐기물 재활용 처리 장치는 플라스틱 데이터를 전처리한다. 폐기물 재활용 처리 장치는 플라스틱 데이터를 입력으로 하고 플라스틱 데이터에 대한 플라스틱 분류 결과 를 출력으로 하는 인공지능 모델을 생성한다. 단말은 폐기물 재활용 처리 장치로 폐기물 재활용의 이미지와 같은 데이터를 전송할 수 있고, 폐기물 재활용 처리 장치로부터 폐기물 재활용의 색, 소재 및 분류 결과를 수신할 수 있다. 단말은 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(desktop), 랩톱(laptop), 휴대성과 이동성 이 보장되는 무선 통신 장치 또는 스마트폰, 태블릿 PC 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 의미할 수 있다. 도 2는 도 1에 도시된 폐기물 재활용 처리 장치의 세부구성을 도시한 도면이다. 폐기물 재활용 처리 장치는 통신 모듈, 프로세서 및 메모리를 포함할 수 있다. 통신 모듈은 다른 네트워크 장치와 유무선 연결을 통해 제어 신호 또는 데이터 신호와 같은 신호를 송수신 하기 위해 필요한 하드웨어 및 소프트웨어를 포함하는 장치를 포함할 수 있다. 통신 모듈은 단말로부터 폐기물 재활용의 이미지와 같은 데이터를 수신할 수 있고, 단말로 폐기물 재활용 의 색, 소재 및 분류 결과를 전송할 수 있다. 프로세서는 데이터를 제어 및 처리하는 다양한 종류의 장치들을 포함할 수 있다. 프로세서는 프로그 램 내에 포함된 코드 또는 명령으로 표현된 기능을 수행하기 위해 물리적으로 구조화된 회로를 갖는, 하드웨어 에 내장된 데이터 처리 장치를 의미할 수 있다. 일 예에서, 프로세서는 마이크로프로세서(microprocessor), 중앙처리장치(central processing unit: CPU), 프로세서 코어(processor core), 멀티프로세서(multiprocessor), ASIC(application-specific integrated circuit), FPGA(field programmable gate array) 등의 형태로 구현될 수 있으나, 본 발명의 범위가 이에 한정 되는 것은 아니다. 프로세서는 메모리에 저장된 코드에 따라 동작을 수행한다. 메모리는 통신 모듈로 입력되는 정보 및 데이터, 프로세서에 의해 수행되는 기능에 필요한 정보 및 데이터, 프로세서의 실행에 따라 생성된 데이터 중 적어도 어느 하나 이상을 저장할 수 있다. 메모리는 전원이 공급되지 않아도 저장된 정보를 계속 유지하는 비휘발성 저장장치 및 저장된 정보를 유지 하기 위하여 전력을 필요로 하는 휘발성 저장장치를 통칭하는 것으로 해석되어야 한다. 메모리는 저장된 정보를 유지하기 위하여 전력이 필요한 휘발성 저장장치 외에 자기 저장 매체(magnetic storage media) 또는 플 래시 저장 매체(flash storage media)를 포함할 수 있으나, 본 발명의 범위가 이에 한정되는 것은 아니다. 메모리는 프로세서와 전기적으로 연결되고, 프로세서에서 수행되는 적어도 하나의 코드가 저장 된다. 메모리는 프로세서를 통해 실행될 때 프로세서가 다음과 같은 기능 및 절차들을 수행하도 록 야기하는 코드가 저장된다. 메모리에는 인공지능 모델을 학습시키기 위한 MIR 스펙트럼 데이터를 수집하도록 야기하는 코드가 저장된 다. 메모리에는 MIR 스펙트럼 데이터를 입력으로 하여 물질의 특징을 구별하기 위한 특징 벡터를 추출하는 인 공지능 모델을 학습시키도록 야기하는 코드가 저장된다. 메모리에는 인공지능 모델에 기초하여 입력된 분류 대상 MIR 스펙트럼 데이터의 특징 벡터를 추출하고, 추 출된 특징 벡터의 블랙 유무를 판단하도록 야기하는 코드가 저장된다. 메모리에는 제1 카메라에 대한 영상 데이터를 수신하도록 야기하는 코드가 저장된다. 여기서, 제1 카메라 는 RGB 카메라로, 폐기물 재활용 처리 장치는 제1 카메라를 통해 400nm 내지 700nm의 스펙트럼 영역에 대 응하는 데이터를 수신할 수 있다. 메모리에는 제2 카메라에 대한 영상 데이터를 수신하도록 야기하는 코드가 저장된다. 여기서, 제2 카메라 는 NIR 카메라로, 메모리에는 제2 카메라를 통해 700nm 내지 1000nm의 스펙트럼 영역에 대응하는 데이터를 수신할 수 있다.메모리에는 제3 카메라에 대한 영상 데이터를 수신하도록 야기하는 코드가 저장된다. 여기서, 제3 카메라 는 SWIR 카메라로, 메모리에는 제3 카메라를 통해 900nm 내지 1900nm의 스펙트럼 영역에 대응하는 데이터 를 수신할 수 있다. 메모리에는 제4 카메라에 대한 영상 데이터를 수신하도록 야기하는 코드가 저장된다. 여기서, 제4 카메라 는 MIR 카메라로, 메모리에는 제4 카메라를 통해 2900nm 내지 4200nm의 스펙트럼 영역에 대응하는 데이터 를 수신할 수 있다. 메모리에는 제1 카메라 내지 제4 카메라 각각에 대한 영상 데이터를 융합하도록 야기하는 코드가 저장된다. 메모리에는 400 내지 4200nm 스펙트럼 영역의 데이터를 수신할 수 있다. 이에 따라, 메모리에는 모든 색상에 대한 폐기물 플라스틱을 선별하도록 야기하는 코드가 저장될 수 있다. 메모리에는 센서 데이터의 DSP 전처리 모듈을 포함하도록 야기하는 코드가 저장될 수 있다. 메모리에는 신뢰성 있는 데이터 취득을 위한 초분광 센서의 온도 조절 장치인 TEC(Thermoelectric Coole r)를 설계하도록 야기하는 코드가 저장될 수 있다. 메모리에는 GigE 비전 인터페이스와 호환하도록 야기하는 코드가 저장될 수 있다. 메모리에는 고품질 및 고확장성을 위한 플라스틱 분광 데이터를 수집하도록 야기하는 코드가 저장될 수 있 다. 메모리에는 ABS와 PS의 정밀 분류가 가능하도록 야기하는 코드가 저장될 수 있다. 메모리에는 PC+ABS, PPE+SB, PVC+ABS의 혼합 플라스틱을 분류하도록 야기하는 코드가 저장될 수 있다. 메모리에는 수신된 초분광 데이터를 전처리하도록 야기하는 코드가 저장된다. 메모리에는 전처리된 초분광 데이터를 분석하여 유효 파장 대역을 추출하도록 야기하는 코드가 저장된다. 메모리에는 유효 파장 대역에 대응하는 초분광 데이터의 초분광 데이터의 데이터 차원을 축소하도록 야기 하는 코드가 저장된다. 메모리에는 플라스틱에 대한 광대역 스펙트럼의 플라스틱 데이터를 수집하도록 야기하는 코드가 저장된다. 메모리에는 플라스틱 데이터를 전처리하도록 야기하는 코드가 저장된다. 메모리에는 플라스틱 데이터를 입력으로 하고 플라스틱 데이터에 대한 플라스틱 분류 결과를 출력으로 하 는 인공지능 모델을 생성하도록 야기하는 코드가 저장된다. 도 3은 도 1에 도시된 폐기물 재활용 처리 장치가 블랙 플라스틱 선별 장치인 경우의 예를 설명하기 위해 도시 한 도면이다. 도 3을 참조하면, 폐기물 재활용 처리 장치는 블랙 플라스틱을 선별할 수 있다. 폐기물 재활용 처리 장치는 MIR 스펙트럼 데이터를 수집할 수 있다. 여기서, MIR 스펙트럼은 2900 내지 4200nm 일 수 있다. 예컨대, 폐기물 재활용 처리 장치는 블랙 물질의 빛의 흡수 특성을 고려하여 노이즈에 강한 데이터 수집 환경을 구축할 수 있다. 폐기물 재활용 처리 장치는 5mm 크기 이상의 파쇄 플라스틱 데이터를 수집할 수 있다. 폐기물 재활용 처리 장치는 데이터 모델을 위한 빅데이터 구축에 필요한 레이블링을 수행할 수 있다. 폐기물 재활용 처리 장치는 딥러닝 기반의 데이터 분류 모델을 수행할 수 있다. 예컨대, 폐기물 재활용 처리 장치는 물질의 특징을 구별하기 위해 고유한 데이터의 특징 벡터를 추출하도록 전 처리를 수행할 수 있다. 폐기물 재활용 처리 장치는 90%이상의 선별 정확도를 갖는 초분광 인공지능 영상을 분석할 수 있다. 폐기물 재활용 처리 장치는 다양한 재질 및 형태의 파쇄 플라스틱을 선별하기 위한 딥러닝 기반의 학습 모델을 개발할 수 있다. 폐기물 재활용 처리 장치는 검정색 플라스틱 및 난연제 등 첨가 물질을 검출할 수 있다. 폐기물 재활용 처리 장치는 실시간 물질 분류 시스템을 개발할 수 있다. 예컨대, 폐기물 재활용 처리 장치는 실시간 센서 데이터를 수집, 전처리, 추론 분리가 가능한 소프트웨어 및 하 드웨어 모듈의 통합 처리 기술을 제공할 수 있다. 폐기물 재활용 처리 장치는 에어 밸브를 통한 물리적 분리 선별 제어 기술을 제공할 수 있다. 폐기물 재활용 처리 장치는 초분광 카메라, 할로겐 광원 및 에어 이젝터 접목을 통한 시스템을 구성할 수 있다. 폐기물 재활용 처리 장치는 순도 95% 이상의 재생 플라스틱 생산으로 완제품 플라스틱 제품 생산에 즉시 투입이 가능할 수 있다. 도 4는 인공지능 모델 기반의 폐플라스틱 선별의 예를 도시한 도면이다. 도 4를 참조하면, 폐기물 재활용 처리 장치는 인공지능 모델을 기초로 폐플라스틱을 자동으로 선별할 수 있다. 폐기물 재활용 처리 장치는 인공지능 모델을 기초로 폐플라스틱을 자동으로 선별함에 따라, 작업자의 숙련도에 따른 선별 정확도를 개선할 수 있다. 폐기물 재활용 처리 장치는 인공지능 모델을 기초로 폐플라스틱을 자동으로 선별함에 따라, 열악한 작업환경을 개선하고, 연속적인 육체적 노동으로 낮은 작업 효율성을 향상시킬 수 있다. 폐기물 재활용 처리 장치는 인공지능 모델을 통해 파쇄 플라스틱을 선별할 수 있다. 폐기물 재활용 처리 장치는 파쇄 플라스틱을 선별함에 따라 폐기물 플라스틱의 부피를 감소시키고, 처리 프로세 스를 단축시키며, 선별 정확도를 향상시킬 수 있다. 폐기물 재활용 처리 장치는 폐기물 플라스틱의 부피를 감소시킴에 따라 배출 시점에 폐기물 플라스틱을 파쇄하 여 수거시에 부피를 감소시키고 운송의 효율성을 증대시킬 수 있다. 폐기물 재활용 처리 장치는 파쇄 플라스틱을 선별함에 따라 처리 압축 및 1차 선별 과정을 생략하여 처리 프로 세스를 단축할 수 있다. 폐기물 재활용 처리 장치는 다양한 소재가 결합된 플라스틱을 파쇄하여 선별함에 따라 선별의 정확도를 향상시 킬 수 있다. 폐기물 재활용 처리 장치는 재활용 비용을 절감하고, 재생 원료의 품질 및 가격 경쟁력을 향상시킬 수 있다. 도 5는 폐기물 재활용 처리 장치의 구현 예를 도시한 도면이다. 도 5를 참조하면, 폐기물 재활용 처리 장치는 초분광 카메라 및 RGB 카메라와 통신 연결되어, 초분광 카메라를 통해 폐기물 플라스틱의 재질을 인식하고, RGB 카메라를 통해 폐기물 플라스틱의 색을 인식할 수 있다. 폐기물 재활용 처리 장치는 할로겐광원, 분광기, 검출기, 전처리 시스템, AI 게이트웨이, 컨베이어 벨트 및 에 어노즐을 포함할 수 있다. 전처리 시스템은 복합 영상의 데이터를 처리할 수 있다. AI 게이트웨이는 플라스틱별로 고유파형을 분석할 수 있다. 폐기물 재활용 처리 장치는 초고속 매니폴드를 제어할 수 있다. 폐기물 재활용 처리 장치는 초분광 영상 분석을 인공지능 모델(딥러닝 모델)을 통해 추론하여 플라스틱을 정확 하고 신속하게 선별 및 분리할 수 있다. 폐기물 재활용 처리 장치는 최대 256차원의 SWIR 스펙트럼 데이터에서 사물의 정보를 획득할 수 있다. 폐기물 재활용 처리 장치는 복합 고분자 화합물인 다양한 플라스틱의 개발 특징을 추론하여 고속으로 선별할 수 있다. 도 6은 광범위 스펙트럼 데이터의 예를 설명하기 위해 도시한 도면이고, 도 7 및 도 8은 폐기물 재활용 처리 장 치가 카메라 영상 융합 장치인 경우의 예를 설명하기 위해 도시한 도면이다.도 6 내지 도 8을 참조하면, 폐기물 재활용 처리 장치는 RGB 카메라를 통해 사물의 외형 정보를 획득할 수 있다. 여기서, RGB 카메라는 400 내지 800nm의 파장을 가지는 카메라일 수 있다. RGB 카메라는 3밴드를 가질 수 있다. 폐기물 재활용 처리 장치는 NIR 카메라를 이용하여 사물의 외형 정보를 획득할 수 있다. 여기서, NIR 카메라는 초분광 카메라로 900 내지 1700nm의 파장을 가지는 카메라일 수 있다. NIR 카메라는 최대 256 밴드를 가질 수 있다. 폐기물 재활용 처리 장치는 ABS와 PS의 정밀 분류가 가능할 수 있다. 폐기물 재활용 처리 장치는 PC+ABS, PPE+SB, PVC+ABS의 혼합 플라스틱을 분류가 가능할 수 있다. 폐기물 재활용 처리 장치는 블랙 플라스틱을 분할 수 있다. 폐기물 재활용 처리 장치는 400 내지 4200nm 스펙트럼 영역의 데이터를 수신할 수 있다. 이에 따라, 폐기물 재 활용 처리 장치는 모든 색상에 대한 폐기물 플라스틱을 선별할 수 있다. 폐기물 재활용 처리 장치는 센서 데이터의 DSP 전처리 모듈을 포함할 수 있다. 폐기물 재활용 처리 장치는 신뢰성 있는 데이터 취득을 위한 초분광 센서의 온도 조절 장치인 TEC(Thermoelectric Cooler)를 설계할 수 있다. 폐기물 재활용 처리 장치는 GigE 비전 인터페이스와 호환할 수 있다. 폐기물 재활용 처리 장치는 초분광 카메라를 통해 파쇄 플라스틱을 선별할 수 있다. 여기서, 초분광 카메라는 MIR 카메라일 수 있으며, 2900 내지 4200nm의 파장을 가질 수 있다. 도 9는 폐기물 재활용 처리 장치가 데이터 처리 장치인 경우의 예를 설명하기 위해 도시한 도면이다. 도 9를 참조하면, 폐기물 재활용 처리 장치는 수신된 초분광 데이터를 전처리한다. 예컨대, 폐기물 재활용 처리 장치는 미소 교정, 파장 교정, 흑백 교정 및 표준화 중 적어도 하나를 수행하여 전처리를 수행할 수 있다. 폐기물 재활용 처리 장치는 전처리된 초분광 데이터를 분석하여 유효 파장 대역을 추출한다. 예컨대, 폐기 물 재활용 처리 장치는 초분광 빅데이터 분석을 통한 주요 파장 대역을 선정할 수 있다. 폐기물 재활용 처 리 장치는 불필요한 초분광 데이터를 제거할 수 있다. 폐기물 재활용 처리 장치는 유효 파장 대역에 대응하는 초분광 데이터의 초분광 데이터의 데이터 차원을 축소한다. 예컨대, 폐기물 재활용 처리 장치는 주송분 분석을 통한 초분광 데이터의 차원을 축소할 수 있 다. 폐기물 재활용 처리 장치는 광범위의 400 내지 4200nm 영역에서 3차원 스펙트럼 데이터의 특징 데이터를 추출할 수 있다. 도 10은 폐기물 재활용 처리 장치가 데이터 분류 모델 장치인 경우의 예를 설명하기 위해 도시한 도면이다. 폐기물 재활용 처리 장치는 플라스틱에 대한 광대역 스펙트럼의 플라스틱 데이터를 수집한다. 예컨대, 폐기물 재활용 처리 장치는 멀티 센서 데이터를 동기화하고, 데이터를 실시간으로 스트리밍 하며, 실시간으로 저장한다. 폐기물 재활용 처리 장치는 플라스틱 데이터를 전처리한다. 예컨대, 폐기물 재활용 처리 장치는 유효 스펙트럼 의 차원을 축소하고, 실시간 데이터를 저장하며, SQL을 저장한다. 폐기물 재활용 처리 장치는 플라스틱 데이터를 입력으로 하고 플라스틱 데이터에 대한 플라스틱 분류 결과를 출 력으로 하는 인공지능 모델을 생성한다. 예컨대, 폐기물 재활용 처리 장치는 고차원 데이터를 전처리하고, 데이 터 학습 모델을 생성하며, 실시간 추론이 가능하도록 할 수 있다. 폐기물 재활용 처리 장치는 고신뢰성의 선별 정확도와 빠른 처리 속도를 제공하는 플라스틱 선별이 가능할 수 있다. 도 11 내지 도 14는 본 발명의 다른 실시예에 따른 폐기물 재활용 처리 방법의 순서를 도시한 흐름도이다. 이하에서 설명될 폐기물 재활용 처리 방법은 앞서 도 1 내지 도 10을 참조하여 설명한 폐기물 재활용 처리 장치 에 의해 수행될 수 있다. 따라서, 앞서 도 1 내지 도 10을 참조하여 설명한 본 개시의 실시예에 대한 내용은 이 하에서 설명될 실시예에도 동일하게 적용될 수 있으며, 이하에서 상술한 설명과 중복되는 내용은 생략하도록 한 다. 이하에서 설명되는 단계들은 반드시 순서대로 수행되어야 하는 것은 아니고, 단계들의 순서는 다양하게 설 정될 수 있으며, 단계들은 거의 동시에 수행될 수도 있다. 도 11을 참조하면, 폐기물 재활용 처리 방법 중 블랙 플라스틱 분류 방법은 MIR 스펙트럼 데이터 수집 단계 (S110), 인공지능 모델 학습 단계(S120) 및 특징 벡터의 블랙 유무 판단 단계(S130)를 포함한다. MIR 스펙트럼 데이터 수집 단계(S110)는 인공지능 모델을 학습시키기 위한 MIR 스펙트럼 데이터를 수집하는 단 계이다. 인공지능 모델 학습 단계(S120) MIR 스펙트럼 데이터를 입력으로 하여 물질의 특징을 구별하기 위한 특징 벡터 를 추출하는 인공지능 모델을 학습시키는 단계이다. 특징 벡터의 블랙 유무 판단 단계(S130)는 인공지능 모델에 기초하여 입력된 분류 대상 MIR 스펙트럼 데이터의 특징 벡터를 추출하고, 추출된 특징 벡터의 블랙 유무를 판단하는 단계이다. 도 12를 참조하면, 폐기물 재활용 처리 방법 중 영상 데이터 융합 방법은 제1 카메라 영상 데이터 수신 단계 (S210), 제2 카메라 영상 데이터 수신 단계(S220), 제3 카메라 영상 데이터 수신 단계(S230), 제4 카메라 영상 데이터 수신 단계(S240) 및 제1 내지 제4 카메라 영상 데이터 융합 단계(S250)를 포함한다. 제1 카메라 영상 데이터 수신 단계(S210)는 제1 카메라에 대한 영상 데이터를 수신하는 단계이다. 제2 카메라 영상 데이터 수신 단계(S220)는 제1 카메라와 상이한 스펙트럼 영역을 가지는 제2 카메라에 대한 영 상 데이터를 수신하는 단계이다. 제3 카메라 영상 데이터 수신 단계(S230)는 제1 및 제2카메라와 상이한 스펙트럼 영역을 가지는 제3 카메라에 대한 영상 데이터를 수신하는 단계이다. 제4 카메라 영상 데이터 수신 단계(S240)는 제1 내지 제3 카메라와 상이한 스펙트럼 영역을 가지는 제4 카메라 에 대한 영상 데이터를 수신하는 단계이다. 제1 내지 제4 카메라 영상 데이터 융합 단계(S250)는 제1 카메라 내지 제4 카메라 각각에 대한 영상 데이터를 융합하는 단계이다. 도 13을 참조하면, 폐기물 처리 방법 중 데이터 처리 방법은 초분광 데이터 전처리 단계(S310), 유효 파장 대역 추출 단계(S320) 및 초분광 데이터의 데이터 차원 축소 단계(S330)를 포함한다. 초분광 데이터 전처리 단계(S310)는 수신된 초분광 데이터를 전처리하는 단계이다. 유효 파장 대역 추출 단계(S320)는 전처리된 초분광 데이터를 분석하여 유효 파장 대역을 추출하는 단계이다. 초분광 데이터의 데이터 차원 축소 단계(S330)는 유효 파장 대역에 대응하는 초분광 데이터의 초분광 데이터의 데이터 차원을 축소하는 단계이다. 도 14를 참조하면, 폐기물 처리 방법 중 데이터 분류 모델 생성 방법은 플라스틱 데이터 수집 단계(S410), 플라 스틱 데이터 전처리 단계(S420) 및 인공지능 모델 생성 단계(S430)를 포함한다. 플라스틱 데이터 수집 단계(S410)는 플라스틱에 대한 광대역 스펙트럼의 플라스틱 데이터를 수집하는 단계; 플라스틱 데이터 전처리 단계(S420)는 플라스틱 데이터를 전처리하는 단계이다. 인공지능 모델 생성 단계(S430)는 플라스틱 데이터를 입력으로 하고 플라스틱 데이터에 대한 플라스틱 분류 결 과를 출력으로 하는 인공지능 모델을 생성하는 단계이다."}
{"patent_id": "10-2023-0127909", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 상술한 설명을 기초로 본 개시의 기술적 사상이나 필수 적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러 므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해되어야만 한다. 본 개시의 범위는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개 념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다. 본원 의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범 위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0127909", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 폐기물 재활용 처리 장치와 이와 통신 연결된 카메라를 설명하기 위해 도시 한 도면이다. 도 2는 도 1에 도시된 폐기물 재활용 처리 장치의 세부구성을 도시한 도면이다. 도 3은 도 1에 도시된 폐기물 재활용 처리 장치가 블랙 플라스틱 선별 장치인 경우의 예를 설명하기 위해 도시 한 도면이다. 도 4는 인공지능 모델 기반의 폐플라스틱 선별의 예를 도시한 도면이다. 도 5는 폐기물 재활용 처리 장치의 구현 예를 도시한 도면이다. 도 6은 광범위 스펙트럼 데이터의 예를 설명하기 위해 도시한 도면이다. 도 7 및 도 8은 폐기물 재활용 처리 장치가 카메라 영상 융합 장치인 경우의 예를 설명하기 위해 도시한 도면이 다. 도 9는 폐기물 재활용 처리 장치가 데이터 처리 장치인 경우의 예를 설명하기 위해 도시한 도면이다. 도 10은 폐기물 재활용 처리 장치가 데이터 분류 모델 장치인 경우의 예를 설명하기 위해 도시한 도면이다. 도 11 내지 도 14는 본 발명의 다른 실시예에 따른 재활용 처리 방법의 순서를 도시한 흐름도이다."}
