{"patent_id": "10-2022-0065203", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0165460", "출원번호": "10-2022-0065203", "발명의 명칭": "부동산 서비스 견적 중개 플랫폼", "출원인": "백관호", "발명자": "백관호"}}
{"patent_id": "10-2022-0065203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부동산 서비스 견적 정보를 제공받기 위한 문제정보를 입력하는 입력모듈;상기 입력된 문제정보를 분석하고, 관련서비스를 제공할 서비스제공자의 정보를 사용자에게 제공하는 정보모듈;및상기 정보모듈을 통해 선정된 서비스 업체에 대한 사용자 인식 정보를 기준하여 작업 정보를 저장하는 저장모듈을 포함하고,상기 입력모듈에 문제정보를 입력하는 과정에서부터 상기 저장모듈에 작업 정보가 저장되기까지 하번의 서비스요청을 통해서 처리가 이루어지는 부동산 서비스 견적 중개 플랫폼."}
{"patent_id": "10-2022-0065203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 부동산 서비스 견적 정보는 수전수리, 욕실보수, 주방보수, 전기용품, 도어용품, 건물외관, 청소, 이사,간단수리 중 적어도 하나 이상의 서비스를 포함하는 것을 특징으로 하는 부동산 서비스 견적 중개 플랫폼."}
{"patent_id": "10-2022-0065203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 정보모듈은 서비스가 필요한 정보에 대한 인공지능 분석을 통해 실시하는 것을 특징으로 하는 부동산 서비스 견적 중개 플랫폼."}
{"patent_id": "10-2022-0065203", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 저장모듈에는 작업자의 작업영상, 이미지, 사용자의 만족도 중 적어도 하나이상의 정보를 포함하는 것을특징으로 하는 부동산 서비스 견적 중개 플랫폼"}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 의하면, 부동산 서비스 견적 정보를 제공받기 위한 문제정보를 입력하는 입력모듈; 상기 입력된 문제 정보를 분석하고, 관련서비스를 제공할 서비스제공자의 정보를 사용자에게 제공하는 정보모듈; 및 상기 정보모듈 을 통해 선정된 서비스 업체에 대한 사용자 인식 정보를 기준하여 작업 정보를 저장하는 저장모듈을 포함하고, 상기 입력모듈에 문제정보를 입력하는 과정에서부터 상기 저장모듈에 작업 정보가 저장되기까지 하번의 서비스 요청을 통해서 처리가 이루어지는 부동산 서비스 견적 중개 플랫폼이 제공된다."}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 부동산 서비스 견적 중개 플랫폼에 관한 것이며, 보다 구체적으로 인공지능을 통해 수리 부분을 파악 하고 해당 수리 부분에 대한 인근지역의 비교견적을 제시하며 플랫폼에 입점되어 있는 서비스 업체와 부동산 소 유자를 연결시켜주는 중개 플랫폼에 관한 것이다."}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 부동산 소유자 관점에서 건물 내에 수리 또는 이사를 진행하는 데 있어 다양한 문제점이 존재한다. 건물 주인은 해당 건물에 직접 주거하는 경우가 적으며, 주변에 서비스 업체에 대한 정보를 쉽게 접할 수 없는 문제가 있다. 이에 따라, 주로 인근 부동산에 위탁하거나, 서비스 업체를 사용자가 직접 연결하여 위임하는 경우가 대다수이 다. 그러나 이와 같은 경우 작업량, 시간, 비용 등 다양한 견적을 제시받지 못하고 많은 비용을 지불하여 처리 하는 경우가 대다수이다. 공개특허 10-2017-0115219호는, 집을 수리하고자 하는 소비자가 직접 수리 받고자 하는 대상에 대한 정보를 제 공하고, 수리 대상을 수리할 수 있는 서비스 업체를 입찰 받아 선택할 수 있는 집수리 서비스 제공방법 및 시스 템을 개시하고 있다. 다만, 상기 특허는 단발성에 한정되어 있다. 즉, 일정 시간이 경과되거나 다시 서비스를 신청할 필요가 발생되 었을 때, 사용자들은 해당 업체를 찾아야하는 수고를 거쳐야하고, 다시 처음부터 서비스와 관련된 상담을 받아 야 하는 등의 번거로움을 수반해야만 하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 출원번호 제10-2017-0115219호"}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 지역평균비용과 전국평균 수리비용을 비교하여 합리적인 가격제시를 하는 것을 목적으로 한다. 또한, 본 발명은 인공지능을 기반으로 영상, 이미지, 문자를 토대로 예상견적을 제시하는 것을 목적으로 한다. 또한, 본 발명은 주변 서비스 업체의 평가지표를 통해 전문적이며 우수한 서비스 업체를 선정할 수 있도록 정보 를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예는, 부동산 서비스 견적 정보를 제공받기 위한 문제정보를 입력하는 입력모듈; 상기 입력된 문제정보를 분석하고, 관련서비스를 제공할 서비스제공자의 정보를 사용자에게 제공하는 정보모듈; 및 상기 정 보모듈을 통해 선정된 서비스 업체에 대한 사용자 인식 정보를 기준하여 작업 정보를 저장하는 저장모듈을 포함 하고,상기 입력모듈에 문제정보를 입력하는 과정에서부터 상기 저장모듈에 작업 정보가 저장되기까지 하번의 서 비스 요청을 통해서 처리가 이루어지는 부동산 서비스 견적 중개 플랫폼을 제공한다. 또한, 상기 부동산 서비스 견적 정보는 수전수리, 욕실보수, 주방보수, 전기용품, 도어용품, 건물외관, 청소, 이사, 간단수리 중 적어도 하나 이상의 서비스를 포함하는 것을 특징으로 한다. 또한, 상기 정보모듈은 서비스가 필요한 정보에 대한 인공지능 분석을 통해 실시하는 것을 특징으로 한다. 또한, 상기 저장모듈에는 작업자의 작업영상, 이미지, 사용자의 만족도 중 적어도 하나이상의 정보를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 지역평균비용과 전국평균 수리비용을 비교하여 합리적인 가격제시를 할 수 있다. 또한, 본 발명은 인공지능을 기반으로 영상, 이미지, 문자를 토대로 예상견적을 제시할 수 있다. 또한, 본 발명은 주변 서비스 업체의 평가지표를 통해 전문적이며 우수한 서비스 업체를 선정할 수 있도록 정보 를 제공할 수 있다."}
{"patent_id": "10-2022-0065203", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면에 의거하여 본 발명에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용 이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기 에서 설명하는 실시예에 한정되지 않는다. 본 발명을 명확하게 설명하기 위해서는 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성요소에 대해서는 동일한 참조 부호를 붙이도록 한다. 이하 첨부된 도면을 참조하면서 본 발명에 따른 실시예를 상세히 설명하기로 한다. 도 1는 본 발명의 일 실시예에 따른 부동산 서비스 견적 중개 플랫폼의 구성도를 도시하고 있다. 본 발명의 일 실시예에 따른 부동산 서비스 견적 중개 플랫폼은 입력모듈을 포함한다. 상기 입력모듈은 사용자로부터 스마트폰, 스마트기기 등과 연결되며, 사용자의 수리 견적 요청에 따른 문 제정보를 입력받을 수 있다. 상기 문제 정보는 사용자가 서비스 견적 요청을 필요로 하는 정보이다. 즉, 사용자가 건물 내에 필요한 수리, 보수, 청소 중 적어도 하나 이상의 서비스에 필요한 정보이다. 상기 문제 정보를 입력하는 과정은, 영상입력, 사진입력, 음성입력, 문자입력 중 적어도 하나 이상의 과정을 통 해서 문제정보를 입력할 수 있도록 구성한다. 상기 영상입력의 경우, 문제가 발생된 부분을 사용자가 동영상으로 촬영해서 상기 입력모듈에 업로드 할 수 있다. 상기 사진입력의 경우, 문제가 발생된 부분을 사용자가 사진으로 촬영하고, 상기 입력모듈에 업로드 할 수 있다. 상기 문자입력의 경우 문제가 발생된 설비에 대해서 개략적인 정보를 문자로 구성하여 상기 입력모듈에 업 로드 할 수 있다. 상기 음성입력의 경우 사용자가 설비의 문제점을 음성 녹음하고, 상기 입력모듈에 업로드 할 수 있다. 또한, 본 발명의 부동산 서비스 견적 중개 플랫폼은 정보모듈을 포함한다. 상기 정보모듈은 상기 입력모듈을 통해서 입력된 문제 정보를 인공지능을 통해 분석한다. 그리고 본 발명의 부동산 서비스 견적 중개 플랫폼에서 저장된 서비스업체에서 진행한 문제해결상황에서 발생되는 작업량, 시간, 비용 중 적어도 하나 이상의 정보를 제공할 수 있다. 예컨대, 욕실의 타일 교체에 대해 상기 입력모듈에서 문제정보를 입력받게되면, 정보모듈은 사용자 주변 서비스 업체에서 기존에 상기 욕실의 타일 교체를 진행한 작업량, 시간, 비용 등에 대한 정보를 사용자에 게 제공할 수 있다. 상기 서비스 업체는 본 발명에 따른 부동산 서비스 견적 중개 플랫폼에 등록된 업체로, 전문적 경력자가 복수 로 근무하고 있으며, 주변 부동산과 연계되어 있는 업체로 사용자가 거주하는 건물의 집주인, 부동산의 인증을 받은 업체로 구성된다. 상기 사용자에게 제공되는 서비스 업체 관련 정보는 방문시간, 방문목적, 수리서비스 제공자 사진, 수리 서비스 제공자 전화번호, 서비스 요금 등이 포함될 수 있다. 상기 서비스 요금은 서비스를 진행하는 과정에서 추가 금액이 발생될 수 있는 특징이 있다. 상기 정보모듈에서 제공한 서비스 업체 관련 정보를 확인하고, 방문일정 전 서비스 업체 교체 등을 요구할 수 도 있다. 상기 정보모듈에서 서비스 업체가 사용자의 집을 방문할 때, 방문 알림 문자를 사용자에게 제공할 수 있다. 즉, 본 발명의 부동산 서비스 견적 중개 플랫폼은, 플랫폼에서 사용자가 직접 서비스 수행에 필요한 정보를 제 공하는 구성을 통해서 서비스제공자의 신원보증 및 무리한 이용요금 등의 문제를 해결한다. 본 발명의 부동산 서비스 견적 중개 플랫폼은 사용자가 비교견적을 통해 직접 서비스업체와 연결되어 제공되는 서비스 플랫폼으로 종래 특허와는 차별성이 있다.따라서 본 발명의 부동산 서비스 견적 중개 플랫폼은 건물 내에서 발생할 수 있는 모든 생활편의서비스를 제공 할 수 있는 서비스 제공자를 다수 구성하고, 상기 서비스제공자에 대한 인증, 교육 등을 수행할 수 있다. 본 발명의 부동산 서비스 견적 중개 플랫폼은 저장모듈을 포함한다. 상기 저장모듈은 서비스 제공자가 작업을 수행하고 촬영된 이미지 또는 영상정보를 저장하고, 사용자가 서 비스제공자에 대한 후기 정보를 입력할 시 이에 대한 내용을 저장할 수 있다. 사용자 중심에서 서비스를 제공받은 정도에 만족도가 다를 수 있기 때문에, 시행된 서비스에 대한 사후관리의 차원에서 일정기간 수리사례를 저장하고, 이를 보증할 수 있도록 한다. 도3은 본 발명에 따른 부동산 서비스 견적 중개 플랫폼의 동작 과정도를 도시하고 있다. 사용자는 생활편의서비스를 필요로 할 때, 부동산 서비스 견적 중개 플랫폼에 접속하고, 입력모듈에 문제 정보를 입력한다(S100). 상기 문제정보 입력은 영상입력, 사진입력, 문자입력, 음성입력 중 적어도 하나이상의 방법을 통해서 이루어진 다. 정보모듈은 상기 입력모듈을 통해서 입력된 문제정보를 인공지능 분석을 통해 분석한다(S110). 상기 문제정보 분석은, 도2에 도시하고 있는 바와 같이, 생활편의서비스에 구분된 카테고리와 규정된 매뉴얼에 따라서 순차적으로 이루어지고, 상기 문제정보의 분석 결과에 따라 사용자에게 서비스 견적이 결정되어진다 (S120). 상기 결정된 서비스 견적과 관련된 정보들은 사용자에게 보여지게 된다(S130). 사용자는 전송받은 상기 정보를 통해서 인근 서비스제공자의 수리요금, 작업양, 시간 등 적어도 하나 이상의 정 보에 대하여 확인하고, 추가적인 사항을 더 요구할 수도 있고, 이용한 서비스에 대한 교체를 요구할 수 도 있다. 이 경우 서비스 제공자, 실제 건물에 방문할 시간, 서비스에 이용될 부품 등의 교체가 가능한다(S140). 상기 부동산 서비스 견적 중개 플랫폼과 사용자간의 맞춤 서비스 제공에 의해서 충분한 조절이 이루어지면, 정 보모듈은 확정된 정보를 사용자에게 전송한다(S150). 최종 확정된 이용정보는 서비스제공자의 사진, 경력사항, 방문시간, 요금, 사용부품 등 이용한 서비스에 관한 전체적인 정보가 사용자에게 제공된다. 상기의 과정을 통해서 부동산 서비스 중개 플랫폼과 사용자간의 맞춤 서비스 제공을 위한 구매정보가 확정될 수 있다. 본 발명은 도면에 도시된 실시예를 참고로 설명되었으나 이는 예시적인 것에 불과하며, 본 기술 분야의 통상 지 식을 가진 자라면 이로부터 다양한 변형 및 균등한 다른 실시예가 가능하다는 점을 이해할 것이다. 따라서 본 발명의 진정한 기술적 보호 범위는 첨부된 특허등록청구범위의 기술적 사상에 의하여 정해져야 할 것이다."}
{"patent_id": "10-2022-0065203", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1은 본 발명의 일 실시예에 따른 부동산 서비스 견적 중개 플랫폼의 구성도를 도시한다. 도2는 본 발명의 일 실시예에 따른 부동산 서비스 견적 중개 플랫폼의 서비스 제공을 위한 세분화된 구성도이다. 도3은 본 발명의 일 실시예에 따른 부동산 서비스 견적 중개 플랫폼의 동작 과정도이다."}
