{"patent_id": "10-2021-0192532", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0102423", "출원번호": "10-2021-0192532", "발명의 명칭": "인공지능AI 젖병", "출원인": "주식회사 베이비드림", "발명자": "박주성"}}
{"patent_id": "10-2021-0192532", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "내부에 액체를 수용하는 젖병몸체;내주면이 상기 젖병몸체의 상단에 탈착가능하게 결합되는 결합링; 및상기 젖병몸체와 상기 결합링 사이에 배치되는 젖꼭지를 포함하고,상기 젖꼭지는,원기둥의 형상을 갖는 본체부;상기 본체부의 외주면을 둘러싸는 디스크 형상을 가지고, 상기 본체부의 하단에 결합되며, 서로 대향하도록 배치된 복수의 통공들을 포함하는 플랜지부; 및상기 본체부의 상단에 배치되며, 연성이 있는 소정의 물질을 포함하는 돌기부를 포함하고,복수의 통공들이 액체에 의해 잠기지 않은 상태에서 상기 돌기부가 압착되는 경우, 상기 돌기부가 수축하여 상기 본체부 방향으로 함입되는 인공지능 젖병."}
{"patent_id": "10-2021-0192532", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 본체부를 상기 플랜지부와 나란한 방향으로 절단한 단면이 가지는 제1 면적은 상기 돌기부를 상기 플랜지부와 나란한 방향으로 절단한 단면이 가지는 제2 면적보다 큰 인공지능 젖병."}
{"patent_id": "10-2021-0192532", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2 항에 있어서,투명한 물질을 포함하는 뚜껑을 더 포함하는 인공지능 젖병."}
{"patent_id": "10-2021-0192532", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3 항에 있어서,상기 돌기부가 소정의 압력 이상으로 압착되는 경우, 복수의 통공들이 액체에 의해 잠겼는지 여부와 관계없이상기 돌기부가 수축하여 상기 본체부 방향으로 함입되는 인공지능 젖병."}
{"patent_id": "10-2021-0192532", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 소정의 물질은 실리콘, PETG(Polyethylene Terephthalate Glycol) 고무, 라텍스, 및 ASA(AcrylonitrileButadiene Styrene) 중 적어도 어느 하나를 포함하는 인공지능 젖병."}
{"patent_id": "10-2021-0192532", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서,젖병몸체는 PES(Polyether Sulfone), PPSU(PolyPhenylSUlfone), PP(PolyPropylene), 스테인리스, 실리콘, 및유리 중 적어도 어느 하나를 포함하는 인공지능 젖병."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "인공지능 젖병은 물리적 인공지능 기술이 적용된 것으로서, 인공지능 젖병 스스로가 아이가 깨무는 압력, 젖병몸 체 내부의 분유 잔량, 젖병몸체 내부 분유 및 공기의 비율 등등을 감지하여, 돌기부의 상태 및 형상을 변화시킨 다. 즉, 아이가 깨무는 압력이 기준 이상이거나, 젖병몸체 내부의 분유잔량이 기준 이하일 때, 돌기부는 젖병몸 체 방향으로 수축되어 함입된다. 따라서, 아이가 분유 대신 공기를 흡입하여, 배에 가스가 차는 현상(배앓이)을 방지한다. 또한, 보호자는 아이의 트림을 유도하지 않아도 되므로, 젖병의 사용성이 개선된다. 또한, 수유시 아 이의 침샘과 돌기부 끝이 중첩되게 배치되어, 분유와 소화액(침)이 적절히 혼합된다. 또한 돌기부의 길이가 어머 니의 유두와 동일하게 설계되어, 돌기부에 의한 목젖 자극과 이에 따른 구토가 예방된다. 뿐만 아니라, 수유 중 에도 통공을 통해 젖병 내부로 공기가 유입되므로, 지나친 압력에 의한 중이염이 예방된다."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 인공지능(AI)이 적용된 젖병에 관한 것으로, 구체적으로는 젖병 스스로 능동적으로 수유 중 위험(해 로운) 순간 반응하도록 하여 수유 중 발생할 수 있는 부작용과 배앓이, 구토, 성장발육, 중이염 등 최소화에 개 발초점을 둔 전자학적 방식과 달리 물리학적, 양리학적 AI 기술은 젖병의 내부 Air 와 H2o 압력 과 정밀한 작동 부 (센서기능)배앓이 원인시에만 감지 작동되도록 발명한 세계 최초 세계 유일무이(唯一無二) 한 세계적인 독보 적인 기술의 전자장치 없이도 감지 작동할 수 있도록해 세계인류 와 아기 건강과 세계 최초 물리학적 AI 기술발 전에 큰 의미를 두며 똑똑한 인공지능(AI) 젖병에 관한 특허 발명인 것이다."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "혼합수유란 젖먹이에게 모유와 분유를 섞여서 먹이는 것을 의미하며, 일반적으로 아직 치아가 발육되지 않은 신 생아 또는 생후 24개월 내외의 영, 유아를 젖먹이라 지칭한다. 일반적으로 젖먹이들을 대상으로, 모유수유 또는 젖병을 이용한 혼합수유 방식으로 수유가 이루어지고 있다. 그러나, 젖병을 이용한 혼합수유 방식으로 수유하는 경우, 첫째, 아이가 젖병에 포함된 헛공기를 들이마시고 이것이 배앓이로 이어지는 문제점이 있다. 둘째, 아기가 젖꼭지가 엄마 젖 가슴과 느낌이 달라, 아이가 젖병을 거부하는 문제점이 있다. 셋째, 수유중 젖병의 젖꼭지의 끝단부가 아이의 침샘과 일치하지 않아, 소화액 영양소 흡수율이 낮은 문제점이 있다. 넷째, 수유중 젖병의 젖꼭지의 끝단부가 아이의 목젖 자극하여, 아이의 구토를 유발하고, 고통을 느낄 수 있다 는 문제점이 있다."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 종래의 문제점을 해결하기 위한 것으로, 아이가 배앓이 원인 헛공기를 먹는 즉시 젖병의 꼭지가 스스로 거북이가 위험순간 목을 들어가는 것처럼 젖병 내부로 함입되도록 특수 설계되어, 아이가 헛공기 를 흡입하는 것을 방지하므로, 아이의 배앓이를 예방하고, 보호자는 아이의 트림을 유도하지 않아도 되어 사용 성이 개선된 인공지능 젖병을 제공 인공지능 젖병을 제공하는 것을 목적으로 한다. 또한, 본 발명은 수유시 젖병의 젖꼭지 끝단부가 아이의 침샘에 배치될 수 있는 구조(침샘일치 System)로 설계 되어, 아이의 분유(영양소) 섭취, 성장발육, EQ발달, 및 IQ발달에 미치는 영향 돕는 인공지능 젖병을 제공하는 것을 목적으로 한다. 또한, 본 발명은 아이가 젖병의 꼭지를 무는 힘에 따라 젖병의 꼭지가 젖병 내부방향으로 함입되므로, 양육자가 이를 통해 젖병의 교체시기를 인지할 수 있어 사용성 및 위생성이 개선된 인공지능 젖병을 제공할 수 있다."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 인공지능 젖병은 젖병몸체, 결합링, 젖꼭지를 포함할 수 있다. 젖병몸체는 내부에 액체를 수용할 수 있다. 결합링의 내주면은 상기 젖병몸체의 상단에 탈착가능하게 결합될 수 있다. 젖꼭지는 상기 젖병몸체와 상기 결합링 사이에 배치될 수 있다. 상기 젖꼭지는 본체부, 플랜지부, 돌기부를 포함할 수 있다. 본체부는 원기둥의 형상을 가질 수 있다. 플랜지부는 상기 본체부의 외주면을 둘러싸는 디스크 형상을 가질 수 있다. 플랜지부는 상기 본체부의 하단에 결합될 수 있다. 플랜지부는 서로 대향하도록 배치된 복수의 통공들을 포함할 수 있다. 돌기부는 본체부의 상단에 배치될 수 있다. 돌기부는, 연성이 있는 소정의 물질을 포함할 수 있다. 복수의 통공들이 액체에 의해 잠기지 않은 상태에서 상기 돌기부가 압착되는 경우, 상기 돌기부가 수축하여 상 기 본체부 방향으로 함입될 수 있다.본 발명의 일 실시예에 따른 인공지능 젖병에서, 상기 본체부를 상기 플랜지부와 나란한 방향으로 절단한 단면 이 가지는 제1 면적은 상기 돌기부를 상기 플랜지부와 나란한 방향으로 절단한 단면이 가지는 제2 면적보다 클 수 있다. 본 발명의 일 실시예에 따른 인공지능 젖병은 투명한 물질을 포함하는 뚜껑을 더 포함할 수 있다. 본 발명의 일 실시예에 따른 인공지능 젖병의 상기 돌기부가 소정의 압력 이상으로 압착되는 경우, 복수의 통공 들이 액체에 의해 잠겼는지 여부와 관계없이 상기 돌기부가 수축하여 상기 본체부 방향으로 함입될 수 있다. 본 발명의 일 실시예에 따른 인공지능 젖병의 상기 소정의 물질은 실리콘, PETG(Polyethylene Terephthalate Glycol), 고무, 라텍스, 및 ASA(Acrylonitrile Butadiene Styrene) 중 적어도 어느 하나를 포함할 수 있다. 본 발명의 일 실시예에 따른 인공지능 젖병의 젖병몸체는 PES(Polyether Sulfone), PPSU(PolyPhenylSUlfone), PP(PolyPropylene), 스테인리스, 실리콘, 및 유리 중 적어도 어느 하나를 포함할 수 있다."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예에 따르면, 아이가 헛공기를 먹는 즉시 젖병의 꼭지가 스스로 거북이가 위험순간 목을 들어 가는 것처럼 젖병 내부로 함입되도록 특수 설계되어, 아이가 헛공기를 흡입하는 것을 방지하므로, 아이의 배앓 이를 예방하고, 보호자는 아이의 트림을 유도하지 않아도 되어 사용성이 개선된 인공지능 젖병을 제공 인공지능 젖병을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 수유시 젖병의 젖꼭지 끝단부가 아이의 침샘에 배치될 수 있는 구조(침샘일치 System)로 설계되어, 아이의 분유(영양소) 섭취, 성장발육, EQ발달, 및 IQ발달에 미치는 영향 돕는 인공지능 젖 병을 제공할 수 있다. 본 발명의 일 실시예에 따르면, 아이가 젖병의 꼭지를 무는 힘에 따라 젖병의 꼭지가 젖병 내부방향으로 함입되 므로, 양육자가 이를 통해 젖병의 교체시기를 인지할 수 있어 사용성 및 위생성이 개선된 인공지능 젖병을 제공 할 수 있다."}
{"patent_id": "10-2021-0192532", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면들을 참조하여 본 발명의 바람직한 실시예를 보다 상세하게 설명한다. 도면들에 있어서, 구성요소들의 비율 및 치수는 기술적 내용의 효과적인 설명을 위해 과장된 것일 수 있다. \"포함하다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 도 1은 본 발명의 일 실시예에 따른 인공지능 젖병의 분해사시도를 예시적으로 도시한 것이다. 도 2 및 도 3은 도 1에 도시된 인공지능 젖병의 젖꼭지의 모습을 확대하여 도시한 것이다. 도 1 내지 도 3를 참조하면, 본 실시예에 따른 인공지능 젖병은 젖병몸체, 젖꼭지, 및 결합링(3 0)을 포함할 수 있다. 젖병몸체는 액체를 수용할 수 있다. 액체는 우유, 분유, 및 모유 중 적어도 어느 하나일 수 있다. 본 발명 의 일 실시예에서, 젖병몸체는 일부가 내부 방향으로 라운드지게 형성된 원통형일 수 있다. 일부가 내부 방 향으로 라운드지므로, 사용자는 해당 부분을 이용하여 손쉽게 파지할 수 있다. 젖병몸체는 PES(Polyether Sulfone), PPSU(PolyPhenylSUlfone), PP(PolyPropylene), 스테인리스, 실리콘, 및 유리 중 적어도 어느 하나를 포함할 수 있다.결합링의 내주면은 젖병몸체의 상단에 탈착가능하게 결합될 수 있다. 결합링은 젖병몸체 및 젖 꼭지를 서로 고정시킬 수 있다. 젖꼭지는 수유 대상인 유아가 입에 물고, 상기 액체를 섭취하는데 사용될 수 있다. 젖꼭지는 젖병몸체 와 결합링 사이에 배치될 수 있다. 즉, 젖꼭지는 결합링에 의해 젖병몸체에 고정될 수 있 다. 젖꼭지는 본체부, 플랜지부, 및 돌기부를 포함할 수 있다. 본체부는 원기둥의 형상을 가질 수 있다. 본체부를 플랜지부와 나란한 방향으로 절단한 단면의 면 적을 제1 면적이라고 정의한다. 돌기부를 플랜지부와 나란한 방향으로 절단한 단면의 면적을 제2 면적 이라고 정의한다. 본 실시 예에서 제1 면적은 제2 면적보다 클 수 있다. 본 발명의 다른 실시예에서, 제1 면적 과 제2 면적의 비는 1:4일 수 있다. 일반적으로 보호자는 아이의 입을 돌기부에 대응시킨 채로 수유할 수 있다. 본체부와 돌기부의 구 분이 명확하지 않은 경우, 돌기부가 아이의 구강 내부로 지나치게 진입하여 아이의 목젖을 자극하고, 구토 를 유발할 수 있다. 반면 본 발명의 실시예에 따른 본체부 및 돌기부 각각의 둘레길이의 비는 1:2로, 본체부의 둘레 및 돌기부의 둘레는 서로 현격한 차이가 있다. 따라서, 보호자가 돌기부를 아이의 구강 내부로 지나치게 진입시키는 부주의가 사전에 예방될 수 있다. 플랜지부는 본체부의 외주면을 둘러싸는 디스크 형상을 가질 수 있다. 플랜지부는 본체부의 하 단에 결합될 수 있다. 플랜지부는 서로 대향하도록 배치된 복수의 통공들을 포함할 수 있다. 본 실시예 에서, 통공은 2개일 수 있다. 본 발명의 실시예에 따르면, 통공을 통해 외부에서 젖병몸체 내부로 공기가 유입될 수 있다. 수유시 아 이가 과도한 힘으로 돌기부를 빨더라도, 통공을 통해 공기가 유입되어 젖병몸체 내부에 형성되는 음압이 적절히 해소될 수 있다. 따라서, 아이가 과도한 힘으로 돌기부를 빨아서 발생하는 중이염이 사전에 예방될 수 있다. 돌기부는 상기 유아가 액체를 섭취하기 위해 직접 구강에 접촉하는 부분일 수 있다. 돌기부는 본체부 의 상단에 배치될 수 있다. 돌기부는 연성이 있는 소정의 물질을 포함할 수 있다. 본 실시예에서 소정 의 물질은 실리콘, PETG(Polyethylene Terephthalate Glycol), 고무, 라텍스, 및 ASA(Acrylonitrile Butadiene Styrene) 중 적어도 어느 하나일 수 있다. 그러나, 이에 제한되는 것은 아니다. 돌기부는 수유시 돌기부의 높이는 소정의 값으로 설계될 수 있다. 본 실시예에서, 소정의 값은 10mm일 수 있다. 돌기부 높이는 돌기부가 아이의 침샘과 중첩되게 배치되며, 아이의 목적을 자극하지 않는 길 이일 수 있다. 따라서, 수유시에 액체와 침샘에서 나오는 소화액이 적절히 배합되어 아이의 소화가 촉진될 수 있다. 또한 본 발명의 실시예에 따른 돌기부는 아이의 목젖을 자극하지 않으므로, 수유 중 발생하는 목젖 자극 및 이로 인한 구토가 예방될 수 있다. 또한 본 발명에 따른 인공지능 젖병을 이용하여 수유하면, 아이의 영양섭취가 촉진되고, 아이의 IQ 및 EQ가 발달하는 효과가 있다. 도 4는 도 2에 도시된 젖꼭지의 돌기부의 형상변화를 도시한 것이다. 도 4를 참조하면, 평상시 돌기부 는 본체부에서 멀어지는 방향으로 돌출된 상태(AA)를 유지할 수 있다. 이 때, 상기 유아는 돌기부 를 입에 문 상태로 액체를 흡입할 수 있다. 돌기부가 수축하면 본체부에 가까워지는 방향으로 함입되는 상태(BB)로 변형된다. 이 때, 상기 유아는 돌기부를 입에 물 수 없는 상태가 된다. 젖병몸체 내부에 수용된 액체에 의해 복수의 통공들이 잠겨있는 경우, 돌기부는 돌출된 상태(AA)를 유지할 수 있다. 그러나, 젖병몸체 내부에 수용된 액체의 양이 부족하거나 없어서, 액체에 의해 복수의 통 공들이 잠겨 있지 않는 경우, 돌기부가 압착되면 돌기부는 수축하여 본체부에 가까워지는 방향 으로 함입되는 상태(BB)로 변형될 수 있다. 즉, 젖병몸체 내부에 분유가 부족할 때, 아이가 돌기부를 깨물면, 돌기부는 수축하여 함입되어 아 이가 분유 대신 공기를 흡입하는 것을 방지한다. 따라서, 아이가 분유 대신 공기를 흡입하여 발생하는 배앓이 현상이 예방될 수 있다. 또한, 보호자는 아이의 트림을 유도하지 않아도 되므로, 젖병의 사용성이 개선된다. 일반적으로 아이가 돌기부를 빠는 힘은 아이의 성장에 비례하여 증대된다. 따라서, 아이의 성장속도에 맞춰 인공지능 젖병의 돌기부를 바꾸어 주는 것이 중요하다. 본 실시예에서, 돌기부는 소정의 압력 이 상으로 압착되는 경우, 복수의 통공들이 액체에 의해 잠겼는지 여부와 관계없이 수축되어 본체부 방향 으로 함입될 수 있다. 따라서, 보호자는 돌기부의 수축을 통해 아이의 성장을 인지하고, 기존의 젖병을 아이의 성장상태에 적합한 젖병으로 교체할 수 있다. 구체적으로, 돌기부는 물리적 AI기술이 적용된 첨단소재 일 수 있다. 즉, 돌기부는 아이가 깨무는 압력, 젖병몸체 내부의 분유 잔량, 젖병몸체 내부 분유 및 공기의 비율 등등을 감지하여, 돌출된 상태 (AA) 또는 함입되는 상태(BB)로 상태가 변할 수 있다. 본 발명의 일 실시예에서, 인공지능 젖병은 뚜껑을 더 포함할 수 있다. 뚜껑의 내주면은 결합링 의 외주면과 접하여 결합될 수 있다. 뚜껑은 투명한 물질을 포함할 수 있다. 따라서, 사용자는 뚜껑 을 제거하지 않고도, 내부의 구성품들의 위생상태나 훼손여부를 파악할 수 있다. 또한 외부로부터의 이물질 유입을 차단하여 각 구성들, 특히 돌기부의 위생상태를 보존할 수 있다. 도 5는 도 2에 도시된 젖꼭지의 통공을 통해 공기가 유입되는 모습을 예시적으로 도시한 것이다. 도 5 에 도시된 바와 같이, 수유 중 통공을 통해 젖병몸체 내부로 공기가 유입될 수 있다. 이에 따라, 아이 가 돌기부를 빨며 발생할 수 있는 음압이 적정한 수준으로 해소될 수 있다. 따라서 아이가 돌기부를 지 나친 압력으로 빠는 경우 발생할 수 있는 중이염이 사전에 예방될 수 있다. 실시 예를 참조하여 설명하였지만, 해당 기술 분야의 숙련된 당업자는 하기의 특허 청구의 범위에 기재된 본 발 명의 사상 및 영역으로부터 벗어나지 않는 범위 내에서 본 발명을 다양하게 수정 및 변경시킬 수 있음을 이해할 수 있을 것이다. 또한 본 발명에 개시된 실시 예는 본 발명의 기술 사상을 한정하기 위한 것이 아니고, 하기의 특허 청구의 범위 및 그와 동등한 범위 내에 있는 모든 기술 사상은 본 발명의 권리범위에 포함되는 것으로 해 석되어야 할 것이다."}
{"patent_id": "10-2021-0192532", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 인공지능 젖병의 분해사시도를 예시적으로 도시한 것이다. 도 2 및 도 3은 도 1에 도시된 인공지능 젖병의 젖꼭지의 모습을 확대하여 도시한 것이다. 도 4은 도 2에 도시된 젖꼭지의 돌기부의 형상변화를 도시한 것이다. 도 5는 도 2에 도시된 젖꼭지의 통공을 통해 공기가 유입되는 모습을 예시적으로 도시한 것이다."}
