{"patent_id": "10-2023-0055455", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0062517", "출원번호": "10-2023-0055455", "발명의 명칭": "전자 장치 및 전자 장치에서의 노티피케이션 처리 방법", "출원인": "삼성전자주식회사", "발명자": "이호영"}}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,터치스크린 디스플레이, 및적어도 하나의 프로세서를 포함하고, 상기 적어도 하나의 프로세서는, 상기 터치스크린 디스플레이를 통해, 복수의 아이콘들과 플로팅 객체를 포함하는 제1 화면을 디스플레이 하고,상기 플로팅 객체를 상기 복수의 아이콘들 중 하나의 아이콘을 중첩하는 위치에서 디스플레이 가능하고, 상기 터치스크린 디스플레이를 통해, 상기 복수의 아이콘들 및 상기 플로팅 객체가 상기 제1 화면 상에 디스플레이 되고 있는 동안에, 상기 제1 화면에 대한 제1 사용자 입력을 수신하고, 성가 제1 사용자 입력에 기반하여, 상기 터치스크린 디스플레이를 통해, 상기 제1 화면과는 상이한 제2 화면을디스플레이 하고, 상기 제2 화면은 복수의 객체들을 포함하는 가상 키패드를 포함하고, 상기 플로팅 객체는 문자 입력에 사용되는 상기 복수의 객체들 중 적어도 하나의 객체를 지정된 위치에서 일시적으로 중첩하고, 상기 지정된 위치가 상기 가상 키패드의 제1 영역에 대응함에 기반하여, 상기 제2 화면 상에서, 상기 지정된 위치로부터 상기 지정된 위치보다 상기 터치스크린 디스플레이의 제1 모서리에 더 가까운 제1 미리 지정된 위치로상기 플로팅 객체를 이동하여 디스플레이 하고, 상기 제1 미리 지정된 위치는 상기 가상 키패드의 상기 복수의객체들을 중첩하지 않는 위치를 포함하고, 상기 지정된 위치가 상기 가상 키패드의 상기 제1 영역과는 상이한 제2 영역에 대응함에 기반하여, 상기 제2 화면 상에서, 상기 지정된 위치로부터 상기 지정된 위치보다 상기 터치스크린 디스플레이의 제2 모서리에 더 가까운 제2 미리 지정된 위치로 상기 플로팅 객체를 이동하여 디스플레이 하도록 설정되고, 상기 제2 미리 지정된위치는 상기 가상 키패드의 상기 복수의 객체들을 중첩하지 않는 위치를 포함하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 플로팅 객체의 투명도는 미리 지정된 시간이 경과한 후에 변경되는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 제1 미리 결정된 위치 및 상기 제2 미리 결정된 위치는 서로 다른 위치인 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 적어도 하나의 프로세서는, 상기 플로팅 객체에 대한 제3 사용자 입력에 기반하여 상기 제1 미리 지정된위치에서 적어도 하나의 아이템을 디스플레이 하도록 더 설정된 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2023-0062517-3-제1항에 있어서, 상기 적어도 하나의 프로세서는, 제2 사용자 입력 없이 상기 플로팅 객체를 상기 지정된 위치에서 상기 제1 미리 지정된 위치로 이동하여 디스플레이 하도록 더 설정된 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서, 상기 적어도 하나의 아이템은 상기 가상 키패드의 적어도 일부와 오버랩하는 것을 특징으로 하는, 전자 장치."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "전자 장치를 제어하는 방법에 있어서,상기 전자 장치의 터치스크린 디스플레이를 통해, 복수의 아이콘들과 플로팅 객체를 포함하는 제1 화면을 디스플레이 하는 동작과, 상기 플로팅 객체를 상기 복수의 아이콘들 중 하나의 아이콘을 중첩하는 위치에서 디스플레이 가능하고, 상기 터치스크린 디스플레이를 통해, 상기 복수의 아이콘들 및 상기 플로팅 객체가 상기 제1 화면 상에 디스플레이 되고 있는 동안에, 상기 제1 화면에 대한 제1 사용자 입력을 수신하는 동작과, 성가 제1 사용자 입력에 기반하여, 상기 터치스크린 디스플레이를 통해, 상기 제1 화면과는 상이한 제2 화면을디스플레이 하고, 상기 제2 화면은 복수의 객체들을 포함하는 가상 키패드를 포함하고, 상기 플로팅 객체는 문자 입력에 사용되는 상기 복수의 객체들 중 적어도 하나의 객체를 지정된 위치에서 일시적으로 중첩하는동작과, 상기 지정된 위치가 상기 가상 키패드의 제1 영역에 대응함에 기반하여, 상기 제2 화면 상에서, 상기 지정된 위치로부터 상기 지정된 위치보다 상기 터치스크린 디스플레이의 제1 모서리에 더 가까운 제1 미리 지정된 위치로상기 플로팅 객체를 이동하여 디스플레이 하는 동작과, 상기 제1 미리 지정된 위치는 상기 가상 키패드의 상기복수의 객체들을 중첩하지 않는 위치를 포함하고, 상기 지정된 위치가 상기 가상 키패드의 상기 제1 영역과는 상이한 제2 영역에 대응함에 기반하여, 상기 제2 화면 상에서, 상기 지정된 위치로부터 상기 지정된 위치보다 상기 터치스크린 디스플레이의 제2 모서리에 더 가까운 제2 미리 지정된 위치로 상기 플로팅 객체를 이동하여 디스플레이 하는 동작을 포함하고, 상기 제2 미리 지정된 위치는 상기 가상 키패드의 상기 복수의 객체들을 중첩하지 않는 위치를 포함하는 것을 특징으로 하는, 전자 장치를 제어하는 방법."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 플로팅 객체의 투명도는 미리 지정된 시간이 경과한 후에 변경되는 것을 특징으로 하는, 전자 장치를 제어하는 방법."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서, 상기 제1 미리 결정된 위치 및 상기 제2 미리 결정된 위치는 서로 다른 위치인 것을 특징으로 하는, 전자 장치를 제어하는 방법.공개특허 10-2023-0062517-4-청구항 10 제7항에 있어서, 상기 전자 장치를 제어하는 방법은, 상기 플로팅 객체에 대한 제3 사용자 입력에 기반하여 상기 제1 미리 지정된 위치에서 적어도 하나의 아이템을 디스플레이 하도록 더 설정된 것을 특징으로 하는, 전자 장치를 제어하는방법."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서, 상기 전자 장치를 제어하는 방법은, 제2 사용자 입력 없이 상기 플로팅 객체를 상기 지정된 위치에서 상기 제1미리 지정된 위치로 이동하여 디스플레이 하도록 더 설정된 것을 특징으로 하는, 전자 장치를 제어하는 방법."}
{"patent_id": "10-2023-0055455", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 적어도 하나의 아이템은 상기 가상 키패드의 적어도 일부와 오버랩하는 것을 특징으로 하는, 전자 장치를제어하는 방법."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치 및 전자 장치에서의 노티피케이션 처리 방법에 관한 것으로서, 전자 장 치는 화면 상에 적어도 하나의 객체를 표시하는 표시부 및 상기 화면에 표시된 적어도 하나의 객체에 관련된 사 용자의 제스처를 기반으로 상기 화면 상에서 노티피케이션을 표시하기 위한 노티피케이션 표시 영역을 판단하고, 판단된 적어도 하나의 노티피케이션 표시 영역에 상기 노티피케이션이 표시되도록 제어하는 제어부를 포함하여 구성될 수 있다."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시 예들은 전자 장치 및 전자 장치에서의 노티피케이션 처리 방법에 관한 것이다."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 표시부의 화면에 다양한 형태로 객체를 표시할 수 있다. 일반적으로 전자 장치의 표시부의 화면은 복수의 레이어로 구성될 수 있으며, 기본적으로 회색 또는 흰색 계열의 무채색을 바탕으로 하고, 바탕 위에 레 이어 형태의 블록을 구성하여 구성된 블럭에 적어도 하나의 객체를 포함하여 표시할 수 있다. 또한, 객체가 표시된 레이어 상에 새로 발생된 객체를 포함하는 레이어를 겹쳐서 표시할 수 있으며, 화면 상에 객체를 표시하는 레이어의 전체 또는 일 영역을 뒤덮는 광고 등을 다양한 형태로 표시할 수 있다."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "그러나 상기 전자 장치는 화면에 복수의 레이어들이 겹쳐져서 표시되며, 예를 들어, 플로팅 형태로 표시되는 객 체는 오버레이 형태의 위젯, 메신저 대화창, 스티커 메모, 시계 외 다양한 오버레이 형태의 노티피케이션으로서, 화면의 최상위에서 보는 효과를 제공할 수 있다. 때문에 상기 전자 장치의 화면의 최상위에 표시되는 객체는 하단에 깔린 객체를 뒤덮게 되므로 하단 레이어에 표시된 객체를 사용하는데 불편함이 있다. 본 발명의 다양한 실시 예들은, 예를 들면, 전자 장치는 화면에 표시된 적어도 하나의 객체 또는 객체에 관련된 사용자의 제스처를 기반으로 노티피케이션을 처리하기 위한 전자 장치 및 전자 장치에서의 노티피케이션 처리 방법을 제공할 수 있다."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "진술한 과제 또는 다른 과제를 해결하기 위한, 다양한 실시 예 중 어느 하나에 따른 전자 장치가, 화면 상에 적 어도 하나의 객체를 표시하는 표시부; 및 상기 화면에 표시된 적어도 하나의 객체에 관련된 사용자의 제스처를 기반으로 상기 화면 상에서 노티피케이션을 표시하기 위한 노티피케이션 표시 영역을 판단하고, 판단된 적어도하나의 노티피케이션 표시 영역에 상기 노티피케이션이 표시되도록 제어하는 제어부;를 포함할 수 있다. 또한, 다양한 실시 예 중 어느 하나에 따른 전자 장치에서의 노티피케이션의 처리 방법은, 화면 상에 적어도 하 나의 객체를 표시하는 동작; 상기 화면에 표시된 적어도 하나의 객체에 관련된 사용자의 제스처를 기반으로 상 기 화면 상에서 노티피케이션을 표시하기 위한 노티피케이션 표시 영역을 판단하는 동작; 및 판단된 적어도 하 나의 노티피케이션 표시 영역에 상기 노티피케이션을 표시하는 동작;을 포함할 수 있다."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시 예에 따른 전자 장치 및 전자 장치의 동작 방법에 따라, 화면에 표시된 적어도 하나의 객체 또는 객체에 관련된 사용자의 제스처를 기반으로 상기 화면 상에서 판단된 적어도 하나의 노티피케이션 표시 영역에 화면 상에 표시된 객체를 가리지 않도록 노티피케이션을 처리함으로써, 화면 상에 표시된 객체를 용이하게 사용 할 수 있다."}
{"patent_id": "10-2023-0055455", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 그러나 이는 본 문서에 기재된 기술을 특 정한 실시 형태에 대해 한정하려는 것이 아니며, 본 문서의 실시예의 다양한 변경(modifications), 균등물 (equivalents), 및/또는 대체물(alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 본 문서에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 문서에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\" 등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 문서에서 사용된 \"제 1,\" \"제 2,\" \"첫째,\" 또는 \"둘째,\" 등의 표현들은 다양한 구성요소들을, 순서 및/또는 중요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들 을 한정하지 않는다. 예를 들면, 제 1 사용자 기기와 제 2 사용자 기기는, 순서 또는 중요도와 무관하게, 서로 다른 사용자 기기를 나타낼 수 있다. 예를 들면, 본 문서에 기재된 권리 범위를 벗어나지 않으면서 제 1 구성요 소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 바꾸어 명명될 수 있다. 어떤 구성요소(예: 제 1 구성요소)가 다른 구성요소(예: 제 2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결 되어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제 3 구성요소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제 1 구성요소)가 다 른 구성요소(예: 제 2 구성요소)에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있다고 언급된 때에는, 상기 어 떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제 3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 문서에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\" 것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메 모리 장치에 저장된 하나 이상의 소프트웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 본 문서에서 사용된 용어들은 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 다른 실시예의 범위를 한정 하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 문서에 기재된 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 문서에 사용된 용어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으 며, 본 문서에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 문서에서 정의된 용어일지라도 본 문서의 실시예들을 배제하도록 해석될 수 없다. 본 문서의 다양한 실시예들에 따른 전자 장치는, 예를 들면, 스마트폰(smartphone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 영상 전화기, 전자책 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷북 컴퓨터(netbook computer), 워크스테이션 (workstation), 서버, PDA(personal digital assistant), PMP(portable multimedia player), MP3 플레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예에 따르면, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트 렌즈, 또는 머리 착용형 장치(head-mounted-device(HMD)), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드(skin pad) 또는 문신), 또는 생체 이식형(예: implantable circuit) 중 적어도 하나를 포함할 수 있 다. 어떤 실시예들에서, 전자 장치는 가전 제품(home appliance)일 수 있다. 가전 제품은, 예를 들면, 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), 홈 오토매이션 컨트롤 패널(home automation control panel), 보안 컨트롤 패널 (security control panel), TV 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예: XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 다른 실시예에서, 전자 장치는, 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션(navigation) 장치, 위성 항법 시스템 (GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동 차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자 기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 금융 기관의 ATM(automatic teller's machine), 상점의 POS(point of sales), 또는 사물 인터넷 장치(internet of things) (예: 전구, 각종 센서, 전기 또는 가스 미터기, 스프링클러 장치, 화재경보기, 온도조절기(thermostat), 가로등, 토스터(toaster), 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 어떤 실시예에 따르면, 전자 장치는 가구(furniture) 또는 건물/구조물의 일부, 전자 보드(electronic board), 전자 사인 수신 장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측 기기(예: 수도, 전기, 가스, 또는 전파 계측 기기 등) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에서, 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 어떤 실시예에 따른 전자 장치는 플렉서블 전자 장치일 수 있다. 또한, 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않으며, 기술 발전에 따른 새로운 전자 장치를 포함할 수 있다. 이하, 첨부 도면을 참조하여, 다양한 실시 예들에 따른 전자 장치가 설명된다. 본 문서에서, 사용자라는 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭할 수 있다. 도 1을 참조하여, 다양한 실시 예들에서의, 네트워크 환경 내의 전자 장치가 기재된다. 전자 장치 는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 및 통신 인터페이 스를 포함할 수 있다. 어떤 실시예에서는, 전자 장치는, 구성요소들 중 적어도 하나를 생략하거나 다 른 구성요소를 추가적으로 구비할 수 있다. 버스는, 예를 들면, 구성요소들(110-170)을 서로 연결하고, 구성요소들 간의 통신(예: 제어 메시지 및/또 는 데이터)을 전달하는 회로를 포함할 수 있다. 프로세서는, 중앙처리장치(central processing unit(CPU)), 어플리케이션 프로세서(application processor(AP)), 또는 커뮤니케이션 프로세서(communication processor(CP)) 중 하나 또는 그 이상을 포함할 수 있다. 프로세서는, 예를 들면, 전자 장치의 적어도 하나의 다른 구성요소들의 제어 및/또는 통신 에 관한 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 휘발성 및/또는 비휘발성 메모리를 포함할 수 있다. 메모리는, 예를 들면, 전자 장치(10 1)의 적어도 하나의 다른 구성요소에 관계된 명령 또는 데이터를 저장할 수 있다. 한 실시예에 따르면, 메모리 는 소프트웨어 및/또는 프로그램을 저장할 수 있다. 프로그램은, 예를 들면, 커널, 미들웨 어, 어플리케이션 프로그래밍 인터페이스(application programming interface(API)), 및/또는 어플 리케이션 프로그램(또는 \"어플리케이션\") 등을 포함할 수 있다. 커널, 미들웨어, 또는 API(14 5)의 적어도 일부는, 운영 시스템(operating system(OS))으로 지칭될 수 있다. 커널은, 예를 들면, 다른 프로그램들(예: 미들웨어, API, 또는 어플리케이션 프로그램)에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스, 프로세서, 또는 메모리 등)을 제어 또는 관리할 수 있다. 또한, 커널은 미들웨어, API, 또는 어플리케이션 프로 그램에서 전자 장치의 개별 구성요소에 접근함으로써, 시스템 리소스들을 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는, 예를 들면, API 또는 어플리케이션 프로그램이 커널과 통신하여 데이터를 주 고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션 프로그램으로부터 수신된 하나 이상의 작업 요청들을 우선 순위에 따 라 처리할 수 있다. 예를 들면, 미들웨어는 어플리케이션 프로그램 중 적어도 하나에 전자 장치(10 1)의 시스템 리소스(예: 버스, 프로세서, 또는 메모리 등)를 사용할 수 있는 우선 순위를 부여 할 수 있다. 예컨대, 미들웨어는 상기 적어도 하나에 부여된 우선 순위에 따라 상기 하나 이상의 작업 요 청들을 처리함으로써, 상기 하나 이상의 작업 요청들에 대한 스케쥴링 또는 로드 밸런싱 등을 수행할 수 있다. API는, 예를 들면, 어플리케이션이 커널 또는 미들웨어에서 제공되는 기능을 제어하기 위 한 인터페이스로, 예를 들면, 파일 제어, 창 제어, 영상 처리, 또는 문자 제어 등을 위한 적어도 하나의 인터페 이스 또는 함수(예: 명령어)를 포함할 수 있다. 입출력 인터페이스는, 예를 들면, 사용자 또는 다른 외부 기기로부터 입력된 명령 또는 데이터를 전자 장 치의 다른 구성요소(들)에 전달할 수 있는 인터페이스의 역할을 할 수 있다. 또한, 입출력 인터페이스 는 전자 장치의 다른 구성요소(들)로부터 수신된 명령 또는 데이터를 사용자 또는 다른 외부 기기로 출력할 수 있다. 디스플레이는, 예를 들면, 액정 디스플레이(liquid crystal display(LCD)), 발광 다이오드(light- emitting diode(LED)) 디스플레이, 유기 발광 다이오드(organic light-emitting diode(OLED)) 디스플레이, 또 는 마이크로 전자기계 시스템(microelectromechanical systems(MEMS)) 디스플레이, 또는 전자종이(electronic paper) 디스플레이를 포함할 수 있다. 디스플레이는, 예를 들면, 사용자에게 각종 콘텐츠(예: 텍스트, 이 미지, 비디오, 아이콘, 또는 심볼 등)을 디스플레이할 수 있다. 디스플레이는, 터치 스크린을 포함할 수 있으며, 예를 들면, 전자 펜 또는 사용자의 신체의 일부를 이용한 터치, 제스쳐, 근접, 또는 호버링 입력을 수 신할 수 있다. 통신 인터페이스는, 예를 들면, 전자 장치와 외부 장치(예: 제 1 외부 전자 장치, 제2 외부 전 자 장치, 또는 서버) 간의 통신을 설정할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또 는 유선 통신을 통해서 네트워크에 연결되어 외부 장치(예: 제 2 외부 전자 장치 또는 서버)와 통신할 수 있다. 무선 통신은, 예를 들면, 셀룰러 통신 프로토콜로서, 예를 들면, LTE(long-term evolution), LTE-A(LTE Advance), CDMA(code division multiple access), WCDMA(wideband CDMA), UMTS(universal mobile telecommunications system), WiBro(wireless broadband), 또는 GSM(global system for mobile Communications) 등 중 적어도 하나를 사용할 수 있다. 또한, 무선 통신은, 예를 들면, 근거리 통신을 포 함할 수 있다. 근거리 통신은, 예를 들면, WiFi(wireless fidelity), 블루투스(bluetooth), NFC(near field communication), 또는 GNSS(global navigation satellite system) 등 중 적어도 하나를 포함할 수 있다. GNSS는 사용 지역 또는 대역폭 등에 따라, 예를 들면, GPS(global positioning system), Glonass(global navigation satellite system), Beidou navigation satellite system(이하 \"Beidou\") 또는 Galileo, the European global satellite-based navigation system 중 적어도 하나를 포함할 수 있다. 이하, 본 문서에서는, \"GPS\"는 \"GNSS\"와 혼용되어 사용(interchangeably used)될 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard232), 또는 POTS(plain old telephone service) 등 중 적어도 하나를 포함할 수 있다. 네트워크는 통신 네트워크(telecommunications network), 예를 들면, 컴퓨터 네트워크(computer network)(예: LAN 또는 WAN), 인터넷, 또는 전화 망(telephone network) 중 적어도 하나를 포함할 수 있다. 제 1 및 제 2 외부 전자 장치(102, 104) 각각은 전자 장치와 동일한 또는 다른 종류의 장치일 수 있다. 한 실시예에 따르면, 서버는 하나 또는 그 이상의 서버들의 그룹을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 다른 하나 또는 복수의 전자 장치(예: 전자 장치 (102,104), 또는 서버에서 실행될 수 있다. 한 실시예에 따르면, 전자 장치가 어떤 기능이나 서비스 를 자동으로 또는 요청에 의하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시 키는 대신에 또는 추가적으로, 그와 연관된 적어도 일부 기능을 다른 장치(예: 전자 장치(102, 104), 또는 서버 )에게 요청할 수 있다. 다른 전자 장치(예: 전자 장치(102, 104), 또는 서버)는 요청된 기능 또는 추 가 기능을 실행하고, 그 결과를 전자 장치로 전달할 수 있다. 전자 장치는 수신된 결과를 그대로 또 는 추가적으로 처리하여 요청된 기능이나 서비스를 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 이하, 첨부된 도면을 참조하여 다양한 실시 예에 따른 전자 장치에 대해서 살펴본다. 본 발명의 다양한 실시 예들에서 설명되어지는 노티피케이션(notification)은 플로팅(floating), 오버레이 (overlay)(예를 들어, 각종 퀵억세스, 메신저 멀티윈도우, 특수 아이콘, 특수 위젯, 런처 중 적어도 하나) 또는 다른 다양한 표시 형태 중 적어도 하나로 전자 장치의 표시부의 화면에 표시되는 객체를 의미할 수 있다. 상기 노티피케이션은 설정된 시간 동안 검색된 노티피케이션 표시 영역에 표시되었다가 사라지거나, 사용자의 확인 시까지 검색된 노티피케이션 표시 영역에 표시 또는 이동되어 표시될 수 있다. 또한, 본 발명의 다양한 실시 예들에서 설명되어지는 노티피케이션 표시 영역은 표시부의 화면 상에서 노티피케 이션을 표시하기 위해 검색된 영역으로서, 화면에 노출되는 제1 레이어에 표시된 적어도 하나의 객체 또는 사용 자의 제스쳐를 기반으로 상기 표시된 적어도 하나의 객체 또는 주요한 영역을 가리지 않도록 검색된 영역을 의 미할 수 있다. 또한, 본 발명의 다양한 실시 예들에서 설명되어지는 객체는 전자 장치에서 출력되는 다양한 형태의 데이터 또 는 데이터에 관련된 동작(절차, 방법 또는 기능)을 의미할 수 있으며, 예를 들어, 전자 장치의 특정 기능 실행 에 따라 화면 상에 표시되는 다양한 형태의 콘텐츠를 의미할 수 있다. 도 2는 본 발명의 다양한 실시 예에 따른 전자 장치의 구성 예를 나타내는 도면이다. 상기 도 2를 참조하면, 본 발명의 다양한 실시 예에 따르면, 전자 장치(예를 들어, 도 1의 전자 장치)는 제어부, 통신부, 입력부, 저장부 또는 표시부 중 적어도 하나를 포함하여 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 제어부(예를 들어, 도 1의 프로세서)는 전자 장치의 동작 에 따른 정보, 프로그램, 애플리케이션 또는 기능의 실행에 따른 정보를 처리할 수 있으며, 처리된 정보를 표시 부에 디스플레이하거나, 오디오 모듈(도시되지 않음)을 통해 출력하도록 제어할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 제어부는 정보 수집 모듈 또는 정보 처리 모듈을 포 함하여 구성될 수 있다. 상기 정보 수집 모듈은 사용자의 제스처에 관련된 정보 및 화면에 표시된 적어도 하나의 객체에 관련된 정보를 수집할 수 있다. 상기 정보 처리 모듈은 수집된 정보를 처리하거나, 노티피 케이션을 처리하기 위한 동작을 수행할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 제어부는 표시부의 화면에 표시된 적어도 하나의 객체에 관련된 사용자의 제스처를 기반으로 화면 상에서 노티피케이션을 표시하기 위한 노티피케이션 표시 영역을 판단 하고, 판단된 적어도 하나의 노티피케이션 표시 영역에 노티피케이션이 표시되도록 제어할 수 있다. 상기 제어 부는 사용자의 제스처에 관련된 정보 및 화면에 표시된 적어도 하나의 객체에 관련된 정보를 기반으로 노 티피케이션 표시 영역을 판단할 수 있다. 본 발명의 다양한 실시 예들에 따라, 상기 노티피케이션은 첨부된 도 3과 같이, 전자 장치의 표시부의 화면에 오버레이(overlay) 형태로 표시되는 객체(301, 303, 305, 307, 309 또는 311 중 적어도 하나)를 포함할 수 있다. 또한, 노티피게이션은 플로팅(floating) 또는 다른 다양한 표 시 형태 중 적어도 하나로 상기 화면에 표시되는 객체일 수 있다. 상기 오버레이는 예를 들어, 각종 퀵억세스, 메신저 멀티윈도우, 특수 아이콘, 특수 위젯, 런처 중 적어도 하나일 수 있다. 본 발명의 다양한 실시 예들에 따른 상기 제어부는 복수의 레이어들로 이루어지는 화면에서 바탕 레이어 상에 적어도 하나의 객체를 포함하는 객체를 표시하기 위한 레이어(예를 들어, 제1 레이어)를 표시하도록 제어 할 수 있다. 다양한 실시 예에 따라 상기 제어부는 첨부된 도 4의 (a)에 도시된 바와 같이, 제1 레이어 상 의 일 영역에 노티피케이션을 표시하도록 제어할 수 있다. 또한, 다양한 실시 예에 따라 상기 제어부(21 0)는 제1 레이어 상에 노티피케이션을 포함하는 레이어(예를 들어, 제2 레이어)를 오버레이하여 표시하도록 제 어할 수 있다. 예를 들어, 상기 제어부는 첨부된 도 4의 (b)에 도시된 바와 같이, 다수의 노티피케이션 을 화면의 일 영역에 표시할 수 있으며, 제1 레이어 상에 오버레이되는 형태로 노티피케이션을 포함 하는 제2 레이어를 표시하도록 제어할 수 있다. 다양한 실시 예에 따라 상기 제어부는 적어도 하나의 객체를 포함하는 제1 레이어에 발생된 노티피케이션을 합성하여 다시 구성된 제1 레이어를 표시부의 화면 상에 표시하도록 제어할 수 있다. 상기 제어부는 상기 발생된 노티피케이션의 실행 요청 시 대응하는 기능을 제 1 레이어 상에 오버레이되는 형태의 다른 레이어로 표시하도록 제어할 수 있다. 또한, 다양한 실시 예에 따라 상기 제어부는 발생된 노티피케이션을 화면 상에서 적어도 하나의 객체를 표 시하는 영역(예를 들어, 제1 레이어 표시 영역)이 아닌, 화면의 다른 영역(확장 영역, 키패드, 주요 버튼 또는 고정 영역(예: 현재 환경을 보여주는 아이콘인 인디게이터(indicator)) 중 적어도 하나의 영역)에 표시 또는 이 동시켜 표시하도록 제어할 수 있다. 상기 제어부는 사용자가 제1 레이어 상에 표시된 적어도 하나의 객체 를 사용하고, 제1 레이어 상에서 노티피케이션 표시 영역이 검색되지 않은 경우, 발생된 노티피케이션을 제1 레 이어가 표시되는 영역이 아닌 상기 화면의 다른 영역에 표시 또는 이동시켜 표시하도록 제어할 수 있다. 또한, 상기 제어부는 노티피케이션이 위치한 상기 화면의 다른 영역을 사용하고자 하는 경우, 사용자의 시선 추 적, 제스쳐(예를 들어, 손의 움직임) 또는 사용자의 음성(예를 들어, 노티피케이션의 처리를 위한 음성 명령)에 대한 정보를 기반으로 상기 화면의 다른 영역의 사용을 확인할 수 있으며, 이러한 경우, 화면 상에서 노티피케 이션 표시 영역을 검색하여 검색된 영역으로 노티피케이션을 이동시켜 표시하도록 제어할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따르면, 제어부는 노티피케이션이 발생하면, 발생된 노티피케이션을 최초 설정된 위치에 표시한 후, 검색된 노티피케이션 표시 영역으로 이동시켜 표시하도록 제어할 수 있다. 또한, 상기 제어부는 노티피케이션 발생 시 바로 노티피케이션 표시 영역을 검색하여 검색된 노티피케이션 표시 영역에 발생된 노티피케이션을 표시하도록 제어할 수 있다. 다양한 실시 예에 따라, 상기 제어부는 화면 상에 표시되는 객체가 변경 예를 들어, 다른 기능의 실행에 따라 화면 상에 다른 객체들이 표시되면, 노티 피케이션이 표시된 영역에 위치한 객체가 보이지 않게 될 수 있으므로 다시 노티피케이션 표시 영역을 검색하여 이전 노티피케이션 표시 영역에서 새로 검색된 노티피케이션 표시 영역으로 노티피케이션을 이동시켜 표시할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따르면, 제어부는 표시부에 표시된 노티피케이션이 적어도 하나 의 객체에 관련된 사용자의 제스쳐를 기반으로 화면 상에서 이동되어 표시되도록 제어할 수 있다. 상기 제어부 는 상기 전자 장치에 구비된 다양한 센서들을 통해 화면 상에서의 사용자의 제스쳐에 따른 센싱 정보를 수 집할 수 있으며, 수집된 센싱 정보를 사용자 제스쳐에 관련된 정보로서 저장하도록 제어할 수 있다. 상기 사용 자 제스쳐에 관련된 정보는 예를 들어, 사용자의 신체의 움직임(예를 들어, 손 동작 또는 시선 추적 중 적어도 하나) 정보, 사용자의 음성 정보 또는 입력 수단(예를 들어, 펜)을 이용한 사용자 입력 정보 중 적어도 하나를 포함할 수 있으며, 이 외에도 다양한 제스쳐 정보를 포함할 수 있다. 또한, 상기 사용자 제스쳐에 관련된 정보 는 노티피케이션이 발생한 시점에 수집되거나, 화면 상에서 사용자의 제스쳐에 대한 이벤트가 발생할 때마다 수 집되어 사용 이력 정보로서 저장될 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 제어부는 화면 상에서 사용자의 제스쳐에 대한 이벤트가 발생 하면, 사용자의 제스쳐가 발생한 영역을 확인하고, 예를 들어, 확인된 영역의 반대 방향에서 검색된 노티피케이 션 표시 영역으로 상기 화면 상에 표시된 노티피케이션을 표시 또는 이동시켜서 표시하도록 제어할 수 있다. 또 한, 다양한 실시 예에 따라, 상기 제어부는 화면 상에서 사용자의 제스쳐에 따라 이전에 수집되어 사용자 의 제스쳐에 관련된 정보로서 저장된 사용 이력 정보를 기반으로 이전에 사용자의 제스쳐가 발생한 적어도 하나 의 영역을 검색하고, 검색된 적어도 하나의 영역을 제외한 영역을 노티피케이션 표시 영역으로 검색할 수 있다. 또한, 상기 제어부는 검색된 노티피케이션 표시 영역에 발생된 노티피케이션을 표시 또는 이동시켜 표시하 도록 제어할 수 있다. 또한, 본 발명의 다양한 실시 예에 따라, 상기 제어부는 적어도 하나의 객체를 포함하는 제1 레이어를 분 석한 결과에 따라 제1 레이어가 표시된 화면 상에서 노티피케이션 표시 영역을 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라, 상기 제어부는 제1 레이어의 일부 영역에 객체가 표시된 경우, 객체 가 표시되지 않은 영역, 사용자 제스쳐가 발생하지 않은 영역 또는 설정된 영역 중 적어도 하나의 영역을 상기 노티피케이션 영역으로 구분하여 검색할 수 있다. 다양한 실시 예에 따라, 상기 제어부는, 제1 레이어 상 에서 객체가 표시되지 않은 영역들 중에서 사용자 액션이 발생하지 않은 적어도 하나의 영역을 우선적으로 노티 피케이션 표시 영역으로 검색할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따라, 제어부는 화면에서의 사용자의 제스쳐에 따른 사용 이력 정보 를 기반으로 사용자의 제스쳐가 발생한 영역들의 사용 빈도를 확인하고, 확인된 사용 빈도가 설정값 이하인 영 역을 노티피케이션 표시 영역으로 검색할 수 있다. 다양한 실시 예들에 따라, 제어부는 사용자 이력 정보 를 기반으로 사용 빈도 또는 중요도 중 적어도 하나가 낮은 순으로 노티피케이션 표시 영역을 검색하고, 검색된 노티피케이션 표시 영역이 현재 사용자 제스쳐가 발생한 영역인 경우, 사용 빈도 또는 중요도 중 적어도 하나가 낮은 다른 검색된 노티피케이션 표시 영역에 발생된 노티피케이션을 표시하도록 제어할 수 있다. 상기 제어부 는 검색된 노티피케이션 표시 영역에 노티피케이션을 표시한 후 사용자 제스쳐 발생에 따라 검색된 다른 노티피케이션 표시 영역으로 현재 표시된 노티피케이션을 이동시켜 표시하도록 제어할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따라, 제어부는 제1 레이어의 전체 영역에 객체가 표시되는 경우, 객 체 속성 정보를 기반으로 객체가 표시된 영역들 내의 객체의 중요도를 확인하고, 확인된 중요도에 따라 상기 영 역들의 우선 순위를 설정하고, 설정된 우선 순위가 낮은 영역 순에 따라 노티피케이션 표시 영역을 검색할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따라, 상기 제어부는 화면의 적어도 하나의 객체를 포함하는 제1 레 이어가 변경되어 표시되면, 제1 레이어의 변경에 따라 상기 제1 레이어의 일 영역 상에서 발생된 노티피케이션 의 크기 모양 또는 투명도 중 적어도 하나를 변경하여 표시하도록 제어할 수 있다. 본 발명의 다양한 실시 예들 에 따라, 제어부는 노티피케이션 표시 영역에 표시된 노티피케이션이 선택되면, 상기 노티피케이션에 대응 하는 기능을 실행하기 위한 레이어(예를 들어, 제2 레이어 또는 제3 레이어)를 객체를 포함하는 제1 레이어 상 에 표시하도록 제어할 수 있다. 본 발명의 다양한 실시 예들에 따라, 제어부는, 제1 레이어에 포함된 적어도 하나의 객체에 관련된 정보를 기반으로 노티피케이션을 포함하는 제2 레이어가 표시되는 영역의 크기, 모양 또는 투명도 중 적어도 하나를 변 경하여 표시하도록 제어할 수 있다. 본 발명의 다양한 실시 예들에 따라, 제어부는, 추가 노티피케이션이 발생하는 경우, 화면 상에서 이전 노 티피케이션을 가리지 않는 다른 노티피케이션 표시 영역에 추가 노티피케이션을 표시 또는 이동시켜 표시하도록 제어할 수 있다. 상기 제어부는 추가 노티피케이션이 발생하면, 이전 노티피케이션이 표시된 영역에 겹치 지 않도록 이전 노티피케이션이 표시되는 영역을 제외한 다른 노티피케이션 표시 영역을 검색하고, 검색된 다른 노티피케이션 표시 영역에 추가로 발생된 노티피케이션을 표시 또는 이동시켜 표시하도록 제어할 수 있다. 다양 한 실시 예에 따라 상기 제어부는 둘 이상의 노티피케이션이 화면 상에 표시되는 경우, 노티피케이션들의 우선 순위를 결정하고, 우선 순위가 낮은 또는 사용자가 확인한 노티피케이션은 화면 상에서 사라지도록 제어할 수 있다. 예를 들어, 상기 제어부는 노티피케이션의 발생 시간 순으로 우선 순위를 결정하는 경우, 최근에 발생한 노티피케이션을 높은 우선 순위로 결정하고, 오래 전에 발생한 노티피케이션을 화면 상에서 사라지도록 제어할 수 있다. 상기 제어부는 상기 화면 상에 표시된 노티피케이션을 통해 화면 상에서 사라진 노티피케 이션을 확인할 수 있는 정보를 제공할 수 있다. 또한, 다양한 실시 예에 따라 상기 제어부는 둘 이상의 노 티피케이션이 발생한 경우, 발생된 노티피케이션들을 포함하는 새로운 노티피케이션을 생성하고, 새로 생성된 노티피케이션을 검색된 노티피케이션 표시 영역에 표시할 수 있다. 상기 새로 생성된 노티피케이션은 사용자가 발생된 노티피케이션의 개수를 확인할 수 있도록 발생된 노티피케이션의 개수에 대한 정보를 제공할 수 있다. 또한, 본 발명의 다양한 실시 예에 따르면, 전자 장치의 제어부는 프로세서의 적어도 일부일 수 있으며, 예를 들어, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함할 수 있다. 다양 한 실시 예에 따라 상기 제어부는 상기 구성 요소들 중 적어도 일부를 생략하거나, 상기 구성 요소들 외에 도 이미지 처리 동작을 수행하기 위한 다른 구성 요소를 더 포함하여 구성될 수 있다. 또한, 본 발명의 다양한 실시 예에 따르면, 전자 장치의 제어부의 적어도 일부의 구성은 하드웨어적으로 CPU(central processing unit)/MPU(micro processingunit)를 포함하는 적어도 하나의 프로세서와 적어도 하나 의 메모리 로딩 데이터가 로딩되는 메모리(예를 들어, 레지스터 및/또는 RAM(random access memory)) 및 프로세 서와 메모리로 적어도 하나의 데이터들을 입/출력하는 버스의 일부를 포함하여 이루어질 수 있다. 또한, 상기 제어부는 소프트웨어적으로 전자 장치에 정의된 기능을 수행하기 위해 소정의 기록매체로부터 메모리로 로딩되어 상기 프로세서에 의해 연산 처리되는 소정의 프로그램 루틴(routine) 또는 프로그램 데이터를 포함하여 이루어질 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치의 통신부(예를 들어, 도 1의 통신 인터페이스) 는 제어부의 제어에 따라 다른 전자 장치 또는 외부 장치와 통신을 수행할 수 있다. 다양한 실시 예에 따 라 통신부는 제어부의 제어에 따라 실행되는 동작에 관련된 데이터를 외부 장치와 송수신할 수 있다. 상기 통신부는 통신 인터페이스를 통해 무선 통신 또는 유선 통신을 통해서 네트워크에 연결 또는 장치 간 연결을 통해 통신할 수 있다. 상기 무선 통신은, 예를 들어, Wifi(wireless fidelity), BT(bluetooth), NFC(near field communication), GPS(global positioning system) 또는 셀룰라(cellular) 통신(예를 들어, LTE, LTE-A, CDMA, WCDMA, UMTS, WiBro 또는 GSM 중) 중 적어도 하나를 포함할 수 있다. 상기 유선 통신은, 예 를 들어, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 또한, 상기 통신부 는 상술한 통신 방식 이외에도 기타 널리 공지되었거나 향후 개발될 모든 형태의 통신 방식을 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치의 입력부(예를 들어, 도 1의 입출력 인터페이스 )는 사용자로부터 입력되는 숫자 및 문자 정보 중의 다양한 정보, 각종 기능 설정 및 전자 장치의 기능 제 어와 관련하여 입력되는 신호를 제어부로 전달할 수 있다. 또한, 상기 입력부는 특정 기능을 지원하 는 기능 또는 애플리케이션을 실행하기 위한 사용자 입력을 지원할 수 있다. 상기 입력부는 키보드나 키패 드와 같은 키 입력 수단, 터치 센서나 터치 패드와 같은 터치 입력 수단, 음원 입력 수단, 카메라 또는 다양한 센서들을 중 적어도 하나를 포함할 수 있으며, 제스처 입력 수단을 포함할 수도 있다. 이 외에도 입력부는 현재 개발 중이거나 향후 개발될 수 있는 모든 형태의 입력 수단이 포함될 수 있다. 또한, 본 발명의 다양한 실 시 예에 따라, 상기 입력부는 표시부의 터치 패널 또는 카메라를 통해 사용자가 입력하는 정보를 사 용자로부터 입력받을 수 있으며, 입력된 정보를 제어부로 전달할 수 있다. 본 발명의 다양한 실시 예에 따르면, 입력부는 카메라 또는 다양한 센서를 통해 수신된 사용자의 제스쳐에 관련된 정보를 제어부로 전달할 수 있다. 또한, 상기 입력부는 화면 상에 표시된 객체 또는 노티피케 이션에 대한 선택 입력 신호를 제어부로 전달할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치의 저장부(예를 들어, 도 1의 메모리)는 다양한 실시 예에 따른 기능 동작에 필요한 프로그램을 비롯하여, 프로그램 실행 중에 발생되는 다양한 데이터를 일시 적으로 저장할 수 있다. 상기 저장부는 크게 프로그램 영역과 데이터 영역을 포함할 수 있다. 상기 프로그 램 영역은 전자 장치를 부팅시키는 운영체제(OS)와 같은 전자 장치의 구동을 위한 관련된 정보들을 저장할 수 있다. 상기 데이터 영역은 다양한 실시 예에 따라 송수신된 데이터 및 생성된 데이터를 저장할 수 있다. 또한, 상기 저장부는 플래시 메모리(flash memory), 하드디스크(hard disk), 멀티미디어 카드 마이크로 (multimedia card micro) 타입의 메모리(예를 들어, SD 또는 XD 메모리 중), 램(RAM), 롬(ROM) 중의 적어도 하 나의 저장매체를 포함하여 구성될 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 저장부는 화면 상의 제1 레이어에 표시되는 객체들을 분석한 결 과 정보를 저장하는 데이터베이스, 사용자의 제스쳐에 관련된 정보를 저장하는 데이터베이스를 포함할 수 있다. 본 발명의 다양한 실시 예들에 따르면, 상기 전자 장치의 표시부 (예를 들어, 도 1의 입출력 인터페이스 의 일부 구성 또는 디스플레이)는 제어부의 제어에 따라 동작 실행 결과 정보(예를 들어, 텍스 트, 이미지 또는 동영상 중 적어도 하나)를 출력할 수 있다. 상기 표시부는 화면 상에서 입력창에 다양한 문자, 숫자, 기호 중 적어도 하나를 입력할 수 있는 입력 패 드(예를 들어, 버튼)를 다양한 방법으로 디스플레이할 수 있다. 또한, 상기 표시부는 정보 송수신에 관련 된 다양한 애플리케이션의 실행에 따른 서비스 실행 화면을 디스플레이할 수 있다. 또한, 상기 표시부는 제어부의 제어에 따라 화면 상에 복수의 레이어를 표시할 수 있으며, 바탕에 적어도 하나의 객체를 포함하 는 제1 레이어를 표시할 수 있다. 또한, 상기 표시부는 제어부의 제어에 따라 제1 레이어 상에 노티 피케이션을 표시할 수 있으며, 사용자의 제스쳐를 기반으로 이동되는 노티피케이션을 표시할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따르면, 전자 장치의 표시부는 터치 스크린의 형태로 구현될 경우, 입력부(도시되지 않음)의 터치 스크린에 대응할 수 있다. 상기 표시부는 터치 스크린 형태로 입력부 와 함께 구현되는 경우, 사용자의 터치 동작에 따라 발생되는 다양한 정보들을 디스플레이할 수 있다.또한, 본 발명의 다양한 실시 예들에 따르면, 상기 전자 장치의 표시부는 화면을 분할하여 사용하는 경우, 분할된 제1 화면에 표시된 객체를 사용자가 이용하는 경우 즉, 분할된 제1 화면에서 사용자의 제스쳐가 발생하 면, 제어부의 제어에 따라 분할된 제2 화면에 노티피케이션을 표시할 수 있다. 또한, 다양한 실시 예에 따 라, 전자 장치의 표시부는 LCD(liquid crystal display), TFT-LCD(thin film transistor LCD), OLED(organic light emitting diodes), 발광다이오드(LED), AMOLED(active matrix organic LED), 플렉시블 디 스플레이(flexible display) 및 3차원 디스플레이(3 dimension) 중 적어도 하나 이상으로 구성될 수 있다. 또한, 이들 중 일부 디스플레이는 그를 통해 외부를 볼 수 있도록 투명형 또는 광투과형으로 구성될 수 있다. 이는 TOLED(transparant OLED)를 포함하는 투명 디스플레이 형태로 구성될 수 있다. 또한, 본 발명의 다양한 실시 예들에 따르면, 상기 전자 장치는 상기 표시부 외에 장착된 다른 표시부(예 를 들어, 확장 표시부 또는 플렉시블 표시부), 상기 전자 장치와 연동하는 외부의 다른 전자 장치(예를 들어, 외부 표시 장치, 웨어러블 기기 또는 외부 단말 장치 중 적어도 하나)의 표시부를 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치는 오디오 모듈(도시되지 않음)(예를 들어, 도 1의 입출력 인터페이스)을 더 포함할 수 있다. 상기 오디오 모듈은 사운드를 출력할 수 있으며, 예를 들어, 오디오 코 덱(audio codec), 마이크(MIC), 수신기(receiver), 이어폰 출력(EAR_L) 또는 스피커(speaker) 중 적어도 하나 를 포함하여 구성될 수 있다. 또한, 본 발명의 다양한 실시 예에 따르면, 상기 전자 장치는 진동을 출력하는 수 단 또는 냄새를 출력하는 수단을 더 포함하여 구성될 수 있다. 이와 같이, 도 2의 전자 장치를 통해 전자 장치의 주요 구성 요소에 대해 설명하였다. 그러나 도 2를 통해 도시 된 구성 요소가 모두 필수 구성 요소인 것은 아니며, 도시된 구성 요소보다 많은 구성 요소에 의해 상기 전자 장치가 구현될 수도 있고, 그 보다 적은 구성 요소에 의해 상기 전자 장치가 구현될 수도 있다. 또한, 상기 도 2를 통해 상술한 전자 장치의 주요 구성 요소의 위치는 다양한 실시 예에 따라 변경 가능할 수 있다. 본 발명의 다양한 실시 예들 중 어느 하나에 따른 전자 장치는, 화면 상에 적어도 하나의 객체를 표시하는 표시 부; 및 상기 화면에 표시된 적어도 하나의 객체에 관련된 사용자의 제스처를 기반으로 상기 화면 상에서 노티피 케이션을 표시하기 위한 노티피케이션 표시 영역을 판단하고, 판단된 적어도 하나의 노티피케이션 표시 영역에 상기 노티피케이션이 표시되도록 제어하는 제어부를 포함할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 표시부에 표시된 노티피케이션이 상기 적어도 하나의 객체에 관련된 상기 사용자의 제스쳐를 기반으로 상기 화면 상에서 이동되어 표시되도록 제어할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 노티피케이션 표시 영역은, 상기 사용자의 제스처에 관련된 정보 및 상기 화면에 표시된 적어도 하나의 객체에 관련된 정보를 기반으로 판단될 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 복수의 레이어들로 이루어지는 상기 화면의 제1 레이어에 적어도 하나의 객체를 표시하도록 제어하고, 상기 제1 레이어의 위에 위치하는 제2 레이어에서 상기 화면의 일 부분에 상기 노티피케이션을 표시하도록 제어할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 화면 상에서 상기 사용자의 제스처에 대한 이벤트가 발생하면, 상기 사용자의 제스쳐가 발생한 영역을 확인하고, 확인된 영역을 제외한 영역에서 상기 노티피케이션 표시 영역을 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 화면 상에서 이전에 발생한 사용자의 제스쳐에 따른 사용 이력 정보를 기반으로 상기 노티피케이션 표시 영역을 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 화면의 전체 영역에 적어도 하나의 객체가 표시되면, 상기 적어도 하나의 객체가 표시되는 제1 레이어 상에 상기 노티피케이션을 투명하게 표시하도록 제어할 수 있 다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 제1 레이어의 일부 영역에 상기 적어도 하나의 객체가 표시 되면, 상기 적어도 하나의 객체가 표시되지 않은 영역, 상기 사용자의 제스처가 발생하지 않은 영역 또는 설정 된 영역 중 적어도 하나의 영역을 상기 노티피케이션 표시 영역으로 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 적어도 하나의 객체가 표시되지 않은 영역에서 상기 사용자의 제스처가 발생하지 않은 영역을 우선 순위로 하여 상기 노티피케이션 표시 영역으로 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 적어도 하나의 객체가 표시되지 않은 영역이 존재하지 않으면, 상기 화면 상에서 이전에 발생된 사용자의 제스쳐에 따른 사용 이력 정보를 기반으로 사용자의 제스쳐 가 발생한 적어도 하나의 영역의 사용 빈도를 확인하고, 사용 빈도가 설정값 이하인 영역을 상기 노티피케이션 표시 영역으로 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 사용 빈도가 낮은 순으로 상기 노티피케이션 표시 영 역을 검색하고, 검색된 상기 노티피케이션 표시 영역에서 사용자 제스쳐가 발생하면, 상기 사용자 제스처가 발 생한 영역을 제외한 다음 사용 빈도가 낮은 다른 노티피케이션 표시 영역을 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 적어도 하나의 객체에 대한 속성 정보를 기반으로 상 기 적어도 하나의 객체의 중요도를 확인하고, 확인된 중요도에 대한 정보에 따라 상기 적어도 하나의 객체의 우 선 순위를 설정하고, 설정된 우선 순위가 낮은 객체가 표시된 영역을 상기 노티피케이션 표시 영역으로 검색할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 노티피케이션 표시 영역에 표시된 상기 노티피케이션 이 선택되면, 상기 노티피케이션에 대응하는 기능을 실행하도록 제어할 수 있다. *본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 적어도 하나의 객체에 관련된 정보를 기반으로 상기 노티피케이션의 크기, 모양 또는 투명도 중 적어도 하나를 변경하여 표시하도록 제어할 수 있다. 본 발명의 다양한 실시 예들에 따라 상기 제어부는, 상기 화면 상에 추가 노티피케이션이 발생하면, 상기 추가 노티피케이션을 상기 노티피케이션을 가리지 않는 다른 노티피케이션 표시 영역으로 이동시켜 표시하도록 제어 할 수 있다. 상술한 바와 같은 전자 장치에서의 이미지 처리를 위한 방법에 대해 첨부된 도면들을 참조하여 구체적으로 설명 하기로 한다. 도 5는 본 발명의 다양한 실시 예에 따른 전자 장치에서 노티피케이션을 처리하기 위한 동작 절차를 나타내는 도면이다. 상기 도 5를 참조하면, 501 동작에서는 본 발명의 다양한 실시 예들에 따른 전자 장치(예를 들어, 도 1의 전자 장치)가 화면 상에 적어도 하나의 객체를 표시할 수 있다. 상기 적어도 하나의 객체는 제1 레이어에 포함 되어 화면 상에 오버레이 형태로 표시될 수 있다. 503 동작에서는 상기 전자 장치가 화면 상에서 적어도 하나의 객체에 관련된 사용자의 제스쳐를 확인할 수 있다. *505 동작에서는 상기 전자 장치가 적어도 하나의 객체에 관련된 사용자의 제스쳐를 기반으로 노티피케이션을 표시하기 위한 노티피케이션 표시 영역을 판단할 수 있다. 다양한 실시 예들에 따라 상기 전자 장치는 제1 레이 어를 분석하여 제1 레이어에 포함된 적어도 하나의 객체에 관련된 정보 또는 상기 사용자의 제스쳐에 따른 정보 중 적어도 하나를 기반으로 상기 노티피케이션 표시 영역을 검색할 수 있다. 또한, 다양한 실시 예들에 따라 상 기 전자 장치는 적어도 하나의 객체에 관련된 정보를 기반으로 객체가 표시되지 않은 영역을 확인하고, 확인된 영역들 중 사용자의 제스쳐에 따른 영역을 검색하여 검색된 영역을 노티피케이션 표시 영역으로 판단할 수 있다. 또한, 다양한 실시 예들에 따라 상기 전자 장치는 사용자의 이력 정보에 따라 검색된 노티피케이션 표시 영역의 우선 순위를 판단할 수 있다. 507 동작에서는 상기 전자 장치가 판단된 노티피케이션 표시 영역에 상기 노티피케이션을 표시할 수 있다. 첨부된 도 6을 참조하면, 상기 전자 장치는 화면 상에 고정되어 있는 영역(예를 들어, 인디케이터) 또는 적어도 하나의 객체(603, 605 또는 607) 를 포함하는 객체 표시 레이어(예를 들어, 제1 레이어)를 표시할 수 있 으며, 제1 레이어 상에 다양한 크기 및 모양을 갖는 노티피케이션이 표시될 수 있다. 또한, 상기 전자 장 치는 객체에 관련된 정보 및 사용자 제스쳐에 관련된 정보를 기반으로 상기 객체 표시 레이어 상에서 검색된 노 티피케이션 표시 영역으로 현재 표시된 노티피케이션을 이동시켜 표시할 수 있다. 상기 객체 표시 레 이어는 하나 또는 복수의 레이어로 구성될 수 있으며, 상기 하나 또는 복수의 레이어에 다양한 형태의 객체가 표시될 수 있다. 다양한 실시 예들에 따라, 상기 전자 장치는 첨부된 도 7에 도시된 바와 같이, 화면 상의 검색창에 노티피 케이션이 발생하면, 검색된 노티피케이션 영역으로 노티피케이션을 이동시켜 표시할 수 있다. 또한, 다양한 실시 예들에 따라, 상기 전자 장치는 첨부된 도 8에 도시된 바와 같이, 화면 상에 표시된 팝업 창 에 노티피케이션이 발생하면, 상기 팝업 창을 피하여 검색된 노티피케이션 영역으로 노티 피케이션을 이동시켜 표시할 수 있다. 또한, 다양한 실시 예들에 따라, 상기 전자 장치는 첨부된 도 9에 도시된 바와 같이, 화면 상에 표시된 객체에 노티피케이션이 발생하면, 상기 객체를 피하여 검 색된 노티피케이션 영역으로 노티피케이션을 이동시켜 표시할 수 있다. 또한, 다양한 실시 예들에 따 라, 상기 전자 장치는 첨부된 도 10에 도시된 바와 같이, 화면 상에 표시된 주요 버튼 또는 고정 영역(예를 들 어, 인디게이터)에 노티피케이션이 발생하면, 주요 버튼 또는 고정 영역을 피하여 검색된 노 티피케이션 표시 영역으로 노티피케이션을 이동시켜 표시할 수 있다. 또한, 다양한 실시 예들에 따 라, 상기 전자 장치는 첨부된 도 11에 도시된 바와 같이, 화면 상에 표시된 키패드에 노티피케이션(110 1)이 발생하면, 상기 키패드를 피하여 검색된 노티피케이션 영역으로 노티피케이션을 이동시 켜 표시할 수 있다. 다양한 실시 예들에 따라 상기 전자 장치는 첨부된 도 12에 도시된 바와 같이, 화면 상 예를 들어, 바탕에 적어 도 하나의 객체를 포함하는 객체 표시 레이어(예를 들어, 제1 레이어)를 표시할 수 있다. 상기 화면 상의 전체 영역 또는 고정 영역을 제외한 객체 표시가 가능한 전체 영역에 제1 레이어가 표시되고, 노티피케이 션이 발생하면, 상기 전자 장치는 제1 레이어 상의 일부 영역에 노티피케이션을 표시할 수 있다. 상기 노티피케이션은 제1 레이어 위에 위치하여 화면의 일부 영역에 투명하게 표시될 수 있다. 다양한 실시 예들에 따라 상기 전자 장치는 첨부된 도 13(a)에 도시된 바와 같이, 화면 상에 일부 영역에 제1 레이어가 표시되거나, 화면 상에 전체 영역에 표시되는 제1 레이어의 일부 영역이 투명하게 표시될 수 있 다. 상기 전자 장치는 상기 일부 영역 또는 투명하게 표시된 영역을 노티피케이션 표시 영역으로 판단하 여, 판단된 노티피케이션 표시 영역에 노티피케이션을 표시할 수 있다. 또한, 다양한 실시 예들에 따라 상기 전자 장치는, 첨부된 도 13의 (b)에 도시된 바와 같이, 사용자의 제스쳐가 발생하면, 사용자의 제스 쳐에 관련된 정보(예를 들어, 현재 발생된 제스쳐 정보)를 기반으로 제1 레이어 상에서 사용자가 현재 집 중하고 있는 영역(예를 들어, 이용 영역)을 판단할 수 있다. 상기 전자 장치는 판단된 이용 영역을 제외한 영역에서 노티피케이션 표시 영역을 검색하고, 검색된 노티피케이션 표시 영역에 노티피케 이션을 표시할 수 있다. 또한, 다양한 실시 예들에 따라 상기 전자 장치는, 첨부된 도 13의 (c)에 도시된 바와 같이, 이전에 발생되어 저장된 사용자의 제스쳐에 관련된 정보(예를 들어, 사용 이력 정보)를 확인하여 제 스쳐가 발생된 영역을 판단하고, 판단된 영역을 제외한 영역에서 노티피케이션 표시 영역을 검색하고, 검색된 노티피케이션 표시 영역에 노티피케이션을 표시할 수 있다. 첨부된 도 14를 참조하면, 다양한 실시 예들에 따라, 상기 전자 장치는 화면 상의 전체 영역에 제1 레이어 가 오버레이되어 표시되고, 노티피케이션이 발생되면, 상기 도 14의 (a)와 같이, 발생된 노티피케이션 을 제1 레이어 위의 일 영역에 표시할 수 있다. 또한, 상기 도 14의 (b)와 같이, 상기 전자 장치는 제1 레이어 상에 표시된 영역의 객체를 가리지 않도록 노티피케이션을 투명하게 표시할 수 있다. 상기 노티피케이션은 설정된 시간 동안 표시된 후 점점 투명해지거나, 해당 영역에서 사용자의 제스쳐가 발생하면, 투명하게 표시된 후 다른 영역에서의 사용자 제스쳐가 발생 또는 일정 시간이 경과한 후에 다시 원 상태로 표시될 수 있다. 첨부된 도 15를 참조하면, 다양한 실시 예들에 따라, 상기 전자 장치는 제1 레이어에 객체가 표시되지 않은 영 역이 존재하면, 제1 레이어를 분석하여 분석된 다수의 객체들 중 사용자가 주시하거나 실행되는 어플리케이션에 서 중요도가 높게 판단된 주요한 객체(1503, 1505, 1507a, 1507b, 또는 1509)를 확인할 수 있다. 상기 전자 장 치는 확인된 주요한 객체를 가리지 않도록 노티피케이션 표시 영역을 검색하고, 검색된 영역에 노티피케이션 을 표시할 수 있다. 또한, 첨부된 도 16을 참조하면, 다양한 실시 예들에 따라, 상기 전자 장치는 제1 레 이어 상에 표시된 객체들과 노티피케이션의 겹쳐지는 정도를 확인하여, 도 16의 (a), (b), (d) 및 (e)와 같이, 겹쳐짐이 설정된 값 이상인 경우, 겹쳐진 노티피케이션 영역 또는 겹쳐진 객체 영역을 화면 상에서 점점 흐리게 표시(예를 들어, 페이드 아웃) 또는 투명하게 표시하거나 크기 또는 모양을 변경하여 노티피케이션과 객체 간에 겹쳐짐이 없도록 표시할 수 있다. 첨부된 도 17을 참조하면, 다양한 실시 예들에 따라, 상기 전자 장치는 사용자의 제스쳐가 발생한 영역(예를 들 어, 스크롤된 영역)(1703, 1705, 1707 또는 1709)의 반대 방향의 영역을 노티피케이션 표시 영역으로 판단하고,판단된 노티피케이션 표시 영역에 발생된 노티피케이션을 표시할 수 있다. 본 발명의 다양한 실시 예들 중 어느 하나에 따른 전자 장치에서의 노티피케이션의 처리 방법은, 화면 상에 적 어도 하나의 객체를 표시하는 동작; 상기 화면에 표시된 적어도 하나의 객체에 관련된 사용자의 제스처를 기반 으로 상기 화면 상에서 노티피케이션을 표시하기 위한 노티피케이션 표시 영역을 판단하는 동작; 및 판단된 적 어도 하나의 노티피케이션 표시 영역에 상기 노티피케이션을 표시하는 동작;을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 방법은, 상기 표시된 노티피케이션을 상기 적어도 하나의 객체에 관련 된 상기 사용자의 제스쳐를 기반으로 상기 화면 상에서 이동시켜 표시하는 동작;을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역은, 상기 사용자의 제스처에 관련된 정보 및 상 기 화면에 표시된 적어도 하나의 객체에 관련된 정보를 기반으로 판단될 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 상기 화면 상에서 상기 사 용자의 제스처에 대한 이벤트가 발생하면, 상기 사용자의 제스쳐가 발생한 영역을 확인하는 동작; 및 확인된 영 역을 제외한 영역에서 상기 노티피케이션 표시 영역을 검색하는 동작;을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 상기 화면 상에서 이전에 발생한 사용자의 제스쳐에 따른 사용 이력 정보를 기반으로 상기 노티피케이션 표시 영역을 검색할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 복수의 레이어들로 구성되 는 상기 화면의 제1 레이어의 일부 영역에 상기 적어도 하나의 객체가 표시되면, 상기 적어도 하나의 객체가 표 시되지 않은 영역, 상기 사용자의 제스처가 발생하지 않은 영역 또는 설정된 영역 중 적어도 하나의 영역을 상 기 노티피케이션 표시 영역으로 검색할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 상기 적어도 하나의 객체 가 표시되지 않은 영역에서 상기 사용자의 제스처가 발생하지 않은 영역을 우선 순위로 하여 상기 노티피케이션 표시 영역으로 검색할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 상기 적어도 하나의 객체 가 표시되지 않은 영역이 존재하지 않으면, 상기 화면 상에서 이전에 발생된 사용자의 제스쳐에 따른 사용 이력 정보를 기반으로 사용자의 제스쳐가 발생한 적어도 하나의 영역의 사용 빈도를 확인하는 동작; 및 확인된 상기 사용 빈도가 설정값 이하인 영역을 상기 노티피케이션 표시 영역으로 검색하는 동작;을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 검색된 상기 노티피케이션 표시 영역에서 사용자 제스쳐가 발생하면, 상기 사용자 제스처가 발생한 영역을 제외한 다음 사용 빈도가 낮은 다른 노티피케이션 표시 영역을 검색하는 동작; 을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션 표시 영역을 판단하는 동작은, 상기 적어도 하나의 객체 에 대한 속성 정보를 기반으로 상기 적어도 하나의 객체의 중요도를 확인하는 동작; 확인된 중요도에 대한 정보 에 따라 상기 적어도 하나의 객체의 우선 순위를 설정하는 동작; 및 설정된 우선 순위가 낮은 객체가 표시된 영 역을 상기 노티피케이션 표시 영역으로 검색하는 동작;을 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 방법은, 상기 노티피케이션에 표시된 상기 노티피케이션이 선택되면, 상기 노티피케이션에 대응하는 기능을 실행하는 동작;을 더 포함할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 노티피케이션을 표시하는 동작은, 상기 적어도 하나의 객체에 관련된 정보를 기반으로 상기 노티피케이션의 크기, 모양 또는 투명도 중 적어도 하나를 변경하여 표시할 수 있다. 본 발명의 다양한 실시 예에 따라, 상기 방법은, 상기 화면 상에 추가 노티피케이션이 발생하면, 상기 추가 노 티피케이션을 상기 노티피케이션을 가리지 않는 다른 노티피케이션 표시 영역으로 이동시켜 표시하는 동작;을 더 포함할 수 있다. 상술한 바와 같은 본 발명의 다양한 실시 예들에 따른 전자 장치의 동작 절차에 따라 전자 장치에서의 노티피케 이션을 표시하기 위한 보다 구체적인 동작 절차를 첨부된 도면들을 참조하여 보다 구체적으로 설명하기로 한다. 도 18은 본 발명의 다양한 실시 예에 따른 전자 장치에서 노티피케이션을 처리하기 위한 동작 절차를 나타내는 도면이다. 상기 도 18을 참조하면, 1801 동작에서는 본 발명의 다양한 실시 예들에 따른 전자 장치(예를 들어, 도 1의 전 자 장치)가, 화면 상에 적어도 하나의 객체를 포함하는 객체 레이어(예를 들어, 제1 레이어)를 표시할 수 있다. 상기 제1 레이어는 화면 상에 표시된 바탕에 표시되며, 제1 레이어 위의 일부 영역 또는 전체 영역에 오 버레이되어 표시되거나, 전체 영역에 표시되면서 객체가 표시되지 않은 영역이 투명하게 표시될 수 있다. 1803 동작에서는 상기 전자 장치가 노티피케이션이 발생 여부를 확인할 수 있다. 확인 결과, 노티피케이션이 발 생하지 않는 경우, 상기 전자 장치는 1801 동작을 수행하고, 노티피케이션이 발생한 경우에는 1805 동작을 수행 할 수 있다. 1805 동작에서는 상기 전자 장치가 제1 레이어를 분석하여 제1 레이어 상에 객체가 표시된 영역과 객체가 표시 되지 않은 영역을 확인할 수 있다. 1807 동작에서는 상기 전자 장치가 제1 레이어의 분석 결과에 따라 발생된 노티피케이션을 제1 레이어 위의 일 부 영역에 제2 레이어에 포함되어 표시할 수 있다. 즉, 상기 전자 장치는 객체가 표시되지 않은 영역에 상기 발 생된 노티피케이션을 표시할 수 있다. 1809 동작에서는 상기 전자 장치가 사용자 제스쳐가 발생하였는지를 확인할 수 있다. 확인 결과, 사용자 제스쳐 가 발생하지 않는 경우, 상기 전자 장치는 1807 동작을 수행하고, 사용자 액션이 발생 경우, 1811 동작을 수행 할 수 있다. 1811 동작에서는 상기 전자 장치가 사용자 제스쳐를 기반으로 현재 표시된 노티피케이션을 이동시켜 표시하기 위한 노티피케이션 표시 영역을 검색할 수 있다. 1813 동작에서는 상기 전자 장치가 현재 표시된 노티피케이션을 검색된 노티피케이션 표시 영역으로 이동시켜 표시할 수 있다. 1815 동작에서는 상기 전자 장치가 표시된 노티피케이션이 선택되었는지를 확인할 수 있다. 상기 전자 장치는, 사용자에 의해 상기 표시된 노티피케이션이 선택되면, 1817 동작을 수행하고, 상기 표시된 노티피케이션이 선택 되지 않는 경우, 다시 1815 동작을 수행할 수 있다. 1817 동작에서는 상기 전자 장치가 노티피케이션이 제공하는 기능을 수행할 수 있다. 다양한 실시 예에 따라 상 기 전자 장치는 선택된 노티피케이션에 연관된 기능을 제공하기 위해 노티피케이션을 확장 표시하거나, 다른 노 티피케이션을 제1 레이어 상에 표시할 수 있다. 또한, 다양한 실시 예에 따라 상기 전자 장치는 선택된 노티피 케이션에 연관된 기능을 제공하는 적어도 하나의 객체를 포함하는 새로운 레이어(예를 들어, 제3 레이어)를 노 티피케이션이 표시된 레이어(예를 들어, 제2 레이어) 위 전체 또는 일부 영역에 표시할 수도 있다. 도 19 내지 도 21은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도 면이다. 상기 도 19를 참조하면, 본 발명의 다양한 실시 예들에 따른 상기 전자 장치는 상기 도 19의 (a)에 도시된 바와 같이, 화면 상에 제1 레이어를 표시할 수 있으며, 제1 레이어 위에 노티피케이션을 포함하는 제2 레이어를 표시할 수 있다. 상기 전자 장치는 사용자 제스쳐(예를 들어, 사용자의 스크롤 동작)을 확인할 수 있다. 다양한 실시 예에 따라, 도 19의 (b)에 도시된 바와 같이, 스크롤 동작의 방향이 상부 방향으로 이동하는 경우, 상기 전자 장치는 사용자가 화면 상의 하부 영역을 주시하고 있는 것으로 판단하고, 하부 영역에 표시된 노티피케이션을 사용자 제스쳐가 발생된 영역의 반대 방향인 상부 영역으로 이동시켜 표시할 수 있다. 또 한, 다양한 실시 예에 따라, 도 19의 (c)에 도시된 바와 같이, 스크롤 동작의 방향이 하부 방향으로 이동하는 경우, 상기 전자 장치는 사용자가 화면 상의 상부 영역을 주시하고 있는 것으로 판단하고, 상부 영역에 표시된 노티피케이션을 사용자 제스쳐가 발생된 영역의 반대 방향인 하부 영역으로 이동시켜 표시할 수 있다. 상기 도 20을 참조하면, 상기 전자 장치는 상기 도 20의 (a)와 같이, 화면 상에 제1 레이어를 표시할 수 있으며, 제1 레이어 위에 노티피케이션을 포함하는 제2 레이어를 표시할 수 있다. 상기 전자 장치 는 사용자 제스쳐(예를 들어, 사용자의 스크롤 동작)가 발생되면, 상기 도 20의 (b)와 같이, 상기 노티피 케이션을 현재 화면에서 보이지 않도록 아래 방향으로 이동하여 상기 도 20의 (c)와 같이, 화면에서 사라 지도록 함으로써 제1 레이어 만을 표시할 수 있다. 상기 화면에서 사라진 노티피케이션은 일정 시 간 이후, 사용자의 특정 제스쳐 또는 버튼 입력 시 또는 스크롤 동작이 완료된 후에 제1 레이어 위에 다 시 표시될 수 있다. 상기 전자 장치는 상기 노티피케이션을 다시 표시하는 경우, 이전 노티피케이션 영역 에 표시하거나, 스크롤되어 현재 표시된 제1 레이어에서 다시 노티피케이션 영역을 검색한 후 검색된 새 로운 노티피케이션 영역에 상기 노티피케이션을 표시할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따라 상기 전자 장치는 사용자 제스쳐(예를 들어, 사용자의 스크롤 동 작)가 발생되면, 제1 레이어 위에 표시되는 노티피케이션을 점점 흐리게 또는 투명하게 표시할 수 있다. 상기 전자 장치는 흐리게 또는 투명하게 표시된 노티피케이션을 일정 시간 이후, 사용자의 특정 제스쳐 또는 버 튼 입력 시 또는 스크롤 동작이 완료된 후에 제1 레이어 위에 다시 표시할 수 있다. 본 발명의 다양한 실시 예들에 따라, 상기 전자 장치는 시선 추적을 위한 센서(예를 들어, 카메라 센서)를 이용 하여 사용자의 시선을 추적한 정보를 획득할 수 있다. 상기 전자 장치는 획득한 사용자의 시선 추적에 관련된 정보를 기반으로 어플리케이션이 실행되는 화면 상에서 사용자가 현재 보고 있는 영역을 확인할 수 있다. 또한, 상기 전자 장치는 인접한 거리뿐만 아니라 원거리에 위치한 사용자의 시선 추적도 가능할 수 있다. 상기 도 21 을 참조하면, 본 발명의 다양한 실시 예들에 따라 상기 전자 장치는 시선 추적에 따른 정보를 기반으로 사용자 가 현재 주시하고 있는 영역(상부 영역 또는 중심 영역)을 판단하고, 노티피케이션을 상기 판단된 영역(2103 또는 2107)의 반대 영역(2105 또는 2109)로 이동시켜 표시할 수 있다. 도 22는 본 발명의 다양한 실시 예에 따른 전자 장치에서 노티피케이션을 처리하기 위한 동작 절차를 나타내는 도면이다. *상기 도 22를 참조하면, 2201 동작에서는 본 발명의 다양한 실시 예들에 따른 전자 장치(예를 들어, 도 1의 전 자 장치)가, 화면 상에 적어도 하나의 객체를 포함하는 객체 레이어(예를 들어, 제1 레이어)를 표시할 수 있다. 상기 제1 레이어는 바탕 레이어 위에 표시되며, 제1 레이어 상의 일부 영역 또는 전체 영역에 오버레이되 어 표시되거나, 전체 영역에 표시되면서 객체가 표시되지 않은 영역이 투명하게 표시될 수 있다. 2203 동작에서는 상기 전자 장치가 사용자 제스쳐에 따른 사용 이력 정보를 수집 및 저장할 수 있다. 다양한 실 시 예들에 따라 상기 전자 장치는 제1 레이어 상에서 사용자 제스쳐 이벤트가 발생하면, 발생된 사용자 제스쳐 이벤트에 따른 정보(예를 들어, 스크롤, 터치, 드레그, 스와이프 또는 사용자의 시선 추적 중 적어도 하나)를 수집하여 수집된 정보를 사용 이력 정보로서 사용자 제스쳐에 관련된 정보 DB에 저장할 수 있다. 또한, 수집된 정보를 기반으로 사용자 제스쳐가 발생한 영역을 판단할 수 있으며, 판단된 사용자 제스쳐가 발생한 영역의 위 치 정보를 사용 이력 정보로서 저장할 수 있다. 2205 동작에서는 상기 전자 장치가 노티피케이션이 발생 여부를 확인할 수 있다. 확인 결과, 상기 전자 장치는 노티피케이션이 발생하지 않는 경우에는 2203 동작을 수행하고, 노티피케이션이 발생한 경우에는 2207 동작을 수행할 수 있다. 2207 동작에서는 상기 전자 장치가 제1 레이어를 분석하여 제1 레이어 상에 객체가 표시된 영역과 객체가 표시 되지 않은 영역을 확인할 수 있다. 2209 동작에서는 상기 전자 장치가 제1 레이어의 분석 결과 및 저장된 사용 이력 정보를 기반으로 발생된 노티 피케이션을 표시하기 위한 노티피케이션 표시 영역을 검색할 수 있다. 즉, 상기 전자 장치는 객체가 표시되지 않은 영역 및 이전에 사용자의 제스쳐가 발생하지 않은 영역을 검색할 수 있다. 2211 동작에서는 상기 전자 장치가 발생된 노티피케이션을 검색된 노티피케이션 표시 영역에 표시할 수 있다. 2213 동작에서는 상기 전자 장치가 표시된 노티피케이션이 선택되었는지를 확인할 수 있다. 상기 전자 장치는, 사용자에 의해 상기 표시된 노티피케이션이 선택되면, 상기 전자 장치는 2215 동작을 수행하고, 상기 표시된 노 티피케이션이 선택되지 않는 경우, 다시 2211 동작을 수행할 수 있다. 2215 동작에서는 상기 전자 장치가 노티피케이션이 제공하는 기능을 수행할 수 있다. 다양한 실시 예에 따라 상 기 전자 장치는 선택된 노티피케이션에 연관된 기능을 제공하기 위해 노티피케이션을 확장 표시하거나, 다른 노 티피케이션을 제1 레이어 상에 표시할 수 있다. 또한, 다양한 실시 예에 따라 상기 전자 장치는 선택된 노티피 케이션에 연관된 기능을 제공하는 적어도 하나의 객체를 포함하는 새로운 레이어(예를 들어, 제3 레이어)를 노 티피케이션이 표시된 레이어(예를 들어, 제2 레이어) 상에 표시할 수도 있다. 도 23 내지 도 27은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도 면이고, 도 28은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 화면 상에 표시되는 레이어들의 예를 나타 내는 도면이다. 상기 도 23을 참조하면, 상기 전자 장치는 화면 상에 표시된 주요한 버튼(2301a, 2301b 또는 2301c) 또는 적어 도 하나의 객체(예를 들어, 콘텐츠)를 표시할 수 있으며, 제1 레이어 상에 팝업 창(2305c)을 표시할 수 있다. 또한, 상기 전자 장치는 예를 들어, 상기 도 23의 (b)과 같이 스크롤 동작에 따라 객체가 이동하는 화면 (2305a 또는 2305b)을 표시할 수 있다. 상기 전자 장치는 상기 표시된 주요한 버튼(2301a, 2301b 또는 2301c), 팝업 창(2305c), 적어도 하나의 객체(예를 들어, 콘텐츠)의 사용 또는 스크롤 동작에 따른 횟수, 위치, 중요도 또는 시간 중 적어도 하나를 파악하여 파악된 결과를 사용 이력 정보로서 생성할 수 있다. 또한, 상기 전자 장치는 사용 이력 정보를 이용하여 제1 레이어 상에 표시된 주요한 버튼(2301a, 2301b 또는 2301c), 팝업 창(2305c), 적어도 하나의 객체의 사용 또는 스크롤 동작이 발생한 영역을 확인할 수 있다. 상기 전자 장 치는 확인된 영역을 제외한 영역 중 일부 영역을 노티피케이션 표시 영역으로 검색할 수 있다. 상기 도 24를 참조하면, 상기 전자 장치는 이전에 사용자의 제스쳐에 따라 저장된 사용 이력 정보를 기반으로 이전에 사용자의 제스쳐가 발생한 영역(2401a, 2401b, 2403a 또는 2403b)을 확인할 수 있다. 상기 전자 장치는 확인된 영역(2401a, 2401b, 2403a 또는 2403b)을 제외한 영역을 구분하고, 구분된 영역에서 노티피케이션 표시 영역을 검색하여, 검색된 노티피케이션 영역에 발생된 노티피케이션을 표시할 수 있다. 다양한 실시 예에 따라 상기 전자 장치는 상기 도 23의 주요한 버튼(2301a 또는 2301b) 또는 적어도 하나의 객체가 사 용되면, 상기 도 24의 제1 영역(2401a 또는 2401b)에 관련된 정보(위치, 사용 횟수, 중요도 또는 시간 중 적어 도 하나)가 사용 이력 정보로서 생성될 수 있다. 또한, 다양한 실시 예에 따라 상기 전자 장치는 상기 도 23의 스크롤 동작의 사용에 따른 정보 또는 2301c), 팝업 창(2305c), 사용되면, 상기 도 24의 제2 영역(2403a 또는 2403b)에 관련된 정보(위치, 사용 횟수, 중요도 또는 시간 중 적어도 하나)가 사용 이력 정보로서 생성될 수 있다. 또한, 다양한 실시 예에 따라 상기 전자 장치는 주요 버튼, 객체, 다른 노티피케이션의 사용 또는 사 용자 제스쳐 동작에 따른 사용 횟수(빈도) 또는 중요도에 따라 우선 순위가 결정될 수 있으며, 우선 순위가 낮 은 사용 이력 정보의 영역에 인접한 빈 영역을 노티피케이션 표시 영역으로 검색할 수 있다. 다양한 실시 예에 따라 상기 전자 장치는 사용 빈도가 낮은 순으로 노티피케이션 표시 영역을 검색하고, 검색된 노티피케이션 표 시 영역에서 사용자 제스쳐가 발생하면, 사용자 제스처가 발생한 영역을 제외한 다음 사용 빈도가 낮은 다른 노 티피케이션 표시 영역을 검색할 수 있다. 또한, 본 발명의 다양한 실시 예들에 따라, 상기 전자 장치는 상기 도 25에 도시된 바와 같이, 화면 상의 적어 도 하나의 객체를 포함하는 제1 레이어를 표시하고, 노티피케이션이 발생하면, 발생된 노티피케이션 을 포함하는 제2 레이어를 표시할 수 있다. 상기 제2 레이어는 상기 제1 레이어의 일 부 영역이 오버레이되어 표시될 수 있다. 다양한 실시 예에 따라 상기 제2 레이어는 제1 레이어의 전체 영역을 딤 처리하지 않고, 일부 영역을 딤 처리하거나, 투명하게 처리하여 제1 레이어에 표시된 객 체들을 확인할 수 있도록 표시될 수 있다. 본 발명의 다양한 실시 예들에 따라, 상기 전자 장치는 상기 도 26에 도시된 바와 같이, 사용자의 제스쳐(예를 들어, 스크롤 동작)에 따라 다른 노티피케이션에 대응하는 기능에 대한 노티피케이션이 표시 될 수 있다. 상기 전자 장치는 다른 노티피케이션이 표시됨에 따라 제2 레이어의 전체 영역을 딤 처리하 지 않고, 제1 레이어의 주요한 객체를 확인할 수 있도록 이동되어 일부 영역이 딤처리되거나 투명하게 처리될 수 있다. 또한, 상기 도 27을 참조하면, 상기 전자 장치는 화면 상에 노티피케이션이 표시된 상태에서 예를 들어, 인디게이터 또는 다른 노티피케이션(2705, 207 또는 2709)이 표시될 수 있다. 이러한 경우, 상기 전자 장 치는 이전에 표시된 노티피케이션과 겹쳐지지 않도록 다른 노티피케이션 표시 영역을 검색하여 검색된 다 른 노티피케이션 표시 영역에 새로 발생된 상기 다른 노티피케이션(2705, 2707 또는 2709)을 표시하거나 이동하 여 표시할 수 있다. 상기 다른 노티피케이션(2705, 2707 또는 2709)은 상기 도 28에 도시된 바와 같이, 상기 노 티피케이션을 표시하는 제2 레이어 상에 표시되는 제3 레이어에 포함되어 표시될 수 있다. 상기 제2 레이어는 적어도 하나의 객체를 포함하는 제1 레이어 상에 표시될 수 있다. 도 29 및 도 30은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면 이다. 상기 도 29를 참조하면, 본 발명의 다양한 실시 예들에 따라, 상기 전자 장치는 도 29의 (a)와 같이, 제1 레이 어에 포함된 객체(2901a)를 표시하고, 제1 레이어 상에 노티피케이션(2903a)을 표시할 수 있다. 상기 전자 장치 는 도 29의 (b) 및 (c)와 같이, 제1 레이어에 표시된 객체(2901b, 2901c)가 확대되면, 노티피케이션(2903b, 2903c)이 상기 객체(2901b, 2901c)와 겹쳐지게 되므로 노티피케이션(2903b, 2903c)의 크기 또는 모양을 변경할 수 있다. 상기 전자 장치는 도 29의 (d)에 도시된 바와 같이, 객체(2901d)가 더 확대되어 노티피케이션(2901d)과 겹쳐지면, 노티피케이션(2901d)을 점 또는 선의 형태 중 적어도 하나로 표시하여 사라지는 효과가 나타나도 록 할 수 있다. 상기 도 30을 참조하면, 본 발명의 다양한 실시 예들에 따라, 상기 전자 장치는 제1 표시부의 화면에 객체를 포함하는 제1 레이어가 표시되고, 제1 레이어 상에 노티피케이션을 표시할 수 있다. 노티피케이션이 표시된 후 또는 노티피케이션이 발생 시 제2 표시부의 화면으로 상기 노티피 케이션를 이동시켜 표시할 수 있다. 상기 제2 표시부는 상기 전자 장치에 장착된 다른 표시부(예를 들어, 확장 표시부 또는 플렉시블 표시부), 상기 전자 장치와 연동하는 외부의 다른 전자 장치(예를 들어, 외부 표시 장치, 웨어러블 기기 또는 외부 단말 장치 중 적어도 하나)의 표시부를 포함할 수 있다. 상기 제2 표시부의 화 면은 현재 발생된 노티피케이션과 이전에 발생된 노티피케이션들도 함께 표시할 수 있으며, 사용자 의 설정에 따라 표시된 노티피케이션들의 표시 상태(예를 들어, 노티피케이션 히스토리 정보 표시, 추가 또는 삭제 중 적어도 하나)를 변경할 수 있다. 또한, 다양한 실시 예에 따라 상기 전자 장치는 표시부의 화면을 분할하여 사용하는 경우, 분할된 제1 화면에 표시된 객체를 사용자가 이용하는 경우 즉, 분할된 제1 화면에서 사용자의 제스쳐가 발생하면, 분할된 제2 화면 에 노티피케이션을 표시할 수 있다. 도 31은 다양한 실시예에 따른 전자 장치의 블록도이다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 포함할 수 있다. 전자 장치는 하나 이상의 프로세서(예: AP(application processor)), 통신 모듈, (가입자 식별 모듈, 메모리, 센서 모듈 , 입력 장치, 디스플레이, 인터페이스, 오디오 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 인디케이터, 및 모터 를 포함할 수 있다. 프로세서는, 예를 들면, 운영 체제 또는 응용 프로그램을 구동하여 프로세서에 연결된 다수의 하드 웨어 또는 소프트웨어 구성요소들을 제어할 수 있고, 각종 데이터 처리 및 연산을 수행할 수 있다. 프로세서 는, 예를 들면, SoC(system on chip)로 구현될 수 있다. 한 실시예에 따르면, 프로세서는 GPU(graphic processing unit) 및/또는 이미지 신호 프로세서(image signal processor)를 더 포함할 수 있다. 프로세서는 도 31에 도시된 구성요소들 중 적어도 일부(예: 셀룰러 모듈)를 포함할 수도 있다. 프 로세서는 다른 구성 요소들(예: 비휘발성 메모리) 중 적어도 하나로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 로드(load)하여 처리하고, 다양한 데이터를 비휘발성 메모리에 저장(store)할 수 있다. 통신 모듈은, 도 1의 통신 인터페이스와 동일 또는 유사한 구성을 가질 수 있다. 통신 모듈은, 예를 들면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈(예: GPS 모듈, Glonass 모듈, Beidou 모듈, 또는 Galileo 모듈), NFC 모듈 및 RF(radio frequency) 모듈 을 포함할 수 있다. 셀룰러 모듈은, 예를 들면, 통신망을 통해서 음성 통화, 영상 통화, 문자 서비스, 또는 인터넷 서비스 등 을 제공할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 가입자 식별 모듈(예: SIM 카드)을 이용하 여 통신 네트워크 내에서 전자 장치의 구별 및 인증을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈 은 프로세서가 제공할 수 있는 기능 중 적어도 일부 기능을 수행할 수 있다. 한 실시예에 따르면, 셀룰러 모듈은 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 각각은, 예를 들면, 해당하는 모듈을 통해서 송수신되는 데이터를 처리하기 위한 프로세서를 포함할 수 있다. 어떤 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈, GNSS 모듈 또는 NFC 모듈 중 적어도 일부(예: 두 개 이상)는 하나의 integrated chip(IC) 또는 IC 패키지 내에 포함될 수 있다. RF 모듈은, 예를 들면, 통신 신호(예: RF 신호)를 송수신할 수 있다. RF 모듈은, 예를 들면, 트랜 시버(transceiver), PAM(power amp module), 주파수 필터(frequency filter), LNA(low noise amplifier), 또 는 안테나 등을 포함할 수 있다. 다른 실시예에 따르면, 셀룰러 모듈, WiFi 모듈, 블루투스 모듈 , GNSS 모듈 또는 NFC 모듈 중 적어도 하나는 별개의 RF 모듈을 통하여 RF 신호를 송수신할 수 있다. 가입자 식별 모듈은, 예를 들면, 가입자 식별 모듈을 포함하는 카드 및/또는 내장 SIM(embedded SIM)을 포함할 수 있으며, 고유한 식별 정보(예: ICCID(integrated circuit card identifier)) 또는 가입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리)는, 예를 들면, 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리는, 예를 들면, 휘발성 메모리(예: DRAM(dynamic RAM), SRAM(static RAM), 또는 SDRAM(synchronous dynamic RAM) 등), 비휘발성 메모리(non-volatile Memory)(예: OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, 플래시 메모리(예: NAND flash 또는 NOR flash 등), 하드 드라이브, 또는 솔리드 스테이트 드라이브(solid state drive(SSD)) 중 적어도 하나를 포함할 수 있다. 외장 메모리는 플래시 드라이브(flash drive), 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital), MMC(multi-media card) 또는 메모리 스틱(memory stick) 등을 더 포함할 수 있다. 외장 메모리는 다양한 인터페이스를 통 하여 전자 장치와 기능적으로 및/또는 물리적으로 연결될 수 있다. 센서 모듈은, 예를 들면, 물리량을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지 된 정보를 전기 신호로 변환할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(3140A), 자이로 센서 (3140B), 기압 센서(3140C), 마그네틱 센서(3140D), 가속도 센서(3140E), 그립 센서(3140F), 근접 센서 (3140G), 컬러(color) 센서(3140H)(예: RGB(red, green, blue) 센서), 생체 센서(3140I), 온/습도 센서 (3140J), 조도 센서(3140K), 또는 UV(ultra violet) 센서(3140M) 중의 적어도 하나를 포함할 수 있다. 추가적 으로 또는 대체적으로(additionally or alternatively), 센서 모듈은, 예를 들면, 후각 센서(E-nose sensor), EMG 센서(electromyography sensor), EEG 센서(electroencephalogram sensor), ECG 센서 (electrocardiogram sensor), IR(infrared) 센서, 홍채 센서 및/또는 지문 센서를 포함할 수 있다. 센서 모듈 은 그 안에 속한 적어도 하나 이상의 센서들을 제어하기 위한 제어 회로를 더 포함할 수 있다. 어떤 실시 예에서는, 전자 장치는 프로세서의 일부로서 또는 별도로, 센서 모듈을 제어하도록 구성된 프로세서를 더 포함하여, 프로세서가 슬립(sleep) 상태에 있는 동안, 센서 모듈을 제어할 수 있다. 입력 장치는, 예를 들면, 터치 패널(touch panel),(디지털) 펜 센서(pen sensor), 키 (key), 또는 초음파(ultrasonic) 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들면, 정 전식, 감압식, 적외선 방식, 또는 초음파 방식 중 적어도 하나의 방식을 사용할 수 있다. 또한, 터치 패널 은 제어 회로를 더 포함할 수도 있다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함하여, 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 터치 패널의 일부이거나, 별도의 인식용 쉬트(sheet)를 포함할 수 있다. 키는, 예를 들면, 물리적인 버튼, 광학식 키, 또는 키패드를 포함할 수 있다. 초음파 입력 장치는 마이크(예: 마이크)를 통해, 입력 도구에서 발생된 초음파를 감지하여, 상기 감지된 초음파에 대응하는 데이터를 확인할 수 있다. 디스플레이(예: 디스플레이)는 패널, 홀로그램 장치, 또는 프로젝터를 포함할 수 있다. 패널은, 도 1의 디스플레이와 동일 또는 유사한 구성을 포함할 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent), 또는 착용할 수 있게(wearable) 구현될 수 있다. 패널 은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램 장치는 빛의 간섭을 이용하여 입 체 영상을 허공에 보여줄 수 있다. 프로젝터는 스크린에 빛을 투사하여 영상을 디스플레이할 수 있다. 스 크린은, 예를 들면, 전자 장치의 내부 또는 외부에 위치할 수 있다. 한 실시예에 따르면, 디스플레이 는 패널, 홀로그램 장치, 또는 프로젝터를 제어하기 위한 제어 회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 광 인터페이스(optical interface), 또는 D-sub(D-subminiature)를 포함할 수 있다. 인터페이스는, 예를 들면, 도 1에 도시된 통신 인터페이스에 포함될 수 있다. 추가적으로 또는 대체 적으로(additionally and alternatively), 인터페이스는, 예를 들면, MHL(mobile high-definition link) 인터페이스, SD(secure digital) 카드/MMC(multi-media card) 인터페이스, 또는 IrDA(infrared data association) 규격 인터페이스를 포함할 수 있다. 오디오 모듈은, 예를 들면, 소리(sound)와 전기 신호를 쌍방향으로 변환시킬 수 있다. 오디오 모듈(318 0)의 적어도 일부 구성요소는, 예를 들면, 도 1 에 도시된 입출력 인터페이스에 포함될 수 있다. 오디오 모듈은, 예를 들면, 스피커, 리시버, 이어폰, 또는 마이크 등을 통해 입력 또 는 출력되는 소리 정보를 처리할 수 있다. 카메라 모듈은, 예를 들면, 정지 영상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 하나 이상의 이미지 센서(예: 전면 센서 또는 후면 센서), 렌즈, ISP(image signal processor), 또는 플래시 (flash)(예: LED 또는 xenon lamp 등)를 포함할 수 있다. 전력 관리 모듈은, 예를 들면, 전자 장치의 전력을 관리할 수 있다. 한 실시예에 따르면, 전력 관 리 모듈은 PMIC(power management integrated circuit), 충전 IC(charger integrated circuit), 또는 배터리 또는 연료 게이지(battery or fuel gauge)를 포함할 수 있다. PMIC는, 유선 및/또는 무선 충전 방식을 가질 수 있다. 무선 충전 방식은, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등을 포함하며, 무선 충전을 위한 부가적인 회로, 예를 들면, 코일 루프, 공진 회로, 또는 정류기 등을 더 포함할 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류, 또는 온도를 측정할 수 있다. 배터리는, 예를 들면, 충전식 전지(rechargeable battery) 및/또는 태양 전지(solar battery)를 포함할 수 있다. 인디케이터는 전자 장치 또는 그 일부(예: 프로세서)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 디스플레이할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있고, 진동(vibration), 또는 햅틱(haptic) 효과 등을 발생시킬 수 있다. 도시되지는 않았으나, 전자 장치 는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV 지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting), 또는 미디어플로 (mediaFloTM) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 본 문서에서 기술된 구성요소들 각각은 하나 또는 그 이상의 부품(component)으로 구성될 수 있으며, 해당 구성 요소의 명칭은 전자 장치의 종류에 따라서 달라질 수 있다. 다양한 실시예에서, 전자 장치는 본 문서에서 기술 된 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되거나 또는 추가적인 다른 구 성요소를 더 포함할 수 있다. 또한, 다양한 실시예에 따른 전자 장치의 구성요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성요소들의 기능을 동일하게 수행할 수 있다. 도 32는 다양한 실시예에 따른 전자 장치의 프로그램 모듈의 블록도이다. 한 실시예에 따르면, 프로그램 모듈 (예: 프로그램)은 전자 장치(예: 전자 장치)에 관련된 자원을 제어하는 운영 체제(operating system(OS)) 및/또는 운영 체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 프로그램)을 포함 할 수 있다. 운영 체제는, 예를 들면, 안드로이드(android), iOS, 윈도우즈(windows), 심비안(symbian), 타이 젠(tizen), 또는 바다(bada) 등이 될 수 있다. 프로그램 모듈은 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(application programming interface (API)), 및/또는 어플리케이션을 포함할 수 있다. 프로그램 모듈의 적어도 일부는 전자 장치 상에 프리로드(preload) 되거나, 외부 전자 장치(예: 전자 장치(102, 104), 서버 등)로부터 다운로드(download) 가능하다. 커널(예: 커널)은, 예를 들면, 시스템 리소스 매니저 및/또는 디바이스 드라이버를 포 함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당, 또는 회수 등을 수행할 수 있다. 한 실시예에 따르면, 시스템 리소스 매니저는 프로세스 관리부, 메모리 관리부, 또는 파일 시스템 관리부 등 을 포함할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버, 오디오 드라이버, 또는 IPC(inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는, 예를 들면, 어플리케이션이 공통적으로 필요로 하는 기능을 제공하거나, 어플리케이션 이 전자 장치 내부의 제한된 시스템 자원을 효율적으로 사용할 수 있도록 API를 통해 다양한 기능 들을 어플리케이션으로 제공할 수 있다. 한 실시예에 따르면, 미들웨어(예: 미들웨어)는 런타 임 라이브러리, 어플리케이션 매니저(application manager), 윈도우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파 워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니저(package manager), 연결 매니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저(location manager), 그래픽 매니저(graphic manager), 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입 출력 관리, 메모리 관리, 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션 중 적어도 하나의 어플리케이션의 생명 주기 (life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미 디어 매니저는 다양한 미디어 파일들의 재생에 필요한 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어 플리케이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리 할 수 있다. 파워 매니저는, 예를 들면, 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리 (battery) 또는 전원을 관리하고, 전자 장치의 동작에 필요한 전력 정보 등을 제공할 수 있다. 데이터베이스 매 니저는 어플리케이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색, 또는 변경할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 디스플레이 또는 통지 할 수 있다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용자 인증 등에 필요한 제반 보안 기능을 제공할 수 있다. 한 실시예에 따르면, 전자 장치(예: 전자 장 치)가 전화 기능을 포함한 경우, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위 한 통화 매니저(telephony manager)를 더 포함할 수 있다. 미들웨어는 전술한 구성요소들의 다양한 기능의 조합을 형성하는 미들웨어 모듈을 포함할 수 있다. 미들 웨어는 차별화된 기능을 제공하기 위해 운영 체제의 종류 별로 특화된 모듈을 제공할 수 있다. 또한, 미 들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. API(예: API)는, 예를 들면, API 프로그래밍 함수들의 집합으로, 운영 체제에 따라 다른 구성으로 제공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타 이젠(tizen)의 경우, 플랫폼 별로 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 프로그램)은, 예를 들면, 홈, 다이얼러, SMS/MMS, IM(instant message), 브라우저, 카메라, 알람, 컨택트, 음성 다이얼, 이메일, 달력, 미디어 플레이어, 앨범, 또는 시계, 건강 관리 (health care)(예: 운동량 또는 혈당 등을 측정), 또는 환경 정보 제공(예: 기압, 습도, 또는 온도 정보 등을 제공) 등의 기능을 수행할 수 있는 하나 이상의 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 전자 장치(예: 전자 장치)와 외부 전자 장치(예: 전자 장치 (102, 104)) 사이의 정보 교환을 지원하는 어플리케이션(이하, 설명의 편의상, \"정보 교환 어플리케이션\")을 포 함할 수 있다. 정보 교환 어플리케이션은, 예를 들면, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달 (notification relay) 어플리케이션, 또는 외부 전자 장치를 관리하기 위한 장치 관리(device management) 어 플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플 리케이션, 건강 관리 어플리케이션, 또는 환경 정보 어플리케이션 등)에서 발생된 알림 정보를 외부 전자 장치 (예: 전자 장치(102, 104))로 전달하는 기능을 포함할 수 있다. 또한, 알림 전달 어플리케이션은, 예를 들면, 외부 전자 장치로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치(102, 104))의 적어 도 하나의 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴-온/턴-오프 또는 디스플레이의 밝기(또는, 해상도) 조절), 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비 스(예: 통화 서비스 또는 메시지 서비스 등)를 관리(예: 설치, 삭제, 또는 업데이트)할 수 있다. 한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치(102, 104))의 속성(에 따라 지정된 어플리케이션(예: 모바일 의료 기기의 건강 관리 어플리케이션 등)을 포함할 수 있다. 한 실시예에 따르면, 어 플리케이션은 외부 전자 장치(예: 서버 또는 전자 장치(102, 104))로부터 수신된 어플리케이션을 포함할 수 있다. 한 실시예에 따르면, 어플리케이션은 프리로드 어플리케이션(preloaded application) 또는 서버로부터 다운로드 가능한 제3자 어플리케이션(third party application)을 포함할 수 있다. 도시된 실시예에 따른 프로그램 모듈의 구성요소들의 명칭은 운영 체제의 종류에 따라서 달라질 수 있다. 다양한 실시예에 따르면, 프로그램 모듈의 적어도 일부는 소프트웨어, 펌웨어, 하드웨어, 또는 이들 중 적어도 둘 이상의 조합으로 구현될 수 있다. 프로그램 모듈의 적어도 일부는, 예를 들면, 프로세서(예: 프로세서)에 의해 구현(implement)(예: 실행)될 수 있다. 프로그램 모듈의 적어도 일부는 하나 이상 의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트(sets of instructions) 또는 프로세 스 등을 포함할 수 있다. 본 문서에서 사용된 용어 \"모듈\"은, 예를 들면, 하드웨어, 소프트웨어 또는 펌웨어(firmware) 중 하나 또는 둘 이상의 조합을 포함하는 단위(unit)를 의미할 수 있다. \"모듈\"은, 예를 들면, 유닛(unit), 로직(logic), 논리 블록(logical block), 부품(component), 또는 회로(circuit) 등의 용어와 바꾸어 사용(interchangeably use)될 수 있다. \"모듈\"은, 일체로 구성된 부품의 최소 단위 또는 그 일부가 될 수 있다. \"모듈\"은 하나 또는 그 이상 의 기능을 수행하는 최소 단위 또는 그 일부가 될 수도 있다. \"모듈\"은 기계적으로 또는 전자적으로 구현될 수 있다. 예를 들면,\"모듈\"은, 알려졌거나 앞으로 개발될, 어떤 동작들을 수행하는 ASIC(application-specific integrated circuit) 칩, FPGAs(field-programmable gate arrays) 또는 프로그램 가능 논리 장치 (programmable-logic device) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따른 장치(예: 모듈들 또는 그 기능들) 또는 방법(예: 동작들)의 적어도 일부는, 예컨대, 프로 그램 모듈의 형태로 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구 현될 수 있다. 상기 명령어가 프로세서(예: 프로세서)에 의해 실행될 경우, 상기 하나 이상의 프로세서가 상기 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들면, 메모리가 될 수 있다. 컴퓨터로 판독 가능한 기록 매체는, 하드디스크, 플로피디스크, 마그네틱 매체(magnetic media)(예: 자기테이프), 광기록 매체(optical media)(예: CD-ROM(compact disc read only memory), DVD(digital versatile disc), 자기-광 매체(magneto-optical media)(예: 플롭티컬 디스크(floptical disk)), 하드웨어 장 치(예: ROM(read only memory), RAM(random access memory), 또는 플래시 메모리 등) 등을 포함할 수 있다. 또 한, 프로그램 명령에는 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해 서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함할 수 있다. 상술한 하드웨어 장치는 다양한 실시예 의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지다. 다양한 실시예에 따른 모듈 또는 프로그램 모듈은 전술한 구성요소들 중 적어도 하나 이상을 포함하거나, 일부 가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 다양한 실시예에 따른 모듈, 프로그램 모듈 또는 다른 구성요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱(heuristic)한 방법으로 실행될 수 있다. 또한, 일부 동작은 다른 순서로 실행되거나, 생략되거나, 또는 다른 동작이 추가될 수 있다. 다양한 실시 예에 따르면, 컴퓨터상에서 수행하기 위한 프로그램을 기록한 컴퓨터 판독 가능한 기록 매체에 있 어서, 상기 프로그램은, 프로세서에 의한 실행 시, 상기 프로세서가, 화면 상에 적어도 하나의 객체를 표시하는 동작; 상기 화면에 표시된 적어도 하나의 객체에 관련된 사용자의 제스처를 기반으로 상기 화면 상에서 노티피 케이션을 표시하기 위한 노티피케이션 표시 영역을 판단하는 동작; 및 판단된 적어도 하나의 노티피케이션 표시 영역에 상기 노티피케이션을 표시하는 동작;을 포함할 수 있다. 그리고 본 문서에 개시된 실시예는 개시된, 기술 내용의 설명 및 이해를 위해 제시된 것이며, 본 문서에서 기재 된 기술의 범위를 한정하는 것은 아니다. 따라서, 본 문서의 범위는, 본 문서의 기술적 사상에 근거한 모든 변 경 또는 다양한 다른 실시예를 포함하는 것으로 해석되어야 한다."}
{"patent_id": "10-2023-0055455", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시 예에 따른 네트워크 환경을 나타내는 도면이다. 도 2는 본 발명의 다양한 실시 예에 따른 전자 장치의 구성 예를 나타내는 도면이다. 도 3은 본 발명의 다양한 실시 예에 따른 전자 장치에서 표시되는 노티피케이션의 예를 나타내는 도면이다. 도 4는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 5는 본 발명의 다양한 실시 예에 따른 전자 장치에서 노티피케이션을 처리하기 위한 동작 절차를 나타내는 도면이다. 도 6은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 7은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 8은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 9는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 10은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 11은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 12는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 13은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 14는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 15는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 16은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 17은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 18은 본 발명의 다양한 실시 예에 따른 전자 장치에서 노티피케이션을 처리하기 위한 동작 절차를 나타내는 도면이다. 도 19는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 20은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 21은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 22는 본 발명의 다양한 실시 예에 따른 전자 장치에서 노티피케이션을 처리하기 위한 동작 절차를 나타내는 도면이다. 도 23은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 24는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다.도 25는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 26은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 27은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 28은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 화면 상에 표시되는 레이어들의 예를 나타내는 도면 이다. 도 29는 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 30은 본 발명의 다양한 실시 예에 따른 전자 장치에서의 노티피케이션의 표시 예를 나타내는 도면이다. 도 31은 다양한 실시예에 따른 전자 장치의 블록도이다. 도 32는 다양한 실시예에 따른 전자 장치의 프로그램 모듈의 블록도이다."}
