{"patent_id": "10-2020-0177568", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0087149", "출원번호": "10-2020-0177568", "발명의 명칭": "친환경 캠페인 실천자에 대한 발생금 저축 시스템 및 방법", "출원인": "건국대학교 글로컬산학협력단", "발명자": "정혜경"}}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말로부터 사용자 정보를 수신하는 단계;상기 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하는 단계; 매칭이 수행되어 생성된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출하는 단계;산출된 상기 발생금을 사용자의 금융 계좌로 저축하는 단계; 상기 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석하는 단계; 및분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성하기 위한 상기 친환경 캠페인 운동 정보를 추천하는 단계,를 포함하는, 저축 방법."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 사용자 정보에 포함된 결제 이력 정보와 데이터베이스에 포함된 친환경 매장 정보의 매칭을 수행하는 단계를 더 포함하되, 상기 발생금으로 산출하는 단계는, 상기 결제 이력 정보와 상기 데이터베이스에 포함된 친환경 매장 정보의 매칭 정보를 더 고려하여 친환경 캠페인 실천에 대한 발생금으로 산출하되,상기 친환경 매장 정보는, 일회용품을 사용하지 않는 매장으로 등록된 매장 정보를 포함하는 것인, 저축 방법."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,웨어러블 장치로부터 사용자의 활동 정보를 수신하는 단계; 및상기 사용자 단말 또는 상기 웨어러블 장치로부터 사용자의 현재 위치 정보를 획득하는 단계,를 더 포함하되,상기 친환경 캠페인 운동 정보를 추천하는 단계는, 상기 사용자 정보, 상기 활동 정보 및 상기 현재 위치 정보를 고려하여 상기 친환경 캠페인 운동 정보를 추천하는 것인, 저축 방법."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 친환경 캠페인 운동 정보를 추천하는 단계는, 상기 사용자의 현재 위치 정보를 기반으로 미리 설정된 범위 이내에 존재하는 친환경 캠페인 운동 실천 가게 리스트 생성하여 상기 친환경 캠페인 운동 정보로서 추천하는 것인, 저축 방법."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2022-0087149-3-상기 사용자 단말로부터 물품 이미지 정보를 수신하는 단계; 상기 물품 이미지 정보를 이미지 분석 알고리즘에 적용하여 분석하는 단계; 및상기 물품 이미지 정보의 분석 결과를 고려하여 재활용품 분리배출 정보를 제공하는 단계,를 더 포함하는 것인, 저축 방법."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,사용자 선호 물품 정보에 기초하여 웹(web)으로부터 상기 선호 물품 정보를 포함하는 쇼핑몰 정보를 획득하는단계; 상기 쇼핑몰 정보에 기초하여 상기 선호 물품이 포함된 웹 페이지를 크롤링(crawling)하는 단계; 및상기 크롤링한 웹 페이지에 포함된 물품 정보를 제공하는 단계,를 더 포함하는 저축 방법."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "사용자 단말로부터 사용자 정보를 수신하는 수신부;상기 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하는 매칭부;매칭이 수행된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출하는 산출부;산출된 상기 발생금을 사용자의 금융 계좌로 저축하는 저축부;상기 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석하는 분석부; 및분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성하기 위한 상기 친환경 캠페인 운동 정보를 추천하는 추천부,를 포함하는, 저축 장치."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "친환경 캠페인 실천에 대한 발생금으로부터 저축을 수행하기 위한 사용자 정보를 제공하는 사용자 단말; 및상기 사용자 단말로부터 제공받은 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하여,친환경 캠페인 실천에 대한 발생금을 산출하고, 사용자의 금융 계좌로 저축하는 저축 장치,를 포함하는, 저축 시스템."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 저축 장치는, 사용자 단말로부터 사용자 정보를 수신하는 수신부;상기 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하는 매칭부;매칭이 수행된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출하는 산출부;산출된 상기 발생금을 사용자의 금융 계좌로 저축하는 저축부;상기 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석하는 분석부; 및분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성하기 위한 상기 친환경 캠페인 운동 정보를 추천하는 추천부,를 포함하는 것인, 저축 시스템. 공개특허 10-2022-0087149-4-청구항 10 제9항에 있어서,상기 매칭부는, 상기 사용자 정보에 포함된 결제 이력 정보와 데이터베이스에 포함된 친환경 매장 정보의 매칭을 수행하고, 상기 산출부는,상기 결제 이력 정보와 상기 데이터베이스에 포함된 친환경 매장 정보의 매칭 정보를 더 고려하여 친환경 캠페인 실천에 대한 발생금으로 산출하되,상기 친환경 매장 정보는, 일회용품을 사용하지 않는 매장으로 등록된 매장의 식별 정보를 포함하는 것인, 저축 시스템."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 수신부는, 웨어러블 장치로부터 사용자의 활동 정보를 수신하고, 상기 사용자 단말 또는 상기 웨어러블 장치로부터 사용자의 현재 위치 정보를 획득하되,상기 추천부는, 상기 사용자 정보, 상기 활동 정보 및 상기 현재 위치 정보를 고려하여, 상기 활동 정보를 분석하여 상기 친환경 캠페인 운동 정보를 추천하는 것인, 저축 시스템."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 추천부는,상기 사용자의 현재 위치 정보를 기반으로 미리 설정된 범위 이내에 존재하는 친환경 캠페인 운동 실천 가게 리스트 생성하여 상기 친환경 캠페인 운동 정보를 추천하는 것인, 저축 시스템."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서,상기 저축 장치는, 재활용품 분리배출 정보를 제공하는 제공부를 더 포함하되,상기 수신부는 상기 사용자 단말로부터 물품 이미지 정보를 수신하고,상기 분석부는 상기 물품 이미지 정보를 이미지 분석 알고리즘에 적용하여 분석하되,상기 제공부는 상기 물품 이미지 정보의 분석 결과를 고려하여 재활용품 분리배출 정보를 제공하는 것인, 저축시스템."}
{"patent_id": "10-2020-0177568", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 제공부는, 사용자 선호 물품 정보에 기초하여 웹(web)으로부터 상기 선호 물품 정보를 포함하는 쇼핑몰 정보를 획득하고,상기 쇼핑몰 정보에 기초하여 상기 선호 물품이 포함된 웹 페이지를 크롤링(crawling)하여, 상기 크롤링한 웹페이지에 포함된 물품 정보를 제공하는 것인, 저축 시스템. 공개특허 10-2022-0087149-5-청구항 15 제1항 내지 제6항 중 어느 한 항의 방법을 컴퓨터에서 실행하기 위한 프로그램을 기록한 컴퓨터에서 판독 가능한 기록매체."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "친환경 캠페인 실천자에 대한 발생금 저축 방법에 관한 것이며, 저축 방법은, 사용자 단말로부터 사용자 정보를 수신하는 단계, 상기 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하는 단계, 매칭이 수행된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출하는 단계, 산출된 상기 발생금을 사용자의 금융 계좌로 저축하는 단계, 상기 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석하 는 단계 및 분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성하기 위한 상기 친환경 캠페인 운동 정보를 추천하는 단계를 포함할 수 있다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본원은 친환경 캠페인 실천자에 대한 발생금 저축 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "환경부에 따르면 2017년 기존 우리나라에서 발생하는 총 폐기물은 41만 4626톤이며 이 중 5만 3490톤이 생활 폐 기물이라고 한다. 한번 쓰고 버리는 편리함 때문에 이용하게 되는 일회용 컵을 재활용만 해도 경제적 효과가 크 다. 플라스틱은 ‘얽힘’과 ‘섭취’로 해양생태계에 영향을 준다. ‘얽힘’은 물리적인 피해로, 동물이 그물에 걸 리는 것 등이 그 예이다. 실제로 매년 3만 마리의 바다표범이 그물에 걸려 질식사한다. ‘섭취’는 말 그대로 해양 생물이 플라스틱을 먹어 생기는 피해다. 의도적으로 작게 만들어진 펠렛, 플라스틱 분말 등의 1차 미세플 라스틱, 대형 플라스틱이 쪼개지고 마모되어 생성되는 2차 미세플라스틱은 해양생물의 먹이로 오인되기 쉽다. 미세플라스틱 표면에 중금속, DDT 등 잔류성이 높고 유동성이 큰 독성물질이 흡착되는 일이 자주 발생한다. 해 양생물이 이를 섭취해 체내에 축적되면 이 물질들은 다이옥신, 아크롤레인 등 유해성 발암물질로 변형된다. 이 는 해양생물의 생명과도 직결되는 문제이다. 설령 그 생물이 직접적인 피해를 입지 않더라도, 해당 생물을 먹이 로 하는 인간을 포함한 다른 생물에 영향을 주기 때문에, 최종적으로는 생태계를 파괴한다. 플라스틱 입자가 작 아질수록 영향을 받는 생물의 범위가 확대되며, 위와 같은 피해는 매년 증가하고 있다. 이 피해를 줄이기 위해 환경부는 커피 전문점 및 패스트푸드점과 자율협약을 맺고 매장 내 일회용 컵 규제를 하 였다. 본원의 배경이 되는 기술은 한국공개특허 제10-2012-0046944호에 개시되어 있다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 서비스 이용자에게 친환경 캠페인을 권장하여 일 회용품 줄이기를 신청하고, 사용자가 친환경 활동을 하여 발생하는 돈을 저축할 수 있도록 환산하여 제공할 수 있는 친환경 캠페인 실천자에 대한 발생금 저축 시스템 및 방법을 제공하려는 것을 목적으로 한다. 본원은 전술한 종래 기술의 문제점을 해결하기 위한 것으로서, 서비스 이용자에게 친환경 캠페인을 권장하여 일 회용품 줄이기를 실천하고자 하며, 사용자가 친환경 활동을 하여 발생하는 돈을 저축할 수 있도록 환산하여 제 공할 수 있는 친환경 캠페인 실천자에 대한 발생금 저축 시스템 및 방법을 제공하려는 것을 목적으로 한다. 다만, 본원의 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본원의 일 실시예에 따른 저축 방법은, 사용자 단말로 부터 사용자 정보를 수신하는 단계, 상기 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수 행하는 단계, 매칭이 수행되어 생성된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출하는 단계, 산출 된 상기 발생금을 사용자의 금융 계좌로 저축하는 단계, 상기 사용자 정보를 인공지능 기반의 학습 모델에 적용 하여 사용자의 생활 패턴을 분석하는 단계 및 분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성 하기 위한 상기 친환경 캠페인 운동 정보를 추천하는 단계를 포함할 수 있다. 또한, 저축 방법은, 상기 사용자 정보에 포함된 결제 이력 정보와 데이터베이스에 포함된 친환경 매장 정보의 매칭을 수행하는 단계를 더 포함하되, 상기 발생금으로 산출하는 단계는, 상기 결제 이력 정보와 상기 데이터베이스에 포함된 친환경 매장 정보의 매칭 정보를 더 고려하여 친환경 캠페인 실천에 대한 발생금으로 산출하되, 상기 친환경 매장 정보는, 일회용품을 사용하지 않는 매장으로 등록된 매장 정보를 포함할 수 있다. 또한, 저축 방법은, 웨어러블 장치로부터 사용자의 활동 정보를 수신하는 단계 및 상기 사용자 단말 또는 상기 웨어러블 장치로부터 사용자의 현재 위치 정보를 획득하는 단계를 더 포함하되, 상기 친환경 캠페인 운동 정보 를 추천하는 단계는, 상기 사용자 정보, 상기 활동 정보 및 상기 현재 위치 정보를 고려하여 상기 친환경 캠페 인 운동 정보를 추천할 수 있다. 또한, 상기 친환경 캠페인 운동 정보를 추천하는 단계는, 상기 사용자의 현재 위치 정보를 기반으로 미리 설정 된 범위 이내에 존재하는 친환경 캠페인 운동 실천 가게 리스트 생성하여 상기 친환경 캠페인 운동 정보로서 추 천할 수 있다. 또한, 저축 방법은, 상기 사용자 단말로부터 물품 이미지 정보를 수신하는 단계, 상기 물품 이미지 정보를 이미 지 분석 알고리즘에 적용하여 분석하는 단계 및 상기 물품 이미지 정보의 분석 결과를 고려하여 재활용품 분리 배출 정보를 제공하는 단계를 더 포함할 수 있다. 또한, 저축 방법은, 사용자 선호 물품 정보에 기초하여 웹(web)으로부터 상기 선호 물품 정보를 포함하는 쇼핑 몰 정보를 획득하는 단계, 상기 쇼핑몰 정보에 기초하여 상기 선호 물품이 포함된 웹 페이지를 크롤링 (crawling)하는 단계 및 상기 크롤링한 웹 페이지에 포함된 물품 정보를 제공하는 단계를 더 포함할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는, 사용자 단말로부터 사용자 정보를 수신하는 수신부, 상기 사용자 정 보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하는 매칭부, 매칭이 수행된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출하는 산출부, 산출된 상기 발생금을 사용자의 금융 계좌로 저축하는 저축부, 상기 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석하는 분석부 및 분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성하기 위한 상기 친환경 캠페인 운동 정보를 추 천하는 추천부를 포함할 수 있다. 본원의 일 실시예에 따르면, 저축 시스템은, 친환경 캠페인 실천에 대한 발생금으로부터 저축을 수행하기 위한 사용자 정보를 제공하는 사용자 단말 및 상기 사용자 단말로부터 제공받은 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하여, 친환경 캠페인 실천에 대한 발생금을 산출하고, 사용자의 금융 계좌로 저축하는 저축 장치를 포함할 수 있다. 또한, 저축 장치는, 상기 매칭부는, 상기 사용자 정보에 포함된 결제 이력 정보와 데이터베이스에 포함된 친환 경 매장 정보의 매칭을 수행하고, 상기 산출부는, 상기 결제 이력 정보와 상기 데이터베이스에 포함된 친환경 매장 정보의 매칭 정보를 더 고려하여 친환경 캠페인 실천에 대한 발생금으로 산출하되, 상기 친환경 매장 정보 는, 일회용품을 사용하지 않는 매장으로 등록된 매장의 식별 정보를 포함할 수 있다. 또한, 상기 수신부는, 웨어러블 장치로부터 사용자의 활동 정보를 수신하고, 상기 사용자 단말 또는 상기 웨어 러블 장치로부터 사용자의 현재 위치 정보를 획득하되, 상기 추천부는, 상기 사용자 정보, 상기 활동 정보 및 상기 현재 위치 정보를 고려하여, 상기 활동 정보를 분석하여 상기 친환경 캠페인 운동 정보를 추천할 수 있다. 또한, 상기 추천부는, 상기 사용자의 현재 위치 정보를 기반으로 미리 설정된 범위 이내에 존재하는 친환경 캠 페인 운동 실천 가게 리스트 생성하여 상기 친환경 캠페인 운동 정보를 추천할 수 있다. 또한, 상기 저축 장치는, 재활용품 분리배출 정보를 제공하는 제공부를 더 포함하되, 상기 수신부는 상기 사용 자 단말로부터 물품 이미지 정보를 수신하고, 상기 분석부는 상기 물품 이미지 정보를 이미지 분석 알고리즘에 적용하여 분석하되, 상기 제공부는 상기 물품 이미지 정보의 분석 결과를 고려하여 재활용품 분리배출 정보를 제공할 수 있다. 또한, 상기 제공부는, 사용자 선호 물품 정보에 기초하여 웹(web)으로부터 상기 선호 물품 정보를 포함하는 쇼 핑몰 정보를 획득하고, 상기 쇼핑몰 정보에 기초하여 상기 선호 물품이 포함된 웹 페이지를 크롤링(crawling)하 여, 상기 크롤링한 웹 페이지에 포함된 물품 정보를 제공할 수 있다. 상술한 과제 해결 수단은 단지 예시적인 것으로서, 본원을 제한하려는 의도로 해석되지 않아야 한다. 상술한 예 시적인 실시예 외에도, 도면 및 발명의 상세한 설명에 추가적인 실시예가 존재할 수 있다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본원의 과제 해결 수단에 의하면, 친환경 캠페인을 실천하고 그로 인한 발생금을 저축하여 불필요한 지 출 발생을 막아주는 효과가 있음. 전술한 본원의 과제 해결 수단에 의하면 자신이 구매하고 싶은 물품을 선정하고, 친환경 저축금액이 물품의 금 액을 충족하면 구매하는 서비스를 통해 사용자의 목표의식을 고취시킬 수 있는 효과가 있음. 다만, 본원에서 얻을 수 있는 효과는 상기된 바와 같은 효과들로 한정되지 않으며, 또 다른 효과들이 존재할 수 있다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본원이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본원의 실시예를 상세히 설명한다. 그러나 본원은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본원을 명확하게 설명하기 위해서 설명과 관계없는 부분 은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본원 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\" 또는 \"간접적으로 연결\"되어 있는 경우 도 포함한다. 본원 명세서 전체에서, 어떤 부재가 다른 부재 \"상에\", \"상부에\", \"상단에\", \"하에\", \"하부에\", \"하단에\" 위치 하고 있다고 할 때, 이는 어떤 부재가 다른 부재에 접해 있는 경우뿐 아니라 두 부재 사이에 또 다른 부재가 존 재하는 경우도 포함한다. 본원 명세서 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 도 1은 본원의 일 실시예에 따른 저축 시스템의 개략적인 구성도이다. 도 1을 참조하면, 본원의 일 실시예에 따른 저축 시스템은 저축 장치, 사용자 단말 및 웨어러블 장 치를 포함할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 단말로부터 제공받은 사용자 정보와 미리 설정된 친환 경 캠페인 정보 간의 매칭을 수행하여, 친환경 캠페인 실천에 대한 발생금을 산출하고, 사용자의 금융 계좌로저축을 수행할 수 있다. 또한, 저축 장치는 친환경 운동 단위(시간, 개수 등)를 입력하면, 자동으로 환산하여 친환경 운동을 수행함 으로써 발생하는 금액 정보를 제공하고, 쇼핑몰과 연동하여 사용자가 구매하고자 하는 제품의 정보와 쇼핑몰 사 이트로 바로 이동이 가능한 서비스를 제공할 수 있다. 또한, 저축 장치는 목표 금액을 설정해 목표도달까지 남은 금액을 측정하여 제공하고, 지정된 친환경 운동 외에 자신이 실천하고자 하는 친환경 운동을 따로 기입할 수 있는 서비스를 제공할 수 있다. 또한, 저축 장치는 사용자의 소비 내역, 활동 내역, SNS이력, 검색 이력 등을 고려하여 사용자가 실천할 수 있는 친환경 운동을 추천할 수 있다. 또한, 저축 장치는 웨어러블 장치(사용자 착용 단말)등과 연계하여 차량 및 교통편, 계단 사용하기 등의 친 환경을 위해 실천한 운동 정보를 수집하고, 이를 금액으로 환산하여 발생금액 정보를 제공할 수 있다. 사용자 단말은 친환경 캠페인 실천에 대한 발생금으로부터 저축을 수행하기 위한 사용자 정보를 제공할 수 있다. 저축 장치, 사용자 단말 및 웨어러블 장치 상호간은 네트워크를 통해 통신할 수 있다. 네트워 크는 단말들 및 서버들과 같은 각각의 노드 상호간에 정보 교환이 가능한 연결 구조를 의미하는 것으로, 이 러한 네트워크의 일 예에는, 3GPP(3rd Generation Partnership Project) 네트워크, LTE(Long Term Evolution) 네트워크, 5G 네트워크, WIMAX(World Interoperability for Microwave Access) 네트워크, 인터넷 (Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), wifi 네트워크, 블루투스(Bluetooth) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않 는다. 사용자 단말은 예를 들면, 스마트폰(Smartphone), 스마트패드(SmartPad), 태블릿 PC등과 PCS(Personal Communication System), GSM(Global System for Mobile communication), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말기 같은 모든 종류의 무선 통신 장치일 수 있다. 웨어러블 장치는 사용자의 신체 일부에 부착 또는 착용되어 사용자의 생체 정보를 획득하는 장치일 수 있다. 예를 들어, 스마트 워치, 스마트 패치, 스마트 안경, 스마트 의복, 스마트 밴드, 스마트 신발 등을 포함 할 수 있다. 도면에 도시하지 않았으나, 본원의 일 실시예에 따르면, 저축 시스템은 공동 참여자 단말(미도시)을 포함할 수 있다. 본원의 실시예에 관한 설명에서 공동 참여자 단말(미도시)은 사용자 단말의 사용자와 공동으로 친 환경 캠페인을 참여하는 사용자(예를 들어, 부모, 자녀, 가족, 친구 등)에 해당하는 주체가 보유한 단말일 수 있다. 본원의 일 실시예에 따르면, 공동 참여자 단말(미도시)은 본원의 저축 장치에 의해 제공되는 어플리 케이션 기반 서비스에 대한 사용자 단말의 최초 가입 시 또는 어플리케이션 기반 서비스 사용 도중 사용자 단말에 의해 인가되는 공동 참여자 등록 입력에 기초하여 설정되어 저축 장치에 등록되는 것일 수 있다. 특히 본원의 일 실시예에 관한 설명에서 공동 참여자 단말(미도시)은 사용자 단말에 제공되는 친환경 캠페인 운동 정보를 포함하는 복수의 콘텐츠 및 알림 정보 등을 사용자 단말과 함께 획득할 수 있다. 예시 적으로, 저축 장치는 사용자 단말에 연계된 공동 참여자 단말(미도시)이 친환경 캠페인을 실천하여 생 성된 발생금을 사용자 단말의 사용자의 금융 계좌로 저축할 수 있다. 본원에서의 저축 장치는 임의의 사용자(예를 들면, 어플리케이션 기반 서비스의 회원)에게 친환경 캠페인 운동 정보를 제공하고, 친환경 캠페인 실천에 대한 발생금을 사용자의 금융 계좌로 저축하는 프로세스를 지원하 고, 친환경 캠페인 운동 저축 관련 제반 사항 등을 사용자 단말을 통해 용이하게 관리할 수 있도록 어플리 케이션 기반 서비스를 제공하는 주체일 수 있다. 예를 들어, 저축 장치는 어플리케이션 기반 서비스를 제공 하는 단말 또는 서버일 수 있다. 도 2는 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 로그인 인터페이스를 예시적으로 나 타낸 도면이다. 도 2는 저축 장치에 의해 제공되는 어플리케이션 기반 서비스가 사용자 단말에 실행되 는 경우 표시되는 초기 인터페이스 및 로그인 인터페이스를 나타낸 것일 수 있다. 도 2를 참조하면, 도 2의 (a)는 저축 장치에 의해 제공되는 어플리케이션 기반 서비스가 사용자 단말에 실행되는 경우 표시되는 초기 인터페이스를 나타낸 것으로, 친환경 캠페인 실천자에 대한 발생금 저축 어플리케 이션을 표현한 ‘Bank’와 ‘be’의 B 지구형태와 흡사한 로고형태의 인터페이스로 표현될 수 있다. 또한, 도 2의 (b)를 참조하면, 도 2의 (b)는 로그인 인터페이스로, 사용자가 초기 설정해둔 비밀번호의 입력을 통해 메인 페이지로 이동이 가능하다, 일예로, 회원가입을 실시하지 않은 사용자의 경우, 회원가입 페이지를 제 공하고, 회원가입 시 제공되는 복수의 항목에 대한 입력으로 사용자의 개인 정보를 제공받을 수 있다. 사용자 의 개인 정보는, 아이디, 비밀번호, 사용자 단말 식별번호, 사용자 금융 계좌 정보, 공동 참여자 단말 정보, 이 메일, 핸드폰 번호 등을 포함할 수 있다. 도 3은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 메인 페이지 인터페이스를 예시적으 로 나타낸 도면이다. 도 3의 (a)는 로그인 수행 시 완료 시 제공되는 메인 페이지 화면일 수 있다. 메인 페이지는, 메뉴 제공 바(A), 목표 달성 항목(B), 목표 달성 금액(C), 친환경 캠페인 수행 정보(D) 등을 포함할 수 있으나, 이에 한정되는 것 은 아니다. 다른 예로, 저축 장치에 의해 제공되는 어플리케이션 기반 서비스의 초기 인터페이스에는 본원 의 구현예에 따라 상술한 복수의 섹션 중 일부만 표시되거나 다른 유형의 추가적인 섹션이 표시되도록 구현될 수 있다. 일예로, 메뉴 제공 바(A)는 카테고리 선택 항목, 검색 항목, 메인 페이지 이동 항목, 달력 항목, MY 페이지 이 동 항목을 포함할 수 있다. 또한, 목표 달성 항목(B)은 사용자가 미리 설정한 저축금액 달성률을 퍼센테이지 (percentage)로 환산하여 사용자에게 보다 직관적으로 목표 달성률을 제공할 수 있다. 또한, 목표 달성 금액 (C)은 사용자가 미리 설정한 저축금액과 친환경 캠페인 수행으로 인해 발생한 발생금과의 차이 금액에 관한 정 보를 포함할 수 있다. 또한, 저축 장치는 목표 발성 금액(C) 정보와 사용자가 친환경 캠페인을 수행한 시작 일자 정보를 제공할 수 있다. 친환경 캠페인 수행 정보(D)는 사용자가 현재까지 실천한 친환경 캠페인 운동을 카테고리 별로 분류하여 각각 의 카테고리별로 발생한 금액 정보인 발생금 정보를 포함할 수 있다. 예를 들어, 친환경 캠페인 운동에 대한 카 테고리는 크게 일회용품 줄이기, 에너지 절약, 차량 및 교통편, 올바른 분리배출, 계단사용 등으로 구분될 수 있다. 다만, 친환경 캠페인 운동에 대한 카테고리가 이에 한정되는 것은 아니며 다양한 일 실시예가 존재할 수 있다. 일예로, 세부적으로 일회용품 줄이기 항목에는, 텀블러 사용, 다회용기 사용 등이 포함될 수 있다. 또한, 에너지 절약에는, 권장 냉난방 온도 준수, 플러그 뽑기, 에너지 효율 1등급인 가전제품 사용하기 등이 포함될 수 있다. 또한, 차량 및 교통편 항목에는, 30분 이내의 거리는 걸어다니기, 대중교통 사용하기 등이 포함될 수 있다. 도 3의 (b)는 하루 동안 사용자가 실천한 친환경 캠페인의 운동 종류와 그에 따라 발생한 금액인 발생금 정보를 표시한 인터페이스 일 수 있다. 저축 장치는 하루마다 사용자가 실천한 친환경 캠페인과 그에 따라 발생한 발생금 정보를 생성하고, 사용자 단말로 제공할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 단말로 사용자 정보를 수신할 수 있다. 일예로, 사용 자 정보는, 건강 정보, SNS 정보, 소비 패턴 정보, 생활 환경 정보 및 사용자의 개인 정보를 포함할 수 있다. 예를 들어, 건강 정보는, 걸음수, 수면 시간, 심박 수, 맥박, 심박, 체온 정보, 의료 기록 정보 등을 포함할 수 있다. 또한, SNS 정보는, 사용자 단말과 연계된 식별 번호를 기반으로 가입된 SNS 정보의 게시글, 좋아요 입력 정보, 특정 키워드 검색 정보, 게시글 수집 정보 등을 포함할 수 있다. 또한, 소비 패턴 정보는, 사용자의 신용카드 및 체크카드 사용 내역 분석 정보 및 현금영수증 입력 정보 등을 포함할 수 있다. 또한, 생활 환경 정 보는, 사용자가 거주하고 있는 지역의 상권분석 정보, 사용자의 식습관 분석 정보, 외식의 빈도수, 배달음식 주 문 횟수, 대중교통 사용 기록 등을 포함할 수 있다. 또한, 사용자의 개인 정보는, 아이디, 패스워드, 주소, 병 력, 현재 기분 상태, 연령, 성별, 인종, 전화번호, 사용자 단말 정보, 어플리케이션 사용 이력 등의 다양한 개 인정보를 포함할 수 있다. 또한, 저축 장치는 웨어러블 장치로부터 사용자의 활동 정보를 수신할 수 있다. 사용자의 활동 정보는, 심박, 맥박, 체온, 혈류량(혈액량), 심전도, 운동량, 걸음수 등을 포함할 수 있다. 저축 장치는 사 용자가 웨어러블 장치를 착용하고 있는 동안 소정의 시간 간격마다 수집되는 활동 정보를 수신할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행할 수 있다. 예를 들어, 저축 장치는 사용자 정보에 포함된 사용자의 소비 패턴 정보와 친환경 캠페인운동 정보 간의 매칭을 수행할 수 있다. 사용자는 사용자 단말을 통해 제1카페에서 사이렌 오더로 주문을 수행할 수 있다. 해당 주문 정보에는 다회용 용기 사용을 선택한 정보가 포함될 수 있다. 저축 장치는 해 당 주문 정보와 미리 설정된 친환경 캠페인 운동 정보인 일회용품 사용 줄이기 항목과 매칭을 수행할 수 있다. 제1카페에서 다회용 용기를 사용할 경우, 기존 음료 값에서 300원이 할인될 수 있다. 저축 장치는 이러한 할인 금액을 친환경 캠페인 실천에 대한 발생금으로 산출하여 저축을 유도할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 매칭이 수행된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으 로 산출할 수 있다. 예를 들어, 저축 장치는 사용자가 제1카페에서 다회용 용기를 사용함으로써 절약한 금 액(예를 들어, 300원 할인)을 친환경 캠페인 실천에 대한 발생금으로 산출할 수 있다. 예시적으로, 도 4의 (b)를 참조하면, 저축 장치는 사용자 정보에 포함된 제1 정보와 미리 설정된 친환경 캠 페인 운동 정보인 에너지 절약과 매칭되는 경우 해당 금액을 친환경 캠페인 실천에 대한 발생금으로 산출할 수 있다. 일예로, 제1정보는, 해당 달의 사용자의 전기세 또는 관리비 납부 금액과 지난 달의 사용자의 전기세 또 는 관리비 납부 금액을 기반으로 산출된 정보일 수 있다. 또한, 저축 장치는 제2정보와 미리 설정된 친환경 캠페인 운동 정보인 계단 사용하기와 매칭되는 경우 해당 금액을 친환경 캠페인 실천에 대한 발생금으로 산출할 수 있다. 제2정보는, 웨어러블 장치로부터 수집된 사 용자의 활동 정보일 수 있다. 사용자의 활동 정보에는 사용자의 걸음 수를 기반으로 생성된 계단 사용 예측 정 보가 포함될 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 정보에 포함된 제3정보(예를 들어, 결제 이력 정보)와 데 이터베이스에 포함된 친환경 매장 정보의 매칭을 수행할 수 있다. 저축 장치는 사용자 정보에 친환경 매장 에서 결제를 수행한 결제 이력 정보가 포함된 경우, 일회용품 줄이기와 같은 친환경 캠페인 운동을 수행한 것으 로 판단할 수 있다. 여기서, 친환경 매장 정보는, 일회용품을 사용하지 않는 매장으로 등록된 매장 정보를 포 함할 수 있다. 일예로, 친환경 매장은 마르쉐, 보틀팩토리, 더커피, 새활용플라자와 같이 야채 등의 농산물, 과 자류 등의 식품, 세제 및 샴푸 등의 생활용품을 일회용 플라스틱 포장재를 사용하지 않고 무포장(벌크 제품)으 로 판매하는 매장을 의미할 수 있다. 또한, 저축 장치는 제3정보(예를 들어, 결제 이력 정보)와 데이터베이스에 포함된 친환경 매장 정보의 매칭 정보를 고려하여 친환경 캠페인 실천에 대한 발생금을 산출할 수 있다. 데이터베이스는 친환경 매장 정보와 해 당 매장 이용시 발생할 수 있는 발생금을 연계하여 저장할 수 있다. 예를 들어, 친환경 매장 정보에 포함된 제 1매장을 이용할 경우, 발생하는 친환경 발생금은 제1금액(예를 들어, 100원), 제2매장을 이용할 경우, 발생하는 친환경 발생금은 제2금액(예를 들어, 200원)일 수 있다. 저축 장치는 제3정보(예를 들어, 결제 이력 정 보)와 친환경 매장 정보의 매칭을 수행하여 데이터베이스에 연계하여 저장된 발생금을 친환경 캠페인 실천에 대 한 발생금으로 산출할 수 있다. 달리 말해, 사용자 정보에 제1매장에서 물품을 구매한 결제 이력 정보가 포함된 경우, 저축 장치는 제1금액(예를 들어, 100원)으로 친환경 캠페인 실천에 대한 발생금을 산출할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 산출된 발생금을 사용자의 금융 계좌로 저축할 수 있다. 일예로, 저축 장치는 사용자의 금융 계좌로 저축하기 이전에 위한 가상 계좌에 사용자의 발생금을 적립할 수 있다. 저축 장치는 산출된 발생금이 일정 금액 이상인 경우, 사용자의 금융 계좌로 산출된 발생금을 저축할 수 있 다. 사용자는 친환경 캠페인 운동을 수행하여 발생된 발생금을 저축하고자 하는 금융 계좌 정보를 사용자 단말 을 통해 등록하고, 저축 장치는 해당 금융 계좌로 발생금을 저축할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석할 수 있다. 일예로, 저축 장치는 비지도 학습 기반의 군집 알고리즘에 기초하여 사용자의 생활 패턴을 산출할 수 있다. 비지도 학습이란 학습용 데이터를 구축하는 것이 아닌 데이터 자체를 분석하거나 군집하면서 학습하는 알고리즘을 의미한다. 저축 장치는 군집 알고리즘에 기초하여 복수의 정보가 포함된 사용자 정보를 군집하여 산출할 수 있다. 예시적으로, 비지도 학습을 위한 군집 알고리즘에는 로지스틱 회귀 알 고리즘, 랜덤 포레스트 알고리즘, SVM(Support Vector Machine)알고리즘, 의사결정 알고리즘 및 군집 알고리즘 이 이용될 수 있다. 또한, 저축 장치는 상술한 알고리즘 외에도 Extra Tree알고리즘, XG Boost알고리즘 및 Deep Learning 알고 리즘, K-means 클러스터링 알고리즘, SOM(Self-Organizing-Maps) 알고리즘 EM & Canopy 알고리즘과 같은 군집 알고리즘을 통해 비지도 학습을 수행할 수 있다. Random Forest알고리즘은 수많은 Decision Tree들이 Forest를 구성하여 각각의 예측결과를 하나의 결과변수로 평균화 하는 알고리즘이고, SVM알고리즘은 데이터의 분포공간에서 가장 큰 폭의 경계를 구분하여 데이터가 속하는 분류를 판단하는 비확률적 알고리즘이다. Extra Tree알고리 즘은 Random forest와 비슷하나 속도가 Random forest에 비해 빠른 알고리즘이며, XGBoost알고리즘은 Random Forest의 Tree는 독립적이라면 XGBoost의 Tree의 결과를 다음 트리에 적용하는 boost방식의 알고리즘이다. Deep Learning알고리즘은 다층구조의 Neural Network을 기반으로 변수의 패턴이 결과에 미치는 영향을 가중치로 조절 하며 학습하는 알고리즘이다. 또한, K-means 클러스터링 알고리즘은 전통적인 분류기법으로 대상집단을 거리의 평균값(유사도)을 기준으로 K개의 군집으로 반복 세분화하는 기법이고, SOM알고리즘은 인공신경망을 기반으로 훈련집합의 입력 패턴을 가중치로 학습하여 군집화하는 기법이다. 또한 EM & Canopy 알고리즘은 주어진 초기값 으로 가능성이 최대인 것부터 반복 과정을 통해 파라미터 값을 갱신하여 군집화 하는 기법을 의미한다. 또한, 저축 장치는 분석된 생활 패턴 정보를 고려하여 미리 설정된 목표 금액을 달성하기 위한 친환경 캠페 인 운동 정보를 추천할 수 있다. 저축 장치는 사용자의 생활 패턴을 일주일에 2회 배달음식 주문, 4회 카페 방문, 1회 마트 방문 등과 같이 친환경 캠페인을 실천할 수 있는 상황과 연계하여 생활 패턴 분석을 수행할 수 있다. 저축 장치는 분석된 생활 패턴에서 일회용품의 사용을 줄일 수 있는 카페 방문시 텀블러 사용, 마트 방문시 장바구니 활용 등과 같은 친환경 캠페인 운동 정보를 추천할 수 있다. 또한, 저축 장치는 사용자의 SNS 정보 분석을 통해 사용자와 유사한 성향을 가지고 있는 사용자가 실천중인 친환경 캠페인 운동 정보를 추천할 수 있다. 예를 들어, 저축 장치는 사용자의 SNS 정보 분석 결과 사용자 가 특정 브랜드의 메이크업 제품에 관심이 있는 것으로 분석 된 경우, 해당 브랜드를 선호하는 타 사용자가 해 당 브랜드를 이용하여 획득하고 있는 발생금과 관련된 친환경 캠페인 운동 정보를 추천할 수 있다. 저축 장치 는 타 사용자가 특정 브랜드의 메이크업 제품을 다 사용하고 난 이후 빈 용기를 모아 해당 브랜드에 반납한 이후 친환경 캠페인 실천에 대한 발생금을 획득한 정보에 기반하여, 사용자 단말로 해당 브랜드의 용기 반 납시 제공되는 발생금에 대한 정보를 제공할 수 있다. 저축 장치가 다양한 사용자가 친환경 캠페인 운동을 수행함으로써 저축하고 있는 발생금에 대한 정보를 사 용자에게 추천함으로써, 한정된 친환경 캠페인 운동이 아닌, 사용자의 참여도를 높일 수 있도록 흥미를 유발할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 단말 또는 웨어러블 장치로부터 사용자의 현재 위 치 정보를 획득할 수 있다. 예를 들어, 저축 장치는 사용자 단말로부터 사용자의 현재 위치 정보를 획 득할 수 있다. 반면, 저축 장치는 사용자가 사용자 단말을 휴대하고 있지 않은 경우 웨어러블 장치(3 0)로부터 사용자의 현재 위치 정보를 획득할 수 있다. 또한, 저축 장치는 사용자 정보, 활동 정보, 현재 위치 정보를 고려하여 친환경 캠페인 운동 정보를 추천할 수 있다. 예를 들어, 저축 장치는 분석된 생활 패턴 정보에서 사용자가 특정 시간(예를 들어, 7시 내지 8 시 사이)에 지하철 역에 도착하고, 지하철 역에서부터 집까지 걸어서 20분이 걸린다는 분석 결과가 포함된 경우, 친환경 캠페인 운동 정보 중 도보를 이용한 운동 방법을 추천할 수 있다. 저축 장치는 미리 설정된 걸음 수 이상의 정보가 획득된 경우, 포인트를 적립하고 적립된 포인트를 발생금으로 환산하여 사용자의 금융 계좌로 저축을 수행할 수 있다. 다른 예로, 사용자의 현재 위치에서 제1매장(일회용품 비사용 매장) 및 제2매장 (일회용품 사용 매장)이 위치하되, 사용자의 현재 위치에서 제2매장에 비해 제1매장이 멀더라도 일회용품을 사 용하지 않은 매장인 제1매장을 추천할 수 있다. 또한, 저축 장치는 사용자의 현재 위치 정보를 기반으로 미리 설정된 범위 이내에 존재하는 친환경 캠페인 운동 실천 가게 리스트를 생성하여 친환경 캠페인 운동 정보로서 추천할 수 있다. 저축 장치는 데이터 베이 스에 저장된 친환경 매장 정보와 사용자의 현재 위치 정보를 기반으로 미리 설정된 범위 이내에 존재하는 매장 들의 우선순위를 선정하여 친환경 캠페인 운동 실천 가게 리스트를 생성하여 사용자가 해당 매장을 방문하도록 친환경 캠페인 운동 정보로서 추천할 수 있다. 일예로, 저축 장치는 사용자가 미리 설정한 복수의 매장 평가 항목을 고려하여 친환경 캠페인 운동 실천 가 게 리스트를 생성할 수 있다. 달리 말해, 저축 장치는 사용자가 미리 설정한 복수의 매장 평가 항목에 대응 하여 각기 다른 가중치를 부여하고, 가중치에 따른 연산 결과를 고려하여 친환경 캠페인 운동 실천 가게 리스트 를 생성할 수 있다. 예시적으로, 사용자가 미리 설정한 복수의 매장 평가 항목은 해당 매장을 이용한 사용자의 평점, 좋아요 수, 리뷰 수, 리뷰 정보에 포함된 키워드의 정보와 관련된 항목, 해당 매장을 이용한 사용자의 성 별, 나이, 사는 곳, 선호 취향 항목, 매장에서 판매되는 물품 등을 포함할 수 있다. 사용자는 가장 높은 가중치 를 부여하고자 하는 평가 항목을 선택할 수 있다. 저축 장치는 사용자 입력 정보에 기반하여, 성별에 제1가중치를 부여하고, 나이에 제2가중치를 부여하고, 사는 곳에 제3가중치를 부여하여 친환경 캠페인 운동 실천 가게 리스트를 생성할 수 있다. 또한, 저축 장치(1 0)는 평점에 제1가중치를 부여하고, 나이에 제2가중치를 부여하고, 좋아요 수에 제3가중치를 부여하고자 하는 사용자 입력 정보를 수신할 수 있다. 저축 장치는 사용자 입력 정보에 기반하여 평점에 제1가중치를 부여하 고, 나이에 제2가중치를 부여하고, 좋아요 수에 제3가중치를 부여하여 친환경 캠페인 운동 실천 가게 리스트를 생성할 수 있다. 저축 장치는 복수의 매장 추천 평가 항목에 부여된 가중치를 합산하여 가장 높은 점수가 부여된 친환경 캠페인 운동 실천 가게를 우선하여 친환경 캠페인 운동 실천 가게 리스트를 생성할 수 있다. 예시적으로, 저축 장치는 리뷰 정보에 포함된 텍스트를 분석하고, 특정 키워드를 도출하여 리뷰 정보에 포 함된 키워드와 연계된 항목을 수치화할 수 있다 저축 장치는 리뷰 정보에 포함된 텍스트로부터 체언(명사) 을 추출하고, 미리 설정된 키워드(단어)의 매칭을 통해 리뷰 정보에 포함된 키워드와 관련한 항목을 수치화하고, 가중치를 부여할 수 있다. 또한, 저축 장치는 기존에 수집된 리뷰 정보에 포함된 텍스트 데이 터를 입력으로 하는 인공지능 학습을 통해 구축된 학습모델에 신규 리뷰 정보를 입력으로 하여 텍스트 분석을 수행할 수 있다. 여기서, 학습모델은 딥 러닝 신경망 기반으로 구축된 것일 수 있으나, 이에만 한정되는 것은 아니며, 기 개발되었거나 향후 개발되는 다양한 신경망 체계를 적용할 수 있다. 저축 장치는 사용자의 입력 정보 즉, 사용자의 선호 취향을 반영하여, 친환경 캠페인 운동을 추천하고, 사 용자의 참여도를 높일 수 있다. 예시적으로, 도 3의 (b)를 참조하면, 추가 항목(E)는 저축 장치가 사용자 정보 및 활동 정보를 이용하여 미 리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행하지 못한 경우, 사용자 단말 및 웨어러블 장치로 부터 획득되지 못하는 정보인 경우, 사용자가 사용자 단말을 통해 친환경 캠페인 운동 정보를 추가 입력 하 도록 사용자 입력 정보를 수신받는 항목일 수 있다. 도 4는 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 친환경 운동 입력 페이지 인터페이 스를 예시적으로 나타낸 도면이다. 도 4는 추가 항목(E)을 선택한 사용자 입력 정보가 수신되는 경우, 활성화되 는 친환경 운동 입력 페이지 인터페이스일 수 있다. 친환경 캠페인 운동에 대한 카테고리(F)는 일회용품 줄이기, 계단사용, 차량 및 교통편, 올바른 분리배출, 에너 지 절약 등을 포함할 수 있다. 사용자는 사용자 단말을 통해 본인이 수행한 친환경 캠페인 운동 항목을 선 택할 수 있다. 저축 장치는 계단사용 카테고리(F-1)를 선택한 사용자 입력 정보를 수신한 경우, 도4 의 (b)와 같이 세부단위를 입력할 수 있도록 입력 항목을 활성화할 수 있다. 저축 장치는 시간이나 개수 등을 입력한 경우 해당 친환경 캠페인을 수행하여 획득할 수 있는 발생금을 환산하여 사용자 단말로 제공할 수 있다. 도 5는 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 운동 유형별 카테고리 페이지 인터 페이스를 예시적으로 나타낸 도면이다. 도 5에는 친환경 캠페인 운동을 유형별로 정리해서 한눈에 보여주는 페 이지로서, 해당 페이지에서는 어떤 운동이 사용자에게 적합한지 정보를 제공할 수 있다. 예시적으로 도 5의 (a)를 참조하면, 친환경 캠페인 운동 유형으로는, 일회용품 줄이기, 에너지 절약, 차량 및 교통편, 올바른 분리배출, 계단 오르기 등이 포함될 수 있다. 저축 장치는 복수의 친환경 캠페인 운동 유 형 중 어느 하나를 선택하는 사용자 입력 정보에 기반하여 해당 운동과 관련된 정보를 제공할 수 있다. 저축 장치는 일회용품 줄이기 항목을 선택한 사용자 입력 정보에 대응하여 도 5의(b) 및 도 5의 (c)와 같이 일회 용품 줄이기 운동과 관련된 정보를 제공할 수 있다. 일회용품 줄이기 운동과 관련해서 일회용 컵 대신 텀블러 사용하기, 플라스틱 대신 실리콘 빨대 사용하기 등이 포함될 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 단말로부터 물품 이미지 정보를 수신할 수 있다. 또한, 저축 장치는 사용자 단말로부터 수신된 물품 이미지 정보를 이미지 분석 알고리즘에 적용하여 분 석을 수행할 수 있다. 이때, 이미지 분석 알고리즘에서 수행되는 분석은 해당 물품의 재활용 분리 배출 정보와 관련된 분석일 수 있다. 일예로, 이미지 분석 알고리즘은 딥 러닝 신경망일 수 있으나, 이에만 한정되는 것은 아니며, 기 개발되었거나 향후 개발되는 다양한 신경망 체계를 적용할 수 있다. 저축 장치는 외부 서버(미도시)로부터 복수의 물품 이미지 정보를 획득할 수 있다. 저축 장치는 복수의 물품 이미지와 재활용품 분류 정보를 연계하여 데이터 세트를 생성할 수 있다. 저축 장치는 딥러닝 알고리 즘에 적용 가능하도록 데이터 세트를 전처리할 수 있다. 저축 장치는 전처리 과정을 거친 데이터 세트를 입 력으로 하고 재활용품 분류 정보 결과에 관한 항목을 출력으로 하는 학습을 통해 이미지 분석 알고리즘인 학습모델을 구축할 수 있다. 일예로, 전처리는, 데이터 세트에 포함된 복수의 이미지 각각에 대하여 물품을 중심으로 하여 물품에 대한 형상 이 포함되지 않은 이미지의 주변부(예를 들어, 배경) 영역을 자르고, 딥러닝 알고리즘에 적용 가능한 사이즈로 자르는 전처리를 포함할 수 있다. 또한, 물품 이미지를 상하좌우 방향으로 평행 이동(shift)하고, 물품 이미지 를 회전(rotation)하고, 물품 이미지를 뒤집고(flipping), 색상 조정(color adjustment)과 같은 다양한 전처리 를 포함할 수 있다. 즉, 저축 장치는 빅데이터 형태로 수집되는 복수의 물품 이미지를 딥러닝 알고리즘인 이미지 분석 알고리즘에 적용 가능한 상태로 전처리를 수행할 수 있다. 또한, 저축 장치는 사용자 단말로부터 물품 이미지가 수신된 경우, 전처리 과정을 거친 이후 이미지 분 석 알고리즘을 통해 재활용품 분류 정보 결과를 분석할 수 있다. 달리 말해, 사용자는 특정 물품을 사용자 단말 을 이용하여 사용하고, 저축 장치는 사용자 단말로부터 획득된 물품에 대한 분석을 수행하고, 해당 물품이 어떤 종류에 속하는 물품인지를 분류할 수 있다. 일예로, 재활용품 분류 정보는, 종이류, 캔류, 유리병 류, 플라스틱류, 비닐류, 형광등, 폐전지, 섬유류, 폐전자제품, 폐식용유, 기타 등을 포함할 수 있다. 또한, 저축 장치는 물품 이미지 정보의 분석 결과를 고려하여 재활용품 분리배출 정보를 제공할 수 있다. 예를 들어, 저축 장치는 물품 이미지 정보의 분석 결과, 해당 물품이 알약 포장재의 경우, 윗면은 플라스틱 재질이고, 아랫면은 알루미늄 재질이라 각각은 재활용이 가능하겠지만 두 재질을 분리하기 어려우므로 일반 종 량제 봉투로 배출하세요와 같은 재활용품 분리배출 정보를 제공할 수 있다. 또한, 저축 장치는 물품 이미 지 정보의 분석 결과, 해당 물품이 깨진 유리일 경우, ① 일반 종량제봉투가 찢어지지 않도록 신문지에 싸서 배 출 ② 깨진 유리의 양이 많을 경우 특수규격마대(불연물질)를 구매하여 배출 (특수규격마대 구입처: 구 지정 판 매처 (동주민센터, 편의점 등))과 같이 깨진 유리로 분석된 물품의 분리배출 정보를 제공할 수 있다. 사용자는 재활용이 가능한 물품과 불가능한 제품의 판단이 어려운 경우, 또는 분리배출을 어떻게 해야 하는지 모르는 경우에 대응하여 물품을 촬영하여 저축 장치에 제공하여, 해당 물품의 분석을 수행한 결과로서 재활 용품 분리배출 정보를 획득함으로써, 보다 안전하고, 친환경 적인 분리 배출을 수행할 수 있다. 또한, 저축 장치는 물품 이미지 정보의 분석 결과 해당 물품이 보증금 환불이 가능한 물품인 경우, 해당 물 품에서 발생하는 발생금을 제공할 수 있다. 예를 들어, 물품이 소주병 또는 맥주병인 경우, 소매점 등에서 보증 금 환불이 가능하다. 저축 장치는 물품 이미지 정보 분석 결과, 소주병 또는 맥주병인 경우 사용자의 위치 정보에서 근접한 보증금 환불 매장 정보를 제공하고, 해당 매장에서 사용자가 물품 반납을 수행한 정보를 수신 한 경우, 친환경 캠페인 실천에 대한 발생금을 산출하고, 사용자의 금융 계좌로 저축을 수행할 수 있다. 도 6은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 캘린더 페이지 인터페이스를 예시적 으로 나타낸 도면이다. 저축 장치는 캘린더 페이지를 통해 한달 간의 친환경 운동 수행 정보를 제공할 수 있다. 예시적으로 도 6의 (a)를 참조하면, 저축 장치는 캘린더 각각에 사용자가 친환경 캠페인을 수행하고 발생한 발생금에 대한 정보를 저장할 수 있다. 저축 장치는 사용자 단말로부터 제1날짜(G)를 선택한 입력 정보 를 수신한 경우, 캘린더 하단에 영수증 항목(H)에 포함된 세부적인 친환경 캠페인 운동 정보를 제공할 수 있다. 저축 장치는 사용자가 미리 설정한 목표 금액(예를 들어, 70,000원)과 사용자가 현재 날짜까지 수행한 운동 에 대한 발생금의 합계 금액(예를 들어, 5,000)과 목표 금액까지 남은 금액(예를 들어, 65,000)의 정보를 제공 하여, 사용자가 목표를 달성하도록 동기를 부여할 수 있다. 또한, 도 6의 (b)를 참조하면, 저축 장치는 사용자가 한 달 동안 실천한 친환경 캠페인 운동 목록을 미리 설정된 친환경 캠페인 운동 정보와 매칭하여 실천 후 발생한 발생금 정보를 제공할 수 있다. 도 7은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 통계 페이지 인터페이스를 예시적으 로 나타낸 도면이다. 도 7의 (a)는 메뉴 제공 바(A)의 카테고리 선택 항목이 활성화된 페이지를 나타낸 것일 수 있다. 해당 페이지에는, MY LIST 항목, 통계 항목, 설정 항목이 포함될 수 있다. 도 7의 (b)를 참조하면, 저축 장치는 월별로 발생금을 누적하여 그래프 형태로 통계 내역을 제공할 수 있다. 또한, 도 7의 (c)를 참조하면, 저축 장치는 미리 설정된 친환경 캠페인 운동 정보에 각기 다른 색을 부여하여 전체에 대한 각 기여도를 나타내는 원형 차트로 통계 내역을 제공할 수 있다. 저축 장치는 월별 내역과 카테고리 유형별 통계를 제공하고, 월별 간 그리고 유형별 간 추이를 비교할 수 통계 내역을 제공할 수 있다. 도 8은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 MY 페이지 인터페이스를 예시적으로 나타낸 도면이다. MY 페이지는, 사용자가 친환경 캠페인 실천에 대한 발생금으로 사고 싶은 물품들을 선별해 높 은 페이지 및 쇼핑몰 사이트로 연동하여 바로 이동할 수 있는 페이지를 포함할 수 있다. 본원의 일 실시예에 따르면, 저축 장치는 사용자 선호 물품 정보에 기초하여 웹(WEB)으로부터 선호 물품 정 보를 포함하는 쇼핑몰 정보를 획득할 수 있다. 또한, 저축 장치는 쇼핑몰 정보에 기초하여 선호 물품이 포 함된 웹 페이지를 크롤링(crawling)할 수 있다. 또한, 저축 장치는 크롤링한 웹 페이지에 포함된 물품 정보 를 사용자 단말로 제공할 수 있다. 예시적으로, 도 8의 (a)을 참조하면, 저축 장치는 복수의 사용자 선호 물품 정보를 이미지와 텍스트로 제공 할 수 있다. 저축 장치는 복수의 사용자 선호 물품 정보 중 친환경 캠페인 발생금을 이용하여 구매하고자 하는 물품을 선택한 사용자 입력 정보를 수신할 수 있다. 저축 장치는 해당 물품의 금액을 사용자의 목표 금액으로 설정할 수 있다. 도 8의 (b)를 참조하면, 저축 장치는 복수의 사용자 선호 물품 정보와 웹 페이지 정보(URL)를 연계하여 사 용자가 타 웹 사이트를 이용하지 않고 한 번의 클릭만으로 바로 해당 쇼핑몰 사이트로 이동할 수 있도록 제공할 수 있다. 본원의 다른 일 실시예에 따르면, 저축 장치는 재활용품 분리수거 장치(미도시)로부터 센싱 정보를 수신할 수 있다. 재활용품 분리수거 장치(미도시)는 아파트, 도로, 길거리, 주택가 등에 설치되어 재활용품을 분리수거 하고, 재활용으로 분류된 제품인 경우 포인트를 제공하는 자판기 형태의 장치일 수 있다. 재활용품 분리수거 장치(미도시)에 구비된 투입구로부터 특정 용품(물품)이 투입되는 경우, 무게 센서를 이용하 여 1차 분류를 수행할 수 있다. 여기서 1차 분류는 캔, 페트, 유리 등과 관련된 분류일 수 있다. 재활용품 분리 수거 장치(미도시)는 미리 설정된 무게 이상의 센싱 정보가 수집되는 경우 특정 용품(물품)을 유리로 분류하여 유리 분류부로 이송시킬 수 있다. 여기서, 유리 분류부는 광(적외선) 센서를 이용하여 해당 유리병이 소주병, 맥주병에 해당하는지 여부를 판단할 수 있다. 재활용품 분리 수거 장치(미도시)는 해당 유리병이 소주병으로 판 단된 경우, 판단 결과를 저축 장치로 해당 정보를 제공하고, 저축 장치는 소주병에 대응하는 친환경 캠 페인 발생금을 산출하고, 사용자의 금융 계좌로 저축할 수 있다. 또한, 재활용품 분리 수거 장치(미도시)는 해 당 유리병이 맥주병으로 판단된 경우, 판단 결과를 저축 장치로 해당 정보를 제공하고, 저축 장치는 맥 주병에 대응하는 친환경 캠페인 발생금을 산출하고, 사용자의 금융 계좌로 저축할 수 있다. 재활용품 분리 수거 장치(미도시)는 1차 분류가 완료된 특정 용품(물품)을 컨베이어 벨트를 통해 2차 분류부로 이동시킬 수 있다. 재활용품 분리 수거 장치(미도시)의 2차 분류부에서는, 적외선 센서를 이용하여 특정 용품 (물품)이 캔 또는 페트병에 해당하는지 여부를 판단할 수 있다. 재활용품 분리 수거 장치(미도시)는 특정 용품 (물품)에 조사하여 반사되는 정도에 기반하여 특정 용품(물품)이 캔 또는 페트병에 해당하는지 여부를 판단할 수 있다. 재활용품 분리 수거 장치(미도시)는 판단 결과를 저축 장치로 제공하고, 저축 장치는 판단 결 과를 고려하여 환경 캠페인 실천에 대한 발생금으로 산출하고, 저축을 수행할 수 있다. 도 9는 본원의 일 실시예에 따른 저축 장치의 개략적인 블록도이다. 도 9를 참조하면, 저축 장치는 수신부, 매칭부, 산출부, 저축부, 분석부, 추천부 및 제공부를 포함할 수 있다. 다만, 저축 장치의 구성이 이에 한정되는 것은 아니다. 본원의 일 실시예에 따르면, 수신부는 사용자 단말로부터 사용자 정보를 수신할 수 있다. 또한, 수신 부는 웨어러블 장치로부터 사용자의 활동 정보를 수신할 수 있다. 수신부는 사용자 단말 또는 웨어러블 장치로부터 사용자의 현재 위치 정보를 획득할 수 있다. 또한, 수신부는 사용자 단말에 포함된 촬영장치(카메라)로부터 촬영된 물품 이미지 정보를 수신할 수 있다. 본원의 일 실시예에 따르면, 매칭부는 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수 행할 수 있다. 또한, 매칭부는 사용자 정보에 포함된 결제 이력 정보와 데이터베이스에 포함된 친환경 매 장 정보의 매칭을 수행할 수 있다. 여기서, 친환경 매장 정보는, 일회용품을 사용하지 않은 매장으로 등록된 매 장의 식별 정보를 포함할 수 있다. 본원의 일 실시예에 따르면, 산출부는 매칭이 수행된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산출할 수 있다. 또한, 산출부는 매칭부에서 결제 이력 정보와 데이터베이스에 포함된 친환경 매장 정 보의 매칭 정보를 고려하여 친환경 캠페인 실천에 대한 발생금으로 산출할 수 있다. 여기서, 친환경 매장 정보는, 일회용품을 사용하지 않는 매장으로 등록된 매장의 식별 정보를 포함할 수 있다. 본원의 일 실시예에 따르면, 저축부 산출된 발생금을 사용자의 금융 계좌로 저축할 수 있다. 저축부는 산출된 발생금이 일정 금액 이상인 경우(예를 들어, 10,000원) 발생금을 사용자의 금융 계좌로 저축(이동)을 수 행할 수 있다. 본원의 일 실시예에 따르면, 분석부는 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분석할 수 있다. 또한, 분석부는 물품 이미지 정보를 이미지 분석 알고리즘에 적용하여 분석을 수 행할 수 있다. 본원의 일 실시예에 따르면, 추천부는 분석된 생활 패턴 정보를 고려하여 미리 설정된 목표금액을 달성하기 위한 친환경 캠페인 운동 정보를 추천할 수 있다. 추천부는 사용자 정보, 상기 활동 정보 및 상기 현재 위 치 정보를 고려하여, 상기 친환경 캠페인 운동 정보를 추천할 수 있다. 또한, 추천부는 사용자의 현재 위치 정보를 기반으로 미리 설정된 범위 이내에 존재하는 친환경 캠페인 운동 실천 가게 리스트 생성하여 친환경 캠 페인 운동 정보를 추천할 수 있다. 본원의 일 실시예에 따르면, 제공부는 재활용품 분리배출 정보를 사용자 단말로 제공할 수 있다. 제공 부는 물품 이미지 정보의 분석 결과를 고려하여 재활용품 분리배출 정보를 제공할 수 있다. 또한, 제공부 는 사용자 선호 물품 정보에 기초하여 웹(web)으로부터 선호 물품 정보를 포함하는 쇼핑몰 정보를 획득하고, 상기 쇼핑몰 정보에 기초하여 상기 선호 물품이 포함된 웹 페이지를 크롤링(crawling)하여, 크롤링한 웹 페이지에 포함된 물품 정보를 사용자 단말로 제공할 수 있다. 이하에서는 상기에 자세히 설명된 내용을 기반으로, 본원의 동작 흐름을 간단히 살펴보기로 한다. 도 10은 본원의 일 실시예에 따른 저축 방법에 대한 동작 흐름도이다. 도 10에 도시된 저축 방법은 앞서 설명된 저축 장치에 의하여 수행될 수 있다. 따라서, 이하 생략된 내용이 라고 하더라도 저축 장치에 대하여 설명된 내용은 저축 방법에 대한 설명에도 동일하게 적용될 수 있다. 단계 S110에서 저축 장치는 사용자 단말로부터 사용자 정보를 수신할 수 있다. 단계 S120에서 저축 장치는 사용자 정보와 미리 설정된 친환경 캠페인 운동 정보 간의 매칭을 수행할 수 있 다. 단계 S130에서 저축 장치는 매칭이 수행되어 생성된 매칭 정보를 친환경 캠페인 실천에 대한 발생금으로 산 출할 수 있다. 단계 S140에서 저축 장치는 산출된 발생금을 사용자의 금융 계좌로 저축할 수 있다. 단계 S150에서 저축 장치는 사용자 정보를 인공지능 기반의 학습 모델에 적용하여 사용자의 생활 패턴을 분 석할 수 있다. 단계 S160에서 저축 장치는 분석된 생활 패턴 정보를 고려하여 미리 설정된 목표 금액을 달성하기 위한 친 환경 캠페인 운동 정보를 추천할 수 있다. 상술한 설명에서, 단계 S110 내지 S160은 본원의 구현예에 따라서, 추가적인 단계들로 더 분할되거나, 더 적은 단계들로 조합될 수 있다. 또한, 일부 단계는 필요에 따라 생략될 수도 있고, 단계 간의 순서가 변경될 수도 있 다. 본원의 일 실시 예에 따른 저축 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구 현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있 다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체 (magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장 하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지 는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코 드를 포함한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 전술한 저축 방법은 기록 매체에 저장되는 컴퓨터에 의해 실행되는 컴퓨터 프로그램 또는 애플리케이션의 형태로도 구현될 수 있다."}
{"patent_id": "10-2020-0177568", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "전술한 본원의 설명은 예시를 위한 것이며, 본원이 속하는 기술분야의 통상의 지식을 가진 자는 본원의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본원의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본원의 범위에 포함되는 것으로 해 석되어야 한다."}
{"patent_id": "10-2020-0177568", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본원의 일 실시예에 따른 저축 시스템의 개략적인 구성도이다. 도 2는 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 로그인 인터페이스를 예시적으로 나 타낸 도면이다. 도 3은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 메인 페이지 인터페이스를 예시적으 로 나타낸 도면이다. 도 4는 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 친환경 운동 입력 페이지 인터페이 스를 예시적으로 나타낸 도면이다. 도 5는 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 운동 유형별 카테고리 페이지 인터 페이스를 예시적으로 나타낸 도면이다. 도 6은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 캘린더 페이지 인터페이스를 예시적 으로 나타낸 도면이다. 도 7은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 통계 페이지 인터페이스를 예시적으 로 나타낸 도면이다. 도 8은 본원의 일 실시예에 따른 저축 장치에 의해 사용자 단말에 표시되는 MY 페이지 인터페이스를 예시적으로 나타낸 도면이다. 도 9는 본원의 일 실시예에 따른 저축 장치의 개략적인 블록도이다. 도 10은 본원의 일 실시예에 따른 저축 방법에 대한 동작 흐름도이다."}
