{"patent_id": "10-2021-0164517", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0095108", "출원번호": "10-2021-0164517", "발명의 명칭": "디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템", "출원인": "대한민국", "발명자": "조현수"}}
{"patent_id": "10-2021-0164517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "디지털 취약계층을 위한 맞춤형 챗봇 상담 방법에 있어서,사용자가 채팅창에 입력한 문장을 관리 서버에서 수집하는 데이터 수집단계;상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로, 상기 관리 서버가 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 취약계층 판단단계; 및상기 사용자의 디지털 취약계층 해당 여부를 기준으로, 상기 관리 서버가 사용자에게 제공하는 답변 방식을 결정하는 답변 방식 결정단계를 포함하는 것을 특징으로 하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법."}
{"patent_id": "10-2021-0164517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 취약계층 판단단계에서 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 상기 타이핑 속도 및 상기오타율의 기준은 빅데이터를 이용하여 인공지능 학습을 통해 설정되는 것을 특징으로 하는 디지털 취약계층을위한 맞춤형 챗봇 상담 방법."}
{"patent_id": "10-2021-0164517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 답변 방식 결정단계가 수행된 이후, 상기 답변 방식 결정단계에서 결정된 상기 답변 방식에 따라 상기 관리 서버가 사용자에게 답변을 제공하는 출력단계를 더 포함하는 것을 특징으로 하는 챗봇 상담 방법."}
{"patent_id": "10-2021-0164517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템에 있어서,사용자가 채팅창에 입력한 문장을 수집하는 데이터 수집부;상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로 상기 사용자의 디지털 취약계층 해당 여부를판단하는 취약계층 판단부; 및상기 사용자의 디지털 취약계층 해당 여부를 기준으로, 사용자에게 제공하는 답변 방식을 결정하는 답변 방식결정부를 포함하는 것을 특징으로 하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템."}
{"patent_id": "10-2021-0164517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 취약계층 판단부에서 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 상기 타이핑 속도 및 상기 오타율의 기준이 저장된 데이터 베이스를 더 포함하며,상기 데이터 베이스에 저장된 상기 티이핑 속도 및 오타율의 기준은 빅데이터를 이용하여 인공지능 학습을 통해설정되는 것을 특징으로 하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템."}
{"patent_id": "10-2021-0164517", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 답변 방식 결정부에서 결정된 상기 답변 방식에 따라 사용자에게 답변을 제공하는 출력부를 더 포함하는것을 특징으로 하는 챗봇 상담 시스템.공개특허 10-2022-0095108-3-"}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 디지털 취약계층이 원활하게 챗봇을 사용할 수 있도록 사용자가 디지털 취약계층인지 해당 여부를 판 별하고, 이를 기준으로 사용자에게 적합한 답변 방식을 결정하여 제공하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템에 관한 것이다. 본 발명은 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법에 있어서, 사용자가 채팅창에 입력한 문장을 관리 서 버에서 수집하는 데이터 수집단계와, 상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로, 상기 관 리 서버가 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 취약계층 판단단계와, 상기 사용자의 디지털 취 약계층 해당 여부를 기준으로, 상기 관리 서버가 사용자에게 제공하는 답변 방식을 결정하는 답변 방식 결정단계 를 포함하는 것을 특징으로 하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법을 제공한다."}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템에 관한 것으로, 디지털 취약계층이 원활하 게 챗봇을 사용할 수 있도록 사용자가 디지털 취약계층인지 해당 여부를 판별하고, 이를 기준으로 사용자에게 적합한 답변 방식을 결정하여 제공하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "IMS(Instant Message Service)는 전자우편 프로그램이나 웹 브라우저를 별도로 사용하지 않고, 발신자가 보낸 메시지가 수신자의 디바이스의 화면에 즉시로 뜨도록 하는 실시간 온라인 의사소통 서비스를 의미한다. 특히, 모바일 네트워크를 이용하여 채팅, 음성 및 영상통화 등을 제공하는 서비스를 MIM(Mobile Instant Messenger) 서비스라고 한다. 최근에는 IMS에 인간처럼 채팅을 하는 로봇인 챗봇(Chatbot) 또는 메신저봇(Messenger Bot)이 적용되고 있으며, 이를 통해 메신저 내에서 기업과 고객이 일대일 대화를 통해 고객이 원하는 1:1 맞춤형 정보를 자동으로 제공할 수 있게 되었다. 이때, 노령인, 장애우, 어린이 등 디지털 기기(PC, 스마트폰 등)에 익숙하지 않은 사용자(디지털취약계층)의 경 우 챗봇을 사용하기 어려워 사용자와 챗봇과의 원활한 상담이 진행되지 않는 문제점이 있다. 상술한 문제점을 해결하기 위해서는 전반적으로 상담사가 사용자와의 상담을 진행하는 방안이 있으나, 이를 위 해 많은 상담사가 배치되어야 할 뿐만 아니라, 상담사 각각이 상담에 소요하는 시간이 길어져, 스트레스 등 고 충이 따르며, 이에 따른 인건비 상승이 필연적으로 발생하게 되므로 챗봇에서 일정수준 해결하는 방안 필요하다. 그러나 현재 챗봇을 사용하는 사용자가 디지털취약계층에 해당하는지 여부에 대한 기술의 미비로, 디지털 취약 계층의 판별이 어려우므로, 디지털 취약계층에게 양질의 서비스를 제공하는데 어려움이 따르는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 제10-2121709호 (발명의 명칭: 챗봇 기반의 고객 상담 서비스 제공 서 버 및 방법, 공고일: 2020년06월11일)"}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 본 발명은 디지털 취약계층이 원활하게 챗봇을 사용할 수 있도록 사용자가 디지털 취약계층인지 해당 여부 를 판별하고, 이를 기준으로 사용자에게 적합한 답변 방식을 결정하여 제공하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템을 제공하는데 그 목적이 있다. 본 발명의 과제들은 이상에서 언급한 과제들로 제한되지 않으며, 언급되지 않은 또 다른 과제들은 아래의 기재 로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위하여, 본 발명은 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법에 있어서, 사용자가 채팅창에 입력한 문장을 관리 서버에서 수집하는 데이터 수집단계와, 상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로, 상기 관리 서버가 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 취약계층 판단 단계와, 상기 사용자의 디지털 취약계층 해당 여부를 기준으로, 상기 관리 서버가 사용자에게 제공하는 답변 방 식을 결정하는 답변 방식 결정단계를 포함하는 것을 특징으로 하는 디지털 취약계층을 위한 맞춤형 챗봇 상담방법을 제공한다. 여기서, 상기 취약계층 판단단계에서 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 상기 타이핑 속도 및 상기 오타율의 기준은 빅데이터를 이용하여 인공지능 학습을 통해 설정될 수 있다. 또한, 상기 답변 방식 결정단계가 수행된 이후, 상기 답변 방식 결정단계에서 결정된 상기 답변 방식에 따라 상 기 관리 서버가 사용자에게 답변을 제공하는 출력단계를 더 포함할 수 있다. 또한, 본 발명은 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템에 있어서, 사용자가 채팅창에 입력한 문장을 수집하는 데이터 수집부와, 상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로 상기 사용자의 디 지털 취약계층 해당 여부를 판단하는 취약계층 판단부와, 상기 사용자의 디지털 취약계층 해당 여부를 기준으로, 사용자에게 제공하는 답변 방식을 결정하는 답변 방식 결정부를 포함하는 것을 특징으로 하는 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템을 제공한다. 여기서, 상기 취약계층 판단부에서 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 상기 타이핑 속도 및 상기 오타율의 기준이 저장된 데이터 베이스를 더 포함하며, 상기 데이터 베이스에 저장된 상기 티이핑 속도 및 오타율의 기준은 빅데이터를 이용하여 인공지능 학습을 통해 설정될 수 있다. 또한, 상기 답변 방식 결정부에서 결정된 상기 답변 방식에 따라 사용자에게 답변을 제공하는 출력부를 더 포함 할 수 있다."}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템은 다음과 같은 효과를 갖는다. 첫째, 디지털 취약계층이 원활하게 챗봇을 사용할 수 있도록 사용자의 디지털 취약계층 해당 여부를 판별하고, 이를 기준으로 사용자에게 적합한 답변 방식을 결정하여 제공함으로써 사용자에게 원활한 상담 서비스를 제공할 수 있는 이점이 있다. 둘째, 디지털 취약계층이 챗봇을 더 쉽고 편리하게 사용할 수 있도록 함으로써, 고객만족도 증대 및 사회적 가 치를 창출할 수 있는 이점이 있다."}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 청구범위의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하"}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명 은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 본 명세서에서 사용된 용어는 특정 실시예를 설명하기 위하여 사용되며, 본 발명을 제한하기 위한 것이 아니다. 본 명세서에서 사용된 바와 같이 단수 형태는 문맥상 다른 경우를 분명히 지적하는 것이 아니라면, 복수의 형태를 포함할 수 있다. 또한, 본 명세서 전체에서 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 어떠한 구성 요소가 다른 구성 요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성 요 소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성 요소가 존재할 수도 있다 고 이해되어야 할 것이다. 반면에, 어떠한 구성 요소가 다른 구성요소에 \"직접 연결되\" 있다거나 또는 \"직접 접 속되\" 있다고 언급된 때에는, 중간에 다른 구성 요소가 존재하지 않는 것으로 이해되어야 할 것이다. 구성 요소 들 간의 관계를 설명하기 위한 다른 표현들도 마찬가지로 해석되어야 한다. 본 명세서에서 사용되는 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의되지 않는 한 본 발 명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있 다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하 는 의미를 갖는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형 식적인 의미로 해석되지 않는다. 이하, 본 발명의 실시예들에 의한 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법 및 시스템을 설명하기 위하여, 도면들을 참조하여 본 발명에 대해 설명하도록 한다. 도 1은 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 단계를 도시한 도면으로, 도 1을 참조 하면, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법은 데이터 수집단계(S100), 취약계층 판단 단계(S200), 답변 방식 결정단계(S300) 및 출력단계(S400)를 포함하고, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법을 도 1과 함께 도 2 내지 도 4를 참조하여 설명하면 다음과 같다. 이때, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법은 후술하는 본 발명에 따른 디지털 취약 계층을 위한 맞춤형 챗봇 상담 시스템을 운용하는 방법으로, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗 봇 상담 시스템은 사용자에게 원활한 상담 서비스를 제공하기 위한 관리 서버에 해당한다. 상기 데이터 수집단계(S100)에서는 사용자가 채팅창에 입력한 문장을 상기 관리 서버에서 수집하며, 구체적으로 상기 데이터 수집단계(S100)는 데이터 저장단계(S110) 및 데이터 분석단계(S120)를 포함한다. 상기 데이터 저장단계(S110)에서는 채팅창에 입력된 문장 및 문장이 입력된 시간을 저장한다. 상기 데이터 분석단계(S120)에서는 상기 데이터 저장단계(S110)에서 저장된 문장의 정보를 분석하여 정량화한다. 예를 들어, 상기 문장의 정보는 입력된 문장의 총 바이트(byte) 수, 문장의 말뭉치 및 문장에 포함 된 단어의 개수를 포함한다. 상기 취약계층 판단단계(S200)에서는 상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로, 상기 관 리 서버가 상기 사용자의 디지털 취약계층 해당 여부를 판단하며, 구체적으로 상기 취약계층 판단단계(S200)는 타자수 우수/비우수 그룹 분류단계(S210), 오타율 우수/비우수 그룹 분류단계(S220) 및 최종 취약계층 판단단계 (S230)를 포함한다. 도 2는 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 타자수 우수/비우수 그룹 분류단계 (S210)의 흐름도를 도시한 도면으로, 상기 타자수 우수/비우수 그룹 분류단계(S210)에서는 상기 사용자가 입력 한 문장의 타이핑 속도를 기준으로 상기 사용자를 타자수 우수/비우수 그룹으로 분류하며, 타이핑 속도 산출단 계(S211) 및 제1 분류단계(S212)를 포함한다. 상기 타이핑 속도 산출단계(S211)에서는 상기 데이터 수집단계(S100)에서 저장 및 분석된 문장이 입력된 시간 내에 작성된 입력된 문장의 총 바이트 수를 계산하여, 일정 시간동안 입력되는 바이트 수를 기준으로 사용자가 입력한 문장의 입력속도(TSu)를 산출한다. 이후, 상기 제1 분류단계(S212)에서는 산출된 입력속도(TSu)와 후술하는 데이터 베이스에서 빅데이터를 이 용하여 인공지능 학습을 통해 설정된 타이핑 속도의 평균속도(TSavg)를 비교하여 상기 사용자를 타자수 우수/비 우수 그룹으로 분류하는 기초자료로 활용한다. 즉, 상기 입력속도(TSu)가 상기 평균속도(TSavg)보다 빠르거나 같은 경우, 상기 제1 분류단계(S212)에서는 사용 자를 평균 이상의 타자수 우수 그룹으로 분류하고, 상기 입력속도(TSu)가 상기 평균속도(TSavg)보다 느린 경우, 상기 제1 분류단계(S212)에서는 사용자를 평균 미만의 타자수 비우수 그룹으로 분류한다. 도 3은 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 오타율 우수/비우수 그룹 분류단계 (S220)의 흐름도를 도시한 도면으로, 상기 오타율 우수/비우수 그룹 분류단계(S220)에서는 상기 사용자가 입력 한 문장의 오타율을 기준으로 상기 사용자를 오타율 우수/비우수 그룹으로 분류하며, 구체적으로 상기 오타율 우수/비우수 그룹 분류단계(S220)는 말뭉치 확인단계(S221), 단어 개수 판단단계(S222), 오타율 산출단계(S223) 및 제2 분류단계(S224)를 포함한다. 상기 말뭉치 확인단계(S221)에서는 입력된 문장의 말뭉치를 확인하는 단계로, 챗봇을 운용하기 위한 시스템이 텍스트, 즉 입력된 문장을 가공, 처리 및 분석이 가능하도록 말뭉치화하여 확인한다. 상기 단어 개수 판단단계(S222)에서는 입력된 문장을 단어 기준으로 분류하여 확인한다. 예를 들어, 입력된 문장이 '꽃집에 예쁜 꽃이 있다'인 경우, 상기 단어 개수 판단단계(S222)에서는 상기 문장을 '꽃집', '에', '예쁜', '꽃', '이', '있다'로 단어 기준을 따라 분류하여, 입력된 문장이 총 6개의 단어로 이루 어진 문장인 것을 확인한다. 이때, 상기 단어 개수 판단단계(S222)에서 분류된 단어의 개수가 일정 개수 미만인 경우, 상기 말뭉치 확인단계 (S221)로 다시 회귀하여 단어의 개수가 일정 개수 이상을 충족하도록 문장의 입력을 대기한다. 예를 들어, 입력된 문장이 '채팅 시작'인 경우, 상기 문장의 단어는 '채팅' 및 '시작'의 2개 단어로 구성되며, 이때, 상기 문장에 포함된 단어(2개)로는 오타율을 측정하는데 어려움이 따르므로, 단어 개수가 일정 개수 이상 을 충족한 상태에서 오타율을 계산할 수 있도록 하며, 오타율을 측정하는 기준이 되는 단어의 개수는 상담의 종 류 및 분야 등에 따라 변경될 수 있다. 상기 오타율 산출단계(S223)에서는 입력된 문장에 포함된 단어별 맞춤법을 판단하고, 전체 단어 개수에서 오타 단어 개수의 비율을 계산하여 입력된 문장의 오타율을 산출하며 예시는 아래 표 1과 같다. 표 1 단어 1 단어 2 단어 3 단어 4 단어 5 단어 6 입력된 문장꽃짐 에 에쁜 꽃 이 잇다 비교문장 꽃집 에 예쁜 꽃 이 있다 맞춤법점검X O X O O X 표 1에 개시된 바와 같이, 채팅창에 입력된 문장과 맞춤법이 올바른 비교 문장을 비교했을 때, 총 6개의 단어 중 오타 단어의 개수는 3개로, 오타율이 50%로 산출된다. 이후, 상기 제2 분류단계(S224)에서는 산출된 산출 오타율(TCu)과 상기 데이터 베이스에서 빅데이터를 이 용하여 인공지능 학습을 통해 설정된 기준 오타율(TCavg)을 비교하여 사용자가 디지털 취약계층에 해당하는지 여부를 판단하는 기초자료로 활용함으로써 상기 사용자를 오타율 우수/비우수 그룹으로 분류한다. 즉, 상기 산출 오타율(TCu)이 상기 기준 오타율(TCavg)보다 낮은 경우, 상기 제2 분류단계(S224)에서는 사용자 를 오타율 우수 그룹으로 분류하고, 상기 산출 오타율(TCu)이 상기 기준 오타율(TCavg)보다 높은 경우, 상기 제 2 분류단계(S224)에서는 사용자를 오타율 비우수 그룹으로 분류한다. 상술한 바와 같이, 상기 타자수 우수/비우수 그룹 분류단계(S210) 및 오타율 우수/비우수 그룹 분류단계(S220) 를 통해 산출된 타이핑 속도와 오타율을 기준으로 사용자가 상기 사용자를 타자수 우수/비우수 그룹 및 오타율 우수/비우수 그룹으로 분류하며, 상기 디지털 취약 계층을 분류하기 위한 기준(상기 평균속도(TSavg) 및 기준 오타율(TCavg))은 사용자가 거주하는 지역, 사용자의 외국인/재외국인 여부에 따라 변경될 수 있다. 일 예로, 상기 사용자의 디지털 취약 계층 해당여부를 분류하기 위한 기준에 사용자가 거주하는 지역을 포함한 경우, 상기 사용자가 디지털 취약 계층에 해당하는지 여부를 판단하는 예시는 다음과 같다. 먼저, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법은 상기 취약계층 판단단계(S200)를 수행 하기 앞서, 사용자의 거주지역을 묻는 거주지역 질문단계를 더 포함한다. 이는, 도시별 교육수준, 업무 종사분 야 및 노년비율 등이 모두 다르기 때문에, 사용자의 디지털 취약 계층 해당 여부를 분류하는 기준 또한 다르게설정되야 하기 때문이다. 예를 들어, 상기 거주지역은 서울, 수도권 및 광역시를 포함하는 대도시와, 상기 대도시에 포함되지 않은 시 단 위(ex. 청주시, 전주시 등)의 도시이며, 일정 기준 이상의 인구를 가지는 도시를 포함하는 중소도시 및 상기 대 도시 및 중소도시를 제외한 지방도시로 분류될 수 있다. 이후, 상기 취약계층 판단단계(S200)에서는 아래 표 2에서와 같이, 디지털 취약 계층을 판단하는 기준을 다르게 분류한다. 표 2 거주지역 타이핑 속도(입력속도) 오타율(산출 오타율) 대도시 200타 이하 3% 이상 중소도시 150타 이하 5% 이상 지방도시 100타 이하 10% 이상 표 2에 상술한 바와 같이, 상기 취약계층 판단단계(S200)에 포함된 제1 분류단계(S212)와 제2 분류단계(S224)에 서는 상기 사용자의 거주지역에 따라 사용자가 디지털 취약 계층에 해당되는지 판단하는 기준을 상이하게 분류 할 수 있다. 예를 들어, 상기 사용자의 문장 입력속도가 130타이고, 오타율이 7%인 경우, 상기 대도시 및 상기 중소도시 기 준에서 상기 사용자는 디지털 취약 계층에 해당한다고 판단되고, 상기 지방도시 기준에서 상기 사용자는 디지털 취약 계층에 해당하지 않는다고 판단된다. 다른 예로, 상기 디지털 취약 계층을 분류하기 위한 기준에 사용자의 재외국민 해당여부를 포함한 경우, 상기 사용자가 디지털 취약 계층에 해당하는지 여부를 판단하는 예시는 다음과 같다. 먼저, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법은 상기 취약계층 판단단계(S200)를 수행 하기 앞서, 사용자의 재외국민 해당여부 및 해외 거주기간을 묻는 재외국민 해당여부 질문단계를 더 포함한다. 이는, 재외국민의 해외 거주기간에 따라 사용자의 문장입력 속도 및 오타율에 영향을 미치므로, 사용자의 디지 털 취약 계층 해당 여부를 분류하는 기준 또한 다르게 설정되야 하기 때문이다. 이후, 상기 취약계층 판단단계(S200)에서는 아래 표 3에서와 같이, 디지털 취약 계층을 판단하는 기준을 다르게 분류한다. 표 3 해외 거주기간 타이핑 속도(입력속도) 오타율(산출 오타율) 해외 거주기간 10년 이상 150타 이하 10% 이상 해외 거주기간 1년 이상 3년 이하250타 이하 5% 이상 표 3에 상술한 바와 같이, 상기 취약계층 판단단계(S200)에 포함된 제1 분류단계(S212)와 제2 분류단계(S224)에 서는 상기 사용자의 재외국민의 해외 거주기간에 따라 사용자가 디지털 취약 계층에 해당되는지 판단하는 기준 을 상이하게 분류한다. 예를 들어, 상기 사용자의 문장 입력속도가 180타이고, 오타율이 7%인 경우, 상기 사용자의 해외 거주기간이 10 년 이상일 때, 상기 사용자는 디지털 취약 계층에 해당하지 않는다고 판단하고, 상기 사용자의 해외 거주기간이 1년 이상 3년 이하일 때, 상기 사용자는 디지털 취약 계층에 해당한다고 판단된다. 또 다른 예로, 상기 디지털 취약 계층을 분류하기 위한 기준에 사용자의 외국인 해당여부를 포함한 경우, 상기 사용자가 디지털 취약 계층에 해당하는지 여부를 판단하는 예시는 다음과 같다. 먼저, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법은 상기 취약계층 판단단계(S200)를 수행 하기 앞서, 사용자의 외국인 해당여부 및 국내(한국) 거주기간을 묻는 외국인 해당여부 질문단계를 포함한다. 이는, 외국인의 한국 거주 기간에 따라 사용자의 문장입력 속도 및 오타율에 영향을 미치므로, 사용자의 디지털 취약 계층 해당 여부를 분류하는 기준 또한 다르게 설정되야 하기 때문이다. 이후, 상기 취약계층 판단단계(S200)에서는 아래 표 4에서와 같이, 디지털 취약 계층을 판단하는 기준을 다르게 분류한다. 표 4 국내 거주기간 타이핑 속도(입력속도) 오타율(산출 오타율) 국내 거주기간 1년 이상 3년 이하150타 이하 10% 이상 국내 거주기간 10년 이상 250타 이하 5% 이상 표 4에 상술한 바와 같이, 상기 취약계층 판단단계(S200)에 포함된 제1 분류단계(S212)와 제2 분류단계(S224)에 서는 외국인인 상기 사용자의 국내 거주기간에 따라 사용자가 디지털 취약 계층에 해당되는지 판단하는 기준을 상이하게 분류한다. 예를 들어, 상기 사용자의 문장 입력속도가 180타이고, 오타율이 7%인 경우, 상기 사용자의 국내 거주기간이 1 년 이상 3년 이하에 해당할 때, 상기 사용자는 디지털 취약 계층에 해당하지 않는다고 판단하고, 상기 사용자의 국내 거주기간이 10년 이상에 해당할 때, 상기 사용자는 디지털 취약 계층에 해당한다고 판단된다. 물론, 상기 사용자가 외국인이고, 국내 거주기간이 1년 이하인 경우에는 상기 취약계층 판단단계의 수행 없이 상기 사용자를 디지털 취약 계층으로 분류할 수도 있다. 또한, 상기 데이터 수집단계(S100)에서 수집된 문장이 의미없는 자음 또는 모음의 연속(ex.ㅇㅇㅇ야ㅠㅠㅠㅈ)이 일정 개수 이상 입력된 경우, 상기 취약계층 판단단계(S200)에서는 상기 문장을 입력한 사용자를 채팅이 불가한 영유아와 같이 인지능력이 부족한 사용자로 분류하여 상담을 종료시키거나 또는 상담사와의 상담으로 전환시킬 수도 있다. 즉, 상기 취약계층 판단단계(S200)를 건너뛰고 후술하는 답변 방식 결정단계(S300)를 수행할 수 있 다. 본 명세서에서는 상기 타자수 우수/비우수 그룹 분류단계(S210)를 수행한 이후 상기 오타율 우수/비우수 그룹 분류단계(S220)를 수행하는 것으로 서술하고 있지만, 다른 실시예로, 상기 오타율 우수/비우수 그룹 분류단계 (S220)를 수행한 이후 상기 타자수 우수/비우수 그룹 분류단계(S210)를 수행할 수도 있으며, 이는 사용자가 디 지털 취약계층에 해당하는지 여부를 문장의 속도 및 오타율을 동시에 고려하여 판단하는데에 목적이 있으므로, 상기 타자수 우수/비우수 그룹 분류단계(S210)와 상기 오타율 우수/비우수 그룹 분류단계(S220)가 순서에 상관 없이 모두 수행되는데 의의가 있기 때문이다. 상기 최종 취약계층 판단단계(S230)에서는 상기 제1 분류단계(S212)에서 사용자가 평균 미만의 타자수 비우수 그룹으로 분류되고, 동시에 상기 제2 분류단계(S224)에서 사용자가 오타율 비우수 그룹으로 분류된 경우, 상기 사용자를 디지털 취약계층으로 분류한다. 도 4는 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 취약계층 판단단계의 흐름도를 도시한 도면으로, 상기 답변 방식 결정단계(S300)에서는 상기 사용자의 디지털 취약계층 해당 여부를 기준으로, 상기 관리 서버가 사용자에게 제공하는 답변 방식을 결정한다. 예를 들어, 상기 취약계층 판단단계(S200)에서 사용자가 디지털 취약계층에 해당된다고 판단된 경우, 상기 답변 방식 결정단계(S300)에서는 답변 방식을 소리 출력 또는 상담사와의 직접 상담(통화) 중 하나로 택일하여 전환 한다. 이때, 답변 방식이 상술한 바와 같이, 복수개인 경우, 상기 소리 출력에 해당하는 답변 방식을 '1'로 지정하고, 상기 상담사와의 직접 상담(통화)에 해당하는 답변 방식을 '2'로 지정한 후, 채팅창에 상술한 정보를 안내한 후, 상담창에 사용자가 1 또는 2를 입력하도록 함으로써 사용자에게 편리한 답변 방식을 사용자가 직접 선택할 수 있는 서비스를 제공한다. 또는, 상기 취약계층 판단단계(S200)에서 사용자가 디지털 취약계층에 해당하지 않는다고 판단된 경우, 채팅상 담을 계속해 진행해 나간다. 이후, 상기 출력단계(S400)에서는 상기 답변 방식 결정단계(S300)에서 결정된 상기 답변 방식에 따라 상기 관리 서버가 사용자에게 답변을 제공한다.여기서, 상기 출력단계(S400)에서는 상기 사용자가 입력한 문장의 오타를 자동으로 수정하고, 수정된 문장을 소 리로 출력할 뿐만 아니라, 챗봇의 상담 내용을 소리로 출력할 수도 있다. 또한, 상기 출력단계(S400)에서 출력되는 소리의 볼륨은 사용자의 연령대를 기준으로 조절될 수 있다. 즉, 상기 사용자가 디지털 취약계층에 해당하는 경우, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상 담 방법은 상기 출력단계(S400)의 수행 전에 상기 사용자의 난청 여부를 확인하는 난청 여부 확인단계를 더 포 함할 수 있고, 상기 난청 여부 확인단계에서 사용자의 난청이 확인된 경우, 상기 출력단계(S400)에서는 사용자 의 연령대에 맞게 볼륨을 크게 조절함으로써 사용자에게 상담내용을 제공할 수도 있다. 도 5는 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템의 구성을 개략적으로 도시한 도면으로, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템은 상술한 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법에 의해 운용되는 시스템이며, 구체적으로 데이터 베이스, 데이터 수집부, 취약계층 판단부, 답변 방식 결정부 및 출력부를 포함한다. 상기 데이터 베이스는 상기 사용자의 디지털 취약계층 해당 여부를 판단하는 상기 타이핑 속도 및 상기 오 타율의 기준, 즉, 상기 제1 분류단계(S212)에서의 평균속도(TSavg) 및 제2 분류단계(S224)에서의 기준 오타율 (TCavg)이 저장되며, 상기 데이터 베이스에 저장된 상기 평균속도(TSavg) 및 기준 오타율(TCavg)은 빅데이 터를 이용하여 인공지능 학습을 통해 설정된다. 상기 데이터 수집부는 사용자가 채팅창에 입력한 문장을 수집하며, 구체적으로 상기 데이터 수집부는 데이터 저장부 및 데이터 분석부를 포함한다. 상기 데이터 저장부는 채팅창에 입력된 문장 및 문장이 입력된 시간을 저장한다. 상기 데이터 분석부는 상기 데이터 저장부에 저장된 문장의 정보를 분석하여 정량화한다. 예를 들어, 상기 문장의 정보는 입력된 문장의 총 바이트(byte) 수, 문장의 말뭉치 및 문장에 포함된 단어의 개 수를 포함한다. 상기 취약계층 판단부는 상기 채팅창에 입력된 문장의 타이핑 속도 및 오타율을 기준으로, 상기 사용자의 디지털 취약계층 해당 여부를 판단하며, 구체적으로 상기 취약계층 판단부는 타자수 우수/비우수 그룹 분 류부, 오타율 우수/비우수 그룹 분류부 및 최종 취약계층 판단부를 포함한다. 상기 타자수 우수/비우수 그룹 분류부는 상기 사용자가 입력한 문장의 타이핑 속도를 기준으로 상기 사용 자를 타자수 우수/비우수 그룹으로 분류하며, 타이핑 속도 산출부 및 제1 분류부를 포함한다. 상기 타이핑 속도 산출부는 상기 데이터 수집부에서 저장된 문장이 입력된 시간 내에 작성된 입력된 문장의 총 바이트 수를 계산함으로써, 일정 시간동안 입력되는 바이트 수를 기준으로 입력속도(TSu)를 산출한다. 상기 제1 분류부는 산출된 입력속도(TSu)와 상기 데이터 베이스에서 빅데이터를 이용하여 인공지능 학습을 통해 설정된 타이핑 속도의 평균속도(TSavg)를 비교하여 상기 사용자를 타자수 우수/비우수 그룹으로 분 류한다. 즉, 상기 입력속도(TSu)가 상기 평균속도(TSavg)보다 빠른거나 같은 경우, 상기 제1 분류부는 사용자를 타 자수 우수 그룹으로 분류하고, 상기 입력속도(TSu)가 상기 평균속도(TSavg)보다 느린 경우, 상기 제1 분류부 는 사용자를 타자수 비우수 그룹으로 분류한다. 상기 오타율 우수/비우수 그룹 분류부는 상기 사용자가 입력한 문장의 오타율을 기준으로 상기 사용자를 오타율 우수/비우수 그룹으로 분류하며, 구체적으로 상기 오타율 우수/비우수 그룹 분류부는 말뭉치 확인 부, 단어 개수 판단부, 오타율 산출부 및 제2 분류부를 포함한다. 상기 말뭉치 확인부는 입력된 문장의 말뭉치를 확인하는 단계로, 시스템에서 텍스트를 가공, 처리 및 분석 이 가능하도록 말뭉치화하여 확인한다. 상기 단어 개수 판단부에서는 입력된 문장을 단어 기준으로 분류하여 확인하며, 이는 상술한 단어 개수 판 단단계(S222)에 설명된 내용과 대응되므로 상세한 설명은 생략한다. 상기 오타율 산출부는 입력된 문장에 포함된 단어별 맞춤법을 판단하고, 전체 단어에서 오타 단어의 비율 을 계산하여 오타율을 산출하며, 이는 상술한 오타율 산출단계(S223)에 설명된 내용과 대응되므로 상세한 설명 은 생략한다. 이후, 상기 제2 분류부는 산출된 산출 오타율(TCu)과 상기 데이터 베이스에서 빅데이터를 이용하여 인공지능 학습을 통해 설정된 기준 오타율(TCavg)을 비교하여 상기 사용자를 오타율 우수/비우수 그룹으로 분류 한다. 즉, 상기 산출 오타율(TCu)이 상기 기준 오타율(TCavg)보다 낮은 경우, 상기 제2 분류부는 사용자를 오타 율 우수 그룹으로 분류하고, 상기 산출 오타율(TCu)이 상기 기준 오타율(TCavg)보다 높은 경우, 상기 제2 분류 부는 사용자를 오타율 비우수 그룹으로 분류한다. 상기 최종 취약계층 판단부는 상기 제1 분류부에서 사용자가 평균 미만의 타자수 비우수 그룹으로 분 류되고, 동시에 상기 제2 분류부에서 사용자가 오타율 비우수 그룹으로 분류된 경우, 상기 사용자를 디지 털 취약계층으로 분류한다. 상기 답변 방식 결정부는 상기 사용자의 디지털 취약계층 해당 여부를 기준으로, 사용자에게 제공하는 답 변 방식을 결정하며, 이는 상술한 답변 방식 결정단계(S300)에 대응되므로 상세 설명을 생략한다. 상기 출력부는 상기 답변 방식 결정부에서 결정된 상기 답변 방식에 따라 사용자에게 답변을 제공하 며, 이는 상술한 출력단계(S400)에 대응되므로 상세 설명을 생략한다. 이 외, 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템의 상세 설명은 상술한 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법에 대응되므로, 이에 대한 설명은 생략한다. 상술한 바와 같이 도면을 참조하여 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상 술한 특정의 실시예에 한정되지 아니하며, 특허청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발"}
{"patent_id": "10-2021-0164517", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "명이 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변 형실시예들은 본 발명의 기술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2021-0164517", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 단계를 도시한 도면이다. 도 2는 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 타자수 우수/비우수 그룹 분류단계의 흐름도를 도시한 도면이다. 도 3은 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 오타율 우수/비우수 그룹 분류단계의 흐름도를 도시한 도면이다. 도 4는 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 방법의 취약계층 판단단계의 흐름도를 도시한 도면이다. 도 5는 본 발명에 따른 디지털 취약계층을 위한 맞춤형 챗봇 상담 시스템의 구성을 개략적으로 도시한 도면이다."}
