{"patent_id": "10-2022-0087237", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0009828", "출원번호": "10-2022-0087237", "발명의 명칭": "블록체인 기반 코인전문 은행 서비스 제공 시스템", "출원인": "이동일", "발명자": "이동일"}}
{"patent_id": "10-2022-0087237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "적어도 하나의 종류의 코인이 예치된 전자지갑주소를 등록하고, 상기 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출을 포함하는 은행 서비스를 이용하는 사용자 단말; 및상기 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출 서비스를 진행하도록 시스템을 구축하는 구축부, 상기 사용자 단말에서 코인의 종류 및 수량을 지정하여 예금을 하는 경우, 예금된 코인의 종류 및 수량에따라 예금이자를 지급하는 예금관리부, 상기 사용자 단말에서 기 설정된 적금상품에 가입하는 경우, 상기 적금상품에서 기 지정된 종류의 코인 및 수량만큼 상기 사용자 단말의 전자지갑주소로부터 인출하여 적립하는 적금관리부, 상기 사용자 단말에서 코인의 종류 및 수량을 지정하여 대출 서비스를 요청하는 경우, 기 설정된 대출이자를 안내하고 상기 사용자 단말의 전자지갑주소로 대출을 요청한 종류 및 수량의 코인을 지급하는 대출관리부를 포함하는 은행 서비스 제공 서버;를 포함하는 블록체인 기반 코인전문 은행 서비스 제공 시스템."}
{"patent_id": "10-2022-0087237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 은행 서비스 제공 서버는,상기 사용자 단말에서 예금, 적금 및 대출 서비스를 진행할 때, 온오프라인 매장 또는 메타버스(MetaVerse) 플랫폼에서 진행하도록 인프라를 구축하는 매장제공부;를 더 포함하는 것을 특징으로 하는 블록체인 기반 코인전문 은행 서비스 제공 시스템."}
{"patent_id": "10-2022-0087237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 은행 서비스 제공 서버는,상기 사용자 단말에서 대출 서비스를 받을 때, 부동산 또는 동산의 담보물을 설정받고, 상기 부동산 또는 동산의 담보 가치를 평가하며, 상기 부동산 또는 동산의 담보 가치의 기 설정된 퍼센테이지만큼 대출을 실행하는 대출금액설정부.를 더 포함하는 것을 특징으로 하는 블록체인 기반 코인전문 은행 서비스 제공 시스템."}
{"patent_id": "10-2022-0087237", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항에 있어서,상기 은행 서비스 제공 서버는,상기 사용자 단말에서 스테이블 코인의 발행을 의뢰할 때, 상기 스테이블 코인이 주식 담보부 스테이블 코인이고, 상기 사용자 단말에서 주식 데이터를 업로드한 경우, 상기 주식 데이터 내 주식의 가치를 기준으로 상기 주식 담보부 스테이블 코인을 발행하는 코인발행부;를 더 포함하는 것을 특징으로 하는 블록체인 기반 코인전문 은행 서비스 제공 시스템.공개특허 10-2024-0009828-3-청구항 5 제 4 항에 있어서,상기 은행 서비스 제공 서버는,상기 스테이블 코인을 발행하는 경우, 상기 스테이블 코인의 총 발행량의 기 설정된 퍼센테이지를 수수료로 부과하는 수익창출부;를 더 포함하는 것을 특징으로 하는 블록체인 기반 코인전문 은행 서비스 제공 시스템."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "블록체인 기반 코인전문 은행 서비스 제공 시스템이 제공되며, 적어도 하나의 종류의 코인이 예치된 전자지갑주 소를 등록하고, 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출을 포함하는 은행 서비스를 이용하는 사용자 단말 및 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출 서비스를 진행하도록 시스템을 구축 (뒷면에 계속)"}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 블록체인 기반 코인전문 은행 서비스 제공 시스템에 관한 것으로, 블록체인 코인을 예금, 적금 및 대 출 서비스를 이용할 수 있도록 코인전문 은행을 구축할 수 있는 시스템을 제공한다."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "은행의 경쟁자는 더 이상 다른 은행들이 아니다. 카카오나 네이버와 같은 IT 회사들이나 처음부터 전자이체, 송금 등을 목적으로 한 토스와 같은 전자금융회사들이 경쟁상대로 대두되고 있으며, 이에 대한 은행들의 대응은 두 가지 방향이다. 하나는 은행도 영업범위를 IT업 등으로 확대하여 자체적으로 IT에 대한 경쟁력을 강화하는 것이고, 다른 하나는 은행간 협력을 통해 변화하는 IT시스템 하에서도 기존 은행들의 지배적 지위를 유지, 강화 하는 것이다. 하지만 전자의경우 은행이 겸영, 부수업무로 혹은 자회사를 통해 확장을 하여야 하는데 여러가지 제한이 있고, 큰 틀에서 은산분리정책도 은행의 발목을 잡고 있다. 후자의 경우 대표적인 것이 오픈뱅킹공동업 무 시스템으로 최근 금융당국은 금융결제 인프라 개방을 통하여 지급결제시장에 경쟁을 촉진시키고 서비스 혁신 을 유도하기 위한 정책을 추진하고 있다. 이때, 가상화폐 중 스테이블 코인을 이용하여 대출을 제공하거나 은행 계좌로 연계하는 방법이 연구 및 개발되 었는데, 이와 관련하여, 선행기술인 한국공개특허 제2020-0094061호(2020년08월06일 공개) 및 한국등록특허 제 10-2008577호(2019년08월07일 공고)에는, 스테이블 코인의 대출을 제어하기 위하여 가상화폐인 코인의 가치를 측정하고, 측정된 가치에 대응하는 코인을 대출금으로 사용자 단말로 이체하며, 스테이블 코인의 가치에 대응하 는 담보물을 담보제공 단말로부터 제공받는 구성과, 전자지갑은 코인의 전환, 포인트의 전환, 상품권의 교환 및 은행계좌이체를 수행하도록 사용자 단말과 연결되고, 서버 단(End)에서는 출금거래요청이 발생하는 경우, 사용 자 단말과 전자지갑주소를 대비하여 사용자를 확인 및 증명한 후 출금거래요청에 대응하는 출금거래를 수행하도 록 하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 스테이블 코인 자체가 스테이블할 수 있다는 전제가 없기 때문에 스테이블 코인을 대출받았 다고 할지라도 그 가치의 폭락은 그 누구도 예상할 수 없다. 후자의 경우에도 은행 서비스를 제공하는 것이 아 니라 은행과 연계되어 코인을 명목화폐로 환전한 후 명목화폐를 출금해주는 구성만을 개시할 뿐이다. 최근 은 행에서 코인을 예금해주는 예금 서비스를 제공하면서 은행의 경영악화를 타계하려고 하고 있으나 이는 이벤트성 홍보 수단일 뿐 은행의 본질 자체를 변화시키지는 못한다. 이에, 코인을 기반으로 예금, 적금 및 대출 서비스 를 제공할 수 있는 코인 전문 은행 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 블록체인 기반 코인을 예금하고, 적금상품에 가입할 때 코인을 이용하여 가입하며, 대 출 서비스를 이용할 때에도 담보물을 설정한 후 코인으로 대출을 받는 코인전문 은행 시스템을 구축하고, 예금 상품에 가입한 사용자 단말로 예금의 예치에 따른 이자를 코인으로 제공하며, 적금상품도 기 설정된 종류 및 수 량의 코인을 적금으로 들도록 하고, 대출의 경우에도 기 설정된 종류 및 수량의 대출을 일으킬 수 있도록 하는, 블록체인 기반 코인전문 은행 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 적어도 하나의 종류의 코인이 예치된 전자지갑주소를 등록하고, 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출을 포함하는 은행 서비스를 이용하는 사용자 단말 및 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출 서비스를 진행하 도록 시스템을 구축하는 구축부, 사용자 단말에서 코인의 종류 및 수량을 지정하여 예금을 하는 경우, 예금된 코인의 종류 및 수량에 따라 예금이자를 지급하는 예금관리부, 사용자 단말에서 기 설정된 적금상품에 가입하는 경우, 적금상품에서 기 지정된 종류의 코인 및 수량만큼 사용자 단말의 전자지갑주소로부터 인출하여 적립하는 적금관리부, 사용자 단말에서 코인의 종류 및 수량을 지정하여 대출 서비스를 요청하는 경우, 기 설정된 대출이 자를 안내하고 사용자 단말의 전자지갑주소로 대출을 요청한 종류 및 수량의 코인을 지급하는 대출관리부를 포 함하는 은행 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 블록체인 기반 코인을 예금하고, 적금상품에 가입할 때 코인을 이용하여 가입하며, 대출 서비스를 이용할 때에도 담보물을 설정한 후 코인으로 대출을 받는 코인전 문 은행 시스템을 구축하고, 예금상품에 가입한 사용자 단말로 예금의 예치에 따른 이자를 코인으로 제공하며, 적금상품도 기 설정된 종류 및 수량의 코인을 적금으로 들도록 하고, 대출의 경우에도 기 설정된 종류 및 수량 의 대출을 일으킬 수 있도록 한다."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스 제공 시스템을 설명하기 위한 도면이 다. 도 1을 참조하면, 블록체인 기반 코인전문 은행 서비스 제공 시스템은, 적어도 하나의 사용자 단말 , 은행 서비스 제공 서버, 적어도 하나의 주식거래서버를 포함할 수 있다. 다만, 이러한 도 1 의 블록체인 기반 코인전문 은행 서비스 제공 시스템은, 본 발명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 은행 서비스 제공 서버와 연결 될 수 있다. 그리고, 은행 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말 , 적어도 하나의 주식거래서버와 연결될 수 있다. 또한, 적어도 하나의 주식거래서버는, 네트 워크를 통하여 은행 서비스 제공 서버와 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스 (Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워 크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 블록체인 기반 코인전문 은행 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이용하여 블록체인 기반 코인기반 은행을 이용하여 예금, 적금 및 대출 서비스를 이용하는 사용자의 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(CodeDivision Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 은행 서비스 제공 서버는, 블록체인 기반 코인전문 은행 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 제공하는 서버일 수 있다. 그리고, 은행 서비스 제공 서버는, 사용자 단말에서 예금을 하는 경우, 전자지갑주소를 통하여 코인을 예금받는 서버일 수 있고, 적금상품에 가입한 경우 기 설정된 날짜마 다 또는 임의의 날짜에 기 설정된 수량 또는 임의의 수량과 종류의 코인을 입금받는 서버일 수 있다. 또한, 은 행 서비스 제공 서버는, 사용자 단말에서 대출을 받는 경우, 담보물을 설정받고 이에 대응하는 가치 만큼의 사용자가 원하는 종류 및 수량의 코인을 대출해주는 서버일 수 있다. 여기서, 은행 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 주식거래서버는, 블록체인 기반 코인전문 은행 서비스 관련 웹 페이지, 앱 페이지, 프로그 램 또는 애플리케이션을 이용하거나 이용하지 않고 은행 서비스 제공 서버로부터 사용자 단말의 주식 을 확인해주는 서버일 수 있다. 이 경우는 사용자 단말에서 스테이블 코인을 발행할 때 주식을 담보물로 설정하는 경우를 의미한다. 여기서, 적어도 하나의 주식거래서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨 터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 주식거래서버는, 네트워크 를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 주식거래서버는, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 은행 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 은행 서비스 제공 서버는, 구축부, 예금관리부, 적금관리부, 대출관리부 , 매장제공부, 대출금액설정부, 코인설정부 및 수익창출부를 포함할 수 있다. 본 발명의 일 실시예에 따른 은행 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하 나의 사용자 단말로 블록체인 기반 코인전문 은행 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 사용자 단말은, 블록체인 기반 코인전문 은행 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이 용하여 서비스 프로그램이 적어도 하나의 사용자 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹 (WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서 술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 넷스케이프(Netscape), 익스플로러 (Explorer), 크롬(Chrome) 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의 미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2에서 설명되는 가상화폐를 위한 전용 은행을 생성하기 위한 기본 개념을 이하에서 설명한다. 이하에서 설 명된 기본 개념은 도 2에서 중복하여 설명하지 않는다. <은행과 가상화폐> 은행의 긴 역사 속에 오늘날과 같이 은행의 존립여부 자체에 의문이 제기된 적이 일찍이 없었다. 과거 은행은 들어오는 예금을 관리하며 찾아오는 고객의 신용을 심사하여 대출해주고 그 차이를 이익으로 가져갈 수 있었다. 은행의 핵심과제는 건전성 관리였고, 그것이면 충분했다. 하지만 최근에 이르러 새로운 IT기술의 발달은 은행 이 경험해보지 못한 강력한 경쟁자들을 등장시켰고, 기존의 법률은 은행의 발목을 잡고 있다. 은행은 이제 생 존의 기로에 서 있다고 해도 과언이 아니다. 은행이 이러한 위기와 도전의 시기에 응전하기 위해서는 은행 바깥의 환경변화에 눈을 돌려야 하고, 법률가 역시 은행법 밖의 법적 규제에 관심을 가져야 한다. 가상화폐와 관련하여 은행이 직면하는 법률문제는 주로 두 가지이다. 하나는 가상화폐를 거래대체수단이나 가 치저장수단으로 볼 수 있는지, 다시 말하면, 가상화폐를 화폐로 볼 수 있는지, 혹은 자산으로 볼 수 있는지 여 부이다. 다른 하나는 소위 가상화폐거래소와의 거래문제로 이른바 벌집계좌의 허용여부가 쟁점이다. 이 중 전 자의 문제는 가상화폐에 대한 본질적인 논의로 이론적으로나 정책적으로 여전히 논쟁 중인 상황이므로 다루기가 적절하지 않다. 은행이 가상화폐와 관련하여 직면하는 현실적이고 실무적인 문제는 후자의 벌집계좌 문제이다. 감독당국은 가상화폐에 대한 정책방향이 계속 바뀌는 상황에서 가상화폐 거래를 위한 은행거래의 문제 내지 벌 집계좌의 허용여부에 대해서도 오락가락하는 모습을 보여왔다. 또한 법원 역시 다수의 가처분 사건에서 벌집계 좌의 허용여부를 두고 일관된 입장을 보이지 못하였다. 아래에서는 통상의 가상화폐거래소와 은행의 거래 양태 및 그에 대한 금융감독당국의 입장변화를 살피고 관련된 법적 쟁점에 대해 설명하기로 한다. <은행과 가상화폐 거래소 간 금융거래에 관한 규제변화> 은행은 회원 간의 가상화폐 거래를 주된 영업으로 하는 가상화폐 거래소(이하 거래소)와 가상계좌서비스, 예금 거래 등 금융거래를 하고 있다. 구체적으로 거래소는 은행과 ① 가상계좌 서비스 계약을 체결하여 은행으로부 터 발급받은 고객별 가상계좌나, ② 은행과의 예금계약에 따라 발급받은 예금계좌를 이용하여 고객으로부터 가 상화폐 매수대금을 입금 받고, 고객의 요청에 따라 가상화폐 매도대금을 출금하는 등 업무를 처리하고 있다. 그런데 금융감독원 및 금융정보분석원은 2018년 1월 10일 은행에 대한 가상화폐 관련 특별검사 과정에서 위 ② 와 같은 유형의 금융거래(벌집계좌)가 자금세탁 등에 악용될 위험성이 높다는 판단 하에 은행에 대하여 벌집계 좌와 관련된 금융거래를 중단하고 그러한 유형의 신규거래를 거절하라고 요청(지시)하였다. 한편, 금융정보분 석원은 은행과 같은 금융기관이 벌집계좌와 관련된 금융거래를 중단하고, 그러한유형의 신규거래를 거절하여야 한다는 내용을 포함한 행정지도를 하기도 하였다. 이때, 금융감독당국은 2018년 1월 23일 가상자산 관련 금융부문 대책 발표를 하면서 금융회사가 가상자산 관련 금융거래를 수행할 때 준수해야 할 가이드라인을 제정하였고, 금융정보분석원은 FIU 가상통화 관련 자금세탁방 지 가이드라인을 발표하였다. 이러한 가이드라인이 1차로 같은 해 6월 27일까지, 그리고 2차로 다음해 6.26.까 지 연장이 되었지만 이들은 모두 가이드라인으로 법적 효력에 대해 의문이 제기되었다. 그러한 상황에서 2019 년 6월 국제자금세탁방지기구(FATF)는 가상화폐 관련 글로벌 권고안을 발표하였고, 그에 따라 국회에서 가상화 폐와 관련한 자금세탁방지 관련 복수의 법안이 발의되었다. 그리고, 2019.11.25. 의원 입법안을 중심으로 대안 을 마련하여 국회 정무위에서 의결이 되었으며, 2020.3.24. 법률 제17113호로 개정법률이 마련되었다. 동 개정 안은 가상화폐를 가상자산으로, 가상화폐 거래소를 가상자산 사업자(VASP)로 정의하고, 가상자산 거래소의 조건 부 신고제를 골자로 하는 것으로, 가상자산 사업자에 대한 자금세탁방지 의무 부과, 가상자산 사업자와 거래하 는 금융사의 준수 사항, 실명확인 입출금 계정 발급 요건 마련 규정을 담고 있다. 상술한 기본개념을 기반으로 도 2를 참조하면, 구축부는, 적어도 하나의 종류의 코인을 기반으로 예금, 적 금 및 대출 서비스를 진행하도록 시스템을 구축할 수 있다. 사용자 단말은, 적어도 하나의 종류의 코인이 예치된 전자지갑주소를 등록하고, 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출을 포함하는 은행 서비스를 이용할 수 있다. 예금관리부는, 사용자 단말에서 코인의 종류 및 수량을 지정하여 예금을 하는 경우, 예금된 코인의 종류 및 수량에 따라 예금이자를 지급할 수 있다. 적금관리부는, 사용자 단말에서 기 설정된 적금상 품에 가입하는 경우, 적금상품에서 기 지정된 종류의 코인 및 수량만큼 사용자 단말의 전자지갑주소로부터 인출하여 적립할 수 있다. 이때, 금융투자 관리 전략 중에서 여러 금융 상품을 선택하고 조합하여 분산 투자하 는 것을 포트폴리오 관리 이론이라 부르는데, 이를 이용하여 가상화폐에 대한 투자 수익을 안정적으로 올리기 위하여 효율적인 포트폴리오 관리 방안을 더 제공할 수 있다. 이를 위하여, 심층강화학습 기반 금융 포트폴리 오 투자 전략을 바탕으로 대표적인 비동기 심층 강화학습 알고리즘인 A3C(Asynchronous Advantage Actor- Critic)를 적용한 효율적인 금융 포트폴리오 투자 관리 기법을 이용할 수 있다. 또한, A3C를 포트폴리오 투자 관리에 접목시키는 과정에서 기존의 Cross-Entropy 함수를 그대로 적용할 수 없기 때문에 포트폴리오 투자 방식 에 적합하게 기존의 Cross-Entropy를 변형하여 그 해법을 제시할 수 있다. <A3C> A3C 알고리즘은 여러 개의 에이전트(Agent)가 비동기적으로 학습한다. 하나의 메인 쓰레드(Thread)로부터 파생 된 여러 개의 각 쓰레드가 독립적인 에이전트 역할을 수행한다. 메인 쓰레드는 전역 뉴럴 네트워크를 가지고있으며 전역 뉴럴 네트워크는 정책 네트워크와 가치 네트워크로 분리된다. 각각의 에이전트도 전역 뉴럴 네트 워크와 동일한 구조를 갖는 지역 뉴럴 네트워크를 소유한다. 메인 쓰레드의 전역 뉴럴 네트워크는 정책 네트워 크 파라미터 벡터와 가치 네트워크 파라미터 벡터를 갖고, 에이전트의 지역 뉴럴 네트워크는 정책 네트워크 파 라미터 벡터와 가치 네트워크 파라미터 벡터를 갖는다. 정책 네트워크는 임의의 스텝에서 상태에 대한 행동 결정에 관한 정책을 근사하고, 가치 네트워크는 상태에 대 한 기대보상을 나타내는 가치함수를 근사한다. 에이전트는 각 에피소드 마지막 스텝의 행동을 수행한 이후, 지 역 뉴럴 네트워크에 존재하는 정책 네트워크와 가치 네트워크를 통해서 메인 쓰레드가 가진 전역 뉴럴 네트워크 를 업데이트 한다. 이후 새로운 에피소드의 학습이 수행될 때, 에이전트는 전역 뉴럴 네트워크의 파라미터를 지역 뉴럴 네트워크로 복사하여 사용한다. 한편, Advantage-Function은 현재 정책에 의해 계산된 보상과 가치함수와의 차이를 나타내는 지표이며 정책 네 트워크 업데이트에 활용된다. 분산을 줄이기 위해 보상 감쇠율를 활용하여 감쇠된 누적 보상에서 실제 가치를 빼주는 방법을 활용한다. Cross-Entropy의 MLE(Maximum Likelihood Estimation) 이론에 따르면 미래의 결과를 알 수 없는 상황에서는 정책 네트워크의 보상을 이용해서 불확실도를 낮추는 정책을 찾는다. <포트폴리오 투자 관리> 가상화폐 포트폴리오 관리 문제는 소유한 자산을 투자 가능한 가상화폐에 지속적인 분산투자를 하여 초기 투자 자산에 대비해 더 많은 자산을 얻는 것을 목표로 한다. 예를 들어, SCRP(Successive Constant Rebalanced Portfolios), ONS (Online Newton Step algorithm) 등을 이용할 수 있는데, Price-Relative Vector를 정의하여 사용할 수 있다. 다만, Price-Relative Vector를 이용해서 미래의 Price-Relative Vector만을 예측할 뿐, 포 트폴리오 투자 관리 자체를 수행하는 방법을 제시하지 않는다. 이에 따라, 강화학습 알고리즘으로 주목받고 있 는 A3C 알고리즘을 DPG에 접목하여 가상화폐 분산 투자 수익률을 더욱 높이는 방안을 이용할 수 있다. 대출관리부는, 사용자 단말에서 코인의 종류 및 수량을 지정하여 대출 서비스를 요청하는 경우, 기 설정된 대출이자를 안내하고 사용자 단말의 전자지갑주소로 대출을 요청한 종류 및 수량의 코인을 지급할 수 있다. 매장제공부는, 사용자 단말에서 예금, 적금 및 대출 서비스를 진행할 때, 온오프라인 매장 또는 메타 버스(MetaVerse) 플랫폼에서 진행하도록 인프라를 구축할 수 있다. 대출금액설정부는, 사용자 단말에서 대출 서비스를 받을 때, 부동산 또는 동산의 담보물을 설정받고, 부동산 또는 동산의 담보 가치를 평가하며, 부동산 또는 동산의 담보 가치의 기 설정된 퍼센테이지만큼 대출을 실행할 수 있다. 이때, 채무불이행 위험을 내포하는 모기지 대출 채권을 기초자산으로 하는 MBS(Mortgage- Backed Security)의 가치평가를 위하여 시간의 흐름에 따른 모기지 대출의 현금흐름 모형을 구성 한 후, 모기지 대출 잔여액과 주택가격 불확실성이 우발적으로 유발하는 채무불이행 현상을 파악할 필요가 있다. 이에 따라, 금융ㆍ경제 이론을 토대로 모기지 대출의 상환방식과 계획에 따른 현금흐름, 조기상환액, 연체액, 그리고 서비 스 비용 등을 고려한 현금흐름 모형을 구성한 후, 실물옵션이론을 토대로 위험중립세상의 가정 하에 모기지 대 출 잔여액의 변화가 주택가격의 불확실 거동과 만나 비대칭적으로 발생하는 채무불이행 현상을 파악하여 이를 토대로 MBS의 정량적 가치를 평가하기 위한 금융모델을 이용할 수 있다. 코인발행부는, 사용자 단말에서 스테이블 코인의 발행을 의뢰할 때, 스테이블 코인이 주식 담보부 스 테이블 코인이고, 사용자 단말에서 주식 데이터를 업로드한 경우, 주식 데이터 내 주식의 가치를 기준으로 주식 담보부 스테이블 코인을 발행할 수 있다. 코인발행부는, 사용자 단말에서 업로드한 주식 데이 터 내 주식의 평가액은 기 설정된 심사기준으로 심사를 진행하는 날의 전날 종가를 기준으로 평가할 수 있다. 이때, 상술한 심사 기준 이외에도 본 발명의 일 실시예에서는, 주가 예측 요소로서 주가 내재적인 기술 지표, 시장에서 어떤 종목에 대한 투자자의 관심을 나타내는 시장 심리 지표, 그리고 거시 경제 지표의 3가지 성격의 지표를 모두 혼합하여 최적의 조합을 찾고, 이를 이용하여 주가를 예측하기로 한다. 기술적 지표와 거시 경제 지표에는, 많은 연구에서 다양한 특성들이 사용되었지만 본 발명의 일 실시예에서는 대표적 특성(Feature) 2 개 씩을 각각 선택할 수 있다. 2 개의 기술적 지표는, 거래량(V)과 코스피 지수(K)를 포함하고, 2 개의 거시 경제 지표는, 환율(E)과 이자율 (I)을 포함할 수 있다. 그리고 시장 심리 지표는 특정 종목에 대한 인터넷에서의 단어검색 빈도(W)를 이용할 수 있다. 또한 LSTM 모델에서 주가(Pt)는 과거의 주가(Pt-n)에 영향을 받기 때문에 이를 수식으로 나타내면 수 학식 1과 같다.수학식 1"}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서, Pt와 Pt-n은, 각각 현재 t 시점의 주가와 t-n 시점까지의 과거 주가이고, Vt-n은 t-n 시점까지의 과거 거래량, Kt-n은 t-n 시점까지의 과거 코스피 지수, Wt-n은 t-n 시점까지의 과거 단어검색 빈도, Et-n은 t-n 시 점까지의 과거 환율, 그리고 It-n은 t-n 시점까지의 과거 이자율이다. 그리고 Vt-n과 Kt-n은 기술적 지표, Wt- n은 특정 종목에 대한 시장 심리 지표, Et-n과 It-n은 거시 경제 지표이다. <LSTM> 본 발명의 일 실시예에서는 LSTM(Long Short-Term Memory) 모델을 이용하여 주가 예측에 대한 연구를 실행할 수 있다. 딥러닝 알고리즘은 ANN을 기반으로 DNN(Deep Neural Network, 심층 신경망), CNN(Convolutional Neural Network, 합성곱 신경망), RNN (Recurrent Neural Network, 순환 신경망), DBN(Deep Belief Network, 심층 신 뢰 신경망), DQN(Deep Q-Network) 등이 있다. 이 중 RNN은 은닉 계층에 과거 데이터의 정보를 기억하기 때문에 시계열 데이터의 학습에 적절하며, 이로부터 발전된 LSTM은 과거 시점이 멀수록 학습 능력이 저하되는 RNN의 문 제점을 개선한 알고리즘으로 주가와 같은 비선형 장기 시계열 데이터 예측에 좋은 성능을 보이고 있으며, 최근 에 주가 예측 연구에서 주로 사용되는 알고리즘이다. 또한 전통적 시계열 기법인 ARIMA 모델과 비교하여 LSTM 의 성능이 더 우수한 것을 확인하는 연구도 있으며, VAR 모델과의 비교는 LSTM 모델이 항상 우수한 성능을 보이 는 것은 아니며 데이터의 특성에 따라 달라진다는 연구도 있다. 다변량 시계열 예측을 위한 모델 구축에는 최 신의 머신러닝 알고리즘이 항상 우수한 것은 아니며, 비교적 데이터의 길이가 짧은 단계에서는 VAR 모델의 성능 이 우수했으며 데이터의 길이가 증가한 경우에는 LSTM 모델의 성능이 우수하게 나타났다. 본 발명의 일 실시예 에서는 비교적 긴 N 년간의 데이터 사용과 딥러닝 알고리즘을 사용한 주가 예측이라는 목적에 따라 LSTM 모델을 적용한다. <예측의 정확성 측정> 주가 예측의 정확성은 예측값과 실제값의 차이에서 오는 오차값을 통해서 확인할 수 있는데, 본 발명의 일 실시 예에서는 RMSE(Root Mean Square Error)를 사용한다. RMSE는 평균 제곱근 오차로서, 추정값 또는 예측한 값과 실제 환경에서 관찰되는 값의 차이를 다룰 때 흔히 사용되는 측도이며, 잔차를 제곱화하기 때문에 기울기를 계 산할 수 있어 경사하강법을 사용하여 모델의 성능을 최적화하는 머신러닝 알고리즘의 정확도를 평가할 때 가장 널리 쓰이고 있다. RMSE는 예측값에서 실제값을 차감한 값의 제곱 평균을 구한 후에 제곱근 하는 방식이다. <데이터 및 파라메터> 본 발명의 일 실시예에서는 주가 예측 요소 분석을 위해 N 년 간 데이터를 전처리 과정에서 제외된 데이터를 제 외한 나머지의 일일 주가 데이터를 사용할 수 있다. 일반적으로 훈련 데이터셋과 테스트 데이터셋의 비율을 7:3으로 하는 경우가 많은데, 본 발명의 일 실시예의 사전 실험에서 비율을 9:1로 하여 LSTM 모델을 실행할 경 우 더 작은 오차값을 보여준 바, 본 발명의 일 실시예에서는 X 일의 훈련 데이터셋과 Y 일의 테스트 데이터셋을 사용할 수 있다. 본 발명의 일 실시예는 주가 예측값을 찾아서 사용하는 것이 최종 목적이 아니고, 적절한 주 가 예측 요소의 조합과 주가 예측을 위한 적절한 선행 데이터 일수 등을 찾아가는 과정을 검토하는 것이므로 교 차 검증을 위한 밸리데이션 데이터셋은 별도로 분류하지 않을 수 있지만 이를 배제하는 것은 아니다. 주식시장의 업종을 구분하는 데는 다양한 분류가 있는데, 본 발명의 일 실시예에서는 네이버 증권에서도 사용하 고 있는 WICS(Wise Industry Classification Standard)를 사용할 수 있다. WICS는 총 10개의 대분류, 28개의 중분류, 83개의 소분류로 구성되어 있는데, 본 발명의 일 실시예에서는 대분류를 기준으로 하여 업종별로 대표 적인 코스피 종목을 1 개씩 임의로 선정하여 주가 데이터를 사용할 수 있다. 단어검색 빈도는 네이버 데이터랩 에서 선정된 주식 종목에 맞는 키워드를 사용하여 상기 주가 데이터와 같은 기간 동안 얻어진 데이터를 사용할 수 있다. 주가는 시가, 고가, 저가 종가, 등 여러 가지가 있는데, 수정 종가(Adjusted Close Price)를 사용할 수 있다. 환율과 이자율은 한국은행 경제통계시스템에서 제공하는 환율 데이터와 3년 만기 국고채 금리를 이용 할 수 있다. 또한 LSTM 모델 실행 시, 입력 변수별로 측정 단위가 다르고, 업종별로 주가 범위가 다르므로 효 과적인 학습과 업종별 결과를 비교하기 위하여 입력데이터와 출력 RMSE를 최소-최대 정규화(Min-Max Normalization) 방법을 사용하여 정규화할 수 있다. 또 본 발명의 일 실시예에서는 과적합을 피하기 위해 에포크(Epochs)를 설정할 수 있다. 이렇게 주가를 예측한 후 이 결과를 심사에 사용할 수 있다. 또는, 예측 결과 로 적합도를 예상할 수도 있다. 본 발명의 플랫폼에서 발행되는 스테이블 코인의 계약 기간이 20 년이라는 장 기에 속하는 계약이므로 20 년간의 주가를 예측하고 이에 따른 심사기준을 적용하여 적합 또는 부적합이라는 결 과를 출력하도록 적어도 하나의 인공지능 알고리즘을 학습시킬 수도 있다. 수익창출부는, 스테이블 코인을 발행하는 경우, 스테이블 코인의 총 발행량의 기 설정된 퍼센테이지를 수 수료로 부과할 수 있다. 이하, 상술한 도 2의 은행 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명 하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 은행 서비스 제공 서버는 예금, 적금 및 대출을 제공하는 코인전용 은행을 위한 인 프라를 구축할 수 있고, (b)와 같이 사용자 단말에서 예금을 하거나, (c)와 같이 적금에 들거나, (d)와 같 이 대출을 받을 수 있도록 한다. 또 은행 서비스 제공 서버는 도 4의 (a)와 같이 스테이블 코인을 발행할 때 주식을 담보로 주식 담보부 스테이블 코인을 발행해줄 수도 있고, (b)와 같이 메타버스 매장이나 (c)와 같은 온오프라인 은행을 제공할 수도 있다. 이와 같은 도 2 내지 도 4의 블록체인 기반 코인전문 은행 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1을 통해 블록체인 기반 코인전문 은행 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 블록체인 기반 코인전문 은행 서비스 제공 시스템에 포함된 각 구성 들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명"}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "한 다양한 실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당 업자에게 자명하다. 도 5를 참조하면, 은행 서비스 제공 서버는, 적어도 하나의 종류의 코인을 기반으로 예금, 적금 및 대출 서비스 를 진행하도록 시스템을 구축하고(S5100), 사용자 단말에서 코인의 종류 및 수량을 지정하여 예금을 하는 경우, 예금된 코인의 종류 및 수량에 따라 예금이자를 지급한다(S5200). 또, 은행 서비스 제공 서버는, 사용자 단말에서 기 설정된 적금상품에 가입하는 경우, 적금상품에서 기 지정된 종류의 코인 및 수량만큼 사용자 단말의 전자지갑주소로부터 인출하여 적립하고(S5300), 사용자 단말에서 코인 의 종류 및 수량을 지정하여 대출 서비스를 요청하는 경우, 기 설정된 대출이자를 안내하고 사용자 단말의 전자 지갑주소로 대출을 요청한 종류 및 수량의 코인을 지급한다(S5400). 상술한 단계들(S5100~S5400)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5400)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 블록체인 기반 코인전문 은행 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4를 통해 블록체인 기반 코인전문 은행 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스 제공 방법은, 컴퓨터에 의해 실행되 는 애플리케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발 성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분 리형 매체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스 제공 방법은, 단말기에 기본적으로 설 치된 애플리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스제공 방법은 단말기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현 되고 단말기에 등의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2022-0087237", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2022-0087237", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스 제공 시스템을 설명하기 위한 도면이 다. 도 2는 도 1의 시스템에 포함된 은행 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스가 구현된 일 실시예를 설명하 기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 블록체인 기반 코인전문 은행 서비스 제공 방법을 설명하기 위한 동작 흐름 도이다."}
