{"patent_id": "10-2023-0136166", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052856", "출원번호": "10-2023-0136166", "발명의 명칭": "AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법", "출원인": "주식회사 와이엠엑스", "발명자": "김두연"}}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "매장 내 객체에 대해 인공지능 학습을 수행하는 AI 서버; 및 상기 AI 서버로 상기 인공지능 학습의 결과를 요청하는 증강현실 단말;을 포함하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 증강현실 단말은, 상기 AI 서버로 초기화용 학습데이터를 제공하는 것을 특징으로 하는 AI 를 이용한 매장내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 초기화용 학습데이터는, 상기 객체의 종류와 상기 객체의 정보를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 증강현실 단말은, 사용자의 관심도가 높은 상기 객체의 옵션을 지정받는 것을 특징으로 하는 AI 를 이용한매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 4항에 있어서,상기 증강현실 단말은, 상기 매장 내 객체를 스캔하여 상기 AI 서버로 제공하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서,상기 증강현실 단말은, 상기 옵션을 포함하는 객체의 경우 해당 객체를 증강하여 해당 객체의 정보를 상기 사용자에게 제공하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 AI 서버는, 상기 증강현실 단말에서 상기 객체의 영상을 입력받아 상기 인공지능 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7항에 있어서,상기 AI 서버는, 상기 영상이 특정한 객체로 판단될 수 있도록 상기 인공지능 학습을 수행하는 것을 특징으로하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "공개특허 10-2025-0052856-3-제 8항에 있어서,상기 AI 서버는, 상기 영상에서 상기 객체의 옵션을 추출하여 상기 인공지능 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9항에 있어서,상기 AI 서버는, 상기 영상이 다른 객체와 구분되어 분류될 수 있도록 상기 인공지능 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 8항에 있어서,상기 AI 서버는, 상기 영상이 특정한 객체로 판단될 수 있는지 판단하고, 상기 특정한 객체로 판단되지 않을 경우 카테고리 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11항에 있어서,상기 AI 서버는, 상기 카테고리 학습을 수행한 후 상기 영상이 상기 특정한 객체로 판단될 수 있는지 다시 판단하고, 상기 특정한 객체로 판단되지 않을 경우 벡터변환 기반 카테고리 학습을 수행하는 것을 특징으로 하는 AI를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 9항에 있어서,상기 AI 서버는, 상기 영상으로부터 옵션을 추출할 수 있는지 판단하고 상기 영상으로부터 옵션을 추출할 수 없을 경우 옵션 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 10항에 있어서,상기 AI 서버는, 상기 영상이 다른 객체와 구분되어 분류가 되는지 판단하고, 상기 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분류 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 1항에 있어서,상기 증강현실 단말은, 사용자가 선택한 상기 객체를 상기 AI 서버에 미세조정용 학습데이터로 제공하여 객체미세 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 미세조정용 학습데이터를 제공받은 상기 AI 서버는, 상기 사용자가 제공한 사용자의 정보 및 상기 객체의옵션을 입력으로 하고 상기 AI 서버에서 제시한 객체를 출력으로 하되, 상기 AI 서버에서 제시한 객체와 상기사용자가 선택한 객체의 차이를 손실함수로 학습하는 학습모델을 토대로 사용자별 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16항에 있어서,상기 학습모델은, 장단기메모리 기반 학습모델 또는 연합학습모델 중 적어도 어느 하나를 포함하는 것을 특징으공개특허 10-2025-0052856-4-로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "AI 서버에서 매장 내 객체에 대해 인공지능 학습을 수행하는 객체 학습단계;증강현실 단말에서 사용자의 관심도가 높은 객체의 옵션을 지정받는 옵션 지정단계;상기 증강현실 단말에서 상기 매장 내 객체를 스캔하여 상기 AI 서버로 제공하는 객체 스캔단계;상기 증강현실 단말에서 상기 AI 서버로 상기 인공지능 학습의 결과를 요청하여 상기 옵션을 포함하는 객체를수신받고 해당 객체를 증강하여 해당 객체의 정보를 상기 사용자에게 제공하는 객체 증강단계; 및 상기 증강현실 단말에서 상기 사용자가 선택한 객체를 상기 AI 서버에 미세조정용 학습데이터로 제공하여 객체미세 학습을 수행하는 객체 미세학습단계;를 포함하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18항에 있어서,상기 객체 학습단계는, 상기 증강현실 단말에서 상기 AI 서버로 초기화용 학습데이터를 제공하는 것을 특징으로하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서,상기 초기화용 학습데이터는, 상기 객체의 종류와 상기 객체의 정보를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 18항에 있어서,상기 객체 학습단계는,상기 증강현실 단말에서, 상기 객체의 영상을 입력받아 상기 AI 서버로 전송하는 영상 입력단계;상기 AI 서버에서, 상기 영상이 특정한 객체로 판단될 수 있도록 상기 인공지능 학습을 수행하는 객체 특정 학습단계;상기 AI 서버에서, 상기 영상에서 상기 객체의 옵션을 추출하여 상기 인공지능 학습을 수행하는 객체 옵션 학습단계; 및 상기 AI 서버에서, 상기 영상이 다른 객체와 구분되어 분류될 수 있도록 상기 인공지능 학습을 수행하는 객체분류 학습단계;를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21항에 있어서,상기 객체 특정 학습단계는,상기 AI 서버에서, 상기 영상이 상기 특정한 객체로 판단될 수 있는지 판단하는 객체 특정여부 판단단계;상기 객체 특정여부 판단단계에서 상기 특정한 객체로 판단되지 않을 경우 카테고리 학습을 수행하는 카테고리학습단계;상기 AI 서버에서, 상기 카테고리 학습을 수행한 후 상기 영상이 상기 특정한 객체로 판단될 수 있는지 다시 판단하는 객체 특정여부 재판단단계; 및 상기 객체 특정여부 재판단단계에서 상기 특정한 객체로 판단되지 않을 경우 벡터변환 기반 카테고리 학습을 수행하는 벡터변환 기반 카테고리 학습단계;를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보증강 방법.공개특허 10-2025-0052856-5-청구항 23 제 21항에 있어서,상기 객체 옵션 학습단계는,상기 AI 서버에서 상기 영상으로부터 옵션을 추출할 수 있는지 판단하는 옵션 보유여부 판단단계; 및 상기 옵션 보유여부 판단단계에서 상기 영상으로부터 옵션을 추출할 수 없을 경우 옵션 학습을 수행하는 옵션학습단계;를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제 21항에 있어서,상기 객체 분류 학습단계는,상기 AI 서버에서 상기 영상이 다른 객체와 구분되어 분류가 되는지 판단하는 객체간 분류여부 판단단계; 및 상기 객체간 분류여부 판단단계에서 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분류 학습을 수행하는객체간 분류 학습단계;를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 18항에 있어서,상기 객체 미세학습단계는, 상기 미세조정용 학습데이터를 제공받은 상기 AI 서버가 상기 사용자가 제공한 사용자의 정보 및 상기 객체의옵션을 입력으로 하고 상기 AI 서버에서 제시한 객체를 출력으로 하되, 상기 AI 서버에서 제시한 객체와 상기사용자가 선택한 객체의 차이를 손실함수로 학습하는 학습모델을 토대로 사용자별 학습을 수행하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 25항에 있어서,상기 학습모델은, 장단기메모리 기반 학습모델 또는 연합학습모델 중 적어도 어느 하나를 포함하는 것을 특징으로 하는 AI 를 이용한 매장 내 관심객체 정보 증강 방법."}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자에 따라 매장 내 객체의 정보를 차별적으로 제공하고, 사용자의 관심객체를 판단하여 사용자에 따라 관심객체의 이벤트 정보를 제공할 수 있는 AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법에 관한 것이다. 본 발명의 AI 를 이용한 매장 내 관심객체 정보 증강 장치는 매장 내 객체에 대해 인공지능 학습을 수행하는 AI 서버, 및 상기 AI 서버로 인공지능 학습의 결과를 요청하는 증강현실 단말로 이루어진다."}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AI(Artificial Intelligence) 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법에 관한 것으로, 상세하게는, 증강현실(Augmented reality; AR) 내 관심객체의 정보를 제공하는 것이다. 또한, 본 발명은 서버에 학습된 관심객체 정보 제공 방법을 토대로 사용자에 따라 차별적으로 객체의 정보를 증강현실로 제공할 수 있는 AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "슈퍼마켓, 편의점, 대형 쇼핑몰 등과 같은 매장은 많은 종류의 상품들을 진열해 판매하고 있으며, 또한 각 매장 의 진열 방식에 따라 차이가 있어 소비자의 입장에서는 원하는 상품을 쉽게 찾기 어렵다. 따라서, 소비자들은 공간 내에서 상품을 찾는데 많은 시간이 소요되며, 상품 하나하나의 정보를 파악하는 데에 도 시간을 많이 소모하게 된다. 한편, 각종 상품들을 전시 및 판매하는 매장들은 수익을 증대시키기 위해 다양한 이벤트 등을 진행하고 있으나, 고객들은 이러한 이벤트 정보를 쉽게 접할 수 없으며, 다른 한편으로는 자신의 취향에 맞는 상품 정보 등이 이 벤트 중 인지도 알기 어렵기 때문에, 자신이 실제로 원하는 제품을 저렴하게 구매할 수 있는 기회를 얻지 못하 고 있다. 따라서, 증강현실을 사용하여 매장 내 상품에 대한 정보를 효과적으로 제공하고자 하는 연구가 지속되어 왔다. 그 일례로, 대한민국 공개특허공보 제10-2020-0085878호에서는 오프라인 매장을 무인으로 운영하면서 실제 상품 을 진열하지 않고서도 상품을 전시하고 구매할 수 있도록 한 고객과 상호작용하는 증강현실 무인 매장 장치에 관해 개시하고 있다. 그러나, 이 경우에도 사용자 특성에 따른 객체의 제시 및 이벤트의 제시 등의 안내가 어려운 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 제10-2020-0085878호(2020.07.13)"}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은, 사용자에 따라 매장 내 객체의 정보를 차별적으로 제공하는 AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법을 제공하는 것이다. 본 발명은 사용자의 관심객체를 판단하고 사용자에 따라 관심객체의 이벤트 정보를 제공할 수 있는 AI 를 이용 한 매장 내 관심객체 정보 증강 장치 및 방법을 제공하는데 또 다른 목적이 있다."}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 장치는 매장 내 객체에 대해 인공지능 학습을 수행하 는 AI 서버 및 AI 서버로 인공지능 학습의 결과를 요청하는 증강현실 단말을 포함할 수 있다. 여기서, 증강현실 단말은 AI 서버로 초기화용 학습데이터를 제공할 수 있다. 또한, 초기화용 학습데이터는 객체의 종류와 객체의 정보를 포함할 수 있다. 여기서, 증강현실 단말은 사용자의 관심도가 높은 객체의 옵션을 지정받는 것을 특징으로 할 수 있다. 또한, 증강현실 단말은 매장 내 객체를 스캔하여 AI 서버로 제공할 수 있다. 여기서, 증강현실 단말은 옵션을 포함하는 객체의 경우 해당 객체를 증강하여 해당 객체의 정보를 사용자에게 제공할 수 있다. 또한, AI 서버는 증강현실 단말에서 객체의 영상을 입력받아 인공지능 학습을 수행할 수 있다. 여기서, AI 서버는 영상이 특정한 객체로 판단될 수 있도록 인공지능 학습을 수행할 수 있다. 또한, AI 서버는 영상에서 객체의 옵션을 추출하여 인공지능 학습을 수행할 수 있다. 여기서, AI 서버는 영상이 다른 객체와 구분되어 분류될 수 있도록 인공지능 학습을 수행할 수 있다. 또한, AI 서버는 영상이 특정한 객체로 판단될 수 있는지 판단하고, 특정한 객체로 판단되지 않을 경우 카테고 리 학습을 수행할 수 있다. 여기서, AI 서버는 카테고리 학습을 수행한 후 영상이 특정한 객체로 판단될 수 있는지 다시 판단하고, 특정한 객체로 판단되지 않을 경우 벡터변환 기반 카테고리 학습을 수행할 수 있다. 또한, AI 서버는 영상으로부터 옵션을 추출할 수 있는지 판단하고 영상으로부터 옵션을 추출할 수 없을 경우 옵 션 학습을 수행할 수 있다. 여기서, AI 서버는 영상이 다른 객체와 구분되어 분류가 되는지 판단하고, 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분류 학습을 수행할 수 있다. 또한, 증강현실 단말은 사용자가 선택한 객체를 AI 서버에 미세조정용 학습데이터로 제공하여 객체 미세 학습을 수행할 수 있다. 여기서, 미세조정용 학습데이터를 제공받은 AI 서버는 사용자가 제공한 사용자의 정보 및 객체의 옵션을 입력으 로 하고 AI 서버에서 제시한 객체를 출력으로 하되, AI 서버에서 제시한 객체와 사용자가 선택한 객체의 차이를 손실함수로 학습하는 학습모델을 토대로 사용자별 학습을 수행할 수 있다. 또한, 학습모델은 장단기메모리 기반 학습모델 또는 연합학습모델 중 적어도 어느 하나를 포함할 수 있다. 본 발명의 다른 실시예에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 방법은 AI 서버에서 매장 내 객체에 대해 인공지능 학습을 수행하는 객체 학습단계, 증강현실 단말에서 사용자의 관심도가 높은 객체의 옵션을 지정 받는 옵션 지정단계, 증강현실 단말에서 매장 내 객체를 스캔하여 AI 서버로 제공하는 객체 스캔단계, 증강현실 단말에서 AI 서버로 인공지능 학습의 결과를 요청하여 옵션을 포함하는 객체를 수신받고 해당 객체를 증강하여 해당 객체의 정보를 사용자에게 제공하는 객체 증강단계, 및 증강현실 단말에서 사용자가 선택한 객체를 AI 서 버에 미세조정용 학습데이터로 제공하여 객체 미세 학습을 수행하는 객체 미세학습단계를 포함할 수 있다. 여기서, 객체 학습단계는 증강현실 단말에서 AI 서버로 초기화용 학습데이터를 제공할 수 있다. 또한, 초기화용 학습데이터는 객체의 종류와 객체의 정보를 포함할 수 있다. 여기서, 객체 학습단계는, 증강현실 단말에서, 객체의 영상을 입력받아 AI 서버로 전송하는 영상 입력단계, AI 서버에서, 영상이 특정한 객체로 판단될 수 있도록 인공지능 학습을 수행하는 객체 특정 학습단계, AI 서버에서, 영상에서 객체의 옵션을 추출하여 인공지능 학습을 수행하는 객체 옵션 학습단계, 및 AI 서버에서, 영상이 다른 객체와 구분되어 분류될 수 있도록 인공지능 학습을 수행하는 객체 분류 학습단계를 포함할 수 있 다. 또한, 객체 특정 학습단계는 AI 서버에서, 영상이 특정한 객체로 판단될 수 있는지 판단하는 객체 특정여부 판 단단계, 객체 특정여부 판단단계에서 특정한 객체로 판단되지 않을 경우 카테고리 학습을 수행하는 카테고리 학 습단계, AI 서버에서, 카테고리 학습을 수행한 후 영상이 특정한 객체로 판단될 수 있는지 다시 판단하는 객체 특정여부 재판단단계, 및 객체 특정여부 재판단단계에서, 특정한 객체로 판단되지 않을 경우 벡터변환 기반 카 테고리 학습을 수행하는 벡터변환 기반 카테고리 학습단계를 포함할 수 있다. 여기서, 객체 옵션 학습단계는 AI 서버에서 영상으로부터 옵션을 추출할 수 있는지 판단하는 옵션 보유여부 판 단단계 및 옵션 보유여부 판단단계에서 영상으로부터 옵션을 추출할 수 없을 경우 옵션 학습을 수행하는 옵션 학습단계를 포함할 수 있다. 또한, 객체 분류 학습단계는 AI 서버에서 영상이 다른 객체와 구분되어 분류가 되는지 판단하는 객체간 분류여 부 판단단계 및 객체간 분류여부 판단단계에서 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분류 학습 을 수행하는 객체간 분류 학습단계를 포함할 수 있다. 여기서, 객체 미세학습단계는 미세조정용 학습데이터를 제공받은 AI 서버가 사용자가 제공한 사용자의 정보 및 객체의 옵션을 입력으로 하고 AI 서버에서 제시한 객체를 출력으로 하되, AI 서버에서 제시한 객체와 사용자가 선택한 객체의 차이를 손실함수로 학습하는 학습모델을 토대로 최적의 사용자별 학습을 수행할 수 있다. 또한, 학습모델은 장단기메모리 기반 학습모델 또는 연합학습모델 중 적어도 어느 하나를 포함할 수 있다."}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의한 AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법은 사용자에 따라 매장 내 객체의 정보 를 차별적으로 제공하는 장점이 있다. 또한, 본 발명에 의한 AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법은 사용자의 관심객체를 판단하고 사용자에 따라 관심객체의 이벤트 정보를 제공할 수 있는 장점이 있다."}
{"patent_id": "10-2023-0136166", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시를 위한 구체적인 실시예를 첨부된 도면들을 참조하여 설명한다. 본 발명을 설명함에 있어서 제 1, 제 2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요 소들은 용어들에 의해 한정되지 않을 수 있다. 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적 으로만 된다. 예를 들어, 본 발명의 권리 범위를 벗어나지 않으면서 제 1 구성요소는 제 2 구성요소로 명명될 수 있고, 유사하게 제 2 구성요소도 제 1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 연결되어 있다거나 접속되어 있다고 언급되는 경우는, 그 다른 구성요소에 직 접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해 될 수 있다. 본 명세서에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 본 명세서에서, 포함하다 또는 구비하다 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것으로서, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해될 수 있다. 또한, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 AI(Artificial Intelligence)를 이용한 매장 내 관심객체 정보 증강 장치 및 방법에 대해 상세히 설명한다. 도 1은 본 발명의 일 실시예에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 장치를 나타낸 개략구성도이다. 도 1에서 알 수 있는 바와 같이, 본 발명의 AI 를 이용한 매장 내 관심객체 정보 증강 장치는 매장 내 객체 에 대해 인공지능 학습을 수행하는 AI 서버 및 AI 서버로 인공지능 학습의 결과를 요청하는 증 강현실 단말로 이루어진다. 여기서, 증강현실 단말은 AI 서버로 객체의 종류와 객체의 정보를 초기화용 학습데이터로 제공하고 AI 서버가 이를 학습함으로써, 사용자의 관심도에 부합하는 객체의 정보를 제시할 수 있다. 예를 들어, AI 서버가 인공지능 기술의 LLM(Large Language Model)을 사용하는 경우 증강현실 단말 은 프롬프트(prompt)와 컴플리션(completion)으로 나누어 초기화용 학습데이터를 아래와 같은 방식으로 제공할 수 있다. {\"prompt\": \"꽁치통조림\", \"completion\": \"꽁치 원산지는 국내산이고, 이외에 고춧가루, 정제소금, 설탕 등을 원재료로 사용됩니다. 내용 량은 400g으로서, 샘표에서 제조하였습니다. 캔으로 제조되었으며, 손으로 쉽게 따 는 구조입니다. } {\"prompt\": \"망고통조림\", \"completion\": \"망고 원산지는 태국산이고, 이외에 오렌지 농축액, 설탕 등을 원재료 로 사용됩니다. 내용 량은 370g으로서, 대상(주)에서 제조하였습니다. 유리병으로 제조되었으며, 손으로 쉽게 따는 구조입니다. } 또한, 증강현실 단말은 사용자로부터 사용자 이름, 나이, 직책, 관심분야, 기존 관심객체 등을 포함 한 사용자 정보를 취합하여 AI 서버로 전송하면, 사용자의 관심도가 높은 객체의 정보를 AI 서버 로부터 제시 받고 사용자로 제공할 수 있다. 여기서, 증강현실 단말은 사용자의 관심도가 높은 객체의 옵션을 지정 받을 수 있다. 예를 들면, 식 품 매장에서 비건 옵션을 선택하거나 가구 매장에서 원목 옵션을 선택하거나 의류 매장에서 선호 금액을 옵션으 로 지정할 수도 있으며, 이와 관련된 이벤트를 옵션으로 지정할 수도 있다. 또한, 증강현실 단말은 매장 내 객체를 스캔하여 AI 서버로 제공하면 AI 서버에서 옵션과 관련된 객체의 정보를 증강현실 단말로 전송하고, 증강현실 단말에서는 해당 객체를 증강 하여 관련된 이벤트 정보와 함께 사용자로 제공할 수 있다. 예를 들면, 사용자가 식품 매장에서 비건 옵션을 선택한 후 돌아다니며 물체를 비추었을 때, 화면에 비건 제품 이 보일 경우 증강현실로 정보를 제공하거나, 가구 매장에서 원목 옵션을 선택한 후 돌아다니며 물체를 비추었 을 때 화면에 원목 제품이 보일 경우 증강현실로 정보 제공할 수 있다. 또한, 의류 매장에서 선호 금액을 옵션 으로 지정한 후 돌아다니며 물체를 비추었을 때, 화면에 해당하는 제품이 보일 경우 증강현실로 해당 제품에 대 한 정보를 이벤트 정보와 함께 제공할 수도 있다. 한편, AI 서버에서 수행하는 인공지능 학습을 상세히 설명하면, 우선, AI 서버는 증강현실 단말(20 0)에서 객체의 영상을 입력 받아 인공지능 학습을 수행한다. 이때, AI 서버는 영상이 특정한 객체로 판단될 수 있도록 인공지능 학습을 수행하여야 하는데, 이때 영상 이 특정한 객체로 판단될 수 있는지 판단하여 특정한 객체로 판단되지 않을 경우 카테고리 학습을 수행하여 특 정한 객체로 판단 가능하도록 할 수 있다. 이러한 카테고리의 예시로서, 의류, 식품, 가전 등으로 구분하여 판 단할 수 있다. 한편, 카테고리 학습을 수행한 후 영상이 특정한 객체로 판단될 수 있는지 다시 판단하고, 특정한 객체로 판단 되지 않을 경우 벡터변환 기반 카테고리 학습을 수행하여 특정한 객체로 판단 가능하도록 할 수 있다. 이와 같은 본 발명에 의한 AI 를 이용한 매장 내 관심객체 정보 증강 장치는 벡터변환 기반 카테고리 학습을 수 행함으로써, 객체의 영상에 대해 특정한 객체로 용이하게 판단할 수 있는 장점이 있다. 또한, AI 서버는 영상에서 객체의 옵션을 추출하여 인공지능 학습을 수행할 수 있는데, 이때 영상으 로부터 옵션을 추출할 수 있는지 판단하고 영상으로부터 옵션을 추출할 수 없을 경우 옵션 학습을 수행한다. 예 를 들어, 이러한 옵션으로서, 객체의 재질, 성분, 크기 등을 포함할 수 있다. 한편, AI 서버는 영상이 다른 객체와 구분되어 분류될 수 있도록 인공지능 학습을 수행할 수 있는데, 이때 영상이 다른 객체와 구분되어 분류가 되는지 판단하고 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분 류 학습을 수행한다. 예를 들어, 이러한 분류로서, 식품 중 망고통조림과 황도통조림 등의 분류가 확실히 될 수 있도록 추가적인 학습을 수행한다. 한편, AI 서버에서는 인공지능 학습으로서, 증강현실 단말에서 사용자가 선택한 객체를 AI 서버 에 미세조정용 학습데이터로 제공하여 객체 미세 학습을 수행할 수 있다. 이때, 미세조정용 학습데이터를 제공받은 AI 서버가 사용자가 제공한 사용자의 정보 및 객체의 옵션 을 입력으로 하고 AI 서버에서 제시한 객체를 출력으로 하되, AI 서버에서 제시한 객체와 사용자가 선택한 객체의 차이를 손실함수로 학습하는 학습모델을 토대로 최적의 사용자별 학습을 수행할 수 있다. 여기서, 증강현실 단말에서 사용자가 선택한 객체에 대해 AI 서버로 제공하는 미세조정용 학습 데이터는 아래와 같은 방식으로 제공할 수 있다. {\"prompt\": \"꽁치통조림\", \"completion\": \"간편하게 먹을 수 있는 생선을 옵션으로 지정하였으나, 꽁치는 20대 나이로서는 먹기 불편한 음식으로 선택하지 않았습니다. } {\"prompt\": \"망고통조림\", \"completion\": \"당도가 높은 과일 통조림을 옵션으로 지정하였는데, 최상의 제품을 제시하였으며, 냉동 망고도 동시에 제시하는 것이 좋겠습니다. } 한편, AI 서버에서 학습하는 학습모델은 장단기메모리 기반 학습모델 또는 연합학습모델 중 적어도 어느 하나를 포함할 수 있다. 본 발명에서는, 장단기메모리를 사용함으로써, 사용자 간 관심 옵션을 반영할 수 있고, 트렌드에 따른 객체 의 정보를 반영할 수 있는 장점이 있다. 또한, AI 서버는 연합학습을 동시에 수행할 수 있는데, 이는 AI 서버에서 글로벌 모델을 사용하는 한 편, 해당 모델의 각 파라미터를 복수의 증강현실 단말로 전송하고, 증강현실 단말은 증강현실 단말 내의 로컬모델을 업데이트하고 그 결과로 업데이트된 파라미터를 AI 서버로 전송함으로써 이루어진다. 본 발명에서는 이와 같은 장단기 메모리를 보유한 연합학습을 수행함으로써, 사용자 간 관심 옵션이 반영되고 복수의 사용자의 특성도 반영할 수 있는 장점이 있다. 이상과 같은 본 발명에 의한 AI 를 이용한 매장 내 관심객체 정보 증강 장치는 AI 서버가 사용자의 결과에 대해서도 인공지능 학습을 수행함으로써, 사용자별 더욱 더 신뢰성 있는 객체의 정보를 제공할 수 있는 장점이 있다. 도 2는 본 발명의 일 실시예에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 방법을 나타낸 순서도이며, 도 3 내지 도 6은 도 2를 상세히 설명하기 위한 세부 순서도이다. 이하, 도 2 내지 도 6을 참조하여 본 발명에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 방법을 설명한다. 먼저, 도 2를 참조하면, 본 발명의 AI 를 이용한 매장 내 관심객체 정보 증강 방법은 AI 서버에서 매장 내 객체에 대해 인공지능 학습을 수행하는 객체 학습단계(S100), 증강현실 단말에서 사용자의 관심도가 높은 객체의 옵션을 지정받는 옵션 지정단계(S200), 증강현실 단말에서 매장 내 객체를 스캔하 여 AI 서버로 제공하는 객체 스캔단계(S300), 증강현실 단말에서 AI 서버로 인공지능 학습의 결 과를 요청하여 옵션을 포함하는 객체를 수신받고 해당 객체를 증강하여 해당 객체의 정보를 사 용자에게 제공하는 객체 증강단계(S400), 및 증강현실 단말에서 사용자가 선택한 객체를 AI 서버 에 미세조정용 학습데이터로 제공하여 객체 미세 학습을 수행하는 객체 미세학습단계(S500)로 이루어진다. 이때, 객체 학습단계(S100)에서, 증강현실 단말은 AI 서버로 객체의 종류와 객체의 정보를 초기화용 학습데이터로 제공하고 AI 서버가 이를 학습함으로써, 사용자의 관심도에 부합하는 객체의 정보를 제시할 수 있다. 예를 들어, AI 서버가 인공지능 기술의 LLM(Large Language Model)을 사용하는 경우 증강현실 단말 은 프롬프트(prompt)와 컴플리션(completion)으로 나누어 초기화용 학습데이터를 아래와 같은 방식으로 제공할 수 있다. {\"prompt\": \"꽁치통조림\", \"completion\": \"꽁치 원산지는 국내산이고, 이외에 고춧가루, 정제소금, 설탕 등을 원재료로 사용됩니다. 내용량은 400g으로서, 샘표에서 제조하였습니다. 캔으로 제조되었으며, 손으로 쉽게 따는 구조입니다. } {\"prompt\": \"망고통조림\", \"completion\": \"망고 원산지는 태국산이고, 이외에 오렌지 농축액, 설탕 등을 원재료 로 사용됩니다. 내용량은 370g으로서, 대상(주)에서 제조하였습니다. 유리병으로 제조되었으며, 손으로 쉽게 따 는 구조입니다. } 한편, 객체 학습단계(S100)는 AI 서버에서 매장 내 객체에 대해 인공지능 학습을 수행하는 것으로서, 후술하는 도 3에서 상세히 설명한다. 옵션 지정단계(S200)에서, 증강현실 단말은 사용자의 관심도가 높은 객체의 옵션을 지정받아 AI 서버 로 전송할 수 있다. 예를 들면, 식품 매장에서 비건 옵션을 선택하거나 가구 매장에서 원목 옵션을 선택하 거나 의류 매장에서 선호 금액을 옵션으로 지정할 수도 있으며, 이와 관련된 이벤트를 옵션으로 지정할 수도 있 다. 객체 스캔단계(S300)에서, 증강현실 단말은 매장 내 객체를 스캔하여 AI 서버로 제공하고, 이때 사용자로부터 사용자 이름, 나이, 직책, 관심분야, 기존 관심객체 등을 포함한 사용자 정보를 취합하여 AI 서버 로 함께 전송할 수 있다. 이후, 객체 증강단계(S400)에서, 증강현실 단말은 AI 서버로 인공지능 학습의 결과를 요청하여 옵션 을 포함하는 객체를 수신받고, 해당 객체를 증강하여 관련된 이벤트 정보와 함께 사용자로 제공할 수 있다. 예를 들면, 사용자가 식품 매장에서 비건 옵션을 선택한 후 돌아다니며 물체를 비추었을 때, 화면에 비건 제품 이 보일 경우 증강현실로 정보를 제공하거나, 가구 매장에서 원목 옵션을 선택한 후 돌아다니며 물체를 비추었 을 때, 화면에 원목 제품이 보일 경우 증강현실로 정보 제공할 수 있다. 또한, 의류 매장에서 선호 금액을 옵션으로 지정한 후 돌아다니며 물체를 비추었을 때, 화면에 해당하는 제품이 보일 경우 증강현실로 정보를 이벤트 정보와 함께 제공할 수도 있다. 다음, 객체 미세학습단계(S500)에서는 증강현실 단말에서 사용자가 선택한 객체를 AI 서버에 미 세조정용 학습데이터로 제공하여 객체 미세 학습을 수행할 수 있다. 여기서, 객체 미세학습단계(S500)는 미세조 정용 학습데이터를 제공받은 AI 서버가 사용자가 제공한 사용자의 정보 및 객체의 옵션을 입력으로 하고 AI 서버에서 제시한 객체를 출력으로 하되, AI 서버에서 제시한 객체와 사용자가 선 택한 객체의 차이를 손실함수로 학습하는 학습모델을 토대로 최적의 사용자별 학습을 수행할 수 있다. 이때, 증강현실 단말에서 사용자가 선택한 객체에 대해 AI 서버로 제공하는 미세조정용 학습데 이터는 아래와 같은 방식으로 제공할 수 있다. {\"prompt\": \"꽁치통조림\", \"completion\": \"간편하게 먹을 수 있는 생선을 옵션으로 지정하였으나, 꽁치는 20대 나이로서는 먹기 불편한 음식으로 선택하지 않았습니다. } {\"prompt\": \"망고통조림\", \"completion\": \"당도가 높은 과일 통조림을 옵션으로 지정하였는데, 최상의 제품을 제시하였으며, 냉동 망고도 동시에 제시하는 것이 좋겠습니다. } 한편, AI 서버에서 학습하는 학습모델은 장단기메모리 기반 학습모델 또는 연합학습모델 중 적어도 어느 하나를 포함할 수 있다. 본 발명에서는, 장단기메모리를 사용함으로써, 사용자 간 관심 옵션을 반영할 수 있고, 트렌드에 따른 객체 의 정보를 반영할 수 있는 장점이 있다. 또한, AI 서버는 연합학습을 동시에 수행할 수 있는데, 이는 AI 서버에서 글로벌 모델을 사용하는 한 편, 해당 모델의 각 파라미터를 복수의 증강현실 단말로 전송하고, 증강현실 단말은 증강현실 단말 내의 로컬모델을 업데이트하고 그 결과로 업데이트된 파라미터를 AI 서버로 전송함으로써 이루어진 다. 본 발명은 이와 같은 장단기 메모리를 보유한 연합학습을 수행함으로써, 사용자간 관심 옵션이 반영되고 복수의 사용자의 특성도 반영할 수 있는 장점이 있다. 이상과 같은 본 발명에 의한 AI 를 이용한 매장 내 관심객체 정보 증강 방법은 AI 서버가 사용자의 결과에 대해서도 인공지능 학습을 수행함으로써, 사용자별 더욱 더 신뢰성 있는 객체의 정보를 제공할 수 있는 장점이 있다. 도 3은 도 2의 객체 학습단계(S100)를 상세히 나타낸 순서도이다. 도 3에서 알 수 있는 바와 같이, 본 발명의 객체 학습단계(S100)는 증강현실 단말에서 객체의 영상을 입력 받아 AI 서버로 전송하는 영상 입력단계(S110), AI 서버에서 영상이 특정한 객체로 판단될 수 있도록 인공지능 학습을 수행하는 객체 특정 학습단계(S120), AI 서버에서 영상에서 객체의 옵션을 추출하여 인공지능 학습을 수행하는 객체 옵션 학습단계(S130), 및 AI 서버에서 영상이 다른 객체와 구분되어 분류될 수 있도록 인공지능 학습을 수행하는 객체 분류 학습단계(S140)로 이루어진다. 이하 도 4 내지 도 7에서 이에 대해 상세히 설명한다. 도 4는 도 3의 객체 특정 학습단계(S120)를 상세히 나타낸 순서도이다. 도 4에서 볼 수 있는 바와 같이, 본 발명의 객체 특정 학습단계(S120)는 AI 서버에서 영상이 특정한 객체 로 판단될 수 있는지 판단하는 객체 특정여부 판단단계(S121), 객체 특정여부 판단단계(S121)에서 특정한 객체 로 판단되지 않을 경우 카테고리 학습을 수행하는 카테고리 학습단계(S122), AI 서버에서 카테고리 학습을 수행한 후 영상이 특정한 객체로 판단될 수 있는지 다시 판단하는 객체 특정여부 재판단단계(S123), 및 객체 특 정여부 재판단단계(S123)에서 특정한 객체로 판단되지 않을 경우 벡터변환 기반 카테고리 학습을 수행하는 벡터 변환 기반 카테고리 학습단계(S124)로 이루어진다. 즉, AI 서버는 영상이 특정한 객체로 판단될 수 있도록 인공지능 학습을 수행하여야 하는데, 이때 객체 특 정여부 판단단계(S121)에서 영상이 특정한 객체로 판단될 수 있는지 판단하여 특정한 객체로 판단되지 않을 경우 카테고리 학습단계(S122)에서 카테고리 학습을 수행하여 특정한 객체로 판단할 수 있도록 한다. 이러한 카테 고리의 예시로서, 의류, 식품, 가전 등을 구분하여 판단할 수 있다. 본 발명은, 카테고리 학습을 수행한 후 객체 특정여부 재판단단계(S123)에서 영상이 특정한 객체로 판단될 수 있는지 다시 판단하여, 특정한 객체로 판단되지 않을 경우 벡터변환 기반 카테고리 학습단계(S124)에서 벡터변 환 기반 카테고리 학습을 수행하여 특정한 객체로 판단 가능하도록 할 수 있다. 이와 같은 본 발명에 의한 AI 를 이용한 매장 내 관심객체 정보 증강 방법은 벡터변환 기반 카테고리 학습을 수 행함으로써, 객체의 영상에 대해 특정한 객체로 용이하게 판단할 수 있는 장점이 있다. 도 5는 도 3의 객체 옵션 학습단계(S130)를 상세히 나타낸 순서도이다. 도 5에서 알 수 있는 바와 같이, 본 발명의 객체 옵션 학습단계(S130)는, AI 서버에서 영상으로부터 옵션 을 추출할 수 있는지 판단하는 옵션 보유여부 판단단계(S131), 및 옵션 보유여부 판단단계(S131)에서 영상으로 부터 옵션을 추출할 수 없을 경우 옵션 학습을 수행하는 옵션 학습단계(S132)로 이루어진다. 즉, 객체 옵션 학습단계(S130)에서 AI 서버는 영상에서 객체의 옵션을 추출하여 인공지능 학습을 수 행할 수 있는데, 옵션 보유여부 판단단계(S131)에서 영상으로부터 옵션을 추출할 수 있는지 판단하고, 영상으로 부터 옵션을 추출할 수 없을 경우 옵션 학습단계(S132)에서 옵션 학습을 수행한다. 이러한 옵션의 예시로서는, 객체의 재질, 성분, 크기 등을 포함할 수 있다. 도 6은 도 3의 객체 분류 학습단계(S140)를 상세히 나타낸 순서도이다. 도 6에서 볼 수 있는 바와 같이, 본 발명의 객체 분류 학습단계(S140)는 AI 서버에서 영상이 다른 객체 와 구분되어 분류가 되는지 판단하는 객체간 분류여부 판단단계(S141), 및 객체간 분류여부 판단단계 (S141)에서 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분류 학습을 수행하는 객체간 분류 학습 단계(S142)로 이루어진다. 즉, 객체 분류 학습단계(S140)에서 AI 서버는 영상이 다른 객체와 구분되어 분류될 수 있도록 인공지 능 학습을 수행할 수 있는데, 객체간 분류여부 판단단계(S141)에서 영상이 다른 객체와 구분되어 분류가 되는지 판단하고, 다른 객체와 구분되어 분류가 되지 않을 경우 객체간 분류 학습단계(S142)에서 객체간 분류 학습을 수행한다. 예를 들어, 분류로서, 식품 중 망고통조림과 황도통조림 등의 분류가 확실히 될 수 있도 록 추가적인 학습을 수행한다. 이상과 같이 본 발명에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 장치 및 방법은 사용자에 따라 매장 내 객체의 정보를 차별적으로 제공하는 장점이 있으며, 또한 사용자의 관심객체를 판단하여 사용자에 따라 관심객 체의 이벤트 정보를 제공할 수 있는 장점이 있다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는 여기에 개시된 실시예들과 관련하여 설명된 다양한 예시적인 논리 블록들, 모듈들, 프로세서들, 수단들, 회로들 및 알고리즘 단계들이 전자 하드웨어, (편의를 위해, 여기에 서 소프트웨어로 지칭되는) 다양한 형태들의 프로그램 또는 설계 코드 또는 이들 모두의 결합에 의해 구현될 수 있다는 것을 이해할 것이다. 하드웨어 및 소프트웨어의 이러한 상호 호환성을 명확하게 설명하기 위해, 다양한 예시적인 컴포넌트들, 블록들, 모듈들, 회로들 및 단계들이 이들의 기능과 관련하여 위에서 일반적으로 설명되 었다. 이러한 기능이 하드웨어 또는 소프트웨어로서 구현되는지 여부는 특정한 애플리케이션 및 전체 시스템에 대하여 부과되는 설계 제약들에 따라 좌우된다. 본 발명의 기술 분야에서 통상의 지식을 가진 자는 각각의 특정 한 애플리케이션에 대하여 다양한 방식들로 설명된 기능을 구현할 수 있으나, 이러한 구현 결정들은 본 발명의 범위를 벗어나는 것으로 해석되어서는 안 될 것이다. 여기서 제시된 다양한 실시예들은 방법, 장치, 또는 표준 프로그래밍 및/또는 엔지니어링 기술을 사용한 제조 물품(article)으로 구현될 수 있다. 용어 제조 물품은 임의의 컴퓨터-판독가능 저장장치로부터 액세스 가능한 컴퓨터 프로그램, 캐리어, 또는 매체(media)를 포함한다. 예를 들어, 컴퓨터-판독가능 저장매체는 자기 저장 장치(예를 들면, 하드 디스크, 플로피 디스크, 자기 스트립, 등), 광학 디스크(예를 들면, CD, DVD, 등), 스마트 카드, 및 플래쉬 메모리 장치(예를 들면, EEPROM, 카드, 스틱, 키 드라이브, 등)를 포함하지만, 이들로 제한되 는 것은 아니다. 또한, 여기서 제시되는 다양한 저장 매체는 정보를 저장하기 위한 하나 이상의 장치 및/또는 다른 기계-판독가능한 매체를 포함한다. 제시된 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조는 예시적인 접근들의 일례임을 이해하도록 한 다. 설계 우선순위들에 기반하여, 본 발명의 범위 내에서 프로세스들에 있는 단계들의 특정한 순서 또는 계층 구조가 재배열될 수 있다는 것을 이해하도록 한다. 첨부된 방법 청구항들은 샘플 순서로 다양한 단계들의 엘리 먼트들을 제공하지만 제시된 특정한 순서 또는 계층 구조에 한정되는 것을 의미하지는 않는다. 제시된 실시예들에 대한 설명은 임의의 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 이용하거 나 또는 실시할 수 있도록 제공된다. 이러한 실시예들에 대한 다양한 변형들은 본 발명의 기술 분야에서 통상의 지식을 가진 자에게 명백할 것이며, 여기에 정의된 일반적인 원리들은 본 발명의 범위를 벗어남이 없이 다른 실 시예들에 적용될 수 있다. 그리하여, 본 발명은 여기에 제시된 실시예들로 한정되는 것이 아니라, 여기에 제시 된 원리들 및 신규한 특징들과 일관되는 최광의의 범위에서 해석되어야 할 것이다."}
{"patent_id": "10-2023-0136166", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 장치를 나타낸 개략구성도이다. 도 2는 본 발명의 일 실시예에 따른 AI 를 이용한 매장 내 관심객체 정보 증강 방법을 나타낸 순서도이다. 도 3은 도 2의 객체 학습단계를 상세히 나타낸 순서도이다. 도 4는 도 3의 객체 특정 학습단계를 상세히 나타낸 순서도이다. 도 5는 도 3의 객체 옵션 학습단계를 상세히 나타낸 순서도이다. 도 6은 도 3의 객체 분류 학습단계를 상세히 나타낸 순서도이다."}
