{"patent_id": "10-2023-0125482", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0042406", "출원번호": "10-2023-0125482", "발명의 명칭": "여행관광 종합 예약 서비스 제공 시스템", "출원인": "정잉", "발명자": "정잉"}}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자의 나이 및 성별의 개인정보를 입력하고, 여행형태 및 여행선호에 대한 선호도 데이터를 입력하며, 상기개인정보 및 선호도 데이터에 기반하여 여행지를 추천받고, 상기 여행지에 대한 교통 및 숙박을 위한 예약 서비스를 제공받는 사용자 단말; 및상기 사용자 단말로부터 사용자의 나이 및 성별의 개인정보를 입력받는 개인정보입력부, 상기 사용자 단말로부터 상기 여행형태 및 여행선호에 대한 선호도 데이터를 입력받는 선호도입력부, 상기 개인정보 및 선호도 데이터를 기 구축된 인공지능 알고리즘에 입력하여 적어도 하나의 여행지를 추출하는 추출부, 추출된 적어도 하나의여행지를 상기 사용자 단말로 전송하는 전송부, 상기 사용자 단말에서 여행지를 선택하는 경우, 선택된 여행지로 이동하기 위한 교통 및 상기 여행지에서 머물기 위한 숙박에 대한 예약 서비스를 제공하는 예약부를 포함하는 예약 서비스 제공 서버;를 포함하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 예약 서비스 제공 서버는,기 구축된 빅데이터를 이용하여 상기 여행형태를 개인관광 또는 단체관광으로 나누고, 상기 여행선호를 자연,체험, 휴양, 건축, 역사, 문화, 음식, 쇼핑, 레저 및 스포츠를 포함하는 분류자로 분류하며, 상기 여행형태 및여행선호에 따른 군집을 설정하고, 설정된 군집 내 선호되는 여행지를 정렬하여 상기 사용자 단말로 제공하는분석부;를 더 포함하는 것을 특징으로 하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 예약 서비스 제공 서버는,상기 기 구축된 빅데이터에서 개인관광 또는 단체관광을 분류하여 여행형태를 분류하고, 상기 기 구축된 빅데이터의 GPS를 기반으로 각 위치별 분류자를 라벨링하여 여행선호를 분류하며, 상기 여행형태 및 여행선호에 따른군집을 도출한 후 도출된 군집별 프로파일링을 진행하고, 도출된 군집 내에서 선호되는 여행지를 추출하여 여행형태 및 여행선호와 매핑되도록 저장하는 데이터셋생성부;를 더 포함하는 것을 특징으로 하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 예약 서비스 제공 서버는,상기 데이터셋을 이용하여 적어도 하나의 인공지능 알고리즘에 대하여 학습, 검증 및 테스트를 진행하고, 정확도가 가장 높은 인공지능 알고리즘을 선정하여 상기 여행지를 추천하는 인공지능 알고리즘으로 세팅하는세팅부;공개특허 10-2025-0042406-3-를 더 포함하는 것을 특징으로 하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 예약 서비스 제공 서버는,상기 사용자 단말로 상기 예약 서비스를 제공할 때, 적어도 하나의 교통 및 숙박에 대한 후기 데이터를 추출한후 상기 사용자 단말로 링크를 제공하는 후기연결부;를 더 포함하는 것을 특징으로 하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 예약 서비스 제공 서버는,상기 사용자 단말에서 질의를 입력하는 경우 상기 질의에 대한 응답을 제공하도록 인공지능 챗봇을 구축하는 질의응답부;를 더 포함하는 것을 특징으로 하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 예약 서비스 제공 서버는,상기 인공지능 챗봇을 통하여 번역 및 통역을 하도록 설정하는 통번역부;를 더 포함하는 것을 특징으로 하는 여행관광 종합 예약 서비스 제공 시스템."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "여행관광 종합 예약 서비스 제공 시스템이 제공되며, 사용자의 나이 및 성별의 개인정보를 입력하고, 여행형태 및 여행선호에 대한 선호도 데이터를 입력하며, 개인정보 및 선호도 데이터에 기반하여 여행지를 추천받고, 여행 지에 대한 교통 및 숙박을 위한 예약 서비스를 제공받는 사용자 단말 및 사용자 단말로부터 사용자의 나이 및 성 별의 개인정보를 입력받는 개인정보입력부, 사용자 단말로부터 여행형태 및 여행선호에 대한 선호도 데이터를 입 력받는 선호도입력부, 개인정보 및 선호도 데이터를 기 구축된 인공지능 알고리즘에 입력하여 적어도 하나의 여 행지를 추출하는 추출부, 추출된 적어도 하나의 여행지를 사용자 단말로 전송하는 전송부, 사용자 단말에서 여행 지를 선택하는 경우, 선택된 여행지로 이동하기 위한 교통 및 여행지에서 머물기 위한 숙박에 대한 예약 서비스 를 제공하는 예약부를 포함하는 예약 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 여행관광 종합 예약 서비스 제공 시스템에 관한 것으로, 사용자의 개인정보, 여행형태 및 여행선호의 정보를 이용하여 여행지를 추천해주고 교통 및 숙박을 예약해줄 수 있는 종합 플랫폼을 제공한다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "스마트 관광은 ICT를 매개로 다양한 정보가 상호 교환되는 사회문화 및 경제적 활동이며 관광객에게 앱과 플랫 폼 서비스를 통해 실시간, 맞춤형 정보를 스마트하게 경험할 수 있게 해주는 지능화된 관광이다. 세계 각국은 ICT와 관광을 융합한 새로운 스마트 관광 서비스를 제공함으로써 개별 관광객을 유치하기 위해 총력을 기울이고 있다. 또, 경험이 강조됨에 따라 경험과 체험을 거래하는 관광분야에서 스마트 관광은 중요한 패러다임으로 발 전하고 있다. 특히 관광산업은 코로나19의 팬데믹 상황을 맞닥뜨리면서 지금까지와는 차별화된 방향과 전략을 모색하지 않을 수 없었고, 관광 트렌드는 불가피하게 소규모 및 비대면을 중심으로 재편되고 있다. 즉, 관광업 계는 모바일과 ICT를 접목해 교통, 번역, 예약 및 결제까지 한 번에 해결하는 스마트 관광 인프라를 구축하는 등 종래와는 다른 전략을 통해 적극적으로 관광객을 유치할 수 있는 방안을 마련해야 하는 상황에 직면해 있다. 이때, 여행자를 위한 가이드 서비스를 제공하거나 일정계획 및 예약을 대행하는 서비스가 연구 및 개발되었는데, 이와 관련하여 선행기술인 한국공개특허 제2017-0107865호(2017년09월26일 공개) 및 한국등록특 허 제10-1905390호(2018년10월08일 공고)에는, 사용자 단말의 여행정보 및 위치정보를 저장하고, 사용자 단말에서 여행정보가 승인되면 지역별 기상정보 및 여행지 데이터를 수집하며, 사용자 단말로 기상정보에 기반하여 예 약정보를 제공하는 구성과, 숙박, 관광지, 식당, 가이드 및 교통수단을 포함한 여행 콘텐츠를 사용자 단말로 제 공하고, 사용자 단말로부터 여행기간 및 필수 콘텐츠를 입력받으며, 필수 콘텐츠를 여행일정에 편입시킨 후 여 행일정을 시간, 거리 및 비용 측면에서 최적화되도록 시계열적으로 배열하고, 최적화된 여행일정을 사용자 단말 로 제공한 후 컨펌을 받고 예약을 진행하는 구성이 각각 개시되어 있다. 다만, 전자의 경우 사용자에게 어떠한 여행정보를 어떻게 추천할 것인지에 대한 구체적인 구성이 개시되어 있지 않고, 후자의 경우에도 여행지가 설정된 후의 예약과정만을 개시하고 있기 때문에 여행지를 추천 및 결정하는 과정에 대한 구성을 개시하고 있지 않다. 최근 관광의 트렌드는 개인화 및 맞춤화인데 단순히 모두에게 선호되 는 관광지를 추천해주는 것이 아닌, 개인의 성향이나 성격, 관심사를 반영하여 관광객 개인에게 적합한 관광지 를 추천해주는 알고리즘이 연구되고 있다. 이에, 사용자의 개인정보, 여행형태 및 여행선호의 정보를 이용하여 여행지를 추천해주고 교통 및 숙박을 예약해줄 수 있는 종합 플랫폼의 연구 및 개발이 요구된다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는, 사용자 단말로부터 사용자의 개인정보, 여행형태 및 여행선호의 정보를 입력받아 여행 지를 추천하고, 여행지가 선택되는 경우 교통편 및 숙박의 예약을 종합적으로 대행하며, 인공지능 챗봇을 이용 하여 사용자 단말에서 입력되는 질의에 응답을 제공하도록 함과 동시에 각종 번역 및 통역 서비스를 제공하도록 하고, 단기 관광객 뿐만 아니라 장기 출장이나 의료관광 등 특수 관광객에 대한 지역편의 서비스를 제공하며, 여행 파트너를 매칭해주고, 지역 가이드를 매칭해줄 수 있는, 여행관광 종합 예약 서비스 제공 시스템을 제공할 수 있다. 다만, 본 실시예가 이루고자 하는 기술적 과제는 상기된 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술적 과제들이 존재할 수 있다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 발명의 일 실시예는, 사용자의 나이 및 성별의 개 인정보를 입력하고, 여행형태 및 여행선호에 대한 선호도 데이터를 입력하며, 개인정보 및 선호도 데이터에 기 반하여 여행지를 추천받고, 여행지에 대한 교통 및 숙박을 위한 예약 서비스를 제공받는 사용자 단말 및 사용자 단말로부터 사용자의 나이 및 성별의 개인정보를 입력받는 개인정보입력부, 사용자 단말로부터 여행형태 및 여 행선호에 대한 선호도 데이터를 입력받는 선호도입력부, 개인정보 및 선호도 데이터를 기 구축된 인공지능 알고 리즘에 입력하여 적어도 하나의 여행지를 추출하는 추출부, 추출된 적어도 하나의 여행지를 사용자 단말로 전송 하는 전송부, 사용자 단말에서 여행지를 선택하는 경우, 선택된 여행지로 이동하기 위한 교통 및 여행지에서 머 물기 위한 숙박에 대한 예약 서비스를 제공하는 예약부를 포함하는 예약 서비스 제공 서버를 포함한다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 본 발명의 과제 해결 수단 중 어느 하나에 의하면, 사용자 단말로부터 사용자의 개인정보, 여행형태 및 여행선호의 정보를 입력받아 여행지를 추천하고, 여행지가 선택되는 경우 교통편 및 숙박의 예약을 종합적으로 대행하며, 인공지능 챗봇을 이용하여 사용자 단말에서 입력되는 질의에 응답을 제공하도록 함과 동시에 각종 번 역 및 통역 서비스를 제공하도록 하고, 단기 관광객 뿐만 아니라 장기 출장이나 의료관광 등 특수 관광객에 대 한 지역편의 서비스를 제공하며, 여행 파트너를 매칭해주고, 지역 가이드를 매칭해줄 수 있다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 명세서 전체에서 사용되는 정도의 용어 \"약\", \"실질적으로\" 등은 언급된 의미에 고유한 제조 및 물질 허용오차 가 제시될 때 그 수치에서 또는 그 수치에 근접한 의미로 사용되고, 본 발명의 이해를 돕기 위해 정확하거나 절 대적인 수치가 언급된 개시 내용을 비양심적인 침해자가 부당하게 이용하는 것을 방지하기 위해 사용된다. 본 발명의 명세서 전체에서 사용되는 정도의 용어 \"~(하는) 단계\" 또는 \"~의 단계\"는 \"~ 를 위한 단계\"를 의미하지 않는다. 본 명세서에 있어서 '부(部)'란, 하드웨어에 의해 실현되는 유닛(unit), 소프트웨어에 의해 실현되는 유닛, 양 방을 이용하여 실현되는 유닛을 포함한다. 또한, 1 개의 유닛이 2 개 이상의 하드웨어를 이용하여 실현되어도 되고, 2 개 이상의 유닛이 1 개의 하드웨어에 의해 실현되어도 된다. 한편, '~부'는 소프트웨어 또는 하드웨어 에 한정되는 의미는 아니며, '~부'는 어드레싱 할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객 체 지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회 로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또 는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 명세서에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수도 있다. 이와 마찬가지로, 서버가 수행하는 것으로 기 술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 본 명세서에서 있어서, 단말과 매핑(Mapping) 또는 매칭(Matching)으로 기술된 동작이나 기능 중 일부는, 단말 의 식별 정보(Identifying Data)인 단말기의 고유번호나 개인의 식별정보를 매핑 또는 매칭한다는 의미로 해석 될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스 제공 시스템을 설명하기 위한 도면이다. 도 1 을 참조하면, 여행관광 종합 예약 서비스 제공 시스템은, 적어도 하나의 사용자 단말, 예약 서비스 제 공 서버, 적어도 하나의 교통예약서버, 적어도 하나의 숙박예약서버 및 가이드 단말 및 여 행사 단말을 포함할 수 있다. 다만, 이러한 도 1의 여행관광 종합 예약 서비스 제공 시스템은, 본 발 명의 일 실시예에 불과하므로, 도 1을 통하여 본 발명이 한정 해석되는 것은 아니다. 이때, 도 1의 각 구성요소들은 일반적으로 네트워크(Network, 200)를 통해 연결된다. 예를 들어, 도 1에 도시 된 바와 같이, 적어도 하나의 사용자 단말은 네트워크를 통하여 예약 서비스 제공 서버와 연결 될 수 있다. 그리고, 예약 서비스 제공 서버는, 네트워크를 통하여 적어도 하나의 사용자 단말 , 적어도 하나의 교통예약서버, 적어도 하나의 숙박예약서버, 가이드 단말 및 여행사 단말 과 연결될 수 있다. 또한, 적어도 하나의 교통예약서버는, 네트워크를 통하여 예약 서비스 제 공 서버와 연결될 수 있다. 그리고, 적어도 하나의 숙박예약서버는, 네트워크를 통하여 적어도 하나의 사용자 단말, 예약 서비스 제공 서버 및 적어도 하나의 교통예약서버와 연결될 수 있다. 가이드 단말은, 네트워크를 통하여 사용자 단말, 교통예약서버, 예약 서비스 제공 서버 , 적어도 하나의 숙박예약서버와 연결될 수 있다. 그리고, 여행사 단말은, 네트워크를 통하여 사용자 단말, 예약 서비스 제공 서버, 가이드 단말과 연결될 수 있다. 여기서, 네트워크는, 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의 미하는 것으로, 이러한 네트워크의 일 예에는 근거리 통신망(LAN: Local Area Network), 광역 통신망(WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통신망 등을 포함한다. 무선 데이터 통신망의 일례에는 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), 5G NR(New Radio), 6G(6th Generation of Cellular Networks), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와이파이(Wi-Fi), 인터넷 (Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near- Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등이 포함되나 이에 한정되지는 않는다. 하기에서, 적어도 하나의 라는 용어는 단수 및 복수를 포함하는 용어로 정의되고, 적어도 하나의 라는 용어가 존재하지 않더라도 각 구성요소가 단수 또는 복수로 존재할 수 있고, 단수 또는 복수를 의미할 수 있음은 자명 하다 할 것이다. 또한, 각 구성요소가 단수 또는 복수로 구비되는 것은, 실시예에 따라 변경가능하다 할 것이다. 적어도 하나의 사용자 단말은, 여행관광 종합 예약 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 개인정보를 입력하고, 여행형태 및 여행선호에 대한 정보를 입력한 후, 개인정보, 여행 형태 및 여행선호에 따른 여행지를 추천받는 고객인 사용자(User)의 단말일 수 있다. 그리고, 사용자 단말 은, 예약 서비스 제공 서버로부터 추천받은 여행지 중 어느 하나의 여행지를 선택하고, 선택된 여행 지에 대한 교통 및 숙박의 예약을 예약 서비스 제공 서버로 요청하는 단말일 수 있다. 또한, 사용자 단말 은 여행에 동행, 즉 파트너를 요청할 수도 있고 이에 대한 매칭을 예약 서비스 제공 서버로부터 받는 단말일 수 있다. 그리고, 사용자 단말은 확정된 여행지에 대한 가이드를 위하여 가이드 단말 또는 여행사 단말과 매칭되는 단말일 수 있다. 여기서, 적어도 하나의 사용자 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터 로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데 스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 적어도 하나의 사용자 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 적어도 하나의 사용자 단말은, 예 를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)-2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰(Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반의 무선 통신 장치를 포함할 수 있다. 예약 서비스 제공 서버는, 여행관광 종합 예약 서비스 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션 을 제공하는 서버일 수 있다. 그리고, 예약 서비스 제공 서버는, 여행관광 빅데이터를 수집한 후, [인구 통계학적 데이터-여행형태-여행선호-여행지]를 라벨링하고, 클러스터링을 수행하여 군집을 생성하며, 데이터셋 을 구축하는 서버일 수 있다. 또한, 예약 서비스 제공 서버는, 적어도 하나의 인공지능 알고리즘에 데이 터셋을 입력하여, 인구통계학적 데이터, 여행형태 및 여행선호에 대한 정보를 입력하면, 입력된 정보를 가지는 군집을 추출하고, 각 군집에서 선호하는 여행지를 선호도별로 리스트업하여 출력하도록 학습, 검증 및 테스트하 는 서버일 수 있다. 또한, 예약 서비스 제공 서버는, 사용자 단말에서 인구통계학적 데이터인 개인 정보를 입력하고, 여행형태 및 여행선호에 대한 정보를 입력하는 경우, 사용자가 속하는 군집을 파악한 후, 사 용자가 속하는 군집에서 선호하는 여행지를 추출하여 추천하는 서버일 수 있다. 그리고, 예약 서비스 제공 서 버는, 사용자 단말에서 여행지를 선택한 경우, 여행지로 이동하기 위한 교통, 예를 들어, 항공, 열차, 버스 등을 예약하고, 여행지에서 머물기 위한 숙박, 예를 들어, 호텔, 호스텔, 공유숙박 등을 예약하는 서버일 수 있다. 또한, 예약 서비스 제공 서버는, 여행지가 확정된 경우, 여행지를 가이드할 가이드 단말 또는 여행사 단말을 사용자 단말과 매칭하는 서버일 수 있다. 그리고, 예약 서비스 제공 서버 는, 사용자 단말에서 여행에 동행, 즉 파트너를 요청하는 경우 사용자 단말과 여행 스타일이 유 사한 파트너를 추출하여 매칭해주는 서버일 수 있다.여기서, 예약 서비스 제공 서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스 크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 교통예약서버는, 여행관광 종합 예약 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 항공, 열차, 버스 등을 예약하는 서버일 수 있다. 이때, 교통예약서버는, 예약을 중개하는 플랫폼일 수도 있고, 각 항공사, 열차운행사, 버스운행사 등의 서버일 수도 있다. 여기서 예약을 중 개하는 플랫폼은 예를 들어, 스카이스캐너, 트립닷컴, 구글플라이트 등일 수 있으나 나열된 것들로 한정되지 않 고 열거되지 않은 이유로 배제되지 않는다. 여기서, 적어도 하나의 교통예약서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 적어도 하나의 숙박예약서버는, 여행관광 종합 예약 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애 플리케이션을 이용하여 호텔, 호스텔, 공유숙박 등을 예약하는 서버일 수 있다. 이때, 숙박예약서버는, 예약을 중개하는 플랫폼일 수도 있고, 각 호텔, 호스텔, 공유숙박 등의 서버일 수도 있다. 여기서 예약을 중개 하는 플랫폼은 글로벌 온라인 여행사(Online Travel Agency, OTA)일 수 있고, 예를 들어, 부킹닷컴, 호텔스닷컴, 호텔스컴바인, 익스피디아, 트리바고, 아고다 등일 수 있으나 나열된 것들로 한정되지 않고 열거되 지 않은 이유로 배제되지 않는다. 여기서, 적어도 하나의 숙박예약서버는, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우 저(WEB Browser)가 탑재된 노트북, 데스크톱(Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 가이드 단말은, 여행관광 종합 예약 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이 용하여 가이드가 가능한 여행지, 경력 및 스케줄을 업로드하고, 사용자 단말과 매칭이 되는 경우 승낙 또 는 거절의 의사표시를 전달하며, 승낙이 된 경우 요청된 날짜에 사용자에게 가이드를 진행하는 가이드의 단말일 수 있다. 여기서, 가이드 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱 (Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 가이드 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 가이드 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)- 2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰 (Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반 의 무선 통신 장치를 포함할 수 있다. 여행사 단말은, 여행관광 종합 예약 서비스 관련 웹 페이지, 앱 페이지, 프로그램 또는 애플리케이션을 이 용하여 가이드가 가능한 여행지, 스케줄 및 가격을 업로드하고, 사용자 단말에서 여행지 및 여행사를 선택 하는 경우, 이에 대응하는 예약을 받는 현지 여행사의 단말일 수 있다. 이때 여행사란 랜드사로 현지 가이드를 고용 또는 용역으로 이용하여 버스와 같은 투어차량 또는 대중교통으로 각 관광지를 이동하면서 데이투어 등을 진행하는 곳을 의미한다. 여기서, 여행사 단말은, 네트워크를 통하여 원격지의 서버나 단말에 접속할 수 있는 컴퓨터로 구현될 수 있다. 여기서, 컴퓨터는 예를 들어, 네비게이션, 웹 브라우저(WEB Browser)가 탑재된 노트북, 데스크톱 (Desktop), 랩톱(Laptop) 등을 포함할 수 있다. 이때, 여행사 단말은, 네트워크를 통해 원격지의 서버나 단말에 접속할 수 있는 단말로 구현될 수 있다. 여행사 단말은, 예를 들어, 휴대성과 이동성이 보장되는 무선 통신 장치로서, 네비게이션, PCS(Personal Communication System), GSM(Global System for Mobile communications), PDC(Personal Digital Cellular), PHS(Personal Handyphone System), PDA(Personal Digital Assistant), IMT(International Mobile Telecommunication)-2000, CDMA(Code Division Multiple Access)- 2000, W-CDMA(W-Code Division Multiple Access), Wibro(Wireless Broadband Internet) 단말, 스마트폰 (Smartphone), 스마트 패드(Smartpad), 타블렛 PC(Tablet PC) 등과 같은 모든 종류의 핸드헬드(Handheld) 기반 의 무선 통신 장치를 포함할 수 있다. 도 2는 도 1의 시스템에 포함된 예약 서비스 제공 서버를 설명하기 위한 블록 구성도이고, 도 3 및 도 4는 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 2를 참조하면, 예약 서비스 제공 서버는, 개인정보입력부, 선호도입력부, 추출부, 전송 부, 예약부, 분석부, 데이터셋생성부, 세팅부, 후기연결부, 질의응답부, 통번역부, 파트너매칭부, 가이드매칭부, 인력풀구축부를 포함할 수 있다. 본 발명의 일 실시예에 따른 예약 서비스 제공 서버나 연동되어 동작하는 다른 서버(미도시)가 적어도 하 나의 사용자 단말, 적어도 하나의 교통예약서버, 적어도 하나의 숙박예약서버, 가이드 단말 및 여행사 단말로 여행관광 종합 예약 서비스 애플리케이션, 프로그램, 앱 페이지, 웹 페이지 등을 전송하는 경우, 적어도 하나의 사용자 단말, 적어도 하나의 교통예약서버, 적어도 하나의 숙박예약서 버, 가이드 단말 및 여행사 단말은, 여행관광 종합 예약 서비스 애플리케이션, 프로그램, 앱 페 이지, 웹 페이지 등을 설치하거나 열 수 있다. 또한, 웹 브라우저에서 실행되는 스크립트를 이용하여 서비스 프로그램이 적어도 하나의 사용자 단말, 적어도 하나의 교통예약서버, 적어도 하나의 숙박예약서버 , 가이드 단말 및 여행사 단말에서 구동될 수도 있다. 여기서, 웹 브라우저는 웹(WWW: World Wide Web) 서비스를 이용할 수 있게 하는 프로그램으로 HTML(Hyper Text Mark-up Language)로 서술된 하이퍼 텍스트를 받아서 보여주는 프로그램을 의미하며, 예를 들어 크롬(Chrome), 에지(Microsoft Edge), 사파리 (Safari), 파이어폭스(FireFox), 웨일(Whale), UC 브라우저 등을 포함한다. 또한, 애플리케이션은 단말 상의 응용 프로그램(Application)을 의미하며, 예를 들어, 모바일 단말(스마트폰)에서 실행되는 앱(App)을 포함한다. 도 2를 참조하면, 개인정보입력부는, 사용자 단말로부터 사용자의 나이 및 성별의 개인정보를 입력받 을 수 있다. 사용자 단말은, 사용자의 나이 및 성별의 개인정보를 입력할 수 있다. 이때, 개인정보의 경 우 사용자를 특정하기 위한 개인정보가 아니라, 군집을 형성할 때 군집을 나누고 프로파일링을 하기 위한 인구 통계학적 데이터일 수 있다. 이때, 인구통계학적 데이터란, 나이, 성별, 가족규모, 가족수명주기, 소득, 직업, 교육수준, 종교 등 사회를 구성하는 사람들의 특성을 나타내는 데이터를 일컫는다. 물론, 이러한 데이터 외에 도 다양한 정보가 수집 및 이용될 수 있음은 물론이라 할 것이다. 선호도입력부는, 사용자 단말로부터 여행형태 및 여행선호에 대한 선호도 데이터를 입력받을 수 있다. 사용자 단말은, 여행형태 및 여행선호에 대한 선호도 데이터를 입력할 수 있다. 이때, 여행형태는 다양하게 나눌 수 있겠지만 우선 개인관광인지 단체관광인지 등으로 나누고, 여행선호의 경우 자연, 체험, 휴양, 건축, 역사, 문화, 음식, 쇼핑, 레저 및 스포츠 등으로 나누는 방법을 이용할 수 있다. 물론, 상술한 방 법으로 분류하는 것 이외에도 다양한 방법이 이용될 수 있다. 여기서, 여행선호의 경우 관광목적지 분류기준에 따라 분류될 수 있는데 예를 들어 이하 표 1 내지 표 3과 같다. 표 1 대분류 중분류 소분류 자연 자연관광지 자연생태관광지 섬 어촌 산 해수욕장 수목원 군립공원 국립공원 자연휴양림 동굴 도립공원 항구/포구 등대 호수 계곡 강 해안절경 폭포 관광자원 기암괴석 희귀동/식물표 2 대분류 중분류 소분류 인문 (문화/예술 /역사)체험관광지 이색체험 이색거리 농.산.어촌 체험 관광농원 전통체험 산사체험 휴양관광지 공원 온천/욕장/스파 유원지 테마공원 관광단지 헬스투어 건축/조형물 유명건물 기념탑/기념비/전망대 터널 역사관광지 유적지/사적지 고궁/성 민속마을/고택/생가 종교성지 문화시설 전시관 미술관/화랑 기념관/박물관 표 3 대분류 중분류 소분류 음식 음식점 이색음식점 쇼핑 쇼핑 상설시장 레포츠 육상 육상레포츠 스키/스노보드 야영장, 오토캠핑장 수상 수상레포츠 추출부는, 개인정보 및 선호도 데이터를 기 구축된 인공지능 알고리즘에 입력하여 적어도 하나의 여행지를 추출할 수 있다. 표 1 내지 표 3과 같이 여행선호를 나누고, 개인관광인지 또는 단체관광인지를 나누며, 인구 통계학적 데이터를 입력받는 경우 사용자가 속할 군집을 추출해낼 수 있다. 즉, 후술하겠지만, 빅데이터의 데 이터셋을 학습-검증-테스트를 완료한 후 군집별 프로파일링이 완료된 상태에서, 사용자가 자신의 정보를 입력하 면 사용자가 어느 군집에 속할 것인지는 유사도를 측정함으로써 파악이 가능하기 때문이다. 예를 들어, 관광 이동량, 이동 특성, 목적지 선호도, 연령 및 세대별 분포 등을 기준으로 군집의 특징을 프로파일링할 수 있고, 여행이동의 행태를 분석해낼 수 있다. 이때 여행이동의 행태는 예를 들어, 활동력이 높은지 낮은지, 목적지 선 호도가 자연형인지, 인문형인지, 음식쇼핑형인지, 레포츠형인지 등을 분석해낼 수 있다. 또 표 1 내지 표 3의 각 대-중-소분류를 통하여 휴양을 중시하는지 활동을 중시하는지, 휴양을 중시한다면 인구밀도가 높은 곳을 선 호하는지 낮은 곳을 선호하는지 등의 정보를 파악할 수 있다. 전송부는, 추출된 적어도 하나의 여행지를 사용자 단말로 전송할 수 있다. 사용자 단말은, 개 인정보 및 선호도 데이터에 기반하여 여행지를 추천받을 수 있다. 예약부는, 사용자 단말에서 여행지를 선택하는 경우, 선택된 여행지로 이동하기 위한 교통 및 여행지 에서 머물기 위한 숙박에 대한 예약 서비스를 제공할 수 있다. 사용자 단말은, 여행지에 대한 교통 및 숙 박을 위한 예약 서비스를 제공받을 수 있다. 이때, 교통과 숙박은 어떠한 것을 선호하는지 등에 대한 정보를입력받을 수 있다. 예를 들어, 숙박의 경우, 가격범위는 어느 선까지 가능한지, 호텔의 경우 등급은 몇 등급을 원하는지, 호텔이 아닌 공유숙박이나 호스텔도 괜찮은 것인지, 휴양지라면 휴양지에 얼마나 근접해야 하는지, 침대는 트윈을 원하는지 더블을 원하는지, 화장실 크기는 얼마나 되어야 하는지, 사우나나 수영장이 필요한지 필요하지 않은지 등 다양한 정보를 수집할 수 있다. 또 교통의 경우에도 무조건 택시를 타야하는 것인지 또는 무거운 짐을 들고 대중교통을 탈 수 있어서 대중교통도 괜찮은지 등의 정보를 수집하여 추천할 수 있다. 분석부는, 기 구축된 빅데이터를 이용하여 여행형태를 개인관광 또는 단체관광으로 나누고, 여행선호를 자 연, 체험, 휴양, 건축, 역사, 문화, 음식, 쇼핑, 레저 및 스포츠를 포함하는 분류자로 분류하며, 여행형태 및 여행선호에 따른 군집을 설정하고, 설정된 군집 내 선호되는 여행지를 정렬하여 사용자 단말로 제공할 수 있다. 이때, 군집분석은 개체 간 유사성(또는 거리)을 기반으로 군집을 분류하기 때문에 단위의 차이가 큰 변 수는 표준화하여 척도화할 필요가 있다. 이를 위하여, 예를 들어, 각 변수를 Z-Score로 표준화하여 분석을 수 행할 수 있다. 이때, Z 점수란 서로 다른 분포로부터 나온 값을 비교 가능하게 만들어주는 표준화 값으로 관측 값이 평균에서 얼마나 떨어져 있는지를 나타낸다. 즉 Z 점수가 음수라면 평균이하를 나타내며, 양수이면 평균 이상을 나타낸다. Z 점수는 관측값에서 모집단의 평균을 뺀 후 모집단의 표준편차로 나누어 구할 수 있다. 여 기서, 군집분석은 다양한 클러스터링 알고리즘을 이용할 수 있는데 예를 들어 K-Means를 이용할 수 있다. 또 군집별 속성의 차이가 통계적으로 유의미한지를 알아보기 위해 일원배치분산분석(ANOVA)을 수행할 수 있다. 또, 군집별 프로파일링을 위해 전체 관광이동량, 거주지 기준 이동특성, 목적지선호도, 연령 및 세대별 분포 등 을 기준으로 군집의 특징을 분석할 수도 있다. 데이터셋생성부는, 기 구축된 빅데이터에서 개인관광 또는 단체관광을 분류하여 여행형태를 분류하고, 기 구축된 빅데이터의 GPS를 기반으로 각 위치별 분류자를 라벨링하여 여행선호를 분류하며, 여행형태 및 여행선호 에 따른 군집을 도출한 후 도출된 군집별 프로파일링을 진행하고, 도출된 군집 내에서 선호되는 여행지를 추출 하여 여행형태 및 여행선호와 매핑되도록 저장할 수 있다. 예를 들어, 예루살렘의 감람산의 GPS가 존재한다면, 감람산의 GPS에 [겟세마네 동산-종교성지] 등으로 POI를 여행선호로 상술한 표 2와 같이 라벨링할 수 있다. 또 속초의 송정해수욕장의 GPS가 존재한다면, 송정 해수욕장의 GPS에 [송정해변-해수욕장] 등으로 POI를 여행선호 로 상술한 표 1과 같이 라벨링할 수 있다. 세팅부는, 데이터셋을 이용하여 적어도 하나의 인공지능 알고리즘에 대하여 학습, 검증 및 테스트를 진행 하고, 정확도가 가장 높은 인공지능 알고리즘을 선정하여 여행지를 추천하는 인공지능 알고리즘으로 세팅할 수 있다. 이때 군집에서 선호하는 여행지순으로 정렬하여 추천하도록 인공지능 알고리즘을 이용할 수 있는데, 예 를 들어 협업 필터링을 이용할 수 있다. 사용자 기반(User-Based) 협업 필터링이 사용자 기반 군집의 선호도를 가장 잘 반영하므로 이를 이용할 수도 있다. 물론 상술한 것들로 한정되는 것은 아니다. 후기연결부는, 사용자 단말로 예약 서비스를 제공할 때, 적어도 하나의 교통 및 숙박에 대한 후기 데 이터를 추출한 후 사용자 단말로 링크를 제공할 수 있다. 이때, 후기를 제공할 때 숙박의 경우 각 옵션에 따라 후기가 달라질 수 있고, 사용자가 선택하려는 옵션에서 후기를 보는 것이 가장 중요하기 때문에, 사용자가 선택한 옵션에 따른 후기를 별도로 추출하여 제공해줄 수 있다. 예를 들어 1 박에 수 백 만원을 호가하는 스위 트 룸에서 묵은 리뷰어의 리뷰와, 가장 저렴한 스탠다드 룸에서 묵은 리뷰어의 리뷰가 같을 수는 없기 때문이다. 그리고, 가짜 리뷰를 탐지하는 방법을 더 이용하여 가짜 리뷰는 배제시킬 수 있다. 예를 들어, 리 뷰의 길이, 리뷰에 대한 타인의 평가, 리뷰가 작성된 순서, 긍정-부정 단어의 비율, 리뷰 내용과 소개 내용 간 유사도, 리뷰 평점과 타인 평점과의 일치도, 리뷰어가 쓴 리뷰 중 첫 리뷰였던 비율, 5 점 만점에 4 점 이상을 준 비율, 얼마나 한꺼번에 몰아서 리뷰를 쓰는지 등을 이용할 수 있지만 이에 한정되지는 않는다. 그리고, 리"}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "뷰가 많은 경우에는 리뷰를 모두 읽어볼 시간이 없을 수 있으므로 각 키워드를 기준으로 요약을 해주거나 의견 을 모아줄 수도 있다. 예를 들어, 호텔의 조식을 키워드로 추출한 경우, 조식에 대한 의견이 좋았는지 보통이 었는지 나빴는지 등을 추출하여 그 비율을 안내하는 방식을 이용할 수도 있다. 이를 위하여 키워드 추출 알고"}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "리즘, 요약 알고리즘 및 감성 분석 알고리즘을 이용할 수도 있다. 질의응답부는, 사용자 단말에서 질의를 입력하는 경우 질의에 대한 응답을 제공하도록 인공지능 챗봇 을 구축할 수 있다. 이를 위하여 ChatGPT(Chat Generated Pre-trained Transformer)를 이용할 수 있다. 관광 객의 관점에서 ChatGPT는 그동안 관광 의사결정을 위해 여러 웹사이트를 참고하며 관광 정보를 수집하던 소요시 간을 줄일 수 있어 긍정적인 도구이다. 다만, 여행 정보 검색 및 수집에는 한계가 존재할 수 있는데, 첫째로 ChatGPT는 인간의 사고를 모델링하지만, 사고의 재구성이나 추론은 할 수 없는 인지적 한계를 지닌다. 관광 의 사결정은 주관적, 직관적, 감성적인 작업을 수반하기에 ChatGPT의 인지적 한계는 의사결정에 유용하지 않을 수 있다. 둘째로, ChatGPT의 검색 결과는 기본적으로 텍스트 기반의 정보이기에 이미지나 지도 공간 상의 위치를제공할 수 없다. 이미지, 지도 등의 시각적 정보는 관광객의 의사결정 단계에서 중요한 요소로 작용하기에 텍 스트 기반의 제한적 정보는 한계가 될 수 있다. 셋째, ChatGPT에서 관광지의 주소나 좌표를 획득할 수 있으나, 오류가 다수 포함되어 있어 직접적인 활용에는 주의가 필요하다. 마지막으로, ChatGPT는 2021년까지의 데이터 를 입력하여 훈련되었기 때문에 그 이후의 사항에 대해서는 정확한 정보를 얻기 어렵다. 이에 본 발명의 일 실시예에서는 ChatGPT의 한계를 보완하기 위해 경험적 정보를 포함하고 있는 소셜미디어 데 이터를 분석하여 ChatGPT 검색 결과와 접목, 사용자에게 제공하여 의사결정을 지원하는 방법을 이용할 수 있다. 또한, 정확한 위치 정보 제공을 위해 ChatGPT 검색 결과에서 관광 POI(Point of Interest)를 인식 및 추출하여 지도를 통해 시각화할 수 있다. ChatGPT(Chat Generated Pre-trained Transformer)의 인지적, 시각적, 위치 정확도 한계를 보완하기 위해 ChatGPT의 검색 결과 내 관광 POI를 인식 및 추출하여 지도로 표현하고 소셜 빅데 이터 분석 결과를 접목하는 단계를 거칠 수 있다. 최종적으로는 전체 결과를 하나의 웹페이지에 게시하여 정보 를 한 번에 살펴볼 수 있도록 구성할 수 있다. ChatGPT 검색 기능과 소셜 빅데이터 수집 및 분석, POI 추출과 지도 시각화 등 과정은 Python 언어를 통해 진행 할 수 있다. ChatGPT 검색 기능은 Open AI의 API를 통해 구현할 수 있고, 사용자는 입력 언어, 관광 지역, 관 광 기간 등을 전달할 수 있도록 할 수 있다. ChatGPT 검색 결과에 대해서 형태소 분석 등의 자연어 처리 기법 을 적용하여 관광 POI를 인식할 수 있고, 사용자가 직접 제거 및 추가할 수 있도록 구축할 수 있다. 추출된 관 광 POI마다 오픈소스 지도 API를 활용하여 주소 및 좌표를 획득하고 관련 정보의 URL을 함께 습득하여 표 형식 으로 정리할 수 있다. 또한, 이전 관광지부터의 이동 거리와 소요 시간을 사용 시간에 맞춰 계산하여 함께 입 력할 수 있다. 관광 POI는 획득한 좌표를 기반으로 지도에 시각화할 수 있다. 관광 관련 소셜 빅데이터 수집 은 사전에 진행될 수 있으며, 국내의 경우 국내 블로그 서비스 플랫폼 중 가장 점유율이 높은 네이버 블로그를 선정할 수 있다. 수집한 블로그 데이터에 포함된 텍스트에 대해서는 키워드 빈도 및 중심성 분석, LDA(Latent Dirichlet Allocation, LDA) 토픽모델링을, 주소 정보에 대해서는 지오코딩(Geo-Coding) 후 군집 및 열 지도 시각화를 진행할 수 있다. 통번역부는, 인공지능 챗봇을 통하여 번역 및 통역을 하도록 설정할 수 있다. 이를 위하여, 동시통번역 (Simultaneous Machine Translation, SiMT)을 이용할 수 있는데, 이는 문장 중 일부의 단어를 짧은 지연 간격 마다 다른 언어의 단어로 번역하는 것을 목표로 한다. 이는 번역을 실시간으로 수행해야 하는 상황에서 필요성 이 존재하는데 예를 들어, 동시통역은 실시간 라이브 스트리밍, 정상회담 등에서 널리 사용된다. 동시통역은 두 언어를 동시에 이해하고 즉각적으로 번역문을 전달하기 때문에 매우 어렵고 많은 에너지를 요구한다. 실제 로, 기계가 아닌 사람이 하는 경우, 동시통역사는 두 언어를 모국어 수준으로 이해하고 있어야 하며, 대게 30분 의 가용 시간을 가지고 있다. 한편, 기계번역은 신경망을 기반으로 하는 신경망 기계번역(Neural Machine Translation, NMT)을 중심으로 연구 되고 있는데, 번역문을 생성하는 합리적인 모델은 인코더-디코더 구조의 모델로, 인코더에서 입력받은 소스 문 장을 바탕으로 컨텍스트 벡터(ConText Vector)를 디코더에 전달하고 디코더는 해당 벡터를 반영하여 타겟 문장 을 생성하게 된다. 또, 음성번역 모델은 Cascaded 구조와 End-to-End 구조로 구분할 수 있다. Cascaded 구조 는 음성번역 모델에 음성을 텍스트로 변환하는 모듈인 자동 음성 인식(Automatic Speech Recognition, ASR)을 부착하여 변환된 텍스트를 번역하는 모델이다. Cascaded 구조는 텍스트 간의 번역을 학습하는 것으로, 음성번 역 연구의 관점에 포함되지 않는 경우가 있다. 해당 구조는 자동 음성 인식 모듈의 성능에 따라 모델의 성능에 큰 영향을 준다. 또한, 모듈에 의해 변환된 텍스트를 기반으로 번역을 학습하기 때문에, 최종 번역이 텍스트인 지 음성인지에 따라 Text-to-Speech, Text-to-Text로 구분할 수 있다. 반면, End-to-End 구조는 자동 음성 인 식 모듈 없이 음성을 단방향으로 번역하는 Speech-to-Speech 혹은 Speech-to-Text 모델이다. 해당 구조는 노이 즈나 어투에 민감하여 비교적 번역 성능이 낮지만, 음성 인식 모듈의 에러를 전파받지 않는다. 또한, Cascaded 모듈이 두 번의 추론을 진행하는 반면, End-to-End 모듈은 단방향으로 학습을 진행하기 때문에 한 번의 추론을 진행하여 빠른 서비스 속도를 제공할 수 있다는 장점이 있다. 이러한 이유로, 음성번역 최근 연구는 대부분 End-to-End의 형식으로 이루어진다 <동시통번역> 기계번역 모델은 인코더에서 문장 전체를 읽은 후에, 디코더가 타겟 토큰 생성을 시작한다. 이와는 다르게, 동 시통번역 모델은 인코더가 문장 전체를 읽기 전에 디코더가 타겟 토큰을 생성하기 시작한다. 인코더에서 소스 단어를 얼마만큼 읽고 타겟 토큰 단어를 생성할지 결정하는 것이 동시통번역에서 말하는 정책(Policy)을 정의하 는 것이다. 동시통번역 모델은 정책에 따라 번역 성능과 지연시간의 절충점(Trade-off)이 존재한다. 많은 소스 단어를 읽은 후에 디코딩을 시작하면 번역 성능이 높아지게 되지만, 동시통번역에서 중요히 여기는 지연시간 에 악영향을 주게 된다. 반대로, 충분한 소스 단어를 읽지 않고 디코딩을 시작하면 지연시간 성능은 좋아지지 만, 번역 과정에 예측이 포함되어 충분한 번역 성능을 낼 수 없다. 이러한 이유로, 동시통번역 시스템은 번역 성능과 지연시간의 절충점을 맞추기 위하여 정책을 신중히 정의해야 한다. 동시통번역의 궁극적인 목표는 언어적 장벽을 완화하는 동시 음성번역 모델을 구축하는 것이다. 기존 동시통번 역의 대부분의 연구는 자동 음성 인식 시스템을 사용하여, 음성을 텍스트로 변환했다는 가정에서 이루어졌다. 예를 들어, 일정한 규칙의 스텝마다 읽기와 번역을 번갈아 하는 고정 지연정책을 이용하기도 하고, 디코딩을 조 절하는 강화학습(Reinforcement Learning) 혹은 모방학습(Imitation Learning) 전략을 반영한 동적 지연정책을 이용할 수도 있다. 동시통번역에서 기존 연구는 음성이 텍스트로 변환됐다는 가정하에 이루어지만 Cascaded 음 성번역 시스템과 동일하게, 자동 음성 인식을 부착한 동시통번역 시스템은 모델을 학습하는 과정에서 음성이 완 벽한 텍스트로 변환되지 않았을 때의 에러가 함께 전파되어 모델의 성능을 낮출 뿐 아니라, 음성이 텍스트로 변 환하는 과정에서 불필요한 서비스상 지연을 야기한다는 문제점이 있다. 따라서, 동시 음성번역은 직관적인 추 론 결과를 확인할 수 있는 Cascaded 구조에서 End-to-End 구조의 동시 음성 번역 모델에 적용하는 연구로 발전 하는 중이며, 본 발명의 일 실시예에서도 End-to-End 구조를 이용하는 것이 바람직하다. 여기서, 고정 지연정 책 또는 동적 지연정책을 이용하는 동시통번역을 이용하되, 동시통번역 평가지표, 예를 들어, 번역품질 평가지 표와, 지연 평가지표의 품질을 만족하는 동시통번역기를 이용하는 거이 바람직할 수 있다. 전자의 경우 N-gram 의 오버래핑(Overlapping), BLEU, METEOR 등을 이용할 수 있고, 후자의 경우 Consecutive Wait, Average Proportion, Average Lagging, Differential Average Lagging 등을 이용할 수 있다. 파트너매칭부는, 사용자 단말로부터 여행스타일에 대한 정보를 수집하고, 여행스타일의 유사도가 기 준값을 만족하는 상대방 단말을 사용자 단말과 매칭하여 여행 파트너로 매칭할 수 있다. 예를 들어, 도 4 의 (c)와 같이 여행경비는 공금을 이용하는 것을 선호하는지 각자 해결하는 것을 선호하는지, 계획은 철저히 세 워야 하는지 즉흥적인 것을 선호하는지, 숙박은 호텔을 선호하는지 게스트하우스와 같이 값이 저렴하지만 공동 으로 이용하는 것을 선호하는지, 교통은 택시를 선호하는지 버스를 선호하는지, 항공은 저가항공도 괜찮은지 대 형항공사를 선호하는지, 또 관광을 선호하는지 휴양을 선호하는지 등을 수집함으로써 여행스타일을 파악할 수 있다. 물론, 장거리는 대형항공사와 직항을 선호하지만 단거리의 경우는 저가항공사를 선호하는 경우도 존재할 수 있고, 캐리어와 같이 짐을 모두 가지고 이동하는 경우에는 택시를 선호하지만 그냥 이동하는 경우에는 버스 나 열차 등을 선호할 수도 있고, 계획은 철저히 하지만 즉흥적으로 여행계획을 바꿀 수도 있는데 이러한 경우에 는 주로(Mainly) 선호하는 것을 여행스타일로 저장해두고, 부수적으로 선호하는 것은 그 조건을 부착함으로써 여행스타일을 저장 및 매칭하도록 할 수 있다. 가이드매칭부는, 사용자 단말에서 여행지가 선택, 예약 및 확정된 경우, 여행지 내 관광지를 추출하 고, 추출된 관광지를 가이드할 가이드 또는 현지 여행사를 매칭할 수 있다. 자유여행을 선호하는 사용자 A가 이스라엘 여행을 가는데, 여행지를 이스라엘 내 [예루살렘-에일랏-티베리아스-나자렛-하이파-텔아비브]로 잡았 다고 가정하자. 이때, 예루살렘 근교여행으로 [사해-요단강세례터-여리고]를 지정했는데, 여리고의 경우 이스 라엘 영토가 아니라, 팔레스타인의 자치구인 웨스트뱅크(WestBank)로 체크포인트에서 이스라엘 군인의 검문을 거쳐야하고, 예루살렘에서 출발하는 아랍버스들은 여리고로 가지 않는다. 이에 대중교통으로 갈 수 있는 방법 이 없다. 이렇게 여행지로 지정했으나 대중교통으로 갈 수 없거나, 예루살렘과 같이 각종 종교적 성지가 즐비 하여 가이드의 설명이 필요한 곳 등의 경우 가이드를 매칭해줄 수 있다. 또는 이러한 경우가 아닐지라도 사용 자가 시간이 없어 여행계획을 짜지 못했다거나 효율적으로 각 관광지만 보기를 원하는 경우 각 여행지를 가이드 하는 가이드 또는 여행사를 매칭해줄 수 있다. 인력풀구축부는, 가이드 또는 현지 여행사를 매칭하기 위하여 가이드 단말 및 여행사 단말로부 터 가이드가 가능한 적어도 하나의 관광지, 일정 및 가격을 업로드받고, 후기 데이터를 수집한 후 적어도 하나 의 가이드 단말 및 여행사 단말과 매핑하여 저장할 수 있다. 이때, 각 여행지, 일정, 스케줄, 날짜, 인원수 등에 따른 가격을 함께 업로드하도록 할 수 있다. 덧붙여서, 상술한 여행지를 추천하는 것 외에도 개인화된 최근의 여행 트렌드를 반영하여 관광객에게 여행 만족 도를 극대화할 수 있는 여행 스케줄을 도출하는 수학적 알고리즘을 더 이용할 수 있다. 개별 관광객의 개인정 보는 물론 여행정보 및 여행성향에 대한 정보를 사전에 입력받아 관광지별 만족도와 이동수단에 따른 이동시간 및 비용을 산출할 수 있다. 이를 바탕으로 개별 관광객의 선호도를 반영하여 주어진 제약하에서 만족도를 최대 화할 있는 여행 스케줄을 도출하는 수리모형을 구축할 수 있다. 예를 들어, 관광객이 방문하는 관광지와 체류 시간에 따라 만족도가 계산되고, 그 합을 최대화하는 여행 스케줄을 기본으로 한다. 제약조건은 여행시간 및여행예산으로 여행 스케줄은 관광객이 사전에 입력한 여행시간을 벗어나서 계획될 수 없으며, 이때 개별 관광지 의 개장시각 및 폐장시각도 함께 고려해야 한다. 또한 관광지 간 이동비용과 관광지 입장료를 포함한 여행에 소요되는 비용은 관광객이 사전에 입력한 여행 예산을 넘어설 수 없다. 이동비용의 경우 관광객이 사전에 입력 한 도보로 이동 가능한 거리에 따라 달라질 수 있다. 관광객은 제안된 최적 여행 스케줄을 확인하고, 추가적으 로 여러 가지 조건을 조절하여 개선된 여행 스케줄을 생성할 수 있다. 꼭 방문하고 싶었으나 제약조건에 따라 제외된 관광지를 추가한다거나, 방문 선호도가 떨어지는 관광지를 제외할 수 있으며, 도보로 이동 가능한 거리 를 조절하여 관광지 간 이동간 및 이동비용에 변화를 줄 수 있다. 여행비용이 조금 더 소요되더라도 이동시간 을 단축하여 보다 더 많은 관광지를 방문하도록 여행 스케줄을 수정할 수도 있다. 반대로 특정 관광지에 알고 리즘에서 제시하는 기 본 체류시간보다 더 오래 머물고 싶다면 관광지별 체류시간을 조정하여 만족도를 높이는 수정된 여행 스케줄을 생성할 수도 있다. 이때, 성별, 연령, 지역 등의 기본적인 개인정보와 관광객으로부터 입력받는 여행시작 및 종료지점, 도보로 이 동 가능한 최대거리, 여행예산, 동반인 정보, 여행일자 및 시간을 포함한 여행정보를 이용하여 추천 여행 스케 줄을 생성할 수 있다. 여행시작 및 종료지점은 숙소, 기차역, 공항, 여행지 내 특정지역 등으로 지정할 수 있 으며, 시작지점과 종료지점은 동일하게 혹은 다르게 설정할 수 있다. 또한 관광지 별 이동수단은 관광지 사이 의 거리가 사전에 입력 받은 도보로 이동 가능한 거리보다 가까운 경우는 도보로 이동하고, 먼 경우는 택시를 이용해서 이동하는 상황을 다룬다. 도보로 이동하는 경우, 별도 이동비용은 발생하지 않으나 도보로 이동 가능 한 최대거리가 줄어들고, 택시를 이용하는 경우 해당 관광지역의 택시 요금 체계 기준을 따르는 것으로 한다. 여행 스케줄은 최대 하루를 기준으로 도출되며, 관광객은 여행시간을 입력함으로써 하루 중 특정 시간대의 여행 스케줄을 도출할 수도 있다. 예를 들어 중간에 점심시간을 고려하고 싶다면, 오전시간대와 오후시간대를 각각 설정하여 두 개의 여행 스케줄을 생성할 수 있다. 관광지별 개장, 폐장시간 및 이동수단 등을 복합적으로 고려 하여 최적화를 진행할 수도 있다. 다만, 제약조건이 많아지는 경우 최적해를 찾기 위한 시간이 기하급수적으로 늘어날 수 있으므로 휴리스틱 알고리즘을 이용할 수도 있다. <여행 스케줄링 알고리즘> 특정 관광지역 내에 총 N 개의 관광지가 존재한다. 관광지 별로 기본 체류시간, 입장권 가격, 개장 및 폐장 시 각은 주어져 있으며, 여행예산, 여행 시작 및 종료시각은 관광객으로부터 입력받는다. 관광지 사이의 거리는 구글맵, 카카오지도, 네이버 지도 등의 지도 API(application programming interface, 프로그램 간 상호작용을 위한 인터페이스)를 이용하여 사전에 계산된 값으로 이를 이용하여 관광지 간 이동시간 및 이동비용을 산정한다. 관광지 간 이동비용은 도보를 이용하지 않고 택시를 이용하는 경우 이동거리 및 관광지 해당 지역의 택시 요금체계를 이용하여 도출한다. 관광지 별 단위시간 당 만족도는 사전에 계산되어 상수값으로 입력받는다. 목적식은 방문하는 관광지별로 단위시간 당 만족도에 체류시간을 곱하여 계산되는 만족도의 합을 최대화 하는 목적식을 이용할 수 있다. 이때, 제약식을 적용할 수 있는데, 가능해를 도출하기 위한 관광지 간 이동 및 이동시간, 여행예산 등에 대한 제약조건을 적용할 수 있다. 제약식의 경우 예를 들어, 여행시간에 대 한 제약식일 수 있다. 예를 들어, ① 방문하는 관광지의 도착시각이 관광객으로부터 입력받은 여행 시작시각과 종료시각 사이에 있어야 하고, ② 방문하는 관광지의 개장 시각 이후여야 한다. ③ 또 방문하는 관광지의 도착 시각에서 체류시간 만큼 지난 시각은 관광지의 폐장 시각 이전이어야 하고, ④ 방문하는 관광지들의 시간 상 선 후 관계가 설정되어야 한다. 또 관광지 간 이동과 관련한 제약이 존재하는데, 예를 들어, ⑤ 출발지를 나타내는 노드에서 여행 스케줄이 시 작되어야하고, ⑥ 도착지를 나타내는 노드로 반드시 돌아와야 한다. ⑦ 또 각 순번에 최대 한 곳의 관광지만 방문해야 하며, ⑧ 앞 순번의 방문하는 관광지가 존재해야 뒷 순번의 방문하는 관광지가 배정될 수 있다. ⑨ 또, 한 관광지는 최대 한 번만 방문하도록 제약하며, ⑩ 도착지점인 노드로 돌아온 이후에는 다른 관광지는 방 문하지 않도록 제한한다. ⑪ 또 여행 예산과 관련한 제약식이 존재하는데, 관광지 간 이동비용과 방문 관광지 의 입장료의 합은 여행 예산을 초과할 수 없다. 물론 각 제약식은 변경될 수도 있고 각 사용자의 선호를 반영 하는 경우 무시될 수도 있다. 예를 들어, 70대 부모님을 모시고 가는 경우라면 예산이 초과되는 경우일지라도 도보보다는 택시를 선택할 수도 있다. <특수관광> 의료관광이나 장기출장의 경우 지역편의 서비스가 더 제공될 수 있다. 예를 들어 의료관광 중 건강검진의 경우 첫째날에는 A-B-C-D 검사를 한 후 2 일을 쉬고, 셋째날에 다시 E-F-G-H 검사 등을 하는 경우에는 2 일 동안 관 광을 하거나 지역을 둘러볼 수 있는 프로그램을 추천해줄 수 있다. 또, 성형의 경우 수술 후 최소 7 일 동안은매일 가서 소독 및 항생제 주사를 맞아야 하므로 7 일 간 근교 여행을 할 수 있도록 스케줄링을 해줄 수도 있다. 그리고 장기출장의 경우에는 출장기간 동안 지역 또는 근교에서 여행을 할 수 있도록 가이드를 붙여주거 나 스케줄링 및 예약을 진행해줄 수도 있다. 이하, 상술한 도 2의 예약 서비스 제공 서버의 구성에 따른 동작 과정을 도 3 및 도 4를 예로 들어 상세히 설명 하기로 한다. 다만, 실시예는 본 발명의 다양한 실시예 중 어느 하나일 뿐, 이에 한정되지 않음은 자명하다 할 것이다. 도 3을 참조하면, (a) 예약 서비스 제공 서버는 빅데이터를 분석하여 여행형태 및 여행선호의 정보를 라벨 링하고, (b)와 같이 데이터셋을 구축한 후 (c)와 같이 여행형태와 여행선호의 정보를 질의하면 군집 및 여행지 를 출력하도록 적어도 하나의 인공지능 알고리즘에 대하여 학습-검증-테스트를 진행할 수 있다. 이때, 예약 서 비스 제공 서버는 가장 정확도가 높은 인공지능 알고리즘을 본 발명의 일 실시예에 따른 플랫폼에 세팅하 고, (d)와 같이 적거도 하나의 교통, 숙박, 가이드 및 여행사 등을 등록받아 플랫폼을 구축할 수 있다. 그리고 예약 서비스 제공 서버는 도 4의 (a)와 같이 사용자 단말에서 개인정보, 여행형태 및 여행선호의 정 보를 입력하는 경우, 사용자가 속한 군집을 추출하고, 군집에서 선호하는 여행지를 추출하여 사용자 단말 로 추천할 수 있다. (b)와 같이 사용자 단말에서 여행지를 확정하는 경우 이에 따른 교통, 숙박 및 가이 드 등을 추천하고 예약을 중개할 수 있으며, (c)와 같이 사용자 단말의 여행스타일을 파악하여 여행 파트 너를 매칭해줄 수도 있다. 또 예약 서비스 제공 서버는 (d)와 같이 인공지능 챗봇을 이용하여 실시간 통 번역 서비스를 제공하거나 질의 및 응답 서비스를 제공하도록 할 수 있다. 이와 같은 도 2 내지 도 4의 여행관광 종합 예약 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 을 통해 여행관광 종합 예약 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5는 본 발명의 일 실시예에 따른 도 1의 여행관광 종합 예약 서비스 제공 시스템에 포함된 각 구성들 상호 간에 데이터가 송수신되는 과정을 나타낸 도면이다. 이하, 도 5를 통해 각 구성들 상호간에 데이터가 송수신되 는 과정의 일 예를 설명할 것이나, 이와 같은 실시예로 본원이 한정 해석되는 것은 아니며, 앞서 설명한 다양한"}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "실시예들에 따라 도 5에 도시된 데이터가 송수신되는 과정이 변경될 수 있음은 기술분야에 속하는 당업자에게 자명하다. 도 5를 참조하면, 예약 서비스 제공 서버는, 사용자 단말로부터 사용자의 나이 및 성별의 개인정보를 입력받는 다(S5100). 또, 예약 서비스 제공 서버는, 사용자 단말로부터 여행형태 및 여행선호에 대한 선호도 데이터를 입력받고 (S5200), 개인정보 및 선호도 데이터를 기 구축된 인공지능 알고리즘에 입력하여 적어도 하나의 여행지를 추출 한다(S5300). 그리고, 예약 서비스 제공 서버는, 추출된 적어도 하나의 여행지를 사용자 단말로 전송하고(S5400), 사용자 단 말에서 여행지를 선택하는 경우, 선택된 여행지로 이동하기 위한 교통 및 여행지에서 머물기 위한 숙박에 대한 예약 서비스를 제공한다(S5500). 상술한 단계들(S5100~S5500)간의 순서는 예시일 뿐, 이에 한정되지 않는다. 즉, 상술한 단계들(S5100~S5500)간 의 순서는 상호 변동될 수 있으며, 이중 일부 단계들은 동시에 실행되거나 삭제될 수도 있다. 이와 같은 도 5의 여행관광 종합 예약 서비스 제공 방법에 대해서 설명되지 아니한 사항은 앞서 도 1 내지 도 4 를 통해 여행관광 종합 예약 서비스 제공 방법에 대하여 설명된 내용과 동일하거나 설명된 내용으로부터 용이하 게 유추 가능하므로 이하 설명을 생략하도록 한다. 도 5를 통해 설명된 일 실시예에 따른 여행관광 종합 예약 서비스 제공 방법은, 컴퓨터에 의해 실행되는 애플리 케이션이나 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체는 컴퓨터 저장 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이터 구조, 프로그램 모듈 또는 기타 데 이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매 체를 모두 포함한다. 전술한 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스 제공 방법은, 단말기에 기본적으로 설치된 애플 리케이션(이는 단말기에 기본적으로 탑재된 플랫폼이나 운영체제 등에 포함된 프로그램을 포함할 수 있음)에 의 해 실행될 수 있고, 사용자가 애플리케이션 스토어 서버, 애플리케이션 또는 해당 서비스와 관련된 웹 서버 등 의 애플리케이션 제공 서버를 통해 마스터 단말기에 직접 설치한 애플리케이션(즉, 프로그램)에 의해 실행될 수 도 있다. 이러한 의미에서, 전술한 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스 제공 방법은 단말 기에 기본적으로 설치되거나 사용자에 의해 직접 설치된 애플리케이션(즉, 프로그램)으로 구현되고 단말기에 등 의 컴퓨터로 읽을 수 있는 기록매체에 기록될 수 있다."}
{"patent_id": "10-2023-0125482", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0125482", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스 제공 시스템을 설명하기 위한 도면이다. 도 2는 도 1의 시스템에 포함된 예약 서비스 제공 서버를 설명하기 위한 블록 구성도이다. 도 3 및 도 4는 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스가 구현된 일 실시예를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 여행관광 종합 예약 서비스 제공 방법을 설명하기 위한 동작 흐름도이다."}
