{"patent_id": "10-2023-0052200", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0152578", "출원번호": "10-2023-0052200", "발명의 명칭": "예측 제어 장치 및 그의 동작 방법", "출원인": "주식회사 엘지에너지솔루션", "발명자": "민지홍"}}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "코팅 다이를 이용해 슬러리(slurry)가 로딩되는 기재(base material)에 관련된 데이터를 획득하는 데이터 획득부; 및상기 데이터에 기초하여 슬러리 로딩 특성을 분석하고, 상기 슬러리 로딩 특성의 분석 결과에 응답하여 슬러리온도를 포함하는 후보 제어 값을 도출하고, 예측 모델을 이용하여 상기 후보 제어 값에 대한 품질을 예측하고,상기 품질에 기초하여 최적 제어 값을 도출하는 프로세서를 포함하는 예측 제어 장치."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 예측 모델은 상기 슬러리 온도와 상기 슬러리 로딩 특성의 상관관계를 학습하여 모델링 되는 예측 제어 장치."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 데이터는 상기 기재의 슬러리 로딩량 데이터를 포함하고, 상기 프로세서는 상기 슬러리 로딩량 데이터에 기초하여 슬러리 로딩량의 균일성을 분석하는 예측 제어 장치."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서, 상기 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함하는 예측 제어 장치."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 프로세서는 상기 최적 제어 값을 이용하여 상기 슬러리 온도를 조절하는 예측 제어 장치."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에 있어서, 상기 프로세서는 상기 제2 최적 제어 값을 이용하여 상기 슬러리 펌프 알피엠 또는 상기 다이 간격을 조절하는예측 제어 장치."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 제2 데이터는 상기 기재의 유지부 폭 및 상기 기재의 무지부 폭을 이미지로 변환한 이미지 데이터를 포함하고, 상기 프로세서는 상기 이미지 데이터에 기초하여 상기 미스 매칭 발생 여부를 판단하는 예측 제어 장치. 공개특허 10-2023-0152578-3-청구항 8"}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "코팅 다이를 이용해 슬러리(slurry)가 로딩되는 기재(base material)에 관련된 데이터를 획득하는 단계;상기 데이터에 기초하여 슬러리 로딩 특성을 분석하는 단계; 상기 슬러리 로딩 특성의 분석 결과에 응답하여 슬러리 온도를 포함하는 후보 제어 값을 도출하는 단계; 및예측 모델을 이용하여 상기 후보 제어 값에 대한 품질을 예측하고, 상기 품질에 기초하여 최적 제어 값을 도출하는 단계를 포함하는 예측 제어 장치의 동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 예측 모델은 상기 슬러리 온도와 상기 슬러리 로딩 특성의 상관관계를 학습하여 모델링 되는 예측 제어 장치의 동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "청구항 9에 있어서, 상기 데이터는 상기 기재의 슬러리 로딩량 데이터를 포함하고, 상기 슬러리 로딩량 데이터에 기초하여 슬러리 로딩량 균일성을 분석하는 단계를 더 포함하는 예측 제어 장치의동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서, 상기 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함하는 예측 제어 장치의동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 9에 있어서, 상기 최적 제어 값을 이용하여 상기 슬러리 온도를 조절하는 단계를 더 포함하는 예측 제어 장치의 동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 13에 있어서, 상기 슬러리 온도를 조절한 후의 상기 기재에 관한 제2 데이터를 획득하는 단계; 상기 제2 데이터에 기초하여 미스 매칭 발생 여부를 판단하는 단계; 상기 미스 매칭 발생에 응답하여 슬러리 펌프 알피엠(RPM) 또는 다이 간격을 포함하는 제2 후보 제어 값을 도출하는 단계; 제2 예측 모델을 이용하여 상기 제2 후보 제어 값에 대한 제2 품질을 예측하는 단계; 및 상기 제2 품질에 기초하여 제2 최적 제어 값을 도출하는 단계를 더 포함하는 예측 제어 장치의 동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 공개특허 10-2023-0152578-4-상기 제2 데이터는 상기 기재의 유지부 폭 및 상기 기재의 무지부 폭을 이미지로 변환한 이미지 데이터를 포함하고, 상기 이미지 데이터에 기초하여 상기 미스 매칭 발생 여부를 판단하는 단계를 더 포함하는 예측 제어 장치의 동작 방법."}
{"patent_id": "10-2023-0052200", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "청구항 14에 있어서, 상기 제2 최적 제어 값을 이용하여 상기 슬러리 펌프 알피엠 또는 상기 다이 간격을 조절하는 단계를 더 포함하는 예측 제어 장치의 동작 방법."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시되는 일 실시예에 따른 예측 제어 장치는 코팅 다이를 이용해 슬러리(slurry)가 로딩되는 기재 (base material)에 관련된 데이터를 획득하는 데이터 획득부, 및 상기 데이터에 기초하여 슬러리 로딩 특성을 분 석하고, 상기 슬러리 로딩 특성에 기초하여 슬러리 온도를 포함하는 후보 제어 값을 도출하고, 예측 모델을 이용 하여 상기 후보 제어 값에 대한 품질을 예측하고, 상기 품질에 기초하여 최적 제어 값을 도출하는 프로세서를 포 함할 수 있다."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 실시예들은 예측 제어 장치 및 그의 동작 방법에 관한 것이다."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 이차 전지에 대한 연구 개발이 활발히 이루어지고 있다. 여기서 이차 전지는 충방전이 가능한 전지로서, 종래의 Ni/Cd 배터리, Ni/MH 배터리 등과 최근의 리튬 이온 배터리를 모두 포함하는 의미이다. 이차 전지 중 리 튬 이온 배터리는 종래의 Ni/Cd 배터리, Ni/MH 배터리 등에 비하여 에너지 밀도가 훨씬 높다는 장점이 있다. 또 한, 리튬 이온 배터리는 소형, 경량으로 제작할 수 있어서 이동 기기의 전원으로 사용되며, 최근에는 전기 자동 차의 전원으로 사용 범위가 확장되어 차세대 에너지 저장 매체로 주목을 받고 있다. 이러한 리튬 이온 배터리에서 전극 조립체가 최대의 충전 용량을 갖기 위해서는 슬러리가 전극의 대항 면에 고 른 두께로 형성되어야 한다. 따라서, 고품질, 고효율의 제품을 구현하기 위해 균일한 코팅 두께를 조율하는 문 제가 최근 중요한 기술 문제로 대두하게 되었다."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "전극 코팅 공정에서의 보정 작업을 자동화함으로써 작업자(Operator)의 숙련도와 관계 없이 로딩량 균일성을 확 보할 필요가 있다. 전극 코팅 공정에 있어서, 로딩량 균일성을 확보하기 위하여 슬러리 온도 제어를 자동화할 필요가 있다. 슬러리 온도 제어는 로딩량 균일성 이외의 다른 품질 요소(예: 코팅 폭, 또는 미스매치 등)에 영향을 미칠 수 있으므로, 여러 품질 요소를 함께 고려하여 보정 작업을 자동화할 필요가 있다. 본 문서에 개시된 실시예들의 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않 은 또다른 기술적 과제들은 아래의 기재들로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시예에 따른 예측 제어 장치는 코팅 다이를 이용해 슬러리(slurry)가 로딩되는 기재 (base material)에 관련된 데이터를 획득하는 데이터 획득부, 및 상기 데이터에 기초하여 슬러리 로딩 특성을 분석하고, 상기 슬러리 로딩 특성의 분석 결과에 응답하여 슬러리 온도를 포함하는 후보 제어 값을 도출하고, 예측 모델을 이용하여 상기 후보 제어 값에 대한 품질을 예측하고, 상기 품질에 기초하여 최적 제어 값을 도출 하는 프로세서를 포함할 수 있다. 일 실시예에 따라, 상기 예측 모델은 상기 슬러리 온도와 상기 슬러리 로딩 특성의 상관관계를 학습하여 모델링 될 수 있다. 일 실시예에 따라, 상기 데이터는 상기 기재의 슬러리 로딩량 데이터를 포함하고, 상기 프로세서는 상기 슬러리 로딩량 데이터에 기초하여 슬러리 로딩량 균일성을 분석할 수 있다. 일 실시예에 따라, 상기 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함할 수 있다. 일 실시예에 따라, 상기 프로세서는 상기 최적 제어 값을 이용하여 상기 슬러리 온도를 조절할 수 있다. 일 실시예에 따라, 상기 데이터 획득부는, 상기 프로세서가 상기 슬러리 온도를 조절한 후의 상기 기재에 관한 제2 데이터를 획득하고, 상기 프로세서는 상기 제2 데이터에 기초하여 미스 매칭 발생 여부를 판단하고, 상기 미스 매칭 발생에 응답하여 슬러리 펌프 알피엠(RPM) 또는 다이 간격을 포함하는 제2 후보 제어 값을 도출하고, 제2 예측 모델을 이용하여 상기 제2 후보 제어 값에 대한 제2 품질을 예측하고, 상기 제2 품질에 기초하여 제2 최적 제어 값을 도출할 수 있다. 일 실시예에 따라, 상기 제2 데이터는 상기 기재의 유지부 폭 및 상기 기재의 무지부 폭을 이미지로 변환한 이 미지 데이터를 포함하고, 상기 프로세서는 상기 이미지 데이터에 기초하여 상기 미스 매칭 발생 여부를 판단할 수 있다. 일 실시예에 따라, 상기 프로세서는 상기 제2 최적 제어 값을 이용하여 상기 슬러리 펌프 알피엠 또는 상기 다 이 간격을 조절할 수 있다. 본 문서에 개시되는 일 실시예에 따른 예측 제어 장치의 동작 방법은 코팅 다이를 이용해 슬러리(slurry)가 로 딩되는 기재(base material)에 관련된 데이터를 획득하는 단계, 상기 데이터에 기초하여 슬러리 로딩 특성을 분 석하는 단계, 상기 슬러리 로딩 특성의 분석 결과에 응답하여 슬러리 온도를 포함하는 후보 제어 값을 도출하는 단계, 및 예측 모델을 이용하여 상기 후보 제어 값에 대한 품질을 예측하고, 상기 품질에 기초하여 최적 제어 값을 도출하는 단계를 포함할 수 있다. 일 실시예에 따라, 상기 예측 모델은 상기 슬러리 온도와 상기 슬러리 로딩 특성의 상관관계를 학습하여 모델링 될 수 있다. 일 실시예에 따라, 상기 데이터는 상기 기재의 슬러리 로딩량 데이터를 포함하고, 상기 슬러리 로딩량 데이터에 기초하여 슬러리 로딩량 균일성을 분석하는 단계를 더 포함할 수 있다. 일 실시예에 따라, 상기 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함할 수 있다. 일 실시예에 따라, 상기 최적 제어 값을 이용하여 상기 슬러리 온도를 조절하는 단계를 더 포함할 수 있다. 일 실시예에 따라, 상기 슬러리 온도를 조절한 후의 상기 기재에 관한 제2 데이터를 획득하는 단계, 상기 제2 데이터에 기초하여 미스 매칭 발생 여부를 판단하는 단계, 상기 미스 매칭 발생에 응답하여 슬러리 펌프 알피엠 (RPM) 또는 다이 간격을 포함하는 제2 후보 제어 값을 도출하는 단계, 제2 예측 모델을 이용하여 상기 제2 후보 제어 값에 대한 제2 품질을 예측하는 단계, 및 상기 제2 품질에 기초하여 제2 최적 제어 값을 도출하는 단계를 포함할 수 있다. 일 실시예에 따라, 상기 제2 데이터는 상기 기재의 유지부 폭 및 상기 기재의 무지부 폭을 이미지로 변환한 이 미지 데이터를 포함하고, 상기 이미지 데이터에 기초하여 상기 미스 매칭 발생 여부를 판단하는 단계를 더 포함 할 수 있다. 일 실시예에 따라, 상기 제2 최적 제어 값을 이용하여 상기 슬러리 펌프 알피엠 또는 상기 다이 간격을 조절하 는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서의 개시에 따른 예측 제어 장치는 코팅 공정에서의 실시간 보정 작업을 자동화하여 작업자(Operator)의 숙련도와 관계 없이 균일한 품질의 코팅을 실현할 수 있다. 본 문서의 개시에 따른 예측 제어 장치는 다이 간격 및/또는 슬러리 펌프 알피엠(RPM) 뿐만 아니라, 슬러리의 온도에 대한 보정 작업을 수행할 수 있다. 본 문서의 개시에 따른 예측 제어 장치의 효과들은 이상에서 언급한 효과들로 제한되지 않으며, 언급되지 않은 또다른 효과들은 본 문서의 개시에 따라 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0052200", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 다양한 실시 예가 첨부된 도면을 참조하여 기재된다. 그러나, 이는 본 발명을 특정한 실시 형 태에 대해 한정하려는 것이 아니며, 본 발명의 실시 예의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", \"첫째\", \"둘째\", \"A\", \"B\", \"(a)\" 또는 \"(b)\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 특별히 반대되는 기재가 없는 한, 해당 구성요소들을 다른 측면(예: 중요성 또는 순 서)에서 한정하지 않는다. 본 문서에서, 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용 어와 함께 또는 이런 용어 없이, \"연결\", \"결합\" 또는 \"접속\"된다고 언급되거나 \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어를 통해 또는 두 개의 사용자 장치들 간에 직접, 온라인으로 배포 (예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사 의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어 도 일시 저장되거나, 임시적으로 생성될 수 있다.다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 도 1a는 본 문서에 개시된 일 실시예에 따른 예측 제어 시스템을 보여주는 도면이다. 도 1b는 본 문서에 개시된 일 실시예에 따른 예측 모델을 예시하는 도면이다. 도 1a를 참조하면, 예측 제어 시스템은 예측 제어 장치, 예측 모델, 및 사용자 단말을 포함할 수 있다. 다만, 이는 본 발명의 목적을 달성하기 위한 실시예에 해당하고, 필요에 따라 일부 구성 요소가 추가 되거나 삭제될 수 있다. 또한, 도 1a에 도시된 예측 제어 시스템의 각 구성 요소들은 기능적으로 구분되는 기능 요소들을 나타낸 것으로서, 복수의 구성 요소가 실제 물리적 확경에서는 서로 통합되는 형태로 구형될 수 있다. 예측 제어 장치는 다수의 사용자에게 기계 학습 기반의 예측 제어를 제공하는 컴퓨팅 장치이다. 실시예에 따르면, 컴퓨팅 장치는 노트북, 데스크탑(desktop), 랩탑(laptop), 고성능의 서버 컴퓨팅 장치 등을 포함할 수 있다. 다만, 이에 국한되지 않으며, 컴퓨팅 장치는 컴퓨팅 기능 및 통신 기능이 구비된 모든 종류의 장치를 포 함할 수 있다. 예측 제어는, 예측 제어 장치가 기계 학습 모델에 기반하여 제공하는 전극 코팅 공정의 자동 보정을 위한 예측 제어 서비스를 의미할 수 있다. 실시예에 따르면, 예측 제어는 전극 코팅 과정의 슬러리 로딩 특성에 따른 및/또는 미스 매칭에 대한 자동 보정을 위한 예측 제어 서비스를 포함할 수 있다. 실시예에 따르면, 슬러리 로 딩 특성은 슬러리 로딩량 균일성을 포함할 수 있다. 슬러리(slurry)는 고체와 액체의 혼합물 또는 미세한 고체 분말 입자가 액체 용매 내에 현탁된 조성물을 의미할 수 있다. 예를 들어, 슬러리는 전극 형성용 조성물을 의미 할 수 있다. 미스 매칭은, 전극의 대향면에 분사된 슬러리의 폭 및/또는 로딩량이 균일하지 못하는 것을 의미할 수 있다. 예측 제어 장치는 사용자 단말로부터 데이터를 입력 받을 수 있다. 데이터는 기재(base material)에 도포된 슬러리의 로딩량에 관한 슬러리 로딩량 데이터를 포함할 수 있다. 데이터는 전처리된 슬러리 로딩량 데 이터를 포함할 수 있다. 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함할 수 있다. 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터는 도 3에서 구체적으로 설명한다. 예측 제어 장치는 사용자 단말로부터 입력 받은 데이터에 기초하여 슬러리 로딩 특성을 분석할 수 있 다. 실시예에 따르면, 슬러리 로딩 특성은 슬러리 로딩량 균일성을 포함할 수 있다. 예측 제어 장치는 슬러리 로딩 특성의 분석 결과에 응답하여, 슬러리 온도를 보정하기 위한 복수의 후보 제어 값 중에서 최적 제어 값을 도출할 수 있다. 이 경우, 후보 제어 값은 슬러리 온도를 포함할 수 있다. 예측 제어 장치는 예측 모델을 이용하여 복수의 후보 제어 값에 대한 품질을 예측할 수 있다. 실시예에 따 르면, 예측 모델은 슬러리 온도와 슬러리 로딩 특성의 상관관계를 학습하여 모델링 될 수 있다. 예측 제어 장치는 예측 모델을 이용하여 복수의 후보 제어 값에 대한 품질을 예측하고, 예측된 품질에 기초하여 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 예측 제어 장치는 도출된 최적 제어 값을 이용하여 슬러리 온도를 조절할 수 있다. 본 문서에 개시된 일 실시예에 따라, 예측 제어 장치가 슬러리 온도를 조절한 경우, 예측 제어 장치 는 사용자 단말로부터 제2 데이터를 입력받을 수 있다. 이 경우, 제2 데이터는 슬러리 온도가 조절된 후의 기재에 관한 데이터를 의미할 수 있다. 실시예에 따르면, 제2 데이터는 기재의 유지부 폭 및/또는 무지부 폭에 대한 데이터를 포함할 수 있다. 실시예에 따르면, 기재의 유지부 폭 및/또는 무지부 폭에 대한 데이터는 이미지 로 변환된 이미지 데이터에 해당할 수 있다. 실시예에 따르면, 예측 제어 장치는 제2 데이터에 기초하여 미스 매칭 발생 여부를 판단할 수 있다. 미스 매칭이 발생한 경우, 예측 제어 장치는 미스 매칭을 보정하기 위한 복수의 제2 후보 제어 값 중에서 제2최적 제어 값을 도출할 수 있다. 이 경우, 제2 후보 제어 값은 슬러리 펌프 알피엠(RPM) 또는 다이 간격을 포함 할 수 있다. 예측 제어 장치는 제2 예측 모델을 이용하여 복수의 제2 후보 제어 값에 대한 제2 품질을 예 측할 수 있다. 이 경우 실시예에 따르면, 예측 모델은 제2 예측 모델을 포함할 수 있다. 예측 제어 장치 는 제2 예측 모델을 이용하여 복수의 제2 후보 제어 값에 대한 제2 품질을 예측하고, 예측된 제2 품질에 기초하여 제2 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 예측 제어 장치는 도출된 제2 최적 제어 값을 이용하여 슬러리 펌프 알피엠 또는 다이 간격을 조절할 수 있다. 예측 모델은 입력된 데이터에 대하여 예측 제어 값을 연산하고, 최적 제어 값을 제공하는 기계 학습 모델 을 의미할 수 있다. 실시예에 따르면, 예측 모델은 제2 예측 모델을 포함할 수 있다. 실시예에 따르면, 예 측 모델은 전통적인 기계 학습 기법 또는 딥러닝 기법을 통해 구축될 수 있다. 예를 들어, 예측 모델(20 0)은 기존 학습된 지식을 전달하기 위한 학습 방법(예: 전이 학습)에 기반한 인공지능 모델일 수 있다. 예를 들 어, 예측 모델은 태스크들(tasks) 간의 학습 내용을 전이하기 위한 인공지능 모델(예: PNN(progressive neural network))을 포함할 수 있다. 여기에서, 태스크는 인공지능 모델에 포함된 시퀀스들 각각의 작업 또는 목표를 의미할 수 있다. 예를 들어, 예측 모델의 태스크는 입력 데이터에 대한 예측 제어 값(또는, 최적 제어 값)의 연산 및 연산 결과 출력일 수 있다. 이하에서는, 도 1b를 참조하여 예측 모델이 PNN으로 구성 된 경우의 예측 모델의 동작에 대해 설명한다. 다만, 예측 모델은 제시된 예들에 한정되지 않는다. 예를 들어, 예측 모델은 미세 조정(fine tuning)에 기반한 인공지능 모델을 포함할 수 있다. 일 실시 예에서, 예측 모델은 복수의 네트워크들(211, 212, 213)을 포함할 수 있다. 일 실시 예에서, 예측 모델은 네트워크들(211, 212, 213) 각각이 서로 연결된 구조를 가질 수 있다. 여기에서, 네트워크들(211, 212, 213) 각각은 지정된 태스크에 따른 결과물을 생성하기 위한 인공지능 네트워크들일 수 있다. 일 실시 예에서, 예측 모델은 새로운 네트워크가 추가될 수 있다. 예를 들어, 예측 모델에 네트워크 만이 존재하는 상황에서, 네트워크가 새롭게 추가될 수 있다. 또한, 예를 들어, 예측 모델에 네 트워크들(211, 212)이 존재하는 상황에서, 네트워크가 새롭게 추가될 수 있다. 일 실시 예에서, 예측 모델에 새로운 네트워크가 추가되는 경우, 기존의 네트워크의 학습은 중단될 수 있 다. 여기에서, 학습의 중단은 기존의 네트워크에 포함된 레이어들, 및 출력의 가중치들이 변경되지 않는 것을 의미할 수 있다. 일 실시 예에서, 예측 모델에 새로운 네트워크가 추가되는 경우, 새로운 네트워크가 학습될 수 있다. 여기 에서, 학습은 역전파 알고리즘에 기반할 수 있다. 일 실시 예에서, 예측 모델에 포함된 네트워크들(211, 212, 213)은 기존 네트워크의 중간 연산 결과가 새 로운 네트워크에 입력되는 방식으로 서로 연결될 수 있다. 예를 들어, 예측 모델에 첫 번째 네트워크 , 두 번째 네트워크, 및 세 번째 네트워크의 순서로 추가된 경우, 첫 번째 네트워크의 중 간 연산 결과는 두 번째 네트워크, 및 세 번째 네트워크에 입력될 수 있다. 또한, 두 번째 네트워크 의 중간 연산 결과는 세 번째 네트워크에 입력될 수 있다. 일 실시 예에서, 예측 모델에 포함된 네트워크들(211, 212, 213) 중 일부 네트워크들을 병합할 수 있다. 예를 들어, 첫 번째 네트워크 및 두 번째 네트워크가 하나의 네트워크로 병합될 수 있다. 일 실시 예 에서, 첫 번째 네트워크 및 두 번째 네트워크 간의 병합에 의해, 첫 번째 네트워크의 첫 번째 레이어의 출력, 및 두 번째 네트워크의 첫 번째 레이어의 출력의 합산 값은 병합 후 네트워크의 첫 번째 레이어의 출력과 동일할 수 있다. 또한, 첫 번째 네트워크 및 두 번째 네트워크 간의 병합에 의해, 첫 번째 네트워크의 두 번째 레이어의 출력, 및 두 번째 네트워크의 두 번째 레이어(22 2)의 출력의 합산 값은 병합 후 네트워크의 두 번째 레이어의 출력과 동일할 수 있다. 마찬가지로, 첫 번째 네 트워크 및 두 번째 네트워크 간의 병합에 의해, 첫 번째 네트워크의 n 번째 레이어의 출력, 및 두 번째 네트워크의 n 번째 레이어의 출력의 합산 값은 병합 후 네트워크의 n 번째 레이어의 출력과 동일 할 수 있다. 일 실시 예에서, 병합은 예측 모델에 포함된 네트워크들(211, 212, 213) 중 일부 네트워크들의 개수가 기 준치를 초과하는 경우 발생할 수 있다. 일 실시 예에서, 네트워크들(211, 212, 213)의 입력은 제2 후보 제어 값(예: 다이 간격 및 슬러리 펌프 알 피엠)일 수 있다. 일 실시 예에서, 네트워크들(211, 212, 213)의 출력들(241, 242, 243)은 로딩 패턴(예: 슬러리 로딩량 균일성 및/또는 미스 매칭) 또는 코팅 폭을 포함할 수 있다. 일 실시 예에서, 첫 번째 네트워크는 입력(즉, 제2 후보 제어 값)과 출력(즉, 로딩 패턴 또는 코팅 폭) 간의 양의 상관 관계를 가지도록 학습될 수 있다. 예를 들어, 첫 번째 네트워크는 좌측 간격, 및 /또는 우측 간격이 스텝 사이즈(예: ±1[㎛])에 따라 증가 또는 감소함에 따라 출력 파라미터(예: 코팅 폭)의 값이 증가 또는 감소하도록 학습될 수 있다. 일 실시 예에서, 첫 번째 네트워크의 학습 데이터는 임의 생 성된 데이터일 수 있다. 일 실시 예에서, 두 번째 네트워크는 실제 획득된 데이터(즉, 제2 후보 제어 값과 로딩 패턴 또는 코팅 폭 간의 상관 관계를 나타내는 데이터)에 기반하여 학습될 수 있다. 일 실시 예에서, 두 번째 네트워크는 입 력(즉, 제2 후보 제어 값)과 첫 번째 네트워크의 레이어들(221, 231)의 출력에 기초하여 출력을 생성할 수 있다. 일 실시 예에서, 두 번째 네트워크는 두 번째 네트워크의 출력이 입력과 관련된 실제 데이터(즉, 로딩 패턴 또는 코팅 폭)와의 차이가 최소가 되도록 학습될 수 있다. 여기에서, 두 번 째 네트워크의 학습은 역전파 알고리즘에 기반할 수 있다. 일 실시 예에서, 두 번째 네트워크의 학습 시 첫 번째 네트워크는 학습되지 않을 수 있다. 일 실시 예에서, 두 번째 네트워크의 학습 시 첫 번 째 네트워크의 파라미터들은 고정될 수 있다. 일 실시 예에서, 세 번째 네트워크는 두 번째 네트워크의 학습 데이터 이후에 획득되는 데이터(즉, 제2 후보 제어 값과 로딩 패턴 또는 코팅 폭 간의 상관 관계를 나타내는 데이터)에 기반하여 학습될 수 있다. 일 실시 예에서, 세 번째 네트워크는 입력(즉, 제2 후보 제어 값)과 첫 번째 네트워크의 레이어 들(221, 231)의 출력 및 두 번째 네트워크의 레이어들(222, 232)의 출력에 기초하여 출력을 생성할 수 있다. 일 실시 예에서, 세 번째 네트워크는 세 번째 네트워크의 출력이 입력과 관련된 실제 데이터(즉, 로딩 패턴 또는 코팅 폭)와의 차이가 최소가 되도록 학습될 수 있다. 여기에서, 세 번째 네트 워크의 학습은 역전파 알고리즘에 기반할 수 있다. 일 실시 예에서, 세 번째 네트워크의 학습 시 첫 번째 네트워크 및 두 번째 네트워크는 학습되지 않을 수 있다. 일 실시 예에서, 세 번째 네트워크 의 학습 시 첫 번째 네트워크 및 두 번째 네트워크의 파라미터들은 고정될 수 있다. 일 실시 예에서, 세 번째 네트워크의 학습 이후 새로운 네트워크가 추가되는 경우, 새로운 네트워크의 학 습 데이터는 세 번째 네트워크의 학습 데이터 이후에 획득되는 데이터일 수 있다. 또한, 새로운 네트워크 의 학습 시, 이전에 추가된 네트워크들(211, 212, 213)의 파라미터들은 고정될 수 있다. 마지막으로, 세 번째 네트워크의 학습 이후 새로운 네트워크가 추가되는 경우, 이전에 추가된 네트워크들(211, 212, 213) 중 먼 저 추가된 순서대로 일부 네트워크들이 병합될 수 있다. 일 실시 예에서, 예측 모델이 제공하는 최적 제어 값은 네트워크들(211, 212, 213)의 출력들(241, 242, 243) 중 가장 나중에 추가된 네트워크(즉, 세 번째 네트워크)의 출력일 수 있다. 실시예에 따르면, 예측 제어 장치는 피드백 학습 모델을 이용하여 예측 모델을 업데이트 할 수 있다. 본 문서에 개시된 일 실시예에 따라, 예측 모델은 제2 예측 모델을 포함할 수 있다. 피드백 학습 모델은 예측 결과의 만족도에 대한 사용자 피드백(feedback)을 학습한 기계 학습 모델을 의미할 수 있다. 본 실시예에 따르면, 사용자의 만족도에 기반하여 예측 모델이 업데이트되는 바, 예측 제어에 대한 사용자 만족도가 향 상될 수 있다. 실시예에 따르면, 예측 모델은 예측 제어 장치와 물리적으로 독립된 컴퓨팅 장치에 구축되거나 예측 제어 장치에 구축될 수 있다. 이하에서는, 예측 모델이 예측 제어 장치에 구축된 것을 가정하여 설명한다. 사용자 단말은 예측 제어를 제공할 데이터를 송신하는 사용자의 단말을 의미할 수 있다. 실시예에 따르면, 사용자 단말은 비전 시스템(Vision System)에 해당할 수 있다. 여기서, 비전 시스템은 코팅 다이를 통해 슬러리가 도포된 기재에 관련된 데이터를 생성하는 시스템을 의미할 수 있다. 여기서 기재는 전극을 포함한 충 방전이 가능한 전지를 의미할 수 있다. 예를 들어, 기재는 이차 전지를 포함할 수 있다. 실시예에 따르면, 사용자 단말은 슬러리의 로딩 프로파일 데이터를 생성할 수 있다. 로딩 프로파일 데이터 는 슬러리 로딩량 데이터를 포함할 수 있다. 실시예에 따르면, 슬러리 로딩량 데이터는 전처리될 수 있다. 실시 예에 따르면, 사용자 단말은 기재의 유지부 폭 및/또는 무지부 폭을 이미지로 변환한 이미지 데이터를 생 성할 수 있다. 예측 제어 장치는 사용자 단말을 통해 데이터를 획득할 수 있다. 예측 제어 장치(10 0)는 사용자 단말을 통해 획득한 데이터에 기반한 예측 결과를 제공할 수 있다. 이 경우, 예측 제어 장치는 사용자 피드백을 유도하기 위한 사용자 인터페이스를 제공할 수 있고, 사용자는 사용자 인터페이스를 통해 예측 결과의 만족도에 대한 사용자 피드백 정보를 제공할 수 있다. 예측 제어 장치는 사용자 피드백 정보를 이용하여 피드백 학습 모델을 점진적으로 학습시킬 수 있다. 예측 제어 시스템의 구성 요소들은 네트워크를 통해 통신할 수 있다. 실시예에 따르면, 네트워크는 근거리 통신 말(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN), 이동 통신망(mobile radio communication network), Wibro(Wireless Broadband Internet) 등과 같은 모든 종류의 유선 네트워크 또는 무 선 네트워크로 구현될 수 있다. 이하에서는, 예측 제어 장치의 구성 및 동작에 대하여 도 2 내지 도 11을 참조하여 설명한다. 도 2는 본 문서에 개시된 일 실시예에 따른 예측 제어 장치를 보여주는 블록도이다. 도 2를 참조하면, 예측 제어 장치는 데이터 획득부 및 프로세서를 포함할 수 있다. 도 2의 예측 제어 장치는 실질적으로 도 1의 예측 제어 장치와 동일한 구성일 수 있다. 데이터 획득부는 사용자 단말로부터 예측 제어의 대상에 관한 데이터를 획득할 수 있다. 실시예에 따르면, 예측 제어의 대상은 코팅 다이를 이용해 슬러리(slurry)가 로딩되는 기재(base material)를 포함할 수 있다. 데이터 획득부는 사용자 단말로부터 코팅 다이를 이용해 슬러리가 로딩되는 기재에 관한 데이터를 획득할 수 있다. 실시예에 따르면, 데이터는 기재의 슬러리 로딩량 데이터를 포함할 수 있다. 실 시예에 따르면, 슬러리 로딩량 데이터는 사용자 단말에서 전처리된 데이터에 해당할 수 있다. 실시예에 따 르면, 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및/또는 좌우 유지부 로딩량 데이터를 포함할 수 있다. 실시예에 따르면, 예측 제어의 대상은 프로세서가 슬러리 온도를 조절한 후의 기재를 포함할 수 있다. 데 이터 획득부는 사용자 단말로부터, 후술할 바에 따라 프로세서가 슬러리 온도를 조절한 후의 기 재에 관한 제2 데이터를 획득할 수 있다. 실시예에 따르면, 제2 데이터는 기재의 유지부 폭 및/또는 무지부 폭 을 이미지로 변환한 이미지 데이터를 포함할 수 있다. 본 문서에 개시된 실시예에 따르면 예측 제어의 타겟 대 상은 코팅 다이를 이용해 슬러리가 로딩되는 기재를 가정하여 본 명세서를 작성하나, 이에 한정되는 것은 아니 다. 프로세서는 데이터 획득부에서 획득한 데이터에 기초하여 슬러리 로딩 특성을 분석할 수 있다. 실시 예에 따르면, 슬러리 로딩 특성은 슬러리 로딩량 균일성을 포함할 수 있다. 예를 들면, 데이터 획득부가 슬러리 로딩량 데이터를 획득한 때, 프로세서는 슬러리 로딩량 데이터에 기초하여 슬러리 로딩량 균일성을 분석할 수 있다. 프로세서는 슬러리 로딩 특성의 분석 결과에 응답하여 후보 제어 값을 도출할 수 있다. 실시예에 따르면, 후보 제어 값은 슬러리 온도를 포함할 수 있다. 예를 들면, 프로세서는 슬러리 로딩 특성에 기초하여 슬러 리 온도를 포함하는 후보 제어 값을 도출할 수 있다. 이에 대해 도 5를 참조하여 구체적으로 설명한다. 프로세서는 예측 모델을 이용하여 후보 제어 값에 대한 품질을 예측할 수 있다. 실시예에 따르면, 예측 모 델은 슬러리 온도와 슬러리 로딩 특성의 상관관계를 학습하여 모델링 될 수 있다. 프로세서는 예측된 품질 에 기초하여 최적 제어 값을 도출할 수 있다. 프로세서가 최적 제어 값을 도출하는 내용에 대해 도 6을 참 조하여 구체적으로 설명한다. 본 문서에 개시된 실시예에 따라 데이터 획득부가 제2 데이터를 획득한 경우, 프로세서는 제2 데이터에 기 초하여 미스 매칭 발생 여부를 판단할 수 있다. 실시예에 따라, 프로세서는 기재의 서로 다른 두 대향면의 탑(Top) 및/또는 백(Back)의 폭 너비를 이용하여 미스 매칭 발생 여부를 연산할 수 있다. 전극 코팅된 기재의 상부면 또는 하부면 중에서, 탑(Top)은 코팅 길이가 상대적으로 긴 면을 의미하고, 백(Back)은 코팅 길이가 상 대적으로 짧은 면을 의미할 수 있다. 예를 들어, 프로세서는 기재의 탑(Top) 및/또는 백(Back)의 유지부 폭 및/또는 무지부 폭 너비를 이용하여 미스 매칭 값을 연산할 수 있다. 유지부는 기재에 슬러리가 로딩되어 코 팅된 영역을 의미하고, 무지부는 기재에 슬러리가 로딩되지 않는 영역을 의미할 수 있다. 실시예에 따르면, 프로세서는 미스 매칭 발생에 응답하여 제2 후보 제어 값을 도출할 수 있다. 실시예에 따르면, 제2 후보 제어 값은 슬러리 펌프 알피엠(RPM) 또는 다이 간격을 포함할 수 있다. 예를 들면, 프로세서 는 미스 매칭 발생에 응답하여 슬러리 펌프 알피엠 또는 다이 간격을 포함하는 제2 후보 제어 값을 도출할 수 있다. 이에 대해 도 8을 참조하여 구체적으로 설명한다. 본 문서에 개시된 실시예에 따라 프로세서가 제2 후보 제어 값을 도출한 경우, 제2 예측 모델을 이용하여 제2 후보 제어 값에 대한 제2 품질을 예측할 수 있다. 프로세서는 예측된 제2 품질에 기초하여 제2 최적 제어 값을 도출할 수 있다. 프로세서가 제2 최적 제어 값을 도출하는 내용에 대해 도 9를 참조하여 구체적 으로 설명한다. 도 3은 본 문서에 개시된 다양한 실시예에 참조되는 슬러리 로딩 특성을 설명하기 위한 도면이다. 도 3을 참조하면, 기재(base material)는 유지부(A1, A2 및 A3) 및 무지부(B1 및 B2)를 포함할 수 있다. 이하에 서는 예측 제어 장치가 분석하는 슬러리 로딩 특성에 대하여 도 1 및 도 2를 참조하여 구체적으로 설명한 다. 프로세서는 데이터에 기초하여 슬러리 로딩 특성을 분석할 수 있다. 실시예에 따르면, 프로세서는 유 지부(A1, A2 및 A3)의 슬러리 로딩량 데이터에 기초하여 슬러리 로딩 특성을 분석할 수 있다. 실시예에 따르면, 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함할 수 있다. 본 실시예에 따 르면, 프로세서는 유지부의 전체 및/또는 일부를 기 설정된 기준에 따라 중앙 유지부 및 좌우 유지부로 분 류될 수 있다. 이 경우, 중앙 로딩량 데이터는 중앙 유지부의 슬러리 로딩량 데이터의 평균을 의미하고, 좌우 유지부 로딩량 데이터는 좌우 유지부의 슬러리 로딩량 데이터의 평균을 의미할 수 있다. 예를 들면, 프로세서 는 A2를 중앙 유지부로 분류하고, A1 및 A3를 좌우 유지부로 분류할 수 있다. 다른 예를 들면, 프로세서 는 l3 및 l4를 중앙 유지부로 분류하고, l1 및 l6을 좌우 유지부로 분류할 수 있다. 프로세서는 기재 의 종류 및 특성, 예측 제어 장치의 최적화 목적, 예측 제어 장치를 구현하는 설비의 종류 등에 따라 중앙 유지 부 및/또는 좌우 유지부를 분류하는 기준을 다르게 결정할 수 있다. 실시예에 따르면, 프로세서는 슬러리 로딩량 데이터에 기초하여 슬러리 로딩 특성을 분석할 수 있다. 실시 예에 따르면, 슬러리 로딩 특성은 슬러리 로딩량 균일성을 포함할 수 있다. 예를 들면, 프로세서는 유지부 (A1, A2 및 A3)의 슬러리 로딩량 데이터에 기초하여, 슬러리 로딩량 균일성을 분석할 수 있다. 프로세서는 슬러리 로딩량 균일성을 분석하기 위하여, 슬러리 로딩량 데이터를 이용하여 로딩 편차를 연산할 수 있다. 실시 예에 따르면, 프로세서는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 이용하여 로딩 편차를 연산 할 수 있다. 예를 들어, 프로세서는 하기 수학식 1에 따라 로딩 편차를 연산할 수 있다. [수학식 1] 로딩 편차 = 중앙 로딩량 데이터 - 좌우 유지부 로딩량 데이터 본 문서에 개시된 실시예에 따라 프로세서가 A2를 중앙 유지부로 분류하고, A1 및 A3를 좌우 유지부로 분류 하는 경우, 프로세서는 하기 수학식 2에 따라 로딩 편차를 연산할 수 있다. [수학식 2] 로딩 편차 = (A2의 슬러리 로딩량 평균) - (A1 및 A3의 슬러리 로딩량 평균) 본 문서에 개시된 다른 실시예에 따라 프로세서가 l3 및 l4를 중앙 유지부로 분류하고, l1 및 l6을 좌우 유 지부로 분류하는 경우, 프로세서는 하기 수학식 3에 따라 로딩 편차를 연산할 수 있다. [수학식 3] 로딩 편차 = (l3 및 l4의 슬러리 로딩량 평균) - (l1 및 l6의 슬러리 로딩량 평균) 실시예에 따르면, 프로세서는 로딩 편차가 0에 가까울수록 슬러리 로딩량이 균일하다고 분석할 수 있다. 프로세서는 슬러리 로딩 특성을 분석하고, 슬러리 로딩 특성의 분석 결과에 응답하여 예측 제어 장치(10 0)의 제어 목표를 설정할 수 있다. 실시예에 따르면, 프로세서는 슬러리 로딩량 균일성을 분석하고, 분석 결과에 응답하여 예측 제어 장치의 제어 목표를 로딩 패턴에 관한 보정으로 설정할 수 있다. 프로세서 가 제어 목표에 따라 제어 인자를 제어하는 내용에 대해서는 도 4에서 구체적으로 설명한다. 도 4는 본 문서에 개시된 다양한 실시예에 참조되는 제어 인자 및 주요 품질 요소를 보여주는 도면이다. 도 4를 참조하면, 프로세서는 제어 인자(X)를 제어하여 주요 품질 요소(Y)를 조절할 수 있다. 제어 인자(X)는 슬러리 온도, 슬러리 펌프 알피엠(RPM), 또는 다이 간격을 포함할 수 있다. 실시예에 따르면, 슬러리 펌프 알피엠은 코팅 다이의 슬러리 분사 속도에 영향을 줄 수 있다. 실시예에 따르면, 다이 간격은 코팅 다이의 좌측 간격 및/또는 우측 간격을 포함할 수 있다. 이 경우, 좌측 간격은 배터리 코팅에 사용되는 코팅 다 이가 모터와 연결된 영역의 좌측 간격을 의미하고, 우측 간격은 배터리 코팅에 사용되는 코팅 다이가 모터와 연 결된 영역의 우측 간격을 의미할 수 있다. 주요 품질 요소(Y)는 로딩 패턴 또는 코팅 폭을 포함할 수 있다. 실 시예에 따르면, 로딩 패턴은 슬러리 로딩량 균일성 및/또는 미스 매칭을 포함할 수 있다. 프로세서는 주요 품질 요소(Y)를 보정하기 위하여 제어 인자(X)를 제어할 수 있다. 실시예에 따라, 제어 인자(X)는 상호간 종속변수로 작용할 수 있다. 프로세서는 제어 목표에 따라 제어 인자(X) 중 일부를 주 제어 인자로, 나머지 일부를 부 제어 인자로 결정할 수 있다. 예를 들면, 제어 목표가 로딩 패턴에 관한 보정인 경우, 프로세서는 슬러리 온도 및/또는 다이 간격을 주 제어 인자로, 슬러리 펌프 알피엠을 부 제어 인자 로 결정할 수 있다. 다른 예를 들면, 제어 목표가 코팅 폭에 관한 보정인 경우, 프로세서는 다이 간격을 주 제어 인자로, 슬러리 온도 및/또는 슬러리 펌프 알피엠을 부 제어 인자로 결정할 수 있다. 본 문서에 개시된 실시예에 따라, 프로세서가 슬러리 로딩량 균일성을 보정하기 위하여 슬러리 온도를 높 이는 경우, 슬러리는 오목 패턴(U자 패턴)으로 기재에 로딩될 수 있다. 다른 실시예에 따라, 프로세서가 슬러리 로딩량 균일성을 보정하기 위하여 슬러리 온도를 낮추는 경우, 슬러리는 볼록 배턴(A자 패턴)으로 기재 에 로딩될 수 있다. 도 5는 본 문서에 개시된 일 실시예에 따른 예측 제어 장치가 도출한 후보 제어 값을 보여주는 도면이다. 도 5를 참조하면, 예측 제어 장치의 프로세서는 슬러리 온도를 포함하는 후보 제어 값을 도출할 수 있다. 프로세서는 슬러리 온도, 다이 간격 및 슬러리 펌프 알피엠(Pump RPM)을 제어 인자로 하는 후보 제 어 값을 도출할 수 있다. 본 문서에 개시된 실시예에 따라 다이 간격은 좌측 간격(L Gap) 및 우측 간격(R Gap) 을 포함할 수 있다. 프로세서는 제어 인자 각각의 현재값 및 조정 범위를 이용하여 후보 제어 값을 도출할 수 있다. 도 5에 도시된 바와 같이, 프로세서는 좌측 간격, 우측 간격 및 슬러리 펌프 알피엠을 고정하고, 슬러리 온도에 조정 범위를 부여 하여 후보 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 조정 범위 내에서 기 설정된 간격으로 슬러리 온도를 조정할 수 있다. 도 5에 도시된 실시예에 따르면, 프로세서는 슬러리 온도의 조정 범위를 ±2[℃]로 하고, 슬러리 온도의 현재값을 기준으로 슬러리 온도가 ±0.4[℃] 간격으 로 조정된 후보 제어 값을 도출할 수 있다. 다만, 도 5는 프로세서가 도출한 후보 제어 값의 일 실시예에 해당하고, 프로세서가 도출하는 후보 제어 값이 도 5의 도시된 값에 한정되는 것은 아니다. 실시예에 따르면, 프로세서는 슬러리 온도의 조정 범위 및/또는 슬러리 온도의 조정 간격을 다르게 설정할 수 있다. 프로세서는 후보 제어 값에 대하여 예측 모델을 이용하여 품질을 예측하고, 품질에 기초하여 최적 제어 값 을 예측할 수 있다. 실시예에 따르면, 프로세서는 후보 제어 값에 대하여 필터링을 실시할 수 있다. 본 실시예에 따르면, 프로 세서는 필터링을 통해 후보 제어 값의 수를 최소화할 수 있다. 이 경우, 프로세서는 필터링을 통해 최소화된 후보 제어 값에 대하여 예측 모델을 이용하여 품질을 예측하고, 품질에 기초하여 최적 제어 값을 예측 할 수 있다. 도 6은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치가 후보 제어 값 중에서 최적 제어 값을 도출하는 동 작을 설명하기 위한 도면이다. 도 6을 참조하면, 프로세서는 예측 모델을 이용하여 후보 제어 값에 대한 품질을 예측하고, 품질에 기초하 여 최적 제어 값을 도출할 수 있다. 프로세서는 예측 모델을 이용하여 후보 제어 값에 대한 품질을 예측할 수 있다. 품질은 중앙 로딩량 데이 터, 좌우 유지부 로딩량 데이터 및/또는 로딩 편차를 포함할 수 있으나, 이에 한정되는 것은 아니다. 실시예에 따르면, 프로세서는 예측 모델을 이용하여 후보 제어 값에 대한 중앙 로딩량 데이터, 좌우 유지 부 로딩량 데이터 및/또는 로딩 편차의 예측 값을 연산할 수 있다. 실시예에 따르면, 프로세서가 슬러리온도를 0.4[℃]만큼 조절하는 경우, 중앙 로딩양 데이터 및/또는 좌우 유지부 로딩량 데이터의 예측값은 최대 6[mg] 변화할 수 있다. 실시예에 따르면, 프로세서는 예측 모델을 이용하여 연산된 중앙 로딩량 데이터, 좌우 유지부 로딩량 데이 터 및/또는 로딩 편차의 예측 값에 기초하여 품질을 예측할 수 있다. 프로세서는 품질에 기초하여 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 예측된 중앙 로딩량 데이터, 예측된 좌우 유지부 로딩량 데이터 또는 예측된 로딩 편차가 목표 값에 가장 가까운 후보 제어 값을 최적 제어 값으로 도출할 수 있다. 예를 들면, 프로세서는 예측된 로딩 편차가 목표 값인 0에 가장 가까운 후보 제어 값을 최적 제어 값으로 도출할 수 있다. 도 6에 도시된 실시예에 따르면, 프로세서(12 0)는 로딩 편차 예측 값이 0인 후보 제어 값을 최적 제어 값으로 도출할 수 있다. 실시예에 따르면, 프로세서는 도출된 최적 제어 값을 이용하여 슬러리 온도를 조절할 수 있다. 도 6에 도 시된 실시예에 따르면, 프로세서는 로딩 편차 예측 값이 0인 최적 제어 값을 이용하여, 슬러리 온도를 29 [℃]로 조절할 수 있다. 도 7은 본 문서에 개시된 일 실시예에 따라 미스 매칭 발생 여부의 판단 방법을 설명하기 위한 도면이다. 도 7을 참조하면, 데이터 획득부는 제2 데이터를 획득할 수 있다. 제2 데이터는 기재의 유지부 폭 및 기재 의 무지부 폭을 이미지로 변환한 이미지 데이터를 포함할 수 있다. 실시예에 따르면, 제2 데이터는 프로세서 가 최적 제어 값을 이용하여 슬러리 온도를 조절한 후의 기재에 관한 데이터에 해당할 수 있다. 프로세서는 사용자 단말로부터 획득한 제2 데이터에 기초하여 미스 매칭 발생 여부를 판단할 수 있다. 실시예에 따르면, 제2 데이터는 프로세서는 기재의 유지부 폭 및 무지부 폭을 이미지로 변환한 이미 지 데이터에 기반하여 미스 매칭 발생 여부를 판단할 수 있다. 예를 들면, 프로세서는 기재의 탑(Top)과 기재의 백(Back)간의 폭 차이(M1, M2, M3, M4)로 인해 미스 매칭이 발생한 것을 알 수 있다. 프로세서는 기재의 탑(Top)의 무지부 폭(W1, W3, W5) 및 유지부 폭(W2, W4)과 기재의 백(Back)의 무지부 폭 (X1, X3, X5) 및 유지부 폭(X2, X4)을 이용하여 폭 차이(M1, M2, M3, M4)를 연산하여 미스 매칭 발생 여부를 판단 할 수 있다. 미스 매칭은, 전극의 대향면에 분사된 슬러리의 폭 및/또는 로딩량이 균일하지 못하는 것을 의미할 수 있다. 예를 들어, 프로세서는 하기 [표 1]에 따라 미스 매칭 발생 여부를 판단할 수 있다. 표 1 M1= W1-X1-e M2= W2-X2+M1 M3= W3-X3+M2 M4= W4-X4+M3 표 1에서 e는 기재의 탑(Top) 전체 너비(예를 들어, W1+W2+W3+W4+W5)와 기재의 백(Back) 전체 너비(예를 들어, X1+X2+X3+X4+X5)를 더하고 2로 나눈 값을 의미할 수 있다. 프로세서는 기재의 종류 및 특성에 따라 e의 반영 여부를 결정할 수 있다. 실시예에 따르면, 프로세서는 연산된 폭 차이(M1, M2, M3, M4) 값의 차이가 기준 값 이상인 경우, 미스 매칭이 발생한 것으로 판단할 수 있다. 도 8은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치가 도출한 제2 후보 제어 값을 보여주는 도면이다. 도 8을 참조하면, 예측 제어 장치의 프로세서는 슬러리 펌프 알피엠(RPM) 또는 다이 간격을 포함하는 제2 후보 제어 값을 도출할 수 있다. 프로세서는 슬러리 온도, 다이 간격 및 슬러리 펌프 알피엠(Pump RPM)을 제어 인자로 하는 제2 후보 제어 값을 도출할 수 있다. 본 문서에 개시된 실시예에 따라 다이 간격은 좌 측 간격(L Gap) 및 우측 간격(R Gap)을 포함할 수 있다. 프로세서는 제어 인자 각각의 현재값 및 조정 범 위를 이용하여 제2 후보 제어 값을 도출할 수 있다. 도 8에 도시된 바와 같이, 프로세서는 슬러리 온도를 고정하고, 좌측 간격, 우측 간격 및 슬러리 펌프 알 피엠에 조정 범위를 부여하여 제2 후보 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 조정 범 위 내에서 좌측 간격, 우측 간격 및/또는 슬러리 펌프 알피엠을 조정할 수 있다. 도 8에 도시된 실시예에 따르 면, 프로세서는 좌측 간격 및/또는 우측 간격을 ±1[㎛] 조정하거나, 및/또는 슬러리 펌프 알피엠을 ±1만 큼 조정할 수 있다. 이 경우, 프로세서는 27개의 제2 후보 제어 값을 도출할 수 있다. 다만, 도 8은 프로세서가 도출한 제2 푸보 제어 값의 일 실시예에 해당하고, 프로세서 도출하는 후보 제어 값이 도 8에 도시된 값에 한정되는 것은 아니다. 실시예에 따르면, 프로세서는 좌측 간격, 우측 간격 및/또는 슬러리 펌프 알피엠의 조정 범위 또는 단위를 다르게 설정할 수 있다. 프로세서는 제2 후보 제어 값에 대하여 제2 예측 모델을 이용하여 제2 품질을 예측하고, 제2 품질에 기초 하여 제2 최적 제어 값을 예측할 수 있다. 실시예에 따르면, 프로세서는 제2 후보 제어 값에 대하여 필터링을 실시할 수 있다. 본 실시예에 따르면, 프로세서는 필터링을 통해 제2 후보 제어 값의 수를 최소화할 수 있다. 이 경우, 프로세서는 필터링 을 통해 최소화된 제2 후보 제어 값에 대하여 제2 예측 모델을 이용하여 제2 품질을 예측하고, 제2 품질에 기초 하여 제2 최적 제어 값을 예측할 수 있다. 도 9는 본 문서에 개시되는 일 실시예에 따른 예측 제어 장치가 제2 후보 제어 값 중에서 제2 최적 제어 값을 도출하는 동작을 설명하기 위한 도면이다. 도 9를 참조하면, 프로세서는 제2 예측 모델을 이용하여 제2 후보 제어 값에 대한 품질을 예측하고, 제2 품질에 기초하여 제2 최적 제어 값을 도출할 수 있다. 프로세서는 제2 예측 모델을 이용하여 제2 후보 제어 값에 대한 제2 품질을 예측할 수 있다. 제2 품질은 로딩량, 무지부 폭 및/또는 유지부 폭을 포함할 수 있으나, 이에 한정되는 것은 아니다. 실시예에 따르면, 프로세서는 제2 예측 모델을 이용하여 제2 후보 제어 값에 대한 로딩량, 무지부 폭 및/ 또는 유지부 폭의 예측 값을 연산할 수 있다. 실시예에 따르면, 프로세서는 제2 예측 모델을 이용하여 연 산된 로딩량, 무지부 폭 및/또는 유지부 폭의 예측 값에 기초하여 제2 품질을 예측할 수 있다. 프로세서는 제2 품질에 기초하여 제2 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 제2 후보 제어 값 중 예측된 유지부 폭 및 예측된 무지부 폭이 정상 범위이고, 예측된 로딩량이 목표 값에 가장 가까운 제2 후보 제어 값을 제2 최적 제어 값으로 도출할 수 있다. 예를 들면, 프로세서는 예측된 유지부 폭 및 예측된 무지부 폭이 모두 100이고, 예측된 로딩량이 목표 값인 100인 제2 후보 제어 값을 제2 최적 제어 값으로 도출할 수 있다. 실시예에 따르면, 프로세서는 도출된 제2 최적 제어 값을 이용하여 다이 간격 또는 슬러리 펌프 알피엠을 조절할 수 있다. 이 경우, 슬러리 온도는 도 5 및 도 6을 참조하여, 프로세서가 최적 제어 값을 이용하여 조절한 슬러리 온도로 고정될 수 있다. 도 9에 도시된 실시예에 따르면, 예측된 유지부 폭 및 예측된 무지부 폭이 모두 100이고, 예측된 로딩량이 목표 값인 100이 되도록 하는 제2 최적 제어 값을 이용하여, 프로세서는 좌측 간격을 99[㎛]로, 우측 간격을 99[㎛], 슬러리 펌프 알피엠을 1199로 조절할 수 있다. 본 문서에 개시된 실시예에 따르면, 프로세서는 예측 모델을 이용하여 후보 제어 값에 대한 품질을 예측하 고 최적 제어 값을 도출할 수 있고, 제2 예측 모델을 이용하여 제2 후보 제어 값에 대한 제2 품질을 예측하고 제2 최적 제어 값을 도출할 수 있다. 다만, 본 실시예에 한하지 않고, 프로세서는 예측 모델 및 제2 예측 모델을 결합한 통합 예측 모델을 이용하여 통합 품질을 예측하고, 예측된 통합 품질에 기초하여 예측 제어 장치 의 최종적인 보정 목표를 달성하기 위한 통합 최적 제어 값을 도출할 수 있다. 이 경우, 통합 품질은 중앙 로딩량 데이터, 좌우 유지부 로딩량 데이터 및/또는 로딩 편차, 로딩량, 무지부 폭 및/또는 유지부 폭을 포함할 수 있다. 도 10은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치의 동작 방법을 보여주는 흐름도이다. 도 10을 참조하면, 예측 제어 장치의 동작 방법은 코팅 다이를 이용해 슬러리(slurry)가 로딩되는 기재 (base material)에 관련된 데이터를 획득하는 단계(S100), 데이터에 기초하여 슬러리 로딩 특성을 분석하는 단 계(S110), 슬러리 로딩 특성의 분석 결과에 응답하여 슬러리 온도를 포함하는 후보 제어 값을 도출하는 단계 (S120), 예측 모델을 이용하여 후보 제어 값에 대한 품질을 예측하는 단계(S130) 및 품질에 기초하여 최적 제어값을 도출하는 단계(S140)를 포함할 수 있다. 실시예에 따르면, 예측 제어 장치의 동작 방법은 최적 제어 값을 이용하여 슬러리 온도를 조절하는 단계(S150)를 더 포함할 수 있다. 이하에서는 S100 단계 내지 S150 단계에 대하여 도 1 내지 도 6을 참조하여 구체적으로 설명하고, 중복되는 내 용에 관한 설명은 생략하거나 간략하게 설명한다. S100 단계에서, 데이터 획득부는 사용자 단말로부터 데이터를 획득할 수 있다. 데이터 획득부가 획득한 데이터는 코팅 다이를 이용해 슬러리가 로딩되는 기재에 관련된 데이터를 포함할 수 있다. 실시예에 따 르면, 데이터는 기재에 도포된 슬러리의 로딩량에 관한 슬러리 로딩량 데이터를 포함할 수 있다. 슬러리 로딩량 데이터는 중앙 로딩량 데이터 및 좌우 유지부 로딩량 데이터를 포함할 수 있다. S110 단계에서, 프로세서는 데이터 획득부에서 획득한 데이터에 기초하여 슬러리 로딩 특성을 분석할 수 있다. 실시예에 따르면, 슬러리 로딩 특성은 슬러리 로딩량 균일성을 분석할 수 있다. 예를 들면, 프로세서 는, 데이터 획득부에서 획득한 슬러리 로딩량 데이터에 기초하여 슬러리 로딩량 균일성을 분석할 수 있다. 실시예에 따르면, 프로세서는 슬러리 로딩량 데이터에 기초하여 로딩 편차를 연산함으로써, 슬러리 로딩량 균일성을 분석할 수 있다. 예를 들면, 프로세서는 슬러리 로딩량 데이터에 기초하여 연산된 로딩 편차가 0에 가까운지 여부를 기준으로 하여, 슬러리 로딩량 균일성을 분석할 수 있다. S120 단계에서, 프로세서는 슬러리 로딩 특성을 분석한 결과에 응답하여 후보 제어 값을 도출할 수 있다. 실시예에 따르면, 후보 제어 값은 슬러리 온도를 포함할 수 있다. 예를 들면, 프로세서는 슬러리 로딩 특 성을 분석한 결과에 응답하여, 슬러리 온도를 포함하는 후보 제어 값을 도출할 수 있다. 프로세서는 슬러 리 로딩 특성을 분석한 결과에 응답하여, 예측 제어 장치의 제어 목표를 설정할 수 있다. 실시예에 따르면, 프로세서는 주요 품질 요소(Y)에 관한 보정을 예측 제어 장치의 제어 목표로 설정할 수 있다. 예를 들면, 프로세서는 슬러리 로딩량 균일성을 분석하고, 분석 결과에 응답하여 예측 제어 장치 의 제어 목표를 로딩 패턴에 관한 보정으로 설정할 수 있다. 이 경우, 프로세서는 로딩 패턴을 보정 하기 위한 후보 제어 값을 도출할 수 있다. S130 단계에서, 프로세서는 후보 제어 값에 대한 품질을 예측할 수 있다. 실시예에 따르면, 프로세서(12 0)는 예측 모델을 이용하여 후보 제어 값에 대한 품질을 예측할 수 있다. 실시예에 따르면, 예측 모델은 슬러리 온도와 슬러리 로딩 특성의 상관관계를 학습하여 모델링 될 수 있다. 실시예에 따르면, 품질은 중앙 로딩량 데 이터, 좌우 유지부 로딩량 데이터 및/또는 로딩 편차를 포함할 수 있으나, 이에 한정되는 것은 아니다. S140 단계에서, 프로세서는 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 S130 단계 에서 예측된 품질에 기초하여 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 예측된 중앙 로딩량 데이터, 예측된 좌우 유지부 로딩량 데이터 또는 로딩 편차가 목표 값에 가장 가까운 후보 제어 값을 최 적 제어 값으로 도출할 수 있다. 예를 들어, 도 6을 참조하면, 프로세서는 예측된 로딩 편차가 목표 값인 0에 가장 가까운 후보 제어 값을 최적 제어 값으로 도출할 수 있다. S150 단계에서, 프로세서는 슬러리 온도를 조절할 수 있다. 실시예에 따르면, 프로세서는 S140 단계 에서 도출된 최적 제어 값을 이용하여 슬러리 온도를 조절할 수 있다. 도 11은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치의 동작 방법을 보여주는 흐름도이다. 도 11을 참조하면, 예측 제어 장치의 동작 방법은 기재에 관한 제2 데이터를 획득하는 단계(S200), 제2 데 이터에 기초하여 미스 매칭 발생 여부를 판단하는 단계(S210), 미스 매칭 발생에 응답하여 슬러리 펌프 알피엠 (RPM) 또는 다이 간격을 포함하는 제2 후보 제어 값을 도출하는 단계(S220), 제2 예측 모델을 이용하여 제2 후 보 제어 값에 대한 제2 품질을 예측하는 단계(S230) 및 제2 품질에 기초하여 제2 최적 제어 값을 도출하는 단계 (S240)를 더 포함할 수 있다. 실시예에 따르면, 예측 제어 장치의 동작 방법은 제2 최적 제어 값을 이용하 여 슬러리 펌프 알피엠 또는 다이 간격을 조절하는 단계(S250)를 더 포함할 수 있다. 이하에서는 S200 단계 내지 S250 단계에 대하여 도 1 내지 도 10을 참조하여 구체적으로 설명하고, 중복되는 내 용에 관한 설명은 생략하거나 간략하게 설명한다. S200 단계에서, 데이터 획득부는 사용자 단말로부터 제2 데이터를 획득할 수 있다. 제2 데이터는 슬 러리가 도포된 기재에 관한 데이터를 포함할 수 잇다. 실시예에 따르면 데이터 획득부는, 프로세서가 도 10의 S150 단계를 수행한 이후에, S200 단계를 수행할 수 있다. 제2 데이터는 슬러리 온도를 조절한 후의 기 재에 관한 데이터를 포함할 수 있다. 예를 들면, 제2 데이터는, S150 단계 슬러리 온도를 조절한 후에 슬러리가도포된 기재에 관한 데이터를 포함할 수 있다. 실시예에 따르면, 제2 데이터는 기재의 유지부 폭 및 기재의 무 지부 폭을 이미지로 변환한 이미지 데이터를 포함할 수 있다. S210 단계에서, 프로세서는 미스 매칭 발생 여부를 판단할 수 있다. 실시예에 따르면, 프로세서는 제 2 데이터에 기초하여 미스 매칭 발생 여부를 판단할 수 있다. 실시예에 따르면, 프로세서는 기재의 서로 다른 두 대향면의 탑(Top) 및/또는 백(Back)의 폭 너비를 이용하여 미스 매칭 발생 여부를 연산할 수 있다. 예 를 들면, 프로세서는 기재의 탑(Top)의 무지부 폭(W1, W3, W5) 및 유지부 폭(W2, W4)과 기재의 백(Back)의 무지부 폭(X1, X3, X5) 및 유지부 폭(X2, X4)을 이용하여 폭 차이(M1, M2, M3, M4)를 연산하여 미스 매칭 발생 여 부를 판단할 수 있다. 본 문서에 개시된 실시예에 따르면, 프로세서는 연산된 폭 차이(M1, M2, M3, M4) 값 의 차이가 기준 값 이상인 경우, 미스 매칭이 발생한 것으로 판단할 수 있다. S220 단계에서, 프로세서는 미스 매칭 발생 여부에 응답하여 제2 후보 제어 값을 도출할 수 있다. 실시예 에 따르면, 제2 후보 제어 값은 슬러리 펌프 알피엠(RPM) 또는 다이 간격을 포함할 수 있다. 예를 들면, 프로세 서는 미스 매칭 발생 여부에 응답하여, 슬러리 펌프 알피엠 또는 다이 간격을 포함하는 제2 후보 제어 값 을 도출할 수 있다. S230 단계에서, 프로세서는 제2 후보 제어 값에 대한 제2 품질을 예측할 수 있다. 실시예에 따르면, 프로 세서는 제2 예측 모델을 이용하여 제2 후보 제어 값에 대한 제2 품질을 예측할 수 있다. 실시예에 따르면, 제2 품질은 로딩량, 무지부 폭 및/또는 유지부 폭을 포함할 수 있으나, 이에 한정되는 것은 아니다. S240 단계에서, 프로세서는 제2 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 S230 단계에서 예측된 제2 품질에 기초하여 제2 최적 제어 값을 도출할 수 있다. 실시예에 따르면, 프로세서는 제2 후보 제어 값 중에서 예측된 유지부 폭 및 예측된 무지부 폭이 정상 범위이고, 예측된 로딩량이 목표 값에 가장 가까운 제2 후보 제어 값을 제2 최적 제어 값으로 도출할 수 있다. 예를 들어, 도 9를 참조하면, 프로세서 는 예측된 유지부 폭 및 예측된 무지부 폭이 모두 100이고, 예측된 로딩량이 목표 값인 100인 제2 후보 제 어 값을 제2 최적 제어 값으로 도출할 수 있다. S250 단계에서, 프로세서는 슬러리 펌프 알피엠 또는 다이 간격을 조절할 수 있다. 실시예에 따르면, 프로 세서는 S240 단계에서 도출된 제2 최적 제어 값을 이용하여 슬러리 펌프 알피엠 또는 다이 간격을 조절할 수 있다. 본 문서에 개시된 실시예에 따라, 프로세서가 예측 모델 및 제2 예측 모델을 결합한 통합 예측 모델을 이 용하는 경우, 프로세서는 S100 단계 내지 S150 단계와 S200 단계 내지 S250 단계를 동시에 수행할 수 있다. 이상에서 기재된 \"포함하다\", \"구성하다\", 또는 \"가지다\" 등의 용어는, 특별히 반대되는 기재가 없는 한, 해당 구성 요소를 내재할 수 있음을 의미하는 것이므로, 다른 구성 요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것으로 해석되어야 한다. 기술적이거나 과학적인 용어를 포함한 모든 용어들은, 다르게 정의 되지 않는 한, 본 문서에 개시된 실시예들이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미가 있다. 사전에 정의된 용어와 같이 일반적으로 사용되는 용어들은 관련 기술의 문 맥상의 의미와 일치하는 것으로 해석되어야 하며, 본 문서에서 명백하게 정의하지 않는 한, 이상적이거나 과도 하게 형식적인 의미로 해석되지 않는다. 이상의 설명은 본 문서에 개시된 기술 사상을 예시적으로 설명한 것에 불과한 것으로서, 본 문서에 개시된 실시 예들이 속하는 기술 분야에서 통상의 지식을 가진 자라면 본 문서에 개시된 실시예들의 본질적인 특성에서 벗어 나지 않는 범위에서 다양한 수정 및 변형이 가능할 것이다. 따라서, 본 문서에 개시된 실시예들은 본 문서에 개 시된 실시예들의 기술 사상을 한정하기 위한 것이 아니라 설명하기 위한 것이고, 이러한 실시예에 의하여 본 문 서에 개시된 기술 사상의 범위가 한정되는 것은 아니다. 본 문서에 개시된 기술사상의 보호 범위는 아래의 청구 범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술사상은 본 문서의 권리 범위에 포함되는 것으로 해석되어야 할 것이다.도면 도면1a 도면1b 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2023-0052200", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 본 문서에 개시된 일 실시예에 따른 예측 제어 시스템을 보여주는 도면이다. 도 1b는 본 문서에 개시된 일 실시예에 따른 예측 모델을 예시하는 도면이다. 도 2는 본 문서에 개시된 일 실시예에 따른 예측 제어 장치를 보여주는 블록도이다. 도 3은 본 문서에 개시된 다양한 실시예에 참조되는 슬러리 로딩 특성을 설명하기 위한 도면이다. 도 4는 본 문서에 개시된 다양한 실시예에 참조되는 제어 인자 및 주요 품질 요소를 보여주는 도면이다. 도 5는 본 문서에 개시된 일 실시예에 따른 예측 제어 장치가 도출한 후보 제어 값을 보여주는 도면이다. 도 6은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치가 후보 제어 값 중에서 최적 제어 값을 도출하는 동 작을 설명하기 위한 도면이다. 도 7은 본 문서에 개시된 일 실시예에 따라 미스 매칭 발생 여부의 판단 방법을 설명하기 위한 도면이다. 도 8은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치가 도출한 제2 후보 제어 값을 보여주는 도면이다. 도 9는 본 문서에 개시되는 일 실시예에 따른 예측 제어 장치가 제2 후보 제어 값 중에서 제2 최적 제어 값을 도출하는 동작을 설명하기 위한 도면이다. 도 10 및 도 11은 본 문서에 개시된 일 실시예에 따른 예측 제어 장치의 동작 방법을 보여주는 흐름도이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
