{"patent_id": "10-2022-0181387", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0100523", "출원번호": "10-2022-0181387", "발명의 명칭": "작업자 위험 상태 판정 방법 및 이를 이용한 장치", "출원인": "(주)소프트젠", "발명자": "김연표"}}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "작업자에게 착용된 상태로 휴대되는 적어도 하나의 센싱 장치로부터 획득되는 데이터를 이용하여, 컴퓨팅 장치가 상기 작업자의 위험 상태를 판정하는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 컴퓨팅 장치가, 상기 센싱 장치로부터 센서 데이터를 수집하거나 상기 컴퓨팅 장치에 연동하는 타 장치로 하여금 상기 센서 데이터를 수집하도록 지원하는 단계; 상기 컴퓨팅 장치가, 상기 센서 데이터를 시계열 데이터로 가공하거나 상기 컴퓨팅 장치에 연동하는 타 장치로하여금 상기 센서 데이터를 상기 시계열 데이터로 가공하도록 지원하는 단계; 및 상기 컴퓨팅 장치가, 인공지능 모델을 이용하여 상기 시계열 데이터로부터 상기 작업자의 상기 위험 상태를 판정하거나 상기 컴퓨팅 장치에 연동하는 타 장치로 하여금 상기 인공지능 모델을 이용하여 상기 위험 상태를 판정하도록 지원하는 단계를 포함하는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 컴퓨팅 장치가, 판정된 상기 위험 상태를 상기 센싱 장치 중 적어도 하나 또는 외부 엔티티에 제공하는 단계를 더 포함하는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 센싱 장치는 모션 센서, 공기질 센서, 생체신호 수집 센서 중 적어도 하나를 포함하는, 작업자 위험 상태판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 센서 데이터는, 상기 생체신호 수집 센서에 의하여 수집되는 ECG, 혈압, 심박수, 산소포화도 및 체온; 상기 모션 센서에 의하여 수집되는 x축, y축 및 z축 각각의 회전각, x축, y축 및 z축 방향의 중력 가속도; 및 상기 공기질 센서에 의하여 수집되는 CO2, VOCS, PM2.5, PM10 센서 값중 적어도 하나를 포함하는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 센싱 장치로부터 상기 센서 데이터를 수집하는 단계에서, 상기 센서 데이터는, 블루투스, WiFi, Zigbee 및 LTE를 포함하는 무선 통신 방식 군(郡) 중에서 선택된 통신 방공개특허 10-2024-0100523-3-식으로 상기 센싱 장치로부터 상기 컴퓨팅 장치에 전달되는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 센싱 장치로부터 상기 센서 데이터를 수집하는 단계에서, 상기 센싱 장치 중 하나에 의하여 수집된 특정 센서 데이터가, 상기 무선 통신 방식 군 중에서 선택된 통신 방식으로 상기 센싱 장치 중 다른 하나에 전송된 후, 상기 다른 하나로부터 상기 컴퓨팅 장치에 전달되는, 작업자위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제2항에 있어서, 상기 센서 데이터를 시계열 데이터로 가공하는 단계는, 상기 컴퓨팅 장치가, 상기 센서 데이터에서 이상 수치 값 및 노이즈 중 적어도 하나를 제거하는 단계, 및 상기 컴퓨팅 장치가, 상기 센서 데이터의 결측치를 보완하는 단계 중 적어도 하나를 포함하는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제2항에 있어서, 상기 인공지능 모델은 RNN 모델, LSTM 모델 및 GRU 모델을 포함하는 시계열적 딥러닝 모델 군(郡) 중에서 선택되는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제2항에 있어서, 상기 위험 상태는, 상기 작업자의 스트레스 상태, 상기 작업자의 혈압 및 심장 이상 상태, 상기 작업자의 전도(넘어짐) 상태, 상기작업자의 추락 상태 중 적어도 하나를 포함하는, 작업자 위험 상태 판정 방법."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "컴퓨팅 장치로 하여금, 제1항 내지 제10항 중 어느 한 항의 방법을 수행하도록 구현된 명령어(instructions)를포함하는, 기계 판독 가능한 비일시적 기록 매체에 저장된, 컴퓨터 프로그램."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "작업자의 위험 상태를 판정하는 컴퓨팅 장치로서, 작업자에게 착용된 상태로 휴대되는 적어도 하나의 센싱 장치와 연동하는 통신부; 및 상기 통신부를 통하여 상기 센싱 장치로부터 획득되는 데이터를 이용하여 상기 작업자의 위험 상태를 판정하는프로세서를 포함하는, 작업자 위험 상태 판정 장치."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 프로세서는,상기 통신부를 통하여 상기 센싱 장치로부터 센서 데이터를 수집하는 프로세스; 상기 센서 데이터를 시계열 데이터로 가공하는 프로세스; 및 공개특허 10-2024-0100523-4-인공지능 모델을 이용하여 상기 시계열 데이터로부터 상기 작업자의 상기 위험 상태를 판정하는 프로세스각각을 수행하거나 상기 통신부를 통하여 연동하는 타 장치로 하여금 수행하도록 지원하는, 작업자 위험 상태판정 장치."}
{"patent_id": "10-2022-0181387", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 프로세서는, 판정된 상기 위험 상태를 상기 통신부를 통하여 상기 센싱 장치 중 적어도 하나 또는 외부 엔티티에 제공하는프로세스를 더 수행하거나 상기 통신부를 통하여 연동하는 타 장치로 하여금 수행하도록 지원하는, 작업자 위험 상태 판정 장치."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시서에 개시되는 작업자 위험 상태 판정 방법 및 이를 이용한 장치는 작업자에게 착용된 상태로 휴대되는 적어도 하나의 센싱 장치로부터 획득되는 데이터를 이용하여 상기 작업자의 위험 상태를 판정하는 방법에 관한 것이다. 구체적으로, 본 개시서의 일 실시 예에 의하면, 컴퓨팅 장치가, 상기 센싱 장치로부터 센서 데이터를 수 집하고, 상기 센서 데이터를 시계열 데이터로 가공하며, 인공지능 모델을 이용하여 상기 시계열 데이터로부터 상 기 작업자의 상기 위험 상태를 판정한다."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시서에 개시되는 작업자 위험 상태 판정 방법 및 이를 이용한 장치는 작업자에게 착용된 상태로 휴대되는 적어도 하나의 센싱 장치로부터 획득되는 데이터를 이용하여 상기 작업자의 위험 상태를 판정하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "산업 현장에 투입되는 작업자의 안전을 담보하기 위한 많은 방안들이 연구되어 왔다. 예를 들어, 대한민국 공개특허공보 제10-2022-0165203호에서는 작업자와 중장비 간의 거리를 산출하여 특정 거 리 이내인 경우 경고기를 통하여 경고를 출력하도록 하는 기술적 사상이 개시되어 있다. 그런데 이와 같이 객체들의 인식 및 객체들 간의 거리 등 역학적인 조건에만 초점을 둔 방식으로는 작업자에게 닥칠 수 있는 여러 위험 상태를 미연에 대비하는 데 한계점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) KR 10-2022-0165203 A"}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "따라서 본 개시서에서는 종래 기술의 한계점을 극복하여, 산업 현장에서 발생할 수 있는 다양한 안전 사고를 예 방할 수 있는 방법 및 이를 이용하는 장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 바와 같은 본 발명의 목적을 달성하고, 후술하는 본 발명의 특징적인 효과를 실현하기 위한 본 발명의 특징적인 구성은 하기와 같다. 본 개시서의 일 태양에 따르면, 작업자에게 착용된 상태로 휴대되는 적어도 하나의 센싱 장치로부터 획득되는 데이터를 이용하여, 컴퓨팅 장치가 상기 작업자의 위험 상태를 판정하는, 작업자 위험 상태 판정 방법이 제공된 다. 구체적으로, 상기 방법은, 컴퓨팅 장치가, 상기 센싱 장치로부터 센서 데이터를 수집하는 단계; 상기 컴퓨팅 장 치가, 상기 센서 데이터를 시계열 데이터로 가공하는 단계; 및 상기 컴퓨팅 장치가, 인공지능 모델을 이용하여 상기 시계열 데이터로부터 상기 작업자의 상기 위험 상태를 판정하는 단계를 포함한다. 일 실시 예에서, 상기 방법은, 상기 컴퓨팅 장치가, 판정된 상기 위험 상태를 상기 센싱 장치 중 적어도 하나 또는 외부 엔티티에 제공하는 단계를 더 포함할 수 있다. 유리하게는, 상기 센싱 장치는 모션 센서, 공기질 센서, 생체신호 수집 센서 중 적어도 하나를 포함한다. 더 유리하게는, 상기 센서 데이터는, 상기 생체신호 수집 센서에 의하여 수집되는 ECG, 혈압, 심박수, 산소포화 도 및 체온; 상기 모션 센서에 의하여 수집되는 x축, y축 및 z축 각각의 회전각, x축, y축 및 z축 방향의 중력 가속도; 및 상기 공기질 센서에 의하여 수집되는 CO2, VOCS, PM2.5, PM10 센서 값 중 적어도 하나를 포함한다. 바람직하게는, 상기 센싱 장치로부터 상기 센서 데이터를 수집하는 단계에서, 상기 센서 데이터는, 블루투스, WiFi, Zigbee 및 LTE를 포함하는 무선 통신 방식 군(郡) 중에서 선택된 통신 방식으로 상기 센싱 장치로부터 상 기 컴퓨팅 장치에 전달된다. 일 실시 예에서는, 상기 센싱 장치로부터 상기 센서 데이터를 수집하는 단계에서, 상기 센싱 장치 중 하나에 의 하여 수집된 특정 센서 데이터가, 상기 무선 통신 방식 군 중에서 선택된 통신 방식으로 상기 센싱 장치 중 다 른 하나에 전송된 후, 상기 다른 하나로부터 상기 컴퓨팅 장치에 전달될 수 있다. 유리하게는, 상기 센서 데이터를 시계열 데이터로 가공하는 단계는, 상기 컴퓨팅 장치가, 상기 센서 데이터에서 이상 수치 값 및 노이즈 중 적어도 하나를 제거하는 단계, 및 상기 컴퓨팅 장치가, 상기 센서 데이터의 결측치 를 보완하는 단계 중 적어도 하나를 포함한다. 바람직하게는, 상기 인공지능 모델은 RNN 모델, LSTM 모델 및 GRU 모델을 포함하는 시계열적 딥러닝 모델 군(郡) 중에서 선택된다. 유리하게는, 상기 위험 상태는, 상기 작업자의 스트레스 상태, 상기 작업자의 혈압 및 심장 이상 상태, 상기 작 업자의 전도(넘어짐) 상태, 상기 작업자의 추락 상태 중 적어도 하나를 포함한다. 본 발명의 다른 태양에 따르면, 본 발명에 따른 방법들을 수행하도록 구현된 명령어들(instructions)을 포함하 는 컴퓨터 프로그램도 제공된다. 예를 들어, 그러한 컴퓨터 프로그램은 기계 판독 가능한 비일시적 기록 매체에 저장될 수 있다. 본 발명의 또 다른 태양에 따르면, 작업자의 위험 상태를 판정하는 컴퓨팅 장치가 제공되는바, 그 컴퓨팅 장치 는, 작업자에게 착용된 상태로 휴대되는 적어도 하나의 센싱 장치와 연동하는 통신부; 및 상기 통신부를 통하여 상기 센싱 장치로부터 획득되는 데이터를 이용하여 상기 작업자의 위험 상태를 판정하는 프로세서를 포함한다. 일 실시 예에서, 상기 프로세서는, 상기 통신부를 통하여 상기 센싱 장치로부터 센서 데이터를 수집하는 프로세 스; 상기 센서 데이터를 시계열 데이터로 가공하는 프로세스; 및 인공지능 모델을 이용하여 상기 시계열 데이터 로부터 상기 작업자의 상기 위험 상태를 판정하는 프로세스를 수행한다. 바람직하게는, 상기 프로세서는, 판정된 상기 위험 상태를 상기 통신부를 통하여 상기 센싱 장치 중 적어도 하 나 또는 외부 엔티티에 제공하는 프로세스를 더 수행할 수 있다."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시서의 발명에 의하면, 작업자가 인지할 수 있는 상황적 조건뿐만 아니라 작업자가 인지하기 어렵거나 인 지할 수 없는 조건까지 고려함으로써 산업 현장에서 발생할 수 있는 다양한 안전 사고를 효과적으로 예방할 수 있는 효과가 있다."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "후술하는 본 발명에 대한 상세한 설명은, 본 발명의 목적들, 기술적 해법들 및 장점들을 분명하게 하기 위하여 본 발명이 실시될 수 있는 특정 실시 예를 예시로서 도시하는 첨부 도면을 참조한다. 이들 실시 예는 통상의 기 술자가 본 발명을 실시할 수 있기에 충분하도록 상세히 설명된다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한다. 도면에서 유사한 참조부호는 여러 측면에 걸쳐서 동일하거나 유사한 기능을 지칭한다. \"제1\" 또는 \"제2\" 등의 용어를 다양한 구성요소들을 설명하는데 사용될 수 있지만, 이런 용어들은 하나의 구성 요소를 다른 구성요소로부터 구별하는 목적으로만 해석되어야 하는바, 어떠한 순서도 시사하고 있지 않기 때문 이다. 예를 들어, 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소는 제1 구성요소로도 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시서에서, \"포함하다\" 또는 \"가지다\" 등의 용어는 기재된 특징, 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함 으로 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들 을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 개시서에서 '위험 상태'는 안전 사고가 발생할 수 있는 위험한 상태를 일컫는 용어이며, 이는 사고 발생 위 험 여부를 나타내는 값 또는 위험 결괏값으로 수치화될 수 있다. 예를 들어, 상기 위험 상태는, 작업자의 스트 레스 상태, 상기 작업자의 혈압 및 심장 이상 상태, 상기 작업자의 전도(넘어짐) 상태, 상기 작업자의 추락 상 태 중 적어도 하나를 포함할 수 있다. 또한, 본 개시서에서 '학습', '훈련', 혹은 '러닝'은 절차에 따른 컴퓨팅(computing)을 통하여 기계 학습 (machine learning)을 수행함을 일컫는 용어인바, 인간의 교육 활동과 같은 정신적 작용을 지칭하도록 의도된 것이 아님을 통상의 기술자는 이해할 수 있을 것이다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 해당 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가진다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥상 가지는 의미와 일치하는 의미를 갖는 것으로 해 석되어야 하며, 본 개시서에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 더욱이 본 발명은 본 개시서에 표시된 실시 예들의 모든 가능한 조합들을 망라한다. 본 발명의 다양한 실시 예 는 서로 다르지만 상호 배타적일 필요는 없음이 이해되어야 한다. 예를 들어, 여기에 기재되어 있는 특정 형상, 구조 및 특성은 일 실시 예에 관련하여 본 발명의 사상 및 범위를 벗어나지 않으면서 다른 실시 예로 구현될 수 있다. 또한, 각각의 개시된 실시 예 내의 개별 구성요소의 위치 또는 배치는 본 발명의 사상 및 범위를 벗어나 지 않으면서 변경될 수 있음이 이해되어야 한다. 따라서, 후술하는 상세한 설명은 한정적인 의미로서 취하려는 것이 아니다. 본 개시서에서 달리 표시되거나 분명히 문맥에 모순되지 않는 한, 단수로 지칭된 항목은, 그 문맥에서 달리 요 구되지 않는 한, 복수의 것을 아우른다. 또한, 본 발명을 설명함에 있어, 관련된 공지 구성 또는 기능에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명은 생략한다. 이하, 통상의 기술자가 본 발명을 용이하게 실시할 수 있도록 하기 위하여, 본 발명의 바람직한 실시 예들에 관 하여 첨부된 도면을 참조하여 상세히 설명하기로 한다. 도 1은 본 개시서에 따른 작업자 위험 상태 판정 방법을 수행하는 컴퓨팅 장치의 예시적 구성을 개략적으로 도 시한 개념도이다. 도 1을 참조하면, 본 개시서의 일 실시 예에 따른 컴퓨팅 장치는, 통신부 및 프로세서를 포함하 며, 상기 통신부를 통하여 외부 컴퓨팅 장치(미도시)와 직간접적으로 통신할 수 있다. 구체적으로, 상기 컴퓨팅 장치는, 전형적인 컴퓨터 하드웨어(예컨대, 컴퓨터, 프로세서, 메모리, 스토리지 (storage), 입력 장치 및 출력 장치, 기타 기존의 컴퓨팅 장치의 구성요소들을 포함할 수 있는 장치; 라우터, 스위치 등과 같은 전자 통신 장치; 네트워크 부착 스토리지(NAS; network-attached storage) 및 스토리지 영역 네트워크(SAN; storage area network)와 같은 전자 정보 스토리지 시스템)와 컴퓨터 소프트웨어(즉, 컴퓨팅 장 치로 하여금 특정의 방식으로 기능하게 하는 명령어들)의 조합을 이용하여 원하는 시스템 성능을 달성하는 것일 수 있다. 상기 스토리지는 하드 디스크, USB(Universal Serial Bus) 메모리와 같은 기억 장치뿐만 아니라 클라 우드 서버와 같은 네트워크 연결 기반의 저장 장치의 형태를 포함할 수 있다. 이와 같은 컴퓨팅 장치의 통신부는 연동되는 타 컴퓨팅 장치, 예컨대 전용의 저장소, 예컨대, 데이터베이 스 서버 등과의 사이에서 요청과 응답을 송수신할 수 있는바, 일 예시로서 그러한 요청과 응답은 동일한 TCP(Transmission Control Protocol) 세션(session)에 의하여 이루어질 수 있지만, 이에 한정되지는 않는 바, 예컨대 UDP(User Datagram Protocol) 데이터그램(datagram)으로서 송수신될 수도 있을 것이다. 구체적으로, 통신부는 통신 인터페이스를 포함하는 통신 모듈의 형태로 구현될 수 있다. 이를테면, 통신 인터페이스는 WLAN(Wireless LAN), WiFi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMax(World interoperability for Microwave access), HSDPA(High Speed Downlink Packet Access) 등의 무선 인터넷 인터페이스와 블루투스(Bluetooth쪠), RFID(Radio Frequency IDentification), 적외선 통신(Infrared Data Association; IrDA), UWB(Ultra-WideBand), ZigBee, NFC(Near Field Communication) 등의 근거리 통신 인터페이스를 포함할 수 있다. 뿐만 아니라, 통신 인터페이스는 프로세 서가 외부와 통신을 수행할 수 있는 모든 인터페이스(예를 들어, 데이터 버스(data bus)와 같은 여러 버스, 유 무선 인터페이스)를 나타낼 수 있다. 예를 들어, 통신부는 이와 같이 적합한 통신 인터페이스를 통해 타 컴퓨팅 장치로부터 데이터를 송수신할 수 있다. 덧붙여, 넓은 의미에서 상기 통신부는 명령어 또는 지시 등을 전달받기 위한 키보드, 마우스, 기 타 외부 입력 장치, 인쇄 장치, 디스플레이, 기타 외부 출력 장치를 포함하거나 이들과 연동될 수 있다. 컴퓨팅 장치, 예컨대, 휴대 단말(스마트폰 등) 또는 개인용 컴퓨터(personal computer; PC)와 같은 사용자 단말이나 서 버의 사용자에게 적합한 사용자 인터페이스를 표시하여 제공함으로써 사용자와의 상호작용을 가능하게 하기 위 하여, 컴퓨팅 장치는 디스플레이부를 내장하거나 상기 통신부를 통하여 외부의 디스플레이 장치와 연 동될 수 있음이 알려져 있다. 예컨대, 그러한 디스플레이부 또는 디스플레이 장치는 터치 입력이 가능한 터치스 크린일 수 있다. 또한, 컴퓨팅 장치의 프로세서는 캐시 메모리(cache memory)와 같은 내부 메모리 및/또는 외부 메모리를 가지는 하나 이상의, MPU(micro processing unit), CPU(central processing unit), GPU(graphics processing unit), NPU(neural processing unit) 또는 TPU(tensor processing unit)와 같은 마이크로프로세서, 컨트롤러, 예컨대, 마이크로컨트롤러, 임베디드 마이크로컨트롤러, 마이크로컴퓨터, ALU(arithmetic logic unit), 디지털 신호 프로세서(digital signal processor), 예컨대, 프로그래머블 디지털 신호 프로세서 또는 기타 프로그래머 블 장치 등의 하드웨어 구성을 포함할 수 있다. 또한, 운영체제, 특정 목적을 수행하는 애플리케이션의 소프트 웨어 구성을 더 포함할 수도 있다. 이제 도 2 내지 도 6을 참조하여 본 개시서에 따른 작업자 위험 상태 판정 방법을 상세히 후술하기로 한다. 도 2는 본 개시서에 따른 작업자 위험 상태 판정 방법을 수행하는 컴퓨팅 장치를 포함하는 예시적 전체 체계의 하드웨어 또는 소프트웨어 구성요소를 개념적으로 도시한 예시적 블록도이고, 도 3는 본 개시서에 따른 작업자 위험 상태 판정 방법을 도시한 예시적 흐름도이다.도 2 및 도 3을 참조하면, 본 개시서의 작업자 위험 상태 판정 방법은, 컴퓨팅 장치에 의하여 구현되는 센 서 데이터 수집 모듈이, 컴퓨팅 장치의 통신부를 통하여 센싱 장치로부터 작업자에 관한 센서 데이터를 수집하는 단계(센서 데이터 수집 단계; S100)를 포함한다. 도 4는 본 개시서의 작업자 위험 상태 판정 방법에서 이용되는 센싱 장치의 센서들을 예시적으로 나타낸 도면이 다. 도 4를 참조하면, 센싱 장치는 모션 센서(위치 센서 포함)(예컨대, 가속도 센서, 중력 센서, 자이로스코프, 회전 벡터 센서, 방향 센서, 자기계 등), 공기질 센서, 생체신호 수집 센서 중 적어도 하나를 포 함하거나 이와 연동할 수 있으며, 그 개별 센서나 센싱 장치는 웨어러블(wearable)일 수 있는바, 예를 들 어, 작업자가 착용하는 작업복에 부착된 것일 수도 있다. 센싱 장치에 포함되거나 이와 연동될 수 있는 센 서에는 환경 센서, 예컨대, 기압계, 광도계, 온도계 등이 더 포함될 수 있다. 일 실시 예에서는, 센싱 장치 자체가 컴퓨팅 기능을 가진 것일 수 있는바, 구체적으로, 안드로이드 (Android) 플랫폼 기반의 웨어러블 스마트밴드일 수 있다. 센싱 장치는 스마트 워치(smart watch; 310)와 연동되어 그 스마트 워치로부터 센서 신호를 수신하거나 스 마트 워치를 포함할 수 있다. 상기 센서 데이터는, 상기 생체신호 수집 센서에 의하여 수집되는 ECG, 혈압, 심박수, 산소포화도 및 체온; 상 기 모션 센서에 의하여 수집되는 가속력 및 회전력, 더 구체적으로, x축, y축 및 z축 각각의 회전각, x축, y축 및 z축 방향의 중력 가속도; 및 상기 공기질 센서에 의하여 수집되는 CO2, VOCS, PM2.5, PM10 센서 값 중 적어 도 하나를 포함할 수 있다. 센서 데이터 수집 단계(S100)에서, 상기 센서 데이터는, 블루투스, WiFi, Zigbee 및 LTE를 포함하는 무선 통신 방식 군(郡) 중에서 선택된 하나 이상의 통신 방식으로 센싱 장치로부터 컴퓨팅 장치에 전달될 수 있 다. 단일의 센싱 장치가 요구되는 모든 센서들을 포함할 수도 있으나, 여러 센싱 장치(300a, 300b; 미도시)가 이용되는 실시 예에서는, 센싱 장치 중 하나(300b)(예컨대, 스마트 워치)에 의하여 수집된 특정 센서 데이터가, 상기 무선 통신 방식 군에서 선택된 통신 방식으로 센싱 장치 중 다른 하나(300a)에 전송된 후, 그 다른 하나 (300a)로부터 컴퓨팅 장치에 전달될 수도 있다. 계속해서 도 2 및 도 3을 참조하면, 본 개시서의 작업자 위험 상태 판정 방법은, 컴퓨팅 장치에 의하여 구 현되는 센서 데이터 가공 모듈이, 상기 센서 데이터를 시계열 데이터로 가공하는 단계(센서 데이터 가공 단계; S200)를 더 포함한다. 센서 데이터 가공 단계(S200)는 상기 센서 데이터에서 이상 수치 값 및 노이즈 중 적어도 하나를 제거하는 단계 (S210) 및 상기 센서 데이터의 결측치를 보완하는 단계(S220)를 포함할 수 있으며, 단계(S210) 또는 단계(S22 0)만을 포함할 수도 있다. 이처럼 단계(S200)에서 센서 데이터로부터 가공된 시계열 데이터의 예시는 도 5에 개념적으로 나타나 있다. 다음으로, 본 개시서의 작업자 위험 상태 판정 방법은, 컴퓨팅 장치에 의하여 구현되는 위험 상태 판정 모 듈이, 인공지능 모델을 이용하여 상기 시계열 데이터로부터 상기 작업자의 상기 위험 상태를 판정하는 단 계(위험 상태 판정 단계; S300)를 더 포함한다. 상기 인공지능 모델은 잘 알려진 시계열적 딥러닝 모델 군(郡) 중에서 선택된 것일 수 있으며, 그러한 시계열적 딥러닝 모델 군은 RNN 모델, LSTM 모델 및 GRU 모델을 포함할 수 있다. 도 6은 본 개시서의 작업자 위험 상태 판정 방법에 이용되는 인공지능 모델의 예시로서 LSTM을 이용한 예 시적 모델(이하 \"LSTM 모델\"이라 함)을 개념적으로 나타낸 도면이다. 도 6을 참조하면, LSTM 모델의 결괏 값은 소프트맥스 분류(softmax classification)로 제공될 수 있다. 앞서 언급된 바와 같이, 상기 위험 상태는, 작업자의 스트레스 상태, 상기 작업자의 혈압 및 심장 이상 상태, 상기 작업자의 전도(넘어짐) 상태, 상기 작업자의 추락 상태 중 적어도 하나를 포함할 수 있다. 상기 스트레스 상태는 상기 작업자에게서 측정된 ECG(심전도)의 시계열 데이터를 이용하여, 인공지능 모델(60 0)에 의하여 산출되는바, 예를 들어, ECG 시계열 데이터를 HRV(심박변이도) 시계열 데이터로 변환하면, 그 HRV데이터의 심파테틱 톤(sympathetic tone)에 의해 스트레스 상태를 수치화한 스트레스 지수가 추출될 수 있으며, ECG 데이터 또는 HRV 데이터의 이상 탐지(anomaly detection)에 의하여 상기 작업자의 심장 이상 상태 등 건강 이상 여부가 감지될 수 있다. 한편, 인공지능 모델에 의하여 상기 모션 센서로부터 획득된 시계열 데이터로부터 작업자의 행동이 식별될 수 있는바, 그러한 행동에는, 예를 들어, '멈춤', '이동', '계단 오르기', '계단 내려가기', '눕기' 등의 기본 행동, 작업자의 '전도(넘어짐)', '추락' 등의 위험 행동이 포함될 수 있다. 다시 도 2 및 도 3을 참조하면, 본 개시서의 작업자 위험 상태 판정 방법은, 컴퓨팅 장치에 의하여 구현되 는 위험 상태 송신 모듈이, 판정된 상기 위험 상태를 센싱 장치 중 적어도 하나 또는 외부 엔티티 (external entity), 예컨대, 휴대 단말에 제공하는 단계(위험 상태 제공 단계; S400)를 더 포함할 수 있다. 인공지능 모델에 의한 결괏값에 따른 위험 상태(이를 나타내는 정보 포함)를 센싱 장치를 통하여, 또 는 이에 갈음하는 외부 엔티티을 통하여, 작업자 또는 작업자를 관리하는 주체(예컨대, 관리자)에 제공하는 방"}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "안은 컴퓨터 하드웨어 및 소프트웨어에 관한 기술분야에서 통상의 지식을 가진 사람에게 작업자 및/또는 관리자 의 휴대 단말에 대한 푸시, 알람 메시지의 송신 등 다양한 형태로 잘 알려져 있으므로 이에 관한 지나친 세부 설명은 생략하기로 한다. 도면들에 나타난 각 단계는 설명의 편의 상 하나의 컴퓨팅 장치, 예컨대, 관제용 서버에서 실현되는 것으 로 예시되었으나 본 발명의 방법을 수행하는 컴퓨팅 장치는 복수개의 장치들이 서로 연동된 것으로 구성될 수도 있다는 점이 이해될 것이다. 예를 들어, 단계들(S100, S200 및 S400)은 관제 서버(200a)에서 수행되되 단 계(S300)는 AI 서버(200b)에서 수행되도록 구성될 수도 있으며, 단계들(S100 내지 S300)은 AI 서버(200a')에서 수행되되 단계(S400)는 관제 서버(200b')에서 수행되도록 구성될 수도 있다. 상기 실시 예로써 본 개시서에서 설명된 기술의 이점은, 산업 현장에서 발생할 수 있는 다양한 안전 사고를 예 방함에 있어서, 작업자가 인지할 수 있는 상황적 조건뿐만 아니라 작업자가 인지하기 어렵거나 인지할 수 없는 조건까지 고려하여 종래 기술의 한계점을 극복한 방법을 제공한다는 점이다. 본 개시서에 개시된 방법은 1회 수행될 수 있을 뿐만 아니라 필요에 따라서 반복적으로나 간헐적으로 또는 지속 적으로 수행될 수도 있음은 물론이다."}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상, 본 개시서의 다양한 실시 예들에 관한 설명에 기초하여 해당 기술분야의 통상의 기술자는, 본 발명의 방 법 및/또는 프로세스들, 그리고 그 단계들이 하드웨어, 소프트웨어 또는 특정 용례에 적합한 하드웨어 및 소프 트웨어의 임의의 조합으로 실현될 수 있다는 점을 명확하게 이해할 수 있다. 또한, 본 개시서를 읽은 오늘날의 통상의 기술자는 컴퓨팅 장치, 예를 들어, 워크스테이션, 개인용 컴퓨터, 휴 대 단말 등을 통하여 제공될 수 있는 다양한 사용자 인터페이스에 익숙한바, 본 개시서에서 설명된 방법들을 이 루는 개별 단계들에서 언급된 구성에 관한 상세한 설명의 유무와 무관하게 통상의 기술자는 본 개시서의 방법에 서 필요한 다양한 사용자 인터페이스를 쉽게 상정할 수 있을 것이다. 상기 하드웨어 장치는 범용 컴퓨터 및/또는 전용 컴퓨팅 장치 또는 특정 컴퓨팅 장치 또는 특정 컴퓨팅 장치의 특별한 모습 또는 구성요소를 포함할 수 있다. 상기 프로세스들은 프로그램 명령어를 저장하기 위한 ROM/RAM 등과 같은 메모리와 결합되고 상기 메모리에 저장된 명령어들을 실행하도록 구성되는 전술된 바와 같은 프로세 서에 의하여 실현될 수 있다. 게다가, 혹은 대안으로서, 상기 프로세스들은 주문형 집적회로(application specific integrated circuit; ASIC), 프로그래머블 게이트 어레이(programmable gate array), 예컨대, FPGA(field programmable gate array), PLU(programmable logic unit) 혹은 프로그래머블 어레이 로직 (Programmable Array Logic; PAL) 또는 기타 명령어(instruction)를 실행하고 응답할 수 있는 임의의 다른 장 치, 전자 신호들을 처리하기 위해 구성될 수 있는 임의의 다른 장치 또는 장치들의 조합으로 실시될 수 있다. 처리 장치는 운영 체제 및 상기 운영 체제 상에서 수행되는 하나 이상의 소프트웨어 애플리케이션을 수행할 수 있다. 또한, 처리 장치는 소프트웨어의 실행에 응답하여, 데이터를 접근, 저장, 조작, 처리 및 생성할 수도 있"}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "다. 이해의 편의를 위하여, 처리 장치는 하나가 사용되는 것으로 설명된 경우도 있지만, 해당 기술분야에서 통 상의 지식을 가진 자는, 처리 장치가 복수 개의 처리 요소(processing element) 및/또는 복수 유형의 처리 요소 를 포함할 수 있음을 알 수 있다. 예를 들어, 처리 장치는 복수 개의 프로세서 또는 하나의 프로세서 및 하나의 컨트롤러를 포함할 수 있다. 또한, 병렬 프로세서(parallel processor)와 같은, 다른 처리 구성(processing configuration)도 가능하다. 상기 하드웨어 장치는 외부 장치와 신호를 주고받을 수 있는 전술된 바와 같은 통 신부도 포함할 수 있다.소프트웨어는 컴퓨터 프로그램(computer program), 코드(code), 명령어(instruction; 인스트럭션), 또는 이들 중 하나 이상의 조합을 포함할 수 있으며, 원하는 대로 동작하도록 처리 장치를 구성하거나 독립적으로 또는 결 합적으로(collectively) 처리 장치에 명령할 수 있다. 소프트웨어 및/또는 데이터는, 처리 장치에 의하여 해석 되거나 처리 장치에 명령어 또는 데이터를 제공하기 위하여, 어떤 유형의 기계, 구성요소(component), 물리적 장치, 가상 장치(virtual equipment), 컴퓨터 저장 매체 또는 장치, 또는 전송되는 신호 파(signal wave)에 영 구적으로, 또는 일시적으로 구체화(embody)될 수 있다. 소프트웨어는 네트워크로 연결된 컴퓨터 시스템 상에 분 산되어서, 분산된 방법으로 저장되거나 실행될 수도 있다. 소프트웨어 및 데이터는 하나 이상의 기계 판독 가능 기록 매체에 저장될 수 있다. 더욱이 본 발명의 기술적 해법의 대상물 또는 선행 기술들에 기여하는 부분들은 다양한 컴퓨터 구성요소를 통하 여 수행될 수 있는 프로그램 명령어의 형태로 구현되어 기계 판독 가능 매체에 기록될 수 있다. 기계 판독 가능 매체는 프로그램 명령어, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 기계 판독 가능한 기록 매체에 기록되는 프로그램 명령어는 실시 예를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 분야의 통상의 기술자에게 공지되어 사용 가능한 것일 수도 있다. 기계 판독 가능 기록 매체의 예에 는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD, Blu-ray와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령어를 저장하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령어의 예에는, 전술한 장치들 중 어느 하나뿐만 아니라 프로세서, 프로 세서 아키텍처 또는 상이한 하드웨어 및 소프트웨어의 조합들의 이종 조합, 또는 다른 어떤 프로그램 명령어들 을 실행할 수 있는 기계 상에서 실행되기 위하여 저장 및 컴파일 또는 인터프리트될 수 있는, C와 같은 구조적 프로그래밍 언어, C++ 같은 객체지향적 프로그래밍 언어 또는 고급 또는 저급 프로그래밍 언어(어셈블리어, 하 드웨어 기술 언어들 및 데이터베이스 프로그래밍 언어 및 기술들)를 사용하여 만들어질 수 있는 바, 기계어 코 드, 바이트코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 이에 포함된다. 따라서 본 발명에 따른 일 태양에서는, 앞서 설명된 방법 및 그 조합들이 하나 이상의 컴퓨팅 장치들에 의하여 수행될 때, 그 방법 및 방법의 조합들이 각 단계들을 수행하는 실행 가능한 코드로서 실시될 수 있다. 다른 일 태양에서는, 상기 방법은 상기 단계들을 수행하는 시스템들로서 실시될 수 있고, 방법들은 장치들에 걸쳐 여러 가지 방법으로 분산되거나 모든 기능들이 하나의 전용, 독립형 장치 또는 다른 하드웨어에 통합될 수 있다. 또 다른 일 태양에서는, 위에서 설명한 프로세스들과 연관된 단계들을 수행하는 수단들은 앞서 설명한 임의의 하드 웨어 및/또는 소프트웨어를 포함할 수 있다. 그러한 모든 순차 결합 및 조합들은 본 개시서의 범위 내에 속하도 록 의도된 것이다. 이상에서 본 발명이 구체적인 구성요소 등과 같은 특정 사항들과 한정된 실시 예들 및 도면에 의해 설명되었으 나, 그 실시 예들의 특정한 구조적 또는 기능적 설명은 예시를 위한 목적으로 본 발명의 보다 전반적인 이해를"}
{"patent_id": "10-2022-0181387", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "돕기 위해서 제공된 것일 뿐, 개시된 실시 예들에 본 발명이 한정되는 것은 아니며, 본 발명이 속하는 기술분야 에서 통상적인 지식을 가진 사람이라면 이러한 기재로부터 다양한 형태의 수정 및 변형을 꾀할 수 있다. 따라서, 본 발명의 기술적 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니되며, 그 기술적 사상에 포 함되는 변경 또는 대체물을 비롯하여 본 개시서에 첨부된 특허청구범위뿐만 아니라 이 특허청구범위와 균등하게 또는 등가적으로 변형된 모든 것들이 본 발명의 사상의 범주에 속한다고 할 것이다. 예를 들어, 설명된 기술들 이 설명된 방법과 다른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명 된 방법과 다른 형태로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그와 같이 균등하게 또는 등가적으로 변형된 것에는, 예컨대 본 발명에 따른 방법을 실시한 것과 동일한 결과를 낼 수 있는, 논리적으로 동치(logically equivalent)인 방법이 포함될 것인 바, 본 발명의 진의 및 범위는 전술 한 예시들에 의하여 제한되어서는 아니되며, 법률에 의하여 허용 가능한 가장 넓은 의미로 이해되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2022-0181387", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 실시 예의 설명에 이용되기 위하여 첨부된 아래 도면들은 본 발명의 실시 예들 중 단지 일부일 뿐이"}
{"patent_id": "10-2022-0181387", "section": "도면", "subsection": "도면설명", "item": 2, "content": "며, 본 발명이 속한 기술분야에서 통상의 지식을 가진 사람(이하 \"통상의 기술자\"라 함)은 별개의 발명에 이를 정도의 노력 없이 이 도면들에 기초하여 다른 도면들을 얻을 수 있다. 도 1은 본 개시서에 따른 작업자 위험 상태 판정 방법을 수행하는 컴퓨팅 장치의 예시적 구성을 개략적으로 도 시한 개념도이다.도 2는 본 개시서에 따른 작업자 위험 상태 판정 방법을 수행하는 컴퓨팅 장치를 포함하는 예시적 전체 체계의 하드웨어 또는 소프트웨어 구성요소를 개념적으로 도시한 예시적 블록도이다. 도 3는 본 개시서에 따른 작업자 위험 상태 판정 방법을 도시한 예시적 흐름도이다. 도 4는 본 개시서의 작업자 위험 상태 판정 방법에서 이용되는 센싱 장치의 센서들을 예시적으로 나타낸 도면이 다. 도 5는 본 개시서의 작업자 위험 상태 판정 방법에 따라 센서 데이터로부터 가공된 시계열 데이터를 개념적으로 나타낸 도면이다. 도 6은 본 개시서의 작업자 위험 상태 판정 방법에 이용되는 인공지능 모델의 예시로서 LSTM을 이용한 예시적 모델을 개념적으로 나타낸 도면이다."}
