{"patent_id": "10-2022-0081159", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0007237", "출원번호": "10-2022-0081159", "발명의 명칭": "AR을 이용한 광고판 관리 및 거래 플랫폼", "출원인": "주식회사 애니랙티브", "발명자": "임성현"}}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "광고주 단말로부터 제공받은 광고 시안을 광고 시안에 대응되는 AR 광고를 생성하고, 생성한 AR 광고를 AR 광고판에 표출되도록 지시하는 AR 광고판 운영사 서버; 및상기 광고주 단말로부터 제공받은 광고 시안, 광고 시안에 대응되는 AR 광고 또는 AR 광고판이 설치된 지점에대한 정보를 저장하는 DB를 포함함을 특징으로 하는 AR을 이용한 광고판 관리 및 거래 플랫폼."}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서, 상기 AR 광고판 운영사 서버에 의해 운영되는 AR 광고판은 중계 단말에 의해 출력되며,상기 중계 단말은 사용자에 의해 소지되거나 또는 운행차량 내부에 설치됨을 특징으로 하는 AR을 이용한 광고판관리 및 거래 플랫폼."}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서, 상기 AR 광고판은 상기 AR 광고판 운영사 서버를 통해 거래됨을 특징으로 하는 AR을 이용한광고판 관리 및 거래 플랫폼."}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2항에 있어서, 상기 AR 광고판은,현재 위치에서 광고 게재를 요청한 POI는 상기 POI 상에 가상으로 출력하며,이전 위치에서 광고를 제재한 POI는 스택형 배너로 출력함을 특징으로 하는 AR을 이용한 광고판 관리 및 거래플랫폼."}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 2항에 있어서, 상기 AR 광고판 운영사 서버는,상기 중계 단말의 자세가 변경되는 경우에도 설치된 지점상에 AR 광고판이 출력됨을 특징으로 하는 AR을 이용한광고판 관리 및 거래 플랫폼."}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5항에 있어서, 상기 AR 광고판 운영사 서버는,상기 AR 광고판을 출력할 수 있는 중계 단말의 위치 정보 및 상기 중계 단말이 설치된 운행차량의 이용객 정보를 수집함을 특징으로 하는 AR을 이용한 광고판 관리 및 거래 플랫폼."}
{"patent_id": "10-2022-0081159", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 5항에 있어서, 상기 AR 광고판 운영사 서버는,공개특허 10-2023-0007237-3-상기 AR 광고판에 의해 출력되는 광고의 가격 또는 광고비를 정산함을 특징으로 하는 AR을 이용한 광고판 관리및 거래 플랫폼."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 AR을 이용한 광고판 관리 및 거래 플랫폼에 관한 것으로, 더욱 상세하게는 생성한 AR 광고판을 관리 및 거래가 가능하여 수익 창출이 가능한 플랫폼에 관한 것이다. 이를 위해 본 발명의 AR을 이용한 광고판 관리 및 거래 플랫폼은 광고주 단말로부터 제공받은 광고 시안을 광고 시안에 대응되는 AR 광고를 생성하고, 생성한 AR 광고를 AR 광고판에 표출되도록 지시하는 AR 광고판 운영사 서 버; 및 상기 광고주 단말로부터 제공받은 광고 시안, 광고 시안에 대응되는 AR 광고 또는 AR 광고판이 설치된 지 점에 대한 정보를 저장하는 DB를 포함한다."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AR을 이용한 광고판 관리 및 거래 플랫폼에 관한 것으로, 더욱 상세하게는 생성한 AR 광고판을 관리 및 거래가 가능하여 수익 창출이 가능한 플랫폼에 관한 것이다."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "VR(Virtual Reality) 기술은 현실 세계의 객체나 배경 등을 CG(Computer Graphic) 영상으로 제공하며, AR(Augmented Reality) 기술은 실제 사물 영상 위에 가상으로 만들어진 CG 영상을 함께 제공하며, MR(Mixed) 기술은 현실 세계에 가상 객체들을 섞고 결합시켜서 제공하는 컴퓨터 그래픽 기술이다. 상술한 VR, AR, MR 등을 모두 간단히 XR(extended reality) 기술로 지칭되기도 한다. AR 기술은 현실세계에 가상의 디지털 이미지를 입히는 방식이다. 눈으로 실제 세계를 볼 수 있다는 점에서 눈을 가린 채 그래픽 영상만 보여주는 가상현실(VR)과는 구별된다. 실내에서만 쓸 수 있는 VR 기기와 달리 AR 글래스 는 안경처럼 걸어 다니면서 사용할 수 있어 활용성이 휠씬 다양하다. 최근 들어 차량의 네비게이션 서비스에서 고객들의 니즈에 따라 POI를 활용한 다양한 기술들이 등장하고 있다. 사용자가 AR 글래스를 착용하고 운전을 하는 경우, 이미지로부터 POI의 실제 외형을 인지하여 POI 모양(Shape) 정보를 제공해 주는 기술들도 등장하고 있다. 다양한 증강현실 기반 서비스에서 POI 모양을 AR 이미지로 실제 영상 위에 매칭시켜서 보여줄 수 있다. 다만, 종래 기술의 경우, 움직이는 영상에서의 AR 이미지와 POI 영역의 매칭시 성능 저하의 문제가 발생한다. 구체적으로, AR 이미지와 POI 영역의 정확도가 낮아서 AR 이미지가 POI 영역이 아닌 위치에 디스플레이 되므로, 사용자는 이에 대한 불편함을 느끼게 된다. 또한, 현재 차량을 탑승한 승객을 포함한 사용자의 흥미를 유발하기 위한 AR을 이용한 광고판에 대한 다양한 기 술이 개발되고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2185614호(발명의 명칭: Ar 광고 간판 컨텐츠를 제공하는 시스템 및 방법) (특허문헌 0002) 한국공개특허 제2019-0107286호(발명의 명칭: 차량용 광고 제공 장치 및 차량용 광고 제공 방 법)"}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 AR 광고판을 생성하는 방안을 제안함에 있다 본 발명이 해결하고자 하는 다른 과제는 자세가 변경되더라도 정해진 위치에 광고판이 표출되도록 하는 방안을 제안함에 있다. 본 발명이 해결하고자 하는 또 다른 과제는 AR 광고판을 관리 및 거래할 수 있는 방안을 제안함에 있다. 본 발명이 해결하고자 하는 또 다른 과제는 수익 창출이 가능한 AR 광고판을 제안함에 있다."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해 본 발명의 AR을 이용한 광고판 관리 및 거래 플랫폼은 광고주 단말로부터 제공받은 광고 시안을 광고 시안에 대응되는 AR 광고를 생성하고, 생성한 AR 광고를 AR 광고판에 표출되도록 지시하는 AR 광고판 운영사 서 버; 및 상기 광고주 단말로부터 제공받은 광고 시안, 광고 시안에 대응되는 AR 광고 또는 AR 광고판이 설치된 지점에 대한 정보를 저장하는 DB를 포함한다."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 AR 광고판 관리 및 거래 플랫폼은 가상의 AR 광고판을 이용하여 수익을 창출할 수 있으며, 또한, 일반 광고판과 동일하게 거래가 가능하다는 장점이 있다. 특히, 차량 내에 AR 광고를 시청할 수 있는 단 말을 설치하는 경우, 차량을 운행하는 차량 운행사 역시 별도의 광고비를 지급받을 수 있다. 특히 본 발명은 이동하는 차량의 자세에 변경되는 경우 차량의 기준으로 객체의 상대적인 위치가 변경되더라도 변경된 객체의 위치에 산출하여 AR 광고판을 정해진 위치 정확하게 매칭되도록 출력하여 사용자의 신뢰성을 높 일 수 있다 이외에도 본 발명은 AR 광고판 주변의 사용자의 위치 정보를 실시간으로 분석하여 광고 효과를 극대화할 수 있 는 장점이 있다."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한, 그리고 추가적인 본 발명의 양상들은 첨부된 도면을 참조하여 설명되는 바람직한 실시 예들을 통하여 더욱 명백해질 것이다. 이하에서는 본 발명의 이러한 실시 예를 통해 당업자가 용이하게 이해하고 재현할 수 있 도록 상세히 설명하기로 한다. 도 1은 본 발명의 일실시 예에 따른 AR 광고판의 표출 형태를 도시하고 있다. 이하 도 1을 이용하여 본 발명의 일실시 예에 따른 AR 광고판의 표출 형태에 대해 알아보기로 한다. 도 1에 의하면, AR 광고판은 차량이나 유동인구가 많은 거리 또는 인구 밀집 지역에 설치되는 것이 바람직하다. 본 발명에서 제안하는 AR 광고판은 실제 거리상에 설치되는 광고판이 아니라 가상의 광고판이다. AR 광고판 관리 및 거래 플랫폼은 사용자의 위치정보를 활용한 통계자료를 제공하므로, 식당뿐만 아니라 다양한 분야의 광고 제공이 가능하다. 이를 위해 본 발명에서 제안하는 AR 광고판 관리 및 거래 플랫폼은 사용자의 위 치 정보를 수집 및 분석하며, 필요한 경우 외부 서버로부터 사용자의 위치 정보를 포함한 다양한 정보를 제공받 을 수 있다. 또한, 본 발명은 표출되는 광고를 시청하는 차량 또는 사용자의 자세가 변경되더라도 정확한 위치에 표출되어야 한다. 즉, 차량 또는 사용자의 자세(위치)가 변경되는 경우, AR 광고판은 차량이나 사용자의 위치가 상관없이 실제 광고판과 동일하게 정해진 지점에 고정된 형태로 표출되어야 한다. 물론 차량이나 사용자와 상관없이 AR광고판 자체 설정된 프로그램에 의해 광고판의 위치가 변경되는 경우에는 논외로 한다. 따라서 본 발명은 AR 광 고판을 생성하는 방안에 대해 살펴본 후 AR 광고판을 거래하는 거래 플랫폼에 대해 알아보기로 한다. 도 2는 본 발명의 일실시 예에 따른 AR(Augmented Reality) 엔진 모듈의 구성에 대해 살펴보기로 한다. 이하 도 2를 이용하여 본 발명의 일실시 예에 따른 AR 엔진 모듈의 구성에 대해 상세하게 알아보기로 한다. 본 발명은 AR 엔진 모듈을 이용하여 AR 광고판을 구현한다. 본 발명과 관련하여 AR 엔진 모듈은 정보수집 모듈, AR 맵핑 모듈 및 AR 렌더링/객체관리 모듈 을 포함한다. 물론 상술한 구성 이외에 다른 구성이 본 발명에서 제안하는 AR 엔진 모듈에 포함될 수 있으며, 해당 AR 엔진 모듈은 차량 내에 설치되는 중계 단말 또는 AR 메인서버 중 적어도 어느 하나의 서버에 설치될 수 있다. 이하에서는 이동하는 객체가 차량인 경우에 대해 설명하기로 하나, 이동하는 객체가 사용자 단 말인 경우에도 동일하게 적용될 수 있다. 정보 수집 모듈은 차량의 위치 및 이동하는 주변 영상을 수집한다. 정보 수집 모듈은 차량에 장착된 카메라를 이용하여 촬영한 영상에서 AI-ML(인공지능-머신러닝) 기반으로 POI 객체를 검출, 구분 (classification) 또는 분할하는 기능을 수행한다. 또한, 정보 수집 모듈은 RTK, GPS, 자이로센서 또는 라 이다 센서 등 차량에 장착된 복수의 센서를 이용하여 지능형 운전자 보조 시스템(ADAS Advanced Driver Assistance System)을 구현한다. 레이더를 이용한 객체 감지는 송신된 전파가 수신되는데 소요되는 시간을 측정하여 물체를 감지하는 방식이다. 레이더는 사각지대 감지, 차선 변경 보조, 전방 충돌 경고 및 자동 비상 제동 등 다양한 분야에 적용된다. 라이다는 레이더와 유사한 원리로 작동하지만, 주변 환경의 고해상도 3D 이미지를 생성하기 위해 라이다를 발사 하여 산란되거나, 반사되는 라이더가 돌아오는 시간과 강도, 주파수의 변화, 편광 상태의 변화 등으로 측정 물 체와의 거리, 속도, 형상 등 물리적인 성질을 측정한다. 이외에도, 본 발명은 차량의 내부에 카메라를 설치하며, 설치된 카메라를 이용하여 사용자의 시선을 추적한다. 즉, 정보 수집 모듈은 차량의 내부에 설치된 카메라를 이용하여 사용자의 눈을 촬영하며, 촬영된 사용자의 눈을 분석하여 사용자의 시선을 추적한다. AR 맵핑 모듈은 카메라의 공간분석 기법을 이용하여 도로의 특징(도로면, 차선), 교통 표지판, 교통신호 등과 같은 2D 위치 정보를 3D 공간상의 좌표로 변환한다. 이에 대해서는 후술하기로 한다. AR 렌더링/객체관리 모듈은 다양한 AR 정보를 화면에 실시간 디스플레이 하기 위해 실시간 렌더링을 수행 한다. 즉, 본 발명에서 제안하는 디스플레이는 다양한 형태로 구현될 수 있으며, 이에 따라 구현하고자 하는 디 스플레이 형태에 따라 상이한 기법으로 렌더링을 수행한다. 일 예로, 빔 프로젝터를 이용하여 AR 영상의 출력을 원할 경우에는 빔 프로젝터에서 AR 영상 출력 가능하도록 렌더링을 수행한다. 도 3은 본 발명의 일실시 예에 따른 AR 엔진 플랫폼의 구성을 도시하고 있다. 이하 도 3을 이용하여 본 발명의 일실시 예에 따른 AR 엔진 플랫폼에 대해 상세하게 알아보기로 한다. 상술한 바와 같이 AR 플랫폼은 차량 내에 설치되는 중계 단말 또는 AR 메인서버 중 적어도 어느 하나의 서버에 설치되어 구성될 수 있다. 본 발명에서 제안하는 AR 광고판을 정해진(설정된) 지점에 매칭되도록 출력하기 위해서는 상술한 바와 같이 정 보 수집 모듈, AR 맵핑 모듈 및 AR 렌더링/객체 관리 모듈을 포함한다. 정보 수집 모듈은 영상기반 객체구분모듈(AR Classification Module), AR 위치 획득모듈(AR Location Module), AR 센서(AR Sensor), 인터페이스 관리모듈(Sensor Signal/Data Interface Manager Module)을 포함한다. 영상기반 객체구분모듈은 차선, 표지판 또는 교통신호 등 객체를 검출하여 구분하는 기능을 수행한다. AR 위치 획득모듈은 GPS, RTK 등을 이용하여 차량의 현재 위치를 산출한다. AR 센서는 자이로 센서, 가속도 센서 등을 포함하며, AR 센서를 이용하여 객체와의 거리, 객체의 위 치 등을 산출한다. AR 센서는 차량에 장착된 라이더, 레이더, ADAS 등을 사용하지 못하는 경우, 전방에 설 치된 카메라로부터 지상실측정보(Ground Truth) 기반 도로 맵핑 정보를 획득하여 차량의 Roll, Pitch , Yaw 값 을 획득한다. 이에 대해 구체적으로 살펴보면, 차량에 장착된 AR 위치 획득모듈인 GPS, RTK로부터 획득된 정보를 기반으 로 구면 좌표계의 위치 정보를 평면 좌표계의 위치 정보인 (X, Y) 좌표를 산출한다. 본 발명은 상술한 바와 같이 GPS, RTK 중 어느 하나로부터 위치 정보를 획득하는 것이 아니라, 2개의 모듈로부터 위치 정보를 획득하여 차량의 Roll, Pitch, Yaw 값을 획득한다. GPS 좌표인 구면 좌표를 네비게이션 좌표인 평면 좌표로 변환하는 과정은 다음과 같이 진행된다. 먼저 GPS 좌표를 제1 좌표로 변환하며, 제1 좌표를 제2 좌표로 변환한다. 이후 제2 좌표를 카메라 좌표로 변환 한다. 일 예로 제1 좌표는 ECEF 좌표(Earth-centered Earth-fixed coordinate)일 수 있으며, 제2 좌표는 네비 게이션 좌표인 ENU 좌표일 수 있다. 본 발명은 이동하는 차량에 설치된 정보 출력장치를 이용하여 설정된 지점에 AR 광고판이 매칭되도록 출력하는 것을 목표로 한다. 본 발명과 관련하여 차량은 이동하는 고정된 위치를 유지하는 것이 아니라, 주행하는 도로의 상태, 주행 방향, 주행 속도 등에 따라 차량의 자세가 달라지며, 이에 따라 차량에서 바라보는 설정된 지점의 상대적인 좌표를 달라지게 된다. 따라서, 본 발명은 차량의 자세를 고려한 설정된 지점의 카메라 좌표를 산출하 며, 산출된 설정된 지점의 카메라 좌표를 고려하여 AR 광고판을 출력한다. 본 발명에서 제안하는 카메라 좌표는 카메라에서 바라보는 AR 광고판을 매칭하는 설정된 지점의 좌표이다. 이하에서는 제2 좌표를 카메라 좌표로 변환하는 방법에 대해 알아보기로 한다. 제2 좌표를 카메라 좌표로 변환 하기 위해 카메라 투영 행렬에 제2 좌표 벡터를 곱한다. 카메라 투영 행렬에 제2 좌표 벡터를 곱하면 결과는 벡 터 [v0, v1, v2, v3]가 된다. 이후 x = (0.5 + v0 / v3) * widthOfCameraView 및 y = (0.5 - v1 / v3) * heightOfCameraView이다. 제2 좌표 벡터는 [n -e u 1]이고, 카메라 투영 행렬은 원래 카메라 투영 행렬과 회전 행렬을 곱한 결과이다. 카메라 투영 행렬은 다음과 같다."}
{"patent_id": "10-2022-0081159", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "회전 행렬은 차량에 장착된 센서로부터 획득할 수 있다. 본 발명은 GPS 좌표를 네비게이션 좌표로 변환하며, 이 후 네비게이션 좌표를 카메라 좌표로 변환한다. AR 3D 맵핑모듈은 지상실측정보(Ground Truth) 기반으로 지형을 인식한다. 또한, AR 3D 맵핑모듈은 인공지능기반 객체 분류 기술을 이용하여 도로 주변의 주요 형태를 인식한다. 일 예로 AR 3D 맵핑모듈은 도로 주변의 주요 형태인 차선, 인도, 표지판, 문자인식, 주변의 차량, 사람, 오토바이 등을 인식한다. 이하에서는 인공지능을 이용하여 객체를 분류하여 주변 공간을 인식하는 방법에 대해 간략하게 알아보기로 한다. 비전(Vision)은 본 발명에서 제안하는 AR 엔진에 필요한 기본 SDK(Software Development Kit) 이다. 비전은 카 메라 배열, 객체 검출/구분/분할, 차선 특징 추출, 기타 인터페이스를 가능하게 한다. 비전은 비전 코어에서 실행되는 실시간 추론을 액세스한다. 비전 AR은 맞춤형 증강 현실을 구현하는데 사용되는 비전(Vision)용 애드온 모듈이다. 비전 AR은 차선 재질(lane material), 차선 구조(lane geometry), 차선가림 (Occlusion), 사용자 지정 객체 등 사용자의 경로를 시각화한다. 비전 세이프티(Vision Safety)는 과속, 주변 차량, 자전거 이용자, 보행자, 차선 이탈 등에 대한 맞춤형 경고를 생성하는데 사용되는 Vision용 애드온 모듈 이다. 상술한 비전 코어(Vision core)는 모든 기계 학습 모델을 포함하는 시스템의 핵심 로직이며, Vision을 프로젝트 로 가져오면, Vision core가 자동으로 제공된다. AR 3D 스페이스 모듈은 인공지능으로 획득된 공간인식과 3D 지형정보 매쉬업 서비스를 이용하여 실제 차량 의 위치를 3D 지형정보에 맵핑한다. 이에 대해 구체적으로 살펴보면, 차량의 전방에 위치한 전방 카메라의 촬영 한 영상으로부터 차량의 정확한 헤딩값을 산출하며, 주변의 주요 객체의 위치좌표를 이용하여 차량의 실시간 위 치를 보정한다. 이를 위해 AR 3D 스페이스 모듈은 차량이 주행하는 주행 경로 상의 주요 객체(표지판, 신 호등 등)에 대한 위치좌표를 저장한다. 헤딩값의 주요 포인트로는 교차점, 분기점 등이 포함된다.맵핑한 3D 지형정보에 차량에 설치된 카메라로부터 촬영된 영상으로부터 실제 차량의 위치 추정 및 카메라 인식 범위 내에서 미리 로딩된 데이터를 기준으로 사전에 설정 지점의 AR 광고판을 인식해 두어 렌더링 시 해당 위치 를 지날 때 즉시 출력할 수 있도록 한다. AR 렌더링 및 객체관리 모듈은 AR 렌더링 및 객체를 관리한다. AR 렌더링은 표준화된 위치인식 아이콘을 출력하면 사용자의 브랜드 및 프리미엄 등록 여부에 따라 저폴리곤, 고폴리곤 형태의 3D 정보를 제공하여 사용 자의 호기심을 끌 수 있도록 한다. 객체관리 모듈은 각 지형지표를 3x3 미터로 고유한 단어조합의 이름을 가지 는 ID로 명명하며, 해당 ID 마다의 메타데이터를 관리한다. AR 맵핑 모듈은 부가정보를 출력하는 디스플레이의 형태에 따라 부가정보를 POI에 맵핑한다. AR 맵핑 모듈은 AR 와핑(Warping)모듈, AR 3D 맵핑모듈, 3D space 매핑 모듈을 포함한다. 즉, AR 맵핑 모듈은 AR 와핑(Warping)모듈, AR 3D 맵핑모듈, 3D 스페이스 맵핑모듈을 포함하며, 이외에도 3D 객 체 관리모듈을 포함한다. AR 플랫폼은 다양한 형태의 디스플레이 모듈을 포함한다. 디스플레이 모듈은 AR HUD 뷰 모듈, AR overlay 뷰 모듈, AR camera 뷰 모듈 등 다양한 형태로 구현될 수 있다. 이외에도 AR 렌더링 및 객체관리 모 듈은 AR 뷰를 관리는 AR 뷰 관리모듈을 포함한다. 도 4는 본 발명의 일실시 예에 따른 AR 서비스 시스템의 구성도이다. 이하 도 4를 이용하여 본 발명의 일실시 예에 따른 AR 서비스 시스템에 대해 알아보기로 한다. AR 서비스 시스템은 중계 단말, AR 메인서버 및 연동 시스템을 포함한다. 물론 상술한 구성 이 외에 다른 구성이 본 발명에서 제안하는 AR 서비스 시스템에 포함될 수 있다. 중계 단말은 차량에 설치되거나, 단말 형태로 구현될 수 있다. 일 예로 중계 단말은 다양한 정보를 수집할 수 있는 센서와 연결되어 있거나 내장된 구성이라면 이에 포함된다. 중계 단말은 GPS 또는 RTK를 이용하여 위치를 측위하며, 중계 단말이 장착된 차량의 최적의 위치(자 세)를 판단한다. 또한, 중계 단말은 카메라로부터 수집된 영상을 이용하여 영상 기반 3D 위치를 측위한다. 중계 단말에 상세한 기능에 대해서는 도 5에서 설명하기로 한다. AR 메인서버는 GPS 또는 RTK를 이용하여 산출한 측위 또는 카메라로부터 수집된 영상을 이용한 VPS(Visual Positioning Service) 기반 측위를 AR 3D에 매핑하는 기능을 수행한다. AR 메인서버의 상세한 동작에 대해서는 도 6에서 살펴보기로 한다. 연동시스템은 AR 메인서버와 연결되며, AR 메인서버로 필요한 데이터 또는 정보를 제공한다. 연 동시스템은 AI 데이터 허브(외부 오픈 데이터포털), 컨텐츠 제공서버(광고 컨텐츠 등), 지도 데 이터 제공서버(3D 모델, 공간정보), 공공데이터 제공서버(주요 시설물 정보)를 포함할 수 있다. AI 데이터 허브는 AR 메인서버로 도시 데이터를 제공하며, 컨텐츠 제공서버는 AR 메인서버로 동영상/ 이 미지를 제공한다. 또한, 3D 공간지도 데이터 제공서버는 AR 메인서버로 3D 모델링 지도데이터를 제공하며, 공공데이터 제공서버는 AR 메인서버로 보정용 위치 데이터인 주요 시설물(가로등, 신호등 등)에 대한 데이 터를 제공한다. 도 5는 본 발명의 일실시 예에 따른 중계 단말의 구성을 도시하고 있다. 이하 도 5를 이용하여 본 발명의 일실 시 예에 따른 중계 단말의 구성에 대해 상세하게 알아보기로 한다. 상술한 바와 같이 중계 단말은 GPS 또는 RTK를 이용하여 위치를 측위하는 구성과 영상을 이용하여 위치를 보정 하는 구성, 3D 맵핑하는 구성 및 차량의 최적 위치를 판단하여 출력하는 구성으로 구분된다. 이하에서는 해당 구성에 대해 순차적으로 알아보기로 한다. 입력모듈은 기기 정보 또는 회원정보를 입력하며, 어플리케이션 설정과 관련된 기능을 등록한다. UI 매니저(관리)모듈은 AR 정보 연동을 위한 서비스 및 사용자 ID를 관리한다. UI 관리모듈은 입력모 듈이 입력한 정보에 따라 사용자를 관리하거나, 서비스를 지원한다. 물론 UI 관리모듈은 입력모듈로 필요한 정보를 입력할 수 있도록 UI를 지원한다. AR 위치 획득모듈은 GPS 또는 RTK 연결 여부 및 연결에 따른 위도/경도를 획득한다. AR 센서는 가속 도센서, 자이로센서 또는 컴퍼스(compass) 등을 포함하며, 중계 단말이 장착된 차량의 방향, 속도, 가속도 등을획득한다. AR 위치 획득모듈 및 AR 센서에서 획득한 정보는 위치 판단/보정모듈로 제공된다. 위치 판단/보 정모듈은 GPS, RTK 또는 VPS 순으로 우선순위를 판단하여 차량의 위도 및 경도를 결정한다. 물론 위치 판 단/보정모듈은 후술할 영상기반 위치확인 맵핑모듈에서 맵핑된 객체의 특징점(VPS)을 제공받아 차량의 위 도 및 경도를 결정한다. AR 방향 자세 획득모듈은 위치 판단/보정모듈에서 판단한 차량의 위치 및 경도를 이용하여 차량의 방 향 및 자세 정보를 획득한다. 즉, AR 방향 자세 획득모듈은 자이로 센서 또는 가속도 센서 또는 IMU(Inertial Measurement Unit) 등으로부터 수집된 정보를 이용하여 차량의 방향 및 자세 정보를 획득한다. 객체 판단모듈은 카메라로부터 획득된 영상으로부터 도로, 인도, 상점 또는 건물 등 객체를 판단한다. AR 카메라 뷰 관리모듈은 AR 화면 제공을 위해 카메라의 화각(FOV)과 AR 카메라, 즉 실세계 카메라 영상좌표 를 3D 공간 내 카메라 좌표로 변환하는 파라미터를 생성하며, 디지털 트윈/미러 환경 내 3D 좌표를 맵핑한다. 영상기반 객체 구분모듈은 카메라에서 촬영된 영상에서 AI 기술을 이용하여 도로, 인도, 횡단보도, 표지판, 사람, 자동차 등 객체를 구분한다. 영상기반 위치확인 맵핑모듈은 AR 서버에 저장된 포인트 클라우드 정보를 위도/경도 기반 정의된 반경 내 데이터를 수신/다운로드하여 디바이스 메모리에 저장하며, 실시간으로 카메라 입력영상과 특징점을 맵핑한다. 즉, 영상기반 위치확인 맵핑모듈은 카메라로부터 입력된 영상에서 구분된 표지판, 신호등, 횡단보드의 특 징점을 기저장된 객체의 특징점에 매핑한다. AR 로컬캐싱 처리 동기화 알고리즘 모듈은 정해진 반경 내 또는 일정 구역기반 저장된 AR 맵핑 데이터를 기반으로 AR 메인서버 데이터와 비교 확인하여 동기화를 결정한다. AR 3D 객체 부가정보 수신모듈은 AR 메인서버로부터 부가정보를 포함한 3D 및 미디어 데이터를 수신받아 로컬 저장소에 저장하며, AR 화면에 표출할 수 있도록 부가정보를 로딩한다. AR 오버레이 뷰 모듈은 카메라가 바라보는 시야각 및 정보 출력장치의 위치에 따라 변화되는 위치 자세에 따라 3D 및 미디어 데이터를 병합하여 출력한다. AR 화면 출력모듈은 콘텐츠와 병합된 오버레이뷰, UI 및 지도를 함께 출력한다. 이와 같이 본 발명은 이동하는 차량의 위치 및 자세를 고려하여 객체에 부가정보를 정확하게 매칭되도록 출력하 는 방안을 제안한다. 도 6은 본 발명의 일실시 예에 따른 AR 메인서버의 구성을 도시하고 있다. 이하 도 6을 이용하여 본 발명의 일 실시 예에 따른 AR 메인서버의 구성에 대해 상세하게 알아보기로 한다. GPS 위치기반 컨텐츠 요청모듈은 중계 단말로부터 요청된 GPS 위치 및 방향 데이터 기반으로 제공될 AR 컨 텐츠의 위치기반 데이터 요청을 위한 쿼리를 제작한다. AR 서비스 가능영역 확인모듈은 GPS 위치기반 컨텐츠 요청모듈에서 작성된 쿼리 기반 공공데이터 또 는 3D 데이터를 확인하여 기본적으로 위도/경도/방향 기반 정보제공이 가능한 영역인지, 부가적으로 VPS 기반 정보제공이 가능한 영역인지 확인한다. 사용자 맞춤형정보 처리시스템은 공공데이터, 3D 데이터 기반 다양한 POI 정보를 기반으로 사용자의 서비 스 설정에 따라 데이터 필터링 조건을 설정한다. 위도/경도 기반 공공데이터 연동모듈은 개인화 필터 조건에 따른 관련 데이터를 공공데이터(도로, 교차로 정보 등)로부터 수집하여 송신 데이터로 정렬한다. 위도/경도 기반 3D 데이터 연동모듈은 AR 화면에 위치기반 3D 입체 구현을 위해 3D 빌딩 등 AI 데이터 허 브로부터 도시 데이터를 수집하여 3D 지도에 반영한다. AR 서비스 컨텐츠 관리 모듈은 AR 서비스 컨텐츠를 관리하는 시스템으로 내부서버(또는 정보 출력장치) 제 공용 미디어 데이터의 등록/수정/삭제/조회/파일 업로드/다운로드 기능을 수행한다. 3D 공간지도 스캔모듈은 시각 기반 위치 파악을 할 경우, 실제 장소에서 확보한 파노라마 영상을 기반으로 특징점을 추출하여 이를 서버에 저장한다.3D 공간지도 연산모듈은 추출된 특징점을 기반으로 이동된 특징점의 위치 관계를 통해 3D 공간 내 해당 특 징점들을 포인트 클라우드 라이브러리(PCL)로 저장한다. 3D 공간지도 DB는 저장된 PCL이 실제 세계의 위도/경도 위치에 정밀하게 맵핑하여 3D 공간지도를 구축함으 로써 영상기반 위치추적으로 활용된다. 위치파악 데이터 전송모듈은 내부서버(또는 정보 출력장치)의 카메라 기반 VPS를 위한 PCL 데이터 구역별 전송한다. AR 서비스 제공용 3D 데이터 변환 및 미디어 처리시스템은 AR 화면에 3D 입체 처리를 위한 3D 빌딩 등 디 지털트윈(미러월드 데이터)로부터 3D 모델 및 공간정보를 기반으로 데이터를 준비한다. AR 서비스 처리모듈은 디바이스에서 요청된 UI 레이어 서비스 설정에 따라 증강 스트리트(Street)/시이니 지(Signage)/시설물/메세지 데이터를 전송한다. 이외에도 AR 메인서버는 회원 및 권한 관리모듈, 모니터링모듈 또는 관리모듈을 포함한다. 이하에서는 본 발명에서 제안하는 AR 광고판을 관리 및 거래하는 것이 가능한 플랫폼에 대해 알아보기로 한다. 본 발명에서 제안하는 AR 광고판 관리 및 거래 플랫폼은 ① AR 광고판 생성 후 광고판 구매 희망자에게 AR 광고 판의 소유권 판매 ② AR 광고 계약을 위한 통계자료 및 광고 게재 수수료 산출 ③ 광고판 구매 희망자간 AR 광 고판의 소유권 거래 등을 지원한다. 특히, AR 광고 계약을 위한 통계자료 및 광고 게재 수수료 산출은 AR 광고 판별로 광고 효율을 파악할 수 있는 위치정보 분석 제공, AR 광고 템플릿 제공 및 검수, AR 광고 게재 및 AR 광 고비 중개 등을 지원한다. 또한, 제휴 사용자간 AR 광고판의 소유권 거래는 AR 광고판에 대한 가격 정보를 공개 하여 가상자산화하며, 특히, 가상자산을 지키는 보안 시스템을 제공한다. 도 7은 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 지원하는 광고판 형태를 도시하고 있다. 이하 도 7을 이용하여 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 지원하는 광고판 형태에 대해 알아보기로 한다. 도 7에 의하면, AR 광고판 관리 및 거래 플랫폼에서 지원하는 광고판은 가상의 광고판 형태를 지원한다. 도 7은 본 발명의 다른 실시예에 의한 AR 광고판 관리 및 거래 플랫폼에서 지원하는 광고 표출 방식을 도시하고 있다. 도 1에서 제안하는 AR 광고판 관리 및 거래 플랫폼은 가상의 광고판에 광고를 표출(게재)하는 반면, 도 7 에서 제안하는 광고는 POI에 대한 정보를 제공하는 방식으로 광고를 표출한다. 특히, 도 7은 이동수단에 의해 이동하는 상태에서 광고를 표출하며, 이전에 표출된 광고는 스택형 배너 형태로 표출된다. 사용자는 필요한 경 우 스택형 배너에 표시된 광고 중 원하는 광고를 확인할 수 있다. 물론 이전에 표출되는 광고는 스택형 배터 형태 이외에 다른 형태로 표출 가능하다. 도 7에 의하면, 스택형 배너에 스타벅스, 자금성, 베스킨31, 서울시청 관련 광고가 표출되어 있으며, 사용자는 표출된 광고 중 상세 정보를 원하는 광고에 대해서는 다양한 방식 중 어느 하나의 방식으로 요청하여 확인할 수 있다. 스택형 배너에 표시되는 광고는 이동수단이 이동함에 따라 업데이트된다. 또한, 광고판은 사용자가 이동 하는 경로 상에 위치한 광고를 중심으로 게재함으로 사용자의 광고 표출 효과를 높일 수 있다. 도 8은 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 제안하는 서비스 모델을 도시하고 있다. 도 8에 의하면, AR 광고판 관리 및 거래 플랫폼은 플랫폼 내에서 AR 광고판을 거래하거나 관리하는 것이 가능하다. 즉, AR 광고판을 생성한 분양자는 AR 광고판 관리 및 거래 플랫폼을 이용하여 피분양자(광고판 구매 희망자)에게 분양한다. 분양되는 AR 광고판은 거래 환경에 따라 분양대금 등 상이한 형태로 분양된다. 거래 환 경은 유동인구, 위치, 크기 등을 포함한다. 광고판을 분양받은 피분양자는 AR 광고판에 광고를 표출할 광고주를 모집한다. 피분양자는 광고주와 광고 계약 을 체결하며, 광고 계약이 완료되면 해당 AR 광고판에 광고를 게재한다. 이를 위해 AR 광고판 관리 및 거래 플 랫폼은 광고비 정산 프로그램을 포함하며, 포함된 광고비 정산 프로그램을 이용하여 광고비를 이해관계인들에게 정산한다. 물론 피분양자는 분양받은 AR 광고판을 재판매할 수 있음은 자명하다. 도 9는 본 발명에서 제안하는 광고판의 형태를 도시하고 있다. 도 9에 의하면, 광고판은 다양한 형상이나 정보 를 포함할 수 있다. 일 예로 제1 유형은 해당 광고물의 대표 아이콘, 상점명, 연락처, 상세링크, 대표 아이콘 또는 이미지 중 적어도 어느 하나를 포함한다. 제2 유형은 비행선, 상점명, 거리, 연락처, 이미지 중 적어도 어 느 하나를 포함한다. 이외에도 다양한 유형으로 광고판을 구성할 수 있다.도 10은 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 수수료를 정산하는 과정을 도시하고 있다. 이하 도 10을 이용하여 AR 광고판 관리 및 거래 플랫폼에서 수수료를 정산하는 과정에 대해 상세하게 알 아보기로 한다. 특히, 도 10은 본 발명에서 제안하는 AR 광고판 관리 및 거래 플랫폼에서 광고를 게재하는 과정을 도시하고 있 다. 광고주 단말은 AR 광고판 관리 및 거래 플랫폼으로 광고 시안을 제공한다.(S1000) AR 광고판 관리 및 거래 플랫폼은 AR 광고를 표출할 AR 운영사(AR 운영사 서버)로 AR 광고를 표출하기 위한 AR 광고 프로그램 설치를 요청한다. 본 발명과 관련하여 AR 운영사는 버스 운행회사, 택시 운행회사 등과 같은 이 동수단을 운영하는 회사를 포함한다. 이외에도 AR 운영사는 이동수단 이외에 다른 장비를 운영하는 회사가 포함 된다.(S1010) AR 광고판 관리 및 거래 플랫폼은 AR 운영사로부터 운행하는 이동수단의 위치 정보를 포함한 승객 정보 등을 제 공받으며, 제공받은 정보를 기반으로 시설 운용 수수료를 산출한다. 즉, 이동수단이 광고효과가 높은 경로를 운 행하거나, 이동수단을 이용하여 승객의 수가 많은 경우에는 상대적으로 높은 운용 수수료가 산출된다. 이외에도 AR 광고판 관리 및 거래 플랫폼은 다양한 방식으로 시설 운용 수수료를 산출하는 것이 가능하다. 또한, 필요한 경우, AR 광고판 관리 및 거래 플랫폼은 사용자 단말로 제공할 AR 광고 어플리케이션을 저장하며, 필요한 경우 사용자 단말로 AR 광고 어플리케이션을 제공한다. 사용자 단말은 제공받은 AR 광고 어플리케이션을 다운로드받아 설치한다. AR 광고판 관리 및 거래 플랫폼는 설치된 AR 광고판에 광고를 게재한다. 사용자는 사용자 단말을 이용하여 AR 광고를 시청하거나, 이동수단 상에 설치된 표시수단을 이용하여 AR 광고를 시청한다. 물론 사용자는 상술한 바 와 같이 상세 정보 확인이 요구되는 광고에 대해서는 다양한 방식 중 어느 하나의 방식을 이용하여 요청한 다.(S1020) 본 발명은 도면에 도시된 일실시 예를 참고로 설명되었으나, 이는 예시적인 것에 불과하며, 본 기술 분야의 통 상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시예가 가능하다는 점을 이해할 것이다."}
{"patent_id": "10-2022-0081159", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시 예에 따른 AR 광고판의 표출 형태를 도시하고 있다. 도 2는 본 발명의 일실시 예에 따른 AR(Augmented Reality) 엔진 모듈의 구성을 도시하고 있다. 도 3은 본 발명의 일실시 예에 따른 AR 플랫폼의 구성을 도시하고 있다. 도 4는 본 발명의 일실시 예에 따른 AR 서비스 시스템의 구성도이다. 도 5는 본 발명의 일실시 예에 따른 중계 단말의 구성을 도시하고 있다. 도 6은 본 발명의 일실시 예에 따른 AR 메인서버의 구성을 도시하고 있다. 도 7은 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 지원하는 광고판 형태를 도시하고 있다. 도 8은 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 제안하는 서비스 모델을 도시하고 있다. 도 9는 본 발명에서 제안하는 광고판의 형태를 도시하고 있다. 도 10은 본 발명의 일실시 예에 따른 AR 광고판 관리 및 거래 플랫폼에서 수수료를 정산하는 과정을 도시하고 있다."}
