{"patent_id": "10-2019-0149109", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0061523", "출원번호": "10-2019-0149109", "발명의 명칭": "필기 입력을 텍스트로 변환하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "젤레즈니아코브, 드미트로"}}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에서 필기 입력(handwriting input)을 텍스트로 변환하는 방법에 있어서,필기 입력에 관한 정보를 획득하는 단계;상기 필기 입력과 대응되는 적어도 하나의 문자를 인식하는 단계;상기 인식된 적어도 하나의 문자가 순서대로 배열된 문자 시퀀스 및 상기 적어도 하나의 문자에 대한 기하학적정보를 획득하는 단계; 상기 문자 시퀀스 및 기하학적 정보에 기초하여, 수식 구조에 따라 상기 적어도 하나의 문자가 다르게 표현된,적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어를 획득하는 단계; 및 상기 적어도 하나의 스코어에 기초하여, 상기 적어도 하나의 후보 텍스트 중 적어도 하나의 텍스트를 선택함으로써, 상기 필기 입력을, 상기 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환하는 단계를 포함하는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 문자 시퀀스 및 기하학적 정보는,상기 필기 입력과 대응되는 적어도 하나의 스트로크에 관한 특징 정보가 순서대로 RNN 모델에 입력됨으로써, 획득되는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 적어도 하나의 스트로크는각각의 스트로크의 위치에 따라 분류된 클러스터별로 정렬되고,상기 문자 시퀀스는, 상기 클러스터별로 정렬된 적어도 하나의 스트로크에 관한 특징 정보가 상기 RNN 모델에입력됨으로써, 획득되는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 적어도 하나의 스코어는,공간 관계 모델, PCFG 모델, 언어 모델, 및 패널티 모델 중 적어도 하나의 문법 모델에 기초하여, 획득되는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 공간 관계 모델에 기초하여, 상기 문자 시퀀스의 적어도 두 개의 문자들 간의 공간 관계 R이 결정되고,상기 언어 모델에 기초하여, 상기 적어도 두 개의 문자들에 대해, 상기 공간 관계 모델에 의하여, 상기 공간 관계 R이 결정될 확률이 결정되는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 적어도 하나의 스코어는,CYK 알고리즘에 따라, 상기 문자 시퀀스의 적어도 두 개의 문자가 순차적으로 결합됨으로써, 획득되는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2021-0061523-3-제6항에 있어서, 상기 적어도 하나의 스코어는상기 CYK 알고리즘에 따라, 제1 레벨에서 획득된 상기 문자 시퀀스의 각 문자에 대한 터미널 스코어, 및 각 레벨에서 결합된 문자들에 대하여, 적어도 하나의 문법 모델에 기초하여 획득된 바이너리 스코어에 기초하여, 획득되는, 방법."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "필기 입력을 텍스트로 변환하는 전자 장치에 있어서,필기 입력에 관한 정보를 획득하고, 상기 필기 입력과 대응되는 적어도 하나의 문자를 인식하고,상기 인식된 적어도 하나의 문자가 순서대로 배열된 문자 시퀀스 및 상기 적어도 하나의 문자에 대한 기하학적정보를 획득하고,상기 문자 시퀀스 및 기하학적 정보에 기초하여, 수식 구조에 따라 상기 적어도 하나의 문자가 다르게 표현된,적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어를 획득하고,상기 적어도 하나의 스코어에 기초하여, 상기 적어도 하나의 후보 텍스트 중 적어도 하나의 텍스트를 선택함으로써, 상기 필기 입력을, 상기 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환하는 적어도 하나의 프로세서; 및상기 필기 입력이 변환된 상기 텍스트를 표시하는 디스플레이를 포함하는, 전자 장치."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서, 상기 문자 시퀀스 및 기하학적 정보는,상기 필기 입력과 대응되는 적어도 하나의 스트로크에 관한 특징 정보가 순서대로 RNN 모델에 입력됨으로써, 획득되는, 전자 장치."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 적어도 하나의 스트로크는각각의 스트로크의 위치에 따라 분류된 클러스터별로 정렬되고,상기 문자 시퀀스는, 상기 클러스터별로 정렬된 적어도 하나의 스트로크에 관한 특징 정보가 상기 RNN 모델에입력됨으로써, 획득되는, 전자 장치."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제8항에 있어서, 상기 적어도 하나의 스코어는,공간 관계 모델, PCFG 모델, 언어 모델, 및 패널티 모델 중 적어도 하나의 문법 모델에 기초하여, 획득되는, 전자 장치."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서, 상기 공간 관계 모델에 기초하여, 상기 문자 시퀀스의 적어도 두 개의 문자들 간의 공간 관계R이 결정되고,상기 언어 모델에 기초하여, 상기 적어도 두 개의 문자들에 대해, 상기 공간 관계 모델에 의하여, 상기 공간 관계 R이 결정될 확률이 결정되는, 전자 장치."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제8항에 있어서, 상기 적어도 하나의 스코어는,CYK 알고리즘에 따라, 상기 문자 시퀀스의 적어도 두 개의 문자가 순차적으로 결합됨으로써, 획득되는, 전자 장치.공개특허 10-2021-0061523-4-청구항 14 제13항에 있어서, 상기 적어도 하나의 스코어는상기 CYK 알고리즘에 따라, 제1 레벨에서 획득된 상기 문자 시퀀스의 각 문자에 대한 터미널 스코어, 및 각 레벨에서 결합된 문자들에 대하여, 적어도 하나의 문법 모델에 기초하여 획득된 바이너리 스코어에 기초하여, 획득되는, 전자 장치."}
{"patent_id": "10-2019-0149109", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항 내지 제7항 중 어느 한 항의 방법을 구현하기 위한 프로그램이 기록된 컴퓨터로 읽을 수 있는 기록 매체."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "필기 입력에 관한 정보를 획득하고, 필기 입력과 대응되는 적어도 하나의 문자를 인식하고, 인식된 적어도 하나 의 문자가 순서대로 배열된 문자 시퀀스 및 적어도 하나의 문자에 대한 기하학적 정보를 획득하고, 문자 시퀀스 및 기하학적 정보에 기초하여, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는, 적어도 하나의 후보 텍 스트에 대한 적어도 하나의 스코어를 획득하고, 적어도 하나의 스코어에 기초하여, 적어도 하나의 후보 텍스트 중 적어도 하나의 텍스트를 선택함으로써, 필기 입력을, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하 는 텍스트로 변환하는, 방법이 개시된다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는, 필기 입력을 텍스트로 변환하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "사용자는 수학식, 화학식 등의 공식(formula)을 전자 장치에 입력하여, 수치 계산 및 그래프 도면을 구현할 수 있다. 공식을 입력하는 방법은, 키보드/마우스 기반의 공식 입력 방법 및 필기 인식 기반 공식 입력 방법을 포 함할 수 있다. 그러나, 키보드/마우스 기반의 공식 입력 방법에 의하면, 사용자가 공식의 구조에 대해 미리 숙지하고 있어야 하고, 입력하고자 하는 공식의 구조 및 내용을 직접 입력해야 한다. 예를 들면, 사용자는, 공식에 포함된 알파 벳 외에 기호(ex. =, +, ) 또는 구조(ex. 분수, 위아래 첨자, 제곱근)의 구체적인 이름 또는 특성을 미리 알고, 전자 장치에서 입력될 수 있는 복수의 기호 또는 구조 중 공식에 포함된 기호 및 구조를 찾아서 입력할 수 있다. 반면, 필기 인식 기반의 공식 입력 방법에 의하면, 사용자가 공식에 포함된, 기호 또는 구조의 특성, 이름을 미 리 알고 있지 않아도, 직접 필기하는 방식에 따라 공식을 입력할 수 있다. 사용자는 복수의 기호 또는 구조 중 입력하고자 하는 기호 또는 구조를 직접 선택하는 동작 없이, 필기만으로 기호 또는 구조를 입력할 수 있으므로, 키보드/마우스 기반의 공식 입력 방법에 비해 훨씬 쉽고 빠르게 공식을 전자 장치에 입력할 수 있다. 따라서, 필기 인식 기반의 공식 입력 방법에 따라, 필기 입력을 텍스트로 변환하는 방법이 요구되고 있다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시가 해결하고자 하는 과제는 전술한 문제를 해결하기 위한 것으로서, 필기 입력을 텍스트로 변환하는 전 자 장치 및 그 동작 방법을 제공하기 위한 것이다. 또한, 상기 방법을 컴퓨터에서 실행시키기 위한 프로그램을 기록한 컴퓨터로 읽을 수 있는 기록매체를 제공하는 데 있다. 해결하려는 기술적 과제는 상기된 바와 같은 기술적 과제들로 한정되지 않으며, 또 다른 기술적 과제 들이 존재할 수 있다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 기술적 과제를 달성하기 위한 기술적 수단으로서, 본 개시의 제1 측면은, 전자 장치에서 필기 입력을 텍 스트로 변환하는 방법에 있어서, 필기 입력에 관한 정보를 획득하는 단계; 상기 필기 입력과 대응되는 적어도 하나의 문자를 인식하는 단계; 상기 인식된 적어도 하나의 문자가 순서대로 배열된 문자 시퀀스 및 상기 적어도 하나의 문자에 대한 기하학적 정보를 획득하는 단계; 상기 문자 시퀀스 및 기하학적 정보에 기초하여, 수식 구 조에 따라 상기 적어도 하나의 문자가 다르게 표현된, 적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어 를 획득하는 단계; 및 상기 적어도 하나의 스코어에 기초하여, 상기 적어도 하나의 후보 텍스트 중 적어도 하나 의 텍스트를 선택함으로써, 상기 필기 입력을, 상기 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는텍스트로 변환하는 단계를 포함하는, 방법이 제공될 수 있다. 또한, 본 개시의 제2 측면에서, 필기 입력을 텍스트로 변환하는 전자 장치에 있어서, 필기 입력에 관한 정보를 획득하고, 상기 필기 입력과 대응되는 적어도 하나의 문자를 인식하고, 상기 인식된 적어도 하나의 문자가 순서 대로 배열된 문자 시퀀스 및 상기 적어도 하나의 문자에 대한 기하학적 정보를 획득하고, 상기 문자 시퀀스 및 기하학적 정보에 기초하여, 수식 구조에 따라 상기 적어도 하나의 문자가 다르게 표현된, 적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어를 획득하고, 상기 적어도 하나의 스코어에 기초하여, 상기 적어도 하나의 후보 텍스트 중 적어도 하나의 텍스트를 선택함으로써, 상기 필기 입력을, 상기 수식 구조에 따라 표현된 적어 도 하나의 문자를 포함하는 텍스트로 변환하는 적어도 하나의 프로세서; 및 상기 필기 입력이 변환된 상기 텍스 트를 표시하는 디스플레이를 포함하는, 전자 장치를 제공할 수 있다. 또한, 본 개시의 제3 측면은, 제1 측면의 방법을 수행하도록 하는 프로그램이 저장된 기록매체를 제공할 수 있 다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 실시 예에 의하면 스트로크 단위가 아닌, RNN 모델에 따라 결정된 문자 단위로, 적어도 하나의 문법 모델에 따라 결정된 스코어가 결정됨에 따라, 더 낮은 연산량으로, 필기 입력을 텍스트로 변환하기 위한 동작이 수행될 수 있다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관 계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"전기적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 개시에 따른 인공지능과 관련된 기능은 프로세서와 메모리를 통해 동작된다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP, DSP(Digital Signal Processor) 등 과 같은 범용 프로세서, GPU, VPU(Vision Processing Unit)와 같은 그래픽 전용 프로세서 또는 NPU와 같은 인 공지능 전용 프로세서일 수 있다. 하나 또는 복수의 프로세서는, 메모리에 저장된 기 정의된 동작 규칙 또는 인 공지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 또는, 하나 또는 복수의 프로세서가 인공지능 전용 프로세서인 경우, 인공지능 전용 프로세서는, 특정 인공지능 모델의 처리에 특화된 하드웨어 구조로 설계될 수 있다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만 들어진다는 것은, 기본 인공지능 모델이 학습 알고리즘에 의하여 다수의 학습 데이터들을 이용하여 학습됨으로 써, 원하는 특성(또는, 목적)을 수행하도록 설정된 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미 한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버 및/ 또는 시스템을 통해 이루어 질 수도 있다. 학습 알고리즘의 예로는, 지도형 학습(supervised learning), 비지도 형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)이 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 복수의 신경망 레이어들 각각은 복수의 가중치들 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치들 간의 연산을 통해 신경 망 연산을 수행한다. 복수의 신경망 레이어들이 갖고 있는 복수의 가중치들은 인공지능 모델의 학습 결과에 의 해 최적화될 수 있다. 예를 들어, 학습 과정 동안 인공지능 모델에서 획득한 로스(loss) 값 또는 코스트(cost) 값이 감소 또는 최소화되도록 복수의 가중치들이 갱신될 수 있다. 인공 신경망은 심층 신경망(DNN:Deep Neural Network)를 포함할 수 있으며, 예를 들어, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network) 또는 심층 Q-네트워크 (Deep Q-Networks) 등이 있으나, 전술한 예에 한정되지 않는다. 본 명세서에서 사용자의 필기 입력은 사용자의 아날로그 필기 입력으로 호칭될 수 있다. 또한 사용자의 필기 입 력은 감압식 또는 정전식 사용자 인터페이스를 통해 입력될 수 있다. 또한 사용자 필기 입력은 사용자의 손가락 뿐만 아니라 스타일러스 펜과 같은 필기 도구를 이용하여 입력될 수 있다. 이하 첨부된 도면을 참고하여 본 발명을 상세히 설명하기로 한다. 도 1은 일 실시 예에 따른 필기 입력의 일 예를 나타낸 도면이다. 도 1을 참조하면, 전자 장치는 사용자에 의해 입력된 필기 입력을 표시할 수 있다. 일 실시 예에 의하면, 다양한 방법에 따라 필기 입력이 사용자에 의하여 입력될 수 있다. 예를 들면, 사용 자의 손가락에 의한 터치 입력 또는 스타일러스 펜과 같은 필기 도구에 의한 터치 입력에 의해 필기 입력 이 전자 장치에 입력될 수 있다. 또한, 전자 장치에 구비된 카메라에 의해 필기 입력이 촬영됨으로써, 영상에 포함된 필기 입력(11 0)이 전자 장치에 입력될 수 있다. 예를 들면, 전자 장치는 필기 입력을 포함하는 영상을 분 석하여, 영상으로부터 필기 입력을 추출함으로써, 필기 입력이 전자 장치에 입력될 수 있다. 상술한 예에 한하지 않고, 사용자는 다양한 방법을 통해, 전자 장치에서 필기 입력을 입력할 수 있 다. 일 실시예에 따른 전자 장치는 다양한 형태로 구현될 수 있다. 예를 들어, 본 명세서에서 기술되는 전자 장치는, 디지털 카메라, 스마트 폰(smart phone), 노트북 컴퓨터(laptop computer), 태블릿 PC, 전자북 단말기, 디지털방송용 단말기, PDA(Personal Digital Assistants), PMP(Portable Multimedia Player), 네비게 이션, MP3 플레이어 등이 있을 수 있으나, 이에 한정되는 것은 아니다. 본 명세서에서 기술되는 전자 장치 는 사용자에 의해 착용될 수 있는 장치(wearable device)일 수 있다. 웨어러블 디바이스는 액세서리 형장치(예컨대, 시계, 반지, 팔목 밴드, 발목 밴드, 목걸이, 안경, 콘택트 렌즈), 머리 착용형 장치(head- mounted-device(HMD)), 직물 또는 의류 일체형 장치(예: 전자 의복), 신체 부착형 장치(예컨대, 스킨 패드(skin pad)), 또는 생체 이식형 장치(예: implantable circuit) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 이하에서는, 설명의 편의상, 전자 장치가 스마트 폰인 경우를 예로 들어 설명하기로 한다. 일 실시 예에 의한 전자 장치는 사용자에 의해 입력된 필기 입력을 텍스트로 변환하여 표시할 수 있다. 일 실시 예에 의한 텍스트는, 전자 장치에 의해 인식될 수 있는 문자를 포함할 수 있다. 예를 들면, 텍스트는, 알파벳, 숫자, 수학식에서 이용되는 다양한 기호(ex. +, -, =, √, ∫, Σ) 등을 포 함할 수 있다. 상술한 예에 한하지 않고, 일 실시 예에 의한 텍스트는 전자 장치에 의해 인식될 수 있는 다양한 종류의 문자, 기호 등을 포함할 수 있다. 일 실시 예에 의한 텍스트는 다양한 종류의 수식 구조에 따라 표현된 적어도 하나의 문자를 포함할 수 있 다. 예를 들면, 텍스트는 수학식에서 이용되는 다양한 기호(ex. +, -, =, √, ∫, Σ)에 의해 생성된 다양 한 수식 구조를 포함할 수 있다. 일 예로, 기호 'Σ'의 경우, Σ의 아래측(A), 위측(B), 및 우측(C)에 적어도 하나의 문자가 삽입될 수 있는 수식 구조(ex. )가 생성될 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는 필기 입력으로부터 문자뿐만 아니라 각 문자의 기하학적 (geometry) 정보를 함께 인식할 수 있다. 전자 장치는 문자에 대한 기하학적 정보에 기초하여, 필기 입력 을 텍스트로 변환할 수 있다. 기하학적 정보는, 예를 들면, 전자 장치는 문자의 위치 및 크기 등 문자의 외관과 관련된 정보를 포함할 수 있다. 일 실시 예에 의한 전자 장치는 각 문자에 대한 기하학 적 정보를 획득하고, 기하학적 정보에 기초하여 필기 입력을 텍스트로 변환할 수 있다. 일 실시 예에 의하면, 필기 입력으로부터 문자가 먼저 인식된 후, 인식된 문자에 기초하여, 각 문자에 대 한 기하학적 정보가 획득될 수 있다. 일 실시 예에 의한 전자 장치는, 필기 입력에 포함된 문자들을 인식한 후, 인식된 각 문자에 대한 기하학적 정보가 결정할 수 있다. 상술한 예에 한하지 않고, 전자 장치는 다양한 방법을 통해 문자 및 문자의 기하학적 정보를 획득하여, 필기 입력을 텍스트로 변환할 수 있다. 도 2는 일 실시 예에 의한 필기 입력을 텍스트로 변환하는 방법을 나타낸 블록도이다. 도 2를 참조하면, 일 실시 예에 의하면, 스트로크 인식 단계, 문자 인식 단계 및 텍스트 생성 단계를 통해, 필기 입력이 텍스트로 변환될 수 있다. 일 실시 예에 의한 전자 장치는 입력 영상 또는 필 기 입력으로부터 스트로크를 인식하고, 인식된 스트로크에 기초하여 문자를 인식하고, 인식된 문자에 기초하여, 수식 구조에 따라 표현된 문자를 포함하는 텍스트를 생성할 수 있다. 따라서, 전자 장치 는 필기 입력을 텍스트로 변환하여 표시할 수 있다. 스트로크 인식 단계에서, 전자 장치는, 입력된 영상으로부터 입력된 영상에 포함된 필기 입력과 대 응되는 스트로크를 식별할 수 있다. 또한, 필기 입력이 입력 도구에 의해 입력되는 경우, 전자 장치는 영 상 분석 없이, 필기 입력과 대응되는 스트로크를 식별할 수 있다. 일 실시 예에 의하면, 입력 도구는 사용자가 전자 장치에 특정 정보를 입력하기 위한 도구일 수 있다. 예 를 들어, 입력 도구에는, 손가락, 전자펜(예컨대, 스타일러스 펜) 등이 있을 수 있으나, 이에 한정되는 것은 아 니다. 일 실시 예에 의한, \"스트로크(stroke, 획)\"는 입력 도구가 전자 장치에 터치된 시점부터 터치를 유지한 채 드로잉하는 하나의 궤적을 의미할 수 있다. 예를 들어, '3x + 6y = 5' 에서, 3, x, 6, y 각각을 사용자가 터 치를 유치한 채 한번에 그린 경우, 3, x, 6, y 각각이 하나의 스트로크를 구성할 수 있다. '+'의 경우, 사용자 가 '-'를 먼저 긋고 그 다음에 '|'를 그리게 되므로, '-'와 '|'가 각각 하나의 스트로크를 구성할 수 있다. 일 실시예에 의하면, 하나의 스트로크가 하나의 문자나 기호를 구성하거나 다수의 스트로크의 조합으로 하나의 문 자나 기호를 구성할 수도 있다. 일 실시 예에 의하면, 스트로크 인식 단계에서, 전자 장치는 영상에서, 스트로크를 식별하고, 식별 된 스트로크에 관한 정보를 획득할 수 있다. 예를 들어, 전자 장치는 영상에서, 사용자에 의해 드로잉된 궤적을 판단함으로써, 스트로크를 식별하고, 식별된 스트로크에 관한 정보를 결정할 수 있다. 스트로크에 관한정보는, 예를 들면, 굵기, 색상, 궤적의 방향, 입력 순서, 위치 등 스트로크에 관한 다양한 종류의 정보를 포함 할 수 있다. 일 실시 예에 의한 문자 인식 단계에서, 전자 장치는 스트로크에 기초하여, 적어도 하나의 문자가 순서대로 배열된 문자 시퀀스를 획득할 수 있다. 일 실시 예에 의한 문자 시퀀스는, 적어도 하나의 스트로크와 대응되는 적어도 하나의 문자가 순서대로 배열됨으로써 획득될 수 있다. 또한, 전자 장치는 문자 시퀀스 에 포함된 각 문자에 대하여 기하학적 정보를 더 획득할 수 있다. 일 실시 예에 의하면, 기하학적 정보에 기초 하여, 문자가 수식 구조에 따라 표현될 수 있다. 일 실시 예에 의한 텍스트 생성 단계에서, 전자 장치는 문자 시퀀스 및 기하학적 정보에 기초하여, 텍스트를 생성할 수 있다. 일 실시 예에 의하면, 전자 장치는 적어도 하나의 문법 모델에 기초하여, 수식 구조에 따라 표현된 문자 시퀀스의 문자에 대한 스코어를 획득함으로써, 수식 구조에 따라 표현된 적어도 하나 의 문자를 포함하는 텍스트를 생성할 수 있다. 일 실시 예에 의한 문법 모델은, 전후 문자들 간의 관계, 위치, 크기 등에 기초하여 문자에 대한 스코어를 결정 하는데 이용될 수 있다. 전후 문자들 간의 관계, 위치, 크기 등에 기초하여, 수식 구조에 따라 각 문자가 표현 될 수 있다. 따라서, 일 실시 예에 의하면, 적어도 하나의 문법 모델에 기초하여 획득된 스코어 값에 기초하여, 각각의 문자가 수식 구조에 따라 표현될 수 있다. 일 실시 예에 의한 전자 장치는, 필기 입력을, 적어도 하나의 문법 모델에 기초하여, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환할 수 있다. 도 3은 일 실시 예에 의한 문자 인식 단계를 나타낸 블록도이다. 일 실시 예에 의하면, 도 2의 문자 인식 단계는, 도 3에 도시된 전처리, 스트로크 정렬, RNN 모 델 인식 및 디코딩 단계를 통해, 스트로크 인식 단계에서 인식된 스트로크로부터 문자 시퀀스 및 문자 시퀀스에 포함된 문자에 대한 기하학적 정보가 획득될 수 있다. 문자 인식 단계에서, 전자 장치는, 스트로크와 대응되는 문자를 인식할 수 있다. 일 실시 예에 의한 문자 인식 단계에서, 전자 장치는 스트로크에 대하여 전처리, 스트로크 정렬, RNN 모델 인식, 및 디코딩을 수행함으로써, 스트로크와 대응되는 문자를 인식할 수 있다. 전처리 단계에서, 전자 장치는 식별된 스트로크로부터 문자를 인식하기 위한 전처리를 수행할 수 있 다. 일 실시 예에 의한 전처리 단계는, 기준선 추출 단계, 크기 보정 단계 및 기울임 보정 단계를 포함할 수 있다. 기준선 추출 단계에서, 전자 장치는 스트로크 인식 단계에서 인식된 적어도 하나의 스트로크에 대한 기준선을 생성할 수 있다. 일 실시 예에 의한 기준선은 스트로크의 기울기 및 크기를 조절하기 위한 기준 이 되는 선으로 생성될 수 있다. 예를 들면, 기준선은, 스트로크마다 생성될 수 있으며, 스트로크의 상단 끝부 분 및 하단 끝부분에서 서로 평행이 되는 선으로 생성될 수 있다. 크기 보정 단계에서, 전자 장치는, 기준선에 기초하여, 적어도 하나의 스트로크의 크기를 조절할 수 있다. 예를 들어, 전자 장치는 기준선에 기초하여, 스트로크들이 일정한 크기를 가지도록 각 스트로크의 크기를 조절할 수 있다. 기울임 보정 단계에서, 전자 장치는, 기준선에 기초하여, 적어도 하나의 스트로크의 기울기를 조절 할 수 있다. 예를 들어, 전자 장치는, 스트로크의 중심선을 임의로 설정하고, 기준선에 기초하여, 기준선 과 스트로크의 중심선이 평행이 되도록 스트로크를 회전시킴으로써, 스트로크의 기울기를 조절할 수 있다. 스트로크 정렬 단계에서, 전자 장치는 수식 구조를 검출하고, 검출된 수식 구조에 기초하여, 적어도 하나의 스트로크를 적어도 하나의 클러스터로 분류할 수 있다. 일 실시 예에 따라 검출될 수 있는 수식 구조는, 기호를 기준으로, 문자가 다양한 위치에 배치됨에 따라 표현될 수 있는 수식 구조를 의미할 수 있 다. 예를 들면, 분수, √(근호), ∫(적분), Σ(합계) 등의 다양한 기호에 의해 표현될 수 있는 수식 구조가 검 출될 수 있다. 일 실시 예에 의하면, 검출된 수식 구조에 기초하여, 적어도 하나의 스트로크가 적어도 하나의 클러스터로 분류 될 수 있다. 일 실시 예에 의하면, 수식 구조에 의해, 적어도 하나의 문자가 배치될 수 있는 영역에 따라서, 클러스터가 분류될 수 있다. 예를 들어, 수식 구조로, 분수가 검출된 경우, 분모 영역에 위치한 스트로크들 및 분 자 영역에 위치한 스트로크들은 각각 다른 클러스터로 분류될 수 있다. 따라서, 클러스터 별로 정렬된 스트로크 들에 기초하여, RNN 모델에 의하여 정렬된 스트로크들과 대응되는 문자가 인식될 수 있다. 일 실시 예에 의한 전자 장치는, 적어도 하나의 스트로크를 클러스터로 분류한 후, 클러스터 단위로, 스 트로크들을 정렬시킬 수 있다. 예를 들면, 전자 장치는, 좌우 방향 또는 상하 방향으로, 스트로크들을 정 렬시킬 수 있다. RNN 모델 인식 단계에서, 전자 장치는 스트로크 정렬 단계에서, RNN 모델을 이용하여 클러스터 별로 정렬된 스트로크들로부터 문자를 인식할 수 있다. RNN 모델 인식 단계에서, 전자 장치는 스트 로크들에 대한 특징을 추출할 수 있다. 또한, 전자 장치는, 필기 입력과 대응되는 적어도 하나의 스트로 크에 관한 특징 정보를 순서대로 RNN 모델에 입력함으로써, 추출된 특징에 대하여 인식된 결과를 획득할 수 있 다. 일 실시 예에 의하면, CNN, LSTM(Long short term memory), BLSTM(Bidirectional LSTM) 등의 다양한 종류 의 RNN 모델들이 이용될 수 있다. 일 실시 예에 따라서, 스트로크에 대한 특징 정보는, 각각의 스트로크에 대한 비주얼적 특징을 나타내는 다양한 종류의 정보를 포함할 수 있고, RNN 모델에 입력될 수 있는 형태의 정보로 추출될 수 있다. 일 실시 예에 의한 RNN 모델은, 스트로크에 대한 특징 정보가 상기 RNN 모델에 스트로크 정렬에 의해 정렬 된 순서대로 순차적으로 입력됨으로써, 입력된 특징 정보에 대하여 인식된 결과를 출력할 수 있다. 예를 들면, 필기 입력과 대응되는 적어도 하나의 스트로크에 관한 특징 정보가 순서대로 RNN 모델에 입력됨으로 써, 문자 시퀀스 및 기하학적 정보가 획득될 수 있다. 또한, 일 실시 예에 의한, 적어도 하나의 스트로크는 각각의 스트로크의 위치에 따라 분류된 클러스터별로 정렬 될 수 있다. 일 실시 예에 의한 문자 시퀀스는, 클러스터별로 정렬된 적어도 하나의 스트로크에 관한 특징 정보 가 RNN 모델에 입력됨으로써, 획득될 수 있다. 디코딩 단계에서, 전자 장치는 RNN 모델 인식 단계에서 출력된 정보에 기초하여, 문자 시퀀스 와, 기하학적 정보를 획득할 수 있다. 일 실시 예에 따라 RNN 모델에 의해 출력될 수 있는 문자에 관한 정보는, 스트로크와 대응되는 문자의 특징에 관한 정보를 포함할 수 있다. 일 실시 예에 따른 전자 장치는 문자의 특징에 관한 정보에 기초하여, 스트 로크와 대응되는 문자를 식별하고, 식별된 문자를 포함하는 문자 시퀀스를 획득할 수 있다. 일 실시 예에 의한 문자 시퀀스는, 각 클러스터 별로 순서대로 정렬된 적어도 하나의 문자를 포함할 수 있다. 일 실시 예에 의한 전자 장치는 문자의 특징에 관한 정보에 기초하여, 식별된 문자에 대한, 문자 스코어 (character score)를 더 획득할 수 있다. 문자 스코어는, 문자의 특징에 관한 정보와 상기 식별된 문자에 대해 미리 정의된 특징이 유사한 정도를 나타낼 수 있다. 예를 들어, RNN 모델로부터 획득된 문자의 특징에 관한 정 보와 상기 식별된 문자에 대해 미리 정해진 특징 정보 간 유사도가 낮을수록 문자 점수는 낮은 값으로 결정될 수 있다. 일 실시 예에 의한 문자 스코어는, 문자 시퀀스에 포함된 각각의 문자에 대하여, 획득될 수 있다. 일 실시 예에 의한 전자 장치는, 문자 시퀀스에 포함된 각각의 문자에 대한 기하학적 정보를 더 획득할 수 있다. 일 실시 예에 의한 전자 장치는, 각 문자의 특징에 관한 정보에 기초하여, 문자의 위치, 크기, 모양 등에 관한 정보를 포함하는, 기하학적 정보를 획득할 수 있다. 도 4는 일 실시 예에 따른 텍스트 생성 단계를 나타낸 블록도이다. 도 4를 참조하면, 일 실시 예에 의한 텍스트 생성 단계는, 초기화 단계 및 표현 구성 단계를 포 함할 수 있다. 초기화 단계에서, 전자 장치는, 문자 인식 단계에서 출력된 문자 시퀀스 및 기하학적 정보에 대해, 전처리를 수행할 수 있다. 일 실시 예에 의하면, 전자 장치는, 문자 시퀀스에 포함된 문자 중 적어도 하나의 문자를 결합할 수 있다. 예를 들어, 루트 기호의 앞부분과 뒷부분이 각각 따로 입력된 경우, 스트로크 정렬에 따라서, 입력 순서 에 따라 정렬된 후 각각 다른 문자로 인식될 수 있다. 일 실시 예에 의하면, 인식된 문자의 위치 정보에 기초하여, 루트 기호의 앞부분과 뒷부분이 결합됨으로써, 하나의 루트 기호로 인식될 수 있다. 또한, 초기화 단계에서, 전자 장치는, 문자 시퀀스 및 기하학적 정보 중 적어도 하나에 기초하여, 수식 구조를 구성하는 기호 정보를 획득할 수 있다. 일 실시 예에 의한 기호 정보는, 수식 구조와 관련된 기호 가 식별된 정보를 포함할 수 있다. 예를 들면, 기호 정보는, 분수 기호, 루트 기호, 화살표, 연산자와 cos, tan, lim, sin 등과 같은 수학식에서 이용될 수 있는 다양한 종류의 기호에 관한 정보를 포함할 수 있다. 또한, 일 실시 예에 의하면, 전자 장치는, 문자 시퀀스에 포함된 문자 중 서로 다른 의미로 인식될 수 있 는 기호를 식별할 수 있다. 예를 들어, '.'는 마침표 '.' 또는 곱셈 기호 '·'로 인식될 수 있다. 일 실시 예에 의하면, 상기 식별된 기호에 관한 정보는, 상술한 기호에 관한 정보로서, 이하 표현 구성 단 계에서, 문자 시퀀스의 수식 구조가 해석되는데 이용될 수 있다. 예를 들어, 이하 표현 구성 단계에서, CYK 알고리즘에 따른 스코어가 결정될 때, 연산자와 cos, tan, lim, sin 등의 기호는, 기호 정보에 기초하여, 하나의 문자로서 처리될 수 있다. 표현 구성 단계에서, 전자 장치는, 적어도 하나의 문법 모델에 기초하여, 수식 구조에 따라 표현된 적어도 하나의 문자에 대한 스코어를 결정할 수 있다. 일 실시 예에 의한 적어도 하나의 문법 모델은, 공간 관계 모델(spatial relation model), PCFG 모델 (Probabilistic context-free grammar model), 언어 모델(language model), 및 패널티 모델(penalty model) 중 적어도 하나를 포함할 수 있다. 따라서, 일 실시 예에 의하면, 수식 구조에 따라 상기 적어도 하나의 문자가 다 르게 표현된, 적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어는, 공간 관계 모델, PCFG 모델, 언어 모 델, 및 패널티 모델 중 적어도 하나의 문법 모델에 기초하여, 획득될 수 있다. 일 실시 예에 의한 전자 장치는, CYK(Cocke-Younger-Kasami) 알고리즘에 따라, 문자 시퀀스의 적어도 두 개의 문자를 순차적으로 결합함으로써, 적어도 하나의 문법 모델에 기초한 스코어를 획득할 수 있다. 일 실시 예에 의한 스코어는, 문자 시퀀스에 포함된 각 문자에 관한 정보, 기하학적 정보 및 기호 정보 중 적어 도 하나의 정보에 기초하여, 적어도 하나의 문법 모델에 의해 획득될 수 있다. 일 실시 예에 의한 공간 관계 모델은, 적어도 두 개의 문자들 간 공간적 관계, 예를 들면, 좌우/상하 문자, 위/ 아래 첨자 등의 공간 관계를 결정하고, 결정된 공간 관계에 대한 스코어를 결정하기 위한 문법 모델이다. 일 실 시 예에 의한 전자 장치는 적어도 두 개의 문자들의 기하학적 정보 및 기호 정보 중 적어도 하나에 기초 하여, 상기 문자들 간 적어도 하나의 공간 관계 R을 결정하고, 상기 결정된 공간 관계 R에 대한 스코어를 획득 할 수 있다. 일 실시 예에 의한 언어 모델은, 적어도 두 개의 문자들의 공간 관계 R 및 상기 문자들 간의 관계에 기초하여, 스코어를 결정하기 위한 문법 모델이다. 일 실시 예에 의하면, 언어 모델에 기초하여, 적어도 두 개의 문자들에 대해, 공간 관계 모델에 의해, 공간 관계 R이 결정될 확률이 결정될 수 있다. 예를 들면, 언어 모델에 기초하여, 문자들 간 순서를 고려하여, 상기 공간적 관계가 생성될 확률을 나타내는 스 코어가 결정될 수 있다. 또한, 언어 모델에 기초하여, 문자들 간 상기 공간적 관계가 생성될 확률을 나타내는 스코어가 결정될 수 있다. 일 실시 예에 의하면, 언어 모델에 따라, 문자 A 이후 문자 B가 공간 관계 R로서 출현할 확률을 나타내는 스코 어 및 문자 A 및 B 간에 공간 관계 R이 결정될 확률을 나타내는 스코어 중 적어도 하나가 획득될 수 있다. 일 실시 예에 의한 페널티 모델은, 다른 문법 모델에 의해 결정된 스코어를 보정하기 위한 문법 모델이다. 예를 들면, 페널티 모델에 기초하여, (), []과 같이 쌍으로 이용되는 기호가 서로 대칭적으로 표시될 수 있도록 보정 하기 위한 스코어가 결정될 수 있다. 일 실시 예에 의하면, 기호 정보 및 기하학적 정보 중 적어도 하나에 기초 하여, 패널티 모델에 의한 스코어가 결정될 수 있다. 상술한 예에 한하지 않고, 페널티 모델에 기초하여, 문자 가 적합한 구조에 따라 표현될 수 있도록 보정하기 위한 스코어가 결정될 수 있다. 일 실시 예에 의한 전자 장치는 상술한 문법 모델에 한하지 않고, 다양한 종류의 문법 모델에 의해 획득 된, 스코어에 기초하여, 수식 구조에 따라 표현된 문자를 포함하는 텍스트를 생성할 수 있다. 도 5는 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 6은 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 5를 참조하면, 전자 장치는, 프로세서, 및 디스플레이를 포함할 수 있다. 그러나, 도 5에 도시된 구성 요소 모두가 전자 장치의 필수 구성 요소인 것은 아니다. 도 5에 도시된 구성 요소보다 많은 구성 요소에 의해 전자 장치가 구현될 수도 있고, 도 5에 도시된 구성 요소보다 적은 구성 요소에 의해 전자 장치가 구현될 수도 있다. 예를 들면, 전자 장치는 도 6에 도시된 바와 같이, 일부 실시예에 따른 전자 장치는, 프로세서 , 및 디스플레이 이외에 사용자 입력부, 출력부, 센싱부, 통신부, A/V 입력부 및 메모리를 더 포함할 수도 있다. 사용자 입력부는, 사용자가 전자 장치를 제어하기 위한 데이터를 입력하는 수단을 의미한다. 예를 들어, 사용자 입력부에는 키 패드(key pad), 돔 스위치 (dome switch), 터치 패드(접촉식 정전 용량 방식, 압력식 저항막 방식, 적외선 감지 방식, 표면 초음파 전도 방식, 적분식 장력 측정 방식, 피에조 효과 방 식 등), 조그 휠, 조그 스위치 등이 있을 수 있으나 이에 한정되는 것은 아니다. 일 실시 예에 의하면, 사용자 입력부는, 필기 입력을 수행하기 위한 사용자 입력을 수신할 수 있다. 예를 들면, 사용자는 필기 도구를 이용하여 전자 장치에서 필기 입력을 수행할 수 있다. 출력부는, 오디오 신호 또는 비디오 신호 또는 진동 신호를 출력할 수 있으며, 출력부는 디스플레 이부, 음향 출력부, 및 진동 모터를 포함할 수 있다. 디스플레이부는 전자 장치에서 처리되는 정보를 표시 출력한다. 일 실시 예에 의하면, 디스플레이 부는 사용자에 의해 입력된 필기 입력 또는, 필기 입력이 촬영된 영상을 표시할 수 있다. 또한, 디스플레 이부는, 일 실시 예에 따라, 필기 입력이 변환된 결과 획득된, 수식 구조에 따라 표현된 적어도 하나의 텍스트를 표시할 수 있다. 한편, 디스플레이부와 터치패드가 레이어 구조를 이루어 터치 스크린으로 구성되는 경우, 디스플레이부 는 출력 장치 이외에 입력 장치로도 사용될 수 있다. 디스플레이부는 액정 디스플레이(liquid crystal display), 박막 트랜지스터 액정 디스플레이(thin film transistor-liquid crystal display), 유기 발 광 다이오드(organic light-emitting diode), 플렉시블 디스플레이(flexible display), 3차원 디스플레이(3D display), 전기영동 디스플레이(electrophoretic display) 중에서 적어도 하나를 포함할 수 있다. 그리고 전자 장치의 구현 형태에 따라 전자 장치는 디스플레이부를 2개 이상 포함할 수도 있다. 음향 출력부는 통신부로부터 수신되거나 메모리에 저장된 오디오 데이터를 출력한다. 진동 모터는 진동 신호를 출력할 수 있다. 또한, 진동 모터는 터치스크린에 터치가 입력되는 경우 진동 신호를 출력할 수도 있다. 일 실시 예에 의한 음향 출력부 또는 진동 모터는, 필기 입력이 변환된 결과 획득된, 수식 구조에 따라 표현된 적어도 하나의 텍스트를 출력함을 나타내는 오디오 데이터 또는 진동 신호를 출력할 수 있다. 상술한 예에 한하지 않고, 일 실시 예에 따라 필기 입력이 변환된 결과 획득된 텍스트는 다양한 출력 방법에 따 라서 출력될 수 있다. 프로세서는, 통상적으로 전자 장치의 전반적인 동작을 제어한다. 예를 들어, 프로세서는, 메 모리에 저장된 프로그램들을 실행함으로써, 사용자 입력부, 출력부, 센싱부, 통신부 , A/V 입력부 등을 전반적으로 제어할 수 있다. 전자 장치는 적어도 하나의 프로세서를 포함할 수 있다. 예를 들면, 전자 장치는 CPU(Central Processing Unit), GPU(Graphics Processing Unit), NPU(Neural Processing Unit) 등의 다양한 종류의 프로세서를 포함할 수 있다. 프로세서는 기본적인 산술, 로직 및 입출력 연산을 수행함으로써, 컴퓨터 프로그램의 명령을 처리하도록 구성될 수 있다. 명령은 메모리로부터 프로세서에 제공되거나, 통신부를 통해 수신되어 프로 세서로 제공될 수 있다. 예를 들면 프로세서는 메모리와 같은 기록 장치에 저장된 프로그램 코드 에 따라 명령을 실행하도록 구성될 수 있다. 일 실시 예에 의한 프로세서는 필기 입력에 대하여 적어도 하나의 스트로크를 인식하고, 인식된 스트로크 에 기초하여, 필기 입력과 대응되는 적어도 하나의 문자를 인식할 수 있다. 또한, 프로세서는, 인식된 문 자에 대한 기하학적 정보를 더 획득할 수 있다. 또한, 프로세서는, 적어도 하나의 문자가 순서대로 정렬 된 문자 시퀀스 및 각 문자에 대한 기하학적 정보에 기초하여, 수식 구조에 따라 상기 적어도 하나의 문자가 다 르게 표현된, 적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어를 획득할 수 있다. 또한, 프로세서 는, 적어도 하나의 스코어에 기초하여, 적어도 하나의 후보 텍스트 중 적어도 하나의 텍스트를 선택함으 로써, 필기 입력을, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환할 수 있다. 일 실시 예에 의하면, 프로세서는 RNN 모델을 이용하여, 순서대로 정렬된 적어도 하나의 스트로크로부터, 문자 시퀀스를 획득할 수 있다. 또한, 프로세서는, CKY 알고리즘을 이용하여, 적어도 하나의 문법 모델에 기초하여 획득된 스코어에 따라 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트를 획득함으로 써, 필기 입력을 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환할 수 있다. 센싱부는, 전자 장치의 상태 또는 전자 장치 주변의 상태를 감지하고, 감지된 정보를 프로세 서로 전달할 수 있다. 센싱부는, 지자기 센서(Geomagnetic sensor), 가속도 센서(Acceleration sensor), 온/습도 센서, 적외선 센서, 자이로스코프 센서, 위치 센서(예컨대, GPS), 기압 센서, 근접 센서, 및 RGB 센서(illuminance sensor) 중 적어도 하나를 포함할 수 있으나, 이에 한정되는 것은 아니다. 통신부는, 전자 장치가 외부 장치(미도시)와 통신을 하게 하는 하나 이상의 구성요소를 포함할 수 있다. 예를 들어, 통신부는, 근거리 통신부, 이동 통신부, 방송 수신부를 포함할 수 있다. 근거리 통신부(short-range wireless communication unit)는, 블루투스 통신부, BLE(Bluetooth Low Energy) 통신부, 근거리 무선 통신부(Near Field Communication unit), WLAN(와이파이) 통신부, 지그비 (Zigbee) 통신부, 적외선(IrDA, infrared Data Association) 통신부, WFD(Wi-Fi Direct) 통신부, UWB(ultra wideband) 통신부, Ant+ 통신부 등을 포함할 수 있으나, 이에 한정되는 것은 아니다. 이동 통신부는, 이동 통신망 상에서 기지국, 외부의 단말, 서버 중 적어도 하나와 무선 신호를 송수신한 다. 여기에서, 무선 신호는, 음성 호 신호, 화상 통화 호 신호 또는 문자/멀티미디어 메시지 송수신에 따른 다 양한 형태의 데이터를 포함할 수 있다. 방송 수신부는, 방송 채널을 통하여 외부로부터 방송 신호 및/또는 방송 관련된 정보를 수신한다. 방송 채널은 위성 채널, 지상파 채널을 포함할 수 있다. 구현 예에 따라서 전자 장치가 방송 수신부를 포함하지 않을 수도 있다. 일 실시 예에 의한 통신부는, 일 실시 예에 따라 필기 입력을 텍스트로 변환하는데 필요한 데이터를 외부 장치로부터 수신할 수 있다. 예를 들면, 통신부는, 일 실시 예에 따라 필기 입력을 텍스트로 변환하기 위 한 적어도 하나의 동작을 상기 외부 장치(ex. 서버)에 요청하고, 상기 요청에 따라 동작이 수행된 결과를 수신 할 수 있다. 일 실시 예에 따라 필기 입력을 텍스트로 변환하기 위한 적어도 하나의 동작은, 예를 들면, 스트로 크 인식, 문자 인식 및 텍스트 생성 단계에 의한 동작 중 적어도 하나의 동작일 수 있다. A/V(Audio/Video) 입력부는 오디오 신호 또는 비디오 신호 입력을 위한 것으로, 이에는 카메라와 마이크로폰 등이 포함될 수 있다. 카메라는 화상 통화모드 또는 촬영 모드에서 이미지 센서를 통해 정지영상 또는 동영상 등의 화상 프레임을 얻을 수 있다. 이미지 센서를 통해 캡쳐된 이미지는 프로세서 또는 별도의 이미지 처리부(미도시)를 통해 처리될 수 있다. 일 실시 예에 의한 A/V 입력부는, 필기 입력이 촬영된 영상을 생성할 수 있다. A/V 입력부에 의해 촬영된 영상은, 일 실시 예에 따라 처리됨으로써, 상기 필기 입력과 대응되는, 수식 구조로 표현된 적어도 하나 의 텍스트가 생성될 수 있다. 마이크로폰은, 외부의 음향 신호를 입력 받아 전기적인 음성 데이터로 처리한다. 예를 들어, 마이크로폰 은 일 실시 예에 따라 필기 입력을 텍스트로 변환하기 위한 사용자의 명령을 포함하는 음성 신호를 수신 할 수 있다. 메모리는, 프로세서의 처리 및 제어를 위한 프로그램을 저장할 수 있고, 전자 장치로 입력되 거나 전자 장치로부터 출력되는 데이터를 저장할 수도 있다. 일 실시 예에 의한 메모리는 필기 입력을 텍스트로 변환하는데 필요한 다양한 종류의 데이터를 저장할 수 있다. 예를 들면, 메모리는 문자 인식을 위해 이용되는 RNN 모델과, 수식 구조로 표현된 적어도 하나의 문자를 포함하는 텍스트를 생성하기 위해 이용되는 적어도 하나의 문법 모델을 저장할 수 있다. 메모리는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(RAM, Random Access Memory) SRAM(Static Random Access Memory), 롬(ROM, Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기 메모리, 자기 디스크, 광디스크 중 적어도 하나의 타입의 저장매체를 포함할 수 있다. 메모리에 저장된 프로그램들은 그 기능에 따라 복수 개의 모듈들로 분류할 수 있는데, 예를 들어, UI 모 듈, 터치 스크린 모듈, 알림 모듈 등으로 분류될 수 있다. UI 모듈은, 애플리케이션 별로 전자 장치와 연동되는 특화된 UI, GUI 등을 제공할 수 있다. 터치 스크린 모듈은 사용자의 터치 스크린 상의 터치 제스처를 감지하고, 터치 제스처에 관한 정보를 프로세서 로 전달할 수 있다. 일부 실시예에 따른 터치 스크린 모듈은 터치 코드를 인식하고 분석할 수 있다. 터치 스크린 모듈은 컨트롤러를 포함하는 별도의 하드웨어로 구성될 수도 있다. 터치스크린의 터치 또는 근접 터치를 감지하기 위해 터치스크린의 내부 또는 근처에 다양한 센서가 구비될 수 있다. 터치스크린의 터치를 감지하기 위한 센서의 일례로 촉각 센서가 있다. 촉각 센서는 사람이 느끼는 정도로 또는 그 이상으로 특정 물체의 접촉을 감지하는 센서를 말한다. 촉각 센서는 접촉면의 거칠기, 접촉 물체의 단 단함, 접촉 지점의 온도 등의 다양한 정보를 감지할 수 있다. 사용자의 터치 제스처에는 탭, 터치&홀드, 더블 탭, 드래그, 패닝, 플릭, 드래그 앤드 드롭, 스와이프 등이 있 을 수 있다. 알림 모듈은 전자 장치의 이벤트 발생을 알리기 위한 신호를 발생할 수 있다. 도 7을 일 실시 예에 의한 필기 입력을 텍스트로 변환하는 방법을 나타낸 순서도이다. 도 7을 참조하면, 단계 710에서, 전자 장치는 필기 입력에 관한 정보를 획득할 수 있다. 일 실시 예에 의 하면, 필기 도구에 의한 터치 입력에 의해 전자 장치가 필기 입력에 관한 정보를 획득할 수 있다. 또한, 전자 장치는 필기 입력이 촬영된 영상으로부터 필기 입력에 관한 정보를 획득할 수 있다. 단계 720에서, 전자 장치는, 필기 입력에 관한 정보에 기초하여, 상기 필기 입력과 대응되는 적어도 하나 의 문자를 인식할 수 있다. 일 실시 예에 의한 전자 장치는, 필기 입력으로부터 적어도 하나의 스트로크 를 인식하고, 순서대로 정렬된 적어도 하나의 스트로크에 기초하여, 필기 입력과 대응되는 적어도 하나의 문자 를 획득할 수 있다. 예를 들면, 좌우 방향 또는 상하 방향으로 적어도 하나의 스트로크가 순서대로 정렬될 수 있다. 일 실시 예에 의하면, RNN 모델에서 적어도 하나의 스트로크가 순서대로 처리됨으로써, 필기 입력과 대응되는 적어도 하나의 문자가 획득될 수 있다. 일 실시 예에 의한 RNN 모델은, 순서대로 정렬된 스트로크를 순서대로 처리함으로써, 상기 스트로크가 인식된 결과로서, 적어도 하나의 스트로크와 대응되는 적어도 하나의 문자에 관 한 정보를 출력할 수 있다. 단계 730에서, 전자 장치는 단계 720에서 인식된 적어도 하나의 문자가 순서대로 배열된 문자 시퀀스 및 각각의 문자에 대한 기하학적 정보를 획득할 수 있다. 일 실시 예에 의한 기하학적 정보는, 문자의 크기, 위치 등 문자의 외관적인 특징에 관한 정보를 포함할 수 있다. 단계 740에서, 전자 장치는, 문자 시퀀스 및 기하학적 정보에 기초하여, 수식 구조에 따라 적어도 하나의 문자가 다르게 표현된 적어도 하나의 후보 텍스트에 대한 적어도 하나의 스코어를 획득할 수 있다. 일 실시 예 에 의한, 스코어는, 적어도 하나의 문법 모델에 기초하여 획득될 수 있다. 일 실시 예에 의한 전자 장치는, CYK 알고리즘에 따라, 문자 시퀀스의 적어도 하나의 문자를 순차적으로 결합할 수 있다. 또한, 전자 장치는 각 단계 마다 결합된 문자들에 대한 스코어를 적어도 하나의 문법 모델에 기초하여 획득할 수 있다. 상술한 예에 한하지 않고, 전자 장치는 다양한 종류의 알고리즘을 이용하 여, 수식 구조에 따라 표현된 적어도 하나의 문자에 대한 스코어를 획득할 수 있다. 단계 750에서, 전자 장치는, 적어도 하나의 스코어에 기초하여, 필기 입력을, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환할 수 있다. 일 실시 예에 의하면, 전자 장치는 적어도 하 나의 스코어에 기초하여, 적어도 하나의 후보 텍스트 중 적어도 하나의 텍스트를 선택함으로써, 필기 입력을, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 텍스트로 변환할 수 있다. 도 8은 일 실시 예에 의한 RNN 모델 중 BLSTM의 일 예를 나타낸 도면이다. 도 8을 참조하면, BLSTM은, 복수 개의 LSTM(821, 822, 841, 842), Concat 모듈, Dense 모듈 및 CTC 디코더로 구성될 수 있다. 도 8에 도시된 BLSTM의 구조는, 일 예에 불과하고, 일 실시 예에 의하면, 도 8에 도시된 BLSTM의 구조에 한하지 않고, 다양한 구조의 BLSTM가 이용될 수 있다. 도 8에서, 각각의 화살표에 기재된 숫자는, 화살표에 따라 전달되는 정보의 개수를 나타낸다. 예를 들어, 스트 로크에 관한 정보로, 3개의 서로 다른 파라미터가 BLSTM으로 입력되어, LSTM(821,822)들로 전달될 수 있다. 일 실시 예에 의하면, BLSTM으로 입력된 스트로크에 관한 정보가 각각 전방향의 LSTM 및 후방향의 LSTM로 입력될 수 있다. 일 실시 예에 의한 전방향의 LSTM은, 스트로크들의 순서에 따라서, 각 스트로크에 대한 정보를 처리할 수 있다. 반면, 일 실시 예에 의한 후방향의 LSTM의, 스트로크들의 순서의 역 방향에 따라서, 각 스트로크에 대한 정보를 처리할 수 있다. Concat 모듈은, 각각의 LSTM(821, 822)에 의해 처리된 데이터를 결합하여, 전방향 및 후방향의 LSTM(841, 842)들로 전달할 수 있다. Concat 모듈은, 전방향 및 후방향의 LSTM(841, 842)들에 입력되어 처리될 수 있 도록, 각각의 LSTM(821, 822)에 의해 처리된 데이터를 다양한 방법에 따라 결합할 수 있다. 일 실시 예에 의한 첫번째 LSTM(821 또는 822)과, 두번째 LSTM(841 또는 842)은 각각 다른 구조를 포함하는 신 경망 모델일 수 있다. 예를 들어, 첫번째 LSTM(821 또는 822)은, 41900개의 가중치로 구성된 신경망 모델이고, 두번째 LSTM(841 또는 842)은, 120700개의 가중치로 구성된 신경망 모델일 수 있다. 상술한 예에 한하지 않고, 일 실시 예에 의한 BLSTM에 포함된 LSTM(821, 822, 841, 842)은, 스트로크의 정보를 처리하기 위한 다양한 구조 를 포함하는 신경망 모델일 수 있다. 일 실시 예에 의하면, 두번째 LSTM(841 또는 842)에 의해 각각 처리된 데이터는 Concat 모듈에 의해 결합 되고, Dense 모듈 및 CTC 디코더를 통해 최종 데이터가 출력될 수 있다. 일 실시 예에 의한 Dense 모듈은, 출력 데이터의 포맷에 맞추어, Concat 모듈에 의해 출력된 데이터 를 변환할 수 있다. 또한, CTC 디코더는 Dense 모듈에 의해 출력된 데이터에 대해 평가하고, 평가 결 과에 기초하여, BLSTM 모델을 업데이트하는 동작을 수행할 수 있다. 상술한 예에 한하지 않고, Dense 모듈 및 CTC 디코더는, 최종 데이터를 출력하기 위한 다양한 동작을 수행함으로써, BLSTM에 의해 입력 데이터가 처리된 결과를 포함하는 최종 데이터를 출력할 수 있다. 도 9는 일 실시 예에 따라, 스트로크에 관한 정보를 처리하기 위한 RNN 모델을 학습하는 일 예를 나타낸 블록도 이다. 도 9를 참조하면, 전자 장치는, 단계 902에서, 데이터 베이스로부터 RNN 모델 학습을 위한 테스트 데이터를 획득할 수 있다. 일 실시 예에 의한 테스트 데이터는, 다양한 종류의 수식 구조에 따라서 표현된 문자 들을 포함하는 텍스트들의 일 예를 포함할 수 있다. 또한, 일 실시 예에 의한 전자 장치는 테스트 데이터에 포함된 문자들을 수식 구조에 따라 분류하고, 분 류된 클러스터 별로 순서대로 배열하여 문자 시퀀스를 생성할 수 있다.단계 903에서, 전자 장치는, 문자 시퀀스와 대응되는 적어도 하나의 스트로크를 획득하고, 각각의 스트로 크를 문자 시퀀스와 대응되도록 정렬할 수 있다. 또한, 전자 장치는, 정렬된 스트로크로부터, RNN 모델에 입력될 수 있는 형태의 스트로크에 관한 정보를 획득할 수 있다. 단계 904에서, 전자 장치는, 단계 902에서 생성된 문자 시퀀스를 처리하여, 각 문자에 대한 기하학적 정 보를 획득할 수 있다. 단계 905에서, 전자 장치는, 단계 902, 903, 904에서 획득된 문자 시퀀스, 기하학적 정보, 및 정렬된 스 트로크에 관한 정보에 기초하여, RNN 모델을 학습할 수 있다. 예를 들면, 전자 장치는, 정렬된 스트로크 에 관한 정보가 RNN 모델에 의해 처리된 결과 데이터로부터, 단계 902에서 생성된 문자 시퀀스 및 단계 904에서 획득된 기하학적 정보가 획득될 수 있도록, RNN 모델을 학습할 수 있다. 일 실시 예에 의한 전자 장치는, RNN 모델에서 이용되는 적어도 하나의 가중치 값을 변경함으로써, RNN 모델을 학습할 수 있다. 단계 906에서, 전자 장치는, 단계 905에서, 학습된 RNN 모델을 테스트한 결과, 단계 907에서, 최종 RNN 모델을 구성할 수 있다. 예를 들면, 전자 장치는, 단계 905에서, 학습된 RNN 모델에 정렬된 스트로크에 관한 정보를 입력한 결과 출력된 데이터로부터, 단계 902에서 생성된 문자 시퀀스 및 단계 904에서 획득된 기하 학적 정보가 획득될 수 있는지 여부를 판단할 수 있다. 일 실시 예에 의한 전자 장치는, 단계 907에서, 최종적으로 구성된 RNN 모델에 따라 획득된 문자 시퀀스 및 기하학적 정보에 기초하여, 단계 908에서, 수식 구조에 따라 표현된 적어도 하나의 문자를 생성할 수 있다. 일 실시 예에 의한 전자 장치는 수식 구조에 따라 표현된 적어도 하나의 문자를 생성한 결과와, 데이터 베이스에 포함된 수식 구조에 따라 표현된 문자들을 비교함으로써, RNN 모델을 다시 갱신할 수 있다. 도 10을 일 실시 예에 따라, CYK 알고리즘에 기초하여, 문자 시퀀스로부터 수식 구조에 따라 표현된 문자를 획 득하는 일 예를 나타낸 것이다. 도 10을 참조하면, 일 실시 예에 의한 문자 시퀀스는, X, 2, +, Y, =, 8 의 순서대로 정렬된 적어도 하나의 문 자를 포함할 수 있다. 일 실시 예에 의한, CYK 알고리즘에 의하면, 문자 시퀀스에 포함된 문자의 개수만큼의 각 레벨에서, 스코어가 획득될 수 있고, 최종 레벨에서 획득된 스코어에 기초하여, 수식 구조에 따라 표현된 적어 도 하나의 문자를 포함하는 텍스트가 획득될 수 있다. 레벨 1에서, 문자 시퀀스에 포함된 X, 2, +, Y, =, 8 문자 각각에 대한 스코어가 획득될 수 있다. 레벨 1에서, 문자 각각에 대해 획득될 수 있는 스코어는 이하 수학식 1에 따라 획득될 수 있다. [수학식 1]"}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, HT는 문자에 대해 획득되는 스코어를 나타내고, KC, KGT는 스코어를 획득하는데 이용되는 가중치 값을 나타낸다. 또한, Sc는, RNN 모델 인식 단계에서, 획득된 각 문자의 특징에 관한 정보에 기초하여 획 득되는, 문자 스코어를 나타낸다. 또한, SGT는, PCFG 모델에 따라, 결정될 수 있는 각 문자의 터미널 스코어를 나타낸다. 일 실시 예에 의한, PCFG 모델은 아래 표 1과 같이 구성될 수 있다. 표 1 프로덕션 규칙 확률 바이너리 프로덕션 BCMP LT BCMPR 0.07 BCMPR CT BEXP 0.1 BEXP LT BEXPR 0.22 BEXPR BT DT 0.3 BEXPR BT LT 0.7 터미널 프로덕션 Latin Terminal(LT) X 0.63 Compare Terminal(CT) = 0.37 Latin Terminal(LT) Y 1.0 Binary Terminal(BT) + 0.7 Digital Terminal(DT) 5 0.6 상술한 예에 한하지 않고, PCFG 모델은 다른 문자 및 기호에 대한 확률에 관한 정보도 더 포함할 수 있다. 예를 들면, 도 10에서, 문자 X에 대한 SGT는, PCFG 모델에 기초하여, 라틴 문자인 라틴 터미널(Latin termina l)로서, 쓰일 확률을 나타내는 터미널 스코어를 나타낼 수 있다. 또한, 문자 8에 대한 SGT는, PCFG 모델에 기초 하여, 숫자인 디지털 터미널(Digital terminal)로서, 쓰일 확률을 나타내는 터미널 스코어를 나타낼 수 있다. 레벨 2에서, 레벨 1에서 처리된 문자 중 적어도 두 개의 문자가 결합됨으로써, 수식 구조에 따라 표현된 결합된 문자들에 대한 스코어가 획득될 수 있다. 일 실시 예에 의하면, 각 문자의 기하학적 정보에 기초하여, 수식 구 조에 따라 표현된 문자들이 생성될 수 있다. 레벨 2 내지 레벨 6에서 결합된 문자들에 대한 스코어는, 이하 수학식 2에 따라 획득될 수 있다. [수학식 2]"}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 1에서, HB는 결합된 문자들에 대해 획득되는 스코어를 나타내고, KR, KLS, KLR, KGB는 스코어를 획득하는데 이용되는 가중치 값을 나타낸다. 또한, SR은 결합된 문자들에 대하여 공간 관계 모델에 의해 획득된 스코어를 나 타낸다. 또한, SLS, SLR은 결합된 문자들에 대하여 언어 모델에 의해 획득된 스코어를 나타낸다. 또한, SGB는 표 1과 같은 확률 값들을 포함하는 PCFG 모델에 기초하여, 결정될 수 있는 결합된 문자들에 대한 바 이너리 스코어를 나타낸다. 예를 들어, 문자 시퀀스의 문자들 중 + 및 Y가 PCFG 모델에서 각각 바이너리 터미널 및 라틴 터미널로서 분류되는 경우, + 및 Y가 결합된 문자열에 대한 SGB는 PCFG 모델에 기초하여, 바이너리 터미 널(BT) 및 라틴 터미널(LT)이 결합되어 표시될 확률(0.7)로 결정될 수 있다. 또한, + 및 Y가 결합된 문자열은, 표 1의 바이너리 프로덕션의 규칙에 따르면, BT LT는 BEXPR로 분류될 수 있다. 따라서, 레벨 3에서, 2와 +Y가 결합된 문자열 \"2+Y\"에 대한 바이너리 스코어 SGB는, PCFG 모델의 바이너리 프로덕션의 규칙 중 디지털 터미널(DT) 및 BEXPR이 결합되어 표시될 확률, 즉, 바이너리 프로덕션의 규칙 DT BEXPR 에 대한 확률 값으로 결정될 수 있다. 또한, HL 및 HR 은 현재 레벨에서 결합된 상위 레벨의 각 문자에 대해 획득된 스코어를 각각 의미한다. 예를 들 어, 레벨 2의 \"X2\" 문자에 대한, HL 및 HR 는 각각 상위 레벨인, 레벨 1에서 \"X\" 및 \"2\"에 대하여 획득된 HT 값 을 각각 나타낼 수 있다. 또한, P는, 패널티 모델에 기초하여, 문자 시퀀스에 대해 획득되는 스코어를 나타낸다. 일 실시 예에 의하면, 레벨 a+b에서는, 레벨 a 및 레벨 b의 문자 또는 문자열이 서로 결합되고, 상기 결합된 문 자열에 대하여, 수학식 2에 따른 스코어가 획득될 수 있다. 예를 들면, 레벨 3에서, 레벨 1의 문자 및 레벨 2의 문자열이 결합된 문자열에 대하여, 수학식 2에 따라 스코어 가 획득될 수 있다. 레벨 4에서는, 레벨 1의 문자 및 레벨 3의 문자열이 결합된 문자열 또는 레벨 2의 문자열들 이 서로 결합된 문자열에 대해, 수학식 2에 따라 스코어가 획득될 수 있다. 레벨 5 및 6에서도 마찬가지로, 상 위 레벨의 문자 또는 문자열이 결합된 문자열에 대해, 수학식 2에 따라 스코어가 획득될 수 있다. 일 실시 예에 의하면, 최종 레벨인 레벨 6에서 결합된 문자열 중 각 문자열에 대하여 획득된 수학식 2에 의한 스코어 값에 따라서, 필기 입력과 대응되는, 수식 구조에 따라 표현된 적어도 하나의 문자를 포함하는 후보 텍 스트가 결정될 수 있다. 예를 들면, 레벨 6의 \"X2+Y=8\"의 스코어 및 \"X2+Y=8\"의 스코어에 기초하여, \"X2+Y=8\"가 필기 입력과 대응되는 텍스트로 결정될 수 있다. 따라서, 일 실시 예에 의한 후보 텍스트에 대한 스코어는, CYK 알고리즘에 따라, 제1 레벨에서 획득된 상기 문 자 시퀀스의 각 문자에 대한 터미널 스코어, 및 각 레벨에서 결합된 문자들에 대하여, 적어도 하나의 문법 모델 에 기초하여 획득된 바이너리 스코어에 기초하여, 획득될 수 있다. 일 실시 예에 의하면, 터미널 스코어 및 바 이너리 스코어에 기초하여 획득된, 후보 텍스트에 대한 스코어에 기초하여, 필기 입력이 텍스트로 변환될 수 있 다. 도 11은 일 실시 예에 의한 공간 관계 모델에 의한 스코어가 결정되는 일 예를 나타낸 도면이다. 도 11을 참조하면, 일 실시 예에 따라 CYK 알고리즘에 의한 각 레벨에서 서로 결합되는 문자 또는 문자열에 대 해, 공간 관계 모델에 기초한 공간 관계가 결정될 수 있다. 일 실시 예에 의한 전자 장치는 기하학적 정 보에 따라서, 서로 결합되는 문자 또는 문자열 간의 간격, 높이 차이 등에 기초하여 FLL, FRL, FLR, FTT, FCY, FCX, FBB, FBT 중 적어도 하나를 결정할 수 있다. 일 실시 예에 의하면, 전자 장치는 상기 결정된 값을 공간 관 계 모델에 입력함으로써, 문자들 간 공간 관계를 결정할 수 있다. 상술한 예에 한하지 않고, 서로 결합되는 문자 또는 문자열의 기하학적 정보에 기초하여 결정된 다양한 정보에 따라, 공간 관계가 결정될 수 있다. 도 12는 일 실시 예에 의한 공간 관계 모델에 기초하여 결정되는 공간 관계의 일 예를 나타낸 도면이다. 일 실시 예에 의한 전자 장치는 공간 관계 모델에 기초하여, 도 12에 도시된 5가지 공간 관계인, Next(옆), Top(상단), Bottom(하단), Top Right(상단 좌측), Bottom Right(하단 좌측) 중 하나를 공간 관계 R 로 결정할 수 있다. 상술한 공간 관계의 예에 한하지 않고, 전자 장치는, 공간 관계 모델에 기초하여, 적 어도 두 개의 문자들 간의 다양한 종류의 공간 관계가 결정될 수 있다. 도 11 및 도 12에 도시된 예는 각 레벨에서 결합되는 두 문자 간 공간 관계를 결정하는 예를 나타낸 것이나, 이 에 한하지 않고, 두 개 이상의 문자들 간 공간 관계가 결정될 수 있다. 예를 들면, A 대신 C2의 텍스트와 B가 결합된 경우, C2 및 B간의 공간 관계가 결정될 수도 있다. 예를 들어, C2B와 같이, B가 C2의 옆에 위치한 경우, 공간 관계는, Next로 결정될 수 있다. 도 13은 일 실시 예에 의한 언어 모델에 따라 스코어를 결정하는 일 예를 나타낸 것이다. 일 실시 예에 의한 전자 장치는 언어 모델에 기초하여, 두 개의 스코어, SLS 및 SLR을 획득할 수 있다. 일 실시 예에 의한 SLS 은, A 이후 B가 출현할 때, A 및 B 간의 관계가 도 12의 공간 관계 모델에 따라서 R로 설정 될 확률인, P(B|AR)로 결정될 수 있다. 또한, 일 실시 예에 의한, SLR은, A 및 B 간의 관계가 도 12의 공간 관 계 모델에 따라서 R로 설정될 확률인 P(R|AB)로 결정될 수 있다. 도 13에 도시된 예는, 제1 문자 및 제2 문자 간 결정될 수 있는 언어 모델에 의한 확률 값을 나타낸 일 예이다. 예를 들어, A 이후 B 가 출현하는 경우, AB 조합에 대한 SLS 은 1301이 가리키는 확률 값으로 결정될 수 있다. 또한, 상기 AB 조합에 대한 SLR은 1301 및 1302의 확률 값이 더해진 값으로 결정될 수 있다. 일 실시 예에 의하면, 각 레벨에서 결합되는 문자 또는 문자열에 대해, 언어 모델에 기초한 스코어가 획득될 수 있다. 따라서, 도 13에 도시된 예에 한하지 않고, 일 실시 예에 의한, 언어 모델은, 두 개의 문자열 간 출현 확 률 값에 관한 정보를 더 포함할 수 있다. 예를 들면, 도 13에 도시된 제1 문자 및 제2 문자는 각각 적어도 하나 의 문자를 포함한 문자열일 수 있고, 두 문자열에 대한 확률 값이 언어 모델에 존재할 수 있다. 도 14는 일 실시 예에 의한 어느 한 문자를 기준으로 다른 문자가 식별될 수 있는 영역의 일 예를 나타낸 도면 이다. 도 14를 참조하면, 문자 A를 기준으로, 다른 문자가 식별될 수 있는 영역은, 분자 영역, 분모 영역, 상단 영역, 하단 영역, 우측/부가 대표 요소 영역 등으로 구별될 수 있다.일 실시 예에 의하면, 각 문자에 대한 기하학적 정보에 기초하여, 어느 한 문자를 기준으로 다른 문자가 존재하 는 영역이 상술한 영역 중 하나로 결정될 수 있다. 일 실시 예에 의한 전자 장치는, 상기 결정된 영역에 기초하여, 상술한 복수 개의 문자들 간 공간 관계를 결정할 수 있다. 상술한 예에 한하지 않고, 전자 장치는, 복수 개의 문자 들 간 존재하는 상대적인 영역은, 복수 개의 문 자들 간 다양한 관계 정보를 결정하는데 이용될 수 있다. 또한, 일 실시 예에 의하면, 도 14와 같이 어느 한 문자를 기준으로 결정된 영역 별로, 스트로크에 대한 클러스 터가 분류되고, 클러스터별로, 문자 시퀀스가 생성될 수 있다. 일 실시 예에 의하면, 클러스터별로 생성된 문자 시퀀스에 따라서, 각 영역과 대응되는, 수식 구조로 표현된 문자를 포함하는 텍스트가 생성될 수 있다. 또한, 각 영역에 대하여 생성된 텍스트는 각각 대응되는 영역에 기초하여, 배치됨으로써, 일 실시 예에 따라 필기 입 력과 대응되는 텍스트로서 표시될 수 있다. 도 15는 일 실시 예에 의한 필기 입력에 대해 식별되는 영역의 일 예를 나타낸 도면이다. 도 15의 1501을 참조하면, 필기 입력의 루트 기호를 기준으로, 필기 입력에서 루트 바운드 영역 및 루트 도미넌 트 영역이 식별될 수 있다. 또한, 1502를 참조하면, 필기 입력의 분수 기호를 기준으로, 필기 입력에서, 분자 영역 및 분모 영역이 식별될 수 있다. 일 실시 예에 의하면, 각각 식별된 영역 별로, 스트로크에 대한 클러스터가 분류되고, 클러스터별로, 문자 시퀀 스가 생성될 수 있다. 일 실시 예에 의하면, 클러스터별로 생성된 문자 시퀀스에 따라서, 각 영역과 대응되는, 수식 구조로 표현된 문자를 포함하는 텍스트가 생성될 수 있다. 또한, 각 영역에 대하여 생성된 텍스트는 각각 대응되는 영역에 기초하여, 배치됨으로써, 일 실시 예에 따라 필기 입력과 대응되는 텍스트로서 표시될 수 있다. 일 실시 예에 의하면, 스트로크 단위가 아닌, RNN 모델에 따라 결정된 문자 단위로, 적어도 하나의 문법 모델에 따라 결정된 스코어가 결정됨에 따라, 더 낮은 연산량으로, 필기 입력을 텍스트로 변환하기 위한 동작이 수행될 수 있다. 일 실시예는 컴퓨터에 의해 실행되는 프로그램 모듈과 같은 컴퓨터에 의해 실행가능한 명령어를 포함하는 기록 매체의 형태로도 구현될 수 있다. 컴퓨터 판독 가능 매체는 컴퓨터에 의해 액세스될 수 있는 임의의 가용 매체 일 수 있고, 휘발성 및 비휘발성 매체, 분리형 및 비분리형 매체를 모두 포함한다. 또한, 컴퓨터 판독가능 매체 는 컴퓨터 저장 매체 및 통신 매체를 모두 포함할 수 있다. 컴퓨터 저장 매체는 컴퓨터 판독가능 명령어, 데이 터 구조, 프로그램 모듈 또는 기타 데이터와 같은 정보의 저장을 위한 임의의 방법 또는 기술로 구현된 휘발성 및 비휘발성, 분리형 및 비분리형 매체를 모두 포함한다. 통신 매체는 전형적으로 컴퓨터 판독가능 명령어, 데 이터 구조, 또는 프로그램 모듈을 포함하며, 임의의 정보 전달 매체를 포함한다. 또한, 본 명세서에서, “부”는 프로세서 또는 회로와 같은 하드웨어 구성(hardware component), 및/또는 프로 세서와 같은 하드웨어 구성에 의해 실행되는 소프트웨어 구성(software component)일 수 있다."}
{"patent_id": "10-2019-0149109", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명되어 있는 각 구성 요소는 분산되어 실시될 수도 있으며, 마찬가 지로 분산된 것으로 설명되어 있는 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15"}
{"patent_id": "10-2019-0149109", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 필기 입력의 일 예를 나타낸 도면이다. 도 2는 일 실시 예에 의한 필기 입력을 텍스트로 변환하는 방법을 나타낸 블록도이다. 도 3은 일 실시 예에 의한 문자 인식 단계를 나타낸 블록도이다. 도 4는 일 실시 예에 따른 텍스트 생성 단계를 나타낸 블록도이다. 도 5는 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 6은 일 실시 예에 의한 전자 장치의 내부 구성을 설명하기 위한 블록도이다. 도 7을 일 실시 예에 의한 필기 입력을 텍스트로 변환하는 방법을 나타낸 순서도이다. 도 8은 일 실시 예에 의한 RNN 모델 중 BLSTM의 일 예를 나타낸 도면이다. 도 9는 일 실시 예에 따라, 스트로크에 관한 정보를 처리하기 위한 RNN 모델을 학습하는 일 예를 나타낸 블록도 이다. 도 10을 일 실시 예에 따라, CYK 알고리즘에 기초하여, 문자 시퀀스로부터 수식 구조에 따라 표현된 문자를 획 득하는 일 예를 나타낸 것이다. 도 11은 일 실시 예에 의한 공간 관계 모델에 의한 스코어가 결정되는 일 예를 나타낸 도면이다. 도 12는 일 실시 예에 의한 공간 관계 모델에 기초하여 결정되는 공간 관계의 일 예를 나타낸 도면이다. 도 13은 일 실시 예에 의한 언어 모델에 따라 스코어를 결정하는 일 예를 나타낸 것이다. 도 14는 일 실시 예에 의한 어느 한 문자를 기준으로 다른 문자가 식별될 수 있는 영역의 일 예를 나타낸 도면 이다. 도 15는 일 실시 예에 의한 필기 입력에 대해 식별되는 영역의 일 예를 나타낸 도면이다."}
