{"patent_id": "10-2023-0035661", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0141876", "출원번호": "10-2023-0035661", "발명의 명칭": "딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방법", "출원인": "계명대학교 산학협력단", "발명자": "김현덕"}}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "목표물까지의 거리를 측정하는 골프 레인지 파인더 장치(10)를 포함하는 골프 레인지 파인더시스템(100)으로서,사용자의 골프 플레이 시의 타격 데이터를 수집하는 골퍼 데이터 수집 모듈(110);기상 정보를 포함하는 환경 데이터를 수집하는 환경 데이터 수집 모듈(120);상기 골프 레인지 파인더 장치(10)를 통한 사용자의 입력 신호에 따라 상기 목표물까지의 거리를 측정하는 레인지 파인딩 모듈(130);상기 골프 레인지 파인더 장치(10)를 통한 사용자의 입력 신호에 따라 골프 코스의 이미지를 인식해, 위험요소, 장애물, 현재 위치와 그린 사이의 고도차를 포함하는 골프 코스 정보를 출력하는 이미지 인식 모듈(140);볼의 샷 지점과 이동 종료 지점에 대한 GPS 좌표 정보를 수집하는 GPS 모듈(150);딥러닝 알고리즘을 이용해, 상기 GPS 좌표 정보, 상기 환경 데이터, 상기 목표물까지의 거리 및 상기 골프 코스정보로부터 클럽 정보 및 구간별 샷 정보를 출력하는 인공지능 모듈(160);채팅 형식으로 사용자의 쿼리에 대응해 답변을 생성하되, 입력된 사용자의 쿼리를 분석하고, 상기 인공지능 모듈(160)이 출력한 클럽 정보 및 구간별 샷 정보를 이용해, 분석한 쿼리에 대응하여 골프 코스 공략을 위한 개인맞춤형 조언을 답변으로 생성하는 챗봇 모듈(170); 및상기 골프 레인지 파인더 장치(10)의 일측에 구비된 디스플레이(11) 또는 스피커(12)를 통해 상기 챗봇 모듈(170)이 생성한 답변을 출력해 사용자에게 제공하는 출력 모듈(180)을 포함하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 타격 데이터는,클럽 헤드 스피드, 볼 스피드, 캐리, 비거리, 스핀양, 론치 앵글, 어택 앵글, 다이내믹 로프트, 페이스 앵글 및스매시 팩터를 포함하는 군에서 선택된 적어도 하나 이상으로, 골프 스윙 분석 장치를 통해 수집된 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 환경 데이터는,해당 지역의 기상 센서 및 기상 센터에서 전달받은 풍향, 풍속, 습도 및 기압을 포함하는 기상 정보를포함하며, 골프장 정보 및 코스 정보를 더 포함하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 인공지능 모듈(160)은,상기 타격 데이터를 이용해 사전 학습된 딥러닝 알고리즘을 추가 학습해, 사용자 맞춤형 딥러닝 알고리즘을 생성하며, 상기 사용자 맞춤형 딥러닝 알고리즘을 이용해 상기 클럽 정보 및 구간별 샷 정보를 출력하는 것을 특공개특허 10-2024-0141876-3-징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 챗봇 모듈(170)은,자연어 처리 기술을 이용해 상기 사용자의 쿼리를 분석하고, 자연어 형태로 상기 개인 맞춤형 조언을 생성하는것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 출력 모듈(180)은,상기 사용자의 쿼리가 입력된 방식에 따라 상기 디스플레이(11) 또는 스피커(12)를 통해 상기 개인 맞춤형 조언을 출력하되, TTS(Text To Speech) 알고리즘을 내장해 상기 답변을 음성으로 변환해 상기 스피커(12)를 통해 출력하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 타격 데이터를 이용해, 사용자의 클럽별 평균 거리를 포함한 타구 정보, 및 상황별 클럽 선택 선호도를 포함하는 사용자 타격 정보를 분석하는 골퍼 분석 모듈(190)을 더 포함하며,상기 챗봇 모듈(170)은,상기 골퍼 분석 모듈(190)에서 분석한 상기 사용자 타격 정보와 현재 플레이 중인 게임 현황을 반영해, 상기 개인 맞춤형 조언을 답변으로 생성하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 골퍼 분석 모듈(190)은,상기 타격 데이터를 누적 분석해 상기 사용자 타격 정보를 추적 관찰하고, 상기 출력 모듈(180)을 통해 상기 사용자 타격 정보의 추적 관찰 데이터를 제공하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "골프 레인지 파인더 서비스 제공 방법으로서, 목표물까지의 거리를 측정하는 골프 레인지 파인더 장치(10)를 포함하는 골프 레인지 파인더 시스템(100)에서 각 단계가 수행되며,(1) 사용자의 골프 플레이 시의 타격 데이터를 수집하는 단계;(2) 기상 정보를 포함하는 환경 데이터를 수집하는 단계;(3) 상기 골프 레인지 파인더 장치(10)를 통한 사용자의 입력 신호에 따라 상기 목표물까지의 거리를 측정하는단계;(4) 상기 골프 레인지 파인더 장치(10)를 통한 사용자의 입력 신호에 따라 골프 코스의 이미지를 인식해, 위험요소, 장애물, 현재 위치와 그린 사이의 고도차를 포함하는 골프 코스 정보를 출력하는 단계;(5) 볼의 샷 지점과 이동 종료 지점에 대한 GPS 좌표 정보를 수집하는 단계;공개특허 10-2024-0141876-4-(6) 딥러닝 알고리즘을 이용해, 상기 GPS 좌표 정보, 상기 환경 데이터, 상기 목표물까지의 거리 및 상기 골프코스 정보로부터 클럽 정보 및 구간별 샷 정보를 출력하는 단계;(7) 챗봇 기능을 이용해 채팅 형식으로 사용자의 쿼리에 대응해 답변을 생성하되, 입력된 사용자의 쿼리를 분석하고, 상기 단계 (6)에서 출력된 클럽 정보 및 구간별 샷 정보를 이용해, 분석한 쿼리에 대응하여 골프 코스 공략을 위한 개인 맞춤형 조언을 답변으로 생성하는 단계; 및(8) 상기 골프 레인지 파인더 장치(10)의 일측에 구비된 디스플레이(11) 또는 스피커(12)를 통해 상기 단계(7)에서 생성된 답변을 출력해 사용자에게 제공하는 단계를 포함하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 타격 데이터는,클럽 헤드 스피드, 볼 스피드, 캐리, 비거리, 스핀양, 론치 앵글, 어택 앵글, 다이내믹 로프트, 페이스 앵글 및스매시 팩터를 포함하는 군에서 선택된 적어도 하나 이상으로, 골프 스윙 분석 장치를 통해 수집된 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서, 상기 환경 데이터는,해당 지역의 기상 센서 및 기상 센터에서 전달받은 풍향, 풍속, 습도 및 기압을 포함하는 기상 정보를포함하며, 골프장 정보 및 코스 정보를 더 포함하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프레인지 파인더 서비스 제공 방법."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제9항에 있어서, 상기 단계 (1)과 단계 (2) 사이에는,(1-6) 상기 타격 데이터를 이용해 사전 학습된 딥러닝 알고리즘을 추가 학습해, 사용자 맞춤형 딥러닝 알고리즘을 생성하는 단계를 더 포함하며,상기 단계 (6)에서는,상기 사용자 맞춤형 딥러닝 알고리즘을 이용해 상기 클럽 정보 및 구간별 샷 정보를 출력하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제9항에 있어서, 상기 단계 (7)에서는,자연어 처리 기술을 이용해 상기 사용자의 쿼리를 분석하고, 자연어 형태로 상기 개인 맞춤형 조언을 생성하는것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제9항에 있어서, 상기 단계 (8)에서는,상기 사용자의 쿼리가 입력된 방식에 따라 상기 디스플레이(11) 또는 스피커(12)를 통해 상기 개인 맞춤형 조언을 출력하되, TTS(Text To Speech) 알고리즘을 내장해 상기 답변을 음성으로 변환해 상기 스피커(12)를 통해 출력하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100).공개특허 10-2024-0141876-5-청구항 15 제9항에 있어서, 상기 단계 (1)과 단계 (2) 사이에는,(1-5) 상기 타격 데이터를 이용해, 사용자의 클럽별 평균 거리를 포함한 타구 정보, 및 상황별 클럽 선택 선호도를 포함하는 사용자 타격 정보를 분석하는 단계를 더 포함하며,상기 단계 (6)에서는,상기 단계 (1-5)에서 분석한 상기 사용자 타격 정보와 현재 플레이 중인 게임 현황을 반영해, 상기 개인 맞춤형조언을 답변으로 생성하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 단계 (1-5)에서는,상기 타격 데이터를 누적 분석해 상기 사용자 타격 정보를 추적 관찰하고, 상기 디스플레이(11) 또는 스피커(12)를 통해 상기 사용자 타격 정보의 추적 관찰 데이터를 제공하는 것을 특징으로 하는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템(100)."}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템에 관한 것으로서, 보다 구체적으로는 목표 물까지의 거리를 측정하는 골프 레인지 파인더 장치를 포함하는 골프 레인지 파인더 시스템으로서, 사용자의 골 프 플레이 시의 타격 데이터를 수집하는 골퍼 데이터 수집 모듈; 기상 정보를 포함하는 환경 데이터를 수집하는 (뒷면에 계속)"}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 골프 레인지 파인더 시스템 및 서비스 제공 방법에 관한 것으로서, 보다 구체적으로는 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방법에 관한 것이다."}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 부분에 기술된 내용은 단순히 본 발명의 일실시예에 대한 배경 정보를 제공할 뿐 종래기술을 구성하는 것은 아니다. 골프 코스에서 골퍼들은 플레이 시 공략 방법, 거리 측정, 그린의 경사도 및 그 외 필요한 정보들을 골프 경기 보조원(캐디)에 의존해 왔다. 근래에는 스포츠용품 기술의 발달로 거리 및 경사도 측정을 위한 거리 측정기 (망원 스코프 형 레이저 혹은 레이저 도플러 모듈이 있는 휴대장치), GPS 기반 휴대용 단말기 (시계형 및 스마 트 기기의 애플리케이션) 등을 활용하고 있다. 이러한 장치들은 골퍼가 경기를 위해 더 나은 결정을 내리는 데 필요한 신뢰할 수 있는 정보 제공을 위한 것이다. 특히, 골프 레인지 파인더는 골프 선수들이 골프 코스의 특정 지점까지의 거리(플래그스틱 또는 해저드)를 측정 할 수 있도록 도와주는 장치이다. 대부분의 골프 레인지 파인더들은 레이저 기술을 사용하여 레이저 빔을 목표 물에서 튕기고 빔이 돌아오는 데 걸리는 시간을 기준으로 거리를 산출한다. 이러한 골프 레인지 파인더는 골퍼들과 그들의 경기를 보조하는 경기보조원(캐디) 모두에게 필수적인 도구로 사 용되고 있다. 골프 캐디(Golf Caddy)는 골프 라운드 동안 골프 선수와 동행하여 다양한 종류의 도움과 지원을 제공하는 사람을 말한다. 골프 캐디의 역할은 상황과 골프 선수의 선호도에 따라 달라질 수 있지만, 일반적인 업무와 책임은 다음과 같다: 골프채 운반, 거리, 코스 공략 및 그린 판독 정보 제공, 적절한 클럽 의 선택, 팀의 경기 진행 관리, 장비 및 코스 에티켓 유지 관리 등. 골퍼들은 자발적 판단에 의한 플레이를 위해 보다 다양한 도구와 장비를 사용하고 있으나, 최종적 조언은 캐디 를 통해 이루어지는 경우가 많다. 그러나 캐디들의 조언 수준은 개인의 경력, 골프에 대한 이해도 및 경험과 같은 다양한 조건에 의해 결정되며, 신뢰성에 대한 이슈가 존재한다. 또한, 골프장에서 캐디 제도를 운용하는 데 있어 높은 비용이 들고, 빈번한 캐디안전사고, 캐디의 고용안정 이슈들은 골프 산업의 진정한 대중화를 방해 하는 상황을 야기하기도 한다. 따라서 인간의 잠재적 편견을 최소화하고, 골퍼의 자발적 판단에 의한 플레이를 보조할 수 있는 장비의 개발이 필요하다. 한편, 본 발명과 관련된 선행기술로, 공개특허 제10-2018-0118473호(발명의 명칭: GPS 및 골프장 이미지를 이용 하는 복합 레이저 거리 측정기, 공개 일자: 2018년 10월 31일) 등이 개시된 바 있다. 전술한 배경 기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지 기술이라 할 수는 없다."}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 기존에 제안된 방법들의 상기와 같은 문제점들을 해결하기 위해 제안된 것으로서, 골프 레인지 파인 더 장치에서 측정한 목표물까지의 거리, 이미지 인식을 통한 골프 코스 정보, GPS 좌표 정보와 함께, 기상 정보 등의 환경 데이터, 미리 수집한 사용자의 타격 데이터를 딥러닝 알고리즘을 통해 분석하고, 분석 결과를 이용해 사용자의 쿼리에 대응하여 골프 코스 공략을 위한 개인 맞춤형 조언을 답변으로 생성해 채팅 형식으로 제공함으 로써, 인간의 잠재적 편견 없이 객관적 정보에 기초하여 최적의 조언을 해 주어, 골퍼의 자발적 판단에 의한 플 레이를 보조할 수 있는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방법을 제공 하는 것을 그 목적으로 한다. 또한, 본 발명은, 챗봇을 통해 사용자의 쿼리를 분석하고, 분석한 쿼리에 대응해 개인 맞춤형 조언을 음성 또는 텍스트를 이용해 대화 형식으로 제공함으로써, 사용자가 여러 기능을 익힐 필요 없이 자연스럽게 질문을 하는 것으로 원하는 정보를 얻을 수 있어서 사용자 친화적으로 골프 코스 공략을 위한 조언을 얻을 수 있는, 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방법을 제공하는 것을 또 다른 목적으로 한 다. 다만, 본 발명이 이루고자 하는 기술적 과제는 상기한 바와 같은 기술적 과제로 한정되지 않으며, 또 다른 기술 적 과제들이 존재할 수 있고, 명시적으로 언급하지 않더라도"}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이나 실시 형태로부터 파악될 수 있는 목적이나 효과도 이에 포함됨은 물론이다."}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "과제의 해결 수단 상기한 목적을 달성하기 위한 본 발명의 특징에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 은, 목표물까지의 거리를 측정하는 골프 레인지 파인더 장치를 포함하는 골프 레인지 파인더 시스템으로서, 사용자의 골프 플레이 시의 타격 데이터를 수집하는 골퍼 데이터 수집 모듈; 기상 정보를 포함하는 환경 데이터를 수집하는 환경 데이터 수집 모듈; 상기 골프 레인지 파인더 장치를 통한 사용자의 입력 신호에 따라 상기 목표물까지의 거리를 측정하는 레인지 파인딩 모듈; 상기 골프 레인지 파인더 장치를 통한 사용자의 입력 신호에 따라 골프 코스의 이미지를 인식해, 위험 요소, 장 애물, 현재 위치와 그린 사이의 고도차를 포함하는 골프 코스 정보를 출력하는 이미지 인식 모듈; 볼의 샷 지점과 이동 종료 지점에 대한 GPS 좌표 정보를 수집하는 GPS 모듈; 딥러닝 알고리즘을 이용해, 상기 GPS 좌표 정보, 상기 환경 데이터, 상기 목표물까지의 거리 및 상기 골프 코스 정보로부터 클럽 정보 및 구간별 샷 정보를 출력하는 인공지능 모듈; 채팅 형식으로 사용자의 쿼리에 대응해 답변을 생성하되, 입력된 사용자의 쿼리를 분석하고, 상기 인공지능 모 듈이 출력한 클럽 정보 및 구간별 샷 정보를 이용해, 분석한 쿼리에 대응하여 골프 코스 공략을 위한 개인 맞춤 형 조언을 답변으로 생성하는 챗봇 모듈; 및 상기 골프 레인지 파인더 장치의 일측에 구비된 디스플레이 또는 스피커를 통해 상기 챗봇 모듈이 생성한 답변 을 출력해 사용자에게 제공하는 출력 모듈을 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 타격 데이터는, 클럽 헤드 스피드, 볼 스피드, 캐리, 비거리, 스핀양, 론치 앵글, 어택 앵글, 다이내믹 로프트, 페이스 앵글 및 스매시 팩터를 포함하는 군에서 선택된 적어도 하나 이상으로, 골프 스윙 분석 장치를 통해 수집될 수 있다. 바람직하게는, 상기 환경 데이터는, 해당 지역의 기상 센서 및 기상 센터에서 전달받은 풍향, 풍속, 습도 및 기압을 포함하는 기상 정보를 포함하며, 골프장 정보 및 코스 정보를 더 포함할 수 있다. 바람직하게는, 상기 인공지능 모듈은, 상기 타격 데이터를 이용해 사전 학습된 딥러닝 알고리즘을 추가 학습해, 사용자 맞춤형 딥러닝 알고리즘을 생 성하며, 상기 사용자 맞춤형 딥러닝 알고리즘을 이용해 상기 클럽 정보 및 구간별 샷 정보를 출력할 수 있다. 바람직하게는, 상기 챗봇 모듈은, 자연어 처리 기술을 이용해 상기 사용자의 쿼리를 분석하고, 자연어 형태로 상기 개인 맞춤형 조언을 생성할 수 있다. 바람직하게는, 상기 출력 모듈은, 상기 사용자의 쿼리가 입력된 방식에 따라 상기 디스플레이 또는 스피커를 통해 상기 개인 맞춤형 조언을 출력 하되, TTS(Text To Speech) 알고리즘을 내장해 상기 답변을 음성으로 변환해 상기 스피커를 통해 출력할 수 있 다. 바람직하게는, 상기 타격 데이터를 이용해, 사용자의 클럽별 평균 거리를 포함한 타구 정보, 및 상황별 클럽 선택 선호도를 포 함하는 사용자 타격 정보를 분석하는 골퍼 분석 모듈을 더 포함하며, 상기 챗봇 모듈은, 상기 골퍼 분석 모듈에서 분석한 상기 사용자 타격 정보와 현재 플레이 중인 게임 현황을 반영해, 상기 개인 맞 춤형 조언을 답변으로 생성할 수 있다. 더욱 바람직하게는, 상기 골퍼 분석 모듈은, 상기 타격 데이터를 누적 분석해 상기 사용자 타격 정보를 추적 관찰하고, 상기 출력 모듈을 통해 상기 사용자 타격 정보의 추적 관찰 데이터를 제공할 수 있다. 상기한 목적을 달성하기 위한 본 발명의 특징에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법은, 골프 레인지 파인더 서비스 제공 방법으로서, 목표물까지의 거리를 측정하는 골프 레인지 파인더 장치를 포함하 는 골프 레인지 파인더 시스템에서 각 단계가 수행되며, 사용자의 골프 플레이 시의 타격 데이터를 수집하는 단계; 기상 정보를 포함하는 환경 데이터를 수집하는 단계; 상기 골프 레인지 파인더 장치를 통한 사용자의 입력 신호에 따라 상기 목표물까지의 거리를 측정하는 단계; 상기 골프 레인지 파인더 장치를 통한 사용자의 입력 신호에 따라 골프 코스의 이미지를 인식해, 위험 요소, 장애물, 현재 위치와 그린 사이의 고도차를 포함하는 골프 코스 정보를 출력하는 단계; 볼의 샷 지점과 이동 종료 지점에 대한 GPS 좌표 정보를 수집하는 단계; 딥러닝 알고리즘을 이용해, 상기 GPS 좌표 정보, 상기 환경 데이터, 상기 목표물까지의 거리 및 상기 골프 코스 정보로부터 클럽 정보 및 구간별 샷 정보를 출력하는 단계; 챗봇 기능을 이용해 채팅 형식으로 사용자의 쿼리에 대응해 답변을 생성하되, 입력된 사용자의 쿼리를 분석 하고, 상기 단계 에서 출력된 클럽 정보 및 구간별 샷 정보를 이용해, 분석한 쿼리에 대응하여 골프 코스 공 략을 위한 개인 맞춤형 조언을 답변으로 생성하는 단계; 및 상기 골프 레인지 파인더 장치의 일측에 구비된 디스플레이 또는 스피커를 통해 상기 단계 에서 생성된 답변을 출력해 사용자에게 제공하는 단계를 포함하는 것을 그 구성상의 특징으로 한다. 바람직하게는, 상기 타격 데이터는, 클럽 헤드 스피드, 볼 스피드, 캐리, 비거리, 스핀양, 론치 앵글, 어택 앵글, 다이내믹 로프트, 페이스 앵글 및 스매시 팩터를 포함하는 군에서 선택된 적어도 하나 이상으로, 골프 스윙 분석 장치를 통해 수집될 수 있다. 바람직하게는, 상기 환경 데이터는, 해당 지역의 기상 센서 및 기상 센터에서 전달받은 풍향, 풍속, 습도 및 기압을 포함하는 기상 정보를 포함하며, 골프장 정보 및 코스 정보를 더 포함할 수 있다. 바람직하게는, 상기 단계 과 단계 사이에는, (1-6) 상기 타격 데이터를 이용해 사전 학습된 딥러닝 알고리즘을 추가 학습해, 사용자 맞춤형 딥러닝 알고리즘 을 생성하는 단계를 더 포함하며, 상기 단계 에서는, 상기 사용자 맞춤형 딥러닝 알고리즘을 이용해 상기 클럽 정보 및 구간별 샷 정보를 출력할 수 있다. 바람직하게는, 상기 단계 에서는, 자연어 처리 기술을 이용해 상기 사용자의 쿼리를 분석하고, 자연어 형태로 상기 개인 맞춤형 조언을 생성할 수 있다.바람직하게는, 상기 단계 에서는, 상기 사용자의 쿼리가 입력된 방식에 따라 상기 디스플레이 또는 스피커를 통해 상기 개인 맞춤형 조언을 출력 하되, TTS(Text To Speech) 알고리즘을 내장해 상기 답변을 음성으로 변환해 상기 스피커를 통해 출력할 수 있 다. 바람직하게는, 상기 단계 과 단계 사이에는, (1-5) 상기 타격 데이터를 이용해, 사용자의 클럽별 평균 거리를 포함한 타구 정보, 및 상황별 클럽 선택 선호 도를 포함하는 사용자 타격 정보를 분석하는 단계를 더 포함하며, 상기 단계 에서는, 상기 단계 (1-5)에서 분석한 상기 사용자 타격 정보와 현재 플레이 중인 게임 현황을 반영해, 상기 개인 맞춤형 조언을 답변으로 생성할 수 있다. 더욱 바람직하게는, 상기 단계 (1-5)에서는, 상기 타격 데이터를 누적 분석해 상기 사용자 타격 정보를 추적 관찰하고, 상기 디스플레이 또는 스피커를 통해 상기 사용자 타격 정보의 추적 관찰 데이터를 제공할 수 있다."}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에서 제안하고 있는 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방법에 따르면, 골프 레인지 파인더 장치에서 측정한 목표물까지의 거리, 이미지 인식을 통한 골프 코스 정보, GPS 좌 표 정보와 함께, 기상 정보 등의 환경 데이터, 미리 수집한 사용자의 타격 데이터를 딥러닝 알고리즘을 통해 분 석하고, 분석 결과를 이용해 사용자의 쿼리에 대응하여 골프 코스 공략을 위한 개인 맞춤형 조언을 답변으로 생 성해 채팅 형식으로 제공함으로써, 인간의 잠재적 편견 없이 객관적 정보에 기초하여 최적의 조언을 해 주어, 골퍼의 자발적 판단에 의한 플레이를 보조할 수 있다. 또한, 본 발명에서 제안하고 있는 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방 법에 따르면, 챗봇을 통해 사용자의 쿼리를 분석하고, 분석한 쿼리에 대응해 개인 맞춤형 조언을 음성 또는 텍 스트를 이용해 대화 형식으로 제공함으로써, 사용자가 여러 기능을 익힐 필요 없이 자연스럽게 질문을 하는 것으로 원하는 정보를 얻을 수 있어서 사용자 친화적으로 골프 코스 공략을 위한 조언을 얻을 수 있다. 더불어, 본 발명의 다양하면서도 유익한 장점과 효과는 상술한 내용에 한정되지 않으며, 본 발명의 구체적인 실 시 형태를 설명하는 과정에서 보다 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 본 발명의 실시예를 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며, 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였 다. 명세서 전체에서, 어떤 부분이 다른 부분과 \"연결\"되어 있다고 할 때, 이는 \"직접적으로 연결\"되어 있는 경우뿐 아니라, 그 중간에 다른 소자를 사이에 두고 \"간접적으로 연결\"되어 있는 경우도 포함한다. 또한 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아 니라 다른 구성요소를 더 포함할 수 있는 것을 의미하며, 하나 또는 그 이상의 다른 특징이나 숫자, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해 되어야 한다. 이하의 실시예는 본 발명의 이해를 돕기 위한 상세한 설명이며, 본 발명의 권리 범위를 제한하는 것이 아니다. 따라서 본 발명과 동일한 기능을 수행하는 동일 범위의 발명 역시 본 발명의 권리 범위에 속할 것이다. 또한, 본 발명의 각 실시예에 포함된 각 구성, 과정, 공정 또는 방법 등은 기술적으로 상호간 모순되지 않는 범 위 내에서 공유될 수 있다. 또한, 본 발명에 있어서 단말, 장치 또는 디바이스가 수행하는 것으로 기술된 동작이나 기능 중 일부는 해당 단 말, 장치 또는 디바이스와 연결된 서버에서 대신 수행될 수 있다. 마찬가지로, 서버가 수행하는 것으로 기술된 동작이나 기능 중 일부도 해당 서버와 연결된 단말, 장치 또는 디바이스에서 수행될 수도 있다. 특히, 본 발명의 각 실시예에 따른 시스템을 실행시키기 위한 수단으로는 애플리케이션(Application), 또는 웹 서버일 수 있으며, 이 애플리케이션, 또는 웹 서버를 기록한 기록매체를 읽을 수 있는 수단인 단말로는, 일반적 인 데스크톱이나 노트북 등의 일반 PC뿐만 아니라, 스마트 폰, 태블릿 PC, 등의 모바일 단말기를 포함할 수 있 다. 이하, 첨부된 도면을 참고하여 본 발명의 실시예들을 상세히 설명하도록 한다. 도 1은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 장치 구성 을 도시한 도면이다. 도 1에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템은, 목표물까지의 거리를 측정하는 골프 레인지 파인더 장치를 포함하여 구성 될 수 있으며, 서비스 서버 및 사용자 단말기를 더 포함하여 구성될 수 있다. 보다 구체적으로, 골프 레인지 파인더 장치는 서비스 서버 및 사용자 단말기와 네트워크를 통해 통신할 수 있으며, 서비스 서버가 제공하는 클라우드 서비스를 통해 딥러닝 기반 데이터 분석, 데이터 공유 등을 할 수 있다. 여기서, 네트워크는 근거리 통신망(Local Area Network; LAN), 광역 통신망(Wide Area Network; WAN) 또는 부 가가치 통신망(Value Added Network; VAN) 등과 같은 유선 네트워크나 이동 통신망(mobile radio communication network), 위성 통신망, 블루투스(Bluetooth), Wibro(Wireless Broadband Internet), HSDPA(High Speed Downlink Packet Access), LTE(Long Term Evolution), 3/4/5/6G(3/4/5/6th Generation Mobile Telecommunication) 등과 같은 모든 종류의 무선 네트워크로 구현될 수 있다. 이하에서는, 도 1을 참조하여 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시 스템을 구성하는 장치에 대해 상세히 설명하도록 한다. 골프 레인지 파인더 장치는, 레이저 등을 이용해 목표물까지의 거리를 측정하고, 망원 렌즈를 통해 입력되 는 골프 코스 이미지를 인식하는 장치일 수 있다. 골프 레인지 파인더 장치는 사용자가 한 손에 들고 핀, 그린, IP 지점 등의 목표물을 쉽게 조준할 수 있도록 경량의 소형 휴대장치로 구성하여, 사용자가 골프 코스에 서 사용 시 부담을 최소화할 수 있다. 도 2 및 도 3은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템에서, 골프 레인지 파인더 장치의 모습을 예를 들어 도시한 도면이다. 도 2 및 도 3에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 골프 레인지 파인더 장치는, 사용자가 한 손에 들 수 있는 소형의 휴대 가능한 장치이며, 챗봇 기능을 사용하여 대화 형식으로 사용자가 쿼리를 입력하고 답변을 확인할 수 있도록, 디스플레이 및 스피커 중 적어도 하나를 포함할 수 있다. 보다 구체적으로, 사용자가 골프 레인지 파인더 장치를 손에 든 상태에서 망원 렌즈를 통해 보이는 목표물 을 조준하고, 일측에 구비된 입력 버튼이나 터치스크린 형태의 디스플레이를 통해 신호를 입력할 수 있 다. 사용자의 입력 신호에 따라, 추후 상세히 설명할 레인지 파인딩 모듈이 활성화되어 레이저 등의 거리 센서를 통해 목표물까지의 거리가 측정되며, 측정된 거리는 디스플레이에 표시될 수 있다. 그 다음 사 용자가 골프 레인지 파인더 장치의 일측에 구비된 다른 입력 버튼이나 디스플레이를 통해 신호를 입력하면, 추후 상세히 설명할 이미지 인식 모듈이 활성화될 수 있다. 이미지 인식 모듈은 카메라 를 통해 골프 코스의 이미지를 캡처하고 위험 요소, 장애물, 현재 위치와 그린 사이의 고도 차이 등을 식별 할 수 있다. 식별된 정보는 디스플레이에 표시될 수 있다. 서비스 서버는, 골프 레인지 파인더 장치, 사용자 단말기 등과 통신을 수행하여 클라우드를 통해 데이터를 공유하는 서버일 수 있다. 이때, 서비스 서버는, 휴대장치인 골프 레인지 파인더 장치나 사 용자 단말기에서는 구동하기 어려운 고성능의 빅데이터 처리 알고리즘, 딥러닝 알고리즘 등에 의한 분석 서 비스를 클라우드 기반으로 제공하고, 분석 결과를 골프 레인지 파인더 장치나 사용자 단말기를 통해 사 용자에게 제공하고 공유할 수 있다. 사용자 단말기는, 골프 플레이어, 골프 트레이너, 캐디 등 골프 레인지 파인더 장치를 휴대하고 골프 코스에서 사용함으로써, 골프 레인지 파인더 서비스를 이용하는 클라이언트 단말기로서, 골프 플레이어, 골프 트레이너, 캐디 등의 사용자가 사용하는 전자장치로 구현될 수 있다. 여기서, 전자장치는 스마트폰, 태블릿 (tablet) PC(personal computer), 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑(desktop) PC, 랩탑(laptop) PC, 넷북(netbook) 컴퓨터, 워크스테이션(workstation), 서버(server), PDA(personal digital assistant), 미디어 박스, 게임 콘솔, 전자사전 또는 웨어러블 장치(wearable device) 중 적어도 하나를 포함할 수 있으며, 웨어러블 장치는 액세서리형(예: 시계, 반지, 팔찌, 발찌, 목걸이, 안경, 콘택트렌즈, 또는 머리착 용형 장치(HMD, head-mounted-device), 직물 또는 의류 일체형(예: 전자 의복), 신체 부착형(예: 스킨 패드 (skin pad) 또는 문신), 또는 생체 이식형 회로(implantable circuit) 중 적어도 하나를 포함할 수 있다. 다 양한 실시예들에서, 전자장치는 전술한 기기들에 한정되지는 않으며, 전술한 다양한 장치 중 둘 이상의 조합일 수 있다. 도 4는 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템에서, 골프 레인지 파인더 장치와 사용자 단말기가 통신하는 모습을 도시한 도면이다. 도 4에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템에서는, 골프 레인지 파인더 장치와 사용자 단말기가 블루투스 등의 근거리 무선 통신이나 이동통신망, Wifi, LTE, 3/4/5/6G 등의 무선 네트워크로 연결되어 데이터를 주고받을 수 있다. 따라서 사용자는 골프 레인지 파인더 장치에 서 측정된 거리나 골프 코스 정보 등을 스마트워치나 스마트폰 등의 사용자 단말기에서도 쉽게 확인할 수 있다. 도 5는 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 세부적인 구성을 도시한 도면이다. 도 5에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템은, 골퍼 데이터 수집 모듈, 환경 데이터 수집 모듈, 레인지 파인딩 모듈, 이미지 인식 모듈, GPS 모듈, 인공지능 모듈, 챗봇 모듈 및 출력 모듈을 포함하여 구성될 수 있으며, 골퍼 분석 모듈을 더 포함하여 구성될 수 있다. 여기서, 본 발명의 일실시예 에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템을 구성하는 각 모듈의 기능은, 골프 레 인지 파인더 장치, 서비스 서버 및 사용자 단말기에서 수행될 수 있으며, 각 모듈의 특정 기능을 복수의 장치가 분산 처리할 수도 있다. 이하에서는, 도 5를 참조하여 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 각 구성에 대해 상세히 설명하도록 한다. 골퍼 데이터 수집 모듈은, 사용자의 골프 플레이 시의 타격 데이터를 수집할 수 있다. 골퍼 데이터 수집 모듈은, 이러한 타격 데이터를 사전에 입력받고, 추후 상세히 설명할 골퍼 분석 모듈을 통해 분석함 으로써, 사용자의 골프 스윙 특성, 클럽별 샷 특성 등을 파악할 수 있다. 여기서, 타격 데이터는, 클럽 헤드 스피드, 볼 스피드, 캐리, 비거리, 스핀양, 론치 앵글, 어택 앵글, 다이내믹 로프트, 페이스 앵글 및 스매시 팩터를 포함하는 군에서 선택된 적어도 하나 이상으로, 골프 스윙 분석 장치를 통해 수집된 것일 수 있다. 이때, 골프 스윙 분석 장치는, 골프 연습장, 스크린 골프장 등에 구비된 스윙 분석 시스템이나 골프 코스에서 사용자가 직접 설치하고 볼을 타격해 스윙 분석을 할 수 있는 스윙 분석용 휴대장치 등을 포함할 수 있다. 한편, 골퍼 데이터 수집 모듈은, 골프 라운딩 시마다 또는 주기적으로 해당 사용자의 타격 데이터를 요청 하고 수집함으로써, 누적된 타격 데이터의 분석을 통해 정확한 정보가 도출되도록 할 수 있다. 또한, 골퍼 데 이터 수집 모듈은 데이터 보정 기능을 포함할 수 있다. 즉, 타격 데이터 또는 분석된 스윙 특성과 클럽별 샷 특성에 대한 정보를, 골프 코스, 골프 연습장, 기상 정보 등에 따라 보정을 함으로써, 측정 환경에 영향을 받는 타격 데이터를 보정 하여 일관된 정보를 확보할 수 있다. 환경 데이터 수집 모듈은, 기상 정보를 포함하는 환경 데이터를 수집할 수 있다. 여기서, 환경 데이터는, 해당 지역의 기상 센서 및 기상 센터에서 전달받은 풍향, 풍속, 습도 및 기압을 포함하는 기상 정보를 포함하며, 골프장 정보 및 코스 정보를 더 포함할 수 있다. 환경 데이터 수집 모듈이 수집하는 골프장 정보 및 코스 정보는 해당 골프장의 코스 맵 등으로, 골프장 서버 등으로부터 미리 수집될 수 있다. 도 6은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 환경 데이 터 수집 모듈이 기상 정보를 수집하는 모습을 도시한 도면이다. 도 6에 도시된 바와 같이, 본 발명의 일 실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 환경 데이터 수집 모듈은, 풍향, 풍속, 습도, 기압 등 골프 플레이에 영향을 미칠 수 있는 기상 정보를 수집하되, 골프 코스 에 설치된 기상 센서로부터 직접 기상 정보를 수집해 데이터의 정밀성과 실시간성을 확보할 수 있다. 또한, 환 경 데이터 수집 모듈은 골프 코스에 인접한 기상 센터로부터 클라우드 기반으로 기상 정보를 수집할 수도 있다. 레인지 파인딩 모듈은, 골프 레인지 파인더 장치를 통한 사용자의 입력 신호에 따라 목표물까지의 거 리를 측정할 수 있다. 즉, 도 2 및 도 3에 도시된 골프 레인지 파인더 장치를 이용해, 사용자가 목표물을 조준하고 입력 버튼을 누르거나 터치스크린 형태의 디스플레이를 통해 입력 신호를 입력하면 레인지 파 인딩 모듈이 활성화될 수 있다. 레인지 파인딩 모듈은 레이저 등의 거리 센서를 이용해 목표물 까지의 거리를 측정하고, 측정된 거리 정보를 디스플레이에 표시하거나 스피커로 출력할 수 있다. 이미지 인식 모듈은, 골프 레인지 파인더 장치를 통한 사용자의 입력 신호에 따라 골프 코스의 이미지 를 인식해, 위험 요소, 장애물, 현재 위치와 그린 사이의 고도차를 포함하는 골프 코스 정보를 출력할 수 있다. 즉, 도 2 및 도 3에 도시된 골프 레인지 파인더 장치에서, 사용자가 카메라 화면에 공략하는 골프 코스 가 보이도록 한 상태에서 입력 버튼을 누르거나 터치스크린 형태의 디스플레이를 통해 입력 신호를 입 력하면 이미지 인식 모듈이 활성화될 수 있다. 이미지 인식 모듈은 카메라를 이용해 골프 코스 의 이미지를 캡처하고 저장하며, 영상 처리 기술을 이용해 캡처된 이미지에서 위험 요소, 장애물, 현재 위치와 그린 사이의 고도차 등을 식별할 수 있다. 이때, 캡처 또는 촬영된 이미지는 클라우드에 저장될 수 있으며, 사 용자의 골프 코스 플레이 인증, 딥러닝 알고리즘 또는 영상 처리 기술의 고도화 등을 위해 활용될 수 있다. GPS 모듈은, 볼의 샷 지점과 이동 종료 지점에 대한 GPS 좌표 정보를 수집할 수 있다. 도 7은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 GPS 모듈이 GPS 좌표 정보를 수집하는 모습을 도시한 도면이다. 도 7에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 GPS 모듈이 GPS 위성으로부터 GPS 좌표 정보를 수신 할 수 있다. 이때, GPS 모듈은 골프 레인지 파인더 장치 또는 사용자 단말기에 탑재될 수 있다. 인공지능 모듈은, 딥러닝 알고리즘을 이용해, GPS 좌표 정보, 환경 데이터, 목표물까지의 거리 및 골프 코 스 정보로부터 클럽 정보 및 구간별 샷 정보를 출력할 수 있다. 즉, 인공지능 모듈은 딥러닝 알고리즘을 이용해 다양한 데이터를 기반으로 최적의 플레이를 위한 조언과 팁 등을 출력해 사용자에게 제공할 수 있다. 인공지능 모듈은, 골프 코스 이미지와 골프 코스 정보, 목표물까지의 거리 등을 통해, 그린의 모양, 크기, 고도, 거리, 경사도 등을 통합적으로 고려할 수 있으므로, 해당 골프 코스의 공략을 위해 사용자에게 추천하는 클럽의 정보와 샷을 위한 정보를 출력할 수 있다. 여기서, 인공지능 모듈은, 사전 학습된 딥러닝 알고리즘을 타격 데이터를 이용해 추가 학습해, 사용자 맞 춤형 딥러닝 알고리즘을 생성하며, 사용자 맞춤형 딥러닝 알고리즘을 이용해 클럽 정보 및 구간별 샷 정보를 출 력할 수 있다. 즉, 딥러닝 알고리즘은 빅데이터로 사전 학습되어 골프 코스와 관련된 입력 정보로부터 클럽 정 보 및 구간별 샷 정보를 출력하는 모델로서, 인공지능 모듈은 특정 사용자의 타격 데이터를 이용해 딥러닝 알고리즘을 해당 사용자에게 최적화함으로써 사용자 맞춤형 딥러닝 알고리즘을 생성할 수 있다. 이러한 사용자 맞춤형 딥러닝 알고리즘에 의해 출력된 클럽 정보 및 구간별 샷 정보는, 해당 플레이어의 샷의 특징과 평균값 등에 따라 해당 골프 코스를 공략하기에 적합한 정보로 구성될 수 있다.챗봇 모듈은, 채팅 형식으로 사용자의 쿼리에 대응해 답변을 생성하되, 입력된 사용자의 쿼리를 분석하고, 인공지능 모듈이 출력한 클럽 정보 및 구간별 샷 정보를 이용해, 분석한 쿼리에 대응하여 골프 코스 공략 을 위한 개인 맞춤형 조언을 답변으로 생성할 수 있다. 즉, 챗봇 모듈은, 대화 형식으로 사용자의 쿼리에 답변을 하되, 인공지능 모듈의 출력 정보에 기초하여 사용자가 요구하는 골프 코스에 대한 조언, 개별 샷 에 대한 조언, 전반적인 공략 방법 등을 제공할 수 있다. 도 8은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 챗봇 모듈 이 사용자의 쿼리에 응답해 개인 맞춤형 조언을 생성하는 과정을 설명하기 위해 도시한 도면이다. 도 8에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 의 챗봇 모듈은, 인공지능 모듈의 출력과 추후 상세히 설명할 골퍼 분석 모듈의 분석 결과를 이 용해, 사용자의 쿼리에 대응한 개인 맞춤형 조언을 생성할 수 있다. 여기서, 챗봇 모듈은, 자연어 처리 기술(NLP)을 이용해 사용자의 쿼리를 분석하고, 자연어 형태로 개인 맞 춤형 조언을 생성할 수 있다. 따라서, 사용자는 친구나 캐디 등에게 조언을 구하는 것처럼 자연스러운 언어로 쿼리를 입력하고, 챗봇 모듈은 문맥을 분석해 사용자의 의도를 파악해, 의도에 맞는 조언 또는 팁을 대화 형식으로 제공할 수 있다. 실시예에 따라서, 챗봇 모듈은 생성형 인공지능을 사용해 문장을 생성함으로써, 더욱 자연스러운 문장을 사용자에게 제공할 수 있다. 출력 모듈은, 골프 레인지 파인더 장치의 일측에 구비된 디스플레이 또는 스피커를 통해 챗봇 모듈이 생성한 답변을 출력해 사용자에게 제공할 수 있다. 즉, 사용자는 음성 명령 또는 터치스크린 입력 을 통해 챗봇 기능과 상호 작용할 수 있다. 여기서, 출력 모듈은, TTS(Text To Speech) 알고리즘을 내장 해 답변을 음성으로 변환해 스피커를 통해 출력할 수 있다. 또한, 출력 모듈은, 사용자의 쿼리가 입력된 방식에 따라 디스플레이 또는 스피커를 통해 개인 맞 춤형 조언을 출력할 수 있다. 즉, 라운딩 시 골퍼가 음성으로 쿼리를 입력하면 출력 모듈은 스피커를 통해 음성으로 사용자에게 개인 맞춤형 조언을 제공할 수 있고, 터치스크린을 통해 쿼리를 입력하면 디스플레이 를 통해 텍스트, 이미지, 그래프, 동영상 등으로 사용자에게 개인 맞춤형 조언을 제공할 수 있다. 실시예 에 따라서, 사용자는 사용자 단말기의 디스플레이를 통해 쿼리에 대한 답변을 확인할 수도 있다. 골퍼 분석 모듈은, 타격 데이터를 이용해, 사용자의 클럽별 평균 거리를 포함한 타구 정보, 및 상황별 클 럽 선택 선호도를 포함하는 사용자 타격 정보를 분석할 수 있다. 보다 구체적으로, 골퍼 분석 모듈은, 타 격 데이터를 누적 분석해 사용자 타격 정보를 추적 관찰하고, 출력 모듈을 통해 사용자 타격 정보의 추적 관찰 데이터를 제공할 수 있다. 즉, 골퍼 분석 모듈은, 일정 기간 이상 타격 데이터를 누적 분석해 골퍼 의 스윙 특성, 클럽별 샷 특성과 평균값 등을 산출하고, 골프 레인지 파인더 장치의 디스플레이, 사용 자 단말기의 화면 등을 통해 텍스트, 이미지, 그래프 등 다양한 방식으로 분석 결과를 제공할 수 있다. 골 퍼 분석 모듈은, 통계 분석 알고리즘이나 인공지능 알고리즘을 이용해 분석을 수행할 수 있으며, 스윙 역 학, 샷 선택 및 게임 결과 등을 사용자의 이전 게임의 타격 데이터를 통해 학습 및 분석할 수 있다. 한편, 챗봇 모듈은, 골퍼 분석 모듈에서 분석한 사용자 타격 정보와 현재 플레이 중인 게임 현황을 반영해, 개인 맞춤형 조언을 답변으로 생성할 수 있다. 즉, 챗봇 모듈은, 사용자의 골프 플레이 이력, 상 황별 클럽 선택 선호도, 현재 게임 상태 등을 고려해 답변을 생성하며, 인공지능 모듈이 분석한 기상 정보 (바람 등), 이미지 인식 모듈이 분석한 골프 코스 정보(경사, 장애물, 위험 배치 등) 등의 요인을 이용해, 전반적인 코스 관리에 대한 조언을 생성할 수 있다.도 9는 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법의 흐름 을 도시한 도면이다. 도 9에 도시된 바와 같이, 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골 프 레인지 파인더 서비스 제공 방법은, 목표물까지의 거리를 측정하는 골프 레인지 파인더 장치를 포함하는 골프 레인지 파인더 시스템에서 각 단계가 수행되며, 사용자의 골프 플레이 시의 타격 데이터를 수집하는 단계(S110), 기상 정보를 포함하는 환경 데이터를 수집하는 단계(S120), 목표물까지의 거리를 측정하는 단계 (S130), 골프 코스의 이미지를 인식해 골프 코스 정보를 출력하는 단계(S140), GPS 좌표 정보를 수집하는 단계 (S150), 딥러닝 알고리즘을 이용해, GPS 좌표 정보, 환경 데이터, 목표물까지의 거리 및 골프 코스 정보로부터 클럽 정보 및 구간별 샷 정보를 출력하는 단계(S160), 채팅 형식으로 사용자의 쿼리에 대응해 골프 코스 공략을 위한 개인 맞춤형 조언을 답변으로 생성하는 단계(S170) 및 디스플레이 또는 스피커를 통해 답변을 출 력해 사용자에게 제공하는 단계(S180)를 포함하여 구현될 수 있다. 도 10은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법에서, 단계 S110과 단계 S120 사이의 흐름을 도시한 도면이다. 도 10에 도시된 바와 같이, 본 발명의 일실시예에 따 른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법은, 단계 S110과 단계 S120 사이에, 타 격 데이터를 이용해 사용자 타격 정보를 분석하는 단계(S115) 및 타격 데이터를 이용해 사전 학습된 딥러닝 알 고리즘을 추가 학습해, 사용자 맞춤형 딥러닝 알고리즘을 생성하는 단계(S116)를 더 포함하여 구현될 수 있다. 각각의 단계들과 관련된 상세한 내용들은, 앞서 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템과 관련하여 충분히 설명되었으므로, 상세한 설명은 생략하기로 한다. 전술한 바와 같이, 본 발명에서 제안하고 있는 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제공 방법에 따르면, 골프 레인지 파인더 장치에서 측정한 목표물까지의 거리, 이미지 인식을 통 한 골프 코스 정보, GPS 좌표 정보와 함께, 기상 정보 등의 환경 데이터, 미리 수집한 사용자의 타격 데이터를 딥러닝 알고리즘을 통해 분석하고, 분석 결과를 이용해 사용자의 쿼리에 대응하여 골프 코스 공략을 위한 개인 맞춤형 조언을 답변으로 생성해 채팅 형식으로 제공함으로써, 인간의 잠재적 편견 없이 객관적 정보에 기초하여 최적의 조언을 해 주어, 골퍼의 자발적 판단에 의한 플레이를 보조할 수 있다. 또한, 본 발명에서 제안하고 있는 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템 및 서비스 제 공 방법에 따르면, 챗봇을 통해 사용자의 쿼리를 분석하고, 분석한 쿼리에 대응해 개인 맞춤형 조언을 음성 또 는 텍스트를 이용해 대화 형식으로 제공함으로써, 사용자가 여러 기능을 익힐 필요 없이 자연스럽게 질문을 하 는 것으로 원하는 정보를 얻을 수 있어서 사용자 친화적으로 골프 코스 공략을 위한 조언을 얻을 수 있다. 한편, 본 발명은 다양한 통신 단말기로 구현되는 동작을 수행하기 위한 프로그램 명령을 포함하는 컴퓨터에서 판독 가능한 매체를 포함할 수 있다. 예를 들어, 컴퓨터에서 판독 가능한 매체는, 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD_ROM, DVD와 같은 광기록 매체(optical media), 플롭티 컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media) 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 이와 같은 컴퓨터에서 판독 가능한 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합 하여 포함할 수 있다. 이때, 컴퓨터에서 판독 가능한 매체에 기록되는 프로그램 명령은 본 발명을 구현하기 위 하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 예를 들어, 컴파일러에 의해 만들어지는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에"}
{"patent_id": "10-2023-0035661", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "의해 실행될 수 있는 고급 언어 코드를 포함할 수 있다.전술한 본 발명의 설명은 예시를 위한 것이며, 본 발명이 속하는 기술분야의 통상의 지식을 가진 자는 본 발명 의 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해 할 수 있을 것이다. 그러므로 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며 한정적이 아닌 것으로 이해해야만 한다. 예를 들어, 단일형으로 설명된 각 구성요소는 분산되어 실시될 수도 있으며, 마찬가지로 분 산된 것으로 설명된 구성 요소들도 결합된 형태로 실시될 수 있다. 본 발명의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 발명의 범위에 포함되는 것으 로 해석되어야 한다."}
{"patent_id": "10-2023-0035661", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 장치 구성을 도 시한 도면. 도 2 및 도 3은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템에서, 골 프 레인지 파인더 장치의 모습을 예를 들어 도시한 도면. 도 4는 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템에서, 골프 레인지 파인더 장치와 사용자 단말기가 통신하는 모습을 도시한 도면. 도 5는 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 세부적인 구성 을 도시한 도면. 도 6은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 환경 데이터 수집 모듈이 기상 정보를 수집하는 모습을 도시한 도면. 도 7은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 GPS 모듈이 GPS 좌표 정보를 수집하는 모습을 도시한 도면. 도 8은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 시스템의 챗봇 모듈이 사 용자의 쿼리에 응답해 개인 맞춤형 조언을 생성하는 과정을 설명하기 위해 도시한 도면. 도 9는 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법의 흐름 을 도시한 도면. 도 10은 본 발명의 일실시예에 따른 딥러닝 기반 챗봇 기능을 갖춘 골프 레인지 파인더 서비스 제공 방법에서, 단계 S110과 단계 S120 사이의 흐름을 도시한 도면."}
