{"patent_id": "10-2020-0144951", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0060054", "출원번호": "10-2020-0144951", "발명의 명칭": "스마트 헬스케어 서비스 제공 방법 및 그를 위한 장치", "출원인": "김세중", "발명자": "김세중"}}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "스마트 헬스케어 서비스 제공 방법에 있어서,스마트 헬스케어 서비스 어플리케이션이 실행된 단말로부터 카메라 센서를 통해 촬영된 개인 의료 건강 정보가포함된 이미지 데이터를 수신하는 단계;수신된 이미지 데이터에 관심영역을 설정하고, 설정된 관심영역에 대하여 데이터를 추출하는 단계;추출한 데이터를 미리 정의된 서비스 카테고리에 따라 분류하여 저장하는 단계;공공 데이터를 포함한 소스로부터 수집한 빅데이터를 이용하여 인공지능 학습 결과 헬스케어 서비스를 위한 학습 모델을 생성하는 단계;미리 정의된 서비스 카테고리에 따라 분류되어 저장된 데이터를 상기 학습 모델에 적용하여 헬스케어 서비스 데이터를 생성하는 단계; 및생성된 헬스케어 서비스 데이터가 상기 단말의 화면을 통해 출력되도록 제공하는 단계를 포함하는, 스마트 헬스케어 서비스 제공 방법."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 개인 의료 건강 정보는,전문의료기관에서 발행한 전문 의료 정보와 사용자 개인의 생체 정보 및 운동 정보가 포함된 건강 정보를 포함하되, 의료기관 방문 예약 및 방문에 관한 스케줄 정보, 방문한 의료기관에 관한 기록 정보, 건강기능식품 섭취기록 정보, 인바디 기록 정보, 및 약품 복용 기록 정보를 포함하고,상기 전문 의료 정보에는 의료기관에 의해 부여되는 약봉투, 처방전, 건강검진결과표, 및 의료진과의 문진 내용을 포함하는, 스마트 헬스케어 서비스 제공 방법."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터 추출은,수신된 이미지 데이터에 헬스케어 서비스 데이터와 관련된 관심영역(ROI: Region of Interest)를 설정하는단계; 및설정된 관심영역에 대하여 문자 인식 기술을 적용하여 미리 정의된 필요한 데이터를 추출하는 단계를 포함하는,스마트 헬스케어 서비스 제공 방법."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 서비스 카테고리는,임의 설정 가능하며, 의료 정보, 건강 관리 정보, 및 추천 정보 카테고리를 하위 카테고리로 포함하며, 서버에서 미리 학습된 결과에 기초하여 생성된 학습 모델에 따라 결정되는, 스마트 헬스케어 서비스 제공 방법."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,공개특허 10-2022-0060054-3-상기 헬스케어 정보는,수신된 개인 의료 건강 정보를 상기 서비스 카테고리 별 누적 정보 내지 히스토리 정보, 업데이트 정보, 의약품내지 건강 보조 식품 복용 알람 정보, 질병의 주기, 질병의 발병 횟수, 복약 정보, 관련된 질병 정보, 가족력정보, 예상 질병 정보, 추천 건강 기능 식품 내지 건강 보조 식품에 대한 정보를 포함하는, 스마트 헬스케어 서비스 제공 방법."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "단말로 스마트 헬스케어 서비스 제공하는 장치에 있어서,메모리; 및 프로세서;를 포함하되,상기 프로세서는,스마트 헬스케어 서비스 어플리케이션이 실행된 상기 단말로부터 카메라 센서를 통해 촬영된 개인 의료 건강 정보가 포함된 이미지 데이터를 수신하고, 수신된 이미지 데이터에 관심영역을 설정하고, 설정된 관심영역에 대하여 데이터를 추출하여, 추출한 데이터를 미리 정의된 서비스 카테고리에 따라 분류하여 상기 메모리에 저장하고, 공공 데이터를 포함한소스로부터 수집한 빅데이터를 이용하여 인공지능 학습 결과 헬스 케어 서비스를 위한 학습 모델을 생성하며,미리 정의된 서비스 카테고리에 따라 분류되고 저장된 데이터를 상기 학습 모델에 적용하여 헬스케어 서비스 데이터를 생성하여, 생성된 헬스케어 서비스 데이터가 상기 단말의 화면을 통해 출력되도록 제공하는, 스마트 헬스케어 서비스 제공 장치."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,전문의료기관에서 발행한 전문 의료 정보와 사용자 개인의 생체 정보 및 운동 정보가 포함된 건강 정보를 포함하되, 의료기관 방문 예약 및 방문에 관한 스케줄 정보, 방문한 의료기관에 관한 기록 정보, 건강기능식품 섭취기록 정보, 인바디 기록 정보, 및 약품 복용 기록 정보를 포함한 상기 개인 의료 건강 정보를 처리하고,상기 전문 의료 정보에는 의료기관에 의해 부여되는 약봉투, 처방전, 건강검진결과표, 및 의료진과의 문진 내용을 포함하는, 스마트 헬스케어 서비스 제공 장치."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 프로세서는,수신된 이미지 데이터에 헬스케어 서비스 데이터와 관련된 관심영역(ROI: Region of Interest)를 설정하고, 설정된 관심영역에 대하여 문자 인식 기술을 적용하여 미리 정의된 필요한 데이터를 추출하는, 스마트 헬스케어서비스 제공 장치."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 프로세서는,임의 설정 가능하며, 의료 정보, 건강 관리 정보, 및 추천 정보 카테고리를 하위 카테고리로 포함하며, 서버에서 미리 학습된 결과에 기초하여 생성된 학습 모델에 따라 상기 서비스 카테고리를 결정하는, 스마트 헬스케어서비스 제공 장치."}
{"patent_id": "10-2020-0144951", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2022-0060054-4-제6항에 있어서,상기 프로세서는,수신된 개인 의료 건강 정보를 상기 서비스 카테고리 별 누적 정보 내지 히스토리 정보, 업데이트 정보, 의약품내지 건강 보조 식품 복용 알람 정보, 질병의 주기, 질병의 발병 횟수, 복약 정보, 관련된 질병 정보, 가족력정보, 예상 질병 정보, 추천 건강 기능 식품 내지 건강 보조 식품에 대한 정보를 포함한 헬스케어 정보를 상기단말로 전송하는, 스마트 헬스케어 서비스 제공 장치."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일실시예에 따른 스마트 헬스케어 서비스 제공 방법은, 스마트 헬스케어 서비스 어플리케이션이 실행 된 단말로부터 카메라 센서를 통해 촬영된 개인 의료 건강 정보가 포함된 이미지 데이터를 수신하는 단계; 수신 된 이미지 데이터에 관심영역을 설정하고, 설정된 관심영역에 대하여 데이터를 추출하는 단계; 추출한 데이터를 미리 정의된 서비스 카테고리에 따라 분류하여 저장하는 단계; 저장한 데이터를 학습을 통해 생성된 학습 모델에 적용하여 헬스케어 서비스 데이터를 생성하는 단계; 및 생성된 헬스케어 서비스 데이터가 상기 단말의 화면을 통 해 출력되도록 제공하는 단계를 포함한다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트 헬스케어 서비스(smart healthcare service)에 관한 것으로, 보다 상세하게는 사용자의 개인 의료 건강 정보에 기반하여 헬스케어 서비스를 제공하는 스마트 헬스케어 서비스 제공 방법 및 장치에 관한 것 이다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "의료인이나 의료계 종사자가 아닌 일반인의 경우, 통상 병원 등 의료 기관에서 발급받거나 획득한 정보를 이해 하는 것은 매우 어렵다. 이는 건강에 대한 관심도가 높은 요즘에도 마찬가지인데, 예를 들어 여전히 많은 사람들은 지인의 소개나 미디 어, 예를 들어 건강 블로그나 건강 관련 전문가가 나온 방송을 통해 접한 방식을 이용하거나 단지 운동에 시간, 비용, 노력 등을 투자하고 있다. 그러나 지인의 소개나 미디어를 통해 획득한 정보는 신뢰도가 낮아 제대로 된 효과를 보장받기 어렵거나 개인에게 적합한 정보인지 본인이 직접 판단하여야 하는 등 전문적인 지식의 부족으 로 인한 문제는 여전하다. 이에 다양한 방식으로 의료나 건강에 관한 서비스들이 개발되고 있으나, 그러한 서비스들은 여전히 단편적인 정 보의 수집이나 제공에 그치고 있거나 서비스 이용이 복잡하고 어려워, 사용자 개인의 의료/건강 정보를 통합하 여 관리하고 적절한 헬스케어 서비스 제공하기에는 부족함이 있다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기한 종래 문제점을 해소하기 위하여, 본 발명의 일과제는, 사용자의 개인 의료 건강 정보에 기반한 헬스케어 서비스를 제공하는 스마트 헬스케어 서비스 제공 방법을 제공하는 것이다. 본 발명의 다른 일과제는, 단말에서 개인 의료 건강 정보를 입력하면, 보다 손쉽고 편리하게 스마트 헬스케어 서비스를 통해 개인 또는/및 그룹의 의료/건강 관련 정보를 통합 관리하면서 종합 분석한 데이터를 접할 수 있 도록 서비스 제공하는 것이다. 본 발명에서 이루고자 하는 기술적 과제들은 상기 기술적 과제로 제한되지 않으며, 언급하지 않은 또 다른 기술"}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 문제점을 해결하기 위한 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 제공 방법은, 스마트 헬스 케어 서비스 어플리케이션이 실행된 단말로부터 카메라 센서를 통해 촬영된 개인 의료 건강 정보가 포함된 이미 지 데이터를 수신하는 단계; 수신된 이미지 데이터에 관심영역을 설정하고, 설정된 관심영역에 대하여 데이터를 추출하는 단계; 추출한 데이터를 미리 정의된 서비스 카테고리에 따라 분류하여 저장하는 단계; 저장한 데이터 를 학습을 통해 생성된 학습 모델에 적용하여 헬스케어 서비스 데이터를 생성하는 단계; 및 생성된 헬스케어 서 비스 데이터가 상기 단말의 화면을 통해 출력되도록 제공하는 단계를 포함한다. 본 발명의 일실시예에 따르면, 상기 개인 의료 건강 정보는, 전문의료기관에서 발행한 전문 의료 정보와 사용자 개인의 생체 정보 및 운동 정보가 포함된 건강 정보를 포함하되, 의료기관 방문 예약 및 방문에 관한 스케줄 정보, 방문한 의료기관에 관한 기록 정보, 건강기능식품 섭취 기록 정보, 인바디 기록 정보, 및 약품 복용 기록 정보를 포함하고, 상기 전문 의료 정보에는 의료기관에 의해 부여되는 약봉투, 처방전, 건강검진결과표, 및 의 료진과의 문진 내용을 포함할 수 있다. 본 발명의 일실시예에 따르면, 상기 데이터 추출은, 수신된 이미지 데이터에 헬스케어 서비스 데이터와 관련된 관심영역(ROI: Region of Interest)를 설정하는 단계; 및 설정된 관심영역에 대하여 문자 인식 기술을 적용하여 미리 정의된 필요한 데이터를 추출하는 단계를 포함할 수 있다. 본 발명의 일실시예에 따르면, 상기 서비스 카테고리는, 임의 설정 가능하며, 의료 정보, 건강 관리 정보, 및 추천 정보 카테고리를 하위 카테고리로 포함하며, 서버에서 미리 학습된 결과에 기초하여 생성된 학습 모델에 따라 결정될 수 있다. 본 발명의 일실시예에 따르면, 상기 헬스케어 정보는, 수신된 개인 의료 건강 정보를 상기 서비스 카테고리 별 누적 정보 내지 히스토리 정보, 업데이트 정보, 의약품 내지 건강 보조 식품 복용 알람 정보, 질병의 주기, 질 병의 발병 횟수, 복약 정보, 관련된 질병 정보, 가족력 정보, 예상 질병 정보, 추천 건강 기능 식품 내지 건강 보조 식품에 대한 정보를 포함할 수 있다. 본 발명의 일실시예에 따른 단말로 스마트 헬스케어 서비스 제공하는 장치는, 메모리; 및 프로세서를 포함하되, 상기 프로세서는, 스마트 헬스케어 서비스 어플리케이션이 실행된 상기 단말로부터 카메라 센서를 통해 촬영된 개인 의료 건강 정보가 포함된 이미지 데이터를 수신하고, 수신된 이미지 데이터에 관심영역을 설정하고, 설정 된 관심영역에 대하여 데이터를 추출하여, 추출한 데이터를 미리 정의된 서비스 카테고리에 따라 분류하여 상기 메모리에 저장하고, 저장한 데이터를 학습을 통해 생성된 학습 모델에 적용하여 헬스케어 서비스 데이터를 생성 하여, 생성된 헬스케어 서비스 데이터가 상기 단말의 화면을 통해 출력되도록 제공한다. 본 발명의 일실시예에 따르면, 상기 프로세서는, 전문의료기관에서 발행한 전문 의료 정보와 사용자 개인의 생 체 정보 및 운동 정보가 포함된 건강 정보를 포함하되, 의료기관 방문 예약 및 방문에 관한 스케줄 정보, 방문 한 의료기관에 관한 기록 정보, 건강기능식품 섭취 기록 정보, 인바디 기록 정보, 및 약품 복용 기록 정보를 포 함한 상기 개인 의료 건강 정보를 처리하고, 상기 전문 의료 정보에는 의료기관에 의해 부여되는 약봉투, 처방 전, 건강검진결과표, 및 의료진과의 문진 내용을 포함할 수 있다. 본 발명의 일실시예에 따르면, 상기 프로세서는, 수신된 이미지 데이터에 헬스케어 서비스 데이터와 관련된 관 심영역(ROI: Region of Interest)를 설정하고, 설정된 관심영역에 대하여 문자 인식 기술을 적용하여 미리 정의 된 필요한 데이터를 추출할 수 있다. 본 발명의 일실시예에 따르면, 상기 프로세서는, 임의 설정 가능하며, 의료 정보, 건강 관리 정보, 및 추천 정 보 카테고리를 하위 카테고리로 포함하며, 서버에서 미리 학습된 결과에 기초하여 생성된 학습 모델에 따라 상 기 서비스 카테고리를 결정할 수 있다. 본 발명의 일실시예에 따르면, 상기 프로세서는, 수신된 개인 의료 건강 정보를 상기 서비스 카테고리 별 누적 정보 내지 히스토리 정보, 업데이트 정보, 의약품 내지 건강 보조 식품 복용 알람 정보, 질병의 주기, 질병의 발병 횟수, 복약 정보, 관련된 질병 정보, 가족력 정보, 예상 질병 정보, 추천 건강 기능 식품 내지 건강 보조 식품에 대한 정보를 포함한 헬스케어 정보를 상기 단말로 전송할 수 있다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 본 발명에 따르면 아래에 기재된 효과를 얻을 수 있다. 다만, 본 발명을 통해 얻을 수 있는 효과는 이에 제한되지 않는다. 첫째, 사용자의 개인 의료 건강 정보에 기반한 헬스케어 서비스를 제공하는 스마트 헬스케어 서비스 제공할 수 있는 효과가 있다. 둘째, 단말에서 개인 의료 건강 정보를 입력하면, 보다 손쉽고 편리하게 스마트 헬스케어 서비스를 통해 개인 또는/및 그룹의 의료/건강 관련 정보를 통합 관리하면서 종합 분석한 데이터를 접할 수 있도록 서비스 제공받을 수 있는 효과가 있다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명에 따른 바람직한 실시 형태를 첨부된 도면을 참조하여 상세하게 설명한다. 첨부된 도면과 함께 이하에 개시될 상세한 설명은 본 발명의 예시적인 실시형태를 설명하고자 하는 것이며, 본 발명이 실시될 수 있 는 유일한 실시형태를 나타내고자 하는 것이 아니다."}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "단지 본 실시예들은 본 발명의 게시가 완전하도록 하고, 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자 에게 발명의 범주를 완전히 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 몇몇의 경우, 본 발명의 개념이 모호해지는 것을 피하기 위하여 공지의 구조 및 장치는 생략되거나, 각 구조 및 장치의 핵심기능을 중심으로 한 블록도 형식으로 도시될 수 있다. 또한, 본 명세서 전체에서 동일한 구성요소에 대해서는 동일한 도면 부호를 사용하여 설명한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함(comprising 또는 including)\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미 한다. 또한, 명세서에 기재된 \"쪋부\"의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드 웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 나아가, \"일(a 또는 an)\", \"하나 (one)\", 및 유사 관련어는 본 발명을 기술하는 문맥에 있어서 본 명세서에 달리 지시되거나 문맥에 의해 분명하 게 반박되지 않는 한, 단수 및 복수 모두를 포함하는 의미로 사용될 수 있다. 아울러, 본 발명의 실시예들에서 사용되는 특정(特定) 용어들은 본 발명의 이해를 돕기 위해서 제공된 것이며, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 이 러한 특정 용어의 사용은 본 발명의 기술적 사상을 벗어나지 않는 범위에서 다른 형태로 변경될 수 있다. 이하 본 발명에 따른 스마트 헬스케어 서비스(smart healthcare service) 제공과 관련된 다양한 실시예를 제공 하는데, 특히 본 명세서에서는 사용자의 개인 및 가족 의료 정보에 기초하여 헬스케어 서비스를 제공함으로써, 개인이 손쉽고 편리하게 건강 관리, 의료 서비스 이용 필요성 판단 등을 할 수 있도록 하는 실시예들에 대해 설 명한다. 한편, 이러한 본 발명에 따른 실시예들은, 구현 방식에 따라 어플리케이션(application) 내지 프로그램 (program)과 같은 소프트웨어 형태로 제공될 수 있으며, 그를 위한 컴퓨터 프로그래밍 장치(computer programming device)에 대해서도 설명한다. 이하 본 명세서에서는 본 발명의 이해를 돕고 설명의 편의를 위하여, 서버에 의해 단말로 제공되는 스마트 헬스 케어 서비스는, 단말에 설치되어 실행되는 스마트 헬스케어 서비스 어플리케이션을 통해 이루어지는 것을 을 예 로 하여 설명하나, 반드시 이에 한정되는 것은 아니다. 한편, 본 명세서에서 기술하는 '의료 정보'라 함은 전문의료기관에서 발행하거나 그로부터 획득한 의료 관련 데 이터뿐만 아니라 건강 관련 개인이 보유하거나 입력하는 정보를 포함할 수 있다. 도 1은 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 시스템의 개략도이다. 도 4는 본 발명의 일실시예에 따른 스마트 헬스케어 서비스를 위한 그룹 구성 방법을 설명하기 위해 도시한 도 면이다. 도 1을 참조하면, 본 발명에 따른 스마트 헬스케어 서비스 시스템은, 단말과 서비스 서버를 포함 할 수 있다. 다만, 본 발명은 이에 한정되는 것은 아니며, 실시예에 따라 하나 또는 그 이상의 구성요소를 더 포함하여 구현될 수도 있다. 스마트 헬스케어 서비스 시스템에 속한 구성요소들 간의 통신 내지 데이터 커뮤니케이션(이하 '데이터 커뮤 니케이션')은 유/무선 통신 네트워크를 통하여 이루어지며, 상기 각 구성요소 사이의 통신 프로토콜이 모두 동 일할 필요는 없다. 단말은 적어도 하나의 단말기를 포함할 수 있다. 단말은 본 발명에 따른 스마트 헬스케어 서비스 어플리케이션을 서비스 서버와 같은 소스(source)로 부터 다운로드 받아 설치하고 실행할 수 있다. 단말은 스마트 헬스케어 서비스 어플리케이션을 실행하여 개인 의료 건강 정보를 입력할 수 있으며, 입력된 정보는 서비스 서버로 업로드(upload)될 수 있다. 실시예에 따라서, 도 1에서, 제1 단말은 제1 사용자를 위한 단말, 제2 단말은 제2 사용자를 위한 단말일 수 있 다. 실시예에 따라서, 도 1에서, 제1 단말은 사용자를 위한 스마트폰, 제2 단말은 만보계나 상기 사용자의 몸에 부 착된 웨어러블 디바이스(wearable device) 또는 센서(sensor)일 수 있다. 이 때, 스마트폰은 스마트 헬스케어 서비스 어플리케이션을 실행하고, 웨어러블 디바이스는 착용자의 개인 의료 건강 정보를 센싱하여 상기 스마트 폰으로 제공할 수 있다. 단말은 스마트 헬스케어 서비스 어플리케이션을 통한 스마트 헬스케어 서비스 이용과 관련된 ID를 서비스 서버로부터 부여받을 수 있다. 실시예에 따라서, 서비스 서버는 단말을 통해 입력된 개인 정보에 기초하여 개인뿐만 아니라 도 4와 같이 다양하게 구성되는 그룹 단위로 ID를 부여할 수 있다. 여기서, 그룹 단위라 함은, 가족 단위, 친구 단위, 회사 단위, 팀 단위 등을 말하며, 이는 사용자 또는 서비스 서버에 의해 임의 설정될 수 있다. 실시예에 따라, 서비스 서버는 그룹 단위의 경우에는, 개인 단위에 비하여 노출되는 개인 의료 건강 정보 의 레벨을 다르게 설정할 수 있다. 예컨대, 그룹이 회사 단위라면, 민감한 개인 정보는 노출되지 않도록 블러 (blur) 처리를 하거나 해당 개인의 승인을 득하도록 하는 등 그룹의 성격에 따라 개인의 설정에 따라 노출 정보 의 레벨을 다르도록 구현할 수 있다. 단말은 스마트 헬스케어 서비스 이용과 관련된 데이터를 출력하는 예를 들어, TV, PC, 디지털 사이니지 (digital signage)와 같은 고정 단말과, 스마트폰, 태블릿PC, 노트북과 같은 이동 단말 중 적어도 어느 하나일 수 있다. 실시예에 따라서, 단말은 본 발명에 따른 스마트 헬스케어 서비스 이용과 관련하여, 카메라와 같은 이미지 센서를 포함할 수 있다. 실시예에 따라서, 단말은 본 발명에 따른 스마트 헬스케어 서비스 이용과 관련된 키패드, 마우스와 같은 입력 인터페이스와 터치스크린, 스피커와 같은 출력 인터페이스를 포함할 수 있다. 실시예에 따라서, n개(여기서, n은 양의 정수)의 단말이 동시 또는 이시(異時)에 서비스 서버와 데이터 커 뮤니케이션을 수행할 수 있으며, 각 단말은, 각 사용자를 위한 스마트 헬스케어 서비스를 제공할 수 있다. 실시예에 따라, 단말은, 스마트 헬스케어 서비스를 위하여 관련 API(Application Program Interface) 또 는 임베디드 소프트웨어(Embedded Software)를 포함할 수 있다. 다시 말해, 이하 본 발명에 따른 스마트 헬스케 어 서비스는, 단말에 미리 설치된 API 또는 임베디드 소프트웨어를 포함하는 어플리케이션을 통해 이루어 지는 것을 일실시예로 한다. 다만, 본 발명은 이에 한정되는 것은 아니며, 웹 서비스 형태로 제공될 수도 있다. 한편, 단말은 자체적으로 서비스 서버로 데이터 또는 (그를 포함한) 신호를 전송하거나 수신할 수 있 으며, 그를 위한 데이터 변환 등 필요한 가공도 할 수 있다. 또한, 상기 단말은, 상기 서비스 서버로 데이터 송신하거나 그로부터 데이터를 수신하기 위하여 필요한 경우 하나 또는 그 이상의 장치의 도움을 받거나 그를 통할 수 있다. 다음으로, 서비스 서버는, 단말에서 스마트 헬스케어 서비스 어플리케이션이 실행되어 사용자의 개인 의료 건강 정보가 수신되면, 수신된 개인 의료 건강 정보에 기초하여 스마트 헬스케어 서비스 정보를 생성하고, 해당 단말로 리턴(return)하여 출력되도록 할 수 있다.서비스 서버는 유/무선 통신 네트워크를 통하여 적어도 하나 이상의 다른 장치, 즉 단말과 데이터 커 뮤니케이션을 수행하는 개체(entity)로서, 본 발명에 따른 스마트 헬스케어 서비스 제공을 위하여 단말과 데이터 커뮤니케이션을 수행하며, 그를 통한 데이터를 처리하며 필요한 데이터를 생성, 저장, 전송 등 중 적어 도 하나 이상의 기능을 수행하는 장치이며, 그를 위한 프로그램 내지 소프트웨어를 포함할 수 있다. 비록 도 1에서는 하나의 서비스 서버를 도시하였으나, 본 발명은 이에 한정되지 않고, 복수의 서비스 서버 가 스마트 헬스케어 서비스 시스템에 포함될 수 있으며, 스마트 헬스케어 서비스 데이터 처리를 위하여 클 라이언트 서버 등 하나 또는 그 이상의 서버들을 더 포함할 수도 있다. 한편, 본 발명에 따른 서비스 서버는 단말을 통해 수신되는 데이터를 포함하여 스마트 헬스케어 서비 스 제공을 위하여 필요한 데이터/빅데이터를 수집, 처리, 저장 등 중 적어도 하나의 기능을 수행하는 데이터베 이스(DB: database)를 내장 또는 외장할 수 있다. 이러한 데이터베이스는 복수 개일 수 있다. 서비스 서버는, 클라우드(Cloud) 서버, IMS(IP Multimedia Subsystem) 서버, 텔레포니 어플리케이션 (Telephony Application) 서버, IM(Instant Messaging) 서버, MGCF(Media Gateway Control Function) 서버, MSG(Messaging Gateway) 서버, CSCF(Call Session Control Function) 서버 등 중 적어도 하나를 일실시예로 할 수 있다. 단말과 서비스 서버는 개인 의료 건강 정보에 대해 촬영한 이미지를 주고받을 수 있다. 다만, 본 발 명은 이에 한정되지 않으며, 동영상(video), 텍스트(text), 음성(voice) 등 다양한 포맷의 데이터가 그를 대체 하거나 결합되어 상호간에 송수신될 수 있다. 유/무선 통신 네트워크는, 단말과 서비스 서버 사이의 데이터 통신망을 제공하며, 인터넷 프로토콜 (IP)을 통하여 대용량 데이터 커뮤니케이션을 지원하는 아이피(IP: Internet Protocol)망 또는 서로 다른 IP 망 을 통합한 올 아이피(All IP) 망을 포함할 수 있다. 또한, 유/무선 통신 네트워크는, 유선망, Wibro(Wireless Broadband)망, WCDMA를 포함하는 이동 통신망, HSDPA(High Speed Downlink Packet Access)망 및 LTE(Long Term Evolution) 망을 포함하는 이동 통신망, LTE advanced(LTE-A)를 포함하는 이동 통신망, 위성 통신망 및 와이파이(Wi-Fi)망 중 하나이거나 또는 이들 중 적어 도 하나 이상의 결합에 의하여 형성될 수도 있다. 한편, 도 1에서 제1 단말과 제2 단말 역시 유/무선 통신 프로토콜에 기초하여 데이터 커뮤니케이션을 수행할 수 있다. 예컨대, 제1 단말과 제2 단말은 블루투스를 통해 서로 페어링되거나 와이파이를 통하여 데이터를 주고받 을 수 있다. 상기 데이터에는 특정 기능 내지 동작 수행을 위한 제어 데이터도 포함될 수 있다. 도 2는 본 발명의 일실시예에 따른 서비스 서버의 구성 블록도이다. 도 2는 서비스 서버의 구성 블록도의 일실시예를 도시한 것으로, 필수 구성요소만을 도시한바, 본 발명이 반드시 이에 한정되는 것은 아니다. 예컨대, 한편, 실시예에 따라, 도 2는 단말의 구성요소로 볼 수도 있 다. 실시예에 따라, 도 2에서 일부 구성요소가 추가되거나 반대로 제거될 수도 있으며, 복수의 구성요소가 모듈 화되어 하나의 구성으로 구현되거나 반대일 수도 있다. 실시예에 따라, 도 2에서 일부 구성요소은 제거되고 해 당 기능은 타구성요소에서 수행될 수도 있다. 도 2를 참조하면, 서비스 서버는, 크게 메모리와 프로세서로 구성될 수 있다. 이 때, 프로세서는 통신부 , 데이터추출부, 데이터분석부, 데이터생성부, 및 제어부를 포함할 수 있으며, 메모 리는 데이터베이스(DB)일 수 있다. 또는, 실시예에 따라서, 서비스 서버는, 통신부, 데이터추출 부, 데이터분석부, 데이터생성부, 제어부 및 데이터베이스(DB)를 포함하여 구현될 수 도 있다. 통신부는, 단말과의 데이터 커뮤니케이션을 인터페이싱 환경을 지원하며, 상기 단말로부터 데이 터를 수신할 수 있다. 데이터추출부는, 통신부를 통해 수신된 단말의 데이터로부터 본 발명에 따른 헬스케어 서비스 데이터를 추출한다. 실시예에 따라, 헬스케어 서비스 데이터는 개인(단말)과 그룹을 식별하여 ID를 부여하기 위 한 개인 정보를 포함할 수 있다. 실시예에 따라서, 헬스케어 서비스 데이터는 사용자(개인 또는/및 가족)의 의 료 정보를 포함할 수 있다. 데이터분석부는, 데이터추출부를 통하여 추출된 데이터를 분석한다. 실시예에 따라서, 데이터분석부는, 공공 데이터를 포함하여 다양한 소스로부터 수집한 빅데이터(big dat a)를 인공지능 기술에 기반하여 학습하고, 학습된 결과에 기초하여 헬스케어 서비스를 위한 학습 모델(learning model)을 생성하는 인공지능 학습 모듈을 포함할 수 있다. 따라서, 데이터분석부는 상기 생성한 학습 모듈 을 적용하여 추출된 데이터를 분석할 수 있다. 실시예에 따라, 데이터분석부는 생성된 학습 모델이 복수 개인 경우에는, 추출된 데이터에 대응되는 적어도 하나의 학습 모델을 선정하고, 선정된 학습 모델을 상기 데이 터에 적용하여 데이터를 분석할 수 있다. 데이터생성부는, 데이터분석부의 결과에 기초하여 헬스케어 서비스 데이터를 생성한다. 생성된 데이 터는 제어부 또는/및 데이터베이스로 전송될 수 있다. 제어부는, 스마트 헬스케어 서비스를 제공하기 위하여 서비스 서버의 전반적인 기능 제어를 수행한다. 데이터베이스는, 단말로부터 수신되는 데이터, 서비스 서버에서 수신, 학습, 생성, 추출, 변환, 처리 등 되는 데이터를 일시 저장하는 구성으로서, 실시예에 따라서, 서비스 서버의 내부 또는 외부에 구 현될 수 있으며, 복수 개일 수 있다. 도 3은 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 제공 방법을 설명하기 위해 도시한 순서도이다. 도 5는 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 데이터의 사용자 인터페이스를 설명하기 위해 도시 한 도면이다. 도 6은 본 발명의 다른 일실시예에 따른 스마트 헬스케어 서비스 데이터의 사용자 인터페이스를 설명하기 위해 도시한 도면이다. 도 3을 참조하여, 서비스 서버 관점에서 스마트 헬스케어 서비스 제공 방법을 설명한다. 서비스 서버는, 스마트 헬스케어 서비스 어플리케이션이 실행된 단말로부터 카메라 센서를 통해 촬영 된 개인 의료 건강 정보가 포함된 이미지 데이터를 수신할 수 있다(S101). 개인 의료 건강 정보는 도 5와 같이, 병원, 약국과 같이 전문의료기관에서 발행한 전문 의료 정보와 사용자 개 인의 생체 정보와 운동 정보 등을 포함한 건강 정보 등을 포함하여 사용자가 스마트 헬스케어 서비스 이용을 위 하여 입력 가능한 모든 형태의 정보를 포함할 수 있다. 실시예에 따라, 개인 의료 건강 정보는, 의료기관에 의해 부여되는 약봉투, 처방전(질병 정보가 포함될 수 있음), 건강검진결과표, 의료진과의 문진 내용 등의 정보를 포함할 수 있다. 실시예에 따라, 개인 의료 건강 정보는, 병원 등 의료기관 방문 예약 및 방문에 관한 스케줄 정보, 방문한 의료 기관에 관한 기록 정보, 건강기능식품 섭취 기록 정보, 인바디 기록 정보, 약품 복용 기록 정보 등을 포함할 수 있다. 실시예에 따라, 개인 의료 건강 정보는 사용자 개인뿐만 아니라 그룹에 대한 의료 정보도 포함할 수 있다. 서비스 서버는, 수신된 이미지 데이터에 관심영역(ROI)을 설정하고, 설정된 관심영역에 대하여 데이터를 추출할 수 있다(S102). 실시예에 따라, 수신된 의료 정보가 이미지 데이터인 경우에는, 상기 이미지 데이터에 헬스케어 서비스 데이터 와 관련된 관심영역(ROI: Region of Interest)를 설정하고, 설정된 관심영역에 대하여 문자 인식 기술을 적용하 여 미리 정의된 필요한 데이터를 추출한다. 상기 문자 인식 기술은, 광학식 문자 판독(OCR: Optical Character Recognition) 기술을 예로 하나, 반드시 이에 한정되는 것은 아니다. 한편, 본 명세서에서 문자 인식 기술과 관 련하여서는 공지 기술을 원용 또는 준용하며, 해당 기술에 대한 상세 설명은 생략한다. 실시예에 따라, 수신된 의료 정보가 오디오 데이터인 경우에는, STT(Speech to Text) 기술을 이용하여 오디오 데이터로부터 미리 정의된 필요 데이터를 추출한다. 실시예에 따라, 수신된 의료 정보가 비디오 데이터인 경우에는, 의료 정보 내 질병 등 정보를 참조하여, 전술한 관심영역(ROI)을 설정하고 설정된 관심영역(ROI)에 대한 데이터를 추출할 수 있다. 상기 비디오 데이터는, 해당 단말에 한정되지 않고 주변의 CCTV, 열화상 장치 등의 비디오 촬영 센서나 장치 등으로부터 수신될 수 있 다. 예컨대, 비디오 데이터가 노령의 부모에 대한 것이고 질병 또는 질병 예상 부분이 무릎이라고 하면, 관심 영역은 무릎과 관련된 부분이 설정될 수 있으며, 무릎과 관련하여 질병 내지 부상 위험, 우려, 발생과 관련된움직임이 검출 또는 검출 예상되거나 그 이전 내지 이후의 부분(프레임)에 대한 데이터가 추출될 수 있다. 이 경우, 상기 움직임 검출이나 예상은 미리 생성된 학습 모델을 참조할 수 있다. 상기에서, 미리 정의된 필요 데이터는, 수신된 의료 정보에 따라 달라질 수 있는데, 공통적으로 서비스 서버 에 의해서 수신된 의료 정보의 분석 및 분석 결과에 기초하여 스마트 헬스케어 서비스 데이터 생성에 직간 접으로 필요한 데이터를 포함할 수 있다. 실시예에 따라서, 추출되는 데이터 또는 미리 정의된 필요 데이터는, 서비스 서버에서 미리 학습된 결과에 기초하여 생성된 학습 모델에 따라 결정될 수 있다. 서비스 서버는, 추출한 데이터를 미리 정의된 서비스 카테고리에 따라 분류하여 저장할 수 있다(S103). 서비스 카테고리는, 서비스 서버 또는 단말 사용자에 의해 설정 가능하며, 의료 정보, 건강 관리 정 보, 추천 정보 등의 하위 카테고리로 구분할 수 있다. 의료 정보는, 질병 정보, 의료기관 방문, 의료기관의 처 방, 의약품 복용, 의료기관과 관련된 스케줄 등을 포함하여 의료기관과 직접 관련된 정보를 포함할 수 있다. 건 강 관리 정보는, 질병이나 의료기관과 직접 관련은 없으나, 단말 사용자의 건강과 관련된 정보를 포함할 수 있다. 추천 정보는 의료 정보와 건강 관리 정보와 관련하여 서비스 서버에 의해 알림 정보, 추천 정보 등을 포함할 수 있다. 실시예에 따라서, 서비스 카테고리는, 서비스 서버에서 미리 학습된 결과에 기초하여 생성된 학습 모델에 따라 결정될 수 있다. 서비스 서버는, 저장한 데이터를 학습을 통해 생성된 학습 모델에 적용하여 헬스케어 서비스 데이터를 생 성할 수 있다(S104). 상기 헬스케어 서비스 데이터는, 서비스 서버에 의해 스마트 헬스케어 서비스 어플리케이션이 실행된 단말 로 개인 의료 건강 정보 입력 내지 전송에 대응하여 제공되는 도 5와 같이, 서비스 데이터를 포함할 수 있 다. 예를 들어, 도 5를 참조하면, 서비스 서버는 단말에서 헬스케어 서비스 데이터를 출력하되, 의료"}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "정보와 건강정보가 구분되어 제공될 수 있도록 할 수 있다. 이때, 각 정보에는 정보 요약이나 추천 정보가 포함 될 수 있도록 할 수 있다. 한편, 각 정보는, 도 6과 같이, 누적된 히스토리 정보를 포함할 수 있다. 도 6의 (a)에서는, 단말은 헬스케어 서비스 데이터에 따른 일주월연과 같은 시간 단위로 건강지수에 대한"}
{"patent_id": "10-2020-0144951", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "데이터가 누적된 그래프(히스토그램)와 요약 정보 내지 추천 정보를 함께 제공할 수 있다. 상기에서, 건강지수 는 질병이나 의료정보와 그와 별개의 건강 관련 정보에 기초한 건강정보를 종합 판단한 데이터로서, 단말 사용자에 의해 제공된 개인 의료 건강 정보를 서비스 서버에서 미리 학습하여 생성한 학습 모델을 적용하 여 산출할 수 있다. 서비스 서버는 상기 학습 모델을 생성함에 있어서 공공 데이터를 활용할 수 있으며, 연령, 성별, 지역 등 다양한 보건 건강 데이터, 질병 데이터를 참조하여 평균 데이터를 산정하고 이를 이용할 수 있다. 한편, 상기 건강지수는 의료정보는 별개로 하고 건강 정보만을 기준으로 제공될 수 있다. 이 경우 의 료지수 역시 의료정보만을 기준으로 하여 도 6의 (a)와 같은 형태로 제공될 수 있다. 한편, 도 6의 (a)는 매시 간 단위에서 단지 산정된 학습 모델, 즉 평균 데이터와만 비교하는 것이 아니라 직전 또는 이전 히스토리 데이 터를 참조하여 결정될 수 있다. 예컨대, 월요일 데이터가 평균 데이터와 비교할 때, 건강지수가 '90'이라고 하 더라도, 직전 일요일의 데이터, 즉 건강지수가 '50'인 경우에는, 이를 반영하여 최종적인 월요일의 건강지수가 결정될 수 있다. 또는, 상기에서 현재 건강 지수 관련 데이터는 이전 건강 지수에 대한 평균 건강 지수 데이터 를 참조하여 최종 결정될 수 있다. 한편, 도 6의 (b)에서는, 서비스 서버는 단말(1100의 어플리케이션 하단에 그룹에 속한 다른 단말에 대한 정보를 제공하고, 특정 단말 항목이 선택되면, 바로 해당 단말의 사용자에 대한 건강지수(또는 의료지수) 데이 터를 제공하거나 함께 제공할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보를 분류된 서비스 카 테고리 별 누적 정보 내지 히스토리 정보, 업데이트 정보 등을 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기초한 의약품 내 지 건강 보조 식품 복용 알람 정보를 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기초한 질병 정보, 예를 들어 질병의 주기, 질병의 발병 횟수, 복약 정보, 관련된 질병 정보 등을 포함할 수 있다. 복약 정보는 예 컨대, 연령, 성별, 직업 등에 기초하여 주의 질병 등에 대한 정보를 포함할 수 있다. 복약 정보는 질병에 대한국가별 통계나 지역 등을 참조할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인/가족 의료 정보에 기초하여 가족력 정보, 예상 질병 정보 등을 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기초하여 추천 건 강 기능 식품 내지 건강 보조 식품에 대한 정보를 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말 및 단말에 의해 입력된 개인 의료 건강 정보에 기초 하여 이용 의료기관에 대한 위치 정보, 교통 또는 교통 상황 정보, 날씨 정보, 주변 이용 가능 의료기관 정보, 의료기관 예약 내지 연락처 정보 등을 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기초하여, 긴급 의 료 서비스 가능한 의료기관이나 관련 등록된 단말에 대한 정보 등이 포함될 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기초하여, 상기 의 료 정보가 운동 관련 정보이면, 운동량, 즉 칼로리 소모량, 운동 시간 등에 대한 정보와, 분석된 운동량 정보에 기초하여 추천 운동량, 추천 운동 등에 대한 정보를 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 관련된 의료기관, 웹페이지 등에 대한 링크 정보를 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 그래프를 포함한 이미지, 동영상, 오디오 데이터를 포함할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 개인뿐만 아니라 그룹에 대한 정보를 포함할 수 있으며, 그룹에 대 한 정보 제공 시에는, 가족력 등 질병 히스토리에 대한 정보와 추천 정보를 포함할 수 있다. 실시예에 따라, 서비스 서버는, 헬스케어 서비스 데이터 또는 그와 별개로, 단말에서 스마트 헬스케 어 서비스 어플리케이션이 포어그라운드(foreground) 또는 백그라운드(background)에서 실행 중이면, 그룹으로 등록된 사용자의 타단말에서 업데이트에 대한 알림 정보를 전송할 수 있다. 이 때, 단말에서 스마트 헬스 케어 서비스 어플리케이션이 포어그라운드(foreground) 또는 백그라운드(background)에서 실행 중인 아닌 경우 에는, 미리 등록된 연락처 정보를 활용하여 MMS 메시지나 소셜 미디어에서 접근 가능한 정보로, 'OOO에서 업데 이트', 'OOO 사용자 긴급 상황 발생' 등과 같은 알림 정보를 제공할 수 있다. 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기초하여, 현재 건 강 및 질병 정보, 직전 또는 과거 건강 및 질병 정보, 미래, 즉 예상 건강 및 질병 정보를 포함할 수 있다. 실 시예에 따라서, 실시예에 따라, 헬스케어 서비스 데이터는, 단말에 의해 입력된 개인 의료 건강 정보에 기 초하여, 예상 건강 및 질병 정보로서 과거 대비 현재 건강 및 질병 정보에 대한 분석 및 분석 결과에 기초한 의 료기관 방문, 추천 건강 보조 식품 등에 대한 정보를 포함할 수 있다. 서비스 서버는, 생성된 헬스케어 서비스 데이터를 단말로 전송하여 상기 단말의 화면을 통해 출력되도록 제어할 수 있다(S105). 실시예에 따라서, 서비스 서버는 단말을 통해 수신한 개인 의료 건강 정보 그 자체도 별도 데이터베 이스에 저장하여, 스마트 헬스케어 서비스 데이터 제공시에 함께 제공되도록 제어할 수 있다. 실시예에 따라, 서비스 서버는 등록된 단말에 저장된 사용자의 스케줄 정보에 기초하여 헬스케어 서 비스 데이터를 제공할 수 있다. 실시예에 따라, 서비스 서버는 등록된 단말로부터 수신한 개인 의료 건강 정보에서 확진 또는 관심 있는 의료 정보에 기초하여, 관련 정보를 획득할 수 있는 커뮤니티 정보, 기사 데이터 정보, 소셜 미디어 정보, 의료기관 등 정보에 대한 링크 정보를 헬스케어 서비스 데이터로 제공할 수 있다. 실시예에 따라, 서비스 서버는 외부 결제 서버(payment server)와 연동하여 단말 사용자가 결제한 결 제 데이터(payment data)를 참고하여, 의료 기관이나 건강 관련 기관에서 결제한 결제 내역에 대하여 타임 스탬 프(time stamp)를 미리 생성하고, 단말에서 개인 의료 건강 정보가 수신되면 이를 매칭할 수 있다. 상기에 서, 단말에서 상기 미리 생성한 타임 스탬프에 기초하여 소정 시간 내에 개인 의료 건강 정보가 수신되지 않으면, 개인 정보 업데이트에 대한 알람 정보를 제공할 수 있다. 이를 통해, 서비스 서버와 단말은 크로스체크를 통해 헬스케어 서비스와 관련된 정보의 누락을 방지할 수 있으며, 이를 통해 복약과 관련된 서비 스를 제공하여 사용자 내지 그룹의 건강 관리에 도움을 줄 수 있다.실시예에 따라, 서비스 서버는, 주기적으로 크롤링(crawling)을 통하여, 등록된 단말 또는 사용자의 소셜 미디어 정보를 수집하여, 비록 사용자가 단말에서 스마트 헬스케어 어플리케이션을 실행하지 않더라 도, 수집된 데이터에 개인 의료 건강 정보에 대응되는 정보가 포함된 경우에는, 알람 정보를 제공하거나 스마트 헬스케어 어플리케이션을 실행하도록 제어하여, 관련 정보의 업데이트를 유도할 수도 있다. 이때, 사용자는 개 인 의료 건강 정보 업로드를 위하여 재촬영을 하지 않고 단말의 메모리에 기저장된 데이터를 그대로 이용 할 수 있으며, 관련 유저 인터페이스(User Interface)를 제공할 수 있다. 예를 들어, 사용자가 소셜 미디어 '나 오늘 oo 병원 다녀왔어.'와 같은 텍스트 데이터나 처방전이나 약봉지 등을 촬영하여 업로드하거나 그 이후에도 소정 시간 내에 개인 의료 건강 정보를 서비스 서버로 입력하지 않으면, 전술한 바와 같이 알림 정보를 제 공하여 개인 의료 건강 정보 업로드를 유도할 수 있다. 이 경우, 서비스 서버는 데이터 크롤링을 통하여 대상 개인 의료 건강 정보에 관한 정보가 검색되면, 전술한 바와 같이, 결제 서버를 통하여 결제 정보를 수신하 여 타임 스탬프를 생성할 수 있다. 실시예에 따라, 서비스 서버는, 단말 사용자의 설정에 따라서, 등록된 그룹 또는 등록된 부모나 자식 에 대하여, 해당 그룹 소속원이나 해당 부모나 자식에 의한 개인 의료 건강 정보 업데이트가 없더라도, 예약된 병원 방문, 복용 시간 등에 대한 알람 정보를 포함한 스마트 헬스케어 서비스를 제공할 수 있다. 실시예에 따라, 서비스 서버는, 단말 사용자에 의해 입력된 개인 의료 건강 정보와 관련하여, 키워드 (keyword)를 추출하고, 추출된 키워드에 대하여 미리 학습된 내용, 관련 정보를 스마트 헬스케어 서비스로 제공 할 수 있다. 상기에서, 키워드는, 미리 학습된 학습 모델과 관련되거나 사용자에 의해 미리 설정되거나 서비스 서버에 의해서 미리 정의된 단어나 문구에 기초하여 결정될 수 있다. 이러한 키워드로 예컨대, 질병명, 복 용약품명, 의료기관명, 건강정보 타입 등과 관련된 내용이 설정될 수 있다. 따라서, 단말 사용자는 별도의 동작 없이 스마트 헬스케어 서비스 어플리케이션 실행만으로 다양한 관련 정보를 획득할 수 있다. 실시예에 따라, 서비스 서버는, 단말 사용자 또는 등록된 그룹의 그룹원에 대한 스마트 헬스케어 서 비스 데이터를 수신하여, 해당 단말의 일정에 자동 등록 또는 추가되도록 할 수 있다. 실시예에 따라서, 서비스 서버는, 상기 등록 또는 추가된 일정을 참고하여, 추후 스마트 헬스케어 서비스 데이터로서, 병원 방문 예약 등과 같은 추천 정보를 생성할 때 참고할 수 있다. 실시예에 따라, 서비스 서버는 상기와 같은 스마트 헬스케어 서비스 데이터를 월, 주, 일 등 단위로 별도 생성하여 단말로 제공할 수 있다. 실시예에 따라, 서비스 서버는, 원격 진료나 원격 건강 관리와 관련하여, 관련 장치, 기관이나 관련 플랫 폼과 단말 사이의 데이터 커뮤니케이션을 위한 플랫폼(platform)을 제공할 수도 있다. 더불어, 이상 상술한 본 발명에 따른 스마트 헬스케어 서비스를 제공함에 있어서, 개인이나 그룹의 질병 정보, 복용 정보 등의 민감한 정보가 유출될 우려에 대비하여 블록체인(blockchain) 기술을 참조하여, 외부 해킹에 의 한 피해를 방지할 수 있다. 이와 같이, 블록체인 기술을 참조하는 경우에는, 서비스 서버는 미리 단말 로부터 블록체인 노드 설정을 위한 단말에 대한 정보를 획득하여 이용할 수 있다. 그 밖에, 본 발명에 따 른 스마트 헬스케어 서비스 구현 내지 제공을 위하여 IoT(Internet of Things) 기술 등 ICT 기술이 참조될 수 있다. 그 밖에, 비록 도시되진 않았으나, 단말의 스마트 헬스케어 서비스 어플리케이션을 통한 사용자의 개인 의 료 건강 정보 입력 내지 업로드는, 의료기관이나 건강관련기관에 의한 업로드로 대체되어 본 발명에 적용될 수 도 있다. 또는, 상기 의료기관이나 건강관련기관에 의한 업로드가 아니라, 단말에서 사용자의 개인 의료 건강 정보가 업데이트되면, 이를 상기 기관에 확인을 위해 이용될 수도 있다. 상술한 바와 같이, 본 발명에 따른 스마트 헬스케어 서비스는, 단말에서 간편하게 어플리케이션을 실행하여 의 료 정보를 촬영하여 입력하면, 의료 정보에 포함된 정보에 기초한 스마트 헬스케어 서비스 데이터뿐만 아니라 이전 입력 의료 정보에 기초하여 기생성된 스마트 헬스케어 서비스 데이터를 포함하여 단말 사용자는 의료, 건 강 관련 정보를 통합 관리하면서 종합 분석 데이터를 제공받을 수 있다. 한편, 상술한 방법은, 컴퓨터에서 실행될 수 있는 프로그램으로 작성 가능하고, 컴퓨터 판독 가능 매체를 이용 하여 상기 프로그램을 동작시키는 범용 디지털 컴퓨터에서 구현될 수 있다. 또한, 상술한 방법에서 사용된 데이 터의 구조는 컴퓨터 판독 가능 매체에 여러 수단을 통하여 기록될 수 있다. 본 발명의 다양한 방법들을 수행하 기 위한 실행 가능한 컴퓨터 코드를 저장하는 컴퓨터 판독 가능 매체는 마그네틱 저장매체(예를 들면, 롬, 플로 피 디스크, 하드 디스크 등), 광학적 판독 매체(예를 들면, 시디롬, DVD 등)와 같은 저장 매체를 포함한다. 본원 발명의 실시예들과 관련된 기술 분야에서 통상의 지식을 가진 자는 상기 기재의 본질적인 특성에서 벗어나 지 않는 범위에서 변형된 형태로 구현될 수 있음을 이해할 수 있을 것이다. 그러므로, 개시된 방법들은 한정적 인 관점이 아닌 설명적 관점에서 고려되어야 한다. 본 발명의 범위는 발명의 상세한 설명이 아닌 특허청구 범위 에 나타나며, 그와 동등한 범위 내에 있는 모든 차이점은 본 발명의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2020-0144951", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 시스템의 개략도이다. 도 2는 본 발명의 일실시예에 따른 서비스 서버의 구성 블록도이다. 도 3은 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 제공 방법을 설명하기 위해 도시한 순서도이다. 도 4는 본 발명의 일실시예에 따른 스마트 헬스케어 서비스를 위한 그룹 구성 방법을 설명하기 위해 도시한 도 면이다. 도 5는 본 발명의 일실시예에 따른 스마트 헬스케어 서비스 데이터의 사용자 인터페이스를 설명하기 위해 도시 한 도면이다. 도 6은 본 발명의 다른 일실시예에 따른 스마트 헬스케어 서비스 데이터의 사용자 인터페이스를 설명하기 위해 도시한 도면이다."}
