{"patent_id": "10-2022-0189477", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0106556", "출원번호": "10-2022-0189477", "발명의 명칭": "이면 발열체를 이용한 능동 복합재 결함 탐색 방법 및 이를 실행하는 시스템", "출원인": "국립군산대학교산학협력단", "발명자": "노재규"}}
{"patent_id": "10-2022-0189477", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "복합재가 발열체와 적외선 카메라 사이에 위치한 상태에서 발열체로부터의 열이 매개체를 통해 전달되는 과정을적외선 카메라를 통해 촬영하여 열화상 데이터를 생성하는 능동 복합재 결함 탐색 장치;상기 열화상 데이터를 수신하면 시간순으로 배열한 후 상기 시간순으로 배열된 열화상 데이터 중 탐지에 이용될탐지 영역을 추출한 후 프레임을 시간순으로 배열하고, 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범위만큼 분배하는 과정을 수행하는 열화상 데이터 전처리 장치; 및미리 생성된 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력하고, 상기 미리 생성된 결함 탐지 인공지능모델에서 출력된 재구성 오차가 임계 값 이상인지 여부에 따라 복합재의 결함 위치를 특정하는 결함 탐지 장치를 포함하는 것을 특징으로 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템."}
{"patent_id": "10-2022-0189477", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,이면 발열체에서 미리 결함 위치에 대한 정보가 주어진 복합재 시편을 사용하여 획득한 열화상 데이터를 수신하고, 상기 미리 결정된 결함이 없는 영역에서 획득한 열화상 데이터를 결함 데이터 셋으로 분할하고, 상기 미리결정된 결함이 있는 영역에서 획득한 열화상 데이터를 정상 데이터 셋으로 분할하는 정상 및 결함 데이터 분할장치를 포함하는 것을 특징으로 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템."}
{"patent_id": "10-2022-0189477", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 정상 및 결함 데이터 분할에서 분할된 데이터 셋 중 정상 데이터 셋을 수신하면, 상기 정상 데이터 셋을이용하여 파라미터를 학습시켜 결함 탐지 인공지능 모델을 제작하는 결함 탐지 모델 제작 장치를 포함하는 것을특징으로 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템."}
{"patent_id": "10-2022-0189477", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "능동 복합재 결함 탐색 장치가 복합재가 발열체와 적외선 카메라 사이에 위치한 상태에서 발열체로부터의 열이매개체를 통해 전달되는 과정을 적외선 카메라를 통해 촬영하여 열화상 데이터를 생성하는 단계;열화상 데이터 전처리 장치가 상기 열화상 데이터를 수신하면 시간순으로 배열한 후 상기 시간순으로 배열된 열화상 데이터 중 탐지에 이용될 탐지 영역을 추출한 후 프레임을 시간순으로 배열하고, 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범위만큼 분배하는 과정을 수행하는 단계; 및결함 탐지 장치기 미리 생성된 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력하고, 상기 미리 생성된 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상인지 여부에 따라 복합재의 결함 위치를 특정하는 단계를 포함하는 것을 특징으로 하는 공개특허 10-2024-0106556-3-이면 발열체를 이용한 능동 복합재 결함 탐색 방법."}
{"patent_id": "10-2022-0189477", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,이면 발열체에서 미리 결함 위치에 대한 정보가 주어진 복합재 시편을 사용하여 획득한 열화상 데이터를 수신하는 단계;상기 미리 결정된 결함이 없는 영역에서 획득한 열화상 데이터를 결함 데이터 셋으로 분할하는 단계; 및상기 미리 결정된 결함이 있는 영역에서 획득한 열화상 데이터를 정상 데이터 셋으로 분할하는 단계를 포함하는것을 특징으로 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법."}
{"patent_id": "10-2022-0189477", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 분할된 데이터 셋 중 정상 데이터 셋을 수신하는 단계; 및상기 정상 데이터 셋을 이용하여 파라미터를 학습시켜 결함 탐지 인공지능 모델을 제작하는 단계를 포함하는 것을 특징으로 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템은 복합재가 발열체와 적외선 카메라 사이에 위치한 상태에서 발열체로부터의 열이 매개체를 통해 전달되는 과정을 적외선 카메라를 통해 촬영 하여 열화상 데이터를 생성하는 능동 복합재 결함 탐색 장치, 상기 열화상 데이터를 수신하면 시간순으로 배열한 후 상기 시간순으로 배열된 열화상 데이터 중 탐지에 이용될 탐지 영역을 추출한 후 프레임을 시간순으로 배열하 고, 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범위만큼 분배하는 과정을 수행하는 열화상 데이터 전처 리 장치 및 미리 생성된 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력하고, 상기 미리 생성된 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상인지 여부에 따라 복합재의 결함 위치를 특정하는 결함 탐 지 장치를 포함한다."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 이면 발열체를 이용한 능동 복합재 결함 탐색 방법 및 이를 실행하는 시스템에 관한 것으로, 보다 구 체적으로 열화상 카메라로 획득한 복합재의 열화상 데이터를 시계열적 특성을 고려해 전처리하여 데이터 셋을 생성한 후 인공 지능에 입력하여 복합재의 결함을 탐지할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결 함 탐색 방법 및 이를 실행하는 시스템에 관한 것이다."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이면 발열체를 이용한 능동 복합재 결함 탐색 방법은 능동적 열화상 기법으로 획득한 복합재의 영상으로부터 결 함을 탐색하는 방법이다. 이면 발열체를 이용한 능동 복합재 결함 탐색 방법은 발열체를 이용해 복합재의 결함 을 검출하는 방법으로, 이면 발열체, 복합재, 적외선 카메라, 열화상 데이터 전처리부, 정상 데이터 및 결함 데 이터 분할부, 결함 탐지 인공지능 제작부, 결함 탐지부로 구성되어있다. 이면 발열체를 이용한 능동 복합재 결함 탐색 방법은 이면 발열체를 이용해 복합재의 결함을 검출하는 방법이다. 이면 발열체는 검사 대상 복합재가 발열체와 적외선 카메라 사이에 있는 경우 발열체를 이면 발열체 라 의미한다. 기존 설치되어있거나 운용되는 복합재 소재의 구조물이나 수송기기는 유지를 위한 보수가 필요할 때, 복합재의 결함을 탐지하기 위한 여러 방법의 접촉식 또는 비접촉식 방법과 기술들이 개발되어있으며 실제로 적용되고 있 다. 현장에서 사용되고 있는 결함 탐지 방법 중 육안 검사는 외관에 드러난 결함만을 확인할 수 있다. 또한, 진동/ 변위 기술은 분해능이 낮고 AE 기술은 잡신호가 많아 신호를 분리하고 분석하기에 어려움이 따른다. 그리고 레이저 UT 및 열화상 기술은 운용 중 결함의 측정이 어려우며 특히 비접촉식 열화상 기술은 자연 열원을 채택하는 경우 가열(일출, 일몰)에 시간적 제약이 있으며 능동 열원을 채택하는 경우 가열 열원의 용량이 낮은문제로 가열 가능한 면적이 작아 현장 적용의 어려움이 있다. 풍력 중 접근이 쉬운 지역에 있는 육상풍력발전기 블레이드는 블레이드를 탈거해 결함 검사에 초음파와 스트레 인 게이지를 활용한 결함 탐색 방법이 적용되고 있으며, 소형 선박 산업에서는 선박을 상가하여 부품 및 외관의 결함을 육안으로 검사한다. 하지만 풍력 중 접근이 어려운 해상풍력발전기, 육상풍력발전기의 블레이드는 블레이드의 탈거에 큰 비용이 소 모되기 때문에 기존 사용 중인 초음파와 스트레인 게이지를 이용한 접촉식 결함 탐색 방법은 많은 제약이 따른 다. 또한, 운용 중인 선박의 검사에는 시간적 제약으로 인한 결함 탐색의 어려움이 있다. 따라서, 현장 설치되어있 거나 운용 중인 풍력 블레이드 및 선박, 어선과 같은 복합재 구조물의 검사에 시간적 제약이 적고 곡면에의 결 함 탐색도 좋은 성능을 보여줄 수 있는 비접촉식 결함 탐지 방법의 개발이 필요하다."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 열화상 카메라로 획득한 복합재의 열화상 데이터를 시계열적 특성을 고려해 전처리하여 데이터 셋을 생성한 후 인공 지능에 입력하여 복합재의 결함을 탐지할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결 함 탐색 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 열화상 기법의 경우 자연 열원을 사용하는 수동형 열화상 기법의 시간적 제약의 한계를 극복할 수 있으며 외부 열원을 사용하는 능동형 열화상 기법의 가열 열원의 용량이 부족해 가열 면적이 작아 현장 적용 의 어려움이 있었던 기술적 과제를 해결할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 기존 열화상 기법을 풍력 블레이드에 적용하였을 때 생기는 시간적 제약의 단점을 해결할 수 있으며 다른 비접촉식 결함 탐지 방법을 사용하였을 때 풍력 블레이드를 탈거해야하는 금전적 단점을 해결할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 레저 선박 및 어선과 같이 곡면의 형상을 가지는 복합재 구조물에 본 발명의 기술을 적용함으 로써 기존 능동적 열화상 결함 탐지 방법이 가열 열원의 온도가 부족하고 적은 면적만 가열되는 문제로 인해 곡 면에 사용되기 어려웠던 단점을 보완할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법을 제 공하는 것을 목적으로 한다. 본 발명의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 발명의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 발명의 실시예에 의해 보다 분명하게 이해될 것이다. 또한, 본 발 명의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것 이다."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위한 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템은 복합재가 발열체와 적외선 카메라 사이에 위치한 상태에서 발열체로부터의 열이 매개체를 통해 전달되는 과정을 적외선 카메라를 통해 촬 영하여 열화상 데이터를 생성하는 능동 복합재 결함 탐색 장치, 상기 열화상 데이터를 수신하면 시간순으로 배 열한 후 상기 시간순으로 배열된 열화상 데이터 중 탐지에 이용될 탐지 영역을 추출한 후 프레임을 시간순으로 배열하고, 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범위만큼 분배하는 과정을 수행하는 열화상 데이 터 전처리 장치 및 미리 생성된 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력하고, 상기 미리 생성된 결 함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상인지 여부에 따라 복합재의 결함 위치를 특정하 는 결함 탐지 장치를 포함한다. 일 실시예에서, 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템은 이면 발열체에서 미리 결함 위치에 대한 정보가 주어진 복합재 시편을 사용하여 획득한 열화상 데이터를 수신하고, 상기 미리 결정된 결함이 없는 영역 에서 획득한 열화상 데이터를 결함 데이터 셋으로 분할하고, 상기 미리 결정된 결함이 있는 영역에서 획득한 열 화상 데이터를 정상 데이터 셋으로 분할하는 정상 및 결함 데이터 분할 장치를 포함할 수 있다. 일 실시예에서, 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템은 상기 정상 및 결함 데이터 분할에서 분 할된 데이터 셋 중 정상 데이터 셋을 수신하면, 상기 정상 데이터 셋을 이용하여 파라미터를 학습시켜 결함 탐 지 인공지능 모델을 제작하는 결함 탐지 모델 제작 장치를 포함할 수 있다. 또한, 이러한 목적을 달성하기 위한 이면 발열체를 이용한 능동 복합재 결함 탐색 방법은 능동 복합재 결함 탐 색 장치가 복합재가 발열체와 적외선 카메라 사이에 위치한 상태에서 발열체로부터의 열이 매개체를 통해 전달 되는 과정을 적외선 카메라를 통해 촬영하여 열화상 데이터를 생성하는 단계, 열화상 데이터 전처리 장치가 상 기 열화상 데이터를 수신하면 시간순으로 배열한 후 상기 시간순으로 배열된 열화상 데이터 중 탐지에 이용될 탐지 영역을 추출한 후 프레임을 시간순으로 배열하고, 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범 위만큼 분배하는 과정을 수행하는 단계 및 결함 탐지 장치기 미리 생성된 결함 탐지 인공지능 모델에 열화상 데 이터 셋을 입력하고, 상기 미리 생성된 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상인지 여부에 따라 복합재의 결함 위치를 특정하는 단계를 포함한다. 일 실시예에서, 이면 발열체를 이용한 능동 복합재 결함 탐색 방법은 이면 발열체에서 미리 결함 위치에 대한 정보가 주어진 복합재 시편을 사용하여 획득한 열화상 데이터를 수신하는 단계, 상기 미리 결정된 결함이 없는 영역에서 획득한 열화상 데이터를 결함 데이터 셋으로 분할하는 단계 및 상기 미리 결정된 결함이 있는 영역에 서 획득한 열화상 데이터를 정상 데이터 셋으로 분할하는 단계를 포함한다. 일 실시예에서, 이면 발열체를 이용한 능동 복합재 결함 탐색 방법은 상기 정상 및 결함 데이터 분할에서 분할 된 데이터 셋 중 정상 데이터 셋을 수신하는 단계 및 상기 정상 데이터 셋을 이용하여 파라미터를 학습시켜 결 함 탐지 인공지능 모델을 제작하는 단계를 포함한다."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "전술한 바와 같은 본 발명에 의하면, 열화상 카메라로 획득한 복합재의 열화상 데이터를 시계열적 특성을 고려 해 전처리하여 데이터 셋을 생성한 후 인공 지능에 입력하여 복합재의 결함을 탐지할 수 있도록 하는 이면 발열 체를 이용한 능동 복합재 결함 탐색 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 열화상 기법의 경우 자연 열원을 사용하는 수동형 열화상 기법의 시간적 제약의 한계를 극복할 수 있으며 외부 열원을 사용하는 능동형 열화상 기법의 가열 열원의 용량이 부족해 가열 면적이 작아 현장 적용 의 어려움이 있었던 기술적 과제를 해결할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 기존 열화상 기법을 풍력 블레이드에 적용하였을 때 생기는 시간적 제약의 단점을 해결할 수 있으며 다른 비접촉식 결함 탐지 방법을 사용하였을 때 풍력 블레이드를 탈거해야하는 금전적 단점을 해결할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법을 제공하는 것을 목적으로 한다. 또한, 본 발명은 레저 선박 및 어선과 같이 곡면의 형상을 가지는 복합재 구조물에 본 발명의 기술을 적용함으 로써 기존 능동적 열화상 결함 탐지 방법이 가열 열원의 온도가 부족하고 적은 면적만 가열되는 문제로 인해 곡 면에 사용되기 어려웠던 단점을 보완할 수 있도록 하는 이면 발열체를 이용한 능동 복합재 결함 탐색 방법을 제 공하는 것을 목적으로 한다."}
{"patent_id": "10-2022-0189477", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기술분 야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설명함 에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 도 1은 본 발명의 일 실시예에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템을 설명하기 위한 도면 이다. 도 1을 참조하면, 이면 발열체를 이용한 능동 복합재 결함 탐색 장치는 능동 복합재 결함 탐색 장치, 열화 상 데이터 전처리 장치, 정상 및 결함 데이터 분할 장치, 결함 탐지 모델 제작 장치 및 결함 탐 지 장치를 포함한다. 능동 복합재 결함 탐색 장치는 복합재가 발열체와 적외선 카메라 사이에 위차하여 발열체로부터의 열이 매 개체를 통해 전달되는 과정을 적외선 카메라를 통해 촬영한다. 열화상 데이터 전처리 장치는 능동 복합재 결함 탐색 장치로부터 획득한 열화상 데이터에 대한 전처 리를 실행한다. 열화상 데이터 전처리 장치는 복합재의 결함을 탐색하기 위해 획득한 열화상 데이터의 결함을 탐색하 기 위해선 시간의 흐름에 따라 열구배가 다르게 나타나는 경향을 확인해야 한다. 이를 위해, 열화상 데이터 전처리 장치는 열화상 데이터가 수신되면, 시간순으로 배열한다. 이와 같은 이 유는 온도 분포는 시간에 따라 변화하므로 시계열 데이터의 특성을 고려하여 전처리하기 위해서이다. 그 후, 열화상 데이터 전처리 장치는 시간순으로 배열된 열화상 데이터 중 탐지에 이용될 탐지 영역을 추 출한 후 프레임을 시간순으로 배열한다. 예를 들어, 열화상 데이터 전처리 장치는 열화상 데이터에서 탐지 영역을 추출한 후 1번 프레임부터 n번 프레임까지 시간순으로 배열할 수 있다. 상기와 같이 추출한 탐지 영역에 대하여 시간순으로 배열한 데이터는 곧 결함을 탐지할 복합재의 시간에 따른 열구배 변화를 나타낸다. 따라서, 전체 복합재 영역 중 결함의 위치를 특정하기 위해서는 복합재 영역을 구역으 로 나눈 다음 n개의 프레임(#)으로 구성된 하나의 데이터로 묶어 처리할 필요가 있다. 따라서, 열화상 데이터 전처리 장치는 각 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범위만큼 분 배하는 과정을 수행한다. 만일, 하나의 프레임에서 추출한 복합재 영역의 크기가 픽셀 단위로 라고 가정하였을 때, 열화상 데이터 전처리 장치는 픽셀 단위 15만큼 가로 방향으로 영역을 분배한다. 즉, 열화상 데이터 전처리 장치는 좌측부 터 프레임1(#1), 프레임2(#2), ..., 프레임n(#n)까지 동일한 과정을 반복하여 영역을 분배한 후, 하나의 정방행 렬로 취합한다. 그런 다음, 열화상 데이터 전처리 장치는 정방행렬을 구성하는 값을 기준으로 정규화된 영상 데이터를 생 성한다. 정상 및 결함 데이터 분할 장치는 미리 결정된 결함 위치 정보를 가지는 열화상 데이터를 수신한 후 결함 이 있는 영역에서 획득한 데이터는 결함 데이터 셋으로 분할하고, 결함이 없는 영역에서 획득한 데이터는 정상 데이터로 데이터 셋을 분할한다. 이와 같은 이유는 실제 결함을 진단하기 위해 미리 결함 위치에 대한 정보가 주어진 복합재 시편을 사용하여 열 화상 데이터를 생성하였기 때문에, 열화상 데이터는 결함 영역을 포함하거나 포함하지 않을 수 있다. 따라서, 정상 및 결함 데이터 분할 장치는 열화상 데이터에서 결함이 있는 영역에서 획득한 데이터는 결함 데이터 셋으로 분할하고, 결함이 없는 영역에서 획득한 데이터는 정상 데이터로 데이터 셋을 분할한다. 이때, 실제 결함을 진단하기 위한 복합재를 사용하여 결함을 탐색할 때에는 사용되지 않는다. 결함 탐지 모델 제작 장치는 입력된 데이터를 이용하여 결함을 탐지할 수 있는 인공지능의 파라미터를 학 습시킨다. 이를 위해, 결함 탐지 모델 제작 장치는 정상 및 결함 데이터 분할 장치에서 분할된 데이터 셋 중 정 상 데이터 셋을 수신한다. 그런 다음, 결함 탐지 모델 제작 장치는 정상 데이터 셋을 이용하여 파라미터를 학습시킨다. 따라서, 결함 탐지 모델 제작 장치를 통해 정상 데이터셋의 재구성 오차를 최소화하는 것에 중점을 둔 인공지능을 제작 한다. 보다 구체적으로, 결함 탐지 모델 제작 장치는 정상 데이터 셋이 입력되면 인공지능의 파라미터는 정상 데 이터의 재구성 오차를 최소화하기 위한 방향으로 학습된다. 따라서, 결함 탐지 모델 제작 장치에서 제작된 결함 탐지 인공지능 모델은 정상 데이터 셋 이외의 이상 데 이터가 입력되면 재구성 오차를 증가한다. 이러한 특성을 이용하여 임계 값을 미리 설정해주고, 미리 설정한 임 계 값을 기준으로 재구성 오차가 크다면 이상 데이터로 판별할 수 있도록 한다. 상기와 같이, 결함 탐지 모델 제작 장치는 판별된 이상 데이터를 결함 데이터로 정의하여 결함을 탐지하는 능력을 갖추는 결함 탐지 인 공지능 모델을 제작할 수 있다. 결함 탐지 장치는 결함 탐지 모델 제작 장치로부터 미리 제작된 결함 탐지 인공지능 모델을 수신한 후, 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력하여 결함을 탐지한다. 먼저, 결함 탐지 장치는 결함 탐지 모델 제작 장치로부터 미리 제작된 결함 탐지 인공지능 모델을 수 신한 후, 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력한다. 그 후, 결함 탐지 장치는 결함 탐지 인공지능 모델이 입력받은 열화상 데이터에 대해 결함 여부를 연산하고 수행 결과를 출력한 후 출력된 재구성 오차를 비교하여 정상과 결함 여부를 판단한다. 결함 탐지 장치는 결함이 있음으로 판단될 경우, 입력된 데이터의 사전 정보를 토대로 복합재의 결함이 위 치한 영역을 특정한 후, 전체 데이터 탐색의 완료 되었는지 여부를 판단한다. 보다 구체적으로, 결함 탐지 장치는 결함 탐지 모델 제작 장치로부터 수신된 결함 탐지 인공지능 모 델에 열화상 데이터 셋을 입력하고, 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상인지 여부 에 따라 복합재의 결함 위치를 특정할 수 있다. 일 실시예에서, 결함 탐지 장치는 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상이면 미리 제공된 입력된 데이터 셋의 정보를 기초로 복합재의 결함 위치를 특정한다. 다른 일 실시예에서, 결함 탐지 장치는 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이하 이면 결함이 발생하지 않았다고 판단할 수 있다. 즉, 결함 탐지 장치는 입력받은 전체 데이터에 대한 탐색이 완료되었는지 판단하고 전체 데이터의 탐색이 미완료상태라면, 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력한다. 이와 반대로, 결함 탐지 장치 는 입력받은 전체 데이터의 탐색이 완료되었을 경우 결함 탐지를 종료한다. 만일, 결함 탐지 장치는 결함이 없음으로 판단될 경우, 전체 데이터 탐색의 완료 되었는지 여부를 판단한 다. 즉, 결함 탐지 장치는 입력받은 전체 데이터에 대한 탐색이 완료되었는지 판단하고 전체 데이터의 탐색이 미완료상태라면 결함 탐지 인공지능 모델에 열화상 데이터 셋을 입력한다. 이와 반대로, 결함 탐지 장치는 입력받은 전체 데이터의 탐색이 완료되었을 경우 결함 탐지를 종료한다. 도 2는 본 발명의 일 실시예에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 장치의 내부 구조를 설명하기 위한 블록도이다. 도 2를 참조하면, 이면 발열체를 이용한 능동 복합재 결함 탐색 장치는 이면 발열체, 매개체, 복합재 및 적외선 카메라를 포함한다. 이면 발열체는 검사 대상 복합재가 발열체와 적외선 카메라 사이에 있는 경우 해당 발열체를 의미한 다. 이러한 이면 발열체는 복합재에 열을 가할 수 있는 어떤 장치라도 상관없다. 매개체는 발열체의 온도 구배가 균일하도록 만드는 매개체이다. 발열체와 복합재 사이에 위치한 등방성 재 료를 의미한다. 복합재는 결합 탐색의 대상이 되는 복합재이다. 복합재는 이면 발열체와 적외선 카메라 사 이에 위치해있으며, 이면 발열체의 열이 매개체를 통해 전달되어 온도가 상승한다. 복합재는 이 면 발열체에 의해 열이 점진적으로 가해지며 적외선 카메라에 의해 촬영된다. 적외선 카메라는 결함 탐색의 대상이 되는 복합재가 이면 발열체에 의해 열이 가해질 때, 온도 가 상승하는 복합재를 촬영하는 적외선 카메라이다. 적외선 카메라에서 복합재를 촬영 후 획득된 열 화상 데이터는 열화상 데이터 전처리 장치로 송신된다. 도 3은 본 발명의 일 실시예에 따른 전원공급장치에 의해 전력이 공급되면 이면 발열체에 열이 발생하게 되는 모습을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른 이면 발열체가 복합재에 부착되어있는 모 습의 단면도이다. 도 3 및 도 4를 참조하면, 이면 발열체는 검사 대상 복합재가 발열체와 적외선 카메라 사이에 있는 경우 해당 발열체를 의미한다. 복합재는 결합 탐색의 대상이 되는 복합재이다. 복합재는 이면 발열체와 적외선 카메라 사 이에 위치해있으며, 이면 발열체의 열이 매개체를 통해 전달되어 온도가 상승한다. 복합재는 이면 발 열체에 의해 열이 점진적으로 가해지며 적외선 카메라에 의해 촬영된다. 만일, 매개체와 적외선 카메라 사이에 위치한 복합재에 이면 발열체로부터의 열이 매개체 를 통해 균일해져 전달되면 도4의 단면도와 같이 결함이 없는 부위는 열이 고르게 전달된다. 하지만, 복합재 의 결함(130_1)에서는 열의 전달에 간섭이 생기는 것을 확인할 수 있다. 이로 인해, 이면 발열체의 온도로 복합재의 온도가 상승할 때에는 복합재의 결함이 있는 부위의 온도가 결함이 없는 부위보다 상대적으로 낮게 나타난다. 또한, 복합재의 온도가 하강할 때에는 결함이 있 는 부위의 온도가 결함이 없는 부위보다 상대적으로 높게 나타난다. 도 5은 본 발명에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 방법의 일 실시예를 설명하기 위한 흐름도 이다. 도 6은 도 5의 실행 과정을 설명하기 위한 예시도이다. 도 5를 참조하면, 열화상 데이터 전처리 장치는 능동 복합재 결함 탐색 장치로부터 수신된 열화상 데 이터에서 탐지에 이용될 영역을 추출한다(단계 S510). 도 6(a)의 좌측은 능동 복합재 결함 탐색 장치로부 터 획득되어 열화상 데이터 전처리 장치로 입력된 열화상 데이터이며, 도 6(a)의 좌측은 열화상 데이터에 서 탐지에 이용할 영역을 추출하기 위해 영역을 설정한 모습이다. 열화상 데이터 전처리 장치는 추출한 영상을 시간순으로 배열한다(단계 S520). 이와 같은 이유는 추출한 영역의 온도 분포는 시간에 따라 변화하므로 시계열 데이터의 특성을 고려하여 전처리하기 위해서이다. 예를 들 어, 도 6(b)는 도 6(a)에서 추출한 데이터의 1번 프레임부터 n번 프레임까지를 시간순으로 배열한 모습이다. 도 6(b)와 같이, 추출한 영역에 대하여 시간순으로 배열한 데이터는 곧 결함을 탐지할 복합재의 시간에 따른 열 구배 변화를 나타낸다. 따라서, 전체 복합재 영역 중 결함의 위치를 특정하기 위해서는 복합재 영역을 구역으로 나눈 다음 n개의 프레임(#)으로 구성된 하나의 데이터로 묶어 처리할 필요가 있다. 열화상 데이터 전처리 장치는 각 프레임에서 추출된 복합재 전체 영역에 대해 일정한 범위만큼 분배한다 (단계 S530). 예를 들어, 도 6(c)와 같이, 열화상 데이터 전처리 장치는 하나의 프레임에서 추출한 복합재 영역의 크기가 픽셀 단위로 라고 가정하였을 때, 픽셀 단위 15만큼 가로 방향으로 영역을 분배하는 모습이다. 좌측부터 프레임1(#1), 프레임2(#2), ..., 프레임n(#n)까지 동일한 과정을 반복하여 영역을 분배한다. 열화상 데이터 전처리 장치는 분배한 시계열 온도 데이터를 하나의 정방 행렬로 취합한다(단계 S540). 예 를 들어, 열화상 데이터 전처리 장치는 도 6(c)와 같이 분배한 영역을 하나의 정방행렬로 취합하여 도 6(d)와 같은 결과물을 형성한다. 보다 구체적으로, 도 6(c)의 프레임1(#1)일 때 분배된 ①번 영역은 도 6(d)의 #1-①위치에 할당된다. 도 6(c)의 프레임2(#2)일 때 분배된 ①번 영역은 도 6(d)의 #2-①위치에 할당된다. 위와 같은 과정을 프레임n(#n)까지 반복하여 하나의 정방행렬을 형성한다. 마찬가지로, 도 6(c)의 프레임1(#1) 일 때 분배된 ②번 영역은 도 6(d)의 #1-②위치에 할당되며 프레임n(#n)까지 동일한 과정을 반복하며 정방행렬 을 형성한다. 그런 다음, 열화상 데이터 전처리 장치는 정방행렬에 대한 정규화를 수행하여 영상으로 변환한다(단계 S550). 예를 들어, 열화상 데이터 전처리 장치는 도 6(d)의 정방행렬을 구성하는 값을 기준으로 정규화된 영상을 생성하여 도 6(e)와 같은 결과물을 출력한다. 도 7은 본 발명에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 방법의 다른 일 실시예를 설명하기 위한 흐름도이다. 도 7을 참조하면, 결함 탐지 모델 제작 장치는 입력된 데이터를 이용하여 결함을 탐지할 수 있는 인공지능 의 파라미터를 학습시킨다. 이를 위해, 결함 탐지 모델 제작 장치는 정상 및 결함 데이터 분할 장치 에서 분할된 데이터 셋 중 정상 데이터 셋을 수신한다(단계 S710). 그런 다음, 결함 탐지 모델 제작 장치는 정상 데이터 셋을 이용하여 파라미터를 학습시킨다. 따라서, 결함 탐지 모델 제작 장치를 통해 정상 데이터셋의 재구성 오차를 최소화하는 것에 중점을 둔 인공지능을 제작 한다. 보다 구체적으로, 결함 탐지 모델 제작 장치는 정상 데이터 셋이 입력되면 인공지능의 파라미터는 정상 데 이터의 재구성 오차를 최소화하기 위한 방향으로 학습된다. 따라서, 결함 탐지 모델 제작 장치에서 제작된 결함 탐지 인공지능 모델은 정상 데이터 셋 이외의 이상 데 이터가 입력되면 재구성 오차를 증가한다. 이러한 특성을 이용하여 임계 값을 미리 설정해주고, 미리 설정한 임 계 값을 기준으로 재구성 오차가 크다면 이상 데이터로 판별할 수 있도록 한다. 상기와 같이, 결함 탐지 모델 제작 장치는 판별된 이상 데이터를 결함 데이터로 정의하여 결함을 탐지하는 능력을 갖추는 결함 탐지 인 공지능 모델을 제작할 수 있다. 도 8은 본 발명에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 방법의 또 다른 일 실시예를 설명하기 위 한 흐름도이다. 도 8을 참조하면, 결함 탐지 장치는 결함 탐지 모델 제작 장치로부터 미리 제작된 결함 탐지 인공지 능 모델을 수신한다(단계 S810). 결함 탐지 장치는 결함 탐지 인공지능에 열화상 데이터 셋을 입력한다(단계 S820). 그 후, 결함 탐지 장치 는 결함 탐지 인공지능 모델이 입력받은 열화상 데이터에 대해 결함 여부를 연산하고 수행 결과를 출력한 후 출력된 재구성 오차를 비교하여 정상과 결함 여부를 판단한다(단계 S830). 보다 구체적으로, 결함 탐지 장치는 결함 탐지 모델 제작 장치로부터 수신된 결함 탐지 인공지능 모 델에 열화상 데이터 셋을 입력하고, 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상인지 여부에 따라 복합재의 결함 위치를 특정할 수 있다. 단계 S830에 대한 일 실시예에서, 결함 탐지 장치는 결함 탐지 인공지능 모델에서 출력된 재구성 오차가 임계 값 이상이면 미리 제공된 입력된 데이터 셋의 정보를 기초로 복합재의 결함 위치를 특정한다. 단계 S830에 대한 다른 일 실시예에서, 결함 탐지 장치는 결함 탐지 인공지능 모델에서 출력된 재구성 오 차가 임계 값 이하이면 결함이 발생하지 않았다고 판단할 수 있다. 결함 탐지 장치는 결함이 있음으로 판단될 경우(단계 S840), 입력된 데이터의 사전 정보를 토대로 복합재 의 결함이 위치한 영역을 특정한 후(단계 S850), 전체 데이터 탐색의 완료 되었는지 여부를 판단한다(단계 S860). 즉, 결함 탐지 장치는 입력받은 전체 데이터에 대한 탐색이 완료되었는지 판단하고 전체 데이터의 탐색이 미완료상태라면(단계 S860), 단계 S820으로 회귀한다. 이와 반대로, 결함 탐지 장치는 입력받은 전체 데 이터의 탐색이 완료되었을 경우 결함 탐지를 종료한다. 결함 탐지 장치는 결함이 없음으로 판단될 경우(단계 S840), 전체 데이터 탐색의 완료 되었는지 여부를 판 단한다(단계 S860). 즉, 결함 탐지 장치는 입력받은 전체 데이터에 대한 탐색이 완료되었는지 판단하고 전체 데이터의 탐색이 미완료상태라면(단계 S860), 단계 S820으로 회귀한다. 이와 반대로, 결함 탐지 장치는 입력받은 전체 데 이터의 탐색이 완료되었을 경우 결함 탐지를 종료한다. 한정된 실시예와 도면에 의해 설명되었으나, 본 발명은 상기의 실시예에 한정되는 것은 아니며, 이는 본 발명이 속하는 분야에서 통상의 지식을 가진 자라면 이러한 기재로부터 다양한 수정 및 변형이 가능하다. 따라서, 본 발명 사상은 아래에 기재된 특허청구범위에 의해서만 파악되어야 하고, 이의 균등 또는 등가적 변형 모두는 본 발명 사상의 범주에 속한다고 할 것이다."}
{"patent_id": "10-2022-0189477", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 시스템을 설명하기 위한 도면 이다. 도 2는 본 발명의 일 실시예에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 장치의 내부 구조를 설명하기 위한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 전원공급장치에 의해 전력이 공급되면 이면 발열체에 열이 발생하게 되는모습을 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른 이면 발열체가 복합재에 부착되어있는 모습의 단면도이다. 도 5은 본 발명에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 방법의 일 실시예를 설명하기 위한 흐름도 이다. 도 6은 도 5의 실행 과정을 설명하기 위한 예시도이다. 도 7은 본 발명에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 방법의 다른 일 실시예를 설명하기 위한 흐름도이다. 도 8은 본 발명에 따른 이면 발열체를 이용한 능동 복합재 결함 탐색 방법의 또 다른 일 실시예를 설명하기 위 한 흐름도이다."}
