{"patent_id": "10-2022-0014004", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0118207", "출원번호": "10-2022-0014004", "발명의 명칭": "소프트웨어 기술 및 메타버스 기술에 기반하여 학생들을 교육하는 방법 및 그 시스템", "출원인": "주식회사 배움차이", "발명자": "김현수"}}
{"patent_id": "10-2022-0014004", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "학생들에 대한 교육 컨텐츠를 제공하는 방법에 있어서,스마트폰을 통하여 입력되는 제1 정보를 수신하고,상기 제1 정보에서 학생 교육과 관련되는 분석 정보를 추출하고,상기 분석 정보를 상기 스마트폰에서 표시되도록 제어하고,상기 스마트폰을 통하여 상기 스마트폰의 사용자의 선택에 상응하는 신호를 수신하고,상기 선택에 기반하여 상기 학생들에 대한 교육 컨텐츠를 생성하여 상기 스마트폰을 통하여 표시되도록 제어하되, 상기 교육 컨텐츠는 메타버스 공간에서 제공되는 정보에 관한 것인, 방법."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 소프트웨어 기술 및 메타버스 기술에 기반하여 학생들을 교육하는 방법 및 그 시스템에 관한 것이다. 본 발명의 일 실시예는 학생들에 대한 교육 컨텐츠를 제공하는 방법에 있어서, 스마트폰을 통하여 입력되는 사용 자의 개인 정보를 수신하고, 상기 사용자의 개인 정보에서 학생 교육과 관련되는 이미지 정보를 추출하고, 상기 이미지 정보를 상기 스마트폰에서 표시되도록 제어하고, 상기 스마트폰을 통하여 상기 사용자의 선택에 상응하는 신호를 수신하고, 상기 선택에 기반하여 상기 학생들에 대한 교육 컨텐츠를 생성하여 상기 스마트폰을 통하여 표 시되도록 제어하는 방법을 제안한다. 상기 교육 컨텐츠는 메타버스 공간에서 제공되는 정보에 관한 것이다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 교육 컨텐츠를 제공하는 기술에 관한 것이다. 또한 본 발명은 소프트웨어 기술 및 메타버스 기술에 기반하여 학생들을 교육하는 방법 및 그 시스템에 관한 것 이다. 또한 본 발명은 소프트웨어 기술과 메타버스 기술을 사용하여 디지털리터러시, 과학, 수학, 음악, 미술 등의 과 목을 초등학생들에게 교육하는 앱(웹/모바일)프로그램에 관한 것이다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "다가올 미래사회의 메가트랜드(megatrends)의 핵심은 사용자가 직접 참여할 수 있는 Social Network를 형성하고, 교육, 경제 및 문화 등의 전반적인 행동을 수행할 수 있게 하며, 창의적인 사용자들이 혼합 현실 환 경(mixed reality environment)에서 캐릭터, 공간 등을 자유롭게 제작, 판매, 개발 및 공유를 가능케한다. 상술한 혼합 현실 환경을 제공하는 대표적인 서비스로서, 메타버스(meta-verse)가 있다. 이 메타버스는 가공, 추상을 의미하는 '메타(meta)'와 현실세계를 의미하는'유니버스(universe)'의 합성어로 3차원 가상세계를 의미 한다. 메타버스는 기존의 가상 현실 환경(virtual reality environment)이라는 용어보다 진보된 개념으로서, 웹 과 인터넷 등의 가상세계가 현실세계에 흡수된 상술한 혼합 현실 환경(mixed reality environment)을 제공한다. 메타버스(meta-verse)는 사용자의 참여에 따라 무한한 확장이 가능하며, 캐릭터, 환경 및 공간 등을 자유자재로 선택할 수 있지만, 많은 선행작업에 따른 사용자의 부담감이 높으며 동일한 형태의 하나의 가상세계만 존재한다. 따라서 콘텐츠의 무한한 확장성을 지원하고 단순하지만 고수준의 콘텐츠를 제작할 수 있으며, 다중 가상 세계의 공유를 지원할 수 있는 서비스 인프라에 대한 개발이 요구되는 실정이다. 기존의 메타버스들을 살펴보면, 콘텐츠의 관리 및 전송 규격이 단일 메타버스 환경에 한정되며, 특정 메타버스 환경에 최적화되어 있다. 또한, 동일한 사용자가 다른 메타버스 환경을 자유롭게(seamlessly) 이용할 수 있는 멀티 메타버스 환경에서의 콘텐츠의 관리 및 전송으로 확장이 어렵다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 실시예는 소프트웨어 기술 및 메타버스 기술에 기반하여 학생들을 교육하는 방법 및 그 시스템을 제공하는데 그 목적이 있다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "본 발명에서 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급하지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하 게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 소프트웨어 기술 및 메타버스 기술에 기반하여 학생들을 교육하는 방법 및 그 시스템을 제안한다. 또한 본 발명의 일 실시예는 학생들에 대한 교육 컨텐츠를 제공하는 방법에 있어서, 스마트폰을 통하여 입력되 는 제1 정보를 수신하고, 상기 제1 정보에서 학생 교육과 관련되는 분석 정보를 추출하고, 상기 분석 정보를 상 기 스마트폰에서 표시되도록 제어하고, 상기 스마트폰을 통하여 상기 스마트폰의 사용자의 선택에 상응하는 신 호를 수신하고, 상기 선택에 기반하여 상기 학생들에 대한 교육 컨텐츠를 생성하여 상기 스마트폰을 통하여 표 시되도록 제어하는 시스템을 제안한다. 또한 본 발명의 일 실시예는 학생들에 대한 교육 컨텐츠를 제공하는 시스템에 있어서, 입력 모듈을 포함하는 (a) 단말; 및 상기 단말과 이미지 정보 및 텍스트 정보를 송수신하는 통신 모듈, 출력 모듈, 및 상기 통신 모듈 및 상기 출력 모듈을 제어하고, IoT(Internet of Things) 기술 및 ICT(Information and Communication Technology)에 기반하는 제어 모듈을 포함하는 (b) 서버; 를 포함하고, 상기 이미지 정보 및 상기 텍스트 정보 는, 상기 단말로부터 획득되는 제1 정보에 기반하여 상기 제어 모듈에 의해 결정되며, 학생들에 대한 교육 컨텐 츠에 관한 것임을 특징으로 하는 시스템을 제안한다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시예는 개선된(enhanced) 소프트웨어 기술 및 메타버스 기술에 기반하여 학생들을 교육하는 방 법 및 그 시스템을 제공할 수 있다. 본 발명의 일 실시예를 통하여 CG영상솔루션제작의 강점을 살린 다양한 유형의 액티비티에 시청각 효과 극대화 할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 실시예를 설명함에 있어서 본 발명이 속하는 기술 분야에 익히 알려져 있고 본 발명과 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 발명의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(field-Programmable Gate Array) 또 는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할 들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~ 부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들 은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 본 발명의 실시예들을 구체적으로 설명함에 있어서, 특정 시스템의 예를 주된 대상으로 할 것이지만, 본 명세서 에서 청구하고자 하는 주요한 요지는 유사한 기술적 배경을 가지는 여타의 통신 시스템 및 서비스에도 본 명세"}
{"patent_id": "10-2022-0014004", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "서에 개시된 범위를 크게 벗어나지 아니하는 범위에서 적용 가능하며, 이는 당해 기술분야에서 숙련된 기술적 지식을 가진 자의 판단으로 가능할 것이다. 도 1은 본 발명의 단말이 정보를 출력하는 일 실시예를 나타내는 도면이다. 도 1은 참조하면, 예를 들면, 본 발명의 일 실시예에 따른 단말은 학생들에 대한 교육 컨텐츠에 관한 이미 지 정보를 출력할 수 있다. 본 발명의 일 실시예에 따른 서버 및/또는 단말은 각 초등학교에 최적화(커스터마이징)된 메타버스 클래스를 개설하고, 학생들이 자발적으로 수업공간에 입장, 강의 콘텐츠 시청, 토론(음성, 문자채팅), 퀴즈 및 퀘스트 수행하여 교육 수료증, 확인서, 등급 등을 NFT형태로 발급받고, 학생들의 과제를 NFT로 제출할 수 있게 한다. 본 발명의 일 실시예에 따른 단말은 IoT 기술 및/또는 ICT 기술에 기반하여 획득되거나 생성될 수 있는 학 생들에 대한 교육 컨텐츠에 관한 이미지 정보를 출력할 수 있다. 여기서 IoT는 사물인터넷(Internet of Things)을 나타낼 수 있다. IoT(사물인터넷)는 세상의 모든 사물들이 네트워크로 '연결'되어 서로 소통하는 차세대 기술을 의미할 수 있다. 4차 산업혁명은 사물인터넷으로 빅데이터를 얻고, 그것을 클라우드에 저장해, 인공지능으로 분석하고 활용하는 것이다. 사물인터넷은 지능화되어 스마트 자동차, 스마트 홈, 스마트 시티 등 스마트 세계를 만들어 낼 수 있다. 예를 들면, 완전 자율 자동차나 스마트 홈, 스마트 빌딩, 헬스 케어 서비스 등 모든 분야에 인터넷이 연결되는 세상이 되어, 마치 인터넷이 공기와 같이 되는데 굳이 인터넷이 따로 있을 필요가 없을 수 있다. 사물인터넷이 가능하기 위해서는 인터넷만 있어서는 안 된다. 센서와 네트워크 기술, 빅데이터, 클라우드 컴퓨팅, 인공지능, 3D 프린팅 등의 다양한 기반 기술이 함께 어우러져야 한다. 특히 4차 산업혁명은 사물인터넷으로 빅데이터를 얻 고, 그것을 클라우드(cloud)에 저장해, 인공지능으로 분석하고 활용하는 흐름을 보여준다. 또한 ICT는 정보통신기술(Information and Communication Technology)을 나타낼 수 있다. ICT(Information & Communication Technology)는 정보 기술(Information Technology, IT)과 통신 기술 (Communication Technology, CT)의 합성어로 정보기기의 하드웨어 및 이들 기기의 운영 및 정보 관리에 필요한 소프트웨어 기술과 이들 기술을 이용하여 정보를 수집, 생산, 가공, 보존, 전달, 활용하는 모든 방법을 의미한 다. ICT 패러다임의 변화는 콘텐츠(C)-플랫폼(P)-네트워크(N)-디바이스(D) 가치사슬 상의 각 부문간 상호의존 심화 관점에서 이해할 수 있다. 일반적으로 C-PN-T(터미널) 가치사슬이 방송플랫폼을 설명하는데 많이 활용되었으나, 스마트폰, 태블릿 등 사실 상 컴퓨터에 해당되는 기기를 감안하면 C-P-N-D라는 표현이 ICT를 설명하는데 좀 더 유용할 수 있다. 콘텐츠(C) 부문을 살펴보면, 인터넷상에서는 더 이상 사진, 서적, 음악, 동영상 등의 구분이 무의미하다는 점을 상기할 필 요가 있다. 이들 모든 종류의 콘텐츠는 디지털화되면서 플랫폼 제공자에 의해서 이용자에 제공되며 콘텐츠 보유 자는 구글, 애플, 아마존과 같은 플랫폼 제공자와 제휴하거나 직접 플랫폼을 구성하여 콘텐츠를 제공한다. 플랫 폼 부문은 C-P-N-D 가치사슬에서 중요한 역할을 담당할 수 있다. 인터넷 상에서 콘텐츠는 소프트웨어에 의해 축적, 처리, 저장, 제공될 수 있다. 이는 소프트웨어 기술력을 보유 한 ICT 기업이 주도권을 잡게 됨을 의미하는데, 특히 소프트웨어 기술력과 클라우드 인프라를 보유한 클라우드 서비스 제공자가 대표적인 플랫폼 제공자로 부상하고 있다. 그 과정에서 전통적인 네트워크 전송 서비스 제공자 의 위상은 상대적으로 약화될 가능성이 있다. 반면 원천 콘텐츠를 보유한 기업은 플랫폼 제공자와 대등한 관계 의 설정도 가능할 것이다. 디지털 융합시대의 네트워크는 IP망, 즉 인터넷이다. 서킷방식 전화망과 같은 전통적 인 네트워크는 네트워크 보유자가 자체적으로 이용자 식별 등의 지능적 서비스를 제공하지만 인터넷의 경우에는 아카마이와 같은 다양한 서비스 제공기업들이 서버 클러스터를 통하여 효율적 트래픽 전송, 보안 등 네트워크의 다양한 기능을 경쟁 시장에서 제공한다. 이러한 지능형 네트워크 서비스 제공기업도 일종의 플랫폼 제공기업이라는 의미에서 사실상 플랫폼과 네트워크 의 구분은 어렵다. 또한 통신망을 보유한 사업자들이 직접 플랫폼 서비스를 제공한다는 점도 중요하다. 디바이 스 부문은 언제나 인터넷과 연결되고, iOS와 같은 범용 운영체제를 갖춘 디바이스 내부의 소프트웨어 프로그램 이 플랫폼과 연결되어 서비스를 완결한다. 애플은 플랫폼 제공자가 동시에 디바이스 제공자인 대표적인 예라 할 수 있으며, 구글과 안드로이드폰의 제조사간의 제휴관계를 감안하면 과거보다 플랫폼 부문과 디바이스 부문의 관계가 보다 밀접한, 상호의존적인 관계임을 알 수 있다. 콘텐츠 부문과 플랫폼 부문의 제휴, 디바이스 부문의 플랫폼과의 연계, 플랫폼 부문과 네트워크 부문의 경계 모호 등은 모두 C-P-N-D 각 부문의 상호의존성 심화를 의미할 수 있다. 도 2는 본 발명의 일 실시예에 따른 시스템을 나타내는 도면이다. 도 2를 참조하면, 본 발명은 도 2의 식자재 가공 시스템을 제어하거나 모니터링하는 식자재 관리 시스템 을 제안하며, 상기 식자재 관리 시스템은 본 발명의 서버, 본 발명의 단말, 및/또는 식자 재 가공 시스템을 포함한다. 또한 본 발명의 서버는 제1 제어 모듈, 제1 통신 모듈, 제1 입력 모듈, 및/또는 제1 출력 모듈을 포함할 수 있으며, 본 발명의 단말은 제2 제어 모듈, 제2 통신 모듈, 제2 입력 모 듈(123, 미도시)을 포함할 수 있다. 제어 모듈(111, 121)은 본 발명의 일 실시예에 따른 동작/단계/과정을 구현할 수 있도록 본 발명의 서버 및/또는 본 발명의 단말을 직/간접적으로 제어할 수 있다. 또한 제어 모듈(111, 121)은 적어도 하나의 프 로세서를 포함할 수 있으며, 프로세서는 적어도 하나의 중앙 처리 유닛(CPU) 및/또는 적어도 하나의 그래픽 처리 디바이스(GPU)를 포함할 수 있다. 통신 모듈(112, 122)은 본 발명의 서버 및/또는 본 발명의 단말 등과 각종 데이터, 신호, 정보를 송 수신할 수 있다. 또한, 통신 모듈(112, 122)은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 또한, 통신 모듈(112, 122)은 제1 네트워크(예: 블루투스, WiFi direct 또는 IrDA(infrared data association) 같은 근거리 통신 네트워크) 또는 제2 네트워크(예: 셀룰러 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트 워크)를 통하여 외부 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성 요소(예: 단일 칩)으로 통합되거나, 또는 서로 별도의 복수의 구성 요소들(예: 복수 칩들)로 구현될 수 있다. 입력 모듈(113, 123)은 본 발명의 서버 및/또는 본 발명의 단말의 구성요소(예: 제어 모듈(111, 121) 등)에 사용될 명령 또는 데이터를 본 발명의 서버 및/또는 본 발명의 단말의 외부(예: 사용자(예; 제 1 사용자, 제2 사용자 등), 본 발명의 서버의 관리자 등)로부터 수신할 수 있다. 또한, 입력 모듈(113, 123)은 충전장치, 관리서버, 및/또는 본 발명의 단말에 설치된 터치인식가능 디스플레이, 터치 패드, 버튼형 인식 모듈, 음성인식센서, 마이크, 마우스, 또는 키보드 등을 포함할 수 있다. 여기서 터치인식가 능 디스플레이, 터치패드, 버튼형 인식 모듈은 감압식 및/또는 정전식 방식을 통하여 사용자의 신체(예; 손가락)를 통한 터치를 인식할 수 있다. 출력 모듈(114, 124)은 본 발명의 서버 및/또는 본 발명의 단말의 제어 모듈(111, 121)에 의해 생성 되거나 통신 모듈(112, 122)을 통하여 획득된 신호(예; 음성 신호), 정보, 데이터, 이미지, 및/또는 각종 객체 (object) 등을 표시하는 모듈이다. 예를 들면, 출력 모듈(114, 124)은 디스플레이, 스크린, 표시부(displaying unit), 스피커 및/또는 발광장치(예; LED 램프) 등을 포함할 수 있다. 또한, 본 발명의 서버 및/또는 본 발명의 단말은 저장 모듈(storage module)을 더 포함할 수 있으며, 본 발명의 서버 및/또는 본 발명의 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등 의 데이터를 저장한다. 또한, 저장 모듈은 플래시 메모리 타입(Flash Memory Type), 하드 디스크 타입(Hard Disk Type), 멀티미디어 카드 마이크로 타입(Multimedia Card Micro Type), 카드 타입의 메모리(예를 들면, SD 또는 XD 메모리 등), 자기 메모리, 자기 디스크, 광디스크, 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), PROM(Programmable Read-Only Memory), EEPROM(Electrically Erasable Programmable Read-Only Memory) 중 적어도 하나의 저장매체를 포함할 수 있다. 또한, 상기 저장 모듈은 본 발명의 서버 및/또는 본 발명의 단말을 사용하는 제1 사용자의 개인정보 를 포함할 수 있다. 여기서 개인정보는 이름, 아이디(ID; identifier), 패스워드, 주민등록번호, 도로명 주소, 전화 번호, 휴대폰 번호, 및/또는 이메일 주소 등을 포함할 수 있다. 또한, 제1 제어 모듈(111, 121)은 저장 모 듈에 저장된 각종 프로그램, 컨텐츠, 데이터 등을 이용하여 다양한 동작을 수행할 수 있다. 도 3은 본 발명의 일 실시예에 따른 방법을 나타내는 흐름도이다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 방법은 제1 단계를 수행하고(S210), 제2 단계를 수행하고(S220), 제3 단계를 수행하고(S230), 및/또는 제4 단계를 수행할 수 있다(S240). 일 예로, 상기 제1 단계(S210)는 서버가 단말로부터 제1 정보를 획득하거나 수신하거나 수집하는 것 을 특징으로 할 수 있다. 일 예로, 상기 제2 단계(S220)는 단말이 서버로부터 제2 정보를 획득하거나 수신하거나 수집하는 것 을 특징으로 할 수 있다. 일 예로, 상기 제3 단계(S230)는 서버 및/또는 단말이 상기 제1 정보 및/또는 상기 제2 정보에 기반 하여 학생들에 대한 교육 컨텐츠에 관한 정보를 생성하는 것을 특징으로 할 수 있다. 일 예로, 상기 제4 단계(S240)는 서버 및/또는 단말이 학생들에 대한 교육 컨텐츠에 관한 정보를 출 력하는 것을 특징으로 할 수 있다. 본 발명의 일 실시예에 따른 방법은, 일 예에 따라 상기 S210 내지 S240 중 일부만을 포함할 수도 있으며, 다른 예에 따라 상기 S210 내지 S240의 순서는 변경될 수 있다. 도 4는 본 발명의 단말이 정보를 출력하는 다른 실시예를 나타내는 도면이다. 도 4를 참조하면, 예를 들면, 본 발명의 다른 실시예에 따른 단말은 학생들에 대한 교육 컨텐츠에 관한 텍 스트 정보를 출력할 수 있다. 본 발명의 다른 실시예에 따른 단말은 IoT 기술 및/또는 ICT 기술에 기반하여 획득되거나 생성될 수 있는 학생들에 대한 교육 컨텐츠에 관한 텍스트 정보를 출력할 수 있다. 발명의 서버는 인공지능망에 기반하여 본 발명의 일 실시예에 따른 시스템 및 도 3의 방법 등에서 사 용되는 정보를 선택하거나 결정할 수 있다. 또한, 본 발명의 서버는 머신러닝 모듈(미도시)을 포함할 수 있으며, 머신러닝 모듈(미도시)은 데이터베이스에 저장된 빅데이터(big data)에 기계 학습(machine learning)을 이용하여 상기 본 발명의 일 실시예에 따른 시스템 및 도 3의 방법 등에서 사용되는 정보 등을 선택하거나 결정할 수 있다. 또한, 머신러닝 모듈은 본 발명의 서버의 데이터베이스에 저장된 빅데이터를 입력변수로 하여 상기 인공지능망을 학습시키는데, 구체적으로는 머신러닝의 한 분야인 딥러닝(Deep Learning) 기법을 이용 하여 정확한 상관 관계가 도출될 수 있도록 학습을 수행한다. 또한 머신러닝 모듈은 딥러닝을 통하여 상기 함수에서의 복수 개의 입력들의 가중치(weight)를 학습을 통하여 산출할 수 있다. 또한, 이러한 학습을 위하여 활용되는 인공지능망 모델로는 RNN(Recurrent Neural Network), DNN(Deep Neural Network) 및 DRNN(Dynamic Recurrent Neural Network) 등 다양한 모델들을 활용할 수 있을 것 이다. 이를 통해 상기 머신러닝 모듈은 본 발명의 일 실시예에 따른 시스템 및 도 3의 방법 등에서 사용되 는 정보를 결정하거나 설정할 수 있다. 본 발명의 일 실시예는 학생들에 대한 교육 컨텐츠를 제공하는 시스템에 있어서, 입력 모듈을 포함하는 (a) 단 말; 및 상기 단말과 이미지 정보 및 텍스트 정보를 송수신하는 통신 모듈, 출력 모듈, 및 상기 통신 모듈 및 상 기 출력 모듈을 제어하고, IoT(Internet of Things) 기술 및 ICT(Information and Communication Technology) 에 기반하는 제어 모듈을 포함하는 (b) 서버; 를 포함하고, 상기 이미지 정보 및 상기 텍스트 정보는, 상기 단 말로부터 획득되는 제1 정보에 기반하여 상기 제어 모듈에 의해 결정되며, 학생들에 대한 교육 컨텐츠에 관한 것임을 특징으로 하는 시스템을 제안한다. 도 5 내지 도 16은 본 발명의 일 실시예에 따른 어플리케이션에서 제공되는 화면을 나타내는 도면이다. 본 발명의 일 실시예에 따른 어플리케이션은 서버에 의해 운용되고, 단말에서 실행될 수 있다. 또한 상기 어플리케이션은 다음과 같은 절차를 제공(및/또는 구현)할 수 있다. 1. 사용자는 단말을 통하여 로그인하고, 로비에 대기한다. 2. 선생님(교육 컨텐츠 제공자)이 보내준 URL 또는 어플리케이션 메시지 창으로 받은 교실 초대장을 통하여 선 생님이 개설한 방에 접속한다. (최대 인원 40명까지 입장할 수 있다.) 3. 선생님이 수업에 대한 대략적인 설명 및 출석을 체크한다. 4. 선생님이 가상환경에서 이론 수업을 실시한다. 상기 이론수업은 PPT 또는 PDF 파일을 활용한 직접 강의 방식 과 영상 미디어 스트리밍을 통한 수업 방식 중 선택할 수 있다. 5. 이론 수업 후 퀴즈를 풀 수 있도록 접속 가능한 아이콘을 눌러 퀴즈를 풀어 확인 학습한다. 6. 퀴즈의 운영 방식은 OX 형식과 4지선다형의 문제들로 이루어져 있다. 7. 퀴즈의 결과는 선생님이 볼 수 있게 데이터 저장이 된다. 8. 퀴즈 후 교실로 자동으로 로그인 된다. 5~7분의 시간 후 모든 학생들이 돌아오게 된다. 9. 학생은 선생님과 이론에 대해 토론하는 시간을 갖는다. 이때 질서 있는 토론이 가능 하도록 선생님이 발표 권한을 한사람씩 부여하거나 모둠으로 나누어 찬반 대결 등을 통한 학습을 한다. 10.마지막 단계는 학습 게임에 참가한다. 학습 게임은 각 학습별로 준비되며 어드벤처 게임 형식을 갖추고 있으 며 탐험을 지속함에 따라 학습한 내용에 대한 복습을 할 수 있다. 11. 게임은 주어진 시간을 정 할 수 없기 때문에 수업은 게임 참가전까지 진행되며 게임은 숙제로서의 역할을 담당한다. 12. 게임 플레이에 대한 데이터는 선생님에게 전송되어 학생의 학습평가에 반영한다. 이와 같은 특징을 통해, 본 발명의 일 실시예에 따른 서버 및/또는 단말을 통하여 제공되는 어플리케 이션을 통하여, 5개의 디지털리터러시 커리큘럼을 메타버스 룸이 구현될 수 있다. 교사(교육자)와 학생(피교육 자)이 아바타(캐릭터)를 통해 메타버스공간에 참여할 수 있으며, 교사(교육자) 및/또는 학생(피교육자)에게 기 본캐릭터를 부여, 미션수행시 아이템 획득(사이버범죄방어갑옷, 훈장브로치, 왕관 등을 제공할 수 있다. 또한 초기 메타버스 내 접속인원은 10명 이내 목표로 하고, 단계적으로 수용가능인원 확대할 수 있다. 본 명세서와 도면에 개시된 본 발명의 실시예들은 본 발명의 기술 내용을 쉽게 설명하고 본 발명의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 즉 본 발명의 기술적 사 상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 발명의 속하는 기술 분야에서 통상의 지식을 가진 자 에게 자명한 것이다. 또한 상기 각각의 실시예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 발명 의 모든 실시예는 일부분들이 서로 조합되어 본 발명의 시스템, 서버, 및/또는 단말에 의해 구 현될 수 있다. 또한, 본 발명의 시스템, 서버, 및/또는 단말을 제어하는 방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 이와 같이, 본 발명의 다양한 실시예들은 특정 관점에서 컴퓨터 리드 가능 기록 매체(computer readable recording medium)에서 컴퓨터 리드 가능 코드(computer readable code)로서 구현될 수 있다. 컴퓨터 리드 가 능 기록 매체는 컴퓨터 시스템에 의해 리드될 수 있는 데이터를 저장할 수 있는 임의의 데이터 저장 디바이스이 다. 컴퓨터 리드 가능 기록 매체의 예들은 읽기 전용 메모리(read only memory: ROM)와, 랜덤-접속 메모리 (random access memory: RAM)와, 컴팩트 디스크- 리드 온니 메모리(compact disk-read only memory: CD-ROM)들 과, 마그네틱 테이프(magnetic tape)들과, 플로피 디스크(floppy disk)들과, 광 데이터 저장 디바이스들, 및 캐 리어 웨이브(carrier wave)들(인터넷을 통한 데이터 송신 등)을 포함할 수 있다. 컴퓨터 리드 가능 기록 매체는 또한 네트워크 연결된 컴퓨터 시스템들을 통해 분산될 수 있고, 따라서 컴퓨터 리드 가능 코드는 분산 방식으로 저장 및 실행된다. 또한, 본 발명의 다양한 실시예들을 성취하기 위한 기능적 프로그램들, 코드, 및 코드 세그 먼트(segment)들은 본 발명이 적용되는 분야에서 숙련된 프로그래머들에 의해 쉽게 해석될 수 있다. 또한 본 발명의 다양한 실시예들에 따른 장치 및 방법은 하드웨어, 소프트웨어 또는 하드웨어 및 소프트웨어의 조합의 형태로 실현 가능하다는 것을 알 수 있을 것이다. 이러한 소프트웨어는 예를 들어, 삭제 가능 또는 재기 록 가능 여부와 상관없이, ROM 등의 저장 장치와 같은 휘발성 또는 비휘발성 저장 장치, 또는 예를 들어, RAM, 메모리 칩, 장치 또는 집적 회로와 같은 메모리, 또는 예를 들어 콤팩트 디스크(compact disk: CD), DVD, 자기 디스크 또는 자기 테이프 등과 같은 광학 또는 자기적으로 기록 가능함과 동시에 기계(예를 들어, 컴퓨터)로 읽 을 수 있는 저장 매체에 저장될 수 있다. 본 발명의 다양한 실시예들에 따른 방법은 제어부(제어 모듈(111, 221)) 및 메모리를 포함하는 컴퓨터 또는 휴대 단말에 의해 구현될 수 있고, 이러한 메모리는 본 발명의 실시예 들을 구현하는 명령들을 포함하는 프로그램 또는 프로그램들을 저장하기에 적합한 기계로 읽을 수 있는 저장 매 체의 한 예임을 알 수 있을 것이다. 따라서, 본 발명은 본 명세서의 청구항에 기재된 장치 또는 방법을 구현하기 위한 코드를 포함하는 프로그램 및 이러한 프로그램을 저장하는 기계(컴퓨터 등)로 읽을 수 있는 저장 매체를 포함한다. 또한, 이러한 프로그램은 유선 또는 무선 연결을 통해 전달되는 통신 신호와 같은 임의의 매체를 통해 전자적으로 이송될 수 있고, 본 발 명은 이와 균등한 것을 적절하게 포함한다. 본 명세서와 도면에 개시된 본 발명의 실시 예들은 본 발명의 기술 내용을 쉽게 설명하고, 본 발명의 이해를 돕 기 위해 특정 예를 제시한 것일 뿐이며, 본 발명의 범위를 한정하고자 하는 것은 아니다. 또한 앞서 설명된 본 발명에 따른 실시예들은 예시적인 것에 불과하며, 당해 분야에서 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 범위의 실시예가 가능하다는 점을 이해할 것이다. 따라서, 본 발명의 진정한 기술적 보호 범위 는 다음의 특허청구범위에 의해서 정해져야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11 도면12 도면13 도면14 도면15 도면16"}
{"patent_id": "10-2022-0014004", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 발명의 특정한 바람직한 실시예들의 상기에서 설명한 바와 같은 또한 다른 측면들과, 특징들 및 이득들은 첨 부 도면들과 함께 처리되는 하기의 설명으로부터 보다 명백하게 될 것이다. 도 1은 본 발명의 단말이 정보를 출력하는 일 실시예를 나타내는 도면이다. 도 2는 본 발명의 일 실시예에 따른 시스템을 나타내는 도면이다. 도 3은 본 발명의 일 실시예에 따른 방법을 나타내는 흐름도이다. 도 4는 본 발명의 단말이 정보를 출력하는 다른 실시예를 나타내는 도면이다. 도 5 내지 도 16은 본 발명의 일 실시예에 따른 어플리케이션에서 제공되는 화면을 나타내는 도면이다."}
