{"patent_id": "unknown_patent", "section": "특허_기본정보", "subsection": "특허정보", "content": {"출원인": "LG 산전 주식회사    이종수", "발명자": "이민수"}}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "각 호기의 교통류를 검출하기 위한 복수의 호기 교통량 검출장치와, 단위시간 간격으로 방향별 승하치인수 데이터를 수집하기 위한 데이터 수집부와, 상기 수집된 데이터를 평활기법을 사용하여 변환시키기 위한 데이터 평활부와, 상기 데이터 평활부에서 변환된 데이터를 이용하여 미리 발생할 교통류를 예측하기 예측부를 포함하여 구성된 것을 특징으로 하는 엘리베이터의 군관리 장치."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "단위시간 간격으로 엘리베이터의 방향별 승하차인수 데이터를 수집하는 과정과, 상기 수집된 데이터를 '이동중앙값에 바탕을 둔 비모수적인 평활기법'을 사용하여 변환시키는 과정과, 평활된 데이터에 따라 단순지수평활법으로 엘리베이터의 교통류를 예측하는 과정으로 이루어진 것을 특징으로 하는 엘리베이터의 군관리 장치의 교통류 예측방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 '이동중앙값에 바탕을 둔 비모수적인 평활기법'은, 어떤시점 전후의 데이터를 고려해서 그 시점의 평활값을 얻어내기 위해 상기 데이터 수집부에서 수집된 승차인수 데이터 중 오른쪽 끝항값을 보정하는 과정과, '너비가 2,3,4,5, 중 어느 하나인 이동중앙값'으로 평활시키는 과정과, 연속2-1공개특허특1997-0067614된 세시점의 데이터를 가중평균하는 과정으로 이루어진 것을 특징으로 하는 엘리베이터의 군관리 장치의 교통류 예측방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 단순지수평활법에 의한 교통류 예측치(xt+1)는 다음식으로 나타냄을 특징으로 하는 엘리베이터의 군관리 장치의 교통류 예측방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "3항에 있어서, 상기 수집부에서 수집된 승차인수 데이터 중 오른쪽 끝항값은 t시각에서의 평활된 승차인원수(St)를 구하기 위한 다음식에 따라 보정되는 것을 특징으로 하는 엘리베이터의 군관리 장치의 교통류 예측방법.St=med{xt-1,xt,…,x*t+1}, x*t+1=3xt-1-2xt-2 단, med{x1,x2,…xn}+x1,x2,…,xn을 크기 순서로 늘어 놓았을 대 가운데 위치하는 값(=중앙값)"}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서, 상기 연속적 세시점의 데이터를 가중평균하는 과정은 다음식에 따라 이루어지는 것을 특징으로 하는 엘리베이터의 군관리 장치의 교통류 예측방법."}
{"patent_id": "unknown_patent", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 '너비가 2,3,4,5, 중 어느 하나인 이동중앙값'으로 평활시키는 과정은 평활결과의 변화가 없을때까지 무한히 반복되는 것을 특징으로 하는 엘리베이터의 군관리 장치의 교통류 예측방법.※ 참고사항 : 최초출원 내용에 의하여 공개하는 것임.도면 도면22-2공개특허특1997-0067614"}
{"patent_id": "unknown_patent", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 엘리베이터의 군관리 장치는, 각 호기의 교통류를 검출하기 위한 복수의 호기 교통량 검출장 치와, 단위시간 간격으로 방향별 승하차인수 데이터를 수집하기 위한 데이터 수집부와, 상기 수집된 데 이터를 평활기법을 사용하여 변환시키기 위한 데이터 평활부와, 상기 데이터 평활부에서 변환된 데이터 를 이용하여 미리 발생할 교통류를 예측하기 예측부로 구성되며, 상기 수집부를 통해 수집된 데이터를 그대로 사용하지 않고 당일의 몇분전 동안의 데이터만을 평활시켜 그 결과에 따라 교통류를 예측함으로 써 오차를 최소화할 수 있으며, 상기와 같이 평활시킨 데이터에 새로운 예측방법이나 인공지능의 방법을 적용할 수 있을뿐만 아니라, 학습에 필요한 기억장치가 필요하지 않기 때문에 메모기를 절약할 수 있는 효과가 있다."}
