{"patent_id": "10-2021-0086731", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0005694", "출원번호": "10-2021-0086731", "발명의 명칭": "서버 및 이의 영유아 안전 관리 방법", "출원인": "재단법인대구경북과학기술원", "발명자": "김현덕"}}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "서버의 영유아 안전 관리 방법에 있어서,영유아 관련 시설에 배치된 카메라를 통해 영유아를 촬영하여 획득된 영상을 수신하는 단계;상기 획득된 영상에 포함된 영유아의 얼굴 및 관절을 분석하는 단계;상기 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영유아의 감정 및 활동을 분석하는 단계;상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지하는 단계;상기 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를 생성하는단계;상기 생성된 안전 리포트를 사용자 단말로 제공하는 단계;를 포함하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 영유아의 얼굴 및 관절을 분석하는 단계는,상기 영상에 포함된 영유아의 얼굴 영역을 검출하는 단계;상기 검출된 얼굴 영역으로부터 특징 정보를 추출하는 단계; 및상기 추출된 특징 정보와 기 저장된 정보를 바탕으로 상기 영유아의 신원을 확인하는 단계;를 포함하는 영유아안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 영유아의 감정 및 활동을 분석하는 단계는,상기 획득된 얼굴 영역을 학습된 인공지능 모델에 입력하여 상기 영유아의 감정에 대한 정보를 획득하며,상기 영유아의 감정에 대한 정보는,보통, 기쁨, 슬픔, 분노, 지루함, 놀람 각각에 대한 값을 포함하는 벡터로 나타내며,상기 벡터의 크기은 1로 정규화되는 것을 특징으로 하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 영유아의 얼굴 및 관절을 분석하는 단계는,상기 영상에 포함된 영유아의 몸 영역을 검출하는 단계;상기 검출된 몸 영역에서 사람의 관절의 위치를 추정하는 단계; 및상기 추정된 관절의 움직임을 획득하는 단계;를 포함하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 영유아의 감정 및 활동을 분석하는 단계는,공개특허 10-2023-0005694-3-상기 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영유아가 다른 영유아와 함께 놀이한 놀이 활동에 대한 정보를 획득하며,상기 놀이 활동에 대한 정보는,상기 다른 영유아에 대한 정보, 상기 놀이 활동의 시간 및 상기 영유아의 놀이 만족도에 대한 정보 중 적어도하나를 포함하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 놀이 만족도에 대한 정보는,상기 영유아의 감정상태, 상기 다른 영유아의 수, 놀이 시간을 바탕으로 결정되는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제5항에 있어서,상기 영유아의 감정 및 활동을 분석하는 단계는,상기 분석된 영유아의 얼굴에 기초하여 상기 영유아의 얼굴 감정을 분석하는 단계; 및상기 영유아의 얼굴 감정 및 수업 시간에 기초하여 영유아의 수업 집중도에 대한 정보를 획득하는 단계;를 포함하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 안전 리포트를 생성하는 단계는,상기 영유아의 교우 관계에 대한 정보, 상기 영유아의 놀이 만족도에 대한 정보 및 상기 영유아의 수업 집중도에 대한 정보를 바탕으로 활동 점수를 산출하고,상기 산출된 활동 점수가 포함된 안전 리포트를 생성하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 이상 징후를 감지하는 단계는,상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 아동 학대가 발생하는지 여부 및 영유아 간의 싸움이 발생하였는지 여부를 판단하는 단계; 및아동 학대가 발생된 것으로 판단되거나 영유아 간의 싸움이 발생한 것으로 판단되면, 이상 징후가 발생한 것으로 감지하는 단계;를 포함하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 안전 리포트는,상기 획득된 영상에서 상기 영유아를 제외한 다른 영유아를 모자이크하거나 마스킹 처리하여 획득된 영상을 포함하는 영유아 안전 관리 방법."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "영유아 안전 관리를 위한 서버에 있어서,통신부;공개특허 10-2023-0005694-4-저장부; 및상기 통신부를 통해 영유아 관련 시설에 배치된 카메라를 통해 영유아를 촬영하여 획득된 영상을 수신하고,상기 획득된 영상에 포함된 영유아의 얼굴 및 관절을 분석하고,상기 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영유아의 감정 및 활동을 분석하며,상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지하고,상기 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를생성하고,상기 생성된 안전 리포트를 사용자 단말로 제공하도록 상기 통신부를 제어하는 제어부;를 포함하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제어부는,상기 영상에 포함된 영유아의 얼굴 영역을 검출하고,상기 검출된 얼굴 영역으로부터 특징 정보를 추출하며,상기 추출된 특징 정보와 기 저장된 정보를 바탕으로 상기 영유아의 신원을 확인하는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 제어부는,상기 획득된 얼굴 영역을 학습된 인공지능 모델에 입력하여 상기 영유아의 감정에 대한 정보를 획득하며,상기 영유아의 감정에 대한 정보는,보통, 기쁨, 슬픔, 분노, 지루함, 놀람 각각에 대한 값을 포함하는 벡터로 나타내며,상기 벡터의 크기은 1로 정규화되는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 제어부는,상기 영상에 포함된 영유아의 몸 영역을 검출하고,상기 검출된 몸 영역에서 사람의 관절의 위치를 추정하며,상기 추정된 관절의 움직임을 획득하는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서,상기 제어부는,상기 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영유아가 다른 영유아와 함께 놀이한 놀이 활동에 대한 정보를 획득하며,상기 놀이 활동에 대한 정보는,상기 다른 영유아에 대한 정보, 상기 놀이 활동의 시간 및 상기 영유아의 놀이 만족도에 대한 정보 중 적어도하나를 포함하는 서버.공개특허 10-2023-0005694-5-청구항 16 제15항에 있어서,상기 놀이 만족도에 대한 정보는,상기 영유아의 감정상태, 상기 다른 영유아의 수, 놀이 시간을 바탕으로 결정되는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서,상기 제어부는,상기 분석된 영유아의 얼굴에 기초하여 상기 영유아의 얼굴 감정을 분석하고,상기 영유아의 얼굴 감정 및 수업 시간에 기초하여 영유아의 수업 집중도에 대한 정보를 획득하는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 제어부는,상기 영유아의 교우 관계에 대한 정보, 상기 영유아의 놀이 만족도에 대한 정보 및 상기 영유아의 수업 집중도에 대한 정보를 바탕으로 활동 점수를 산출하고,상기 산출된 활동 점수가 포함된 안전 리포트를 생성하는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제11항에 있어서,상기 제어부는,상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 아동 학대가 발생하는지 여부 및 영유아 간의 싸움이 발생하였는지 여부를 판단하고,아동 학대가 발생된 것으로 판단되거나 영유아 간의 싸움이 발생한 것으로 판단되면, 이상 징후가 발생한 것으로 감지하는 것을 특징으로 하는 서버."}
{"patent_id": "10-2021-0086731", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 안전 리포트는,상기 획득된 영상에서 상기 영유아를 제외한 다른 영유아를 모자이크하거나 마스킹 처리하여 획득된 영상을 포함하는 서버."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "서버 및 이의 영유아 안전 관리 방법을 제공한다. 본 서버의 영유아 안전 관리 방법은 영유아 관련 시설에 배치 된 카메라를 통해 영유아를 촬영하여 획득된 영상을 수신하는 단계, 획득된 영상에 포함된 영유아의 얼굴 및 관 절을 분석하는 단계, 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 영유아의 감정 및 활동을 분석하는 단계, 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지하는 단계, 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를 생성하는 단계 및 생성된 안전 리포트 를 사용자 단말로 제공하는 단계를 포함한다."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 서버 및 이의 영유아 안전 관리 방법에 관한 것으로, 더욱 상세하게는 영유아 관련 시설에 배치된 카 메라를 통해 영유아를 촬영하여 영상을 획득하고 획득된 영상에 기초하여 영유아의 안전을 관리하기 위한 서버 및 이의 영유아 안전 관리 방법에 관한 것이다."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "근래에는 영유아가 다니는 영유아 관련 시설(예를 들어, 어린이집, 유치원, 놀이학교, 학원 등)에서 영유아들의 원내 생활을 알림장 어플리케이션 등을 통해 교사가 직접 수기로 입력하거나, 사진을 업로드하여 학부모에게 자 녀의 영유아 관련 시설 내에서 활동 내역을 확인하고 있는 것이 현실이다. 이 경우, 영유아 관련 시설에 종사하고 있는 교사들은 영유아의 보육 및 교육 업무 외에도 활동 내역을 사진으 로 촬영하고 영유아들의 하원 뒤, 잔여 근무 형태로 영유아들의 활동 내역을 관련 어플리케이션에 수기 작성 및 업로드하는 등 잡무가 증가하여 교사들의 본연의 임무인 보육 및 교육의 업무의 효율이 떨어지는 문제점이 있다. 또한, 교사들의 주관적인 관점에서 작성 및 업로드 되다 보니, 부모 입장에서는 실제 자녀들이 영유아 관련 시 설에서 잘 지내는 상황만 편중되어 정보를 전달받고 있는 상황이다. 최근에는 실제 일부 영유아 관련 시설에서 영유아 학대 관련 사건들이 보도가 되고 있다. 이를 위해 영유아 관련 시설에 CCTV 설치가 의무화되어 부모가 자녀의 학대를 의심할 경우 CCTV 열람을 요청하 여 확인이 가능하나 현재는 제3자 정보보호를 위해 당사자 이외의 타인 얼굴에 모자이크 및 마스킹 작업을 위해 막대한 비용을 지불해야 하는 문제가 발생하며, 부모가 학대 상황을 늦게 인지한 경우, CCTV 녹화 분이 남아 있 지 않은 경우 확인이 불가능한 문제도 발생하고 있다."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 상술한 문제점을 해결하기 위해 안출된 것으로, 본 개시의 목적은 영유아 관련 시설에 위치한 카메라 를 통해 촬영된 영상을 통해 영유아의 감정 및 활동에 대한 정보, 이상 징후를 분석하여 안전 리포트를 생성하 고, 생성된 안전 리포트를 사용자 단말로 제공하는 서버 및 이의 영유아 안전 관리 방법을 제공함에 있다."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따른, 서버의 영유아 안전 관리 방법은, 영유아 관련 시설에 배치된 카메라를 통해 영유 아를 촬영하여 획득된 영상을 수신하는 단계; 기 획득된 영상에 포함된 영유아의 얼굴 및 관절을 분석하는 단계; 상기 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영유아의 감정 및 활동을 분석하는 단 계; 상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지하는 단계; 상기 분석된 영유 아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를 생성하는 단계; 및 상기 생성된 안전 리포트를 사용자 단말로 제공하는 단계;를 포함한다. 그리고, 상기 영유아의 얼굴 및 관절을 분석하는 단계는, 상기 영상에 포함된 영유아의 얼굴 영역을 검출하는 단계; 상기 검출된 얼굴 영역으로부터 특징 정보를 추출하는 단계; 및 상기 추출된 특징 정보와 기 저장된 정보 를 바탕으로 상기 영유아의 신원을 확인하는 단계;를 포함할 수 있다. 또한, 상기 영유아의 감정 및 활동을 분석하는 단계는, 상기 획득된 얼굴 영역을 학습된 인공지능 모델에 입력 하여 상기 영유아의 감정에 대한 정보를 획득하며, 상기 영유아의 감정에 대한 정보는, 보통, 기쁨, 슬픔, 분노, 지루함, 놀람 각각에 대한 값을 포함하는 벡터로 나타내며, 상기 벡터의 크기은 1로 정규화될 수 있다. 그리고, 상기 영유아의 얼굴 및 관절을 분석하는 단계는, 상기 영상에 포함된 영유아의 몸 영역을 검출하는 단 계; 상기 검출된 몸 영역에서 사람의 관절의 위치를 추정하는 단계; 및 상기 추정된 관절의 움직임을 획득하는 단계;를 포함할 수 있다. 또한, 상기 영유아의 감정 및 활동을 분석하는 단계는, 상기 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상 기 영유아가 다른 영유아와 함께 놀이한 놀이 활동에 대한 정보를 획득하며, 상기 놀이 활동에 대한 정보는, 상 기 다른 영유아에 대한 정보, 상기 놀이 활동의 시간 및 상기 영유아의 놀이 만족도에 대한 정보 중 적어도 하 나를 포함할 수 있다. 그리고, 상기 놀이 만족도에 대한 정보는, 상기 영유아의 감정상태, 상기 다른 영유아의 수, 놀이 시간을 바탕 으로 결정될 수 있다. 또한, 상기 영유아의 감정 및 활동을 분석하는 단계는, 상기 분석된 영유아의 얼굴에 기초하여 상기 영유아의 얼굴 감정을 분석하는 단계; 및 상기 영유아의 얼굴 감정 및 수업 시간에 기초하여 영유아의 수업 집중도에 대 한 정보를 획득하는 단계;를 포함할 수 있다.그리고, 상기 안전 리포트를 생성하는 단계는, 상기 영유아의 교우 관계에 대한 정보, 상기 영유아의 놀이 만족 도에 대한 정보 및 상기 영유아의 수업 집중도에 대한 정보를 바탕으로 활동 점수를 산출하고, 상기 산출된 활 동 점수가 포함된 안전 리포트를 생성할 수 있다. 또한, 상기 이상 징후를 감지하는 단계는, 상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 아동 학 대가 발생하는지 여부 및 영유아 간의 싸움이 발생하였는지 여부를 판단하는 단계; 및 아동 학대가 발생된 것으 로 판단되거나 영유아 간의 싸움이 발생한 것으로 판단되면, 이상 징후가 발생한 것으로 감지하는 단계;를 포함 할 수 있다. 그리고, 상기 안전 리포트는, 상기 획득된 영상에서 상기 영유아를 제외한 다른 영유아는 모자이크하거나 마스 킹 처리하여 획득된 영상을 포함할 수 있다. 한편, 본 개시의 일 실시예에 따른, 영유아 안전 관리를 위한 서버는, 통신부; 저장부; 및 상기 통신부를 통해 영유아 관련 시설에 배치된 카메라를 통해 영유아를 촬영하여 획득된 영상을 수신하고, 상기 획득된 영상에 포 함된 영유아의 얼굴 및 관절을 분석하고, 상기 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영 유아의 감정 및 활동을 분석하며, 상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감 지하고, 상기 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를 생성하고, 상기 생성된 안전 리포트를 사용자 단말로 제공하도록 상기 통신부를 제어하는 제어부;를 포함한다. 그리고, 상기 제어부는, 상기 영상에 포함된 영유아의 얼굴 영역을 검출하고, 상기 검출된 얼굴 영역으로부터 특징 정보를 추출하며, 상기 추출된 특징 정보와 기 저장된 정보를 바탕으로 상기 영유아의 신원을 확인할 수 있다. 또한, 상기 제어부는, 상기 획득된 얼굴 영역을 학습된 인공지능 모델에 입력하여 상기 영유아의 감정에 대한 정보를 획득하며, 상기 영유아의 감정에 대한 정보는, 보통, 기쁨, 슬픔, 분노, 지루함, 놀람 각각에 대한 값을 포함하는 벡터로 나타내며, 상기 벡터의 크기은 1로 정규화될 수 있다. 그리고, 상기 제어부는, 상기 영상에 포함된 영유아의 몸 영역을 검출하고, 상기 검출된 몸 영역에서 사람의 관 절의 위치를 추정하며, 상기 추정된 관절의 움직임을 획득할 수 있다. 또한, 상기 제어부는, 상기 영유아의 얼굴 및 관절에 대한 정보에 기초하여 상기 영유아가 다른 영유아와 함께 놀이한 놀이 활동에 대한 정보를 획득하며, 상기 놀이 활동에 대한 정보는, 상기 다른 영유아에 대한 정보, 상 기 놀이 활동의 시간 및 상기 영유아의 놀이 만족도에 대한 정보 중 적어도 하나를 포함할 수 있다. 그리고, 상기 놀이 만족도에 대한 정보는, 상기 영유아의 감정상태, 상기 다른 영유아의 수, 놀이 시간을 바탕 으로 결정될 수 있다. 또한, 상기 제어부는, 상기 분석된 영유아의 얼굴에 기초하여 상기 영유아의 얼굴 감정을 분석하고, 상기 영유 아의 얼굴 감정 및 수업 시간에 기초하여 영유아의 수업 집중도에 대한 정보를 획득할 수 있다. 그리고, 상기 제어부는, 상기 영유아의 교우 관계에 대한 정보, 상기 영유아의 놀이 만족도에 대한 정보 및 상 기 영유아의 수업 집중도에 대한 정보를 바탕으로 활동 점수를 산출하고, 상기 산출된 활동 점수가 포함된 안전 리포트를 생성할 수 있다. 또한, 상기 제어부는, 상기 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 아동 학대가 발생하는지 여 부 및 영유아 간의 싸움이 발생하였는지 여부를 판단하고, 아동 학대가 발생된 것으로 판단되거나 영유아 간의 싸움이 발생한 것으로 판단되면, 이상 징후가 발생한 것으로 감지할 수 있다. 그리고, 상기 안전 리포트는, 상기 획득된 영상에서 상기 영유아를 제외한 다른 영유아는 모자이크하거나 마스 킹 처리하여 획득된 영상을 포함할 수 있다."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상술한 바와 같은 본 개시의 다양한 실시예에 의해, 영유아 관련 시설 내에서 일어나는 상황을 카메라를 활용하 여 영유아의 활동 내역 및 이상 징후를 자동으로 감지하여 원내 관리자(원자 또는 교사) 및 부모에게 정보를 제 공함으로서 교사의 업무 효율성의 증가하고, 부모에게 자녀의 영유아 관련 시설 내에서의 생활 패턴 및 활동에 관한 다양한 정보를 제공할 수 있게 된다. 뿐만 아니라, 영유아 관련 시설 내에서 발생하는 다양한 사건/사고를 자동으로 분석하고 모자이크 및 마스킹 된 영상을 제공함으로서 부모가 빠른 시간 내에 해당 문제를 인지하고 해결할 수 있으며, 나아가 자녀의 안전한 원 내 활동이 이루어지도록 도와 줄 수 있다."}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 실시 예들은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도면에 예 시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나 이는 특정한 실시 형태에 대해 범위를 한정하려는 것 이 아니며, 본 개시의 실시 예의 다양한 변경(modifications), 균등물(equivalents), 및/또는 대체물 (alternatives)을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유 사한 참조 부호가 사용될 수 있다. 본 개시를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 덧붙여, 하기 실시 예는 여러 가지 다른 형태로 변형될 수 있으며, 본 개시의 기술적 사상의 범위가 하기 실시 예에 한정되는 것은 아니다. 오히려, 이들 실시 예는 본 개시를 더욱 충실하고 완전하게 하고, 당업자에게 본 개시의 기술적 사상을 완전하게 전달하기 위하여 제공되는 것이다. 본 개시에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 권리범위를 한정하려는 의도 가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 개시에서, \"가진다,\" \"가질 수 있다,\" \"포함한다,\" 또는 \"포함할 수 있다\" 등의 표현은 해당 특징(예: 수치, 기능, 동작, 또는 부품 등의 구성요소)의 존재를 가리키며, 추가적인 특징의 존재를 배제하지 않는다. 본 개시에서, \"A 또는 B,\" \"A 또는/및 B 중 적어도 하나,\" 또는 \"A 또는/및 B 중 하나 또는 그 이상\"등의 표현 은 함께 나열된 항목들의 모든 가능한 조합을 포함할 수 있다. 예를 들면, \"A 또는 B,\" \"A 및 B 중 적어도 하나,\" 또는 \"A 또는 B 중 적어도 하나\"는, 적어도 하나의 A를 포함, 적어도 하나의 B를 포함, 또는 적어도 하나의 A 및 적어도 하나의 B 모두를 포함하는 경우를 모두 지칭할 수 있다. 본 개시에서 사용된 \"제1,\" \"제2,\" \"첫째,\" 또는 \"둘째,\"등의 표현들은 다양한 구성요소들을, 순서 및/또는 중 요도에 상관없이 수식할 수 있고, 한 구성요소를 다른 구성요소와 구분하기 위해 사용될 뿐 해당 구성요소들을 한정하지 않는다. 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"(기능적으로 또는 통신적으로) 연결되 어((operatively or communicatively) coupled with/to)\" 있다거나 \"접속되어(connected to)\" 있다고 언급된 때에는, 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로 연결되거나, 다른 구성요소(예: 제3 구성요 소)를 통하여 연결될 수 있다고 이해되어야 할 것이다. 반면에, 어떤 구성요소(예: 제1 구성요소)가 다른 구성요소(예: 제2 구성요소)에 \"직접 연결되어\" 있다거나 \"직 접 접속되어\" 있다고 언급된 때에는, 상기 어떤 구성요소와 상기 다른 구성요소 사이에 다른 구성요소(예: 제3 구성요소)가 존재하지 않는 것으로 이해될 수 있다. 본 개시에서 사용된 표현 \"~하도록 구성된(또는 설정된)(configured to)\"은 상황에 따라, 예를 들면, \"~에 적합 한(suitable for),\" \"~하는 능력을 가지는(having the capacity to),\" \"~하도록 설계된(designed to),\" \"~하도 록 변경된(adapted to),\" \"~하도록 만들어진(made to),\" 또는 \"~를 할 수 있는(capable of)\"과 바꾸어 사용될 수 있다. 용어 \"~하도록 구성된(또는 설정된)\"은 하드웨어적으로 \"특별히 설계된(specifically designed to)\"것만을 반드시 의미하지 않을 수 있다. 대신, 어떤 상황에서는, \"~하도록 구성된 장치\"라는 표현은, 그 장치가 다른 장치 또는 부품들과 함께 \"~할 수 있는\" 것을 의미할 수 있다. 예를 들면, 문구 \"A, B, 및 C를 수행하도록 구성된(또는 설정된) 프로세서\"는 해당 동작을 수행하기 위한 전용 프로세서(예: 임베디드 프로세서), 또는 메모리 장치에 저장된 하나 이상의 소프트 웨어 프로그램들을 실행함으로써, 해당 동작들을 수행할 수 있는 범용 프로세서(generic-purpose processor)(예: CPU 또는 application processor)를 의미할 수 있다. 실시 예에 있어서 '모듈' 혹은 '부'는 적어도 하나의 기능이나 동작을 수행하며, 하드웨어 또는 소프트웨어로 구현되거나 하드웨어와 소프트웨어의 결합으로 구현될 수 있다. 또한, 복수의 '모듈' 혹은 복수의 '부'는 특정 한 하드웨어로 구현될 필요가 있는 '모듈' 혹은 '부'를 제외하고는 적어도 하나의 모듈로 일체화되어 적어도 하 나의 서버로 구현될 수 있다. 실시예에서 서버가 특정 동작을 지원하는 것의 의미는 서버가 외부 장치를 통해 동작을 수행하도록 외부 장치에 제어 명령 또는 관련 정보를 전송하는 것을 의미할 수 있다. 한편, 도면에서의 다양한 요소와 영역은 개략적으로 그려진 것이다. 따라서, 본 발명의 기술적 사상은 첨부한 도면에 그려진 상대적인 크기나 간격에 의해 제한되지 않는다. 이하에서는 도면을 참조하여 본 개시에 대해 더욱 상세히 설명하기로 한다. 도 1은 본 개시의 일 실시예에 따른, 영유아 관리 시스템의 도면을 도시한 도면이다. 도 1에 도시된 바와 같이, 복수의 카메라(10-1,10- 2,...), 영유아 관련 시설의 관리자가 소지하는 사용자 단말, 학부모가 소지하는 사용자 단말 및 서버 를 포함할 수 있다. 이때, 사용자 단말(20,30)은 도 1에 도시된 바와 같이, 스마트 폰과 같은 전자 장치로 구현될 수 있으나, 이는 일 실시예에 불과할 뿐, 태블릿 PC, 데스크탑 PC 등과 같은 다양한 PC로 구현될 수 있 다. 이때, 복수의 카메라(10-1,10-2,...)는 영유아 관련 시설 내의 복수의 영역에 설치될 수 있다. 예를 들어, 복수 의 카메라(10-1,10-2,...)는 교실, 놀이실, 운동장, 상담실 등과 같은 영유아 관련 시선 내의 복수의 영역 내에 설치될 수 있다. 복수의 카메라(10-1,10-2,..)는 복수의 영역에 위치하는 영유아 및 교사를 촬영하여 영상을 획 득하고, 획득된 영상을 서버로 전송할 수 있다. 서버는 영유아 관련 시설 내에 배치된 복수의 카메라(10-1,10-2,...)를 통해 영유아를 촬영하여 획득된 영 상을 수신하고, 획득된 영상에 포함된 영유아의 얼굴 및 관절을 분석할 수 있다. 그리고, 서버는 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 영유아의 감정 및 활동을 분석할 수 있다. 그리고, 서버는 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지하고, 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를 생성할 수 있다. 그리고, 서버는 생성된 안전 리포트를 사용자 단말(20,30)로 제공할 수 있다. 영유아 관련 시설의 관리자(예를 들어, 원장 또는 교사)가 소지하는 사용자 단말은 안전 리포트를 바탕으로 시설 내의 영유아 활동을 모니터링 할 수 있으며, 원내 이상 상황에 대한 알람을 제공할 수 있다. 학부모가 소지하는 사용자 단말은 안전 리포트를 바탕으로 시설 내의 자녀 활동을 모니터링할 수 있고 자녀 의 이상 상황에 대한 알람을 제공할 수 있다. 이때, 사용자 단말(20,30)은 영유아의 감정/활동 정보 및 이상 상황에 대한 정보가 포함된 안전 리포트를 어플 리케이션 기반으로 제공할 수 있다. 도 2는 본 개시의 일 실시예에 따른, 영유아 관리를 위한 서버를 도시한 도면이다. 도 2에 도시된 서버는 서버는 통신부, 저장부 및 제어부를 포함할 수 있다. 그러나, 이는 일 실시예에 불과할 뿐, 서버는 통신부, 저장부 및 제어부 이외에 디스플레이 등과 같은 다른 구성을 더 포함 할 수 있음은 물론이다. 통신부는 회로를 포함하며, 외부 장치와의 통신을 수행할 수 있다. 구체적으로, 제어부는 통신부 를 통해 연결된 외부 장치로부터 각종 데이터 또는 정보를 수신할 수 있으며, 외부 장치로 각종 데이터 또 는 정보를 전송할 수도 있다.통신부는 WiFi 모듈 또는 무선 통신 모듈 중 적어도 하나를 포함할 수 있다. 구체적으로, WiFi 모듈은 WiFi 방식으로 통신을 수행할 수 있다. WiFi 모듈을 이용하는 경우에는 SSID 등과 같은 각종 연결 정보를 먼저 송수신하여, 이를 이용하여 통신 연결한 후 각종 정보들을 송수신할 수 있다. 또한, 무선 통신 모듈은 IEEE, Zigbee, 3G(3rd Generation), 3GPP(3rd Generation Partnership Project), LTE(Long Term Evolution), 5G(5th Generation) 등과 같은 다양한 통신 규격에 따라 통신을 수행할 수 있다. 특히, 통신부는 영유아 관련 시설에 배치된 카메라 또는 사용자 단말(20,30)과 통신을 수행할 수 있다. 구체적으로, 통신부는 영유아 관련 시설에 배치된 카메라를 통해 영유아가 포함된 영상을 수신 할 수 있다. 또한, 통신부는 사용자 단말(20,30)로 영유아의 감정 정보, 영유아의 활동 정보 및 이상 상황 에 대한 정보를 포함하는 안전 리포트를 전송할 수 있다. 저장부는 서버의 전반적인 동작을 제어하기 위한 다양한 인스트럭션을 저장할 수 있다. 특히, 저장부 는 영유아 관련 시설 내에 배치된 카메라를 통해 획득된 영상을 이용하여 영유아의 안전을 관리하기 위한 동작을 수행하기 위해 필요한 데이터를 저장할 수 있다. 한편, 저장부는 전력 공급이 중단되더라도 저장된 정보를 유지할 수 있는 비휘발성 메모리 및 저장된 정보 를 유지하기 위해서는 지속적인 전력 공급이 필요한 휘발성 메모리를 포함할 수 있다. 영유아 관련 시설 내에 배치된 카메라를 통해 획득된 영상을 이용하여 영유아의 안전을 관리하기 위한 동작을 수행하기 위한 데이 터는 비휘발성 메모리에 저장될 수 있다. 제어부는 비휘발성 메모리에 저장되어 있는 영유아 관련 시설 내에 배치된 카메라를 통해 획득된 영상 을 이용하여 영유아의 안전을 관리하기 위한 동작을 수행하기 위한 데이터를 휘발성 메모리로 로딩(loading)할 수 있다. 제어부는 휘발성 메모리로 로딩된 데이터에 기초하여 각종 동작을 수행할 수 있다. 여기서, 로딩 이란 제어부가 엑세스할 수 있도록 비휘발성 메모리에 저장된 데이터를 휘발성 메모리에 불러들여 저장하 는 동작을 의미한다. 특히, 제어부는 통신부를 통해 영유아 관련 시설에 배치된 카메라를 통해 영유아를 촬영하여 획득된 영상을 수신하고, 획득된 영상에 포함된 영유아의 얼굴 및 관절을 분석하고, 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 영유아의 감정 및 활동을 분석하며, 분석된 영유아의 감정 및 활동에 대한 정보에 기초하 여 이상 징후를 감지하고, 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안 전 리포트를 생성하고, 생성된 안전 리포트를 사용자 단말(20,30)로 제공하도록 통신부를 제어할 수 있다. 구체적으로, 제어부는 카메라를 통해 획득된 영상에 포함된 영유아의 얼굴 영역을 검출하고, 검출된 얼굴 영역으로부터 특징 정보를 추출하며, 추출된 특징 정보와 저장부에 기 저장된 정보를 바탕으로 영유 아의 신원을 확인할 수 있다. 그리고, 제어부는 획득된 얼굴 영역을 학습된 인공지능 모델에 입력하여 영유아의 감정에 대한 정보를 획 득할 수 있다. 이때, 획득되는 영유아의 감정에 대한 정보는, 보통, 기쁨, 슬픔, 분노, 지루함, 놀람 각각에 대 한 값을 포함하는 벡터로 나타낼 수 있으며, 벡터의 크기는 1로 정규화될 수 있다. 또한, 제어부는 영상에 포함된 영유아의 몸 영역을 검출하고, 검출된 몸 영역에서 사람의 관절의 위치를 추정하며, 추정된 관절의 움직임을 획득할 수 있다. 이에 의해, 제어부는 영유아의 움직임을 추정할 수 있 다. 그리고, 제어부는 영유아의 얼굴 및 관절에 대한 정보에 기초하여 영유아의 다양한 활동 정보를 획득할 수 있다. 구체적으로, 제어부는 영유아의 얼굴 및 관절에 대한 정보에 기초하여 영유아가 다른 영유아와 함께 놀이한 놀이 활동에 대한 정보를 획득할 수 있다. 이때, 놀이 활동에 대한 정보는 다른 영유아에 대한 정보, 놀 이 활동의 시간 및 영유아의 놀이 만족도에 대한 정보 중 적어도 하나를 포함할 수 있다. 또한, 놀이 만족도에 대한 정보는 영유아의 감정상태, 다른 영유아의 수, 놀이 시간을 바탕으로 결정될 수 있다. 그리고, 제어부는 영유아의 얼굴 및 관절 정보에 기초하여 수업 집중도에 대한 정보를 획득할 수 있다. 구 체적으로, 제어부는 분석된 영유아의 얼굴 및 관절에 기초하여 영유아의 얼굴 감정과 영유아의 태도를 분 석하고, 영유아의 얼굴 감정, 영유야의 태도 및 수업 시간에 기초하여 영유아의 수업 집중도에 대한 정보를 획 득할 수 있다. 또한, 제어부는 영유아의 교우 관계에 대한 정보, 영유아의 놀이 만족도에 대한 정보 및 영유아의 수업 집 중도에 대한 정보를 바탕으로 활동 점수를 산출할 수 있다. 또한, 제어부는 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 아동 학대가 발생하는지 여부 및 영유아 간의 싸움이 발생하였는지 여부를 판단하고, 아동 학대가 발생된 것으로 판단되거나 영유아 간의 싸움이 발생한 것으로 판단되면, 이상 징후가 발생한 것으 로 감지할 수 있다. 그리고, 제어부는 산출된 활동 점수에 대한 정보, 이상 징후에 대한 정보가 포함된 안전 리포트를 생성할 수 있다. 이때, 안전 리포트에는 획득된 영상에서 영유아를 제외한 다른 영유아는 모자이크하거나 마스킹 처리 된 영상을 포함할 수 있다. 이하에서는 도 3 내지 도 5를 참조하여 영유아 관리 시스템의 구성이 수행하는 영유아 관리를 위한 동작을 설명 하기로 한다. 우선, 복수의 카메라(10-1,10-2,...)는 영유아 관련 시설 내에 위치한 복수의 영역을 실시간으로 촬영할 수 있 다. 그리고, 복수의 카메라(10-1,10-2,..)는 복수의 영역을 촬영하여 획득한 영상 정보를 서버로 전송할 수 있다. 이때, 영상 정보에는 오브젝트로 적어도 하나의 영유아와 교사가 포함될 수 있다. 서버는 획득된 영상 정보를 바탕으로 영상에 포함된 영유아의 얼굴 및 몸 영역을 검출할 수 있다. 서버는 검출된 영유아의 얼굴 및 몸 영역을 바탕으로 영상을 분석할 수 있다. 특히, 서버는 영 유아의 얼굴을 분석하여 얼굴을 인식할 수 있다. 구체적으로, 서버는 영상에 포함된 영유아의 얼굴 영역을 검출하고, 검출된 얼굴 영역으로부터 특징 정보(예를 들어, 눈, 코, 입 등)를 추출할 수 있다. 그리고, 서버는 추출된 특징 정보와 저장부에 기 저장된 영유아의 특징 정보를 비교하여 영유아의 신원을 확 인할 수 있다. 그리고, 서버는 카메라를 통해 획득된 영상 속에서 신원이 확인된 영유아를 추적하여 모니터링할 수 있다. 또한 서버는 영유아의 몸 영역을 분석하여 관절 영역을 추정하여 관절 정보를 인식할 수 있다. 서버는 획득된 얼굴 및 관절 정보에 기초하여 영유아의 감정 및 행동을 분석할 수 있다. 특히, 서버는 획득된 얼굴 정보에 기초하여 영유아의 감정을 인식할 수 있다. 구체적으로, 서버는 획 득된 영상 중 영유아의 얼굴 영역을 학습된 인공지능 모델에 입력하여 영유아의 감정에 대한 정보를 획득할 수 있다. 이때, 학습된 인공지능 모델은, 복수의 신경망 레이어들로 구성될 수 있다. 각 레이어는 복수의 가중치 (weight values)을 갖고 있으며, 이전(previous) 레이어의 연산 결과와 복수의 가중치의 연산을 통해 레이어의 연산을 수행한다. 신경망의 예로는, CNN (Convolutional Neural Network), DNN (Deep Neural Network), RNN (Recurrent Neural Network), RBM (Restricted Boltzmann Machine), DBN (Deep Belief Network), BRDNN(Bidirectional Recurrent Deep Neural Network), GAN(Generative Adversarial Networks) 및 심층 Q-네 트워크 (Deep Q-Networks)이 있으며, 본 개시에서의 신경망은 명시한 경우를 제외하고 전술한 예에 한정되지 않 는다. 학습 알고리즘은, 다수의 학습 데이터들을 이용하여 소정의 대상 기기(예컨대, 서버)을 훈련시켜 소정의 대상 기기 스스로 결정을 내리거나 예측을 할 수 있도록 하는 방법이다. 학습 알고리즘의 예로는, 지도형 학습 (supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또 는 강화 학습(reinforcement learning)이 있으며, 본 개시에서의 학습 알고리즘은 명시한 경우를 제외하고 전술 한 예에 한정되지 않는다. 한편, 영유아의 감정에 대한 정보는 보통, 기쁨, 슬픔, 분노, 지루함, 놀람 각각에 대한 값을 포함하는 벡터로 나타낼 수 있다. 예를 들어, t 시간에 감정에 대한 정보는 [보통t, 기쁨t, 슬픔t, 분노t, 지루함t, 놀람t]의 벡터 형태로 표현될 수 있다. 이때, 벡터의 크기은 1로 정규화될 수 있다. 예를 들어, 영유아 A의 감정에 대한 정보 는 [0.15, 0.80, 0.01, 0.01, 0.02, 0.01]로 표현될 수 있다. 또한, 서버는 획득된 얼굴 및 관절 정보를 바탕으로 영유아 활동을 분석할 수 있다. 특히, 서버는 교우 관계에 대한 정보를 획득할 수 있다. 구체적으로, 서버는 영유아와 함께 놀이에 참여한 다른 영유아의 이름 및 접촉 시간을 분석하여 교우 관계에 대한 정보를 획득할 수 있다. 또한, 서버는 영유아의 감정 및 함께 놀이를 수행한 영유아의 수를 분석하여 놀이 만족도를 측정할 수 있 다. 예를 들어, 서버는 아래의 수학식 1을 바탕으로 놀이 만족도를 측정할 수 있다.수학식 1"}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "이때, N은 놀이 시간일 수 있다. 또한, 서버는 영유아의 수업시간에 영유아의 감정을 분석하여 수업에 집중하고 있는지 여부를 측정할 수 있다. 예를 들어, 서버는 아래의 수학식 2를 바탕으로 수업 집중도를 측정할 수 있다. 수학식 2"}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이때, N은 총 수업 시간일 수 있다. 또한, 서버는 영유아가 영유아 관련 시설에서 먹는 시간 및 식사량을 분석하여 식사 활동에 대한 정보를 획득할 수 있다. 또한, 서버는 상술한 바와 같은 교우 관계에 대한 점수, 놀이 만족도에 대한 점수, 수업 집중도에 대한 점 수 등을 바탕으로 영유아의 활동 분석 점수를 산출할 수 있다. 예를 들어, 서버는 아래의 수학식 3을 바탕 으로 영유아 개인의 활동 점수를 산출할 수 있다. 수학식 3"}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이때,n은 각 반별 영유아의 수일 수 있다. 또한, 는 가중치 변수로 0에서 1의 값을 가지며, 각 학년별 가중치가 다르게 설정될 수 있다. 예를 들어, 저학 년에서는 또는 의 값이 크고, 고학년에서는 의 값이 크게 설정될 수 있다. 또한, 교우관계 점수는 함께 놀 이에 참여한 친구의 수에 따라 부여하며, 예를 들어, 혼자 노는 경우 0점, 1~2명과 함께 노는 경우 1점, 3~5명 의 경우 2점, 5명 초과의 경우 3점을 부여할 수 있다. 서버는 획득된 영상, 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지할 수 있다 . 구체적으로, 서버는 획득된 영상, 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 아동 학 대가 발생하는지 여부 및 영유아 간의 싸움이 발생하였는지 여부를 판단하고, 아동 학대가 발생된 것으로 판단 되거나 영유아 간의 싸움이 발생한 것으로 판단되면, 이상 징후가 발생한 것으로 감지할 수 있다. 예를 들어, 서버는 두 영유아가 서로 붙어 있으며, 영유아의 감정 중 화남의 값이 임계값(예를 들어, 0.9) 이상으로 판단되면, 두 영유아 간에 싸움이 발생한 것으로 판단할 수 있다. 또 다른 예로, 서버는 영유아의 감정 중 슬픔의 값이 임계값(예를 들어, 0.9) 이상으로 판단되며, 영유아의 교우 관계, 수업 집중도, 놀이 만족도가 임 계값 미만으로 판단되면, 영유아에 대한 아동 학대가 발생될 가능성이 높은 것으로 판단할 수 있다. 서버는 획득된 감정 및 활동에 대한 정보, 이상 징후에 대한 정보를 바탕으로 안전 리포트를 생성할 수 있 다. 이때, 서버는 영유아의 활동 리포트를 생성할 수 있다. 구체적으로, 서버는 앞서 획득 한 영유아의 교우 관계, 수업 집중도, 놀이 만족도, 식사 정보 등을 바탕으로 활동 리포트를 생성할 수 있다. 이때, 서버는 자녀와 친분 관계를 유지하고 있는 친구의 이름 및 접촉 시간 통계, 일자별 자녀 활동에 대 한 통계 등과 같은 다양한 통계 정보를 포함하는 활동 리포트를 생성할 수 있다. 또한, 서버는 모자이크 및 마스킹 처리를 수행하여 영상을 제공할 수 있다. 구체적으로, 서버는 부모에게 이상 상황에 대한 영상을 제공할 때, 영상에 포함된 해당 자녀를 제외한 나머지 인물의 얼굴 영역 또는 몸 영역을 자동으로 모자 이크 처리하여 부모에게 제공할 수 있다. 또한 서버는 영유아 안전 리포트에 포함된 활동 정보 및 이상상황에 대한 영상 정보를 사용자 단말(20,3 0)로 전송할 수 있다. 특히 이상 상황에 대한 영상 정보를 제공할 때, 서버는 모자이크 처리된 영상과 함 께 이상 징후 정보(예를 들어, 발생 일시, 이상 징후 내용, 당사자 이름 등)를 부모의 사용자 단말로 전송 할 수 있다. 영유아 관련 시설을 관리하는 사람의 사용자 단말은 획득된 활동 정보를 바탕으로 영유아 활동을 모니터링 할 수 있다. 즉, 영유아 관련 시설을 관리하는 사람은 사용자 단말에 제공되는 활동 정보를 통해 원내 의 영유아들에 대한 활동 상태를 주기적으로 모니터링할 수 있다. 또한, 사용자 단말은 이상 상황 영상 정 보를 바탕으로 원내 이상 상황에 대한 알림을 제공할 수 있다. 부모의 사용자 단말은 획득된 활동 정보를 바탕으로 자녀 활동을 모니터링할 수 있다. 예를 들어, 부 모의 사용자 단말은 설치된 어플리케이션을 통해 도 4와 같은 어플리케이션 실행 화면을 제공할 수 있다. 어플리케이션 실행 화면에는 자녀의 활동 정보에 대한 내용이 포함될 수 있다. 또한, 사용자 단말은 이상 상황 영상 정보를 바탕으로 어플리케이션 화면을 통해 영상을 제공할 수 있다 . 예를 들어, 도 5에 도시된 바와 같이, 사용자 단말은 이상 상황(예를 들어, 싸움)이 발생한 영상에 대해 자녀에 대해서는 처리를 수행하지 않으나, 상대방 영유아는 마스킹(또는 모자이크) 처리를 수행 하여 영상을 제공할 수 있다. 한편, 도 5에서는 상대방 영유아의 전체 영역을 마스킹하였으나, 이는 일 실시예 에 불과할 뿐, 얼굴 영역만 마스킹을 수행할 수 있다. 도 6은 본 개시의 일 실시예에 따른, 서버의 영유아 안전 관리 방법을 설명하기 위한 흐름도이다. 서버는 영유아 관련 시설에 배치된 카메라를 통해 영유아를 촬영하여 획득된 영상을 수신할 수 있다 (S610). 서버는 획득된 영상에 포함된 영유아의 얼굴 및 관절을 분석할 수 있다(S620). 서버는 분석된 영유아의 얼굴 및 관절에 대한 정보에 기초하여 영유아의 감정 및 활동을 분석할 수 있다 (S630). 구체적으로, 서버는 영유아의 얼굴 영역을 인공지능 모델에 입력하여 영유아의 감정에 대한 정보 를 획득할 수 있고, 영유아의 몸 영역 중 관절 영역을 추정하여 관절에 대한 정보를 획득할 수 있다. 서버는 분석된 영유아의 감정 및 활동에 대한 정보에 기초하여 이상 징후를 감지할 수 있다(S640). 구체적 으로, 서버는 분석된 영유아의 감정 및 활동 정보에 기초하여 영유아 간의 싸움, 학대 여부 등을 판단하여 이상 징후를 감지할 수 있다. 서버는 분석된 영유아의 감정 및 활동에 대한 정보, 이상 징후와 관련된 정보에 기초하여 안전 리포트를 생성할 수 있다(S650). 안전 리포트에는 영유아의 활동에 대한 정보뿐만 아니라 이상 상황에 대한 영상 정보가 포함될 수 있다. 이때, 영상 정보에는 다른 인물(또는 영유아)를 마스킹 또는 모자이크 처리가 수행될 수 있다. 서버는 생성된 안전 리포트를 사용자 단말(20,30)로 제공할 수 있다(S660). 이때, 생성된 안전 리포트는 사용자 단말(20,30)에 설치된 어플리케이션을 통해 제공될 수 있다. 한편, 이상에서 상술한 바와 같은 인공지능 모델에 관련된 기능은 메모리 및 프로세서를 통해 수행될 수 있다. 프로세서는 하나 또는 복수의 프로세서로 구성될 수 있다. 이때, 하나 또는 복수의 프로세서는 CPU, AP 등과 같 은 범용 프로세서, GPU. VPU 등과 같은 그래픽 전용 프로세서 또는 NPU와 같은 인공지능 전용 프로세서일 수 있 다. 하나 또는 복수의 프로세서는, 비휘발성 메모리 및 휘발성 메모리에 저장된 기 정의된 동작 규칙 또는 인공 지능 모델에 따라, 입력 데이터를 처리하도록 제어한다. 기 정의된 동작 규칙 또는 인공지능 모델은 학습을 통해 만들어진 것을 특징으로 한다. 여기서, 학습을 통해 만들어진다는 것은, 다수의 학습 데이터들에 학습 알고리즘을 적용함으로써, 원하는 특성 의 기 정의된 동작 규칙 또는 인공지능 모델이 만들어짐을 의미한다. 이러한 학습은 본 개시에 따른 인공지능이 수행되는 기기 자체에서 이루어질 수도 있고, 별도의 서버/시스템을 통해 이루어 질 수도 있다. 한편, 본 개시의 다양한 실시예에 따른 방법은 저장매체에 저장될 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태로 제공될 수 있다. 여기서, '비일시적 저장매체'는 실재(tangible) 하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저 장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 예로, '비일시적 저장매 체'는 데이터가 임시적으로 저장되는 버퍼를 포함할 수 있다. 일 실시 예에 따르면, 본 개시의 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두개의 사용자 장치들(예: 스 마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품(예: 다운로더블 앱(downloadable app))의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 이상에서 상술한 바와 같은 본 개시의 다양한 실시 예들에 따른 구성 요소(예: 모듈 또는 프로그램) 각각은 단 수 또는 복수의 개체로 구성될 수 있으며, 전술한 해당 서브 구성 요소들 중 일부 서브 구성 요소가 생략되거나, 또는 다른 서브 구성 요소가 다양한 실시 예에 더 포함될 수 있다. 대체적으로 또는 추가적으로, 일부 구성 요소들(예: 모듈 또는 프로그램)은 하나의 개체로 통합되어, 통합되기 이전의 각각의 해당 구성 요소 에 의해 수행되는 기능을 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따른, 부, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적, 병렬적, 반복적 또는 휴리스틱하게 실행되거나, 적어도 일부 동작이 다른 순서로 실행되거나, 생략되거나, 또는 다른 동 작이 추가될 수 있다. 이상에서는 본 개시의 바람직한 실시 예에 대하여 도시하고 설명하였지만, 본 개시는 상술한 특정의 실시 예에"}
{"patent_id": "10-2021-0086731", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "한정되지 아니하며, 청구범위에서 청구하는 본 개시의 요지를 벗어남이 없이 당해 개시가 속하는 기술분야에서 통상의 지식을 가진 자에 의해 다양한 변형실시가 가능한 것은 물론이고, 이러한 변형실시들은 본 개시의 기술 적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다."}
{"patent_id": "10-2021-0086731", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른, 영유아 관리 시스템의 도면을 도시한 도면, 도 2는 본 개시의 일 실시예에 따른, 영유아 관리를 위한 서버를 도시한 도면, 도 3은 본 개시의 일 실시예에 따른, 영유아 관리 시스템의 구성이 수행하는 영유아 관리를 위한 동작을 설명하 기 위한 도면, 도 4 및 도 5는 본 개시의 일 실시예에 따른, 영유아 관리 어플리케이션에서 제공되는 화면을 도시한 도면, 그 리고, 도 6은 본 개시의 일 실시예에 따른, 서버의 영유아 안전 관리 방법을 설명하기 위한 흐름도이다."}
