{"patent_id": "10-2022-0055776", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0156231", "출원번호": "10-2022-0055776", "발명의 명칭": "마커 상태 판정 장치 및 방법", "출원인": "동국대학교 산학협력단", "발명자": "김흥수"}}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판정하는 마커 상태 판정 장치로서,상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지를 제공하는 마커 이미지 제공 모듈;상기 바이너리 이미지 및 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 마커 상태 판정 모듈; 및상기 마커의 비정상 상태 알림을 송출하는 마커 상태 알림 모듈을 포함하는마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 마커 상태 알림 모듈은, 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 상기 마커의 비정상상태를 표시하고,상기 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 상기 마커의 복원 상태를 표시하는, 마커 상태 판정장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 마커 상태 알림 모듈은, 상기 마커의 반사체가 가려진 비율에 따라 반사체 별로 시각적 표시를 다르게 하여 상기 마커의 비정상 상태를 표시하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 마커 상태 알림 모듈은, 상기 인공지능 모델을 통해 상기 마커의 가려진 반사체의 위치를 예측한 반사체위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 마커 상태 알림 모듈은, 상기 마커의 반사체들 사이의 거리를 기반으로 하여 상기 마커의 가려진 반사체의위치를 연산함으로써 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시하는,마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 인공지능 모델을 통해 획득되는 상기 마커의 상태 데이터를 미리 정해진 개수 이상 수집하는 버퍼; 및상기 버퍼를 분석하여 상기 인공지능 모델을 통해 판정된 상기 마커의 비정상 상태를 검증하는 검증 모듈을 더포함하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 마커 이미지 제공 모듈은 미리 정해진 프레임 레이트로 상기 마커의 바이너리 이미지를 제공하고,공개특허 10-2023-0156231-3-상기 검증 모듈은, 미리 정해진 시간 구간에서, 비정상 상태로 판정된 상태 데이터 대비 정상 상태로 판정된 상태 데이터의 비율이 미리 정해진 비율을 초과하는 경우, 상기 마커가 비정상 상태인 것으로 검증하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 마커 이미지 제공 모듈은 미리 정해진 프레임 레이트로 상기 마커의 바이너리 이미지를 제공하고,상기 검증 모듈은, 미리 정해진 시간 구간에서 비정상 상태로 판정된 상태 데이터가 미리 정해진 개수 이상 연속되는 경우, 상기 마커가 비정상 상태인 것으로 검증하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 바이너리 이미지 형태의 학습 데이터를 이용하여 상기 인공지능 모델을 학습시키는 학습 모듈을 더 포함하는 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판정하는 마커 상태 판정 장치로서,상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지 및 제1 인공지능 모델을 이용하여 상기 마커의 마커타입을 판단하는 마커 타입 판단 모듈;상기 마커 타입에 기초하여 복수의 제2 인공지능 모델 중 상기 마커 타입에 대응하는 제2 인공지능 모델을 선택하고, 상기 바이너리 이미지 및 상기 선택한 제2 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 마커상태 판정 모듈; 및상기 마커의 비정상 상태 알림을 송출하는 마커 상태 알림 모듈을 포함하는마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서,상기 마커 상태 알림 모듈은, 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 상기 마커 타입 및 상기 마커의 비정상 상태를 표시하고,상기 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 상기 마커의 복원 상태를 표시하는, 마커 상태 판정장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 마커 상태 알림 모듈은, 상기 마커의 반사체가 가려진 비율에 따라 반사체 별로 시각적 표시를 다르게 하여 상기 마커의 비정상 상태를 표시하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 마커 상태 알림 모듈은, 상기 제2 인공지능 모델을 통해 상기 마커의 가려진 반사체의 위치를 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제10항에 있어서,상기 마커 상태 알림 모듈은, 상기 마커의 반사체들 사이의 거리를 기반으로 하여 상기 마커의 가려진 반사체의공개특허 10-2023-0156231-4-위치를 연산함으로써 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시하는,마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제10항에 있어서,상기 제2 인공지능 모델을 통해 획득되는 상기 마커의 상태 데이터를 미리 정해진 개수 이상 수집하는 버퍼; 및상기 버퍼를 분석하여 상기 제2 인공지능 모델을 통해 판정된 상기 마커의 비정상 상태를 검증하는 검증 모듈을더 포함하는, 마커 상태 판정 장치."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판정하는 마커 상태 판정 방법으로서,상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지를 수신하는 단계;상기 바이너리 이미지 및 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 단계; 및상기 마커의 비정상 상태 알림을 송출하는 단계를 포함하는마커 상태 판정 방법."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 마커의 비정상 상태 알림을 송출하는 단계는,네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 상기 마커의 비정상 상태를 표시하는 단계; 및상기 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 상기 마커의 복원 상태를 표시하는 단계를 포함하는,마커 상태 판정 방법."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 마커의 비정상 상태 알림을 송출하는 단계는,상기 마커의 반사체가 가려진 비율에 따라 반사체 별로 시각적 표시를 다르게 하여 상기 마커의 비정상 상태를표시하는 단계를 포함하는, 마커 상태 판정 방법."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제16항에 있어서,상기 마커의 가려진 반사체에 대한 위치를 예측하는 단계; 및상기 예측한 결과를 네비게이션 수술용 소프트웨어의 실행 화면에 표시하는 단계를 더 포함하는 마커 상태 판정방법."}
{"patent_id": "10-2022-0055776", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서,상기 인공지능 모델을 통해 획득되는 상기 마커의 상태 데이터를 미리 정해진 개수 이상 버퍼에 수집하는 단계;및상기 버퍼를 분석하여 상기 인공지능 모델을 통해 판정된 상기 마커의 비정상 상태를 검증하는 단계를 더 포함하는 마커 상태 판정 방법."}
{"patent_id": "10-2022-0055776", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "마커 상태 판정 장치 및 방법이 제공된다. 네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판정 하는 마커 상태 판정 장치는, 상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지를 제공하는 마커 이미 지 제공 모듈; 상기 바이너리 이미지 및 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 마커 상태 판정 모듈; 및 상기 마커의 비정상 상태 알림을 송출하는 마커 상태 알림 모듈을 포함할 수 있다."}
{"patent_id": "10-2022-0055776", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시 내용은 마커 상태 판정 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0055776", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "네비게이션 수술용 기술은 수술 병변의 위치 또는 실제 수술부위의 위치를 찾고, 수술 장비가 해당 위치까지 안 전하게 도달할 수 있는 경로를 제공하며, 수술 장비의 현재 위치를 가이드 하면서 정확한 정보를 실시간으로 제 공할 수 있다. 네비게이션 수술용 기술은 수술자가 원격으로 조종하는 로봇 기술, 영상에서의 환부 위치와 수 술 중 환부 위치를 정합해 주는 수술 네비게이션, 수술 전 치료 과정 시뮬레이션을 통해 최적의 수술을 가이드 해주는 수술용 가이드 기술 등을 포함할 수 있다. 예를 들어, 인공 슬관절 치환 수술의 경우 하지 정렬의 정확 도가 수술 결과 및 예후에 많은 영향을 미치기 때문에, 외과적 정렬 지원장비에 기반하는 네비게이션 수술용 기 술이 사용된다."}
{"patent_id": "10-2022-0055776", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "해결하고자 하는 일 과제는, 네비게이션 수술용 시스템의 마커에 이물질이 부착된 경우 데이터의 정확성을 보장 하고 마커가 정상 상태로 유지되도록 할 수 있는 마커 상태 판정 장치 및 방법을 제공하는 것이다."}
{"patent_id": "10-2022-0055776", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "일 실시 예에 따른 마커 상태 변경 장치는, 네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판 정하는 마커 상태 판정 장치로서, 상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지를 제공하는 마커 이미지 제공 모듈; 상기 바이너리 이미지 및 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 마커 상태 판정 모듈; 및 상기 마커의 비정상 상태 알림을 송출하는 마커 상태 알림 모듈을 포함할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 상 기 마커의 비정상 상태를 표시하고, 상기 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 상기 마커의 복 원 상태를 표시할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 상기 마커의 반사체가 가려진 비율에 따라 반사체 별로 시각적 표시를 다르게 하여 상기 마커의 비정상 상태를 표시할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 상기 인공지능 모델을 통해 상기 마커의 가려진 반사체의 위치 를 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 상기 마커의 반사체들 사이의 거리를 기반으로 하여 상기 마커 의 가려진 반사체의 위치를 연산함으로써 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실 행 화면에 표시할 수 있다. 몇몇 실시 예에서, 상기 장치는, 상기 인공지능 모델을 통해 획득되는 상기 마커의 상태 데이터를 미리 정해진 개수 이상 수집하는 버퍼; 및 상기 버퍼를 분석하여 상기 인공지능 모델을 통해 판정된 상기 마커의 비정상 상 태를 검증하는 검증 모듈을 더 포함할 수 있다. 몇몇 실시 예에서, 상기 마커 이미지 제공 모듈은 미리 정해진 프레임 레이트로 상기 마커의 바이너리 이미지를 제공하고, 상기 검증 모듈은, 미리 정해진 시간 구간에서, 비정상 상태로 판정된 상태 데이터 대비 정상 상태로 판정된 상태 데이터의 비율이 미리 정해진 비율을 초과하는 경우, 상기 마커가 비정상 상태인 것으로 검증할 수 있다. 몇몇 실시 예에서, 상기 마커 이미지 제공 모듈은 미리 정해진 프레임 레이트로 상기 마커의 바이너리 이미지를 제공하고, 상기 검증 모듈은, 미리 정해진 시간 구간에서 비정상 상태로 판정된 상태 데이터가 미리 정해진 개 수 이상 연속되는 경우, 상기 마커가 비정상 상태인 것으로 검증할 수 있다. 몇몇 실시 예에서, 상기 장치는, 상기 바이너리 이미지 형태의 학습 데이터를 이용하여 상기 인공지능 모델을 학습시키는 학습 모듈을 더 포함할 수 있다. 일 실시 예에 따른 마커 상태 변경 장치는, 네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판 정하는 마커 상태 판정 장치로서, 상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지 및 제1 인공지능 모델을 이용하여 상기 마커의 마커 타입을 판단하는 마커 타입 판단 모듈; 상기 마커 타입에 기초하여 복수의 제2 인공지능 모델 중 상기 마커 타입에 대응하는 제2 인공지능 모델을 선택하고, 상기 바이너리 이미지 및 상 기 선택한 제2 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 마커 상태 판정 모듈; 및 상기 마커의 비정상 상태 알림을 송출하는 마커 상태 알림 모듈을 포함할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 상 기 마커 타입 및 상기 마커의 비정상 상태를 표시하고, 상기 마커가 비정상 상태였다가 정상 상태로 복원된 경 우, 상기 마커의 복원 상태를 표시할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 상기 마커의 반사체가 가려진 비율에 따라 반사체 별로 시각적 표시를 다르게 하여 상기 마커의 비정상 상태를 표시할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 상기 제2 인공지능 모델을 통해 상기 마커의 가려진 반사체의 위치를 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시할 수 있다. 몇몇 실시 예에서, 상기 마커 상태 알림 모듈은, 상기 마커의 반사체들 사이의 거리를 기반으로 하여 상기 마커 의 가려진 반사체의 위치를 연산함으로써 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실 행 화면에 표시할 수 있다. 몇몇 실시 예에서, 상기 장치는, 상기 제2 인공지능 모델을 통해 획득되는 상기 마커의 상태 데이터를 미리 정 해진 개수 이상 수집하는 버퍼; 및 상기 버퍼를 분석하여 상기 제2 인공지능 모델을 통해 판정된 상기 마커의 비정상 상태를 검증하는 검증 모듈을 더 포함할 수 있다. 일 실시 예에 따른 마커 상태 변경 방법은, 네비게이션 수술용 적외선 카메라를 통해 촬영한 마커의 상태를 판 정하는 마커 상태 판정 방법으로서, 상기 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지를 수신하는 단 계; 상기 바이너리 이미지 및 인공지능 모델을 이용하여 상기 마커의 상태를 판정하는 단계; 및 상기 마커의 비 정상 상태 알림을 송출하는 단계를 포함할 수 있다. 몇몇 실시 예에서, 상기 마커의 비정상 상태 알림을 송출하는 단계는, 네비게이션 수술용 소프트웨어의 실행 화 면 중 일부 영역에 상기 마커의 비정상 상태를 표시하는 단계; 및 상기 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 상기 마커의 복원 상태를 표시하는 단계를 포함할 수 있다. 몇몇 실시 예에서, 상기 마커의 비정상 상태 알림을 송출하는 단계는, 상기 마커의 반사체가 가려진 비율에 따 라 반사체 별로 시각적 표시를 다르게 하여 상기 마커의 비정상 상태를 표시하는 단계를 포함할 수 있다. 몇몇 실시 예에서, 상기 방법은, 상기 마커의 가려진 반사체에 대한 위치를 예측하는 단계; 및 상기 예측한 결 과를 네비게이션 수술용 소프트웨어의 실행 화면에 표시하는 단계를 더 포함할 수 있다. 몇몇 실시 예에서, 상기 방법은, 상기 인공지능 모델을 통해 획득되는 상기 마커의 상태 데이터를 미리 정해진 개수 이상 버퍼에 수집하는 단계; 및 상기 버퍼를 분석하여 상기 인공지능 모델을 통해 판정된 상기 마커의 비 정상 상태를 검증하는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2022-0055776", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참조하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식 을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위해 서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 명세서 및 청구범위 전체에서, 어떤 부분이 어떤 구성 요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재 가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성 요소를 더 포함할 수 있는 것을 의미한다. 또한, 명세서에 기재된 \"...부\", \"...기\", \"모듈\" 등의 용어는 본 명세서에서 설명되는 적어도 하나의 기능이나 동작을 처리할 수 있는 단위를 의미할 수 있으며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 1은 일 실시 예에 따른 네비게이션 수술용 시스템을 설명하기 위한 개념도이다. 도 1을 참조하면, 일 실시 예에 따른 네비게이션 수술용 시스템은 마커 상태 판정 장치, 마커, 적외 선 카메라, 수술 보조용 디스플레이 장치 및 사운드 재생 장치를 포함할 수 있다. 도 1에 도시된 네비게이션 수술용 시스템의 구성은 구체적인 구현 목적에 따라 달라질 수 있으며, 도시된 구성 요소 중 일 부가 생략되거나 도시되지 않은 구성 요소가 추가될 수 있다. 마커 상태 판정 장치는 마커에 이물질이 부착된 경우 데이터의 정확성을 보장하고 마커가 정상 상 태로 유지되도록 하는 기능을 제공할 수 있다. 이와 같은 기능은 영상에서의 환부 위치와 수술 중 환부 위치를 정합하는 네비게이션 수술용 기능과 연동하여 구현될 수 있다. 이를 위해, 마커 상태 판정 장치는 마커 및 적외선 카메라를 이용하여 수술 대상, 수술 도구 등의 위치 또는 자세 정보를 추적할 수 있다. 즉, 마커 상태 판정 장치는 적외선 카메라와 적외선을 반사하는 마커를 통해 환부 또는 수술 도구 에 대한 위치 또는 자세 데이터를 획득하고, 획득한 위치 또는 자세 데이터를 이용하여 수술을 보조할 수 있다. 예를 들면, 마커 상태 판정 장치는 추적 데이터를 이용하여 대퇴골 및 경골의 3차원 좌표계를 정의하고, 뼈 의 절삭을 위한 평면을 정의하는 등의 기능을 수행할 수 있다. 마커(또는 네비게이션 수술용 마커)는 환부 또는 수술 도구에 부착되어 사용될 수 있다. 예를 들어, 마커 는 도 1에 도시된 바와 같이 인공 슬관절 치환 수술을 위해 대퇴골(F)과 경골(T)의 무릎 관절에 부착되고, 수술 중 환부 또는 수술 도구의 위치 및 자세를 추적하기 위해 사용될 수 있다. 마커는 복수의 고 반사 반 사체를 구비할 수 있으며, 수술 목적 및 수술 환경을 고려하여 설계된 형상을 갖는 마커 프레임에 복수의 반사 체를 부착한 형태로 제조될 수 있다. 예를 들어, 마커는 도 1에 도시된 바와 같이 십자 모양의 마커 프레 임에 4 개의 반사체가 부착된 형태일 수 있으나, 본 발명의 범위가 특정 형상의 마커를 사용하는 경우만으 로 제한되는 것은 아니며, 다양한 임의의 형상을 갖는 마커를 사용하는 경우까지 포함할 수 있다. 적외선 카메라(또는 네비게이션 수술용 적외선 카메라)는 마커의 위치와 자세를 추적하기 위해 마커 에 대한 적외선 영상을 촬영할 수 있다. 몇몇 실시 예에서, 적외선 카메라는 광원이 없는 곳에서도 촬 영을 수행하기 위한 적외선 조광기를 구비할 수도 있으며, 적외선 카메라가 적외선을 방사한 후 마커의 반사체에 의해 반사되는 신호를 촬영할 수 있다. 본 실시 예에서는 설명의 명확성을 위해 적외선을 이용한 광 학 추적 방식에 대해 설명하지만, 본 발명의 범위가 이에 제한되는 것은 아니며, 마커와 카메라 사이에서 다른 파장 영역대의 광선을 이용하는 광학 추적 방식이 사용되는 경우까지 포함할 수 있다. 수술 보조용 디스플레이 장치는 마커와 적외선 카메라를 통해 구현되는 광학 추적을 수행하는 과정 및 결과를 사용자(예를 들어, 외과의, 간호사, 수술자 등)에게 제공할 수 있다. 구체적으로, 수술 보조용 디스 플레이 장치는, 마커 상태 판정 장치 또는 별도의 네비게이션 수술용 장치 상에서 실행되는 네비게이션 수술용 소프트웨어의 실행 화면을 표시할 수 있다. 수술 보조용 디스플레이 장치는 LCD(Liquid Crystal Display) 패널, LED(Light Emitting Diode) 패널, OLED(Organic Light Emitting Diode) 패널 등을 포함하도록구현될 수 있으나, 본 발명의 범위가 나열된 것들로 제한되는 것은 아니다. 사운드 재생 장치는 마커 상태 판정 장치 또는 별도의 네비게이션 수술용 장치 상에서 실행되는 네비게 이션 수술용 소프트웨어의 실행에 따라 출력되는 사운드를 수술 환경에 제공할 수 있다. 특히, 수술 보조용 디스플레이 장치 및 사운드 재생 장치는 마커의 비정상 상태 알림을 송출하기 위해 사용될 수 있다. 즉, 마커 상태 판정 장치가, 후술하는 인공지능 모델(AI(Artificial Intelligence) 모델)을 이용하여, 적외선 카메라를 통해 촬영한 마커의 상태가 비정상인 것으로 판정한 경우, 그 판정 결과를 사용자에게 제공하기 위해 사용될 수 있다. 이하에서는 도 2 내지 도 14를 참조하여 실시 예들에 따른 마커 상태 판정 장치 및 방법에 대해 상세히 설명하 도록 한다. 도 2는 일 실시 예에 따른 마커 상태 판정 장치를 설명하기 위한 블록도이다. 도 2를 참조하면, 일 실시 예에 따른, 적외선 카메라를 통해 촬영한 마커의 상태를 판정하는 마커 상태 판정 장치는 마커 상태 판정 모듈, 마커 상태 알림 모듈, 마커 이미지 제공 모듈 및 학습 모듈을 포함할 수 있다. 마커 이미지 제공 모듈은 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지를 제공할 수 있다. 바이너리 이미지는 2 가지 색상(일반적으로 흑, 백) 중 하나만을 갖는 픽셀들로 구성된 이미지일 수 있다. 적 외선 카메라를 이용하여 마커를 촬영하면, 바이너리 이미지 상에서 마커에 부착된 반사체 영역은 백색으로 표현되고, 나머지 영역은 흑색으로 표현될 수 있다. 마커 이미지 제공 모듈은 적외선 카메라를 이용하여 촬영된 마커의 바이너리 이미지를 미리 정해 진 프레임 레이트로 마커 상태 판정 장치의 다른 모듈에 제공할 수 있다. 특히, 마커 이미지 제공 모듈 은 마커의 바이너리 이미지를 미리 정해진 프레임 레이트로 마커 상태 판정 모듈에 제공할 수 있 다. 또는, 마커 이미지 제공 모듈은 마커의 바이너리 이미지를 미리 정해진 프레임 레이트로 인공지 능 모델(M1)에 직접 제공하거나 마커 상태 판정 모듈을 통해 인공지능 모델(M1)에 제공할 수 있다. 프레임 레이트가 높으면 마커 상태를 더 정확하게 판정할 수는 있지만, 마커 상태를 판정하기 위해 수행하는 연 산의 빈도 수가 높아지므로 그만큼 처리해야 할 데이터량이 증가하게 되며, 마커 상태 판정 장치의 전력 소 모량이 증가하고 과도한 연산량으로 인해 사용자와의 인터랙션이나 다른 기능을 수행함에 있어서 지연을 발생시 킬 수 있다. 이러한 점을 고려하여, 마커 이미지 제공 모듈은 구현되는 하드웨어의 사양에 따라 프레임 레이트를 결정할 수 있으며, 초당 5 프레임 내지 60 프레임, 또는 그 이상의 프레임 레이트로 마커의 바이 너리 이미지를 제공할 수 있다. 본 명세서에서, 마커의 상태는 정상 상태와 비정상 상태로 구분되어 설명될 수 있다. 비정상 상태는, 예를 들어 인공 슬관절 수술 중 뼈의 절삭 과정에서 혈흔 또는 뼈 조각 등 이물질이 마커의 반사체에 부착되어 적외선을 일부 또는 전부 반사하지 못하거나, 마커 자체의 구조적 결함 또는 작동상 결함으로 인해 적외선 을 일부 또는 전부 반사하지 못하는 경우의 상태를 의미할 수 있다. 정상 상태는 마커의 추적 정확도가 보 장되는 범위에서 적외선 반사가 충분히 일어나는 상태를 의미할 수 있다. 이물질이 반사체의 일부를 가리게 되면, 마커의 위치 데이터의 획득이 어려울 수 있거나 획득이 가능하더라 도 그 정확성을 보장하기 어려울 수 있다. 네비게이션 수술용 기술은 마커를 통해 환부 또는 수술 도구에 대한 위치 또는 자세 데이터를 획득하고, 획득한 위치 또는 자세 데이터를 이용하여 수술을 보조함으로써 사용 자로 하여금 정확한 집도를 유도하게 되는데, 마커의 추적은 실시간으로 수행되므로, 실시간으로 획득되는 추적 정확도가 보장되지 않으면 수술 결과 및 예후에 악영향을 미칠 위험이 있다. 따라서, 마커의 상태를 추적하여 비정상 상태를 신속하게 검출하고, 비정상 상태에서 추적 데이터의 정확도를 보완하거나 마커의 상태를 정상 상태로 바꿀 수 있도록 신속하게 사용자에게 알릴 필요가 있다. 마커 상태 판정 모듈은, 마커 이미지 제공 모듈로부터 제공되는 바이너리 이미지 및 인공지능 모델 (M1)을 이용하여 마커의 상태를 판정할 수 있다. 인공지능 모델(M1)은 마커의 바이너리 이미지를 입력 받고 마커의 상태를 예측하여 출력할 수 있다. 이를 위해, 인공지능 모델(M1)은, 학습 모듈에 의해, 바이너리 이미지 형태의 학습 데이터를 이용하여 학 습된 것일 수 있다. 구체적으로, 학습 모듈은 마커의 반사체가 가려진 정도, 예를 들면 하나의 반사 체에서 가려진 영역의 비율 또는 복수의 반사체 중 가려진 반사체의 개수 등에 따라 마커의 상태를 정상 또는 비정상으로 예측할 수 있도록 인공지능 모델(M1)을 학습시킬 수 있다. 인공지능 모델(M1)은 인공 신경망 (Artificial Neural Network) 또는 심층 신경망(Deep Neural Network)을 포함하며, 신경망을 이루는 뉴런들은 학습 모듈에 의해 학습을 수행할 수 있다. 또한, 인공지능 모델(M1)은 비정상 상태인 마커의 바이너리 이미지를 입력 받고, 정확히 나타나지 않은 반 사체의 위치를 예측하여 출력할 수도 있다. 이를 위해, 학습 모듈은, 비정상 상태로 판정된 바이너리 이 미지에 나타난 일부 반사체의 위치만으로, 해당 바이너리 이미지에 정확하게 나타나지 않은 다른 일부 반사체의 위치를 예측할 수 있도록 인공지능 모델(M1)을 학습시킬 수도 있다. 이에 따라, 마커 상태 판정 모듈은, 인공지능 모델(M1)을 이용하여 마커의 상태가 정상 상태인지 비정 상 상태인지를 판정할 수 있거나, 비정상 상태로 판정된 바이너리 이미지에 정확하게 나타나지 않은 반사체의 위치를 예측할 수 있다. 마커 상태 알림 모듈는, 마커 상태 판정 모듈의 판정 결과에 기초하여 마커의 비정상 상태 알림 을 송출할 수 있다. 수술이 진행되는 동안, 사용자는 마커를 계속 주시하고 있기 어려우며, 마커에 이물질이 부착된 상태를 지나치기 쉽다. 이러한 점을 고려하여, 마커 상태 알림 모듈은 수술 보조용 디스플레이 장치에 표시 되는 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 마커의 비정상 상태를 실시간으로 표시할 수 있다. 사용자는 수술 보조용 디스플레이 장치를 주시하며 수술을 진행하는 경우가 많으므로, 마커 를 직접 확인할 필요 없이 네비게이션 수술용 소프트웨어의 실행 화면에 표시되는 알림을 통해 마커의 정상 또는 비정상 상태를 확인할 수 있다. 특히, 마커 상태 알림 모듈은 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 마커의 이미 지를 활성화할 수 있다. 즉, 마커 상태 알림 모듈은, 마커를 구성하는 마커 프레임과, 마커 프레임에 부착된 복수의 반사체를 포함하는 형상 구조를 이미지로 나타낸 정보를 표시할 수 있을 뿐 아니라, 복수의 반사 체 중 어떤 반사체가 이물질 부착 또는 손상되었는지 여부를 표시할 수 있다. 이물질 부착 또는 손상된 반사체 를 식별하여 표시하는 것은. 비정상 상태로 판정된 바이너리 이미지에 정확하게 나타나지 않은 반사체의 위치를 예측하여 표시할 수도 있고, 미리 저장된, 현재 사용 중인 마커의 사양 정보로부터 얻을 수 있는 본래 형상 또는 구조에 대한 정보를 이용하여 표시할 수도 있으나, 본 발명의 범위가 이에 제한되는 것은 아니다. 또한, 마커 상태 알림 모듈은, 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 마커의 복원 상태를 표시할 수 있다. 사용자가 비정상 상태의 원인을 제거한 경우가 있을 수 있다. 예를 들어, 사용자가 비정상 상태의 마커에 부착된 이물질을 제거하거나, 손상된 마커를 교체하는 경우, 마커가 정상 상 태로 전환되었음을 네비게이션 수술용 소프트웨어의 실행 화면에 표시할 수 있다. 표시 방식은, 예를 들어, 네 비게이션 수술용 소프트웨어의 실행 화면에 표시했던 비정상 상태 알림을 제거하고 단순히 기존의 수술 네비게 이션 화면을 표시하는 방식으로 구현될 수도 있고, 네비게이션 수술용 소프트웨어의 실행 화면에 별도의 복원 알림을 표시하는 방식으로 구현될 수도 있다. 마커 상태 알림 모듈은, 사운드 재생 장치를 통해서도 마커의 비정상 상태 알림, 예를 들어 알림음을 송출할 수 있다. 구체적으로, 마커의 비정상 상태가 검출된 경우, 마커 상태 알림 모듈은 알림음을 송출할 수 있고, 마커가 정상 상태로 복원된 경우 동일한 알림음을 송출하거나, 다른 종류의 알림음을 송출 할 수 있다. 또는, 마커의 비정상 상태가 검출된 경우, 마커 상태 알림 모듈은 알림음을 지속적으로 송출하다가 마커가 정상 상태로 복원된 경우 송출을 중단할 수도 있다. 이에 따라 사용자는 마커의 상 태를 직접 확인할 필요 없이 알림음만으로 마커의 정상 또는 비정상 상태를 확인할 수 있다. 마커 상태 알림 모듈은 상술한 바와 같은 시각적 송출 방식과 청각적 송출 방식을 동시에 함께 사용하여 마커의 상태를 사용자에게 전달할 수도 있으며, 구체적인 송출 방식은 설명한 예시 외에 다양한 방식으로 구현될 수 있다. 이에 따라, 수술 중에 마커의 상태를 사용자가 직접 확인해야 할 필요가 없기 때문에 수술 편의성이 개선될 수 있다. 뿐만 아니라, 마커가 비정상 상태가 된 경우 실시간으로 즉각적인 검출이 가능하므로 수술 정확 도 역시 크게 개선되어 수술 결과 및 예후를 향상시킬 수 있다. 한편, 마커 상태 알림 모듈은, 인공지능 모델(M1)을 통해 마커의 가려진 반사체의 위치를 예측한 반사 체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시할 수 있다. 또는, 마커 상태 알림 모 듈은, 마커의 반사체들 사이의 거리를 기반으로 하여 마커의 가려진 반사체의 위치를 연산함으로써 예측한 반사체 위치 예측 결과를, 네비게이션 수술용 소프트웨어의 실행 화면에 표시할 수도 있다. 이에 따라 사 용자는 마커의 비정상 상태가 검출된 경우에도, 비정상 상태의 마커에 부착된 이물질이 제거되거나, 손 상된 마커가 교체되어, 마커가 정상 상태로 전환될 때까지 예측 데이터를 이용하여 수술을 중단하지 않 고 계속할 수 있다. 도 3은 일 실시 예에 따른 마커 상태 판정 방법을 설명하기 위한 순서도이다. 도 3을 참조하면, 일 실시 예에 따른 마커 상태 판정 방법은, 단계(S301)에서 네비게이션 수술용 소프트웨어를 구동할 수 있다. 그리고 사용자는 마커 및 적외선 카메라를 통해 추적되는 환부 및 수술 도구의 위치 및 자세 데이터를 이용하여 수술을 진행할 수 있다. 상기 방법은, 단계(S303)에서 인공지능 모델(M1)에 마커 이미지를 입력할 수 있다. 여기서 마커 이미지는 적외 선 카메라를 통해 촬영한 마커의 바이너리 이미지일 수 있다. 상기 방법은, 단계(S305)에서 바이너리 이미지 및 인공지능 모델(M1)을 이용하여 마커의 상태를 판정할 수 있다. 마커의 상태가 비정상인 것으로 판정된 경우, 상기 방법은 단계(S307)로 진행하여 마커의 비정 상 상태 알림을 송출할 수 있다. 또한, 상기 방법은 마커의 비정상 상태가 정상 상태로 복원될 때까지 단 계(S303, S305, S307)을 반복 수행할 수 있다. 한편, 단계(S305)에서 마커의 상태가 정상인 것으로 판정된 경우(비정상 상태였다가 정상 상태로 복원된 경 우 포함), 상기 방법은 단계(S309)로 진행하여, 네비게이션 수술용 소프트웨어의 실행 화면에 마커가 비정 상 상태인 것으로 판정되기 전에 수행되던 수술에 대한 정보를 다시 표시할 수 있다. 몇몇 실시 예에서, 단계(S307)는 네비게이션 수술용 소프트웨어의 실행 화면 중 일부 영역에 마커의 비정상 상태를 표시하는 단계 및 마커가 비정상 상태였다가 정상 상태로 복원된 경우, 마커의 복원 상태를 표 시하는 단계를 포함할 수 있다. 몇몇 실시 예에서, 상기 방법은, 마커의 가려진 반사체에 대한 위치를 예측하는 단계 및 예측한 결과를 네 비게이션 수술용 소프트웨어의 실행 화면에 표시하는 단계를 더 포함할 수 있다. 도 4는 일 실시 예에 따른 마커를 설명하기 위한 도면이고, 도 5는 일 실시 예에 따른 마커 이미지를 설명하기 위한 도면이다. 도 4를 참조하면, 일 실시 예에 따른 마커는 십자 형상의 마커 프레임에 복수의 반사체(210a, 210b, 210c, 210d)를 부착한 형태이며, 복수의 반사체(210a, 210b, 210c, 210d) 중 하나의 반사체(210c)에 이물질(FO)이 부 착되어 있음을 알 수 있다. 도 5의 (a)를 참조하면, 도 4의 마커가 정상 상태인 경우 적외선 카메라를 통해 촬영한 바이너리 이미 지가 도시되어 있으며, 모든 반사체(210a, 210b, 210c, 210d)가 백색 원으로 선명하게 나타나 있다. 도 5의 (b)를 참조하면, 도 4의 마커가 비정상 상태인 경우 적외선 카메라를 통해 촬영한 바이너리 이 미지가 도시되어 있으며, 반사체(210a, 210b, 210d)는 백색 원으로 선명하게 나타나 있지만, 반사체(210c)에 대 응하는 A 영역에서는 이물질로 인해 가려진 부분으로 인해 백색 초승달 형태만이 나타나 있다. 도 5의 (a)와 같은 바이너리 이미지로 학습된 인공지능 모델(M1)에 도 5의 (b)와 같은 바이너리 이미지를 입력 함으로써, 마커 상태 판정 모듈은 마커의 상태가 비정상에 해당하는 것으로 판정할 수 있다. 도 6 내지 도 8은 일 실시 예에 따른 네비게이션 수술용 소프트웨어의 실행 화면을 나타낸 도면들이다. 도 6을 참조하면, 일 실시 예에 따른 네비게이션 수술용 소프트웨어는 대퇴골을 절삭하는 단계에 있어서 절삭 평면을 계산하기 위해 측정 값을 처리하는 연산을 수행하고 있다고 가정할 수 있다. 이 때, 네비게이션 수술용 소프트웨어의 실행 화면 중 영역(B1)에는 현재 추적 중인 마커가 영상으로 표시될 수 있다. 도 7을 참조하면, 마커가 비정상 상태로 판정된 경우, 마커 상태 알림 모듈에 의해, 네비게이션 수술 용 소프트웨어의 실행 화면 중 영역(B1)에 마커의 이미지가 표시될 수 있다. 그리고 다른 적절한 위치에 이물질이 검출되었음을 나타내는 메시지(\"Foreign object detected\") 또는 마커의 상태가 비정상임을 나타내는 메시지(\"MARKER STATUS: ABNORMAL\") 등이 표시될 수 있다. 본 실시 예에서, 마커 상태 알림 모듈은, 마커의 반사체가 가려진 비율에 따라 반사체 별로 시각적 표 시를 다르게 하여 마커의 비정상 상태를 표시할 수 있다. 예를 들어, 반사체가 가려진 비율에 따라 색상또는 무늬를 다르게 하여 표시할 수 있다. 구체적으로, 제1 기준 비율 이상 가려진 반사체의 경우에는 제1 색상 또는 제1 무늬로 표시되고, 제1 기준 비율 과 다른 제2 기준 비율 이상 가려진 반사체의 경우에는 제1 색상과 다른 제2 색상 또는 제1 무늬와 다른 제2 무 늬로 표시될 수 있다. 예를 들어, 네비게이션 수술용 소프트웨어의 실행 화면 중 영역(B2)에서는 반사체가 30 % 이상 가려지고, 영역(B3)에서는 반사체가 10% 이상 가려진 경우, 영역(B2)에 해당하는 반사체는 적색으로 표 시되고 영역(B3)에 해당하는 반사체는 노란색으로 표시될 수 있다. 또는, 도 7에 도시된 바와 같이, 영역(B2) 에 해당하는 반사체는 사선 무늬로 표시되고 영역(B3)에 해당하는 반사체는 격자 무늬로 표시될 수 있다. 이와 같이 반사체가 가려진 정도에 따라 표시를 달리 함으로써 사용자는 마커의 상태를 직접 확인하지 않고 도 마커의 어느 반사체가 이물질에 의해 얼마만큼 가려졌는지에 대해 신속하게 파악할 수 있다. 도 8을 참조하면, 마커가 정상 상태로 복원된 경우, 마커 상태 알림 모듈에 의해, 네비게이션 수술용 소프트웨어의 실행 화면 중 영역(B1)에 마커의 복원 상태가 표시될 수 있다. 그리고 다른 적절한 위치에 이물질이 제거되었음을 나타내는 메시지(\"Foreign object removed\") 또는 마커의 상태가 정상임을 나타내는 메 시지(\"MARKER STATUS: NORMAL\") 등이 표시될 수 있다. 이에 따라 사용자는 마커가 정상 상태로 복원되었음 을 편리하게 파악하고 수술을 계속해 나갈 수 있다. 도 9는 일 실시 예에 따른 마커를 설명하기 위한 도면이다. 도 9를 참조하면, 일 실시 예에 따른 마커는 다양한 형상 구조를 가질 수 있다. 예를 들어, 타입 A는 십자 형 상의 마커 프레임에 복수의 반사체가 부착된 형태이고, 타입 B는 U자 형상의 마커 프레임에 복수의 반사체가 부 착된 형태이며, 타입 C는 기울어지고 4 개의 프레임 중 1개가 길게 연장된 형상의 마커 프레임에 복수의 반사체 가 부착된 형태일 수 있다. 도 10 및 도 11은 일 실시 예에 따른 마커 상태 판정 장치를 설명하기 위한 블록도들이다. 도 10을 참조하면, 일 실시 예에 따른 마커 상태 판정 장치는 마커 상태 판정 모듈, 마커 상태 알림 모듈 및 마커 타입 판단 모듈을 포함할 수 있다. 도시되지는 않았으나, 마커 상태 판정 장치는 도 2와 관련하여 전술한 마커 이미지 제공 모듈 및 학습 모듈을 더 포함할 수 있다. 마커 타입 판단 모듈은, 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지 및 제1 인공지능 모델 (M10)을 이용하여 마커의 마커 타입을 판단할 수 있다. 제1 인공지능 모델(M10)은 마커의 바이너리 이미지를 입력 받고 마커 타입을 예측하여 출력할 수 있다. 이 를 위해, 제1 인공지능 모델(M10)은, 학습 모듈에 의해, 바이너리 이미지 형태의 학습 데이터를 이용하여 학습된 것일 수 있다. 구체적으로, 학습 모듈은 마커의 바이너리 이미지에 나타난 복수의 반사체의 배열에 따라 마커의 타입을 타입 A, 타입 B, 타입 C 등으로 예측할 수 있도록 인공지능 모델(M10)을 학습시 킬 수 있다. 인공지능 모델(M10)은 인공 신경망 또는 심층 신경망을 포함하며, 신경망을 이루는 뉴런들은 학습 모듈에 의해 학습을 수행할 수 있다. 이에 따라, 마커 타입 판단 모듈은, 제1 인공지능 모델(M10)을 이용하여 마커의 마커 타입을 예측할 수 있고, 예측한 마커 타입에 관한 정보를 마커 상태 판정 모듈에 제공할 수 있다. 마커 상태 판정 모듈은, 마커 타입 판단 모듈로부터 제공되는 마커 타입에 기초하여 복수의 제2 인공 지능 모델(M20) 중 마커 타입에 대응하는 제2 인공지능 모델을 선택하고, 바이너리 이미지 및 선택한 제2 인공 지능 모델을 이용하여 마커의 상태를 판정할 수 있다. 예를 들어, 복수의 제2 인공지능 모델(M20)은, 입력되는 바이너리 이미지로부터 타입 A에 해당하는 마커의 상태를 예측하여 출력하도록 학습된 타입 A 모델(M21), 입력되는 바이너리 이미지로부터 타입 B에 해당하는 마 커의 상태를 예측하여 출력하도록 학습된 타입 B 모델(M22) 및 입력되는 바이너리 이미지로부터 타입 C에 해당하는 마커의 상태를 예측하여 출력하도록 학습된 타입 C 모델(M23)을 포함할 수 있다. 그리고 마커 타 입 판단 모듈이 바이너리 이미지 및 제1 인공지능 모델(M10)을 이용하여 예측한 마커 타입이 타입 C일 수 있다. 이 경우, 마커 상태 판정 모듈은, 복수의 제2 인공지능 모델(M20) 중 타입 C에 대응하는 제2 인공지능 모 델, 즉 타입 C 모델(M23)을 선택하고, 바이너리 이미지 및 선택한 제2 인공지능 모델을 이용하여 마커의 상태를 판정할 수 있다.이후, 마커 상태 알림 모듈은 타입 C 마커의 비정상 상태 알림을 송출하거나, 제2 인공지능 모델을 통해 예측하거나 반사체들 사이의 거리를 기반으로 연산하여 예측한 반사체 위치 예측 결과를 네비게이션 수술용 소 프트웨어의 실행 화면에 표시할 수 있으며, 이에 대한 상세한 내용에 대해서는 도 1 내지 도 8과 관련하여 상술 한 설명을 참조할 수 있다. 이어서 도 11을 참조하면, 수술 중 사용되는 마커가 복수 개이고 추적 대상이 되는 마커가 다른 형태의 마커로 변경되거나, 수술 중 사용되던 마커가 다른 형태의 마커로 교체되는 등의 이유로, 마커 타 입 판단 모듈이 바이너리 이미지 및 제1 인공지능 모델(M10)을 이용하여 예측한 마커 타입이 타입 B로 변 경될 수 있다. 이 경우, 마커 상태 판정 모듈은, 복수의 제2 인공지능 모델(M20) 중 타입 B에 대응하는 제2 인공지능 모 델, 즉 타입 B 모델(M22)을 선택하고, 바이너리 이미지 및 선택한 제2 인공지능 모델을 이용하여 마커의 상태를 판정할 수 있다. 이후, 마커 상태 알림 모듈은 타입 B 마커의 비정상 상태 알림을 송출하거나, 제2 인공지능 모델을 통해 예측하거나 반사체들 사이의 거리를 기반으로 연산하여 예측한 반사체 위치 예측 결과를 네비게이션 수술용 소 프트웨어의 실행 화면에 표시할 수 있으며, 이에 대한 상세한 내용에 대해서는 도 1 내지 도 8과 관련하여 상술 한 설명을 참조할 수 있다. 도 12는 일 실시 예에 따른 마커 상태 판정 방법을 설명하기 위한 순서도이다. 도 12를 참조하면, 일 실시 예에 따른 마커 상태 판정 방법은, 단계(S1201)에서 네비게이션 수술용 소프트웨어 를 구동할 수 있다. 그리고 사용자는 마커 및 적외선 카메라를 통해 추적되는 환부 및 수술 도구의 위 치 및 자세 데이터를 이용하여 수술을 진행할 수 있다. 상기 방법은, 단계(S1203)에서 제1 인공지능 모델(M10)에 마커 이미지를 입력할 수 있다. 여기서 마커 이미지 는 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지일 수 있다. 상기 방법은, 단계(S1205)에서 바이너리 이미지 및 제1 인공지능 모델(M10)을 이용하여 마커의 타입을 판단 할 수 있다. 그리고 마커 타입에 기초하여 복수의 제2 인공지능 모델 중 해당 마커 타입에 대응하는 제2 인공 지능 모델을 선택할 수 있다. 상기 방법은, 단계(S1207)에서, 선택한 제2 인공지능 모델에 마커 이미지를 입력할 수 있다. 여기서 마커 이미 지는 적외선 카메라를 통해 촬영한 마커의 바이너리 이미지일 수 있다. 상기 방법은, 단계(S1209)에서 바이너리 이미지 및 선택한 제2 인공지능 모델을 이용하여 해당 타입의 마커(2 0)의 상태를 판정할 수 있다. 마커의 상태가 비정상인 것으로 판정된 경우, 상기 방법은 단계(S1211)로 진 행하여 마커의 비정상 상태 알림을 송출할 수 있다. 또한, 상기 방법은 마커의 비정상 상태가 정상 상 태로 복원될 때까지 단계(S1207, S1209, S1211)을 반복 수행할 수 있다. 한편, 단계(S1209)에서 마커의 상태가 정상인 것으로 판정된 경우(비정상 상태였다가 정상 상태로 복원된 경우 포함), 상기 방법은 단계(S1213)로 진행하여, 네비게이션 수술용 소프트웨어의 실행 화면에 마커가 비 정상 상태인 것으로 판정되기 전에 수행되던 수술에 대한 정보를 다시 표시할 수 있다. 도 13은 일 실시 예에 따른 마커 상태 판정 장치를 설명하기 위한 블록도이다. 도 13을 참조하면, 일 실시 예에 따른 마커 상태 판정 장치는 마커 상태 판정 모듈, 마커 상태 알림 모듈, 마커 이미지 제공 모듈, 학습 모듈 외에 버퍼 및 검증 모듈을 더 포함할 수 있 다. 마커 상태 판정 모듈, 마커 상태 알림 모듈, 마커 이미지 제공 모듈 및 학습 모듈에 대해서는 도 1 내지 도 12와 관련하여 전술한 설명을 참조할 수 있으므로, 여기서는 버퍼 및 검증 모듈 에 대해 주로 설명하도록 한다. 버퍼는 인공지능 모델(M1)을 통해 획득되는 마커의 상태 데이터를 미리 정해진 개수 이상 수집할 수 있다. 이를 위해, 마커 상태 판정 모듈은, 마커 이미지 제공 모듈로부터 제공되는 바이너리 이미지 및 인공지능 모델(M1)을 이용하여 판정한 마커의 상태를 마커 상태 알림 모듈에 전달하지 않고, 버퍼 에 저장할 수 있다. 검증 모듈은 버퍼를 분석하여, 인공지능 모델(M1)을 통해 판정된 마커의 비정상 상태를 검증할 수 있다. 몇몇 실시 예에서, 검증 모듈은, 미리 정해진 시간 구간에서, 비정상 상태로 판정된 상태 데이터 대비 정 상 상태로 판정된 상태 데이터의 비율이 미리 정해진 비율을 초과하는 경우, 마커가 비정상 상태인 것으로 검증할 수 있다. 예를 들어, 1초의 시간 구간에서, 미리 정해진 비율이 3:1 이라면, 동일한 마커에 대해 비정상 상태로 판정 된 상태 데이터 대비 정상 상태로 판정된 데이터의 비율이 4:1인 경우에는 마커가 비정상 상태인 것으로 검 증하지만, 2:1 또는 1:1 인 경우에는 마커가 일시적으로 지나가는 다른 물체에 의해 가려졌거나 다른 상황 으로 인해 비정상 상태인 것으로 일시적으로 나타났을 뿐 실제로는 정상 상태에 있음을 가정할 수 있다. 이러 한 경우를 고려하여, 마커가 비정상 상태인 것으로 단정하지 않고 상태 데이터를 추가로 수집하여 비정상 상태로 결론 내릴 수 있을 때까지 정상 상태를 유지할 수 있다. 다른 몇몇 실시 예에서, 검증 모듈은, 미리 정해진 시간 구간에서 비정상 상태로 판정된 상태 데이터가 미 리 정해진 개수 이상 연속되는 경우, 마커가 비정상 상태인 것으로 검증할 수 있다. 예를 들어, 1초의 시간 구간에서, 미리 정해진 개수가 8이라면, 동일한 마커에 대해 비정상 상태로 판정된 상태 데이터가 8 개 이상 연속되는 경우에는 마커가 비정상 상태인 것으로 검증하지만, 7 개 이하인 경우에 는 마커가 일시적으로 지나가는 다른 물체에 의해 가려졌거나 다른 상황으로 인해 비정상 상태인 것으로 일 시적으로 나타났을 뿐 실제로는 정상 상태에 있음을 가정할 수 있다. 이러한 경우를 고려하여, 마커가 비 정상 상태인 것으로 단정하지 않고 상태 데이터를 추가로 수집하여 비정상 상태로 결론 내릴 수 있을 때까지 정 상 상태를 유지할 수 있다. 이와 같이 검증 모듈에 설정되는 비정상 상태로 판정된 상태 데이터 대비 정상 상태로 판정된 상태 데이터 의 비율을 산정하기 위한 미리 정해진 시간 구간 및 미리 정해진 비율, 그리고 비정상 상태로 판정된 상태 데이 터가 미리 정해진 개수 이상 연속되는지 판단하기 위한 미리 정해진 시간 구간 및 미리 정해진 개수 등의 값은, 마커 이미지 제공 모듈이 바이너리 이미지를 제공하는 프레임 레이트를 고려하여 결정될 수 있다. 예를 들어, 마커 이미지 제공 모듈이 초당 10 프레임으로 바이너리 이미지를 제공하는 경우와 초당 30 프레임으 로 바이너리 이미지를 제공하는 경우 상기 값들은 다르게 설정될 수 있다. 도 14는 일 실시 예에 따른 마커 상태 판정 방법을 설명하기 위한 순서도이다. 도 14를 참조하면, 일 실시 예에 따른 마커 상태 판정 방법은, 단계(S1401)에서 네비게이션 수술용 소프트웨어 를 구동할 수 있다. 그리고 사용자는 마커 및 적외선 카메라를 통해 추적되는 환부 및 수술 도구의 위 치 및 자세 데이터를 이용하여 수술을 진행할 수 있다. 상기 방법은, 단계(S1403)에서 인공지능 모델(M1)에 마커 이미지를 입력할 수 있다. 여기서 마커 이미지는 적 외선 카메라를 통해 촬영한 마커의 바이너리 이미지일 수 있다. 상기 방법은, 단계(S1405)에서 바이너리 이미지 및 인공지능 모델(M1)을 이용하여 예측한 마커의 상태를 예 측 결과로서 버퍼에 저장할 수 있고, 단계(S1407)에서 버퍼를 분석하여, 단계(S1409)에서 인공지능 모델(M1)을 통해 판정된 마커의 비정상 상태를 검증함으로써 최종적으로 정상 또는 비정상의 결론을 도출할 수 있다. 마커의 상태가 최종적으로 비정상인 것으로 판정된 경우, 상기 방법은 단계(S1411)로 진행하여 마커의 비정상 상태 알림을 송출할 수 있다. 또한, 상기 방법은 마커의 비정상 상태가 정상 상태로 복원될 때까지 단계(S1407, S1409, S1411)을 반복 수행할 수 있다. 한편, 단계(S1409)에서 마커의 상태가 정상인 것으로 판정된 경우(비정상 상태였다가 정상 상태로 복원된 경우 포함), 상기 방법은 단계(S1413)로 진행하여, 네비게이션 수술용 소프트웨어의 실행 화면에 마커가 비 정상 상태인 것으로 판정되기 전에 수행되던 수술에 대한 정보를 다시 표시할 수 있다. 도 15는 일 실시 예에 따른 컴퓨팅 장치를 설명하기 위한 블록도이다. 도 15를 참조하면, 실시 예들에 따른 마커 상태 판정 장치 및 방법은 컴퓨팅 장치를 이용하여 구현될 수 있 다. 컴퓨팅 장치는 버스를 통해 통신하는 프로세서, 메모리, 저장 장치, 디스플레이 장치 , 다른 개체와의 통신을 위해 네트워크에 대한 접속을 제공하는 네트워크 인터페이스 장치 및,사용자 입력 인터페이스 또는 사용자 출력 인터페이스를 제공하는 입출력 인터페이스 장치 중 적어도 하나 를 포함할 수 있다. 물론, 컴퓨터 장치는 도 15에 도시되지 않았지만, 본 명세서에 기재된 기술적 사상을 구현하기 위해 필요한 임의의 전자 장치를 추가로 포함할 수 있다. 프로세서는 AP(Application Processor), CPU(Central Processing Unit), GPU(Graphic Processing Unit), NPU(Neural Processing Unit) 등과 같은 다양한 종류들로 구현될 수 있으며, 메모리 또는 저장 장 치에 저장된 프로그램 또는 명령을 실행하는 임의의 전자 장치일 수 있다. 특히, 프로세서는 도 1 내지 도 14와 관련하여 전술한 기능 또는 방법들을 구현하도록 구성될 수 있으며, 실시 예들에 따른 마커 상태 판정 장치 및 방법과 관련하여 인공지능에 특화된 연산은 GPU 또는 NPU 상에서 처리될 수 있다. 메모리 및 저장 장치는 다양한 형태의 휘발성 또는 비 휘발성 저장 매체를 포함할 수 있다. 예를 들 어, 메모리는 ROM(read-only memory) 또는 RAM(random access memory)을 포함할 수 있으며, 메모리 는 프로세서의 내부 또는 외부에 위치할 수 있고, 이미 알려진 다양한 수단을 통해 프로세서와 연결 될 수 있다. 한편, 저장 장치의 예로서 HDD(Hard Disk Drive) 또는 SSD(Solid State Drive) 등을 들 수 있으며, 본 발명의 범위는 설명을 위해 위에서 나열한 요소들로 제한되는 것은 아니다. 실시 예들에 따른 마커 상태 판정 장치 및 방법 중 적어도 일부는 컴퓨팅 장치에서 실행되는 프로그램 또는 소프트웨어로 구현될 수 있고, 이와 같은 프로그램 또는 소프트웨어는 컴퓨터로 판독 가능한 매체에 저장될 수 있다. 한편, 실시 예들에 따른 마커 상태 판정 장치 및 방법 중 적어도 일부는 컴퓨팅 장치의 하드웨어를 사용하 여 구현되거나, 컴퓨팅 장치와 전기적으로 접속될 수 있는 별도의 하드웨어로 구현될 수도 있다. 이제까지 설명한 실시 예들에 따르면, 수술이 진행되는 동안 사용자가 마커를 계속 주시할 필요가 없이 마커에 이물질이 부착된 상태 또는 마커가 손상된 상태를 인지하거나, 비정상 상태의 마커가 정상 상태로 복원된 경우 를 인지할 수 있어서, 수술 편의성이 증대되고, 비정상 상태를 실시간으로 즉각 검출할 수 있을 뿐 아니라 마커 를 정상 상태로 복원시키기 전에 이물질에 가려진 반사체의 위치를 예측하여 제공함으로써 수술 정확도 역시 개 선되어 수술 결과 및 예후를 향상시킬 수 있다. 이상에서 본 발명의 실시 예들에 대하여 상세하게 설명하였지만 본 발명의 권리 범위는 이에 한정되지 않으며, 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한, 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자의 여러 변형 및 개량 형태 또한 본 발명의 권리 범위에 속한다."}
{"patent_id": "10-2022-0055776", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 네비게이션 수술용 시스템을 설명하기 위한 개념도이다. 도 2는 일 실시 예에 따른 마커 상태 판정 장치를 설명하기 위한 블록도이다. 도 3은 일 실시 예에 따른 마커 상태 판정 방법을 설명하기 위한 순서도이다. 도 4는 일 실시 예에 따른 마커를 설명하기 위한 도면이고, 도 5는 일 실시 예에 따른 마커 이미지를 설명하기 위한 도면이다. 도 6 내지 도 8은 일 실시 예에 따른 네비게이션 수술용 소프트웨어의 실행 화면을 나타낸 도면들이다. 도 9는 일 실시 예에 따른 마커를 설명하기 위한 도면이다. 도 10 및 도 11은 일 실시 예에 따른 마커 상태 판정 장치를 설명하기 위한 블록도들이다. 도 12는 일 실시 예에 따른 마커 상태 판정 방법을 설명하기 위한 순서도이다.도 13은 일 실시 예에 따른 마커 상태 판정 장치를 설명하기 위한 블록도이다. 도 14는 일 실시 예에 따른 마커 상태 판정 방법을 설명하기 위한 순서도이다. 도 15는 일 실시 예에 따른 컴퓨팅 장치를 설명하기 위한 블록도이다."}
