{"patent_id": "10-2021-0035759", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0130913", "출원번호": "10-2021-0035759", "발명의 명칭": "트레킹 데이터를 이용한 온라인 콘텐츠 플랫폼", "출원인": "김성은", "발명자": "김성은"}}
{"patent_id": "10-2021-0035759", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "본 명세서는 소비자의 검색 데이터를 기반으로 소비자가 빈도 높게 검색하는 전통 장신구 상품의 유형, 가격,해당 상품이 가지고 있는 고유한 기능 및 속성에 대한 정보를 트레킹하는 단계; 트레킹한 데이터를 인공지능 데이터 분석 엔진 시스템이 분석 처리하여 소비자들의 수요에 대한 데이터 모델을 각 상품 항목별로 산출하는 단계; 산출된 각 결과 데이터 모델에 따라 항목별 상품에 대한 큐레이션이 구성되는 단계; 상기 콘텐츠 상품들이온라인 플랫폼을 통해 소비자들에게 디스플레이되는 단계; 를 포함하는 트레킹 데이터를 이용한 온라인 콘텐츠플랫폼을 설명한다."}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 소비자 트레킹 데이터를 활용한 온라인 플랫폼 기반 상품별 큐레이션 콘텐츠 생성 시스템에 관한 것으 로, 보다 상세하게는 온라인 사이트를 통한 소비자 데이터 트레킹 작업을 통해 소비자들의 수요를 파악하고 타깃 소비자를 기준으로 온라인 플랫폼에서 경쟁력이 있는 상품별 큐레이션 콘텐츠를 생성하고 이를 디스플레이 제공 하는 방법에 대한 것이다"}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소비자에 대해 트레킹 데이터를 형성하고 상기 데이터를 기반으로 온라인 판매 플랫폼에서 소비자들 에게 제공할 상품 큐레이션 콘텐츠를 생성하고 이를 디스플레이 제공하는 방법 및 프로세스에 관한 것이다."}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소비자의 기본 정보(나이, 성별 등)과 소비자가 주로 찾는 장신구에 대한 정보를 트레킹하여 상기 데이터를 기 반으로 소비자가 구매 및 대여를 고민할 때 필요 요소들을 도출하고 나열하여 상품에 대한 큐레이션을 구성할 수 있도록 하여 이에 대한 결과 값을 소비자 디스플레이에 제공할 수 있도록 하는데 목적이 있다."}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 소비자들이 온라인 쇼핑 플랫폼을 통해 전통 장신구를 대여 혹은 구매할 때 고려하는 주된 항 목들, 이를 구매하는 소비자의 연령 및 성별과 같은 기본 개인 정보를 트레킹하여 소비자들의 상품 선택 및 구 매(혹은 대여)을 돕는 데에 있다. 온라인 플랫폼을 활용하여 판매 제공하는 상품들은 이미 다양한 온라인 판매 플랫폼이 많아 소비자들의 수요 파악과 그에 맞는 상품 배치 및 효과적인 큐레이션 제공이 필요하다. 이에 따라 상기한 발명의 실시 예는 소비자들의 수요에 맞는 상품을 찾을 수 있도록 이에 맞는 트레킹 데이터 기반 콘텐츠들을 생성함으로 상기한 과제를 해결할 수 있도록 한다."}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예는 소비자의 기본 정보를 수집하는 단계; 상기 기본 정보는 타깃 소비자의 수요가 무엇인지 분석 및 연령별, 국가별 등 상품에 대한 선호도를 파악하기 위함이다. 소비자의 검색 데이터를 기반으로 소비자가 빈도 높게 검색하는 전통 장신구 상품의 유형, 가격, 해당 상품이 가지고 있는 고유한 기능 및 속성에 대한 정보를 트레킹하는 단계; 트레킹한 데이터를 인공지능 데이터 분석 엔 진 시스템이 분석 처리하여 소비자들의 수요에 대한 데이터 모델을 각 상품 항목별로 산출하는 단계; 산출된 각 결과 데이터 모델에 따라 항목별 상품에 대한 큐레이션이 구성되는 단계; 상기 콘텐츠 상품들이 온라인 플랫폼 을 통해 소비자들에게 디스플레이되는 단계; 를 포함한다."}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 효과는 온라인 트레킹을 활용하여 소비자에게 제공되면 소비자는 보다 편리하게 제품을 선택할 수 있 으며 만족도를 극대화 시킬 수 있다."}
{"patent_id": "10-2021-0035759", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "첨부한 도 1을 참조하여 트레킹 데이터를 이용한 온라인 콘텐츠 플랫폼에 대해 설명한다. 소비자 데이터 트레킹 작업을 수행하기 위해 트레커는 온라인 사이트(S1)을 통해 소비자들의 성별과 연령, 지역 항목을 기준으로 트레킹해야 할 소비자 기본 정보를 설정해야 한다. 또한, 소비자는 상기 내용을 입력하여 정보 가 저장될 수 있도록 한다. 즉, 회원정보(S2)를 입력하여 상기 정보를 데이터베이스(D1)에 저장할 수 있도록 해 야한다. 트레커는 해당 정보를 먼저 트레킹하고 해당 기본 정보 항목을 기준으로 분류된 소비자마다 자주 검색하는 상품 의 유형 데이터를 트레킹(T1)한다. 상기한 과정을 통해 수집된 트레킹 데이터는 소비자들이 구매하고자 하는 특 정 타깃 상품에 대한 수요를 파악하고 소비자 수요에 맞는 타깃 상품들의 품목과 속성을 포함한 관련 정보를 그 룹 트레킹하여 데이터 트레킹 및 수집 단계 이후 트레킹(T1)한 데이터가 소비자의 연령, 성별, 지역별로 그룹화 (D2)될 수 있도록 한다. 그룹화된 데이터는 이후 소비자들이 판매자가 선정한 상품을 구매하기 위한 과정에서 소비자들에게 디스플레이 제공되는 상품별 큐레이션 콘텐츠를 구성하는 작업에 있어 활용된다."}
{"patent_id": "10-2021-0035759", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 트레킹 데이터를 이용한 온라인 콘텐츠 플랫폼을 형성하는 과정을 나타내는 도면이다."}
