{"patent_id": "10-2021-0093968", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0011100", "출원번호": "10-2021-0093968", "발명의 명칭": "얼굴 이미지 검색을 통한 가상 인물 생성 시스템 및 방법", "출원인": "펄스나인 주식회사", "발명자": "박지은"}}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "외부로부터 2D 이미지를 입력받아 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이터베이스를 검색하여얼굴 랜드마크 기반 유사도 비교를 통해 유사한 이미지를 추출하는 이미지 검색부와;상기 이미지 검색부에 의해 추출된 이미지를 전송받아 그를 기반으로 새로운가상 인물을 생성하는 가상 인물 생성부; 및인공지능 기법을 기반으로 생성된 다양한 모습의 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이터베이스를 포함하는 얼굴 이미지 검색을 통한 가상 인물 생성 시스템."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 가상 인물 생성부는 전송받은 이미지를 기반으로 2D 및/또는 3D 가상 인물을 생성하는 얼굴 이미지 검색을통한 가상 인물 생성 시스템."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 원하는 가상 인물의 특징을 만족하는 2D및/또는 3D 가상 인물을 생성하는 얼굴 이미지 검색을 통한 가상 인물 생성 시스템."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 다양한 눈 크기, 얼굴의 상하좌우 각도와, 슬픔, 기쁨, 화남 중 적어도 하나를 포함하는 감정의 정도가 표현된 가상 인물을 생성하는 얼굴 이미지 검색을 통한 가상 인물 생성 시스템."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 가상 인물 생성부에 의해 생성된 가상 인물은 다양한 각도로 2D 또는 3D 렌더링이 가능하도록 구성된 얼굴이미지 검색을 통한 가상 인물 생성 시스템."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 이미지 데이터베이스는 빠른 검색을 위한 목업 부분과, 실제 고화질 활용을 위한 로우(raw) 부분으로 구성된 얼굴 이미지 검색을 통한 가상 인물 생성 시스템.공개특허 10-2022-0011100-3-청구항 7 제6항에 있어서,상기 로우(raw) 부분은 유연한 고객 맞춤형을 위해 잠재 벡터(latent vector) 형태로 구성된 얼굴 이미지 검색을 통한 가상 인물 생성 시스템."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "a) 컴퓨터 시스템에 의해 인공지능 기법을 기반으로 다양한 모습의 가상 캐릭터 얼굴 이미지를 생성하여 이미지데이터베이스에 저장하는 단계와;b) 이미지 검색부에 의해 외부로부터 2D 이미지를 입력받아 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지데이터베이스를 검색하는 단계와;c) 상기 이미지 검색부에 의해 얼굴 랜드마크 기반 유사도 비교를 통해 이미지 데이터베이스로부터 유사한 이미지를 추출하는 단계; 및d) 가상 인물 생성부가 상기 이미지 검색부에 의해 추출된 이미지를 전송받아 그를 기반으로 새로운 가상 인물을 생성하는 단계를 포함하는 얼굴 이미지 검색을 통한 가상 인물 생성 방법."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8항에 있어서,상기 단계 d)에서 상기 가상 인물 생성부는 전송받은 이미지를 기반으로 2D 및/또는 3D 가상 인물을 생성하는얼굴 이미지 검색을 통한 가상 인물 생성 방법."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 원하는 가상 인물의 특징을 만족하는 2D및/또는 3D 가상 인물을 생성하는 얼굴 이미지 검색을 통한 가상 인물 생성 방법."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 다양한 눈 크기, 얼굴의 상하좌우 각도와, 슬픔, 기쁨, 화남 중 적어도 하나를 포함하는 감정의 정도가 표현된 가상 인물을 생성하는 얼굴 이미지 검색을 통한 가상 인물 생성 방법."}
{"patent_id": "10-2021-0093968", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제8항에 있어서,상기 단계 d)에서 상기 가상 인물 생성부에 의해 생성된 가상 인물을 다양한 각도로 2D 또는 3D 렌더링하는 단계를 더 포함하는 얼굴 이미지 검색을 통한 가상 인물 생성 방법."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 얼굴 이미지 검색을 통한 가상 인물 생성 시스템 및 방법에 관한 것이다. 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 방법은, 컴퓨터 시스템에 의해 인공지능 기법을 기반으 로 다양한 모습의 가상 캐릭터 얼굴 이미지를 생성하여 이미지 데이터베이스에 저장하는 단계와; 이미지 검색부 (뒷면에 계속)"}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 가상 인물 생성 시스템 및 방법에 관한 것으로서, 더 상세하게는 가상 인물 데이터가 저장되어 있는 데이터베이스에 텍스트 또는 실제 인물 사진을 입력하면 텍스트 또는 실제 인물 사진과 유사한 가상 인물이 검 색되고, 검색된 가상 인물을 기반으로 새로운 가상 인물을 생성하는 얼굴 이미지 검색을 통한 가상 인물 생성 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 딥러닝(Deep learning)은 여러 비선형 변환기법의 조합을 통해 높은 수준의 추상화를 시도하는 기계 학습 알고리즘의 집합으로 정의되며, 큰 틀에서 사람의 사고 방식을 컴퓨터에게 가르치는 기계학습의 한 분야이 다. 어떠한 데이터가 있을 때 이를 컴퓨터가 인식할 수 있는 형태(예를 들면, 이미지의 경우 픽셀 정보를 열 벡터로 표현하는 툴)로 표현하고, 이를 학습에 적용하기 위해 많은 연구가 진행되고 있다. DNN(deep neural networks), CNN(convolutional neural network), RNN(recurrent neural network) 등과 같은 다양한 딥러닝 기법들이 음성 신호 처리, 자연 언어 처리, 이미지(영상) 처리 등의 분야에 적용되어 우수한 성 능의 응용프로그램들이 개발되고 있다. 한편, 사후 등 초상권이 만료된 유명인의 경우, 창작의 자유로운 소재가 되나 기존 사진을 활용하지 못하는 문 제가 있다. 초상권 제한은 없으나 사진기록 등 기록 콘텐츠에 대한 재산권의 제한이 있어 여전히 창작의 발전에 한계가 있다. 또한 가상 캐릭터 비즈니스에서 이상형 얼굴을 데이터를 기반으로 분석하거나 생성하지 못하는 문 제가 있다. 한국 공개특허공보 제10-2012-0130627호(특허문헌 1)에는 \"아바타를 이용한 애니메이션 생성 장치 및 방법\"이 개시되어 있는바, 이에 따른 아바타를 이용한 애니메이션 생성 장치는, 이차원 얼굴 영상으로부터 추출된 복수 개의 특징점들을 이용하여 표정의 변형이 가능한 매개변수 모델을 생성하고, 텍스트 데이터에서 추출된 특징 단 어와 상기 복수 개의 특징점들에 대응되는 표정 매개변수를 미리 저장된 데이터베이스에서 검색하는 모델 생성 부; 상기 텍스트 데이터에 포함된 단어의 음성학적 특성을 이용하여 상기 텍스트 데이터를 음성으로 표현할 때 상기 복수 개의 특징점들의 위치 변화를 나타내는 벡터를 생성하고, 상기 매개변수 모델에 상기 표정 매개변수 및 상기 벡터를 적용하여 상기 텍스트 데이터를 음성으로 표현하는 동안의 표정 변화를 반영한 애니메이션을 생 성하는 애니메이션 생성부; 및 가상공간에서 상기 이차원 얼굴 영상에 대응되는 아바타를 이용하여 상기 애니메 이션을 출력하는 출력부를 포함하는 것을 특징으로 한다. 이와 같은 특허문헌 1의 경우, 하나의 이차원 영상과 텍스트를 이용하여 가상공간에서 사용자들을 대신하는 아 바타를 통해 애니메이션을 합성할 수 있는 효과가 있으나, 가상 캐릭터 비즈니스에서 이상형 얼굴을 데이터를 기반으로 분석하거나 생성하지는 못하는 문제점을 내포하고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개특허공보 제10-2012-0130627호(2012.12.03.)"}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 이상과 같은 사항을 종합적으로 감안하여 창출된 것으로서, 가상인물 데이터가 저장되어 있는 데이터 베이스에 텍스트 또는 실제 인물 사진을 입력하면 텍스트 또는 실제 인물 사진과 유사한 가상 인물이 검색되고, 검색된 가상 인물을 기반으로 새로운 가상 인물을 생성하는 얼굴 이미지 검색을 통한 가상 인물 생성 시스템 및 방법을 제공함에 그 목적이 있다."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 목적을 달성하기 위하여 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 시스템은, 외부로부터 2D 이미지를 입력받아 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이터베이스를 검색하여 얼굴 랜드마크 기반 유사도 비교를 통해 유사한 이미지를 추출하는 이미지 검색부와; 상기 이미지 검색부에 의해 추출된 이미지를 전송받아 그를 기반으로 새로운 가상 인물을 생성하는 가상 인물 생성부; 및 인공지능 기법을 기반으로 생성된 다양한 모습의 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이터베이 스를 포함하는 점에 그 특징이 있다. 여기서, 상기 가상 인물 생성부는 전송받은 이미지를 기반으로 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 원하는 가상 인물의 특징을 만족 하는 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 또한 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 다양한 눈 크기, 얼굴의 상 하좌우 각도와, 슬픔, 기쁨, 화남 등 감정의 정도가 표현된 가상 인물을 생성할 수 있다. 또한, 상기 가상 인물 생성부에 의해 생성된 가상 인물은 다양한 각도로 2D 또는 3D 렌더링이 가능하도록 구성 될 수 있다. 또한, 상기 이미지 데이터베이스는 빠른 검색을 위한 목업 부분과, 실제 고화질 활용을 위한 로우(raw) 부분으 로 구성될 수 있다. 이때, 상기 로우(raw) 부분은 유연한 고객 맞춤형을 위해 잠재 벡터(latent vector) 형태로 구성될 수 있다. 또한, 상기의 목적을 달성하기 위하여 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 방법은, a) 컴퓨터 시스템에 의해 인공지능 기법을 기반으로 다양한 모습의 가상 캐릭터 얼굴 이미지를 생성하여 이미지 데이터베이스에 저장하는 단계와; b) 이미지 검색부에 의해 외부로부터 2D 이미지를 입력받아 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이터베이스를 검색하는 단계와; c) 상기 이미지 검색부에 의해 얼굴 랜드마크 기반 유사도 비교를 통해 이미지 데이터베이스로부터 유사한 이미 지를 추출하는 단계; 및 d) 가상 인물 생성부가 상기 이미지 검색부에 의해 추출된 이미지를 전송받아 그를 기반으로 새로운 가상 인물 을 생성하는 단계를 포함하는 점에 그 특징이 있다. 여기서, 상기 단계 d)에서 상기 가상 인물 생성부는 전송받은 이미지를 기반으로 2D 및/또는 3D 가상 인물을 생 성할 수 있다. 이때, 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 원하는 가상 인물의 특징을 만족 하는 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 또한 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 다양한 눈 크기, 얼굴의 상 하좌우 각도와, 슬픔, 기쁨, 화남 등 감정의 정도가 표현된 가상 인물을 생성할 수 있다. 또한, 상기 단계 d)에서 상기 가상 인물 생성부에 의해 생성된 가상 인물을 다양한 각도로 2D 또는 3D 렌더링하 는 단계를 더 포함할 수 있다."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "이와 같은 본 발명에 의하면, 가상인물 데이터가 저장되어 있는 데이터베이스에 텍스트 또는 실제 인물 사진을 입력하여 텍스트 또는 실제 인물 사진과 유사한 가상 인물을 검색하고, 검색된 가상 인물을 기반으로 새로운 가 상 인물을 생성함으로써, 종래의 캐릭터 비즈니스의 문제를 보완하고, 인공지능 얼굴 이미지 생성 시스템을 활 용하여 가상 캐릭터 비즈니스의 자유도를 높일 수 있는 장점이 있다."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 명세서 및 청구범위에 사용된 용어나 단어는 통상적이거나 사전적인 의미로 한정되어 해석되지 말아야 하며, 발명자는 그 자신의 발명을 가장 최선의 방법으로 설명하기 위해 용어의 개념을 적절하게 정의할 수 있다는 원 칙에 입각하여 본 발명의 기술적 사상에 부합하는 의미와 개념으로 해석되어야 한다. 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다 른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 또한, 명세서에 기 재된 \"…부\", \"…기\", \"모듈\", \"장치\" 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어 또는 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 이하 첨부된 도면을 참조하여 본 발명의 실시예를 상세히 설명한다. 도 1은 본 발명의 실시예에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 시스템의 구성을 개략적으로 나타낸 도면이다. 도 1을 참조하면, 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 시스템은 이미지 검색부, 가상 인물 생성부 및 이미지 데이터베이스를 포함하여 구성된다. 이미지 검색부는 외부로부터 2D 이미지를 입력받아 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이 터베이스를 검색하여, 도 3의 (B), (C), (D)와 같은 얼굴 랜드마크를 기반으로 유사도 비교를 통해 유사한 이미지를 추출한다. 가상 인물 생성부는 상기 이미지 검색부에 의해 추출된 이미지를 전송받아 그를 기반으로 새로운 가 상 인물을 생성한다. 이미지 데이터베이스에는 인공지능 기법을 기반으로 생성된 다양한 모습의 가상 캐릭터 얼굴 이미지가 저 장되어 있다. 여기서, 상기 가상 인물 생성부는 전송받은 이미지를 기반으로 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 원하는 가상 인물의 특징을 만족하는(예를 들면, 눈동자, 머리카락, 피부 등의 색과 표현에 대하여 고객 맞춤형으로) 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 또한 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 다양한 눈 크기, 얼굴 의 상하좌우 각도와, 슬픔, 기쁨, 화남 등 감정의 정도가 표현된 가상 인물을 생성할 수 있다. 또한, 상기 가상 인물 생성부에 의해 생성된 가상 인물은 다양한 각도로 2D 또는 3D 렌더링이 가능하도록 구성될 수 있다. 또한, 상기 이미지 데이터베이스는 빠른 검색을 위한 목업 부분과, 실제 고화질 활용을 위한 로우 (raw) 부분으로 구성될 수 있다. 여기서, 목업 부분에 저장되어 있는 목업 데이터는 얼굴 랜드마크 기반 유사도 판정시 로우 데이터가 지나치게 큰 용량이어서 유사도 계산시 컴퓨팅 자원의 절약 및 시간의 절약 을 위해 사용한다. 로우(raw) 부분에 저장되어 있는 로우 데이터는 손실이 되지 않은 무손실 이미지 데이 터이다. 목업 데이터에는 얼굴 랜드마크가 저장되어 있고, 랜드마크의 종류는 여러 가지이며, 예를 들면 도 3의 (B), (C), (D)와 같은 종류가 있을 수 있다. 이때, 상기 로우(raw) 부분은 유연한 고객 맞춤형을 위해 잠재 벡터 (latent vector) 형태로 구성될 수 있 다.여기서, 또한 이상과 같은 이미지 검색부, 가상 인물 생성부 및 이미지 데이터베이스는 전체적 으로 하나의 컴퓨터 시스템으로 통합되어 구성될 수도 있다. 그러면, 이하에서는 이상과 같은 구성을 가지는 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 시스 템을 바탕으로 한 얼굴 이미지 검색을 통한 가상 인물 생성 방법에 대하여 설명해 보기로 한다. 도 2는 본 발명의 실시예에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 방법의 실행 과정을 나타낸 흐름도이 다. 도 2를 참조하면, 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 방법에 따라, 먼저 컴퓨터 시스템 (미도시)에 의해 인공지능 기법을 기반으로 다양한 모습의 가상 캐릭터 얼굴 이미지를 생성하여 이미지 데이터 베이스에 저장한다(단계 S201). 이때, \"StyleGAN2\" 등의 생성 모델(generative model)을 이용하여 가상 인물 이미지(가상 캐릭터 얼굴 이미지)를 생성하여 이미지 데이터베이스에 저장할 수 있다. 이후, 이미지 검색부에 의해 외부로부터 2D 이미지를 입력받아 가상 캐릭터 얼굴 이미지가 저장되어 있는 이미지 데이터베이스를 검색한다(단계 S202). 여기서, 이미지 검색부에 입력되는 소스는 2D 이미지로 한정되는 것은 아니며, 경우에 따라서는 텍스트(키워드)(예를 들면, 30대, 여자, 계란형, 고양이상)가 입력될 수도 있다. 이와 같은 텍스트(키워드)에 의한 검색에 대해서는 뒤에서 다시 설명하기로 한다. 이렇게 하여 이미지 검색부가 이미지 데이터베이스를 검색한 후,이미지 검색부는 얼굴 랜드마크 기반 유사도 비교를 통해 이미지 데이터베이스로부터 유사한 이미지를 추출한다(단계 S203). 여기서, 만일 이미지 검색부에 2D 이미지가 아닌 텍스트(키워드)(예를 들면, 30대, 여자, 계란형, 고양이상)가 입력된 경우에는, 이미지 검색부는 유사도 비교를 통해 이미지 데이터베이스로부터 유사한 이미지를 추출하 지 않는다. 이때는 대신 위와 같은 특정 텍스트(키워드)(30대, 여자, 계란형, 고양이상)에 대하여 미리 작성하 여 데이터베이스에 저장해 놓은 일종의 룩업 테이블(look-up table)과 같은 하나의 기준 테이블을 검색하 여 유사한 이미지를 추출하게 된다. 상기 단계 S203에서 유사한 이미지의 추출이 완료되면, 가상 인물 생성부가 상기 이미지 검색부에 의 해 추출된 이미지를 전송받아 그를 기반으로 새로운 가상 인물을 생성한다(단계 S204). 여기서, 상기 가상 인물 생성부는 전송받은 이미지를 기반으로 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 원하는 가상 인물의 특징을 만족하는(예를 들면, 눈동자, 머리카락, 피부 등의 색과 표현에 대하여 고객 맞춤형으로) 2D 및/또는 3D 가상 인물을 생성할 수 있다. 이때, 또한 상기 가상 인물 생성부는 2D 및/또는 3D 가상 인물을 생성함에 있어서, 다양한 눈 크기, 얼굴 의 상하좌우 각도와, 슬픔, 기쁨, 화남 등 감정의 정도가 표현된 가상 인물을 생성할 수 있다. 또한, 상기 가상 인물 생성부에 의해 생성된 가상 인물을 다양한 각도로 2D 또는 3D 렌더링하는 단계를 더 포함할 수 있다. 이상과 같은 일련의 과정에서, 상기 단계 S202에서의 이미지 검색부에 의해 이미지 데이터베이스를 검색하는 것과 관련하여 조금 더 설명을 부가해 보기로 한다. 먼저, 이미지 데이터베이스에서 실제 얼굴 이미지를 이용한 검색 방법에 대해 설명해 보기로 한다. 이 검색 방법을 위해 \"StyleGAN2\" 등의 생성 모델(generative model)을 이용하여 생성한 가상 인물 이미지가 이 미지 데이터베이스에 저장되어 있는 것으로 가정한다. 이 이미지 데이터 베이스에는 전술한 바와 같 은 로우(raw) 데이터와 목업(mock up) 데이터 형태가 모두 저장되어 있다. 목업 데이터에는 얼굴 랜드마크도 저 장되어 있다. 사용자(고객)가 실제 사람 얼굴이 들어간 얼굴 이미지를 입력하면, 이미지 검색부는 이미지 데이터베이스 를 검색한 후, 얼굴의 랜드마크를 PRNet 등의 알고리즘을 통해 추출한다. 여기서, PRNet 알고리즘은 얼굴 3D 정보를 UV 맵핑을 통해 2D로 표현하는 알고리즘이다. 이와 같은 PRNet 알고리즘에 대해서는 논문 \"Y. Feng, F. Wu, X. Shao, Y. Wang, and X. Zhou. Joint 3D face reconstruction and dense alignment with position map regression network. In ECCV, 2018. 2, 3, 7\"에 자세히 설명되어 있으므로, 그것을 참고하는 것으로 갈음 하기로 하고, 본 명세서에서는 이에 대한 상세한 설명은 생략하기로 한다. 이미지 검색부는 이미지 데이터 베이스의 목업 데이터에 있는 얼굴 랜드마크와, 사용자(고객)가 입력 한 이미지의 랜드마크 사이의 유사도를 계산하여, 이미지 데이터베이스에 저장되어 있는 이미지 중 가장 유사한 이미지를 검색한다. 이때, 유사도 계산은 예를 들어, 2차원 얼굴 이미지 랜드마크의 정확도와 관련된 \"mean error\", \"cumulative error\"에 의해 수행될 수 있다. \"mean error\"를 수식으로 표현하면 다음과 같다."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "여기서 는 i번째 얼굴 이미지의 랜드마크를 예측하는 머신러닝 모델이 예측한 모양, 는 실제 모양, 는 두 눈 사이의 거리, p는 랜드마크의 갯수, n은 전체 얼굴 이미지 개수이다. 또한, \"cumulative error\"와 관련된 CED(cumulative errors distribution)는, 라고 할 때, 가 보다 작거나 같은 이미지의 갯수를 n 으로 나눈 값이다. 즉, CED는 평균 오차가 이하인 이미지 개수의 비율이다. 이를 수식으로 표현하면 아래와 같다."}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상과 같은 \"mean error\", \"CED\"에 대해서는 논문 \"Lai, H.; Xiao, S.; Pan, Y.; Cui, Z.; Feng, J.; Xu, C.; Yin, J.; Yan, S. Deep recurrent regression for facial landmark detection. IEEE Trans. Circuits Syst. Video Technol. 2018, 28, 1144-1157\"에 자세히 설명되어 있으므로, 그것을 참고하는 것으로 갈음하기로 하고, 본 명세서에서는 이에 대한 상세한 설명은 생략하기로 한다. 다음으로, 이미지 데이터베이스에서 키워드(텍스트)로 검색하는 방법에 대해 설명해 보기로 한다. 이 방법에서도 마찬가지로 StyleGAN2 등의 생성 모델(generative model)을 이용하여 생성한 가상 인물 이미지가 이미지 데이터베이스에 저장되어 있는 것으로 가정한다. 먼저, “Amazon Rekognition” 또는 사전 훈련된 머신 러닝 모델을 활용하여 이미지 데이터베이스에 있는 이미지들의 특징들을 추출하여 저장한다. 예를 들면, 나이, 성별, 안경 유무, 스마트함 등의 결과값 텍스트를 새로운 데이터베이스(DB)에 저장한다. 그런 후, 사용자가 키워드로 검색을 하면, 이미지 검색부는 위의 새 로운 데이터베이스(DB)에서 검색을 하며, 이에 따라 해당하는 이미지가 검색된다. 이때, 해당하는 이미지가 다 수 개 있는 경우 하나를 선택하게 되고, 검색이 되지 않는 경우는 결과가 없음을 사용자에게 알려준다. 이상의 설명과 같이, 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 시스템 및 방법은 가상인물 데이 터가 저장되어 있는 데이터베이스에 텍스트 또는 실제 인물 사진을 입력하여 텍스트 또는 실제 인물 사진과 유 사한 가상 인물을 검색하고, 검색된 가상 인물을 기반으로 새로운 가상 인물을 생성함으로써, 종래의 캐릭터 비 즈니스의 문제를 보완하고, 인공지능 얼굴 이미지 생성 시스템을 활용하여 가상 캐릭터 비즈니스의 자유도를 높 일 수 있는 장점이 있다. 이상, 바람직한 실시 예를 통하여 본 발명에 관하여 상세히 설명하였으나, 본 발명은 이에 한정되는 것은 아니"}
{"patent_id": "10-2021-0093968", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "며, 본 발명의 기술적 사상을 벗어나지 않는 범위 내에서 다양하게 변경, 응용될 수 있음은 당해 기술분야의 통 상의 기술자에게 자명하다. 따라서, 본 발명의 진정한 보호 범위는 다음의 청구범위에 의하여 해석되어야 하며, 그와 동등한 범위 내에 있는 모든 기술적 사상은 본 발명의 권리 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2021-0093968", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 시스템의 구성을 개략적으로 나타낸 도면이다. 도 2는 본 발명에 따른 얼굴 이미지 검색을 통한 가상 인물 생성 방법의 실행 과정을 나타낸 흐름도이다. 도 3은 도 1에 도시된 시스템의 이미지 데이터베이스의 목업 부분의 목업 데이터에 저장되어 있는 얼굴 랜드마 크의 종류를 나타낸 도면이다."}
