{"patent_id": "10-2020-0133116", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0050255", "출원번호": "10-2020-0133116", "발명의 명칭": "IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템", "출원인": "(주)엠오텍", "발명자": "김철영"}}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다수의 상이한 위치에 설치되고, 전고체전지용 고체 전해질 생산용 각 글로브 박스 내에 수분 양과 압력, 산소농도, H2S 농도를 감지하는 센서부와, 각 글로브 박스 내의 영상을 촬상하는 이미지 센서, 각 수집된 영상을 처리하는 DSP부 및 각 부를 제어하여 글로브 박스를 감시해서 IOT화하는 PLC 컨트롤러를 가진 다수의 글로브 박스시스템;상기 다수의 글로브 박스 시스템에 의해 감시된 결과를 IOT화로서 통합적으로 수집하여 제공하는 중앙관제센터;및상기 다수의 글로브 박스 시스템과 상기 관리 정보처리장치를 중계하는 IOT 플랫폼; 을 포함하고 있으며,상기 PLC 컨트롤러는,상기 각 부에 전원을 공급하는 전원 모듈;상기 센서부 또는 외부 계측 기기 중 적어도 어느 하나 이상에서 감지 정보를 수집하는 시리얼 통신 모듈;상기 센서부 또는 상기 각 글로브 박스 내의 아날로그 감지 정보를 통합적으로 입력받는 A/I 모듈;상기 각 글로브 박스 내의 디지털 감지 정보를 통합적으로 입력받는 D/I 모듈;상기 A/I 모듈에 의해 입력된 아날로그 감지 정보를 디지털 변환하는 A/D 모듈;상기 D/I 모듈에 의해 입력된 디지털 감지 정보를 아날로그 변환하는 D/A 모듈;상기 아날로그/디지털 감지 정보에 따른 아날로그 제어신호를 포함한 각 아날로그 제어신호를 해당 제어기기로출력하는 A/O 모듈;상기 아날로그/디지털 감지 정보에 따른 디지털 제어신호를 포함한 각 디지털 제어신호와 상기 중앙관제센터의제어신호를 해당 제어기기 또는 현장의 관리 정보처리장치로 출력하는 D/O 모듈;상기 각 감지 정보를 IoT데이터로 상기 IOT 플랫폼을 통해 상기 중앙관제센터에 제공하고, 상기 중앙관제센터의각 제어신호를 상기 IOT 플랫폼에서 제공받는 IOT 모듈; 및상기 각 모듈을 제어하는 CPU 모듈; 을 포함하고,상기 다수의 글로브 박스 시스템 각각은,상기 각 감지 정보를 상기 CPU 모듈의 제어에 의해 인공지능 알고리즘으로 일별과, 월별 및 연별 비교 분석하여상기 중앙관제센터로 보고하는 AI 알고리즘부; 를 포함하고,상기 PLC 컨트롤러는,상기 AI 알고리즘부의 분석 결과를 기반으로 미리 설정된 스케쥴 또는 이벤트 발생시, 상기 중앙관제센터로 알람 또는 해당 제어기기를 직접 제어하는 것을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 IOT 플랫폼은,a) 외부의 미리 등록된 모바일 관리자 단말기로부터 원격 감시를 받을 경우, 해당 모바일 관리자 단말기와의 무선 데이터망 신호세기를 감지하여 미리 설정된 임계신호세기와 비교해서,b) 상기 비교 결과, 상기 모바일 관리자 단말기와의 무선 데이터망 신호세기가 상기 임계신호세기보다 이상인공개특허 10-2022-0050255-3-경우, 무선 데이터망의 개별 IP주소로 상호 간에 연결하고,c) 상기 비교 결과, 상기 모바일 관리자 단말기와의 무선 데이터망 신호세기가 상기 임계신호세기보다 미만인경우에는, 이동통신데이터망의 단말기 식별 번호로 상호 간에 연결해서, 실시간 연결을 확보하고,d) 상기 모바일 관리자 단말기(또는, 상기 중앙관제센터)로부터 글로브 박스 감시에 대한 다수의 상이한 제어포맷 중에서 어느 하나의 제어포맷을 제공받아서, 상기 제공된 제어포맷에 따라 상기 다수의 글로브 박스 시스템의 감지 정보를 포함한 데이터를 변환 또는 가공하고,e) 상기 변환 또는 가공된 결과를 상기 모바일 관리자 단말기(또는, 상기 중앙관제센터)로 제공하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 다수의 글로브 박스 시스템 각각은,상기 각 센서부를 IOT 센서화해서 해시트리를 기준으로 하위의 해시값과 메시 네트워킹으로 구성하여 감지 정보가 상기 IOT 플랫폼에 전송되도록 하고,상기 IOT 플랫폼은,상기 해시트리의 상위 해시값을 저장하여 다수의 상이한 글로브 박스 시스템과 센서별로 해시값을 연결해서 해당하는 해시노드를 구성함으로써 보안관리하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서,상기 IOT 플랫폼은,a) 글로브 박스를 감시할 경우, 해당 글로브 박스 시스템의 전체 네트워크 속도를 미리 설정된 임계 네트워크속도와 비교하여,b) 상기 비교 결과, 해당 글로브 박스 시스템의 전체 네트워크 속도가 상기 임계 네트워크 속도보다 이상인 경우 현재 네트워크 상태를 유지하고,c) 상기 비교 결과, 해당 글로브 박스 시스템의 전체 네트워크 속도가 상기 임계 네트워크 속도보다 미만인 경우에는 글로브 박스를 감시하는 글로브 박스 시스템의 개수정보와, 각 글로브 박스 시스템의 시스템정보, 해당플랫폼 자신의 네트워크정보를 포함한 가상연결정보에 따라 상이하게 그룹화하여 네트워크 가상화하고,d) 상기 c)의 네트워크 가상화에 대해 그룹개수를 기준으로 레벨링한 정보를 미리 등록하여, 해당 네트워크 가상화 레벨에 대응해서 해당 글로브 박스 시스템의 감지 정보를 포함한 데이터를 정제하는 것; 을 특징으로 하는IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 IOT 모듈은,상기 AI 알고리즘부에 의해 이벤트가 발생될 경우, 상기 CPU 모듈의 제어에 의해 해당하는 이상상태 정보를 미리 등록된 관리자 모바일 단말기 또는, 중앙관제센터로 알람하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 1에 있어서,상기 IOT 모듈은,자체 TTS엔진을 구비하여 상기 AI 알고리즘부에 의해 이벤트가 발생될 경우, 상기 CPU 모듈의 제어에 의해 상기공개특허 10-2022-0050255-4-TTS엔진을 통해 글로브 박스 시스템 자체적으로 음성 알람을 하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 1에 있어서,상기 PLC 컨트롤러는,상기 DSP부에 의한 영상 신호와, 상기 각 감지 정보를 HMI화에 의해 상호 연동시켜 영상통합계측하는 미리 등록된 HMI포맷에 의해 시각화하여 상기 중앙관제센터로 제공하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 HMI포맷은,각 글로브 박스 시스템별로 영상정보가 다수개로 수집된 경우, 다수의 상이한 영상을 HMI 기반으로 맵 형식에의해 팝업하여 각 글로브 박스 시스템별로 글로브 박스 감시정보를 제공하는 것; 을 특징으로 하는 IoT 연계한전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서,상기 다수의 글로브 박스 시스템 각각은,상기 PLC 컨트롤러로부터의 글로브 박스에 대한 다수의 상이한 운용 모드별 동작 제어값에 따라 상이하게 통합적으로 관련된 제어기기 또는 기반설비의 운전 동작을 제어하는 MCU; 를 포함하고,상기 중앙관제센터는,a) 운용 모드가 자동 모드인 경우, 제어대상의 입출력조건에 따른 설정값을 제 1 동작 제어값으로서 상기 MCU에제공하고,b) 운용 모드가 수동 모드인 경우, 작업자에 의한 조작치를 제 2 동작 제어값으로서 상기 MCU에 제공하고,c) 캐스케이드(Cascade) 모드인 경우, 상기 PLC 컨트롤러를 통해 입력된 관련된 제어기기 또는 기반설비, 센서부를 포함한 제반시설의 데이터를 분석해서 미리 설정된 제어포맷에 따라 제어명령을 산출하여 제 3 동작 제어값으로서 상기 MCU에 제공하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 MCU는,상기 관련된 제어기기 또는 기반설비의 운전 동작을 제어할 시, 해당 동작 현재값을 피드백하여 상기 PLC 컨트롤러로부터의 다수의 상이한 운용 모드별 동작 제어값과 비교하여 차이값이 0이 되도록 보정해서 각 운전 동작을 제어함으로써, 운용 방식에 있어 지능화 모드를 구현하는 것; 을 특징으로 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템."}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "실시예는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템에 관한 것이다. 구체적으로, 이러한 글로브 박스 모니터링 시스템은 각 업체별로 여러 지역에 위치된 글로브 박스 시스템을 감시 할 경우, 원격지의 중앙관제센터에서 각 시스템 내의 전고체전지용 고체 전해질 생산용 각 글로브 박스의 수분과 (뒷면에 계속)"}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서에 개시된 내용은 글로브 박스 모니터링 기술 분야에 관한 것으로, 보다 상세하게는 전고체전지용 고 체 전해질 생산을 위한 글로브 박스를 IoT와 연계하여 원격 감시하는 기술에 관한 것이다."}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 명세서에서 달리 표시되지 않는 한, 이 섹션에 설명되는 내용들은 이 출원의 청구항들에 대한 종래 기술이 아니며, 이 섹션에 포함된다고 하여 종래 기술이라고 인정되는 것은 아니다. 일반적으로, 글러브 박스는 외부와 차단되어 밀폐된 챔버 내에 특정한 환경을 유지하도록 하면서, 챔버 외부에 서 사용자가 챔버와 일체로 연결되고 외부로 돌출된 글러브를 착용하여, 챔버 내부에 접근할 수 있도록 하는 실 험용 장비이다. 사용자의 주작업 공간인 챔버의 일면은 외부에서 작업현황을 볼 수 있도록 투명한 재질로 제작 된다. 따라서, 사용자는 인체에 유해한 환경하에서 수행해야 하는 실험이라고 하더라도, 유해한 환경에 노출될 염려없 이 글러브를 통해 챔버 내부에 접근하여 다양한 실험을 수행할 수 있게 된다. 또한, 글러브 박스는 인체의 유해 물질에 대한 노출을 방지하는 측면에서 유리할 뿐만이 아니라, 글러브 박스의 챔버가 외부와 완전히 차단됨으로 서 내부의 실험환경이 그대로 유지될 수 있어서 보다 정밀하고 오차가 없는 실험결과 및 데이터를 얻을 수 있다. 특히 반응성이 좋은 활성기체를 제거하고 불순물 입자를 포집하여 챔버 내부가 원하는 조건의 환경이 되 도록 하여, 안정된 실험을 수행할 수 있도록 한다. 한편, 글로브 박스는 대기분위기에서 동작할 수 있는 분위기에 도달하기까지 장시간이 소요되고, 동작할 수 있 는 분위기에 도달 후에도 장시간 동안 운전되는 특성 상 운용자가 지속적으로 수분의 양과 산소농도의 현재값을 파악하여야 하며, 내부 불활성 기체의 누설, 공급되는 불활성 기체의 양, 산소 및 수분 제거 상태 등 지속적인 관리가 필요하다. 특히, 글로브 박스 내부에 대기분위기에 민감한 물질을 장시간 보관하거나, 글로브 박스를 사용하여 장시간 실 험 중인 사용자의 입장에서는 가동 중인 글로브 박스를 24시간 모니터링 해야 하며, 현실적으로 업무시간 이외 에 작동에 대해서는 모니터링이 어려운 한계가 있다. 업무시간 내에 발생하는 문제에 대해서는 사용자가 초등대 처가 가능하지만, 업무시간 외에 발생하는 문제에 대해서는 무방비한 상태이므로 큰 사고 및 금전적 손실로 이 어질 우려가 있다. 이러한 배경의 선행기술문헌은 아래의 특허문헌이다. (특허문헌 0001) KR101828370 B1 부가적으로, 상기 특허문헌 1의 기술은 이전의 휴대전화를 통해 수분의 양과 산소농도의 현재값을 파악하는 선 행기술을 개량하여 글로브 박스의 상태 데이터를 간단히 기록하고, 알람하는 정도이다."}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 내용은, 글로브 박스 시스템으로 전고체전지용 고체 전해질 생산을 할 경우, 각 업체별로 여러 지역에 위치된 글로브 박스 시스템의 각 글로브 박스 내에 수분과 산소 상태를 통합적으로 감시하도록 하는 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템을 제공하고자 한다. 그리고, 이러한 경우 상기 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템이 AI를 통해 시스템적으로 전술한 각 글로브 박스 내의 수분과 산소 상태를 분석하여 직접적으로 원격 감시와 알 람, 제어를 할 수 있도록 한다."}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템은, 각 업체별로 여러 지역에 위치된 글로브 박스 시스템을 감시할 경우, 원격지의 중앙관제센터에서 각 시스템 내 의 전고체전지용 고체 전해질 생산용 각 글로브 박스의 수분과 산소 상태를 통합적으로 감시한다. 이에 더하여 AI를 통해 각 글로브 박스의 수분과 산소 상태를 일별과, 월변 연별로 분석하여, 분석결과를 기반 으로 특정 이벤트 발생시에 시스템적으로 중앙관제센터로 알람을 하며, 아울러 글로브 박스 내부를 실시간 영상 으로 모니터링하는 것을 특징으로 한다.구체적으로는, 이러한 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템은, 다수의 상이한 위치에 설치되고, 전고체전지용 고체 전해질 생산용 각 글로브 박스 내에 수분 양과 압력, 산소 농도를 감지하는 센서부와, 각 글로브 박스 내의 영상을 촬상하는 이미지 센서, 각 수집된 영상을 처리하는 DSP 부 및, 상기 각 부를 제어하여 글로브 박스를 감시해서 IOT화하는 PLC 컨트롤러를 포함한 다수의 글로브 박스 시스템; 상기 다수의 글로브 박스 시스템에 의해 감시된 결과를 IOT화로서 통합적으로 수집하여 제공하는 중앙관제센터; 및 상기 다수의 글로브 박스 시스템과 상기 관리 정보처리장치를 중계하는 IOT 플랫폼; 을 포함하고 있으며, 상기 PLC 컨트롤러는, 상기 각 부에 전원을 공급하는 전원 모듈; 상기 센서부 또는 외부 계측 기기 중 적어도 어느 하나 이상에서 감지 정보를 수집하는 시리얼 통신 모듈; 상기 센서부 또는 상기 각 글로브 박스 내의 아날로그 감지 정보를 통합적으로 입력받는 A/I 모듈; 상기 각 글로브 박스 내의 디지털 감지 정보를 통합적으로 입력받는 D/I 모듈; 상기 A/I 모듈에 의해 입력된 아날로그 감지 정보를 디지털 변환하는 A/D 모듈; 상기 D/I 모듈에 의해 입력된 디지털 감지 정보를 아날로그 변환하는 D/A 모듈; 상기 아날로그/디지털 감지 정보에 따른 아날로그 제어신호를 포함한 각 아날로그 제어신호를 해당 제어기기로 출력하는 A/O 모듈; 상기 아날로그/디지털 감지 정보에 따른 디지털 제어신호를 포함한 각 디지털 제어신호와 상기 중앙관제센터의 제어신호를 해당 제어기기 또는 현장의 관리 정보처리장치로 출력하는 D/O 모듈; 상기 각 감지 정보를 IoT데이터로서 상기 IOT 플랫폼을 통해 상기 중앙관제센터에 제공하고, 상기 중앙관제센터 의 해당 제어신호를 상기 IOT 플랫폼을 통해 제공받는 IOT 모듈; 및 상기 각 모듈을 제어하는 CPU 모듈; 을 포함하고, 상기 다수의 글로브 박스 시스템 각각은, 상기 각 감지 정보를 상기 CPU 모듈의 제어에 의해 인공지능 알고리즘으로 일별과, 월별 및 연별 비교 분석하여 상기 중앙관제센터로 보고하는 AI 알고리즘부; 를 포함하고, 상기 PLC 컨트롤러는, 상기 AI 알고리즘부의 분석 결과를 기반으로 미리 설정된 스케쥴 또는 이벤트 발생시, 상기 중앙관제센터로 알 람 또는 해당 제어기기를 직접 제어하는 것; 을 특징으로 한다."}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "실시예들에 의하면, 각 업체별로 여러 지역에 위치된 글로브 박스 시스템을 감시할 경우, 원격지의 중앙관제센 터에서 각 시스템 내의 전고체전지용 고체 전해질 생산용 각 글로브 박스의 수분과 산소 상태를 통합적으로 감 시한다. 그리고, 이에 더하여 AI를 통해서 각 글로브 박스의 수분과 산소 상태를 일별과, 월변 연별로 분석하여, 분석 결과를 기반으로 특정 이벤트 발생시에 시스템적으로 중앙관제센터로 알람을 하며, 아울러 글로브 박스 내부를 실시간 영상으로 모니터링한다. 따라서, 이를 통해 각 업체별로 다수의 상이한 위치에 설치된 글로브 박스 시스템 내의 전고체전지용 고체 전해 질 생산용 각 글로브 박스의 수분과 산소 상태를 통합적으로 원격감시한다. 그리고, 또한 멀리 떨어진 관리자가 글로브 박스 이상시에 즉각적으로 이상사실을 파악해서 신속하게 고장수리 등의 조치가 이루어질 수 있도록 한다."}
{"patent_id": "10-2020-0133116", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템을 개 념적으로 설명하기 위한 도면이다. 도 1에 도시된 바와 같이, 일실시예의 시스템은 각 업체별로 여러 지역에 위치된 글로브 박스 시스템을 감 시할 경우, 원격지의 중앙관제센터에서 각 시스템 내의 전고체전지용 고체 전해질 생산용 각 글로브 박스 의 수분과 산소, H2S 상태를 통합적으로 감시하는 것이다. 이러한 경우, 상기 전고체전지용 고체 전해질 생산용 글로브 박스는 예를 들어, 본 출원인이 특허받은 제10- 2019241호(발명의 명칭 : 전고체전지용 고체 전해질 생산을 위한 글로브 박스 시스템)에 나타난 교반용 글로브 박스와, 소결용 글로브 박스 등이다. 부가적으로, 상기 중앙관제센터는 예를 들어, 글로브 박스 제품 개발자의 관리 정보처리장치가 된다. 그래서, 이를 통해 상기 글로브 박스 모니터링 시스템은 이러한 원격감시를 통해 각 업체별로 여러 지역 등에 위치된 글로브 박스 시스템의 장비를 원활히 관리하고, 이상발생시에 신속히 고장수리를 한다. 그리고, 추가적으로 상기 시스템은 이러한 원격 감시를 할 경우, 원격지의 모바일 관리자 단말기로 상기 각 글 로브 박스의 수분과 산소 상태정보를 제공해서 손쉽게 원격감시를 한다. 또한, 상기 시스템은 이때 AI를 통해서 각 글로브 박스의 수분과 산소 상태를 일별과, 월변 연별로 분석하여, 분석 결과를 기반으로 특정 이벤트 발생시에 시스템적으로 중앙관제센터로 알람을 하며, 이에 더하여 글로브 박 스 내부를 실시간 영상으로 모니터링한다. 이때, 전술한 글로브 박스 시스템이 설치된 업체가 자체적으로 자신의 현장 관리 정보처리장치를 통해 각 글로 브 박스의 수분과 산소 상태정보를 수집하여 감시도 한다. 도 2는 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템을 전 체적으로 도시한 도면이다. 도 2에 도시된 바와 같이, 일실시예에 따른 시스템은 각 업체별로 다수의 상이한 위치에 설치된 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)과, 중앙관제센터 및, IOT 플랫폼 을 포함하고, 각각은 IOT 에 의해 상호 간에 인터페이스한다. 그리고, 추가적으로 일실시예에 따른 시스템은 이러한 IOT에 의해 상기 각 장치와 손쉽게 인터페이스하는 관리 자 모바일 단말기를 더 포함한다. 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)은 A, B, ... , N업체 등 각 업체별로 다수의 상 이한 위치에 설치되고, 전고체전지용 고체 전해질 생산용의 각 글로브 박스 내에 수분 양과 압력, 산소 농도, H2S의 농도를 감시하여 IOT화로 상기 IOT 플랫폼을 통해 중앙관제센터에 제공한다. 상기 중앙관제센터는 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)에 관한 시스템정보를 등 록하여 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)에 의해 감시된 결과를 IOT화로서 IOT 플랫 폼을 통해 통합적으로 수집하여 제공한다. 그래서, 상기 중앙관제센터는 예를 들어, 제품 개발자의 관리 정보처리장치는 멀리 떨어진 관리자에게 글로브 박스 상태 정보를 알려 원격감시 또는 이를 통한 원격제어 가 될 수 있도록 한다. 상기 IOT 플랫폼은 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)과 상기 중앙관제센터 를 중계한다. 그리고, 상기 IOT 플랫폼은 이러한 경우, 예를 들어 각 글로브 박스 시스템(100-1, 100-2, ... , 100-n)과 관리 장치(예 : 중앙관제센터)마다 상이하게 부여된 IOT 기반의 식별번호 등을 통해 각 각을 구분하여 연결한다. 상기 관리자 모바일 단말기는 예를 들어, 제품 개발자의 스마트폰 등으로, 상기 중앙관제센터와 같이 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)에 의해 감시된 결과를 IOT화로서 IOT 플랫폼을 통해 통합적으로 수집하여 제공한다. 그래서, 이를 통해 멀리 떨어진 해당 관리자는 언제 어디서나 손쉽게 글로 브 박스 시스템을 원격감시 또는 원격제어를 한다. 이러한 원격제어는 H2S의 농도가 미리 설정된 치사량에 해당 하는 경우, 해당하는 저감장치에서 이를 다운하는 방식으로 이루어진다. 추가적으로, 다른 실시예의 글로브 박스 모니터링 시스템은 전술한 관리자 모바일 단말기를 통해 원격감시를 할 경우, 해당 단말기와 실시간 연결을 확보하고, 관리자에 의해 손쉽게 글로브 박스 시스템의 데이터를 호환과 경 량화 등을 위해 변환하도록 한다. 이를 위해, 상기 글로브 박스 모니터링 시스템은 아래의 구성을 더 포함한다. 구체적으로는 상기 IOT 플랫폼이 아래의 구성을 가진다. a) 먼저, 상기 IOT 플랫폼은 외부의 미리 등록된 모바일 관리자 단말기로부터 원격 감시를 받을 경우, 해 당 모바일 관리자 단말기와의 무선 데이터망 신호세기를 감지하여 미리 설정된 임계신호세기와 비교한다. b) 상기 비교 결과, 상기 모바일 관리자 단말기와의 무선 데이터망 신호세기가 상기 임계신호세기보다 이상인 경우, 무선 데이터망의 개별 IP주소로 상호 간에 연결한다. c) 반면 상기 비교 결과, 상기 모바일 관리자 단말기와의 무선 데이터망 신호세기가 상기 임계신호세기보다 미 만인 경우에는, 이동통신데이터망의 단말기 식별 번호로 상호 간에 연결해서, 실시간 연결을 확보한다. d) 그리고 나서, 상기 모바일 관리자 단말기(또는, 상기 중앙관제센터)로부터 글로브 박스 감시에 대한 다 수의 상이한 제어포맷 중에서 어느 하나의 제어포맷을 제공받아서, 상기 제공된 제어포맷에 따라 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n)의 감지 정보를 포함한 데이터를 변환 또는 가공한다. e) 그래서, 상기 변환 또는 가공된 결과를 상기 모바일 관리자 단말기(또는, 상기 중앙관제센터)로 제공한 다. 따라서, 이를 통해 이러한 글로브 박스 모니터링 시스템은 관리자 모바일 단말기로 글로브 박스 시스템을 원격 감시할 경우, 해당 단말기와 실시간 연결을 확보하고 관리자에 의해 손쉽게 글로브 박스 시스템의 데이터를 호 환과 경량화 등을 위해 변환한다. 더 나아가서, 글로브 박스 제조회사와, 글로브 박스 시스템의 사양 등이 상이하더라도 이러한 IOT 플랫폼 구성 을 통해 글로브 박스의 모니터링 동작을 더 확장한다. 그리고, 또한 또 다른 실시예에 따른 시스템은 이러한 경우에 보다 더 원활한 글로브 박스 모니터링을 위해 상 기 IOT화에 맞는 보안관리를 제공할 수 있도록 한다.구체적으로 상기 보안관리 구성은 아래와 같이 이루어진다. 먼저, 상기 보안관리 구성은 상기 다수의 글로브 박스 시스템(100-1, 100-2, ... , 100-n) 각각이 상기한 각 센 서부를 IOT 센서화해서 해시트리를 기준으로 하위의 해시값과 메시 네트워킹으로 구성하여 감지 정보가 상기 IOT 플랫폼에 전송되도록 한다. 그리고, 이에 더하여 상기 IOT 플랫폼은 상기 해시트리의 상위 해시값을 저장하여 다수의 상이한 글로브 박스 시스템(100-1, 100-2, ... , 100-n)과 센서별로 해시값을 연결해서 해당하는 해시노드를 구성함으로써 보 안관리한다. 따라서, 이를 통해 상기 시스템은 전술한 IOT화에 맞는 보안관리를 제공하여 보다 더 원활한 글로브 박스 모니 터링을 한다. 이에 더하여, 이들과 다른 실시예의 시스템은 모니터링에 사용되는 글로브 박스 시스템이 많거나 엽체들에 더 계속적으로 확충 또는, 글로브 박스 시스템이 새로이 개발되어 사양이 업그레이드됨에 따라 이에 맞추어 관리자 가 원하는 바로 데이터를 변환하도록 한다. 이를 위해, 상기 시스템은 아래의 구성도 구비한다. a) 즉, 상기 시스템은 먼저 상기 IOT 플랫폼이 글로브 박스를 감시할 경우, 해당 글로브 박스 시스템의 전 체 네트워크 속도를 미리 설정된 임계 네트워크 속도와 비교한다. b) 상기 비교 결과, 해당 글로브 박스 시스템의 전체 네트워크 속도가 상기 임계 네트워크 속도보다 이상인 경 우 현재 네트워크 상태를 유지한다. c) 반면 상기 비교 결과, 해당 글로브 박스 시스템의 전체 네트워크 속도가 상기 임계 네트워크 속도보다 미만 인 경우에는 글로브 박스를 감시하는 글로브 박스 시스템의 개수정보와, 각 글로브 박스 시스템의 시스템정보, 해당 플랫폼 자신의 네트워크정보를 포함한 가상연결정보에 따라 상이하게 그룹화하여 네트워크 가상화한다. 이러한 경우, 예를 들어 상기 글로브 박스 시스템의 시스템정보는 글로브 박스 내의 수분과 산소 상태에 대한 원격 감시를 위한 프로세싱과, 사용자 인터페이스, 메모리 정보를 포함한다. 그리고, 상기 IOT 플랫폼의 네트워 크정보는 네트워크 자원과 하드웨어 등의 정보를 포함한다. d) 그래서, 상기 c)의 네트워크 가상화에 대해 그룹개수를 기준으로 레벨링한 정보를 미리 등록하여(예 : 제 1, 2, ... n 네트워크 가상화 레벨), 해당 네트워크 가상화 레벨에 대응해서 해당 글로브 박스 시스템의 감지 정보 를 포함한 데이터를 정제한다. 따라서, 이를 통해 이러한 시스템은 글로브 박스 시스템이 많거나 엽체들에 더 계속적으로 확충 또는, 글로브 박스 시스템이 새로이 개발되어 사양이 업그레이드 되는 등의 여러 상황에 맞추어서 관리자가 원하는 바로 데이 터를 변환한다. 도 3은 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템의 구 성을 도시한 블록도이다. 도 3에 도시된 바와 같이, 일실시예에 따른 시스템은 글로브 박스 시스템과, 중앙관제센터 및, IOT 플랫폼을 포함한다. 상기 글로브 박스 시스템은 전고체전지용 고체 전해질 생산용 각 글로브 박스 내에 수분 양과 압력, 산소 농도, H2S 농도를 감지하는 센서부와, 각 글로브 박스 내의 영상을 촬상하는 이미지 센서, 각 수집된 영상을 처리하는 DSP부 및, 상기 각 부를 제어하여 글로브 박스를 감시해서 IOT화하는 PLC 컨트롤러 를 포함한다. 상기 PLC 컨트롤러는, 상기 AI 알고리즘부의 분석 결과를 기반으로 미리 설정된 스케쥴 또는 이벤트 발생시, 상기 중앙관제센터로 알 람 또는 해당 제어기기를 직접 제어 상기 중앙관제센터는 상기 글로브 박스 시스템에 의해 감시된 결과를 IOT화로서 통합적으로 수집하여 제공한다. 상기 IOT 플랫폼은 상기 글로브 박스 시스템과 상기 중앙관제센터를 중계한다. 이러한 경우, 상기 PLC 컨트롤러는 일실시예에 따라 아래의 구성으로 이루어진다. 즉, 상기 PLC 컨트롤러는, a) 상기 각 부에 전원을 공급하는 전원 모듈; b) 상기 센서부 또는 외부 계측 기기 중 적어도 어느 하나 이상에서 감지 정보를 수집하는 시리얼 통신 모 듈; c) 상기 센서부 또는 상기 각 글로브 박스 내의 아날로그 감지 정보를 통합적으로 입력받는 A/I 모듈; d) 상기 각 글로브 박스 내의 디지털 감지 정보를 통합적으로 입력받는 D/I 모듈; e) 상기 A/I 모듈에 의해 입력된 아날로그 감지 정보를 디지털 변환하는 A/D 모듈; f) 상기 D/I 모듈에 의해 입력된 디지털 감지 정보를 아날로그 변환하는 D/A 모듈; g) 상기 아날로그/디지털 감지 정보에 따른 아날로그 제어신호를 포함한 각 아날로그 제어신호를 해당 제어기기 로 출력하는 A/O 모듈; h) 상기 아날로그/디지털 감지 정보에 따른 디지털 제어신호를 포함한 각 디지털 제어신호와 상기 중앙관제센터 의 제어신호를 해당 제어기기 또는 현장의 관리 정보처리장치로 출력하는 D/O 모듈; I) 상기 각 감지 정보를 IoT데이터로서 상기 IOT 플랫폼을 통해 상기 중앙관제센터에 제공하고, 상기 중앙관제센터의 해당 제어신호를 상기 IOT 플랫폼을 통해 제공받는 IOT 모듈; 및 j) 상기 각 모듈을 제어하는 CPU 모듈; 을 포함한다. 부가적으로, 이와 관련하여 부연설명을 하면 다양한 환경에서 사용되는 기존의 PLC 시스템에 대해서는 여러 기 능을 가진 모듈이 필요하며, 이에 따라서 PLC 제조 업체는 사용자의 요구사항을 만족하는 다양한 모듈을 제공한 다. 예를 들어, 디지털 입출력 모듈, 아날로그 입출력모듈, 통신 모듈 등 여러 기능을 가진 모듈이 PLC 시스템 에 사용되고, 이러한 다양한 모듈을 통해서 사용자가 원하는 시스템이 구축된다. 예를 들어, 특허문헌 KR101778333 Y1의 기술은 이러한 기술로서 등록받은 발명이며, 구체적으로는 PLC의 출력모 듈의 동작상 결함 여부를 진단하기 위한 진단모듈을 구비하는 PLC 시스템에 관한 것이다. 일실시예에 따른 전술한 IOT 모듈은 이러한 점들을 이용해서, 그 IOT 모듈로부터 IOT 기능을 제공하는 PLC를 제 공하고, 이를 통해 더 나아가 관리자에 의해 쉽게 감시와 제어 등이 이루어지도록 한 것이다. 따라서, 이를 통해 일실시예에 따른 PLC 컨트롤러는 상기 IOT 모듈을 통해 자체으로 (무선)인터넷연결부가 구비 되어, 실시간으로 감지되는 글로브 박스 감지정보를 미리 등록된 관리자 모바일 단말기로 직접 송출할 수 있는 기능을 수행한다. 이와 관련하여, 추가적으로 상기 글로브 박스 시스템은 상기 각 감지 정보를 상기 CPU 모듈의 제어에 의해 인공지능 알고리즘으로 일별과, 월별 및 연별 비교 분석하여 IOT 모듈을 통해 상기 중앙관제센터로 보고하 는 AI 알고리즘부를 포함한다. 이러한 경우, 상기 PLC 컨트롤러는 상기 AI 알고리즘부의 분석 결과를 기반으로 미리 설정된 스케쥴 또는 이벤트 발생시, 상기 중앙관제센터로 알람 또는 해당 제어기기를 직접 제어한다.이와 관련해서 더 나아가, 상기 IOT 모듈은 아래의 동작을 더 수행한다. 즉, 상기 IOT 모듈은 상기한 AI 알고리즘부에 의해 이벤트가 발생될 경우, 상기 CPU 모듈의 제어에 의해 해당하는 이상상태 정보를 미리 등록된 관리자 모바일 단말기 또는, 중앙관제센터로 알람한다. 또한, 상기 IOT 모듈은 자체 TTS엔진을 구비하여 상기 AI 알고리즘부에 의해 이벤트가 발생될 경우, 상기 CPU 모듈의 제어에 의해 상기 TTS엔진을 통해 글로브 박스 시스템 자체적으로 음성 알람도 한다. 추가적으로, 이러한 PLC 컨트롤러는 최적화된 감시 등을 위해 아래의 구성도 더 구비한다. 구체적으로는, 상기 구성은 먼저 상기 PLC 컨트롤러가 상기 DSP부에 의한 영상 신호와, 상기 각 감지 정보를 HMI화에 의해 상호 연동시켜 영상통합계측하는 미리 등록된 HMI포맷에 의해 시각화하여 상기 중앙관제센 터로 제공한다. 이러한 경우, 상기 HMI포맷은 각 글로브 박스 시스템별로 영상정보가 다수개로 수집된 경우, 다수의 상이한 영 상을 HMI 기반으로 맵 형식에 의해 팝업하여 각 글로브 박스 시스템별로 글로브 박스 감시정보를 제공한다. 한편, 이에 더하여 또 다른 글로브 박스 시스템은 대체적으로 원격지의 글로브 박스 시스템이 대부분 자동/수동 모드로만 운영되고 있는 상황에서, 이를 속히 IoT 기능과 접목하여 지능화 모드를 제공할 수 있도록 한다 이를 위해, 먼저 상기 글로브 박스 시스템은 PLC 컨트롤러로부터의 글로브 박스에 대한 다수의 상이 한 운용 모드별 동작 제어값에 따라 상이하게 통합적으로 관련된 제어기기 또는 기반설비의 운전 동작을 제어하 는 MCU(미도시)를 포함한다. 그리고, 상기 중앙관제센터는 아래의 구성을 구비한다. a) 즉, 상기 중앙관제센터는 운용 모드가 자동 모드인 경우, 제어대상의 입출력조건에 따른 설정값을 제 1 동작 제어값으로서 상기 MCU(미도시)에 제공한다. b) 그리고, 운용 모드가 수동 모드인 경우, 작업자에 의한 조작치를 제 2 동작 제어값으로서 상기 MCU에 제공한 다. c) 특히 캐스케이드(Cascade) 모드인 경우에는, PLC 컨트롤러를 통해 입력된 관련된 제어기기 또는 기반설 비, 센서부를 포함한 제반시설의 데이터를 분석해서 미리 설정된 제어포맷에 따라 제어명령을 산출하여 제 3 동작 제어값으로서 MCU에 제공한다. 이러한 경우, 상기 MCU는 관련된 제어기기 또는 기반설비의 운전 동작을 제어할 시, 해당 동작 현재값을 피드백 하여 상기 PLC 컨트롤러로부터의 다수의 상이한 운용 모드별 동작 제어값과 비교하여 차이값이 0이 되도록 보정해서 각 운전 동작을 제어함으로써, 운용 방식에 있어 지능화 모드를 구현한다. 도 4는 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템의 동 작을 순서대로 도시한 플로우 차트이다. 도 4에 도시된 바와 같이, 일실시예의 시스템은 먼저 각 업체별로 여러 지역에 위치된 글로브 박스 시스템을 감 시할 경우, 각 시스템에서 전고체전지용 고체 전해질 생산용의 글로브 박스 내에 수분 양과 압력, 산소 농도, H2S 농도를 감지하고(S401) IOT화한다. 이러한 경우, 상기 전고체전지용 고체 전해질 생산용 글로브 박스는 예를 들어, 전술한 본 출원인의 특허내용에 나타난 교반용 글로브 박스와, 소결용 글로브 박스 등이다. 그리고, 이와 별도로 일실시예에 따른 시스템은 이러한 경우, 각 글로브 박스 내의 영상을 수집하고(S402), DSP 처리를 해서(S403) IOT화한다. 다음, 상기 글로브 박스 시스템은 이러한 각 정보를 IOT 플랫폼에 전달하고(S404), 상기 IOT 플랫폼은 이를 중 앙관제센터에 제공한다(S405). 그러면, 상기 중앙관제센터는 이러한 각 감지 정보 즉, 각 글로브 박스 시스템의 글로브 박스 수분, 산소 상태 정보를 상이한 글로브 박스 시스템별로 관리자에게 표시해서 제공함으로써 원격감시한다(S406). 그래서, 이를 통해 일실시예에 따른 시스템은 각 업체별로 다수의 상이한 위치에 설치된 글로브 박스 시스템 내 의 전고체전지용 고체 전해질 생산용 각 글로브 박스의 수분과 산소 상태를 통합적으로 원격감시한다. 한편, 추가적으로, 상기 시스템은 글로브 박스의 수분과 산소 상태 정보를 감지할 경우, AI를 통해서 각 글로브 박스의 수분과 산소, H2S 상태를 일별과, 월변 연별로 분석한다(S407). 그래서 이러한 분석 결과를 기반으로 특 정 이벤트 발생시에(S408) 시스템적으로 중앙관제센터로 알람한다(S409). 따라서, 이를 통해 멀리 떨어진 관리자가 글로브 박스 이상시에 즉각적으로 이상사실을 파악해서 신속하게 고장 수리 등의 조치가 이루어질 수 있도록 한다. 이상과 같이, 일실시예는 각 업체별로 여러 지역에 위치된 글로브 박스 시스템을 감시할 경우, 원격지의 중앙관 제센터에서 각 시스템 내의 전고체전지용 고체 전해질 생산용 각 글로브 박스의 수분과 산소, H2S 상태를 통합적 으로 감시한다. 그리고, 이에 더하여 AI를 통해서 각 글로브 박스의 수분과 산소 상태를 일별과, 월변 연별로 분석하여, 분석 결과를 기반으로 특정 이벤트 발생시에 시스템적으로 중앙관제센터로 알람을 하며, 아울러 글로브 박스 내부를 실시간 영상으로 모니터링한다. 따라서, 이를 통해 각 업체별로 다수의 상이한 위치에 설치된 글로브 박스 시스템 내의 전고체전지용 고체 전해 질 생산용 각 글로브 박스의 수분과 산소, H2S 상태를 통합적으로 원격감시한다. 그리고, 또한 멀리 떨어진 관리자가 글로브 박스 이상시에 즉각적으로 이상사실을 파악해서 신속하게 고장수리 등의 조치가 이루어질 수 있도록 한다."}
{"patent_id": "10-2020-0133116", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템을 개 념적으로 설명하기 위한 도면 도 2는 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템을 전 체적으로 도시한 도면 도 3은 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템의 구 성을 도시한 블록도 도 4는 일실시예에 따른 IoT 연계한 전고체전지용 고체 전해질 생산을 위한 글로브 박스 모니터링 시스템의 동 작을 순서대로 도시한 플로우 차트"}
