{"patent_id": "10-2020-0175556", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0085470", "출원번호": "10-2020-0175556", "발명의 명칭": "트래킹 데이터를 활용한 온라인 쇼핑몰 콘텐츠 생성 장치 및 시스템", "출원인": "양은정", "발명자": "양은정"}}
{"patent_id": "10-2020-0175556", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "본 명세서는 온라인 플랫폼을 활용한 상품 판매에 있어 소비자 트래킹 데이터와 인공지능 기반 데이터 분석 프로세스를 처리함으로 각 상품별; 품목별; 타겟 소비자의 수요를 파악하고 상기 소비자 수요를 기반으로 타겟 소비자 맞춤 상품 큐리에션 콘텐츠를 구성 및 생성함으로써 판매자 기준의 상품 큐레이션이 아닌 소비자 기준으로데이터 기반 충분한 큐레이션 콘텐츠를 디스플레이 제공할 수 있도록 한다."}
{"patent_id": "10-2020-0175556", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 소비자 트래킹(tracking) 데이터를 활용한 온라인 플랫폼 기반 상품별 큐레이션 콘텐츠 생성 시스템 및 장치에 관한 것으로, 보다 상세하게는 웹 서버, 소셜 네트워크 망을 통한 소비자 데이터 트래킹 작업을 통해 소비자들의 수요를 파악하고 타겟 소비자를 기준으로 온라인 플랫폼에서 경쟁력이 있는 상품별 큐레이션 콘텐츠 를 생성하고 이를 디스플레이 제공하는 방법에 대한 것이다. 공개특허10-2022-0085470 CPC특허분류 G06Q 30/0631 (2013.01) G06Q 30/0639 (2013.01) G06Q 50/01 (2013.01)명 세 서 청구범위 청구항 1 본 명세서는 온라인 플랫폼을 활용한 상품 판매에 있어 소비자 트래킹 데이터와 인공지능 기반 데이터 분석 프 로세스를 처리함으로 각 상품별; 품목별; 타겟 소비자의 수요를 파악하고 상기 소비자 수요를 기반으로 타겟 소 비자 맞춤 상품 큐리에션 콘텐츠를 구성 및 생성함으로써 판매자 기준의 상품 큐레이션이 아닌 소비자 기준으로 데이터 기반 충분한 큐레이션 콘텐츠를 디스플레이 제공할 수 있도록 한다. 발명의 설명"}
{"patent_id": "10-2020-0175556", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소비자에 대한 트래킹 데이터를 형성하고 상기 데이터를 기반으로 온라인 판매 플랫폼에서 소비자들 에게 제공할 상품 큐레이션 콘텐츠를 생성하고 이를 디스플레이 제공하는 방법 및 프로세스에 관한 것이다."}
{"patent_id": "10-2020-0175556", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "본 발명은 성별 및 연령과 같은 소비자 기본 정보와 소비자가 자주 검색하는 의류 및 뷰티 상품에 대한 정보를 트래킹(tracking)하여 상기 트래킹한 데이터를 기반으로 소비자가 의류 및 뷰티 상품을 구매할 때 고려하는 요 소들을 도출하고 상기 요소들을 기준으로 검색 및 선택 항목 배치 및 나열; 상품마다 해당 요소를 바탕으로 상 품에 대한 큐레이션 콘텐츠를 구성할 수 있도록 하여 이에 대한 최종 결과 콘텐츠 값들을 소비자들에게 디스플 레이 제공할 수 있는 시스템 및 장치를 구축하는 방법에 관한 것이다. 상기 프로세스를 통해 소비자들의 니즈(needs)와 필요성에 적합한 상품별 큐레이션 콘텐츠를 형성하고 이를 소 비자들에게 제공함으로 정보 공유 기능을 극대화 시키고 온라인 플랫폼을 활용한 판매 효과를 증진시킬 수 있다."}
{"patent_id": "10-2020-0175556", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 소비자들이 온라인 쇼핑 플랫폼을 통해 의류 및 뷰티 상품을 구매할 때 고려하는 주된 키워드 및 항목들, 그리고 이를 구매하는 소비자의 연령, 성별과 같은 일부 기본 개인 정보를 트래킹하여 소비자들의 상품 선택 및 구매 과정을 돕는 데에 있다. 온라인 플랫폼을 활용하여 판매 제공하는 상품들의 경우 이미 다양한 온라인 판매 플랫폼이 많아 온라인 판매 플랫폼에 있어 소비자들의 수요 파악과 그에 맞는 상품 배치 및 효과적인 큐레이션 제공이 필요하다. 특히 의류 및 뷰티 상품만큼 항목과 종류가 다양하고 소비자들의 수요와 시장 흐름에 민감한 상품의 경우 판매 자가 아닌 소비자에 초점을 맞춘 상품 큐레이션 및 플랫폼 형성이 중요하다. 이에 따라 상기한 발명의 실시예는 소비자들의 수요에 맞는 상품을 찾을 수 있도록 이에 맞는 트래킹 데이터 기 반 콘텐츠들을 생성함으로 상기한 과제를 해결할 수 있도록 한다. 또한 본 발명의 실시예는 상품 큐레이션 콘텐츠에 대한 스토리텔링 요소를 부가하여 더 다양한 소비자 그룹 및 소비 지역을 확장시킬 수 있다."}
{"patent_id": "10-2020-0175556", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 과제를 해결하기 위해 본 발명에 따른 트래킹 데이터를 활용한 온라인 쇼핑몰 콘텐츠 생성 장치 및 시스 템은 온라인 플랫폼에 대한 소비자 데이터 트래킹(tracking) 프로세스를 바탕으로 형성된다. 본 발명의 실시예는 소비자의 기본 정보를 수집하는 단계; 상기 기본 정보는 타겟 소비자의 수요가 무엇인지 분 석 및 연령별, 국가별 등 상품에 대한 선호도를 파악하기 위함이다. 소비자의 검색 데이터를 기반으로 소비자가 빈도 높게 검색하는 의류 및 뷰티 상품의 유형, 가격, 해당 상품이 가지고 있는 고유한 기능 및 속성에 대한 정보를 트래킹하는 단계; 트래킹한 데이터를 인공지능 데이터 분석 엔진 시스템이 분석 처리하여 소비자들의 수요에 대한 데이터 모델을 각 상품 항목별로 산출하는 단계; 산출된 각 결과 데이터 모델에 따라 각 항목별 상품에 대한 큐레이션이 구성되는 단계; 상기 콘텐츠 값들이 매칭된 상품들이 온라인 플랫폼을 통해 소비자들에게 디스플레이 되는 단계; 를 포함한다. 소비자의 검색 데이터는 웹 서버 뿐 아니라 소셜 네트워크 플랫폼내에서도 트래킹할 수 있다. 또한 상기한 발명의 실시예는 트래킹한 소비자 데이터에 대한 모니터링과 보안 시스템 및 데이터 송수신 장치를 포함한다."}
{"patent_id": "10-2020-0175556", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1은 본 발명에 따라 타겟 상품 범위에 대한 소비자 데이터를 트래킹(tracking)하는 과정을 나타내는 도면이 다. 특정 상품군에 대한 소비자 데이터 트래킹 작업을 수행하기 위해 트래커(tracker)는 웹 서버 및 소셜 네트워크 망을 통해 소비자들의 성별과 연령, 지역 항목을 기준으로 트래킹 해야 할 소비자 기본 정보를 설정하여 해당 정보를 먼저 트래킹하고 해당 기본 정보 항목을 기준으로 분류된 소비자 그룹마다 자주 검색하는 타겟 상품의 유형 데이터를 트래킹한다. 이후 소비자 검색 상품의 해당 상품 품목과 속성을 함께 그룹 트래킹하는 과정까지 수행한 트래커는 트래킹한 데이터를 트래킹 데이터 수집부로 송신한다. 상기한 과정을 통해 수집된 트래킹 데이터는 소비자들이 구매하고자 하는 특정 타겟 상품에 대한 수요를 파악하 고 소비자 수요에 맞는 타겟 상품들의 품목과 속성을 포함한 관련 정보를 그룹 트래킹하여 데이터 트래킹 및 수 집 단계 이후 트래킹한 데이터가 소비자의 연령, 성별, 지역별로 그룹화될 수 있도록 한다. 그룹화된 데이터는 이후 소비자들이 판매자가 선정한 타겟 상품을 구매하기 위한 과정에서 소비자들에게 디스플 레이 제공되는 각 상품별 큐레이션 콘텐츠를 구성하는 작업에 있어 활용된다. 상기 큐레이션 콘텐츠 및 상품 데 이터는 소비자들의 IoT(Internet of Things) 및 인터페이스(Interface)에 정확히 전송될 수 있도록 디스플레이 모듈이 해당 단계를 수행한다. 도 2는 본 발명의 실시예에 따라 상품마다 큐레이션 콘텐츠가 생성되는 과정을 나타내는 도면이다. 먼저 소비자들의 수요에 대한 파악을 위해 트래커가 수집한 소비자 트래킹 데이터를 수신한다. 수신한 소비자 트래킹 데이터를 기반으로 인공지능 기반 데이터 분석 프로세스를 처리하여 각 소비자 속성과; 트레킹 데이터, 상품 정보를 기반으로 데이터 분석 모델을 산출할 수 있도록 한다. 산출된 결과 데이터 모델은 상품 항목별로 분류되어 각 상품 항목마다; 상품마다; 데이터 분석 모델을 기반으로 해당 품목에 대한 소비자들의 니즈와 흥미요소를 기준으로 각 품목의 상품마다 알맞은 큐레이션 콘텐츠를 구성 할 수 있도록 한다. 각 항목별 큐레이션 콘텐츠는 해당 품목을 가장 많이 소비하는 소비자 그룹의 수요를 중심으로 해당 그룹이 가 장 많이 고려하는 요소를 중심으로 구성 및 생성된다. 본 발명의 실시예에 따른 상품별 큐레이션 콘텐츠는 타겟 소비자들에게 수요와 시장 트렌드에 맞게 상품 정보를 구성하고 생성함으로써 온라인 판매 플랫폼의 문제점 중 하나인 판매자 중심의 상품 큐레이션을 극복할 수 있도 록 한다. 뿐만 아니라 각 상품마다 스토리텔링 요소를 부가하여 해외 소비자를 비롯한 타겟 소비자 외 다른 소비자 그룹 의 수요도 부분 충족시킬 수 있도록 한다. 상기한 과정을 거쳐 각 상품마다 형성된 상품 큐레이션 콘텐츠는 데이터 오류 처리 및 데이터 정확도 및 변환에 대한 모니터링 작업까지 완료되고 데이터 송수신처리 및 디스플레이 모듈을 통한 디스플레이까지 완료함으로써 모든 과정이 종료된다."}
{"patent_id": "10-2020-0175556", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따라 타겟 상품 범위에 대한 소비자 데이터를 트래킹(tracking)하는 과정을 나타내는 도면이 다. 도 2는 본 발명의 실시예에 따라 상품마다 큐레이션 콘텐츠가 생성되는 과정을 나타내는 도면이다."}
