{"patent_id": "10-2023-0121493", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0038925", "출원번호": "10-2023-0121493", "발명의 명칭": "클라우드 기반 작물별 의사결정지원 스마트팜 복합제어시스템", "출원인": "(주)다온씨앤티", "발명자": "황진국"}}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "재배지의 작물 재배정보를 수신받아 재배지의 시설 및 환경을 자동 제어하여 작물을 재배하는 스마트팜 재배방법에 있어서,재배지의 환경정보를 포함한 작물 재배정보를 복합제어기(10)에서 취합하여 설정된 시간 간격으로 서버(20)로전달하는 제1단계;설정된 시간간격으로 수신받은 작물 재배정보에서 시설 환경정보와 토양(배지) 환경정보를 추출하여 각 환경정보의 독립변수별로 평균값을 산정하고, 미리 학습된 인공지능 알고리즘에 입력하여 해당 작물의 현재 생체지수를 판정하는 제2단계;판정된 현재 생체지수가 설정된 기준 생체지수의 임계 범위 내에 해당하는지 여부를 판단하여 제어유무를 출력하는 제3단계;제3단계에서 현재 생체지수가 임계범위를 벗어난 것으로 출력된 경우, 기대 생체지수 및 상기 기대 생체지수에도달하기 위해 시설 및 환경을 제어하기 위한 제어정보를 생성하는 제4단계;생성된 제어정보와 기대 생체지수 정보를 재배지에 설치된 상기 복합제어기(10)로 전달하는 제5단계;상기 복합제어기(10)는 수신받은 제어정보에 따라 재배지의 시설 및 환경 제어기기들을 자동 제어하는 제6단계;상기 복합제어기(10)는 재배지의 시설 및 환경 제어 후 설정된 시간간격으로 변경된 환경정보를 상기 서버(20)로 전달하는 제7단계;상기 서버(20)는 수신받은 변경된 환경정보에서 독립변수별로 평균값을 산정한 후, 인공지능 알고리즘에 재차입력하여 제어상태의 현재 생체지수를 다시 판정한 다음 기대 생체지수에 해당되는 기대수치만큼 도달하였는지를 판단하는 제8단계;제8단계에서 판단 결과, 제어상태의 현재 생체지수가 기대 생체지수에 도달한 경우에는 제어중지정보를 생성하고, 제어상태의 현재 생체지수가 기대 생체지수에 도달하지 못한 경우에는 추가제어정보를 상기 복합제어기(10)로 전달하는 제9단계;제9단계에서 전달받은 제어중지정보 또는 추가제어정보에 따라 복합제어기(10)가 재배지의 시설 및 환경을 자동제어하는 제10단계;로 이루어진 것을 특징으로 하는 클라우드 기반 작물별 의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 임계 범위는 설정된 기준생체지수 대비 ±5%이고,상기 서버(20)는 현재 생체지수가 설정된 임계 범위를 벗어난 경우에 기대 생체지수와 제어정보를 생성하여 복합제어기(10)로 제어정보를 전달하는 것을 특징으로 하는 클라우드 기반 작물별 의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,재배지의 복합제어기(15)에 무선통신망으로 연결되어 제어정보를 전달받는 재배관리자 단말기(15)가 구비되고,공개특허 10-2025-0038925-3-상기 서버(20)에는 서버관리자 단말기(25)가 무선통신 연결되게 구비되며,상기 서버(20)는 현재 생체지수가 임계 범위의 설정된 기준생체지수의 임계 범위를 벗어나 제어정보를 생성하여해당 재배지의 복합제어기로 전달한 경우에, 서버관리자 단말기(25)로 현재 생체지수와 기대 생체지수를 포함한제어정보를 전달하는 것을 특징으로 하는 클라우드 기반 작물별 의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제10단계를 거친 후 상기 제7단계 ~ 제10단계를 반복 수행하면서 제어상태의 현재 생체지수가 기대 생체지수에 도달한지를 판단하면서 재배지의 시설 및 환경을 자동제어하는 것을 특징으로 하는 클라우드 기반 작물별의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 작물 재배정보는 환경정보와 작물 생육정보를 포함하고,상기 환경정보는 시설 환경정보와 토양(배지) 환경정보로 구성되며, 상기 시설 환경정보는 독립변수로서 대기온도, 대기습도, 이산화탄소, 일사량, 풍향, 풍속, 강우 정보를 포함하고,상기 토양(배지) 환경정보는 독립변수로서 토양EC, 토양온도, 토양수분함량을 포함하며,상기 작물 생육정보는 생육기간 정보와, 카메라에 의해 촬영된 작물의 영상정보를 포함하고, 상기 영상정보에서작물의 초장, 엽수, 엽장, 엽폭, 경경, 관부직경, 생장길이, 줄기굵기, 입자루, 화방폭, 화방길이, 화방높이,꽃수, 화방별개화수, 화방별착과수, 화방별수확수 정보를 확인하는 것을 특징으로 하는 클라우드 기반 작물별의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,상기 생육기간은 작물별로 발아기, 육묘기, 생육기, 수확초기, 수확기로 분류하며, 상기 생육기간에 따라 각기 다른 기준생체지수가 설정되어 있는 것을 특징으로 하는 클라우드 기반 작물별 의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 인공지능 알고리즘은 의사결정트리(Decision Tree), K-최근접이웃(k-Nearest Neighbors), SVM(SupportVector Machines), 인공신경망, K-평균(k-means), 퍼지 로직(Fuzzy Logic) 알고리즘 중 하나가 사용되는 것을특징으로 하는 클라우드 기반 작물별 의사결정지원 스마트팜 재배방법."}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 스마트팜 재배지의 작물 생육정보와 환경정보를 전달받아 미리 학습된 인공지능 알고리즘에 입력하여 작물의 현재 생체지수를 판정한 후 임계범위내에 해당하지 않을 경우에 기대 생체지수 및 기대 생체지수에 도달 하기 위한 제어정보를 생성함으로써 의사결정에 기반한 최적의 제어정보로 재배지의 시설 및 기기를 자동 제어하 (뒷면에 계속)"}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 스마트팜 재배지의 작물 생육정보와 환경정보를 전달받아 미리 학습된 인공지능 알고리즘에 입력하여 작물의 현재 생체지수를 판정한 후 임계범위내에 해당하지 않을 경우에 기대 생체지수 및 기대 생체지수에 도달하기 위한 제어정보를 생성함으로써 의사결정에 기반한 최적의 제어정보로 재배지의 시설 및 기기를 자동 제어 하도록 된 클라우드 기반 작물별 의사결정지원 스마트팜 복합제어시스템에 관한 것이다."}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "농산물의 대량 생산을 위해 농업기술이 지속적으로 발전하고 있는 가운데, 고품질 작물을 위한 정밀농업이 대두 되고 있다. ICT 기술을 활용하여 주변 환경에 최적화된 맞춤형 농업을 의미하는 정밀농업에서는 작물 재배에 영향을 미치는 요인에 관한 정보를 수집하고 그에 대한 정밀 분석을 통하여 불필요한 농자재 및 작업을 최소화하면서 작물 생 산 관리의 효율을 최적화하고 있다. 정밀농업이 요구되는 것은 특정 지역이나 경작지별로 기상 환경 및 지역적 특성이 다르고 이로 인해 시기별 농 업 환경의 변화가 심하기 때문이다. 예를 들어 제주 지역의 40% 이상 면적을 차지하고 지역 총생산의 10% 이상 을 차지하는 감귤 산업은 기후 변화에 취약하며, 제주 지역별로 다양한 기후 특성이 나타나 지역별 데이타를 수 집하고 기후 변화에 따른 감귤 생육상태 분석을 위한 데이타 분석 필요하다. 정밀농업이 구현된 대표적 예로 스마트팜이 있다. 국내 스마트팜 시장규모는 약 6조원에 이르며 첨단 농업을 리 드하고 있는데 국내 스마트팜의 대부분은 하드웨어, 즉 시설 및 제어 분야에 편중되어 있어 시설 비용 및 관리 비용이 크다는 문제가 있다. 구체적으로 자동 환경제어 설비 도입에 필요한 비용은 비닐온실 기준 평균 평당 40~ 50만원에 달하고, 2,000평 규모 기준 스마트팜 초기 도입비용에만 최소 13억 가량이 필요한 실정이다. 특히 시설 및 자동 환경제어 방식의 스마트팜은 표준 통신 프로토콜이 없으며, 고비용의 단일 시스템 안에서만 연계 가능한 구조로 확장성이 떨어지는 한계를 가진다. 기존의 스마트팜 관련 기술을 살펴보면, 예를 들어 특허출원 10-2016-0126771호의 시설재배 시스템의 경우, 농 작물을 효과적으로 재배할 수 있도록 상기 농작물을 재배하기 위한 온실, 상기 온실의 내외에 구비되는 센서 장 치, 온실 환경을 제어하기 위한 시설 제어 기준값을 수신하기 위한 인터페이스 장치, 상기 수신받은 시설 제어 기준값에 기초하여 상기 온실 환경을 제어하는 환경 제어 장치, 및 상기 수신 받은 시설 제어 기준값을 시계열 적으로 저장하기 위한 메모리를 포함하고 있다. 이러한 기술에 따르면, 전문가가 시스템을 조작하는 제어 신호 들을 시계열적으로 저장하고, 이렇게 저장된 데이터에 기초하여 시설재배 시스템을 자동으로 제어시킬 수 있는 장점이 있으나, 스마트팜을 구현하기 위해 고가의 시설 비용이 요구되는 기존의 한계를 벗어나지 못하며 영세한 농가나 노지 농가에 적용하기 어려운 문제가 있다. 또한, 특허출원 10-2021-0064742호의 경우, 스마트 팜 관리를 위한 서버 플랫폼을 제안하였는데, 구체적으로는 스마트 팜 관리를 위한 서버 플랫폼은 스마트 팜에 대한 정보가 저장된 스마트 팜 모듈과 스마트 팜과 관련된 수요자에 대한 정보가 저장된 팜 수요 모듈을 관리하는 스마트 팜 관리 서버; 스마트 팜 모듈에 저장된 스마트 팜과 팜 수요 모듈에 저장된 수요자에 대한 관련성을 탐색하여 연결시키는 스마트 팜 연결 모듈; 및 스마트 팜 연결 모듈의 연결에 따라 매칭이 이루어지면 그에 따라 팜 콘텐츠를 생성하는 팜 콘텐츠 생성 모듈을 포함한다. 이 기술에 따르면, 다수인이 접속하여 할당된 스마트 팜의 상태를 확인하고, 미리 정해진 스케줄에 따라 스마트 팜의 생장 상태가 자동으로 확인될 수 있도록 하는 효과가 있어 스마트팜의 분양 등 농촌 생활 체험에 적용될 수 있으나, 서로 떨어진 원격지의 노지 농가 등을 스마트팜화하여 농업 경쟁력을 높이기에는 역시 한계가 있다. 과수재배를 하는 대부분의 시설 농가는 정밀제어 시스템보다는 저렴하고 단순하면서 사용하기 간편한 시스템 및 농업활동에 시기별로 필요한 데이터 서비스를 선호하고 있다. 이러한 농가들의 요구 사항 및 전술한 관련 기술 의 한계를 고려할 때, 비닐하우스 등의 시설 농가는 물론 일반 노지에서 과수를 재배하는 농가에도 범용적으로 스마트팜을 구현할 수 있는 새로운 서비스가 요구되고 있다. 특히 스마트팜 정보의 부족, 스마트팜 재배를 위한 숙련도 부족 등 전문가에 비해 모든 면에서 지식이 부족하며, 부족한 지식으로 작물별 성장시기별로 농가에서 임의적으로 시설 및 환경기기들을 제어하여 스마트팜 을 할 경우에 작물의 생산효율이 좋지 않아 만족할 만한 소득을 거두지는 못하였다. 더욱이, 지구 온난화로 인하여 지역별 재배 환경이 계속 변하고 있기 때문에, 재배지의 평균 기온 내지 계절별 기온 변화, 재배지의 고도, 경사도 또는 경사향 등의 재배지의 환경정보를 모니터링하면서 최적의 의사결정을 통해 재배지의 시설 및 환경 기기들을 자동제어하여 작물을 재배할 수 있도록 하는 기술이 필요한 실정이다.선행기술문헌 특허문헌 (특허문헌 0001) 공개특허공보 제10-2023-0081690호(2023.06.07. 복합재배관리 의사결정시스템) (특허문헌 0002) 공개특허공보 제10-2023-0084994호(2023.06.13. 농가 환경데이타 수집 및 농업 정보 제공 스마 트팜 플랫폼)"}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기한 문제점을 해결하기 위하여 창안된 것으로, 스마트팜 재배지의 작물 생육정보와 환경정보를 전 달받아 각각의 독립변수별로 평균값을 계산한 후 미리 학습된 인공지능 알고리즘에 입력하여 작물의 현재 생체 지수를 판정하고, 임계범위내에 해당하지 않을 경우에 기대 생체지수 및 기대 생체지수에 도달하기 위한 제어정 보를 생성하여 재배지의 시설 및 기기를 자동 제어하도록 함으로써 작물별로 최적의 의사결정에 따른 제어정보 를 생성하여 작물을 재배하여 생산효율을 극대화시켜 주도록 한 클라우드 기반 작물별 의사결정지원 스마트팜 복합제어시스템을 제공하는 데 있다."}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기의 과제를 해결하기 위한 본 발명의 해결수단은, 재배지의 작물 재배정보를 수신받아 의사결정을통해 재배 지의 시설 및 환경을 자동 제어하여 작물을 재배하는 스마트팜 재배방법에 있어서, 재배지의 환경정보를 포함한 작물 재배정보를 복합제어기에서 취합하여 설정된 시간 간격으로 서버로 전달하는 제1단계; 설정된 시 간간격으로 수신받은 작물 재배정보에서 시설 환경정보와 토양(배지) 환경정보를 추출하여 각 환경정보의 독립 변수별로 평균값을 산정하고, 미리 학습된 인공지능 알고리즘에 입력하여 해당 작물의 현재 생체지수를 판정하 는 제2단계; 판정된 현재 생체지수가 설정된 기준 생체지수의 임계 범위 내에 해당하는지 여부를 판단하여 제어 유무를 출력하는 제3단계; 제3단계에서 현재 생체지수가 임계범위를 벗어난 경우, 기대 생체지수 및 상기 기대 생체지수에 도달하기 위해 시설 및 환경을 제어하기 위한 제어정보를 생성하는 제4단계; 생성된 제어정보와 기 대 생체지수 정보를 재배지에 설치된 상기 복합제어기로 전달하는 제5단계; 상기 복합제어기는 수신받 은 제어정보에 따라 재배지의 시설 및 환경 제어기기들을 자동 제어하는 제6단계; 상기 복합제어기는 재배 지의 시설 및 환경 제어 후 설정된 시간간격으로 변경된 환경정보를 상기 서버로 전달하는 제7단계; 상기 서버는 수신받은 변경된 환경정보에서 독립변수별로 평균값을 산정한 후, 인공지능 알고리즘에 재차 입력하 여 제어상태의 현재 생체지수를 다시 판정한 다음 기대 생체지수에 해당되는 기대수치만큼 도달하였는지를 판단 하는 제8단계; 제8단계에서 판단 결과, 제어상태의 현재 생체지수가 기대 생체지수에 도달한 경우에는 제어중지 정보를 생성하고, 제어상태의 현재 생체지수가 기대 생체지수에 도달하지 못한 경우에는 추가제어정보를 상기 복합제어기로 전달하는 제9단계; 제9단계에서 전달받은 제어중지정보 또는 추가제어정보에 따라 복합제어기 가 재배지의 시설 및 환경을 자동 제어하는 제10단계;로 이루어진다. 상기 임계 범위는 설정된 기준생체지수 대비 ±5%이고, 상기 서버는 현재 생체지수가 설정된 임계 범위를 벗어난 경우에 기대 생체지수와 제어정보를 생성하여 복합제어기로 제어정보를 전달하는 것을 특징으로 한 다. 여기서, 재배지의 복합제어기에 무선통신망으로 연결되어 제어정보를 전달받는 재배관리자 단말기가 구 비되고, 상기 서버에는 서버관리자 단말기가 무선통신 연결되게 구비되며, 상기 서버는 현재 생체 지수가 임계 범위의 설정된 기준생체지수의 임계 범위를 벗어나 제어정보를 생성하여 해당 재배지의 복합제어기 로 전달한 경우에, 서버관리자 단말기로 현재 생체지수와 기대 생체지수를 포함한 제어정보를 전달하는 것 이 바람직하다. 한편, 상기 제10단계를 거친 후 상기 제7단계 ~ 제10단계를 반복 수행하면서 제어상태의 현재 생체지수가 기대 생체지수에 도달한지를 판단하면서 재배지의 시설 및 환경을 자동제어하게 된다. 상기 작물 재배정보는 환경정보와 작물 생육정보를 포함하고, 상기 환경정보는 시설 환경정보와 토양(배지) 환 경정보로 구성되며, 상기 시설 환경정보는 독립변수로서 대기온도, 대기습도, 이산화탄소, 일사량, 풍향, 풍속, 강우 정보를 포함하고, 상기 토양(배지) 환경정보는 독립변수로서 토양EC, 토양온도, 토양수분함량을 포함하며, 상기 작물 생육정보는 생육기간 정보와, 카메라에 의해 촬영된 작물의 영상정보를 포함하고, 상기 영상정보에서 작물의 초장, 엽수, 엽장, 엽폭, 경경, 관부직경, 생장길이, 줄기굵기, 입자루, 화방폭, 화방길이, 화방높이, 꽃수, 화방별개화수, 화방별착과수, 화방별수확수 정보를 확인하게 된다. 상기 생육기간은 작물별로 발아기, 육묘기, 생육기, 수확초기, 수확기로 분류하며, 상기 생육기간에 따라 각기 다른 기준생체지수가 설정되어 있다. 상기 인공지능 알고리즘은 인공신경망, 의사결정나무 중 어느 하나의 알고리즘을 사용한다."}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기의 구성으로 이루어진 본 발명에 따르면, 스마트팜 재배지에서 재배되고 있는 작물별 환경정보를 이용하여 현재 생체지수를 판정한 후 기대 생체지수에 도달하기 위한 제어정보를 생성하여 재배지의 시설 및 기기를 자동 제어함으로써 작물별로 최적의 재배조건 결정으로 생산량 및 작물 재배농가의 소득을 향상시켜 줄 수 있게 된다."}
{"patent_id": "10-2023-0121493", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시예에 따른 클라우드 기반 작물별 의사결정지원 스마트팜 복합제어시스템을 상세히 설명하기로 한다. 도시된 바와 같이, 본 발명에 따른 클라우드 기반 작물별 의사결정지원 스마트팜 복합제어시스템은 스마트팜 재 배농가의 재배지 작물 재배정보를 수신받아 재배지의 시설 및 환경을 자동 제어하여 작물을 재배하도록 하도록 스마트팜 재배방법이며, 최적의 의사결정을 통해 시설 및 환경 기기들을 자동 제어함으로써 작물의 생산량 및 농가소득을 높여주고, 소요되는 재배비용을 최소화시켜 주게 된다. 스마트팜 재배시스템은 스마트팜 재배농가의 재배지에 시설 및 환경 기기들을 제어하기 위한 복합제어기가 설치되어 있고, 원격지에 설치되는 서버와 사전에 서로 무선통신망으로 연결되도록 구비되어 있다. 스마트팜 재배지의 시설 및 환경 기기들은 첨부의 도 3에 도시된 바와 같이, 시설로서 천창, 측장, 커튼이 있으 며, 환경 기기들로서 관수, 분무기, 이산화탄소, 냉난방기, 보일러, 환풍기, 팬 류, 밸브류 등이 있다.또한 재배지에는 환경상태를 감지하기 위해 실내에 온습도 센서를 포함한 여러가지 센서류가 설치되어 있으며, 실내 토양의 온도나 수분을 센싱하기 위한 센서류가 설치되어 있고, 실외에도 온습도 센서와 풍량이나 풍속센서 등을 포함한 여러 센서류가 설치되어 있다. 재배지가 온실 등일 경우에 온실의 실내에 설치되는 센서류는 시설 환경정보 센싱부와 토양 환경정보 센싱부로 명명하고, 실외에 설치되는 센서류는 실외 환경정보 센싱부로 명명한다. 구체적으로 시설 환경정보 센싱부는 온도센서, 습도센서, 이산화탄소 농도 감지센서를 포함하고, 토양 환경정보 센싱부는 토양 온도센서, 토양 습도센서, 토양 EC 감지센서를 포함할 수 있다. 도한, 실외환경정보 센싱부는 온도센서, 습도센서, 풍향센서, 풍속센서, 일사량 감지센서, 강우센서를 포함할 수 있다. 시설 환경정보 센싱부와 토양 환경정보 센싱부 및 실외환경정보 센싱부에서 센싱된 감지정보는 모두 해당 재배 지에 설치되는 복합제어기로 전달되어 취합된다. 복합제어기는 재배지의 시설 및 환경 기기들의 제어동작을 수행하게 되고, 재배지에 설치되는 센싱부로부터 감지정보를 전달받아 이를 취합하여 서버로 전달하게 되는 것이다. 서버로 전달되는 데이터는 예로서 도 2에 도시된 바와 같이 정리되어 모니터를 통해 확인할 수 있다. 서버는 원격지에 설치되어 있으며, 인공지능 알고리즘이 설치되어 있으며, 복합제어기로부터 환경정보 와 생육정보를 포함한 작물 재배정보를 수신받아 현재 생체지수를 판정하고, 기준생체지수와 비교를 통해 자동 제어 여부를 판단한다. 상기 복합제어기와 서버에는 각각 후술하는 재배관리자 단말기와 서버관리자 단말기가 통신망 을 통해 정보를 수신받아 모니터링할 수 있도록 구비되며, 정보를 수신하여 모니터링하기 위해 전용 앱(어플리 케이션)이 설치된다. 본 발명에서의 의사결정을 통한 스마트팜 재배방법은 재배지의 작물 생육정보와 환경정보를 전달받아 미리 학습 된 인공지능 알고리즘에 입력하여 작물의 현재 생체지수를 판정한 후 임계범위내에 해당하지 않을 경우에 기대 생체지수 및 기대 생체지수에 도달하기 위한 제어정보를 생성함으로써 인공지능에 의한 최적의 의사결정에 기반 하여 재배지의 시설 및 기기를 자동 제어함으로써 작물을 재배하게 된다. 구체적으로, 총 10단계의 과정을 통해 의사결정을 통해 최적의 제어정보를 생성하여 작물을 재배하게 되는 것이다. 제1단계: 스마트팜 재배지의 복합제어기는 여러 센싱부에서 센싱된 감지정보를 토대로 현재 재배지의 환경 정보와 생육정보를 포함한 작물 재배정보를 취합하여 설정된 시간 간격으로 서버로 전달하게 된다. 제2단계: 서버는 설정된 시간간격으로 수신받은 작물 재배정보에서 시설 환경정보와 토양(배지) 환경정보를 추출하여 각 환경정보의 독립변수별로 평균값을 산정한다. 이후, 산정된 독립변수별 평균값을 미리 학습된 인공지능 알고리즘에 입력하여 해당 작물의 현재 생체지수를 판 정한다. 환경정보의 독립변수들로서, 작물의 성장에 필수적인 독립변수들은 도 8 및 도 9와 같이 대기온도, 대기습도, 이산화탄소, 근권부 EC로 구성할 수 있다. 구체적으로, 작물 재배정보는 환경정보와 작물 생육정보를 포함하고, 상기 환경정보는 시설 환경정보와 토양(배 지) 환경정보로 구성된다. 상기 시설 환경정보는 독립변수로서 대기온도, 대기습도, 이산화탄소, 일사량, 풍향, 풍속, 강우 정보를 포함한 다. 또한, 상기 토양(배지) 환경정보는 독립변수로서 토양EC, 토양온도, 토양수분함량을 포함한다. 작물 생육정보는 생육기간 정보와, 카메라에 의해 촬영된 작물의 영상정보를 포함하고, 상기 영상정보에서 작물 의 초장, 엽수, 엽장, 엽폭, 경경, 관부직경, 생장길이, 줄기굵기, 입자루, 화방폭, 화방길이, 화방높이, 꽃수, 화방별개화수, 화방별착과수, 화방별수확수 정보를 확인하게 된다.또한, 작물의 생육정보로서 냄새센서를 설치하여 작물의 향기를 감지하여 향기 정보를 전달할 수도 있다. 상기 생육기간은 작물별로 발아기, 육묘기, 생육기, 수확초기, 수확기로 분류할 수 있다. 본 발명에서는 현재 생체지수의 판정을 위한 데이터로서 환경정보의 각 독립변수들을 이용하여 현재 생체지수를 판단하게 된다. 생체지수의 판정을 위해, 환경정보의 독립변수들(이산화탄소, 배지pH, 일사량, 근권온도, 근권수분, 대기온도, 대기습도, 근권EC, 배지EC)과 생체지수(PIES)의 상관관계를 확인하기 위해, 9가지의 환경정보를 독립변수로 하 고 생체지수(PIES)를 종속변수로 하여 시험하였으며, 인공지능 알고리즘에서는 이 시험데이터를 기준으로 생체 지수를 판정하게 된다. 상관관계에 대한 산점도 그래프가 도 8에 도시되어 있다. 도 8에 도시된 바와 같이, 각 독립변수들간의 상관관 계와 독립변수와 종속변수인 생체지수 간의 상관관계를 확인할 수 있다. 따라서, 독립변수들간, 또는 독립변수와 생체지수 간의 상관관계 데이터를 이용한 독립변수별로 평균값이 입력 되면 상관관계를 참고하여 의사결정하여 현재 생체지수를 판정하게 되는 것이고, 기대 생체지수에 도달하기 위 한 제어정보 생성시 각 독립변수별 가동여부를 결정할 수 잇는 것이다. 제3단계: 인공지능 알고리즘에서 판정된 현재 생체지수가 설정된 기준 생체지수의 임계 범위 내에 해당하는지 여부를 판단하고, 임게 범위 내의 해당여부에 따라 제어정보를 생성할 것인지 아닌지를 확인한다. 제4단계: 제3단계에서 현재 생체지수가 임계범위를 벗어난 것으로 확인된 경우, 기대 생체지수 및 상기 기대 생 체지수에 도달하기 위해 시설 및 환경을 제어하기 위한 제어정보를 생성한다. 기대 생체지수는 수십만건의 데이터를 이용하여 작물별로 생육기간에 따라 생육되어야 하는 생체지수를 결정한 것이며, 재배지의 시설 및 환경 기기들의 자동제어를 통해 목표하고자 하는 생체지수이다. 제어정보는 시설 제어정보와 환경 제어정보를 포함한다. 예로서, 도 8 및 도 9와 같이 복합제어기로부터 전달받은 환경정보 중 필수 독립변수(대기온도, 대기습도, 이산 화탄소, 근권부 EC)들과 현재의 작물 생육기간을 포함한 생육정보를 토대로 현재 생체지수를 판정하게 되는 것 이고, 현재 생체지수 대비 생육기간에 따른 기대 생체지수를 출력하게 된다. 기대 생체지수에 도달하기 위해, 시설 및 환경 기기들의 제어를 위해 제어정보(시설 제어정보, 환경 제어정보) 를 생성하게 되는 것이고, 이렇게 생성된 제어정보를 복합제어기로 전달하여 복합제어기에서 재배지의 시설 및 환경 기기들을 자동 제어함으로써 목표하고자 하는 기대 생체지수에 도달되게 하는 것이다. 제5단계: 서버는 의사결정모델의 결과를 도 8 및 도 9와 같이 출력해주고, 생성된 제어정보와 기대 생체지수 정 보를 재배지에 설치된 상기 복합제어기로 전달하게 된다. 제6단계: 복합제어기는 수신받은 제어정보에 따라 재배지의 시설 및 환경 제어기기들을 자동 제어하게 된다. 예로서, 도 3과 같이 복합제어기는 서버에서 수신된 제어정보에 따라 시설(천창, 측장)을 제어하고, 환경 기기 (이산화탄소 발생기, 냉난방기, 보광등, 공기순환팬, 배기팬)를 가동시켜 줄 수 있다. 의사결정모델의 결과가 예로서 도 8과 같이 판정한 현재 생체지수가 13이고, 기대 생체지수가 16일 경우에 그에 도달하기 위한 시설 및 환경기기들 중 일부를 가동시켜 기대 생체지수에 도달하도록 제어정보를 전달하는 것이다. 또한, 도 10과 같이 판정한 현재 생체지수가 16으로 높고, 기대 생체지수가 14일 경우에는 햇빛을 제외한 모든 시설 및 환경기기들의 가동을 중지시키도록 제어정보를 전달하는 것이다. 제7단계: 복합제어기는 수신받은 제어정보에 따라 재배지의 시설 및 환경 기기들을 제어하게 되고, 제어 후 에는 센싱부로부터 전달받은 감지정보를 취합하여 설정된 시간간격으로 변경된 환경정보를 상기 서버로 전 달하게 된다. 제8단계: 서버는 수신받은 변경된 환경정보에서 독립변수별로 평균값을 산정한 후, 인공지능 알고리즘에 재 차 입력하여 제어상태(제어정보에 따라 시설 및 환경 기기들의 제어과정을 거친 상태)의 현재 생체지수를 다시 판정한 다음 기대 생체지수에 해당되는 기대수치만큼 도달하였는지를 판단한다.제9단계: 제8단계에서 판단 결과, 제어상태의 현재 생체지수가 기대 생체지수에 도달한 경우에는 제어중지정보 를 생성하고, 제어상태의 현재 생체지수가 기대 생체지수에 도달하지 못한 경우에는 추가제어정보를 생성하여 상기 복합제어기로 전달한다. 제10단계: 복합제어기는 제9단계에서 전달받은 제어중지정보 또는 추가제어정보에 따라 재배지의 시설 및 환경 기기들을 자동 제어한다. 즉, 제어중지정보를 전달받은 경우에는 시설 및 환경 기기들의 제어동작상태를 중지시켜 주는 것이고, 이때의 재배지 제어는 통상의 스마트팜 제어와 동일하게 사전에 설정된 스케줄대로 제어된다. 또한 추가제어정보를 전달받은 경우에는 추가되는 제어정보에 따라 해당되는 시설 및 환경기기들을 자동 제어하 게 된다. 상기와 같은 10단계를 거쳐 재배지의 환경정보를 포함한 재배정보를 이용하여 현재 생체지수 판정 후 의사결정 을 통해 기대 생체지수와 제어정보를 생성하여 재배지의 시설 및 환경 기기를 자동 제어함으로써 의사결정에 의 거한 최적의 시마트팜 재배가 가능하도록 한 것이다. 이때, 상기 제10단계를 거친 후에는 상기 제7단계 ~ 제10단계를 반복 수행하면서 제어상태의 현재 생체지수가 기대 생체지수에 도달한지를 판단하면서 재배지의 시설 및 환경을 자동 제어하게 되며, 기대 생체지수만큼 도달 한 경우에 자동 제어가 중지되는 것이다. 본 발명에서 상기 현재 생체지수의 판정 후 임계범위에 해당되는지를 살펴볼 경우, 임계 범위는 작물별로 설정 된 기준생체지수 대비 ±5%로 지정할 수 있고, 현재 생체지수가 설정된 임계범위를 벗어난 경우에 기대 생체지 수와 제어정보를 생성하게 되는 것이며, 서버는 생성된 제어정보를 복합제어기로 전달하게 되는 것이다. 상기 임계 범위는 작물별로 조금씩 다르게 지정될 수 있으며, 작물의 생육기간에 따라 다르게 지정될 수 있다. 또한, 작물의 환경정보에 대한 기준수치는 작물별로 생육기간에 따라 다르게 지정될 수 있고, 상기 기준생체지 수도 작물의 생육기간에 따라 각기 다른 수치로 설정되는 것이 바람직하다. 예로서, 작물의 환경정보는 도 5에 도시된 바와 같이, 생육기간에 따라 모두 가능하게 설정해놓을 수도 있으나 작물별로 온도나 토양에 민감한 작물의 경우 다르게 설정될 수 있다. 도 6 및 도 7은 인공지능 알고리즘으로서 환경 및 토양 정보를 데이터로 하여 의사결정트리를 사용하여 1단계 깊이로 의사결정하는 예시를 보인 도면이다. 한편, 재배농가에는 재배지의 복합제어기에 무선통신망으로 연결되어 제어정보를 전달받는 재배관리자 단말 기가 구비될 수 있다. 재배관리자 단말기는 별도의 전용 단말기이거나 재배농가의 관리자가 사용하는 태플릿이나 스마트폰일 수 있으며, 전용 어플을 다운받아 실행하여 사용할 수 있다. 그리고 상기 서버에는 서버관리자 단말기가 무선통신 연결되게 구비된다. 상기 서버는 현재 생체지수가 임계 범위의 설정된 기준생체지수의 임계 범위를 벗어나 제어정보를 생성하여 해당 재배지의 복합제어기로 전달한 경우에, 서버관리자 단말기로 현재 생체지수와 기대 생체지수를 포함한 제어정보를 전달하게 된다. 서버로 수신되는 재배농가의 작물 재배정보와 인공지능 알고리즘에서 판정한 현재 생체지수 및 기대 생체지수와 제어정보들은 모두 재배농가별로 별도 DB에 저장된다. 본 발명에서 인공지능 알고리즘은 인공지능에 의해 기계학습하는 알고리즘으로 구축될 수 있다. 예로서 의사결 정트리(Decision Tree), K-최근접이웃(k-Nearest Neighbors), SVM(Support Vector Machines), 인공신경망, K- 평균(k-means), 퍼지 로직(Fuzzy Logic) 알고리즘 중 하나 이상이 사용된다. 본 발명에서는 환경 정보 데이터 20만개를 별도로 수집하여 인공지능 알고리즘에 입력하여 분류성능을 평가하였 으며, 이를 통해 높은 분류성능을 갖는 파라미터를 최적화하였다. 부호의 설명10: 복합제어기 15: 재배관리자 단말기 20: 서버 25: 서버관리자 단말기"}
{"patent_id": "10-2023-0121493", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 클라우드 기반 작물별 의사결정지원 스마트팜 복합제어시스템의 구성도, 도 2는 본 발명의 일실시예에 따른 재배지의 시설 및 환경 정보를 전달받아 서버에 저장한 후 모니터에 출력되 는 화면의 예시도, 도 3은 본 발명의 일실시예에 따른 재배지의 시설 및 환경 기기의 예시도, 도 4는 본 발명의 일실시예에 따른 장미와 딸기 및 토마토의 생육기간별 기준 생육환경 예시도, 도 5는 본 발명의 일실시예에 따른 생육기간별 시설 환경정보의 의사결정트리를 보인 예시도, 도 6은 본 발명의 일실시예에 따른 생육기간별 토지 환경정보의 의사결정트리를 보인 예시도, 도 7은 본 발명의 일 실시예에 따른 환경정보의 각 독립변수들 간의 상관관계와 독립변수와 생체지수(PIES)간의 상관관계를 설명하기 위한 산점도 그래프. 도 8 및 도 9는 본 발명의 일 실시예에 따른 멜론과 토마토의 재배에 따른 인공지능 알고리즘의 의사결정 결과 통지서의 예시도."}
