{"patent_id": "10-2022-0084923", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0008049", "출원번호": "10-2022-0084923", "발명의 명칭": "호흡기 감염병 확산 예측 방법", "출원인": "에스이테크놀로지", "발명자": "이중윤"}}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "호흡기 감염병에 따른 감염역학인자에 해당되는 공개 데이터와 비공개 데이터로 이루어진 원천 데이터를 수집하는 단계(S1000)와;상기 수집된 원천 데이터를 가공하여 인공지능학습용 데이터로 변환시키는 데이터 가공 단계(S2000)와;상기 가공된 인공지능학습용 데이터를 인공지능 학습시키는 머신러닝 학습 단계(S3000)와;상기 학습된 인공지능의 산출물로 호흡기 감염병의 확산 예측 결과를 보고하는 결과 추정 단계(S4000)를 포함하고,상기 데이터 가공 단계(S2000)는 감염역학인자에 해당되는 원천 데이터 중 일정한 기간 내에서 발생되는 데이터를 기반으로 지역별 정책 데이터와 지역별 개별 시민 행동 특성 데이터, 지역별 집회/집단 행동 특성 데이터,지역별 물리적 특성 데이터를 설정하는 지역별 감염자 발생 수 데이터 가공 단계(S2100)와; 상기 지역별 감염자발생 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간 인구 이동량에 따라인구 이동량 데이터를 설정하는 지역간 인구 이동량 데이터 가공 단계(S2200)와; 상기 지역간 인구 이동량 데이터 가공이 완료되면, 일정 기간내에서 발생하는 지역 감염자 발생 수(small y1)와 지역간 인구 이동량(smally2)을 이용하여 일정 기간내에서 지역 유출 감염자 수 데이터를 설정하는 지역별 감염자 유출입 데이터 가공 단계(S2300)를 포함하고,상기 지역별 감염자 유출입 데이터 가공 단계(S2300)는 지역별 감염자 발생 수 데이터 가공 단계(S2100)를 통해나온 데이터 중 지역별 감염자 발생 수(small y1)를 구하는 단계(S3110)와. 지역간 인구 이동량 데이터 가공 단계(S2200)를 통해 나온 데이터 중 지역간 인구 이동량(small y2)을 구하는 단계(S3120)와, 상기 지역별 감염자발생 수(small y1)와 지역간 인구 이동량(small y2)을 곱하여 각 지역 기준으로 합산하여 지역별 감염자 유출입수량(small y3)을 구하는 단계(S3150)를 포함하는 것을 특징으로 하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 원천 데이터를 수집하는 단계(S1000)에서, 원천 데이터는 호흡기 감염병 확산 특성 테이터, 일정한 기간내에서 발생되는 감염자 발생수 테이터, 감염자 이동 데이터, 지역 면적 데이터, 지역 인구 데이터, 지역간 인구 이동량(이동 인구량) 데이터, 마스크 판매량 데이터, 집회 발생 수 데이터, 집회 규모 데이터, 지역 청결 수준 데이터, 비말 전파 용이 이용 시설 수 데이터, 다중 이용 시설 개수 데이터 및 지역정책 데이터가 포함되는것을 특징으로 하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 지역별 감염자 발생 수 데이터 가공 단계(S2100)는,감염역학인자에 해당되는 원천 데이터를 이용해 감염자 발생지역의 지역정책의 단계를 설정하는 지역정책 데이터 가공 단계(S2110)와;상기 지역정책 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 개별 시민이 지역 정책을 잘 준수하였는지를 판단하는 지역별 개별 시민 행동 특성 데이터 가공 단계(S2120)와;상기 지역별 개별 시민 행동 특성 데이터 가공이 완료되면 감염역학인자에 해당되는 원천 데이터를 이용해 지역별 집회/집단(집회나 집단)이 지역정책을 잘 준수하였는지를 판단하는 지역별 집회/집단(집회나 집단) 행동 특성 데이터 가공 단계(S2130)와;상기 지역별 집회/집단(집회나 집단) 행동 특성 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터공개특허 10-2024-0008049-3-를 이용해 각 지역별 물리적 특성을 데이터화시키는 지역별 물리적 특성 데이터 가공 단계(S2140)를 포함하는것을 특징으로 하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 지역정책 데이터 가공 단계(S2110)는,감염역학인자에 해당되는 원천 데이터를 이용해 감염자 발생지역의 사회적거리두기 레벨을 설정하는 사회적 거리두기 시행 단계 데이터 가공 단계(S2111)와; 상기 사회적거리두기 시행 단계 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 이동제한조치 레벨을 설정하는 이동제한조치 시행 수준 데이터 가공 단계(S2112)와;상기 이동제한조치 시행 수준 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 마스크착용 요구 수준 레벨을 설정하는 마스크 착용 요구 수준 데이터 가공 단계(S2113)와; 상기 마스크 착용 요구 수준 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 밀폐공간환기 요구 수준 레벨을 설정하는 밀폐공간 환기 요구 수준 데이터 가공 단계(S2114)를 포함하는 것을 특징으로하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 지역별 개별 시민 행동 특성 데이터 가공 단계(S2120)는,설정된 사회적 거리두기 시행 단계를 일정한 기간 동안 수행한 후, 발생되는 감염자 발생수 테이터를 이용하여설정된 단계와 일정한 기간 동안 준수하였는지를 판단하는 사회적거리두기 준수 수준 데이터 가공 단계(S2121)와;상기 사회적거리두기 준수 수준 데이터 가공이 완료되면, 설정된 이동제한조치 시행 수준 기간동안 발생되는 감염자 발생수 테이터를 이용하여 설정된 기간동안 적절히 이행되었는지를 판단하는 이동제한조치 준수 수준 데이터 가공 단계(S2122)와;상기 이동제한조치 준수 수준 데이터 가공이 완료되면, 설정된 마스크 착용 요구 수준 단계를 일정한 기간 동안수행한 후 발생되는 감염자 발생수 테이터를 이용하여 설정한 일정한 기간 동안 마스크 착용 요구 수준을 준수하였는지를 판단하는 마스크 착용 요구 준수 수준 데이터 가공 단계(S2123)와;상기 마스크 착용 요구 준수 수준 데이터 가공이 완료되면, 설정된 밀폐공간 환기 요구 수준 단계를 일정한 기간 동안 수행한 후 발생되는 감염자 발생수 테이터를 이용하여 일정한 기간 동안 설정된 밀폐공간 환기 요구 수준을 준수하였는지를 판단하는 밀폐공간 환기 요구 준수 수준 데이터 가공 단계(S2124)를 포함하는 것을 특징으로 하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서,상기 지역별 집회/집단(집회나 집단) 행동 특성 데이터 가공 단계(S2130)는, 집회 발생 수 데이터를 이용해 집회 발생 건수를 가공하는 집회 발생 수 데이터 가공 단계(S2131)와;상기 집회 발생 수 데이터 가공이 완료되면, 각 집회의 참여 인원으로 설정되는 집회 규모 데이터를 이용해 각각의 집회의 규모를 가공하는 집회 규모 데이터 가공 단계(S2132)와;상기 집회 규모 데이터 가공이 완료되면, 사회적 거리두기 준수 수준, 집회 발생 수 및 집회 규모를 이용해 집회시 사회적 거리두기 준수 수준을 가공하는 집회시 사회적 거리두기 준수 수준 데이터 가공 단계(S2133)와;상기 집회시 사회적 거리두기 준수 수준 데이터 가공이 완료되면, 마스크 판매량과 인구수를 이용해 집회 시 마스크 착용 수준을 가공하는 집회시 마스크 착용 수준 데이터 가공 단계(S2134)를 포함하는 것을 특징으로 하는호흡기 감염병 확산 예측 방법.공개특허 10-2024-0008049-4-청구항 7 제3항에 있어서, 상기 지역별 물리적 특성 데이터 가공 단계(S2140)는,감염역학인자에 해당되는 원천 데이터 중 지역 청결 수준 데이터를 이용해 지역 청결 수준의 레벨을 설정한 후,일정한 기간 내에서 발생되는 감염자 발생수 테이터를 이용하여 설정된 지역 청결 수준에 따라 가공하는 지역별청결 수준 데이터 가공 단계(S2141)와;상기 지역별 청결 수준 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 인구수 절대값을 가공하는 지역별 인구수 데이터 가공 단계(S2142)와;상기 지역별 인구수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 인구밀도를 가공하는 지역별 인구밀도 데이터 가공 단계(S2143)와;상기 지역별 인구수와 인구밀도 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 비말전파 용이한 시설데이터를 가공하는 지역별 비말전파 용이 시설 수 데이터 가공 단계(S2144)와;상기 지역별 비말전파 용이 시설 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 비말전파 용이한 시설의 밀도 데이터를 가공하는 지역별 비말전파 용이 시설 밀도 데이터 가공 단계(S2145)와;상기 지역별 비말전파 용이 시설 밀도 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역다중이용시설 수를 가공하는 지역별 다중이용 시설 수 데이터 가공 단계(S2146)와;상기 지역별 다중이용 시설 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 다중이용시설 밀도를 가공하는 지역별 다중이용시설 밀도 데이터 가공 단계(S2147)를 포함하는 것을 특징으로 하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 지역간 인구 이동량 데이터 가공 단계(S2200)는,감염역학인자에 해당되는 원천 데이터를 이용해 지역간 항공편 이동 인구량을 일정한 기간 간격으로 가공하는지역간 항공편 이동 인구 데이터 가공 단계(S2210)와;상기 지역간 항공편 이동 인구 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간열차편 이동 인구량을 일정한 기간 간격으로 가공하는 지역간 열차편 이동 인구 데이터 가공 단계(S2220)와;상기 지역간 열차편 이동 인구 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간차량편 이동 인구량을 일정한 기간 간격으로 가공하는 지역간 차량편 이동 인구 데이터 가공 단계(S2230)와;상기 지역간 차량편 인구이동 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간해운편 이동 인구량을 일정한 기간 간격으로 가공하는 지역간 해운편 이동 인구 데이터 가공 단계(S2240)를 포함하는 것을 특징으로 하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 머신러닝 학습 단계(S3000)는,데이터 가공 단계(S2000)에서 각각 가공된 데이터를 이용하여 각 항목별로 감염자 발생 예측 모델 구조를 설정하여 지역별 감염자 수량 예측(Big Y)을 하는 감염자 발생 예측 모델 구조 수립 단계(S3100)와;데이터 가공 단계(S2000)에서 각각 가공된 데이터를 항목별로 적합한 기계학습 알고리즘을 선택하는 예측 모델별 머신러닝 알고리즘 선택하는 단계(S3200)와;상기 예측 모델별 머신러닝 알고리즘이 선택되면, 인공지능학습용 데이터를 처리하여 호흡기 감염병 확산을 예측하기 위해 선택된 머신러닝을 수행하는 단계(S3300)를 포함하고,공개특허 10-2024-0008049-5-상기 머신러닝을 수행하는 단계(S3300)에서, 머신러닝 방식은 딥런닝(Deep Learning), 베이지안 릿지(BayesianRidge), 랜덤 포레스트(Random Forest), 결정트리(Decision Tree), 그레디언트 부스트(Gradient Boosting), 선형회귀(Linear Regression), 가우시안 프로세스(Gaussian Process), SVR(Support Vector Regression),MLP(Multi-layer Perceptron) 및 LSTM (Long Short-Term Memory) 중 하나를 선택하여 수행하는 것을 특징으로하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 감염자 발생 예측 모델 구조 수립 단계(S3100)는,지역별 감염자 발생 수(small y1)를 구하는 단계(S3110)로부터 구한 지역별 감염자 발생수(small y1)와, 지역간인구 이동량(small y2)을 구하는 단계(S3120)로부터 구한 지역간 인구 이동량(small y2)과, 지역별 감염자 유출입 수량(small y3)을 구하는 단계(S3150)에서 구한 지역별 감염자 유출입 수량(small y3)을 이용하여 지역별 감염자 수량 예측(Big Y)을 하는 단계(S3170)를 포함하며,상기 지역별 감염자 수량 예측(Big Y)을 하는 단계(S3170)는 일정한 기간내에서 지역별 감염자 발생 수(smally1)와 해당 지역별 감염자 유출입 수량(small y3)을 합산하여 도출하는 것을 특징으로 하는 호흡기 감염병 확산예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제9항에 있어서,상기 예측 모델별 머신러닝 알고리즘 선택 단계(S3200)는,감염자 발생 예측 모델 구조 수립 단계(S3100)에서, 지역별 감염자 발생 수(small y1)의 기계학습 알고리즘을선택하는 small y1 추정 기계학습 알고리즘 선택 단계(S3210)와;감염자 발생 예측 모델 구조 수립 단계(S3100)에서, 지역간 이동 인구량(small y2)의 기계학습 알고리즘을 선택하는 small y2 추정 기계학습 알고리즘 선택 단계(S3220)와;감염자 발생 예측 모델 구조 수립 단계(S3100)에서, 지역별 감염자 유출입 수량(small y3)의 기계학습 알고리즘을 선택하는 small y3 추정 기계학습 알고리즘 선택 단계(S3230)와;감염자 발생 예측 모델 구조 수립 단계(S3100)에서, 지역별 감염자 수량 예측(Big Y)의 기계학습 알고리즘을 선택하는 Big Y 추정 기계학습 알고리즘 선택 단계(S3240)를 포함하고,상기 small y1 추정 기계학습 알고리즘 선택 단계(S3210), small y2 추정 기계학습 알고리즘 선택 단계(S3220),small y3 추정 기계학습 알고리즘 선택 단계(S3230) 및 Big Y 추정 기계학습 알고리즘 선택 단계(S3240)에서 기계학습(머신러닝) 알고리즘이 선택되면, 머신러닝 방식은 딥런닝(Deep Learning), 베이지안 릿지(BayesianRidge), 랜덤 포레스트(Random Forest), 결정트리(Decision Tree), 그레디언트 부스트(Gradient Boosting), 선형회귀(Linear Regression), 가우시안 프로세스(Gaussian Process), SVR(Support Vector Regression),MLP(Multi-layer Perceptron) 및 LSTM (Long Short-Term Memory) 중 하나를 선택하여 수행하는 것을 특징으로하는 호흡기 감염병 확산 예측 방법."}
{"patent_id": "10-2022-0084923", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,상기 결과 추정 단계(S4000)는,머신러닝을 통해 나온 결과를 추정하는 추정 단계(S4100)와;상기 머신러닝을 통해 나온 추정된 호흡기 감염병 확산 예측 결과를 보고하는 결과 보고 단계(S4200)를 포함하고,상기 결과 보고 단계(S4200)에서, 예측 결과 보고는 기간별, 날짜별로 감염병 확진자의 증감율을 나타내는 그래프나 테이블로 표시하는 것을 특징으로 하는 호흡기 감염병 확산 예측방법.공개특허 10-2024-0008049-6-"}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 호흡기 감염병 확산 예측 방법은, 호흡기 감염병에 따른 감염역학인자에 해당되는 공개 데이터와 비공 개 데이터로 이루어진 원천 데이터를 수집하는 단계(S1000)와; 상기 수집된 원천 데이터를 가공하여 인공지능학 습용 데이터로 변환시키는 데이터 가공 단계(S2000)와; 상기 가공된 인공지능학습용 데이터를 인공지능 학습시키 는 머신러닝 학습 단계(S3000)와; 상기 학습된 인공지능의 산출물로 호흡기 감염병의 확산 예측 결과를 보고하는 결과 추정 단계(S4000)를 포함하는 것을 특징으로 한다."}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 호흡기 감염병 확산 예측 방법에 관한 것으로, 특히 호흡기 감염병 확산에 관련된 원천 데이터를 인 공지능에 적용하여 데이터를 가공, 학습하여 정확하게 호흡기 감염병 확산을 예측하는 호흡기 감염병 확산 예측 방법에 관한 것이다."}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전염병은 전파력이 매우 높아서 중요한 관리 대상이며, 이러한 전염병 관리를 위한 기술이 한국등록특허공보 제 10-1779705호(특허문헌 1)에 공개되어 있다. 특허문헌 1은 사물 인터넷기반 신종 호흡기 감염병 예측 대응 플랫폼 시스템에 관한 것이다. 특허문헌 1에 공개 된 호흡기 감염병 예측 대응 플랫폼 시스템은 호흡기 감염병 예측기, 스마트 단말, 진단부 및 통신 모듈을 포함 하여 구성된다. 특허문헌 1의 호흡기 감염병 예측기는 감염 병원균 바이러스의 항체를 주입하고, 호흡기 감염병 의 해당 감염 병원균 바이러스에 따른 광원의 빛 세기, 파장, 색상을 측정하여 감염 병원균 바이러스를 감지하 며, 스마트 단말은 호흡기 감염병의 해당 감염 병원균 바이러스에 대하여 어플리케이션을 이용한 사용자의 자가 진단이 가능하다. 진단부는 호흡기 감염병에 관한 사용자 정보 및 호흡기 감염병의 해당 감염 병원균에 대한 정 보를 저장하고, 통합, 비교, 분석하여 호흡기 감염병을 예측하며, 통신 모듈은 호흡기 감염병 예측기, 스마트 단말, 진단부 간에 감염 병원균 바이러스 결과, 자가진단 결과, 호흡기 감염병 예측 결과를 포함하는 호흡기 감 염병 정보 및 각각의 결과에 따른 대응 방안을 공유하도록 한다. 특허문헌 1과 같은 종래의 호흡기 감염병 예측 대응 플랫폼 시스템은 병원이나, 지하철, 비행기 등 폐쇄된 공간 의 공기 중 호흡기 감염병, 병원균, 바이러스의 존재 유무를 실시간으로 모니터링하고, 사물인터넷 기반 호흡기 감염병 관련 시설, 장치, 의료진들과 네트워킹을 통해 발병 예측, 예방, 대응할 수 있도록 하고 있다. 특허문헌 1과 같은 종래의 호흡기 감염병 예측 대응 플랫폼 시스템은 감병원에 관련된 원천 데이터를 인공지능 에 적용하여 호흡기 감염병 확산을 예측하기 위해서는 전체 인구수나 전체 인구 중 감염자 수와 같은 정량적인 정보는 용이하게 적용할 수 있으나 정성적인 정보 즉, 감염병을 예방하기 위한 사회적인 노력 등에 대한 정보가 적용되지 않음으로써 호흡기 감염병 확산의 예측의 신뢰성을 저하시킬 수 있는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) : 한국등록특허공보 제10-1779705호"}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 전술한 문제점을 해결하기 위한 것으로, 호흡기 감염병 확산에 관련된 정량적인 데이터와 정 성적인 데이터를 인공지능에 적용하여 가공, 학습하여 정확하게 호흡기 감염병 확산을 예측하는 호흡기 감염병 확산 예측 방법을 제공함에 있다."}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 호흡기 감염병 확산 예측 방법은, 호흡기 감염병에 따른 감염역학인자에 해당되는 공개 데이터와 비 공개 데이터로 이루어진 원천 데이터를 수집하는 단계와; 상기 수집된 원천 데이터를 가공하여 인공지능학습용 데이터로 변환시키는 데이터 가공 단계와; 상기 가공된 인공지능학습용 데이터를 인공지능 학습시키는 머신러닝 학습 단계와; 상기 학습된 인공지능의 산출물로 호흡기 감염병의 확산 예측 결과를 보고하는 결과 추정 단계를 포함하고, 상기 데이터 가공 단계는 감염역학인자에 해당되는 원천 데이터 중 일정한 기간 내에서 발생되는 데 이터를 기반으로 지역별 정책 데이터와 지역별 개별 시민 행동 특성 데이터, 지역별 집회/집단 행동 특성 데이 터, 지역별 물리적 특성 데이터를 설정하는 지역별 감염자 발생 수 데이터 가공 단계와; 상기 지역별 감염자 발생 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간 인구 이동량에 따라 인 구 이동량 데이터를 설정하는 지역간 인구 이동량 데이터 가공 단계와; 상기 지역간 인구 이동량 데이터 가공이 완료되면, 일정 기간내에서 발생하는 지역 감염자 발생 수(small y1)와 지역간 인구 이동량(small y2)을 이용하 여 일정 기간내에서 지역 유출 감염자 수 데이터를 설정하는 지역별 감염자 유출입 데이터 가공 단계를 포함하 고, 상기 지역별 감염자 유출입 데이터 가공 단계는 지역별 감염자 발생 수 데이터 가공 단계를 통해 나온 데이 터 중 지역별 감염자 발생 수(small y1)를 구하는 단계와. 지역간 인구 이동량 데이터 가공 단계를 통해 나온 데이터 중 지역간 인구 이동량(small y2)을 구하는 단계와, 상기 지역별 감염자 발생 수(small y1)와 지역간 인 구 이동량(small y2)을 곱하여 각 지역 기준으로 합산하여 지역별 감염자 유출입 수량(small y3)을 구하는 단계 로 이루어지는 것을 특징으로 한다."}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 호흡기 감염병 확산 예측 방법은 호흡기 감염병 확산에 관련된 정량적인 데이터와 함께 정성적인 데 이터를 용이하게 가공, 학습하여 제공함으로써 원천 데이터인 호흡기 감염병 확산에 관련된 정량적인 데이터와 정성적인 데이터를 인공지능에 적용하여 호흡기 감염병 확산을 정확하게 예측할 수 있는 이점이 있으며, 이로 인해 호흡기 감염병 확산의 예측의 신뢰성을 개선시킬 수 있는 이점이 있다."}
{"patent_id": "10-2022-0084923", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 호흡기 감염병 확산 예측 방법의 실시예를 첨부된 도면을 참조하여 설명하면 다음과 같다. 본 발명의 호흡기 감염병 확산 예측 방법은 도 1에서와 같이, 호흡기 감염병에 따른 감염역학인자에 해당되는 공개 데이터와 비공개 데이터로 이루어진 원천 데이터를 수집하는 단계(S1000)와; 상기 수집된 원천 데이터를 가공하여 인공지능학습용 데이터로 변환시키는 데이터 가공 단계(S2000)와; 상기 가공된 인공지능학습용 데이터 를 인공지능 학습시키는 머신러닝 학습 단계(S3000)와; 상기 학습된 인공지능의 산출물로 호흡기 감염병의 확산 예측 결과를 보고하는 결과 추정 단계(S4000)로 크게 이루어지게 된다. 상기 호흡기 감염병에 따른 감염역학인자에 해당되는 공개 데이터와 비공개 데이터로 이루어진 원천 데이터를 수집하는 단계(S1000)에서, 원천 데이터는 호흡기 감염병 확산 특성 테이터, 일정한 기간 내에서 발생되는 감염 자 발생수 테이터, 감염자 이동 데이터, 지역 면적(넓이) 데이터, 지역 인구 데이터, 지역간 인구 이동량(이동 인구량) 데이터, 마스크 판매량 데이터, 집회 발생 수 데이터, 집회 규모 데이터, 지역 청결 수준 데이터, 비말 전파 용이 이용 시설 수 데이터 및 지역정책 데이터가 포함된다. 여기서, 호흡기 감염병 확산 특성 테이터, 감 염자 발생수 테이터, 감염자 이동 데이터, 지역 면적(넓이) 데이터, 지역 인구 데이터, 지역간 인구 이동량(이 동 인구량) 데이터, 마스크 판매량 데이터, 집회 발생 수 데이터, 집회 규모 데이터 및 비말 전파 용이 이용 시 설 수 데이터 등은 정량적인 데이터이며, 지역 청결 수준 데이터나 지역정책 데이터 등은 정성적인 데이터로 분 류되며, 정성적인 데이터는 상,중,하로 분류하거나 1 내지 10 등급으로 분류하여 성취도(여기서, 성취도는 수준 데이터임)를 평가한다. 상기 원천 데이터를 수집하는 방법은 도 1에서와 같이, 호흡기 감염병에 따른 감염역학인자에 해당되는 공개 데 이터를 수집하는 단계(S1100)를 수행하고, 공개 데이터 수집과 아울러 호흡기 감염병에 따른 감염역학인자에 해당되는 비공개 데이터를 수집하는 단계(S1200)를 수행하게 된다. 상기 단계(S1100,S1200)를 통해 원천 데이터를 수집하는 방법에서, 공개 데이터는 공개된 호흡기 감염병에 따른 감염역학인자에 해당되는 데이터로 감염병에 관련된 공개된 정보와 감영병이 발생된 지역에 관련된 공개된 데이 터이고, 비공개 데이터는 비공개된 호흡기 감염병에 따른 감염역학인자에 해당되는 데이터로 감염병 환자에 관 련된 개인정보이다. 참고로, 여기서는 공개 및 비공개 데이터에 대하여 언급하였지만, 사용자의 요구에 따라 수 시 발생데이터를 추가로 적용할 수도 있다. 상기 원천 데이터는 본 발명의 호흡기 감염병 확산 예측 방법을 웹 (web)상에 프로그램으로 구현시, 프로그램이나 데이터 베이스(data base: 도시되지 않음)에 입력되는 정보로 보 다 구체적으로 CVS(Comma-Separated Values) 파일이나 엑셀파일 등이 사용된다. 감염역학인자에 해당되는 원천 데이터 중 호흡기 감염병 확산 특성 테이터는 호흡기 감염병의 위험성과 감염조 건이 있고, 호흡기 감염병의 위험성은 사스나 메르스 등과 같이 인체에 위협을 가하는 정도를 나타내며, 감염조 건은 어떤 경로를 통해 감염되는지 여부를 나타내는 감염경로로 비말 이동 거리, 환기, 밀집 및 밀접 등의 정도 를 나타낸다. 감염자 발생수 테이터나 감염자 이동 데이터는 각각 감염자가 발생된 감염자 발생지역의 감염자 수나 감염자의 이동 정보를 나타낸다. 지역 면적(넓이) 데이터, 지역 인구 데이터 및 지역간 인구이동량 데이터 는 각각 정확하게 수치화할 수 있는 정량적인 데이터로 감염자가 발생된 지역, 예를 들어 세계 수준에서는 각 국가가 지역이 되며, 각 국가 수준에서 보는 경우에 각국마다 가장 넓게 분리한 행정구역으로 한국을 예를 들면, 시/구/군 등의 면적(넓이), 인구수 및 인구 이동량(이동 인구량)을 나타낸다. 지역정책 데이터, 지역물리 적특성 데이터 및 지역행동특성 데이터는 각각 수치화보다 정도를 나타내는 수준 예를 들어, 상,중,하 등의 레 벨로 분류할 수 있는 정성적인 데이터로 감염자 발생수 테이터나 감염자 이동 데이터와 동일하게 분류된 지역내 에서 설정된다. 이와 같이, 호흡기 감염병 발생 시, 원천데이터를 정량적 데이터 이외에 정성적인 데이터를 항 목별로 레벨을 설정함으로써 데이터 가공을 용이하게 수행할 수 있게 된다. 상기 원천 데이터를 가공하여 인공지능학습용 데이터로 변환시키는 데이터 가공 단계(S2000)에서, 원천 데이터 는 호흡기 감염병에 따른 감염역학인자에 해당되는 원천 데이터를 수집하는 단계(S1000)에서 수집되게 된다. 본 발명의 호흡기 감염병 확산 예측 방법을 웹상에 프로그램으로 구현 시, 원천 데이터는 프로그램이나 데이터 베 이스에 입력되는 정보이며, 보다 구체적으로 CVS 파일이나 엑셀파일 등의 파일형식으로 수집된 원천 데이터가 웹상에 프로그램으로 구현된 본 발명의 호흡기 감염병 확산 예측 방법이나 데이터 베이스로 입력되면 웹상에 프 로그램으로 구현된 본 발명의 호흡기 감염병 확산 예측 방법에 의해 정량적인 량, 정성적인 량 즉, 레벨로 자동 으로 분류되고, 분류된 데이터를 일정한 기간으로 다시 자동으로 분류하여 원천 데이터를 인공지능학습용 데이 터로 사용하기 위해 가공된다. 원천 데이터의 가공 방법은 도 1에서와 같이, 감염역학인자에 해당되는 원천 데이터 중 일정한 기간 내에서 발 생되는 감염자 발생수 테이터를 이용하여 지역에서 발생된 감염자 수의 크기에 따라 지역 감염 단계를 설정하는 지역별 감염자 발생 수 데이터 가공 단계(S2100)를 수행한다. 지역별 감염자 발생 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간 인구 이동량(이동 인구량)에 따라 인구 이동량 데이터를 설정하는 지역간 인구 이동량 데이터 가공 단계(S2200)를 수 행한다. 여기서, 인구 이동량과 이동 인구량은 동일한 개념으로 이해하기 바란다. 그리고, 지역별 감염자 발생 수 가공과 지역간 인구 이동량 가공이 완료되면, 일정한 기간 내에서 발생되는 감염자 발생수(small y1)와 지역 간 이동 인구량(small y2)을 곱하여 각 지역 기준으로 합산하여 지역별 감염자 유출입 수(small y3)를 구하는 지역별 감염자 유출입 데이터 가공 단계(S2300)를 포함한다. 지역별 감염자 발생 수 데이터 가공 단계(S2100)는 도 1 및 도 2에서와 같이, 감염역학인자에 해당되는 원천 데 이터를 이용해 감염자 발생지역의 지역정책의 단계를 설정하는 지역정책 데이터 가공 단계(S2110)를 수행한다. 지역정책 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 기반으로 개별 시민이 지역 정책을 잘 준수하였는지를 판단하는 지역별 개별 시민 행동 특성 데이터 가공 단계(S2120)를 수행한다. 지역별 개별 시 민 행동 특성 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 기반으로 지역별 집회/집단(집 회나 집단)이 지역정책을 잘 준수하였는지를 판단하는 지역별 집회/집단(집회나 집단) 행동 특성 데이터 가공 단계(S2130)를 수행한다. 지역별 집회/집단(집회나 집단) 행동 특성 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 기반으로 각 지역별 물리적 특성을 데이터화시키는 지역별 물리적 특성 데이터 가공 단 계(S2140)를 수행한다. 단계(S2110,S2120,S2130,S2140)에서 각각 사회적 거리 두기 단계나 데이터는 상,중,하로 분류한 후 수준 데이터 를 상,중,하 중 하나를 선택하여 평가한다. 즉, 수준 데이터 평가는 레벨을 설정한 후 일정한 기간 내에서 발생되는 감염자 발생수 테이터를 이용하여 평가하며, 감염자 발생수가 수가 작으면 성취도(수준 데이터)는 '상'으 로 본 발명의 호흡기 감염병 확산 예측 방법에서 자동으로 평가한다. 지역정책 데이터 가공 단계(S2110)의 보다 구체적인 방법은 도 3에서와 같이, 감염역학인자에 해당되는 원천 데 이터를 이용해 감염자 발생지역의 사회적거리두기 단계를 설정하는 사회적 거리두기 시행 단계 데이터 가공 단 계(S2111)를 수행한다. 사회적거리두기 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용 해 이동제한조치 레벨을 설정하는 이동제한조치 시행 수준 데이터 가공 단계(S2112)를 수행한다. 이동제한조치 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 마스크 착용 요구 수준 단계를 설정하 는 마스크 착용 요구 수준 데이터 가공 단계(S2113)를 수행한다. 마스크 착용 요구 수준 데이터 가공이 완료되 면, 감염역학인자에 해당되는 원천 데이터를 이용해 밀폐공간 환기 요구 수준 단계를 설정하는 밀폐공간 환기 요구 수준 데이터 가공 단계(S2114)를 수행한다. 지역별 개별 시민 행동 특성 데이터 가공 단계(S2120)의 구체적인 방법은 도 4에 도시된 바와 같이, 사회적 거 리두기 시행 단계 데이터 가공 단계(S2111)에서 설정된 사회적 거리두기 시행 단계를 일정한 기간 동안 수행한 후 발생되는 감염자 발생수 테이터를 이용하여 설정된 단계와 일정한 기간 동안 준수하였는지를 판단하는 사회 적거리두기 준수 수준 데이터 가공 단계(S2121)를 수행한다. 사회적거리두기 준수 수준 데이터 가공이 완료되면, 이동제한조치 시행 수준 데이터 가공 단계(S2112)에서 설정된 이동제한조치 레벨을 일정한 기간 동안 수행한 후 발생되는 감염자 발생수 테이터를 이용하여 설정된 기간 동안 적절히 이행되었는지를 판단하는 이동 제한조치 준수 수준 데이터 가공 단계(S2122)를 수행한다. 이동제한조치 준수 수준 데이터 가공이 완료되면, 마 스크 착용 요구 수준 데이터 가공 단계(S2113)에서 설정된 마스크 착용 요구 수준을 일정한 기간 동안 수행한 후 발생되는 감염자 발생수 테이터를 이용하여 설정한 일정한 기간 동안 마스크 착용 요구 수준을 준수하였는지 를 판단하는 마스크 착용 요구 준수 수준 데이터 가공 단계(S2123)를 수행한다. 마스크 착용 요구 준수 수준 데 이터 가공이 완료되면, 밀폐공간 환기 요구 수준 데이터 가공 단계(S2114)에서 설정된 밀폐공간 환기 요구 수준 을 일정한 기간 동안 수행한 후 발생되는 감염자 발생수 테이터를 이용하여 설정한 일정한 기간 동안 설정된 밀 폐공간 환기 요구 준수 수준 데이터 가공 단계(S2124)를 수행한다. 지역별 집회/집단(집회나 집단) 행동 특성 데이터 가공 단계(S2130)의 구체적인 방법은 도 5에 도시된 바와 같 이, 집회 발생 수 데이터를 이용해 집회 발생 건 수를 가공하는 집회 발생 수 데이터 가공 단계(S2131)를 수행 한다. 집회 발생 수 데이터 가공이 완료되면, 각 집회의 참여 인원으로 설정되는 집회 규모 데이터를 이용해 각 각의 집회의 규모를 가공하는 집회 규모 데이터 가공 단계(S2132)를 수행한다. 집회 규모 데이터 가공이 완료되 면, 사회적거리두기 준수 수준, 집회 발생 수의 수준 및 집회 규모를 이용해 집회시 사회적 거리두기 준수 수준 을 가공하는 집회시 사회적 거리두기 준수 수준 데이터 가공 단계(S2133)를 수행한다. 집회시 사회적 거리두기 준수 수준 데이터 가공이 완료되면, 마스크 판매량과 인구수를 이용해 집회 시 마스크 착용 수준을 가공하는 집 회시 마스크 착용 수준 데이터 가공 단계(S2134)를 수행한다. 이러한 단계(S2131 내지 S2134)에서, 각각 수준 데이터는 상,중,하 중 하나를 선택하여 평가하며, 준수 수준 평가는 일정한 기간 내에서 발생되는 감염자 발생 수 테이터를 이용하여 평가하며, 감염자 발생수가 수가 작으면 성취도(수준 데이터)는 '상'으로 본 발명의 호흡 기 감염병 확산 예측 방법에서 자동으로 평가하며, 집회시 마스크 착용 수준은 마스크 판매량을 인구수로 나누 어 판별하며, 마스크 판매량이나 인구수는 지역별이나 각 국가별로 수행할 수 있다. 지역별 물리적 특성 데이터 가공 단계(S2140)의 구체적인 방법은 도 6에 도시된 바와 같이, 감염역학인자에 해 당되는 원천 데이터 중 지역 청결 수준 데이터를 이용해 지역 청결 수준의 단계를 설정한 후 일정한 기간 내에 서 발생되는 감염자 발생수 테이터를 이용하여 설정된 지역 청결 수준에 따라 가공하는 지역별 청결 수준 데이 터 가공 단계(S2141)를 수행한다. 그리고, 지역별 청결 수준 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역인구수 절대값을 가공하는 지역별 인구수 데이터 가공 단계를 수행한다. 지역별 인구 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 인구밀도를 가공하는 지역별 인구밀 도 데이터 가공 단계(S2143)를 수행한다. 지역별 인구밀도 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 비말전파 용이한 시설 데이터를 가공하는 지역별 비말전파 용이 시설 수 데이터 가공 단계 (S2144)를 수행한다. 그리고, 지역별 비말전파 용이 시설 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 비말전파 용이한 시설의 밀도 데이터를 가공하는 지역별 비말전파 용이 시설 밀도 데이터 가공 단계(S2145)를 수행한다. 지역별 비말전파 용이 시설 밀도 데이터 가공이 완료되면, 감염역학인자에 해당 되는 원천 데이터 중 지역 다중이용시설 수 데이터를 가공하는 지역별 다중이용 시설 수 데이터 가공 단계 (S2146)를 수행한다. 지역별 다중이용 시설 수 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터 중 지역 다중이용시설밀도를 가공하는 지역별 다중이용시설 밀도 데이터 가공 단계(S2147)를 수행한다. 여기서,단계(S2141 내지 S2147)에서 각각 단계는 상,중,하로 분류한 후 수준 데이터로 상,중,하 중 하나를 선택하여 평 가한다. 즉, 수준 평가는 단계를 설정한 후 일정한 기간 내에서 발생되는 감염자 발생수 테이터를 이용하여 평 가하며, 감염자 발생수가 수가 작으면 성취도(수준 데이터)는 '상'으로 본 발명의 호흡기 감염병 확산 예측 방 법에서 자동으로 평가하며, 비말전파 용이 시설은 교회, 노래방이나 클럽 등을 포함하며, 다중 이용 시설은 음 식점이나 마트 등을 포함한다. 지역간 인구 이동량 데이터 가공 단계(S2200)의 방법은 도 7에 도시된 바와 같이, 감염역학인자에 해당되는 원 천 데이터를 이용해 지역간 항공편 인구이동량(이동인구량)을 일정한 기간 간격으로 가공하는 지역간 항공편 이 동인구 데이터 가공 단계(S2210)를 수행한다. 지역간 항공편 이동인구 데이터 가공이 완료되면, 감염역학인자에 해당되는 원천 데이터를 이용해 지역간 열차편 인구 이동량을 일정한 기간 간격으로 가공하는 지역간 열차편 이 동인구 데이터 가공 단계(S2220)를 수행한다. 그리고, 지역간 열차편 이동인구 데이터 가공이 완료되면, 감염역 학인자에 해당되는 원천 데이터를 이용해 지역간 차량편 이동인구량을 일정한 기간 간격으로 가공하는 지역간 차량편 이동인구 데이터 가공 단계(S2230)를 수행한다. 지역간 차량편 이동인구 데이터 가공이 완료되면, 감염 역학인자에 해당되는 원천 데이터를 이용해 지역간 해운편 이동인구량을 일정한 기간 간격으로 가공하는 지역간 해운편 이동인구 데이터 가공 단계(S2240)를 수행한다. 전술한 데이터 가공 단계(S2000) 중 지역간 이동인구량 데이터 가공 단계(S2200)의 실시예를 표 1에 기재하였다. 표 1 순서 주요내용 활용도 구분 데이터 가공1차량교통량 육로확산분석에활용 이동인구량 데이터 가공220xx년항구별이동정보 해상유입분석에활용 이동인구량 데이터 가공320xx년항구별이동정보 해상유입분석에활용 이동인구량 데이터 가공420xx년항구별이동정보 해상유입분석에활용 이동인구량 데이터 가공5국제공항국가별 출도착인원 해외유입분석에활용 이동인구량 데이터 가공6시간대별지하철인원이동량 육로확산분석에활용 이동인구량 데이터 가공7국내코로나감염현황 환자별확산분석에활용 환자수현황 데이터 가공8호흡기 감염병의감염시도별현황 지역별확산분석에활용 환자수현황 데이터 가공9호흡기 감염병의세계현황 해외확산분석에활용 환자수현황 데이터 가공10인천공항국가별일일도착수 해외유입분석에활용 이동인구량 데이터 가공11감염원점지역의이동인원수 해외유입분석에활용 이동인구량 데이터 가공12호흡기 감염병의국가별정책대응지수확산분석에활용 정책레벨 (상중하) 표 1에서와 같이, 데이터 가공1 내지 12는 각각 원천데이터를 CVS(Comma-Separated Values) 파일이나 엑셀파일 데이터로 전처리한 것으로, 데이터 가공1은 일정한 기간 동안의 차량 교통량 데이터로 호흡기 감염병의 육로확 산 분석에 사용되며, 정량적인 데이터로 양은 이동 인원(인구)으로 기재된다. 이와 같이 데이터 가공 2 내지 12는 데이터 가공1과 같이 전처리되어 인공지능학습용 데이터로 변환된다. 데이 터 가공1 내지 12 중 데이터 가공12는 호흡기 감염병의 국가별 정책 대응지수를 나타내는 것으로, 호흡기 감염 병의 확산 분석에 사용되며, 정성적인 데이터로 정책레벨의 수행정도에 따라 상,중,하로 구별하여 점수로 기재 한다. 지역별 감염자 유출입 데이터 가공 단계(S2300)의 구체적인 방법은 도 8에 도시된 바와 같이, 지역별 감염자 발 생 수 데이터 가공 단계(S2100)에서 나온 데이터 중 지역별 감염자 발생 수(small y1)와, 지역간 이동 인구량데이터 가공 단계(S2200)에서 나온 데이터 중 지역간 이동 인구량(small y2)을 곱하여 각 지역 기준으로 합산하 여 지역별 유출입 수량(small y3)을 도출하는 단계를 수행하게 된다. 머신러닝 학습 단계(S3000)는 도 1에서와 같이, 데이터 가공 단계(S2000)에서 각각 가공된 데이터를 이용하여 각 항목별로 감염자 발생 예측 모델 구조를 설정하여 지역별 감염자 수량 예측(Big Y)을 하는 감염자 발생 예측 모델 구조 수립 단계(S3100)와; 데이터 가공 단계(S2000)에서 각각 가공된 데이터를 항목별로 적합한 기계학습 알고리즘을 선택하는 예측 모델별 머신러닝 알고리즘 선택하는 단계(S3200)와; 상기 예측 모델별 머신러닝 알고 리즘이 선택되면, 인공지능학습용 데이터를 처리하여 호흡기 감염병 확산을 예측하기 위해 선택된 머신러닝을 수행하는 단계(S3300)으로 이루어지게 된다. 상기 머신러닝 수행하는 단계(S3300)에서, 머신러닝 방식은 딥런닝 (Deep Learning), 베이지안 릿지(Bayesian Ridge), 랜덤 포레스트(Random Forest), 결정트리(Decision Tree), 그레디언트 부스트(Gradient Boosting), 선형회귀(Linear Regression), 가우시안 프로세스(Gaussian Process), SVR(Support Vector Regression), MLP(Multi-layer Perceptron) 및 LSTM (Long Short-Term Memory) 중 하나를 선택하여 수행하게 된다. 감염자 발생 예측 모델 구조 수립 단계(S3100)는 도 8에 도시된 바와 같이, 지역별 감염자 발생 수(small y1)를 구하는 단계(S3110)로부터 구한 지역별 감염자 발생수(small y1)와, 지역간 인구 이동량(small y2)을 구하는 단 계(S3120)로부터 구한 지역간 인구 이동량(small y2)과, 지역별 감염자 유출입 수량(small y3)을 구하는 단계 (S3150)에서 구한 지역별 감염자 유출입 수량(small y3)을 이용하여 지역별 감염자 수량 예측(Big Y)을 하는 단 계(S3170)를 수행한다. 상기 지역별 감염자 수량 예측(Big Y)을 하는 단계(S3170)는 일정한 기간내에서 지역별 감염자 발생 수(small y1)와 해당 지역별 감염자 유출입 수량(small y3)을 합산하여 도출하게 된다. 상기 지역별 감염자 발생 수(small y1)를 구하는 단계(S3110)로부터 구한 지역별 감염자 발생수(small y1)를 지 역별 감염자 발생량 데이터 베이스에 저장하는 단계(S3130)를 수행하고, 지역간 인구 이동량(small y2)을 구하 는 단계(S3120)로부터 구한 지역간 인구 이동량(small y2)를 지역간 인구 이동량 데이터 베이스에 저장하는 단 계(S3140)를 수행하며, 지역별 감염자 유출입 수량(small y3)을 구하는 단계(S3150)에서 구한 지역별 감염자 유 출입 수량(small y3)을 데이터 베이스에 저장하는 단계(S3160)를 수행한다. 여기서, 상기 지역별 감염자 발생수 (small y1)와, 지역간 인구 이동량(small y2) 및 지역별 감염자 유출입 수량(small y3)을 각각의 데이터 베이스 에 저장하였지만, 사용자의 요구에 따라 통합 데이터 베이스에 저장할 수도 있다. 예측 모델별 머신러닝 알고리즘 선택 단계(S3200)는, 도 9에 도시된 바와 같이, 감염자 발생 예측 모델 구조 수 립 단계(S3100)에서 나온 각 구조에 적합한 알고리즘을 찾는 방법으로, 지역별 감염자 발생 수(small y1)의 예 정된 기계학습 알고리즘을 선택하는 small y1 추정 기계학습 알고리즘 선택 단계(S3210)를 수행한다. 그리고, small y1 추정 기계학습 알고리즘 선택이 완료되면, 지역간 이동 인구량(small y2)의 적절한 기계학습 알고리즘 을 선택하는 small y2 추정 기계학습 알고리즘 선택 단계(S3220)를 수행한다. small y2 추정 기계학습 알고리즘 이 선택되면, 지역별 감염자 유출입 수량(small y3)의 적절한 기계학습 알고리즘을 선택하는 small y3 추정 기 계학습 알고리즘 선택 단계(S3230)를 수행한다. small y3 추정 기계학습 알고리즘이 지역별 감염자 수량 예측 (Big Y)의 적절한 기계학습 알고리즘을 선택하는 Big Y 추정 기계학습 알고리즘 선택 단계(S3240)를 수행한다. 선택된 머신러닝을 수행하는 단계(S3300)는 도 1에 도시된 바와 같이, 예측 모델별 머신러닝 알고리즘이 선택되 면, 인공지능학습용 데이터를 처리하여 호흡기 감염병 확산을 예측하기 위해 머신러닝을 수행하게 된다. 각각의 예측 모델별 머신러닝 알고리즘 선택이 완료되면, 선택된 알고리즘에 해당되는 머신러닝을 수행하게 된 다. 머신러닝 방식은 딥런닝(Deep Learning), 베이지안 릿지(Bayesian Ridge), 랜덤 포레스트(Random Forest), 결정트리(Decision Tree), 그레디언트 부스트(Gradient Boosting), 선형회귀(Linear Regression), 가우시안 프 로세스(Gaussian Process), SVR(Support Vector Regression), MLP(Multi-layer Perceptron) 및 LSTM(Long Short-Term Memory) 중 각각 선택된 머신러닝을 수행하게 된다. 호흡기 감염병의 확산의 결과 추정 단계(S4000)는 도 1에 도시된 바와 같이, 머신러닝을 통해 나온 결과를 추정 하는 추정 단계(S4100)를 수행한다. 그리고, 상기 머신러닝을 통해 나온 추정된 호흡기 감염병 확산 예측 결과 를 보고하는 결과 보고 단계(S4200)를 수행한다. 상기 결과 보고 단계(S4200)에서, 예측 결과 보고는 기간별, 날짜별로 감염병 확진자의 증감율을 나타내는 그래프나 테이블로 표시하여 보고하게 된다. 이상에서와 같이 본 발명의 호흡기 감염병 확산 예측 방법은 호흡기 감염병에 관련된 정량적인 데이터뿐 아니라 정성적인 데이터를 용이하게 가공, 학습하여 제공함으로써 호흡기 감염병 확산을 정확하고 신뢰성 있게 예측할 수 있으며, 원천데이터 중 정성적인 데이터를 종래의 상,중,하 평가에 비하여 1 내지 10 등급으로 세분화하여평가하게 되므로 보다 정밀하게 호흡기 감염병 확산을 예측할 수 있게 된다. 산업상 이용가능성 본 발명의 호흡기 감염병 확산 예측 방법은 호흡기 감염병을 예방 및 예측하기 위한 산업 분야에 널리 적용된다."}
{"patent_id": "10-2022-0084923", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 호흡기 감염병 확산 예측 방법의 흐름도, 도 2는 도 1에 도시된 감염자 발생 수 데이터 가공방법을 나타낸 흐름도, 도 3은 도 2에 도시된 지역별 정책 데이터 가공 단계를 나타낸 흐름도, 도 4는 도 2에 도시된 지역별 개별 시민 행동 특성 테이터 가공 단계를 나타낸 흐름도, 도 5는 도 2에 도시된 지역별 집회나 집단 행동 특성 데이터 가공 단계를 나타낸 흐름도, 도 6은 도 2에 도시된 지역별 물리적 특성 데이터 가공 단계를 나타낸 흐름도, 도 7은 도 1에 도시된 지역간 인구 이동량 데이터 가공 단계를 나타낸 흐름도, 도 8은 도 1에 도시된 감염자 발생 예측 모델 구조 수립 단계를 나타낸 흐름도, 도 9는 도 1에 도시된 예측 모델별 머신러닝 알고리즘 선택 단계를 나타낸 흐롬도이다."}
