{"patent_id": "10-2020-0012445", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0098651", "출원번호": "10-2020-0012445", "발명의 명칭": "음란물 유포 감시 장치 및 감시 방법", "출원인": "한국전자통신연구원", "발명자": "이원재"}}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "소셜 네트워크 서버로부터 기설정된 특정 키워드가 적어도 하나 이상 포함된 게시물을 검색하여 수신하는 단계;상기 수신된 게시물에 대하여 음란 게시물 여부를 판단하는 단계;상기 수신된 게시물이 음란 게시물로 판단되는 경우, 상기 수신된 게시물의 게시자를 음란물 게시자 후보 목록내에 추가하는 단계;상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지를 판단하는 단계; 및상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우, 상기 게시자를 음란물 게시자 목록 내에 추가하는 단계를 포함하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 음란 게시물 여부를 판단하는 단계는 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시물 여부를 판단하는 것을 특징으로 하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 음란 게시물 여부를 판단하는 단계는 인공지능 기반 음란물 감지 기술을 이용하여 음란 게시물 여부를 판단하는 것을 특징으로 하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링하는 단계를 더 포함하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링하는 단계는 상기 음란물 게시자 목록 내에 적어도 하나의 음란물 게시자가 포함된 경우에 수행되는 것을 특징으로 하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "소셜 네트워크 서버 내에서 음란물 게시자 목록 내에 포함된 게시자에 대한 구독자 정보를 모니터링하는 단계;상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는지여부를 판단하는 단계; 및상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는 경우, 상기 구독자를 음란물 구독자 목록에 추가하는 단계를 포함하는 것을 특징으로 하는 음란물 유포 감시 방법.공개특허 10-2021-0098651-3-청구항 7 제6항에 있어서,상기 음란물 구독자 목록 내에 포함된 구독자가 구독 중인 게시자를 모니터링하는 단계;상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는지여부를 판단하는 단계; 및상기 게시자를 음란물 게시자 후보 목록에 추가하는 단계를 더 포함하는 것을 특징으로 하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서, 상기 게시자를 음란물 게시자 후보 목록에 추가하는 단계는, 상기 게시자를 구독 중인 구독자 중 상기 음란물구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는 경우에 수행되는 것을 특징으로 하는 음란물 유포감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단하는 단계; 및상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가하는 단계를 더 포함하는 것을 특징으로 하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가하는 단계는, 상기 게시자의 음란물 게시가 상습적인 것으로 판단된 경우에 수행되는 것을 특징으로 하는 음란물 유포 감시 방법."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "소셜 네트워크 서버로부터 기설정된 특정 키워드가 적어도 하나 이상 포함된 게시물을 검색하여 수신하는 입출력부;상기 수신된 게시물에 대하여 음란 게시물 여부를 판단하고, 상기 수신된 게시물이 음란 게시물로 판단되는 경우, 상기 수신된 게시물의 게시자를 음란물 게시자 후보 목록내에 추가하고, 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단하고, 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우, 상기 게시자를 음란물 게시자 목록 내에 추가하는 프로세서; 및상기 기설정된 특정 키워드, 상기 음란물 게시자 후보 목록, 상기 음란물 게시자 목록에 대한 정보를 포함하는메모리를 포함하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "공개특허 10-2021-0098651-4-제11항에 있어서,상기 프로세서는 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시물 여부를 판단하는 것을특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서,상기 프로세서는 인공지능 기반 음란물 감지 기술을 이용하여 음란 게시물 여부를 판단하는 것을 특징으로 하는음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제11항에 있어서,상기 프로세서는, 상기 음란물 게시자 목록 내에 적어도 하나의 음란물 게시자가 포함된 경우, 상기 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링하는 것을 특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제11항에 있어서, 상기 입출력부는 상기 소셜 네트워크 서버 내에서 상기 음란물 게시자 목록 내에 포함된 게시자를 구독 중인 구독자 정보를 수신하고,상기 프로세서는 상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는지 여부를 판단하고, 상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된게시자의 수가 임계값을 초과하는 경우, 상기 구독자를 음란물 구독자 목록에 추가하는 것을 특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제11항에 있어서,상기 입출력부는 소셜 네트워크 서버 내에서 음란물 구독자 목록 내에 포함된 구독자가 구독 중인 게시자에 대한 정보를 수신하고,상기 프로세서는 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는지 여부를 판단하고, 상기 게시자를 상기 음란물 게시자 후보 목록에 추가하는 것을 특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 프로세서는 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는 경우에 상기 게시자를 상기 음란물 게시자 후보 목록에 추가하는 것을 특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 프로세서는 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하였는지 여부를 기준으로상기 게시자의 음란물 게시가 상습적인지 여부를 판단하고,상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가하는 것을 특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,공개특허 10-2021-0098651-5-상기 프로세서는 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우에 상기 게시자를 상기 음란물 게시자 목록 내에 추가하는 것을 특징으로 하는 음란물 유포 감시 장치."}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "음란물 유포 감시 장치 및 감시 방법이 개시된다. 본 발명의 일실시예에 따른 음란물 유포 감시 방법은 소셜 네 트워크 서버로부터 기설정된 특정 키워드가 적어도 하나 이상 포함된 게시물을 검색하여 수신하는 단계; 상기 수 신된 게시물에 대하여 음란 게시물 여부를 판단하는 단계; 상기 수신된 게시물이 음란 게시물로 판단되는 경우, 상기 수신된 게시물의 게시자를 음란물 게시자 후보 목록 내에 추가하는 단계; 상기 음란물 게시자 후보 목록 내 에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최 근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지를 판단하는 단계; 및 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우, 상기 게시자를 음란물 게시자 목록 내에 추가 하는 단계를 포함한다."}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 소셜 네트워크 상에 음란물이 유포되는 것을 감시하는 기술에 관한 것으로, 특히 음란물 게시자 및 음란물 구독자 목록 정보를 기반으로 소셜 네트워크 내의 음란물의 유포를 감시하여 차단하기 위한 기술에 관한 것이다."}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "소셜 네트워크(Social Network)란 자신만의 온라인 사이트를 구축하여 콘텐츠 서비스를 만들고, 친구들과의 연 결을 통해 서비스와 커뮤니케이션을 공유하는 것으로, 소셜 네트워크 서비스(Social Network Service)라고도 불 린다. 최근에는 컴퓨터 통신 및 이동 통신의 발달로 인하여 소셜 네트워크의 사용이 널리 확대되었다. 이로 인 해, 누구나 정보를 쉽게 얻을 수 있게 되었지만, 많은 수의 음란물이 소셜 네트워크를 통해 무분별하게 배포됨 으로써 사회적 문제가 되고 있다. 이러한 음란물 중에는 디지털 성범죄 영상물이 포함되어 있을 수 있다. 인터 넷과 소셜 네트워크를 통해 단기간에 급속히 전파되는 디지털 성범죄 영상물은 피해자의 인권을 침해하고 국민 정서를 훼손하여 사회적인 문제로 대두되고 있다. 이와 관련하여, 일 예로 한국공개특허공보 제10-2016-0071712호 (공개일: 2016년 06월 22일) \"소셜 네트워크 서 비스를 통해 유포되는 유해 정보 탐지 방법\"에는 소셜 네트워크 서비스를 통해 확산되는 유해 정보의 확산 과정 을 분석하여 유해 정보를 탐지하는 방법이 기재되어 있다. 그러나 이러한 방법은 정보의 확산 특징만을 분석하 여 유해 정보를 탐지하기 때문에 탐지의 정확성이 떨어지는 단점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 공개 특허 제10-2016-0071712호, 2016년 6월 22일 공개(명칭: 반복 추정에 기반한 자기간 섭신호 추정 방법 및 이를 위한 장치)"}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 소셜 네트워크 내의 음란물 유포를 감시하고, 음란물을 제거하는 것이다. 또한, 본 발명의 목적은 소셜 네트워크 내의 음란물 게시자 그룹 및 음란물 구독자 그룹을 파악하여 이를 기반 으로 음란물 유포를 감시하고, 음란물을 제거하는 것이다."}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 목적을 달성하기 위한 본 발명의 일실시예에 따른 음란물 유포 감시 방법은 소셜 네트워크 서버로부터 기설정된 특정 키워드가 적어도 하나 이상 포함된 게시물을 검색하여 수신하는 단계; 상기 수신된 게시물에 대 하여 음란 게시물 여부를 판단하는 단계; 상기 수신된 게시물이 음란 게시물로 판단되는 경우, 상기 수신된 게 시물의 게시자를 음란물 게시자 후보 목록 내에 추가하는 단계; 상기 음란물 게시자 후보 목록 내에 포함된 게 시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지를 판단하는 단계; 및 상기 게시 자의 음란물 게시가 상습적인 것으로 판단되는 경우, 상기 게시자를 음란물 게시자 목록 내에 추가하는 단계를 포함한다. 이 때, 상기 음란 게시물 여부를 판단하는 단계는 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시물 여부를 판단할 수 있다.이 때, 상기 음란 게시물 여부를 판단하는 단계는 인공지능 기반 음란물 감지 기술을 이용하여 음란 게시물 여 부를 판단할 수 있다. 이 때, 상기 음란물 유포 감시 방법은 상기 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링하 는 단계를 더 포함할 수 있다. 이 때, 상기 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링하는 단계는 상기 음란물 게시자 목록 내에 적어도 하나의 음란물 게시자가 포함된 경우에 수행될 수 있다. 또한, 본 발명의 다른 일실시예에 따른 음란물 유포 감시 방법은, 소셜 네트워크 서버 내에서 음란물 게시자 목 록 내에 포함된 게시자에 대한 구독자 정보를 모니터링하는 단계; 상기 구독자가 구독 중인 게시자 중 상기 음 란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는지 여부를 판단하는 단계; 및 상기 구독자가 구 독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는 경우, 상기 구독자 를 음란물 구독자 목록에 추가하는 단계를 포함한다. 이 때, 상기 음란물 유포 감시 방법은 상기 음란물 구독자 목록 내에 포함된 구독자가 구독 중인 게시자를 모니 터링하는 단계; 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계 값을 초과하는지 여부를 판단하는 단계; 및 상기 게시자를 음란물 게시자 후보 목록에 추가하는 단계를 더 포함 할 수 있다. 이 때, 상기 게시자를 음란물 게시자 후보 목록에 추가하는 단계는, 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는 경우에 수행될 수 있다. 이 때, 상기 음란물 유포 감시 방법은 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지 를 기준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단하는 단계; 및 상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가하는 단계를 더 포함할 수 있다. 이 때, 상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가하는 단계는, 상기 게시자의 음란물 게시가 상습적인 것으로 판단된 경우에 수행될 수 있다. 또한, 본 발명의 일 실시예에 따른 음란물 유포 감시 장치는, 소셜 네트워크 서버로부터 기설정된 특정 키워드 가 적어도 하나 이상 포함된 게시물을 검색하여 수신하는 입출력부; 상기 수신된 게시물에 대하여 음란 게시물 여부를 판단하고, 상기 수신된 게시물이 음란 게시물로 판단되는 경우, 상기 수신된 게시물의 게시자를 음란물 게시자 후보 목록 내에 추가하고, 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서 버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단하고, 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우, 상기 게시자를 음란물 게시자 목록 내에 추가하는 프로세서; 및 상기 기설정된 특정 키워 드, 상기 음란물 게시자 후보 목록, 상기 음란물 게시자 목록에 대한 정보를 포함하는 메모리를 포함한다. 이 때, 상기 프로세서는 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시물 여부를 판단할 수 있다. 이 때, 상기 프로세서는 인공지능 기반 음란물 감지 기술을 이용하여 음란 게시물 여부를 판단할 수 있다. 이 때, 상기 프로세서는, 상기 음란물 게시자 목록 내에 적어도 하나의 음란물 게시자가 포함된 경우, 상기 음 란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링할 수 있다. 이 때, 상기 입출력부는 상기 소셜 네트워크 서버 내에서 상기 음란물 게시자 목록 내에 포함된 게시자를 구독 중인 구독자 정보를 수신하고, 상기 프로세서는 상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는지 여부를 판단하고, 상기 구독자가 구독 중인 게시자 중 상기 음 란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는 경우, 상기 구독자를 음란물 구독자 목록에 추 가할 수 있다. 이 때, 상기 입출력부는 소셜 네트워크 서버 내에서 음란물 구독자 목록 내에 포함된 구독자가 구독 중인 게시 자에 대한 정보를 수신하고, 상기 프로세서는 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내 에 포함된 구독자의 수가 임계값을 초과하는지 여부를 판단하고, 상기 게시자를 상기 음란물 게시자 후보 목록 에 추가할 수 있다.이 때, 상기 프로세서는 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수 가 임계값을 초과하는 경우에 상기 게시자를 상기 음란물 게시자 후보 목록에 추가할 수 있다. 이 때, 상기 프로세서는 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업 로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하였는지 여부를 기 준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단하고, 상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가할 수 있다. 이 때, 상기 프로세서는 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우에 상기 게시자를 상기 음 란물 게시자 목록 내에 추가할 수 있다."}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따르면, 상습적인 음란물 게시자들과 음란물 구독자들을 파악할 수 있고, 이에 따라 음란물 및 디지 털 성범죄 영상을 효과적으로 감시 및 차단할 수 있다. 또한, 음란물 게시자 목록을 관리함으로써 상습적인 음란물 게시자들이 게시하는 음란 게시물들을 빠르게 감시 할 수 있으며, 기존 키워드 검색 방식에서 놓칠 수 있는 음란물들도 감지가 가능하다. 또한, 음란물 구독자 목록을 관리함으로써 새로운 음란물 게시자들을 빠르게 파악할 수 있으며, 이를 통해 기존 키워드 검색 방식에서 놓칠 수 있는 음란물들도 감지가 가능하다."}
{"patent_id": "10-2020-0012445", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명을 첨부된 도면을 참조하여 상세히 설명하면 다음과 같다. 여기서, 반복되는 설명, 본 발명의 요지를 불 필요하게 흐릴 수 있는 공지 기능, 및 구성에 대한 상세한 설명은 생략한다. 본 발명의 실시형태는 당 업계에서 평균적인 지식을 가진 자에게 본 발명을 보다 완전하게 설명하기 위해서 제공되는 것이다. 따라서, 도면에서의 요소들의 형상 및 크기 등은 보다 명확한 설명을 위해 과장될 수 있다. 이하, 본 발명에 따른 바람직한 실시예를 첨부된 도면을 참조하여 상세하게 설명한다. 도 1은 본 발명의 일실시예에 따른 소셜 네트워크 음란물 유포 감시 시스템의 일 예를 나타낸 블록도이다. 도 1을 참조하면, 본 발명의 일실시예에 따른 소셜 네트워크 음란물 유포 감시 시스템은 소셜 네트워크 서버 및 음란물 유포 감시 장치를 포함한다. 소셜 네트워크 서버에는 복수의 사용자가 이용하는 컴 퓨터 또는 이동통신 단말 등에 의해 텍스트, 영상, 동영상 등이 실시간으로 업로드되고, 상기 실시간으로 업로 드된 텍스트, 영상, 동영상 등은 이들을 업로드한 사용자를 구독하고 있는 복수의 사용자에 의해 실시간으로 조 회될 수 있다. 본 명세서에서는 상기 텍스트, 영상, 동영상 중 하나 또는 이들이 조합하여 업로드된 하나의 게 시글을 '게시물'로 정의하고, 상기 게시물을 업로드하는 사용자를 '게시자'로 정의한다. 또한, 상기 게시자가 업로드하는 게시물을 구독하는 사용자를 '구독자'로 정의한다. 음란물 유포 감시 장치는 상기 소셜 네트워크 서버와 데이터를 주고 받으며 상기 소셜 네트워크 서버 에 음란물이 유포되는지 감시하고, 유포되는 음란물을 차단한다.도 2는 본 발명의 일실시예에 따른 음란물 유포 감시 장치의 일 예를 나타낸 블록도이다. 도 2를 참조하면, 본 실시예에 따른 음란물 유포 감시 장치는 게시물 감시부, 게시자 관리부, 구독자 관리부, 음란성 판별부를 포함한다. 게시물 감시부는 키워드 검색 또는 음란물 게시자 감시를 통해 소셜 네트워크 서버에 업로드되는 음 란 게시물을 감시한다. 게시자 관리부는 음란물 게시자 후보 목록 및 음란물 게시자 목록을 생성하여 관리 한다. 이를 위해, 게시자 관리부는 메모리 또는 스토리지 장치 등의 저장 장치를 포함할 수 있다. 구독자 관리부는 음란물 구독자 목록을 생성하여 관리한다. 이를 위해, 구독자 관리부 또한 메모리 또는 스 토리지 장치 등의 저장 장치를 포함할 수 있다. 음란성 판별부는 게시물에 포함된 영상 또는 동영상의 음 란성 여부를 인공지능 기반 음란물 감지 기술을 이용하여 판별한다. 도 3을 본 발명의 일실시예에 따른 음란물 유포 감시 장치의 음란물 유포 감시 방법을 나타낸 동작흐름도 이다. 도 3을 참조하면, 본 실시예에 따른 음란물 유포 감시 방법은 소셜 네트워크 서버로부터 기설정된 특정 키워드 가 적어도 하나 이상 포함된 게시물을 검색하여 수신한다(S310). 상기 기설정된 특정 키워드의 일례로는 '누 드', '성관계' 등의 단어가 포함될 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은, 단계 S310에서 수신된 게시물에 대하여 음란 게시물 여부를 판단한다(S330). 이 때, 음란 게시물 여부에 대한 판단은 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시 물 여부를 판단할 수 있다. 이 때, 상기 게시물에 포함된 영상 또는 동영상에 기반한 음란 게시물 여부에 대한 판단은 인공지능 기반 음란 물 감시 기술을 이용하여 음란 게시물 여부를 판단할 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은, 단계 S330의 판단 결과 음란 게시물인 것으로 판단되는 경우, 상기 수신된 게시물의 게시자를 음란물 게시자 후보 목록 내에 추가한다(S350). 또한, 본 실시예에 따른 음란물 유포 감시 방법은 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소 셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지를 판단한다(S370). 예를 들어, 음란물 게시자 후보 목록 내에 포함된 게시자가 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 A기간 동안 B개 이상 인 경우 상기 게시자의 음란물 게시가 상습적인 것으로 판단될 수 있으며, 상기 기간 A와 개수 B의 값은 관리자 가 임의로 설정할 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은, 단계 S370에서 상기 게시자의 음란물 게시가 상습적인 것으 로 판단되는 경우, 상기 게시자를 음란물 게시자 목록에 추가한다(S390). 도 4는 본 발명의 다른 실시예에 따른 음란물 유포 감시 방법을 나타낸 흐름도이다. 도 4를 참조하면, 본 발명의 일실시예에 따른 음란물 유포 감시 방법은, 소셜 네트워크 서버에서 음란물 유포 감시 장치의 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링한다(S410). 이 때, 단계 S410은 상기 음란물 게시자 목록 내에 적어도 하나의 음란물 게시자가 포함된 경우에 수행될 수 있 다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은 소셜 네트워크 서버로부터 기설정된 특정 키워드가 적어도 하 나 이상 포함된 게시물을 검색하여 수신한다(S420). 상기 기설정된 특정 키워드의 일례로는 '누드', '성관계' 등의 단어가 포함될 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은, 단계 S420에서 수신된 게시물에 대하여 음란 게시물 여부를 판단한다(S430). 이 때, 음란 게시물 여부에 대한 판단은 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시 물 여부를 판단할 수 있다. 이 때, 상기 게시물에 포함된 영상 또는 동영상에 기반한 음란 게시물 여부에 대한 판단은 인공지능 기반 음란 물 감시 기술을 이용하여 음란 게시물 여부를 판단할 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은, 단계 S430의 판단 결과 음란 게시물인 것으로 판단되는 경우, 음란물 게시자 목록에 존재하지 않는 음란 게시물 게시자들을 음란물 게시자 후보 목록 내에 추가한다 (S440). 도면에는 도시되지 않았지만, 본 실시예에서는 상기 수신된 게시물의 게시자가 음란물 게시자 후보 목록에 중복 추가되는 것을 방지하기 위하여, 상기 게시자가 음란물 게시자 후보 목록 내에 이미 존재하는지 여부를 판단하 고, 존재하지 않는 경우에 상기 게시자를 음란물 게시자 후보 목록에 추가하는 단계를 더 포함할 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소 셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지를 판단한다(S450). 예를 들어, 음란물 게시자 후보 목록 내에 포함된 게시자가 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 A기간 동안 B개 이상 인 경우 상기 게시자의 음란물 게시가 상습적인 것으로 판단될 수 있으며, 상기 기간 A와 개수 B의 값은 관리자 가 임의로 설정할 수 있다. 또한, 본 실시예에 따른 음란물 유포 감시 방법은, 단계 S450에서 상기 게시자의 음란물 게시가 상습적인 것으 로 판단되는 경우, 상기 게시자를 음란물 게시자 목록에 추가한다(S460). 한편, 본 실시예에 따른 단계 S410 내지 단계 S460의 동작은 주기적으로 반복하여 동작하도록 설정될 수 있다. 도 5는 본 발명의 일 실시예에 따른 음란물 게시자의 구독 정보에 기반한 음란물 구독자 목록 관리 방법을 나타 낸 흐름도이다. 도 5를 참조하면, 본 실시예에 따른 음란물 구독자 목록 관리 방법은 소셜 네트워크 서버 내에서 음란물 게시자 목록 내에 포함된 게시자에 대한 구독자 정보를 모니터링한다(S510). 상기 모니터링은 음란물 게시자 목록 내에 포함된 일부 또는 모든 게시자를 구독 중인 일부 또는 모든 구독자에 대한 모니터링을 포함한다. 또한, 본 실시예에 따른 음란물 구독자 목록 관리 방법은 상기 구독자가 구독 중인 게시자 중 상기 음란물 게시 자 목록 내에 포함된 게시자의 수가 임계값을 초과하는지 여부를 판단한다(S530). 예를 들어, 상기 구독자가 구 독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 C명을 초과하는 경우 상기 구독자를 음 란물 구독자 목록에 추가할 수 있다. 도면에는 도시되지 않았지만, 본 실시예에서는 상기 구독자가 음란물 구독자목록에 중복 추가되는 것을 방지하 기 위하여, 상기 구독자가 음란물 구독자 목록 내에 이미 존재하는지 여부를 판단하고, 존재하지 않는 경우에 상기 구독자를 음란물 구독자 목록에 추가하는 단계를 더 포함할 수 있다. 또한, 본 실시예에 따른 음란물 구독자 목록 관리 방법은 단계 S530의 판단결과, 상기 구독자가 구독 중인 게시 자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는 경우, 상기 구독자를 음란물 구 독자 목록에 추가한다(S550). 한편, 본 실시예에 따른 단계 S510 내지 단계 S550의 동작은 주기적으로 반복하여 동작하도록 설정될 수 있다. 도 6은 본 발명의 일 실시예에 따른 음란물 구독자의 구독 정보에 기반한 음란물 게시자 목록 관리 방법을 나타 낸 흐름도이다. 도 6을 참조하면, 본 실시예에 따른 음란물 게시자 목록 관리 방법은 소셜 네트워크 서버 내에서 음란물 구독자 목록 내에 포함된 구독자가 구독 중인 게시자를 모니터링한다(S610). 상기 모니터링은 음란물 구독자 목록 내에 포함된 일부 또는 모든 구독자가 구독 중인 일부 또는 모든 게시자에 대한 모니터링을 포함한다. 또한, 본 실시예에 따른 음란물 게시자 목록 관리 방법은 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독 자 목록 내에 포함된 구독자의 수가 임계값을 초과하는지 여부를 판단한다(S630). 예를 들어, 상기 게시자를 구 독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 D명을 초과하는 경우 상기 게시자를 음 란물 게시자 후보 목록에 추가할 수 있다. 또한, 본 실시예에 따른 음란물 구독자 목록 관리 방법은 단계 S630의 판단결과, 상기 게시자를 구독 중인 구독 자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는 경우, 상기 게시자를 음란물 게 시자 후보 목록에 추가한다(S650).또한, 본 실시예에 따른 음란물 게시자 목록 관리 방법은 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단한다(S670). 또한, 본 실시예에 따른 음란물 게시자 목록 관리 방법은 상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가한다(S690). 이 때, 상기 단계 S690은 상기 S670의 판단 결과, 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우 에 수행될 수 있다. 한편, 본 실시예에 따른 단계 S610 내지 단계 S690의 동작은 주기적으로 반복하여 동작하도록 설정될 수 있다. 도 7은 본 발명의 일 실시예에 따른 컴퓨터 시스템의 일 예를 나타낸 블록도이다. 도 7을 참조하면, 본 발명의 실시예는 컴퓨터로 읽을 수 있는 기록매체와 같은 컴퓨터 시스템에서 구현될 수 있 다. 도 7에 도시된 바와 같이, 컴퓨터 시스템은 프로세서, 입출력부, 메모리를 포함한다. 프로세서는 본 명세서에서 제안된 음란물 유포 감시 장치에서의 게시물 감시 및 음란성 판별 과정 및/또는 방법을 구현한다. 구체적으로 프로세서는 본 명세서에서 게시된 실시예에서 설명된 음란물 유포 감시 장치 의 모든 동작을 구현하며, 도 3 내지 도 6에 따른 음란물 유포 감시 방법의 모든 동작을 수행한다. 예를 들어, 프로세서는 소셜 네트워크 서버로부터 수신된 게시물에 대하여 음란 게시물 여부를 판단하고, 상기 수신된 게시물이 음란 게시물로 판단되는 경우, 상기 수신된 게시물의 게시자를 음란물 게시자 후보 목록 내에 추가하고, 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하는지를 기준으로 상기 게 시자의 음란물 게시가 상습적인지 여부를 판단하고, 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경 우, 상기 게시자를 음란물 게시자 목록 내에 추가할 수 있다. 이 때, 상기 프로세서는 상기 수신된 게시물에 포함된 영상 또는 동영상을 기반으로 음란 게시물 여부를 판단할 수 있다. 이 때, 상기 프로세서는 인공지능 기반 음란물 감지 기술을 이용하여 음란 게시물 여부를 판단할 수 있다. 이 때, 상기 음란물 게시자 목록 내에 적어도 하나의 음란물 게시자가 포함된 경우, 상기 음란물 게시자 목록 내에 포함된 게시자의 새 게시물을 모니터링할 수 있다. 이 때, 상기 프로세서는 음란물 게시자 목록 내에 포함된 게시자를 구독 중인 구독자에 대하여, 상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하는지 여부를 판단하 고, 상기 구독자가 구독 중인 게시자 중 상기 음란물 게시자 목록 내에 포함된 게시자의 수가 임계값을 초과하 는 경우, 상기 구독자를 음란물 구독자 목록에 추가할 수 있다. 이 때, 상기 프로세서는 음란물 구독자 목록 내에 포함된 구독자가 구독 중인 게시자에 대하여, 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수가 임계값을 초과하는지 여부를 판단하 고, 상기 게시자를 상기 음란물 게시자 후보 목록에 추가할 수 있다. 이 때, 상기 프로세서는 상기 게시자를 구독 중인 구독자 중 상기 음란물 구독자 목록 내에 포함된 구독자의 수 가 임계값을 초과하는 경우에 상기 게시자를 상기 음란물 게시자 후보 목록에 추가할 수 있다. 이 때, 상기 프로세서는 상기 음란물 게시자 후보 목록 내에 포함된 게시자가 상기 소셜 네트워크 서버 내에 업 로드한 게시물 중 음란 게시물로 판단된 게시물의 수가 최근 일정 기간 동안 임계값을 초과하였는지 여부를 기 준으로 상기 게시자의 음란물 게시가 상습적인지 여부를 판단하고, 상기 음란물 게시자 후보 목록 내에 포함된 게시자를 상기 음란물 게시자 목록 내에 추가할 수 있다. 이 때, 상기 프로세서는 상기 게시자의 음란물 게시가 상습적인 것으로 판단되는 경우에 상기 게시자를 상기 음 란물 게시자 목록 내에 추가할 수 있다. 입출력부는 프로세서와 연결되어, 소셜 네트워크 서버의 정보를 송신 및/또는 수신한다. 예를 들어, 입출력부는 소셜 네트워크 서버로부터 기설정된 특정 키워드가 적어도 하나 이상 포함된 게시물을 검색하 여 수신할 수 있다. 또한, 입출력부는 상기 소셜 네트워크 서버 내에서 음란물 게시자 목록 내에 포함된 게시자를 구독 중인 구독자 정보를 수신할 수 있다. 또한, 입출력부는 소셜 네트워크 서버 내에서 음란물구독자 목록 내에 포함된 구독자가 구독 중인 게시자에 대한 정보를 수신할 수 있다. 메모리는 다양한 형태의 휘발성 또는 비휘발성 저장 매체일 수 있다. 이 때, 메모리는 기설정된 특정 키워드, 음란물 게시자 후보 목록, 음란물 게시자 목록에 대한 정보 중 적어도 하나를 저장할 수 있다. 이상에서와 같이 본 발명에 따른 음란물 유포 감시 장치 및 감시 방법은 상기한 바와 같이 설명된 실시예들의 구성과 방법이 한정되게 적용될 수 있는 것이 아니라, 상기 실시예들은 다양한 변형이 이루어질 수 있도록 각 실시예들의 전부 또는 일부가 선택적으로 조합되어 구성될 수도 있다."}
{"patent_id": "10-2020-0012445", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 소셜 네트워크 음란물 유포 감시 시스템의 일 예를 나타낸 블록도이다. 도 2는 본 발명의 일실시예에 따른 음란물 유포 감시 장치의 일 예를 나타낸 블록도이다. 도 3은 본 발명의 일실시예에 따른 음란물 유포 감시 방법을 나타낸 흐름도이다. 도 4는 본 발명의 다른 실시예에 따른 음란물 유포 감시 방법을 나타낸 흐름도이다. 도 5는 본 발명의 일 실시예에 따른 음란물 게시자의 구독 정보에 기반한 음란물 구독자 목록 관리 방법을 나타 낸 흐름도이다. 도 6은 본 발명의 일 실시예에 따른 음란물 구독자의 구독 정보에 기반한 음란물 게시자 목록 관리 방법을 나타 낸 흐름도이다. 도 7은 본 발명의 일 실시예에 따른 컴퓨터 시스템의 일 예를 나타낸 블록도이다."}
