{"patent_id": "10-2020-0100244", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0019936", "출원번호": "10-2020-0100244", "발명의 명칭": "철도 터널의 검사 방법", "출원인": "주식회사 미래시티글로벌", "발명자": "김동우"}}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "철도 터널 내부의 열차 선로를 따라서 검사 구간에 걸쳐서 주행하는 영상 촬영 장치에 의해 상기 철도 터널의내부가 동영상으로 촬영되는 동영상 촬영 단계;상기 동영상 촬영 단계를 통해 촬영된 상기 철도 터널 내부의 동영상 데이터가 상기 영상 촬영 장치에 구비되는통신부에 의해 원격지의 진단 관리 서버로 전송되는 영상 데이터 전송 단계;상기 영상 데이터 전송 단계를 통해 상기 진단 관리 서버로 전송된 상기 동영상 데이터로부터 상기 철도 터널의내부에 대한 정지 영상들이 점검자에 의해 추출되는 이미지 추출 단계;상기 이미지 추출 단계를 통해 추출된 상기 정지 영상들이 점검자에 의해 상기 철도 터널의 위치 별로 분류되는이미지 분류 단계; 및상기 이미지 분류 단계를 통해 분류된 상기 정지 영상들이 점검자에 의해 병합되어서 파노라마 이미지가 형성되는 이미지 병합 단계를 포함하는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 이미지 병합 단계를 통해 형성된 파노라마 이미지를 이용하여 검사 결과를 보여주는 검사 도면이 점검자에의해 생산되는 검사 도면 생산 단계를 더 포함하는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서,상기 검사 도면 생산 단계에서 상기 검사 도면에는 상기 파노라마 이미지의 정보에 기초하여 결함 위치가 표시되고 결함 내용이 기재되는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 검사 도면에는 해당 손상 위치의 사진 이미지가 점검자에 의해 링크되는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서,상기 영상 데이터 전송 단계는 상기 동영상 촬영 단계의 수행과 함께 실시간으로 수행되는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 진단 관리 서버에 구비되는 인공지능 진단부에 의해 상기 동영상 데이터가 진단되어서 긴급 보수가 요구되공개특허 10-2022-0019936-3-는 결함이 판별되는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "철도 터널의 내부의 열차 선로를 따라서 검사 구간에 걸쳐서 주행하는 영상 촬영 장치에 의해 상기 철도 터널의내부가 스틸 사진으로 촬영되는 스틸 사진 촬영 단계;상기 스틸 사진 촬영 단계를 통해 촬영된 상기 철도 터널 내부의 스틸 사진 데이터가 상기 영상 촬영 장치에 구비되는 통신부에 의해 원격지의 진단 관리 서버로 전송되는 스틸 사진 데이터 전송 단계;상기 스틸 사진 데이터 전송 단계를 통해 상기 진단 관리 서버로 전송된 상기 스틸 사진 데이터에 포함된 스틸사진들이 점검자에 의해 위치 별로 분류되는 이미지 분류 단계;상기 이미지 분류 단계를 통해 위치 별로 분류된 상기 스틸 사진들이 점검자에 의해 병합되어서 파노라마 이미지가 형성되는 파노라마 병합 단계; 및상기 파노라마 병합 단계를 통해 형성된 파노라마 이미지를 이용하여 상기 철도 터널의 내부에 대한 가상현실데이터가 점검자에 의해 생성되는 VR 데이터 생성 단계를 포함하는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 7에 있어서,상기 가상현실 데이터에 결함 부분에 대한 설명을 포함하는 증강현실 데이터가 점검자에 의해 추가되는 AR 데이터 생성 단계를 더 포함하는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 7에 있어서,상기 스틸 사진 데이터 전송 단계는 상기 스틸 사진 촬영 단계의 수행과 함께 실시간으로 수행되는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서,상기 진단 관리 서버에 구비되는 인공지능 진단부에 의해 상기 스틸 사진 데이터가 진단되어서 긴급 보수가 요구되는 결함이 판별되는,철도 터널의 검사 방법."}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 의하면, 철도 터널 내부의 열차 선로를 따라 검사 구간에 걸쳐서 주행하는 영상 촬영 장치에 의해 상 기 철도 터널의 내부가 동영상으로 촬영되는 동영상 촬영 단계; 상기 동영상 촬영 단계를 통해 촬영된 상기 철도 터널 내부의 동영상 데이터가 원격지의 진단 관리 서버로 전송되는 영상 데이터 전송 단계; 상기 영상 데이터 전 송 단계를 통해 상기 진단 관리 서버로 전송된 상기 동영상 데이터로부터 상기 철도 터널의 내부에 대한 정지 영 상들이 점검자에 의해 추출되는 이미지 추출 단계; 상기 이미지 추출 단계를 통해 추출된 상기 정지 영상들이 점 검자에 의해 상기 철도 터널의 위치 별로 분류되는 이미지 분류 단계; 및 상기 이미지 분류 단계를 통해 분류된 상기 정지 영상들이 점검자에 의해 병합되어서 파노라마 이미지가 형성되는 이미지 병합 단계를 보여주는 검사 도면이 점검자에 의해 생산되는 검사 도면 생산 단계를 포함하는 철도 터널의 검사 방법이 제공된다."}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 구조물의 검사 방법에 관한 것으로서, 더욱 상세하게는 철도 터널의 검사 방법에 관한 것이다."}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 노후된 철도 터널이 증가하면서, 철도 터널에 대한 효과적인 유지보수가 요구되고 있다. 일반적으로 철도 터널에 대한 검사는 점검자가 열차가 운행하지 않는 시간에 철도 터널을 직접 이동하면서 육안으로 확인함으로 써 이루어진다. 하지만, 이러한 인력에 의존한 기존 검사 방식은 점검자만이 균열 상태 등의 점검 데이터를 알 수 있어서 점검 작업의 신뢰성을 보장할 수 없고 점검 데이터를 보관할 수 없기 때문에 추후에 검사 데이터에 대한 재검토나 분석이 어렵다는 문제가 있다. 이러한 기존의 인력 의존 검사 방식의 문제를 개선하고자 하는 본 발명과 관련된 선행특허문헌으로서, 공개특허 제10-2002-0077250호에는 지하철 터널에 발생할 수 있는 크랙을촬영하여 기록하고 분석하는 기술이 기재되어 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허공보 공개번호 제10-2002-0077250호 \"콘크리트 구조물의 크랙 검출 및 영상 처리장치\" (2002.10.11.)"}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 기술적 과제는 영상 촬영을 이용하여 철도 터널을 검사하는 방법을 제공하는 것이다."}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기한 본 발명이 해결하고자 하는 기술적 과제를 달성하기 위하여, 본 발명의 일 측면에 따르면, 철도 터널 내 부의 열차 선로를 따라 검사 구간에 걸쳐서 주행하는 영상 촬영 장치에 의해 상기 철도 터널의 내부가 동영상으 로 촬영되는 동영상 촬영 단계; 상기 동영상 촬영 단계를 통해 촬영된 상기 철도 터널 내부의 동영상 데이터가 원격지의 진단 관리 서버로 전송되는 영상 데이터 전송 단계; 상기 영상 데이터 전송 단계를 통해 상기 진단 관 리 서버로 전송된 상기 동영상 데이터로부터 상기 철도 터널의 내부에 대한 정지 영상들이 점검자에 의해 추출 되는 이미지 추출 단계; 상기 이미지 추출 단계를 통해 추출된 상기 정지 영상들이 점검자에 의해 상기 철도 터 널의 위치 별로 분류되는 이미지 분류 단계; 및 상기 이미지 분류 단계를 통해 분류된 상기 정지 영상들이 점검 자에 의해 병합되어서 파노라마 이미지가 형성되는 이미지 병합 단계를 보여주는 검사 도면이 점검자에 의해 생 산되는 검사 도면 생산 단계를 포함하는 철도 터널의 검사 방법이 제공된다. 상기한 본 발명이 해결하고자 하는 기술적 과제를 달성하기 위하여, 본 발명의 다른 측면에 따르며, 철도 터널 의 내부의 열차 선로를 따라서 검사 구간에 걸쳐서 주행하는 영상 촬영 장치에 의해 상기 철도 터널의 내부가 스틸 사진으로 촬영되는 스틸 사진 촬영 단계; 상기 스틸 사진 촬영 단계를 통해 촬영된 상기 철도 터널 내부의 스틸 사진 데이터가 원격지의 진단 관리 서버로 전송되는 스틸 사진 데이터 전송 단계; 상기 스틸 사진 데이터 전송 단계를 통해 상기 진단 관리 서버로 전송된 상기 스틸 사진 데이터에 포함된 스틸 사진들이 점검자에 의해 위치 별로 분류되는 이미지 분류 단계; 상기 이미지 분류 단계를 통해 위치 별로 분류된 상기 스틸 사진들이 점 검자에 의해 병합되어서 파노라마 이미지가 형성되는 파노라마 병합 단계; 및 상기 파노라마 병합 단계를 통해 형성된 파노라마 이미지를 이용하여 상기 철도 터널의 내부에 대한 가상현실 데이터가 점검자에 의해 생성되는 VR 데이터 생성 단계를 포함하는 철도 터널의 검사 방법이 제공된다."}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면 앞서서 기재한 본 발명의 목적을 모두 달성할 수 있다. 구체적으로는, 철도 터널의 내부가 동 영상으로 촬영되고 촬영된 동영상을 이용하여 위치 및 부재 별로 분류된 정지 영상이 추출되며, 추출된 정지 영 상을 병합하여 파노라마 이미지가 생성되고, 생성된 파노라마 이미지를 이용하여 검사 도면이 작성되므로, 결함 위치 및 내용을 시각적으로 용이하게 파악할 수 있다. 또한, 철도 터널의 내부가 스틸 사진으로 촬영되고 촬영된 스틸 사진을 병합하여 파노라마 이미지를 생산하며 파노라마 이미지로 가상현실(VR) 및 증강현실(AR) 데이터를 생성하므로, 철도 터널의 내부에 대해 시각적으로 더욱 효율적인 검사가 수행될 수 있다."}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 도면을 참조하여 본 발명에 따른 실시예의 구성 및 작용을 상세하게 설명한다. 도 1에는 본 발명에 따른 철도 터널의 검사 방법을 수행하기 위한 철도 터널 검사 시스템의 일 실시예가 블록도 로서 도시되어 있다. 도 1을 참조하면, 철도 터널 검사 시스템은, 철도 터널 내에서 이동하면서 철도 터널 의 내부에 대한 영상을 촬영하는 영상 촬영 장치와, 철도 터널 검사 관리자가 사용하는 관리자 단말기 와, 영상 촬영 장치 및 관리자 단말기와 통신망을 통해 연결되고 영상 촬영 장치로부터 실 시간으로 전송된 철도 터널 내부에 대한 영상 데이터를 이용하여 철도 터널 검사 관련 데이터를 생산하고 관리 하는 진단 관리 서버를 포함한다. 영상 촬영 장치는 지하철 선로와 같은 열차 선로가 깔린 철도 터널 내에서 열차 선로를 따라 이동하면서 철도 터널 내부에 대한 영상을 동영상 또는 스틸 사진으로 촬영하고, 촬영된 철도 터널 내부에 대한 영상 데이 터를 무선 통신망을 통해 실시간으로 진단 관리 서버로 전송한다. 도 2에는 영상 촬영 장치의 일 예 가 철도 터널에서 영상을 촬영하는 상태가 도시되어 있다. 도 2를 참조하면, 영상 촬영 장치는 철도 터널 (T)의 내부(A)에 깔린 열차 선로(R)에 이동 가능하게 결합되어서 레일(R)을 따라 주행하는 주행 유닛과, 주행 유닛에 결합되어서 주행 유닛과 함께 이동하면서 철도 터널(T)의 내부(A)를 동영상 또는 스틸 사진으로 촬영하는 카메라와, 주행 유닛과 카메라를 연결하고 주행 유닛에 대한 카메라 의 상대 위치 및 자세를 변화시키는 카메라 아암과, 카메라에 의해 촬영된 동영상 또는 스틸 사 진 데이터가 저장되는 데이터 저장부와, 카메라에 의해 촬영된 철도 터널(T)의 내부(A)에 대한 동영 상 또는 스틸 사진 데이터를 무선통신망을 통해 진단 관리 서버로 전송하는 통신부를 구비한다. 도시 되지는 않았으나, 영상 촬영 장치는 철도 터널(T)의 내부(A)에서 카메라의 위치를 파악하기 위한 센 서와, 카메라의 주행 유닛에 대한 상대 위치 및 자세를 변화시키기 위해 카메라 아암을 제어하 는 제어부와, 철도 터널(T)의 내부(A)에서 촬영 장치의 위치를 파악하기 위한 위치 추정 모듈을 더 포함한 다. 영상 촬영 장치의 위치는 INS(관성항법장치), 바퀴의 회전수 측정, 영상 인식 등을 통해 세부적으로 보정될 수 있다. 도 2에서는 아치형 철도 터널(T)의 내부(A)에 열차 선로가 복선으로 형성된 것으로 도시되어 있는데, 본 발명은 철도 터널(T)의 형태를 이와 같이 제한하는 것은 아니며, 단선 등을 포함하는 다양한 형태의 철도 터널에 적용이 가능하다. 또한, 도 2에 도시된 아치형 철도 터널(T) 외에도, 도 3에 도시된 바와 같이, 분 리된 사각형의 두 내부 통로(A1) 각각에 선로가 형성된 박스형 철도 터널(T1)에 대한 영상 촬영 장치에 의 한 내부 영상 촬용에도 적용될 수 있다. 도 1을 참조하면, 관리자 단말기는 철도 터널 검사 관리자가 사용하는 단말기로서 진단 관리 서버와 유·무선 통신망을 통해 통신 가능하게 연결된다. 철도 터널 검사 관리자는 관리자 단말기를 통해 진단 관 리 서버에 접속하여 철도 터널 검사 작업을 수행하게 된다. 관리자 단말기로는 데스크탑 컴퓨터, 노 트북 컴퓨터, 태블릿 피씨, 스마트폰 등 진단 관리 서버와 통신할 수 있는 모든 정보 통신 기기가 사용될 수 있다. 진단 관리 서버는 영상 촬영 장치 및 관리자 단말기와 통신망을 통해 통신 가능하게 연결되고, 영상 촬영 장치로부터 실시간으로 전송된 철도 터널 내부에 대한 영상 데이터를 이용하여 철도 터널 검사 관련 데이터를 생산하고 관리한다. 진단 관리 서버는 촬영된 영상 데이터를 처리하여 등록하고 조회할 수 있도록 하는 영상 관리부와, 기존 검사 도면 또는 새롭게 생성된 검사 도면을 기간별로 조회할 수 있도록 하는 도면 관리부와, 결함 분류, 원인 및 조치 현황을 입력하고 조회할 수 있도록 하는 이슈 관리부 와, 초기 결함 관리와 조치 관리까지의 이력을 조회하여 관리할 수 있도록 하는 이력 관리부와, 검사 도면 을 통해 검출된 결함들에 대한 평가 보고서를 조회할 수 있도록 하는 문서 관리부를 구비한다. 진단 관리 서버의 기능은 이하 철도 터널의 검사 방법에 대한 설명을 통해서 더욱 상세하게 설명될 것이다. 도 3에는 본 발명의 일 실시예에 따른 철도 터널의 검사방법을 개략적으로 설명하는 순서도가 도시되어 있다. 도 3을 참조하면, 본 발명의 일 실시예에 따른 철도 터널의 검사방법은, 영상 촬영 장치(도 1 및 도 2의 110)를 이용하여 철도 터널의 내부를 동영상으로 촬영하는 동영상 촬영 단계(S110)와, 동영상 촬영 단계(S110)를 통해 촬영되는 철도 터널 내부의 동영상을 실시간으로 진단 관리 서버(도 1의 120)로 전송하는 영상 데이터 전송 단 계(S120)와, 영상 데이터 전송 단계(S120)를 통해 진단 관리 서버(도 1의 120)로 전송된 철도 터널의 내부에 대 한 동영상 데이터로부터 철도 터널의 내부에 대한 정지 영상들이 추출되는 이미지 추출 단계(S130)와, 이미지 추출 단계(S130)를 통해 추출된 정지 영상들이 위치 별로 분류되는 이미지 분류 단계(S140)와, 이미지 분류 단 계(S140)를 통해 위치별로 분류된 정지 영상들이 병합되어서 파노라마 이미지를 형성하는 이미지 병합 단계 (S150)와, 이미지 병합 단계(S150)를 통해 형성된 파노라마 이미지를 이용하여 검사 결과를 보여주는 검사 도면 이 생산되는 검사 도면 생산 단계(S160)를 포함한다. 동영상 촬영 단계(S110)에서는 영상 촬영 장치(도 1 및 도 2의 110)에 의해 철도 터널의 내부가 동영상으로 촬 영된다. 촬영된 동영상의 철도 터널 내부에서의 위치는 영상 촬영 장치(도 1 및 도 2의 110)에 구비되는 위치 추정 모듈(미도시)에 의해 파악될 수 있고, 그에 대응하여 촬영된 동영상의 위치가 정확하게 파악될 수 있다. 동영상 촬영 단계(S110)에서 철도 터널의 전체 검사 구간에 걸쳐서 카메라에 의해 천장, 바닥 및 양 측벽 을 포함하는 전체 영역에 대한 동영상이 촬영되고, 촬영된 동영상 데이터는 데이터 저장부(미도시)에 저장되며 동시에 통신망을 통해 원격지의 진단 관리 서버(도 1의 120)로 전송된다. 영상 데이터 전송 단계(S120)에서는 동영상 촬영 단계(S110)를 통해서 촬영되는 철도 터널 내부의 동영상 데이 터가 실시간으로 진단 관리 서버(도 1의 120)로 전송된다. 영상 데이터 전송 단계(S120)를 통해 진단 관리 서버 (도 1의 120)로 전송된 철도 터널 내부의 동영상 데이터는 진단 관리 서버(도 1의 120)에 구비되는 데이터 저장 장치(미도시)에 동영상이 촬영된 위치 정보와 함께 저장된다. 도시되지는 않았으나, 진단 관리 서버(도 1의 120)에는 인공지능 진단부가 더 구비되어서, 실시간으로 전송되는 철도 터널 내부의 동영상 데이터에 대한 실시 간 인공지능 진단이 수행될 수 있다. 인공지능 진단의 경우 긴급 보수가 요구되는 결함이 판별되어서, 관리자 단말기(도 1의 190)를 통해 철도 터널 검사 관리자에게 결함 정보가 긴급으로 통지될 수 있다. 이미지 추출 단계(S130)에서는 영상 데이터 전송 단계(S120)를 통해 전송된 철도 터널의 내부에 대한 동영상 데 이터로부터 철도 터널의 내부에 대한 정지 영상들이 추출된다. 구체적으로, 점검자인 철도 터널 검사 관리자가 관리자 단말기를 통해 진단 관리 서버(도 1의 110)에 접속하여, 진단 관리 서버(도 1의 110)의 데이터 저 장부(미도시)에 저장된 철도 터널 내부에 대한 동영상 데이터로부터 적절한 이미지 처리 컴퓨터 프로그램을 이 용하여 철도 터널 내부의 각 부분들에 대한 정지 영상을 추출함으로써 이미지 추출 단계(S130)가 수행될 수 있 다. 이미지 추출 단계(S130)에서 추출된 정지 영상들에 대한 추출 영상 데이터는 데이터 저장부에 저장된다. 이미지 분류 단계(S140)에서는 이미지 추출 단계(S130)를 통해 추출된 철도 터널 내부에 대한 정지 영상들이 위 치 별로 분류된다. 구체적으로, 점검자인 철도 터널 검사 관리자가 관리자 단말기를 통해 진단 관리 서버 (도 1의 110)에 접속하여, 이미지 추출 단계(S130)를 통해 추출된 철도 터널의 내부에 대한 정지 영상을 철도 터널의 위치에 따라 부분 별로 분류하여 데이터 저장부에 저장한다. 이미지 병합 단계(S150)에서는 이미지 분류 단계(S140)를 통해 위치 및 부분 별로 분류된 정지 영상들이 병합되 어서 파노라마 이미지를 형성한다. 구체적으로, 점검자인 철도 터널 검사 관리자가 관리자 단말기를 통해 진단 관리 서버(도 1의 110)에 접속하여, 이미지 분류 단계(S140)를 통해 위치 및 부분 별로 분류된 철도 터널 의 내부에 대한 정지 영상들을 적절한 이미지 처리 프로그램을 이용해 병합하여 파노라마 이미지를 생성함으로 써 수행될 수 있다. 이미지 병합 단계(S150)에서 생성되는 파노라마 이미지는 철도 터널의 연장방향 특정 위치 에서 천장, 바닥 및 양 측면을 포함하는 둘레방향을 따라서 형성되는 파노라마 이미지이다. 이러한 파노라마 이 미지는 철도 터널의 연장방향 검사 구간 전체에 대해서 형성된다. 검사 도면 생산 단계(S160)에서는 이미지 병합 단계(S150)를 통해 형성된 파노라마 이미지를 이용하여 검사 결 과를 보여주는 검사 도면이 점검자에 의해 생산된다. 구체적으로, 점검자인 철도 터널 검사 관리자가 관리자 단 말기를 통해 진단 관리 서버(도 1의 110)에 접속하여, 검사 도면 생산 단계(S160)에서 점검자는 파노라마 이미지를 통해 철도 터널 내부에서 부식, 균열 또는 파손 등의 결함 부위를 확인하고, 이를 철도 터널 도면에 해당 위치를 표시하고 결함 내용을 기재하여 검사 결과 도면을 생산하게 된다. 검사 결과 도면에는 해당 위치의 결함 내용을 사진 이미지로 확인할 수 있도록 해당 사진 이미지가 링크될 수 있다. 도 4에는 본 발명의 다른 실시예에 따른 철도 터널의 검사 방법을 개략적으로 설명하는 순서도가 도시되어 있다. 도 4를 참조하면, 본 발명의 다른 실시예에 따른 철도 터널의 검사 방법은, 영상 촬영 장치(도 1 및 도 2 의 110)를 이용하여 철도 터널의 내부를 스틸 사진으로 촬영하는 스틸 사진 촬영 단계(S210)와, 스틸 사진 촬영단계(S210)를 통해 촬영되는 철도 터널 내부의 스틸 사진을 실시간으로 진단 관리 서버(도 1의 120)로 전송하는 스틸 사진 데이터 전송 단계(S220)와, 스틸 사진 데이터 전송 단계(S220)를 통해 진단 관리 서버(도 1의 120)로 전송된 철도 터널의 내부에 대한 스틸 사진 데이터에 포함된 스틸 사진들이 위치 별로 분류되는 이미지 분류 단 계(S230)와, 이미지 분류 단계(S230)를 통해 위치별로 분류된 스틸 사진들이 병합되어서 파노라마 이미지를 형 성하는 파노라마 병합 단계(S240)와, 파노라마 병합 단계(S240)를 통해 형성된 파노라마 이미지를 이용하여 가 상현실(VR: Virtual Reality) 데이터를 생성하는 VR 데이터 생성 단계(S250)와, VR 데이터 생성 단계(S250)를 통해 생성되는 가상현실 데이터에 증강현실(AR: Augmented Reality) 데이터가 추가되는 AR 데이터 생성 단계 (S260)를 포함한다. 스틸 사진 촬영 단계(S210)에서는 영상 촬영 장치(도 1 및 도 2의 110)에 의해 철도 터널의 내부가 스틸 사진으 로 촬영된다. 촬영된 스틸 사진의 철도 터널 내부에서의 위치는 영상 촬영 장치(도 1 및 도 2의 110)에 구비되 는 위치 추정 모듈(미도시)에 의해 파악될 수 있고, 그에 대응하여 촬영된 스틸 사진의 위치가 정확하게 파악될 수 있다. 스틸 사진 촬영 단계(S210)에서 철도 터널의 전체 검사 구간에 걸쳐서 카메라에 의해 천장, 바닥 및 양 측벽을 포함하는 360° 전체 영역에 대한 스틸 사진이 촬영되고, 촬영된 스틸 사진 데이터는 데이터 저장 부(미도시)에 저장되며 동시에 통신망을 통해 원격지의 진단 관리 서버(도 1의 120)로 전송된다. 영상 데이터 전송 단계(S220)에서는 스틸 사진 촬영 단계(S210)를 통해서 촬영되는 철도 터널 내부의 스틸 사진 데이터가 실시간으로 진단 관리 서버(도 1의 120)로 전송된다. 스틸 사진 데이터 전송 단계(S220)를 통해 진단 관리 서버(도 1의 120)로 전송된 철도 터널 내부의 스틸 사진 데이터는 진단 관리 서버(도 1의 120)에 구비되는 데이터 저장 장치(미도시)에 스틸 사진이 촬영된 위치 정보와 함께 저장된다. 도시되지는 않았으나, 진단 관리 서버(도 1의 120)에는 인공지능 진단부가 더 구비되어서, 실시간으로 전송되는 철도 터널 내부의 스틸 사진 데 이터에 대한 실시간 인공지능 진단이 수행될 수 있다. 인공지능 진단의 경우 긴급 보수가 요구되는 결함이 판별 되어서, 관리자 단말기(도 1의 190)를 통해 철도 터널 검사 관리자에게 결함 정보가 긴급으로 통지될 수 있다. 이미지 분류 단계(S230)에서는 영상 데이터 전송 단계(S220)를 통해 진단 관리 서버(도 1의 120)로 전송된 철도 터널의 내부에 대한 스틸 사진 데이터에 포함된 스틸 사진들이 위치 별로 분류된다. 구체적으로, 점검자인 철도 터널 검사 관리자가 관리자 단말기를 통해 진단 관리 서버(도 1의 110)에 접속하여, 데이터 저장부에 저장 된 스틸 사진을 철도 터널의 위치에 따라 부분 및 부재 별로 분류하여 저장한다. 파노라마 병합 단계(S240)에서는 이미지 분류 단계(S230)를 통해 위치별로 분류된 스틸 사진들이 병합되어서 파 노라마 이미지를 형성한다. 구체적으로, 점검자인 철도 터널 검사 관리자가 관리자 단말기를 통해 진단 관 리 서버(도 1의 110)에 접속하여, 이미지 분류 단계(S230)를 통해 위치 및 부분 별로 분류된 철도 터널의 내부 에 대한 스틸 사진들을 적절한 이미지 처리 프로그램을 이용해 병합하여 파노라마 이미지를 생성함으로써 수행 될 수 있다. 파노라마 병합 단계(S240)에서 생성되는 파노라마 이미지는 철도 터널의 연장방향 및 360°둘레 방 향을 따라서 형성되는 파노라마 이미지이다. VR 데이터 생성 단계(S240)에서는 파노라마 병합 단계(S230)를 통해 형성된 파노라마 이미지를 이용하여 철도 터널의 내부에 대한 가상현실(VR: Virtual Reality) 데이터가 생성되고 데이터 저장부에 저장된다. AR 데이터 생성 단계(S260)에서는 VR 데이터 생성 단계(S250)를 통해 생성되는 가상현실 데이터에 결함 부분에 결함에 대한 설명을 추가하는 증강현실(AR: Augmented Reality) 데이터가 추가된다. 이상 실시예를 통해 본 발명을 설명하였으나, 본 발명은 이에 제한되는 것은 아니다. 상기 실시예는 본 발명의"}
{"patent_id": "10-2020-0100244", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "취지 및 범위를 벗어나지 않고 수정되거나 변경될 수 있으며, 본 기술분야의 통상의 기술자는 이러한 수정과 변 경도 본 발명에 속하는 것임을 알 수 있을 것이다."}
{"patent_id": "10-2020-0100244", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 철도 터널의 검사 방법을 수행하기 위한 철도 터널 검사 시스템의 일 실시예를 도시한 블록도이다. 도 2는 도 1에 도시된 볼록도에서 영상 촬영 장치의 일 예가 아치형 철도 터널에서 영상을 촬영하는 상태를 보여주는 도면이다. 도 3은 도 1에 도시된 블록도에서 영상 촬영 장치의 일 예가 박스형 철도 터널에서 영상을 촬영하는 상태를 보 여주는 도면이다. 도 4는 본 발명의 일 실시예에 따른 철도 터널의 검사 방법을 개략적으로 설명하는 순서도이다. 도 5는 본 발명의 다른 실시예에 따른 철도 터널의 검사 방법을 개략적으로 설명하는 순서도이다."}
