{"patent_id": "10-2022-0161128", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0078709", "출원번호": "10-2022-0161128", "발명의 명칭": "빅데이터 기반 2형 당뇨병 예측 방법", "출원인": "김현욱", "발명자": "김현욱"}}
{"patent_id": "10-2022-0161128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "환자의 개인 생활습관을 포함하는 생활습관 데이터 및 상기 환자가 검진받은 의료기관으로부터 상기 환자의 의료 데이터를 수집하는 단계; 및상기 수집된 생활습관 데이터 및 의료 데이터에 기초하여 학습된 2형 당뇨병 예측 모델에 기초하여 상기 환자의2형 당뇨병의 발병 위험도를 예측하는 단계;를 포함하고,상기 2형 당뇨병 예측모델은,상기 생활습관 데이터 및 의료 데이터를 포함하는 학습 데이터를 수집하는 단계;상기 수집된 데이터를 범주형 데이터(Categorical Data)와 수치형 데이터(Numerical Data)로 분류하는 단계; 및상기 분류된 데이터 중 2형 당뇨병 발병 원인에 대응되는 데이터를 독립변수로 정의하고, 각각의 변수간 상관관계 및 회귀관계의 분석을 통해 상기 2형 당뇨병 예측모델을 학습시키는 단계;를 포함하여 학습되는 것을 특징으로 하는 빅데이터 기반 2형 당뇨 예측 방법."}
{"patent_id": "10-2022-0161128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 학습 데이터를 수집하는 단계는,현재 2형 당뇨병 환자에 대응하는 제1 데이터, 현재 2형 당뇨병의 경계영역에 존재하는 환자에 대응하는 제2 데이터, 현재 2형 당뇨병과 무관한 환자에 대응하는 제3 데이터를 각각 수집하는 단계;를 포함하는 것을 특징으로 하는 빅데이터 기반 2형 당뇨병 예측 방법."}
{"patent_id": "10-2022-0161128", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 수집된 데이터 중 상기 범주형 데이터는 가족력, 비만여부, 식사메뉴, 처방약물기록, 병원진단기록을 포함하고,상기 수치형 데이터는, 연령, 스테로이드 용량과 누적투여량, 당질코르티코이드 호르몬 수치, 갑상선 호르몬 수치, 혈중 칼슘 수치, 총 콜레스테롤(중성지방, HDL, LDL), 섭취열량, 당화혈색소 수치, 운동능력 데이터를 포함하는 것을 특징으로 하는 빅데이터 기반 2형 당뇨병 예측 방법."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "빅데이터 기반 2형 당뇨 예측 방법이 개시된다. 본 명세서는 환자의 개인 생활습관을 포함하는 생활습관 데이터 및 상기 환자가 검진받은 의료기관으로부터 상기 환자의 의료 데이터를 수집하는 단계; 및 상기 수집된 생활습관 데이터 및 의료 데이터에 기초하여 학습된 2형 당뇨병 예측 모델에 기초하여 상기 환자의 2형 당뇨병의 발병 위 험도를 예측하는 단계;를 포함하고, 상기 2형 당뇨병 예측모델은, 상기 생활습관 데이터 및 의료 데이터를 포함 하는 학습 데이터를 수집하는 단계; 상기 수집된 데이터를 범주형 데이터(Categorical Data)와 수치형 데이터 (Numerical Data)로 분류하는 단계; 및 상기 분류된 데이터 중 2형 당뇨병 발병 원인에 대응되는 데이터를 독립 변수로 정의하고, 각각의 변수간 상관관계 및 회귀관계의 분석을 통해 상기 2형 당뇨병 예측모델을 학습시키는 단계;를 포함한다."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 명세서는 빅데이터 기반 2형 당뇨병 예측 방법 에 관한 것이다."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 당뇨병은 환자 본인이 당뇨의 진행이 어느정도 진행된 이후에 당뇨의 가능성을 자각하고 의료기관을 방문하게 된다. 환자의 개개인마다 다양한 증상을 나타내는 2형 당뇨는 발병이전 예측이 어려운 것이 현실이며 일반 병원에서는 종합적인 의료판단 보다는 단편적인 판단에 그치는 경우가 대부분이다. 데이터가 여러 곳에 나누어져 있고, 수기로 작성된 챠트, 기록 등에 의존하던 의료 현장이 최근 빅데이터, AI 산업의 활성화로 점차 의료기관의 자료 들이 데이터화 되고 있으며, 국가 정보망 등 의료 데이터를 한곳으로 모으려는 노력이 진행되고 있다."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 명세서는 병인과 병태가 개인별 차이가 큰 2형 당뇨를 예측함으로써, 2형 당뇨에 선제적으로 대처하여 당뇨 병을 효율적으로 대처할 수 있는 빅데이터 기반 2형 당뇨 예측 방법을 제공한다. 본 발명이 이루고자 하는 기술적 과제들은 이상에서 언급한 기술적 과제들로 제한되지 않으며, 언급되지 않은"}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "또 다른 기술적 과제들은 이하의 발명의 상세한 설명으로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가 진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법은 환자의 개인 생활습관을 포함하는 생활습 관 데이터 및 상기 환자가 검진받은 의료기관으로부터 상기 환자의 의료 데이터를 수집하는 단계; 및 상기 수집 된 생활습관 데이터 및 의료 데이터에 기초하여 학습된 2형 당뇨병 예측 모델에 기초하여 상기 환자의 2형 당뇨 병의 발병 위험도를 예측하는 단계;를 포함하고, 상기 2형 당뇨병 예측모델은, 상기 생활습관 데이터 및 의료 데이터를 포함하는 학습 데이터를 수집하는 단계; 상기 수집된 데이터를 범주형 데이터(Categorical Data)와 수 치형 데이터(Numerical Data)로 분류하는 단계; 및 상기 분류된 데이터 중 2형 당뇨병 발병 원인에 대응되는 데 이터를 독립변수로 정의하고, 각각의 변수간 상관관계 및 회귀관계의 분석을 통해 상기 2형 당뇨병 예측모델을 학습시키는 단계;를 포함한다. 상기 학습 데이터를 수집하는 단계는, 현재 2형 당뇨병 환자에 대응하는 제1 데이터, 현재 2형 당뇨병의 경계영 역에 존재하는 환자에 대응하는 제2 데이터, 현재 2형 당뇨병과 무관한 환자에 대응하는 제3 데이터를 각각 수 집하는 단계;를 포함한다. 상기 수집된 데이터 중 상기 범주형 데이터는 가족력, 비만여부, 식사메뉴, 처방약물기록, 병원진단기록을 포함 하고, 상기 수치형 데이터는, 연령, 스테로이드 용량과 누적투여량, 당질코르티코이드 호르몬 수치, 갑상선 호 르몬 수치, 혈중 칼슘 수치, 총 콜레스테롤(중성지방, HDL, LDL), 섭취열량, 당화혈색소 수치, 운동능력 데이터 를 포함할 수 있다."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 명세서의 일 실시예에 따르면, 병인과 병태가 개인별 차이가 큰 2형 당뇨를 예측함으로써, 2형 당뇨에 선제 적으로 대처하여 당뇨병을 효율적으로 대처할 수 있다. 본 발명에서 얻을 수 있는 효과는 이상에서 언급한 효과로 제한되지 않으며, 언급하지 않은 또 다른 효과들은"}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아래의 기재로부터 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0161128", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 도 1은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법이 구현되는 시스템을 설명하기 위한 도면이다. 도 3은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법에 적용되는 AI 장치(모듈)을 설명하기 위한 도면이다. 도 3은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법의 흐름도이다. 도 1은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법이 구현되는 시스템을 설명하기 위한 도면이다. 도 1을 참조하면, 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법은 컴퓨팅 장치 (예를 들어, 서버)의 프로세서의 제어 하에 구현될 수 있다. 상기 컴퓨팅 장치는 데이터 수집부, 데이터 처리부, 메모리, 통신부, AI 프로세서 , 프로세서를 포함할 수 있다. 데이터 수집부는 의료기관 또는 클라이언트로부터 데이터를 수집할 수 있다. 의료 기관은 환자의 의료 데이터를 보유하고 있는 기관이며, 클라이언트는 개인 단말, 보건의료 빅데이터 플랫폼을 운영하는 기 관으로서, 질병관리청, 국민건강보험공단, 건강보험심사평가원을 포함할 수 있다. 의료기관으로부터 수집되는 의료 데이터는 환자 개인의 검진 데이터로서, 환자가 의료 기관을 통해 검사한 데이터를 포함한다. 의료 데이터는 환가의 당화 혈색소 수치, 중성지방, HDH, LDL, 혈중 칼슘 수치, 갑상선 호 르몬 수치, 당질 코르티코이드 호르몬 수치, 스테로이드 용량과 누적 투여량을 포함할 수 있다. 개인 단말로부터 수집되는 데이터는 개인의 생활습관을 포함하는 생활습관 데이터일 수 있다. 상기 생활 습관 데이터는 상기 개인 단말에 설치된 적어도 하나의 애플리케이션을 통해 수집된 데이터를 포함할 수 있다. 상기 적어도 하나의 애플리케이션은 사용자에 의해 직접 입력된 데이터, 사용자의 피부에 부착된 웨어러블 디바이스 로부터 수집된 데이터를 포함할 수 있다. 생활 습관 데이터는 2형 당뇨의 원인을 생활 습관 요인으로부터 분석 하기 위해 수집되는 데이터로서, 식사메뉴, 섭취 열량, 운동능력 데이터 등을 포함할 수 있다. 운동능력 데이터라 함은 일일 평균 운동 소비 칼로리, 최대산소 섭취량(VO2Max), 휴식기 심박수 등을 포함하는 데이터로서, 개 인 단말기를 통해 입력 또는 센싱되는 데이터들을 포함할 수 있다. 상기 클라이언트로부터 수집되는 데이터 중 질병관리청 데이터셋으로부터 국민건강양양조사 데이터를 수집 하고, 국민건강보험공당 데이터셋으로부터 일반건강검진 대상자, 일반건강검진 문진표, 강남 데이터 등을 포함 할 수 있다. 또한, 건강보험심사평가원 데이터셋으로부터 진료내역, 수진자 상병내역, 원외처방전상세내역 등을 수집할 수 있다. 데이터 처리부는 상기 데이터 수집부를 통해 수집되는 데이터를 소정의 데이터 분석 방법을 이용하여 본 명세서의 일 실시예에 따른 2형 당뇨 예측 모델을 학습하기 위한 학습 데이터 생성에 필요한 데이터를 준비 하는 데이터 처리 기능을 수행할 수 있다. 통신부는 무선 통신부를 포함할 수 있다. 상기 무선 통신부를 통해 서버는 의료기관 장치, 클라 이언트 장치와 데이터를 송수신할 수 있다. 무선 통신부는 무선 인터넷 모듈을 포함할 수 있다. 무선 인터 넷 모듈은 무선 인터넷 기술들에 따른 통신망에서 무선 신호를 송수신하도록 이루어진다. 무선 인터넷 기술로는, 예를 들어 WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced), 5G 등이 있으며, 상기 무선 인터넷 모듈은 상기에서 나열되지 않은 인터넷 기술까지 포함한 범위에서 적어도 하나의 무선 인터넷 기술에 따라 데이터를 송 수신하게 된다. 메모리는 프로세서의 동작을 위한 프로그램을 저장할 수 있고, 입/출력되는 데이터들(예를 들어, 의 료기관 및/또는 클라이언트 디바이스로부터 수집되는 데이터 등)을 임시 저장할 수도 있다. 메모리는 플래 시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), SSD 타입(Solid State Disk type), SDD 타입(Silicon Disk Drive type), 멀티미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입 의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(random access memory; RAM), SRAM(static random access memory), 롬(read-only memory; ROM), EEPROM(electrically erasable programmable read-only memory), PROM(programmable read-only memory), 자기 메모리, 자기 디스크 및 광디스 크 중 적어도 하나의 타입의 저장 매체를 포함할 수 있다. 상기 서버는 인터넷(internet)상에서 저장부의 저장 기능을 수행하는 웹 스토리지 (web storage)와 관련되어 동작될 수도 있다. 한편, 본 명세서의 일 실시예에 따른 서버는 2형 당뇨 예측 모델을 학습하기 위한 데이터 학습 기능을 수 행하기 위한 AI 프로세서를 포함할 수 있다. 상기 AI 프로세서는 도 2에 도시된 바와 같이 별도의 장 치에 구비되거나, 서버에 구비되어 2형 당뇨 예측 모델을 학습하도록 제어할 수 있다. 프로세서는 서버의 전체 적인 기능을 제어하며, 의료 기관으로부터 수집되는 데이터, 클라이언트 로부터 수집되는 데이터에 기초하여 2형 당뇨 예측을 위한 애플리케이션을 구동하고, 상기 애플리케이션 구 동 결과 2형 당뇨 예측 결과를 클라이언트 디바이스로 제공할 수도 있다. 도 2는 본 명세서의 일 실시예에 빅 데이터 기반 2형 당뇨 예측 방법에 적용되는 AI 장치(모듈)을 설명하기 위 한 도면이다. 즉, 전술한 신경망 모델 학습은 도 3의 AI 장치의 데이터 학습과정을 통해 학습될 수 있다. 도 2를 살펴보면, AI 장치는 AI 프로세싱을 수행할 수 있는 AI 모듈을 포함하는 전자 기기 또는 AI 모듈을 포함하는 서버 등을 포함할 수 있다. 또한, AI 장치는 빅데이터 기반 2형 당뇨 예측 방법에 적용되는 2형 당뇨 예측모델 구현을 위한 장치의 적어도 일부의 구성으로 포함되어 AI 프로세싱 중 적어도 일부를 함께 수행 하도록 구비될 수도 있다. AI 프로세싱은 빅데이터 기반 2형 당뇨 예측 방법을 구현하는 장치의 제어부 및/또는 프로세서와 관련된 모든 동작들을 포함할 수 있다. 예를 들어, 클라이언트로부터 수집된 특정 데이트에 기초하여 2형 당뇨 예측모델 에 적용하여 2형 당뇨 발명 위험도를 결과로서 제공할 수 있다. AI 장치는 AI 프로세싱 결과를 직접 이용하는 클라이언트 디바이스이거나, AI 프로세싱 결과를 다른 기기에 제공하는 클라우드 환경의 디바이스일 수도 있다. AI 장치는 신경망을 학습할 수 있는 컴퓨팅 장치로서, 서 버, 데스크탑 PC, 노트북 PC, 태블릿 PC 등과 같은 다양한 전자 장치로 구현될 수 있다. AI 장치는 AI 프로세서, 메모리 및/또는 통신부를 포함할 수 있다. AI 프로세서는 메모리에 저장된 프로그램을 이용하여 신경망을 학습할 수 있다. 특히, AI 프로세서(2 1)는 현재 2형 당뇨병 환자에 대응하는 제1 데이터, 현재 2형 당뇨병의 경계영역에 존재하는 환자에 대응하는 제2 데이터, 현재 2형 당뇨병과 무관한 환자에 대응하는 제3 데이터에 기초하여 신경망을 학습할 수 있다. 여기서, 2형 당뇨 예측모델 학습에 필요한 데이터를 획득하기 위한 신경망은 인간의 뇌 구조를 컴퓨터 상에서 모의하도록 설계될 수 있으며, 인간의 신경망의 뉴런(neuron)을 모의하는, 가중치를 갖는 복수의 네트워크 노드 들을 포함할 수 있다. 복수의 네트워크 모드들은 뉴런이 시냅스(synapse)를 통해 신호를 주고받는 뉴런의 시냅 틱 활동을 모의하도록 각각 연결 관계에 따라 데이터를 주고받을 수 있다. 여기서 신경망은 신경망 모델에서 발 전한 딥러닝 모델을 포함할 수 있다. 딥러닝 모델에서 복수의 네트워크 노드들은 서로 다른 레이어에 위치하면 서 컨볼루션(convolution) 연결 관계에 따라 데이터를 주고받을 수 있다. 신경망 모델의 예는 심층 신경망(DNN, deep neural networks), 합성곱 신경망(CNN, convolutional deep neural networks), 순환 신경망(RNN, Recurrent Boltzmann Machine), 제한 볼츠만 머신(RBM, Restricted Boltzmann Machine), 심층 신뢰 신경망 (DBN, deep belief networks), 심층 Q-네트워크(Deep Q-Network)와 같은 다양한 딥 러닝 기법들을 포함하며, 컴퓨터비젼, 음성인식, 자연어처리, 음성/신호처리 등의 분야에 적용될 수 있다. 한편, 전술한 바와 같은 기능을 수행하는 프로세서는 범용 프로세서(예를 들어, CPU)일 수 있으나, 인공지능 학 습을 위한 AI 전용 프로세서(예를 들어, GPU)일 수 있다. 메모리는 AI 장치의 동작에 필요한 각종 프로그램 및 데이터를 저장할 수 있다. 메모리는 비 휘발 성 메모리, 휘발성 메모리, 플래시 메모리(flash-memory), 하드디스크 드라이브(HDD) 또는 솔리드 스테이트 드 라이브(SDD) 등으로 구현할 수 있다. 메모리는 AI 프로세서에 의해 액세스되며, AI 프로세서에 의 한 데이터의 독취/기록/수정/삭제/갱신 등이 수행될 수 있다. 또한, 메모리는 본 발명의 일 실시예에 따른 데이터 분류/인식을 위한 학습 알고리즘을 통해 생성된 신경망 모델(예를 들어, 딥 러닝 모델)을 저장할 수 있다. 한편, AI 프로세서는 2형 당뇨병 예측모델을 구현하기 위한 신경망을 학습하는 데이터 학습부를 포함할 수 있다. 데이터 학습부는 특정 개인의 2형 당뇨 발명 위험도를 판단하기 위하여 어떤 학습 데이터를 이용 할지, 학습 데이터를 이용하여 데이터를 어떻게 분류하고 인식할지에 관한 기준을 학습할 수 있다. 데이터 학습 부는 학습에 이용될 학습 데이터를 획득하고, 획득된 학습데이터를 기계학습 모델를 생성할 수 있다. 데이터 학습부는 적어도 하나의 하드웨어 칩 형태로 제작되어 AI 장치에 탑재될 수 있다. 예를 들어, 데이터 학습부는 인공지능(AI)을 위한 전용 하드웨어 칩 형태로 제작될 수도 있고, 범용 프로세서(CPU) 또 는 그래픽 전용 프로세서(GPU)의 일부로 제작되어 AI 장치에 탑재될 수도 있다. 또한, 데이터 학습부는 소프트웨어 모듈로 구현될 수 있다. 소프트웨어 모듈(또는 인스트럭션(instruction)을 포함하는 프로그램 모 듈)로 구현되는 경우, 소프트웨어 모듈은 컴퓨터로 읽을 수 있는 판독 가능한 비일시적 판독 가능 기록 매체 (non-transitory computer readable media)에 저장될 수 있다. 이 경우, 적어도 하나의 소프트웨어 모듈은 OS(Operating System)에 의해 제공되거나, 애플리케이션에 의해 제공될 수 있다. 데이터 학습부는 학습 데이터 획득부 및 모델 학습부를 포함할 수 있다. 학습 데이터 획득부는 데이터를 분류하고 인식하기 위한 신경망 모델에 필요한 학습 데이터를 획득할 수 있 다. 모델 학습부는 획득된 학습 데이터를 이용하여, 신경망 모델이 소정의 데이터를 어떻게 분류할지에 관한 판 단 기준을 가지도록 학습할 수 있다. 이 때 모델 학습부는 학습 데이터 중 적어도 일부를 판단 기준으로 이 용하는 지도 학습(supervised learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또는 모델 학습부는 지도 없이 학습 데이터를 이용하여 스스로 학습함으로써, 판단 기준을 발견하는 비지도 학습(unsupervised learning)을 통해 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 학습에 따른 상황 판단의 결과가 올바른지에 대한 피드백을 이용하여 강화 학습(reinforcement learning)을 통하여, 신경망 모델을 학습시킬 수 있다. 또한, 모델 학습부는 오류 역전파법(error back-propagation) 또는 경사 하강법(gradient decent)을 포함하는 학습 알고리즘을 이용하여 신경망 모델을 학습시킬 수 있다. 신경망 모델이 학습되면, 모델 학습부는 학습된 신경망 모델을 메모리에 저장할 수 있다. 모델 학습부 는 학습된 신경망 모델을 AI 장치와 유선 또는 무선 네트워크로 연결된 서버의 메모리에 저장할 수도 있다. 데이터 학습부는 인식 모델의 분석 결과를 향상시키거나, 인식 모델의 생성에 필요한 리소스 또는 시간을 절약하기 위해 학습 데이터 전처리부(미도시) 및 학습 데이터 선택부(미도시)를 더 포함할 수도 있다. 일 실시 예에 따라 본 명세서는 환자 개인의 생활습관 데이터 중 기 정의된 당뇨 발명 원인과 연관성이 있는 생활습관 데이터에 포함되지 않더라고, 환자 개인의 특이한 생활습관으로 판단되는 데이터를 배제하지 않고 학습 데이터 에 포함시킬 수 있다. 학습 데이터 전처리부는 획득된 데이터가 상황 판단을 위한 학습에 이용될 수 있도록, 획득된 데이터를 전처리 할 수 있다. 예를 들어, 학습 데이터 전처리부는, 모델 학습부가 텍스트 인식, 이미지 인식을 위한 학습을 위하여 획득된 학습 데이터를 이용할 수 있도록, 획득된 데이터를 기 설정된 포맷으로 가공할 수 있다. 또한, 학습 데이터 선택부는, 학습 데이터 획득부에서 획득된 학습 데이터 또는 전처리부에서 전처리된 학 습 데이터 중 학습에 필요한 데이터를 선택할 수 있다.선택된 학습 데이터는 모델 학습부에 제공될 수 있다. 또한, 데이터 학습부는 신경망 모델의 분석 결과를 향상시키기 위하여 모델 평가부(미도시)를 더 포함할 수 도 있다. 모델 평가부는, 신경망 모델에 평가 데이터를 입력하고, 평가 데이터로부터 출력되는 분석 결과가 소정 기준을 만족하지 못하는 경우, 모델 학습부로 하여금 다시 학습하도록 할 수 있다. 이 경우, 평가 데이터는 인식 모델을 평가하기 위한 기 정의된 데이터일 수 있다. 일 예로, 모델 평가부는 평가 데이터에 대한 학습된 인식 모델의 분석 결과 중, 분석 결과가 정확하지 않은 평가 데이터의 개수 또는 비율이 미리 설정되 임계치를 초과 하는 경우, 소정 기준을 만족하지 못한 것으로 평가할 수 있다. 일 실시예에 따라, 본 명세서는 기 학습된 2형 당뇨 예측모델을 학습시킨 후 적용하는 중 예를 들어, 실질적인 병변결과에 해당하는 혈액검진 결과 수치는 낮 지만 가족력 데이터에 가중치가 크게 부여되어 현재 정상인 환자에 대하여 2형 당뇨 위험도를 높게 설정한 결과 가 출력될 경우, 프로세서는 모델 평가부를 통해 2형 당뇨 예측모델이 소정 기준을 만족하지 못한 것으로 판단할 수 잇다. 통신부는 AI 프로세서에 의한 AI 프로세싱 결과를 외부 전자 기기로 전송할 수 있다. 예를 들어, 외부 전자 기기는 수중펌프를 통합관리 하는 서버를 포함할 수 있다. 한편, 도 2에 도시된 AI 장치는 AI 프로세 서와 메모리, 통신부 등으로 기능적으로 구분하여 설명하였지만, 전술한 구성요소들이 하나의 모듈 로 통합되어 AI 모듈로 호칭될 수도 있음을 밝혀둔다. 도 3은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법의 흐름도이다. 도 3에 개시되는 방법 은 도 1에 개시된 서버의 프로세서에 의해 구현될 수 있다. 프로세서는 환자의 개인 생활습관을 포함하는 생활습관 데이터 및 상기 환자가 검진받은 의료기관으로부터 상기 환자의 의료 데이터를 수집할 수 있다(S300). 상기 생활습관 데이터는 환자 개인의 개인 단말로부터 통신 부를 통해 수신할 수 있다. 상기 의료 데이터는 의료 기관으로부터 수집된 데이터를 포함하는 것으로서, 상기 의료 데이터는 환자 개인의 의료 기록으로서, 의료기관과 서버를 운영하는 기관 간의 개인정보 보호 및 인 증 절차가 완료된 상태에서 수집되는 데이터일 수 있다. 프로세서는 상기 수집된 생활습관 데이터 및 의료 데이터에 기초하여 학습된 2형 당뇨병 예측 모델에 기초 하여 상기 환자의 2형 당뇨병의 발병 위험도를 예측할 수 있다(S320). 상기 2형 당뇨병 예측 모델은 사전에 학습되어 메모리에 저장된 모델로서, 프로세서는 2형 당뇨병 예측 모 델을 학습하기 위하여 학습 데이터를 수집한다(S311). 상기 학습 데이터는 환자의 생활습관 데이터와 의료 데이터를 포함한다. 상기 환자는 2형 당뇨가 현재 진행 중 인 환자, 2형 당뇨의 경계영역에 위치하는 환자, 2형 당뇨가 없는 환자 데이터를 모두 포함할 수 있다. 프로세서는 상기 수집된 데이터를 범주형 데이터(Categorical Data)와 수치형 데이터(Numerical Data)로 분류할 수 있다(S312) 상기 범주형 데이터는 가족력, 비만여부, 식사메뉴, 처방약물기록, 병원진단기록을 포함할 수 있다. 상기 수치 형 데이터는, 연령, 스테로이드 용량과 누적투여량, 당질코르티코이드 호르몬 수치, 갑상선 호르몬 수치, 혈중 칼슘 수치, 총 콜레스테롤(중성지방, HDL, LDL), 섭취열량, 당화혈색소 수치, 운동능력 데이터를 포함할 수 있 다. 프로세서는 상기 분류된 데이터 중 2형 당뇨병 발명 원인에 대응되는 데이터를 독립변수로 정의하고, 각각 의 변수간 상관관계 및 회귀관계의 분석을 통해 상기 2형 당뇨병 예측모델을 학습시킬 수 있다(S313). 일 실시예에 따라 프로세서는 2형 당뇨 예측 모델을 학습시키는 과정에서 수집되는 모든 데이터를 독립 변 수로 구성하고, 변수간 상관관계 및/또는 회귀관계 분석을 통해 2형 당뇨 예측모델을 학습시킬 수 있다. 또한, 일 실시예에 따라 프로세서는 2형 당뇨 예측 모델을 학습시키는 과정에서 연령, 섭취열량, 운동능력 데이터, 가족력, 비만여부, 식사메뉴, 처방 약물 기록을 포함하는 데이터를 상기 독립변수로 정의하고, 당화혈 색소 수치, 스테로이드 용량과 누적투여량, 당질코르티코이드 호르몬수치, 갑상선 호르몬 수치, 혈중 칼슘 수치, 총 콜레스테롤(중성지방, HDL, LDL), 병원 진단 기록을 종속변수로 정의하여 회귀분석을 진행할 수도 있 다. 일 실시예에 따라 상기 학습 데이터로 수집되는 환자의 생활습관 데이터와 의료 데이터 중 2형 당뇨의 실질적 병변 원인으로 판단하는 제1 그룹 데이터를 독립 변수로 정의하고, 상기 2형 당뇨병 진단에 직접적으로 기초가 되는 데이터를 제2 그룹 데이터로 구분하여 종속 변수로 정의할 수도 있다. 프로세서는 상기 제1 그룹 데 이터와 제2 그룹 데이터에 포함되는 데이터 항목의 개수와 종류는 2형 당뇨 예측 모델 검증 과정에서 지속적으 로 업데이트될 수 있다. 본 명세서의 일 실시예에 따라 프로세서는 2형 당뇨 예측 모델을 적용한 결과 2형 당뇨병 발병 위험도는 당뇨병의 발병 예상시기, 당뇨병의 발병률 중 적어도 하나를 포함하는 형태로 제공할 수 있다. 한편, 상기 2형 당뇨병 발명 위험도는 도 2에서 설명한 딥러닝 학습모델의 파라미터로 판단될 수 있다. 한편, 본 명세서의 일 실시예에 따라 2형 당뇨 예측 모델에 적용되는 학습 데이터는 실시간으로 수집되는 데이 터와 사전에 저장된 데이터로 구분하고, 미리 정해진 기준에 따라 일정 시간 구간 전에 저장된 데이터를 수집하 여 학습 데이터로 활용할 수도 있다. 본 명세서의 일 실시예에 따른 2형 당뇨 예측 모델을 소프트웨어 형태로 구현되어 소정의 애플리케이션 서비스 로 제공되는 경우, 의료 기관에서는 해당 애플리케이션을 통해 환자 개인의 생활 습관 데이터와 병원에 보관되 어 있는 의료 데이터에 기초하여 보다 편리하게 2형 당뇨 발명의 위험도를 예측할 수 있다. 전술한 본 명세서는, 프로그램이 기록된 매체에 컴퓨터가 읽을 수 있는 코드로서 구현하는 것이 가능하다. 컴퓨 터가 읽을 수 있는 매체는, 컴퓨터 시스템에 의하여 읽혀질 수 있는 데이터가 저장되는 모든 종류의 기록장치를 포함한다. 컴퓨터가 읽을 수 있는 매체의 예로는, HDD(Hard Disk Drive), SSD(Solid State Disk), SDD(Silicon Disk Drive), ROM, RAM, CD-ROM, 자기 테이프, 플로피 디스크, 광 데이터 저장 장치 등이 있으며, 따라서, 상 기의 상세한 설명은 모든 면에서 제한적으로 해석되어서는 아니되고 예시적인 것으로 고려되어야 한다. 본 발명 의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다.도면 도면1 도면2 도면3"}
{"patent_id": "10-2022-0161128", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 명세서에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 명세서에 대한 실시예를 제공하고, 상세한 설명과 함께 본 명세서의 기술적 특징을도 설명한다. 도 1은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법이 구현되는 시스템을 설명하기 위한 도면이다. 도 2는 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법에 적용되는 AI 장치(모듈)을 설명하기 위한 도면이다. 도 3은 본 명세서의 일 실시예에 따른 빅데이터 기반 2형 당뇨 예측 방법의 흐름도이다. 본 명세서에 관한 이해를 돕기 위해 상세한 설명의 일부로 포함되는, 첨부 도면은 본 발명에 대한 실시예를 제공하고, 상세한 설명과 함께 본 발명의 기술적 특징을 설명한다."}
