{"patent_id": "10-2018-0078754", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2020-0005253", "출원번호": "10-2018-0078754", "발명의 명칭": "유전자 알고리즘을 이용한 부동산 경매에서의 낙찰가 예측 시스템 및 방법", "출원인": "강준", "발명자": "강준"}}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "부동산 경매에서의 낙찰가 예측 시스템에서의 낙찰가 예측 방법에서, 부동산 경매 관련 데이터를 수집하여 선별하는 데이터 선별 단계;선별된 데이터에 대하여 통계적 기법 및 인공지능 기법을 적용하여 낙찰가를 예측하는 단계; 각 기법을 통해 예측된 낙찰가를 비교하는 단계; 및비교 결과, 정확도가 가장 높은 기법을 선정하는 단계를 포함하는 낙찰가 예측 방법."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 통계적 기법은 리그레션(Regression) 기법을 포함하는 것임을 특징으로 하는 낙찰가 예측 방법."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 인공지능 기법은 ANN(Artificial Neural Network), GA(Generic Algorithm) 기법을 포함하는 것임을 특징으로 하는 낙찰가 예측 방법."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 예측된 낙찰가를 비교하는 단계에서, 각 기법의 MAPE(Mean Absolute Percent Error)를 산출하여 비교하는 것을 특징으로 하는 낙찰가 예측 방법."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1에 있어서, 상기 예측된 낙찰가를 비교하는 단계에서, 각 기법의 RMSE(Root Mean Square Error)를 산출하여 비교하는 것을 특징으로 하는 낙찰가 예측 방법."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "에 있어서, 상기 서버는 상기 통계적 기법 중에서 리그레션(Regression) 기법을 수행하는 리그레션 예측 모듈을 포함하는것임을 특징으로 하는 낙찰가 예측 시스템."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서, 상기 서버는 상기 인공지능 기법 중에서 ANN(Artificial Neural Network) 기법을 수행하는 ANN 예측 모듈과,GA(Generic Algorithm) 기법을 수행하는 GA 예측 모듈을 포함하는 것임을 특징으로 하는 낙찰가 예측 시스템."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 6에 있어서, 상기 서버는 상기 각 기법의 MAPE(Mean Absolute Percent Error)를 산출하는 방식으로 낙찰가를 비교하는 것을특징으로 하는 낙찰가 예측 시스템."}
{"patent_id": "10-2018-0078754", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 6에 있어서, 상기 서버는 상기 각 기법의 RMSE(Root Mean Square Error)를 산출하는 방식으로 낙찰가를 비교하는 것을 특징으로 하는 낙찰가 예측 시스템."}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 부동산 경매에서의 낙찰가 예측 시스템에서의 낙찰가 예측 방법에서, 부동산 경매 관련 데이터를 수집 하여 선별하는 데이터 선별 단계, 선별된 데이터에 대하여 통계적 기법 및 인공지능 기법을 적용하여 낙찰가를 예측하는 단계, 각 기법을 통해 예측된 낙찰가를 비교하는 단계 및 비교 결과, 정확도가 가장 높은 기법을 선정 하는 단계를 포함한다. 본 발명에 의하면, 유전자 알고리즘을 이용하여 부동산 경매에서 낙찰가를 예측하여, 보다 정확한 낙찰가 정보를 제공함으로써, 보다 용이하게 낙찰 정보를 예측하고, 보다 정확하게 낙찰 정보를 예측하여, 사용자의 편의에 기 여한다는 효과가 있다."}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 부동산 경매에 관한 것으로서, 더욱 상세하게는 부동산 경매에서 낙찰가를 예측하는 기술에 관한 것 이다."}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 부동산 경매는, 법률적인 전문 지식이 없이는 아무나 참여하기 힘든 특수분야로서, 경매 투자에 앞 서 일반인들은 부동산에 대한 기본 절차와 법률 지식이 없고, 법률적인 서비스 제공 행위가 뒷받침되지 못하여 일부 경매 브로커들의 농간과 방해 속에 많은 피해를 보고 있음은 주지된 사실이다. 이에 법원은 경매의 공정성과 신속성을 확보하고자, 호가제에서 입찰제로 바꾸고 경매절차를 수월하게 바꾸어 일반인들의 참여를 독려하는 등의 경매의 대중화에 안간힘을 쓰고 있다. 그러나 부동산 경매는 채권자, 채무자, 세입자 등의 이해 관계자와 경매를 집행하는 민사소송 중 \"강제 집행 편\"에 의거하여 진행하며 관계 법률인 민법, 상법, 민사특별법, 공시법 등이 상호 첨예하게 각축을 벌이게 되어 상당한 수준의 법률지식과 수학실력이 요구된다. 따라서 주택을 경매 받으려면 주택임대차 보호법과 상가나 사무실은 건물 임대차 보호법을 알아야만 하고, 등기 부를 이해하려고 하면 부동산 등기법을 알아야 하고, 토지대장과 지적도는 지적법을 알아야 하고, 농지를 경매 받으려면 농지법에 해당되는 지를 사전에 점검해야 하며, 소유권 이전시 취득세, 등록세 등의 세무관계 등 복잡 한 절차를 사전에 철저히 점검하지 않으면 뜻하지 않은 손해를 볼 수가 있다.한편 최근 온라인 분야가 활발히 전개됨에 따라 다양한 부동산 경매정보 제공사이트들이 등장하고 있다. 그리고 이러한 사이트를 접속하는 사용자들의 근본적인 목적은, 경매물건에 대한 손익점을 정밀하게 분석하여, 적정 입 찰가격 분석정보를 손쉽게 획득함에 있다. 그러나, 종래 부동산 경매정보 제공사이트는, 단순히 법원 서버나 가맹 서버를 통해 제공받은 경매 정보들을 웹 페이지에 등재하는 형태에 국한되고 있어서, 법률적인 전문지식을 가지지 아니한 자가 상기 등재된 경매 정보를 직접 분석하여, 경매 물건에 대한 적정 입찰가격 정보를 산출하기는 사실상 어렵다는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 10-2017-0143258"}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상기와 같은 문제점을 해결하기 위하여 안출된 것으로서, 부동산 경매 낙찰가 관련 데이터를 바탕으 로 통계 기법인 리그레션(Regression)과 인공지능 기법인 ANN(Artificial Neural Network), GA(Generic Algorithm)를 통해 개별 부동산 낙찰가격 예측 시스템 및 방법을 제공하는데 그 목적이 있다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이와 같은 목적을 달성하기 위한 본 발명의 부동산 경매에서의 낙찰가 예측 시스템에서의 낙찰가 예측 방법에서, 부동산 경매 관련 데이터를 수집하여 선별하는 데이터 선별 단계, 선별된 데이터에 대하여 통계적 기 법 및 인공지능 기법을 적용하여 낙찰가를 예측하는 단계, 각 기법을 통해 예측된 낙찰가를 비교하는 단계 및 비교 결과, 정확도가 가장 높은 기법을 선정하는 단계를 포함한다. 상기 통계적 기법은 리그레션(Regression) 기법을 포함할 수 있다. 상기 인공지능 기법은 ANN(Artificial Neural Network), GA(Generic Algorithm) 기법을 포함할 수 있다. 상기 예측된 낙찰가를 비교하는 단계에서, 각 기법의 MAPE(Mean Absolute Percent Error)를 산출하여 비교하거 나 또는, 각 기법의 RMSE(Root Mean Square Error)를 산출하여 비교할 수 있다. 본 발명의 부동산 경매에서의 낙찰가 예측 시스템에서, 부동산 경매 관련 데이터를 저장하고 있는 데이터베이스 및 상기 데이터베이스로부터 부동산 경매 관련 데이터를 수집하여 선별하고, 선별된 데이터에 대하여 통계적 기 법 및 인공지능 기법을 적용하여 낙찰가를 예측하고, 각 기법을 통해 예측된 낙찰가를 비교하고, 비교 결과, 정 확도가 가장 높은 기법을 선정하는 서버를 포함한다. 상기 서버는 상기 통계적 기법 중에서 리그레션(Regression) 기법을 수행하는 리그레션 예측 모듈을 포함할 수 있다. 상기 서버는 상기 인공지능 기법 중에서 ANN(Artificial Neural Network) 기법을 수행하는 ANN 예측 모듈과, GA(Generic Algorithm) 기법을 수행하는 GA 예측 모듈을 포함할 수 있다. 상기 서버는 상기 각 기법의 MAPE(Mean Absolute Percent Error) 또는 RMSE(Root Mean Square Error)를 산출하 는 방식으로 낙찰가를 비교할 수 있다."}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 유전자 알고리즘을 이용하여 부동산 경매에서 낙찰가를 예측하여, 보다 정확한 낙찰가 정보 를 제공함으로써, 보다 용이하게 낙찰 정보를 예측하고, 보다 정확하게 낙찰 정보를 예측하여, 사용자의 편의에 기여한다는 효과가 있다."}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변경을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명 의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 출원에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함 하다\" 또는 \"가지다\" 등의 용어는 명세서 상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조 합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 갖고 있다. 일반 적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 갖는 의미와 일치하는 의미를 갖는 것으로 해석되어야 하며, 본 출원에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미 로 해석되지 않는다. 또한, 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부 여하고 이에 대한 중복되는 설명은 생략하기로 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체 적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 도 1은 본 발명의 일 실시예에 따른 부동산 경매에서의 낙찰가 예측 시스템을 도시한 도면이다. 도 1을 참조하면, 본 발명의 부동산 경매에서의 낙찰가 예측 시스템은 서버 및 데이터베이스를 포함 한다. 데이터베이스에는 부동산 경매 관련 데이터가 저장되어 있다. 서버는 데이터베이스로부터 부동산 경매 관련 데이터를 수집하여 선별한다. 그리고, 선별된 데이터에 대하여 통계적 기법 및 인공지능 기법을 적용하여 낙찰가를 예측하고, 각 기법을 통해 예측된 낙찰가를 비교한 다. 비교 결과, 정확도가 가장 높은 기법을 선정하여 낙찰가를 예측한다. 서버는 데이터 선별 모듈, 리그레션 예측 모듈, ANN 예측 모듈, GA-리그레션 예측 모듈, 제어 모듈을 포함한다. 데이터 선별 모듈은 데이터베이스로부터 데이터를 수집하고, 수집된 데이터에 대해 유의적 데이터를 선별하고, 데이터를 표준화하고, 트레이닝(Training) 데이터와 홀드아웃(Holdout) 데이터로 분류한다. 본 발명 의 일 실시예에서, 데이터 선별 모듈은 서울시의 데이터를 대상으로 서울 전체, 5대 권역, 25개 구로 구분 하여 데이터를 선별할 수 있다. 리그레션 예측 모듈은 통계적 기법 중에서 리그레션(Regression) 기법을 수행하는 모듈이다. ANN 예측 모듈은 인공지능 기법 중에서 ANN(Artificial Neural Network) 기법을 수행하는 모듈이다. GA-리그레션 예측 모듈은 인공지능 기법 중에서 GA(Generic Algorithm) 기법을 수행하는 모듈이다. 제어모듈은 각 기법에서 산출된 MAPE(Mean Absolute Percent Error)를 비교하거나 또는, RMSE(Root Mean Square Error)를 비교하는 방식으로 낙찰가를 비교하고, 비교 결과, 정확도가 가장 높은 기법을 선정하여 낙찰 가를 예측한다. 보다 구체적으로, 리그레션 예측 모듈에서는 트레이닝 셋(Training Set)을 통한 회귀계수를 산정하고, 이 를 통해 홀드아웃 셋(Holdout set) 예측값을 산정하고, MAPE를 도출한다. 그리고, ANN 예측 모듈은 인공신경망을 통한 낙찰가율을 산정하고, 이를 통해 홀드아웃 셋 예측값을 산정 하고, MAPE를 도출한다. 그리고, GA-리그레션 예측 모듈은 리그레션 회귀계수를 모형화하고, GA-리그레션 예측값을 산정하고, MAPE 를 도출한다. 제어모듈은 각 기법의 MAPE 또는 RMSE를 비교하는데, 서울시를 예를 들면, 서울 전체 지역 예측을 비교하 거나, 5대 권역별 예측을 비교하거나, 25개 지역구 예측을 비교한다. 그리고, 제어 모듈은 비교 결과에 대하여 Paired t-test 방식으로 유의성을 검증하고, 리그레션, ANN, GA 기법에 대한 유의적 모형을 도출한다. 그리고, 제어 모듈은 군집 분석을 실시하되, 감정가격 순으로 그룹화 분석을 실시한다. 그리고, 군집지역 별 GA 2차 예측을 실시한다. 그리고, 제어 모듈은 군집지역별 GA 2차 예측 결과에 대해 Paired t-test 방식으로 유의성을 검증하고, 최 종 예측 모형 및 군집지역을 도출한다. 도 2는 본 발명의 일 실시예에 따른 부동산 경매에서의 낙찰가 예측 방법을 도시한 흐름도이다. 도 2를 참조하면, 본 발명의 부동산 경매에서의 낙찰가 예측 시스템에서의 낙찰가 예측 방법에서, 먼저 부동산 경매 관련 데이터를 수집하여 선별한다(S210). 그리고, 선별된 데이터에 대하여 통계적 기법인 리그레션 예측을 실시한다(S220). 그리고, 인공지능 기법인 ANN 예측을 실시한다(S230). 그리고, 인공지능 기법인 GA-리그레션 예측을 실시한다 (S240). 그리고, 각 기법을 통해 예측된 낙찰가를 비교한다(S250). 그리고, 비교 결과에 대하여 1차 유의성을 검증한다 (S260). 그리고, 군집분석 및 GA 2차 예측을 실시한다(S270). 그리고, 2차 유의성을 검증하여, 정확도가 가장 높은 기법을 선정한다(S280). 도 3은 본 발명의 일 실시예에 따른 부동산 경매에서의 낙찰가 예측 모델 구조를 예시한 도면이다. 도 3을 참조하면, 데이터 선별 단계(S210)에서는 데이터베이스로부터 데이터를 수집하고(S211), 수집된 데 이터에 대해 유의적 데이터를 선별하고(S212), 데이터를 표준화하고(S213), 트레이닝(Training) 데이터와 홀드 아웃(Holdout) 데이터로 분류한다(S214). 본 발명의 일 실시예에서, 데이터 선별 에서는 서울시의 데이터 를 대상으로 서울 전체, 5대 권역, 25개 구로 구분하여 데이터를 선별할 수 있다(S215). 리그레션 예측 단계(S220)는 통계적 기법 중에서 리그레션(Regression) 기법을 수행하는데, 트레이닝 셋 (Training Set)을 통한 회귀계수를 산정하고(S221), 이를 통해 홀드아웃 셋(Holdout set) 예측값을 산정하고 (S222), MAPE를 도출한다(S223). ANN 예측 단계(S230)는 인공지능 기법 중에서 ANN(Artificial Neural Network) 기법을 수행하는데, 인공신경망 을 통한 낙찰가율을 산정하고(S231), 이를 통해 홀드아웃 셋 예측값을 산정하고(S32), MAPE를 도출한다(S233). GA-리그레션 예측 단계(S240)은 인공지능 기법 중에서 GA(Generic Algorithm) 기법을 수행하는데, 리그레션 회 귀계수를 모형화하고(S241), GA-리그레션 예측값을 산정하고(S242), MAPE를 도출한다(S243). 비교 단계(S250)에서는 각 기법에서 산출된 MAPE(Mean Absolute Percent Error)를 비교하거나 또는, RMSE(Root Mean Square Error)를 비교하는 방식으로 낙찰가를 비교하고, 비교 결과, 정확도가 가장 높은 기법을 선정하여 낙찰가를 예측한다. 예를 들어, 각 기법의 MAPE 또는 RMSE를 비교함에 있어서, 서울시를 예를 들면, 서울 전체 지역 예측을 비교하거나(S251), 5대 권역별 예측을 비교하거나(S252), 25개 지역구 예측을 비교한다(S253). 1차 유의성 검증 단계(S260)에서 비교 결과에 대하여 Paired t-test 방식으로 유의성을 검증하고(S261), 리그레 션, ANN, GA 기법에 대한 유의적 모형을 도출한다(S262). 그리고, 군집 분석 및 GA 2차 예측 단계(S270)에서 군집 분석을 실시하되, 감정가격 순으로 그룹화 분석을 실시 한다(S271). 그리고, 군집지역별 GA 2차 예측을 실시한다(S272). 그리고, 2차 유의성 검증 단계(S280)에서 군집지역별 GA 2차 예측 결과에 대해 Paired t-test 방식으로 유의성 을 검증하고(S281), 최종 예측 모형 및 군집지역을 도출한다(S282). 본 발명은 부동산 경매 낙찰가격 예측 모델을 제안하는 것이며, 특히 경매 부동산 개별 물건에 대한 개별 가격 예측 방법을 제안한다. 본 발명에서는 이러한 개별 가격 예측을 위해서는 충분한 데이터를 수집해야 하며, 통계 적 기법 또는 인공지능 기법을 통해서 예측 모형을 효과적으로 구축한다. 또한 연구대상이 되는 지역을 어떻게세분화 할 것인지 등에 대한 요소가 매우 중요하다. 즉, 본 발명에서 데이터 수집, 예측 모형 구성, 지역 세분 화의 세 가지가 핵심 사항으로서, 이러한 내용을 반영한 모델 아키텍쳐(model architecture)를 제안한다. 본 발명의 부동산 경매에서의 낙찰가 예측 모델 구조에서는 데이터 선별 과정, 예측 모형 구축 과정, 군집 분석 과정으로 이루어진다. 첫째, 데이터 선별 과정이다. 본 발명의 일 실시예에서 데이터는 최근 5년동안 서울지역 아파트 경매 부동산 낙 찰 데이터를 대상으로 한다. 이러한 데이터를 부동산 경매정보회사, 은행, 통계청 및 유관기관으로부터 수집한 다. 수집과정에서 가급적 유의적 데이터를 선별하게 되는데, 비유의적 데이터는 실험결과에 도리어 방해요소가 될 가능성이 있다. 유의적 데이터는 부동산 경매 유의적 요인을 분석한 선행연구를 토대로 하며, 모집된 데이터의 형식과 범위가 모두 다르기에 표준화 과정이 필요하다. 즉, 데이터를 모형을 구축하기 위한 Training set과 검증하기 위한 Holdout set으로 분류한다. 그리고, 서울 전체, 5대 권역 구분 및 25개 개별 구에 따라 적용하도록 지역 데이터 를 세분화 한다. 둘째, 예측 모형 구축 과정이다. 데이터 수집 및 정리가 마무리 되면 예측 모형을 구축한다. 본 발명에서 예측 모형은 리그레션(Regression), ANN(Artificial Neural Network), GA(Generic Algorithm) 등 세가지 방법론으로 구축한다. 리그레션(Regression)은 대표적인 통계적 기법이고, ANN과 GA는 인공지능 기법이다. 리그레션(Regression) 예측 모형은 선형 회귀 방정식을 도출하는데 목적이 있다. 리그레션 예측 모델에서 예측 값과 실제값의 오차가 가장 적은 선형 회귀 방정식은 향후 어떠한 개별 부동산 경매가 진행된다 하더라도, 그 방정식에 변수값을 입력하면 예측값이 나오는 과정을 구축한다. ANN 예측 모형은 인간의 뇌와 신경 구조를 모방하여 만든 인공지능 기법을 이용한다. 즉, 다층 퍼셉트론 모델을 사용하여 은닉층, 노드수, 함수 등을 데이터 구조에 효율적으로 맞도록 구성한다. 본 발명의 실험 결과는 향후 진행할 부동산 경매 데이터를 입력할 경우 인공신경망 네트워크 구조에 기인하여 그 값이 도출되도록 한다. GA 예측 모형은 유전자의 변이 과정을 기반으로 한 인공지능 기법이다. GA 예측 모형은 해를 구성하는 염색체를 선택, 교배, 돌연변이 과정의 반복을 통해 가장 적절한 해, 즉 최적화 된 해를 찾는다. 본 발명에서는 예측 모형화 한 통계적 기법인 리그레션(Regression)에 대해 비선형적 접근을 통해 최적화 하는 GA 예측 모형을 구축하며, 리그레션의 회귀방정식 계수를 보다 오차가 적도록 최적화한다. 본 발명에서 리그레션, ANN, GA 예측 모형을 통해 예측 된 값과 실험결과 비교는 MAPE(Mean Absolute Percent Error) 값과 RMSE(Root Mean Square Error) 값을 통해 비교한다. 또한 그 효과가 과연 유의적인지를 paired Test 를 통해 검증하게 된다. 셋째, 지역을 효과적으로 구분하는 군집 분석을 한다. 군집 내 데이터는 유사(homogeneous)하게 분류하고, 군집 간에는 상이(heterogeneous)하게 분류하여 데이터 분석 및 예측할 경우, 좋은 효과가 있다. 본 발명의 일 실시 예에서 기본적으로 서울 전체 지역과 서울시 행정 5 대 권역 그리고 25 개 개별 구를 대상으로 지역을 세분화하 여 분석하여 비교한다. 5 대 권역 대신 보다 효과적인 지역 세분화를 한다면 그 세분화 된 지역에서 예측 모형 의 적용은 보다 효과적일 것이다. 그래서 오차가 줄어 들게 될 것이라는 가정하에 군집분석을 실시하게 된다. 세분화된 지역 구분을 구분하는 기준은 찾아내는 것은 쉽지 않은데, 개별 지역의 특성과 경매의 특성 등을 포괄 적으로 감안된 분류 기준이 필요하다. 여기서, 경매감정가격을 기준으로 분류하는 것은 지역별 가격 및 경매 특 성을 포함한 공통 요소가 될 수 있다. 본 발명에서는 이를 통해 세분화 후 예측 모형을 적용시켜 보고 이에 대 한 paired t-test 를 통해 유의성 검증을 확인하고자 한다. ANN에서 Neural network 인간의 뇌세포를 모방한 구조로서, 이 모델은 어떠한 확률 분포나 변수간 선형관계를 가정하고 있지 않아 전통적인 통계기법들 보다 활용범위가 넓을 수 있다. Neural network은 input과 output의 쌍의 예를 지속적으로 제시하여 원하는 mapping을 만들어가고, 학습이 완료된 neural network는 학습되지 않은 input에 대해서도 올바른 결과를 출력한다. 또한, 새로운 입력에 대해 저장된 패턴과 가장 유사한 output 을 찾 아 내고 무수히 많은 뉴런들로 연결되어 일부 뉴런이 불안정해도 남아있는 뉴런에 의해 작동이 보장된다. Neural network 는 node, layer, link, activation function, training algorithm 등으로 구성되어 있다. ANN의 Architecture에는 다양한 방법이 있으나 그 중에서도 multi-layer perceptron 이 가장 효과적이다. Multi-layer perceptron은 input layer와 output layer 사이에 하나 이상의 hidden layer가 존재하는 neuralnetwork 이다. Input layer에서는 시스템 외부로부터 입력자료를 받아들여 시스템에 전송한다. Hidden layer에 서는 시스템안쪽에 자리잡고 있으며 입력 값을 넘겨받아 그것들을 처리한 뒤 결과를 생성한다. Output layer에 서는 입력 값과 현재 시스템 상태에 기준하여 시스템 값을 산출하는 기능을 한다. 그리고, 입력 값들은 activation function을 거쳐 출력 값을 결정한다. Activation function은 hard limiter, threshold, sigmoid 등의 function이 있다. Hard limiter function은 x <0 이면 y=-1, x=0 이면 -1<y<1, x>0 이면 y=1의 함수로서 -1과 1사이의 값으로 변형 시킨다. Threshold function은 0<x<1 이면 y=x, x>1 이면 y=1 의 함수로서 0과 1사이의 값으로 변형시킨다. Sigmoid function은 γ(x) = 1/(1+exp(-x)) 함수로서 실제 입력 값을 받아 0과 1사이의 값으로 변형 시킨다. 이러한 특징을 갖는 neural network 는 pattern recognition, 비즈니스의 예측, 리스크 관리 등에서 많이 활용 하고 있다. 특히 금융시장에서 기업도산 예측, 주식투자시점 결정, 주가지수 선물거래 응용, 기업공개 시 IPO 가격 결정 등 적용이 확대되고 있다. 이는 기존 통계학적인 방법과 달리 가정과 제한이 없고 적용범위가 넓어 금융 분야에서 많은 주목을 받고 있다. 부동산 분야에서의 neural network 를 통한 연구도 계속 확대되고 있다. 특히, 부동산의 시계열적 가격 및 지수 예측 연구 등에 적용되고 있는데, 이는 부동산 데이터가 neural network 를 통해 연구할 만큼 신뢰성과 정형화 가 많이 업그레이드 되었기 때문이다. 또한 최근 부동산 분야와 금융분야의 융합적 결합으로 산업에서 적용이 많이 되고 있다. GA(Genetic algorithm)은 생물의 진화원리로부터 착안된 알고리즘으로서, 확률적 탐색이나 학습 및 최적화를 위 한 인공지능 적 기법이다. GA는 Darwinism을 기반으로 한 학습 알고리즘으로서, 우열의 법칙과 돌연변이를 이용 하며, Crossover, mutation 을 통해 생성된 개체군들 중 fitness 가 가장 높은 개체들을 다음 세대의 개체군으 로 선정하여 교배와 돌연변이를 반복하는 알고리즘이다. 또한, 이진수의 형태로 표현된 유전자와 적합도들로 이 루어진 개체들의 집합을 이용해서 selection, crossover, mutation 과정을 반복해서 최적화를 수행한다. GA는 앞서 설명한 neural network 와 생물 관련 원리를 적용하여 학습과 적응에 관한 모델이라는 점에서 공통점 을 갖는다. 그러나 neural network 는 한 개체의 학습을 다루어 국소적 탐색을 하는데 비해, Genetic algorithm 은 종의 적응을 다루어 전역 샘플링을 하는 것에 차이가 있다. GA(Genetic algorithm)은 주어진 문제의 해를 이진수의 자료 구조로 나타내며, 이를 chromosome이라 하며 chromosome의 집합체를 population 이라 한다. 이를 대상으로 selection, crossover, mutation 등 세가지 종류 의 genetic operation 을 사용하여 목적함수의 최적화를 찾아간다. 해의 최적화를 위해서 Fitness function 을 사용하여 탐색을 수행한다. 최적화를 위해서는 최대값 또는 최소값 을 구하는 방식으로 fitness function 이 결정된다. 이 fitness function 의 구성은 최적의 해를 찾는데 매우 중요한 요소이다. Selection 은 자연계의 적자생존 원리로 자손 세대의 구성을 결정할 때 문제에 더욱 적합한 값을 가지는 부모들 의 속성을 갖도록 선택한다. Natural selection 현상을 모델링 하여 잘 적응한 해들은 살아남고, 잘 적응하지 못한 해들은 도태되도록 유도 한다. Proportionate selection, elitist preserving section, expected-value selection, ranking selection, tournament selection 등의 방법이 사용된다. Crossover는 두 개체 사이의 염색체 교환을 통해 새로운 개체를 생성하는 방법이다. 양쪽 부모의 우수한 부분 형질을 적절히 조합하여 자식에게 전승시키는 것에 성공하면서 발전된다. Mutation은 전혀 새로운 자손의 출생에 의해 새로운 방향으로 접근하는 방법이다. 염색체 상 어떤 유전자 위치 의 값을 다른 대립 유전자와 바꾸어 놓은 것으로 개체 근처에 새로운 개체를 생성한다. 단, 치사 유전자를 만들 어낼 위험을 내포한다. 본 발명에서 부동산 경매에서 개별 낙찰가를 예측하는 시스템 및 방법을 제안한다. 따라서 그 부동산 가격에 영 향을 주는 변수와 데이터가 충분하여 어느 정도의 변동성을 극복해야 할 필요성이 있다. 따라서, 본 발명에서는 부동산 경매 가격에 영향을 주는 요인을 크게 세가지로 구분한다. 경매 특성에 관한 변 수, 부동산 물리적 특성에 관한 변수, 거시 경제에 관한 변수 등이 그것이다. 이러한 변수는 경매 진행에 프로 세스, 부동산 개별 요소 및 경제 및 정책적 요소 등이 포함된다. 즉 한 건의 부동산 경매 가격 예측하기 위한내부적, 외부적 요소를 종합해서 고려했다고 할 수 있다. 첫째, 경매 특성에 관한 변수이다. 경매 감정가격, 평균 낙찰가율, 평균 응찰자수, 유찰 횟수, 조회수, 경매소 요기간, 경매 지수 등 이 경매 특성에 관한 요인이다. 부동산 경매는 대한민국에 법률에 근거한 유일한 제도이 다. 이 제도적 특성이 가격에 영향을 미치는 요소는 적지 않다. 그 과정에서 나타나는 경매 특성 데이터는 가격 예측에 중요한 의미를 부여한다. 둘째, 각 부동산 개별 물리적 특성에 관한 변수이다. 아파트 전용면적, 대지면적, 대지지분, 관리비 체납 유뮤, 임차인 유무, 유치권 유무, 선순위 전세권 유무, 법정지상권 유무, 지분경매 유무, 인수권리(대항력) 유무, 특 수권리 유무, 학교거리, 버스정류장 유무, 지하철역 거리 등이다. 부동산은 개별적 특성이 강하다. 그 부동산에 물리적, 법적, 경제적 가치에 따라 인근 비슷한 부동산이라도 가격 차이가 발생하게 된다. 따라서 이러한 개별 적 변수 들은 부동산 가격 결정의 핵심 요소이다. 셋째, 거시 경제 지표에 관한 변수 이다. 소비자 물가지수, 어음부도율, 대출금리(이자율), 경기선행지수, 종합 주가지수(건설업분야), 부동산시장 소비심리지수, 아파트 매매지수, 아파트 전세지수, 아파트 매매거래동향 지 수 등이다. 부동산은 거시 경제상황과 정책 등에 민감하다. 개별 부동산의 물리적 변화가 크지 않더라도 외부 환경 변화에 따라 가격이 크게 변화는 것을 볼 수 있다. 본 발명의 실험에서는 위 세가지 특징에 관한 총 33 개의 변수를 입력변수로 선정하고 경매 낙찰가격을 종속변 수로 정한다. 데이터는 수는 총 9,435 건이다. 경매 데이터 수집 범위는 2013.1.1. ~ 2017.12.31. 5 년 동안의 서울 지역 아파트 경매 전체 물건을 대상으로 한다. 본 발명의 실험에서는 가격 예측 모형을 분석함을 그 목적으로 하기에 우선 서울 지역의 아파트를 대상으로 한 다. 서울 지역의 아파트는 타 지역 다른 부동산에 비하여 정형화 되어 있어 분석의 목적에 부합한다. 또한, 본 데이터는 부동산 경매정보사인 지지옥션, 인포케어옥션을 비롯하여 한국은행, 국민은행, 통계청, 증권거래소 등 에서 데이터를 수집하였다. 도 4는 본 발명의 일 실시예에 따른 부동산 경매에서의 변수 및 데이터 선정 개요를 정리한 도표이다. 본 발명의 실험에서 데이터 분석 및 예측이 효율적이기 위해서는 각 개별 데이터가 유의적인 변수이여야 한다. 연구 목적에 부합하지 않는 비유의적 데이터는 연구값에 방해를 주기도 한다. 따라서 각 변수가 유의적인지에 대한 확인이 필요하다. 본 발명의 실험에서는 유의적인 변수를 선정하기 위해서 타 연구에서 유의적으로 이미 확인된 변수를 대부분 선 정하여 사용하였다. 경매 낙찰가격에 영향을 미치는 기존 선행연구가 충분히 많은데, 그 연구에서 경매 낙찰가 경에 영향을 미치는 유의적인 변수를 우선적으로 선택하였다. 예를 들어, 정가연.유선종, 2010, ＂부동산 경매시장의 아파트 낙찰가격 결정요인에 관한 연구＂에서 낙찰가격, 감정가격 등이 유의적이라 하였고, 이진순.이기동, 2010, ＂e-경매를 위한 온라인 시장정보의 가격 결정력에 대 한 연구＂에서 대항력, 종합주가 지수 등이 유의적이라 하였다. 그리고, 최열.임하결.성해영, 2011, ＂부동산 종류에 따른 낙찰가격 결정요인 분석＂에서 평균응찰자수, 유찰 횟수 등이 유의적이라 하였고, 김성숙.김종진, 2015, ＂서울 아파트 경매시장에 영향을 미치는 거시적 경제요인 에 관한 연구＂에서 이자율, 부동산 소비심리지수 등이 유의적이라 하였고, 김대건, 2015, ＂아파트경매 낙찰 가율에 영향을 미치는 시장요인 연구＂에서 아파트 매매지수, 아파트 전세지수 등이 유의적이라 하였고, 배수헌.정동준, 2015, \"아파트 경매 낙찰가격 결정 요인에 관한 연구_부산,울산\" 에서 버스정류장, 지하철거리 등이 유의적이라 하였다. 도 5는 본 발명의 일 실시예에 따른 부동산 경매에서의 유의적 변수 선정에 대해 정리한 도표이다. 종속변수인 낙찰가격에 영향을 주는 선행연구를 통해 검증된 입력변수는 다음과 같다. 감정가격, 평균 매각가율, 평균 응찰자수, 유찰횟수, 전용면적, 대지면적, 관리비체납 유무, 임차인 유무, 대항력 유무, 특수권 리 유무, 학교거리, 버스정류장 유무, 지하철역 거리, 소비자 물가지수, 대출금리, 경기선행 지수, 종합주가지 수(건설업분야), 부동산 시장 소비심리지수, 아파트 매매지수, 아파트 전세지수, 아파트 매매거래 동향 등이다. 이러한 변수는 각 선행 연구에서와 같이 p-value 가 0.100 이하의 값으로 연구된 변수이다. 또한 선행연구에 포함되지 않았으나 보다 정확한 연구를 위해 조회수, 경매소요기간, 경매지수, 대지지분, 유치 권 유무, 선순위전세권 유무, 법정지상권 유무, 지분경매 유무, 어음 부도율, 아파트 전세거래동향, 아파트 매수우위지수, 아파트 전세수급지수 등을 추가적으로 입력변수에 포함하였다. 도 6은 본 발명의 일 실시예에서 선행 연구에 따른 유의적 변수 선별을 정리한 도표이다. 본 발명의 실험에서 변수의 유의성을 확인하여 수집된 데이터의 형태와 범위는 다양하다. 명목형, 연속형 등의 형태가 있는가 하면 각 데이터의 scale 또한 다양하다. 이러한 데이터의 형태를 실험하기 위한 표준화 절차가 필요하다. 표준화는 각 데이터를 0 에서 1 사이 값으로 조정하는 절차이다. 표준화하는 방법은 아래와 같다. 표준화값 = (현재값 - 최소값) ÷ (최대값 - 최소값) 이러한 표준화 절차를 통한 데이터 값은 모두 0 에서 1 사이 값으로 조정되어 분석 및 예측하는데 유용한 범위 로 조정 된다. 향후 예측값을 도출하기 위해서는 표준화 한 데이터를 역으로 환원하여 예측값을 구해야 한다. 예측값은 아래와 같은 방법으로 역산 된다. 예측값 = 예측비율 x (최대값 - 최소값) + 최소값 이 예측비율은 예측 모형에서 개별 부동산이 감정평가금액 대비 비율이며 이 비율을 역산한 값이 예측 값이 된 다. 그리고, 데이터 표준화 이후 실험을 위한 분할을 한다. 전체 데이터 중 약 70%를 Training set 으로 설정하고, 나머지 30%를 holdout set 으로 설정한다. 이때, 기간, 지역, 개별 부동산에 따른 영향을 최소화 하기 위해 데 이터를 랜덤(random) 하게 구분하는 것이 필요하다. 랜덤하게 구분하기 위해서 엑셀의 RAND() 함수를 사용하였 다. 또한, 본 발명에서는 선행연구에 포함되지 않았으나 보다 정확한 연구를 위해 조회수, 경매소요기간, 경매지수, 대지지분, 유치권 유무, 선순위전세권 유무, 법정지상권 유무, 지분경매 유무, 어음 부도율, 아파트 전세거래동 향, 아파트 매수우위지수, 아파트 전세수급지수 등을 추가적으로 입력변수에 포함하였다. 위 선행연구로 유의성 검증이 안된 12개의 변수에 대해서는 종속변수와 상관관계 분석을 실시했다. 그 결과로 각 변수가 유의적인지를 살펴 보고자 한다. 그 결과 모두 p-value가 0.05 이하의 값으로 유의적 변수로 확인되 었다. 그 유의수준은 아래 도 7의 도표와 같다. 도 7은 본 발명의 일 실시예에 따른 입력변수에 대해 종속변수 와의 상관관계 분석 결과인 유의수준을 정리한 도표이다. 도 8은 본 발명의 일 실시예에 따른 부동산 경매에서의 데이터 분할을 나타낸 도표이다. 도 8을 참조하면, 데이터 분할 결과 training set 에는 전체 데이터의 69.7%에 해당하는 6,568 건의 데이터가 분류되었으며, holdout set 에는 전체 데이터의 30.3%에 해당하는 2,867 건의 데이터가 분류 되었다. 이러한 분 류는 지역별, 기간별로 training set 과 holdout set 의 비율이 거의 70:30 비율이 유지되어 실험을 위한 유의 적인 분류가 되었음을 확인하였다. 구분된 training set 데이터로는 예측 모형의 모델링을 시도하게 되며, training set 으로 모형을 검증하기 위 해 holdout set 의 데이터로 검증하게 된다. 결과적으로 holdout set 의 값을 가지고 모형의 유의성을 논하게 된다. 도 9은 본 발명의 일 실시예에 따른 부동산 경매에서의 리그레션 예측을 실행하기 위한 화면예이다. 도 9을 참조하면, 본 발명에서는 리그레션(Regression)을 이용하여 부동산 경매 낙찰가 예측 모형을 설계한다. 회귀분석은 데이터 분포에 따른 선형 방정식을 구성함, 선형 방정식의 각 변수의 계수값이 예측 모형에 대한 가 중치를 의미한다. 종속변수와 입력변수를 입력하고 변수 입력방식을 선택하면 회귀 방정식이 도출된다. 그 모형화된 선형 방정식에 예측하고자 하는 각 변수의 값을 입력하게 되면 예측값을 추정할 수 있게 된다. 선 형 방정식은 아래와 같은 식으로 표현된다.[수학식 1]"}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "회귀분석의 선형 방정식에 종속 변수는 경매낙찰금액이 된다. 전술한 33 개의 독립변수를 입력변수로 정한다. 독립변수를 입력하는 방법은 Enter, Stepwise, Remove, Backward Elimination 등의 방식이 있다. 본 발명의 실 험에서는 모든 변수가 단일 단계에 입력되는 변수 선택 프로시저인 Enter 방식을 사용한다. 그리고, 회귀분석 통계 프로그램인 SPSS 23을 이용하여 분석하였다. 도 10는 본 발명의 일 실시예에 따른 부동산 경매에서의 리그 레션 예측 결과를 나타낸 도표이다. 도 11은 본 발명의 일 실시예에 따른 부동산 경매에서의 ANN 예측을 실행하기 위한 화면예이다. 도 11을 참조하면, 본 발명에서 ANN을 활용하여 경매 낙찰가 예측 모형을 설계한다. 인공신경망 분석은 은닉층 이 2 개로 된 다층 퍼셉트론(MLP) 모델을 사용한다. 본 인공신경망 분석은 SPSS 23을 이용하여 분석했다. 인공 신경망은 셋팅된 다층 퍼셉트론 설계를 통해 예측값을 도출할 수 있다. 우선 경매낙찰가격을 종속변수로 입력하고 나머지 33 개의 입력변수를 공변량에 입력한다. 공변량 조정은 표준 화를 설정하며, 값의 정확도 향상을 위해 은닉층 수는 2 개로 설정한다. 이때 은닉층과 출력층의 활성화 함수는 항상 0 이상의 양수값을 나타내는 시그모이드 함수를 선택한다. 쌍곡 탄젠트 등의 활성화 함수는 때로 음의 값 을 갖기에 가격 예측 결과와는 차이가 있는 함수이다. 노드수는 60 개로 설정한다. 총 33 개의 입력변수에 대한 약 2 배에 해당하는 값이다. 도 12은 본 발명의 일 실시예에 따른 인공신경망 네트워크 구조를 도시한 것이다. 도 13는 본 발명의 일 실시예에 따른 GA-리그레션 예측을 실행하기 위한 화면예이다. 도 13를 참조하면, 본 발명에서 GA를 활용하여 경매 낙찰가 예측 모형을 설계한다. 유전자 알고리즘(GA)은 무한 탐색공간에서 최적의 값을 찾아내는 우수한 기능을 갖고 있다. 즉, 염색체의 선택, 교배, 돌연변이 과정이 되풀이 하며 목적함수의 최적화된 값을 찾는다. 최적화 대상은 회귀방정식 최적화를 목적으로 한다. 회귀방정식의 회귀방정식 계수를 보다 적합하게 찾는다면 예측의 정확도를 높일 수 있다는 가정하에 유전자 알고리즘을 구성한다. 목적함수는 예측값과 실제값의 차이를 판별하는 MAPE 자체를 목적함수로 한다. 최적화 방식은 이 목적함수를 최소화하는 방식이다. 즉 실제값과 예측 값의 차이를 최소화 시킬 수 있는 모델을 구성한다. 해법은 GRG 비선형 방식을 선택한다. 이를 위한 프로그램은 Evolver7.5 및 Solver 를 사용하였다. [수학식 2]"}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이 방식은 선형화에 국한된 회귀방정식을 비선형적 기법을 도입하여 최적화하는 아이디어 이다. 선형방정식에 비선형적인 방식으로 그 계수의 적합도를 높여 최종 예측값의 에러를 최소화한다. 이제, 전술한 방식으로 실험을 진행한 결과를 설명하면 다음과 같다. 먼저, 서울 전체 지역의 예측 모형을 비교한 결과이다. 도 14은 본 발명의 일 실시예에 따른 서울 전체 지역의 예측 모형을 비교한 도표이다. 도 14을 참조하면, 서울 전체 지역에 대한 경매 낙찰가 예측 결과는 MAPE 는 GA 8.86, ANN 23.86, Regression 18.66을 보였으며, RMSE 는 GA .0060, ANN .0067, Regression .0061을 기록하였다. 즉, GA 예측 모형이 ANN 및 Regression 모형에 비해 MAPE, RMSE 가 가장 낮아 예측 정확도가 높은 모형으로 확인되었다. 특히 각 실험 결과의 MAPE 값을 볼 때 GA 의 MAPE 값이 ANN 및 Regression 의 MAPE 값에 비해 약 47~63% 가량 낮게 나왔다. 이에 대한 유의성 검증은 향후 Paired t-Test 를 통해 유의성을 확인 할 것이다. 그러나 이정도 수치의 향상은 눈에 띄는 예측 모형의 개선 효과가 있다고 보여진다. 본 발명의 실험에서 GA 의 MAPE 값이 타 모형에 비하여 우수한 결과를 나타냈으나 과연 실제 데이터와 어느정도 근접하게 예측되었는지 알아 볼 필요가 있다. 이를 위해서 실제 경매낙찰가와 GA 예측 모형에 대한 각 년도별 평균 낙찰가율을 비교해 보면 다음과 같다. 여 기서, 평균 낙찰가율은 감정가격 대비 낙찰된 금액의 비율이다. [수학식 3]"}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 4, "content": "도 15는 본 발명의 일 실시예에 따른 서울 전체 지역의 연도별 낙찰가율을 예측을 비교한 그래프이다. 도 15를 참조하면, 실제로 2013 년 83%, 2014 년 88%, 2015 년 93%, 2016 년 94%, 2017 년 98%의 평균 낙찰가 율을 보여왔다. GA 예측 모형으로 평균낙찰가율을 산정할 경우 2013 년 82%, 2014 년 87%, 2015 년 93%, 2016 년 93%, 2017 년 97%를 보여 그 차이가 적은 것을 볼 수 있다. 서울 지역 연도별 평균 낙찰가율 비교 시 실제 낙찰가율과 GA 예측을 통한 낙찰가율이 거의 같은 추세를 형성한다. 물론 이에 대한 유의성은 향후 Paired t- Test 통하여 유의성 검증을 시도 할 것이다. 다음, 서울 5대 권역별 예측 모형을 비교한다. 예측의 정확도를 향상하기 위하여 지역을 몇 개의 그룹으로 세분 화 하고 각 그룹 내에서 예측을 시도해 본다. 이론적으로 그룹 내의 데이터는 homogeneous 하고, 그룹 간에는 heterogeneous 하게 분류한다면 그룹내 예측은 향상된다. 서울시는 2020 서울도시기본계획에서 서울을 5개 생활권으로 구분하였다. 행정과 생활권을 기반으로 도심권, 동 남권, 동북권, 서남권, 서북권 등 5개 권으로 구분했다. 이를 기반으로 각 권에 대하여 구분하여 권역별 예측을 시도한다. 각 권역의 데이터 수는 training set을 기준으로 도심권 342개, 동남권 1,491개, 동북권 2,156개, 서 남권 1,942개, 서북권 637개이다. Holdout set을 기준으로 도심권 133개, 동남권 652개, 동북권 957개, 서남권 829개, 서북권 296개이다. 예측함에 있어 충분한 정도의 데이터가 형성되어 예측의 유의성을 기대할 수 있을 것 이다. 도 16는 본 발명의 일 실시예에 따른 서울 5대 권역별 예측 모형을 비교한 도면이고, 도 17은 본 발명의 일 실 시예에 따른 서울 5대 권역별 MAPE를 비교한 도면이다. 도 16 및 도 17을 참조하면, 5 대 권역별 예측 결과, 서울 5 대 권역 모두 GA 의 MAPE 및 RMSE 값이 가장 낮았 다. 권역별 GA 예측 모형의 MAPE 는 도심권 8.27, 동남권 9.74, 동북권 7.41, 서남권 7.95, 서북권 8.20을 나 타냈다. 평균 GA 모형의 MAPE 는 약 8.3 정도를 나타낸다. 이는 평균 ANN 의 MAPE 15.6, Regression 의 평균 MAPE 15.8 과 비교 해 볼 때 약 47% 향상된 모형이다. 또한 RMSE 역시 모든 권역에서 GA 모형이 ANN 및 Regression 모형에 비해 가장 낮다. 평균 GA 모형의 RMSE 는 0.0047, ANN 의 RMSE 는 0.0059, Regression 0.0076을 보인다. 결과적으로 5 대 권역으로 나눈 예측 모형 실험 에서도 GA 모형이 가장 예측력이 MAPE 및 RMSE 값으로 비교할 때 가장 우수하다고 할 수 있다. 도 18은 본 발명의 일 실시예에 따른 서울 25개 구별 MAPE를 비교한 도면이다. 도 18을 참조하면, 본 발명의 실험에서 서울 전체, 5 대 권역 구분에 이어 25 개 개별 구에 대한 예측 모형 실 험을 시도하였다. 25 개 각 구로 나누었을 때 training set 의 경우, 데이터가 최소 55, 최대 668 개, holdout set 의 경우 데이터가 최소 18, 최대 304 개 이다. 예측을 하기에 적정한 데이터의 수로 볼 때 25 개 각 구로 나누어 구분하는 것이 지역 구분의 최소 구분으로 보인다. 보다 더 세분화 하여 동 단위까지 나눈다면 데이터 수가 너무 적어 예측의 유의적 의미가 없어진다. 25 개 구 단위로 예측 실험 결과, 모든 구에서 GA 의 MAPE 값이 ANN 및 Regression 의 MAPE 값에 비해 낮다. 즉 GA 모형의 예측력이 25 개구로 나누어 예측을 해도 우수함을 볼 수 있다. 한편 RMSE 값은 전체 25 개 구 중 17 개 구에서 가장 낮음을 볼 수 있다. 이는 서울 전체 및 5 개 권역 구분하여 예측한 것에 비해 일부 지역은 데이터 수가 현저히 적어 오차가 발생할 수도 있다. 도 19 내지 도 21은 본 발명의 일 실시예에 따른 서울 25개 구별 예측 방식을 비교한 도표이다. 도 19 내지 도 21에서 25 개 각 구별 예측 실험의 결과를 나타내고 있다. 이를 종합하면 GA 평균 MAPE 는 8.4, ANN 평균 MAPE 는 14.6, Regression 의 평균 MAPE 는 12.5 를 나타낸다. 즉 25 개 구별 예측에 있어서도 GA 예 측 모형이 우수함을 알 수 있다. 25 개 각 구별 예측 실험의 결과를 지도로 표시해 보면 그 분포에 특이성이 있다. GA 의 MAPE 값을 볼 때 예측 력이 상대적으로 우수하다고 보여지는 MAPE 값 5.99 이하 지역, MAPE 값 6.0 이상 9.9 이하의 지역, MAPE 값 10.0 이상의 지역으로 구분 해 볼 때 table 7.5.3.2. 와 같다. 그 결과 예측력이 상대적으로 높고 낮은 지역이 동질성이 없다. 즉, 바로 옆에 있는 지역도 어떤 지역은 예측력 이 상대적으로 높게 나타나고 어떤 지역은 상대적으로 낮게 나타난다. 예를 들어, 성동구는 예측력 높은 반면, 인근의 동대문구는 예측력이 상대적으로 좋지 않은 지역이고, 그 사이의 중구는 예측력이 보통으로 나타난다. 이는 서울 각 구는 구별로 개별적 특성이 강하여 바로 인근지역이라 하더라도 그 영향을 미치기 보다는 그 구 내에서의 영향력이 더 크다고 할 수 있다. 본 발명에서 부동산 경매 서울 아파트 낙찰가격 예측에 대한 결과를 종합해 보면, 평균 MAPE 값을 비교 해 볼 때 GA 예측 모형이 가장 예측력이 우수한 것으로 나타난다. GA 는 평균 MPAE 8.3~8.8을 보였다. GA 모형이 ANN 및 Regression 에 비해 유의적인지는 paired t-Test 를 통해 검증 할 것이다. 주목할 것은 GA 예측 모형은 지역 을 세분화 하여도 개선 정도가 거의 차이가 없이 MAPE 8.3~8.4 의 값을 보인다는 것이다. 본 발명에서는 이를 극복하기 위해 군집분석을 하여 유의적 분류를 하고 예측력을 높이는 시도를 한다. 앞서 GA 의 예측 모형이 ANN 및 Regression 모형에 비해 우수하다고 하였는데, 이는 MAPE 값이 상대적으로 낮기 때문이다. 그러나 단순히 MAPE 값이 낮다고 유의적이라 할 수는 없으며, 상대적으로 비교하여 충분히 차이가 날 만큼 개선효과가 있는가를 검증해야 한다. 이와 같이 두 모집단의 짝을 이룬 값들의 차이에 대한 검증은 paired t-test 를 사용한다. 도 22은 본 발명의 일 실시예에 따른 유의성 검증을 실행하기 위한 화면예이다. 서울 전체 지역을 대상으로 한 GA 예측 모형 대비 ANN 및 Regression 모형의 Paired t-test 결과 p-value 가 .000 이다. 즉, 서울 전체의 GA 예측 모형은 ANN 과 Regression 모형에 비해 더 우수한 예측 모형이라 할 수 있 다. 도 23는 본 발명의 일 실시예에 따른 서울 5대 권역별 유의성 검증을 나타낸 도표이다. 도 23에서 서울 5 대 권역을 구분한 GA 예측 모형 대비 ANN 및 Regression 모형의 Paired t-test 결과 서북권 을 제외하고 p-value 가 모두 유의적으로 나타났다. 즉, 서울 5 대 권역의 GA 예측 모형은 ANN 과 Regression 모형에 비해 대부분의 지역에서 더 우수한 예측 모형이라 할 수 있다. 단, 서북권의 경우 GA 모형의 MAPE 값이 가장 낮은 반면 비유의적으로 나온 점을 감안 해 볼 때 권역별 구분을 보다 효과적으로 한다면 예측 모형이 우 수하게 적용될 수 있을 것으로 기대된다. 도 24은 본 발명의 일 실시예에 따른 서울 25개 각 구별 유의성 검증을 나타낸 도표이다. 도 24에서 25 개 개별 구에 대한 GA 예측 모형 대비 ANN 및 Regression 모형의 Paired t-test 결과 25 개 개별 구 중 16 개 구에서 GA 모형이 타 모형에 비해 개선 효과가 유의적임을 보여주고 있다. GA 모형의 MAPE 값이 모 든 구에서 가장 낮으나 paired t-test 결과 9 개 지역이 비유의적으로 나온 것은 각 구에 대한 표본이 충분하지 않은 것이 그 원인이라 보여진다. Paired t-test 결과 25 개 구로 세분화하여 예측을 시도하는 것 보다 서울 전체 지역에서 GA 예측 모형이 타 모 형에 비해 유의적으로 보였다. 즉, 서울 전체를 대상으로 한 GA 예측 모형은 타 모형에 비해 예측력이 탁월하게 우수하다고 할 수 있다. 주목할 점은 지역을 세분화 할수록 예측력이 우수하고 유의적으로 나타나는 것이 일반 적인 현상이다. 그러나 본 발명의 실험에서는 지역을 세분화할 때 보다는 서울 전체지역에서 예측 모형의 우수 함이 유의적으로 입증된 것을 볼 때, 5 대 권역에서 지역세분화의 기준을 바꿔 볼 때 더욱 개선 효과가 있을 것으로 기대된다. 지금까지 예측 모형 실험 결과 ANN, Regression MAPE 평균값은 지역을 상세 구분하여 실험 할 수록 정확도가 높 아진다. 서울, 5 개권역 25 개 각 구별 MAPE 값은 ANN 의 경우 23,8, 15.7, 14,6 이며, Regression 의 경우 18.6, 15.8, 12.5 이다. 그러나 GA 예측 모형의 경우 8.8, 8.3, 8.4 로 거의 변화가 없이 일정하다. 이것은 GA예측 모형이 매우 안정적인 모형이라고 할 수 있다. 그러나 이론적으로 군집 내 데이터는 유사(homogeneous)하 게, 군집 간에는 상이(heterogeneous)하게 분류하여 예측을 시도 할 때 보다 정확도가 향상된다. 즉, GA 예측 모형은 안정적이나 지역을 보다 효율적으로 세분화 한다면 그 예측정확도는 향상 될 수 있을 것이다. 이러한 가 정을 토대로, 본 발명의 실험에서는 서울시 행정기준상 5 대 권역 구분 대신 보다 효과적인 그룹을 찾아내어 예 측 모형의 정확도를 높이고자 한다. 우선 효과적인 그룹핑(Grouping)을 위해 경매 감정가격별, 매매가격 상승별, 낙찰가격별 등 다양한 기준에 근거 하여 그룹핑을 시도 해 보았다. 그 결과 경매 감정가격별 그룹핑은 예측 정확도가 상승하였다. 그러나 다른 방 법에 의한 지역 분류는 그 결과를 볼 때 개선효과가 없었다. 각 구별 경매 감정가격의 평균으로 내림차순은 강남구, 서초구, 용산구, 송파구, 광진구, 종로구, 중구, 영등포 구, 양천구, 마포구, 성동구, 동작구, 강동구, 관악구, 동대문구, 강서구, 성북구, 서대문구, 은평구, 구로구, 중랑구, 강북구, 노원구, 금천구, 도봉구 순서이다. 이를 3~6 개 정도로 그룹핑하여 예측을 시도한다. 그 결과 를 토대로, 서울시 5 개 권역별 행정구역 대비 유의수준 5% paired t-test 로 검증한다. 도 25는 본 발명의 일 실시예에 따른 MAPE 평균값을 비교한 도표이고, 도 26는 본 발명의 일 실시예에 따른 k- 평균 군집분석을 실행하기 위한 화면예이고, 도 27은 본 발명의 일 실시예에 따른 군집분석의 개요를 정리한 도 표이고, 도 28은 본 발명의 일 실시예에 따른 군집분석 후 2차 GA 예측 결과를 나타낸 도표이고, 도 29은 본 발 명의 일 실시예에 따른 서울 지역의 군집분석에 대해 6대 권역별로 구분한 도면이다. 도 25 내지 도 29을 참조하면, 경매 감정가격 상관관계가 높은 구(區)별로 군집(grouping)하여 예측한 결과 4, 5, 6개 권역으로 분류 시 GA MAPE가 낮아지는 예측력 상승을 보였다. 이에 대한 기존 서울 5대 권역 대비 paired t-Test결과 모두 유의적으로 나타났으며, 이전까지 GA 예측 모형이 우수함을 확인하였다. 그리고, 예측 의 정확도를 높이고자 효과적 지역분류를 실시 한 결과 예측력이 보다 향상했다는 결과를 도출하게 되었다. 경 매 감정가격 순으로 4권역으로 분류 시 GA의 평균 MAPE는 7.94, 5권역으로 분류시 8.16, 6권역으로 분류시 7.83 이 나왔다. 이는 기존의 서울시 5대 권역별 GA 평균 MAPE 8.3에 비해 낮은 수치이며, 서울 전체 및 25개 각 구 별 GA 평균 MAPE에 비해서도 가장 낮은 수치이다. 이에 대한 유의성을 검증하고자 기존 서울 5대 권역 대비 유 의성을 paired t-test 로 검증한다. 그 결과 p-value가 모두 0.05 이하의 값을 나타내 유의적인 것으로 확인 되 었다. 도 30는 본 발명의 일 실시예에 따른 군집분석 후 2차 GA 예측 상세 결과를 나타낸 도표이고, 도 31은 본 발명 의 일 실시예에 따른 실험에서 결과를 종합하여 정리한 도표이다. 도 30 및 도 31을 참조하면, 본 발명의 실험에서 서울 아파트 경매 낙찰가 예측 모형에 대한 각 모형의 MAPE, RMSE 값 비교 및 Paired t-Test 결과를 종합해 보면 다음과 같다. ① GA 모형이 모든 영역에서 가장 낮은 MAPE 값을 기록하고, RMSE도 대부분 낮아 가장 우수한 예측 모형임을 확 인하였다. ② Paired t-Test를 통해 ANN 및 Regression 모형 대비 GA 모형의 개선 효과가 유의적이라고 입증하였다. ③ 그룹 내에는 유사하게, 그룹 간 상이하게 분류하여 예측할 경우 정확도가 더욱 우수함을 확인 하였다. 결론적으로 부동산 경매 예측은 GA-Linear Regression Model이 유용하며, 이는 ANN 및 Regression Model에 비 해 우수하며, 분석 지역을 효과적으로 그룹핑할 경우 예측 정확도가 향상된다는 것을 확인하였다. 이상 본 발명을 몇 가지 바람직한 실시예를 사용하여 설명하였으나, 이들 실시예는 예시적인 것이며 한정적인"}
{"patent_id": "10-2018-0078754", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "것이 아니다. 본 발명이 속하는 기술분야에서 통상의 지식을 지닌 자라면 본 발명의 사상과 첨부된 특허청구범 위에 제시된 권리범위에서 벗어나지 않으면서 다양한 변화와 수정을 가할 수 있음을 이해할 것이다."}
{"patent_id": "10-2018-0078754", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 부동산 경매에서의 낙찰가 예측 시스템을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 부동산 경매에서의 낙찰가 예측 방법을 도시한 흐름도이다. 도 3은 본 발명의 일 실시예에 따른 부동산 경매에서의 낙찰가 예측 모델 구조를 예시한 도면이다. 도 4는 본 발명의 일 실시예에 따른 부동산 경매에서의 변수 및 데이터 선정 개요를 정리한 도표이다. 도 5는 본 발명의 일 실시예에 따른 부동산 경매에서의 유의적 변수 선정에 대해 정리한 도표이다. 도 6은 본 발명의 일 실시예에서 선행 연구에 따른 유의적 변수 선별을 정리한 도표이다. 도 7은 본 발명의 일 실시예에 따른 입력변수에 대해 종속변수와의 상관관계 분석 결과인 유의수준을 정리한 도 표이다. 도 8은 본 발명의 일 실시예에 따른 부동산 경매에서의 데이터 분할을 나타낸 도표이다. 도 9은 본 발명의 일 실시예에 따른 부동산 경매에서의 리그레션 예측을 실행하기 위한 화면예이다. 도 10는 본 발명의 일 실시예에 따른 부동산 경매에서의 리그레션 예측 결과를 나타낸 도표이다. 도 11은 본 발명의 일 실시예에 따른 부동산 경매에서의 ANN 예측을 실행하기 위한 화면예이다. 도 12은 본 발명의 일 실시예에 따른 인공신경망 네트워크 구조를 도시한 것이다. 도 13는 본 발명의 일 실시예에 따른 GA-리그레션 예측을 실행하기 위한 화면예이다. 도 14은 본 발명의 일 실시예에 따른 서울 전체 지역의 예측 모형을 비교한 도표이다. 도 15는 본 발명의 일 실시예에 따른 서울 전체 지역의 연도별 낙찰가율을 예측을 비교한 그래프이다. 도 16는 본 발명의 일 실시예에 따른 서울 5대 권역별 예측 모형을 비교한 도면이다. 도 17은 본 발명의 일 실시예에 따른 서울 5대 권역별 MAPE를 비교한 도면이다. 도 18은 본 발명의 일 실시예에 따른 서울 25개 구별 MAPE를 비교한 도면이다. 도 19 내지 도 21은 본 발명의 일 실시예에 따른 서울 25개 구별 예측 방식을 비교한 도표이다. 도 22은 본 발명의 일 실시예에 따른 유의성 검증을 실행하기 위한 화면예이다. 도 23는 본 발명의 일 실시예에 따른 서울 5대 권역별 유의성 검증을 나타낸 도표이다. 도 24은 본 발명의 일 실시예에 따른 서울 25개 각 구별 유의성 검증을 나타낸 도표이다. 도 25는 본 발명의 일 실시예에 따른 MAPE 평균값을 비교한 도표이다. 도 26는 본 발명의 일 실시예에 따른 k-평균 군집분석을 실행하기 위한 화면예이다. 도 27은 본 발명의 일 실시예에 따른 군집분석의 개요를 정리한 도표이다. 도 28은 본 발명의 일 실시예에 따른 군집분석 후 2차 GA 예측 결과를 나타낸 도표이다. 도 29은 본 발명의 일 실시예에 따른 서울 지역의 군집분석에 대해 6대 권역별로 구분한 도면이다. 도 30는 본 발명의 일 실시예에 따른 군집분석 후 2차 GA 예측 상세 결과를 나타낸 도표이다. 도 31은 본 발명의 일 실시예에 따른 실험에서 결과를 종합하여 정리한 도표이다."}
