{"patent_id": "10-2022-0029324", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0080274", "출원번호": "10-2022-0029324", "발명의 명칭": "안테나 및 안테나를 포함하는 전자 장치", "출원인": "삼성전자주식회사", "발명자": "김용연"}}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,제1 하우징;상기 제1 하우징에 대한 상대 위치가 가변되도록 상기 제1 하우징에 연결되는 제2 하우징;차폐 부재, 상기 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 수신 코일을 포함하고, 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 무선 충전 안테나; 및상기 무선 충전 안테나와 전기적으로 연결되는 배터리(battery);를 포함하는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 무선 충전 안테나의 수신 코일은,상기 차폐 부재의 제1 면과 상기 차폐 부재의 제2 면이 실질적으로 대응되는 패턴을 가지도록 감기는 전자장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 무선 충전 안테나는,상기 수신 코일의 권선 중심이 상기 전자 장치의 중심과 인접하도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 무선 충전 안테나는,제1 차폐 부재, 상기 제1 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 제1 수신코일을 포함하고, 상기 제1 하우징에 배치되는 제1 무선 충전 안테나 및제2 차폐 부재, 상기 제2 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 제2 수신코일을 포함하고, 상기 제2 하우징에 배치되는 제2 무선 충전 안테나를 포함하는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제1 무선 충전 안테나는,상기 제1 수신 코일의 권선 중심인 제1 중심을 포함하고,상기 제2 무선 충전 안테나는,공개특허 10-2023-0080274-3-상기 제2 수신 코일의 권선 중심인 제2 중심을 포함하고,상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는,상기 제1 수신 코일의 제1 중심과 상기 제2 수신 코일의 제2 중심 중 적어도 하나가 상기 전자 장치의 중심과인접하도록 배치되는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4항에 있어서,상기 제2 하우징은,상기 제1 하우징에 대하여 슬라이딩 가능하게 결합되고,상기 제2 하우징의 슬라이딩에 따라 적어도 일부가 상기 전자 장치 내의 수용 공간으로 인입되거나 상기 수용공간에서 인출되는 디스플레이 모듈;을 더 포함하고,상기 제2 하우징이 상기 제1 하우징에 대하여 슬라이딩 동작을 함에 따라 상기 제1 무선 충전 안테나의 제1 중심과 상기 제2 무선 충전 안테나의 제2 중심 사이의 거리가 변화하는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 제1 무선 충전 안테나의 제1 중심과 상기 제2 무선 충전 안테나의 제2 중심 사이의 거리는 상기 디스플레이 모듈이 상기 수용 공간으로 인입된 상태일 때 보다 상기 디스플레이 모듈이 상기 수용 공간으로 인출된 상태일 때 거리가 가까운 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서,상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는,상기 디스플레이 모듈이 상기 수용 공간에서 인출된 상태에서 상기 전자 장치의 일면을 제1 방향으로 바라봤을때, 하나의 동심원 패턴을 형성하는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서,상기 제2 무선 충전 안테나는,상기 디스플레이 모듈이 상기 수용 공간으로 인입된 상태에서 상기 제1 무선 충전 안테나에 대해 제1 방향에 위치하고,상기 제1 무선 충전 안테나는,상기 전자 장치의 일면을 제1 방향으로 바라봤을 때, 적어도 일부가 상기 제2 무선 충전 안테나와 중첩되는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,공개특허 10-2023-0080274-4-상기 디스플레이 모듈이 상기 수용 공간으로 인입된 상태에서 상기 제1 무선 충전 안테나의 제1 중심과 상기 전자 장치의 중심 사이의 거리는 상기 제2 무선 충전 안테나의 제2 중심과 상기 전자 장치의 중심 사이의 거리보다 가까운 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제4항에 있어서,상기 제1 하우징과 상기 제2 하우징은 접힘 가능하게 연결되는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는,상기 제1 하우징과 상기 제2 하우징이 펼쳐진 상태에서 상기 전자 장치의 일면을 제1 방향으로 바라봤을 때, 하나의 동심원 패턴을 형성하는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 제2 무선 충전 안테나는,상기 제1 하우징과 상기 제2 하우징이 접혀진 상태에서 상기 제1 무선 충전 안테나에 대해 제1 방향에위치하고,상기 제1 무선 충전 안테나는,상기 전자 장치의 일면을 제1 방향으로 바라봤을 때, 적어도 일부가 상기 제2 무선 충전 안테나와 중첩되는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서,상기 수신 코일은, 외부에서 인가된 자기장에 의해 유도 전류가 발생하고,상기 전자 장치의 일면을 제1 방향으로 바라봤을 때, 상기 차폐 부재의 제1 면 배치된 상기 수신 코일의 일부와상기 차폐 부재의 제2 면에 배치된 상기 수신 코일의 일부에 흐르는 유도 전류의 방향이 서로 반대인 전자장치."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,상기 차폐 부재는,상기 무선 충전 안테나의 전자기력 및/또는 동작 주파수에 의해서 발생하는 노이즈를 차폐하는 전자 장치.공개특허 10-2023-0080274-5-청구항 16 제1 하우징과 제2 하우징이 슬라이딩 가능하게 결합되는 전자 장치에 포함되어, 상기 제1 하우징 및 상기 제2하우징 중 적어도 하나에 배치되는 무선 충전 안테나에 있어서,차폐 부재; 및상기 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면을 교번하여 감기는 수신 코일;을 포함하는 무선 충전 안테나."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서, 상기 무선 충전 안테나의 수신 코일은,상기 차폐 부재의 제1 면과 상기 차폐 부재의 제2 면이 실질적으로 대응되는 패턴을 가지도록 감기는 무선 충전안테나."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제16항에 있어서,상기 무선 충전 안테나는,제1 차폐 부재, 상기 제1 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 제1 수신코일을 포함하고, 상기 제1 하우징에 배치되는 제1 무선 충전 안테나; 및제2 차폐 부재, 상기 제2 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 제2 수신코일을 포함하고, 상기 제2 하우징에 배치되는 제2 무선 충전 안테나;를 포함하는 무선 충전 안테나."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,상기 제1 무선 충전 안테나는,상기 제1 수신 코일의 권선 중심인 제1 중심을 포함하고,상기 제2 무선 충전 안테나는,상기 제2 수신 코일의 권선 중심인 제2 중심을 포함하고,상기 제2 하우징이 상기 제1 하우징에 대하여 슬라이딩 동작을 함에 따라 상기 제1 무선 충전 안테나의 제1 중심과 상기 제2 무선 충전 안테나의 제2 중심 사이의 거리가 변화하는 무선 충전 안테나."}
{"patent_id": "10-2022-0029324", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제19항에 있어서,상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는,상기 전자 장치의 디스플레이 모듈이 상기 전자 장치의 수용 공간에서 인출된 상태에서 상기 전자 장치의 일면을 제1 방향으로 바라봤을 때, 하나의 동심원 패턴을 형성하는 무선 충전 안테나.공개특허 10-2023-0080274-6-"}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대한 상대 위치가 가변되 도록 상기 제1 하우징에 연결되는 제2 하우징, 차폐 부재, 상기 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 수신 코일을 포함하고, 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되 는 무선 충전 안테나 및 상기 무선 충전 안테나와 전기적으로 연결되는 배터리(battery)를 포함하는 전자 장치."}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예들은, 안테나 및 안테나를 포함하는 전자 장치에 관한 것이다."}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 무선 전력 전송(wireless power transfer) 기술을 이용하여 무선 충전 또는 무접점 충전을 할 수 있다. 무선 전력 전송 기술은 전력 수신 장치와 전력 송신 장치 간에 별도의 커넥터에 의한 연결 없이, 전력이 무선으로 전력 송신 장치로부터 전력 수신 장치로 전달되어 전력 수신 장치의 배터리가 충전이 되는 기술일 수 있다. 무선 전력 전송 기술은 자기유도방식과 자기공명방식을 포함할 수 있으며, 이 외에도 다양한 방식의 무선 전력 전송 기술을 포함할 수 있다."}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "휴대용 전자 장치의 무선 충전은 무선 충전기 내부에 배치된 송신 코일과 전자 장치 내부에 배치된 수신 코일의 사이즈와 형태가 일치할수록 충전 효율이 상승할 수 있다. 또한, 수신 코일의 중심과 송신 코일의 중심이 일치 할수록 전자 장치의 충전 효율이 상승할 수 있다. 최근 전자 장치의 형태가 단순한 Bar type을 넘어서 롤러불(rollable), 폴더블(foldable) 등 다양한 형태로 변 경되고 있다. 이에 따라, 다양한 형태를 가진 전자 장치 내부에 규격화된 송신 코일과 동일한 형태를 가진 수신 코일을 실장하기 위한 공간이 부족할 수 있다. 또한, 형태가 변화하는 전자 장치의 중심에 수신 코일의 중심을 일치시키는 것이 어려울 수 있다. 사용자들은 단말기를 무선 충전기의 가운데 놓는 것이 일반적이라고 생각하는 바, 충전 시 사용자들이 전자 장치의 중심에 무선 충전기를 위치시키면 충전 효율이 떨어질수 있다. 본 문서에 개시된 다양한 실시예에 따른 수신 코일은 다양한 형태로 변화하는 전자 장치의 내부에 배치될 수 있 다. 또한 수신 코일은 중심이 전자 장치의 중심과 인접하도록 전자 장치 내부에 배치될 수 있다."}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 제1 하우징, 상기 제1 하우징에 대한 상대 위치가 가변되 도록 상기 제1 하우징에 연결되는 제2 하우징, 차폐 부재, 상기 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면에 교번하여 감기는 수신 코일을 포함하고, 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치 되는 무선 충전 안테나 및 상기 무선 충전 안테나와 전기적으로 연결되는 배터리(battery)를 포함할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 제1 하우징과 제2 하우징이 슬라이딩 가능하게 결합되는 전자 장치에 포함되어 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 무선 충전 안테나는, 차폐 부재 및 상기 차폐 부재의 제1 면과 상기 제1 면의 반대 면인 제2 면을 교번하여 감기는 수신 코일을 포함할 수 있다."}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 문서에 개시된 다양한 실시예에 따른 수신 코일은 롤러블, 폴더블 전자 장치와 같이 형태가 변화될 수 있는 전자 장치 내부에 배치될 수 있다. 수신 코일은 중심이 전자 장치의 중심과 인접 또는 일치하도록 전자 장치 내부에 배치될 수 있다. 따라서, 사용 자가 무선 충전기를 전자 장치의 중심에 위치시키는 경우, 전자 장치는 수신 코일의 중심이 무선 충전기의 송신 코일의 중심과 일치 또는 인접하게되어 일정 수준 이상의 충전 효율을 확보할 수 있다."}
{"patent_id": "10-2022-0029324", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 설명에서는, 본 문서의 다양한 실시예가 첨부된 도면을 참조하여 기재된다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실 시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\",“또는 B 중 적어도 하나,”\"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나,”및 “A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, “기능적으로” 또는 “통신적으로”라는 용어와 함께 또는 이런 용어 없이, “커 플드” 또는 “커넥티드”라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네 트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장 치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또 는 서버와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출 력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈 , 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에 서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성 요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세서 는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메 모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메 모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또 는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처 리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서 를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특 화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있 다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구 성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따르면, 보조 프로 세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자 체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공 지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmannmachine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워 크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지 능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상 기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시예 에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이상 의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모듈 은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터리 는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이 루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들 (예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모 듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품 (예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작들의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 전달 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 전달 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2은, 다양한 실시예들에 따른, 전력 관리 모듈 및 배터리에 대한 블럭도이다. 도 2를 참조하 면, 전력 관리 모듈은 충전 회로, 전력 조정기, 또는 전력 게이지를 포함할 수 있다. 충전 회로는 전자 장치에 대한 외부 전원으로부터 공급되는 전력을 이용하여 배터리를 충전할 수 있 다. 일실시예에 따르면, 충전 회로는 외부 전원의 종류(예: 전원 어댑터, USB 또는 무선충전), 상기 외부 전원으로부터 공급 가능한 전력의 크기(예: 약 20와트 이상), 또는 배터리의 속성 중 적어도 일부에 기반 하여 충전 방식(예: 일반 충전 또는 급속 충전)을 선택하고, 상기 선택된 충전 방식을 이용하여 배터리를 충전할 수 있다. 외부 전원은 전자 장치와, 예를 들면, 연결 단자을 통해 유선 연결되거나, 또는 안 테나 모듈를 통해 무선으로 연결될 수 있다. 전력 조정기는, 예를 들면, 외부 전원 또는 배터리로부터 공급되는 전력의 전압 레벨 또는 전류 레벨 을 조정함으로써 다른 전압 또는 다른 전류 레벨을 갖는 복수의 전력들을 생성할 수 있다. 전력 조정기는 상기 외부 전원 또는 배터리의 전력을 전자 장치에 포함된 구성 요소들 중 일부 구성 요소들 각각의 구성 요소에게 적합한 전압 또는 전류 레벨로 조정할 수 있다. 일실시예에 따르면, 전력 조정기는 LDO(low drop out) regulator 또는 switching regulator의 형태로 구현될 수 있다. 전력 게이지는 배터리에 대한 사용 상태 정보(예: 배터리의 용량, 충방전 횟수, 전압, 또는 온도)를 측정할 수 있다. 전력 관리 모듈은, 예를 들면, 충전 회로, 전압 조정기, 또는 전력 게이지를 이용하여, 상 기 측정된 사용 상태 정보에 적어도 일부 기반하여 배터리의 충전과 관련된 충전 상태 정보(예: 수명, 과 전압, 저전압, 과전류, 과충전, 과방전(over discharge), 과열, 단락, 또는 팽창(swelling))를 결정할 수 있다. 전력 관리 모듈은 상기 결정된 충전 상태 정보에 적어도 일부 기반하여 배터리의 정상 또는 이 상 여부를 판단할 수 있다. 배터리의 상태가 이상으로 판단되는 경우, 전력 관리 모듈은 배터리(18 9)에 대한 충전을 조정(예: 충전 전류 또는 전압 감소, 또는 충전 중지)할 수 있다. 일실시예에 따르면, 전력 관리 모듈의 기능들 중 적어도 일부 기능은 외부 제어 장치(예: 프로세서)에 의해서 수행될 수 있다. 배터리는, 일실시예에 따르면, 배터리 보호 회로(protection circuit module(PCM))를 포함할 수 있 다. 배터리 보호 회로는 배터리의 성능 저하 또는 소손을 방지하기 위한 다양한 기능(예: 사전 차단 기능)들 중 하나 이상을 수행할 수 있다. 배터리 보호 회로은, 추가적으로 또는 대체적으로, 셀 밸런싱, 배터리의 용량 측정, 충방전 횟수 측정, 온도 측정, 또는 전압 측정을 포함하는 다양한 기능들을 수행할 수 있 는 배터리 관리 시스템(battery management system(BMS))의 적어도 일부로서 구성될 수 있다. 일실시예에 따르면, 배터리의 상기 사용 상태 정보 또는 상기 충전 상태 정보의 적어도 일부는 센서 모듈 중 해당하는 센서(예: 온도 센서), 전원 게이지, 또는 전력 관리 모듈을 이용하여 측정될 수 있다. 일실시예에 따르면, 상기 센서 모듈 중 상기 해당하는 센서(예: 온도 센서)는 배터리 보호 회로 의 일부로 포함되거나, 또는 이와는 별도의 장치로서 배터리의 인근에 배치될 수 있다. 도 3는, 다양한 실시예들에 따른, 전자 장치의 무선 통신 모듈, 전력 관리 모듈, 및 안테나 모 듈에 대한 블럭도이다. 도 3을 참조하면, 무선 통신 모듈은 MST 통신 모듈 또는 NFC 통신 모듈을 포함하고, 전력 관리 모듈은 무선 충전 모듈을 포함할 수 있다. 이런 경우, 안테나 모듈 은 MST 통신 모듈과 연결된 MST 안테나(397-1), NFC 통신 모듈과 연결된 NFC 안테나(397-3), 및 무선 충전 모듈과 연결된 무선 충전 안테나(397-5)을 포함하는 복수의 안테나들을 포함할 수 있다. 설 명의 편의를 위해 도 1와 중복되는 구성 요소는 생략 또는 간략히 기재된다. MST 통신 모듈은 프로세서로부터 제어 정보, 또는 카드 정보와 같은 결제 정보를 포함한 신호를 수신 하고, MST 안테나(397-1)를 통해 상기 수신된 신호에 대응하는 자기 신호를 생성한 후, 상기 생성된 자기 신호를 외부의 전자 장치(예: POS 장치)에 전달할 수 있다. 상기 자기 신호를 생성하기 위하여, 일실시예에 따 르면, MST 통신 모듈은 MST 안테나(397-1)에 연결된 하나 이상의 스위치들을 포함하는 스위칭 모듈을 포함 하고(미도시), 이 스위칭 모듈을 제어하여 MST 안테나(397-1)에 공급되는 전압 또는 전류의 방향을 상기 수신된 신호에 따라 변경할 수 있다. 상기 전압 또는 전류의 방향의 변경은 MST 안테나(397-1)를 통해 송출되는 자기 신호(예: 자기장)의 방향이 그에 따라 변경하는 것을 가능하게 해 준다. 방향이 변경되는 상태의 자기 신호는, 외부의 전자 장치에서 감지되면, 상기 수신된 신호(예: 카드 정보)에 대응하는 마그네틱 카드가 상기 전자 장치의 카드 리더기에 읽히면서(swiped) 발생하는 자기장과 유사한 효과(예: 파형)를 야기할 수 있다. 일 실시예에 따르면, 전자 장치에서 상기 자기 신호의 형태로 수신된 결제 관련 정보 및 제어 신호는, 예를 들면, 네트 워크를 통해 외부의 서버(예: 결제 서버)로 송신될 수 있다. NFC 통신 모듈은 프로세서로부터 제어 정보, 또는 카드 정보와 같은 결제 정보를 포함한 신호를 획득 하고, 상기 획득된 신호를 NFC 안테나(397-3)를 통해 외부의 전자 장치로 송신할 수 있다. 일실시예에 따 르면, NFC 통신 모듈은, NFC 안테나(397-3)을 통하여 외부의 전자 장치로부터 송출된 그런 신호를 수 신할 수 있다. 무선 충전 모듈은 무선 충전 안테나(397-5)를 통해 외부의 전자 장치(예: 휴대폰 또는 웨어러블 디바 이스)로 전력을 무선으로 송신하거나, 또는 외부의 전자 장치(예: 무선 충전 장치)로부터 전력을 무선으로 수신할 수 있다. 무선 충전 모듈은, 예를 들면, 자기 공명 방식 또는 자기 유도 방식을 포함하는 다양한 무선 충전 방식 중 하나 이상을 지원할 수 있다. 일실시예에 따르면, MST 안테나(397-1), NFC 안테나(397-3), 또는 무선 충전 안테나(397-5) 중 일부 안테나들은 방사부의 적어도 일부를 서로 공유할 수 있다. 예를 들면, MST 안테나(397-1)의 방사부는 NFC 안테나(397-3) 또 는 무선 충전 안테나(397-5)의 방사부로 사용될 수 있고, 그 반대도 마찬가지이다. 이런 경우, 안테나 모듈 은 무선 통신 모듈(예: MST 통신 모듈 또는 NFC 통신 모듈) 또는 전력 관리 모듈(예: 무선 충전 모듈)의 제어에 따라 안테나들(397-1, 397-3, 또는 397-3)의 적어도 일부를 선택 적으로 연결(예: close) 또는 분리(예: open)하도록 설정된 스위칭 회로(미도시)를 포함할 수 있다. 예를 들어, 전자 장치가 무선 충전 기능을 사용하는 경우, NFC 통신 모듈 또는 무선 충전 모듈은 상기 스위 칭 회로를 제어함으로써 NFC 안테나(397-3) 및 무선 충전 안테나(397-5)에 의해 공유된 방사부의 적어도 일부 영역을 일시적으로 NFC 안테나(397-3)와 분리하고 무선 충전 안테나(397-5)와 연결할 수 있다. 일실시예에 따르면, MST 통신 모듈, NFC 통신 모듈, 또는 무선 충전 모듈의 적어도 하나의 기능 은 외부의 프로세서(예: 프로세서)에 의해 제어될 수 있다. 일실시예에 따르면, MST 통신 모듈 또는 NFC 통신 모듈의 지정된 기능(예: 결제 기능)들은 신뢰된 실행 환경(trusted execution environment, TEE)에서 수행될 수 있다. 다양한 실시예에 따른 신뢰된 실행 환경(TEE)은, 예를 들면, 상대적으로 높은 수준의 보안이 필요한 기능(예: 금융 거래, 또는 개인 정보 관련 기능)을 수행하는데 사용되기 위해 메모리의 적 어도 일부 지정된 영역이 할당되는 실행 환경을 형성할 수 있다. 이런 경우, 상기 지정된 영역에 대한 접근은, 예를 들면, 거기에 접근하는 주체 또는 상기 신뢰된 실행 환경에서 실행되는 어플리케이션에 따라 구분하여 제 한적으로 허용될 수 있다. 이하, 동일하거나 유사한 구성 요소에 대하여 별도로 표시한 경우를 제외하고는 모두 동일한 부재 번호를 사용 하도록 한다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 닫힌 상태에서의 사시도이다. 도 4b는, 본 문서 에 개시된 다양한 실시예에 따른 전자 장치의 열린 상태에서의 사시도이다. 도 4c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 다양한 실시예에 따르면, 도 4a 내지 도 4c에 도시된 전자 장치는 도 1에서 설명한 전자 장치 중 하 나일 수 있다. 이하에서 설명되는 전자 장치는 도 1에서 설명한 구성 요소 중 적어도 하나를 포함할 수 있다. 도 4a 및 도 4b를 참조하면, 전자 장치는 슬라이딩 가능하게 구성된 전자 장치일 수 있다. 일 실시예 에서, 전자 장치의 슬라이딩 동작은 제1 하우징에 대한 제2 하우징의 슬라이딩을 의미할 수 있 다. 제2 하우징은 제1 하우징에 대하여 도 4a 및 도 4b를 기준으로 +X 방향 또는 도 4a 및 도 4b를 기준으로 -X 방향으로 슬라이딩될 수 있다. 이하 설명에서는 제2 하우징이 +X 방향으로 슬라이딩되는 동작 을 슬라이드 인(slide-in)이라하고, 제2 하우징이 -X 방향으로 슬라이딩되는 동작은 슬라이드 아웃(slide-out)이라 정의하도록 한다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치는 슬라이딩 방식을 통해 전자 장치 외부로 노출되 는 플렉서블 디스플레이 모듈의 면적이 증가하거나 감소하도록 구현된 전자 장치일 수 있다. 다르게 이해하면, 전자 장치는 슬라이딩 방식을 통해 플렉서블 디스플레이 모듈의 일부분이 전자 장치 내부로 인입되거나, 전자 장치 내부에서 인출되도록 구성된 전자 장치일 수 있다. 다양한 실시예에 따르면, 플렉서블 디스플레이 모듈은 휘어짐이 가능한 플렉서블 디스플레이 모듈일 수 있다. 일 실시예에서, 플렉서블 디스플레이 모듈은 유연한 소재의 기판을 포함할 수 있다. 예를 들어, 플렉서블 디스플레이 모듈은 폴리이미드(polyimide; PI) 또는 폴리에틸렌 테레프탈레이트(polyethylene terephthalate; PET)와 같은 유연 소재의 고분자 물질로 형성된 기판을 포함할 수 있다. 또한, 매우 얇게 형성 된 유리 소재의 기판을 포함할 수 있다. 플렉서블 디스플레이 모듈은 지지 부재에 의해 지지되며, 제 1 하우징에 대한 제2 하우징의 슬라이딩에 따라 외부로 보여지는 부분인 면적이 증감할 수 있다. 일 실시예에서, 플렉서블 디스플레이 모듈은 터치 감지 회로(예: 터치 센서)를 더 포함할 수 있다. 또한, 플 렉서블 디스플레이 모듈은 터치의 세기(압력)를 측정할 수 있는 압력 센서 및/또는 자기장 방식의 펜 입력 장치(예: 스타일러스 펜)를 검출하는 디지타이저와 결합되거나 인접하여 배치될 수 있다. 예컨대, 디지타이저는 펜 입력 장치로부터 인가된 전자기 유도 방식의 공진 주파수를 검출할 수 있도록 유전체 기판 상에 배치되는 코 일 부재를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는 슬라이딩 동작에 의해 닫힌 상태(예: 도 4a에 도시된 상태)에서 열 린 상태(예: 도 4b에 도시된 상태)로 변경될 수 있다. 닫힌 상태는 제2 하우징이 완전히 슬라이드 인된 상태를 의미할 수 있다. 닫힌 상태는 제2 하우징이 더 이상 슬라이드 인 될 수 없는 위치에 도달한 상태를 의미할 수 있다. 닫힌 상태에서 제1 하우징의 일단 과 제2 하우징의 일단이 실질적으로 일치할 수 있다. 예를 들어, 도 4a에 도시된 것과 같이, 제2 하우징 이 제1 하우징에 대해 돌출되거나, 제1 하우징이 제2 하우징에 대해 돌출되지 않을 수 있 다. 열린 상태는 제2 하우징이 완전히 슬라이드 아웃된 상태를 의미할 수 있다. 열린 상태는 제2 하우징 이 더 이상 슬라이드 아웃 될 수 없는 위치에 도달한 상태를 의미할 수 있다. 외부에서 노출되는 플렉서블 디스 플레이 모듈의 면적은 열린 상태가 닫힌 상태보다 클 수 있다. 일 실시예에 따르면, 제1 하우징에 대한 제2 하우징의 슬라이딩은 반자동적으로 수행될 수 있다. 예 를 들어, 슬라이딩 방향으로 탄성력을 제공하는 부재(미도시)에 의해 제1 하우징에 대한 제2 하우징 의 슬라이딩이 수행될 수 있다. 이 경우, 제1 하우징에 대한 제2 하우징의 슬라이딩이 일부 이루어지 면, 제1 하우징 및/또는 제2 하우징에 제공되는 탄성력에 의해 제2 하우징의 슬라이딩이 이루어 질 수 있다. 일 실시예에 따르면, 제1 하우징에 대한 제2 하우징의 슬라이딩은 자동적으로 수행될 수 있다. 예를 들어, 제2 하우징은 모터(미도시)에 의해 제1 하우징에 대해 슬라이딩될 수 있다. 전자 장치에 포함된 다양한 버튼 및 센서를 통해 입력되는 신호에 따라 제2 하우징을 슬라이딩시키는 모터가 작동할 수 있다. 다양한 실시예에 따르면, 제1 하우징은 복수의 하우징으로 구성될 수 있다. 제2 하우징은 제1 하우징 에 대해 슬라이딩되므로, 제2 하우징은 제1 하우징에 포함된 복수의 하우징에 대해 슬라이딩되 는 것으로 이해될 수 있다. 제1 하우징에 포함된 복수의 하우징은 예를 들어, 전자 장치의 전면(예: 도 4a의 +Z 방향을 향하는 면)의 일부를 구성하는 전면 하우징과 전자 장치의 후면(예: 도 4a의 -Z 방향을 향하는 면)의 일부를 구성하는 후면 하우징를 포함할 수 있다. 후면 하우징에는 후면 커버(미 도시)가 결합될 수 있다. 후면 커버는, 투명, 불투명 또는 반투명 소재로 형성될 수 있다. 제1 하우징에 포함된 복수의 하우징에 의해 형성된 공간에 제2 하우징의 일부가 수납될 수 있다. 도 도 4c에 도시된 제1 하우징의 구성 요소는 예시에 불과하며, 제1 하우징은 하나의 하우징으로 구성될 수도 있고, 도 4c에 도시된 것보다 많은 수의 하우징을 포함할 수도 있다. 다양한 실시예에 따르면, 제2 하우징은 제1 하우징에 대해 슬라이딩될 수 있다. 도 4a 및 도 4c을 참 조하면, 제1 하우징의 슬라이딩 홈에 제2 하우징의 일부분이 삽입되어 제2 하우징의 슬라 이딩이 가이드될 수 있다. 제2 하우징에는 지지 하우징이 결합될 수 있다. 지지 하우징은 플렉서블 디스플레이 모듈을 지지하는 지지 부재를 지지하는 하우징일 수 있다. 지지 하우징과 제2 하우징의 결합에 의해 지지 하우징과 제2 하우징 사이에 수용 공간(예: 도 5a 및 도 5b의 수용 공간)이 형성될 수 있다. 제2 하우징의 슬라이딩에 따라, 플렉서블 디스플레이 모듈의 일부가 제2 하우징과 지지 하우징 사이에 마련된 수용 공간에 수납될 수 있다. 어떤 실시예에서는 제2 하우징과 지지 하우징이 일체로 형성될 수 있다. 다양한 실시예에 따르면, 지지 부재는 플렉서블 디스플레이 모듈의 일부분을 지지할 수 있다. 지지 부재는 절곡 가능한 구조를 포함할 수 있다. 예를 들어, 지지 부재는 슬라이딩 방향(예: 도 4c의 X 축 방향)과 수직한 방향(예: 도 4c의 Y 축 방향)으로 연장되어 형성된 복수의 바(bar)가 슬라이딩 방향을 따라 배열된 구조를 포함할 수 있다. 이 밖에도 절곡이 가능한 다양한 구조로 지지 부재를 구성할 수 있다. 예를 들어, 지지 부재는 절곡될 수 있는 플레이트(plate)일 수 있고, 절곡을 허용할 수 있도록 복수 의 홈이 형성된 구조를 가질 수 있다. 다양한 실시예에 따르면, 지지 부재는 제2 하우징의 슬라이딩에 따라 슬라이딩되며 플렉서블 디스플 레이 모듈을 지지할 수 있다. 지지 부재의 슬라이딩은 가이드 레일에 의해 가이드될 수 있다. 예를 들어, 지지 부재에 포함된 복수의 바의 양 말단이 가이드 레일에 각각 삽입됨으로써, 지지 부재의 슬라이딩이 가이드될 수 있다. 지지 부재를 가이드하는 가이드 레일은 제2 하우징 에 결합될 수 있다. 예를 들어, 도 4c에 도시된 것과 같이, 제2 하우징의 양 말단에 가이드 레일이 결합되고, 가이드 레일 사이에 지지 부재가 배치될 수 있다. 도 5a는, 본 문서에 개시된 다양한 실시예에 따른 도 4a에 도시된 전자 장치를 A-A선을 따라 절개한 단면도이다. 도 5b는, 본 문서에 개시된 다양한 실시예에 따른 도 4b에 도시된 전자 장치를 B-B선을 따라 절개 한 단면도이다. 다양한 실시예에 따르면, 플렉서블 디스플레이 모듈은 복수의 영역을 포함할 수 있다. 이하에서 설명되는 복수의 영역은 전자 장치에서 플렉서블 디스플레이 모듈의 상태 또는 플렉서블 디스플레이 모듈(43 0)이 위치한 부분에 따라 구분된 영역일 수 있다. 예를 들어, 플렉서블 디스플레이 모듈은 전자 장치(40 0)의 외부로 플렉서블 디스플레이 모듈이 노출되는 영역인 제1 영역(430A), 플렉서블 디스플레이 모듈 이 전자 장치의 수용 공간에 수납된 영역인 제2 영역(430B) 및 제1 영역(430A)과 제2 영역 (430B)을 연결하고 변형(예: 밴딩(bending))된 영역인 제3 영역(430C)을 포함할 수 있다. 일 실시예에서, 플렉 서블 디스플레이 모듈의 제2 영역(430B)은 플렉서블 디스플레이 모듈의 일부가 수용 공간에 수 용된 영역일 수 있다. 수용 공간은 전자 장치를 구성하는 다양한 기구물에 의해 둘러싸인 공간일 수 있다. 일 실시예에서, 수용 공간은 제2 하우징과 지지 하우징(예: 도 4c의 지지 하우징)에 의해 형성된 영역을 포함할 수 있다. 일 실시예에서, 플렉서블 디스플레이 모듈를 둘러싸는 하우징의 형상에 따 라 제3 영역(430C)의 일부도 전자 장치 외부로 시인될 수 있다. 예를 들어, 도 5a 및 도 5b에 도시된 것과 같이, 제2 하우징의 일부가 밴딩 영역을 덮을 수 있다. 이에 따라, 제2 하우징에 가려지지 않는 제3 영역(430C) 일부도 전자 장치 외부로 노출될 수 있다. 이상 설명한 플렉서블 디스플레이 모듈의 각 영역은 설명의 편의를 위해 구분한 것에 불과하며 실제 시각적으로 구별되는 영역이 아닐 수 있다. 일 실시예에서, 제3 영역(430C)은 제2 하우징의 외측 형상에 대응되도록 플렉서블 디스플레이 모듈의 일부가 변형된 영역일 수 있다. 예를 들어, 도 5a 및 도 5b에 도시된 것과 같이, 제2 하우징의 외측 형상 중 일부는 라운드(round) 형태를 포함할 수 있다. 제3 영역(430C)은 제2 하우징의 라운드 형태와 대응되도 록 플렉서블 디스플레이 모듈의 일부가 밴딩된 영역일 수 있다. 일 실시예예서, 플렉서블 디스플레이 모듈은 지지 부재에 의해 지지될 수 있다. 지지 부재의 슬 라이딩은 가이드 레일에 의해 가이드될 수 있다. 지지 부재가 제3 영역(430C)을 지지할 수 있도록 가 이드 레일은 제2 하우징의 라운드 형태와 대응되도록 형성되고, 지지 부재는 라운드 형태와 대 응된 가이드 레일을 따라 절곡될 수 있다. 예를 들어, 지지 부재가 멀티 바를 포함하는 경우, 제3 영역(430C)을 지지하는 부분에서 멀티 바 사이의 간격이 플렉서블 디스플레이 모듈의 제1 영역 (430A)이나 제2 영역(430B)을 지지하는 부분에 비해 벌어지며 지지 부재가 전체적으로 밴딩될 수 있다. 지 지 부재는 가이드 레일을 따라 절곡된 상태에서 플렉서블 디스플레이 모듈의 제3 영역(430C)을 지지할 수 있다. 전자 장치가 슬라이딩됨에 따라, 제1 영역(430A)과 제2 영역(430B)의 크기는 가변될 수 있다. 예를 들어, 닫힌 상태(예: 도 4a에 도시된 상태)에서 제1 영역(430A)의 크기는 열린 상태(예: 도 4b에 도시된 상태)에서 제 1 영역(430A)의 크기보다 작을 수 있다. 닫힌 상태에서 제2 영역(430B)의 크기는 열린 상태에서 제2 영역(430 B)의 크기보다 클 수 있다. 다양한 실시예에 따르면, 제2 하우징이 슬라이드 아웃되면 지지 부재에 지지된 플렉서블 디스플레이 모듈이 슬라이딩되며 제1 영역(430A)이 증가하고, 제2 영역(430B)이 줄어들 수 있다. 다양한 실시예에 따르면, 제2 하우징이 슬라이드 인되면, 지지 부재에 지지된 플렉서블 디스플레이 모듈이 슬라이딩되며 제1 영역(430A)이 감소하고, 제2 영역(430B)이 증가할 수 있다. 이처럼 본 문서에 개시된 다양한 실시예에 따른 전자 장치는, 플렉서블 디스플레이 모듈이 일부가 수 용 공간으로 인입되거나, 수용 공간에서 인출되며 전자 장치 외부에서 보여지는 플렉서블 디스 플레이 모듈의 면적이 증감할 수 있다. 외부에서 보여지는 플렉서블 디스플레이 모듈의 면적이 변화 함에 따라 표시되는 정보의 양을 조절하거나, 표시되는 컨텐츠의 화면 비율을 조절하는 것과 같이 다양한 동작 이 수행될 수 있다. 도 6는, 비교 실시예에 따른 무선 충전 안테나를 나타내는 도면이다. 본 문서에 개시된 다양한 실시예에 대한 설명에 앞서 비교 실시예에 따른 무선 충전 안테나와 무선 충전 안테나를 이용한 전자 장치(예: 도 1의 전자 장치)의 무선 충전 방식에 대해 간략히 설명하도록 한다. 전자 장치 내부에는 전자 장치의 배터리와 연결되는 비교 실시예의 무선 충전 안테나가 배 치될 수 있다. 도 6에 도시된 것과 같이, 비교 실시예의 무선 충전 안테나는 외부 전자 장치(예: 휴대폰, 외부 충전 장치)(예: 도 1의 전자 장치)의 송신 코일에서 발생된 자기장에 의해 전류가 발생되는 수신 코 일과 외부 전자 장치의 전자기력 및/또는 동작 주파수에 의해서 발생하는 노이즈를 차폐하는 차폐 부재 를 포함할 수 있다. 비교 실시예의 수신 코일에는 외부 전자 장치(예: 도 1의 전자 장치)에서 발생한 자기장(M)에 의해 유도 전류가 발생할 수 있으며, 유도 전류를 통해 배터리에 전력을 공급할 수 있다. 예를 들어, 외부 전자 장치에 전원이 공급되면 외부 전자 장치 내부에 배치된 송신 코일(미도시)에 전류가 흘러 자기장(M)이 발생한다. 외부 전자 장치에서 발생한 자기장(M)은 전자 장치 내부에 배치된 수신 코일에 유도 전류 를 발생시킬 수 있으며, 수신 코일과 연결된 배터리는 유도 전류를 통해 충전될 수 있다. 이 밖에도 무선 충전 안테나는 외부 전자 장치와 다양한 방식의 전자기 상호 작용을 통해 배터리에 전력을 공급 할 수 있다. 예를 들어, 무선 충전 안테나는 자기 공명 방식 또는 자기 유도 방식을 포함하는 다양한 무선 충전 방식 중 하나 이상을 지원할 수 있다. 무선 충전 안테나의 수신 코일과 외부 전자 장치의 송신 코일의 형태가 일치할수록 전자 장치의 무선 충전 효율이 상승할 수 있다. 또한, 전자 장치는 송신 코일에서 발생된 자기장(M)이 수신 코일 의 권선 중심(C)을 통과할수록 충전 효율이 상승할 수 있다. 무선 충전 안테나의 수신 코일은 외부 전자 장치의 송신 코일과 대응되도록 형성될 수 있다. 도 6을 참조하면, 무선 충전 안테나의 수신 코일 은 외부 전자 장치의 송신 코일의 형태와 대응되도록 수신 코일의 권선 중심(C)을 중심점으로하여 동심원 형태로 복수 회 감겨 형성될 수 있다. 예를 들어, 무선 충전 안테나의 수신 코일은 외부 전자 장치의 송신 코일의 최내각 패턴과 최외각 패턴이 일치하도록 감겨 형성될 수 있다. 정리하면, 전자 장치는 무선 충전 안테나의 수신 코일의 권선 중심(C)이 외부 전자 장치에 배치된 송신 코일의 권선 중심과 일치 하며, 송신 코일과 대응되는 형태로 형성될수록 충전 효율이 상승할 수 있다. 다만, 도 4a 내지 도 5b에 도시된 롤러블(rollable) 형태의 전자 장치에는 무선 충전 안테나를 실장 하기 위한 공간이 확보되지 못할 수 있다. 도 5a 및 도 5b를 참조하면 디스플레이 모듈(예: 도 4a의 디스플레이 모듈)은 제1 하우징과 제2 하우징이 슬라이딩 동작함에 따라 전자 장치 내부의 수용 공간 내에 인입될 수 있다. 상술한 전자 장치 내부에 수신 코일을 배치할 경우, 디스플레이 모듈 과 수신 코일이 도 5a를 기준으로 Z 축 방향으로 중첩될 수 있다. 전자 장치의 무선 충전 안테 나와 외부 전자 장치 사이에 디스플레이 모듈이 위치함에 따라 무선 충전 안테나의 수신 코일과 외부 전자 장치의 송신 코일간 전기/자기 교류가 원활하지 않을 수 있다. 따라서, 전자 장치의 무 선 충전 효율이 감소할 수 있다. 또한, 도 4a 내지 도 5b에 도시된 전자 장치와 같이 형태가 변화하는 전자 장치에 비교 실시예의 무 선 충전 안테나를 배치할 경우, 전자 장치의 중심부와 수신 코일의 중심이 일치하지 않을 수 있 다. 이러한 경우, 사용자들이 전자 장치의 중심부(예: 도 9c의 중심부(P))에 외부 전자 장치를 위치시키면 전자 장치의 중심부와 수신 코일의 권선 중심(C)이 일치하지 않을 수 있다. 이 경우, 전자 장치 내부에 배치된 무선 충전 안테나의 수신 코일의 권선 중심(C)에 송신 코일에서 발생한 자기장(M)이 밀집되지 않을 수 있다. 따라서, 수신 코일의 권선 중심(C)과 외부 전자 장치의 송신 코일의 권선 중심이 일치한 경우보다 수신 코일에 송신 코일의 자기장(M)에 의한 유도 전류가 적게 발생하여 전자 장치의 충전 효율이 감소할 수 있다. 본 문서에 개시된 다양한 실시예에서는 도 4a 내지 도 5b에 도시된 전자 장치와 같이, 형태가 변화하는 전 자 장치에 배치될 수 있는 무선 충전 안테나를 제시할 수 있다. 또한, 무선 충전 안테나를 이용 하여 형태가 변화하는 전자 장치에서 무선 충전 효율을 확보할 수 있는 방안을 제시할 수 있다. 이하에서 자세히 설명하도록 한다. 도 7a는, 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나와 무선 충전 안테나에 유도된 유도 전류의 방향을 나타내는 도면이다. 도 7b는, 일 실시예에서 무선 충전 안테나의 제1 영역과 제2 영역이 연결되는 구조 를 나타낸 도면이다. 도 7c는, 다른 실시예에서 무선 충전 안테나의 제1 영역과 제2 영역이 연결되는 구조를 나 타낸 도면이다. 도 8은, 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나의 접힘 정도에 따른 전자 장 치의 무선 충전 효율을 설명하기 위한 도면이다. 본 문서에 개시된 다양한 실시예에 따르면, 전자 장치는 제1 하우징과 상기 제1 하우징에 대한 상대 위치가 가변되도록 제1 하우징과 연결되는 제2 하우징을 포함할 수 있다. 예를 들면, 도 4a 내 지 도 5b에 도시된 것과 같이, 제1 하우징과 제2 하우징은 슬라이딩 가능하게 결합될 수 있다. 다양한 실시예에 따르면, 제1 하우징과 제2 하우징 중 적어도 하나에 무선 충전 안테나가 배치 될 수 있다. 무선 충전 안테나는 제1 무선 충전 안테나와 제2 무선 충전 안테나를 포함할 수 있 다. 일 실시예에서, 제1 무선 충전 안테나는 제1 하우징에 배치되고, 제2 무선 충전 안테나는 제2 하우징에 배치될 수 있다. 어떤 실시예에서, 전자 장치에는 제1 무선 충전 안테나와 제2 무 선 충전 안테나 중 어느 하나만 배치될 수 있다. 예를 들어, 후술할 도 8을 참조하면, 전자 장치에는 제1 무선 충전 안테나만 배치될 수 있다. 이하 설명에서는, 제1 무선 충전 안테나와 제2 무선 충전 안테나를 설명함에 있어서, 무선 충전 안테 나를 이용하여 설명하도록 한다. 무선 충전 안테나는 수신 코일과 차폐 부재를 포함할 수 있다. 무선 충전 안테나의 수신 코일은 제1 무선 충전 안테나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일을 포함할 수 있다. 무선 충전 안테나의 차폐 부재는 제1 무 선 충전 안테나의 제1 차폐 부재와 제2 무선 충전 안테나의 제2 차폐 부재를 포함할 수 있 다. 또한, 제2 무선 충전 안테나는 제1 무선 충전 안테나와 대응되는 구성으로써, 이하 설명에서 “제1 무선 충전 안테나”에 대한 설명은 “제2 무선 충전 안테나”에도 동일하게 적용될 수 있다. 다양한 실시예에 따르면, 무선 충전 안테나는 WPC(wireless power consortium) 표준에 대응하는 주파수 대역으로 외부 전자 장치(예: 도 1의 전자 장치)의 송신 코일과 전력을 송수신할 수 있다. 일 실시예에서, 무선 충전 안테나의 수신 코일에는 외부 전자 장치(예: 휴대폰, 외부 충전 장치)에서 발생된 자기장 (M)에 의해 유도 전류가 발생할 수 있다. 예를 들어, 외부 전자 장치에 전원이 공급된면 외부 전자 장치의 송신 코일에서 자기장(M)이 발생할 수 있다. 무선 충전 안테나의 수신 코일은 외부 전자 장치의 자기장(M) 변화에 반하는 유도 자기장이 형성될 수 있도록 유도 전류를 형성한다. 무선 충전 안테나는 유도 전류를 통해 배터리에 전력을 공급할 수 있다. 배터리는 무선 충전 안테나로부터 전달받은 전력을 저장 하고, 전자 장치에 필요한 전력을 공급할 수 있다. 다양한 실시예에 따르면, 무선 충전 안테나의 차폐 부재는 무선 충전 안테나의 전자기력 및/또 는 동작 주파수에 의해서 발생하는 노이즈를 차폐할 수 있다. 일 실시예에서, 차폐 부재는 전자 장치내부에 배치된 전자 부품에 외부 전자 장치의 송신 코일에서 발생된 자기장(M)이 영향을 미치지 못하도록 송신 코일에서 발생된 자기장(M)을 차폐할 수 있다. 예를 들어, 차폐 부재는 외부 전자 장치의 송신 코일과 전 자 장치의 배터리 사이에 배치될 수 있다. 따라서, 송신 코일에서 발생된 자기장(M)이 전자 장치 의 배터리에 영향을 미치지 못하도록 전자 장치의 배터리로 향하는 자기장(M)을 차폐할 수 있다. 또한, 송신 코일에서 발생된 자기장(M)은 차폐 부재를 통과하지 못하는 바, 외부 전자 장치의 송신 코일과 차폐 부재에 배치된 수신 코일 간 폐루프(close loop)가 형성될 수 있다. 따라서, 외부 전자 장치의 송신 코일과 무선 충전 안테나의 수신 코일 간의 전자기 상호 작용이 원활하게 이루어질 수 있다. 다양한 실시예에 따르면, 전자 장치 내부에는 자석 부재(미도시)가 배치될 수 있다. 일 실시예에서, 자석 부재는 무선 충전 안테나를 둘러싸는 형태일 수 있다. 도 9a 및 도 9b를 참조하면, 외부 전자 장치 내에 배치된 송신 코일이 무선 충전 안테나의 수신 코일이 배치된 무선 충전 범위(P) 내에 위치하는 경우, 전자 장치는 외부 전자 장치에 의해 무선 충전될 수 있다. 여기서 무선 충전 범위(P)란 전자 장치 내 에 수신 코일이 배치된 영역을 의미할 수 있으며, 일 실시예에서, 전자 장치의 중심부를 의미할 수 있다. 외부 전자 장치 내부에 배치된 자석과 전자 장치 내부에 배치된 자석 부재는 위치가 고정되어 있다. 예를 들어, 외부 전자 장치 내부에 배치된 자석은 송신 코일을 둘러싸도록 외부 전자 장치 내에 위치가 고정되 어 있으며, 전자 장치의 자석 부재는 수신 코일이 포함된 무선 충전 안테나를 둘러싸도록 전자 장치 내에 위치가 고정될 수 있다. 외부 전자 장치가 전자 장치에 근접하는 경우, 외부 전자 장치의 자석과 전자 장치에 배치된 자석 부재 간에 인력이 발생할 수 있다. 외부 전자 장치 내에서 위치가 고정된 자석과 전자 장치 내에 위치가 고정된 자석 부재는 인력에 의해 서로에 대한 위치가 고정될 수 있다. 따라 서, 전자 장치에 배치된 무선 충전 안테나의 수신 코일과 외부 전자 장치의 송신 코일의 상대 위치도 고정될 수 있다. 예를 들어, 외부 전자 장치의 송신 코일과 전자 장치의 수신 코일은 서로 마 주 보도록 위치가 고정될 수 있다. 외부 전자 장치 내에 배치된 송신 코일이 전자 장치의 전자 장치 의 무선 충전 범위(P) 내에 위치함에 따라 외부 전자 장치의 송신 코일과 전자 장치의 수신 코일간에 전자기 유도 현상이 원활하게 발생할 수 있다. 따라서, 전자 장치는 외부 전자 장치에 의해 무선 충전될 수 있다. 다양한 실시예에 따르면, 도 7a에 도시된 것과 같이, 제1 무선 충전 안테나는 제1 수신 코일 - 제1 차폐 부재 - 제1 수신 코일 순으로 적층된 형태일 수 있다. 제1 무선 충전 안테나의 제1 수신 코일은 제1 차폐 부재의 제1 면(612-1)에 배치되는 제1 구간(611-1)과 제1 차폐 부재의 제1 면 의 반대 면인 제2 면(612-2)에 배치되는 제2 구간(611-2) 및 제1 차폐 부재의 제1 면(612-1)과 제2 면 (612-2) 사이에 위치하는 제3 면(612-3)에 배치되는 제3 구간(611-3)을 포함할 수 있다. 여기서, 제1 차폐 부재 의 제1 면(612-1)은 전자 장치의 커버 부재를 향하는 면(예: 도 5a를 기준으로 - Z 방향을 향하 는 면)일 수 있고, 제1 차폐 부재의 제2 면(612-2)은 전자 장치의 디스플레이을 향하는 면(예: 도 5a를 기준으로 + Z 방향을 향하는 면)일 수 있다. 후술할 도 10a를 참조하면, 제2 무선 충전 안테나는 상술한 바와 같이, 제1 무선 충전 안테나와 동일한 구조를 가질 수 있다. 예를 들어, 제2 무선 충전 안테 나는 제2 수신 코일 - 제2 차폐 부재 - 제2 수신 코일 순으로 적층된 구조일 수 있다. 또 한, 제2 수신 코일의 제1 구간(621-1)은 제2 차폐 부재의 제1 면(622-1)에 배치되고, 제2 구간(621- 2)은 제2 차폐 부재의 제2 면(622-2)에 배치되고, 제3 구간(621-3)은 제2 차폐 부재의 제3 면(622- 3)에 배치될 수 있다. 여기서, 제2 차폐 부재의 제1 면(622-1)은 전자 장치의 커버 부재를 향하 는 면(예: 도 5a를 기준으로 - Z 방향을 향하는 면)일 수 있고, 제2 차폐 부재의 제2 면(622-2)은 전자 장 치의 디스플레이을 향하는 면(예: 도 5a를 기준으로 + Z 방향을 향하는 면)일 수 있고, 제3 면(622- 3)은 제1 면(622-1)과 제2 면(622-2) 사이에 위치한 면일 수 있다. 다양한 실시예에 따르면, 도 7b 및 도 7c를 참조하면, 제1 무선 충전 안테나는 제1 수신 코일의 제1 구간(611-1) - 제1 차폐 부재 - 제1 수신 코일의 제2 구간(611-2) - 방열 부재 순으로 적층된 형태일 수 있다. 일 실시예에서, 제1 수신 코일의 제1 구간(611-1)은 복수의 구리층(Cu layer)(611-1A)이 적층된 형태일 수 있다. 예를 들어, 복수의 구리층(611-1A)이 접착 부재를 통해 접착된 형태일 수 있다. 또한, 제1 수신 코일의 제2 구간(611-2)은 제1 구간(611-1)과 마찬가지로 복수의 구리층(611-2A)이 적층된 형태 일 수 있으며, 제3 구간(611-3)도 복수의 구리층(611-3A)이 적층된 형태일 수 있다. 일 실시예에서, 제1 수신 코일은 방열 부재와 접촉될 수 있다. 예를 들어, 도 7b를 참조하면, 제1 수 신 코일의 제2 구간(612-2)은 방열 부재와 접촉될 수 있다. 제1 무선 충전 안테나의 제1 수신코일에서 발생된 열은 제1 수신 코일의 제1 구간(611-1)에서 제2 구간(611-2)을 거쳐 방열 부재(63 0)를 통해 제1 무선 충전 안테나 주변으로 방열될 수 있다. 도면에 도시되지는 않았지만, 제2 무선 충전 안테나는 상술한 제1 무선 충전 안테나의 구조와 동일한 구조로 형성될 수 있다. 다양한 실시예에 따르면, 무선 충전 안테나의 수신 코일의 제1 구간(611-1, 621-1)과 제2 구간(611- 2, 621-2)은 다양한 방식으로 연결될 수 있다. 일 실시예에서, 도 7b를 참조하면, 수신 코일의 제1 구간 (611-1, 621-1)과 제2 구간(611-2, 621-2)은 금속 소재를 솔더링(soldering)하여 전기적으로 연결될 수 있다. 이 경우, 수신 코일의 제3 구간(611-3, 621-3)은 수신 코일의 제1 구간(611-1, 621-1)에서 연 장되어 수신 코일의 제2 구간(611-2, 621-2)과 솔더링을 통해 연결될 수 있다. 일 실시예에서, 도 7c를 참 조하면, 수신 코일의 제1 구간(611-1, 621-1)은 차폐 부재의 제1 면(612-1, 622-1)에서 제2 면(612- 2, 622-2)으로 연장되어 수신 코일의 제2 구간(611-2, 621-2)과 전기적으로 연결될 수 있다. 도면에 도시 되지 않은 다른 실시예에서 수신 코일은 LDS(laser direct structuring)를 통해 차폐 부재의 제1 면 (612-1, 622-1) - 제3 면(612-3, 622-3) - 제2 면(612-2, 622-2) 순으로 감긴 형태를 가질 수 있다. 이 밖에도 수신 코일의 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2)은 다양한 방식으로 연결될 수 있다. 상술한 수신 코일의 제1 구간(611-1, 621-1), 제2 구간(611-2, 621-2) 및 제3 구간(611-3, 621-3)은 설명 의 편의를 위해 구분한 것일 뿐, 실제로 수신 코일의 제1 구간(611-1, 621-1), 제2 구간(611-2, 621-2) 및 제3 구간(611-3, 621-3)은 물리적으로 연결된 구성일 수 있다. 예를 들어, 무선 충전 안테나의 수신 코 일은 하나의 패턴을 가지도록 복수 회 감긴 차폐 부재의 제1 면(612-1, 622-1), 제2 면(612-2, 622- 2), 제3 면(612-3, 622-3)에 배치될 수 있다. 다양한 실시예에 따르면, 무선 충전 안테나의 수신 코일은 하나의 패턴이 차폐 부재에 감긴 형 태일 수 있다. 일 실시예에서, 무선 충전 안테나의 수신 코일은 차폐 부재의 제1 면(612-1, 622-1)과 제1 면(612-1, 622-1)의 반대 면인 제2 면(612-2, 622-2)에 교번하여 복수 회 감길 수 있다. 여기서 수신 코일이 차폐 부재의 제1 면(612-1, 622-1)과 제2 면(612-2, 622-2)에 교번하여 감긴다는 의미 는 하나의 형태를 가지는 수신 코일이 차폐 부재의 제1 면(612-1, 622-1)과 제2 면(612-2, 622-2)에 나눠져 배치된다는 의미이고, 실제로 수신 코일이 차폐 부재의 제1 면(612-1, 622-1)과 제2 면(612- 2, 622-2)에 번갈아가며 감긴다는 의미는 아닐 수 있다. 일 실시예에서, 무선 충전 안테나의 수신 코일 의 제1 구간(611-1, 621-1)은 수신 코일이 차폐 부재의 제1 면(612-1, 622-1)에 감긴 부분일 수 있다. 수신 코일의 제2 구간(611-2, 621-2)은 수신 코일이 차폐 부재의 제2 면(612-2, 622- 2)에 감긴 부분일 수 있다. 다양한 실시예에 따르면, 무선 충전 안테나의 수신 코일은 차폐 부재의 제1 면(612-1, 622-1)에 배치된 제1 구간(611-1, 621-1)과 차폐 부재의 제2 면(612-2, 622-2)에 배치된 제2 구간(611-2, 621-2)이 실질적으로 대응되는 패턴을 가지도록 차폐 부재에 감길 수 있다. 일 실시예에서, 후술할 도 10a 및 도 10b를 참조하면, 무선 충전 안테나의 수신 코일은 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621- 2)이 반원 형태를 가지도록 차폐 부재의 제1 면(612-1, 622-1)과 제2 면(612-2, 622-2)에 교번하여 복수 회 감길 수 있다. 다른 실시예에서, 후술할 도 10a 및 도 10b를 참조하면, 무선 충전 안테나의 수신 코일 은 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2)이 2/3 원 또는 1/3 원 형태로 대응되는 형태를 가 지도록 차폐 부재의 제1 면(612-1, 622-1)과 제2 면(612-2, 622-2)에 교번하여 감길 수 있다. 이 밖에도 무선 충전 안테나의 수신 코일은 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2)이 서로 대응되 는 형태를 가지도록 차폐 부재의 제1 면(612-1, 622-1)과 차폐 부재의 제2 면(612-2, 622-2)에 교번 하여 감길 수 있다. 다양한 실시예에 따르면, 상술한 바와 같이, 무선 충전 안테나의 수신 코일은 차폐 부재를 기준 으로 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2)이 대응되는 형상을 가질 수 있다. 따라서, 제1 차폐 부재의 제1 구간(611-1)의 권선 중심과 제2 구간(611-2)의 권선 중심은 도 7a를 기준으로 Z 축 방향으로 바라보았을 때, 일치할 수 있다. 마찬가지로, 제2 차페 부재의 제1 구간(621-1)의 권선 중심과 제2 구간 (621-2)의 권선 중심은 후술할 도 10a를 기준으로 Z 축 방향으로 바라보았을 때, 일치할 수 있다. 다양한 실시예에 따르면, 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나는 비교 실시예에 따른 무선 충전 안테나를 접은 형태로 형성될 수 있다. 비교 실시예에서, 무선 충전 안테나는 수신 코일 - 차폐 부재 순으로 적층된 구조일 수 있다. 이에 반해 본 문서에 개시된 다양한 실시예에 따른 무 선 충전 안테나는 수신 코일의 제1 구간(611-1, 621-1) - 차폐 부재 - 수신 코일의 제2구간(611-2, 621-2) 순으로 적층된 구조를 가질 수 있다. 비교 실시예에서, 무선 충전 안테나는 외부 전자 장치의 송신 코일과 대응되도록 형성되었다. 예를 들어, 무선 충전 안테나의 수신 코일은 외부 전자 장치의 송신 코일의 최내각 패턴 및 최외각 패턴과 일치 하도록 동심원 형태로 복수 회 감길 수 있다. 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나의 수신 코일은 차폐 부재의 제1 면(612-1, 622-1)에 감긴 수신 코일의 제1 구간(611-1, 621-1)과 차폐 부재의 제2 면(612-2, 622-2)에 감긴 수신 코일의 제2 구간(611-2, 621-2)이 실질적으로 대응 되는 패턴을 가지도록 차폐 부재에 감길 수 있다. 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나의 수신 코일은 다양한 형태로 차폐 부재 에 감길 수 있다. 예를 들어, 비교 실시예의 무선 충전 안테나의 수신 코일의 절반 또는 2/3 크 기를 가지도록 차폐 부재에 감길 수 있다. 따라서, 무선 충전 안테나의 크기가 비교 실시예에 따른 무선 충전 안테나보다 축소되어 전자 장치 내에 배치될 수 있는 공간이 확보될 수 있다. 다양한 실시예에 따르면, 후술할 도 10a 및 도 10b를 참조하면, 무선 충전 안테나는 수신 코일의 권 선 중심(C1, C2)이 전자 장치의 중심부와 인접하도록 제1 하우징과 제2 하우징 중 적어도 하나 에 배치될 수 있다. 전자 장치의 중심부는 무선 충전 범위(P)(예: 도 9b 및 도 9c 참조) 에 위치할 수 있 다. 여기서 무선 충전 범위(P) 전자 장치 내에 수신 코일이 배치된 영역을 의미할 수 있으며, 일 실 시예에서, 전자 장치의 중심부를 의미할 수 있다. 외부 전자 장치 내에 배치된 송신 코일이 무선 충전 범 위(P)에 위치하는 경우, 전자 장치는 외부 전자 장치에 의해 무선 충전될 수 있다. 특히, 외부 전자 장치 의 송신 코일에서 발생하는 자기장(M)의 자속은 송신 코일의 권선 중심에 밀집된다. 예를 들어, 송신 코일이 동 심원 형태로 복수 회 감긴 경우, 송신 코일의 최내각 내부원(패턴)에 자속이 밀집될 수 있다. 따라서, 전자 장 치에 배치된 수신 코일의 권선 중심(C1, C2)과 외부 전자 장치에 배치된 송신 코일의 권선 중심이 일 치할수록 전자 장치의 충전 효율이 상승할 수 있다. 한편, 사용자들은 전자 장치의 중심부에 무선 충전 안테나의 수신 코일의 권선 중심(C1, C2)이 위치하는 것으로 생각할 수 있다. 전자 장치의 중심부와 수신 코일의 권선 중심(C1, C2)이 일치할수 록 수신 코일의 권선 중심(C1, C2)과 송신 코일의 권선 중심이 일치할 수 있다. 따라서, 송신 코일의 자기 장(M)이 수신 코일의 권선 중심(C1, C2)에 밀집될 수 있으며, 송신 코일의 자기장(M)을 상쇄하는 유도 자 기장이 수신 코일의 권선 중심(C1, C2)에 밀집될 수 있다. 따라서, 수신 코일에는 유도 자기장에 의해 일 정 수준 이상의 유도 전류(I1, I2)가 발생할 수 있으며, 전자 장치의 충전 효율이 일정 수준 확보될 수 있 다. 다양한 실시예에 따르면, 수신 코일의 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2) 사이에는 외부 전자 장치에서 발생된 자기장(M)이 통과할 수 있다. 이에 따라, 수신 코일의 제1 구간(611-1, 621-1)과 제 2 구간(611-2, 621-2)에서 외부 전자 장치의 자기장(M) 변화를 상쇄시키도록 유도 전류가 발생할 수 있다. 다만, 수신 코일의 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2)은 외부 전자 장치의 자기장(M)을 기준으로 서로 대향하도록 위치하는 바, 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621-2)에서 발생되는 유도 전류의 흐름이 서로 반대될 수 있다. 일 실시예에서, 도 7a를 참조하면, 차폐 부재를 제1 방향(예: 도 5a 를 기준으로 +Z 방향)으로 바라봤을 때, 수신 코일의 제1 구간(611-1, 621-1)과 제2 구간(611-2, 621- 2)에 흐르는 유도 전류의 방향이 서로 반대일 수 있다. 예를 들어, 도 7a에 도시된 것과 같이, 외부 전자 장치 의 자기장(M)이 수신 코일에 대해 도 7a를 기준으로 + Z 방향으로 통과하면 수신 코일의 제1 구간 (611-1, 621-1)에는 시계 방향으로 회전하는 유도 전류(I1)발생하고, 수신 코일의 제2 구간(611-2, 621- 2)에는 반시계 방향으로 회전하는 유도 전류(I2)가 발생할 수 있다. 다양한 실시예에 따르면, 전자 장치에는 제1 무선 충전 안테나와 제2 무선 충전 안테나 중 어느 하나만 배치될 수 있다. 일 실시예에서, 도 8을 참조하면, 전자 장치에 제1 무선 충전 안테나만 배치 될 수 있다. 전자 장치에 제1 무선 충전 안테나만 배치된 경우, 전자 장치의 충전 효율은 다음 의 표 1과 같다. 표 1 입력 전압 입력 전류출력 전압출력 전류입력 전력 출력 전력 효율 Volt(V)Ampere(A)Volt(V)Ampere(A)Watt(W)Watt(W)Eff, %비교 실시예에 따 른 무선 충전 안테 나의 충전 효율(Default)9.004 1.378 8.975 0.985 12.408 8.84071.3 본 문서에 개시된 실시예에 따른 제1 수신 코일의 2/3 일 때 충전 효율9.007 1.411 8.968 0.994 12.709 8.91470.1 본 문서에 개시된 실시예에 따른 제1 수신 코일의 절반 일 때 충전 효율9.001 1.661 8.966 0.995 14.951 8.92159.7 표 1을 살펴보면, 제1 무선 충전 안테나의 제1 수신 코일이 비교 실시예에 따른 무선 충전 안테나 의 수신 코일의 절반 또는 2/3 크기를 가지도록 차폐 부재에 감겼을 때, 전자 장치의 충전 효율을 확인할 수 있다. 일 실시예에서, 상술한 바와 같이, 제1 무선 충전 안테나는 제1 수신 코일 - 제1 차폐 부재 - 제1 수신 코일 순으로 적층된 형태일 수 있다. 따라서, 비교 실시예에 따른 무선 충 전 안테나의 수신 코일의 절반을 사용하더라도 제1 차폐 부재의 제1 면(612-1)과 제2 면(612- 2)에 수신 코일이 감기는 바, 일정 수준 이상의 유도 전류를 확보할 수 있다. 따라서, 제1 무선 충전 안테 나는 일정 수준 이상의 전력을 전자 장치의 배터리에 공급하여 일정 수준 이상의 충전 효율을 확보할 수 았다.한편, 제1 무선 충전 안테나의 제1 수신 코일에 발생하는 유도 자기장의 자속은 제1 수신 코일의 권선 중심(C1)에 밀집될 수 있다. 이에 따라, 유도 자기장의 자속은 제1 수신 코일의 최 내각 내부원(패턴)의 크기에 비례할 수 있다. 따라서, 제1 무선 충전 안테나의 제1 수신 코일이 반원 형태인 경우보다 2/3 원 형태를 가질 때, 전자 장치의 충전 효율이 상승할 수 있다. 도 9a는, 본 문서에 개시된 다양한 실시예에 따른 제1 무선 충전 안테나와 제2 무선 충전 안테나가 형성한 하나 의 패턴이 전자 장치의 중심부에 위치하는 상태를 도시한 도면이다. 도 9b는, 본 문서에 개시된 다양한 실시예 에 따른 전자 장치가 슬라이드 아웃(slide-out)된 상태에서 제1 무선 충전 안테나와 제2 무선 충전 안테나의 위 치 관계를 설명하는 도면이다. 도 9c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 슬라이드 인 (slide-in)된 상태에서 제1 무선 충전 안테나와 제2 무선 충전 안테나의 위치 관계를 설명하는 도면이다. 도 10a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치에 제1 무선 충전 안테나와 제2 무선 충전 안테나가 배치된 경우에 전자 장치의 무선 충전 효율을 설명하기 위한 도면이다. 도 10b는, 본 문서에 개시된 다양한 실 시예에 따른 제1 무선 충전 안테나와 제2 무선 충전 안테나가 특정 방향으로 이격되어 배치된 경우에 전자 장치 의 무선 충전 효율을 설명하기 위한 도면이다. 다양한 실시예에 따르면, 상술한 무선 충전 안테나는 제1 하우징과 제2 하우징에 각각 배치될 수 있다. 이하 설명의 편의를 위해 제1 하우징에 배치되는 무선 충전 안테나를 제1 무선 충전 안테나 , 제2 하우징에 배치되는 무선 충전 안테나를 제2 무선 충전 안테나로 설명하기로 한다. 다양한 실시예에 따르면, 제1 무선 충전 안테나는 제1 수신 코일의 권선 중심인 제1 중심(C1)이 전자 장치의 중심부와 인접하도록 제1 하우징에 배치될 수 있다. 또한, 제2 무선 충전 안테나는 제2 수신 코일의 권선 중심인 제2 중심(C2)이 전자 장치의 중심부와 인접하도록 제2 하우징에 배치 될 수 있다. 여기서 전자 장치의 중심부란 전자 장치가 외부 전자 장치를 이용하여 무선 충전될 수 있도록 전자 장치 내에 설정된 무선 충전 범위(P)(예: 도 9b 및 도 9c 참조)를 의미할 수 있다. 일 실시예에서, 도 9a 및 도 9b를 참조하면, 제1 무선 충전 안테나는 전자 장치가 슬라이드 아웃된 상태에서 제1 수신 코일의 제1 중심(C1)이 전자 장치의 중심부와 인접 또는 일치하도록 제1 하우징 에 배치될 수 있다. 마찬가지로 제2 무선 충전 안테나는 전자 장치가 슬라이드 아웃된 상태에서 제2 수신 코일의 제2 중심(C2)이 전자 장치의 중심부와 인접 또는 일치하도록 제2 하우징에 배 치될 수 있다. 다양한 실시예에 따르면, 도 9a 및 도 9b에 도시된 것과 같이, 제1 무선 충전 안테나와 제2 무선 충전 안 테나는 제1 수신 코일과 제2 수신 코일이 하나의 동심원 패턴을 형성하도록 제1 하우징과 제2 하우징에 각각 배치될 수 있다. 일 실시예에서, 도 9a 및 도 9b를 참조하면, 제1 무선 충전 안테나와 제2 무선 충전 안테나는 전자 장치가 슬라이드 아웃(slide-out)된 상태에서, 제1 수신 코일 의 권선 중심인 제1 중심(C1)과 제2 수신 코일의 권선 중심인 제2 중심(C2)이 서로 인접하거나 일치 하도록 제1 하우징과 제2 하우징에 각각 배치될 수 있다. 예를 들어, 도 9b를 참조하면, 전자 장치 가 슬라이드 아웃(slide-out)된 상태에서 전자 장치를 제1 방향(예: 도 9b를 기준으로 +Z 방향)으로 바라봤을 때, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2)이 서로 인접하거나 일 치할 수 있다. 따라서, 제1 무선 충전 안테나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일은 하나의 동심원 패턴을 형성할 수 있다. 상술한 바와 같이, 제1 수신 코일의 제1 구간 (611-1)과 제2 구간(611-2)은 서로 대응되는 형태이며, 제2 수신 코일의 제1 구간(621-1)과 제2 구간 (621-2)도 서로 대응되는 형태이다. 따라서, 제1 수신 코일의 제1 구간(611-1)과 제2 수신 코일의 제 1 구간(621-1) 및 제1 수신 코일의 제2 구간(611-2)과 제2 수신 코일의 제2 구간(621-2)은 각각 하 나의 동심원 패턴을 형성할 수 있다. 다양한 실시예에 따르면, 제1 수신 코일과 제2 수신 코일은 전자 장치가 슬라이드 아웃된 상태 에서 동심원 패턴을 형성하도록 다양한 형태로 감길 수 있다. 일 실시예에서, 도 10a를 참조하면, 제1 수신 코일은 제1 구간(611-1)과 제2 구간(611-2)이 반원 형태를 가지도록 제1 차폐 부재의 제1 면(612-1)과 제2 면(612-2)에 교번하여 감길 수 있다. 이러한 경우, 제2 수 신 코일은 제1 구간(621-1)과 제2 구간(621-2)이 반원 형태를 가지도록 제2 차폐 부재의 제1 면 (622-1)과 제2 면(622-2)에 교번하여 감길 수 있다. 다른 실시예에서, 도 10b를 참조하면, 제1 수신 코일은 제1 구간(611-1)과 제2 구간(611-2)이 2/3 원 형태 를 가지도록 제1 차폐 부재의 제1 면(612-1)과 제2 면(612-2)에 교번하여 감길 수 있다. 예를 들어, 제1 수신 코일의 제1 구간(611-1)과 제2 구간(611-2)은 모두 2/3 원 형태를 가지며, 제1 구간(611-1)과 제2 구간(611-2)은 실질적으로 대응되는 형태일 수 있다. 제2 수신 코일은 제1 구간(621-1)과 제2 구간(621- 2)이 1/3 원 형태를 가지도록 제2 차폐 부재의 제1 면(622-1)과 제2 면(622-2)에 교번하여 감길 수 있다. 예를 들어, 제2 수신 코일의 제1 구간(621-1)과 제2 구간(621-2)은 모두 1/3 원 형태를 가지며, 제1 구간 (621-1)과 제2 구간(621-2)은 실질적으로 대응되는 형태일 수 있다. 따라서, 전자 장치가 슬라이드 아웃된 상태에서 제1 방향(예: 도 10b를 기준으로 + Z 방향)으로 전자 장치를 바라봤을 때, 제1 수신 코일과 제2 수신 코일은 하나의 동심원 패턴을 형성할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 제1 무선 충전 안테나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일은 전자 장치가 슬라이드 아웃된 상태에서 송신 코일의 형태와 대응되는 동심원 패턴을 형성할 수 있다. 일 실시예에서, 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동 심원 패턴은 외부 전자 장치의 송신 코일과 실질적으로 대응되는 형태일 수 있다. 예를 들어, 제1 수신 코일 과 제2 수신 코일이 형성한 하나의 동심원 패턴의 최내각 패턴과 최외각 패턴은 송신 코일의 최내각 패턴 및 최외각 패턴과 대응될 수 있다. 전자 장치 내부에 배치된 무선 충전 안테나의 수신 코일 이 외부 전자 장치의 송신 코일과 대응되는 형태일수록 전자 장치의 충전 효율이 상승할 수 있다. 한편, 외부 전자 장치의 송신 코일에서 발생하는 자기장(M)의 자속은 송신 코일의 권선 중심에 밀집된다. 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴의 중심은 제1 수신 코일의 권선 중심 인 제1 중심(C1) 및 제2 수신 코일의 권선 중심인 제2 중심(C2)과 인접 또는 일치할 수 있다. 제1 수신 코 일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2)은 전자 장치의 중심부에 위치할 수 있다. 이에 따라, 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴의 중심은 전자 장치의 중심부에 위치할 수 있다. 따라서, 사용자가 외부 전자 장치의 송신 코일의 권선 중심을 전자 장치의 중심 부에 위치시킬 경우, 송신 코일의 권선 중심에 밀집된 자기장(M)의 자속이 제1 수신 코일과 제2 수신 코일 이 형성한 하나의 동심원 패턴의 중심에 밀집될 수 있다. 따라서, 전자 장치의 충전 효율이 상승할 수 있다. 다양한 실시예에 따르면, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2) 사이의 거 리(D)는 제1 하우징과 제2 하우징이 슬라이딩 동작을 함에 따라 변할 수 있다. 일 실시예에서, 도 9b를 참조하면, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2) 사이의 거리(D)는 디스플레이 모듈이 수용 공간에서 인출된 상태(예: 슬라이드 아웃 상태)일 때, 최대로 가까워질 수 있다. 일 실시예에서, 도 9b를 참조하면, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일 의 제2 중심(C2) 사이의 거리(D)는 디스플레이 모듈이 수용 공간으로 인입된 상태(예: 슬라이드 인상태)일 때, 최대로 멀어질 수 있다. 예를 들어, 제2 무선 충전 안테나는 전자 장치가 슬라이드 인 상태에서 제1 무선 충전 안테나에 대해 제1 방향(예: 도 9c를 기준으로 + Z 방향)에 위치할 수 있다. 따라 서, 슬라이드 인 상태에서 전자 장치를 제1 방향으로 바라봤을 때, 제1 무선 충전 안테나와 제2 무선 충전 안테나는 중첩된 형태일 수 있다. 제1 수신 코일과 제2 수신 코일은 전자 장치가 슬 라이드 아웃된 상태일 때, 제1 중심(C1)과 제2 중심(C2)이 최대로 가까워지거나 일치하여 하나의 동심원을 형성 할 수 있다. 따라서, 전자 장치가 슬라이드 아웃 상태에서 슬라이드 인 상태로 전환되면 제1 수신 코일 의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2) 사이의 거리(D)는 최대로 멀어질 수 있다. 다양한 실시예에 따르면, 제1 무선 충전 안테나와 제2 무선 충전 안테나는 전자 장치가 슬라이 드 인 된 상태에서 수용 공간 내에 인입된 디스플레이 모듈과 중첩되지 않는 위치에 배치될 수 있다. 예를 들어, 도 9b 및 도 9c를 참조하면, 제1 무선 충전 안테나와 제2 무선 충전 안테나는 수용 공간 내에서 디스플레이 모듈이 위치하는 공간 이외의 나머지 공간에 배치될 수 있다. 다양한 실시예에 따르면, 도 9c에 도시된 것과 같이, 제2 무선 충전 안테나는 전자 장치가 슬라이드 인 된 상태에서 제1 무선 충전 안테나에 대해 제1 방향에 위치할 수 있다. 따라서, 슬라이드 인 상태에서 전자 장치를 제1 방향(예: 도 9c를 기준으로 + Z 방향)으로 바라봤을 때, 제1 무선 충전 안테나와 제 2 무선 충전 안테나는 중첩된 형태일 수 있다. 이러한 경우, 제1 무선 충전 안테나는 후면 커버와 인 접하게 위치하여 외부 전자 장치와 상대적으로 근접할 수 있다. 따라서, 제1 수신 코일의 권선 중심(C1)에 는 외부 전자 장치의 자기장(M)의 자속이 인가될 수 있다. 제1 수신 코일에는 외부 전자 장치의 자기장 (M)에 의한 유도 전류가 발생하며, 이를 통해 배터리에 전력을 공급할 수 있다. 다양한 실시예에 따르면, 제1 무선 충전 안테나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일이 도 9b를 기준으로 Z 축 방향으로 바라봤을 때, 하나의 동심원 패턴을 형성한 경우의 충전 효 율은 다음의 표 2와 같다. 표 2 입력 전압 입력 전류출력 전압출력 전류입력 전력출력 전력효율 Volt(V)Ampere(A)Volt(V)Ampere(A)Watt(W)Watt(W)Eff, % 비교 실시예에 따 른 무선 충전 안테 나의 충전 효율 (Default)9.004 1.378 8.975 0.98512.4088.84071.3 제1 수신 코일과 제2 수신 코일이 반원 형태일 때 충전 효율9.001 1.497 8.964 0.99613.4748.92866.3 제1 수신 코일이 2/3 원 형태 제2 수신 코일이 1/3원 형태일 때 충전 효율9.004 1.405 8.969 0.99712.6518.94270.7 표 2를 살펴보면, 도 10a에 도시된 것과 같이, 제1 수신 코일의 제1 구간(611-1)과 제2 구간(611-2)이 반 원 형태를 가지고 제2 수신 코일의 제1 구간(621-1)과 제2 구간(621-2)이 반원 형태를 가지는 경우에 전자 장치의 충전 효율을 확인할 수 있다. 제1 수신 코일과 제2 수신 코일은 전자 장치가 슬라 이드 아웃된 상태에서 하나의 동심원 패턴을 형성하는 바, 표 1에 도시된 바와 같이, 반원 형태의 제1 수신 코 일을 포함하는 제1 무선 충전 안테나을 한 개만 사용했을 때와 비교하여 전자 장치의 충전 효율 이 상승함을 확인할 수 있다.또한, 표 2를 살펴보면, 도 10a에 도시된 것과 같이, 제1 수신 코일의 제1 구 간(611-1)과 제2 구간(611-2)이 2/3 원 형태를 가지고, 제2 수신 코일의 제1 구간(621-1)과 제2 구간 (621-2)이 1/3 원 형태를 가지는 경우에 전자 장치의 충전 효율을 확인할 수 있다. 제1 수신 코일과 제2 수신 코일은 전자 장치가 슬라이드 아웃된 상태에서 하나의 동심원 패턴을 형성하는 바, 2/3원 형태의 제1 수신 코일을 포함하는 제1 무선 충전 안테나을 한 개만 사용했을 때와 비교하여 전자 장 치의 충전 효율이 상승함을 확인할 수 있다.상술한 바와 같이, 수신 코일에서 발생하는 유도 자기장의 자속은 수신 코일의 권선 중심(C1, C2)에 밀집된다. 이에 따라, 유도 자기장의 자속은 수신 코일의 최내각 패턴의 크기에 비례할 수 있다. 따라서, 제1 수신 코일이 반원 형태인 경우보다 2/3원 형태를 가질 때, 자속의 수가 더 확보되는 바, 전자 장치 의 충전 효율이 상승할 수 있다. 다양한 실시예에 따르면, 도 10b에 도시된 것과 같이, 제1 무선 충전 안테나가 제1 하우징에 배치되 고, 제2 무선 충전 안테나가 제2 하우징에 배치됨에 따라 제2 수신 코일은 제1 수신 코일 에 대해 제1 방향(도 10b를 기준으로 +Z 방향)으로 이격될 수 있다. 도 10b를 참조하면, 제2 무선 충전 안테나 는 일정 거리(T)만큼 제1 무선 충전 안테나에 대해 제1 방향(예: 도 10b를 기준으로 +Z 방향)으로 이 격될 수 있다. 예를 들어, 제2 무선 충전 안테나의 제2 구간(621-2)은 제1 무선 충전 안테나의 제1 구간(611-1)에 대해 일정 거리(T) 만큼 이격될 수 있다. 따라서, 제1 무선 충전 안테나의 제1 구간(611- 1)와 제2 무선 충전 안테나의 제1 구간(621-1)은 동일 평면 상에 위치하지 않을 수 있으며, 제1 무선 충전 안테나의 제1 구간(611-2)와 제2 무선 충전 안테나의 제2 구간(621-2)은 동일 평면 상에 위치하지 않 을 수 있다. 이러한 경우의 전자 장치의 충전 효율은 다음과 같다. 표 3 입력 전압 입력 전류출력 전압출력 전류입력 전력 출력 전력 효율 Volt(V)Ampere(A)Volt(V)Ampere(A)Watt(W)Watt(W)Eff, % 비교 실시예에 따 른 무선 충전 안테 나의 충전 효율(Default)9.004 1.378 8.975 0.98512.4088.84071.3 제1 수신 코일과 제2 수신 코일이 반원 형태이며, 수 신 코일 간 gap이 존재할 때 충전 효율9.003 1.521 8.967 0.99713.6948.94066.3 제1 수신 코일이 2/3 원 형태 제2 수신 코일이 1/3원 형태이며, 수신 코일 간 gap 이 존재할 때 충전 효율9.002 1.411 8.966 0.99712.7028.93970.4 표 3을 살펴보면, 도 10b에 도시된 것과 같이, 제2 무선 충전 안테나가 제1 무선 충전 안테나에 대해 도 10b를 기준으로 + Z 방향으로 일정 거리(T) 만큼 이격되더라도 표 2에 기재된 전자 장치의 충전 효율과 미세한 차이만이 존재함을 알 수 있다. 따라서, 제1 하우징과 제2 하우징이 슬라이딩 가능하도록 제2 하우징이 제1 하우징에 대해 + Z 방향으로 이격되더라도 무선 충전 안테나를 이용한 전자 장치 의 충전 효율에 영향을 미치지 않을 수 있다.본 문서에 개시된 다양한 실시예에 따르면, 전자 장치가 슬라이드 아웃 상태에서 전자 장치를 제1 방향(예: 도 9b를 기준으로 +Z 방향)으로 바라봤을 때, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2)은 전자 장치의 중심부와 인접 또는 일치 하도록 전자 장치 내에 배치된다. 또한, 전자 장치가 슬라이드 아웃된 상태에서 제1 무선 충전 안테 나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일은 하나의 동심원 패턴을 형 성할 수 있다. 따라서, 제1 수신 코일과 제2 수신 코일이 형성한 동심원 패턴의 중심은 전자 장치 의 중심부와 인접 또는 일치할 수 있다. 한편, 사용자들은 전자 장치의 중심부에 무선 충전 안테나의 수신 코일의 권선 중심이 위치하는 것으로 생각하는 것이 일반적이다. 전자 장치의 중심부와 수신 코일의 권선 중심(C1, C2)이 일치할수 록 수신 코일의 권선 중심(C1, C2)과 송신 코일의 권선 중심이 일치할 수 있다. 따라서, 제1 수신 코일 과 제2 수신 코일이 형성한 동심원 패턴의 중심과 전자 장치의 중심부가 인접 또는 일치하므로 제1 수신 코일과 제2 수신 코일이 형성한 동심원 패턴의 중심과 외부 전자 장치의 송신 코일의 권선중심이 일치할 수 있다. 또한, 상술한 바와 같이, 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴은 외부 전자 장치의 송신 코일과 실질적으로 대응되는 형태일 수 있다. 전자 장치 내부에 배치된 무선 충전 안테나 의 수신 코일이 외부 전자 장치의 송신 코일과 대응되는 형태일수록 전자 장치의 충전 효율이 상승할 수 있다. 특히, 외부 전자 장치의 송신 코일에서 발생하는 자기장(M)의 자속은 송신 코일의 권선 중심에 밀집된다. 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴의 중심은 제1 수신 코일 의 권선 중심인 제1 중심(C1) 및 제2 수신 코일의 권선 중심인 제2 중심(C2)과 인접 또는 일치할 수 있다. 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴의 중심이 외부 전자 장치의 송신 코일 의 권선 중심과 일치할수록 송신 코일의 자기장(M)에 의한 자속과 수신 코일의 유도 자기장에 의한 자속이 수신 코일의 권선 중심(C1, C2)과 송신 코일의 권선 중심에 밀집될 수 있다. 따라서, 사용자가 전자 장치 의 중심부에 외부 전자 장치의 송신 코일의 권선 중심을 일치시키면, 송신 코일의 권선 중심과 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴의 중심이 일치하므로 전자 장치의 충전 효 율이 상승할 수 있다. 도 11a 및 도 11b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 펼침 상태(unfolded stage)를 전면 및 후면에서 바라본 도면들이다. 도 12a 및 도 12b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 접힘 상태(folded state)를 전면 및 후면에서 바라본 도면들이다. 이하에서 설명되는 전자 장치는 도 4a 내지 도 10b에서 설명되었던 전자 장치와 다른 폼펙터의 전자 장치로써, 제1 하우징과 제2 하우징이 접힘가능하게 연결될 수 있다. 도 11a 내지 도 12b를 참고하면, 전자 장치는, 서로에 대하여 접힘 가능하도록 힌지 장치를 통해 폴딩축 (A)을 기준으로 회동 가능하게 결합되는 한 쌍의 하우징들(710, 720)(예: 폴더블 하우징구조), 한 쌍의 하우징 들(710, 720)을 통해 배치되는 제1 디스플레이(예: 플렉서블(flexible) 디스플레이, 폴더블(foldable) 디 스플레이 또는 메인 디스플레이) 및/또는 제2 하우징을 통해 배치된 제2디스플레이(예: 서브 디스플 레이)를 포함할 수 있다. 한 실시예에 따르면, 힌지 장치의 적어도 일부는 제1 하우징 및 제2 하우징(72 0)을 통해 외부로부터 보이지 않도록 배치되고, 펼침 상태에서, 접힘 가능한 부분을 커버하는 힌지 하우징(81 0)을 통해 외부로부터 보이지 않게 배치될 수 있다. 한 실시예에 따르면, 힌지 장치는 복수의 기어들을 포함하 는 기어 조립체 및 기어 조립체를 통해 회전하는 힌지 샤프트들에 결합되고, 캠 연동 동작을 수행하는 복수의 힌지 캠들을 포함하는 힌지 모듈 및 힌지 모듈과 제1 하우징 및 제2 하우징을 연결하는 힌지 플레이 트들을 포함할 수 있다. 본 문서에서는 제1 디스플레이가 배치된 면은 전자 장치의 전면으로 정의될 수 있으며, 전면의 반대면은 전자 장치의 후면으로 정의될 수 있다. 또한 전면과 후면 사이의 공간을 둘러 싸는 면은 전자 장치의 측면으로 정의될 수 있다. 다양한 실시예에 따르면, 한 쌍의 하우징들(710, 720)은 힌지 장치를 통해 서로에 대하여 폴딩 가능하게 배치되 는 제1 하우징 및 제2 하우징을 포함할 수 있다. 한 실시예에 따르면, 한 쌍의 하우징들(710, 720)은 도 11a 내지 도 12b에 도시된 형태 및 결합으로 제한되지 않으며, 다른 형상이나 부품의 조합 및/또는 결합에 의해 구현될 수도 있다. 한 실시예에 따르면, 제1 하우징과 제2 하우징은 폴딩축(A)을 기준으로 양측 에 배치되고, 폴딩축(A)에 대하여 전체적으로 대칭인 형상을 가질 수 있다. 어떤 실시예에 따르면, 제1 하우징 과 제2 하우징은 폴딩축(A)을 기준으로 비대칭으로 접힐 수도 있다. 한 실시예에 따르면, 제1 하우징 및 제2 하우징은 전자 장치가 펼침 상태(unfolded stage)인지, 접힘 상태(folded state)인지, 또는 중간 상태(intermediate state)인지 여부에 따라 서로 이루는 각도나 거리가 서로 달라질 수 있다. 다양한 실시예에 따르면, 제1 하우징은 전자 장치의 펼침 상태에서, 힌지 장치에 연결되며, 전자 장 치의 전면을 향하도록 배치된 제1면, 제1면의 반대 방향을 향하는 제2면, 및/또는 제1면 과 제2면 사이의 제1공간의 적어도 일부를 둘러싸는 제1측면 부재를 포함할 수 있다. 한 실시예 에 따르면, 제2 하우징은 전자 장치의 펼침 상태에서, 힌지 장치와 연결되며, 전자 장치의 전면 을 향하도록 배치된 제3면, 제3면의 반대 방향을 향하는 제4면, 및/또는 제3면 및 제4면 사이의 제2공간의 적어도 일부를 둘러싸는 제2측면 부재를 포함할 수 있다. 한 실시예에 따르면, 제 1면은, 펼침 상태에서 제3면과 실질적으로 동일한 방향을 향하고, 접힘 상태에서 제3면과 마주보도록 적어도 부분적으로 대면될 수 있다. 한 실시예에 따르면, 전자 장치는 제1 하우징과, 제2 하 우징의 구조적 결합을 통해 제1 디스플레이를 수용하도록 형성된 리세스를 포함할 수도 있다. 한 실시예에 따르면, 리세스는 제1 디스플레이와 실질적으로 동일한 크기를 가질 수 있다. 한 실시예 에 따르면, 제1 하우징은, 제1 디스플레이를 위에서 바라볼 때, 제1측면 부재와 결합되고, 제1 디스플레이의 가장자리와 중첩 배치됨으로써, 제1 디스플레이의 가장자리가 외부로부터 보이지 않도 록 커버하는 제1보호 프레임(713a)(예: 제1장식 부재)을 포함할 수 있다. 한 실시예에 따르면, 제1보호 프레임 (713a)은 제1측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따르면, 제2 하우징은, 제1 디스플 레이를 위에서 바라볼 때, 제2측면 부재와 결합되고, 제1 디스플레이의 가장자리와 중첩 배치됨 으로써, 제1 디스플레이의 가장자리가 외부로부터 보이지 않도록 커버하는 제2보호 프레임(723a)(예: 제2 장식 부재)을 포함할 수 있다. 한 실시예에 따르면, 제2보호 프레임(723a)은 제1측면 부재와 일체로 형성 될 수도 있다. 어떤 실시예에서, 제1보호 프레임(713a)과 제2보호 프레임(723a)은 생략될 수도 있다. 다양한 실시예에 따르면, 힌지 하우징(예: 힌지 커버)은, 제1 하우징과 제2 하우징 사이에 배치 되고, 힌지 하우징에 배치된 힌지 장치의 일부(예: 적어도 하나의 힌지 모듈)를 가리도록 배치될 수 있다. 한 실시예에 따르면, 힌지 하우징은, 전자 장치의 펼침 상태, 접힘 상태 또는 중간 상태에 따라, 제1 하우징 및 제2 하우징의 일부에 의해 가려지거나, 외부로 노출될 수 있다. 예컨대, 전자 장치가 펼침 상태인 경우, 힌지 하우징의 적어도 일부는 제1 하우징 및 제2 하우징에 의해 가려져 실질 적으로 노출되지 않을 수 있다. 한 실시예에 따르면, 전자 장치가 접힘 상태인 경우, 힌지 하우징의 적어도 일부는 제1 하우징 및 제2 하우징 사이에서 외부로 노출될 수 있다. 한 실시예에 따르면, 제1 하우징 및 제2 하우징이 소정의 각도를 이루는(folded with a certain angle) 중간 상태인 경우, 힌 지 하우징은 제1 하우징 및 제2 하우징 사이에서 전자 장치의 외부로 적어도 부분적으로 노출될 수 있다. 예컨대, 힌지 하우징이 외부로 노출되는 영역은 완전히 접힌 상태보다 적을 수 있다. 한 실시예에 따르면, 힌지 하우징은 곡면을 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치가 펼침 상태(예: 도 11a 및 도 11b의 상태)인 경우, 제1 하우징 및 제2 하우징은 약 180도의 각도를 이루며, 제1 디스플레이의 제1영역(730a), 제2영역(730b) 및 폴 딩 영역(730c)은 동일 평면을 이루며, 실질적으로 동일 방향(예: z 축 방향)을 향하도록 배치될 수 있다. 다른 실시예로, 전자 장치가 펼침 상태인 경우, 제1 하우징은 제2 하우징에 대하여 약 360도의 각도 로 회동하여 제2면과 제4면이 마주보도록 반대로 접힐 수도 있다(out folding 방식). 다양한 실시예에 따르면, 전자 장치가 접힘 상태(예: 도 12a 및 도 12b의 상태)인 경우, 제1 하우징 의 제1면 및 제2 하우징의 제3면은 서로 마주보게 배치될 수 있다. 이러한 경우, 제1 디스플레 이의 제1영역(730a)과 제2영역(730b)은 폴딩 영역(730c)를 통해, 서로 좁은 각도(예: 0도 ~ 약 10도 범위)를 형성하며, 서로 마주보도록 배치될 수도 있다. 한 실시예에 따르면, 폴딩 영역(730c)은 적어도 일부가 소정의 곡률을 가지는 곡형으로 변형될 수 있다. 한 실시예에 따르면, 전자 장치가 중간 상태인 경우, 제1 하우징 및 제2 하우징은 서로 소정의 각도(a certain angle)로 배치될 수 있다. 이러한 경우, 제1 디 스플레이의 제1영역(730a)과 제2영역(730b)은 접힘 상태보다 크고, 펼침 상태보다 작은 각도를 형성할 수 있으며, 폴딩 영역(730c)의 곡률은 접힘 상태인 경우보다 작을 수 있고, 펼침 상태보다 클 수 있다. 어떤 실시 예에서, 제1 하우징과 제2 하우징은, 힌지 장치를 통해, 접힘 상태에서 펼침 상태 사이의 지정된 폴 딩 각도에서 멈출 수 있는 각도를 형성할 수 있다(free stop 기능). 어떤 실시예에서, 제1 하우징과 제2 하우징은, 힌지 장치를 통해, 지정된 변곡 각도를 기준으로, 펼쳐지는 방향 또는 접히는 방향으로, 가압받 으면서 지속적으로 동작될 수도 있다. 다양한 실시예에 따르면, 전자 장치는, 제1 하우징 및/또는 제2 하우징에 배치되는 적어도 하나 의 디스플레이(730, 800), 입력 장치, 음향 출력 장치(727, 728), 센서 모듈(717a, 717b, 726), 카메라 모듈(716a, 716b, 725), 키 입력 장치, 인디케이터(미도시 됨) 또는 커넥터 포트 중 적어도 하나를 포함할 수 있다. 어떤 실시예에서, 전자 장치는, 구성 요소들 중 적어도 하나를 생략하거나 적어도 하나의 다른 구성 요소를 추가적으로 포함할 수 있다. 다양한 실시예에 따르면, 적어도 하나의 디스플레이(730, 800)는, 제1 하우징의 제1면으로부터 힌지 장치를 통해 제2 하우징의 제3면의 지지를 받도록 배치되는 제1 디스플레이(예: 플렉서블 디스 플레이 모듈) 및 제2 하우징의 내부 공간에서 제4면을 통해 적어도 부분적으로 외부로부터 보일 수 있게 배치되는 제2디스플레이를 포함할 수 있다. 어떤 실시예에서, 제2디스플레이는 제1 하우징(71 0)의 내부 공간에서 제2면을 통해 외부로부터 보일 수 있게 배치될 수도 있다. 한 실시예에 따르면, 제1디스플레이는, 전자 장치의 펼침 상태에서 주로 사용될 수 있으며, 제2디스플레이는, 전자 장치 의 접힘 상태에서 주로 사용될 수 있다. 한 실시예에 따르면, 전자 장치는 중간 상태의 경우, 제1 하 우징과 제2 하우징의 폴딩 각도에 기반하여 제1 디스플레이 및/또는 제2디스플레이를 사용 가능하게 제어할 수 있다. 다양한 실시예에 따르면, 제1 디스플레이는, 한 쌍의 하우징들(710, 720)에 의해 형성된 수용 공간에 배치 될 수 있다. 예를 들어, 제1 디스플레이는 한 쌍의 하우징들(710, 720)에 의해 형성되는 리세스 (recess)에 배치될 수 있으며, 펼침 상태에서, 전자 장치의 전면의 실질적으로 대부분을 차지하도록 배치될 수 있다. 한 실시예에 따르면, 제1 디스플레이는, 적어도 일부 영역이 평면 또는 곡면으로 변형될 수 있는 플렉서블 디스플레이 모듈을 포함할 수 있다. 한 실시예에 따르면, 제1 디스플레이는 제1 하우징 과 대면하는 제1영역(730a) 및 제2 하우징과 대면하는 제2영역(730b)을 포함할 수 있다. 한 실시예에 따르면, 제1 디스플레이는 폴딩축(A)을 기준으로, 제1영역(730a)의 일부 및 제2영역(730b)의 일부를 포함 하는 폴딩 영역(730c)을 포함할 수 있다. 한 실시예에 따르면, 폴딩 영역(730c)의 적어도 일부는 힌지 장치와 대응되는 영역을 포함할 수 있다. 한 실시예에 따르면, 제1 디스플레이의 영역 구분은 한 쌍의 하우징 (710, 720) 및 힌지 장치에 의한 예시적인 물리적 구분일 뿐, 실질적으로 한 쌍의 하우징(710, 720) 및 힌지 장 치를 통해 제1 디스플레이는 이음매 없는(seamless), 하나의 전체 화면으로 표시될 수 있다. 한 실시예에 따르면, 제1영역(730a)과 제2영역(730b)은 폴딩 영역(730c)을 기준으로 전체적으로 대칭인 형상을 가지거나, 부 분적으로 비대칭 형상을 가질 수 있다. 다양한 실시예에 따르면, 전자 장치는 제1 하우징의 제2면에 배치되는 제1후면 커버 및 제 2 하우징의 제4면에 배치되는 제2후면 커버를 포함할 수 있다. 어떤 실시예에서, 제1후면 커버 의 적어도 일부는 제1측면 부재와 일체로 형성될 수도 있다. 어떤 실시예에서, 제2후면 커버의 적어도 일부는 제2측면 부재와 일체로 형성될 수도 있다. 한 실시예에 따르면, 제1후면 커버 및 제2 후면 커버 중 적어도 하나의 커버는 실질적으로 투명한 플레이트(예: 다양한 코팅 레이어들을 포함하는 글 라스 플레이트, 또는 폴리머 플레이트) 또는 불투명한 플레이트로 형성될 수 있다. 한 실시예에 따르면, 제1후 면 커버는, 예를 들어, 코팅 또는 착색된 유리, 세라믹, 폴리머, 금속(예: 알루미늄, 스테인레스 스틸 (STS), 또는 마그네슘), 또는 상기 물질들 중 적어도 둘의 조합과 같은, 불투명한 플레이트에 의하여 형성될 수 있다. 한 실시예에 따르면, 제2후면 커버는, 예를 들어, 글래스 또는 폴리머와 같은, 실질적으로 투명한 플레이트를 통해 형성될 수 있다. 따라서, 제2디스플레이는, 제2 하우징의 내부 공간에서, 제2후면 커버를 통해 외부로부터 보일 수 있게 배치될 수 있다. 다양한 실시예에 따르면, 입력 장치는, 마이크를 포함할 수 있다. 어떤 실시예에서, 입력 장치는 소 리의 방향을 감지할 수 있도록 배치되는 복수 개의 마이크들을 포함할 수 있다. 한 실시예에 따르면, 음향 출력 장치(727, 728)는 스피커들을 포함할 수 있다. 한 실시예에 따르면, 음향 출력 장치(727, 728)는, 제2 하우징 의 제4면을 통해 배치되는 통화용 리시버 및 제2 하우징의 제2측면 부재의 적어도 일 부를 통해 배치되는 외부 스피커를 포함할 수 있다. 어떤 실시예에서, 입력 장치 , 음향 출력 장치 (727, 728) 및 커넥터는 제1 하우징 및/또는 제2 하우징의 공간들에 배치되고, 제1 하우징 및/또는 제2 하우징에 형성된 적어도 하나의 홀을 통하여 외부 환경에 노출될 수 있다. 어떤 실시예 에서, 제1 하우징 및/또는 제2 하우징에 형성된 홀들은 입력 장치 및 음향 출력 장치(727, 72 8)을 위하여 공용으로 사용될 수 있다. 어떤 실시예에서, 음향 출력 장치(727, 728)는 제1 하우징 및/또는 제2 하우징에 형성된 홀이 배제된 채, 동작되는 스피커(예: 피에조 스피커)를 포함할 수도 있다. 다양한 실시예에 따르면, 카메라 모듈(716a, 716b, 725)은, 제1 하우징의 제1면에 배치되는 제1카메 라 모듈(716a), 제1 하우징의 제2면에 배치되는 제2카메라 모듈(716b) 및/또는 제2 하우징의 제 4면에 배치되는 제3카메라 모듈를 포함할 수 있다. 한 실시예에 따르면, 전자 장치는 제2카메라 모듈(716b) 근처에 배치되는 플래시를 포함할 수 있다. 한 실시예에 따르면, 플래시는, 예를 들어, 발광 다이오드 또는 제논 램프(xenon lamp)를 포함할 수 있다. 한 실시예에 따르면, 카메라 모듈들(716a, 716b, 725)은 하나 또는 복수의 렌즈들, 이미지 센서, 및/또는 이미지 시그널 프로세서를 포함할 수 있다. 어떤 실시 예에서, 카메라 모듈들(716a, 716b, 725) 중 적어도 하나의 카메라 모듈은 2개 이상의 렌즈들(예: 광각 및 망원 렌즈) 및 이미지 센서들을 포함하고, 제1 하우징 및/또는 제2 하우징의 어느 한 면에 함께 배치될 수 도 있다. 다양한 실시예에 따르면, 센서 모듈(717a, 717b, 726)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환 경 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 한 실시예에 따르면, 센서 모듈(717a, 717b,726)은, 제1 하우징의 제1면에 배치되는 제1센서 모듈(717a), 제1 하우징의 제2면에 배치 되는 제2센서 모듈(717b) 및/또는 제2 하우징의 제4면에 배치되는 제3센서 모듈을 포함할 수 있 다. 어떤 실시예에서, 센서 모듈(717a, 717b, 726)은 제스처 센서, 그립 센서, 컬러 센서, IR(infrared) 센서, 조도 센서, 초음파 센서, 홍채 인식 센서, 또는 거리 검출 센서(예: TOF(time of flight) 센서 또는 LiDAR(light detection and ranging)) 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따르면, 전자 장치는, 도시되지 않은 센서 모듈, 예를 들어, 기압 센서, 마그네틱 센서, 생체 센서, 온도 센서, 습도 센서, 또는 지문 인식 센서 중 적어도 하나를 더 포함할 수 있다. 어떤 실시예에서, 지문 인식 센서는 제1 하우징의 제1측면 부재 및/또는 제2 하우징의 제2측면 부재 중 적어도 하나의 측면 부재를 통해 배치될 수도 있다. 다양한 실시예에 따르면, 키 입력 장치는, 제1 하우징의 제1측면 부재를 통해 외부로 노출되도 록 배치될 수 있다. 어떤 실시예에서, 키 입력 장치는 제2 하우징의 제2측면 부재를 통해 외부 로 노출되도록 배치될 수도 있다. 어떤 실시예에서, 전자 장치는 상기 키 입력 장치들 중 일부 또는 전부를 포함하지 않을 수 있고, 포함되지 않은 키 입력 장치는 적어도 하나의 디스플레이(730, 800)상에 소프트 키와 같은 다른 형태로 구현될 수 있다. 다른 실시예로, 키 입력 장치는 적어도 하나의 디스플레이 (730, 800)에 포함된 압력 센서를 이용하여 구현될 수 있다. 다양한 실시예에 따르면, 커넥터 포트는, 외부 전자 장치와 전력 및/또는 데이터를 송수신하기 위한 커넥 터(예: USB 커넥터 또는 IF 모듈(interface connector port 모듈))를 포함할 수 있다. 어떤 실시예에서, 커넥 터 포트는 외부 전자 장치와 오디오 신호를 송수신하기 위한 기능을 함께 수행하거나, 오디오 신호의 송수 신 기능을 수행하기 위한 별도의 커넥터 포트(예: 이어잭 홀)를 더 포함할 수도 있다. 다양한 실시예에 따르면, 카메라 모듈들(716a, 716b, 725) 중 적어도 하나의 카메라 모듈(716a, 725), 센서 모 듈들(717a, 717b, 726) 중 적어도 하나의 센서 모듈(717a, 726) 및/또는 인디케이터는 적어도 하나의 디스플레 이(730, 800)를 통해 노출되도록 배치될 수 있다. 예컨대, 적어도 하나의 카메라 모듈(716a, 725), 적어도 하나 의 센서 모듈(717a, 726) 및/또는 인디케이터는 적어도 하나의 하우징(710, 720)의 내부 공간에서, 적어도 하나 의 디스플레이(730, 800)의 활성화 영역(display area) 아래에 배치되고, 커버 부재(예: 제1 디스플레이의 윈도우층(미도시 됨) 및/또는 제2후면 커버)까지 천공된 오프닝 또는 투명 영역을 통해 외부 환경과 접할 수 있도록 배치될 수 있다. 한 실시예에 따르면, 적어도 하나의 디스플레이(730, 800)와 적어도 하나의 카메라 모듈(716a, 725)이 대면하는 영역은 컨텐츠를 표시하는 영역의 일부로서 일정 투과율을 갖는 투과 영역으로 형 성될 수 있다. 한 실시예에 따르면, 투과 영역은 약 5% ~ 약20% 범위의 투과율을 갖도록 형성될 수 있다. 이러 한 투과 영역은 이미지 센서로 결상되어 화상을 생성하기 위한 광이 통과하는 적어도 하나의 카메라 모듈(716a, 725)의 유효 영역(예: 화각 영역)과 중첩되는 영역을 포함할 수 있다. 예를 들어, 디스플레이(730, 800)의 투과 영역은 주변 보다 픽셀의 밀도가 낮은 영역을 포함할 수 있다. 예를 들어, 투과 영역은 오프닝을 대체할 수 있 다. 예를 들어, 적어도 하나의 카메라 모듈(716a, 725)은 언더 디스플레이 카메라(UDC, under display camera) 또는 언더 패널 카메라(UPC, under panel camera)를 포함할 수 있다. 다른 실시예로, 일부 카메라 모듈 또는 센 서 모듈(717a, 726)은 디스플레이를 통해 시각적으로 노출되지 않고 그 기능을 수행하도록 배치될 수도 있다. 예컨대, 디스플레이(730, 800)(예: 디스플레이 패널) 아래에 배치된 카메라 모듈(716a, 725) 및/또는 센서 모듈 (717a, 726)과 대면하는 영역은, UDC(under display camera) 구조로써, 천공된 오프닝이 불필요할 수도 있다. 다양한 실시예에 따르면, 제1 무선 충전 안테나와 제2 무선 충전 안테나는 제1 수신 코일과 제2 수신 코일이 하나의 동심원 패턴을 형성하도록 제1 하우징과 제2 하우징에 각각 배치될 수 있다. 일 실시예에서, 제1 무선 충전 안테나와 제2 무선 충전 안테나는 전자 장치)가 펼침 상태 (unfolded state)에서, 제1 수신 코일의 권선 중심인 제1 중심(C1)과 제2 수신 코일의 권선 중심인 제2 중심(C2)은 서로 인접하거나 일치하도록 제1 하우징과 제2 하우징에 각각 배치될 수 있다. 예를 들어, 도 11a를 참조하면, 전자 장치가 펼침 상태에서 전자 장치를 제1 방향(예: 도 11a를 기준으로 Z 축 방향)으로 바라봤을 때, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2)이 서로 인접하거나 일치할 수 있다. 제1 무선 충전 안테나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일은 하나의 동심원 패턴을 형성할 수 있다. 상술한 바와 같이, 제1 수신 코일의 제1 구 간(611-1)과 제2 구간(611-2)은 서로 대응되는 형태이며, 제2 수신 코일의 제1 구간(621-1)과 제2 구간 (621-2)도 서로 대응되는 형태이다. 따라서, 제1 수신 코일의 제1 구간(611-1)과 제2 수신 코일의 제 1 구간(621-1) 및 제1 수신 코일의 제2 구간(611-2)과 제2 수신 코일의 제2 구간(621-2)은 각각 하나의 동심원 패턴을 형성할 수 있다. 다양한 실시예에 따르면, 전자 장치가 펼침 상태에서 전자 장치를 제1 방향(예: 도 11a를 기준으로 Z 축 방향)으로 바라봤을 때, 제1 수신 코일의 제1 중심(C1)과 제2 수신 코일의 제2 중심(C2)은 전자 장치의 중심과 인접 또는 일치할 수 있다. 본 문서에 개시된 다양한 실시예에 따르면, 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴은 외부 전자 장치(예: 도 1의 전자 장치)의 송신 코일과 실질적으로 대응되는 형태일 수 있다. 전자 장치 내부에 배치된 무선 충전 안테나의 수신 코일이 외부 전자 장치의 송신 코일과 대응되는 형태일수록 전자 장치의 충전 효율이 상승할 수 있다. 특히, 외부 전자 장치의 송신 코일에서 발생하는 자 기장(M)의 자속은 송신 코일의 권선 중심에 밀집된다. 제1 수신 코일과 제2 수신 코일이 형성한 하나 의 동심원 패턴의 중심은 제1 수신 코일의 권선 중심인 제1 중심(C1) 및 제2 수신 코일의 권선 중심 인 제2 중심(C2)과 인접 또는 일치할 수 있다. 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심 원 패턴의 중심이 외부 전자 장치의 송신 코일의 권선 중심과 일치할수록 송신 코일의 자기장(M)에 의한 자속과 수신 코일의 유도 자기장에 의한 자속이 수신 코일의 권선 중심(C1, C2)과 송신 코일의 권선 중심에 밀집될 수 있다. 따라서, 사용자가 전자 장치의 중심에 외부 전자 장치의 송신 코일의 권선 중심을 일치시 키면, 송신 코일의 권선 중심과 제1 수신 코일과 제2 수신 코일이 형성한 하나의 동심원 패턴의 중심 이 일치하므로 전자 장치의 충전 효율이 상승할 수 있다. 다양한 실시예에 따르면, 도 12a 및 도 12b를 참조하면, 전자 장치가 접힘 상태(folded state)에서 전자 장치를 제1 방향(예: 도 11a를 기준으로 Z 축 방향)으로 바라봤을 때, 제1 무선 충전 안테나의 제1 수신 코일과 제2 무선 충전 안테나의 제2 수신 코일은 중첩된 상태일 수 있다. 이러한 경우, 제 1 무선 충전 안테나는 후면 커버와 인접하게 위치하여 외부 전자 장치와 상대적으로 근접할 수 있다. 따라서, 제1 무선 충전 안테나의 제1 수신 코일에는 외부 전자 장치의 자기장(M)이 인가될 수 있다. 제1 수신 코일에는 외부 전자 장치의 자기장(M)에 의한 유도 전류가 발생하며, 이를 통해 배터리에 전력을 공급할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 전자 장치(예: 도 1의 전자 장치, 도 4a의 전자 장치 또는 도 11a의 전자 장치)는, 제1 하우징(예: 도 4a의 제1 하우징 또는 도 11a의 제1 하우징), 상기 제1 하우징에 대한 상대 위치가 가변되도록 상기 제1 하우징에 연결되는 제2 하우징(예: 도 4a의 제2 하우징 또는 도 11a의 제2 하우징), 차폐 부재, 상기 차폐 부재의 제1 면(예: 도 9b를 기준으로 - Z 방향을 향하는 면)과 상기 제1 면의 반대 면인 제2 면(예: 도 9b를 기준으로 + Z 방향을 향하는 면)에 교번하여 감기는 수신 코일을 포함하고, 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 무선 충전 안테나 및 상기 무선 충전 안테나와 전기적으로 연결되는 배터리(battery)를 포함할 수 있다. 또한, 상기 무선 충전 안테나의 수신 코일은, 상기 차폐 부재의 제1 면과 상기 차폐 부재의 제2 면이 실질적으 로 대응되는 패턴을 가지도록 감길 수 있다. 또한, 상기 무선 충전 안테나는, 상기 수신 코일의 권선 중심(예: 도 10a의 제1 중심(C1) 또는 제2 중심(C2))이 상기 전자 장치의 중심과 인접하도록 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치될 수 있다. 또한, 상기 무선 충전 안테나는, 제1 차폐 부재, 상기 제1 차폐 부재의 제1 면(612-1)과 상기 제1 면의 반 대 면인 제2 면(612-2)에 교번하여 감기는 제1 수신 코일을 포함하고, 상기 제1 하우징에 배치되는 제1 무 선 충전 안테나 및 제2 차폐 부재, 상기 제2 차폐 부재의 제1 면(622-1)과 상기 제1 면의 반대 면인 제2 면(622-2)에 교번하여 감기는 제2 수신 코일을 포함하고, 상기 제2 하우징에 배치되는 제2 무선 충전 안테나를 포함할 수 있다. 또한, 상기 제1 무선 충전 안테나는, 상기 제1 수신 코일의 권선 중심인 제1 중심(C1)을 포함하고, 상기 제2 무 선 충전 안테나는, 상기 제2 수신 코일의 권선 중심인 제2 중심(C2)을 포함하고, 상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는, 상기 제1 수신 코일의 제1 중심과 상기 제2 수신 코일의 제2 중심 중 적어도 하 나가 상기 전자 장치의 중심과 인접하도록 배치될 수 있다. 또한, 상기 제2 하우징은, 상기 제1 하우징에 대하여 슬라이딩 가능하게 결합되고, 상기 제2 하우징의 슬라이딩 에 따라 적어도 일부가 상기 전자 장치 내의 수용 공간으로 인입되거나 상기 수용 공간에서 인출되는 디스 플레이 모듈(예: 도 1의 디스플레이 모듈)을 더 포함하고, 상기 제2 하우징이 상기 제1 하우징에 대하여 슬라이딩 동작을 함에 따라 상기 제1 무선 충전 안테나의 제1 중심과 상기 제2 무선 충전 안테나의 제2 중 심 사이의 거리(D)가 변화할 수 있다. 또한, 상기 제1 무선 충전 안테나의 제1 중심과 상기 제2 무선 충전 안테나의 제2 중심 사이의 거리는 상기 디 스플레이 모듈이 상기 수용 공간으로 인입된 상태일 때 보다 상기 디스플레이 모듈이 상기 수용 공간으로 인출 된 상태일 때 거리가 가까울 수 있다. 또한, 상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는, 상기 디스플레이 모듈이 상기 수용 공간에서 인출된 상태에서 상기 전자 장치의 일면(예: 도 9b를 기준으로 - Z 방향을 향하는 면)을 제1 방향(예: 도 9b를 기준으로 + Z 방향)으로 바라봤을 때, 하나의 동심원 패턴을 형성할 수 있다. 또한, 상기 제2 무선 충전 안테나는, 상기 디스플레이 모듈이 상기 수용 공간으로 인입된 상태에서 상기 제1 무 선 충전 안테나에 대해 제1 방향(예: 도 9b를 기준으로 + Z 방향)에 위치하고, 상기 제1 무선 충전 안테나는, 상기 전자 장치의 일면(예: 도 9b를 기준으로 - Z 방향을 향하는 면)을 상기 제1 방향으로 바라봤을 때, 적어도 일부가 상기 제2 무선 충전 안테나와 중첩될 수 있다. 또한, 상기 디스플레이 모듈이 상기 수용 공간으로 인입된 상태에서 상기 제1 무선 충전 안테나의 제1 중심과 상기 전자 장치의 중심 사이의 거리는 상기 제2 무선 충전 안테나의 제2 중심과 상기 전자 장치의 중심 사이의 거리보다 가까울 수 있다. 또한, 상기 제1 하우징과 상기 제2 하우징은 접힘 가능하게 연결될 수 있다. 또한, 상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는, 상기 제1 하우징과 상기 제2 하우징이 펼쳐 진 상태에서 상기 전자 장치의 일면(예: 도 12a를 기준으로 Z 축 방향을 향하는 면)을 제1 방향(예: 도 12a를 기준으로 Z 축 방향)으로 바라봤을 때, 하나의 동심원 패턴을 형성할 수 있다. 또한, 상기 제2 무선 충전 안테나는, 상기 제1 하우징과 상기 제2 하우징이 접혀진 상태에서 상기 제1 무선 충 전 안테나에 대해 제1 방향(예: 도 12a를 기준으로 Z 축 방향)에 위치하고, 상기 제1 무선 충전 안테나는, 상기 전자 장치의 일면(예: 도 12a를 기준으로 Z 축 방향을 향하는 면)을 제1 방향으로 바라봤을 때, 적어도 일부가 상기 제2 무선 충전 안테나와 중첩될 수 있다. 또한, 상기 수신 코일은, 외부에서 인가된 자기장에 의해 유도 전류가 발생하고, 상기 전자 장치의 일면을 제1 방향(예: 도 12a를 기준으로 Z 축 방향)으로 바라봤을 때, 상기 차폐 부재의 제1 면 배치된 상기 수신 코일의 일부와 상기 차폐 부재의 제2 면에 배치된 상기 수신 코일의 일부에 흐르는 유도 전류의 방향이 서로 반대일 수 있다. 또한, 상기 차폐 부재는, 상기 무선 충전 안테나의 전자기력 및/또는 동작 주파수에 의해서 발생하는 노이즈를 차폐할 수 있다. 본 문서에 개시된 다양한 실시예에 따른 제1 하우징(예: 도 4a의 제1 하우징 또는 도 11a의 제1 하우징 )과 제2 하우징(예: 도 4a의 제2 하우징 또는 도 11a의 제2 하우징)이 슬라이딩 가능하게 결합 되는 전자 장치(예: 도 1의 전자 장치, 도 4a의 전자 장치 또는 도 11a의 전자 장치)에 포함되 어 상기 제1 하우징 및 상기 제2 하우징 중 적어도 하나에 배치되는 무선 충전 안테나는, 차폐 부재 및 상기 차폐 부재의 제1 면(예: 도 9b를 기준으로 - Z 방향을 향하는 면)과 상기 제1 면의 반대 면인 제2 면 (예: 도 9b를 기준으로 + Z 방향을 향하는 면)을 교번하여 감기는 수신 코일을 포함할 수 있다. 또한, 상기 무선 충전 안테나의 수신 코일은, 상기 차폐 부재의 제1 면과 상기 차폐 부재의 제2 면이 실질적으 로 대응되는 패턴을 가지도록 감길 수 있다. 또한, 상기 무선 충전 안테나는, 제1 차폐 부재, 상기 제1 차폐 부재의 제1 면(612-1)과 상기 제1 면의 반 대 면인 제2 면(612-2)에 교번하여 감기는 제1 수신 코일을 포함하고 상기 제1 하우징에 배치되는 제1 무 선 충전 안테나 및 제2 차폐 부재, 상기 제2 차폐 부재의 제1 면(622-1)과 상기 제1 면의 반대 면인 제2 면(622-2)에 교번하여 감기는 제2 수신 코일을 포함하고 상기 제2 하우징에 배치되는 제2 무선 충전 안테나를 포함할 수 있다. 또한, 상기 제1 무선 충전 안테나는, 상기 제1 수신 코일의 권선 중심인 제1 중심(C1)을 포함하고, 상기 제2 무 선 충전 안테나는, 상기 제2 수신 코일의 권선 중심인 제2 중심(C2)을 포함하고, 상기 제2 하우징이 상기 제1하우징에 대하여 슬라이딩 동작을 함에 따라 상기 제1 무선 충전 안테나의 제1 중심과 상기 제2 무선 충전 안테 나의 제2 중심 사이의 거리(D)가 변화할 수 있다. 또한, 상기 제1 무선 충전 안테나와 상기 제2 무선 충전 안테나는, 상기 전자 장치의 디스플레이 모듈(예: 도 1의 디스플레이 모듈)이 상기 전자 장치의 수용 공간에서 인출된 상태에서 상기 전자 장치의 일면 (예: 도 9b를 기준으로 - Z 방향을 향하는 면)을 제1 방향(예: 도 9b를 기준으로 + Z 방향)으로 바라봤을 때, 하나의 동심원 패턴을 형성할 수 있다. 그리고 본 명세서와 도면에 개시된 본 문서에 개시된 실시예들은 본 문서에 개시된 실시예에 따른 기술 내용을 쉽게 설명하고 본 문서에 개시된 실시예의 이해를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 문서에 개시된 실시예의 범위를 한정하고자 하는 것은 아니다. 따라서 본 문서에 개시된 다양한 실시예의 범위는 여기에 개시 된 실시예들 이외에도 본 문서에 개시된 다양한 실시예의 기술적 사상을 바탕으로 도출되는 모든 변경 또는 변 형된 형태가 본 문서에 개시된 다양한 실시예의 범위에 포함되는 것으로 해석되어야 한다."}
{"patent_id": "10-2022-0029324", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도면의 설명과 관련하여, 동일 또는 유사한 구성 요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있 다. 도 1은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블럭도이다. 도 2는, 다양한 실시예들에 따른, 전력 관리 모듈 및 배터리에 대한 블럭도이다. 도 3은, 다양한 실시예들에 따른, 전자 장치의 무선 통신 모듈, 전력 관리 모듈, 및 안테나 모듈에 대한 블럭도 이다. 도 4a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 닫힌 상태에서의 사시도이다. 도 4b는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 열린 상태에서의 사시도이다. 도 4c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 분리 사시도이다. 도 5a는, 본 문서에 개시된 다양한 실시예에 따른 도 4a에 도시된 전자 장치를 A-A선을 따라 절개한 단면도이다. 도 5b는, 본 문서에 개시된 다양한 실시예에 따른 도 4b에 도시된 전자 장치를 B-B선을 따라 절개한 단면도이다. 도 6는, 비교 실시예에 따른 무선 충전 안테나를 나타내는 도면이다. 도 7a는, 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나와 무선 충전 안테나에 유도된 유도 전류의 방향을 나타내는 도면이다. 도 7b는, 일 실시예에서 무선 충전 안테나의 제1 영역과 제2 영역이 연결되는 구조를 나타낸 도면이다. 도 7c는, 다른 실시예에서 무선 충전 안테나의 제1 영역과 제2 영역이 연결되는 구조를 나타낸 도면이다. 도 8은, 본 문서에 개시된 다양한 실시예에 따른 무선 충전 안테나의 접힘 정도에 따른 전자 장치의 무선 충전 효율을 설명하기 위한 도면이다. 도 9a는, 본 문서에 개시된 다양한 실시예에 따른 제1 무선 충전 안테나와 제2 무선 충전 안테나가 형성한 하나 의 패턴이 전자 장치의 중심부에 위치하는 상태를 도시한 도면이다. 도 9b는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 슬라이드 아웃(slide-out)된 상태에서 제1 무선 충전 안테나와 제2 무선 충전 안테나의 위치 관계를 설명하는 도면이다. 도 9c는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치가 슬라이드 인(slide-in)된 상태에서 제1 무선 충 전 안테나와 제2 무선 충전 안테나의 위치 관계를 설명하는 도면이다. 도 10a는, 본 문서에 개시된 다양한 실시예에 따른 전자 장치에 제1 무선 충전 안테나와 제2 무선 충전 안테나 가 배치된 경우에 전자 장치의 무선 충전 효율을 설명하기 위한 도면이다. 도 10b는, 본 문서에 개시된 다양한 실시예에 따른 제1 무선 충전 안테나와 제2 무선 충전 안테나가 특정 방향 으로 이격되어 배치된 경우에 전자 장치의 무선 충전 효율을 설명하기 위한 도면이다. 도 11a 및 도 11b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 펼침 상태(unfolded state)를 전면 및 후면에서 바라본 도면들이다. 도 12a 및 도 12b는 본 문서에 개시된 다양한 실시예에 따른 전자 장치의 접힘 상태(folded state)를 전면 및 후면에서 바라본 도면들이다."}
