{"patent_id": "10-2023-0116978", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0034697", "출원번호": "10-2023-0116978", "발명의 명칭": "디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼", "출원인": "윤재영", "발명자": "윤재영"}}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말과 연동하여 동작하는 디지털 콘텐츠 제공 플랫폼에서 수행되는 디지털 콘텐츠 생성 방법으로서,상기 사용자 단말에 디지털 콘텐츠를 제공하는 단계;사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성하는 단계;디지털 콘텐츠를 동적으로 생성하는 딥 러닝 기반의 생성형 인공지능 모델을 준비하는 단계; 및상기 개인화 데이터를 반영하여 상기 생성형 인공지능 모델을 이용하여 상기 사용자를 대상으로 하는 자동 생성콘텐츠를 생성하는 단계; 를 포함하는,디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 생성형 인공지능 모델은,자동 생성 콘텐츠의 기초가 되는 복수의 기초 콘텐츠를 멀티 레이어로 분해하여 복수의 특징 요소를 추출하고,상기 복수의 특징 요소를 조합하여 상기 자동 생성 콘텐츠를 생성하는, 디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 디지털 콘텐츠 생성 방법은,생성된 상기 자동 생성 콘텐츠에 대한 상기 사용자의 피드백을 바탕으로 상기 자동 생성 콘텐츠를 재 생성하거나 또는 확정하는 단계; 를 더 포함하는, 디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 사용자 별 개인화 데이터를 생성하는 단계는,사용자의 콘텐츠 소비 이력을 기초로 소통 지수, 활동 패턴 및 통계 특성 데이터를 생성하여 상기 개인화 데이터를 생성하는 단계; 를 포함하는,디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 사용자 별 개인화 데이터를 생성하는 단계는,상기 사용자의 상기 콘텐츠 소비 이력 중 대화 상대, 대화 내용, 대화 빈도, 콘텐츠 공유 및 추천 대상, 공유및 추천 빈도, 리뷰 내용, 댓글 내용, 리뷰 빈도 및 댓글 빈도를 기초로 상기 소통 지수를 생성하는 단계;상기 사용자의 상기 콘텐츠 소비 이력 중 좋아요 내역, 관심 콘텐츠, 관심사, 콘텐츠 판매 데이터 및 콘텐츠 구매 패턴 데이터를 기초로 상기 활동 패턴을 생성하는 단계; 및공개특허 10-2025-0034697-3-상기 사용자의 국가, 지역, 성별, 나이 및 언어 데이터를 기초로 상기 통계 특성 데이터를 생성하는 단계; 를더 포함하는,디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제2항에 있어서, 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 단계는,상기 복수의 기초 콘텐츠 각각에 대하여 콘텐츠를 복수의 멀티 레이어로 분해하여 복수의 특징 요소를 추출하는단계; 상기 사용자의 상기 개인화 데이터를 기초로 복수의 특징 요소 중 적어도 일부에 대하여 가중치를 부여하여 상기 생성형 인공지능 모델에 제공하는 단계; 및상기 복수의 특징 요소를 상기 생성형 인공지능 모델에 입력하고, 상기 생성형 인공지능 모델을 이용하여 상기복수의 특징 요소 중 적어도 일부를 조합하여 상기 자동 생성 콘텐츠를 생성하는 단계; 를 포함하는, 디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 단계는,상기 사용자의 상기 개인화 데이터를 기초로 상기 복수의 기초 콘텐츠를 선별하는 단계; 를 더 포함하는,디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 특징 요소는,분해된 복수의 멀티 레이어 중 적어도 하나와 연관되어 설정되는,디지털 콘텐츠 생성 방법."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "컴퓨터 판독 가능한 인스트럭션들(instructions)을 저장하고 있는 저장 매체에 있어서,상기 인스트럭션들은, 컴퓨팅 장치에 의해 실행될 때, 상기 컴퓨팅 장치로 하여금,사용자 단말에 디지털 콘텐츠를 제공하는 동작;사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성하는 동작;디지털 콘텐츠를 동적으로 생성하는 딥 러닝 기반의 생성형 인공지능 모델을 준비하는 동작; 및상기 개인화 데이터를 반영하여 상기 생성형 인공지능 모델을 이용하여 상기 사용자를 대상으로 하는 자동 생성콘텐츠를 생성하는 동작; 을 수행하도록 하는, 저장 매체."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "사용자 단말과 연동하여 동작하는 디지털 콘텐츠 제공 플랫폼으로서, 상기 디지털 콘텐츠 제공 플랫폼은,공개특허 10-2025-0034697-4-상기 사용자 단말에 디지털 콘텐츠를 제공하는 콘텐츠 관리부;사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성하는 개인화 데이터 생성부; 및상기 개인화 데이터를 반영하여 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 딥 러닝 기반의 생성형 인공지능 모델;을 포함하는,디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 생성형 인공지능 모델은,자동 생성 콘텐츠의 기초가 되는 복수의 기초 콘텐츠를 멀티 레이어로 분해하여 복수의 특징 요소를 추출하고,상기 복수의 특징 요소를 조합하여 상기 자동 생성 콘텐츠를 생성하는, 디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 디지털 콘텐츠 제공 플랫폼은,생성된 상기 자동 생성 콘텐츠에 대한 상기 사용자의 피드백을 바탕으로 상기 자동 생성 콘텐츠를 재 생성하거나 또는 확정하도록 하는 피드백 관리부; 를 더 포함하는,디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 개인화 데이터 생성부는,상기 사용자의 상기 콘텐츠 소비 이력 중 대화 상대, 대화 내용, 대화 빈도, 콘텐츠 공유 및 추천 대상, 공유및 추천 빈도, 리뷰 내용, 댓글 내용, 리뷰 빈도 및 댓글 빈도를 기초로 소통 지수를 생성하는 소통 지수 생성모듈;상기 사용자의 상기 콘텐츠 소비 이력 중 좋아요 내역, 관심 콘텐츠, 관심사, 콘텐츠 판매 데이터 및 콘텐츠 구매 패턴 데이터를 기초로 활동 패턴을 생성하는 활동 패턴 생성 모듈; 상기 사용자의 국가, 지역, 성별, 나이 및 언어 데이터를 기초로 통계 특성 데이터를 생성하는 통계 특성 생성모듈; 및 상기 사용자의 상기 소통 지수, 상기 활동 패턴 및 상기 통계 특성 데이터를 생성하여 상기 개인화 데이터를 생성하는 개인화 데이터 생성 모듈; 을 포함하는,디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 생성형 인공지능 모델은,상기 복수의 기초 콘텐츠 각각에 대하여 콘텐츠를 복수의 멀티 레이어로 분해하여 복수의 특징 요소를 추출하는레이어 분해 모듈;상기 사용자의 상기 개인화 데이터를 기초로 복수의 특징 요소 중 적어도 일부에 대하여 가중치를 부여하여 상기 생성형 인공지능 모델에 제공하는 가중치 설정 모듈; 및상기 복수의 특징 요소를 상기 생성형 인공지능 모델에 입력하고, 상기 생성형 인공지능 모델을 이용하여 상기공개특허 10-2025-0034697-5-복수의 특징 요소 중 적어도 일부를 조합하여 상기 자동 생성 콘텐츠를 생성하는 콘텐츠 생성 인공지능 모델;을 포함하는,디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 레이어 분해 모듈은,상기 사용자의 상기 개인화 데이터를 기초로 상기 복수의 기초 콘텐츠를 선별하는,디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제14항에 있어서, 상기 특징 요소는,분해된 복수의 멀티 레이어 중 적어도 하나와 연관되어 설정되는,디지털 콘텐츠 제공 플랫폼."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 일 기술적 측면에 따른 디지털 콘텐츠 생성 방법은, 사용자 단말과 연동하여 동작하는 디지털 콘텐츠 제공 플랫폼에서 수행되는 디지털 콘텐츠 생성 방법으로서, 상기 사용자 단말에 디지털 콘텐츠를 제공하는 단계, 사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성하는 단계, 디지털 콘텐츠를 동적으로 생성 하는 딥 러닝 기반의 생성형 인공지능 모델을 준비하는 단계 및 상기 개인화 데이터를 반영하여 상기 생성형 인 공지능 모델을 이용하여 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 단계를 포함한다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼에 관한 것이다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "IT 기술의 발전에 따라 스마트 폰 등의 휴대형 기기의 보급이 확산되고 그에 따라 디지털 콘텐츠의 소비 환경이 더욱더 커지고 넓어지고 있다. 소비되는 디지털 콘텐츠의 종류도 단순한 감상용 콘텐츠 뿐만이 아니라 광고, 홍보 등의 목적이나, 특정 기호에 적합한 콘텐츠의 생산 및 배포 등이 더욱더 다양하게 이루어지고 있다. 또한, 광고 콘텐츠 등과 같이, 이러한 디지털 콘텐츠의 상업적 활용 또한 광범위하게 이루어지고 있다. 그러나, 종래의 콘텐츠의 제작 방식은 사람에 의하여 이루어져야만 하므로, 콘텐츠의 생성에 시간이 많이 걸리 고, 제작자에 따라 콘텐츠의 내용이나 특징 등이 설정되므로 다양한 유저의 니즈를 개별적으로 맞출 수 없는 한 계 등이 존재하였다. 이에 따라, 각 개인별 니즈, 취향 등을 반영하여 자동적으로 디지털 콘텐츠를 생성하는 기술에 대한 니즈가 커 지고 있다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 일 기술적 측면은 상기한 종래 기술의 문제점을 해결하기 위한 것으로써, 디지털 콘텐츠를 자동적으 로 생성하는 비(非) 대화형 생성형 인공지능을 이용하여 디지털 콘텐츠를 자동적으로 생성하는, 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼을 제공하는 것이다. 또한, 본 발명의 일 기술적 측면은, 디지털 콘텐츠를 멀티 레이어로 분해하고 이들을 다양한 컴비네이션으로 재 조합하는 비(非) 대화형 생성형 인공지능을 이용함으로써, 디지털 콘텐츠의 생성 품질을 높이는 한편 매우 다양 한 디지털 콘텐츠의 자동적인 생성이 가능하게 할 수 있는, 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼을 제공하는 것이다. 또한, 본 발명의 일 기술적 측면은, 사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성하고, 개인화 데이터를 생성형 인공지능에 반영하여 사용자 개개인의 취향에 보다 밀접하게 디지털 콘텐츠를 자동적으 로 생성할 수 있는, 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼을 제공하는 것이다. 또한, 본 발명의 일 기술적 측면은, 콘텐츠의 생성 및 제공에 관련된 딥 러닝 모델들을 자동적으로 학습 및 강 화시키는 자동 머신러닝 기술을 적용하여 딥 러닝 모델의 성능을 자동적으로 최신화 할 수 있는, 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼을 제공하는 것이다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 2, "content": "본 발명의 상기 목적과 여러 가지 장점은 이 기술분야에 숙련된 사람들에 의해 본 발명의 바람직한 실시예로부 터 더욱 명확하게 될 것이다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 기술적 측면은 디지털 콘텐츠 생성 방법을 제안한다. 상기 디지털 콘텐츠 생성 방법은, 사용자 단 말과 연동하여 동작하는 디지털 콘텐츠 제공 플랫폼에서 수행되는 디지털 콘텐츠 생성 방법으로서, 상기 사용자 단말에 디지털 콘텐츠를 제공하는 단계, 사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성 하는 단계, 디지털 콘텐츠를 동적으로 생성하는 딥 러닝 기반의 생성형 인공지능 모델을 준비하는 단계 및 상기 개인화 데이터를 반영하여 상기 생성형 인공지능 모델을 이용하여 상기 사용자를 대상으로 하는 자동 생성 콘텐 츠를 생성하는 단계를 포함한다. 일 실시예에서, 상기 생성형 인공지능 모델은, 자동 생성 콘텐츠의 기초가 되는 복수의 기초 콘텐츠를 멀티 레 이어로 분해하여 복수의 특징 요소를 추출하고, 상기 복수의 특징 요소를 조합하여 상기 자동 생성 콘텐츠를 생 성할 수 있다. 일 실시예에서, 상기 디지털 콘텐츠 생성 방법은, 생성된 상기 자동 생성 콘텐츠에 대한 상기 사용자의 피드백 을 바탕으로 상기 자동 생성 콘텐츠를 재 생성하거나 또는 확정하는 단계를 포함할 수 있다. 일 실시예에서, 상기 사용자 별 개인화 데이터를 생성하는 단계는, 사용자의 콘텐츠 소비 이력을 기초로 소통 지수, 활동 패턴 및 통계 특성 데이터를 생성하여 상기 개인화 데이터를 생성하는 단계를 포함 할 수 있다. 일 실시예에서, 상기 사용자 별 개인화 데이터를 생성하는 단계는, 상기 사용자의 상기 콘텐츠 소비 이력 중 대 화 상대, 대화 내용, 대화 빈도, 콘텐츠 공유 및 추천 대상, 공유 및 추천 빈도, 리뷰 내용, 댓글 내용, 리뷰 빈도 및 댓글 빈도를 기초로 상기 소통 지수를 생성하는 단계, 상기 사용자의 상기 콘텐츠 소비 이력 중 좋아요 내역, 관심 콘텐츠, 관심사, 콘텐츠 판매 데이터 및 콘텐츠 구매 패턴 데이터를 기초로 상기 활동 패턴을 생성 하는 단계 및 상기 사용자의 국가, 지역, 성별, 나이 및 언어 데이터를 기초로 상기 통계 특성 데이터를 생성하 는 단계를 더 포함 할 수 있다. 일 실시예에서, 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 단계는, 상기 복수의 기초 콘텐츠 각각에 대하여 콘텐츠를 복수의 멀티 레이어로 분해하여 복수의 특징 요소를 추출하는 단계, 상기 사용자의 상 기 개인화 데이터를 기초로 복수의 특징 요소 중 적어도 일부에 대하여 가중치를 부여하여 상기 생성형 인공지 능 모델에 제공하는 단계 및 상기 복수의 특징 요소를 상기 생성형 인공지능 모델에 입력하고, 상기 생성형 인 공지능 모델을 이용하여 상기 복수의 특징 요소 중 적어도 일부를 조합하여 상기 자동 생성 콘텐츠를 생성하는 단계를 포함 할 수 있다. 일 실시예에서, 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 단계는, 상기 사용자의 상기 개인화 데이터를 기초로 상기 복수의 기초 콘텐츠를 선별하는 단계를 더 포함 할 수 있다. 일 실시예에서, 상기 특징 요소는, 분해된 복수의 멀티 레이어 중 적어도 하나와 연관되어 설정될 수 있다. 본 발명의 다른 일 기술적 측면은 저장 매체를 제안한다. 상기 저장 매체는 컴퓨터 판독 가능한 인스트럭션들 (instructions)을 저장하고 있는 저장 매체로서, 상기 인스트럭션들은, 컴퓨팅 장치에 의해 실행될 때, 상기 컴 퓨팅 장치로 하여금, 사용자 단말에 디지털 콘텐츠를 제공하는 동작, 사용자의 콘텐츠 소비 이력을 기초로 사용 자 별 개인화 데이터를 생성하는 동작, 디지털 콘텐츠를 동적으로 생성하는 딥 러닝 기반의 생성형 인공지능 모델을 준비하는 동작 및 상기 개인화 데이터를 반영하여 상기 생성형 인공지능 모델을 이용하여 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 동작을 수행하도록 한다. 본 발명의 다른 일 기술적 측면은 디지털 콘텐츠 제공 플랫폼을 제안한다. 상기 디지털 콘텐츠 제공 플랫폼은 사용자 단말과 연동하여 동작하는 디지털 콘텐츠 제공 플랫폼으로서, 상기 사용자 단말에 디지털 콘텐츠를 제공 하는 콘텐츠 관리부, 사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성하는 개인화 데이터 생성부 및 상기 개인화 데이터를 반영하여 상기 생성형 인공지능 모델을 이용하여 상기 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성하는 딥 러닝 기반의 생성형 인공지능 모델을 포함한다. 일 실시예에서, 상기 생성형 인공지능 모델은, 자동 생성 콘텐츠의 기초가 되는 복수의 기초 콘텐츠를 멀티 레 이어로 분해하여 복수의 특징 요소를 추출하고, 상기 복수의 특징 요소를 조합하여 상기 자동 생성 콘텐츠를 생 성할 수 있다. 일 실시예에서, 상기 디지털 콘텐츠 제공 플랫폼은, 생성된 상기 자동 생성 콘텐츠에 대한 상기 사용자의 피드 백을 바탕으로 상기 자동 생성 콘텐츠를 재 생성하거나 또는 확정하도록 하는 피드백 관리부를 더 포함 할 수 있다. 일 실시예에서, 상기 개인화 데이터 생성부는, 상기 사용자의 상기 콘텐츠 소비 이력 중 대화 상대, 대화 내용, 대화 빈도, 콘텐츠 공유 및 추천 대상, 공유 및 추천 빈도, 리뷰 내용, 댓글 내용, 리뷰 빈도 및 댓글 빈도를 기초로 소통 지수를 생성하는 소통 지수 생성 모듈, 상기 사용자의 상기 콘텐츠 소비 이력 중 좋아요 내역, 관 심 콘텐츠, 관심사, 콘텐츠 판매 데이터 및 콘텐츠 구매 패턴 데이터를 기초로 활동 패턴을 생성하는 활동 패턴 생성 모듈, 상기 사용자의 국가, 지역, 성별, 나이 및 언어 데이터를 기초로 통계 특성 데이터를 생성하는 통계 특성 생성 모듈 및 상기 사용자의 상기 소통 지수, 상기 활동 패턴 및 상기 통계 특성 데이터를 생성하여 상기 개인화 데이터를 생성하는 개인화 데이터 생성 모듈을 포함 할 수 있다. 일 실시예에서, 상기 생성형 인공지능 모델은, 상기 복수의 기초 콘텐츠 각각에 대하여 콘텐츠를 복수의 멀티 레이어로 분해하여 복수의 특징 요소를 추출하는 레이어 분해 모듈, 상기 사용자의 상기 개인화 데이터를 기초 로 복수의 특징 요소 중 적어도 일부에 대하여 가중치를 부여하여 상기 생성형 인공지능 모델에 제공하는 가중 치 설정 모듈 및 상기 복수의 특징 요소를 상기 생성형 인공지능 모델에 입력하고, 상기 생성형 인공지능 모델 을 이용하여 상기 복수의 특징 요소 중 적어도 일부를 조합하여 상기 자동 생성 콘텐츠를 생성하는 콘텐츠 생성 인공지능 모델을 포함 할 수 있다. 일 실시예에서, 상기 레이어 분해 모듈은, 상기 사용자의 상기 개인화 데이터를 기초로 상기 복수의 기초 콘텐 츠를 선별 할 수 있다. 일 실시예에서, 상기 특징 요소는, 분해된 복수의 멀티 레이어 중 적어도 하나와 연관되어 설정될 수 있다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 2, "content": "상기한 과제의 해결 수단은, 본 발명의 특징을 모두 열거한 것은 아니다. 본 발명의 과제 해결을 위한 다양한 수단들은 이하의 상세한 설명의 구체적인 실시형태를 참조하여 보다 상세하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 일 실시형태에 따르면, 디지털 콘텐츠를 자동적으로 생성하는 비(非) 대화형 생성형 인공지능을 이용 하여 디지털 콘텐츠를 자동적으로 생성할 수 있는 효과가 있다. 또한, 본 발명의 일 실시형태에 따르면, 디지털 콘텐츠를 멀티 레이어로 분해하고 이들을 다양한 컴비네이션으 로 재 조합하는 비(非) 대화형 생성형 인공지능을 이용함으로써, 디지털 콘텐츠의 생성 품질을 높이는 한편 매 우 다양한 디지털 콘텐츠의 자동적인 생성이 가능하게 수 있는 효과가 있다. 또한, 본 발명의 일 실시형태에 따르면, 사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성 하고, 개인화 데이터를 생성형 인공지능에 반영하여 사용자 개개인의 취향에 보다 밀접하게 디지털 콘텐츠를 자 동적으로 생성할 수 있는 효과가 있다. 또한, 본 발명의 일 실시형태에 따르면, 콘텐츠의 생성 및 제공에 관련된 딥 러닝 모델들을 자동적으로 학습 및 강화시키는 자동 머신러닝 기술을 적용함으로써, 딥 러닝 모델의 성능을 자동적으로 최신화 및 향상시킬 수 있 는 효과가 있다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "상술한 발명의 효과는, 본 출원에 의한 다양한 효과를 모두 열거한 것은 아니며, 이러한 다양한 효과들은 상세 한 설명의 구체적인 실시형태로부터 쉽게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명의 바람직한 실시 형태들을 설명한다. 그러나, 본 발명의 실시형태는 여러 가지 다른 형태로 변형될 수 있으며, 본 발명의 범위가 이하 설명하는 실시"}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "형태로 한정되는 것은 아니다. 또한, 본 발명의 실시형태는 당해 기술분야에서 평균적인 지식을 가진 자에게 본 발명을 더욱 완전하게 설명하기 위해서 제공되는 것이다. 즉, 전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 발명이 속하는 기 술분야에서 통상의 지식을 가진 자가 본 발명의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 발명을 설 명함에 있어서 본 발명과 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다 고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 발명에 따른 바람직한 실시예 를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된 다. 또한, 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들 은 포함되지 않을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한 다. 또한, 이하에서 본 발명에 따른 시스템을 설명하기 위하여 다양한 구성요소 및 그의 하부 구성요소에 대하여 설 명하고 있다. 이러한 구성요소 및 그의 하부 구성요소들은, 하드웨어, 소프트웨어 또는 이들의 조합 등 다양한형태로서 구현될 수 있다. 예컨대, 각 요소들은 해당 기능을 수행하기 위한 전자적 구성으로 구현되거나, 또는 전자적 시스템에서 구동 가능한 소프트웨어 자체이거나 그러한 소프트웨어의 일 기능적인 요소로 구현될 수 있 다. 또는, 전자적 구성과 그에 대응되는 구동 소프트웨어로 구현될 수 있다. 본 명세서에 설명된 다양한 기법은 하드웨어 또는 소프트웨어와 함께 구현되거나, 적합한 경우에 이들 모두의 조합과 함께 구현될 수 있다. 본 명세서에 사용된 바와 같은 \"부(Unit)\", \"서버(Server)\" 및 \"시스템(System)\" 등의 용어는 마찬가지로 컴퓨터 관련 엔티티(Entity), 즉 하드웨어, 하드웨어 및 소프트웨어의 조합, 소프트웨 어 또는 실행 시의 소프트웨어와 등가로 취급할 수 있다. 또한, 본 발명의 시스템에서 실행되는 각 기능은 모듈 단위로 구성될 수 있고, 하나의 물리적 메모리에 기록되거나, 둘 이상의 메모리 및 기록매체 사이에 분산되어 기록될 수 있다. 본 발명의 실시형태를 설명하기 위하여 다양한 순서도가 개시되고 있으나, 이는 각 단계의 설명의 편의를 위한 것으로, 반드시 순서도의 순서에 따라 각 단계가 수행되는 것은 아니다. 즉, 순서도에서의 각 단계는, 서로 동 시에 수행되거나, 순서도에 따른 순서대로 수행되거나, 또는 순서도에서의 순서와 반대의 순서로도 수행될 수 있다. 이하에서 설명하는 본 발명에 따른 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제공 플랫폼의 다양 한 실시예들은, 사람의 노력 없이 인공지능을 이용하여 자동으로 콘텐츠를 생성하는 기술에 관한 것으로서, 특 히, 각 사용자들의 콘텐츠 소비 취향, 시간적 소비 특성 등을 반영하여 동적으로 다양하고 개인화 된 콘텐츠 생 성 인공지능 기술을 개시한다. 또한, 콘텐츠의 생성 시, 하나의 콘텐츠를 복수의 레이어, 즉, 멀티 레이어로 구분하고 서로 다른 콘텐츠의 서 로 다른 레이어들을 조합하여 다양한 콘텐츠를 생성함에도 보다 자연스럽고 정밀한 디지털 콘텐츠를 제공할 수 있도록 한다. 도 1은 본 발명의 일 실시예에 따른 디지털 콘텐츠 제공 플랫폼을 설명하기 위한 도면이고, 도 2는 본 발명의 일 실시예에 따른 디지털 콘텐츠 제공 플랫폼을 통한 디지털 콘텐츠 생성 방법을 설명하는 순서도이다. 도 1 및 도2를 참조하면, 디지털 콘텐츠 제공 플랫폼은 사용자 단말 및 외부 플랫폼과 연동하여 동작한다. 사용자 단말은 디지털 콘텐츠 제공 플랫폼에 접속하여 디지털 콘텐츠 제공 플랫폼에서 제공하는 디지털 콘텐츠를 소비할 수 있다(S202). 여기에서의 소비는, 콘텐츠의 시청, 콘텐츠 생성 뿐만 아니라, 콘텐츠 에 대한 좋아요, 댓글, 링크 등의 반응 행동을 포함한다. 또한 본 명세서에서 디지털 콘텐츠는 콘텐츠에 관한 디지털 데이터를 통칭하는 것으로서, 여기에서의 콘텐츠는 영화, 음악, 영상 등의 저작 창작물 뿐만 아니라 SW 소스 코드 등 다양한 콘텐츠를 포괄하는 의미로서 사용된다. 디지털 콘텐츠 제공 플랫폼은 디지털 콘텐츠를 저장하고 생성할 수 있다. 또한, 디지털 콘텐츠 제공 플랫 폼은 외부 플랫폼과 연동하여 외부 플랫폼으로부터 디지털 콘텐츠를 제공받아 저장할 수 있다 (S201). 디지털 콘텐츠 제공 플랫폼은 저장한 콘텐츠를 사용자 단말에 제공할 뿐만 아니라, 사용자 단말(10 0)의 콘텐츠 소비 성향을 반영하여 사용자 별 개인화 데이터를 생성할 수 있다(S203). 여기에서, 개인화 데이터는 각 사용자 별로 개별적으로 생성되는 개인 사용자에 대한 소비 성향에 기인한 데이 터로서, 사용자의 소통 정도, 활동 패턴, 통계 특성 등을 반영하여 설정될 수 있다. 디지털 콘텐츠 제공 플랫폼은 딥 러닝 기반의 인공신경망인 AI(Artificial Intelligent) 모델을 구비하고 (S204), 이러한 딥 러닝 기반의 인공지능 모델은 자동적으로 디지털 콘텐츠를 생성하는 생성형 모델이다. 디지털 콘텐츠 제공 플랫폼은 이러한 딥 러닝 기반의 생성형 인공지능 모델은 비대화형이며 명시적인 사용 자 입력 없이 완전 자동적으로 디지털 콘텐츠를 생성하는 모델이다. 예컨대, 기존의 인공지능 모델로 유명한 Chat GPT의 일 예를 설명하면, 인터페이스가 대화형이고, 추론모델은 LLM(Large Language Model) 기반 GPT-4이고, 주요 특징은 Generative Pre-trained Transformer로서 사용자 입 력 기반 생성형 AI이며, WEB 3.0 기반으로 탈중앙화, 개인화 콘텐츠콘텐츠, 지능형 웹 등을 서비스 기반으로 가 진다. 반면, 이와 비교하면, 상기 딥 러닝 기반의 생성형 인공지능 모델은 비 대화형 인터페이스로서, 추론모델은 LMM(Large Mining Model) 기반 GPR-1이고, 주요 특징은 Generative Pre-trained Recommender으로서 사용자의 입력 없이 완전 자동으로 동작하는 생성형 AI이며, 서비스 기반으로서 WEB 3.0 Extension, WEB 4.0, 사람-사람, 사람-AI간 경계없는 향상된 상호작용을 제공하는 서비스를 기반으로 하는 점에서 차이가 있다. 디지털 콘텐츠 제공 플랫폼은 이와 같은 딥 러닝 기반의 생성형 인공지능 모델을 이용하여 타겟 사용자-즉, 콘텐츠 생성의 대상이 되는 사용자-의 개인화 데이터를 반영하여 타겟 사용자에 대한 디지털 콘텐츠 를 자동으로 생성할 수 있다(S205). 일 예로, 디지털 콘텐츠 제공 플랫폼은 자동 생성된 디지털 콘텐츠를 타겟 사용자에게 제공하고, 그에 대 한 사용자의 피드백을 바탕으로 자동 생성된 디지털 콘텐츠를 승인하거나 재 생성할 수 있다(S205). 또한, 디지 털 콘텐츠 제공 플랫폼은 이러한 사용자의 피드백을 바탕으로 딥 러닝 기반의 생성형 인공지능 모델에 대 한 학습을 수행할 수 있다 사용자 단말은 생성화 된 콘텐츠를 구동할 수 있는 다양한 컴퓨팅 기기일 수 있으며, 예를 들어, VR 전용 기기, 스마트 폰(smart phone), PC(Personal Computer), 태블릿 PC 등 뿐만 아니라, 노트북 컴퓨터(laptop computer), PDA(personal digital assistants), PMP(portable multimedia player), 네비게이션, 슬레이트 PC(slate PC), 울트라북(ultrabook), 웨어러블 디바이스(wearable device, 예를들어, 워치형 단말기 (smartwatch), 글래스형 단말기 (smart glass), HMD(head mounted display)) 등 다양한 전자 기기가 적용 가능 하다. 디지털 콘텐츠 제공 플랫폼은 플랫폼을 구성하는 다양한 구성요소들을 총괄하는 것이나, 이하의 설명에서 는 설명의 편의를 위하여 콘텐츠 제공 서버로 칭하여 설명한다. 다만, 이에 한정되는 것은 아니며 디지털 콘텐 츠 제공 플랫폼은 그를 구성하는 다양한 구성요소, 예컨대, 복수의 서로 다른 또는 같은 기능을 수행하는 복수의 물리적 서버 장비들의 연관된 구조로서 구현될 수 있음은 자명하다. 이하, 도 3 내지 도 13을 참조하여, 본 출원에 따른 디지털 콘텐츠 생성 방법 및 그를 이용한 디지털 콘텐츠 제 공 플랫폼의 다양한 실시예들에 대하여 보다 상세히 설명한다. 도 3은 도 1에 도시된 콘텐츠 제공 서버의 일 실시예를 설명하는 블록 구성도이다. 도 3에는 콘텐츠 제공 서버 의 구성 요소로서 콘텐츠 관리부, 개인화 데이터 생성부, 생성형 인공지능 모델, 피드백 관리부 및 자동생성 콘텐츠 저장부가 개시된다. 실시예에 따라, 각각의 구성 요소는 별도의 구분된 서버 또는 컴퓨팅 장치로 구현되어 하나의 생성 플랫폼을 구성할 수 있다. 그러나, 이에 한정되는 것은 아니며, 각각의 구성 요소는 물리적으로 분리되거나 또는 논리적으로 분리되어 구현될 수도 있고, 실시예에 따라서는 하 나의 장치로서 통합적으로 구현될 수도 있다. 이하 각 구성요소의 동작에 대하여 설명한다. 도 4는 도 3에 도시된 콘텐츠 업로드부에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 설명하는 순서도로서, 도 3 및 도 4를 참조하여 설명한다. 콘텐츠 관리부는 디지털 콘텐츠를 저장 및 관리한다(S410). 콘텐츠 관리부는 외부 플랫폼, 예컨대, 외부 SNS 플랫폼이나 동영상 관리 플랫폼 등과 연동되어 외부 플랫폼의 디지털 콘텐츠를 직접 제공받아 저장하 거나 또는 간접적으로 연결하여 관리할 수 있다. 콘텐츠 관리부는 사용자 단말과 연동하여 사용자 단말에 디지털 콘텐츠를 제공할 수 있다. 예컨대, 콘텐츠 관리부는 사용자의 검색이나 또는 사용자의 소비 이력을 바탕으로 추천 디지털 콘텐츠를 제공할 수 있으며, 그러한 사용자의 활동에 의하여 사용자가 디지털 콘텐츠에 대한 소비 활동을 수행하면 개인 화 데이터 생성부는 그러한 사용자의 콘텐츠 소비 이력을 저장할 수 있다. 또한, 개인화 데이터 생성부는 사용자의 콘텐츠 소비 이력을 기초로 사용자 별 개인화 데이터를 생성할 수 있다(S420). 사용자의 개인화 데이터는 각 사용자 별로 개별적으로 생성되며, 사용자의 활동에 따라 갱신될 수있다. 개인화 데이터는 각 개인 사용자에 대한 소비 성향에 따라 설정되는 데이터로서, 사용자의 소통 정도, 활 동 패턴, 통계 특성 등이 반영되며, 이러한 개인화 데이터는 생성형 인공지능 모델에서 개인화 된 디지털 콘텐츠의 생성에 적용되는 일 데이터가 된다. 생성형 인공지능 모델은 디지털 콘텐츠를 동적으로 생성하는 딥 러닝 기반의 생성형 인공지능 모델로서, 콘텐츠 제공 서버는 이러한 생성형 인공지능 모델을 저장하고 그에 대한 사용자 피드백을 반영하여 생성형 인공지능 모델을 지도 학습함으로써 자동 생성 콘텐츠의 사용자 취향의 반영 정도를 보다 향상시킬 수 있다(S430). 일 실시예에서, 생성형 인공지능 모델은, 자동 생성 콘텐츠의 기초가 되는 복수의 기초 콘텐츠를 멀티 레이어로 분해하여 복수의 특징 요소를 추출하고, 복수의 특징 요소를 조합하여 자동 생성 콘텐츠를 생성할 수 있다. 생성형 인공지능 모델은 각 개인에 대하여 개인화 데이터를 반영하여 사용자를 대상으로 하는 자동 생성 콘텐츠를 생성할 수 있고(S440), 피드백 관리부는 생성된 자동 생성 콘텐츠에 대한 사용자의 피드백을 바 탕으로 자동 생성 콘텐츠를 재 생성하거나 또는 확정하도록 할 수 있다(S450). 이러한 피드백 관리부는 자동 콘텐츠 생성 서비스로서 기본 작동 형태로서 생성(Generation) 및 승인 (Confirmation) 사이클로 구현되도록 할 수 있다. 이와 같이, 피드백 관리부를 통한 사용자 피드백에 따라, 'AI 자동생성 및 Human 실행 승인'에 의하여 서비스 실행이 완료될 수 있고, 또는, 'AI 자동생성-Human 피드백-AI 재생성 -Human 실행승인' 싸이클을 통해 사용자의 피드백이 반영되어 재생성되는 프로세스로도 서비 스 될 수 있다. 자동생성 콘텐츠 저장부는 자동 생성 콘텐츠를 저장 및 관리 하는 다양한 기능을 수행한다. 이하, 도 5 내지 도 9를 참조하여 콘텐츠 제공 서버의 각 구성요소에 대한 다양한 실시예와 그를 통하여 수행되는 디지털 콘텐츠 생성 방법의 다양한 실시예에 대하여 보다 상세히 설명한다. 도 5는 도 3에 도시된 개인화 데이터 생성부의 일 실시예를 설명하는 블록 구성도이고, 도 6은 도 5에 도시된 개인화 데이터 생성부에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 설명하는 순서도로서, 이하에서는 도 5 및 도 6을 참조하여 개인화 데이터 생성 기술에 대하여 보다 상세히 설명한다. 개인화 데이터 생성부는 각 개인별로 설정되는 사용자 별 특성을 나타내는 개인화 데이터를 생성하며, 이 러한 개인화 데이터는 특정 사용자에 대한 마인드 셋 모델로도 칭해질 수 있다. 일 실시예예서, 개인화 데이터 생성부는 각 사용자의 소통 지수, 활동 패턴 및 통계 특성을 바탕으로 개인 화 데이터를 생성할 수 있으며, 이를 위하여 소통 지수 생성 모듈, 활동 패턴 생성 모듈, 통계 특성 생성 모듈 및 개인화 데이터 생성 모듈를 포함할 수 있다. 소통 지수 생성 모듈은 사용자의 콘텐츠 소비 이력 중 대화 상대, 대화 내용, 대화 빈도, 콘텐츠 공유 및 추천 대상, 공유 및 추천 빈도, 리뷰 내용, 댓글 내용, 리뷰 빈도 및 댓글 빈도를 기초로 소통 지수를 생성할 수 있다(S610). 활동 패턴 생성 모듈은 사용자의 콘텐츠 소비 이력 중 좋아요 내역, 관심 콘텐츠, 관심사, 콘텐츠 판매 데 이터 및 콘텐츠 구매 패턴 데이터를 기초로 활동 패턴을 생성할 수 있다(S620). 통계 특성 생성 모듈은 사용자의 국가, 지역, 성별, 나이 및 언어 데이터를 기초로 통계 특성 데이터를 생 성할 수 있다(S630). 개인화 데이터 생성 모듈은 사용자의 소통 지수, 활동 패턴 및 통계 특성 데이터를 생성하여 개인화 데이 터를 생성할 수 있다(S640). 일 예로, 상술한 소통 지수, 활동 패턴, 통계 특성 등은 각 사용자 별로 개별 구성되며, 또한 시간적으로 변화 하는 특성이 반영되어 설정될 수 있다. 예컨대, 개인화 데이터 생성 모듈은 '특정 시간 가장 높은 확률로 기대되는 사용자 관심사'를 개인화 데이터를 생성할 수 있으며, 이를 위하여 현재 시간대에 대한 사용자의 시간 대 별 소통 지수, 활동 패턴 및 통계 특성 데이터를 확인하고 이를 기반으로 사용자 개인화 데이터를 생성할 수 있다.이러한 개인화 데이터는 콘텐츠 생성의 기초가 되는 기초 콘텐츠의 선택에 사용되거나, 또는 그들의 멀티 레이 어에 대한 조합을 선별하는데 사용되는 등 다양하게 적용될 수 있다. 도 7은 도 3에 도시된 생성형 AI 모델의 일 실시예를 설명하는 블록 구성도이고, 도 8은 도 7에 도시된 생성형 AI 모델에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 설명하는 순서도이다. 이하에서는 도 7 및 도 8을 참조하여 개인화 데이터 생성 기술에 대하여 보다 상세히 설명한다. 도 7을 참조하면, 생성형 인공지능 모델은 레이어 분해 모듈, 가중치 설정모듈 및 콘텐츠 생성 인공지능 모델을 포함할 수 있다. 레이어 분해 모듈은 사용자의 개인화 데이터를 기초로 복수의 기초 콘텐츠를 선별할 수 있다(S810). 기초 콘텐츠는 자동 콘텐츠 생성의 재료가 되는 콘텐츠로서, 이는 기존에 존재하고 있는, 즉 콘텐츠 관리부에 의하여 저장 및 관리되고 있는 데이터 일 수 있다. 예컨대, 콘텐츠 관리부는 콘텐츠 데이터에 대한 메타 데이터를 함께 저장하여 관리할 수 있고, 레이어 분해 모듈은 사용자의 개인화 데이터에 대응되는 메타 데 이터의 특정 요소를 기준으로 기초 콘텐츠를 선별할 수 있다. 레이어 분해 모듈은 선별된 복수의 기초 콘텐츠 각각에 대해, 기초 콘텐츠를 복수의 멀티 레이어로 분해할 수 있다. 분해된 복수의 멀티 레이어는 각각 또는 적어도 일부가 함께 특징 요소로서 설정될 수 있다. 즉, 특징 요소는, 분해된 복수의 멀티 레이어 중 적어도 하나와 연관되어 설정될 수 있다. 결국, 레이어 분해 모듈은 분해된 복수의 멀티 레이어를 바탕으로 복수의 특징 요소를 추출할 수 있다 (S820). 가중치 설정 모듈는 사용자의 개인화 데이터를 기초로 복수의 특징 요소 중 적어도 일부에 대하여 가중치 를 부여하여 생성형 인공지능 모델에 제공할 수 있다(S830). 콘텐츠 생성 인공지능 모델은 복수의 특징 요소를 입력받고, 복수의 특징 요소 중 적어도 일부를 조합하여 자동 생성 콘텐츠를 생성할 수 있다(S840). 도 9는 도 7에 도시된 생성형 AI 모델에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 예시하는 도면으로서, 도 9를 참조하여 설명한다. 도 9의 예에서는 개인 사용자가 둘 인 경우로 설정되었으며, 이는 예컨대, 광고주가 특정 계층의 유저를 대상으로 하는 광고를 생성할 것을 요청하는 경우 등과 같은 경우이다. 제1 사용자인 광고주의 경우에는, 개인화 데이터를 직접 입력할 수도 있고, 또는 광고주의 주요 사용된 콘텐츠 의 특징 요소나 상징을 기초로 개인화 데이터가 개별 설정될 수도 있다. 제2 사용자인 유저, 예컨대, MZ 세대의 이용자들에 대해서는 제2 사용자의 개인화 데이터를 바탕으로, 특정 걸 그룹이 개인화 데이터로서 설정될 수 있다. 즉, 레이어 분해 모듈은 제1 사용자의 자사 광고 콘텐츠를 제1 기초 데이터로, 제2 사용자의 특정 걸그룹 에 대한 콘텐츠를 제2 기초 데이터로 설정할 수 있다. 이후, 레이어 분해 모듈은 각각의 기초 데이터를 복수의 레이어로 분해할 수 있다. 예컨대, 제1 사용자의 광고 콘텐츠는 콘텐츠의 배경 레이아웃, 색상 특징, 로고 특징 등이 각각의 레이어로서 분해되고, 제2 사용자의 관심 콘텐츠인 특정 걸그룹의 콘텐츠는 해당 걸그룹의 명칭, 음악, 앨범 이름, 상징 캐 릭터 등이 각각의 레이어로서 분해될 수 있다. 이후, 이와 같이 분해된 레이어들이 콘텐츠 생성 인공지능 모델에 제공되고, 콘텐츠 생성 인공지능 모델 은 이러한 복수의 레이어들을 조합하여 새로운 자동 생성 콘텐츠를 생성할 수 있다. 콘텐츠 생성 인공지능 모델가 레이어를 선택함에 있어서 가중치가 설정될 수 있으며 이러한 가중치는 가중 치 설정 모듈에 의하여 설정될 수 있다. 예컨대, 가중치 설정 모듈은 최근 1주간 MZ 사용자들의 콘텐 츠 소비 성향을 개인화 데이터(마인드 셋)으로서 설정한 결과, 최근에는 상징 캐릭터가 높은 이슈 요인이 됨을 확인하면 이러한 상징 캐릭터, 즉, 토끼 캐릭터에 보다 높은 가중치를 설정할 수 있다. 한편, 도 9의 예에서는 각각의 레이어가 각각의 특징 요소로서 설명되었으나, 이러한 특징 요소는 여러 레이어 가 함께 설정될 수 도 있다. 예컨대, 제1 사용자의 광고 레이아웃 특징과 광고 색상 특징은 함께 연관되어 하나의 특징 요소로서 활용될 수 있다. 즉, 도9의 예에서, 빨간 배경에 하단의 로고 및 가운데의 중심 박스가 하나 의 특징 요소로서 설정될 수 있다. 이와 같이, 인공지능을 이용하여 자동적으로 콘텐츠를 생성하는 기술, 즉, Deep blend기술은 아래의 기능들을 포괄하고 있다. - 이미지, 텍스트, 동영상, 이모티콘, 밈 등 플랫폼 내 축적된 멀티 포맷 콘텐츠 데이터들에 대한 지속적인 메 타 데이터 생성 및 축적 - A-GPR 모델을 통한 특정 사용자 마인드 셋 모델(개인화 데이터) 생성 - 특정 시간 가장 높은 확률로 기대되는 사용자 관심사 추출 - 융합 전 단계 기초 콘텐츠 후보군 자동 선정 -기초 콘텐츠들을 멀티 레이어로 분해하고 특징점 추출 - 다양한 컴비네이션으로 특징점 및 레이어 재조합 - 분해, 융합, 재생성 된 후 가공 콘텐츠 사용자 맞춤형 추천 도 10은 도 1에 도시된 콘텐츠 제공 서버의 다른 일 실시예를 설명하는 블록 구성도이다. 도 10은, 콘텐츠 제공 서버에서 구동되는 다양한 딥 러닝 모델을 자동으로 학습시키는 자동적인 머신 러닝이 구현된 일 실시예에 관한 것이다. 도 10을 참조하면, 콘텐츠 제공 서버는 콘텐츠 관리부, 개인화 데이터 생성부, 생성형 인공지능 모델, 피드백 관리부, 자동생성 콘텐츠 저장부 및 자동 머신러닝부를 포함한다. 콘텐츠 관 리부 내지 자동생성 콘텐츠 저장부에 대한 설명은 도 3 내지 도 9를 참조하여 상술한 설명으로부터 쉽게 이해할 수 있으므로 여기에서는 중복적인 설명을 생략한다. 자동 머신 러닝부는 콘텐츠 제공 서버에서 구동되는 적어도 하나의 딥 러닝 모델을 자동적으로 학습 시킬 수 있다. 이를 위하여, 자동 머신 러닝부는 콘텐츠 제공 서버의 운영에 따라 발생하는 다양한 운영 데이터를 수집하고 이들을 이용하여 딥 러닝 모델의 자동화 된 학습을 수행할 수 있다. 여기에서, 운영 데이터는 콘텐츠 제공 서버에서 생성되거나 제공되는 디지털 콘텐츠 데이터, 그에 대한 사 용자의 활동 데이터(예컨대, 시청, 좋아요, 스크랩 등 사용자의 인터렉티브에 의하여 발생하는 데이터 등), 자 동 생성 콘텐츠에 대한 사용자의 피드백 데이터 등을 포함할 수 있다. 자동 머신 러닝부는 자동 학습된 딥 러닝 모델에 대하여 자동 학습의 결과를 기초로 성능 평가를 수행하고, 성능이 우수하게 향상된 경우에만 자동 학습의 결과를 반영하도록 설정할 수 있다. 이하, 도 11 및 도 12를 참조하여 자동 머신 러닝부에 대하여 보다 상세히 설명한다. 도 11은 도 10에 도시된 자동 머신 러닝부의 일 실시예를 설명하는 블록 구성도이고, 도 12는 도 10에 도시된 자동 머신 러닝부에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 도시하는 도면이다. 도 11 및 도 12를 참조하면, 자동 머신 러닝부는 데이터 분류모듈, 자동 머신러닝 모듈 및 피드 백 모듈을 포함할 수 있다. 데이터 분류모듈은 운영 데이터를 확인한다. 데이터 분류모듈은 각 딥 러닝 모델의 학습과 관련된 학 습용 분류에 따라 운영 데이터를 복수의 학습 데이터 셋으로 구분할 수 있다(S1210). 이를 위하여 데이터 분류모듈은 각 딥 러닝 모델의 학습 데이터의 종류 및 포멧에 대한 정보를 학습용 분 류로서 설정하여 저장할 수 있다. 본 명세서에서는 딥 러닝 모델로는 콘텐츠 자동 생성을 위한 생성형 인공지능 모델이 개시되어 있으나, 이 외에도 콘텐츠 제공 서버에는 다양한 딥 러닝 모델이 추가로 구동될 수 있으 며 데이터 분류모듈은 이러한 각각의 딥 러닝 모델마다 학습용 분류를 정보화하여 저장하여 운영 데이터를 분류할 수 있다. 자동 머신러닝 모듈은 데이터 분류모듈에서 분류된 복수의 학습 데이터 셋을, 그와 관련된 복수의 딥 러닝 모델에 각각 제공하며 학습을 수행하도록 할 수 있다(S1220).피드백 모듈은 자동 머신러닝 모듈에 의하여 자동 학습된 딥 러닝 모델의 성능을 평가하고(S1230), 자동 학습 전의 딥 러닝 모델의 성능과 자동 학습 후의 러닝 모델의 성능을 평가하여 자동 학습의 반영 여부를 판단할 수 있다S1240). 이를 위하여 피드백 모듈은 각각의 딥 러닝 모델에 대한 평가 모듈을 포함할 수 있다. 즉, 피드백 모듈 은 각각의 딥 러닝 모델에 대하여, 자동 학습 이전의 딥 러닝 모델-학습 전 버전-과 자동 학습 후의 딥 러 닝 모델-학습 후 버전- 간의 성능을 비교 평가하고, 자동 학습에 의하여 성능이 개선된 경우에만 자동 학습을 반영하도록 할 수 있다. 이러한 피드백 과정을 통하여 자동 학습에 의하여 성능이 오히려 낮아지는 학습 오염을 방지할 수 있다. 도 13은 본 발명의 일 실시예에 따른 디지털 콘텐츠 제공 플랫폼의 일 예를 설명하는 플랫폼 서버의 예시적인 컴퓨팅 운영 환경을 설명하는 도면이다. 도 13은 플랫폼 서버의 실시예들이 구현될 수 있는 적합한 컴퓨팅 환경의 일반적이고 단순화된 설명을 제 공하기 위한 것으로, 도 13을 참조하면, 플랫폼 서버의 일 예로서 컴퓨팅 장치가 도시된다. 컴퓨팅 장치는 적어도 프로세싱 유닛과 시스템 메모리를 포함할 수 있다. 컴퓨팅 장치는 프로그램을 실행할 때 협조하는 복수의 프로세싱 유닛을 포함할 수도 있다. 컴퓨팅 장치의 정확 한 구성 및 유형에 의존하여, 시스템 메모리는 휘발성(예컨대, 램(RAM)), 비휘발성(예컨대, 롬(ROM), 플래 시 메모리 등) 또는 이들의 조합일 수 있다. 시스템 메모리는 플랫폼의 동작을 제어하기 위한 적합한 운영 체제를 포함하는데, 예컨대 마이크로소프트사로부터의 WINDOWS 운영체제와 같은 것일 수 있다. 시스템 메 모리는 프로그램 모듈, 애플리케이션 등의 같은 하나 이상의 소프트웨어 애플리케이션을 포함할 수도 있다. 컴퓨팅 장치는 자기 디스크, 광학적 디스크, 또는 테이프와 같은 추가적인 데이터 저장 장치를 포함할 수 있다. 이러한 추가적 저장소는 이동식 저장소 및/또는 고정식 저장소 일 수 있다. 컴퓨터 판독가능 저장 매체는 컴퓨터 판독가능 인스트럭션, 데이터 구조, 프로그램 모듈, 또는 기타 데이터와 같은 저장정보를 위한 임의의 방법이나 기법으로 구현되는 휘발성 및 비휘발성, 이동식 및 고정식 매체를 포함할 수 있다. 시스템 메모리 , 저장소는 모두 컴퓨터 판독가능 저장 매체의 예시일 뿐이다. 컴퓨터 판독가능 저장 매체는 램 (RAM), 롬(ROM), EEPROM, 플래시 메모리 또는 다른 메모리 기법, CD-ROM, DVD 또는 다른 광학적 저장소, 자기 테이프, 자기 디스크 저장소 또는 다른 자기적 저장 장치, 또는 원하는 정보를 저장하고 컴퓨팅 장치에 의 해 액세스될 수 있는 임의의 다른 매체를 포함할 수 있는데, 이에 한정되는 것은 아니다. 컴퓨팅 장치의 입력 장치, 예컨대 키보드, 마우스, 펜, 음성 입력 장치, 터치 입력 장치, 및 비교 가능한 입력 장치를 포함할 수 있다. 출력 장치는, 예컨대 디스플레이, 스피커, 프린터, 및 다른 유형의 출력 장"}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "치가 포함될 수도 있다. 이들 장치는 본 기술분야에서 널리 알려진 것이므로 자세한 설명은 생략한다. 컴퓨팅 장치는 예컨대 분산 컴퓨팅 환경에서의 네트워크, 예컨대, 유무선 네트워크, 위성 링크, 셀룰러 링크, 근거리 네트워크, 및 비교가능한 메커니즘을 통해 장치가 다른 장치들과 통신하도록 허용하는 통신 장치를 포함할 수도 있다. 통신 장치는 통신 매체의 한가지 예시이며, 통신 매체는 그 안에 컴퓨터 판독 가능 인 스트럭션, 데이터 구조, 프로그램 모듈, 또는 다른 데이터를 포함할 수 있다. 예시적으로, 통신 매체는 유선 네 트워크나 직접 유션 접속과 같은 유선 매체, 및 음향, RF, 적외선 및 다른 무선 매체와 같은 무선 매체를 포함 하는데, 이에 한정되는 것은 아니다. 본 출원의 다양한 실시예에 따른 방법들은, 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 상기 컴퓨터 판독 가능 매체는 프로그램 명령, 데이터 파 일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 실시예 를 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체 (magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장 하고 수행하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지 는 것과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함한다. 상기된 하드웨어 장치는 실시예의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동 하도록 구성될 수 있으며, 그 역도 마찬가지이다."}
{"patent_id": "10-2023-0116978", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "이상과 같이 실시예들이 비록 한정된 실시예와 도면에 의해 설명되었으나, 해당 기술분야에서 통상의 지식을 가 진 자라면 상기의 기재로부터 다양한 수정 및 변형이 가능하다. 예를 들어, 설명된 기술들이 설명된 방법과 다 른 순서로 수행되거나, 및/또는 설명된 시스템, 구조, 장치, 회로 등의 구성요소들이 설명된 방법과 다른 형태 로 결합 또는 조합되거나, 다른 구성요소 또는 균등물에 의하여 대치되거나 치환되더라도 적절한 결과가 달성될 수 있다. 그러므로, 다른 구현들, 다른 실시예들 및 특허청구범위와 균등한 것들도 후술하는 특허청구범위의 범위에 속한 다."}
{"patent_id": "10-2023-0116978", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 디지털 콘텐츠 제공 플랫폼을 설명하기 위한 도면이다. 도 2는 본 발명의 일 실시예에 따른 디지털 콘텐츠 제공 플랫폼을 통한 디지털 콘텐츠 생성 방법을 설명하는 순 서도이다. 도 3은 도 1에 도시된 콘텐츠 제공 서버의 일 실시예를 설명하는 블록 구성도이다. 도 4는 도 3에 도시된 콘텐츠 제공 서버에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 설명하는 순서도이다. 도 5는 도 3에 도시된 개인화 데이터 생성부의 일 실시예를 설명하는 블록 구성도이다. 도 6은 도 5에 도시된 개인화 데이터 생성부에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 설명하는 순서도 이다. 도 7은 도 3에 도시된 생성형 AI 모델의 일 실시예를 설명하는 블록 구성도이다. 도 8은 도 7에 도시된 생성형 AI 모델에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 설명하는 순서도이다. 도 9는 도 7에 도시된 생성형 AI 모델에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 도시하는 도면이다. 도 10은 도 1에 도시된 콘텐츠 제공 서버의 다른 일 실시예를 설명하는 블록 구성도이다. 도 11은 도 10에 도시된 자동 머신러닝부의 일 실시예를 설명하는 블록 구성도이다. 도 12는 도 10에 도시된 자동 머신러닝부에서 수행되는 디지털 콘텐츠 생성 방법의 일 예를 도시하는 도면이다. 도 13은 본 발명의 일 실시예에 따른 디지털 콘텐츠 제공 플랫폼에 적용되는 플랫폼 서버의 예시적인 컴퓨팅 운 영 환경을 설명하는 도면이다."}
