{"patent_id": "10-2019-0124500", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0041818", "출원번호": "10-2019-0124500", "발명의 명칭": "이동식 선반을 이용한 창고관리 시스템", "출원인": "주식회사 파인애플소프트", "발명자": "백선호"}}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "선반(rack, shelf)을 이용하여 물품을 관리하는 창고관리 시스템에 있어서,상기 선반에 마련되어 물품을 적재하고 보관하는 복수의 수납부;상기 선반이 이동 가능하도록 상기 수납부 하부에 마련되는 이동부;상기 이동부에 전원을 공급하는 전원부;상기 선반의 이동을 제한 및 안내하는 가이드부;상기 이동부 및 가이드부와 사용자를 연결하는 통신부; 및상기 이동부, 전원부, 가이드부 및 통신부를 제어하는 제어부; 를 포함하며,상기 이동부는 복수의 상기 선반 저면에 각각 마련되고 휠(바퀴), 벨트 및 모터를 이용하여 상기 선반을 이동시키는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 이동부는 상기 모터의 회전 구동을 상기 벨트가 휠로 전달하며 상기 모터의 회전 속도는 사용자의 선택 제어 또는 기 설정된 기준에 따라 차등적으로 진행되는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 가이드부는 상기 선반의 이동 범위를 제한하도록 상기 선반으로부터 일정 거리 이격되어 마련됨으로써 상기 가이드부 안에서 상기 선반이 이동하도록 하며, 하나 이상의 센서부를 더 포함하여 상기 센서부에 의해 상기선반의 이동을 감지하고 상기 이동부를 구동하여 상기 선반의 이동을 안내하는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3항에 있어서,상기 센서부는 적외선 센서, 변위 감지센서, 위치 센서 및 레이저 변위 측정 센서 중 하나 이상을 사용하여 상기 선반의 이동을 감지하고, 상기 가이드부는 사용자의 선택에 의해 크기, 길이, 위치가 변경되며 변경된 상기가이드부에 따라 상기 선반의 적정하게 이동되는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,사용자는 휴대용 단말을 이용하여 상기 이동부 및 가이드부를 제어하되 필요 시 근거리 통신망인 와이파이, 지그비, 비콘, 블루투스 및 이동 통신망 중 하나를 이용하고, 사용자와 송수신 된 데이터는 저장, 가공 및 활용되도록 딥 러닝 및 인공지능 기술을 이용하여 활용하는 것을 특징으로 하는 창고관리 시스템. 공개특허 10-2021-0041818-3-청구항 6 제 3항에 있어서,알람부 및 안전부를 더 포함하며, 상기 알람부는 사용자의 근접 또는 상기 선반의 이동을 시각적, 청각적 자극을 통해 알람하고, 상기 안전부는상기 선반에서 낙하하거나 이탈하는 물품을 보호하도록 상기 선반이 이동하는 경우에 상기 선반에서 연장되어형성되는 별도의 부재 또는 걸림부로 마련되는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3항에 있어서,상기 센서부는 사용자의 접근을 감지하고 감지된 사용자와 가장 근접한 상기 선반이 각각 개방되도록 하며, 필요 시 상기 선반의 이동속도를 측정하여 기 설정된 값 이상인 경우 자동으로 정지 또는 감속하도록 스토퍼를 더포함하는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 선반은 사용하지 않는 경우 각각 밀착하여 위치하고, 사용하는 경우 일정 크기 이상 이격되며, 상기 모터에 의한 구동 이외에, 전자석을 이용하여 상기 선반을 이동할 수 있으며, 상기 선반이 밀착하는 경우 추가 체결수단을 마련함으로써 상기 선반의 위치를 고정하는 것을 특징으로 하는 창고관리 시스템."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 선반(rack, shelf)을 이용하여 물품을 관리하는 창고관리 시스템은 상기 선반에 마련되어 물품을 적재하고 보관하는 복수의 수납부, 상기 선반이 이동 가능하도록 상기 수납부 하부에 마련되는 이동부, 상기 이 동부에 전원을 공급하는 전원부, 상기 선반의 이동을 제한 및 안내하는 가이드부, 상기 이동부 및 가이드부와 사 용자를 연결하는 통신부 및 상기 이동부, 전원부, 가이드부 및 통신부를 제어하는 제어부를 포함하며, 상기 이동 부는 복수의 상기 선반 저면에 각각 마련되고 휠(바퀴), 벨트 및 모터를 이용하여 상기 선반을 이동시키는 것을 특징으로 한다."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 창고관리 시스템에 관한 것으로 더욱 상세하게는 기존의 창고에 이용되던 선반(shelf) 또는 적재부를 개량하여 이동이 가능하며 새로운 기능과 구성을 추가함으로써 보다 효율적인 창고관리가 가능한 이동식 선반을 이용한 창고관리 시스템에 관한 것이다."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 물류 창고, 화물 창고 또는 도서관 등에는 공장 또는 생산지에서 생산된 각종 식, 음료, 의류, 가전, 잡화, 서적 등의 물품을 일시적으로 또는 장기적으로 보관 또는 적재하기 위해 선반(shelf, rack) 또는 적재부를 이용하는 화물적재 시스템 또는 창고관리 시스템이 설치되어 있다. 창고관리 시스템 또는 화물적재 시스템은 물류 산업의 발달로 인해 단순한 물류의 보관차원에서 벗어나 물류 창 고에 보관중인 물품의 제품 배치는 물론 효율적인 입고, 적재, 출고, 재고관리 등에 효과적으로 이용되고 있다. 또한, 대량의 물품을 보다 신속하게 입고 및 출고하고 적재 공간 및 창고 공간을 효율적으로 이용하기 위해 다 양한 방식으로 설계 및 시공되고 있다. 그런데, 종래의 창고관리 시스템 또는 화물적재 시스템에 이용되는 선반(shelf, rack)은 대부분 지면, 바닥과 고정되어 이동이 불가능하다. 즉, 무거운 하중이 발생하는 물품의 보관 및 적재를 안전하게 관리하도록 고정식 선반이 사용되는 것이다. 이러한 고정식 선반의 경우 물품의 이동 및 관리를 위해 선반과 선반 사이에 일정한 이격 공간 즉, 사용자 내지 관리자가 이동할 수 있거나 리프트나 운반 기계장치가 수용될 수 있는 공간이 필요하므로 공간 활용에 제약이발생한다. 이러한 문제를 해결하기 위해 등록번호 제10-0941943호(2010.02.11. 공고)에 의해 이동식 선반이 개시되어 있으 나 이동하는 경로에 레일설비가 먼저 이루어져야 하며 선반의 이동은 레일을 통해서만 이동이 가능하므로 자유 롭고 효율적인 선반의 사용이 제한된다. 또한, 초기 레일 설치비용이 발생하며 추후 선반의 위치를 조정하고 싶 은 경우 레일 공사가 동반되어야만 하는 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 등록특허 10-0941943호(2010.02.11. 공고)"}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 감안하여 안출된 것으로서, 본 발명의 목적은 이동이 가능하도록 하며 새로운 기능 과 구성을 추가함으로써 보다 효율적인 창고관리가 가능한 이동식 선반을 이용한 창고관리 시스템을 제공하려는 것이다."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 창고관리 시스템은 선반(rack, shelf)을 이용하여 물품을 관리하되 상기 선반에 마련되어 물품 을 적재하고 보관하는 복수의 수납부, 상기 선반이 이동 가능하도록 상기 수납부 하부에 마련되는 이동부, 상기 이동부에 전원을 공급하는 전원부, 상기 선반의 이동을 제한 및 안내하는 가이드부, 상기 이동부 및 가이드부와 사용자를 연결하는 통신부 및 상기 이동부, 전원부, 가이드부 및 통신부를 제어하는 제어부를 포함한다. 또한, 상기 이동부는 복수의 상기 선반 저면에 각각 마련되고 휠(바퀴), 벨트 및 모터를 이용하여 상기 선반을 이동시키는 것을 특징으로 한다. 또한, 상기 이동부는 상기 모터의 회전 구동을 상기 벨트가 휠로 전달하며 상기 모터의 회전 속도는 사용자의 선택 제어 또는 기 설정된 기준에 따라 차등적으로 진행되는 것을 특징으로 한다. 또한, 상기 가이드부는 상기 선반의 이동 범위를 제한하도록 상기 선반으로부터 일정 거리 이격되어 마련됨으로 써 상기 가이드부 안에서 상기 선반이 이동하도록 하며, 하나 이상의 센서부를 더 포함하여 상기 센서부에 의해 상기 선반의 이동을 감지하고 상기 이동부를 구동하여 상기 선반의 이동을 안내하는 것을 특징으로 한다. 또한, 상기 센서부는 적외선 센서, 변위 감지센서, 위치 센서 및 레이저 변위 측정 센서 중 하나 이상을 사용하 여 상기 선반의 이동을 감지하고, 상기 가이드부는 사용자의 선택에 의해 크기, 길이, 위치가 변경되며 변경된 상기 가이드부에 따라 상기 선반의 적정하게 이동되는 것을 특징으로 한다. 또한, 사용자는 휴대용 단말을 이용하여 상기 이동부 및 가이드부를 제어하되 필요 시 근거리 통신망인 와이파 이, 지그비 및 비콘 중 하나를 이용하고, 사용자와 송수신 된 데이터는 저장, 가공 및 활용되도록 딥 러닝 및 인공지능 기술을 이용하여 활용하는 것을 특징으로 한다. 또한, 알람부 및 안전부를 더 포함하며, 상기 알람부는 사용자의 근접 또는 상기 선반의 이동을 시각적, 청각적 자극을 통해 알람하고, 상기 안전부는 상기 선반에서 낙하하거나 이탈하는 물품을 보호하도록 상기 선반이 이동 하는 경우에 상기 선반에서 연장되어 형성되는 별도의 부재 또는 걸림부로 마련되는 것을 특징으로 한다. 또한, 상기 센서부는 사용자의 접근을 감지하고 감지된 사용자와 가장 근접한 상기 선반이 각각 개방되도록 하 며, 필요 시 상기 선반의 이동속도를 측정하여 기 설정된 값 이상인 경우 자동으로 정지 또는 감속하도록 스토 퍼를 더 포함하는 것을 특징으로 한다. 또한, 상기 선반은 사용하지 않는 경우 각각 밀착하여 위치하고, 사용하는 경우 일정 크기 이상 이격되며, 상기 모터에 의한 구동 이외에, 전자석을 이용하여 상기 선반을 이동할 수 있으며, 상기 선반이 밀착하는 경우 추가 체결수단을 마련함으로써 상기 선반의 위치를 고정하는 것을 특징으로 한다."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 창고관리 시스템은 선반의 이동을 제어하고 이에 따라 효율적인 창고관리가 가능하도록 함으로 써 창고관리 시스템에 활용될 수 있다."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하면서 본 발명의 실시예에 따른 이동식 선반을 이용한 창고관리 시스템에 관하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시 할 수 있도록 상세히 설명하기로 한다. 본 발명은 여기에서 설명하는 실시예로 한정되지 않으며, 여러 가지 상이한 형태로 구현될 수 있다. 본 발명을 명확하게 설명하기 위해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 동일 또는 유사한 구성 요소에 대해서는 동일한 참조부호를 붙이도록 한다. 본 발명의 설명에 있어서 선반은 shelf, rack 등 물품, 제품을 수용, 보관할 수 있는 다양한 의미의 적재공간을 모두 포함하는 것이며, 그 형태, 모양, 크기, 종류에 제한이 없다. 바람직하게는 일정한 수납부를 가지고 복수 의 층이 마련된 선반의 형태가 가장 적합할 것이며, 이에 대해 도면에 도시된 선반을 참고하여 이해할 수 있다. 도 1은 종래 기술에 따른 창고관리 시스템을 보여주는 사진이다. 도시된 바와 같이 창고 안에 선반이 마련 되고, 상기 선반은 복수의 층으로 마련되어 각각 수납부가 형성되며, 상기 수납부에 물품을 적재한다. 그런데, 종래 기술에 따른 상기 선반은 이동이 불가능하다. 따라서, 선반과 이웃하는 선반 사이에는 사용자나 이동장치, 리프트 등이 이동할 수 있도록 일정크기 이상의 공간이 마련되어야 하고, 정해진 창고 공간 에 상기 선반이 배치되는 경우 일정 수 이하의 선반이 설치되어야 하므로 공간의 활용이 제한적이며, 물품 의 입고, 출고 등 사용이 없는 경우에는 공간이 활용되지 않는다는 문제점이 있는 것이다. 이에 따라 본 발명에 따른 창고관리 시스템은 이동식 선반을 이용하는 것이다. 본 발명에 따른 이동식 선반을 이용한 창고관리 시스템은 상기 선반이나 이에 준하는 적재부를 이용하여 물품을 적재, 관리하 는 것으로서 물품을 적재하고 보관하는 복수의 수납부, 상기 선반이 이동 가능하도록 상기 수납부 하부에 마련되는 이동부, 상기 이동부에 전원을 공급하는 전원부, 상기 선반의 이동 을 제한 및 안내하는 가이드부, 상기 이동부 및 가이드부와 사용자를 연결하는 통신부 및 상기 이동부, 전원부, 가이드부 및 통신부를 제어하는 제어부를 포함한다.물론, 상기 통신부, 제어부는 그 용어에 한정되어 해석하지 않으며 필요 시 동시에 작동되거나 혼용 되어 사용될 수 있으며, 정보를 송신, 수신하고 지령을 할 수 있는 다양한 구성으로 변경, 추가될 수 있다. 본 발명에 따른 상기 선반은 이동 가능하도록 이동부를 가지며 상기 이동부는 그 형태나 구성에 제한 없이 이동의 효과를 제공하는 모든 것을 포함한다. 바람직하게는 도 2 등에 도시된 바와 같이 상기 선반 저면에 각각 마련되는 휠(바퀴, 111), 벨트 및 모터를 이용하여 상기 선반을 이동시킬 수 있다. 즉, 상기 이동부는 상기 선반의 저면에 2 내지 3 개의 휠과 상기 휠에 연결된 벨트를 이용하여 동력 전달을 통한 이동이 가능하며 사용자가 직접 밀거나 당기면서 이동할 수도 있을 것이다. 물론, 바람직하게는 상기 이동부의 효율적인 이동을 위해 상기 모터가 마련되고 상기 모터에 연 결된 상기 벨트의 운동을 통해 사용자의 동작 없이도 상기 선반이 이동하는 것이다. 또한, 동력전달, 구동을 위해 다양한 롤러(미도시)가 마련될 수 있으며, 링크 구조, 체인, 와이어 등 모든 구성 이 변경, 추가 되어 상기 선반의 이동을 진행할 수 있다. 도 3은 상술한 상기 이동부 부위를 확대한 도면으로서 각각의 선반 저면에 두 개의 바퀴 또는 휠 과 상기 휠을 전원과 연결하는 벨트, 그리고 상기 벨트와 연결되어 상기 휠을 회전하 기 위한 모터와 같은 구동부가 마련된다. 이때, 상기 모터의 회전 속도는 사용자의 선택 제어 또는 기 설정된 기준에 따라 차등적으로 진행될 수 있 다. 즉, 상기 모터의 회전 속도를 제어함으로써 적재되는 물품의 성격, 종류나 창고의 크기, 환경 등에 적 합하게 상기 선반이 이동될 수 있도록 하는 것이다. 상기 휠은 상기 선반과 적재된 물품의 하중을 견디기 위해 소정 크기 이상의 물성을 가지는 재질로 마련될 수 있으며, 필요 시 상기 선반의 하중을 견디고 충격을 완충하기 위한 별도의 완충부가 마련될 수 있다. 예컨대, 상기 완충부로는 스프링과 같은 탄성체를 상기 이동부에 마련함으로써 선반의 이동이 용이하고 상기 선반 및 창고 바닥에 가해지는 충격을 줄일 수 있을 것이다. 또한, 상기 이동부의 효율적인 구동과 동작을 위해 아이들러(idler) 풀리, 스프로킷, 캠축, 힌지 등 다양 한 구조가 적용될 수 있으며, 필요 시 상기 선반의 종류와 적재물의 종류, 창고의 환경 등에 따라 적합하 게 선택, 변경할 수 있다. 도 2에 도시된 바와 같이 본 발명에 따른 창고관리 시스템의 선반은 가이드부가 마련된다. 상기 가이드부는 상기 선반의 이동 범위를 제한하도록 상기 선반으로부터 일정 거리 이격되어 마련되 며 상기 가이드부 안에서 상기 선반이 이동하도록 한다. 즉, 상기 가이드부란 상기 선반의 이동 범위를 제한함으로써 뜻하지 않은 상기 선반의 이동에 따른 충격, 사고 등을 방지하고 이동을 예측할 수 있게 해주며, 필요 시 상기 가이드부를 이용하여 상기 선반을 일정 범위 이내에서만 이동할 수 있도록 한다. 상기 가이드부와 선반은 필요 시 접촉 또는 근접하여 마련될 수도 있으나 바람직하게는 도 4에 도시 된 바와 같이 일정 크기 이격되어 마련된다. 따라서, 상기 선반이 조금 유동적으로 상기 가이드부의 범위 이내에서 이동되는 것이다. 이를 위해 상기 가이드부와 선반 사이에는 이격을 위한 이격부(미도시) 또는 연결이나 체결을 위한 연결부(미도시) 등이 더 마련될 수 도 있다. 또한, 상기 가이드부 또는 선반에는 하나 이상의 센서부를 더 포함하여 상기 센서부에 의 해 상기 선반의 이동을 감지하고 상기 선반과 가이드부 사이의 거리를 감지하고 감지된 상기 정 보에 따라 상기 이동부를 구동하고 상기 선반의 이동을 안내할 수 있다. 상기 센서부는 위치, 동작 감지 센서, 적외선 측정센서, 레이저 변위감지 센서 등 사물의 이동이나 변위를 감지할 수 있는 다양한 모든 수단을 말하며, 상기 센서부의 측정 값은 후술할 통신부 또는 제어부 를 통해 사용자와의 통신이 가능하며 데이터 베이스로 가공 및 활용될 수 있다. 또한, 상기 가이드부는 사용자의 선택에 의해 크기, 길이, 위치가 변경되거나 조정될 수 있으며 변경된 상 기 가이드부에 따라 상기 선반이 적절하게 이동될 수 있다. 즉, 상기 선반의 이동 범위나 이동 속도를 결정하고 선택하기 위해 상기 가이드부를 변경이나 수정하면 되는 것이다. 사용자는 휴대용 단말을 이용하여 상기 이동부 및 가이드부를 제어하되 필요 시 근거리 통신망 인 와이 파이, 지그비, 비콘, 블루투스 및 3G, 4G, 5G 등의 이동 통신망 중 어느 하나 이상을 이용하고, 이를 통해 효과적인 상기 선반의 이동을 결정할 수 있다. 또한, 근거리 통신망 이외에 다양한 통신 수단을 이용하여 원거리에서도 제어할 수 있으며, 사용자와 송수신 된 데이터는 저장, 가공 및 활용되도록 딥 러닝 및 인공지능 기술을 이용하여 활용할 수도 있다. 따라서, 위와 같이 수집된 데이터를 이용하여, 선반의 이동이나 변경을 예측할 수 있으며 앞으로 발생할 수 있 는 사고나 문제를 예측하고 필요 시 사용자, 주변 기기 및 주변 장치에게 관련 정보를 제공 및 알람 할 수도 있 을 것이다. 도 5는 본 발명에 따른 이동식 선반을 이용한 창고관리 시스템의 구성 블록도이다. 도시된 바와 같이 사용자 는 직접 또는 간접적으로 상기 선반의 이동을 제어하고 확인할 수 있으며 이에 대한 정보는 별도의 서버 에 저장될 수도 있다. 도 5에 도시된 바와 같이 본 발명에 따른 이동식 선반은 물품이 수납되는 수납부, 상기 수납부 에 마련되는 이동부, 상기 이동부에 전원을 공급하는 전원부, 상기 선반의 이동을 제한하 고 안내하는 가이드부, 상기 선반 및 가이드부의 거리 및 이동을 감지하는 센서부 및 통신 부를 포함하는 것이다. 또한, 별도의 상기 서버와 단말, 데이터베이스 등을 포함하는 제어 부가 마련됨으로써 창고관리 시스템이 운용되는 것이다. 본 발명에 따른 창고관리 시스템 및 이동식 선반은 알람부(미도시) 및 안전부(미도시)를 더 포함할 수 있다. 상기 알람부는 사용자의 근접 또는 상기 선반의 이동을 시각적, 청각적 자극을 통해 알람 할 수 있 다. 즉 상기 센서부의 센싱 데이터 또는 필요 시 선택적으로 사용자의 주위를 환기하기 위한 알람 수단인 것이다."}
{"patent_id": "10-2019-0124500", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "또한, 상기 안전부는 상기 선반에서 낙하하거나 이탈하는 물품을 보호하고 유지하기 위한 수단으로 예컨대, 상기 선반이 이동하는 경우에 상기 선반에서 연장되어 형성되는 별도의 부재 또는 걸림부(미도시)가 마 련되어 낙하하는 물품을 보호할 수 있는 것이다. 또한, 상기 선반의 이동에 의한 안전사고를 방지하기 위해 상기 선반의 이동속도 제한, 이동범위 제한 및 필요 시 속도를 줄이거나 정지시키기 위한 스토퍼(미도시)가 더 마련될 수 있다. 상기 스토퍼는 상기 휠(바퀴) 에 마련될 수도 있으며 경우에 따라서는 상기 선반의 저면, 모터, 벨트 등에 마련될 수도 있을 것이다. 상기 센서부는 사용자의 사용을 돕기 위해 사용자의 접근을 감지하고 감지된 사용자와 가장 근접한 상기 선반이 각각 개방되도록 할 수 있으며, 필요 시 상기 선반의 이동속도를 측정하여 기 설정된 값 이상인 경 우 자동으로 정지 또는 감속하도록 상기 스토퍼를 동작시킬 수도 있다. 도 4 및 도 6은 사용자의 사용에 의한 선반의 이동상태를 보여주는 도면으로서 도시된 바와 같이 사용자가 사용 하려는 선반은 개방하여 사용함으로써 종래 사용되지 못했던 추가 공간을 확보할 수 있다. 즉, 사용하지 않는 경우 상기 선반을 밀착하여 보관함으로써 창고의 여유 공간을 가지게 되며, 사용하는 경우에만 상기 선반을 이 동시켜 사용한다. 도시된 바와 같이 상기 선반은 사용하지 않는 경우 각각 밀착하여 위치하고, 사용하는 경우 일정 크기 이 상 이격 되며, 상기 모터에 의한 구동 이외에, 전자석(미도시)을 이용하여 상기 선반을 이동할 수 있으며, 상기 선반이 밀착하는 경우 추가 체결수단을 마련함으로써 상기 선반의 위치를 고정할 수도 있을 것이다. 이상에서 설명한 본 발명은 전술한 실시예 및 첨부된 도면에 의해 한정되지 않으며, 본 발명의 기술적 사상 내 에서의 단순 치환, 변형 및 변경은 당 분야에서의 통상의 지식을 가진 자에게 명백한 것이다. 산업상 이용가능성 본 발명에 따른 창고관리 시스템은 이동식 선반을 이용함으로써 창고 공간의 효과적인 활용과 물품의 적재 및 보관을 효율적으로 관리할 수 있는 창고관리 시스템에 이용될 수 있다."}
{"patent_id": "10-2019-0124500", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술의 창고관리 시스템에 따른 창고에 관한 사진, 도 2는 본 발명에 따른 창고관리 시스템의 측면 설명도, 도 3은 본 발명에 따른 이동부의 부분 확대도, 도 4는 본 발명에 따른 창고관리 시스템의 작동설명 사시도, 도 5는 본 발명에 따른 창고관리 시스템의 구성 블록도, 도 6은 본 발명에 따른 창고관리 시스템의 활용에 관한 평면 설명도이다."}
