{"patent_id": "10-2022-0113152", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0034327", "출원번호": "10-2022-0113152", "발명의 명칭": "카메라를 이용한 검출 장치 및 그 방법", "출원인": "주식회사 켐트로닉스", "발명자": "오충재"}}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대응되는 제1 영상과 k+1 프레임에 대응되는 제2 영상을 획득하는 영상 획득부;상기 제1 영상에 포함된 물체를 인공지능 모델에 기초하여 검출하고, 물체 검출 결과에 따른 검출 정보를 생성하는 물체 검출부; 및상기 제1 영상 및 상기 제2 영상의 밝기 값을 분석하고, 상기 제1 영상 및 상기 제2 영상의 밝기 값과 상기 검출 정보에 기초하여 상기 제2 영상의 밝기 값을 비선형적으로 재배치하여 상기 제2 영상의 개선한 영상을 생성하는 영상 개선부를 포함하고,상기 물체 검출부는 상기 인공지능 모델이 상기 개선한 영상을 입력하여 물체 검출을 수행하는 카메라를 이용한검출 장치."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 인공지능 모델은 뉴럴넷 모델을 기반으로 하는 카메라를 이용한 검출 장치."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 물체 검출부는 상기 밝기 값을 재배치하여 생성한 상기 개선한 영상을 기반으로 상기 제1 영상에서 검출되지 않은 물체를 상기 제2 영상에서 검출하는 카메라를 이용한 검출 장치."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 영상 개선부는 상기 제1 영상과 상기 제2 영상의 밝기 값 분포 및 상기 검출 정보를 기 정의된 밝기 값 재배치 식에 입력하여 상기 제2 영상의 픽셀 별 밝기 값을 재배치하는 카메라를 이용한 검출 장치."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 영상 개선부는 상기 제1 영상에서 검출한 물체의 밝기 값과 상기 검출 물체를 제외한 영역에 대응되는 픽셀의 밝기 값의 차이가 기 정의된 차이 값보다 클 경우 상기 검출 물체의 대비를 높이고 상기 검출 물체를 제외한 영역의 대비를 낮추는 카메라를 이용한 검출 장치."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 개선한 영상을 송출하고, 상기 물체 검출 결과를 표시하는 디스플레이부를 더 포함하는 카메라를 이용한검출 장치."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "카메라를 이용한 검출 장치에 의해 수행되는 카메라를 이용한 검출 방법으로서,차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대응되는 제1 영상과 k+1 프레임에 대응되는 제2 영상을 획득하는 단계;공개특허 10-2024-0034327-3-상기 제1 영상에 포함된 물체를 인공지능 모델에 기초하여 검출하고, 물체 검출 결과에 따른 검출 정보를 생성하는 단계; 및상기 제1 영상 및 상기 제2 영상의 밝기 값을 분석하고, 상기 제1 영상 및 상기 제2 영상의 밝기 값과 상기 검출 정보에 기초하여 상기 제2 영상의 밝기 값을 비선형적으로 재배치하여 상기 제2 영상의 개선한 영상을 생성하는 단계를 포함하고,상기 검출 정보를 생성하는 단계는 상기 인공지능 모델이 상기 개선한 영상을 입력하여 물체 검출을 수행하는카메라를 이용한 검출 방법."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 인공지능 모델은 뉴럴넷 모델을 기반으로 하는 카메라를 이용한 검출 방법."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 검출 정보를 생성하는 단계는 상기 밝기 값을 재배치하여 생성한 상기 개선한 영상을 기반으로 상기 제1영상에서 검출되지 않은 물체를 상기 제2 영상에서 검출하는 카메라를 이용한 검출 방법."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제7항에 있어서,상기 개선한 영상을 생성하는 단계는 상기 제1 영상과 상기 제2 영상의 밝기 값 분포 및 상기 검출 정보를 기정의된 밝기 값 재배치 식에 입력하여 상기 제2 영상의 픽셀 별 밝기 값을 재배치하는 카메라를 이용한 검출 방법."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제7항에 있어서,상기 개선한 영상을 생성하는 단계는 상기 제1 영상에서 검출한 물체의 밝기 값과 상기 검출 물체를 제외한 영역에 대응되는 픽셀의 밝기 값의 차이가 기 정의된 차이 값보다 클 경우 상기 검출 물체의 대비를 높이고 상기검출 물체를 제외한 영역의 대비를 낮추는 카메라를 이용한 검출 방법."}
{"patent_id": "10-2022-0113152", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제7항에 있어서,상기 개선한 영상을 송출하고, 상기 물체 검출 결과를 표시하는 단계를 더 포함하는 카메라를 이용한 검출방법."}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따르면, 차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대응되는 제1 영상과 k+1 프 레임에 대응되는 제2 영상을 획득하는 영상 획득부; 상기 제1 영상에 포함된 물체를 인공지능 모델에 기초하여 검출하고, 물체 검출 결과에 따른 검출 정보를 생성하는 물체 검출부; 및 상기 제1 영상 및 상기 제2 영상의 밝 기 값을 분석하고, 상기 제1 영상 및 상기 제2 영상의 밝기 값과 상기 검출 정보에 기초하여 상기 제2 영상의 밝 기 값을 비선형적으로 재배치하여 상기 제2 영상의 개선한 영상을 생성하는 영상 개선부를 포함하고, 상기 물체 검출부는 상기 인공지능 모델이 상기 개선한 영상을 입력하여 물체 검출을 수행하는 카메라를 이용한 검출 장치 이다."}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 카메라를 이용한 검출 장치 및 그 방법에 관한 것이다."}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 차량 보조기능과 편의기능의 기술이 발전하면서 차량에 탑재되어 있는 카메라의 활용도가 증가하고 있다. 구체적으로, 차량의 보조기능과 편의기능을 제공하기 위해 발전된 기술들은 차량에 탑재되어 있는 카메라의 영 상을 단순히 사용자에게 제공하는 것뿐만 아니라, 카메라 영상을 딥러닝 기반으로 분석하여 영상 내의 물체를 탐지하고 사용자에게 정보를 제공하여 차량의 보조기능, 편의기능의 신뢰성과 안정성을 높일 수 있다. 카메라 영상 분석에 이용되는 딥러닝에 기반한 물체 검출 기능은 모델 학습 단계에서 다양한 영상을 학습 데이 터로 사용해야 한다. 그러나 모델이 모든 조건에 대하여 학습하도록 하는 것은 쉽지 않으며, 검출 목표 대상이 낮은 대비를 가지거나 배경과 충분히 구별되지 않을 경우, 검출율이 낮아질 수 있다. 또한, 강한 광원이 영상 내에 존재하면 광원이 포화되어 사람, 오토바이, 차량 등과 같은 다른 요소들의 대비는 낮아져, 물체와 배경의 경계가 모호해지고 검출 대상의 영역 정확도가 하락하여 검출율이 낮아진다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 공개특허 제 10-2013-0094997호 (특허문헌 0002) 대한민국 공개특허 제 10-2010-0029647호"}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 과제를 해결하기 위한 것으로서, 본 발명의 목적은 검출 목표 대상이 흐리고 대비가 부족할 경우, 과한 대비를 가진 광원의 대비를 낮추고 검출 목표 대상의 대비를 높여 딥러닝 기반 검출 모델의 부족한 부분을 보완하고 검출의 정확성을 높이는 카메라를 이용한 검출 장치 및 그 방법을 제공하는데 있다. 또한, 개선한 영상과 물체 검출의 정보를 사용자에게 제공함으로써 차량의 편의기능과 보조기능의 신뢰성과 안 정성을 제공할 수 있는 카메라를 이용한 검출 장치 및 그 방법을 제공하는데 있다."}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명은 카메라를 이용한 검출 장치로서, 차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대 응되는 제1 영상과 k+1 프레임에 대응되는 제2 영상을 획득하는 영상 획득부; 상기 제1 영상에 포함된 물체를 인공지능 모델에 기초하여 검출하고, 물체 검출 결과에 따른 검출 정보를 생성하는 물체 검출부; 및 상기 제1 영상 및 상기 제2 영상의 밝기 값을 분석하고, 상기 제1 영상 및 상기 제2 영상의 밝기 값과 상기 검출 정보에 기초하여 상기 제2 영상의 밝기 값을 비선형적으로 재배치하여 상기 제2 영상의 개선한 영상을 생성하는 영상 개선부를 포함하고, 상기 물체 검출부는 상기 인공지능 모델이 상기 개선한 영상을 입력하여 물체 검출을 수행 할 수 있다. 본 발명의 일 실시 예에 있어서, 상기 인공지능 모델은 뉴럴넷 모델을 기반으로 할 수 있다. 본 발명의 일 실시 예에 있어서, 상기 물체 검출부는 상기 밝기 값을 재배치하여 생성한 상기 개선한 영상을 기 반으로 상기 제1 영상에서 검출되지 않은 물체를 상기 제2 영상에서 검출할 수 있다. 본 발명의 일 실시 예에 있어서, 상기 영상 개선부는 상기 제1 영상과 상기 제2 영상의 밝기 값 분포 및 상기 검출 정보를 기 정의된 밝기 값 재배치 식에 입력하여 상기 제2 영상의 픽셀 별 밝기 값을 재배치할 수 있다. 본 발명의 일 실시 예에 있어서, 상기 영상 개선부는 상기 제1 영상에서 검출한 물체의 밝기 값과 상기 검출 물 체를 제외한 영역에 대응되는 픽셀의 밝기 값의 차이가 기 정의된 차이 값보다 클 경우 상기 검출 물체의 대비 를 높이고 상기 검출 물체를 제외한 영역의 대비를 낮출 수 있다. 본 발명의 일 실시 예에 있어서, 상기 개선한 영상을 송출하고, 상기 물체 검출 결과를 표시하는 디스플레이부 를 더 포함할 수 있다. 본 발명의 일 실시 예에 있어서, 카메라를 이용한 검출 장치에 의해 수행되는 카메라를 이용한 검출 방법으로서, 차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대응되는 제1 영상과 k+1 프레임에 대응되는 제2 영상을 획득하는 단계; 상기 제1 영상에 포함된 물체를 인공지능 모델에 기초하여 검출하고, 물체 검출 결과에 따른 검출 정보를 생성하는 단계; 및 상기 제1 영상 및 상기 제2 영상의 밝기 값을 분석하고, 상기 제1 영상 및 상기 제2 영상의 밝기 값과 상기 검출 정보에 기초하여 상기 제2 영상의 밝기 값을 비선형적으로 재배치하여 상기 제2 영상의 개선한 영상을 생성하는 단계를 포함하고, 상기 검출 정보를 생성하는 단계는 상기 인공지능 모델이 상기 개선한 영상을 입력하여 물체 검출을 수행하는 단계를 포함한다.본 발명의 일 실시 예에 있어서, 상기 인공지능 모델은 뉴럴넷 모델을 기반으로 하는 단계를 포함한다. 본 발명의 일 실시 예에 있어서, 상기 검출 정보를 생성하는 단계는 상기 밝기 값을 재배치하여 생성한 상기 개 선한 영상을 기반으로 상기 제1 영상에서 검출되지 않은 물체를 상기 제2 영상에서 검출하는 단계를 포함한다. 본 발명의 일 실시 예에 있어서, 상기 개선한 영상을 생성하는 단계는 상기 제1 영상과 상기 제2 영상의 밝기 값 분포 및 상기 검출 정보를 기 정의된 밝기 값 재배치 식에 입력하여 상기 제2 영상의 픽셀 별 밝기 값을 재 배치하는 단계를 포함한다. 본 발명의 일 실시 예에 있어서, 상기 개선한 영상을 생성하는 단계는 상기 제1 영상에서 검출한 물체의 밝기 값과 상기 검출 물체를 제외한 영역에 대응되는 픽셀의 밝기 값의 차이가 기 정의된 차이 값보다 클 경우 상기 검출 물체의 대비를 높이고 상기 검출 물체를 제외한 영역의 대비를 낮추는 단계를 포함한다. 본 발명의 일 실시 예에 있어서, 상기 개선한 영상을 송출하고, 상기 물체 검출 결과를 표시하는 단계를 더 포 함하는 단계를 포함한다."}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 의하면, 카메라를 이용한 검출 장치 및 그 방법은 인공지능 모델에 개선한 영상을 제공하여 물체 검 출의 정확성을 높이는 데에 기여할 수 있다. 또한, 본 발명은 개선한 영상과 정확성이 높은 검출 결과를 디스플레이에 표시하여 사용자에게 전달하고 차량의 편의 기능과 보조 기능의 안정성과 신뢰성을 높이는 데에 기여할 수 있다."}
{"patent_id": "10-2022-0113152", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서, 본 발명의 기술 분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실시할 수 있을 정도로, 본 발명의 실시 예들이 명확하고 상세하게 기재될 것이다. 도 1은 본 출원의 실시 예에 따른 카메라를 이용한 검출 장치의 블록도이다. 도 1을 참조하면, 카메라를 이용한 검출 장치는 영상 획득부와 영상 처리부를 포함한다. 영상 획득부는 차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대응되는 제1 영상과 k+1 프레임에 대응되는 제2 영상을 획득할 수 있다. 구체적으로, 영상 획득부는 차량에 탑재되어 있는 뷰 이미지(View Image)를 제공하는 전방 카메라, 후방 카메라 및 사이드 카메라 등으로부터 제1 영상을 획득할 수 있다. 또한, 본 발명의 일 실시예로 뷰 이미지를 제 공하는 카메라를 설명하나 이에 제한되는 것은 아닐 것이다. 영상 처리부는 영상 획득부에서 획득한 제1 영상에서 인공지능 모델을 이용하여 물체를 검출하고 제1 영상 및 제2 영상의 밝기 값을 기반으로 밝기 값이 조정된 개선한 영상을 생성할 수 있다. 또한, 영상 처리부는 개선한 영상에서 물체를 검출하여 물체 검출 정확도를 높일 수 있다. 영상 처리부는 물체 검출부와 영상 개선부를 포함한다. 물체 검출부는 제1 영상에 포함된 물체를 인공지능 모델에 기초하여 검출하고, 물체 검출 결과에 따른 검 출 정보를 생성할 수 있다.구체적으로, 물체 검출부는 제1 영상을 수신하고, 기계학습, 지도학습, 준 지도학습 등으로 학습된 물체를 검출하기 위해 구성된 인공지능 모델을 기반으로 물체를 검출할 수 있다. 또한, 본 발명의 일 실시예로 상술한 물체 모델 학습 방법을 예시하지만 이에 한정되는 것은 아닐 것이다. 인공지능 모델의 일 예로, 뉴럴넷(Neural Network) 모델이 사용될 수 있다. 뉴럴넷 모델은 생물학적인 뉴런을 수학적으로 모델링 한 것으로서, 조정이 가능한 가중치들로 구성된 매개변수 를 구성하고 입력의 비선형 함수를 유추할 수 있다. 구체적으로, 뉴럴넷 모델은 입력층(Input Layer)에서 정보를 수신하고 조정이 가능한 가중치들로 구성된 숨긴층 (Hidden Layer)에서 가중치에 따라 정보를 변환하여 출력층(Output Layer)으로 정보를 출력할 수 있다. 예를 들어, 물체 검출부는 학습된 인공지능 모델의 입력층에 제1 영상을 입력시키고, 카메라로부터 획득된 영상 으로부터 물체를 검출하기 위하여 설정된 가중치를 갖는 숨긴층을 통해 물체 검출 결과에 대응되는 출력 데이터 를 출력층으로 출력할 수 있다. 또한, 물체 검출부는 물체 검출 결과에 따른 물체 검출 정보를 생성하고, 물체 검출 정보를 영상 개선부 에 송신할 수 있다. 또한, 물체 검출부는 후술할 영상 개선부로부터 개선한 영상을 수신할 수 있다. 구체적으로, 물체 검출부는 개선한 영상에 인공지능 모델을 적용하여 제1 영상에서 검출되지 않은 물체를 검출할 수 있다. 영상 개선부는 검출 물체의 정보와 제1 영상 및 제2 영상의 밝기 값 분포를 계산하여 밝기 값을 비선형적 으로 재배치할 수 있다. 구체적으로, 영상 개선부는 OpenCV나 Python 등의 알고리즘을 이용하여 영상 내의 밝기 값 분포를 계산한 다. 또한, 본 발명의 일 실시예로 OpenCV와 Python 등의 알고리즘을 예시하였지만 이에 한정되는 것은 아니며, 이하 본 발명에서는 편의상 OpenCV를 예로 설명하나 이에 제한되는 것은 아닐 것이다. 예를 들어, 영상 개선부는 영상을 OpenCV를 이용하여 영상의 밝기 값을 히스토그램으로 도출할 수 있다. 히스토그램은 표로 되어 있는 도수 분포를 정보를 그림으로 나타낸 것으로서, 영상 개선부는 영상의 명암 비 분포를 계산하여 히스토그램이 낮은 영역과 높은 영역을 조정하여 검출 물체와 검출 물체 이외의 영역의 명 확도를 증가시킬 수 있다. 다음으로, 영상 개선부는 계산한 밝기 값 분포를 기반으로 검출한 물체의 밝기 값과 검출 물체를 제외한 영역에 대응되는 픽셀의 밝기 값의 차이가 기 정의된 차이 값보다 클 경우, 영상 개선부는 제2 영상의 밝 기 값을 비선형적으로 재배치하여 검출 물체의 대비를 높이고 검출 물체를 제외한 영역의 대비를 낮춤으로써 개 선된 영상을 획득할 수 있다. 이후, 영상 개선부는 개선된 영상을 물체 검출부에 송신할 수 있다. 도 1의 실시예에 따라 카메라를 이용한 검출 장치는 검출 물체의 정보와 영상의 밝기 값을 기반으로 검출 물체의 대비를 높여 개선한 영상을 생성할 수 있다. 또한, 개선한 영상에 뉴럴넷 모델의 인공지능을 적용하여 물체 검출 성능을 향상시킬 수 있다. 도 2는 본 발명의 일 실시예에 따른 개선한 영상의 영상 및 검출 결과를 도시하는 도면이다. 도 2에 도시된 바와 같이 본 발명은 상기 서술한 영상 처리부의 수행으로 영상 및 검출 결과 비교를 할 수 있다. 영상 처리부는 개선 전의 영상을 개선 후의 영상으로 변환함으로써, 영상의 낮은 화질 및 물체 의 낮은 대비로 인해 제대로 검출되지 않았던 물체와 검출되지 않았던 물체을 검출할 수 있다. 도 3은 본 발명의 다른 일 실시예에 따른 카메라를 이용한 검출 장치의 블록도이다. 이하에서는, 앞서 설명한 부분과 중복되는 부분에 대한 상세한 설명은 생략한다. 도 3을 참조하면, 다른 일 실시예에 따른 카메라를 이용한 검출 장치는 영상 획득부와 영상 처리부 에 더하여, 디스플레이부를 추가로 포함할 수 있다.영상 획득부는 차량에 탑재된 카메라의 영상을 획득하고 영상 처리부에 송신한다. 영상 처리부 의 물체 검출부는 영상을 수신하여 뉴럴넷 모델을 기반으로 한 인공지능을 적용하여 물체를 검출한다. 또 한, 물체 검출부는 검출 물체 정보를 영상 개선부에 송신하며, 영상 개선부는 검출 물체 정보와 제1 영상 및 제2 영상의 밝기 값 분포를 계산하고, 검출 물체와 검출 물체 이외의 영역의 대비 차이가 기 정의 된 차이 값보다 클 경우 픽셀 별 밝기 값을 재배치하여 개선한 영상을 생성할 수 있다. 영상 개선부는 픽셀 별 밝기 값을 재배치하여 생성한 개선한 영상을 물체 검출부의 인공지능 모델에 제공하여 제1 영상에서 검출한 물체와 제1 영상에서 검출되지 않은 물체를 검출할 수 있다. 디스플레이부는 영상 송출부와 검출 표시부를 포함한다. 디스플레이부에 포함되는 디스플레이는 LCD 디스플레이 장치, TFT 디스플레이 장치 및 프로젝션 장치와 같 은 디스플레이 장치일 수 있지만 이에 한정되는 것은 아닐 것이다. 영상 송출부는 영상 개선부에서 개선한 영상 수신받아 차량의 디스플레이에 송출할 수 있다. 검출 표시부는 물체 검출부에서 검출된 물체의 정보를 수신받아 차량의 디스플레이에 표시할 수 있다. 도 4는 본 발명의 일 실시예에 따른 카메라를 이용한 검출 방법에 관한 흐름도이다. 도 4에 도시된 바와 같이, 카메라를 이용한 검출 장치는 영상 획득부에서 제1 영상을 획득(S301)한다. 물체 검출부는 S301 단계에서 획득한 영상을 수신하여 물체 검출(S302)를 수행한다. 영상 개선부는 S302 단계에서 획득한 물체 검출 정보와 제1 영상 및 제2 영상의 밝기 값 분포를 기반으로 제2 영상을 개선한 영상으로 생성(S303)한다. 물체 검출부는 S303 단계에서 생성한 개선한 영상을 수신하여 개선한 영상 내의 물체 검출(S304)를 수행한 다. 디스플레이부는 S304 단계에서 획득한 개선한 영상 내의 물체 검출 정보를 수신하여 개선한 영상 송출 및 정보를 표시(S305)한다. 도 5는 본 발명의 일 실시예에 따른 화질 개선 영상을 수행하기 위한 흐름도이다. 도 5에 도시된 바와 같이, 영상 개선부는 영상 획득부와 물체 검출부에서 카메라 영상 및 검출 정보를 수신(S401)한다. 영상 개선부는 S401 단계에서 획득한 제1 영상과 제2 영상의 밝기 값 분포 및 검출 정보를 계산(S402)한다. 영상 개선부는 S402 단계에서 획득한 밝기 값 정보를 기반으로 밝기 값 재배치 식을 계산(S403)한다. 재배치 식은 히스토그램의 범위를 확장시켜 최저 밝기 값과 최고 밝기 값의 차이를 증가시킨다. 이후, 영상 개 선부는 재배치 식에 기초하여 재배치할 픽셀의 밝기 값에서 최저 밝기 값과 차이를 계산하고, 범위가 확장 된 범위비를 곱하여 재배치할 픽셀의 밝기 값을 구할 수 있다. 영상 개선부는 S403 단계에서 획득한 재배치 식을 기반으로 영역별 밝기 값 재배치(S404)를 수행한다. 영상 개선부는 S404 단계를 수행하여 개선한 영상을 생성(S405)한다. 도 6은 본 발명의 일 실시예에 따른 밝기 값 재배치를 수행하기 위한 흐름도이다. 도 6에 도시된 바와 같이, 영상 개선부는 제1 영상과 제2 영상의 밝기 값 분포 및 검출 정보를 계산(S50 1)한다. 영상 개선부는 S501단계에서 획득한 밝기 값 정보를 기반으로 영상 내 물체의 대비를 개선하기 위해 검출 물체의 밝기 값과 검출 물체 이외의 밝기 값을 비교(S502)한다. 영상 개선부는 S502 단계에서 비교 데이터가 기 정의된 차이 값을 초과하는지(S503) 여부를 판단한다. 영상 개선부는 S503 단계에서 검출 물체와 검출 물체 이외의 영역의 대조가 기 정의된 차이 값이 초과된 경우에는 대조를 조절하기 위해 픽셀 별 밝기 값 조정(S504)를 수행하고, 영상 개선부는 개선한 영상을 생 성(S505)한다. 영상 개선부는 S503 단계에서 검출 물체와 검출 물체 이외의 영역의 대조가 기 정의된 차이 값이 이하인 경우 개선한 영상을 생성(S505)한다. 상술한 일 실시예에 따라 본 발명은 카메라의 영상을 기반으로 개선한 영상과 개선한 영상을 기반으로 정확성을 높인 물체 검출 정보를 디스플레이에 송출하여 사용자에게 신뢰성과 안정성을 제공할 수 있다. 또한, 본 발명은 차량에 탑재된 카메라로부터 k 프레임(여기서, k는 자연수임)에 대응되는 제1 영상과 k+1 프레 임에 대응되는 제2 영상의 밝기 값을 분석하고 물체 검출 정보를 비교하여 영상의 광원을 낮추고 물체의 대비를 높여 목표 물체와 이외의 영역의 대조를 개선시켜 물체 검출 정확성을 높일 수 있다. 상술한 내용은 본 발명을 실시하기 위한 구체적인 실시 예들이다. 본 발명은 상술한 실시 예들 이외에도, 단순 하게 설계 변경되거나 용이하게 변경할 수 있는 실시 예들도 포함될 것이다. 또한, 본 발명은 실시 예들을 이용 하여 용이하게 변형하여 실시할 수 있는 기술들도 포함될 것이다. 따라서, 본 발명의 범위는 상술한 실시 예들 에 국한되어 정해져서는 안되며, 후술하는 특허청구범위뿐만 아니라 이 발명의 특허청구범위와 균등한 것들에 의해 정해져야 할 것이다."}
{"patent_id": "10-2022-0113152", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 발명의 일 실시예에 따른 카메라를 이용한 검출 장치의 블록도이다. 도 2는 본 발명의 일 실시예에 따라 개선한 영상의 영상 및 검출 결과를 도시하는 도면이다. 도 3는 본 발명의 다른 일 실시예에 따라 카메라를 이용한 검출 장치 및 그 방법의 블록도이다. 도 4는 본 발명의 일 실시예에 따라 카메라를 이용한 검출 방법에 관한 흐름도이다. 도 5는 본 발명의 일 실시예에 따라 화질 개선 영상을 수행하기 위한 흐름도이다. 도 6은 본 발명의 일 실시예에 따라 밝기 값 재배치를 수행하기 위한 흐름도이다."}
