{"patent_id": "10-2022-0093797", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0015925", "출원번호": "10-2022-0093797", "발명의 명칭": "무선 통신 시스템에서 브로드캐스트 서비스를 제공하기 위한 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "백영교"}}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서, 기지국(base station)에 의해 수행되는 방법에 있어서,AF(application function)로부터, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된브로드캐스트 서비스(broadcast service)에 대한 정보를 수신하는 단계;상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 상기 제2 프라이머리 TMGI로 업데이트가 필요한 경우, 상기 제2 프라이머리 TMGI와 관련된 제1 메시지를AMF(access and mobility management function)에게 전송하는 단계; 및상기 제1 메시지에 대한 응답으로, 상기 제2 프라이머리 TMGI와 관련된 제2 메시지를 상기 AMF으로부터 수신하는 단계를 포함하고,상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유되는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서, 상기 방법은, 상기 제1 프라이머리 TMGI에 대한 브로드캐스트 세션(broadcast session)을 해제하기 위한 메시지를 상기 AMF에게 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 1에 있어서, 상기 제1 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브로드캐스트 서비스와 관련된 터널 정보(tunnel information)을 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 4에 있어서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적인 주소 정보 중적어도 하나를 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "무선 통신 시스템에서, AF(application function)에 의해 수행되는 방법에 있어서,공개특허 10-2024-0015925-3-기지국(base station)에게, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 전송하는 단계;상기 제1 프라이머리 TMGI에 대한 브로드캐스트 세션(broadcast session)이 해제되었음을 지시하는 정보를 포함하는 제1 메시지를 NEF(network exposure function)으로부터 수신하는 단계; 및 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI에 대한 정보를 포함하는 제2 메시지를 상기 NEF에게 전송하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유되는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서, 상기 방법은, 상기 NEF로부터, 상기 제2 메시지에 대한 응답 메시지를 수신하는 단계를 더 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 8에 있어서, 상기 응답 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브로드캐스트 서비스와 관련된 터널 정보(tunnel information)을 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 9에 있어서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적인 주소 정보 중적어도 하나를 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "에 있어서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 11에 있어서, 상기 방법은, 상기 제1 프라이머리 TMGI에 대한 브로드캐스트 세션(broadcast session)을 해제하기 위한 메시지를 상기 AMF에게 전송하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 11에 있어서, 상기 방법은, 상기 제2 프라이머리 TMGI로 업데이트가 필요한 경우, 상기 제2 프라이머리 TMGI와 관련된 제3 메시지를 상기AMF에게 전송하는 단계를 더 포함하고,상기 제3 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브로드캐스트 서비스와 관련된 터널 정보(tunnel information)을 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 14에 있어서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적인 주소 정보 중적어도 하나를 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "에 있어서, 상기 방법은, 상기 NEF로부터, 상기 제1 메시지에 대한 응답 메시지를 수신하는 단계를 더 포함하고,상기 응답 메시지는 상기 제1 프라이머리 TMGI에 대한 정보를 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 16에 있어서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공하는 것인, 방법.공개특허 10-2024-0015925-5-청구항 18"}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 16에 있어서, 상기 방법은,상기 제2 프라이머리 TMGI에 대한 정보를 포함하는 제2 메시지를 상기 NEF에게 전송하는 단계; 및상기 제2 메시지에 대한 응답 메시지를 수신하는 단계를 더 포함하고,상기 제2 메시지에 대한 응답 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기브로드캐스트 서비스와 관련된 터널 정보(tunnel information)을 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 19에 있어서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적인 주소 정보 중적어도 하나를 포함하는 것인, 방법."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시는 무선 통신 시스템에서, 기지국(base station)에 의해 수행되는 방법과 관련될 수 있다. 방법은, AF(application function)로부터, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비 스(broadcast service)에 대한 정보를 수신하는 단계; 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 상기 제2 프라이머리 TMGI로 업데이트가 필요한 경우, 상기 제2 프 라이머리 TMGI와 관련된 제1 메시지를 AMF(access and mobility management function)에게 전송하는 단계; 및 상기 제1 메시지에 대한 응답으로, 상기 제2 프라이머리 TMGI와 관련된 제2 메시지를 상기 AMF으로부터 수신하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시(disclosure)는 무선 통신 시스템에 관한 것으로, 브로드캐스트 서비스를 제공하기 위한 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz, THz) 대역(예를 들어, 95GHz에서 3 테라헤르츠 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 상술한 것과 무선통신 시스템의 발전에 따라 다양한 서비스를 제공할 수 있게 됨으로써, 이러한 서비스들을 원 활하게 제공하기 위한 방안이 요구되고 있다. 특히, 무선 통신 시스템에서 브로드캐스트 서비스를 제공하기 위 한 기술이 요구되고 있다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "개시된 실시예는 이동 통신 시스템에서 서비스를 효과적으로 제공할 수 있는 장치 및 방법을 제공하고자 한다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시 예들에 따르면, 무선 통신 시스템에서, 기지국(base station)에 의해 수행되는 방법에 있어서, AF(application function)로부터, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 수신하는 단계; 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 상기 제2 프라이머리 TMGI로 업데이트가 필요한 경우, 상기 제2 프라이머리 TMGI와 관련된 제1 메시지를 AMF(access and mobility management function)에게 전송하는 단계; 및 상기 제1 메시지에 대한 응답으로, 상기 제2 프라이머리 TMGI와 관련된 제2 메시지를 상기AMF으로부터 수신하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다. 본 개시의 실시 예들에 따르면, 무선 통신 시스템에서, AF(application function)에 의해 수행되는 방법에 있어 서, 기지국(base station)에게, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브 로드캐스트 서비스(broadcast service)에 대한 정보를 전송하는 단계; 상기 제1 프라이머리 TMGI에 대한 브로드 캐스트 세션(broadcast session)이 해제되었음을 지시하는 정보를 포함하는 제1 메시지를 NEF(network exposure function)으로부터 수신하는 단계; 및 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI에 대한 정보를 포함하는 제2 메시지를 상기 NEF에게 전송하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업 자에 서비스를 제공하기 위하여 공유될 수 있다. 본 개시의 실시 예들에 따르면, 무선 통신 시스템에서, 기지국(base station)에 의해 수행되는 방법에 있어서, AF(application function)로부터, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 수신하는 단계; 상기 제1 프라이머리 TMGI와 관련된 브 로드캐스트 서비스를 삭제하기 위한 정보를 포함하는 제1 메시지를 AMF(access and mobility management function)로부터 수신하는 단계; 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 및 상기 제2 프라이머리 TMGI에 대한 정보를 전송하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다. 본 개시의 실시 예들에 따르면, 무선 통신 시스템에서, AF(application function)에 의해 수행되는 방법에 있어 서, 기지국(base station)에게, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브 로드캐스트 서비스(broadcast service)에 대한 정보를 전송하는 단계; 상기 제1 프라이머리 TMGI와 다른 제2 프 라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 및 상기 제1 프라이머리 TMGI와 관련된 브로드캐 스트 서비스를 삭제하기 위한 정보를 포함하는 제1 메시지를 NEF(network exposure function)를 통하여 SMF(session management function)에게 전송하는 단계를 포함하고, 상기 제1 메시지는 상기 제2 프라이머리 TMGI에 대한 정보를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "개시된 실시예는 이동통신 시스템에서 서비스를 효과적으로 제공할 수 있는 장치 및 방법을 제공한다. 본 개시에서 얻을 수 있는 효과는 다양한 실시예들에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다 른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부된 도면을 참조하여 본 발명의 동작 원리를 상세히 설명한다. 하기에서 본 발명을 설명하기에 있어 관 련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우 에는 그 상세한 설명을 생략할 것이다. 그리고 후술되는 용어들은 본 발명에서의 기능을 고려하여 정의된 용어 들로서 이는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반 에 걸친 내용을 토대로 내려져야 할 것이다. 마찬가지 이유로 첨부 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성요소에 는 동일한 참조 번호를 부여하였다. 본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나 본 발명은 이하에서 개시되는 실시 예들에 한정되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시 예들은 본 발명의 개시가 완전하도록 하고, 본 발명이"}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 명세서 전체에 걸쳐 동일 참조 부호는 동일 구성 요소를 지칭한다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들(instruction s)에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수 용 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또 는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프 로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하 는 것도 가능하다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예컨대, 잇달아 도시되어 있는 두 개의 블록들 은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으로 수행되는 것도 가능하다. 이 때, 본 실시 예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또 는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할 들을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있 다. 또한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 하기에서 본 개시를 설명함에 있어 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 개시의 요지를 불필 요하게 흐릴 수 있다고 판단되는 경우에는 그 상세한 설명을 생략할 것이다. 이하 첨부된 도면을 참조하여 본 개시의 실시 예를 설명하기로 한다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 네트워크 객체(network entity, NF)들을 지칭 하는 용어, 메시지들을 지칭하는 용어, NF들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등은 설명의 편의를 위해 예시된 것이다. 따라서, 본 개시에서 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 본 개시에서 사용되는 용어들은 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 다른 실시 예의 범위를 한정하려는 의도가 아닐 수 있다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함 할 수 있다. 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 용어들은 본 개시에 기재된 기술 분야에 서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가질 수 있다. 본 개시에 사용된 용 어들 중 일반적인 사전에 정의된 용어들은, 관련 기술의 문맥상 가지는 의미와 동일 또는 유사한 의미로 해석될 수 있으며, 본 개시에서 명백하게 정의되지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 경우에 따라서, 본 개시에서 정의된 용어일지라도 본 개시의 실시 예들을 배제하도록 해석될 수 없다. 이하에서 설명되는 본 개시의 다양한 실시 예들에서는 하드웨어적인 접근 방법을 예시로서 설명한다. 하지만, 본 개시의 다양한 실시 예들에서는 하드웨어와 소프트웨어를 모두 사용하는 기술을 포함하고 있으므로, 본 개시 의 다양한 실시 예들이 소프트웨어 기반의 접근 방법을 제외하는 것은 아니다. 이하 편의를 위하여, 본 발명은개시는 현재 존재하는 통신표준 가운데 3GPP (The 3rd Generation Partnership Project) 단체에서 정의하는 가장 최신의 표준인 LTE 및 NR 규격에서 정의하고 있는 용어 및 명칭들을 사용한다. 하지만, 본 발명이 상기 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시스템에 도 동일하게 적용될 수 있다. 특히 본 발명은 3GPP NR (5세대 이동통신 표준)에 적용할 수 있다. 또한, 유사한 기술적 배경 또는 채널형태를 갖는 여타의 통신시스템에도 본 개시의 실시예가 적용될 수 있다. 또한, 본 개시 의 실시 예는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 이하 본 개시는 무선 통신 시스템에 관한 것으로, 브로드캐스트 데이터 전송을 효율적으로 하기 위한 방법 및 장치를 개시한다. 구체적으로, 본 개시는 공유 기지국에서 브로드캐스트 서비스를 위한 세션을 업데이트하기 위 한 방안을 제안한다. 브로드캐스트 서비스를 지원하는 무선 통신 시스템에서 여러 사업자들이 NG-RAN을 공유하 고(즉 MOCN(multi operator core network) 방식으로 NG-RAN이 공유되는 경우), 각 사업자가 동일한 브로드캐스 트 서비스 제공자로부터 동일한 서비스를 하는 경우, NG-RAN에서 하나의 TMGI(temporary mobile group identity)(예, primary TMGI)를 통해서 서비스를 제공할 수 있다. NG-RAN이 하나의 TMGI를 통해 서비스를 제공 함에 따라, 중첩된 브로드캐스트 데이터 전송을 줄여서 리소스를 절약하여 사용하는 경우, primary TMGI의 업데 이트를 수행하기 위한 기술을 설명한다. 이하 설명에서 사용되는 접속 노드(node)를 식별하기 위한 용어, 망 객체(network entity)들을 지칭하는 용어, 메시지들을 지칭하는 용어, 망 객체들 간 인터페이스를 지칭하는 용어, 다양한 식별 정보들을 지칭하는 용어 등 은 설명의 편의를 위해 예시된 것이다. 따라서, 본 발명이 후술되는 용어들에 한정되는 것은 아니며, 동등한 기 술적 의미를 가지는 대상을 지칭하는 다른 용어가 사용될 수 있다. 예를 들어, 신호를 지칭하는 용어(예: 메시 지, 정보, 프리앰블, 신호, 시그널링(signaling), 시퀀스(sequence), 스트림(stream))), 연산 상태를 위한 용 어(예: 단계(step), 동작(operation), 절차(procedure)), 데이터를 지칭하는 용어(예: 패킷(packet), 사용자 스트림, 정보(information), 비트(bit), 심볼(symbol), 코드워드(codeword)), 채널을 지칭하는 용어, 제어 정 보를 지칭하는 용어(예: DCI(downlink control information), MAC CE(medium access control control element), RRC(radio resource control) signaling), 네트워크 객체(network entity)들을 지칭하는 용어, 네트워크 객체들 간 인터페이스(예: N1, N2, N3 등)를 지칭하는 용어, 장치의 구성 요소를 지칭하는 용어 등은 설명 의 편의를 위해 예시된 것이다. 따라서, 본 개시가 후술되는 용어들에 한정되는 것은 아니며, 동등한 기술적 의 미를 가지는 다른 용어가 사용될 수 있다. 또한, 본 개시는, 일부 통신 규격(예: 3GPP(3rd Generation Partnership Project))에서 사용되는 용어들을 이 용하여 다양한 실시 예들을 설명하지만, 이는 설명을 위한 예시일 뿐이다. 본 개시의 다양한 실시 예들은, 다른 통신 시스템에서도, 용이하게 변형되어 적용될 수 있다. 브로드캐스트(broadcast) 서비스를 제공하기 위해 5GS(5G system)는 브로드캐스트 서비스 데이터를 AF(Application Function) 또는 컨텐츠 제공자(Contents provider)로부터 수신할 수 있다. 5GS는 NG-RAN(new generation-radio access network)에게 브로드캐스트 서비스 데이터를 전달하여 원하는 위치의 단말들에게 브로 드캐스트 서비스 데이터를 보낼 수 있다. 본 개시의 실시예에 따르면, NG-RAN은 기지국(Base Station)을 포함할 수 있다. 5G 코어 네트워크에서 브로드캐스트 데이터를 5G 네트워크의 기지국인 NG-RAN에게 공유 전송(shared delivery)을 통하여 전달할 수 있다. 즉, NG-RAN이 멀티캐스트/브로드캐스트 서비스(Multicast/Broadcast service, MBS) 능력(capability)이 있는 경우, 브로드캐스트 서비스를 제공하는 사용자 평면 기능 (Multicast/Broadcast User Plane Function, MB-UPF)에서 NG-RAN까지 공유 전송(shared delivery)를 위한 터널 을 통해 브로드캐스트 서비스 데이터를 보낼 수 있다. 설명의 편의를 위하여 5G 네트워크를 예로 설명하나, 본 개시의 실시예가 5G 코어 네트워크 및 5G 네크워크에만 적용되도록 제한 해석되어서는 안된다. NG-RAN이 MOCN으로서 여러 사업자들 사이에 RAN sharing을 하는 경우, 컨텐츠 제공자가 각 사업자들에 대해서 동일한 브로드캐스트 서비스를 하는 경우, NG-RAN은 primary TMGI(Temporary Mobile Group Identity)에 기반하 여 브로드캐스팅(broadcasting)할 수 있다. 이 때, NG-RAN의 상황 또는 primary TMGI를 서비스하던 사업자망의 변경 등으로 인해 primary TMGI의 업데이트가 요구될 수 있다. 이하 설명되는 본 개시의 실시예에 따른 장치 및 방법은, 5GS(5G system)에서 사업자들에 의해 RAN sharing된 NG-RAN에서 사업자들이 동일한 브로드캐스트 서비스를 제공하는 경우, primary TMGI를 통해 중첩된 리소스 사용 을 줄이면서 브로드캐스트 서비스를 제공할 때, primary TMGI의 업데이트를 수행할 수 있다. 이에 따라, 본 개 시의 실시예에 따른 장치 및 방법은 primary TMGI의 업데이트를 통해 브로드캐스트 서비스를 지속적으로 제공할 수 있다. 상술한 바와 같은 논의를 바탕으로, 본 개시(disclosure)는, 무선 통신 시스템에 관한 것으로, 브로드캐스트 서 비스를 지원하는 무선 통신 시스템에서 여러 사업자들이 NG-RAN을 공유하고(즉 MOCN(multi operator core network) 방식으로 NG-RAN이 공유되는 경우), 각 사업자가 동일한 브로드캐스트 서비스 제공자로부터 동일한 서 비스를 제공하는 경우, NG-RAN에서 primary TMGI를 통해 브로드캐스트 서비스를 제공할 수 있다. 본 개시는, 중 첩된 리소스 사용을 줄이면서 NG-RAN에서 브로드캐스트 서비스를 제공할 때, primary TMGI를 업데이트하기 위한 방법 및 장치를 제공한다. 또한, 본 개시는, 무선 통신 시스템에서 브로드캐스트 서비스 데이터가 RAN sharing된 NG-RAN에서 단말들이 primary TMGI가 업데이트될 때, 브로드캐스트 데이터들을 지속적으로 수신하도록 하기 위한 동작하기 위한 방법 및 장치를 제공한다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 아래의 기재로부터 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 또한 이하의 설명에서는 설명의 편의를 위하여, 5G 시스템에 대한 규격에서 정의하는 용어와 명칭들을 사용한다. 하지만, 본 개시가 상술한 용어 및 명칭들에 의해 한정되는 것은 아니며, 다른 규격에 따르는 시스템 에도 동일하게 적용될 수 있다."}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 3, "content": "도 1은 본 개시의 실시예에 따른 무선 통신 시스템에서 5G 시스템 구조(5G system, 5GS)에 대한 예를 도시한다. 도 1의 5G 시스템(5GS)은 설명의 편의를 위한 예시로써, 본 개시의 실시예가 도 1의 5GS 구조에만 적 용되도록 해석될 것은 아니다. 도 1을 참조하면, 5GS는 사용자 장치(user equipment, UE), 기지국인 NG-RAN, 액세스 및 이동 성 관리 기능(Access and Mobility Management Function, AMF), 멀티캐스트/브로드캐스트 사용자 평면 기 능(multicast/broadcast User Plane Function, MB-UPF), 멀티캐스트/브로드캐스트 세션 관리 기능 (multicast/broadcast-Session Management Function, MB-SMF), 정책 제어 기능(Policy Control Function, PCF), 세션 관리 기능(Session Management Function, SMF), 네트워크 노출 기능(Network Exposure Function, NEF), 멀티캐스트/브로드캐스트 서비스 기능(multicast/broadcast service function, MBSF), 멀티캐스트/브로드캐스트 서비스 트래픽 기능(multicast/broadcast service traffic function, MBSTF), 어플리케이션 기능(Application Function, AF) 장치 또는 컨텐츠 제공자(contents provider), 및 통합된 데이터 관리(Unified Data Management, UDM), 사용자 평면 기능(User Plane Function, UPF), 인증 서버 기능(authentication server function, AUSF), NF 저장소 기능(NF repository function, NRF)를 포함할 수 있다. 5GS가 포함하는 네트워크 엔티티들은 상기 예시에 제 한되지 않으며, 5GS는 도 1에 도시된 구성보다 더 적거나 더 많은 구성을 포함할 수 있다. 여기서, 각 장 치는 네트워크 엔티티(Network Entity), 네트워크 기능(Network function) 또는 네트워크 기능 장치(Network Function Apparatus)로 지칭될 수 있다. 도 1을 참고하면, 5GS의 각 네트워크 기능(network function, NF)들에 대하여 \"네트워크 엔티티\" 또는 \" 네트워크 기능\" 그 자체로 설명한다. 그러나, 본 기술 분야의 통상의 기술자에게, NF 및/또는 NF 장치가 특정한 하나 또는 둘 이상의 서버에 구현될 수도 있고, 동일한 동작을 수행하는 둘 이상의 NF가 하나의 서버에 구현될 수도 있다는 것은 자명하다. 또한 본 개시의 실시예에 따르면, 하나의 NF 또는 둘 이상의 NF들은 하나의 네트워크 슬라이스(network slice) 로 구현될 수도 있다. 네트워크 슬라이스는 특정한 목적에 기반하여 생성될 수 있다. 예를 들어, 네트워크 슬라 이스는 특정 가입자 그룹들에게 동일한 형태의 서비스(예, 최대 전송률과 데이터 사용량, 보장된 최소 전송률 등)를 제공하기 위한 가입자 그룹을 위해 설정될 수 있다. 그 외에도 네트워크 슬라이스는 다양한 목적에 따라 구현될 수 있다. 도 1을 참고하면, 도 1은 5GS의 각 노드들 간의 인터페이스를 예시하고 있다. 예를 들어, UE와 NG- RAN 간에는 Uu 인터페이스가 사용될 수 있다. NG-RAN과 AMF 간에는 N2 인터페이스가 사용될 수 있다. NG-RAN과 UPF 간은 N3 인터페이스가 사용될 수 있다. NG-RAN과 MB-UPF 간에는 N3mb 인터페이스가 사용될 수 있다. 또한 MB-UPF와 MB-SMF 간은 N4mb 인터페이스가 사용될 수 있다. MB- UPF와 UPF 간은 N19mb 인터페이스가 사용될 수 있다. SMF과 UPF 간은 N4 인터페이스가 사 용될 수 있다. UPF와 AF 간은 N6 인터페이스가 사용될 수 있다. MBSF와 MBSTF 간은 Nmb2 인터페이스가 사용될 수 있다. 또한, MB-UPF과 MBSTF 간은 Nmb9 인터페이스가 사용될 수 있다. AF와 MBSTF 간은 Mmb8/xMB-U/MB2 인터페이스가 사용될 수 있다. 상기 인터페이스들은 NR 표준 규격 에 구체적으로 정의되어 있는 바, 자세한 설명은 생략한다. 일반적으로 5GS에서 브로드캐스트 서비스를 지원하기 위해, 다음과 같은 네트워크 기능(Network function, NF) 장치들 및 서비스들에 기반하여 브로드캐스트 서비스를 위한 셀룰러(cellular) 시스템이 구성될 수 있다. 본 개시의 실시예에 따르면, AF는 다양한 서비스를 제공할 수 있다. 예를 들어, AF는 V2X 어플리케이 션 서버(application server), 셀룰러 사물 인터넷(Cellular Internet of Things, CIoT) 어플리케이션 서버 (application server), 미션-크리티컬 푸시-투-토크(mission-critical push-to-talk, MCPTT) 어플리케이션 (application), 컨텐츠 제공자(Contents provider), TV 또는 오디오 서비스 제공자(audio service provider), 스트리밍 비디오 서비스 제공자(streaming video service provider) 등이 될 수 있다. 또한, AF는 MBS 서비스를 제공하기 위해 MBS 서비스의 세션 관리 및 트래픽을 제어하는 NF인 MBSF로 MBS 서비스 제공을 요청할 수 있다. MBSF는 AF로부터 MBS 서비스를 요청받아, MBS 서비스 세션을 관 리하고 MBS 서비스 트래픽을 제어하는 NF일 수 있다. 또한 MBSTF는 MBSF의 제어에 기반하여 MBS를 제 공하는 AF로부터, MBS를 제공하는 어플리케이션 서버(application server, AS)로부터, 또는 컨텐츠 제공자 (contents provider)로부터 미디어를 받아 미디어 트래픽을 처리하는 NF일 수 있다. 즉, MBSTF는 5GS 내 MBS 서비스 앵커로서 동작할 수 있다. 5GC(5G core network)에서는 MBSF 및 MBSTF를 포함하지 않고도 MBS 시스템이 구성되어 운영될 수 있 다. MBSF 및 MBSTF를 포함하지 않는 경우, AF는 MB-SMF에게 직접 또는 NEF를 통해서 MB-SMF에게 MBS 서비스 제공을 요청할 수 있다. 이때 MBS 데이터는 MBS를 제공하는 어플리케이션 서버(A S)로부터 또는 컨텐츠 제공자(contents provider)로부터 MB-UPF를 통해 5G 네트워크로 제공될 수 있다. 본 개시에서 AF는 특정한 브로드캐스트 어플리케이션 서비스를 제공하기 위한 어플리케이션 서버 (application server, AS)가 될 수 있다. 따라서 이하의 AS는 AF와 동일하거나 또는 AF와 AS가 함께 존재하는 것으로 이해될 수 있다. AF가 UE에게 MBS 서비스를 제공하기 위하여, MBS 서비스 제공을 위 한 요청을 MBSF에게 전송할 수 있다. MBSF는 MBS 서비스 트래픽을 UE에게 전송하는 5GS 내 MBS 서비스 미디어 앵커(media anchor)인 MBSTF를 제어할 수 있다. 이에 따라, MBSF는 MBS 서비 스를 UE에게 제공할 수 있다. 이때, MBS 서비스는 특정한 컨텐츠 제공자(contents provider)로부터 수신된 멀티캐스트/브로드캐스트 서비스에 따른 데이터를 의미할 수 있다. 일 실시 예에 따라, MBSF와 MBSTF는 하나의 엔티티(entity) 또는 하나의 NF로 통합되어 구성될 수 있 다. 또한, MBSF는 NEF 또는 다른 NF에 통합되어 구성될 수 있다. 또한, 5GS는 MBSF와 MBSTF 없이 AF가 MBS 서비스 요청을 MB-SMF로 직접 요청하고, MB-UPF가 AS 또는 AF 인 컨텐츠 제공자(contents provider)로부터 미디어를 받아서 트래픽을 포워딩 할 수도 있다. 일 실시예에 따르면, MBSF와 MBSTF를 통해서 MBS 서비스가 관리되고 서비스 트래픽이 발생할 수 있다. 여기서, 서비스 트래픽이 브로드캐스트(broadcast)를 통해서 UE에게 전달되는 경우, MBSF는 MBS서비스를 관리하고, MB-SMF는 MBS 세션(session)을 할당하고, MBSTF는 해당 MBS트래픽의 미디어 앵커로서 동작할 수 있다. 즉, MBSF는 MBS서비스를 관리하는 제어 평면(control plane)이고, MBSTF 는 MBS 트래픽을 다루는 사용자 평면(user plane)에 해당할 수 있다. 이하의 본 개시에서, \"멀티캐스트-브로드캐스트 서비스 게이트웨이-제어 평면(multimedia broadcast-multicast service gateway-control plane, MBMS-GW-C) 서비스\"라 함은, MBS PDU 세션(Session)에 대한 MBS 컨텍스트 (context)를 생성하고, MBS 세션(session)을 관리하고 MBS 세션(session)의 트래픽을 IP 멀티캐스트 (multicast)를 통해 기지국인 NG-RAN에 전달하기 위한 제어 기능 또는 서비스를 통칭할 수 있다. MBMS-GW-C 서비스는 단일 PDU 세션(unicast PDU Session)을 관리하는 기존 SMF에 통합되어 MBS 세션 제어 기능이 있는 SMF로 구성되어 되거나, 또는 별도의 NF로 구성될 수도 있다. 이하, 본 개시에서는 MBMS-GW-C 서비스를 지원하고, 기존 SMF의 기능도 함께 가지는 NF를 MB-SMF로 지칭한다. 또한, 본 개시에서는, MBS PDU 세션에 대한 MBS 컨텍스트에 따라 MB-UPF로부터 받은 트래픽을, MBMS-GW-C 서비스에 따라 멀티캐스트/브로드캐스트(multicast/broadcast)를 수행하는 NG-RAN에게 IP 멀티캐스트 (multicast)를 통해서 전달하는 서비스를 MBMS-GW-U(multimedia broadcast-multicast service gateway - user plane) 서비스라 지칭한다. MBMS-GW-U 서비스는 단일 PDU 세션에 대한 처리를 하는 기존 UPF에 통합되어 MBS 트래픽을 IP 멀티캐스트 (multicast)로 알맞은 NG-RAN으로 전달하는 기능이 있는 UPF로 구성하거나, 또는 도 1에 예시한 바와 같이 별도의 NF로 구성될 수도 있다. 따라서 이하의 본 개시에서는, MBMS-GW-U 서비스를 지원하고, 기존 UPF의 기능 도 함께 가지는 NF를 MB-UPF로 지칭한다. MBMS-GW-C 서비스가 MBMS-GW-U 서비스에 대한 제어를 위해서는 상술한 바와 같이 N4mb인터페이스를 사용할 수 있다. 본 개시에서 실시예들을 기술함에 있어 MBMS-GW-C와 MBMS-GW-U에 대해서 설명의 편의를 위하여, 각각 MB- SMF와 MB-UPF로 지칭할 수 있다. MBS 트래픽은 MBMS-GW-U(또는 MB-UPF)로부터 NG-RAN들에게 전달될 수 있다. 예를 들어, MBS 트래픽 은 IP 멀티캐스트(multicast)를 이용하여 NG-RAN에게 전달되거나 유니캐스트 터널을 이용하여 NG- RAN에게 전달될 수 있다. 이때, MBMS-GW-U(또는 MB-UPF)와 NG-RAN 사이의 터널을 공유된 전달 터널(shared delivery tunnel) 이라 부른다. 이하에서는 설명의 편의를 위하여, MBMS-GW-U와 NG-RAN 사이 의 터널을 공유된 전달 터널(shared delivery tunnel) 또는 공유된 터널(shared tunnel)로 지칭할 수 있다. 공유된 전달 터널을 설정하기 위하여 MBMS-GW-C(또는MB-SMF)는 AMF를 통해서 NG-RAN에게 제어 메시지를 보낼 수 있다. 도 2는 본 개시의 실시예에 따른 무선 통신 시스템에서 기지국의 구성에 대한 예를 도시한다. 도 2에 예시된 기 지국의 구성은 도 1의 NG-RAN의 구성으로서 이해될 수 있다. 이하 사용되는 '…부', '…기' 등의 용 어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 2를 참고하면, 기지국은 무선통신부, 백홀통신부, 저장부, 제어부를 포함할 수 있 다. 무선통신부는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행한다. 예를 들어, 무선통신부 는 시스템의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행한다. 예를 들어, 데이터 송 신 시, 무선통신부는 송신 비트열을 부호화 및 변조함으로써 복소 심벌들을 생성한다. 또한, 데이터 수신 시, 무선통신부는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 또한, 무선통신부는 기저대역 신호를 RF(radio frequency) 대역 신호로 상향변환한 후 안테나를 통해 송신 하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역 신호로 하향변환한다. 이를 위해, 무선통신부는 송신 필터, 수신 필터, 증폭기, 믹서(mixer), 오실레이터(oscillator), DAC(digital to analog convertor), ADC(analog to digital convertor) 등을 포함할 수 있다. 또한, 무선통신부는 다수의 송수신 경로(path) 들을 포함할 수 있다. 나아가, 무선통신부는 다수의 안테나 요소들(antenna elements)로 구성된 적어도 하 나의 안테나 어레이(antenna array)를 포함할 수 있다. 하드웨어의 측면에서, 무선통신부는 디지털 유닛(digital unit) 및 아날로그 유닛(analog unit)으로 구성 될 수 있으며, 아날로그 유닛은 동작 전력, 동작 주파수 등에 따라 다수의 서브 유닛(sub-unit)들로 구성될 수 있다. 디지털 유닛은 적어도 하나의 프로세서(예: DSP(digital signal processor))로 구현될 수 있다. 무선통신부는 상술한 바와 같이 신호를 송신 및 수신한다. 이에 따라, 무선통신부의 전부 또는 일부 는 '송신부(transmitter)', '수신부(receiver)' 또는 '송수신부(transceiver)'로 지칭될 수 있다. 또한, 이하 설명에서, 무선 채널을 통해 수행되는 송신 및 수신은 무선통신부에 의해 상술한 바와 같은 처리가 수행되 는 것을 포함하는 의미로 사용된다. 백홀통신부는 네트워크 내 다른 노드들과 통신을 수행하기 위한 인터페이스를 제공한다. 즉, 백홀통신부 는 기지국에서 다른 노드, 예를 들어, 다른 접속 노드, 다른 기지국, 상위 노드, 코어 망 등으로 송신되는 비트열을 물리적 신호로 변환하고, 다른 노드로부터 수신되는 물리적 신호를 비트열로 변환한다. 저장부는 기지국의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 저장 부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공한다. 제어부는 기지국의 전반적인 동작들을 제어한다. 예를 들어, 제어부는 무선통신부를 통해 또는 백홀통신부를 통해 신호를 송신 및 수신한다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽 는다. 그리고, 제어부는 통신 규격에서 요구하는 프로토콜 스택(protocol stack)의 기능들을 수행할 수 있 다. 다른 구현 예에 따라, 프로토콜 스텍은 무선통신부에 포함될 수 있다. 이를 위해, 제어부는 적어 도 하나의 프로세서(processor)를 포함할 수 있다. 다양한 실시 예들에 따라, 제어부는 무선 통신망을 이 용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 기지국이 후술하는 다양한 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 도 3은 본 개시의 실시예에 따른 무선 통신 시스템에서 단말의 구성에 대한 예를 도시한다. 도 3에 예시된 단말 의 구성은 도 1의 UE의 구성으로서 이해될 수 있다. 이하 사용되는 '…부', '…기' 등의 용어는 적어 도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프트 웨어의 결합으로 구현될 수 있다. 도 3을 참고하면, 단말은 통신부, 저장부, 제어부를 포함할 수 있다. 통신부는 무선 채널을 통해 신호를 송수신하기 위한 기능들을 수행한다. 예를 들어, 통신부는 시스템 의 물리 계층 규격에 따라 기저대역 신호 및 비트열 간 변환 기능을 수행한다. 예를 들어, 데이터 송신 시, 통 신부는 송신 비트열을 부호화 및 변조함으로써 복소 심벌들을 생성한다. 또한, 데이터 수신 시, 통신부 는 기저대역 신호를 복조 및 복호화를 통해 수신 비트열을 복원한다. 또한, 통신부는 기저대역 신호 를 RF 대역 신호로 상향변환한 후 안테나를 통해 송신하고, 안테나를 통해 수신되는 RF 대역 신호를 기저대역신호로 하향변환한다. 예를 들어, 통신부는 송신 필터, 수신 필터, 증폭기, 믹서, 오실레이터, DAC, ADC 등을 포함할 수 있다. 또한, 통신부는 다수의 송수신 경로(path)들을 포함할 수 있다. 나아가, 통신부는 다수의 안테나 요 소들로 구성된 적어도 하나의 안테나 어레이를 포함할 수 있다. 하드웨어의 측면에서, 통신부는 디지털 회 로 및 아날로그 회로(예: RFIC(radio frequency integrated circuit))로 구성될 수 있다. 여기서, 디지털 회로 및 아날로그 회로는 하나의 패키지로 구현될 수 있다. 또한, 통신부는 다수의 RF 체인들을 포함할 수 있다. 나아가, 통신부는 빔포밍을 수행할 수 있다. 통신부는 상술한 바와 같이 신호를 송신 및 수신한다. 이에 따라, 통신부의 전부 또는 일부는 '송신 부', '수신부' 또는 '송수신부'로 지칭될 수 있다. 또한, 이하 설명에서 무선 채널을 통해 수행되는 송신 및 수 신은 통신부에 의해 상술한 바와 같은 처리가 수행되는 것을 포함하는 의미로 사용된다. 저장부는 단말의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 저장부 는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공한다. 제어부는 단말의 전반적인 동작들을 제어한다. 예를 들어, 제어부는 통신부를 통해 신호를 송신 및 수신한다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽는다. 그리고, 제어부는 통신 규 격에서 요구하는 프로토톨 스택의 기능들을 수행할 수 있다. 이를 위해, 제어부는 적어도 하나의 프로세서 또는 마이크로(micro) 프로세서를 포함하거나, 또는, 프로세서의 일부일 수 있다. 또한, 통신부의 일부 및 제어부는 CP(communication processor)라 지칭될 수 있다. 다양한 실시 예들에 따라, 제어부는 무선 통신망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 단말이 후술하는 다양한 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 도 4는 본 개시의 실시예에 따른 무선 통신 시스템에서 네트워크 객체의 구성에 대한 예를 도시한다. 도 4에 예 시된 네트워크 객체는 도 1의 AMF, MB-UPF, MB-SMF, PCF, SMF, NEF, MBSF, MBSTF, AF , UDM, UPF, AUSF, NRF 중 적어도 하나의 기능을 가지는 장치의 구성으로서 이해될 수 있다. 이하 사용되는 '…부', '…기' 등의 용어는 적어도 하나의 기능이나 동작을 처리하는 단위를 의미하며, 이는 하드웨어나 소프트웨어, 또는, 하드웨어 및 소프트웨어의 결합으로 구현될 수 있다. 도 4를 참고하면, 네트워크 객체는 통신부, 저장부, 제어부를 포함할 수 있다. 통신부는 네트워크 내 다른 장치들과 통신을 수행하기 위한 인터페이스를 제공한다. 즉, 통신부는 네 트워크 객체에서 다른 장치로 송신되는 비트열을 물리적 신호로 변환하고, 다른 장치로부터 수신되는 물리적 신 호를 비트열로 변환한다. 즉, 통신부는 신호를 송신 및 수신할 수 있다. 이에 따라, 통신부는 모뎀 (modem), 송신부(transmitter), 수신부(receiver) 또는 송수신부(transceiver)로 지칭될 수 있다. 이때, 통신 부는 네트워크 객체가 백홀 연결(예: 유선 백홀 또는 무선 백홀)을 거쳐 또는 네트워크를 거쳐 다른 장치 들 또는 시스템과 통신할 수 있도록 한다. 저장부는 네트워크 객체의 동작을 위한 기본 프로그램, 응용 프로그램, 설정 정보 등의 데이터를 저장한다. 저장부는 휘발성 메모리, 비휘발성 메모리 또는 휘발성 메모리와 비휘발성 메모리의 조합으로 구성될 수 있다. 그리고, 저장부는 제어부의 요청에 따라 저장된 데이터를 제공한다. 제어부는 코어 망 객체의 전반적인 동작들을 제어한다. 예를 들어, 제어부는 통신부를 통해 신 호를 송수신한다. 또한, 제어부는 저장부에 데이터를 기록하고, 읽는다. 이를 위해, 제어부는 적어도 하나의 프로세서(processor)를 포함할 수 있다. 다양한 실시 예들에 따라, 제어부는 무선 통신망을 이용한 동기화를 수행하도록 제어할 수 있다. 예를 들어, 제어부는 네트워크 객체가 후술하는 다양한 실시 예들에 따른 동작들을 수행하도록 제어할 수 있다. 도 5는 본 개시의 실시예에 따른 무선 통신 시스템에서 RAN을 공유(sharing)하는 경우, 서비스하는 사업자가 바 뀌는 상황에 대한 예를 도시한다. 구체적으로, 도 5의 상황에서는, 무선 통신 시스템에서 RAN sharing하는 NG-RAN을 통해서 동일한 브로드캐스트 서비스를 제공하는 중, NG-RAN 또는 5GC에서 서비스하는 사업자가 바뀌는상황에 대한 예를 도시한다. 도 5를 참조하면, 브로드캐스트 서비스가 사업자 A(operator A)를 통한 MBS 시스템을 통해서 실행되고, 동일한 브로드캐스트 서비스에 대해서 사업자 B(operator B)를 통한 MBS 시스템을 통해서 실행이 될 수 있다. 이 때, 사업자 A와 사업자 B가 특정한 NG-RAN을 공유할 수 있다. 서로 RAN sharing하는 NG-RAN의 경우, 실제로 브로드캐스트되는 데이터가 사업자 A와 사업자 B를 통해서 중첩되어 방송될 수 있다. 이 때, RAN sharing된 NG- RAN은 사업자 A의 TMGI를 primary TMGI로 설정하여 브로드캐스트 서비스를 제공할 수 있다. 사업자 B의 망 을 통해서 MB-UPF로부터 NG-RAN으로 전달되는 브로드캐스트 데이터는 사업자 A의 망을 통해서 전달되는 것과 같 은 정보이므로 사업자 B의 망의 MB-UPF로부터 NG-RAN으로의 공유된 터널(shared tunnel)은 삭제될 수 있다. Case#1과 관련하여, NG-RAN에서 사업자 A의 망을 더 이상 지원하지 않을 수 있다. 이에 따라, primary TMGI를 업데이트 해야하는 경우에 지속적으로 브로드캐스트 서비스를 제공할 필요가 있다. 또는, Case#2와 관련 하여, 사업자 A의 망에서 브로드캐스트 서비스를 더 이상 지원하지 않을 수 있다. 이에 따라, primary TMGI를 업데이트 해야하는 경우에 지속적으로 브로드캐스트 서비스를 제공할 필요가 있다. 본 개시는 상술한 바와 같이, primary TMGI를 업데이트하는 경우에도 지속적으로 브로드캐스트 서비스를 제공하기 위한 방안을 제공한 다. 도 6은 본 개시의 실시예에 따른 무선 통신 시스템에서 공유 기지국을 통해서 브로드캐스트 서비스를 위한 브로 드캐스트 세션을 생성하기 위한 과정에 대한 예를 도시한다. 도 6에서 개시하는 UE, NG-RAN, AMF, MB-SMF, MB- UPF, NEF/MBSF, AF(content provider)는 도 1의 5GS가 포함하는 네트워크 엔티티들과 동일하게 이해될 수 있다. 또한, 도 6의 MB-PCF는 도 1의 PCF와 실질적으로 동일하게 이해될 수 있다. 예를 들어, 도 6의 MB- PCF는 도 1의 PCF에 있어서 MBS와 관련된 서비스를 제공할 수 있는 PCF를 지칭할 수 있다. 일 실시예에 따르면, 단계에서 AF는 브로드캐스트 서비스를 위한 브로드캐스트 세션(MBS session)을 생성 하기 위해서 NEF를 통해서 MB-SMF에게 TMGI(temporary mobile group identity)를 할당받을 수 있다. 단계에서, AF는 TMGI에 대해서 MB-SMF에게 MBS Session을 요청하기 전에 동일한 브로드캐스트 서비스가 다 른 사업자의 망에서도 서비스하는 것을 식별할 수 있다. 또한, AF는 각 사업자에서 이용하는 TMGI 값들을 알 수 있다. 즉, AF는 브로드캐스트 서비스를 제공하기 위한 적어도 하나의 TMGI에 대한 list를 식별할 수 있다. 여기 서, TMGI는 브로드캐스트 서비스를 제공하는 사용자의 정보를 포함할 수 있다. 예를 들어, TMGI는 PLMN(public land mobile network) ID를 포함할 수 있다. TMGI는 어떤 사업자를 통해서 제공되는 브로드캐스트 서비스인지 알 수 있는 정보일 수 있다. 일 실시예에 따르면, AF는 사업자의 망 별 브로드캐스트 서비스를 지시하는 TMGI 값과 별도로 사업자의 망과 상관없이 브로드캐스트 서비스를 지시하기 위한 브로드캐스트 서비스 ID 값을 정의 할 수도 있다. 다시 말해서, AF는 TMGI 값에 기반하여 사업자 별로 브로드캐스트 서비스를 제공함을 식별할 수 있다. 또한, AF는 브로드캐스트 서비스 ID에 기반하여 서비스 별로 브로드캐스트 서비스를 제공함을 식별할 수 있다. 단계에서, AF는 NEF에게 TMGI에 대하여 MBS session 생성을 요청하기 위한 메시지를 전송할 수 있다. 예를 들어, MBS session 생성을 요청하기 위한 메시지는 Nnef_MBSSsession_Create request 메시지일 수 있다. 단계 에서, MBS session 생성을 요청하기 위한 메시지를 수신한, NEF는 MB-SMF에게 MBS session 생성 요청 메 시지를 전송할 수 있다. 예를 들어, NEF가 MB-SMF에게 전송하는 메시지는 Nmbsmf_MBSSession_Create request 메시지일 수 있다. 다시 말해서, 단계 및 단계에서, AF는 특정 사업자 망에서 NEF를 통해서 MB-SMF에 게 TMGI에 대해서 MBS Session 생성을 요청할 수 있다. 즉, AF는 MBS 세션 생성 요청 메시지 (예, Nnef_MBSSession_Create request 및 Nmbsmf_MBSSession_Create request) 메시지를 통해서 TMGI에 대한 MBS Session을 요청할 수 있다. MBS 세션 생성 요청 메시지는 TMGI, 브로드캐스트 서비스 ID 또는 다른 망에서 동일 한 브로드캐스트 서비스를 제공하는 적어도 하나의 TMGI의 list 중 적어도 하나를 포함할 수 있다. TMGI list는 사업자 망의 TMGI를 포함할 수도 있고 포함하지 않을 수도 있다. 여기서, 브로드캐스트 서비스 ID 와 TMGI list 는 사업자들 사이에 RAN sharing하는 NG-RAN이 운영될 때 MBS 세션 생성 요청 메시지에 포함될 수 있다. 즉, 브 로드캐스트 서비스 ID 와 TMGI list는 RAN sharing NG-RAN(또는 MOCN NG-RAN)에서 동일한 브로드캐스트 서비스 데이터가 전송되는 상황을 식별하기 위한 정보로서 사용될 수 있다. 단계에서 MB-SMF는 N4mb 세션을 생성할 수 있다. 단계(625a)에서 MB-SMF는 NEF에게 단계에 대한 응 답을 전송할 수 있다. 단계(630a)에서 NEF는 단계에 대한 응답을 AF에게 전송할 수 있다. 또는, AF에 대한응답은 단계 (625b) 및 단계(630b)와 같이 MBS 망에서의 브로드캐스트 세션(MBS session)의 생성된 후, AF에게 전송될 수도 있다. 단계에서, 브로드캐스트 서비스를 위한 MBS Session 생성 요청을 수신한 MB-SMF는 브로드캐스트 세션 컨텍 스트 생성 요청 메시지(Namf_Broadcast_ContextCreate_request)를 AMF에게 송신할 수 있다. 이 때, 브로드캐스 트 세션 컨텍스트 생성 요청 메시지는 MBS Service area에 해당하는 NG-RAN을 선택하기 위해서 TMGI를 포함할 수 있다. 또한 브로드캐스트 세션 컨텍스트 생성 요청 메시지는 MB-UPF에서 NG-RAN들에게 멀티캐스트를 통해 데 이터를 전송하는 경우, LL SSM(Lower Layer Source Specific IP Multicast address)를 포함할 수 있다. 브로드 캐스트 세션 컨텍스트 생성 요청 메시지 MBS service area를 포함할 수 있다. 브로드캐스트 세션 컨텍스트 생성 요청 메시지는 수신된 브로드캐스트 서비스 ID 또는 동일한 브로드캐스트 서비스를 제공하는 적어도 하나의 TMGI의 list를 포함할 수 있다. 단계에서 AMF는 MB-SMF로부터 수신된 메시지를 이용하여 NG-RAN에 N2 Message request를 송신할 수 있다. N2 Message request는 TMGI를 포함할 수 있다. 또한, N2 Message request는 MB-UPF에서 NG-RAN들에게 멀 티캐스트로 데이터를 전송하는 경우, LL SSM(Lower Layer Source Specific IP Multicast address)를 포함할 수 있다. N2 Message request는 MBS service area를 포함할 수 있고, 브로드캐스트 서비스로 세팅된 서비스 타입 을 포함할 수 있다. N2 Message request는 수신된 브로드캐스트 서비스 ID 또는 동일한 브로드캐스트 서비스를 제공하는 적어도 하나의 TMGI의 list를 포함할 수 있다. 일 실시예에 따르면, 단계의 N2 Message request 는 NG-RAN이 RAN sharing NG-RAN(또는 MOCN NG-RAN)인 경우에만 수신된 브로드캐스트 서비스 ID 또는 동일한 브로드캐스트 서비스를 제공하는 적어도 하나의 TMGI의 list를 포함할 수 있다. 다만, 본 개시가 이에 제한되는 것은 아니며, N2 Message request는 NG-RAN이 RAN sharing NG-RAN이 아닌 경우에도, 브로드캐스트 서비스 ID 또는 동일한 브로드캐스트 서비스를 제공하는 적어도 하나의 TMGI의 list를 포함할 수 있다. 단계에서, NG-RAN은 브로드캐스트 서비스를 위한 MBS Session context를 생성할 수 있다. NG-RAN이 RAN sharing NG-RAN(또는 MOCN NG-RAN)인 경우, NG-RAN이 브로드캐스트 데이터를 전송하는데 사용하기 위한 primary TMGI가 선택될 수 있고, 선택된 primary TMGI는 MBS session context에 포함될 수 있다. RAN sharing NG-RAN(또는 MOCN NG-RAN)은 NG-RAN을 소유하고 있는 사업자가 제공하는 브로드캐스트 서비스를 위한 TMGI를 primary TMGI로 선택할 수 있다. 또는, RAN sharing NG-RAN(또는 MOCN NG-RAN)은 NG-RAN을 서로 공유하는 사업 자들 중에서 MBS service area 내에 더 많은 수의 UE가 서비스를 받는 것으로 판단되는 사업자가 제공하는 브로 드캐스트 서비스를 위한 TMGI를 primary TMGI로 선택할 수 있다. 또는 RAN sharing NG-RAN(또는 MOCN NG- RAN)은 NG-RAN을 서로 공유하여 동일한 브로드 캐스트 서비스를 제공하는 사업자들 중에서 중요도가 가장 높거 나 설비 기여도가 가장 높은 사업자가 제공하는 브로드캐스트 서비스를 위한 TMGI를 primary TMGI로 선택할 수 있다. 단계 및 단계를 통해서 MB-SMF로부터 LL SSM정보를 수신한 경우, NG-RAN은 MB-UPF로부터 브로드캐스 트 서비스 데이터를 멀티캐스트로 받기 위해서 조인(join)을 요청할 수도 있다. 다만, RAN sharing NG-RAN(또는 MOCN NG-RAN)은 사업자 망의 TMGI가 primary TMGI와 다른 경우에는 NG-RAN은 조인을 요청하지 않을 수도 있다. 단계 및 단계에서, NG-RAN은 AMF를 통해서 MB-SMF에게 단계 및 단계에 대한 응답(예: N2 Message response 및 Namf_MBSBroadcast_ContextCreate Response)을 전송할 수 있다. 단계 및 단계 를 통해, TMGI 정보와 NG-RAN으로 데이터를 수신하기 위한 N3mb DL tunnel에 대한 정보를 송신할 수 있다. 이에 따라, NG-RAN과 MB-UPF간에 브로드캐스트 서비스 데이터를 전달하기 위한 터널이 생성될 수 있다. 단계 및 단계에서 전송되는 메시지에는, NG-RAN이 RAN sharing NG-RAN(또는 MOCN NG-RAN)인 경우, 브로드캐스트 서비스 ID 또는 primary TMGI 정보 또는 NG-RAN의 위치 정보 중 적어도 하나를 포함할 수 있다. 또는, 단계 및 단계에서 전송되는 메시지는 NG-RAN이 RAN sharing NG-RAN(또는 MOCN NG-RAN)인 경우, 브로드캐 스트 서비스 ID, primary TMGI 정보, 및 NG-RAN의 위치 정보를 포함할 수 있다. 예를 들어, NG-RAN의 위치 정 보는 NG-RAN의 ID, Cell ID, 지리적인 위치 정보, 또는 지리적 주소 정보를 포함할 수 있다. 단계 및 단계에서, MB-SMF는 MB-PCF 또는 PCF와 MBS SM policy update 과정을 수행할 수 있다. RAN sharing NG-RAN(또는 MOCN NG-RAN)인 경우, MB-SMF는 primary TMGI로 서비스하는 것을 허용하는지 여부를 식별 하기 위해 MBS SM policy update 과정을 수행할 수 있다. MBS SM policy update 메시지는 TMGI 외에 브로드캐 스트 서비스 ID 또는 primary TMGI 정보 또는 NG-RAN의 위치 정보 중 일부 또는 전부를 포함할 수 있다. MB-SMF가 RAN sharing NG-RAN에서 primary TMGI로 서비스가 가능한 것으로 응답을 수신한 경우, 단계에서 MB-SMF는 NG-RAN과 MB-UPF 사이에 브로드캐스트 서비스 데이터를 전달하기 위한 터널을 생성할 수 있다. 단계(625b) 및 단계(630b)에서, MB-SMF는 단계 및 단계에 대한 응답을 AF에게 전달할 수 있다. 단계 (625b) 및 단계 (630b)의 메시지는 브로드캐스트 서비스 ID 또는 primary TMGI 정보 또는 NG-RAN의 위치 정보 중 일부 혹은 전부를 포함할 수 있다. 예를 들어, NG-RAN의 위치 정보는 NG-RAN의 ID 또는 Cell ID 또는 지리적 인 위치 정보 또는 지리적 주소 정보를 포함할 수 있다. 단계에서, primary TMGI와 TMGI가 다른 경우, MB-SMF는 NG-RAN과 MB-UPF 사이의 터널을 통해서 데이터를 전송하지 않도록 NG-RAN으로의 다운링크 터널 정보를 전송하지 않을 수 있다. 또는 MB-SMF는 MB-UPF에게 TMGI에 해당하는 브로드캐스트 데이터를 전송하지 않도록 알리는 지시자를 전달할 수도 있다. 또는, primary TMGI와 TMGI가 다른 경우, 단계는 수행되지 않을 수도 있다. 단계에서 RAN sharing NG-RAN(또는 MOCN NG-RAN)은 TMGI 대신 단계에서 결정된 primary TMGI를 통해 서 브로드캐스트 서비스 데이터를 전송하도록 방송할 수 있다. 단계에서, RAN sharing NG-RAN(또는 MOCN NG-RAN)을 통해 브로드캐스트 서비스를 제공하기 위해, AF는 TMGI 대신 primary TMGI가 사용됨을 알리기 위해서 단말들에게 업데이트된 정보를 MBS service announcement를 통해 알릴 수 있다. MBS service announcement는 TMGI 정보 외에 브로드캐스트 서비스 ID 또는 primary TMGI 정보 또는 NG-RAN의 위치 정보 또는 MBS frequency selection area ID 또는 Session Description protocol의 일부 혹은 전부를 포함할 수 있다. 예를 들어, NG-RAN의 위치 정보는 NG-RAN의 ID 또는 Cell ID 또는 지리적인 위치 정보 또는 지리적 주소 정보 중 적어도 하나를 포함할 수 있다. 단계에서, RAN sharing NG-RAN(또는 MOCN NG-RAN)는, 단계를 통해 TMGI로 브로드캐스트 서비스 데이 터를 수신하더라도, primary TMGI로 받은 브로드케스트 서비스 데이터에 대해서만 트래픽을 전송할 수 있다. 단계에서, 단계를 통해 primary TMGI 사용에 대한 정보를 수신한 단말은 RAN sharing NG-RAN(또는 MOCN NG-RAN)에 위치할 때, primary TMGI를 통해 브로드캐스트 서비스 데이터를 수신할 수 있다. 도 7은 본 개시의 실시예에 따른 무선 통신 시스템에서 RAN을 공유(sharing)하는 경우, primary TMGI(temporary mobile group identity)를 업데이트 하는 방법에 대한 예를 도시한다. 구체적으로, 도 7은 무 선 통신 시스템에서 RAN sharing NG-RAN에서 primary TMGI가 유효하지 않은 경우, NG-RAN이 primary TMGI를 업 데이트 하는 방법의 예를 도시한다. 도 7에서 개시하는 UE, NG-RAN, AMF, MB-SMF, MB-UPF, NEF/MBSF, AF(content provider)는 도 1의 5GS가 포함하는 네트워크 엔티티들과 동일하게 이해될 수 있다. 또한, 도 7의 MB-PCF는 도 1의 PCF와 실질적으로 동일하게 이해될 수 있다. 예를 들어, 도 7의 MB-PCF는 도 1의 PCF에 있어서 MBS와 관련된 서비스를 제공 할 수 있는 PCF를 지칭할 수 있다. 단계에서 AF(또는 contents provider)는 브로드캐스트 서비스 데이터를 RAN sharing하는 NG-RAN에 전송할 수 있다. 단계에서, NG-RAN은 primary TMGI를 통해서 단말들에게 브로드캐스트 서비스 데이터를 브로드캐 스팅할 수 있다. 단계에서, NG-RAN에서 primary TMGI를 통해서 더 이상 브로드캐스트 서비스 데이터를 제공하지 못하게 되 는 경우, NG-RAN은 primary TMGI 외에 동일한 브로드캐스트 서비스를 제공하는 사업자의 TMGI를 새로운 primary TMGI로 선택하고, 업데이트가 필요함을 식별할 수 있다. 예를 들어, primary TMGI를 통해서 더 이상 브로드캐스 트 서비스를 제공하지 못하는 경우는 NG-RAN의 RAN sharing을 위한 계약이 primary TMGI로 사용하는 TMGI를 통 해 서비스하는 사업자에 대해서 종료되거나, 또는 primary TMGI로 사용하는 TMGI를 통해 서비스하는 사업자의 정책에 따라서 브로드캐스트 서비스를 정상적으로 수행하기 힘들다고 판단되는 경우, 또는 NG-RAN의 고장으로 인해 primary TMGI로 사용하는 TMGI를 통해 서비스하는 사업자에 할당된 리소스를 사용하지 못하게 되는 경우일 수 있다. 이 때, NG-RAN은 새로운 primary TMGI를 선택하고 업데이트할 필요가 있다. 새로운 primary TMGI를 선택한 NG-RAN은 기존 primary TMGI를 통해서 서비스하던 브로드캐스트 세션을 해지할 수 있다. 단계에서, NG-RAN은 기존 primary TMGI에 대해서 AMF에게 Broadcast Session release require 메시지를 전송할 수 있다. AMF는 NG-RAN과 Broadcast Session release를 수행하고 MB-SMF에 Broadcast Session 이 release됨을 알릴 수 있다. MB-SMF는 MB-UPF와 NG-RAN 사이의 다운링크 터널을 삭제하기 위하여 N4mb Session update를 수행할 수 있다. 즉, Broadcast Session release require 과정은 3GPP TS 23.247의 Figure 7.3.6-1을 따라서 기존 primary TMGI에 대한 Broadcast Session를 해지(release)할 수 있다. RAN sharing 기지국은 동일한 브로드캐스트 서비스를 제공하는 기존 primary TMGI를 제외한 다른 TMGI를 서비스 하는 사업자에 대해서는 새로운 primary TMGI로 업데이트를 할 수 있다. 단계에서, 기존 primary TMGI를 제외한 다른 TMGI에 대해서 RAN sharing NG-RAN은 AMF에게 MBS Broadcast Context update request 메시지를 전송할 수 있다. NG-RAN은 5GC에 primary TMGI가 변경됐음을 알려서 Broadcast session context를 업데이트하도록 요청 메시지(예: MBSBroadcastConextupdate request)를 전송할 수 있다. 요청 메시지는 새로운 primary TMGI를 포함하고 어떤 기지국에 대한 것인지를 지시하기 위해서 RAN의 위치 정보 또는 NG-RAN ID를 포함할 수 있다. 요청 메시지는 동일한 브로드캐스트 서비스임을 확인하기 위해서 Broadcast service ID를 포함할 수 있다. 또한 요청 메시지는 브로드캐스트 다운링크 데이터를 전송하기위한 터 널의 정보(예: N3mb DL tunnel 정보)를 포함할 수도 있다. 단계에서, AMF는 MB-SMF에 Nmbsmf_MBSSession_ContextUpdate request 메시지를 전송할 수 있다. 이 때, 단계에서 AMF는 NG-RAN으로부터 수신한 메시지를 포워딩하거나 Namf_MBSBroadcast_ContextStatus Notify 메시지를 MB-SMF에게 전송할 수 있다. Namf_MBSBroadcast_ContextStatus Notify 메시지는 새로운 primary TMGI, RAN의 위치 정보 또는 NG-RAN ID, Broadcast service ID, N3mb DL tunnel 정보의 일부 또는 전부를 포함 할 수 있다. 이를 통해 AMF는 primary TMGI의 변경 여부를 MB-SMF에게 알릴 수 있다. 단계에서, MB-SMF는 MB-PCF와 SM policy 업데이트를 수행할 수 있다. 단계에서, MB-SMF는 MB-UPF에 게 새로운 primary TMGI와 N3mb DL tunnel 정보를 포함하는 N4mb Session update 메시지를 전송할 수 있다. N4mb Session update 메시지는 브로드캐스트 다운링크 데이터를 전송하기 위한 터널의 정보를 포함할 수 있다. 이 때, 해당 TMGI가 primary TMGI가 아닌 경우에 NG-RAN으로 중첩된 브로드캐스트 데이터가 전송되는 것을 방지 하기 위해서 deactivation 지시자를 포함할 수 있다. 따라서, deactivation 지시자를 수신하거나, TMGI가 primary TMGI와 서로 다른 것을 식별한 MB-UPF는 해당 TMGI로 전달된 브로드캐스트 서비스 데이터를 NG-RAN로 포워딩하지 않을 수 있다. 단계에서, MB-SMF는 AMF를 통해서 NG-RAN에 MBS Broadcast Context update response 메시지를 전송할 수 있다. MB-SMF는 NG-RAN에게 Broadcast session context 업데이트 요청에 대한 처리 결과를 전송할 수 있다. 단 계에서, NG-RAN은 새로 할당된 primary TMGI를 통해서 단말에게 브로드캐스트 데이터를 방송할 수 있다. 단계에서, MB-SMF는 primary TMGI의 정보를 MBSF에게 Nmbsmf_MBSSession_StatusNotify 메시지를 전송할 수 있다. 단계에서, NEF는 MB-SMF로부터 수신한 메시지에 기반하여 Nnef_MBSSession_StatusNotify 메시지 를 AF에게 전송할 수 있다. Nmbsmf_MBSSession_StatusNotify 및 Nnef_MBSSession_StatusNotify 메시지는 새로 운 primary TMGI, 브로드캐스트 서비스 ID, 기지국의 위치정보 및 NG-RAN ID를 포함할 수 있다. 단계에서, AF는 primary TMGI를 교체할 수 있다. 이에 따라, 단계에서, AF는 단말들에게 service announcement 메시지를 전송할 수 있다. 예를 들어, AF는 MOCN 기지국에서 브로드캐스트 서비스를 받기 위한 정 보를 단말에게 전송할 수 있다. 단계 및 단계에서 NG-RAN은 새로운 primary TMGI를 이용하여 브로드 캐스트 서비스 데이터를 단말들에게 방송할 수 있다. 도 8은 본 개시의 실시예에 따른 무선 통신 시스템에서 RAN을 공유(sharing)하는 경우, primary TMGI(temporary mobile group identity)를 업데이트 하는 방법에 대한 다른 예를 도시한다. 구체적으로, 도 8 은 무선 통신 시스템에서 RAN sharing NG-RAN에서 primary TMGI가 유효하지 않은 경우, AF를 통해서 primary TMGI를 업데이트 하는 방법의 예를 도시한다. 도 8에서 개시하는 UE, NG-RAN, AMF, MB-SMF, MB-UPF, NEF/MBSF, AF(content provider)는 도 1의 5GS가 포함하는 네트워크 엔티티들과 동일하게 이해될 수 있다. 또한, 도 8의 MB-PCF는 도 1의 PCF와 실질적으로 동일하게 이해될 수 있다. 예를 들어, 도 8의 MB-PCF는 도 1의 PCF에 있어서 MBS와 관련된 서비스를 제공 할 수 있는 PCF를 지칭할 수 있다. 단계에서 AF(또는 contents provider)는 브로드캐스트 서비스 데이터를 RAN sharing하는 NG-RAN에 전송할 수 있다. 단계에서, NG-RAN은 primary TMGI를 통해서 NG-RAN에 있는 단말들에게 브로드캐스트 서비스 데이 터를 브로드캐스팅할 수 있다. 단계에서, NG-RAN에서 primary TMGI를 통해서 더 이상 브로드캐스트 서비스 데이터를 제공하지 못하게 되 는 경우, NG-RAN은 primary TMGI 외에 동일한 브로드캐스트 서비스를 제공하는 사업자의 TMGI를 새로운 primaryTMGI로 선택하고, 업데이트가 필요함을 식별할 수 있다. 예를 들어, primary TMGI를 통해서 더 이상 브로드캐스 트 서비스를 제공하지 못하는 경우는 NG-RAN의 RAN sharing을 위한 계약이 primary TMGI로 사용하는 TMGI를 통 해 서비스하는 사업자에 대해서 종료되거나, 또는 primary TMGI로 사용하는 TMGI를 통해 서비스하는 사업자의 정책에 따라서 브로드캐스트 서비스를 정상적으로 수행하기 힘들다고 판단되는 경우, 또는 NG-RAN의 고장으로 인해 primary TMGI로 사용하는 TMGI를 통해 서비스하는 사업자에 할당된 리소스를 사용하지 못하게 되는 경우일 수 있다. 이 때, NG-RAN은 새로운 primary TMGI를 선택하고 업데이트할 필요가 있다. 새로운 primary TMGI를 선택한 NG-RAN은 기존 primary TMGI를 통해서 서비스하던 브로드캐스트 세션을 해지할 수 있다. 단계에서, NG-RAN은 기존 primary TMGI에 대해서 AMF에게 BroadcastSession release require 메 시지를 전송할 수 있다. AMF는 NG-RAN과 Broadcast Session release를 수행하고 MB-SMF에 Broadcast Session이 release됨을 알릴 수 있다. MB-SMF는 MB-UPF와 NG-RAN 사이의 다운링크 터널을 삭제하기 위하여 N4mb Session update를 수행할 수 있다. 즉, BroadcastSession release require 과정은 3GPP TS 23.247의 Figure 7.3.6-1을 따라서 기존 primary TMGI에 대한 Broadcast Session를 해지(release)할 수 있다. 단계에서, MB-SMF는 NG-RAN에서 기존 primary TMGI를 통한 broadcast session이 해지(release)되었음을 알리기 위하여 Nmbsmf_MBSSession_StatusNotify 메시지를 NEF에게 전송할 수 있다. 단계에서, 기존 primary TMGI를 통한 broadcast session이 해지되었음을 알리기 위한 메시지를 수신한 NEF는 Nnef_MBSSession_StatusNotify 메시지를 통해서 AF에게 기존 primary TMGI를 통한 broadcast session이 해지되 었음을 알릴 수 있다. 여기서, MB-SMF가 NEF에게 전송하는 메시지 및 NEF가 AF에게 전송하는 메시지(예: Nmbsmf_MBSSession_StatusNotify 및 Nnef_MBSSession_StatusNotify)는 해당 TMGI가 NG-RAN에서 더 이상 서비스 를 제공할 수 없음을 나타내기 위한 정보(indication)를 포함할 수 있다. 메시지(예: Nmbsmf_MBSSession_StatusNotify 및 Nnef_MBSSession_StatusNotify)는 NG-RAN의 위치 정보 또는 NG-RAN ID를 포함할 수 있다. 또한 메시지(예: Nmbsmf_MBSSession_StatusNotify 및 Nnef_MBSSession_StatusNotify)는 브로 드캐스트 서비스 ID(Broadcast Service ID)를 포함할 수 있다. 다시 말해서, MB-SMF는 브로드캐스트 서비스 ID 를 통해 어떤 중첩된 broadcast service에 대한 것인지에 대한 정보를 AF에게 알릴 수 있다. 단계에서, AF는 primary TMGI를 새로 할당하여 업데이트할 수 있다. 업데이트는 기존 primary TMGI를 제외 한 다른 TMGI를 서비스하는 사업자에 대해서 수행될 수 있다. AF가 primary TMGI를 새로 할당하고 업데이트를 수행하는 과정은 단계 내지 단계를 통해서 수행될 수 있다. 단계 내지 단계의 절차는 AF에 기반하여 primary TMGI를 업데이트 하기 위한 절차로서 primary TMGI를 최초에 할당하는 경우, 단계 내지 단계에서 사용되는 Update 메시지 대신 Create 메시지를 사용할 수 있다. 즉, 도 8은 설명의 편의를 위하 여 primary TMGI를 업데이트하는 과정에 대하여 서술하나, primary TMGI를 최초로 할당하여 생성하는 경우에도 마찬가지로 적용될 수 있다. 단계에서, 기존 primary TMGI를 제외한 다른 TMGI에 대해서 AF는 Nnef_MBSSession_Update request 메시지 를 NEF에게 전송할 수 있다. 단계에서, NEF는 Nmbsmf_MBSSession_Update request 메시지를 MB-SMF에게 전 송할 수 있다. 이에 따라, AF는 MB-SMF에게 새로 선택된 primary TMGI를 알릴 수 있다. 요청 메시지들(예: Nnef_MBSSession_Update request 메시지 및 Nmbsmf_MBSSession_Update request 메시지)은 해당 사업자의 TMGI 외에 새로 선택된 primary TMGI를 포함할 수 있다. 또한, 요청 메시지들(예: Nnef_MBSSession_Update request 메시지 및 Nmbsmf_MBSSession_Update request 메시지)은 어떤 브로드캐스트 서비스에 대한 것인지를 나타내기 위해서 브로드캐스트 서비스 ID(broadcast service ID)를 포함할 수 있다. 단계에서, MB-SMF는 MB-UPF와 브로드캐스트 서비스를 위한 데이터 경로(path)를 설정할 수 있다. 설정된 경로에 기반하여, 단계(840a) 및 단계(844a)에서, MB-SMF는 AF에게 단계 및 단계에 대한 응답 (response) 메시지를 보낼 수 있다. 즉, 단계(840a)에서 MB-SMF는 NEF에게 단계에 대한 응답 메시지(예: Nmbsmf_MBSSession_Update response)를 전송할 수 있고, 단계(844a)에서 NEF는 단계에 대한 응답 메시지 (예: Nnef_MBSSession_Update response)를 AF에게 전송할 수 있다. 또는, 상기 응답 메시지들은 NG-RAN 까지의 설정이 완료된 이 후, 단계(840b) 및 단계(844b)를 통해 AF에게 전송될 수도 있다. 단계에서, MB-SMF는 NG-RAN에 새로운 primary TMGI를 알리기 위해서 Namf_MBSBroadcast_ContextUpdate request 메시지를 AMF에게 전송할 수 있다. 요청 메시지(예: Namf_MBSBroadcast_ContextUpdate request)는 해 당 사업자의 TMGI 외에 새로운 primary TMGI를 포함하고, Broadcast service ID도 포함할 수 있다. 단계 에서, AMF는 수신한 요청 메시지를 브로드캐스트 서비스 영역에 있는 NG-RAN에게 포워딩하거나, 수신한 요청 메 시지에 대응하는 요청 메시지를 NG-RAN에게 전송할 수 있다. AMF는 NG-RAN에게 전송하는 메시지를 통해, 해당사업자의 TMGI 외에 새로운 primary TMGI를 알리고, Broadcast service ID를 알릴 수 있다. 단계에서 RAN sharing NG-RAN은 MBS session context를 업데이트하고, primary TMGI를 업데이트할 수 있다. 이 후, 단계 에서, RAN sharing NG-RAN은 해당 브로드캐스트 서비스에 대해서 TMGI를 사용하는 것 대신에 primary TMGI를 통해서 단말들에게 브로드캐스트 서비스를 제공할 수 있다. 단계에서, NG-RAN은 단계에서 수신한 메시지에 대한 응답으로 AMF에게 다운링크 브로드캐스트 트래픽 을 전송하기 위한 터널 정보를 전송할 수 있다. 또한, 단계에서 AMF는 단계에서 수신한 메시지에 대 한 응답으로 MB-SMF에게 Namf_MBSBroadcast_ContextUpdate response 메시지를 전송할 수 있다. Namf_MBSBroadcast_ContextUpdate response 메시지는 다운링크 브로드캐스트 트래픽을 전송하기 위한 터널 정 보 및 RAN Sharing NG-RAN의 위치 정보 또는 ID 등을 포함할 수 있다. 예를 들어, NG-RAN의 위치 정보는 NG- RAN의 ID 또는 Cell ID 또는 지리적인 위치 정보 또는 지리적 주소 정보를 포함할 수 있다. 단계 및 단계에서, MB-SMF는 MB-PCF와 SM policy 업데이트를 수행할 수 있다. 단계에서, MB- SMF는 MB-UPF와 N4mb Session 업데이트를 수행할 수 있다. N4mb Session 업데이트를 수행하는 경우, 새로운 primary TMGI와 다른 TMGI의 경우 NG-RAN으로 중첩되는 전송을 피하기 위해서, 다운링크 브로드캐스트 트래픽을 전송하기 위한 터널 정보를 전송하지 않거나 또는 다운링크 터널을 deactivation하는 indication를 포함하는 N4mb Session update를 MB-UPF에게 전송할 수 있다. 단계(840b)에서, MB-SMF는 primary TMGI 업데이트에 대한 결과를 NEF에게 전송할 수 있다. 단계(844b)에서, NEF는 primary TMGI 업데이트에 대한 결과를 AF에게 전송할 수 있다. 이 때, primary TMGI 업데이트에 대한 결 과에 대한 정보를 포함하는 메시지는 RAN Sharing NG-RAN의 위치 정보 또는 ID 등을 포함할 수 있다. 또한 메시 지는 broadcast service ID와 새로 업데이트된 primary TMGI값도 포함할 수 있다. 단계에서, AF는 단말들에게 MBS service announcement 메시지를 전송할 수 있다. 단계 및 단계(89 2)에서, RAN sharing NG-RAN은 새로 업데이트된 primary TMGI를 이용하여 브로드캐스트 서비스 데이터를 단말들 에게 방송할 수 있다. 단계에서, 단말들은 브로드캐스트 서비스를 제공받을 수 있다. 이 때, 단말들은 RAN sharing NG-RAN의 영역(즉, 서비스 영역) 내에 위치할 수 있다. 일 실시예에 따르면, 도 8의 primary TMGI를 업데이트하는 방법은 새로운 primary TMGI와 다른 TMGI의 사업자 망의 경우, primary TMGI 업데이트를 위한 단계 내지 단계에서 단계 내지 단계(844b)의 과정은 생략될 수 있다. 도 9는 본 개시의 실시예에 따른 무선 통신 시스템에서 primary TMGI를 서비스하는 사업자가 서비스를 제공하지 않는 경우, primary TMGI를 업데이트 하는 방법에 대한 예를 도시한다. 구체적으로, 도 9는 무선 통신 시스템 에서 primary TMGI를 이용하여 서비스를 제공하는 사업자가 더 이상 서비스를 제공하지 않는 경우, NG-RAN이 primary TMGI를 업데이트 하는 방법에 대한 예를 도시한다. 도 9에서 개시하는 UE, NG-RAN, AMF, MB-SMF, MB-UPF, NEF/MBSF, AF(content provider)는 도 1의 5GS가 포함하는 네트워크 엔티티들과 동일하게 이해될 수 있다. 또한, 도 9의 MB-PCF는 도 1의 PCF와 실질적으로 동일하게 이해될 수 있다. 예를 들어, 도 9의 MB-PCF는 도 1의 PCF에 있어서 MBS와 관련된 서비스를 제공 할 수 있는 PCF를 지칭할 수 있다. 단계에서 AF(또는 contents provider)는 브로드캐스트 서비스 데이터를 RAN sharing하는 NG-RAN에 전송할 수 있다. 도 9에서는 도시하지 않았으나, NG-RAN은 primary TMGI를 통해서 단말들에게 브로드캐스트 서비스 데 이터를 브로드캐스팅할 수 있다. 단계에서, primary TMGI에 해당하는 TMGI의 사업자 망에서 브로드캐스트 서비스를 더 이상 제공하지 않는 경우, TMGI에 대한 해지(release)가 필요할 수 있다. 단계에서 AF는 NEF를 통하여 MB-SMF에게 TMGI에 대 해서 Nmbsmf_MBSSession_Delete request를 전송할 수 있다. 이를 통하여 AF는 TMGI에 해당하는 브로드캐스트 서비스를 위한 MBS session을 삭제하도록 요청할 수 있다. 단계에서, MB-SMF는 TMGI에 대해서 Namf_MBSBroadcast_ContextRelease request를 수행할 수 있다. 예를 들어, MB-SMF는 AMF에게 TMGI에 대하여 Namf_MBSBroadcast_ContextRelease request 메시지를 전송할 수 있다. 단계에서, AMF는 MB Session resource release request를 수행할 수 있다. 예를 들어, AMF는 NG-RAN들에 게 MB Session resource release request 메시지를 전송할 수 있다. MB Session resource release request 메시지는 TMGI에 대응하는 브로드캐스트 서비스를 삭제하기 위한 정보를 포함할 수 있다. 단계에서, 상기 TMGI를 primary TMGI로서 브로드캐스트 서비스를 제공하고 있던 RAN sharing NG-RAN은 더 이상 상기 TMGI에 대한 서비스를 제공할 수 없음을 식별할 수 있다. RAN sharing NG-RAN은 상기 TMGI 외에 다른 사업자와 동일한 브로드캐스트 서비스를 지속하는 경우, 기존의 primary TMGI 대신 새로운 primary TMGI를 선택 할 수 있다. 이 후, 단계에서 NG-RAN은 새로운 primary TMGI를 방송할 수 있다. 단계에서, NG-RAN은 더 이상 서비스를 제공할 수 없는 상기 TMGI에 대한 서비스를 해지하는 과정을 수행할 수 있다. 예를 들어, NG-RAN은 AMF에게 MB Session resource release response 메시지를 전송할 수 있다. 단계 에서, AMF는 Namf_MBSBroadcast_ContextRelease response 메시지를 MB-SMF에게 전송할 수 있다. 또한, 단 계에서, MB-SMF는 MBS session 삭제 요청에 응답하여 Nmbsmf_MBSSession_Delete response 메시지를 전송 할 수 있다. 이 때, Nmbsmf_MBSSession_Delete response 메시지는 상기 TMGI에 대한 정보를 포함할 수 있고, 상기 TMGI는 old primary TMGI일 수 있다. 단계에서, NG-RAN은 새로운 primary TMGI가 설정됨에 따라서 기존 primary TMGI가 아닌 TMGI에 대해서 새 로운 primary TMGI를 업데이트하는 절차를 수행할 수 있다. 여기서, primary TMGI를 업데이트하는 절차는 도 7 의 단계 내지 단계와 동일한 절차를 의미할 수 있다. 따라서, 도 9에서는 primary TMGI를 업데이트하 는 구체적인 절차에 대하여는 생략한다. 도 10은 본 개시의 실시예에 따른 무선 통신 시스템에서 primary TMGI(temporary mobile group identity)를 서 비스하는 사업자가 서비스를 제공하지 않는 경우, primary TMGI를 업데이트 하는 방법에 대한 다른 예를 도시한 다. 구체적으로, 도 10은 무선 통신 시스템에서 primary TMGI를 서비스하는 사업자가 더 이상 서비스를 제공하 지 않는 경우, AF이 primary TMGI를 업데이트 하는 방법의 과정을 도시한다. 도 10에서 개시하는 UE, NG-RAN, AMF, MB-SMF, MB-UPF, NEF/MBSF, AF(content provider)는 도 1의 5GS가 포함하는 네트워크 엔티티들과 동일하게 이해될 수 있다. 또한, 도 10의 MB-PCF는 도 1의 PCF와 실질적으 로 동일하게 이해될 수 있다. 예를 들어, 도 10의 MB-PCF는 도 1의 PCF에 있어서 MBS와 관련된 서비스를 제공할 수 있는 PCF를 지칭할 수 있다. 단계에서 AF(또는 contents provider)는 브로드캐스트 서비스 데이터를 RAN sharing하는 NG-RAN에 전송 할 수 있다. 도 10에서는 도시하지 않았으나, NG-RAN은 primary TMGI를 통해서 단말들에게 브로드캐스트 서비스 데이터를 브로드캐스팅할 수 있다. 단계에서, primary TMGI에 해당하는 TMGI의 사업자 망에서 브로드캐스트 서비스를 더 이상 제공하지 않는 경우, TMGI에 대한 해지(release)가 필요할 수 있다. 단계에서, AF는 primary TMGI로 사용되고 있던 상 기 TMGI에 대하여 더 이상 서비스를 제공하기 위하여 사용되지 못함을 식별할 수 있고, 새로운 primary TMGI를 선택할 수 있다. 단계에서 AF는 NEF를 통하여 MB-SMF에게 TMGI(old primary TMGI)에 대해서 Nmbsmf_MBSSession_Delete request를 전송할 수 있다. 이를 통하여 AF는 TMGI에 해당하는 브로드캐스트 서비스를 위한 MBS session을 삭제 하도록 요청할 수 있다. 단계에서, MB-SMF는 AMF에게 TMGI에 대해서 Namf_MBSBroadcast_ContextRelease request를 수행할 수 있다. 예를 들어, MB-SMF는 AMF에게 TMGI에 대하여 Namf_MBSBroadcast_ContextRelease request 메시지를 전송할 수 있다. 단계에서 AMF는 MB Session resource release request를 수행할 수 있다. 예를 들어, AMF는 NG-RAN들에게 MB Session resource release request를 전송할 수 있다. 여기서, MB Session resource release request 메시지는 TMGI에 해당하는 브로드캐스트 서비스를 삭제하기 위한 정보를 포 함할 수 있다. 단계 내지 단계의 TMGI에 대한 서비스를 지우도록 요청하는 과정에서, 요청 메시지들은 새로 선택 된 primary TMGI(new primary TMGI)를 포함할 수 있다. 예를 들어, 단계 내지 단계에 의해, AF는 기존의 TMGI에 대한 서비스를 지우기 위한 메시지를 통해, 새로운 primary TMGI를 NG-RAN에게 전송할 수 있다. 단계에서 RAN sharing NG-RAN에서 primary TMGI를 새로운 primary TMGI로 업데이트할 수 있다. 이 후, 단계에서 NG-RAN은 새로운 primary TMGI를 방송할 수 있다. 단계에서, NG-RAN은 더 이상 서비스를 제공할 수 없는 TMGI(old primary TMGI)에 대한 서비스를 해지하 는 과정을 수행할 수 있다. 예를 들어, NG-RAN은 AMF에게 MB Session resource release response 메시지를 전 송할 수 있다. 단계에서, AMF는 Namf_MBSBroadcast_ContextRelease response 메시지를 MB-SMF에게 전송 할 수 있다. 또한, 단계에서, MB-SMF는 MBS session 삭제 요청에 응답하여 Nmbsmf_MBSSession_Delete response 메시지를 전송할 수 있다. 이 때, Nmbsmf_MBSSession_Delete response 메시지는 상기 TMGI에 대한 정 보를 포함할 수 있고, 상기 TMGI는 old primary TMGI일 수 있다. 단계에서, NG-RAN은 새로운 primary TMGI가 설정됨에 따라서 기존 primary TMGI가 아닌 TMGI에 대해서 새로운 primary TMGI를 업데이트하는 절차를 수행할 수 있다. 여기서, primary TMGI를 업데이트하는 절차는 도 8의 단계 내지 단계와 동일한 절차를 의미할 수 있다. 따라서, 도 10에서는 primary TMGI를 업데이트 하는 구체적인 절차에 대하여는 생략한다. 상술한 바와 같은 본 개시의 실시예들에 따른, 무선 통신 시스템에서, 기지국(base station)에 의해 수행되는 방법에 있어서, AF(application function)로부터, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 수신하는 단계; 상기 제1 프라이머 리 TMGI와 다른 제2 프라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 상기 제2 프라이머리 TMGI 로 업데이트가 필요한 경우, 상기 제2 프라이머리 TMGI와 관련된 제1 메시지를 AMF(access and mobility management function)에게 전송하는 단계; 및 상기 제1 메시지에 대한 응답으로, 상기 제2 프라이머리 TMGI와 관련된 제2 메시지를 상기 AMF으로부터 수신하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다. 일 실시 예에서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공할 수 있다. 일 실시 예에서, 상기 방법은, 상기 제1 프라이머리 TMGI에 대한 브로드캐스트 세션(broadcast session)을 해제 하기 위한 메시지를 상기 AMF에게 전송하는 단계를 더 포함할 수 있다. 일 실시 예에서, 상기 제1 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브 로드캐스트 서비스와 관련된 터널 정보(tunnel information)을 포함할 수 있다. 일 실시 예에서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적 인 주소 정보 중 적어도 하나를 포함할 수 있다. 상술한 바와 같은 본 개시의 실시예들에 따른, 무선 통신 시스템에서, AF(application function)에 의해 수행되 는 방법에 있어서, 기지국(base station)에게, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 전송하는 단계; 상기 제1 프라이머 리 TMGI에 대한 브로드캐스트 세션(broadcast session)이 해제되었음을 지시하는 정보를 포함하는 제1 메시지를 NEF(network exposure function)으로부터 수신하는 단계; 및 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI에 대한 정보를 포함하는 제2 메시지를 상기 NEF에게 전송하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다. 일 실시 예에서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공할 수 있다. 일 실시 예에서, 상기 방법은, 상기 NEF로부터, 상기 제2 메시지에 대한 응답 메시지를 수신하는 단계를 더 포 함할 수 있다. 일 실시 예에서, 상기 응답 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브 로드캐스트 서비스와 관련된 터널 정보(tunnel information)을 포함할 수 있다. 일 실시 예에서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적 인 주소 정보 중 적어도 하나를 포함할 수 있다. 상술한 바와 같은 본 개시의 실시예들에 따른, 무선 통신 시스템에서, 기지국(base station)에 의해 수행되는 방법에 있어서, AF(application function)로부터, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 수신하는 단계; 상기 제1 프라이머 리 TMGI와 관련된 브로드캐스트 서비스를 삭제하기 위한 정보를 포함하는 제1 메시지를 AMF(access andmobility management function)로부터 수신하는 단계; 상기 제1 프라이머리 TMGI와 다른 제2 프라이머리 TMGI 로 업데이트가 필요한지 여부를 식별하는 단계; 및 상기 제2 프라이머리 TMGI에 대한 정보를 전송하는 단계를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하기 위하여 공유될 수 있다. 일 실시 예에서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공할 수 있다. 일 실시 예에서, 상기 방법은, 상기 제1 프라이머리 TMGI에 대한 브로드캐스트 세션(broadcast session)을 해제 하기 위한 메시지를 상기 AMF에게 전송하는 단계를 더 포함할 수 있다. 일 실시 예에서, 상기 방법은, 상기 제2 프라이머리 TMGI로 업데이트가 필요한 경우, 상기 제2 프라이머리 TMGI 와 관련된 제3 메시지를 상기 AMF에게 전송하는 단계를 더 포함하고, 상기 제3 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브로드캐스트 서비스와 관련된 터널 정보(tunnal information)을 포함할 수 있다. 일 실시 예에서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적 인 주소 정보 중 적어도 하나를 포함할 수 있다. 상술한 바와 같은 본 개시의 실시예들에 따른, 무선 통신 시스템에서, AF(application function)에 의해 수행되 는 방법에 있어서, 기지국(base station)에게, 제1 프라이머리 TMGI(primary temporary mobile group identity)와 관련된 브로드캐스트 서비스(broadcast service)에 대한 정보를 전송하는 단계; 상기 제1 프라이머 리 TMGI와 다른 제2 프라이머리 TMGI로 업데이트가 필요한지 여부를 식별하는 단계; 및 상기 제1 프라이머리 TMGI와 관련된 브로드캐스트 서비스를 삭제하기 위한 정보를 포함하는 제1 메시지를 NEF(network exposure function)를 통하여 SMF(session management function)에게 전송하는 단계를 포함하고, 상기 제1 메시지는 상 기 제2 프라이머리 TMGI에 대한 정보를 포함하고, 상기 기지국은 제1 사업자 및 제2 사업자에 서비스를 제공하 기 위하여 공유될 수 있다. 일 실시 예에서, 상기 제1 사업자는 상기 제1 프라이머리 TMGI 및 상기 제2 프라이머리 TMGI에 기반하여 상기 브로드캐스트 서비스를 제공할 수 있다. 일 실시 예에서, 상기 방법은, 상기 NEF로부터, 상기 제1 메시지에 대한 응답 메시지를 수신하는 단계를 더 포 함하고, 상기 응답 메시지는 상기 제1 프라이머리 TMGI에 대한 정보를 포함할 수 있다. 일 실시 예에서, 상기 방법은, 상기 제2 프라이머리 TMGI에 대한 정보를 포함하는 제2 메시지를 상기 NEF에게 전송하는 단계; 및 상기 제2 메시지에 대한 응답 메시지를 수신하는 단계를 더 포함하고, 상기 제2 메시지에 대 한 응답 메시지는, 상기 기지국의 위치 정보, 상기 브로드캐스트 서비스에 대한 ID, 상기 브로드캐스트 서비스 와 관련된 터널 정보(tunnal information)을 포함할 수 있다. 일 실시 예에서, 상기 기지국의 위치 정보 상기 기지국의 ID, 셀(cell)의 ID, 지리적인 위치 정보, 또는 지리적 인 주소 정보 중 적어도 하나를 포함할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어 (instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근 (access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치 는 외부 포트를 통하여 본 개시의 실시 예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크상의 별도의 저장장치가 본 개시의 실시 예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 발명에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라 도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편, 본 명세서와 도면에 개시된 본 개시의 실시 예들은 본 개시의 기술 내용을 쉽게 설명하고 본 개시의 이해 를 돕기 위해 특정 예를 제시한 것일 뿐이며, 본 개시의 범위를 한정하고자 하는 것은 아니다. 즉 본 개시의 기 술적 사상에 바탕을 둔 다른 변형예들이 실시 가능하다는 것은 본 개시의 속하는 기술 분야에서 통상의 지식을 가진 자에게 자명한 것이다. 또한 상기 각각의 실시 예는 필요에 따라 서로 조합되어 운용할 수 있다. 예컨대, 본 개시의 일 실시 예와 다른 일 실시 예의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 예를 들면, 본 개시의 제1 실시 예와 제2 실시 예의 일부분들이 서로 조합되어 기지국과 단말이 운용될 수 있다. 또 한 상기 실시 예들은 FDD LTE 시스템을 기준으로 제시되었지만, TDD LTE 시스템, 5G 혹은 NR 시스템 등 다른 시 스템에도 상기 실시 예의 기술적 사상에 바탕을 둔 다른 변형예들이 실시 가능할 것이다. 한편, 본 발명의 방법을 설명하는 도면에서 설명의 순서가 반드시 실행의 순서와 대응되지는 않으며, 선후 관계 가 변경되거나 병렬적으로 실행될 수도 있다. 또는, 본 발명의 방법을 설명하는 도면은 본 발명의 본질을 해치지 않는 범위 내에서 일부의 구성 요소가 생략 되고 일부의 구성요소만을 포함할 수 있다. 또한, 본 발명의 방법은 발명의 본질을 해치지 않는 범위 내에서 각 실시예에 포함된 내용의 일부 또는 전부가 조합되어 실행될 수도 있다. 본 개시의 다양한 실시예들이 전술되었다. 전술한 본 개시의 설명은 예시를 위한 것이며, 본 개시의 실시예들은"}
{"patent_id": "10-2022-0093797", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "개시된 실시예들에 한정되는 것은 아니다. 본 개시가 속하는 기술분야의 통상의 지식을 가진 자는 본 개시의 기 술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 쉽게 변형이 가능하다는 것을 이해할 수 있을 것이다. 본 개시의 범위는 상기 상세한 설명보다는 후술하는 특허청구범위에 의하여 나타내어지며, 특허청 구범위의 의미 및 범위 그리고 그 균등 개념으로부터 도출되는 모든 변경 또는 변형된 형태가 본 개시의 범위에 포함되는 것으로 해석되어야 한다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10"}
{"patent_id": "10-2022-0093797", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 무선 통신 시스템에서 5G 시스템 구조에 대한 예를 도시한다. 도 2는 본 개시의 실시예에 따른 무선 통신 시스템에서 기지국의 구성에 대한 예를 도시한다. 도 3은 본 개시의 실시예에 따른 무선 통신 시스템에서 단말의 구성에 대한 예를 도시한다. 도 4는 본 개시의 실시예들에 따른 무선 통신 시스템에서 네트워크 객체(network entity)의 구성에 대한 예를 도시한다. 도 5는 본 개시의 실시예에 따른 무선 통신 시스템에서 RAN을 공유(sharing)하는 경우, 서비스하는 사업자가 바 뀌는 상황에 대한 예를 도시한다. 도 6은 본 개시의 실시예에 따른 무선 통신 시스템에서 공유 기지국을 통해서 브로드캐스트 서비스를 위한 브로 드캐스트 세션을 생성하기 위한 과정에 대한 예를 도시한다. 도 7은 본 개시의 실시예에 따른 무선 통신 시스템에서 RAN을 공유(sharing)하는 경우, primary TMGI(temporary mobile group identity)를 업데이트하는 방법에 대한 예를 도시한다.도 8은 본 개시의 실시예에 따른 무선 통신 시스템에서 RAN을 공유(sharing)하는 경우, primary TMGI(temporary mobile group identity)를 업데이트하는 방법에 대한 다른 예를 도시한다. 도 9는 본 개시의 실시예에 따른 무선 통신 시스템에서 primary TMGI(temporary mobile group identity)를 서 비스하는 사업자가 서비스를 제공하지 않는 경우, primary TMGI를 업데이트하는 방법에 대한 예를 도시한다. 도 10은 본 개시의 실시예에 따른 무선 통신 시스템에서 primary TMGI(temporary mobile group identity)를 서 비스하는 사업자가 서비스를 제공하지 않는 경우, primary TMGI를 업데이트하는 방법에 대한 다른 예를 도시한 다."}
