{"patent_id": "10-2023-0116224", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0033736", "출원번호": "10-2023-0116224", "발명의 명칭": "자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 및 이를 위한 방법", "출원인": "손영준", "발명자": "손영준"}}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다운로드되어 설치되는 디코팜앱 운용에 의하여 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매칭, 농축산토지 임대차 정보를 입력하고 임대차하며 특산물 거래 정보를 입력하고 거래하며 경작자 구인구직 정보를 입력하고 구인구직하며 정보보호를 위하여 암호화된 디코팜패킷프레임으로 지정된 상대방과 통신하는 스마트팜단말부(1000); 상기 스마트팜단말부(1000)와 공중통신망(2000)을 경유하여 접속하고 최신버전의 디코팜앱을 다운로드로 설치운용시키며 인공지능 머신러닝 프로그램 운용에 의하여 자경자와 전문 경작인의 매칭, 농축산토지 임대차정보와특산물 거래정보와 경작자 구인구직정보이며 최근 1 년 이내에 생성된 것으로 분석된 정보를 각각 지정된 영역에 기록 관리하고 검색에 의하여 제공하며 정보보호를 위하여 암호화된 디코팜패킷프레임으로 지정된 상대방과통신하는 디코팜서버부(3000); 상기 디코팜서버부(3000)와 공중통신망(2000)을 경유하여 접속하고 포탈사이트서버(5000)와 신문방송통신매체서버(6000)로부터 공개된 빅데이터 정보로부터 자경자와 전문 경작인의 매칭, 농축산토지 임대차 정보와 특산물거래 정보와 경작자 구인구직정보를 인공지능 머신러닝 프로그램 운용에 의하여 주기적으로 수집 저장하고 제공하는 농축산정보관리서버(4000); 를 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 스마트팜단말부(1000)는 상기 스마트팜단말부(1000)에 구비된 각 기능부에 접속하고 해당 제어신호를 각각 출력하며 전체 구성의 운용을내장된 운용프로그램과 파라미터와 입력되는 명령신호에 의하여 각각 제어하고 감시하는 팜단말중앙제어부(1010); 상기 팜단말중앙제어부(1010)의 해당 제어신호에 의하여 스트리밍 방식으로 다운로드되는 최신버전의 디코팜앱을 할당된 영역에 기록 저장하고 설치하여 운용상태로 설정하는 디코팜앱설치운용부(1020); 상기 팜단말중앙제어부(1010)의 해당 제어신호에 의하여 멀티미디어 신호를 출력하거나 입력하며 터치에 의한외부의 명령신호와 선택신호와 농축산토지 임대차 정보와 특산물 거래 정보와 경작자 구인구직 정보를 입력하는팜단말터치멀티입출부(1030); 상기 팜단말중앙제어부(1010)의 해당 제어신호에 의하여 상기 디코팜서버부(3000)에 송신하는 신호를 디코팜패킷프레임으로 암호화하고 상기 디코팜서버부(3000)으로부터 수신되는 디코팜패킷프레임 신호를 복호화하는 팜단말패킷암복호부(1040); 상기 팜단말중앙제어부(1010)의 해당 제어신호에 의하여 상기 공중통신망(2000)과 접속하고 코드분할다중접속방식으로 연결되어 통신신호를 송신과 수신하는 코드분할다중접속이동통신부(1050); 상기 팜단말중앙제어부(1010)의 해당 제어신호에 의하여 상기 공중통신망(2000)과 접속하고 와이파이 방식으로연결되어 통신신호를 송신과 수신하는 와이파이통신부(1060); 상기 팜단말중앙제어부(1010)의 해당 제어신호에 의하여 상기 공중통신망(2000)과 접속하고 블루투스 방식으로연결되어 통신신호를 송신과 수신하는 블루투스통신부(1070); 를 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템. 공개특허 10-2025-0033736-3-청구항 3 제 2 항에 있어서, 상기 팜단말중앙제어부(1010)는 상기 디코팜서버부(3000)가 통신 상대방으로 지정되면 상기 코드분할다중접속이동통신부(1050)와 와이파이통신부(1060)와 블루투스통신부(1070)를 동시에 각각 활성화 상태로 운용하고 상기 팜단말패킷암복호부(1040)가 암호화한 디코팜패킷프레임 신호를 상기 디코팜서버부(3000)에 전달되도록 상기 공중통신망(2000)에 송신하며, 상기 디코팜서버부(3000)로부터 통신상대방으로 지정되고 상기 코드분할다중접속이동통신부(1050)와 와이파이통신부(1060)와 블루투스통신부(1070)를 통하여 동시에 수신되면 각각의 수신신호세기값(RSSI)을 분석하여 가장 큰값으로 나오는 어느 하나를 선택하여 수신신호로 입력하도록 제어하고 감시하는 구성으로 이루어지는 것을 특징으로 하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서, 상기 디코팜서버부(3000)는 상기 디코팜서버부(3000)에 구성되는 각 기능부를 자체 내장된 운용프로그램과 운용파라미터값에 의하여 해당제어신호를 각각 출력하고 운용상태를 감시하는 디코팜서버집중관리부(3010); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 스마트팜단말부(1000)가 접속하고 가입하면최신 버전의 디코팜앱을 스트리밍 방식으로 다운로드하여 제공하고 자동으로 설치되어 운용되도록 감시하는 서버디코팜앱관리부(3020); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 농축산정보관리서버(4000)가 수집한 농축산토지 임대차정보와 특산물 거래정보와 경작자 구인구직정보를 검색하고 머신러닝 방식의 인공지능으로 분석하여최근 1 년 이내에 생성된 정보를 분리 추출하고 입력하는 서버인공지능운용부(3030); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 스마트팜단말부(1000)에 송신하는 신호를 디코팜패킷프레임으로 암호화하고 상기 스마트팜단말부(1000)로부터 수신되는 디코팜패킷프레임을 복호화하는 서버패킷암복호부(3040); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 공중통신망(2000)과 접속하고 코드분할다중접속 방식으로 연결되어 통신신호를 송신과 수신하는 서버코드분할다중접속이동통신부(3050); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 공중통신망(2000)과 접속하고 와이파이 방식으로 연결되어 통신신호를 송신과 수신하는 서버와이파이통신부(3060); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 공중통신망(2000)과 접속하고 블루투스 방식으로 연결되어 통신신호를 송신과 수신하는 서버블루투스통신부(3070); 상기 디코팜서버집중관리부(3010)의 해당 제어신호에 의하여 상기 서버인공지능운용부(3030)가 분석하여 입력하는 농축산토지 임대차 정보와 특산물 거래 정보와 경작자 구인구직 정보를 해당 생성 일자 정보에 연계시켜 할당된 영역에 기록하는 농축산경작정보데이터베이스부(3080); 를 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "스마트팜단말부와 공중통신망과 디코팜서버부와 농축산정보관리서버와 포탈사이트서버와 신문방송매체서버를 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 운용방법에 있어서, 상기 디코팜서버부에 의하여 상기 스마트팜단말부가 접속되면 최신버전의 디코팜앱이 설치되어 운용되도록 제어하고 농축산 시작메뉴가 표시되도록 제어하고 감시하는 준비단계; 공개특허 10-2025-0033736-4-상기 디코팜서버부에 의하여 상기 스마트팜단말부가 농축산토지 임대차 메뉴를 선택한 것으로 판단되면 상기 스마트팜단말부에서 농축산토지임대차 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 임대차단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부가 특산물 정보 메뉴를 선택한 것으로 판단되면 상기 스마트팜단말부에서 특산물 직거래 정보 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 특산물 단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부가 구인구직 메뉴를 선택한 것으로 판단되면 상기 스마트팜단말부에서 구인구직 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 구인구직 단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부로부터 계약요청 신호를 선택 입력한 것으로 판단되면 상기 스마트팜단말부에서 계약 루틴이 운용되도록 제어하고 루틴운용 중에 입력된 정보를 수신하여 할당된 영역에 기록관리하는 계약 단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부로부터 경작이 완료되어 출하요청하는 신호가 입력되는 것으로판단되면 상기 스마트팜단말부에서 출하분배 루틴이 운용되도록 제어하고 루틴운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 출하분배 단계; 를 포함하는 농축산용 부동산 임대차와 특산물 거래와 경작자구인구직 정보 공유 플랫폼 시스템 운용방법."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 농축산토지임대차 루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 소유권자 정보 입력 요청신호가 입력되는 것으로 판단하면농축산토지의 현황정보를 입력받아 등록하는 소유권정보입력 과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 경작자 정보 입력 요청 신호가 입력되는 것으로 판단되면 경작자의 정보를 입력받아 등록하는 경작자정보입력과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 소유권정보입력 과정으로 궤환하여 반복 진행하고 반복진행 요청신호가 입력되는 아니하는 것으로 판단되면 종료로진행하는 임대차반복과정; 을 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 운용방법."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 특산물 직거래 정보 루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 하나 이상 다수의 특산물선택메뉴 표시하고 어느 하나가 선택되어 해당 특산물 정보의 입력 요청 신호가 입력되는지 판단하는 특산물선택과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 특산물 정보의 입력 요청 신호가 입력되는 것으로 판단되면해당 특산물 정보를 입력하여 등록하는 특산물등록과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 특산물선택 과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 특산물반복과정; 을 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 운용방법. 공개특허 10-2025-0033736-5-청구항 8 제 7 항에 있어서,상기 구인구직루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 구인정보 입력의 요청 신호가 입력되는 것으로 판단되면 경작자의 구인정보를 입력하여 등록하는 구인정보입력과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 구직정보 입력의 요청 신호가 입력되는 것으로 판단되면 작업자의 구직정보를 입력하여 구직정보입력과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 구인정보입력 과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 구인구직반복과정; 을 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 운용방법."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서, 상기 계약루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 계약진행의 요청 신호가 입력되는 것으로 판단되면 농축산토지 임대차 계약 또는 특산물 구매계약 또는 구인구직정보에 의한 채용계약 중 어느 하나의 계약정보를 입력하여등록하는 계약설정과정; 상기 디코팜서버부에 의하여 스마트팜단말부에 입력되어 등록된 계약정보를 계약의 양당사자에게 전달하고 이행보증보험, 농협생명보험의 가입을 안내하는 보험안내과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 계약설정 과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 계약반복과정; 을 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 운용방법."}
{"patent_id": "10-2023-0116224", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 8 항에 있어서, 상기 출하분배루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 경작된 특산물의 출하 조건 정보를 소유권자에게 통보하고경작된 특산물을 출하 처리하는 특산물출하과정; 상기 디코팜서버부에 의하여 스마트팜단말부에 입력되고 출하된 특산물의 출하대금으로부터 소요경비를 공제 처리하고 순매출 비용을 연산하여 결정하는 순매출산정과정; 상기 디코팜서버부에 의하여 산정된 순매출에 의한 순이익 비용을 계약된 비율로 분배 처리하는순이익분배과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 특산물출하과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 출하분배반복과정; 을 포함하는 자경자와 협업 전문 경작인 간의 구인구직 정보 공유 플랫폼 시스템 운용방법."}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 농작물 경작에 필요한 전, 답, 임야와 가축, 어류 등의 사육에 필요한 축산장, 가두리 어업장 등이 포 함되는 축산 전용의 농축산토지(제한적 농지) 정보를 실시간으로 제공하되, 토지 소유주인 자경자가, 작물에 대 하여 전문적 지식이 있는 전문 경작자 혹은, 경작지를 임대한 관리자가 전문적 경작자와 함께 공유 경작을 할 수 (뒷면에 계속)"}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 농축산용 부동산 임대차(이하에서는, 임대가 가능한 농지, 즉 제한적 농지로 해석되어야 한다)와 특 산물 거래와 경작자 구인구직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직) 정보 공유 플랫폼 시스템 및 그 운용방법에 관한 것으로 더욱 상세하게는 농작물 경작에 필요한 전답, 임야와 가축, 어류 등의 사육에 필 요한 축산장, 가두리 어업장 등이 포함되는 농축산 전용 부동산(농축산토지(제한적 농지)) 정보를 실시간으로 제공하되, 소유주(지주), 농축산업인이 필요에 의하여 각포지션에서 부족한 부분을, 상호보완관계에서 협업할수 있도록 하며, 본 발명에서 제공하는 방법으로 생산된 해당 특산물을 직거래하고 부족한 인력에 대해, 농축산업 에 대한 전문인력 및 보조인력으로 구분된, 구인(구직)을 위한 데이터베이스을 제공하는 것이다. 즉, 소유주(지주)가 필요에 의하여 소유 전답의 적어도 일부분을 의욕 있는 농축산업인(종사자, 농축산업에 대 한 전문 인력)와 함께 경작하거나 생산된 해당 특산물을 직거래하고 농축산업 종사 경작자를 구인(구직)하거나 자본이 부족하거나 경험이 없었던 농축산업 전문 인력이 필요한 제한적 농지를 임차하거나 공동 또는 공유재배 할 수 있도록 임대인과 임차인의 양쪽 해당 정보를 제공하여 쉽고 빠르게 서로의 필요성을 충족시키므로 농축산 업을 활성화시키고 적은 인력과 적은 자본으로 농축산업에 종사하여 정착하며 수익을 높이도록 하는 기회를 제 공하는 자경자와 협업 전문 경작인 간의 구인구직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직) 정보 공유 플랫폼 시스템 및 이를 위한 방법에 관한 것이다."}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "토지 또는 부동산은 해당 법과 제도에 의하여 독점적으로 직접 소유하고 사용할 수 있도록 하는 소유권과 타인 이 소유권자와 소정의 거래에 의하여 정해진 기간 동안 사용하고 해당 수익을 취하도록 하는 사용권으로 구분될 수 있다. 한편, 이러한 토지(부동산)는 크기 또는 넓이가 제한적이고 개인 각각의 경제력 차이에 의하여 한꺼번 에 필요한 토지 소유권을 모두 확보하기 어려운 것이 일반적이다. 이하에서 토지 또는 정착물이 포함된 토지에는 농업과 임업과 축산업과 어업 등에 사용되거나 사용될 수 있는 부동산이 포함되고 '농축산토지(제한적 농지)'(농지, 기타경작지 포함)로 기재하기로 한다. 한편, 농축산토지 (제한적 농지)와 부동산은 같은 의미이고 문맥에 적합하게 선택적으로 기재하기로 한다. 그리고 농축산어업(농 축산업)의 종사자와 경작자는 같은 의미이고 문맥에 적합하게 선택적으로 기재하기로 한다. 다만, 본 발명에서 의 농축산토지(제한적 농지)(즉, 제한적 농지)에 포함되는 농지는 전답만을 가리키는 것이며, 농지법이 적용되 거나, 법에 의하여 임대가 가능한 농지, 즉 제한적 농지로 해석되어야 함은 명확하다. 현대사회의 발전에 따라 일자리를 찾아 농어촌 인구가 번화한 도시로 집중되는 현상이 지속적으로 이어지고 있 으며, 이러한 현상은 지역적으로 인구밀도의 큰 차이를 발생시키고, 이에 따라, 대도시에서만 인구가 밀집되는 과밀 현상이 발생하면서 지방의 농어촌에서는 젊은층이 대거 도시로 이주하여 노령층만 존재하는 지역이 점차 늘어나는 문제가 있다. 한편, 토지는 존재하지만 경작하는 사람이 부족하거나 없으며, 토지의 매매는 이루어지지 않으면서 토지 소유주 가 고령층화되어 가는 동시에 도시 등으로 이주한 자녀가 포함되는 젊은층으로 소유권 변경이 진행되면서 토지 소유주에 의한 직접적 경작이 이루어지지 않는 현상이 발생하고 있다. 또한, 도시에 거주하는 다른 일부 젊은층은 건강상의 문제, 직업상의 문제 또는 농어촌 생활의 풍요로움과 여유 로움 등을 추구하고자 다양한 방법으로 귀향(귀농, 귀어)을 원하는 희망자가 발생하지만, 제한되고 유한한 주변 여건에 의하여 농축산토지(제한적 농지)의 확보가 비교적 쉽지 않고 토지 소유 및 운용 현황 정보 등을 실시간 확인하기 어려운 문제가 있다. 그리고 대규모 토지를 소유하여 경작하는 경작자의 노령화에 의하여 해당 소유자 또는 경작자 자력으로 경작을 계속하기 어려운 경우 경작 유지를 포기하는 문제가 있다. 농축산토지(제한적 농지)는 해당 소유권자가 수익성 창출에 직접사용하지 않는 경우 필요한 사람에게 임대 또는 공유를 허락할 수 있으며 이러한 소유권자를 임대인이라 하고, 농축산토지(제한적 농지)를 빌려 운용 또는 공유 하므로 수익을 확보 또는 분배하고자 하는 경우를 임차인이라 하며, 서로 상대방이 제시하는 정보를 쉽게 확보 하지 못하므로 부동산거래소 등을 통하여 해당 정보를 제시하고 필요한 임대차 거래가 이루어지는 것이 일반적 이지만, 해당 필요 정보를 쉽게 확보하기 어려운 것이 현실이다. 그리고 농축산토지(제한적 농지)의 임대와 임차에 대응하는 해당 비용은 성립된 계약에 의하여 지정된 일자에 약정된 금액(재화)로 제공하며 임대차 비용 지불이 정상적으로 이루어지지 않을 경우를 대비하여 보증금 또는 담보를 대부분 설정하는 불편함이 있다. 이러한 종래의 문제점을 일부 해소한 종래기술로 대한민국 특허 공개번호 제10-2023-0087128호(2023년 06월 16 일)에 의한 것으로 '부동산 임대차 기반 종합서비스 플랫폼 시스템'이 있다. 도 1 은 종래기술의 일 실시 예에 의한 것으로 부동산 임대차 거래 서비스 플랫폼 시스템의 기능 구성도 이다. 스마트폰이 포함되는 이동통신용 모바일 단말로 이루어지는 임대인 단말과 임차인 단말과 일반인 단 말은 각각 임대인과 임차인과 일반인이 사용하고 서비스 앱(App, 애플리케이션, 모바일앱)이 각각 설 치 운용되며 서비스 플랫폼 시스템에 온라인 접속하여 운용된다. 서비스 플랫폼 시스템은 서버 시스템으로 이루어지고, 임대 대상이 되는 부동산 정보와 해당 임대인과 임 차인의 금융 정보를 각각 관리하고 임대차된 부동산에 대한 임대비용이 해당 계약에 의하여 자동으로 입출금되 도록 하되, 음식배달 주문 서비스를 연계시켜 제공하는 구성이다. 종래기술은 부동산 임대차 거래에 의한 임대비용이 원활하게 지급되는 장점이 있으나 임대인과 임차인이 각각 필요로 하는 부동산 정보 및 농업과 임업과 어업 등에 사용되는 부동산 정보 또는 농축산토지(제한적 농지) 정 보를 제공하지 못하는 문제가 있다. 또한, 특정 농축산토지(제한적 농지)를 이용한 해당 특산물의 직거래를 위한 정보와 경작자에 대한 인력정보를 실시간으로 제공하지 못하는 문제가 남아 있다. 한편, 대한민국 특허 출원번호 제10-2021-0173198호(2021년 12월 06일)에 의한 것으로 '온라인을 이용한 토지 공유경작 매칭시스템 및 그 방법'은 토지 공유 희망자에게 토지를 단기간 공유하도록 하는 시스템이나, 농지법 상의 문제가 존재한다. 농지법상 농지 경작은 자경만이 가능한데, 농지법에 의한 자경은 농업인이 그 소유 농지 에서 농작물 경작 또는 다년생식물 재배에 상시 종사하거나 농지법에 의하여 규정된 분량 이상의 농작업을 자기 노동력으로 경작 또는 재배하는 것과 농업법인이 그 소유 농지에서 농작물을 경작하거나 다년생식물을 재배하는 것으로 정의된다. 따라서, 토지 경작을 매칭하는 방식으로는 공유 경작을 수행할 수 없다. 더불어, 농지상으로 농지가 임대가 가능한 경우는 아래와 같은데, ● 경작을 위하여 지목의 전답을 제외한 임,산업,잡종지, 나대지등에 대한 경작지 임대 ● 주말, 체험 영농을 위한 농지 임대 (조건부) ● 이모작을 위한 8개월 이내의 농지 임대 ● 상속으로 취득한 농지 또는 상한초과 보유 농지 임대 ● 60세이상인자가 5년 넘게 농업경영을 한 농지 임대 ● 8년 이상 농업경영하고 이농한 자가 소유한 농지 또는 상한초과 보유 농지임대 ● 경매 유출로 취득한 담보농지임대 ● 개발사업지구 1,500㎡미만 취득 농지 임대 ● 질병, 징집, 취학, 선거에 따른 공직취임으로 일시적 농지 임대 이에 따라 판단하면, 대한민국 특허 출원번호 제10-2021-0173198호(2021년 12월 06일)의 경우에는, 농지법상으 로 허용 불가한 공유 경작의 형태를 제안하고 있는 문제점이 있다. 따라서 농축산토지(제한적 농지)를 이용하여 적어도 일부분을 의욕있는 경작자에게 임대 또는 공동 또는 공유 재배하도록 함으로써, 생산된 특산물의 직거래를 활성화시키며 필요한 전문 인력의 확보를 쉽게하여 농축산업을 활성화시키고 적은 자본으로 농축산토지(제한적 농지)를 일부 공유하여 농축산업에 종사하여 정착을 빠르게 하 며, 농축산관련 일자리를 원활하게 제공하는 기술의 개발 필요가 있다. 따라서, 본 발명에서는 농축산전문인력과 농축산토지(제한적 농지)(특히, 농지)를 소유한 사람과의 매칭을 효율 적으로 제공할 수 있다. 농지를 임대 또는 공동 또는 공유 재배을 해서, 자경 또는 경영을 하면 좋지만, 모두 법의 테두리에서 벗어난 행위이기에, 본 발명에서는 농축산토지(제한적 농지)(특히, 농지)에서 자의적인 해석의 공동 또는 공유 재배경영, 대리영농을 모두 절차에 의해 할수 있도록 시스템을 제공한다. 이는 향후 인구감소 및 환경적인 문제로, 농축산 분야에서 그 산업을 지탱하는 전체적인 구도의 변화가 있더라도, 농지를 활용하는구조에 변화를 줌으로써, 1차산업의 발전 및 나아가 1차 산업의 붕괴를 최소화 할 수 있다. 즉, 농사로 경험이 많거나, 농축산 관련 대학 졸업자, 농축산 관련 전공자, 농축산 관련 유사 전공자들과 같은 농축산업 분야의 전문가들. 혹은 특정 분야의 전문가(예를 들어, 논작물, 밭작물 등에서 생산품별(브로컬리, 더 덕, 무우, 배추 등)로 전문가), 친환경인증 등 제도적으로 차별화된 재배&사육의 경우와 같이 기술적인 전문분 야에 따른 전문적인 지식 및 경험을 갖춘 사람들을 데이터베이스화 함으로써, 농축산업 분야의 전문가와 농축산 토지(제한적 농지)(특히, 농지)를 소유한 사람과의 매칭을 효율적으로 제공할 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 특허 공개번호 제10-2023-0087128호(2023년 06월 16일) '부동산 임대차 기반 종합서 비스 플랫폼 시스템' (특허문헌 0002) 대한민국 특허 출원번호 제10-2021-0173198호(2021년 12월 06일) '온라인을 이용한 토지 공유 경작 매칭시스템 및 그 방법'"}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 종래 기술의 문제점과 필요성을 해소하기 위하여 안출한 본 발명은 농축산토지(제한적 농지, 부동 산)를 이용하여 의욕 있는 경작자에게 임대 또는 공동 또는 공유 재배 및 운용의 기회를 제공하고 생산된 특산 물의 직거래를 활성화시키는 자경자와 협업 전문 경작인 간의 구인구직(예, 전문경작자 구인구직, 경작축산보조 인력 구인구직) 정보 공유 플랫폼 시스템 및 이를 위한 방법을 제공한다. 또한, 본 발명은 농축산업의 전문 경작자 인력 확보를 쉽게하여 전문 경작자의 구인과 구직 기회를 높이고 어업 이 포함된 농축산업 활성화를 촉진시키며 적은 자본으로 필요한 농축산토지(제한적 농지)를 필요한 만큼 공유하 여 농축산업에 정착을 빠르게 하고 농축산업을 통하여 높은 수익 창출에 기여하는 자경자와 협업 전문 경작인 간의 구인구직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직) 정보 공유 플랫폼 시스템 및 이를 위한 방법을 제공한다."}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여 안출한 본 발명의 자경자와 협업 전문 경작인 간의 구인구직(예, 전문경작 자 구인구직, 경작축산보조인력 구인구직) 정보 공유 플랫폼 시스템은 다운로드되어 설치되는 디코팜앱 운용에 의하여 농축산토지(제한적 농지) 임대차 정보를 입력하고 임대차하며 특산물 거래 정보를 입력하고 거래하며 경 작자 구인구직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직) 정보를 입력하고 구인구직하며 정보보호 를 위하여 암호화된 디코팜패킷프레임으로 지정된 상대방과 통신하는 스마트팜단말부; 상기 스마트팜단말 부와 공중통신망을 경유하여 접속하고 최신버전의 디코팜앱을 다운로드로 설치 운용시키며 인공지 능 머신러닝 프로그램 운용에 의하여 농축산토지(제한적 농지) 임대차정보와 특산물 거래정보와 경작자 구인구 직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직)정보이며 최근 1 년 이내에 생성된 것으로 분석된 정 보를 각각 지정된 영역에 기록 관리하고 검색에 의하여 제공하며 정보보호를 위하여 암호화된 디코팜패킷프레임 으로 지정된 상대방과 통신하는 디코팜서버부; 상기 디코팜서버부와 공중통신망을 경유하여 접속하고 포탈사이트서버와 신문방송통신매체서버로부터 공개된 빅데이터 정보로부터 농축산토지 (제한적 농지) 임대차 정보와 특산물 거래 정보와 경작자 구인구직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직)정보를 인공지능 머신러닝 프로그램 운용에 의하여 주기적으로 수집 저장하고 제공하는 농축산정보관 리서버; 를 포함할 수 있다. 상기 농축산정보관리서버에 공중통신망을 경유하여 접속하고 인터넷을 통하여 공개된 빅데이터 정 보를 멀티미디어 신호로 기록 관리하고 검색에 의하여 제공하는 포탈사이트서버; 상기 농축산정보관리서 버에 공중통신망을 경유하여 접속하고 신문과 방송을 통하여 공개된 빅데이터 정보를 멀티미디어신호로 기록 관리하고 검색에 의하여 제공하는 신문방송매체서버; 를 더 포함할 수 있다. 상기 스마트팜단말부는 상기 농축산토지(제한적 농지)를 소유하거나 특정 경작권을 보유한 소유권자용과 상기 농축산토지(제한적 농지)를 직접 운용하여 수익을 발생하는 경작자용과 상기 농축산토지(제한적 농지)에서 직접 작업하는 작업자용과 상기 농축산토지(제한적 농지)에서 생산된 특산물을 구매하여 소비하는 소비자용을 포함하여 이루어질 수 있다. 상기 공중통신망은 호출측 및 피호출측과 코드분할다중접속 방식으로 접속하고 통신신호를 전송하는 코드 분할다중접속무선부; 상기 코드분할다중접속무선부에 접속하고 코드분할다중접속 방식으로 접속된 호출측의 요청에 의하여 코드분할다중접속 방식으로 피호출측과 접속하는 경로를 설정하는 코드분할다중접속스 위칭부; 호출측 및 피호출측과 와이파이 방식으로 접속하고 통신신호를 전송하는 와이파이무선부; 상기 와이파이무선부에 접속하고 와이파이 방식으로 접속된 호출측의 요청에 의하여 와이파이 방식으로 피호출측과 접속하는 경로를 설정하는 와이파이스위칭부; 호출측 및 피호출측과 블루투스 방식으로 접속 하고 통신신호를 전송하는 블루투스무선부; 상기 블루투스무선부에 접속하고 블루투스 방식으로 접 속된 호출측의 요청에 의하여 블루투스 방식으로 피호출측과 접속하는 경로를 설정하는 블루투스스위칭부 ;를 포함할 수 있다. 상기 스마트팜단말부는 상기 스마트팜단말부에 구비된 각 기능부에 접속하고 해당 제어신호를 각각 출력하며 전체 구성의 운용을 내장된 운용프로그램과 파라미터와 입력되는 명령신호에 의하여 각각 제어하고 감 시하는 팜단말중앙제어부; 상기 팜단말중앙제어부의 해당 제어신호에 의하여 스트리밍 방식으로 다 운로드되는 최신버전의 디코팜앱을 할당된 영역에 기록 저장하고 설치하여 운용상태로 설정하는 디코팜앱설치운 용부; 상기 팜단말중앙제어부의 해당 제어신호에 의하여 멀티미디어 신호를 출력하거나 입력하며 터치에 의한 외부의 명령신호와 선택신호와 농축산토지(제한적 농지) 임대차 정보와 특산물 거래 정보와 경작자 구인구직(예, 전문경작자 구인구직, 경작축산보조인력 구인구직) 정보를 입력하는 팜단말터치멀티입출부; 상기 팜단말중앙제어부의 해당 제어신호에 의하여 상기 디코팜서버부에 송신하는 신호를 디코팜패 킷프레임으로 암호화하고 상기 디코팜서버부으로부터 수신되는 디코팜패킷프레임 신호를 복호화하는 팜단 말패킷암복호부; 상기 팜단말중앙제어부의 해당 제어신호에 의하여 상기 공중통신망과 접속 하고 코드분할다중접속 방식으로 연결되어 통신신호를 송신과 수신하는 코드분할다중접속이동통신부; 상 기 팜단말중앙제어부의 해당 제어신호에 의하여 상기 공중통신망과 접속하고 와이파이 방식으로 연 결되어 통신신호를 송신과 수신하는 와이파이통신부; 상기 팜단말중앙제어부의 해당 제어신호에 의 하여 상기 공중통신망과 접속하고 블루투스 방식으로 연결되어 통신신호를 송신과 수신하는 블루투스통신 부; 를 포함할 수 있다. 상기 팜단말중앙제어부는 상기 디코팜서버부가 통신 상대방으로 지정되면 상기 코드분할다중접속이 동통신부와 와이파이통신부와 블루투스통신부를 동시에 각각 활성화 상태로 운용하고 상기 팜단말패킷암복호부가 암호화한 디코팜패킷프레임 신호를 상기 디코팜서버부에 전달되도록 상기 공 중통신망에 송신하며, 상기 디코팜서버부로부터 통신상대방으로 지정되고 상기 코드분할다중접속이 동통신부와 와이파이통신부와 블루투스통신부를 통하여 동시에 수신되면 각각의 수신신호세 기값(RSSI)을 분석하여 가장 큰 값으로 나오는 어느 하나를 선택하여 수신신호로 입력하도록 제어하고 감시하는 구성으로 이루어질 수 있다. 상기 디코팜서버부는 상기 디코팜서버부에 구성되는 각 기능부를 자체 내장된 운용프로그램과 운용 파라미터값에 의하여 해당 제어신호를 각각 출력하고 운용상태를 감시하는 디코팜서버집중관리부; 상기 디코팜서버집중관리부의 해당 제어신호에 의하여 상기 스마트팜단말부가 접속하고 가입하면 최신 버전의 디코팜앱을 스트리밍 방식으로 다운로드하여 제공하고 자동으로 설치되어 운용되도록 감시하는 서버디코 팜앱관리부; 상기 디코팜서버집중관리부의 해당 제어신호에 의하여 상기 농축산정보관리서버(400 0)가 수집한 농축산토지(제한적 농지) 임대차정보와 특산물 거래정보와 경작자 구인구직(예, 전문경작자 구인구 직, 경작축산보조인력 구인구직)정보를 검색하고 머신러닝 방식의 인공지능으로 분석하여 최근 1 년 이내에 생 성된 정보를 분리 추출하고 입력하는 서버인공지능운용부; 상기 디코팜서버집중관리부의 해당 제어 신호에 의하여 상기 스마트팜단말부에 송신하는 신호를 디코팜패킷프레임으로 암호화하고 상기 스마트팜 단말부로부터 수신되는 디코팜패킷프레임을 복호화하는 서버패킷암복호부; 상기 디코팜서버집중관 리부의 해당 제어신호에 의하여 상기 공중통신망과 접속하고 코드분할다중접속 방식으로 연결되어 통신신호를 송신과 수신하는 서버코드분할다중접속이동통신부; 상기 디코팜서버집중관리부의 해당 제어신호에 의하여 상기 공중통신망과 접속하고 와이파이 방식으로 연결되어 통신신호를 송신과 수신하는서버와이파이통신부; 상기 디코팜서버집중관리부의 해당 제어신호에 의하여 상기 공중통신망(200 0)과 접속하고 블루투스 방식으로 연결되어 통신신호를 송신과 수신하는 서버블루투스통신부; 상기 디코 팜서버집중관리부의 해당 제어신호에 의하여 상기 서버인공지능운용부가 분석하여 입력하는 농축산 토지(제한적 농지) 임대차 정보와 특산물 거래 정보와 경작자 구인구직(예, 전문경작자 구인구직, 경작축산보조 인력 구인구직) 정보를 해당 생성 일자 정보에 연계시켜 할당된 영역에 기록하는 농축산경작정보데이터베이스부 ; 를 포함할 수 있다. 상기 디코팜서버집중관리부는 상기 스마트팜단말부가 통신 상대방으로 지정되면 상기 서버코드분할 다중접속이동통신부와 서버와이파이통신부와 서버블루투스통신부를 동시에 각각 활성화 상태 로 운용하고 상기 서버패킷암복호부가 암호화한 디코팜패킷프레임 신호를 상기 스마트팜단말부에 전달되도록 상기 공중통신망에 송신하며, 상기 스마트팜단말부로부터 통신상대방으로 지정되고 상 기 서버코드분할다중접속이동통신부와 서버와이파이통신부와 서버블루투스통신부를 통하여 동시에 수신되면 각각의 수신신호세기값(RSSI)을 분석하여 가장 큰 값으로 나오는 어느 하나를 선택하여 수신신 호로 입력하도록 제어하고 감시하는 구성으로 이루어질 수 있다. 상기와 같은 목적을 달성하기 위하여 안출한 본 발명의 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구 직 정보 공유 플랫폼 시스템 운용방법은 스마트팜단말부와 공중통신망과 디코팜서버부와 농축산정보관리서버와 포탈사이트서버와 신문방송매체서버를 포함하는 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫폼 시스템 운용방법에 있어서, 상기 디코팜서버부에 의하여 상기 스마트팜단말부가 접속되면 최신버전 의 디코팜앱이 설치되어 운용되도록 제어하고 농축산 시작메뉴가 표시되도록 제어하고 감시하는 준비단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부가 농축산토지(제한적 농지) 임대차 메뉴를 선택한 것으로 판단되면 상기 스마트팜단말부에서 농축산토지(제한적 농지)임대차 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 임대차단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부가 특산물 정보 메뉴를 선택한 것으로 판단되면 상기 스마트팜단말부에서 특산물 직거래 정보 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 특산물 단계; 상기 디코팜서버 부에 의하여 상기 스마트팜단말부가 구인구직 메뉴를 선택한 것으로 판단되면 상기 스마트팜단말부에서 구인구 직 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 구인구직 단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부로부터 계약요청 신호를 선택 입력한 것으로 판단되면 상기 스마트팜단말부에서 계약 루틴이 운용되도록 제어하고 루틴운용 중에 입력된 정보를 수신하여 할당된 영역 에 기록 관리하는 계약 단계; 상기 디코팜서버부에 의하여 상기 스마트팜단말부로부터 경작이 완료되어 출하요 청하는 신호가 입력되는 것으로 판단되면 상기 스마트팜단말부에서 출하분배 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리하는 출하분배 단계; 를 포함할 수 있다. 상기 출하분배 단계가 완료된 후 반복 수행 요청 신호가 입력되는 것으로 판단되면 상기 준비단계로 궤환하고 반복 수행 요청 신호가 입력되지 않는 것으로 판단되면 종료로 진행하는 종료단계; 를 더 포함할 수 있다. 상기 출하분배 단계에서 상기 스마트팜단말부로부터 경작이 완료되지 않았다는 신호가 입력되는 것으로 판단되 면 경작자와 소유권자에게 각각 해당 보험을 청구하고 지급과 분배가 이루어지도록 안내하며 상기 종료단계로 진행하는 경작중단 단계; 를 더 포함할 수 있다. 상기 농축산토지(제한적 농지)임대차 루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 소유권자 정보 입력 요청신호가 입력되는 것으로 판단하면 농축산토지(제한적 농지)의 현황정보를 입력받아 등록하는 소유권정 보입력 과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 경작자 정보 입력 요청 신호가 입력되는 것으 로 판단되면 경작자의 정보를 입력받아 등록하는 경작자정보입력과정; 상기 디코팜서버부에 의하여 스마트팜단 말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 소유권정보입력 과정으로 궤환하여 반복 진 행하고 반복진행 요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 임대차반복과정; 을 포함할 수 있다. 상기 특산물 직거래 정보 루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 하나 이상 다수의 특산물선 택메뉴 표시하고 어느 하나가 선택되어 해당 특산물 정보의 입력 요청 신호가 입력되는지 판단하는 특산물선택 과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 특산물 정보의 입력 요청 신호가 입력되는 것으로 판 단되면 해당 특산물 정보를 입력하여 등록하는 특산물등록과정; 상기 디코팜서버부에 의하여 스마트팜단말부로 부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 특산물선택 과정으로 궤환하여 반복 진행하고 반복 진행요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 특산물반복과정; 을 포함할 수 있다. 상기 구인구직루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 구인정보 입력의 요청 신호가 입력되는 것으로 판단되면 경작자의 구인정보를 입력하여 등록하는 구인정보입력과정; 상기 디코팜서버부에 의하여 스마 트팜단말부로부터 구직정보 입력의 요청 신호가 입력되는 것으로 판단되면 작업자의 구직정보를 입력하여 구직 정보입력과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단 되면 상기 구인정보입력 과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단 되면 종료로 진행하는 구인구직반복과정; 을 포함할 수 있다. 상기 계약루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 계약진행의 요청 신호가 입력되는 것으로 판단되면 농축산토지(제한적 농지) 임대차 계약 또는 특산물 구매계약 또는 구인구직정보에 의한 채용계약 중 어느 하나의 계약정보를 입력하여 등록하는 계약설정과정; 상기 디코팜서버부에 의하여 스마트팜단말부에 입력 되어 등록된 계약정보를 계약의 양당사자에게 전달하고 이행보증보험, 농협생명보험의 가입을 안내하는 보험안 내과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 상기 계약설정 과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단되면 종료 로 진행하는 계약반복과정; 을 포함할 수 있다. 상기 출하분배루틴은 상기 디코팜서버부에 의하여 스마트팜단말부로부터 경작된 특산물의 출하 조건 정보를 소 유권자에게 통보하고 경작된 특산물을 출하 처리하는 특산물출하과정; 상기 디코팜서버부에 의하여 스마트팜단 말부에 입력되고 출하된 특산물의 출하대금으로부터 소요경비를 공제 처리하고 순매출 비용을 연산하여 결정하 는 순매출산정과정; 상기 디코팜서버부에 의하여 산정된 순매출에 의한 순이익 비용을 계약된 비율로 분배 처리 하는 순이익분배과정; 상기 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으 로 판단되면 상기 특산물출하과정으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판단되면 종료로 진행하는 출하분배반복과정; 을 포함할 수 있다."}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같은 구성의 본 발명은 농축산토지(제한적 농지)를 이용하여 의욕 있는 경작자에게 임대 또는 공동 또는 공유 재배 운용의 기회를 제공하고 생산된 특산물의 직거래를 활성화시켜 농촌과 어촌의 경제력 복구에 활력을 제공하는 장점이 있다. 또한, 본 발명은 농축산업의 전문 경작자 인력을 쉽게 확보하여 전문 경작자의 구인과 구직 기회를 높이고 농업, 임업, 축산업, 어업의 활성화를 촉진시키며 적은 자본으로 필요한 농축산토지(제한적 농지)를 필요한 만 큼 공유하여 농축산업에 정착을 빠르게 하며 농축산업을 통하여서도 높은 수익을 창출시키는 터전을 마련하므로 농어촌에 젊은층의 유입과 정착을 빠르게 도모하는 장점이 있다."}
{"patent_id": "10-2023-0116224", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시 예를 가질 수 있는바, 특정 실시 예들을 도면에 예시하 고 상세한 설명에서 상세하게 설명하고자 한다. 그러나 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것 이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되 어야 한다. 본 발명을 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 발명의 요지를 흐릴 수 있 다고 판단되는 경우 그 상세한 설명을 생략한다. 도 2 는 본 발명의 일 실시 예에 의한 것으로 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫폼 시스템의 기능 구성도 이고, 도 3 은 본 발명의 일 실시 예에 의한 것으로 스마트팜단말부의 상세 기능 구성도 이며, 도 4 은 본 발명의 일 실시 예에 의한 것으로 공중통신망의 상세 기능 구성도 이고, 도 5 는 본 발명의 일 실시 예에 의한 것으로 디코팜서버부의 상세 기능 구성도 이다. 이하, 첨부된 모든 도면을 참조하여 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫 폼 시스템을 상세히 설명하면 스마트팜단말부와 공중통신망과 디코팜서버부와 농축산정 보관리서버와 포탈사이트서버와 신문방송매체서버를 포함하는 구성이다. 스마트팜단말부는 다운로드되어 설치되는 디코팜앱 운용에 의하여 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매칭, 농축산토지(제한적 농지) 임대차 정보를 입력하고 임대차하며 특산물 거래 정보를 입력하 고 거래하며 경작자 구인구직 정보를 입력하고 구인구직하며 정보보호를 위하여 암호화된 디코팜패킷프레임으로 지정된 상대방과 통신한다. 디코팜앱은 본 발명에서 사용하는 앱(App) 프로그램이며 다른 앱 프로그램과 구분하기 위하여 디코팜앱으로 기 재하기로 한다. 디코팜패킷프레임은 정보 신호를 지정된 숫자 단위의 데이터로 분배하여 전송하는 구성이며, 이하에서 다시 상 세히 설명하기로 한다. 스마트팜단말부는 농축산토지(제한적 농지)를 소유하거나 특정 경작권을 보유한 소유권자용과 농축산토지 (제한적 농지)를 직접 운용하여 수익을 발생하는 경작자용과 농축산토지(제한적 농지)에서 직접 작업하는 작업 자용과 농축산토지(제한적 농지)에서 생산된 특산물을 구매하여 소비하는 소비자용을 포함하여 이루어진다. 여 기서 경작권을 수익 발생을 위하여 농특산토지를 경작할 수 있는 권리로 기재하고 설명한다. 스마트팜단말부는 팜단말중앙제어부와 디코팜앱설치운용부와 팜단말터치멀티입출부와 팜단말패킷암복호부와 코드분할다중접속이동통신부와 와이파이통신부와 블루투스통신부 를 포함하는 구성이다. 팜단말중앙제어부는 스마트팜단말부에 구비된 각 기능부에 접속하고 해당 제어신호를 각각 출력하 며 전체 구성의 운용을 내장된 운용프로그램과 파라미터와 입력되는 명령신호에 의하여 각각 제어하고 감시한다. 한편, 팜단말중앙제어부는 디코팜서버부가 통신 상대방으로 지정되면 코드분할다중접속이동통신부 와 와이파이통신부와 블루투스통신부를 동시에 각각 활성화 상태로 운용하고 팜단말패킷암복 호부가 암호화한 디코팜패킷프레임 신호를 디코팜서버부에 전달되도록 공중통신망에 송신하 며, 디코팜서버부로부터 통신상대방으로 지정되고 코드분할다중접속이동통신부와 와이파이통신부 와 블루투스통신부를 통하여 동시에 수신되면 각각의 수신신호세기값(RSSI)을 분석하여 가장 큰 값으로 나오는 어느 하나를 선택하여 수신신호로 입력하도록 제어하고 감시하는 구성이다. 디코팜앱설치운용부는 팜단말중앙제어부의 해당 제어신호에 의하여 스트리밍 방식으로 다운로드되 는 최신버전의 디코팜앱을 할당된 영역에 기록 저장하고 설치하여 운용상태로 설정한다. 팜단말터치멀티입출부는 팜단말중앙제어부의 해당 제어신호에 의하여 멀티미디어 신호를 출력하거 나 입력하며 터치에 의한 외부의 명령신호와 선택신호와 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매 칭, 농축산토지(제한적 농지) 임대차 정보와 특산물 거래 정보와 경작자 구인구직 정보를 입력한다. 팜단말패킷암복호부는 팜단말중앙제어부의 해당 제어신호에 의하여 디코팜서버부에 송신하는 신호를 디코팜패킷프레임으로 암호화하고 디코팜서버부으로부터 수신되는 디코팜패킷프레임 신호를 복호 화한다. 코드분할다중접속이동통신부는 팜단말중앙제어부의 해당 제어신호에 의하여 공중통신망과 접 속하고 코드분할다중접속 방식으로 연결되어 통신신호를 송신과 수신한다. 와이파이통신부는 팜단말중앙제어부의 해당 제어신호에 의하여 공중통신망과 접속하고 와이 파이 방식으로 연결되어 통신신호를 송신과 수신한다. 블루투스통신부는 팜단말중앙제어부의 해당 제어신호에 의하여 공중통신망과 접속하고 블루 투스 방식으로 연결되어 통신신호를 송신과 수신한다. 공중통신망은 호출측의 요청신호에 의하여 지정된 피호출측과 통신경로를 연결 설정하거나 해제 설정하는 구성이며, 코드분할다중접속무선부와 코드분할다중접속스위칭부와 와이파이무선부와 와이파 이스위칭부와 블루투스무선부와 블루투스스위칭부를 포함하는 구성이다. 코드분할다중접속무선부는 호출측 및 피호출측과 코드분할다중접속 방식으로 접속하고 통신신호를 전송한 다. 코드분할다중접속스위칭부는 코드분할다중접속무선부에 접속하고 코드분할다중접속 방식으로 접속 된 호출측의 요청에 의하여 코드분할다중접속 방식으로 피호출측과 접속하는 경로를 연결 또는 해제 설정한다. 와이파이무선부는 호출측 및 피호출측과 와이파이 방식으로 접속하고 통신신호를 전송한다. 와이파이스위칭부는 와이파이무선부에 접속하고 와이파이 방식으로 접속된 호출측의 요청에 의하여 와이파이 방식으로 피호출측과 접속하는 경로를 연결 또는 해제 설정한다. 블루투스무선부는 호출측 및 피호출측과 블루투스 방식으로 접속하고 통신신호를 전송한다. 블루투스스위칭부는 블루투스무선부에 접속하고 블루투스 방식으로 접속된 호출측의 요청에 의하여 블루투스 방식으로 피호출측과 접속하는 경로를 연결 또는 해제 설정한다. 디코팜서버부는 스마트팜단말부와 공중통신망을 경유하여 접속하고 최신버전의 디코팜앱을 다운로드로 설치 운용시키며 인공지능 머신러닝 프로그램 운용에 의하여 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매칭, 농축산토지(제한적 농지) 임대차정보와 특산물 거래정보와 경작자 구인구직정보이며 최근 1 년 이내에 생성된 것으로 분석된 정보를 각각 지정된 영역에 기록 관리하고 검색에 의하여 제공하며 정보보호 를 위하여 암호화된 디코팜패킷프레임으로 지정된 상대방과 통신한다. 디코팜서버부는 디코팜서버집중관리부와 서버디코팜앱관리부와 서버인공지능운용부와 서버패킷암복호부와 서버코드분할다중접속이동통신부와 서버와이파이통신부와 서버블루투스 통신부와 농축산경작정보데이터베이스부를 포함하는 구성이다. 디코팜서버집중관리부는 디코팜서버부에 구성되는 각 기능부를 자체 내장된 운용프로그램과 운용파 라미터값에 의하여 해당 제어신호를 각각 출력하고 운용상태를 감시한다. 디코팜서버집중관리부는 스마트팜단말부가 통신 상대방으로 지정되면 서버코드분할다중접속이동통 신부와 서버와이파이통신부와 서버블루투스통신부를 동시에 각각 활성화 상태로 운용하고 서 버패킷암복호부가 암호화한 디코팜패킷프레임 신호를 스마트팜단말부에 전달되도록 공중통신망 에 송신하며, 스마트팜단말부로부터 통신상대방으로 지정되고 서버코드분할다중접속이동통신부 와 서버와이파이통신부와 서버블루투스통신부를 통하여 동시에 수신되면 각각의 수신신호세 기값(RSSI)을 분석하여 가장 큰 값으로 나오는 어느 하나를 선택하여 수신신호로 입력하도록 제어하고 감시하는구성으로 이루어진다. 서버디코팜앱관리부는 디코팜서버집중관리부의 해당 제어신호에 의하여 스마트팜단말부가 접 속하고 가입하면 최신 버전의 디코팜앱을 스트리밍 방식으로 다운로드하여 제공하고 자동으로 설치되어 운용되 도록 감시한다. 서버인공지능운용부는 디코팜서버집중관리부의 해당 제어신호에 의하여 농축산정보관리서버 가 수집한 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매칭, 농축산토지(제한적 농지) 임대차정보와 특 산물 거래정보와 경작자 구인구직정보를 검색하고 머신러닝 방식의 인공지능으로 분석하여 최근 1 년 이내에 생 성된 정보를 분리 추출하고 입력한다. 서버패킷암복호부는 디코팜서버집중관리부의 해당 제어신호에 의하여 스마트팜단말부에 송신 하는 신호를 디코팜패킷프레임으로 암호화하고 스마트팜단말부로부터 수신되는 디코팜패킷프레임을 복호 화한다. 디코팜패킷프레임은 이하에서 상세하게 다시 설명하기로 한다. 서버코드분할다중접속이동통신부는 디코팜서버집중관리부의 해당 제어신호에 의하여 상기 공중통신 망과 접속하고 코드분할다중접속 방식으로 연결되어 통신신호를 송신과 수신한다. 서버와이파이통신부는 디코팜서버집중관리부의 해당 제어신호에 의하여 공중통신망과 접속하 고 와이파이 방식으로 연결되어 통신신호를 송신과 수신한다. 서버블루투스통신부는 디코팜서버집중관리부의 해당 제어신호에 의하여 공중통신망과 접속하 고 블루투스 방식으로 연결되어 통신신호를 송신과 수신한다. 디코팜패킷프레임은 7 개의 데이터 필드(field) 영역(area)으로 이루어지며 오버헤드(OVHD : over head) 데이터 필드 영역, 제 1 워킹데이터 필드 영역, 제 2 워킹데이터 필드 영역, 제 3 워킹데이터 필드 영역, 예비 데이터 필드 영역, 오류 체크 데이터 필드 영역, 엔드헤드(ENHD : end head) 데이터 필드 영역을 포함하는 구성이다. 디코팜패킷프레임에서의 디지털에 의한 1 워드(word)는 디지털에 의한 10 바이트(byte)로 이루어지고, 디지털에 의한 1 바이트는 디지털에 의한 10 비트(bit)로 이루어지되, 필요에 의하여 각각 구성되는 숫자를 가감할 수 있 음은 매우 당연하다. 이와 같이 구성하는 것은 부당한 제 3 자에 의한 해킹을 방지하므로 기록된 정보의 파손, 오용, 변형 등을 방지할 수 있다. 즉, 디코팜패킷프레임의 각 필드(field)를 구성하는 워드의 숫자와 각 워드를 구성하는 바이트 숫자와 각 바이 트를 구성하는 비트의 숫자를 일반적인 구성과 다르게 하는 이유는 부당한 타인이 허가 없이 해킹하여 귀중한 정보를 남용하거나 해당 정보(데이터)를 훼손하는 등의 문제가 발생되지 않도록 하는 장점이 있다. 오버헤드(OVHD) 데이터 필드 영역은 10 워드(word)로 이루어지고, 디코팜패킷프레임의 디지털 데이터 기록이 시 작하는 시작지점 위치정보, 하나의 구분된 파일(file) 단위 데이터에 의한 또는 특정 제목의 파일 단위에 의한 디코팜패킷프레임을 구성하는 다수의 패킷 단위 프레임 중 해당 순서(일련)번호, 해당 패킷 단위 프레임에 기록 된 디지털 데이터의 비트 수, 디코팜패킷프레임이 처음 발송되는 발신지 주소정보, 디코팜패킷프레임이 전송되 는 과정에서 경유하는 모든 노드(node)의 해당 경유지 주소정보, 목적지 주소정보, 재전송 여부 정보가 포함되 어 기록된다. 제 1 패킷프레임(packet frame) 데이터 필드 영역은 30 워드(word)로 이루어지고, 하나의 단위 파일로 구분되는 데이터와 작성된 일시와 작성자 정보가 연계된 상태로 기록 저장된다. 여기서 데이터는 전송할 데이터 또는 정 보를 의미하고 이하에서 동일하게 적용된다. 제 2 워킹데이터 필드 영역은 30 워드로 이루어지고, 하나의 단위 파일로 구분되는 데이터와 작성된 일시와 작 성자 정보가 연계된 상태로 각각 기록 저장되고, 제 1 워킹데이터 필드 영역에 기록된 데이터와 동일한 데이터 가 중복 기록 저장된다. 제 3 워킹데이터 필드 영역은 30 워드로 이루어지고, 활성화 운용되는 해당 프로그램의 해당 제어신호에 의하여 제 1 워킹데이터 필드 영역과 제 2 워킹데이터 필드 영역에 각각 기록된 해당 데이터의 평균값이 연산되어 기록 저장된다. 예비 데이터 필드 영역은 30 워드로 이루어지고, 항원패킷 프레임을 위하여 활성화 운용되는 해당 프로그램이 기록 저장되며 해당 제어신호에 의하여 사용되지 아니하는 일부의 영역(최대 80%의 영역)이 버퍼용 운용 메모리 영역으로 점유되어 사용되며 또한, 별도 정의되지 아니하였으나 기재할 필요가 있는 데이터 정보가 기록 저장된다. 오류 체크 데이터 필드 영역은 30 워드로 이루어지며, 활성화 운용되는 프로그램의 해당 제어신호에 의하여 현 재 위치의 주소정보를 확인하고, 오버헤드(OVHD) 데이터 필드 영역을 검색하여 발신지 주소정보를 확인하고, 엔 드헤드(ENHD) 데이터 필드 영역을 검색하여 목적지 주소정보를 확인하여 현재위치의 주소정보가 발신지 주소정 보와 동일한지 또는 목적지 주소정보와 동일한지를 판단한다. 오류 체크 데이터 필드 영역은 활성화 운용되는 프로그램의 해당 제어신호에 의하여 현재위치의 주소정보가 발 신지 주소정보와 동일하다고 판단되면 제 1 워킹데이터 필드 영역과 제 2 워킹데이터 필드 영역에 각각 기록된 데이터의 평균값을 연산하여 제 3 워킹데이터 필드 영역 에 기록한다. 한편, 오류 체크 데이터 필드 영역은 활성화 운용되는 프로그램 의 해당 제어신호에 의하여 현재위치의 주소정 보가 목적지 주소정보와 동일하다고 판단되면 제 1 워킹데이터 필드 영역과 제 2 워킹데이터 필드 영역에 각각 기록된 데이터를 잘 알려진 CRC(cyclic redundancy check) 체크 방식과 해밍코드(hamming code) 처리방식으로 오류를 체크하며 발생되어 체크된 오류를 복구하고 즉, 전송오류가 발생된 경우 전송오류를 복구한 후, 해당 각 필드의 최종 데이터와 제 3 워킹데이터 필드 영역 에 기록된 데이터를 각각 비교하여 동일하지 않는 경우 엔드 헤드(ENHD : end head) 데이퍼 필드 영역에 재전송 요청하도록 하는 신호(정보)가 기록되도록 요청한다. 엔드헤드(ENHD : end head) 데이퍼 필드 영역은 10 워드로 이루어지며, 디코팜패킷프레임의 전체 데이터 기록이 종료되는 종료지점 위치정보, 파일 단위를 구성하는 전체 디코팜패킷프레임의 다수 단위 프레임 중 해당 순서 (일련)번호가 오버헤드(OVHD)와 동일하게 기록되고. 각 발송지와 경유지와 목적지에 출발과 도착한 해당 시간 정보, 오류 체크 데이터 필드 영역의 활성화 운용되는 프로그램의 해당 제어신호에 의하여 재전송 요청 여부 신 호(정보)가 포함되어 기록된다. 농축산경작정보데이터베이스부는 디코팜서버집중관리부의 해당 제어신호에 의하여 서버인공지능운 용부가 분석하여 입력하는 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매칭, 농축산토지(제한적 농지) 임대차 정보와 특산물 거래 정보와 경작자 구인구직 정보를 해당 생성 일자 정보에 연계시켜 할당된 영역 에 기록한다. 농축산정보관리서버는 디코팜서버부와 공중통신망을 경유하여 접속하고 포탈사이트서버 와 신문방송통신매체서버로부터 공개된 빅데이터 정보로부터 생산성을 극대화 하기 위한 자경자와 전문 경작인의 매칭, 농축산토지(제한적 농지) 임대차 정보와 특산물 거래 정보와 경작자 구인구직정보를 인공 지능 머신러닝 프로그램 운용에 의하여 주기적으로 수집 저장하고 제공한다. 포탈사이트서버는 농축산정보관리서버에 공중통신망을 경유하여 접속하고 인터넷을 통하여 공개된 빅데이터 정보를 멀티미디어 신호로 기록 관리하고 검색에 의하여 제공한다. 신문방송매체서버는 농축산정보관리서버에 공중통신망을 경유하여 접속하고 신문과 방송을 통하여 공개된 빅데이터 정보를 멀티미디어 신호로 기록 관리하고 검색에 의하여 제공한다. 도 6 은 본 발명의 일 실시 예에 의한 것으로 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫폼 시스템 운용방법의 순서도 이고, 도 7 은 본 발명의 일 실시 예에 의한 것으로 농축산토지(제한적 농지)임대차루틴의 상세 순서도 이며, 도 8 은 본 발명의 일 실시 예에 의한 것으로 특산물거래정보루틴의 상세 순서도 이고, 도 9 는 본 발명의 일 실시 예에 의한 것으로 구인구직루틴의 상세 순서도 이며, 도 10 은 본 발 명의 일 실시 예에 의한 것으로 계약루틴의 상세 순서도 이고, 도 11 은 본 발명의 일 실시 예에 의한 것으로 출하배분루틴의 상세 순서도 이며, 도 12 는 본 발명의 일 실시 예에 의한 것으로 생산된 농특산토지의 정보를 입력하는 윈도우 이고. 도 13 은 본 발명의 일 실시 예에 의한 것으로 생산된 특산물의 정보를 입력하는 윈도우 이며, 도 14 는 본 발명의 일 실시 예에 의한 것으로 생산된 계약 정보를 입력하는 윈도우 이고. 도 15 는 본 발명의 일 실시 예에 의한 것으로 구인구직 정보를 입력하는 윈도우 이다. 이하, 첨부된 모든 도면을 참조하여 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫 폼 시스템 운용방법을 상세히 설명하면 스마트팜단말부와 공중통신망과 디코팜서버부와 농축산정보관리서버와 포탈사이트서버와 신문방송매체서버를 포함하는 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫폼 시스템 운용방법에 있어서 준비단계와 임대차단계와 특산물 단계와 구인구직 단계와 계약 단계와 출하분배 단계와 경작중단 단계와 종료단계를 포함하는 구성이다. 준비단계는 디코팜서버부에 의하여 상기 스마트팜단말부가 접속되면 최신버전의 디코팜앱이 설치되어 운용되도 록 제어하고 농축산 시작메뉴가 표시되도록 제어하고 감시한다(S110). 임대차단계는 디코팜서버부에 의하여 스마트팜단말부가 농축산토지(제한적 농지) 임대차 메뉴를 선택한 것으로 판단되면(S120), 스마트팜단말부에서 농축산토지(제한적 농지)임대차 루틴이 운용되도록 제어하고 루틴 운용 중 에 입력된 정보를 수신하여 할당된 영역에 기록 관리한다(S130). 농축산토지(제한적 농지)임대차 루틴은 소유권정보입력 과정과 경작자정보입력과정과 임대차반복과정을 포함한 다. 농축산토지(제한적 농지)임대차 루틴은 첨부된 도 12 에 일 실시례로 도시되어 있다. 소유권정보입력 과정은 디코팜서버부에 의하여 스마트팜단말부로부터 소유권자 정보 입력 요청신호가 입력되는 것으로 판단하면(ST11), 농축산토지(제한적 농지)의 현황정보를 입력받아 등록한다(ST12). 경작자정보입력과정은 디코팜서버부에 의하여 스마트팜단말부로부터 경작자 정보 입력 요청 신호가 입력되는 것으로 판단되면(ST13) 경작자의 정보를 입력받아 등록한다(ST14). 임대차반복과정은 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되 면(ST15), 소유권정보입력 과정(ST11)으로 궤환하여 반복 진행하고 반복진행 요청신호가 입력되는 아니하는 것으로 판단되면(ST15) 종료로 진행한다. 특산물 단계는 디코팜서버부에 의하여 스마트팜단말부가 특산물 정보 메뉴를 선택한 것으로 판단되면(S140), 스 마트팜단말부에서 특산물 직거래 정보 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할 당된 영역에 기록 관리한다(S150). 특산물 직거래 정보 루틴은 특산물선택과정과 특산물등록과정과 특산물반복과정을 포함한다. 특산물 직거래 정 보 루틴은 일 실시 예에 의한 것으로 첨부된 도 13에 잘 도시되어 있다. 특산물선택과정은 디코팜서버부에 의하여 스마트팜단말부로부터 하나 이상 다수의 특산물선택메뉴 표시하고 (ST21), 어느 하나가 선택되어 해당 특산물 정보의 입력 요청 신호가 입력되는지 판단한다(ST22). 특산물선택메뉴에는 일 실시 예에 의한 것으로, 첨부된 도 13 에 도시된 것과 같이 벼, 배추, 보리 등이 포함될 수 있으며, 모든 농작물이 포함되므로 더 이상 구체적인 설명을 생략하기로 한다. 특산물등록과정은 디코팜서버부에 의하여 스마트팜단말부로부터 특산물 정보의 입력 요청 신호가 입력되는 것으 로 판단되면(ST23), 해당 특산물 정보를 입력하여 등록한다(ST23). 특산물반복과정은 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되 면(S24), 특산물선택 과정(ST21)으로 궤환하여 반복 진행하고 반복진행요청신호가 입력되는 아니하는 것으로 판 단되면(ST24) 종료로 진행한다. 구인구직 단계는 디코팜서버부에 의하여 스마트팜단말부가 구인구직 메뉴를 선택한 것으로 판단되면(S160) 스마 트팜단말부에서 구인구직 루틴이 운용되도록 제어하고 루틴 운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리한다(S170). 구인구직 루틴은 첨부된 도 15에 일실시 예로 잘 도시되어 있다. 구인구직 루틴은 구인정보입력과정과 구직정보입력과정과 구인구직반복과정을 포함한다. 구인정보입력과정은 디코팜서버부에 의하여 스마트팜단말부로부터 구인정보 입력의 요청 신호가 입력되는 것으 로 판단되면(ST31), 경작자의 구인정보를 입력하여 등록한다(ST32). 구직정보입력과정은 디코팜서버부에 의하여 스마트팜단말부로부터 구직정보 입력의 요청 신호가 입력되는 것으 로 판단되면(ST33), 작업자의 구직정보를 입력하여 등록한다(ST34). 구인구직반복과정은 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단 되면(ST35), 구인정보입력 과정으로(ST31) 궤환하여 반복 진행하고, 반복진행요청신호가 입력되는 아니하는 것으로 판단되면(ST35) 종료로 진행한다. 계약 단계는 디코팜서버부에 의하여 스마트팜단말부로부터 계약요청 신호를 선택 입력한 것으로 판단되면 (S180), 스마트팜단말부에서 계약 루틴이 운용되도록 제어하고 루틴운용 중에 입력된 정보를 수신하여 할당된 영역에 기록 관리한다(S190). 계약 루틴은 첨부된 도 14 에 일실시 예로 잘 도시되어 있다. 계약 루틴은 계약설정과정과 보험안내과정과 계약반복과정을 포함한다. 계약설정과정은 디코팜서버부에 의하여 스마트팜단말부로부터 계약진행의 요청 신호가 입력되는 것으로 판단되 면(ST41), 농축산토지(제한적 농지) 임대차 계약 또는 특산물 구매계약 또는 구인구직정보에 의한 채용계약 중 어느 하나의 계약정보를 입력하여 등록한다(ST42). 보험안내과정은 디코팜서버부에 의하여 스마트팜단말부에 입력되어 등록된 계약정보를 계약의 양당사자에게 전 달하고(ST43), 각자 필요한 이행보증보험, 농협생명보험에 가입하도록 안내한다(ST44). 이러한 보험의 가입은 계약이 정상적으로 이루어지지 아니하였을 상황에 양당사자의 정당한 수입(수익)을 보장하기 위함이다. 계약반복과정은 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단되면 (ST45), 계약설정 과정(ST41)으로 궤환하여 반복 진행하고, 반복진행요청신호가 입력되는 아니하는 것으로 판단 되면(ST45), 종료로 진행한다. 출하분배 단계는 디코팜서버부에 의하여 스마트팜단말부로부터 경작이 완료되고(S200), 출하요청하는 신호가 입 력되는 것으로 판단되면(S220), 스마트팜단말부에서 출하분배 루틴이 운용되도록 제어하고 루틴운용 중에 입력 된 정보를 수신하여 할당된 영역에 기록 관리한다(S230). 출하분배루틴은 특산물출하과정과 순매출산정과정과 순이익분배과정과 출하분배반복과정을 포함한다. 특산물출하과정은 디코팜서버부에 의하여 스마트팜단말부로부터 경작된 특산물의 출하 조건 정보를 소유권자에 게 통보하고 경작된 특산물을 출하 처리한다(ST51). 순매출산정과정은 디코팜서버부에 의하여 스마트팜단말부에 입력되고 출하된 특산물의 출하대금으로부터 소요경 비를 공제 처리하고 순매출 비용을 연산하여 산정하므로 결정한다(ST52). 순이익분배과정은 디코팜서버부에 의하여 산정된 순매출에 의한 순이익 비용을 계약된 비율로 분배 처리한다 (ST53). 출하분배반복과정은 디코팜서버부에 의하여 스마트팜단말부로부터 반복진행의 요청신호가 입력되는 것으로 판단 되면(ST54), 특산물출하과정(ST51)으로 궤환하여 반복 진행하고, 반복진행요청신호가 입력되는 아니하는 것으로 판단되면(ST54), 종료로 진행한다. 경작중단 단계는 출하분배 단계에서 스마트팜단말부로부터 경작이 완료되지 않았다는 신호가 입력되는 것으로 판단되면(S200), 경작자와 소유권자에게 각각 해당 보험을 청구하고 지급과 분배가 이루어지도록 안내하며 (S210) 종료단계로 진행한다. 종료단계는 출하분배 단계가 완료된 후 반복 수행 요청 신호가 입력되는 것으로 판단되면(S240) 준비단계(S11 0)로 궤환하고 반복 수행 요청 신호가 입력되지 않는 것으로 판단되면(S240) 종료로 진행한다. 이러한 구성의 본 발명은 토지주인이 경작을 하기 위해, 경작의 능력이 풍부한 경작할 사람을 찾는 프로세스이 고, 경작의 능력이 풍부한 경작할 사람이 경작자의 위치과 능력을 리스트업해서, 상호간에 매칭이 되는 프로세 스이다. 또한, 경작후 출하시 농산물판매금액은 자경자에게 입금이 되며, 이에 대한 전문경작자에 대한 보상은 별도의 이행보증보험 등을 이용하여 안전성을 확보할 수 있어, 전문 경작자에게 충분한 보상을 하는 프로세스이 며, 농산물과 연관된 보험(농협생명보험)등 외부 보험 프로세스를 이용함으로써, 자경자와 전문 경작자 모두에 게 안전한 프로세스를 제공하는 효과가 있다. 예를 들어, 자경자 및 전문 경작자 모두에 대하여 천재지변, 자연 재해등이 발생하는 경우, 외부 보험 프로세스를 통하여, 양쪽 모두에게 별도의 의무나 책임에 대한 부담을 경감 시킴으로써, 이익을 위하여 상호 공유경작에 노력하도록 만드는 효과가 있다. 즉, 농지법에 일체 문제가 되지 않는 선에서, 자경자인 토지소유주가 전문 경작자를 찾고, 경작자도 공유 경작 할 토지 혹은 공유 경작할 토지 소유주를 찾고, 토지 소유주인 경작자도 함께 경작할 능력이 훌륭한 경작자를찾는다. 일 실시례로, 농가인력-전문경작자 찾기는 1)토지소유주가 작물에 대한 전문적 경작자를 찾는 컨텐츠 또는 경작 지를 임대한 권리자가 작물에 대한 전문적 경작자를 찾는 컨텐츠이고, 2)전문 경작자가 같이 경작할 지주 또는 경작지의 권리를 갖고 있는 자를 찾아 소득활동을 하는 컨텐츠이다. 그리고 축산농가-가축투자자 찾기는 1)축사를 갖고 있는 자 또는 축사를 임대한 자가 본인의 자본 외 가축 투자 를 할 사람을 찾는 컨텐츠이고, 2)가축 투자를 할 사람이 축사를 갖고 있는 자 또는 축사를 임대한 자를 찾는 컨텐츠이다. 또한, 농지임대 또는 경작지임대는 농지임대 또는 경작지임대의 메뉴를 운영함으로써, 전문경작자 찾기가 농지 임대와의 구분을 대외적으로 나타낼수 있다. 그러나 국가기간을 통한 농지임대를 제외한 농지임대의 경우의 수 와 볼륨이 크지 않을 수도 있다. 한편, 농지임대외 경작지 임대를 통해, 농지 이외에 산, 임, 목장지, 잡종지, 나대지 등을 임대할수 있도록 하여, 농업, 임업(임/산임), 축산업, 수산업 분야에서의 경작지 활용 기능이 더 부여될수 있다. 상기 구성은 제한된 농축산토지(제한적 농지)를 이용하여 의욕 있는 경작자에게 임대 또는 공동 또는 공유 재배 운용의 기회를 제공하고 생산된 특산물의 직거래를 활성화시켜 농촌과 어촌의 경제력 복구에 활력을 제공하며, 또한, 농축산업의 전문 경작자 인력을 쉽게 확보하여 전문 경작자의 구인과 구직 기회를 높이고 농업, 임업, 축 산업, 어업의 활성화를 촉진시키며 적은 자본으로 필요한 농축산토지(제한적 농지)를 필요한 만큼 공유하여 농 축산업에 정착을 빠르게 하며 농축산업을 통하여서도 높은 수익을 창출시키는 터전을 마련하므로 농어촌에 젊은 층의 유입과 정착을 빠르게 도모하는 장점이 있다. 이상에서 본 발명은 기재된 구체 예에 대해서 상세히 설명하였지만 본 발명의 기술사상 범위 내에서 다양한 변 형 및 수정이 가능함은 당업자에게 있어서 명백한 것이며, 이러한 변형 및 수정이 첨부된 특허청구범위에 속함 은 당연한 것이다."}
{"patent_id": "10-2023-0116224", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 은 종래기술의 일 실시 예에 의한 것으로 부동산 임대차 거래 서비스 플랫폼 시스템의 기능 구성도, 도 2 는 본 발명의 일 실시 예에 의한 ---의 기능 구성 설명도, 도 2 는 본 발명의 일 실시 예에 의한 것으로 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫폼 시스템의 기능 구성도, 도 3 은 본 발명의 일 실시 예에 의한 것으로 스마트팜단말부의 상세 기능 구성도, 도 4 은 본 발명의 일 실시 예에 의한 것으로 공중통신망의 상세 기능 구성도, 도 5 는 본 발명의 일 실시 예에 의한 것으로 디코팜서버부의 상세 기능 구성도, 도 6 은 본 발명의 일 실시 예에 의한 것으로 농축산용 부동산 임대차와 특산물 거래와 경작자 구인구직 정보 공유 플랫폼 시스템 운용방법의 순서도, 도 7 은 본 발명의 일 실시 예에 의한 것으로 농축산토지(제한적 농지)임대차루틴의 상세 순서도, 도 8 은 본 발명의 일 실시 예에 의한 것으로 특산물거래정보루틴의 상세 순서도, 도 9 는 본 발명의 일 실시 예에 의한 것으로 구인구직루틴의 상세 순서도, 도 10 은 본 발명의 일 실시 예에 의한 것으로 계약루틴의 상세 순서도, 도 11 은 본 발명의 일 실시 예에 의한 것으로 출하배분루틴의 상세 순서도, 도 12 는 본 발명의 일 실시 예에 의한 것으로 생산된 농특산토지의 정보를 입력하는 윈도우. 도 13 은 본 발명의 일 실시 예에 의한 것으로 생산된 특산물의 정보를 입력하는 윈도우, 도 14 는 본 발명의 일 실시 예에 의한 것으로 생산된 계약 정보를 입력하는 윈도우. 그리고 도 15 는 본 발명의 일 실시 예에 의한 것으로 구인구직 정보를 입력하는 윈도우 이다."}
