{"patent_id": "10-2019-0164897", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0074009", "출원번호": "10-2019-0164897", "발명의 명칭": "사용자 단말기를 수용하는 로봇", "출원인": "한국기술교육대학교 산학협력단", "발명자": "서성진"}}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 단말기를 수용하는 로봇으로서,로봇의 외관을 형성하는 본체; 상기 본체 내에 배치되어 사용자 단말기를 지지하도록 구성된 거치부;상기 사용자 단말기와 통신하도록 구성되는 통신 인터페이스;상기 본체 하부에 배치되는 이동 수단; 상기 본체 내에 배치되는 상기 사용자 단말기를 충전하도록 배치되는 무선 충전 패드; 및상기 통신 인터페이스를 통해 상기 사용자 단말기와 통신하여 상기 로봇의 동작을 제어하는 프로세서를 포함하는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 본체는 상부, 중간부 및 하부를 포함하고,상기 상부는 상기 중간부의 윗 부분에 탈착가능하도록 결합되는 분리형 커버로서, 상기 사용자 단말기가 투입되는 개구부를 포함하는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 중간부는 상기 사용자 단말기가 상기 본체 내에 배치되었을 때, 상기 사용자 단말기의 디스플레이의 적어도 일부가 노출되도록 형성된 윈도우; 및상기 로봇의 정면을 향하도록 배치되는 제 1 적외선 센서를 포함하고,상기 프로세서는, 상기 제 1 적외선 센서가 감지하는 장애물까지의 거리를 일정 거리만큼 유지하기 위해 상기이동 수단을 제어하도록 구성되는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 하부는 상기 중간부의 아래 부분에 결합되며, 상기 하부는 제 2 적외선 센서를 포함하고,상기 제 2 적외선 센서는 바닥을 향하도록 배치되며,상기 프로세서는, 상기 제 2 적외선 센서로부터 측정된 바닥까지의 거리가 미리 정해진 거리 이상이 되면 상기이동 수단을 정지시키거나, 상기 이동 수단이 진행하던 방향으로부터 반대 방향으로 상기 이동 수단을 제어하도공개특허 10-2021-0074009-3-록 추가로 구성되는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 3 항에 있어서,상기 중간부는 상기 윈도우와 반대되는 방향에 방열부를 가지는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 4 항에 있어서,상기 본체는 원통형이고,상기 본체의 하부에는 적어도 4개의 제 2 적외선 센서들이 배치되고,상기 제 2 적외선 센서들은 상기 본체의 하부의 중심으로부터 동일한 거리에 위치하며, 직교하는 네 방향에 배치되는, 로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 거치부는, 초기 상태인 제 1 상태에서 눌러지면 눌러진 상태인 제 2 상태로 고정되고, 상기 제 2 상태에서눌러지면 상기 제 1 상태로 복귀하도록 구성되고,상기 프로세서는, 상기 거치부가 상기 제 1 상태에서 상기 제 2 상태로 변화하는 경우 상기 로봇의 전원이 켜지도록 추가로 구성되는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 프로세서는, 상기 거치부가 상기 제 1 상태에서 상기 제 2 상태로 변화하는 경우 상기 통신 인터페이스를통해 상기 본체 내에 배치되는 사용자 단말기로 로봇 모드 개시 신호를 송신하도록 추가로 구성되고,상기 로봇 모드 개시 신호는 상기 사용자 단말기로 하여금 상기 윈도우로 노출되는 상기 디스플레이 부분에 로봇의 얼굴 형상을 표시하도록 제어하는 신호를 포함하는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 7 항에 있어서,상기 프로세서는, 상기 거치부가 상기 제 1 상태에서 상기 제 2 상태로 변화하는 경우 상기 통신 인터페이스를통해 상기 본체 내에 배치되는 사용자 단말기와 통신 연결을 시도하도록 추가로 구성되는,공개특허 10-2021-0074009-4-로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 본체 내에 배치되고, 상기 무선 충전 패드에 전원을 공급하는 보조 전원을 포함하는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 3 항에 있어서,상기 거치부가 결합되고, 상기 거치부를 홀딩하도록 구성되는 결합부를 더 포함하고,상기 결합부는 상기 본체의 하부와 회전가능하게 결합되며,상기 본체의 하부에는 상기 결합부를 회전시키기 위한 회전부가 배치되고,상기 프로세서는, 상기 사용자 단말기로부터 촬영 지시를 수신하는 경우, 상기 사용자 단말기의 후면 카메라가상기 윈도우를 통해 노출될 수 있게 상기 결합부를 회전시키도록 추가로 구성되는,로봇."}
{"patent_id": "10-2019-0164897", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "로봇으로서,로봇 내부에 사용자 단말기를 수용할 수 있는 거치부;수용된 사용자 단말기의 디스플레이의 적어도 일부가 외부로 노출되기 위한 윈도우; 및수용된 사용자 단말기와 통신하여 스마트 토이의 동작을 제어하는 프로세서를 포함하고,상기 프로세서는, 사용자 단말기와 연결되면, 사용자 단말기로 로봇 모드 개시 신호를 전송하도록 구성되며,상기 로봇 모드 개시 신호는 상기 윈도우를 통해 노출되는 디스플레이 부분에 로봇의 얼굴 형상을 표시하도록제어하는 신호를 포함하는,로봇."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 사용자 단말기를 수용하는 로봇으로서, 본 개시의 일 실시예에 따른 로봇은, 로봇의 외관을 형성하는 본체, 본체 내에 배치되어 사용자 단말기를 지지하도록 구성된 거치부, 사용자 단말기와 통신하도록 구성되는 통 신 인터페이스, 본체 하부에 배치되는 이동 수단, 본체 내에 배치되는 사용자 단말기를 충전하도록 배치되는 무 선 충전 패드, 및 통신 인터페이스를 통해 사용자 단말기와 통신하여 상기 로봇의 동작을 제어하는 프로세서를 포함할 수 있다."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 사용자 단말기를 수용하는 로봇에 관한 것으로, 내부에 수용되는 사용자 단말기의 디스플레이 일부가 노출되도록 하고, 사용자 단말기와의 통신을 통해 제어될 수 있는 로봇에 관한 것이다."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 4차 산업혁명의 물결을 타고 기초적인 코딩을 배운 뒤 직접 입력하여 작동시키는 로봇들이 교육용으로 개 발되고 독자적인 인공지능을 탑재한 스마트 토이들이 출시되기 시작했다. 이에 따라, 세계 스마트 토이 시장 규모는 2016년 37억 유로 규모 수준에서 2년이 지난 2018년에는 무려 74억 규모까지 커졌다. 하지만, 시장이 커진 것에 비해 이들의 문제는 분명하다. 기초적인 동작 구현 단계에서 머물거나 또는 개발사 에서 만든 독자적인 인공지능 서비스를 탑재함으로서 S/W 의 주기적인 업데이트가 느리거나, 제공되는 핵심 기 능이 적어 사용을 하는데 한계가 있었다. 또한, 현재 시중에서 판매되고 있는 스마트토이의 가격은 적게는 10만원부터 많게는 50만원까지 높게 형성되어 있어 일반 소비자가 접하기엔 다소 부담스러운 가격대를 이루고 있는 것도 사실이다. 한편 똑같은 형태나 디자인을 계속 보다 보면 쉽게 질리고 피로감을 느끼는 경우가 있는데 비싸게 구입 해서 잠 깐 사용하다 마는 경우가 생기게 된다. 그래서, 부담스러운 가격대와 기능상의 한계가 있는 스마트 토이를 별 도로 구매해야 하는가에 대한 생각을 다시 한 번 해보게 된다. 이에 따라, 사용자 커스터마이즈가 용이하면서 보편적인 사용자들이 활용할 수 있는 로봇에 대한 필요가 존재한 다. 한편, 전술한 선행기술은 발명자가 본 발명의 도출을 위해 보유하고 있었거나, 본 발명의 도출 과정에서 습득한 기술 정보로서, 반드시 본 발명의 출원 전에 일반 공중에게 공개된 공지기술이라 할 수는 없다."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 실시예는 종래 기술의 스마트 토이들이 자체적인 인공지능 시스템, 동작 프로그램 및 통신 모듈을 구 비해야 함으로 인해 제작비용이 많이 들고, 이에 따라 고가의 가격을 형성하게 되는 문제점을 해결하기 위한 것 이다. 또한, 본 개시의 실시예는 종래 기술의 스마트 토이들이 제작된 형태에서 변경이 어려우며, 변경을 위해서는 상 당한 노력과 비용이 들어가야하는 문제점을 해결하기 위한 것이다. 또한, 본 개시의 실시예는 종래 기술의 스마트 토이들은 고정된 형태를 가지고 사용자 커스터마이즈가 어려운 문제점을 해결하기 위한 것이다."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇은, 대부분의 사용자들이 이미 소유하고 있는 스마트폰 과 같은 사용자 단말기를 이용할 수 있는 로봇을 제공할 수 있다. 또한, 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇은, 로봇의 외관을 형성하는 본체, 본체 내에 배 치되어 사용자 단말기를 지지하도록 구성된 거치부, 사용자 단말기와 통신하도록 구성되는 통신 인터페이스, 본 체 하부에 배치되는 이동 수단, 본체 내에 배치되는 사용자 단말기를 충전하도록 배치되는 무선 충전 패드, 및 통신 인터페이스를 통해 사용자 단말기와 통신하여 로봇의 동작을 제어하는 프로세서를 포함할 수 있다. 여기서, 본체는 상부, 중간부 및 하부를 포함하고, 상부는 중간부의 윗 부분에 탈착가능하도록 결합되는 분리형 커버로서, 사용자 단말기가 투입되는 개구부를 포함할 수 있다. 중간부는 사용자 단말기가 본체 내에 배치되었을 때, 사용자 단말기의 디스플레이의 적어도 일부가 노출되도록 형성된 윈도우, 및 로봇의 정면을 향하도록 배치되는 제 1 적외선 센서를 포함할 수 있다. 여기서, 프로세서는, 제 1 적외선 센서가 감지하는 장애물까지의 거리를 일정 거리만큼 유지하기 위해 상기 이 동 수단을 제어하도록 구성될 수 있다. 하부는 중간부의 아래 부분에 결합되며, 하부는 제 2 적외선 센서를 포함하고, 제 2 적외선 센서는 바닥을 향하 도록 배치될 수 있다. 또한, 프로세서는, 제 2 적외선 센서로부터 측정된 바닥까지의 거리가 미리 정해진 거리 이상이 되면 이동 수단 을 정지시키거나, 이동 수단이 진행하던 방향으로부터 반대 방향으로 이동 수단을 제어하도록 추가로 구성될 수 있다. 또한, 중간부는 상기 윈도우와 반대되는 방향에 방열부를 가질 수 있다. 또한, 본 발명의 실시예에 따른 로봇의 본체는 원통형이고, 본체의 하부에는 적어도 4개의 제 2 적외선 센서들 이 배치되고, 제 2 적외선 센서들은 본체의 하부의 중심으로부터 동일한 거리에 위치하며, 직교하는 네 방향에 배치될 수 있다. 또한, 거치부는, 초기 상태인 제 1 상태에서 눌러지면 눌러진 상태인 제 2 상태로 고정되고, 상기 제 2 상태에 서 눌러지면 상기 제 1 상태로 복귀하도록 구성될 수 있다. 여기서, 프로세서는, 거치부가 제 1 상태에서 제 2 상태로 변화하는 경우 로봇의 전원이 켜지도록 추가로 구성 될 수 있다. 또한, 프로세서는, 거치부가 제 1 상태에서 제 2 상태로 변화하는 경우 통신 인터페이스를 통해 본체 내에 배치 되는 사용자 단말기로 로봇 모드 개시 신호를 송신하도록 추가로 구성될 수 있다. 여기서, 로봇 모드 개시 신호는 사용자 단말기로 하여금 윈도우로 노출되는 디스플레이 부분에 로봇의 얼굴 형 상을 표시하도록 제어하는 신호를 포함할 수 있다. 또한, 프로세서는, 거치부가 제 1 상태에서 제 2 상태로 변화하는 경우 통신 인터페이스를 통해 본체 내에 배치 되는 사용자 단말기와 통신 연결을 시도하도록 추가로 구성될 수 있다. 본 개시의 실시예에 따른 로봇은 로봇의 본체 내에 배치되고, 무선 충전 패드에 전원을 공급하는 보조 전원을 포함할 수 있다. 전술한 것 외의 다른 측면, 특징, 이점이 이하의 도면, 특허청구범위 및 발명의 상세한 설명으로부터 명확해질 것이다."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 실시예에 따른 로봇은 충분한 연산 능력과 데이터 저장 능력 및 인터넷 통신 능력을 가지고 있으며, 대부분의 사용자가 가지고 있는 스마트폰과 같은 사용자 단말기를 이용할 수 있도록 함으로써, 로봇 자체의 가 격을 낮추면서도 다양한 기능을 제공할 수 있다. 또한, 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇은 자체적인 인공지능 시스템, 동작 프로그램 및 인터넷 통신 모듈을 구비할 필요가 없으면서도 기존에 존재하는 사용자 단말기를 이용함으로써 보다 효율적이고 효과적인 스마트 로봇의 기능을 제공할 수 있다. 또한, 본 개시의 실시예애 따른 사용자 단말기를 수용하는 로봇은 사용자 개인에게 맞도록 이미 설정된 사용자 단말기를 이용함으로써, 사용자 개인에게 맞춰진 스마트 로봇을 제공할 수 있다. 또한, 본 개시의 실시예애 따른 사용자 단말기를 수용하는 로봇은 각 부품을 모듈화시켜서 사용자가 제품을 커 스터마이징하게 할 수 있다. 또한, 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇은 스마트폰과 같은 사용자 단말기를 제품에 결 합 및 연동할 수 있도록 함으로써 음성인식 기능을 통해 제품을 조종할 수 있게 한다. 본 개시의 효과는 이상에서 언급된 것들에 한정되지 않으며, 언급되지 아니한 다른 효과들은 아래의 기재로부터 당업자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 설명되는 실시 예들 을 참조하면 명확해질 것이다. 그러나 본 개시는 아래에서 제시되는 실시 예들로 한정되는 것이 아니라, 서로 다른 다양한 형태로 구현될 수 있고, 본 개시의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물 을 포함하는 것으로 이해되어야 한다. 아래에 제시되는 실시 예들은 본 개시의 개시가 완전하도록 하며, 본 개"}
{"patent_id": "10-2019-0164897", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "시가 속하는 기술분야에서 통상의 지식을 가진 자에게 발명의 범주를 완전하게 알려주기 위해 제공되는 것이다. 본 개시를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 흐릴 수 있다고 판단되 는 경우 그 상세한 설명을 생략한다. 본 출원에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 본 개시를 한정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포 함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 제1, 제2 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 구성요소들은 상기 용어들에 의해 한정되 어서는 안 된다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 이하, 본 개시에 따른 실시 예들을 첨부된 도면을 참조하여 상세히 설명하기로 하며, 첨부 도면을 참조하여 설 명함에 있어, 동일하거나 대응하는 구성 요소는 동일한 도면번호를 부여하고 이에 대한 중복되는 설명은 생략하 기로 한다. 도 1은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 사용예를 도시한다. 사용자는 사용자 단말기를 로봇에 결합시킬 수 있다. 사용자 단말기가 로봇에 결합 되면, 사용자 단말기의 프로세서는 로봇의 프로세서처럼 기능할 수 있고, 사용자 단말기의 통신 능력도 로봇의 통신 능력으로 활용될 수 있다. 로봇 자체적으로는 복잡한 정보 처리를 수행할 수 있는 부품들이 구비되어 있지 않지만, 사용자 단말기 가 결합되면 복잡한 정보 처리도 가능하게 될 수 있다. 아울러, 로봇 자체에는 카메라, 마이크, 디스플레이가 구비되어 있지 않지만, 사용자 단말기에 구비 된 카메라, 마이크, 디스플레이를 통한 기능들을 사용자 단말기가 결합된 로봇이 수행할 수 있게 된 다. 또한, 사용자 단말기는 사용자가 지속적으로 사용하면서 개인 설정 및 개인 정보들을 저장하게 되므 로, 로봇이 사용자의 개인 설정 및 개인 정보에 맞추어 움직일 수 있게 된다.스마트폰과 같은 사용자 단말기와 결합할 수 있는 로봇은 일종의 스마트 토이로도 활용될 수 있고, 개인 비서 로봇, 산업용 로봇 등으로 활용될 수 있다. 스마트폰이 결합된 로봇은 스마트폰과 연동하고 스마트 폰이 가지고 있는 음성인식 기반 서비스를 통해 다양한 기능을 수행하는 장치로 동작할 수 있다. 이하에서는, 이러한 로봇의 구성에 대해 보다 상세히 살펴보기로 한다. 도 2는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 분해도를 도시한다. 사용자 단말기를 수용하는 로봇은 외관을 형성하는 본체(101, 110, 130)와 본체 내에 배치되어 사용 자 단말기를 지지하도록 구성된 거치부(121, 129), 사용자 단말기를 충전하도록 배치되는 무선 충전 패드를 포함할 수 있다. 도 2에서 로봇 자체의 간단한 제어를 가능하게 하는 프로세서와 전자 회로, 사용자 단말기와의 통신 을 위한 통신 인터페이스는 도시되지 않았으나, 이러한 부품들은 본체 내의 임의의 곳에 배치될 수 있음은 자명 하게 이해될 수 있다. 로봇의 본체는 상부, 중간부, 및 하부를 포함할 수 있고, 상부는 중간부의 윗 부분에 탈착가능하도록 결합될 수 있는 분리형 커버일 수 있다. 상부는 상면에 관통하는 개구부를 가지고 있어, 스마트 폰과 같은 사용자 단말기과 통과하여 본체 내 로 투입될 수 있도록 한다. 중간부는 사용자 단말기가 본체 내에 배치되었을 때, 사용자 단말기의 디스플레이가 적어도 일 부라도 노출되도록 형성된 윈도우를 가질 수 있다. 윈도우는 중간부에 형성된 개구부를 통해 구현될 수 있고, 개구부에는 유리베젤, 유리베젤에 결 합되는 전면유리, 유리베젤에 결합되며 전면유리를 고정하는 베젤링이 배치될 수 있다. 사용자 단말기가 로봇에 결합되면, 윈도우를 통해 사용자 단말기의 디스플레이의 적어도 일부가 노출될 수 있고, 이러한 윈도우 부분에 정렬된 디스플레이 상에 표정 표시, 정보 표시 등을 수행할 수 있다. 한편, 전면유리는 확대경으로 채택되어 사용자 디스플레이의 정보가 보다 크게 보일 수 있도록 로봇 이 구현될 수도 있다. 또한, 윈도우의 크기 및 위치 배열은 사용자 단말기에 설치된 카메라가 노출될 수 있도록 선택될 수도 있 고, 이러한 경우 로봇은 사용자 단말기의 카메라를 활용하도록 구성될 수도 있다. 예를 들어, 로봇의 프로세서는 사용자 단말기의 카메라에 의해 사용자의 얼굴이나, 물체를 인식하고, 그에 따라 로봇의 동작을 제어하도록 구성될 수 있다. 또한, 사용자 단말기의 전후면 카메라는 홈캠(가정용 CCTV)의 역할도 수행할 수 있으며, 로봇의 전면 에 내장된 제 1 적외선 센서를 통해 사용환경에서의 움직임을 감지하고 추적하며 촬영 동작을 수행할 수도 있다. 위와 같이, 본 개시의 실시예들의 발명자는 내부에 결합된 스마트폰의 디스플레이에 정보가 띄워지면 윈도우를 통해 외부에서 보일 수 있도록 하여, 로봇 자체에 추가적인 디스플레이가 없이도 첨단화된 느낌을 줄 수 있도록 했다. 한편, 도 2에서는 윈도우가 전면에만 배치되어 있으나, 후면에도 윈도우가 배치될 수 있고, 이러한 경우 로봇 내에 거치된 사용자 단말기의 후면에 배치된 카메라 또는 플래쉬 등의 추가 활용이 가능해질 수 있 다. 중간부의 윈도우 아래에는 제 1 적외선 센서가 배치될 수 있다. 전면부에 배치된 제 1 적외선 센서 는 사용자의 손과 같은 장애물과의 거리를 측정하는데 사용될 수 있으며, 로봇의 프로세서는 제 1 적 외선 센서가 감지하는 장애물까지의 거리를 일정 거리만큼 유지하기 위해 로봇의 움직임을 제어할 수 있다. 중간부의 내부에는 사용자 단말기를 지지하도록 구성되는 거치부가 배치될 수 있다. 거치부 는 사용자 단말기를 수용하여 지탱할 수 있도록 구성된다. 거치부는 다양한 스마트폰 사이즈에 맞도록 교체가능한 형태로 구성될 수 있다.본 개시의 실시예들의 발명자는 스마트폰을 지지해주는 거치대를 커스터마이징 할 수 있도록 모듈화 시킴으로써, 사용자가 자신의 스마트폰에 맞는 파트를 끼워서 사용할 수 있도록 하였다. 예를 들어, 거치부는 본체의 하부와 배치되는 파트 결합부에 탈착가능하도록 결합될 수 있다. 파트 결합부는 로봇의 무게중심을 낮추기 위해 금속과 같은 밀도가 높은 소재로 구성될 수 있다. 파트 결합부에는 PCB 홀더 및 배터리 홀더가 직간접적으로 결합될 수 있다. 배터리 홀더 는 로봇에 전원을 공급하고, 사용자 단말기의 보조 전원으로도 사용될 수 있는 대용량 배터리를 거치 하는 기능을 수행한다. 배터리 홀더의 전면부에는 무선 충전 패드가 설치되어 사용자 단말기에 가까이 배치되고, 대용량 배 터리와 무선 충전 패드가 전기적으로 연결된다. 이러한 구성에 따라, 거치부에 결합된 사용자 단말기 는 무선 충전 패드를 통해 전원을 공급받을 수 있다. 무선 충전 패드는 거치부의 뒷면에 설치되어, 사용자 단말기의 후면에 밀착하도록 구성될 수도 있다. PCB 홀더는 로봇의 프로세서, 메모리 및 통신 모듈 등이 결합되는 PCB 기판을 홀딩하기 위한 것으로 배터리 홀더의 뒷편에 배치될 수 있다. PCB 기판은 로봇의 각종 센서들, 로봇의 이동을 위한 구동부, 배터리 등과 연결될 수 있다. 파트 결합부는 거치부, PCB 홀더, 배터리 홀더를 지지할 수 있고, 본체의 하부에 결 합될 수 있다. 로봇의 무게 중심을 낮추기 위해 파트 결합부의 무게는 본체 및 거치부의 무게 보다 더 무겁도록 설계될 수 있다. 본체의 하부에는 로봇의 이동을 위한 수단으로서, 모터와 같은 구동부 및 바퀴, 볼캐스터가 설치될 수 있고, 로봇의 낙하를 방지하기 위한 제 2 적외선 거리센서가 하부의 바닥면에 배치될 수 있다. 한편, 파트 결합부는 회전가능하게 하부에 결합될 수 있으며, 사용자 단말기의 후면 카메라 또 는 플래쉬를 사용해야 하는 등의 경우에 파트 결합부가 회전하여 사용자 단말기의 후면에 있는 카메 라 또는 플래쉬가 윈도우를 통해 노출될 수 있다. 또한, 도 2에서는 도시되지 않았지만, 로봇의 내부에는 컬러 LED가 내장되어 다양한 빛을 만들어 낼 수 있 으며, 로봇의 표면을 투과하여 은은한 빛이 만들어져 로봇이 무드등의 기능을 수행할 수도 있다. 한편, 로봇의 본체는 사용자 단말기의 스피커를 통한 소리를 울리게 할 수 있는 붐박스기능을 수행할 수 있도록 내부의 형상이 설계될 수도 있다. 도 3은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 평면도를 도시한다. 로봇을 위에서 바라보면, 본체의 상부의 윗면이 보이고, 윗면에는 사용자 단말기가 투입되기 위 한 개구부가 형성되어 있다. 본체의 상부는 로봇의 내부 수리 등을 위해 용이하게 탈착가능하 도록 본체의 중간부에 결합될 수 있다. 도 4는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 정면도를 도시한다. 도 5는 본 개시의 실시 예에 따른 사용자 단말기를 수용하는 로봇의 배면도를 도시한다. 도 6은 본 개시의 실시예에 따른 사용자 단말 기를 수용하는 로봇의 측면도를 도시한다. 도 4 내지 6에서는 도 2에서 설명된 구성들에 대해서는 설명을 생략한다. 도 4에 도시된 바와 같이 사용자 단말기를 수용하는 로봇은 전면 유리가 배치되는 윈도우를 가 짐으로써, 내부에 결합된 사용자 단말기의 디스플레이의 적어도 일부가 외부로 노출될 수 있도록 한다. 노출되는 디스플레이의 부분에는 로봇의 표정을 표시하는 그래픽이나, 사용자에게 정보를 전달하기 위한 사진 또는 텍스트 등이 표시될 수 있다. 아울러, 윈도우의 크기에 따라 사용자 단말기의 전면 카메라가 노출되고 이러한 전면 카메라의 기능이 로 봇이 동작하는데 활용될 수 있다. 본체의 하부의 바닥면에는 볼 캐스터(133a, 133b), 바퀴(131a, 131b)와 같은 이동수단이 배치될 수 있다. 로봇의 프로세서는 사용자 단말기를 통해 지시를 받아 이동수단들을 움직여 로봇을 이동시킬 수 있다.중간부의 윈도우가 형성된 부분의 반대 방향에는 도 5와 같이 방열부가 형성될 수 있다. 사용자 단 말기 및 로봇의 내부에 배치되는 배터리는 사용시간이 지남에 따라 열이 발생할 수 있고, 이러한 열 이 효과적으로 배출될 필요가 있다. 방열부는 로봇 내외부의 공기가 순환될 수 있도록 설계된 단순한 슬릿형태로 구현될 수도 있고, 내부 에 팬이 부착되어 보다 능동적으로 방열을 수행하도록 구성될 수도 있다. 한편, 도 5에는 도시되어 있지 않지만, 로봇의 후면에는 배터리와 연결되는 USB 연결 단자가 외부로 노출 되어 로봇이 유선으로 충전되거나 로봇의 프로세서를 위한 펌웨어 업데이트나 코딩데이터 전송 등이 이루어지도록 할 수 있다. 도 7은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 저면도를 도시한다. 로봇 본체의 하부의 바닥면에는 2개의 바퀴(131a, 131b)가 배치되고, 2개의 볼 캐스터(133a, 133b)가 배치 될 수 있다. 바퀴와 볼 캐스터의 움직임에 따라 로봇은 전진, 후진, 회전 등의 움직임이 가능하게 된다. 하부의 바닥면에는 제 2 적외선 센서(135a, 135b, 135c, 135d)가 배치될 수 있다. 제 2 전외선 센서 (135a, 135b, 135c, 135d)는 로봇의 하부와 로봇이 서 있는 바닥면 사이의 거리를 감지할 수 있다. 예를 들어, 로봇이 이동 중에 제 2 적외선 센서들 중 하나의 센서에서 미리 정해진 일정 거리(예를 들어, 하부에 노출된 바퀴의 높이 또는 3cm 등 구현 형태에 따른 임의의 높이) 이상의 거리가 탐지된다면, 로봇 의 프로세서는 로봇이 낙하의 위험이 있는 곳으로 이동한 것으로 판단할 수 있고, 로봇의 이동을 멈 추게 하거나, 로봇이 기존에 진행하던 방향으로부터 반대 방향으로 이동하도록 이동 수단을 제어할 수 있 다. 도 8a는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇이 사용자 단말기와 통신상 연결되는 과정을 설명하기 위한 도면이다. 도 8b는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇에 사용자 단말기를 결착하는 단계를 설명하기 위한 도면이다. 사용자는 사용자 단말기의 블루투스 기능을 활성화시키고, 주변 기기를 검색하여 로봇의 통신 인터페 이스를 통해 블루투스 연결을 성립시킬 수 있다. 이러한 연결은 사용자가 사용자 단말기를 로봇에 결합시키기 전에 이루어질 수도 있고, 사용자 단말기가 로봇에 결합되면 자동으로 이루어지도록 구성 될 수도 있다. 한편, 사용자 단말기는 블루투스, 와이파이 등의 무선 연결 방식 이외에도 로봇 내부에 설치된 포고핀 또 는 결속단자를 통한 유선연결을 통해서도 로봇과 연결될 수 있다. 이러한 통신 인터페이스를 통해 로봇의 프로세서는 사용자 단말기로부터 명령을 수신하고, 로봇(10 0)의 동작을 제어할 수 있다. 도 8b에 도시된 바와 같이 사용자는 사용자 단말기를 로봇 내부로 투입할 수 있다. 예를 들어, 본체 내의 거치부 또는 거치부 내부의 사용자 단말기를 지지하는 지지부는 초기 상 태(제 1 상태로 지칭)에서는 위로 솟아 있다가 사용자 단말기가 들어오면서 눌러지면 눌러진 상태(제 2 상 태로 지칭)로 고정될 수 있다. 사용자는 또한 로봇 내부에 배치된 사용자 단말기를 꺼내기 위해서 사용자 단말기를 다시 한 번 누를 수 있고, 거치부 또는 지지부는 제 2 상태에서 한 번 더 눌러지면 다시 제 1 상태로 복귀하여 솟아올 라 사용자 단말기가 꺼내지기 쉽도록 사용자 단말기를 로봇의 상부로 노출시킬 수 있다. 여기서, 로봇의 프로세서는 거치부 또는 지지부가 제 1 상태에서 제 2 상태로 변화되는 것을 감지할 수 있고, 이러한 변화는 사용자 단말기가 로봇 내부에 투입되어 연결이 필요하다는 신호로 판단하여 로봇의 블루투스 인터페이스를 활성화시켜 로봇과 사용자 단말기가 통신가능하도록 연결시킬 수 있다. 또한, 로봇의 프로세서는 거치부 또는 지지부가 제 1 상태에서 제 2 상태로 변하면 로봇의 전원 이 켜지도록 구성될 수도 있다. 다른 실시예에서는, 거치부 또는 지지부가 제 1 상태에서 제 2 상태로 변 하면 배터리와 PCB 회로의 전기적 연결이 이루어지도록 하는 스위치를 구성하여 로봇에 전원이 들어오도록할 수도 있다. 아울러, 거치부 또는 지지부가 제 1 상태에서 제 2 상태로 변하면 로봇의 프로세서는 통신 인터페이 스를 통해 사용자 단말기가 로봇 모드로 변하도록 로봇 모드 개시 신호를 송신할 수도 있다. 로봇 모드 개시 신호는 적어도 사용자 단말기로 하여금 윈도우로 노출되는 디스플레이 부분에 로봇의 얼굴 형상을 표시하도록 제어하는 신호를 포함할 수 있다. 한편, 로봇과 결합한 사용자 단말기는 결합 후 핫스팟을 실행하도록 자동으로 설정될 수 있고, 이에 따라 로봇은 이동식 와이파이 기기로 기능할 수도 있다. 도 9a는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇을 음성으로 제어하는 과정을 설명하기 위한 도면이다. 사용자 단말기는 대부분 마이크를 구비하므로, 사용자 단말기가 배치된 로봇은 사용자의 음성 명령을 수신할 수 있으며, 이에 따라 로봇은 사용자의 음성에 의해 동작할 수 있다. 예를 들어, 사용자 단말기는 결합시 상부에 마이크가 배치될 수 있고, 결합 상태에서 로봇의 상부 의 투입구로 마이크가 노출되므로, 마이크를 통해 사용자의 음성을 수신할 수 있다. 한편, 사용자의 음성은 로봇에 결합된 사용자 단말기의 마이크를 통해 수신될 수도 있지만, 사용자가 착용하고 있는 웨어러블 디바이스를 통해 사용자 단말기로 전달될 수도 있다. 이러한 경우, 음성 뿐 아니라, 웨어러블 디바이스를 통해 사용자의 손의 움직임이 감지되어 로봇에 대한 제어 명령이 사용자 단말기로 전달될 수도 있다. 도 9b는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇을 손으로 손으로 제어하는 과정을 설명하기 위한 도면이다. 로봇의 전면부에는 제 1 적외선 센서가 배치되어 사용자의 손과 같은 장애물을 감지할 수 있고, 로봇 의 프로세서는, 제 1 적외선 센서가 감지하는 장애물까지의 거리를 일정 거리만큼 유지하기 위해 이 동 수단을 제어할 수 있다. 이러한 구성을 통해 사용자는 손을 로봇의 전면부에 가까이 하여 로봇이 후진하도록 할 수 있고, 손 을 로봇의 전면부로부터 멀어지도록 하여 로봇이 전진하도록 할 수도 있다. 한편, 로봇의 하단부에는 로봇 내부의 배터리와 연결되는 추가 무선 충전 패드가 배치될 수 있고, 로봇의 프로세서는 로봇이 충전이 필요할 경우에 충전 패드가 있는 곳으로 로봇을 이동시켜 충전을 수행하도 록 구성될 수 있다. 또한, 로봇이 사용자로부터 사용자 단말기 분리 신호를 수신하는 경우, 로봇은 카메라를 통해 사용자 를 감지하여 사용자에게 가까운 곳으로 이동한 후 거치부 또는 지지부를 제 2 상태에서 제 1 상태로 변화 시킬 수 있다. 도 10은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇에서 사용자 단말기를 분리하는 과정을 설명하 기 위한 도면이다. 사용자는 로봇으로부터 사용자 단말기를 회수할 때, 사용자 단말기를 한 번 더 눌러줄 수 있고, 스프링 및 홀더와 같은 기계적 구성에 의해 거치부 또는 지지부는 사용자 단말기를 위로 올릴 수 있 다. 이와 같이 거치부 또는 지지부가 제 2 상태에서 제 1 상태로 변하면, 사용자는 위로 올려서 일부가 노출된 사용자 단말기를 손쉽게 꺼낼 수 있다. 거치부 또는 지지부가 제 2 상태에서 제 1 상태로 변하면, 로봇의 프로세서는 로봇의 전원이 꺼 지도록 하거나 사용자 단말기와의 통신이 종료되도록 할 수 있다. 도 11은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 이동 방식을 설명하기 위한 도면이다. 로봇은 이동을 하다가 도 11과 같이 바닥부가 급격히 낮아지는 상황을 만날 수 있다. 이러한 경우 로봇 이 진행을 계속하게 되면 낙하와 같은 사고가 발생할 수 있다.따라서, 로봇의 하부에는 제 2 적외선 센서들(135a, 135b, 135c, 135d)이 배치되어, 로봇의 하부로 부터 바닥까지의 거리(d1, d2)를 감지할 수 있다. 감지된 거리가 미리 설정된 거리보다 작거나 같은 d1이라면 로봇은 문제 없이 진행을 계속하지만, 제 2 적 외선 센서들 중 하나라도 미리 설정된 거리보다 큰 d2와 같은 거리를 감지하면, 로봇의 프로세서는 로봇 의 이동을 멈추거나 기존 진행 방향과 반대 방향으로 로봇을 이동시킬 수 있다. 도 12는 본 개시의 실시예에 따른 다양한 형태의 사용자 단말기를 수용하는 로봇들을 도시한다. 위와 같은 구성을 통해, 도 12의 (a) 내지 (d)에서 도시되는 바와 같이, 본 개시에 따른 로봇은 사용자의 커스터마이즈가 용이하게 되고, 결합된 사용자 단말기의 디스플레이를 통해 다양한 얼굴을 구현할 수 있게 된다. 또한, 사용자 단말기의 기능을 활용할 수 있도록 함으로써, 기존의 로봇들보다 더 많은 기능들을 더 적은 자체 부품을 가지고 수행할 수 있고, 영유아부터 중장년층까지 전 연령층을 수용할 수 있으며, 사용 환경과 수 준에 따라 다양하게 활용할 수 있는 다재다능한 로봇이 제공될 수 있다. 이상 설명된 본 개시에 따른 실시 예는 컴퓨터 상에서 다양한 구성요소를 통하여 실행될 수 있는 컴퓨터 프로그 램의 형태로 구현될 수 있으며, 이와 같은 컴퓨터 프로그램은 컴퓨터로 판독 가능한 매체에 기록될 수 있다. 이 때, 매체는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체, CD-ROM 및 DVD와 같은 광기록 매체, 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical medium), 및 ROM, RAM, 플래시 메모리 등과 같은, 프로그램 명령어를 저장하고 실행하도록 특별히 구성된 하드웨어 장치를 포함할 수 있다. 한편, 상기 컴퓨터 프로그램은 본 개시를 위하여 특별히 설계되고 구성된 것이거나 컴퓨터 소프트웨어 분야의 당업자에게 공지되어 사용 가능한 것일 수 있다. 컴퓨터 프로그램의 예에는, 컴파일러에 의하여 만들어지는 것 과 같은 기계어 코드뿐만 아니라 인터프리터 등을 사용하여 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드도 포함될 수 있다. 본 개시의 명세서(특히 특허청구범위에서)에서 \"상기\"의 용어 및 이와 유사한 지시 용어의 사용은 단수 및 복수 모두에 해당하는 것일 수 있다. 또한, 본 개시에서 범위(range)를 기재한 경우 상기 범위에 속하는 개별적인 값을 적용한 발명을 포함하는 것으로서(이에 반하는 기재가 없다면), 발명의 상세한 설명에 상기 범위를 구성하 는 각 개별적인 값을 기재한 것과 같다. 본 개시에 따른 방법을 구성하는 단계들에 대하여 명백하게 순서를 기재하거나 반하는 기재가 없다면, 상기 단 계들은 적당한 순서로 행해질 수 있다. 반드시 상기 단계들의 기재 순서에 따라 본 개시가 한정되는 것은 아니 다. 본 개시에서 모든 예들 또는 예시적인 용어(예들 들어, 등등)의 사용은 단순히 본 개시를 상세히 설명하기 위한 것으로서 특허청구범위에 의해 한정되지 않는 이상 상기 예들 또는 예시적인 용어로 인해 본 개시의 범위 가 한정되는 것은 아니다. 또한, 당업자는 다양한 수정, 조합 및 변경이 부가된 특허청구범위 또는 그 균등물 의 범주 내에서 설계 조건 및 팩터에 따라 구성될 수 있음을 알 수 있다. 따라서, 본 개시의 사상은 상기 설명된 실시 예에 국한되어 정해져서는 아니 되며, 후술하는 특허청구범위뿐만 아니라 이 특허청구범위와 균등한 또는 이로부터 등가적으로 변경된 모든 범위는 본 개시의 사상의 범주에 속한 다고 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8a 도면8b 도면9a 도면9b 도면10 도면11 도면12"}
{"patent_id": "10-2019-0164897", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 사용예를 도시한다. 도 2는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 분해도를 도시한다. 도 3은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 평면도를 도시한다. 도 4는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 정면도를 도시한다. 도 5는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 배면도를 도시한다.도 6은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 측면도를 도시한다. 도 7은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 저면도를 도시한다. 도 8a는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇이 사용자 단말기와 통신상 연결되는 과정을 설명하기 위한 도면이다. 도 8b는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇에 사용자 단말기를 결착하는 단계를 설명하기 위한 도면이다. 도 9a는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇을 음성으로 제어하는 과정을 설명하기 위한 도면이다. 도 9b는 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇을 손으로 손으로 제어하는 과정을 설명하기 위한 도면이다. 도 10은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇에서 사용자 단말기를 분리하는 과정을 설명하 기 위한 도면이다. 도 11은 본 개시의 실시예에 따른 사용자 단말기를 수용하는 로봇의 이동 방식을 설명하기 위한 도면이다. 도 12는 본 개시의 실시예에 따른 다양한 형태의 사용자 단말기를 수용하는 로봇들을 도시한다."}
