{"patent_id": "10-2024-0053336", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0155812", "출원번호": "10-2024-0053336", "발명의 명칭": "전사체 기반 면역학적 프로파일링을 이용한 암 진단 방법", "출원인": "주식회사 지씨지놈", "발명자": "기창석"}}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "다음의 단계를 포함하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법:(a) 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 수득하는 단계; (b) 수득한 WTS 정보를 표준 염색체 서열 데이터베이스(reference genome database)에 정렬(alignment)하는 단계; (c) 상기 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcriptome) 특징을 추출하는 단계; 및(d) 상기 추출된 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석된 출력값을 기준값(cut-off value)과 비교하여 암 유무를 판정하는 단계."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 (a) 단계의 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 획득하는 단계는 다음의 단계를 포함하는 방법으로 수행되는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법:(a-i) 생체시료에서 수득된 RNA를 효소적 절단방법으로 무작위 단편화(random fragmentation)하는 단계;(a-ii) 절단된 RNA를 cDNA로 치환한 다음, 라이브러리(library)를 제작하는 단계; 및(a-iii) 제작된 라이브러리를 차세대 유전자서열검사기(next-generation sequencer)로 싱글 엔드 시퀀싱(single-end sequencing) 또는 페어 엔드 시퀀싱(pair-end sequencing)을 진행하여 WTS 정보를 획득하는 단계."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 (c) 단계의 면역세포 수용체 특징을 추출하는 단계는 하기의 단계를 포함하여 수행하는것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법:(c-i) 정렬된 WTS 정보에서 면역세포 수용체의 CDR3(complementary-determining region 3) 아미노산 서열을 추출하는 단계 및(c-ii) 추출된 서열정보를 기반으로 면역 레퍼토리 특성(Immune repertoire properties), V 및 J 유전자 사용비율(V&J gene usage) 및 CDR3 아미노산 서열의 화학적 특징으로 구성된 군에서 선택되는 하나 이상의 특징을계산하는 단계;"}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 (c) 단계의 전사체(transcriptome) 특징을 추출하는 단계는 암 또는 면역 연관 유전자 발현 점수(single sample gene set enrichment analysis, ssGESA score) 또는 면역 세포 구성(immune cellcomposition)을 계산하는 단계를 포함하여 수행하는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 면역 레퍼토리 특성(Immune repertoire properties)은 TCR 서열 전체 수(total number공개특허 10-2024-0155812-3-of TCR sequences), TCR 서열 고유 수(unique number of TCR sequences), 킬로 리드 당 TCR 클론타입의 수(number of TCR clonotypes per kilo-reads), TCR 엔트로피(entropy of TCR), TCR의 클론성(clonality ofTCR), BCR 서열 전체 수(total number of BCR sequences), BCR 서열 고유 수(unique number of BCRsequences), 킬로 리드 당 BCR 클론타입의 수(number of BCR clonotypes per kilo-reads), BCR 엔트로피(entropy of BCR), BCR의 클론성(clonality of BCR), BCR의 체세포 과돌연변이율(somatic hypermutation rateof BCR sequences) 및 BCR 클러스터 수(number of BCR clusters)로 구성된 군에서 선택되는 하나 이상인 것을특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제3항에 있어서, V 및 J 유전자 사용비율(V&J gene usage)은 IGH, IGK, IGL, TRA, TRB, TRD, TRG, IGHA1,IGHA2, IGHD, IGHE, IGHG1, IGHG2, IGHG3, IGHG4, IGHGP 및 IGHM로 구성된 군에서 선택되는 2 이상의 유전자형(genotype)의 비율인 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항에 있어서, 상기 CDR3 아미노산 서열의 화학적 특징은 TCR의 평균길이(mean of length in TCR), TCR의 그레이비 인덱스 평균(mean of gravy index in TCR), TCR 아미노산의 벌키성 평균(mean of bulkiness of aminoacids in TCR), TCR 아미노산의 극성 평균(mean of polarity of amino acids in TCR), TCR 아미노산의 전하 평균(mean of net charge in TCR), TCR 아미노산 중 염기성 아미노산의 비율 평균(mean of fraction of basicamino acids in TCR), TCR 아미노산 중 산성 아미노산의 비율 평균(mean of fraction of acidic amino acidsin TCR), TCR 아미노산 중 방향족 아미노산의 비율 평균(mean of fraction of aromatic amino acids in TCR),TCR 아미노산의 지방족성 평균(mean of aliphatic index in TCR), BCR의 평균길이(mean of length in BCR),BCR의 그레이비 인덱스 평균(mean of gravy index in BCR), BCR 아미노산의 벌키성 평균(mean of bulkiness ofamino acids in BCR), BCR 아미노산의 극성 평균(mean of polarity of amino acids in BCR), BCR 아미노산의전하 평균(mean of net charge in BCR), BCR 아미노산 중 염기성 아미노산의 비율 평균(mean of fraction ofbasic amino acids in BCR), BCR 아미노산 중 산성 아미노산의 비율 평균(mean of fraction of acidic aminoacids in BCR), BCR 아미노산 중 방향족 아미노산의 비율 평균(mean of fraction of aromatic amino acids inBCR) 및 BCR 아미노산의 지방족성 평균(mean of aliphatic index in BCR)으로 구성된 군에서 선택되는 하나 이상인 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제4항에 있어서, 상기 암 또는 면역 연관 유전자 발현 점수(single sample gene set enrichment analysis,ssGESA score)는 면역 반응 관련 T 세포 활성화(T cell activation involved in immune response), 선천성 면역 반응(innate immune response), 선천성 면역 반응 활성화 세포 표면 수용체 신호 경로(innate immuneresponse activating cell surface receptor signaling pathway), 면역 반응에 관여하는 림프구 활성화(lymphocyte activation involved in immune response), 점막 면역 반응(mucosal immune response), 면역 반응에 관여하는 자연 살해 세포 활성화(natural killer cell activation involved in immune response), 면역반응의 음성 조절(negative regulation of immune response), 선천성 면역 반응의 음성 조절(negativeregulation of innate immune response), 면역 반응에 관여하는 호중구 활성화(neutrophil activationinvolved in immune response), 사이토카인의 양성 조절(positive regulation of cytokine), 면역 반응에 관여하는 생산(production involved in immune response), 면역 이펙터 과정의 양성 조절(positive regulation ofimmune effector process), 면역 반응의 양성 조절(positive regulation of immune response), 면역 반응의 분자 매개체 생산의 양성 조절(positive regulation of production of molecular mediator of immune response),적응 면역 반응의 조절(regulation of adaptive immune response),면역 반응에 관여하는 사이토카인 생산의 조절(regulation of cytokine production involved in immune response), 체액성 면역 반응의 조절(regulationof humoral immune response), 면역 효과 과정의 조절(regulation of immune effector process), 면역 반응의공개특허 10-2024-0155812-4-조절(regulation of immune response), 선천성 면역 반응의 조절(regulation of innate immune response), 항원 처리 및 제시(antigen processing and presentation), B 세포 수용체 신호 경로(B cell receptor signalingpathway), 케모카인 신호 경로(chemokine signaling pathway), 보체 및 응고 캐스케이드(complement andcoagulation cascades), 세포질 DNA 감지 경로(cytosolic DNA-sensing pathway), Fc 엡실론 RI 신호 경로(Fcepsilon RI signaling pathway), Fc 감마 R 매개 식세포증(Fc gamma R-mediated phagocytosis), 조혈 세포 계통(hematopoietic cell lineage), IL-17 신호 경로(IL-17 signaling pathway), IgA 생산을 위한 장 면역 네트워크(intestinal immune network for IgA production), 백혈구 내피 세포 이동(leukocyte transendothelialmigration), NOD 유사 수용체 신호 경로(NOD-like receptor signaling pathway), 자연 살해 세포 매개 세포 독성(natural killer cell mediated cytotoxicity), 호중구 세포 외 트랩 형성(neutrophil extracellular trapformation), 혈소판 활성화(platelet activation), RIG-I 유사 수용체 신호 경로(RIG-I-like receptorsignaling pathway), T 세포 수용체 신호 경로(T cell receptor signaling pathway), Th1 및 Th2 세포 분화(Th1 and Th2 cell differentiation), 톨 유사 수용체 신호 경로(Toll-like receptor signaling pathway), 종양 괴사인자에 대한 세포 반응(cellular response to tumor necrosis factor), 종양 괴사인자 생산의 음성 조절(negative regulation of tumor necrosis factor production), 종양 괴사인자 슈퍼 패밀리 사이토 카인 생산의 음성 조절(negative regulation of tumor necrosis factor superfamily cytokine production), 종양 괴사인자 매개 신호 경로의 음성 조절(negative regulation of tumor necrosis factor-mediated signalingpathway), 종양괴사인자 생산의 양성 조절(positive regulation of tumor necrosis factor production), 종양괴사인자 슈퍼 패밀리 사이토카인 생산의 양성 조절(positive regulation of tumor necrosis factorsuperfamily cytokine production), 종양괴사인자 생산의 조절(regulation of tumor necrosis factorproduction), 종양괴사인자 매개 신호 전달 경로의 조절(regulation of tumor necrosis factor-mediatedsignaling pathway), 종양괴사인자에 대한 반응(response to tumor necrosis factor), 종양괴사인자 매개 신호전달 경로(tumor necrosis factor-mediated signaling pathway), 암의 중심 탄소 대사(central carbonmetabolism in cancer), 자궁내막암(endometrial cancer), 암의 PD-L1 발현 및 PD-1 체크 포인트 경로(PD-L1expression and PD-1 checkpoint pathway in cancer) 및 암의 전사 조절 오작동(transcriptionalmisregulation in cancer)으로 구성된 군에서 선택되는 하나 이상에 관련된 유전자의 발현 점수(enrichmentscore)를 계산하는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제4항에 있어서, 상기 면역 세포 구성은 미경험 T 세포(naive CD4+ T cell), CD4+ T 세포(CD4+ T cell), 미경험 CD8+ T 세포(naive CD8+ T cell), CD8+ T 세포(CD8+ T cell), 중심기억 T 세포(central memory Tcell), 세포독성 T 세포(cytotoxic T cell), 수지상세포(dendritic cell), 효과기억 T 세포(effector memory Tcell), 기능탈진 T 세포(exhausted T cell), 감마델타 T 세포(γδT cell), 자연 조절 T 세포(natural Treg cell), 유도된 조절 T 세포(induced Treg cell), 점막 관련 불변 T 세포(mucosal-associated invariant Tcell), NK 세포(NK cell), NK T 세포(NK T cell), 여포 보조 T 세포(follicular helper T cell), 1형 보조 T세포(type 1 helper T cell), 17형 보조 T 세포(type 17 helper T cell), 2형 보조 T 세포(type 2 helper Tcell), 1형 조절 T 세포(type 1 Treg cell), 단핵구(monocyte), 대식세포(macrophage), 호중구(neutrophil),B 세포(B cell) 및 infiltration score로 구성된 군에서 선택되는 2 이상의 면역 세포의 비율(proportion)을계산하는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 상기 (c) 단계의 면역세포 수용체 특징 및 전사체(transcriptome) 특징은 표 1에 기재된 특징을 포함하는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법.공개특허 10-2024-0155812-5-공개특허 10-2024-0155812-6-공개특허 10-2024-0155812-7-공개특허 10-2024-0155812-8-공개특허 10-2024-0155812-9-공개특허 10-2024-0155812-10-청구항 11 제1항에 있어서, 상기 (d) 단계의 기준값은 0.5이며, 0.5 이상일 경우 암으로 판정하는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서,(e) 암으로 판정된 샘플의 면역세포 수용체 특징 및 전사체(transcript) 특징을 면역강화 상태 와 암을 구분하도록 학습된 제2인공지능 모델에 입력하여 분석한 출력값을 기준값(cut-off value)과 비교하여 암 유무를 판정하는 단계를 추가로 포함하는 것을 특징으로 하는 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12항에 있어서, 상기 (e) 단계의 기준값은 0.5이며, 0.5 이상일 경우 암으로 판정하는 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항 또는 제12항에 있어서, 상기 인공지능 모델은 선형 회귀(Linear regression), 랜덤 포레스트(randomforest), 합성곱 신경망(convolutional neural network, CNN), 심층 신경망(Deep Neural Network, DNN), 순환신경망(Recurrent Neural Network, RNN) 및 오토 인코더(autoencoder)으로 구성된 군에서 선택되는 하나 이상인 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 인공지능 모델이 DNN일 경우, 손실함수는 하기 수식 1로 표시되는 binary cross-entropy인 것을 특징으로 하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법:공개특허 10-2024-0155812-11-수식 1:여기서, N은 전체 샘플 수이며 는 i번째 입력값의 실제 라벨이고 는 모델이 예측한 i번째 입력값의라벨이다."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 해독하는 해독부; 해독된 WTS 정보를 표준 염색체 서열 데이터베이스에 정렬하는 정렬부; 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcript) 특징(feature)을 추출하는 특징 추출부; 및추출한 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석한 출력값을 기준값(cut-offvalue)과 비교하여 암 유무를 판정하는 암 진단부를 포함하는 면역학적 프로파일링 기반 암 진단 장치."}
{"patent_id": "10-2024-0053336", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "컴퓨터 판독 가능한 저장 매체로서, 암 진단을 위한 프로세서에 의해 실행되도록 구성되는 명령을 포함하되, (a) 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 수득하는 단계; (b) 수득한 WTS 정보를 표준 염색체 서열 데이터베이스(reference genome database)에 정렬(alignment)하는 단계; (c) 상기 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcript) 특징을 추출하는 단계; (d) 추출한 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석한 출력값을 기준값(cut-offvalue)과 비교하여 암 유무를 1차 판정하는 단계; 및(e) 암으로 1차 판정된 샘플의 면역세포 수용체 특징 및 전사체(transcript) 특징을 면역강화 상태와 암을 구분하도록 학습된 제2인공지능 모델에 입력하여 분석한 출력값을 기준값(cut-off value)과 비교하여 암 유무를 최종 판정하는 단계를 통하여, 암 진단을 수행하는 프로세서에 의해 실행되도록 구성되는 명령을 포함하는 컴퓨터판독 가능한 저장 매체."}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 전사체 기반 면역학적 프로파일링을 이용한 암 진단 방법에 관한 것으로, 보다 구체적으로는 생체시료 에서 전사체 서열정보를 획득한 다음, 전사체 서열정보에서 면역세포 수용체의 특징과 전사체의 특징을 추출한 다음, 이를 암 유무를 판정할 수 있도록 학습된 인공지능 모델에 입력하여 분석하는 방법을 이용한 암 진단 방법 에 관한 것이다. 본 발명에 따른 전사체를 이용한 면역학적 프로파일링 기반 암 진단 방법은 차세대 염기서열 분 석기법(Next Generation Sequencing, NGS)으로 생산된 전사체 샘플에서 추출한 면역세포 수용체의 특징 및 유전 자 발현량 특징을 모두 이용하여 인공지능 기반으로 전 암종을 진단하며, 면역세포 수용체 서열정보만을 활용한 진단 방법에 비해 정확도와 민감도가 높아 상업적으로 활용도가 높은 유용한 방법이다."}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 전사체 기반 면역학적 프로파일링을 이용한 암 진단 방법에 관한 것으로, 보다 구체적으로는 생체시 료에서 전사체 서열정보를 획득한 다음, 전사체 서열정보에서 면역세포의 특징과 전사체의 특징을 추출한 다음, 이를 암 유무를 판정할 수 있도록 학습된 인공지능 모델에 입력하여 분석하는 방법을 이용한 암 진단 방법에 관 한 것이다."}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정밀 종양학의 주요 목표는 암의 진단 및 치료를 개선하는 것이다. 이를 위해, 다양한 지놈 및 기타 분자 분석 법을 종양 물질에 적용하여 치료법을 선택하기 위해 알려진 예측 마커를 식별하고, 예후를 추정할 수 있는 분자 의 하위 유형 분류를 유도한다. 그리고 종양 진행과 관련된 체세포 변화를 특성화 하며, 방해되는 경로를 감지하고, 전이성 질환의 분자 판별자를 확인한다. 종양 지놈을 상세하게 특성화하기 위해 다양한 차세대 시퀀싱 (NGS) 기반 접근법이 사용되었지만, 포괄적인 다중 매개 변수 분석을 통해 보다 정확한 종양 유형이 분류될 수 있다. 예를 들어, TCGA (The Cancer Genome Atlas) 연구 네트워크는 수백 종의 종양에 관해 DNA, RNA, 단백질 및 후성유전적 수준에서 포괄적인 분자 프로파일을 생성하였다. 이러한 다중 매개 변수 분석 결과, 종양 유형 및 식별된 새로운 종양 하위 유형에 대한 기능적 역할 및 분자 변이에 관한 이해를 향상하게 만들었다. 중요한 것은 이러한 노력으로 정밀 의약품의 가능성을 실현하기 위한 전제조건인 새로운 약물 대상을 식별하게 되었다 는 것이다. 그러나 분자 프로파일링을 위한 종양 물질에 대한 접근은 일반적으로 가능하지는 않지만, 종양 유전 자형의 연속 모니터링에 적합하지 않은 침습적 방법에 의존한다. 따라서, 정밀 종양학의 비침습적이며 여러 번 반복 될 수 있고 질병의 모니터링이 쉬운 액체 생검으로 점점 더 초점이 맞춰지고 있다. 실제로, 암의 조기 발견을 위해 이러한 액체 생검을 사용하려는 시도가 이루어지고 있다. “액체 생검”이라는 용어는 먼저 조직 생검 샘플에서 유래하는 혈액 샘플에서 동일한 진단 정보를 도출 할 수 있는 방법을 설명하기 위해 사용되었다. 종양학에서 이 용어는 혈액뿐만 아니라 소변, 복수 또는 흉막과 같은 쉽게 접근할 수 있는 다양한 생물학적 유체의 분석 및 샘플링을 의미하는 넓은 의미로 사용되었다. 이때, 체액 말초 혈액의 분석물은 순환 종양 세포(CTC), 순환 종양 DNA (ctDNA)를 함유하는 암 환자의 순환 무 세포 DNA (cfDNA)와 작은 RNA 뿐만 아니라, mRNA를 함유하는 순환 무세포 RNA (cfRNA), 엑소좀과 같은 순환 세 포외 소포(EV), 종양 educated 혈소판(TEP), 단백질 및 대사물질을 포함한다. 그리고, 이러한 분석물질은 병리 학자에 의해 일반적으로 얻어지는 1차 종양 또는 전이의 특징에 관한 정보를 제공할 가능성이 있다. 일반적으로 CTC 또는 ctDNA에서 얻어지는 지놈 돌연변이 및 복제수 변경에 대한 정보 외에도 액체 생검은 전사체, 원형질체, 단백질체, 대사체에 대한 일반적인 정보를 생성하는 데 사용되고 있다(Jacob J. Chabon et al., Nature, Vol. 580, pp. 245-25, 2020). 최근에는 혈액 내 DNA의 mutation 정보나 후성유전체 정보를 활용해서 높은 성능의 예측 모델을 만드는 연구결 과들이 발표되어 암 진단 분야에서 액체 생검의 중요성이 더욱 두드러지고 있는 실정이다(대한민국 특허 제 2022-0072680호, 미국 특허 18/472,529호). 한편, 면역항암치료의 발전으로 암 특이적인 면역학적 양상에 대한 연구가 활발히 진행되고 있다. 예를 들어 Beshnova D. et al., Sci Transl Med. Vol.12, 2020 연구에서는 암 환자의 T 세포 수용체(T cell receptor, TCR) sequence가 암 항원 특이적인지 아닌지를 나타낼 수 있는 지표로써 cancer-associated TCR score를 개발하였다. Convolutional neural network를 통해 암 특이적 TCR의 아미노산 서열을 학습하여 새 로운 환자를 진단할 때 환자의 TCR pool 내에 암 특이적 TCR 이 얼마나 있는지를 알려주는 지표인 상기 점수를 평균 내어 환자의 cancer score를 계산했을 때, 암 환자와 정상인 간의 cancer score 값의 분포가 차이가 있음 을 확인하여 이를 암 진단에 사용할 수 있는 기술로 개발한 것이다. 또한, 최근에는 항암 면역반응에서 B 세포의 역할이 부각되고 있다. 예를 들어 암 미세환경에 생성되는 3차 림 프절 구조(Tertiary Lymphoid Structures, TLS)의 핵심이 되는 germinal center B 세포가 면역항암치료의 반응 성에 영향을 준다고 내용들이 보고되었다(Helmink, B.A. et al., Nature, Vol. 577, pp. 549-555, 2020; Petitprez, F. et al., Nature, Vol. 577, pp. 556-560, 2020). 아울러, 전사체 서열분석(whole transcriptome sequencing; WTS) 데이터로부터 TCR 뿐만 아니라 B 세포 수용체 (B cell receptor, BCR)의 complementary-determining region 3 (CDR3) 서열을 이용해서 환자의 면역 레퍼토리 (immune repertoire)를 분석할 수 있는 기술이 개발되었다. 예를 들어, TRUST4 라는 알고리즘을 활용하면 WTS 데이터로부터 CDR3 서열을 추출할 수 있다(L. Song et al., Nature Methods 18:627, 2021). 이러한 T 세포 수용체와 B 세포 수용체의 레퍼토리 분석을 통해 항암 면역반응을 평가하고, 이용해 암을 진단하 려는 기술들이 개발되었으나, 현재까지는 제한된 암 종과 적은 환자 수로 예측 모델을 만들어 평가한 것에 불과 하여 민감도와 정확성에 있어서 한계가 있다는 단점이 있다. 이러한 기술배경하에, 본 발명자들은 전사체 기반 면역학적 프로파일링을 이용한 암 진단 방법을 개발하기 위해 예의 노력한 결과, 획득한 전사체 서열정보에서 면역세포의 특징과 전사체의 특징을 추출한 다음, 이를 암과 정 상을 구별하도록 학습된 인공지능 모델에 입력할 경우, 높은 민감도와 정확도로 암을 진단할 수 있다는 것을 확"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "인하고, 본 발명을 완성하였다.발명의 내용"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 목적은 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법을 제공하는 것 이다. 본 발명의 또 다른 목적은 상기 암 진단을 위한 정보의 제공 방법에 이용되는 장치 및 컴퓨터 판독 가능한 저장 매체를 제공하는 것이다."}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 본 발명은 (a) 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 수득하는 단계; (b) 수득한 WTS 정보를 표준 염색체 서열 데이터베이스(reference genome database)에 정렬(alignment)하는 단계; (c) 상기 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체 (transcriptome) 특징을 추출하는 단계; 및 (d) 상기 추출된 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석된 출력값을 기준값(cut-off value)과 비교하여 암 유무를 판정하는 단계를 포함하는 전사 체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법을 제공한다. 본 발명은 또한, 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 해독하는 해독 부; 해독된 WTS 정보를 표준 염색체 서열 데이터베이스에 정렬하는 정렬부; 정렬된 WTS 정보에서 면역세포 수용 체 특징 및 전사체(transcript) 특징(feature)을 추출하는 특징 추출부; 및 추출한 특징을 암과 정상을 구별하 도록 학습된 인공지능 모델에 입력하여 분석한 출력값을 기준값(cut-off value)과 비교하여 암 유무를 판정하는 암 진단부; 를 포함하는 면역학적 프로파일링 기반 암 진단 장치를 제공한다. 본 발명은 또한, 컴퓨터 판독 가능한 저장 매체로서, 암의 진단을 위한 프로세서에 의해 실행되도록 구성되는 명령을 포함하되, (a) 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 수득하는 단계; (b) 수득한 WTS 정보를 표준 염색체 서열 데이터베이스(reference genome database)에 정렬(alignment) 하는 단계; (c) 상기 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcriptome) 특징을 추출하는 단 계; (d) 상기 추출된 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석된 출력값을 기준값 (cut-off value)과 비교하여 암 유무를 1차 판정하는 단계; 및 (e) 암으로 1차 판정된 샘플의 면역세포 수용체 특징 및 전사체(transcriptome) 특징을 면역강화 상태와 암을 구분하도록 학습된 제2인공지능 모델에 입력하여 분석된 출력값을 기준값(cut-off value)과 비교하여 암 유무를 최종 판정하는 단계를 통하여, 암 진단을 수행하 는 프로세서에 의해 실행되도록 구성되는 명령을 포함하는 컴퓨터 판독 가능한 저장 매체를 제공한다."}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 전사체를 이용한 면역학적 프로파일링 기반 암 진단 방법은 차세대 염기서열 분석기법(Next Generation Sequencing, NGS)으로 생산된 전사체 샘플에서 추출한 면역세포 수용체의 특징 및 유전자 발현량 특 징을 모두 이용하여 인공지능 기반으로 전 암종을 진단하며, 면역세포 수용체 서열정보만을 활용한 진단 방법에 비해 정확도와 민감도가 높아 상업적으로 활용도가 높은 유용한 방법이다."}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "다른 식으로 정의되지 않는 한, 본 명세서에서 사용된 모든 기술적 및 과학적 용어들은 본 발명이 속하는 기술 분야에서 숙련된 전문가에 의해서 통상적으로 이해되는 것과 동일한 의미를 갖는다. 일반적으로 본 명세서에서 사용된 명명법 및 이하에 기술하는 실험 방법은 본 기술 분야에서 잘 알려져 있고 통상적으로 사용되는 것이다. 제1, 제2, A, B 등의 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 해당 구성요소들은 상기 용어 들에 의해 한정되지는 않으며, 단지 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 예 를 들어, 이하 설명하는 기술의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 및/또는 이라는 용어는 복수의 관련된 기재된 항목들의 조합 또는 복수의 관련된 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서 사용되는 용어에서 단수의 표현은 문맥상 명백하게 다르게 해석되지 않는 한 복수의 표현을 포함 하는 것으로 이해되어야 하고, \"포함한다\" 등의 용어는 설시된 특징, 개수, 단계, 동작, 구성요소, 부분품 또는 이들을 조합한 것이 존재함을 의미하는 것이지, 하나 또는 그 이상의 다른 특징들이나 개수, 단계 동작 구성요 소, 부분품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는 것으로 이해되어야 한다. 도면에 대한 상세한 설명을 하기에 앞서, 본 명세서에서의 구성부들에 대한 구분은 각 구성부가 담당하는 주기 능 별로 구분한 것에 불과함을 명확히 하고자 한다. 즉, 이하에서 설명할 2개 이상의 구성부가 하나의 구성부로 합쳐지거나 또는 하나의 구성부가 보다 세분화된 기능별로 2개 이상으로 분화되어 구비될 수도 있다. 그리고 이 하에서 설명할 구성부 각각은 자신이 담당하는 주기능 이외에도 다른 구성부가 담당하는 기능 중 일부 또는 전 부의 기능을 추가적으로 수행할 수도 있으며, 구성부 각각이 담당하는 주기능 중 일부 기능이 다른 구성부에 의 해 전담되어 수행될 수도 있음은 물론이다. 또, 방법 또는 동작 방법을 수행함에 있어서, 상기 방법을 이루는 각 과정들은 문맥상 명백하게 특정 순서를 기 재하지 않은 이상 명기된 순서와 다르게 일어날 수 있다. 즉, 각 과정들은 명기된 순서와 동일하게 일어날 수도 있고 실질적으로 동시에 수행될 수도 있으며 반대의 순서대로 수행될 수도 있다. 본 발명에서는, 샘플에서 획득한 전사체 서열분석(whole transcriptome sequencing; WTS) 데이터를 참조 유전 체에 정렬한 다음, 정렬된 WTS 데이터에서 면역학적 특징과 전사체의 특징을 추출하여 암과 정상을 구별하도록 학습된 인공지능 모델에 입력할 경우, 높은 민감도와 정확도로 암을 진단할 수 있다는 것을 확인하고자 하였다. 즉, 본 발명의 일 실시예에서는, WTS 데이터로부터 면역학적 특징 및 전사체의 특징을 포함하는 124개의 특징으 로 암을 진단할 수 있는 학습 모델을 구축하여(도 1), 암 환자 183명의 WTS data를 사용하여, 성능을 테스트한 결과, 그 성능이 뛰어난 것을 확인하였다(도 3 및 도 8). 본 발명에서 용어 \"리드(reads)\"는, 당업계에 알려진 다양한 방법을 이용하여 서열정보를 분석한 하나의 핵산 단편을 의미한다. 따라서, 본 명세서에서 용어 “서열정보”, “전사체 서열분석 정보” 및 “리드”는 시퀀싱 과정을 통해 서열정보를 수득한 결과물이라는 점에서 동일한 의미를 가진다.따라서, 본 발명은 일 관점에서, 다음의 단계를 포함하는 전사체를 이용한 면역학적 프로파일링 기반 암 진단을 위한 정보의 제공 방법에 관한 것이다: (a) 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 수득하는 단계; (b) 수득한 WTS 정보를 표준 염색체 서열 데이터베이스(reference genome database)에 정렬(alignment)하는 단 계; (c) 상기 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcript) 특징을 추출하는 단계; 및 (d) 상기 추출된 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석된 출력값을 기준값 (cut-off value)과 비교하여 암 유무를 판정하는 단계. 본 발명에서, 상기 면역세포 수용체 특징은 WTS 정보로부터 수득할 수 있는 면역관련 세포 수용체의 특징이면 제한없이 이용 가능하며, 바람직하게는 WTS 정보로부터 도출한 CDR3(complementary-determining region 3) 아 미노산 서열을 기반으로 T 세포 수용체(T cell receptors, TCR)의 특징, B 세포 수용체(B cell receptor, BC R)의 특징 또는 CDR3 아미노산 서열 자체의 특징일 수 있으나, 이에 한정되는 것은 아니다. 본 발명에서, 전사체(transcriptome) 특징은 WTS 정보로부터 수득할 수 있는 전사체 관련 특징이면 제한없이 이 용 가능하며, 바람직하게는 암 또는 면역반응 관련 유전자의 발현점수 또는 면역 세포 구성((immune cell composition)일 수 있으나, 이에 한정되는 것은 아니다. 본 발명에 있어서, (a) 단계의 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 획득하는 단계 는 다음의 단계를 포함하는 방법으로 수행되는 것을 특징으로 할 수 있다: (a-i) 생체시료에서 수득된 RNA를 효소적 절단방법으로 무작위 단편화(random fragmentation)하는 단계; (a-ii) 절단된 RNA를 cDNA로 치환한 다음, 라이브러리(library)를 제작하는 단계; (a-iii) 제작된 라이브러리를 차세대 유전자서열검사기(next-generation sequencer)로 싱글 엔드 시퀀싱 (single-end sequencing) 또는 페어 엔드 시퀀싱(pair-end sequencing)을 진행하여 WTS 정보를 획득하는 단계. 본 발명에 있어서, 상기 (a) 단계의 WTS 정보를 획득하는 단계는 수득한 cDNA를 1백만 내지 1억 5천만 리드 깊 이, 바람직하게는 5백만 내지 1억 리드 깊이, 가장 바람직하게는 평균 9천만 리드 깊이로 whole transcriptome sequencing을 통해 획득하는 것을 특징으로 할 수 있으나, 이에 한정되는 것은 아니다. 본 발명에 있어서, 상기 생체시료는 개체로부터 얻어지거나 개체로부터 유래된 임의의 물질, 생물학적 체액, 조 직 또는 세포를 의미하는 것으로, 예를 들면, 전혈(whole blood), 백혈구(leukocytes), 말초혈액 단핵 세포 (peripheral blood mononuclear cells), 백혈구 연층(buffy coat), (혈장(plasma) 및 혈청(serum)을 포함하는) 혈액, 객담(sputum), 눈물(tears), 점액(mucus), 세비액(nasal washes), 비강 흡인물(nasal aspirate), 호흡 (breath), 소변(urine), 정액(semen), 침(saliva), 복강 세척액(peritoneal washings), 골반 내 유체액(pelvic fluids), 낭종액(cystic fluid), 뇌척수막 액(meningeal fluid), 양수(amniotic fluid), 선액(glandular fluid), 췌장액(pancreatic fluid), 림프액(lymph fluid), 흉수(pleural fluid), 유두 흡인물(nipple aspirate), 기관지 흡인물(bronchial aspirate), 활액(synovial fluid), 관절 흡인물(joint aspirate), 기관 분비물(organ secretions), 세포(cell), 세포 추출물(cell extract), 정액, 모발, 타액, 소변, 구강세포, 태반 세포, 뇌척수액(cerebrospinal fluid) 및 이의 혼합물을 포함할 수 있으나, 이에 제한되는 것은 아니다. 본 발명에서 용어, ”참조집단”은 표준 염기서열 데이터베이스와 같이 비교할 수 있는 기준(reference) 집단으 로, 현재 특정 질환 또는 병증이 없는 사람의 집단을 의미한다. 본 발명에 있어서, 상기 참조집단의 표준 염색체 서열 데이터베이스에서 표준 염기서열은 NCBI 등의 공공보건기관에 등록되어 있는 참조 염색체일 수 있다. 본 발명에 있어서, 상기 (a) 단계의 RNA는 mRNA일 수 있으나, 이에 한정되는 것은 아니다. 본 발명에 있어서, 상기 차세대 유전자서열검사기(next-generation sequencer)는 당업계에 공지된 임의의 시퀀 싱 방법으로 사용될 수 있다. 선택 방법에 의해 분리된 핵산의 시퀀싱은 전형적으로는 차세대 시퀀싱(NGS)을 사 용하여 수행된다. 차세대 시퀀싱은 개개의 핵산 분자 또는 고도로 유사한 방식으로 개개의 핵산 분자에 대해 클 론으로 확장된 프록시 중 하나의 뉴클레오타이드 서열을 결정하는 임의의 시퀀싱 방법을 포함한다(예를 들어, 105개 이상의 분자가 동시에 시퀀싱된다). 일 실시형태에서, 라이브러리 내 핵산 종의 상대적 존재비는 시퀀싱 실험에 의해 만들어진 데이터에서 그것의 동족 서열의 상대적 발생 수를 계측함으로써 추정될 수 있다. 차세대 시퀀싱 방법은 당업계에 공지되어 있고, 예를 들어 본 명세서에 참조로서 포함된 문헌(Metzker, M. Nature Biotechnology Reviews 11:31-46)에 기재된다. 일 실시형태에서, 차세대 시퀀싱은 개개의 핵산 분자의 뉴클레오타이드 서열을 결정하기 위해 한다(예를 들어, 헬리코스 바이오사이언스(Helicos BioSciences)의 헬리스코프 유전자 시퀀싱 시스템(HeliScope Gene Sequencing system) 및 퍼시픽바이오사이언스의 팩바이오 알에스 시스템(PacBio RS system)). 다른 실시형태에 서, 시퀀싱, 예를 들어, 더 적지만 더 긴 리드를 만들어내는 다른 시퀀싱 방법보다 시퀀싱 단위 당 서열의 더 많은 염기를 만들어내는 대량병렬의 짧은-리드 시퀀싱(예를 들어, 캘리포니아주 샌디에고에 소재한 일루미나 인 코포레이티드(Illumina Inc.) 솔렉사 시퀀서(Solexa sequencer)) 방법은 개개의 핵산 분자에 대해 클론으로 확 장된 프록시의 뉴클레오타이드 서열을 결정한다(예를 들어, 캘리포니아주 샌디에고에 소재한 일루미나 인코포레 이티드(Illumina Inc.) 솔렉사 시퀀서(Solexa sequencer); 454 라이프 사이언스(Life Sciences)(코네티컷주 브 랜포드에 소재) 및 아이온 토렌트(Ion Torrent)). 차세대 시퀀싱을 위한 다른 방법 또는 기계는, 이하에 제한되 는 것은 아니지만, 454 라이프 사이언스(Life Sciences)(코네티컷주 브랜포드에 소재), 어플라이드 바이오시스 템스(캘리포니아주 포스터 시티에 소재; SOLiD 시퀀서), 헬리코스 바이오사이언스 코포레이션(매사추세츠주 캠 브릿지에 소재) 및 에멀젼 및 마이크로 유동 시퀀싱 기법 나노 점적(예를 들어, 지누바이오(GnuBio) 점적)에 의 해 제공된다. 차세대 시퀀싱을 위한 플랫폼은, 이하에 제한되는 것은 아니지만, 로슈(Roche)/454의 게놈 시퀀서(Genome Sequencer: GS) FLX 시스템, 일루미나(Illumina)/솔렉사(Solexa) 게놈 분석기(Genome Analyzer: GA), 라이프 (Life)/APG의 서포트 올리고(Support Oligonucleotide Ligation Detection: SOLiD) 시스템, 폴로네이터 (Polonator)의 G.007 시스템, 헬리코스 바이오사이언스의 헬리스코프 유전자 시퀀싱 시스템(Helicos BioSciences' HeliScope Gene Sequencing system) 및 퍼시픽 바이오사이언스(Pacific Biosciences)의 팩바이오 알에스(PacBio RS) 시스템을 포함한다. 본 발명에 있어서, 상기 (b) 단계의 정렬단계는 이에 제한되지는 않으나, STAR 알고리즘 및 Hg19 서열을 이용하 여 수행되는 것일 수 있다. 본 발명에서, 사용한 STAR 알고리즘의 파라미터는 이에 한정되지는 않으나, 아래와 같은 값을 가지는 것을 특징 으로 할 수 있다: --outFilterMismatchNoverLmax 0.05: 매핑된 길이의 불일치 비율이 해당 값 보다 낮은 경우만 출력한다. --outFilterMatchNmin 20: 일치하는 염기 수가 이값보다 큰 경우만 출력한다. --alignIntronMax 0: 최대 인트론 크기를 0로 지정한다. 본 발명에서, 상기 (b) 단계의 정렬단계 수행 후, 획득한 WTS 정보는 bam file 형식인 것을 특징으로 할 수 있 으나, 이에 한정되는 것은 아니다. 본 발명에 있어서, 상기 (c) 단계의 면역세포 수용체 특징을 추출하는 단계는 하기의 단계를 포함하여 수행하는 것을 특징으로 할 수 있다: (c-i) 정렬된 WTS 정보에서 면역세포 수용체의 CDR3(complementary-determining region 3) 아미노산 서열을 추 출하는 단계; 및 (c-ii) 추출된 서열정보를 기반으로 면역 레퍼토리 특성(Immune repertoire properties), V 및 J 유전자 사용 비율(V&J gene usage) 및 CDR3 아미노산 서열의 화학적 특징으로 구성된 군에서 선택되는 하나 이상의 특징을계산하는 단계. 본 발명에 있어서, 상기 면역 레퍼토리 특성(Immune repertoire properties)은 TCR 서열 전체 수(total number of TCR sequences), TCR 서열 고유 수(unique number of TCR sequences), 킬로 리드 당 TCR 클론타입의 수( number of TCR clonotypes per kilo-reads), TCR 엔트로피(entropy of TCR), TCR의 클론성(clonality of TCR), BCR 서열 전체 수(total number of BCR sequences), BCR 서열 고유 수(unique number of BCR sequences), 킬로 리드 당 BCR 클론타입의 수(number of BCR clonotypes per kilo-reads), BCR 엔트로피 (entropy of BCR), BCR의 클론성(clonality of BCR), BCR의 체세포 과돌연변이율(somatic hypermutation rate of BCR sequences) 및 BCR 클러스터 수(number of BCR clusters)로 구성된 군에서 선택되는 하나 이상인 것을 특징으로 할 수 있다. 본 발명에 있어서, 상기 V 및 J 유전자 사용비율(V&J gene usage)은 샘플마다 CDR3 서열 V, J region의 유전자 형(genotype)별 비율일 수 있으며, 바람직하게는 IGH, IGK, IGL, TRA, TRB, TRD, TRG, IGHA1, IGHA2, IGHD, IGHE, IGHG1, IGHG2, IGHG3, IGHG4, IGHGP 및 IGHM로 구성된 군에서 선택되는 2 이상의 유전자형(genotype)의 비율인 것을 특징으로 할 수 있으며, 가장 바람직하게는 상기 17가지 유전자 형의 각 비율을 하기 수식 2로 계 산하는 것을 특징으로 할 수 있다. 수식 2:"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "본 발명에 있어서, 상기 CDR3 아미노산 서열의 화학적 특징은 TCR의 평균길이(mean of length in TCR), TCR의 그레이비 인덱스 평균(mean of gravy index in TCR), TCR 아미노산의 벌키성 평균(mean of bulkiness of amino acids in TCR), TCR 아미노산의 극성 평균(mean of polarity of amino acids in TCR), TCR 아미노산의 전하 평 균(mean of net charge in TCR), TCR 아미노산 중 염기성 아미노산의 비율 평균(mean of fraction of basic amino acids in TCR), TCR 아미노산 중 산성 아미노산의 비율 평균(mean of fraction of acidic amino acids in TCR), TCR 아미노산 중 방향족 아미노산의 비율 평균(mean of fraction of aromatic amino acids in TCR), TCR 아미노산의 지방족성 평균(mean of aliphatic index in TCR), BCR의 평균길이(mean of length in BCR), BCR의 그레이비 인덱스 평균(mean of gravy index in BCR), BCR 아미노산의 벌키성 평균(mean of bulkiness of amino acids in BCR), BCR 아미노산의 극성 평균(mean of polarity of amino acids in BCR), BCR 아미노산의 전하 평균(mean of net charge in BCR), BCR 아미노산 중 염기성 아미노산의 비율 평균(mean of fraction of basic amino acids in BCR), BCR 아미노산 중 산성 아미노산의 비율 평균(mean of fraction of acidic amino acids in BCR), BCR 아미노산 중 방향족 아미노산의 비율 평균(mean of fraction of aromatic amino acids in BCR) 및 BCR 아미노산의 지방족성 평균(mean of aliphatic index in BCR)으로 구성된 군에서 선택되는 하나 이 상인 것을 특징으로 할 수 있다. 본 발명에 있어서, 상기 CDR3 아미노산 서열의 화학적 특징은 TCR의 평균길이(mean of length in TCR), TCR의 그레이비 인덱스 평균(mean of gravy index in TCR), TCR 아미노산의 벌키성 평균(mean of bulkiness of amino acids in TCR), TCR 아미노산의 극성 평균(mean of polarity of amino acids in TCR), TCR 아미노산의 전하 평 균(mean of net charge in TCR), TCR 아미노산 중 염기성 아미노산의 비율 평균(mean of fraction of basic amino acids in TCR), TCR 아미노산 중 산성 아미노산의 비율 평균(mean of fraction of acidic amino acids in TCR), TCR 아미노산 중 방향족 아미노산의 비율 평균(mean of fraction of aromatic amino acids in TCR), TCR 아미노산의 지방족성 평균(mean of aliphatic index in TCR), BCR의 평균길이(mean of length in BCR), BCR의 그레이비 인덱스 평균(mean of gravy index in BCR), BCR 아미노산의 벌키성 평균(mean of bulkiness of amino acids in BCR), BCR 아미노산의 극성 평균(mean of polarity of amino acids in BCR), BCR 아미노산의 전하 평균(mean of net charge in BCR), BCR 아미노산 중 염기성 아미노산의 비율 평균(mean of fraction of basic amino acids in BCR), BCR 아미노산 중 산성 아미노산의 비율 평균(mean of fraction of acidic amino acids in BCR), BCR 아미노산 중 방향족 아미노산의 비율 평균(mean of fraction of aromatic amino acids inBCR) 및 BCR 아미노산의 지방족성 평균(mean of aliphatic index in BCR)으로 구성된 군에서 선택되는 하나 이 상인 것을 특징으로 할 수 있다. 본 발명에 있어서, 상기 (c) 단계의 전사체(transcript) 특징을 추출하는 단계는 암 또는 면역 연관 유전자 발 현 점수(single sample gene set enrichment analysis, ssGESA score) 또는 면역 세포 구성(immune cell composition)을 계산하는 단계를 포함하여 수행하는 것을 특징으로 할 수 있다. 본 발명에 있어서, 상기 암 또는 면역 연관 유전자 발현 점수(single sample gene set enrichment analysis, ssGESA score)는 면역 반응 관련 T 세포 활성화(T cell activation involved in immune response), 선천성 면 역 반응(innate immune response), 선천성 면역 반응 활성화 세포 표면 수용체 신호 경로(innate immune response activating cell surface receptor signaling pathway), 면역 반응에 관여하는 림프구 활성화 (lymphocyte activation involved in immune response), 점막 면역 반응(mucosal immune response), 면역 반 응에 관여하는 자연 살해 세포 활성화(natural killer cell activation involved in immune response), 면역 반응의 음성 조절(negative regulation of immune response), 선천성 면역 반응의 음성 조절(negative regulation of innate immune response), 면역 반응에 관여하는 호중구 활성화(neutrophil activation involved in immune response), 사이토카인의 양성 조절(positive regulation of cytokine), 면역 반응에 관여 하는 생산(production involved in immune response), 면역 이펙터 과정의 양성 조절(positive regulation of immune effector process), 면역 반응의 양성 조절(positive regulation of immune response), 면역 반응의 분 자 매개체 생산의 양성 조절(positive regulation of production of molecular mediator of immune response), 적응 면역 반응의 조절(regulation of adaptive immune response),면역 반응에 관여하는 사이토카인 생산의 조 절(regulation of cytokine production involved in immune response), 체액성 면역 반응의 조절(regulation of humoral immune response), 면역 효과 과정의 조절(regulation of immune effector process), 면역 반응의 조절(regulation of immune response), 선천성 면역 반응의 조절(regulation of innate immune response), 항 원 처리 및 제시(antigen processing and presentation), B 세포 수용체 신호 경로(B cell receptor signaling pathway), 케모카인 신호 경로(chemokine signaling pathway), 보체 및 응고 캐스케이드(complement and coagulation cascades), 세포질 DNA 감지 경로(cytosolic DNA-sensing pathway), Fc 엡실론 RI 신호 경로(Fc epsilon RI signaling pathway), Fc 감마 R 매개 식세포증(Fc gamma R-mediated phagocytosis), 조혈 세포 계 통(hematopoietic cell lineage), IL-17 신호 경로(IL-17 signaling pathway), IgA 생산을 위한 장 면역 네트 워크(intestinal immune network for IgA production), 백혈구 내피 세포 이동(leukocyte transendothelial migration), NOD 유사 수용체 신호 경로(NOD-like receptor signaling pathway), 자연 살해 세포 매개 세포 독 성(natural killer cell mediated cytotoxicity), 호중구 세포 외 트랩 형성(neutrophil extracellular trap formation), 혈소판 활성화(platelet activation), RIG-I 유사 수용체 신호 경로(RIG-I-like receptor signaling pathway), T 세포 수용체 신호 경로(T cell receptor signaling pathway), Th1 및 Th2 세포 분화 (Th1 and Th2 cell differentiation), 톨 유사 수용체 신호 경로(Toll-like receptor signaling pathway), 종 양 괴사인자에 대한 세포 반응(cellular response to tumor necrosis factor), 종양 괴사인자 생산의 음성 조 절(negative regulation of tumor necrosis factor production), 종양 괴사인자 슈퍼 패밀리 사이토 카인 생산 의 음성 조절(negative regulation of tumor necrosis factor superfamily cytokine production), 종양 괴사 인자 매개 신호 경로의 음성 조절(negative regulation of tumor necrosis factor-mediated signaling pathway), 종양괴사인자 생산의 양성 조절(positive regulation of tumor necrosis factor production), 종양 괴사인자 슈퍼 패밀리 사이토카인 생산의 양성 조절(positive regulation of tumor necrosis factor superfamily cytokine production), 종양괴사인자 생산의 조절(regulation of tumor necrosis factor production), 종양괴사인자 매개 신호 전달 경로의 조절(regulation of tumor necrosis factor-mediated signaling pathway), 종양괴사인자에 대한 반응(response to tumor necrosis factor), 종양괴사인자 매개 신호 전달 경로(tumor necrosis factor-mediated signaling pathway), 암의 중심 탄소 대사(central carbon metabolism in cancer), 자궁내막암(endometrial cancer), 암의 PD-L1 발현 및 PD-1 체크 포인트 경로(PD-L1 expression and PD-1 checkpoint pathway in cancer) 및 암의 전사 조절 오작동(transcriptional misregulation in cancer)으로 구성된 군에서 선택되는 하나 이상에 관련된 유전자의 발현 점수(enrichment score)를 계산하는 것을 특징으로 할 수 있다.본 발명에서, 상기 유전자는 상기 경로에 관여하는 유전자면 제한없이 이용 가능하며, 바람직하게는 하기 표 5 에 기재된 경로 별 유전자 그룹에서 선택되는 하나 이상일 수 있으며, 가장 바람직하게는 하기 표 5에 기재된 유전자 모두를 포함하여 계산할 수 있으나, 이에 한정되는 것은 아니다. 본 발명에서, 표 5에 기재된 경로 별 유전자 그룹에서 선택되는 하나 이상이라는 의미는 예를 들어 상기 유전자 가 negative regulation of tumor necrosis factor-mediated signaling pathway에 관여할 경우, 상기 유전자는 ADIPOQ, NLRP2B, GSTP1, CARD8, APOA1, F2RL1, PYDC2, CCDC3, PTPN2, GPS2, PELI3, TRAIP, H2BC11, PYDC1, CARD16, GAS6, ZNF675 및 RFFL로 구성된 군에서 선택되는 하나 이상이라는 것을 의미한다. 표 5 cellular response to tumor necrosis factor (GO:0071356) ACTN4 AKT1 ZC3H12ATNFRSF11BPSMB7 ZFAND6 TNFRSF4TNFRSF18 ACOD1 PSMD1 OCSTAMPCX3CL1 SMPD4 ZFP36L1EIF5A TNFRSF14 PSMB9 PSMD2 INPP5K ANKRD1 IKBKB TNF XCL1 CHUK PSMC6 GBP1 NKX3-1 RIPK1 TMSB4X CIB1 TNFRSF1AAIM2 PSMC4 GBP3 TNFSF11STAT1 PSMB8 FOXO3 TNFRSF1BLTBR PSMC5 GBP2 TNFSF12ERBIN PSMB5 TANK NFKBIA LTB PSMC2 ST18 PSMF1 DAB2IP PSMB6 ZFP36L2TNFRSF21CDIP1 TNFSF4 EDARADDCCL26 PSMA6 HYAL1 PYCARD PYDC1 LTA PSMC3 TNFSF18GSDME PSMA7 PSMB3 ZFP36 XCL2 YBX3 PSMC1 TNFSF15CCL25 PSMA4 HYAL2 HAS2 TNFRSF25TNFSF13B TNFSF9 TNFSF13CCL24 PSMA5 PSMB4 RPS3 CHI3L1 CCL8 TNFSF8 TNFSF14CCL23 ADAM17 PSMB1 TRAF1 NFE2L2 CCL7 TP53 NR1D1 CCL22 PSMA2 HYAL3 TRAF3 EDA CCL5 SFRP1 COMMD7 TNFRSF12APSMA3 PSMB2 TRAF2 PSMD11 CCL4 ASAH1 PSME4 CCL21 PSMA1 CCL19 TRAF5 CXCL8 PTK2B PSMB11 PSME2 CCL20 CACTIN CD58 TRAF6 PSMD10 CCL3 PSMB10 PSME3 SIRT1 CD40LG CCL18 MAP3K14PSMD13 CCL2 PSMD9 PSME1 DCSTAMPCCL15 CCL17 CARD14 PSMD12 CCL1 CRHBP TDGF1 ARHGEF2CCL14 JAK2 BIRC2 CCL3L1 ADAMTS7 PSMD7 PID1 CD27 CCL13 CCL16 BIRC3 PSMD14 PSMD8 TNFRSF6BLIMS1 GBA NPNT CCL4L1 ILK PSMD5 GATA3 CD40 CCL11 CD70 HMHB1 TRADD PSMD6 EDA2R TNFRSF11ATNFRSF13CEDAR BAG4 ADAMTS12 PSMD3 TXNDC17DHX9 TNFRSF13BRELA TNFRSF8GPER1 PSMD4 TCL1A BRCA1 PSMA8 PLVAP TNFRSF9TNFRSF17 negative regulation of tumor necrosis factor production (GO:0032720) ADIPOQ LILRB1 POMC BPI SLAMF1 PTPN22 ZC3H12ALGALS9 IL10 NR1H4 MC1R GHRL ORM1 LILRA4 IRAK3 CD34 IL37 DEFB114SELENOSCACTIN CHRNA7 CX3CL1 SIRPA GHSR ARG2 IGF1 SYT11 PTPN6 GSTP1 NLRC3 LBP CD33 NFKBIL1CIDEA CLEC4A GAS6 C5AR2 VSIR TRIM27 DICER1 IL4 RARA TLR4 TNFAIP3ILRUN HAVCR2 negative regulation of tumor necrosis factor superfamily cytokine production (GO:1903556) ADIPOQ LILRB1 POMC BPI TLR4 C5AR2 VSIR TRIM27 IL10 NR1H4 MC1R GHRL SLAMF1 TNFAIP3ILRUN HAVCR2 IL37 DEFB114SELENOSCACTIN CD274 PTPN22 ZC3H12ALGALS9 ARG2 IGF1 SYT11 LTF ORM1 LILRA4 IRAK3 CD34 NFKBIL1CIDEA CLEC4A PTPN6 CHRNA7 CX3CL1 SIRPA GHSR DICER1 IL4 RARA GAS6 GSTP1 NLRC3 LBP CD33 negative regulation of tumor necrosis factor-mediated signaling pathway (GO:0010804) ADIPOQ NLRP2B GSTP1 CARD8 APOA1 F2RL1 PYDC2 CCDC3 PTPN2 GPS2 PELI3 TRAIP H2BC11 PYDC1 CARD16 GAS6 ZNF675 RFFL positive regulation of tumor necrosis factor production (GO:0032760) ARFGEF2IL1A TLR9 NOD2 HAVCR2 HLA-E TWIST1 IL12B CCR2 TLR2 ARHGEF2CLU IL33 IL17A LILRA2 PLCG2 MMP8 CD2 PF4 PTPRJ DDX58 MAVS AGER CD14 SPHK2 TLR1 TLR4 HSPB1 IFNGR1 FRMD8 LILRA5 CCL19 WNT5A PTPRC TLR3 PYCARD FZD5 ORM2 IFIH1 LGALS9 PTPN11 IL6 TMEM106ASPN SYK ORM1 C1QTNF4EPHB2 AZU1 OAS2 APP CLEC7A STAT3 SETD4 DDT JAK2 OAS1 IL23A DHX9 LBP MIF LPL RASGRP1 TYROBP OAS3 LY96 FADD TIRAP THBS1 TNFRSF8 ISL1 IFNG HMGB1 RIPK1 CYBA PSEN1 CCL3 positive regulation of tumor necrosis factor superfamily cytokine production (GO:1903557) ARFGEF2IL1A TLR9 LY96 FADD TIRAP LPL DDT CCR2 TLR2 ARHGEF2HMGB1 RIPK1 CYBA BCL10 RASGRP1 MMP8 CD2 ADAM8 NOD2 HAVCR2 HLA-E THBS1 TNFRSF8 SPHK2 TLR1 PF4 CLU IL33 IL17A PSEN1 CCL3 WNT5A PTPRC TLR4 PTPRJ DDX58 MAVS TWIST1 IL12B PTPN11 IL6 TLR3 HSPB1 IFNGR1 FRMD8 LILRA2 PLCG2 AZU1 OAS2 TMEM106APYCARD FZD5 IL17F AGER CD14 OAS1 IL23A APP SPN SYK ORM2 LILRA5 CCL19 TYROBP OAS3 CD86 CLEC7A STAT3 ORM1 IFIH1 LGALS9 ISL1 IFNG DHX9 LBP MIF SETD4 C1QTNF4EPHB2 JAK2 regulation of tumor necrosis factor production (GO:0032680) WNT5A NOD2 C5AR2 MMP8 ARHGEF2SPN NFKBIL1THBS1 DICER1 CLU PSEN1 SPHK2 RARA CLEC7A NR1H4 LILRA2 CIDEA PYCARD TWIST1 LILRB1 GAS6 IRAK3 DEFB114LILRA4 TYROBP ZFP36 AGER PTPN11 TLR4 LBP IL17A VSIR ISL1 GHSR C1QTNF4AZU1 TLR3 FADD POMC LILRA5 FOXP1 DDX58 RASGRP1OAS1 TMEM106ARIPK1 SYT11 IFIH1 CD2 FZD5 ZC3H12AIL1A DHX9 HAVCR2 BPI DDT IL23A MIF SIRPA TLR2 TNFAIP3CD34 GHRL CCL3 SELENOSTIRAP TNFRSF8TLR1 PTPN22 CD33 CACTIN TRIM27 MAPKAPK2IGF1 IL12B IL4 LY96 ADIPOQ CD47 CCL19 CLEC4A CYBA PLCG2 PTPRC HMGB1 IL33 LTF EPHB2 PF4 HLA-E CD14 IL6 PTPRJ IFNGR1 ORM2 JAK2 PTPN6 MC1R LGALS9 OAS2 CX3CL1 IL37 ORM1 SLAMF1 MAVS ARFGEF2OAS3 NLRC3 SYK SETD4 APP FRMD8 CCR2 IFNG HSPB1 ARG2 CX3CR1 CHRNA7 LPL IL10 TLR9 ILRUN STAT3 GSTP1 regulation of tumor necrosis factor-mediated signaling pathway (GO:0010803) PTPN2 MADD TAX1BP1HSPA1B RNF31 CASP1 LAPTM5 BIRC2 NLRP2B CYLD PYDC2 PRKN PYCARD RIPK1 TRAF2 BIRC3 SPHK1 APOA1 RBCK1 GPS2 CASP8 RFFL TRAIP SPPL2B CFLAR OTULIN CCDC3 TRADD SHARPINADIPOQ CLIP3 GSTP1 CARD8 H2BC11 UBE2K SPATA2 CASP4 SYK ADAM17 PELI3 HIPK1 HSPA1A GAS6 TNFAIP3CPNE1 CHUK F2RL1 SPPL2A TNFRSF1APYDC1 ZNF675 TNF FADD TRAF1 CARD16 IKBKB RACK1 IKBKG response to tumor necrosis factor (GO:0034612) NPNT HAS2 NUB1 CCL23 CCL3L1 IGBP1 SMPD4 CCL18 ACOD1 AKT1 TCL1A CCL22 TNFRSF11AMAP4K3 IKBKB CCL17 ADAM9 GBP1 ZC3H12ACCL21 DHX9 GCH1 HYAL1 ADAMTS7 RELA RPS3 BAG4 CCL20 YTHDC2 CHUK CCL8 JAK2 ZFAND6 GBP3 UBD XCL1 TRADD ADAM10 HYAL2 CCL16 ZFP36L1GBP2 OCSTAMPSPHK1 BRCA1 ERBIN CCL7 CIB1 GGT5 INPP5K SIRT1 CX3CL1 DAB2IP HYAL3 SFRP1 GGT7 NKX3-1 TNFRSF21ADAMTS12CACTIN SMPD1 ASAH1 NR1D1 GGT2 DCSTAMPAFF3 TRIM32 CCL5 TANK SELE GGT1 XCL2 CASP8 CCL15 CCL4 CXCL16 TDGF1 MAP2K7 ARHGEF2GPER1 CCL14 CCL3 ZFP36L2PID1 CCL26 CHI3L1 CASP3 CCL13 CCL2 CRHBP CCL4L1 GSDME NFE2L2 ANKRD1 GBA CCL1 PYCARD HMHB1 CCL25 CXCL8 RIPK1 CCL11 CCL19 ZFP36 GATA3 CCL24 CD40 ADIPOQ YBX3 CD58 tumor necrosis factor-mediated signaling pathway (GO:0033209) ACTN4 RELA PSMD1 TRAF6 TNFRSF9PSMD11 STAT1 LTA CD70 PLVAP PSMD2 PSME2 TNFSF12PSMD10 CHUK CD40LG PSMB9 TNF ST18 PSME3 PSMF1 PSMD13 PSMA6 TNFRSF13C EDAR FOXO3 EDARADDPSME1 TNFRSF4CD40 PSMA7 TNFRSF13B PSMC6 PSMB11 TNFSF18MAP3K14EIF5A PSMD12 AIM2 TNFSF13B PSMC4 PSMB10 TNFSF15CARD14 TNFRSF12ATNFRSF11APSMA4 PSMA8 PSMC5 PSMD9 TNFSF13BIRC2 TNFRSF1APSMD14 PSMA5 PSMB7 PSMC2 PYCARD TNFSF14BIRC3 TNFRSF1BILK ADAM17 IKBKB TNFSF4 PSMD7 TRAF1 TNFRSF6BNFKBIA TRADD LTBR TMSB4X PSMC3 PSMD8 TRAF3 EDA2R PYDC1 TNFRSF11BPSMA2 PSMB8 PSMC1 PSMD5 TRAF2 TXNDC17CD27 TNFRSF17PSMA3 PSMB5 TNFSF9 PSMD6 COMMD7 BAG4 LIMS1 TNFRSF18PSMA1 PSMB6 TNFSF8 PSMD3 TRAF5 TNFRSF8TNFRSF25RIPK1 LTB PSMB3 TP53 PSMD4 PSME4 TNFSF11EDA TNFRSF14CDIP1 PSMB4 PSMB1 PSMB2 PTK2B JAK2 T cell activation involved in immune response (GO:0002286) IFNA14 SLC11A1IFNW1 IFNK IFNA8 IFNA4 MDK CD74 IFNA17 IFNE IFNA10 IFNA7 ITGAL IFNB1 TNFSF18EIF2AK4LCP1 IFNA6 IFNA2 CD1C FCER1G IFNA16 LILRB1 F2RL1 IFNA5 IFNA1 ICAM1 IFNA21 innate immune response (GO:0045087) KRT1 APOBEC3GLYN ZDHHC11DEFA1 CRISP3 TRIM51 SHFL CHGA KIR2DS1DEFB104ASTING1 TYROBP FCN3 DDX3X TRIM34 MX1 KIR2DS2SIGLEC16RNASE3 MID2 CALCOCO2TRIM64CTRIM35 PML SLC11A1SIGLEC15DEFB106AANKHD1 ANKRD17SHMT2 NRROS POLR3A KIR2DS4SIGLEC14RNASE2 CXCL10 NCF2 HMGB1 CRP IFI27 KIR2DS5CARD9 HCK CLEC4D PHB NLRC5 COLEC12 OTULIN PTK6 SFTPD IGLL5 CLEC4E CORO1A TREM1 SRC SLPI SRPK1 TLR2 IGLL1 CAPZA2 AGER ADAR COLEC11 TRIM14 HLA-E NCR2 ADAM15 CD300E CLEC5A TREM2 KIR3DS1 TRIM15 SRPK2 BST2 TTC4 S100A7 UBD SIRPB1 COLEC10 TRIM17 PTK2 CYLD PPARG CAPZA1 TNK1 INAVA TRIM31 TRIM10 BPIFB1 KRT16 TRIML1 KLRD1 PI3 TKFC PLA2G1B ALPK1 TREML1 CFHR5 SAA1 NCF1 KLRC2 CD300LBCX3CR1 TRIM11 VNN1 TLR9 TRIML2 RNF187 TRIM68 IRAK1 PIK3CD TRIM13 BPIFB3 REL MSRB1 FRK TRIM61 LBP PIK3CG WFDC13 BTK TLR8 APCS FCN1 TRIM62 TRIM48 MALT1 AKAP1 WFDC10BTLR4 PGLYRP4RELA TRIM64 TRIM49 H2BC21 APP WFDC10ATLR3 PGLYRP3MASP1 TRIM60 TRIM43 DHX58 CYBC1 APOBEC3ACD40 ZDHHC1 SLA IFNLR1 CIITA KYNU WFDC12 CFB CITED1 DEFB127RNF39 IRAK4 CR1 TRIM25 WFDC11 WFDC9 MEFV IFIH1 IFI6 APOA4 PPP1R14BPTK2B IFITM2 CFD JCHAIN IKBKB DEFB1 OAS1 TRIM43BTRIM26 IFITM3 PHB2 TRIM8 RNF135 RELB PJA2 TRIM40 TRIM27 SP100 IL23R CLEC7A SMPD1 CXCL16 IL4 CR2 TRIM28 CLPB BCL10 TRIM5 DMBT1 NLRP9 FES STYK1 FYN IFITM1 WFDC2 TRIM6 RNASE8 NLRP1 FER CHUK NOS2 TIFA WFDC5 TRIM4 H2BS1 DDX58 IRF5 S100B TRIM21 NOD2 CFP RIPK2 IKBKG TNK2 H2BC10 IRGM TRIM22 IFNL1 IFIT1 TRIM49CPGLYRP2CYBB MFAP4 FGR MBL2IFNL3 WFDC3 TRIM49BPGLYRP1CYBA H2BC11 ZAP70 IFNL2 C3 FCER1G SETD2 ISG15 H2BC12 LCK B2M NUB1 CAMP CD74 MFHAS1 TRIM58 ANG APOL1 CYP27B1DEFB119DEFA5 MYD88 PYDC1 TRIM38 IFNL4 BPIFA1 SYK RARRES2MAVS TRIM59 BPI SNCA TBK1 GCH1 DEFA6 CLEC6A IRF7 PTX3 S100A12RPL39 DEFB118F12 LCN2 SERINC3MASP2 YES1 TRIM49D1RNASE7 DEFA3 TRIM77 TRIM56 TRIM39 SRMS PLCG2 RNASE6 DEFA4 FCN2 SERINC5TRIM32 APOBEC3FSKP2 DEFB114ATAD3A BLK TRIM64BLTF innate immune response activating cell surface receptor signaling pathway (GO:0002220) FBXW11 KLRD1 PSMD8 CREBBP MUC20 PRKACB SYK RPS6KA5 TYROBP PSMC1 PAK1 CARD11 TAB1 SKP1 CHUK PSMB7 MUC3A RAF1 PSMD5 PRKCD MUC21 PRKACA PDPK1 IKBKB MUC3B FCN1 PSMD6 MUC17 BCL10 MUC12 PSMA6 PSMB8 PSMB9 RELA PSMD3 KIR2DS2ICAM3 LYN PSMA7 PSMB5 CLEC4C CLEC10APSMD4 MUC19 CUL1 CARD9 PSMA4 PSMB6 PSMC6 RELB PSMD1 NFKB1 ICAM2 MUC5AC PSMA5 PSMB3 CLEC4D PSMB11 PSMD2 CLEC6A PRKACG PSMD11 PSMA2 PSMB4 CLEC4E PSMB10 MUCL1 PSME4 MUC13 PSMD10 PSMA3 PSMB1 PSMC4 PSMD9 MAP3K7 TRAF6 MUC15 PSMD13 PSMA1 EP300 PSMC5 MUC1 MUC4 PSME2 PSMF1 PSMD12 KRAS PSMB2 PSMC2 NRAS PAK3 PSME3 KLRC2 PSMD14 SRC HRAS CD209 MUC2 BTRC TAB3 FFAR2 CLEC7A LILRA2 FYN PSMC3 PSMD7 MUC6 TAB2 PLCG2 FCER1G PSMA8 IKBKG CLEC4A PAK2 MUC7 PSME1 MUC16 MUC5B MALT1 lymphocyte activation involved in immune response (GO:0002285) IFNA6 CD74 IFNA2 IFNA17 CD1C MDK F2RL1 IFNA21 IFNA5 IFNA8 IFNA16 IFNA4 IFNW1 LCP1 IFNB1 IFNA10 IFNA14 IFNA7 IFNA1 EIF2AK4IFNE GPR183 IFNK CD244 mucosal immune response (GO:0002385) DEFA5 IFNLR1 RNASE2 H2BC11 PLA2G1BIFNL2 FFAR2 DEFA6 DEFA1 BPIFB1 H2BC12 PIGR H2BC21 NOS2 DEFA3 APOA4 IL4 RAB17 OTUD7B FFAR3 H2BS1 DEFA4 RNASE3 H2BC10 LTF DEFB1 RPL39 CAMP natural killer cell activation involved in immune response (GO:0002323) IFNA6 IFNA14 IFNA7 IFNA16 IFNA17 CORO1A IFNE KLRF2 IFNA5 IFNA8 IFNA2 IFNA1 IFNA4 IFNW1 VAMP7 VAMP2 IFNB1 IFNK IFNA21 IFNA10 CD244 negative regulation of immune response (GO:0050777) SPINK5 ADCY5 PRKAR1ACALCR SIRT2 ADRB3 GLP2R PTH CD163 ADCY4 RLN3 LGALS3 MC3R CD3G GPR32 GPHA2 CD300A ADCY3 RLN2 HTR7 FCGR2A NLRC3 SCTR FURIN RC3H1 ADCY2 HLA-DRB1GPR176 COL3A1 TREM2 GIP PTGER2 MUL1 ADCY9 CRHR1 PRKAR2BFCGR2B ILRUN PTH2R TRAF3IP1 ACOD1 ADCY8 CALCRL PCBP2 IL6 MC2R ITCH GPR45 GCG ADCY7 CALCB PRKAR2AFER FCGR3A HCK PTGER4 TAAR1 ADCY6 SPI1 PLCG1 ADORA2BHRH2 TSHR NPS FOXP3 GNG2 LHB PLCG2 ADORA2AIRAK3 ADCYAP1FCGR1A MAPK14 IFNL1 CALCA PRKACB FSHR C1QBP FGR DHX58 IAPP CYSLTR2MAPKBP1CGA MYH9 DRD1 PTHLH MC4R TRAFD1 CYSLTR1GPR84 GGT1 CD247 HAVCR2 POMC ENPP3 ADM2 IFI16 RXFP1 PRKACA GIPR LYAR PPM1B TRIM27 DPEP1 GPR150 SAMSN1 CCR2 GPR27 DRD5 ADAM17 FYN PDCD1 PTGDR HTR6 LYN GPR25 NPSR1 MC5R TRIM21 GPHB5 YES1 RXFP2 GPR15 GLP1R RHBDF2 GHRH INSL3 VIP GGT5 ADCYAP1R1IL10 ALOX15 GPR39 TYRO3 TSHBSCT PLK2 GPR83 AVPR2 TNFAIP3CR1 CRH RAMP3 HLA-G CRHR2 FSHB GPR20 LHCGR AVP VIPR2 CREB1 HTR4 AMBP ADM P2RY11 CACTIN ADCY1 MC1R FCRLB GPBAR1 ADRB1 PTGIR RAMP1 VIPR1 GNB1 GHRHR NMI PTH1R SYK RAMP2 PTH2 PRKAR1BPRKACG LILRB1 ADRB2 RNF26 SRC negative regulation of innate immune response (GO:0045824) CR1 FAM3A ISG15 SERPING1GRN DCST1 IFI16 A2M PTPN2 METTL3 OAS1 TYRO3 TNFAIP3NLRC3 DHX58 TRIM21 YTHDF2 NMI CNOT7 TTLL12 NLRC5 SAMHD1 SUSD4 LYAR YTHDF3 MUL1 OAS3 CACTIN USP18 RPS19 SLAMF8 STAT2 ACOD1 TRAFD1 USP15 INS IRAK3 VSIG4 neutrophil activation involved in immune response (GO:0002283) UNC13D FUCA1 OLR1 RAB44 ITGAX DERA ORM1 C5AR1 ARMC8 GSDMD GSN GLIPR1 ITGAV BST2 GDI2 COPB1 MCEMP1 ANXA2 IST1 MMP25 PGM2 CEACAM3FAF2 SLC2A3 SCAMP1 ANXA3 AGL CLEC5A PGM1 PTPRC CAB39 PSEN1 FLG2 JUP AOC1 TXNDC5 PTPRN2 RAP2B AP2A2 PLAU DYNC1LI1FUCA2 DEFA4 TOM1 KRT1 BST1 LILRA2 SRP14 GALNS NFAM1 DEFA1 TMEM179BNBEAL2 CEACAM1LILRA3 SLC2A5 TOLLIP AZU1 ATP11B GYG1 MAPK14 RAP2C CST3 CNN2 PSMC2 TMC6 ILF2 SLC15A4CRISPLD2CEACAM8CXCR2 ADGRG3 PSMC3 LYZ ATP11A ACTR2 SLPI PTPRB CXCR1 ALDH3B1 HSPA1A SIGLEC5TICAM2 HSP90AA1TMEM63ACEACAM6STBD1 SIRPA GLA SIGLEC9CLEC4C APAF1 STXBP2 ALDOC RAC1 ACAA1 NHLRC3 GPI CLEC4D PA2G4 FGL2 ACTR10 ENPP4 HGSNAT CDK13 PAFAH1B2RAB31 NDUFC2 STXBP3 ALDOA CD59 MMP8 CDA SERPINA3OLFM4 TNFRSF1BPRCP RAB7A CCT8 HSPA6 HSPA1B SERPINA1RAB37 TMBIM1 CALML5 RAB5C SPTAN1 GGH PRSS2 FPR2 S100A7 DNAJC3 PNP SLC44A2CD58 HSPA8 CYFIP1 FPR1 ARL8A FCGR2A CPNE1 HBB CD55 CMTM6 PDXK LRRC7 ADAM8 NPC2 CPNE3 CTSZ TBC1D10CMMP9 C3AR1 IQGAP1 DSC1 DNAJC5 B2M PTPRJ LAIR1 ADA2 FRMPD3 IQGAP2 PTPN6 DSG1 ARSA CTSS CHRNB4 DNASE1 RETN TIMP2 PKP1 PECAM1 ARSB DSN1 CD300A MAN2B1 ASAH1 AP1M1 S100A9 VPS35L XRCC5 ACTR1B GCA MS4A3 CRACR2ADYNLL1 GHDC SNAP25 STK11IPRAP1A IRAG2 DOCK2 PSMD7 SERPINB3S100A8 SNAP23 SURF4 RAP1B PDAP1 CHI3L1 PSMD6 ARG1 FRK UBR4 SLC11A1MAGT1 HUWE1 PSMD11 PSMD3 AHSG CD177 FCGR3B XRCC6 ORMDL3 TYROBP B4GALT1 ALOX5 DGAT1 SLC27A2ALAD COMMD3 NEU1 ATAD3B PSMD13 PSMD1 PGAM1 ROCK1 PSAP PRG3 MLEC OSCAR DDX3X STOM SERPINB1HP ACP3 PPBP QSOX1 EEF1A1 PSMD12 PSMD2 ADAM10 EPX CEP290 RAB27A CTSH PPIA PSMD14 NCSTN STING1 APEH SNAP29 MIF CTSG DOK3 TNFAIP6 PRSS3 LRG1 NRAS CR1 HLA-C FCER1G DEGS1 MOSPD2 S100A12RNASE3 PYCARD DSP PRG2 CD36 CD68 HMGB1 S100A11RNASE2 LAMP2 RNASET2HLA-B CTSD YPEL5 CXCL1 ELANE TUBB4B LAMP1 CPPED1 VAT1 CAMP PPIE AGPAT2 PRKCD SERPINB6RAB24 PKM VNN1 CD33 FCN1 PLD1 ATP6AP2ERP44 KCMF1 CHIT1 CSNK2B CTSC MPO HK3 NCKAP1LFABP5 RAB4B KPNB1 CYSTM1 RAB6A ARHGAP45SIRPB1 HRNR PSMA5 TRAPPC1NFASC MGST1 CD53 COTL1 HEBP2 VAMP7 PSMA2 ATP8B4 PFKL TRPM2 CAP1 CAPN1 SYNGR1 VAMP8 SLCO4C1ARPC5 RAB10 COMMD9 CCT2 OSTF1 ADGRE3 BIN2 LAMTOR1KCNAB2 TSPAN14LGALS3 DBNL IDH1 DPP7 TCN1 PLEKHO2EEF2 VAPA ANPEP MME MGAM ADGRE5 VAMP2 LAMTOR3C6ORF120IMPDH1 FTH1 SYK IGF2R TMEM30APADI2 LAMTOR2NFKB1 IMPDH2 CD14 GAA ATP6V0CPLAUR CFD SERPINB12ACLY P2RX1 GOLGA7 CREG1 MANBA FGR GMFG GRN DDOST RAB14 ATP6V0A1QPCT CD93 GLB1 GNS PIGR HPSE MNDA CTSB PGRMC1 DNAJC13CAT A1BG PYGB LCN2 BPI CTSA ANO6 CYBB S100P ABCA13 PTAFR NIT2 RAB18 RHOA SVIP CYBA PTX3 CFP SERPINB10FTL FOLR3 PTGES2 APRT SDCBP DYNLT1 C3 HEXB RAB5B ITGB2 SIGLEC14RAB9B CKAP4 LTF PRDX4 GSTP1 RAB3D CANT1 TUBB CD47 DIAPH1 CLEC12A CYB5R3 PYGL RAB3A HSP90AB1RHOF DNASE1L3TARM1 MVP PRDX6 LPCAT1 ARHGAP9TCIRG1 LILRB2 DNASE1L1SELL CAND1 PLAC8 PSMB7 ATP8A1 ITGAM AMPD3 DYNC1H1PRTN3 MAPK1 NAPRT PSMB1 BRI3 ITGAL LILRB3 CD44 VCL GUSB HMOX2 METTL7AHVCN1 FCAR RHOG ORM2 CRISP3 LTA4H AGA GPR84 TTR NME2 CSTB ATP6V1D ATG7 PGLYRP1STK10 GM2A TLR2 CD63 VCP positive regulation of cytokine production involved in immune response (GO:0002720) FZD5 WNT5A TRAF2 SLC7A5 TNFSF4 NOD2 CLEC7A PLCG2 XCL1 LAPTM5 HLA-G RAET1G TRAF6 KIR2DL4TRIM6 B2M CD160 HLA-A HLA-E KIT F2RL1 MALT1 FFAR3 MAP3K7 SPHK2 SCIMP HLA-F LACC1 CD226 INAVA FFAR2 TNFRSF14 CD55 positive regulation of immune effector process (GO:0002699) CCR2 IL2 IL23A CD46 CD81 DDX60 DHX58 LGALS9 IL10 USP17L2TNFSF4 HLA-DRB1PHB HLA-DMBLBP PCK1 XBP1 IL1B IFNG ANKRD17PLA2G5 MYB MYO18A IL12RB1 LILRB1 PTPRC HLA-DRAIL23R PTPRJ RPS19 IL12B APPL2 positive regulation of immune response (GO:0050778) AKIRIN2EIF2AK4POLR3C IFNK FPR2 STX4 NLRP10 PLA2G1B CD74 NMI IL23A ADAM8 NOD2 PCK1 F2RL1 IL23R SIGLEC16LILRB1 POLR3D IL6ST IFNL1 IL12RB1CD226 IFI35 TASL SIRT1 TNFSF4 SKAP1 PYCARD GBP5 ZP4 ITGAM TGFB2 EREG POLR3F HRG MYB SASH3 CD46 CD1D IL10 IL2 IFNG CD177 GPR151 XBP1 ZP3 HLA-DMB IL15 PTPRC POLR3G DHX9 NLRP3 SH2D1B HLA-DRB1CCL5 SPHK2 FCGR2B HLA-DRACD81 FADD CYBA ITGB2 IFNB1 RSAD2 POLR3B TLR8 KARS1 CCR7 PLSCR1 GRN IL12B RIOK3 SLC15A4LGALS9 positive regulation of production of molecular mediator of immune response (GO:0002702) IL10 LAPTM5 PTPRC CLCF1 CD244 PHB FFAR3 EPHB2 XBP1 SCIMP IL6 F2RL1 MZB1 PTPN22 DNAJB9 TNFRSF14 XCL1 HLA-E RBP4 TLR9 CD86 NOD2 FFAR2 SASH3 SPHK2 IL2 LACC1 VAMP3 PHB2 INAVA STX4 WNT5A SLC7A5 TNFSF4 GPI IL21 TRIM6 TNFRSF4 regulation of adaptive immune response (GO:0002819) RIPK3 AHR ADCY7 IRF1 FADD IL6ST ALOX15 SIRT1 IL4I1 FCGR2B TRIM27 SKAP1 EIF2AK4SAMSN1 PYCARD TNFSF4 IRF7 SASH3 regulation of cytokine production involved in immune response (GO:0002718) CCR2 WNT5A LAPTM5 TNF INAVA APOA1 CLC FFAR2 IL10 TRIL APOA2 SCIMP SLC7A5 LACC1 BTK TNFRSF14 SPHK2 LILRB1 NOD2 TNFRSF1BTRIM6 F2RL1 FFAR3 TRPM4 regulation of humoral immune response (GO:0002920) CFHR1 CD81 C8B CR1 CFB CFI VTN C7 FCGR2B C3AR1 C4A CR2 C1QC C5AR1 C2 C9 CXCL13 PROS1 C8G F2 C1QB CFH CPN2 CD19 CFHR2 C4BPA C4B SERPING1C1QA C1S C3 CD59 CR1L C8A C1QBP ZP4 PHB2 C5AR2 CPN1 CD55CFHR5 CLU SUSD4 CD46 C1R GATA6 C5 CFHR4 C4BPB CCR7 ZP3 CPB2 CFP C6 regulation of immune effector process (GO:0002697) ZNF683 CFHR4 CLU SUSD4 HLA-DRB1CFI C2 C9 CFHR1 HLA-DRAC4BPB CR1 C1QC C5AR1 CPN2 CD19 FCGR2B CD81 C8B CR2 C1QB CFH C3 CD59 IRF4 C3AR1 C4A F2 C1QA C1S CPN1 CD55 CFHR2 PROS1 C8G SERPING1PHB2 C5AR2 C5 CR1L C4BPA C4B CD46 C1R CFP C6 CFHR5 C8A C1QBP CFB CPB2 VTN C7 regulation of immune response (GO:0050776) SPINK5 CLEC4G HLA-C COL17A1ITGA4 SIGLEC9CD300LDKLRF1 TGFB2 CD200 TIRAP C17ORF99RIPK3 FCGR2C MADCAM1NECTIN2 LAG3 IFITM1 TRAF3 SPPL2B SFTPD SIGLEC7FCER1A ITGB2 CD300A FGL1 HLA-A SPPL2A AMBP CD22 CD300LFITGB1 CD160 CD81 HLA-B ICAM3 PILRA CD40 CD300LGCOLEC12 CRTAM PVR HLA-G ICAM4 LILRB1 DENND1BCD34 PLA2G1B RSAD2 AHR HLA-E ICAM5 LILRB2 PTPN22 CD33 LILRA1 TYROBP ADCY7 HLA-F CD1D PILRB KIR2DL1CXADR ITGAL VCAM1 LRP8 TREML2 CD1C CD200R1CD3G PIANP SAMHD1 FOXP3 IFNL1 RAET1E ICAM1 NCR2 KIR2DL2SYK RNF135 COL1A2 HERC5 COL2A1 CD1B IL4 TREM1 ERAP1 FCGR1A FOXP1 GPR151 TREML1 SLA2 IRF1 KIR2DL3ELMOD2 DHX58 OSCAR SLAMF7 PLSCR1 ICAM2 NCR3 CD3E KIR3DL1CSK COL1A1 SLAMF6 CD8B C3 FCGR2A TREM2 NCR3LG1ITGB7 CXCL13 B2M CD8A CD1A COL3A1 KIR2DL4KIR3DL2APPL1 TNFSF4 MICA TREML4 FCRLB FCGR2B ZMPSTE24FGR LAIR2 JAML MICB SELL IL4I1 IRF4 CD3D FKBP1A LAIR1 CD300E N4BP1 GPR108 KLRK1 BCL6 SPN CLEC2B APPL2 KLRD1 CD96 KLRB1 CD19 NCR1 FCGR3A XIAP CD300C KIR2DS1BIRC2 KLRC1 HLA-DRACASP8 CD226 ULBP1 KIR2DS2BIRC3 CD99 HCST FCGR3B CLEC2D PDCD1 SH2D1A HLA-DRB1LYN IRF7 TKFC CD40LG ULBP3 SH2D1B CD276 IL15 CD247 CD300LBNPDC1 regulation of innate immune response (GO:0045088) PTPN1 IRF1 TLR8 NLRC3 LYAR PLSCR1 ABCE1 DHX58 AKIRIN2FCGR2B IFNK TREM2 N4BP1 CDC37 RNASEL CCL5 TASL POLR3B ADAM8 LRP8 ERAP1 XIAP HSP90AB1IFNB1 NMI POLR3C PTPN6 CASP8 SH2D1B TYRO3 IFI35 RIOK3 MUL1 POLR3D DHX9 TKFC TIRAP CACTIN USP18 SLC15A4 PTPN11 TRAFD1 TNFAIP3IRAK3 HLA-E BIRC2 CD1D TRIM21 ACOD1 POLR3F FPR2 IFI16 PARP9 BIRC3 SAMHD1 APPL1 EREG POLR3G PTPN22 GBP5 FGR IFNAR2 RNF135 APPL2 Antigen processing and presentation CTSB TAP2 KLRD1 B2M NFYB KIR3DL2CD8A HSP90AB1 CD74 HSPA4 CALR HLA-DOBKIR2DS2HLA-A CANX IFI30 HSP90AA1TAP1 HSPA1B KIR2DL5ANFYC HLA-B LGMN HLA-DMB KLRC3 TAPBP TNF CIITA KIR2DS3KIR3DL3PSME2 HLA-DPA1 HSPA6 CD4 KIR2DL1HLA-DQA2KIR2DS4HLA-G PSME3 KLRC1 HSPA5 RFX5 KIR2DL2HLA-DOAKIR2DS5HLA-E HLA-DPB1KLRC2 HSPA1L IFNG KIR2DL3HLA-DQA1HLA-C HLA-F PSME1 NFYA KLRC4 HSPA1A KIR2DL4PDIA3 RFXANK CREB1 HLA-DRB4HLA-DMA HSPA8 HLA-DRACTSS HLA-DRB5KIR3DL1CD8B HLA-DRB3 HSPA2 HLA-DQB1CTSL KIR2DS1CD8B2 RFXAP HLA-DRB1 B cell receptor signaling pathway LYN LILRB4 SOS2 PIK3R3 BLNK PIK3R1 LILRA3 PPP3R2 JUN VAV1 PTPN6 INPPL1 CARD11 BTK LILRA4 CD79A CD72 LILRB5 NFKBIE PIK3R2 MAP2K2 KRAS DAPP1 CD19IGH VAV2 RAF1 PPP3CA CR2 GRB2 LILRA5 MAPK3 NFATC3 VAV3 CD22 NRAS SYK PIK3AP1LILRA6 RAC3 LILRB1 NFKBIB SOS1 PPP3CB MAP2K1 BCL10 MALT1 RAC1 LILRB2 NFKBIA RELA PPP3CC CHUK PIK3CD INPP5D MAPK1 NFATC2 FCGR2B GSK3B AKT3 FOS LILRA1 IKBKB HRAS NFATC1 PIK3CB IFITM1 AKT1 PRKCB LILRA2 PPP3R1 RAC2 LILRB3 PIK3CA CD81 AKT2 NFKB1 RASGRP3CD79B PLCG2 IKBKG Chemokine signaling pathway BAD GNG2 PIK3R1 CCR1 CCL27 GRK1 PLCB4 CXCR1 CXCL10 CRKL GNB3 CCL24 CXCL8 RAP1A CRK ARRB1 CXCL11 NRAS GNB2 CCL23 SHC3 GRK4 KRAS CCL7 CXCL12 GNG4 GNAQ CCL22 GSK3B RAP1B PLCB2 CXCR4 CXCL13 PAK1 GNB5 CCL21 SHC4 GRK3 PLCB3 CXCR3 ELMO1 GNG3 GNB4 CCL20 CXCL9 GRK6 PLCB1 CCL5 NCF1 GNG5 GRB2 XCL1 GSK3A GRK5 CCL15 MAPK3 PF4 AKT3 PXN BRAF CCL3L1 GRK7 CCL14 CCL4 RAF1 PREX1 CCL4L1 GNG13 SHC1 CCR9 SRC RAC3 RELA GNG8 CCL4L2 GNG12 SHC2 CCR8 CCL13 PTK2B ROCK1 GNG7 RASGRP2VAV1 CCL3L3 CCR7 CCL11 CCL3 ADCY1 AKT1 PRKACG VAV2 PIK3R5 CCR6 CX3CR1 RAC1 ROCK2 AKT2 GNG11 VAV3 PIK3R3 CCR5 CXCR6 CCL2 ADCY5 XCR1 GNG10 NFKBIB CXCL2 CCR4 CXCR5 MAPK1 ADCY4 STAT5B PLCG1 NFKBIA CXCL1 CCR3 WAS HRAS ADCY3 PRKCD PLCG2 PIK3CB PIK3R2 PF4V1 PIK3CD RAC2 ADCY2 MAP2K1 PRKACB PIK3CA CXCL3 STAT1 ARRB2 CCL1 CXCL14 PPBP PRKACA XCL2 CX3CL1 STAT2 GNAI1 CCL19 ADCY9 PARD3 CCR10 SOS2 CXCL6 CHUK GNAI2 JAK3 FOXO3 PRKCB CCL26 DOCK2 CXCL5 STAT3 GNAI3 IKBKG ADCY8 NFKB1 CCR2 ITK PIK3R6 HCK PIK3CG CCL18 ADCY7 PTK2 LYN CCL28 GNGT2 TIAM1 IKBKB CCL17 CXCL16 PRKCZ CCL25 BCAR1 GRK2 CDC42 CXCR2 JAK2 ADCY6 GNB1 RHOA SOS1 GNGT1 FGR CCL8 CCL16 Complement and coagulation cascades F11 SERPINA1SERPINA5CR2 F8 ITGB2 F13A1 C7 F10 MASP1 C4A FGG F9 C1QB PLAU C9 F12 SERPINE1KNG1 F2R PROCR CFD PLAT ITGAX SERPIND1C3AR1 C8G VWF SERPING1C1QA PLG VSIG4 CFHR1 PROS1 C4B SERPINF2F13B C1R ITGAM A2M CFHR3 C4BPA BDKRB1 F2 F2RL2 CPB2 VTN CD59 CFHR2 C8A BDKRB2 PLAUR MASP2 SERPINC1C2 MBL2 CR1L CLU FGA F3 CD46 CFI C3 CD55 CFHR5 C4BPB CR1 F5 F2RL3 C5AR1 C5 CFHR4 TFPI FGB F7 CFB CFH THBD KLKB1 C8B SERPINB2PROC C1QC C1S C6 Cytosolic DNA-sensing pathway ZBP1 POLR3A POLR3G CASP1 IFNA17 IFNA6 IFNA4 IFNB1 POLR3GLIL6 POLR3H RIPK1 STING1 IFNA5 IKBKB POLR2H RIPK3 POLR3B IRF7 IL33 NFKB1 IFNA8 TBK1 IKBKG IL18 POLR3C POLR3K IFNA13 AIM2 IFNA7 POLR2E POLR2K CXCL10 POLR3D RELA IFNA14 MAVS IFNA2 CCL5 IKBKE NFKBIB POLR3E CGAS DDX58 POLR1C CCL4L1 CCL4 POLR2L IL1B POLR3F ADAR IFNA16 POLR1D IFNA1 POLR2F IFNA21 NFKBIA IRF3 PYCARD CHUK IFNA10 CCL4L2 TREX1 Fc epsilon RI signaling pathway LYN MAPK14 SOS2 NRAS MAP2K3 ALOX5APINPP5D RAC2 IL13 MAPK11 MS4A2 AKT3 PLA2G4EPLA2G4BMAPK9 PLCG2 GAB2 IL5 RAF1 ALOX5 SYK PRKCA MAPK8 FYNIGH IL4 LAT AKT1 PLA2G4FPIK3R1 MAPK3 MAP2K6 VAV1 MAPK12 SOS1 AKT2 MAP2K1 JMJD7-PLA2G 4BRAC3 MAP2K7 VAV2 MAPK10 CSF2 FCER1A PDPK1 BTK PLCG1 IL3 PIK3CB PIK3R3 FCER1G PLA2G4CKRAS RAC1 MAPK13 PIK3CA TNF MAP2K4 PLA2G4DGRB2 MAPK1 VAV3 LCP2 PIK3R2 MAP2K2 PLA2G4APIK3CD HRAS Fc gamma R-mediated phagocytosis GSN CFL2 PLA2G4BPLPP1 LIMK1 PIK3CA WASF2 PIK3CD IGH AKT1 PRKCB PLA2G6 SPHK2 DOCK1 WASF3 FCGR1A MARCKS CFL1 ARPC5 ACTR3B LIMK2 LAT MARCKSL1MAPK3 NCF1 AKT2 PRKCA ACTR3C SPHK1 ARPC1A SYK RAC1 RAF1 PRKCG VASP INPP5D GAB2 ARPC1B MYO10 MAPK1 ARPC5L PRKCD ARPC3 PIP5K1AVAV1 PIK3R3 HCK RAC2 ASAP2 PLA2G4EPIK3R1 PIP5K1BVAV2 PIK3R2 CDC42 INPPL1 PLA2G4FARPC4 PLCG1 DNM2 PLD2 RPS6KB2 ASAP3 MAP2K1 BIN1 PIP5K1CVAV3 PLD1 RPS6KB1 CRKL PLA2G4CARPC2 PLCG2 PTPRC FCGR3A JMJD7-PLA2G 4B PAK1 PLA2G4DAMPH ACTR3 FCGR2A SCIN CRK ASAP1 PRKCE PLPP3 LYN FCGR2B FCGR3B ARF6 AKT3 PLA2G4APLPP2 ACTR2 PIK3CB WASF1 WAS Hematopoietic cell lineage IL4R CSF2 IL7R CD14 IL5 FCER2 HLA-DQA1ITGB3 IL1R1 CSF1 HLA-DRB1IL6R IL1B CD22 CR1 ITGAM IL1R2 ITGA2B CSF1R IL11 IL4 GYPA CR2 HLA-DMB IGH TNF TFRC ITGA1 IL7 CD3G MME FCGR1A CD2 FLT3LG IL5RA ITGA5 IL6 CD3E IL11RA HLA-DPA1 CD5 HLA-DOBCD1E ITGA4 KITLG CD3D GP1BB CD59 CD4 HLA-DOACSF2RA ITGA3 IL3RA THPO GP1BA HLA-DMA CD7 HLA-DRB5CD1D ITGA2 HLA-DRACD38 EPOR CD55 CR1L CD8B2 CD1C DNTT HLA-DQB1CD37 KIT CD9 CD8B CD1B GP5 IL9R CD36 IL2RA CSF3R CD8A CD1A GP9 ITGA6 CD34 HLA-DPB1 EPO HLA-DRB4ANPEP IL3 CD24 HLA-DQA2CD44 CSF3 HLA-DRB3CD19 IL1A MS4A1 CD33 FLT3 IL-17 signaling pathway USP25 MAPK11 DEFB4B CXCL2 IL17RA FOSL1 IL17B CCL7 JUN CXCL10 S100A9 TNF JUND TRAF5 CEBPB MAPK3 HSP90AA1MMP13 S100A8 CXCL1 MUC5B TRAF4 CCL11 CCL2 MMP1 IL5 DEFB4A ELAVL1 CHUK FOSB HSP90AB1MAPK1 CCL20 IL1B CXCL8 CXCL3 FOS TRAF6 TRAF3IP2IKBKG MMP3 IL4 RELA HSP90B1TRAF3 LCN2 IL25 MAPK7 IL13 NFKBIA GSK3B CXCL6 TRAF2 ANAPC5 PTGS2 MAPK6 MUC5AC MAPK12 CSF3 CXCL5 IL17RE TAB3 S100A7AIKBKE MMP9 MAPK10 CSF2 CASP8 NFKB1 IL17F IKBKB CCL17 MAPK15 IL6 SRSF1 CASP3 IL17RC TAB2 MAPK9 MAPK4 MAPK13 IFNG TRADD FADD IL17RB IL17D MAPK8 MAPK14 S100A7 TNFAIP3MAP3K7 IL17A IL17C TBK1 Intestinal immune network for IgA production TGFB1 IL15 IL4 CD28 CCL28 PIGR HLA-DPA1HLA-DQA2 AICDA ITGA4 CXCL12 HLA-DPB1HLA-DRB1CD80 CCR9 ICOS CCL25 TNFSF13IL6 CD40LG CD86 TNFSF13BMADCAM1CCR10 IL15RA IGH LTBR MAP3K14CD40 HLA-DMBITGB7 HLA-DOA IL10 IL2 HLA-DRAHLA-DRB4TNFRSF13CCXCR4 HLA-DOBICOSLG HLA-DRB5IL5 HLA-DQB1HLA-DRB3TNFRSF13BTNFRSF17HLA-DMAHLA-DQA1 Leukocyte transendothelial migration ACTN4 ROCK2 PRKCA F11R VAV2 RAPGEF4CLDN9 CXCR4 ACTN1 CLDN3 VASP ICAM1 VAV3 ITK CLDN8 CLDN25VCAM1 CLDN2 PTK2 ARHGAP5AFDN BCAR1 SIPA1 CLDN24 MAPK13 CLDN1 OCLN RASSF5 CLDN11 PIK3R3 ITGB2 CTNNA2 MAPK14 MYL12B MYL12A PLCG1 CLDN10 PIK3R2 ITGB1 PTK2B MAPK11 ARHGAP35MYLPF PLCG2 PIK3CB CD99L2 CTNNB1 CTNNA1 MYL5 ACTB PIK3R1 CD99 CLDN16 THY1 PIK3CD RAC1 MAPK12 CDH5 ESAM RHOA PIK3CA RAP1A ITGAM RAC2 CXCL12 MYL10 EZR ITGA4 CLDN15 RAP1B GNAI1 CTNNA3 MYL7 JAM2 VCL MMP2 CLDN14 CDC42 ITGAL MYL2 JAM3 NCF2 MSN CLDN19 CLDN7 GNAI2 NCF1 PRKCG PXN RHOH PECAM1 CLDN34 GNAI3 MYL9 PRKCB NCF4 PTPN11 RAPGEF3CLDN6 CLDN23 ROCK1 CYBB TXK MMP9 CLDN18 CLDN5 CLDN22 CTNND1 CYBA ACTG1 VAV1 CLDN17 CLDN4 CLDN20 NOD-like receptor signaling pathway GBP7 ANTXR2 CASR BIRC3 CARD8 CXCL8 CAMP IFNA8 DEFA5 TANK PRKCD IFNA10 IRAK4 YWHAE STAT1 RNASEL DEFA6 RNF31 IFNA16 IFNAR2 IL18 MEFV STAT2 IFNA7 DEFA3 PYCARD IFNA17 TXN2 CARD6 ITPR2 CHUK IFNA2 DEFA4 ANTXR1 NEK7 DEFB103BOAS1 TNFAIP3ERBIN HSP90AB1 DEFA1 DHX33 CYBB GABARAPTYK2 ITPR3 STING1 IFNA1 TRPV2 NLRP7 TRAF3 DEFB103ANFKBIB CXCL2 P2RX7 IFNA4 TICAM1 IFI16 CYBA TXN IL1B NLRC4 AIM2 IKBKB MAPK13 NLRP6 TRAF2 BRCC3 NFKBIA CXCL1 PLCB4 GPRC6A MAPK14 MFN2 NFKB1 TRPM2 IL6 CXCL3 NLRP12 MAPK9 ATG12 NLRP3 MYD88 TBK1 OAS2 ITPR1 XIAP MAPK8 MAPK11 GBP1 MAVS TP53BP1OAS3 CASP8 TXNIP NAMPT MAPK12 NLRP1 TRAF5 TRPM7 IRF3 SHARPINPKN1 CCL5 MAPK10 GBP3 TRAF6 ATG5 PYDC1 PSTPIP1SUGT1 MAPK3 ATG16L1MAP3K7 BCL2L1 IFNA21 BCL2 PANX1 VDAC3 IFNB1 TRIP6 GBP2 CARD18 DNM1L IRF9 CASP12 VDAC2 CCL2 RBCK1 GBP5 TAB3 CTSB PYDC2 CASP4 PKN2 MAPK1 NAIP MFN1 CARD16 RHOA IRF7 CASP5 VDAC1 IKBKG RELA GBP4 TAB2 GSDMD DEFB4B FADD PLCB2 IKBKE NLRX1 IFNA13 CARD17 JUN PYDC5 RIPK2 PLCB3 JAK1 NOD1 IFNA14 TAB1 HSP90AA1TLR4 DEFA1B PLCB1 NOD2 GABARAPL2BIRC2 RIPK3 DEFB4A CASP1 IFNA6 TNF GABARAPL1IFNAR1 CARD9 MCU RIPK1 IFNA5 Natural killer cell mediated cytotoxicity KLRC3 MICA PRKCB FASLG VAV2 SHC1 IFNGR2 PIK3CD IGH MICB TNFRSF10BICAM1 VAV3 SHC2 GZMB ITGAL TYROBP IFNA13 HLA-A ICAM2 NCR2 PIK3R3 KIR3DL1MAPK3 FAS PRKCG TNFRSF10APPP3R1 NCR3 KIR2DL1KIR3DL2RAC3 KLRD1 IFNA14 PRKCA PPP3R2 PIK3CB PIK3R2 KIR3DL3PTK2B ULBP1 MAP2K2 HLA-B KLRK1 PIK3CA KIR2DL2ZAP70 IFNB1 ULBP3 KIR2DS1HLA-G PLCG1 NCR1 KIR2DL3LCK RAC1 PTPN6 IFNA16 HLA-E KLRC1 IFNG PPP3CA CD48 MAPK1 ULBP2 KIR2DS2RAET1E TNFSF10HCST KLRC4-KLRK1KRAS HRAS RAF1 MAP2K1 RAET1G KLRC2 LCP2 PPP3CB IFNA6 RAC2 CSF2 KIR2DS3PIK3R1 PLCG2 CD247 FCGR3A ITGB2 FYN TNF IFNA17 RAET1L IFNA21 SOS2 PPP3CC IFNA5 BID ARAF SH2D1A GRB2 PTPN11 CD244 FCGR3B IFNA8 NRAS KIR2DS4IFNAR1 NFATC2 LAT CASP3 IFNA7 PAK1 SH2D1B IFNA10 NFATC1 SOS1 FCER1G IFNA2 SH3BP2 KIR2DS5IFNAR2 BRAF SHC3 IFNGR1 IFNA1 KIR2DL5AHLA-C PRF1 VAV1 SHC4 SYK IFNA4 Neutrophil extracellular trap formation H2AZ2 H2AB2 H2AC1 H2AC18 H2BC18 PIK3R2 H4-16 PIK3CD H2BC8 H2AB3 CYBA C3 TLR2 FPR3 MTOR ITGAMH2AZ1 MPO PRKCA H2AC19 H2BC13 FCGR3A H3-4 HDAC9 H2BC9 H2AB1 NFKB1 H2AC12 H2BC14 FCGR3B PLCB4 CLCN4 H2BC6 MACROH2A2H2BE1 C5 FCGR2A CLEC7A H3-5 ITGAL H2BC7 MACROH2A1SELP H2AC13 H2BC15 CASP4 VDAC3 CLCN3 H2BC4 ACTB PIK3R1 H2AC14 CLCN5 H3C2 VDAC2 HDAC7 H2BC5 AKT3 H2AC20 H2AC15 H2AJ H3C1 VDAC1 HDAC8 IGH AKT1 H4C15 H2AC11 PIK3CB H3C4 PLCB2 FCGR1A H2BC3 AKT2 H4C14 H4C1 PIK3CA CASP1 SLC25A6H3C14 H2BC1 MAP3K7 H2AC21 PLCG1 H2BC10 CTSG SLC25A5H2BC21 MAPK13 H2BU1 H4C13 H4C3 H2BC11 H3C3 PLCB3 H3C15 MAPK14 ELANE PADI4 PLCG2 H2BC12 H3C6 PLCB1 H3C12 MAPK11 H4C9 H4C12 H4C2 TLR8 FGA ITGB2 H3C13 MAPK12 PRKCG H4C11 ATG7 TLR7 H3-3B HDAC5 MAPK3 HAT1 H4C8 NCF2 H4C5 SIGLEC9H3C8 HDAC6 H3C10 CR1L MAP2K2 HDAC11 H2BW2 TLR4 CAMP H2AX H3C11 SLC25A31H2AC7 C5AR1 H4C4 H2AW H3C7 SELPLG RAC1 PPIF MAP2K1 HDAC10 H4C7 H3-3A CR1 SRC MAPK1 NCF1 H2AC8 NCF4 H4C6 SLC25A4FGB HDAC3 RAC2 RAF1 H2AC6 ACTG1 H2BW1 FPR2 FGG HDAC4 H2BS1 RELA H2AC4 AGER GSDMD FPR1 SYK HDAC1 AQP9 PRKCB H2AC16 AZU1 PIK3R3 VWF HDAC2 ITGA2B CYBB H2AC17 H2BC17 HMGB1 GP1BA ITGB3 Platelet activation GUCY1A2ROCK2 AKT2 GNAQ ITGA2 PIK3R2 SYK ITGB3 GUCY1A1ITGA2B ARHGEF12GNAS GP5 ITPR1 VWF PIK3CD MAPK13 ADCY5 PRKCI BTK GP6 PIK3R6 GP1BB GNAI1 PPP1CA ADCY4 PLA2G4EFERMT3 GP9 RAP1A F2 GNAI2 PPP1CB ADCY3 F2R GUCY1B1APBB1IPRAP1B GP1BA PTGS1 MAPK14 ADCY2 PLA2G4FACTG1 FCGR2A TBXA2R PLCB4 MYLK4 MAPK11 ADCY9 PLA2G4CRASGRP2COL3A1 P2RY1 P2RX1 GNAI3 COL1A2 ADCY8 PLA2G4DMYLK PIK3CB FCER1G JMJD7-PLA2G 4BPIK3CG COL1A1 ADCY7 PLA2G4APRKACG PIK3CA FGA PLCB2 GNA13 MAPK12 MYL12B PLA2G4BRASGRP1LCP2 PRKG2 PLCB3 MAPK3 STIM1 ADCY6 VASP PLCG2 ARHGEF1PRKG1 F2RL3 MAPK1 ORAI1 ARHGAP35MYL12A PRKACB SNAP23 FGB PLCB1 FYN TLN2 PPP1CC PRKCZ PRKACA PIK3R5 P2RY12 MYLK2 TLN1 ACTB VAMP8 LYN ITPR2 FGG MYLK3 ROCK1 AKT3 PIK3R1 RHOA ITPR3 NOS3 ITGB1 ADCY1 AKT1 TBXAS1 PPP1R12APIK3R3 PTGIR SRC RIG-I-like receptor signaling pathway MAP3K1 MAPK12 CXCL8 CASP10 CHUK MAVS IFNA1 IFNB1 MAPK13 CYLD RELA FADD IFNA17 TRAF6 IFNA4 IL12B MAPK14 SIKE1 NLRX1 RIPK1 TRAF3 PIN1 IFIH1 IL12A ATG12 MAPK10 DDX3X MAP3K7 TRAF2 IFNA10 IKBKB IKBKG MAPK11 IRF3 TRADD AZI2 ISG15 IFNA6 MAPK9 IKBKE CXCL10 TBKBP1 TNF IFNA13 STING1 IFNA5 MAPK8 ATG5 NFKBIB IFNK TANK IFNA14 NFKB1 IFNA8 TBK1 IFNA21 IFNE IRF7 CASP8 DDX58 IFNW1 IFNA7 DHX58 NFKBIA OTUD5 TKFC IFNA16 RNF125 IFNA2 TRIM25 T cell receptor signaling pathway MAPK13 TNF PAK6 MAP3K14VAV1 CD28 CD3D CD40LG BUB1B-PAK6CBLB PAK5 BCL10 VAV2 LCP2 PPP3CA PIK3CD MAPK14 NRAS CARD11 PPP3R1 VAV3 CD247 PPP3CB MALT1 MAPK11 PAK2 MAP2K2 RASGRP1IL2 SOS2 PPP3CC IKBKB TEC PAK1 MAP2K1 PPP3R2 NFKBIB NFKBIE CTLA4 MAPK9 MAPK12 AKT3 CD8B2 PLCG1 IL5 ITK ICOS MAPK8 MAPK10 AKT1 NFKB1 MAP2K7 IL4 LAT CHUK MAPK3CD4 AKT2 DLG1 RHOA NFKBIA SOS1 PDPK1 MAPK1 PDCD1 GRAP2 PIK3R1 IL10 PTPRC GSK3B FOS HRAS PTPN6 MAP3K7 CD8B JUN PIK3CB PIK3R3 CDC42 FYN RAF1 PAK4 CD8A NFATC3 PIK3CA PIK3R2 ZAP70 IKBKG RELA PAK3 PRKCQ NFATC2 CDK4 CD3G LCK NCK1 CSF2 MAP3K8 GRB2 NFATC1 IFNG CD3E KRAS NCK2 Th1 and Th2 cell differentiation IL4R NFKBIB LAT DLL4 STAT5B ZAP70 GATA3 MAPK1 JUN IL5 RELA PPP3CA JAG1 LCK RBPJ IL12A IL13 IL4 RBPJL PPP3CB JAG2 IL2RA IKBKB JAK3 NFATC3 NFKBIA MAML3 PPP3CC HLA-DRB5IL2RB PPP3R1 IKBKG NFATC2 MAPK12 MAML2 TBX21 STAT1 HLA-DPB1PPP3R2 HLA-DMA NFATC1 MAPK10 MAML1 STAT6 IFNGR1 PRKCQ MAPK9 JAK1 TYK2 CD4 CD3G IL12RB2IFNGR2 HLA-DRB4HLA-DMBSTAT5A RUNX3 IFNG IL2RG HLA-DOBCHUK HLA-DRB3MAPK8 JAK2 MAPK13 HLA-DRADLL1 IL12RB1STAT4 HLA-DRB1MAPK3 IL2 HLA-DQB1CD3E HLA-DQA2FOS NOTCH3 HLA-DPA1 MAPK14 CD247 DLL3 HLA-DOANFKB1 NOTCH1 PLCG1 MAPK11 NFKBIE CD3D HLA-DQA1MAF NOTCH2 IL12B Toll-like receptor signaling pathway TICAM2 TNF MAP2K1 CCL4L1 TLR1 TLR4 LBP PIK3CD TICAM1 AKT3 IFNA17 CCL4L2 NFKBIA TLR3 FADD IKBKB MAPK13 AKT1 TIRAP TBK1 IL6 CXCL8 RIPK1 MAPK9 MAPK14 AKT2 TRAF3 IL12B PIK3CB CD40 STAT1 MAPK8 MAPK11 SPP1 NFKB1 IL12A IRF5 CXCL9 CHUK CCL5 CXCL10 MAP3K7 MYD88 CD14 PIK3CA CCL3L1 FOS MAPK3 CXCL11 MAP3K8 PIK3R1 MAP2K6 IRF3 CCL3L3 IFNA6 CCL4 MAPK12 MAP2K4 TRAF6 IFNA21 TLR9 LY96 IFNA5 CCL3 MAPK10 IFNA13 TAB2 MAP2K7 TLR8 PIK3R3 IFNA8 IFNB1 TOLLIP IFNA14 TAB1 JUN IRF7 PIK3R2 IFNA7 RAC1 CD86 MAP2K2 IFNAR1 IRAK4 TLR7 CASP8 IFNA2 MAPK1 RELA MAP2K3 IFNA10 TLR2 TLR6 CTSK IFNA1 IKBKG CD80 IFNA16 IFNAR2 IL1B TLR5 IRAK1 IFNA4 IKBKE Central carbon metabolism in cancer PDGFRB SLC7A5 PIK3R3 LDHC IDH1 PKM KRAS PTEN PDGFRA PIK3CB SLC1A5 LDHB NTRK3 PFKM LDHAL6APIK3CD PDHA2 SCO2 PIK3R2 LDHA MAP2K2 PFKL FGFR3 HIF1A G6PD PIK3CA GLS AKT3 NTRK1 KIT LDHAL6BMAPK3 TIGAR TP53 HK1 ERBB2 MAP2K1 PIK3R1 FGFR2 MAPK1 PDHA1 RAF1 EGFR MYC PGAM1 HKDC1 PFKP HRAS SIRT6 RET HK3 AKT1 IDH2 FGFR1 FLT3 PDK1 SIRT3 GLS2 HK2 AKT2 PGAM2 PGAM4 SLC2A1 GCK PDHB NRAS SLC16A3MTOR MET SLC2A2 Endometrial cancer EGF BAX PIK3R3 AKT3 TCF7L1 DDB2 PIK3CD HRAS BAD SOS2 PIK3R2 CDH1 MLH1 PIK3R1 ELK1 CTNNA3 AXIN2 TP53 ARAF ERBB2 APC2 TCF7 CTNNA2 AXIN1 RAF1 FOXO3 MYC GADD45BKRAS MAPK3 BRAF SOS1 EGFR AKT1 MAP2K1 GRB2 POLK APC LEF1 NRAS AKT2 PDPK1 CDKN1A CTNNA1 PIK3CB GSK3B CASP9 MAP2K2 GADD45ACTNNB1 MAPK1 PIK3CA ILK CCND1 TCF7L2 GADD45GPTEN BAK1 PD-L1 expression and PD-1 checkpoint pathway in cancer MAP3K3 EML4 CD247 CD3E MAP2K2 TIRAP KRAS HRAS EGF MAPK11 PDCD1 EGFR MAP2K3 NFKB1 CD274 IKBKG JUN TLR2 PTPN6 CD3D STAT1 MTOR PTEN JAK1 NFATC3 NFKBIB NFKBIE PPP3CA CSNK2A2MYD88 PIK3CD MAP2K6 PTPN11 NFKBIA TLR4 NRAS IFNGR1 ZAP70 HIF1A JAK2NFATC2 MAPK12 RAF1 PPP3CB CSNK2A1LCK IKBKB NFATC1 CD4 LAT PPP3CC MAP2K1 PIK3R1 PPP3R1 TICAM2 PIK3CB ALK AKT3 IFNGR2 RPS6KB2RASGRP1 TICAM1 PIK3CA RELA AKT1 CHUK RPS6KB1PPP3R2 BATF IFNG PIK3R3 AKT2 STAT3 CSNK2B MAPK3 MAPK13 TLR9 PIK3R2 BATF2 CSNK2A3TRAF6 PLCG1 MAPK14 CD28 CD3G BATF3 FOS PRKCQ MAPK1 Transcriptional misregulation in cancer LMO2 CCNT2 IGFBP3 CSF1R PAX5 BCL6 KDM6A FLT1 IL1R2 PRCC TRAF1 GRIA3 HMGA2 FEV H3-3B CDKN1B ZBTB17 CSF2 GADD45GSLC45A3NFKBIZ ID2 H3C8 CEBPE DEFA5 HPGD PBX3 MAX ETV1 ATM H3C7 HDAC1 DEFA6 CCNT1 ASPSCR1SPI1 PAX7 REL ARNT2 FLT3 ZBTB16 EWSR1 IGF1 DDX5 MMP9 RARA CDKN2C CDKN1A DEFA3 MPO NFKB1 KMT2A ETV4 DOT1L TAF15 HDAC2 RUNX1 FOXO1 FLI1 JMJD1C BAIAP3 CXCL8 PTCRA LDB1 IGH HOXA11 PBX1 PDGFA ETV5 H3-3A EYA1 SIX1 MITF HOXA10 PTK2 PLAU MLF1 CD40 NTRK1 ITGAM DEFA4 RXRA NR4A3 PLAT PAX3 BCL2A1 MEF2C LYL1 DEFA1 HOXA9 MAF IGF1R ETV6 TMPRSS2GZMB HHEX PML RXRB CCNA2 ELK4 TGFBR2 MLLT1 KLF3 FCGR1A RUNX2 CCND2 CCNA1 TSPAN7 IL3 MLLT3 DDB2 H3C14 WT1 NSD2 TLX3 CD14 WNT16 BMI1 H3-4 H3C15 MYCN MYC TLX1 PROM1 SUPT3H AFF1 PER2 SIN3A NUPR1 RXRG BCL2L1 MEN1 ETV7 FUT8 H3-5 H3C12 SPINT1 RUNX1T1ERG SSX1 ZEB1 TFE3 IL2RB SIX4 BAX ELANE COMMD3-BMI1SSX2 CDK9 H3C2 PPARG H3C13 CDK14 NGFR BMP2K SS18 NCOR1 H3C1 DDIT3 POLK TP53 GADD45BTCF3 DUSP6 SP1 DEFA1B MET H3C10 CD86 BCL11B BIRC2 FUS IL6 H3C4 SSX2B H3C11 RELA GADD45ABIRC3 JUP MEIS1 H3C3 CEBPA BAK1 ATF1 SMAD1 MDM2 MMP3 PAX8 H3C6 CEBPB ITGB7 본 발명에 있어서, 상기 면역 세포 구성은 미경험 T 세포(naive CD4+ T cell), CD4+ T 세포(CD4+ T cell), 미 경험 CD8+ T 세포(naive CD8+ T cell), CD8+ T 세포(CD8+ T cell), 중심기억 T 세포(central memory T cell), 세포독성 T 세포(cytotoxic T cell), 수지상세포(dendritic cell), 효과기억 T 세포(effector memory T cell), 기능탈진 T 세포(exhausted T cell), 감마델타 T 세포(γδT cell), 자연 조절 T 세포(natural Treg cell), 유 도된 조절 T 세포(induced Treg cell), 점막 관련 불변 T 세포(mucosal-associated invariant T cell), NK 세 포(NK cell), NK T 세포(NK T cell), 여포 보조 T 세포(follicular helper T cell), 1형 보조 T 세포(type 1 helper T cell), 17형 보조 T 세포(type 17 helper T cell), 2형 보조 T 세포(type 2 helper T cell), 1형 조 절 T 세포(type 1 Treg cell), 단핵구(monocyte), 대식세포(macrophage), 호중구(neutrophil), B 세포(B cell) 및 infiltration score로 구성된 군에서 선택되는 2 이상의 면역 세포의 비율(proportion)을 계산하는 것을 특 징으로 할 수 있다. 본 발명에 있어서, 상기 (c) 단계의 면역세포 수용체 특징 및 전사체(transcriptome) 특징은 하기 표 1에 기재 된 특징(feature)을 포함하는 것을 특징으로 할 수 있다.표 1"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "본 발명에 있어서, 상기 (d) 단계의 기준값은 암과 정상을 구별할 수 있는 값이면 제한없이 이용 가능하고, 바 람직하게는 0.5일 수 있으나, 이에 한정되는 것은 아니며, 만약 기준값이 0.5일 경우, 0.5 이상일 경우에 암인 것으로 판정하는 것을 특징으로 할 수 있다. 본 발명에서, 상기 인공지능 모델은 학습할 때, 암환자의 경우 1로 라벨링하고 정상 샘플의 경우 0으로 라벨링 하여 결과적으로 output 수치가 암이 있을 확률로 해석될 수 있게 학습시켰다. 이 결과를 통해 암이 있을 확률 이 0.5 이상이면 암환자이고 0.5 이하이면 정상이라고 진단할 수 있다. 여기서, 0.5의 기준값은 언제든지 바뀔 수 있는 값이라는 것은 통상의 기술자에게 자명한 것이다. 예를 들어서 False positive(위양성)를 줄이고자 하면, 0.5보다 높은 기준값을 설정하여 암이 있다고 판단되는 기준을 엄격 하게 가져 갈 수 있고, False Negative(위음성)를 줄이고자 하면 기준값을 더 낮게 측정하여 암이 있다고 판단 되는 기준을 조금 더 느슨하게 가져 갈 수 있다. 본 발명에 있어서, 상기 방법은 (e) 암으로 판정된 샘플의 면역세포 수용체 특징 및 전사체(transcriptome) 특징을 면역강화 상태와 암을 구분 하도록 학습된 제2인공지능 모델에 입력하여 분석된 출력값을 기준값(cut-off value)과 비교하여 암 유무를 판 정하는 단계를 추가로 포함하는 것을 특징으로 할 수 있다. 본 발명에서 면역강화 상태는 암이 아닌 면역 관련 질병을 앓거나 염증이 있는 등의 사유로 전반적인 면역시스 템이 활성화되어 상기 계산된 면역세포 수용체 특징 및 전사체 특징이 암 환자와 유사한 상태를 의미하며, 본 발명의 상기 (e)단계는 면역강화 상태의 정상샘플과 암 샘플을 구분하도록 학습하여 면역강화 상태는 정상으로, 암 샘플은 암으로 구분하는 단계를 의미한다. 면역관련 질환이나 염증 상태의 정상인 면역학적 프로파일링이 암 환자와 유사하다는 것은 잘 알려진 바이다 (Zeev Elkoshi, Front. Immunol., Vol. 13:821598, 2022; Giat E. et al., Autoimmunity Reviews, Vol. 16, pp. 1049-1057, 2017). 본 발명에 있어서, 상기 (e) 단계의 기준값은 암과 정상을 구별할 수 있는 값이면 제한없이 이용 가능하고, 바 람직하게는 0.5일 수 있으나, 이에 한정되는 것은 아니며, 만약 기준값이 0.5일 경우, 0.5 이상일 경우에 암인것으로 판정하는 것을 특징으로 할 수 있다. 본 발명에 있어서, 상기 인공지능 모델은 암과 정상을 구별할 수 있도록 학습하는 학습 모델이면 제한없이 이용 가능하며, 바람직하게는 선형 회귀(Linear regression), 랜덤 포레스트(random forest), 합성곱 신경망 (convolutional neural network, CNN), 심층 신경망(Deep Neural Network, DNN), 순환 신경망(Recurrent Neural Network, RNN) 및 오토 인코더(autoencoder)로 구성된 군에서 선택되는 하나 이상인 것을 특징으로 할 수 있으나, 이에 한정되는 것은 아니다. 본 발명에 있어서, 상기 인공지능 모델이 DNN일 경우, 손실함수는 손실함수는 binary cross entropy, 하기 수식 1 로 표시되는 것을 특징으로 할 수 있다. 수식 1:"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "여기서, N은 전체 샘플 수이며 는 i번째 입력값의 실제 라벨이고 는 모델이 예측한 i번째 입력값의 라벨이다. 본 발명에서, 상기 인공지능 모델이 DNN일 경우, 학습은 하기 단계를 포함하여 수행되는 것을 특징으로 할 수 있다: i) 생산된 전사체 데이터를 Training(학습 및 검증), test(성능 평가) 데이터로 분류하는 단계; 및 이 때, Training 데이터는 모델의 학습 및 hyper-parameter tuning 검증에 사용되며, Test 데이터는 최적의 모 델 생산 후, 성능 평가로 사용되는 것을 특징으로 함. ii) test 데이터를 활용하여 구축된 최적의 모델의 성능을 다양한 지표로 평가하고 모델의 feature importance 를 분석하는 단계. 본 발명에서, 상기 Hyper-parameter tuning 과정은 DNN 모델을 이루는 여러 parameter(convolution layer 수, dense layer 수, convolution filter 수 등) 값을 최적화하는 과정으로 Hyper-parameter tuning 과정으로는 Bayesian optimization, manual search 또는 grid search 기법을 사용하는 것을 특징으로 할 수 있다. 본 발명에서, 상기 학습 과정은 정해진 hyper-parameter들을 이용하여 DNN 모델의 내부 parameter(weights)들 을 최적화시키며, 과적합(Overfitting)을 방지하기 위해 training loss의 감소가 멈추면 그전에 model 학습을 중단하는 것을 특징으로 할 수 있다. 본 발명에 있어서, 상기 (d) 단계 또는 (e) 단계에서 인공지능 모델이 입력된 면역세포 수용체 특징 및 전사체 (transcriptome) 특징을 분석하여 출력한 출력값은 특정 score 또는 실수이면 제한없이 이용가능하며, 바람직하 게는 실수 값인 것을 특징으로 할 수 있으나 이에 한정되는 것은 아니다. 본 발명에서, 상기 실수 값은 인공지능 모델이 DNN일 경우, 마지막 layer에 sigmoid function 또는 softmax function을 사용하여 인공지능 모델의 output을 0 ~ 1 scale로 조정하여 확률값으로 표현한 값을 의미한다. 본 발명은 다른 관점에서, 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 해독하는 해독부; 해독된 WTS 정보를 표준 염색체 서열 데이터베이스에 정렬하는 정렬부; 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcriptome) 특징(feature)을 추출하는 특징 추출부; 및 추출한 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석한 출력값을 기준값(cut-off value)과 비교하여 암 유무를 판정하는 암 진단부; 를 포함하는 면역학적 프로파일링 기반 암 진단 장치에 관한 것이다. 본 발명에서, 상기 해독부는 독립된 장치에서 추출된 핵산을 주입하는 핵산 주입부; 및 주입된 핵산의 서열정보 를 분석하는 서열정보 분석부를 포함할 수 있으며, 바람직하게는 NGS 분석 장치일 수 있으나, 이에 한정되는 것 은 아니다. 본 발명에서, 상기 해독부는 독립된 장치에서 생성된 서열정보 데이터를 수신하여 해독하는 것을 특징으로 할 수 있다. 본 발명은 또 다른 관점에서, 컴퓨터 판독 가능한 저장 매체로서, 암의 진단을 위한 프로세서에 의해 실행되도록 구성되는 명령을 포함하되, (a) 생체시료에서 전사체 서열분석(whole transcriptome sequencing, WTS) 정보를 수득하는 단계; (b) 수득한 WTS 정보를 표준 염색체 서열 데이터베이스(reference genome database)에 정렬(alignment)하는 단 계; (c) 상기 정렬된 WTS 정보에서 면역세포 수용체 특징 및 전사체(transcriptome) 특징을 추출하는 단계; (d) 상기 추출된 특징을 암과 정상을 구별하도록 학습된 인공지능 모델에 입력하여 분석된 출력값을 기준값 (cut-off value)과 비교하여 암 유무를 1차 판정하는 단계; 및 (e) 암으로 1차 판정된 샘플의 면역세포 수용체 특징 및 전사체(transcriptome) 특징을 면역강화 상태와 암을 구분하도록 학습된 제2인공지능 모델에 입력하여 분석된 출력값을 기준값(cut-off value)과 비교하여 암 유무를 최종 판정하는 단계를 통하여, 암 진단 수행하는 프로세서에 의해 실행되도록 구성되는 명령을 포함하는 컴퓨터 판독 가능한 저장 매체에 관한 것이다. 다른 양태에서 본원에 따른 방법은 컴퓨터를 이용하여 구현될 수 있다. 일 구현예에서, 컴퓨터는 칩 세트에 연 결된 하나 이상의 프로세서를 포함한다. 또한 칩 세트에는 메모리, 저장 장치, 키보드, 그래픽 어댑터(Graphics Adapter), 포인팅 장치(Pointing Device) 및 네트워크 어댑터(Network Adapter) 등이 연결되어 있다. 일 구현 예에서, 상기 칩 세트의 성능은 메모리 컨트롤러 허브(Memory Controller Hub) 및 I/O 컨트롤러 허브에 의하여 가능하다. 다른 구현예에서, 상기 메모리는 칩 세트 대신에 프로세서에 직접 연결되어 사용될 수 있다. 저장 장 치는 하드 드라이브, CD-ROM(Compact Disk Read-Only Memory), DVD 또는 기타 메모리 장치를 포함하는 데이터 를 유지할 수 있는 임의의 장치이다. 메모리는 프로세서에 의하여 사용된 데이터 및 명령에 관여한다. 상기 포 인팅 디바이스는 마우스, 트랙볼 (Track Ball) 또는 다른 유형의 포인팅 디바이스일 수 있고, 키보드와 조합하 여 입력 데이터를 컴퓨터 시스템으로 전송하는데 사용된다. 상기 그래픽 어댑터는 디스플레이 상에서 이미지 및 다른 정보를 나타낸다. 상기 네트워크 어댑터는 근거리 또는 장거리 통신망으로 컴퓨터 시스템과 연결된다. 본 원에 사용되는 컴퓨터는 하지만 위와 같은 구성으로 제한되는 것은 아니고, 일부 구성이 없거나, 추가의 구성을 포함할 수 있으며, 또한 저장장치영역네트워크(Storage Area Network, SAN)의 일부일 수 있으며, 본원의 컴퓨터 는 본원에 따른 방법의 수행을 위한 프로그램에 모듈의 실행에 적합하도록 구성될 수 있다. 본원에서 모듈이라 함은, 본원에 따른 기술적 사상을 수행하기 위한 하드웨어 및 상기 하드웨어를 구동하기 위 한 소프트웨어의 기능적, 구조적 결합을 의미할 수 있다. 예컨대, 상기 모듈은 소정의 코드와 상기 소정의 코드"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "가 수행되기 위한 하드웨어 리소스(Resource)의 논리적인 단위를 의미할 수 있으며, 반드시 물리적으로 연결된코드를 의미하거나, 한 종류의 하드웨어를 의미하는 것은 아님은 본원 기술분야의 당업자에게 자명한 것이다. 실시예 이하, 실시예를 통하여 본 발명을 더욱 상세히 설명하고자 한다. 이들 실시예는 오로지 본 발명을 예시하기 위 한 것으로서, 본 발명의 범위가 이들 실시예에 의해 제한되는 것으로 해석되지는 않는 것은 당업계에서 통상의 지식을 가진 자에게 있어서 자명할 것이다. 실시예 1. 혈액에서 RNA를 추출하여, 차세대 염기서열 분석 수행 정상인 72명, 암환자 131명(대장암 15명, 식도암 18명, 간암 21명, 폐암 42명, 난소암 14명, 췌장암 21명)의 혈 액을 10mL씩 채취하여 혈액보존용기(streck tube)에 보관하였으며, 채취 후 최대 24시간 이내에 3000rpm에 10분 간 원심분리를 진행한 다음, 연층(buffy coat)을 취해 RNA 추출에 사용하였다. RiboPure™RNA Purification Kit(ThermoFisher scientific, USA)를 사용하여 RNA를 추출하고, Dynabeads mRNA Purification Kit(ThermoFisher scientific, USA)를 사용하여 mRNA를 isolation한 다음, RNA fragmentation 과정을 거친 뒤, xGen Broad-Range RNA Library Prep Kit (IDT, USA)를 사용하여 library를 제작하여 Novaseq 6000 system (illumina, USA) 장비를 사용하여 200 cycle로 sequencing 진행하였다. 그 결과, 샘플별로 평균 9천만개의 리드가 생성되는 것을 확인하였다. 환자의 구성은 아래 표 2와 같다. 표 2 암종 환자 수 암종 환자 수 암종 환자 수 대장암 15 식도암 18 간암 21 폐암 42 난소암 14 췌장암 21 정상인 72 1-2. 모델 구축 및 검증을 위한 대규모 데이터 수득 암 진단 모델 구축을 위하여 The Cancer Genome Atlas (TCGA)와 The Genotype-Tissue Expression (GTEx) 컨소 시엄으로부터 각각 10929건의 암과 10845건의 정상 조직 샘플 WTS 데이터를 수집하여 사용하였다. 아울러, 모델 최적화를 위해 356명의 immunological disease (염증성 장질환(inflammatory disease, IBD), 소 아기 특발성 관절염(juvenile idiopathic arthritis, JIA) 및 COVID19) 환자 전혈 WTS 데이터를 Gene Expression Omnibus에서 GSE190680, GSE179627 및 GSE112057로부터 수득하여 사용하였다. 출처: TCGA (https://portal.gdc.cancer.gov/) GTEx (https://gtexportal.org/) GEO (https://www.ncbi.nlm.nih.gov/geo/) 1-3. 수득한 서열 정보의 전처리 실시예 1-1에서 수득하여 정렬된 샘플의 bam 파일에서 TRUST4 툴을 활용하여 TCR/BCR sequence를 추출하였다. TRUST4 툴은 de novo assembly를 통해 RNA sequencing 데이터에서 CDR3 region을 포함한 TCR/BCR sequence을 얻고 분석하는 알고리즘이다(https://github.com/liulab-dfci/TRUST4). 이 때, 서열 개수가 3개 이하인 샘플은 제외하였고, N을 포함하거나, 길이가 20 초과, 12 미만인 서열은 제외하였다. 실시예 2. 암 진단을 위한 면역세포 수용체 특징 및 전사체(transcriptome) 특징(feature) 추출 2-1. 면역세포 수용체 특징 추출 추출한 CDR3 sequence 데이터에서 RIMA 라는 R package(Aashna Jhaveri et al., RIMA_pipeline, , GitHub repository, https://github.com/liulabdfci/RIMA_pipeline)로 TRUST4로 추출된 CDR3 서열을 TCR과BCR로 구분하여 TCR/BCR 레퍼토리 특성을 각각 계산하였다. 고유 CDR3 서열 개수를 전체 개수로 나누고 1000을 곱하여 CPK를 계산하고, 나머지 특성은 RIMA에서 제공하는 기본 함수로 계산하였고, 이를 인공지능 모델의 feature로 사용하였다. 면역 레퍼토리 관련 전체 feature는 표 1의 면역 레퍼토리 특성에 기재하였다. 또한, 추출한 CDR3 sequence 데이터에서 V 및 J 유전자 사용비율(V, J gene usage)를 계산하여 인공지능 모델의 feature로 사용하였는데, 샘플마다 IGH, IGK, IGL, TRA, TRB, TRD, TRG, IGHA1, IGHA2, IGHD, IGHE, IGHG1, IGHG2, IGHG3, IGHG4, IGHGP 및 IGHM의 유전자형(genotype)의 각 비율을 하기 수식 2로 계산하였다. 수식 2:"}
{"patent_id": "10-2024-0053336", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "아울러, alakazam이라는 R package(Namita T. et al., Bioinformatics, Vol.31, No. 20, pp. 3356-3358, 2015)로 CDR3 아미노산 서열의 화학적 특성을 계산하여 인공지능 모델의 feature로 사용하였다. CDR3 아미노산 서열의 화학적 특성의 전체 feature는 표 1의 아미노산 서열의 화학적 특성에 기재하였다. 2-2. 전사체 특징 추출 실시예 1에서 수득한 WTS 데이터의 bam 파일을 ImmuCellAI(YR Miao et al., Adv. Sci. 7:1902880, 2020) 알고 리즘에 활용하기 위하여 상기 알고리즘의 featureCounts command를 통해 gene expression matrix로 변환하였다. 그 뒤, 각 유전자의 read count를 전사물의 길이로 나누고, 이렇게 보정된 값의 총합으로 다시 한 번 나누어 각 샘플의 TPM 총합이 1로 모두 동일하게 하는 방법인 TPM normalization을 진행하였다. Normalization된 gene expression matrix에서서 Ensemble gene ID를 HGNC gene name으로 변환하고 중복된 유전 자를 제거한 다음, ImmuCellAI 기본 함수로 24 개 면역 세포의 구성((immune cell composition)과 1개의 immune filtration score를 계산하여 인공지능 모델의 feature로 사용하였다. 면역세포의 구성 관련 전체 feature는 표 1의 면역 세포 구성에 기재하였다. 또한, single sample gene set enrichment analysis (ssGSEA, https://gseapy.readthedocs.io/en/latest/introduction.html)를 이용하여 면역 반응(38개) 또는 암과 연 관된 총 52 개 유전자 세트의 enrichment score를 계산하여 인공지능 모델의 feature로 사용하였다. 상기 점수 의 전체 feature는 표 1의 암 또는 면역 연관 유전자 발현 점수에 기재하였다. 구체적으로는 면역반응 또는 암과 연관된 유전자 세트 중, GO term은 https://www.ebi.ac.uk/QuickGO/annotations에서, KEGG pathway는 https://www.kegg.jp/kegg/pathway.html에 서 선별하였으며, 각 유전자 세트별 유전자 리스트는 상기 표 5와 같고, 상기 TPM normalization matrix와 선별 된 유전자세트 리스트를 입력하여 GSEApy 기본 함수로 특성을 계산하였다. 실시예 3. 암 진단 모델 구축 및 학습 과정 실시예 2에서 추출한 feature를 도 2와 같은 input matrix로 작성하여 암 진단 모델 구축에 사용하였다. 학습에 사용한 데이터 세트는 실시예 1-2에서 수득한 The Cancer Genome Atlas (TCGA)와 The Genotype-Tissue Expression (GTEx) 컨소시엄으로부터 각각 10929건의 암과 10845건의 정상 조직 샘플 WTS 데이터를 아래 표 3과 같이 training set, validation set 및 test set으로 나누어 학습 및 internal test set으로 사용하였다. 표 3 Train Validation Test TCGA 9345 500 1000 GTEx 9429 500 1000 인공지능 알고리즘은 암 환자와 정상을 구분하는 binary classification 모델을 구축하였다. 모델 학습에는 Linear Regression, Random Forest, Deep Neural Network(DNN) 이렇게 3가지 인공지능 모델을 사용하였다.Linear Regression 및 Random Forest 모델의 최적화를 위해서, 5-fold cross validation(교차검증)으로 training 데이터를 training 및 validation 데이터로 반복적으로 분류하고, hyper-parameter tuning 과정을 진 행하였다. DNN은 input matrix의 feature 하나 하나를 독립된 node로 인식하는 input layer와 3 개의 hidden layer, cancer score를 계산하는 output layer로 구성하였다. output layer 만 sigmoid function을 활성 함수로 사용 하여 최종 cancer score를 계산하였고, 나머지 layer 들은 Relu function을 활성 함수로 사용하였다. DNN의 손실함수는 수식 1로 표시되는 binary crossentropy를 사용하였으며, 손실함수 최적화는 ADAM(Adaptive Moment Estimation) 알고리즘(Goodfellow, I., Bengio, Y., & Courville, A. . Deep Learning. MIT Press)으로 수행하였다. Keras(https://keras.io)에 내장된 EarlyStopping이라는 기본 함수를 이용하여 모델 학습시 validation loss를 모니터링하여 개선되고 있지 않을 시 학습을 종료하고 최종 성능 평가를 수행하였다. 실시예 4. 구축한 암 진단 모델의 성능 확인 실시예 3의 표 3에 기재된 validation set를 이용하여 학습한 3가지 모델에 124개의 feature로 구성된 input matrix를 작성하여 검증하였으며, 모델 성능은 수신기 작동 특성(ROC) 곡선 분석 및 예측 정확도(accuracy), 민 감도(sensitivity), 특이도(specificity)로 평가하였다. 그 결과, 도 3의 B에 기재된 바와 같이 DNN 모델의 경우, 모든 데이터 세트에서 암 샘플과 정상 샘플을 제대로 구분하였고, 도 3의 A에 기재된 바와 같이 AUC, 정확도, 민감도 및 특이도가 모든 데이터 세트에서 높게 나타나 는 것을 확인하였다. 표 4 Validation ROC-AUC 0.99 PR-AUC 0.98 이에 비해, 도 4에 기재된 바와 같이, Linear Regression 및 Random Forest 모델은 조직 샘플 데이터에서는 높 은 성능을 나타내나, 전혈 샘플에서는 예측 성능이 크게 떨어지는 것을 확인하였다. 실시예 5. 암 진단 모델의 중요한 feature 분석 알고리즘 학습에 사용된 124개의 feature 중 어떤 feature가 암 진단을 수행하는데 중요하게 사용되었는지 분석 을 진행하였다. Python의 SHAP 알고리즘(https://shap.readthedocs.io/en/latest/)을 통해 모델이 학습될 때 어떤 특징에 더 큰 가중치를 두는지 계산할 수 있다. 이를 통해 WTS 데이터에서 계산된 특징 중 암 진단에 유효하게 작용하는 특징이 무엇인지 파악하였다. 구체적으로, Shapley value는 각 feature가 모델이 결과를 예측하는데 얼마나 기여하였는지 수치화하는 개념으 로 특정 feature를 제외하였을 때, 가능한 모든 조합에서 나온 예측값의 평균과 각 조합에 해당 feature를 추가 하였을 때 나온 예측값의 차이의 총합이다. shap package의 DeepExplainer라는 내장 함수에 실시예 3에서 학습 된 모델과 학습시 사용된 입력값을 입력하여 shapley value를 계산한 다음, 샘플별 계산된 shapley value를 matrix로 만들고 R studio로 heatmap으로 시각화하였다. 그 결과, 도 5에 기재된 바와 같이 Immune repertoire 관련된 특징들 중에서 특히 BCR과 관련된 feature들이 상 위에 존재하는 것을 확인하였다. 실시예 6. 위양성(false positive) 제거를 위한 추가 모델 구축 및 성능 확인 6-1. 모델 구축 실시예 1-1에서 수득한 183명의 암 환자 WTS 데이터에서 124개의 feature로 구성된 input matrix를 실시예 3의 DNN 모델에 입력한 다음 출력한 결과, 암 환자로 판정한 샘플 중에서 면역 강화(immunoactive) 상태인 정상 샘 플이 false positive로 다수 나타나는 것을 확인하였다(도 6). 이에, 면역 강화 상태와 암을 구분할 수 있는 모델을 추가로 구축하였다(도 7). Input matrix는 실시예 3과 동 일하나, 학습 데이터를 실시예 1-2에서 수득한 356명의 immunological disease 환자 전혈 WTS 데이터와 모델 검 증에 사용하였던 정상인 전혈 데이터를 사용하였으며, 학습 과정은 실시예 3과 동일한 단계로 수행하였다. 6-2. 구축한 위양성 제거 모델의 성능 확인 실시예 6-1에서 구축한 모델을 추가한 실시예 3의 DNN 모델에 실시예 1-1에서 수득한 183명의 암 환자 WTS 데이 터에서 124개의 feature로 구성된 input matrix를 작성하여 모델 성능을 검증한 결과, 도 8에 기재된 바와 같이 위양성 제거 모델이 추가된 DNN 모델의 성능이 향상된 것을 확인하였다. 이상으로 본 발명 내용의 특정한 부분을 상세히 기술하였는 바, 당업계의 통상의 지식을 가진 자에게 있어서 이 러한 구체적 기술은 단지 바람직한 실시 양태일 뿐이며, 이에 의해 본 발명의 범위가 제한되는 것이 아닌 점은 명백할 것이다. 따라서, 본 발명의 실질적인 범위는 첨부된 청구항들과 그것들의 등가물에 의하여 정의된다고 할 것이다."}
{"patent_id": "10-2024-0053336", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 전사체를 이용한 면역학적 프로파일링 기반 암 진단 방법의 전체 흐름도로서, 인공지능 모델 의 학습에 사용되는 데이터의 구성 및 입력값의 종류를 확인 가능하다. 도 2는 본 발명의 일 실시예에 따라 구축한 인공지능 모델에 입력하는 input matrix의 개념도이다. 도 3은 본 발명의 일 실시예에 따라 구축한 전사체를 이용한 면역학적 프로파일링 기반 암 진단에 사용하기 위 해 학습한 DNN 모델의 성능을 확인한 결과로서, (A)는 모델의 다양한 평가지표별 결과이며, (B)는 학습된 모델 로 도출한 출력값의 분포이다. 도 4는 본 발명의 일 실시예에 따라 구축한 전사체를 이용한 면역학적 프로파일링 기반 암 진단에 사용하기 위 해 학습한 Linear Regression 모델 및 Random Forest 모델의 성능을 확인한 결과이다. 도 5는 본 발명의 일 실시예에 따라 구축한 DNN 모델에서 각 feature의 중요도를 평가한 결과이다. 도 6은 본 발명의 일 실시예에 따라 구축한 DNN 모델의 위양성, 위음성 확인을 위한 confusion matrix 결과이다. 도 7은 본 발명의 일 실시예에 따라 구축한 DNN 모델의 최적화를 위해 위양성 필터링을 수행하는 진단 모델 구 축의 흐름도이다. 도 8은 본 발명의 일 실시예에 따라 구축한 최적화된 DNN 모델의 성능을 최적화 전 DNN 모델과 비교한 결과이다. PR-AUC는 정밀도와 재현율의 전체적인 성능을 나타내고, ROC-AUC는 양성/음성을 구별하는 능력을 의 미하며, accuracy는 올바르게 예측했는지를 나타내는 지표이다. 불균형한 데이터에서 모델의 성능을 평가할 때 PR-AUC가 유용하게 활용된다."}
