{"patent_id": "10-2023-0016744", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0124024", "출원번호": "10-2023-0016744", "발명의 명칭": "ＡＲ콘텐츠를 이용한 경로생성방법", "출원인": "주식회사 맥스트", "발명자": "강훈석"}}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "경로를 생성할 타겟지역 선택에 대한 사용자 입력을 수신하는 단계;상기 타겟지역 내에 위치하는 하나 이상의 스토어의 속성정보를 추출하는 단계;상기 속성정보에 기초하여 AR콘텐츠가 배치될 복수의 포인트를 선정하는 단계; 및상기 복수의 포인트를 연결하는 경로를 생성하는 단계;를 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 타겟지역의 맵을 추출하는 단계;생성된 상기 경로를 상기 맵 상에 표시하는 단계; 및상기 맵 상에서 상기 복수의 포인트가 위치하는 좌표에 AR콘텐츠를 배치하는 단계;를 더 포함하는경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 속성정보는 상기 스토어의 위치, 등급, 업종 및 제공 리워드 중 적어도 하나에 대한 정보를 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 수신하는 단계는, 경로 속성에 대한 사용자 입력을 더 수신하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 경로 속성은 상기 경로의 편도이동시간, 왕복이동시간, 상기 경로를 이용하는 수단, 상기 경로를 이용하는시간, 상기 경로의 도로교통법상 용도, 상기 경로의 경사도, 지형, 상기 경로를 포함하는 상기 타겟지역의날씨, 기온, 습도, 상기 경로의 시간별 밝기, 상기 경로의 차량통행량 중 적어도 하나를 포함하는경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,복수의 AR콘텐츠를 카테고리화하는 단계; 및상기 속성정보를 기준으로, 카테고리화된 복수의 AR콘텐츠 중 하나의 AR콘텐츠를 결정하는 단계;를 더 포함하는경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서,상기 AR콘텐츠를 배치하는 단계는, 카테고리화된 복수의 AR콘텐츠 중에서 결정된 상기 하나의 AR콘텐츠를 상기포인트에 배치하는 경로생성방법.공개특허 10-2024-0124024-3-청구항 8 제1항에 있어서,상기 포인트를 선정하는 단계는, 상기 스토어의 위치를 중심으로 소정 반경 이내의 위치를 상기 포인트로 선정하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 포인트를 선정하는 단계는, 서로 인접한 2개의 스토어의 위치의 중간지점을 상기 포인트로 선정하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 포인트를 선정하는 단계는,소정 영역 내에 복수의 스토어가 위치하는지 판단하는 단계;상기 복수의 스토어의 속성정보를 비교하는 단계; 및상기 속성정보의 비교 결과에 기초하여, 상기 포인트의 위치를 결정하는 단계;를 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,상기 타겟지역은 온라인 상의 가상세계 내의 지역이고, 상기 하나 이상의 스토어는 상기 가상세계 내에 배치된가상스토어인 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,상기 복수의 포인트가 위치하는 상기 가상세계 상의 좌표에 상기 AR콘텐츠를 배치하는 단계; 및생성된 상기 경로와 함께 상기 AR콘텐츠를 디스플레이하는 단계;를 더 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서,상기 AR콘텐츠에 대한 리워드를 선택하는 단계; 및사용자단말에 의하여 상기 AR콘텐츠가 활성화된 경우, 상기 리워드를 상기 사용자단말로 전송하는 단계;를 더포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 리워드를 선택하는 단계는,복수의 리워드를 카테고리화하는 단계; 및상기 스토어의 속성정보에 기초하여, 카테고리화된 복수의 리워드 중 하나의 리워드를 결정하는 단계; 및결정된 상기 하나의 리워드를 상기 AR콘텐츠에 대응시키는 단계;를 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제1항에 있어서,공개특허 10-2024-0124024-4-상기 복수의 포인트를 선정하는 데 이용된 복수의 스토어의 등급 또는 업종에 기초하여 추천경로를 생성하는 단계;를 더 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서,상기 추천경로를 생성하는 단계는,상기 스토어의 등급 및 업종 중 적어도 하나에 기초하여 상기 복수의 포인트에 대하여 가중치를 부여한 뒤 각포인트에 대한 경로추천 스코어를 산정하는 단계;각 포인트의 경로추천 스코어에 기초하여 복수의 추천 포인트를 선정하는 단계; 및상기 복수의 추천 포인트를 연결하는 추천경로를 생성하는 단계;를 포함하는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 AR콘텐츠 및 상기 AR콘텐츠의 리워드 중 적어도 하나는 상기 스토어의 업종에 기초하여 결정되는 경로생성방법."}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명에 따른 경로생성방법은 경로를 생성할 타겟지역 선택에 대한 사용자 입력을 수신하는 단계, 상기 타겟지 역 내에 위치하는 하나 이상의 스토어의 속성정보를 추출하는 단계, 상기 속성정보에 기초하여 AR콘텐츠가 배치 될 복수의 포인트를 선정하는 단계, 및 상기 복수의 포인트를 연결하는 경로를 생성하는 단계를 포함한다. 본 발 (뒷면에 계속)"}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 AR콘텐츠를 이용한 경로생성방법으로, 더욱 상세하게는 AR콘텐츠 및 리워드를 이용하여 라이딩, 트래 킹, 등산 등의 이동경로를 생성하는 방법에 관한 것이다."}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "정보통신, AR/VR, 인공지능 등의 기술 발전과 더불어, 현대인들이 야외활동을 더욱 편리하고 재미있게 즐길 수 있도록 하기 위한 다양한 기술이 개발되고 있다. 특히, 자전거, 트래킹, 등산, 산책 등의 야외활동의 경우, 경 로를 탐색하기 위한 기술, 주행/이동 중 안전을 담보하기 위한 기술, 야외활동의 재미를 향상시키기 위한 기술, 야외활동과 관련한 정보를 효율적으로 제공하는 기술, 비상상황시 처치 및 구조를 위한 기술 등으로 구현되었고, 현재 다양한 방식의 서비스로 사용자에게 제공되고 있다. 이때, 다양한 분야의 기술이 융합되면서 혁신의 속도를 높이고 있다. 경로를 탐색하기 위한 기술은 GPS(Global Positioning System), GIS(Geographic Information System) 기술을 포함하는 종래 내비게이션 기술이 스마트폰, 스마트워치와 같은 모바일단말에 탑재되어 국내외 다양한 지역에서 의 야외활동을 가능하게 했다. 예를 들어, 한국 등록특허공보 제10-1752239호(발명의 명칭: 스마트폰 네이게이 션 어플리케이션을 이용한 자전거 네비게이션 단말기 및 이를 이용한 길 안내 방법 및 그 시스템)는 스마트폰에 자전거용 네비게이션 어플리케이션을 설치하고 자전거용 네비게이션 어플리케이션으로부터 네비게이션 정보를 수신하도록 구성된 자전거 네비게이션 단말기에 관한 것이며, 사용자는 이와 같은 기술을 이용하여 더욱 편리하 게 자전거 라이딩을 즐길 수 있게 되었다. 또한, 야외활동의 재미를 향상시키기 위한 기술이나 야외활동과 관련한 정보를 제공하는 기술은, 각종 정보를 스마트폰 등의 모바일단말로 전송하여 사용자로 하여금 다양한 방식으로 해당 정보를 입수할 수 있게 하였다. 예를 들어, 사용자는 모바일단말을 통해 해당 정보를 음성, 텍스트, 동영상 등으로 확인하거나, 게임을 즐기는 방식으로 해당 정보를 입수하는 등 단순한 정보제공에서 벗어나 흥미를 더하기 위한 요소들이 많이 가미되었다. 예를 들어, 한국 특허공개공보 제10-2022-0155237호(발명의 명칭: 공간정보기반 증강현실 컨텐츠 광고제공시스 템)는 매장정보 데이터들을 기반으로, 고객이 소지한 스마트폰의 GPS 및 카메라를 이용하여 고객에게 적합한 상 황의 관련 데이터 및 AR 컨텐츠를 제공하는 것으로, 사용자는 이와 같은 기술을 이용하여 더욱 재미있게 산책/ 쇼핑을 위한 경로 정보를 제공받을 수 있게 되었다. 한편, 야외활동을 실내로 옮겨와 공간상의 제약 없이 다양한 액티비티를 즐길 수 있는 기술도 개발되고 있다. 예를 들어, 한국 등록특허공보 제10-2234066호(발명의 명칭: 증강현실 기반의 그룹 라이딩 지원 시스템)은 실내 환경에서 온라인으로 연결된 사용자 간의 증강 현실 기반의 그룹 라이딩을 지원하는 시스템에 관한 것으로, 사용자는 이와 같은 기술을 이용하여 야외가 아닌 실내에서 자전거 라이딩을 즐길 수 있게 되었다. 하지만, 경로탐색과 관련한 종래의 기술은 사용자의 현재 위치를 지도상에 표시하고, 출발지와 목적지를 연결하 는 길(자동차도로, 자전거도로 등)을 경로로 제공했고, 이때 경로를 선택하는 기준은 거리나 시간에만 기초했다. 자전거 라이더의 입장에서는 경로 선택에 있어 시간이나 거리는 크게 중요하지 않은 요소임에도 불구 하고 일률적으로 선택된 경로만 제공되는 문제점이 있었다. 또한, 사용자의 흥미를 유발하기 위해 AR컨텐츠를 지도상에 표시하는 종래의 기술은 서비스 제공자가 임의적으 로 선택한 위치나 경로에 AR컨텐츠가 배치될 뿐이어서, 사용자, 서비스제공자, AR컨텐츠 제공자의 니즈에 따라 다양한 방식으로 경로를 창출하는 것이 원천적으로 불가능하다는 문제점이 있었다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국 등록특허공보 제10-1752239호 (2017.06.23. 등록) (특허문헌 0002) 한국 특허공개공보 제10-2022-0155237호 (2022.11.22. 공개) (특허문헌 0003) 한국 등록특허공보 제10-2234066호 (2021.03.25. 등록)"}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 상술한 종래 기술의 문제점을 감안하여 안출된 것으로, 본 발명의 목적은 AR콘텐츠 및 리워드에 기초 해서, 라이딩, 등산, 트래킹을 위한 경로(route)를 자동으로 생성할 수 있는 경로생성방법을 제공함에 있다. 또 한, 본 발명의 목적은 오프라인뿐만 아니라 온라인 상(예: 메타버스)의 아바타 이동경로에도 적용 가능한 경로 생성방법을 제공함에 있다. 나아가, 본 발명의 목적은 경로 내에서 AR콘텐츠(예: 광고 등)를 배치하는 다양한 수단을 제시하고, 리워드의 사용 방법의 다양화를 통해 AR콘텐츠의 이용(예: 광고시청 등)을 유인할 수 있는 방 법을 제공함에 있다."}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명에 따른 경로생성방법은, 경로를 생성할 타겟지역 선택에 대한 사용자 입력을 수신하는 단계; 상기 타겟 지역 내에 위치하는 하나 이상의 스토어의 속성정보를 추출하는 단계; 상기 속성정보에 기초하여 AR콘텐츠가 배 치될 복수의 포인트를 선정하는 단계; 및 상기 복수의 포인트를 연결하는 경로를 생성하는 단계;를 포함한다. 그리고, 상기 타겟지역의 맵을 추출하는 단계; 생성된 상기 경로를 상기 맵 상에 표시하는 단계; 및 상기 맵 상 에서 상기 복수의 포인트가 위치하는 좌표에 AR콘텐츠를 배치하는 단계;를 더 포함할 수 있다. 또한, 상기 속성정보는 상기 스토어의 위치, 등급, 업종 및 제공 리워드 중 적어도 하나에 대한 정보를 포함할 수 있다. 그리고, 상기 수신하는 단계는, 경로 속성에 대한 사용자 입력을 더 수신할 수 있다. 또한, 상기 경로 속성은 상기 경로의 편도이동시간, 왕복이동시간, 상기 경로를 이용하는 수단, 상기 경로를 이 용하는 시간, 상기 경로의 도로교통법상 용도, 상기 경로의 경사도, 지형, 상기 경로를 포함하는 상기 타겟지역 의 날씨, 기온, 습도, 상기 경로의 시간별 밝기, 상기 경로의 차량통행량 중 적어도 하나를 포함할 수 있다. 그리고, 복수의 AR콘텐츠를 카테고리화하는 단계; 및 상기 속성정보를 기준으로, 카테고리화된 복수의 AR콘텐츠 중 하나의 AR콘텐츠를 결정하는 단계;를 더 포함할 수 있다. 또한, 상기 AR콘텐츠를 배치하는 단계는, 카테고리화된 복수의 AR콘텐츠 중에서 결정된 상기 하나의 AR콘텐츠를 상기 포인트에 배치할 수 있다. 그리고, 상기 포인트를 선정하는 단계는, 상기 스토어의 위치를 중심으로 소정 반경 이내의 위치를 상기 포인트 로 선정할 수 있다.또한, 상기 포인트를 선정하는 단계는, 서로 인접한 2개의 스토어의 위치의 중간지점을 상기 포인트로 선정할 수 있다. 그리고, 상기 포인트를 선정하는 단계는, 소정 영역 내에 복수의 스토어가 위치하는지 판단하는 단계; 상기 복 수의 스토어의 속성정보를 비교하는 단계; 및 상기 속성정보의 비교 결과에 기초하여, 상기 포인트의 위치를 결 정하는 단계;를 포함할 수 있다. 또한, 상기 타겟지역은 온라인 상의 가상세계 내의 지역이고, 상기 하나 이상의 스토어는 상기 가상세계 내에 배치된 가상스토어일 수 있다. 그리고, 상기 복수의 포인트가 위치하는 상기 가상세계 상의 좌표에 상기 AR콘텐츠를 배치하는 단계; 및 생성된 상기 경로와 함께 상기 AR콘텐츠를 디스플레이하는 단계;를 더 포함할 수 있다. 또한, 상기 AR콘텐츠에 대한 리워드를 선택하는 단계; 및 사용자단말에 의하여 상기 AR콘텐츠가 활성화된 경우, 상기 리워드를 상기 사용자단말로 전송하는 단계;를 더 포함할 수 있다. 그리고, 상기 리워드를 선택하는 단계는, 복수의 리워드를 카테고리화하는 단계; 및 상기 스토어의 속성정보에 기초하여, 카테고리화된 복수의 리워드 중 하나의 리워드를 결정하는 단계; 및 결정된 상기 하나의 리워드를 상 기 AR콘텐츠에 대응시키는 단계;를 포함할 수 있다. 또한, 상기 복수의 포인트를 선정하는 데 이용된 복수의 스토어의 등급 또는 업종에 기초하여 추천경로를 생성 하는 단계;를 더 포함할 수 있다. 그리고, 상기 추천경로를 생성하는 단계는, 상기 스토어의 등급 및 업종 중 적어도 하나에 기초하여 상기 복수 의 포인트에 대하여 가중치를 부여한 뒤 각 포인트에 대한 경로추천 스코어를 산정하는 단계; 각 포인트의 경로 추천 스코어에 기초하여 복수의 추천 포인트를 선정하는 단계; 및 상기 복수의 추천 포인트를 연결하는 추천경 로를 생성하는 단계;를 포함할 수 있다. 또한, 상기 AR콘텐츠 및 상기 AR콘텐츠의 리워드 중 적어도 하나는 상기 스토어의 업종에 기초하여 결정될 수 있다."}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명에 따른 경로생성방법에 의하면, AR콘텐츠 및 리워드에 기초해서, 라이딩, 등산, 트래킹, 가상세계에서 의 이동을 위한 경로(route)를 온라인 및 오프라인 상에서 자동으로 생성할 수 있게 된다. 또한, 본 발명에 따 른 경로생성방법에 의하면, 경로 내에서 AR콘텐츠(예: 광고 등)를 배치하는 다양한 수단을 제시하고, 다양한 방 식의 리워드 사용 조건을 제시함으로써 AR콘텐츠의 이용(예: 광고시청 등)을 유인할 수 있는 방법을 제공함에 있다. 나아가, 본 발명에 따른 경로생성방법에 의하면, 온라인 및 오프라인 상의 리워드 제공자(예: 서비스 제 공자, 메타버스 플랫폼 제공자, 광고주 등)에 대한 과금화를 통해 수익창출의 기반을 마련할 수 있게 된다."}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 또한, 본 명세서에 개시된 실시예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개 시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세 서에 개시된 실시 예를 쉽게 이해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기 술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함 하는 것으로 이해되어야 한다. 도 1 및 2는 본 발명에 따른 경로생성방법을 개략적으로 설명하기 위한 개념도이다. 본 발명에 따른 경로생성방 법은 AR콘텐츠가 배치될 포인트를 선정하고, 해당 포인트에 기초해서 각종 경로를 생성한다. 본 발명에 따른 경 로생성방법에 의하여 생성된 경로는 바이크 루트, 오토바이 루트, 드라이브 경로, 등산 루트, 트래킹 패스, 산 책 경로 등 다양한 목적의 경로일 수 있다. 도 1은 본 발명에 따른 경로생성방법에 의하여 생성된 경로가 자전거(B)에 장착된 기기(스마트폰, 내비게이션 등)에 맵과 함께 표시된 상황을 도시한다. 아울러, 해당 맵에는 경로 상에 AR콘텐츠가 표시될 수 있다. 아래 에서 더욱 상세히 설명하겠지만, 경로는 AR콘텐츠가 배치될 포인트에 기초하여 생성되고, AR콘텐츠가 배치될 포 인트는 소정 지역 내에 위치하는 스토어의 속성정보에 기초해서 결정된다. 이때, 속성정보는 스토어의 위치, 등 급, 업종 및 제공 리워드 등일 수 있다. 스토어의 등급은 경로제공 서비스에 가입된 회원 등급(사용자 등급)에 따라 달라질 수 있고, 회원 등급은 과금 액수, 회원비 등에 의존할 수 있다. 본 발명에 따른 경로생성방법에 의하면 회원이 운영하는 스토어를 지나치도록 경로를 생성할 수 있고, 다양한 수단(리워드 제공 등)을 통해 많은 사용자로 하여금 해당 서비스(해당 경로)를 이용하도록 만들 수 있다. 또한, 해당 스토어를 지나는 통행량의 증가는 해당 스토어의 수익 창출에 이바지하므로 회원 유치를 촉진하는 결과를 도모한다. 특히, 인적이 드문 지역에 위치한 스토어들의 경우, 본 발명에 따른 경로생성방법을 통해 해당 스토 어 근방의 통행량을 증가시킬 수 있기 때문에 상권 활성화에도 도움이 될 수 있다. 도 2는 본 발명에 따른 경로생성방법에 의하여 생성된 경로와 AR콘텐츠가 차량(C) 내의 내비게이션에 맵과 함께 표시된 상황을 도시한다. 도 2에서는 내비게이션이 도시되었으나, 다른 실시예에서는 HUD(Head-Up Display)에 경로, 맵의 전부/일부, AR콘텐츠 등이 표시될 수도 있다. 본 발명에 따른 경로생성방법은 경로 속성에 대한 사용자 입력을 수신하고, 이에 기초하여 경로를 생성할 수도 있다. 이때, 경로 속성은 경로의 편도이동시간, 왕복이동시간, 경로를 이용하는 수단, 경로를 이용하는 시간, 경로의 도로교통법상 용도, 경로의 경사도, 지형, 상기 경로를 포함하는 타겟지역의 날씨, 기온, 습도, 경로의 시간별 밝기, 경로의 차량통행량 등일 수 있다. 예를 들어, 사용자가 경로 속성으로 '이동수단: 자전거'를 입력한 경우(즉, 사용자단말로부터 '이동수단: 자전 거'의 경로 속성이 수신된 경우), AR콘텐츠가 배치될 복수의 포인트 중 자전거로 이동 가능한 위치에 배치된 포 인트만을 선별하고, 해당 포인트를 연결하는 경로를 생성할 수 있다. 또한, 사용자가 경로 속성으로 '도보, 왕 복이동시간: 3시간'을 입력한 경우(즉, 사용자단말로부터 '이동수단: 도보, 왕복이동시간: 3시간'의 경로 속성 이 수신된 경우), AR콘텐츠가 배치될 복수의 포인트 중 사용자의 현재위치로부터 최대 1시간30분 도보거리에 위 치한 포인트를 최종 포인트로 설정하고, 해당 포인트까지의 복수 포인트를 연결하는 경로를 생성할 수 있다. 또 한, 사용자가 경로 속성으로 '이동수단: 자전거, 경사도: 없음'을 입력한 경우(즉, 사용자단말로부터 '이동수단: 자전거, 경사도: 없음'의 경로 속성이 수신된 경우), AR콘텐츠가 배치될 복수의 포인트 중 경사도가 있는 지역에 위치한 포인트를 제외한 복수 포인트를 연결하는 경로를 생성할 수 있다. 서비스 제공자에 의하여 일방적으로 특정 위치에 AR콘텐츠가 배치되던 종래의 AR콘텐츠 서비스와 달리, 본 발명 은 AR콘텐츠를 이용하여 수익을 창출하고자 하는 회원에 의하여 AR콘텐츠가 생성 및 배치될 수 있는 환경을 제 공한다. 또한, 서비스 사용자는 최적 경로와 함께 리워드까지 제공받게 되므로, 자전거, 등산, 드라이브, 트래 킹 등의 레저활동을 게임 형식으로 즐길 수 있게 된다. 나아가, AR콘텐츠(예: 광고)의 활성화(예: 광고 시청)를촉진하기 때문에 AR콘텐츠 제공자(광고주 등)도 수익 창출이 가능해지는 선순환을 이루게 된다. 도 3은 본 발명에 따른 경로생성방법에 이용되는 각종 속성정보를 도시한다. 도 3에 도시된 바와 같이, 속성정 보는 사용자 정보, 지역정보, AR콘텐츠 정보, 리워드 정보, 경로 정보를 포함할 수 있지만, 이에 한정되지 않는다. 사용자 정보는 가입된 회원(자연인, 법인)의 계정정보, 인적정보(법인 정보), 등급정보와, 가입된 스토어의 위치정보, 업종정보, 등급정보 등을 포함할 수 있다. 회원과 스토어는 서로 동일한 주체일 수 있다. 즉, 회원은 본인의 스토어 정보를 입력하여, 계정정보와 각종 스토어 정보를 연결할 수 있다. 지역 정보는 경로가 생성될 수 있는 모든 지역에 대한 정보를 포함한다. 지역의 범위는 한정되지 않는다. 지역 정보는 국가정보, 특정 지점의 위도/경도 정보(GPS 정보), 맵(map), 지형, 지리적 특성, 지적법상 지 목, 기상/온도/습도 정보, 시간별 조도 정보, 차량 통행량 등의 다양한 지역적 정보를 포함할 수 있다. 지역 정 보는 GIS(Geographic Information System)으로부터 획득될 수 있다. GIS는 지리적 위치를 갖는 대상에 대 한 위치자료(spatial data), 속성자료(attribute data), 시간자료(temporal data) 등을 통합 관리하여 지도, 도표 및 그림과 같은 다양한 형태의 정보를 제공한다. 지역 정보는 지도 등의 다양한 지리정보를 제공하는 플랫폼(예: 구글어스, 구글맵, 네이버지도, 다음지도)이나 각종 기관(예: 국토지리정보원), 기상정보를 제공하 는 플랫폼(예: 웨더아이)이나 각종 기관(예: 기상청)으로부터 제공받을 수도 있다. AR콘텐츠 정보는 AR콘텐츠 제공자의 정보, AR콘텐츠 카테고리 정보 등을 포함할 수 있다. AR콘텐츠 제공자 는 해당 콘텐츠를 생성, 제작, 판매하는 주체일 수 있다. AR콘텐츠가 제품 광고인 경우, AR콘텐츠 제공자는 광 고주, 광고제작자 등일 수 있다. 리워드 정보는 리워드 제공자의 정보, 리워드 수혜자의 정보, 리워드 카테고리 정보, 리워드 사용처 정보 등을 포함할 수 있다. 리워드 제공자는 연관된 AR콘텐츠의 제공자와 동일할 수 있다. 예컨대, AR콘텐츠의 제공 자는 AR콘텐츠의 활성화(시청 등)의 대가로 리워드를 제공할 수 있다. 또한, 리워드 제공자는 연관된 AR콘텐츠 의 제공자와 다를 수 있다. 예컨대, 사용자에게 리워드를 제공하고, 해당 리워드를 본인의 스토어에서 사용하게 함으로써 이득을 누리는 주체가 리워드 제공자일 수 있고, 이때 리워드 제공자는 타인이 제공하는 AR콘텐츠를 이용할 수 있다. 리워드 수혜자는 경로제공 서비스를 이용하는 모든 사용자로 설정될 수 있지만, 경우에 따라서 는 특정 주체로 한정될 수도 있다. 예를 들어, 본 발명에 따른 경로제공방법에 의해 생성된 경로를 제공받는 사 용자 중 특정 주체(예: 자전거 사용자)만을 리워드 수혜자로 한정할 수 있다. 자전거 수리점이나 자전거 용품 판매점에서 제공하는 리워드의 경우가 이에 해당할 수 있다. 서로 연결된 AR콘텐츠 및 리워드는 연관 정보를 공 유한다. 경로 정보는 사용자로부터 입력될 수 있는 다양한 경로 속성과 관련한 정보이다. 경로 정보는 이동수단, 이 동수단에 따른 이동시간(편도/왕복), 경로를 이용하는 시간, 경로의 도로교통법상 용도, 경로의 경사도, 지형, 상기 경로를 포함하는 타겟지역의 날씨, 기온, 습도, 경로의 시간별 밝기, 경로의 차량통행량, 리워드 사용처 등일 수 있지만, 이에 한정되지 않는다. 도 4는 본 발명에 따른 경로생성방법에 이용되는 속성정보 중 AR콘텐츠 정보 및 리워드 정보를 구체화한 도면이 다. AR콘텐츠는 종류별로 카테고리화될 수 있다. AR콘텐츠가 증강현실을 이용한 광고라고 가정한다면, 해당 광 고의 광고대상에 따라 패션, 서비스, 숙박 등 다양한 카테고리로 분류될 수 있고, 패션은 패션(의류), 패션(신 발), 패션(악세사리) 등으로, 서비스는 서비스(카페), 서비스(음식), 서비스(세탁) 등으로, 숙박은 숙박(호텔), 숙박(펜션), 숙박(리조트) 등으로 세분화될 수 있다. 리워드 역시 종류별로 카테고리화될 수 있다. 예를 들어, 상품증정, 할인권, 쿠폰지급 등의 리워드 종류에 따라 카테고리화거나, 리워드 사용처에 따라 카테고리화될 수 있다. 또한, AR콘텐츠와 마찬가지로 리워드는 패션, 서 비스, 숙박 등 다양한 카테고리로 분류될 수 있고, 패션 리워드는 패션(의류)와 관련한 리워드(할인권 등), 패 션(신발)과 관련한 리워드, 패션(악세사리)과 관련한 리워드 등으로, 서비스는 서비스(카페)와 관련한 리워드 (식료품 증정 등), 서비스(음식)와 관련한 리워드, 서비스(세탁)과 관련한 리워드 등으로, 숙박은 숙박(호텔)과 관련한 리워드(연박 할인권 등), 숙박(펜션)과 관련한 리워드, 숙박(리조트)와 관련한 리워드 등으로 세분화될 수 있다. 카테고리화된 AR콘텐츠와 리워드는 해당 카테고리에 따라 서로 연결될 수 있다. 예를 들어, 패션(의류) 카테고 리에 속하는 AR콘텐츠는 패션(의류) 카테고리에 속하는 리워드와 연결될 수 있다. AR콘텐츠와 리워드가 서로 연 결된다는 의미는, 사용자가 AR콘텐츠를 활성화시켰을 때 그와 연결된 리워드가 사용자에게 지급되는 것을 의미한다. 도 5는 본 발명에 따른 경로생성방법의 흐름도이다. 먼저, 경로를 생성할 타겟지역 선택에 대한 사용자 입력을 수신한다(S100). 타겟지역 선택에 대한 사용자 입력은 스마트폰 등의 사용자단말을 통해 이루어지며, 서버는 사 용자단말로부터 사용자 입력 신호를 전달받는다. 이후, 타겟지역 내에 위치하는 하나 이상의 스토어의 속성정보 를 추출한다(S110). 이때, 스토어의 속성정보는 스토어의 위치, 등급, 업종 및 제공 리워드 중 적어도 하나에 대한 정보를 포함할 수 있다. 즉, 타겟지역 내의 스토어의 좌표(경도, 위도, GPS 정보), 스토어의 등급(회원 등 급에 대응할 수 있음), 제공 리워드(스토어에 의하여 제공되는 리워드, 스토어와 연관된 회원에 의하여 제공되 는 리워드, 스토어/회원과 제휴된 리워드 제공자에 의하여 제공되는 리워드)를 추출하고, 이는 AR콘텐츠가 배치 될 위치를 결정하는 데 이용된다. 다음, 스토어의 속성정보에 기초하여 AR콘텐츠가 배치될 복수의 포인트를 선 정하고(S120), 복수의 포인트를 연결하는 경로를 생성한다(S130). 나아가, 본 발명에 따른 경로생성방법은 AR콘텐츠를 배치하는 과정을 더 수행할 수 있다. 이는, 타겟지역의 맵 을 추출하는 단계(S200), 생성된 경로를 맵 상에 표시하는 단계(S210), 맵 상에서 복수의 포인트가 위치하는 좌 표에 AR콘텐츠를 배치하는 단계(S220)를 포함한다. 타겟지역의 맵은 다양한 속성정보(도 3 참조) 중 지역정보 에서 추출할 수 있다. 생성된 경로는 해당 맵에 선이나 색상으로 구별되도록 표시될 수 있다. 포인트가 위 치하는 좌표에 AR콘텐츠를 배치하는 것과 관련해서는 도 6을 참조하면서 상세히 설명한다. 도 6은 본 발명에 따른 경로생성방법에서 포인트의 위치정보와 AR콘텐츠의 연결 방법을 설명하는 도면이다. 본 발명에 따른 경로생성방법은 맵 상의 하나 이상의 포인트(위치)에 증강하고자 하는 콘텐츠를 연결(link)시킨다. 다양한 AR콘텐츠는 사전에 수집되어 저장되거나, 외부 서버로부터 실시간 수신될 수 있다. AR콘텐츠는, 광고 목 적의 콘텐츠, 정보제공 목적의 콘텐츠 등 다양한 목적의 콘텐츠일 수 있으며, 텍스트, 이미지, 동영상, 오디오 등 증강현실로 구현될 수 있는 모든 형태의 정보를 포괄한다. 도 6의 (a)에 도시된 바와 같이, 포인트의 위치정보와 AR콘텐츠의 연결을 위해 먼저 AR콘텐츠가 배치될 포인트 가 선정된다. 포인트는 스토어의 속성정보에 기초하여 선정될 수 있다. 이후, 도 6의 (b)에 도시된 바와 같이, 해당 포인트의 위치정보를 추출한다. 도면에서는 하나의 포인트가 도시되어 있으나, 2개 이상의 포인트가 선정 되고 이에 대한 위치정보가 추출될 수 있다. 포인트의 위치정보는 실제공간에서의 좌표정보(위도경도 정보), GPS정보일 수 있고, 가상공간상의 3D 좌표정보(x,y,z)일 수 있다. 가상공간상의 3D좌표정보인 경우에는 인터넷 주소정보(URL)와 같이 가상공간 식별을 위한 정보를 더 포함할 수 있다. 가상공간에서의 3D 좌표정보는 매핑정 밀도에 따라 다양한 레벨로 구성될 수 있다. 예를 들어, 고정밀 맵에서는 mm(밀리미터), cm(센티미터) 단위로 세분화될 수 있다. 3D 맵의 세분화된 위치좌표별(맵핑되는 각각의 포인트마다)로 고유한 좌표값이 부여되고, 해 당 위치를 AR콘텐츠를 연결할 수 있는 공간(위치)으로 활용할 수 있다. 또한, 포인트 클라우드를 사전에 기설정 된 단위로 그룹핑하고 그룹핑된 단위마다 고유한 좌표값을 부여할 수도 있다. 예를 들어, 맵핑 포인트를 소정 단위(예: 1cm 단위)로 묶어서 각 그룹에 고유한 좌표값을 부여할 수 있다. 또한, 실제공간이 3D 맵으로 구축된 환경에서 미리 위치좌표별로 고유한 좌표값을 부여하고, 사용자가 3D 맵 상에서 특정 위치를 선택하여 해당 위 치에 가상의 공간을 생성하는 것도 가능하다. 이와 같은 방식으로, AR콘텐츠는 실제공간이 아닌 가상공간의 특 정 위치에 배치될 수 있다. 마지막으로, 도 6의 (c)에 도시된 바와 같이, 포인트의 위치정보가 AR콘텐츠에 연결 될 수 있다. 이에 의하여, AR콘텐츠는 배치된 위치와 관련한 속성정보를 포함하게 된다. AR콘텐츠가 소정 위치에 배치된 뒤, 사용자단말이 해당 위치에 도달하면(도 6의 (d) 및 (e)), 사용자단말에 AR 콘텐츠가 디스플레이될 수 있다(도 6의 (f)). 사용자단말의 위치는 사용자단말에 구비된 GPS모듈에 의하여 실시 간 검출될 수 있고, 검출된 사용자단말의 위치정보와 AR콘텐츠에 포함된 위치정보에 기초하여, 사용자단말과 AR 콘텐츠의 위치가 소정 거리 이내인 경우, 사용자는 사용자단말을 통해 AR콘텐츠를 확인할 수 있다. AR콘텐츠의 활성화는 다양한 방식으로 이루질 수 있다. 예를 들어, 소정 조건(사용자단말과 AR콘텐츠의 위치가 소정 거리 이내인 경우 등)이 만족되면 즉각적으로 사용자단말에 AR콘텐츠가 디스플레이되는 방식으로 활성화될 수도 있고, 소정 조건이 만족하고 사용자단말의 조작 신호(예: 활성화 버튼 터치)가 생성되면 사용자단말에 디스플레 이되는 방식으로 활성화될 수도 있다. 도 7은 본 발명에 따른 경로생성방법에서 리워드 제공방식을 나타내는 흐름도이다. AR콘텐츠는 리워드 정보를 갖는다. AR콘텐츠의 리워드는 사용자가 사용자단말을 통해 AR콘텐츠를 활성화(예: 디 스플레이)했을 때, 그 시청에 대가로 상기 사용자단말에 전송되는 혜택일 수 있다. 따라서, 본 발명에 따른 경로생성방법은 AR콘텐츠에 대한 대가로 제공될 리워드를 선택한다(S230). 이후, 사용 자단말로부터 AR콘텐츠 활성화 정보가 되는지를 모니터링한다. AR콘텐츠 활성화 정보는 소정 조건(사용자단말과 AR콘텐츠의 위치가 소정 거리 이내인 경우 등)이 만족되는 경우 즉각적으로 생성될 수도 있고, 소정 조건이 만 족하고 사용자단말의 조작 신호(예: 활성화 버튼 터치)까지 발생한 뒤에 생성될 수도 있다. AR콘텐츠 활성화 정 보가 확인되면(S240), AR콘텐츠 활성화 정보를 발송한 사용자단말에 대하여 리워드를 제공한다. 도 8은 본 발명에 따른 경로생성방법에서 리워드 결정방식을 나타내는 흐름도이다. 리워드를 선택하는 단계는, 먼저, 하나 이상의 리워드 제공자에 의하여 제공되는 복수의 리워드를 카테고리화하 는 단계를 포함한다(S231). 이후, 스토어의 속성정보에 기초하여, 카테고리화된 복수의 리워드 중 하나의 리워 드를 결정한다(S232). 마지막으로, 결정된 하나의 리워드를 AR콘텐츠에 대응시킨다(S233). 리워드의 선택과 마찬가지로, AR콘텐츠 역시 카테고리화되고 이에 기초하여 경로 상의 포인트에 배치될 AR콘텐 츠가 선택될 수 있다. AR콘텐츠를 선택하는 단계는, 먼저, 복수의 AR콘텐츠를 카테고리화하는 단계(미도시), 스토어의 속성정보를 기 준으로 카테고리화된 복수의 AR콘텐츠 중 하나의 AR콘텐츠를 결정하는 단계(미도시), 및 결정된 상기 하나의 AR 콘텐츠를 상기 포인트에 배치하는 단계(미도시)를 포함할 수 있다. 구체적으로, AR콘텐츠는 종류별로 카테고리화될 수 있다. AR콘텐츠가 증강현실을 이용한 광고라고 가정한다면, 해당 광고의 광고대상에 따라 패션, 서비스, 숙박 등 다양한 카테고리로 분류될 수 있고, 패션은 패션(의류), 패션(신발), 패션(악세사리) 등으로, 서비스는 서비스(카페), 서비스(음식), 서비스(세탁) 등으로, 숙박은 숙박 (호텔), 숙박(펜션), 숙박(리조트) 등으로 세분화될 수 있다. 리워드의 카테고리화도 동일한 방식으로 이루어질 수 있다. 예를 들어, 상품증정, 할인권, 쿠폰지급 등의 리워드 종류에 따라 카테고리화될 수 있다. 또한, AR콘 텐츠와 마찬가지로 리워드는 패션, 서비스, 숙박 등 다양한 카테고리로 분류될 수 있고, 패션 리워드는 패션(의 류)와 관련한 리워드(할인권 등), 패션(신발)과 관련한 리워드, 패션(악세사리)과 관련한 리워드 등으로, 서비 스는 서비스(카페)와 관련한 리워드(식료품 증정 등), 서비스(음식)와 관련한 리워드, 서비스(세탁)과 관련한 리워드 등으로, 숙박은 숙박(호텔)과 관련한 리워드(연박 할인권 등), 숙박(펜션)과 관련한 리워드, 숙박(리조 트)와 관련한 리워드 등으로 세분화될 수 있다. 카테고리화된 AR콘텐츠와 리워드는 해당 카테고리에 따라 서로 연결될 수 있다. 예를 들어, 패션(의류) 카테고리에 속하는 AR콘텐츠는 패션(의류) 카테고리에 속하는 리워드와 연결될 수 있다. AR콘텐츠와 리워드가 서로 연결된다는 의미는, 사용자가 AR콘텐츠를 활성화(시청 등)시켰을 때 그와 연결된 리워드가 사용자에게 지급되는 것을 의미한다. AR콘텐츠가 배치되는 위치는 스토어의 속성정보(위치, 업종 등)에 기초하여 결정된다. 이때, AR콘텐츠의 종류도 스토어의 속성정보에 의존할 수 있다. 예를 들어, 스토어가 신발가게인 경우, 신발과 관련된 카테고리 내의 AR 콘텐츠가 선택될 수 있다. 마찬가지로, AR콘텐츠에 대하여 부여되는 리워드 역시 스토어의 속성정보에 기초할 수 있다. 즉, 스토어가 신발가게인 경우, 신발과 관련된 카테고리 내의 리워드(할인권 등)가 선택될 수 있다. 위와 같은 방식으로 AR콘텐츠와 리워드가 결정되는 경우, 본 발명에 따른 경로생성방법에 의해 생성된 경로를 이용하는 사용자에게 리워드를 제공하고, 해당 리워드를 해당 경로 상에 위치하는 스토어에서 사용할 수 있게 함으로써 스토어의 수익창출에 기여할 수 있게 된다. 도 9는 본 발명에 따른 경로생성방법의 변형 실시예를 나타내는 흐름도이다. 먼저, 경로 속성 및 타겟지역 선택 에 대한 사용자 입력을 수신한다(S300). 여기서, 경로 속성은 경로의 편도이동시간, 왕복이동시간, 경로를 이용 하는 수단, 경로를 이용하는 시간, 경로의 도로교통법상 용도, 경로의 경사도, 지형, 경로를 포함하는 타겟지역 의 날씨, 기온, 습도, 경로의 시간별 밝기, 경로의 차량통행량 중 적어도 하나를 포함할 수 있다. 이후, 타겟지역 내에 위치하는 하나 이상의 스토어의 속성정보를 추출한다(S310). 이때, 스토어의 속성정보는 스토어의 위치, 등급, 업종 및 제공 리워드 중 적어도 하나에 대한 정보를 포함할 수 있다. 즉, 타겟지역 내의 스토어의 좌표(경도, 위도, GPS 정보), 스토어의 등급(회원 등급에 대응할 수 있음), 제공 리워드(스토어에 의 하여 제공되는 리워드, 스토어와 연관된 회원에 의하여 제공되는 리워드, 스토어/회원과 제휴된 리워드 제공자 에 의하여 제공되는 리워드)를 추출하고, 이는 AR콘텐츠가 배치될 위치를 결정하는 데 이용된다. 다음, 스토어 의 속성정보에 기초하여 AR콘텐츠가 배치될 복수의 포인트를 추출한다(S320). 복수의 포인트가 추출되면, 경로 속성에 기초하여 그에 적합한 복수의 포인트를 선정한다. 예를 들어, 사용자가 경로 속성으로 자전거를 입력한 경우(사용자단말로부터 '자전거'의 경로 속성을 입력받은 경우), 추출된 복수의 포인트 중 자전거로 이동가능한 위치에 배치된 포인트를 선정할 수 있다. 또한, 사용자가 경로 속성으로 '도보, 왕복이동시간: 3시간'을 입력한 경우(사용자단말로부터 '도보, 왕복이동시간: 3시간'의 경로 속성을 입력받은경우), 추출된 복수의 포인트 중 사용자의 현재위치로부터 최대 1시간30분 도보거리에 위치한 포인트를 선정할 수 있다. 마지막으로, 이렇게 선정된 포인트를 연결하는 경로를 생성한다(S340). 나아가, 타겟지역의 맵을 추출하는 단계(S400), 생성된 경로를 맵 상에 표시하는 단계(S410), 맵 상에서 복수의 포인트가 위치하는 좌표에 AR콘텐츠를 배치하는 단계(S420)를 더 포함할 수 있다. 도 10 내지 13은 본 발명에 따른 경로생성방법에 있어서 AR콘텐츠가 배치될 포인트를 선정하는 방식을 설명하기 위한 도면이다. 위에서 언급한 바와 같이, 본 발명에 따른 경로생성방법은 스토어의 속성정보에 기초하여 AR콘텐츠가 배치될 복 수의 포인트를 선정한다. 도 10에 도시된 바와 같이, 복수의 포인트는 스토어의 좌표로부터 소정 반경 이내에 위치될 수 있다. 그 전에, 복수의 포인트 선정의 기준이 되는 스토어의 선정이 선행되는데, 이 역시 스토어의 속성정보(예: 업종, 등급 등)에 기초할 수 있다. 예를 들어, 사용자가 의류 쇼핑을 목적으로 이동하는 경우, 의류 업종에 속하는 스토어 를 선정하고, 다시 해당 스토어의 위치에 기초하여 복수의 포인트 선정이 이루어질 수 있다. 이때, 복수의 포인 트는 스토어의 좌표로부터 소정 반경 이내에 위치할 수 있지만, 사용자의 이동수단에 따라 좌표가 배치될 수 있 는 구간이 한정될 수 있다. 예를 들어, 사용자의 이동수단이 자동차인 경우, 복수의 포인트의 위치는 자동차 도 로 내로 한정될 수 있다. 사용자의 이동수단이 도보인 경우, 복수의 포인트의 위치는 자동차 도로를 제외하는 영역으로 한정될 수 있다. 사용자의 이동수단, 이동 목적은 사용자로부터 입력된 경로 속성으로부터 판단할 수 있다. 도 11에 도시된 바와 같이, 복수의 포인트는 스토어의 좌표로부터 소정 반경 이내에 위치할 수 있다. 도 11에서 는 스토어(S)로부터 10m 반경 이내의 자동차 도로 상에 4개의 포인트(P1 내지 P4)가 선정된 것으로 도시되었으 나, 반경의 크기, 포인트의 개수는 이와 상이해도 무방하다. 이후, 4개의 포인트(P1 내지 P4)를 연결하는 경로 (R-R')가 생성되고, 해당 경로는 맵 상에 오버랩되어 사용자단말에 디스플레이될 수 있다. 또한, 도 12에 도시된 바와 같이, 복수의 포인트는 스토어의 중간 지점에 위치할 수 있다. 도 12에서는 제1 스 토어(S5)와 제2 스토어(S6) 중간에 제1 포인트(P5), 제2 스토어(S6)와 제3 스토어(S7) 중간에 제2 포인트(P6), 제3 스토어(S7)와 제4 스토어(S8) 중간에 제3 포인트(P7)이 선정된 것으로 도시되었으나, 포인트의 개수는 이와 상이해도 무방하다. 이후, 3개의 포인트(P5 내지 P7)를 연결하는 경로(R-R')가 생성되고, 해당 경로는 맵 상에 오버랩되어 사용자단말에 디스플레이될 수 있다. 이는 복수의 스토어의 등급이 동일한 경우에 해당하며, 스토어 의 등급이 상이한 경우에는 중간 지점이 아닌, 높은 등급의 스토어에 더욱 가깝게 포인트가 선정될 수도 있다. 도 13에 도시된 바와 같이, 포인트(P1 내지 P7)의 위치는 AR콘텐츠의 속성정보로 포함될 수 있다. 즉, AR콘텐츠 는 해당 포인트의 위치에 배치되고, 사용자단말이 해당 포인트의 위치에 인접 혹은 일치하면 AR콘텐츠가 사용자 단말에 표시되고, AR콘텐츠에 대한 리워드가 사용자단말에 전송될 수 있다. 도로를 주행하는 자동차인 경우, 사 용자단말은 내비게이션, HUD, 혹은 자동차 내에 거치된 스마트폰 등일 수 있을 것이다. 한편, 다른 실시예에서는 포인트의 선정이 복수의 스토어의 속성정보를 비교하여 이루어질 수 있다. 즉, 복수의 포인트를 선정하는 단계는, 소정 영역 내에 2개 이상의 스토어가 위치하는지 판단하는 단계(미도시), 2개 이상 의 스토어의 속성정보를 비교하는 단계(미도시), 및 속성정보의 비교 결과에 기초하여 포인트의 위치를 결정하 는 단계(미도시)를 포함할 수 있다. 이때, 주로 이용되는 스토어의 속성정보는 등급 정보일 수 있다. 예를 들어, 소정 영역 내에 2개 이상의 스토어가 위치하는 경우, 스토어의 등급을 비교하고, 등급이 높은 스토어의 위치를 기준으로 포인트를 선정할 수 있다. 즉, 스토어의 등급에 따라 포인트의 위치가 결정되기 때문에, 회원 비를 많이 지불한 스토어(회원)를 우선적으로 경유하도록 경로가 생성될 수 있다. 한편, 상기 스토어는 가상세계(예: 메타버스) 내에 배치될 수 있다. 즉, 타겟지역은 온라인 상의 가상세계 내의 지역이고, 하나 이상의 스토어는 가상세계 내에 배치된 가상스토어일 수 있다. 메타버스와 같은 가상세계 내에 서는 복수의 포인트가 위치하는 가상현실 상의 좌표에 상기 AR콘텐츠를 배치하고, 생성된 경로와 함께 AR콘텐츠 를 디스플레이할 수 있다. 즉, 본 발명에 따른 경로생성방법은, 경로를 생성할 가상세계 내의 타겟지역 선택에 대한 사용자 입력을 수신하 는 단계, 가상세계 내의 타겟지역 내에 위치하는 하나 이상의 가상스토어의 속성정보를 추출하는 단계, 상기 속 성정보에 기초하여 AR콘텐츠가 배치될 복수의 포인트를 선정하는 단계, 및 복수의 포인트를 연결하는 경로를 상 기 가상세계 내에 생성하는 단계를 포함할 수 있다.도 14는 본 발명에 따른 경로생성방법에 있어서 추천경로 생성방식을 나타내는 도면이다. 본 발명에 따른 경로 생성방법은, 복수의 포인트를 선정하는 데 이용된 복수의 스토어의 등급 또는 업종에 기초하여 추천경로를 생성 하는 단계를 더 포함할 수 있다. 타겟지역 선택에 대한 사용자 입력을 수신하고(S500), 타겟지역 내에 위치하는 하나 이상의 스토어의 속성정보 를 추출하며(S510), 속성정보에 기초해 AR콘텐츠가 배치될 복수의 포인트를 선정(S520)하는 단계는 위에서 설명 한 바와 같다. 이후, 추천경로를 생성하는 단계가 이루어진다. 이는 스토어의 등급 및 업종 중 적어도 하나에 기초하여 복수의 포인트에 대하여 가중치를 부여하는 단계(S530), 각 포인트에 대한 경로추천 스코어를 산정하는 단계(S540), 각 포인트의 경로추천 스코어에 기초하여 복수의 추천 포인트를 선정하는 단계(S550), 및 복수의 추천 포인트를 연 결하는 추천경로를 생성하는 단계(S560)를 포함한다. 가중치는 스토어에 등급에 따라 달라질 수 있다. 동일 지역 내에 많은 스토어가 위치하는 경우, 다양한 포인트 조합이 만들어질 수 있고, 이는 다양한 경로를 생성하게 된다. 추천경로는 최단거리, 최소시간거리, 최소비용거 리를 기준으로 생성될 수 있지만, 본 발명에서는 AR콘텐츠를 이용하기 때문에 더욱 많은 리워드 혹은 더욱 큰 리워드를 제공하는 경로를 추천경로로 생성할 수 있다. 사용자는 이동거리나 이동시간이 조금 더 커지는 것을 감안하더라도, 더욱 큰 리워드를 받을 수 있기 때문에 본 발명에 따라 생성된 추천경로를 이용할 수 있다. 추천경로는 경로추천 스코어(Sc)를 기준으로 선정된 포인트에 기초하여 생성되며, 경로추천 스코어(Sc)는 아래 의 수식에 의하여 산정될 수 있다. 수학식 1"}
{"patent_id": "10-2023-0016744", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "(Sc: 경로추천 스코어, a, b, c, d: 상수, Ms: 가중치, Ns: 도로인접성, As: 포인트간 접근성, Ts: 스토어 업 종 유사도) 가중치(Ms)는 스토어 등급에 따른 포인트의 가중치를 의미하며, 스토어의 등급이 높을수록 높은 가중치가 부여 되고, 스토어의 등급이 낮을수록 낮은 가중치가 부여될 수 있다. 가중치(Ms)에 곱해지는 상수(a)는 다양하게 설 정될 수 있다. 회원 등급과 무관하게 동일한 가중치를 적용하고자 하는 경우에는 상수(a)가 0으로 설정될 수 있 다. 도로인접성(Ns)은 포인트가 도로와의 인접성 정도를 의미한다. 도로인접성(Ns)에 곱해지는 상수(b)는 다양하게 설정될 수 있다. 만약, 사용자로부터 입력된 경로 속성이 '도보'인 경우, 상수(b)는 음수로 설정되어 추천경로 스코어가 작아질 수 있다. 포인트간 접근성(As)은 주변에 얼마나 많은 포인트가 위치했는지를 의미한다. 포인트간 접근성(As)은 소정 거리 이내의 영역에 배치된 포인트 개수에 따라 달라질 수 있다. 주변에 많은 포인트가 위치할수록 커지고, 적은 포 인트가 위치할수록 작아질 수 있다. 포인트간 접근성(As)은 동일 면적 내에 얼마나 많은 스토어가 포함되어 있 는지를 의미할 수 있다. 포인트간 접근성(As)에 곱해지는 상수(c)는 다양하게 설정될 수 있다. 만약, 사용자로 부터 입력된 경로 속성이 '도보'인 경우, 상수(c)가 높게 설정되어 도보상으로 경유될 수 있는 스토어의 개수가 많은 포인트가 추천경로에 포함될 수 있게 한다. 스토어 업종 유사도(Ts)는 사용자로부터 입력된 경로 속성과 스토어의 관련성을 의미한다. 스토어 업종 유사도 (Ts)는 스토어의 업종과 '의류' 사이의 관련성이 높을수록 커지고, 관련성이 낮을수록 작아질 수 있다. 스토어 의 업종 유사도(Ts)에 곱해지는 상수(d)는 다양하게 설정될 수 있다. 만약, 스토어의 업종 무관하게 추천경로를 생성하고자 하는 경우라면, 상수(d)를 0으로 설정할 수 있다. 또한, 사용자단말로부터 이동 목적과 관련한 경로 속성이 입력된 경우, 상수(d)가 높게 설정되어 이동 목적(예: 의류 쇼핑)과의 관련성이 높은 스토어에 대응하는 포인트에 기초하여 추천경로가 생성될 수 있다. AR콘텐츠 및 AR콘텐츠의 리워드 중 적어도 하나는 스토어의 업종에 기초하여 결정될 수 있다. 즉, 스토어의 업 종과 관련한 카테고리 내에 있는 AR콘텐츠 중에서 하나가 선택되어 추천 포인트에 배치될 수 있다. 마찬가지로, 스토어의 업종과 관련한 카테고리 내에 있는 리워드 중에서 하나가 선택되어 추천 포인트에 배치된 AR콘텐츠에연결될 수 있다. 본 발명에 따른 경로생성방법은 경로의 출발지와 도착지 정보가 없어도 무방하다. 즉, 본 발명에 따른 경로생성 방법에 의하여 생성되는 경로는, 특정 목적지로 향하는 길찾기 경로가 아닌, 자전거, 오토바이, 트래킹, 등산 등의 레포츠를 즐기기 위한 경로로 이용될 수 있으며, 이때에는 타겟지역과 타겟지역 내의 경로만 사용자에게 제공되면 충분하다. 다만, 다른 실시예에서는 사용자로부터 출발지와 도착지 정보를 더 입력받고, 출발지와 도 착지 정보가 경로 생성에 반영될 수 있다. 출발지 정보 및 도착지 정보는 사용자의 현재 GPS정보 및/또는 사용 자단말로부터 입력된 위치정보로부터 획득될 수 있을 것이다. 다시 말해, 본 발명에 따른 경로생성방법에서는 출발지, 복수의 포인트 및 도착지를 연결하는 경로를 생성하는 것도 가능하다. 도 15 및 16은 본 발명에 따른 경로생성방법이 수행되는 환경을 설명하기 위한 개념도이다. 본 발명에 따른 경로생성방법은 서버 또는 단말 등 다양한 장치에서 수행될 수 있다. 예를 들어, 본 발명에 따 른 경로생성방법이 수행되는 장치는 디지털 기기로서, 랩탑 컴퓨터, 노트북 컴퓨터, 데스크톱 컴퓨터, 웹 패드, 이동 전화기와 같이 프로세서를 탑재하고 메모리를 구비한 연산 능력을 갖춘 디지털 기기일 수 있다. 또한, 예 를 들어, 본 발명에 따른 경로생성방법이 수행되는 장치는 경로생성 및 제공 플랫폼, AR콘텐츠 생성 및 제공 플 랫폼, 리워드 생성 및 제공 플랫폼 등의 각종 서비스를 제공하는 웹 서버일 수 있다. 다만, 위의 서버의 종류는 예시일 뿐이며 본 발명은 이에 제한되지 않는다. 본 발명에 따른 경로생성방법을 수행하는 장치는 클라우드 컴퓨팅 서비스를 제공하는 서버일 수 있다. 보다 구 체적으로, 본 발명에 따른 경로생성방법을 수행하는 장치는 인터넷 기반 컴퓨팅의 일종으로 정보를 사용자의 컴 퓨터가 아닌 인터넷에 연결된 다른 컴퓨터로 처리하는 클라우드 컴퓨팅 서비스를 제공하는 서버일 수 있다. 클 라우드 컴퓨팅 서비스는 인터넷 상에 자료를 저장해 두고, 사용자가 필요한 자료나 프로그램을 자신의 컴퓨터에 설치하지 않고도 인터넷 접속을 통해 언제 어디서나 이용할 수 있는 서비스일 수 있다. 인터넷 상에 저장된 자 료들을 간단한 조작 및 클릭으로 쉽게 공유하고 전달할 수 있다. 또한, 클라우드 컴퓨팅 서비스는 인터넷 상의 서버에 단순히 자료를 저장하는 것뿐만 아니라, 별도로 프로그램을 설치하지 않아도 웹에서 제공하는 응용프로 그램의 기능을 이용하여 원하는 작업을 수행할 수 있으며, 여러 사람이 동시에 문서를 공유하면서 작업을 진행 할 수 있는 서비스일 수 있다. 또한, 클라우드 컴퓨팅 서비스는 IaaS(Infrastructure as a Service), PaaS(Platform as a Service), SaaS(Software as a Service), 가상 머신 기반 클라우드 서버 및 컨테이너 기반 클라우드 서버 중 적어도 하나의 형태로 구현될 수 있다. 즉, 본 발명에 따른 경로생성방법을 수행하는 장치는 상술한 클라우드 컴퓨팅 서비스 중 적어도 하나의 형태로 구현될 수 있다. 전술한 클라우드 컴퓨팅 서비스의 구 체적인 기재는 예시일 뿐, 본 발명의 클라우드 컴퓨팅 환경을 구축하는 임의의 플랫폼을 포함할 수도 있다. 본 발명에 따른 경로생성방법을 수행하는 장치는 프로세서, 저장부, 통신부 등의 구성을 포함할 수 있다. 프로세서는 위에서 설명한 경로생성방법을 수행한다. 즉, 프로세서는 스토어의 속성정보 추출, 타겟지역의 맵 추출, 포인트 선정, 추천포인트 선정, 포인트의 GPS좌표 추출, 경로생성, AR콘텐츠 생성 및 배치, 리워드 설정, AR콘텐츠와 리워드 연결, 추천경로 생성, 맵과 경로의 합성 등의 기능을 수행한다. 프로세서는 저장부에 저장된 컴퓨터 프로그램을 판독하여 본 발명에 따른 경로생성방법을 수행할 수 있다. 프로 세서는 하나 이상의 코어로 구성될 수 있으며, 컴퓨팅 장치의 중앙 처리 장치(CPU: Central Processing Unit), 범용 그래픽 처리 장치 (GPGPU: General Purpose Graphics Processing Unit), 텐서 처리 장치(TPU: Tensor Processing Unit) 등으로 구현될 수 있다. 저장부는 각종 속성정보를 저장한다. 각종 속성정보는 사용자정보, 지역정보, AR콘텐츠 정보, 리워드 정보, 경 로정보 등일 수 있으나 이에 한정되지 않는다. 저장부는 AR콘텐츠 정보와 리워드 정보를 카테고리별로 분류하여 저장할 수 있다. 또한, 저장부는 본 발명에 따른 경로생성방법을 수행하는 컴퓨터 프로그램 명령을 기록할 수 있고, 이는 프로세서에 의하여 판독될 수 있다. 통신부는 외부 디바이스, 외부 서버와 유무선으로 연결되어 각종 신호와 데이터를 송수신한다. 여기서, 외부 디 바이스는 스마트폰, 태블릿 PC, 내비게이션, 스마트워치 등일 수 있다. 나아가, 외부 디바이스는 모바일폰 (mobile phone), 화상 전화기, 전자북 리더기(e-book reader), 랩탑 PC(laptop personal computer), 넷북 컴퓨 터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), 웨어러블 장치 (wearable device)(예: 스마트 안경, 헤드마운티드 디스플레이 (head-mounted-device, HMD), 스마트 미러 (smart mirror), 키오스크(kiosk) 등으로 구현될 수 있다. 통신부는 유선 통신망 또는 무선 통신망을 통해 스마 트폰, 스마트워치, 내비게이션 등과 데이터 송수신을 수행한다. 이때, 유선 통신망은 HDMI(high-definitionmultimedia interface), USB(universal serial bus)등의 유선 케이블을 이용한 유선 통신망을 포함할 수 있지 만, 이에 한정되지 않는다. 무선 통신망은 지웨이브(Z-wave), 지그비(zigbee), 와이파이(wifi), 블루투스(ble), LTE-M, 로라(LoRa, long Range), 협대역 사물인터넷(NB-IoT), 적외선통신(Infrared Data Association, IrDA) 등의 근거리 무선 통신망을 포함할 수 있다. 또한, 무선통신망은 무선랜(Wireless LAN, WLAN), 와이브로 (Wireless Broadband, Wibro), Wifi(wireless fidelity), WiMax(world interoperability for microwave access), GSM(global system for mobile communication) 또는 CDMA(code division multiple access)와 같은 2G 이동통신망, WCDMA(wideband code division multiple access) 또는 CDMA2000과 같은 3G 이동통신망, HSDPA(high speed downlink packet access) 또는 HSUPA(high speed uplink packet access)와 같은 3.5G 이동 통신망, LTE(long term evolution)망 또는 LTE-Advanced망과 같은 4G, 5G, 6G 이동통신망 등을 포함할 수 있지 만, 이에 한정되지 않는다. 본 발명에 따른 경로생성방법은 다양한 컴퓨터 수단을 통하여 수행될 수 있는 프로그램 명령 형태로 구현되어 컴퓨터 판독 가능 매체에 기록될 수 있다. 컴퓨터 판독 가능 기록 매체는 프로그램 명령, 데이터 파일, 데이터 구조 등을 단독으로 또는 조합하여 포함할 수 있다. 상기 매체에 기록되는 프로그램 명령은 본 발명을 위하여 특별히 설계되고 구성된 것들이거나 컴퓨터 소프트웨어 당업자에게 공지되어 사용 가능한 것일 수도 있다. 컴퓨 터 판독 가능 기록 매체의 예에는 하드 디스크, 플로피 디스크 및 자기 테이프와 같은 자기 매체(magnetic media), CD-ROM, DVD와 같은 광기록 매체(optical media), 플롭티컬 디스크(floptical disk)와 같은 자기-광 매체(magneto-optical media), 및 롬(ROM), 램(RAM), 플래시 메모리 등과 같은 프로그램 명령을 저장하고 수행 하도록 특별히 구성된 하드웨어 장치가 포함된다. 프로그램 명령의 예에는 컴파일러에 의해 만들어지는 것과 같 은 기계어 코드뿐만 아니라 인터프리터 등을 사용해서 컴퓨터에 의해서 실행될 수 있는 고급 언어 코드를 포함 한다. 상기된 하드웨어 장치는 본 발명의 동작을 수행하기 위해 하나 이상의 소프트웨어 모듈로서 작동하도록 구성될 수 있으며, 그 역도 마찬가지이다. 또한, 이상에서 실시예를 중심으로 설명하였으나 이는 단지 예시일 뿐 본 발명을 한정하는 것이 아니며, 본 발 명이 속하는 분야의 통상의 지식을 가진 자라면 본 실시예의 본질적인 특성을 벗어나지 않는 범위에서 이상에 예시되지 않은 여러 가지의 변형과 응용이 가능함을 알 수 있을 것이다. 예를 들어, 실시예에 구체적으로 나타 난 각 구성 요소는 변형하여 실시할 수 있는 것이다. 그리고 이러한 변형과 응용에 관계된 차이점들은 첨부된 청구 범위에서 규정하는 본 발명의 범위에 포함되는 것으로 해석되어야 할 것이다."}
{"patent_id": "10-2023-0016744", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 2는 본 발명에 따른 경로생성방법을 개략적으로 설명하기 위한 개념도이다. 도 3은 본 발명에 따른 경로생성방법에 이용되는 각종 속성정보를 도시한다. 도 4는 본 발명에 따른 경로생성방법에 이용되는 속성정보 중 AR콘텐츠 정보 및 리워드 정보를 구체화한 도면이 다. 도 5는 본 발명에 따른 경로생성방법의 흐름도이다. 도 6은 본 발명에 따른 경로생성방법에서 포인트의 위치정보를 AR콘텐츠에 연결하는 방법을 설명하는 도면이다. 도 7은 본 발명에 따른 경로생성방법에서 리워드 제공방식을 나타내는 흐름도이다. 도 8은 본 발명에 따른 경로생성방법에서 리워드 결정방식을 나타내는 흐름도이다. 도 9는 본 발명에 따른 경로생성방법의 변형 실시예를 나타내는 흐름도이다. 도 10 내지 13은 본 발명에 따른 경로생성방법에 있어서 AR콘텐츠가 배치될 포인트를 선정하는 방식을 설명하기 위한 도면이다.도 14는 본 발명에 따른 경로생성방법에 있어서 추천경로 생성방식을 나타내는 도면이다. 도 15 및 16은 본 발명에 따른 경로생성방법이 수행되는 환경을 설명하기 위한 개념도이다."}
