{"patent_id": "10-2023-0157729", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0030877", "출원번호": "10-2023-0157729", "발명의 명칭": "동물을 포함하는 이미지의 촬영 방법 및 그 전자 장치", "출원인": "삼성전자주식회사", "발명자": "이민영"}}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치(300)에 있어서,카메라(310);디스플레이(320);프로세서(330); 및인스트럭션들을 저장하는 메모리(340)를 포함하고,상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 카메라(310)를 이용하여 획득된 프리뷰 이미지를 상기 디스플레이(320) 상에 표시하는 동안, 상기 프리뷰이미지에 포함된 동물의 움직임을 확인하고,상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를획득하고,상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출값을 기반으로 캡처된 이미지를 획득하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서, 상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 프리뷰 이미지를 상기 디스플레이 상(320)에 표시하는 동안, 상기 동물의 신체 부위 식별을 위한 제1 정보와 상기 동물의 움직임 발생 여부를 판단하기 위한 제2 정보를 획득하고,상기 제1 정보 및 상기 제2 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 2에 있어서, 상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 프리뷰 이미지를 복수 개의 영역들로 분할하고,상기 복수 개의 영역들 중 상기 동물이 검출된 영역을 분석하여 상기 동물의 신체 부위를 식별하도록 설정되는,전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 2에 있어서,상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 프리뷰 이미지를 복수 개의 영역들로 분할하고,상기 복수 개의 영역 별 픽셀 움직임을 분석하여 상기 동물의 움직임 발생 여부를 판단하도록 설정되는, 전자장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "공개특허 10-2025-0030877-3-청구항 2에 있어서, 상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 동물의 신체 부위가 팔, 다리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 제2 정보를 기반으로 상기 동물에 대하여 움직임이 발생하였는지 여부를 판단하고,상기 동물에 대하여 움직임이 발생하였다고 판단되면, 상기 동물의 움직임에 따른 예상 속도를 계산하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "청구항 5에 있어서,상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 프리뷰 이미지를 제공하는 동안 지정된 시간 간격으로 획득된 복수 개의 프레임으로부터 광학 흐름(optical flow)을 추출하고,상기 추출된 광학 흐름을 기반으로 상기 프리뷰 이미지 내 픽셀 움직임을 추정하고,상기 추정된 픽셀 움직임을 기반으로 상기 예상 속도를 계산하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 5에 있어서,상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 계산된 예상 속도가 기준 속도보다 크거나 같으면, 상기 동물에 대하여 확인된 움직임의 크기가 상기 임계값보다 크다고 판단하고,상기 제1 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 5에 있어서,상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 계산된 예상 속도가 기준 속도보다 작으면, 상기 동물에 대하여 확인된 움직임의 크기가 상기 임계값보다작다고 판단하고,상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "청구항 1에 있어서, 상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 동물의 신체 부위가 머리, 귀, 몸통 또는 꼬리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 동물에대하여 확인된 움직임의 크기가 상기 임계값 미만인 것으로 추정하고,상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "청구항 1에 있어서, 상기 프로세서(330)는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치(300)가,상기 확인된 움직임의 크기가 상기 임계값보다 크면, 상기 카메라(310)의 선명도 또는 색상 보정 레벨을 제1 레벨로 설정하고,상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메라(310)의 선명도 또는 색상 보정 레벨을 상기공개특허 10-2025-0030877-4-제1 레벨보다 낮은 제2 레벨로 설정하도록 설정되는, 전자 장치."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치(300)의 동작 방법에 있어서,카메라(310)를 이용하여 획득된 프리뷰 이미지를 디스플레이(320) 상에 표시하는 동안, 상기 프리뷰 이미지에포함된 동물의 움직임을 확인하는 동작;상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라(310)를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획득하는 동작; 및상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메라(310)를 통해, 상기 제1 노출 값보다 큰 제2노출 값을 기반으로 캡처된 이미지를 획득하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "청구항 11에 있어서, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작은,상기 프리뷰 이미지를 상기 디스플레이 상(320)에 표시하는 동안, 상기 동물의 신체 부위 식별을 위한 제1 정보와 상기 동물의 움직임 발생 여부를 판단하기 위한 제2 정보를 획득하는 동작; 및상기 제1 정보 및 상기 제2 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "청구항 12에 있어서, 상기 제1 정보를 획득하는 동작은,상기 프리뷰 이미지를 복수 개의 영역들로 분할하는 동작; 및상기 복수 개의 영역들 중 상기 동물이 검출된 영역을 분석하여 상기 동물의 신체 부위를 식별하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "청구항 12에 있어서,상기 제2 정보를 획득하는 동작은,상기 프리뷰 이미지를 복수 개의 영역들로 분할하는 동작; 및상기 복수 개의 영역 별 픽셀 움직임을 분석하여 상기 동물의 움직임 발생 여부를 판단하는 동작을 포함하는,방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "청구항 12에 있어서, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작은,상기 동물의 신체 부위가 팔, 다리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 제2 정보를 기반으로 상기 동물에 대하여 움직임이 발생하였는지 여부를 판단하는 동작; 및상기 동물에 대하여 움직임이 발생하였다고 판단되면, 상기 동물의 움직임에 따른 예상 속도를 계산하는 동작을포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2025-0030877-5-청구항 15에 있어서,상기 동물의 움직임에 따른 예상 속도를 계산하는 동작은,상기 프리뷰 이미지를 제공하는 동안 지정된 시간 간격으로 획득된 복수 개의 프레임으로부터 광학 흐름(optical flow)을 추출하는 동작;상기 추출된 광학 흐름을 기반으로 상기 프리뷰 이미지 내 픽셀 움직임을 추정하는 동작; 및상기 추정된 픽셀 움직임을 기반으로 상기 예상 속도를 계산하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "청구항 15에 있어서,상기 계산된 예상 속도가 기준 속도보다 크거나 같으면, 상기 동물에 대하여 확인된 움직임의 크기가 상기 임계값보다 크다고 판단하는 동작; 및상기 제1 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "청구항 15에 있어서,상기 계산된 예상 속도가 기준 속도보다 작으면, 상기 동물에 대하여 확인된 움직임의 크기가 상기 임계값보다작다고 판단하는 동작; 및상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "청구항 12에 있어서, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작은,상기 동물의 신체 부위가 머리, 귀, 몸통 또는 꼬리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 동물에대하여 확인된 움직임의 크기가 상기 임계값 미만인 것으로 추정하는 동작; 및상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하는 동작을 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "청구항 11에 있어서, 상기 확인된 움직임의 크기가 상기 임계값보다 크면, 상기 카메라(310)의 선명도 또는 색상 보정 레벨을 제1 레벨로 설정하는 동작; 및상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메라(310)의 선명도 또는 색상 보정 레벨을 상기제1 레벨보다 낮은 제2 레벨로 설정하는 동작을 더 포함하는, 방법."}
{"patent_id": "10-2023-0157729", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "컴퓨터에서 실행 가능한 프로그램들이 기록된 컴퓨터로 판독 가능한 기록 매체에 있어서, 상기 프로그램들은,카메라를 이용하여 획득된 프리뷰 이미지를 디스플레이 상에 표시하는 동안, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작;상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를획득하는 동작; 및상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출값을 기반으로 캡처된 이미지를 획득하는 동작을 수행하기 위하여 상기 컴퓨터에 의해 야기되는, 기록 매체.공개특허 10-2025-0030877-6-"}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 카메라, 디스플레이, 프로세서, 및 인스트럭션들을 저장하 는 메모리를 포함할 수 있다. 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 카메라를 이용하여 획득된 프리뷰 이미지를 상기 디스플레이 상에 표시하는 동안, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하고, 상기 확인된 움직임의 크기가 임계값보다 크면 상기 카메라를 통해 제1 노출 값을 기반으로 캡처된 이미지를 획 득하고, 상기 확인된 움직임의 크기가 상기 임계값보다 작으면 상기 카메라를 통해 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이미지를 획득하도록 설정될 수 있다. 이 외에도 본 문서를 통해 파악되는 다양한 실 시 예들이 가능하다."}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 문서에 개시되는 다양한 실시 예들은 동물을 포함하는 이미지를 촬영하는 방법 및 그 전자 장치에 관한 것이다."}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일상 생활에서 휴대 전자 장치를 소지하는 것이 일반화되면서, 휴대 전자 장치의 카메라 기능 활용이 크게 증가 하였고, 카메라 기능이 휴대 전자 장치를 선택하는 기준이 될 정도로 휴대 전자 장치를 이용한 촬영은 없어서는 안될 기능으로 인식되고 있다. 최근에는, 반려동물을 키우는 인구가 크게 증가하면서, 동물의 촬영과 관련된 기 능에 대한 요구사항이 많아지고 있다. 예컨대, 전자 장치는 촬영하고자 하는 피사체가 동물임을 인식하면, 모션 블러를 최소화하기 위해 카메라의 셔터 속도를 줄이거나 또는 동물의 특성을 잘 표현하기 위해 선명도나 색감과 같은 설정을 변경함으로써 동물에 최적화된 이미지를 획득할 수 있다. 상술한 정보는 본 개시에 대한 이해를 돕기 위한 목적으로 하는 배경 기술(related art)로 제공될 수 있다. 상 술한 내용 중 어느 것도 본 개시와 관련된 종래 기술(prior art)로서 적용될 수 있는지에 대하여 어떠한 주장이 나 결정이 제기되지 않는다."}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 문서에 개시되는 일 실시 예에 따른 전자 장치는, 카메라, 디스플레이, 프로세서, 및 인스트럭션들을 저장하 는 메모리를 포함할 수 있다. 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 카메라를 이용하여 획득 된 프리뷰 이미지를 상기 디스플레이 상에 표시하는 동안, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인 하도록 설정될 수 있다. 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 확인된 움직임의 크기가 임계 값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획득하도록 설정될 수 있다. 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메 라를 통해, 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이미지를 획득하도록 설정될 수 있다. 본 문서에 개시되는 일 실시 예에 따른 전자 장치의 동작 방법은, 카메라를 이용하여 프리뷰 이미지를 디스플레 이 상에 표시하는 동안 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작을 포함할 수 있다. 상기 전자 장치의 동작 방법은, 상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획득하는 동작을 포함할 수 있다. 상기 전자 장치의 동작 방법은, 상기 확인된 움직 임의 크기가 상기 임계값보다 작으면, 상기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이미지를 획득할 수 있다. 본 문서에 개시되는 일 실시 예에 따른 컴퓨터로 판독 가능한 기록 매체는, 컴퓨터에서 실행 가능한 프로그램들 을 포함할 수 있다. 상기 프로그램들은, 카메라를 이용하여 획득된 프리뷰 이미지를 디스플레이 상에 표시하는 동안, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작을 수행할 수 있다. 상기 프로그램들은, 상 기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획 득하는 동작을 수행할 수 있다. 상기 프로그램들은, 상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상 기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이미지를 획득하는 동작을 수행할 수 있다."}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 문서에 개시된 다양한 실시 예들이 설명된다. 이는 본 개시의 다양한 실시 예 들을 특정한 형태로 한정하려는 것이 아니며, 본 개시의 다양한 변경(modification), 균등물(equivalent), 및/ 또는 대체물(alternative)을 포함하는 것으로 이해되어야 한다. 동물을 대상으로 하는 촬영이 증가함에 따라 최적화된 동물 이미지를 획득하기 위한 다양한 방법들이 시도되고 있다. 스마트폰과 같은 전자 장치에서는 AI(artificial intelligence) 기반의 영상인식 기술을 이용하여 촬영 중 프리뷰 이미지로부터 동물을 인식할 수 있다. 일반적으로, 전자 장치는 촬영 중 동물이 인식되면, 셔터 속도 를 줄이거나 선명도 또는 색감을 강조하도록 촬영 파라미터를 설정할 수 있다. 전자 장치는 동물의 행동 특성이 나 움직임과 관계없이, 동물이 인식되면 일률적으로 촬영 파라미터를 설정 또는 변경할 수 있다. 예를 들어, 다 양한 종류의 동물 중에서 강아지는 끊임없이 움직이는 반면에 고양이는 강아지에 비해 움직임이 많지 않은데, 동물 촬영 시 이러한 동물의 행동 특성이나 움직임은 고려되지 않을 수 있다. 이로 인해, 장면에 적절하지 않은 노이즈 부스팅(noise boosting) 및/또는 과도한 선명도나 색감이 표현된 이미지가 획득될 수 있어 동물을 촬영 하고자 하는 사용자에게 불편함을 줄 수 있다. 본 문서의 다양한 실시 예들에서는, 동물 촬영 시 프리뷰 이미지로부터 인식된 동물의 움직임을 검출하고, 움직 임이 검출된 동물의 속도를 예측하여 촬영 파라미터를 설정함으로써, 동물에 최적화된 장면의 이미지를 획득하 기 위한 다양한 실시 예들을 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또"}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "다른 기술적 과제들은 본 문서에 속하는 기술분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것 이다. 도 1은 일 실시 예에 따른 네트워크 환경 내의 전자 장치를 도시한 도면이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치와 통신하거나, 또는 제2 네트워크(예: 원거리 무선 통신 네트워크)를 통하여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치 는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시 예에 따르면, 전자 장치는 프로세 서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터 리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시 예에서 는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시 예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈 , 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시 예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성메모리에 저장할 수 있다. 일 실시 예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시 예에 따르 면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다 른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시 예에 따르면, 보 조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted Boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시 예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시 예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시 예에 따르면, 센서모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시 예에 따르면, 인터페이스는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인 터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시 예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시 예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시 예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시 예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시 예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시 예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제1 네트워크(예: 블 루투스, Wi-Fi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제1 네트워크 또는 제2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시 예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운 링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시 예에 따르면, 안테나 모듈은 복수의 안테 나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제1 네트워크 또는 제2 네트워크와 같은 통 신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시 예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시 예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시 예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제1 면(예: 아래 면)에 또는 그에 인접하여 배치 되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제2 면(예: 윗면 또는 측면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있는 복수 의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시 예에 따르면, 명령 또는 데이터는 제2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는 104) 각각은 전자 장치 와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시 예에 따르면, 전자 장치에서 실행되는 동작들 의 전부 또는 일부는 외부의 전자 장치들(102, 104, 또는 108) 중 하나 이상의 외부의 전자 장치에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 일 실시 예에 있어서, 외부의 전 자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이 용한 지능형 서버일 수 있다. 일 실시 예에 따르면, 외부의 전자 장치 또는 서버는 제2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 2를 참조하면, 카메라 모듈은 렌즈 어셈블리, 플래쉬, 이미지 센서, 이미지 스태빌라이 저, 메모리(예: 버퍼 메모리), 또는 이미지 시그널 프로세서를 포함할 수 있다. 렌즈 어셈블리 는 이미지 촬영의 대상인 피사체로부터 방출되는 빛을 수집할 수 있다. 렌즈 어셈블리는 하나 또는 그 이상의 렌즈들을 포함할 수 있다. 일실시예에 따르면, 카메라 모듈은 복수의 렌즈 어셈블리들을 포함할 수 있다. 이런 경우, 카메라 모듈은, 예를 들면, 듀얼 카메라, 360도 카메라, 또는 구형 카메라 (spherical camera)를 형성할 수 있다. 복수의 렌즈 어셈블리들 중 일부는 동일한 렌즈 속성(예: 화각, 초 점 거리, 자동 초점, f 넘버(f number), 또는 광학 줌)을 갖거나, 또는 적어도 하나의 렌즈 어셈블리는 다른 렌 즈 어셈블리의 렌즈 속성들과 다른 하나 이상의 렌즈 속성들을 가질 수 있다. 렌즈 어셈블리는, 예를 들면, 광각 렌즈 또는 망원 렌즈를 포함할 수 있다. 플래쉬는 피사체로부터 방출 또는 반사되는 빛을 강화하기 위하여 사용되는 빛을 방출할 수 있다. 일실시 예에 따르면, 플래쉬는 하나 이상의 발광 다이오드들(예: RGB(red-green-blue) LED, white LED, infrared LED, 또는 ultraviolet LED), 또는 xenon lamp를 포함할 수 있다. 이미지 센서는 피사체로부터 방출 또는 반사되어 렌즈 어셈블리를 통해 전달된 빛을 전기적인 신호로 변환함으로써, 상기 피사체에 대응하는 이미 지를 획득할 수 있다. 일실시예에 따르면, 이미지 센서는, 예를 들면, RGB 센서, BW(black and white) 센 서, IR 센서, 또는 UV 센서와 같이 속성이 다른 이미지 센서들 중 선택된 하나의 이미지 센서, 동일한 속성을갖는 복수의 이미지 센서들, 또는 다른 속성을 갖는 복수의 이미지 센서들을 포함할 수 있다. 이미지 센서(23 0)에 포함된 각각의 이미지 센서는, 예를 들면, CCD(charged coupled device) 센서 또는 CMOS(complementary metal oxide semiconductor) 센서를 이용하여 구현될 수 있다. 이미지 스태빌라이저는 카메라 모듈 또는 이를 포함하는 전자 장치의 움직임에 반응하여, 렌즈 어셈블리에 포함된 적어도 하나의 렌즈 또는 이미지 센서를 특정한 방향으로 움직이거나 이미지 센서 의 동작 특성을 제어(예: 리드 아웃(read-out) 타이밍을 조정 등)할 수 있다. 이는 촬영되는 이미지에 대 한 상기 움직임에 의한 부정적인 영향의 적어도 일부를 보상하게 해 준다. 일실시예에 따르면, 이미지 스태빌라 이저는, 일실시예에 따르면, 이미지 스태빌라이저은 카메라 모듈의 내부 또는 외부에 배치된 자 이로 센서(미도시) 또는 가속도 센서(미도시)를 이용하여 카메라 모듈 또는 전자 장치의 그런 움직임 을 감지할 수 있다. 일실시예에 따르면, 이미지 스태빌라이저는, 예를 들면, 광학식 이미지 스태빌라이저 로 구현될 수 있다. 메모리는 이미지 센서을 통하여 획득된 이미지의 적어도 일부를 다음 이미지 처 리 작업을 위하여 적어도 일시 저장할 수 있다. 예를 들어, 셔터에 따른 이미지 획득이 지연되거나, 또는 복수 의 이미지들이 고속으로 획득되는 경우, 획득된 원본 이미지(예: Bayer-patterned 이미지 또는 높은 해상도의 이미지)는 메모리에 저장이 되고, 그에 대응하는 사본 이미지(예: 낮은 해상도의 이미지)는 디스플레이 모 듈을 통하여 프리뷰될 수 있다. 이후, 지정된 조건이 만족되면(예: 사용자 입력 또는 시스템 명령) 메모리 에 저장되었던 원본 이미지의 적어도 일부가, 예를 들면, 이미지 시그널 프로세서에 의해 획득되어 처리될 수 있다. 일실시예에 따르면, 메모리는 메모리의 적어도 일부로, 또는 이와는 독립적으로 운 영되는 별도의 메모리로 구성될 수 있다. 이미지 시그널 프로세서는 이미지 센서을 통하여 획득된 이미지 또는 메모리에 저장된 이미지 에 대하여 하나 이상의 이미지 처리들을 수행할 수 있다. 상기 하나 이상의 이미지 처리들은, 예를 들면, 깊이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추출, 이미지 합성, 또는 이미지 보상(예: 노이즈 감소, 해상도 조정, 밝기 조정, 블러링(blurring), 샤프닝(sharpening), 또는 소프트닝(softening)을 포함할 수 있다. 추가적으로 또는 대체적으로, 이미지 시그널 프로세서는 카메라 모듈에 포함된 구성 요소들 중 적어도 하나(예: 이미지 센서)에 대한 제어(예: 노출 시간 제어, 또는 리드 아웃 타이밍 제어 등)를 수 행할 수 있다. 이미지 시그널 프로세서에 의해 처리된 이미지는 추가 처리를 위하여 메모리에 다시 저장되거나 카메라 모듈의 외부 구성 요소(예: 메모리, 디스플레이 모듈, 전자 장치, 전자 장치, 또는 서버)로 제공될 수 있다. 일실시예에 따르면, 이미지 시그널 프로세서는 프로세서 의 적어도 일부로 구성되거나, 프로세서와 독립적으로 운영되는 별도의 프로세서로 구성될 수 있다. 이미지 시그널 프로세서이 프로세서과 별도의 프로세서로 구성된 경우, 이미지 시그널 프로세서(26 0)에 의해 처리된 적어도 하나의 이미지는 프로세서에 의하여 그대로 또는 추가의 이미지 처리를 거친 후 디스플레이 모듈를 통해 표시될 수 있다. 일 실시예에 따르면, 전자 장치는 각각 다른 속성 또는 기능을 가진 복수의 카메라 모듈들을 포함할 수 있다. 이런 경우, 예를 들면, 상기 복수의 카메라 모듈들 중 적어도 하나는 광각 카메라이고, 적어도 다른 하나는 망원 카메라일 수 있다. 유사하게, 상기 복수의 카메라 모듈들 중 적어도 하나는 전면 카메라 이고, 적어도 다른 하나는 후면 카메라일 수 있다. 도 3은 일 실시 예에 따른, 전자 장치의 구성을 설명하는 도면이다. 도 3을 참조하면, 전자 장치는 동물이 포함된 피사체(또는 객체)를 촬영하는 경우 카메라를 통해 획득된 프리뷰 이미지로부터 피사체의 움직임을 판단하고, 상기 판단된 피사체의 움직임을 고려하여 촬영 파라미터들을 설정하는 장치로서, 하나 이상의 카메라, 디스플레이, 적어도 하나의 프로세서 또는 메모리 를 포함할 수 있다. 도 3에서, 전자 장치는 도 1에 도시된 전자 장치에 대응될 수 있다. 일 실시 예에서, 하나 이상의 카메라 (예: 도 1의 카메라 모듈)는 사용자의 조작에 따라 피사체를 촬 영할 수 있다. 예를 들어, 하나 이상의 카메라는 카메라 어플리케이션이 실행되면 상기 피사체를 포함하는 프리뷰 이미지를 프레임 단위로 획득하고, 프리뷰 이미지를 표시하는 중 이미지 촬영을 위한 사용자 입력(예: 셔터 버튼 입력)을 수신하면 상기 피사체를 포함하는 이미지를 촬영할 수 있다. 다양한 실시 예에 따라, 하나 이상의 카메라는 상기 피사체의 움직임을 고려하여 촬영 파라미터(예: 셔터 속도(shutter speed), 선명도 (sharpness) 및/또는 색감(color) 보정)를 설정하고, 상기 설정된 하나 이상의 촬영 파라미터를 기반으로 촬영 을 수행할 수 있다.일 실시 예에서, 디스플레이 (예: 도 1의 디스플레이 모듈)는 하나 이상의 카메라를 이용하여 촬영된 이미지를 표시할 수 있다. 예를 들어, 디스플레이는 카메라 어플리케이션이 실행되면, 하나 이상의 카메라로부터 획득된 프리뷰 이미지를 표시할 수 있다. 일 실시 예에서, 디스플레이는 LCD(liquid crystal display), TFT-LCD(thin film transistor LCD), OLED(organic light emitting diodes), 발광다이오드(LED), AMOLED(active matrix organic LED), 플렉서블 디 스플레이(flexible display) 및 3차원 디스플레이(3 dimension display) 중 적어도 하나 이상으로 구성될 수 있다. 또한 이들 중 일부 디스플레이는 그를 통해 외부를 볼 수 있도록 투명형 또는 광투과형으로 구성될 수 있 다. 이는 TOLED(transparent OLED)를 포함하는 투명 디스플레이 형태로 구성될 수 있다. 일 실시 예에서, 메모리 (예: 도 1의 메모리)는 실행 시에, 적어도 하나의 프로세서 (예: 도 1 의 프로세서)가 각종 동작들을 수행하도록 제어하는 인스트럭션들을 저장할 수 있다. 예를 들어, 적어도 하나의 프로세서는 동물 촬영 시 동물의 움직임과 그 속도를 예측하여 촬영 파라미터를 설정하기 위한 동 작들을 수행할 수 있다. 일 실시 예에서, 적어도 하나의 프로세서는 카메라 어플리케이션이 실행되면, 카메라로부터 획득된 프리뷰 이미지를 디스플레이 상에 표시할 수 있다. 프로세서는 상기 프리뷰 이미지를 표시하는 동안 상기 프리뷰 이미지에 포함된 적어도 하나의 객체를 검출할 수 있다. 예를 들어, 상기 적어도 하나의 객체는 동 물을 포함할 수 있다. 다양한 실시 예에 따라, 적어도 하나의 프로세서는 상기 프리뷰 이미지를 제공하는 동안, AI 기반의 영상 인식 기술을 이용하여 실시간으로 상기 프리뷰 이미지에 진입하는 객체에 동물이 포함되 어 있는지 여부를 확인할 수 있다. 일 실시 예에서, 적어도 하나의 프로세서는 상기 프리뷰 이미지로부터 동물이 검출되면, 상기 동물의 신체 부위 식별을 위한 제1 정보와 상기 동물의 움직임 발생 여부를 판단하기 위한 제2 정보를 획득할 수 있다. 예를 들어, 상기 제1 정보는 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물이 검출되는지 여부를 나 타낼 수 있다. 다른 예를 들어, 상기 제2 정보는 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물 의 움직임이 있는지 여부를 나타낼 수 있다. 일 실시 예에서, 적어도 하나의 프로세서는 상기 제1 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물 의 신체부위를 판단할 수 있다. 적어도 하나의 프로세서는 상기 프리뷰 이미지를 지정된 개수(예: 가로 12 x 세로 9)의 영역으로 분할하고, 상기 분할된 영역 중 상기 동물이 검출된 영역을 분석할 수 있다. 적어도 하나 의 프로세서는 상기 동물이 검출된 영역에 대한 분석을 기반으로 상기 프리뷰 이미지에 포함된 상기 동물 의 신체부위를 판단할 수 있다. 다양한 실시 예에 따라, 상기 동물의 신체부위는 머리, 몸통, 꼬리, 팔 또는 다 리 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 적어도 하나의 프로세서는 상기 제2 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물 의 움직임 발생 여부를 판단할 수 있다. 적어도 하나의 프로세서는 상기 프리뷰 이미지를 지정된 개수(예: 가로 12 x 세로 9)의 영역으로 분할하고, 상기 분할된 영역 별 픽셀 변화를 분석할 수 있다. 적어도 하나의 프 로세서는 상기 각 영역 별 픽셀 변화의 분석을 기반으로 상기 프리뷰 이미지 내에서 움직임이 검출된 영역 을 확인할 수 있다. 다양한 실시 예에 따라, 적어도 하나의 프로세서는 상기 프리뷰 이미지 내에서 상기 동물이 검출된 영역과 상기 프리뷰 이미지 내에서 움직임이 검출된 영역을 각각 검출하고, 두 가지 조건에 모두 해당하는 영역이 있으면 상기 동물의 움직임이 발생한 것으로 판단할 수 있다. 예를 들어, 적어도 하나의 프로 세서는, 상기 제1 정보를 기반으로 상기 프리뷰 이미지로부터 상기 동물의 팔, 다리 중 적어도 하나를 포 함하는 신체부위가 검출된 경우, 상기 제2 정보를 기반으로 상기 동물에 대하여 움직임이 발생하였는지 여부를 판단할 수 있다. 상기 판단 결과 상기 동물에 대한 움직임이 발생하였으면, 적어도 하나의 프로세서는 상 기 동물의 움직임에 따른 속도를 계산할 수 있다. 예시적으로, 상기 속도는 상기 프리뷰 이미지에 대한 광학 흐 름(optical flow)을 활용하여 계산될 수 있다. 적어도 하나의 프로세서는 상기 프리뷰 이미지 이전에 지정 된 시간 간격으로 획득된 복수 개의 프레임과의 픽셀 값 차이를 확인하고, 상기 확인된 픽셀 값 차이와 주변 픽 셀들과의 관계를 기반으로 상기 광학 흐름을 추출할 수 있다. 적어도 하나의 프로세서는 상기 추출된 광학 흐름을 기반으로 상기 프리뷰 이미지 내 픽셀 움직임을 추정하고, 상기 추정된 픽셀 움직임을 기반으로 상기 동 물의 움직임에 따른 속도를 계산할 수 있다. 다른 예를 들어, 적어도 하나의 프로세서는, 상기 제1 정보를 기반으로 상기 프리뷰 이미지로부터 상기 동물의 팔 및/또는 다리가 검출되지 않고, 머리, 귀, 몸통 또는 꼬리 중 적어도 하나를 포함하는 신체부위가 검출된 경우, 팔이나 다리가 검출되었을 때에 비해 상기 동물의 움직임 이 빠르지 않다고 판단할 수 있다. 이 경우, 적어도 하나의 프로세서는 상기 동물에 대한 움직임이 발생하였다고 판단하더라도, 상기 동물의 움직임 크기가 임계 값 미만인 것으로 추정할 수 있다. 일 실시 예에서, 적어도 하나의 프로세서는 상기 동물의 신체부위에 대하여 추정된 속도를 기반으로 하나 이상의 카메라의 노출 값을 설정할 수 있다. 적어도 하나의 프로세서는 상기 추정된 속도가 기준 속 도보다 크거나 같으면, 상기 동물의 움직임의 크기가 임계 값보다 크다고 판단할 수 있다. 적어도 하나의 프로 세서는 상기 추정된 속도가 상기 기준 속도보다 작으면, 상기 동물의 움직임의 크기가 상기 임계 값보다 작다고 판단할 수 있다. 여기서, 상기 기준 속도는 적어도 하나의 촬영 파라미터 설정을 위해 동물의 움직임 크 기를 판단하는 기준이 되는 속도로서, 전자 장치의 제조사 또는 사용자의 설정에 따라 결정될 수 있다. 예 를 들어, 적어도 하나의 프로세서는 상기 동물의 움직임의 크기가 상기 임계 값보다 크다고 판단되면, 상 기 하나 이상의 카메라에 대해 제1 노출 값을 설정하고, 상기 제1 노출 값을 기반으로 상기 동물이 포함된 이미지를 캡처할 수 있다. 적어도 하나의 프로세서는 상기 동물의 움직임의 크기가 상기 임계 값보다 작다 고 판단되면, 상기 하나 이상의 카메라에 대해 상기 제1 노출 값보다 큰 제2 노출 값을 설정하고, 상기 제 2 노출 값을 기반으로 상기 동물이 포함된 이미지를 캡처할 수 있다. 상기 하나 이상의 카메라에 대하여 설정되는 노출 값은 상기 하나 이상의 카메라의 셔터 속도(shutter speed) 설정에 연관될 수 있다. 예시적 으로, 상기 노출 값이 클수록 상기 셔터 속도는 느리게 설정될 수 있으며, 상기 제2 노출 값 설정에 대응하는 셔터 속도는 상기 제1 노출 값 설정에 대응하는 셔터 속도보다 느린 값을 나타낼 수 있다. 다양한 실시 예에 따라, 적어도 하나의 프로세서는 상기 추정된 속도에 대응하여 단계적으로 또는 병렬적 으로 하나 이상의 카메라의 셔터 속도(또는 노출 값)을 결정할 수 있다. 예를 들어, 적어도 하나의 프로세서는 상기 추정된 속도가 클수록 하나 이상의 카메라가 빠른 셔터 속도를 갖도록 설정하여, 상기 프리뷰 이미지에 포함된 동물의 움직임에 의해 발생하는 모션 블러를 최소화할 수 있다. 적어도 하나의 프로세서는 동물의 움직임 속도에 대응하는 범위 별 적용되는 셔터 속도 레벨을 미리 정의해두고, 상기 추정된 속도가 속하는 범위에 따라 차등적으로 셔터 속도를 결정할 수 있다. 예시적으로, 기본 설정에 따른 셔터 속도가 1/60s인 경우, 전자 장치는 상기 범위에 따라 1/60s를 기준으 로 상이한 비율을 적용하여 셔터 속도의 설정 값이 단계적으로 작아지도록 결정할 수 있다. 적어도 하나의 프로 세서는 상기 동물에 대하여 추정된 속도가 제1 임계값 미만이면, 셔터 속도 조절을 하지 않고 기본 설정에 따른 셔터 속도를 기반으로 이미지를 촬영할 수 있다. 적어도 하나의 프로세서는 상기 추정된 속도가 제1 임계값 이상이고 제2 임계값 미만이면, 기본 설정에 따른 셔터 속도보다 약 0.8배의 설정 값을 갖도록 셔터 속 도를 조절할 수 있다. 적어도 하나의 프로세서는 상기 추정된 속도가 제2 임계값 이상이고 제3 임계값 미 만이면, 기본 설정에 따른 셔터 속도보다 약 0.6배의 설정 값을 갖도록 셔터 속도를 조절할 수 있다. 적어도 하 나의 프로세서는 상기 추정된 속도가 제3 임계값 이상이면, 기본 설정에 따른 셔터 속도보다 약 0.4배의 설정 값을 갖도록 셔터 속도를 조절할 수 있다. 여기서, 셔터 속도 설정에 관한 범위와 설정 값 수치에 관한 내 용은 하나의 예시로서, 이에 제한되지 않을 수 있다. 다양한 실시 예에 따라, 상기 적어도 하나의 촬영 파라미터는 노출 값(또는 셔터 속도)외에, 하나 이상의 카메 라의 선명도(sharpness) 또는 색상(color) 보정 레벨 중 적어도 하나를 더 포함할 수 있다. 예를 들어, 적 어도 하나의 프로세서는 상기 동물의 움직임의 크기가 상기 임계 값보다 크다고 판단되면, 상기 하나 이상 의 카메라에 대해 제1 레벨의 선명도 또는 색상 보정 레벨을 설정할 수 있다. 적어도 하나의 프로세서 는 상기 동물의 움직임의 크기가 상기 임계 값보다 작다고 판단되면, 상기 하나 이상의 카메라의 선 명도 또는 색상 보정 레벨을 상기 제1 레벨보다 낮은 제2 레벨로 설정할 수 있다. 다른 예를 들어, 적어도 하나 의 프로세서는 상기 추정된 속도에 대응하여 단계적으로 또는 병렬적으로 하나 이상의 카메라의 선명 도 및/또는 색상 보정 레벨을 결정할 수 있다. 적어도 하나의 프로세서는 상기 추정된 속도가 클수록 하나 이상의 카메라의 선명도 및/또는 색상 보정 레벨을 높게 설정하여, 상기 프리뷰 이미지에 포함된 동물의 특성(예: 털, 눈 색상)이 잘 표현되도록 할 수 있다. 적어도 하나의 프로세서는 동물의 움직임 속도에 대 응하는 범위 별 적용되는 선명도 및/또는 색상 보정 레벨을 미리 정의해두고, 상기 추정된 속도가 속하는 범위 에 따라 차등적으로 선명도 및/또는 색상 보정 레벨을 결정할 수 있다. 적어도 하나의 프로세서는 상기 동 물에 대하여 추정된 속도가 제1 임계값 미만이면, 선명도 및/또는 색상 보정 레벨을 조절하지 않고 기본 설정에 따른 선명도 및/또는 색상 보정 레벨을 기반으로 이미지를 촬영할 수 있다. 적어도 하나의 프로세서는 상 기 추정된 속도가 제1 임계값 이상이고 제2 임계값 미만이면, 선명도 및/또는 색상 보정 레벨을 기본 설정보다 약 1.2배 높게 설정할 수 있다. 적어도 하나의 프로세서는 상기 추정된 속도가 제2 임계값 이상이고 제3 임계값 미만이면, 선명도 및/또는 색상 보정 레벨을 기본 설정보다 약 1.4배 높게 설정할 수 있다. 적어도 하나 의 프로세서는 상기 추정된 속도가 제3 임계값 이상이면, 선명도 및/또는 색상 보정 레벨을 기본 설정보다약 1.6배 높게 설정할 수 있다. 여기서, 선명도 및/또는 색상 보정 레벨 설정에 관한 범위와 설정 값 수치에 관 한 내용은 하나의 예시로서, 이에 제한되지 않을 수 있다. 다양한 실시 예에 따라, 적어도 하나의 프로세서는, 상기 프리뷰 이미지로부터 복수의 동물이 검출된 경우, 각 동물의 움직임이나 위치 또는 초점 설정 여부 중 적어도 하나를 기반으로 상기 적어도 하나의 촬영 파 라미터를 결정할 수 있다. 예를 들어, 적어도 하나의 프로세서는 상기 복수의 동물 중 움직임 속도가 가장 빠른 것으로 검출된 동물을 기준으로 상기 적어도 하나의 촬영 파라미터를 설정할 수 있다. 다른 예를 들어, 적 어도 하나의 프로세서는 상기 프리뷰 이미지에서 사용자의 관심 영역에 대응하는 위치에 있는 동물을 기준 으로 상기 적어도 하나의 촬영 파라미터를 설정할 수도 있다. 이 때, 상기 관심 영역은 디스플레이의 화면 중앙 부분이나 사용자에 의해 초점(focus) 설정 또는 선택된 영역에 대응될 수 있다. 일 실시 예에서, 적어도 하나의 프로세서는 상기 설정된 촬영 파라미터를 기반으로 상기 동물이 포함된 이 미지를 획득할 수 있다. 다양한 실시 예에 따라, 선명도 및/또는 색상 보정 레벨에 대한 설정은 상기 동물의 이 미지를 촬영한 이후 촬영된 이미지에 대한 후처리로 수행될 수 있다. 적어도 하나의 프로세서는 상기 프리 뷰 이미지가 제공되는 동안 상기 동물의 움직임이 검출된 경우, 촬영 전에 선명도 및/또는 색상 보정에 연관되 는 설정 값을 변경하는 대신, 상기 동물이 촬영된 이미지에 대하여 선명도 및/또는 색상을 보정하는 방식으로 상기 동물에 대한 특성 표현을 향상시킬 수 있다. 도 4는 일 실시 예에 따라, 동물 촬영 시 동물의 팔 또는 다리에 대한 움직임을 판단하는 방식을 설명하는 도면 이다. 도 4를 참조하면, 전자 장치는 하나 이상의 카메라(예: 도 1의 카메라 모듈 또는 도 3의 카메라 )로부터 프리뷰 이미지를 획득하여 제공하는 동안 상기 프리뷰 이미지로부터 객체를 검출할 수 있다. 상기 객체는 강아지나 고양이와 같은 동물을 포함할 수 있다. 일 실시 예에서, 전자 장치는 상기 프리뷰 이미지에 포함된 객체가 동물(예: 강아지)임을 인식하면, 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물이 검출되는지 여부를 나타내는 제1 맵과, 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물의 움직임이 발생하였는지 여부를 나타내는 제2 맵 을 획득할 수 있다. 다양한 실시 예에 따라, 상기 복수 개의 영역들은 상기 프리뷰 이미지를 지정된 비율 로 분할하여 생성된 복수 개의 그리드(grid) 또는 상기 프리뷰 이미지에 포함된 복수 개의 픽셀(pixel) 단위에 대응할 수 있다. 일 실시 예에서, 전자 장치는 제1 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영역들 중 상기 동물이 검출된 영역을 확인하고, 상기 동물이 검출된 영역에 대한 분석을 기반으로 상기 프리뷰 이미지에 포함 된 상기 동물의 신체부위를 결정할 수 있다. 예시적으로, 전자 장치는 제1 맵으로부터 상기 동물의 팔 또는 다리가 검출된 영역을 확인할 수 있다. 일 실시 예에서, 전자 장치는 제2 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영역들 중 움직임 이 검출된 영역을 확인할 수 있다. 전자 장치는 상기 복수 개의 영역들 별 픽셀 값이 변경되는지 여 부를 판단하고, 상기 판단 결과를 기반으로 상기 움직임이 검출된 영역을 확인할 수 있다. 일 실시 예에서, 전자 장치는 제1 맵 및 제2 맵을 기반으로 상기 동물의 팔 또는 다리가 검출된 영역에서 움직임이 발생하였는지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 프리뷰 이미지에서, 제1 맵으로부터 식별된 상기 동물의 팔 또는 다리가 검출된 영역과 제2 맵으 로부터 식별된 상기 움직임이 검출된 영역의 중첩 영역이 있는지 확인할 수 있다. 상기 프리뷰 이미 지 내에 상기 중첩 영역이 존재하는 것으로 확인되면, 전자 장치는 상기 동물의 움직임에 따른 속도를 계산할 수 있다. 상기 동물의 움직임에 따른 속도 계산에 관한 구체적 내용은 도 5를 참조하여 설명한다. 도 5는 일 실시 예에 따라, 동물의 움직임에 따른 속도를 계산하는 방식을 설명하는 도면이다. 도 5를 참조하면, 전자 장치는 상기 프리뷰 이미지로부터 상기 동물의 팔 또는 다리에서 움직임을 검출하면, 상기 동물의 움직임에 따른 예상 속도를 계산할 수 있다. 일 실시 예에서, 전자 장치는 상기 프리뷰 이미지 이전에 지정된 시간 간격으로 획득된 복수 개의 프레임을 기반으로 픽셀 변화를 확인할 수 있다. 전 자 장치는 상기 프리뷰 이미지와 상기 복수 개의 프레임 사이의 픽셀 값 차이를 이용하여 상기 프리뷰 이미지 내 상기 중첩 영역(예: 도 4의 중첩 영역)에 대한 광학 흐름(optical flow)을 추출할수 있다. 다양한 실시 예에 따라, 전자 장치는 루카스-카나데(Lucas-Kanade) 알고리즘을 기반으로 상기 광 학 흐름을 추정할 수 있다. 이 경우, 전자 장치는 상기 프리뷰 이미지와 상기 복수 개의 프레임(50 0)에 대하여, 밝기 항상성(brightness consistency), 시간적 지속성(temporal persistence) 및 공간 일관성 (spatial coherency)의 3가지 조건을 전제로 상기 광학 흐름을 추정할 수 있다. 여기서, 밝기 항상성은 이미지 에서 어떤 객체 상의 픽셀은 프레임이 바뀌어도 그 값이 변하지 않음을 의미하고, 시간적 지속성은 이미지 내에 서 객체의 움직임에 비하여 시간의 변화가 더 빨리 진행되므로 연속된 프레임들 사이에 객체 움직임이 크지 않 음을 의미할 수 있다. 공간 일관성은 이미지 내에서 공간적으로 서로 인접하는 점들은 동일한 객체에 속할 가능 성이 높고 동일한 움직임을 가지므로, 픽셀 (y,x)를 중심으로 하는 윈도우 영역 N(y,x)의 광학 흐름은 동일함을 의미할 수 있다. 예시적으로, 전자 장치는 수학식 1을 이용하여 상기 프리뷰 이미지 내 상기 중첩 영 역에 대한 광학 흐름을 계산할 수 있다. 수학식 1"}
{"patent_id": "10-2023-0157729", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "일 실시 예에서, 전자 장치는 상기 계산된 광학 흐름을 기반으로 상기 프리뷰 이미지 내 픽셀 움직임 을 추정하고, 상기 추정된 픽셀 움직임을 기반으로 상기 동물의 움직임에 따른 속도를 예측할 수 있다. 다시 도 4를 참조하면, 전자 장치는 상기 프리뷰 이미지 내 중첩 영역의 광학 흐름을 기반으로 예측된 상기 동물의 속도에 따라 단계적으로 적어도 하나의 촬영 파라미터를 설정할 수 있다. 상기 적어도 하나 의 촬영 파라미터는 하나 이상의 카메라의 셔터 속도(shutter speed) (또는 노출 값(exposure value)), 선명도(sharpness) 또는 색상(color) 보정 중 적어도 하나를 포함할 수 있다. 일 실시 예에서, 전자 장치 는 동물의 움직임 속도에 대응하는 범위 별 촬영 파라미터의 설정 레벨을 미리 정의해두고, 상기 예측된 동물의 속도가 속하는 범위에서 적용되는 설정 레벨에 따라 상기 적어도 하나의 촬영 파라미터를 결정할 수 있다. 예를 들어, 전자 장치는 상기 예측된 동물의 속도가 제1 임계값 미만이면, 상기 설정 레벨을 레벨 1로 설정할 수 있다. 레벨 1로 설정된 경우, 전자 장치는 상기 적어도 하나의 파라미터(예: 셔터 속도, 선명도 또는 색상 보정 레벨)에 대한 조절을 하지 않고 기본 설정을 기반으로 이미지를 촬영할 수 있다. 전자 장치는 상기 예측된 동물의 속도가 제1 임계값 이상이고 제2 임계값 미만이면, 상기 설정 레벨을 레벨 2로 설정할 수 있다. 레벨 2로 설정된 경우, 전자 장치는 셔터 속도를 기본 설정보다 약 0.8배 낮은 값으로 설정하고, 선 명도 및/또는 색상 보정 레벨을 기본 설정보다 약 1.2배 높게 설정할 수 있다. 전자 장치는 상기 예측된 동물의 속도가 제2 임계값 이상이고 제3 임계값 미만이면, 상기 설정 레벨을 레벨 3으로 설정할 수 있다. 레벨 3으로 설정된 경우, 전자 장치는 셔터 속도를 기본 설정보다 약 0.6배 낮은 값으로 설정하고, 선명도 및/ 또는 색상 보정 레벨을 기본 설정보다 약 1.4배 높게 설정할 수 있다. 전자 장치는 상기 예측된 동물의 속 도가 제3 임계값 이상이면, 상기 설정 레벨을 레벨 4로 설정할 수 있다. 레벨 4로 설정된 경우, 전자 장치(30 0)는 셔터 속도를 기본 설정보다 약 0.4배 낮은 값으로 설정하고, 선명도 및/또는 색상 보정 레벨을 기본 설정 보다 약 1.6배 높게 설정할 수 있다. 다양한 실시 예에 따라, 전자 장치는, 상기 촬영 파라미터 중에서 셔 터 속도에 대한 설정 값은 상기 동물의 이미지를 촬영하기 전(예: 셔터 버튼 입력 전)에 결정하고, 선명도 및/ 또는 색상 보정 레벨에 대한 설정 값은 상기 동물의 이미지를 촬영한 후(예: 셔터 버튼 입력 후) 상기 이미지에 대한 후처리를 통해 결정할 수도 있다. 도 6은 일 실시 예에 따라, 동물 촬영 시 동물의 머리 또는 몸통에 대한 움직임을 판단하는 방식을 설명하는 도 면이다. 도 6을 참조하면, 전자 장치는 하나 이상의 카메라(예: 도 1의 카메라 모듈 또는 도 3의 카메라 )로부터 프리뷰 이미지를 획득하여 제공하는 동안 상기 프리뷰 이미지로부터 객체를 검출할 수 있다. 상기 객체는 강아지나 고양이와 같은 동물을 포함할 수 있다. 일 실시 예에서, 전자 장치는 상기 프리뷰 이미지에 포함된 객체가 동물(예: 강아지)임을 인식하면, 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물이 검출되는지 여부를 나타내는 제1 맵과, 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물의 움직임이 발생하였는지 여부를 나타내는 제2 맵 을 획득할 수 있다. 다양한 실시 예에 따라, 상기 복수 개의 영역들은 상기 프리뷰 이미지를 지정된 비율 로 분할하여 생성된 복수 개의 그리드(grid) 또는 상기 프리뷰 이미지에 포함된 복수 개의 픽셀(pixel) 단위에 대응할 수 있다. 일 실시 예에서, 전자 장치는 제1 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영역들 중 상기 동물이 검출된 영역을 확인하고, 상기 동물이 검출된 영역에 대한 분석을 기반으로 상기 프리뷰 이미지에서 상 기 동물의 팔이나 다리는 검출되지 않고 상기 동물의 머리(귀 포함)와 몸통 부분이 검출됨을 판단할 수 있다. 예시적으로, 전자 장치는 제1 맵으로부터 상기 동물의 머리(귀 포함)와 몸통이 검출된 영역을 확인할 수 있다. 일 실시 예에서, 전자 장치는 제2 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영역들 중 움직임 이 검출된 영역을 확인할 수 있다. 전자 장치는 상기 복수 개의 영역 별 픽셀 값이 변경되는지 여부 를 판단하고, 상기 판단 결과를 기반으로 상기 움직임이 검출된 영역을 확인할 수 있다. 일 실시 예에서, 전자 장치는 제1 맵 및 제2 맵을 기반으로 상기 머리(귀 포함)와 몸통이 검출 된 영역에서 움직임이 발생하였는지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 프리뷰 이미지 에서, 제1 맵으로부터 식별된 상기 동물의 머리(귀 포함)와 몸통이 검출된 영역과 제2 맵으로부 터 식별된 상기 움직임이 검출된 영역의 중첩 영역이 있는지 확인할 수 있다. 상기 프리뷰 이미지 내에 상기 중첩 영역이 존재하는 것으로 확인되면, 전자 장치는 기본 설정에 따른 셔터 속도보 다 소정 비율(예: 약 0.8-0.9배)로 낮은 값을 갖도록 셔터 속도를 조절하거나 선명도 및/또는 색상 보정 레벨을 기본 설정보다 소정 비율(예: 약 1.2-1.3배) 높게 설정할 수 있다. 다양한 실시 예에 따라, 전자 장치는, 셔터 속도에 대한 설정 값은 상기 동물의 이미지를 촬영하기 전(예: 셔터 버튼 입력 전)에 결정하고, 선명도 및 /또는 색상 보정 레벨에 대한 설정 값은 상기 동물의 이미지를 촬영한 후(예: 셔터 버튼 입력 후) 상기 이미지 에 대한 후처리를 통해 결정할 수도 있다. 다양한 실시 예에 따라, 전자 장치는 상기 프리뷰 이미지로부터 상기 동물의 머리(귀 포함)와 몸통이 검출된 경우 상기 동물의 움직임이 빠르지 않다고 판단하고, 움직임 검출 여부와 관계없이 적어도 하나의 파라 미터(예: 셔터 속도, 선명도 또는 색상 보정 레벨)에 대한 조절을 하지 않고 기본 설정을 기반으로 이미지를 촬 영할 수도 있다. 도 7은 일 실시 예에 따른, 전자 장치에서 동물의 움직임을 고려하여 이미지를 촬영하는 방법을 도시하는 흐름 도이다. 도 7에서 설명된 동작들은 전자 장치에 포함된 적어도 하나의 프로세서(예: 도 1의 프로세서 또는 도 3의 프로세서)에 의해 수행되는 기능으로 이해될 수 있다. 도 7을 참조하면, 동작 710에서 전자 장치는 하나 이상의 카메라(예: 도 1의 카메라 모듈 또는 도 3 의 카메라)로부터 획득된 프리뷰 이미지를 디스플레이(예: 도 1의 디스플레이 모듈 또는 도 3의 디스 플레이)를 통해 표시하는 동안 상기 프리뷰 이미지에서 동물이 식별되는지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 상기 프리뷰 이미지를 제공하는 동안 AI 기반의 영상 인식 기술을 이용하여 실시간으로 상기 프리뷰 이미지로부터 동물에 대응하는 객체가 인식되는지 판단할 수 있다. 상기 판단 결과, 상기 프리뷰 이미지에서 동물이 식별된 경우(동작 710-Yes), 전자 장치는 동작 720에서 상기 프리뷰 이미지에 포함된 상기 동물의 신체부위를 검출할 수 있다. 전자 장치는 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물이 검출되는지 여부를 나타내는 제1 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영역들 중 상기 동물이 검출된 영역을 확인하고, 상기 동물이 검출된 영역에 대한 분석을 기반으 로 상기 프리뷰 이미지에 포함된 상기 동물의 신체부위를 검출할 수 있다. 상기 동물의 신체부위는 머리, 몸통, 꼬리, 팔 또는 다리 중 적어도 하나를 포함할 수 있다. 상기 판단 결과, 상기 프리뷰 이미지에서 동물이 식별되지 않으면(동작 710-No), 전자 장치는 동작 780에 서 적어도 하나의 촬영 파라미터에 대한 조절을 하지 않고 기본 설정을 유지할 수 있다. 일 실시 예에 따르면, 동작 730에서 전자 장치는 상기 프리뷰 이미지로부터 상기 동물의 팔 또는 다리의 신체부위가 검출되는지 여부를 판단할 수 있다. 전자 장치는 상기 제1 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영역들 중 상기 동물의 팔 또는 다리가 검출되는 영역이 있는지 확인할 수 있다. 상기 판단 결과, 상기 프리뷰 이미지에서 상기 동물의 팔 또는 다리가 검출되었으면(동작 730-Yes), 전자 장치 는 동작 735에서 상기 프리뷰 이미지로부터 상기 동물의 움직임이 검출되는지 여부를 판단할 수 있다. 전 자 장치는 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물의 움직임이 있는지 여부를 나타 내는 제2 맵을 기반으로 상기 프리뷰 이미지 내 상기 동물의 움직임이 검출된 영역을 확인할 수 있다. 상기 판 단 결과, 상기 프리뷰 이미지로부터 상기 동물의 움직임이 검출되지 않으면(동작 735-No), 전자 장치는 동 작 780에서 적어도 하나의 촬영 파라미터에 대한 조절을 하지 않고 기본 설정을 유지할 수 있다. 상기 판단 결 과, 상기 프리뷰 이미지로부터 상기 동물의 움직임이 검출되었으면(동작 735-Yes), 전자 장치는 동작 750 에서 상기 동물의 움직임에 따른 속도를 계산할 수 있다. 일 실시 예에 따르면, 동작 750에서 전자 장치는 상기 프리뷰 이미지에 대한 광학 흐름(optical flow)을 활용하여 상기 동물의 움직임에 따른 속도를 계산할 수 있다. 전자 장치는 상기 프리뷰 이미지 이전에 지 정된 시간 간격으로 획득된 복수 개의 프레임을 기반으로 픽셀 변화를 확인하고, 상기 프리뷰 이미지와 상기 복 수 개의 프레임 사이의 픽셀 값 차이를 이용하여 상기 프리뷰 이미지 내 상기 동물의 팔 또는 다리가 검출된 영 역에 대한 광학 흐름(optical flow)을 추출할 수 있다. 전자 장치는 상기 추출된 광학 흐름을 기반으로 상 기 동물의 속도를 추정할 수 있다. 예를 들어, 상기 동물이 전자 장치를 향해 정면으로 다가오는 경우, 전 자 장치는 상기 복수 개의 프레임으로부터 상기 동물이 검출되는 영역의 크기가 점점 커지는 것을 확인하 고, 상기 프리뷰 이미지와 상기 복수 개의 프레임 사이의 픽셀 변화를 기반으로 상기 동물의 움직임 방향과 속 도를 추정할 수 있다. 일 실시 예에 따르면, 동작 760에서 전자 장치는 상기 계산된 동물의 속도를 기반으로 적어도 하나의 촬영 파라미터의 설정 값을 선택할 수 있다. 상기 적어도 하나의 촬영 파라미터는 하나 이상의 카메라의 셔터 속도(shutter speed) (또는 노출 값(exposure value)), 선명도(sharpness) 또는 색상(color) 보정 레벨 중 적 어도 하나를 포함할 수 있다. 다양한 실시 예에 따라, 전자 장치는 상기 동물의 속도에 대응하는 범위에 따라 단계적으로 상기 적어도 하나의 촬영 파라미터의 설정 값을 선택할 수 있다. 상기 동물의 속도가 제1 임계 값 미만이면, 전자 장치는 상기 적어도 하나의 촬영 파라미터에 대한 조절을 하지 않고 기본 설정에 따른 설정 값을 선택할 수 있다. 상기 동물의 속도가 상기 제1 임계값 이상이고 상기 제2 임계값 미만의 범위에 속하 면, 전자 장치는 셔터 속도의 설정 값을 기본 설정보다 약 0.8배 낮게 선택하고, 선명도 및/또는 색상 보 정 레벨을 기본 설정보다 약 1.2배 높게 선택할 수 있다. 상기 동물의 속도가 상기 제2 임계값 이상이고 제3 임 계값 미만인 범위에 속하면, 전자 장치는 셔터 속도의 설정 값을 기본 설정보다 약 0.6배 낮게 선택하고, 선명도 및/또는 색상 보정 레벨을 기본 설정보다 약 1.4배 높게 선택할 수 있다. 상기 동물의 속도가 상기 제3 임계값 이상이면, 전자 장치는 셔터 속도의 설정 값을 기본 설정보다 약 0.4배 낮게 선택하고, 선명도 및/ 또는 색상 보정 레벨을 기본 설정보다 약 1.6배 높게 선택할 수 있다. 일 실시 예에 따르면, 동작 770에서 전자 장치는 상기 선택된 적어도 하나의 촬영 파라미터를 기반으로 상 기 동물을 포함하는 이미지를 촬영할 수 있다. 한편, 동작 730의 판단 결과, 상기 프리뷰 이미지에서 상기 동물의 팔 또는 다리가 검출되지 않으면(동작 730- No), 전자 장치는 동작 740에서 상기 프리뷰 이미지로부터 상기 동물의 머리, 귀, 몸통 또는 꼬리 부분이 검출된 것으로 결정할 수 있다. 전자 장치는 상기 제1 맵을 기반으로 상기 프리뷰 이미지 내 복수 개의 영 역들 중 상기 동물의 머리, 귀, 몸통 또는 꼬리 부분이 검출되는 영역을 확인할 수 있다. 일 실시 예에 따르면, 동작 745에서 전자 장치는 상기 프리뷰 이미지로부터 상기 동물의 움직임이 검출되 는지 여부를 판단할 수 있다. 전자 장치는 상기 제2 맵을 기반으로 상기 프리뷰 이미지 내 상기 동물의 움 직임이 검출된 영역을 확인할 수 있다. 상기 판단 결과, 상기 프리뷰 이미지로부터 상기 동물의 움직임이 검출 되지 않으면(동작 745-No), 전자 장치는 동작 780에서 상기 적어도 하나의 촬영 파라미터에 대한 조절을 하지 않고 기본 설정을 유지할 수 있다. 상기 판단 결과, 상기 프리뷰 이미지로부터 상기 동물의 움직임이 검출 되었으면(동작 745-Yes), 전자 장치는 동작 760에서 기본 설정으로부터 소정 비율 조정된 설정 값을 갖도 록 적어도 하나의 촬영 파라미터를 선택할 수 있다. 동작 760에서, 전자 장치는 기본 설정에 따른 셔터 속 도보다 소정 비율(예: 약 0.8-0.9배)로 낮은 값을 갖도록 셔터 속도를 조절하거나 선명도 및/또는 색상 보정 레벨을 기본 설정보다 소정 비율(예: 약 1.2-1.3배) 높게 설정할 수 있다. 다양한 실시 예에 따라, 전자 장치 는 상기 프리뷰 이미지로부터 상기 동물의 머리, 귀, 몸통 또는 꼬리 부분이 검출된 경우, 동작 745의 판 단 결과와 관계없이 상기 적어도 하나의 촬영 파라미터에 대한 조절을 하지 않고 기본 설정에 따른 설정 값을 선택할 수도 있다. 일 실시 예에 따르면, 동작 770에서 상기 선택된 적어도 하나의 촬영 파라미터를 기반으로 상기 동물을 포함하는 이미지를 촬영할 수 있다. 도 8은 일 실시 예에 따라, 전자 장치의 동작 방법을 도시하는 흐름도이다. 일 실시 예에 따르면, 전자 장 치는 동물이 포함된 피사체를 촬영하는 경우 카메라를 통해 획득된 프리뷰 이미지로부터 피사체의 움직임 을 판단하고, 상기 판단된 피사체의 움직임을 고려하여 촬영 파라미터들을 설정하는 장치로서, 도 1에 도시된 전자 장치에 대응될 수 있다. 도 8의 동작들은 전자 장치에 포함된 적어도 하나의 프로세서(예: 도 1 의 프로세서 또는 도 3의 프로세서)에 의해 수행될 수 있다. 도 8을 참조하면, 동작 810에서 전자 장치는 카메라 어플리케이션의 실행에 응답하여, 하나 이상의 카메라 (예: 도 1의 카메라 모듈 또는 도 3의 카메라)로부터 획득된 프리뷰 이미지를 디스플레이(예: 도 1의 디스플레이 모듈 또는 도 3의 디스플레이) 상에 표시하고, 상기 프리뷰 이미지에 포함된 동물의 움직 임을 확인할 수 있다. 다양한 실시 예에 따라, 전자 장치는 동작 810에서, 상기 프리뷰 이미지를 제공하는 동안 AI 기반의 영상 인식 기술을 이용하여 실시간으로 상기 프리뷰 이미지에 진입하는 객체에 동물이 포함되어 있는지 여부를 확인할 수 있다. 일 실시 예에 따르면, 동작 810에서 전자 장치는 상기 동물의 검출에 응답하여, 상기 동물의 움직임을 확 인할 수 있다. 전자 장치는 상기 동물의 신체 부위 식별을 위한 제1 정보와 상기 동물의 움직임 발생 여부 를 판단하기 위한 제2 정보를 획득하고, 상기 제1 정보 및 상기 제2 정보를 기반으로 상기 동물의 움직임을 확 인할 수 있다. 예를 들어, 상기 제1 정보는 상기 프리뷰 이미지에 포함된 복수 개의 영역들에서 상기 동물이 검 출되는지 여부를 나타낼 수 있다. 다른 예를 들어, 상기 제2 정보는 상기 프리뷰 이미지에 포함된 복수 개의 영 역들에서 상기 동물의 움직임이 있는지 여부를 나타낼 수 있다. 일 실시 예에 따르면, 동작 810에서 전자 장치는 상기 제1 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물의 신체부위를 판단할 수 있다. 예를 들어, 전자 장치는 상기 프리뷰 이미지를 지정된 개수(예: 가로 12 x 세로 9)의 영역으로 분할하고, 상기 분할된 영역 중 상기 동물이 검출된 영역을 분석할 수 있다. 전자 장 치는 상기 동물이 검출된 영역에 대한 분석을 기반으로 상기 프리뷰 이미지에 포함된 상기 동물의 신체부 위를 판단할 수 있다. 상기 동물의 신체부위는 머리, 몸통, 꼬리, 팔 또는 다리 중 적어도 하나를 포함할 수 있 다. 일 실시 예에 따르면, 동작 810에서 전자 장치는 상기 제2 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물의 움직임 발생 여부를 판단할 수 있다. 예를 들어, 전자 장치는 상기 프리뷰 이미지를 지정된 개수 (예: 가로 12 x 세로 9)의 영역으로 분할하고, 상기 분할된 영역 별 픽셀 변화를 분석하여 상기 프리뷰 이미지 내에서 움직임이 검출된 영역을 확인할 수 있다. 전자 장치는 상기 프리뷰 이미지 내에서 상기 동물이 검 출된 영역과 상기 프리뷰 이미지 내에서 움직임이 검출된 영역을 각각 검출하고, 두 가지 조건에 모두 해당하는 영역이 있으면 상기 동물에서 움직임이 발생한 것으로 판단할 수 있다. 다양한 실시 예에 따라, 전자 장치는, 상기 프리뷰 이미지로부터 상기 동물의 팔, 다리 중 적어도 하나를 포함하는 신체부위가 검출된 경우, 상기 제2 정보를 기반으로 상기 동물에 대하여 움직임이 발생하였는지 여부 를 판단할 수 있다. 상기 판단 결과 상기 동물에 대한 움직임이 발생하였으면, 전자 장치는 상기 동물의 움직임에 따른 속도를 계산할 수 있다. 예를 들어, 상기 동물의 속도는 상기 프리뷰 이미지에 대한 광학 흐름 (optical flow)을 활용하여 계산될 수 있다. 전자 장치는 상기 프리뷰 이미지 이전에 지정된 시간 간격으 로 획득된 복수 개의 프레임과의 픽셀 값 차이를 확인하고, 상기 확인된 픽셀 값 차이와 주변 픽셀들과의 관계 를 기반으로 상기 광학 흐름을 추출할 수 있다. 전자 장치는 상기 추출된 광학 흐름을 기반으로 상기 프리 뷰 이미지 내 픽셀 움직임을 추정하고, 상기 추정된 픽셀 움직임을 기반으로 상기 동물의 움직임에 따른 속도를 계산할 수 있다. 다양한 실시 예에 따라, 전자 장치는, 상기 프리뷰 이미지로부터 상기 동물의 팔 및/또는 다리가 검출되지 않고, 머리, 귀, 몸통 또는 꼬리 중 적어도 하나를 포함하는 신체부위가 검출된 경우, 팔이나 다리가 검출되었 을 때에 비해 상기 동물의 움직임이 빠르지 않다고 판단할 수 있다. 이 경우, 전자 장치는 상기 동물에 대한 움직임이 발생하였다고 판단하더라도, 상기 동물의 움직임 크기가 임계 값 미만인 것으로 추정할 수 있다. 일 실시 예에 따르면, 동작 820에서 전자 장치는 상기 동물에 대하여 확인된 움직임의 크기가 임계값보다 큰지 여부를 판단할 수 있다. 예를 들어, 전자 장치는 상기 프리뷰 이미지로부터 상기 동물의 팔, 다리 중 적어도 하나를 포함하는 신체부위가 검출된 경우, 상기 동물의 움직임에 따른 속도가 기준 속도보다 크거나 같 으면, 상기 동물의 움직임의 크기가 임계 값보다 크다고 판단할 수 있다. 전자 장치는 상기 동물의 움직임 에 따른 속도가 상기 기준 속도보다 작으면, 상기 동물의 움직임의 크기가 상기 임계 값보다 작다고 판단할 수 있다. 여기서, 상기 기준 속도는 적어도 하나의 촬영 파라미터 설정을 위해 동물의 움직임 크기를 판단하는 기 준이 되는 속도로서, 전자 장치의 제조사 또는 사용자의 설정에 따라 결정될 수 있다. 다른 예를 들어, 전 자 장치는 상기 프리뷰 이미지로부터 상기 동물의 머리, 귀, 몸통 또는 꼬리 중 적어도 하나를 포함하는 신체부위가 검출된 경우, 상기 동물의 움직임 크기가 임계 값 미만인 것으로 판단할 수 있다. 상기 판단 결과, 상기 동물의 움직임 크기가 상기 임계 값보다 크면(동작 820-Yes), 전자 장치는 동작 830 에서 상기 카메라에 대해 제1 노출 값을 설정할 수 있다. 상기 판단 결과, 상기 동물의 움직임 크기가 상기 임계 값보다 작으면(동작 820-No), 전자 장치는 동작 840에서 상기 카메라에 대해 상기 제1 노출 값보다 큰 제2 노출 값을 설정할 수 있다. 상기 카메라에 대하여 설정되는 노출 값은 상기 카메라의 셔터 속도(shutter speed) 설정에 연관될 수 있다. 예시적으로, 상기 노출 값이 클수록 상기 셔터 속도는 느리게 설정될 수 있으며, 상기 제2 노출 값 설정에 대응하는 셔터 속 도는 상기 제1 노출 값 설정에 대응하는 셔터 속도보다 느린 값을 나타낼 수 있다. 다양한 실시 예에 따라, 상기 적어도 하나의 촬영 파라미터는 노출 값(exposure value)(또는 셔터 속도) 외에, 카메라의 선명도(sharpness) 또는 색상(color) 보정 레벨 중 적어도 하나를 더 포함할 수 있다. 전자 장치 는 상기 동물의 움직임의 크기가 상기 임계 값보다 크다고 판단되면, 카메라에 대해 제1 레벨의 선명 도 또는 색상 보정 레벨을 설정할 수 있다. 전자 장치는 상기 동물의 움직임의 크기가 상기 임계 값보다 작다고 판단되면, 카메라의 선명도 또는 색상 보정 레벨을 상기 제1 레벨보다 낮은 제2 레벨로 설정할 수 있다. 다양한 실시 예에 따라, 전자 장치는 동작 830 및/또는 동작 840에서, 상기 추정된 속도에 대응하여 단계 적으로 또는 병렬적으로, 적어도 하나의 촬영 파라미터의 설정 값을 결정할 수 있다. 예를 들어, 전자 장치 는 상기 추정된 속도가 클수록 카메라가 낮은 셔터 속도를 갖도록 설정하여, 상기 프리뷰 이미지에 포함된 동물의 움직임에 의해 발생하는 모션 블러를 최소화할 수 있다. 전자 장치는 동물의 움직임 속도에 대응하는 범위 별 적용되는 셔터 속도 레벨을 미리 정의해두고, 상기 추정된 속도가 속하는 범위에 따라 차등적 으로 셔터 속도를 결정할 수 있다. 상기 동물에 대하여 추정된 속도가 제1 임계값 미만이면, 전자 장치는 셔터 속도 조절을 하지 않고 기본 설정에 따른 셔터 속도를 기반으로 이미지를 촬영할 수 있다. 상기 추정된 속 도가 제1 임계값 이상이고 제2 임계값 미만이면, 전자 장치는 기본 설정에 따른 셔터 속도보다 약 0.8배의 설정 값을 갖도록 셔터 속도를 조절할 수 있다. 상기 추정된 속도가 제2 임계값 이상이고 제3 임계값 미만이면, 전자 장치는 기본 설정에 따른 셔터 속도보다 약 0.6배의 설정 값을 갖도록 셔터 속도를 조절할 수 있다. 상기 추정된 속도가 제3 임계값 이상이면, 전자 장치는 기본 설정에 따른 셔터 속도보다 약 0.4배의 설정 값을 갖도록 셔터 속도를 조절할 수 있다. 여기서, 셔터 속도 설정에 관한 범위와 설정 값 수치에 관한 내용은 하나의 예시로서, 이에 제한되지 않을 수 있다. 다른 예를 들어, 전자 장치는 상기 추정된 속도가 클수록 카메라의 선명도 또는 색상 보정 레벨을 높게 설정하여, 상기 프리뷰 이미지에 포함된 동물의 특성(예: 털, 눈 색상)이 잘 표현되도록 할 수 있다. 전자 장치는 동물의 움직임 속도에 대응하는 범위 별 적용되는 선명도 및/또는 색상 보정 레벨을 미리 정의해두고, 상기 추정된 속도가 속하는 범위에 따라 차등적으로 선명도 및/또는 색상 보정 레벨을 결정할 수 있다. 상기 동물에 대하여 추정된 속도가 제1 임계값 미만이면, 전자 장치 는 선명도 및/또는 색상 보정 레벨을 조절하지 않고 기본 설정에 따른 선명도 및/또는 색상 보정 레벨을 기반으로 이미지를 촬영할 수 있다. 상기 추정된 속도가 제1 임계값 이상이고 제2 임계값 미만이면, 전자 장치 는 선명도 및/또는 색상 보정 레벨을 기본 설정보다 약 1.2배 높게 설정할 수 있다. 상기 추정된 속도가 제2 임계값 이상이고 제3 임계값 미만이면, 전자 장치는 선명도 및/또는 색상 보정 레벨을 기본 설정보다 약 1.4배 높게 설정할 수 있다. 상기 추정된 속도가 제3 임계값 이상이면, 전자 장치는 선명도 및/또는 색 상 보정 레벨을 기본 설정보다 약 1.6배 높게 설정할 수 있다. 여기서, 선명도 및/또는 색상 보정 레벨 설정에 관한 범위와 설정 값 수치에 관한 내용은 하나의 예시로서, 이에 제한되지 않을 수 있다. 일 실시 예에 따르면, 동작 850에서 전자 장치는 상기 설정된 노출 값을 기반으로 캡처된 이미지를 획득할 수 있다. 다양한 실시 예에 따라, 카메라에 대하여 설정되는 적어도 하나의 촬영 파라미터 중 선명도 및/ 또는 색상 보정 레벨에 대한 설정은 상기 동물을 촬영한 이후 촬영된 이미지에 대한 후처리로 수행될 수 있다. 전자 장치는 상기 프리뷰 이미지가 제공되는 동안 상기 동물의 움직임이 검출된 경우, 촬영 전에 선명도 및/또는 색상 보정에 연관되는 설정 값을 변경하는 대신 상기 동물이 촬영된 이미지에 대하여 선명도 및/또는 색상을 보정하는 방식으로 상기 동물에 대한 특성 표현을 향상시킬 수 있다. 일 실시 예에 따른 전자 장치(예: 전자 장치)는, 카메라, 디스플레이, 프로세서, 및 인스 트럭션들을 저장하는 메모리를 포함하고, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전 자 장치가, 상기 카메라를 이용하여 획득된 프리뷰 이미지를 상기 디스플레이 상에 표시하는 동 안, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하고, 상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획득하고, 상기 확인된 움직임의 크기가 상 기 임계값보다 작으면, 상기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이 미지를 획득하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 프리뷰 이미지를 상기 디스플레이 상에 표시하는 동안 상기 동물의 신체 부위 식별을 위한 제1 정보와 상기 동물 의 움직임 발생 여부를 판단하기 위한 제2 정보를 획득하고, 상기 제1 정보 및 상기 제2 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 프리뷰 이미지를 복수 개의 영역들로 분할하고, 상기 복수 개의 영역들 중 상기 동물이 검출된 영역을 분석하여 상기 동물의 신체 부위를 식별하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 프리뷰 이미지를 복수 개의 영역들로 분할하고, 상기 복수 개의 영역 별 픽셀 움직임을 분석하여 상기 동물의 움직임 발생 여부를 판단하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 동물의 신체 부위가 팔, 다리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 제2 정보를 기반으로 상기 동물에 대 하여 움직임이 발생하였는지 여부를 판단하고, 상기 동물에 대하여 움직임이 발생하였다고 판단되면, 상기 동물 의 움직임에 따른 예상 속도를 계산하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 프리뷰 이미지를 제공하는 동안 지정된 시간 간격으로 획득된 복수 개의 프레임으로부터 광학 흐름(optical flow)을 추 출하고, 상기 추출된 광학 흐름을 기반으로 상기 프리뷰 이미지 내 픽셀 움직임을 추정하고, 상기 추정된 픽셀 움직임을 기반으로 상기 예상 속도를 계산하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 계산된 예상 속도가 기준 속도보다 크거나 같으면, 상기 동물에 대하여 확인된 움직임의 크기가 상기 임계값보다 크다 고 판단하고, 상기 제1 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 계산된 예상 속도가 기준 속도보다 작으면, 상기 동물에 대하여 확인된 움직임의 크기가 상기 임계값보다 작다고 판단 하고, 상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 동물의 신체 부위가 머리, 귀, 몸통 또는 꼬리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 동물에 대하여 확인 된 움직임의 크기가 상기 임계 값 미만인 것으로 추정하고, 상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하도록 설정될 수 있다. 일 실시 예에서, 상기 프로세서는, 상기 인스트럭션들이 실행될 시, 상기 전자 장치가, 상기 확인된 움직임의 크기가 상기 임계값보다 크면 상기 카메라의 선명도 또는 색상 보정 레벨을 제1 레벨로 설정하고, 상기 확인된 움직임의 크기가 상기 임계값보다 작으면 상기 카메라의 선명도 또는 색상 보정 레 벨을 상기 제1 레벨보다 낮은 제2 레벨로 설정하도록 설정될 수 있다. 일 실시 예에 따른 전자 장치(예: 전자 장치)의 동작 방법은, 카메라를 이용하여 획득된 프리뷰 이미 지를 디스플레이 상에 표시하는 동안 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작, 상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획득하는 동작, 및 상기 확인된 움직임의 크기가 상기 임계값보다 작으면, 상기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이미지를 획득하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작은, 상기 프리뷰 이미지를 상기 디스플레이 상에 표시하는 동안, 상기 동물의 신체 부위 식별을 위한 제1 정보와 상기 동물의 움직임 발생 여부를 판단하기 위한 제2 정보를 획득하는 동작, 및 상기 제1 정보 및 상기 제2 정보를 기반으로 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 제1 정보를 획득하는 동작은, 상기 프리뷰 이미지를 복수 개의 영역들로 분할하는 동작, 및 상기 복수 개의 영역들 중 상기 동물이 검출된 영역을 분석하여 상기 동물의 신체 부위를 식별하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 제2 정보를 획득하는 동작은, 상기 프리뷰 이미지를 복수 개의 영역들로 분할하는 동작, 및 상기 복수 개의 영역 별 픽셀 움직임을 분석하여 상기 동물의 움직임 발생 여부를 판단하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작은, 상기 동물의 신체 부위가 팔, 다리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 제2 정보를 기반으로 상기 동물에 대하여 움직임이 발 생하였는지 여부를 판단하는 동작, 및 상기 동물에 대하여 움직임이 발생하였다고 판단되면, 상기 동물의 움직 임에 따른 예상 속도를 계산하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 동물의 움직임에 따른 예상 속도를 계산하는 동작은, 상기 프리뷰 이미지를 제공하는 동 안 지정된 시간 간격으로 획득된 복수 개의 프레임으로부터 광학 흐름(optical flow)을 추출하는 동작, 상기 추 출된 광학 흐름을 기반으로 상기 프리뷰 이미지 내 픽셀 움직임을 추정하는 동작, 및 상기 추정된 픽셀 움직임 을 기반으로 상기 예상 속도를 계산하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 방법은, 상기 계산된 예상 속도가 기준 속도보다 크거나 같으면, 상기 동물에 대하여 확 인된 움직임의 크기가 상기 임계값보다 크다고 판단하는 동작, 및 상기 제1 노출 값을 기반으로 상기 동물을 포 함하는 이미지를 캡처하는 동작을 더 포함할 수 있다. 일 실시 예에서, 상기 방법은, 상기 계산된 예상 속도가 기준 속도보다 작으면, 상기 동물에 대하여 확인된 움 직임의 크기가 상기 임계값보다 작다고 판단하는 동작, 및 상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지를 캡처하는 동작을 더 포함할 수 있다. 일 실시 예에서, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작은, 상기 동물의 신체 부위가 머 리, 귀, 몸통 또는 꼬리 중 적어도 하나에 대응하는 것으로 판단되면, 상기 동물에 대하여 확인된 움직임의 크 기가 상기 임계값 미만인 것으로 추정하는 동작, 및 상기 제2 노출 값을 기반으로 상기 동물을 포함하는 이미지 를 캡처하는 동작을 포함할 수 있다. 일 실시 예에서, 상기 방법은, 상기 확인된 움직임의 크기가 상기 임계값보다 크면 상기 카메라의 선명도 또는 색상 보정 레벨을 제1 레벨로 설정하는 동작, 및 상기 확인된 움직임의 크기가 상기 임계값보다 작으면 상 기 카메라의 선명도 또는 색상 보정 레벨을 상기 제1 레벨보다 낮은 제2 레벨로 설정하는 동작을 더 포함 할 수 있다. 일 실시 예에서, 컴퓨터에서 실행 가능한 프로그램들이 기록된 컴퓨터로 판독 가능한 기록 매체에서 상기 프로 그램들은, 카메라를 이용하여 획득된 프리뷰 이미지를 디스플레이 상에 표시하는 동안, 상기 프리뷰 이미지에 포함된 동물의 움직임을 확인하는 동작, 상기 확인된 움직임의 크기가 임계값보다 크면, 상기 카메라를 통해, 제1 노출 값을 기반으로 캡처된 이미지를 획득하는 동작, 및 상기 확인된 움직임의 크기가 상기 임계값보다 작 으면, 상기 카메라를 통해, 상기 제1 노출 값보다 큰 제2 노출 값을 기반으로 캡처된 이미지를 획득하는 동작을 수행하기 위하여 상기 컴퓨터에 의해 야기될 수 있다. 본 개시에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 않으며, 언급하지 않은 또 다른 효과들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다. 본 문서에 개시된 다양한 실시 예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치 (예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시 예에 따른 전자 장치는 전술한 기기들에 한정 되지 않는다. 본 문서의 다양한 실시 예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시 예들로 한정하려는 것이 아니며, 해당 실시 예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한 다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아 이템에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C,\" \"A, B 및 C 중 적어도 하나\", 및 \" A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문 구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제1\", \"제2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하 기 위해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제1) 구성요소가 다른(예: 제2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소 에 직접적으로(예: 유선으로), 무선으로, 또는 제3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로 등의 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들 면, 일 실시 예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형태로 구현될 수 있다. 본 문서의 다양한 실시 예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장매체는, 비일시적(non-transitory) 저장매체의 형태 로 제공될 수 있다. 여기서, \"비일시적\"은 저장매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기 파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시 예에 따르면, 본 문서에 개시된 다양한 실시 예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래 될 수 있다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory (CD- ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어쪠)를 통해 또는 두개의 사용자 장치 들(예: 스마트폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리 와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시 예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소 들 또는 동작들이 생략되거나, 또는 하나 이상의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시 예들에 따르면, 모듈, 프로그램 또는 다른 구성요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8"}
{"patent_id": "10-2023-0157729", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 실시 예에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다양한 실시 예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 3은 일 실시 예에 따른, 전자 장치의 구성을 설명하는 도면이다. 도 4는 일 실시 예에 따라, 동물 촬영 시 팔 또는 다리에 대한 움직임을 판단하는 방식을 설명하는 도면이다.도 5는 일 실시 예에 따라, 동물의 움직임에 따른 속도를 계산하는 방식을 설명하는 도면이다. 도 6은 일 실시 예에 따라, 동물 촬영 시 머리 또는 몸통에 대한 움직임을 판단하는 방식을 설명하는 도면이다. 도 7은 일 실시 예에 따른, 전자 장치에서 동물의 움직임을 고려하여 이미지를 촬영하는 방법을 도시하는 흐름 도이다. 도 8은 일 실시 예에 따라, 전자 장치의 동작 방법을 도시하는 흐름도이다. 도면의 설명과 관련하여, 동일 또는 유사한 구성요소에 대해서는 동일 또는 유사한 참조 부호가 사용될 수 있다."}
