{"patent_id": "10-2023-0110871", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0029665", "출원번호": "10-2023-0110871", "발명의 명칭": "무선 통신 시스템에서 IMS-DC", "출원인": "삼성전자주식회사", "발명자": "배재현"}}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 시스템에서 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티의 방법에 있어서, 서비스의 요구 정보에 기반하여 딜레이 요구 정보를 계산하는 단계;NRF(network repository function) 엔티티로 상기 딜레이 요구 정보를 포함하여 MF(media function) 엔티티 발견을 위한 요청 메시지를 전송하는 단계; 및상기 NRF 엔티티로부터 상기 딜레이 요구 정보에 기반하여 선택된 MF 엔티티에 관련된 정보를 포함하는 응답 메시지를 수신하는 단계;를 포함하고, 상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함하는 것을 특징으로하는 방법."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 QoS 요구 정보에 기반하여 제공되는 서비스가 딜레이 크리티컬 서비스인지 여부를 결정하는 단계;상기 제공되는 서비스가 딜레이 크리티컬 서비스인 경우, 딜레이 크리티컬 서비스에 대한 지시자를 생성하는 단계; 및DCSF(data channel signaling function) 엔티티에게 상기 딜레이 크리티컬 서비스에 대한 지시자를 포함한 세션 이벤트 컨트롤 통지 메시지를 전송하는 단계;를 더 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 서비스의 요구 정보는 DCSF로부터 수신된 서비스 지연(latency) 관련 정보 또는 딜레이크리티컬 서비스에 대한 지시자 중 적어도 하나를 포함하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "무선 통신 시스템에서 NRF(network repository function) 엔티티의 방법에 있어서, IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티로부터 딜레이 요구 정보를포함한 MF(media function) 발견을 위한 요청 메시지를 수신하는 단계; 및상기 IMS AS엔티티에게 상기 딜레이 요구 정보에 기반하여 선택된 MF에 관련된 정보를 포함하는 응답 메시지를전송하는 단계;를 포함하고, 상기 딜레이 요구 정보는 서비스 요구 정보에 의해 계산되고,상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함하는 것을 특징으로하는 방법."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서, 상기 서비스의 요구 정보는 DCSF(data channel signaling function)로부터 수신된 서비스 지공개특허 10-2025-0029665-3-연(latency) 관련 정보 또는 딜레이 크리티컬 서비스에 대한 지시자 중 적어도 하나를 포함하는 것을 특징으로하는 방법."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "무선 통신 시스템에서 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티에 있어서,송수신부;및적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는,서비스의 요구 정보에 기반하여 N6 딜레이 요구 정보를 계산하고,NRF(network repository function) 엔티티로 상기 N6 딜레이 요구 정보를 포함하여 MF(media function) 엔티티발견을 위한 요청 메시지를 전송하고, 및상기 NRF 엔티티로부터 상기 딜레이 요구 정보에 기반하여 선택된 MF 엔티티에 관련된 정보를 포함하는 응답 메시지를 수신하도록 구성되고,상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함하는 것을 특징으로하는 IMS AS 엔티티."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 적어도 하나의 프로세서는, 상기 QoS 요구 정보에 기반하여 제공되는 서비스가 딜레이 크리티컬 서비스인지 여부를 결정하고, 상기 제공되는 서비스가 딜레이 크리티컬 서비스인 경우, 딜레이 크리티컬 서비스에 대한 지시자를 생성하고,및DCSF(data channel signaling function) 엔티티에게 상기 딜레이 크리티컬 서비스에 대한 지시자를 포함한 세션 이벤트 컨트롤 통지 메시지를 전송하도록 구성되는 것을 특징으로 하는 IMS AS 엔티티."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 서비스의 요구 정보는 DCSF로부터 수신된 서비스 지연(latency) 관련 정보 또는 딜레이크리티컬 서비스에 대한 지시자 중 적어도 하나를 포함하는 것을 특징으로 하는 IMS AS 엔티티."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "무선 통신 시스템에서 NRF(network repository function) 엔티티에 있어서, 송수신부;및적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는,IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티로부터 딜레이 요구 정보를포함한 MF(media function) 발견을 위한 요청 메시지를 수신하고, 및상기 IMS AS엔티티에게 상기 딜레이 요구 정보에 기반하여 선택된 MF에 관련된 정보를 포함하는 응답 메시지를전송하도록 구성되고,상기 딜레이 요구 정보는 서비스 요구 정보에 의해 계산되고,상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함하는 것을 특징으로공개특허 10-2025-0029665-4-하는 NRF 엔티티."}
{"patent_id": "10-2023-0110871", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 서비스의 요구 정보는 DCSF(data channel signaling function)로부터 수신된 서비스 지연(latency) 관련 정보 또는 딜레이 크리티컬 서비스에 대한 지시자 중 적어도 하나를 포함하는 것을 특징으로하는 NRF 엔티티."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시의 일 실 시예에 따르면, 무선 통신 시스템에서 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티의 방법은 서비스의 요구 정보에 기반하여 딜레이 요구 정보를 계산하는 단계; NRF(network repository function) 엔티티로 상기 딜레이 요구 정보를 포함하여 MF(media function) 엔티티 발견을 위한 요 청 메시지를 전송하는 단계; 및 상기 NRF 엔티티로부터 상기 딜레이 요구 정보에 기반하여 선택된 MF 엔티티에 관련된 정보를 포함하는 응답 메시지를 수신하는 단계;를 포함하고, 상기 서비스의 요구 정보는 단말로부터 수신 된 QoS(quality of service) 요구 정보를 포함한다."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 IMS-DC (IP(internet protocol) Multimedia Subsystem Data Channel) 서비스와 관련된 것으로, 보다 상세하게는, IMS-DC 서비스 연결을 위하여 부트스트랩 데이터 채널 셋업 과정 시그널링 과정 (Bootstrap Data Channel Setup Signaling Procedure) 중 IMS AS (Application Server)에서 MF (Media Function)의 디스커버리 (Discovery) 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz) 대역(예를 들어, 95GHz에서 3 테라헤르츠(3THz) 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를 제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. IMS 시스템은 IP 기반의 멀티미디어를 전송하기 위한 시스템으로, VoLTE, VoNR 등 다양한 서비스들이 LTE 또는 5G 망과 연계된 기존의 IMS 망을 통하여 서비스를 제공하고 있다. 이렇게 기존의 RTP 기반의 음성, 비디오, 텍 스트 등의 서비스에서 IMS와 연계된 데이터 채널 즉, IMS-DC 서비스를 이용하여 기조의 음성 또는 비디오 기반 의 서비스에서 별도의 어플리케이션을 이용한 사용자 위치 정보 전송, 스크린 쉐어링 등의 다양한 부가서비스를 제공하는 것이 IMS 데이터 체널의 목적이다. 이렇게 IMS 데이터 망내 데이터 채널을 이용한 부가서비스를 전송 하기 위하여 단말은 네트워크에 부트스트랩 데이터 채널 연결 과정을 통해 데이터 채널 기반의 서비스를 위한 시그널링 정보를 네트워크로 전송하고 네트워크는 사용자 또는 서비스 사업자의 설정 및 단말로부터 수신한 요 청 정보를 바탕으로 어플리케이션 정보를 단말로 전달하여 단말에서 특정 서비스를 위한 어플리케이션을 다운로 드 받을 수 있게 정보를 전송하며 단말은 해당 정보를 바탕으로 어플리케이션을 요청 및 수신할 수 있다. 또한 네트워크는 해당 어플리케이션의 데이터를 수신할 수 있도록 네트워크 내의 별도의 미디어 기능 엔터티를 할당 하며 이를 데이터 채널 어플리케이션 서버와 연결하는 미디어 리소스 관리 서비스 동작을 수행할 수 있다."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시는 IMS 데이터 채널 서비스를 이용하기 위한 부트스트랩 데이터 채널 연결 과정 중 단말 또는 서비스 사 업자의 서비스 요구사항에 맞는 미디어 기능 엔터티의 디스커버리 방법 및 장치를 제공한다."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티의 방법은 서비스의 요구 정보에 기반하여 딜레이 요구 정보를 계산하는 단계; NRF(network repository function) 엔티티로 상기 딜레이 요구 정보를 포함하여 MF(media function) 엔티티 발 견을 위한 요청 메시지를 전송하는 단계; 및 상기 NRF 엔티티로부터 상기 딜레이 요구 정보에 기반하여 선택된 MF 엔티티에 관련된 정보를 포함하는 응답 메시지를 수신하는 단계;를 포함하고, 상기 서비스의 요구 정보는 단 말로부터 수신된 QoS(quality of service) 요구 정보를 포함한다. 본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 NRF(network repository function) 엔티티의 방법은 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티로부터 딜레이 요구 정보를 포함 한 MF(media function) 발견을 위한 요청 메시지를 수신하는 단계; 및 상기 IMS AS엔티티에게 상기 딜레이 요구 정보에 기반하여 선택된 MF에 관련된 정보를 포함하는 응답 메시지를 전송하는 단계;를 포함하고, 상기 딜레이 요구 정보는 서비스 요구 정보에 의해 계산되고, 상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함한다. 본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티에 있어서, 송수신부;및 적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의프로세서는, 서비스의 요구 정보에 기반하여 N6 딜레이 요구 정보를 계산하고, NRF(network repository function) 엔티티로 상기 N6 딜레이 요구 정보를 포함하여 MF(media function) 엔티티 발견을 위한 요청 메시지 를 전송하고, 및 상기 NRF 엔티티로부터 상기 딜레이 요구 정보에 기반하여 선택된 MF 엔티티에 관련된 정보를 포함하는 응답 메시지를 수신하도록 구성되고, 상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함한다. 본 개시의 일 실시예에 따르면, 무선 통신 시스템에서 NRF(network repository function) 엔티티는 송수신부;및 적어도 하나의 프로세서;를 포함하고, 상기 적어도 하나의 프로세서는, IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티로부터 딜레이 요구 정보를 포함한 MF(media function) 발견 을 위한 요청 메시지를 수신하고, 및 상기 IMS AS엔티티에게 상기 딜레이 요구 정보에 기반하여 선택된 MF에 관 련된 정보를 포함하는 응답 메시지를 전송하도록 구성되고, 상기 딜레이 요구 정보는 서비스 요구 정보에 의해 계산되고, 상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함한다."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 실시예에 따른 방법 및 장치는, IMS-DC 서비스의 셋업을 위하여 UE 및 서비스 사업자의 서비스 요 구사항과 네트워크 정보를 바탕으로 미디어 기능 엔터티를 디스커버리 및 선택하기 위한 정보 생성 및 이를 바 탕으로 선택된 미디어 기능 엔터티를 이용한 부트스트랩 데이터 채널 셋업 과정을 수행할 수 있다."}
{"patent_id": "10-2023-0110871", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 개시의 일 실시예를 첨부된 도면을 참조하여 상세히 설명한다. 본 개시를 설명함에 있어서 본 개시가 속하는 기술 분야에 익히 알려져 있고 본 개시와 직접적으로 관련이 없는 기술 내용에 대해서는 설명을 생략한다. 이는 불필요한 설명을 생략함으로써 본 개시의 요지를 흐리지 않고 더 욱 명확히 전달하기 위함이다. 그리고 후술되는 용어들은 본 개시에서의 기능을 고려하여 정의된 용어들로서 이 는 사용자, 운용자의 의도 또는 관례 등에 따라 달라질 수 있다. 그러므로 그 정의는 본 명세서 전반에 걸친 내 용을 토대로 내려져야 할 것이다. 마찬가지 이유로 첨부된 도면에 있어서 일부 구성요소는 과장되거나 생략되거나 개략적으로 도시되었다. 또한, 각 구성요소의 크기는 실제 크기를 전적으로 반영하는 것이 아니다. 각 도면에서 동일한 또는 대응하는 구성 요소에는 동일한 참조 번호를 부여하였다. 이하, 기지국(base station: BS)은 단말의 자원 할당을 수행하는 주체로서, gNode B, eNode B, Node B, (또는 xNode B (여기서 x는 g, e를 포함하는 알파벳)), 무선 접속 유닛, 기지국 제어기, 위성 (satellite), 비행체 (airborn), 또는 네트워크 상의 노드 중 적어도 하나일 수 있다. 단말(user equipment: UE)은 MS (Mobile Station), 차량 (Vehicular), 위성 (satellite), 비행체 (airborn), 셀룰러폰, 스마트폰, 컴퓨터, 또는 통신기 능을 수행할 수 있는 멀티미디어 시스템을 포함할 수 있다. 본 개시에서 하향링크(Downlink, DL)는 기지국이 단 말에게 전송하는 신호의 무선 전송경로이고, 상향링크(Uplink, UL)는 단말이 기국에게 전송하는 신호의 무선 전 송경로를 의미한다. 추가적으로 단말이 또 다른 단말에게 전송하는 신호의 무선 전송 경로를 의미하는 사이드링 크(sidelink, SL)가 존재할 수 있다. 또한, 이하에서 LTE, LTE-A 또는 5G 시스템을 일 예로서 설명할 수도 있지만, 유사한 기술적 배경 또는 채널형 태를 갖는 여타의 통신시스템에도 본 개시의 실시예가 적용될 수 있다. 예를 들어 5G 이동통신 기술(혹은 new radio, NR) 이후에 개발되는 5G-Advance 또는 NR-Advance 또는 6세대 이동통신 기술(6G)이 이에 포함될 수 있 으며, 이하의 5G는 기존의 LTE, LTE-A 및 유사한 다른 서비스를 포함하는 개념일 수도 있다. 또한, 본 개시는 숙련된 기술적 지식을 가진 자의 판단으로써 본 개시의 범위를 크게 벗어나지 아니하는 범위에서 일부 변형을 통해 다른 통신시스템에도 적용될 수 있다. 이때, 처리 흐름도 도면들의 각 블록과 흐름도 도면들의 조합들은 컴퓨터 프로그램 인스트럭션들에 의해 수행될 수 있음을 이해할 수 있을 것이다. 이들 컴퓨터 프로그램 인스트럭션들은 범용 컴퓨터, 특수용 컴퓨터 또는 기 타 프로그램 가능한 데이터 프로세싱 장비의 프로세서에 탑재될 수 있으므로, 컴퓨터 또는 기타 프로그램 가능 한 데이터 프로세싱 장비의 프로세서를 통해 수행되는 그 인스트럭션들이 흐름도 블록(들)에서 설명된 기능들을 수행하는 수단을 생성하게 된다. 이들 컴퓨터 프로그램 인스트럭션들은 특정 방식으로 기능을 구현하기 위해 컴 퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 지향할 수 있는 컴퓨터 이용 가능 또는 컴퓨터 판독 가능 메모리에 저장되는 것도 가능하므로, 그 컴퓨터 이용가능 또는 컴퓨터 판독 가능 메모리에 저장된 인스트 럭션들은 흐름도 블록(들)에서 설명된 기능을 수행하는 인스트럭션 수단을 내포하는 제조 품목을 생산하는 것도 가능하다. 컴퓨터 프로그램 인스트럭션들은 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에 탑재 되는 것도 가능하므로, 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비 상에서 일련의 동작 단계들이 수행되어 컴퓨터로 실행되는 프로세스를 생성해서 컴퓨터 또는 기타 프로그램 가능한 데이터 프로세싱 장비를 수행하는 인스트럭션들은 흐름도 블록(들)에서 설명된 기능들을 실행하기 위한 단계들을 제공하는 것도 가능하 다. 또한, 각 블록은 특정된 논리적 기능(들)을 실행하기 위한 하나 이상의 실행 가능한 인스트럭션들을 포함하는 모듈, 세그먼트 또는 코드의 일부를 나타낼 수 있다. 또, 몇 가지 대체 실행 예들에서는 블록들에서 언급된 기 능들이 순서를 벗어나서 발생하는 것도 가능함을 주목해야 한다. 예를 들면, 잇달아 도시되어 있는 두 개의 블 록들은 사실 실질적으로 동시에 수행되는 것도 가능하고 또는 그 블록들이 때때로 해당하는 기능에 따라 역순으 로 수행되는 것도 가능하다. 이때, 본 실시예에서 사용되는 '~부'라는 용어는 소프트웨어 또는 FPGA(Field Programmable Gate Array) 또는 ASIC(Application Specific Integrated Circuit)과 같은 하드웨어 구성요소를 의미하며, '~부'는 어떤 역할들 을 수행한다. 그렇지만 '~부'는 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. '~부'는 어드레싱할 수 있는 저장 매체에 있도록 구성될 수도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 '~부'는 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태 스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라이버들, 펌웨어, 마이크로코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레 이들, 및 변수들을 포함한다. 구성요소들과 '~부'들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 '~ 부'들로 결합되거나 추가적인 구성요소들과 '~부'들로 더 분리될 수 있다. 뿐만 아니라, 구성요소들 및 '~부'들 은 디바이스 또는 보안 멀티미디어카드 내의 하나 또는 그 이상의 CPU들을 재생시키도록 구현될 수도 있다. 또 한 실시예에서 '~부'는 하나 이상의 프로세서를 포함할 수 있다. 셀룰러 이동통신 표준을 담당하는 3GPP는 4G LTE 시스템에서 5G 시스템으로의 진화를 꾀하기 위해 새로운 코어 네트워크 (Core Network) 구조를 5G Core (5GC) 라는 이름으로 명명하고 표준화를 진행하고 있다. 5GC는 4G를 위한 네트워크 코어인 진화된 패킷 코어 (Evolved Packet Core: EPC) 대비 다음과 같은 차별화된 기능을 지원한 다. 5GC에서는 네트워크 슬라이스 (Network Slice) 기능이 도입된다. 5G의 요구 조건으로, 5GC는 다양한 종류의 단 말 타입 및 서비스를 지원해야 한다; e.g., 초광대역 이동 통신(enhanced Mobile Broadband: eMBB), 초고신뢰 저지연 통신 (Ultra Reliable Low Latency Communications: URLLC), 대규모 사물 통신 (massive Machine Type Communications: mMTC). 이러한 단말/서비스는 각각 코어 네트워크에 요구하는 요구조건이 다르다. 예를 들면, eMBB 서비스인 경우에는 높은 데이터 전송 속도 (data rate)를 요구하고 URLLC 서비스인 경우에는 높은 안정성 과 낮은 지연을 요구할 수 있다. 이러한 다양한 서비스 요구조건을 만족하기 위해 네트워크 슬라이스 (Network Slice) 기술이 제안되었다. 네트워크 슬라이싱은 하나의 물리적인 네트워크를 가상화(virtualization)하여 여러 개의 논리적인 네트워크들 (예를 들어 네트워크 슬라이스들)을 만드는 방법을 의미할 수 있다. 활성화된 네트워크 슬라이스는 네트워크 슬 라이스 인스턴스라 칭할 수 있고, 각 네트워크 슬라이스 인스턴스(network slice instance: NSI)는 서로 다른 특성을 가질 수 있다. 이동통신 사업자는 각 NSI마다 그 특성에 맞는 네트워크 기능(network function: NF)을 구성함으로써 단말/서비스에 따른 다양한 서비스 요구조건을 만족시킬 수 있다. 예를 들어 이동통신 사업자는 각 단말마다 요구하는 서비스의 특성에 맞는 NSI를 할당하여 여러 5G 서비스들(예를 들어 eMBB, URLLC, 또는 mMTC)을 효율적으로 지원할 수 있다. 5GC는 이동성 관리 기능(mobility management function)과 세션 관리 기능(session management function)의 분 리를 통해 네트워크 가상화 패러다임 지원을 수월하게 할 수 있다. 4G LTE에서 모든 단말들은 등록, 인증, 이동 성 관리 및 세션 관리 기능을 담당하는 이동성 관리 엔티티(mobility management entity: MME) 라는 단일 코어 엔티티와의 시그널링 교환을 통해서 네트워크로부터 서비스를 제공받을 수 있다. 5G에서는 단말들(예를 들어 MTC 단말들을 포함)의 수가 폭발적으로 늘어나고 단말들의 타입에 따라 지원해야 하는 이동성 및 트래픽/세션 특성이 세분화됨에 따라 단일 엔티티(예를 들어 MME)에서 모든 기능들을 지원하게 되면 필요한 기능별로 엔티티 를 추가하는 확장성(Scalability)이 떨어질 수밖에 없다. 따라서, 제어 평면을 담당하는 코어 엔티티의 기능/구 현 복잡도와 시그널링 부하 측면에서 확장성 개선을 위해 이동성 관리 기능과 세션 관리 기능을 분리하는 구조 를 기반으로 다양한 기능들이 개발되고 있다. 대화형 서비스는 양방향(two way) 통신을 지원하기 위해 매우 낮은 레이턴시(latency)를 요구하고, 위에 언급된 접근성 향상을 위한 대화형 서비스를 위한 컨텐츠 전송에 이용 시, 추가적인 요구사항이 발생한다. 본 개시에서 는, 매우 낮은 레이턴시를 요구하는 데이터 채널 기반의 어플리케이션을 활용하는 서비스를 이용하기 위하여 단 말 또는 서비스 사업자 서버로부터 해당 서비스의 제공을 위하여 요구되는 낮은 레이턴시 값을 서비스 연결 요 청시 네트워크에 제공하고, 네트워크는 해당 데이터 채널 기반의 어플리케이션을 활용하는 서비스의 부트스트랩 데이터 채널을 연결시 해당 요구되는 레이턴시 값 기반으로 적절한 미디어 기능 엔터티를 검색하고 선택하는 기 능을 제공할 수 있다. 본 개시는 매우 낮은 레이턴시를 요구하는 데이터 채널 기반의 어플리레이션을 활용하는 서비스의 연결을 수립 하기 위한 방법 및 관련 파라미터를 네트워크에 전달하여 관련 정보를 기반으로 부스트스랩 데이터 채널 셋업 시그널링 과정을 통해 낮은 레이턴시를 제공하기 위한 네트워크 엔터티 간의 연결 동작을 수행하는 과정을 소개 한다. SIP(session initiation protocol)내에 낮은 레이턴시 요구사항을 위하여 3gpp-hint-qos 필드내에 해당 정보를 전달하거나 어플리케이션 서버가 해당 데이터 채널 관련 정보를 데이터 채널 서버내 데이터 채널 시그널 링 기능 엔터티에 등록할 경우 해당 어플리케이션 관련 서비스의 이용을 위해 요구되는 낮은 레이턴시 정보를 함께 등록할 수 있다. 상기 정보를 전달받은 IMS AS는 서비스 요구사항을 바탕으로 e2e delay를 고려한 미디어 기능 엔터티의 선택을 위해 관련 정보를 네트워크 기능 엔터티 검색시 활용할 수 있다. 또한 추가적으로 미디어 기능 엔터티의 NRF내의 네트워크 기능을 등록시 관련 정보를 추가적으로 미디어 프로파일내에 포함하여 등록하 여 IMS AS 등에서 해당 낮은 레이턴시 요구사항을 바탕으로 네트워크 기능 엔터티의 디스커버리 및 해당 정보를 바탕으로 미디어 기능 엔터티의 선택을 지원할 수 있다. 도 1은 본 개시의 일 실시 예에 따른 5G 시스템의 네트워크 구조 및 인터페이스를 도시한 도면이다. 도 1의 5G 시스템의 네트워크 구조에 포함된 네트워크 엔티티(entity)는 시스템 구현에 따라 네트워크 기능 (network function: NF)를 포함할 수 있다. 도 1을 참조하면, 5G 시스템의 네트워크 구조는 다양한 네트워크 엔티티들을 포함할 수 있다. 일 예로, 5G 시스 템은 인증 서버 기능(authentication server function: AUSF) 엔티티, 액세스 및 이동성 관리 기능((core) access and mobility management function: AMF) 엔티티, 세션 관리 기능(session management function: SMF) 엔티티, 정책 제어 기능(policy control function: PCF) 엔티티, 애플리케이션 기능 (application function: AF) 엔티티, 통합된 데이터 관리(unified data management: UDM) 엔티티, 데이터 네트워크(data network: DN), 네트워크 노출 기능(network exposure function: NEF) 엔티티, 네트워크 슬라이싱 선택 기능(network slicing selection function; NSSF) 엔티티, 네트워크 저장소 기능 (network repository function; NRF) 엔티티, 네트워크 데이터 분석 기능(network data analytics function; NWDAF), 에지 애플리케이션 서비스 도메인 저장소(edge application service domain repository: EDR), 에지 애플리케이션 서버(edge application server: EAS), EAS 디스커버리 기능(EAS discovery function: EASDF), 사용자 평면 기능(user plane function: UPF) 엔티티, (무선) 액세스 네트워크((radio) access network: (R)AN), 및 단말, 일 예로, 사용자 장치(user equipment: UE)를 포함할 수 있다. 5G 시스템의 각 NF 엔티티들은 다음과 같은 기능을 지원한다. AUSF는 UE의 인증을 위한 데이터를 처리하고 저장한다. AMF는 UE 단위의 접속 및 이동성 관리를 위한 기능을 제공하며, 하나의 UE 당 기본적으로 하나의 AMF에 연 결될 수 있다. 구체적으로, AMF는 3GPP 액세스 네트워크들 간의 이동성을 위한 CN 노드 간 시그널링, 무선 액세스 네트워크(radio access network: RAN) CP 인터페이스(즉, N2 인터페이스)의 종단(termination), NAS(non access stratum) 시그널링의 종단(N1), NAS 시그널링 보안(NAS 암호화(ciphering) 및 무결성 보호 (integrity protection)), AS 보안 제어, 등록 관리(등록 영역(registration area) 관리), 연결 관리, 아이들 모드 UE 접근성(reachability) (페이징 재전송의 제어 및 수행 포함), 이동성 관리 제어(가입 및 정책), 인트라 -시스템 이동성 및 인터-시스템 이동성 지원, 네트워크 슬라이싱의 지원, SMF 선택, 합법적 감청(lawful intercept)(AMF 이벤트 및 LI 시스템으로의 인터페이스에 대한), UE와 SMF 간의 세션 관리(session management: SM) 메시지의 전달 제공, SM 메시지 라우팅을 위한 트랜스패런트 프록시(transparent proxy), 액 세스 인증(access authentication), 로밍 권한 체크를 포함한 액세스 허가(access authorization), UE와 SMSF 간의 SMS 메시지의 전달 제공, 보안 앵커 기능(security anchor function: SAF) 및/또는 보안 컨텍스트 관리 (security context management: SCM) 등의 기능을 지원한다. AMF 엔티티의 일부 또는 전체의 기능들은 하 나의 AMF 엔티티의 단일 인스턴스(instance) 내에서 지원될 수 있다. DN은 예를 들어, 운영자 서비스, 인터넷 접속 또는 서드파티(3rd party) 서비스 등을 의미한다. DN은 UPF 엔티티로 하향링크 프로토콜 데이터 유닛(protocol data unit: PDU)을 전송하거나, UE로부터 전 송된 PDU를 UPF 엔티티로부터 수신한다. PCF 엔티티는 애플리케이션 서버로부터 패킷 흐름에 대한 정보를 수신하여, 이동성 관리, 세션 관리 등의 정책을 결정하는 기능을 제공한다. 구체적으로, PCF 엔티티는 네트워크 동작을 통제하기 위한 단일화된 정 책 프레임워크 지원, 제어평면 기능 엔티티(들)(예를 들어, AMF 엔티티, SMF 엔티티 등)이 정책 규칙을 시행할 수 있도록 정책 규칙 제공, 사용자 데이터 저장소(user data repository: UDR) 내 정책 결정을 위해 관련된 가 입 정보에 액세스하기 위한 프론트 엔드(front end) 구현 등의 기능을 지원한다. SMF 엔티티는 세션 관리 기능을 제공하며, UE가 다수 개의 세션을 가지는 경우 각 세션 별로 서로 다 른 SMF 엔티티에 의해 관리될 수 있다. 구체적으로, SMF 엔티티는 세션 관리(예를 들어, UPF 엔티티 와 (R)AN 노드 간의 터널(tunnel) 유지를 포함하여 세션 확립, 수정 및 해지), UE IP 주소 할당 및 관리 (선택적으로 인증 포함), UP 기능의 선택 및 제어, UPF 엔티티에서 트래픽을 적절한 목적지로 라우팅하기 위한 트래픽 스티어링(traffic steering) 설정, 정책 제어 기능(policy control functions)를 향한 인터페이스 의 종단, 정책 및 QoS(quality of service)의 제어 부분 시행, 합법적 감청(lawful intercept)(SM 이벤트 및 LI 시스템으로의 인터페이스에 대한), NAS 메시지의 SM(session management) 부분의 종단, 하향링크 데이터 통 지(downlink data notification), AN(access network) 특정 SM 정보의 개시자(AMF 엔티티를 경유하여 N2 를 통해 (R)AN에게 전달), 세션의 SSC (session and service continuity) 모드 결정, 로밍 기능 등의 기 능을 지원한다. SMF 엔티티의 일부 또는 전체의 기능들은 하나의 SMF 엔티티의 단일 인스턴스(instance) 내에서 지원될 수 있다. UDM 엔티티는 사용자의 가입 데이터, 정책 데이터 등을 저장한다. UDM 엔티티는 2개의 부분, 즉 애플 리케이션 프론트 엔드(front end: FE) 및 사용자 데이터 저장소(user data repository: UDR)를 포함한다. FE(front end)는 위치 관리, 가입 관리, 자격 증명(credential)의 처리 등을 담당하는 UDM FE와 정책 제어를 담당하는 PCF 엔티티를 포함한다. UDR은 UDM-FE에 의해 제공되는 기능들을 위해 요구되는 데이터와 PCF 엔티티 에 의해 요구되는 정책 프로필을 저장한다. UDR 내 저장되는 데이터는 가입 식별자, 보안 자격 증명(security credential), 액세스 및 이동성 관련 가입 데이터 및 세션 관련 가입 데이터를 포함하는 사용자 가입 데이터와 정책 데이터를 포함한다. UDM-FE는 UDR에 저장된 가입 정보에 액세스하고, 인증 자격 증명 처리(authentication credential processing), 사용자 식별자 핸들링(user identification handling), 액세스 인증, 등록/이동성 관 리, 가입 관리, SMS 관리 등의 기능을 지원한다. UPF 엔티티는 DN으로부터 수신한 하향링크 PDU를 (R)AN을 경유하여 UE에게 전달하며, (R)AN을 경유하여 UE로부터 수신한 상향링크 PDU를 DN으로 전달한다. 구체적으로, UPF 엔티티 는 인트라(intra)/인터(inter) RAT 이동성을 위한 앵커 포인트, 데이터 네트워크(Data Network)로의 상호 연결(interconnect)의 외부 PDU 세션 포인트, 패킷 라우팅 및 포워딩, 패킷 검사(inspection) 및 정책 규칙 시 행의 사용자 평면 부분, 합법적 감청(lawful intercept), 트래픽 사용량 보고, 데이터 네트워크로의 트래픽 플 로우의 라우팅을 지원하기 위한 상향링크 분류자(classifier), 멀티-홈(multi-homed) PDU 세션을 지원하기 위한 브랜치 포인트(branching point), 사용자 평면을 위한 QoS 핸들링(handling)(예를 들어 패킷 필터링, 게이팅 (gating), 상향링크/하향링크 레이트 시행), 상향링크 트래픽 검증 (서비스 데이터 플로우(service data flow: SDF)와 QoS 플로우 간 SDF 매핑), 상향링크 및 하향링크 내 전달 레벨(transport level) 패킷 마킹, 하향링크 패킷 버퍼링 및 하향링크 데이터 통지 트리거링 기능 등의 기능을 지원한다. UPF 엔티티의 일부 또는 전체 의 기능들은 하나의 UPF의 단일 인스턴스(instance) 내에서 지원될 수 있다. AF 엔티티는 서비스 제공(예를 들어, 트래픽 라우팅 상에서 애플리케이션 영향, 네트워크 능력 노출 (network capability exposure)에 대한 접근, 정책 제어를 위한 정책 프레임워크와의 상호동작 등의 기능을 지 원)을 위해 3GPP 코어 네트워크와 상호 동작한다. (R)AN은 4G 무선 액세스 기술의 진화된 버전인 진화된 E-UTRA(evolved E-UTRA)와 새로운 무선 액세스 기 술(new radio: NR)(예를 들어, gNB)을 모두 지원하는 새로운 무선 액세스 네트워크를 총칭한다. gNB은 무선 자원 관리를 위한 기능들(즉, 무선 베어러 제어(radio bearer control), 무선 허락 제어(radio admission control), 연결 이동성 제어(connection mobility control), 상향링크/하향링크에서 UE에게 자원의 동적 할당(dynamic allocation of resources)(즉, 스케줄링)), IP(internet protocol) 헤더 압축, 사용자 데이 터 스트림의 암호화(encryption) 및 무결성 보호(integrity protection), UE에게 제공된 정보로부터 AMF로의 라우팅이 결정되지 않는 경우, UE의 어태치(attachment) 시 AMF의 선택, UPF(들)로의 사용자 평면 데이터 라우 팅, AMF로의 제어 평면 정보 라우팅, 연결 셋업 및 해지, 페이징 메시지의 스케줄링 및 전송(AMF로부터 발생 된), 시스템 브로드캐스트 정보의 스케줄링 및 전송(AMF 또는 운영 및 유지(operating and maintenance: O&M) 로부터 발생된), 이동성 및 스케줄링을 위한 측정 및 측정 보고 설정, 상향링크에서 전달 레벨 패킷 마킹 (transport level packet marking), 세션 관리, 네트워크 슬라이싱의 지원, QoS 흐름 관리 및 데이터 무선 베 어러로의 매핑, 비활동 모드(inactive mode)인 UE의 지원, NAS 메시지의 분배 기능, NAS 노드 선택 기능, 무선 액세스 네트워크 공유, 이중 연결성(dual connectivity), NR과 E-UTRA 간의 밀접한 상호동작(tight interworking) 등의 기능을 지원한다. UE는 사용자 기기를 의미한다. 사용자 장치는 단말(terminal), ME(mobile equipment), MS(mobile station) 등의 용어로 언급될 수 있다. 또한, 사용자 장치는 노트북, 휴대폰, PDA(personal digital assistant), 스마트폰, 멀티미디어 기기 등과 같이 휴대 가능한 기기일 수 있고, 또는 PC(personal computer), 차량 탑재 장치와 같이 휴대 불가능한 기기일 수도 있다. NEF는 3GPP 네트워크 기능들에 의해 제공되는, 예를 들어, 제3자(3rd party), 내부 노출(internal exposure)/재노출(re-exposure), 애플리케이션 기능, 에지 컴퓨팅(Edge Computing)을 위한 서비스들 및 능력들 을 안전하게 노출하기 위한 수단을 제공한다. NEF는 다른 NF(들)로부터 (다른 NF(들)의 노출된 능력(들)에 기반한) 정보를 수신한다. NEF는 데이터 저장 네트워크 기능으로의 표준화된 인터페이스를 이용하여 구조 화된 데이터로서 수신된 정보를 저장할 수 있다. 저장된 정보는 NEF 엔티티에 의해 다른 NF 엔티티(들) 및 AF 엔티티(들)에게 재노출(re-expose)되고, 분석 등과 같은 다른 목적으로 이용될 수 있다. EASDF(은 FQDN(fully qualified domain name) 별로, 단말의 DNS(domain name system) 요청을 포워딩할 DNS 서 버의 주소, 단말의 DNS 요청을 포워딩할 때 추가해야 하는 IP 서브네트 주소로 표현될 수 있는 ECS(EDNS(extension mechanisms for DNS) client subnet) option을 추가할 수 있는 NF이다. EASDF는 EDR로부터 EAS(exchange active sync) 도메인 설정 정보를 수신 받고, 수신 받은 정보에 따라서, 단말로부터 수신한 DNS요청 메시지에 대한 처리를 수행한다. 또한, EASDF는 SMF로부터 단말 IP 주소 및 단말의 3GPP 내에서의 위 치 정보 및 DNS 메시지 처리 규칙 및 DNS 메시지 보고 규칙을 수신 받고, 단말로부터 수신한 DNS Query 메시지, DNS 서버로부터 수신한 DNS 응답 메시지를 처리하고, DNS 메시지 보고 규칙에 따라서, SMF에게 DNS 메시지 내의 정보 및 이를 가공한 통계 정보를 SMF에 전송하는 기능을 수행하는 NF이다. NRF는 서비스 디스커버리 기능을 지원한다. NF 인스턴스로부터 NF 디스커버리 요청 수신하고, 발견된 NF 인스턴스의 정보를 NF 인스턴스에게 제공한다. 또한, 이용 가능한 NF 인스턴스들과 그들이 지원하는 서비스를 유지한다. 한편, 도 1에서는 설명의 편의상 UE가 하나의 PDU 세션을 이용하여 하나의 DN에 액세스하는 경우에 대한 참조 모델을 예시하나, 본 개시는 이에 한정되지 않는다. UE는 다중의 PDU 세션을 이용하여 2개의(즉, 지역적(local) 그리고 중심되는(central)) 데이터 네트워크에 동시에 액세스할 수 있다. 이때, 서로 다른 PDU 세션을 위해 2개의 SMF들이 선택될 수 있다. 다만, 각 SMF는 PDU 세션 내 지역적인 UPF 및 중심되는 UPF를 모두 제어할 수 있는 능력을 가질 수 있다. 또한, UE는 단일의 PDU 세션 내에서 제공되는 2개의(즉, 지역적인 그리고 중심되는) 데이터 네트워크에 동 시에 액세스할 수도 있다. 3GPP 시스템에서는 5G 시스템 내 NF들 간을 연결하는 개념적인 링크를 참조 포인트(reference point)라고 정의 한다. 일 예로, 도 1의 5G 시스템에 포함된 참조 포인트(들)은 다음과 같다. - N1: UE와 AMF간의 참조 포인트 - N2: (R)AN과 AMF간의 참조 포인트 - N3: (R)AN과 UPF간의 참조 포인트 - N4: SMF와 UPF간의 참조 포인트 - N5: PCF와 AF간의 참조 포인트 - N6: UPF와 DN간의 참조 포인트 - N7: SMF와 PCF간의 참조 포인트 - N8: UDM과 AMF간의 참조 포인트 - N10: UDM과 SMF간의 참조 포인트 - N11: AMF와 SMF간의 참조 포인트 - N12: AMF와 AUSF간의 참조 포인트 - N13: UDM과 AUSF간의 참조 포인트 - N14: 2개의 AMF들 간의 참조 포인트 - N15: 비-로밍 시나리오의 경우, PCF와 AMF간의 참조 포인트, 로밍 시나리오의 경우 방문 네트워크(visited network) 내 PCF와 AMF 간의 참조 포인트 - Nx: SMF와 EASDF간의 참조 포인트 - Ny: NEF(EDF)와 EASDF간의 참조 포인트 도 2는 본 개시의 일 실시 예에 따른 IMS(IP(internet protocol) multimedia subsystem) 서비스 기반의 데이터 채널 서비스를 제공하는 IMS-DC(IP(internet protocol) multimedia subsystem data channel) 구조의 예시이다. 상기 구조에서 단말은 P-CSCF(proxy - call session control function) 및 S-SCSF(serving - call session control function) 등 기존의 CSCF에 SIP(session initiation protocol) INVITE 메시지를 전송할 수 있다. 상 기 SIP INVITE 메시지 내에는 미디어 관련 파라미터 및 QoS 관련 요구사항 정보를 SDP(software defined perimeter) 내 포함하여 함께 네트워크로 전달할 수 있다. 추가적으로 IMS 데이터 채널 서비스를 이용하기 위하여 부트스트랩 정보를 포함하는 SDP offer를 함께 포함하여 전달할 수 있다. 상기 SDP 정보들을 포함한 SIP INVITE를 수신한 S-CSCF는 SIP INVITE 내에 데이터 채널 서비스 연결 요청을 위 한 부트스트랩 데이터 채널 SDP offer를 포함하고 있으면 해당 부트스트랩 관련 SDP offer 내용을 IMS AS로 전 달할 수 있다. 이 때, S-CSCF는 전달받은 부트스트랩 관련 SDP offer의 내용을 바탕으로 상기 단말 또는 네트워 크가 IMS-DC를 지원하는 지를 체크하여 만약 양측 모두 데이터 채널을 지원한다면 데이터 채널 연결을 위한 부 트스트랩 데이터 채널 연결을 위한 정보를 IMS AS로 전달을 결정할 수 있다. S-CSCF로부터 부트스트랩 관련 SDP offer 메시지를 수신한 IMS AS는 해당 UE 또는 가입자가 해당 데이터 채널 서비스를 이용할 수 있는지를 먼저 HSS(home subscriber server)로부터 확인할 수 있다. 만약 해당 사용자의 유저 프로파일 기반으로 해당 사용자 가 데이터 채널을 사용할 수 없을 경우 일반적인 IMS 과정을 통해 데이터 채널의 연결 없이 MMTel(multimedia telephony) 세션 셋업 동작을 수행할 수 있다. 또한 IMS AS는 만약 해당 사용자가 데이터 채널 기반의 서비스를 이용하지 못할 경우 S-CSCF로부터 전달받은 SIP INVITE 메시지내에 DC(data channel) 관련 미디어 정보를 삭제 하여 SIP INVITE 메시지를 업데이트한 뒤 업데이트된 SIP INVITE 메시지를 S-CSCF로 전달할 수 있다. 해당 서비스 사용자가 IMS 데이터 채널 기반의 서비스를 이용할 수 있을 경우 DCSF (Data channel Signaling function)로 데이터 채널 콜 요청을 통해 데이터 채널 부트스트랩핑을 수행할 수 있다. IMS AS는 네트워크 사업 자의 로컬 설정 또는 UE로부터 전달된 정보를 바탕으로 DCSF 인스턴스의 디스커버리와 선택을 NRF로부터 수행하 여 DCSF를 선택할 수 있다. IMS AS는 상기 과정을 통해 선택된 DCSF로 SessionEstablishmentRequestEvent, Session ID, CallingID, CalledID, SessionCase, Event initiator, MediaInfoList, DC Stream ID 등의 정보를 포함하는 세션 이벤트 컨트롤 통지 (SessionEventControl_Notify) 메시지를 전달할 수 있다. IMS AS로부터 DC 컨트롤 요청을 받은 DCSF는 DC 컨트롤 요청 메시지내의 관련 파라미터를 바탕으로 어떻게 부트 스트랩 데이터 채널을 생성할 것인지 정책 결정을 수행할 수 있다. 또한 DCSF는 UE가 MF 또는 MRF(media resource function)를 통해 어플리케이션 다운로딩을 할 수 있도록 MDC1 미디어 정보를 결정할 수 있다. 상기 결정 정보를 바탕으로 DCSF는 SessionID, MediaInstructionSet 등의 정보를 포함하는 MediaControl_MediaInstruction 메시지를 IMS AS로 전달할 수 있다. DCSF는 MDC1 미디어 엔드포인트 주소, DC stream ID, MDC1 인터페이스에서 전달되는 어플리케이션 리스트의 URL의 대체 정보 등을 MediaInstructionSet 내 포함하여 IMS AS로 전달할 수 있다. 이를 바탕으로 DCSF는 IMS AS에게 originating 과 terminating 측에서 MF를 이용한 부트스트랩 데이터 채널을 어떻게 생성할 수 있을지 정책을 제공할 수 있다. IMS AS는 로컬 설정 또는 DC 미디어 기능을 지원하는 MF 인스턴스 또는 enhanced MRF를 NRF를 이용하여 검색 및 선택하는 과정을 통해 MF를 선택할 수 있다. IMS AS는 Media Termination Descriptor들의 리스트를 상기 과정에서 선택된 MF에 Nmf_MRM_Create 메시지를 통 해 전달할 수 있다. IMS AS는 서로 다른 두개의 Media Termination의 생성을 요청할 수 있다. 한 Media Termination 정보는 로컬 부트스트랩 미디어 관련 정보이고, 다른 하나는 리모트 UE에게 제공하기 위한 리모트 부트스트랩 미디어 관련 정보를 나타낼 수 있다. 각각의 Media Termination 은 Mb 와 MDC1 인터페이스의 리소스 할당 요구 정보를 포함할 수 있다. MF는 해당 데이터 채널 미디어 리소스 정보의 협상의 결과를 IMS AS로 전달 할 수 있다. IMS AS는 DCSF로부터 MediaInstruction 요청에 대한 응답을 전달할 수 있다. 해당 응답 메시지내에는 상기 동작 의 결과 정보와 MDC1 데이터 채널 미디어 리소스 정보 협상 정보를 포함할 수 있다. DCSF는 IMS AS로부터 전달받은 MediaInstruction 요청에 대한 응답 메시지내의 미디어 리소스 정보를 저장하고 IMS AS로부터 데이터 채널 연결 통지(SessionEventControl_Notify) 요청 관련 응답 메시지를 IMS AS로 전달할 수 있다. IMS AS는 MF 또는 enhanced MRF의 미디어 정보를 추가한 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 S-CSCF로 전송할 수 있다. S-CSCF는 전달받은 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 리모트 네트 워크 및 UE#2로 전달할 수 있다. UE#2와 terminating 네트워크는 부트스트랩 데이터 채널 관련 SDP 응답을 18X 응답 메시지에 포함하여 originating 네트워크에 전달할 수 있다. 수신한 SDP 응답 메시지에 따라 MF 또는 enhanced MRF는 UE#2의 데이 터 채널 미디어 리소스 정보를 업데이트 할 수 있다. 이후 UE#2와 terminating 네트워크는 요청이 성공적으로 완료됐음을 의미하는 200 OK 응답 메세지를 전송할 수 있다. IMS AS는 SessionEstablishmentSuccessEvent, SessionID, MediaInfoList 를 포함하는 SessionEventControl Notify 메시지를 DCSF로 전달하여 성공적인 세션 연결 관련 이벤트 정보를 알려줄 수 있다. 이후 DCSF로부터 해 당 성공적인 세션 연결 이벤트 통지에 대한 응답 메시지를 수신한 IMS AS는 UE#1에게 부트스트랩 데이터 채널이 연결되었음을 나타내는 200 OK 메시지를 전달할 수 있다. 이를 통해 UE#1와 UE#2 및 originating MF 또는 enhanced MRF 사이에 부트스트랩 데이터 채널 연결을 할 수 있다. 이후 UE#1 및 UE#2는 MF 또는 enhanced MRF 에게 어플리케이션 요청 메시지를 전달하여 데이터 채널 어플리케이션을 요청할 수 있다. 만약 멀티 DC 어플리 케이션이 지원한다면 application list를 요청할 수 있다. MF 또는 MRF는 DCSF로부터 수신한 대체 URL (replacement URL) 정보를 바탕으로 루트 URL을 Application 관련 URL 정보로 변경할 수 있다. 이후 MF는 UE로 부터 전달받은 해당 어플리케이션 요청 메시지를 DCSF로 전달할 수 있다. DCSF는 UE의 데이터 채널 처리 능력 및 선택에 따라 어플리케이션 리스트 또는 적절한 데이터 어플리케이션들을 UE#1 및 UE#2에 제공할 수 있다. MF 의 위치에 따라 terminating MF 또는 MRF를 사용할 경우 상기 과정을 terminating DCSF를 통해 수행하고 적절 한 데이터 채널 어플리케이션을 다운로드 할 수 있다. IMS 세션 및 부트스트랩 데이터 채널의 연결 및 데이터 채널 어플리케이션이 UE#1 및 UE#2에 다운로드 된 이후 UE#1은 업데이트된 SDP를 포함한 SIP reINVITE 메시지를 IMS AS로 전송할 수 있다. 업데이트된 SDP는 부트스트 랩 데이터 채널 정보뿐만 아니라 어플리케이션 데이터 채널 요청 및 관련 DC 어플리케이션 바인딩 정보 등을 포 함할 수 있다. IMS AS는 유저 구독 데이터 정보를 바탕으로 미디어 변경 요청 이벤트 통지를 DCSF에게 할 것인지 판단할 수 있 다. IMS AS가 DCSF로 이벤트 통지를 할지 결정하였으면 MediaChangeRequest Event, Session ID, Event Direction, Event initiator, Media Info List를 포함하는 SessionEventControl_Notify 메시지를 DCSF로 전달 할 수 있다. DCSF는 세션 이벤트 통지 메시지를 수신한 이후, 통지메시지를 통해 전달받은 관련 파라미터와 네트워크 사업자 의 정책에 따라 어플리케이션 데이터 채널 연결 요청을 어떻게 수행할 것인지 정책을 결정할 수 있다. DCSF는 UE#2가 타켓 엔드포인트이며 local MF 또는 enhanced MRF의 앵커 (Anchor)가 필요 없을 경우 어플리케이션 데이 터 채널 미디어 디스크립터를 SDP offer내에 추가를 결정할 수 있다. 만약 MF 또는 enhanced MRF가 어플리케이 션 데이터 채널의 앵커로 필요하다면, DCSF는 Nimsas_MediaControl 메시지를 IMS AS에 전달하여 IMS AS가 MF 또는 enhanced MRF의 데이터 채널 미디어 리소스의 할당을 수행하도록 지시할 수 있다. DCSF는 세션 이벤트 통지 메시지에 대한 응답을 IMS AS에 전달할 수 있다. 이후 IMS AS는 originating S- CSCF로 SIP reINVITE 메시지를 전달할 수 있으며 S-CSCF는 이를 terminating 네트워크 와 UE#2로 전달할 수 있 다. UE#2와 terminating 네트워크에서 어플리케이션 데이터 채널 관련 SDP 응답 내에 200 OK 응답을 포함하여 originating 네트워크로 전달할 수 있다. 이후 terminating 네트워크로부터 200 OK를 포함한 SDP offer 응답 메시지를 수신한 IMS AS는 DCSF로 성공적인 데이터 채널 변경을 알려 줄 수 있다. DCSF는 IMS AS에 통지에 대한 응답을 전송하게 되며 이후 IMS AS는 200 OK 응답을 originating S-CSCF 및 P-CSCF를 거쳐 UE#1로 전달할 수 있다. 이때 Originating 네트워크의 P-CSCF는 200OK 응답을 포함하는 SDP 응답 정보를 바탕으로 어플리 케이션 데이터 채널 미디어의 QoS 절차를 수행할 수 있다. UE#1은 terminating 네트워크로 ACK를 전송할 수 있다. 상기 과정을 통해 UE#1 및 UE#2 간의 어플리케이션 데이터 채널 연결 동작을 수행할 수 있다. 도 3a, 3b, 및 3c는 본 개시의 일 실시 예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server)에서 N6 딜레이 요구사항 정보를 바탕으로 MF 엔터티 선택에 활용 방법 및 해당 MF(media function) 기반의 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 도 3a, 3b, 및 3c는 본 개시의 일 실시 예에 따른 UE에서 latency 관련 서비스 요구사항을 전달하여 해당 latency 요구사항을 바탕으로 데이터 채널 서비스를 이용하기 위한 MF의 선택 및 연결을 지원하기 위한 정보를 전달하는 방법을 설명하기 위한 순서도이다. 즉, 도 3a, 3b, 및 3c는 본 개시의 일 실시 예에 따른 UE에서 IMS-DC(IP(internet protocol) multimedia subsystem data channel) 서비스 연결 요청 시 서비스 요청 메시지 내에 서비스 요구사항 정보를 함께 포함하여 전송하고, IMS AS(IP(internet protocol) multimedia subsystem application server)에서 N6 딜레이 요구사항 정보를 MF 엔터티 선택에 활용하는 방법 및 해당 MF(media function) 기반의 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 단계 301에서, 단말은 P-CSCF 및 S-SCSF 등 기존의 CSCF에 SIP INVITE 메시지를 전송할 수 있다. 상기 SIP INVITE 메시지 내에는 미디어 관련 파라미터 및 QoS 관련 요구사항 정보를 SDP 내 포함하여 함께 네트워크로 전 달할 수 있다. 추가적으로, IMS 데이터 채널 서비스를 이용하기 위하여 부트스트랩 정보를 포함하는 SDP offer 를 함께 포함하여 전달할 수 있다. 이 때, 부트스트랩 데이터 채널 관련 SDP offer 내에 서비스 관련 특정 QoS 요구사항 정보 ('loss' or 'latency')를 SDP 속성(Attribute) 정보 내에 포함하여 함께 전달할 수 있다. 예를 들어, UE가 3D 아바타 콜 등을 데이터 채널을 통한 어플리케이션에 수행하기 위해서는 최소 e2e latency를 100ms 로 가정할 수 있다. 이를 바탕으로 UE가 데이터 채널 관련 부트스트랩 데이터 채널 연결 요청을 위한 부 트스트랩 DC SDP offer를 생성 및 전달 시 해당 SDP offer 내에 3gpp-qos-hint 속성을 포함하여 100ms의 e2e 서비스 요구사항을 네트워크로 전달할 수 있다. 상기 SDP 정보들을 포함한 SIP INVITE를 수신한 S-CSCF는 SIP INVITE 내에 데이터 채널 서비스 연결 요청을 위한 부트스트랩 데이터 채널 SDP offer를 포함하고 있으면 해당 부트스트랩 관련 SDP offer 내용을 IMS AS로 전달할 수 있다. 이 때, S-CSCF는 전달받은 부트스트랩 관련 SDP offer의 내용을 바탕으로 상기 단말 또는 네트워크가 IMS-DC를 지원하는지를 체크하여 만약 양측 모두 데이터 채널을 지원한다면 데이터 채널 연결을 위한 부트스트랩 데이터 채널 연결을 위한 정보를 IMS AS로 전달을 결정 할 수 있다. 단계 302에서, S-CSCF로부터 부트스트랩 관련 SDP offer 메시지를 수신한 IMS AS는 해당 UE 또는 가입자가 해당 데이터 채널 서비스를 이용할 수 있는지를 먼저 HSS로부터 확인할 수 있다. 만약 해당 사용자의 유저 프로파일 기반으로 해당 사용자가 데이터 채널을 사용할 수 없을 경우 일반적인 IMS 과정을 통해 데이터 채널의 연결 없 이 MMTel 세션 셋업 동작을 수행할 수 있다. 또한 IMS AS는 만약 해당 사용자가 데이터 채널 기반의 서비스를 이용하지 못할 경우 S-CSCF로부터 전달받은 SIP INVITE 메시지내에 DC 관련 미디어 정보를 삭제하여 SIP INVITE 메시지를 업데이트한 뒤 업데이트된 SIP INVITE 메시지를 S-CSCF로 전달할 수 있다. 해당 서비스 사용자가 IMS 데이터 채널 기반의 서비스를 이용할 수 있을 경우 DCSF (Data channel Signaling function)로 데이터 채널 콜 요청을 통해 데이터 채널 부트스트랩핑을 수행할 수 있다. IMS AS는 네트워크 사업자의 로컬 설정 또는 UE로부 터 전달된 정보를 바탕으로 DCSF 인스턴스의 디스커버리와 선택을 NRF로부터 수행하여 DCSF를 선택할 수 있다. 또한 IMS AS는 UE로부터 전달받은 부트스트랩 데이터 채널 관련 SDP offer 내에 latency 관련 QoS 관련 속성 정 보를 포함하고 있으면 해당 서비스의 경우 딜레이 크리티컬 서비스라는 지시자 정보(Delay critical service indication)의 생성을 결정할 수 있다. 해당 데이터 채널 서비스의 딜레이 크리티컬 서비스 판단 여부는 5QI(5G QoS(quality of service) identifier)의 Delay critical GBR(guaranteed bit rate)의 PDB(packet delay budget) 값을 기준으로 UE에서 요청한 e2e(end to end) 서비스 요구사항을 비교하여 해당 지시자 생성 및 서비 스 요청을 결정할 수 있다. 단계 303에서, IMS AS는 상기 단계 302에서 UE로부터 전달된 정보 또는 네트워크 사업자 정책에 따라 선택된 DCSF로 SessionEstablishmentRequestEvent, Session ID, CallingID, CalledID, SessionCase, Event initiator, MediaInfoList, DC Stream ID, Delay critical service indication 등의 정보를 포함하는 세션 이 벤트 컨트롤 통지 (SessionEventControl_Notify) 메시지를 전달할 수 있다. 단계 304 및 단계 305에서, IMS AS로부터 DC 컨트롤 요청을 받은 DCSF는 DC 컨트롤 요청 메시지 내의 관련 파라 미터를 바탕으로 어떻게 부트스트랩 데이터 채널을 생성할 것인지 정책 결정을 수행할 수 있다. 또한 DCSF는 UE 가 MF 또는 MRF를 통해 어플리케이션 다운로딩을 할 수 있도록 MDC1 미디어 정보를 결정할 수 있다. 일 실시예 로, DCSF는 해당 사용자의 서비스 요청 정보와 관련하여 해당 어플리케이션이 딜레이 크리티컬 서비스인지 여부 를 판단한 뒤 만약 해당 어플리케이션이 딜레이 크리티컬 서비스이면 이를 딜레이 크리티컬 서비스 지시자 (Delay critical service indication)을 생성하여 IMS AS로 전달할 수 있다. 또한 해당 서비스가 딜레이 크리 티컬 서비스이지만 UE로부터 별도의 레이턴시 관련 QoS hint 정보를 수신하지 못하였다면 DCSF는 DC-AS로부터 제공되는 레이턴시 정보를 딜레이 크리티컬 서비스 지시자 정보와 함께 IMS AS로 전송할 수 있다. DC-AS로부터 제공되는 latency 정보는 어플리케이션을 DCSF에 등록 시 어플리케이션 관련 정보로 함께 저장하거나 DCSF가 딜 레이 크리티컬 서비스 기반의 어플리케이션인지 판단 후 DC AS로부터 요청하여 전달받을 수 있다. DCSF는 IMS AS가 UE로부터 부트스트랩 데이터 채널 SDP offer내 latency 관련 QoS hint 정보를 수신하였는지 여부를 IMS AS로부터 전달 받은 세션 이벤트 컨트롤 통지 메시지 내 딜레이 크리티컬 서비스 지원 지시자의 여부로 판단할 수 있다. 단계 306에서, DCSF는 상기 결정 정보를 바탕으로 SessionID, MediaInstructionSet 등의 정보를 포함하는 MediaControl_MediaInstruction 메시지를 IMS AS로 전달할 수 있다. 일 실시예로, 단계 306에서, DCSF는 상기정보 이외에, Delay critical service indication, e2e service latency requirement의 정보를 포함하는 MediaControl_MediaInstruction 메시지를 IMS AS로 전달할 수 있다. DCSF는 MDC1 미디어 엔드 포인트 주소, DC stream ID, MDC1 인터페이스에서 전달되는 어플리케이션 리스트의 URL의 대체 정보 등을 MediaInstructionSet 내 포함하여 IMS AS로 전달할 수 있다. 이를 바탕으로 DCSF는 IMS AS에게 originating 과 terminating 측에서 MF를 이용한 부트스트랩 데이터 채널을 어떻게 생성할 수 있을지 정책을 제공할 수 있다. 단계 307에서, IMS AS는 딜레이 크리티컬 서비스를 지원하기 위하여 MF 또는 enhanced MRF의 딜레이가 최소화되 는 MF 또는 enhanced MRF의 선택을 결정할 수 있다. 이를 위하여 IMS AS는 UE로부터 SDP offer 내 QoS 속성 정 보를 통해 전달받은 e2e 서비스 요구사항, 또는 NWDAF 또는 AF (DC AS)로부터 전달받은 CN (Core network)의 통계적 PDB 정보를 바탕으로 MF 또는 enhanced MRF의 디스커버리 및 선택 시 전달할 N6 딜레이 요구사항 (Required N6 delay or N6 delay requirement)을 계산할 수 있다. 일 실시예로, IMS AS는 DCSF를 통해 DC-AS로 부터 전달받은 e2e 서비스 요구사항 및 NWDAF 또는 AF (DC AS)로부터 전달받은 CN (Core network)의 통계적 PDB 정보를 바탕으로 N6 딜레이 요구사항 (Required N6 delay or N6 delay requirement)을 계산할 수 있다. 단계 308에서, IMS AS는 단계 307을 통해 계산된 N6 딜레이 요구사항 포함하는 MF 프로파일 정보를 바탕으로 DC 미디어 기능을 지원하는 MF 인스턴스 또는 enhanced MRF의 디스커버리 및 선택을 위한 NF 디스커버리 요청 (NFDiscoery_Request) 메시지를 NRF로 전달할 수 있다. 단계 309에서, NRF는 IMS AS에서 MF 선택을 위하여 전달된 NF 디스커버리 요청 메시지 내의 MF 프로파일 정보를 바탕으로 적절한 MF를 선택할 수 있다. 이 때, 본 발명의 실시예와 같이 딜레이 크리티컬 서비스를 지원하기 위 하여 N6 딜레이 요구사항 정보가 포함되어 있을 경우 해당 정보를 우선순위로 두고 적절한 MF를 선택할 수 있다. MF 등록 시 사전에 관련 해당 MF와 UPF사이의 N6 딜레이 정보를 측정 및 이를 포함하여 해당 MF의 NRF 등 록을 수행하였다고 가정할 수 있다. 단계 310에서, NRF는 해당 N6 딜레이 요구사항을 만족하는 MF를 선택하여 해당 정보를 IMS AS로 NF 디스커버리 요청 응답 (NFDiscovery_Request Response) 메시지를 통해 전달할 수 있다. 단계 311에서, IMS AS는 Media Termination Descriptor들의 리스트를 상기 과정에서 선택된 MF에 Nmf_MRM_Create 메시지를 통해 전달할 수 있다. IMS AS는 서로 다른 두개의 Media Termination의 생성을 요청 할 수 있다. 한 Media Termination 정보는 로컬 부트스트랩 미디어 관련 정보이고, 다른 하나는 리모트 UE에게 제공하기 위한 리모트 부트스트랩 미디어 관련 정보를 나타낼 수 있다. 각각의 Media Termination 은 Mb 와 MDC1 인터페이스의 리소스 할당 요구 정보를 포함할 수 있다. MF는 해당 데이터 채널 미디어 리소스 정보의 협 상의 결과를 IMS AS로 전달할 수 있다. 단계 312에서, IMS AS는 MF로부터 데이터 채널 미디어 리소스 할당 결과를 수신한 뒤 IMS AS는 DCSF로부터 MediaInstruction 요청에 대한 응답을 전달할 수 있다. 해당 응답 메시지내에는 상기 동작의 결과 정보와 MDC1 데이터 채널 미디어 리소스 정보 협상 정보를 포함할 수 있다. 단계 313에서, DCSF는 IMS AS로부터 전달받은 MediaInstruction 요청에 대한 응답 메시지 내의 미디어 리소스 정보를 저장하고 IMS AS로부터 데이터 채널 연결 통지(SessionEventControl_Notify) 요청 관련 응답 메시지를 IMS AS로 전달할 수 있다. 단계 314에서, IMS AS는 MF 또는 enhanced MRF의 미디어 정보를 추가한 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 S-CSCF로 전송할 수 있다. 단계 315에서, S-CSCF는 전달받은 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 리모트 네트워크 및 UE#2로 전달할 수 있다. 단계 316에서, 단계 315에서 전달받은 업데이트된 SDP offer 정보를 바탕으로 부트스트랩 데이터 채널 연결을 위한 terminating 단말의 협상 과정을 originating과 유사하게 수행할 수 있다. 단계 317에서, UE#2와 terminating 네트워크는 부트스트랩 데이터 채널 관련 업데이트 또는 변경 관련 요구사항 이 있을 경우 SDP 응답을 18X 응답 메시지에 포함하여 originating 네트워크에 전달할 수 있다. 수신한 SDP 응 답 메시지에 따라 MF 또는 enhanced MRF는 UE#2 관련 데이터 채널 미디어 리소스 정보를 업데이트 할 수 있다. 단계 318에서, 별도의 변경 사항이 없을 경우 UE#2와 terminating 네트워크는 200 OK 응답 메세지를 originating 네트워크의 S-CSCF로 전송할 수 있다.단계 319에서, 200 OK 응답 메시지를 수신한 S-CSCF는 이를 IMS AS로 전달할 수 있다. 단계 320에서, 상기 단계 319로부터 200 OK 메시지를 수신한 IMS AS는 SessionEstablishmentSuccessEvent, SessionID, MediaInfoList 등의 정보를 포함하는 세션 이벤트 컨트롤 통지 (SessionEventControl_Notify) 메시 지를 DCSF로 전달하여 성공적인 세션 연결 관련 이벤트 정보를 알려줄 수 있다. 단계 321 및 단계 322에서, DCSF로부터 해당 성공적인 세션 연결 이벤트 통지에 대한 응답 메시지를 수신한 IMS AS는 UE#1에게 부트스트랩 데이터 채널이 연결 되었음을 나타내는 200 OK 메시지를 전달할 수 있다. 단계 323 및 단계 324에서, UE#1와 UE#2 및 originating MF 또는 enhanced MRF 사이에 부트스트랩 데이터 채널 연결을 할 수 있다. 이후 UE#1 및 UE#2는 MF 또는 enhanced MRF에게 어플리케이션 요청 메시지를 전달하여 데이 터 채널 어플리케이션을 요청할 수 있다. 만약 멀티 DC 어플리케이션이 지원한다면 application list를 요청할 수 있다. MF 또는 MRF는 DCSF로부터 수신한 대체 URL (replacement URL) 정보를 바탕으로 루트 URL을 Application 관련 URL 정보로 변경할 수 있다. 이후 MF는 UE로부터 전달받은 해당 어플리케이션 요청 메시지를 DCSF로 전달할 수 있다. DCSF는 UE의 데이터 채널 처리 능력 및 선택에 따라 어플리케이션 리스트 또는 적절한 데이터 어플리케이션들을 UE#1 및 UE#2에 제공할 수 있다. 단계 325 및 단계 326에서, MF의 위치에 따라 terminating MF 또는 MRF를 사용한 부트스트랩 데이터 채널을 연 결할 경우 상기 UE#1 및 UE#2의 데이터 채널 어플리케이션 요청 과정을 terminating DCSF를 통해 수행하고 적절 한 데이터 채널 어플리케이션을 다운로드 할 수 있다. 도 4a, 4b, 4c, 및 4d는 본 개시의 일 실시 예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server)에서 MF(media function) 선택이 실패할 경우 해당 에러 정보 및 거절 이유를 UE에 전달하 여 UE에서 업데이트된 서비스 요구사항을 바탕으로 서비스 연결 요청을 다시 전송하는 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 도 4a, 4b, 4c, 및 4d는 본 개시의 일 실시 예에 따른 UE에서 latency 관련 서비스 요구사항을 전달하여 해당 latency 요구사항을 바탕으로 데이터 채널 서비스를 이용하기 위한 MF의 선택 및 연결이 어려울 경우 이를 지원 하기 위한 정보를 전달하는 방법을 설명하기 위한 순서도이다. 즉, 도 4a, 4b, 4c, 및 4d는 본 개시의 일 실시 예에 따른 UE에서 IMS-DC 서비스 연결 요청 시 서비스 요청 메 시지 내에 서비스 요구사항 정보를 함께 포함하여 전송하고, IMS AS에서 MF 선택이 실패할 경우 해당 에러 정보 및 거절 이유를 UE에 전달하여 UE에서 업데이트된 서비스 요구사항을 바탕으로 서비스 연결 요청을 다시 전송하 는 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 단계 401에서, 단말은 P-CSCF 및 S-SCSF 등 기존의 CSCF에 SIP INVITE 메시지를 전송할 수 있다. 상기 SIP INVITE 메시지 내에는 미디어 관련 파라미터 및 QoS 관련 요구사항 정보를 SDP내 포함하여 함께 네트워크로 전 달할 수 있다. 추가적으로 IMS 데이터 채널 서비스를 이용하기 위하여 부트스트랩 정보를 포함하는 SDP offer를 함께 포함하여 전달할 수 있다. 이 때, 부트스트랩 데이터 채널 관련 SDP offer 내에 서비스 관련 특정 QoS 요 구사항 정보 ('loss' or 'latency') 를 SDP 속성(Attribute) 정보 내에 포함하여 함께 전달할 수 있다. 예를 들어, UE가 3D 아바타 콜 등을 데이터 채널을 통한 어플리케이션에 수행하기 위해서는 최소 e2e latency를 100ms 로 가정할 수 있다. 이를 바탕으로 UE가 데이터 채널 관련 부트스트랩 데이터 채널 연결 요청을 위한 부 트스트랩 DC SDP offer를 생성 및 전달 시 해당 SDP offer 내에 3gpp-qos-hint 속성을 포함하여 100ms의 e2e 서비스 요구사항을 네트워크로 전달할 수 있다. 상기 SDP 정보들을 포함한 SIP INVITE를 수신한 S-CSCF는 SIP INVITE 내에 데이터 채널 서비스 연결 요청을 위한 부트스트랩 데이터 채널 SDP offer를 포함하고 있으면 해당 부트스트랩 관련 SDP offer 내용을 IMS AS로 전달할 수 있다. 이 때, S-CSCF는 전달받은 부트스트랩 관련 SDP offer의 내용을 바탕으로 상기 단말 또는 네트워크가 IMS-DC를 지원하는 지를 체크하여 만약 양측 모두 데이터 채널을 지원한다면 데이터 채널 연결을 위한 부트스트랩 데이터 채널 연결을 위한 정보를 IMS AS로 전달을 결정 할 수 있다. 단계 402에서, S-CSCF로부터 부트스트랩 관련 SDP offer 메시지를 수신한 IMS AS는 해당 UE 또는 가입자가 해당 데이터 채널 서비스를 이용할 수 있는지를 먼저 HSS로부터 확인할 수 있다. 만약 해당 사용자의 유저 프로파일 기반으로 해당 사용자가 데이터 채널을 사용할 수 없을 경우 일반적인 IMS 과정을 통해 데이터 채널의 연결 없 이 MMTel 세션 셋업 동작을 수행할 수 있다. 또한 IMS AS는 만약 해당 사용자가 데이터 채널 기반의 서비스를이용하지 못할 경우 S-CSCF로부터 전달받은 SIP INVITE 메시지내에 DC 관련 미디어 정보를 삭제하여 SIP INVITE 메시지를 업데이트한 뒤 업데이트된 SIP INVITE 메시지를 S-CSCF로 전달할 수 있다. 해당 서비스 사용자가 IMS 데이터 채널 기반의 서비스를 이용할 수 있을 경우 DCSF (Data channel Signaling function)로 데이터 채널 콜 요청을 통해 데이터 채널 부트스트랩핑을 수행할 수 있다. IMS AS는 네트워크 사업자의 로컬 설정 또는 UE로부 터 전달된 정보를 바탕으로 DCSF 인스턴스의 디스커버리와 선택을 NRF로부터 수행하여 DCSF를 선택할 수 있다. 또한 IMS AS는 UE로부터 전달받은 부트스트랩 데이터 채널 관련 SDP offer 내에 latency 관련 QoS 관련 속성 정 보를 포함하고 있으면 해당 서비스의 경우 딜레이 크리티컬 서비스라는 지시자 정보의 생성을 결정할 수 있다. 해당 데이터 채널 서비스의 딜레이 크리티컬 서비스 판단 여부는 5QI의 Delay critical GBR의 PDB 값을 기준으 로 UE에서 요청한 e2e 서비스 요구사항을 비교하여 해당 지시자 생성 및 서비스 요청을 결정할 수 있다. 단계 403에서, IMS AS는 상기 단계 402에서 UE로부터 전달된 정보 또는 네트워크 사업자 정책에 따라 선택된 DCSF로 SessionEstablishmentRequestEvent, Session ID, CallingID, CalledID, SessionCase, Event initiator, MediaInfoList, DC Stream ID, Delay critical service indication 등의 정보를 포함하는 세션 이 벤트 컨트롤 통지 (SessionEventControl_Notify) 메시지를 전달할 수 있다. 단계 404 및 단계 405에서, IMS AS로부터 DC 컨트롤 요청을 받은 DCSF는 DC 컨트롤 요청 메시지내의 관련 파라 미터를 바탕으로 어떻게 부트스트랩 데이터 채널을 생성할 것인지 정책 결정을 수행할 수 있다. 또한 DCSF는 UE 가 MF 또는 MRF를 통해 어플리케이션 다운로딩을 할 수 있도록 MDC1 미디어 정보를 결정할 수 있다. 단계 406에서, DCSF는 상기 결정 정보를 바탕으로 SessionID, MediaInstructionSet 등의 정보를 포함하는 MediaControl_MediaInstruction 메시지를 IMS-AS로 전달할 수 있다. DCSF는 MDC1 미디어 엔드포인트 주소, DC stream ID, MDC1 인터페이스에서 전달되는 어플리케이션 리스트의 URL의 대체 정보 등을 MediaInstructionSet 내 포함하여 IMS-AS로 전달할 수 있다. 이를 바탕으로 DCSF는 IMS-AS에게 originating 과 terminating 측에서 MF를 이용한 부트스트랩 데이터 채널을 어떻게 생성할 수 있을지 정책을 제공할 수 있다. 단계 407에서, IMS AS는 딜레이 크리티컬 서비스를 지원하기 위하여 MF 또는 enhanced MRF의 딜레이가 최소화 되는 MF 또는 enhanced MRF의 선택을 결정할 수 있다. 이를 위하여 IMS AS는 UE로부터 SDP offer내 QoS 속성 정보를 통해 전달받은 e2e 서비스 요구사항 및 NWDAF 또는 AF (DC AS)로부터 전달받은 CN (Core network)의 통 계적 PDB 정보를 바탕으로 MF 또는 enhanced MRF의 디스커버리 및 선택 시 전달할 N6 딜레이 요구사항 (Required N6 delay or N6 delay requirement)을 계산할 수 있다. 예를 들어, UE로부터 부트스트랩 데이터 채 널 관련 SDP offer를 통해 전달된 서비스 latency 요구사항이 30ms이며, 현재 네트워크의 딜레이 정보가 20ms이 면, 상기 정보들을 바탕으로 IMS AS는 해당 데이터 채널 기반 어플리케이션 관련 최대 허용 가능한 N6 딜레이 값은 10ms로 계산할 수 있다. 해당 정보를 N6 delay requirement로 NRF에 전달하여 만약 해당 요구사항을 만족 하는 MF가 여러가지가 나올 경우 최소의 N6 delay를 가지는 MF를 우선순위로 선택할 수 있다. 만약 단순 N6 delay 요구사항 이외에 MF의 프로세싱 파워 또는 고려할 다양한 다른 조건들이 있을 경우 해당 요구사항을 만족 하는 MF들의 리스트를 IMS AS로 전달하여 IMS AS에서 사용자의 프로파일 등을 참조하여 적절한 MF의 선택을 수 행할 수 있다. 단계 408에서, IMS AS는 단계 407을 통해 계산된 N6 딜레이 요구사항 포함하는 MF 프로파일 정보를 바탕으로 DC 미디어 기능을 지원하는 MF 인스턴스 또는 enhanced MRF의 디스커버리 및 선택을 위한 NF 디스커버리 요청 (NFDiscoery_Request) 메시지를 NRF로 전달할 수 있다. 단계 409에서, NRF는 IMS AS에서 MF 선택을 위하여 전달된 NF 디스커버리 요청 메시지 내의 MF 프로파일 정보를 바탕으로 적절한 MF를 선택할 수 있다. 이 때, 본 발명의 실시예와 같이 딜레이 크리티컬 서비스를 지원하기 위 하여 N6 딜레이 요구사항 정보가 포함되어 있을 경우 해당 정보를 우선순위로 두고 적절한 MF를 선택할 수 있다. MF 등록 시 사전에 관련 해당 MF와 UPF사이의 N6 딜레이 정보를 측정 및 이를 포함하여 해당 MF의 NRF 등 록을 수행하였다고 가정할 수 있다. 이 때, N6 딜레이 요구사항을 바탕으로 적절한 MF를 찾는데 실패하였을 경 우 해당 정보를 IMS AS로 전달할 수 있다. 단계 410에서, NRF는 해당 N6 딜레이 요구사항을 만족하는 MF가 없을 경우 응답 에러 코드 (Response Error code) 488 및 요구하는 N6 딜레이 요구사항을 만족하는 MF가 발견되지 않음 등의 상세 원인 정보 (Cause information) 정보를 NF 디스커버리 요청 응답 (NFDiscovery_Request Response) 메시지를 통해 IMS AS로 전달 할 수 있다. 단계 411에서, IMS AS는 상기 MF 선택을 위한 동작 과정에서 NRF에서 수신한 오류 코드 및 상세 정보를 DCSF로 전달할 수 있다. 단계 412에서, DCSF는 해당 부트스트랩 데이터 채널 연결 동작이 UE의 요구사항에 따라 수행하지 못함을 결정하 고 IMS AS로부터 전달받은 응답 에러 코드 (Response Error code) 488 및 요구하는 N6 딜레이 요구사항을 만족 하는 MF가 발견되지 않음 등의 상세 원인 정보 (Cause information) 정보를 포함하는 세션 이벤트 컨트롤 통지 (SessionEventControl_Notify) 응답 메시지를 IMS AS로 전달할 수 있다. 단계 413에서, IMS AS는 DCSF로부터 전달받은 데이터 채널 이벤트 관련 정보를 바탕으로 SDP 응답 메시지를 통 해 UE의 요구사항을 바탕으로 부트스트랩 데이터 채널 연결이 실패하였음을 UE로 전달할 수 있다. 단계 414에서, 단말은 업데이트된 latency 관련 QoS 요구사항을 포함하는 SDP offer를 SIP reINVITE내에 포함 하여 IMS AS로 전달할 수 있다. 단계 415에서, IMS AS는 업데이트된 정보를 바탕으로 부트스트랩 데이터 채널 요청을 DCSF로 전달할 수 있다. 이때 세션 이벤트 컨트롤 통지 메시지 내에는 딜레이 크리니컬 서비스 지시자 정보가 포함될 수 있다. 단계 416 및 단계 417에서, IMS AS로부터 DC 컨트롤 요청을 받은 DCSF는 DC 컨트롤 요청 메시지 내의 관련 파라 미터를 바탕으로 어떻게 부트스트랩 데이터 채널을 생성할 것인지 정책 결정을 수행할 수 있다. 단계 418에서, DCSF는 상기 결정 정보를 바탕으로 SessionID, MediaInstructionSet 등의 정보를 포함하는 MediaControl_MediaInstruction 메시지를 IMS AS로 전달할 수 있다. 단계 419에서, IMS AS는 단계 414에서 UE로부터 다시 전달받은 업데이트된 SDP offer 내 QoS 속성 정보를 통해 전달받은 업데이트된 e2e 서비스 요구사항 및 NWDAF 또는 AF (DC AS)로부터 전달받은 CN (Core network)의 통 계적 PDB 정보를 바탕으로 MF 또는 enhanced MRF의 디스커버리 및 선택 시 전달할 업데이트된 N6 딜레이 요구사 항 (Required N6 delay or N6 delay requirement)을 계산할 수 있다. 단계 420에서, IMS AS는 단계 419을 통해 계산된 업데이트된 N6 딜레이 요구사항 포함하는 MF 프로파일 정보를 바탕으로 DC 미디어 기능을 지원하는 MF 인스턴스 또는 enhanced MRF의 디스커버리 및 선택을 위한 NF 디스커버 리 요청 (NFDiscoery_Request) 메시지를 NRF로 전달할 수 있다. 단계 421에서, NRF는 IMS AS에서 MF 선택을 위하여 전달된 NF 디스커버리 요청 메시지 내의 MF 프로파일 정보를 바탕으로 적절한 MF를 선택할 수 있다. 이 때, 본 발명의 실시예와 같이 딜레이 크리티컬 서비스를 지원하기 위 하여 N6 딜레이 요구사항 정보가 포함되어 있을 경우 해당 정보를 우선순위로 두고 적절한 MF를 선택할 수 있다. MF 등록 시 사전에 관련 해당 MF와 UPF사이의 N6 딜레이 정보를 측정 및 이를 포함하여 해당 MF의 NRF 등 록을 수행하였다고 가정할 수 있다. 단계 422에서, NRF는 해당 N6 딜레이 요구사항을 만족하는 MF를 선택하여 해당 정보를 IMS AS로 NF 디스커버리 요청 응답 (NFDiscovery_Request Response) 메시지를 통해 전달할 수 있다. 단계 423에서, IMS AS는 Media Termination Descriptor들의 리스트를 상기 과정에서 선택된 MF에 Nmf_MRM_Create 메시지를 통해 전달할 수 있다. 일 실시예로, IMS AS는 서로 다른 두개의 Media Termination의 생성을 요청할 수 있다. 한 Media Termination 정보는 로컬 부트스트랩 미디어 관련 정보이고, 다른 하나는 리 모트 UE에게 제공하기 위한 리모트 부트스트랩 미디어 관련 정보를 나타낼 수 있다. 각각의 Media Termination 은 Mb 와 MDC1 인터페이스의 리소스 할당 요구 정보를 포함할 수 있다. MF는 해당 데이터 채널 미디어 리소스 정보의 협상의 결과를 IMS AS로 전달할 수 있다. 단계 424에서, IMS AS는 MF로부터 데이터 채널 미디어 리소스 할당 결과를 수신한 뒤 IMS AS는 DCSF로부터 MediaInstruction 요청에 대한 응답을 전달할 수 있다. 해당 응답 메시지내에는 상기 동작의 결과 정보와 MDC1 데이터 채널 미디어 리소스 정보 협상 정보를 포함할 수 있다. 단계 425에서, DCSF는 IMS AS로부터 전달받은 MediaInstruction 요청에 대한 응답 메시지내의 미디어 리소스 정 보를 저장하고 IMS AS로부터 데이터 채널 연결 통지(SessionEventControl_Notify) 요청 관련 응답 메시지를 IMS AS로 전달할 수 있다. 단계 426에서, IMS AS는 MF 또는 enhanced MRF의 미디어 정보를 추가한 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 S-CSCF로 전송할 수 있다. 단계 427에서, S-CSCF는 전달받은 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 리모트 네트워크 및 UE#2로 전달할 수 있다. 단계 428에서, 단계 427에서 전달받은 업데이트된 SDP offer 정보를 바탕으로 부트스트랩 데이터 채널 연결을 위한 terminating 단말의 협상 과정을 originating과 유사하게 수행할 수 있다. 단계 429에서, UE#2와 terminating 네트워크는 부트스트랩 데이터 채널 관련 업데이트 또는 변경 관련 요구사항 이 있을 경우 SDP 응답을 18X 응답 메시지에 포함하여 originating 네트워크에 전달할 수 있다. 수신한 SDP 응 답 메시지에 따라 MF 또는 enhanced MRF는 UE#2 관련 데이터 채널 미디어 리소스 정보를 업데이트 할 수 있다. 단계 430에서, 별도의 변경 사항이 없을 경우 UE#2와 terminating 네트워크는 200 OK 응답 메세지를 originating 네트워크의 S-CSCF로 전송할 수 있다. 단계 431에서, 200 OK 응답 메시지를 수신한 S-CSCF는 이를 IMS AS로 전달할 수 있다. 단계 432에서, 상기 단계 431로부터 200 OK 메시지를 수신한 IMS AS는 SessionEstablishmentSuccessEvent, SessionID, MediaInfoList 등의 정보를 포함하는 세션 이벤트 컨트롤 통지 (SessionEventControl_Notify) 메시 지를 DCSF로 전달하여 성공적인 세션 연결 관련 이벤트 정보를 알려줄 수 있다. 단계 433 및 단계 434에서, DCSF로부터 해당 성공적인 세션 연결 이벤트 통지에 대한 응답 메시지를 수신한 IMS AS는 UE#1에게 부트스트랩 데이터 채널이 연결되었음을 나타내는 200 OK 메시지를 전달할 수 있다. 단계 435 및 단계 436에서, UE#1와 UE#2 및 originating MF 또는 enhanced MRF 사이에 부트스트랩 데이터 채널 연결을 할 수 있다. 이후 UE#1 및 UE#2는 MF 또는 enhanced MRF에게 어플리케이션 요청 메시지를 전달하여 데이 터 채널 어플리케이션을 요청할 수 있다. 만약 멀티 DC 어플리케이션이 지원한다면 application list를 요청할 수 있다. MF 또는 MRF는 DCSF로부터 수신한 대체 URL (replacement URL) 정보를 바탕으로 루트 URL을 Application 관련 URL 정보로 변경할 수 있다. 이후 MF는 UE로부터 전달받은 해당 어플리케이션 요청 메시지를 DCSF로 전달할 수 있다. DCSF는 UE의 데이터 채널 처리 능력 및 선택에 따라 어플리케이션 리스트 또는 적절한 데이터 어플리케이션들을 UE#1 및 UE#2에 제공할 수 있다. 단계 437 및 단계 438은, MF의 위치에 따라 terminating MF 또는 MRF를 사용한 부트스트랩 데이터 채널을 연결 할 경우 상기 UE#1 및 UE#2의 데이터 채널 어플리케이션 요청 과정을 terminating DCSF를 통해 수행하고 적절한 데이터 채널 어플리케이션을 다운로드 할 수 있다. 도 5a, 5b, 및 5c는 본 개시의 일 실시 예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server)에서 N6 딜레이 요구사항 정보를 바탕으로 우선순위 기반의 MF(media function) 엔터티 리 스트를 전달받아 이를 상대 네트워크 또는 UE에 전달하여 적절한 MF(media function) 선택 및 해당 MF(media function) 기반의 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 도 5a, 5b, 및 5c는 본 개시의 일 실시 예에 따른 UE에서 latency 관련 서비스 요구사항을 전달하여 해당 latency 요구사항을 바탕으로 데이터 채널 서비스를 이용하기 위한 단말 간의 요구사항에 따른 MF의 선택 및 연 결을 지원하기 위한 정보를 전달하는 방법을 설명하기 위한 순서도이다. 즉, 도 5는 본 개시의 일 실시 예에 따른 UE에서 IMS-DC 서비스 연결 요청 시 서비스 요청 메시지 (SDP offer) 내에 서비스 요구사항 정보를 함께 포함하여 전송하고, IMS-AS에서 N6 딜레이 요구사항 정보를 바탕으로 우선순 위 기반의 MF 엔터티 리스트를 전달받아 이를 상대 네트워크 또는 UE에 전달하여 적절한 MF 선택 및 해당 MF 기 반의 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 단계 501에서, 단말은 P-CSCF 및 S-SCSF 등 기존의 CSCF에 SIP INVITE 메시지를 전송할 수 있다. 상기 SIP INVITE 메시지내에는 미디어 관련 파라미터 및 QoS 관련 요구사항 정보를 SDP 내 포함하여 함께 네트워크로 전 달할 수 있다. 추가적으로 IMS 데이터 채널 서비스를 이용하기 위하여 부트스트랩 정보를 포함하는 SDP offer를 함께 포함하여 전달할 수 있다. 이 때, 부트스트랩 데이터 채널 관련 SDP offer 내에 서비스 관련 특정 QoS 요 구사항 정보 ('loss' or 'latency')를 SDP 속성(Attribute) 정보 내에 포함하여 함께 전달할 수 있다. 예를 들 어, UE가 3D 아바타 콜 등을 데이터 채널을 통한 어플리케이션에 수행하기 위해서는 최소 e2e latency를 100ms 로 가정할 수 있다. 이를 바탕으로 UE가 데이터 채널 관련 부트스트랩 데이터 채널 연결 요청을 위한 부트스트 랩 DC SDP offer를 생성 및 전달 시 해당 SDP offer 내에 3gpp-qos-hint 속성을 포함하여 100ms의 e2e 서비스 요구사항을 네트워크로 전달할 수 있다. 상기 SDP 정보들을 포함한 SIP INVITE를 수신한 S-CSCF는 SIP INVITE내에 데이터 채널 서비스 연결 요청을 위한 부트스트랩 데이터 채널 SDP offer를 포함하고 있으면 해당 부트스 트랩 관련 SDP offer 내용을 IMS AS로 전달할 수 있다. 이 때, S-CSCF는 전달받은 부트스트랩 관련 SDP offer 의 내용을 바탕으로 상기 단말 또는 네트워크가 IMS-DC를 지원하는 지를 체크하여 만약 양측 모두 데이터 채널 을 지원한다면 데이터 채널 연결을 위한 부트스트랩 데이터 채널 연결을 위한 정보를 IMS AS로 전달을 결정할 수 있다. 단계 502에서, S-CSCF로부터 부트스트랩 관련 SDP offer 메시지를 수신한 IMS AS는 해당 UE 또는 가입자가 해당 데이터 채널 서비스를 이용할 수 있는지를 먼저 HSS로부터 확인할 수 있다. 만약 해당 사용자의 유저 프로파일 기반으로 해당 사용자가 데이터 채널을 사용할 수 없을 경우 일반적인 IMS 과정을 통해 데이터 채널의 연결 없 이 MMTel 세션 셋업 동작을 수행할 수 있다. 또한 IMS AS는 만약 해당 사용자가 데이터 채널 기반의 서비스를 이용하지 못할 경우 S-CSCF로부터 전달받은 SIP INVITE 메시지내에 DC 관련 미디어 정보를 삭제하여 SIP INVITE 메시지를 업데이트한 뒤 업데이트된 SIP INVITE 메시지를 S-CSCF로 전달할 수 있다. 해당 서비스 사용자가 IMS 데이터 채널 기반의 서비스를 이용할 수 있을 경우 DCSF (Data channel Signaling function)로 데이터 채널 콜 요청을 통해 데이터 채널 부트 스트랩핑을 수행할 수 있다. IMS AS는 네트워크 사업자의 로컬 설정 또는 UE로부 터 전달된 정보를 바탕으로 DCSF 인스턴스의 디스커버리와 선택을 NRF로부터 수행하여 DCSF를 선택할 수 있다. 또한 IMS AS는 UE로부터 전달받은 부트스트랩 데이터 채널 관련 SDP offer 내에 latency 관련 QoS 관련 속성 정 보를 포함하고 있으면 해당 서비스의 경우 딜레이 크리티컬 서비스라는 지시자(delay critical service indication) 정보의 생성을 결정할 수 있다. 해당 데이터 채널 서비스의 딜레이 크리티컬 서비스 판단 여부는 5QI의 Delay critical GBR의 PDB 값을 기준으로 UE에서 요청한 e2e 서비스 요구사항을 비교하여 해당 지시자 생 성 및 서비스 요청을 결정할 수 있다. 단계 503에서, IMS-AS는 상기 단계 502에서 UE로부터 전달된 정보 또는 네트워크 사업자 정책에 따라 선택된 DCSF로 SessionEstablishmentRequestEvent, Session ID, CallingID, CalledID, SessionCase, Event initiator, MediaInfoList, DC Stream ID, Delay critical service indication 등의 정보를 포함하는 세션 이 벤트 컨트롤 통지 (SessionEventControl_Notify) 메시지를 전달할 수 있다. 단계 504 및 단계 505에서, IMS-AS로부터 DC 컨트롤 요청을 받은 DCSF는 DC 컨트롤 요청 메시지 내의 관련 파라 미터를 바탕으로 어떻게 부트스트랩 데이터 채널을 생성할 것인지 정책 결정을 수행할 수 있다. 또한 DCSF는 UE 가 MF 또는 MRF를 통해 어플리케이션 다운로딩을 할 수 있도록 MDC1 미디어 정보를 결정할 수 있다. 단계 506에서, DCSF는 상기 결정 정보를 바탕으로 SessionID, MediaInstructionSet 등의 정보를 포함하는 MediaControl_MediaInstruction 메시지를 IMS-AS로 전달할 수 있다. DCSF는 MDC1 미디어 엔드 포인트 주소, DC stream ID, MDC1 인터페이스에서 전달되는 어플리케이션 리스트의 URL의 대체 정보 등을 MediaInstructionSet 내 포함하여 IMS-AS로 전달할 수 있다. 이를 바탕으로 DCSF는 IMS-AS에게 originating 과 terminating 측에서 MF를 이용한 부트스트랩 데이터 채널을 어떻게 생성할 수 있을지 정책을 제공할 수 있다. 단계 507에서, IMS AS는 딜레이 크리티컬 서비스를 지원하기 위하여 MF 또는 enhanced MRF의 딜레이가 최소화되 는 MF 또는 enhanced MRF의 선택을 결정할 수 있다. 이를 위하여 IMS AS는 UE로부터 SDP offer내 QoS 속성 정 보를 통해 전달받은 e2e 서비스 요구사항 및 NWDAF 또는 AF (DC AS)로부터 전달받은 CN (Core network)의 통계 적 PDB 정보를 바탕으로 MF 또는 enhanced MRF의 디스커버리 및 선택 시 전달할 N6 딜레이 요구사항 (Required N6 delay or N6 delay requirement)을 계산할 수 있다. 단계 508에서, IMS AS는 단계 507을 통해 계산된 N6 딜레이 요구사항 포함하는 MF 프로파일 정보를 바탕으로 DC 미디어 기능을 지원하는 MF 인스턴스 또는 enhanced MRF의 디스커버리 및 선택을 위한 NF 디스커버리 요청 (NFDiscoery_Request) 메시지를 NRF로 전달할 수 있다. 단계 509에서, NRF는 IMS AS에서 MF 선택을 위하여 전달된 NF 디스커버리 요청 메시지 내의 MF 프로파일 정보를 바탕으로 적절한 MF를 선택할 수 있다. 이 때, 본 발명의 실시예 와 같이 딜레이 크리티컬 서비스를 지원하기 위하여 N6 딜레이 요구사항 정보가 포함되어 있을 경우 해당 정보를 우선순위로 두고 적절한 MF를 선택할 수 있 다. MF 등록 시 사전에 관련 해당 MF와 UPF사이의 N6 딜레이 정보를 측정 및 이를 포함하여 해당 MF의 NRF 등록 을 수행하였다고 가정할 수 있다. 만약 하나 이상의 MF가 MF 프로파일을 만족하게 된다면 NRF는 해당 정보를 리 스트 형태로 생성하여 IMS AS로 제공할 수 있다. 또한 만약 NRF에서 해당 부트스트랩 데이터 채널 어플리케이션 생성을 위한 UE #1 (Originating UE)의 요구사항을 만족하는 MF들이 다수개의 경우 NRF는 해당 MF들의 MF 프로 파일을 추가적으로 제공함으로서 해당 MF 후보 리스트를 수신한 IMS AS 또는 UE #2 (Terminating UE)에서 네트 워크 정책 또는 UE#2의 네트워크 상황에 따라 적절한 MF를 선택할 수 있도록 정보를 함께 전송할 수 있다. 만약NRF에서 UE#1의 요구사항을 바탕으로 MF를 한 개 선택할 경우 해당 정보를 UE#2로 전송하여 해당 정보를 바탕으 로 부트스트랩 데이터 채널을 연결 시 실제 네트워크 상황 등 UE#2의 서비스 요구사항을 고려하였을 때 전체 e2e 서비스 요구사항을 만족하지 않을 수 있다. 단계 510에서, NRF는 해당 N6 딜레이 요구사항을 만족하는 MF들의 리스트(candidate MF lists)를 작성하여 해당 정보를 IMS AS로 NF 디스커버리 요청 응답 (NFDiscovery_Request Response) 메시지를 통해 전달할 수 있다. 단계 511에서, IMS AS는 Media Termination Descriptor들의 리스트를 상기 과정에서 선택된 MF 리스트 내의 MF 들에게 Nmf_MRM_Create Request 메시지를 통해 전달할 수 있다. IMS AS는 각 MF 별로 서로 다른 두개의 Media Termination의 생성을 요청할 수 있다. 한 Media Termination 정보는 로컬 부트스트랩 미디어 관련 정보이고, 다른 하나는 리모트 UE에게 제공하기 위한 리모트 부트스트랩 미디어 관련 정보를 나타낼 수 있다. 각각의 Media Termination 은 Mb 와 MDC1 인터페이스의 리소스 할당 요구 정보를 포함할 수 있다. MF는 해당 데이터 채 널 미디어 리소스 정보의 협상의 결과를 IMS AS로 전달할 수 있다. 단계 512에서, IMS AS는 MF로부터 데이터 채널 미디어 리소스 할당 결과를 수신한 뒤 IMS AS는 DCSF에게 MediaInstruction 요청에 대한 응답을 전달할 수 있다. 해당 응답 메시지 내에는 상기 동작의 결과 정보와 MDC1 데이터 채널 미디어 리소스 정보 협상 정보를 포함할 수 있다. 단계 513에서, DCSF는 IMS AS로부터 전달받은 MediaInstruction 요청에 대한 응답 메시지 내의 미디어 리소스 정보를 저장하고 IMS AS로부터 데이터 채널 연결 통지(SessionEventControl_Notify) 요청 관련 응답 메시지를 IMS AS로 전달할 수 있다. 단계 514에서, IMS AS는 MF 후보 리스트 및 관련 정보들을 포함하는 MF 또는 enhanced MRF의 미디어 정보를 추 가한 업데이트된 SDP offer를 SIP INVITE 메시지 내에 포함하여 S-CSCF로 전송할 수 있다. 단계 515에서, S-CSCF는 전달받은 업데이트된 SDP offer를 포함한 SIP INVITE 메시지를 리모트 네트워크 (Terminating network) 및 UE#2로 전달할 수 있다. 단계 516에서, 단계 515에서 전달받은 업데이트된 SDP offer 정보를 바탕으로 부트스트랩 데이터 채널 연결을 위한 terminating 단말의 협상 과정을 originating과 유사하게 수행할 수 있다. 이 때, 리모트 네트워크 (Terminating network) 및 UE#2는 수신된 MF 후보 리스트 및 관련 정보를 바탕으로 적절한 MF를 선택할 수 있다. 단계 517에서, UE#2와 terminating 네트워크는 부트스트랩 데이터 채널 관련 업데이트 또는 변경 관련 요구사항 이 있을 경우 SDP 응답을 18X 응답 메시지에 포함하여 originating 네트워크에 전달할 수 있다. UE#2와 terminating 네트워크를 고려하여 선택된 MF 또는 MF 리스트들 (accepted MF/MF list)을 SDP 응답 메시지를 통 해 Originating S-SCCF로 전송할 수 있다. 수신한 SDP 응답 메시지에 따라 MF 또는 enhanced MRF는 UE#2 관련 데이터 채널 미디어 리소스 정보를 업데이트 할 수 있다. 단계 518에서, Originating S-SCSF는 Terminating 네트워크로부터 수신한 SDP 응답 메시지 내의 UE#2와 terminating 네트워크를 고려하여 선택된 MF 또는 MF 리스트들을 IMS AS로 전달할 수 있다. 단계 519에서, Originating IMS AS는 Terminating 네트워크로부터 전달받은 SDP 응답 메시지 내 Terminating 네트워크 또는 UE#2에서 선택된 MF 또는 MF 리스트들을 고려하여 최종적으로 MF 또는 enhanced MRF를 선택할 수 있다. 단계 520에서, IMS AS는 선택된 MF외의 다른 MF들의 미디어 리소스의 업데이트 또는 삭제를 위하여 MRM_Update 또는 MRM_Delete 요청 메시지를 통해 각 MF들로 전달할 수 있다. 단계 521에서, 최종 선택된 MF로부터 데이터 채널 미디어 리소스 할당 결과를 수신한 IMS AS는 DCSF로부터 MediaInstruction 요청에 대한 응답을 전달할 수 있다. 해당 응답 메시지내에는 상기 동작의 결과 정보와 최종 선택된 MF의 MDC1 데이터 채널 미디어 리소스 정보 협상 정보를 포함할 수 있다. 단계 522에서, DCSF는 IMS AS로부터 전달받은 MediaInstruction 요청에 대한 응답 메시지내의 최종 선택된 MF 관련 미디어 리소스 정보를 저장하고 IMS AS로부터 데이터 채널 연결 통지(SessionEventControl_Notify) 요청 메시지 관련 응답 메시지를 IMS AS로 전달할 수 있다. 단계 523에서, IMS AS는 최종 선택된 MF 또는 enhanced MRF의 미디어 정보를 추가한 업데이트된 SDP offer를 포함한 SIP reINVITE 메시지를 S-CSCF로 전송할 수 있다. 단계 524에서, S-CSCF는 전달받은 업데이트된 SDP offer를 포함한 SIP reINVITE 메시지를 terminating 네트워 크 및 UE#2로 전달할 수 있다. 단계 525에서, 단계 524에서 전달받은 업데이트된 SDP offer 정보를 바탕으로 terminating 단말의 부트스트랩 데이터 채널 연결을 위한 정보 업데이트 과정을 수행할 수 있다. 단계 526에서, UE#2와 terminating 네트워크는 200 OK 응답 메세지를 originating 네트워크의 S-CSCF로 전송할 수 있다. 단계 527에서, 200 OK 응답 메시지를 수신한 S-CSCF는 이를 IMS AS로 전달할 수 있다. 단계 528에서, 상기 단계 527로부터 200 OK 메시지를 수신한 IMS AS는 SessionEstablishmentSuccessEvent, SessionID, MediaInfoList 등의 정보를 포함하는 세션 이벤트 컨트롤 통지 (SessionEventControl_Notify) 메시 지를 DCSF로 전달하여 성공적인 세션 연결 관련 이벤트 정보를 알려줄 수 있다. 단계 529 및 단계 530에서, DCSF로부터 해당 성공적인 세션 연결 이벤트 통지에 대한 응답 메시지를 수신한 IMS AS는 UE#1 (Originating UE) 에게 부트스트랩 데이터 채널이 연결되었음을 나타내는 200 OK 메시지를 전달할 수 있다. 단계 531 및 단계 532에서, UE#1와 UE#2 및 originating MF 또는 enhanced MRF 사이에 부트스트랩 데이터 채널 연결을 할 수 있다. 이후 UE#1 및 UE#2는 MF 또는 enhanced MRF에게 어플리케이션 요청 메시지를 전달하여 데이 터 채널 어플리케이션을 요청할 수 있다. 만약 멀티 DC 어플리케이션이 지원한다면 application list를 요청할 수 있다. MF 또는 MRF는 DCSF로부터 수신한 대체 URL (replacement URL) 정보를 바탕으로 루트 URL을 Application 관련 URL 정보로 변경할 수 있다. 이후 MF는 UE로부터 전달받은 해당 어플리케이션 요청 메시지를 DCSF로 전달할 수 있다. DCSF는 UE의 데이터 채널 처리 능력 및 선택에 따라 어플리케이션 리스트 또는 적절한 데이터 어플리케이션들을 UE#1 및 UE#2에 제공할 수 있다. 단계 533 및 단계 534은, MF의 위치에 따라 terminating MF 또는 MRF를 사용한 부트스트랩 데이터 채널을 연결 할 경우 상기 UE#1 및 UE#2의 데이터 채널 어플리케이션 요청 과정을 terminating DCSF를 통해 수행하고 적절한 데이터 채널 어플리케이션을 다운로드 할 수 있다. 도 6은 본 개시의 일 실시예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티의 구조를 도시한 도면이다. 본 개시의 일 실시예에 따른 IMS AS 엔티티는 IMS AS 엔티티의 전반적인 동작을 제어하는 프로세서, 송신 부 및 수신부를 포함하는 송수신부 및 메모리를 포함할 수 있다. 물론 상기 예시에 제한되는 것은 아 니며 IMS AS 엔티티는 도 6에 도시된 구성보다 더 많은 구성을 포함할 수도 있고, 더 적은 구성을 포함할 수도 있다. 본 개시의 일 실시예에 따르면, 송수신부는 네트워크 엔티티(Network Entity)들 또는 다른 네트워크 노드 와 신호를 송수신할 수 있다. 네트워크 엔티티와 송수신하는 신호는 제어 정보와 데이터를 포함할 수 있다. 또 한 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 실시 예들 중 어느 하나의 동작을 수행하도록 IMS AS 엔티티를 제어할 수 있다. 한편, 프로세서, 메모리, 및 송수신부는 반드시 별도의 모듈들로 구 현되어야 하는 것은 아니고, 단일 칩과 같은 형태로 하나의 구성부로 구현될 수 있음은 물론이다. 그리고, 프로 세서 및 송수신부는 전기적으로 연결될 수 있다. 또한 프로세서는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플리케이션 특정(application-specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 서비스의 요구 정보에 기반하여 N6 딜레이 요구 정보를 계산할 수 있다. 일 실시예로, 프로세서는 NRF(network repository function) 엔티티로 상기 N6 딜레이 요구 정 보를 포함하여 MF(media function) 엔티티 발견을 위한 요청 메시지를 전송하는 것을 제어할 수 있다. 일 실시 예로, 프로세서는 상기 NRF 엔티티로부터 상기 딜레이 요구 정보에 기반하여 선택된 MF 엔티티에 관련된 정보를 포함하는 응답 메시지를 수신하도록 제어할 수 있다. 일 실시예로, 상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함할 수 있다. 일 실시예로, 프로세서는 상기 QoS 요 구 정보에 기반하여 제공되는 서비스가 딜레이 크리티컬 서비스인지 여부를 결정할 수 있다. 프로세서는 상기 제공되는 서비스가 딜레이 크리티컬 서비스인 경우, 딜레이 크리티컬 서비스에 대한 지시자를 생성할 수 있다. 프로세서는 DCSF(data channel signaling function) 엔티티에게 상기 딜레이 크리티컬 서비스에 대 한 지시자를 포함한 세션 이벤트 컨트롤 통지 메시지를 전송하는 것을 제어할 수 있다. 일 실시예로, 상기 서비스의 요구 정보는 DCSF로부터 수신된 서비스 지연(latency) 관련 정보 또는 딜레이 크리 티컬 서비스에 대한 지시자 중 적어도 하나를 포함할 수 있다. 도 7은 본 개시의 일 실시예에 따른 NRF(network repository function)의 구조를 도시한 도면이다. 도 7은 본 개시의 일 실시예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티의 구조를 도시한 도면이다. 본 개시의 일 실시예에 따른 IMS AS 엔티티는 IMS AS 엔티티의 전반적인 동작을 제어하는 프로세서, 송신 부 및 수신부를 포함하는 송수신부 및 메모리를 포함할 수 있다. 물론 상기 예시에 제한되는 것은 아 니며 IMS AS 엔티티는 도 7에 도시된 구성보다 더 많은 구성을 포함할 수도 있고, 더 적은 구성을 포함할 수도 있다. 본 개시의 일 실시예에 따르면, 송수신부는 네트워크 엔티티(Network Entity)들 또는 다른 네트워크 노드 와 신호를 송수신할 수 있다. 네트워크 엔티티와 송수신하는 신호는 제어 정보와 데이터를 포함할 수 있다. 또 한 송수신부는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서로부터 출력된 신호를 무선 채널을 통해 전송할 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 상술한 실시 예들 중 어느 하나의 동작을 수행하도록 IMS AS 엔티티를 제어할 수 있다. 한편, 프로세서, 메모리, 및 송수신부는 반드시 별도의 모듈들로 구 현되어야 하는 것은 아니고, 단일 칩과 같은 형태로 하나의 구성부로 구현될 수 있음은 물론이다. 그리고, 프로 세서 및 송수신부는 전기적으로 연결될 수 있다. 또한 프로세서는 AP(Application Processor), CP(Communication Processor), 회로(circuit), 어플리케이션 특정(application-specific) 회로, 또는 적어도 하나의 프로세서(processor)일 수 있다. 본 개시의 일 실시예에 따르면, 프로세서는 IMS AS(IP(internet protocol) multimedia subsystem application server) 엔티티로부터 N6 딜레이 요구 정보를 포함한 MF(media function) 발견을 위한 요청 메시 지를 수신하는 것을 제어할 수 있다. 프로세서는 상기 IMS AS엔티티에게 상기 N6 딜레이 요구 정보에 기반 하여 선택된 MF에 관련된 정보를 포함하는 응답 메시지를 전송하는 것을 제어할 수 있다. 일 실시예로, 상기 N6 딜레이 요구 정보는 서비스 요구 정보에 의해 계산될 수 있다. 일 실시예로, 상기 서비스의 요구 정보는 단말로부터 수신된 QoS(quality of service) 요구 정보를 포함할 수 있다. 일 실시예로, 상기 서비스의 요구 정보는 DCSF(data channel signaling function)로부터 수신된 서비스 지연(latency) 관련 정보 또는 딜레이 크리티컬 서비스에 대한 지시자 중 적어도 하나를 포함하는 것을 특징으 로 하는 방법. 본 개시의 일 실시예에 따르면, IMS 기반의 통신 시스템에서 IMS AS (IMS Application Server)에 의해 수행되 는 방법이 개시될 수 있다. 상기 IMS AS의 방법은, S-CSCF (Serving Call Session Control Function)으로 부터, 적어도 하나의 미디어 타입을 지시하는 정보 및 상기 적어도 하나의 미디어 파라미터 정보, 적어도 하나 의 QoS 관련 파라미터 정보를 포함하는 SDP(session description protocol) 제안(offer) 메시지내 데이터 채널 서비스 연결을 위한 정보를 수신하는 동작을 포함할 수 있다. 상기 발신 단말의 미디어 콜 서비스를 수행하는 방법은, 상기 SDP 제안 메시지를 바탕으로 IMS AS에서 해당 서비스 사용자의 데이터 채널 사용 여부를 HSS를 통 해 확인하고, 상기 적어도 하나의 데이터 채널 관련 파라 미터 정보를 세션이벤트컨트롤 통보 (SessionEventControl_Notify) 메시지를 DCSF (Data channel signaling function)으로 송신하는 동작을 포함할 수 있다. 상기 세션 이벤트 컨트롤 통보 메시지 내에는 단말에서 전달된 적어도 QoS 관련 파라미터 정보를 바탕 으로 해당 정보가 latency 관련 정보를 포함하며 해당 latency 정보가 일정 수준 이하의 latency를 요구할 경우 IMS AS는 상기 통보 메시지 내에 딜레이 크리티컬 서비스 지시자 (Delay critical service indication) 정보를포함할 수 있다. 상기 데이터 채널 부트스트랩 셋업 시그널링 과정을 수행하는 방법은, 상기 세션이벤트컨트롤 통보(SessionEventControl_Notify) 메시지에 포함된 상기 데이터 채널 서비스 관련 정보에 기반하여, 상기 적어 도 하나의 해당 데이터 채널 서비스 지원하는 어플리케이션의 미디어 기능 엔터티의 정보 및 어플리케이션 관련 정보 등 데이터 채널 정책을 생성하는 동작을 포함할 수 있다. 본 개시의 일 실시예에 따르면, IMS AS는 상기 DCSF 로부터 해당 데이터 채널 기반의 어플리케이션 관련 미디어 기능 엔터티 관련 정보를 수신한 뒤 적절한 미디어 기능 엔터티의 디스커버리 및 선택 (Discovery & Selectio n)을 위하여 NRF (Network Repository Function)으로 MF 프로파일 정보를 전송할 수 있다. 상기 적절한 MF 기 능 엔터티 요청을 위한 MF 프로파일 정보내에는 기본적으로 NF의 디스커버리를 위한 IP 주소 및 UE 위치 정보를 포함할 수 있다. 만약, 실시간 성을 요구하는 IMS 서비스의 특성에 따라 e2e 서비스 레이턴시 정보가 UE 또는 DC-AS로부터 네트워크로 전달되었을 경우 해당 서비스 요구사항을 지원하기 위하여 IMS AS는 MF 프로파일 정보 내에 UPF 와 MF 사이의 N6 구간의 요구사항을 추가로 전달할 수 있다. 이를 위해 IMS AS는 UE 또는 DC-AS로부터 전달된 e2e 서비스 레이턴시 및 실시간 CN (Core Network)의 딜레이를 측정하여 실시간 서비스를 위해 요구되는 N6 딜레이 요구사항 (Requested N6 delay requirement or N6 delay requirement)를 계산하여 이를 MF 프로파일 내에 포함하여 NRF로 전달할 수 있다. 본 개시의 일 실시예에 따르면, MF는 서비스 요구사항에 따라 실시간성을 요구하는 IMS 서비스를 지원하기 위하 여 NRF에 NF 등록 (NF Registration) 과정 중 N6 요구사항을 포함하는 MF 프로파일 정보를 바탕으로 네트워크 기능 엔터티를 등록을 수행할 수 있다. 본 개시의 일 실시예에 따르면, IMS AS는 MF 선택을 위한 정보를 요청한 뒤 수신한 MF 또는 MF 리스트를 바탕으 로 MF를 선택 및 선택된 MF로 미디어 리소스 관리 (Media Resource Management) 관련 정보를 전송할 수 있다. 본 개시의 일 실시예에 따르면, IMS AS는 선택된 MF의 미디어 리소스 할당 및 DC-AS와의 연결 과정을 완료하였 음을 MF를 통해 수신한 뒤, DCSF로 Originating UE의 데이터 서비스 연결 요청에 따른 부트스트랩 데이터 채널 셋업 동작을 완료하였음을 통지할 수 있다. 본 개시의 일 실시예에 따르면, IMS AS는 DCSF로부터 데이터 채널 부트스트랩 셋업 과정 중 MF로부터 전달받은 MF의 엔드포인트 정보를 포함한 업데이트된 데이터 채널 관련 SDP 정보를 S-CSCF로 전달할 수 있다. 상기 업데 이트된 데이터 채널 관련 SDP 정보를 포함하는 SIP INVITE 정보를 수신한 S-CSCF는 이를 Terminating 네트워크 로 전달하여 Terminating or Remote UE의 데이터 채널 서비스 연결을 위한 부트스트랩 데이터 채널 셋업 시그널 링 과정을 수행할 수 있다. 본 개시는 IMS 기반의 서비스에서 데이터 채널을 이용하여 기존의 비디오, 오디오, 텍스트 기반의 서비스 보다 사용자 위치 공유, 스크린 쉐어링 등 다양한 IMS 기반의 부가서비스를 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 본 개시는 IMS 멀티미디어 텔레포니 시스템 기반의 데이터 채널 서비스에 관련된 것이다. 일 실 시예에 따라, IMS AS에서 무선 통신 네트워크에서 발신 단말의 데이터 채널 서비스를 수행하는 방법은, 적어도 하나의 부트스트랩 데이터 채널 연결을 위한 qos 관련 정보를 포함하는 SIP 메시지 내 SDP offer를 통해 IMS AS 에게 전송하는 동작; 상기 SDP offer 메시지를 바탕으로 딜레이 크리티컬 서비스 지원 지사자를 포함하는 부트 스트랩 데이터 채널 연결을 위한 정책 정보를 DCSF로 송신하는 동작; DCSF로부터 데이터 채널 관련 미디어 정보 를 수신하는 동작, 상기 DCSF로부터 수신한 데이터 채널 관련 미디어 정보를 바탕으로 적절한 미디어 기능 엔터 티를 선택하기 위하여 N6 딜레이 요구사항을 포함하는 MF 프로파일을 생성하는 동작, N6 딜레이 요구사항을 포 함하는 MF 프로파일 기반으로 NRF에 적절한 MF 디스커버리 및 선택 요청 정보를 전송하는 동작; NRF에서 전달받 은 MF 인스턴스 정보를 바탕으로 선택한 MF로 미디어 리소스 관련 정보를 전달하는 동작; MF에서 미디어 터미네 이션 디스크립터 관련 정보를 수신한 뒤 UE로부터 전달받은 SDP offer 내용을 업데이트 하는 동작; S-CSCF로 업 데이트된 SDP offer를 포함한 SIP INVITE 메시지를 전송하는 동작; Terminating 네트워크 또는 UE로부터 전달받 은 200 OK를 포함하는 SDP offer 메시지를 S-CSCF로부터 수신하는 동작; Terminating 네트워크 또는 UE로부터 200 OK 정보를 수신한 뒤 부트스트랩 데이터 채널 세션 연결 이벤트의 성공을 통지 메시지를 DCSF로 송신 및 전 송하는 동작; 부트스트랩 데이터 채널 연결 이벤트 성공 통지를 바탕으로 S-CSCF로부터 수신한 200 OK 정보를 S-CSCF/P-CSCF를 거쳐 UE로 전송하는 동작을 포함할 수 있다. 본 개시의 청구항 또는 명세서에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨어와 소 프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다(configured for execution). 하나 이상의 프로그램은, 전자 장치로 하여금 본 개시의 청구항 또는 명세서에 기재된 실시 예실시예들에 따른 방법들을 실행하게 하는 명령어(instructions)를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리 (random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM: Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM: Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM: Compact Disc-ROM), 디지털 다목적 디스크(DVDs: Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 복수 개 포함될 수도 있다. 또한, 프로그램은 인터넷(Internet), 인트라넷(Intranet), LAN(Local Area Network), WLAN(Wide LAN), 또는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 구성된 통신 네트워크를 통하여 접근 (access)할 수 있는 부착 가능한(attachable) 저장 장치(storage device)에 저장될 수 있다. 이러한 저장 장치 는 외부 포트를 통하여 본 개시의 실시예를 수행하는 장치에 접속할 수 있다. 또한, 통신 네트워크 상의 별도의 저장 장치가 본 개시의 실시예를 수행하는 장치에 접속할 수도 있다. 상술한 본 개시의 구체적인 실시 예들에서, 본 개시에 포함되는 구성 요소는 제시된 구체적인 실시 예에 따라 단수 또는 복수로 표현되었다. 그러나, 단수 또는 복수의 표현은 설명의 편의를 위해 제시한 상황에 적합하게 선택된 것으로서, 본 개시가 단수 또는 복수의 구성 요소에 제한되는 것은 아니며, 복수로 표현된 구성 요소라 하더라도 단수로 구성되거나, 단수로 표현된 구성 요소라 하더라도 복수로 구성될 수 있다. 한편 본 개시의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 개시의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능함은 물론이다. 그러므로 본 개시의 범위는 설명된 실시 예에 국한되어 정해 져서는 아니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한 다."}
{"patent_id": "10-2023-0110871", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시예에 따른 5G 시스템의 네트워크 구조 및 인터페이스를 도시한 도면이다. 도 2는 본 개시의 일 실시예에 따른 IMS(IP(internet protocol) multimedia subsystem) 시스템에서 IMS- DC(IP(internet protocol) multimedia subsystem data channel) 서비스를 위한 네트워크 구조 및 인터페이스를 도시한 도면이다. 도 3a, 3b, 및 3c는 본 개시의 일 실시예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server)에서 N6 딜레이 요구사항 정보를 MF 엔터티 선택에 활용하는 방법 및 해당 MF(media function) 기반의 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 도 4a, 4b, 4c, 및 4d는 본 개시의 일 실시예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server)에서 MF(media function) 선택이 실패할 경우 해당 에러 정보 및 거절 이유를 UE에 전달하 여 UE에서 업데이트된 서비스 요구사항을 바탕으로 서비스 연결 요청을 다시 전송하는 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 도 5a, 5b, 및 5c는 본 개시의 일 실시예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application server)에서 N6 딜레이 요구사항 정보를 바탕으로 우선순위 기반의 MF(media function) 엔터티 리 스트를 전달받아 이를 상대 네트워크 또는 UE에 전달하여 적절한 MF(media function) 선택 및 해당 MF(media function) 기반의 부트스트랩 데이터 채널 설정 시그널링 과정을 설명하기 위한 순서도이다. 도 6은 본 개시의 일 실시예에 따른 IMS AS(IP(internet protocol) multimedia subsystem application serve r)의 구조를 도시한 도면이다. 도 7은 본 개시의 일 실시예에 따른 NRF(network repository function)의 구조를 도시한 도면이다."}
