{"patent_id": "10-2023-0004977", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0049112", "출원번호": "10-2023-0004977", "발명의 명칭": "채널 상태 정보 전달 방법 및 장치", "출원인": "삼성전자주식회사", "발명자": "이준호"}}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 통신 장치의 동작 방법에 있어서,기지국으로부터 기준 신호(reference signal)를 수신하는 단계;상기 기준 신호에 기초하여 상기 무선 통신 장치와 상기 기지국 간의 제1 채널을 추정하는 단계;상기 무선 통신 장치에 의해 추정된 제1 채널 및 상기 기지국이 상기 제1 채널에 대하여 추정한 제2 채널과의차이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하도록 학습된 제1 인공지능 학습 모델에 기초하여상기 제1 채널로부터 그룹핑된 상기 속성들(attributes)을 포함하는 특징(feature)을 추출하는 단계;제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 속성들을 양자화(quantization)함으로써 상기 속성들의 그룹 각각에 대한 상기 코드북의 인덱스들의 조합을 생성하는 단계; 및상기 코드북의 상기 인덱스들의 조합 정보를 포함하는 비트스트림을 상기 기지국에게 전송하는 단계;를 포함하고,상기 코드북은 복수의 벡터-코드워드들(vector-codewords) 및 복수의 스칼라-코드워드들(scalar-codewords)을포함하고, 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하도록 학습된 인공지능 학습 모델인 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제1 인공지능 학습 모델은,상기 속성들간의 상관성에 기초하여 상관성이 높은 속성들끼리 그룹핑하도록 학습되는 것을 특징으로 하는 무선통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 제1 인공지능 학습 모델은,상기 그룹핑된 속성들의 중요도에 기초하여 더 학습되는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 제1 인공지능 학습 모델은,상기 그룹핑된 속성들의 밀도에 기초하여 더 학습되는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,상기 제1 인공지능 학습 모델은,상기 그룹핑된 속성들의 각 그룹에서 0보다 큰 속성들을 선택하도록 더 학습되는 것을 특징으로 하는 무선 통신장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2024-0049112-3-제4항에 있어서,상기 제1 인공지능 학습 모델에 기초하여 상기 속성들의 각 그룹에서 하나 이상의 속성들을 선택하는 단계;를더 포함하고,상기 속성들에 대한 상기 코드북의 인덱스들의 조합을 생성하는 단계는, 상기 속성들의 각 그룹에서 상기 선택된 하나 이상의 속성들의 양자화 값(quantization value)에 대응하는 상기 코드북의 인덱스들의 조합 정보 및 상기 선택된 하나 이상의 속성들의 위치 정보를 생성하는 것을 특징으로하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 그룹들 중에서 비트맵에 기초하여 일부 그룹들을 선택하는 단계를 더 포함하고, 상기 코드북의 인덱스들의 조합 정보를 포함하는 비트스트림을 상기 기지국에게 전송하는 단계는,상기 선택된 일부 그룹들 각각에 대한 상기 코드북의 인덱스를 포함하는 비트스트림을 상기 기지국에게 전송하는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서,상기 비트스트림이 상향링크 채널 상에서 전송되는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 기지국이 상기 비트스트림을 수신하고, 제4 인공지능 학습 모델을 이용하여 상기 비트스트림을 분할하고,상기 제4 인공지능 학습 모델에 기초한 코드북을 이용하여 양자화된 상기 속성들을 획득하는 단계; 및 상기 기지국이 상기 양자화된 상기 특징을 제3 인공지능 학습 모델을 이용하여 상기 무선 통신 장치가 추정한제1 채널을 추정한 상기 제2 채널을 획득하는 단계;를 더 포함하고,상기 무선 통신 장치가 상기 기지국과 상기 단계들을 수행하기 전에,상기 무선 통신 장치가 상기 제1 인공지능 학습 모델 및 상기 제2 인공지능학습 모델을 학습함으로써 상기 제1인공지능 학습 모델 및 상기 제2 인공지능 학습 모델의 파라미터들이 업데이트되고,상기 기지국이 상기 제3 인공지능 학습 모델 및 상기 제4 인공지능 학습 모델을 학습함으로써 상기 제3 인공지능 학습 모델 및 상기 제4 인공지능 학습 모델의 파라미터들이 업데이트되는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 상기 제1 인공지능 학습 모델과 상기 제2 인공지능 학습 모델은 병렬적으로 학습되고,상기 제3 인공지능 학습 모델과 상기 제4 인공지능 학습 모델은 병렬적으로학습되는 것을 특징으로 하는 무선통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 기준 신호는 CSI-RS(channel state information-reference signal), SSB(synchronization signalblock), DM-RS(demodulation-reference signal), TRS(tracking reference signal) 중 어느 하나인 것을 특징으로 하는 무선 통신 장치의 동작 방법.공개특허 10-2024-0049112-4-청구항 12 제1항에 있어서, 상기 제1 인공지능 학습 모델 및 상기 제2 인공지능 학습 모델은, 비선형 관계(non-linear relationship)들을 모델링하는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "무선 통신 장치의 동작 방법에 있어서,기지국으로부터 기준 신호(reference signal)를 수신하는 단계;상기 기준 신호에 기초하여 상기 무선 통신 장치와 상기 기지국 간의 제1 채널을 추정하는 단계;상기 무선 통신 장치에 의해 추정된 제1 채널 및 상기 기지국이 상기 제1 채널에 대하여 추정한 제2 채널과의차이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하도록 학습된 제1 인공지능 학습 모델에 기초하여상기 제1 채널로부터 그룹핑된 상기 속성들(attributes)을 포함하는 특징(feature)을 추출하는 단계;제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 속성들을 양자화(quantization)함으로써 상기 속성들의 그룹 각각에 대한 상기 코드북의 인덱스들의 조합을 생성하는 단계; 및상기 코드북의 상기 인덱스를 포함하는 비트스트림을 상기 기지국에게 전송하는 단계;를 포함하고,상기 코드북은 복수의 벡터-코드워드들(vector-codewords)을 포함하고, 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하도록 학습된 인공지능학습 모델인 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서, 상기 제1 인공지능 학습 모델은,상기 속성들간의 상관성에 기초하여 상관성이 높은 속성들끼리 그룹핑하도록 학습되는 것을 특징으로 하는 무선통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 제1 인공지능 학습 모델은,상기 그룹핑된 속성들의 중요도에 기초하여 더 학습되는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 제1 인공지능 학습 모델은,상기 그룹핑된 속성들의 밀도에 기초하여 더 학습되는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,상기 제1 인공지능 학습 모델은,상기 그룹핑된 속성들의 각 그룹에서 0보다 큰 속성들을 선택하도록 더 학습되는 것을 특징으로 하는 무선 통신장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "공개특허 10-2024-0049112-5-제16항에 있어서,상기 제1 인공지능 학습 모델에 기초하여 상기 속성들의 각 그룹에서 하나 이상의 속성들을 선택하는 단계;를더 포함하고,상기 속성들에 대한 상기 코드북의 인덱스들의 조합을 생성하는 단계는, 상기 속성들의 각 그룹에서 상기 선택된 하나 이상의 속성들의 양자화 값(quantization value)에 대응하는 상기 코드북의 인덱스들의 조합 정보 및 상기 선택된 하나 이상의 속성들의 위치 정보를 생성하는 것을 특징으로하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제13항에 있어서,상기 그룹들 중에서 비트맵에 기초하여 일부 그룹들을 선택하는 단계를 더 포함하고, 상기 코드북의 인덱스들의 조합 정보를 포함하는 비트스트림을 상기 기지국에게 전송하는 단계는,상기 선택된 일부 그룹들 각각에 대한 상기 코드북의 인덱스를 포함하는 비트스트림을 상기 기지국에게 전송하는 것을 특징으로 하는 무선 통신 장치의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "기지국의 동작 방법에 있어서,무선 통신 장치로부터 양자화된 속성들에 대한 코드북 인덱스들의 조합에 대한 정보를 포함하는 비트스트림을수신하는 단계;상기 기지국이 제2 인공지능 학습 모델을 이용하여 상기 비트스트림을 분할하고, 상기 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 분할된 비트스트림으로부터 상기 양자화된 속성들을 추출하는 단계; 및상기 기지국이 상기 무선 통신 장치가 추정한 제1 채널 및 상기 기지국이 상기 제1 채널을 추정한 제2 채널과의차이를 작게 하는 제1 인공지능 학습 모델을 이용하여 상기 양자화된 속성들로부터 상기 제2 채널을 획득하는단계;를 포함하고,상기 코드북은 복수의 벡터-코드워드들(vector-codewords) 및 복수의 스칼라-코드워드들(scalar-codewords)을포함하고, 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하기 위한 인공지능 학습 모델인 것을 특징으로하는 기지국의 동작 방법."}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시의 기술적 사상에 따른 무선 통신 장치의 동작 방법에 있어서, 기지국으로부터 기준 신호(reference signal)를 수신하는 단계, 기준 신호에 기초하여 상기 무선 통신 장치와 기지국 간의 제1 채널을 추정하는 단계, 무선 통신 장치에 의해 추정된 제1 채널 및 기지국이 제1 채널에 대하여 추정한 제2 채널과의 차이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하도록 학습된 제1 인공지능 학습 모델에 기초하여 제1 채널로부터 그룹 핑된 속성들(attributes)을 포함하는 특징(feature)을 추출하는 단계, 제2 인공지능 학습 모델에 기초한 코드북 을 이용하여 속성들을 양자화(quantization)함으로써 속성들의 그룹 각각에 대한 코드북의 인덱스들의 조합을 생 성하는 단계 및 코드북의 인덱스들의 조합 정보를 포함하는 비트스트림을 기지국에게 전송하는 단계를 포함할 수 있다."}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시의 기술적 사상은 채널 상태 정보를 전달하는 방법 및 장치에 관한 발명이다."}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기지국(base station, BS)은 기지국과 UE(user equipment) 사이의 채널 정보를 알기 위해 UE에게 기준 신호들 을 송신할 수 있다. 예를 들어, 기지국은 기지국과 UE 사이의 채널 정보를 알기 위해 CSI-RS(channel state information-reference signal)를 전송할 수 있다. UE는 기지국으로부터 수신한 CSI-RS를 통해서 기지국과 UE 간의 채널을 파악할 수 있다. 즉, UE는 CSI-RS에 기초하여 기지국과 UE간의 채널을 추정할 수 있다. UE는 추정 한 채널에 대한 피드백(feedback) 정보를 기지국에게 리포트(report)할 수 있다. 피드백 정보는 PMI(precoding matrix indicator), RI(rank indicator) 및 CQI(channel quality indicator)를 포함할 수 있다. 기지국은 피드 백 정보를 이용하여 하향링크 채널에 대한 프리코더를 설계할 수 있다. UE가 추정한 채널에 대한 정보들을 상향링크 자원을 효율적으로 사용하여 기지국에게 전송하는 방안이 요구되고"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "있다. 발명의 내용"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 개시의 기술적 사상이 해결하려는 과제는 채널 상태 정보를 전달하는 방법 및 장치를 제공하는 데에 있다."}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기와 같은 목적을 달성하기 위하여 본 개시의 기술적 사상에 따른 무선 통신 장치의 동작 방법에 있어서, 기 지국으로부터 기준 신호(reference signal)를 수신하는 단계, 상기 기준 신호에 기초하여 상기 무선 통신 장치 와 상기 기지국 간의 제1 채널을 추정하는 단계, 상기 무선 통신 장치에 의해 추정된 제1 채널 및 상기 기지국 이 상기 제1 채널에 대하여 추정한 제2 채널과의 차이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하 도록 학습된 제1 인공지능 학습 모델에 기초하여 상기 제1 채널로부터 그룹핑된 상기 속성들(attributes)을 포 함하는 특징(feature)을 추출하는 단계, 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 속성들을 양 자화(quantization)함으로써 상기 속성들의 그룹 각각에 대한 상기 코드북의 인덱스들의 조합을 생성하는 단계 및 상기 코드북의 상기 인덱스들의 조합 정보를 포함하는 비트스트림을 상기 기지국에게 전송하는 단계를 포함 할 수 있다. 상기 코드북은 복수의 벡터-코드워드들(vector-codewords) 및 복수의 스칼라-코드워드들(scalar- codewords)을 포함하고, 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하도록 학습된 인공지능 학습 모델 일 수 있다. 본 개시의 기술적 사상의 다른 측면에 따른 무선 통신 장치의 동작 방법에 있어서, 기지국으로부터 기준 신호 (reference signal)를 수신하는 단계, 상기 기준 신호에 기초하여 상기 무선 통신 장치와 상기 기지국 간의 제1 채널을 추정하는 단계. 상기 무선 통신 장치에 의해 추정된 제1 채널 및 상기 기지국이 상기 제1 채널에 대하여 추정한 제2 채널과의 차이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하도록 학습된 제1 인공지능 학 습 모델에 기초하여 상기 제1 채널로부터 그룹핑된 상기 속성들(attributes)을 포함하는 특징(feature)을 추출 하는 단계, 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 속성들을 양자화(quantization)함으로써 상기 속성들의 그룹 각각에 대한 상기 코드북의 인덱스들의 조합을 생성하는 단계 및 상기 코드북의 상기 인덱 스들의 조합 정보를 포함하는 비트스트림을 상기 기지국에게 전송하는 단계를 포함할 수 있다. 상기 코드북은 복수의 벡터-코드워드들(vector-codewords)을 포함하고, 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복 수의 벡터-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하도록 학습된 인공지능 학습 모델일 수 있다. 본 개시의 기술적 사상의 다른 측면에 따른 기지국의 동작 방법에 있어서, 무선 통신 장치로부터 양자화된 속성 들에 대한 코드북 인덱스들의 조합에 대한 정보를 포함하는 비트스트림을 수신하는 단계, 상기 무선 통신 장치 가 추정한 제1 채널 및 상기 기지국이 상기 제1 채널을 추정한 제2 채널과의 차이를 작게 하고, 속성들 (attributes)을 그룹핑(grouping)하도록 학습된 제1 인공지능 학습 모델을 이용하여 상기 비트스트림을 분할하 는 단계, 상기 기지국이 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 분할된 비트스트림으로부터 상기 양자화된 속성들을 추출하는 단계 및 상기 기지국이 상기 제1 인공지능 학습 모델을 이용하여 상기 양자화 된 속성들로부터 상기 제2 채널을 획득하는 단계를 포함할 수 있다. 상기 양자화된 속성들은 제1 인공지능 학습 모델에 기초하여 상기 제1 채널로부터 추출된 그룹핑된 속성들(attributes)이 제2 인공지능 학습 모델에 기초한 코드북에 기반하여 양자화된 속성들일 수 있다. 상기 코드북은 복수의 벡터-코드워드들(vector-codewords) 및 복수의 스칼라-코드워드들(scalar-codewords)을 포함하고, 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하기 위한 인공지능 학습 모델일 수 있다."}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 예시적 실시 예에 따른 무선 통신 장치가 인공지능 학습 모델에 기반하여 채널 상태 정보를 효율적으 로 기지국에게 전송할 수 있다. 본 개시의 예시적 실시 예에 따른 무선 통신 장치는 인공지능 학습 모델에 기반하여 무선 통신 장치와 기지국간 의 채널 정보를 압축할 수 있다. 본 개시의 예시적 실시 예에 따른 무선 통신 장치는 비선형(non-linear) 특성들까지 고려하여 채널 정보를 압축 할 수 있다. 본 개시의 예시적 실시 예에 따른 무선 통신 장치는 인공지능 학습 모델에 기반하여 무선 통신 장치와 기지국간 의 채널의 특성(feature)를 그룹핑할 수 있다. 본 개시의 예시적 실시 예에 따른 무선 통신 장치는 인공지능 학습 모델에 기반한 코드북(codebook)을 이용하여 채널 정보를 양자화(quantization)함으로써 양자화 과정에서의 손실(loss)을 줄일 수 있다. 본 개시의 예시적 실시예들에서 얻을 수 있는 효과는 이상에서 언급한 효과들로 제한되지 아니하며, 언급되지"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "아니한 다른 효과들은 이하의 기재로부터 본 개시의 예시적 실시예들이 속하는 기술분야에서 통상의 지식을 가 진 자에게 명확하게 도출되고 이해될 수 있다. 즉, 본 개시의 예시적 실시예들을 실시함에 따른 의도하지 아니"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "한 효과들 역시 본 개시의 예시적 실시예들로부터 당해 기술분야의 통상의 지식을 가진 자에 의해 도출될 수 있 다."}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "기지국은 무선 통신 장치와 통신하며, 무선 통신 장치에게 통신 네트워크 자원을 할당하는 일 주체로서, 셀 (cell), BS(base station), NodeB(NB), eNodB(eNB), NG RAN(next generation radio access network), 무선 접 속 유닛, 기지국 제어기, 네트워크 상의 노드 및 gnodeB(gNB) 중 적어도 하나일 수 있다. 무선 통신 장치는 기지국 또는 다른 무선 통신 장치와 통신하는 일 주체로서, 노드, UE(user equipment), NG UE(next generation UE), 이동국(Mobile Station; MS), 이동 장치(Mobile Equipment; ME), 디바이스(device) 및 단말(terminal) 중 적어도 하나일 수 있다. 또한, 무선 통신 장치는 스마트폰, 태블릿 PC, 이동 전화기, 영상 전화기, 전자책 리더기, 데스크탑 PC, 랩탑 PC, 넷북 컴퓨터, PDA, PMP(portable multimedia player), MP3 플레이어, 의료기기, 카메라, 또는 웨어러블 장 치 중 적어도 하나를 포함할 수 있다. 또한, 무선 통신 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스, 홈 오토매이션 컨트롤 패널, 보안 컨트롤 패널, 미디어 박스(예: 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(예:XboxTM, PlayStationTM), 전자 사전, 전자 키, 캠코더, 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 또한, 무선 통신 장치는 각종 의료기기(예: 각종 휴대용 의료측정기기(혈당 측정기, 심박 측정기, 혈압 측정기, 또는 체온 측정기 등), MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 또는 초음파기 등), 네비게이션 장치, 위성 항법 시스템(GNSS(global navigation satellite system)), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼 트 장치, 선박용 전자 장비(예: 선박용 항법 장치, 자이로 콤파스 등), 항공 전자기기(avionics), 보안 기기, 차량용 헤드 유닛(head unit), 산업용 또는 가정용 로봇, 드론(drone), 금융 기관의 ATM, 상점의 POS(point of sales), 또는 사물 인터넷 장치 (예: 전구, 각종 센서, 스프링클러 장치, 화재 경보기, 온도조절기, 가로등, 토 스터, 운동기구, 온수탱크, 히터, 보일러 등) 중 적어도 하나를 포함할 수 있다. 그 밖에, 무선 통신 장치는 통 신 기능을 수행할 수 있는 다양한 종류의 멀티 미디어 시스템을 포함할 수 있다. 이하, 첨부한 도면을 참조하여 본 발명의 실시 예에 대해 상세히 설명한다. 도 1은 본 개시의 예시적 실시 예에 따른 기지국과 무선 통신 장치간 신호 송수신 동작을 나타낸다. 도 1를 참조하면, 무선 통신 시스템은 기지국 및 무선 통신 장치를 포함할 수 있다. 서술의 편 의상 무선 통신 시스템은 하나의 기지국 및 하나의 무선 통신 장치만을 포함하는 것으로 도시되 었으나, 이는 예시적인 실시 예에 불과한 바, 이에 국한되지 않으며, 다양한 개수의 기지국 및 무선 통신 장치 들을 포함하도록 무선 통신 시스템이 구현될 수 있다. 기지국은 무선 통신 장치와 무선 채널로 연결되어 다양한 통신 서비스를 제공할 수 있다. 기지국 은 모든 사용자 트래픽에 대해 공용 채널(shared channel)을 통해 서비스를 제공할 수 있고, 무선 통신 장 치의 버퍼 상태, 가용 전송 전력 상태, 채널 상태 등의 상태 정보를 취합해서 스케줄링할 수 있다. 무선 통신 시스템은 직교 주파수 분할 다중 방식(Orthogonal Frequency Division Multiplexing; OFDM)을 무선 접속 기술로 하여 빔 포밍 기술을 지원할 수 있다. 또한, 무선 통신 시스템은 무선 통신 장치의 채널 상태에 맞춰 변조 방식(modulation scheme)과 채널 코딩률(channel coding rate)을 결정하는 적응 변조 코딩 (Adaptive Modulation & Coding; AMC) 방식을 지원할 수 있다. 또한, 무선 통신 시스템은 6GHz 이상의 주파수 대역에 존재하는 넓은 주파수 대역을 사용하여 신호를 송수 신할 수 있다. 예를 들면, 무선 통신 시스템은 28GHz 대역, 또는 60GHz 대역과 같이 밀리미터파 (millimeter wave) 대역을 사용하여 데이터 전송률을 증대시킬 수 있다. 이 때에, 밀리미터파 대역은 거리당 신 호 감쇄 크기가 상대적으로 크기 때문에 무선 통신 시스템은 커버리지(coverage) 확보를 위해 다중 안테나 를 사용하여 생성된 지향성 빔 기반의 송수신을 지원할 수 있다. 무선 통신 시스템은 MIMO(Multiple Input, Multiple Output)를 지원하는 시스템일 수 있으며, 이에 따라 기지국 및 무선 통신 장치는 빔 포밍 기술을 지원할 수 있다. 빔 포밍 기술은 디지털 빔 포밍, 아날로그 빔 포밍, 하이브리드 빔 포밍 등으 로 나뉠 수 있으며, 이하에서 무선 통신 시스템은 하이브리드 빔 포밍 기술을 지원하는 실시 예를 중심으로 본 기술의 사상을 서술하나, 본 기술은 다른 빔 포밍 기술에도 적용될 수 있음은 충분히 이해될 것이다. 도 1을 참조하면, 기지국은 무선 통신 장치에게 CSI-RS(channel state information-refernce signal)을 전송할 수 있다. 무선 통신 장치는 CSI-RS를 이용하여 하향링크 채널을 추정할 수 있다. 무선 통신 장치는 인공지능 학습 모델에 기초한 채널 정보를 포함하는 비트스트림을 기지국에게 전송할 수 있다. 무선 통신 장치는 인공지능 학습 모델에 기초하여 무선 통신 장치와 기지국간의 채널 정 보를 효율적으로 압축하여 기지국에게 전송할 수 있다. 무선 통신 장치는 적은 상향링크(uplink) 자원을 사용하여 채널 상태 정보(channel state information)을 기지국에게 정확히 전달하기 위해서 채널정보 압축 기술을 활용할 수 있다. 일 예로, 무선 통신 장치가 채 널 성분이 많이 포함된 선형 서브스페이스(linear subspace)를 활용하여 채널 정보를 압축할 수 있다. 다만, 무 선 통신 장치가 선형 서브스페이스만을 활용하여 채널 정보를 압축하는 경우 그 압축 성능에 한계를 가질 수 있다. 본 개시는 딥러닝(deep learnig)을 채널 정보 보고에 이용하는 방법을 제안함으로써 비선형(non- linear) 특성들까지 고려하여 채널 정보의 압축 성능을 극대화하는 방법을 제안한다. 도 2는 본 개시의 예시적 실시 예에 따른 기지국 및 무선 통신 장치의 블록도를 나타낸다. 도 2를 참조하면, 무선 통신 장치는 제1 인공지능 학습 모델에 기초한 인코더 및 제2 인공지능 학습 모델에 기초한 인코더를 포함할 수 있다. 기지국은 제3 인공지능 학습 모델에 기초한 디코더 및 제4 인공지능 학습 모델에 기초한 디코더를 포함할 수 있다. 제1 내지 제4 인공지능 학습 모델 각각은 다양한 종류의 인공지능 학습 모델일 수 있다. 즉, 제1 인공지능 학습 모델 및 제2 인공지능 학습 모델 각각은 다양한 종류의 뉴럴 네트워크(neural network)를 포함할 수 있다. 예를 들어, 제1 인공지능 학습 모델 및 제2 인공지능 학습 모델 각각은 CNN(convolutional neural network), RNN(recurrent neural network, DNN(Dense neural network) 및 fully-connected neural nework 중 적어도 하 나를 포함할 수 있다. 또한, 제1 내지 제4 인공지능 학습 모델들은 비선형 관계(non-linear relationship)들을 모델링 할 수 있다. 본 개시에서, 제1 인공지능 학습 모델은 무선 통신 장치가 채널 상태 정보로부터 특징(feature)를 추출하 는데 이용되는 인공지능 학습 모델을 지칭할 수 있다. 제2 인공지능 학습 모델은 무선 통신 장치가 특징 (feature)에 대해 코드북을 이용하여 양자화하는 과정에서 이용되는 인공지능 학습 모델을 지칭할 수 있다. 제3 인공지능 학습 모델은 기지국이 특징으로부터 채널 상태 정보를 획득하는 과정에서 이용되는 인공지능 학 습 모델을 지칭할 수 있다. 제4 인공지능 학습 모델은 기지국이 양자화된 특징의 코드북 인덱스 정보로부 터 양자화된 특징을 획득하는 과정에서 이용되는 인공지능 학습 모델을 지칭할 수 있다. 제1 내지 제4 인공지능 학습 모델 각각은 서로 상이한 뉴럴 네트워크에 기초할 수 있다. 예를 들어, 제1 인공 지능 학습 모델과 제2 인공지능 학습 모델은 서로 상이한 뉴럴 네트워크에 기초할 수 있으며, 제1 인공지능 학 습 모델과 제3 인공지능 학습 모델은 서로 상이한 뉴럴 네트워크에 기초할 수 있다. 또한, 제3 인공지능 학습 모델과 제4 인공지능 학습 모델은 서로 상이한 뉴럴 네트워크에 기초할 수 있다. 또 다른 예로, 제1 인공지능 학습 모델과 제3 인공지능 학습 모델은 서로 동일한 뉴럴 네트워크에 기초할 수 있 다. 즉, 제1 인공지능 학습 모델과 제3 인공지능 학습 모델은 동일할 수 있다. 제2 인공지능 학습 모델과 제4 인공지능 학습 모델은 서로 동일한 뉴럴 네트워크에 기초할 수 있다. 즉, 제2 인공지능 학습 모델과 제4 인공지 능 학습 모델은 동일할 수 있다. 즉, 제1 내지 제4 인공지능 학습 모델은 서로 상이하거나 동일한 뉴럴 네트워크에 기초할 수 있으며, 제1 내지 제4 인공지능 학습 모델들이 기초하는 뉴럴 네트워크들의 조합은 다양할 수 있다. 무선 통신 장치는 기지국으로부터 CSI-RS(channel state information-reference signal)을 수신할 수 있다. 무선 통신 장치는 수신한 CSI-RS를 이용하여 무선 통신 장치와 기지국간의 하향링크 채널을 추정할 수 있다. 무선 통신 장치가 추정한 채널은 행렬의 형태를 가질 수 있다. 무선 통신 장치 가 추정한 채널에 대한 행렬을 제1 채널 행렬로 지칭할 수 있다. 제1 채널 행렬은 제1 인공지능 학습 모델 에 기초한 인코더에 입력될 수 있다. 제1 인공지능 학습 모델에 기초한 인코더는 제1 채널 행렬을 입력받을 수 있다. 제1 인공지능 학습 모델에 기초한 인코더는 제1 인공지능 학습 모델에 기반하여 제1 채널 행렬로부터 하나 이상의 속성들을 포함하는 특징(feature) 변수 z를 출력할 수 있다. 즉, 무선 통신 장치는 추정한 채널 정보로부터 제1 인공지능 학 습 모델에 기초하여 특징(feature) 변수 z를 추출할 수 있다. 예를 들어, 제1 인공지능 학습 모델에 기초한 인코더는 다음과 같은 두 가지 목적이 반영된 제1 인공지능 학습 모델에 기초하여 특징 z를 추출할 수 있다. 제1 인공지능 학습 모델에 기초한 인코더는 무선 통신 장 치가 추정한 제1 채널 행렬과 기지국이 무선 통신 장치로부터 수신한 채널 정보에 기초하여 추 정한 제2 채널 행렬의 차이를 작게 위한 목적 및 특징 변수들의 속성들을 그룹핑(grouping)하기 위한 목적이 반 영되어 학습된 제1 인공지능 학습 모델에 기초하여 특징 변수 z를 추출할 수 있다. z는 벡터 또는 행렬의 형태 를 가질 수 있다. 특징 변수는 특징으로 지칭될 수 있다. 이에 대하여, 도 6 및 도 7에서 상세히 서술한다. 또 다른 예로, 제1 인공지능 학습 모델에 기초한 인코더는 채널 행렬의 차이를 작게 하기 위한 목적, 그룹 핑을 위한 목적뿐만 아니라 중요도에 기초하여 속성들을 선택하기 위한 목적 및 밀도에 기초하여 속성들을 선택 하기 위한 목적 등을 더 반영하여 학습된 제1 인공지능 학습 모델에 기초하여 특징 z를 추출할 수 있다. 이에 따라, 무선 통신 장치가 한정된 상향링크 자원을 활용하여 채널 상태 정보를 효율적으로 압축하여 기지국 에게 전송할 수 있다. 이에 대하여, 도 10a 내지 도 10c에서 상세히 서술한다. 제2 인공지능 학습 모델에 기초한 인코더는 특징 z를 입력받을 수 있다. 제2 인공지능 학습 모델에 기초한 인코더는 제2 인공지능 학습 모델에 기초하여 특징을 양자화(quantization)함으로써 비트스트림 형태로 변 환할 수 있다. 무선 통신 장치는 상기 비트스트림을 상향링크 자원을 이용하여 기지국에게 전송할 수 있다. 예를 들어, 제2 인공지능 학습 모델에 기초한 인코더는 제2 인공지능 학습 모델에 기초한 코드북 (codebook)을 이용하여 특징의 속성들의 그룹들을 양자화할 수 있다. 본 명세서에서 양자화된 특징은 zq로 표현 될 수 있다. 그리고, 제2 인공지능 학습 모델에 기초한 인코더는 양자화된 특징 zq에 대한 코드북 인덱스 정보를 포함한 비트스트림을 상향링크 자원을 이용하여 기지국에게 전송할 수 있다. 이에 대하여, 도 8에 서 상세히 설명한다. 기지국은 무선 통신 장치로부터 상기 비트스트림을 수신할 수 있다. 제4 인공지능 학습 모델에 기초 한 디코더는 제4 인공지능 학습 모델에 기초하여 비트스트림을 분할할 수 있다. 또한, 제4 인공지능 학습 모델에 기초한 디코더는 제4 인공지능 학습 모델에 기초한 코드북을 이용하여 분할된 비트스트림으로부터 양자화된 속성들을 포함하는 특징 zq를 획득할 수 있다. 제4 인공지능 학습 모델에 기초한 디코더는 양자 화된 특징 zq를 제3 인공지능 학습 모델에 기초한 디코더에게 전달할 수 있다. 제3 인공지능 학습 모델에 기초한 디코더는 제3 인공지능 학습 모델에 기반하여 양자화된 특징 zq로부터 제2 채널 행렬을 획득할 수 있다. 제3 인공지능 학습 모델의 뉴럴 네트워크는 제1 채널 행렬과 제2 채널 행렬의 차이를 작게 하도록 학습될 수 있다. 제1 인공지능 학습 모델의 파라미터들의 집합은 로 표현될 수 있다. 제3 인공지능 학습 모델의 파라미터들의 집합은 로 표현될 수 있다. 무선 통신 장치와 기지국은 상술한 절차들을 반복함으로써 제1 내지 제4 인공지능 학습 모델들을 학 습(training)할 수 있다. 학습이 완료된 후, 무선 통신 장치와 기지국은 학습이 완료된 제1 내지 제4 인공지능 학습 모델에 기초하여 상술한 절차들을 수행할 수 있다. 일 예로, 즉, 제1 인공지능 학습 모델에 기초한 인코더 및 제3 인공지능 학습 모델에 기초한 디코더 는 제1 채널 행렬과 제2 채널 행렬의 차이가 작아지도록 학습할 수 있다. 또한, 제1 인공지능 학습 모델에 기초 한 인코더 및 제3 인공지능 학습 모델에 기초한 디코더는 제1 채널 행렬로부터 추출된 특징의 속성들 이 상관성이 높은 속성들끼리 같은 그룹이 되도록 학습할 수 있다. 도 3은 본 개시의 예시적 실시 예에 따른 기지국 및 무선 통신 장치의 블록도를 나타낸다. 도 3은 도 1 및 도 2 를 참조하여 설명될 수 있다. 도 3을 참조하면, 무선 통신 장치는 채널 상태 정보 인코더를 포함할 수 있다. 기지국은 채널 상태 정보 디코더를 포함할 수 있다. 채널 상태 정보 인코더는 제1 인공지능 학습 모델에 기초한 인코더와 제2 인공지능 학습 모델에 기초 한 인코더의 동작을 수행할 수 있다. 예를 들어, 채널 상태 정보 인코더는 제1 인공지능 학습 모델에 기초하여 채널 상태로부터 그룹핑된 속성 들을 포함하는 특징을 추출할 수 있으며, 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 그룹핑된 속성들 을 포함하는 특징에 대해 양자화할 수 있다. 채널 상태 정보 디코더은 제3 인공지능 학습 모델에 기초한 디코더와 제4 인공지능 학습 모델에 기초 한 디코더의 동작을 수행할 수 있다. 예를 들어, 채널 상태 정보 디코더는 무선 통신 장치로부터 수신한 비트스트림을 제4 인공지능 학습 모델에 기초하여 분할하고, 분할된 비스트스림으로부터 제4 인공지능 학습 모델에 기초한 코드북을 이용하여 양 자화된 특징을 획득하고, 제3 인공지능 학습 모델에 기초하여 양자화된 특징으로부터 채널 상태 정보를 획득할 수 있다. 도 4는 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차에 대한 순서도를 나타낸다. 도 4를 참조하면, S401 단계에서, 무선 통신 장치가 기지국으로부터 기준 신호를 수신하고, 무선 통 신 장치와 기지국 간의 채널을 추정할 수 있다. 예를 들어, 무선 통신 장치는 CSI-RS(channel state information-reference signal), SSB(synchronization signal block), DM-RS(demodulation-reference signal), TRS(tracking reference signal) 중 어느 하나를 수신하고, 수신한 신호를 이용하여 무선 통신 장치 와 기지국 간의 채널을 추정할 수 있다. S402 단계에서, 무선 통신 장치가 제1 인공지능 학습 모델을 이용하여 추정된 채널에 대하여 그룹핑된 속 성들(attributes)을 포함하는 특징(feuture)을 추출할 수 있다. 제1 인공지능 학습 모델은 무선 통신 장치(12 0)가 추정한 제1 채널 및 기지국이 제1 채널을 추정한 제2 채널과의 차이를 작게 하도록 학습될 뿐만 아니 라 속성들(attributes)을 그룹핑(grouping)하도록 학습될 수 있다. 이에 대하여, 도 6 및 도 7에서 상세히 후술 한다. S403 단계에서, 무선 통신 장치가 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 속성들을 양자화 (quantization)할 수 있다. 코드북은 복수의 벡터-코드워드들(vector-codewords) 및 복수의 스칼라-코드워드들 (scalar-codewords)을 포함할 수 있다. 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하기 위한 인공지능 학습 모델일 수 있다. 이에 대하여, 도 8에서 상세히 후술한다. S404 단계에서, 무선 통신 장치가 양자화된 속성들에 대한 코드북 인덱스를 포함하는 비트스트림을 기지국 에게 전송할 수 있다. 무선 통신 장치는 비트스트림을 상향링크 채널 상에서 기지국에게 전송할 수 있다. 즉, 무선 통신 장치는 비트스트림을 제어 채널 및 데이터 채널 중 적어도 어느 하나 상에서 기지 국에게 전송할 수 있다. 일 예로, 무선 통신 장치는 비트스트림을 PUCCH(physical uplink control channel) 상에서 기지국에 게 전송할 수 있다. 또 다른 예로, 무선 통신 장치는 비트스트림을 PUSCH(physical uplink shared channel) 상에서 전송할 수 있다. 또 다른 예로, 무선 통신 장치는 비트스트림을 PUCCH 및 PUSCH 상에서 기지국에게 전송할 수 있다. 도 5는 본 개시의 예시적 실시 예에 따른 무선 통신 장치가 추정된 채널로부터 추출한 특징(feature)들의 일 예 를 나타낸다. 도 5는 도 2 및 도 3이 참조되어 설명될 수 있다. 제1 인공지능 학습 모델에 기초한 인코더는 제1 채널 행렬을 입력받을 수 있다. 제1 인공지능 학습 모델에 기초한 인코더가 제1 인공지능 학습 모델에 기초하여 제1 채널 행렬을 압축할 수 있다. 도 5를 참조하면, 제1 인공지능 학습 모델에 기초한 인코더는 다양한 속성(attributes)를 포함하는 특징 변수(feature variable) z를 출력할 수 있다. 특징 변수는 특징들로 지칭될 수 있다. 특징들(features)은 학습되는 속성들 (attributes)의 집합으로 정의될 수 있다. 압축 과정에서, 속성들이 특징 변수에 반영될 수 있다. 도 5를 참조 하면, 특징들의 형태가 2D로 표현되었으나, 이는 하나의 실시 예에 불과하며 다양한 차원으로 표현될 수 있다. 총 사이즈는 학습되는 속성의 수와 동일할 수 있다. 도 6은 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차의 일 예를 나타낸다. 도 6은 도 1, 도 2 및 도 3이 참조되어 설명될 수 있다. 도 6을 참조하면, S601 단계에서, 무선 통신 장치는 특징(feature)을 구성하는 속성들을 G개의 그룹들로 분할할 수 있다. 구체적으로, 무선 통신 장치는 기지국으로부터 기준 신호를 수신하고, 수신한 기준 신호를 이용해 채널을 추정할 수 있다. 무선 통신 장치가 제1 인공지능 학습 모델에 기반하여 추정한 채널 로부터 특징을 추출할 수 있다. 무선 통신 장치는 특징을 추출하면서 동시에 특징을 그룹핑할 수 있다. 무선 통신 장치는 다음 수학식 1과 같은 목적 함수를 가지는 제1 인공지능 학습 모델에 기반하여 제1 채널 행렬로부터 그룹핑된 특징을 추출할 수 있다. [수학식 1]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "수학식 1에서, 는 제1 인공지능 학습 모델의 뉴럴 네트워크의 파라미터들의 집합을 의미할 수 있다. 는 제3 인공지능 학습 모델의 뉴럴 네트워크의 파라미터들의 집합을 의미할 수 있다. 는 무선 통신 장치 가 추정한 기지국과 무선 통신 장치간의 하향링크 채널에 대한 제1 채널 행렬을 의미할 수 있다. 는 기지국이 무선 통신 장치로부터 수신한 특징들에 기초하여 추정한 기지국과 무선 통신 장치간의 하향링크 채널에 대한 제2 채널 행렬을 의미할 수 있다. 한편, 본 개시에서 제3 인공지능 학습 모델의 목적함수도 수학식 1과 동일할 수 있다. 수학식 1의 첫번째 항(term)은 기지국이 무선 통신 장치와 기지국간의 하향링크 채널을 정확하 게 추정하기 위해 설정될 수 있다. 즉, 제1 채널 행렬과 제2 채널 행렬의 차이를 작게 하기 위해 설정될 수 있 다. 첫번째 항은 기지국의 채널 행렬 복구 성능에 대응될 수 있으며, MSE(mean squared error) 등의 다양 한 식(mertric)이 적용될 수 있고 상술한 실시 예로 제한되지 않는다. 본 개시의 수학식들에서 이중 막대 표시 는 노름(NORM)을 의미할 수 있다. 수학식 1의 두번째 항에서,는 하이퍼파라미터(hyperparameter)로서 뉴럴네트워크의 학습 과정에서 조절될 수 있다. 는 첫번째 항과 두번째 항의 가중치를 결정할 수 있다. 수학식 1의 두번째 항은 상기 그룹들 간의 상관성을 줄이기 위해 설정될 수 있다. 예를 들어, 수학식 1의 두번 째 항은 다음 수학식 2와 같이 표현될 수 있다. [수학식 2]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "수학식 2에서, 는 특징 내 i번째 그룹을 의미할 수 있다. 수학식 1 및 수학식 2에 기초하여 무선 통신 장치가 제1 인공지능 학습 모델의 학습을 완료하고 기지국 이 제3 인공지능 학습 모델의 학습을 완료한 후에, 무선 통신 장치가 제1 인공지능 학습 모델에 기반 하여 출력하는 특징들은 상관성이 높은 속성들끼리 그룹핑될 수 있으며, 각 그룹들 간의 상관성은 낮을 수 있다. S602 단계에서, 무선 통신 장치는 각각의 그룹에 대해 양자화를 수행할 수 있다. S603 단계에서, 무선 통 신 장치는 CSI 보고(reporting)을 위한 UCI(uplink control information) 비트 시퀀스를 생성할 수 있다. 도 7은 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차의 일 예를 나타낸다. 도 7은 도 1, 도 2 및 도 3이 참조되어 설명될 수 있다. 도 6과 중복되는 설명은 생략될 수 있다. 도 7를 참조하면, S701 단계에서, 무선 통신 장치는 특징(feature)을 구성하는 속성들을 G개의 그룹들로 분할할 수 있다. S702 단계에서, 무선 통신 장치는 각각의 그룹에 대해 양자화를 수행할 수 있다. 무선 통신 장치가 특징을 그룹핑함으로써 분할한 후 각각 코드북을 이용하여 양자화 하는 경우 코드북 사 이즈에 따라 피드백 오버헤드(feedback overhead)가 증가할 수 있다. S703 단계에서, 무선 통신 장치는 비트맵(bitmap)에 기초하여 각 그룹의 기지국에게로의 전송 여부를 결정할 수 있다. 즉, 무선 통신 장치는 각 그룹의 피드백 여부를 결정할 수 있다. 무선 통신 장치는 비트맵을 온/오프(on/off) 할 수 있다. 일 예로, 온/오프는 다음 수학식 3을 통해 수행될 수 있다. [수학식 3]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "S704 단계에서, 무선 통신 장치는 CSI 보고(reporting)을 위한 UCI(uplink control information) 비트 시 퀀스를 생성할 수 있다. 예를 들어, 무선 통신 장치는 비트맵이 켜져 있는 위치에 해당하는 그룹들만 양자 할 수 있다. 그리고, 무선 통신 장치는 양쟈화된 그룹들의 코드북 인덱스 정보를 포함하는 비트스트림을기지국에게 전송할 수 있다. 도 8은 본 개시의 예시적 실시 예에 따른 그룹핑된 특징의 양자화를 나타낸다. 도 8은 도 1, 도 2 및 도 3이 참 조되어 설명될 수 있다. 도 2를 먼저 참조하면, 무선 통신 장치는 제1 인공지능 학습 모델에 기초한 인코더를 통해 그룹핑된 속성들을 포함하는 특징(feature)을 추출할 수 있다. 무선 통신 장치는 제2 인공지능 학습 모델에 기초한 코드북(codebook)을 이용하여 특징을 양자화할 수 있다. 본 개시에서, 코드북(codebook)은 하나 이상의 벡터-코드워드(vector-codeword)와 하나 이상의 스칼라-코드워드 (scalar-codeword)를 포함하는 코드북을 지칭할 수 있다. 백터-코드워드들의 집합은 벡터 코드북으로 지칭될 수 있으며, 스칼라-코드워드들의 집합은 스칼라 코드북으로 지칭될 수 있다. 도 8을 참조하면, 코드북은 N개의 벡 터-코드워드와 N개의 스칼라-코드워드를 포함할 수 있다. N은 1을 포함한 임의의 정수로 설정될 수 있다. N은 무선 통신 장치 및 기지국 중 적어도 하나에 의해 무선 통신 장치의 피드백 정보량 및 상향링크 자원 중 적어도 하나에 따라 적응적으로 조정될 수 있다. 각 그룹마다 N이 다를 수 있다. 도 8을 참조하면, g번째 그룹에 대한 코드북 인덱스 선택을 나타내며, 첫 번째 선택된 벡터-코드워드의 인덱스 는 3이고, N 번째 선택된 벡터-코드워드의 인덱스는 2인 것을 알 수 있다. 또한, 첫 번째 선택된 스칼라-코드워 드의 인덱스는 마지막 인덱스에 해당하는 숫자이고, N 번째 선택된 스칼라-코드워드의 인덱스는 1이다. 각 그룹 마다 N이 다를 수 있으며, 상술한 실시 예로 제한되지 않는다. 무선 통신 장치는 제2 인공지능 학습 모델에 기초한 코드북(codebook)을 이용하여 특징과 가장 가까운 코 드북 인덱스들을 선택할 수 있다. 즉, 무선 통신 장치의 제2 인공지능 학습 모델에 기초한 인코더는 N개의 벡터-코드워드 및 N개의 스칼라-코드워드의 선형 결합(linear combination)한 결과와 특징 z에 대한 차이 가 가장 작도록 코드북 인덱스들을 선택할 수 있다. 코드북 인덱스 선택에 대한 제2 인공지능 학습 모델의 목적함수는 다음 수학식 4와 같이 표현될 수 있다. [수학식 4]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "수학식 4에서, 는 스칼라 코드북내의 코드워드들을 정의할 수 있다. 는 벡터 코드북 내의 코드워드들을 정의할 수 있다. 는 무선 통신 장치의 제1 인공지능 학습 모델에 기초한 인코더가 출력한 특징 을 지칭할 수 있다. 자화의 출력은 선택된 인덱스들의 조합을 포함할 수 있다. 무선 통신 장치는 인덱스들 의 조합을 비트스트림(bitstream) 형태로 패킹(packing)할 수 있다. 무선 통신 장치는 비트스트림을 상향 링크 자원을 활용하여 기지국에게 전달할 수 있다. 기지국은 무선 통신 장치와 약속되어 있는 코드북을 이용하여 양자화된 특징을 획득할 수 있다. 양자화의 출력으로서 선택된 인덱스들의 조합은 다음 수학 식 5와 같이 표현될 수 있다. 한편, 제4 인공지능 학습 모델의 목적함수도 수학식 4와 같이 표현될 수 있다. [수학식 5]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "사전에 설계된 코드북 정보는 무선 통신 장치와 기지국이 공유할 수 있다. 예를 들어, 제1 내지 제4 인공지능 학습 모델의 학습 과정에서 코드북의 파라미터들이 업데이트 될 수 있으며, 학습이 완료된 후 무선 통 신 장치와 기지국은 업데이트된 파라미터들을 포함하는 코드북을 서로 공유할 수 있다. 상술한 하나 이상의 벡터-코드워드들 및 하나 이상의 스칼라-코드워드들을 포함하는 코드북과 달리, 무선 통신 장치는 하나 이상의 벡터-코드워드들만을 포함하는 코드북을 이용하여 양자화를 수행할 수도 있다. 예를 들어, 무선 통신 장치는 채널 상태 및 상향링크 자원 등을 고려하여 벡터-코드워드들 및 하나 이상의 스칼 라-코드워드들을 포함하는 코드북과 하나 이상의 벡터-코드워드들만을 포함하는 코드북 중 어떤 코드북을 이용할 지 결정할 수 있다. 무선 통신 장치가 하나 이상의 벡터-코드워드들만을 포함하는 코드북을 사용하는 경우, 수학식 5에서 c는 항상 1일 수 있다. 도 9은 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차에 대한 순서도를 나타낸다. 도 9는 도 1, 도 2 및 도 3을 참조하여 설명될 수 있다. 도 9를 참조하면, S901 단계에서, 무선 통신 장치가 기지국으로부터 CSI-RS를 수신하고, 무선 통신 장치가 과 기지국 간의 채널을 추정할 수 있다. S902 단계에서, 무선 통신 장치가 제1 인공지능 학습 모델을 이용하여 추정된 채널에 대하여 그룹핑된 속 성들을 포함하는 특징(feuture)을 추출할 수 있다. S903 단계에서, 무선 통신 장치가 제1 인공지능 학습 모델을 이용하여 그룹핑된 속성들의 각 그룹에서 하 나 이상의 속성들을 선택할 수 있다. S904 단계에서, 무선 통신 장치가 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 선택된 선택된 속 성들을 양자화할 수 있다. 또한, 무선 통신 장치는 제2 인공지능 학습 모델에 기초하여 양자화된 속성들에 대한 비트스트림을 생성할 수 있다. 제2 인공지능 학습 모델의 뉴럴 네트워크는 코드북 업데이트 및 비트스트림 생성에 대하여 학습할 수 있다. S905 단계에서, 무선 통신 장치가 양자화된 속성들에 대한 코드북 인덱스 정보 및 선택된 속성들의 위치 정보를 포함하는 비트스트림을 기지국에게 전송할 수 있다. 도 10a는 본 개시의 예시적 실시 예에 따른 양자화의 일 예를 나타낸다. 도 10b는 본 개시의 예시적 실시 예에 따라 그룹핑되고, 중요도에 따라 대각화된 속성들을 나타낸다. 도 10a는 도 1, 도 2 및 도 9가 참조되어 설명될 수 있다. 무선 통신 장치는 제1 인공지능 학습 모델에 기반하여 채널 상태에 대한 속성들을 그룹핑하도록 학습할 수 있다. 도 10a를 참조하면, 특징 벡터 z는 하나 이상의 속성들을 포함하는 하나의 그룹을 가질 수 있다. 무선 통 신 장치가 제1 인공지능 학습 모델에 기반하여 각 그룹의 하나 이상의 속성들 중에서 일부 속성들을 선택 하도록 학습할 수 있다. 구체적으로, 무선 통신 장치가 첫번째 속성 및 다섯번째 속성을 선택하고, 선택한 속성들에 대한 양자화 값(quantization value)의 인덱스 정보 및 위치 정보를 포함하는 비트스트림을 기지국에게 전송할 수 있다. S1001a 단계에서, 무선 통신 장치는 위치 인코딩(position encoding)을 수행할 수 있다. 즉, 무선 통신 장치는 선택한 속성들에 대한 위치 정보를 비트스트림에 포함시킬 수 있다. S1002a 단계에서, 무선 통신 장치는 선택한 속성들에 대한 양자화 값에 대응하는 코드북 인덱스들의 조합을 계산하고, 코드북 인 덱스들의 조합 정보를 비트스트림에 포함시킬 수 있다. 한편, 무선 통신 장치는 블록(block) 단위로 속성을 K개 선택할 수 있다. K는 야의 정수이다. 무선 통신 장치는 선택한 K개의 속성들의 스칼라-벡터 양자화한 값과 위치 정보를 포함하는 비트스트림을 기지국 에게 전송할 수 있다. 블록 단위는 무선 통신 장치와 기지국이 약속한 정보일 수 있다. 무선 통신 장치는 학습 과정에서 다양한 목적을 위해 속성들을 선택할 수 있다. 학습 과정에서 무선 통신 장치가 제1 인공지능 학습 모델에 기초하여 속성들을 선택하기 위한 수학식은 다음 수학식 6과 같이 표현 될 수 있다. [수학식 6]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 7, "content": "수학식 6에서, 첫번 째 항(term)은 수학식 1의 첫번 째 항과 그 목적이 같다. 즉, 첫번 째 항(term)은 기지국 이 추정한 제2 채널 행렬과 무선 통신 장치가 추정한 제1 채널 행렬이 차이가 적게 하기 위함이다. 두 번째 항 또한 수학식 1의 두번 째 항과 같은 목적을 가질 수 있다. 즉, 두 번째 항은 상관성이 높은 속성들 끼리 그룹핑(grouping)을 제1 인공지능 학습 모델의 뉴럴 네트워크에 반영하기 위함이다. 두 번째 항은 여러 형태를 가질 수 있으며, 예를 들면, 다음 수학식 7 및 수학식 8과 같은 예시적 형태를 가질 수 있다. 및 는 각 항의 가중치를 의미할 수 있다. 한편, 본 개시에서 제3 인공지능 학습 모델의 목적함수도 수학식 6 과 같이 표현될 수 있다. [수학식 7]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 8, "content": "[수학식 8]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 9, "content": "다시 수학식 6에서, 세 번째 항은 특징(feature) 내 속성들의 중요도를 제1 인공지능 학습 모델의 뉴럴 네트워 크에 반영하기 위함이다. 즉, 무선 통신 장치는 중요도에 기초하여 각 그룹에서 속성들을 선택할 수 있다. 무선 통신 장치 및 기지국 중 적어도 하나가 중요도를 설정할 수 있다. 예를 들어, 무선 통신 장치 가 속성들의 평균 전력를 학습 과정에 반영할 수 있다. 이러한 경우, 세 번째 항은 다음 수학식 9와 같은 예시적 형태를 가질 수 있다. [수학식 9]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 10, "content": "수학식 9에서, 세 번째 항은 속성들의 평균 전력 오차를 제1 인공지능 학습 모델의 뉴럴 네트워크에 반영할 수 있다. 는 대각 행렬을 의미할 수 있다. 의 대각 성분들은 무선 통신 장치 또는 기지국 에 의해 설정되는 속성들일 수 있다. 도 10b를 참조하면, 수학식 6에서, 첫 번째 항, 두 번째 항 및 세 번째 항에 기초하여 무선 통신 장치 및 기지국이 학습을 완료한 후에, 무선 통신 장치가가 제1 채널 행렬로부터 추출하는 특징의 자기 상관 행렬(covariance matrix)의 형태를 알 수 있다. 즉, 그룹들 간의 상관성이 낮으며, 그룹들이 대각 행렬 형태로 유도될 수 있다. 다시 도 10a를 참조하면, 무선 통신 장치는 수학식 6의 네 번째 항을 이용하여 특징(feature)이 희박 (sparse)한 특성을 가지도록 제1 인공지능 학습 모델의 뉴럴 네트워크를 학습시킬 수 있다. 즉, 무선 통신 장치 는 속성들의 밀도를 고려하여 제1 인공지능 학습 모델의 뉴럴 네트워크를 학습시킬 수 있다. 네 번째 항은 다음 수학식 10, 11,12 및 13과 같은 형태를 가질 수 있으며, 후술하는 형태의 실시 예들로 제한되지 않으며, 다양한 형태를 가질 수 있다. 무선 통신 장치는 그룹에서 0이 아닌 값들을 선택하도록 학습할 수 있다. 일 예로, 무선 통신 장치는 다음 수학식 10을 이용하여 그룹에서 0이 아닌 값을 선택할 수 있다. [수학식 10]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 11, "content": "수학식 10에서, 이중 막대는 노름(norm)을 의미할 수 있다. 에서 0은 L0노름을 의미할 수 있다. 0이 아닌 값들은 활성화된 속성으로 지칭될 수 있으며, 무선 통신 장치는 수학식 10을 이용하여 활성화된 속성들의수를 제1 인공지능 학습 모델의 학습 과정에서 반영할 수 있다. [수학식 11]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 12, "content": "수학식 11에서, 이중 막대는 노름(norm)을 의미할 수 있다. 에서 1은 L1노름을 의미할 수 있다. 무선 통신 장치는 수학식 11을 이용하여 활성화된 속성 값들의 합을 제1 인공지능 학습 모델의 학습 과정에서 반영할 수 있다. [수학식 12]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 13, "content": "수학식 12에서, 이중 막대는 노름(norm)을 의미할 수 있다. 에서 2는 L2노름을 의미할 수 있다. 는 0의 근삿값을 가지는 속성을 0으로 간주하는 함수일 수 있다. 무선 통신 장치는 수 학식 12에 기초하여 값이 큰 속성들만 반영하여 제1 인공지능 학습 모델을 학습시킬 수 있다. [수학식 13]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 14, "content": "수학식 13에서, 이중 막대는 노름(norm)을 의미할 수 있다. 무선 통신 장치는 수학식 13에 기초하여, 활성 화된 속성 블록의 수를 반영하여 제1 인공지능 학습 모델을 학습시킬 수 있다. [수학식 14]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 15, "content": "수학식 14에서, 이중 막대는 노름(norm)을 의미할 수 있다. 무선 통신 장치는 수학식 14에 기초하여 활성 화된 속성 블록들의 합을 반영하여 제1 인공지능 학습 모델을 학습시킬 수 있다. [수학식 15]"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 16, "content": "수학식 15에서, 이중 막대는 노름(norm)을 의미할 수 있다. 는 0의 근삿값을 가지는 블록 을 0으로 간주하는 함수일 수 있다. 무선 통신 장치는 수학식 15에 기초하여 값이 큰 속성 블록들만 반영 하여 제1 인공지능 학습 모델을 학습시킬 수 있다. 무선 통신 장치 및 기지국은 기본적으로 학습 과정에서 제1 채널 행렬과 제2 채널 행렬의 차이를 적 게 하기 위한 목적 및 각 속성들의 상관성에 기초하여 그룹핑을 위한 목적을 모두 고려하여 학습할 수 있다. 또 한, 무선 통신 장치 및 기지국은 추가적으로 그룹핑된 속성들 중에서 일부를 선택하기 위한 목적을 더 고려하여 학습할 수 있으며 일부를 선택하는 기준은 수학식 10 내지 수학식 15에서 상술한 것처럼 다양할 수있다. 무선 통신 장치는 수학식 6의 두 번째 항 내지 네 번째 항 중에서 일부 항만을 선택하여 사용할 수 있다. 즉, 무선 통신 장치는 피드백 오버헤드 및 상향링크 자원 등을 고려하여 제1 인공지능 학습 모델의 목적함 수를 결정할 수 있다. 예를 들어, 무선 통신 장치가 수학식 1과 같이 첫 번째 항 및 두번째 항만을 선택함으로써 속성들에 대해 그룹핑만을 수행할 수 있다. 또 다른 예로, 무선 통신 장치가 첫 번째 항, 두 번째 항 및 네 번째 항을 선 택함으로써 속성들을 그룹핑하고, 각 그룹에서 0이 아닌 값을 가지는 속성들을 선택할 수 있다. 무선 통신 장치 는 선택한 속성들에 대한 위치 정보 및 선택한 속성들의 양자화된 값에 대한 인덱스 정보를 포함하는 비트 스트림을 기지국에게 전송할 수 있다. 도 10c는 본 개시의 예시적 실시 예에 따른 양자화의 일 예를 나타낸다. 도 10c 는 도 1, 도 2, 도3, 도 10a 및 도 10b를 참조하여 설명될 수 있다. 도 10c를 참조하면, 무선 통신 장치는 제1 인공지능 학습 모델에 기반하여 채널 상태에 대한 속성들을 그 룹핑하도록 학습할 수 있다. 도 10c를 참조하면, 특징 벡터 z는 하나 이상의 속성들을 포함하는 하나의 그룹을 가질 수 있다. 무선 통신 장치가 제1 인공지능 학습 모델에 기반하여 각 그룹의 하나 이상의 속성들 중에 서 일부 속성들을 선택하도록 학습할 수 있다. 구체적으로, 무선 통신 장치가 연속적인 속성들을 선택할 수 있다. 도 10c를 참조하면, 무선 통신 장치가 4번 째부터 6번 째까지의 속성들을 선택할 수 있다. 무선 통신 장치는 선택한 속성들에 대한 위치(position) 정보 및 양자화 값(quantization value)의 인덱스 정보를 포함하는 비트스트림을 기지국에게 전송할 수 있다. S1001c 단계에서, 무선 통신 장치는 위치 인코딩(position encoding)을 수행할 수 있다. 즉, 무선 통신 장치는 선택한 연속되는 속성들에 대한 위치 정보를 비트스트림에 포함시킬 수 있다. S1002a 단계에서, 무 선 통신 장치는 선택한 연속되는 속성들에 대한 양자화 값에 대응하는 코드북 인덱스들의 조합을 계산하고, 코드북 인덱스들의 조합 정보를 비트스트림에 포함시킬 수 있다. 도 11은 본 개시의 예시적 실시 예에 따른 기지국의 동작 절차에 대한 순서도를 나타낸다. 도 11을 참조하면, S1101 단계에서, 기지국이 무선 통신 장치로부터 양자화된 속성들에 대한 비트스 트림을 수신할 수 있다. 예를 들어, 기지국이 무선 통신 장치로부터 양자화된 속성들에 대한 코드북 인덱스들의 조합에 대한 정보를 포함하는 비트스트림을 수신할 수 있다. S1102 단계에서, 기지국이 제4 인공지능 학습 모델을 이용하여 비트스트림을 분할할 수 있다. 예를 들어, 기지국이 제4 인공지능 학습 모델에 기초하여 비트스트림을 분할할 수있다. 여기서, 제4 인공지능 학습 모 델의 뉴럴 네트워크는 비트스트림 분할 및 코드북 업데이트를 학습할 수 있다.제3 인공지능 학습 모델을 이용하 여 상기 비트스트림을 분할할 수 있다. S1103 단계에서, 기지국이 제4 인공지능 학습 모델에 기초한 코드북을 이용하여 분할된 비트스트림으로부 터 양자화된 속성들을 추출할 수 있다. S1104 단계에서, 기지국이 제3 인공지능 학습 모델을 이용하여 양자화된 속성들로부터 무선 통신 장치 가 추정한 채널을 추정할 수 있다. 기지국은 상술한 절차들을 반복함으로써 제3 인공지능 학습 모델 및 제4 인공지능 학습 모델을 학습시킬 수 있다. 학습이 완료된 후, 기지국은 파라미터 업데이트가 완료된 제3 인공지능 학습 모델 및 제4 인공지 능 학습 모델을 이용할 수 있다. 도 12는 본 개시의 예시적 실시 예에 따른 무선 통신 장치와 기지국의 학습 절차를 나타낸다. 도 12는 도 1, 도 2 및 도 3을 참조하여 설명될 수 있다. 도 12를 참조하면, S1201는 i번째 학습, S1202는 i+1 번째 학습, S1203은 i+2번째 학습을 나타낸다. 각 단계에서, 제1 인공지능 학습 모델에 기초한 인코더 및 제3 인공지능 학습 모델에 기초한 디코더 는 학습 과정에서 제1 채널 행렬과 제2 채널 행렬의 차이를 적게 하기 위한 목적 및 각 속성들의 상관성에 기초 하여 그룹핑을 위한 목적을 함께 고려하여 학습할 수 있다. 제1 인공지능 학습 모델에 기초한 인코더 및 제3 인공지능 학습 모델에 기초한 디코더는 각각 제1 인공지능 학습 모델 및 제3 인공지능 학습 모델의 뉴 럴 네트워크의 파라미터들을 각각 업데이트할 수 있다. 제1 인공지능 학습 모델과 제3 인공지능 학습 모델은 서로 동일하거나 상이할 수 있다. 또한, 제1 인공지능 학습 모델에 기초한 인코더 및 제3 인공지능 학습 모델에 기초한 디코더는 추가 적으로 그룹핑된 속성들 중에서 일부를 선택하기 위한 목적을 더 고려하여 학습할 수 있으며 일부를 선택하는 기준은 상술한 것처럼 다양할 수 있다. 제2 인공지능 학습 모델에 기초한 인코더 및 제4 인공지능 학습 모델에 기초한 디코더는 학습 과정에 서 특징(feature) z와 벡터-스칼라 코드워드의 조합의 차이가 작게 하기 위한 목적을 고려하여 학습할 수 있다. 제2 인공지능 학습 모델에 기초한 인코더 및 제4 인공지능 학습 모델에 기초한 디코더는 제2 인공지 능 학습 모델 및 데 4 인공지능 학습 모델의 뉴럴 네트워크의 파라미터들을 각각 업데이트 할 수 있다. 즉, 제2 인공지능 학습 모델에 기초한 인코더 및 제4 인공지능 학습 모델에 기초한 디코더는 각각 코드북을 업데이트할 수 있다. 제2 인공지능 학습 모델과 제4 인공지능 학습 모델은 서로 동일하거나 상이할 수 있다. 도 12를 참조하면, 제1 및 제3 인공지능 학습 모델의 뉴럴 네트워크의 업데이트와 제2 및 제4 인공지능 학습 모 델의 뉴럴네트워크의 업데이트는 병렬적으로 업데이트될 수 있다. 제2 및 제4 인공지능 학습 모델의 뉴럴 네트 워크는 코드북 업데이트를 위한 뉴럴 네트워크일 수 있다. 도 13은 본 개시의 예시적 실시 예에 따른 무선 통신 장치를 나타내는 블록도이다. 도 13은 도 1, 도 2 및 도 3 을 참조하여 설명될 수 있다. 도 13을 참조하면, 무선 통신 장치는 프로세서, RFIC 및 메모리를 포함할 수 있다. 설명의 편의상 하나의 프로세서, RFIC 및 메모리를 도시하였으나, 프로세서, RFIC 및 메모 리는 복수개일 수 있으며 상술한 실시 예로 제한되지 않는다. 프로세서는 RFIC 및 메모리 를 제어할 수 있으며, 본 개시의 무선 통신 장치의 동작 방법 및 동작 순서도들을 구현하도록 구성될 수 있 다. 무선 통신 장치는 복수의 안테나들을 구비할 수 있으며, RFIC는 하나 이상의 안테나들을 통해 무선 신 호를 송수신 할 수 있다. 복수의 안테나들 중 적어도 일부는 송신 안테나에 상응할 수 있다. 송신 안테나는, 무 선 통신 장치가 아닌 외부 장치(예를 들어, 다른 단말(user equipment, UE), 또는 기지국(base station, BS))에게 무선 신호를 송신할 수 있다. 복수의 안테나들 중 나머지 적어도 일부는 수신 안테나에 상응할 수 있 다. 수신 안테나는 상기 외부 장치로부터 무선 신호를 수신할 수 있다. 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 프로세서는 RFIC를 통해 기지국으로부터 기 준 신호(reference signal)를 수신할 수 있다. 본 예시적 실시 예에서 무선 통신 장치는 무선 통신 장치 에 대응될 수 있다. 프로세서는 상기 기준 신호에 기초하여 상기 무선 통신 장치와 상기 기지국 간의 제1 채널을 추정할 수 있다. 프로세서는 상기 무선 통신 장치에 의해 추정된 제1 채널 및 상기 기지국이 상기 제1 채널에 대하여 추정한 제2 채널과의 차이를 작게 하고, 속성들(attributes)을 그 룹핑(grouping)하도록 학습된 제1 인공지능 학습 모델에 기초하여 상기 제1 채널로부터 그룹핑된 상기 속성들 (attributes)을 포함하는 특징(feature)을 추출할 수 있다. 상기 무선 통신 장치에 의해 추정된 제1 채널 및 상기 기지국이 상기 제1 채널에 대하여 추정한 제2 채널과의 차이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하도록 학습된 제1 인공지능 학습 모델은 메모리에 저장될 수 있다. 프로세서는 제2 인공지능 학습 모델에 기초한 코드북을 이용하여 상기 속성들을 양자화(quantization)함으로써 상기 속성들의 그룹 각각에 대한 상기 코드북의 인덱스들의 조합을 생성할 수 있다. 프로세서는 RFIC를 통해 상기 코 드북의 상기 인덱스들의 조합 정보를 포함하는 비트스트림을 상기 기지국에게 전송할 수 있다. 코드북은 복수의 벡터-코드워드들(vector-codewords) 및 복수의 스칼라-코드워드들(scalar-codewords)을 포함할 수 있다. 상기 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드 워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하도록 학습된 인공지능 학습 모델일 수 있다. 학습된 제2 인공지능 학습 모델은 메모리에 저장될 수 있다. 본 개시의 다른 예시적 실시 예에 따른 무선 통신 장치의 프로세서는 RFIC를 통해 다른 무선 통 신 장치로부터 양자화된 속성들에 대한 코드북 인덱스들의 조합에 대한 정보를 포함하는 비트스트림을 수 신할 수 있다. 본 예시적 실시 예에 따른 무선 통신 장치는 기지국에 대응할 수 있다. 프로세서 는 무선 통신 장치가 추정한 제1 채널 및 무선 통신 장치가 상기 제1 채널을 추정한 제2 채널과의 차 이를 작게 하고, 속성들(attributes)을 그룹핑(grouping)하도록 학습된 제3 인공지능 학습 모델을 이용하여 상 기 비트스트림을 분할할 수 있다. 상기 RFIC가 제4 인공지능 학습 모델에 기초한 코드북을 이용하여 상기분할된 비트스트림으로부터 상기 양자화된 속성들을 추출할 수 있다. 상기 프로세서가 상기 제3 인공지능 학습 모델을 이용하여 상기 양자화된 속성들로부터 상기 제2 채널을 획득할 수 있다. 상기 양자화된 속성들은 제1 인공지능 학습 모델에 기초하여 상기 제1 채널로부터 추출된 그룹핑된 속성들(attributes)이 제2 인공지능 학습 모델에 기초한 코드북에 기반하여 양자화된 속성들일 수 있다. 코드북은 복수의 벡터-코드워드들(vector- codewords) 및 복수의 스칼라-코드워드들(scalar-codewords)을 포함할 수 있다. 제2 인공지능 학습 모델은 상기 코드북의 상기 복수의 벡터-코드워드들 및 상기 복수의 스칼라-코드워드들의 조합과 상기 양자화된 속성들 간의 차이를 작게 하기 위한 인공지능 학습 모델일 수 있다. 도 14는 본 개시의 예시적 실시 예에 따른 전자 장치를 나타내는 블록도이다. 도 14를 참조하면, 전자 장치 는 메모리, 프로세서 유닛(Processor Unit), 입출력 제어부, 표시부, 입력 장치 및 통신 처리부를 포함할 수 있다. 여기서, 메모리는 복수 개 존재할 수도 있다. 각 구성요소 에 대해 살펴보면 다음과 같다. 메모리는 전자 장치의 동작을 제어하기 위한 프로그램을 저장하는 프로그램 저장부 및 프로그램 수행 중에 발생되는 데이터를 저장하는 데이터 저장부를 포함할 수 있다. 데이터 저장부는 애플리케이션 프로그램, 채널 정보 피드백 프로그램 프로그램의 동작에 필요한 데이터를 저장할 수 있다. 프로그램 저장부는 애플리케이션 프로그램, 채널 정보 피드백 프로그램 프로그램을 포함할 수 있다. 여기 서, 프로그램 저장부에 포함되는 프로그램은 명령어들의 집합으로 명령어 세트(instruction set)로 표현할 수도 있다. 채널 정보 피드백 프로그램 애플리케이션 프로그램은 전자 장치에서 동작하는 애플리케이션 프로그램을 포함한다. 즉, 애플리케이션 프로그램은 프로세서에 의해 구동되는 애플리케이션의 명령어를 포함할 수 있다. 채널 정보 피드백 프로그램은 도 1 내지 도 12에서 상술한 실시 예들에 따른 채널 상태 정보 전송을 위한 프로그램일 수 있 다. 주변 장치 인터페이스는 기지국의 입출력 주변 장치와 프로세서 및 메모리 인터페이스의 연결을 제어할 수 있다. 프로세서는 적어도 하나의 소프트웨어 프로그램을 사용하여 기지국이 해당 서비스를 제공 하도록 제어한다. 이때, 프로세서는 메모리에 저장되어 있는 적어도 하나의 프로그램을 실행하여 해 당 프로그램에 대응하는 서비스를 제공할 수 있다. 입출력 제어부는 표시부 및 입력 장치 등의 입출력 장치와 주변 장치 인터페이스 사이에 인터페이스를 제공할 수 있다. 표시부는 상태 정보, 입력되는 문자, 동영상(moving picture) 및 정지 영상 (still picture) 등을 표시한다. 예를 들어, 표시부는 프로세서에 의해 구동되는 응용프로그램 정보 를 표시할 수 있다. 입력 장치는 전자 장치의 선택에 의해 발생하는 입력 데이터를 입출력 제어부를 통해 프로세서 유닛 으로 제공할 수 있다. 이때, 입력 장치는 적어도 하나의 하드웨어 버튼을 포함하는 키패드 및 터치 정보를 감지하는 터치 패드 등을 포함할 수 있다. 예를 들어, 입력 장치는 터치 패드를 통해 감지한 터치, 터치 움직임, 터치 해제 등의 터치 정보를 입출력 제어부를 통해 프로세서로 제공할 수 있다. 전자 장치는 음성 통신 및 데이터 통신을 위한 통신 기능을 수행하는 통신 처리부를 포함할 수 있다. 이상에서와 같이 도면과 명세서에서 예시적인 실시 예들이 개시되었다. 본 명세서에서 특정한 용어를 사용하여 실시 예들을 설명되었으나, 이는 단지 본 개시의 기술적 사상을 설명하기 위한 목적에서 사용된 것이지 의미 한"}
{"patent_id": "10-2023-0004977", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 17, "content": "정이나 특허청구범위에 기재된 본 개시의 범위를 제한하기 위하여 사용된 것은 아니다. 그러므로 본 기술분야의 통상의 지식을 가진 자라면 이로부터 다양한 변형 및 균등한 타 실시 예가 가능하다는 점을 이해할 것이다. 따 라서, 본 개시의 진정한 기술적 보호범위는 첨부된 특허청구범위의 기술적 사상에 의해 정해져야 할 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6 도면7 도면8 도면9 도면10a 도면10b 도면10c 도면11 도면12 도면13 도면14"}
{"patent_id": "10-2023-0004977", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 예시적 실시 예에 따른 기지국과 무선 통신 장치간 신호 송수신 동작을 나타낸다. 도 2는 본 개시의 예시적 실시 예에 따른 기지국 및 무선 통신 장치의 블록도를 나타낸다. 도 3은 본 개시의 예시적 실시 예에 따른 기지국 및 무선 통신 장치의 블록도를 나타낸다. 도 4는 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차에 대한 순서도를 나타낸다. 도 5는 본 개시의 예시적 실시 예에 따른 무선 통신 장치가 추정된 채널로부터 추출한 특징(feature)들의 일 예 를 나타낸다. 도 6은 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차의 일 예를 나타낸다. 도 7은 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차의 일 예를 나타낸다. 도 8은 본 개시의 예시적 실시 예에 따른 그룹핑된 특징의 양자화를 나타낸다. 도 9은 본 개시의 예시적 실시 예에 따른 무선 통신 장치의 동작 절차에 대한 순서도를 나타낸다. 도 10a는 본 개시의 예시적 실시 예에 따른 양자화의 일 예를 나타낸다. 도 10b는 본 개시의 예시적 실시 예에 따라 그룹핑되고, 중요도에 따라 대각화된 속성들을 나타낸다. 도 10c는 본 개시의 예시적 실시 예에 따른 양자화의 일 예를 나타낸다. 도 11은 본 개시의 예시적 실시 예에 따른 기지국의 동작 절차에 대한 순서도를 나타낸다. 도 12는 본 개시의 예시적 실시 예에 따른 무선 통신 장치와 기지국의 학습 절차를 나타낸다. 도 13은 본 개시의 예시적 실시 예에 따른 무선 통신 장치를 나타내는 블록도이다. 도 14는 본 개시의 예시적 실시 예에 따른 전자 장치를 나타내는 블록도이다."}
