{"patent_id": "10-2022-0055199", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0155703", "출원번호": "10-2022-0055199", "발명의 명칭": "차량용 루프 구조체", "출원인": "현대자동차주식회사", "발명자": "허철희"}}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "차체의 차폭 방향에 따른 양측에 각각 구비된 사이드 구조체에 마운팅 되는 차량용 루프 구조체로서,상기 양측 사이드 구조체의 사이에 배치되는 링 레인포스 멤버; 및상기 링 레인포스 멤버와, 상기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러에 연결되는 복수의 메인 루프 레일 멤버들;을 포함하는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 복수의 메인 루프 레일 멤버들은,상기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러의 연장선 상에서 상기 링 레인포스 멤버의 각 모서리부와 연결되는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 복수의 메인 루프 레일 멤버들은,상기 링 레인포스 멤버의 각 모서리부와, 상기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러를 방사 상으로 연결하는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 양측 사이드 구조체와 상기 링 레인포스 멤버에 차폭 방향을 따라 연결되는 복수의 서브 루프 레일 멤버들을 더 포함하는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4 항에 있어서,상기 복수의 서브 루프 레일 멤버들은,상기 양측 사이드 구조체의 각 루프 사이드와, 상기 링 레인포스 멤버의 차폭 방향에 따른 양측 사이드부에 차폭 방향으로 연결되는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제4 항에 있어서,상기 복수의 서브 루프 레일 멤버들은,상기 양측 사이드 구조체에 각각 구비된 적어도 하나의 도어 지지 필러와, 상기 링 레인포스 멤버의 차폭 방향에 따른 양측 사이드부에 차폭 방향으로 연결되는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,공개특허 10-2023-0155703-3-상기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러의 상부에 차폭 방향으로 연결되는 프론트 루프 레일및 리어 루프 레일을 더 포함하는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7 항에 있어서,상기 복수의 메인 루프 레일 멤버들은,상기 링 레인포스 멤버의 각 모서리부와, 상기 각 프론트 루프 레일 및 리어 루프 레일의 양 단부에 연결되는차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7 항에 있어서,상기 복수의 메인 루프 레일 멤버들은,상기 각 프론트 루프 레일 및 리어 루프 레일의 필러 접합 단부에 접합되는 제1 접합 단부와,상기 링 레인포스 멤버의 각 모서리부에 접합되는 제2 접합 단부를 포함하는 차량용 루프 구조체."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "차량의 차량용 루프 구조체가 개시된다. 개시된 본 발명의 예시적인 일 실시 예에 따른 차량용 루프 구조체는, 차체의 차폭 방향에 따른 양측에 각각 구비된 사이드 구조체에 마운팅 되는 것으로서, i)양측 사이드 구조체의 사이에 배치되는 링 레인포스 멤버와, ii)링 레인포스 멤버와, 양측 사이드 구조체의 각 프론트 필러 및 리어 필 러에 연결되는 복수의 메인 루프 레일 멤버들을 포함할 수 있다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 실시 예는 차량의 차체에 관한 것으로서, 보다 상세하게는 PBV(Purpose Built Vehicle) 차량용 차체 의 루프 구조체에 관한 것이다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 들어 자동차 업계에서는 인간 중심의 역동적 미래도시 구현을 위한 신개념의 미래 모빌리티 비전을 소개하 고 있다. 이러한 미래 모빌리티 솔루션 중의 하나가 목적 기반 모빌리티로서의 PBV(Purpose Built Vehicle) 차 량이다. PBV 차량은 전기차(EV) 기반의 친환경 이동 차량을 예로 들 수 있다. 이러한 PBV 차량은 인공지능 및 무인 자율 주행 등을 활용해 상황 별 최적 경로를 설정할 수 있으며, 군집주행도 할 수 있다. 한편, PBV 차량은 무인 자율주행 방식으로 지상에서 목적지까지 이동하는 시간 동안 사용자에게 다양한 맞춤형 서비스를 제공할 수 있다. 이를 위하여 PBV 차량은 넓은 실내 공간을 지닌 1 박스(one box) 디자인으로 제작되 고 있다. 더 나아가, PBV 차량은 실내의 개방감을 사용자에게 제공하기 위하여 차체의 루프 구조체에 글라스를 적용할 수 도 있다. 당 업자는 이러한 글라스를 '중정(courtyard) 루프 글라스'또는 선루프 글라스'라고도 한다. 이하에서 는 편의 상 '루프 글라스'라고 한다. PBV 차량의 루프 구조체는 루프 글라스를 장착할 수 있도록, 링 레인포스 멤버와 횡 방향 루프 레일을 구비하고 있다. 여기서, 루프 구조체는 1 박스 디자인의 차량에 넓은 실내 공간의 개방감을 사용자에게 제공하기 위하여, 대면적의 루프 글라스를 설치할 수 있는 링 레인포스 멤버를 필요로 한다. 이와 같이 대면적의 루프 글라스에 대응되는 크기의 링 레인포스 멤버는 차체의 양측 사이드 구조체(예, 루프 사이드)에 연결될 수 있다. 따라서, 종래 기술에 따른 PBV 차량은 횡 방향 루프 레일을 장착하기 위한 설치 공 간이 부족하기 때문에, 차체의 전체적인 강성을 확보하지 못하고 있는 실정이다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "이 배경기술 부분에 기재된 사항은 발명의 배경에 대한 이해를 증진하기 위하여 작성된 것으로서, 이 기술이 속 하는 분야에서 통상의 지식을 가진 자에게 이미 알려진 종래 기술이 아닌 사항을 포함할 수 있다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 3, "content": "발명의 내용"}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 실시 예들은 대면적의 루프 글라스를 장착함에 있어서, 차체의 전체적인 강성을 확보할 수 있도록 한 차량용 루프 구조체를 제공한다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 차량용 루프 구조체는, 차체의 차폭 방향에 따른 양측에 각각 구비된 사이드 구조체 에 마운팅 되는 것으로서, i)상기 양측 사이드 구조체의 사이에 배치되는 링 레인포스 멤버와, ii)상기 링 레인 포스 멤버와, 상기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러에 연결되는 복수의 메인 루프 레일 멤버 들을 포함할 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 복수의 메인 루프 레일 멤버들은 상 기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러의 연장선 상에서 상기 링 레인포스 멤버의 각 모서리부 와 연결될 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 복수의 메인 루프 레일 멤버들은 상 기 링 레인포스 멤버의 각 모서리부와, 상기 양측 사이드 구조체의 각 프론트 필러 및 리어 필러를 방사 상으로 연결할 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체는, 상기 양측 사이드 구조체와 상기 링 레인포스 멤 버에 차폭 방향을 따라 연결되는 복수의 서브 루프 레일 멤버들을 더 포함할 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 복수의 서브 루프 레일 멤버들은 상 기 양측 사이드 구조체의 각 루프 사이드와, 상기 링 레인포스 멤버의 차폭 방향에 따른 양측 사이드부에 차폭 방향으로 연결될 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 복수의 서브 루프 레일 멤버들은 상 기 양측 사이드 구조체에 각각 구비된 적어도 하나의 도어 지지 필러와, 상기 링 레인포스 멤버의 차폭 방향에 따른 양측 사이드부에 차폭 방향으로 연결될 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 양측 사이드 구조체의 각 프론트 필 러 및 리어 필러의 상부에 차폭 방향으로 연결되는 프론트 루프 레일 및 리어 루프 레일을 더 포함할 수 있다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 복수의 메인 루프 레일 멤버들은 상 기 링 레인포스 멤버의 각 모서리부와, 상기 각 프론트 루프 레일 및 리어 루프 레일의 양 단부에 연결될 수 있 다. 또한, 본 발명의 실시 예에 따른 상기 차량용 루프 구조체에 있어서, 상기 복수의 메인 루프 레일 멤버들은 상 기 각 프론트 루프 레일 및 리어 루프 레일의 필러 접합 단부에 접합되는 제1 접합 단부와, 상기 링 레인포스 멤버의 각 모서리부에 접합되는 제2 접합 단부를 포함할 수 있다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예들은 1 박스 디자인으로 구성된 차체의 전체적인 연결 강건성 및 골격 강성을 확보할 수 있다. 그 외에 본 발명의 실시 예로 인해 얻을 수 있거나 예측되는 효과에 대해서는 본 발명의 실시 예에 대한 상세한 설명에서 직접적 또는 암시적으로 개시하도록 한다. 즉 본 발명의 실시 예에 따라 예측되는 다양한 효과에 대해 서는 후술될 상세한 설명 내에서 개시될 것이다."}
{"patent_id": "10-2022-0055199", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 여기에서 사용되는 용어는 오직 특정 실시예들을 설명하기 위한 목적이고, 본 개시를 제한하는 것으로 의도되지 않는다. 여기에서 사용되는 바와 같이, 단수 형태들은, 문맥상 명시적으로 달리 표시되지 않는 한, 복수 형태들 을 또한 포함하는 것으로 의도된다. 본 명세서에서 사용되는 '포함한다' 및/또는 '포함하는' 이라는 용어는 명시된 특징들, 정수, 단계들, 작동, 엘 리먼트들 및/또는 컴포넌트들의 존재를 나타내지만, 하나 이상의 다른 특징, 정수, 단계들, 작동, 컴포넌트들, 및/또는 이들의 그룹들의 존재 또는 부가를 배제하는 것은 아니라는 것이 또한 이해되어야 할 것이다. 본 명세 서에 사용되는 바와 같이, '및/또는' 이라는 용어는 연관되어 나열된 하나 이상의 항목들 중 임의의 하나 또는 모든 조합들을 포함한다. 본 명세서에서 '결합된' 이라는 용어는 컴포넌트들이 용접, SPR(Self Piercing Rivet), FDS(Flow Drill Screw), 구조용 접착제 등에 의하여 상호 간에 직접 연결되거나 또는 하나 이상의 매개 컴포넌트들을 통해 간접적으로 연결되는 두 개의 컴포넌트들 간의 물리적 관계를 표시한다. 여기에서 사용되는 바와 같은 차량', '차량의', '자동차' 또는 본 명세서에서 사용되는 다른 유사 용어는 일반 적으로, 승용 차량, 스포츠 유틸리티 차량(SUV), 버스, 트럭, 다양한 상용 차량을 포함하는 자동차(passenger automobiles)를 포함하고, 하이브리드 자동차, 전기 자동차, 하이브리드 전기 자동차, 전기차 기반의 PBV 차량 (Purpose Built Vehicle), 수소 동력 차량 및 다른 대체 연료 차량(예를 들어, 석유가 아닌 다른 리소스로부터 유도된 연료)을 포함한다. 이하, 첨부한 도면을 참고로 하여 본 발명의 실시예들에 대하여 상세히 설명한다. 도 1은 본 발명의 실시 예에 따른 차량용 루프 구조체를 도시한 결합 사시도이고, 도 2는 본 발명의 실시 예에 따른 차량용 루프 구조체를 도시한 분해 사시도이고, 도 3은 본 발명의 실시 예에 따른 차량용 루프 구조체를 도시한 평면 구성도이다. 도 1 내지 도 3을 참조하면, 본 발명의 실시 예에 따른 차량용 루프 구조체는 예를 들면, 목적 기반 모빌 리티 차량(Purpose Built Vehicle: 이하, 'PBV 차량'이라고 한다.)의 차체에 적용될 수 있다. 여기서, 상기 PBV 차량은 지상에서 목적지까지 이동하는 시간 동안 탑승객에게 필요한 맞춤형 서비스를 제공하 는 전기 차 기반의 친환경 이동 차량일 수 있다. 하나의 예에서, 상기 PBV 차량은 무인 자율주행 방식으로 지상에서 목적지까지 이동하는 시간 동안 사용자에게 다양한 맞춤형 서비스를 제공하는 라이프 모듈 차량으로 활용될 수 있다. 이러한 라이프 모듈 차량을 당업자는 통상'로보 택시', '로보 셔틀'또는 '헤일링(hailing) 차량'이라고도 한다. 이와 같은 PBV 차량은 넓은 실내 공간을 지닌 1 박스(one box) 디자인으로 제작될 수 있다. 또한, 상기 PBV 차 량은 넓은 실내 공간을 제공하기 위하여 마주보기 타입의 시트를 적용할 수도 있다. 상기 PBV 차량의 차체는 스케이트 보드 타입의 언더 바디(도시하지 않음)(당 업자는 통상적으로'롤링 샤시' 또는 '샤시 프레임'이라고도 한다.)와, 언더 바디에 조립되는 어퍼 바디를 포함하고 있다. 상기 언더 바디는 배터리 어셈블리(도시하지 않음) 및 구동모터 등이 탑재될 수 있다. 그리고, 상기 어퍼 바디 는 언더 바디에 결합되는 BIW 바디로서, 넓은 실내 공간의 캐빈을 구성할 수 있다. 본 명세서에서, 하기의 구성요소를 설명하기 위한 기준 방향은 하나의 예에서, 차체 전후 방향(예, 차체 길이 방향 또는 종 방향), 차폭 방향(예, 횡 방향) 및 상하 방향(예, 높이 방향)으로 설정될 수 있다. 또한, 본 명세서에서, 구성요소의 '상단부', '상부', '상단' 또는 '상부 면'은 도면에서 상대적으로 상측에 있 는 구성요소의 단부, 부, 단, 또는 면을 나타내고, 구성요소의 '하단부', '하부', '하단' 또는 '하부 면'은 도 면에서 상대적으로 하측에 있는 구성요소의 단부, 부, 단, 또는 면을 나타낸다. 더 나아가, 본 명세서에서 구성요소의 단(예를 들어, 일측 단, 다른 일측 단 또는 양단 등)은 임의의 한 방향으 로 구성요소의 끝을 나타내며, 구성요소의 단부(예를 들어, 일측 단부, 다른 일측 단부 또는 양 단부 등)는 그 끝을 포함하는 구성요소의 일정 부분을 나타낸다. 한편, 상기한 바와 같은 어퍼 바디는 차폭 방향에 따른 양측에 각각 구비된 사이드 구조체(이하에서는 편의 상 '양측 사이드 구조체'라고 한다.)와, 본 발명의 실시 예에 따른 차량용 루프 구조체를 포함하고 있다. 상기 양측 사이드 구조체는 프론트 필러, 리어 필러, 루프 사이드, 그리고 적어도 하나의 도어 지지 필러를 각각 포함하고 있다. 상기 프론트 필러와 리어 필러는 차체에서 상대적으로 강성이 큰 기둥으로 구비된다. 상기 루프 사 이드는 프론트 필러 및 리어 필러의 상부에 차체 전후 방향을 따라 연결된다. 그리고, 상기 적어도 하나의 도어 지지 필러는 하나의 예에서, 슬라이딩 도어를 지지하도록 되어 있으며, 루프 사이드와 상 하 방향을 따라 연결된다. 본 발명의 실시 예에 따른 차량용 루프 구조체는 양측 사이드 구조체의 상부에 마운팅 된다. 이와 같 은 차량용 루프 구조체는 PBV 차량의 실내의 개방감을 사용자에게 제공하기 위한 대면적의 루프 글라스(도 시하지 않음)를 포함할 수 있다. 이와 같은 본 발명의 실시 예에 따른 차량용 루프 구조체는 대면적의 루프 글라스를 장착함에 있어서, 차 체의 전체적인 강성을 확보할 수 있는 구조로 이루어진다. 이를 위해 본 발명의 실시 예에 따른 차량용 루프 구조체는, 프론트 루프 레일, 리어 루프 레일, 링 레인포스 멤버, 복수의 메인 루프 레일 멤버들, 그리고 복수의 서브 루프 레일 멤버들을 포함하 고 있다. 본 발명의 실시 예에서, 상기 프론트 루프 레일은 양측 사이드 구조체의 각 프론트 필러의 상부에 차폭 방향으로 연결된다. 본 발명의 실시 예에서, 상기 리어 루프 레일은 양측 사이드 구조체의 각 리어 필러의 상부에 차폭 방향으로 연결된다. 여기서, 상기 프론트 루프 레일 및 리어 루프 레일은 루프 사이드와 연결된 루프 패널(도시하지 않 음)과 결합(예, 용접)될 수 있다. 본 발명의 실시 예에서, 상기 링 레인포스 멤버는 대면적의 루프 글라스(도시하지 않음)를 차량용 루프 구 조체에 장착하도록 되어 있다. 상기 링 레인포스 멤버는 양측 사이드 구조체의 루프 사이드와 연결된 루프 패널(도시하지 않음)에 결합(예, 용접)될 수 있다. 이러한 링 레인포스 멤버는 양측 사이드 구조체의 사이, 그리고 프론트 루 프 레일 및 리어 루프 레일의 사이에 배치된다. 하나의 예에서, 상기 링 레인포스 멤버는 글라스 장착 홀이 형성된 사각 형상의 멤버로 구비될 수 있다. 이러한 링 레인포스 멤버는 양측 사이드부, 프론트부, 리어부, 그리고 복수의 모서리부 들을 포함하고 있다. 상기 양측 사이드부는 링 레인포스 멤버의 차폭 방향에 따른 양측에 각각 구비되며, 차체 전후 방향을 따라 배치된다. 상기 프론트부는 양측 사이드부의 전방 측 단부에 차폭 방향으로 연결된다. 상기 리어 부는 양측 사이드부의 후방 측 단부에 차폭 방향으로 연결된다. 그리고, 복수의 모서리부들은 양측 사이드부, 프론트부 및 리어부의 연결 부위에 각각 형성된다.본 발명의 실시 예에서, 상기 복수의 메인 루프 레일 멤버들은 양측 사이드 구조체와 링 레인포스 멤버 를 연결하도록 되어 있다. 더 나아가, 본 발명의 실시 예에 의한 상기 복수의 메인 루프 레일 멤버들은 양측 사이드 구조체에 입 력되는 하중을 프론트 필러 및 리어 필러를 통해 링 레인포스 멤버에 전달하도록 되어 있다. 이와 같은 복수의 메인 루프 레일 멤버들의 각각은 판재 형상으로 구비될 수 있다. 그리고, 상기 복수의 메 인 루프 레일 멤버들은 루프 패널(도시하지 않음)의 하부 면에 결합될 수 있다. 상기 복수의 메인 루프 레일 멤버들은 링 레인포스 멤버와, 양측 사이드 구조체의 각 프론트 필러 및 리어 필러에 실질적으로 연결된다. 상기 복수의 메인 루프 레일 멤버들은 양측 사이드 구조체의 각 프론트 필러 및 리어 필러의 연장선 상에서 링 레인포스 멤버의 각 모서리부와 연결될 수 있다. 더 나아가, 상기 복수의 메인 루프 레일 멤버들은 링 레인포스 멤버의 각 모서리부와, 양측 사이드 구조체의 각 프론트 필러 및 리어 필러에 방사 상으로 연결될 수 있다. 구체적으로, 상기 복수의 메인 루프 레일 멤버들은 링 레인포스 멤버의 각 모서리부와, 각 프론트 루프 레일 및 리어 루프 레일의 양 단부에 연결(예, 접합)될 수 있다. 이와 같은 복수의 메인 루프 레일 멤버들은 도 4에 도시된 바와 같이, 제1 접합 단부와 제2 접합 단부 를 포함하고 있다. 상기 제1 접합 단부는 각 프론트 루프 레일 및 리어 루프 레일의 필러 접합 단부(21, 31)에 접합 (예, 스폿 용접)될 수 있다. 그리고, 상기 제2 접합 단부는 링 레인포스 멤버의 각 모서리부에 접 합(예, 스폿 용접)될 수 있다. 여기서, 상기 제1 접합 단부 및 제2 접합 단부는 복수의 메인 루프 레일 멤버들의 단면에 일체로 형성된 접합 플랜지를 포함할 수 있다. 본 발명의 실시 예에서, 상기 복수의 서브 루프 레일 멤버들은 복수의 메인 루프 레일 멤버들과 함께, 양측 사이드 구조체와 링 레인포스 멤버를 방사 상으로 연결하도록 되어 있다. 상기 복수의 서브 루프 레일 멤버들은 양측 사이드 구조체와 링 레인포스 멤버에 차폭 방향을 따라 연결된다. 하나의 예에서, 상기 복수의 서브 루프 레일 멤버들은 양측 사이드 구조체의 각 루프 사이드와, 링 레인포스 멤버의 양측 사이드부에 차폭 방향으로 연결될 수 있다. 여기서, 상기 복수의 서브 루프 레일 멤버들 중 하나가 한쪽 사이드 구조체의 루프 사이드와, 링 레인포스 멤버의 한쪽 사이드부에 연결될 수 있다. 그리고, 상기 복수의 서브 루프 레일 멤버들 중 다른 하나가 다른 한쪽 사이드 구조체의 루프 사이드와, 링 레인포스 멤버의 다른 한쪽 사이드부 에 연결될 수 있다. 이하, 상기와 같이 구성되는 본 발명의 실시 예에 따른 차량용 루프 구조체의 작용을 도 1 내지 도 4를 참 조하여 상세하게 설명한다. 우선, 본 발명의 실시 예에 따른 차량용 루프 구조체에 따르면, 링 레인포스 멤버가 복수의 메인 루프 레일 멤버들을 통해 양측 사이드 구조체의 각 프론트 필러 및 리어 필러에 연결된다. 여기서, 상기 복수의 메인 루프 레일 멤버들은 프론트 루프 레일 및 리어 루프 레일을 통해 링 레 인포스 멤버의 각 모서리부와, 양측 사이드 구조체의 각 프론트 필러 및 리어 필러에 연결 될 수 있다. 또한, 본 발명의 실시 예에 따른 차량용 루프 구조체에 따르면, 복수의 서브 루프 레일 멤버들이 양측 사이드 구조체의 각 루프 사이드와, 링 레인포스 멤버의 양측 사이드부에 차폭 방향으로 연결 된다. 따라서, 본 발명의 실시 예에 따른 차량용 루프 구조체에 따르면, 복수의 메인 루프 레일 멤버들과 복 수의 서브 루프 레일 멤버들이 양측 사이드 구조체와 링 레인포스 멤버를 방사 상으로 연결할 수있다. 이로써, 본 발명의 실시 예에 따른 차량용 루프 구조체에 의하면, 링 레인포스 멤버에 대면적의 루프 글라스가 장착됨에 따라, PBV 차량은 대면적의 루프 글라스를 통해 사용자에게 실내의 개방감을 제공할 수 있다. 지금까지 설명한 바와 같은 본 발명의 실시 예에 따른 차량용 루프 구조체는 양측 사이드 구조체의 전 방 및 후방에서 입력되는 하중을 각각의 프론트 필러, 리어 필러, 그리고 복수의 메인 루프 레일 멤버 들 통해 링 레인포스 멤버로 전달할 수 있다. 또한, 본 발명의 실시 예에 따른 차량용 루프 구조체는 링 레인포스 멤버로 전달된 하중을 복수의 서 브 루프 레일 멤버들과, 양측 사이드 구조체의 루프 사이드를 통해 적어도 하나의 도어 지지 필러 에 전달할 수 있다. 이에 따라, 본 발명의 실시 예에 따른 차량용 루프 구조체는 1 박스 디자인으로 구성된 차체의 전체적 인 연결 강건성(예, 강성 또는 강도), 골격 강성, 내구성, 충격 흡수성, 그리고 NVH 성능을 확보할 수 있다. 도 5는 본 발명의 다른 실시 예에 따른 차량용 루프 구조체를 도시한 결합 사시도이고, 도 6은 본 발명의 다른 실시 예에 따른 차량용 루프 구조체를 도시한 분해 사시도이고, 도 7은 본 발명의 다른 실시 예에 따른 차량용 루프 구조체를 도시한 평면 구성도이다. 도면에서 전기 실시 예와 동일한 구성에 대해서는 동일한 도면 부호를 부여한다. 도 5 내지 도 7을 참조하면, 본 발명의 다른 실시 예에 따른 차량용 루프 구조체는 양측 사이드 구조체 의 적어도 하나의 도어 지지 필러와, 링 레인포스 멤버의 양측 사이드부에 차폭 방향으로 연결 되는 복수의 서브 루프 레일 멤버들을 포함할 수 있다. 본 발명의 다른 실시 예에 따른 차량용 루프 구조체에서, 복수의 메인 루프 레일 멤버들은 전기 실시 예에서와 같으므로, 자세한 설명은 생략하기로 한다. 여기서, 상기 적어도 하나의 도어 지지 필러는 양측 사이드 구조체의 각각에 한 쌍으로 구비될 수 있다. 본 발명의 다른 실시 예에서, 상기 복수의 서브 루프 레일 멤버들 중 한 쌍은 한쪽 사이드 구조체의 한 쌍의 도어 지지 필러들과, 링 레인포스 멤버의 한쪽 사이드부에 연결될 수 있다. 그리고, 상기 복수의 서브 루프 레일 멤버들 중 다른 한 쌍은 다른 한쪽 사이드 구조체의 한 쌍의 도어 지지 필러 들과, 링 레인포스 멤버의 다른 한쪽 사이드부에 연결될 수 있다. 따라서, 본 발명의 다른 실시 예에 따른 차량용 루프 구조체는 양측 사이드 구조체의 전방 및 후방에 서 입력되는 하중을 각각의 프론트 필러, 리어 필러, 그리고 복수의 메인 루프 레일 멤버들 통해 링 레인포스 멤버로 전달할 수 있다. 또한, 본 발명의 다른 실시 예에 따른 차량용 루프 구조체는 상기 링 레인포스 멤버로 전달된 하중을 복수의 서브 루프 레일 멤버들을 통해 적어도 하나의 도어 지지 필러에 직접적으로 전달할 수 있다. 상술한 바와 같은 본 발명의 다른 실시 예에 따른 차량용 루프 구조체의 나머지 구성 및 작용 효과는 전기 실시 예와 같으므로, 자세한 설명은 생략하기로 한다. 이상을 통해 본 발명의 바람직한 실시 예에 대하여 설명하였지만, 본 발명은 이에 한정되는 것이 아니고 특허청 구범위와 발명의 상세한 설명 및 첨부한 도면의 범위 안에서 여러 가지로 변형하여 실시하는 것이 가능하고 이 또한 본 발명의 범위에 속하는 것은 당연하다."}
{"patent_id": "10-2022-0055199", "section": "도면", "subsection": "도면설명", "item": 1, "content": "이 도면들은 본 발명의 예시적인 실시 예를 설명하는데 참조하기 위함이므로, 본 발명의 기술적 사상을 첨부한 도면에 한정해서 해석하여서는 아니된다. 도 1은 본 발명의 실시 예에 따른 차량용 루프 구조체를 도시한 결합 사시도이다. 도 2는 본 발명의 실시 예에 따른 차량용 루프 구조체를 도시한 분해 사시도이다.도 3은 본 발명의 실시 예에 따른 차량용 루프 구조체를 도시한 평면 구성도이다. 도 4는 본 발명의 실시 예에 따른 차량용 루프 구조체에 적용되는 메인 루프 멤버 부위를 도시한 도면이다. 도 5는 본 발명의 다른 실시 예에 따른 차량용 루프 구조체를 도시한 결합 사시도이다. 도 6은 본 발명의 다른 실시 예에 따른 차량용 루프 구조체를 도시한 분해 사시도이다. 도 7은 본 발명의 다른 실시 예에 따른 차량용 루프 구조체를 도시한 평면 구성도이다. 위에서 참조된 도면들은 반드시 축적에 맞추어 도시된 것은 아니고, 본 발명의 기본 원리를 예시하는 다양한 선 호되는 특징들의 다소 간략한 표현을 제시하는 것으로 이해되어야 한다. 예를 들어, 특정 치수, 방향, 위치, 및 형상을 포함하는 본 발명의 특정 설계 특징들이 특정 의도된 응용과 사용 환경에 의해 일부 결정될 것이다."}
