{"patent_id": "10-2023-7032314", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0150835", "출원번호": "10-2023-7032314", "발명의 명칭": "네트워크에서 NAS 절차의 재시도를 처리하기 위한 방법 및 MUSIM UE", "출원인": "삼성전자주식회사", "발명자": "랄릿 쿠마르"}}
{"patent_id": "10-2023-7032314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무선 네트워크에서 UE(user equipment)에 의해 SR(service request) 절차를 처리하기 위한 방법에 있어서,상기 UE에 의해서, 상기 SR 절차를 트리거하는 단계;상기 SR 절차의 트리거에 대한 응답으로, 상기 UE에 의해서, SR 또는 제어 플레인(control plane) SR 메시지의전송 실패를 결정하는 단계;상기 UE에 의해서, 상기 SR 절차가, NAS(Non Access Stratum) 시그널링 연결을 해제하도록 상기 무선 네트워크에 요청하는 것, 또는상기 무선 네트워크로부터의 페이징 요청을 거절하고 상기 NAS 시그널링 연결을 해제하도록 상기 무선 네트워크에 요청하는 것중 하나를 포함하는 이유로 트리거된 것인지 여부를 결정하는 단계; 및상기 UE에 의해서,상기 전송 실패의 결정에 대한 응답으로 상기 이유로 인해 트리거된 상기 SR 절차를 중단하는 것, 또는상기 전송 실패의 결정에 대한 응답으로 상기 이유가 아닌 것으로 인해 트리거된 상기 SR 절차를 재트리거하는것중 하나를 수행하는 단계를 포함하는, 방법."}
{"patent_id": "10-2023-7032314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 UE에 의해서, NAS 시그널링 연결을 로컬에서 해제하는 단계;상기 UE에 의해서, 타이머 T3517을 중지하는 단계; 및상기 UE에 의해서, 상기 SR 절차를 위해 할당된 자원들을 로컬에서 해제하는 단계를 더 포함하는, 방법."}
{"patent_id": "10-2023-7032314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "무선 네트워크에서 서비스 요청(SR) 절차를 처리하기 위한 사용자 단말(UE)에 있어서,메모리;프로세서; 및상기 메모리 및 상기 프로세서에 연결된 SR 절차 컨트롤러를 포함하며,상기 SR 절차 컨트롤러는,상기 SR 절차를 트리거하고,상기 SR 절차의 트리거에 대한 응답으로, SR 또는 제어 플레인 SR 메시지의 전송 실패를 결정하고,상기 SR 절차가, NAS 시그널링 연결을 해제하도록 상기 무선 네트워크에 요청하는 것, 또는상기 무선 네트워크로부터의 페이징 요청을 거절하고 상기 NAS 시그널링 연결을 해제하도록 상기 무선 네트워크공개특허 10-2023-0150835-3-에 요청하는 것중 하나를 포함하는 이유로 트리거된 것인지 여부를 결정하며, 그리고상기 전송 실패의 결정에 대한 응답으로 상기 이유로 인해 트리거된 상기 SR 절차를 중단하는 것, 또는상기 전송 실패의 결정에 대한 응답으로 상기 이유가 아닌 것으로 인해 트리거된 상기 SR 절차를 재트리거하는것중 하나를 수행하도록 구성되는, 사용자 단말(UE)."}
{"patent_id": "10-2023-7032314", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 SR 절차 컨트롤러는,NAS 시그널링 연결을 로컬에서 해제하고,타이머 T3517을 중지하며, 그리고상기 SR 절차를 위해 할당된 자원들을 로컬에서 해제하도록 더 구성되는, 사용자 단말(UE)."}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 보다 높은 데이터 전송률을 지원하기 위한 5G 또는 6G 통신 시스템에 관련된 것이다. 무선 네트워크 에서 UE(User Equipment)에 의해 NAS(Non Access Stratum) 절차(예를 들어, SR(Service Request) 절차 등)를 처 리하기 위한 방법이 제공된다. 이 방법은 SR 절차를 트리거하는 단계 및 SR 절차의 트리거에 대한 응답으로 SR (뒷면에 계속)"}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 통신 네트워크 분야에 관한 것이다. 보다 구체적으로, 본 개시는 무선 네트워크에서 MUSIM(Multi Universal Subscriber Identification Module) 사용자 단말(UE)을 위한 NAS(Non Access Stratum) 절차의 재시 도를 처리하는 방법 및 시스템에 관한 것이다."}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "5G 이동통신 기술은 빠른 전송 속도와 새로운 서비스가 가능하도록 넓은 주파수 대역을 정의하고 있으며, 3.5 기가헤르츠(3.5GHz) 등 6GHz 이하 주파수('Sub 6GHz') 대역은 물론 28GHz와 39GHz 등 밀리미터파(㎜Wave)로 불 리는 초고주파 대역('Above 6GHz')에서도 구현이 가능하다. 또한, 5G 통신 이후(Beyond 5G)의 시스템이라 불리 어지는 6G 이동통신 기술의 경우, 5G 이동통신 기술 대비 50배 빨라진 전송 속도와 10분의 1로 줄어든 초저 (Ultra Low) 지연시간을 달성하기 위해 테라헤르츠(Terahertz, THz) 대역(예를 들어, 95GHz에서 3 테라헤르츠 대역과 같은)에서의 구현이 고려되고 있다. 5G 이동통신 기술의 초기에는, 초광대역 서비스(enhanced Mobile BroadBand, eMBB), 고신뢰/초저지연 통신 (Ultra-Reliable Low-Latency Communications, URLLC), 대규모 기계식 통신 (massive Machine-Type Communications, mMTC)에 대한 서비스 지원과 성능 요구사항 만족을 목표로, 초고주파 대역에서의 전파의 경로 손실 완화 및 전파의 전달 거리를 증가시키기 위한 빔포밍(Beamforming) 및 거대 배열 다중 입출력(Massive MIMO), 초고주파수 자원의 효율적 활용을 위한 다양한 뉴머롤로지 지원(복수 개의 서브캐리어 간격 운용 등)와 슬롯 포맷에 대한 동적 운영, 다중 빔 전송 및 광대역을 지원하기 위한 초기 접속 기술, BWP(Band-Width Part) 의 정의 및 운영, 대용량 데이터 전송을 위한 LDPC(Low Density Parity Check) 부호와 제어 정보의 신뢰성 높은 전송을 위한 폴라 코드(Polar Code)와 같은 새로운 채널 코딩 방법, L2 선-처리(L2 pre-processing), 특정 서 비스에 특화된 전용 네트워크를 제공하는 네트워크 슬라이싱(Network Slicing) 등에 대한 표준화가 진행되었다. 현재, 5G 이동통신 기술이 지원하고자 했던 서비스들을 고려하여 초기의 5G 이동통신 기술 개선(improvement) 및 성능 향상(enhancement)을 위한 논의가 진행 중에 있으며, 차량이 전송하는 자신의 위치 및 상태 정보에 기 반하여 자율주행 차량의 주행 판단을 돕고 사용자의 편의를 증대하기 위한 V2X(Vehicle-to-Everything), 비면허 대역에서 각종 규제 상 요구사항들에 부합하는 시스템 동작을 목적으로 하는 NR-U(New Radio Unlicensed), NR 단말 저전력 소모 기술(UE Power Saving), 지상 망과의 통신이 불가능한 지역에서 커버리지 확보를 위한 단말- 위성 직접 통신인 비 지상 네트워크(Non-Terrestrial Network, NTN), 위치 측위(Positioning) 등의 기술에 대 한 물리계층 표준화가 진행 중이다. 뿐만 아니라, 타 산업과의 연계 및 융합을 통한 새로운 서비스 지원을 위한 지능형 공장 (Industrial Internet of Things, IIoT), 무선 백홀 링크와 액세스 링크를 통합 지원하여 네트워크 서비스 지역 확장을 위한 노드를제공하는 IAB(Integrated Access and Backhaul), 조건부 핸드오버(Conditional Handover) 및 DAPS(Dual Active Protocol Stack) 핸드오버를 포함하는 이동성 향상 기술(Mobility Enhancement), 랜덤액세스 절차를 간소화하 는 2 단계 랜덤액세스(2-step RACH for NR) 등의 기술에 대한 무선 인터페이스 아키텍쳐/프로토콜 분야의 표준 화 역시 진행 중에 있으며, 네트워크 기능 가상화(Network Functions Virtualization, NFV) 및 소프트웨어 정 의 네트워킹(Software-Defined Networking, SDN) 기술의 접목을 위한 5G 베이스라인 아키텍쳐(예를 들어, Service based Architecture, Service based Interface), 단말의 위치에 기반하여 서비스를 제공받는 모바일 엣지 컴퓨팅(Mobile Edge Computing, MEC) 등에 대한 시스템 아키텍쳐/서비스 분야의 표준화도 진행 중이다. 이와 같은 5G 이동통신 시스템이 상용화되면, 폭발적인 증가 추세에 있는 커넥티드 기기들이 통신 네트워크에 연결될 것이며, 이에 따라 5G 이동통신 시스템의 기능 및 성능 강화와 커넥티드 기기들의 통합 운용이 필요할 것으로 예상된다. 이를 위해, 증강현실(Augmented Reality, AR), 가상현실(Virtual Reality, VR), 혼합 현실 (Mixed Reality, MR) 등을 효율적으로 지원하기 위한 확장 현실(eXtended Reality, XR), 인공지능(Artificial Intelligence, AI) 및 머신러닝(Machine Learning, ML)을 활용한 5G 성능 개선 및 복잡도 감소, AI 서비스 지 원, 메타버스 서비스 지원, 드론 통신 등에 대한 새로운 연구가 진행될 예정이다. 또한, 이러한 5G 이동통신 시스템의 발전은 6G 이동통신 기술의 테라헤르츠 대역에서의 커버리지 보장을 위한 신규 파형(Waveform), 전차원 다중입출력(Full Dimensional MIMO, FD-MIMO), 어레이 안테나(Array Antenna), 대규모 안테나(Large Scale Antenna)와 같은 다중 안테나 전송 기술, 테라헤르츠 대역 신호의 커버리지를 개선 하기 위해 메타물질(Metamaterial) 기반 렌즈 및 안테나, OAM(Orbital Angular Momentum)을 이용한 고차원 공 간 다중화 기술, RIS(Reconfigurable Intelligent Surface) 기술 뿐만 아니라, 6G 이동통신 기술의 주파수 효 율 향상 및 시스템 네트워크 개선을 위한 전이중화(Full Duplex) 기술, 위성(Satellite), AI(Artificial Intelligence)를 설계 단계에서부터 활용하고 종단간(End-to-End) AI 지원 기능을 내재화하여 시스템 최적화를 실현하는 AI 기반 통신 기술, 단말 연산 능력의 한계를 넘어서는 복잡도의 서비스를 초고성능 통신과 컴퓨팅 자 원을 활용하여 실현하는 차세대 분산 컴퓨팅 기술 등의 개발에 기반이 될 수 있을 것이다. 위의 정보는 본 개시 내용의 이해를 돕기 위한 배경 정보로만 제공된다. 위의 내용 중 어느 것이 본 개시와 관 련하여 선행 기술로 적용될 수 있는지 여부에 대한 결정이 내려지지 않았으며 어떠한 주장도 이루어지지 않았다."}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 개시의 양태들은 적어도 위에서 언급된 문제 및/또는 단점을 해결하고 적어도 아래에서 설명되는 이점을 제 공하기 위한 것이다. 따라서, 본 개시의 일 양태는 무선 네트워크에서 MUSIM UE에 대한 NAS 절차의 재시도를 처리하는 방법 및 시스템을 제공하기 위한 것이다."}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시의 일 양태에 따르면, 무선 네트워크에서 MUSIM UE에 대한 NAS 절차의 재시도를 처리하는 방법 및 시스 템이 제공된다."}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 개시의 양태들은 적어도 위에서 언급된 문제 및/또는 단점을 해결하고 적어도 아래에서 설명되는 이점을 제 공하기 위한 것이다. 따라서, 본 개시의 일 양태는 무선 네트워크에서 MUSIM UE를 위한 NAS 절차의 재시도를 처리하는 방법 및 시스템을 제공하기 위한 것이다. 추가적인 양태들이 다음의 설명에서 부분적으로 설명될 것이고, 부분적으로는 설명으로부터 명백할 것이며, 또 는 제시된 실시예들의 실시에 의해 학습될 수도 있다. 본 개시의 일 양태에 따르면, 무선 네트워크에서 UE(예를 들어, MUSIM UE)에 의한 NAS 절차, 예를 들어 서비스 요청(SR) 절차를 처리하기 위한 방법이 제공된다. 이 방법은 UE에 의해서, SR 절차를 트리거하는 단계, 및 SR 절차의 트리거에 대한 응답으로, UE에 의해서, SR 또는 제어 플레인(control plane) 서비스 요청 메시지의 전송 실패를 결정하는 단계를 포함한다. 또한, 이 방법은 UE에 의해서, SR 절차가, NAS 시그널링 연결을 해제하도록 무선 네트워크에 요청하는 것, 또는 무선 네트워크로부터의 페이징 요청을 거절하고 NAS 시그널링 연결을 해제 하도록 무선 네트워크에 요청하는 것 중 하나를 포함하는 이유로 트리거된 것인지 여부를 결정하는 단계를 포함 한다. 또한, 이 방법은 UE에 의해서, 전송 실패의 결정에 대한 응답으로, 상기 이유로 인해 트리거된 SR 절차 를 중단하는 것, 또는 전송 실패의 결정에 대한 응답으로 상기 이유가 아닌 것으로 인해 트리거된 SR 절차를 재 트리거하는 것 중 하나를 수행하는 단계를 포함한다. 일 실시예에서, 이 방법은 UE에 의해서, NAS 시그널링 연결을 로컬 해제하는 단계 및 UE에 의해서, 타이머 T3517을 중단하는 단계를 포함한다. 또한, 이 방법은 UE에 의해서, 서비스 요청 절차를 위해 할당된 자원들을 로컬 해제하는 단계를 포함한다. 본 개시의 다른 양태에 따르면, 무선 네트워크에서 NAS 절차(예를 들어, SR 절차 등)를 처리하기 위한 UE(예를 들어, MUSIM UE)가 제공된다. UE는 메모리 및 프로세서에 연결된 SR 절차 컨트롤러를 포함한다. SR 절차 컨트 롤러는 SR 절차를 트리거하고 SR 절차 트리거에 대한 응답으로 SR 또는 제어 플레인 서비스 요청 메시지의 전송 실패를 결정하도록 구성된다. 또한, SR 절차 컨트롤러는 SR 절차가, NAS 시그널링 연결을 해제하도록 무선 네 트워크에 요청하는 것, 또는 무선 네트워크로부터의 페이징 요청을 거절하고 NAS 시그널링 연결을 해제하도록 무선 네트워크에 요청하는 것 중 하나를 포함하는 이유로 트리거된 것인지 여부를 결정하도록 구성된다. 또한, SR 절차 컨트롤러는 전송 실패의 결정에 대한 응답으로 상기 이유로 인해 트리거된 SR 절차를 중단하는 것, 또 는 전송 실패의 결정에 대한 응답으로 상기 이유가 아닌 것으로 인해 트리거된 SR 절차를 재트리거하는 것 중 하나를 수행하도록 구성된다. 본 개시의 다른 양태, 이점, 및 현저한 특징은 첨부 도면과 함께 취해지는 본 발명의 다양한 실시예를 개시하는 다음의 상세한 설명으로부터 당업자에게 명백해질 것이다. 첨부된 도면을 참조한 다음의 설명은 청구범위 및 그 균등물에 의해 정의된 본 개시의 다양한 실시양태의 포괄 적인 이해를 돕기 위해 제공된다. 여기에는 이해를 돕기 위한 다양한 특정 세부 사항이 포함되어 있지만 이는"}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "단지 예시적인 것으로 간주되어야 한다. 따라서, 본 기술분야의 통상의 지식을 가진 자는 본 개시의 범위 및 사상을 벗어나지 않고 본 명세서에 기재된 다양한 실시예의 다양한 변경 및 수정이 이루어질 수 있음을 인식할 것이다. 또한, 명료함과 간결함을 위해 잘 알려진 기능 및 구성에 대한 설명은 생략할 수 있다. 이하의 설명 및 청구 범위에서 사용되는 용어 및 단어는 서지적 의미로 제한되지 않으며, 본 발명의 명확하고 일관된 이해를 가능하게 하기 위해 발명자에 의해 사용된 것이다. 따라서, 본 개시의 다양한 실시예들에 대한 다음의 설명은 단지 예시의 목적으로 제공된 것이며, 첨부된 청구범위 및 그 균등물에 의해 정의된 바와 같은 개시를 제한하기 위한 것이 아니라는 것이 당업자에게 명백하다. 단수 형태는 문맥상 명백하게 다르게 지시되지 않는 한 복수의 지시 대상을 포함한다는 것을 이해해야 한다. 따라서, 예를 들어, \"컴포넌트 표면\"에 대한 언급은 그러한 표면들 중 하나 이상에 대한 언급을 포함한다. 아래의 상세한 설명에 들어가기 전에, 본 특허 명세서 전체에 걸쳐 사용되는 특정 단어 및 어구들의 정의를 기 재하는 것이 도움이 될 수 있다. 용어 \"커플(couple)\" 및 그 파생어는 둘 이상의 요소가 서로 물리적으로 접촉 하고 있는지 여부에 관계없이 둘 이상의 요소 사이의 직접 또는 간접 통신을 나타낸다. 용어 \"송신 (transmit)\", \"수신(receive)\" 및 \"통신(communicate)\" 그리고 그 파생어는 직접 통신 및 간접 통신 모두를 포 함한다. 용어 \"포함한다(include)\" 및 \"구성한다(comprise)\" 그리고 그 파생어는 제한이 아닌 포함을 의미한다. 용어 \"또는(or)\"은 포괄적 용어로써, '및/또는'을 의미한다. 어구 \"~와 관련되다(associated with)\" 및 그 파생어는 ~을 포함한다(include), ~에 포함된다(be included within), ~와 결합하다 (interconnect with), ~을 함유하다(contain), ~에 함유되어 있다(be contained within), ~에 연결한다 (connect to or with), ~와 결합하다(couple to or with), ~ 전달한다(be communicable with), 와 협력하다 (cooperate with), ~를 끼우다(interleave), ~을 나란히 놓다(juxtapose), ~에 인접하다(be proximate to), 구 속하다/구속되다(be bound to or with), 소유하다(have), 속성을 가지다(have a property of), ~와 관계를 가 지다(have a relationship to or with) 등을 의미한다. 용어 \"컨트롤러(controller)\"는 적어도 하나의 동작을 제어하는 어떤 장치, 시스템 또는 그 일부를 의미한다. 이러한 컨트롤러는 하드웨어 또는 하드웨어와 소프트웨 어의 조합 및/또는 펌웨어로 구현될 수 있다. 특정 컨트롤러와 관련된 기능은 로컬 또는 원격으로 중앙 집중식 으로 처리(centralized)되거나 또는 분산식으로 처리(distributed)될 수 있다. 어구 \"적어도 하나\"는, 그것이 항목들의 나열과 함께 사용될 경우, 나열된 항목들 중 하나 이상의 상이한 조합이 사용될 수 있음을 의미한다. 예를 들어, \"A, B, C 중 적어도 하나\"는 A, B, C, A와 B, A와 C, B와 C, A와 B와 C의 조합 중 하나를 포함한다. 본 기술 분야에 관행적인 바와같이, 실시예는 설명된 기능을 수행하는 블록의 관점에서 설명되고 예시될 수 있 다. 본 명세서에서 관리자, 유닛, 모듈, 하드웨어 구성 요소 등으로서 지칭될 수 있는 이러한 블록은 논리 게 이트, 집적 회로, 마이크로프로세서, 마이크로컨트롤러, 메모리 회로, 수동 전자 부품, 능동 전자 부품, 광학 부품, 유선 회로 등과 같은 아날로그 및/또는 디지털 회로에 의해 물리적으로 구현되고, 선택적으로 펌웨어에 의해 구동될 수 있다. 예를 들어, 회로는 하나 이상의 반도체 칩으로 구현되거나 인쇄 회로 기판 등과 같은 기 판 지지체에 구현될 수 있다. 블록을 구성하는 회로는 전용 하드웨어 또는 프로세서(예를 들면, 하나 이상의 프로그래밍된 마이크로 프로세서 및 관련 회로) 또는 블록의 일부 기능을 수행하는 전용 하드웨어와 블록의 다 른 기능을 수행하는 프로세서의 조합에 의해 구현될 수 있다. 실시예들의 각 블록은 본 개시의 범위를 벗어나 지 않고 물리적으로 둘 이상의 상호 작용하는 개별 블록으로 분리될 수 있다. 마찬가지로, 실시예들의 블록들 은 본 개시의 범위를 벗어나지 않고 물리적으로 더 복잡한 블록들로 결합될 수도 있다. 다른 특정 단어 및 어구에 대한 정의가 이 특허 명세서 전반에 걸쳐 제공된다. 당업자는 대부분의 경우가 아니 더라도 다수의 경우에 있어서, 이러한 정의는 종래에 뿐만 아니라 그러한 정의된 단어 및 어구의 향후 사용에 적용될 수 있음을 이해해야 한다. 일반적으로 무선 통신 네트워크에서 UE(User Equipment)에 의해 NAS(Non Access Stratum) 절차(예를 들어, 등 록 절차, 서비스 요청 절차 등)가 수행될 때 UE가 비정상적인 경우에 직면하게 되는 경우, UE는 시도 카운터 (attempt counter)가 최대값에 도달할 때까지 해당 NAS 절차를 계속 재시도하게 된다. 예를 들어, 등록 절차의 가드 타이머(guard timer)(이하 제 1 타이머 예 T3510라고 함)가 만료되면, UE는 네트워크에 도달하는 데 일부 문제가 있었던 것으로 간주하므로 전송된 등록 요청 메시지에 대한 네트워크의 응답이 없게 된다. 또한, UE가제 2 타이머(예를 들면, T3511)를 시작하고 제 2 타이머 T3511가 만료된 후에 UE는 등록 절차를 재전송하게 되 며 이것은 모든 시도 카운터가 최대 값(예를 들면, 4 또는 5)에 도달한 이후에도 계속된다. 또한, UE는 등록 상태 재시도로 이동하여 다시 시도하기 위해 긴 듀레이션 타이머 T3502를 시작하게 된다. 따라서, 종래 기술에 서는, UE가 한번 등록 절차를 시도하면 등록 절차가 성공하지 않는 한 이 등록 절차를 계속 시도하게 된다. 이 러한 종래 기술의 방법은 UE가 NAS 시그널링 연결 해제를 네트워크에게 요청하는 각각의 NAS 절차를 트리거하는 사용 중(Busy)(페이징 거절라고도 함) 또는 종료(leaving) 절차라는 새로운 기능으로 인해 MUSIM(multi-USIM) 장치를 다시 방문해야 한다. 따라서, MUSIM UE가 신속하게 대체 SIM으로 전환할 수 있고 의도한 서비스들을 가 능한 한 빨리 계속할 수 있지만, MUSIM UE가 재시도 타이머들을 계속 실행하면서 NAS 절차를 실행하려고 시도할 경우 상당한 지연이 발생하게 되어 3GPP(3rd Generation Partnership Project) 네트워크의 대체(또는 제 2) SIM에서 의도한 서비스를 시작함에 있어서 사용자 경험에 영향을 미치게 된다. 따라서, 전술한 단점들 또는 다른 결점들을 해결하거나 적어도 유용한 대안을 제공하는 것이 바람직하다. 본 개시의 실시예들의 주된 목적은 무선 네트워크에서 MUSIM UE에 대한 NAS 절차(예를 들어, 서비스 요청(SR) 절차 등)의 재시도를 처리하기 위한 방법 및 시스템을 제공하는 것이다. 본 개시의 실시예들의 다른 목적은 UE가 MUSIM을 지원하고 UE가 5GMM(5G Mobility Management)-CONNECTED 모드 에 있거나 또는 UE가 무선 자원 제어(RRC) 비활성 지시와 함께 5GMM-CONNECTED 모드에 있고, RAN(Radio Access Network) 페이징을 거절할 때 SR이 트리거되는 경우 SR 메시지 전송 실패 이후에 UE가 SR 절차를 중단하는 것을 제공하는 것이다. UE는 NAS 시그널링 연결을 해제하도록 네트워크에 요청하고 선택적으로 이것은 페이징 제한 을 포함하며, 이에 따라 무선 네트워크에서 자원 낭비를 피하고 사용자 경험을 향상시키게 된다. 본 개시의 실시예들의 다른 목적은 UE가 MUSIM을 지원하고 5GMM-IDLE 모드에 있고 UE가 네트워크로부터의 페이 징 요청에 응답하여 페이징 거절할 때 SR이 트리거되는 경우 SR 메시지 전송 실패 이후에 UE가 SR 절차를 중단 하는 것을 제공하는 것이며, UE는 NAS 시그널링 연결을 해제하도록 네트워크에 요청하고 선택적으로 이것은 페 이징 제한을 포함하며, 이에 따라 무선 네트워크에서 자원 낭비를 피하고 사용자 경험을 향상시키게 된다. 따라서, 본 개시의 실시예에서는 3GPP(3rd Generation Partnership Project) 네트워크(예를 들어, 5G 네트워크)에서 NAS 절차(예를 들어, SR 절차 또는 사용 중(busy) 절차)를 관리하기 위한 방법 및 시스템을 제공 한다. 본 제안된 방법은 대체 SIM(Subscriber Identity Module) 상의 서비스들에 영향을 주지 않으면서 사용 중 기능들(페이징 거절 기능이라고도 함)을 실행할 수 있는 기회를 UE(User Equipment)에게 제공한다. 본 제안된 방법은 대체 SIM(Subscriber Identity Module) 상의 서비스들에 영향을 주지 않으면서 사용 중 기능 들을 실행할 수 있는 기회를 UE에게 제공한다. UE가 MUSIM을 지원하고 UE가 5GMM-CONNECTED 모드에 있거나 UE가 RRC 비활성 지시와 함께 5GMM-CONNECTED 모드 에 있고, UE가 RAN 페이징을 거절할 때 SR이 트리거되는 경우 SR 메시지의 전송 실패 후 UE가 SR 절차를 중단한 다. UE는 NAS 시그널링 연결을 해제하도록 네트워크에 요청하고, 선택적으로 이것은 페이징 제한을 포함한다. 따라서, 무선 네트워크에서 자원 낭비를 피하고 사용자 경험을 향상시킨다. UE가 MUSIM을 지원하고 5GMM-IDLE 모드이며 네트워크로부터의 페이징 요청에 응답하여 페이징 거절할 때 SR이 트리거되는 경우 SR 메시지 전송 실패 이후에 UE가 SR 절차를 중단하고, NAS 시그널링 연결을 해제하도록 네트 워크에 요청하며 선택적으로 이것은 페이징 제한을 포함한다. 따라서, 무선 네트워크에서 자원 낭비를 피하고 사용자 경험을 향상시킨다. 일 실시예에서, 현재 TAI(Tracking Area Identity)가 TAI 목록의 일부인 경우, UE가 MUSIM을 지원하고 UE가 5GMM-CONNECTED 모드에 있거나 또는 UE가 무선 자원 제어(RRC) 비활성 지시와 함께 5GMM-CONNECTED 모드에 있 고 RAN(Radio Access Network) 페이징을 거절할 때 서비스 요청 절차가 개시되지 않는 한 UE는 서비스 요청 절 차를 재시작해야 한다. UE는 NAS 시그널링 연결을 해제하도록 네트워크에 요청하며 선택적으로 이것은 페이징 제한을 포함한다. 또한, UE는 서비스 요청 절차를 중단하고 나서, 5GMM-REGISTERED 상태에 들어가고, N1 NAS 시그널링 연결을 로컬에서 해제하고, 타이머 T3517을 중지하며, 서비스 요청 절차에 할당된 자원들을 로컬에서 해제해야 한다. 일 실시예에서, 현재 TAI가 TAI 목록의 일부인 경우, UE가 MUSIM을 지원하고 UE가 5GMM-IDLE 모드에 있고 UE가 네트워크로부터의 페이징 요청에 응답하여 페이징 거절할 때 SR이 트리거되는 경우 SR 메시지 전송 실패 이후에 UE가 SR 절차를 중단할 때 서비스 요청 절차가 개시되지 않는 한 UE는 서비스 요청 절차를 재시작해야 한다. 또한, UE는 서비스 요청 절차를 중단하고 나서, 5GMM-REGISTERED 상태에 들어가고, N1 NAS 시그널링 연결을 로컬에서 해제하고, 타이머 T3517을 중지하며, 서비스 요청 절차에 할당된 자원들을 로컬에서 해제해야 한다. 이제 도면들, 특히 도 1 내지 도 3, 도 5, 도 7, 도 9 및 도 10을 참조하면, 유사한 참조 부호가 도면 전체에 걸쳐 일관되게 대응하는 특징을 나타내며, 바람직한 실시예들이 도시되어 있다. 도 1은 본 개시의 일 실시예에 따른, NAS 절차(예를 들어, SR 절차)를 처리하기 위한 무선 네트워크의 개 요를 도시한 것이다. 일 실시예에서, 무선 네트워크는 UE(예를 들어, MUSIM UE) 및 네트워크 엔티티를 포함한다. 무선 네트워크는 예를 들어, 5G 네트워크, 6G 네트워크 및 O-RAN(Open Radio Access Network) 네트워크 일 수 있으며, 이에 한정되지 않는다. UE는 예를 들어, 랩탑, 데스크탑 컴퓨터, 노트북, 릴레이 장치, D2D(Device-to-Device) 장치, V2X(Vehicle to Everything) 장치, 스마트폰, 태블릿, 몰입형 장치, 사물 인터넷 (IoT) 장치일 수 있으며, 이에 한정되지 않는다. UE는 SR 절차를 트리거하고 SR 절차의 트리거에 대한 응답으로 SR 또는 제어 플레인 서비스 요청 메시지의 전송 실패를 결정하도록 구성된다. 또한, UE는 무선 네트워크에 NAS 시그널링 연결 해제를 요청하 는 것, 및 무선 네트워크로부터의 페이징 요청을 거절하고 무선 네트워크에 NAS 시그널링 연결 해 제를 요청하는 것 중 하나를 포함하는 이유로 SR 절차가 트리거되는지 여부를 결정하도록 구성된다. 본 실시예 에서는 SR 절차 또는 등록 절차를 예로 들어 설명하지만 등록 해제 절차와 같은 다른 NAS 절차들이 UE에 의해 트리거되는 경우에도 동일한 개시가 적용될 수 있다. UE는 NAS 메시지에서 \"페이징 거절\"로 설정된 UE 요청 타입 정보 요소를 사용하여 NAS 절차 사용 중 지시(busy indication)의 일부로서 나타낸다. 또한, UE는 \"NAS 시그널링 연결 해제\"를 요청하여 NAS 시그널링 연결을 해제하도록 네트워크에 요청할 수 있으며, 이 지시(들)를 통해 네트워크는 UE에 대해 펜딩 중인 하향링크 데이터 또는 하향링크 시그널링을 중단/저장하고 NAS 시그널링 연결을 해제할 것으로 예상된다. 또한, UE는 전송 실패 결정에 대한 응답으로 이 이유로 인해 트리거된 SR 절차를 중단하는 것, 및 전송 실 패 결정에 대한 응답으로 이 이유가 아닌 것으로 인해 트리거된 SR 절차를 재트리거하는 것 중 하나를 수행하도 록 구성된다. 또한, UE는 NAS 시그널링 연결을 로컬에서 해제하고 타이머 T3517을 중지하도록 구성된다. 또한, UE(10 0)는 서비스 요청 절차를 위해 할당된 자원들을 로컬에서 해제하도록 구성된다. 도 2는 본 개시의 일 실시예에 따른, UE의 다양한 하드웨어 구성 요소를 도시한 것이다. 일 실시예에서, UE는 프로세서, 커뮤니케이터, 메모리 및 SR 절차 컨트롤러를 포함한 다. 프로세서는 커뮤니케이터, 메모리 및 SR 절차 컨트롤러와 커플링된다. 또한, SR 절차 컨트롤러는 SR 절차를 트리거하고 SR 절차 트리거에 응답하여 SR 또는 제어 플레인 서비스 요청 메시지의 전송 실패를 결정하도록 구성된다. 또한, SR 절차 컨트롤러는 SR 절차가, NAS 시그널링 연 결을 해제하도록 무선 네트워크에 요청하는 것, 또는 무선 네트워크로부터의 페이징 요청을 거절하 고 NAS 시그널링 연결을 해제하도록 무선 네트워크에 요청하는 것 중 하나를 포함하는 이유로 트리거된 것인지 여부를 결정하도록 구성된다. 또한, SR 절차 컨트롤러는 전송 실패의 결정에 대한 응답으로 상기 이유로 인해 트리거된 SR 절차를 중단하는 것, 및 전송 실패의 결정에 대한 응답으로 상기 이유가 아닌 것으로 인해 트리거된 SR 절차를 재트리거하는 것 중 하나를 수행하도록 구성된다. 또한, SR 절차 컨트롤러는 로컬에서 NAS 시그널링 연결을 해제하고 타이머 T3517을 중지하도록 구성된다. 또한, SR 절차 컨트롤러는 서비스 요청 절차를 위해 할당된 자원들을 로컬에서 해제하도록 구성된다. 또한, SR 절차 컨트롤러는 로직 게이트, 집적 회로, 마이크로프로세서, 마이크로컨트롤러, 메모리 회로, 수동 전자 부품, 능동 전자 부품, 광학 부품, 하드 와이어드 회로 등과 같은 아날로그 및/또는 디지털 회로들에 의해 물리적으로 구현되며, 선택적으로 펌웨어에 의해 구동될 수도 있다. 또한, 프로세서는 메모리에 저장된 명령어들을 실행하고 다양한 프로세스들을 수행하도록 구성된다. 커뮤니케이터는 내부 하드웨어 구성 요소들 사이에서 내부적으로 및 하나 이상의 네트워크들을 통해 외부 장치들과 통신하도록 구성된다. 메모리는 또한 프로세서에 의해 실행될 명령어들을 저장한다. 메모 리는 비휘발성 저장 요소들을 포함할 수 있다. 이러한 비휘발성 저장 요소들의 예들은 자기 하드 디스크 들, 광 디스크들, 플로피 디스크들, 플래시 메모리들, 또는 EPROM(electrically programmable memories) 또는 EEPROM(electrically erasable and programmable memories)의 형태들을 포함할 수 있다. 또한,메모리는, 일부 예들에서, 비일시적 저장 매체로 간주될 수 있다. \"비일시적\"이란 용어는 저장 매체가 반 송파 또는 전파되는 신호로 구현되지 않음을 나타낼 수 있다. 그러나, \"비일시적\"이란 용어는 메모리가 비이동식인 것으로 해석되지 않아야 한다. 특정 예들에서, 비일시적 저장 매체는 시간이 지남에 따라 변경될 수 있는 데이터를 저장할 수도 있다(예를 들면, RAM(Random Access Memory) 또는 캐시에서). 도 2가 UE의 다양한 하드웨어 구성 요소를 도시하지만, 다른 실시예들이 이에 제한되지 않는다는 것을 이 해해야 한다. 다른 실시예들에서, UE는 더 적거나 더 많은 수의 구성 요소들을 포함할 수 있다. 또한, 구성 요소들의 라벨이나 명칭은 단지 예시를 위해 사용된 것이며, 본 개시의 범위를 제한하지 않는다. 하나 이 상의 구성 요소들이 함께 결합됨으로써 UE 서비스 컨슈머에서 동일하거나 실질적으로 유사한 기능을 수행 할 수도 있다. 도 3은 본 개시의 일 실시예에 따른, 무선 네트워크에서 SR 절차를 처리하는 방법을 나타내는 흐름도 (S300)이다. 동작들(S302-S314)은 SR 절차 컨트롤러에 의해 수행된다. 동작 S302에서, 이 방법은 SR 절차를 트리거하는 동작을 포함한다. 동작 S304에서, 이 방법은 SR 절차의 트리 거에 응답하여 SR 또는 제어 플레인 서비스 요청 메시지의 전송 실패를 결정하는 동작을 포함한다. 동작 S306 에서, 이 방법은 NAS 시그널링 연결을 해제하도록 무선 네트워크에 요청하는 것, 및 무선 네트워크(100 0)로부터의 페이징 요청을 거절하고 시그널링 연결을 해제하도록 무선 네트워크에 요청하는 것 중 하나를 포함하는 이유로 SR 절차가 트리거되었는지 여부를 결정하는 동작을 포함한다. 동작 S308에서, 이 방법은 전송 실패의 결정에 응답하여 이 이유가 아닌 것으로 인해 트리거된 SR 절차를 재트 리거하는 동작을 포함한다. 동작 S310에서, 이 방법은 전송 실패의 결정에 응답하여 이 이유로 인해 트리거된 SR 절차를 중단하는 동작을 포함한다. 동작 S312에서, 이 방법은 NAS 시그널링 연결을 로컬에서 해제하는 동작을 포함한다. 동작 S314에서, 이 방법 은 타이머 T3517을 중지시키는 동작을 포함한다. 동작 S316에서, 이 방법은 서비스 요청 절차를 위해 할당된 자원들을 로컬에서 해제하는 동작을 포함한다. 동작 S318에서, 이 방법은 SR 절차의 재트리거에 응답하여 SR 절차를 계속 실행하는 동작을 포함한다. 도 4는 관련 기술에 따른, UE가 제 1 하향링크 데이터로 인해 네트워크 엔티티로부터 페이징 메시지를 수 신하는 시나리오를 예시하는 시그널링 도면이다. 도 4에 예시된 시나리오를 참조하면, 이 단계들은 다음과 같다: 1. UE-1(예를 들어 MUSIM UE의 일부)이 제 1 하향링크 데이터/시그널링으로 인해 네트워크로부터 페이징 메시지 를 수신한다. 2. UE-2가 진행 중 서비스로 인해 사용 중 상태이므로 MUSIM UE는 하향링크 데이터 또는 시그널링 메시지를 수 신하기 위해 네트워크에 대한 서비스 요청과 함께 페이징 메시지에 응답하지 않는 것으로 결정한다. 3. 따라서 UE-1은 사용 중 지시(busy indication)(페이징 거절)와 함께 등록 요청 또는 서비스 요청 메시지와 같은 NAS 절차를 네트워크에 전송하게 된다. 4. 비정상 케이스(abnormal case)가 발생하는 경우 UE는 제 2 타이머(예를 들면, T3511)를 시작하고, 이것의 만 료 후에 UE는 등록 절차와 같은 각 NAS 절차를 재시도한다. 5. 그러나 타이머 T3511이 길기 때문에(즉, UE가 사용 중임을 나타내는 등록을 다시 트리거하는 경우 10s), 네 트워크가 제 1 데이터/시그널링 메시지를 드롭했을 수도 있다. 따라서, 이러한 큰 지연으로 사용 중임을 나타 내는 것은 네트워크에게 아무 쓸모 없는 것임과 동시에 UE-2가 네트워크에 사용 중 지시를 전송하기 위해 RF를 가져가므로 대체 SIM 스택의 처리량과 성능에 영향을 미치게 된다. 도 5는 본 개시의 일 실시예에 따른, NAS 메시지를 사용하는 UE의 설정 시나리오를 예시하는 시그널링 도 면이다. 도 1에 예시된 시나리오를 참조하면, 이 단계들은 다음과 같다: 1. UE가 네트워크 타이머 Tx에 의해 미리 설정되거나 NAS 메시지 또는 UE의 일부 다른 프로토콜을 사 용하여 설정된다. 네트워크는 PLMN(Public Land Mobile Network) 또는 홈 PLMN을 서빙할 수 있다.2. 타이머 Tx가 만료될 때까지, UE는 네트워크에 사용 중 지시를 전송하는 것을 계속 재시도한다. 3. 타이머 Tx의 만료 후에, UE는 NAS 절차를 사용하여 사용 중 지시를 네트워크로 전송하는 것을 중단한다. 대안적으로, 타이머 Tx의 만료 시에, UE는 네트워크에 사용 중 지시를 전송하는 것을 마지막으 로 시도할 수 있다. 4. 다른 실시예들에서, 페이징 절차가 수신되는 경우, UE는 자신이 사용 중(Busy)이며 따라서 네트워크로 부터 하향링크 데이터 또는 시그널링 메시지를 수신할 수 없음을 네트워크에 나타내기 위한 NAS(Non Access Stratum) 메시지를 네트워크에 전송한다. UE는 사용 중 지시와 함께 NAS 메시지 전송을 시도하지만, NAS 메시지 전송에 성공하지 못한 경우, 즉 전송 실패가 있거나 'x'회 재시도 및 'x' 듀레이션 후 네트워크로부터 응답이 수신되지 않은 경우, UE는 절차를 중단하고 다시 NORMAL 서비스 상태로 이동하게 된다. 재시도 횟 수 'x'는 0 내지 25 범위이다. \"x\" 듀레이션 0 내지 200 밀리초 범위일 수 있다. 도 5를 참조하면, 1에서, 타이머 Tx가 AMF(access and mobility management function) 엔티티(200b)와 UE 사이에 설정된다. 2에서, UE에 전달될 제 1 하향링크 데이터 또는 시그널링이 펜딩 중이다. 3에서, 페이 징 절차가 AMF 엔티티(200b) 및 eNB(evolved node B)(200a)로부터 UE에서 수신된다. 4a 내지 4d에서, UE가 사용 중 지시(busy indication)와 함께 등록 요청 메시지를 AMF 엔티티(200b)로 전송한다. 타이머 Tx가 만료될 때까지, UE는 사용 중 지시를 네트워크에 전송하는 것을 계속 재시도한다. 타이머 Tx의 만료 후,, UE는 사용 중 지시를 전송하는 것을 중단한다. 5에서, AMF 엔티티(200b)가 페이징 절차에 대한 응답 을 수신하지 못했기 때문에, UE 전달을 위해 펜딩 중인 제 1 하향링크 데이터 또는 시그널링을 중단한다. 도 6은 관련 기술에 따른, 주기적 타이머가 만료될 경우 UE에 의한 주기적 등록 절차의 시나리오를 예시하 는 시그널링 도면이다. 도 6에 예시된 시나리오를 참조하면, UE에 의한 주기적 등록 절차에 대한 단계들은 다음과 같다: 1. UE가 네트워크에 등록된 경우 UE의 컨텍스트가 네트워크에서 유지되며, UE가 등록된 영역 밖으로 이동하거나 등록 해제되고 네트워크가 해당 컨텍스트를 무기한 유지하는 경우, 예를 들어 UE가 등록된 영 역에서 사용할 수 없는 경우에도 UE를 페이징해야 하는 등 네트워크에 잠재적인 문제가 발생할 수 있다. a. 따라서 네트워크는 MRT(Mobile Reachable Timer) 및 IDT(Implicit Deregistration Timer)로 불리는 타이머 를 유지한다. MRT 및 IDT가 만료되기 전에 UE는 연결 모드에 들어가고, 네트워크와의 연결을 확립하고, 이 네트워크와 주기적인 등록 업데이트 절차를 실행하여 UE가 등록된 영역에 있는지 확인해야 한다. 2. UE는 주기적 타이머(예를 들어 T3512)가 만료될 경우 주기적 등록 절차를 실행한다. 주기적 등록 타이 머는 UE가 연결 모드에 들어갈 때마다 정지되고, UE가 IDLE 모드에 들어갈 경우에 다시 시작된다. 이제 일반적인 듀얼 SIM의 경우를 고려하면, UE-1 및 UE-2가 MUSIM 장치의 일부이고, UE-1이 NAS 절차를 개시하 기를 원하며, 따라서 UE-1은 RRC 연결 확립을 요청하고, RRC 연결이 성공적으로 확립되면, 연결 모드에 들어가 면서 주기적 등록 타이머를 중지시킨다. 그러나 NAS 절차가 확립되기 전에 예를 들어 UE-2를 통한 음성 통화로 인해 UE-1 무선 주파수(RF)가 UE-2에게 빼앗기게 된다. 따라서, UE-1은 절차를 급작스럽게 종료하고 IDLE 모드 로 들어가면서 주기적 등록 타이머를 새로 시작해야 한다. 그러나 UE-1의 NAS 메시지가 네트워크에 도달하지 않았기 때문에 MRT의 재시작 없이 이것을 계속 실행하게 된다. 따라서, 주기적 등록 타이머가 UE에서 만료되기 전에 MRT+IDT가 만료되고 의도하지 않게 네트워크 측에서 UE 컨텍스트가 제거될 가능성이 있다. 이 문제는 UE 가 연결 모드로 들어가지만 초기 NAS 메시지를 네트워크에 전달할 수 없는 비정상적인 경우에 해당된다. 따라 서, 주기적 등록, MRT 또는 IDT 타이머를 시작/중단하는 트리거를 고려하는 것에 의해 UE 컨텍스트를 처리할 필 요가 있다. 도 6을 참조하면, 1에서, UE에게 전달될 제 1 하향링크 데이터 또는 시그널링이 펜딩 중이다. 2에서, UE는 AMF 엔티티(200b)/eNB(200a)로부터 페이징 절차를 수신한다. 3에서, UE가 사용 중 지시와 함 께 등록 요청 메시지를 AMF 엔티티(200b)로 전송하려고 하지만, AMF 엔티티(200b)에서 수신되지 않는다. 4에서, UE는 네트워크와의 활성 통신 없이 주기적 타이머를 재시작한다. 5에서, AMF 엔티티(200b)가 등록 요청을 수신하지 않았기 때문에, MRT+IDT가 AMF 엔티티(200b)에서 만료되고 UE 컨텍스트가 삭제된다. 도 7은 본 개시의 일 실시예에 따른, RRC 상태가 연결 모드에 들어갈 때 주기적 타이머의 일시정지 시나리오를 예시하는 시그널링 도면이다.도 7에 예시된 시나리오를 참조하면, 단계들은 다음과 같다: 1. 주기적 타이머는 RRC(Radio Resource Control) 상태가 연결 모드로 될 경우에 중지되는 것이 아니라 초기 직 접 전송 메시지가 성공적으로 전송될 경우에 중지되어야 한다. 2. 주기적 타이머는 초기 NAS 메시지를 네트워크와 성공적으로 교환한 이후에만(즉, UE가 서비스 수락 메 시지를 수신하거나 데이터 무선 베어러(DRB)가 확립되거나 등록 수락 또는 등록 해제 수락 메시지가 네트워크로 부터 수신된 이후에만) 중지되어야 한다. 3. 주기적 타이머는 NAS N1 시그널링 연결이 확립된 이후에만 정지되어야 한다. 이 실시예에서는, UE가 등록 절차를 통해 사용 중 지시(Busy indication)(예를 들어 해제 요청으로 불리는 지시를 가짐) 또는 종료 지시(leaving indication)(예를 들어 해제 요청으로 불리는 지시를 가짐)를 전송하려고 시도하고 있으며 또한 등록 절차가 완료되기 전에 UE가 제 2 USIM(Universal Subscriber Identification Module)을 서빙하기 위해 RF를 가져간 경우(즉, UE가 통신 제약으로 인해 등록 절차를 완료할 수 없는 경우) UE 는 업데이트 스테이터스를 U2 NOT UPDATED로 설정하고 그 상태를 ATTEMPTING-REGISTRATION-UPDATE로 설정해야 한다. 따라서 UE는 자신의 통신 제약이 해결될 때마다 등록을 시도할 수 있다. 도 7을 참조하면, 1에서, UE에게 전달될 제 1 하향링크 데이터 또는 시그널링이 펜딩 중이다. 2에서, UE는 AMF 엔티티(200b)/eNB(200a)로부터 페이징 절차를 수신한다. 3에서, UE는 사용 중 지시와 함 께 등록 요청 메시지를 AMF 엔티티(200b)로 전송한다. 4에서, UE는 AMF 엔티티(200b)로부터 등록 수락 메 시지를 수신한다. 5에서, UE는 주기적 타이머를 중지하고 UE와 AMF 엔티티(200b) 사이에 활성 통신 이 확립된 이후에만 초기값으로 다시 시작한다. 도 8은 관련 기술에 따른, UE가 해제 요청 메시지와 함께 등록 요청을 수신하는 시나리오를 예시하는 시그 널링 도면이다. 도 8에 예시된 시나리오를 참조하면, 아래는 도 8에 예시된 문제점들이다. 1) UE의 USIM-1이 네트워크에 페이징 필터들을 설정하여, 네트워크가 특정 서비스들에 대해 UE를 페이징하 지 않도록 한다. 2) UE의 USIM-2 서비스가 진행 중이며 USIM-2에서 진행 중인 서비스의 변경으로 인해 일정 시간 이후에 UE는 네 트워크에 설정된 페이징 필터들을 변경하거나 전체 페이징 제한을 삭제하기로 결정한다. 3a) UE는 예를 들어 자신이 페이징 필터들의 삭제를 원하며 지금 하향링크 데이터의 수신이 가능하다는 것 을 네트워크에 나타내기 위해(예를 들어 \"해제 요청\"으로 불리는 지시로) 네트워크에 대한 NAS 절차(서비스 요 청 또는 등록 요청)를 개시한다. 일반적으로, 페이징 필터들의 삭제는 NAS 메시지에 페이징 필터 IE를 포함하 지 않는 것에 의해 지시된다. 업데이트가 필요한 경우, 새로운 페이징 필터들이 네트워크에 제공된다. 3b) 그러나 동시에 네트워크는 단계 3a와 단계 3b 사이에 충돌이 있는 일부 다른 서비스에 대해 UE에 대한 페이징 절차를 개시한다. 4) 네트워크가 \"해제 요청\"을 포함하는 NAS 메시지를 수신하는 경우, UE가 사용 중이며 UE는 자신에 대해 펜딩 중인 MT(mobile terminated) 시그널링 또는 MT 데이터를 원하지 않는 것으로 잘못 이해하게 된다. 5) 네트워크는 UE에 대해 펜딩 중인 MT 서비스(데이터 또는 통화 또는 시그널링)를 드롭하게 된다. 이것은 해 결해야 할 문제이다. 도 9는 본 개시의 일 실시예에 따른, 종료 절차의 식별 시나리오를 예시하는 시그널링 도면이다. 도 9에 예시된 시나리오를 참조하면, 아래의 제안된 방법은 종료 절차의 식별을 위한 솔루션을 설명한다. 1) UE의 USIM-1은 네트워크에서 페이징 필터들을 설정하여, 네트워크가 특정 서비스들에 대해 UE를 페이징 하지 않도록 한다. 2) UE의 USIM-2 서비스가 진행 중이며 또한 USIM-2에서 진행 중인 서비스의 변경으로 인해 일정 시간 이후에 UE 는 네트워크에 설정된 페이징 필터들을 변경하거나 완전한 페이징 제한을 삭제하기로 결정한다. 3a) UE는 예를 들어 자신이 페이징 필터들의 삭제를 원하며 지금 하향링크 데이터의 수신이 가능하다는 것 을 네트워크에 나타내기 위해(예를 들어 \"해제 요청\"으로 불리는 지시로) 네트워크에 대한 NAS 절차(서비스 요청 또는 등록 요청)를 개시한다. 3b) 그러나 동시에 네트워크는 단계 3a와 단계 3b 사이에 충돌이 있는 일부 다른 서비스에 대해 UE에 대한 페이징 절차를 개시한다. 4) 네트워크가 제 1 지시로 불리는 \"해제 요청\"을 포함하는 NAS 메시지를 수신하는 경우에 네트워크는, 수신된 NAS 메시지가 UE 개시 절차로 인한 것인지 또는 MT 개시 절차로 인한 것인지(즉, 절차가 페이징에 응답하여 개 시됨) 확인하기 위해 제 2 지시(예를 들어 확립 원인으로 불림)를 확인한다. 5) 제 1 지시가 신호 연결을 해제하도록 네트워크에 지시하는 것이고 제 2 지시가 MO(mobile originated) 개시 절차(예를 들어 확립 원인 MO-시그널링을 가짐)로 인한 것임을 지시하는 경우, 네트워크는 이것이 사용 중 절차 가 아니라 종료 절차인 것으로 이해하게 된다. 따라서, 모바일 종료 데이터 또는 모바일 종료 시그널링에 직접 적인 영향은 없다. 또한 NAS 메시지에서 가장 최근에 수신된 페이징 제한들에 기반하여, 네트워크는 기존 NAS 시그널링 연결 상에서 또는 페이징 절차를 해제 및 재시도하고 UE가 연결 모드에 들어간 이후에 모바일 종료 데 이터 또는 모바일 종료 시그널링을 UE에 전달하려고 시도하며 또한 데이터/시그널링을 전달하려고 시도하게 된 다. 도 10은 본 개시의 일 실시예에 따른, NAS 절차(예를 들어, SR 절차 또는 사용 중 절차)의 식별 시나리오를 예 시하는 시그널링 도면이다. 도 10에 예시된 시나리오를 참조하면, 사용 중 절차의 식별을 위한 솔루션들에 대해 제안된 방법은 다음과 같다: 1) UE의 USIM-1이 네트워크에 페이징 필터들을 설정하여, 네트워크가 특정 서비스들에 대해 UE를 페이징하지 않 도록 한다. 2) UE의 USIM-2 서비스가 진행 중이며 우선 순위 서비스이다. 3) USIM-1의 네트워크가 페이징 필터들을 고려한 후 일부 다른 서비스를 위해 UE에 대한 페이징 절차를 개시한 다. 3a) UE는 자신이 사용 중 상태이며 하향링크 시그널링 또는 데이터를 갖기를 원하지 않는다는 것을 네트워 크에 나타내기 위해(예를 들어 \"해제 요청\"으로 불리는 지시로) 네트워크에 대한 NAS 절차(서비스 요청 또는 등 록 요청)를 개시한다. 4) 네트워크가 제 1 지시로 불리는 \"해제 요청\"을 포함하는 NAS 메시지를 수신하는 경우에 네트워크는, 수신된 NAS 메시지가 UE에 의해 개시된 모바일 발신 절차로 인한 것인지 또는 MT에 의해 개시된 절차로 인한 것인지(즉, 절차가 페이징에 응답하여 개시됨) 확인하기 위해 제 2 지시(예를 들어 mt-signaling과 같은 확립 원인으로 불림)를 확인한다. 5) 제 1 지시가 신호 연결을 해제하도록 네트워크에 지시하는 것이고 제 2 지시가 MT 개시 절차(예를 들어 확립 원인 mt-signaling을 가짐)로 인한 것임을 지시하는 경우, 네트워크는 이것이 종료 절차가 아니라 사용 중 절차 인 것으로 이해하게 된다. 이제 이 두 가지 지시를 통해 네트워크는 UE가 하향링크 데이터 또는 시그널링을 받 기를 원하지 않는다는 것을 이해하게 된다. 따라서, 네트워크 측에서의 향후 전달을 위해 데이터가 중단되거나 버퍼링된다."}
{"patent_id": "10-2023-7032314", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "요약하면, 본 솔루션은 다음과 같은 두 가지 지시를 사용한다: 1) 예를 들어, 해제 지시(UE가 NAS 시그널링 연결을 해제하기를 원함을 나타냄)로 불리는 지시; 및 2) NAS 메시지가, a) UE 발신(MO 발신(즉, 모바일 발신)이라고도 함)인지 또는 b) 페이징 메시지에 대한 응답으로 개시된 것인지 여부에 대한 지시. 이 두 가지 지시를 사용하여 네트워크는 수신된 NAS 메시지가 종료 절차로 인한 것인지 또는 사용 중 지시로 인 한 것인지를 결정하고, 펜딩 중인 모바일 종료 데이터/시그널링의 전달을 시도할지 또는 펜딩 중인 모바일 종료 데이터/시그널링의 드롭/버퍼링을 시도할지 여부를 결정한다. 상기한 설명은 IDLE 모드 관점만에 대한 것이며 동일한 솔루션이 INACTIVE 상태에 대해 확장될 수 있다. 상기한 설명은 5G 시스템(5GS)의 관점에서 이루어진 것이며 4G 시스템(4GS) 또는 진화된 패킷 시스템(EPS)에 대 해서도 동일하게 적용 가능하다. AMF가 MME(Mobility Management Entity)로 대체되는 경우, 차세대 gNB(generation node B)가 eNB로 대체된다. eNB와 gNB는 본 명세서에서 상호 교환적으로 사용되며 RAN 노드들 을 나타낸다. 도 11은 본 개시의 일 실시예에 따른 기지국의 내부 구성의 블록도이다. 도 11을 참조하면, 일 실시예에 따른 기지국은 트랜시버, 메모리 및 프로세서를 포함할 수 있다. 기지국의 트랜시버, 메모리 및 프로세서는 전술한 기지국의 통신 방법에 따라 동작할 수 있다. 그러나, 기지국의 구성 요소들이 이에 한정되는 것은 아니다. 예를 들어, 기지국은 위에서 설명된 것보다 더 많거나 더 적은 구성 요소를 포함할 수도 있다. 또한, 프로세서, 트랜시버 및 메모리 는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 트랜시버는 기지국 수신기 및 기지국 송신기를 총칭하는 것이며, 단말과 신호를 송수신할 수 있다. 단말 과 송수신하는 신호에는 제어 정보 및 데이터가 포함될 수 있다. 트랜시버는 송신 신호의 주파수를 상향 변환 및 증폭하는 RF 송신기와, 수신 신호의 주파수를 저잡음 증폭 및 하향 변환하는 RF 수신기를 포함할 수 있 다. 그러나, 이것은 트랜시버의 일 예일 뿐이며 트랜시버의 구성 요소들이 RF 송신기 및 RF 수신 기에 한정되는 것은 아니다. 또한, 트랜시버는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서에서 출 력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 기지국의 동작들에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 기지 국이 획득한 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 ROM(read-only memory), RAM(random access memory), 하드 디스크, CD-ROM, DVD와 같은 저장 매체, 또는 저장 매체의 조합일 수 있다. 프로세서는 기지국이 상술한 바와 같이 동작하도록 하는 일련의 프로세스들을 제어할 수 있다. 예를 들 어, 트랜시버는 UE가 송신한 제어 신호를 포함하는 데이터 신호를 수신하고, 프로세서는 UE가 송신 한 제어 신호 및 데이터 신호의 수신 결과를 결정할 수 있다. 도 12는 본 개시의 일 실시예에 따른 단말의 내부 구조를 나타내는 블록도이다. 도 12에 도시된 바와 같이, 본 개시의 단말은 트랜시버, 메모리 및 프로세서를 포함할 수 있 다. 단말의 트랜시버, 메모리 및 프로세서는 전술한 단말의 통신 방법에 따라 동작할 수 있 다. 그러나, 단말의 구성 요소들은 이에 제한되지 않는다. 예를 들어, 단말은 위에서 설명된 것보다 더 많거 나 더 적은 구성 요소들을 포함할 수도 있다. 또한, 프로세서, 트랜시버 및 메모리는 단일 칩으로 구현될 수도 있다. 또한, 프로세서는 적어도 하나의 프로세서를 포함할 수 있다. 트랜시버는 단말 수신기 및 단말 송신기를 총칭하는 것이며, 기지국과 신호를 송수신할 수 있다. 기지국 과 송수신하는 신호는 제어 정보 및 데이터를 포함할 수 있다. 이와 관련하여, 트랜시버는 송신 신호의 주파수를 상향 변환 및 증폭하는 RF 송신기와, 수신 신호의 주파수를 저잡음 증폭 및 하향 변환하는 RF 수신기 를 포함할 수 있다. 그러나, 이것은 트랜시버의 일 예일 뿐이며 트랜시버의 구성 요소들이 RF 송 신기 및 RF 수신기에 한정되는 것은 아니다. 또한, 트랜시버는 무선 채널을 통해 신호를 수신하여 프로세서로 출력하고, 프로세서에서 출 력된 신호를 무선 채널을 통해 송신할 수 있다. 메모리는 단말의 동작들에 필요한 프로그램 및 데이터를 저장할 수 있다. 또한, 메모리는 단말에 의해 획득된 신호에 포함된 제어 정보 또는 데이터를 저장할 수 있다. 메모리는 ROM, RAM, 하드 디스크, CD-ROM, DVD 등과 같은 저장 매체 또는 이들의 조합일 수 있다. 프로세서는 단말이 상술한 바와 같이 동작하도록 하는 일련의 프로세스들을 제어할 수 있다. 예를 들어, 트랜시버는 제어 신호를 포함하는 데이터 신호를 수신할 수 있고, 프로세서는 데이터 신호를 수신 한 결과를 결정할 수 있다. 청구 범위 또는 본 개시의 상세한 설명에 기재된 실시예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드웨 어와 소프트웨어의 조합으로 구현될 수 있다. 전기적 구조들 및 방법들이 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램 은, 전자 장치 내의 하나 이상의 프로세서에 의해 실행 가능하도록 설정된다. 하나 이상의 프로그램은 본 개시 의 청구항 또는 상세한 설명에 기재된 실시예들에 따른 방법들을 실행하게 하는 명령어들을 포함한다. 프로그램들(예를 들면, 소프트웨어 모듈, 소프트웨어)은 RAM(random access memory), 플래시 메모리를 포함하는 불휘발성 메모리, ROM(Read Only Memory), EEPROM(Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치, CD-ROM(Compact Disc-ROM), DVD:Digital Versatile Disc), 다른 타입의 광학 저장 장 치, 또는 마그네틱 카세트에 저장될 수 있다. 대안적으로, 프로그램들은 전술한 메모리 장치들의 일부 또는 전 부의 조합을 포함하는 메모리 시스템에 저장될 수 있다. 또한, 각 메모리 장치는 복수로 포함될 수 있다. 또한, 프로그램은 인터넷, 인트라넷, LAN(Local Area Network), WLAN(Wide LAN), 또는 SAN(Storage Area Network)과 같은 통신 네트워크, 또는 이들의 조합으로 설정된 통신 네트워크를 통하여 액세스할 수 있는 부착 가능한(attachable) 저장 장치에 저장될 수 있다. 저장 장치는 외부 포트를 통해 본 개시의 실시예들에 따른 장치에 연관될 수 있다. 통신 네트워크 상의 다른 저장 장치가 또한 본 개시의 실시예들을 수행하는 장치에 연 관될 수 있다. 상술한 본 개시의 실시예들에서, 본 개시에 포함되는 구성 요소들은 실시예들에 따라 단수 또는 복수로 표현된 다. 다만, 설명의 편의를 위해 단수 또는 복수의 형태를 적절히 선택하는 것이며, 본 개시가 이에 한정되는 것 은 아니다. 이와 같이 복수형으로 표현된 요소가 단일 요소로 설정될 수도 있고, 단수형으로 표현된 요소가 복 수 요소들로 설정될 수도 있다. 도면들이 사용자 단말의 다양한 예들을 보여주고 있지만 도면들에 다양한 변경이 있을 수 있다. 예를 들어, 사 용자 UE는 임의의 적절한 배열로 임의의 수의 각 구성 요소를 포함할 수 있다. 일반적으로, 도면들은 본 개시 의 범위를 특정 설정(들)으로 제한하지 않는다. 더욱이, 도면들은 본 특허 문서에 개시된 다양한 사용자 단말 기능이 사용될 수 있는 운영 환경을 예시하지만, 이러한 기능은 임의의 다른 적절한 시스템에서 사용될 수 있다. 본 개시가 실시예들로 설명되었지만, 당업자라면 다양한 변경 및 수정을 제안할 수 있다. 본 개시는 첨부된 청 구항들의 범위 내에 속하는 그러한 변경 및 수정을 포함하는 것으로 의도된다. 본 출원의 어떠한 설명도 임의 의 특정 요소, 단계 또는 기능이 청구 범위에 포함되어야 하는 필수 요소임을 나타내는 것으로 해석되어서는 안 된다. 특허된 주제의 범위는 청구범위에 의해 정의된다. 또한, 실시예들은 필요에 따라 서로 조합될 수 있다. 예를 들어, 기지국과 단말은 본 명세서에서 제안하는 방법 중 일부를 조합하여 동작할 수 있다. 또한, 실시예 들이 5G 또는 NR 시스템을 기반으로 제안되어 있지만, 실시예들의 기술적 사상에 기초한 다른 변형예가 LTE(long term evolution), LTE-A(long term evolution advanced), LTE-A-Pro 시스템, 6G 네트워크 및 O-RAN 네트워크 등 다른 시스템에서 구현될 수도 있다. 본 개시가 다양한 실시예들을 참조하여 도시되고 설명되었지만, 첨부된 청구범위 및 그 균등물에 의해 정의되는 본 발명의 사상 및 범주를 일탈하지 않는 범위 내에서 형태 및 세부 사항의 다양한 변경이 이루어질 수 있다는 것이 당업자에 의해 이해될 것이다."}
{"patent_id": "10-2023-7032314", "section": "도면", "subsection": "도면설명", "item": 1, "content": "본 개시의 특정 실시예들의 상기 및 다른 양태들, 특징들 및 이점들은 첨부 도면들과 관련하여 취해지는 다음의 설명으로부터 더욱 명백해질 것이다. 도 1은 본 개시의 일 실시예에 따른, NAS 절차(예를 들어, SR 절차)를 처리하기 위한 무선 네트워크의 개요를 도시한 것이다. 도 2는 본 개시의 일 실시예에 따른, UE(예를 들어, MUSIM UE)의 다양한 하드웨어 구성 요소를 도시한 것이다. 도 3은 본 개시의 일 실시예에 따른, 무선 네트워크에서 SR 절차를 처리하기 위한 방법을 나타내는 흐름도이다.도 4는 관련 기술에 따른, UE가 제 1 하향링크 데이터로 인해 네트워크로부터 페이징 메시지를 수신하는 시나리 오를 예시하는 시그널링 도면이다. 도 5는 본 개시의 일 실시예에 따른, NAS(Non-Access Stratum) 메시지를 사용하는 UE의 설정 시나리오를 예시하 는 시그널링 도면이다. 도 6은 관련 기술에 따른, 주기적 타이머가 만료될 때 UE에 의한 주기적 등록 절차의 시나리오를 예시하는 시그 널링 도면이다. 도 7은 본 개시의 일 실시예에 따른, 무선 자원 제어(RRC) 상태가 연결 모드가 될 때 주기적 타이머의 일시 정 지 시나리오를 예시하는 시그널링 도면이다. 도 8은 관련 기술에 따른, UE가 해제 요청 메시지와 함께 등록 요청을 수신하는 시나리오를 예시하는 시그널링 도면이다. 도 9는 본 개시의 일 실시예에 따른, 종료 절차의 식별 시나리오를 예시하는 시그널링 도면이다. 도 10은 본 개시의 일 실시예에 따른, NAS 절차(예를 들어, SR 절차 또는 사용 중 절차)의 식별 시나리오를 예 시하는 시그널링 도면이다. 도 11은 본 개시의 일 실시예에 따른, 기지국 구성의 블록도이다. 도 12는 본 개시의 일 실시예에 따른, 단말의 구조를 나타내는 블록도이다. 도면 전체에 걸쳐 동일한 구성 요소를 나타내기 위해 동일한 참조번호를 사용하였다."}
