{"patent_id": "10-2021-0190596", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0100916", "출원번호": "10-2021-0190596", "발명의 명칭": "군 지형DB 갱신용 데이터셋 구축 시스템", "출원인": "주식회사 한컴인스페이스", "발명자": "장혜실"}}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "위성, 드론, 지상 카메라로 촬영한 최신 영상과 기 확보된 해당 영상으로 구축된 최근 지형DB 기반의 데이터셋;상기 데이터셋의 영상 데이터를 인공지능 알고리즘을 통해 자동적으로 지형지물 변화를 탐지하는 탐지부와, 상기 지형지물 변화의 특징점을 추출하는 추출부, 및 각 영상 데이터의 성질에 따라 맞는 속성 정보를 국방 지형DB 데이터셋에 입력하는 입력부를 포함하는 갱신장치; 및 상기 데이터셋을 갱신장치의 인공지능 알고리즘을 통해 갱신한 국방 지형DB 데이터셋;을 포함하는 것을 특징으로 하는 군 지형DB 갱신용 데이터셋 구축 시스템."}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 데이터셋은 교통지물(도로, 교량), 인공지물(건물, 송전탑, 굴뚝, 통신탑, 헬기장, 댐), 식생지물(논,밭)을 대상으로 하는 것을 특징으로 하는 군 지형DB 갱신용 데이터셋 구축 시스템."}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 데이터셋은 국방 지형DB에서 분류 지형지물 대상 선별 후, 위성 데이터와 위치정보 및 형상 정보 일치 확인 및 패치 이미지화를 통해 구축하는 것을 특징으로 하는 군 지형DB 갱신용 데이터셋 구축 시스템."}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,상기 데이터셋은 학습을 위해 영상 데이터와 레이블 데이터를 통해 등록하며, 상기 영상 데이터는 TIFF 포맷의 이미지 데이터이며 학습에 사용될 수 있는 데이터로 스트레칭, 히스토그램 매칭의 전처리를 하고 분석하고자 하는 지형지물의 성질에 따라 영상의 종류 및 해상도를 구분하여 구성하고, 상기 레이블 데이터는 SHP 포맷의 벡터 데이터이며 학습에 필요한 지형지물을 추출하기 위하여 영상 데이터로부터 특징점 추출 작업을 선행하여야 하며 특징점 추출 작업이 완료되었을 시 각 데이터의 성질에 따라 맞는 속성정보를 입력하고 영상 데이터와 동일한 목록으로 구성하는 것을 특징으로 하는 군 지형DB 갱신용 데이터셋 구축시스템."}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 데이터셋은 위성, 드론, 지상 카메라로 촬영한 영상 자료를 입력하여 영상 전처리하고, 데이터셋 생성을위한 영상 목록을 구성하여 영상 압축파일을 생성하여 등록하는 것을 특징으로 하는 군 지형DB 갱신용 데이터셋구축 시스템."}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 데이터셋은 영상 전처리로부터 지형지물에 따른 외곽 경계 인지하여 벡터라이징을 통한 객체 추출하고, 추출된 지형지물별 속성 정보 입력을 통해 데이터셋 생성을 위한 레이블 목록 구성하여 레이블 압축파일 생성하여등록하는 것을 특징으로 하는 군 지형DB 갱신용 데이터셋 구축 시스템."}
{"patent_id": "10-2021-0190596", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "공개특허 10-2023-0100916-3-제1항에 있어서,상기 데이터셋은 지형지물의 성질에 따라 객체탐지 데이터셋과 의미론적 분할 데이터셋으로 구분되며,상기 객체탐지용 데이터셋은 위성, 드론, 지상 카메라로 촬영한 영상 자료를 분석용 영상자료로 입력하여 지형지물 단일 객체 인지하고, 객체 외곽 좌상단 좌표값 입력, 객체 외곽 우하단 좌표값 입력, 추출된 지형지물별속성 정보 입력으로 데이터셋 생성을 위한 레이블 목록 구성하여 레이블 압축파일을 생성하고,상기 의미론적 분할 데이터셋은 위성, 드론, 지상 카메라로 촬영한 영상 자료를 분석용 영상자료로 입력하여 지형지물에 따른 외곽 경계 인지하고, 객체외곽 경계 상 버텍스 생성하며, 경계를 따라 버텍스 연속 입력과 추출된 지형지물별 속성 정보 입력으로 데이터셋 생성을 위한 레이블 목록 구성하여 레이블 압축파일 생성하는 것을특징으로 하는 군 지형DB 갱신용 데이터셋 구축 시스템."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 군 지형DB 갱신용 데이터셋 구축 시스템에 관한 것으로, 위성, 드론, 지상 카메라로 촬영한 최신 영상 과 기 확보된 해당 영상으로 구축된 최근 지형DB 기반의 데이터셋; 상기 데이터셋의 영상 데이터를 인공지능 알 고리즘을 통해 자동적으로 지형지물 변화를 탐지하는 탐지부와, 상기 지형지물 변화의 특징점을 추출하는 추출부, 및 각 영상 데이터의 성질에 따라 맞는 속성 정보를 국방 지형DB 데이터셋에 입력하는 입력부를 포함하 는 갱신장치; 및 상기 데이터셋을 갱신장치의 인공지능 알고리즘을 통해 갱신한 국방 지형DB 데이터셋;을 포함하 는 것을 특징으로 한다."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 군 지형DB 갱신용 데이터셋 구축 시스템에 관한 것으로, 더욱 상세하게는 군 지형DB 데이터셋을 자동 으로 갱신할 수 있는 시스템에 관한 것이다."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "군 지형DB는 지형지물에 대한 전통적인 도형에 해당하는 정보와 도형과 연관된 속성 정보 DB를 포함하는 군사용 수치지도이다. 군 지형DB의 제작은 대부분 육안판독을 통해 위성영상으로부터 지형지물을 식별하고 DB를 수정하는 방법으로, 입수된 영상을 보고 지형DB를 최신화하고 이후에 수집된 영상으로 변화된 지형DB 최신화 작업을 수행하는 데에 는 상당한 시간이 소요되며 작업자 간 숙련도 차이로 인해 산출물의 불균일 현상이 발생하고 있다. 군은 지속적으로 다양한 최신 위성영상을 수집하고 있으나 군 지형DB의 갱신이 수동으로 이루어짐에 따라 영상 이 수집되는 속도에 맞추어 실시간 지형DB의 갱신이 이루어지지 못하고 있으므로 자동화 방식으로 사용자가 원 하는 정보 추출이 가능한 도로 경계 및 건물 식별 등을 위한 자동 변화탐지 및 객체 추출 기술과 자동 벡터화 기술이 필요한 실정이다."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상기와 같은 문제점을 해결하기 위한 본 발명의 목적은 딥러닝 기반 영상 분석을 위한 어노테이션 툴을 통해 군 지형DB를 자동으로 갱신할 수 있는 군 지형DB 갱신용 데이터셋 구축 시스템을 제공하는데 있다. 또한, 본 발명의 다른 목적은 지능형 공간정보 분석이 가능한 인공지능 기반 세그먼테이션(Segmentation) 기술 을 통해 다종영상 분석에 대한 레이블링 데이터 구축 작업의 효율성 및 정확도 향상과 확장성을 기반으로 위성 영상, 드론영상, 지상 카메라 등 다양한 해상도에서 적용하여 군 지형DB를 자동으로 갱신할 수 있는 군 지형DB 갱신용 데이터셋 구축 시스템을 제공하는데 있다."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 군 지형DB 갱신용 데이터셋 구축 시스템은 위성, 드론, 지상 카메라로 촬 영한 최신 영상과 기 확보된 해당 영상으로 구축된 최근 지형DB 기반의 데이터셋; 상기 데이터셋의 영상 데이터 를 인공지능 알고리즘을 통해 자동적으로 지형지물 변화를 탐지하는 탐지부와, 상기 지형지물 변화의 특징점을 추출하는 추출부, 및 각 영상 데이터의 성질에 따라 맞는 속성 정보를 국방 지형DB 데이터셋에 입력하는 입력부 를 포함하는 갱신장치; 및 상기 데이터셋을 갱신장치의 인공지능 알고리즘을 통해 갱신한 국방 지형DB 데이터셋;을 포함하는 것을 특징으로 한다. 상기 데이터셋은 교통지물(도로, 교량), 인공지물(건물, 송전탑, 굴뚝, 통신탑, 헬기장, 댐), 식생지물(논, 밭)을 대상으로 하는 것을 특징으로 한다.상기 데이터셋은 국방 지형DB에서 분류 지형지물 대상 선별 후, 위성 데이터와 위치정보 및 형상 정보 일치 확 인 및 패치 이미지화를 통해 구축하는 것을 특징으로 한다. 상기 데이터셋은 학습을 위해 영상 데이터와 레이블 데이터를 통해 등록하며, 상기 영상 데이터는 TIFF 포맷의 이미지 데이터이며 학습에 사용될 수 있는 데이터로 스트레칭, 히스토그램 매칭의 전처리를 하고 분석하고자 하 는 지형지물의 성질에 따라 영상의 종류 및 해상도를 구분하여 구성하고, 상기 레이블 데이터는 SHP 포맷의 벡 터 데이터이며 학습에 필요한 지형지물을 추출하기 위하여 영상 데이터로부터 특징점 추출 작업을 선행하여야 하며 특징점 추출 작업이 완료되었을 시 각 데이터의 성질에 따라 맞는 속성 정보를 입력하고 영상 데이터와 동 일한 목록으로 구성하는 것을 특징으로 한다. 상기 데이터셋은 위성, 드론, 지상 카메라로 촬영한 영상 자료를 입력하여 영상 전처리하고, 데이터셋 생성을 위한 영상 목록을 구성하여 영상 압축파일을 생성하여 등록하는 것을 특징으로 한다. 상기 데이터셋은 영상 전처리로부터 지형지물에 따른 외곽 경계 인지하여 벡터라이징을 통한 객체 추출하고, 추 출된 지형지물별 속성 정보 입력을 통해 데이터셋 생성을 위한 레이블 목록 구성하여 레이블 압축파일 생성하여 등록하는 것을 특징으로 한다. 상기 데이터셋은 지형지물의 성질에 따라 객체탐지 데이터셋과 의미론적 분할 데이터셋으로 구분되며, 상기 객 체탐지용 데이터셋은 위성, 드론, 지상 카메라로 촬영한 영상 자료를 분석용 영상자료로 입력하여 지형지물 단 일 객체 인지하고, 객체 외곽 좌상단 좌표값 입력, 객체 외곽 우하단 좌표값 입력, 추출된 지형지물별 속성 정 보 입력으로 데이터셋 생성을 위한 레이블 목록 구성하여 레이블 압축파일을 생성하고, 상기 의미론적 분할 데 이터셋은 위성, 드론, 지상 카메라로 촬영한 영상 자료를 분석용 영상자료로 입력하여 지형지물에 따른 외곽 경 계 인지하고, 객체외곽 경계 상 버텍스 생성하며, 경계를 따라 버텍스 연속 입력과 추출된 지형지물별 속성 정 보 입력으로 데이터셋 생성을 위한 레이블 목록 구성하여 레이블 압축파일 생성하는 것을 특징으로 한다."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "상기와 같이, 본 발명에 따르면 군 지형DB 구축 자동화로 수동적이고 비효율적인 군 지형 DB 구축 중심의 업무 체계에서 업무 분산화를 통한 효율성 향상과 작업자 간의 능력 차이로 발생하는 산출물의 불균일 현상을 개선할 수 있다. 또한, 본 발명에 따르면 위성영상 분석의 자동화를 통해 신속하고 효과적인 군 정찰정보 분석을 가능하게 할 뿐 만 아니라 군의 작전 수행 능력 향상을 지원할 수 있다. 그리고, 본 발명에 따르면 수동분석 업무를 자동화 체계로 변환하여 인력, 시간, 비용을 경감시킬 수 있으며 해 외 기술에 의존하지 않고 국산화된 기술을 도입함으로써 구축 비용과 고도화 비용 등을 절감할 수 있다."}
{"patent_id": "10-2021-0190596", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시 예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시 예에 한정되지 않는다. 그러면 본 발명에 따른 군 지형DB 갱신용 데이터셋 구축 시스템의 바람직한 실시예에 대하여 자세히 설명하기로 한다. 도 1은 본 발명에 따른 군 지형DB 갱신용 데이터셋 구축 시스템을 나타낸 구성도이다. 도 1을 참조하면, 본 발명에 따른 군 지형DB 갱신용 데이터셋 구축 시스템은 데이터셋, 갱신장치, 및 국방 지형DB 데이터셋을 포함하여 구성된다.상기 데이터셋은 국방 지형DB 데이터셋의 갱신을 위하여 위성, 드론, 지상 카메라 등으로 촬영한 최 신 영상과 기 확보된 해당 영상으로 구축된 최근 지형DB 기반으로 한다. 상기 데이터셋은 국방 지형DB 데이터셋 구축 자동화를 위해 교통지물(도로, 교량), 인공지물(건물, 송전탑, 굴뚝, 통신탑, 헬기장, 댐), 식생지물(논, 밭)을 대상으로 할 수 있다. 여기서, 국방 지형DB는 군사지도 제작을 위한 기반자료로써 활용하기 때문에 교통지물 특히 도로의 경우 차선 수, 표면상태, 폭 등의 속성정보까지 필요하고, 교량의 경우 폭과 길이 속성정보가 요구되며, 도로의 폭, 교량 의 길이 및 폭은 해상도와 픽셀 수를 이용하여 단순 산술 계산이 가능하지만, 차선 수, 표면 상태는 지형지물 분류와 같이 AI 모델을 기반으로 알고리즘 개발을 통해 식별 가능하다. 또한, 상기 데이터셋은 국방 지형DB에서 분류 지형지물 대상 선별 후, 위성 데이터와 위치정보 및 형상 정 보 일치 확인 및 패치 이미지화를 통해 구축할 수 있으며, 도로의 경우 도로를 분류하는 것뿐만 아닌 차선 수, 표면 상태 등을 학습해야 하므로 Multi-Label 기법을 적용하여 구축할 수 있다. 여기서, 상기 데이터셋은 학습을 위해 영상 데이터와 레이블 데이터를 통해 등록할 수 있다. 상기 영상 데이터는 TIFF 포맷의 이미지 데이터이며 학습에 효율적으로 사용될 수 있는 데이터로 스트레칭, 히 스토그램 매칭 등의 전처리를 하고 분석하고자 하는 지형지물의 성질에 따라 영상의 종류 및 해상도를 구분하여 구성할 수 있다. 도 2는 본 발명에 따른 데이터셋 등록을 나타낸 흐름도이다. 도 2를 참조하면, 위성, 드론, 지상 카메라로 촬영한 영상 자료를 입력(S100)하고, 입력 영상을 전처리(S110)하 여 데이터셋 생성을 위한 영상 목록을 구성(S120)하며, 영상 압축파일(.zip)을 생성(S130)을 통해 데이터 셋을 등록(S140)한다. 상기 레이블 데이터는 SHP 포맷의 벡터 데이터이며 학습에 필요한 지형지물을 추출하기 위하여 영상 데이터로부 터 특징점 추출 작업을 선행하여야 하며 특징점 추출 작업이 완료되었을 시 각 데이터의 성질에 따라 맞는 속성 정보를 입력하고 영상 데이터와 동일한 목록으로 구성될 수 있다. 도 2를 참조하면, (S110)단계의 영상 전처리로부터 지형지물에 따른 외곽 경계 인지(S150)하여 벡터라이징을 통 한 객체 추출(S160)하고, 추출된 지형지물별 속성 정보 입력(S170)을 통해 데이터셋 생성을 위한 레이블 목록 구성(S180)하며, 레이블 압축파일(.zip) 생성(S190)을 통해 데이터셋을 등록할 수 있다. 이렇게 생성된 데이터는 각각 영상 데이터셋와 레이블 데이터셋을 1쌍으로 구성하고 모델이 분석하고자 하는 객 체를 탐지할 수 있는 성능에 도달할 때까지 반복적으로 생성하여 딥러닝 학습데이터로 사용할 수 있다. 여기서, 상기 데이터셋의 종류는 탐지하고자 하는 지형지물의 성질에 따라 크게 객체탐지(Object detection) 데이터셋과 의미론적 분할(Semantic segmentation) 데이터셋으로 구분된다. 상기 객체탐지용 데이터셋은 탐지하고자 하는 지형지물의 종류나 영역, 위치 등을 분석하기 위한 용도로 활용되 며, 레이블링 데이터 제작 시 바운딩 박스(Bounding box)의 형태로 제작할 수 있다. 도 3은 본 발명에 따른 객체 탐지 레이블 데이터 생성을 나타낸 흐름도이다. 도 3을 참조하면, 위성, 드론, 지상 카메라로 촬영한 영상 자료를 분석용 영상자료로 입력(S200)하여 지형지물 단일 객체 인지(S210)하고, 객체 외곽 좌상단 좌표값 입력(S220), 객체 외곽 우하단 좌표값 입력(S230), 추출된 지형지물별 속성 정보 입력(S240)으로 데이터셋 생성을 위한 레이블 목록 구성(S250)하여 레이블 압축파일 (.zip) 생성(S260)한다. 상기 의미론적 분할 데이터셋은 대상 지형지물의 영역을 동일한 클래스별로 군집화하여 면적이나 위치 등을 분 석하기 위한 용도로 활용되며, 레이블링 데이터 제작 시 지형지물의 외곽 경계와 일치하는 다각형의 형태로 제 작할 수 있다. 도 4는 본 발명에 따른 의미론적 분할 데이터셋 구성을 나타낸 흐름도이다. 도 4를 참조하면, 위성, 드론, 지상 카메라로 촬영한 영상 자료를 분석용 영상자료로 입력(S300)하여 지형지물 에 따른 외곽 경계 인지(S310)하고, 객체외곽 경계 상 버텍스 생성(S320)하며, 경계를 따라 버텍스 연속 입력과 추출된 지형지물별 속성 정보 입력(S340)으로 데이터셋 생성을 위한 레이블 목록 구성(S350)하여 레이블 압축파일(.zip) 생성(S360)한다. 상기 데이터셋은 활용 용도에 따라 학습데이터와 검증데이터, 시험데이터로 나누어 구성하는데 지형지물별로 구 분하여 각각 구성하며, 일반적으로 학습데이터 : 검증데이터 : 시험데이터를 7 : 2 : 1의 비율로 구성할 수 있 다. 상기 갱신장치는 원격 또는 근거리 네트워크로 연결된 서버나 데스크톱 컴퓨터 또는 노트북 컴퓨터 등이 포함되고, 여기에 갱신을 위한 하드웨어 모듈과 소프트웨어 모듈 등이 포함될 수 있다. 상기 갱신장치는 데이터셋의 입력 영상을 인공지능 알고리즘을 통해 자동적으로 지형지물 변화를 탐 지하는 탐지부와, 지형지물 변화의 특징점 추출하는 추출부, 및 각 영상 데이터의 성질에 따라 맞는 속성 정보를 국방 지형DB 데이터셋에 입력하는 입력부를 포함할 수 있다. 상기 국방 지형DB 데이터셋은 갱신장치 입력부의 정보를 통해 데이터셋을 갱신할 수 있다. 이상에서 본 발명의 실시 예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 당업자의 여러 변형 및 개량 형태 또한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2021-0190596", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명에 따른 군 지형DB 갱신용 데이터셋 구축 시스템을 나타낸 구성도이다. 도 2는 본 발명에 따른 데이터셋 등록을 나타낸 흐름도이다. 도 3은 본 발명에 따른 객체 탐지 레이블 데이터 생성을 나타낸 흐름도이다. 도 4는 본 발명에 따른 의미론적 분할 데이터셋 구성을 나타낸 흐름도이다."}
