{"patent_id": "10-2019-0100039", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0103091", "출원번호": "10-2019-0100039", "발명의 명칭": "무인 비행체의 스테이션", "출원인": "엘지전자 주식회사", "발명자": "이상학"}}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비행을 완료한 무인 비행체가 착륙하는 무인 비행체 스테이션에 있어서,상기 무인 비행체의 착륙 지점을 안내하는 가이드 표식이 형성된 착지면을 갖는 컨트롤 박스;상기 컨트롤 박스 내에 배치되고, 수직 이동 가능한 승강부; 및상기 승강부와 결합되어 수직 이동하며, 수직 이동시에 최고점의 높이는 적어도 상기 착지면보다 높게 위치하는착지대;를 포함하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 착지대는,수직 이동시에 최저점의 높이는 상기 착지면보다 같거나 낮은 상태인 것을 특징으로 하는 무인 비행체스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1 항에 있어서,상기 승강부는,상기 착지대가 결합되는 프레임;제1 단이 상기 컨트롤 박스 내에서 수평이동하며 제2 단이 상기 프레임의 일 지점에서 일정반경 회전운동하도록체결되는 제1 지지대; 및제1 단이 상기 컨트롤 박스 내에서 고정되고, 제2 단이 상기 프레임의 일면에서 이동가능하도록 체결되는 제2지지대를 포함하고,상기 제1 지지대 및 상기 제2 지지대는 회전 이동이 가능한 힌지를 통해서 X자 형태를 이루도록 연결되어, 상기제1 지지대의 수평이동에 따라 상기 제1 및 제2 지지대의 수직 높이가 달라지는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 승강부는,모터에 의해서 회전운동을 하는 피니언; 및상기 피니언의 회전운동에 따라 수평 이동하는 래크;를 포함하고, 상기 제1 지지대의 제1 단은 상기 래크에 고정되는 것을 특징으로 하는 무인 비행체 스테이션.공개특허 10-2019-0103091-3-청구항 5 제 1 항에 있어서,상기 승강부는,상기 프레임에 고정되고, 수직으로 배치된 수직 래크; 및모터에 의해서 회전운동을 하고, 회전운동에 따라 상기 수직 래크를 수직 이동시키는 피니언;을 포함하는 것을특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1 항에 있어서,상기 착지대는,상기 프레임에서 일정 간격 이격되어 수직으로 배치된 수직지지대; 및상기 수직 프레임에서 굴곡지도록 신장된 수평바;를 포함하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6 항에 있어서,상기 수평바의 적어도 일부 영역은 자성체를 갖는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 착지대는,상기 프레임에서 일정 간격 이격되어 수직으로 배치된 수직지지대; 및상기 수직 프레임의 끝단에 소정의 넓이를 갖는 수평판;을 포함하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 수평바의 적어도 일부 영역은 자성체를 갖는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항에 있어서,상기 착지면은,상기 착지대가 이동하는 경로에 해당하는 제1 슬롯; 및상기 제1 슬롯과 인접한 곳에 배치된 제2 슬롯을 더 포함하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "공개특허 10-2019-0103091-4-제 1 항에 있어서,상기 착지면에 안착된 상기 무인 비행체를 덮는 커버부를 더 포함하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서,상기 커버의 일측면들 중에서 적어도 어느 하나의 면에서, 하나 이상의 슬롯이 형성되는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 11 항에 있어서,상기 승강부의 승하강 이동 및 상기 커버부의 개폐 동작을 수행하는 구동모듈;상기 무인 비행체와 통신을 수행하는 통신모듈; 및상기 통신부로부터 상기 무인 비행체의 접근 정보를 제공받은 경우, 상기 착지면이 노출되도록 상기 커버부를오프시키면서, 상기 승강부가 상승하도록 상기 구동장치를 제어하는 제어모듈을 더 포함하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 무인 비행체가 상기 착지대에 착륙을 완료한 경우,상기 제어모듈은상기 승강부를 하강시키도록 상기 구동장치를 제어하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 착지대는 압력 센서를 포함하고,상기 제어모듈은 상기 압력 센서의 센싱 결과를 바탕으로 상기 무인 비행체의 착륙 여부를 판단하는 것을 특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 14 항에 있어서,상기 착지대 주위의 영상을 획득하는 영상 획득부를 더 포함하고,상기 제어모듈은 상기 영상 획득부가 획득한 영상을 바탕으로 상기 무인 비행체의 착륙 여부를 판단하는 것을특징으로 하는 무인 비행체 스테이션."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 무인 비행체 스테이션은 상기 무인 비행체의 착륙 지점을 안내하는 가이드 표식이 형 성된 착지면을 갖는 컨트롤 박스, 상기 컨트롤 박스 내에 배치되고 수직 이동 가능한 승강부, 및 상기 승강부와 결합되어 수직 이동하며, 수직 이동시에 최고점의 높이는 적어도 상기 착지면보다 높게 위치하는 착지대를 포함 한다. 본 발명은 인공 지능(Artificail Intelligenfce) 모듈, 로봇, 증강 현실(Augmented Reality, AR) 장치, 가상 현 실(virtual reality, VR) 장치, 5G 서비스와 관련된 장치 등과 연계될 수 있다."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무인 비행체의 스테이션에 관한 것으로, 특히 무인 비행체를 보다 정확하게 착륙시킬 수 있고, 사이 즈 및 무게를 줄일 수 있는 무인 비행체의 스테이션에 관한 것이다."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무인 비행체는 조종사 없이 무선전파의 유도에 의해서 비행 및 조종이 가능한 비행기, 헬리콥터 모양의 무인항 공기(UAV, Unmanned aerial vehicle / Uninhabited aerial vehicle)의 총칭한다. 최근 무인 비행체는 정찰, 공 격 등의 군사적 용도 이외에 영상 촬영, 무인 택배 서비스, 재해 관측 등 다양한 민간·상업 분야에도 활용이 증가되고 있다. 무인 비행체는 탑재된 배터리 용량이 작기 때문에 장시간 비행이 불가능하다. 따라서, 비행 지역 이외에서는 무인 비행체를 스테이션에 보관하고, 스테이션에 보관된 상태로 무인 비행체를 이동시키는 것이 일반적이다. 또한, 비행을 완료한 무인 비행체는 스테이션에 착륙하게 된다. 무인 비행체가 스테이션에 착륙하는 과정에서 하향하는 무인 비행체로 인해서 기류가 발생하고, 이로 인해서 무 인 비행체는 기류에 의한 외력을 받는다. 따라서, 무인 비행체를 착륙시키기 위한 제어가 곤란하기도 하고, 무 인 비행체는 원하는 착륙지점으로부터 이격된 곳에 착륙하게 된다. 따라서, 스테이션은 무인 비행체의 착륙 오 차범위를 고려한 크기로 형성되어야 한다. 즉, 스테이션은 실질적으로 무인 비행체가 탑재되는 공간 보다 더욱 큰 크기로 형성되어야 한다."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하는 것을 목적으로 한다. 또한, 본 발명은 무인 비행체의 착륙 오차범위를 줄일 수 있는 스테이션을 제공하기 위한 것이다. 또한, 본 발명은 무인 비행체가 착륙 과정에서 스테이션과 충돌하는 것을 방지할 수 있는 스테이션을 제공하기 위한 것이다. 또한, 본 발명은 사이즈를 줄일 수 있는 무인 비행체의 스테이션을 제공하기 위한 것이다."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 무인 비행체 스테이션은 상기 무인 비행체의 착륙 지점을 안내하는 가이드 표식이 형 성된 착지면을 갖는 컨트롤 박스, 상기 컨트롤 박스 내에 배치되고 수직 이동 가능한 승강부, 및 상기 승강부와 결합되어 수직 이동하며, 수직 이동시에 최고점의 높이는 적어도 상기 착지면보다 높게 위치하는 착지대를 포함 한다. 일 실시 예에 따른 상기 착지대는, 수직 이동시에 최저점의 높이는 상기 착지면보다 같거나 낮은 상태일 수 있 다. 일 실시 예에 따른 상기 승강부는, 상기 착지대가 결합되는 프레임; 제1 단이 상기 컨트롤 박스 내에서 수평이 동하며 제2 단이 상기 프레임의 일 지점에서 일정반경 회전운동하도록 체결되는 제1 지지대; 및 제1 단이 상기 컨트롤 박스 내에서 고정되고, 제2 단이 상기 프레임의 일면에서 이동가능하도록 체결되는 제2 지지대를 포함하 고, 상기 제1 지지대 및 상기 제2 지지대는 회전 이동이 가능한 힌지를 통해서 X자 형태를 이루도록 연결되어, 상기 제1 지지대의 수평이동에 따라 상기 제1 및 제2 지지대의 수직 높이가 달라질 수 있다. 일 실시 예에 따른 상기 승강부는, 모터에 의해서 회전운동을 하는 피니언; 및 상기 피니언의 회전운동에 따라 수평 이동하는 래크;를 포함하고, 상기 제1 지지대의 제1 단은 상기 래크에 고정될 수 있다. 일 실시 예에 따른 상기 승강부는, 상기 프레임에 고정되고, 수직으로 배치된 수직 래크; 및 모터에 의해서 회 전운동을 하고, 회전운동에 따라 상기 수직 래크를 수직 이동시키는 피니언;을 포함할 수 있다.일 실시 예에 따른 상기 착지대는, 상기 프레임에서 일정 간격 이격되어 수직으로 배치된 수직지지대; 및 상기 수직 프레임에서 굴곡지도록 신장된 수평바;를 포함할 수 있다. 일 실시 예에 따른 상기 수평바의 적어도 일부 영역은 자성체를 가질 수 있다. 일 실시 예에 따른 상기 착지대는, 상기 프레임에서 일정 간격 이격되어 수직으로 배치된 수직지지대; 및 상기 수직 프레임의 끝단에 소정의 넓이를 갖는 수평판;을 포함할 수 있다. 일 실시 예에 따른 상기 수평바의 적어도 일부 영역은 자성체를 가질 수 있다. 일 실시 예에 따른 상기 착지면은, 상기 착지대가 이동하는 경로에 해당하는 제1 슬롯; 및 상기 제1 슬롯과 인 접한 곳에 배치된 제2 슬롯을 더 포함할 수 있다. 일 실시 예에 따른 상기 착지면에 안착된 상기 무인 비행체를 덮는 커버를 더 포함할 수 잇다. 일 실시 예에 따른 상기 커버의 일측면 중에서 적어도 어느 하나에서, 하나 이상의 슬롯이 형성될 수 있다. 일 실시 예에 따른 스테이션은 상기 승강부의 승하강 이동 및 상기 커버부의 개폐 동작을 수행하는 구동모듈; 상기 무인 비행체와 통신을 수행하는 통신모듈; 및 상기 통신부로부터 상기 무인 비행체의 접근 정보를 제공받 은 경우, 상기 착지면이 노출되도록 상기 커버부를 오프시키면서, 상기 승강부가 상승하도록 상기 구동장치를 제어하는 제어모듈을 더 포함할 수 있다. 일 실시 예에 따른 제어모듈은 상기 무인 비행체가 상기 착지대에 착륙을 완료한 경우, 상기 승강부를 하강시키 도록 상기 구동장치를 제어할 수 있다. 일 실시 예에 따른 스테이션은 상기 착지대는 압력 센서를 포함하고, 상기 제어모듈은 상기 압력 센서의 센싱 결과를 바탕으로 상기 무인 비행체의 착륙 여부를 판단할 수 있다. 일 실시 예에 따른 스테이션은 상기 착지대 주위의 영상을 획득하는 영상 획득부를 더 포함하고, 상기 제어모듈 은 상기 영상 획득부가 획득한 영상을 바탕으로 상기 무인 비행체의 착륙 여부를 판단할 수 있다."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 승강부를 이용하여 착지대를 상승시킴으로써 무인 비행체는 착륙하는 과정에서 하 부의 기류에 의한 외력을 보다 적게 받기 때문에, 착륙 오차범위를 줄일 수 있다. 또한, 본 발명의 실시 예에 따르면, 무인 비행체는 스테이션의 가이드 표식에 보다 정확하게 착륙할 수 있기 때 문에, 착륙 과정에서 스테이션과 충돌하는 것을 방지할 수 있다. 또한, 본 발명의 실시 예에 따르면, 무인 비행체는 보다 정확한 위치에 스테이션에 착륙할 수 있기 때문에, 스 테이션은 작은 사이즈로 형성될 수 있다."}
{"patent_id": "10-2019-0100039", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 이하, AI 프로세싱된 정보를 필요로 하는 장치 및/또는 AI 프로세서가 필요로 하는 5G 통신(5th generation mobile communication)을 단락 A 내지 단락 G를 통해 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 무인 비행체의 사시도를 나타낸다. 우선, 무인 비행체은 지상의 관리자에 의해 수동 조작되거나, 설정된 비행 프로그램에 의해 자동 조종되면 서 무인 비행하게 되는 것이다. 이와 같은 무인 비행체은 도 1에서와 같이 본체, 수평 및 수직이동 추 진장치, 및 착륙용 레그를 포함하는 구성으로 이루어진다. 본체는 작업부 등의 모듈이 장착되는 몸체 부위이다. 수평 및 수직이동 추진장치는 본체에 수직으로 설치되는 하나 이상의 프로펠러로 이루어지는 것으 로, 본 발명의 실시예에 따른 수평 및 수직이동 추진장치는 서로 이격 배치된 복수개의 프로펠러와 모 터로 이루어진다. 여기서 수평 및 수직이동 추진장치는 프로펠러가 아닌 에어 분사형 추진기 구조 로 이루어질 수도 있다. 복수 개의 프로펠러 지지부는 본체에서 방사상으로 형성된다. 각각의 프로펠러 지지부에는 모터 가 장착될 수 있다. 각각의 모터에는 프로펠러가 장착된다. 복수 개의 프로펠러는 본체를 중심을 기준하여 대칭되게 배치될 수 있다. 그리고 복수 개의 프로펠러 의 회전 방향은 시계 방향과 반 시계 방향이 조합되도록 모터의 회전 방향이 결정될 수 있다. 본체(2 0)를 중심을 기준하여 대칭되는 한 쌍의 프로펠러의 회전 방향은 동일(예를 들어, 시계 방향)하게 설정될 수 있다. 그리고 다른 한 쌍의 프로펠러은 이와 달리 회전 방향이 반대일 수 있다.(예를 들어, 시계 반대 방향) 착륙용 레그는 본체의 저면에 서로 이격 배치된다. 또한, 착륙용 레그의 하부에는 무인 비행체 가 착륙할 때 지면과의 충돌에 의한 충격을 최소화하는 완충 지지부재(미도시)가 장착될 수 있다. 물론 무인 비행체는 상술한 바와 다른 비행체 구성의 다양한 구조로 이루어질 수 있다. 도 2를 참조하면, 무인 비행체은 안정적으로 비행하기 위해서 각종 센서들을 이용해 자신의 비행상태를 측 정한다. 무인 비행체는 적어도 하나의 센서를 포함하는 센서부를 포함할 수 있다. 무인 비행체의 비행상태는 회전운동상태(Rotational States)와 병진운동상태(Translational States)로 정 의된다. 회전운동상태는 '요(Yaw)', '피치 (Pitch)', 및 '롤 (Roll)'을 의미하며, 병진운동상태는 경도, 위도, 고도, 및 속도를 의미한다. 여기서, '롤', '피치', 및 '요'는 오일러 (Euler) 각도라 부르며, 비행기 기체좌표 x,y,z 세 축이 어떤 특정 좌 표, 예를 들어, NED 좌표 N, E, D 세 축에 대하여 회전된 각도를 나타낸다. 비행기 전면이 기체좌표의 z축을 기 준으로 좌우로 회전할 경우, 기체좌표의 x축은 NED 좌표의 N축에 대하여 각도 차이가 생기게 되며, 이각도를 \" 요\"(Ψ)라고 한다. 비행기의 전면이 오른쪽으로 향한 y축을 기준으로 상하로 회전을 할 경우, 기체좌표의 z축은 NED 좌표의 D축에 대하여 각도 차이가 생기게 되며, 이 각도를 \"피치\"()라고 한다. 비행기의 동체가 전면을 향 한 x축을 기준으로 좌우로 기울게 될 경우, 기체좌표의 y축은 NED 좌표의 E축에 대하여 각도가 생기게 되며, 이 각도를 \"롤\"(Φ)이라 한다. 무인 비행체은 회전운동상태를 측정하기 위해 3축 자이로 센서(Gyroscopes), 3축 가속도 센서 (Accelerometers), 및 3축 지자기 센서(Magnetometers)를 이용하고, 병진운동상태를 측정하기 위해 GPS 센서와 기압 센서(Barometric Pressure Sensor)를 이용한다. 본 발명의 센서부는 자이로 센서, 가속도 센서, GPS 센서, 영상 센서 및 기압 센서 중 적어도 하나를 포함 한다. 여기서, 자이로 센서와 가속도 센서는 무인 비행체의 기체좌표(Body Frame Coordinate)가 지구관성 좌표(Earth Centered Inertial Coordinate)에 대해 회전한 상태와 가속된 상태를 측정해주는데, MEMS(Micro- Electro-Mechanical Systems) 반도체 공정기술을 이용해 관성측정기(IMU: Inertial Measurement Unit)라 부르 는 단일 칩(Single Chip)으로 제작될 수도 있다. 또한, IMU 칩 내부 에는 자이로 센서와 가속도 센서가 측정한 지구관성좌표 기준의 측정치들을 지역좌표 (Local Coordinate), 예를 들어 GPS가 사용하는 NED(North-East- Down) 좌표로 변환해주는 마이크로 컨트롤러가 포함될 수 있다. 자이로 센서는 무인 비행체의 기체좌표 x, y, z 세 축이 지구관성좌표에 대하여 회전하는 각속도를 측정한 후 고정좌표로 변환된 값(Wx.gyro, Wy.gyro, Wz.gyro)을 계산하고, 이 값을 선형 미분방정식을 이용해 오일러 각도(Φgyro, θgyro, ψgyro)로 변환한다. 가속도 센서는 무인 비행체의 기체좌표 x, y, z 세 축의 지구관성좌표에 대한 가속도를 측정한 후 고정좌 표로 변환된 값(fx,acc, fy,acc, fz,acc)을 계산하고, 이 값을 '롤(Φacc)'과 '피치(θacc)'로 변환하며, 이 값 들은 자이로 센서의 측정치를 이용해 계산한 '롤(Φgyro)'과 '피치(θgyro)'에 포함된 바이어스 오차를 제거 하는 데 이용된다. 지자기 센서는 무인 비행체의 기체좌표 x, y, z 세 축의 자북점에 대한 방향을 측정하고, 이 값을 이용해 기체좌표의 NED 좌표에 대한 '요' 값을 계산한다. GPS 센서는 GPS 위성들로부터 수신한 신호를 이용해 NED 좌표 상에서 무인 비행체의 병진운동상태, 즉, 위 도(Pn.GPS), 경도(Pe.GPS), 고도(hMSL.GPS), 위도 상의 속도(Vn.GPS), 경도 상의 속도(Ve.GPS), 및 고도 상의 속도(Vd.GPS)를 계산한다. 여기서, 첨자 MSL은 해수면(MSL: Mean Sea Level)을 의미한다. 기압 센서는 무인 비행체의 고도(hALP.baro)를 측정할 수 있다. 여기서, 첨자 ALP는 기압(Air-Level Pressor)을 의미하며, 기압 센서는 무인 비행체의 이륙시 기압과 현재 비행고도에서의 기압을 비교해 이륙 지점으로부터의 현재 고도를 계산한다. 카메라 센서는 적어도 하나의 광학렌즈와, 광학렌즈를 통과한 광에 의해 상이 맺히는 다수개의 광다이오드 (photodiode, 예를 들어, pixel)를 포함하여 구성된 이미지센서(예를 들어, CMOS image sensor)와, 광다이오드 들로부터 출력된 신호를 바탕으로 영상을 구성하는 디지털 신호 처리기(DSP: Digital Signal Processor)를 포함 할 수 있다. 디지털 신호 처리기는 정지영상은 물론이고, 정지영상으로 구성된 프레임들로 이루어진 동영상을 생성하는 것도 가능하다. 무인 비행체는, 정보를 입력받거나 수신하고 정보를 출력하거나 송신하는 커뮤니케이션 모듈을 포함 한다. 커뮤니케이션 모듈은 외부의 다른 기기와 정보를 송수신하는 드론 통신부를 포함할 수 있다. 커뮤니케이션 모듈은 정보를 입력하는 입력부를 포함할 수 있다. 커뮤니케이션 모듈은 정보를 출력하는 출력부를 포함할 수 있다. 물론, 출력부는 무인 비행체에 생략되고 단말기에 형 성될 수 있다. 일 예로, 무인 비행체는 입력부로부터 직접 정보를 입력받을 수 있다. 다른 예로, 무인 비행체 는 별도의 단말기 또는 서버에 입력된 정보를 드론 통신부를 통해 수신받을 수 있다. 일 예로, 무인 비행체는 출력부로 직접 정보를 출력시킬 수 있다. 다른 예로, 무인 비행체는 드 론 통신부를 통해 별도의 단말기로 정보를 송신하여, 단말기가 정보를 출력하게 할 수 있다. 드론 통신부는, 외부의 서버, 단말기 등과 통신하게 구비될 수 있다. 드론 통신부는, 스마 트폰이나 컴퓨터 등의 단말기로부터 입력된 정보를 수신할 수 있다. 드론 통신부는 단말기로 출 력될 정보를 송신할 수 있다. 단말기는 드론 통신부로부터 받은 정보를 출력할 수 있다. 드론 통신부는 단말기 또는/및 서버로부터 각종 명령 신호를 수신할 수 있다. 드론 통신부 는 단말기 또는/및 서버로부터 주행을 위한 구역 정보, 주행 경로, 주행 명령을 수신받을 수 있 다. 여기서, 구역 정보는 비행 제한 구역(A) 정보, 접근 제한 거리 정보를 포함할 수 있다. 또한, 드론 통신부 는 후술하는 스테이션의 통신모듈과 통신을 수행한다. 입력부는 On/Off 또는 각종 명령을 입력받을 수 있다. 입력부는 구역 정보를 입력받을 수 있다. 입력 부는 물건 정보를 입력받을 수 있다. 입력부는, 각종 버튼이나 터치패드, 또는 마이크 등을 포함할 수 있다. 출력부는 각종 정보를 사용자에게 알릴 수 있다. 출력부는 스피커 및/또는 디스플레이를 포함할 수 있다. 출력부는 주행 중 감지한 발견물의 정보를 출력할 수 있다. 출력부는 발견물의 식별 정보를 출 력할 수 있다. 출력부는 발견물의 위치 정보를 출력할 수 있다. 무인 비행체는 맵핑 및/또는 현재 위치를 인식하는 등 각종 정보를 처리하고 판단하는 제어부를 포함 한다. 제어부는 무인 비행체를 구성하는 각종 구성들의 제어를 통해, 무인 비행체의 동작 전반 을 제어할 수 있다. 제어부는 커뮤니케이션 모듈로부터 정보를 받아 처리할 수 있다. 제어부는 입력부로부터 정보를 입력 받아 처리할 수 있다. 제어부는 드론 통신부로부터 정보를 받아 처리할 수 있다. 제어부 는 센싱부로부터 감지 정보를 입력 받아 처리할 수 있다. 제어부는 모터의 구동을 제어할 수 있다. 제어부는 작업부의 동작을 제어할 수 있다. 무인 비행체는 각종 데이터를 저장하는 저장부를 포함한다. 저장부는 무인 비행체의 제어 에 필요한 각종 정보들을 기록하는 것으로, 휘발성 또는 비휘발성 기록 매체를 포함할 수 있다. 저장부에는 주행구역에 대한 맵이 저장될 수 있다. 맵은 무인 비행체와 드론 통신부을 통해 정 보를 교환할 수 있는 외부 단말기에 의해 입력된 것일 수도 있고, 무인 비행체가 스스로 학습을 하여 생성한 것일 수도 있다. 전자의 경우, 외부 단말기로는 맵 설정을 위한 어플리케이션(application)이 탑재 된 리모콘, PDA, 랩탑(laptop), 스마트 폰, 태블릿 등을 예로 들 수 있다. 도 3을 참조하면, 본 발명의 일 실시예에 다른 항공 제어 시스템은 무인 비행체와 서버를 포함하거나, 무인 비행체, 단말기 및 서버를 포함할 수 있다. 무인 비행체, 단말기 및 서버는 서로 무선 통신 방법으로 연결된다. 무선 통신 방법은 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등이 사용될 수 있다. 무선 통신 방법은 무선 인터넷 기술이 사용될 수 있다. 무선 인터넷 기술로는, 예를 들어 WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(LongTerm Evolution-Advanced), 5G 등이 있다. 특히 5G 통신망을 이용하여 데이터를 송수신함으로써 보다 빠른 응답 이 가능하다. 단말기는 무인 비행체를 제어하는 제어명령을 입력 받는 컨트롤러와 시각적 또는 청각적 정보를 출력 하는 출력부를 포함할 수 있다. 서버는 무인 비행체의 비행이 제한되는 비행 제한 구역(A) 정보를 저장하고, 무인 비행체의 자 율 주행 레벨에 따라 비행 제한 구역(A)의 접근 제한 거리를 다르게 산정하고, 무인 비행체 및 단말기 중 적어도 하나에 비행 제한 구역(A) 정보와 접근 제한 거리 정보를 제공한다. 따라서, 자유 주행에 레벨 이 높은 무인 비행체의 경우 효율적인 경로를 주행하도록 하고, 자율 주행 레벨이 낮은 무인 비행체 의 경우 자율 주행 레벨이 낮은 무인 비행체가 비행 제한 구역(A)에 근접하여 발생할 수 있는 사고를 예방 할 수 있는 이점이 존재한다. 또한, 서버는 비행 제한 구역(A) 정보와 접근 제한 거리 정보를 바탕으로 비행 경로를 설정하고, 비행 경 로를 무인 비행체 및 단말기 중 적어도 하나에 제공할 수 있다. 적극적으로, 서버는 비행 제한 구역(A) 정보와 자율 주행 레벨에 따른 접근 제한 거리 정보를 바탕으로 비 행 경로를 설정하고, 비행 경로 대로 무인 비행체를 제어할 수 있다. 서버는 무인 비행체가 접근 제한 거리 이내로 접근하면, 자율 주행 레벨에 따라 무인 비행체에 상이한 명령을 송신할 수 있다. 서버는 무인 비행체의 자동 조정 또는 수동 조정 여부에 무인 비행체 에 상이한 명령을 송신할 수 있다. 예를 들면, 서버는 무인 비행체 또는/및 단말기와 정보를 주고받는 통신부, 무인 비행체의 자율 주행 레벨을 판단하는 레벨판단 유닛, 무인 비행체의 비행이 제한되는 비행 제한 구역(A) 정보 를 저장하는 저장부 및 무인 비행체 또는/및 단말기에 정보를 제공하거나, 무인 비행체 또 는/및 단말기는 제어하는 컨트롤 유닛을 포함할 수 있다. 또한, 서브는 무인 비행체에서 제공받 은 위치 고도 정보를 통해 무인 비행체의 위치 및 고도를 판단하는 위치판단 유닛을 더 포함할 수도 있다. 저장부는 항공관제를 위하여 비행 제한 구역(A)에 대한 정보를 저장하고, 무인 비행체의 자율 주행 레벨에 대한 정보를 저장하며, 무인 비행체의 항공관제에 대한 정보를 저장할 수 있다. 레벨판단 유닛은 무인 비행체의 자율 주행 레벨을 판단한다. 무인 비행체의 자율 주행 레벨은 무인 비행체에서 서버로 송신된 자율 주행 레벨 정보를 통해 판단하거나, 단말기에서 제공된 자 율 주행 레벨 정보를 통해 판단한다. 무인 비행체의 자율 주행 레벨은 완전히 수동 주행만 가능하거나, 수동 주행을 각종 센서로 보조하는 수준 을 레벨 1로 정의하고, 무인 비행체가 반 자율 주행(자동이착륙, 소극적 장애물 회피, 사용자가 지정한 경 로 대로 이동)을 하는 수준을 레벨 2로 정의하며, 무인 비행체가 완전한 자율 주행(스스로 경로를 생성하 고 목적지(S2)로 이동하고, 스스로 작업을 수행)하는 수준을 레벨 3으로 정의할 수 있다. 컨트롤 유닛은 무인 비행체의 자율 주행 레벨에 따라 비행 제한 구역(A)의 접근 제한 거리를 다르게 산정하고, 무인 비행체 또는/및 단말기에 비행 제한 구역(A) 정보와 접근 제한 거리 정보를 제공한다. 비행 제한 구역(A)의 정보는 비행 제한 구역(A)의 위치 정보와, 비행 제한 구역(A)의 경계 정보를 포함할 수 있 다. 여기서, 컨트롤 유닛의 정보를 무인 비행체 또는/및 단말기에 제공하는 것은 5G 등의 무선 통신 방법으로 정보 데이터를 무인 비행체 또는/및 단말기에 송신하는 것을 의미한다. 무인 비행체 스테이션 도 4는 본 발명의 실시 예에 따른 무인 비행체의 구성을 나타내는 블록도이다. 도 5 내지 도 7 본 발명의 실시 예에 따른 무인 비행체 스테이션을 나타내는 도면이다. 도 5는 본 발명의 실시 예에 따른 무인 비행체 스테이션의 사시도이고, 도 6은 무인 비행체 스테이션의 정면도이며, 도 7은 무인 비행체 스테이션의 측면도이다. 도 8은 무인 비행체 스테이션의 승강부의 일 실시 예를 나타내는 도면이다. 이하, 본 명세서에서 수평면은 컨트롤 박스의 착지면(LP)과 평행한 xy 평면을 지칭하고, 수직방향은 수평면에 수직한 z축 방향을 지칭하기로 한다. 상부 및 하부는 z축에서 상대적인 높이를 지칭하고, 지평면을 기준으로 높은 고동의 z축 방향을 상부 방향, 그 반대의 방향을 하부 방향으로 지칭하기로 한다. 도 4 내지 도 8를 참조하면, 본 발명의 실시 예에 따른 무인 비행체 스테이션(이하, 스테이션)은 컨트롤 박스, 센싱모듈, 승강부, 착지대 및 커버부(1410,1420)를 포함한다. 컨트롤 박스 는 내부 공간을 갖는 박스 형태일 수 있고, 무인 비행체가 착지하는 착지면(LP)을 갖는다. 컨트롤 박스는 제어모듈, 구동모듈 및 통신모듈을 포함한다. 제어모듈은 구동모듈을 제어하는 제어신호를 생성한다. 구동모듈은 스테이션에 속하 는 기구적인 구동을 수행하며, 예를 들어 커버부(1410,1420) 및 승강부를 구동시키는 모터 등을 포함한다. 통신모듈은 무인 비행체의 드론 통신부 또는 서버(미도시)와의 통신을 수행하고, 이를 통해서 무인 비행체의 비행 상태 또는 착륙 예정 등을 판단할 수 있다. 또한, 컨트롤 박스의 내부 공간에는 무인 비행체를 무선 충전시키기 위한 구성을 포함할 수 있다. 또한 컨트롤 박스의 내부 공간에는 후술하는 승강부가 탑재될 수 있다. 컨트롤 박스의 일면은 착지면(LP)으로 형성될 수 있다. 도 4 내지 도 6에 도시된 실시 예는 컨트롤 박스 의 상부면 외측에 착지면(LP)이 형성된 실시 예를 도시하고 있다. 착지면(LP)은 무인 비행체의 착륙 지점을 안내하는 가이드 표식(GM)을 포함한다. 착지면(LP)은 최종적으 로 무인 비행체가 안착되는 위치에 해당한다. 본 발명의 실시 예에서, 무인 비행체는 후술하는 착지 대에 착지하고, 착지대는 수직 하강함으로써 무인 비행체를 착지면(LP)상에 안착시킬 수 있다. 실시 예에 따라서, 무인 비행체는 착지면(LP)에 직접 접촉하지 않을 수도 있다. 착지면(LP)에서 가이드 표식(GM)과 인접한 영역에는 승강부가 착지면(LP)을 수직 이동하는 경로를 제공하 기 위한 슬롯(S1)이 형성될 수 있다. 슬롯(S1)은 가이드 표식(GM)의 영역 내에 위치하여도 무방하다. 승강부는 컨트롤 박스 내에서 수직 이동하며, 이에 따라 승강부의 상부에 위치한 착지대 는 수직 이동할 수 있다. 착지대는 승강부의 상측에 위치하고, 일 실시 예에 따른 착지대는 한 쌍의 바(bar)의 형태로 구현될 수 있다. 커버부(1410,1420)는 컨트롤 박스의 상부 영역을 덮는 구조물이며, 슬라이딩 형태로 개폐되는 제1 및 제2 커버들(1410,1420)을 포함한다. 제1 커버 및 제2 커버는 서로 이격되도록 슬라이딩하여 착지면 (LP)이 노출되도록 컨트롤 박스의 상부 영역을 오픈시킨다. 착지면(LP)상에 무인 비행체가 착지할 경우, 제1 및 제2 커버들(1410,1420)을 서로 맞닿도록 슬라이딩하여 컨트롤 박스의 상부 영역을 닫을 수 있다. 도 8은 승강부 및 착지대의 실시 예를 나타내는 도면이다. 도 8을 참조하면, 제1 실시 예에 의한 승강부는 제1 지지대, 제2 지지대, 래크, 피니 언 및 프레임을 포함한다. 제1 지지대 및 제2 지지대는 제1 힌지(h1)를 통해서 체결되어, X자 형태를 갖는다. 제1 지지대 및 제2 지지대는 제1 힌지(h1)을 중심으로 일정반경 회전운동할 수 있다. 제1 지지대의 제1 단은 제2 힌지(h2)를 통해서 래크와 연결되고, 제2 단은 제3 힌지 (h3)를 통해서 프레임과 연결된다. 제1 지지대의 제1 단은 래크의 수평 이동에 따라 제2 힌지(h2)를 중심으로 일정 반경 회전운동할 수 있다. 제1 지지대의 제1 단이 수평이동함에 따 라 제2 단은 제1 단과 반대 방향으로 수평이동하면서 수직 이동한다. 제2 지지대의 제1 단은 컨트롤 박스 내에서 고정되고, 제2 단은 롤러(R1)와 연결된다. 롤러 (R1)는 프레임의 하부면에서 수평 이동할 수 있도록 체결된다. 예를 들어, 도면에는 도시하지 않았지만, 롤러(R1)는 프레임의 하부면에 형성된 홈에 삽입되는 형태로 프레임과 체결될 수 있다. 래크는 컨트롤 박스의 하부면에 위치하고, 피니언과 체결된다. 피니언은 모터(미도시)에 의해서 회전운동을 하고, 래크는 피니언의 회전운동에 따라 수평운동을 한다. 래크가 수평 이동함에 따라, 제1 지지대의 제1 단은 수평운동을 하면서, 제1 지지대의 수직 성분의 길이는 가변한다. 또한, 제1 지지대가 수평운동을 할 때, 제2 지지대의 제2 단은 롤러(R1)에 의해서 프레임 의 하면을 따라 수평 이동한다. 프레임은 제1 내지 제4 프레임 바(1131~1134)를 포함한다. 제1 내지 제4 프레임 바(1131~1134)는 끝단 이 서로 연결되어 액자 틀의 형태를 이룰 수 있다. 제1 프레임 바는 승강부가 연결된다. 제1 프레임 바의 일단에는 제1 지지대의 제2 단 이 연결되고, 제1 프레임 바의 타단에는 제2 지지대의 제2 단과 연결되는 롤러(R1)가 체결된다. 도면에서는 승강부가 제1 프리임 바에서만 연결된 실시 예를 도시하고 있지만, 승강부는 제2 프레임 바에도 동일한 구조로 형성된 승강부가 연결될 수 있다. 착지대는 제1 착지대 및 제2 착지대를 포함한다. 제1 착지대는 제1 프레임 바(113 1)에서 일정 간격 이격된 제1 수직지지대 및 제1 수직지지대에서 수평 방향으로 굴곡지도록 신장된 제1 수평바를 포함할 수 있다. 제1 수직지지대 및 제1 수평바는 일체형으로 이루어져서, 철 봉 형태가 될 수 있다. 제2 착지대는 제1 착지대와 동일한 구조를 갖는 제2 수직지지대 및 제2 수평바를 포함 할 수 있다. 도 9는 본 발명의 실시 예에 따른 스테이션의 동작을 나타내는 순서도이다. 도 9를 참조하여 스테이션의 동작을 살펴보면 다음과 같다. 제1 단계(S910)에서, 스테이션은 무인 비행체의 접근을 감지한다. 스테이션은 통신모듈을 통해서 무인 비행체의 드론 통신부와 통신하거나, 서버의 통신부와 통신할 수 있다. 스테이션을 무인 비행체 또는 서버와의 통신을 통해서 무인 비행체의 착륙 여부 및 접근 여부를 판단할 수 있다. 제2 단계(S920)에서, 무인 비행체가 착륙을 위해서 스테이션에 접근할 경우, 스테이션의 제어 모듈은 구동모듈을 구동한다. 즉, 구동모듈은 커버부를 오픈시키고, 승강부를 상승시킨다. 예를 들어, 구동모듈은 모터를 회전시켜서 래크 또는 수직 래크를 이동시킴으 로써, 승강부를 상승시킬 수 있다. 도 10은 제2 단계(S920)에서 스테이션의 동작을 나타내는 도면이다. 도 10을 참조하면, 무인 비행체를 착지대에 안착시키기 위해서, 제1 및 제2 커버들(1410,1420)은 착 지대 및 가이드 표식(GM)을 노출시키도록 오픈된다. 승강부는 수직 이동할 수 있는 범위 내에서 최고 높이까지 상승한다. 무인 비행체는 가이드 표식(GM)을 기준으로 하강하고, 하강하는 과정에서 착지대에 착륙한다. 승강부는 최고 높이로 상승한 상태이기 때문에, 무인 비행체가 착륙할 때 무인 비행체의 하부 에서 발생하는 하강 기류의 영향을 덜 받는 지점에서 착지대에 착륙할 수 있다. 그 결과, 무인 비행체는 착지면(LP)에 바로 착륙하는 것보다, 보다 정확한 위치에 착륙할 수 있다. 따라 서, 무인 비행체가 착륙하는 과정에서 무인 비행체와 무인 비행체 스테이션 간의 충돌이 발생 하는 것을 방지할 수 있고, 무인 비행체 스테이션의 전체 사이즈 및 무게를 줄일 수 있다. 제3 단계(S930)에서, 스테이션은 무인 비행체가 완전히 착륙한지 여부를 판단한다. 무인 비행체 의 착륙 여부를 판단하기 위해서, 스테이션은 센싱모듈을 이용할 수 있다. 예를 들어, 센싱 모듈은 착지대와 연결되는 압력센서를 포함하고, 제어모듈은 압력센서의 센싱 결과를 바탕으 로 무인 비행체의 착륙 여부를 판단할 수 있다. 또는 센싱모듈은 카메라 등을 이용하여 착지대 주위의 영상을 획득하고, 제어모듈은 해당 영상을 판독하여 무인 비행체의 착륙 여부를 판단할 수 있다. 제4 단계(S940)에서, 무인 비행체가 착륙할 경우, 스테이션의 제어모듈은 구동모듈을 구동하여, 커버부를 폐쇄시키고, 승강부를 하강시킨다. 도 11은 무인 비행체가 착지대에 착륙하였을 때, 스테이션의 동작을 나타내는 도면이다.도 11 을 참조하면, 무인 비행체가 착지대에 안착된 경우, 승강부는 하강한다. 승강부는 착 지대가 착지면(LP)과 동일한 위치 또는 착지면(LP) 보다 낮은 곳에 위치할 때까지 하강할 수 있다. 그리 고, 제1 및 제2 커버들(1410,1420)은 착지면(LP)에 안착한 무인 비행체를 덮도록 슬라이딩한다. 도 12는 본 발명의 다른 실시 예에 의한 승강부를 나타내는 도면이다. 도 12를 참조하면, 다른 실시 예에 의한 승강부는 피니언 및 수직 래크를 포함한다. 피니언은 모터(미도시)와 결합되고, 모터에 의해서 회전운동을 한다. 피니언은 모터에 연결되어, 특정 위치에 고정될 수 있다. 수직 래크의 일단은 제1 프레임 바에 고정되고, 타단은 컨트롤 박스 내에서 수직 이동이 가 능하게 배치된다. 수직 래크는 수직 이동이 가능하도록 홀이 형성된 구조체에 삽입되는 형태로 배치될 수 있다. 도 12에서 승강부는 제1 프레임 바에서만 연결된 실시 예를 도시하고 있지만, 승강부는 제2 내지 제4 프레임 바들(1152~1154) 중에서 어느 하나 이상의 프레임 바에 추가적으로 연결될 수도 있다. 도 13은 본 발명의 다른 실시 예에 의한 착지대를 나타내는 도면이다. 도 13을 참조하면, 본 발명의 다른 실시 예에 의한 착지대는 제1 내지 제4 수직지지대(1131~1134) 및 제1 내지 제4 수평바(1241~1244)를 포함한다. 제1 내지 제4 수직지지대(1131~1134)는 서로 일정 간격 이격되어, 제1 내 지 제4 프레임 바(1231~1234)들로 이루어지는 프레임과 연결된다. 예를 들어 제1 내지 제4 수직지지대 (1131~1134)는 프레임의 네 모서리에서 각각 연결될 수 있다. 제1 내지 제4 수평바(1241~1244)는 각각 소정의 넓이를 갖는 판형으로 이루어지고, 제1 내지 제4 수직지지대 (1131~1134)에 연결될 수 있다. 예를 들어, 제1 수평바는 제1 수직지지대와 연결될 수 있다. 제1 내지 제4 수평바(1241~1244)는 무인 비행체가 1차적으로 착지하는 공간을 제공한다. 예를 들어, 무 인 비행체의 착륙용 레그는 제1 내지 제4 수평바(1241~1244)들에 안착될 수 있다. 또한, 제1 내지 제4 수평바(1241~1244)의 형태로 구현되는 착지대는 착륙용 레그의 형태에 구애받지 않고 무인 비행체를 안착시킬 수 있다. 무인 비행체의 착륙용 레그는 도 1에 도시된 실시 예 이외에 다양 한 형태로 구형될 수 있으며, 경우에 따라서, 바 형태의 착지대에 안착하기 곤란한 구조일 수 있다. 도 13에 도시된 실시 예에 의한 착지대는 제1 내지 제4 수평바들(1241~1244)이 서로 이격된 위치에 형성된 수직지지대와 연결되기 때문에, 다양한 무인 비행체의 착륙용 레그 형상에 대응할 수 있고, 경우에 따라 착륙용 레그가 없는 무인 비행체의 본체를 안착시킬 수도 있다. 도 14 및 도 15는 본 발명의 또 다른 실시 예에 의한 착지대를 나타내는 도면이다. 도 14를 참조하면, 착지대는 제1 착지대 및 제2 착지대를 포함한다. 제1 및 제2 착지대들 (1210,1220)은 도 8 및 도 11에서와 같이, 철봉 형태로 이루어질 수 있다. 제1 및 제2 착지대들(1210,1220)은 수평바의 일부에 자성체를 포함할 수 있다. 예를 들어, 제1 및 제2 착지대들(1210,1220) 자체가 자성을 갖는 물질로 이루어질 수 있고, 무인 비행체의 착륙용 레그와 접촉하는 영역이 자성을 갖는 물질로 이 루어질 수 있다. 또는 무인 비행체의 착륙용 레그와 접촉하는 영역 부위에서 자성을 갖는 물질이 삽 입될 수 있다. 도 15를 참조하면, 착지대는 서로 이격된 제1 내지 제4 수직지지대(1231~1234), 및 제1 내지 제4 수직지지대 (1231~1234)의 끝단에 형성된 제1 내지 제4 수평판(1241~1244)을 포함한다. 제1 내지 제4 수평판(1241~1244) 은 자성체를 포함할 수 있다. 살펴본 바와 같이, 도 13 및 도 14에 도시된 실시 예들은 착지대에 자성체를 포함한다. 이에 따라, 금속의 물 질로 이루어지는 무인 비행체의 착륙용 레그가 보다 수월하고 정확하게 안착함으로써, 무인 비행체 가 스테이션의 다른 구성품과 충돌하는 것을 방지할 수 있다. 도 16은 다른 실시 예에 따른 스테이션을 나타내는 도면이다. 도 16을 참조하면, 스테이션은 컨트롤 박스, 승강부, 착지대 및 커버부(1410,1420)를 포함한다. 도 16에서, 컨트롤 박스, 승강부 및 착지대는 전술한 실시 예들과 실질적으로 동 일한 구성으로 이루어질 수 있으며, 이에 따라 자세한 설명을 생략하기로 한다. 도 16을 참조하면, 컨트롤 박스의 착지면(LP)은 착지대가 이동하는 경로에 해당하는 제1 슬롯(S1) 이외에도, 가이드 표식(GM) 주위에 형성된 제2 슬롯(S2)을 포함한다. 또한, 커버부(1410,1420)의 일측면에는 제3 슬롯(S3)이 형성될 수 있다. 제2 슬롯(S2) 및 제3 슬롯(S3)은 무인 비행체가 하강할 때 발생하는 기류가 흐를 수 있는 경로를 제공한다. 이에 따라. 무인 비행체는 하강할 때 발생하는 기류에 의한 그라운드 이펙트(ground effect)를 덜 받고, 보다 정확한 지점에 착륙할 수 있다. 본 명세서에 기재된 구성들은 모든 면에서 제한적으로 해석되어서는 아니되고 예시 적인 것으로 고려되어야 한 다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0100039", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 무인 비행체를 도시한 사시도이다. 도 2는 도 1의 무인 비행체의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 항공 제어 시스템의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 4는 본 발명의 실시 예에 따른 무인 비행체 스테이션의 구성을 나타내는 도면이다. 도 5 내지 도 7은 본 발명의 실시 예에 따른 무인 비행체 스테이션을 나타내는 도면이다. 도 8은 무인 비행체 스테이션의 승강부의 일 실시 예를 나타내는 도면이다. 도 9는 본 발명의 실시 예에 따른 무인 비행체 스테이션의 동작을 나타내는 순서도이다. 도 10 및 도 11는 무인 비행체가 착륙하는 과정에서 무인 비행체 스테이션의 동작을 설명하는 도면들이다. 도 12는 본 발명의 다른 실시 예에 의한 승강부를 나타내는 도면이다.도 13은 본 발명의 다른 실시 예에 의한 착지대를 나타내는 도면이다. 도 14 및 도 15는 본 발명의 또 다른 실시 예에 의한 착지대를 나타내는 도면이다. 도 16은 다른 실시 예에 따른 스테이션을 나타내는 도면이다."}
