{"patent_id": "10-2023-7001655", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0025455", "출원번호": "10-2023-7001655", "발명의 명칭": "데이터 전송 방법 및 장치", "출원인": "후아웨이 테크놀러지 컴퍼니 리미티드", "발명자": "수에 이판"}}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "데이터 전송 방법으로서, 단말에 의해, 상기 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하는 단계 - 상기 단말은 비접속상태에 있음 - 와,상기 채널 품질이 제 1 임계값보다 큰 경우, 상기 단말에 의해, 업링크 데이터를 랜덤 액세스 방식으로 또는 설정된 승인(configured grant(CG)) 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계 -상기 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함함 - 를 포함하되,상기 단말에 의해, 업링크 데이터를 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로결정하는 것은, 상기 채널 품질이 제 2 임계값보다 큰 경우, 상기 단말에 의해, 상기 업링크 데이터를 상기 2-스텝 랜덤 액세스방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것, 또는상기 채널 품질이 제 2 임계값보다 작은 경우, 상기 단말에 의해, 상기 업링크 데이터를 상기 4-스텝 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것을 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서, 상기 단말에 의해, 상기 업링크 데이터를 상기 2-스텝 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에송신하는 것으로 결정한 이후에, 상기 방법은,상기 채널 품질이 제 3 임계값보다 큰 경우, 상기 단말에 의해, 상기 2-스텝 랜덤 액세스 방식에 대응하는 제 1전송 리소스에 기초해서, 상기 업링크 데이터를 MsgA로 상기 액세스 네트워크 디바이스에 송신하는 단계를 더포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제 1 전송 리소스에 대응하는 설정 정보는 상기 제 3 임계값을 포함하거나; 또는상기 제 3 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 상기 제 1 전송 리소스의 전송 파라미터는 상기 제 3 임계값에 대응하는 전송 파라미터임계값보다 크거나; 또는상기 제 3 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 상기 제 1 전송 리소스의 전송 파라미터는 상기 제 3 임계값에 대응하는 전송 파라미터 범위에 속하는,공개특허 10-2023-0025455-3-데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1 항 내지 제 3 항 중 어느 한 항에 있어서, 상기 단말에 의해, 업링크 데이터를 랜덤 액세스 방식으로 또는 설정된 승인(CG) 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계는, 상기 단말에 의해, 상기 타이밍 어드밴스(TA)가 유효한지 여부를 결정하는 단계 - 상기 TA는 상기 단말과 상기액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용됨 - 와,상기 TA가 유효하지 않은 경우, 상기 단말에 의해, 상기 업링크 데이터를 상기 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계; 또는상기 TA가 유효한 경우, 상기 단말에 의해, 상기 업링크 데이터를 상기 CG 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계 - 상기 CG 방식에 대응하는 CG 리소스는, 상기 액세스 네트워크 디바이스에 의해 사전 설정되고 상기 비접속 상태의 상기 단말에 의한 전송에 사용되는 물리 업링크 공유 채널(PUSCH)리소스임 - 를 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항 내지 제 4 항 중 어느 한 항에 있어서, 상기 단말에 의해, 상기 업링크 데이터를 상기 CG 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로결정한 이후에, 상기 방법은,상기 채널 품질이 제 4 임계값보다 큰 경우, 상기 단말에 의해, 상기 업링크 데이터를 제 1 CG 리소스에 기초해서 상기 액세스 네트워크 디바이스에 송신하는 단계를 더 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 제 1 CG 리소스에 대응하는 설정 정보는 상기 제 4 임계값을 포함하거나; 또는상기 제 4 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 상기 제 1 CG 리소스의 전송 파라미터는 상기 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는상기 제 4 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 상기 제 1 CG 리소스의 전송 파라미터는 상기 제 4 임계값에 대응하는 전송 파라미터 범위에 속하는,데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 3 항 또는 제 6 항에 있어서,상기 전송 파라미터는 변조 및 코딩 방식(modulation and coding scheme; MCS)과 전송 블록 속도(transport공개특허 10-2023-0025455-4-block speed; TBS) 중 하나 이상을 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 4 항 내지 제 7 항 중 어느 한 항에 있어서, 상기 TA가 유효하지 않은 것은, 상기 TA의 유효 기간이 만료된 것과;상기 단말의 현재 위치와 상기 TA가 시작될 때 상기 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과;상기 채널 품질과, 상기 TA가 시작될 때 달성되는 상기 단말과 상기 액세스 네트워크 디바이스 사이의 채널의품질 사이의 차이가 채널 품질 변경 임계값보다 큰 것중 하나 이상을 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1 항 내지 제 8 항 중 어느 한 항에 있어서,상기 채널 품질이 상기 제 1 임계값보다 작고 상기 채널 품질이 상기 제 5 임계값보다 큰 경우, 상기 단말에 의해, 상기 업링크 데이터를 상기 비접속 상태의 상기 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 상기2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 단계, 또는상기 채널 품질이 상기 제 1 임계값보다 작고 상기 채널 품질이 상기 제 5 임계값보다 작은 경우, 상기 단말에의해, 상기 업링크 데이터를 상기 비접속 상태의 상기 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 상기 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 단계를 더 포함하는 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1 항 내지 제 9 항 중 어느 한 항에 있어서,상기 제 1 임계값, 상기 제 2 임계값 및 상기 제 3 임계값은 상기 단말에 대해서 상기 액세스 네트워크 디바이스에 의해 설정되는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "데이터 전송 방법으로서, 단말에 의해, 상기 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하는 단계 - 상기 단말은 비접속상태에 있음 - 와,상기 채널 품질이 제 6 임계값보다 크고 상기 채널 품질이 제 7 임계값보다 큰 경우, 상기 단말에 의해, 업링크데이터를 상기 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계; 또는상기 채널 품질이 제 6 임계값보다 작고 상기 채널 품질이 제 8 임계값보다 큰 경우, 상기 단말에 의해, 업링크데이터를 상기 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계공개특허 10-2023-0025455-5-를 포함하는 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 11 항에 있어서, 상기 단말에 의해, 업링크 데이터를 상기 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는것으로 결정하는 단계는, 상기 단말에 의해, 타이밍 어드밴스(TA)가 유효한지 여부를 결정하는 단계 - 상기 TA는 상기 단말과 상기 액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용됨 - 와,상기 TA가 유효하지 않은 경우, 상기 단말에 의해, 상기 업링크 데이터를 상기 상기 2-스텝 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계를 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 12 항에 있어서,상기 TA가 유효한 경우, 상기 단말에 의해, 상기 업링크 데이터를 설정된 승인(configured grant(CG)) 방식으로상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계 - 상기 CG 방식에 대응하는 CG 리소스는, 상기 액세스 네트워크 디바이스에 의해 사전 설정되고 상기 비접속 상태의 상기 단말에 의한 전송에 사용되는 물리 업링크 공유 채널(PUSCH) 리소스임 - 를 더 포함하는 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 11 항 내지 제 13 항 중 어느 한 항에 있어서, 상기 단말에 의해, 상기 업링크 데이터를 상기 2-스텝 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에송신하는 것으로 결정한 이후에, 상기 방법은,상기 채널 품질이 제 3 임계값보다 큰 경우, 상기 단말에 의해, 2-스텝 랜덤 액세스 방식에 대응하는 제 1 전송리소스에 기초해서, 상기 업링크 데이터를 MsgA로 상기 액세스 네트워크 디바이스에 송신하는 단계를 더 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서, 상기 제 1 전송 리소스에 대응하는 설정 정보는 상기 제 3 임계값을 포함하거나; 또는상기 제 3 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 상기 제 1 전송 리소스의 전송 파라미터는 상기 제 3 임계값에 대응하는 전송 파라미터임계값보다 크거나; 또는상기 제 3 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 상기 제 1 전송 리소스의 전송 파라미터는 상기 제 3 임계값에 대응하는 전송 파라미터 범위에 속하는, 공개특허 10-2023-0025455-6-데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항 내지 제 15 항 중 어느 한 항에 있어서, 상기 단말에 의해, 상기 업링크 데이터를 설정된 승인(CG) 방식으로 상기 액세스 네트워크 디바이스에 송신하는것으로 결정한 후에, 상기 방법은, 상기 채널 품질이 제 4 임계값보다 큰 경우, 상기 단말에 의해, 상기 업링크 데이터를 제 1 CG 리소스에 기초해서 상기 액세스 네트워크 디바이스에 송신하는 단계를 더 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 16 항에 있어서,상기 제 1 CG 리소스에 대응하는 설정 정보는 상기 제 4 임계값을 포함하거나; 또는상기 제 4 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 상기 제 1 CG 리소스의 전송 파라미터는 상기 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는상기 제 4 임계값은 적어도 하나의 임계값에 포함되되, 상기 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 상기 제 1 CG 리소스의 전송 파라미터는 상기 제 4 임계값에 대응하는 전송 파라미터 범위에 속하는,데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 15 항 또는 제 17 항에 있어서,상기 전송 파라미터는 변조 및 코딩 방식(MCS)과 전송 블록 속도(TBS) 중 하나 이상을 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 12 항 내지 제 18 항 중 어느 한 항에 있어서, 상기 TA가 유효하지 않은 것은, 상기 TA의 유효 기간이 만료된 것과;상기 단말의 현재 위치와 상기 TA가 시작될 때 상기 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과;상기 채널 품질과, 상기 TA가 시작될 때 달성되는 상기 단말과 상기 액세스 네트워크 디바이스 사이의 상기 채널의 품질 사이의 차이가 채널 품질 변경 임계값보다 큰 것중 하나 이상을 포함하는, 데이터 전송 방법.공개특허 10-2023-0025455-7-청구항 20 제 11 항 내지 제 19 항 중 어느 한 항에 있어서,상기 채널 품질이 상기 제 6 임계값보다 크고 상기 채널 품질이 상기 제 7 임계값보다 작은 경우, 상기 단말에의해, 상기 업링크 데이터를 상기 비접속 상태의 상기 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 상기 2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 단계, 또는상기 채널 품질이 상기 제 6 임계값보다 작고 상기 채널 품질이 상기 제 8 임계값보다 작은 경우, 상기 단말에의해, 상기 업링크 데이터를 상기 비접속 상태의 상기 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 상기 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 단계를 더 포함하는 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 11 항 내지 제 20 항 중 어느 한 항에 있어서,상기 제 6 임계값, 상기 제 7 임계값 및 상기 제 8 임계값은 상기 단말에 대해서 상기 액세스 네트워크 디바이스에 의해 설정되는,데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "통신 시스템으로서, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하도록 구성된 상기 단말 - 상기 단말은 비접속 상태에 있음 - 을 포함하되,상기 채널 품질이 제 1 임계값보다 큰 경우, 상기 단말은 업링크 데이터를 랜덤 액세스 방식으로 또는 설정된승인(CG) 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하고 - 상기 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함함 - , 상기 단말이 업링크 데이터를 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은,상기 채널 품질이 제 2 임계값보다 큰 경우, 상기 단말이 상기 업링크 데이터를 상기 2-스텝 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것, 또는상기 채널 품질이 제 2 임계값보다 작은 경우, 상기 단말이 상기 업링크 데이터를 상기 4-스텝 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것을 포함하는, 통신 시스템."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "통신 시스템으로서, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하도록 구성된 상기 단말 - 상기 단말은 비접속 상태에 있음 - 을 포함하되,상기 채널 품질이 제 6 임계값보다 크고 상기 채널 품질이 제 7 임계값보다 큰 경우, 상기 단말은, 업링크 데이공개특허 10-2023-0025455-8-터를 상기 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고; 또는상기 채널 품질이 제 6 임계값보다 작고 상기 채널 품질이 제 8 임계값보다 큰 경우, 상기 단말은, 업링크 데이터를 상기 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는, 통신 시스템."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "데이터 전송 방법으로서, 액세스 네트워크 디바이스에 의해, 단말에 대한 제 1 임계값을 설정하는 단계 - 상기 단말은 비접속 상태에 있음 - 를 포함하되, 상기 제 1 임계값은, 상기 단말에 의해, 상기 액세스 네트워크 디바이스에 업링크 데이터를 송신할지 여부를 결정하는 데 사용되는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 24 항에 있어서, 상기 제 1 임계값은, 상기 단말에 의해, 상기 액세스 네트워크 디바이스에 업링크 데이터를 송신할지 여부를 결정하는 데 사용되는 것은, 상기 단말과 상기 액세스 네트워크 디바이스 사이의 채널 품질이 상기 제 1 임계값보다 큰 경우, 상기 업링크데이터를 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하거나 또는 상기 업링크 데이터를 설정된 승인(CG) 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것; 또는상기 단말과 상기 액세스 네트워크 디바이스 사이의 채널 품질이 상기 제 1 임계값보다 작은 경우, 상기 업링크데이터를 액세스 네트워크 디바이스에 송신하는 것을 스킵하는 것으로 결정하는 것을 포함하는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 25 항에 있어서, 상기 업링크 데이터를 랜덤 액세스 방식으로 상기 액세스 네트워크 디바이스에 송신하거나 또는 상기 업링크 데이터를 설정된 승인(CG) 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 상기 단말에 대해 CG 리소스가 설정되고 타이밍 어드밴스(TA)가 유효하다면, 상기 업링크 데이터를 상기 CG 방식으로 상기 액세스 네트워크 디바이스에 송신하는 것, 또는상기 단말에 대해 CG 리소스가 설정되지 않았고 및/또는 TA가 유효하지 않으며, 상기 단말과 상기 액세스 네트워크 디바이스 사이의 상기 채널 품질이 제 2 임계값보다 크다면, 상기 업링크 데이터를 상기 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것, 또는상기 단말에 대해 CG 리소스가 설정되지 않았고 및/또는 TA가 유효하지 않으며, 상기 단말과 상기 액세스 네트워크 디바이스 사이의 상기 채널 품질이 제 2 임계값보다 작다면, 상기 업링크 데이터를 상기 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것을 포함하는, 공개특허 10-2023-0025455-9-데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 26 항에 있어서,상기 제 2 임계값은 상기 액세스 네트워크 디바이스에 의해 설정되는, 데이터 전송 방법."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "통신 장치로서,상기 통신 장치는 하나 이상의 프로세서 및 통신 인터페이스를 포함하고, 상기 하나 이상의 프로세서 및 상기 통신 인터페이스는, 상기 통신 장치가 제 1 항 내지 제 10 항 중 어느 한항에 따른 데이터 전송 방법, 제 11 항 내지 제 21 항 중 어느 한 항에 따른 데이터 전송 방법 또는 제 24 항내지 제 27 항 중 어느 한 항에 따른 데이터 전송 방법을 수행하는 것을 지원하도록 구성되는, 통신 장치."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "컴퓨터 판독가능 저장 매체로서, 상기 컴퓨터 판독가능 저장 매체는 컴퓨터 명령어를 포함하고, 상기 컴퓨터 명령어가 컴퓨터에서 실행될 때, 상기 컴퓨터는 제 1 항 내지 제 10 항 중 어느 한 항에 따른 데이터 전송 방법, 제 11 항 내지 제 21 항 중 어느 한 항에 따른 데이터 전송 방법 또는 제 24 항 내지 제 27 항중 어느 한 항에 따른 데이터 전송 방법을 수행하게 되는, 컴퓨터 판독가능 저장 매체."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "명령어를 포함하는 컴퓨터 프로그램 제품으로서, 상기 컴퓨터 프로그램 제품이 컴퓨터 상에서 실행될 때, 상기 컴퓨터는 제 1 항 내지 제 10 항 중 어느 한 항에따른 데이터 전송 방법, 제 11 항 내지 제 21 항 중 어느 한 항에 따른 데이터 전송 방법 또는 제 24 항 내지제 27 항 중 어느 한 항에 따른 데이터 전송 방법을 수행하게 되는, 컴퓨터 프로그램 제품."}
{"patent_id": "10-2023-7001655", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "칩으로서, 상기 칩은 메모리에 연결되어서 상기 메모리에 저장된 프로그램 명령을 판독해서 실행하여서, 제 1 항 내지 제10 항 중 어느 한 항에 따른 데이터 전송 방법, 제 11 항 내지 제 21 항 중 어느 한 항에 따른 데이터 전송 방법 또는 제 24 항 내지 제 27 항 중 어느 한 항에 따른 데이터 전송 방법을 구현하도록 구성되는, 칩."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 출원은 데이터 전송 방법 및 장치를 제공하며, 단말이 비접속 상태에 있을 때, 단말은 2-스텝 랜덤 액세스 방 식, 4-스텝 랜덤 액세스 방식 또는 CG 방식으로 업링크 데이터를 송신하게 된다. 이 방법은, 단말이 단말과 액세 스 네트워크 디바이스 사이의 채널 품질을 획득하는 것과, 채널 품질이 제 1 임계값보다 큰 경우, 단말이, 업링 크 데이터를 랜덤 액세스 방식(2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식)으로 또는 CG 방식으로 송신하고; 또는 채널 품질이 제 6 임계값보다 큰 경우 2-스텝 랜덤 액세스 방식 또는 CG 방식으로 업링크 데이터 를 송신하며; 또는 채널 품질이 제 6 임계값보다 작은 경우 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신 하는 것으로 결정하는 것을 포함한다. 본 출원의 솔루션은 통신 기술, 인공 지능, 차량 인터넷, 스마트 홈 인터 넷 등의 분야에 널리 적용될 수 있다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 출원은 2020년 6월 20일에 \"보조 정보 제공 방법 및 UE\"라는 명칭으로 중국 국가 지식 재산국에 출원된 중국 특허 출원 제202010569721.X호 및 2020년 8월 20일에 \"데이터 전송 방법 및 장치\"라는 명칭으로 중국 국가 지적 재산국에 출원된 중국 특허 출원 제202010845774.X호의 우선권을 주장하며, 이들은 그 전체가 본 명세서에 참조 로서 포함된다. 기술 분야 본 출원의 실시예는 통신 기술 분야에 관한 것이며, 특히 데이터 전송 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근, 단말이 유휴(idle) 상태 또는 비활성(inactive) 상태에 있을 때 업링크 데이터를 액세스 네트워크 디바이 스에 전송해야 하는 경우, 단말은 랜덤 액세스, 예를 들어 4-스텝 랜덤 액세스 프로세스 또는 2-스텝 랜덤 액세 스 프로세스를 개시하고, 유휴/비활성 상태로부터 접속(connected) 상태로 전환된 이후에, 업링크 데이터를 액 세스 네트워크 디바이스에 전송해야 한다. 업링크 데이터가 작은 데이터이고 작은 데이터 볼륨을 갖는 경우, 작 은 볼륨의 데이터를 전송하기 위해서 완전한 랜덤 액세스 프로세스도 시작되어야 한다. 이것은 단말의 신호 오 버헤드와 전력 소비를 증가시킨다. 단말의 시그널링 오버헤드 및 전력 소모를 감소시키기 위해서, 단말은 랜덤 액세스 프로세스로 업링크 데이터를 액세스 네트워크 디바이스에 송신할 수도 있고, 혹은 단말에 대해서 액세스 네트워크 디바이스가 사전 설정한 업링크 리소스(예를 들어, 설정된 승인(configured grand(CG))를 이용해서 업링크 데이터를 전송할 수도 있다. 업링크 데이터가 랜덤 액세스 프로세스로 또는 CG를 이용해서 전송될 때, 업링크 데이터가 랜덤 액세스 프로세 스로 또는 CG를 이용해서 액세스 네트워크 디바이스에 성공적으로 전송될 수 있도록 하기 위해서, 업링크 데이 터를 전송하는 데 더 높은 채널 품질을 가진 채널이 선택된다. 따라서, 업링크 데이터를 랜덤 액세스 프로세스 로 또는 CG를 이용해서 성공적으로 전송하는 데 높은 채널 품질을 가진 채널을 선택하는 방법이, 시급하게 해결 되어야 하는 기술적 과제이다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 출원의 실시예는 데이터 전송 방법 및 장치를 제공하며, 단말이 비접속 상태에 있을 때, 단말은 2-스텝 랜덤 액세스 방식, 4-스텝 랜덤 액세스 방식 또는 CG 방식으로 업링크 데이터를 송신하게 된다. 전술한 목적을 달성하기 위해, 본 출원의 실시예에서 이하 기술적 솔루션들이 사용된다. 제 1 양태에 따르면, 데이터 전송 방법이 제공된다. 이 방법은, 비접속 상태의 단말이 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하는 단계와, 채널 품질이 제 1 임계값보다 큰 경우, 단말이, 업링크 데이터 를 액세스 네트워크 디바이스에 랜덤 액세스 방식으로 또는 CG 방식으로 송신하는 것으로 결정하는 단계 - 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함함 - 를 포함한다. 단말이, 랜덤 액세스 방식으로 업링크 데이터를 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 채널 품질이 제 2 임계값보다 큰 경우, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송 신하는 것으로 결정하는 것, 또는 채널 품질이 제 2 임계값보다 작은 경우, 단말이, 업링크 데이터를 4-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것을 포함한다. 제 1 양태의 방법에 따르면, 제 1 임계값 및 제 2 임계값은 단말에 대해 설정될 수 있으며, 제 1 임계값은 단말 이 업링크 데이터를 랜덤 액세스 방식으로 전송할지 CG 방식으로 전송할지 여부를 결정하는데 사용되고, 제 2 임계값은 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 또는 4-스텝 랜덤 액세스 방식으로 송신하는 것으로 선택하는 데 사용되며, 이로써, 단말은 제 1 임계값 및 제 2 임계값에 기초해서, 업링크 데이터를 송신하 는 방식을 적절하게 선택할 수 있다. 이는 업링크 데이터 전송 효율을 향상시키고, 선택된 전송 방식에 대응하 는 채널 품질이 열악해서 업링크 데이터 전송이 실패하여 리소스 낭비가 발생하는 문제를, 방지한다.가능한 설계에서, 이 방법은: 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 큰 경우, 단말은 업링크 데이터를 비접속 상태의 액세스 네트워크 디바이스에 송신하지 않고, 2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 것; 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 작은 경우, 단말은 업링크 데이터를 비접속 상태의 액세스 네트워크 디바이스에 송신하지 않고, 4-스텝 랜덤 액세스 방식으 로 셀에 액세스하는 것으로 결정하는 것을 더 포함한다. 가능한 설계에 기초해서, 채널 품질이 제 1 임계값보다 작은 경우, 업링크 데이터는 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식으로 송신될 수 없고, 랜덤 액세스가 개시만 될 수 있다. 즉, 채널 품질이 만족스 럽지 않은 경우, 업링크 데이터는 랜덤 액세스 방식으로 전송되지 않는다. 이로써 업링크 데이터 전송 실패를 방지할 수 있다. 제 2 양태에 따르면, 데이터 전송 방법이 제공된다. 방법은, 비접속 상태의 단말이, 단말과 액세스 네트워크 디 바이스 사이의 채널의 품질을 획득하는 단계와, 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보 다 큰 경우, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으 로 결정하는 단계와, 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 단말은 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 단계를 포함한다. 제 2 양태의 방법에 따르면, 단말에 대해 제 6 임계값, 제 7 임계값 및 제 8 임계값이 설정될 수 있다. 제 6 임 계값은 단말이 2-스텝 랜덤 액세스 리소스를 사용할지 또는 4-스텝 랜덤 액세스 리소스를 사용할지 선택하는 데 사용되며, 제 7 임계값은 단말이 2-스텝 랜덤 액세스 리소스를 사용해서 업링크 데이터를 송신할지 또는 랜덤 액세스를 개시할지 선택하는 데 사용된다. 제 8 임계값은 단말이 4-스텝 랜덤 액세스 리소스를 사용해서 업링크 데이터를 송신할지 또는 랜덤 액세스를 개시할지 선택하는 데 사용되며, 이로써 단말은 제 6 임계값, 제 7 임계 값, 제 8 임계값에 기초해서 업링크 데이터를 송신하는 방식을 적절하게 선택할 수 있다. 이는 업링크 데이터 전송 효율을 향상시키고, 선택된 전송 방식에 대응하는 채널 품질이 열악해서 업링크 데이터 전송에 실패해서 리소스 낭비가 발생하는 문제를 방지한다. 가능한 설계에서, 이 방법은: 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 작은 경우, 단말 은 비접속 상태의 업링크 데이터를 액세스 네트워크 디바이스에 송신하지 않고 2-스텝 랜덤 액세스 방식으로 셀 에 액세스하는 것으로 결정하는 것; 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 작은 경우, 단말은 업링크 데이터를 비접속 상태의 액세스 네트워크 디바이스에 송신하지 않고 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 것을 더 포함한다. 가능한 설계에 기초해서, 채널 품질이 제 7 임계값보다 작은 경우, 업링크 데이터는 2-스텝 랜덤 액세스 방식으 로 전송될 수 없고, 2-스텝 랜덤 액세스가 개시만 될 수 있다. 채널 품질이 제 8 임계값보다 작은 경우, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 전송될 수 없고, 4-스텝 랜덤 액세스가 개시만 된다. 즉, 채널 품질이 만족스럽지 않은 경우, 랜덤 액세스 방식으로 업링크 데이터가 전송되지 않는다. 이렇게 하면 업링크 데이터 전 송 실패를 방지할 수 있다. 제 1 양태 또는 제 2 양태를 참조해서, 가능한 설계에서, 단말은, 단말과 액세스 네트워크 디바이스 사이의 업 링크 시간 동기화에 사용되는 TA가 유효한지 여부를 결정한다. TA가 유효하지 않은 경우, 단말은 랜덤 액세스 방식으로 업링크 데이터를 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. TA가 유효하면, 단말은 CG 방식으로 업링크 데이터를 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. CG 방식에 대응하는 CG 리소 스는 액세스 네트워크 디바이스에 의해 사전 설정되고 비접속 상태의 단말이 사용하는 PUSCH 리소스이다. 이러한 가능한 설계에 기초해서, 단말이 CG를 지원하는 경우, CG 방식이 우선적으로 선택될 수 있다. 업링크 데 이터는 랜덤 액세스 프로세스 없이 사전 설정된 PUSCH 리소스로 전송된다. 이로써 단말의 전력 소모가 감소되고 랜덤 액세스 리소스가 절감된다. 가능한 설계에서, 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 후에, 이 방법은: 채널 품질이 제 3 임계값보다 큰 경우, 단말이 2-스텝 랜덤 액세스 방식에 대 응하는 제 1 전송 리소스에 기초해서 MsgA로 업링크 데이터를 액세스 네트워크 디바이스에 송신하는 단계를 더 포함한다. 이러한 가능한 설계에 기초해서, 2-스텝 랜덤 액세스 방식이 대량의 전송 리소스에 대응하는 경우, 채널 품질이 제 3 임계값보다 크면, 단말은 제 1 전송 리소스를 선택해서 업링크 데이터를 송신할 수 있다. 이는 선택된 전송 리소스가 열악해서 업링크 데이터 전송이 실패하고 리소스 낭비가 발생하는 문제를, 방지한다. 가능한 설계에서, 제 1 전송 리소스에 대응하는 설정 정보는 제 3 임계값을 포함하거나; 또는 제 3 임계값이 적 어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각이 하나의 전송 파라미터 임계값에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는 제 3 임계값이 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각이 하나의 전송 파라미터 범위에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 범위에 속한다. 이러한 가능한 설계에 기초해서, 단말이 적절한 전송 리소스를 선택하는데 사용하는 임계값이 전송 리소스의 설정 정보에 세팅될 수 있고, 또는 단말이 적절한 전송 리소스를 선택하는데 사용하는 임계값 및 이에 대응하여 전송 파라미터 임계값 이 세팅되거나, 또는 단말이 적절한 전송 파라미터를 선택하는데 사용하는 임계값 및 이에 대응하여 전송 파라 미터 범위가 세팅된다. 설정 방식이 유연하고 적응력이 우수하다. 가능한 설계에서, 전송 파라미터는 MCS 및 TBS 중 하나 이상을 포함한다. 환언하면, 전송 리소스의 전송 요건은 MCS 및/또는 TBS에 기초해서 측정된다. 전송 파라미터는 높은 유연성을 갖고 다양하게 설계된다. 가능한 설계에서, 단말이 업링크 데이터를 액세스 네트워크 디바이스에 CG 방식으로 송신하는 것으로 결정한 이 후에, 이 방법은, 채널 품질이 제 4 임계값보다 큰 경우, 단말이 제 1 CG 리소스에 기초해서 액세스 네트워크 디바이스에 업링크 데이터를 송신하는 것을 포함한다. 이러한 가능한 설계에 기초해서, CG 방식이 대량의 전송 리소스에 대응하는 경우, 채널 품질이 제 4 임계값보다 큰 경우, 단말은 업링크 데이터를 송신할 제 1 CG 리소 스를 선택할 수 있다. 이는 선택된 CG 리소스가 열악해서 업링크 데이터 전송이 실패하고 리소스 낭비가 발생하 는 문제를, 방지한다. 가능한 설계에서, 제 1 CG 리소스에 대응하는 설정 정보는 제 4 임계값을 포함하거나; 또는 제 4 임계값이 적어 도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각이 하나의 전송 파라미터 임계값에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는 제 4 임계값이 적어 도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각이 하나의 전송 파라미터 범위에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 범위에 속한다. 이러한 가능한 설계에 기초해 서, 단말이 적절한 CG 리소스를 선택하는 데 사용하는 임계값이 CG 리소스에 대응하는 설정 정보에 세팅되거나, 단말이 적절한 CG 리소스를 선택하는 데 사용하는 임계값 및 이에 대응하여 전송 파라미터 임계값이 세팅되거나, 또는 단말이 적절한 전송 파라미터를 선택하는 데 사용하는 임계값 및 이에 대응하여 전송 파라미 터 범위가 세팅된다. 설정 방식이 유연하고 적응력이 우수하다. 가능한 설계에서, TA가 유효하지 않은 것은, TA의 유효 기간이 만료된 것과; 단말의 현재 위치와 TA가 시작될 때 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과; 채널 품질과, TA가 시작될 때 달성되는 단말과 액세스 네트워크 디바이스 사이의 채널의 품질 사이의 차이가 채널 품질 변경 임계값보다 큰 것 중 하나 이상을 포함한다. 이러한 가능한 설계에 기초해서, 단말의 TA가 유효하지 않은지 여부는, TA가 만료되었는지 여부, 단 말의 이동 여부 등에 기초해서 결정될 수 있다. 결정 방식은 유연하고 다양하며, 적용 시나리오가 확장된다. 가능한 설계에서, 단말에 대해 제 1 임계값, 제 2 임계값, 제 3 임계값, 제 4 임계값, 제 5 임계값, 제 6 임계 값, 제 7 임계값 및 제 8 임계값이 액세스 네트워크 디바이스에 의해 설정되고, 액세스 네트워크 디바이스는 단 말에 의해 사용되는 임계값을 균일하게 설정하고 관리해서 업링크 데이터를 송신하기에 적절한 방식 또는 전송 리소스를 선택한다. 중앙 집중식 관리 및 통합 표준을 통해서 시스템 설계를 단순화시킨다. 제 3 양태에 따르면, 본 출원은 통신 장치를 제공한다. 통신 장치는 전술한 단말, 또는 단말 내의 칩이나 시스 템-온-칩(system-on-a-chip)일 수도 있고, 또는 단말 내에 있고 제 1 양태나 제 1 양태의 임의의 가능한 설계 또는 제 2 양태나 제 2 양태의 임의의 가능한 설계에 따른 방법을 구현하도록 구성된 기능 모듈일 수 있다. 단 말은 전술한 기술적 양태 또는 가능한 설계의 단말에 의해 수행되는 기능을 구현할 수 있으며, 기능은 대응하는 소프트웨어를 실행하는 하드웨어에 의해 구현될 수 있다. 하드웨어 또는 소프트웨어는 기능에 대응하는 하나 이 상의 모듈을 포함한다. 예를 들어, 단말은 수신 유닛 및 처리 유닛을 포함할 수 있다. 가능한 설계에서, 수신 유닛은 단말과 액세스 네트워크 디바이스 사이의 채널의 품질을 획득하도록 구성된다. 처리 유닛은: 채널 품질이 제 1 임계값보다 큰 경우, 랜덤 액세스 방식 또는 CG 방식으로 액세스 네트워크 디바 이스에 업링크 데이터를 송신하는 것으로 결정하고, 여기서 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함하고; 예를 들어, 채널 품질이 제 2 임계값보다 큰 경우, 업링크 데이터를 2-스 텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하거나; 또는 채널 품질이 제 2 임계값보다 작은 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으 로 결정한다. 다른 가능한 설계에서, 수신 유닛은 단말과 액세스 네트워크 디바이스 사이의 채널의 품질을 획득하도록 설정된 다. 처리 유닛은; 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하도록 결정하고; 또는 채널 품질이 제 8 임계값 보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워 크 디바이스에 송신하는 것으로 결정한다. 구체적으로, 처리 유닛 및 수신 유닛의 관련 실행 동작에 대해서는 제 1 양태나 제 1 양태의 임의의 가능한 설 계 또는 제 2 양태나 제 2 양태의 임의의 가능한 설계를 참조한다. 자세한 내용은 다시 설명하지 않는다. 제 4 양태에 따르면, 통신 장치가 제공된다. 통신 장치는 단말일 수도 있고, 단말 내의 칩 또는 시스템-온-칩일 수도 있다. 단말은 전술한 양태 또는 가능한 설계의 단말에 의해 수행되는 기능을 구현할 수 있으며, 기능은 하 드웨어에 의해 구현될 수 있다. 가능한 설계에서, 단말은 프로세서 및 통신 인터페이스를 포함할 수 있다. 일례 로, 프로세서는 제 1 양태나 제 1 양태의 임의의 가능한 설계에 따른 기능을 구현함에 있어서 단말을 지원하도 록 구성될 수 있다. 예를 들어, 프로세서는 단말과 액세스 네트워크 디바이스 사이의 채널의 품질을 획득하도록 설정된다. 채널 품질이 제 1 임계값보다 큰 경우, 단말은 업링크 데이터를 액세스 네트워크 디바이스에 랜덤 액 세스 방식 또는 CG 방식으로 송신하는 것으로 결정한다. 예를 들어, 채널 품질이 제 2 임계값보다 큰 경우, 단 말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. 다 른 방안으로, 채널 품질이 제 2 임계값보다 작은 경우, 단말은 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. 다른 예로, 프로세서는, 단말과 액세스 네트워크 디바 이스 사이의 채널의 품질을 획득하고, 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하거나; 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. 다른 가능한 설계에서, 통신 장치는 메모리를 더 포함할 수 있다. 메모리는 단말에 필요한 컴퓨터 실행가능 명령어 및 데이터를 저장하도록 구성된 다. 통신 장치가 실행될 때, 프로세서는 메모리에 저장된 컴퓨터 실행가능 명령어를 실행해서, 통신 장치가 제 1 양태나 제 1 양태의 임의의 가능한 설계 또는 제 2 양태나 제 2 양태의 임의의 가능한 설계에 따른 데이터 전 송 방법을 수행하게 한다. 제 5 양태에 따르면, 컴퓨터 판독가능 저장 매체가 제공된다. 컴퓨터 판독가능 저장 매체는 판독 가능한 비휘발 성 저장 매체일 수 있다. 컴퓨터 판독가능 저장 매체는 명령어를 저장한다. 명령어가 컴퓨터에서 실행될 때, 컴 퓨터는 제 1 양태나 제 1 양태의 임의의 가능한 설계 또는 제 2 양태나 제 2 양태의 임의의 가능한 설계에 따른 데이터 전송 방법을 수행하게 된다. 제 6 양태에 따르면, 명령어를 포함하는 컴퓨터 프로그램 제품이 제공된다. 컴퓨터 프로그램 제품이 컴퓨터에서 실행될 때, 컴퓨터는 제 1 양태나 제 1 양태의 임의의 가능한 설계 또는 제 2 양태나 제 2 양태의 임의의 가능 한 설계에 따른 데이터 전송 방법을 수행할 수 있게 된다. 제 7 양태에 따르면, 통신 장치가 제공된다. 통신 장치는 단말일 수도 있고, 또는 단말 내의 칩이나 시스템-온- 칩일 수도 있다. 단말은 하나 이상의 프로세서와 하나 이상의 메모리를 포함한다. 하나 이상의 메모리는 하나 이상의 프로세서에 연결되고, 하나 이상의 메모리는 컴퓨터 프로그램 코드를 저장하도록 구성되고, 컴퓨터 프로 그램 코드는 컴퓨터 명령어를 포함한다. 하나 이상의 프로세서가 컴퓨터 명령어를 실행할 때, 단말은 제 1 양태 나 제 1 양태의 임의의 가능한 설계 또는 제 2 양태의 임의의 가능한 설계에 따라 데이터 전송 방법을 수행하게 된다. 제 4 양태 내지 제 7 양태의 설계 방식에 의해 달성되는 기술적 효과에 대해서는 제 1 양태나 제 1 양태의 임의 의 가능한 설계 또는 제 2 양태의 임의의 가능한 설계에 의해 달성되는 기술적 효과를 참조한다. 자세한 내용은 다시 설명하지 않는다. 제 8 양태에 따르면, 본 출원의 실시예는 통신 시스템을 제공한다. 통신 시스템은 액세스 네트워크 디바이스 및 단말을 포함할 수 있다. 단말은 통신 장치, 컴퓨터 프로그램 제품, 또는 제 3 양태 내지 제 7 양태 중 어느 하 나에 따른 판독 가능한 저장 매체를 포함한다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 출원의 실시예를 설명하기 전에, 본 출원의 실시예에서의 일부 용어를 설명한다. 접속(connected) 상태는 무선 리소스 제어 접속(radio resource control connected, RRC 접속) 상태라고 지칭 될 수 있다. 접속 상태에서는, 단말은 네트워크 디바이스(예를 들어, 액세스 네트워크 디바이스)에 접속되고, 단말과 네트워크 디바이스 사이에서 데이터가 전송된다. 예를 들어, 단말은 네트워크 디바이스로부터 다운링크 데이터를 수신하거나, 네트워크 디바이스에 업링크 데이터를 송신할 수 있다. 유휴(idle) 상태는 무선 리소스 제어 유휴(idle, RRC-idle) 상태라고 지칭될 수 있다. 유휴 상태에서는, 단말은 액세스 네트워크 디바이스(예를 들어, 액세스 네트워크 디바이스)에 접속되지 않고, 액세스 네트워크 디바이스 는 단말이 액세스 네트워크 디바이스의 커버리지 영역 내에 있는지 여부를 알지 못한다. 단말은 액세스 네트워 크 디바이스로부터 페이징(paging) 메시지, 동기 신호, 브로드캐스트 메시지 또는 시스템 정보 중 하나 이상을 수신할 수는 있으나, 액세스 네트워크 디바이스와의 대용량 데이터로 음성 통화나 인터넷 액세스와 같은 데이터 전송은 수행할 수 없다. 비활성(inactive) 상태는 무선 리소스 제어 비활성(radio resource control inactive, RRC 비활성) 상태라고 지칭될 수 있다. 비접속 상태에서, 단말은 액세스 네트워크 디바이스(예를 들어, 액세스 네트워크 디바이스)에 접속되지 않지만, 액세스 네트워크 디바이스는 단말의 컨텍스트는 저장할 수 있다. 단말은 액세스 네트워크 디 바이스로부터 페이징 메시지, 동기화 신호, 브로드캐스트 메시지 또는 시스템 정보 중 하나 이상을 수신할 수는 있으나, 액세스 네트워크 디바이스와의 음성 통화 또는 대용량 인터넷 액세스 데이터 등의 데이터 전송은 수행 할 수 없다. 전술한 세 가지 상태는 상호 전환될 수 있다. 예를 들어, 단말이 데이터 서비스를 갖고 있지 않은 경우, 네트워 크 측 디바이스는 단말에 RRC 해제(release) 메시지를 송신해서, 단말이 접속 상태로부터 유휴 상태 또는 비활 성 상태로 전환되게 한다. 네트워크 측에서 다운링크 서비스 요구가 있는 경우, 네트워크 측 디바이스는 페이징 (paging) 메시지를 주기적으로 단말에 송신한다. 페이징된 후, 단말은 접속 상태로 전환되고, 랜덤 액세스를 개시하며, 랜덤 액세스를 완료한 이후에 접속 상태로 들어가서, 네트워크 측으로부터 송신된 다운링크 데이터를 수신하도록 트리거된다. 이와 달리, 단말에서 업링크 서비스 요구가 있는 경우, 단말은 또한 랜덤 액세스를 개 시하고, 접속 상태로 전환하며, 접속 상태로 들어간 이후에 업링크 데이터를 송신한다. 본 출원의 이 실시예에서, 유휴 상태 또는 비활성 상태는 비접속 상태 또는 슬립 상태라고 지칭될 수 있다. 업 링크 데이터는 업링크 스몰 데이터(small data)를 포함할 수 있다. 업링크 스몰 데이터는 스몰 데이터 볼륨을 갖는 서비스 데이터, 즉 사전 설정된 값 이하의 비트 수를 가진 서비스 데이터일 수 있다. 사전 설정된 값은 요 구에 따라 설정된다. 서비스 데이터의 전송 중에 적은 수의 전송 리소스가 점유된다. 예를 들어, 업링크 스몰 데이터는 수 비트(bits)의 서비스 데이터일 수도 있고, 수십 비트의 서비스 데이터일 수도 있으며, 또는 수백 비트 또는 수천 비트의 서비스 데이터일 수도 있다. 비접속 상태의 단말에서 업링크 서비스 요구가 있는 경우, 업링크 서비스가 업링크 스몰 데이터일지라도, 업링크 스몰 데이터를 송신하기 위해서는 단말이 먼저 랜덤 액세 스를 개시하고, 완전한 랜덤 액세스 절차를 수행하며, 비접속 상태로부터 접속 상태로 전환하고, 접속 상태에서 업링크 스몰 데이터를 송신해야 한다. 업링크 스몰 데이터가 송신된 이후에, 네트워크 디바이스는 단말이 장시 간 접속 상태를 유지하게 할 수 있다. 이들 단계에 따르면, 큰 시그널링 오버헤드가 발생되고, 단말의 전력 소 모가 증가되며, 데이터 전송 지연이 증가된다. 단말이 비접속 상태에 있을 때 업링크 스몰 데이터를 송신하는 전력 소비를 감소시키고, 데이터 전송 지연을 감 소시키기 위해서, 가능한 구현예에서, 단말은 랜덤 액세스 방식(예를 들어, 2-스텝 랜덤 액세스 방식 또는 4-스 텝 랜덤 액세스 방식)으로 또는 설정된 승인(configured grant, CG) 방식으로 업링크 스몰 데이터를 액세스 네 트워크 디바이스에 송신할 수 있다. 도 1a는 4-스텝 랜덤 액세스 방식을 나타내며, 이 방식은 다음 단계를 포함할 수 있다. 단계 : 액세스 네트 워크 디바이스는 단말에 업링크 리소스 설정 정보를 송신하고, 단말에 대해 업링크 데이터를 송신하는 데 사용 되는 업링크 리소스를 설정한다. 단계 : 단말은 메시지 1(Msg1)을 액세스 네트워크 디바이스에 송신해서, 액 세스 네트워크 디바이스에 랜덤 액세스 요청이 있음을 통지한다. 메시지 1은 랜덤 액세스 프리앰블(random access preamble)이라고 할 수도 있다. 단계 : Msg1을 수신한 후, 액세스 네트워크 디바이스는 단말에 랜덤 액세스 응답을 송신하고, 여기서 랜덤 액세스 응답은 메시지 2(Msg2)라고도 지칭될 수 있다. 단계 : 랜덤 액 세스 응답을 수신한 후, 단말은 메시지 3(Msg3)을 액세스 네트워크 디바이스에 송신하고, 여기서 Msg3는 업링크 스몰 데이터 및 기타 정보를 포함할 수 있다. 단계 : 액세스 네트워크 디바이스는 메시지 4(Msg4)를 단말에 송신하고, 여기서 메시지 4는 액세스 네트워크 디바이스의 하위 계층에 의해 결정된 응답 메시지 및/또는 액세 스 네트워크 디바이스의 상위 계층에 의해 결정되고 업링크 스몰 데이터에 대응하는 상위 계층 피드백 정보를 포함할 수 있다. 단계 에서, 단말이 랜덤 액세스 프리앰블(preamble)을 액세스 네트워크 디바이스에 송신할 때, 단말이 사용하는 프리앰블은 옵션 프리앰블 세트 중에서 랜덤하게 선택된다는 점에 주의한다. Msg2, Msg3, 또는 Msg4는 액세스 네트워크 디바이스에 의해서 물리적 다운링크 제어 채널(Physical downlink control channel, PDCCH)을 통해 단말에 스케줄링된다. 예를 들어, 액세스 네트워크 디바이스는 Msg2, Msg3, Msg4를 송 신하기 전에, Msg2, Msg3, Msg4를 스케줄링하는 데 사용되는 PDCCH를 송신하고, PDCCH에 의해 지시되는 시간-주 파수 리소스 위치에서 Msg2, Msg3, Msg4를 송신 또는 수신한다. 도 1b는 2-스텝 랜덤 액세스 방식을 나타내며, 이 방식은 다음 단계를 포함할 수 있다. 단계 : 액세스 네트 워크 디바이스는 단말에 업링크 설정 정보를 송신하고, 여기서 업링크 리소스 설정 정보는 단말이 업링크 데이 터를 송신하도록 구성된 2-스텝 랜덤 액세스 리소스를 나타낸다. 단계 : 단말은 MsgA를 액세스 네트워크 디 바이스에 송신하고, 여기서 MsgA는 프리앰블(preamble)을 포함할 수 있으며, 프리앰블과 연관된 물리 업링크 공 유 채널(physical uplink shared channel, PUSCH)을 더 포함할 수 있으고, PUSCH는 업링크 스몰 데이터 및 기 타 정보를 포함한다. 단계 : 액세스 네트워크 디바이스는 MsgA를 수신하고, MsgB를 단말에 리턴하며, 여기서 MsgB는 단말들 사이의 경합 해결(contention resolution)에 사용되는 관련 정보를 포함할 수 있고, 액세스 네트 워크 디바이스의 하위 계층에 의해 결정된 응답 메시지 및/또는 액세스 네트워크 디바이스의 상위 계층에 의해 결정되고 업링크 스몰 데이터에 대응하는 상위 계층 피드백 정보를 더 포함할 수 있다. 단말이 액세스 네트워크 디바이스에 MsgA를 송신할 때, 단말이 사용하는 프리앰블은 옵션 프리앰블 세트 또는 2-스텝 랜덤 액세스 방식 에 대응하는 전용 프리앰블 세트 중에서 랜덤하게 선택된다는 점에 주의한다. PUSCH와 단말에 의해 선택된 프리 앰블 사이에는 연관 관계가 있다. MsgB는 액세스 네트워크 디바이스에 의해서 PDCCH를 통해 단말에 스케줄링된 다. 예를 들어, MsgB를 송신하기 전에, 액세스 네트워크 디바이스는 MsgB를 스케줄링하는데 사용되는 PDCCH를 송신하고, PDCCH에 의해 지시되는 시간-주파수 리소스 위치에서 MsgB를 수신한다. 도 1c는 CG 방식을 나타낸다. 네트워크 측은 단말에 대해, CG 리소스라고도 하는 업링크 리소스를 사전 설정한 다. 단말에서 업링크 서비스 요구가 있는 경우, 단말은 사전 설정된 업링크 리소스를 이용해서 업링크 데이터를 직접 송신한다. CG 방식은 구체적으로 다음 단계를 포함할 수 있다. 단계 : 액세스 네트워크 디바이스는 업 링크 리소스 설정 정보를 단말에 송신하고, 단말에 대해 업링크 데이터를 송신하는 데 사용되는 업링크 리소스 를 설정한다. 단계 : 단말은 업링크 스몰 데이터를 포함하는 PUSCH를, 액세스 네트워크 디바이스에 의해 설 정된 업링크 리소스 내의 액세스 네트워크 디바이스에 송신하고, 여기서 PUSCH는 설정된 승인 메시지로 전달된 다. 이에 대응해서, 액세스 네트워크 디바이스는 업링크 스몰 데이터를 수신한다. 또한, 도 1c에 도시된 CG 방 식은 단계 을 더 포함할 수 있다. 단계 에 도시된 바와 같이, 액세스 네트워크 디바이스는 설정된 승인 응답을 단말에 송신하고, 여기서 설정된 승인 응답은 액세스 네트워크 디바이스의 하위 계층에 의해 결정된 응 답 메시지 및/또는 액세스 네트워크 디바이스의 상위 계층에 의해 결정되고 업링크 스몰 데이터에 대응하는 상 위 계층 피드백 정보를 포함할 수 있다. 본 출원에서 설명되는 CG는 데이터 송신 방식의 명칭임에 주의한다. 데이터 송신 방식은, 단말을 위한 PUSCH 리 소스를 사전 설정하고, 단말에서 업링크 서비스 요구가 있는 경우, 사전 설정된 PUSCH 리소스를 이용해서 업링 크 서비스 데이터를 송신하는 단계를 포함한다. 데이터 전송 방식은 본 출원에서 CG로 명명되는 것으로 제한되 는 것은 아니며, 다른 방안으로 다른 명칭을 가질 수도 있다. 이것은 제한되지 않는다. 단말이 전술한 랜덤 액세스 방식 또는 CG 방식으로 업링크 스몰 데이터를 송신하는 경우, 채널 품질에 대한 요 구가 높다. 채널 품질이 열악한 경우, 단말은 전술한 랜덤 액세스 방식 또는 CG 방식으로 업링크 스몰 데이터를 송신할 수 없으며, 따라서 업링크 스몰 데이터의 송신에 실패하게 된다. 따라서, 채널 품질이 높은 채널 또는 업링크 스몰 데이터의 송신 요구를 만족할 수 있는 채널을 선택하는 방법이, 단말이 랜덤 액세스 방식 또는 CG 방식으로 업링크 스몰 데이터를 성공적으로 송신하게 하는 데 있어서의 핵심 문제이다. 이러한 문제에 대해서, 당업자는 어떠한 해결책도 제공하지 못하고 있다. 종래의 기술은, 단말이 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정할 수 있도록 액세스 네트워크 디바이스에 의해 설정 된 임계값만을 제공하며, 더욱이 이러한 기술적 수단은 랜덤 액세스 방식 또는 CG 방식으로 업링크 스몰 데이터 를 성공적으로 송신하는 것을 보장/구현할 수는 없다. 가능한 구현예에서, 본 출원의 실시예는, 단말이 랜덤 액세스 방식 또는 CG 방식으로 업링크 스몰 데이터를 성 공적으로 송신할 수 있게 하는 데이터 전송 방법을 제공한다. 이 방법은 다음 단계를 포함할 수 있다. 임계값, 예를 들어, 제 1 임계값은 네트워크 측에서 브로드캐스트되며, 여기서 제 1 임계값은 단말이 랜덤 액세스 방식 으로 업링크 스몰 데이터를 송신할 수 있는지 여부를 나타낼 수 있다. 예를 들어, 단말은 채널 품질이 제 1 임 계값보다 크다고 결정하고, 랜덤 액세스 방식 또는 CG 방식으로 업링크 스몰 데이터를 송신하는 것으로 결정한 다. 나아가, 네트워크 측은 또 다른 임계값, 예를 들어, 제 2 임계값을 브로드캐스트하고, 여기서 제 2 임계값 은 단말이 업링크 스몰 데이터를 랜덤 액세스 방식으로 송신할 때, 업링크 스몰 데이터를 2-스텝 랜덤 액세스 방식으로 송신할지 또는 4-스텝 랜덤 액세스 방식으로 송신할지 여부를 나타낸다. 구체적으로, 이 구현예에 대 해서는 도 4 내지 도 5d에 대한 다음 설명을 참조한다. 다른 가능한 구현예에서, 네트워크 측은 임계값을, 예를 들어, 제 6 임계값을 브로드캐스트하며, 여기서 제 6 임계값은 단말이 업링크 스몰 데이터를 송신하거나 네트워크에 액세스할 때 2-스텝 랜덤 액세스 리소스(선택적 으로, CG 리소스를 포함함)를 사용할지 또는 4-스텝 랜덤 액세스 리소스를 사용할지 여부를 나타낸다. 예를 들 어, 채널 품질이 제 6 임계값보다 큰 것으로 결정되는 경우, 단말은 2-스텝 랜덤 액세스 리소스 또는 CG 리소스 를 이용해서 업링크 스몰 데이터를 송신하거나 네트워크 디바이스에 액세스하는 것으로 결정한다. 나아가, 2개 의 임계값, 예를 들어 제 8 임계값 및 제 7 임계값이 네트워크 측에서 브로드캐스트된다. 이 2개의 임계값은 단 말이 2-스텝 랜덤 액세스 리소스 및 4-스텝 랜덤 액세스 리소스를 이용할 때 랜덤 액세스 방식으로 업링크 스몰 데이터를 송신할 수 있는지 여부를 나타낸다. 송신할 수 있다면, 단말은 랜덤 액세스 방식으로 업링크 스몰 데 이터를 송신한다. 송신할 수 없다면, 단말은 먼저 네트워크에 액세스하여 네트워크 측 디바이스에 대한 접속을 확립하고, 이후 업링크 스몰 데이터를 전송한다. 구체적으로, 이러한 구현예에 대해서는 도 6 내지 도 7d의 다 음 설명을 참조한다. 본 출원에서, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하는 것은, 2-스텝 랜덤 액세스의 리소스에 기 초해서 업링크 데이터를 송신하는 것, 2-스텝 랜덤 액세스 방식의 MsgA에 대응하는 PUSCH에 기초해서 업링크 데 이터를 송신하는 것 등으로 대체될 수 있다는 점에 주의한다. 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송 신하는 것은, 4-스텝 랜덤 액세스 리소스에 기초해서 업링크 데이터를 송신하는 것, 4-스텝 랜덤 액세스 방식의 Msg3에 대응하는 PUSCH에 기초해서 업링크 데이터를 송신하는 것 등으로 대체될 수 있다. 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것은 2-스텝 랜덤 액세스 리소스에 기초해서 랜덤 액세스를 개시하는 것, 2-스텝 랜덤 액세스 방식의 MsgA에 대응하는 프리앰블에 기초해서 랜덤 액세스를 개시하는 것 등으로 대체될 수 있다. 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것은 4-스텝 랜덤 액세스 리소스에 기초해서 랜덤 액세스를 개시하는 것, 4-스텝 랜덤 액세스 방식의 Msg1에 대응하는 프리앰블에 기초해서 랜덤 액세스를 개시하 는 것 등으로 대체될 수 있다. 이하에서는 본 출원의 실시예에서 제공되는 데이터 전송 방법을 본 명세서의 첨부 도면을 참조하면서 설명한다. 이하의 실시예에서 업링크 데이터는 랜덤 액세스 프로세스로 또는 CG 방식으로 송신될 수 있는 업링크 스몰 데 이터 또는 다른 서비스 데이터일 수 있다는 점에 주의한다. 이것은 제한되지 않는다. 예를 들어, 업링크 데이터 가 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스(또는 2-스텝 랜덤 액세스 리소스라 함)에 기초해서 송신되 는 경우, 업링크 데이터는 프리앰블과는 상이하다. 물리 계층이 사용하는 채널의 관점에서, 업링크 데이터는 MsgA에 대응하는 PUSCH에서 생성/운반되는 데이터일 수 있고, 업링크 데이터는 PUSCH를 통해 송신될 수 있으며, MsgA에 대응하는 PUSCH로 전송되는 업링크 데이터는 사용자 평면(user plane, UP) 데이터 또는 제어 평면 (control plane, CP) 데이터, 전용 트래픽 채널(dedicated traffic channel, DTCH) 데이터 등일 수 있다. 이 것은 제한되지 않는다. 물리 계층의 관점에서, 업링크 데이터는 전송 블록(transport block, TB)이다. 상위 계 층 프로토콜의 관점에서, 업링크 데이터는 미디어 액세스 제어(media access control, MAC) 패킷 데이터 유닛 (packet data unit, PDU)이다. 업링크 데이터가 4-스텝 랜덤 액세스 방식에 대응하는 전송 리소스(또는 4-스텝 랜덤 액세스 리소스라 함)에 기초해서 송신되는 경우, 업링크 데이터를 전달하는 Msg3는 종래 기술에서 제어 시 그널링을 전달하는 Msg3와는 상이하다. 본 출원에서, Msg3로 전달되는 업링크 데이터는 UP 데이터, CP 데이터, DTCH 데이터 등일 수 있다. 이것은 제한되지 않는다. 본 출원의 실시예에서 제공되는 데이터 전송 방법은 4세대(4th generation, 4G) 시스템, 롱텀 에볼루션(long term evolution, LTE) 시스템, 5세대(5th generation, 5G) 시스템, 뉴 라디오(new radio, NR) 시스템, NR-차량 대 사물(vehicle-to-everything, V2X) 시스템, 사물 인터넷 또는 다른 차세대 통신 시스템에 적용될 수 있다. 이것은 제한되지 않는다. 이하에서는 도 2에 도시된 통신 시스템을 예로 들어 본 출원의 실시예에서 제공되는 데이터 전송 방법을 설명한다. 도 2는 본 출원의 실시예에 따른 통신 시스템의 개략도이다. 도 2에 도시된 바와 같이, 통신 시스템은 액세스 네트워크 디바이스 및 복수의 단말, 예를 들어, 단말 1 및 단말 2를 포함할 수 있다. 도 2에 도시된 시스템에서 단말은 유휴 상태 또는 비활성 상태일 수 있다. 도 2는 예시적인 구조도임에 주의한다. 도 2에 포함되는 노드의 수는 제한되지 않는다. 도 2에 도시된 기능 노드 이외에, 예를 들어, 코어 네트워크 디바이스, 게이트웨이 디바 이스, 또는 애플리케이션 서버 등 다른 노드가 더 포함될 수 있다. 이것은 제한되지 않는다. 액세스 네트워크 디바이스는 주로 단말의 리소스 스케줄링, 무선 리소스 관리 및 무선 액세스 제어와 같은 기능 을 구현하도록 구성된다. 구체적으로, 액세스 네트워크 디바이스는 소형 기지국, 무선 액세스 포인트, 송수신 포인트(transmission reception point, TRP), 송신 포인트(transmission point, TP) 및 다른 액세스 노드 중 임의의 노드가 될 수 있다. 단말은 단말 장비(terminal equipment), 사용자 장비(user equipment, UE), 이동국(mobile station, MS), 이동 단말(mobile terminal, MT) 등일 수 있다. 구체적으로, 단말은 휴대폰(mobile phone), 태블릿 컴퓨터, 또는 무 선 송수신 기능을 가진 컴퓨터일 수 있고, 가상 현실(virtual reality, VR) 단말, 증강현실(augmented reality, AR) 단말, 산업 제어 분야의 무선 단말, 자율 주행의 무선 단말, 원격 의료의 무선 단말, 스마트 그리 드의 무선 단말, 스마트 시티(smart city)에서의 무선 단말, 스마트 홈, 차량 탑재 단말 등일 수 있다. 본 출 원의 실시예에서, 단말의 기능을 구현하도록 구성된 장치는 단말일 수도 있고, 또는 단말의 기능 구현을 지원할 수 있는 장치일 수도 있으며, 예를 들어, 칩 시스템(예를 들어, 하나의 칩 또는 복수의 칩을 포함하는 처리 시 스템)일 수 있다. 이하에서는 단말의 기능을 구현하는 장치가 단말인 예를 이용해서 본 출원의 실시예에서 제공 되는 데이터 전송 방법을 설명한다. 구체적인 구현 동안에, 도 2에 도시된 네트워크 요소, 예를 들어, 단말 및 액세스 네트워크 디바이스는 도 3에 도시된 구성 구조를 이용할 수도 있고, 도 3에 도시된 컴포넌트를 포함할 수도 있다. 도 3은 본 출원의 일 실시 예에 따른 통신 장치의 개략 구성도이다. 통신 장치가 본 출원의 실시예에서 설명된 단말의 기능을 갖는 경우, 통신 장치는 단말일 수도 있고, 또는 단말 내의 칩이나 시스템-온-칩일 수 있다. 통신 장치 가 본 출원의 실시예에서 액세스 네트워크 디바이스의 기능을 가질 때, 통신 장치는 액세스 네트워크 디바이스일 수도 있고, 액세스 네트워크 디바이스 내의 칩이나 시스템-온-칩일 수 있다. 도 3에 도시된 바와 같이, 통신 장치는 프로세서, 통신 라인 및 통신 인터페이스를 포함할 수 있다. 또한, 통신 장치는 메모리를 포함할 수 있다. 프로세서, 메모리 및 통신 인터페 이스는 통신선을 통해 서로 접속될 수 있다. 프로세서는 중앙 처리 유닛(central processing unit, CPU), 범용 프로세서, 네트워크 프로세서(network processor, NP), 디지털 신호 프로세서(digital signal processor, DSP), 마이크로프로세서, 마이크로컨트롤러, 프로그램가능 로직 디바이스(programmable logic device, PLD), 또는 이들의 임의의 조합일 수 있다. 다른 방안으로 프로세서는 처리 기능을 가진 다른 장치, 예를 들어, 회로, 컴포넌트, 또는 소프 트웨어 모듈일 수 있다. 통신 라인은 통신 장치에 포함된 컴포넌트들 사이에서 정보를 전송하도록 구성된다. 통신 인터페이스는 다른 디바이스 또는 다른 통신 네트워크와 통신하도록 구성된다. 다른 통신 네트워크는 이더넷, 무선 액세스 네트워크(radio access network, RAN), 무선 근거리 통신망(wireless local area network, WLAN) 등일 수 있다. 통신 인터페이스는 무선 주파수 모듈, 송수신기, 또는 통신을 구현할 수 있 는 임의의 장치일 수 있다. 본 출원의 이 실시예에서, 통신 인터페이스가 무선 주파수 모듈인 예가 설명에 사용된다. 무선 주파수 모듈은 안테나, 무선 주파수 회로 등을 포함할 수 있다. 무선 주파수 회로는 무선 주파 수 집적 칩, 전력 증폭기 등을 포함할 수 있다. 메모리는 명령어를 저장하도록 구성된다. 명령어는 컴퓨터 프로그램일 수 있다. 메모리는 판독 전용 메모리(read-only memory, ROM) 또는 정적 정보 및/또는 명령어를 저장할 수 있는 다 른 타입의 정적 저장 디바이스일 수도 있고, 랜덤 액세스 메모리(random access memory, RAM) 또는 정보 및/또 는 명령어를 저장할 수 있는 다른 유형의 동적 저장 디바이스일 수도 있고, 또는 전기적으로 소거 가능한 프로 그램가능 판독 전용 메모리(electrically erasable programmable read-only memory, EEPROM), 콤팩트 디스크 판독 전용 메모리(compact disc read-only memory, CD-ROM) 또는 다른 광 디스크 저장 장치, 광 디스크 저장 장치, 또는 자기 디스크 저장 매체 또는 다른 자기 저장 장치일 수도 있다. 광 디스크 저장 장치는 콤팩트 디스 크, 레이저 디스크, 광 디스크, 디지털 다목적 디스크, 블루-레이 디스크 등을 포함한다. 메모리는 프로세서와 독립적으로 존재할 수도 있고, 또는 프로세서와 통합될 수도 있다는 점에 주의한다. 메모리는 명령어, 프로그램 코드, 일부 데이터 등을 저장하도록 구성될 수 있다. 메모리는 통신 장치 내부에 위치될 수도 있고, 통신 장치의 외부에 위치될 수도 있다. 이것은 제한되지 않는다. 프로세서는 메모리에 저장된 명령어를 실행해서, 본 출원의 다음 실시예에서 제공되는 데이 터 전송 방법을 구현하도록 구성된다. 일 예에서, 프로세서는 하나 이상의 CPU, 예를 들면, 도 3의 CPU 0 및 CPU 1을 포함할 수 있다. 선택적인 구현예에서, 통신 장치는 복수의 프로세서를 포함한다. 예를 들어, 통신 장치는 도 3의 프 로세서 이외에 프로세서를 더 포함할 수도 있다. 선택적인 구현예에서, 통신 장치는 출력 디바이스 및 입력 디바이스를 더 포함한다. 입력 디바 이스는 키보드, 마우스, 마이크, 조이스틱 등이고, 출력 장치는 디스플레이 또는 스피커(speaker)와 같은 디바이스이다. 통신 장치는 데스크탑 컴퓨터, 휴대용 컴퓨터, 네트워크 서버, 휴대폰, 태블릿 컴퓨터, 무선 단말, 임베디 드 장치, 칩 시스템 또는 도 3과 유사한 구조를 가진 디바이스일 수 있다는 점에 주의한다. 나아가, 도 3에 도 시된 구성 구조는 통신 장치에 대한 제한을 두지 않는다. 도 3에 도시된 컴포넌트 이외에, 통신 장치는 도면에 도시된 것보다 더 많거나 혹은 적은 컴포넌트를 포함할 수도 있고, 일부 컴포넌트들은 결합될 수도 있으며, 다 른 컴포넌트 배열이 사용될 수도 있다. 본 출원의 이 실시예에서, 칩 시스템은 칩을 포함할 수도 있고, 또는 칩이나 다른 개별 컴포넌트를 포함할 수도 있다. 이하에서는 도 2에 도시된 통신 시스템을 참조하면서 본 출원의 실시예에서 제공되는 데이터 전송 방법을 설명 한다. 이하의 실시예에서 디바이스는 도 3에 도시된 컴포넌트를 구비할 수 있으며, 본 출원의 실시예들에서의 동작, 용어 등은 상호 참조될 수 있다. 실시예에서, 디바이스들 사이에서 교환되는 메시지의 명칭, 메시지 내의 파라미터의 명칭 등은 단지 예시적인 것으로, 이와 달리 특정 구현예에서는 다른 명칭일 수도 있다. 이것은 제 한되지 않는다.도 4는 본 출원의 일 실시예에 따른 데이터 전송 방법을 나타낸다. 도 4에 도시된 바와 같이, 방법은 다음 단계 를 포함할 수 있다. 단계 401: 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한다. 단말은 도 2에 도시된 통신 시스템에서 유휴 상태 또는 비활성 상태에 있는 임의의 단말일 수 있다. 액세스 네 트워크 디바이스는 도 2에 도시된 통신 시스템에 있으면서 단말에 네트워크 서비스를 제공할 수 있는 임의의 액 세스 네트워크 디바이스일 수 있다. 채널 품질은 단말과 액세스 네트워크 디바이스 사이의 전송 채널의 품질을 평가하는데 사용될 수 있다. 단말과 액세스 네트워크 디바이스 사이의 거리가 짧을수록 양호한 채널 품질에 대응하며, 단말과 액세스 네트워크 디바 이스 사이의 양호한 전송 채널은 업링크 데이터를 성공적으로 전송할 확률이 더 높다는 것을 의미한다. 이와 달 리, 단말과 액세스 네트워크 디바이스 사이의 거리가 길수록 채널 품질은 열악하고, 단말과 액세스 네트워크 디 바이스 사이의 전송 채널이 열악하면 업링크 데이터를 성공적으로 송신할 확률이 낮아진다. 채널 품질은 기준 신호 수신 전력(reference signal received power, RSRP), 기준 신호 수신 품질(reference signal received quality, RSRQ), 또는 신호 대 간섭 플러스 잡음비(signal to interference plus noise ratio, SINR)를 포함할 수 있다. 예를 들어, 단말이 비접속 상태인 경우, 단말과 액세스 네트워크 디바이스 사이의 채널 품질은 액세스 네트워크 디바이스가 브로드캐스트하는 동기화 신호 블록(sync signal block, SSB)을 측정함으로써 획득될 수도 있고, 혹 은 단말과 액세스 네트워크 디바이스 사이의 채널 품질은 사전 설정된 채널을 측정하여 획득될 수도 있다. 상태 정보-참조 신호(channel-state information-reference signal, CSI-RS). 이것은 제한되지 않는다. 구체적으로, 측정 프로세스에 대해서는 종래의 기술을 참조한다. 단계 402: 채널 품질이 제 1 임계값보다 큰 경우, 단말은 업링크 데이터를 액세스 네트워크 디바이스에 랜덤 액 세스 방식 또는 CG 방식으로 송신하는 것으로 결정한다. 제 1 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 사전 설정될 수 있다. 예를 들어, 액세스 네트 워크 디바이스는 제 1 임계값을 전달하는 RRC 메시지를 단말에 송신할 수 있고, 단말은 RRC 메시지를 수신해서, RRC 메시지로부터 제 1 임계값을 획득한다. RRC 메시지는 단말 특정 RRC 메시지일 수 있으며, RRC 메시지의 수 신 개체는 단말이다. 예를 들어, RRC 메시지는 RRC 해제 메시지일 수 있다. 이와 달리, RRC 메시지는 액세스 네 트워크 디바이스가 브로드캐스트하는 RRC 메시지일 수도 있으며, RRC 메시지의 수신 개체는 복수의 단말일 수도 있다. 예를 들어, RRC 메시지는 시스템 정보 블록(system information block, SIB)일 수 있다. 제 1 임계값은 단말이 업링크 데이터를 랜덤 액세스 방식으로 송신할지 CG 방식으로 송신할지 여부를 나타낼 수 있다. 제 1 임 계값의 값은 필요에 따라 세팅될 수 있다. 이것은 제한되지 않는다. 단말은 타이밍 어드밴스(timing advance, TA)가 유효한지 여부에 기초해서, 업링크 데이터를 랜덤 액세스 방식 으로 송신하거나, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정할 수 있다. 예를 들어, 단말은 TA가 유효한지 여부를 결정한다. TA가 유효하지 않은 경우, 단말은 업링크 데이터를 랜덤 액 세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. TA가 유효한 경우, 단말은 업링크 데이 터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. TA는 단말과 액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용될 수 있다. 다음의 3가지 경우 내지 중 어느 하나 이상이 존재하는 경우, TA는 유효하지 않다. 이와 달리, 다음 3가지 경우 어느 것도 존 재하지 않는 경우, TA는 유효하다. TA의 유효기간이 만료되면, TA는 유효하지 않다. TA의 유효 기간은 액세스 네트워크 디바이스에 의해 결정되고, 액세스 네트워크 디바이스에 의해 단말에 통지될 수 있다. 단말은 액세스 네트워크 디바이스가 통지한 TA의 유효 기간을 수신한 후에, TA에 대응하는 타이머를 시작한다. 타이머의 실행 기간은 TA의 유효 기간과 같다. 타이머가 만료되면 TA의 유효 기간이 만료된다. 단말의 현재 위치와 TA가 시작될 때 단말이 위치했던 위치 사이의 거리가 거리 임계값보다 큰 경우, TA는 유효하지 않게 된다. 거리 임계값은 필요에 따라 세팅될 수 있다. 이것은 제한되지 않는다. 거리 임계값은 단말에 대해서 액세스 네 트워크 디바이스에 의해 설정될 수 있다. 거리 임계값의 설정 방식은, 액세스 네트워크 디바이스가 단말에 대해 서 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하지 않는다. 단말의 현재 위치와 TA가 시작될 때 단말이 위치했던 위치 사이의 거리가 거리 임계값보다 작은 경우, 단말의 이동 거리가 작으므로, 단말과 액세스 네트워크 디바이스 사이의 전송 채널은 변경되지 않거나 약간 변경되며, TA는 여전히 적용 가능하 다. 이와 달리, 단말의 현재 위치와 TA가 시작될 때 단말이 위치했던 위치 사이의 거리가 거리 임계값보다 큰 경우, 단말의 이동 거리가 크므로, 단말이 액세스 네트워크 디바이스로부터 멀리 떨어져 있을 수 있고, 단말과 액세스 네트워크 디바이스 사이의 전송 채널이 변경되어서, 예를 들어, 성능이 저하되고 TA는 유효하지 않다. 이와 달리, TA가 유효하지 않은지 여부는 단말과 액세스 네트워크 디바이스 사이의 채널 품질에 기초해서 결정 될 수 있다. 예를 들어, 가능한 방식으로, 단말과 액세스 네트워크 디바이스 사이의 거리는 채널 품질로 표현될 수 있다. 단말과 액세스 네트워크 디바이스 사이의 거리가 짧은 것을 양호한 채널 품질에 대응하고, 단말과 액 세스 네트워크 디바이스 사이의 거리가 긴 것은 열악한 채널 품질에 대응한다. 단말의 채널 품질이 채널 품질 임계값보다 작은 경우, TA는 유효하지 않다. 단말의 채널 품질이 채널 품질 임계값보다 큰 경우, TA는 유효하다. 채널 품질 임계값은 필요에 따라서 세팅될 수 있으며, 채널 품질 임계값은 단말에 대해서 액세스 네트워크 디바 이스에 의해 설정될 수 있다. 채널 품질 임계값의 설정 방식은 단말에 대해 액세스 네트워크 디바이스이 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하지 않는다. 채널 품질과 TA가 시작될 때 달성된 단말과 액세스 네트워크 디바이스 사이의 채널의 품질 차이가 채널 품 질 변경 임계값보다 큰 경우, TA는 유효하지 않다. 채널 품질 변경 임계값은 필요에 따라 세팅될 수 있다. 이것은 제한되지 않는다. 채널 품질 변경 임계값은 단말 에 대해서 액세스 네트워크 디바이스에 의해 사전 설정될 수 있다. 채널 품질 변경 임계값의 설정 방식은 단말 에 대해 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하지 않는다. 채널 품질과 TA가 시작될 때 달성되는 단말과 액세스 네트워크 디바이스 사이의 채널 품질의 차이가 채 널 품질 변경 임계값보다 작은 경우, 단말과 액세스 네트워크 디바이스 사이의 전송 채널은 변경되지 않거나 약 간 변경된 것으로, TA는 여전히 적용 가능하다. 만약 채널 품질과 TA가 시작될 때 달성되는 단말과 액세스 네트 워크 디바이스 사이의 채널 품질의 차이가 채널 품질 변경 임계값보다 크면, 채널 품질은 저하되고, TA는 유효 하지 않다. 단말은 업링크 데이터를 랜덤 액세스 방식으로 네트워크 디바이스에 송신할 때, 단말은 제 2 임계값에 기초해서 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신할지 또는 4-스텝 랜덤 액세스 방식으로 송신할지 결정할 수 있다. 구체적으로, 프로세스는: 채널 품질이 제 2 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방 식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것; 또는 채널 품질이 제 2 임계값보다 작은 경 우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것을 포함한다. 제 2 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정될 수 있다. 제 2 임계값의 설정 방식은 단 말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하 지 않는다. 제 2 임계값은 필요에 따라 설정될 수 있다. 이것은 제한되지 않는다. 예를 들어, 제 2 임계값은 제 1 임계값보다 클 수 있다. 제 2 임계값은, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트 워크 디바이스에 송신할지 또는 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송 신할지 선택하는데, 사용될 수 있다. 이 출원의 이 실시예에서, 동일한 임계값에 대응해서 임계값보다 큼과 임계값보다 작음의 두 가지 경우가 존재 한다는 점에 주의한다. \"임계값보다 큼\"은 \"임계값 보다 크거나 같음\"으로 대체될 수도 있고, 또는 \"임계값보다 작음\"은 \"임계값보다 작거나 같음\"으로 대체될 수도 있다. 환언하면, 동일한 임계값에 대해, 다음과 같은 경우 가 있을 수 있다: 임계값보다 크거나 같은 것과 임계값보다 작은 것, 또는 임계값보다 큰 것과 임계값보다 작거 나 같음 것. 이것은 제한되지 않는다. 예를 들어, 본 출원에서, \"제 1 임계값보다 큼\" 및 \"제 1 임계값보다 작 음\"은 다음의 설명으로 대체될 수 있다: 제 1 임계값보다 큼 및 제 1 임계값보다 작거나 같음; 또는 제 1 임계 값보다 크거나 같음 및 제 1 임계값보다 작음. 또한, 도 4에 도시된 바와 같이, 이 방법은 다음 단계를 더 포함한다. 단계 403: 채널 품질이 제 1 임계값보다 작은 경우, 단말은 비접속 상태에서 업링크 데이터를 송신하지 않고, 랜덤 액세스 방식으로 랜덤 액세스를 개시하여 액세스 네트워크 디바이스에 대응하는 셀에 액세스하는 것으로 결정한다. 예를 들어, 단말은 제 5 임계값에 기초해서 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시할지 또는 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시할지 결정할 수 있다. 예를 들어, 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 큰 경우, 단말은 비접속 상태의 액세스 네트워크 디바이스에 업링크 데이터를 송 신하지 않고, 2-스텝 랜덤 액세스 방식의 랜덤 액세스를 개시해서 셀에 액세스하는 것으로 결정한다. 채널 품질 이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 작은 경우, 단말은 업링크 데이터를 비접속 상태의 액세 스 네트워크 디바이스에 송신하지 않고, 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시해서 셀에 액세스하는 것으로 결정한다. 제 5 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정될 수 있다. 제 5 임계값의 설정 방식은 단 말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하 지 않는다. 제 5 임계값은 필요에 따라 설정될 수 있다. 이것은 제한되지 않는다. 예를 들어, 제 5 임계값은 제 1 임계값보다 작을 수 있다. 제 5 임계값은, 단말이 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시할지 또는 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시할지 선택하는데, 사용될 수 있다. 도 4에 도시된 방법에 따르면, 단말은, 제 1 임계값 및 제 2 임계값에 기초해서 업링크 데이터를 송신하는 방식 을 적절하게 선택할 수 있다. 이는 업링크 데이터의 전송 효율을 향상시키고, 선택된 전송 방식에 대응하는 채 널 품질이 좋지 않아서 업링크 데이터 전송이 실패하여 리소스 낭비가 발생되는 문제를 방지한다. 또한, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정한 후, 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서 업링크 데이터를 송신할 수 있다. 2-스텝 랜덤 액세스 방식에 대응하 는 전송 리소스는 2-스텝 랜덤 액세스 리소스, MsgA에 대응하는 전송 리소스 등으로 지칭될 수 있다. 본 출원에 서 2-스텝 랜덤 액세스 방식은 하나의 전송 리소스 그룹에 대응할 수도 있고 또는 복수의 전송 리소스 그룹에 대응할 수도 있다. 이것은 제한되지 않는다. 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스는 단말에 대해 액세스 네트워크 디바이스에 의해 사전 설정될 수 있다. 하나의 전송 리소스 그룹은 프리앰블 및 PUSCH를 포함 할 수 있다. 단말은 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스 그룹으로 MsgA를 송신할 수 있다. MsgA는 프리앰블과 업링크 데이터를 전달하는 PUSCH를 포함한다. 일례로, 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스가 하나만 존재하는 경우, 단말은 고유 전송 리소스에 기초해서 업링크 데이터를 송신할 수 있다. 다른 예에서, 2-스텝 랜덤 액세스 방식에 대응하는 복수의 전송 리소스가 존재하고, 각각의 전송 리소스가 서로 다른 채널 품질에 대응하는 경우, 예를 들어, 각각의 전송 리소스가 서로 다른 변조 및 코딩 방식(modulation and coding schemes, MCS) 및/또는 전송 블록 속도(transmission block speeds, TBS)에 대응하는 경우, 업링크 데이터가 성공적으로 전송되고 업링크 데이터를 전송하는 데 사용되는 PUSCH가 성공적으로 디코딩되도록, 단말 은 복수의 전송 리소스 그룹 중에서 적절한 전송 리소스 또는 양호한 채널 품질을 가진 전송 리소스를 선택해서 업링크 데이터를 전송해야 한다. 예를 들어, 단말은 제 3 임계값에 기초해서 2-스텝 랜덤 액세스 방식에 대응하 는 복수의 전송 리소스 중에서 제 1 전송 리소스를 선택하고, 제 1 전송 리소스에 기초해서 MsgA로 액세스 네트 워크 디바이스에 프리앰블 및 업링크 데이터를 송신할 수 있으며, 여기서 업링크 데이터는 MsgA에 대응하는 PUSCH로 전달된다. 제 3 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정될 수 있다. 제 3 임계값의 설정 방식은 단 말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하 지 않는다. 제 3 임계값은 필요에 따라 설정될 수 있다. 이것은 제한되지 않는다. 예를 들어, 제 3 임계값은 제 1 임계값보다 크거나, 제 3 임계값은 제 2 임계값보다 크거나, 또는 제 3 임계값은 적어도 하나의 임계값 중 가 장 작은 임계값보다 작거나 같을 수 있다. 제 3 임계값은 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신할 때, 업링크 데이터를 송신하는 데 사용되는 적절한 대응 전송 리소스를 선택하는 데 사용될 수 있다. 제 3 임계값과 제 1 전송 리소스 사이의 연관 관계는 이하의 방식 내지 방식 과 같다. 방식 : 2-스텝 랜덤 액세스 방식은 하나 이상의 전송 리소스 그룹에 대응할 수 있다. 하나 이상의 전송 리소 스 그룹은 제 1 전송 리소스를 포함한다. 각각의 전송 리소스에 대응하는 설정 정보는 하나 이상의 임계값을 포 함한다. 각각의 전송 리소스 그룹에 대응하는 설정 정보에 포함된 임계값은 단말이 전송 리소스를 선택할지 여 부를 결정하는데 사용된다. 예를 들어, 채널 품질이 전송 리소스에 대응하는 설정 정보에 포함된 임계값보다 큰 경우, 단말은 MsgA를 송신할 전송 리소스를 선택할 수 있으며, 여기서 MsgA는 업링크 데이터를 전달하는 프리앰 블 및 PUSCH를 포함한다. 그렇지 않으면, 단말은 업링크 데이터를 송신하는 데 전송 리소스에 대응하는 PUSCH를 선택할 수 없다. 채널 품질이 모든 전송 리소스에 대응하는 설정 정보에 포함된 임계값보다 작은 경우, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신된다.각각의 전송 파라미터에 대응하는 임계값은 설정 정보로 전달되고 단말에 대해 설정될 수 있다. 임계값의 설정 방식에 대해서는, 단말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 전술한 방식을 참조한다. 자세한 내용은 다시 설명하지 않는다. 제 3 임계값은 적어도 하나의 전송 리소스 그룹에 대응하는 적어도 하나 의 임계값에 포함될 수 있다. 예를 들어, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한 이후에, 채널 품질을, 액세스 네트워크 디바이스에 의해 설정된 전송 리소스에 대응하는 임계값과 비교해서, 채널 품질이, 적어도 하나의 전 송 리소스 그룹에 대응하는 임계값 중 어느 임계값보다 큰지를 결정할 수 있다. 단말은 이들 임계값 중 가장 큰 임계값(예를 들어, 제 3 임계값)에 대응하는 전송 리소스(예를 들어, 제 1 전송 리소스)를 이용해서 MsgA를 송 신하고, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함하며; 또는 단말은 결정된 임계값에 대응하는 전송 리소스를 이용해서 MsgA를 송신하고, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 이것은 제한되지 않는다. 예를 들어, 업링크 데이터는 업링크 스몰 데이터이고, 채널 품질은 RSRP이다. 다음 코드에 나타낸 바와 같이, 단말에 대해서 액세스 네트워크 디바이스에 의해 설정된, MsgA에 대응하는 설정 정보에, MsgA-RSRP- TheresholdsmallData-r17 필드가 추가된다. MsgA-RSRP-TheresholdsmallData-r17은 구체적으로 RSRP 임계값을 나타내고, RSRP 임계값은 단말이 MsgA를 이용해서 업링크 스몰 데이터를 송신할지 여부를 나타내며, MsgA-RSRP- TheresholdsmallData-r17은 설정 정보에 의해 표시된 전송 리소스 내의 PUSCH 리소스가 업링크 스몰 데이터를 송신하는 데 사용될 수 있는 조건을 나타낼 수 있다. 모든 설정 정보에서 채널 품질이 MsgA-RSRP- TheresholdsmallData-r17보다 낮은 경우, 단말은 4-스텝 랜덤 액세스 방식으로 업링크 스몰 데이터를 송신한다. 다음의 코드에서 MsgA-RSRP-TheresholdsmallData-r17 필드 이외의 필드의 구체적인 의미에 대해서는 종래 기술 의 설명을 참조한다는 점에 주의한다. 자세한 내용은 설명하지 않는다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "방식 : 2-스텝 랜덤 액세스 방식은 적어도 하나의 전송 리소스 그룹(예를 들어, 하나 이상의 전송 리소스 그 룹)에 대응될 수 있고, 적어도 하나의 전송 리소스 그룹은 제 1 전송 리소스 그룹을 포함하며, 적어도 하나의전송 리소스 그룹은 적어도 하나의 전송 파라미터 그룹에 대응될 수 있고, 전송 파라미터의 하나의 그룹은 MCS 및/또는 TBS를 포함할 수 있다. 적어도 하나의 전송 파라미터 그룹은 적어도 하나의 전송 파라미터 범위로 분할 될 수 있고, 전송 파라미터 범위의 최대값은 적어도 하나의 전송 파라미터 그룹에서 가장 큰 값일 수도 있고 그 보다 클수도 있으며, 전송 파라미터 범위의 최소값은 적어도 하나의 전송 파라미터 그룹에서 가장 작은 값일 수 도 있고 그보다 작을 수도 있다. 하나의 전송 파라미터 범위에 대해서 하나의 임계값이 대응해서 세팅되고, 각 각의 전송 파라미터 범위에 대응하는 임계값은 단말이 전송 리소스에 기초해서 업링크 데이터를 송신할지 여부 를 선택하는데 사용될 수 있다. 예를 들어, 채널 품질이 전송 파라미터 범위에 대응하는 임계값보다 큰 경우, 전송 파라미터 범위 내의 전송 파라미터 그룹에 대응하는 전송 리소스는 단말이 MsgA를 송신하기 위해서 선택될 수 있으며, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함하고; 또는 채널 품질이 전송 파 라미터 범위에 대응하는 임계값보다 크지 않은 경우, 전송 리소스에 대응하는 PUSCH는 단말이 업링크 데이터를 송신하기 위해서 선택하지 않을 수 있다. 채널 품질이 모든 전송 파라미터 범위에 대응하는 임계값보다 작은 경 우, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 송신된다. 전송 파라미터 범위 및 전송 파라미터 범위에 대응하는 임계값은 단말에 대해 액세스 네트워크 디바이스에 의해 설정될 수 있다. 전송 파라미터 범위 및 전송 파라미터 범위에 대응하는 임계값의 설정 방식에 대해서는 전술한 단말에 대해서 액세스 네트워크 디바이스별로 제 1 임계값을 설정하는 방식을 참조한다. 자세한 내용은 다시 설 명하지 않는다. 제 3 임계값은 적어도 하나의 임계값에 포함될 수 있으며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 범위에 속한다. 예를 들어, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한 이후에, 채널 품질을, 액세스 네트워크 디바이스에 의해 설정된 전송 파라미터 범위에 대응하는 임계값과 비교해서, 채널 품질이, 적어도 하 나의 임계값 중 어느 임계값보다 큰지를 결정하고, 이들 임계값 중 가장 큰 임계값(예를 들어, 제 3 임계값)에 대응하는 전송 파라미터 범위 내의 임의의 전송 파라미터에 대응하는 전송 리소스(예를 들어, 제 1 전송 리소스)를 이용해서 업링크 데이터를 송신하거나, 결정된 임계값 중 어느 하나에 대응하는 전송 파라미터 범위 내의 임의의 전송 파라미터에 대응하는 전송 리소스를 이용해서 업링크 데이터를 송신한다. 이것은 제한되지 않 는다. 본 출원에서, 상이한 전송 파라미터 범위에 포함된 전송 파라미터는 중첩될 수도 있고, 혹은 중첩되지 않을 수 도 있다는 점에 주의한다. 예를 들어, 전송 파라미터 범위 1은 전송 파라미터 범위 2를 포함할 수도 있고, 전송 파라미터 범위 1 및 전송 파라미터 범위 2에 포함되는 전송 파라미터가 서로 다를 수도 있다. 이것은 제한되지 않는다. 예를 들어, 업링크 데이터는 업링크 스몰 데이터이다. 채널 품질은 RSRP이고, 전송 파라미터는 MCS이며, 전송 파라미터 범위는 MCS 범위이고, MCS 범위 1, MCS 범위 2 및 MCS 범위 3의 3가지 MCS 범위가 있다. 예를 들어, MCS 범위에 대응하는 임계값은 RSRP 임계값이고, 각각의 RSRP 임계값은 각각 하나의 MCS 범위에 대응한다. 하나 의 MCS 범위는 하나의 상위 한계(upper bound) 및 하나의 하위 한계(lower bound)에 의해 정의될 수 있다. 각각 의 한계는 하나의 전송 파라미터에 대응한다. 예를 들어, 각각의 한계는 전송 파라미터 인덱스 값, 즉 MCS 인덱 스 값(I_MCS)이고, 전송 파라미터 인덱스 값은 고유하게 하나의 전송 파라미터를 나타낸다. 구체적으로, 액세스 네트워크 디바이스는 다음 시그널링을 이용해서 RSRP 임계값 및 MCS 범위를 전달하고, 이 시그널링을 단말에 송 신할 수 있다. 예를 들어, 다음 시그널링에서, R17 프로토콜에서 MsgA에 대응하는 RSRP-MCS-임계값 리스트 (MsgA-RSRP-MCS-TheresholdForsmallDataList-r17)는 N개 RSRP-MCS-임계값(MsgA-RSRP-MCS- TheresholdForsmallData-r17)을 포함할 수 있으며, 여기서 N의 값은 3이다. MsgA-RSRP-MCS- TheresholdForsmallDataList-r17SEQUENCE SIZE(1..N)) OF MsgA-RSRP-MCS-TheresholdForsmallData-r17."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "RSRP 임계값 및 MCS 범위는 테이블 형태로 표현될 수 있다. 다음 표 1에 도시된 바와 같이, MCS 범위와 RSRP 임 계값 사이의 대응 관계가 도시되어 있다. RSRP 임계값 1은 MCS 범위 1에 대응하고, RSRP 임계값 2는 MCS 범위 2 에 대응하며, RSRP 임계값 3은 MCS 범위 3에 대응한다. 단말은, 채널 품질을 RSRP 임계값 1 내지 RSRP 임계값 3 과 비교할 수 있다. 채널 품질이 RSRP 임계값 2보다 큰 것으로 확인되면, RSRP 임계값 2에 대응하는 MCS 범위 2 에 포함된 전송 파라미터에 대응하는 전송 리소스를 이용해서 업링크 데이터가 송신된다. 채널 품질이 3개의 RSRP 임계값 중 가장 작은 임계값보다 작은 것으로 확인되면, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 송신된다. 표 1 RSRP 임계값 1 MCS 범위 1 RSRP 임계값 2 MCS 범위 2 RSRP 임계값 3 MCS 범위 3 다른 예로서, 업링크 데이터는 업링크 스몰 데이터이다. 채널 품질은 RSRP이고, 전송 파라미터는 TBS이며, 전송 파라미터 범위는 TBS 범위이며, TBS 범위 1, TBS 범위 2, TBS 범위 3의 세가지 TBS 범위가 있으며, TBS 범위에 대응하는 임계값은 RSRP 임계값이다. 각각의 RSRP 임계값은 각각 하나의 TBS 범위에 대응한다. 하나의 TBS 범위 는 하나의 상위 한계와 하나의 하위 한계로 정의할 수 있다. 상위 한계와 하위 한계의 구체적인 값은 TBS의 크 기일 수 있다. 구체적으로, 액세스 네트워크 디바이스는 다음 시그널링을 이용해서 RSRP 임계값 및 TBS 범위를 전달하고, 이 시그널링을 단말에 송신할 수 있다. 예를 들어, 다음 시그널링에서, MsgA-RSRP-TBS- TheresholdForsmallDataList-r17은 N개 RSRP-TBS-임계값 MsgA-RSRP-TBS-TheresholdForsmallData-r17을 포함할 수 있으며, 여기서 N의 값은 3이다. 각각의 MsgA-RSRP-TBS-TheresholdForsmallData-r17은 하나의 RSRP 값 및 대응하는 TBS 범위를 포함한다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 4, "content": "RSRP 임계값 및 TBS 범위는 테이블 형태로 표현될 수 있다. 다음 표 2에 도시된 바와 같이, TBS 범위와 RSRP 임 계값 사이의 대응 관계가 도시되어 있다. RSRP 임계값 1은 TBS 범위 1에 대응하고, RSRP 임계값 2는 TBS 범위 2 에 대응하며, RSRP 임계값 3은 TBS 범위 3에 대응한다. 단말은 채널 품질을 RSRP 임계값 1 내지 RSRP 임계값 3 과 비교할 수 있다. 채널 품질이 RSRP 임계값 2보다 큰 것으로 확인되면, RSRP 임계값 2에 대응하는 TBS 범위 2 에 포함된 전송 파라미터에 대응하는 전송 리소스를 이용해서 업링크 데이터가 송신된다. 채널 품질이 3개의 RSRP 임계값 중 가장 작은 임계값보다 작은 것으로 확인되면, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 송 신된다. 표 2 RSRP 임계값 1 TBS 범위 1 RSRP 임계값 2 TBS 범위 2 RSRP 임계값 3 TBS 범위 3 방식 : 2-스텝 랜덤 액세스 방식은 적어도 하나의 전송 리소스 그룹에 대응할 수 있다. 적어도 하나의 전송 리소스 그룹은 제 1 전송 리소스를 포함하고, 적어도 하나의 전송 리소스 그룹은 적어도 하나의 전송 파라미터 임계값에 대응하며, 하나의 전송 파라미터 임계값은 하나의 채널 품질 임계값(본 출원에서는 간략하게 임계값이 라 함)에 대응하고, 각각의 전송 리소스 그룹에 대응하는 전송 파라미터 임계값에 대응하는 임계값은 단말이 전 송 리소스를 선택할지 여부를 결정하는데 사용된다. 예를 들어, 채널 품질이 전송 리소스에 대응하는 전송 파라 미터 임계값에 대응하는 임계값보다 큰 경우, 단말은 MsgA를 송신할 전송 리소스를 선택할 수 있으며, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 그렇지 않으면, 단말은 업링크 데이터를 송신 하는 데 전송 리소스에 대응하는 PUSCH를 선택할 수 없다. 채널 품질이 모든 전송 리소스에 대응하는 전송 파라 미터 임계값에 대응하는 임계값보다 작은 경우, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 송신된다.전송 파라미터, 전송 파라미터 임계값 및 전송 파라미터 임계값에 대응하는 채널 품질 임계값은, 단말에 대해서 액세 스 네트워크 디바이스에 의해 설정될 수 있다. 설정 방식에 대해서는, 단말에 대해서 액세스 네트워크 디바이스 에 의해 제 1 임계값을 설정하는 전술한 방식을 참조한다. 자세한 내용은 다시 설명하지 않는다. 제 3 임계값은 적어도 하나의 전송 파라미터 임계값에 대응하는 적어도 하나의 임계값에 포함될 수 있다. 예를 들어, 단말은, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한 이후에, 채널 품질을, 액세스 네트워크 디바이스에 의해 설정된 전송 파라미터 임계값에 대응하는 임계값과 비교해서, 채널 품질이, 적어도 하나의 전송 리소스 그룹에 대응하는 임계값 중 어느 임계값보다 큰지를 결정할 수 있다. 단말은 이들 임계값에 서 가장 큰 임계값(예를 들어, 제 3 임계값)에 대응하는 전송 파라미터 임계값에 대응하는 전송 리소스(예를 들 어, 제 1 전송 리소스)를 이용해서 MsgA를 송신하고, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 이와 달리, 단말은 결정된 임계값 중 어느 하나에 대응하는 전송 파라미터 임계값에 대응하 는 전송 리소스를 이용해서 MsgA를 송신하며, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포 함한다. 이것은 제한되지 않는다. 예를 들어, 업링크 데이터는 업링크 스몰 데이터이다. 채널 품질은 RSRP이고, 전송 파라미터는 MCS이며, 전송 파라미터 임계값은 MCS 임계값이다. MCS 임계값에는 MCS 임계값 1, MCS 임계값 2 및 MCS 임계값 3의 3가지 임계 값이 있다. 예를 들어, MCS 임계값에 대응하는 임계값은 RSRP 임계값이다. 각각의 RSRP 임계값은 각각 하나의 MCS 임계값에 대응한다. 하나의 MCS 임계값은 하나의 인덱스 값(I_MCS)에 대응할 수 있다. 구체적으로, 액세스 네트워크 디바이스는 다음 시그널링을 이용해서 RSRP 임계값 및 MCS 임계값을 전달하고, 이 시그널링을 단말에 송신할 수 있다. 예를 들어, 다음 시그널링에서, MsgA-RSRP-MCS-TheresholdForsmallDataList-r17은 N개의 MsgA-RSRP-MCS-TheresholdForsmallData-r17를 포함하며, 여기서 N의 값은 3이다. 각각의 MsgA-RSRP-MCS- TheresholdForsmallData-r17은 하나의 RSRP 임계값 및 대응하는 MCS 인덱스 값을 포함하고, MCS 인덱스 값은 하나의 대응하는 MCS 임계값이다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 5, "content": "RSRP 임계값 및 MCS 임계값은 테이블 형태로 표현될 수 있다. 다음 표 3은 MCS 임계값과 RSRP 임계값 사이의 대 응 관계를 나타낸다. RSRP 임계값 1은 MCS 임계값 1에 대응하며, RSRP 임계값 2는 MCS 임계값 2에 대응하며, RSRP 임계값 3은 MCS 임계값 3에 대응한다. 단말은 채널 품질을 RSRP 임계값 1 내지 RSRP 임계값 3과 비교할 수 있다. 채널 품질이 RSRP 임계값 2보다 큰 것으로 확인되면, RSRP 임계값 2에 대응하는 MCS 임계값 2에 대응하는 전송 리소스를 이용해서 MsgA를 송신하고, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함 한다. 채널 품질이 3개의 RSRP 임계값 중 가장 작은 임계값보다 작은 것으로 확인되면, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 송신된다. 표 3 RSRP 임계값 1 MCS 임계값 1 RSRP 임계값 2 MCS 임계값 2 RSRP 임계값 3 MCS 임계값 3 다른 예로서, 업링크 데이터는 업링크 스몰 데이터이다. 채널 품질은 RSRP이고, 전송 파라미터는 TBS이며, 전송 파라미터 임계값은 TBS 임계값이다. TBS 임계값에는 TBS 임계값 1, TBS 임계값 2 및 TBS 임계값 3의 3가지가 있 다. TBS 임계값에 대응하는 임계값은 RSRP 임계값이다. 각각의 RSRP 임계값은 각각 하나의 TBS 임계값에 대응한 다. 하나의 TBS 임계값은 하나의 인덱스 값(I_TBS)에 대응할 수 있다. 구체적으로, 액세스 네트워크 디바이스는 다음 시그널링을 이용해서 RSRP 임계값 및 TBS 임계값을 전달하고, 이 시그널링을 단말에 송신할 수 있다. 예를 들어, 다음 시그널링에서, MsgA-RSRP-TBS-TheresholdForsmallDataList-r17은 N개의 MsgA-RSRP-TBS- TheresholdForsmallData-r17를 포함하고, 여기서 N의 값은 3이다. 각각의 MsgA-RSRP-TBS- TheresholdForsmallData-r17은 하나의 RSRP 임계값 및 대응하는 TBS 인덱스 값을 포함하고, TBS 인덱스 값은 하나의 대응하는 TBS 임계값이다."}
{"patent_id": "10-2023-7001655", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 6, "content": "RSRP 임계값 및 TBS 임계값은 테이블 형태로 표현될 수 있다. 다음 표 4에 도시된 바와 같이, TBS 임계값과 RSRP 임계값 사이의 대응 관계가 도시되어 있다. RSRP 임계값 1은 TBS 임계값 1에 대응하고, RSRP 임계값 2는 TBS 임계값 2에 대응하며, RSRP 임계값 3은 TBS 임계값 3에 대응한다. 단말은 채널 품질을 RSRP 임계값 1 내지 RSRP 임계값 3과 비교할 수 있다. 채널 품질이 RSRP 임계값 2보다 큰 것으로 확인되면, RSRP 임계값 2에 대응하 는 TBS 임계값 2에 대응하는 전송 리소스를 이용해서 MsgA를 송신하며, 여기서 MsgA는 프리앰블 및 업링크 데이 터를 전달하는 PUSCH를 포함한다. 채널 품질이 3개의 RSRP 임계값 중 가장 작은 임계값보다 작은 것으로 확인되 면, 업링크 데이터는 4-스텝 랜덤 액세스 방식으로 송신된다. 표 4 RSRP 임계값 1 TBS 임계값 1 RSRP 임계값 2 TBS 임계값 2 RSRP 임계값 3 TBS 임계값 3 또한, 단말은 CG 방식으로 업링크 데이터를 송신하는 것으로 결정한 이후에, CG 방식에 대응하는 CG 리소스에 기초해서 업링크 데이터를 송신할 수 있다. 구체적으로, 일 예에서, CG 방식에 대응하는 CG 리소스가 하나뿐인 경우, 예를 들어, PUSCH 리소스 하나뿐인 경우, 단말은 CG 리소스에만 기초해서 업링크 데이터를 송신할 수 있 다. 다른 예에서, CG 방식에 대응하는 복수의 CG 리소스가 존재하고, 각각의 CG 리소스가 서로 다른 채널 품질에 대 응하는 경우, 예를 들어 각각의 CG 리소스가 서로 다른 MCS 및/또는 TBS에 대응하는 경우, 업링크 데이터가 성 공적으로 송신되고, 업링크 데이터를 송신하기 위한 PUSCH가 성공적으로 디코딩되도록, 단말은 복수의 CG 리소 스 중에서 적절한 CG 리소스/양호한 채널 품질을 가진 CG 리소스를 선택해서 업링크 데이터를 전송해야 한다. 예를 들어, 단말은 CG 방식에 대응하는 복수의 CG 리소스 중에서 제 4 임계값에 기초해서 제 1 CG 리소스를 선 택하고, 제 1 CG 리소스에 기초해서 업링크 데이터를 액세스 네트워크 디바이스에 송신할 수 있다. 예를 들어, 채널 품질이 제 4 임계값보다 큰 경우, 단말은 제 1 CG 리소스에 기초해서 업링크 데이터를 액세스 네트워크 디 바이스에 송신한다. CG 방식에 대응하는 CG 리소스는, 액세스 네트워크 디바이스에 의해 사전 설정되고 비접속 상태의 단말이 사용 하는 PUSCH 리소스이다. 단말에 대해서 액세스 네트워크 디바이스에 의해 CG 리소스를 설정하는 방식은 단말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하지 않 는다. 제 3 임계값과 제 1 전송 리소스 사이의 연관 관계와 유사하게, 제 4 임계값과 제 1 CG 리소스 사이의 관 계도 다음의 3가지 연관 관계 중 어느 하나를 포함할 수 있다. CG 방식은 하나 이상의 CG 리소스에 대응할 수 있고, 하나 이상의 CG 리소스는 제 1 CG 리소스를 포함하며, 각각의 CG 리소스에 대응하는 설정 정보는 하나의 이상의 임계값을 포함할 수 있다. 각각의 CG 리소스에 대응하 는 설정 정보에 포함된 임계값은, 단말이 CG 리소스를 선택할지 여부를 결정하는 데 사용된다. 채널 품질이 CG 리소스에 대응하는 설정 정보에 포함된 임계값보다 큰 경우, 단말은 업링크 데이터를 송신할 CG 리소스를 선택 하고; 또는 채널 품질이 CG 리소스에 대응하는 설정 정보에 포함된 임계값보다 크지 않은 경우, 단말은 업링크 데이터를 송신할 CG 리소스를 선택하지 않는다. 채널 품질이 모든 CG 리소스에 대응하는 설정 정보에 포함된 임 계값보다 작은 경우, 업링크 데이터는 CG 방식으로 송신되지 않고, 랜덤 액세스 방식으로 업링크 데이터를 송신 한다. 제 1 CG 리소스에 대응하는 설정 정보는 제 4 임계값을 포함한다. 예를 들어, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한 이후에, 채널 품질을 액세스 네트워크 디바이스에 의해 설정된 CG 리소스 에 대응하는 임계값과 비교해서 채널 품질이, 적어도 하나의 CG 리소스에 대응하는 임계값 중 어느 임계값보다 큰지를 결정할 수 있다. 단말은 이들 임계값 중 가장 큰 임계값(예를 들어, 제 3 임계값)에 대응하는 CG 리소스 (예를 들어, 제 1 CG 리소스)를 이용해서 업링크 데이터를 송신하거나, 결정된 임계값 중 어느 하나에 대응하는 CG 리소스를 이용해서 업링크 데이터를 송신한다. 이것은 제한되지 않는다. 구체적으로, 이 구현예에 대해서는, 전술한 방식 에서의 설명을 참조한다. 자세한 내용은 다시 설명하지 않 는다. CG 방식은 적어도 하나의 CG 리소스에 대응할 수 있고, 적어도 하나의 CG 리소스는 제 1 CG 리소스를 포함 하며, 적어도 하나의 CG 리소스는 적어도 하나의 전송 파라미터에 대응할 수 있고, 적어도 하나의 전송 파라미 터는 적어도 하나의 전송 파라미터 범위로 구분될 수 있으며, 전송 파라미터 범위 중 가장 큰 값이 하나 이상의전송 파라미터 중 가장 큰 값일 수도 있고 그보다 클 수도 있으며, 전송 파라미터 범위 중 가장 작은 값이 하나 이상의 전송 파라미터 중 가장 작은 값일 수도 있고 그보다 작을 수도 있다. 이로써, 하나의 전송 파라미터 범 위에 대해 하나의 임계값이 세팅된다. 각각의 전송 파라미터 범위에 대응하는 임계값이, CG 리소스에 기초해서 업링크 데이터를 송신할지 여부를 선택하기 위해 단말에 의해 사용될 수 있다. 예를 들어, 채널 품질이 전송 파 라미터 범위에 대응하는 임계값보다 큰 경우, 전송 파라미터 범위 내의 전송 파라미터에 대응하는 업링크 데이 터를 송신하는 데 CG 리소스가 선택되고; 그렇지 않으면 업링크 데이터를 송신하는 데 CG 리소스는 선택되지 않 는다. 채널 품질이 모든 전송 파라미터 범위에 대응하는 임계값보다 작은 경우, 업링크 데이터는 CG 방식으로 송신되지 않고, 업링크 데이터는 랜덤 액세스 방식으로 송신된다. 전송 파라미터 범위 및 전송 파라미터 범위에 대응하는 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의 해 설정될 수 있다. 전송 파라미터 범위 및 전송 파라미터 범위에 대응하는 임계값의 설정 방식에 대해서는 전 술한 단말에 대한 액세스 네트워크 디바이스에 의해서 제 1 임계값을 설정하는 방식을 참조한다. 자세한 내용은 다시 설명하지 않는다. 제 4 임계값은 전술한 적어도 하나의 임계값에 포함될 수 있으며, 제 1 CG 리소스에 대 응하는 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 범위에 속한다. 예를 들어, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한 이후에, 채널 품질을, 액세스 네트워크 디바이스에 의해 설정된 전송 파라미터 범위에 대응하는 임계값과 비교해서, 채널 품질이, 적어도 하 나의 전송 리소스 그룹에 대응하는 임계값 중 어느 임계값보다 큰지를 결정하고, 이들 임계값 중 가장 큰 임계 값(예를 들어, 제 4 임계값)에 대응하는 전송 파라미터 범위 내의 임의의 전송 파라미터에 대응하는 CG 리소스 (예를 들어, 제 1 CG 리소스)을 이용해서 업링크 데이터를 송신하거나, 혹은 결정된 임계값 중 어느 하나에 대 응하는 전송 파라미터 범위 내의 임의의 전송 파라미터에 대응하는 CG 리소스를 이용해서 업링크 데이터를 송신 한다. 이것은 제한되지 않는다. 구체적으로, 이 구현에 대해서는 전술한 방식 에서의 설명을 참조한다. 자세한 내용은 다시 설명하지 않는다. CG 방식은 적어도 하나의 CG 리소스에 대응할 수 있다. 적어도 하나의 CG 리소스는 제 1 CG 리소스를 포함 한다. 적어도 하나의 CG 리소스는 적어도 하나의 전송 파라미터 임계값에 대응한다. 하나의 전송 파라미터 임계 값은 하나의 채널 품질 임계값(본 출원에서 간략하게 임계값이라 함)에 대응한다. 각각의 CG 리소스에 대응하는 전송 파라미터 임계값에 대응하는 임계값은, 단말이 CG 리소스를 선택할지 여부를 결정하는데 사용된다. 채널 품질이 CG 리소스에 대응하는 전송 파라미터 임계값에 대응하는 임계값보다 큰 경우, 업링크 데이터는 CG 방식 으로 송신되지 않는다. 그렇지 않고, 채널 품질이, 모든 CG 리소스에 대응하는 전송 파라미터 임계값에 대응하 는 임계값보다 작은 경우, 업링크 데이터를 송신하는 데 CG 방식은 선택되지 않고, 업링크 데이터는 랜덤 액세 스 방식으로 송신된다. 전송 파라미터, 전송 파라미터 임계값 및 전송 파라미터 임계값에 대응하는 채널 품질 임계값은, 단말에 대해서 액세스 네트워크 디바이스에 의해 설정될 수 있다. 설정 방식에 대해서는, 단말에 대해서 액세스 네트워크 디바 이스에 의해 제 1 임계값을 설정하는 전술한 방식을 참조한다. 자세한 내용은 다시 설명하지 않는다. 제 4 임계 값은 적어도 하나의 전송 파라미터 임계값에 대응하는 적어도 하나의 임계값에 포함될 수 있다. 예를 들어, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득한 이후에, 채널 품질을 액세스 네트워크 디바이스에 의해 설정된 전송 파라미터 임계값에 대응하는 임계값과 비교해서, 채널 품질이, 적어도 하나의 전송 파라미터 임계값에 대응하는 임계값 중 어느 임계값보다 큰지를 결정하고, 이들 임계값 중 가장 큰 임계값(예를 들어, 제 4 임계값)에 대응하는 전송 파라미터 임계값에 대응하는 CG 리소스(예를 들어, 제 1 CG 리소스)를 이용해서 업링크 데이터를 송신하거나, 혹은 결정된 임계값 중 어느 하나에 대응하는 전송 파라미터 임계값에 대응하는 CG 리소스를 이용해서 업링크 데이터를 송신한다. 이것은 제한되지 않는다. 구체적으로, 이 구현예에 대해서는, 전술한 방식 에서의 설명을 참조한다. 자세한 내용은 다시 설명하지 않 는다. 또한, 단말이 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정한 이후에, 단말은 4-스텝 랜 덤 액세스 방식으로 랜덤 액세스를 개시하고, Msg2를 수신한 후, 액세스 네트워크 디바이스에 의해 송신되는 Msg2에 포함된 설정 정보에 의해 표시된 전송 리소스로, 업링크 데이터를 전달할 Msg3를 송신할 수 있다. 이하에서는 도 5a를 참조하여, 단말이 제 1 임계값, 제 2 임계값 및 제 5 임계값에 기초해서, 단말이 CG를 지원 하지 않고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스 그룹을설정하는 예를 이용해서, 도 4에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것을 설명 한다. 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질을 제 1 임계값과 비교한다. 채널 품질이 제 1 임계값보다 큰 경우, 단말은 업링크 데이터를 랜덤 액세스 방식으로 송신하는 것으로 결정한 다. 채널 품질이 제 1 임계값보다 작은 경우, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이터를 송신하지 않는 것으로 결정하고, 즉 랜덤 액세스 방식에 대응하는 PUSCH 리소스를 이용해서 업링크 데이터를 송 신하지 않는 것으로 결정한다. 도 5a에 도시된 바와 같이, 단말이 랜덤 액세스 방식으로 업링크 데이터를 송신 하는 것으로 결정하는 것은: 채널 품질을 제 2 임계값과 비교하는 것; 채널 품질이 제 2 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정하는 것, 예를 들어, 2-스텝 랜덤 액세스 방식으로 MsgA에 대응하는 PUSCH를 통해 업링크 데이터를 송신하는 것; 또는 채널 품질이 제 2 임계값보다 작은 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하는 것을 포함한다. 도 5a에 도시된 바와 같이, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이터를 송신하지 않는 것으 로 결정한 이후에, 채널 품질을 제 5 임계값과 비교한다. 채널 품질이 제 5 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 그렇지 않고, 채널 품질이 제 5 임계값보다 작 은 경우, 단말은 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 이하에서는 도 5b를 참조하여, 단말이 제 1 임계값, 제 2 임계값 및 제 5 임계값에 기초해서, 단말이 CG를 지원 하고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스 그룹을 설정 하는 예를 이용해서, 도 4에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것을 설명한다. 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질을 제 1 임계값과 비교한다. 채널 품질이 제 1 임계값보다 크면, 단말은 랜덤 액세스 방식 또는 CG 방식으로 업링크 데이터를 송신하는 것으 로 결정하고, 채널 품질이 제 1 임계값보다 작으면, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이 터를 송신하지 않는 것으로 결정한다. 도 5b에 도시된 바와 같이, 단말이 랜덤 액세스 방식 또는 CG 방식으로 업링크 데이터를 송신하는 것으로 결정하는 것은, TA가 유효한지 여부를 체크하는 것; TA가 유효하다면, CG 방 식으로 업링크 데이터를 송신하는 것으로 결정하는 것; 또는 TA가 유효하지 않다면, 채널 품질을 제 2 임계값과 비교하고, 채널 품질이 제 2 임계값보다 크다면, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하는 것으 로, 예를 들어, 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서 MsgA를 송신하는 것으로 결정하는 것 - 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함함 - ; 및 TA가 유효하지 않고, 채널 품질이 제 2 임계값보다 작다면, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정하는 것을 포함한다. 도 5b에 도시된 바와 같이, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이터를 송신하지 않는 것으 로 결정한 이후에, 채널 품질을 제 5 임계값과 비교한다. 채널 품질이 제 5 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 그렇지 않고, 채널 품질이 제 5 임계값보다 작 은 경우, 단말은 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 단말이 CG 방식으로 업링크 데이터를 송신하는 프로세스에 대해서는 전술한 설명을 참고한다. 자세한 내용은 다 시 설명하지 않는다. 이하에서는 도 5c를 참조하여, 단말이 제 1 임계값, 제 3 임계값 및 제 5 임계값에 기초해서, 단말이 CG를 지원 하지 않고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 복수의 전송 리소스 그룹을 설정하는 예를 이용해서, 도 4에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것 을 설명하며, 복수의 전송 리소스 그룹에 대응하는 설정 정보는 단말이 전송 리소스를 선택할지 여부를 결정하 는데 사용하는 임계값을 포함한다. 복수의 전송 리소스 그룹이 전송 파라미터 범위에 대응되는 것, 전송 파라미 터 범위가 임계값에 대응되는 것, 또는 복수의 전송 리소스 그룹이 전송 파라미터 임계값에 대응하는 경우에 대 해서는 도 5c를 참조한다는 점에 주의한다. 도 5c에 도시된 바와 같이, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질 을 제 1 임계값과 비교한다. 채널 품질이 제 1 임계값보다 큰 경우, 단말은 랜덤 액세스 방식으로 업링크 데이 터를 송신하는 것으로 결정하고, 채널 품질이 제 1 임계값보다 작은 경우, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이터를 송신하지 않는 것으로 결정한다. 도 5c에 도시된 바와 같이, 단말이 랜덤 액세스 방식으로 업링크 데이터를 송신하는 것으로 결정하는 것은, 채널 품질을 적어도 하나의 전송 파라미터 각각에 대 응하는 설정 정보에 포함된 임계값과 비교하는 것; 채널 품질이 이들 임계값 중 제 3 임계값보다 큰 경우, 제 3 임계값을 포함하는 설정 정보에 대응하는 제 1 전송 리소스에 기초해서 MsgA를 송신하는 것으로 결정하는 것 - MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함함 - ; 또는 채널 품질이 적어도 하나의 전송 파라 미터에 대응하는 설정 정보에 포함된 임계값 중 최소 임계값보다 작은 경우, 업링크 데이터를 4-스텝 랜덤 액세 스 방식으로 송신하는 것으로 결정하는 것을 포함한다. 도 5c에 도시된 바와 같이, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이터를 송신하지 않는 것으 로 결정한 이후에, 채널 품질을 제 5 임계값과 비교한다. 채널 품질이 제 5 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 그렇지 않고, 채널 품질이 제 5 임계값보다 작 은 경우, 단말은 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 이하에서는 도 5d를 참조하여, 제 1 임계값, 제 3 임계값 및 제 5 임계값에 기초해서, 단말이 CG를 지원하고 액 세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 복수의 전송 리소스 그룹을 설정 하는 예를 이용해서, 도 4에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을, 단말이 선택하는 것을 설명하며, 복수의 전송 리소스 그룹에 대응하는 설정 정보는 단말이 전송 리소스를 선택할지 여부를 결정하는데 사용하는 임계값을 포함한다. 복수의 전송 리소스 그룹이 전송 파라미터 범위에 대응되는 것, 전송 파라미터 범 위가 임계값에 대응되는 것, 또는 복수의 전송 리소스 그룹이 전송 파라미터 임계값에 대응하는 경우에 대해서 는 도 5d를 참조한다는 점에 주의한다. 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질을 제 1 임계값과 비교한다. 채널 품질이 제 1 임계값보다 큰 경우, 단말은 랜덤 액세스 방식 또는 CG 방식으로 업링크 데이터를 송신하는 것으로 결정하고, 채널 품질이 제 1 임계값보다 작은 경우, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링 크 데이터를 송신하지 않는 것으로 결정한다. 도 5d에 도시된 바와 같이, 단말이 랜덤 액세스 방식 또는 CG 방 식으로 업링크 데이터를 송신하는 것으로 결정하는 것은: TA가 유효한지 여부를 체크하는 것; TA가 유효하다면, CG 방식으로 업링크 데이터를 송신하는 것으로 결정하는 것; 또는 TA가 유효하지 않다면, 채널 품질을 적어도 하나의 전송 파라미터 각각에 대응하는 설정 정보에 포함된 임계값과 비교하는 것; 채널 품질이 이들 임계값 중 제 3 임계값보다 큰 경우, 제 3 임계값을 포함하는 설정 정보에 대응하는 제 1 전송 리소스에 기초해서 MsgA를 송신하는 것으로 결정하는 것 - MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함함 - ; 및 TA가 유 효하지 않고, 채널 품질이 적어도 하나의 전송 파라미터에 대응하는 설정 정보에 포함된 임계값 중 가장 작은 임계값보다 작은 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정하는 것을 포함한다. 도 5d에 도시된 바와 같이, 단말은 비접속 상태에서 랜덤 액세스 방식으로 업링크 데이터를 송신하지 않는 것으 로 결정한 이후에, 채널 품질을 제 5 임계값과 비교한다. 채널 품질이 제 5 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 그렇지 않고, 채널 품질이 제 5 임계값보다 작 은 경우, 단말은 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하는 것으로 결정한다. 단말이 CG 방식으로 업링크 데이터를 송신하는 프로세스에 대해서는, 전술한 설명을 참고한다. 자세한 내용은 다시 설명하지 않는다. 도 4 내지 도 5d는, 본 출원의 실시예에서 제공되는 데이터 전송 방법을, 제 1 임계값이 단말이 업링크 데이터 를 랜덤 액세스 방식으로 송신할지 여부를 선택하도록 구성되고, 제 2 임계값이 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신할지 또는 4-스텝 랜덤 액세스 방식으로 송신할지 여부를 선택하도록 구성되는 예를 이용해서 설명한다. 다른 방안으로, 본 출원에서는, 단말이 2-스텝 랜덤 액세스 리소스 또는 4-스텝 랜덤 액세 스 리소스를 사용하는데 사용될는 임계값이 먼저 설정된 이후에, 2개의 임계값이 설정할 수 있다. 2개의 임계값 중 하나는 단말이 2-스텝 랜덤 액세스 리소스에 기초해서 업링크 데이터를 송신할지 또는 랜덤 액세스를 개시할 지 여부를 결정하는 데 사용되고, 다른 임계값은 단말이 4-스텝 랜덤 액세스 리소스에 기초해서 업링크 데이터 를 송신할지 또는 랜덤 액세스를 개시할지 여부를 결정하는 데 사용된다. 구체적으로, 이와 같은 방식에 대해서 는 다음 도 6을 참조한다. 도 6은 본 출원의 일 실시예에 따른 다른 데이터 전송 방법의 흐름도이다. 도 6에 도시된 바와 같이, 방법은 다 음 단계를 포함할 수 있다. 단계 601: 단말이, 단말과 액세스 네트워크 디바이스 사이의 채널의 품질을 획득한다. 구체적으로, 단계 601에 대해서는 단계 401을 참조한다. 자세한 내용은 다시 설명하지 않는다. 단계 602: 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. 제 6 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 사전 설정될 수 있다. 제 6 임계값의 설정 방식 은 단말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명하지 않는다. 제 6 임계값은 단말이 2-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택하거나(예를 들어, 2-스텝 랜덤 액세스 리소스를 사용해서 랜덤 액세스를 개시할지 업링크 데이터를 송신할지 선택) 또는 4-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택(예를 들어, 4-스텝 랜덤 액세스 리소스를 사용해서 랜덤 액세스를 개시할지 업링크 데이터를 송신할지 선택)할 수 있다. 제 7 임계값은 단말에 대해 액세스 네트워크 디바이스에 의해 사전 설정될 수 있다. 제 6 임계값의 설정 방식은 단말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명 하지 않는다. 제 7 임계값은 제 6 임계값보다 클수도 있고, 혹은 제 6 임계값보다 작거나 같을 수 있다. 이것은 제한되지 않는다. 제 7 임계값은 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신할지 또는 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시할지 선택하는 데 사용될 수 있다. 예를 들어, 채널 품질이 제 6 임계 값보다 큰 경우, 단말은 채널 품질을 제 7 임계값과 비교한다. 채널 품질이 제 7 임계값보다 큰 경우, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정한다. 채널 품질이 제 7 임계값보다 작은 경우, 단말은 비접속 상태에서 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하지 않고, 2-스텝 랜덤 액세 스 방식으로 랜덤 액세스를 개시하여 액세스 네트워크 디바이스에 대응하는 셀에 액세스하는 것으로 결정한다. 단말이 CG를 지원하는 경우, TA가 유효하다면, 시그널링 오버헤드를 줄이기 위해서, 단말은 2-step 랜덤 액세스 방식보다 더 우선적인 CG 방식으로 업링크 데이터를 송신할 수 있다. 예를 들어, 채널 품질이 제 6 임계값보다 큰 경우, 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하기 전에, 단말은 TA가 유효한지 여부를 판단한다. TA가 무효인 경우, 단말은 채널 품질을 제 7 임계값과 비교하고, 비교 결과에 기초해서 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송 신하는 것으로 결정한다. TA가 유효하면, 단말은 CG 방식으로 업링크 데이터를 액세스 네트워크 디바이스에 송 신하는 것으로 결정한다. TA의 관련 설명 및 TA가 유효하지 않은지 여부를 결정하는 방법에 대해서는 단계 402에서의 설명을 참조한다. 자세한 내용은 다시 설명하지 않는다. 또한, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정 한 이후에, 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서 MsgA를 송신할 수 있다. MsgA는 프리 앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 구체적으로, 단말이 2-스텝 랜덤 액세스 방식에 대응하는 하나 이상의 전송 리소스 그룹 중에서 적절한 전송 리소스를 선택해서 업링크 데이터를 송신하는 프로세스에 대 해서는 전술한 설명을 참조한다. 자세한 내용은 다시 설명하지 않는다. 또한, 단말은 CG 방식으로 업링크 데이터를 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이후에, CG 방 식에 대응하는 CG 리소스에 기초해서 업링크 데이터를 송신한다. 단말이 CG 방식에 대응하는 하나 이상의 CG 리 소스 중에서 CG 리소스를 선택하여 업링크 데이터를 송신하는 과정에 대해서는 전술한 설명을 참조한다. 자세한 내용은 다시 설명하지 않는다. 단계 603: 채널 품질이 제 6 임계값보다 작은 경우, 채널 품질이 제 8 임계값보다 크다면, 단말은 업링크 데이 터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 선택하고; 혹은 채널 품질이 제 8 임계값보다 작다면, 단말은 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시해서 액세스 네트워크 디바이 스에 대응하는 셀에 액세스하도록 선택한다. 제 8 임계값은 단말에 대해 액세스 네트워크 디바이스에 의해 사전 설정될 수 있다. 제 6 임계값의 설정 방식은 단말에 대해서 액세스 네트워크 디바이스가 제 1 임계값을 설정하는 방식과 동일하다. 자세한 내용은 다시 설명 하지 않는다. 제 8 임계값은 제 6 임계값보다 클 수고 있고, 제 6 임계값보다 작거나 같을 수도 있다. 이것은 제한되지 않는다. 제 8 임계값은 단말이 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신할지 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시할지 선택하는데, 사용될 수 있다. 도 4에 도시된 방법에 따르면, 단말은 제 6 임계값, 제 8 임계값, 제 7 임계값에 기초해서 업링크 데이터를 송 신하는 방식을 적절히 선택할 수 있다. 이는 업링크 데이터의 전송 효율을 향상시키고, 선택된 송신 방식에 대 응하는 채널 품질이 좋지 않아서 업링크 데이터 송신이 실패하여 리소스 낭비가 발생되는 문제를 방지한다. 이하에서는 도 7a를 참조하여, 단말이 제 6 임계값, 제 8 임계값 및 제 7 임계값에 기초해서, 단말이 CG를 지원 하지 않고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스 그룹을 설정하는 예를 이용해서, 도 6에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것을 설명 한다. 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질을 제 6 임계값과 비교한다. 채널 품질이 제 6 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택하고, 채널 품질이 제 6 임계값보다 작은 경우, 단말은 4-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택한다. 도 7a에 도시된 바와 같이, 2-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택한 후, 단말은 채널 품질을 제 7 임계값 과 비교한다. 채널 품질이 제 7 임계값보다 큰 경우, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액 세스 네트워크 디바이스에 송신하는 것으로 결정하고, 예를 들어, 2-스텝 랜덤 액세스 방식에 대응하는 전송 리 소스에 기초해서 MsgA를 송신하며, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 그 렇지 않고, 채널 품질이 제 7 임계값보다 작은 경우, 단말은 업링크 데이터를 비접속 상태에서 2-스텝 랜덤 액 세스 방식으로 송신하지 않고, 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하여 셀에 액세스하는 것으로 결정한다. 도 7a에 도시된 바와 같이, 단말은 4-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택한 후, 채널 품질을 제 8 임계값과 비교한다. 채널 품질이 제 8 임계값보다 큰 경우, 단말은 업링크 데이터를 4-스텝 랜덤 액세스 방식으 로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고, 예를 들어 4-스텝 랜덤 액세스 방식에 대응하는 전 송 리소스에 기초해서 Msg3를 이용해서 업링크 데이터를 송신한다. 그렇지 않고, 채널 품질이 제 8 임계값보다 작은 경우, 단말은 업링크 데이터를 비접속 상태에서 4-스텝 랜덤 액세스 방식으로 송신하지 않고, 4-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시하여 셀에 액세스하는 것으로 결정한다. 이하에서는 도 7b를 참조하여, 단말이 제 6 임계값, 제 8 임계값 및 제 7 임계값에 기초해서, 단말이 CG를 지원 하고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 전송 리소스 그룹을 설정 하는 예를 이용해서, 도 6에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것을 설명한다. 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질을 제 6 임계값과 비교한다. 채널 품질이 제 6 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 리소스를 선택해서 랜덤 액세스를 개시하거 나 업링크 데이터를 송신하고, 또는 CG 리소스를 선택해서 업링크 데이터를 송신하는 것으로 결정한다. 채널 품 질이 제 6 임계값보다 작은 경우, 단말은 4-스텝 랜덤 액세스 리소스를 선택해서 랜덤 액세스를 개시하거나 업 링크 데이터를 송신하는 것으로 결정한다. 예를 들어, 도 7b에 도시된 바와 같이, 채널 품질이 제 6 임계값보다 큰 경우, 단말은 TA가 유효한지 체크한다. TA가 유효하다면, 단말은 CG 방식으로 업링크 데이터를 송신하는 것으로 결정한다. TA가 유효하지 않다면, 단말은 채널 품질을 제 7 임계값과 비교한다. 채널 품질이 제 7 임계값 보다 큰 경우, 단말은 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정하고, 예를 들어, 2- 스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서 MsgA를 송신하며, 여기서 MsgA는 프리앰블 및 업링 크 데이터를 전달하는 PUSCH를 포함한다. 그렇지 않고, 채널 품질이 제 7 임계값보다 작다면, 단말은 업링크 데 이터를 비접속 상태에서 2-스텝 랜덤 액세스 방식으로 송신하지 않고, 2-스텝 랜덤 액세스 방식으로 랜덤 액세 스를 개시하여 셀에 액세스하는 것으로 결정한다. 도 7b에 도시된 바와 같이, 단말은 4-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택한 후, 채널 품질을 제 8 임계값과 비교한다. 채널 품질이 제 8 임계값보다 큰 경우, 단말은 업링크 데이터를 4-스텝 랜덤 액세스 방식으 로 송신하는 것으로 결정하고, 예를 들어, 4-스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서 Msg3를 이용해서 업링크 데이터를 송신한다. 그렇지 않고, 채널 품질이 제 8 임계값보다 작은 경우, 단말은 비접속 상 태에서 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하지 않고, 4-스텝 랜덤 액세스 방식으로 랜덤 액세 스를 개시하여 셀에 액세스하는 것으로 결정한다. 단말이 CG 방식으로 업링크 데이터를 송신하는 과정에 대해서는 전술한 설명을 참고한다. 자세한 내용은 다시 설명하지 않는다. 이하에서는 도 7c를 참조하여, 단말이 제 6 임계값, 제 3 임계값 및 제 8 임계값에 기초해서, 단말이 CG를 지원 하지 않고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 복수의 전송 리소스 그룹을 설정하는 예를 이용해서, 도 6에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것 을 설명하며, 복수의 전송 리소스 그룹에 대응하는 설정 정보는 단말이 전송 리소스를 선택할지 여부를 결정하 는데 사용하는 임계값을 포함한다. 복수의 전송 리소스 그룹이 전송 파라미터 범위에 대응되고, 전송 파라미터 범위가 임계값에 대응되며, 복수의 전송 리소스 그룹이 전송 파라미터 임계값에 대응하는 경우에 대해서는 도 7c를 참조한다는 점에 주의한다. 도 7c에 도시된 바와 같이, 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질 을 제 6 임계값과 비교한다. 채널 품질이 제 6 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 리소스를 선택 해서 랜덤 액세스를 개시할지 업링크 데이터를 송신할지 결정한다. 채널 품질이 제 6 임계값보다 작은 경우, 단 말은 4-스텝 랜덤 액세스 리소스를 선택해서 랜덤 액세스를 개시할지 업링크 데이터를 송신할지 결정한다. 예를 들어, 도 7c에 도시된 바와 같이, 채널 품질이 제 6 임계값보다 큰 경우, 단말은 채널 품질을 적어도 하나의 전 송 파라미터 그룹 각각에 대응하는 설정 정보에 포함된 임계값과 비교한다. 채널 품질이 이들 임계값 중 제 3 임계값보다 큰 경우, 단말은 제 3 임계값을 포함하는 설정 정보에 대응하는 제 1 전송 리소스에 기초해서 MsgA 를 송신하는 것으로 결정하며, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 그렇지 않고, 채널 품질이, 모든 전송 파라미터에 대응하는 설정 정보에 포함된 임계값 중 가장 작은 임계값보다 작은 경우, 단말은 비접속 상태에서 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하지 않고, 2-스텝 랜덤 액세 스 방식으로 랜덤 액세스를 개시해서 셀에 액세스하는 것으로 결정한다. 도 7c에 도시된 바와 같이, 단말은, 4-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택한 후, 채널 품질을 제 8 임계값과 비교한다. 채널 품질이 제 8 임계값보다 큰 경우, 단말은 업링크 데이터를 4-스텝 랜덤 액세스 방식 으로 송신하는 것으로 결정하고, 예를 들어, 4-스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서 Msg3 를 이용해서 업링크 데이터를 송신하는 것으로 결정한다. 그렇지 않고, 채널 품질이 제 8 임계값보다 작은 경우, 단말은 비접속 상태에서 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하지 않고, 4-스텝 랜덤 액세 스 방식으로 랜덤 액세스를 개시하여 셀에 액세스하는 것으로 결정한다. 구체적으로, 제 3 임계값에 기초해서 단말에 의해 전송 리소스를 선택하는 방법에 대해서는 도 4의 설명을 참조 한다. 자세한 내용은 다시 설명하지 않는다. 이하에서는 도 7d를 참조하여, 단말이 제 6 임계값, 제 3 임계값 및 제 8 임계값에 기초해서, 단말이 CG를 지원 하고 액세스 네트워크 디바이스가 단말에 대해서 2-스텝 랜덤 액세스 방식에 대응하는 복수의 전송 리소스 그룹 을 설정하는 예를 이용해서, 도 6에 도시된 방법으로 업링크 데이터를 송신하는 적절한 방식을 선택하는 것을 설명하며, 복수의 전송 리소스 그룹에 대응하는 설정 정보는 단말이 전송 리소스를 선택할지 여부를 결정하는데 사용하는 임계값을 포함한다. 복수의 전송 리소스 그룹이 전송 파라미터 범위에 대응되는 것, 전송 파라미터 범 위가 임계값에 대응되는 것, 복수의 전송 리소스 그룹이 전송 파라미터 임계값에 대응하는 경우에 대해서는 도 7d를 참조한다는 점에 주의한다. 단말은 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하고, 채널 품질을 제 6 임계값과 비교한다. 채널 품질이 제 6 임계값보다 큰 경우, 단말은 2-스텝 랜덤 액세스 리소스를 선택해서 랜덤 액세스를 개시하거 나 업링크 데이터를 송신하고, 또는 CG 리소스를 선택해서 업링크 데이터를 송신하는 것으로 결정한다. 채널 품 질이 제 6 임계값보다 작은 경우, 단말은 4-스텝 랜덤 액세스 리소스를 선택해서 랜덤 액세스를 개시하거나 업 링크 데이터를 송신하는 것으로 결정한다. 예를 들어, 도 7d에 도시된 바와 같이, 채널 품질이 제 6 임계값보다 큰 경우, 단말은 TA가 유효한지 체크한다. TA가 유효하다면, 단말은 CG 방식으로 업링크 데이터를 송신하는 것으로 결정한다. TA가 유효하지 않다면, 단말은 채널 품질을 적어도 하나의 전송 파라미터 그룹 각각에 대응하는 설정 정보에 포함된 임계값과 비교한다. 채널 품질이 이들 임계값 중 제 3 임계값보다 큰 경우, 단말은 제 3 임 계값을 포함하는 설정 정보에 대응하는 제 1 전송 리소스에 기초해서 MsgA를 송신하는 것으로 결정하며, 여기서 MsgA는 프리앰블 및 업링크 데이터를 전달하는 PUSCH를 포함한다. 그렇지 않고, 채널 품질이, 모든 전송 파라미 터에 대응하는 설정 정보에 포함된 임계값 중 가장 작은 임계값보다 작은 경우, 단말은 비접속 상태에서 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 송신하지 않고, 2-스텝 랜덤 액세스 방식으로 랜덤 액세스를 개시해서 셀에 액세스하는 것으로 결정한다. 도 7d에 도시된 바와 같이, 단말은 4-스텝 랜덤 액세스 리소스를 사용하는 것으로 선택한 이후에, 채널 품질을 제 8 임계값과 비교한다. 채널 품질이 제 8 임계값보다 큰 경우, 단말은 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정하고, 예를 들어 4-스텝 랜덤 액세스 방식에 대응하는 전송 리소스에 기초해서Msg3를 이용해서 업링크 데이터를 송신한다. 그렇지 않고, 채널 품질이 제 8 임계값보다 작은 경우, 단말은 비 접속 상태에서 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 송신하지 않고, 4-스텝 랜덤 액세스 방식으로 랜 덤 액세스를 개시하여 셀에 액세스하는 것으로 결정한다. 단말이 CG 방식으로 업링크 데이터를 송신하는 과정에 대해서는 전술한 설명을 참고한다. 자세한 내용은 다시 설명하지 않는다. 전술한 내용은 주로 노드들 사이의 상호 작용의 관점에서 본 출원의 실시예에서 제공되는 솔루션을 설명했다. 전술한 기능을 구현하기 위해, 노드, 예를 들면, 단말 및 액세스 네트워크 디바이스는, 기능을 수행하기 위한 대응하는 하드웨어 구조 및/또는 소프트웨어 모듈을 포함한다는 것을 이해할 수 있다. 당업자는, 본 출원에 개 시된 실시예에 설명된 예과 조합하여, 알고리즘 단계이 하드웨어 또는 하드웨어와 컴퓨터 소프트웨어의 조합에 의해 구현될 수도 있다는 것을 쉽게 이해할 것이다. 기능이 하드웨어에 의해 수행될지 또는 컴퓨터 소프트웨어 에 의해 구동되는 하드웨어에 의해 수행될지 여부는 기술 솔루션의 특정 응용예 및 설계 제약 조건에 따라 달라 진다. 당업자는 각각의 특정 응용예에 대해 설명된 기능을 구현하는 데 다양한 방법을 사용할 수 있지만, 이 구 현이 본 출원의 범위를 벗어나는 것으로 간주되어서는 안 된다. 본 출원의 실시예에서, 단말, 액세스 네트워크 디바이스 등은 전술한 방법 예에 기초해서 기능 모듈들로 구분될 수 있다. 예를 들어, 각각의 기능 모듈은 각 기능에 기초한 분할을 통해 획득될 수도 있고, 2개 이상의 기능이 하나의 처리 모듈에 통합될 수 있다. 통합 모듈은 하드웨어의 형태로 구현될 수도 있고, 소프트웨어 기능 모듈 의 형태로 구현될 수도 있다. 이 출원의 실시예에서, 모듈 분할은 예시적인 것으로, 단지 논리적 기능 분할에 불과하다는 것을 주목해야 한다. 실제 구현에서, 다른 분할 방식이 사용될 수 있다. 도 8은 통신 장치의 구조도이다. 통신 장치는 단말, 칩 인 단말, 또는 시스템-온-칩일 수 있다. 통신 장치는 전술한 실시예에서 단말의 기능을 수행하도록 구성될 수 있다. 실현 가능한 구현예에서, 도 8에 도 시된 통신 장치는 수신 유닛 및 처리 유닛을 포함한다. 가능한 설계에서, 수신 유닛은 비접속 모드의 단말과 액세스 네트워크 디바이스 사이의 채널의 품질을 획 득하도록 구성된다. 예를 들면, 수신 유닛은 통신 장치가 단계 401 및 단계 601를 수행하는 것을 지원 할 수 있다. 처리 유닛은, 채널 품질이 제 1 임계값보다 큰 경우, 업링크 데이터를 랜덤 액세스 방식 또는 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고 - 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4- 스텝 랜덤 액세스 방식을 포함함 - ; 예를 들어, 채널 품질이 제 2 임계값보다 큰 경우, 업링크 데이터를 2-스 텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고; 또는 채널 품질이 제 2 임계 값보다 작은 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. 예를 들어, 처리 유닛은 통신 장치가 단계 402 및 단계 403을 수행하는 것을 지원할 수 있 다. 다른 가능한 설계에서, 수신 유닛은 단말과 액세스 네트워크 디바이스 사이의 채널의 품질을 획득하도록 구성된다. 예를 들면, 수신 유닛은 통신 장치가 단계 401 및 단계 601를 수행하는 것을 지원할 수 있 다. 처리 유닛은: 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하도록 결정하고; 또는 채널 품질이 제 6 임계값 보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워 크 디바이스에 송신하는 것으로 결정한다. 예를 들어, 처리 유닛은 통신 장치가 단계 602 및 단계 603 을 수행하는 것을 지원할 수 있다. 구체적으로, 도 4 내지 도 7d에 도시된 전술한 방법 실시예의 단계들의 모든 관련 내용은 대응하는 기능 모듈들 의 기능 설명에서 인용될 수 있다. 상세한 것은 본 명세서에서 다시 설명되지 않는다. 통신 장치는 도 4 내 지 도 7d에 도시된 방법에 도시된 데이터 전송 방식에서의 단말의 기능을 수행하도록 구성되고, 전술한 데이터 전송 방법과 동일한 효과를 얻을 수 있다. 다른 구현예에서, 도 8에 도시된 통신 장치는 처리 모듈 및 통신 모듈을 포함한다. 처리 모듈은 통신 장치 의 동작을 제어하고 관리하도록 구성된다. 예를 들어, 처리 모듈은 처리 유닛의 기능을 통합할 수 있 고, 통신 장치가 단계 401, 단계 601, 단계 602, 단계 603, 및 본 명세서에 설명된 기술의 다른 프로세스를 수행하는 것을 지원하도록 구성될 수 있다. 통신 모듈은 수신 유닛의 기능을 통합할 수도 있고, 통신 장치가 다른 네트워크 엔티티와의 통신을 수행하는 것을, 예를 들어 도 2에 도시된 기능 모듈 또는 네트워크 엔 티티와의 통신을 지원하도록 구성될 수 있다. 통신 장치는, 통신 장치의 프로그램 코드 및 데이터를 저 장하는 저장 모듈을 더 포함할 수도 있다. 처리 모듈은 프로세서 또는 컨트롤러일 수 있다. 프로세서는 본 출원에 개시된 컨텐츠와 관련하여 설명된 다양 한 예시적인 논리 블록, 모듈 및 회로를 구현하거나 실행할 수 있다. 다른 방안으로, 프로세서는 컴퓨팅 기능을 구현하는 프로세서들의 조합, 예를 들어, 하나 이상의 마이크로프로세서들의 조합일 수도 있고 혹은, DSP 및 마 이크로프로세서의 조합일 수도 있다. 통신 모듈은 송수신 회로, 통신 인터페이스 등일 수 있다. 저장 모듈은 메 모리일 수 있다. 처리 모듈이 프로세서이고, 통신 모듈이 통신 인터페이스이며, 저장 모듈이 메모리인 경우, 본 출원의 실시예에서 통신 장치는 도 3에 도시된 통신 장치일 수 있다. 도 9는 본 출원의 실시예에 따른 통신 시스템의 구조를 나타내는 도면이다. 도 9에 도시된 바와 같이, 통신 시 스템은 단말을 포함할 수 있으며, 액세스 네트워크 디바이스를 더 포함할 수 있다. 단말의 기능은 통신 장치의 기능과 동일하다. 일 예에서, 단말는, 비접속 상태의 단말와 액세스 네트워크 디바이스 사이의 채널의 품질을 획득하도록 구성되고; 및 채널 품질이 제 1 임계값보다 큰 경우, 업링크 데이터를 랜덤 액세스 방식 또는 CG 방식으로 액세 스 네트워크 디바이스에 송신하는 것으로 결정하고 - 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함함 - ; 예를 들어, 채널 품질이 제 2 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고; 또는 채널 품질이 제 2 임계값보다 작은 경우, 업링크 데이터를 액세스 네트워크 디바이스에 4-스텝 랜덤 액세스 방식으로 송신하는 것으로 결정한 다. 다른 예에서, 단말는, 단말와 액세스 네트워크 디바이스 사이의 채널의 품질을 획득하도록 구성되고; 및 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액 세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고; 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이 스에 송신하는 것으로 결정한다. 단말의 구체적인 실행 동작에 대해서는 도 4 내지 도 7d에 도시된 방법에서 단말의 관련 동작을 참조한다. 자세한 내용은 다시 설명하지 않는다. 본 출원의 실시예는 컴퓨터 판독 가능 저장 매체를 더 제공한다. 전술한 방법 실시예의 프로세스의 전부 또는 일부는 관련 하드웨어에 명령하는 컴퓨터 프로그램에 의해 구현될 수 있다. 프로그램은 컴퓨터 판독가능 저장 매체에 저장될 수 있다. 프로그램이 실행되면 전술한 방법 실시예의 프로세스가 포함될 수 있다. 컴퓨터 판독 가능 저장 매체는, 예를 들어, 전술한 실시예 중 어느 하나에서, 예를 들어, 단말의 하드 디스크 드라이브 또는 메모리에서 데이터 송신단 및/또는 데이터 수신단을 포함하는 단말의 내부 저장 유닛일 수 있다. 이와 달리, 컴 퓨터 판독 가능 저장 매체는 단말의 외부 저장 장치, 예를 들어, 단말에 구성되는 플러그인 하드 디스크, 스마 트 미디어 카드(smart media card, SMC), 보안 디지털(secure digital, SD) 카드, 플래시 카드(flash card) 등 일 수 있다. 또한, 컴퓨터 판독 가능 저장 매체는 이와 달리 단말의 내부 저장부와 외부 저장 디바이스를 모두 포함할 수 있다. 컴퓨터 판독 가능 저장 매체는 단말에 필요한 컴퓨터 프로그램 및 기타 프로그램 및 데이터를 저장하도록 구성된다. 컴퓨터 판독가능 저장 매체는 출력되었거나 출력될 데이터를 임시 저장하도록 더 설정될 수 있다. 전술한 설명을 참조하여, 본 출원은 이하의 실시예를 더 제공한다. 예 1 : 데이터 전송 방법이 제공된다. 이 방법은, 단말이, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하는 것 - 단말은 비접속 상태에 있음 - 과, 채널 품질이 제 1 임계값보다 큰 경우, 단말은, 업링크 데이터를 랜덤 액세스 방식으로 또는 설정된 승인 (configured grant(CG)) 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것 - 랜덤 액세스 방 식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함함 - 을 포함한다. 단말이, 업링크 데이터를 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 채널 품질이 제 2 임계값보다 큰 경우, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것, 또는 채널 품질이 제 2 임계값보다 작은 경우, 단말이, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워 크 디바이스에 송신하는 것으로 결정하는 것 을 포함한다. 실시예 2: 실시예 1의 방법에 따르면, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이후에, 방법은, 채널 품질이 제 3 임계값보다 큰 경우, 단말이, 2-스텝 랜덤 액세스 방식에 대응하는 제 1 전송 리소스에 기초 해서, MsgA로 액세스 네트워크 디바이스에 업링크 데이터를 송신하는 단계를 더 포함한다. 실시예 3: 실시예 2의 방법에 따르면, 제 1 전송 리소스에 대응하는 설정 정보는 제 3 임계값을 포함하거나; 또 는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또 는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 4: 실시예 1 내지 3 중 어느 하나의 방법에 따르면, 단말이, 업링크 데이터를 랜덤 액세스 방식으로 또 는 설정된 승인(CG) 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 단말이, 타이밍 어드밴스(TA)가 유효한지 여부를 결정하는 것 - TA는 단말과 액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용됨 - 과, TA가 유효하지 않은 경우, 단말이 업링크 데이터를 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것; 또는 TA가 유효한 경우, 단말이, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하 는 것 - CG 방식에 대응하는 CG 리소스는, 액세스 네트워크 디바이스에 의해 사전 설정되고 비접속 상태의 단말 에 의한 전송에 사용되는 물리 업링크 공유 채널(PUSCH) 리소스임 - 을 포함한다. 실시예 5: 실시예 1 내지 4 중 어느 하나의 방법에 따르면, 단말이, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이후에, 방법은, 채널 품질이 제 4 임계값보다 큰 경우, 단말이, 업링크 데이터를 제 1 CG 리소스에 기초해서 액세스 네트워크 디바이스에 송신하는 것을 더 포함한다. 실시예 6: 실시예 5의 방법에 따르면, 제 1 CG 리소스에 대응하는 설정 정보는 제 4 임계값을 포함하거나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 7: 실시예 3 또는 실시예 6에 따르면, 전송 파라미터는 변조 및 코딩 방식(modulation and coding scheme; MCS)과 전송 블록 속도(transport block speed; TBS) 중 하나 이상을 포함한다. 실시예 8: 실시예 4 내지 실시예 7 중 어느 하나의 방법에 따르면, TA가 유효하지 않은 것은, TA의 유효 기간이 만료된 것과; 단말의 현재 위치와 TA가 시작될 때 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과; 채널 품질과, TA가 시작될 때 달성되는 단말과 액세스 네트워크 디바이스 사이의 채널의 품질 사이의 차이가 채 널 품질 변경 임계값보다 큰 것중 하나 이상을 포함한다. 실시예 9: 실시예 1 내지 실시예 8 중 어느 하나의 방법에 따르면, 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 큰 경우, 단말은, 업링크 데이터를 비접속 상 태의 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으 로 결정하는 것, 또는 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 작은 경우, 단말이, 업링크 데이터를 비접속 상태의 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 것 을 포함한다. 실시예 10: 실시예 1 내지 실시예 9 중 어느 하나의 방법에 따르면, 제 1 임계값, 제 2 임계값 및 제 3 임계값 은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정된다. 실시예 11: 데이터 전송 방법이 제공된다. 이 방법은, 단말이, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하는 것 - 단말은 비접속 상태에 있음 - 과, 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 단말이, 업링크 데이터를 2-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것; 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 단말이, 업링크 데이터를 4-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것을 포함한다. 실시예 12: 실시예 11의 방법에 따르면, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 단말이, 타이밍 어드밴스(TA)가 유효한지 여부를 결정하는 것 - TA는 단말과 액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용됨 - 와, TA가 유효하지 않은 경우, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것 을 포함한다. 실시예 13: 실시예 12의 방법에 따르면, TA가 유효한 경우, 단말이, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하 는 것 - CG 방식에 대응하는 CG 리소스는, 액세스 네트워크 디바이스에 의해 사전 설정되고 비접속 상태의 단말 에 의한 전송에 사용되는 물리 업링크 공유 채널(PUSCH) 리소스임 - 을 더 포함한다. 실시예 14: 실시예 11 내지 실시예 13 중 어느 하나의 방법에 따르면, 단말이, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이 후에, 방법은, 채널 품질이 제 3 임계값보다 큰 경우, 단말이, 2-스텝 랜덤 액세스 방식에 대응하는 제 1 전송 리소스에 기초 해서, MsgA로 액세스 네트워크 디바이스에 업링크 데이터를 송신하는 것을 더 포함한다. 실시예 15: 실시예 14의 방법에 따르면, 제 1 전송 리소스에 대응하는 설정 정보는 제 3 임계값을 포함하거나; 또는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또 는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 16: 실시예 13 내지 실시예 15 중 어느 하나의 방법에 따르면, 단말이, 업링크 데이터를 CG 방식으로 액 세스 네트워크 디바이스에 송신하는 것으로 결정한 후에, 방법은, 채널 품질이 제 4 임계값보다 큰 경우, 단말이, 제 1 CG 리소스에 기초해서 액세스 네트워크 디바이스에 업링크 데이터를 송신하는 것을 더 포함한다. 실시예 17: 실시예 16의 방법에 따르면, 제 1 CG 리소스에 대응하는 설정 정보는 제 4 임계값을 포함하거나; 또 는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 18: 실시예 15 또는 실시예 17의 방법에 따르면, 전송 파라미터는 변조 및 코딩 방식(MCS)과 전송 블록 속도(TBS) 중 하나 이상을 포함한다. 실시예 19: 실시예 12 내지 실시예 18 중 어느 하나의 방법에 따르면, TA가 유효하지 않은 것은, TA의 유효 기간이 만료된 것과; 단말의 현재 위치와 TA가 시작될 때 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과; 채널 품질과, TA가 시작될 때 달성되는 단말과 액세스 네트워크 디바이스 사이의 채널의 품질 사이의 차이가 채 널 품질 변경 임계값보다 큰 것 중 하나 이상을 포함한다. 실시예 20: 실시예 11 내지 실시예 19 중 어느 하나의 방법에 따르면, 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 작은 경우, 단말이, 업링크 데이터를 비접속 상태의 액세스 네트워크 디바이스에 송신 하는 것은 스킵하고, 2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 것, 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 작은 경우, 단말이, 업링크 데이터를 비접속 상태의 액세스 네트워크 디바이스에 송신하는 것은 스킵하고, 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하는 것 을 더 포함한다. 실시예 21: 실시예 11 내지 실시예 20 중 어느 하나의 방법에 따르면, 제 6 임계값, 제 7 임계값 및 제 8 임계 값은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정된다. 실시예 22: 통신 장치가 제공된다. 통신 장치는, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하도록 구성된 수신 유닛 - 단말은 비접속 상태에 있 음 - 과, 채널 품질이 제 1 임계값보다 큰 경우, 업링크 데이터를 랜덤 액세스 방식으로 또는 설정된 승인(CG) 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하도록 구성되는 처리 유닛 - 랜덤 액세스 방식은 2-스텝 랜 덤 액세스 방식 또는 4-스텝 랜덤 액세스 방식을 포함함 - 을 포함한다. 처리 유닛이 업링크 데이터를 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하도록 구성되는 것은, 채널 품질이 제 2 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이 스에 송신하는 것으로 결정하는 것, 또는 채널 품질이 제 2 임계값보다 작은 경우, 업링크 데이터를 4-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것을 포함한다. 실시예 23: 실시예 22의 통신 장치에 따르면, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이후에, 처리 유닛은, 채널 품질이 제 3 임계값보다 큰 경우, 2-스텝 랜덤 액세스 방식에 대응하는 제 1 전송 리소스에 기초해서, MsgA로 액세스 네트워크 디바이스에 업링크 데이터를 송신하도록 더 구성된다. 실시예 23: 실시예 24의 통신 장치에 따르면, 제 1 전송 리소스에 대응하는 설정 정보는 제 3 임계값을 포함하 거나; 또는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또 는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 25: 실시예 22 내지 실시예 24 중 어느 하나의 통신 장치에 따르면, 통신 유닛은 업링크 데이터를 랜덤 액세스 방식으로 또는 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 타이밍 어드밴스(TA)가 유효한지 여부를 결정하는 것 - TA는 단말과 액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용됨 - 과, TA가 유효하지 않은 경우, 단말이 업링크 데이터를 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것; 또는 TA가 유효한 경우, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것 - CG 방식에 대응하는 CG 리소스는, 액세스 네트워크 디바이스에 의해 사전 설정되고 비접속 상태의 단말에 의한 전송에 사용되는 물리 업링크 공유 채널(PUSCH) 리소스임 - 을 포함한다. 실시예 26: 실시예 22 내지 실시예 26 중 어느 하나의 통신 장치에 따르면, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이후에, 처리 유닛은, 채널 품질이 제 4 임계값보다 큰 경우, 업링크 데이터를 제 1 CG 리소스에 기초해서 액세스 네트워크 디바이스 에 송신하도록 더 구성된다. 실시예 27: 실시예 26의 통신 장치에 따르면, 제 1 CG 리소스에 대응하는 설정 정보는 제 4 임계값을 포함하거나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 28: 실시예 24 또는 실시예 27의 통신 장치에 따르면, 전송 파라미터는 변조 및 코딩 방식(modulation and coding scheme; MCS)과 전송 블록 속도(transport block speed; TBS) 중 하나 이상을 포함한다. 실시예 29: 실시예 25 내지 실시예 28 중 어느 하나의 통신 장치에 따르면, TA가 유효하지 않은 것은, TA의 유 효 기간이 만료된 것과; 단말의 현재 위치와 TA가 시작될 때 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과; 채널 품질과, TA가 시작될 때 달성되는 단말과 액세스 네트워크 디바이스 사이의 채널의 품질 사이의 차이가 채 널 품질 변경 임계값보다 큰 것 중 하나 이상을 포함한다. 실시예 30: 실시예 25 내지 실시예 29 중 어느 하나의 통신 장치에 따르면, 통신 유닛은, 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 큰 경우, 업링크 데이터를 비접속 상태의 액세 스 네트워크 디바이스에 송신하는 것은 스킵하고, 2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하 거나, 또는 채널 품질이 제 1 임계값보다 작고 채널 품질이 제 5 임계값보다 작은 경우, 업링크 데이터를 비접속 상태의 액 세스 네트워크 디바이스에 송신하는 것은 스킵하고, 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정하도록 더 구성된다. 실시예 31: 실시예 22 내지 실시예 30 중 어느 하나의 통신 장치에 따르면, 제 1 임계값, 제 2 임계값 및 제 3 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정된다 실시예 32: 통신 장치가 제공된다. 이 장치는, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하도록 구성된 수신 유닛 - 단말은 비접속 상태에 있 음 - 과, 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고, 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하도록 구성된 처리 유닛 을 포함한다. 실시예 33: 실시예 32의 통신 장치에 따르면, 처리 유닛은, 타이밍 어드밴스(TA)가 유효한지 여부를 결정하고 - TA는 단말과 액세스 네트워크 디바이스 사이의 업링크 시간 동기화에 사용됨 - 와, TA가 유효하지 않은 경우, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워 크 디바이스에 송신하는 것으로 결정하도록 구성된다. 실시예 34: 실시예 33의 통신 장치에 따르면, 처리 유닛은, TA가 유효한 경우, 업링크 데이터를 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하도록 더 구성되고, CG 방식에 대응하는 CG 리소스는, 액세스 네트워크 디바이스에 의해 사전 설정되고 비접속 상태의 단 말에 의한 전송에 사용되는 물리 업링크 공유 채널(PUSCH) 리소스이다. 실시예 35: 실시예 32 내지 실시예 34 중 어느 하나의 통신 장치에 따르면, 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한 이후에, 처 리 유닛은, 채널 품질이 제 3 임계값보다 큰 경우, 2-스텝 랜덤 액세스 방식에 대응하는 제 1 전송 리소스에 기초해서, MsgA로 액세스 네트워크 디바이스에 업링크 데이터를 송신하도록 더 구성된다. 실시예 36: 실시예 35의 통신 장치에 따르면, 제 1 전송 리소스에 대응하는 설정 정보는 제 3 임계값을 포함하 거나; 또는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또 는 제 3 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 전송 리소스의 전송 파라미터는 제 3 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 37: 실시예 34 내지 실시예 36 중 어느 하나의 통신 장치에 따르면, 업링크 데이터를 CG 방식으로 액세 스 네트워크 디바이스에 송신하는 것으로 결정한 후에, 처리 유닛은, 채널 품질이 제 4 임계값보다 큰 경우, 제 1 CG 리소스에 기초해서 액세스 네트워크 디바이스에 업링크 데이터 를 송신하도록 더 구성된다. 실시예 38: 실시예 37의 통신 장치에 따르면, 제 1 CG 리소스에 대응하는 설정 정보는 제 4 임계값을 포함하거 나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 임계값에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 임계값보다 크거나; 또는 제 4 임계값은 적어도 하나의 임계값에 포함되되, 적어도 하나의 임계값 각각은 하나의 전송 파라미터 범위에 대응하며, 제 1 CG 리소스의 전송 파라미터는 제 4 임계값에 대응하는 전송 파라미터 범위에 속한다. 실시예 39: 실시예 36 또는 실시예 38의 통신 장치에 따르면, 전송 파라미터는 변조 및 코딩 방식(MCS)과 전송 블록 속도(TBS) 중 하나 이상을 포함한다. 실시예 40: 실시예 33 내지 실시예 39 중 어느 하나의 통신 장치에 따르면, TA가 유효하지 않은 것은, TA의 유 효 기간이 만료된 것과; 단말의 현재 위치와 TA가 시작될 때 단말이 위치된 위치 사이의 거리가 거리 임계값보다 큰 것과; 채널 품질과, TA가 시작될 때 달성되는 단말과 액세스 네트워크 디바이스 사이의 채널의 품질 사이의 차이가 채 널 품질 변경 임계값보다 큰 것 중 하나 이상을 포함한다. 실시예 41: 실시예 32 내지 실시예 40 중 어느 하나의 통신 장치에 따르면, 처리 유닛은, 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 작은 경우, 업링크 데이터를 비접속 상태의 액 세스 네트워크 디바이스에 송신하는 것은 스킵하고, 2-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정 하고, 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 작은 경우, 업링크 데이터를 비접속 상태의 액 세스 네트워크 디바이스에 송신하는 것은 스킵하고, 4-스텝 랜덤 액세스 방식으로 셀에 액세스하는 것으로 결정 하도록 더 구성된다. 실시예 42: 실시예 32 내지 실시예 41 중 어느 하나의 통신 장치에 따르면, 제 6 임계값, 제 7 임계값 및 제 8 임계값은 단말에 대해서 액세스 네트워크 디바이스에 의해 설정된다. 실시예 43: 통신 시스템이 제공된다. 통신 시스템은, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하도록 구성된 단말 - 단말은 비접속 상태에 있음 - 을 포함한다. 채널 품질이 제 1 임계값보다 큰 경우, 단말은 업링크 데이터를 랜덤 액세스 방식으로 또는 CG 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고 - 랜덤 액세스 방식은 2-스텝 랜덤 액세스 방식 또는 4-스텝 랜 덤 액세스 방식을 포함함 - , 단말이 업링크 데이터를 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것은, 채널 품질이 제 2 임계값보다 큰 경우, 단말이 업링크 데이터를 2-스텝 랜덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하는 것, 또는 채널 품질이 제 2 임계값보다 작은 경우, 단말이 업링크 데이터를 4-스텝 랜덤 액세스 방식으로 액세스 네트워 크 디바이스에 송신하는 것으로 결정하는 것 을 포함한다. 실시예 44: 통신 시스템이 제공된다. 통신 시스템은, 단말과 액세스 네트워크 디바이스 사이의 채널 품질을 획득하도록 구성된 단말 - 단말은 비접속 상태에 있음 - 을 포함한다. 채널 품질이 제 6 임계값보다 크고 채널 품질이 제 7 임계값보다 큰 경우, 단말은, 업링크 데이터를 2-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정하고; 또는 채널 품질이 제 6 임계값보다 작고 채널 품질이 제 8 임계값보다 큰 경우, 단말은, 업링크 데이터를 4-스텝 랜 덤 액세스 방식으로 액세스 네트워크 디바이스에 송신하는 것으로 결정한다. 실시예 45: 통신 장치가 제공된다. 통신 장치는 하나 이상의 프로세서 및 통신 인터페이스를 포함하고, 하나 이 상의 프로세서 및 통신 인터페이스는, 통신 장치가 실시예 1 내지 실시예 10 중 어느 하나에 따른 데이터 전송 방법 또는 실시예 11 내지 실시예 21 중 어느 하나에 따른 데이터 전송 방법을 수행하는 것을 지원하도록 구성 된다. 실시예 46: 컴퓨터 판독가능 저장 매체가 제공된다. 컴퓨터 판독가능 저장 매체는 컴퓨터 명령어를 포함하고, 컴퓨터 명령어가 컴퓨터에서 실행될 때, 컴퓨터는 실시예 1 내지 실시예 10 중 어느 하나에 따른 데이터 전송 방법 또는 실시예 11 내지 실시예 21 중 어느 하나에 따른 데이터 전송 방법을 수행하게 된다. 본 출원의 명세서, 특허 청구 범위, 및 첨부 도면에서, \"제 1\", \"제 2\", \"제 3\", \"제 4\" 등의 용어는 서로 다른 대상을 구별하기 위한 것으로, 특정한 순서를 나타내지는 않는다는 점에 주의한다. 또한, \"포함하다\", \"가지고 있다\" 및 이들의 임의의 다른 파생어는 비배타적으로 포함하는 것을 포괄하도록 했다. 예를 들어, 일련의 단계 또는 유닛을 포함하는 프로세스, 방법, 시스템, 제품, 또는 디바이스는 열거된 단계 또는 유닛으로 제한되지 않 고, 열거되지 않은 단계 또는 유닛을 선택적으로 더 포함하거나, 또는 프로세스, 방법, 제품, 또는 디바이스의 다른 고유한 단계 또는 유닛을 선택적으로 더 포함한다. 본 출원에서, \"적어도 하나의 (항목)\"은 하나 이상을 의미하고, \"복수의\"는 2개 이상을 의미하며, \"적어도 2개 의 (항목)\"은 2개, 3개 또는 그 이상을 의미하고, \"및/또는\"은 연관된 대상들 사이의 연관 관계를 설명하는 데 사용되며 3 가지 관계가 존재할 수 있음을 나타낸다는 점을 이해해야 한다. 예를 들어, \"A 및/또는 B\"는 A만 존 재함, B만 존재함, 및 A와 B 모두 존재함을 나타낼 수 있으며, A 및 B는 단수형 또는 복수형일 수 있다. 부호 \"/\"는 일반적으로 연관된 대상들 사이의 \"또는\"의 관계를 나타낸다. \"다음 항목들(부분들) 중 적어도 하나의\" 또는 이와 유사한 표현은 단일 항목(부분) 또는 복수의 항목(부분)의 임의의 조합을 포함하여 이들 항목의 임의 의 조합을 의미한다. 예를 들어, a, b, 또는 c 중 적어도 하나는, \"a\", \"b\", \"c\", \"a와 b\", \"a와 c\", \"b와 c\", 또는 \"a, b 및 c\"를 나타낼 수 있으며, 여기서 a, b 및 c는 단수형일 수도 있고 또는 복수형일 수도 있다. 본 출원의 실시예에서, \"A에 대응하는 B\"는 B가 A와 연관되어 있음을 나타낸다는 것을 이해해야 한다. 예를 들 어, B는 A에 기초해서 결정될 수 있다. A에 기초해서 B를 결정하는 것이 B가 A에만 기초해서 결정된다는 것을 의미하지 않는다는 것을 더 이해해야 한다. 대안적으로 B는 A 및/또는 다른 정보에 기초해서 결정될 수도 있다. 나아가, 본 출원의 실시예에서, \"접속\"은 디바이스들 사이의 통신을 구현하기 위한 직접 접속 또는 간접 접속 등의 다양한 접속 방식을 의미한다. 이는 본 출원의 실시예에서 제한되지 않는다. 본 출원의 실시예에서, 별도로 언급되지 않는 한, \"전송\"(전송하다/전송)은 양방향 전송을 지칭하고, 송신 동작 및/또는 수신 동작을 포함한다. 구체적으로, 본 출원의 실시예에서 \"전송\"은 데이터 송신, 데이터 수신, 또는 데이터 송신 및 데이터 수신을 포함한다. 환언하면, 본 명세서에서 데이터 전송은 업링크 데이터 전송 및/또는 다운링크 데이터 전송을 포함한다. 데이터는 채널 및/또는 신호를 포함할 수 있다. 업링크 데이터 전송은 업링 크 채널 전송 및/또는 업링크 신호 전송이고, 다운링크 데이터 전송은 다운링크 채널 송신전송 및/또는 다운링 크 신호 전송이다. 본 출원의 실시예에서, \"네트워크\"와 \"시스템\"은 동일한 개념을 표현하고, 통신 시스템은 통 신 네트워크이다. 구현에 관한 전술한 설명은, 당업자가 편리하고 간략한 설명을 위해, 전술한 기능 모듈의 분할이 예시를 위한 예로서 사용되는 것이라는 점을 명확하게 이해할 수 있게 한다. 실제 응용시에, 전술한 기능들은 요건에 기초한 구현을 위해 서로 다른 기능 모듈들에 할당될 수 있는데, 즉, 장치의 내부 구조는 상술한 기능 전부 또는 일부 를 구현하기 위해 상이한 기능 모듈들로 분할된다. 본 출원에서 제공되는 몇몇 실시예에서, 개시된 장치 및 방법은 다른 방식들로 구현될 수 있다는 것을 이해해야 한다. 예를 들어, 설명된 장치 실시예는 단지 예시에 불과하다. 예를 들어, 모듈 또는 유닛들로의 분할은 단순 히 논리적 기능 분할이며, 실제 구현에서는 다른 분할일 수도 있다. 예를 들어, 복수의 유닛 또는 컴포넌트가 다른 장치에 결합되거나 통합될 수도 있고, 혹은 일부 특징이 무시되거나 수행되지 않을 수도 있다. 나아가, 디 스플레이되거나 논의된 상호 결합 또는 직접 결합 또는 통신 접속은 일부 인터페이스를 사용해서 구현될 수 있 다. 장치들 또는 유닛들 사이의 간접 결합 또는 통신 접속은 전자적 형태로, 기계적 형태로 또는 다른 형태로 구현될 수 있다. 개별적인 부품으로 설명된 유닛은 물리적으로는 분리될 수도 있고 분리되지 않을 수도 있다. 유닛으로 표시된 부분들은 하나 이상의 물리적 유닛일 수도 있는데, 구체적으로 말하자면, 한 장소에 위치할 수도 있고, 복수의 서로 다른 장소에 분산될 수도 있다. 유닛 중 일부 또는 전부는 실시예의 솔루션의 목적을 달성하기 위한 실제 요건들에 기초해서 선택될 수 있다. 나아가, 본 출원의 실시예에서 기능 유닛들은 하나의 처리 유닛으로 통합될 수도 있고 혹은, 각각의 유닛이 물 리적으로 단독으로 존재할 수도 있으며, 또는 둘 이상의 유닛이 하나의 유닛으로 통합될 수도 있다. 통합된 유 닛은 하드웨어의 형태로 구현될 수도 있고, 소프트웨어 기능 유닛의 형태로 구현될 수도 있다. 통합된 유닛이 소프트웨어 기능 유닛의 형태로 구현되어 독립적인 제품으로 판매 또는 사용되는 경우, 통합된 유닛은 판독 가능한 저장 매체에 저장될 수 있다. 이러한 이해에 기반하여, 본 출원의 필수적인 기술적 솔루션, 또는 현재 기술에 기여하는 부분, 또는 기술적 솔루션의 일부는 소프트웨어 제품의 형태로 구현될 수 있다. 소프트웨어 제품은 저장 매체에 저장되고, 디바이스에 지시하기 위한 여러 명령어를 포함하며, 여기서 디바이스는 이러한 출원의 실시예에서 방법의 단계 중 전부 또는 일부를 수행하는 예를 들어, 단일 칩 마이크로컴퓨터 또는 칩, 또는 프로세서(processor)일 수 있다. 전술한 저장 매체는 USB 플래시 드라이브, 이동식 하드 디스크, ROM, RAM, 자기 디스크 또는 광 디스크와 같은 프로그램 코드를 저장할 수 있는 임의의 매체를 포함한다."}
{"patent_id": "10-2023-7001655", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 4-스텝 랜덤 액세스 방식의 개략도이다. 도 1b는 2-스텝 랜덤 액세스 방식의 개략도이다. 도 1c는 CG 방식의 개략도이다. 도 2는 본 출원의 일 실시예에 따른 통신 시스템의 단순화된 개략도이다. 도 3은 본 출원의 일 실시예에 따른 통신 장치의 개략도이다. 도 4는 본 출원의 일 실시예에 따른 데이터 전송 방법의 흐름도이다. 도 5a는 본 출원의 일 실시예에 따른 데이터 전송 방법의 다른 흐름도이다. 도 5b는 본 출원의 일 실시예에 따른 데이터 전송 방법의 또 다른 흐름도이다. 도 5c는 본 출원의 일 실시예에 따른 데이터 전송 방법의 또 다른 흐름도이다. 도 5d는 본 출원의 일 실시예에 따른 데이터 전송 방법의 또 다른 흐름도이다. 도 6은 본 출원의 일 실시예에 따른 데이터 전송 방법의 흐름도이다. 도 7a는 본 출원의 일 실시예에 따른 데이터 전송 방법의 다른 흐름도이다. 도 7b는 본 출원의 일 실시예에 따른 데이터 전송 방법의 또 다른 흐름도이다. 도 7c는 본 출원의 일 실시예에 따른 데이터 전송 방법의 또 다른 흐름도이다. 도 7d는 본 출원의 일 실시예에 따른 데이터 전송 방법의 또 다른 흐름도이다. 도 8은 본 출원의 일 실시예에 따른 통신 장치의 구성의 개략도이다. 도 9는 본 출원의 일 실시예에 따른 통신 시스템의 구성의 개략도이다."}
