{"patent_id": "10-2023-0094307", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0014390", "출원번호": "10-2023-0094307", "발명의 명칭": "사용자 맞춤형 영상 디자인 자동 생성 시스템 및 이를 이용하는 방법", "출원인": "주식회사 더브이플래닛", "발명자": "이준호"}}
{"patent_id": "10-2023-0094307", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "사용자 맞춤형 영상 디자인 자동 생성 시스템에 있어서,사용자별로 영상 템플릿을 저장하되 사용자별 영상 템플릿 프로젝트 파일을 저장 파일시스템 및 데이터베이스와결합한 형태로 저장하는 템플릿 저장부;상기 템플릿 저장부의 상기 영상 템플릿 프로젝트 파일의 입력에 따라 작동하여 영상 템플릿 프로젝트의 각 계층 구조, 움직임 효과, 장면 전환 효과, 글꼴과 이미지 및 영상의 그래픽 효과의 영상 템플릿 프로젝트 파일의자산들을 기 정의된 파일 포맷으로 계층화하여 분석하는 템플릿 분석부;상기 템플릿 분석부에서 영상 템플릿 프로젝트를 분석한 계층화된 기 정의된 파일 포맷의 데이터를 저장하는 데이터 저장부;각 디자인별 개별 요소들의 정합된 패턴을 기 학습하여 내장되어 있는 인공지능 학습 모델을 상기 데이터 저장부에서 저장된 데이터의 수의 누적량에 따라 데이터의 패턴 학습을 추가 강화 학습하는 디자인 학습부;각 사용자에게 정합된 패턴에 따라 영상 디자인 템플릿을 추천해 주어 선택한 영상 디자인의 사용자 및 영상 디자인 템플릿들을 정합된 패턴을 추가 분석하여 상기 디자인 학습부에 따른 추천된 사용자 선택에 기반한 영상디자인 템플릿들의 조합을 추천해주는 서비스 추천부;상기 서비스 추천부에 사용자가 선택한 디자인과 사용자가 직접 선택한 영상의 그래픽 효과 자산들을 비식별화된 개인화 데이터로 저장하고 디자인 학습부에 개인화 추천을 위한 데이터를 전달하는 서비스 저장부;를 포함하는,사용자 맞춤형 영상 디자인 자동 생성 시스템."}
{"patent_id": "10-2023-0094307", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 영상 템플릿은 영상의 디자인 패턴에 따라 계층, 움직임 효과, 장면 전환 효과, 글꼴이나 이미지 영상의그래픽 효과들의 자산을 프로젝트 파일 형태로 저장해두는 것을 특징으로 하는,사용자 맞춤형 영상 디자인 자동 생성 시스템."}
{"patent_id": "10-2023-0094307", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 템플릿 분석부는, 상기 데이터 저장부에 저장된 데이터를 프로젝트 데이터 계층 아래에 디자인 개별 요소가 정합된 아이템 단일 속성을 가지며, 해당 아이템은 배경색상, 영상 길이, 프레임 길이, 높이, 식별번호, 가로 크기, 세로 크기, 레이어 수, 적응형 움직임 블러(blur) 가중치, 적응형 움직임 블러(blur) 프레임당가중치, 픽셀(Pixel) 비율, 해상도 인자, 각도, 혼합 모드, 품질 가중치, x좌표, y좌표, z좌표 키프레임, x좌표의 벡터(vector), x좌표의 벡터(vector) 가중치, y좌표의 벡터(vector), y좌표의 벡터(vector) 가중치를 가지는 것을 특징으로 하는사용자 맞춤형 영상 디자인 자동 생성 시스템."}
{"patent_id": "10-2023-0094307", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "공개특허 10-2025-0014390-3-제 3항에 있어서,상기 데이터 구조의 아이템 속성은 하위 계층을 가지고 있으며 하위계층은 특징점, 시간 매칭, 움직임 추적 값,마스크(Mask), 효과, 변형, 스케일(Scale), 정위, X회전값, Y회전값, RGB색상 값, 그림자, 투명도, 광원, 분산도, 잡음을 가지는 것을 특징으로 하는,사용자 맞춤형 영상 디자인 자동 생성 시스템."}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 사용자별로 영상 템플릿을 저장하되 사용자별 영상 템플릿 프로젝트 파일을 저장 파일시스템 및 데이 터베이스와 결합한 형태로 저장하는 템플릿 저장부, 템플릿 저장부의 영상 템플릿 프로젝트 파일의 입력에 따라 작동하여 영상 템플릿 프로젝트의 각 계층 구조, 움직임 효과, 장면 전환 효과, 글꼴과 이미지 및 영상의 그래픽 (뒷면에 계속)"}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 영상 디자인 자동 생성 시스템 및 이를 이용하는 방법에 관한 것으로서, 보다 상세하게는 이미 제작 된 영상 디자인의 템플릿을 활용하여 기계학습을 통해서 각 디자인 개별 요소들을 사용자의 특징에 따라 정합한 형태로 새로운 디자인을 자동으로 산출하는 사용자 맞춤형 영상 디자인 자동 생성 시스템 및 이를 이용하는 방 법에 관한 것이다."}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "인공지능 디자인은 인공지능 기술이 발전함에 따라 빠르게 발전해왔다. 2018년 기준으로 인공지능 기술이 화두 가 되었으며, B2B산업에서 인공지능 적용을 살펴보면, AI기술을 활용하여 Adobe 사에서는 AI 기술을 활용하여 이미지에서 누락된 부분을 자동으로 채워주는 Contents-Aware Fill 기능을 개발하여 제공하여 멀티미디어 시장 에서 AI 기술은 다양하게 적용되고 있다. 영상에서 특정 객체나 인물을 인식하고 추천하는 기술이 개발됨에 따 라 영상의 패턴을 분석하는 기술은 날로 발전하고 있다. 이런 한 기술적 배경에 의해 영상의 디자인 패턴에 따 라 다양한 디자인 조합을 생성해내고 사용자의 선택 패턴에 따른 추천 기능을 발명 할 수 있는 기술에 대한 사 용자의 요구가 늘어나고 있는 실정이다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1 : 한국공개특허 제10-2002-0027922호(공개일 : 2002.04.15) (특허문헌 0002) 특허문헌 2 : 한국등록특허 제10-2517314호(공고일 : 2023.04.03)"}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "상술한 기술적 요구에 따라 안출된 본 발명은 영상 디자인 템플릿들의 각 디자인 자산을 재조합하는 과정에서 인간의 창의적 사고력 보단 유사한 기존 영상 디자인의 재조합을 인적 자원이 직접 수행해야하는 어려움이 있다. 복잡하고 시간이 많이 걸리는 영상 디자인을 인공지능을 활용하여 인적자원을 대체하게 되면 복잡하고 시 간이 많이 걸리는 영상 디자인 과정을 단순화하고 효율화 하여 전문적으로 디자인 된 템플릿을 선택하고 그에 재조합을 수행하는 시간과 비용을 절약 할 수 있다. 본 시스템을 통해 다양한 스타일, 색상, 글꼴 애니메이션 등의 요소를 쉽게 조합하고 변경할 수 있다. 기 제작된 고품질의 그래픽과 사운드를 갖춘 영상 템플릿 디자인은 인공지능의 재조합으로 창의성과 품질 향상에 그 목적이 있다."}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위한 본 발명의 일 실시 예에 따른 사용자 맞춤형 영상 디자인 자동 생성 시스템은, 사용 자별로 영상 템플릿을 저장하되 사용자별 영상 템플릿 프로젝트 파일을 저장 파일시스템 및 데이터베이스와 결 합한 형태로 저장하는 템플릿 저장부; 상기 템플릿 저장부의 상기 영상 템플릿 프로젝트 파일의 입력에 따라 작 동하여 영상 템플릿 프로젝트의 각 계층 구조, 움직임 효과, 장면 전환 효과, 글꼴과 이미지 및 영상의 그래픽 효과의 영상 템플릿 프로젝트 파일의 자산들을 기 정의된 파일 포맷으로 계층화하여 분석하는 템플릿 분석부; 상기 템플릿 분석부에서 영상 템플릿 프로젝트를 분석한 계층화된 기 정의된 파일 포맷의 데이터를 저장하는 데 이터 저장부; 각 디자인별 개별 요소들의 정합된 패턴을 기 학습하여 내장되어 있는 인공지능 학습 모델을 상기 데이터 저장부에서 저장된 데이터의 수의 누적량에 따라 데이터의 패턴 학습을 추가 강화 학습하는 디자인 학습 부; 각 사용자에게 정합된 패턴에 따라 영상 디자인 템플릿을 추천해 주어 선택한 영상 디자인의 사용자 및 영 상 디자인 템플릿들을 정합된 패턴을 추가 분석하여 상기 디자인 학습부에 따른 추천된 사용자 선택에 기반한 영상 디자인 템플릿들의 조합을 추천해주는 서비스 추천부; 상기 서비스 추천부에 사용자가 선택한 디자인과 사 용자가 직접 선택한 영상의 그래픽 효과 자산들을 비식별화된 개인화 데이터로 저장하고 디자인 학습부에 개인 화 추천을 위한 데이터를 전달하는 서비스 저장부;를 포함한다. 이 경우에, 상기 영상 템플릿은, 영상의 디자인 패턴에 따라 계층, 움직임 효과, 장면 전환 효과, 글꼴이나 이 미지 영상의 그래픽 효과들의 자산을 프로젝트 파일 형태로 저정할 수 있다. 한편, 상기 템플릿 분석부는, 상기 데이터 저장부에 저장된 데이터를 프로젝트 데이터 계층 아래에 디자인 개별 요소가 정합된 아이템 단일 속성을 가지며, 해당 아이템은 배경색상, 영상 길이, 프레임 길이, 높이, 식별번호, 가로 크기, 세로 크기, 레이어 수, 적응형 움직임 블러(blur) 가중치, 적응형 움직임 블러(blur) 프레임당 가중 치, 픽셀(Pixel) 비율, 해상도 인자, 각도, 혼합 모드, 품질 가중치, x좌표, y좌표, z좌표 키프레임, x좌표의 벡터(vector), x좌표의 벡터(vector) 가중치, y좌표의 벡터(vector), y좌표의 벡터(vector) 가중치를 가질 수 있다. 이 경우에, 상기 데이터 구조의 아이템 속성은 하위 계층을 가지고 있으며 하위계층은 특징점, 시간 매칭, 움직 임 추적 값, 마스크(Mask), 효과, 변형, 스케일(Scale), 정위, X회전값, Y회전값, RGB색상 값, 그림자, 투명도, 광원, 분산도, 잡음을 가질 수 있다."}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 영상 디자인의 품질과 다양성을 높일 수 있다. 전문 디자이너가 제작한 영상 템플릿을 분석하고 학 습하여 사용자에게 맞는 템플릿을 추천하고 조합할 수 있으며 이를 통해 사용자는 쉽고 빠르게 전문가급의 영상 디자인을 만들 수 있으며 영상 디자인의 시간과 비용을 절감할 수 있다. 또한 복잡한 동영상 편집 도구 없이도 웹 브라우저나 스마트폰에서 온라인으로 영상 디자인을 할 수 있으며 영상 디자인의 개인화와 공유를 용이하게 할 수 있게 된다. 사용자가 선택한 디자인과 자산들을 비식별화된 개인화 데이터로 저장하고, 디자인 학습 모듈 에 전달하여 개인화 추천을 할 수 있다."}
{"patent_id": "10-2023-0094307", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 영상의 디자인을 자동화하기 위한 시스템 및 방법에 관한 것으로 이 시스템은 다음과 같은 구성 요소 로 이루어져 있다 템플릿 저장부는 기 제작된 영상 디자인의 템플릿을 저작자에 따라 분류하여 저장해두는 곳으로 템플릿은 영상 의 디자인 패턴에 맞춰 계층, 움직임 효과, 장면 전환 효과, 글꼴이나 이미지 영상 등의 그래픽 효과들의 자산 을 프로젝트 파일 형태로 저장해둔 것이다. 템플릿 분석부는 템플릿 저장소의 영상 템플릿 프로젝트 파일을 입력받아 작동하는 모듈로서 이 모듈은 영상 템 플릿 프로젝트의 각 계층 구조, 움직임 효과, 장면 전환 효과, 글꼴과 이미지 및 영상의 그래픽 효과 등의 영상 템플릿 프로젝트 파일의 자산들을 JSON 포맷으로 계층화하여 분석한다. 데이터 저장부는 템플릿 분석 모듈에서 영상 템플릿 프로젝트를 분석한 계층화된 JSON 포맷의 데이터를 NoSQL 데이터베이스로 저장하는 곳이다. 디자인 학습부는 각 디자인별 개별 요소들의 정합된 패턴을 기 학습하여 내장되어 있는 인공지능 학습 모델이 모듈에 내장되어 데이터 저장소에서 저장된 데이터의 수의 누적량에 따라 데이터의 패턴 학습을 추가 강화 학습 을 수행한다. 서비스 추천부는 각 사용자에게 정합된 패턴에 따라 영상 디자인 템플릿을 추천해 주는 모듈로서 이 모듈은 사 용자가 선택한 영상 디자인의 저작자 및 영상 디자인 템플릿들을 정합된 패턴을 추가 분석하여 디자인 학습 모 듈에 따른 추천된 사용자 선택에 기반한 영상 디자인 템플릿들의 조합을 추천해준다. 서비스 저장부는 서비스 추천부에 사용자가 선택한 디자인과 사용자가 직접 선택한 영상의 그래픽 효과 자산들 을 비식별화된 개인화 데이터로 저장하는 곳으로서 이 저장소는 디자인 학습부에 개인화 추천을 위한 데이터를 전달한다. 보다 구체적으로 살펴보면, 본 발명의 일 실시 예에 따른 시스템은 다음과 같은 방법으로 작동한다. 사용자는 서비스 추천부를 통해 원하는 영상 디자인의 저작자나 카테고리를 선택하거나 검색한다. 서비스 추천부는 사용 자의 선택에 맞는 영상 디자인 템플릿들을 템플릿 저장부로부터 독출한다. 서비스 추천부는 사용자에게 영상 디 자인 템플릿들을 제공하고, 사용자가 하나 이상의 템플릿을 선택하도록 한다. 서비스 추천부는 사용자가 선택한 템플릿들을 템플릿 분석부에 전달하고, 템플릿 분석부는 템플릿들의 자산들을 JSON 포맷으로 계층화하여 분석한 다. 템플릿 분석부는 분석한 데이터를 데이터 저장부에 저장하고, 디자인 학습부에 전달한다. 디자인 학습부는 데이터 저장부에서 저장된 데이터와 기 학습된 인공지능 학습 모델을 활용하여 사용자에게 적 합한 영상 디자인 템플릿들의 조합을 생성한다. 디자인 학습부는 생성한 영상 디자인 템플릿들의 조합을 서비스 추천부에 전달하고, 서비스 추천부는 사용자에게 추천 결과를 보여준다. 사용자는 추천 결과 중에서 하나를 선 택하거나, 자신이 원하는 그래픽 효과 자산들을 추가하거나 변경할 수 있다. 사용자가 최종적으로 만족하는 영 상 디자인을 완성하면, 서비스 모듈은 사용자가 선택한 디자인과 그래픽 효과 자산들을 서비스 저장소에 비식별 화된 개인화 데이터로 저장한다. 서비스 저장부는 저장된 데이터를 디자인 학습 모듈에 전달하고, 디자인 학습부는 해당 데이터를 추가 강화 학 습에 활용하여 인공지능 학습 모델을 개선한다."}
{"patent_id": "10-2023-0094307", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도1 은 본 발명에 따른 사용자 맞춤형 영상 디자인 자동 생성 시스템의 구성을 예시적으로 설명하는 블럭도."}
