{"patent_id": "10-2019-0103218", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2019-0104940", "출원번호": "10-2019-0103218", "발명의 명칭": "무인 비행 로봇의 컨트롤러", "출원인": "엘지전자 주식회사", "발명자": "이상학"}}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "무인 비행 로봇을 조종하기 위한 컨트롤러에 있어서,3축 가속도 센서를 포함하는 컨트롤 볼;상기 컨트롤 볼이 3차원 공간에서 위치 이동 및 일정 범위 내에서 회전이 가능하도록 지지하는 지지부;상기 컨트롤 볼의 3축 가속도 변화에 대응하도록 상기 무인 비행 로봇의 움직임을 제어하는 제어신호를 생성하는 제어모듈; 및상기 제어신호를 상기 무인 비행 로봇으로 전송하는 통신모듈;을 포함하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 3축 가속도 센서는,상기 컨트롤 볼의 3축에 대한 중력 가속도를 센싱하고, 이를 바탕으로 상기 컨트롤 볼의 롤(roll) 및 피치(pitch)를 획득하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 제어모듈은,상기 무인 비행 로봇의 롤 및 피치가 상기 컨트롤 볼의 롤 및 피치에 대응하도록 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 3 항에 있어서,상기 제어모듈은단위 시간 동안 상기 무인 비행 로봇의 롤 및 피치 변화량이, 상기 단위 시간 동안 상기 컨트롤 볼의 롤 및 피치 변화량에 비례하도록 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 컨트롤 볼은,3축에 대한 각속도를 센싱하고, 이를 바탕으로 상기 컨트롤 볼의 요(yaw)를 획득하는 자이로 센서를 더 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 5 항에 있어서,상기 제어모듈은상기 무인 비행 로봇의 요(yaw)가 상기 컨트롤 볼의 요(yaw)에 대응하도록 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러.공개특허 10-2019-0104940-3-청구항 7 제 6 항에 있어서,상기 제어모듈은단위 시간 동안 상기 무인 비행 로봇의 요(yaw) 변화량이, 상기 단위 시간 동안 상기 컨트롤 볼의 요(yaw) 변화량에 비례하도록 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1 항에 있어서,상기 지지부는프레임;상기 프레임과 연결된 복수 개의 지지대들; 및상기 컨트롤 볼과 상기 지지대들 각각을 연결하며, 탄성을 갖는 와이어를 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 지지부는, 상기 컨트롤 볼의 회전 및 이동에 따라 상기 와이어의 장력 변화를 센싱하는 압력 센서를 더 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 제어 모듈은,상기 압력센서의 변화가 있을 경우에 한해서, 상기 3축 가속도 변화에 대응하는 상기 제어신호를 생성하는 것을특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 9 항에 있어서,상기 제어 모듈은 상기 컨트롤 볼이 초기 위치에서 외력에 의해서 위치 이동 및 회전할 경우에, 상기 제어신호를 생성하고, 상기 외력이 제거되어서 상기 컨트롤 볼이 상기 초기 위치로 복귀하는 경우에, 상기 제어신호를 생성하지 않는것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 9 항에 있어서,상기 제어 모듈은,상기 무인 이동체의 이동속도가 상기 와이어의 장력 변화량에 비례하도록, 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1 항에 있어서,상기 지지부는,공개특허 10-2019-0104940-4-상기 컨트롤 볼에 고정되어서, 상기 컨트롤 볼의 움직임과 동일하게 움직이는 고정 연결부;상기 고정 연결부와 결합되고, 상기 고정부의 움직임에 따라 일정 반경 범위 내에서 움직임을 갖는 복수의 제1링크들;일단이 일정 반경 회전 가능하도록 상기 제1 링크들과 일대일로 연결되는 제2 링크들;상기 제2 링크들 각각의 타단과 연결되고, 상기 제2 링크들 각각의 회전각을 검출하는 엔코더들; 및상기 엔코더들이 고정되는 핸들 형태의 프레임;을 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서, 상기 고정 연결부는하나의 평면상에서 서로 동일한 간격으로 이격된 상태에서 상기 컨트롤 볼에 연결되는 복수 개의 제1 고정 지지대;상기 제1 고정 지지대와 일대일로 연결되고, 상기 제1 고정 지지대의 움직임과 동일한 움직임을 갖는 클립들;및인접하는 상기 클립들을 고정시키는 제2 고정 지지대;를 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13 항에 있어서,상기 제어 모듈은,상기 엔코더들이 획득하는 상기 제2 링크들 각각의 회전각을 바탕으로, 상기 컨트롤 볼의 이동 방향을판단하고,상기 무인 비행 로봇이 상기 컨트롤 볼의 이동 방향과 동일하게 이동하도록, 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 13 항에 있어서,상기 제어 모듈은,상기 제2 링크들 중에서 적어도 어느 하나의 제2 링크가 회전할 경우에 한해서, 상기 3축 가속도 변화에 대응하는 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 13 항에 있어서,상기 제어 모듈은 상기 컨트롤 볼이 초기 위치에서 외력에 의해서 위치 이동 및 회전할 경우에, 상기 제어신호를 생성하고, 상기외력이 제거되어서 상기 컨트롤 볼이 상기 초기 위치로 복귀하는 경우에, 상기 제어신호를 생성하지 않는 것을특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 17 항에 있어서,상기 제어 모듈은,상기 무인 이동체의 이동속도가 상기 엔코들이 검출한 상기 제2 링크들의 회전각 크기에 비례하도록 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러.공개특허 10-2019-0104940-5-청구항 19 제 8 항 또는 제 13 항에 있어서,상기 제어 모듈은 좌표 모드에 대응하여 상기 제어신호를 생성하며,상기 좌표 모드가 절대 좌표 모드일 경우에,상기 제어 모듈은, 상기 컨트롤러의 방향에 상관없이 상기 컨트롤 볼의 3축은 지구고정좌표에 매칭되어 고정된것으로 간주하여 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19 항에 있어서,상기 좌표 모드가 상대 좌표 모드일 경우에,상기 제어 모듈은, 상기 컨트롤 볼의 3축은 상기 컨트롤러에 매칭된 것으로 간주하여, 상기 제어신호를 생성하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 20 항에 있어서,상기 상기 좌표 모드의 상태를 표시하는 인디케이터를 더 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 1 항에 있어서,상기 상기 무인 비행 로봇의 짐벌의 이동을 제어하는 짐벌 조작부를 더 포함하고,상기 짐벌 조작부는, 2축 방향으로 이동 가능한 조이스틱 형태인 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22 항에 있어서,상기 짐벌의 촬영 방향을 표시하는 인디케이터를 더 포함하는 것을 특징으로 하는 무인 비행 로봇의 컨트롤러."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러는 3축 가속도 센서를 포함하는 컨트롤 볼, 컨트롤 볼이 3 차원 공간에서 위치 이동 및 일정 범위 내에서 회전이 가능하도록 지지하는 지지부, 컨트롤 볼의 3축 가속도 변 화에 대응하도록 무인 비행 로봇의 움직임을 제어하는 제어신호를 생성하는 제어모듈; 및 제어신호를 무인 비행 로봇으로 전송하는 통신모듈을 포함한다. 본 발명은 인공 지능(Artificail Intelligenfce) 모듈, 로봇, 증강 현실(Augmented Reality, AR) 장치, 가상 현 실(virtual reality, VR) 장치, 5G 서비스와 관련된 장치 등과 연계될 수 있다."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 무인 비행 로봇의 컨트롤러에 관한 것으로, 특히 조종자가 보다 직관적으로 무인 비행 로봇을 조작할 수 있는 컨트롤러에 관한 것이다."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "무인 비행 로봇은 조종사 없이 무선전파의 유도에 의해서 비행 및 조종이 가능한 비행기, 헬리콥터 모양의 무인 항공기(UAV, Unmanned aerial vehicle / Uninhabited aerial vehicle)의 총칭한다. 최근 무인 비행 로봇은 정 찰, 공격 등의 군사적 용도 이외에 영상 촬영, 무인 택배 서비스, 재해 관측 등 다양한 민간·상업 분야에도 활 용이 증가되고 있다. 무인 비행 로봇을 조종하는 컨트롤러를 조작하기 위해서는 꽤나 많은 시간 및 훈련이 필요하고, 이에 따라 무인 비행 로봇을 활용하는 데에 난점이 발생하기도 한다."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제점을 해결하는 것을 목적으로 한다. 또한, 본 발명은 무인 비행 로봇을 보다 수월하고 직관적으로 조종할 수 있는 무인 비행 로봇의 컨트롤러를 제 공하기 위한 것이다."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러는 3축 가속도 센서를 포함하는 컨트롤 볼; 상기 컨트롤 볼이 3차원 공간에서 위치 이동 및 일정 범위 내에서 회전이 가능하도록 지지하는 지지부; 상기 컨트롤 볼의 3 축 가속도 변화에 대응하도록 상기 무인 비행 로봇의 움직임을 제어하는 제어신호를 생성하는 제어모듈; 및 상 기 제어신호를 상기 무인 비행 로봇으로 전송하는 통신모듈을 포함한다. 상기 3축 가속도 센서는, 상기 컨트롤 볼의 3축에 대한 중력 가속도를 센싱하고, 이를 바탕으로 상기 컨트롤 볼 의 롤(roll) 및 피치(pitch)를 획득할 수 있다. 상기 제어모듈은, 상기 무인 비행 로봇의 롤 및 피치가 상기 컨트롤 볼의 롤 및 피치에 대응하도록 상기 제어신 호를 생성할 수 있다. 상기 제어모듈은 단위 시간 동안 상기 무인 비행 로봇의 롤 및 피치 변화량이, 상기 단위 시간 동안 상기 컨트 롤 볼의 롤 및 피치 변화량에 비례하도록 상기 제어신호를 생성할 수 있다. 상기 컨트롤 볼은, 3축에 대한 각속도를 센싱하고, 이를 바탕으로 상기 컨트롤 볼의 요(yaw)를 획득하는 자이로 센서를 더 포함할 수 있다. 상기 제어모듈은 상기 무인 비행 로봇의 요(yaw)가 상기 컨트롤 볼의 요(yaw)에 대응하도록 상기 제어신호를 생 성할 수 있다. 상기 제어모듈은 단위 시간 동안 상기 무인 비행 로봇의 요(yaw) 변화량이, 상기 단위 시간 동안 상기 컨트롤 볼의 요(yaw) 변화량에 비례하도록 상기 제어신호를 생성할 수 있다. 상기 지지부는 프레임; 상기 프레임과 연결된 복수 개의 지지대들; 및 상기 컨트롤 볼과 상기 지지대들 각각을 연결하며, 탄성을 갖는 와이어를 포함할 수 있다. 상기 지지부는, 상기 컨트롤 볼의 회전 및 이동에 따라 상기 와이어의 장력 변화를 센싱하는 압력 센서를 더 포 함할 수 있다. 상기 제어 모듈은, 상기 압력센서의 변화가 있을 경우에 한해서, 상기 3축 가속도 변화에 대응하는 상기 제어신 호를 생성할 수 있다. 상기 제어 모듈은 상기 컨트롤 볼이 초기 위치에서 외력에 의해서 위치 이동 및 회전할 경우에 상기 제어신호를 생성하고, 상기 외력이 제거되어서 상기 컨트롤 볼이 상기 초기 위치로 복귀하는 경우에 상기 제어신호를 생성 하지 않을 수 있다. 상기 제어 모듈은, 상기 무인 이동체의 이동속도가 상기 와이어의 장력 변화량에 비례하도록, 상기 제어신호를 생성할 수 있다. 상기 지지부는, 상기 컨트롤 볼에 고정되어서, 상기 컨트롤 볼의 움직임과 동일하게 움직이는 고정 연결부; 상 기 고정 연결부와 결합되고, 상기 고정부의 움직임에 따라 일정 반경 범위 내에서 움직임을 갖는 복수의 제1 링 크들; 일단이 일정 반경 회전 가능하도록 상기 제1 링크들과 일대일로 연결되는 제2 링크들; 상기 제2 링크들 각각의 타단과 연결되고, 상기 제2 링크들 각각의 회전각을 검출하는 엔코더들; 및 상기 엔코더들이 고정되는 핸들 형태의 프레임;을 포함할 수 있다. 상기 고정 연결부는 하나의 평면상에서 서로 동일한 간격으로 이격된 상태에서 상기 컨트롤 볼에 연결되는 복수 개의 제1 고정 지지대; 상기 제1 고정 지지대와 일대일로 연결되고, 상기 제1 고정 지지대의 움직임과 동일한 움직임을 갖는 클립들; 및 인접하는 상기 클립들을 고정시키는 제2 고정 지지대;를 포함할 수 있다. 상기 제어 모듈은, 상기 엔코더들이 획득하는 상기 제2 링크들 각각의 회전각을 바탕으로, 상기 컨트롤 볼의 이 동 방향을 판단하고, 상기 무인 비행 로봇이 상기 컨트롤 볼의 이동 방향과 동일하게 이동하도록, 상기 제어신 호를 생성할 수 있다. 상기 제어 모듈은, 상기 제2 링크들 중에서 적어도 어느 하나의 제2 링크가 회전할 경우에 한해서, 상기 3축 가 속도 변화에 대응하는 상기 제어신호를 생성할 수 있다. 상기 제어 모듈은 상기 컨트롤 볼이 초기 위치에서 외력에 의해서 위치 이동 및 회전할 경우에, 상기 제어신호 를 생성하고, 상기 외력이 제거되어서 상기 컨트롤 볼이 상기 초기 위치로 복귀하는 경우에, 상기 제어신호를 생성하지 않을 수 있다. 상기 제어 모듈은, 상기 무인 이동체의 이동속도가 상기 엔코들이 검출한 상기 제2 링크들의 회전각 크기에 비 례하도록 상기 제어신호를 생성할 수 있다. 상기 제어 모듈은 좌표 모드에 대응하여 상기 제어신호를 생성하며, 상기 좌표 모드가 절대 좌표 모드일 경우에, 상기 제어 모듈은, 상기 컨트롤러의 방향에 상관없이 상기 컨트롤 볼의 3축은 지구고정좌표에 매칭되어 고정된 것으로 간주하여 상기 제어신호를 생성할 수 있다. 상기 좌표 모드가 상대 좌표 모드일 경우에, 상기 제어 모듈은, 상기 컨트롤 볼의 3축은 상기 컨트롤러에 매칭 된 것으로 간주하여, 상기 제어신호를 생성할 수 있다. 상기 상기 좌표 모드의 상태를 표시하는 인디케이터를 더 포함할 수 있다. 상기 상기 무인 비행 로봇의 짐벌의 이동을 제어하는 짐벌 조작부를 더 포함하고, 상기 짐벌 조작부는, 2축 방 향으로 이동 가능한 조이스틱 형태일 수 있다. 상기 짐벌의 촬영 방향을 표시하는 인디케이터를 더 포함할 수 있다."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시 예에 따르면, 컨트롤러의 컨트롤 볼은 무인 비행 로봇에 탑재되는 센서와 동일한 센서를 탑재하 고, 컨트롤 볼의 위치 및 회전을 제어하여 무인 비행 로봇을 동일하게 제어할 수 있다. 따라서, 조종자는 직관 적인 방법으로 무인 비행 로봇을 수월하게 조종할 수 있다."}
{"patent_id": "10-2019-0103218", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 명세서에 개시된 실시예를 상세히 설명하되, 도면 부호에 관계없이 동일하거 나 유사한 구성요소는 동일한 참조 번호를 부여하고 이에 대한 중복되는 설명은 생략하기로 한다. 이하의 설명 에서 사용되는 구성요소에 대한 접미사 \"모듈\" 및 \"부\"는 명세서 작성의 용이함만이 고려되어 부여되거나 혼용 되는 것으로서, 그 자체로 서로 구별되는 의미 또는 역할을 갖는 것은 아니다. 또한, 본 명세서에 개시된 실시 예를 설명함에 있어서 관련된 공지 기술에 대한 구체적인 설명이 본 명세서에 개시된 실시예의 요지를 흐릴 수 있다고 판단되는 경우 그 상세한 설명을 생략한다. 또한, 첨부된 도면은 본 명세서에 개시된 실시예를 쉽게 이 해할 수 있도록 하기 위한 것일 뿐, 첨부된 도면에 의해 본 명세서에 개시된 기술적 사상이 제한되지 않으며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 제1, 제2 등과 같이 서수를 포함하는 용어는 다양한 구성요소들을 설명하는데 사용될 수 있지만, 상기 구성요소 들은 상기 용어들에 의해 한정되지는 않는다. 상기 용어들은 하나의 구성요소를 다른 구성요소로부터 구별하는 목적으로만 사용된다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되어야 할 것이다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"포함한다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부 품 또는 이들을 조합한 것이 존재함을 지정하려는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되 어야 한다. 이하, AI 프로세싱된 정보를 필요로 하는 장치 및/또는 AI 프로세서가 필요로 하는 5G 통신(5th generation mobile communication)을 단락 A 내지 단락 G를 통해 설명하기로 한다. 도 1은 본 발명의 실시예에 따른 무인 비행 로봇의 사시도를 나타낸다. 우선, 무인 비행 로봇은 지상의 관리자에 의해 수동 조작되거나, 설정된 비행 프로그램에 의해 자동 조종 되면서 무인 비행하게 되는 것이다. 이와 같은 무인 비행 로봇은 도 1에서와 같이 본체, 수평 및 수직 이동 추진장치, 및 착륙용 레그를 포함하는 구성으로 이루어진다. 본체는 짐벌 등의 모듈이 장착되는 몸체 부위이다. 수평 및 수직이동 추진장치는 본체에 수직으로 설치되는 하나 이상의 프로펠러로 이루어지는 것으 로, 본 발명의 실시예에 따른 수평 및 수직이동 추진장치는 서로 이격 배치된 복수개의 프로펠러와 모 터로 이루어진다. 여기서 수평 및 수직이동 추진장치는 프로펠러가 아닌 에어 분사형 추진기 구조 로 이루어질 수도 있다. 복수 개의 프로펠러 지지부는 본체에서 방사상으로 형성된다. 각각의 프로펠러 지지부에는 모터 가 장착될 수 있다. 각각의 모터에는 프로펠러가 장착된다. 복수 개의 프로펠러는 본체를 중심을 기준하여 대칭되게 배치될 수 있다. 그리고 복수 개의 프로펠러 의 회전 방향은 시계 방향과 반 시계 방향이 조합되도록 모터의 회전 방향이 결정될 수 있다. 본체(2 0)를 중심을 기준하여 대칭되는 한 쌍의 프로펠러의 회전 방향은 동일(예를 들어, 시계 방향)하게 설정될 수 있다. 그리고 다른 한 쌍의 프로펠러은 이와 달리 회전 방향이 반대일 수 있다.(예를 들어, 시계 반대 방향) 착륙용 레그는 본체의 저면에 서로 이격 배치된다. 또한, 착륙용 레그의 하부에는 무인 비행 로 봇이 착륙할 때 지면과의 충돌에 의한 충격을 최소화하는 완충 지지부재(미도시)가 장착될 수 있다. 물론 무인 비행 로봇은 상술한 바와 다른 비행체 구성의 다양한 구조로 이루어질 수 있다.도 2를 참조하면, 무인 비행 로봇은 안정적으로 비행하기 위해서 각종 센서들을 이용해 자신의 비행상태를 측정한다. 무인 비행 로봇은 적어도 하나의 센서를 포함하는 센서부를 포함할 수 있다. 무인 비행 로봇의 비행상태는 회전운동상태(Rotational States)와 병진운동상태(Translational States)로 정의된다. 회전운동상태는 '요(Yaw)', '피치 (Pitch)', 및 '롤 (Roll)'을 의미하며, 병진운동상태는 경도, 위도, 고도, 및 속도를 의미한다. 여기서, '롤', '피치', 및 '요'는 오일러 (Euler) 각도라 부르며, 비행기 기체좌표 x,y,z 세 축이 어떤 특정 좌 표, 예를 들어, NED 좌표 N, E, D 세 축에 대하여 회전된 각도를 나타낸다. 비행기 전면이 기체좌표의 z축을 기 준으로 좌우로 회전할 경우, 기체좌표의 x축은 NED 좌표의 N축에 대하여 각도 차이가 생기게 되며, 이각도를 \" 요\"(Ψ)라고 한다. 비행기의 전면이 오른쪽으로 향한 y축을 기준으로 상하로 회전을 할 경우, 기체좌표의 z축은 NED 좌표의 D축에 대하여 각도 차이가 생기게 되며, 이 각도를 \"피치\"(θ)라고 한다. 비행기의 동체가 전면을 향한 x축을 기준으로 좌우로 기울게 될 경우, 기체좌표의 y축은 NED 좌표의 E축에 대하여 각도가 생기게 되며, 이 각도를 \"롤\"(Φ)이라 한다. 무인 비행 로봇은 회전운동상태를 측정하기 위해 3축 자이로 센서(Gyroscopes), 3축 가속도 센서 (Accelerometers), 및 3축 지자기 센서(Magnetometers)를 이용하고, 병진운동상태를 측정하기 위해 GPS 센서와 기압 센서(Barometric Pressure Sensor)를 이용한다. 본 발명의 센서부는 자이로 센서, 가속도 센서, GPS 센서, 영상 센서 및 기압 센서 중 적어도 하나를 포함한다. 여기서, 자이로 센서와 가속도 센서는 무인 비행 로봇의 기체좌표(Body Frame Coordinate)가 지 구관성좌표(Earth Centered Inertial Coordinate)에 대해 회전한 상태와 가속된 상태를 측정해주는데, MEMS(Micro-Electro-Mechanical Systems) 반도체 공정기술을 이용해 관성측정기(IMU: Inertial Measurement Unit)라 부르는 단일 칩(Single Chip)으로 제작될 수도 있다. 또한, IMU 칩 내부 에는 자이로 센서와 가속도 센 서가 측정한 지구관성좌표 기준의 측정치들을 지역좌표 (Local Coordinate), 예를 들어 GPS가 사용하는 NED(North-East-Down) 좌표로 변환해주는 마이크로 컨트롤러가 포함될 수 있다. 자이로 센서는 무인 비행 로봇의 기체좌표 x, y, z 세 축이 지구관성좌표에 대하여 회전하는 각속도를 측 정한 후 고정좌표로 변환된 값(Wx.gyro, Wy.gyro, Wz.gyro)을 계산하고, 이 값을 선형 미분방정식을 이용해 오 일러 각도(Φgyro, θgyro, Ψgyro)로 변환한다. 가속도 센서는 무인 비행 로봇의 기체좌표 x, y, z 세 축의 지구관성좌표에 대한 가속도를 측정한 후 고정 좌표로 변환된 값(fx,acc, fy,acc, fz,acc)을 계산하고, 이 값을 '롤(Φacc)'과 '피치(θacc)'로 변환하며, 이 값 들은 자이로 센서의 측정치를 이용해 계산한 '롤(Φgyro)'과 '피치(θgyro)'에 포함된 바이어스 오차를 제거 하는 데 이용된다. 지자기 센서는 무인 비행 로봇의 기체좌표 x, y, z 세 축의 자북점에 대한 방향을 측정하고, 이 값을 이용 해 기체좌표의 NED 좌표에 대한 '요' 값을 계산한다. GPS 센서는 GPS 위성들로부터 수신한 신호를 이용해 NED 좌표 상에서 무인 비행 로봇의 병진운동상태, 즉, 위도(Pn.GPS), 경도(Pe.GPS), 고도(hMSL.GPS), 위도 상의 속도(Vn.GPS), 경도 상의 속도(Ve.GPS), 및 고도 상 의 속도(Vd.GPS)를 계산한다. 여기서, 첨자 MSL은 해수면(MSL: Mean Sea Level)을 의미한다. 기압 센서는 무인 비행 로봇의 고도(hALP.baro)를 측정할 수 있다. 여기서, 첨자 ALP는 기압(Air-Level Pressor)을 의미하며, 기압 센서는 무인 비행 로봇의 이륙시 기압과 현재 비행고도에서의 기압을 비교 해 이륙 지점으로부터의 현재 고도를 계산한다. 카메라 센서는 적어도 하나의 광학렌즈와, 광학렌즈를 통과한 광에 의해 상이 맺히는 다수개의 광다이오드 (photodiode, 예를 들어, pixel)를 포함하여 구성된 이미지센서(예를 들어, CMOS image sensor)와, 광다이오드 들로부터 출력된 신호를 바탕으로 영상을 구성하는 디지털 신호 처리기(DSP: Digital Signal Processor)를 포함 할 수 있다. 디지털 신호 처리기는 정지영상은 물론이고, 정지영상으로 구성된 프레임들로 이루어진 동영상을 생성하는 것도 가능하다. 무인 비행 로봇은, 정보를 입력받거나 수신하고 정보를 출력하거나 송신하는 커뮤니케이션 모듈을 포 함한다. 커뮤니케이션 모듈은 외부의 다른 기기와 정보를 송수신하는 드론 통신부를 포함할 수 있다. 커뮤니케이션 모듈은 정보를 입력하는 입력부를 포함할 수 있다. 커뮤니케이션 모듈은 정보를출력하는 출력부를 포함할 수 있다. 물론, 출력부는 무인 비행 로봇에 생략되고 단말기에 형성될 수 있다. 일 예로, 무인 비행 로봇은 입력부로부터 직접 정보를 입력받을 수 있다. 다른 예로, 무인 비행 로봇 은 별도의 단말기 또는 서버에 입력된 정보를 드론 통신부를 통해 수신받을 수 있다. 일 예로, 무인 비행 로봇은 출력부로 직접 정보를 출력시킬 수 있다. 다른 예로, 무인 비행 로봇 은 드론 통신부를 통해 별도의 단말기로 정보를 송신하여, 단말기가 정보를 출력하게 할 수 있다. 드론 통신부는, 외부의 서버, 단말기 등과 통신하게 구비될 수 있다. 드론 통신부는, 스마 트폰이나 컴퓨터 등의 단말기로부터 입력된 정보를 수신할 수 있다. 드론 통신부는 단말기로 출 력될 정보를 송신할 수 있다. 단말기는 드론 통신부로부터 받은 정보를 출력할 수 있다. 드론 통신부는 단말기 또는/및 서버로부터 각종 명령 신호를 수신할 수 있다. 드론 통신부(17 5)는 단말기 또는/및 서버로부터 주행을 위한 구역 정보, 주행 경로, 주행 명령을 수신받을 수 있다. 여기서, 구역 정보는 비행 제한 구역(A) 정보, 접근 제한 거리 정보를 포함할 수 있다. 입력부는 On/Off 또는 각종 명령을 입력받을 수 있다. 입력부는 구역 정보를 입력받을 수 있다. 입력 부는 물건 정보를 입력받을 수 있다. 입력부는, 각종 버튼이나 터치패드, 또는 마이크 등을 포함할 수 있다. 출력부는 각종 정보를 사용자에게 알릴 수 있다. 출력부는 스피커 및/또는 디스플레이를 포함할 수 있다. 출력부는 주행 중 감지한 발견물의 정보를 출력할 수 있다. 출력부는 발견물의 식별 정보를 출 력할 수 있다. 출력부는 발견물의 위치 정보를 출력할 수 있다. 무인 비행 로봇은 맵핑 및/또는 현재 위치를 인식하는 등 각종 정보를 처리하고 판단하는 제어부를 포함한다. 제어부는 무인 비행 로봇을 구성하는 각종 구성들의 제어를 통해, 무인 비행 로봇의 동작 전반을 제어할 수 있다. 제어부는 커뮤니케이션 모듈로부터 정보를 받아 처리할 수 있다. 제어부는 입력부로부터 정보를 입력 받아 처리할 수 있다. 제어부는 드론 통신부로부터 정보를 받아 처리할 수 있다. 제어부 는 센싱부로부터 감지 정보를 입력 받아 처리할 수 있다. 제어부는 모터의 구동을 제어할 수 있다. 제어부는 작업부의 동작을 제어할 수 있다. 무인 비행 로봇은 각종 데이터를 저장하는 저장부를 포함한다. 저장부는 무인 비행 로봇의 제어에 필요한 각종 정보들을 기록하는 것으로, 휘발성 또는 비휘발성 기록 매체를 포함할 수 있다. 저장부에는 주행구역에 대한 맵이 저장될 수 있다. 맵은 무인 비행 로봇과 드론 통신부을 통해 정보를 교환할 수 있는 외부 단말기에 의해 입력된 것일 수도 있고, 무인 비행 로봇이 스스로 학습을 하여 생성한 것일 수도 있다. 전자의 경우, 외부 단말기로는 맵 설정을 위한 어플리케이션(application)이 탑재된 리모콘, PDA, 랩탑(laptop), 스마트 폰, 태블릿 등을 예로 들 수 있다. 도 3을 참조하면, 본 발명의 일 실시예에 다른 항공 제어 시스템은 무인 비행 로봇과 서버를 포함하 거나, 무인 비행 로봇, 단말기 및 서버를 포함할 수 있다. 무인 비행 로봇, 단말기 및 서버는 서로 무선 통신 방법으로 연결된다. 무선 통신 방법은 GSM(Global System for Mobile communication), CDMA(Code Division Multi Access), CDMA2000(Code Division Multi Access 2000), EV-DO(Enhanced Voice-Data Optimized or Enhanced Voice-Data Only), WCDMA(Wideband CDMA), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced) 등이 사용될 수 있다. 무선 통신 방법은 무선 인터넷 기술이 사용될 수 있다. 무선 인터넷 기술로는, 예를 들어 WLAN(Wireless LAN), Wi-Fi(Wireless-Fidelity), Wi-Fi(Wireless Fidelity) Direct, DLNA(Digital Living Network Alliance), WiBro(Wireless Broadband), WiMAX(World Interoperability for Microwave Access), HSDPA(High Speed Downlink Packet Access), HSUPA(High Speed Uplink Packet Access), LTE(Long Term Evolution), LTE-A(Long Term Evolution-Advanced), 5G 등이 있다. 특히 5G 통신망을 이용하여 데이터를 송수신함으로써 보다 빠른 응답 이 가능하다.단말기는 무인 비행 로봇을 제어하는 제어명령을 입력 받는 컨트롤러와 시각적 또는 청각적 정보를 출력하는 출력부를 포함할 수 있다. 서버는 무인 비행 로봇의 비행이 제한되는 비행 제한 구역(A) 정보를 저장하고, 무인 비행 로봇(10 0)의 자율 주행 레벨에 따라 비행 제한 구역(A)의 접근 제한 거리를 다르게 산정하고, 무인 비행 로봇 및 단말기 중 적어도 하나에 비행 제한 구역(A) 정보와 접근 제한 거리 정보를 제공한다. 따라서, 자유 주행 에 레벨이 높은 무인 비행 로봇의 경우 효율적인 경로를 주행하도록 하고, 자율 주행 레벨이 낮은 무인 비 행 로봇의 경우 자율 주행 레벨이 낮은 무인 비행 로봇이 비행 제한 구역(A)에 근접하여 발생할 수 있는 사고를 예방할 수 있는 이점이 존재한다. 또한, 서버는 비행 제한 구역(A) 정보와 접근 제한 거리 정보를 바탕으로 비행 경로를 설정하고, 비행 경 로를 무인 비행 로봇 및 단말기 중 적어도 하나에 제공할 수 있다. 적극적으로, 서버는 비행 제한 구역(A) 정보와 자율 주행 레벨에 따른 접근 제한 거리 정보를 바탕으로 비 행 경로를 설정하고, 비행 경로 대로 무인 비행 로봇을 제어할 수 있다. 서버는 무인 비행 로봇이 접근 제한 거리 이내로 접근하면, 자율 주행 레벨에 따라 무인 비행 로봇 에 상이한 명령을 송신할 수 있다. 서버는 무인 비행 로봇의 자동 조정 또는 수동 조정 여부에 무인 비행 로봇에 상이한 명령을 송신할 수 있다. 예를 들면, 서버는 무인 비행 로봇 또는/및 단말기와 정보를 주고받는 통신부, 무인 비행 로봇 의 자율 주행 레벨을 판단하는 레벨판단 유닛, 무인 비행 로봇의 비행이 제한되는 비행 제한 구 역(A) 정보를 저장하는 저장부 및 무인 비행 로봇 또는/및 단말기에 정보를 제공하거나, 무인 비행 로봇 또는/및 단말기는 제어하는 컨트롤 유닛을 포함할 수 있다. 또한, 서브는 무인 비행 로봇에서 제공받은 위치 고도 정보를 통해 무인 비행 로봇의 위치 및 고도를 판단하는 위치판단 유닛 을 더 포함할 수도 있다. 저장부는 항공관제를 위하여 비행 제한 구역(A)에 대한 정보를 저장하고, 무인 비행 로봇의 자율 주 행 레벨에 대한 정보를 저장하며, 무인 비행 로봇의 항공관제에 대한 정보를 저장할 수 있다. 레벨판단 유닛은 무인 비행 로봇의 자율 주행 레벨을 판단한다. 무인 비행 로봇의 자율 주행 레 벨은 무인 비행 로봇에서 서버로 송신된 자율 주행 레벨 정보를 통해 판단하거나, 단말기에서 제공된 자율 주행 레벨 정보를 통해 판단한다. 무인 비행 로봇의 자율 주행 레벨은 완전히 수동 주행만 가능하거나, 수동 주행을 각종 센서로 보조하는 수준을 레벨 1로 정의하고, 무인 비행 로봇이 반 자율 주행(자동이착륙, 소극적 장애물 회피, 사용자가 지 정한 경로 대로 이동)을 하는 수준을 레벨 2로 정의하며, 무인 비행 로봇이 완전한 자율 주행(스스로 경로 를 생성하고 목적지(S2)로 이동하고, 스스로 작업을 수행)하는 수준을 레벨 3으로 정의할 수 있다. 컨트롤 유닛은 무인 비행 로봇의 자율 주행 레벨에 따라 비행 제한 구역(A)의 접근 제한 거리를 다르 게 산정하고, 무인 비행 로봇 또는/및 단말기에 비행 제한 구역(A) 정보와 접근 제한 거리 정보를 제 공한다. 비행 제한 구역(A)의 정보는 비행 제한 구역(A)의 위치 정보와, 비행 제한 구역(A)의 경계 정보를 포함할 수 있 다. 여기서, 컨트롤 유닛의 정보를 무인 비행 로봇 또는/및 단말기에 제공하는 것은 5G 등의 무선 통신방법으로 정보 데이터를 무인 비행 로봇 또는/및 단말기에 송신하는 것을 의미한다. 본 발명의 실시 예에 따르면, 무인 비행 로봇은 서버의 컨트롤 유닛 이외에, 조종자가 직접 조 작하는 컨트롤러를 이용하여 제어될 수 있다. 이하, 컨트롤러의 실시 예를 살펴보면 다음과 같다. 무인 비행 로봇의 컨트롤러 도 4는 본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러의 구성을 나타내는 블록도이고, 도 5는 본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러를 나타내는 사시도이다. 도 4 및 도 5를 참조하면, 본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러(이하, 컨트롤러)는 컨트 롤 볼, 보조 센서부, 제어 모듈, 및 통신 모듈을 포함한다. 보조 센서부, 제 어 모듈, 및 통신 모듈은 도 5에 도시된 바와 같이, 컨트롤 박스에 탑재될 수 있다. 컨트롤 볼은 무인 비행 로봇에 탑재된 센서들을 포함할 수 있다. 즉, 컨트롤 볼은 3축 가속 도 센서, 자이로 센서, 지자기 센서 등을 포함할 수 있다. 컨트롤 볼은 센서들을 이용하여, 컨트롤 볼의 롤(roll), 피치(pitch) 및 요(yaw)를 획득할 수 있다. 도 6은 컨트롤 볼의 롤(roll), 피치(pitch) 및 요(yaw)를 설명하는 도면이다. 3축 가속도 센서는 무인 비행 로봇에 속한 가속도 센서와 마찬가지로, 컨트롤 볼의 중력 가속도를 센싱하고, 이를 바탕으로 컨트롤 볼의 롤(roll) 및 피치(pitch)를 획득한다. 컨트롤 볼의 요(ya w)는 자이로 센서 또는 지자기 센서의 센싱값을 참고하여 획득할 수 있다. 롤은 x축에 대한 컨트 롤 볼의 회전을 지칭하고, 피치는 y축에 대한 컨트롤 볼의 회전을 지칭하고, 요는 y 축에 대한 컨 트롤 볼의 회전을 지칭한다. 이때, x축 및 y축은 중력가속도 방향인 z축과 수직이고, 서로 직교하는 축 을 지칭한다. 자이로 센서는 컨트롤 볼의 x, y, z 세 축이 지구관성좌표에 대하여 회전하는 각속도를 측정한 후 고정좌표로 변환된 값을 계산하고, 이를 바탕으로 오일러 각도를 획득한다. 지자기 센서는 컨트롤 볼의 x, y, z 세 축의 자북점에 대한 방향을 측정하고, 이 값을 이용해 컨트 롤 볼의 NED 좌표에 대한 '요' 값을 계산한다. 지지부는 제어 모듈 및 통신 모듈을 탑재하고, 컨트롤 볼이 3차원 공간에서 일정한 위 치에서 유지하도록 지지한다. 특히, 지지부는 컨트롤 볼이 외력에 의해서 3차원 이동 또는 일정 범위 내에서 수평 이동하도록 지지한다. 또한, 지지부는 외력이 제거된 상태에서는 컨트롤 볼이 초기 위치로 복원할 수 있도록 구현된다. 일 실시 예에 의한 지지부는 플레이트, 복수의 지지대들(1211,1212,1213) 및 와이어들 (1221,1222,1223)를 포함한다. 플레이트는 컨트롤러의 전반적인 구성들이 결합되거나 배치되는 공간을 제공한다. 예를 들어, 플 레이트는 지지대들(1211,1212,1213) 및 컨트롤 박스가 결합되는 공간을 제공한다. 지지대들(1211,1212,1213)는 플레이트에서 일정한 간격을 두고 이격되어 배치되고, 지지대들 (1211,1212,1213) 각각은 와이어들(1221,1222,1223) 중 어느 하나와 연결된다. 지지대는 2개 이상으로 배치될 수 있다. 지지대의 개수가 많으면 컨트롤 볼이 일정한 위치를 유지하는 데에 유리하지만, 컨트롤 볼 의 제어가 불편하고 컨트롤 볼을 제어하는 데이 조종자의 힘이 더 많이 소요될 수 있다. 따라서, 구조적으로 안정을 유지하면서 컨트롤 볼의 제어를 수월하게 하기 위해서, 지지대의 개수는 3개로 이루어 지고, 각각의 지지대들(1211,1212,1213)은 정삼각형의 꼭지점에 해당하는 위치에 배치될 수 있다. 제1 와이어는 제1 지지대와 컨트롤 볼을 연결한다. 제2 와이어는 제2 지지대 와 컨트롤 볼을 연결하고, 제3 와이어는 제3 지지대와 컨트롤 볼을 연결한다. 와이어 들(1221,1222,1223)은 탄성 물질로 이루어져서, 컨트롤 볼은 외력에 의해서 회전 및 위치 이동을 할 수 있다. 그리고, 와이어(1221,1222,1223)들은 외력이 제거된 경우 복원력을 이용하여 컨트롤 볼을 초기 위 치로 복구시킬 수 있다. 또한, 보조 센서부는 와이어들(1221,1222,1223)의 장력을 센싱하기 위한 압력 센서를 포함할 수 있고, 압 력 센서는 지지대(1211,1212,1213)에 탑재될 수 있다. 압력 센서는 컨트롤 볼의 회전 및 위치 이동에 따라 와 이어들(1221,1222,1223)의 장력 변화를 센싱한다. 컨트롤 박스는 디스플레이, 제어 모듈, 통신 모듈을 포함한다. 디스플레이는 컨트롤 박스의 일면에 위치하고, 무인 비행 로봇의 짐벌이 획득하는 영상 또는 무인 비행 로봇의 동작 및 제어 상황을 표시할 수 있다.제어 모듈은 컨트롤 볼에 탑재된 센서들의 움직임에 대응하여 제어신호를 생성한다. 제어신호는 컨트롤 볼의 이동 방향과 동일하게 무인 비행 로봇이 이동하도록 무인 비행 로봇의 모터부(1 2)를 제어한다. 또한, 제어신호는 컨트롤 볼의 회전과 동일한 방향으로 무인 비행 로봇이 회전하도 록 무인 비행 로봇의 모터부를 제어한다. 제어신호를 생성하기 위해서, 제어 모듈은 컨트롤 볼 에 탑재된 3축 가속도 센서, 자이로 센서 및 지자기 센서의 센싱 결과를 이용할 수 있고, 또한, 지지대들 (1211,1212,1213)에 탑재된 압력 센서의 센싱 결과를 이용할 수도 있다. 통신 모듈은 제어 모듈이 생성한 제어신호를 무인 비행 로봇의 드론 통신부로 전송한다. 이하, 컨트롤러를 이용한 무인 비행 로봇의 제어방법을 살펴보면 다음과 같다. 컨트롤 볼을 이용한 무인 비행 로봇의 제어방법 도 7 및 도 8은 컨트롤을 이용하여 무인 비행 로봇의 수평 이동을 제어하는 방법을 설명하는 도면이다. 도 7을 참조하면, 컨트롤러는 지표면과 평행한 평면에서 수평으로 이동할 수 있다. 컨트롤 볼이 이동하는 경우 제1 내지 제3 와이어들(1221,1222,1223)은 장력 변화가 발생하고, 압력 센서 는 장력 변화를 감지할 수 있다. 이때, 컨트롤 볼의 이동 방향에 따라 제1 내지 제3 와이어들 (1221,1222,1223) 각각의 장력 변화 크기는 달라진다. 예를 들어, 조작자를 중심으로 컨트롤 볼이 전방 방향(forward)으로 이동할 경우, 제2 및 제3 와이어들 (1222,1223)은 동일한 수준으로 장력 변화가 발생한다. 이에 대응하여, 제어 모듈은 무인 비행 로봇 을 전방으로 이동시키기 위한 제어신호를 생성한다. 컨트롤 볼이 우측 방향(right)으로 이동시에, 제3 와이어는 비교적 큰 장력 변화를 갖고, 제1 및 제3 와이어들(1221,1222,1223)은 비교적 작은 장력 변화를 갖는다. 이에 대응하여, 제어 모듈은 무인 비 행 로봇을 우측으로 이동시키기 위한 제어신호를 생성한다. 컨트롤 볼이 후방 방향(backward)으로 이동시에, 제1 와이어는 큰 장력 변화를 갖고, 제2 및 제3 와이어들(1222,1223)은 동일한 수준에서 작은 장력 변화를 갖는다. 이에 대응하여, 제어 모듈은 무인 비 행 로봇을 후방으로 이동시키기 위한 제어신호를 생성한다. 컨트롤 볼이 좌측 방향(left)으로 이동시에, 제2 와이어는 비교적 큰 장력 변화를 갖고, 제1 및 제 2 와이어들(1221,1222)은 작은 장력 변화를 갖는다. 이에 대응하여, 제어 모듈은 무인 비행 로봇을 좌측으로 이동시키기 위한 제어신호를 생성한다. 또는, 컨트롤 볼은 평면상에서의 위치 이동을 감지할 수 있는 가속도 센서를 포함하고, 제어 모듈 은 가속도 센서의 센싱 결과를 바탕으로 컨트롤 볼의 이동을 감지할 수도 있다. 상술한 바와 같이 외력, 즉 조종자에 의해서 수평 이동한 컨트롤 볼은 와이어들(1221,1222,1223)의 복원 력에 의해서 초기 위치로 복귀한다. 제어 모듈은 컨트롤 볼이 복귀하는 과정에서 발생하는 위치 이동에 한해서만 제어신호를 생성한다. 이를 도 8을 참조하여 살펴보면 다음과 같다. 도 8은 외력 및 복원력에 의해서 컨트롤 볼의 이동 및 제어신호의 생성 기간을 설명하는 도면이다. 도 8의 (a)는 외력이 가해지지 않는 상태에서 컨트롤 볼의 위치를 나타내는 도면이다. 도 8의 (a)에서와 같이, 외력이 가해지지 않은 상태에서, 컨트롤 볼의 지지대들(1211,1212,1213)의 정중앙에 해당하는 초기 위치 를 유지한다. 도 8의 (b)는 외력이 가해진 상태에서 컨트롤 볼의 위치를 나타내는 도면이다. 도 8의 (b)에서와 같이, 외력에 의해서 컨트롤 볼이 이동할 때, 제어 모듈은 앞서 설명한 바와 같이 위치 변화에 대응하여 제어신 호를 생성할 수 있다. 도 8의 (c)는 외력에 의해서 이동한 컨트롤 볼이 원래 위치로 복원하는 것을 나타내는 도면이다. 도 8의 (c)에 서와 같이, 외력이 제거되어 컨트롤 볼이 복귀되는 경우, 제어 모듈은 제어신호를 생성하지 않는다. 컨트롤 볼이 초기 위치로 복귀하는 과정은 조작자의 제어 의지가 없는 경우로 판단할 수 있기때문이다. 도 9는 컨트롤 볼을 이용하여 무인 비행 로봇의 수직 이동을 제어하는 방법을 설명하는 도면이다. 도 9를 참조하면, 컨트롤 볼이 수직 방향으로 상승(up)할 경우, 제1 내지 제3 와이어들(1221,1222,1223) 은 상부 방향을 향해서 동일한 수준의 크기로 신장된다. 압력 센서는 제1 내지 제3 와이어들(1221,1222,1223) 이 상부 방향으로 동일한 수준의 크기로 장력이 변하는 것을 감지한다. 제어 모듈은 압력 센서의 장력 변화에 대응하여, 무인 비행 로봇을 수직 이동시키기 위한 제어신호를 생성할 수 있다. 컨트롤 볼이 수직 방향으로 하강(down)할 경우, 제1 내지 제3 와이어들(1221,1222,1223)은 하부 방향을 향해서 동일한 수준의 크기로 신장된다. 압력 센서는 제1 내지 제3 와이어들(1221,1222,1223)이 하부 방향으로 동일한 수준의 크기로 장력이 변하는 것을 감지한다. 제어 모듈은 압력 센서의 장력 변화에 대응하여, 무인 비행 로봇을 수직 이동시키기 위한 제어신호 를 생성할 수 있다. 도 9에 도시된 실시 예에서도, 제어 모듈은 컨트롤 볼이 초기 위치를 벗어나는 경우에 한해서 제어 신호를 생성하고, 초기 위치로 복귀하는 동안에는 제어신호를 생성하지 않을 수 있다. 도 10은 컨트롤 볼을 이용한 무인 비행 로봇의 회전을 제어하는 방법을 설명하는 도면이다. 도 10을 참조하면, 컨트롤 볼은 3차원 상에서 위치 이동을 하지 않고, 일정 반경 회전할 수 있다. 컨트롤 볼이 회전하는 경우, 3축 가속도 센서는 3축 가속도 변화를 센싱하고, 이를 바탕으로 컨트 롤 볼의 롤(roll) 및 피치(pitch)를 획득할 수 있다. 또한, 3축 가속도 센서와 결부하여 자이로 센서 또는 지자기 센서를 이용하여 요(yaw)를 획득할 수 있다. 결국, 컨트롤 볼에 탑재된 센서들은 컨트롤 볼의 회전 방향 및 회전량을 획득할 수 있다. 제어 모듈은 컨트롤 볼의 회전 방향 및 회전량과 동일하게 무인 비행 로봇이 회전하도록 제어 신호를 생성할 수 있다. 또한 제어 모듈은 단위 시간 동안 무인 비행 로봇의 롤 및 피치 변화량이, 단위 시간 동안 컨트롤 볼의 롤 및 피치 변화량에 비례하도록 제어신호를 생성할 수 있다. 즉, 제어 모듈은 컨트롤 볼 의 회전하는 속도에 비례하도록 무인 비행 로봇의 회전속도를 제어할 수 있다. 제어 모듈은 압력센서의 변화가 있을 경우에 한해서, 회전을 제어하기 위한 제어신호를 생성한다. 이는 컨트롤러 자체가 기울어짐으로 인해서 조작자의 의도와는 상관없이 무인 비행 로봇의 회전을 제어하 는 제어신호가 생성되는 것을 방지하기 위한 것이다. 도 11은 짐벌 조이스틱을 이용한 짐벌 제어를 설명하는 도면이다. 도 11을 참조하면, 플레이트의 일면, 예를 들어 하부면에는 짐벌 조이스틱이 형성될 수 있다. 짐벌 조이스틱은 서로 수직인 제1 방향 또는 제2 방향으로 이동할 수 있다. 짐벌 조이스틱의 제1 방향으로의 이동에 따라, 제어 모듈은 z축 구동부의 회전을 제어하는 제어신호를 생성한다. 짐벌 조이스틱의 제2 방향으로의 이동에 따라, 제어 모듈은 XY축 구동부의 회전을 제어하는 제어 신호를 생성한다. 조작자는 짐벌 조이스틱을 이용하여 보다 직관적으로 짐벌을 제어할 수 있다. 도 12는 인디케이터의 실시 예를 나타내는 도면이다. 도 12를 참조하면, 인디케이터는 좌표 알림부, 짐벌 헤딩 표시부 및 드론 헤딩 표시부를 포 함한다. 드론 헤딩 표시부는 무인 비행 로봇의 헤딩(heading) 방향을 표시한다. 무인 비행 로봇의 헤딩 방향은 무인 비행 로봇이 비행하는 방향을 지칭한다. 짐벌 헤딩 표시부는 짐벌의 헤딩 (heading) 방향을 표시한다. 짐벌의 헤딩 방향은 짐벌이 촬영하는 방향을 지칭한다. 좌표 알림부는 컨트롤러가 절대 좌표 기반으로 제어되는지, 또는 상대 좌표 기반으로 제어되는지를 표시한다. 도 13 및 도 14는 컨트롤러의 좌표변환을 설명하는 도면이다. 제어 모듈은 좌표 모드를 선택적으로 설정할 수 있고, 좌표 모드를 선택하기 위한 버튼(미도시)은 컨트롤 볼 또는 지지부의 일부에 형성될 수 있다. 도 13은 무인 비행 로봇이 절대 좌표 모드일 경우의 제어방법을 설명하는 도면이다. 도 13을 참조하면, 좌표 모드가 절대 좌표 모드일 경우, 제어 모듈은, 컨트롤러의 방향에 상관없이, 컨트롤 볼의 3축이 지구고정좌표에 매칭된 것으로 간주한다. 따라서, 컨트롤러가 향하 는 방향에 상관없이 컨트롤 볼이 외력(F)에 의해서 이동하는 방향의 절대 위치에 따라 제어신호가 생성된 다. 예를 들면, 도 13의 (a)에서와 같이, 컨트롤 볼이 북(North)으로 이동하면, 제어 모듈은 무인 비행 로봇을 북 방향으로 이동시키도록 제어신호를 생성한다. 또는, 도 13의 (b)에서와 같이, 컨트롤 볼(110 0)이 동(east)으로 이동하면, 무인 비행 로봇의 헤딩 방향에 상관없이, 제어 모듈은 무인 비행 로봇 을 동측 방향으로 이동시키도록 제어신호를 생성한다. 이와 유사하게, 도 13의 (c)에서와 같이, 컨트롤 볼이 북동(northeast) 방향으로 이동하면, 제어 모듈은 무인 비행 로봇을 북동 방향으로 이동 시키도록 제어신호를 생성하고, 도 13의 (d)에서와 같이, 컨트롤 볼이 남서(southwest) 방향으로 이동하 면, 제어 모듈은 무인 비행 로봇을 남서 방향으로 이동시키도록 제어신호를 생성한다. 또한, 도 13 의 (e)에서와 같이, 컨트롤 볼이 서(west)로 이동하면, 제어 모듈은 무인 비행 로봇을 서 방 향으로 이동시키도록 제어신호를 생성하고, 도 13의 (f)에서와 같이, 컨트롤 볼이 남(south)으로 이동하 면, 제어 모듈은 무인 비행 로봇을 남 방향으로 이동시키도록 제어신호를 생성한다. 도 14는 무인 비행 로봇이 상대 좌표 모드일 경우의 제어방법을 설명하는 도면이다. 도 14를 참조하면, 좌표 모드가 상대 좌표 모드일 경우에, 제어 모듈은 컨트롤 볼의 3축이 컨트롤 러에 매칭된 것으로 간주하여 제어신호를 생성한다 따라서, 컨트롤 볼이 외력(F)에 의해서 이동하는 방위에 상관없이, 컨트롤러 내에서의 방향에 대응 하여 제어신호가 생성된다. 예를 들면, 도 13의 (a)에서와 같이, 컨트롤 볼이 지구의 방위상에서 북(North)이나 남서(southwest)으로 이동할지라도, 컨트롤러의 전방 방향으로 이동하는 것이라면, 제어 모듈은 무인 비행 로봇이 전방 방향으로 진행하도록 제어신호를 생성한다. 마찬가지로, 도 13의 (b) 또는 도 13의 (c)에서와 같이, 컨트롤 볼이 이동하는 방위에 상관없이 컨트롤러 의 전방 방향으로 이동한다면, 제어 모듈은 무인 비행 로봇이 전방 방향으로 진행하도록 제어 신호를 생성할 수 있다. 컨트롤러의 방향성은 미리 설정되어, 컨트롤러의 일측에 표시될 수 있다. 예를 들면, 도면에서와 같이, 컨트롤러에는 컨트롤러의 전방 방향을 표시하는 마크(PM)가 형성될 수 있다. 무인 비행 로봇의 전방 방향은 미리 설정된 것으로, 예를 들어 짐벌이 배치된 위치에 해당할 수 있고, 또는 무인 비행 로봇은 방향성을 구분하기 위한 표식을 포함할 수 있다. 도 15 내지 도 17은 본 발명의 다른 실시 예에 따른 컨트롤러를 나타내는 도면이다. 도 15 내지 도 17을 참조하면, 다른 실시 예에 따른 컨트롤러는 컨트롤 볼, 핸들 형태의 프레임 (HD), 고정 연결부(BC), 제1 링크(L1)들, 제2 링크(L2)들 및 엔코더(EC)들을 포함한다. 전술한 실시 예와 마찬가지로, 컨트롤 볼은 무인 비행 로봇에 탑재된 센서들을 포함할 수 있다. 즉, 컨트롤 볼은 3축 가속도 센서, 자이로 센서, 지자기 센서 등을 포함할 수 있다. 컨트롤 볼은 센서들을 이용하여, 자체의 롤(roll), 피치(pitch) 및 요(yaw)를 획득할 수 있다. 고정 연결부(BC)는 컨트롤 볼에 고정되어서, 컨트롤 볼의 움직임과 동일하게 움직인다. 고정 연결 부(BC)는 제1 고정 지지대(B1)들, 제2 고정 지지대(B2)들 및 클립(CL)들을 포함한다. 제1 고정 지지대(B1)는 컨트롤 볼에 고정되어서, 컨트롤 볼의 움직임에 따라 움직인다. 제1 고정 지지대(B1)는 복수 개가 형성되고, 각각의 제1 고정 지지대(B1)는 하나의 평면상에서 서로 동일한 간격으로 이 격된다. 클립(CL)들 각각은 제1 고정 지지대(B1)들과 일대일로 연결되고, 제1 고정 지지대(B1)의 움직임에 따라 움직인 다. 제2 고정 지지대(B2)는 인접하는 클립(CL)들을 고정시킨다. 링크부는 고정 연결부(BC)와 엔코더(EC)을 연결하며, 컨트롤 볼과 직접 연결된 고정 연결부(BC)가 외력을 받지 않는 상태에서 일정한 위치를 유지하도록 한다. 링크부는 제1 링크(L1)들 및 제2 링크(L2)들을 포함한다. 제1 링크(L1)는 클립(CL)과 직접 연결되며, 클립(C L)의 움직임에 따라 클립(CL)과 연결된 지점을 중심으로 일정 반경 범위 내에서 움직임을 갖는다. 제2 링크 (L2)의 일단은 일정 반경 회전가능하도록 제1 링크(L1)와 연결되고, 타단은 엔코더(EC)와 연결된다. 엔코더(EC)는 프레임(HD)에 배치되고, 제2 링크(L2)와 일대일로 연결된다. 엔코더(EC)는 제2 링크(L2)의 회전 각을 검출한다. 제어 모듈은 엔코더(EC)들의 회전각을 바탕으로 제어신호를 생성한다. 예를 들어, 컨트롤 볼이 이 동하는 방향에 따라 제1 및 제2 링크들(L1,L2) 간의 사잇각은 달라지고, 제2 링크(L2)들 각각의 회전각도 달라 진다. 제어 모듈은 제2 링크(L2)들 각각의 회전각을 바탕으로 컨트롤 볼의 이동 방향을 검출하고, 이에 대응하는 제어신호를 생성할 수 있다. 또한, 컨트롤 볼에 탑재된 센서들을 이용하여 무인 비행 로봇의 회전 동작을 제어하는 과정에서, 제 어 모듈은 엔코더(EC)들에서 검출한 제2 링크(L2)들의 회전각이 변할 경우에 한해서, 회전을 제어하기 위 한 제어신호를 생성한다. 이는 컨트롤러 자체가 기울어짐으로 인해서 조작자의 의도와는 상관없이 무인 비행 로봇의 회전을 제어하는 제어신호가 생성되는 것을 방지하기 위한 것이다. 도면에는 도시하지 않았지만, 프레임(HD)에는 도 5에 도시된 컨트롤러와 마찬가지로 디스플레이, 조작부, 및 인 디케이터 등이 결합될 수 있다. 본 명세서에 기재된 구성들은 모든 면에서 제한적으로 해석되어서는 아니되고 예시 적인 것으로 고려되어야 한 다. 본 발명의 범위는 첨부된 청구항의 합리적 해석에 의해 결정되어야 하고, 본 발명의 등가적 범위 내에서의 모든 변경은 본 발명의 범위에 포함된다."}
{"patent_id": "10-2019-0103218", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 무인 비행 로봇을 도시한 사시도이다. 도 2는 도 1의 무인 비행 로봇의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 3은 본 발명의 일 실시예에 따른 항공 제어 시스템의 주요 구성들 간의 제어관계를 도시한 블록도이다. 도 4는 본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러의 구성을 나타내는 블록도이다. 도 5는 본 발명의 실시 예에 따른 무인 비행 로봇의 컨트롤러를 나타내는 사시도이다. 도 6은 컨트롤 볼의 롤(roll), 피치(pitch) 및 요(yaw)를 설명하는 도면이다. 도 7 및 도 8은 컨트롤을 이용하여 무인 비행 로봇의 수평 이동을 제어하는 방법을 설명하는 도면이다. 도 9는 컨트롤 볼을 이용하여 무인 비행 로봇의 수직 이동을 제어하는 방법을 설명하는 도면이다. 도 10은 컨트롤 볼을 이용한 무인 비행 로봇의 회전을 제어하는 방법을 설명하는 도면이다. 도 11은 짐벌 조이스틱을 이용한 짐벌 제어를 설명하는 도면이다. 도 12는 인디케이터의 실시 예를 나타내는 도면이다. 도 13 및 도 14는 컨트롤러의 좌표변환을 설명하는 도면이다. 도 15 내지 도 17은 본 발명의 다른 실시 예에 따른 컨트롤러를 나타내는 도면이다."}
