{"patent_id": "10-2022-0031051", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0122491", "출원번호": "10-2022-0031051", "발명의 명칭": "하드웨어 자원을 관리하는 전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "조현아"}}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치의 동작 방법에 있어서,제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수개의 물리 채널 별 무선 자원 할당 정보를 확인하는 동작;상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작;상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가용 연산량을 확인 하는 동작; 및상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1 항에 있어서,상기 제 1 슬롯 내의 상기 복수 개의 물리 채널 별 무선 자원 할당 정보는, 상기 복수 개의 물리 채널 별 RB의개수 및/또는 심볼의 개수를 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2 항에 있어서,상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작은,상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수를 이용하는 계산을 수행함에 기반하여 상기 복수개의 물리 채널 별 예측 연산량들 각각을 확인하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 2 항에 있어서,상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작은,상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수 및, 과거의 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수와 연산량 사이의 연관 정보를 이용하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1 항에 있어서,상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작은, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보 및 적어도 하나의 추가 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하고,상기 적어도 하나의 추가 정보는, 상기 복수 개의 물리 채널의 송신 및/또는 수신에 이용되는 안테나의 개수,상기 복수 개의 물리 채널의 레이어의 수, 또는 상기 전자 장치에 연결된 사용자 장치의 개수 중 적어도 하나를포함하는 전자 장치의 동작 방법.공개특허 10-2023-0122491-3-청구항 6 제 1 항에 있어서,상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작은,상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에할당하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1 항에 있어서,상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작은,상기 복수 개의 물리 채널 별 예측 연산량에 기반하여 상기 복수 개의 물리 채널 별 레이튼시들을 확인하는 동작; 및상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상기 상기 복수개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 7 항에 있어서,상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상기 상기 복수개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작은,상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록 하는 복수 개의 할당 정책들을 확인하는 동작; 및상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들중 하나를 선택하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 8 항에 있어서,상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들중 하나를 선택하는 동작은,상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 상기 하나를 선택하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 9 항에 있어서,상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들중 하나를 선택하는 동작은,상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 상기 하나를 선택하는 전자 장치의 동작 방법.공개특허 10-2023-0122491-4-청구항 11 제 10 항에 있어서,상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들중 하나를 선택하는 동작은,상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 최소 하드웨어 자원을 이용하는 할당 정책을 선택하는 전자장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 10 항에 있어서,상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들중 하나를 선택하는 동작은,상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 지정된 물리 채널의 레이튼시가 최소인 할당 정책을 선택하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "전자 장치에 있어서,메모리; 및상기 메모리에 작동적으로 연결된 적어도 하나의 프로세서를 포함하고,상기 메모리는, 실행시에, 상기 적어도 하나의 프로세서로 하여금:제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수개의 물리 채널 별 무선 자원 할당 정보를 확인하고,상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하고,상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가용 연산량을 확인하고,상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하도록야기하는 적어도 하나의 인스트럭션을 저장하는 전자 장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13 항에 있어서,상기 제 1 슬롯 내의 상기 복수 개의 물리 채널 별 무선 자원 할당 정보는, 상기 복수 개의 물리 채널 별 RB의개수 및/또는 심볼의 개수를 포함하는 전자 장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 14 항에 있어서,상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 물리 채널별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작의 적어도 일부로서, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수를 이용하는 계산을 수행함에 기반하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하도록 야기하는 전자 장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "공개특허 10-2023-0122491-5-제 14 항에 있어서,상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 물리 채널별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작의 적어도 일부로서, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수 및, 과거의 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수와 연산량 사이의 연관 정보를 이용하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하도록 야기하는 전자 장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 13 항에 있어서,상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 하드웨어자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작의 적어도 일부로서, 상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하도록 야기하는 전자장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13 항에 있어서,상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 하드웨어자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작의 적어도 일부로서,상기 복수 개의 물리 채널 별 예측 연산량에 기반하여 상기 복수 개의 물리 채널 별 레이튼시들을 확인하고,상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상기 상기 복수개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하도록 야기하는 전자 장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제 18 항에 있어서,상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 하드웨어자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상기 상기 복수 개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작의 적어도 일부로서,상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록 하는 복수 개의 할당 정책들을 확인하고,상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들중 하나를 선택하도록 야기하는 전자 장치."}
{"patent_id": "10-2022-0031051", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "전자 장치의 동작 방법에 있어서,제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 제 1물리 채널의 제 1 무선 자원 할당량 및 제 2 물리 채널의 제 2 무선 자원 할당량을 확인하는 동작;상기 제 1 무선 자원 할당량 및 상기 제 2 무선 자원 할당량에 대응하는 연산을 상기 전자 장치에 의하여 지원되는 제 1 하드웨어 자원에 의하여 수행 가능한 경우, 상기 제 1 물리 채널 및 상기 제 2 물리 채널을 상기 제1 하드웨어 자원에 할당 하는 동작; 및상기 제 1 무선 자원 할당량 및 상기 제 2 자원 무선 할당량에 대응하는 연산을 상기 전자 장치에 의하여 지원되는 상기 제 1 하드웨어 자원에 의하여 수행 불가능한 경우, 상기 제 1 물리 채널 또는 상기 제 2 물리 채널공개특허 10-2023-0122491-6-중 하나의 물리 채널을 상기 제 1 하드웨어 자원에 할당하고, 나머지 채널을 상기 제 1 하드웨어 자원과 상이한제 2 하드웨어 자원에 할당하는 동작을 포함하는 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플 레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인하는 동작, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각 각을 확인하는 동작, 상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가용 연산량을 확인 하는 동작, 및 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하 여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작을 포함할 수 있 다. 그 밖의 다양한 실시예가 가능하다."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예는 네트워크의 라디오 유닛과의 인터랙션을 위한 하드웨어 자원을 관리하는 전자 장치 및 그 동작 방법에 관한 것이다."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "기존의 기지국(base station)은 기지국의 데이터 처리부(distributed unit, DU)와 무선 송수신부(radio unit 또는 remote unit, RU)가 함께 셀 사이트에 설치되는 형태로 구현되었다. 하지만, 이러한 일체형 구현 형태는 물리적 제약을 가진다. 예를 들어, 서비스 가입자 또는 트래픽의 증가에 따라, 사업자는 새롭게 셀 사이트에 기지국을 구축하여야 한다. 이를 극복하고자, C-RAN(centralized RAN(radio access network) 또는 cloud RAN) 구조가 구현되었다. C-RAN은 DU를 하나의 물리적 장소에 배치하고, 실제 사용자 장치(user equipment, UE)와 무선 신호를 송수신하는 셀 사이트에는 RU를 배치하는 구조를 가질 수 있다. DU 및 RU는 광케이블 또는 동축 케이블로 연결될 수 있다. RU 및 DU가 분리되면서 이들간의 통신을 위한 인터페이스 규격이 필요하였으며, CPRI (Common Public Radio Interface) 등의 규격이 RU와 DU간에 사용되고 있다. 3GPP (3rd Generation Partnership Project)에서도 기지국 구조가 규격화되고 있으며, 5G 시스템에 적용될 수 있는 개방형 네트워크 표준인 O-RAN(Open Radio Access Network)에 대한 논의가 진행되고 있다. O-RAN은 기존의 3GPP NE인 RU, DU, CU-CP(central unit-control plane), CU-UP(central unit-user plane)를 각각 O-RU, O-DU, O-CU-CP, O-CU- UP라고 새로이 정의하고(이를 통합해서 O-RAN 기지국이라 칭할 수 있다), 그 외 추가로 RIC (RAN Intelligent Controller) 와 NRT-RIC(non-real-time RAN Intelligent Controller)를 제안하였다."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "C-RAN 환경에서는, 제한적인 하드웨어 자원을 여러 컨테이너들이 공유할 수 있다. 이 경우, RU 및 DU 사이의 트래픽을 고려하지 않고 하드웨어 자원을 고정적으로 컨테이너들에게 할당하는 경우, 실시간 변경되는 트래픽에 따라 하드웨어 자원이 비효율적으로 이용될 가능성이 존재할 수 있다. 특히, 매 슬롯 마다 물리 채널별 트래픽 이 변경될 수 있으며, 이 경우 고정적인 하드웨어 자원 할당의 방식은 비효율적일 수 있다. 다양한 실시예에 따른 전자 장치 및 그 동작 방법은, 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반한 예 측 연산량 및 하드웨어 자원 별 가용 연산량에 기반하여, 복수 개의 물리 채널을 하드웨어 자원에 할당할 수 있 다."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플 레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인하는 동작, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각 각을 확인하는 동작, 상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가용 연산량을 확인 하는 동작, 및 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하 여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작을 포함할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 메모리 및 상기 메모리에 작동적으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 메모리는, 실행시에, 상기 적어도 하나의 프로세서로 하여금, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인하고, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별예측 연산량들 각각을 확인하고, 상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가용 연산량을 확인하고, 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반 하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하도록 야기하는 적어 도 하나의 인스트럭션을 저장할 수 있다. 다양한 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플 레인 메시지에 기반하여, 상기 제 1 슬롯 내의 제 1 물리 채널의 제 1 무선 자원 할당량 및 제 2 물리 채널의 제 2 무선 자원 할당량을 확인하는 동작, 상기 제 1 무선 자원 할당량 및 상기 제 2 무선 자원 할당량에 대응하 는 연산을 상기 전자 장치에 의하여 지원되는 제 1 하드웨어 자원에 의하여 수행 가능한 경우, 상기 제 1 물리 채널 및 상기 제 2 물리 채널을 상기 제 1 하드웨어 자원에 할당 하는 동작, 및 상기 제 1 무선 자원 할당량 및 상기 제 2 자원 무선 할당량에 대응하는 연산을 상기 전자 장치에 의하여 지원되는 상기 제 1 하드웨어 자원에 의하여 수행 불가능한 경우, 상기 제 1 물리 채널 또는 상기 제 2 물리 채널 중 하나의 물리 채널을 상기 제 1 하드웨어 자원에 할당하고, 나머지 채널을 상기 제 1 하드웨어 자원과 상이한 제 2 하드웨어 자원에 할당하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예에 따라서, 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반한 예측 연산량 및 하드웨어 자원 별 가용 연산량에 기반하여, 복수 개의 물리 채널을 하드웨어 자원에 할당할 수 있는, 전자 장치 및 그 동작 방 법이 제공될 수 있다."}
{"patent_id": "10-2022-0031051", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1a는 다양한 실시예에 따른 RIC, RAN 및 코어 네트워크(core network, CN)를 설명하기 위한 블록도를 도시한 다. 다양한 실시예에 따라서, RAN은 적어도 하나의 DU(distributed unit), 적어도 하나의 CU-CP(central unit-control plane), 또는 적어도 하나의 CU-UP(central unit-user plane) 중 적어도 하나를 포함 할 수 있다. RAN은 적어도 하나의 RU(remote unit, 또는 radio unit)에 연결되는 것과 같이 도시되어 있지만, 이는 예시적인 것으로 적어도 하나의 RU는, RAN에 연결되거나, 또는 RAN에 포함될 수 있다. RAN은, C-RAN 또는 O-RANN일 수도 있으며, 만약 O-RAN인 경우에는, DU는 O-DU일 수 있으 며, CU-CP는 O-CU-CP일 수 있으며, CU-UP는 O-CU-UP일 수 있으며, RU는 O-RU일 수 있다. 다양한 실시예에 따라서, RU는, 사용자 장치(user equipment, UE)와 통신을 수행할 수 있다. RU는, 하위 물리 계층(low-PHY) 기능 및 RF 프로세싱을 제공하는 논리적 노드일 수 있다. DU는 RLC, MAC, 상위 물리 계층(high-PHY)의 기능을 제공하는 논리적 노드일 수 있으며, 예를 들어 RU와 연결될 수 있다. CU(152,153)는 RRC(radio resource control), SDAP(service data adaptation protocol), PDCP(packet data convergence protocol) 프로토콜의 기능을 제공하는 논리적 노드일 수 있다. CU-CP는 RRC 및 PDCP의 제어 평면 부분의 기능을 제공하는 논리적 노드일 수 있다. CU-UP는 SDAP 및 PDCP의 사용 자 평면 부분의 기능을 제공하는 논리적 노드일 수 있다. 다양한 실시예에 따라서, 코어 네트워크(예를 들어, 5GC 5th generation core)는, AMF(access and mobility management function) , UPF(User plane Function), 또는 SMF(Session Management Function) 중 적어도 하나를 포함할 수 있다. AMF는 UE 단위의 접속 및 이동성 관리를 위한 기능을 제공할 수 있다. SMF는 세션 관리 기능을 제공할 수 있다. UPF는 데이터 네트워크로부터 수 신한 하향링크 데이터를 UE에게 전달하거나, 또는 UE로부터 수신한 상향링크 데이터를 데이터 네트워 크로 전달할 수 있다. 예를 들어, CU-CP는 AMF와 N2 인터페이스(또는, NGAP 인터페이스)로 연결될 수 있다. AMF는 SMF와 N11 인터페이스로 연결될 수 있다. CU-UP는 UPF와 N3 인터페이스 로 연결될 수 있다. 다양한 실시예에 따라, RIC는, 서비스 또는 지역적 자원 최적화(regional resource optimization)를 위한 RAN 기능성(functionality)을 커스터마이징할 수 있다. RIC은 망 지능화(network intelligence)(예: 정 책 강제(policy enforcement), 핸드 오버 최적화(handover optimization)), 자원 보증(resource assurance)(예: 무선 링크 관리(radio-link management), 개선된 SON(advanced self-organized-network)), 자 원 제어(resource control)(예: 부하 균형(load balancing), 또는 슬라이싱 정책(slicing policy)) 중 적어도 하나의 기능을 제공할 수 있으며, RIC가 제공 가능한 RAN과 연관된 기능(또는, 수행되는 동작)에는 제한이 없다. 다양한 실시예에 따라, RIC는, RAN과 E2 메시지 (191,192)를 송신 및/또는 수신할 수 있다. 예를 들어, RIC는 DU와 E2-DU 인터페이스로 연결될 수 있다. 예를 들어, RIC는 CU-CP와 E2-CP 인터페이스로 연결될 수 있다. 예를 들어, RIC는 CU-UP와 E2-UP 인터페이스로 연결될 수 있다. RIC와 RAN과의 적어도 하나의 인터페이스를 E2 인터페이스로 명명할 수도 있다. 한편, RIC는 RAN과 별도의 장치인 것과 같이 도시되어 있지만, 이는 예시적인 것으로 RIC는 RAN과 별도의 장 치로도 구현이 가능하며, 또는 하나의 장치로도 구현이 가능할 수도 있다. 다양한 실시예에 따라서, RIC는 E2 노드(node)(예를 들어, DU, CU-CP, 또는 CU-UP 중 적 어도 하나)는 E2 메시지(191,192)를 송신 및/또는 수신할 수 있다. E2 노드는 E2 노드 기능(E2 노드 function)을 포함(또는, 제공)할 수 있다. E2 노드 기능은 RIC에 설치된 특정 xApp(application S/W)에 기반하여 설정될 수 있다. 만약, KPI 모니터(monitor)의 기능이 제공되는 경우에는, RIC에 KPI 모니터 수 집 S/W가 설치될 수 있다. E2 노드는 KPI 파라미터들을 생성할 수 있으며, KPI 파라미터를 포함하는 E2 메시지 를 RIC에 위치한 E2 종단(termination) 기능에 전달하는 E2 노드 기능을 포함할 수 있다. RIC 에 위치한 E2 종단 기능은 E2 메시지에 대한 RIC의 종단으로서, E2 노드가 전달한 E2 메시지를 해석한 후, xApp에게 전달할 수 있다. RIC는, RAN의 동작과 연관된 정보를 E2 메시지로 RAN에 제공 할 수 있다. RIC는, xAPP을 디플로이할 수 있으며, RIC에 디플로이된 xAPP은 E2 노드를 구독할 수 있다. xAPP은, 구독한 E2 노드로부터 주기적 또는 비주기적으로 E2 메시지를 수신할 수 있다. 한편, 본 개시 에서의 RIC에 의하여 수행되는 동작들 중 적어도 일부는, 디플로이된 xApp에 의하여 수행되는 것으로 이해 될 수 있다. xAPP은 디플로이된 이후 본 개시에서의 RIC에 의하여 수행되는 동작들 중 적어도 일부를 수 행하도록 하는 적어도 하나의 인스트럭션을 포함할 수 있다. 또는, 본 개시에서의 전자 장치에 의하여 수행되 는 동작은, RIC에 의하여 수행되거나, 및/또는 RAN(예를 들어, DU)에 의하여 수행될 수 있다. 도 1b는, 다양한 실시예에 따른 전자 장치의 하드웨어적 구성을 설명하기 위한 블록도를 도시한다. 다양한 실시예에 따라서, 전자 장치는, 프로세서, 저장 장치, 또는 통신 모듈 중 적어도 하나를 포함할 수 있다. 하나의 예에서, 전자 장치는, 예를 들어 RAN(또는, DU)의 동작을 수행하도록 설정되거나, 또는 동작을 수행하기 위한 적어도 하나의 인스트럭션을 저장할 수 있다. 이 경우, 전자 장치는, C-RAN 환경, 또는 O-RAN 환경에서의 DU의 동작을 수행하기 위한(또는, DU와 연관되는 어플리케이션, 또는 DU와 연관되는 Pod를 실행하기 위한) 장치(또는, 시스템)일 수 있다. 전자 장치(10 2)는, 예를 들어 쿠버네티스(Kubernetes) 오케스트레이션(orchestration) 상에서 DU와 연관되는 어플리케 이션(또는, Pod)를 컨테이너(또는, 가상머신)을 실행할 수 있으나, 그 실행 형태에는 제한이 없다. 다른 예에 서, 예를 들어 RIC의 동작을 수행하도록 설정되거나, 또는 동작을 수행하기 위한 적어도 하나의 인스트럭 션을 저장할 수 있다. 이 경우, 전자 장치는, O-RAN 환경에서 RIC의 동작을 수행하기 위한(또는, RIC와 연관되는 어플리케이션, 또는 RIC와 연관되는 Pod를 실행하기 위한) 장치(또는, 시스템)일 수 있다. 전자 장치는, 예를 들어 쿠버네티스 오케스트레이션 상에서 RIC와 연관되는 어플리케이션(또 는, Pod)를 컨테이너(또는, 가상머신)을 실행할 수 있으나, 그 실행 형태에는 제한이 없다 다양한 실시예에 따라서, 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이터 처리 또는 연산을 수행할 수 있다. 소프트웨어는, 예를 들어 어플리케이션, Pod, 또는 xAPP을 포함할 수 있으나 제한은 없다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소로부터 수신된 명령 또는 데이터를 저장 장치에 저장하고, 저장 장치에 저장 된 명령 또는 데이터를 처리하고, 결과 데이터를 저장 장치에 저장할 수 있다. 일실시예에 따르면, 프로세 서는, 적어도 하나의 중앙 처리 장치(CPU: central processing unit), 적어도 하나의 그래픽 처리 장치 (GPU: graphical processing unit), 적어도 하나의 어플리케이션 프로세서, 적어도 하나의 신경망 처리 장치 (NPU: neural processing unit), SM(stream multiprocessor) 또는 커뮤니케이션 프로세서 중 적어도 일부를 포 함할 수 있으나, 프로세서의 종류에는 제한이 없다. 신경망 처리 장치는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습(예를 들어, 강화 학습, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 또는 준지도형 학습(semi-supervised learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있다. 저장 장치는, 디스크(예를 들어, HDD)와 같은 데이터를 저장할 수 있는 장치라면 제한이 없음을 당업자는 이해할 것이다. 다양한 실시예에 따라서, 저장 장치는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 및/ 또는 통신 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어 및, 이와 관련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 다양한 실시예에 따라서, 통신 모듈은, 다른 엔티티와 데이터를 송수신할 수 있다. 예를 들어, 전자 장 치가 DU의 동작을 수행하기 위한 장치인 경우, 통신 모듈은 RU와 데이터를 송수신할 수 있 거나, 및/또는 RIC와 데이터를 송수신할 수 있다. 예를 들어, 전자 장치가 RIC의 동작을 수행 하기 위한 장치인 경우, 통신 모듈은 DU를 포함하는 E2 엔티티와 데이터를 송수신할 수 있다. 상술 한 엔티티들과 데이터를 송수신할 수 있다면, 통신 모듈(190a)의 타입 및/또는 통신 모듈(190a)의 지원하는 통 신 방식에는 제한이 없다. 도 2는, 다양한 실시예에 따른 하드웨어 자원 할당을 위한 엔티티를 설명하기 위한 블록도이다. 다양한 실시예에 따라서, 전자 장치는, 하드웨어 엔티티를 포함(또는, 실행)할 수 있다. 예를 들어, 하드웨어 엔티티에는, 제 1 GPU, 제 2 GPU, 제 1 CPU, 또는 제 2 CPU 중 적어도 하 나가 포함될 수 있으나, 그 개수 및/또는 타입에는 제한이 없다. 여기에서, 제 1 GPU 및 제 2 GPU는, 하나의 예에서 두 개의 독립적인 GPU를 의미할 수 있고, 또는 다른 예시에서 하나의 GPU에서의 상 이한 인스턴스를 의미할 수도 있다. 여기에서, 제 1 CPU 및 제 2 CPU는, 하나의 예에서 두 개의 독 립적인 CPU를 의미할 수 있고, 또는 다른 예시에서 하나의 CPU에서의 상이한 코어들을 의미할 수도 있다. 하드 웨어 자원은, 독립적인 연산(또는, 격리(isolation))이 가능한 단위라면 제한이 없음을 당업자는 이해할 수 있 을 것이다. 도 2에서는, 하드웨어 엔티티에 연산을 위한 자원들이 포함되는 것과 같이 도시 및/또는 설명 되었지만, 이는 예시적인 것으로 하드웨어 엔티티에는 데이터의 저장을 위한 자원이 포함될 수도 있다. 예를 들어, 쿠버네티스 오케스트레이션은, 컨테이너(또는, 가상머신)에 기반하여 어플리케이션(또는,파드)을 실행할 수 있으며, 컨테이너에 대하여 하드웨어 자원들(231,232,233,234) 중 적어도 하나에 할당할 수 있다. 여기에서, 쿠버네티스 오케스트레이션이 특정 어플리케이션(또는, 파드)을 특정 하드웨어 자원에 할당한 것은, 예를 들어 특정 어플리케이션(또는, 파드)에 대응하는 인스트럭션의 실행 및/또는 데이터의 저장 이 특정 하드웨어 자원에 의하여 수행되는 것을 의미할 수 있다. 예를 들어, 쿠버네티스 오케스트레이션은, 하드웨어 자원 할당 오케스트레이터의 어플리케이션(또는, 파드)를, 적어도 하나의 하드웨어 자원에 할당할 수 있다. 하드웨어 자원 할당 오케스트레이터는, 네트워 크의 복수 개의 물리 채널들 각각을 하드웨어 자원들(231,232,233,234) 중 적어도 일부에 할당할 수 있다. 예 를 들어, 하드웨어 자원 할당 오케스트레이터는, 제 1 슬롯에 대하여, PDCCH(physical downlink control channel)을 제 1 GPU에 할당할 수 있으며, PDCCH의 할당 정보를 DU에 제공할 수 있다. DU는, 제 1 슬롯 동안의 PDCCH와 연관된 데이터의 처리를 제 1 GPU를 이용하여 수행할 수 있다. 예를 들어, 하 드웨어 자원 할당 오케스트레이터는, 제 2 슬롯에 대하여, PDCCH을 제 2 GPU에 할당할 수 있으며, PDCCH의 할당 정보를 DU에 제공할 수 있다. DU는, 제 2 슬롯 동안의 PDCCH와 연관된 데이터의 처리 를 제 2 GPU를 이용하여 수행할 수 있다. 예를 들어, 하드웨어 자원 할당 오케스트레이터는, 제 1 슬롯에 대하여, PDSCH(physical downlink shared channel)을 제 1 GPU에 할당할 수 있으며, PDSCH의 할당 정보를 DU에 제공할 수 있다. DU는, 제 1 슬롯 동안의 PDSCH와 연관된 데이터의 처리를 제 1 GPU를 이용하여 수행할 수 있다. 상술한 바와 같이, 하드웨어 자원 할당 오케스트레이터는, 특정 슬 롯에 대한 복수 개의 물리 채널들 각각을, 하드웨어 자원들(231,232,233,234) 중 적어도 일부 각각에 할당할 수 있으며, DU는, 할당 정보에 기반하여 확인된 하드웨어 자원을 이용하여 물리 채널들 각각과 연관된 동작을 수행할 수 있다. 하드웨어 자원 할당 오케스트레이터는, 예를 들어 전자 장치에 의하여 실행될 수 있으며, 본 개시에서의 하드웨어 자원 할당 오케스트레이터에 의하여 수행되는 동작은, 전자 장치에 의하여 수행되는 것으로 이해될 수 있다. 한편, 도 2의 실시예에서는, 하드웨어 자원 할당 오케스트레이터 가 DU를 실행하는 쿠버네티스 오케스트레이션 상에서 실행되는 것과 같이 도시되어 있으며, 이 는 전자 장치가 DU를 실행하기 위한 전자 장치인 경우에 해당할 수 있다. 도시되지는 않았지만, 하 드웨어 자원 할당 오케스트레이터는, RIC를 실행하는 쿠버네티스 오케스트레이션(미도시) 상에서 실 행될 수도 있으며, 이 경우 하드웨어 자원 할당에 대한 정보를 E2 인터페이스를 통하여 DU로 제공할 수도 있음을 당업자는 이해할 것이다. 다양한 실시예에 따라서, 하드웨어 자원 할당 오케스트레이터는, 워크로드 계산부, 레이튼시 예측부 , 하드웨어 자원 모니터링부, 로그 데이터, 자원 할당 결정부 중 적어도 하나를 포함할 수 있다. 여기에서, 워크로드 계산부, 레이튼시 예측부, 하드웨어 자원 모니터링부, 로그 데이터 , 자원 할당 결정부는, 예를 들어 하드웨어 자원 할당 오케스트레이터에 포함되는 엔티티로, 예 를 들어 인스트럭션 집합으로 구현되거나, 또는 독립적인 어플리케이션(또는, Pod)로 구현될 수도 있다. 로그 데이터는, 예를 들어 하드웨어 엔티티에서 정의되는 저장 장치에 포함되는 로그 데이터를 리드(rea d)하거나, 및/또는 새로운 로그 데이터를 라이트(write)할 수 있는 엔티티를 의미할 수도 있다. 다양한 실시예에 따라서, 워크로드 계산부는, 특정 슬롯에서의 복수 개의 물리 채널들 각각에 대응하는 연 산량들 각각을 계산할 수 있다. 예를 들어, 워크로드 계산부는, DU의 L2 엔티티(또는, 레이어)(20 1)로부터 RU로 제공되는 제어 플레인 메시지에 기반하여, 특정 슬롯에서의 복수 개의 물리 채널들 각각에 대응하는 연산량들 각각을 계산할 수 있다. 예를 들어, 워크로드 계산부는, 제어 플레인 메시지에 포함된 특정 물리 채널의 RB 및/또는 심볼에 기반하여, 특정 슬롯에서 특정 채널에 대하여 할당된 무선 자원량을 확인 할 수 있다. 워크로드 계산부는, 확인된 무선 자원량에 기반하여 특정 채널의 데이터 처리를 위한 연산량 을 계산할 수 있다. 데이터 처리를 위한 연산량은, 예를 들어 물리 채널 별로 상이할 수도 있으나, 동일하게 설정될 수도 있다. 상술한 바에 따라, 워크로드 계산부는, 특정 슬롯에서의 복수 개의 물리 채널들 각각 에 대한 연산량을 계산할 수 있다. 한편, 상술한 슬롯의 단위는 단순히 예시적인 것이며, 워크로드 계산부 가 계산하는 복수 개의 물리 채널들 각각에 대응하는 연산량들의 시간 단위에는 제한이 없다. 한편, 다른 예를 들어, 레이튼시 예측부는, 로그 데이터에 저장된 정보에 기반하여, 복수 개의 물리 채널들 각각에 대응하는 연산량을 계산할 수도 있다. 예를 들어, 로그 데이터는, 과거에서 특정 채널에 대한 무선 자원 할당 정보 및 이를 특정 하드웨어에서 처리한 경우의 연산량 사이의 연관 정보를 포함할 수 있 다. 표 1은 로그 데이터의 예시이다.표 1 물리 채널 무선 자원 할당량 연산량 PDCCH R1 A1 PDCCH R2 A2 PDSCH R1 A3 PDSCH R2 A4 예를 들어, 하드웨어 자원 할당 오케스트레이터는, 과거에서의 처리 이력을 표 1과 같이 저장 및/또는 관 리할 수 있다. 워크로드 계산부는, 표 1과 같은 로그 데이터에 기반하여 금번 슬롯에 대한 물리 채 널 별 연산량을 예측할 수 있다. 예를 들어, R1의 무선 자원 할당량의 PDCCH를 처리하기 위하여 A1의 연산량이 실제 소요되었고, R2의 무선 자원 할당량의 PDCCH를 처리하기 위하여 A2의 연산량이 실제 소요되었고, R1의 무 선 자원 할당량의 PDSCH를 처리하기 위하여 A3의 연산량이 실제 소요되었고, R2의 무선 자원 할당량의 PDSCH를 처리하기 위하여 A4의 연산량이 실제 소요되었음의 이력이 저장 및/또는 관리될 수 있다. 워크로드 계산부 는, 로그 데이터에 기반하여 금번 슬롯에서의 물리 채널 별 연산량을 예측할 수 있다. 예를 들어, 금번 슬롯에서의 PDCCH에 대하여 R1의 무선 자원이 할당된 경우, 워크로드 계산부는, 표 1과 같은 로그 데 이터에 기반하여 금번 슬롯의 PDCCH에 대하여 A1의 연산량을 예측할 수 있다. 또는, 금번 슬롯에서의 PDCCH에 대하여, 예를 들어, 로그 데이터에 포함되지 않는 R3의 무선 자원이 할당된 경우, 워크로드 계산 부는, 표 1과 같은 로그 데이터에 기반하여 금번 슬롯의 PDCCH에 대한 연산량을 추정할 수 있다. 예 를 들어, 워크로드 계산부는, 무선 자원 할당량 및 연산량 사이의 선형(linear) 관계에 기반하여, 연산량 을 예측할 수 있으나, 선형 관계는 단순히 예시적인 것이며 연산량의 예측 방식에는 제한이 없음을 당업자는 이 해할 것이다. 상술한 바와 같이, 워크로드 계산부는, 물리 채널 별 무선 자원 할당량에 기반한 계산을 이 용하거나, 및/또는 기존 로그 데이터를 이용함으로써, 특정 슬롯의 물리 채널 별 연산량을 확인할 수 있다. 다양한 실시예에 따라서, 하드웨어 자원 모니터링부는, 하드웨어 자원들(231,232,233,234)의 가용 연산량 을 모니터링할 수 있다. 하드웨어 자원들(231,232,233,234) 각각은, 최대 가용 연산량을 가질 수 있다. 예를 들어, 물리적인 단위로 구분된 하드웨어 자원에 대하여서는, 해당 장치에 대응하는 최대 가용 연산량이 있을 수 있다. 예를 들어, 논리적인 단위로 구분된 하드웨어 자원에 대하여서는, 전자 장치에 의하여 정의된 최대 가용 연산량이 있을 수 있다. 예를 들어, MIG(multi instance GPU) 기능이 실행되는 경우, 각 인스턴스 별 하 드웨어 자원에 대한 제약에 따라 최대 가용 연산량이 설정될 수도 있다. 한편, 하드웨어 자원들 (231,232,233,234) 중 적어도 일부는, 물리 채널과 연관된 동작 이외에도 다른 종류의 동작을 수행할 수도 있다. 이에 따라, 하드웨어 자원들(231,232,233,234) 각각의 가용 연산량은 실시간으로 변경될 수도 있으며, 하드웨어 자원 모니터링부는, 하드웨어 자원들(231,232,233,234)의 가용 연산량을 실시간으로 모니터링할 수 있다. 다양한 실시예에 따라서, 자원 할당 결정부는, 워크로드 계산부로부터 제공되는 복수 개의 물리 채널 들 각각의 연산량을 확인할 수 있다. 자원 할당 결정부는, 하드웨어 자원 모니터링부로부터 제공되 는 복수 개의 하드웨어 자원들(231,232,233,234)의 가용 연산량을 확인할 수 있다. 자원 할당 결정부는, 복수 개의 물리 채널들 각각의 연산량 및 복수 개의 하드웨어 자원들(231,232,233,234)의 가용 연산량에 기반하 여, 복수 개의 물리 채널들 각각을 복수 개의 하드웨어 자원들(231,232,233,234) 중 적어도 일부에 할당할 수 있다. 예를 들어, 자원 할당 결정부는, 특정 하드웨어 자원의 가용 연산량이 특정 물리 채널의 연산량보 다 크도록, 물리 채널들 각각을 할당할 수 있다. 한편, 다른 예에서는, 자원 할당 결정부는, 레이튼시에 기반하여 복수 개의 물리 채널들 각각을 복수 개의 하드웨어 자원들(231,232,233,234) 중 적어도 일부에 할당할 수 있다. 예를 들어, 자원 할당 결정부는, 복수 개의 물리 채널들 각각의 연산량 및 복수 개의 하드웨어 자원들(231,232,233,234)의 가용 연산량에 기반하 여, 복수 개의 할당 정책을 확인할 수 있다. 여기에서, 할당 정책은, 복수 개의 물리 채널들 각각이 할당되는 정책을 의미할 수 있다. 상술한 바와 같이, 특정 하드웨어 자원의 가용 연산량이 특정 물리 채널의 연산량보다 크도록, 물리 채널들이 할당될 수 있으며, 이에 따라 복수 개의 할당 정책이 확인될 수도 있다. 레이튼시 예측 부는, 복수 개의 할당 정책 별 레이튼시를 예측할 수 있다. 예를 들어, 레이튼시 예측부는, 로그 데 이터에 저장된 정보에 기반하여, 복수 개의 물리 채널들 각각에 대응하는 연산량을 계산할 수도 있다. 예 를 들어, 로그 데이터는, 과거에서 특정 채널에 대한 연산량 및 이를 특정 하드웨어에서 처리한 경우의 레이튼시 사이의 연관 정보를 포함할 수 있다. 표 2는 로그 데이터의 예시이다. 표 2 물리 채널 하드웨어 자원 연산량 레이튼시 PDCCH 제 1 GPU A1 B1 PDCCH 제 2 GPU A2 B2 PDCCH 제 1 CPU A3 B3 PDSCH 제 1 GPU A4 B4 예를 들어, 하드웨어 자원 할당 오케스트레이터는, 과거에서의 처리 이력을 표 2와 같이 저장 및/또는 관 리할 수 있다. 레이튼시 예측부는, 표 2와 같은 로그 데이터에 기반하여 금번 슬롯에 대한 할당 정 책 별 연산량을 예측할 수 있다. 예를 들어, A5의 연산량의 PDCCH를 제 1 GPU에 할당하는 것이 제 1 할당 정책 으로서 결정되고, A5의 연산량의 PDCCH를 제 2 GPU에 할당하는 것이 제 2 할당 정책으로서 결정된 것을 상정하 도록 한다. 레이튼시 예측부는, 로그 데이터에서 PDCCH가 A1의 연산량인 경우 제 1 GPU로 처리하였 을 때의 레이튼시가 B1인 점에 기반하여, 제 1 할당 정책의 A5의 연산량에 대한 레이튼시(예를 들어, B5)를 예 측할 수 있다. 레이튼시 예측부는, 로그 데이터에서 PDCCH가 A2의 연산량인 경우 제 2 GPU로 처리하 였을 때의 레이튼시가 B2인 점에 기반하여, 제 1 할당 정책의 A5의 연산량에 대한 레이튼시(예를 들어, B6)를 예측할 수 있다. 예를 들어, 레이튼시 예측부는, 연산량 및 레이튼시의 선형(linear) 관계에 기반하여, 레이튼시를 예측할 수 있으나, 선형 관계는 단순히 예시적인 것이며 레이튼시의 예측 방식에는 제한이 없음을 당업자는 이해할 것이다. 자원 할당 결정부는, 각 할당 정책별 레이튼시들(예를 들어, B5, B6)을 레이튼 시 예측부로부터 제공받을 수 있으며, 레이튼시들(예를 들어, B5, B6)의 비교 결과에 기반하여 하나의 할 당 정책을 선택할 수 있다. 한편, 상술한 바에서는, PDCCH의 하나의 물리 채널에 대한 예시를 설명하였지만, 이는 예시적인 것으로 레이튼시 예측부는, 복수 개의 물리 채널에 대한 레이튼시들 각각에 대하여서 레이 튼시들을 예측할 수 있다. 이 경우, 자원 할당 결정부는, 복수 개의 물리 채널들 각각의 레이튼시들에 기 반하여 복수 개의 할당 정책들 중 어느 하나를 선택할 수도 있거나, 또는 복수 개의 물리 채널 중 어느 하나의 물리 채널의 레이튼시에 기반하여 복수 개의 할당 정책들 중 어느 하나를 선택할 수도 있다. 다양한 실시예에 따라서, 자원 할당 결정부는, 할당 정책을 결정하여, 이를 DU의 L1 엔티티로 제공할 수 있다. L1 엔티티는, 제공받은 할당 정책에 기반하여 각 물리 채널들별 데이터를, 대응하는 하 드웨어 자원을 이용하여 처리할 수 있다. 대응하는 하드웨어 자원에 기반하여 처리된 데이터는 RU와 송수 신될 수 있으며, 이에 따라 네트워크 동작이 수행될 수 있다. 아울러, 상술한 바와 같이 도시되지는 않았지만, 하드웨어 자원 할당 오케스트레이터는, RIC에 의하 여 실행될 수도 있다. RIC는, 예를 들어 E2 인터페이스를 통하여 제어 플레인 메시지(또는, 제어 플레인 메시지 내의 물리 채널에 대한 무선 자원 할당 정보)를, DU로부터 제공받을 수 있다. RIC 상에서 실 행된 하드웨어 자원 할당 오케스트레이터는, 제공받은 제어 플레인 메시지(또는, 제어 플레인 메시지 내의 물리 채널에 대한 무선 자원 할당 정보)에 기반하여, 상술한 실시예들 중 적어도 일부에 기반하여 특정 슬롯(또 는, 다른 시간 단위)에 대한 할당 정책을 결정할 수 있다. RIC는, E2 인터페이스를 통하여, 할당 정책을 DU로 제공할 수 있으며, DU는 수신한 할당 정책에 따라서 물리 채널별 데이터를 대응하는 하드웨어 자원을 이용하여 처리할 수 있다. 도 3a는 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 3a의 실시예는, 도 3b 및 도 4를 참조하여 설명하도록 한다. 도 3b는 다양한 실시예에 따른 제어 플레인 메시지 및 사용자 플레인 데이터의 송수신을 설명하기 위한 흐름도이다. 도 4는 다양한 실시예에 따른 물리 채널들의 하드웨어 자원의 할당을 설명하기 위한 도면이다. 다양한 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 301 동작에서, 제어 플레인 메시지에 기반하여 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인할 수 있다. 예를 들어, 전자 장치는, L2 엔티티에서 신규 슬롯이 트리거링됨(또는, 트리거 이벤트의 검출)에 기반하여, 복수 개의 물리 채널 별 무 선 자원 할당 정보를 확인할 수 있다. 예를 들어, 도 3b에서와 같이, DU는, 311 동작에서 제 1 슬롯을 위 한 제어 플레인 메시지를 RU로 제공할 수 있다. 제어 플레인 메시지에는 무선 자원 할당을 위한 정보, 예 를 들어 sectioned 내의 numPrbc 및/또는 numSymbol이 포함될 수 있다. 전자 장치는, 제어 플레인 메시 지에 기반하여, 제 1 슬롯에서의 복수 개의 물리 채널 별 무선 자원 할당 정보(예를 들어, RB의 개수 및/또는심볼의 개수)를 확인할 수 있다. 이후, DU는, 311a 동작, 311b 동작, 내지 311n 동작에서, 제 1 슬롯의 제 1 심볼, 제 2 심볼 내지 제 n 심볼(예를 들어, n은 14)을 위한 사용자 플레인 데이터를 RU로 제공할 수 있다. 이후, DU는, 315 동작에서 제 2 슬롯을 위한 제어 플레인 메시지를 RU로 제공할 수 있다. 전 자 장치는, 제어 플레인 메시지에 기반하여, 제 2 슬롯에서의 복수 개의 물리 채널 별 무선 자원 할당 정 보(예를 들어, RB의 개수 및/또는 심볼의 개수)를 확인할 수 있다. 상술한 바에 따라, 전자 장치는, 각 슬롯 별로, 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 303 동작에서, 복수 개의 물리 채널 별 무선 자원 할당 정보에 기 반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 예를 들어, 전자 장치는, 복수 개의 물 리 채널 별 무선 자원 할당 정보를 이용한 계산에 기반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 또는, 전자 장치는, 복수 개의 물리 채널 별 무선 자원 할당 정보 및 연산량 사이의 관계를 포함하 는 로그 데이터에 기반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 계산에 기반한 예측 연산 량 확인 방식 및/또는 로그 데이터에 기반한 예측 연산량 확인 방식에 대하여서는, 도 2를 참조하여 설명하였으 므로, 여기에서의 설명은 반복되지 않는다. 다양한 실시예에 따라서, 전자 장치는, 305 동작에서, 복수 개의 하드웨어 자원 별 가용 연산량을 확인할 수 있다. 전자 장치는, 307 동작에서, 복수 개의 하드웨어 자원 별 가용 연산량 및 복수 개의 물리 채널 별 예측 연산량에 기반하여, 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수 있다. 예를 들어, 전자 장치는, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지 않도록, 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수 있다. 예를 들어, 도 4의 예시에서는, 전자 장치가 PDCCH는 제 1 GPU에 할당하고, PDSCH는 제 1 GPU에 할당하고, PRACH는 제 1 CPU에 할당할 수 있다. 예를 들어, 전자 장치는, PDCCH의 예측 연산량 및 PDSCH의 예측 연산량이 제 1 GPU의 가용 연산량보다 작음에 기반하여, PDCCH 및 PDSCH를 제 1 GPU에 할당할 수 있다. 다양한 실시예에 따라서, 전자 장치는 레이튼시에 기반하여 복수 개의 물리 채널 각각을 복수 개의 하드웨 어 자원 중 적어도 일부에 할당할 수 있다. 예를 들어, 전자 장치는, 도 2를 참조하여 설명한 바와 같이, 할당 정책에 대응하는 복수 개의 물리 채널 별 레이튼시를 확인할 수 있다. 전자 장치는, 복수 개의 물리 채널 별 레이튼시가 레이튼시 제한을 만족하는지 여부에 기반하여, 복수 개의 물리 채널 각각을 복수 개의 하드 웨어 자원 중 적어도 일부에 할당할 수 있다. 예를 들어, 도 4의 예시에서, PDCCH, PDSCH, 및 PRACH의 연산량의 합계가 제 1 GPU의 가용 연산량보다 작을 수 있다. 이에 따라, PDCCH, PDSCH, 및 PRACH를 제 1 GPU에 할당하는 것이 상대적으로 효율적일 수 있다. 한편, 전자 장치 는, PDCCH, PDSCH, 및 PRACH를 제 1 GPU에 할당할 경우의 PDCCH, PDSCH, 및 PRACH 각각에 대응하는 레이튼시들을 확인할 수 있다. 아울러, PDCCH, PDSCH, 및 PRACH 각각에 대응하는 레이튼시 한계가 설정될 수 있으며, 레이튼시 한계의 설정의 방식 및/또는 조건에 는 제한이 없다. PDCCH, PDSCH, 및 PRACH를 제 1 GPU에 할당할 경우의 PDCCH, PDSCH, 및 PRACH 각각에 대응하는 레이튼시들 중 적어도 일부가 PDCCH, PDSCH, 및 PRACH 각각에 대응하는 레이튼시 한계를 초과함을 확인할 수 있다. 이 경우, 전자 장치는, PDCCH, PDSCH, 및 PRACH를 제 1 GPU에 할당하지 않을 수 있다. 다만, 모든 할당 정책들 에서 레이튼시 한계가 충족되지 않는 경우에는, 전자 장치는 우선 순위에 따라 어느 하나의 할당 정책을 선택할 수도 있으며 이에 대하여서는 후술하도록 한다. 다양한 실시예에서, 전자 장치는, 하나의 물리 채널에 포함된 복수 개의 서브 물리 채널들 각각을 하드웨 어 자원들에 할당하도록 설정될 수도 있다. 상술한 예시에서, 전자 장치는, 하나의 물리 채널은, 하나의 하드웨어 자원에 할당하는 것과 같이 설명되었지만 이는 예시적인 것이며, 다양한 실시예에서는, 하나의 물리 채널의 복수 개의 서브 물리 채널들을 상이한 하드웨어 자원들 각각에 할당할 수도 있다. 예를 들어, 전자 장 치는, 하나의 슬롯에서 제 1 UE에 대응하는 PUSCH를 제 1 하드웨어 자원에 할당하고, 제 2 UE에 대응하는 PUSCH를 제 2 하드웨어 자원에 할당할 수도 있다. 한편, UE 별로 서브 물리 채널들을 구분하는 것은 예시적인 것이며, 하나의 물리 채널에 대하여 복수 개의 서브 물리 채널을 구분하는 방식에는 제한이 없다. 도 5는 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 5의 실시예는, 도 6을 참조하여 설명하도록 한다. 도 6은 다양한 실시예에 따른 물리 채널들의 하드웨어 자원의 할당을 설명하기 위한 도면이다.다양한 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 501 동작에서, 제어 플레인 메시지에 기반하여 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인할 수 있다. 전자 장치는, 제어 플레인 메 시지에 포함된 sectioned 내의 numPrbc 및/또는 numSymbol에 기반하여, 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인할 수 있다. 전자 장치는, 303 동작에서, 복수 개의 물리 채널 별 무선 자원 할당 정보에 기 반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 예를 들어, 전자 장치는, 복수 개의 물 리 채널 별 무선 자원 할당 정보를 이용한 계산에 기반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 또는, 전자 장치는, 복수 개의 물리 채널 별 무선 자원 할당 정보 및 연산량 사이의 관계를 포함하 는 로그 데이터에 기반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 505 동작에서, 복수 개의 하드웨어 자원 별 가용 연산량을 확인할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 507 동작에서, 복수 개의 하드웨어 자원 별 가용 연산량 및 복수 개의 물리 채널 별 예측 연산량에 기반하여, 복수 개의 할당 정책을 확인할 수 있다. 509 동작에서, 전자 장치 는, 복수 개의 할당 정책 각각에서의 복수 개의 물리 채널 별 레이튼시를 확인할 수 있다. 예를 들어, 전 자 장치는, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지 않도록 복수 개의 물 리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당 가능한 할당 정책을 확인할 수 있다. 예를 들 어, 도 6을 참조하면, 전자 장치는, PDCCH는 제 1 GPU에 할당하고, PDSCH는 제 1 GPU에 할당하고, PRACH는 제 1 CPU에 할당하는 제 1 할당 정책을 확인할 수 있다. 전자 장치 는, 제 1 할당 정책에서, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지 않도록 복수 개의 물리 채널 각각이 복수 개의 하드웨어 자원 중 적어도 일부에 할당 가능한 것을 확인할 수 있다. 전 자 장치는, 제 1 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시들(예를 들 어, A1 μs, B1 μs, C1 μs)를 확인할 수 있다. 예를 들어, 전자 장치는, 도 2를 참조하여 설명한 바와 같이, 연산량 및 레이튼시 사이의 연관 정보를 포함하는 로그 데이터에 기반하여 복수 개의 물리 채널 (401,402,403) 각각에 대응하는 레이튼시들(예를 들어, A1 μs, B1 μs, C1 μs)를 확인할 수 있으나, 그 확인 방식에는 제한이 없다. 전자 장치는, PDCCH는 제 1 GPU에 할당하고, PDSCH는 제 2 GPU에 할당하고, PRACH는 제 1 CPU에 할당하는 제 2 할당 정책을 확인할 수 있다. 전자 장치 는, 제 2 할당 정책에서, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지 않도록 복수 개의 물리 채널 각각이 복수 개의 하드웨어 자원 중 적어도 일부에 할당 가능한 것을 확인할 수 있다. 전 자 장치는, 제 2 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시들(예를 들 어, A2 μs, B2 μs, C2 μs)를 확인할 수 있다. 도 6에서는, 전자 장치가 두 개의 할당 정책을 확인한 것과 같이 도시되어 있지만 이는 예시적인 것으로, 할당 정책의 개수에는 제한이 없다. 다양한 실시예에 따라서, 전자 장치는, 511 동작에서, 복수 개의 물리 채널 별 레이튼시에 기반하여 하나 를 선택할 수 있다. 하나의 예에서, 전자 장치는, 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시들이, 복수 개 의 물리 채널(401,402,403) 각각에 대응하는 레이튼시 한계들을 만족하는 할당 정책을 선택할 수 있다. 예를 들어, 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시 한계들이 TH_PDCCH, TH_PDSCH, TH_PRACH로 설정될 수 있으며, 레이튼시 한계들이 설정되는 방식에는 제한이 없다. 한편, 물리 채널에 대한 레이튼시 한계 들이 상이한 것과 같이 설명되었지만 이는 예시적인 것으로, 물리 채널들 중 적어도 두 개의 물리 채널의 레이 튼시 한계가 동일할 수도 있다. 전자 장치는, 제 1 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시들(예를 들어, A1 μs, B1 μs, C1 μs) 각각이 레이튼시 한계들(TH_PDCCH, TH_PDSCH, TH_PRACH) 각각 이하인지 여부를 확인할 수 있다. 예를 들어, 제 1 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시들(예를 들어, A1 μs, B1 μs, C1 μs) 각각이 레이튼시 한계들 (TH_PDCCH, TH_PDSCH, TH_PRACH) 각각 이하인 경우, 전자 장치는, 제 1 할당 정책을 이용 가능한 할당 정 책으로 확인할 수 있다. 만약, 제 2 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이 튼시들(예를 들어, A2 μs, B2 μs, C2 μs) 중 적어도 하나가, 대응하는 레이튼시 한계를 초과하는 경우, 전자 장치는, 제 2 할당 정책을 이용 불가능한 할당 정책으로 확인할 수 있다. 이 경우, 전자 장치는, 복 수 개의 할당 정책들 중, 레이튼시 한계를 만족하는 제 1 할당 정책을 선택할 수 있다. 다른 예에서, 모든 물리 채널들의 레이튼시들이 대응하는 레이튼시 한계들을 만족하는 할당 정책이 복수 개로 확인될 수 있다. 이 경우, 전자 장치는, 복수 개의 할당 정책의 우선 순위에 기반하여, 어느 하나의 할당 정책을 선택할 수 있다. 하나의 예에서, 전자 장치는, 복수 개의 할당 정책들 중 이용되는 하드웨어 자원 (또는, 에너지 소비량)이 최소인 할당 정책을 선택할 수 있다. 예를 들어, 도 6의 실시예에서, 제 1 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하는 레이튼시들(예를 들어, A1 μs, B1 μs, C1 μs) 각 각이 레이튼시 한계들(TH_PDCCH, TH_PDSCH, TH_PRACH) 각각 이하이며, 제 2 할당 정책에서의 복수 개의 물리 채 널(401,402,403) 각각에 대응하는 레이튼시들(예를 들어, A2 μs, B2 μs, C2 μs) 각각이 레이튼시 한계들 (TH_PDCCH, TH_PDSCH, TH_PRACH) 각각 이하인 것을 상정하도록 한다. 이 경우, 전자 장치는, 제 1 할당 정책 및 제 2 할당 정책 모두 레이튼시 한계를 만족하는 것으로 확인할 수 있다. 한편, 제 1 할당 정책에 따르 면, 제 1 GPU 및 제 1 CPU가 이용될 수 있으며, 제 2 할당 정책에 따르면, 제 1 GPU, 제 2 GPU 및 제 1 CPU가 이용될 수 있다. 제 1 할당 정책에 따라 이용되는 하드웨어 자원의 개수(또는, 에너지 소비량)가 제 2 할당 정책에 따라 이용되는 하드웨어 자원의 개수(또는, 에너지 소비량)보다 작음에 기 반하여, 전자 장치는 제 1 할당 정책을 선택할 수 있다. 다른 예시에서는, 전자 장치는 복수 개의 할당 정책들 중 레이튼시의 합계가 최소인 할당 정책을 선택할 수도 있다. 다른 예시에서는, 전자 장치는, 복수 개의 할당 정책들 중 우선 순위가 높은 물리 채널(예를 들어, PDCCH, PUCCH와 같은 컨트롤 채널)의 레이튼시가 레이튼시 한계를 만족하는 할당 정책(또는, 최소 레이튼시를 가지는 할당 정책)을 선택할 수도 있다. 전자 장치는, 상술한 다양한 선택 조건에 기반하거나, 또는 적어도 두 개 이상의 조합에 기반 하여, 복수 개의 할당 정책들 중 하나를 선택할 수 있다. 다른 예에서, 모든 물리 채널들의 레이튼시들이 대응하는 레이튼시 한계들을 만족하는 할당 정책이 확인되지 않 을 수도 있다. 이 경우, 전자 장치는, 레이튼시 한계를 만족하지 못하는 복수 개의 할당 정책들 중 어느 하나를 선택할 수도 있다. 하나의 예에서는, 전자 장치는, 레이튼시 한계를 만족하지 못하는 복수 개의 할당 정책들 중, 사용하는 하드웨어 자원이 최소인(또는, 에너지 소비량이 최소인) 할당 정책을 선택할 수 있다. 예를 들어, 도 6의 실시예에서, 제 1 할당 정책에서의 복수 개의 물리 채널(401,402,403) 각각에 대응하 는 레이튼시들(예를 들어, A1 μs, B1 μs, C1 μs) 중 적어도 하나가 레이튼시 한계를 만족하지 못하며, 제 2 할당 정책에서의 복수 개의 물리 채널(401,402,403) 중 적어도 하나가 레이튼시 한계를 만족하지 못한 것을 상 정하도록 한다. 이 경우, 전자 장치는, 제 1 할당 정책 및 제 2 할당 정책 모두 레이튼시 한계를 만족하 지 못하는 것으로 확인할 수 있다. 한편, 제 1 할당 정책에 따르면, 제 1 GPU 및 제 1 CPU가 이용될 수 있으며, 제 2 할당 정책에 따르면, 제 1 GPU, 제 2 GPU 및 제 1 CPU가 이용될 수 있다. 제 1 할당 정책에 따라 이용되는 하드웨어 자원의 개수(또는, 에너지 소비량)가 제 2 할당 정책에 따라 이용되는 하드웨어 자원의 개수(또는, 에너지 소비량)보다 작음에 기반하여, 전자 장치는 제 1 할당 정책을 선택할 수 있다. 다른 예시에서는, 전자 장치는, 레이튼시 한계를 만족하지 못하는 복수 개의 할당 정책들 중 레 이튼시의 합계가 최소인 할당 정책을 선택할 수도 있다. 다른 예시에서는, 전자 장치는, 레이튼시 한계를 만족하지 못하는 복수 개의 할당 정책들 중 우선 순위가 높은 물리 채널(예를 들어, PDCCH, PUCCH와 같은 컨트 롤 채널)의 레이튼시가 레이튼시 한계를 만족하는 할당 정책(또는, 최소 레이튼시를 가지는 할당 정책)을 선택 할 수도 있다. 전자 장치는, 상술한 다양한 선택 조건에 기반하거나, 또는 적어도 두 개 이상의 조합에 기반하여, 복수 개의 할당 정책들 중 하나를 선택할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 515 동작에서, 선택된 할당 정책에 기반하여 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수 있다. 복수 개의 물리 채널들 각각에 대한 하드 웨어 자원 할당과 연관된 정보는, DU에 제공될 수 있으며, DU는 하드웨어 자원 할당 정보에 기반하여, 복수 개의 물리 채널들 각각에 대한 데이터 처리를 해당하는 하드웨어 자원을 이용하여 수행할 수 있 다. 도 7은 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 다양한 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 701 동작에서, 복수 개의 하드웨어 자 원 별 가용 연산량 및 복수 개의 물리 채널 별 예측 연산량에 기반하여, 복수 개의 할당 정책을 확인할 수 있다. 예를 들어, 전자 장치는, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지 않도록 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당 가능한 할당 정책을 확인 할 수 있다. 전자 장치는, 703 동작에서, 복수 개의 할당 정책들 중 복수 개의 물리 채널 별 시간 제약을 모두 만족하는 레이튼시들을 가지는 할당 정책을 확인할 수 있다. 예를 들어, 전자 장치는, 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시들을 확인할 수 있다. 상술한 바와 같이, 복수 개의 물리 채널에 대하 여서는 레이튼시 한계가 설정될 수 있으며, 이를 시간 제약으로 명명할 수도 있다. 전자 장치는, 예를 들 어 모든 물리 채널의 레이튼시들 각각이 시간 제약을 만족하는 할당 정책을 확인할 수 있다. 한편, 다른 예시 에서는, 전자 장치는, 복수 개의 물리 채널 전체가 아닌, 특정한 적어도 하나의 물리 채널이 시간 제약을 만족하는 할당 정책을 확인할 수도 있다.다양한 실시예에 따라서, 전자 장치는, 705 동작에서, 확인된 할당 정책이 복수 개인지 여부를 확인할 수 있다. 만약, 확인된 할당 정책이 하나라면(705-아니오), 전자 장치는, 707 동작에서, 하나의 할당 정책을 선택할 수 있다. 만약, 확인된 할당 정책이 복수 개라면(705-예), 전자 장치는, 709 동작에서, 우선 순위 가 가장 높은 할당 정책을 선택할 수 있다. 하나의 예에서, 전자 장치는, 복수 개의 할당 정책들 중 이용 되는 하드웨어 자원(또는, 에너지 소비량)이 최소인 할당 정책을 선택할 수 있다. 다른 예시에서는, 전자 장치 는 복수 개의 할당 정책들 중 레이튼시의 합계가 최소인 할당 정책을 선택할 수도 있다. 다른 예시에서는, 전자 장치는, 복수 개의 할당 정책들 중 우선 순위가 높은 물리 채널(예를 들어, PDCCH, PUCCH와 같은 컨트롤 채널)의 레이튼시가 레이튼시 한계를 만족하는 할당 정책(또는, 최소 레이튼시를 가지는 할당 정책)을 선택할 수도 있다. 전자 장치는, 상술한 다양한 선택 조건에 기반하거나, 또는 적어도 두 개 이상의 조합에 기반하여, 복수 개의 할당 정책들 중 하나를 선택할 수 있다. 도 8은 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 다양한 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 801 동작에서, 복수 개의 하드웨어 자 원 별 가용 연산량 및 복수 개의 물리 채널 별 예측 연산량에 기반하여, 복수 개의 할당 정책을 확인할 수 있다. 예를 들어, 전자 장치는, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지 않도록 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당 가능한 할당 정책을 확인 할 수 있다. 803 동작에서, 전자 장치는, 복수 개의 물리 채널 중 우선 순위에 기반하여 적어도 하나의 물리 채널을 선택할 수 있다. 하나의 예에서, 전자 장치는, 디폴트된 적어도 하나의 물리 채널(예를 들어, PDCCH, 또는 PUCCH와 같은 컨트롤 채널)을 선택할 수 있으나, 상대적으로 높은 우선 순위가 설정된 물리 채널의 종류에는 제한이 없다. 전자 장치는, 805 동작에서, 선택된 적어도 하나의 물리 채널에 대한 복수 개의 물리 채널별 레이튼시들을 확인할 수 있다. 예를 들어, PDCCH가 선택된 경우, 전자 장치는 복수 개 의 할당 정책들 각각의 PDCCH에 대한 레이튼시들을 확인할 수 있다. 전자 장치는, 807 동자에서, 확인된 레이튼시에 기반하여 하나의 할당 정책을 선택할 수 있다. 예를 들어, 전자 장치는, PDCCH가 선택된 경우, PDCCH의 레이튼시 한계를 만족하는 레이튼시를 가지는 할당 정책을 선택할 수 있다. 또는, 전자 장치 는, PDCCH가 선택된 경우, PDCCH의 레이튼시가 가장 낮은 할당 정책을 선택할 수 있다. 만약, 가장 높은 우선 순위의 물리 채널에 대하여서 동일한 레이튼시를 가지는 복수 개의 할당 정책들이 존재하는 경우, 전자 장 치는, 차순위의 물리 채널에 대한 레이튼시들에 기반하여 복수 개의 할당 정책들 중 하나를 선택할 수도 있다. 도 9는 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 다양한 실시예에 따라서, 전자 장치(예를 들어, 프로세서)는, 전자 장치(예를 들어, 프로세서 )는, 901 동작에서, 제어 플레인 메시지에 기반하여 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인 할 수 있다. 전자 장치는, 예를 들어 복수 개의 물리 채널 별 무선 자원 할당 정보(예를 들어, RB의 개수 및/또는 심볼의 개수)를 확인할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 903 동작에서, 복수 개의 물리 채널 별 무선 자원 할당 정보 및 추 가 정보에 기반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 상술한 바와 같이, 전자 장치 는, 복수 개의 물리 채널 별 무선 자원 할당 정보를 이용한 계산에 기반하여, 복수 개의 물리 채널 별 예 측 연산량을 확인할 수 있다. 또는, 전자 장치는, 복수 개의 물리 채널 별 무선 자원 할당 정보 및 연산 량 사이의 관계를 포함하는 로그 데이터에 기반하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 한편, 전자 장치는 추가 정보를 추가적으로 고려하여, 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 하나의 예에서, 전자 장치는 이용하는 안테나 개수를 추가 정보로서 고려하여 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 하나의 예에서, 전자 장치는, 레이어의 수를 추가 정보로서 고려하여 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 하나의 예에서, 전자 장치는 네트워크에 연결된 UE의 개수를 추가 정보로서 고려하여 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 다양한 실시예에 따라서, 전자 장치는 상술한 추가 정보 또는 둘 이상의 조합을 더 고려하여 복수 개의 물리 채널 별 예측 연산량을 확인할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 905 동작에서, 복수 개의 하드웨어 자원 별 가용 연산량을 확인할 수 있다. 전자 장치는, 907 동작에서, 복수 개의 하드웨어 자원 별 가용 연산량 및 복수 개의 물리 채널 별 예측 연산량에 기반하여, 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수 있다. 예를 들어, 전자 장치는, 어느 하드웨어 자원에 대하여 가용 연산량보다 더 큰 연산량이 할당되지않도록, 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수 있다. 전자 장치 는 레이튼시에 기반하여 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수도 있다. 예를 들어, 전자 장치는, 도 2를 참조하여 설명한 바와 같이, 할당 정책에 대응하는 복수 개 의 물리 채널 별 레이튼시를 확인할 수 있다. 전자 장치는, 복수 개의 물리 채널 별 레이튼시가 레이튼시 제한을 만족하는지 여부에 기반하여, 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당할 수 있다. 한편, 다양한 실시예들의 무선 자원 할당 정보에 기반하여 복수 개의 물리 채널 별 예측 연산 량을 확인하는 동작은, 무선 자원 할당 정보 및 적어도 하나의 추가 정보에 기반하여 복수 개의 물리 채널 별 예측 연산량을 확인하는 동작으로 대체될 수도 있음을 당업자는 이해할 것이다. 도 10은 다양한 실시예와의 비교를 위한 비교예에 따른 물리 채널의 할당 및 다양한 실시예에 따른 물리 채널의 할당을 설명하기 위한 도면이다. 비교예에 따른 물리 채널 할당 정책은, 예를 들어 물리 채널들 중 업 링크 채널은 GPU에 고정적으 로 할당하고, 다운 링크 채널은 CPU에 고정적으로 할당하는 것일 수 있다. 한편, 업 링크의 트래 픽이 증가하고, 다운 링크 트래픽이 감소하는 경우가 발생할 수 있다. 이 때, 다운 링크 트래픽이 감소하여 CPU에는 상대적으로 많은 유휴 자원이 확보될 수 있으며, 업 링크 트래픽 증가에 따른 GPU의 유휴 자원 부족 현상이 발생할 수 있다. 비교예에 따라서는, 고정적인 할당 정책에 따라서, CPU의 유휴 자원 을 이용할 수 없어 하드웨어 자원의 효율이 저하될 수 있다. 또는, 업 링크의 연산량이 GPU의 가 용 연산량을 초과할 가능성도 있다. 다양한 실시예에 따른 전자 장치는, 업 링크의 적어도 하나의 제 1 물리 채널(1003a)은 GPU에 할당하고, 적어도 하나의 제 2 물리 채널(1003b)은 CPU에 할당할 수 있다. 상술한 바와 같이, 전자 장치는, 물리 채널들 별로 연산량을 예측할 수 있으며, 이에 기반하여 하드웨어 자원들을 복수 개의 물리 채널들 각각에 할당할 수 있다. 이에 따라, 전자 장치는, 적어도 하나 의 제 1 물리 채널(1003a)은 GPU에 할당하고, 적어도 하나의 제 2 물리 채널(1003b)은 CPU에 할당 할 수 있다. 도 11은 다양한 실시예와의 비교를 위한 비교예에 따른 물리 채널의 할당 및 다양한 실시예에 따른 물리 채널의 할당을 설명하기 위한 도면이다. 비교예에 따른 물리 채널 할당 정책은, 예를 들어 PUSCH은 제 1 GPU에 고정적으로 할당하고, PUCCH은 제 2 GPU에 고정적으로 할당하는 것일 수 있다. 한편, 비교예에서는, PUSCH 및 PUCCH의 전체 트래픽이 상대적으로 낮은 경우에도, 두 개의 GPU들(1101,1102)(또는, GPU 인스턴스들)이 모두 구동되어야 한다. 다양한 실시예에 따른 전자 장치는, PUSCH 및 PUCCH 모두를 제 1 GPU에 할당할 수 있다. 상술한 바와 같이, 전자 장치는, 물리 채널들 별로 연산량을 예측할 수 있 으며, 이에 기반하여 하드웨어 자원들을 복수 개의 물리 채널들 각각에 할당할 수 있다. 이에 따라, 전자 장치 는, PUSCH 및 PUCCH 모두를 제 1 GPU에 할당할 수 있으며, 이 경우 제 2 GPU는 유휴 상태에 있을 수 있다. 또는, 제 2 GPU이, 네트워크 데이터 처리 이외의 다른 동작(예를 들어, 연산 량 및/또는 레이튼시 계산을 위한 AI 모델의 학습(예를 들어, 강화 학습))을 위하여 이용될 수도 있다. 다양한 실시예에 따라서, 다양한 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인하는 동작, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채 널 별 예측 연산량들 각각을 확인하는 동작, 상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가 용 연산량을 확인 하는 동작, 및 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당 하는 동작을 포함할 수 있다. 그 밖의 다양한 실시예가 가능하다. 다양한 실시예에 따라서, 상기 제 1 슬롯 내의 상기 복수 개의 물리 채널 별 무선 자원 할당 정보는, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수를 포함할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작은, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수 를 이용하는 계산을 수행함에 기반하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작은, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수및, 과거의 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수와 연산량 사이의 연관 정보를 이용하 여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하는 동작은, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보 및 적어도 하나의 추가 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하고, 상기 적어도 하나 의 추가 정보는, 상기 복수 개의 물리 채널의 송신 및/또는 수신에 이용되는 안테나의 개수, 상기 복수 개의 물 리 채널의 레이어의 수, 또는 상기 전자 장치에 연결된 사용자 장치의 개수 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동 작은, 상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일 부에 할당할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동 작은, 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여 상기 복수 개의 물리 채널 별 레이튼시들을 확인하 는 동작, 및 상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상 기 상기 복수 개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작을 포함할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연 산량, 및 상기 상기 복수 개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개 의 하드웨어 자원 중 적어도 일부에 할당하는 동작은, 상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각 의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록 하는 복수 개의 할당 정 책들을 확인하는 동작, 및 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들 중 하나를 선택하는 동작을 포함할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상 기 복수 개의 할당 정책들 중 하나를 선택하는 동작은, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개 의 물리 채널 별 레이튼시 한계 이하인 상기 하나를 선택할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상 기 복수 개의 할당 정책들 중 하나를 선택하는 동작은, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개 의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이 복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 상기 하나를 선택할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상 기 복수 개의 할당 정책들 중 하나를 선택하는 동작은, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개 의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이 복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 최소 하드웨어 자원을 이용하는 할당 정책을 선택할 수 있다. 다양한 실시예에 따라서, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상 기 복수 개의 할당 정책들 중 하나를 선택하는 동작은, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개 의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이 복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 지정된 물리 채널의 레이튼시가 최소인 할당 정책을 선택할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 메모리 및 상기 메모리에 작동적으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 메모리는, 실행시에, 상기 적어도 하나의 프로세서로 하여금, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 복수 개의 물리 채널 별 무선 자원 할당 정보를 확인하고, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하고, 상기 전자 장치에 의하여 지원되는 복수 개의 하드웨어 자원 별 가용 연산량을 확인하고, 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반 하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하도록 야기하는 적어 도 하나의 인스트럭션을 저장할 수 있다.다양한 실시예에 따라서, 상기 제 1 슬롯 내의 상기 복수 개의 물리 채널 별 무선 자원 할당 정보는, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수를 포함할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각 각을 확인하는 동작의 적어도 일부로서, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수를 이용하 는 계산을 수행함에 기반하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각 각을 확인하는 동작의 적어도 일부로서, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수 및, 과거 의 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수와 연산량 사이의 연관 정보를 이용하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각 각을 확인하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수 및, 과거의 상기 복수 개의 물리 채널 별 RB의 개수 및/또는 심볼의 개수와 연산량 사이의 연관 정보를 이용하여 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각 각을 확인하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 무선 자원 할당 정보 및 적어도 하나의 추 가 정보에 기반하여, 상기 복수 개의 물리 채널 별 예측 연산량들 각각을 확인하도록 야기하고, 상기 적어도 하 나의 추가 정보는, 상기 복수 개의 물리 채널의 송신 및/또는 수신에 이용되는 안테나의 개수, 상기 복수 개의 물리 채널의 레이어의 수, 또는 상기 전자 장치에 연결된 사용자 장치의 개수 중 적어도 하나를 포함할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작의 적어도 일부로, 상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연산량이, 할당받은 적어도 하나의 물리 채널의 연 산량의 합계 이상이 되도록, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당 하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 하드웨어 자원 별 가용 연산량 및 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 예측 연산량에 기반하여 상기 복수 개의 물리 채널 별 레이튼시들을 확인고, 상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상기 상기 복수 개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어도 일부에 할당하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 하드웨어 자원 별 가용 연산량, 상기 복수 개의 물리 채널 별 예측 연산량, 및 상기 상기 복수 개의 물리 채널 별 레이튼시들에 기반하여, 상기 복수 개의 물리 채널 각각을 복수 개의 하드웨어 자원 중 적어 도 일부에 할당하는 동작의 적어도 일부로, 상기 복수 개의 하드웨어 자원 중 상기 적어도 일부 각각의 가용 연 산량이, 할당받은 적어도 하나의 물리 채널의 연산량의 합계 이상이 되도록 하는 복수 개의 할당 정책들을 확인 하고, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들 중 하나를 선택하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들 중 하나를 선택하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 상기 하나를 선택하도록 야기할 수 있다.다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들 중 하나를 선택하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이 복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 상기 하나를 선 택하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들 중 하나를 선택하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이 복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 최소 하드웨어 자원을 이용하는 할당 정책을 선택하도록 야기할 수 있다. 다양한 실시예에 따라서, 상기 적어도 하나의 인스트럭션은 실행 시에 상기 적어도 하나의 프로세서로 하여금, 상기 복수 개의 할당 정책들 각각의 복수 개의 물리 채널 별 레이튼시에 기반하여, 상기 복수 개의 할당 정책들 중 하나를 선택하는 동작의 적어도 일부로, 상기 복수 개의 물리 채널 별 레이튼시가 상기 복수 개의 물리 채널 별 레이튼시 한계 이하인 후보 할당 정책이 복수 개인 경우, 상기 복수 개의 후보 할당 정책 중 지정된 물리 채 널의 레이튼시가 최소인 할당 정책을 선택하도록 야기할 수 있다. 다양한 실시예에 따라서, 전자 장치의 동작 방법은, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플 레인 메시지에 기반하여, 상기 제 1 슬롯 내의 제 1 물리 채널의 제 1 무선 자원 할당량 및 제 2 물리 채널의 제 2 무선 자원 할당량을 확인하는 동작, 상기 제 1 무선 자원 할당량 및 상기 제 2 무선 자원 할당량에 대응하 는 연산을 상기 전자 장치에 의하여 지원되는 제 1 하드웨어 자원에 의하여 수행 가능한 경우, 상기 제 1 물리 채널 및 상기 제 2 물리 채널을 상기 제 1 하드웨어 자원에 할당 하는 동작, 및 상기 제 1 무선 자원 할당량 및 상기 제 2 자원 무선 할당량에 대응하는 연산을 상기 전자 장치에 의하여 지원되는 상기 제 1 하드웨어 자원에 의하여 수행 불가능한 경우, 상기 제 1 물리 채널 또는 상기 제 2 물리 채널 중 하나의 물리 채널을 상기 제 1 하드웨어 자원에 할당하고, 나머지 채널을 상기 제 1 하드웨어 자원과 상이한 제 2 하드웨어 자원에 할당하는 동작을 포함할 수 있다. 다양한 실시예에 따라서, 전자 장치는, 메모리 및 상기 메모리에 작동적으로 연결된 적어도 하나의 프로세서를 포함하고, 상기 메모리는, 실행시에, 상기 적어도 하나의 프로세서로 하여금, 제 1 슬롯에 대한 무선 자원 할당 정보를 포함하는 제어 플레인 메시지에 기반하여, 상기 제 1 슬롯 내의 제 1 물리 채널의 제 1 무선 자원 할당 량 및 제 2 물리 채널의 제 2 무선 자원 할당량을 확인하고, 상기 제 1 무선 자원 할당량 및 상기 제 2 무선 자 원 할당량에 대응하는 연산을 상기 전자 장치에 의하여 지원되는 제 1 하드웨어 자원에 의하여 수행 가능한 경 우, 상기 제 1 물리 채널 및 상기 제 2 물리 채널을 상기 제 1 하드웨어 자원에 할당하고, 상기 제 1 무선 자 원 할당량 및 상기 제 2 자원 무선 할당량에 대응하는 연산을 상기 전자 장치에 의하여 지원되는 상기 제 1 하 드웨어 자원에 의하여 수행 불가능한 경우, 상기 제 1 물리 채널 또는 상기 제 2 물리 채널 중 하나의 물리 채 널을 상기 제 1 하드웨어 자원에 할당하고, 나머지 채널을 상기 제 1 하드웨어 자원과 상이한 제 2 하드웨어 자 원에 할당하도록 야기할 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어(예: 프로그 램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서)는, 저장 매체로 부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상 기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함 할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않 는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되 는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1a 도면1b 도면2 도면3a 도면3b 도면4 도면5 도면6 도면7 도면8 도면9 도면10 도면11"}
{"patent_id": "10-2022-0031051", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1a는 다양한 실시예에 따른 RIC, RAN 및 코어 네트워크(core network, CN)를 설명하기 위한 블록도를 도시한 다. 도 1b는, 다양한 실시예에 따른 전자 장치의 하드웨어적 구성을 설명하기 위한 블록도를 도시한다. 도 2는, 다양한 실시예에 따른 하드웨어 자원 할당을 위한 엔티티를 설명하기 위한 블록도이다. 도 3a는 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 3b는 다양한 실시예에 따른 제어 플레인 메시지 및 사용자 플레인 데이터의 송수신을 설명하기 위한 흐름도 이다. 도 4는 다양한 실시예에 따른 물리 채널들의 하드웨어 자원의 할당을 설명하기 위한 도면이다. 도 5는 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 6은 다양한 실시예에 따른 물리 채널들의 하드웨어 자원의 할당을 설명하기 위한 도면이다. 도 7은 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 8은 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 9는 다양한 실시예에 따른 전자 장치의 동작을 설명하기 위한 흐름도를 도시한다. 도 10은 다양한 실시예와의 비교를 위한 비교예에 따른 물리 채널의 할당 및 다양한 실시예에 따른 물리 채널의 할당을 설명하기 위한 도면이다. 도 11은 다양한 실시예와의 비교를 위한 비교예에 따른 물리 채널의 할당 및 다양한 실시예에 따른 물리 채널의 할당을 설명하기 위한 도면이다."}
