{"patent_id": "10-1999-0035662", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2001-0019317", "출원번호": "10-1999-0035662", "출원인": "바이오닉스 주식회사    황현배", "발명자": "황현배"}}
{"patent_id": "10-1999-0035662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전원이 온된 상태에서 얼굴 키, 바디/배 키 또는 모공수축 키가 입력되는지를 판단하는 제1과정;상기 제1과정에서 얼굴 키가 입력될 경우에 주름 제거모드를 설정하고 주름 제거루틴을 수행 및 초음파로 얼굴을 주름을 제거하는 제2과정;상기 제1과정에서 바디/배 키가 입력될 경우에 비만 치료모드를 설정하고 비만 치료루틴을 수행하여 초음파로 비만을 치료하는 제3과정; 및상기 제1과정에서 모공수축 키가 입력될 경우에 냉열을 발생하여 얼굴의 모공을 수축시키는 제4과정으로 이루어짐을 특징으로 하는 초음파를 이용한 피부 미용방법."}
{"patent_id": "10-1999-0035662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 제2과정의 주름 제거루틴은;주름 제거시간을 설정하고 초음파 진동자를 최저 레벨로 구동시켜 얼굴을 주름을 제거하면서 키신호의 입력 또는 설정된 주름 제거시간이 경과되는지를 판단하는 제21과정;상기 제21과정에서 강 또는 약 키가 입력될 경우에 주름 제거모드의 설정된 초음파 출력 레벨의 범위에서 강 또는 약 키에 따라 초음파의 출력레벨을 조절하는 제22과정;상기 제21과정에서 인공지능 키가 입력될 경우에 주름 제거모드의 설정된 초음파 출력 레벨의 범위에서 초음파 출력레벨을 랜덤하게 가변시켜 출력하는 제 23 과정; 및상기 제21과정에서 설정된 주름 제거시간이 경과될 경우에 초음파의 출력을 정지시키는 제24과정으로 이루어짐을 특징으로 하는 초음파를 이용한 피부 미용방법."}
{"patent_id": "10-1999-0035662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 또는 제2항에 있어서, 상기 제3과정의 비만 치료루틴은;비만 치료시간을 설정하고 초음파 진동자를 최저 레벨로 구동시켜 바디/배의 비만을 치료하면서 키신호의 입력 또는 설정된 비만 치료시간이 경과되는지를 판단하는 제31과정;상기 제31과정에서 강 또는 약 키가 입력될 경우에 초음파의 최저 및 최대 출력 레벨의 범위에서 강 또13-6공개특허10-2001-0019317는 약 키에 따라 초음파의 출력레벨을 조절하는 제 32 과정;상기 제31과정에서 인공지능 키가 입력될 경우에 비만 치료모드의 초음파의 최저 및 최대 출력 레벨의 범위에서 초음파 출력레벨을 랜덤하게 가변시켜 출력하는 제33과정; 및상기 제31과정에서 설정된 비만 치료시간이 경과될 경우에 초음파의 출력을 정지시키는 제34과정으로 이루어짐을 특징으로 하는 초음파를 이용한 피부 미용방법."}
{"patent_id": "10-1999-0035662", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "초음파를 발생하여 주름 제거 및 비만 치료의 전체 동작을 제어하는 제어부;전원을 온하는 초기에 상기 제어부를 리세트시켜 초기화시키는 초기 리세트부;발진하여 발진신호를 상기 제어부에 동작 클럭신호로 공급하는 발진부;사용자의 조작에 따른 동작 명령을 상기 제어부로 입력시키는 키 입력부;상기 제어부의 제어에 따라 피부 미용장치의 동작을 표시하는 표시부;상기 제어부의 제어에 따라 경보음을 발생하는 경보부;상기 제어부의 제어에 따라 열전소자를 구동시켜 냉열을 발생시키는 열전소자 구동부;발진하여 초음파를 발생하는 초음파 발진부;상기 초음파 발진부가 발생하는 초음파의 레벨을 상기 제어부의 제어에 따라 조절하는 레벨 조절부;상기 레벨 조절부에서 레벨이 조절된 초음파를 증폭하여 초음파 진동자로 출력하는 초음파 구동부; 및상기 초음파 진동자 및 열전소자가 내장되어 초음파 진동 및 냉열을 발생하는 미용 프로브로 구성됨을 특징으로 하는 초음파를 이용한 피부 미용장치.도면 도면113-7공개특허10-2001-0019317 도면213-8공개특허10-2001-0019317 도면313-9공개특허10-2001-0019317 도면413-10공개특허10-2001-0019317 도면513-11공개특허10-2001-0019317"}
{"patent_id": "10-1999-0035662", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 초음파 진동을 이용하여 얼굴의 주름을 제거하고, 인체의 바디(body) 및 배 등의 단백질과 지 방을 분해하여 비만을 치료하며, 냉열을 발생하여 모공을 수축하는 초음파를 이용한 피부 미용방법 및 그 장치에 관한 것이다. 본 발명의 목적은 초음파 진동을 이용하여 안면의 주름을 제거하는 초음파를 이용한 피부 미용방법 및 그 장치를 제공하는데 있다. 본 발명의 다른 목적은 초음파 진동으로 바디 및 배 등의 단백질 및 지방을 분해하여 비만을 치료하는 초음파를 이용한 피부 미용방법 및 그 장치를 제공하는데 있다. 이러한 목적을 달성하기 위한 본 발명의 초음파를 이용한 피부 미용방법에 따르면, 전원이 온된 상태에 서 얼굴 키, 바디/배 키 또는 모공수축 키가 입력되는지를 판단하여, 얼굴 키가 입력될 경우에 주름 제 거모드를 설정하고 주름 제거루틴을 수행 및 초음파로 얼굴을 주름을 제거하고, 바디/배 키가 입력될 경 우에 비만 치료모드를 설정하고 비만 치료루틴을 수행하여 초음파로 비만을 치료하며, 모공수축 키가 입 력될 경우에 냉열을 발생하여 얼굴의 모공을 수축시키는 것을 특징으로 한다."}
