{"patent_id": "10-2022-0034193", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0110139", "출원번호": "10-2022-0034193", "발명의 명칭": "전자 장치 및 로밍 방법", "출원인": "삼성전자주식회사", "발명자": "남천종"}}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서,무선 신호를 송수신하도록 구성된 하나 이상의 무선 통신 모듈;상기 무선 통신 모듈과 작동적으로(operatively) 연결된 하나 이상의 프로세서; 및상기 프로세서와 전기적으로 연결되고 상기 프로세서에 의해 실행 가능한 인스트럭션들을 저장하는 메모리를 포함하고,상기 프로세서에 의해 상기 인스트럭션들이 실행될 때, 상기 프로세서는,AP(access point)와 복수의 링크들을 형성하여 연결되어 있는 동안에 로밍의 트리거 여부를 판단하고,상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확인하고,상기 복수의 링크들의 상태에 따라 로밍 동작을 차별화하여 수행하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 프로세서는,상기 AP에 대한 파라미터를 모니터링하여 상기 로밍의 트리거 여부를 판단하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,상기 상태는,상기 로밍의 트리거에 연관된 링크의 개수, 전체 링크 퀄리티, 및 지정된 하나 이상의 링크 퀄리티 중에서 하나이상을 포함하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제3항에 있어서,상기 퀄리티는,링크의 쓰루풋(throughput)에 기초하는 것인, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서,상기 지정된 하나 이상은 로밍이 트리거되지 않은 하나 이상의 링크를 포함하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "공개특허 10-2023-0110139-3-제3항에 있어서,상기 로밍의 트리거에 연관된 링크의 개수는,상기 로밍이 트리거된 링크의 개수 또는 상기 로밍이 트리거되지 않은 링크의 개수인, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1항에 있어서,상기 프로세서는,상기 로밍 동작에 포함된 로밍 스캔 동작 및 AP 선택 동작 중에서 하나 이상을 상기 상태에 따라 차별화하여 수행하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,상기 프로세서는,로밍 스캔의 시작 여부, 로밍 스캔의 종류, 로밍 스캔의 기간(period), 및 지정된 링크에 대한 데이터 사용 유무 중에서 하나 이상을 상기 상태에 따라 차별화하여 상기 로밍 스캔 동작을 수행하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제7항에 있어서,상기 프로세서는,AP 선택 기준을 상기 상태에 따라 차별화하여 상기 AP 선택 동작을 수행하는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서,상기 프로세서는,통신 프로세서 또는 애플리케이션 프로세서로 구현되는, 전자 장치."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "전자 장치의 동작 방법에 있어서,AP(access point)와 복수의 링크들을 형성하여 연결되어 있는 동안에 로밍의 트리거 여부를 판단하는 동작;상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확인하는 동작; 및상기 복수의 링크들의 상태에 따라 로밍 동작을 차별화하여 수행하는 동작을 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,공개특허 10-2023-0110139-4-상기 판단하는 동작은,상기 AP에 대한 파라미터를 모니터링하여 상기 로밍의 트리거 여부를 판단하는 동작을 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,상기 상태는,상기 로밍의 트리거에 연관된 링크의 개수, 전체 링크 퀄리티, 및 지정된 하나 이상의 링크 퀄리티 중에서 하나이상을 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제13항에 있어서,상기 퀄리티는,링크의 쓰루풋(throughput)에 기초하는 것인, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제13항에 있어서,상기 지정된 하나 이상은 로밍이 트리거되지 않은 하나 이상의 링크를 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제13항에 있어서,상기 로밍의 트리거에 연관된 링크의 개수는,상기 로밍이 트리거된 링크의 개수 또는 상기 로밍이 트리거되지 않은 링크의 개수인, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제11항에 있어서,상기 로밍 동작을 차별화하여 수행하는 동작은,상기 로밍 동작에 포함된 로밍 스캔 동작 및 AP 선택 동작 중에서 하나 이상을 상기 상태에 따라 차별화하여 수행하는 동작을 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서,상기 하나 이상을 상기 상태에 따라 차별하여 수행하는 동작은,로밍 스캔의 시작 여부, 로밍 스캔의 종류, 로밍 스캔의 기간(period), 및 지정된 링크에 대한 데이터 사용 유공개특허 10-2023-0110139-5-무 중에서 하나 이상을 상기 상태에 따라 차별화하여 상기 로밍 스캔 동작을 수행하는 동작을 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서,상기 하나 이상을 상기 상태에 따라 차별하여 수행하는 동작은,AP 선택 기준을 상기 상태에 따라 차별화하여 상기 AP 선택 동작을 수행하는 동작을 포함하는, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제11항에 있어서,상기 전자 장치의 동작 방법은,통신 프로세서 또는 애플리케이션 프로세서에 의해서 수행되는 것인, 전자 장치의 동작 방법."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는 무선 신호를 송수신하도록 구성된 하나 이상의 무선 통신 모듈과, 상기 무선 통신 모듈과 작동적으로(operatively) 연결된 하나 이상의 프로세서와, 상기 프로세서와 전기적으로 연결되고 상 기 프로세서에 의해 실행 가능한 인스트럭션들을 저장하는 메모리를 포함하고, 상기 프로세서에 의해 상기 인스 트럭션들이 실행될 때, 상기 프로세서는, AP(access point)와 복수의 링크들을 형성하여 연결되어 있는 동안에 로밍의 트리거 여부를 판단하고, 상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확인하고, 상기 복수의 링크들의 상태에 따라 로밍 동작을 차별화하여 수행할 수 있다. 그 외에도 다양한 실시예들이 가능할 수 있다."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예들은 전자 장치 및 로밍 방법에 관한 것이다."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "전자 장치는 음성 통화, 영상 통화, 영상 스트리밍, 또는 인터넷과 같은 기능을 제공할 수 있다. 전자 장치에 서 제공되는 다양한 기능은 이동 통신 방식을 통해 제공되거나 무선 통신 방식을 통해 제공될 수 있다. 무선 통신 방식에는 Wi-Fi(wireless fidelity)가 있을 수 있다. Wi-Fi는 2.4GHz, 5GHz, 또는 6GHz 주파수 대 역에서 인터넷에 접속 가능하게 하는 WLAN(wireless local area network) 기술이다. 전자 장치는 AP(access point)를 통해 네트워크(예: Wi-Fi 네트워크)에 연결될 수 있다. AP의 커버리지는 제한되어 있어, 전자 장치는 전자 장치의 이동에 따라 현재 연결된 AP에서 다른 AP로의 로밍(roaming)을 수행하여 끊김 없는 무선 통신을 수 행할 수 있다."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "로밍(예: Inter AP 로밍)은 적어도 하나의 AP와 연결되어 통신하는 도중 적어도 하나의 다른 AP와 연결하는 일 련의 동작을 의미할 수 있다. 전자 장치가 현재 연결된 AP를 통해 통신을 수행하는 중에 전자 장치의 이동으로 인하여 현재 연결된 AP로부터 멀어지거나 다른 이유로 인해서 현재 연결된 AP와의 통신 상황이 좋지 않게 된 경 우, 전자 장치는 적어도 하나의 다른 AP를 찾기 위해 스캔(scan) 동작을 수행하고, 지정된 조건을 만족하는 AP 를 찾게 되면 해당 AP와 끊김 없이 새로운 연결을 생성할 수 있다. 전술한 로밍 동작은 와이파이 링크가 1개인 경우에 대해서만 고려가 되어 있어 불필요한 동작이나 기대하지 않았던 동작을 발생시킬 수 있다. 복수 개가 형성된 와이파이 링크를 고려한 로밍 동작이 요구될 수 있다. 다양한 실시예들은 복수의 링크들의 상태에 따라 로밍 동작을 차별화하는 기술을 제공할 수 있다. 본 문서에서 이루고자 하는 기술적 과제는 이상에서 언급한 기술적 과제로 제한되지 않으며, 언급되지 않은 또 다른 기술적 과제들은 아래의 기재로부터 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는 무선 신호를 송수신하도록 구성된 하나 이상의 무선 통신 모듈과, 상기 무선 통신 모듈과 작동적으로(operatively) 연결된 하나 이상의 프로세서와, 상기 프로세서와 전기적으로 연결되고 상기 프로세서에 의해 실행 가능한 인스트럭션들을 저장하는 메모리를 포함하고, 상기 프로세서에 의해 상기 인 스트럭션들이 실행될 때, 상기 프로세서는, AP(access point)와 복수의 링크들을 형성하여 연결되어 있는 동안 에 로밍의 트리거 여부를 판단하고, 상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확인하고, 상 기 복수의 링크들의 상태에 따라 로밍 동작을 차별화하여 수행할 수 있다. 다양한 실시예에 따른 전자 장치의 동작 방법은 AP(access point)와 복수의 링크들을 형성하여 연결되어 있는 동안에 로밍의 트리거 여부를 판단하는 동작과, 상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확인하는 동작과, 상기 복수의 링크들의 상태에 따라 로밍 동작을 차별화하여 수행하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예들은 복수의 링크들이 형성되어 있는 상황에서 복수의 링크들의 상태에 따라 로밍 동작을 차별화 하여 수행함으로써 효율적으로 로밍 동작을 수행할 수 있다. 다양한 실시예들은 로밍 동작의 차별화에 따라서 사용자에게 불편함이 없이 와이파이를 연속적으로 사용할 수 있도록 할 수 있다. 이 외에, 본 문서를 통해 직접적 또는 간접적으로 파악되는 다양한 효과들이 제공될 수 있다."}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 실시예들을 첨부된 도면들을 참조하여 상세하게 설명한다. 첨부 도면을 참조하여 설명함에 있어, 도면 부호에 관계없이 동일한 구성 요소는 동일한 참조 부호를 부여하고, 이에 대한 중복되는 설명은 생략하기로 한 다. 도 1은 다양한 실시예들에 따른 무선랜 시스템의 일 예를 나타낸다. 도 1을 참조하면, 다양한 실시예에 따르면, 무선랜 시스템은 IEEE(institute of electrical and electronic engineers) 802.11의 무선랜(WLAN)의 구조에서 AP(access point)가 존재하는 인프라스트럭처 모드 (infrastructure mode)를 나타내는 것일 수 있다. 무선랜 시스템은 하나 이상의 BSS(basic service set) (예: BSS1, BSS2)을 포함할 수 있다. BSS(BSS1, BSS2)는 성공적으로 동기화를 이루어서 서로 통신할 수 있는 AP 및 STA(station)(예: 도 13의 전자 장치, 전자 장치, 또는 전자 장치)의 집합을 의미할 수 있다. BSS1은 AP1 및 STA1을 포함하고, BSS2는 하나의 AP2에 둘 이상의 결합 가능한 STA2 및 STA3을 포함 할 수 있다. 다양한 실시예에 따르면, 무선랜 시스템은 적어도 하나의 STA(STA1~STA3), 분산 서비스(distribution service)를 제공하는 AP(AP1, AP2), 및 복수의 AP(AP1, AP2)를 연결시키는 분산 시스템(distribution system)을 포함할 수 있다. 분산 시스템은 복수의 BSS(BSS1, BSS2)를 연결하여 확장된 서비스 셋인 ESS(extended service set)를 구현할 수 있다. ESS는 하나 이상의 AP(AP1, AP2)가 분산 시스템을 통해 연결되어 이루어진 하나의 네트워크를 지시하는 용어로 사용될 수 있다. 하나의 ESS에 포함되는 AP(AP1, AP2) 는 동일한 SSID(service set identification)를 가질 수 있다. 다양한 실시예에 따르면, STA(STA1~STA3)는 IEEE 802.11 표준의 규정을 따르는 매체 접속 제어(medium access control(MAC))와 무선 매체에 대한 물리 계층(physical layer) 인터페이스를 포함하는 임의의 기능 매체일 수 있다. STA(STA1~STA3)는 AP와 비-AP STA(Non-AP station)을 모두 포함하는 의미로 사용될 수 있다. STA(STA1~STA3)는 전자 장치(electronic device), 이동 단말(mobile terminal), 무선 기기(wireless device), 무선 송수신 유닛(wireless transmit/receive unit(WTRU)), 사용자 장비(user equipment(UE)), 이동국(mobile station(MS)), 이동 가입자 유닛(mobile subscriber unit) 또는 단순히 유저(user)와 같이 다양한 명칭으로도 불릴 수 있다. 도 2는 다양한 실시예들에 따른 무선랜 시스템의 다른 예를 나타낸다. 도 2를 참조하면, 다양한 실시예에 따르면, 무선랜 시스템은 도 1의 무선랜 시스템과 달리 IEEE 802.11 의 무선랜(WLAN)의 구조에서 AP없이 STA 사이에서 네트워크를 설정하여 통신을 수행하는 애드-혹 모드(Ad-hoc mode)를 나타내는 것일 수 있다. 무선랜 시스템은 애드-혹 모드로 동작하는 BSS, 즉 독립 BSS(independent basic service set(IBSS))를 포함할 수 있다. 다양한 실시예에 따르면, IBSS는 AP를 포함하지 않기 때문에 중앙에서 관리 기능을 수행하는 개체(centralized management entity)가 없을 수 있다. IBSS에서 STA들은 분산된 방식(distributed manner)으로 관리될 수 있다. IBSS에서는 모든 STA가 이동 STA으로 이루어질 수 있으며, 분산 시스템(예: 도 1의 분산 시스템)으 로의 접속이 허용되지 않아서 자립형 네트워크(또는 일체형 네트워크)(self-contained network)를 이룰 수 있다. 도 3은 다양한 실시예들에 따른 링크 셋업 동작을 설명하기 위한 도면이다. 도 3을 참조하면, 다양한 실시예에 따르면, 장치들(예: STA, AP) 간에는 서로 통신을 수행하기 위해 링크 셋업 동작이 수행될 수 있다. 링크 셋업을 위해서는 네트워크를 발견(discovery)하고, 인증 (authentication)을 수행하고, 어소시에이션(association)을 맺고(establish), 보안(security)을 위한 설정 동 작이 수행될 수 있다. 링크 셋업 동작은 세션 개시 동작, 또는 세션 셋업 동작이라도 할 수 있다. 또한, 링크 셋업 동작의 발견, 인증, 어소시에이션, 및 보안 설정의 동작을 통칭하여 어소시에이션 동작이라고 할 수도 있 다. 다양한 실시예에 따르면, 네트워크 발견 동작은 동작 310 및 동작 320을 포함할 수 있다. 동작 310에서, STA(예: 도 16의 전자 장치, 전자 장치, 또는 전자 장치)는 어떤 AP가 존재하는지 탐 색하기 위해 프로브 요청 프레임(probe request frame)을 전송하고 이에 대한 응답을 기다릴 수 있다. STA는 네트워크에 액세스하기 위해 스캐닝 동작을 수행하여 참여 가능한 네트워크를 찾을 수 있다. 스캐 닝 동작은 능동적 스캐닝(active scanning) 동작과 수동적 스캐닝(passive scanning) 동작을 포함할 수 있다. 동작 320에서, AP는 프로브 요청 프레임을 전송한 STA에게 프로브 요청 프레임에 대한 응답으로 프로 브 응답 프레임(probe response frame)을 전송할 수 있다.다양한 실시예에 따르면, STA가 네트워크를 발견한 후에, 동작 330 및 동작 340이 포함된 인증 동작이 수 행될 수 있다. 동작 330에서, STA는 인증 요청 프레임(authentication request frame)을 AP에게 전 송할 수 있다. 동작 340에서, AP는 인증 요청 프레임에 포함된 정보에 기초하여 해당 STA에 대한 인 증을 허용할 지 여부를 결정할 수 있다. AP는 인증 처리의 결과를 인증 응답 프레임(authentication response frame)을 통하여 STA에게 제공할 수 있다. 인증 요청/응답에 사용되는 인증 프레임 (authentication frame)은 관리 프레임에 해당할 수 있다. 다양한 실시예에 따르면, 인증 프레임은 인증 알고리즘 번호(authentication algorithm number), 인증 트랜잭션 시퀀스 번호(authentication transaction sequence number), 상태 코드(status code), 검문 텍스트(challenge text), RSN(robust security network), 또는 유한 순환 그룹(finite cyclic group)에 대한 정보를 포함할 수 있다. 다양한 실시예에 따르면, STA가 성공적으로 인증된 후에, 동작 350 및 동작 360이 포함된 어소시에이션 동 작이 수행될 수 있다. 동작 350에서, STA는 어소시에이션 요청 프레임(association request frame)을 AP에게 전송할 수 있다. 동작 360에서, AP는 어소시에이션 요청 프레임에 응답하여 어소시에이션 응 답 프레임(association response frame)을 STA에게 전송할 수 있다. 다양한 실시예에 따르면, 어소시에이션 요청 프레임 및/또는 어소시에이션 응답 프레임을 다양한 능력 (capability)에 관련된 정보를 포함할 수 있다. 예를 들어, 연결 요청 프레임은 다양한 능력(capability)에 관 련된 정보, 비콘 청취 간격(listen interval), SSID(service set identifier), 지원 레이트(supported rates), 지원 채널(supported channels), RSN, 이동성 도메인, 지원 오퍼레이팅 클래스(supported operating classes), TIM 방송 요청(traffic indication map broadcast request), 및/또는 상호동작(interworking) 서비스 능력에 대한 정보를 포함할 수 있다. 예를 들어, 연결 응답 프레임은 다양한 능력에 관련된 정보, 상태 코드, AID(association ID), 지원 레이트, EDCA(enhanced distributed channel access) 파라미터 세트, RCPI(received channel power indicator), RSNI(received signal to noise indicator), 이동성 도메인, 타임 아웃 간격(연관 컴백 시간(association comeback time)), 중첩(overlapping) BSS 스캔 파라미터, TIM 방송 응 답, 및/또는 QoS 맵과 같은 정보를 포함할 수 있다. 다양한 실시예에 따르면, STA가 네트워크에 성공적으로 어소시에이션된 후에, 동작 370 및 동작 380이 포 함된 보안 셋업 동작이 수행될 수 있다. 보안 셋업 동작은 RSNA(robust security network association) 요청/ 응답을 통해 수행될 수 있다. 예를 들어, 보안 셋업 동작은 EAPOL(extensible authentication protocol over LAN) 프레임을 통한 4-웨이(way) 핸드쉐이킹을 통해서, 프라이빗 키 셋업(private key setup)을 하는 동작을 포 함할 수 있다. 보안 셋업 동작은 IEEE 802.11 표준에서 정의하지 않는 보안 방식에 따라 수행될 수도 있다. 다양한 실시예에 따르면, STA와 AP 사이에는 보안 셋업 동작에 따라 보안 세션이 설정되고, STA(30 1)와 AP는 안전한(secure) 데이터 통신을 진행할 수 있다. 도 4는 다양한 실시예에 따른 멀티 링크 통신을 설명하기 위한 도면이다. 도 4를 참조하면, 장치들(예: STA, AP)은 멀티 링크(또는 멀티 밴드) 통신을 지원할 수 있다. 멀티 링크 통신을 지원하는 장치들(예: STA, AP)은 복수의 링크들(예: 복수의 링크들(410~430))을 통해 동 시에 통신을 수행할 수 있다. 링크는 2.4 GHz 밴드, 5 GHz 밴드, 6 GHz 밴드, 및/또는 지정 밴드에서 정의되는 하나의 채널(예: 20/40/80/160/240/320 MHz 대역폭을 갖는 채널)을 포함할 수 있다. 멀티 링크 통신은 복수의 링크들(예: 복수의 링크들(410~430))을 지원하는 통신을 의미하며, STA 및/또는 AP가 복수의 밴드들 (예: 2.4 GHz 밴드, 5 GHz 밴드, 6 GHz 밴드, 및/또는 지정 밴드)에서 정의된 채널에서 통신을 동시에 수행한다 는 것을 의미할 수 있다. STA와 AP는 2.4 GHz 밴드, 5 GHz 밴드, 6 GHz 밴드, 및/또는 지정 밴드 중에서 둘 이상을 지원하는 멀티 링크 통신을 수행할 수 있다. 다양한 실시예에 따르면, STA는 2.4GHz 밴드, 5GHz 밴드, 및 6 GHz 밴드의 채널(예: 모든 채널)에서 AP 탐색을 위한 스캔 동작(예: 스캐닝)을 수행할 수 있다. STA는 밴드에 대해서 스캔 동작을 순차적으로 수 행할 수 있고, 둘 이상의 밴드에 대해서 동시에 스캔 동작을 수행할 수도 있다. 다양한 실시예에 따르면, STA는 스캔 동작을 통해 검출된(또는 식별된) 하나 이상의 후보 AP 중에서 타겟 AP(예: 접속하려는 AP)로 AP를 결정할 수 있다. 이후, STA와 AP 사이에는 인증 동작(예: 도 3의 동작 330 및 동작 340), 어소시에이션 동작(예: 도 3의 동작 350 및 동작 360), 및 보안 셋업 동작(예: 도 3 의 동작 370 및 동작 380)이 수행되며, STA는 AP와 복수의 링크들(410~430)을 형성하여 통신을 수행 할 수 있다. 도 5는 다양한 실시예에 따른 2.4 GHz 밴드 내에서 사용/지원/정의되는 채널의 일 예를 나타낸다. 도 5를 참조하면, 2.4 GHz 밴드는 중심 주파수가 2.4 GHz에 인접한 채널(예: 중심 주파수가 2.4 내지 2.5 GHz 내에 위치하는 채널)들이 사용/지원/정의되는 주파수 영역을 의미할 수 있다. 2.4 GHz 밴드는 20 MHz 대역폭을 갖는 복수의 채널들을 포함할 수 있다. 2.4 GHz 밴드 내의 각 20 MHz 대역폭을 갖는 채널은 채널 인덱스(예: 채널 인덱스 1 내지 채널 인덱스 14)를 가질 수 있다. 예를 들어, 채널 인덱스 1이 할당되는 20 MHz 대역폭을 갖는 채널의 중심 주파수는 2.412 GHz일 수 있고, 채널 인덱스 2가 할당되는 20 MHz 대역폭을 갖는 채널의 중심 주파수는 2.417 GHz일 수 있고, 채널 인덱스 N이 할당되는 20 MHz 대역폭을 갖는 채널의 중심 주파수는 (2.407 + 0.005*N) GHz일 수 있다. 채널 인덱스는 채널 번호 등의 다양한 명칭으로 불릴 수 있다. 채널 인덱스 및 중 심 주파수의 구체적인 수치는 변경될 수 있다. 도 5에서는 2.4 GHz 밴드 내의 4개의 채널을 예시적으로 나타낸 것일 수 있다. 제1 주파수 영역 내지 제4 주파수 영역은 각각 하나의 채널을 포함할 수 있다. 예를 들어, 제1 주파수 영역은 채널 1(예: 1번 채널 인덱스를 가지는 20 MHz 대역폭을 갖는 채널)을 포함하며, 채널 1의 중심 주파수는 2412 MHz로 설정될 수 있다. 제2 주파수 영역은 채널 6을 포함하며, 채널 6의 중심 주파수는 2437 MHz로 설정될 수 있다. 제3 주파수 영역은 채널 11을 포함하며, 채널 11의 중심 주파수는 2462 MHz로 설정될 수 있다. 제4 주파수 영 역은 채널 14를 포함하며, 채널 14의 중심 주파수는 2484 MHz로 설정될 수 있다. 도 6은 다양한 실시예에 따른 5 GHz 밴드 내에서 사용/지원/정의되는 채널의 일 예를 나타낸다. 도 6을 참조하면, 5 GHz 밴드는 중심 주파수가 5 GHz 이상 6 GHz 미만(또는 5.9 GHz 미만)인 채널들이 사용/지 원/정의되는 주파수 영역을 의미할 수 있다. 또는, 5 GHz 밴드는 4.5 GHz에서 5.5 GHz 사이에서 복수 채널들을 포함할 수 있다. 도 6에 도시된 구체적인 수치는 변경될 수 있다. 5 GHz 밴드 내의 복수의 채널들은 UNII(unlicensed national information infrastructure)-1, UNII-2, UNII-3, ISM을 포함한다. UNII-1은 UNII Low로 불릴 수 있다. UNII-2는 UNII Mid와 UNII-2Extended로 불리는 주파수 영역을 포함할 수 있다. UNII- 3은 UNII-Upper로 불릴 수 있다. 5 GHz 밴드 내에는 복수의 채널들이 설정될 수 있고, 각 채널의 대역폭은 20 MHz, 40 MHz, 80 MHz 또는 160 MHz와 같이 다양하게 설정될 수 있다. 예를 들어, UNII-1 및 UNII-2 내의 5170 MHz 내지 5330MHz 주파수 영역 /범위는 8개의 20 MHz 채널로 구분될 수 있다. 5170 MHz에서 5330MHz 주파수 영역/범위는 40 MHz 주파수 영역 을 통하여 4개의 채널로 구분될 수 있다. 5170 MHz에서 5330MHz 주파수 영역/범위는 80 MHz 대역폭을 갖는 2개 의 채널로 구분될 수 있다. 또는, 5170 MHz에서 5330MHz 주파수 영역/범위는 160 MHz 대역폭을 갖는 1개의 채 널로 구분될 수 있다. 도 7은 다양한 실시예에 따른 6 GHz 밴드 내에서 사용/지원/정의되는 채널의 일 예를 나타낸다. 도 7을 참조하면, 6 GHz 밴드는 중심주파수가 5.9 GHz 이상인 채널들이 사용/지원/정의되는 주파수 영역을 의미 할 수 있다. 20 MHz 대역폭을 갖는 채널은 5.940 GHz부터 정의될 수 있다. 예를 들어, 도 7의 20 MHz 대역폭 을 갖는 채널들 중 최-좌측 채널은 1번 채널 인덱스를 가질 수 있고, 중심 주파수는 5.945 GHz가 할당될 수 있 다. 채널 인덱스 N번 채널의 중심 주파수는 (5.940 + 0.005*N) GHz로 결정될 수 있다. 도 7에 도시된 구체적 인 수치는 변경될 수 있다. 도 7에서, 20 MHz 대역폭을 갖는 채널의 채널 인덱스는, 1, 5, 9, 13, 17, 21, 25, 29, 33, 37, 41, 45, 49, 53, 57, 61, 65, 69, 73, 77, 81, 85, 89, 93, 97, 101, 105, 109, 113, 117, 121, 125, 129, 133, 137, 141, 145, 149, 153, 157, 161, 165, 169, 173, 177, 181, 185, 189, 193, 197, 201, 205, 209, 213, 217, 221, 225, 229, 233일 수 있다. 또한, 상술한 (5.940 + 0.005*N) GHz 규칙에 따라 도 7의 40 MHz 대역폭을 갖는 채 널의 인덱스는 3, 11, 19, 27, 35, 43, 51, 59, 67, 75, 83, 91, 99, 107, 115, 123, 131, 139, 147, 155,163, 171, 179, 187, 195, 203, 211, 219, 227일 수 있다. 6 GHz 밴드 내에는 복수의 채널들이 설정될 수 있고, 각 채널의 대역폭은 20 MHz, 40 MHz, 80 MHz 또는 160 MHz와 같이 다양하게 설정될 수 있다. 도 7에서는 20, 40, 80, 또는 160 MHz 대역폭을 갖는 채널이 도시되지만, 추가적으로 240 MHz 대역폭을 갖는 채널이나 320 MHz 대역폭을 갖는 채널이 추가될 수 있다. 도 8은 다양한 실시예에 따라 로밍 동작을 설명하기 위한 도면이다. 도 8을 참조하면, 다양한 실시예에 따르면, STA는 AP(예: AP, AP)를 통해 네트워크에 연결될 수 있다. AP(예: AP)의 커버리지(예: 서비스 커버리지)는 제한되어 있기에, STA는 STA의 이동에 따라 현재 연결된 AP(예: AP)에서 다른 AP(예: AP)로의 로밍(roaming)(예: Inter AP 로밍)을 수행하 여 끊김 없는 무선 통신을 수행할 수 있다. STA는 AP(예: AP)와의 거리가 멀어지게 되거나 AP(예: AP)와의 통신 상황이 악화되는 경우 로밍을 수행할 수 있다. 다양한 실시예에 따르면, 로밍은 한 AP와 연결되어 통신하는 동안에 연결을 끊지 않고 다른 AP로 연결을 이동하 는 일련의 동작(또는 프로세스)을 의미할 수 있다. 로밍 동작은 로밍 트리거 동작(예: 로밍이 필요한지 판단하 는 동작), 로밍 스캔 동작, AP 선택 동작(예: 로밍할 타겟 AP 선택 동작), 인증 동작(예: 도 3의 동작 330 및 동작 340), 어소시에이션 동작(예: 도 3의 동작 350 및 동작 360), 및 보안 셋업 동작(예: 도 3의 동작 370 및 동작 380)을 포함할 수 있다. 이하에서는, STA가 수행하는 로밍 동작을 상세히 설명하도록 한다. 동작 810에서, STA는 현재 연결된 AP와 통신을 수행하는 동안에 로밍의 트리거 여부(예: 로밍 수행의 필요 여부)를 판단할 수 있다. STA는 AP에 대한 파라미터(예: RSSI, Tx Error rate, 및/또는 SNR(signal to noise rate))를 모니터링하고 모니터링된 파라미터의 값이 지정된 임계값(예: RSSI의 경우 -75dBm) 이하가 되는 경우 로밍이 필요하다고 판단할 수 있다. 동작 820에서, STA는 현재 접속하고 있는 AP 외에 무선 통신 연결을 위해 접속할 수 있는 AP(예: 로 밍할 수 있는 AP)를 탐색하는 로밍 스캔 동작을 수행할 수 있다. STA는 2.4GHz 밴드, 5GHz 밴드, 및/또는 6 GHz 밴드에서 AP 탐색을 위한 전체 스캔(full scan) 및/또는 부분 스캔(partial scan)을 수행할 수 있다. 전체 스캔은 이용 가능한 채널들 전체에 대한 스캔이고, 부분 스캔은 이용 가능한 채널들 전체에 대한 스캔이 아닌 적어도 하나의 채널에 대한 스캔을 의미할 수 있다. 전체 스캔 및/또는 부분 스캔은 하나 이상의 지정 밴 드(예: 2.4GHz 밴드, 5GHz 밴드, 및/또는 6 GHz 밴드)에 대해서 수행되는 것일 수 있다. STA는 AP 연결 시 생성한 채널 리스트(예: 로밍 스캔 채널 리스트)를 이용하여 부분 스캔을 수행할 수 있다. 또한, STA는 밴드에 대해서 로밍 스캔 동작을 순차적으로 수행할 수 있고, 둘 이상의 밴드에 대해서 동시에 스캔 동작을 수행할 수도 있다. 동작 830에서, STA는 로밍 스캔 동작을 통해 탐색된(또는 식별된) 접속할 수 있는 하나 이상의 AP에서 지 정된 조건을 만족하는 후보 AP를 로밍할 타겟 AP로 선택할 수 있다. STA는 탐색된 하나 이상의 AP에서 AP 선택 기준(예: RSSI, Channel Utilization, SNR, MAX Link Rate, Estimated Throughput와 같은 파라미터, Channel, 또는 Band)에 따른 조건을 만족하는 후보 AP(예: RSSI의 경우 현재 연결된 AP보다 10dBm 이상 좋은 AP)를 선택하고, 선택된 후보 AP 중에서 가장 좋은 AP(예: RSSI가 가장 좋은 AP)를 로밍할 타겟 AP로 결정할 수 있다. 예를 들어, AP 선택 기준은 RSSI, Channel Utilization, SNR, MAX Link Rate, 또는 Estimated Throughput와 같은 파라미터를 포함하고, 상술한 파라미터 중 하나 이상을 기준으로 계산되는 score 를 포함할 수 있다. 또한, AP 선택 기준은 AP 선택을 위한 지정 밴드 및/또는 지정 채널의 선택 및 제외를 포 함할 수 있다. STA는 후보 AP가 없으면 로밍 스캔 기간 및 로밍 스캔 종류(예: 전체 스캔, 부분 스캔) 중 에서 하나를 조절하여 동작 820을 수행할 수 있다. 동작 840에서, STA가 로밍할 타겟 AP를 결정(예: 발견, 선택)한 후에, STA와 타겟 AP 사 이에 인증 동작(또는 재인증 동작)(예: 도 3의 동작 330 및 동작 340)이 수행될 수 있다. 동작 850에서, STA가 성공적으로 인증된 후에, STA와 타겟 AP 사이에 어소시에이션 동작(또는 재어소시에이션 동작)(예: 도 3의 동작 350 및 동작 360)이 수행될 수 있다. 동작 860에서, STA가 네트워크에 성공적으로 어소시에이션된 후에, STA와 타겟 AP 사이에 보안 셋업 동작(예: 도 3의 동작 370 및 동작 380)이 수행될 수 있다. STA와 AP 사이에는 보안 셋업 동작에 따라 보안 세션이 설정되고, STA와 AP는 안전한 (secure) 데이터 통신을 진행할 수 있다. AP와 AP는 하나의 ESS에 포함되어 동일한 SSID(service set identification)를 가질 수 있지만, 반드시 이에 한정되는 것은 아니다. 도 9는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍을 설명하기 위한 도면이다. 도 9를 참조하면, 다양한 실시예에 따르면, STA 및 AP는 멀티 링크(또는 멀티 밴드) 통신을 지원할 수 있다. STA가 AP에 접속한 경우, STA 및 AP 사이에는 복수의 링크들(예: 제1 링크 , 제2 링크, 및/또는 제3 링크)이 형성될 수 있다. 제1 링크는 6 GHz 밴드에서 정의되는 하나의 채널을 포함하고, 제2 링크는 5 GHz 밴드에서 정의되는 하나의 채널을 포함하고, 제3 링크는 2.4 GHz 밴드에서 정의되는 하나의 채널을 포함할 수 있다. 다양한 실시예에 따르면, STA 및 AP 사이에 형성되어 있는 각 링크(410~430)에 대해 로밍은 트리거될 수 있다. STA는 각 링크(410~430)에서 AP에 대한 파라미터(예: RSSI, Tx Error rate, 및/또는 SNR(signal to noise rate))를 모니터링하고 모니터링된 각 링크(410~430) 중 적어도 하나의 링크의 파라미터의 값이 지정된 임계값 이하가 되는 경우 로밍이 필요하다고 판단할 수 있다. 예를 들어, STA가 이동을 하는 경우, AP의 제1 링크에 대한 RSSI가 -75dBm이하 보다 좋지 않게 되는 제1 위치에서 제1 링크 에 대해 로밍이 트리거되고, AP의 제2 링크에 대한 RSSI가 -75dBm이하 보다 좋지 않게 되는 제2 위치에서 제2 링크에 대해 로밍이 트리거되고, AP의 제3 링크에 대한 RSSI가 -75dBm이하 보다 좋지 않게 되는 제3 위치에서 제3 링크에 대해 로밍이 트리거될 수 있다. 다양한 실시예에 따르면, STA는 로밍의 트리거에 응답하여 복수의 링크들(410~430)의 상태를 확인할 수 있 다. 상태는 로밍의 트리거에 연관된 링크의 개수, 전체 링크 퀄리티, 및 지정된 하나 이상의 링크 퀄리티 중에 서 하나 이상을 포함할 수 있다. 다양한 실시예에 따르면, STA는 복수의 링크들(410~430)의 상태에 따라 로밍 동작을 차별화하여 수행할 수 있다. STA는 로밍 동작에 포함된 로밍 스캔 동작 및 후보 AP 선택 동작 중에서 하나 이상을 복수의 링크 들(410~430)의 상태에 따라 차별화하여 수행할 수 있다. 다양한 실시예에 따르면, 로밍 동작은 복수의 링크들(410~430)의 상태에 따라 복수 개의 로밍 레벨로 차별화될 수 있으며, STA는 복수의 로밍 레벨들 중에서 복수의 링크들(410~430)에 대해 확인된 상태에 대응하는 로 밍 레벨로 로밍 동작을 수행할 수 있다. 로밍 동작에 포함된 로밍 스캔 동작 및 AP 선택 동작 중에서 하나 이 상이 차별화되어 복수 개의 로밍 레벨로 구분되어 정의되는 것일 수 있다. 로밍 스캔 동작에서는 로밍 스캔의 시작 여부, 로밍 스캔의 종류, 로밍 스캔의 기간(period), 및 지정된 링크에 대한 데이터 사용 유무 중에서 하 나 이상이 복수의 링크들(410~430)의 상태에 따라 차별화될 수 있다. AP 선택 동작에서는 AP 선택 기준(예: RSSI, Channel Utilization, SNR, MAX Link Rate, Channel, Band, 및/또는 Score와 같은 파라미터)이 복수의 링크들(410~430)의 상태에 따라 차별화될 수 있다. 다양한 실시예에 따르면, 로밍 동작은 로밍이 트리거되는 링크(예: 로밍이 트리거되는 링크의 개수)에 따라 복 수 개의 로밍 레벨로 차별화되어 정의된 일 예는 다음과 같을 수 있다. 로밍 레벨 1은 제1 링크의 로밍이 트리거된 경우이고, 로밍 레벨 2는 제1 링크 및 제2 링크의 로밍이 트리거된 경위고, 로밍 레벨 3은 제1 링크 내지 제3 링크의 로밍이 트리거된 경우를 고려한 것일 수 있다. STA는 순차적으로 로밍이 트리거되는 링크에 대해 불필요한 구간에서의 로밍 스캔 또는 중복된 로밍 스캔 을 수행하지 않음으로써 효율적인 로밍 스캔을 수행할 수 있다. 또한, STA는 현재 연결된 AP에 대해 어느 링크(예: 제1 링크)에 대해서만 로밍이 트리거된 경우 다른 링크(예: 2개의 링크들(420, 430))로 통 신이 가능한 하기에 현재 연결된 AP보다 좋은 AP가 발견되지 않는 이상 로밍을 수행하지 않을 수 있다. STA가 로밍 레벨 별로 로밍 동작을 효율적으로 수행함으로써, STA는 사용자에게 불편함이 없이 데이 터를 사용할 수 있도록 할 수 있다. 도 10은 다양한 실시예에 따른 멀티 링크 환경에서의 로밍의 예를 설명하기 위한 도면이다. 도 10에서는 설명의 편의를 위해 STA 및 AP가 형성하는 복수의 링크들(예: 제1 링크, 제2 링크 , 및/또는 제3 링크)의 두 밴드(예: 5GHz 및 6GHz)만을 도시한 것이고, STA가 도 9에서 정의된 로밍 레벨 1 내지 로밍 레벨 3을 이용하여 로밍 동작을 수행하는 것으로 가정한다. 도 10의 위치에서, STA는 6GHz의 링크가 트리거되어 로밍 레벨 1로 동작할 수 있다. STA는 6GHz 밴드에 대해서만 부분 스캔을 수행하고 더 이상 추가적인 스캔을 수행하지 않을 수 있다. STA는 5GHz와 2.4GHz 링크의 RSSI가 충분히 좋기 때문에 네트워크(예: 와이파이) 퀄리티는 보장될 것이며, 아직 로밍 이 꼭 필요한 상황은 아니라고 판단할 수 있다. STA가 위치로 이동하게 되면, 위치에서 로밍이 지속 트리거 중이지만, STA는 로밍 레벨 1로 동작하기에 RSSI가 20dBm 이상 좋은 후보 AP가 발견되어야 후보 AP를 선택할 수 있다. 위치에서 AP과 AP의 RSSI가 15dBm 차이가 난다고 가정하는 경우, STA는 AP의 RSSI가 AP의 RSSI보다 20dBm 이상 좋지는 않기에 AP로 로밍을 하지 않을 수 있다. STA가 위치으로 이동하게 되면, 5GHz의 링크에 대해 로밍이 트리거될 수 있다. STA는 6GHz와 5GHz의 링크가 트리거 되어 로밍 레벨 2로 동작할 수 있다. STA는 6GHz와 5GHz에 대해서 부분 스캔을 수 행하게 되며, 부분 스캔(예: 처음 부분 스캔)에서 후보 AP를 발견하지 못하면 2.4GHz에 대해서 부분 스캔을 수 행할 수 있다. 2.4GHz의 경우, STA가 조금 더 넓은 범위의 스캔을 할 수 있기에 앞으로 후보가 될 AP에 대해서 추가 정보를 획득할 수 있다. STA는 AP를 찾게 되고 이때 6GHz나 5GHz의 RSSI가 10dBm 이상 좋은 AP로 로밍할 수 있다.도 11은 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 일 예를 설명하기 위한 도면이다. 도 11에서, 동작 1110 내지 동작 1130은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아 니다. 예를 들어, 각 동작(1110~1130)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1110에서, STA(예: 도 9의 STA)는 AP(예: 도 9의 AP)와 복수의 링크들(예: 도 9의 복수의 링크 들(410~430))을 형성하여 연결되어 있는 동안에 로밍의 트리거 여부(예: 로밍 수행의 필요 여부)를 판단할 수 있다. STA는 AP에 대한 파라미터(예: RSSI, Tx Error rate, 및/또는 SNR(signal to noise rate))를 모니터링하고 모니터링된 파라미터의 값이 지정된 임계값 이하가 되는 경우 로밍이 필요하다고 판단할 수 있다. 동작 1120에서, STA는 로밍의 트리거에 응답하여 복수의 링크들(410~430)의 상태를 확인할 수 있다. 상태 는 로밍의 트리거에 연관된 링크의 개수, 전체 링크 퀄리티, 및 지정된 하나 이상의 링크 퀄리티 중에서 하나 이상을 포함할 수 있다. 동작 1130에서, STA는 복수의 링크들(410~430)의 상태에 따라 로밍 동작을 차별화하여 수행할 수 있다. 도 12는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 다른 예를 설명하기 위한 도면이다. 도 12는 STA(예: 도 9의 STA)가 로밍이 트리거된 이후 로밍이 트리거된 링크의 개수에 따라서 로밍 동작을 달리 수행하는 방법을 설명하기 위한 것일 수 있다. 도 12에서, 동작 1210 내지 동작 1250은 순차적으로 수행 될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1210~1250)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1210에서, STA는 AP(예: 도 9의 AP)와 연결할 수 있다. STA 및 AP는 멀티 링크(또 는 멀티 밴드) 통신을 지원할 수 있다. STA 및 AP 사이에는 복수의 링크들(예: 도 9의 복수의 링크 들(410~430))이 형성될 수 있다. 동작 1220에서, STA는 AP와 복수의 링크들(410~430)을 형성하여 연결되어 있는 동안에 AP에 대 한 파라미터(예: RSSI)를 모니터링할 수 있다. STA는 AP의 각 링크(410~430)에 대한 RSSI 값을 모 니터링할 수 있다. 일 실시예에 따르면, STA는 지정된 주기로 AP와 통신 연결된 복수의 링크들 (410~430)에 대한 파라미터(예: RSSI)를 모니터링할 수 있다. 동작 1230에서, STA는 각 링크(410~430) 중 적어도 하나의 링크의 RSSI 값이 지정된 임계값(예: -75dBm) 보다 작은 경우 각 링크(410~430)에 대해 로밍이 필요하다고 판단할 수 있다. 동작 1240에서, STA는 로밍의 트리거에 응답하여 로밍이 트리거된 링크의 개수를 확인할 수 있다. 동작 1250에서, STA는 로밍이 트리거된 링크의 개수에 따라 로밍 동작을 차별화하여 수행할 수 있다. 로 밍 동작의 로밍 레벨은 로밍이 트리거된 링크의 개수에 따라 복수 개로 구분되어 정의될 수 있다. N은 링크의 총 개수일 수 있지만, 반드시 이에 한정되는 것은 아니다. 예를 들어, 로밍 레벨은 트리거되는 링크의 개수를 범위로 구분함으로써 정의될 수도 있다. N은 2이상인 자연수일 수 있다. 다양한 실시예에 따르면, STA는 로밍이 트리거된 링크의 개수에 대응하는 로밍 레벨에 따른 로밍 동작을 수행할 수 있다. 도 13은 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 또 다른 예를 설명하기 위한 도면이다. 도 13은 도 12와 달리, STA(예: 도 9의 STA)가 로밍이 트리거된 이후 현재 로밍이 트리거되지 않은 링크의 개수에 따라서 로밍 동작을 달리 수행하는 방법을 설명하기 위한 것일 수 있다. 도 13에서, 동작 1310 내지 동 작 1350은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작 (1310~1350)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1310에서, STA는 AP(예: 도 9의 AP)와 연결할 수 있다. STA 및 AP는 멀티 링크(또 는 멀티 밴드) 통신을 지원할 수 있다. STA 및 AP 사이에는 복수의 링크들(예: 도 9의 복수의 링크들(410~430))이 형성될 수 있다. 동작 1320에서, STA는 AP와 복수의 링크들(410~430)을 형성하여 연결되어 있는 동안에 AP에 대 한 파라미터(예: RSSI)를 모니터링할 수 있다. STA는 AP의 각 링크(410~430)에 대한 RSSI 값을 모 니터링할 수 있다. 일 실시예에 따르면, STA는 지정된 주기로 AP와 통신 연결된 복수의 링크들 (410~430)에 대한 파라미터(예: RSSI)를 모니터링할 수 있다. 동작 1330에서, STA는 각 링크(410~430) 중 적어도 하나의 링크의 RSSI 값이 지정된 임계값(예: -75dBm) 보다 작은 경우 각 링크(410~430)에 대해 로밍이 필요하다고 판단할 수 있다. 동작 1340에서, STA는 로밍의 트리거에 응답하여 로밍이 트리거되지 않은 링크의 개수를 확인할 수 있다. 동작 1350에서, STA는 로밍이 트리거되지 않은 링크의 개수에 따라 로밍 동작을 차별화하여 수행할 수 있 다. 로밍 동작의 로밍 레벨은 로밍이 트리거되지 않은 링크의 개수에 따라 복수 개로 구분되어 정의될 수 있다. M은 링크의 총 개수일 수 있지만, 반드시 이에 한정되는 것은 아니다. 예를 들어, 로밍 레벨은 트리거 되지 않은 링크의 개수를 범위로 구분함으로써 정의될 수도 있다. M은 2 이상인 자연수일 수 있다. 다양한 실시예에 따르면, STA는 로밍이 트리거되지 않은 링크의 개수에 대응하는 로밍 레벨에 따른 로밍 동작을 수행할 수 있다. 도 14는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 또 다른 예를 설명하기 위한 도면이다. 도 14는 STA(예: 도 9의 STA)가 로밍이 트리거된 이후 모든 링크에 대해 퀄리티를 확인한 이후에 확인된 퀄리티(예: 전체 링크 퀄리티)에 따라서 로밍 동작을 달리 수행하는 방법을 설명하기 위한 것일 수 있다. 도 14에서, 동작 1410 내지 동작 1450은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1410~1450)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1410에서, STA는 AP(예: 도 9의 AP)와 연결할 수 있다. STA 및 AP는 멀티 링크(또 는 멀티 밴드) 통신을 지원할 수 있다. STA 및 AP 사이에는 복수의 링크들(예: 도 9의 복수의 링크 들(410~430))이 형성될 수 있다. 동작 1420에서, STA는 AP와 복수의 링크들(410~430)을 형성하여 연결되어 있는 동안에 AP에 대 한 파라미터(예: RSSI)를 모니터링할 수 있다. STA는 AP의 각 링크(410~430)에 대한 RSSI 값을 모 니터링할 수 있다. 일 실시예에 따르면, STA는 지정된 주기로 AP와 통신 연결된 복수의 링크들 (410~430)에 대한 파라미터(예: RSSI)를 모니터링할 수 있다. 동작 1430에서, STA는 각 링크(410~430) 중 적어도 하나의 링크의 RSSI 값이 지정된 임계값(예: -75dBm) 보다 작은 경우 각 링크(410~430)에 대해 로밍이 필요하다고 판단할 수 있다. 동작 1440에서, STA는 로밍의 트리거에 응답하여 링크 전체 퀄리티를 계산할 수 있다. 링크 전체 퀄리티 는 각 링크(410~430)의 쓰루풋(throughput)에 기초하여 계산될 수 있다. 쓰루풋은 수학식 1을 통해 계산될 수 있으며, 쓰루풋이 링크 퀄리티로 사용되는 것일 수 있다. STA는 각 링크(410~430) 별로 쓰루풋을 계산하 고, 계산될 쓰루풋들의 합을 링크 전체 퀄리티로 획득할 수 있다. [수학식 1]"}
{"patent_id": "10-2022-0034193", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "동작 1450에서, STA는 전체 링크 퀄리티에 따라 로밍 동작을 차별화하여 수행할 수 있다. 로밍 동작의 로 밍 레벨은 전체 링크 퀄리티의 값에 따라 복수 개로 구분되어 정의될 수 있다. K는 2 이상의 자연수로, 로밍 레벨은 하나 이상의 임계값(또는 임계 범위)에 의해서 2개 이상으로 구분되어 정의될 수 있다. 다양한 실시예에 따르면, STA는 로밍의 트리거 시에 계산된(또는 확인된) 전체 링크 퀄리티에 대응하는 로 밍 레벨에 따른 로밍 동작을 수행할 수 있다. 도 15는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 또 다른 예를 설명하기 위한 도면이다. 도 15는 STA(예: 도 9의 STA)가 로밍이 트리거된 이후 각 링크에 대해 퀄리티를 확인한 이후에 지정된 링 크 퀄리티(예: 하나 이상의 링크 퀄리티)에 따라서 로밍 동작을 달리 수행하는 방법을 설명하기 위한 것일 수 있다. 도 15에서, 동작 1510 내지 동작 1550은 순차적으로 수행될 수도 있으나, 반드시 순차적으로 수행되는 것은 아니다. 예를 들어, 각 동작(1510~1550)의 순서가 변경될 수도 있으며, 적어도 두 동작들이 병렬적으로 수행될 수도 있다. 동작 1510에서, STA는 AP(예: 도 9의 AP)와 연결할 수 있다. STA 및 AP는 멀티 링크(또 는 멀티 밴드) 통신을 지원할 수 있다. STA 및 AP 사이에는 복수의 링크들(예: 도 9의 복수의 링크 들(410~430))이 형성될 수 있다. 동작 1520에서, STA는 AP와 복수의 링크들(410~430)을 형성하여 연결되어 있는 동안에 AP에 대 한 파라미터(예: RSSI)를 모니터링할 수 있다. STA는 AP의 각 링크(410~430)에 대한 RSSI 값을 모 니터링할 수 있다. 일 실시예에 따르면, STA는 지정된 주기로 AP와 통신 연결된 복수의 링크들 (410~430)에 대한 파라미터(예: RSSI)를 모니터링할 수 있다. 동작 1530에서, STA는 각 링크(410~430) 중 적어도 하나의 링크의 RSSI 값이 지정된 임계값(예: -75dBm) 보다 작은 경우 각 링크(410~430)에 대해 로밍이 필요하다고 판단할 수 있다. 동작 1540에서, STA는 로밍의 트리거에 응답하여 지정된 하나 이상의 링크의 퀄리티를 계산할 수 있다. 도 14를 참조하여 설명한 바와 같이, 링크 퀄리티는 수학식 1을 통해 계산될 수 있다. 지정된 하나 이상의 링 크는 로밍의 트리거 시에 로밍이 트리거되지 않은 하나 이상의 링크를 포함할 수 있다. STA는 로밍이 트 리거되지 않은 하나 이상의 링크의 퀄리티를 계산하는 것일 수 있다. 동작 1550에서, STA는 계산된 링크 퀄리티에 따라 로밍 동작을 차별화하여 수행할 수 있다. 로밍 동작의 로밍 레벨은 계산된 링크 퀄리티의 값에 따라 복수 개로 구분되어 정의될 수 있다. J는 2 이상의 자연수로, 로 밍 레벨은 하나 이상의 임계값(또는 임계 범위)에 의해서 2개 이상으로 구분되어 정의될 수 있다. 다양한 실시예에 따르면, STA는 로밍의 트리거 시에 계산된(또는 확인된) 링크 퀄리티에 대응하는 로밍 레 벨에 따른 로밍 동작을 수행할 수 있다. 도 16은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 16을 참조하면, 네트워크 환경에서 전자 장치(예: 도 3의 STA)는 제 1 네트워크(예: 근거리 무선 통신 네트워크)를 통하여 전자 장치(예: 도 3의 STA)와 통신하거나, 또는 제 2 네트워크 (예: 원거리 무선 통신 네트워크)를 통하여 전자 장치(예: 도 3의 STA) 또는 서버 중 적어도 하나와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈, 인터페이스, 연결 단자 , 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리, 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구 성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈 )은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데 이터 처리 또는 연산을 수행할 수 있다. 일실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발 성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘 발성 메모리에 저장할 수 있다. 일실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처 리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예:그래픽 처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로 세서, 또는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일 부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세 서를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로 세서와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센 서 모듈, 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일실시예 에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일실시예에 따 르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능 모델이 수행 되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi-supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경 망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포 함할 수 있다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관 련된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도 로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일실시예에 따르면, 리시버는 스피커 와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레 이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로를 포함할 수 있다. 일실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또 는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰) 를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태)를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일실시예에 따르면, 인터페이스 는, 예를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥 터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버 ) 간의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접 (예: 유선) 통신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일실시예에 따르면, 통신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트 워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외 부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사 항을 지원할 수 있다. 일실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일실시예에 따르면, 안테나 모듈은 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하 여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치 와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(1602, 또는 1604) 각각은 전자 장 치와 동일한 또는 다른 종류의 장치일 수 있다. 일실시예에 따르면, 전자 장치에서 실행되는 동작 들의 전부 또는 일부는 외부의 전자 장치들(1602, 1604, 또는 1608) 중 하나 이상의 외부의 전자 장치들에서 실 행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로 부터의 요청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대 신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라 고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달 할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어 도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅 (MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예 를 들어, 분산 컴퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일실시예에 따르면, 외부의 전자 장치 또는 서버(160 8)는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 본 문서에 개시된 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨 어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되 지 않는다. 본 문서의 다양한 실시예들 및 이에 사용된 용어들은 본 문서에 기재된 기술적 특징들을 특정한 실시예들로 한 정하려는 것이 아니며, 해당 실시예의 다양한 변경, 균등물, 또는 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 또는 관련된 구성요소에 대해서는 유사한 참조 부호가 사용될 수 있다. 아이템 에 대응하는 명사의 단수 형은 관련된 문맥상 명백하게 다르게 지시하지 않는 한, 상기 아이템 한 개 또는 복수 개를 포함할 수 있다. 본 문서에서, \"A 또는 B\", \"A 및 B 중 적어도 하나\", \"A 또는 B 중 적어도 하나\", \"A, B 또는 C\", \"A, B 및 C 중 적어도 하나\", 및 \"A, B, 또는 C 중 적어도 하나\"와 같은 문구들 각각은 그 문구들 중 해당하는 문구에 함께 나열된 항목들 중 어느 하나, 또는 그들의 모든 가능한 조합을 포함할 수 있다. \"제 1\", \"제 2\", 또는 \"첫째\" 또는 \"둘째\"와 같은 용어들은 단순히 해당 구성요소를 다른 해당 구성요소와 구분하기 위 해 사용될 수 있으며, 해당 구성요소들을 다른 측면(예: 중요성 또는 순서)에서 한정하지 않는다. 어떤(예: 제 1) 구성요소가 다른(예: 제 2) 구성요소에, \"기능적으로\" 또는 \"통신적으로\"라는 용어와 함께 또는 이런 용어 없이, \"커플드\" 또는 \"커넥티드\"라고 언급된 경우, 그것은 상기 어떤 구성요소가 상기 다른 구성요소에 직접적 으로(예: 유선으로), 무선으로, 또는 제 3 구성요소를 통하여 연결될 수 있다는 것을 의미한다.본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부 가 될 수 있다. 예를 들면, 일실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨 어(예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행 될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경우와 임시적으로 저장되는 경우를 구분하지 않는다. 일실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨 터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같 은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다. 다양한 실시예에 따른 전자 장치(예: 도 3의 STA 또는 도 16의 전자 장치)는 무선 신호를 송수신하 도록 구성된 하나 이상의 무선 통신 모듈(예: 도 16의 무선 통신 모듈)과, 상기 무선 통신 모듈과 작동적 으로(operatively) 연결된 하나 이상의 프로세서(예: 도 16의 프로세서)와, 상기 프로세서와 전기적으로 연결되고 상기 프로세서에 의해 실행 가능한 인스트럭션들을 저장하는 메모리(예: 도 16의 메모리)를 포 함하고, 상기 프로세서에 의해 상기 인스트럭션들이 실행될 때, 상기 프로세서는, AP(access point)(예: 도 3의 AP)와 복수의 링크들(예: 도 4의 복수의 링크들(410~430))을 형성하여 연결되어 있는 동안에 로밍의 트리 거 여부를 판단하고(예: 도 11의 동작 1110), 상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확 인하고(예: 도 11의 동작 1120), 상기 복수의 링크들의 상태에 따라 로밍 동작을 차별화하여 수행할 수 있다(예: 도 11의 동작 1130). 다양한 실시예에 따르면, 상기 프로세서는, 상기 AP에 대한 파라미터를 모니터링하여 상기 로밍의 트리거 여부 를 판단할 수 있다. 다양한 실시예에 따르면, 상기 상태는, 상기 로밍의 트리거에 연관된 링크의 개수, 전체 링크 퀄리티, 및 지정 된 하나 이상의 링크 퀄리티 중에서 하나 이상을 포함할 수 있다. 다양한 실시예에 따르면, 상기 퀄리티는, 링크의 쓰루풋(throughput)에 기초하는 것일 수 있다. 다양한 실시예에 따르면, 상기 지정된 하나 이상은 로밍이 트리거되지 않은 하나 이상의 링크를 포함할 수 있다. 다양한 실시예에 따르면, 상기 로밍의 트리거에 연관된 링크의 개수는, 상기 로밍이 트리거된 링크의 개수 또는 상기 로밍이 트리거되지 않은 링크의 개수일 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 상기 로밍 동작에 포함된 로밍 스캔 동작 및 AP 선택 동작 중에서 하나 이상을 상기 상태에 따라 차별화하여 수행할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 로밍 스캔의 시작 여부, 로밍 스캔의 종류, 로밍 스캔의 기간 (period), 및 지정된 링크에 대한 데이터 사용 유무 중에서 하나 이상을 상기 상태에 따라 차별화하여 상기 로 밍 스캔 동작을 수행할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, AP 선택 기준을 상기 상태에 따라 차별화하여 상기 AP 선택 동작을 수행할 수 있다. 다양한 실시예에 따르면, 상기 프로세서는, 통신 프로세서 또는 애플리케이션 프로세서로 구현될 수 있다. 다양한 실시예에 따른 전자 장치(예: 도 3의 STA 또는 도 16의 전자 장치)의 동작 방법은 AP(access point)(예: 도 3의 AP)와 복수의 링크들(예: 도 4의 복수의 링크들(410~430))을 형성하여 연결되어 있는 동안에 로밍의 트리거 여부를 판단하는 동작(예: 도 11의 동작 1110)과, 상기 로밍의 트리거에 응답하여 상기 복수의 링크들의 상태를 확인하는 동작(예: 도 11의 동작 1120)과, 상기 복수의 링크들의 상태에 따라 로밍 동 작을 차별화하여 수행하는 동작(예: 도 11의 동작 1130)을 포함할 수 있다. 다양한 실시예에 따르면, 상기 판단하는 동작은, 상기 AP에 대한 파라미터를 모니터링하여 상기 로밍의 트리거 여부를 판단하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 상태는, 상기 로밍의 트리거에 연관된 링크의 개수, 전체 링크 퀄리티, 및 지정 된 하나 이상의 링크 퀄리티 중에서 하나 이상을 포함할 수 있다. 다양한 실시예에 따르면, 상기 퀄리티는, 링크의 쓰루풋(throughput)에 기초하는 것일 수 있다. 다양한 실시예에 따르면, 상기 지정된 하나 이상은 로밍이 트리거되지 않은 하나 이상의 링크를 포함할 수 있다. 다양한 실시예에 따르면, 상기 로밍의 트리거에 연관된 링크의 개수는, 상기 로밍이 트리거된 링크의 개수 또는 상기 로밍이 트리거되지 않은 링크의 개수일 수 있다. 다양한 실시예에 따르면, 상기 로밍 동작을 차별화하여 수행하는 동작은, 상기 로밍 동작에 포함된 로밍 스캔 동작 및 AP 선택 동작 중에서 하나 이상을 상기 상태에 따라 차별화하여 수행하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 하나 이상을 상기 상태에 따라 차별하여 수행하는 동작은, 로밍 스캔의 시작 여 부, 로밍 스캔의 종류, 로밍 스캔의 기간(period), 및 지정된 링크에 대한 데이터 사용 유무 중에서 하나 이상 을 상기 상태에 따라 차별화하여 상기 로밍 스캔 동작을 수행하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 하나 이상을 상기 상태에 따라 차별하여 수행하는 동작은, AP 선택 기준을 상기 상태에 따라 차별화하여 상기 AP 선택 동작을 수행하는 동작을 포함할 수 있다. 다양한 실시예에 따르면, 상기 전자 장치의 동작 방법은, 통신 프로세서 또는 애플리케이션 프로세서에 의해서 수행되는 것일 수 있다."}
{"patent_id": "10-2022-0034193", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시예들에 따른 무선랜 시스템의 일 예를 나타낸다. 도 2는 다양한 실시예들에 따른 무선랜 시스템의 다른 예를 나타낸다. 도 3은 다양한 실시예들에 따른 링크 셋업 동작을 설명하기 위한 도면이다. 도 4는 다양한 실시예에 따른 멀티 링크 통신을 설명하기 위한 도면이다. 도 5는 다양한 실시예에 따른 2.4 GHz 밴드 내에서 사용/지원/정의되는 채널의 일 예를 나타낸다. 도 6은 다양한 실시예에 따른 5 GHz 밴드 내에서 사용/지원/정의되는 채널의 일 예를 나타낸다. 도 7은 다양한 실시예에 따른 6 GHz 밴드 내에서 사용/지원/정의되는 채널의 일 예를 나타낸다. 도 8은 다양한 실시예에 따라 로밍 동작을 설명하기 위한 도면이다. 도 9는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍을 설명하기 위한 도면이다. 도 10은 다양한 실시예에 따른 멀티 링크 환경에서의 로밍의 예를 설명하기 위한 도면이다. 도 11은 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 일 예를 설명하기 위한 도면이다. 도 12는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 다른 예를 설명하기 위한 도면이다. 도 13은 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 또 다른 예를 설명하기 위한 도면이다. 도 14는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 또 다른 예를 설명하기 위한 도면이다. 도 15는 다양한 실시예에 따른 멀티 링크 환경에서의 로밍 동작 방법의 또 다른 예를 설명하기 위한 도면이다. 도 16은, 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다."}
