{"patent_id": "10-2022-0106575", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0031161", "출원번호": "10-2022-0106575", "발명의 명칭": "식물공장 내 식물 재배를 위한 광질 제어 시스템 및 광질 제어 방법", "출원인": "충북대학교 산학협력단", "발명자": "오명민"}}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "식물공장 내 식물 재배를 위한 조명장치에서 조사하는 광의 광질을 제어하는 광질 제어 시스템으로서,식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 영상 정보 획득부; 및인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을도출하는 연산부;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 식물 이미지 모델은 기설정한 하나 이상의 광질 조건에서 식물을 재배하며 상기 식물의 영상 정보를 획득하고 상기 재배된 식물을수확하여 생육 정보를 획득하고 상기 획득한 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을도출하는 광질 경향 파악 단계;식물의 임의의 기간 동안의 영상 정보를 학습하여 상기 식물의 소정의 날의 영상정보를 예측하고 상기 영상정보로부터 생육 정보를 예측하는 생육 예측 단계; 및기설정한 하나 이상의 광질 조건 각각에서 재배한 식물의 영상 정보를 학습하여 전체 광질 조건 각각에서 재배한 식물의 영상 정보를 예측하고, 상기 영상정보로부터 생육 정보를 예측하는 광질 경향 학습 단계;를 포함하는학습 방법을 이용하여 학습되는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 연산부는 임의의 날의 상기 식물의 영상 정보를 기반으로, 상기 학습을 통해 임의의 날로부터 소정의 기간동안 기설정한 하나 이상의 광질 변수에서 재배한 경우에 대한 가상의 영상 정보를 생성하고 상기 가상의 영상정보로부터 생육 정보를 추정하고,상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 소정의 날에 조사할 광의 최적의 광질을 도출하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서,상기 연산부는 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안 기설정한 하나 이상의광질 변수에서 재배한 영상 정보 및 생육 정보를 기반으로 상기 학습을 통해 전체 광질 변수 각각에서 재배했을때 상기 식물이 최대 성장을 이루는 날의 영상 정보 및 생육 정보를 추정하고상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 상기 식물이 최대 성장을 이루는 날의 최적의광질을 도출하고,상기 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도출하고,공개특허 10-2023-0031161-3-상기 최적 광질 프로파일에 대응하는 식물 영상을 실시간 영상 이미지와 매칭시켜 상기 최적 광질 프로파일을조정하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서,상기 광질 제어 시스템은 광원부에서 조사되는 광의 광질 정보, 상기 식물의 영상 정보 및 생육 정보를 인공지능 알고리즘에 입력하여 식물 이미지 모델을 학습시키는 학습처리부;를 더 포함하는 식물공장 내 식물 재배를위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서,상기 연산부는 상기 영상 정보의 시계열적 변화로부터 임의의 날의 상기 식물의 영상 및 생육정보를 예측하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제3항 또는 제4항에 있어서,상기 기설정한 하나 이상의 광질 변수는 적색(R), 청색(B), 녹색(G) 및 이들을 혼합한 광질을 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제3항 또는 제4항에 있어서,상기 기설정한 하나 이상의 광질 변수는 적색(R), 청색(B) 및 녹색(G)을 구성성분으로, 심플렉스 격자 설계법(simplex lattice design)에 중심점 및 축점을 추가한 혼합물선별계획법(simplex screening design)을 사용하여 선정되는, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,상기 생육 정보는 지상부 생체중, 지상부 면적, 엽수, 엽면적, 엽장, 엽폭, 엽록소 함량 및 LAI(Leaf areaindex)로 이루어진 군에서 선택된 1종 이상인, 식물공장 내 식물 재배를 위한 광질 제어 시스템."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항의 광질 제어 시스템을 이용한 광질 제어 방법으로,식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 상기 광질 제어 시스템의 영상 정보 획득부가 식물의 영상 정보를 습득하는 단계; 및상기 광질 제어 시스템의 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터얻은 영상 정보로부터 광의 최적의 광질을 도출하는 단계;;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 방법.공개특허 10-2023-0031161-4-청구항 11 제10항에 있어서, 상기 식물 이미지 모델은 기설정한 하나 이상의 광질 조건에서 식물을 재배하며 상기 식물의 영상 정보를 획득하고 상기 재배된 식물을수확하여 생육 정보를 획득하고 상기 획득한 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을도출하는 광질 경향 파악 단계;식물의 임의의 기간 동안의 영상 정보를 학습하여 상기 식물의 소정의 날의 영상정보를 예측하고 상기 영상정보로부터 생육 정보를 예측하는 생육 예측 단계; 및기설정한 하나 이상의 광질 조건 각각에서 재배한 식물의 영상 정보를 학습하여 전체 광질 조건 각각에서 재배한 식물의 영상 정보를 예측하고, 상기 영상정보로부터 생육 정보를 예측하는 광질 경향 학습 단계;를 포함하는학습 방법을 이용하여 학습되는, 식물공장 내 식물 재배를 위한 광질 제어 방법."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서,상기 최적의 광질을 도출하는 단계는상기 연산부가 상기 학습을 통해 임의의 날의 상기 식물의 영상 정보를 기반으로, 임의의 날로부터 소정의 기간동안 기설정한 하나 이상의 광질 변수에서 재배한 경우에 대한 가상의 영상 정보를 생성하여 상기 가상의 영상정보로부터 생육 정보를 추정하는 단계; 및 상기 연산부가 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 획득하는 단계;를 포함하는 , 식물공장 내 식물 재배를 위한 광질 제어 방법."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서,상기 최적의 광질을 도출하는 단계는상기 연산부가 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 소정의 기간동안 기설장한 하나이상의 광질에서 재배한 영상 정보 및 생육 정보를 기반으로 상기 학습을 통해 전체 광질 변수 각각에서 재배했을 때 상기 식물이 최대 성장을 이루는 날의 영상 정보 및 생육 정보를 추정하는 단계;상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 상기 식물이 최대 성장을 이루는 날의 최적의광질을 도출하는 단계;상기 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도출하는 단계; 및상기 최적 광질 프로파일에 대응하는 식물 영상을 실시간 영상과 매칭시켜 상기 최적 광질 프로파일을 조정하는단계;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 방법."}
{"patent_id": "10-2022-0106575", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "복수의 광원 모듈을 포함하며, 식물에 광을 조사하는 광원부; 및상기 광원부 광의 광질을 제어하는, 제1항의 광질 제어 시스템;을 포함하는, 식물공장 내 식물 재배를 위한 조명 장치.공개특허 10-2023-0031161-5-청구항 15 제1항의 광질 제어 시스템으로 제어된 광질의 광을 식물에 조사하는 단계;를 포함하는 식물공장 내 식물 재배방법."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 식물공장 내 식물 재배를 위한 광질 제어 시스템 및 이를 이용한 식물공장 내 식물 재배 방법에 관한 것으로 구체적으로는, 식물공장 내 식물 재배를 위한 조명장치에서 조사하는 광의 광질을 제어하는 광질 제어 시 스템으로서, 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 영상 정보 획득부; 및 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을 도출하는 연산부;를 포함하 는, 식물공장 내 식물 재배를 위한 광질 제어 시스템 및 이를 이용한 식물공장 내 식물 재배 방법에 관한 것이다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 식물공장 내 식물 재배를 위한 광질 제어 시스템 및 광질 제어 방법에 관한 것이다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "식물공장은 외부 환경과 차단된 시설에서 온ㆍ습도, 광 및 이산화탄소 등의 환경요인을 인공적으로 제어하여 계 절에 상관없이 작물을 안정적으로 생산할 수 있는 시스템이다. 일반적으로 식물공장은 자연광 및 인공광 식물공 장으로 분류하는데, 온실과 같은 자연광 식물공장은 작물 재배를 위한 주광원으로 태양광을 사용하며, 낮의 길 이를 연장할 필요가 있을 경우에는 인공광을 보조광원으로 사용하기도 한다. 한편 환경조건이 제어된 인공광 식 물공장(또는 폐쇄형 식물공장)에서는 태양광이 차단된 폐쇄 공간 내에서 인공광 만을 사용하여 작물을 재배한다. 인공광 식물공장은 자연광 식물공장과 달리, 태양광이 차단된 시설 내에서 작물 재배를 위해 인공광 을 사용하기 때문에 광원 설비에 소요되는 투자비용이 가중되는 단점이 있다. 그러나 인공광 식물공장은 외부 환경의 영향을 거의 받지 않는 조건에서 병충해 방제를 위한 화학물질을 사용하지 않고 작물을 친환경적으로 주 년 안정 생산할 수 있는 재배 시스템으로, 최근 들어 인공광 식물공장 실용화를 위한 다양한 연구가 진행되고 있다. 인공광 식물공장에서 작물의 광합성과 생장을 촉진하기 위하여 사용하는 인공광원은 백색냉음극형광등(Cool- White Fluorescent Lamp), 메탈할라이드 램프(Metal Halide Lamp), 고압나트륨 램프(High Pressure Sodium Lamp), 하이브리드전극형광 램프(Hybrid Electrode Fluorescent Lamp) 및 발광다이오드(Light-Emitting Diode, LED) 등이 대표적이다. 백색냉음극형광등은 특성상 태양광과 유사한 스펙트럼 분포를 가지고 있는 광원으로, 가격이 비교적 저렴하여 태양광 대신에 인공광만을 사용하여 무균식물을 생산하는 조직배양시설이나 인공광 식물공장에서 가장 많이 사 용하는 광원의 하나이다. 그러나 이러한 백색냉음극형광등은 램프의 수명이 짧고 램프 중간과 선단부분의 광강 도가 불균일하고, 폐전구에 의한 환경오염이나 램프로부터의 발열양이 많아 시설내 공조 비용을 증가시키는 등 의 단점이 있어 대체 램프 개발 및 이용에 관한 연구가 진행되고 있다. 한편 수명이 길고 전력소모량이 적으며, 광원으로부터의 열발생이 적어 메탈 할라이드 램프, 백열등이나 형광등 과 같은 광원에 비해 시설내 공조비용 절감효과가 높다. 따라서 최근 인공광 식물공장 및 온실과 같은 자연광 식물공장에서 LED를 주광원이나 보조광원으로 이용하여 작물을 재배하는 사례가 늘고 있다. 특히 LED는 다른 광 원과 달리, 청색, 적색 및 녹색 등 3파장의 광을 각각 또는 이들 단일광을 혼합하거나, 혼합비율을 임의로 제어 하여 조사할 수 있다는 특징이 있다. 이와 같이 LED는 광질이나 광질별 혼합비율을 자유로이 제어할 수 있기 때 문에 식물의 생장반응뿐만 아니라 식물체내 유용 물질이나 색소 합성 조절 등의 연구를 통하여 인공광원으로서 의 이용성이 검토되고 있다. 한편, 인공광원을 이용한 식물의 재배 기술이 발달함에 따라, 식물의 생산 수율을 최대화하는 것 뿐만 아니라, 특정 물질의 함량을 증가시키거나 형태형성을 조절하는 데에 광 조사 기술을 적용할 수 있다. 이와 관련된 종래의 기술로, 비특허문헌 1에서는 식물공장 인공광원이 방풍나물(Peucedanum japonicum Thunb)의 생육 및 수량에 미치는 영향에 대한 연구를 진행한 바 있고, 비특허문헌 2에서는 인공광 식물공장 내 광질제어 가 방풍나물(Ledebouriella seseloides) 생장에 미치는 영향에 대한 연구를 진행한 바 있으며, 특허문헌 1에서 는 LED를 이용한 고들빼기속 작물의 생장 및 생리활성 물질 증진 방법을 개시한 바 있다. 하지만 현재까지의 다양한 광에 대한 식물의 반응은 실험적인 수준으로 장기적으로 고정된 광 처리조건간의 비 교에 그친다. 작물 생산을 위한 최적의 광 조건은 작물의 종류, 생육단계 심지어는 환경조건에 따라서 달라질 수 있기 때문에 그 모든 경우의 수를 실험적으로 세팅하고 그 안에서 여러 실험구를 두어 그 안에서 최적의 광 조건을 도출해내 는 것은 불가능할 뿐만 아니라 최적의 광 조건이라고 이야기할 수 없다. 또한 종래의 경우 현재 작물의 상태를 파악하기 위해서는 파괴조사를 실시하여 원하는 항목을 측정해야 하는데, 이 경우 해당 작물에 대한 연속적인 데이터를 얻을 수 없으며 상업적으로 생산품을 파괴해야한다는 점과 그에 대한 노동력을 소모하기는 어려운 문제가 있다. 따라서 일반적으로는 한 작물에 대한 경험적 모델을 생성하고 같은 조건으로 재배를 수행한다. 하지만 동일한 작물을 재배하더라도 대규모의 농업에서는 동일한 환경조건을 적용할 수 없으며, 더욱이 중간에 작물의 상태가 변하거나 의도치 않은 환경 변화가 생겼을 때 실시간으로 대처하는데 어려움이 있다. 또한 공지 되지 않은 새로운 작물을 재배 하려할 때 경험적 모델을 생성해 냄에 있어 긴 시간이 소요되기 때문에 상용화에 대한 유연성이 떨어진다. 이에 본 발명자들은 인공광원을 이용한 식물의 재배 기술에 대한 연구를 수행하던 중 식물의 영상을 통해 소정 의 날 이후의 영상 정보 및 생육정보를 추정하고 이를 통해 최적의 광질을 도출할 수 있는 인공지능 기반 식물 이미지 모델을 개발하고 이를 통해 실시간으로 최적의 광질을 제공함으로써, 대규모 농업에 적용이 가능하고 새 로운 작물을 재배할 때도 도입할 수 있는 광질 제어 시스템 및 광질 제어 방법을 개발하고 본 발명을 완성하였 다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허 제10-1861217호 비특허문헌 (비특허문헌 0001) Protected Horticulture and Plant Factory, Vol. 25, No. 1:16-23, March (비특허문헌 0002) Korean J Environ Agric , Vol. 32, No. 3, pp. 193-200"}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "일 측면에서의 목적은 식물공장 내 식물 재배를 위한 광질 제어 시스템 및 광질 제어 방법을 제공하는 데 있다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 목적을 달성하기 위하여, 일 측면에서는, 식물공장 내 식물 재배를 위한 조명장치에서 조사하는 광의 광질을 제어하는 광질 제어 시스템으로서, 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 영상 정보 획득부; 및 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을 도출하는 연산부;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템이 제공된다. 상기 식물 이미지 모델은 기설정한 하나 이상의 광질 조건에서 식물을 재배하며 상기 식물의 영상 정보를 획득하고 상기 재배된 식물을 수확하여 생육 정보를 획득하고 상기 획득한 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 도출하는 광질 경향 파악 단계; 식물의 임의의 기간 동안의 영상 정보를 학습하여 상기 식물의 소정의 날의 영상정보를 예측하고 상기 영상정보 로부터 생육 정보를 예측하는 생육 예측 단계; 및 기설정한 하나 이상의 광질 조건 각각에서 재배한 식물의 영상 정보를 학습하여 전체 광질 조건 각각에서 재배 한 식물의 영상 정보를 예측하고, 상기 영상정보로부터 생육 정보를 예측하는 광질 경향 학습 단계;를 포함하는 학습 방법을 이용하여 학습된다. 상기 연산부는 임의의 날의 상기 식물의 영상 정보를 기반으로, 상기 학습을 통해 임의의 날로부터 소정의 기간 동안 기설정한 하나 이상의 광질 변수에서 재배한 경우에 대한 가상의 영상 정보를 생성하고 상기 가상의 영상 정보로부터 생육 정보를 추정하고, 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 소정의 날에 조사할 광의 최적의 광질을 도출 할 수 있다. 또한, 상기 연산부는 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안 기설정한 하나 이 상의 광질 변수에서 재배한 영상 정보 및 생육 정보를 기반으로 상기 학습을 통해 전체 광질 변수 각각에서 재 배했을 때 상기 식물이 최대 성장을 이루는 날의 영상 정보 및 생육 정보를 추정하고 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 상기 식물이 최대 성장을 이루는 날의 최적의 광질을 도출하고, 상기 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도 출하고, 상기 최적 광질 프로파일에 대응하는 식물 영상을 실시간 영상 이미지와 매칭시켜 상기 최적 광질 프로파일을 조정할 수 있다. 상기 광질 제어 시스템은 광원부에서 조사되는 광의 광질 정보, 상기 식물의 영상 정보 및 생육 정보를 인공지 능 알고리즘에 입력하여 식물 이미지 모델을 학습시키는 학습처리부;를 더 포함할 수 있다. 상기 연산부는 상기 영상 정보의 시계열적 변화로부터 임의의 날의 상기 식물의 영상 및 생육정보를 예측할 수 있다. 상기 기설정한 하나 이상의 광질 변수는 적색(R), 청색(B), 녹색(G) 및 이들을 혼합한 광질을 포함할 수 있고, 보다 바람직하게는 적색(R), 청색(B) 및 녹색(G)을 구성성분으로, 심플렉스 격자 설계법(simplex lattice design)에 중심점 및 축점을 추가한 혼합물선별계획법(simplex screening design)을 사용하여 선정될 수 있다.상기 생육 정보는 지상부 생체중, 지상부 면적, 엽수, 엽면적, 엽장 및 엽폭으로 이루어진 군에서 선택된 1종 이상일 수 있다. 다른 일 측면에서는 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 상기 광질 제어 시스템의 영상 정보 획득부가 식 물의 영상 정보를 습득하는 단계; 및 상기 광질 제어 시스템의 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을 도출하는 단계;;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 방 법 이 제공된다. 상기 식물 이미지 모델은 기설정한 하나 이상의 광질 조건에서 식물을 재배하며 상기 식물의 영상 정보를 획득하고 상기 재배된 식물을 수확하여 생육 정보를 획득하고 상기 획득한 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 도출하는 광질 경향 파악 단계; 식물의 임의의 기간 동안의 영상 정보를 학습하여 상기 식물의 소정의 날의 영상정보를 예측하고 상기 영상정보 로부터 생육 정보를 예측하는 생육 예측 단계; 및 기설정한 하나 이상의 광질 조건 각각에서 재배한 식물의 영상 정보를 학습하여 전체 광질 조건 각각에서 재배 한 식물의 영상 정보를 예측하고, 상기 영상정보로부터 생육 정보를 예측하는 광질 경향 학습 단계;를 포함하는 학습 방법을 이용하여 학습될 수 있다. 상기 최적의 광질을 도출하는 단계는 상기 연산부가 상기 학습을 통해 임의의 날의 상기 식물의 영상 정보를 기반으로, 임의의 날로부터 소정의 기간 동안 기설정한 하나 이상의 광질 변수에서 재배한 경우에 대한 가상의 영상 정보를 생성하여 상기 가상의 영상 정보로부터 생육 정보를 추정하는 단계; 및 상기 연산부가 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 획득하는 단계; 를 포함할 수 있다. 또한, 상기 최적의 광질을 도출하는 단계는 상기 연산부가 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 소정의 기간동안 기설장한 하나 이상의 광질에서 재배한 영상 정보 및 생육 정보를 기반으로 상기 학습을 통해 전체 광질 변수 각각에서 재배했 을 때 상기 식물이 최대 성장을 이루는 날의 영상 정보 및 생육 정보를 추정하는 단계; 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 상기 식물이 최대 성장을 이루는 날의 최적의 광질을 도출하는 단계; 상기 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도 출하는 단계; 및 상기 최적 광질 프로파일에 대응하는 식물 영상을 실시간 영상과 매칭시켜 상기 최적 광질 프로파일을 조정하는 단계;를 포함할 수 있다. 또 다른 일 측면에서는 복수의 광원 모듈을 포함하며, 식물에 광을 조사하는 광원부; 및 상기 광원부 광의 광질을 제어하는, 상기 광질 제어 시스템;을 포함하는, 식물공장 내 식물 재배를 위한 조명 장치가 제공된다. 또 다른 일 측면에서는 상기 식물공장 내 식물 재배를 위한 광질 제어 시스템으로 제어된 광질의 광을 식물에 조사하는 단계;를 포함하 는 식물공장 내 식물 재배 방법이 제공된다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템은 식물의 생육 상태에 따라 실시간 최적의 광 질을 조사함에 있어 식물공장 내 재배 조건이 유사한 다양한 식물에 대해 범용적으로 사용할 수 있다. 또한, 일 측면에 따른 광질 제어 시스템은 실시간으로 광질을 제어할 수 있으며, 식물의 생육 전기간 동안 적용 하거나 또는 생육 중 특정 기간에 대해 일시적으로 사용할 수 있으며, 또는 식물의 최적 생산을 위한 재배 기간 동안의 최적의 광질 프로파일을 구명해내는 데 활용될 수도 있다. 이에, 인공광 아래에서의 생장 조건이 구명되 지 않은 식물을 재배하기 위한 광환경을 조성하는 데 유용하게 사용될 수 있다. 또한, 일 측면에 따른 광질 제어 시스템은 식물을 파괴하지 않고도 식물의 영상 정보를 이용해 생체중, 엽면적 등의 생육 정보를 추정할 수 있다. 또한, 일 측면에 따른 광질 제어 시스템은 재배 최적화 뿐만 아니라 재배자로 하여금 재배 중 식물의 이상 유무 를 확인하는 데 활용될 수 있다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 본 발명의 실시 예를 도면을 참조하여 상세하게 설명한다. 그러나, 본 발명은 이하의 특정 실시 형태에 한정되는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변경, 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 본 명세서에서 사용한 용어는 단지 특정한 실시 예를 설명하기 위해 사용된 것으로, 이에 본 발명이 한정되지 않는다. 명세서 및 청구범위 전체에서, \"제 1\"및 \"제 2\"라는 용어는 본 명세서에서 구별 목적으로서 사용되며, 어떠한 방식으로도 서열 또는 우선 순위를 나타내거나 예상하는 것을 의미하지 않으며, 다양한 구성요소들을 설명하는 데 사용될 수 있지만, 상기 구성요소들은 상기 용어들에 의해 한정되지 않는다. 예를 들어, 본 발명의 권리범위 를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소 로 명명될 수 있다. 또한, \"포함하다\" 또는 \"가지다\" 등의 용어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려는 것일 뿐, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구 성요소, 부품 또는 이들을 조합한 것들의 존재 또는 부가 가능성을 배제하지 않는다. 또한, 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 본 명세서에서 사용되는 모든 용어들 은 본 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가 지고 있다. 일반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의미를 가지는 것으로 해석되어야 하며, 본 명세서에서 명백하게 정의하지 않는 한, 이상적이거나 과 도하게 형식적인 의미로 해석되지 않는다. 일 측면에서는, 식물공장 내 식물 재배를 위한 조명장치에서 조사하는 광의 광질을 제어하는 광질 제어 시스템으로서, 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 영상 정보 획득부; 및 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을 도출하는 연산부;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 시스템이 제공된다. 이하, 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템을 도면을 참조하여 각 구성별로 상세히 설명한다. 도 1은 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템을 이용한 광질 제어 방법을 개략적으로 나타낸 모식도이고 도 2는 일 실시예에 따른 광질 제어 시스템을 이용하여 식물에 실시간 최적의 광질을 제공하 는 모습을 나타낸 모식도이다. 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템은 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 영상 정보 획득부;를 포함한다. 상기 영상 정보 획득부는 상기 촬영 장치로부터 식물이 재배되는 동안 촬영하여 얻은 영상 정보를 획득할 수 있 다. 또한, 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템은 식물의 생육을 측정하기 위한 생육 정 보 측정장치를 더 포함할 수 있고 이로부터 생육 정보를 습득할 수 있다. 이때 상기 생육 정보는 지상부 생체중, 지상부 면적, 엽수, 엽면적, 엽장, 엽폭, 엽록소 함량 및 LAI(Leaf area index)으로 이루어진 군에서 선택된 1종 이상일 수 있으나 이에 제한 된 것은 아니며, 식물 공장에서 재배되는 식물의 성장을 확인할 수 있는 다른 정보가 포함될 수 있다. 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템은 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을 도출하는 연산부;를 포함한다.상기 식물 이미지 모델은 상기 식물의 영상 정보 및 생육 정보를 인공지능 알고리즘에 입력하여 광질에 따른 영 상 정보 및 생육 정보가 학습된 것으로, 이때 인공지능 알고리즘은 딥러닝 알고리즘 또는 머신러닝 알고리즘이 사용된 것일 수 있으나 이에 제한된 것은 아니다. 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템은 광원부에서 조사되는 광의 광질 정보, 상기 식물의 영상 정보 및 생육 정보를 인공지능 알고리즘에 입력하여 식물 이미지 모델을 학습시키는 학습처리부;를 더 포함할 수 있으나 이에 제한된 것은 아니며, 기학습된 식물 이미지 모델을 사용할 수 있다. 상기 학습처리부는 조사되는 광의 광질 정보와 상기 식물의 영상 정보 및 생육 정보를 대응시킨 데이터를 구축 할 수 있으며, 상기 영상 정보 획득부로부터 얻은 영상 정보를 이용하여 광질에 따른 영상 정보 및 생육 정보를 상기 식물 이미지 모델에 학습시킬 수 있다. 상기 식물 이미지 모델은 식물의 영상으로부터 식물의 생육 정보를 도출할 수 있고, 임의의 생육 정보를 갖는 가상의 영상을 생성할 수 있다. 또한 상기 식물 이미지 모델은 상기 영상 정보 획득부로부터 얻은 영상 정보의 시계열적 변화로부터 임의의 날 의 상기 식물의 영상 및 생육정보를 생성할 수 있다. 또한, 상기 식물 이미지 모델은 식물의 영상으로부터 소정의 기간동안 기설정한 복수의 광질 각각에서 재배한 경우에 대한 가상의 영상 정보를 생성할 수 있고, 상기 가상의 영상 정보로부터 생육 정보를 추정할 수 있다. 또한, 상기 식물 이미지 모델은 식물을 가상의 광질에서 처리했을 때의 영상을 생성하고, 상기 영상로부터 생육 정보를 추정할 수 있다. 상기 식물 이미지 모델은 기설정한 하나 이상의 광질 조건에서 식물을 재배하며 상기 식물의 영상 정보를 획득하고 상기 재배된 식물을 수확하여 생육 정보를 획득하고 상기 획득한 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 도출하는 광질 경향 파악 단계; 식물의 임의의 기간 동안의 영상 정보를 학습하여 상기 식물의 소정의 날의 영상정보를 예측하고 상기 영상정보 로부터 생육 정보를 예측하는 생육 예측 단계; 및 기설정한 하나 이상의 광질 조건 각각에서 재배한 식물의 영상 정보를 학습하여 전체 광질 조건 각각에서 재배 한 식물의 영상 정보를 예측하고, 상기 영상정보로부터 생육 정보를 예측하는 광질 경향 학습 단계;를 포함하는 학습 방법을 이용하여 학습될 수 있다. 이때 상기 광질 경향 파악 단계, 생육 예측 단계 및 경향 학습 단계는 보다 구체적으로는 이하의 방법으로 수행 될 수 있다. 광질의 경향 파악 광질 조건으로서 혼합물 설계를 이용할 수 있다. 도 3은 일 실시예에 따른 광질 선정 방법으로서, 심플렉스 격자 설계법(simplex lattice design)에 중심점 및 축점을 추가한 설계인 혼합물선별계획법(simplex screening design)을 도시한다. 도 3을 참조하며, 광질 조건은 RGB를 세 꼭짓점으로 두는 삼각형을 두어 그 안의 점으로 세 광질의 조합을 표현 할 수 있다. 이후 삼각형 내 균일하게 분포할 수 있는 n개의 점을 두는 혼합물 설계 방식으로 광질 조건을 설정 할 수 있다. 광질 경향 파악을 위하여, 구획을 나누어 다른 여러 가지 광질을 한 번에 처리할 수 있는 조건의 실험 장소에서 식물은 각기 다른 광질에서 생육 전반 동안 재배되며 이를 카메라로 촬영하여 영상 정보를 획득한다. 각 광질별로 식물은 생장 속도, 형태 등 다양한 반응을 보이게 된다. 상기 식물의 생육 정보를 얻기 위해, 상기 식물을 수확하고 파괴조사를 통해 생육 정보를 얻는다. 최적의 광질을 도출하기 위해, 반응 표면 분석법을 사용한다. 구체적으로, x, y축에 RGB 삼각형이 놓인 평면을 놓고 z축으로 조사 항목들을 위치시키면 공간 상 n개의 점이 찍힐 수 있고, 여러 회귀를 통해 이를 이어 n개의 점이 아닌 RGB 삼각형 전체에 대한 Z값을 마련한다. 이때 공간상에 분포한 값에 대하여 가장 높은 z값을 갖는 점의 x, y값으로 바닥면의 한 점을 나타낼 수 있으며 이는 생육 정보 중 가장 좋은 값을 가지는 RGB 광질 조합 을 의미한다. 이는 실제로 재배한 n개의 조건과 동일할 수도 있지만, 동일하지 않을 수도 있다. 생육 예측 알고리즘 도 4는 생육 예측 알고리즘의 일 실시 예를 모식적으로 나타낸 도면이다. 도 4를 참조하면, 상기 생육 예측 알고리즘은 작물이 생육함에 있어 나타나는 영상적 정보들을 통해 x일까지의 영상 정보를 이용해 x+1일 차의 이미지를 예측하여 생성하고, 상기 영상 정보로부터 생육정보를 추정해낼 수 있 다. 광질 경향 학습 알고리즘 도 5는 광질 경향 학습 알고리즘의 일 실시 예를 모식적으로 나타낸 도면이다. 도 5를 참조하면, 광질 경향 학습을 위해 n개(도 3의 경우 10개)의 광질에 대한 영상 정보를 학습시킬 수 있다. 이때 상기 학습을 통해 RGB전체에 대한 영상 정보 및 상기 영상정보로부터 생육 정보를 도출해낼 수 있다. 또한 광질 및/또는 재배기간을 달리 설정했을 때의 식물의 영상 정보 및 생육 정보를 도출해낼 수 있다. 상기 연산부는 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 소정의 날에 조사할 광의 최적의 광질을 도출할 수 있다. 구체적으로, 상기 연산부는 임의의 날의 상기 식물의 영상 정보를 기반으로, 상기 학습을 통해 임의의 날로부터 소정의 기간동안 기설정한 하나 이상의 광질 변수에서 재배한 경우에 대한 가상의 영상 정보를 생성하고 상기 가상의 영상 정보로부터 생육 정보를 추정하고, 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 소정의 날에 조사할 광의 최적의 광질을 도출 할 수 있다. 이때 상기 기설정된 하나 이상의 광질 변수는 식물 이미지 모델에 학습될 때 사용된 광질 변수를 포함될 수 있 으며, 이에 상기 식물 이미지 모델은 상기 기설정된 하나 이상의 광질 변수에서 재배한 식물에 대한 가상의 영 상 정보 및 상기 가상의 영상 정보에 대한 생육 정보를 추정할 수 있다. 상기 기설정된 하나 이상의 광질은 적색(R), 청색(B), 녹색(G) 및 이들을 혼합한 광질을 포함할 수 있고, 바람 직하게는 적색(R), 청색(B) 및 녹색(G)을 구성성분으로, 심플렉스 격자 설계법(simplex lattice design)에 중심 점 및 축점을 추가한 혼합물선별계획법(simplex screening design)을 사용하여 선정된 것일 수 있다. 도 3에 도시한 바와 같이, 광질을 선정하는 구체적인 방법은 적색(R), 청색(B), 녹색(G)을 세 꼭짓점으로 두는 삼각형에 표시되는 n개의 광질을 선정할 수 있다. 이때 상기 n은 3이상일 수 있으나 바람직하게는 상기 삼각형 의 중심점과 축점의 광질을 포함하는 것으로서 5 내지 20일 수 있으며, 도 3에서와 같이 10개일 수 있다. 한편, 도 6은 일 실시 예에 따른 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 최적의 광질을 도출하는 방법을 개략적으로 나타낸 모식도이고, 도 7은 일 실시 예에 따른 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 최적 광질 프로파일을 도출하는 방법을 개략적으로 나타낸 모식도이다.도 6을 참조하면, 상기 연산부는 상기 식물 이미지 모델로부터 추정된 상기 기설정한 하나 이상의 광질 변수에 서 재배한 경우 각각의 소정의 날의 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최대 생육 반응값을 나 타내는 최적의 광질을 도출할 수 있다. 구체적으로, 상기 기설정한 하나 이상의 광질 변수는 광질의 조합을 나타내는 x-y평면의 삼각형 내에 임의의 점 으로 표시하고, z축으로 생육 정보 또는 생육 반응값(조사 항목값)을 위치시키면 상기 기설정한 하나 이상의 광 질에 대응하는 생육 반응값이 x,y,z 공간 상의 점(a)으로 표시된다. 상기 생육 반응값을 기반으로 회귀분석을 통해 광질 전체(삼각형 전체)에 대한 생육반응값(z값)을 도출할 수 있으며, 이에, 도출된 생육반응값(z값) 중 가장 큰 값을 나타내는 점(a)의 x, y값로부터 최적의 광질값을 도출할 수 있다. 일례로서, 이하의 방법으로 식물공장 내 식물을 재배하며 광질 제어 시스템으로 제어된 광질의 광을 상기 식물 에 조사할 수 있다(도 6 참조): 단계 1: 식물공장 내 식물을 재배하되, 복수의 광원 모듈을 포함하며, 상기 식물과 이격 배치된 광원부 및 상기 광원부 광의 광질을 제어하는 광질 제어 시스템을 설치하여, 임의의 광질의 광을 상기 식물에 조사한다. 이때, 상기 광질 제어 시스템은 식물과 이격된 공간에 구비되어 식물의 영상 정보를 촬영하는 촬영 장치를 포함 하며 식물의 생육 정보를 습득하는 정보 획득부; 상기 광원부에 조사되는 광의 광질 정보, 상기 식물의 영상 정 보 및 생육 정보를 상기 생육 예측 알고리즘 및 광질 경향 알고리즘에 입력하여 식물 이미지 모델을 학습시키는 학습처리부; 및 상기 학습된 식물 이미지 모델을 기반으로 최적의 광질을 도출하는 연산부;를 포함한다. 단계 2: 상기 광질 제어 시스템의 정보 획득부의 촬영 장치가 상기 식물의 영상을 촬영하여, 상기 식물의 x일째 영상 이미지를 얻는다. 단계 3: 상기 광질 제어 시스템의 식물 이미지 모델이 상기 x일째 영상 이미지를 기반으로 x일로부터 n일 동안 상기 10개의 광질을 적용할 경우에 대한 10개의 (가상의)영상 이미지를 생성하고, 생성된 10개의 (가상의)영상 이미지를 이용해 x+n일 때의 생육 정보(생체중, 엽면적 등)을 추정한다. 단계 4: 상기 광질 제어 시스템의 연산부가 상기 추정된 생육정보를 기반으로 반응 표면분석을 통해 x+n일때의 최고의 생육 반응값을 나타내는 최적의 광질을 도출한다. 단계 5: 상기 광원부가 연산부에 의해 도출된 최적의 광질의 광을 조사한다. 단계 6: x+n일째 상기 단계 1 내지 5의 과정을 반복수행한다. (도 6에서 n은 3이나, 상기 n일 1 내지 100일일 수 있으며, 식물의 생장속도와 관련하여 달라질 수 있다) 또한, 도 7을 참조하면 상기 연산부는 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안 기설정한 하나 이상의 광질 변수에서 재배한 영상 정보 및 생육 정보를 기반으로 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도출할 수 있다. 구체적으로, 상기 연산부는 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안 기설정한 하나 이상의 광질 변수에서 재배한 영상 정보 및 생육 정보를 기반으로 상기 학습을 통해 전체 광질 변수 각각 에서 재배했을 때 상기 식물이 최대 성장을 이루는 날의 영상 정보 및 생육 정보를 추정하고 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 상기 식물이 최대 성장을 이루는 날의 최적의 광질을 도출하고, 상기 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도 출할 수 있다. 또한, 상기 연산부는 상기 시간에 따른 최적 광질 프로파일의 각각의 시점에 대응하는 식물의 영상을 생성할 수 있고, 상기 연산부가 상기 식물 이미지 모델이 생성한 식물의 영상을 실시간 식물의 영상과 매칭시켜 상기 최적광질 프로파일을 조정함으로써, 식물의 최대 목표 생장값을 이루는 시간을 보다 단축시킬 수 있다. 일례로, 이하의 방법으로 식물공장 내 식물을 재배하며 광질 제어 시스템으로 도출된 최적 광질 프로파일의 광 을 상기 식물에 조사할 수 있다: 단계 1: 구획을 나누어 10개의 광질을 한번에 처리할 수 있는 실험 장소에서 작물을 재배하였다(상추를 기준으 로 하면 최대 목표치 지상부 120g). 이때, 식물 공장 내 상기 실시 예 1과 동일한 광원부 및 광질 제어 시스템을 설치하였으며, 상기 10개의 광질은 RGB를 세 꼭짓점으로 두는 삼각형에 중심점과 축점의 광질을 포함하는 것으로 선정하였다. 단계 2: 상기 광질 제어 시스템의 정보 획득부의 촬영 장치가 상기 식물의 영상을 촬영하여, 상기 10개의 광질 에서 식물의 최대 목표 생장값을 달성하는 X2일까지 재배한 식물의 영상 이미지를 얻는다. 단계 3: 상기 광질 제어 시스템의 식물 이미지 모델이 상기 X2일째 영상 이미지를 기반으로 가상의 광질(A)을 처리했을 때의 (가상의)영상 이미지를 생성하고, 생성된 (가상의)영상 이미지로부터 생육 정보(생체중, 엽면적 등)을 추정한다. 단계 4: 상기 광질 제어 시스템의 연산부가 상기 추정된 생육정보를 기반으로 반응 표면분석을 이용하여 최적의 광질을 도출하고, 0일부터 X2일째까지의 시간에 따른 최적 광질 프로파일을 도출한다. 단계 5: 상기 광원부가 연산부에 의해 도출된 최적 광질 프로파일의 광을 조사하되 상기 최적 광질 프로파일에 대응하는 영상 이미지를 실시간 영상 이미지와 매칭시켜 상기 최적 광질 프로파일을 피드백한다(도 6 참조). 다른 일 측면에서는 광질 제어 시스템을 이용한 광질 제어 방법으로, 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 상기 광질 제어 시스템의 영상 정보 획득부가 식 물의 영상 정보를 습득하는 단계; 및 상기 광질 제어 시스템의 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로부터 얻은 영상 정보로부터 최적의 광질을 도출하는 단계;;를 포함하는, 식물공장 내 식물 재배를 위한 광질 제어 방 법이 제공된다. 이하, 다른 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 방법을 도면을 참조하여 각 단계별로 상세 히 설명한다. 도 1은 다른 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 방법을 개략적으로 나타낸 모식도이고 도 2는 일 실시예에 따른 광질 제어 시스템을 이용하여 식물에 실시간 최적의 광질을 제공하는 모습을 나타낸 모식 도이다. 먼저 식물을 촬영하여 영상 정보를 획득하는 촬영 장치를 포함하는 상기 광질 제어 시스템의 영상 정보 획득부 가 식물의 영상 정보를 습득하는 단계;를 수행한다. 상기 단계는 최적의 광질을 도출하기 위하여 식물의 영상정보를 얻기 위한 단계이다. 다음, 상기 광질 제어 시스템의 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 상기 영상 정보 획득부로 부터 얻은 영상 정보로부터 최적의 광질을 도출하는 단계;를 수행한다.상기 단계는 상기 영상 정보 획득부로부터 얻은 영상 정보 및 식물 이미지 모델을 기반으로 최적의 광질을 도출 하는 단계이다. 이때 상기 식물 이미지 모델은 기설정한 하나 이상의 광질 조건에서 식물을 재배하며 상기 식물의 영상 정보를 획득하고 상기 재배된 식물을 수확하여 생육 정보를 획득하고 상기 획득한 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 도출하는 광질 경향 파악 단계; 식물의 임의의 기간 동안의 영상 정보를 학습하여 상기 식물의 소정의 날의 영상정보를 예측하고 상기 영상정보 로부터 생육 정보를 예측하는 생육 예측 단계; 및 기설정한 하나 이상의 광질 조건 각각에서 재배한 식물의 영상 정보를 학습하여 전체 광질 조건 각각에서 재배 한 식물의 영상 정보를 예측하고, 상기 영상정보로부터 생육 정보를 예측하는 광질 경향 학습 단계;를 포함하는 학습 방법을 이용하여 학습될 수 있다. 한편, 상기 최적의 광질을 도출하는 단계는 상기 연산부가 임의의 날의 상기 식물의 영상 정보를 기반으로, 상기 학습을 통해 임의의 날로부터 소정의 기간 동안 기설정한 하나 이상의 광질 변수에서 재배한 경우에 대한 가상의 영상 정보를 생성하여 상기 가상의 영상 정보로부터 생육 정보를 추정하는 단계; 및 상기 연산부가 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 최적의 광질을 획득하는 단계; 를 포함할 수 있다. 다른 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 방법은 영상 정보를 이용함으로써 비파괴적으로 최적의 광질을 도출할 수 있고, 상기 식물 이미지 모델을 이용함으로써, 실시간으로 광질을 제어할 수 있다. 또한, 상기 최적의 광질을 도출하는 단계는 상기 연산부가 상기 식물을 임의의 날로부터 상기 식물이 최대 성장을 이루는 소정의 기간동안 기설장한 하나 이상의 광질에서 재배한 영상 정보 및 생육 정보를 기반으로 상기 학습을 통해 전체 광질 변수 각각에서 재배했 을 때 상기 식물이 최대 성장을 이루는 날의 영상 정보 및 생육 정보를 추정하는 단계; 상기 추정된 생육 정보를 기반으로 반응 표면 분석법을 이용하여 상기 식물이 최대 성장을 이루는 날의 최적의 광질을 도출하는 단계; 상기 임의의 날로부터 상기 식물이 최대 성장을 이루는 기간동안에 대한 시간에 따른 최적 광질 프로파일을 도 출하는 단계; 및 상기 최적 광질 프로파일에 대응하는 식물 영상을 실시간 영상과 매칭시켜 상기 최적 광질 프로파일을 조정하는 단계;를 포함할 수 있다. 다른 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 방법은 상기 최적 광질 프로파일을 통해 식물의 최대 목표 생장값을 이루는 시간을 보다 단축시킬 수 있으며 식물의 최적 생산을 위한 재배 기간동안의 광질 프 로파일을 구명해내는 데 활용될 수도 있다. 또 다른 일 측면에서는 복수의 광원 모듈을 포함하며, 식물에 광을 조사하는 광원부; 및 상기 광원부 광의 광질을 제어하는, 상기 광질 제어 시스템;을 포함하는, 식물공장 내 식물 재배를 위한 조명 장치가 제공된다. 상기 광원부는 식물 공장에 사용되는 다양한 인공 광원을 포함할 수 있으나 바람직하게는 LED 광원을 포함할 수 있다. 상기 광질 제어 시스템은 상기 광원부 광의 광질, 구체적으로는 청색, 적색 및 녹색 등의 광의 혼합비율로 제어 하여 최적의 광질을 조사하도록 하는 것으로 전술한 광질 제어 시스템의 구성 일부 또는 전부를 포함할 수 있다. 또 다른 일 측면에서는 상기 광질 제어 시스템으로 제어된 광질의 광을 식물에 조사하는 단계;를 포함하는 식물공장 내 식물 재배 방법 이 제공된다. 이하, 실시 예 및 실험 예를 통하여 본 발명을 상세하게 설명한다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "단, 하기 실시 예 및 실험 예는 본 발명을 예시하는 것일 뿐, 본 발명의 내용이 하기의 실시 예에 의해 한정되 는 것은 아니다. <실시 예 1> 단계 1: 심플렉스 축 설계법(Simplex axial design)을 기반으로 10개의 RGB 광 조합 조건에서 적상추(Lactuca sativa L. 'ALE101')를 재배하였다. 이때 재배 환경은 상추의 일반적인 생장 조건을 사용하였다(즉, 기온 20℃, 습도 80%, 이산화탄소 농도 550 μmolmol-1, white LED, PPFD 150 μmol·m-2·s-1, 광주기 12 h). 단계 2: 4주간 재배된 적상추의 이미지는 일반 스마트폰을 이용하여 획득했으며, 획득된 이미지의 생육 정보를 획득하기 위하여 파괴적 조사를 실시하였다. 단계 3: 파괴적 조사로 4개의 생육 정보(즉, 지상부 생체중, 엽면적, 총 엽록소 함량 및 안토시아닌 함량)을 측 정했고, 획득된 이미지와 측정된 생육 정보값을 데이터 세트로 구성하였다. 단계 4: 상기 데이터 세트를 이용하여 식물 이미지 모델을 학습시켰다. 이때, 상기 식물 이미지 모델을 학습시 키는 모델로서, VGG16, ResNet, InceptionV3, Xception 및 MobileNet 각각을 사용하여, 5개의 모델에 대한 성 능을 비교하였다. 상기 학습 시, 이미지네트(ImageNet)프로그램으로 사전 훈련된 초기 가중치를 불러왔으며, 가중치 수정을 통한 적상추 이미지에서 적절한 특징을 추출할 수 있도록 설정하였다. 각 모델은 output layer에 4개의 dense layer 가 연결되어 지상부 생체중, 엽면적, 총 엽록소함량 및 안토시아닌 함량을 출력하도록 구성하였다. <비교 예 1> RGB를 세 꼭짓점으로 두는 삼각형에 중심점과 축점의 광질을 포함하는 10개의 광질을 선정한다. 구획을 나누어 상기 10개의 광질을 한번에 처리할 수 있는 실험 장소에서 작물은 각기 다른 10개의 광질에서 생 육 전반 동안 재배되며 이는 카메라로 영상을 촬영한다. 각 광질 별로 작물은 생장 속도, 형태 등 다양한 반응 을 보이게 된다. 일정기간 재배 후 수확하여 파괴조사를 통해 생육 반응값(조사 항목값)을 측정한다. 반응 표면분석법을 이용하여, x-y평면에 RGB를 세 꼭짓점으로 두는 삼각형을 놓고 z축으로 생육반응값(조사 항 목값)을 위치시키면 이에 대응하여 공간 상 10개의 점이 찍힐 수 있고, 회귀분석을 통해 RGB를 세 꼭짓점으로 두는 삼각형 전체(실험하지 않은 광질을 포함한 모든 광질)에 대한 생육반응값(z값)을 도출할 수 있고, 상기 생 육반응값(z값) 중 가장 큰 값을 갖는 점의 x, y값으로로부터 RGB 광질 조합을 얻음으로써 최적의 광질을 도출한다. <실험 예 1> 학습 모델 성능 평가 상기 실시 예 1에서 사용한 5개의 학습 모델(VGG16, ResNet, InceptionV3, Xception 및 MobileNet) 각각에 대 한 성능 평가를 수행하였으며, 그 결과를 아래의 표 1에 나타내었다. 아래의 표 1의 R2는 그 값이 클수록 우수한 성능을 나타냄을 의미하고, RMSE는 그 값이 작을수록 우수한 성능을 나타냄을 의미하며 이하의 방법으로 구할 수 있다."}
{"patent_id": "10-2022-0106575", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "상기 R2 RMSE는 python (v.3.8, Python software foundation, Beaverton, OR, USA)을 이용하여 계산하였다. 표 1 Model R2 RMSE SFWzLAyChlxAnthowAverageSFWLA ChlAnthoAverage VGG16-0.02-0.06-0.01-0.11-0.0523.47634.4269.3516.77186.00 ResNet0.810.840.830.140.6510.18245.9618.5814.7072.35 Inception V30.840.840.77-0.030.609.38248.7432.6415.9076.66 Xception-0.02-0.03-0.02-0.17-0.0623.49626.1069.6717.23184.12 MobileNet0.590.500.66-0.120.4114.77432.5239.8416.83125.99 - ZSFW (Shoot fresh weight): 지상부 생체중 - YLA (Leaf area): 엽면적 - XChl (Total chlorophyll content): 총 엽록소 함량 - wAntho (Anthocyanin content): 안토시아닌 함량 상기 표 1에 나타난 바와 같이, 각 모델의 학습 결과 ResNet에서 가장 높은 평균 R2와 낮은 RMSE으로 가장 높은 성능을 나타내었다. <실험 예 2> 최적 광질 도출 일 실시 예에 따른 식물공장 내 식물 재배를 위한 조명장치에서 조사하는 광의 광질을 제어하는 광질 제어 시스 템을 통한 최적 광질 도출 결과를 확인하기 위하여, 도 8의 프로세스맵에 따라, 적상추를 촬영(RGB Image)하고, 상기 실시 예 1에 따라 학습된 식물 이미지 모델(Trained model)을 이용하여 혼합물 설계를 기반으로 설정된 4 개의 RGB 광 조합 조건에서 재배한 적상추의 영상 정보를 출력하고, 상기 영상 정보로부터 4개의 생육 정보(즉,지상부 생체중, 엽면적, 총 엽록소 함량 및 안토시아닌 함량)를 출력하여, 광질 조건 및 생육 정보가 포함된 데 이터 세트를 생성하고, 상기 생성된 데이터 세트를 반응 표면 생성 알고리즘의 입력 값으로 입력하여, 4개의 생 육 정보(즉, 지상부 생체중, 엽면적, 총 엽록소 함량 및 안토시아닌 함량) 각각에 대한 반응 표면을 출력하였으 며 그 결과를 도 9에 나타내었다. 도 9의 A, B, C, D 각각은 4개의 생육 정보(즉, 지상부 생체중, 엽면적, 총 엽록소 함량 및 안토시아닌 함량)에 대한 반응 표면 분석 결과 그래프이다. 도 9에 도시된 바와 같이, 실시 예에 따른 광질 제어 시스템을 통해 식물의 영상 정보로부터 생육 정보에 대한 반응 표면을 출력할 수 있으며 이를 통해 상기 적상추의 최적 광질을 생육 정보값이 가장 큰 값을 나타내는 광 질로 선택하여 도출할 수 있음을 확인할 수 있다. 상기 결과로부터 실시 예에 따라 학습된 식물 이미지 모델(Trained model)을 이용한 광질 제어 방법은 식물의 영상 정보로부터 최적의 반응값을 나타내는 최적의 광질을 도출할 수 있다. 아울러, 실시예에 따라 학습된 식물 이미지 모델(Trained model)을 이용하면 소정의 날 이후의 영상 정보를 예측할 수 있으므로, 이를 통해 소정의 날 이후 생육 정보 및 최적의 광질을 도출할 수 있을 것으로 예상해볼 수 있다. 이에, 비교 예에 의한 광질 제어 방법은 식물을 파괴하여 생육 정보를 얻는 과정이 필수적으로 요구되는 반면, 상기 실시 예에 따라 학습된 식물 이미지 모델(Trained model)을 이용한 광질 제어 방법은 식물에 대한 영상 정 보를 이용하여 생육 정보를 얻을 수 있어 비파괴적으로 수행될 수 있다. 또한, 비교 예에 의한 광질 제어 방법은 실시간 식물의 특성을 반영할 수 없어 변화하는 식물의 특성에 적합한 광질을 제공하지 못하는 반면, 상기 실시 예에 따라 학습된 식물 이미지 모델(Trained model)을 이용한 광질 제 어 방법은 식물의 실시간 특성을 반영할 수 있어 변화하는 식물의 특성에 적합한 광질을 실시간으로 제공할 수 있다. 또한, 비교 예에 의한 광질 제어 방법은 다양한 광질에 대한 생장 변화를 추정하기 어려운 반면, 상기 실시 예 에 따라 학습된 식물 이미지 모델(Trained model)을 이용한 광질 제어 방법은 다양한 광질에 대한 생장 변화 추 정이 가능하며, 광질을 변화시켰을 때의 생육 변화를 추정할 수 있다."}
{"patent_id": "10-2022-0106575", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템을 이용한 광질 제어 방법을 개략적으로 나타낸 모식도이다. 도 2는 일 실시예에 따른 광질 제어 시스템을 이용하여 식물에 실시간 최적의 광질을 제공하는 모습을 나타낸 모식도이다. 도 3은 일 실시예에 따른 광질 선정 방법으로서, 심플렉스 격자 설계법(simplex lattice design)에 중심점 및 축점을 추가한 설계인 혼합물선별계획법(simplex screening design)을 도시한다. 도 4는 생육 예측 알고리즘의 일 실시 예를 모식적으로 나타낸 도면이다. 도 5는 광질 경향 학습 알고리즘의 일 실시 예를 모식적으로 나타낸 도면이다. 도 6은 일 실시 예에 따른 연산부가 인공지능 기반 식물 이미지 모델을 이용하여 최적의 광질을 도출하는 방법 을 개략적으로 나타낸 모식도이다. 도 7은 일 측면에 따른 식물공장 내 식물 재배를 위한 광질 제어 시스템을 이용하여 도출되는 최적 광질 프로파 일을 모식적으로 나타낸 도면이다. 도 8은 일 실시 예에 따른 연산부가 영상 정보로부터 최적의 광질을 도출하기 위한 과정을 나타낸 프로세스맵이 다. 도 9는 일 실시 예에 따른 연산부가 도출한 반응 표면 분석 결과를 나타낸 결과 데이터이다."}
