{"patent_id": "10-2023-0021009", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0127816", "출원번호": "10-2023-0021009", "발명의 명칭": "약지도 학습을 이용한 가금의 공간분포 추정 장치 및 방법", "출원인": "전북대학교산학협력단", "발명자": "이준환"}}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "가금이 사육되는 사육장을 촬영한 영상 데이터를 기 학습된 분류모델에 적용하여 적어도 하나의 가금이 상기 영상 데이터에 포함되어 있는지 분류하는 가금 유무 분류부; 및상기 영상 데이터에 적어도 하나의 가금이 포함되어 있으면, 설명 가능 인공지능 모델을 이용하여 상기 가금이존재하는 위치에 대한 공간분포를 추정하는 공간분포 추정부;를 포함하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 분류모델을 최소한의 레이블링으로 약지도 학습을 수행하는 학습부;를 더 포함하는 것을 특징으로 하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 2항에 있어서,상기 학습부는,상기 가금이 포함된 전경과 상기 가금이 미포함된 배경에 대한 학습 데이터 각각을 랜덤으로 크롭(crop) 전처리한 후, 상기 약지도 학습을 수행하는 것을 특징으로 하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 가금 유무 분류부는,슬라이딩 윈도우(sliding window) 기법을 이용하여 상기 영상 데이터 전체에 대한 존재 유무를 분류하는 것을특징으로 하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 공간분포 추정부는,가장 영향력이 있는 가금들의 위치에 대한 열지도를 생성하고, 상기 생성된 열지도를 이용하여 상기 공간분포를추정하는 것을 특징으로 하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,상기 공간분포를 이용하여 가금의 현재 상태를 분석하는 상황 분석부;를 더 포함하는 것을 특징으로 하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 6항에 있어서,상기 상황 분석부는,공개특허 10-2024-0127816-3-상기 공간분포가 기 설정된 기준 공간분포와 오차 범위를 벗어나는 경우, 적어도 하나의 가금에 이상이 발생되었다고 판단하는 것을 특징으로 하는 공간분포 추정 장치."}
{"patent_id": "10-2023-0021009", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "공간분포 추정 장치가 가금이 사육되는 사육장을 촬영한 영상 데이터를 기 학습된 분류모델에 적용하여 적어도하나의 가금이 상기 영상 데이터에 포함되어 있는지 분류하는 단계; 및상기 공간분포 추정 장치가 상기 영상 데이터에 적어도 하나의 가금이 포함되어 있으면, 설명 가능 인공지능 모델을 이용하여 상기 가금이 존재하는 위치에 대한 공간분포를 추정하는 단계;를 포함하는 공간분포 추정 방법."}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "약지도 학습을 이용한 가금의 공간분포 추정 장치 및 방법이 개시된다. 공간분포 추정 장치는 가금이 사육되는 사육장을 촬영한 영상 데이터를 기 학습된 분류모델에 적용하여 적어도 하나의 가금이 영상 데이터에 포함되어 있는지 분류하는 가금 유무 분류부 및 영상 데이터에 적어도 하나의 가금이 포함되어 있으면, 설명 가능 인공지 능 모델을 이용하여 가금이 존재하는 위치에 대한 공간분포를 추정하는 공간분포 추정부를 포함한다."}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 공간 분포 추정 장치에 관한 것으로, 더욱 상세하게는 최소한의 레이블링을 통해 가금의 공간적 분포 를 추정하는 약지도 학습을 이용한 가금의 공간분포 추정 장치 및 방법에 관한 것이다."}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "최근 농촌은 인구감소와 고령화로 인해 인력 부족 현상을 겪고 있다. 현재 이 문제를 극복하기 위해 기계 및 인 공지능 소프트웨어 기술을 활용한 스마트 정밀 농업기술들이 개발되고 있다. 특히 육계의 공간적 분포를 자동으로 추정하는 기술은 육계 산업 분야 종사자들과 계사 관리자들에게 유용한 정 보를 제공해 줄 수 있어서 다양한 연구가 활발히 진행되고 있다. 최근에는 딥러닝 기반 머신비전 기술을 이용하여 육계 분포를 추정하는 연구를 활발히 진행하고 있으나, 실시간 프레임 단위로 들어오는 계산 영상에서 일일이 육계의 위치를 레이블링 하는 일은 비효율적이며, 노동집약적이 라는 문제점을 가지고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허공보 제10-1122644호(2012.02.24.)"}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는, 최소한의 레이블링을 통해 실시간으로 수신되는 영상 데이터에 포함된 가금 의 공간분포를 추정하는 약지도 학습을 이용한 가금의 공간분포 추정 장치 및 방법을 제공하는 것이다."}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위해 본 발명에 따른 공간분포 추정 장치는 가금이 사육되는 사육장을 촬영한 영상 데이 터를 기 학습된 분류모델에 적용하여 적어도 하나의 가금이 상기 영상 데이터에 포함되어 있는지 분류하는 가금 유무 분류부 및 상기 영상 데이터에 적어도 하나의 가금이 포함되어 있으면, 설명 가능 인공지능 모델을 이용하 여 상기 가금이 존재하는 위치에 대한 공간분포를 추정하는 공간분포 추정부를 포함한다. 또한 상기 분류모델을 최소한의 레이블링으로 약지도 학습을 수행하는 학습부를 더 포함하는 것을 특징으로 한 다. 또한 상기 학습부는, 상기 가금이 포함된 전경과 상기 가금이 미포함된 배경에 대한 학습 데이터 각각을 랜덤으 로 크롭(crop) 전처리한 후, 상기 약지도 학습을 수행하는 것을 특징으로 한다. 또한 상기 가금 유무 분류부는, 슬라이딩 윈도우(sliding window) 기법을 이용하여 상기 영상 데이터 전체에 대 한 존재 유무를 분류하는 것을 특징으로 한다. 또한 상기 공간분포 추정부는, 가장 영향력이 있는 가금들의 위치에 대한 열지도를 생성하고, 상기 생성된 열지 도를 이용하여 상기 공간분포를 추정하는 것을 특징으로 한다. 또한 상기 공간분포를 이용하여 가금의 현재 상태를 분석하는 상황 분석부를 더 포함하는 것을 특징으로 한다. 또한 상기 상황 분석부는, 상기 공간분포가 기 설정된 기준 공간분포와 오차 범위를 벗어나는 경우, 적어도 하 나의 가금에 이상이 발생되었다고 판단하는 것을 특징으로 한다. 본 발명에 따른 공간분포 추정 방법은 공간분포 추정 장치가 가금이 사육되는 사육장을 촬영한 영상 데이터를 기 학습된 분류모델에 적용하여 적어도 하나의 가금이 상기 영상 데이터에 포함되어 있는지 분류하는 단계 및 상기 공간분포 추정 장치가 상기 영상 데이터에 적어도 하나의 가금이 포함되어 있으면, 설명 가능 인공지능 모 델을 이용하여 상기 가금이 존재하는 위치에 대한 공간분포를 추정하는 단계를 포함한다."}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 실시예에 따르면, 최소한의 레이블링을 활용하는 약지도 학습을 이용하여 영상 데이터에 포함된 가금 의 공간분포를 실시간으로 추정할 수 있다. 또한 설명 가능한 인공지능 모델을 이용하여 가장 영향력이 있는 가금 위치를 열지도로 생성함으로써, 사용자로 하여금 직관적으로 가금의 분포 상태를 확인할 수 있도록 한다."}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래에서는 첨부한 도면을 참고로 하여 본 발명의 실시예에 대하여 본 발명이 속하는 기술 분야에서 통상의 지 식을 가진 자가 용이하게 실시할 수 있도록 상세히 설명한다. 그러나 본 발명은 여러 가지 상이한 형태로 구현 될 수 있으며 여기에서 설명하는 실시예에 한정되지 않는다. 그리고 도면에서 본 발명을 명확하게 설명하기 위 해서 설명과 관계없는 부분은 생략하였으며, 명세서 전체를 통하여 유사한 부분에 대해서는 유사한 도면 부호를 붙였다. 본 명세서 및 도면(이하 '본 명세서')에서, 동일한 구성요소에 대해서 중복된 설명은 생략한다. 또한 본 명세서에서, 어떤 구성요소가 다른 구성요소에 '연결되어' 있다거나 '접속되어' 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존 재할 수도 있다고 이해되어야 할 것이다. 반면에 본 명세서에서, 어떤 구성요소가 다른 구성요소에 '직접 연결 되어' 있다거나 '직접 접속되어' 있다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해되 어야 할 것이다. 또한, 본 명세서에서 사용되는 용어는 단지 특정한 실시예를 설명하기 위해 사용되는 것으로써, 본 발명을 한정 하려는 의도로 사용되는 것이 아니다. 또한 본 명세서에서, 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함할 수 있다. 또한 본 명세서에서, '포함하다' 또는 '가지다' 등의 용어는 명세서에 기재된 특징, 숫자, 단계, 동작, 구성요 소, 부품, 또는 이들을 조합한 것이 존재함을 지정하려는 것일 뿐, 하나 또는 그 이상의 다른 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이 해되어야 할 것이다. 또한 본 명세서에서, '및/또는' 이라는 용어는 복수의 기재된 항목들의 조합 또는 복수의 기재된 항목들 중의 어느 항목을 포함한다. 본 명세서에서, 'A 또는 B'는, 'A', 'B', 또는 'A와 B 모두'를 포함할 수 있다. 또한 본 명세서에서, 본 발명의 요지를 흐리게 할 수 있는 공지 기능 및 구성에 대한 상세한 설명은 생략될 것 이다. 도 1은 본 발명의 실시예에 따른 공간분포 추정 시스템을 설명하기 위한 구성도이다. 도 1을 참조하면, 공간분포 추정 시스템은 최소한의 레이블링을 통해 실시간으로 수신되는 영상 데이터에 포함된 가금의 공간분포를 추정한다. 여기서 가금은 가금은 야생의 조류를 인간생활에 유용하게 길들이고, 품종 개량을 하여 육성한 조류로써, 육계(닭), 오리, 거리 등이 포함될 수 있다. 공간분포 추정 시스템은 공간 분포 추정 장치, 영상 촬영 장치 및 사용자 단말을 포함한다. 공간분포 추정 장치는 가금이 사육되는 사육장을 촬영한 영상 데이터를 분석하여 가금의 공간분포를 추정 한다. 공간분포 추정 장치는 열상 촬영 장치로부터 수신된 영상 데이터를 기 학습된 분류모델에 적용 하여 적어도 하나의 가금이 해당 영상 데이터에 포함되어 있는지 분류한다. 분류모델은 최소한의 레이블링을 활 용하는 약지도 학습을 통해 학습될 수 있다. 공간분포 추정 장치는 영상 데이터에 적어도 하나의 가금이 포함되어 있으면, 설명 가능 인공지능(Explain AI, XAI) 모델을 이용하여 가금이 존재하는 위치에 대한 공간분 포를 추정한다. 이때 공간분포 추정 장치는 열지도를 통해 공간분포를 추정할 수 있다. 공간분포 추정 장 치는 추정된 공간분포를 이용하여 가금의 현재 상태를 분석하고, 분석된 결과를 사용자 단말로 전송 할 수 있다. 영상 촬영 장치는 가금이 사육되는 사육장에 적어도 하나의 카메라를 설치하여 사육장의 영상을 촬영한다. 바람직하게는 영상 촬영 장치는 사육장의 천장에 설치됨에 따라 탑뷰(top view) 시점에서 영상을 촬영할 수 있다. 영상 촬영 장치는 촬영된 영상에 대한 영상 데이터를 RGB 이미지로 생성할 수 있다. 영상 촬영 장치는 생성된 영상 데이터를 공간분포 추정 장치로 전송한다. 이때 영상 촬영 장치는 영상 데 이터를 실시간 프레임 단위로 전송할 수 있다. 사용자 단말은 사육장(F)를 관리하는 사용자가 사용하는 단말로써, 스마트폰, 데스크톱, 랩톱, 태블릿 PC, 핸드헬드 PC 등을 포함할 수 있다. 사용자 단말은 공간분포 추정 장치로부터 공간분포와 관련된 정보 및 가금의 현재 상태를 분석한 정보를 수신하고, 수신된 정보를 출력한다. 이를 통해 사용자는 사육장에서 사육 되는 가금의 공간분포 및 상태를 직관적으로 확인할 수 있다. 여기서 공간분포 추정 시스템은 공간분포 추정 장치, 영상 촬영 장치 및 사용자 단말 사이 에 통신망을 구축하여 서로 간에 통신을 지원할 수 있다. 통신망는 백본망과 가입자망으로 구성될 수 있다. 백본망은 X.25 망, Frame Relay 망, ATM망, MPLS(Multi Protocol Label Switching) 망 및 GMPLS(Generalized Multi Protocol Label Switching) 망 등 중에 하나 또는 복수의 통합된 망으로 구성될 수 있다. 가입자망은 FTTH(Fiber To The Home), ADSL(Asymmetric Digital Subscriber Line), 케이블망, 지그비 (zigbee), 블루투스(bluetooth), Wireless LAN(IEEE 802.11b, IEEE 802.11a, IEEE 802.11g, IEEE 802.11n), Wireless Hart(ISO/IEC62591-1), ISA100.11a(ISO/IEC 62734), CoAP(Constrained Application Protocol), MQTT(Message Queuing Telemetry Transport), WIBro(Wireless Broadband), Wimax, 3G, HSDPA(High Speed Downlink Packet Access), 4G, 5G 및 6G 등일 수 있다. 일부 실시예로, 통신망은 인터넷망일 수 있고, 이 동 통신망일 수 있다. 또한 통신망은 기타 널리 공지되었거나 향후 개발될 모든 무선통신 또는 유선통신 방식을 포함할 수 있다. 한편 도면에서는 공간분포 추정 장치와 영상 촬영 장치가 개별 장치로 구분되고 있으나, 이에 한정되 지 않고 하나의 장치로 구현될 수 있다. 도 2는 본 발명의 실시예에 따른 공간분포 추정 장치를 설명하기 위한 블록도이고, 도 3은 본 발명의 실시예에 따른 제어부를 설명하기 위한 블록도이며, 도 4는 본 발명의 실시예에 따른 약지도 학습하는 과정을 설명하기 위한 도면이고, 도 5는 본 발명의 실시예에 따른 공간분포를 추정하는 과정을 설명하기 위한 도면이며, 도 6은 본 발명의 실시예에 따른 열지도의 출력을 설명하기 위한 도면이다. 도 6의 (a)는 낮일 때 가금을 촬영한 영상 데이터와 해당 영상 데이터의 열지도를 출력한 도면이고, (b)는 낮일 때 사료통 주변에서의 가금을 촬영한 영상 데이터와 해당 영상 데이터의 열지도를 출력한 도면이며, (c), (d)는 밤일 때 가금을 촬영한 영상 데이터와 해 당 영상 데이터의 열지도를 출력한 도면이다. 도 1 내지 도 6을 참조하면, 공간분포 추정 장치는 통신부, 제어부, 출력부 및 저장부를 포함한다. 통신부는 영상 촬영 장치 및 사용자 단말과의 통신을 수행한다. 통신부는 영상 촬영 장치 로부터 영상 데이터를 수신한다. 통신부는 공간분포와 관련된 정보 및 가금의 현재 상태를 분석한 정 보를 사용자 단말로 전송한다. 제어부는 공간분포 추정 장치의 전반적인 제어를 수행한다. 제어부은 가금 유무 분류부 및 공 간분포 추정부를 포함하고, 학습부 및 상황 분석부를 더 포함할 수 있다. 학습부는 영상 데이터에 포함된 적어도 하나의 가금에 대한 존재 유무를 분류하는 분류모델을 학습시킨다. 학습부는 최소한의 레이블링으로 학습을 하는 약지도 학습을 통해 분류모델을 학습한다. 상세하게는 학습부는 가금이 포함된 전경과 가금이 미포함된 배경에 대한 학습 데이터가 각각 마련되면 각 가금 영역과 각 가금 영역의 클래스 식별을 할 수 있도록 약지도 학습을 수행한다. 이때 학습부는 전경과 배경을 각각 분류하여 전경 폴더와 배경 폴더에서 로딩하며, 가금이 포함된 전경과 가금이 미포함된 배경에 대 한 학습 데이터 각각을 랜덤으로 크롭(crop) 전처리한 후, 약지도 학습을 수행할 수 있다. 학습부는 CNN(Convolutional Neural Network) 등과 같은 인공 신경망인 분류모델을 이용하여 마련된 학습 데이터의 학 습 영상으로부터 특징점을 추출하여 학습 특징맵을 획득한다. 학습부는 학습 특징맵이 획득되면 학습 데이 터에 레이블된 경계 박스와 학습 특징맵을 이용하여 가금이 포함되지 않은 배경 영역의 위치별 배경 특징을 추 출하고, 추출된 배경 특징과 학습 특징맵 사이의 유사도를 기반으로 경계 박스 내의 배경 영역을 지정하는 배경 주의맵을 생성한다. 학습부는 배경 주의맵이 생성되면 배경 주의맵을 픽셀 반전하여 학습 특징맵을 이용하 여 경계 박스 내에서 배경 영역을 배제하고, 객체 영역이 강조된 전경 주의맵을 획득하고, 기 설정된 방식으로 전경 주의맵의 특징을 산출하여 전경 특징을 획득한다. 학습부는 각 경계 박스에 대한 전경 특징이 획득되 면 학습되는 방식에 따라 가중치(w)가 가변되어 설정되는 분류모델을 이용하여 전경 특징과 배경 특징을 분류하 여 가금 및 배경에 대한 클래스를 식별한다. 학습부는 식별된 클래스와 학습 데이터에 레이블된 클래스 사 이의 차이를 기반으로 기 설정된 방식에 따라 손실을 산출하고, 산출된 손실을 역전파하여 분류모델을 약지도 학습시킨다. 즉 학습부는 약지도 학습을 통해 학습 데이터에 가금이 포함되었는지 미포함되었는지 판단하도 록 학습시킨다. 여기서 학습부는 기 설정된 기준 횟수만큼 상술된 과정을 반복 수행하여 분류모델의 학습을 완료시킨다. 기 설정된 기준 횟수는 분류모델의 학습이 종료되어도 충분하다고 판단되는 횟수를 의미한다. 가금 유무 분류부는 가금이 사육되는 사육장을 촬영한 영상 데이터를 분류모델에 적용하여 영상 데이터에 가금이 포함되어 있는지 여부를 판단한다. 여기서 분류모델은 CNN 등과 같은 인공 신경망이면서, 약지도 학습이 완료된 모델일 수 있다. 가금 유무 분류부는 슬라이딩 윈도우(sliding window) 기법을 이용하여 영상 데이 터 전체에 대한 가금 유무를 분류한다. 가금 유무 분류부는 영상 데이터에 적어도 하나의 가금이 존재하지 않으면 가금 없음을 나타내는 출력값 0을 출력하고, 적어도 하나의 가금이 존재하면 가금 존재를 나타내는 출력 값 1을 출력한다. 공간 분포 추정부는 영상 데이터에 적어도 하나의 가금이 포함되어 있다고 판단되면(출력값 '1'인 경우) 설 명 가능 인공지능 모델을 이용하여 가금이 존재하는 위치에 대한 공간분포를 추정한다. 설명 가능 인공지능 모 델은 사람이 이해할 수 있고, 신뢰할 수 있는 설명을 제공할 수 있는 인공지능 모델로써, 기존 인공지능보다 정 확성, 공정성, 신뢰성을 보장할 수 있는 특징이 있다. 공간 분포 추정부는 설명 가능 인공지능 모델을 통해 가장 영향력이 있는 가금들의 위치에 대한 열지도를 생성한다. 여기서 가장 영향력이 있는 가금들의 위치는 가 금들이 군집되어 있는 위치를 의미한다. 공간 분포 추정부는 생성된 열지도를 이용하여 공간분포를 추정한 다. 즉 공간 분포 추정부는 열지도 중 밝은 부분에 해당하는 부분일수록 가금들이 군집되어 있다고 추정할 수 있다. 예를 들어 공간 분포 추정부는 검정색, 파란색, 초록색, 노란색 순으로 가금들이 더 군집되어 있 다고 추정할 수 있다. 이와 같이 공간 분포 추정부는 인공지능 기술을 접목하여 조명 변화(밝기), 노이즈 신호, 타 객체의 유무 등과 같은 외부 요인에 대한 영향을 최소화함으로써, 영상 데이터 전체에 대해 정확한 공간 분포를 추정할 수 있다. 상황 분석부는 공간분포를 이용하여 가금의 현재 상태를 분석한다. 즉 상황 분석부는 가금의 현재 상태 가 정상인지 아니면 이상이 있는지 분석한다. 이를 위해 상황 분석부는 공간분포와 기 설정된 기준 공간분 포를 비교하여 가금의 이상 여부를 분석 및 판단할 수 있다. 기 설정된 기준 공간분포는 가금이 정상인 경우에 일반적으로 분포되는 결과값을 의미한다. 상세하게는 상황 분석부는 공간분포가 기 설정된 기준 공간분포와 오차 범위를 벗어나는 경우, 적어도 하나 의 가금에 이상이 발생되었다고 판단할 수 있다. 예를 들어 상황 분석부는 가금에게 사료를 주었을 때 가금 들이 사료통 주변으로 공간분포가 형성되지 않고, 사료통과 반대되는 위치에 공간분포가 형성되면 가금들에게 이상이 있다고 판단한다. 또한 겨울철인 경우, 가금이 난방시설 주변에 공간분포가 형성되지 않고, 그 이외의 주변에 공간분포가 형성되면 가금들에게 이상이 있다고 판단한다. 상황 분석부는 분석된 결과가 이상이 있다고 판단되면 경보 메시지를 생성하고, 생성된 경보 메시지를 사용 자 단말로 전송시킬 수 있다. 바람직하게는 상황 분석부는 경보 메시지에 이상이 발생된 장소, 시간,"}
{"patent_id": "10-2023-0021009", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "특이사항 등을 간략하게 요약하여 사용자 단말로 전송시킬 수 있다. 출력부는 학습 데이터, 영상 데이터 및 공간분포가 표시된 열지도를 출력한다. 이때 출력부는 영상 데 이터와 해당 영상 데이터의 열지도를 비교하여 출력할 수 있다(도 6의 (a), (b), (c), (d)). 저장부는 공간분포 추정 장치가 구동되기 위한 프로그램 또는 알고리즘이 저장된다. 저장부는 학 습 데이터, 영상 데이터 및 공간분포가 표시된 열지도가 저장된다. 또한 저장부는 분류모델 및 설명 가능 인공지능 모델이 저장된다. 저장부는 플래시 메모리 타입(flash memory type), 하드디스크 타입(hard disk type), 미디어 카드 마이크로 타입(multimedia card micro type), 카드 타입의 메모리(예를 들어 SD 또는 XD 메모리 등), 램(Random Access Memory, RAM), SRAM(Static Random Access Memory), 롬(Read-Only Memory, ROM), EEPROM(Electrically Erasable Programmable Read-Only Memory), PROM(Programmable Read-Only Memory), 자기메모리, 자기 디스크 및 광디스크 중 적어도 하나의 저장매체를 포함할 수 있다. 도 7은 본 발명의 실시예에 따른 약지도 학습 방법을 설명하기 위한 순서도이다. 도 1 및 도 7을 참조하면, 약지도 학습 방법은 영상 데이터가 최소한의 레이블링을 통해 가금의 공간분포를 실 시간으로 추정할 수 있도록 도와준다. S110 단계에서, 공간분포 추정 장치는 학습 데이터를 마련한다. 공간분포 추정 장치는 가금이 포함된 전경과 가금이 미포함된 배경에 대한 학습 데이터를 각각 마련한다. 이때 전경에 대한 학습 데이터는 기 저장된 전경 폴더에서 로드한 데이터이고, 배경에 대한 학습 데이터는 기 저장된 배경 폴더에서 로드한 데이터일 수 있 다. S120 단계에서, 공간분포 추정 장치는 학습 데이터에서 전경 특징과 배경 특징을 획득한다. 공간분포 추정 장치는 분류모델을 이용하여 마련된 학습 데이터의 학습 영상으로부터 특징점을 추출하여 학습 특징맵을 획득한다. 공간분포 추정 장치는 학습 특징맵이 획득되면 학습 데이터에 레이블된 경계 박스와 학습 특징 맵을 이용하여 가금이 포함되지 않은 배경 영역의 위치별 배경 특징을 추출하고, 추출된 배경 특징과 학습 특징 맵 사이의 유사도를 기반으로 경계 박스 내의 배경 영역을 지정하는 배경 주의맵을 생성한다. 공간분포 추정 장 치는 배경 주의맵이 생성되면 배경 주의맵을 픽셀 반전하여 학습 특징맵을 이용하여 경계 박스 내에서 배 경 영역을 배제하고, 객체 영역이 강조된 전경 주의맵을 획득하고, 기 설정된 방식으로 전경 주의맵의 특징을 산출하여 전경 특징을 획득한다. S130 단계에서, 공간분포 추정 장치는 가금과 배경 클래스를 식별한다. 공간분포 추정 장치는 각 경 계 박스에 대한 전경 특징이 획득되면 학습되는 방식에 따라 가중치(w)가 가변되어 설정되는 분류모델을 이용하 여 전경 특징과 배경 특징을 분류하여 가금 및 배경에 대한 클래스를 식별한다. S140 단계에서, 공간분포 추정 장치는 클래스 식별자 기반으로 손실 역전파한다. 공간분포 추정 장치(10 0)는 식별된 클래스와 학습 데이터에 레이블된 클래스 사이의 차이를 기반으로 기 설정된 방식에 따라 손실을 산출하고, 산출된 손실을 역전파하여 분류모델을 약지도 학습시킨다. S150 단계에서, 공간분포 추정 장치는 약지도 학습이 종료되었는지 판단한다. 공간분포 추정 장치는 기 설정된 기준 횟수만큼 약지도 학습이 수행되어 약지도 학습이 종료되면 시스템을 종료하고, 기 설정된 기준 횟수만큼 약지도 학습이 수행되지 않아 약지도 학습이 종료되지 않으면 S110 단계를 재수행한다. 도 8은 본 발명의 실시예에 따른 공간분포 추정 방법을 설명하기 위한 순서도이다. 도 1 및 도 8을 참조하면, 공간분포 추정 방법은 최소한의 레이블링을 활용하는 약지도 학습을 이용하여 영상 데이터에 포함된 가금의 공간분포를 실시간으로 추정할 수 있다. 공간분포 추정 방법은 설명 가능한 인공지능 모델을 이용하여 가장 영향력이 있는 가금 위치를 열지도로 생성함으로써, 사용자로 하여금 직관적으로 가금의 분포 상태를 확인할 수 있도록 한다. S210 단계에서, 공간분포 추정 장치는 영상 촬영 장치로부터 영상 데이터를 수신한다. 여기서 영상 데이터는 사육장을 탑뷰 시점에서 촬영한 영상이고, RGB 이미지로 형성될 수 있다. S220 단계에서, 공간분포 추정 장치는 영상 데이터에 가금이 포함되어 있는지 판단한다. 공간분포 추정 장 치는 약지도 학습된 분류모델을 이용하여 영상 데이터에 가금이 존재하는지 여부를 판단한다. 공간분포 추 정 장치는 영상 데이터에 가금이 존재하면 S230 단계를 수행하고, 가금이 존재하지 않으면 S240 단계를 수 행한다. S230 단계에서, 공간분포 추정 장치는 공간분포를 추정한다. 공간분포 추정 장치는 설명 가능 인공지 능 모델을 이용하여 가금이 존재하는 위치에 대한 공간분포를 추정한다. 이때 공간분포 추정 장치는 가장 영향력이 있는 가금들의 위치에 대한 열지도를 생성할 수 있다. 열지도는 밝은 부분에 해당하는 부분일수록 가 금들이 군집됨을 나타낼 수 있다. S240 단계에서, 공간분포 추정 장치는 가금의 현재 상황을 분석한다. 공간분포 추정 장치는 공간분포 를 이용하여 가금의 현재 상태가 정상인지 아니면 이상이 있는지 분석한다. 즉 공간분포 추정 장치는 공간 분포와 기 설정된 기준 공간분포를 비교하여 가금의 이상 여부를 분석 및 판단할 수 있다. 만약 가금에 이상이 있다고 판단하면 공간분포 추정 장치는 경보 메시지를 생성한 후, 해당 경보 메시지를 사용자 단말로 전송하여 사용자가 해당 상황을 직관적으로 확인할 수 있도록 도와준다. 도 9는 본 발명의 실시예에 따른 컴퓨팅 장치를 설명하기 위한 블록도이다. 도 9를 참조하면, 컴퓨팅 장치(TN100)는 본 명세서에서 기술된 장치(예를 들면 공간분포 추정 장치, 영상 촬영 장치, 사용자 단말 등) 일 수 있다. 컴퓨팅 장치(TN100)는 적어도 하나의 프로세서(TN110), 송수신 장치(TN120), 및 메모리(TN130)를 포함할 수 있 다. 또한, 컴퓨팅 장치(TN100)는 저장 장치(TN140), 입력 인터페이스 장치(TN150), 출력 인터페이스 장치 (TN160) 등을 더 포함할 수 있다. 컴퓨팅 장치(TN100)에 포함된 구성 요소들은 버스(bus)(TN170)에 의해 연결 되어 서로 통신을 수행할 수 있다. 프로세서(TN110)는 메모리(TN130) 및 저장 장치(TN140) 중에서 적어도 하나에 저장된 프로그램 명령(program command)을 실행할 수 있다. 프로세서(TN110)는 중앙 처리 장치(CPU: central processing unit), 그래픽 처리 장치(GPU: graphics processing unit), 또는 본 발명의 실시예에 따른 방법들이 수행되는 전용의 프로세서를 의 미할 수 있다. 프로세서(TN110)는 본 발명의 실시예와 관련하여 기술된 절차, 기능, 및 방법 등을 구현하도록 구성될 수 있다. 프로세서(TN110)는 컴퓨팅 장치(TN100)의 각 구성 요소를 제어할 수 있다. 메모리(TN130) 및 저장 장치(TN140) 각각은 프로세서(TN110)의 동작과 관련된 다양한 정보를 저장할 수 있다. 메모리(TN130) 및 저장 장치(TN140) 각각은 휘발성 저장 매체 및 비휘발성 저장 매체 중에서 적어도 하나로 구 성될 수 있다. 예를 들어, 메모리(TN130)는 읽기 전용 메모리(ROM: read only memory) 및 랜덤 액세스 메모리 (RAM: random access memory) 중에서 적어도 하나로 구성될 수 있다. 송수신 장치(TN120)는 유선 신호 또는 무선 신호를 송신 또는 수신할 수 있다. 송수신 장치(TN120)는 네트워크 에 연결되어 통신을 수행할 수 있다. 한편, 본 발명의 실시예는 지금까지 설명한 장치 및/또는 방법을 통해서만 구현되는 것은 아니며, 본 발명의 실 시예의 구성에 대응하는 기능을 실현하는 프로그램 또는 그 프로그램이 기록된 기록 매체를 통해 구현될 수도 있으며, 이러한 구현은 상술한 실시예의 기재로부터 본 발명이 속하는 기술 분야의 통상의 기술자라면 쉽게 구 현할 수 있는 것이다. 이상에서 본 발명의 실시예에 대하여 상세하게 설명하였지만 본 발명의 권리범위는 이에 한정되는 것은 아니고 다음의 청구범위에서 정의하고 있는 본 발명의 기본 개념을 이용한 통상의 기술자의 여러 변형 및 개량 형태 또 한 본 발명의 권리범위에 속하는 것이다."}
{"patent_id": "10-2023-0021009", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 실시예에 따른 공간분포 추정 시스템을 설명하기 위한 구성도이다. 도 2는 본 발명의 실시예에 따른 공간분포 추정 장치를 설명하기 위한 블록도이다. 도 3은 본 발명의 실시예에 따른 제어부를 설명하기 위한 블록도이다. 도 4는 본 발명의 실시예에 따른 약지도 학습하는 과정을 설명하기 위한 도면이다. 도 5는 본 발명의 실시예에 따른 공간분포를 추정하는 과정을 설명하기 위한 도면이다. 도 6은 본 발명의 실시예에 따른 열지도의 출력을 설명하기 위한 도면이다. 도 7은 본 발명의 실시예에 따른 약지도 학습 방법을 설명하기 위한 순서도이다. 도 8은 본 발명의 실시예에 따른 공간분포 추정 방법을 설명하기 위한 순서도이다. 도 9는 본 발명의 실시예에 따른 컴퓨팅 장치를 설명하기 위한 블록도이다."}
