{"patent_id": "10-2022-0028418", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0131042", "출원번호": "10-2022-0028418", "발명의 명칭": "필터의 교체에 대한 알림을 제공하는 식기 세척기 및 방법", "출원인": "엘지전자 주식회사", "발명자": "강호석"}}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "필터의 교체에 대한 알림을 제공하는 식기 세척기에 있어서,내부에 세척 공간이 구비되며 전방이 개구되는 본체;상기 본체의 개구된 전방을 개폐하는 도어; 송풍 모터, 송풍 팬, 및 필터를 포함하는 건조풍 공급부;메모리; 표시부; 및상기 식기 세척기의 동작을 제어하는 프로세서를 포함하며,상기 프로세서는,상기 송풍 팬의 동작에 기반하여, 상기 송풍 팬이 동작하는 동작 시간을 상기 메모리에 누적하고,상기 송풍 팬의 동작에 기반하여 누적된 총 동작 시간과 미리 결정된 제1 시간을 비교하여 상기 누적된 총 동작시간이 상기 미리 결정된 제1 시간 보다 이상인 경우, 상기 필터의 교체에 대한 알림을 상기 표시부를 통해 출력하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서,상기 프로세서는,상기 건조풍 공급부에 기반하여, 상기 식기 세척기가 현재 건조 과정을 수행하고 있는 것으로 식별되면, 상기건조 과정이 수행되고 있는 동안 상기 표시부를 통해 상기 알림을 온으로 출력하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서,상기 프로세서는,상기 식기 세척기가 현재 건조 과정을 수행하고 있지 않은 것으로 식별되고, 상기 누적된 총 동작 시간이 상기미리 결정된 제1 시간 보다 이상인 경우, 상기 표시부를 통해 상기 알림을 온/오프로 반복적으로 출력하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1 항에 있어서,상기 프로세서는,상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이상이 아닌 경우, 상기 알림을 오프로 유지하도록 설정된 식기 세척기.공개특허 10-2023-0131042-3-청구항 5 제1 항에 있어서,상기 프로세서는,상기 누적된 총 동작 시간의 초기화를 감지하고,상기 초기와의 감지에 기반하여, 상기 메모리에 누적된 총 동작 시간을 0으로 초기화하도록 설정된 식기세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1 항에 있어서,상기 송풍 팬의 동작이 시작되면, 타이머를 구동하고,상기 송풍 팬의 동작이 종료되면, 상기 구동된 타이머를 통해 상기 송풍 팬의 동작 시간을 계산하고,상기 계산된 동작 시간을 상기 메모리에 저장된 총 동작 시간에 합산하고,상기 합산된 동작 시간을 상기 메모리에 저장하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제1 항에 있어서,상기 프로세서는,상기 식기 세척기가 상기 송풍 팬의 동작에 기반한 건조 과정을 수행한 횟수를 카운팅하고,상기 카운팅한 횟수가 미리 결정된 횟수 보다 이상인 경우, 상기 필터의 교체에 대한 알림을 상기 표시부를 통해 출력하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1 항에 있어서,스피커를 더 포함하며,상기 프로세서는,상기 필터의 교체에 대한 알림을 상기 스피커를 통해 출력하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제8 항에 있어서,상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이상인 경우, 상기 표시부를 통해 상기 알림을 온/오프로 반복적으로 출력하고,상기 알림이 온/오프로 반복적으로 출력되는 시간이 미리 결정된 제2 시간 보다 이상인 경우, 상기 알림을 온/오프로 반복적으로 출력하면서 상기 스피커를 통해 상기 필터의 교체에 대한 알림을 음성으로 출력하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "공개특허 10-2023-0131042-4-제1 항에 있어서,통신부를 더 포함하며,상기 프로세서는,상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이상인 경우, 상기 필터의 교체에 대한 정보를 상기 통신부를 통해 적어도 하나의 휴대 단말로 전송하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1 항에 있어서,상기 프로세서는,상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이상인 상태에서, 상기 식기 세척기가 현재 상기송풍 팬의 동작에 기반한 건조 과정을 수행하는 경우, 또는 상기 식기 세척기가 상기 송풍 팬의 동작에 기반하지 않는 행정 과정을 수행하는 경우에 따라 상기 알림이 서로 다르게 출력되도록 상기 표시부를 제어하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "식기 세척기에 있어서,송풍 모터, 송풍 팬, 및 필터를 포함하는 건조풍 공급부;통신부;메모리; 표시부; 및상기 식기 세척기의 동작을 제어하는 프로세서를 포함하며,상기 프로세서는,상기 송풍 팬의 동작에 기반하여, 상기 송풍 팬이 동작하는 횟수를 상기 메모리에 누적하고,상기 누적된 횟수와 미리 결정된 횟수를 비교하여 상기 누적된 횟수가 상기 미리 결정된 횟수 보다 이상인경우, 상기 필터의 교체에 대한 알림을 상기 표시부를 통해 출력하고, 상기 필터의 교체에 대한 정보를 상기 통신부를 통해 적어도 하나의 휴대 단말로 전송하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제12 항에 있어서,상기 프로세서는,상기 누적된 횟수가 증가할수록 상기 알림을 점차 레드 색으로 표시하도록 상기 표시부를 제어하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제12 항에 있어서,상기 프로세서는,공개특허 10-2023-0131042-5-상기 필터의 교체에 따른 총 동작 시간의 초기화, 누적 횟수의 초기화, 및 상기 적어도 하나의 휴대 단말로부터상기 필터의 교체에 대한 알림 해제를 나타내는 신호의 수신 중 적어도 하나가 식별되면, 상기 표시부에 표시된상기 알림을 해제하도록 설정된 식기 세척기."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "식기 세척기가 필터의 교체에 대한 알림을 제공하는 방법에 있어서,송풍 팬의 동작에 기반하여, 상기 송풍 팬이 동작하는 동작 시간을 누적하는 과정;상기 송풍 팬의 동작에 기반하여 누적된 총 동작 시간과 미리 결정된 제1 시간을 비교하여 상기 누적된 총 동작시간이 상기 미리 결정된 제1 시간 보다 이상인 경우, 상기 필터의 교체에 대한 알림을 상기 식기 세척기의 도어에 배치된 표시부를 통해 출력하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15 항에 있어서,상기 필터의 교체에 대한 알림을 상기 식기 세척기의 도어에 배치된 표시부를 통해 출력하는 과정은,상기 식기 세척기가 현재 건조 과정을 수행하고 있는 것으로 식별되면, 상기 건조 과정이 수행되고 있는 동안상기 표시부를 통해 상기 알림을 온(ON)으로 출력하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15 항에 있어서,상기 필터의 교체에 대한 알림을 상기 식기 세척기의 도어에 배치된 표시부를 통해 출력하는 과정은,상기 식기 세척기가 현재 건조 과정을 수행하고 있지 않은 것으로 식별되고, 상기 누적된 총 동작 시간이 상기미리 결정된 제1 시간 보다 이상인 경우, 상기 표시부를 통해 상기 알림을 온/오프로 반복적으로 출력하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제15 항에 있어서,상기 식기 세척기가 상기 송풍 팬의 동작에 기반한 건조 과정을 수행한 횟수를 카운팅하는 과정을 더 포함하는방법."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18 항에 있어서,상기 식기 세척기가 상기 송풍 팬의 동작에 기반한 건조 과정을 수행한 횟수를 카운팅하는 과정은,상기 카운팅한 횟수가 미리 결정된 횟수 보다 이상인 경우, 상기 필터의 교체에 대한 알림을 상기 표시부를 통해 출력하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0028418", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18 항에 있어서,공개특허 10-2023-0131042-6-상기 필터의 교체에 대한 알림을 상기 식기 세척기의 도어에 배치된 표시부를 통해 출력하는 과정은,상기 필터의 교체에 대한 정보를 적어도 하나의 휴대 단말로 전송하는 과정을 포함하는 방법."}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 개시는 필터의 교체에 대한 알림을 제공하는 식기 세척기 및 방법에 관한 것이다. 이를 위해, 본 개시에 따른 식기 세척기는 식기 세척기의 송풍 팬의 동작 시간을 지속적으로 누적하고, 누적된 총 동작 시간과 일정 시간 보다 이상인 경우, 필터의 교체에 대한 알림을 표시부를 통해 출력하거나, 스피커를 통해 출력할 수 있다. 따라서, 필터 교체 시기를 정확히 판단할 수 있다."}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 개시는 필터의 교체에 대한 알림을 제공하는 식기 세척기 및 방법에 관한 것이다."}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로, 식기 세척기는 고압의 세척수를 분사하여, 식사 후 식기에 흡착된 음식물 또는 오물을 제거하여 식 기를 세척해주는 장치이다. 이러한 식기 세척기는 식기 세척을 위해 세척, 헹굼 및 건조와 같은 여러 단계의 과 정을 거쳐 동작한다. 이러한 건조 과정에서, 식기 세척기는 외부 공기를 필터를 통해 여과하여 식기 세척기 내의 식기를 건조시키는 과정을 수행한다. 종래 선행 기술(국제특허출원공개공보 WO 2021/251871 A1)은 산업용 집진기용 필터 장치에 관한 것으로서, 필터 가 제자리에 있지 않은 경우 먼지 추출 작업이 방지될 수 있도록 필터 상태의 검출하여 표시하는 내용을 개시하 고 있다. 그런데, 종래 선행 기술은 필터의 상태와 필터에 흡착된 먼지량에 대해 표시할 뿐, 필터의 사용 시간 또는 사용 횟수에 기반하여 필터 교체를 알리는 내용을 개시하고 있지 않기 때문에, 사용자가 필터 교체에 대해 직관적으 로 파악할 수 없는 문제점이 있다. 또한, 종래 선행 기술은 필터 교체에 대한 알림을 휴대 단말로 전송하지 않는다. 따라서, 식기 세척기가 오염되지 않은 공기를 이용하여 식기를 건조시키는데 있어서, 사용자가 공기를 정화하는 필터의 교체에 대한 알림을 직관적으로 인지할 수 있도록 필터 교체에 대한 알림을 제공할 필요성이 제기된다. 선행기술문헌 특허문헌 (특허문헌 0001) 국제특허출원공개공보 WO 2021/251871 A1"}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "종래에는 필터의 상태와 필터에 흡착된 먼지량에 대해 표시할 뿐, 필터의 사용 시간 또는 사용 횟수에 기반하여 필터 교체를 알리지 않았기 때문에, 사용자는 필터의 교체에 대한 알림을 직관적으로 인지할 수 없었다. 따라서, 본 개시는 필터의 교체에 대한 알림을 제공하는 식기 세척기 및 방법을 제공하는 것이다. 또한, 본 개시는 송풍 팬의 동작 시간에 기반하여 필터의 교체 여부를 결정하고, 필터 교체로 판단되면 필터의 교체에 대한 알림을 온/오프(ON/OFF) 방식으로 표시부에 표시하는 식기 세척기 및 방법을 제공하는 것이다. 또한, 본 개시는 송풍 팬의 동작 횟수에 기반하여 필터의 교체 여부를 결정하고, 필터 교체로 판단되면 필터의 교체에 대한 알림을 온/오프(ON/OFF) 방식으로 표시부에 표시하는 식기 세척기 및 방법을 제공하는 것이다. 또한, 본 개시는 필터의 교체에 대한 알림을 표시부에 표시한 상태에서, 필터가 교체되면 표시된 알림을 해제하 는 식기 세척기 및 방법을 제공하는 것이다. 또한, 본 개시는 필터의 교체에 대한 알림을 표시부에 표시 및 휴대 단말로 제공하고, 휴대 단말로부터 알림 해 제 신호의 수신에 기반하여 표시부에 표시된 알림을 해제하는 식기 세척기 및 방법을 제공하는 것이다. 본 개시의 목적들은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 본 개시의 다른 목적 및 장점들 은 하기의 설명에 의해서 이해될 수 있고, 본 개시의 실시 예에 의해 보다 분명하게 이해될 것이다. 또한, 본 개시의 목적 및 장점들은 특허 청구 범위에 나타낸 수단 및 그 조합에 의해 실현될 수 있음을 쉽게 알 수 있을 것이다."}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이러한 목적을 달성하기 위해 본 개시에 따른 식기 세척기는 행정 중에 송풍 팬에 의한 건조 과정이 시작되는 경우, 송풍 팬이 동작하는 시간을 지속적으로 누적하고, 누적된 동작 시간이 미리 결정된 시간 보다 이상인지를 판단할 수 있다. 또한, 본 개시는 누적된 동작 시간이 미리 결정된 시간 보다 이상인 경우, 필터의 교체에 대한 알림을 식기 세 척기의 표시부에 출력할 수 있다. 또한, 본 개시는 필터의 교체에 대한 알림을 식기 세척기의 표시부에 출력한 이후, 필터가 교체되는 것으로 식 별되면 누적된 동작 시간을 초기화하고 알림을 해제할 수 있다. 또한, 본 개시는 식기 세척기가 현재 건조 과정을 수행하고 있는 것으로 식별되면, 상기 건조 과정이 수행되고 있는 동안에 표시부를 통해 알림을 온(ON)으로 지속적으로 표시할 수 있다. 또한, 본 개시는 식기 세척기가 현재 건조 과정을 수행하고 있지 않은 것으로 식별되고, 누적된 총 동작 시간이 미리 결정된 시간 보다 이상인 경우, 상기 알림을 온/오프(ON/OFF)로 반복적으로 표시되도록 출력할 수 있다. 또한, 본 개시는 필터의 교체에 기반하여, 누적된 총 동작 시간의 초기화가 감지되면, 메모리에 누적된 총 동작 시간을 0으로 초기화할 수 있다. 또한, 본 개시는 식기 세척기가 송풍 팬의 동작에 기반한 건조 과정을 수행한 횟수를 카운팅하여 누적하고, 누 적된 카운팅 횟수가 미리 결정된 횟수 보다 이상인 경우, 필터의 교체에 대한 알림을 표시부를 통해 출력할 수 있다. 또한, 본 개시는 필터의 교체에 대한 알림을 식기 세척기의 스피커를 통해 출력할 수 있다. 또한, 본 개시는 표시부를 통해 알림을 온/오프(ON/OFF)로 반복적으로 표시하고 있는 상태에서, 알림을 표시한 시간이 일정 시간을 초과하면 상기 알림을 스피커를 통해서도 출력할 수 있다. 또한, 본 개시는 필터의 누적된 총 동작 시간이 미리 결정된 시간 보다 이상인 경우, 상기 필터의 교체에 대한 정보를 통신부를 통해 적어도 하나의 휴대 단말로 전송할 수 있다. 또한, 본 개시는 식기 세척기가 현재 상기 송풍 팬의 동작에 기반한 건조 과정을 수행하거나, 또는 상기 식기 세척기가 상기 송풍 팬의 동작에 기반하지 않는 행정 과정을 수행하는 경우, 알림이 서로 다르게 표시되도록 표 시부를 제어할 수 있다. 또한, 본 개시는 송풍 팬의 동작에 기반한 횟수를 누적하고, 상기 누적된 횟수가 미리 결정된 횟수 보다 이상인 경우, 필터의 교체에 대한 알림을 표시부를 통해 출력하고, 상기 필터의 교체에 대한 정보를 적어도 하나의 휴 대 단말로 전송할 수 있다. 또한, 본 개시는 필터의 교체에 대해 식별되거나, 휴대 단말로부터 알림 해제를 요청하는 신호가 식별되면, 표 시부에 표시된 알림을 해제할 수 있다. 또한, 본 개시는 송풍 팬이 동작하여 누적한 횟수가 증가할수록 알림을 점차 레드(RED) 색으로 표시할 수 있다."}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 개시는 식기 세척기가 행정 중에 송풍 팬에 의한 건조 과정이 시작되는 경우, 송풍 팬이 동작하는 시간을 지 속적으로 누적하고, 누적된 동작 시간이 미리 결정된 시간 보다 이상인지를 판단함으로써, 필터 교체 시기를 정 확히 판단할 수 있다. 또한, 본 개시는 누적된 동작 시간이 미리 결정된 시간 보다 이상인 경우, 필터의 교체에 대한 알림을 식기 세 척기의 표시부에 출력함으로써, 사용자에게 필터 교체를 직관적으로 인지시킬 수 있다. 또한, 본 개시는 필터의 교체에 대한 알림을 식기 세척기의 표시부에 출력한 이후, 필터가 교체되는 것으로 식 별되면 누적된 동작 시간을 초기화하고 알림을 해제함으로써, 필터 교체시마다 사용자에게 필터 교체에 대한 결과를 인지시킬 수 있다. 또한, 본 개시는 식기 세척기가 현재 건조 과정을 수행하고 있는 것으로 식별되면, 상기 건조 과정이 수행되고 있는 동안에 표시부를 통해 알림을 온(ON)으로 지속적으로 표시함으로써, 건조 과정의 진행 여부에 따라 알림 표시를 차등화할 수 있다. 또한, 본 개시는 식기 세척기가 현재 건조 과정을 수행하고 있지 않은 것으로 식별되고, 누적된 총 동작 시간이 미리 결정된 시간 보다 이상인 경우, 상기 알림을 온/오프(ON/OFF)로 반복적으로 표시되도록 출력함으로써, 사 용자는 식기 세척기의 동작 여부에 관계 없이 필터 교체의 필요성을 인지할 수 있다. 또한, 본 개시는 식기 세척기가 송풍 팬의 동작에 기반한 건조 과정을 수행한 횟수를 카운팅하여 누적하고, 누 적된 카운팅 횟수가 미리 결정된 횟수 보다 이상인 경우, 필터의 교체에 대한 알림을 표시부를 통해 출력함으로 써, 짧은 시간으로 식기 세척기를 사용자에게도 필터 교체를 직관적으로 인지시킬 수 있다. 또한, 본 개시는 필터의 교체에 대한 알림을 식기 세척기의 스피커를 통해 출력함으로써, 원거리에 있는 사용자 에게 필터 교체의 필요성을 실시간으로 제공할 수 있다. 또한, 본 개시는 표시부를 통해 알림을 온/오프(ON/OFF)로 반복적으로 표시하고 있는 상태에서, 알림을 표시한 시간이 일정 시간을 초과하면 상기 알림을 스피커를 통해서도 출력함으로써, 원거리에 있는 사용자에게 필터 교 체의 필요성을 실시간으로 제공할 수 있다. 또한, 본 개시는 필터의 누적된 총 동작 시간이 미리 결정된 시간 보다 이상인 경우, 상기 필터의 교체에 대한 정보를 통신부를 통해 적어도 하나의 휴대 단말로 전송함으로써, 필터 교체를 잊은 사용자에게 필터 교체를 인 지시킬 수 있다. 또한, 본 개시는 식기 세척기가 현재 상기 송풍 팬의 동작에 기반한 건조 과정을 수행하거나, 또는 상기 식기 세척기가 상기 송풍 팬의 동작에 기반하지 않는 행정 과정을 수행하는 경우, 알림을 서로 다르게 표시함으로써, 건조 과정의 진행 여부에 따라 알림 표시를 차등화하여 표시할 수 있다. 또한, 본 개시는 송풍 팬의 동작에 기반한 횟수를 누적하고, 상기 누적된 횟수가 미리 결정된 횟수 보다 이상인 경우, 필터의 교체에 대한 알림을 표시부를 통해 출력하고, 상기 필터의 교체에 대한 정보를 적어도 하나의 휴 대 단말로 전송함으로써, 식기 세척기 주변의 사용자 또는 주변에 위치하지 않는 사용자에게도 필터 교체를 인 지시킬 수 있다. 또한, 본 개시는 송풍 팬이 동작하여 누적한 횟수가 증가할수록 알림을 점차 레드(RED) 색으로 표시함으로써, 사용자에게 필터 교체 시기를 인지시킬 수 있다. 상술한 효과와 더불어 본 개시의 구체적인 효과는 이하"}
{"patent_id": "10-2022-0028418", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "전술한 목적, 특징 및 장점은 첨부된 도면을 참조하여 상세하게 후술되며, 이에 따라 본 개시가 속하는 기술분 야에서 통상의 지식을 가진 자가 본 개시의 기술적 사상을 용이하게 실시할 수 있을 것이다. 본 개시를 설명함 에 있어서 본 개시와 관련된 공지 기술에 대한 구체적인 설명이 본 개시의 요지를 불필요하게 흐릴 수 있다고 판단되는 경우에는 상세한 설명을 생략한다. 이하, 첨부된 도면을 참조하여 본 개시에 따른 바람직한 실시 예를 상세히 설명하기로 한다. 도면에서 동일한 참조부호는 동일 또는 유사한 구성요소를 가리키는 것으로 사용된다. 비록 제1, 제2 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한 되지 않음은 물론이다. 이들 용어들은 단지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것으 로, 특별히 반대되는 기재가 없는 한, 제1 구성요소는 제2 구성요소일 수도 있음은 물론이다. 이하에서 구성요소의 \"상부 (또는 하부)\" 또는 구성요소의 \"상 (또는 하)\"에 임의의 구성이 배치된다는 것은, 임의의 구성이 상기 구성요소의 상면 (또는 하면)에 접하여 배치되는 것뿐만 아니라, 상기 구성요소와 상기 구 성요소 상에 (또는 하에) 배치된 임의의 구성 사이에 다른 구성이 개재될 수 있음을 의미할 수 있다. 또한 어떤 구성요소가 다른 구성요소에 \"연결\", \"결합\" 또는 \"접속\"된다고 기재된 경우, 상기 구성요소들은 서 로 직접적으로 연결되거나 또는 접속될 수 있지만, 각 구성요소 사이에 다른 구성요소가 \"개재\"되거나, 각 구성 요소가 다른 구성요소를 통해 \"연결\", \"결합\" 또는 \"접속\"될 수도 있는 것으로 이해되어야 할 것이다. 명세서 전체에서, 특별히 반대되는 기재가 없는 한, 각 구성요소는 단수일수도 있고 복수일 수도 있다. 본 명세서에서 사용되는 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 본 출원에서, \"구성된다\" 또는 \"포함한다\" 등의 용어는 명세서 상에 기재된 여러 구성 요소들, 또는 여러 단계들을 반드시 모두 포함하는 것으로 해석되지 않아야 하며, 그 중 일부 구성 요소들 또는 일부 단계들은 포함되지 않 을 수도 있고, 또는 추가적인 구성 요소 또는 단계들을 더 포함할 수 있는 것으로 해석되어야 한다. 명세서 전체에서, \"A 및/또는 B\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, A, B 또는 A 및 B 를 의미 하며, \"C 내지 D\" 라고 할 때, 이는 특별한 반대되는 기재가 없는 한, C 이상이고 D 이하인 것을 의미한다 이하에서는, 본 개시의 몇몇 실시 예에 따른 식기 세척기 및 방법을 설명하도록 한다. [식기 세척기의 전반적 구조] 이하, 첨부된 도면을 참조하여 본 개시의 일 실시 예에 따른 식기세척기의 전반적 구조를 상세히 설명한다. 도 1은 본 개시에 따른 식기세척기를 나타낸 정면 사시도이다. 도 2는 본 개시에 따른 식기세척기의 내부 구조 를 간략히 나타낸 간략 단면도이다. 도 1 및 도 2에 도시한 바와 같이, 본 개시에 따른 식기세척기는, 내부에 세척 공간이 구비되며 전방이 개 구되는 본체와, 본체의 내부에 설치되며 세척 대상물이 세척되는 세척 공간을 형성하며 전면이 개 방되는 터브와, 터브의 개방된 전면을 개폐하는 도어와, 터브의 하부에 위치하며 세척 대상물 을 세척하기 위한 세척수를 공급, 집수, 순환, 및 배수하는 구동부와, 터브의 내부 세척공간에 착 탈 가능하게 구비되며 세척 대상물이 안착되는 수납부와, 수납부에 인접하여 설치되며 세척 대상물의 세척을 위한 세척수를 분사하는 분사 노즐(61, 62)를 구비한다. 예를 들면, 상기 구동부는 급수 장치(도 11 의 1110), 및 세척장치(도 11의 1150)를 포함할 수 있다. 예를 들면, 수납부에 안착되는 세척 대상물은 예를 들어, 그릇, 접시, 숫가락, 젓가락 등의 식기, 및 기타 조리기구일 수 있다. 이하에서 다른 언급이 없는 한, 세척 대상물을 식기로 지칭하기로 한다. 일 실시 예에 따르면, 터브는, 전면이 전체적으로 개방된 박스 형상으로 형성될 수 있으며, 소위 세척조로 알려져 있는 구성에 해당한다. 예를 들면, 터브의 내부에는 세척공간이 형성되고, 개방된 전면은 도어에 의해 개폐될 수 있다. 터브는, 고온과 수분에 강한 금속판재, 예를 들면 스테인레스 계열의 재질을 갖는 판재를 프레스 가공을 통 해서 형성될 수 있다. 일 실시 예에 따르면, 터브의 내측면에는, 후술하는 수납부, 분사 노즐(61, 62) 등과 같은 기능 구성들 이 터브의 내부에서 지지되고 설치되도록 하기 위한 목적을 갖는 다수의 브라켓이 배치될 수 있다. 예를 들면, 구동부는, 세척수를 저장하는 섬프와, 섬프를 터브와 구분하는 섬프 커버와, 외부로부터 섬프로 세척수를 공급하는 급수관와, 섬프의 세척수를 외부로 배출하는 배수관와, 섬프의 세척수를 분사 노즐(61, 62)로 공급하기 위한 세척펌프 및 공급유로를 포함하여 구성될 수 있다. 섬프 커버는 섬프의 상부에 배치되며, 터브와 섬프를 구분하는 역할을 할 수 있다. 또한, 섬프 커버에는 분사 노즐(61, 62)를 통해 세척공간으로 분사된 세척수를 섬프로 회수하기 위한 복수의 회수 홀들이 구비될 수 있다. 예를 들면, 분사 노즐(61, 62)에서 식기를 향해 분사된 세척수는 세척공간의 하부로 낙하하고, 섬프 커버 를 거쳐 다시 섬프 내로 회수될 수 있다. 일 실시 예에 따르면, 세척펌프는 섬프의 측부 또는 하부에 구비되며, 세척수를 가압하여 분사 노즐 (61, 62)로 공급하는 역할을 한다. 이러한, 세척펌프의 일 단은 섬프에 연결되고 타 단은 공급유로에 연결될 수 있다. 세척펌프는 임펠러 및 모터 등이 구비될 수 있다. 모터에 전력이 공급되면 임펠러가 회전하고, 섬프 의 세척수가 가압된 후 공급유로를 거쳐 분사 노즐(61, 62)로 공급될 수 있다. 일 실시 예에 따르면, 공급 유로는 세척펌프로부터 공급된 세척수를 분사 노즐(61, 62)에 선택적으로 공급하는 역할을 할 수 있다. 예를 들면, 공급 유로는 제1 노즐(예: 하부 분사암)에 연결되는 제1 공급유로, 제2 노즐(예: 상부 분사암) 및 탑 노즐에 연결되는 제2 공급유로를 포함할 수 있다. 그리고, 공급 유로에는 공 급 유로들(461, 463)을 선택적으로 개폐하는 공급유로 전환 밸브가 구비될 수 있다. 이 때, 공급유로 전환밸브는 각 공급유로들(461, 463)이 순차적으로 개방되도록 하거나 또는 동시에 개방 되도록 제어될 수 있다. 일 실시 예에 따르면, 분사 노즐(61, 62)는 수납부에 수납된 식기 등에 세척수를 분사할 수 있도록 구비된 다. 예를 들면, 분사 노즐(61, 62)은 터브의 하부에 위치하여 하부 랙으로 세척수를 분사하는 하부 분사암 과, 하부 랙과 상부 랙 사이에 위치하며 하부 랙과 상부 랙으로 세척수를 분사하는 상부 분사암과, 터브의 상부에 위치하며 탑 랙 또는 상부 랙으로 세척수를 분사하는 탑 노즐을 포함할 수 있다. 예를 들면, 하부 분사암과 상부 분사암은 터브의 세척공간에 회전 가능하게 구비되어 수납부 의 식기를 향해 회전하면서 세척수를 분사할 수 있다. 그리고, 하부 분사암은 하부 랙의 하부에서 하부 랙을 향해 회전하면서 세척수를 분사할 수 있도록, 섬프 커버의 상부에서 회전 가능하게 지지될 수 있다. 또한, 상기 상부 분사함은 하부 랙과 상부 랙 사이에서 회전하면서 세척수를 분사할 수 있도록 분 사암 홀더에 의해서 회전 가능하게 지지될 수 있다. 일 실시 예에 따르면, 식기 세척기는 터브의 하면에는 세척 효율을 높이기 위해서, 하부 분사암 으로부터 분사된 세척수를 상부 방향(U-방향)으로 전환하기 위한 수단이 더 구비될 수 있다.분사 노즐(61, 62)에 관한 세부 구성은 당업계에 이미 공지된 구성이 적용 가능한 바, 이하에서는 분사 노즐 (61, 62)에 관한 구체적인 구성에 관한 설명은 생략하도록 한다. 한편, 세척 공간에는 식기를 수납하기 위한 수납부가 구비될 수 있다. 일 실시 예에 따르면, 수납부는 터브의 내부에서 터브의 개방된 전면을 통해 인출 가능하게 구비된 다. 예를 들면, 도 2에는 터브의 하부에 위치하며 비교적 큰 대형 식기가 수납될 수 있는 하부 랙과, 하부 랙의 상부에 위치하고 중형 사이즈의 식기가 수납될 수 있는 상부 랙과, 터브의 상부에 위치하고 소형 식기 등이 수납될 수 있는 탑 랙을 포함하는 수납부가 구비되는 실시 예가 도시되어 있다. 본 개시는 이에 한정되는 것은 아니나 도시된 바와 같이 3개의 수납부가 구비되는 식기세척기의 실시 예를 기준으로 설명하도록 한다. 이들 하부 랙, 상부 랙 및 탑 랙은 각각 터브의 개방된 전면을 통과하여 외부로 인출되도록 구 성될 수 있다. 이를 위하여, 터브의 내주면을 형성하는 양측벽에는 가이드 레일(미도시)이 구비될 수 있고, 예시적으로 가 이드 레일은 상부레일, 하부레일, 및 탑레일 등을 포함할 수 있다. 이들 하부 랙, 상부 랙 및 탑 랙 하부에는 각각 휠이 구비될 수 있다. 사용자는 이들 하부 랙 , 상부 랙 및 탑 랙을 터브의 전면을 통해 외부로 인출함으로써 이들에 식기를 수납하거나, 또 는 세척이 완료된 식기를 용이하게 이들로부터 꺼낼 수 있다. 가이드 레일은 분사 노즐(61, 62)의 인출 및 투입을 안내하기 위한 단순 레일 형태의 고정 가이드 레일 또는 분 사 노즐(61, 62)의 인출 및 수납을 안내하며 분사 노즐(61, 62)의 인출에 따라 인출 거리가 증가되는 신축 가이 드 레일로서 구비될 수 있다. 한편, 도어는 상술한 터브의 개방된 전면을 개폐할 수 있다. 이러한 통상적으로 개방된 전면의 하부에 도어의 개폐를 위한 힌지부(미도시)가 구비되며, 도어는 힌지 부를 회전축으로 하여 회전하면서 도어가 개방된다. 그리고, 이러한 도어의 개방을 감지하기 위한 센서 (예: 제1 메인 센서, 제2 메인 센서, 및 서브 센서)가 적절한 위치에 배치될 수 있다. 예를 들면, 제1 메인 센서, 제2 메인 센서는 도어의 상면과 맞닿은 식기 세척기의 본체의 접합부에 배치될 수 있다. 그리고, 서브 센서는 힌지부 주변에 배치되어 도어의 개방을 감지할 수 있 다. 여기서, 도어의 외측면에는 도어를 개방하기 위한 핸들 및 식기세척기를 제어하기 위한 컨트 롤패널이 구비될 수 있다. 도 1을 참조하면, 컨트롤 패널에는 식기세척기의 현재 작동 상태 등에 관한 정보가 시각적으로 표시되는 표 시부와, 사용자의 선택 조작이 입력되는 선택버튼 및 식기세척기의 전원을 온-오프하기 위한 사용자의 조작 이 입력되는 전원버튼 등을 포함하는 버튼부가 구비될 수 있다. 일 실시 예에 따르면, 도어의 내측면은 도어의 폐쇄시 터브의 일면을 형성함과 동시에 도어의 풀-개방시 수납부의 하부 랙이 지지될 수 있는 안착면이 형성될 수 있다. 이를 위하여 도어가 풀-개방될 경우(예: 사용자가 강제로 도어를 완전히 개방하는 경우) 도어의 내측면 은 하부 랙이 안내되는 가이드 레일이 연장되는 방향과 동일하게 수평면 상태를 형성하는 것이 바람직 하다. 도 2에 도시된 바와 같이, 터브의 상면 외측에는 도어를 자동개방하기 위한 도어자동개방모듈이 구비 될 수 있다. 일 실시 예에 따르면, 도어자동개방모듈은, 후술하는 건조풍 공급부가 작동되어 터브의 내부로 건 조풍이 공급되면, 도어를 소정의 개방위치로 이동시켜 터브의 전면을 부분적으로 개방시키는 역할 을 하게 된다. 따라서 식기를 건조하면서 습해진 공기는 개방된 터브의 전면 상부를 통해서 배출될 수 있다. 예를 들면, 도어자동개방모듈은 도어의 후면 상단을 개방위치까지 회전이동시키는 푸쉬 로드를 구비할 수 있다. 또한, 터브의 하부에는 터브의 내부의 세척공간으로 고온 또는 저온 건조풍을 생성하고 공급하기 위한 건조풍 공급부가 구비될 수 있다. 일 실시 예에 따르면, 건조풍 공급부는 외부공기를 여과하는 필터와, 건조풍 기류를 생성하는 송풍 팬 과, 송풍 팬를 동작시키는 송풍 모터, 건조풍 기류를 가열하는 히터와, 터브의 내부에 배치 되며 건조풍 기류의 안내하는 기류 가이드를 포함하여 구성될 수 있다. 예를 들면, 터브의 하면에는 건조풍 공급부에서 생성된 고온 건조풍이 터브의 내부로 도입할 수 있 도록 건조풍 공급홀이 구비될 수 있다. 건조풍 공급부의 세부구성에 대해서는 도 3 이하를 참조하여 후술한다. [건조풍 공급부의 세부 구성] 도 3은 본 개시의 일 실시 예에 따른 식기세척기의 건조풍 공급부가 베이스에 수용된 상태를 도시한 정면 사시 도이다. 도 4는 도 3에 도시된 건조풍 공급부의 분해 사시도이다. 도 5 및 도 6은 도 4에 도시된 필터 및 필터 하우징의 세부구성을 도시한 분해 사시도이다. 도 7 및 도 8은 도 3에 바텀 터브가 결합된 상태를 나타낸 정면 사시도이다. 이하, 도 3 내지 도 8을 참조하여 전술한 건조풍 공급부의 세부 구성을 설명한다. 먼저 도 3에 도시된 바와 같이, 건조풍 공급부는 베이스에 수용되고 베이스의 저면에 의해 지 지되도록 배치될 수 있다. 예를 들면, 건조풍 공급부는 베이스의 후면에 인접한 위치에 배치될 수 있거나, 또는 누수감지부와 베이스의 후면 사이의 위치에 대체로 베이스의 후면에 나란하게 배치될 수 있다. 이러한 배치 위치는, 고온 건조풍 공급 과정에서 미리 결정된 온도(약 100) 이상의 고열이 발생되는 건조풍 공 급부의 특성을 고려하여 선택될 수 있다. 예를 들면, 상대적으로 고열의 영향을 많이 받는 전장부품을 회피 한 위치가 선택될 수 있다. 또한, 이러한 배치 위치는 터브의 하면에 형성되는 건조풍 공급홀에 위치에 근거하여 선택될 수 있다. 즉, 사용자의 안전을 고려하여 건조풍이 유입되는 건조풍 공급홀은 터브의 하면으로서 후면 및 좌측면 에 인접한 코너에 형성될 수 있다. 이러한 위치에 형성되는 건조풍 공급홀로 효과적으로 건조풍을 생성하여 공급할 수 있도록, 건조풍 공급부 는 건조풍 공급홀의 하부 측에 배치될 수 있다. 다만, 이러한 건조풍 공급부의 배치 위치는 예시적인 것에 불과하며, 이와는 달리 베이스의 후면이 아닌 좌측면, 우측면 또는 전면에 인접한 위치에 배치될 수 있다. 본 개시는 이에 한정되는 것은 아니지만, 이하에서는 건조풍 공급부가 베이스의 후면에 인접하여 후면에 대략 나란하게 배치 되는 실시 예를 기준으로 설명하도록 한다. 일 실시 예에 따르면, 베이스의 저면에는 건조풍 공급부를 지지하고 이탈을 방지하기 위한 서포트 리브(미도시)와, 터브로부터 세척수가 누설되는지 여부를 감지하는 누수 감지부(미도시)의 위치를 설정하고 이탈을 방지하기 위한 복수의 가이드리브(미도시)와, 건조풍공급부로부터 배출되는 세척수를 누수 감지부로 안내하기 위한 세척수리브(미도시)가 구비될 수 있다. 예를 들면, 이들 서포트리브, 가이드리브 및 세척수리브는 베이스의 저면에 일체로 형성될 수 있다. 서포트리브에는 후술하는 건조풍 공급부의 제1 레그, 제2 레그 및 제3 레그가 비체결 방식 으로 결합될 수 있다. 즉 제1 레그, 제2 레그 및 제3 레그가 별도의 체결수단없이 서포트리브에 단순 거치되는 방식으로 건조풍 공급부가 상하방향, 전후방향 및 좌우방향에 대해서 지지될 수 있다. 도 4 내지 도 6에는, 건조풍 공급부의 세부 구성이 도시되어 있다. 일 실시 예에 따르면, 건조풍을 생성하여 터브의 내부로 공급하는 건조풍 공급부는, 터브의 내부로 공급되는 건조풍 기류(F)를 생성하는 송풍 팬과, 건조풍을 가열하는 히터와, 내부에 히터가 수용 되는 공기통로가 형성되는 히터 하우징과, 송풍 팬으로 흡입될 공기를 여과하는 필터를 포함할 수 있다. 일 실시 예에 따르면, 송풍 팬은, 히터 및 히터 하우징에 대해서 건조풍 기류(F)의 방향으로 상류 측에 배치되며, 히터 하우징의 내부에 형성되는 공기통로로 공기를 가속하여 건조풍 기류(F)를 생성하는 역 할을 한다. 예를 들면, 송풍 팬과, 송풍 팬의 회전 구동력을 생성하는 송풍 모터는 서로 모듈화되어 팬 하우 징의 내부에 수용되는 방식으로 조립체를 형성할 수 있다. 송풍 팬과 팬 하우징은, 후술하는 필터링부의 필터 하우징과 히터 하우징을 연결하는 하 우징 커넥터에 고정될 수 있다. 예를 들면, 송풍 팬과 팬 하우징은 하우징 커넥터에 고정된 상태로 전체적으로 필터 하우징 의 내부에 수용될 수 있다. 일 실시 예에 따르면, 건조풍 공급부에 적용되는 송풍 팬의 종류, 크기 등의 타입에는 제한이 없으나, 예를 들면, 송풍 팬이 설치되는 위치적 제약 및 공간적 제약을 고려하여 시로코팬이 바람직할 수 있다. 예를 들면, 시로코팬이 적용되는 경우에 시로코팬의 중앙으로부터 회전축에 나란한 방향으로 팬 하우징의 하면으로부터 필터에 의해 필터링된 공기가 흡입되고, 반경방향 외측을 향해 공기가 가속되어 배출될 수 있다. 그리고, 가속되어 배출되는 공기는 건조풍 기류(F)를 형성하며 팬 하우징, 하우징 커넥터의 유입구 를 거쳐 히터 하우징의 내부의 공기통로로 유입될 수 있다. 이 경우, 시로코팬이 되는 송풍 팬 및 모터의 회전축은 예시적으로 대체로 상하방향(U-D방향)에 나 란한 방향성을 갖도록 배치될 수 있으며, 필터에 의해 필터링된 공기는 팬 하우징의 하면을 통해 흡입될 수 있다. 예를 들면, 상기 필터는 에어 필터일 수 있다. 일 실시 예에 따르면, 필터에 의해 필터링된 공기가 흡입되는 하면의 반대측에 해당하는 팬 하우징 의 상면의 내측에는 모터의 제어를 위한 PCB 기판이 내장될 수 있다. 예를 들면, 상기 PCB 기판 상에는 후술하는 도 11의 각 구성 요소가 배치되어, 서로 전기적으로 연결될 수 있다. 일 실시 예에 따르면, 팬 하우징은, 도시된 바와 같이 예시적으로 하우징 커넥터에 구비되는 고리형상 의 연결탭에 도시되지 않은 스크류볼트 등과 같은 체결수단을 통해서 고정될 수 있다. 예를 들면, 연결탭은 커넥터본체의 유입구로부터 팬하우징의 상면을 커버하는 방향으 로 연장될 수 있다. 그리고, 도 7 및 도 8에 도시된 바와 같이, 연결탭에는 연결탭의 상면으로부터 상부 방향(U-방향)으 로 연장되는 한 쌍의 체결보스가 구비될 수 있다. 예를 들면, 한 쌍의 체결보스는, 베이스에 배치된 상태를 기준으로 필터링부의 상부 하우징에 해 당하는 제1 하우징의 내부에 구비되는 가이드보스(8811e)에 결합될 수 있다. 일 실시 예에 따르면, 하우징 커넥터의 커넥터 본체는, 건조풍 기류의 유동방향을 기준으로 하류에 배 치되는 히터 하우징의 개방된 전단에 결합하여 히터 하우징과 함께 건조풍 기류가 유동하는 공기통로 (C)를 형성하는 역할을 한다. 이를 위해, 커넥터 본체는 내부가 비어있는 중공의 박스형상을 갖도록 형성될 수 있다. 커넥터 본체의 내부면은 건조풍 기류의 유동방향을 따라 진행하면서 점진적으로 공기통로(C)의 단면적이 확장될 수 있고, 히터 하우징이 결합되는 후단부(871b)의 단면적은 히터 하우징의 선단부의 단면적과 대략 동일하게 형성될 수 있다. 이를 통해 건조풍 기류의 유동손실이 최소화될 수 있다. 팬 하우징과 히터 하우징을 지지할 수 있도록, 커넥터 본체의 하부에는 베이스를 향해 돌출 형성 되는 제1 레그가 일체로 형성될 수 있다. 일 실시 예에 따르면, 도시된 실시 예를 기준으로, 박스 형상의 커넥터 본체의 상면 및 전면은 적어도 부 분적으로 개방된 상태가 될 수 있다. 커넥터 본체의 적어도 부분적으로 개방된 상면 및 전면은, 히터가 공기통로(C)의 내부에 배치 및 고정 되는 과정에서 히터가 진입할 수 있는 통로를 제공하게 된다. 히터는 히터 하우징 및 커넥터 본체와 분리된 상태로 간접적으로 지지될 수 있다. 히터의 전단 측은 단자 고정부에 의해서 커넥터 본체로부터 분리된 상태로 지지될 수 있다. 단자고정 부의 전면에는 한 쌍의 단자가 외부로 돌출된 상태로 고정될 수 있다. 커넥터본체의 부분 개방된 전면은 단자 고정부의 외형에 대응하여 단자고정부가 슬라이딩 결합하는 U-자 형상의 고정슬롯을 형성할 수 있다. 단자 고정부는, 고정 슬롯의 모서리에 의해서 상하 방향 슬라이딩 이동이 안내되고, 고정슬롯의 모 서리와 결합하는 가이드 홈이 형성될 수 있다. 커넥터 본체의 부분 개방된 상단은 어퍼하우징에 의해서 커버되고 차폐될 수 있다. 일 실시 예에 따르면, 결합면의 하부에는, 커넥터본체의 내부로 진입된 어퍼하우징의 선단부를 하부 방향에서 지지하는 다수의 제2 지지리브가 구비될 수 있다. 전체적으로 개방된 상태가 되는 커넥터 본체의 후단부(871b)는, 히터 하우징과 끼움 결합되면서 고정 될 수 있다. 이 때, 커넥터 본체의 후단부(871b)는 부분적으로 히터 하우징의 내부로 삽입되는 방식으로 끼움 결합 될 수 있다. 면접촉이 형성되는 끼움 결합을 형성하도록, 커넥터 본체의 후단부(871b)에는 도시된 바와 같이, 다수의 제1 지지리브가 구비될 수 있다. 일 실시 예에 따르면, 히터(도 10의 84)는 히터 하우징의 내부에 형성되는 공기통로에 배치되며, 바람직하 게는 공기통로의 내부에서 건조풍 기류(F)에 직접 노출되어 건조풍 기류(F)를 가열하는 역할을 한다. 일 실시 예에 따르면, 건조풍 공급부가 고온 건조풍을 공급하는 경우에는 히터에 전력이 공급되어 건조 풍을 가열하도록 구성되고, 건조풍 공급부가 저온 건조풍을 공급하는 경우에는 히터에 공급되는 전력이 차단되어 히터의 작동이 중단되도록 구성될 수 있다. 이 때, 저온 건조풍을 공급하는 경우에는 건조풍 기류(F)가 생성될 수 있도록 송풍모터의 작동은 유지될 수 있 다. 본 개시의 일 실시 예에 따른 건조풍 공급부에 구비되는 히터의 형식에는 제한이 없으나, 예시적으로 비교적 단순한 구조를 갖고 발열효율이 우수하며, 터브로부터 역으로 유입되는 역유입 세척수에 의한 누전 방지에 유리한 튜브 형상의 시즈히터가 선택될 수 있다. 열교환 효율을 높이기 위해서, 시즈히터가 되는 히터는 히터 하우징 내부의 공기통로에서 건조풍 기류 (F)에 직접 노출되며, 열전달 면적을 최대한 확보하기 위해 다수회 절곡되는 입체적 형상을 갖도록 구성될 수 있다. 히터의 일단부와 타단부는 하우징 커넥터의 커넥터 본체의 전면을 관통하여 연장될 수 있다. 또한, 히터의 일단부와 타단부에는 전력을 공급받기 위한 한 쌍의 단자가 형성될 수 있다. 도시된 바와 같이, 한 쌍의 단자가 단자 고정부(미도시)를 통해 커넥터본체에 설치 및 고정될 수 있다. 이 때, 커넥터본체의 전면에는 단자고정부가 슬라이딩 방식으로 끼움결합될 수 있도록 고정슬롯이 구비될 수 있다 일 실시 예에 따르면, 전술한 바와 같이 히터의 선단 측은 단자 고정부를 통해서 고정되고 지지될 수 있다. 히터의 후단 측은, 도 10에 도시된 바와 같이 히터 하우징의 내부에 배치되는 단일 히터 브라켓을 통해 고정되고 지지될 수 있다. 즉, 히터의 후단 측은 히터 브라켓을 통해 히터 하우징으로부터분리된 상태로 공기통로 상에서 지지될 수 있다. 일 실시 예에 따르면, 히터하우징의 어퍼 하우징의 상부면(8121a)에는 히터를 통해 생성되는 고온 건조풍의 온도를 감지하거나 히터의 과열 여부를 감지하는 온도 감지부로서 온도센서가 구비될 수 있다. 예시적으로 온도센서는, 건조풍의 온도를 감지하는 써미스터와, 히터의 과열 여부를 감지하는 써모스탯 을 포함할 수 있다. 온도센서의 출력신호는 프로세서(도 11의 1160)로 전달될 수 있으며, 프로세서(도 11의 1160)는 온도 센서 의 출력신호를 수신하여 고온 건조풍의 온도 및 과열여부를 판단할 수 있다. 과열 발생시에 프로세서(도 11 의 1160)는 히터에 대한 전력 공급을 차단하여 고온 건조풍 공급 과정에서 저온 건조풍 공급 과정으로 건조 풍 공급부의 작동 과정을 전환할 수 있다. 일 실시 예에 따르면, 히터 하우징은 내측에 전술한 히터 및 히터 브라켓이 배치되는 공기 통로가 형성되도록 내부가 비어있는 공간을 구비하는 중공 형태로 형성될 수 있다. 이 경우, 건조풍 기류(F)가 이동할 수 있도록 건조풍 기류(F)의 이동방향을 기준으로 상류 측에 해당하는 히터 하우징의 전단부와 하류 측에 해당하는 후단부는 적어도 부분적으로 개방될 수 있다. 일 실시 예에 따르면, 건조풍 공급부는, 히터 하우징의 좌측 단부 측에 상부 방향(U-방향)으로 개방되 어 형성되는 배출구에 결합되며 내부에 공기통로가 형성되는 연결 덕트부를 더 포함할 수 있다. 전술한 바와 같이, 히터 하우징과 송풍 팬은 터브의 하면의 아래에 배치될 수 있다. 연결 덕 트부는 히터 하우징으로부터 배출되는 건조풍이 미리 설정된 위치, 예를 들면, 터브에 형성된 건조 풍 공급홀을 향해 이동되도록 안내하는 역할을 할 수 있다. 예시적으로 미리 설정된 위치는 터브의 하면이 될 수 있고, 연결 덕트부로 안내된 건조풍 기류(F) 가 도입되는 건조풍 공급홀은 터브의 하면으로서 후면 및 좌측면에 인접한 코너에 형성될 수 있다. 도시된 실시 예와 같이 연결 덕트부의 덕트 본체는, 건조풍 기류의 방향을 전환하여 터브의 건조 풍 공급홀과 히터 하우징의 배출구를 연결할 수 있는 형상을 갖도록 구성될 수 있다. 예시적으로, 연결 덕트부의 덕트 본체는 하단부가 히터 하우징의 배출구에 유체 연통되고 상단부가 상부 방향(U-방향)으로 연장되어 건조풍 공급홀에 연결되는 실린더 형상으로 구성될 수 있다. 덕트 본체의 하단부는 히터 하우징과 슬라이딩 결합될 수 있도록 구성될 수 있다. 일 실시 예에 따르면, 히터 하우징의 사각형상의 배출구의 단면 형상을 고려하여 덕트 본체의 하단부 는 사각통 형상이 될 수 있으며, 누수방지를 위해 덕트 본체의 상단부는 원통 형상이 될 수 있다. 예를 들면, 덕트 본체의 상단부와 터브의 건조풍 공급홀 사이의 체결의 효율성 및 누수 방지를 위해, 덕트 본체는 원통 형상으로 구성될 수 있다. 덕트 본체의 상단부에는 덕트 본체를 통해 공급되는 건조풍 기류의 방향을 전환하여 세척공간 으로 공급하기 위한 기류 가이드가 에 결합될 수 있다. 필터링부는 송풍 팬으로 흡입될 공기를 여과하여 히터로 공급하는 역할을 수행할 수 있도록, 건조 풍 기류의 유동방향을 기준으로 히터의 상류에 배치될 수 있다. 보다 상세히는 필터링부는, 송풍 팬으로 흡입될 공기를 여과하는 필터와, 내부에 필터가 교 체 가능하게 배치되는 필터 수용공간 및 팬 하우징이 배치되는 팬하우징 수용공간이 형성되는 중공 형태의 필터 하우징을 포함하여 구성될 수 있다. 도 5 내지 도 6에 도시된 바와 같이, 예시적으로 필터 하우징은 예시적으로 상하방향(U-D방향)을 기준으로 분할된 분할체 형태로 배치되는 제1 하우징과 제2 하우징을 포함하여 구성될 수 있다. 이 때, 제1 하우징은 상부 하우징이 될 수 있고 제2 하우징은 하부 하우징이 될 수 있다. 일 실시 예에 따르면, 필터 하우징은 필터와 송풍 팬의 팬하우징을 수용하고 지지하는 기능 을 수행한다. 예를 들면, 제1 하우징은 필터와 팬 하우징을 적어도 부분적으로, 바람직하게는 필터의 상 부 및 팬 하우징의 상부를 수용하고 지지할 수 있도록, 필터 수용부(8811a)와 팬 하우징 수용부(8811b)로 구분될 수 있다. 도시된 바와 같이, 하부 측에 제2 하우징이 결합될 수 있도록 제1 하우징의 필터 수용부(8811a)와 팬하우징 수용부(8811b)는 전체적으로 하면 개방되어 있다. 일 실시 예에 따르면, 필터 수용부(8811a)는 건조풍 기류의 유동방향을 기준으로 팬 하우징 수용부(8811b)보다 는 더 상류 측에, 도시된 실시 예를 기준으로는 팬 하우징 수용부(8811b)의 우측에 형성될 수 있다. 필터 수용부(8811a)는, 예시적으로 실린더 형상으로 구비되는 필터의 교체 시 인입 및 인출 가능하게 수용 될 수 있도록 부분적으로 원통 형상이 되는 외형을 가질 수 있다. 또한, 필터수용부(8811a)의 내부에는 후술하는 제2 하우징의 필터 가이드리브(8812f)와 유사한 형상을 갖 는 필터 가이드리브(8811k)가 일체로 구비될 수 있다. 일 실시 예에 따르면, 필터 수용부(8811a)의 상단에는 필터의 외형에 대응하여 원형 형상으로 개방되는 결 합 개구(8811c)가 형성될 수 있으며, 필터는 결합개구(8811c)를 통과하여 하부 방향으로 이동할 수 있으며, 제2 하우징의 필터 수용부(8812a)까지 이동될 수 있다. 일 실시 예에 따르면, 팬하우징 수용부(8811b)는 건조풍 기류의 유동방향을 기준으로 필터 수용부(8811a)보다는 더 하류 측에, 도시된 실시 예를 기준으로는 필터 수용부(8811a)의 우측에 히터 하우징에 근접하여 필터 수 용부(8811a)에 일체로 형성될 수 있다. 팬하우징 수용부(8811b)는, 송풍 팬의 상부를 전체적으로 커버하도록 팬 하우징의 상부 외형에 대응하 는 내부 형상을 가질 수 있다. 예시적으로 팬 하우징 수용부(8811b)의 상면은 평판 형태로 구비될 수 있다. 다만, 팬하우징 수용부(8811b)의 상면 중앙 측에는 송풍 팬의 전술한 PCB 기판 및 모터의 냉각을 위해서 PCB 기판이 구비되는 팬 하우징의 상면 영역을 적어도 부분적으로 외부로 노출시키기 위한 통기홀 (8811f)이 구비될 수 있다. 통기홀(8811f)이 하부에는 팬 하우징의 상면을 향해 연장되는 중공의 실린 더형 통기덕트(8811g)가 형성될 수 있다. 일 실시 예에 따르면, 팬하우징 수용부(8811b)의 상면에는 일단부가 통기덕트(8811g)의 하단에 연결되고, 타단 부가 제1 하우징의 전면까지 연장되는 슬릿 형태의 배수채널(8811h)이 구비될 수 있다. 이를 통해 통기홀 (8811f)로 유입된 세척수는 배수채널(8811h)을 통해 이동되어 베이스를 향해 배출될 수 있다. 도시된 바와 같이, 제1 하우징의 상면은, 필터 수용부(8811a)의 상단과 팬하우징 수용부(8811b)를 연결하 는 경사면(8811b1)을 구비할 수 있다. 배수 채널(8811h)은 필터 수용부(8811a)의 상단으로부터 누수된 후 경사 면을 타고 통기덕트(8811g)로 유입된 세척수를 배수하는 역할을 하게 된다. 이와 같이 경사면을 타고 이동하는 세척수가 통기 덕트로 유입되는 것을 최소화하기 위한 수단으로서 차단리브 가 제1 하우징의 상면에 일체로 구비될 수 있다. 예시적으로 차단리브는 팬하우징 수용부(8811b)의 상부면에 구 비되는 제1 차단리브(8811i1)와, 경사면(8811b1)에 구비되는 제2 차단리브(8811i2)를 포함할 수 있다. 제1 차단 리브(8811i1)를 선형으로 전후 방향을 따라 연장될 수 있으며, 제2 차단리브(8811i2)는 곡선형으로 전후 방향을 따라 연장될 수 있다. 일 실시 예에 따르면, 제1 하우징의 내부에는 상면으로부터 팬 하우징을 향해 돌출 형성되는 한 쌍의 가이드보스(8811e)가 구비될 수 있다. 각각의 가이드보스(8811e)는, 전술한 하우징 커넥터의 연결탭을 향해 돌출 형성되며, 연결탭에 구비되는 한 쌍의 체결보스에 각각 계합하도록 구성된다. 한편, 제1 하우징의 팬하우징 수용부(8811b)의 좌측면은 부분적으로 개방되어 하우징 커넥터 결합홀 (881a)의 일부를 형성하게 된다. 하우징 커넥터 결합홀(881a)의 나머지 일부는 후술하는 제2 하우징의 팬 하우징 수용부(8812b)의 좌측면에 형성될 수 있다. 일 실시 예에 따르면, 하우징 커넥터 결합홀(881a)을 통과하여, 하우징 커넥터의 커넥터 본체가 적어 도 부분적으로 필터 하우징의 내부로 삽입될 수 있게 된다. 따라서 하우징 커넥터 결합홀(881a)의 형상은 커넥터 본체의 외형에 대응하는 형상을 갖게 된다. 일 실시 예에 따르면, 필터하우징의 제2 하우징은 제1 하우징의 하부에 결합되어 밀폐된 수용 공간을 형성하며, 필터와 팬 하우징의 하부를 수용하고 지지하는 기능을 수행하는 역할을 한다. 제1 하우징과 유사하게, 제2 하우징은 필터의 하부 및 팬 하우징의 하부를 수용하고 지지 할 수 있도록, 필터수용부(8812a)와 팬 하우징 수용부(8812b)로 구분될 수 있다. 도시된 바와 같이, 제1 하우징의 하단에 결합될 수 있도록 제2 하우징의 상단은 전체적으로 개방된 상태가 될 수 있다. 일 실시 예에 따르면, 제1 하우징의 필터 수용부(8811a)에 대응하여, 제1 하우징의 필터 수용부 (8811a)의 하부에 구비되는 제2 하우징의 필터 수용부(8812a)에는 필터의 인입 시에 필터의 이 동을 안내하고 정위치 이탈을 방지하기 위한 복수의 필터 가이드리브(8812f)가 구비될 수 있다. 필터 가이드리브(8812f)는 필터 수용부(8812a)의 바닥면(8812e)으로부터 상부 방향으로 돌출되어 형성되며, 하 단은 필터 수용부(8812a)의 바닥면(8812e)에 일체로 형성될 수 있다. 또한, 실린더 형상을 갖는 필터의 외형에 대응하여 복수의 필터 가이드리브(8812f)는 필터를 중심으 로 방사상으로 배열 및 배치될 수 있다. 일 실시 예에 따르면, 복수의 필터 가이드리브(8812f)의 중심으로서 필터 수용부(8812a)의 바닥면(8812e)에는 베이스의 저면을 향해 개방되며 외부공기가 도입되는 하부 흡기구(8812c)가 관통 형성될 수 있다. 하부 흡기구(8812c)는, 실린더 형상을 갖는 필터의 하부 개구에 대응하여 원형으로 구비될 수 있으며, 하 부개구를 통과하여 필터의 내부로 외부공기가 원활히 도입될 수 있도록 상대적 위치 및 사이즈가 결정될 수 있다. 일 실시 예에 따르면, 제2 하우징의 바닥면(8812e)에는 이와 같이 여과되지 않은 외부공기가 누설되어 필 터 하우징의 내부공간으로 직접 도입되는 것을 방지하기 위한 하나의 기밀수단으로서 한 쌍의 환형 리브가 하부 흡기구(8812c)의 주위에 형성될 수 있다. 일 실시 예에 따르면, 팬 하우징 수용부(8812b)는 건조풍 기류의 유동방향을 기준으로 필터 수용부(8812a)보다 는 더 하류 측에, 도시된 실시 예를 기준으로는 필터 수용부(8812a)의 우측에 히터 하우징에 근접하여 필터 수용부(8812a)에 일체로 형성될 수 있다. 팬 하우징 수용부(8811b)는, 송풍 팬의 하부를 전체적으로 커버하도록 팬 하우징의 하부 외형에 대응 하는 내부 형상을 가질 수 있다. 팬하우징 수용부(8811b)의 바닥면(8812e)은, 여과된 공기가 효과적으로 흡입될 수 있도록 팬 하우징의 하면 으로부터 소정의 간격으로 이격된 상태가 되며, 바람직하게는 수평방향에 나란하게 형성되는 평탄면으로 구성될 수 있다. 팬하우징을 팬 하우징 수용부(8811b)의 바닥면(8812e)으로부터 이격시켜 지지하기 위한 수단으로서, 팬하우 징 수용부(8812b)의 내부에는 바닥면(8812e)으로부터 돌출되는 형태로 구비되는 복수의 융기면부(8812e3) 및 스 크류보스(8812e2)가 구비될 수 있다. 일 실시 예에 따르면, 복수의 융기면부(8812e3)는 제2 하우징의 하부에 배치되는 타구조물을 회피하며, 예를 들면 제2 하우징의 하부에 배치되는 베이스의 리브들 및 누수 감지부를 회피하기 위한 목적을 갖는 다. 따라서 개별 융기면부(8812e3)의 형상은 회피되는 타구조물의 형상에 따라 다르게 구비될 수 있다. 이들 복수의 융기면부(8812e3)는, 팬하우징을 팬 하우징 수용부(8811b)의 바닥면으로부터 이격된 상태로 지 지하는 지지부로서 사용될 수 있다. 따라서 팬하우징의 하면이 개별 융기면부(8812e3)의 상단면에 면 접촉되는 관계가 되도록 송풍 팬이 배치될 수 있다. 나아가 복수의 융기면부(8812e3)는 베이스에 대해서 필터 하우징이 전후방향으로 상대 이동하는 것을 방지하는 스토퍼로서 기능할 수 있다. 스크류보스(8812e2)는, 개별 융기면부(8812e3)와 함께 팬 하우징의 하면을 지지하는 역할을 한다. 또 한, 스크류보스(8812e2)에는 팬 하우징과 하우징 커넥터의 연결탭을 동시에 체결하는 한 쌍의 스 크류 볼트 중 하나가 삽입될 수 있는 볼트홀(8812e1)이 구비될 수 있다. 나머지 하나의 볼트홀(8812e1)은 복수의 융기면부(8812e3) 중 어느 하나에 관통 형성될 수 있다. 분할체 형태로 배치되는 제1 하우징과 제2 하우징은, 제1 하우징의 하단과 제2 하우징(881 2)의 상단은 서로 탈착 가능하게 결합된다. 이와 같은 탈착 가능한 결합관계를 달성하기 위해, 제1 하우징의 하단에는 제2 하우징을 향해 연장 되는 체결탭(8811d)이 구비되고, 제2 하우징의 상단에는 체결탭(8811d)에 후크결합 방식으로 체결되는 후 크 돌기(8812d)가 구비될 수 있다. 한편, 제1 하우징의 필터 수용부(8811a)의 결합개구(8811c)에는 터브 연결덕트가 탈착 가능하게 결 합 및 체결될 수 있다. 본 개시의 일 실시 예에 따른 필터링부의 필터는 터브의 하면을 통해 필터를 교체하도록 구성될 수 있다. 이를 위해, 제1 하우징의 필터 수용부(8811a)는 터브의 하면과 연결될 필요가 있으며, 터브 연결 덕트는 터브의 하면과 제1 하우징의 필터 수용부(8811a)를 상호간 연결하는 역할을 한다. 터브 연결덕트는, 제1 하우징의 필터 수용부(8811a)에 일체로 구비될 수도 있으나, 이하에서는 도시 된 바와 같이 터브 연결덕트가 제1 하우징에 별개로 구비되는 실시 예를 기준으로 설명하도록 한다. 전술한 연결 덕트부의 덕트 본체와 유사하게, 터브 연결덕트의 상단부는 터브의 하면 을 관통하여 상부 방향으로 연장될 수 있다. 도 7 및 도 8에 도시된 바와 같이 터브의 하면에는 터브 연결덕트의 상단부가 삽입될 수 있 도록 필터 교체홀이 구비될 수 있다. 터브의 하면의 중앙 측에는 섬프가 장착되는 섬프홀이 구비될 수 있으며, 터브의 하면 은 세척수가 섬프홀로 효과적을 모일 수 있도록 섬프홀을 향해 진행하면서 점차 하강하는 경사각 을 갖는 수렴면이 형성될 수 있다. 도시된 바와 같이, 필터 교체홀은 섬프홀의 후방 위치로서 수렴면에 형성될 수 있다. 일 실시 예에 따르면, 건조풍 공급홀과 구분하기 위해서, 필터 교체홀은 터브의 하면으로서 후면 및 우측면에 인접한 코너에 형성될 수 있다. 나아가 필터의 교체를 위한 인출 및 인입의 편의를 위해서, 필터교체홀은 건조풍 공급홀보다 터브의 전면에 근접하게 배치될 수 있고, 연수기연통홀보다는 후방에 배치될 수 있다. 일 실시 예에 따르면, 필터 교체홀의 전방에 형성되는 연수기 연통홀은, 예시적으로 하부에 구비되는 연수기(미도시)로의 연수제 투입 등의 목적을 가지나, 급수부의 정수필터(미도시) 등 다른 부품의 교체 및 유지 보수를 위한 용도로서 사용될 수 있다. 일 실시 예에 따르면, 필터교체홀은 전후방향 또는 좌우방향 기준으로 연수기 연통홀과 건조풍 공급 홀 사이에 위치할 수 있다. 즉, 필터교체홀은 연수기 연통홀와 건조풍 공급홀을 연결하는 가상의 연장선상으로부터 벗어난 위치 에 배치될 수 있다. 이를 통해, 터브의 하면에 다수의 개구가 형성되더라도 터브의 강도 저하를 방지하고 비틀림 강성 이나 굽힘 강성에 유리하게 형성될 수 있다. 일 실시 예에 따르면, 필터교체홀의 전방에 형성되는 연수기 연통홀와 구별을 위해서, 필터교체홀 을 통과하여 세척공간에 노출되는 터브 연결덕트의 상단에는 연수제 투입구와 다른 형상 또는 색상을 갖는 밀폐캡이 적용될 수 있다, 터브 연결덕트의 상단부와 터브의 필터 교체홀 사이의 체결의 효율성 및 누수 방지를 위해, 터브연결덕트는 원통 형상으로 구성될 수 있다. 이와 같은 체결의 효율성 및 누수 방지를 위한 수단으로서, 터브 연결덕트의 상단부 측에는 링 형상 의 플랜지와, 수나사부가 구비될 수 있다. 터브 연결덕트의 상단부는 터브의 하면을 관통하여 상부 방향(U-방향)으로 연장되며, 터브 연결덕트의 상단부와 수나사부는 적어도 부분적으로 터브의 하면을 통과하여 터브 의 내부를 향해 돌출될 수 있다. 전술한 바와 같이, 필터 교체홀은 터브의 하면에 구비되는 수렴면에 구비된다. 따라서 필터 교체 홀에 결합되는 터브 연결덕트의 상단부 및 플랜지는 터브의 수렴면의 경사각에 대응 하여 수직방향에 대해서 소정의 경사각을 갖는 상태, 즉 수직방향에 대해서 기울어진 상태로 형성될 수 있다. 터브의 내부를 통과하여 배치되는 수나사부에는 체결너트가 결합될 수 있다. 일 실시 예에 따르면, 터브 연결덕트의 고정 및 체결 시에, 터브의 내부에서 수나사부에 체결너 트를 나사결합시킴으로서 터브 연결덕트의 상단부가 터브의 내부로 노출된 상태로 고정될 수 있다. 플랜지와 터브의 하면 사이에는 체결너트의 풀림방지 및 누수방지를 위한 제1 가 스켓이 더 구비될 수 있다. 체결너트를 통해서 터브 연결덕트가 터브의 하면에 고정되면, 터브의 내부로 노출된 터 브 연결덕트의 상단부에는 밀폐 캡이 결합될 수 있다. 이 때, 밀폐 캡과 터브 연결덕트 의 상단부 사이에는 누수방지를 이한 기밀링이 배치될 수 있다. 한편, 터브연결덕트의 상단부와 하단부 사이로서, 필터수용공간(S1)의 상부에 해당하는 플랜 지의 아래 위치에는 외부공기가 도입되는 상부 흡기구가 관통 형성될 수 있다. 일 실시 예에 따르면, 상부흡기구는 원통 형상을 갖는 터브 연결덕트의 내주면으로부터 외주면을 관 통 형성될 수 있다. 바람직하게는 상부 흡기구는 터브 연결덕트의 원주방향을 따라 배열 및 형성되 는 다수의 관통 개구로서 구비될 수 있다. 따라서 대략 수직방향으로 연장되는 터브 연결덕트의 원주방향을 따라 형성되기 때문에 상부 흡기구(882 6)는 대략 수평방향으로 개방되는 것으로 볼 수 있으며, 상부흡기구로 도입되는 외부공기는 대략 수평방 향에 나란한 방향성을 갖는 기류를 형성하게 된다. 이 때, 터브연결덕트의 강도 저하를 방지하기 위해서 다수의 관통 개구로서 구비되는 상부 흡기구는 상하방향 높이가 원주방향 폭보다는 더 작은 슬릿 형태로 구비될 수 있다. 일 실시 예에 따르면, 상부 흡기구를 구성하는 다수의 관통 개구는, 원주방향을 따라 균일하게 외부공기 가 도입될 수 있도록 각각 동일한 개방면적을 가질 수 있다. 상부 흡기구는, 필터가 필터수용공간(S1)에 배치된 상태를 기준으로 필터의 상부 개구보다는 더 높은 위치에 형성될 수 있다. 따라서 상부 흡기구는 상하방향을 기준으로 터브와 필터의 상 면 사이에 형성되는 것으로 볼 수 있다. 따라서 수평방향에 나란한 방향으로 상부흡기구를 통과한 외부공기는, 필터 부재의 내부로 진입된 후 기류방향이 전환되고, 필터의 외주면을 통과하면서 여과가 진행될 수 있다. 일 실시 예에 따르면, 본 개시에 따른 필터링부는 서로 상하방향을 따라 이격된 위치에 형성되는 하부 흡기 구(8812c)와 상부 흡기구를 포함하는 2개의 흡입경로를 통해 외부공기가 필터로 유입되도록 구성될 수 있다. 이를 통해, 세척대상물의 건조에 필요한 건조풍 기류(F)의 유량이 종래에 비해서 충분히 그리고 효과 적으로 확보될 수 있다. 외부공기의 흡입경로 및 필터를 통과한 건조풍 기류의 유동경로는 도 10을 참조하여 후술한다. 한편, 터브연결덕트의 하단부에는 제1 하우징의 결합 개구(8811c)에 대한 탈착 가능한 체결기 능을 제공하기 위한 체결부가 일체로 구비될 수 있다. 예시적으로 체결부는 후크 결합 방식으로 제 1 하우징의 결합 개구(8811c)에 결합되는 체결수단이 될 수 있다. [여과 전후의 공기의 유동경로] 도 9는 도 7의 평면도이다. 도 10은 도 9를 A-A 방향으로 절단한 단면도이다. 이하 도 9 및 도 10을 참조하여, 본 개시의 일 실시 예에 따른 식기세척기의 필터를 통과하기 전의 외부공기의 유동경로 및 필터를 통과하여 여과된 건조풍 기류(F)의 유동경로를 설명하도록 한다. 본 개시의 일 실시 예에 따른 식기 세척기의 필터 하우징은 서로 상하방향을 따라 이격된 위치에 형 성되며, 베이스와 터브 사이의 공간을 향해 개방되어 있는 복수의 흡기구를 통해 외부공기가 도입되도 록 구성된다. 전술한 바와 같이, 복수의 흡기구는, 필터수용공간(S1)의 상부로서 터브 연결덕트에 구비되는 상부 흡기구 와, 필터 수용공간(S1)의 하부로서 제2 하우징의 바닥면(8812e)에 구비되는 하부 흡기구(8812c)를 포함할 수 있다. 이와 같이 상부 흡기구와 하부 흡기구(8812c)는 터브와 베이스 사이의 공간을 기준으로 필터 하 우징의 가장 높은 위치 및 가장 낮은 위치에 각각 상호간 이격되어 배치된다. 따라서 상호간 흡입되는 공 기유량에 영향이 최소화되는 상태에서 2개의 흡입구를 통해서 외부공기가 도입될 수 있기 때문에 종래에 비해서 세척대상물의 건조에 필요한 충분한 공기유량이 확보될 수 있고, 건조시간의 증가를 방지할 수 있다. 도시된 바와 같이 상부 흡기구는 대략 수평방향에 나란한 방향으로 개방되어 있다. 따라서 상부 흡기구 로 도입되는 외부공기는 수평방향에 나란한 방향을 갖는 공기유동을 형성하게 된다. 일 실시 예에 따르면, 하부흡기구(8812c)는, 수평방향으로 연장되는 바닥면(8812e)에 형성된다. 따라서 하부 흡 기구(8812c)는 수직방향에 나란한 방향으로 베이스를 향해 개방되어 있고, 하부 흡기구(8812c)로 도입되는 외부공기는 수직방향에 나란한 공기유동을 형성하게 된다. 상부 흡기구를 통해 도입된 외부공기는, 필터수용공간(S1)에 배치된 상태를 기준으로 상부 흡기구 의 바로 아래에 위치하게 되는 필터의 상부개구로 진입될 수 있다. 또한, 하부 흡기구(8812c)를 통해 도입된 외부공기는, 필터가 필터 수용공간(S1)에 배치된 상태를 기준으 로 하부 흡기구(8812c)의 바로 위에 위치하게 되는 필터의 하부 개구로 진입될 수 있다. 일 실시 예에 따르면, 필터 부재가 배치된 상태를 기준으로 필터의 상단 측 및 필터의 하단 측 에는 미여과된 공기가 필터 하우징 내부로 도입되는 것을 방지하기 위한 기밀수단이 구비될 수 있다. 이들 기밀수단은, 제1 하우징의 결합 개구(8811c)에 고정되는 제2 가스켓 및 제2 하우징의 하부 흡기구 (8812c) 주위에 구비되는 한 쌍의 환형 리브(8812g)를 포함할 수 있다. 따라서 상부 흡기구와 하부 흡기구(8812c)로 도입된 외부공기는 누설없이 필터의 상부 개구 및 하부 개구로 각각 진입될 수 있다. 일 실시 예에 따르면, 필터수용공간(S1)에 배치된 상태를 기준으로, 필터의 상부 개구는 터브의 하면 을 향해 개방되어 있고, 필터의 하부 개구는 베이스의 저면을 향해 개방되어 있다. 따라서 외부공 기는 상부 개구를 통과하면서 하부 방향으로 기류방향이 전환되고, 하부개구를 통과한 외부공기는 상부 방향으 로 유동하게 된다. 이와 같이, 필터의 내부로 도입된 외부공기는, 필터의 여과재을 통과해 전체적으로 상하방향 및 원주 방향에 걸쳐 균등하게 도입될 수 있다. 일 실시 예에 따르면, 필터의 내주면으로 도입된 외부공기는 여과되어 필터의 외주면을 통과하면서 배출되고, 배출된 즉시 유동방향이 전환된다. 도 10에 도시된 바와 같이 필터의 외주면을 통과한 여과공기는 필터 하우징의 바닥면(8812e)을 향해 개방되어 있는 팬 하우징의 하면을 향하도록 유동방향이 전환될 수 있다. 일 실시 예에 따르면, 팬 하우징의 하면은 필터의 하단과 상단 사이에 바닥면(8812e)으로부터 상 부 방향으로 이격된 위치에 배치된다. 따라서 팬하우징의 하면보다 더 높은 위치에서 필터를 통 과한 공기는 하부 방향으로 팬하우징의 하면을 향해 유동하게 되고, 팬하우징의 하면보다 더 낮은 위치에서 필터를 통과한 공기는 상부 방향으로 팬하우징의 하면을 향해 유동하게 된다. 이와 같은 유동경로를 통해 팬 하우징의 내부로 도입된 여과공기는 팬에 의해서 가속된 후 배기덕트를 거쳐 하우징 커넥터 및 히터하우징의 내부공간으로 도입되면서 건조풍 기류(F)가 형성될 수 있게 된다. 도 11은 본 개시의 일 실시 예에 따른 식기 세척기의 구성도이다. 도 11을 참조하면, 본 개시의 일 실시 예에 따른 식기 세척기는 급수장치, 메모리, 도어자동 개방모듈, 센서부, 스피커, 표시부, 버튼부, 세척장치, 건조풍 공급부, 통신부, 및 프로세서를 포함할 수 있다. 예를 들면, 상기 도어자동개방모듈는 구동 모터를 포함할 수 있고, 상기 센서부는 제1 메인센 서, 제2 메인센서, 및 서브센서를 포함할 수 있다. 그리고, 상기 세척장치는 세척펌프 , 제1 노즐, 및 제2 노즐를 포함할 수 있다. 또한, 상기 건조풍 공급부는 송풍 모터, 히터 , 및 온도 센서를 포함할 수 있다. 이러한 식기 세척기는 도어가 열린 상태에서 식기를 건조하는 행정(예: 도어 열림 건조 과정) 중에 히터 의 온도가 적절하게 유지되도록 히터의 온/오프(ON/OFF)를 제어할 수 있다. 도 11에 도시된 식기 세척기의 구성은 일 실시 예에 따른 것이고, 식기 세척기의 구성 요소들이 도 11에 도시된 실시 예에 한정되는 것은 아니며, 필요에 따라 일부 구성 요소가 부가, 변경 또는 삭제될 수 있다. 일 실시 예에 따르면, 급수 장치는 식기 세척기의 내부로 물을 공급할 수 있다. 상기 급수장치 는 외부수원으로부터 물이 공급되는 급수유로를 형성하는 급수관과, 급수관에 형성되는 급수유로 를 개폐하는 급수밸브(미도시)를 포함할 수 있다. 일 실시 예에 따르면, 메모리는 식기 세척기의 각 행정 별로 운전 조건 및 시간 조건 등에 관한 제 어 신호를 저장할 수 있다. 또한, 메모리는 도어자동개방모듈, 표시부, 세척장치, 센서부 , 스피커, 통신부, 및 건조풍 공급부 등의 작동을 제어하기 위한 제어신호를 저장할 수 있다. 일 실시 예에 따르면, 메모리는 식기 세척기의 각 행정(또는 동작 과정)(예: 세척 과정, 헹굼 과정, 추가 헹굼 과정, 가열 헹굼 과정, 및 건조 과정 등)에 대한 적어도 하나의 명령어를 저장할 수 있다. 상기 메모 리는 이러한 각 행정(또는 동작 과정)에 기반하여 식기 세척기가 동작되도록 하는 다양한 프로그램 들을 저장할 수 있다. 일 실시 예에 따르면, 상기 메모리는 식기 세척기의 동작에 필요한 정보, 데이터, 프로그램 등이 저 장될 수 있다. 구체적으로, 메모리에는 식기 세척기의 행정(예: 세척 과정, 헹굼 과정, 추가 헹굼 과정, 가열 헹굼 과정, 및 건조 과정 등)에 관한 정보가 미리 저장될 수 있다. 상기 정보는 각 행정에 따른 운 전 시간에 대한 정보를 포함할 수 있다. 또한, 상기 정보는 각 행정에 따른 동작 순서에 대한 정보를 포함할 수 있다. 일 실시 예에 따르면, 상기 건조 과정은 열풍을 공급하여 식기를 건조하는 열풍 건조, 도어를 오픈한 후 열풍을 공급하여 식기를 건조하는 도어 열림 열풍 건조, 도어를 오픈하여 식기를 건조하는 도어 오픈 건조, 및 응축 건 조를 포함할 수 있다. 그리고, 상기 메모리는 이러한 열풍 건조, 도어 열림 열풍 건조, 도어 오픈 건조, 및 응축 건조에 필요한 정보, 데이터 및 명령어들을 저장하고 있다. 일 실시 예에 따르면, 상기 메모리는 식기 세척기의 동작을 제어하는 명령어들이 실행되도록 구성되 는 프로그램을 저장할 수 있다. 예를 들면, 상기 프로그램은 식기 세척기의 행정이 도어 열림 건조 과정으로 진입되는지 식별하는 명령어 들, 및 상기 도어 열림 건조 과정으로 진입되는 것으로 식별되면, 도어를 개방하고 히터를 동작시키는 명령 어들을 포함할 수 있다. 또한, 상기 프로그램은 식기 세척기가 상기 도어 열림 건조 과정으로 진입한 후, 송풍 팬의 동작에 기반하여, 상기 송풍 팬이 동작하는 동작 시간을 누적하는 명령어들을 포함할 수 있다. 또한, 상기 프로그램은 상기 송풍 팬의 동작에 기반하여 누적된 총 동작 시간과 미리 결정된 제1 시간(예: 1507 시간)을 비교하여 상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이상인 경우, 상기 필터 의 교체에 대한 알림을 상기 표시부 및 상기 스피커 중 적어도 하나를 통해 출력하는 명령어들 을 포함할 수 있다. 또한, 상기 프로그램은 상기 필터가 교체되는 것으로 식별되면, 상기 메모리에 누적된 총 동작 시간 을 초기화하고, 상기 표시부에 표시된 상기 알림을 해제하는 명령어들을 포함할 수 있다. 또한, 상기 프로그램은 상기 송풍 팬의 동작에 기반하여, 상기 송풍 팬이 동작하는 횟수를 상기 메모 리에 누적하고, 상기 누적된 횟수와 미리 결정된 횟수(예: 274회)를 비교하여 상기 누적된 횟수가 상기 미리 결정된 횟수 보다 이상인 경우, 상기 필터의 교체에 대한 알림을 상기 표시부 및 상기 스피커 중 적어도 하나를 통해 출력하는 명령어들을 포함할 수 있다.또한, 상기 프로그램은 상기 필터의 교체에 대한 정보를 상기 통신부를 통해 적어도 하나의 휴대 단 말(미도시)(예: 식기 세척기를 사용하는 사용자의 휴대 단말)로 전송할 수 있다. 또한, 상기 프로그램은 상기 필터의 교체에 대한 식별, 및 상기 적어도 하나의 휴대 단말로부터 상기 필터 의 교체에 대한 알림 해제를 나타내는 신호의 수신 중 적어도 하나가 식별되면, 상기 표시부에 표시된 상기 알림을 해제할 수 있다. 이외에도, 상기 프로그램은 프로세서에 의해 식기 세척기의 동작을 전반적으로 제어하는 명령어들을 포함 할 수 있다. 일 실시 예에 따르면, 상기 도어자동개방모듈은 프로세서로부터 도어의 개방을 위한 제어신호가 수신되면, 전기적으로 구동되어 도어를 회전식으로 개방시킬 수 있다. 이를 위해, 도어자동개방모듈은, 회전 구동력을 생성하는 구동 모터와, 구동 모터의 회전 구동 력을 감속하고 회전 구동력을 직선왕복 구동력으로 변환하는 감속 기어부와, 직선왕복 구동력에 의해서 전후 방 향으로 직선 왕복 운동하는 푸쉬로드를 포함할 수 있다. 일 실시 예에 따르면, 상기 센서부는 도어의 열림 또는 닫힘을 감지할 수 있는 제1 메인센서, 제2 메인센서, 및 서브 센서를 포함할 수 있다. 상기 센서부는 예를 들면, 상기 제1 센서 및 상기 제2 센서는 도어의 상면과 맞닿은 식기 세척기의 본체의 접합부에 배치될 수 있다. 예를 들면, 제1 메인센서 및 제2 메인센서는, 도어가 닫힘위치에 있을 때 온(ON) 신호를 생성 하고 출력하고, 도어가 닫힘 위치를 이탈했을 때 오프(OFF) 신호를 생성하여 출력하는 마이크로 스위치를 포함할 수 있다. 이를 위해, 마이크로스위치에는 도어가 닫힘 위치에 있을 때 눌림 상태가 유지되고, 도어가 닫힘 위치 를 이탈했을 때 눌림 상태가 해제되는 푸쉬 버튼을 구비할 수 있다. 마이크로스위치의 내부에는 푸쉬 버튼의 눌 림 여부를 감지하여 온(ON) 신호 또는 오프(OFF) 신호를 포함하는 전기적 출력신호를 생성하는 전기적 회로가 구비될 수 있다. 예를 들면, 제1 메인센서와 제2 메인센서 중에서 어느 하나에 대한 기능 고장이 발생한 경우, 또는 도어가 불완전하게 개방되는 경우와 같은 상황에서도, 프로세서는 이러한 제1 메인센서와 제2 메인센서 중에서 어느 하나를 통해 정확하게 도어의 닫힘 상태 또는 개방상태를 식별할 수 있다. 일 실시 예에 따르면, 상기 서브 센서는 도어가 강제 열림 감지위치에 도달하는지 여부를 감지할 수 있다. 예를 들면, 상기 서브 센서는 도어의 위치가 닫힘 위치와 강제 열림 감지위치 사이가 되는 경우에는 온(ON) 신호를 출력하고, 도어의 위치가 강제 열림 감지위치에 도달하면 오프(OFF) 신호를 출력하는 마이크 로 스위치를 포함할 수 있다. 다만, 직접적으로 도어에 접촉하여 도어의 위치를 검출하는 제1 메인센서와 제2 메인센서 와는 다르게 서브센서는 간접적으로 도어의 위치를 검출하도록 구성될 수 있다. 일 실시 예에 따르면, 상기 버튼부는 사용자의 선택 조작이 입력되는 선택버튼 및 식기세척기의 전을 온/오 프(ON/OFF)하기 위한 사용자의 조작이 입력되는 전원버튼 등을 포함할 수 있다. 상기 버튼부는 전원버튼 및 선택버튼 등을 포함할 수 있다. 버튼부를 통해서 프로세서는 사용자의 제어명령 신호(예: 전원 온 (ON) 신호, 전원 오프(OFF) 신호), 및 행정선택 신호 등을 수신할 수 있다. 일 실시 예에 따르면, 상기 스피커는 식기 세척기의 작동 상태, 필터 교체, 필터 교체 완료, 송풍 팬의 동작 횟수가 미리 결정된 횟수를 초과한 경우, 식기 세척기의 작동 시간 및 세척 완료 여부 등 에 관한 알람을 음성 또는 음향으로 출력할 수 있다. 상기 스피커를 통해 출력되는 알람은 사용자가 도어 를 강제로 열거나 또는 닫은 경우에 따른 알람을 출력할 수 있다. 일 실시 예에 따르면, 상기 스피커는 행정의 각 과정, 센서(예: 제1 메인센서, 제2 메인 센서 , 서브 센서, 온도 센서)의 활성 또는 비활성, 상기 행정의 일시 정지, 상기 행정의 시작 또는 재시작, 및 도어의 열림 또는 닫힘 각각에 대해 서로 다른 사운드를 출력할 수 있다.또한, 상기 스피커는 프로세서에 의해 필터 교체 관한 알림을 출력할 수 있다. 또한, 상기 스피커는 프로세서에 의해 식기 세척기의 다양한 동작에 관한 서로 다른 알람을 출력할 수 있다. 일 실시 예에 따르면, 상기 세척장치는 세척펌프를 통해 세척수를 제1 노즐 및 제2 노즐로 공급하여 세척수가 제1 노즐 및 제2 노즐을 통해 분사시킬 수 있다. 또는, 상기 세척장치는 식기세척기 내부에 존재하는 물을 외부로 배수할 수 있다. 상기 세척장치 는 섬프에 저장된 물을 외부로 유도하는 배수유로가 형성된 배수관을 포함할 수 있다. 또한, 상 기 세척장치는 상기 배수관에 형성된 배수유로 상에 배치되어 섬프 내의 세척수를 배수모터(미도 시)를 통해 외부로 배수하는 배수펌프를 포함할 수 있다. 일 실시 예에 따르면, 상기 건조풍 공급부는 송풍 모터, 히터, 필터, 송풍 팬, 및 온도 센서와 전기적으로 연결되어 있다. 예를 들면, 도어가 적어도 부분적으로 개방되면, 프로세서는 송풍 모터와 히터에 동시에 전력을 공급하여 고온의 열풍을 공급하거나, 히터에 대한 전력공급은 차단하고 송풍 모터만 작동시켜 저온의 건조풍을 공급할 수 있다. 프로세서는 고온 건조풍이 공급되 는 과정에서 적정 온도의 건조풍이 공급되고 있는지 여부 및 과열이 발생하는지 여부를 온도 센서의 출력 신호(예: 히터의 온도를 감지한 신호)를 통해 식별할 수 있다. 일 실시 예에 따르면, 상기 표시부는 표시 패널, 발광 소자 및 터치 감지 센서를 포함할 수 있다. 상기 발 광 소자는 터치 감지 센서의 주변에 배치될 수 있다. 또한, 상기 표시부는 송풍 팬의 동작에 기반하여 필터(예: 에어 필터)의 교체 관련한 알림을 표시할 수 있다. 상기 표시 패널은 식기 세척기의 동작 전반에 관한 다양한 정보를 표시할 수 있다. 그리고, 상기 발광 소 자는 일시 정지의 사용 가능 또는 사용 불가능에 대한 정보를 출력할 수 있다. 그리고, 상기 터치 감지 센서는 식기 세척기의 행정을 일시적으로 정지시키기 위한 입력을 감지할 수 있다. 일 실시 예에 따르면, 상기 통신부는 식기 세척기에 포함된 적어도 하나의 구성 요소와 유선 통신 또는 무선 통신을 수행할 수 있다. 상기 통신부는 홈 내의 공유기(미도시), 서버(서버)와 적어도 하나의 신호 또는 정보를 네트워크(미도시)를 통해 송수신할 수 있는 적어도 하나의 회로를 포함할 수 있다. 또한, 상기 통신부는 근거리 통신(예: 블루투스(Bluetooth), NFC(Near Field Communication), 또는 비콘 (Beacon))에 기반하여 홈 내의 적어도 하나의 다른 가전 장치와 통신할 수 있다. 또는, 상기 통신부는 네 트워크(미도시)를 통해, 휴대 단말(미도시) 또는 서버(미도시)와 유선 통신 또는 무선 통신을 수행할 수 있다. 또한, 상기 통신부는 휴대 단말(미도시)과 신호 또는 데이터를 송수신할 수 있다. 휴대 단말(미도시)과의 신호 또는 데이터의 송수신에 기반하여, 식기 세척기는 휴대 단말(미도시)의 어플리케이션을 통해 제어되 거나, 또는 식기 세척기에 대한 정보를 휴대 단말(미도시) 또는 서버(미도시)로 전송할 수 있고, 휴대 단 말(미도시) 또는 서버(미도시)로부터 제어 신호를 수신할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 메모리로부터 수신된 명령 또는 데이터를 메모리에 로드하여 처리하고, 처리된 데이터를 메모리에 저장할 수 있다. 또는, 상기 프로세서는 상기 처리 된 데이터를 표시부를 통해 표시할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 인공지능 알고리즘이 내장될 수 있다. 또는, 상기 인공지능에 대 한 알고리즘은 상기 프로세서에 의해 구현될 수 있다. 상기 인공지능은 인간의 뇌 신경망을 모방한 프로 그램으로서 다양한 데이터를 스스로 분석, 인지, 추론, 판단하는 딥러닝 알고리즘을 지원할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기의 행정을 시작하기 위한 입력이 감지되면, 식기 세척기의 고내에 존재하는 식기를 세척하기 위한 예약 동작을 시작할 수 있다. 상기 예약 동작은 식기 세 척기를 동작시키기 위한 전처리 과정과 세척수를 가열시키는 과정을 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기의 행정이 건조 과정(예: 도어 열림 건조 과정) 으로 진입되면, 송풍 모터를 온(ON) 시키고, 상기 송풍 모터의 온(ON)에 기반하여, 송풍 팬은 회 전하기 시작한다. 일 실시 예에 따르면, 상기 프로세서는 상기 식기 세척기가 건조 과정을 시작함에 따른 송풍 팬 의 동작에 기반하여, 상기 송풍 팬이 동작하는 동작 시간(예: 건조 과정 당 동작 시간)을 메모리 에 누적할 수 있다. 예를 들면, 상기 프로세서는 송풍 팬의 동작이 시작되면, 타이머를 구동하고, 상기 송풍 팬 의 동작이 종료되면, 상기 구동된 타이머를 통해 상기 송풍 팬이 동작한(예: 회전한) 동작 시 간을 계산할 수 있다. 그리고, 상기 프로세서는 상기 계산된 동작 시간을 상기 메모리에 저장된 총 동작 시간(예: 이전에 수행된 건조 과정에 따른 송풍 팬의 총 동작 시간)에 합산하고, 상기 합산된 동작 시간을 상기 메모리에 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬의 동작에 기반하여 누적된 총 동작 시간과 미리 결 정된 제1 시간(예: 1507 시간)을 비교하여 상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간(예: 1507 시 간) 보다 이상인 경우, 필터의 교체에 대한 알림을 표시부를 통해 출력(예: 표시)할 수 있다. 또는, 상기 프로세서는 상기 누적된 총 동작 시간이 상기 미리 결정된 시간(예: 1507 시간) 시간 보다 이 상이 아닌 경우, 상기 알림을 오프(OFF)로 유지하거나, 또는 알림을 표시하지 않을 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 필터의 교체에 대한 알림을 스피커를 통해 출력할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간(예: 1507 시간) 보다 이상인 경우, 표시부를 통해 알림을 온/오프(ON/OFF)로 반복적으로 출력할 수 있다. 예를 들면, 상기 프로세서는 알림이 표시부 상에 표시되고, 일정 시간(예: 수 ms) 이후 알림이 해제 (예: 미표시)해제되는 과정이 반복적으로 수행되도록 표시부를 제어할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 알림이 온/오프(ON/OFF)로 반복적으로 출력되는 시간이 미리 결정된 제2 시간(예: 24시간) 보다 이상인 경우, 상기 알림을 온/오프(ON/OFF)로 반복적으로 출력하면서 상기 스피커를 통해 상기 필터의 교체에 대한 알림을 음성으로 출력할 수 있다. 이와 같이, 상기 프로세서는 상기 알림을 표시부를 통해 표시하는 기능과 상기 스피커를 통해 출력하는 기능을 동시에 수행하거나, 또는 동시에 수행하지 않을 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이 상인 경우, 상기 필터의 교체에 대한 정보를 상기 통신부를 통해 적어도 하나의 휴대 단말로 전송할 수 있다. 이러한 정보는 홈 내의 공유기(미도시)를 통해 서버(미도시)로 전송되고, 서버(미도시)는 이러한 정보 를 수신하여 상기 휴대 단말로 전송할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 누적된 총 동작 시간의 크기에 따라 서로 다른 내용의 필터 교체 메시지를 포함하는 정보를 생성할 수 있다. 예를 들면, 상기 정보는 누적된 총 동작 시간이 상기 미리 결정된 제1 시간의 77%인 경우, 필터 교체 메시지(예: OO님 필터를 교체할 때입니다. 새 필터를 준비해주세요)를 포함할 수 있다. 예를 들면, 상기 정보는 누적된 총 동작 시간이 상기 미리 결정된 제1 시간 보다 이상인 경우, 필터 교체 메시 지(예: OO님 필터를 교체해주세요)를 포함할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 필터가 교체되는 것으로 식별되면, 상기 메모리 에 누적된 송풍 팬의 총 동작 시간을 초기화하고, 상기 표시부에 표시된 알림을 해제할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터의 교체가 식별되거나, 또는 사용자가 송풍 팬의 동작 시간을 초기화하는 것이 식별되면, 메모리에 누적된 송풍 팬의 총 동작 시간을 0으로 초기화할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 건조풍 공급부에 기반하여, 식기 세척기가 현재 건 조 과정을 수행하고 있는 것으로 식별되면, 상기 건조 과정이 수행되고 있는 동안 표시부를 통해 알림을 온 (ON)으로 출력할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기가 현재 건조 과정을 수행하고 있지 않은 것으로 식별되고, 상기 송풍 팬의 총 동작 시간이 미리 결정된 제1 시간(예: 1507시간) 보다 이상인 경우, 표시부를 통해 알림을 온/오프(ON/OFF)로 반복적으로 출력할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 누적된 총 동작 시간이 미리 결정된 제1 시간(예: 1507 시간) 보 다 이상인 상태에서, 식기 세척기가 현재 송풍 팬의 동작에 기반한 건조 과정을 수행하는 경우, 또는 상기 식기 세척기가 상기 송풍 팬의 동작에 기반하지 않는 행정 과정을 수행하는 경우에 따라 알림이 서로 다르게 출력되도록 상기 표시부를 제어할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기가 송풍 팬의 동작에 기반한 건조 과정을 수행한 횟수를 카운팅하고, 상기 카운팅한 횟수가 미리 결정된 횟수(예: 274회) 보다 이상인 경우, 필터의 교체에 대한 알림을 상기 표시부를 통해 출력할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터의 교체에 대한 정보를 상기 통신부를 통해 적어 도 하나의 휴대 단말로 전송할 수 있다. 상기 프로세서는 필터가 교체될 필요성이 식별되면, 필터 교체에 대한 정보(예: 필터 교체 알림 메시지, 필터 구매 사이트, 필터 가격 정보 등)를 식기 세척기를 사 용하는 사용자에게 전송할 수 있다. 이를 위해, 상기 메모리는 식기 세척기를 사용 또는 관리하는 사용자의 휴대 전화 번호를 저장할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터의 교체에 대한 식별, 및 적어도 하나의 휴대 단말로부 터 상기 필터의 교체에 대한 알림 해제를 나타내는 신호의 수신 중 적어도 하나가 식별되면, 상기 표시부 에 표시된 알림을 해제(예: OFF)시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 상기 필터를 사용하여 누적된 횟수가 증가할수록 알림이 점 차 레드(RED) 색으로 표시되도록 상기 표시부를 제어할 수 있다. 예를 들면, 상기 프로세서는 누적된 횟수가 100회 이상이면 알림을 노란색으로 표시하고, 누적된 횟수가 200회 이상이면 알림을 주황색으로 표시하고, 누적된 횟수가 272회 이상이면 알림을 빨간색으로 표시할 수 있다. 도 12는 본 개시의 일 실시 예에 따른 식기 세척기가 필터의 교체에 대한 알림을 제공하는 과정을 나타낸 순서 도이다. 도 13은 본 개시의 일 실시 예에 따른 식기 세척기의 표시부에 알림을 표시한 예시도이다. 이하 도 12 및 도 13을 참조하여, 본 개시의 일 실시 예에 따른 식기 세척기가 필터의 교체에 대한 알림을 제공 하는 과정을 상세히 설명하면 다음과 같다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작하는지 식별할 수 있다(S1210). 상기 프로세서 는 버튼부를 통해 식기 세척기의 동작을 온(ON) 시키는 명령이 입력되면, 기 설정된 행적(또는 동작 과정)(예: 세척 과정, 헹굼 과정, 추가 헹굼 과정, 가열 헹굼 과정, 및 건조 과정 등)에 따른 로직에 기반 하여 식기 세척기를 동작시킬 수 있다. 이러한 행정에서 건조 과정은 열풍을 공급하여 식기를 건조하는 열풍 건조, 도어를 오픈한 후 열풍을 공급하여 식기를 건조하는 도어 열림 열풍 건조, 도어를 오픈하여 식기를 건조하는 도어 오픈 건조, 및 응축 건조를 포함 할 수 있다. 상기 프로세서는 이러한 다양한 건조 과정들 중에서 송풍 팬의 동작이 필요하다고 판단되는 적어도 하나의 건조 과정을 식별할 수 있다. 이후, 상기 프로세서는 송풍 모터를 동작시킴으로써, 송풍 팬 을 회전시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 부하 상태의 검사가 완료되면 송풍 모터를 온(ON) 시키고, 송 풍 모터가 정상적으로 동작하는지 또는 동작하지 않는지를 식별하는 과정을 수행할 수 있다. 예를 들면, 상기 프로세서는 송풍 팬의 동작을 감지하는 센서(예: 홀 센서)를 통해 송풍 팬이 회전하는지 또는 회전하지 않는지를 식별하여 송풍 팬이 회전하는 경우, 송풍 모터와 송풍 팬이 정상적으로 동작하는 것으로 판단할 수 있다. 만일, 미리 결정된 횟수(예: 3회) 이상으로 송풍 팬이 회전하지 않는 것으로 판단되면, 상기 프로세서 는 송풍 모터의 동작이 실패한 것으로 판단할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작하는 동작 시간을 계산하여 누적할 수 있다 (S1212). 송풍 팬이 회전하는 경우, 상기 프로세서는 송풍 팬이 동작하는 시간을 타이머를 통해 계산할 수 있다. 또는, 상기 프로세서는 송풍 모터에 동력이 제공되는 시간을 통해서 송풍 팬이 동작하는 시간을 추정할 수 있다. 그리고, 상기 프로세서는 송풍 팬이 동작하는 시간을 메모리에 누적할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작한 총 누적 시간이 미리 결정된 제1 시간 보다 이 상인지 식별할 수 있다(S1214). 상기 프로세서는 송풍 팬이 동작하는 경우마다 동작 시간을 누적하 고, 누적된 시간(즉, 송풍 팬이 동작한 총 시간)이 미리 결정된 제1 시간(예: 1507 시간) 보다 이상인지를 식별하기 위해, 상기 누적된 시간과 상기 미리 결정된 제1 시간의 크기를 비교할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터 교체에 대한 알림을 오프(OFF)로 유지할 수 있다(S1216). 상 기 프로세서는 상기 누적된 시간이 상기 미리 결정된 제1 시간(예: 1507 시간) 보다 이상이 아니면, 아직 필터를 교체해야 할 시간이 아닌 것으로 판단하고, 필터 교체에 대한 알림을 오프(OFF)로 유지할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터 교체에 대한 알림이 온(ON)으로 유지되고 있는 상태에서, 필 터가 교체되는 경우 필터 교체에 대한 알림이 오프(OFF)로 전환할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터 교체에 대한 알림을 온(ON)할 수 있다(S1218). 상기 프로세 서는 식기 세척기가 현재 건조 과정을 수행하고 있고, 상기 누적된 시간이 상기 미리 결정된 제1 시 간(예: 1507 시간) 보다 이상이면, 필터를 교체해야 하는 것으로 판단하고, 표시부 상에 필터 교체에 대한 알림을 온(ON)할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기가 현재 건조 과정을 수행하고 있지 않고(즉, 건 조 과정이 아닌 다른 과정을 수행하고 있는 경우, 또는 동작하고 있지 않는 경우), 누적된 총 동작 시간이 미리 결정된 제1 시간 보다 이상인 경우, 표시부를 통해 알림을 온/오프(ON/OFF)로 반복적으로 출력시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기가 현재 건조 과정을 수행하고 있는 것으로 식별 되면, 상기 건조 과정이 수행되고 있는 동안 표시부를 통해 알림을 온(ON)으로 출력할 수 있다. 또는, 상기 프로세서는 식기 세척기가 현재 건조 과정을 수행하고 있지 않은 것으로 식별되고, 누적 된 총 동작 시간이 미리 결정된 제1 시간 보다 이상인 경우, 표시부를 통해 상기 알림을 온/오프(ON/OFF)로 반복적으로 출력할 수 있다. 그리고, 상기 프로세서는 필터 교체에 대한 알림을 통신부를 통해 휴대 단말(미도시)에 설치된 어 플리케이션(예: LG ThinQ 어플리케이션)으로 전송할 수 있다. 도 13을 참조하면, 프로세서는 필터 교체에 대한 알림을 표시부 상에 표시할 수 있다. 상기 표 시부는 좌측 하부(또는 다른 부분)에 필터를 교체해야 함을 나타내는 알림을 표시할 수 있다. 상기 알림은 식기 세척기가 현재 건조 과정을 수행 중이고 필터 교체가 필요한 경우에 표시(제1 표 시)될 수 있다. 또는, 상기 알림은 식기 세척기가 현재 건조 과정을 수행 중이 아니고 필터 교체가 필요한 경우에도 표시(제2 표시)될 수 있다. 예를 들면, 상기 제1 표시는 상기 알림이 계속 온(ON) 상태를 유지하는 것이고, 상기 제2 표시는 상기 알 림이 온(ON)과 오프(OFF)를 반복하여 표시하는 것이다. 따라서, 상기 알림은 필터 교체 알림 표시 부 또는 건조 팬 동작 알림 표시부가 될 수 있다. 그리고, 이러한 알림은 4각형의 타입이고, 각 변의 중 심이 분리되어 있으며, 4각형 내에는 물결 표시가 포함될 수 있다. 본 개시에서는 알림을 도 13과 같이 표시하였으나, 이는 단지 실시 예일 뿐, 다른 형태 또는 타입의 알림을 포 함할 수 있다. 또한, 상기 표시부는 식기 세척기의 동작 시간을 나타내는 시간 표시부, 통신망(예: 와이파이) 과 연결되어 있음을 나타내는 통신 표시부, 및 식기 세척기 내의 소금 잔량을 표시하는 소금 보충 알림 표시부를 표시할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 누적된 총 동작 시간이 미리 결정된 제1 시간 보다 이상인 경우, 필터의 교체에 대한 알림을 스피커를 통해 출력할 수 있다. 또는, 상기 프로세서는 누적된 총 동작시간이 미리 결정된 제1 시간 보다 이상이고, 일정 시간(예: 24시간)이 경과된 후, 필터의 교체에 대한 알림을 스피커를 통해 출력할 수 있다. 예를 들면, 상기 알림은 음성 메시지(예: 필터를 교체해주세요)일 수 있 다. 일 실시 예에 따르면, 상기 프로세서는 필터가 교체되는지 식별할 수 있다(S1220). 상기 프로세서 는 기존 필터가 탈착되고, 새로운 필터가 부착되는지를 센서를 통해 판단함으로써, 필터의 교체를 식별할 수 있 다. 또는, 상기 프로세서는 필터가 교체된 이후, 사용자가 기존 필터의 사용에 대한 누적 시간을 초기화함으 로써, 필터의 교체를 식별할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 기 저장된 송풍 팬에 대한 누적된 총 시간을 초기화할 수 있다 (S1222). 상기 프로세서는 기존 필터가 탈착되고 새로운 필터가 부착되는 것으로 판단되면, 메모리(112 0)에 저장된 송풍 팬에 대한 동작 시간을 초기화할 수 있다. 또는, 상기 프로세서는 사용자가 기존 필터의 사용에 대한 누적 시간을 초기화기 위한 명령이 입력되는 것으로 판단되면, 메모리에 저장된 송풍 팬에 대한 동작 시간을 초기화할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터 교체에 대한 알림을 오프(OFF) 할 수 있다(S1224). 상기 프 로세서는 기존 필터가 탈착되고 새로운 필터가 부착되면, 표시부에 표시된 필터 교체에 대한 알림을 오프(OFF) 또는 해제할 수 있다. 또는, 상기 프로세서는 사용자가 기존 필터의 사용에 대한 누적 시간을 초기화기 위한 명령이 입력되는 것으로 판단되면, 표시부에 표시된 필터 교체에 대한 알림을 오프(OFF) 또 는 해제할 수 있다. 도 14는 본 개시의 일 실시 예에 따른 송풍 팬의 동작에 따른 동작 시간을 누적하는 과정을 나타낸 순서도이다. 이하, 도 14를 참조하여, 본 개시의 일 실시 예에 따른 송풍 팬의 동작에 따른 동작 시간을 누적하는 과정을 상 세히 설명하면 다음과 같다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작하는지 식별할 수 있다(S1410). 상기 프로세서 는 버튼부를 통해 식기 세척기의 동작을 온(ON) 시키는 명령이 입력되면, 기 설정된 행적에 따 른 로직에 기반하여 식기 세척기를 동작시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 건조 과정들 중에서 송풍 팬의 동작이 필요하다고 판단되는 건조 과정(예: 도어 열림 건조 과정)을 식별할 수 있다. 이후, 상기 프로세서는 송풍 모터를 동작시 킴으로써, 송풍 팬을 회전시킬 수 있다. 상기 프로세서는 송풍 팬의 동작이 필요하다고 판단되면, 송풍 모터에 전압을 인가하여 송풍 팬 을 회전시킬 수 있다. 그리고, 상기 프로세서는 송풍 팬의 회전에 기반하여, 송풍 팬이 동작하는 것으로 식별할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 타이머를 구동시킬 수 있다(S1412). 상기 프로세서는 송풍 팬이 회전하는 것으로 식별되면(또는 송풍 모터가 고장이 아닌 것으로 판단되면), 타이머를 구 동시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬의 동작이 종료되는지 식별할 수 있다(S1414). 상기 프로 세서는 건조 과정(예: 도어 열림 건조 과정)이 종료되면, 송풍 모터로 인가되는 전압을 차단하여, 송 풍 팬의 동작을 종료시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬의 동작 시간을 계산할 수 있다(S1416). 상기 프로세서 는 건조 과정(예: 도어 열림 건조 과정)이 수행됨에 따른 송풍 팬의 동작 시간을 타이머를 통해 계 산할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작한 누적된 총 시간을 획득할 수 있다(S1418). 상기 프로세서는 이전에 송풍 팬이 이전에 동작하여 누적된 동작 시간(즉, 필터가 장착된 이후 송풍 팬의 동작 시간))을 메모리로부터 획득할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 획득된 총 시간과 계산된 동작 시간을 합산할 수 있다(S1420). 상 기 프로세서는 상기 과정들(S1412 내지 S1416)에서 계산된 동작 시간과 상기 과정(S1418)에서 획득한 총 시간을 합산할 수 있다. 예를 들면, 상기 프로세서는 과거의 송풍 팬의 동작에 따른 누적 시간과 현재(S1410)의 동작 시간을 합산할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 합산된 동작 시간을 저장할 수 있다(S1422). 상기 프로세서(116 0)는 상기 과정들(S1412 내지 S1416)에서 계산된 동작 시간과 상기 과정(S1418)에서 획득한 총 시간을 합산하여 메모리에 저장할 수 있다. 도 15는 본 개시의 일 실시 예에 따른 식기 세척기가 필터의 교체에 대한 알림을 제공하는 과정을 나타낸 순서 도이다. 이하 도 15를 참조하여, 본 개시의 일 실시 예에 따른 식기 세척기가 필터의 교체에 대한 알림을 제공하는 과정 을 상세히 설명하면 다음과 같다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작하는지 식별할 수 있다(S1510). 상기 프로세서 는 버튼부를 통해 식기 세척기의 동작을 온(ON) 시키는 명령이 입력되면, 기 설정된 행적에 따 른 로직에 기반하여 식기 세척기를 동작시킬 수 있다. 또는, 상기 프로세서는 건조 과정들 중에서 송풍 팬의 동작이 필요하다고 판단되는 건조 과정(예: 도어 열림 건조 과정)이 식별되면, 송풍 모터를 동작시킴으로써, 송풍 팬을 회전시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 건조 과정을 시작할 수 있다(S1512). 상기 프로세서는 기 설정된 행적에 따른 로직에 기반하여 식기 세척기를 동작시키고, 건조 과정이 시작되는지를 판단할 수 있 다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬의 동작이 종료되는지 식별할 수 있다(S1514). 상기 프로 세서는 건조 과정(예: 도어 열림 건조 과정)이 종료되면, 송풍 모터로 인가되는 전압을 차단하여, 송 풍 팬의 동작을 종료시킬 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작하여 누적된 횟수를 획득할 수 있다(S1516). 상기 프로세서는 송풍 팬의 동작이 종료되면, 송풍 팬의 동작에 따른 횟수를 1로 카운팅할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 획득된 총 횟수에 1을 합산할 수 있다(S1518). 상기 프로세서 는 송풍 팬이 동작하여 누적된 횟수에 상기 과정(S1516)에서 카운팅한 1을 합산할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 합산된 횟수와 미리 결정된 횟수를 비교할 수 있다(S1520). 상기 프로세서는 상기 과정(S1518)에서 합산된 횟수와 메모리에 저장된 미리 결정된 횟수(예: 274회)를 비교할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 합산된 횟수가 미리 결정된 횟수 보다 큰지 식별할 수 있다 (S1522). 상기 프로세서는 합산된 횟수가 상기 미리 결정된 횟수(예: 274회)를 초과하는지를 식별할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터 교체 알림을 출력하고, 필터 교체 정보를 휴대 단말로 전송 할 수 있다(S1524). 상기 프로세서는 상기 합산된 횟수가 상기 미리 결정된 횟수(예: 274회)를 초과하면, 필터를 교체해야 하는 것으로 판단하고, 필터 교체에 관한 정보를 휴대 단말로 전송할 수 있다. 상기 정보 는 필터 교체 알림 메시지, 필터 구매 사이트, 필터 가격 정보 등을 포함할 수 있다. 또한, 상기 프로세서 는 표시부 상에 필터 교체에 대한 알림을 온(ON)할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 합산되어 누적된 횟수가 상기 미리 결정된 횟수(예: 274회)를 초 과하는 것으로 식별되면, 표시부를 통해 알림을 온/오프(ON/OFF)로 반복적으로 출력시킬 수 있다. 상기 프로세서는 상기 건조 과정이 수행되고 있는 동안 표시부를 통해 이러한 알림을 온(ON)으로 출 력할 수 있다. 그리고, 상기 프로세서는 필터 교체에 대한 알림을 통신부를 통해 휴대 단말(미도시)에 설치된 어 플리케이션(예: LG ThinQ 어플리케이션)으로 전송할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 필터 교체 또는 알림이 해제되는지 식별할 수 있다(S1526). 상기 프로세서는 기존 필터가 탈착되고, 새로운 필터가 부착되는지를 센서를 통해 판단함으로써, 필터의 교체 를 식별할 수 있다. 또는, 상기 프로세서는 필터가 교체된 이후, 사용자가 기존 필터의 사용에 대한 누적 시간을 초기화함으 로써, 필터의 교체를 식별할 수 있다. 또는, 상기 프로세서는 통신부으로부터 수신된 알림 해제 신호를 획득할 수 있다. 이러한 알림 해 제 신호는 휴대 단말의 사용자가 어플리케이션(예: LG ThinQ 어플리케이션)을 통해 알림 해제 요청에 기반하여 생성된 신호이다. 일 실시 예에 따르면, 상기 프로세서는 출력된 알림을 해제할 수 있다(S1528). 상기 프로세서는 기 존 필터가 탈착되고, 새로운 필터가 부착되는 것으로 판단되면, 표시부에 출력되는 알림을 해제할 수 있다. 또한, 상기 프로세서는 휴대 단말로부터 알림 해제 요청에 기반하여 생성된 신호가 수신되면, 표시부(3 3)에 출력되는 알림을 해제할 수 있다. 도 16은 본 개시의 일 실시 예에 따른 식기 세척기의 송풍 팬의 동작에 따라 알림을 서로 다르게 표시하는 과정 을 나타낸 순서도이다. 이하, 도 16은 본 개시의 일 실시 예에 따른 식기 세척기의 송풍 팬의 동작에 따라 알림을 서로 다르게 표시하 는 과정을 상세히 설명하면 다음과 같다. 일 실시 예에 따르면, 상기 프로세서는 식기 세척기의 송풍 팬이 동작중인지를 식별할 수 있다 (S1610). 상기 프로세서는 식기 세척기가 현재 진행중인 행정에 기반하여 송풍 팬이 현재 동작 중인지 또는 동작 중이지 않는지를 식별할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작 중이면, 알림을 온(ON) 시킬 수 있다 (S1612). 예를 들면, 상기 프로세서는 송풍 팬이 동작 중이면, 알림이 계속 온(ON) 상태로 표시되도 록 표시부를 제어할 수 있다. 일 실시 예에 따르면, 송풍 팬이 동작한 총 누적 시간이 미리 결정된 제1 시간 이상이거나 이상이 아닌 경 우에도, 송풍 팬이 동작 중이면 알림을 온(ON) 상태로 계속 표시할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 송풍 팬이 동작 중이지 않는 것으로 식별되면, 송풍 팬이 동작한 총 누적 시간이 미리 결정된 제1 시간 이상인지 판단할 수 있다(S1614). 상기 프로세서는 송풍 팬이 동작 중이지 않는 경우, 알림을 서로 다르게 표시하도록 총 누적 시간이 미리 결정된 제1 시간 이상인지를 판단 할 수 있다. 일 실시 예에 따르면, 상기 프로세서는 알림을 반복적으로 온/오프(ON/OFF) 시킬 수 있다(S1616). 상기 프로세서는 송풍 팬이 동작 중이지 않고, 송풍 팬이 동작한 총 누적 시간이 미리 결정된 제1 시간 이상인 것으로 식별되면, 알림을 반복적으로 온/오프(ON/OFF) 시킬 수 있다. 또는, 상기 프로세서는 송풍 팬이 동작 중이지 않고, 송풍 팬이 동작한 총 누적 시간이 미리 결정된 제1 시간 이상이 아닌 것으로 식별되면, 필터 교체에 대한 알림을 오프(OFF) 상태로 유지시킬 수 있다. 본 개시에서 수치로 표현되는 횟수, 및 시간은 단지 실시 예이며, 본 개시에서 기재된 횟수 및 시간은 가변적으 로 조절될 수 있을 뿐만 아니라, 본 개시의 실시 예는 기재된 횟수 및 시간에 제한되지 않는다. 이상에서 상술한 각각의 순서도에서의 각 단계는 도시된 순서에 무관하게 동작될 수 있거나, 또는 동시에 수행 될 수 있다. 또한, 본 개시의 적어도 하나의 구성 요소와, 상기 적어도 하나의 구성 요소에서 수행되는 적어도 하나의 동작은 하드웨어 및/또는 소프트웨어로 구현 가능할 수 있다. 이상과 같이 본 개시에 대해서 예시한 도면을 참조로 하여 설명하였으나, 본 명세서에 개시된 실시 예와 도면에 의해 본 개시가 한정되는 것은 아니며, 본 개시의 기술사상의 범위 내에서 통상의 기술자에 의해 다양한 변형이 이루어질 수 있음은 자명하다. 아울러 앞서 본 개시의 실시 예를 설명하면서 본 개시의 구성에 따른 작용 효과 를 명시적으로 기재하여 설명하지 않았을 지라도, 해당 구성에 의해 예측 가능한 효과 또한 인정되어야 함은 당 연하다."}
{"patent_id": "10-2022-0028418", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 개시의 일 실시 예에 따른 식기세척기의 정면 사시도이다. 도 2는 도 1에 도시된 식기세척기의 개략단면도이다. 도 3은 본 개시의 일 실시 예에 따른 식기세척기의 건조풍 공급부가 베이스에 수용된 상태를 도시한 정면 사시 도이다. 도 4는 도 3에 도시된 건조풍 공급부의 분해 사시도이다. 도 5 및 도 6은 도 4에 도시된 필터 및 필터 하우징의 세부구성을 도시한 분해 사시도이다. 도 7 및 도 8은 도 3에 바텀 터브가 결합된 상태를 나타낸 정면 사시도이다. 도 9는 도 7의 평면도이다. 도 10은 도 9를 A-A 방향으로 절단한 단면도이다. 도 11은 본 개시의 일 실시 예에 따른 식기 세척기의 구성도이다. 도 12는 본 개시의 일 실시 예에 따른 식기 세척기가 필터의 교체에 대한 알림을 제공하는 과정을 나타낸 순서도이다. 도 13은 본 개시의 일 실시 예에 따른 식기 세척기의 표시부에 알림을 표시한 예시도이다. 도 14는 본 개시의 일 실시 예에 따른 송풍 팬의 동작에 따른 동작 시간을 누적하는 과정을 나타낸 순서도이다. 도 15는 본 개시의 일 실시 예에 따른 식기 세척기가 필터의 교체에 대한 알림을 제공하는 과정을 나타낸 순서 도이다. 도 16은 본 개시의 일 실시 예에 따른 식기 세척기의 송풍 팬의 동작에 따라 알림을 서로 다르게 표시하는 과정 을 나타낸 순서도이다."}
