{"patent_id": "10-2022-0016048", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0116615", "출원번호": "10-2022-0016048", "발명의 명칭": "이미지의 화질을 개선하기 위한 전자 장치 및 방법", "출원인": "삼성전자주식회사", "발명자": "성기석"}}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "전자 장치에 있어서, 카메라; 및 프로세서를 포함하고, 상기 프로세서는, 이미지 처리 모듈 및 세그먼테이션 모듈을 더 포함하고,상기 세그먼테이션 모듈은, 상기 카메라를 통해 획득한 원본 이미지에 세그먼테이션을 수행하여 세그먼테이션 정보를 생성하고, 세그먼테이션 정보를 상기 이미지 처리 모듈로 전달하고, 상기 프로세서는, 상기 카메라로부터 전달된 원본 이미지와 상기 세그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역을 확인하고,상기 분할 영역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산하고, 객체 별로 상기 계산된 화질 제어값을 기반으로 상기 이미지 처리 모듈을 통해 1차 이미지 처리를 수행하고, 상기 1차 이미지 처리된 결과를 분석하여 객체 별 가중치를 계산하고,상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어값을 계산하고, 상기 최종 화질 제어값이 2차 이미지 처리에 반영되도록 상기 이미지 처리 모듈로 상기 최종 화질 제어값을 전달하도록 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1 항에 있어서, 상기 이미지 처리 모듈은, 이미지 신호 파이프라인 블록들을 포함하는 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1 항에 있어서, 센서 모듈을 더 포함하고, 상기 세그먼테이션 모듈은, 이미지 세그먼테이션을 수행하여 상기 원본 이미지 속에서 인식된 객체들을 분류하고, 세그먼테이션 맵(segmentation map)을 구성하고, 상기 센서 모듈로부터 획득한 센서 정보를 기반으로 객체 모션 추정을 수행하여 세그먼테이션 수행 시간과 상기이미지 처리 모듈에서 이미지 처리에 소요되는 시간과의 지연 데이터를 계산하고, 상기 지연 데이터에 기반하여상기 세그먼테이션 맵을 조정하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 세그먼테이션 맵은, 공개특허 10-2023-0116615-3-상기 카메라로부터 획득한 원본 이미지의 원본 데이터 또는 상기 원본 데이터가 상기 이미지 처리 모듈에 포함된 이미지 시그널 프로세서(image singal processer) 파이프라인의 적어도 일부를 통해 처리된 데이터를 기반으로 구성되는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1 항에 있어서, 상기 프로세서는, 상기 객체의 분할 영역 별로 객체 색상을 결정하고, 상기 객체 색상을 기초로, 상기 이미지에서 식별된 객체가이미지 처리를 위한 객체로서 유효한지를 결정하고, 이미지 처리를 위한 객체로서 유효한 경우, 상기 객체의 화질제어값을 계산하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5 항에 있어서, 상기 프로세서는, 상기 세그먼테이션 정보를 통해 식별된 객체가 이미지 처리를 위한 객체로서 유효한 경우, 상기 세그먼테이션맵의 객체의 분할 영역의 픽셀데이터를 색공간데이터로 변경하고, 상기 객체의 색상 또는 색온도를 결정하고,상기 원본 데이터에서 상기 객체가 위치한 영역의 색상과 비교하여 상기 객체 색상의 신뢰도를 추정하고 상기신뢰도를 이용하여 결정된 객체 색상을 기반으로 상기 객체의 화질제어값을 계산하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제6항에 있어서, 상기 프로세서는, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 원본 이미지 내에서의 객체 색상과 비교하여 지정된 제1 값 이상이면, 세그먼테이션 정보의 색상을 상기 객체 색상으로 결정하고, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 지정된 제2 값 이하면, 이미지 속의 다른 유사한 객체에 대한 색상 또는 이미지 장면과 관련된 유사 환경을 분석하여 상기 객체 색상을 결정하고, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 제1 값과 상기 제2 값 사이이면, 세그먼테이션 정보와원본 이미지에서의 색상을 믹스하여 상기 객체 색상을 결정하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제1항에 있어서, 상기 프로세서는, 상기 객체들 중 제1 객체의 분할 영역에 대해 이미지 처리하는 제1 동작, 제2 객체의 분할 영역에 대해 이미지처리하는 제2 동작, 및 상기 객체들로 분류된 분할 영역 이외의 영역에 대해 이미지 처리하는 제3 동작을 포함하여 상기 1차 이미지 처리를 수행하는 것을 특징으로 하는 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서, 상기 프로세서는,상기 1차 이미지 처리한 후, 객체 밝기 정보, 객체 색상 정보, 객체 색온도 정보, 객체 이동 정보, 객체 색상의신뢰도, 거리 정보, 크기 정보, 세그먼테이션 비중, 이미지 속의 객체 분할영역 별 가중치 정보 중 적어도 하나를 기반으로 객체 별 가중치를 결정하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서, 공개특허 10-2023-0116615-4-상기 프로세서는, 상기 1차 이미지 처리된 결과 데이터를 기반으로 이미지의 장면 상황을 분석하고, 분석 결과에 따라 상기 가중치를 조절하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서, 상기 프로세서는, 상기 세그먼테이션 정보를 기반으로 분류된 객체 별로 서로 다른 이미지 처리 시 객체 별로 결정된 이미지 처리에 대응하여 화질 제어값을 다르게 계산하여 이미지 처리에 적용하도록 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제1항에 있어서, 상기 프로세서는, 상기 최종 화질 제어값을 기반으로 상기 2차 이미지 처리를 수행하여 보정 이미지를 생성하고, 상기 보정 이미지를 후처리하여 디스플레이에 표시하거나, 메모리에 저장하도록 더 설정된 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제1항에 있어서, 상기 화질 제어값은 화이트 발란스 보정값, 컬러 조정값, 색 필터 보정값, 자동 노출보정값, 노이즈 조정값, 텍스쳐(texture) 조정값 및 톤 커브(tone curve) 값 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "전자 장치에서 이미지의 화질을 개선하는 방법에 있어서, 카메라로부터 원본 이미지를 수신하는 동작; 상기 원본 이미지에 대해 이미지 세그먼테이션을 수행하여 세그먼테이션 정보를 획득하는 동작; 상기 세그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역을 확인하는 동작; 상기 분할 영역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산하는 동작;객체 별로 상기 계산된 화질 제어값을 기반으로 1차 이미지 처리를 수행하는 동작;상기 1차 이미지 처리된 결과를 분석하여 객체 별 가중치를 계산하는 동작;상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어값을 산출하는 동작;및 상기 최종 화질 제어값을 기반으로 상기 원본 이미지에 2차 이미지 처리를 수행하여 보정이미지를 생성하는 동작을 포함하는 방법."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 세그먼테이션 정보를 획득하는 동작은, 이미지 세그먼테이션을 수행하여 상기 원본 이미지 속에서 인식된 객체들 분류하고, 세그먼테이션 맵(segmentation map)을 구성하는 동작; 및 센서 모듈로부터 획득한 센서 정보를 기반으로 객체 모션 추정을 수행하여 세그먼테이션 수행 시간과, 이미지처리 모듈에서 이미지 처리에 소요되는 시간과의 지연 데이터를 계산하고, 상기 지연 데이터에 기반하여 상기세그먼테이션 맵을 조정하는 동작을 더 포함하는 동작을 더 포함하는 방법. 공개특허 10-2023-0116615-5-청구항 16 제14항에 있어서, 상기 객체 별 화질 제어값을 계산하는 동작은, 상기 객체의 분할 영역 별로 객체 색상을 결정하고, 상기 객체 색상을 기초로, 상기 분류된 객체들이 이미지 처리를 위한 객체로서 유효한지를 결정하고, 이미지 처리를 위한 객체로서 유효한 경우, 각 객체의 화질제어값을계산하는 것을 특징으로 하는 방법."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 객체 별 화질 제어값을 계산하는 동작은, 상기 세그먼테이션 정보를 통해 분류된 객체가 이미지 처리를 위한 객체로서 유효한 경우, 상기 세그먼테이션맵에 포함된 객체의 분할 영역의 픽셀데이터를 색공간 데이터로 변경하고, 상기 객체의 색상 또는 색온도를 결정하고, 상기 원본 이미지에서 상기 객체가 위치한 영역의 색상과 비교하여 상기 객체 색상의 신뢰도를 추정하는 동작; 및상기 신뢰도를 이용하여 결정된 객체 색상을 기반으로 상기 객체의 화질제어값을 조정하는 동작을 더 포함하는방법."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 신뢰도를 이용하여 결정된 객체 색상을 기반으로 상기 객체의 화질제어값을 조정하는 동작은, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 원본 이미지 내에서의 객체 색상과 비교하여 지정된 제1값 이상이면, 세그먼테이션 정보의 색상으로 객체 색상으로 결정하고, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 지정된 제2 값 이하면, 이미지 속의 다른 유사한 객체에 대한 색상 또는 상기 원본 이미지의 장면과 관련된 유사 환경을 분석하여 상기 객체 색상을 결정하는 동작;및 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 제1 값 과 상기 제2 값 사이이면, 세그먼테이션 정보와원본 이미지에서의 객체 색상을 믹스하여 상기 객체 색상을 결정하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제14항에 있어서, 상기 객체 별 가중치를 계산하는 동작은, 상기 1차 이미지 처리된 결과 데이터를 기반으로 이미지의 장면 상황을 분석하고, 분석 결과에 따라 상기 가중치를 조절하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0016048", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제14항에 있어서, 상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어값을 산출하는동작은, 상기 세그먼테이션 정보를 기반으로 분류된 객체 별로 서로 다른 이미지 처리 시 객체 별로 결정된 이미치 처리에 대응하여 화질 제어값을 다르게 계산하는 동작을 더 포함하는 방법."}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는, 카메라 및 프로세서를 포함하고, 상기 프로세서는, 이미지 처리 모듈 및 세 그먼테이션 모듈을 더 포함하고, 상기 세그먼테이션 모듈은, 상기 카메라를 통해 획득한 원본 이미지에 세그먼테 이션을 수행하여 세그먼테이션 정보를 생성하고, 세그먼테이션 정보를 이미지 처리 모듈로 전달하고, 상기 프로 (뒷면에 계속)"}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "다양한 실시예들은 세그먼테이션 정보를 이용하여 이미지의 화질을 개선하기 위한 전자 장치 및 방법에 관한 것 이다."}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "카메라를 포함하는 전자 장치는, 이미지 신호 프로세서(image signal processor: ISP)를 이용하여 카메라를 통 해 획득한 이미지를 처리할 수 있다. 이미지 신호 프로세서는 화질 개선 알고리즘 또는 프로세싱을 이용하여 이미지를 처리하여 화질이 개선된 이미지를 제공할 수 있다. 이미지 신호 프로세서는, 화이트 밸런스(white balance) 조정, 컬러 조정(color adjustment)(예: color matrix, color correction, color enhancement), 색 필터 배열 보간(color filter array interpolation), 잡음 감소(noise reduction) 처리, 샤프닝(sharpening), 이미지 개선(image enhancement)(예: HDR(high-dynamic-range), 또는 얼굴 검출(face detection)과 같은 다양한 처리를 수행할 수 있다. 이미지 신호 프로세서로부터 출력된 이미지는 압축된 이미지일 수 있으며, 압축된 이미지가 전자 장치에 저장될 수 있다. 한편, 이미지 세그먼테이션은 이미지(트레이닝 이미지 or 테스트 이미지)를 입력으로 받아 출력으로 라벨 (label) 이미지를 생성하는 기술일 수 있다. 최근 딥러닝(deep learning) 기술이 각광을 받으면서, 전자 장치 의 카메라 성능 향상을 위해 세그먼테이션(segmentation)을 카메라 기술에 활용하기 위한 연구가 증가되고 있는 추세이다."}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이미지 센서 프로세서는 화질 개선을 위해, 이미지 센서의 로우 데이터(raw data)를 분석하여 이미지 장면 (scene)에 대한 화질 제어값(예: 밝기 조정값, 화이트 밸런스 조정값)을 추정하고, 추정된 화질 제어값으로 이 미지 최적화(예: 화이트 밸런스(white balance) 보정, 컬러 보정) 처리를 수행할 수 있다. 그러나, 로우 데이터를 분석하는 경우에는 이미지 촬영 시의 환경에 대한 추가적인 정보를 획득하기가 어려워 화질 개선 효과가 기대치에 못 미칠 수 있다. 또한, 최종적으로 출력되는 영상은 이미지 센서 프로세서의 파이프라인(pipeline)을 통과하고, 후처리(post- processing)를 수행하기 때문에 로우 데이터(raw data) 분석만으로는 영상의 정확한 장면(Scene) 분석이 어려울 수 있다. 이로 인해, 로우 데이터를 분석한 결과와, 최종 화질 처리된 결과에 차이가 발생하여 화질 개선 효과 가 기대 치보다 낮거나, 오류가 발생할 수 있다. 다양한 실시예에 따르면, 이미지 세그먼테이션 정보를 이용하여, 이미지에 대한 추가적인 정보를 획득함으로써, 장면(Scene) 분석에 대한 오류를 최소화하여 이미지 화질이 개선될 수 있는 방법 및 장치를 제공하고자 한다."}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "다양한 실시예에 따른 전자 장치는, 카메라 및 프로세서를 포함하고, 상기 프로세서는, 이미지 처리 모듈 및 세 그먼테이션 모듈을 더 포함하고, 상기 세그먼테이션 모듈은, 상기 카메라를 통해 획득한 원본 이미지에 세그먼 테이션을 수행하여 세그먼테이션 정보를 생성하고, 세그먼테이션 정보를 이미지 처리 모듈로 전달하고, 상기 프 로세서는, 상기 카메라로부터 전달된 원본 이미지와 상기 세그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역을 확인하고, 상기 분할 영역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산하 고, 객체 별로 상기 계산된 화질 제어값을 기반으로 상기 이미지 처리 모듈을 통해 1차 이미지 처리를 수행하고, 상기 1차 이미지 처리된 결과를 분석하여 객체 별 가중치를 계산하고, 상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어값을 계산하고, 상기 최종 화질 제어값이 2차 이미 지 처리에 반영되도록 상기 이미지 처리 모듈로 상기 최종 화질 제어값을 전달하도록 설정될 수 있다. 다양한 실시예에 따른 전자 장치에서 이미지의 화질을 개선하는 방법은, 카메라로부터 원본 이미지를 수신하는 동작, 상기 원본 이미지에 대해 이미지 세그먼테이션을 수행하여 세그먼테이션 정보를 획득하는 동작, 상기 세 그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역을 확인하는 동작, 상기 분할 영 역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산하는 동작, 객체 별로 상기 계산된 화질 제어값을 기반 으로 상기 이미지 처리 모듈을 통해 1차 이미지 처리를 수행하는 동작, 상기 1차 이미지 처리된 결과를 분석하 여 객체 별 가중치를 계산하는 동작, 상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한최종 화질 제어값을 산출하는 동작 및 상기 최종 화질 제어값을 기반으로 상기 원본 이미지에 2차 이미지 처리 를 수행하여 보정이미지를 생성하는 동작을 포함할 수 있다."}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "다양한 실시예들에 따른 전자 장치는, 이미지 세그먼테이션 정보를 통해 이미지 속에서 다양하고 세부적인 객체 들을 인지하고 분류하여 다양한 분석 정보를 획득할 수 있다. 다양한 실시예들에 따른 전자 장치는, 하나의 이 미지 장면에서 복합적인 화질 요소들을 고려하여 각각의 객체에 최적화된 이미지 처리를 수행함으로써 화질이 개선된 이미지를 획득할 수 있다. 다양한 실시예들에 따른 전자 장치는, 이미지 신호 처리 과정에서 발생되는 화질 저하 요인들을 미리 분석하고 피드백함으로써, 이미지(또는 이미지의 장면 환경) 왜곡을 최소화하고 이미지 처리 효과를 개선시킬 수 있다."}
{"patent_id": "10-2022-0016048", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 1, "content": "도 1 은 다양한 실시예들에 따른, 네트워크 환경 내의 전자 장치의 블록도이다. 도 1을 참조하면, 네트워크 환경에서 전자 장치는 제 1 네트워크(예: 근거리 무선 통신 네트워 크)를 통하여 전자 장치와 통신하거나, 또는 제 2 네트워크(예: 원거리 무선 통신 네트워크)를 통하 여 전자 장치 또는 서버 중 적어도 하나와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 서버를 통하여 전자 장치와 통신할 수 있다. 일 실시예에 따르면, 전자 장치는 프로세서, 메모리, 입력 모듈, 음향 출력 모듈, 디스플레이 모듈, 오디오 모듈, 센서 모듈 , 인터페이스, 연결 단자, 햅틱 모듈, 카메라 모듈, 전력 관리 모듈, 배터리 , 통신 모듈, 가입자 식별 모듈, 또는 안테나 모듈을 포함할 수 있다. 어떤 실시예에서는, 전자 장치에는, 이 구성요소들 중 적어도 하나(예: 연결 단자)가 생략되거나, 하나 이상의 다른 구성 요소가 추가될 수 있다. 어떤 실시예에서는, 이 구성요소들 중 일부들(예: 센서 모듈, 카메라 모듈, 또는 안테나 모듈)은 하나의 구성요소(예: 디스플레이 모듈)로 통합될 수 있다. 프로세서는, 예를 들면, 소프트웨어(예: 프로그램)를 실행하여 프로세서에 연결된 전자 장치 의 적어도 하나의 다른 구성요소(예: 하드웨어 또는 소프트웨어 구성요소)를 제어할 수 있고, 다양한 데이 터 처리 또는 연산을 수행할 수 있다. 일 실시예에 따르면, 데이터 처리 또는 연산의 적어도 일부로서, 프로세 서는 다른 구성요소(예: 센서 모듈 또는 통신 모듈)로부터 수신된 명령 또는 데이터를 휘발성 메모리에 저장하고, 휘발성 메모리에 저장된 명령 또는 데이터를 처리하고, 결과 데이터를 비휘발성 메모리에 저장할 수 있다. 일 실시예에 따르면, 프로세서는 메인 프로세서(예: 중앙 처리 장치 또는 어플리케이션 프로세서) 또는 이와는 독립적으로 또는 함께 운영 가능한 보조 프로세서(예: 그래픽처리 장치, 신경망 처리 장치(NPU: neural processing unit), 이미지 시그널 프로세서, 센서 허브 프로세서, 또 는 커뮤니케이션 프로세서)를 포함할 수 있다. 예를 들어, 전자 장치가 메인 프로세서 및 보조 프로 세서를 포함하는 경우, 보조 프로세서는 메인 프로세서보다 저전력을 사용하거나, 지정된 기능 에 특화되도록 설정될 수 있다. 보조 프로세서는 메인 프로세서와 별개로, 또는 그 일부로서 구현될 수 있다. 보조 프로세서는, 예를 들면, 메인 프로세서가 인액티브(예: 슬립) 상태에 있는 동안 메인 프로세서 를 대신하여, 또는 메인 프로세서가 액티브(예: 어플리케이션 실행) 상태에 있는 동안 메인 프로세서 와 함께, 전자 장치의 구성요소들 중 적어도 하나의 구성요소(예: 디스플레이 모듈, 센서 모듈 , 또는 통신 모듈)와 관련된 기능 또는 상태들의 적어도 일부를 제어할 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 이미지 시그널 프로세서 또는 커뮤니케이션 프로세서)는 기능적으로 관련 있는 다른 구성요소(예: 카메라 모듈 또는 통신 모듈)의 일부로서 구현될 수 있다. 일 실시예에 따르면, 보조 프로세서(예: 신경망 처리 장치)는 인공지능 모델의 처리에 특화된 하드웨어 구조를 포함할 수 있다. 인공지능 모델은 기계 학습을 통해 생성될 수 있다. 이러한 학습은, 예를 들어, 인공지능이 수행되는 전자 장치 자체에서 수행될 수 있고, 별도의 서버(예: 서버)를 통해 수행될 수도 있다. 학습 알고리즘은, 예를 들어, 지도형 학습(supervised learning), 비지도형 학습(unsupervised learning), 준지도형 학습(semi- supervised learning) 또는 강화 학습(reinforcement learning)을 포함할 수 있으나, 전술한 예에 한정되지 않 는다. 인공지능 모델은, 복수의 인공 신경망 레이어들을 포함할 수 있다. 인공 신경망은 심층 신경망(DNN: deep neural network), CNN(convolutional neural network), RNN(recurrent neural network), RBM(restricted boltzmann machine), DBN(deep belief network), BRDNN(bidirectional recurrent deep neural network), 심층 Q-네트워크(deep Q-networks) 또는 상기 중 둘 이상의 조합 중 하나일 수 있으나, 전술한 예에 한정되지 않는다. 인공지능 모델은 하드웨어 구조 이외에, 추가적으로 또는 대체적으로, 소프트웨어 구조를 포함할 수 있 다. 메모리는, 전자 장치의 적어도 하나의 구성요소(예: 프로세서 또는 센서 모듈)에 의해 사 용되는 다양한 데이터를 저장할 수 있다. 데이터는, 예를 들어, 소프트웨어(예: 프로그램) 및, 이와 관련 된 명령에 대한 입력 데이터 또는 출력 데이터를 포함할 수 있다. 메모리는, 휘발성 메모리 또는 비 휘발성 메모리를 포함할 수 있다. 프로그램은 메모리에 소프트웨어로서 저장될 수 있으며, 예를 들면, 운영 체제, 미들 웨어 또는 어플리케이션을 포함할 수 있다. 입력 모듈은, 전자 장치의 구성요소(예: 프로세서)에 사용될 명령 또는 데이터를 전자 장치 의 외부(예: 사용자)로부터 수신할 수 있다. 입력 모듈은, 예를 들면, 마이크, 마우스, 키보드, 키 (예: 버튼), 또는 디지털 펜(예: 스타일러스 펜)을 포함할 수 있다. 음향 출력 모듈은 음향 신호를 전자 장치의 외부로 출력할 수 있다. 음향 출력 모듈은, 예를 들 면, 스피커 또는 리시버를 포함할 수 있다. 스피커는 멀티미디어 재생 또는 녹음 재생과 같이 일반적인 용도로 사용될 수 있다. 리시버는 착신 전화를 수신하기 위해 사용될 수 있다. 일 실시예에 따르면, 리시버는 스피커와 별개로, 또는 그 일부로서 구현될 수 있다. 디스플레이 모듈은 전자 장치의 외부(예: 사용자)로 정보를 시각적으로 제공할 수 있다. 디스플레이 모듈은, 예를 들면, 디스플레이, 홀로그램 장치, 또는 프로젝터 및 해당 장치를 제어하기 위한 제어 회로 를 포함할 수 있다. 일 실시예에 따르면, 디스플레이 모듈은 터치를 감지하도록 설정된 터치 센서, 또는 상기 터치에 의해 발생되는 힘의 세기를 측정하도록 설정된 압력 센서를 포함할 수 있다. 오디오 모듈은 소리를 전기 신호로 변환시키거나, 반대로 전기 신호를 소리로 변환시킬 수 있다. 일 실시 예에 따르면, 오디오 모듈은, 입력 모듈을 통해 소리를 획득하거나, 음향 출력 모듈, 또는 전자 장치와 직접 또는 무선으로 연결된 외부 전자 장치(예: 전자 장치)(예: 스피커 또는 헤드폰)를 통해 소리를 출력할 수 있다. 센서 모듈은 전자 장치의 작동 상태(예: 전력 또는 온도), 또는 외부의 환경 상태(예: 사용자 상태) 를 감지하고, 감지된 상태에 대응하는 전기 신호 또는 데이터 값을 생성할 수 있다. 일 실시예에 따르면, 센서 모듈은, 예를 들면, 제스처 센서, 자이로 센서, 기압 센서, 마그네틱 센서, 가속도 센서, 그립 센서, 근접 센서, 컬러 센서, IR(infrared) 센서, 생체 센서, 온도 센서, 습도 센서, 또는 조도 센서를 포함할 수 있다. 인터페이스는 전자 장치가 외부 전자 장치(예: 전자 장치)와 직접 또는 무선으로 연결되기 위해 사용될 수 있는 하나 이상의 지정된 프로토콜들을 지원할 수 있다. 일 실시예에 따르면, 인터페이스는, 예 를 들면, HDMI(high definition multimedia interface), USB(universal serial bus) 인터페이스, SD카드 인터 페이스, 또는 오디오 인터페이스를 포함할 수 있다. 연결 단자는, 그를 통해서 전자 장치가 외부 전자 장치(예: 전자 장치)와 물리적으로 연결될 수 있는 커넥터를 포함할 수 있다. 일 실시예에 따르면, 연결 단자는, 예를 들면, HDMI 커넥터, USB 커넥터, SD 카드 커넥터, 또는 오디오 커넥터(예: 헤드폰 커넥터)를 포함할 수 있다. 햅틱 모듈은 전기적 신호를 사용자가 촉각 또는 운동 감각을 통해서 인지할 수 있는 기계적인 자극(예: 진 동 또는 움직임) 또는 전기적인 자극으로 변환할 수 있다. 일 실시예에 따르면, 햅틱 모듈은, 예를 들면, 모터, 압전 소자, 또는 전기 자극 장치를 포함할 수 있다. 카메라 모듈은 정지 영상 및 동영상을 촬영할 수 있다. 일 실시예에 따르면, 카메라 모듈은 하나 이 상의 렌즈들, 이미지 센서들, 이미지 시그널 프로세서들, 또는 플래시들을 포함할 수 있다. 전력 관리 모듈은 전자 장치에 공급되는 전력을 관리할 수 있다. 일 실시예에 따르면, 전력 관리 모 듈은, 예를 들면, PMIC(power management integrated circuit)의 적어도 일부로서 구현될 수 있다. 배터리는 전자 장치의 적어도 하나의 구성요소에 전력을 공급할 수 있다. 일 실시예에 따르면, 배터 리는, 예를 들면, 재충전 불가능한 1차 전지, 재충전 가능한 2차 전지 또는 연료 전지를 포함할 수 있다. 통신 모듈은 전자 장치와 외부 전자 장치(예: 전자 장치, 전자 장치, 또는 서버) 간 의 직접(예: 유선) 통신 채널 또는 무선 통신 채널의 수립, 및 수립된 통신 채널을 통한 통신 수행을 지원할 수 있다. 통신 모듈은 프로세서(예: 어플리케이션 프로세서)와 독립적으로 운영되고, 직접(예: 유선) 통 신 또는 무선 통신을 지원하는 하나 이상의 커뮤니케이션 프로세서를 포함할 수 있다. 일 실시예에 따르면, 통 신 모듈은 무선 통신 모듈(예: 셀룰러 통신 모듈, 근거리 무선 통신 모듈, 또는 GNSS(global navigation satellite system) 통신 모듈) 또는 유선 통신 모듈(예: LAN(local area network) 통신 모듈, 또는 전력선 통신 모듈)을 포함할 수 있다. 이들 통신 모듈 중 해당하는 통신 모듈은 제 1 네트워크(예: 블루투스, WiFi(wireless fidelity) direct 또는 IrDA(infrared data association)와 같은 근거리 통신 네트워 크) 또는 제 2 네트워크(예: 레거시 셀룰러 네트워크, 5G 네트워크, 차세대 통신 네트워크, 인터넷, 또는 컴퓨터 네트워크(예: LAN 또는 WAN)와 같은 원거리 통신 네트워크)를 통하여 외부의 전자 장치와 통신할 수 있다. 이런 여러 종류의 통신 모듈들은 하나의 구성요소(예: 단일 칩)로 통합되거나, 또는 서로 별도의 복수 의 구성요소들(예: 복수 칩들)로 구현될 수 있다. 무선 통신 모듈은 가입자 식별 모듈에 저장된 가입 자 정보(예: 국제 모바일 가입자 식별자(IMSI))를 이용하여 제 1 네트워크 또는 제 2 네트워크와 같 은 통신 네트워크 내에서 전자 장치를 확인 또는 인증할 수 있다. 무선 통신 모듈은 4G 네트워크 이후의 5G 네트워크 및 차세대 통신 기술, 예를 들어, NR 접속 기술(new radio access technology)을 지원할 수 있다. NR 접속 기술은 고용량 데이터의 고속 전송(eMBB(enhanced mobile broadband)), 단말 전력 최소화와 다수 단말의 접속(mMTC(massive machine type communications)), 또 는 고신뢰도와 저지연(URLLC(ultra-reliable and low-latency communications))을 지원할 수 있다. 무선 통신 모듈은, 예를 들어, 높은 데이터 전송률 달성을 위해, 고주파 대역(예: mmWave 대역)을 지원할 수 있다. 무선 통신 모듈은 고주파 대역에서의 성능 확보를 위한 다양한 기술들, 예를 들어, 빔포밍(beamforming), 거대 배열 다중 입출력(massive MIMO(multiple-input and multiple-output)), 전차원 다중입출력(FD-MIMO: full dimensional MIMO), 어레이 안테나(array antenna), 아날로그 빔형성(analog beam-forming), 또는 대규모 안테나(large scale antenna)와 같은 기술들을 지원할 수 있다. 무선 통신 모듈은 전자 장치, 외부 전자 장치(예: 전자 장치) 또는 네트워크 시스템(예: 제 2 네트워크)에 규정되는 다양한 요구사항을 지원할 수 있다. 일 실시예에 따르면, 무선 통신 모듈은 eMBB 실현을 위한 Peak data rate(예: 20Gbps 이 상), mMTC 실현을 위한 손실 Coverage(예: 164dB 이하), 또는 URLLC 실현을 위한 U-plane latency(예: 다운링 크(DL) 및 업링크(UL) 각각 0.5ms 이하, 또는 라운드 트립 1ms 이하)를 지원할 수 있다. 안테나 모듈은 신호 또는 전력을 외부(예: 외부의 전자 장치)로 송신하거나 외부로부터 수신할 수 있다. 일 실시예에 따르면, 안테나 모듈은 서브스트레이트(예: PCB) 위에 형성된 도전체 또는 도전성 패턴으로 이루어진 방사체를 포함하는 안테나를 포함할 수 있다. 일 실시예에 따르면, 안테나 모듈은 복수의 안테나 들(예: 어레이 안테나)을 포함할 수 있다. 이런 경우, 제 1 네트워크 또는 제 2 네트워크와 같은 통신 네트워크에서 사용되는 통신 방식에 적합한 적어도 하나의 안테나가, 예를 들면, 통신 모듈에 의하여 상기 복수의 안테나들로부터 선택될 수 있다. 신호 또는 전력은 상기 선택된 적어도 하나의 안테나를 통하여 통 신 모듈과 외부의 전자 장치 간에 송신되거나 수신될 수 있다. 어떤 실시예에 따르면, 방사체 이외에 다른 부품(예: RFIC(radio frequency integrated circuit))이 추가로 안테나 모듈의 일부로 형성될 수 있다. 다양한 실시예에 따르면, 안테나 모듈은 mmWave 안테나 모듈을 형성할 수 있다. 일 실시예에 따르면, mmWave 안테나 모듈은 인쇄 회로 기판, 상기 인쇄 회로 기판의 제 1 면(예: 아래 면)에 또는 그에 인접하여 배 치되고 지정된 고주파 대역(예: mmWave 대역)을 지원할 수 있는 RFIC, 및 상기 인쇄 회로 기판의 제 2 면(예: 윗 면 또는 측 면)에 또는 그에 인접하여 배치되고 상기 지정된 고주파 대역의 신호를 송신 또는 수신할 수 있 는 복수의 안테나들(예: 어레이 안테나)을 포함할 수 있다. 상기 구성요소들 중 적어도 일부는 주변 기기들간 통신 방식(예: 버스, GPIO(general purpose input and output), SPI(serial peripheral interface), 또는 MIPI(mobile industry processor interface))을 통해 서로 연결되고 신호(예: 명령 또는 데이터)를 상호간에 교환할 수 있다. 일 실시예에 따르면, 명령 또는 데이터는 제 2 네트워크에 연결된 서버를 통해서 전자 장치와 외부의 전자 장치간에 송신 또는 수신될 수 있다. 외부의 전자 장치(102, 또는104) 각각은 전자 장치(10 1)와 동일한 또는 다른 종류의 장치일 수 있다. 일 실시예에 따르면, 전자 장치에서 실행되는 동작들의 전 부 또는 일부는 외부의 전자 장치들(102,104, 또는108) 중 하나 이상의 외부의 전자 장치들에서 실행될 수 있다. 예를 들면, 전자 장치가 어떤 기능이나 서비스를 자동으로, 또는 사용자 또는 다른 장치로부터의 요 청에 반응하여 수행해야 할 경우에, 전자 장치는 기능 또는 서비스를 자체적으로 실행시키는 대신에 또는 추가적으로, 하나 이상의 외부의 전자 장치들에게 그 기능 또는 그 서비스의 적어도 일부를 수행하라고 요청할 수 있다. 상기 요청을 수신한 하나 이상의 외부의 전자 장치들은 요청된 기능 또는 서비스의 적어도 일부, 또는 상기 요청과 관련된 추가 기능 또는 서비스를 실행하고, 그 실행의 결과를 전자 장치로 전달할 수 있다. 전자 장치는 상기 결과를, 그대로 또는 추가적으로 처리하여, 상기 요청에 대한 응답의 적어도 일부로서 제공할 수 있다. 이를 위하여, 예를 들면, 클라우드 컴퓨팅, 분산 컴퓨팅, 모바일 에지 컴퓨팅(MEC: mobile edge computing), 또는 클라이언트-서버 컴퓨팅 기술이 이용될 수 있다. 전자 장치는, 예를 들어, 분산 컴 퓨팅 또는 모바일 에지 컴퓨팅을 이용하여 초저지연 서비스를 제공할 수 있다. 다른 실시예에 있어서, 외부의 전자 장치는 IoT(internet of things) 기기를 포함할 수 있다. 서버는 기계 학습 및/또는 신경망을 이용한 지능형 서버일 수 있다. 일 실시예에 따르면, 외부의 전자 장치 또는 서버는 제 2 네트워크 내에 포함될 수 있다. 전자 장치는 5G 통신 기술 및 IoT 관련 기술을 기반으로 지능형 서비스(예: 스마트 홈, 스마트 시티, 스마트 카, 또는 헬스 케어)에 적용될 수 있다. 도 2는, 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 2를 참조하면, 카메라 모 듈은 렌즈 어셈블리, 플래쉬, 이미지 센서, 이미지 스태빌라이저, 메모리(예: 버퍼 메모리), 또는 이미지 시그널 프로세서를 포함할 수 있다. 렌즈 어셈블리는 이미지 촬영의 대상 인 피사체로부터 방출되는 빛을 수집할 수 있다. 렌즈 어셈블리는 하나 또는 그 이상의 렌즈들을 포함할 수 있다. 일실시예에 따르면, 카메라 모듈은 복수의 렌즈 어셈블리들을 포함할 수 있다. 이런 경우, 카메라 모듈은, 예를 들면, 듀얼 카메라, 360도 카메라, 또는 구형 카메라(spherical camera)를 형성할 수 있다. 복수의 렌즈 어셈블리들 중 일부는 동일한 렌즈 속성(예: 화각, 초점 거리, 자동 초점, f 넘버(f number), 또는 광학 줌)을 갖거나, 또는 적어도 하나의 렌즈 어셈블리는 다른 렌즈 어셈블리의 렌즈 속성들과 다른 하나 이상의 렌즈 속성들을 가질 수 있다. 렌즈 어셈블리는, 예를 들면, 광각 렌즈 또는 망원 렌즈를 포함할 수 있다. 플래쉬는 피사체로부터 방출 또는 반사되는 빛을 강화하기 위하여 사용되는 빛을 방출할 수 있다. 일실시 예에 따르면, 플래쉬는 하나 이상의 발광 다이오드들(예: RGB(red-green-blue) LED, white LED, infrared LED, 또는 ultraviolet LED), 또는 xenon lamp를 포함할 수 있다. 이미지 센서는 피사체로부터 방출 또는 반사되어 렌즈 어셈블리를 통해 전달된 빛을 전기적인 신호로 변환함으로써, 상기 피사체에 대응하는 이미 지를 획득할 수 있다. 일실시예에 따르면, 이미지 센서는, 예를 들면, RGB 센서, BW(black and white) 센 서, IR 센서, 또는 UV 센서와 같이 속성이 다른 이미지 센서들 중 선택된 하나의 이미지 센서, 동일한 속성을 갖는 복수의 이미지 센서들, 또는 다른 속성을 갖는 복수의 이미지 센서들을 포함할 수 있다. 이미지 센서(23 0)에 포함된 각각의 이미지 센서는, 예를 들면, CCD(charged coupled device) 센서 또는 CMOS(complementary metal oxide semiconductor) 센서를 이용하여 구현될 수 있다.이미지 스태빌라이저는 카메라 모듈 또는 이를 포함하는 전자 장치의 움직임에 반응하여, 렌즈 어셈블리에 포함된 적어도 하나의 렌즈 또는 이미지 센서를 특정한 방향으로 움직이거나 이미지 센서 의 동작 특성을 제어(예: 리드 아웃(read-out) 타이밍을 조정 등)할 수 있다. 이는 촬영되는 이미지에 대 한 상기 움직임에 의한 부정적인 영향의 적어도 일부를 보상하게 해 준다. 일실시예에 따르면, 이미지 스태빌라 이저는, 일실시예에 따르면, 이미지 스태빌라이저은 카메라 모듈의 내부 또는 외부에 배치된 자 이로 센서(미도시) 또는 가속도 센서(미도시)를 이용하여 카메라 모듈 또는 전자 장치의 그런 움직임 을 감지할 수 있다. 일실시예에 따르면, 이미지 스태빌라이저는, 예를 들면, 광학식 이미지 스태빌라이저 로 구현될 수 있다. 메모리는 이미지 센서을 통하여 획득된 이미지의 적어도 일부를 다음 이미지 처 리 작업을 위하여 적어도 일시 저장할 수 있다. 예를 들어, 셔터에 따른 이미지 획득이 지연되거나, 또는 복수 의 이미지들이 고속으로 획득되는 경우, 획득된 원본 이미지(예: Bayer-patterned 이미지 또는 높은 해상도의 이미지)는 메모리에 저장이 되고, 그에 대응하는 사본 이미지(예: 낮은 해상도의 이미지)는 표시 장치디스 플레이 모듈을 통하여 프리뷰될 수 있다. 이후, 지정된 조건이 만족되면(예: 사용자 입력 또는 시스템 명 령) 메모리에 저장되었던 원본 이미지의 적어도 일부가, 예를 들면, 이미지 시그널 프로세서에 의해 획득되어 처리될 수 있다. 일실시예에 따르면, 메모리는 메모리의 적어도 일부로, 또는 이와는 독립 적으로 운영되는 별도의 메모리로 구성될 수 있다. 이미지 시그널 프로세서는 이미지 센서을 통하여 획득된 이미지 또는 메모리에 저장된 이미지 에 대하여 하나 이상의 이미지 처리들을 수행할 수 있다. 상기 하나 이상의 이미지 처리들은, 예를 들면, 깊이 지도(depth map) 생성, 3차원 모델링, 파노라마 생성, 특징점 추출, 이미지 합성, 또는 이미지 보상(예: 노이즈 감소, 해상도 조정, 밝기 조정, 블러링(blurring), 샤프닝(sharpening), 또는 소프트닝(softening)을 포함할 수 있다. 추가적으로 또는 대체적으로, 이미지 시그널 프로세서는 카메라 모듈에 포함된 구성 요소들 중 적어도 하나(예: 이미지 센서)에 대한 제어(예: 노출 시간 제어, 또는 리드 아웃 타이밍 제어 등)를 수 행할 수 있다. 이미지 시그널 프로세서에 의해 처리된 이미지는 추가 처리를 위하여 메모리에 다시 저장 되거나 카메라 모듈의 외부 구성 요소(예: 메모리, 표시 장치디스플레이 모듈, 전자 장치 , 전자 장치, 또는 서버)로 제공될 수 있다. 일실시예에 따르면, 이미지 시그널 프로세서 는 프로세서의 적어도 일부로 구성되거나, 프로세서와 독립적으로 운영되는 별도의 프로세서로 구성 될 수 있다. 이미지 시그널 프로세서이 프로세서과 별도의 프로세서로 구성된 경우, 이미지 시그널 프로세서에 의해 처리된 적어도 하나의 이미지는 프로세서에 의하여 그대로 또는 추가의 이미지 처리 를 거친 후 표시 장치디스플레이 모듈를 통해 표시될 수 있다. 일 실시예에 따르면, 전자 장치는 각각 다른 속성 또는 기능을 가진 복수의 카메라 모듈들을 포함할 수 있다. 이런 경우, 예를 들면, 상기 복수의 카메라 모듈들 중 적어도 하나는 광각 카메라이고, 적어도 다른 하나는 망원 카메라일 수 있다. 유사하게, 상기 복수의 카메라 모듈들 중 적어도 하나는 전면 카메라 이고, 적어도 다른 하나는 후면 카메라일 수 있다. 다양한 실시예들에 따른 전자 장치는 다양한 형태의 장치가 될 수 있다. 전자 장치는, 예를 들면, 휴대용 통신 장치(예: 스마트폰), 컴퓨터 장치, 휴대용 멀티미디어 장치, 휴대용 의료 기기, 카메라, 웨어러블 장치, 또는 가전 장치를 포함할 수 있다. 본 문서의 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않는다. 이하, 화질 개선 처리에 대한 예시로, 화이트밸런스 조정을 예로 들어 설명하나, 이에 한정하지 않고 다른 화질 처리를 위해 세그먼테이션 정보가 활용될 수 있다. 도 3a를 참조하면, 일반적인(또는 종래의) 이미지 처리는 ISP(image signal processor) 모듈 및 후처리 모듈을 통해 수행될 수 있다. ISP 모듈은 카메라에서 촬영된 원본 이미지가 수신될 수 있다. 카메라로부터 출력된 원본 이미지(또는 로 우 데이터(raw data), 미가공 이미지 데이터)(예를 들어, LSC(lense shading correction), Pedestal(카메라 높 낮이의 움직임)과 같은 raw stats 정보 획득을 위해 ISP 블락에서 최소한의 데이터 처리한 이미지)는 베이어 패 턴(bayer pattern) 데이터 또는 RGB 데이터를 포함할 수 있다. ISP 모듈은 원본 이미지에 대해 다양한 이미지 처리를 수행하고, 처리된 보정 이미지를 후처리 모듈 로 전달할 수 있다. 예를 들어, ISP 모듈은 원본 이미지를 기반으로 화이트 밸런스(white balance) 보정, 컬러 조정(color adjustment)(예: color matrix, color correction, color enhancement), 색 필터 배열 보간 (color filter array interpolation), 잡음 감소(noise reduction) 처리, 샤프닝(sharpening), 이미지 개선 (image enhancement)(예: HDR(high-dynamic-range), 감마 교정, 컬러 공간 변환, 이미지 압축 및 이미지 스케일링 중 적어도 하나를 수행하는 이미지 파이프라인(image pipeline)을 통과(pass)하면서 보정 이미지를 생성할 수 있다. 보정 이미지(또는 가공 이미지 데이터)는 디스플레이 상에 표시되기 전에 추가 처리를 위해 후처리 모듈로 전달되고, 후처리 모듈에서 처리된 이미지는 디스플레이로 전달되거나, 메모리에 저장될 수 있다. 이미지 처리 동작의 일 예로서, 화이트 발란스(white balance, 이하 WB) 보정의 경우, ISP 모들은 FD(face detection) 판단 모듈 및 이미지 처리 모듈(또는 image pipeline module)을 통해 이미지에 대해 화이트 발란스(WB) 보정을 수행할 수 있다. FD(face detection) 판단 모듈은 이미지에 얼굴 특징이 존재하는지 여부를 결정하고, 얼굴 특징을 포함하 는 영역(또는 얼굴 영역)을 검출할 수 있다. 이미지 처리 모듈은, FD 판단 모듈로부터 전달된 얼굴 영역에 기반하여 색상과 밝기를 추정하고, 추정된 색상 및 밝기에 따라 WB 제어값(예: WB target)을 결정하고, WB 제어값을 기반으로 이미지의 화이트 발란스를 보정하여 보정 이미지를 생성할 수 있다. 그러나, 일반적인(또는 종래의) FD(face detection) 판단 모듈은 원본 이미지 내에서 얼굴을 검출하는 데 있어, 도 3b에 도시된 바와 같이, 얼굴 특징이 포함되는 영역을 지정된 직사각형(rectangle) 형태로 검출 하고 있다. FD 판단 모듈이 직사각형 형태의 얼굴 영역(예: 얼굴 검출 데이터)을 이미지 처리 모듈 로 전달하게 되므로, 이미지 처리 모듈이 얼굴 색상과 밝기를 추정하는데 있어 얼굴 색상 이외의 요 소들(예: 헤어 색상, 백그라운드 색상)이 얼굴 색상 판단에 기여하게 된다. 이로 인해, 이미지 처리 모듈은, 정확한 얼굴 색상을 분석하기가 어려워 부정확한 WB 제어값을 도출하게 되므로, 화이트 발란스 보정을 수행했음에도 불구하고 화질 개선 성능이 저하될 수 있다. 또한, 마스크과 같이 얼굴에 착용하는 액세서리가 존재할 경우, 부정확한 색상 판단으로 인해 원본 데이터를 분석한 결과와 최 종 화질 처리된 결과에 차이가 발생하여 색상 개선에 오류가 발생할 수도 있다. 이하, 다양한 실시예들은 ISP 파이프라인을 통과하면서 실제 환경 및 이미지 처리 환경에 대한 요소를 정확하게 분석하지 못하여 발생하는 이미지 처리 차이를 개선하기 위해, 세그먼테이션 정보를 활용하여 이미지 내에 객체 들을 보다 세부적으로 식별하고 분류하고, 실제 로우 데이터와 최종 화질 처리된 이미지 간의 차이를 유발하는 다양한 요소들을 고려하여 데이터 분석 결과의 정확성을 향상시키고, 이미지 화질을 개선시킬 수 있는 방법 및 장치에 대해 설명하기로 한다. 도 4는 다양한 실시예에 따른 이미지 화질을 개선하도록 구성된 전자 장치의 블록도를 도시한다. 도 5는 카메라 에서 생성한 원본 이미지와, 세그먼테이션 정보를 예시한다. 도 4를 참조하면, 다양한 실시예에 따른 원본 이미지의 화질을 개선하도록 구성된 전자 장치(예: 도 1의 전자 장치)는 카메라, 이미지 수신 모듈, 센서 모듈, 세그먼테이션 모듈, ISP(Image signal processor) 모듈, 후처리 모듈 및 디스플레이를 포함할 수 있다. 전자 장치의 상 기 구성 요소들은 서로 작동적으로 또는 전기적으로 연결될 수 있다. 일 실시예에 따르면, 세그먼테이션 모듈, ISP(Image signal processor) 모듈 및 후처리 모듈은 도 1의 프로세서 또는 도 2의 이미지 시그널 프로세서)에서 실행되는 프로그램 모듈일 수 있다. 어떤 실시예에 따르면, 세그먼테이션 모듈은 전자 장치의 구성일 수 있으나, 이에 한정하지 않고, 외 부 전자 장치의 구성일 수 있다. 세그먼테이션 모듈이 외부 전자 장치의 구성일 경우, 전자 장치와 통신 모듈(예: 도 1의 통신 모듈)을 통해 데이터를 송수신하여 세그먼테이션 모듈의 동작들을 구현할 수 있다. 어떤 실시에에 따르면, 세그먼테이션 모듈 및 ISP(Image signal processor) 모듈은 하나의 모듈로서 구현될 수도 있다. 카메라는, 렌즈 및 광을 캡쳐하여 이미지를 획득할 수 있다. 카메라를 통해 획득한 이미지는 다양한 요인으로 인해 화질 열화가 발생될 수 있다. 화질 개선을 위한 이미지 처리가, 이미지 인코딩 전에 수행될 수 있다. 이미지 수신 모듈은 카메라로부터 전달된 광 신호를 전자 신호로 변환하는 적어도 하나 이상의 이미 지 센서(미도시)를 포함할 수 있다. 이미지 센서는 카메라로부터 획득한 광 신호를 기반으로 원본 이미지 (또는 로우 데이터(raw data), 미가공 이미지 데이터)를 생성할 수 있다. 일 실시예에 따르면, 이미지 센서에서 출력된 원본 이미지는 베이어 패턴(bayer pattern) 데이터 또는 RGB 데이 터를 포함할 수 있다. 예를 들어, 이미지 센서는 픽셀들의 어레이를 갖는 집적 회로를 포함하며, 각각의 픽셀은 광을 감지하기 위한 광 검출기를 포함할 수 있다. 그러나, 광 검출기의 경우 단독으로 캡쳐된 광의 파장을 검출 할 수 없으므로, 색상 정보를 결정할 수 없다. 이미지 센서는 색상 정보를 캡쳐하기 위해 이미지 센서의 픽셀 어레이 상에 컬러 필터 어레이(color filter array)(예: 베이어 CFA, RGB필터)를 더 포함할 수 있다. 이미지 센 서는 컬러 필터 어레이를 통해 수신된 광의 강도에 관한 색상 정보(예: 베이어 패턴(bayer pattern) 데이터, RGB 데이터)를 포함하는 원본 이미지를 생성할 수 있다. 이미지 수신 모듈은 이미지 센서에서 출력되는 원본 이미지를 ISP 모듈 및 세그먼테이션 모듈 로 전달할 수 있다. 세그먼테이션 모듈로 전달되는 원본 이미지는 원본 이미지의 복사본인 사본 이미지일 수 있다. 세그먼테이션 모듈은 이미지에 대해 세그먼테이션(segmentation)을 수행하여 세그먼테이션 정보를 획득하 고, 세그먼테이션 정보를 ISP 모듈로 전달할 수 있다. 일 실시예에 따르면, 세그먼테이션 모듈은 이미지 세그먼테이션(예: 객체 세그먼테이션, 스킨 세그먼테이 션, 바디 세그먼테이션, 백그라운드 세그먼테이션 등)을 수행할 수 있다. 이미지 세그먼테이션은 속성 별로 이 미지의 영역을 분할하는 것을 의미할 수 있다. 또는, 이미지 세그먼테이션은 이미지(또는 이미지에 대응하는 프 레임) 속의 객체들을 픽셀 단위 또는 영역 단위로 분할하여 속성값을 할당하고, 객체들을 인식하여 분류(또는 식별)하는 과정일 수 있다. 일 실시예에 따르면, 세그먼테이션 모듈은 이미지에 포함된 객체들을 구별하여 인식(또는 검출)하여 세그 먼테이션 맵(segmentation map)을 구성할 수 있다. 세그먼테이션 모듈은 이미지 내의 엣지(edge), 블랍 (blob) 등의 다양한 특징(feature)에 기초하여 이미지 속의 객체들을 분류하고, 객체들에 대해 인식 알고리즘을 이용하여 객체들의 인식 결과(또는 객체 분류 정보)(예: skin, body, mask, sky, grass)를 획득할 수 있다. 어떤 실시예에 따르면, 세그먼테이션 모듈은 객체 인식 결과 및/ 또는 이미지의 메타데이터(예: 초점 거리 (focal length), 자동 포커싱 영역(auto focus area), 촬영 시 좌우 회전 관련 정보(orientation), 색 좌표 (color space), 노출 시간(exposure time), 조리개 관련 정보(F number), 촬영 모드(exposure program)(예: 자 동, 조리개 우선, 셔터 우선, 수동 등), ISO(ISO speed ratings) 또는 이미지 촬영 일자(data time original) 등)를 이용하여 객체 속성에 관한 정보(예: 색상 정보, 장소 분석 정보, 계절 정보, 노출 관련 정보)를 획득할 수 있다. 세그먼테이션 정보는 이미지에 포함된 객체 인식 정보(또는 객체 분류 정보), 인식된 객체들의 위치 정보(또는 픽셀 좌표 정보) 및 객체 속성에 관한 정보를 포함하며, 객체에 관한 모든 정보가 해당될 수 있다. 세그먼테이션 모듈은 인공신경망에 기반하여 세그먼테이션을 수행할 수 있다. 인공신경망은 하나가 이용될 수 있고, 복수의 인공신경망을 이용하여 각각 세그먼테이션이 수행된 후, 그 결과가 조합될 수 있다. 이미지 세 그먼테이션을 위한 인공신경망의 네트워크 구조는 ENet 구조 등 다양한 구조가 적용될 수 있다. 인공신경망을 이용한 이미지 세그먼테이션은 이미지를 입력받아 객체 정보를 출력할 수 있다. 입력 데이터(또는 학습 데이터)의 형태는 이미지(예: 복수의 픽셀 포함)가 될 수 있고, 출력 데이터(또는 라벨링 데이터)는 객체 인식 정보(또는 객체 분류 정보)가 될 수 있다. 일 실시예에 따르면, 이미지가 특정 장소에 위치한 인물을 포함하는 경우, 세그먼테이션 모듈은 인물을 인 식하고, 인물 영역을 스킨(skin), 바디(body), 착용 액세서리(예: 안경, 마스크), 또는/및 얼굴의 스킨외 영역 (예: 페이스페인팅 영역)으로 구분하고, 인물 영역 이외의 영역(out of human)에서 그 외 객체(예: 조명, 바닥, 천장, 나무, 하늘)과 같은 객체들을 인식할 수 있다. 예를 들어, 도 5에 도시된 바와 같이, 원본 이미지는 피사체(또는 인물)을 포함할 수 있다. 세그먼테 이션 모듈은 원본 이미지에 대해 세그먼테이션을 수행하고 세그먼테이션 맵(segmentation)을 구 성할 수 있다. 세그먼테이션 모듈은 세그먼테이션 맵을 통해 인물로 분류되는 분할 영역을 인식 하고, 인물로 분류되는 분할 영역 내에서 바디 영역, 스킨(skin) 영역, 마스크 영역을 인 식하여 각각의 객체들로 분류할 수 있다. 세그먼테이션 모듈은 인물로 분류되는 분할 영역 내에서 바 디 영역(또는 바디 객체)의 속성값을 1로 할당하고, 스킨 영역(또는 스킨 객체)에 속성값을 2로 할당 하고, 마스크 영역(또는 마스크 객체)의 속성값을 3으로 할당하여 세그먼테이션 맵을 구성할 수있다. 센서 모듈(예: 도 1의 센서 모듈)은, 전자 장치의 내부의 작동 상태, 또는 외부의 환경 상태에 반응하여 전기 신호 또는 데이터를 생성할 수 있다. 세그먼테이션 모듈은 센서 모듈로부터 전달된 센서 정보를 기반으로 피사체(또는 객체) 움직임에 대 한 모션 추정(motion estimation)(다시 말해, 복수의 프레임 이미지들에 걸친 객체의 움직임의 방향 및 속도를 추정하여 계산하는 과정)을 수행할 수 있다. 세그먼테이션 모듈은 프레임 단위로 이미지를 처리하는 동안 발생되는 지연 시간(예: 프레임 별 지연 속도)과 세그먼테이션 수행에 대한 처리 시간을 계산할 수 있다. 세그먼테이션 모듈은 이미지 처리 모듈 에서 객체 움직임을 반영한 지연 데이터(또는 지연 시간)를 기반으로 세그먼테이션 맵(또는 맵 경계부)을 조정할 수 있다. 예를 들어, 세그먼테이션 모듈은, 객체 위치에 대한 경계부를 조정(객체로 분류된 영역을 추가 또는 삭제)할 수 있다. 예를 들어, 카메라가 촬영한 이미지(또는 이미지에 대응하는 프레임)는 일정 시간 간격으로 프레임들이 획득될 수 있고, 이미지 처리 모듈에서 프레임 이미지들이 처리되는 시간과 세그먼테이션 수행 시간 간의 차이가 발생될 수 있다. 이때, ISP 처리 시의 최종 결과물에 근접하여 이미지를 분석할 경우, 보다 정확한 분석 결과를 도출하기 때문에, 세그먼테이션 모듈은 피사체 움직임에 따른 세그먼테이션 맵의 이동을 예측하여 이미지 장면(scene)에 대한 정확한 분석을 도출하도록 할 수 있다. 일 실시예에 따르면, 세그먼테이션 모듈은 ISP 처리 모듈을 통해 처리 중인 이미지(또는 각 ISP 파이 프 라인들이 처리 블록들)에 세그먼테이션 정보가 피드백되어 반영될 수 있도록 피사체 움직임 정보(예: 방향 속도) 및 지연 시간(또는 지연값)와 관련된 데이터를 전달할 수 있다. ISP(Image signal processor) 모듈은 이미지 수신 모듈로부터 전달된 원본 이미지를 이미지 처리 모 듈(Image processing module)(또는 ISP pipeline 처리 블록)을 통과하면서 다양한 이미지 처리를 통해 보정 이 미지를 생성하고, 보정 이미지를 메모리에 저장하거나 디스플레이에 표시하도록 전달할 수 있다. 일 예로서, ISP(Image signal processor) 모듈은 카메라로부터 수신된 원본 이미지의 해상도를 낮춰 디스플레이에 표시할 수 있다. ISP(Image signal processor) 모듈은 이미지의 포맷을 손실 압축포맷(예: YUV, JPEG)로 인코딩하여 메모리(미도시)에 저장할 수 있다. 이미지 처리 모듈(Image processing module)(또는 ISP pipeline)을 통해 수행되는 이미지 처리 동작은 예 를 들어, 결함 픽셀 검출/교정, 화이트 밸런스(white balance) 보정, 컬러 조정(color adjustment)(예: color matrix, color correction, color enhancement), 색 필터 배열 보간(color filter array interpolation), 잡 음 감소(noise reduction) 처리, 샤프닝(sharpening), 이미지 개선(image enhancement)(예: HDR(high-dynamic- range), 감마 교정, 컬러 공간 변환, 이미지 압축, 및 이미지 스케일링 동작 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, ISP(Image signal processor) 모듈은 세그먼테이션 모듈로부터 세그먼테이션 정보를 수신하고, 세그먼테이션 정보를 활용하여 이미지 처리를 수행할 수 있다. 일 예를 들어, ISP(Image signal processor) 모듈은 이미지 처리 모듈, 객체 유효성 판단 모듈, 화질 제어값 계산 모듈 , 장면 상황 분석 모듈 및 가중치 계산 모듈 및 FD 판단 모듈을 포함할 수 있다. 어떤 실시예에 따르면, FD 판단 모듈은 생략될 수도 있다. 이미지 처리 모듈(예: ISP pipeline)은 객체 유효성 판단 모듈, 화질 제어값 계산 모듈, 장면 상황 분석 모듈 및 가중치 계산 모듈 및 FD 판단 모듈로부터 연산된 데이터들을 기반으로, 이미 지 신호 프로세서 모듈(Image signal processor module)와 관련된 전반적인 이미지 처리를 수행할 수 있다. 이미지 처리 모듈(예: ISP pipeline)은 원본 이미지(또는 미가공 데이터)에서는 물론, 색상 공간에서의 이 미지 데이터를 처리할 수 있다. 이미지 처리 모듈(예: ISP pipeline)에서 수행되는 이미지 처리는 다양할 수 있으나, 설명의 편의를 위해 서 이미지의 화질 개선을 위해 화이트 밸런스(white balance) 조절을 예시로 설명하기로 한다. 이 외에도 이미 지 처리 모듈(예: ISP pipeline)은 세그먼테이션 정보를 활용하여 컬러 조정(color adjustment)(예: color matrix, color correction, color enhancement), 이미지 개선(image enhancement)(예: HDR(high-dynamic- range)과 같은 이미지 처리가 수행될 수도 있다. 일 실시예에 따르면, 객체 유효성 판단 모듈, 화질 제어값 계산 모듈, 장면 상황 분석 모듈 및 가중치 계산 모듈 및 FD 판단 모듈에서 연산된 데이터들은 이미지 처리 모듈(예: ISP pipeline)로 제 공(또는 피드백)되도록 구현될 수 있다. 예를 들어, 이미지의 프레임 단위로 이미지를 처리하는 것으로 가정할 경우, 이미지 처리 모듈(예: ISP pipeline)이 이미지의 제1 프레임에 대해 화질 처리한 이후 제2 프레임부터는 객체 유효성 판단 모듈, 화 질 제어값 계산 모듈, 장면 상황 분석 모듈 및 가중치 계산 모듈 및 FD 판단 모듈에서 연 산된 데이터들과 원본 데이터를 분석한 결과에 따라 화질 처리를 수행하는 것으로 이해될 수 있다. 객체 유효성 판단 모듈은 세그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역 을 확인하고, 원본 이미지와 이미지의 세그먼테이션 정보를 기반으로 인식된 객체가 이미지 처리 객체로서 유효 한지를 분석하고 객체 색상에 대한 신뢰도(또는 색상의 정확도)를 판단할 수 있다. 일 실시예에 따르면, 객체 유효성 판단 모듈은 이미지에서 인식된 객체의 세그먼테이션 정보를 기반으로 타겟 객체(예: skin 객체)가 위치한 분할 영역의 픽셀 데이터를 HSV(hue, saturation and value) 색공간의 색 조값들로 변환하고, 색상의 히스토그램에 기반하여 최소값, 최대값 및 평균값의 분포를 확인하여 객체 색상(또 는 색온도)을 결정할 수 있다. 색공간은 HSV, HSU, YUV, HLS, Lab, YCM 중 적어도 하나를 포함할 수 있다. 일 예를 들어, 객체 유효성 판단 모듈은 화이트 발란스 보정을 위해 스킨(skin) 색상의 객체가 인식된 경 우, 스킨 색상의 객체가 사람의 얼굴 색상으로서 유효한지를 판단할 수 있다. 객체 유효성 판단 모듈은, 객체가 유효한 객체로서 분석되는 경우, 원본 데이터에 포함된 색상 정보와, 세 그먼테이션 정보를 통해 분석된 객체 색상(예: 객체의 분할 영역의 색상)을 비교하여 객체 색상의 신뢰도를 추 정할 수 있다. 객체 유효성 판단 모듈은, 세그먼테이션 정보에서 객체 색상의 신뢰도(또는 색상의 정확도)가 원본 이미지 내에서의 객체 색상과 비교하여 지정된 제1값(예: 최고값) 이상(또는 신뢰도가 높으면)이면 세그먼테이션 정보 의 객체 색상으로 결정하고, 세그먼테이션 정보에서 객체 색상이 지정된 제2 값(예: 최소값) 이하 (또는 신뢰도 가 떨어지면)이면, 이미지 속의 다른 유사한 객체에 대한 객체 색상 또는 이미지의 장면과 관련된 유사 환경을 분석하여 획득한 객체 색상으로 지정할 수 있다. 또는, 객체 유효성 판단 모듈은, 세그먼테이션 정보에서 객체 색상의 신뢰도(또는 색상의 정확도)가 제1값 (예: 최고값)과 제2 값(예: 최소값_) 사이인 경우, 세그멘테이션 정보의 색상과 원본 이미지의 색상을 믹스하여 객체 색상으로 지정할 수 있다. 어떤 실시예에 따르면, 화질 제어값 계산 모듈은 객체 유효성 판단 모듈에서 추정된 객체 상의 신뢰 도를 이용하여 상기 객체의 화질제어값을 조정할 수도 있다. 어떤 실시예에 따르면, FD 검출 모듈은 얼굴 특징을 포함하는 직사각 형태의 영역을 얼굴 영역으로 검출할 수 있다. 객체 유효성 판단 모듈은, 얼굴 영역의 색상 정보뿐만 아니라, 세그먼테이션 정보를 통해 얼굴 중 스킨 색상을 가진 형태의 영역(윤관 라인을 따른 영역)을 얼굴로 검출하고, FD 검출 모듈로부터 획득한 얼굴 검출 데이터를 종합하여보다 정교하고 정확한 얼굴 영역의 색상 및 밝기를 계산할 수 있다 어떤 실시에에 따르면, 세그먼테이션 모듈은 ISP모듈이나 후처리모듈 후단에 배치될 수도 있다. 이 경우, ISP모듈이나 후처리모듈은 이미지 처리 전, 세그먼테이션 정보를 통해 최종 화질과 거의 유 사한 이미지를 취득할 수 있기 때문에, 더 정확한 얼굴 영역의 색상 및 밝기를 계산할 수 있다. 화질 제어값 계산 모듈은 자동 노출, 자동 화이트 발란스, 자동 포커스, 플리커 검출, 흑색 레벨 보상과 같은 이미지 처리 시의 설정값과, 세그먼테이션 정보를 기반으로 화질 제어값(예: 화이트 발란스 보정을 위한 이득 산출, 컬러 조정(RGB 처리)을 위한 이득 산출, 또는 컬러 교정 행렬(CCM) 계수들)을 계산하고, 계산된 화 질 제어값을 이미지 처리 모듈로 전달할 수 있다. 상기 화질 제어값은 화이트 발란스 보정값, 컬러 조정값, 색 필터 보정값, 자동 노출보정값, 노이즈 조정값, 텍 스쳐(texture) 조정값 및 톤 커브(tone curve) 값 중 적어도 하나를 포함할 수 있다. 일 실시예에 따르면, 화질 제어값 계산 모듈은 이미지에 포함된 객체 별 화질 제어값을 계산할 수 있다. 일 예를 들어, 화이트 발란스 보정을 위해 화질 제어값 계산 모듈은 화이트 영역에 해당되는 객체들 별로 WB 화질 제어값(예: 얼굴 스킨의 WB target, 조명 객체의 WB target)를 계산할 수 있다. 이미지 처리 모듈은 화질 제어값 계산 모듈로부터 전달된 화질 제어값들을 기반으로 파이프라인의 처 리 동작들을 수행할 수 있다. 이미지 처리 모듈은전달된 화질 제어값들을 기반으로 이미지 파이프라인의 처리된 동작들의 결과를 가중치 계산 모듈로 전달할 수 있다. 가중치 계산 모듈은 세그먼테이션 정보를 기반으로 객체 영역에 대한 이미지 처리 및 객체 외 영역에 대한 이미지 처리 결과에 따라 보정에 대한 가중치를 계산하고, 가중치에 따라 객체 별 보정 이득(예: WB gain)을 조 정할 수 있다. 가중치 계산 모듈은 객체 밝기 정보, 객체 색상(색온도) 정보, 객체 이동 정보(예: 속도, 이동), 객체 색 상의 신뢰도, 거리 정보, 크기 정보, 세그먼테이션 비중, 이미지속 객체 분할영역 별 가중치 정보 중 적어도 하 나를 기반으로 객체 별 가중치를 결정할 수 있다. 어떤 실시예에 따르면, 장면 상황 분석 모듈은 이미지의 장면에 대한 상황을 분석하고 분석 정보를 가중치 계산 모듈로 전달할 수 있다. 장면 상황 분석 모듈은 예를 들어, 이미지 속에 객체가 위치한 장소가 실내인지, 외부 환경인지, 야간 환경인지, 어두운 환경인지, 바다 환경인지, 조명이 존재하는 지, 조명의 색온 도가 어떠한지 여부와 같은 상황을 분석하여 환경 정보를 획득할 수 있다. 어떤 실시예에 따르면, 화질 제어값 계산 모듈은 화질 제어값(제어 파라미터)으로 이미지 처리된 결과 데 이터 및 환경 정보를 분석한 분석 정보를 기반으로 화질 제어값들을 조정할 수 있다. 가중치 계산 모듈은 객체 별 화질 제어값과 가중치를 믹스하여 이미지 처리(예: ISP pipeline) 과정에서 발생되는 다양한 요인들이 반영된 최종 화질 제어값(예: final target)을 계산할 수 있다. 가중치 계산 모듈은 이미지 처리 모듈의 이미지 처리 과정에서 최종 화질 제어값이 피드백되도록 최 종 화질 제어값을 이미지 처리 모듈(ISP pipeline)로 제공할 수 있다. 이미지 처리 모듈(ISP pipeline)은 최종 화질 제어값을 기반으로 이미지 처리 모듈(ISP pipeline)의 최종 결과물(다시 말해, 보정이미지)을 생성하고, 보정 이미지를 후처리 모듈로 전달할 수 있다. 후처리 모듈은, ISP 처리 모듈로부터 출력된 보정 이미지를 수신하고, 수신된 보정 이미지에 대해 후 처리를 수행할 수 있다. 일 예를 들어, 후처리 모듈은, 이미지 데이터의 동적 범위 압축, 휘도, 콘트라스 트 및 컬러 조정 동작뿐만 아니라, 디스플레이의 해상도에 기초하여 이미지 데이터의 크기 또는 해상도를 스케일링하기 위한 스케일링 동작을 수행할 수 있다. 후처리 모듈은, 촬영 중인 이미지를 디스플레이하기 위하여 후처리된 이미지를 디스플레이에 전송할 수 있다. 또는 후처리 모듈은 후처리된 이미지를 메모리(미도시)에 저장할 수도 있다. 다양한 실시예에 따른 전자 장치(예: 도 1의 전자 장치는, 카메라(예: 도 1 및 도 2의 카메라 모듈, 도 4의 카메라) 및 프로세서(예: 도 1의 프로세서,도 2의 이미지 시그널 프로세서, 도 4의 ISP 모듈)를 포함하고, 상기 프로세서는, 이미지 처리 모듈(예:도 4의 이미지 처리 모듈) 및 세그먼 테이션 모듈(예: 도 4의 세그먼테이션 모듈)을 더 포함하고, 상기 세그먼테이션 모듈은, 상기 카메라 를 통해 획득한 원본 이미지에 세그먼테이션을 수행하여 세그먼테이션 정보를 생성하고, 세그먼테이션 정 보를 이미지 처리 모듈(예:도 4의 이미지 처리 모듈)로 전달하고, 상기 프로세서는, 상기 카메라 로부터 전달된 원본 이미지와 상기 세그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역을 확인하고, 상기 분할 영역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산하고, 객체 별로 상 기 계산된 화질 제어값을 기반으로 상기 이미지 처리 모듈을 통해 1차 이미지 처리를 수행하고, 상기 1차 이미지 처리된 결과를 분석하여 객체 별 가중치를 계산하고, 상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어값을 계산하고, 상기 최종 화질 제어값이 2차 이미지 처리에 반영되도 록 상기 이미지 처리 모듈로 상기 최종 화질 제어값을 전달하도록 설정될 수 있다. 다양한 실시예에 따른 상기 이미지 처리 모듈은, 이미지 신호 파이프라인 블록들을 포함할 수 있다. 다양한 실시예에 따른 전자 장치1는 센서 모듈(예: 도 1의 센서 모듈)을 더 포함하고, 상기 세그먼테 이션 모듈은, 이미지 세그먼테이션을 수행하여 상기 원본 이미지 속에서 인식된 객체들을 분류하고, 세그먼테이 션 맵(segmentation map)을 구성하고, 상기 센서 모듈로부터 획득한 센서 정보를 기반으로 객체 모션 추정 을 수행하여 세그먼테이션 수행 시간과 상기 이미지 처리 모듈에서 이미지 처리에 소요되는 시간과의 지연 데이터를 계산하고, 상기 지연 데이터에 기반하여 상기 세그먼테이션 맵을 조정하도록 더 설정될 수 있다. 다양한 실시예에 따른 상기 세그먼테이션 맵은, 상기 카메라로부터 획득한 원본 이미지의 원본 데이터 또 는 상기 원본 데이터가 상기 이미지 처리 모듈에 포함된 이미지 시그널 프로세서 파이프라인의 적어도 일부를 통과하여 처리된 데이터를 기반으로 구성되는 것을 특징으로 할 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는, 상기 객체의 분할 영역 별로 객체 색상을 결정하고, 상기 객 체 색상을 기초로, 상기 이미지에서 식별된 객체가 이미지 처리를 위한 객체로서 유효한지를 결정하고, 이미지 처리를 위한 객체로서 유효한 경우, 상기 객체의 화질제어값을 계산하도록 더 설정될 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 세그먼테이션 정보를 통해 식별된 객체가 이미지 처리를 위한 객체로서 유효한 경우, 상기 세그먼테이션 맵의 객체의 분할 영역의 픽셀데이터를 색공간데이터로 변경하 고, 상기 객체의 색상 또는 색온도를 결정하고, 상기 원본 데이터에서 상기 객체가 위치한 영역의 색상과 비교 하여 상기 객체 색상의 신뢰도를 추정하고 상기 신뢰도를 이용하여 결정된 객체 색상을 기반으로 상기 객체의 화질제어값을 계산하도록 더 설정될 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 원본 이미지 내에서의 객체 색상과 비교하여 지정된 제1 값 이상이면, 세그먼테이션 정보의 객체 색상으로 결정하고, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 지정된 제2 값 이하면, 이미지 속의 다른 유사한 객체에 대 한 객체 색상 또는 이미지의 장면과 관련된 유사 환경을 분석하여 획득한 객체 색상으로 지정하고, 상기 세그먼 테이션 정보에서 객체 색상의 신뢰도가 상기 제1 값과 상기 제2 값 사이이면, 세그먼테이션 정보와 원본 이미지 에서의 객체 색상을 믹스하여 상기 객체 색상을 지정하도록 더 설정될 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 객체들 중 제1 객체의 분할 영역에 대해 이미지 처리하는 제1 동작, 제2 객체의 분할 영역에 대해 이미지 처리하는 제2 동작, 및 상기 객체들로 분류된 분할 영역 이외의 영역에 대해 이미지 처리하는 제3 동작을 포함하여 상기 1차 이미지 처리를 수행하는 것을 특징으로 할 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 1차 이미지 처리한 후, 객체 밝기 정보, 객체 색상 정보, 객체 색온도 정보, 객체 이동 정보, 객체 색상의 신뢰도, 거리 정보, 크기 정보, 세그먼테이션 비중, 이미지속 객체 분할영역 별 가중치 정보 중 적어도 하나를 기반으로 객체 별 가중치를 결정하도록 더 설정될 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 1차 이미지 처리된 결과 데이터를 기반으로 이미지의 장 면 상황을 분석하고, 분석 결과에 따라 상기 가중치를 조절하도록 더 설정될 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 세그먼테이션 정보를 기반으로 분류된 객체 별로 서로 다 른 이미지 처리 시 객체 별로 결정된 이미지 처리에 대응하여 화질 제어값을 다르게 계산하여 이미지 처리에 적 용하도록 설정될 수 있다. 다양한 실시예에 따른 상기 프로세서(120,450)는 상기 최종 화질 제어값을 기반으로 상기 2차 이미지 처리를 수 행하여 보정 이미지를 생성하고, 상기 보정 이미지를 후처리하여 디스플레이에 표시하거나, 메모리에 저장하도 록 더 설정될 수 있다. 다양한 실시예에 따른 상기 화질 제어값은 화이트 발란스 보정값, 컬러 조정값, 색 필터 보정값, 자동 노출보정 값, 노이즈 조정값, 텍스쳐(texture) 조정값 및 톤 커브(tone curve) 값 중 적어도 하나를 포함할 수 있다. 도 6a는 다양한 실시예에 따른 이미지 화질 개선 방법을 도시하며, 도 6b은 6a의 객체 색상 신뢰도 결정 동작의 구체적인 동작들을 도시한다. 610 동작에서, 다양한 실시예에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 4의 ISP 모듈)은 카메라로부터 원본 이미지를 수신할 수 있다. 원본 이미지(또는 로우 데이터(raw data), 미가공 이미지 데이터)는 베이어 패턴(bayer pattern) 데이터 또는 RGB 데이터를 포함할 수 있다. 615 동작에서, 프로세서는 원본 이미지에 세그먼테이션을 수행할 수 있다. 예를 들어, 프로세서는 세그먼테이션 모듈을 제어하여 원본 이미지에 세그먼테이션을 수행하고, 이미지의 세그먼테이션 정보를 획득할 수 있다. 일 예를 들어, 프로세서는 이미지 세그먼테이션을 수행을 통해 세그먼테이션 맵(segmentation map)를 구성 하고, 이미지 속에서 인식된 객체들 분류하여 객체 분할 영역 및 객체 분류 정보(및 객체 속성 정보))를 획득할 수 있다. 예를 들어, 이미지 속 마스크를 쓴 사람이 존재하는 경우, 프로세서는 “실내 영역(예: 조명이 존재함)에 마스크를 쓴 사람이 위치함, 백인인 사람, 긴 머리, 하얀색 마스크”와 같은 객체 속성 정보, 이미지 속에 사람 이 위치한 영역의 위치 정보(예: 픽셀좌표 정보)를 세그먼테이션 정보로서, 획득할 수 있다. 620 동작에서, 프로세서는 이미지 속의 객체 움직임 검출을 위해 모션 추정(motion estimation)을 수행할 수 있다. 예를 들어, 프로세서는 연속적인 이미지(예: 복수의 프레임 이미지들)에 포함된 객체(또는 피사체)의 모션 추정(motion estimation)(다시 말해, 복수의 프레임 이미지들에 걸친 객체의 움직임을 계산하는 과정)을 수행할 수 있다. 프로세서는 모션 추정을 통해 객체 움직임(또는 특징점들의 변화 정보)을 예측할 수 있다. 프로세서는 프레임 단위로 이미지를 처리하는 동안 발생되는 지연 시간(예: 프레임 별 지연 속도)과 세그 먼테이션 수행에 대한 처리 시간을 계산할 수 있다. 625 동작에서, 프로세서는 모션 추정을 통해 추정된 객체 움직임을 반영한 지연 시간에 따라 세그먼테이션 맵을 조정할 수 있다. 예를 들어, 카메라로부터 수신된 원본 데이터를 분석하는 정보와, ISP 파이프라인(또는 후처리)을 통해 처리된 이미지를 분석하는 정보는 차이가 있어, 최종 화질 처리된 결과에 차이가 존재할 수 밖에 없다. 이미지의 화질 처리를 위해, ISP 파이프라인을 통과하여 처리된 이미지의 환경을 고려할 경우, 최종 결과물과 유사한 환경으로 이미지가 분석되므로, 화질 처리 개선에 효과적일 수 있다. 프로세서는, 이미지 처리 모듈을 통해 수 프레임들을 처리하는 소요 시간이 존재하므로, 초기 데이터에 기 반하여 구성된 세그먼테이션 맵을 객체 움직임에 따른 시간 지연을 반영하여 세그먼테이션 맵(또는 맵 경계부) 를 조정할 수 있다. 예를 들어, 프로세서는, 객체 위치에 대한 경계부를 조정(객체로 분류된 영역을 추가 또는 삭제)할 수 있다. 630 동작에서, 프로세서는 세그먼테이션 정보를 분석하여 유효한 객체들이 검출되는지를 판단할 수 있다. 일 예를 들어, 프로세서는 이미지로부터 인식된 객체(예: 스킨 객체(예: 사람의 피부색을 가진 영역으로 분류된 영역))가 화이트 발란스 조정을 위한 얼굴 객체로서 유효한 지를 판단할 수 있다. 프로세서는 객체가 이미지 처리를 위한 객체로서, 유효하지 않으면 프로세스를 종료하고, 객체가 이미지 처리를 위한 객체로서 유효한 경우 640 동작으로 진행할 수 있다. 640 동작에서, 프로세서는 객체 색상에 대한 신뢰도(또는 색상의 정확도)를 추정할 수 있다. 일 실시예에 따르면, 객체 색상에 대한 신뢰도(또는 색상의 정확도)를 추정하는 동작을 구체적으로, 살펴보면, 도 6b에 도시된 바와 같이, 프로세서는 641 동작에서, 이미지의 세그먼테이션 정보를 기초로 객체 분할 영 역의 RGB 데이터를 색공간 데이터(예: HSV 데이터)로 변환할 수 있다. 642 동작에서 프로세서는 객체의 색 공간값을 기반으로 객체 색상을 결정할 수 있다. 643 동작에서 프로세서는 세그먼테이션 정보의 객체 색공 간값과, 카메라로부터 수신된 원본 이미지(또는 로우 데이터)의 색공간값을 비교하여 식별된 객체 색상에 대한 신뢰도(또는 색상의 정확도)를 추정할 수 있다. 프로세서는 세그먼테이션 정보에서 객체 색상의 신뢰도가 원본 이미지 내에서의 객체 색상과 비교하여 지 정된 값 이상(또는 신뢰도가 높으면)이면, 객체 색상을 세그먼테이션 정보의 객체 색상으로 결정할 수 있다. 645 동작에서, 프로세서는 세그먼테이션 정보에서 객체 색상의 신뢰도가 지정된 값 이하(또는 신뢰도가 떨 어지면), 이미지 속의 다른 유사한 객체에 대한 객체 색상 또는 이미지의 장면과 관련된 유사 환경을 분석하여 이전에 기획득한 객체 색상으로 지정할 수 있다. 어떤 실시예에 따르면, 645 동작은 생략될 수 있다. 어떤 실시예에 따르면, 프로세서는 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 제1 값 과 제2 값 사이이면, 세그먼테이션 정보와 원본 이미지에서의 객체 색상을 믹스하여 객체 색상을 지정할 수 있다. 650 동작에서, 프로세서는 신뢰도 있는 객체 색상을 기반으로 객체 별 화질 제어값을 계산할 수 있다. 예를 들어, 프로세서는 화이트 발란스 조정을 위해 이미지에 포함된 스킨 객체 중 얼굴 영역에 대한 화질 제어값(예: face object WB target 값) 및 얼굴 외 영역에 대한 화질 제어값(예: out of object WB target 값)을 계산할 수 있다. 상술한 화질 제어값 이외에, 화이트 발란스 조정을 위한 객체로 유효한 객체들(예: sky object, mask object, body object)이 존재하는 경우, 객체 별로 화질 제어값을 계산할 수 있다. 다양한 실시예들은 객체 별 화질 제어값을 계산하게 되므로, 동일한 객체로 분류 되더라도, 각 객체의 특성에 따라 다른 화질 제어값으로 계산될 수 있다. 예를 들어, 흑인 얼굴이더라도, 얼굴의 밝기, 채도 등이 각각 다른 특성을 가지므로, 검색 색상의 채도에 따라 화질 제어값이 달라질 수 있다. 660 동작에서, 프로세서는 객체 별로 계산된 화질 제어값을 기반으로 이미지 처리를 수행할 수 있다. 예를 들어, 프로세서는 얼굴 영역을 얼굴 객체의 화질 제어값으로 화이트 발란스(WB) 보정을 수행하고, 얼 굴 영역 외 영역을 얼굴 외 객체의 화질 제어값(예: out of object WB target 값)으로 화이트 발란스 보정을 수행할 수 있다. 이미지 처리는 각 객체(또는 객체 영역) 별로 순차적 또는 병렬적으로 수행할 수 있다. 670 동작에서, 프로세서는 객체 별 가중치를 계산할 수 있다. 프로세서는 객체 밝기 정보, 객체 색상(색온도) 정보, 객체 이동 정보(예: 속도, 이동), 객체 색상의 신뢰 도, 거리 정보, 크기 정보, 세그먼테이션 비중, 이미지속 객체 분할영역 별 가중치 정보 중 적어도 하나를 기반 으로 객체 별 가중치를 결정할 수 있다. 예를 들어, 프로세서는 얼굴 영역의 화이트 발란스 이득값과, 얼굴 영역을 제외한 영역의 화이트 발란스 이득값을 종합하여 객체 색상 보정에 대한 가중치를 계산할 수 있다. 프로세서는 가중치에 따라 적절한 색 상값을 믹스하여 객체 별 화질 제어값을 조정할 수 있다. 어떤 실시예에 따르면, 프로세서는 객체 별로 화질 처리된 이미지에 대한 장면 상황을 분석할 수 있다. 프 로세서는 이미지의 장면 상황을 분석하여 이미지 속에 객체들이 위치한 장소, 환경의 조도, 색온도 등 여 러 요소들의 분석을 통하여 해당 환경을 유추하고,추가 색상 보정이 필요한지 여부를 확인할 수 있다. 예를 들 어, 프로세서는 장면 환경에 분석 결과, 객체의 색상이 실내 조명 색상으로 분석되고, 실내 조명 색상에 대응하여 화질 제어값이 계산되었으나, 주변 환경이 실내가 아닌 야외 환경으로 분석되면, 실내 조명 색상이 아 닐 확률이 높으므로 가중치를 낮춰 해당 객체의 화질 제어값을 조정할 수 있다. 675 동작에서, 프로세서는 객체 별 화질 제어값과 가중치를 믹스하여 최종 화질 제어값을 산출할 수 있다. 680 동작에서, 프로세서는 최종 화질 제어값을 이미지 처리 모듈(ISP pipeline)으로 피드백(또는 전달)할 수 있다. 예를 들어, 이미지 처리 모듈(예: ISP pipeline)이 이미지의 제1 프레임에 대응하는 원본 데이터에 기반하여 화 질 처리한 이후, 세그먼테이션 정보를 통해 원본 데이터에 ISP 처리 과정에서 발생되는 추가적인 요인들을 고려 하여 화질 처리될 수 있다. 이로 인해, 원본 데이터를 분석한 정보에 의해 화질 처리된 이미지보다, ISP 처리 과정에서 발생된 정보를 추가적인 요인으로 분석하고, 화질 처리됨으로써, 화질이 보다 개선된 이미지로 보정될 수 있다. 685 동작에서, 프로세서는 이미지를 최종 화질 제어값으로 이미지 처리하여 보정 이미지(예: 보정 이미 지)를 생성할 수 있다. 690 동작에서, 프로세서는 보정 이미지를 후처리할 수 있다. 도 7은 일 실시예에 따른 세그먼테이션 정보를 이용하여 객체의 화질 제어값을 계산하는 동작의 예시를 도시한 다. 도 7을 참조하면, 다양한 실시예에 전자 장치의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프 로세서, 도 4의 ISP 모듈)는 세그먼테이션 정보를 기반으로 이미지 속에 복수의 객체들을 식별하여 분류하고, 객체 영역 별로 화질 제어값을 계산하고, 객체 별 화질 처리를 수행할 수 있다. 객체 별 화질 처리는개별적으로 또는 병렬적으로 수행할 수 있으며, 이에 한정하는 것은 아니다. 이미지 처리 동작의 일 예시로서, 화이트 발란스 보정을 설명하면, 프로세서는 객체 별 화이트 발란스 보 정을 수행하여 최종 화질 제어값을 계산할 수 있다. 예를 들어, 프로세서는 세그먼테이션 정보를 기반으로 이미지 속에서 얼굴 객체, 바디 객체, 백그라운드 객체(예: 조명 객체) 및 기타 객체(예: mask object)의 분할 영역을 확인할 수 있다. 프로세서는 710 동작에서, 얼굴 객체의 화질 제어값(예: face WB target 값)을 계산하고, 715 동작에서, 얼굴 객체로 분류되는 분할 영역에 화이트 발란스 보정을 수행하여 결과 데이터를 획득할 수 있다. 프로세서는 720 동작에서, 바디 객체의 화질 제어값(예: body WB target 값)을 계산하고, 725 동작에서, 바디 객체로 분류되는 분할 영역에 화이트 발란스 보정을 수행하여 결과 데이터를 획득할 수 있다. 프로세서는 730 동작에서, 백그라운드 객체(예: 조명)의 화질 제어값(예: background WB target 값)을 계 산하고, 735 동작에서, 백그라운드 객체로 분류되는 분할 영역에 화이트 발란스 보정을 수행하여 결과 데이터를 획득할 수 있다. 프로세서는 740 동작에서, 기타 객체(other object)(예: mask)의 화질 제어값(예: face WB target 값)을 계산하고, 745 동작에서, 기타 객체로 분류되는 분할 영역에 화이트 발란스 보정을 수행하여 결과 데이터를 획 득할 수 있다. 프로세서는 750 동작에서 객체 외 영역(out of object)에 화이트 발란스 보정을 수행하여 결과 데이터를 획득할 수 있다. 프로세서는 760 동작에서, 결과 데이터에 기반하여 이미지의 장면 상황을 분석하고 770 동작에서, 객체 가 중치를 계산할 수 있다. 프로세서는 객체 밝기 정보, 객체 색상(색온도) 정보, 객체 이동 정보(예: 속도, 이동), 객체 색상의 신뢰도, 거리 정보, 크기 정보, 세그먼테이션 비중, 이미지속 객체 분할영역 별 가중치 정 보 중 적어도 하나를 기반으로 객체 별 가중치를 결정할 수 있다. 프로세서는, 780 동작에서, 객체 별 화질 제어값과 가중치를 믹스하여 최종 화질 제어값을 산출할 수 있다. 도 8은 일 실시예에 따른 세그먼테이션 정보를 이용하여 화이트 발란스 제어값을 계산하는 동작의 예시를 도시 한다. 도 8은 참조하면, 다양한 실시예에 따르면, 전자 장치는 객체 전자 장치 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그널 프로세서, 도 4의 ISP 모듈)는 의 화이트 발란스 보정을 위해 원본 데이터와 세그먼테이션 정보의 맵핑하여 객체 별 분할 영역을 분류하고, 순 차적으로 객체 별 가중치를 믹스하여 최종 화질 제어값을 도출할 수 있다. 이미지 속에서 얼굴 객체, 바디 객체, 백그라운드 객체 영역으로 분류된 경우를 가정해 볼 경우, 프로세서(12 0)는 810 동작에서, 화이트 발란스 보정을 위해, 바디 객체 영역의 색상을 기반으로 바디 화이트 발란스 이득 (body WB gain)(다시 말해, 화질 제어값)을 계산할 수 있다. 예를 들어, 바디 영역 내에 존재하는 픽셀들의 색 상 평균값을 기준으로 화이트 발란스 보정을 위한 이득(예: R 이득, B 이득)을 산출할 수 있다. 프로세서는 820 동작에서, 백그라운드 객체 영역의 색상을 기반으로 백그라운드 화이트 발란스 이득 (background WB gain) 을 계산할 수 있다. 프로세서는 바디 객체 영역 및 백그라운드 객체 영역의 신뢰도 추정을 통해 바디 객체와 백드라운드 객체 의 신뢰성 있는 색상과 일치하는 가중치를 추출하고, 추출된 가중치를 바디 화이트 발란스 이득(body WB gain) 및 백그라운드 화이트 발란스 이득(background WB gain)에 각각 적용하여 믹스(mix)할 수 있다. 프로세서는 830 동작에서, 얼굴 객체 영역의 색상을 기반으로 얼굴 화이트 발란스 이득(face WB gain)을 계산할 수 있다. 프로세서는 얼굴 객체의 신뢰성 있는 색상과 일치하는 가중치를 추출하고, 추출된 가중치 를 및 얼굴 화이트 발란스 이득(face WB gain)에 적용할 수 있다. 프로세서는 840 동작에서, 바디 화이트 발란스 이득(body WB gain) 및 백그라운드 화이트 발란스 이득 (background WB gain)에 가중치를 믹스한 데이터와, 기반으로 얼굴 화이트 발란스 이득(face WB gain)에 가중치를 적용된 데이터를 종합하여 최종 화이트 발란스 이득(final WB gain)을 계산할 수 있다. 도 9는 다양한 실시예에 따른 이미지 화질 개선 방법을 도시한다. 도 9를 참조하면, 다양한 실시예에 따른 전자 장치의 프로세서(예: 도 1의 프로세서, 도 2의 이미지 시그 널 프로세서, 도 4의 ISP 모듈)은 910 동작에서, 카메라로부터 원본 이미지를 수신할 수 있다. 원본 이미지(또는 로우 데이터(raw data), 미가공 이미지 데이터)는 베이어 패턴(bayer pattern) 데이터 또는 RGB 데 이터를 포함할 수 있다. 920 동작에서, 프로세서는 원본 이미지에 세그먼테이션을 수행하여 세그먼테이션 정보를 획득할 수 있다. 일 실시예에 따르면, 프로세서는 이미지(또는 이미지에 대응하는 프레임) 속의 객체들을 픽셀 단위 또는 영역 단위로 분할하여 속성값을 할당하고, 객체들을 인식하여 분류(또는 식별)하는 세그먼테이션 맵 (segmentation map)을 구성할 수 있다. 세그먼테이션 정보는 이미지에 포함된 객체 인식 정보(또는 객체 분류 정보), 인식된 객체들의 위치 정보(또는 픽셀 좌표 정보) 및 객체 속성에 관한 정보를 포함하며, 객체에 관한 모든 정보가 해당될 수 있다. 930 동작에서, 프로세서는 원본 이미지와 세그먼테이션 정보를 이용하여 객체들의 분할 영역(또는 객체 영 역)을 확인할 수 있다. 일 실시예에 따르면, 프로세서는 객체 별 위치 정보를 기반으로 이미지 속에서 각 객체의 분할 영역(또는 객체 영역)을 확인할 수 있다. 940 동작에서, 프로세서는 분할 영역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산할 수 있다. 일 실시예에 따르면, 프로세서는 원본 이미지와 이미지의 세그먼테이션 정보를 기반으로 인식된 객체가 이 미지 처리 객체로서 유효한지를 분석하고 객체 색상에 대한 신뢰도(또는 색상의 정확도)를 추정할 수 있다. 일 실시예에 따르면, 프로세서는 이미지에서 인식된 객체의 세그먼테이션 정보를 기반으로 타겟 객체(예: skin 객체)가 위치한 분할 영역의 픽셀 데이터를 HSV(hue, saturation and value) 색공간의 색조값들로 변환하 고, 색상의 히스토그램에 기반하여 최소값, 최대값 및 평균값의 분포를 확인하여 객체 색상(또는 색온도)을 결 정할 수 있다. 일 실시예에 따르면, 프로세서는 객체가 유효한 객체로서 분석되는 경우, 원본 데이터에 포함된 색상 정보 와, 세그먼테이션 정보를 통해 분석된 객체 색상을 비교하여 객체 색상의 신뢰도를 판단할 수 있다. 프로세서 는 세그먼테이션 정보에서 객체 색상의 신뢰도(또는 색상의 정확도)가 원본 이미지 내에서의 객체 색상과 비교하여 지정된 값 이상(또는 신뢰도가 높으면)이면, 세그먼테이션 정보의 객체 색상으로 결정하고, 세그먼테 이션 정보에서 객체 색상이 지정된 값 이하(또는 신뢰도가 떨어지면)이면, 이미지 속의 다른 유사한 객체에 대 한 객체 색상 또는 이미지의 장면과 관련된 유사 환경을 분석하여 획득한 객체 색상으로 지정할 수 있다. 일 실시예에 따르면, 프로세서는 세그먼테이션 정보에서 객체 색상의 신뢰도가 제1 값 과 제2 값 사이이면, 세그먼테이션 정보와 원본 이미지에서의 객체 색상을 믹스하여 객체 색상을 지정할 수 있다. 프로세서는 각 분할 영역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산할 수 있다. 어떤 실시예에 따르면, 프로세서는 세그먼테이션 정보를 기반으로 분류된 객체 별로 서로 다른 이미지 처 리를 수행할 경우 객체 별로 결정된 이미지 치 처리에 대응하여 화질 제어값을 다르게 계산할 수 있다. 950 동작에서, 프로세서는 객체의 분할 영역 별로 계산된 화질 제어값을 기반으로 1차 이미지 처리를 수행 할 수 있다. 일 실시예에 따르면, 프로세서는 이미지 처리 모듈(예: ISP pipeline)을 제어하여 이미지 처리를 수행할 수 있다. 예를 들어, 프로세서는 이미지의 제1 객체 영역에 제1 객체의 화질 제어값을 기반으로 이미지 처 리하는 제1 동작, 제2 객체 영역에 제2 객체의 화질 제어값을 기반으로 이미지 처리를 수행하는 제2 동작 및, 제1 객체 영역 및 제2 객체 영역을 제외한 객체 외 영역에 이미지 처리를 수행하는 제3 동작을 포함하여 1차 이 미지 처리를 수행할 수 있다. 960 동작에서, 프로세서는 객체 별 가중치를 계산할 수 있다. 일 실시예에 따르면, 프로세서는 1차 이미지 처리된 결과 데이터 및 세그먼테이션 정보를 기반으로 이미지 처리에 대한 가중치를 계산할 수 있다. 일 실시예에 따르면, 프로세서는 객체 밝기 정보, 객체 색상(색온도) 정보, 객체 이동 정보(예: 속도, 이 동), 객체 색상의 신뢰도, 거리 정보, 크기 정보, 세그먼테이션 비중, 이미지속 객체 분할영역 별 가중치 정보 중 적어도 하나를 기반으로 객체 별 가중치를 결정할 수 있다. 970 동작에서, 프로세서는 가중치 및 객체 별 화질 제어값을 기반으로 원본 이미지에 대한 최종 화질 제어 값을 계산할 수 있다. 980 동작에서, 프로세서는 최종 화질 제어값이 2차 이미지 처리에 반영되도록 이미지 처리 모듈로 최종 화 질 제어값을 전달(또는 피드백)할 수 있다. 일 실시예에 따르면, 프로세서는 이미지 처리 모듈을 통해 최종 화질 제어값을 이용하여 원본 이미지를 처 리하여 보정 이미지를 생성할 수 있다. 다양한 실시예에 따른 전자 장치에서 이미지의 화질을 개선하는 방법은, 카메라로부터 원본 이미지를 수신하는 동작, 상기 원본 이미지에 대해 이미지 세그먼테이션을 수행하여 세그먼테이션 정보를 획득하는 동작, 상기 세 그먼테이션 정보를 이용하여 상기 원본 이미지에서 분류된 객체들의 분할 영역을 확인하는 동작, 상기 분할 영 역의 객체 색상을 기반으로 객체 별 화질 제어값을 계산하는 동작, 객체 별로 상기 계산된 화질 제어값을 기반 으로 상기 이미지 처리 모듈을 통해 1차 이미지 처리를 수행하는 동작, 상기 1차 이미지 처리된 결과를 분석하 여 객체 별 가중치를 계산하는 동작, 상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어값을 산출하는 동작 및 상기 최종 화질 제어값을 기반으로 상기 원본 이미지에 2차 이미지 처리 를 수행하여 보정이미지를 생성하는 동작을 포함할 수 있다. 일 실시예에 따르면 세그먼테이션 정보를 획득하는 동작은, 이미지 세그먼테이션을 수행하여 상기 원본 이미지 속에서 인식된 객체들 분류하고, 세그먼테이션 맵(segmentation map)을 구성하는 동작 및 센서 모듈로부터 획득 한 센서 정보를 기반으로 객체 모션 추정을 수행하여 세그먼테이션 수행 시간과, 이미지 처리 모듈에서 이미지 처리에 소요되는 시간과의 지연 데이터를 계산하고, 상기 지연 데이터에 기반하여 상기 세그먼테이션 맵을 조정 하는 동작을 더 포함하는 동작을 더 포함할 수 있다. 일 실시예에 따르면 상기 객체 별 화질 제어값을 계산하는 동작은, 상기 객체의 분할 영역 별로 객체 색상을 결 정하고, 상기 객체 색상을 기초로, 상기 분류된 객체들이 이미지 처리를 위한 객체로서 유효한지를 결정하고, 이미지 처리를 위한 객체로서 유효한 경우, 각 객체의 화질제어값을 계산하는 것을 특징으로 할 수 있다. 일 실시예에 따르면 상기 객체 별 화질 제어값을 계산하는 동작은, 상기 세그먼테이션 정보를 통해 분류된 객체 가 이미지 처리를 위한 객체로서 유효한 경우, 상기 세그먼테이션 맵에 포함된 객체의 분할 영역의 픽셀데이터 를 색공간 데이터로 변경하고, 상기 객체의 색상 또는 색온도를 결정하고, 상기 원본 이미지에서 상기 객체가 위치한 영역의 색상과 비교하여 상기 객체 색상의 신뢰도를 추정하는 동작 및 상기 신뢰도를 이용하여 결정된 객체 색상을 기반으로 상기 객체의 화질제어값을 조정하는 동작을 더 포함할 수 있다. 일 실시예에 따르면 상기 신뢰도를 이용하여 결정된 객체 색상을 기반으로 상기 객체의 화질제어값을 조정하는 동작은, 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 원본 이미지 내에서의 객체 색상과 비교하여 지정된 제1값 이상이면, 세그먼테이션 정보의 객체 색상으로 결정하고, 상기 세그먼테이션 정보에서 객체 색상 의 신뢰도가 지정된 제2 값 이하면, 이미지 속의 다른 유사한 객체에 대한 객체 색상 또는 상기 원본 이미지의 장면과 관련된 유사 환경을 분석하여 획득한 객체 색상으로 지정하는 동작 및 상기 세그먼테이션 정보에서 객체 색상의 신뢰도가 상기 제1 값 과 상기 제2 값 사이이면, 세그먼테이션 정보와 원본 이미지에서의 객체 색상을 믹스하여 상기 객체 색상을 지정하는 동작을 더 포함할 수 있다. 상기 객체 별 가중치를 계산하는 동작은, 상기 1차 이미지 처리된 결과 데이터를 기반으로 이미지의 장면 상황 을 분석하고, 분석 결과에 따라 상기 가중치를 조절하는 동작을 더 포함할 수 있다. 일 실시예에 따르면 상기 가중치 및 객체 별 화질 제어값을 기반으로 상기 원본 이미지에 대한 최종 화질 제어 값을 산출하는 동작은 상기 세그먼테이션 정보를 기반으로 분류된 객체 별로 서로 다른 이미지 처리 시 객체 별 로 결정된 이미치 처리에 대응하여 화질 제어값을 다르게 계산하는 동작을 더 포함할 수 있다. 본 문서의 다양한 실시예들에서 사용된 용어 \"모듈\"은 하드웨어, 소프트웨어 또는 펌웨어로 구현된 유닛을 포함 할 수 있으며, 예를 들면, 로직, 논리 블록, 부품, 또는 회로와 같은 용어와 상호 호환적으로 사용될 수 있다. 모듈은, 일체로 구성된 부품 또는 하나 또는 그 이상의 기능을 수행하는, 상기 부품의 최소 단위 또는 그 일부가 될 수 있다. 예를 들면, 일 실시예에 따르면, 모듈은 ASIC(application-specific integrated circuit)의 형 태로 구현될 수 있다. 본 문서의 다양한 실시예들은 기기(machine)(예: 전자 장치) 의해 읽을 수 있는 저장 매체(storage medium)(예: 내장 메모리 또는 외장 메모리)에 저장된 하나 이상의 명령어들을 포함하는 소프트웨어 (예: 프로그램)로서 구현될 수 있다. 예를 들면, 기기(예: 전자 장치)의 프로세서(예: 프로세서 )는, 저장 매체로부터 저장된 하나 이상의 명령어들 중 적어도 하나의 명령을 호출하고, 그것을 실행할 수 있다. 이것은 기기가 상기 호출된 적어도 하나의 명령어에 따라 적어도 하나의 기능을 수행하도록 운영되는 것 을 가능하게 한다. 상기 하나 이상의 명령어들은 컴파일러에 의해 생성된 코드 또는 인터프리터에 의해 실행될 수 있는 코드를 포함할 수 있다. 기기로 읽을 수 있는 저장 매체는, 비일시적(non-transitory) 저장 매체의 형 태로 제공될 수 있다. 여기서, ‘비일시적’은 저장 매체가 실재(tangible)하는 장치이고, 신호(signal)(예: 전 자기파)를 포함하지 않는다는 것을 의미할 뿐이며, 이 용어는 데이터가 저장 매체에 반영구적으로 저장되는 경 우와 임시적으로 저장되는 경우를 구분하지 않는다. 일 실시예에 따르면, 본 문서에 개시된 다양한 실시예들에 따른 방법은 컴퓨터 프로그램 제품(computer program product)에 포함되어 제공될 수 있다. 컴퓨터 프로그램 제품은 상품으로서 판매자 및 구매자 간에 거래될 수 있 다. 컴퓨터 프로그램 제품은 기기로 읽을 수 있는 저장 매체(예: compact disc read only memory(CD-ROM))의 형태로 배포되거나, 또는 어플리케이션 스토어(예: 플레이 스토어TM)를 통해 또는 두 개의 사용자 장치들(예: 스 마트 폰들) 간에 직접, 온라인으로 배포(예: 다운로드 또는 업로드)될 수 있다. 온라인 배포의 경우에, 컴퓨터 프로그램 제품의 적어도 일부는 제조사의 서버, 어플리케이션 스토어의 서버, 또는 중계 서버의 메모리와 같은 기기로 읽을 수 있는 저장 매체에 적어도 일시 저장되거나, 임시적으로 생성될 수 있다. 다양한 실시예들에 따르면, 상기 기술한 구성요소들의 각각의 구성요소(예: 모듈 또는 프로그램)는 단수 또는 복수의 개체를 포함할 수 있으며, 복수의 개체 중 일부는 다른 구성요소에 분리 배치될 수도 있다. 다양한 실시 예들에 따르면, 전술한 해당 구성요소들 중 하나 이상의 구성요소들 또는 동작들이 생략되거나, 또는 하나 이상 의 다른 구성요소들 또는 동작들이 추가될 수 있다. 대체적으로 또는 추가적으로, 복수의 구성요소들(예: 모듈 또는 프로그램)은 하나의 구성요소로 통합될 수 있다. 이런 경우, 통합된 구성요소는 상기 복수의 구성요소들 각각의 구성요소의 하나 이상의 기능들을 상기 통합 이전에 상기 복수의 구성요소들 중 해당 구성요소에 의해 수행되는 것과 동일 또는 유사하게 수행할 수 있다. 다양한 실시예들에 따르면, 모듈, 프로그램 또는 다른 구성 요소에 의해 수행되는 동작들은 순차적으로, 병렬적으로, 반복적으로, 또는 휴리스틱하게 실행되거나, 상기 동 작들 중 하나 이상이 다른 순서로 실행되거나, 생략되거나, 또는 하나 이상의 다른 동작들이 추가될 수 있다.도면 도면1 도면2 도면3a 도면3b 도면4 도면5 도면6a 도면6b 도면7 도면8 도면9"}
{"patent_id": "10-2022-0016048", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 다양한 실시 예들에 따른 네트워크 환경 내의 전자 장치의 블록도이다. 도 2는 다양한 실시예들에 따른, 카메라 모듈을 예시하는 블럭도이다. 도 3a은 일반적인 이미지 처리를 위한 블록도이다. 도 3b는 일반적인 얼굴 검출 처리 이미지를 예시한다. 도 4는 다양한 실시예에 따른 이미지 화질을 개선하도록 구성된 전자 장치의 구성을 도시한다. 도 5는 카메라에서 생성한 원본 이미지와, 세그먼테이션 정보를 예시한다. 도 6a는 다양한 실시예에 따른 이미지 화질 개선 방법을 도시한다. 도 6b은 도 6a의 객체 색상 신뢰도 결정 동작의 구체적인 동작들을 도시한다. 도 7은 일 실시예에 따른 세그먼테이션 정보를 이용하여 객체의 화질 제어값을 계산하는 동작의 예시를 도시한 다. 도 8은 일 실시예에 따른 세그먼테이션 정보를 이용하여 화이트 발란스 제어값을 계산하는 동작의 예시를 도시 한다. 도 9는 다양한 실시예에 따른 이미지 화질 개선 방법을 도시한다."}
