{"patent_id": "10-2021-0191962", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2022-0097313", "출원번호": "10-2021-0191962", "발명의 명칭": "API를 이용한 컨테이너 기반의 AutoML 방법, 장치 및 프로그램", "출원인": "(주)제이엘케이", "발명자": "김원태"}}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "컨테이너 기반으로 클라우드 또는 로컬 환경 등에 배포중인 부모 컨테이너(Parent container)에 추론API(Inference API)를 호출하여 입력 데이터에 대한 추론 결과를 얻는 추론 단계;상기 부모 컨테이너(Parent container)에 학습 API(Training API)를 호출하여 인공지능 모델을 학습하는 학습단계; 및상기 부모 컨테이너(Parent container)의 검증 API(Inference API)를 호출하여 상기 인공지능 모델에 대한 검증 결과를 얻는 검증 단계;를 포함하는 API를 이용한 컨테이너 기반의 AutoML 방법."}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 추론 단계는,상기 부모 컨테이너에 추론 API(Inference API)를 호출하여 입력 데이터에 대한 정확도, 분할 영역 및 분류 범주명을 포함하는 추론 결과를 얻는 API를 이용한 컨테이너 기반의 AutoML 방법."}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "청구항 1에 있어서,상기 학습 단계는,기존 인공지능 모델을 사용하여 일부 가중치(Weight)만 재학습하는 미세조정(Fine tuning) 방법 또는 초기부터새로 학습을 진행하는 전체학습(Whole training) 방법을 선택하여 인공지능 모델을 학습하는 API를 이용한 컨테이너 기반의 AutoML 방법."}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "청구항 3에 있어서,상기 학습 단계는,그래프 또는 시계열의 모니터링 도구를 제공하는 학습 모니터링 API(Training monitoring API)와, 학습이 완료된 후 생성된 가중치 데이터를 취득할 수 있는 가중치 API(Weight API)로 구성되는 자식 컨테이너(Childcontainer)에서, 상기 인공지능 모델을 관측하는 단계;를 더 포함하는 API를 이용한 컨테이너 기반의 AutoML 방법."}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "청구항 1 내지 청구항 4 중에서 어느 한 항에 따른 API를 이용한 컨테이너 기반의 AutoML 방법을 수행하는 프로그램이 기록된 컴퓨터 판독이 가능한 기록매체.공개특허 10-2022-0097313-3-청구항 6 컨테이너 기반으로 클라우드 또는 로컬 환경 등에 배포중이며, 입력 데이터에 대한 추론 결과를 얻는 추론API(Inference API), 인공지능 모델을 학습하는 학습 API(Training API) 및 상기 인공지능 모델에 대한 검증결과를 얻는 검증 API(Inference API)를 포함하는 부모 컨테이너(Parent container); 및그래프 또는 시계열의 모니터링 도구를 제공하는 학습 모니터링 API(Training monitoring API) 및 학습이 완료된 후 생성된 가중치 데이터를 취득할 수 있는 가중치 API(Weight API)로 구성되어, 상기 학습한 인공지능 모델을 관측하는 자식 컨테이너(Child container);를 포함하는 API를 이용한 컨테이너 기반의 AutoML 장치."}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "청구항 6에 있어서,상기 부모 컨테이너(Parent container)는,상기 추론 API(Inference API)를 호출하여 입력 데이터에 대한 정확도, 분할 영역 및 분류 범주명을 포함하는추론 결과를 얻는 API를 이용한 컨테이너 기반의 AutoML 장치."}
{"patent_id": "10-2021-0191962", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "청구항 6에 있어서,상기 부모 컨테이너(Parent container)는,상기 학습 API(Training API)를 호출하여, 기존 인공지능 모델을 사용하여 일부 가중치(Weight)만 재학습하는미세조정(Fine tuning) 방법 또는 초기부터 새로 학습을 진행하는 전체학습(Whole training) 방법을 선택하여인공지능 모델을 학습하는 API를 이용한 컨테이너 기반의 AutoML 장치."}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 API를 이용한 컨테이너 기반의 AutoML 방법, 장치 및 프로그램에 관한 것으로, 본 발명에 따른 API를 이용한 컨테이너 기반의 AutoML 방법은 컨테이너 기반으로 클라우드 또는 로컬 환경 등에 배포중인 부모 컨테이 너(Parent container)에 추론 API(Inference API)를 호출하여 입력 데이터에 대한 추론 결과를 얻는 추론 단계; 상기 부모 컨테이너(Parent container)에 학습 API(Training API)를 호출하여 인공지능 모델을 학습하는 학습 단계; 및 상기 부모 컨테이너(Parent container)의 검증 API(Inference API)를 호출하여 상기 인공지능 모델에 대한 검증 결과를 얻는 검증 단계;를 포함하여 구성된다."}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 API를 이용한 컨테이너 기반의 AutoML 방법, 장치 및 프로그램에 관한 것으로, 보다 구체적으로 본 발명은 컨테이너 기반으로 배포되어 있는 인공지능 모델에서 API(Application Programming Interface) 호출을 통해 추론, 검증, 학습을 수행하고, 학습 결과를 확인 및 취득할 수 있는 자식 컨테이너 생성을 통해 인공지능 모델의 추론 성능을 관리할 수 있는, API를 이용한 컨테이너 기반의 AutoML 방법, 장치 및 프로그램에 관한 것 이다."}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "AutoML은 인공지능 모델을 학습하고 평가할 때 모델과 연관된 다양한 초매개변수(hyper parameter)들을 실험하 고 성능을 비교하여 최상의 성능을 갖는 모델을 찾는 과정을 자동화하는 문제이다. 종래에는 사람이 직접 초매개변수들의 값을 조정해가면서 최상의 성능을 갖는 모델을 탐색하였으나, AutoML의 등장으로 해당 과정을 자동화할 수 있게 되었다. 그러나 현재까지 AutoML 방법은 인공지능 모델의 배포 측면에서는 고려되지 않았기 때문에 클라우드 등의 환경 에서 실시간으로 배포를 하는 동시에 모델의 추론 성능을 향상시키기 위한 학습을 진행하여 지속적으로 모델이 최상의 성능을 갖도록 갱신하고 배포하는 전체 과정을 자동화하는 것이 어렵다는 한계를 지니고 있다.따라서 구성 및 관리가 간편하면서도 다양한 환경에서 적용할 수 있는 새로운 기법의 개발이 필요하다. 선행기술문헌 특허문헌 (특허문헌 0001) 특허문헌 1: 공개특허공보 제10-2021-0032521호(2021.03.24)"}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 전술한 문제를 해결하기 위해 안출된 것으로서, 본 발명은 배포 환경에서 AutoML을 적용하여 지속적 으로 인공지능 모델의 추론 성능을 향상시키고, 추론, 검증, 학습 과정을 모니터링할 수 있는 일련의 자동화된 프로세스를 구축하기 위한 새로운 컨테이너 기반의 AutoML 기법을 제공하고자 한다. 또한, 본 발명은 상기 방법을 클라우드, 로컬 등 다양한 환경에서 쉽게 시행할 수 있도록 API 기반의 자동화 소 프트웨어를 개발하여 제공하고자 한다."}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 문제를 해결하기 위한 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 방법은, 컨테이 너 기반으로 클라우드 또는 로컬 환경 등에 배포중인 부모 컨테이너(Parent container)에 추론 API(Inference API)를 호출하여 입력 데이터에 대한 추론 결과를 얻는 추론 단계; 상기 부모 컨테이너(Parent container)에 학 습 API(Training API)를 호출하여 인공지능 모델을 학습하는 학습 단계; 및 상기 부모 컨테이너(Parent container)의 검증 API(Inference API)를 호출하여 상기 인공지능 모델에 대한 검증 결과를 얻는 검증 단계;를 포함하여 구성된다. 본 발명의 다른 일실시예에 따르면, 상기 추론 단계는 상기 부모 컨테이너에 추론 API(Inference API)를 호출하 여 입력 데이터에 대한 정확도, 분할 영역 및 분류 범주명을 포함하는 추론 결과를 얻을 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 학습 단계는 기존 인공지능 모델을 사용하여 일부 가중치(Weight)만 재학습하는 미세조정(Fine tuning) 방법 또는 초기부터 새로 학습을 진행하는 전체학습(Whole training) 방법을 선택하여 인공지능 모델을 학습할 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 학습 단계는 그래프 또는 시계열의 모니터링 도구를 제공하는 학습 모 니터링 API(Training monitoring API)와, 학습이 완료된 후 생성된 가중치 데이터를 취득할 수 있는 가중치 API(Weight API)로 구성되는 자식 컨테이너(Child container)에서, 상기 인공지능 모델을 관측하는 단계;를 더 포함하여 구성될 수 있다. 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 장치는 컨테이너 기반으로 클라우드 또는 로 컬 환경 등에 배포중이며, 입력 데이터에 대한 추론 결과를 얻는 추론 API(Inference API), 인공지능 모델을 학 습하는 학습 API(Training API) 및 상기 인공지능 모델에 대한 검증 결과를 얻는 검증 API(Inference API)를 포함하는 부모 컨테이너(Parent container); 및 그래프 또는 시계열의 모니터링 도구를 제공하는 학습 모니터링 API(Training monitoring API) 및 학습이 완료된 후 생성된 가중치 데이터를 취득할 수 있는 가중치 API(Weight API)로 구성되어, 상기 학습한 인공지능 모델을 관측하는 자식 컨테이너(Child container);를 포함 하여 구성된다. 본 발명의 다른 일실시예에 따르면, 상기 부모 컨테이너(Parent container)는 상기 추론 API(Inference API)를 호출하여 입력 데이터에 대한 정확도, 분할 영역 및 분류 범주명을 포함하는 추론 결과를 얻을 수 있다. 본 발명의 다른 일실시예에 따르면, 상기 부모 컨테이너(Parent container)는 상기 학습 API(Training API)를 호출하여, 기존 인공지능 모델을 사용하여 일부 가중치(Weight)만 재학습하는 미세조정(Fine tuning) 방법 또는초기부터 새로 학습을 진행하는 전체학습(Whole training) 방법을 선택하여 인공지능 모델을 학습할 수 있다."}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 클라우드 환경, 로컬 환경 등 다양한 환경 하에서 인공지능 모델의 추론 성능을 자동으로 개선하는 새로운 AutoML 방법을 제공하며, 실제 인공지능 모델 배포 환경에서 추론, 검증, 학습 및 배포에 이르기까지 전 과정에 대한 자동화 환경을 구축하는데 널리 활용될 수 있다. 본 발명에 따르면 현재 인공지능 모델 성능 개선 자동화에 머무르는 AutoML 방법에 컨테이너화 및 API 적용하여 유연한 배포환경 및 간편한 접근을 통해 기존에 모델 재학습시 발생하는 검증 및 재배포 단계를 자동화함으로써 최소의 자원으로 추론 성능을 개선하는데 도움을 줄 수 있다. 또한, 본 발명에 따르면 자식 컨테이너를 이용하여 전체 부모 컨테이너들의 성능을 향상시킬 수 있으므로 의료, 자율주행 등 여러 분야에 있어 폭넓게 적용될 수 있다."}
{"patent_id": "10-2021-0191962", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명은 다양한 변환을 가할 수 있고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들을 도면에 예시하고 상세한 설명에 상세하게 설명하고자 한다. 그러나, 이는 본 발명을 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 발명의 사상 및 기술 범위에 포함되는 모든 변환, 균등물 내지 대체물을 포함하는 것으로 이해되어 야 한다. 다만, 실시형태를 설명함에 있어서, 관련된 공지 기능 혹은 구성에 대한 구체적인 설명이 본 발명의 요지를 불 필요하게 흐릴 수 있다고 판단되는 경우 그에 대한 상세한 설명은 생략한다. 또한, 도면에서의 각 구성요소들의 크기는 설명을 위하여 과장될 수 있으며, 실제로 적용되는 크기를 의미하는 것은 아니다. 또한, 명세서 전체에서, 일 구성요소가 다른 구성요소와 \"연결된다\" 거나 \"접속된다\" 등으로 언급된 때에는, 상 기 일 구성요소가 상기 다른 구성요소와 직접 연결되거나 또는 직접 접속될 수도 있지만, 특별히 반대되는 기재 가 존재하지 않는 이상, 중간에 또 다른 구성요소를 매개하여 연결되거나 또는 접속될 수도 있다고 이해되어야 할 것이다. 또한, 명세서 전체에서, 어떤 부분이 어떤 구성요소를 \"포함\"한다고 할 때, 이는 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있는 것을 의미한다. 본 발명은 다양한 환경에서 AutoML을 사용할 수 있도록 API가 적용된 컨테이너 기반의 AutoML 방법을 제공하기 위한 것으로, 본 발명의 용어 \"AutoML\"이란, 인공지능 모델을 학습하고 평가할 때 모델과 연관된 다양한 초매개 변수(hyper parameter)들을 실험하고 성능을 비교하여 최상의 성능을 갖는 모델을 찾는 과정을 자동화하는 문제 이다. 또한, 본 발명의 용어 \"컨테이너\"란, 애플리케이션을 관련 라이브러리 및 종속 항목과 함께 패키지로 묶어 소프 트웨어 서비스 구동을 위한 격리 환경을 마련하는 방법이다. 컨테이너는 패키지로 묶어 격리된 환경에서 동작하 기 때문에 빠른 배포가 가능한 동시에 이식성이 우수하고, 애플리케이션 생명주기 관리를 자동화할 수 있다. 또한, 본 발명의 용어 \"API(Application Programming Interface)\"란, 응용 프로그램에서 사용할 수 있도록 운 영 체제나 프로그래밍 언어가 제공하는 기능을 제어할 수 있게 만든 인터페이스이다. 도 1은 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 장치의 구성을 설명하기 위한 도면이 다. 이후부터는 도 1을 참조하여 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 장치의 구성을 설명하기로 한다. 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 장치는 부모 컨테이너(Parent container: 100)와 자식 컨테이너(Child container: 200)를 포함하여 구성된다. 상기 부모 컨테이너는 컨테이너 기반으로 클라우드 또는 로컬 환경 등에 배포중인 구성으로서, 보다 구체 적으로 상기 부모 컨테이너는 추론 API(Inference API: 110), 학습 API(Training API: 120) 및 검증 API(Inference API: 130)를 포함하여 구성된다. 상기 추론 API는 입력 데이터에 대한 추론 결과를 얻으며, 상기 학습 API는 인공지능 모델을 학습하 며, 상기 검증 API는 상기 인공지능 모델에 대한 검증 결과를 얻는다. 상기 부모 컨테이너(Parent container: 100)는 상기 추론 API(Inference API: 110)를 호출하여 입력 데이터에 대한 정확도, 분할 영역 및 분류 범주명을 포함하는 추론 결과를 얻을 수 있다. 또한, 상기 부모 컨테이너(Parent container: 100)는 상기 학습 API(Training API: 120)를 호출하여, 기존 인 공지능 모델을 사용하여 일부 가중치(Weight)만 재학습하는 미세조정(Fine tuning) 방법 또는 초기부터 새로 학 습을 진행하는 전체학습(Whole training) 방법을 선택하여 인공지능 모델을 학습할 수 있다. 한편, 상기 자식 컨테이너(Child container: 200)는 그래프 또는 시계열의 모니터링 도구를 제공하는 학습 모니 터링 API(Training monitoring API: 210) 및 학습이 완료된 후 생성된 가중치 데이터를 취득할 수 있는 가중치 API(Weight API: 220)로 구성되어, 상기 학습한 인공지능 모델을 관측한다. 이와 같이, 상기 자식 컨테이너 또한 API와 컨테이너로 구성되어 있기 때문에 여러 종말점(Endpoint)에서 접근이 가능하며, 이를 통해 특정 부모 컨테이너의 인공지능 추론 성능이 최상을 달성하였을 때 해당 모델의 자 식 컨테이너 API를 이용하여 나머지 부모 컨테이너도 해당 인공지능 모델로 갱신하여 전체 컨테이너가 항상 최 상의 성능을 유지할 수 있도록 구성할 수 있다. 한편, 새롭게 학습이 완료된 인공지능 모델의 경우 이전의 모델보다 성능이 개선되지 않을 수 있다. 따라서 성 능이 저하된 모델로 갱신되는 것을 방지하기 위해 검증 API를 적용한다. 상기 검증 API는 특정 성능 지표를 달성하였는지 검증하는 유닛 테스트(Unit test) 등 여러가지 검증 방법을 포함할 수 있다. 컨테이너 기 반으로 클라우드 또는 로컬 환경 등에 배포중인 부모 컨테이너(Parent container: 100)에 검증 API(Inference API: 130)를 호출하여 입력 데이터에 대한 검증 결과를 얻는다. 도 2 내지 도 5는 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 방법을 설명하기 위한 도면 이다. 이후부터는 도 2 내지 도 5를 참조하여 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 방법 을 설명하기로 한다. 먼저, 도 2를 참조하면 컨테이너 기반으로 클라우드 또는 로컬 환경 등에 배포중인 부모 컨테이너(Parent container: 100)에 추론 API(Inference API: 110)를 호출하여 입력 데이터에 대한 추론 결과를 얻는다. 이때, 상기 부모 컨테이너에 추론 API(Inference API)를 호출하여 입력 데이터에 대한 정확도, 분할 영역 및 분류 범주명을 포함하는 추론 결과를 얻을 수 있으며, 추론 결과는 정확도, 분할 영역, 분류 범주명 등 다양 하게 정의할 수 있다. 이후, 도 3을 참조하면 상기 부모 컨테이너(Parent container: 100)에 학습 API(Training API: 120)를 호출하 여 인공지능 모델을 학습시킨다. 이때, 학습은 기존 인공지능 모델을 사용하여 일부 가중치(Weight)만 재학습하는 미세조정(Fine tuning) 방법과 초기부터 새로 학습을 진행하는 전체학습(Whole training) 방법을 선택하여 수행할 수 있다. 학습 API의 결과는 자식 컨테이너(Child container: 200)로 반환되는데, 자식 컨테이너는 학습 과정을 관 측할 수 있도록 그래프, 시계열 등 다양한 모니터링 도구를 제공하는 학습 모니터링 API(Training monitoring API: 210)와 학습이 완료된 후 생성된 가중치 데이터를 취득할 수 있는 가중치 API(Weight API: 220)로 구성된 다. 도 4를 참조하면, 자식 컨테이너 또한 API를 포함하는 컨테이너로 구성되어 있기 때문에 여러 종말점 (Endpoint)에서 접근이 가능하며, 이를 통해 특정 부모 컨테이너의 인공지능 추론 성능이 최상을 달성하였을 때 해당 모델의 자식 컨테이너 API를 이용하여 나머지 부모 컨테이너도 해당 인공지능 모델로 갱신하여 전체 컨테 이너가 항상 최상의 성능을 유지할 수 있도록 구성할 수 있다. 또한, 도 5에서와 같이 상기 부모 컨테이너(Parent container: 100)의 검증 API(Inference API: 130)를 호출하 여 상기 인공지능 모델에 대한 검증 결과를 얻는다. 새롭게 학습이 완료된 인공지능 모델의 경우 이전의 모델보다 성능이 개선되지 않을 수 있다. 따라서 성능이 저 하된 모델로 갱신되는 것을 방지하기 위해 검증 API를 적용한다. 검증 API는 특정 성능 지표를 달성하였는지 검증하는 유닛 테스트(Unit test) 등 여러가지 검증 방법을 포 함할 수 있다. 컨테이너 기반으로 클라우드 또는 로컬 환경 등에 배포중인 부모 컨테이너(Parent container: 100)에 검증 API(Inference API: 130)를 호출하여 입력 데이터에 대한 검증 결과를 얻는다. 전술한 바와 같은 본 발명의 상세한 설명에서는 구체적인 실시예에 관해 설명하였다. 그러나 본 발명의 범주에 서 벗어나지 않는 한도 내에서는 여러 가지 변형이 가능하다. 본 발명의 기술적 사상은 본 발명의 전술한 실시 예에 국한되어 정해져서는 안 되며, 청구범위뿐만 아니라 이 청구범위와 균등한 것들에 의해 정해져야 한다."}
{"patent_id": "10-2021-0191962", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 장치의 구성을 설명하기 위한 도면이 다. 도 2 내지 도 5는 본 발명의 일실시예에 따른 API를 이용한 컨테이너 기반의 AutoML 방법을 설명하기 위한 도면 이다."}
