{"patent_id": "10-2013-0162160", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2015-0074402", "출원번호": "10-2013-0162160", "발명의 명칭": "전자 장치 및 그 동작 방법", "출원인": "삼성전자주식회사", "발명자": "김정현"}}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "메인 디스플레이를 포함하는 본체와 전기적 또는 기능적으로 연결된 서브 디스플레이를 탑재한 커버를 포함하는전자 장치의 제어 방법에 있어서,상기 커버의 개폐에 따른 상기 커버의 배치 위치를 검출하는 과정; 및상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정을 포함하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 닫힌 위치에 있는 경우, 상기 메인 디스플레이를 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 닫힌 위치에 있는 경우, 상기 커버에서 상기 메인 디스플레이와 마주하는 일면에 배치된 상기 서브디스플레이를 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 닫힌 위치에 있는 경우, 상기 커버의 노출면에 배치된 상기 서브 디스플레이를 활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체에 중첩 배치되지 않는 경우, 상기 메인 디스플레이를 활성화하는 제어방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제 1항에 있어서,공개특허 10-2015-0074402-3-상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체에 중첩 배치되지 않는 경우, 상기 서브 디스플레이를 활성화하거나 또는 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체에 중첩 배치되는 경우, 상기 메인 디스플레이를 활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체에 중첩 배치되는 경우, 상기 커버에서 상기 본체에 마주하는 일면에 배치된상기 서브 디스플레이를 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체에 중첩 배치되는 경우, 상기 커버의 노출면에 배치된 상기 서브 디스플레이를 활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체 아래에 중첩 배치되는 경우, 상기 메인 디스플레이를 활성화하고 상기 서브디스플레이를 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 열린 상태로 상기 본체 위에 중첩 배치되는 경우, 상기 메인 디스플레이를 비활성화하고, 상기 커버의 노출면에 배치된 상기 서브 디스플레이를 활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제 1항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,공개특허 10-2015-0074402-4-상기 메인 디스플레이와 상기 서브 디스플레이가 모두 활성화된 경우, 적어도 하나의 콘텐츠를 상기 메인 디스플레이와 상기 서브 디스플레이로 분담하여 표시하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제 1항에 있어서,상기 본체는 상기 메인 디스플레이와 중첩 배치되는 적어도 하나의 터치 감지 모듈을 더 포함하고,상기 커버의 배치 위치에 대응하여 상기 적어도 하나의 터치 감지 모듈을 제어하는 과정을 더 포함하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제 13항에 있어서,상기 커버의 배치 위치에 대응하여 상기 적어도 하나의 터치 감지 모듈을 제어하는 과정은,상기 커버가 닫힌 위치에 있는 경우, 상기 적어도 하나의 터치 감지 모듈을 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제 13항에 있어서,상기 커버의 배치 위치에 대응하여 상기 적어도 하나의 터치 감지 모듈을 제어하는 과정은,상기 커버가 닫힌 위치에 있는 경우, 상기 적어도 하나의 터치 감지 모듈의 근접 터치 감지 기능을 활성화하는제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제 15항에 있어서,상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정은,상기 커버가 닫힌 위치에 있는 경우, 상기 커버의 노출면에 배치된 상기 서브 디스플레이를 활성화하고,상기 적어도 하나의 터치 감지 모듈의 근접 터치 감지 기능을 통하여 감지된 터치에 반응하여 해당 콘텐츠를 상기 서브 디스플레이를 통하여 출력하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제 13항에 있어서,상기 커버의 배치 위치에 대응하여 상기 터치 감지 모듈을 제어하는 과정은,상기 커버가 열린 상태로 상기 본체 위에 중첩 배치되는 경우, 상기 터치 감지 모듈을 비활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제 13항에 있어서,상기 커버의 배치 위치에 대응하여 상기 적어도 하나의 터치 감지 모듈을 제어하는 과정은,공개특허 10-2015-0074402-5-상기 커버가 열린 상태로 상기 본체 아래에 배치되는 경우, 상기 터치 감지 모듈을 활성화하는 제어 방법."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "전자 장치에 있어서,메인 디스플레이를 포함하는 본체;상기 본체와 전기적 또는 기능적으로 연결되어 상기 메인 디스플레이의 적어도 일부를 덮을 수 있는 커버;상기 커버에 배치된 서브 디스플레이;상기 커버의 개폐에 관한 검출 데이터를 획득하기 위한 센서 모듈;상기 센서 모듈로부터의 상기 검출 데이터로부터 상기 커버의 배치 위치를 결정하고, 상기 커버의 배치 위치에따라 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하기 위한 프로세서를 포함하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제 19항에 있어서,상기 커버의 배치 위치는,상기 커버가 닫힌 상태로 상기 본체의 아래 또는 위에 중첩 배치되는 위치, 상기 커버가 열린 상태로 상기 본체에 중첩 배치되지 않는 위치 또는 상기 커버가 열린 상태로 상기 본체의 아래 또는 위에 중첩 배치되는 위치 중적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제 19항에 있어서,상기 본체는 상기 메인 디스플레이에 중첩 배치되는 적어도 하나의 터치 감지 모듈을 더 포함하고,상기 프로세서는 상기 커버의 배치 위치에 따라 상기 적어도 하나의 터치 감지 모듈을 제어하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제 21항에 있어서,상기 프로세서는,상기 커버가 닫힌 위치에 있는 경우, 상기 커버의 노출면에 배치된 상기 서브 디스플레이를 활성화하고, 상기적어도 하나의 터치 감지 모듈의 근접 터치 감지 기능(hovering)을 활성화하며, 상기 근접 터치 감지 기능을 통하여 감지된 터치에 반응하여 해당하는 콘텐츠를 상기 서브 디스플레이를 통하여 출력하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제 22항에 있어서,상기 프로세서는,기 설정된 적어도 하나의 이벤트가 발생된 경우, 상기 근접 터치 감지 기능을 통한 콘텐츠 출력을 제어하는 전자 장치.공개특허 10-2015-0074402-6-청구항 24 제 23항에 있어서,상기 적어도 하나의 이벤트는,상기 전자 장치의 기 설정된 움직임, 기 설정된 버튼의 누름 및 스타일러스(stylus)의 분리 중 적어도 하나를포함하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제 21항에 있어서,상기 프로세서는,상기 커버의 배치 위치에 따라 상기 적어도 하나의 터치 감지 모듈에 의한 터치 감지용 정전용량을 조절하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제 21항에 있어서,상기 프로세서는,상기 커버의 배치 위치에 따라 상기 적어도 하나의 터치 감지 모듈에 의한 터치 인식 감도를 조절하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제 19항에 있어서,상기 센서 모듈은 다수의 위치에서 주변 밝기를 검출하고, 상기 프로세서는 주변 밝기들 사이의 비교 결과에 따라 상기 커버의 배치 위치를 결정하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제 19항에 있어서,상기 센서 모듈은 피사체에 관한 이미지 데이터를 획득하고,상기 프로세서는 상기 이미지 데이터로부터 얼굴 인식 여부에 따라 상기 커버의 배치 위치를 결정하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제 19항에 있어서,상기 센서 모듈은,제스처 센서, 근접 센서, 그립 센서, 자이로 센서, 가속도 센서, 지자기 센서, 기압 센서, 온/습도 센서, 홀 센서, RGB 센서, 조도 센서, 생체 센서, UV 센서, 또는 이미지 센서 중 적어도 하나를 포함하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "공개특허 10-2015-0074402-7-제 19항에 있어서,상기 메인 디스플레이 또는 상기 서브 디스플레이는,LCD(liquid-crystal display), AM-OLED(active-matrix organic light-emitting diode) 및 E-ink(Electrophoretic Ink) 중 하나를 포함하는 전자 장치."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 메인 디스플레이를 포함하는 본체와 전기적 또는 기능적으로 연결된 서브 디 스플레이를 탑재한 커버를 포함하는 전자 장치의 제어 방법은, 상기 커버의 개폐에 따른 상기 커버의 배치 위치 를 검출하는 과정 및 상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제 어하는 과정을 포함할 수 있다. 다양한 다른 실시예들이 가능하다."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 디스플레이를 탑재한 커버의 개폐에 따라 표시를 제어하는 전자 장치 및 그 동작 방 법에 관한 것이다."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "현재 전자 통신 산업의 발달로 말미암아 사용자 기기(예: 셀룰러폰, 전자수첩, 개인 복합 단말기, 랩 탑 컴퓨터 등의 전자 장치)는 현대사회의 필수품이 되어가면서, 빠르게 변화하는 정보 전달의 중요한 수단이 되고 있다. 이러한 사용자 기기는 터치스크린을 이용한 GUI(Graphical User Interface) 환경을 통해 사용자의 작업을 편리 하게 하고, 웹 환경을 기반으로 하는 다양한 멀티 미디어들을 제공하기에 이르렀다. 또한, 사용자 기기는 다양한 기능을 제공하기 위해서, 다양한 전자 부품들을 탑재하고 있다. 예를 들자면, 사용 자 기기는 스타일러스를 탑재하여, 글쓰기 또는 그리기 기능을 제공하고 있다. 또는, 사용자 기기는 스테레오 스피커 모듈을 탑재하여, 스테레오(stereo) 음향을 이용한 음악 감상 기능을 제공하고 있다. 또는, 사용자 기기 는 카메라 모듈을 탑재하여, 사진 촬영 기능을 제공하고 있다. 또는, 사용자 기기는 통신 모듈을 탑재하여, 네 트워크를 통한 다른 전자 기기와의 통신 기능을 제공하고 있다."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명의 다양한 실시예는 전자적 커버에 탑재된 디스플레이를 이용하여 콘텐츠의 표시를 확장할 수 있다. 본 발명의 다양한 실시예는 디스플레이를 탑재한 커버의 개폐 상태에 따라 커버의 디스플레이의 표시를 제어할 수 있다."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 메인 디스플레이를 포함하는 본체와 전기적 또는 기능적으로 연결된 서브 디스플레이를 탑재한 커버를 포함하는 전자 장치의 제어 방법은, 상기 커버의 개폐에 따른 상기 커버의 배치 위 치를 검출하는 과정 및 상기 커버의 배치 위치에 대응하여 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하는 과정을 포함할 수 있다. 본 발명의 다양한 실시예에 따르면, 전자 장치는, 메인 디스플레이를 포함하는 본체와, 상기 본체와 전기적 또 는 기능적으로 연결되어 상기 메인 디스플레이의 적어도 일부를 덮을 수 있는 커버와, 상기 커버에 배치된 서브 디스플레이와, 상기 커버의 개폐에 관한 검출 데이터를 획득하기 위한 센서 모듈과, 상기 센서 모듈로부터의 상 기 검출 데이터로부터 상기 커버의 배치 위치를 결정하고, 상기 커버의 배치 위치에 따라 상기 메인 디스플레이 또는 상기 서브 디스플레이를 제어하기 위한 프로세서를 포함할 수 있다."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "커버는 본체를 보호할 뿐만 아니라, 본체의 메인 디스플레이와 함께, 또는 본체의 메인 디스플레이를 대신하여 콘텐츠를 표시 가능한 서브 디스플레이를 탑재하고 있어 표시 방식을 개선할 수 있다."}
{"patent_id": "10-2013-0162160", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 개시(present disclosure)를 설명한다. 본 개시는 다양한 변경을 가할 수 있 고 여러 가지 실시예를 가질 수 있는 바, 특정 실시예들이 도면에 예시되고 관련된 상세한 설명이 기재되어 있 다. 그러나, 이는 본 개시를 특정한 실시 형태에 대해 한정하려는 것이 아니며, 본 개시의 사상 및 기술 범위에 포함되는 모든 변경 및/또는 균등물 내지 대체물을 포함하는 것으로 이해되어야 한다. 도면의 설명과 관련하여, 유사한 구성요소에 대해서는 유사한 참조 부호가 사용되었다. 본 발명의 다양한 실시예 가운데 사용될 수 있는“포함한다” 또는 “포함할 수 있다” 등의 표현은 본 발명의 다양한 실시예에 따른 해당 기능, 동작 또는 구성요소 등의 존재를 가리키며, 추가적인 하나 이상의 기능, 동작 또는 구성요소 등을 제한하지 않는다. 또한, 본 발명의 다양한 실시예에서, \"포함하다\" 또는 \"가지다\" 등의 용 어는 명세서상에 기재된 특징, 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것이 존재함을 지정하려 는 것이지, 하나 또는 그 이상의 다른 특징들이나 숫자, 단계, 동작, 구성요소, 부품 또는 이들을 조합한 것들 의 존재 또는 부가 가능성을 미리 배제하지 않는 것으로 이해되어야 한다. 본 발명의 다양한 실시예에서 “또는” 등의 표현은 함께 나열된 단어들의 어떠한, 그리고 모든 조합을 포함한 다. 예를 들어, “A 또는 B”는, A를 포함할 수도, B를 포함할 수도, 또는 A 와 B 모두를 포함할 수도 있다. 본 발명의 다양한 실시예에서 가운데 “제 1,”“제2,”“첫째,”또는“둘째,”등의 표현들이 본 발명의 다양한 실시예의 다양한 구성요소들을 수식할 수 있지만, 해당 구성요소들을 한정하지 않는다. 예를 들어, 상기 표현들 은 해당 구성요소들의 순서 및/또는 중요도 등을 한정하지 않는다. 상기 표현들은 한 구성요소를 다른 구성요소 와 구분 짓기 위해 사용될 수 있다. 예를 들어, 제1 사용자 기기와 제 2 사용자 기기는 모두 사용자 기기이며, 서로 다른 사용자 기기를 나타낸다. 예를 들어, 본 발명의 다양한 실시예의 권리 범위를 벗어나지 않으면서 제1 구성요소는 제2 구성요소로 명명될 수 있고, 유사하게 제2 구성요소도 제1 구성요소로 명명될 수 있다. 어떤 구성요소가 다른 구성요소에 \"연결되어\" 있다거나 \"접속되어\" 있다고 언급된 때에는, 그 다른 구성요소에 직접적으로 연결되어 있거나 또는 접속되어 있을 수도 있지만, 중간에 다른 구성요소가 존재할 수도 있다고 이 해되어야 할 것이다. 반면에, 어떤 구성요소가 다른 구성요소에 \"직접 연결되어\" 있다거나 \"직접 접속되어\" 있 다고 언급된 때에는, 중간에 다른 구성요소가 존재하지 않는 것으로 이해될 수 있어야 할 것이다. 본 발명의 다양한 실시예에서 사용한 용어는 단지 특정한 실시예를 설명하기 위해 사용된 것으로, 본 발명을 한 정하려는 의도가 아니다. 단수의 표현은 문맥상 명백하게 다르게 뜻하지 않는 한, 복수의 표현을 포함한다. 다르게 정의되지 않는 한, 기술적이거나 과학적인 용어를 포함해서 여기서 사용되는 모든 용어들은 본 개시가 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 일반적으로 이해되는 것과 동일한 의미를 가지고 있다. 일 반적으로 사용되는 사전에 정의되어 있는 것과 같은 용어들은 관련 기술의 문맥 상 가지는 의미와 일치하는 의 미를 가지는 것으로 해석되어야 하며, 본 발명의 다양한 실시예에서 명백하게 정의하지 않는 한, 이상적이거나 과도하게 형식적인 의미로 해석되지 않는다. 본 발명의 다양한 실시예에 따른 전자 장치는, 통신 기능이 포함된 장치일 수 있다. 예를 들면, 전자 장치는 스 마트 폰(smart phone), 태블릿 PC(tablet personal computer), 이동 전화기(mobile phone), 화상 전화기, 전자 북 리더기(e-book reader), 데스크탑 PC(desktop personal computer), 랩탑 PC(laptop personal computer), 넷 북 컴퓨터(netbook computer), PDA(personal digital assistant), PMP(portable multimedia player), MP3 플 레이어, 모바일 의료기기, 카메라(camera), 또는 웨어러블 장치(wearable device)(예: 전자 안경과 같은 head- mounted-device(HMD), 전자 의복, 전자 팔찌, 전자 목걸이, 전자 앱세서리(appcessory), 또는 스마트 와치 (smart watch)) 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 갖춘 스마트 가전 제품(smart home appliance)일 수 있다. 스마트 가전 제품은, 예를 들자면, 전자 장치는 텔레비전, DVD(digital video disk) 플레이어, 오디오, 냉장고, 에어컨, 청소기, 오븐, 전자레인지, 세탁기, 공기 청정기, 셋톱 박스(set-top box), TV 박스(예를 들면, 삼성 HomeSyncTM, 애플TVTM, 또는 구글 TVTM), 게임 콘솔(game consoles), 전자 사전, 전자 키, 캠코더(camcorder), 또는 전자 액자 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 각종 의료기기(예: MRA(magnetic resonance angiography), MRI(magnetic resonance imaging), CT(computed tomography), 촬영기, 초음파기 등), 네비게이션(navigation) 장치, GPS 수 신기(global positioning system receiver), EDR(event data recorder), FDR(flight data recorder), 자동차 인포테인먼트(infotainment) 장치, 선박용 전자 장비(예: 선박용 항법 장치 및 자이로 콤파스 등), 항공 전자기 기(avionics), 또는 보안 기기 중 적어도 하나를 포함할 수 있다. 어떤 실시예들에 따르면, 전자 장치는 통신 기능을 포함한 가구(furniture) 또는 건물/구조물의 일부, 전자 보 드(electronic board), 전자 사인 입력장치(electronic signature receiving device), 프로젝터(projector), 또는 각종 계측기기(예: 수도, 전기, 가스, 또는 전파 등) 중 적어도 하나를 포함할 수 있다. 본 발명의 다양한 실시예에 따른 전자 장치는 전술한 다양한 장치들 중 하나 또는 그 이상의 조합일 수 있다. 또한, 본 발명의 다 양한 실시예에 따른 전자 장치는 전술한 기기들에 한정되지 않음은 당업자에게 자명하다.이하 첨부된 도면을 참조하여 다양한 실시예에 따른 전자 장치에 대해서 살펴본다. 다양한 실시예에서 이용되는 사용자를 용어는 전자 장치를 사용하는 사람 또는 전자 장치를 사용하는 장치(예: 인공지능 전자 장치)를 지칭 할 수 있다. 도 1은 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 1을 참 조하면, 전자 장치는 버스, 프로세서, 메모리, 입출력 인터페이스, 디스플레이, 통신 인터페이스 및 입출력 제어 모듈을 포함할 수 있다. 버스는 전술한 구성요소들을 서로 연결하고, 전술한 구성요소들 간의 통신(예: 제어 메시지)을 전달하는 회로일 수 있다. 프로세서는, 예를 들면, 버스를 통해 전술한 다른 구성요소들(예: 메모리 130, 입출력 인터페이스 140, 디스플레이 150, 통신 인터페이스 160, 또는 입출력 제어 모듈 170 등)로부터 명령을 수신하여, 수신된 명 령을 해독하고, 해독된 명령에 따른 연산이나 데이터 처리를 실행할 수 있다. 메모리는, 프로세서 또는 다른 구성요소들(예: 입출력 인터페이스 140, 디스플레이 150, 통신 인터페 이스 160, 또는 입출력 제어 모듈 170 등)로부터 수신되거나 프로세서 또는 다른 구성요소들에 의해 생성 된 명령 또는 데이터를 저장할 수 있다. 메모리는, 예를 들면, 커널, 미들웨어, 어플리케이션 프로그래밍 인터페이스(API: application programming interface) 또는 어플리케이션 등의 프로그래 밍 모듈들을 포함할 수 있다. 전술한 각각의 프로그래밍 모듈들은 소프트웨어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합을 포함할 수 있다. 커널은 나머지 다른 프로그래밍 모듈들, 예를 들면, 미들웨어, API 또는 어플리케이션에 구현된 동작 또는 기능을 실행하는 데 사용되는 시스템 리소스들(예: 버스 110, 프로세서 120 또는 메모리 130 등)을 제어 또는 관리할 수 있다. 커널은 미들웨어, API 또는 어플리케이션에서 전자 장치 의 개별 구성요소에 접근하여 제어 또는 관리할 수 있는 인터페이스를 제공할 수 있다. 미들웨어는 API 또는 어플리케이션이 커널과 통신하여 데이터를 주고받을 수 있도록 중개 역할을 수행할 수 있다. 또한, 미들웨어는 어플리케이션으로부터 수신된 작업 요청들과 관련하여, 예 를 들면, 어플리케이션 중 적어도 하나의 어플리케이션에 전자 장치의 시스템 리소스(예: 버스 110, 프로세서 120 또는 메모리 130 등)를 사용할 수 있는 우선 순위를 배정하는 등의 방법을 이용하여 작업 요청에 대한 로드 밸런싱을 수행할 수 있다. API는 어플리케이션이 커널 또는 미들웨어에서 제공하는 기능을 제어할 수 있는 인터페이 스로, 예를 들면, 파일 제어, 창 제어, 화상 처리 또는 문자 제어 등을 위한 적어도 하나의 인터페이스 또는 함 수(예: 명령어)를 포함할 수 있다. 다양한 실시예에 따르면, 어플리케이션는 SMS/MMS 어플리케이션, 이메일 어플리케이션, 달력 어플리케이션, 알람 어플리케이션, 건간 관리(health care) 어플리케이션(예: 운동량 또는 혈당 등을 측정하는 어플리케이션) 또는 환경 정보 어플리케이션(예: 기압, 습도 또는 온도 정보 등을 제공하는 어플리케이션) 등을 포함할 수 있다. 추가적으로 또는 대체적으로, 어플리케이션은 전자 장치와 외부 전자 장치 사 이의 정보 교환과 관련된 어플리케이션일 수 있다. 정보 교환과 관련된 어플리케이션은, 예를 들어, 외부 전자 장치에 특정 정보를 전달하기 위한 알림 전달(notification relay) 어플리케이션, 또는 외부 전자 장치를 관리 하기 위한 장치 관리(device management) 어플리케이션을 포함할 수 있다. 예를 들면, 알림 전달 어플리케이션은 전자 장치의 다른 어플리케이션(예: SMS/MMS 어플리케이션, 이메일 어플리케이션, 건강 관리 어플리케이션 또는 환경 정보 어플리케이션 등)에서 발생한 알림 정보를 외부 전자 장 치(예: 전자 장치 104)로 전달하는 기능을 포함할 수 있다. 추가적으로 또는 대체적으로, 알림 전달 어플리케이 션은, 예를 들면, 외부 전자 장치(예: 전자 장치 104)로부터 알림 정보를 수신하여 사용자에게 제공할 수 있다. 장치 관리 어플리케이션은, 예를 들면, 전자 장치와 통신하는 외부 전자 장치(예: 전자 장치 104)의 적어 도 일부에 대한 기능(예: 외부 전자 장치 자체(또는, 일부 구성 부품)의 턴온/턴오프 또는 디스플레이의 밝기 (또는, 해상도) 조절, 외부 전자 장치에서 동작하는 어플리케이션 또는 외부 전자 장치에서 제공되는 서비스(예: 통화 서비스 또는 메시지 서비스)를 관리(예: 설치, 삭제 또는 업데이트)할 수 있다. 다양한 실시예에 따르면, 어플리케이션은 외부 전자 장치(예: 전자 장치 104)의 속성(예: 전자 장치의 종 류)에 따라 지정된 어플리케이션을 포함할 수 있다. 예를 들어, 외부 전자 장치가 MP3 플레이어인 경우, 어플리케이션은 음악 재생과 관련된 어플리케이션을 포함할 수 있다. 유사하게, 외부 전자 장치가 모바일 의료기 기인 경우, 어플리케이션은 건강 관리와 관련된 어플리케이션을 포함할 수 있다. 한 실시예에 따르며, 어 플리케이션은 전자 장치에 지정된 어플리케이션 또는 외부 전자 장치(예: 서버 106 또는 전자 장치 104)로부터 수신된 어플리케이션 중 적어도 하나를 포함할 수 있다. 입출력 인터페이스는, 입출력 장치(예: 센서, 키보드 또는 터치스크린 등)을 통하여 사용자로부터 입력된 명령 또는 데이터를, 예를 들면, 버스를 통해 프로세서, 메모리, 통신 인터페이스, 또는 입출력 제어 모듈에 전달할 수 있다. 예를 들면, 입출력 인터페이스은 터치스크린을 통하여 입력된 사용자가 터치에 대한 데이터를 프로세서로 제공할 수 있다. 또한, 입출력 인터페이스는, 예를 들면, 버스를 통해 프로세서, 메모리, 통신 인터페이스, 또는 입출력 제어 모듈로부터 수신 된 명령 또는 데이터를 입출력 장치(예: 스피커 또는 디스플레이 등)를 통하여 출력할 수 있다. 예를 들면, 입 출력 인터페이스는 프로세서를 통하여 처리된 음성 데이터를 스피커를 통하여 사용자에게 출력할 수 있다. 디스플레이는 사용자에게 각종 정보(예: 멀티미디어 데이터 또는 텍스트 데이터 등)를 표시할 수 있다. 디 스플레이는 다수의 디스플레이부들(예: 제 1 디스플레이부 151, 제 2 디스플레이부 152)을 포함할 수 있다. 예를 들자면, 제 1 디스플레이부는 도시하지 않은 본체에 탑재되고, 제 2 디스플레이부는 본체 에 전기적 또는 기능적으로 연결된 도시하지 않는 (전자적) 커버에 탑재될 수 있다. 커버는 본체의 화면의 적어 도 일부를 덮을 수 있다. 또한, 커버는 본체로부터 분리될 수도 있다. 통신 인터페이스는 전자 장치와 외부 장치(예: 전자 장치 104 또는 서버 106 등) 간의 통신을 연결할 수 있다. 예를 들면, 통신 인터페이스는 무선 통신 또는 유선 통신을 통해서 네트워크에 연결되어 외 부 장치와 통신할 수 있다. 무선 통신은, 예를 들면, Wifi(wireless fidelity), BT(Bluetooth), NFC(near field communication), GPS(global positioning system) 또는 cellular 통신(예: LTE, LTE-A, CDMA, WCDMA, UMTs, WiBro 또는 GSM 등) 중 적어도 하나를 포함할 수 있다. 유선 통신은, 예를 들면, USB(universal serial bus), HDMI(high definition multimedia interface), RS-232(recommended standard 232) 또는 POTS(plain old telephone service) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 네트워크는 통신 네트워크(telecommunications network)일 수 있다. 통신 네트워크는 컴퓨터 네트워크(computer network), 인터넷(internet), 사물 인터넷(internet of things) 또는 전화망 (telephone network) 중 적어도 하나를 포함할 수 있다. 한 실시예에 따르면, 전자 장치와 외부 장치 간의 통신을 프로토콜(예: transport layer protocol, data link layer protocol 또는 physical layer protocol))은 어플리케이션, 어플리케이션 프로그래밍 인터페이스, 미들웨어, 커널 또는 통신 인터페이 스 중 적어도 하나에서 지원될 수 있다. 입출력 제어 모듈은, 다른 구성 요소들(예: 프로세서 120, 메모리 130, 입출력 인터페이스 140, 또는 통신 인터페이스 160 등)로부터 회득된 정보 정 적어도 일부를 처리하고, 이를 다양한 방법으로 사용자에게 제공할 수 있다. 예를 들자면, 입출력 제어 모듈은 프로세서를 이용하여 또는 이와는 독립적으로, 전자 장치 가 다른 전자 장치(예: 전자 장치 104 또는 서버 106)와 연동하도록 전자 장치의 적어도 일부 기능을 제어할 수 있다. 후술하는 도 9 내지 도 52를 통하여 입출력 제어 모듈에 대한 추가적인 정보가 제공된다. 도 2는 본 발명의 다양한 실시예에 따른 전자 장치의 블록도를 도시한다. 전자 장치는, 예를 들면, 도 1에 도시된 전자 장치의 전체 또는 일부를 구성할 수 있다. 도 2를 참조하면, 전자 장치는 적어도 하나의 프로세서, SIM(subscriber identification module) 카 드, 메모리, 통신 모듈, 센서 모듈, 사용자 입력 모듈, 디스플레이 모듈, 인터 페이스, 오디오 코덱, 카메라 모듈, 전력관리 모듈, 배터리, 인디케이터, 모터 , 또는 전자적 커버를 포함할 수 있다. 프로세서는 적어도 하나의 어플리케이션 프로세서(AP: application processor) 또는 적어도 하나의 커뮤니케이션 프로세서(CP: communication processor)를 포함할 수 있다. 도 2에서는 AP 및 CP(21 3)가 프로세서 내에 포함된 것으로 도시되었으나, AP와 CP는 서로 다른 IC 패키지들 내에 각각 포함될 수 있다. AP 및 CP는 하나의 IC 패키지 내에 포함될 수도 있다. AP는 운영체제 또는 응용 프로그램을 구동하여 AP에 연결된 다수의 하드웨어 또는 소프트웨어 구성요 소들을 제어하고, 멀티미디어 데이터를 포함한 각종 데이터 처리 및 연산을 수행할 수 있다. AP는, 예를들면, SoC(system on chip)로 구현될 수 있다. 한 실시예에 따르면, 프로세서는 GPU(graphic processing unit, 미도시)를 더 포함할 수도 있다. CP는 전자 장치와 네트워크로 연결된 다른 하드웨어들 간의 통신에서 데이터 링크를 관리하고 통신 프로토콜을 변환하는 기능을 수행할 수 있다. CP는, 예를 들면, SoC로 구현될 수 있다. CP는 멀티미 디어 제어 기능의 적어도 일부를 수행할 수도 있다. CP는, 예를 들면, 가입자 식별 모듈(예: SIM 카드 214)을 이용하여 통신 네트워크 내에서 단말의 구별 및 인증을 수행할 수 있다. CP는 사용자에게 음성 통 화, 영상 통화, 문자 메시지 또는 패킷 데이터(packet data) 등의 서비스들을 제공할 수 있다. CP는 통신 모듈의 데이터 송수신을 제어할 수 있다. 도 2에서는, CP, 전력관리 모듈 또는 메모리 등의 구성요소들이 AP와 별개의 구성요소로 도시되어 있으나, AP가 전술한 구성요소들의 적어도 일부(예: CP 213)를 포함하도록 구현될 수도 있다. AP 또는 CP는 각각에 연결된 비휘발성 메모리 또는 다른 구성요소 중 적어도 하나로부터 수신한 명령 또는 데이터를 휘발성 메모리에 로드(load)하여 처리할 수 있다. AP 또는 CP는 다른 구성요소 중 적 어도 하나로부터 수신하거나 다른 구성요소 중 적어도 하나에 의해 생성된 데이터를 비휘발성 메모리에 저장할 수 있다. SIM 카드는 가입자 식별 모듈을 구현한 카드일 수 있으며, 전자 장치의 특정 위치에 형성된 슬롯에 삽입될 수 있다. SIM 카드는 고유한 식별 정보(예: ICCID(integrated circuit card identifier))또는 가 입자 정보(예: IMSI(international mobile subscriber identity))를 포함할 수 있다. 메모리(예: 메모리 130)는 내장 메모리 또는 외장 메모리를 포함할 수 있다. 내장 메모리 는, 예를 들면, 휘발성 메모리(예를 들면, DRAM(dynamic RAM), SRAM(static RAM), SDRAM(synchronous dynamic RAM) 등) 또는 비휘발성 메모리(non-volatile Memory, 예를 들면, OTPROM(one time programmable ROM), PROM(programmable ROM), EPROM(erasable and programmable ROM), EEPROM(electrically erasable and programmable ROM), mask ROM, flash ROM, NAND flash memory, NOR flash memory 등) 중 적어도 하나를 포함할 수 있다. 내장 메모리는 Solid State Drive (SSD)의 형태를 취할 수도 있다. 외장 메모리는, 예를 들면, CF(compact flash), SD(secure digital), Micro-SD(micro secure digital), Mini-SD(mini secure digital), xD(extreme digital) 또는 memorystick 등을 더 포함할 수 있다. 통신 모듈(예: 통신 인터페이스 160)은 무선 통신 모듈 또는 RF 모듈을 포함할 수 있다. 무선 통신 모듈은, 예를 들면, WiFi, BT(bluetooth), GPS 또는 NFC(near field communication)를 포함할 수 있다. 예를 들면, 무선 통신 모듈은 무선 주파수를 이용하여 무선 통신 기능을 제공할 수 있다. 추가적으로 또는 대체적으로, 무선 통신 모듈은 전자 장치를 네트워크(예: Internet, LAN(local area network), WAN(wire area network), telecommunication network, cellular network, satellite network 또는 POTS(plain old telephone service) 등)와 연결시키기 위한 네트워크 인터페 이스(예: LAN card) 또는 모뎀 등을 포함할 수 있다. RF 모듈은 데이터의 송수신, 예를 들면, RF 신호 또는 호출된 전자 신호의 송수신을 담당할 수 있다. RF 모듈은, 도시되지는 않았으나, 예를 들면, 트랜시버(transceiver), PAM(power amp module), 주파수 필터 (frequency filter) 또는 LNA(low noise amplifier) 등을 포함할 수 있다. RF 모듈은 무선통신에서 자유 공간상의 전자파를 송수신하기 위한 부품, 예를 들면, 도체 또는 도선 등을 더 포함할 수 있다. 센서 모듈은, 예를 들면, 제스처 센서(240A), 근접 센서(240B), 그립 센서(240C), 자이로 센서(240D), 가 속도 센서(240E), 지자기 센서(240F), 기압 센서(240G), 온/습도 센서(240H), 홀 센서(240I), RGB(red, green, blue) 센서(240J), 조도 센서(240K), 생체 센서(240L), UV(ultra violet) 센서(240M) 또는 스타일러스 디텍터 (240N) 중의 적어도 하나를 포함할 수 있다. 센서 모듈은 물리량을 계측하거나 하드웨어의 작동 상태를 감 지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 추가적으로/대체적으로, 센서 모듈은, 예 를 들면, 후각 센서(E-nose sensor, 미도시), EMG 센서(electromyography sensor, 미도시), EEG 센서 (electroencephalogram sensor, 미도시), ECG 센서(electrocardiogram sensor, 미도시) 또는 지문 센서 등을 포함할 수 있다. 센서 모듈은 그 안에 속한 적어도 하나의 센서들을 제어하기 위한 제어회로를 더 포함할 수 있다. 센서 모듈은 전자적 커버의 개폐에 관한 데이터를 획득할 수 있다. 예를 들자면, 센서 모듈은 홀 센서(240I)가 전자적 커버에 탑재된 자석에 반응하는 방식으로 전자적 커버의 개폐에 관한 데이터를 획득할 수 있다. 또한, 센서 모듈은 근접 센서(240B)가 전자적 커버의 접근 또는 미접근에 반응하 는 방식으로 전자적 커버의 개폐에 관한 데이터를 획득할 수도 있다. 또한, 센서 모듈은 자이로 센서 (240D), 지자기 센서(240F) 또는 가속도 센서(240E) 등을 이용하여 전자적 커버의 개폐에 관한 본체의 움 직임 데이터를 획득할 수도 있다. 또한, 센서 모듈(2400은 조도 센서(240K)를 이용하여 전자적 커버의 개 폐에 관한 밝기 데이터를 획득할 수도 있다. 프로세서는 센서 모듈로부터 전자적 커버의 개폐에 관한 데이터를 획득하고, 전자적 커버 의 배치 위치를 확인할 수 있다. 예를 들자면, 전자적 커버는 닫힌 상태로 도시하지 않은 본체의 아래 또 는 위에 중첩 배치되거나, 열린 상태로 본체에 중첩 배치되지 않거나, 또는 열린 상태로 본체의 아래 또는 위에 중첩 배치될 수 있다. 또한, 프로세서는 카메라 모듈(예: 이미지 센서)을 이용하여 피사체의 이미지 데이터를 획득하고, 이 미지 데이터로부터 전자적 커버의 배치 상태를 확인할 수도 있다. 이미지 센서는 센서 모듈에 포함될 수도 있다. 프로세서는 전자적 커버의 배치 위치에 대응하여 디스플레이 모듈들(230, 41)을 제어(예: 활성화 또 는 비활성화)할 수 있다. 또한, 프로세서는 전자적 커버의 배치 위치에 대응하여 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)을 제어(예: 활성화 또는 비활성화)할 수도 있다. 여기서, '활성화' 용어는 ' 사용'의 의미이고, '비활성화' 용어는 '비사용'의 의미를 포함할 수 있다. 또한, '활성화' 용어는 '구동'의 의 미이고, '비활성화' 용어는 '비구동'의 의미를 포함할 수 있다. 또한, '활성화' 용어는 '입출력(예: 표시, 입력) 가능' 의미이고, '비활성화' 용어는 '입출력 불가' 의미를 포함할 수 있다. 예를 들자면, 활성화된 디스 플레이 모듈은 콘텐츠를 표시 가능한 상태 또는 콘텐츠를 표시하고 있는 상태로서 전원을 인가받아 구동 중이고, 비활성화된 디스플레이 모듈은 콘텐츠를 표시할 수 없는 상태로서 전원을 인가받지 않아 비구동 중일 수 있다. 사용자 입력 모듈은 터치 패널(touch panel), (디지털) 펜 센서(pen sensor)(예: 디지타이저 (dizitizer)), 키(key) 또는 초음파 입력 장치를 포함할 수 있다. 터치 패널은, 예를 들 면, 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식으로 터치 입력을 인식할 수 있다. 터치 패널은 도시하지 않은 컨트롤러를 더 포함할 수도 있다. 정전식의 경우, 직접 터치뿐만 아니라 근접 인식도 가능하다. 터치 패널은 택타일 레이어(tactile layer)를 더 포함할 수도 있고, 여기서, 터치 패널 은 사용자에게 촉각 반응을 제공할 수 있다. (디지털) 펜 센서는, 예를 들면, 사용자의 터치 입력을 받는 것과 동일 또는 유사한 방법인 정전식, 감압식, 적외선 방식 또는 초음파 방식 중 적어도 하나의 방식 또 는 별도의 인식용 쉬트(sheet)를 이용하여 구현될 수 있다. 키로서, 예를 들면, 키패드 또는 터치 키가 이 용될 수 있다. 초음파 입력 장치는 초음파 신호를 발생하는 펜을 통해, 단말에서 마이크로 음파를 감지하 여 데이터를 확인할 수 있는 장치로서, 무선 인식이 가능하다. 전자 장치는 통신 모듈을 이용하여 이 와 연결된 외부 장치(예: 네트워크, 컴퓨터 또는 서버)로부터 사용자 입력을 수신할 수도 있다. 디스플레이 모듈(예: 디스플레이 150)은 패널 또는 홀로그램을 포함할 수 있다. 패널은, 예를 들면, LCD(liquid-crystal display) 또는 AM-OLED(active-matrix organic light-emitting diode) 등일 수 있다. 패널은, 예를 들면, 유연하게(flexible), 투명하게(transparent) 또는 착용할 수 있게 (wearable) 구현될 수 있다. 패널은 터치 패널과 하나의 모듈로 구성될 수도 있다. 홀로그램은 빛의 간섭을 이용하여 입체 영상을 허공에 보여줄 수 있다. 디스플레이 모듈은 패널 또는 홀로그램 을 제어하기 위한 제어회로를 더 포함할 수 있다. 인터페이스는, 예를 들면, HDMI(high-definition multimedia interface), USB(universal serial bus), 프로젝터 또는 D-sub(D-subminiature)를 포함할 수 있다. 추가적으로 또는 대체적으로, 인터페이스는, 예를 들면, 도시하지 않은 SD(secure Digital)/MMC(multi-media card) 또는 IrDA(infrared data association)를 포함할 수 있다. 오디오 코덱은 음성과 전기신호를 쌍방향으로 변환시킬 수 있다. 오디오 코덱은, 예를 들면, 스피커 , 리시버, 이어폰 또는 마이크 등을 통해 입력 또는 출력되는 음성 정보를 변환시킬 수 있 다. 카메라 모듈은 화상 및 동영상을 촬영할 수 있는 장치로서, 한 실시예에 따르면, 적어도 하나의 이미지 센 서(예: 전면 렌즈 또는 후면 렌즈) 또는 ISP(image signal processor, 미도시)를 포함할 수 있다.전력관리 모듈은 전자 장치의 전력을 관리할 수 있다. 도시하지는 않았으나, 전력관리 모듈은, 예를 들면, PMIC(power management integrated circuit), 충전 IC(charger integrated circuit) 또는 배터리 게이지(battery fuel gauge)를 포함할 수 있다. PMIC는, 예를 들면, 집적회로 또는 SoC 반도체 내에 탑재될 수 있다. 충전 방식은 유선과 무선으로 구분될 수 있다. 충전 IC는 배터리를 충전시킬 수 있으며, 충전기로부터의 과전압 또는 과전류 유입을 방지할 수 있다. 충 전 IC는 유선 충전 방식 또는 무선 충전 방식 중 적어도 하나를 위한 충전 IC를 포함할 수 있다. 무선 충전 방 식으로는, 예를 들면, 자기공명 방식, 자기유도 방식 또는 전자기파 방식 등이 있으며, 무선 충전을 위한 부가 적인 회로, 예를 들면, 코일 루프, 공진 회로, 정류기 등의 회로가 추가될 수 있다. 배터리 게이지는, 예를 들면, 배터리의 잔량, 충전 중 전압, 전류 또는 온도를 측정할 수 있다. 배터리 는 전기를 생성하여 전원을 공급할 수 있고, 예를 들면, 충전식 전지(rechargeable battery)일 수 있다. 인디케이터는 전자 장치 혹은 그 일부(예: AP 211)의 특정 상태, 예를 들면, 부팅 상태, 메시지 상태 또는 충전 상태 등을 표시할 수 있다. 모터는 전기적 신호를 기계적 진동으로 변환할 수 있다. 도시하지 않은 MCU(Micro Control Unit)는 센서 모듈을 제어할 수 있다. 전자적 커버는 디스플레이 모듈을 포함할 수 있다. 디스플레이 모듈은 도시하지 않은 패널(예: LCD(liquid-crystal display), AM-OLED(active-matrix organic light-emitting diode), E- ink(Electrophoretic Ink) 등)을 포함할 수 있다. 디스플레이 모듈은 패널을 제어하기 위한 제어회로를 더 포함할 수 있다. 전자적 커버는 평평한(flat) 형상으로 서로 대향하는 두 면들을 포함할 수 있다. 디스플 레이 모듈은 서로 대향하는 두 면들(예: 앞면, 뒷면) 중 적어도 한 면에 배치될 수 있다. 전자적 커버는 인터페이스를 매개로 프로세서에 전기적 또는 기능적으로 연결될 수 있다. 또한, 도시하지 않았지만, 전자적 커버는 프로세서에 직접적으로 연결될 수도 있다. 또한, 도시하지 않았지 만, 전자적 커버는 무선 통신 모듈(예: Wi-Fi 233, BT 235, GPS 237 또는 NFC 239)과의 무선 통신을 이용하여, 프로세서와 신호를 소통할 수도 있다. 전자적 커버는 전자 장치(예: 전자 장치 101)로부터 분리 가능한 구조로 전자 장치에 탑재될 수 있다. 전자적 커버는 회동 가능하게 탑재되어 디스플레이 모듈의 일면을(예: 화면)의 적어도 일부를 덮을 수 있다. 도시되지는 않았으나, 전자 장치는 모바일 TV 지원을 위한 처리 장치(예: GPU)를 포함할 수 있다. 모바일 TV지원을 위한 처리 장치는, 예를 들면, DMB(digital multimedia broadcasting), DVB(digital video broadcasting) 또는 미디어플로우(media flow) 등의 규격에 따른 미디어 데이터를 처리할 수 있다. 한 실시예에 따른 하드웨어의 전술한 구성요소들의 명칭은 하드웨어의 종류에 따라서 달라질 수 있다. 한 실시 예에 따른 하드웨어는 전술한 구성요소 중 적어도 하나를 포함하여 구성될 수 있으며, 일부 구성요소가 생략되 거나 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 한 실시예에 따른 하드웨어의 구성 요소들 중 일부가 결합되어 하나의 개체(entity)로 구성됨으로써, 결합되기 이전의 해당 구성 요소들의 기능을 동일하게 수행할 수 있다. 도 3은 본 발명의 다양한 실시예에 따른 프로그래밍 모듈의 블록도이다. 프로그래밍 모듈은 도 1에 도시된 전자 장치(예: 메모리 130)에 포함(예: 저장)될 수 있다. 프로그래밍 모듈의 적어도 일부는 소프트웨 어, 펌웨어, 하드웨어 또는 이들 중 적어도 둘 이상의 조합으로 구성될 수 있다. 프로그래밍 모듈은 하드 웨어(예: 전자 장치 200)에 구현되어 전자 장치(예: 전자 장치 101)에 관련된 자원을 제어하는 운영체제(OS: operation system) 또는 운영체제 상에서 구동되는 다양한 어플리케이션(예: 어플리케이션 370)을 포함할 수 있 다. 예를 들면, 운영체제는 안드로이드(Android), iOS, 윈도우즈(Windows), 심비안(Symbian), 타이젠(Tizen) 또는 바다(Bada) 등이 될 수 있다. 도 3을 참조하면, 프로그래밍 모듈은 커널, 미들웨어, API(application programming interface) 또는 어플리케이션을 포함할 수 있다. 커널(예: 커널 131)은 시스템 리소스 매니저 또는 디바이스 드라이버를 포함할 수 있다. 시스템 리소스 매니저는, 예를 들면, 프로세스관리부, 메모리관리부 또는 파일시스템관리부 등을 포함할 수 있다. 시스템 리소스 매니저는 시스템 리소스의 제어, 할당 또는 회수 등을 수행할 수 있다. 디바이스 드라이버는, 예를 들면, 디스플레이 드라이버, 카메라 드라이버, 블루투스 드라이버, 공유 메모리 드라이버, USB 드라이버, 키패드 드라이버, WiFi 드라이버 또는 오디오 드라이버를 포함할 수 있다. 디바이스 드라이버는 도시하지 않은 IPC (inter-process communication) 드라이버를 포함할 수 있다. 미들웨어는 어플리케이션이 공통적으로 사용하는 기능을 제공하기 위해 미리 구현해 놓은 복수의 모 듈들을 포함할 수 있다. 미들웨어는 어플리케이션이 전자 장치 내부의 제한된 시스템 자원을 효율적 으로 사용할 수 있도록 API를 통해 기능을 제공할 수 있다. 예를 들면, 도 3에 도시된 바와 같이, 미들웨 어(예: 미들웨어 132)는 런타임 라이브러리, 어플리케이션 매니저(application manager), 윈도 우 매니저(window manager), 멀티미디어 매니저(multimedia manager), 리소스 매니저(resource manager), 파워 매니저(power manager), 데이터베이스 매니저(database manager), 패키지 매니 저, 연결 매니저(connectivity manager), 통지 매니저(notification manager), 위치 매니저 (location manager), 그래픽 매니저(graphic manager) 또는 보안 매니저(security manager) 중 적어도 하나를 포함할 수 있다. 런타임 라이브러리는, 예를 들면, 어플리케이션이 실행되는 동안에 프로그래밍 언어를 통해 새로운 기능을 추가하기 위해 컴파일러가 사용하는 라이브러리 모듈을 포함할 수 있다. 런타임 라이브러리는 입출 력, 메모리 관리 또는 산술 함수에 대한 기능 등을 수행할 수 있다. 어플리케이션 매니저는, 예를 들면, 어플리케이션중 적어도 하나의 어플리케이션의 생명주기(life cycle)를 관리할 수 있다. 윈도우 매니저는 화면에서 사용하는 GUI 자원을 관리할 수 있다. 멀티미디어 매 니저는 다양한 미디어 파일들의 재생에 사용될 수 있는 포맷을 파악하고, 해당 포맷에 맞는 코덱(codec)을 이용하여 미디어 파일의 인코딩(encoding) 또는 디코딩(decoding)을 수행할 수 있다. 리소스 매니저는 어 플리케이션 중 적어도 어느 하나의 어플리케이션의 소스 코드, 메모리 또는 저장 공간 등의 자원을 관리할 수 있다. 파워 매니저는 바이오스(BIOS: basic input/output system) 등과 함께 동작하여 배터리(battery) 또는 전 원을 관리하고, 동작에 사용될 수 있는 전력 정보 등을 제공할 수 있다. 데이터베이스 매니저는 어플리케 이션 중 적어도 하나의 어플리케이션에서 사용할 데이터베이스를 생성, 검색 또는 변경할 수 있도록 관리 할 수 있다. 패키지 매니저는 패키지 파일의 형태로 배포되는 어플리케이션의 설치 또는 업데이트를 관리 할 수 있다. 연결 매니저는, 예를 들면, WiFi 또는 블루투스 등의 무선 연결을 관리할 수 있다. 통지 매니저는 도 착 메시지, 약속, 근접성 알림 등의 사건(event)을 사용자에게 방해되지 않는 방식으로 표시 또는 통지할 수 있 다. 위치 매니저는 전자 장치의 위치 정보를 관리할 수 있다. 그래픽 매니저는 사용자에게 제공될 그 래픽 효과 또는 이와 관련된 사용자 인터페이스를 관리할 수 있다. 보안 매니저는 시스템 보안 또는 사용 자 인증 등에 사용될 수 있는 제반 보안 기능을 제공할 수 있다. 전자 장치(예: 전자 장치 101)가 전화 기능을 구비한 경우에는, 미들웨어는 전자 장치의 음성 또는 영상 통화 기능을 관리하기 위한 통화 매니저 (telephony manager, 미도시)를 더 포함할 수 있다. 미들웨어는 전술한 내부 구성요소 모듈들의 다양한 기능 조합을 통해 새로운 미들웨어 모듈을 생성하여 사 용할 수 있다. 미들웨어는 차별화된 기능을 제공하기 위해 운영체제의 종류별로 특화된 모듈을 제공할 수 있다. 미들웨어는 동적으로 기존의 구성요소를 일부 삭제하거나 새로운 구성요소들을 추가할 수 있다. 본 발명의 다양한 실시예에 기재된 구성요소를 일부 생략하거나 다른 구성요소를 더 구비하거나 또는 유사한 기능 을 수행하는 다른 명칭을 갖는 구성요소로 대체할 수 있다. API(예: API 133)는 API 프로그래밍 함수들의 집합으로, 운영체제에 따라 다른 구성으로 제공될 수 있다. 예를 들면, 안드로이드 또는 iOS의 경우, 예를 들면, 플랫폼 별로 하나의 API 셋을 제공할 수 있으며, 타이젠 (Tizen)의 경우, 예를 들면, 두 개 이상의 API 셋을 제공할 수 있다. 어플리케이션(예: 어플리케이션 134)은, 예를 들면, 프리로드 어플리케이션(preloaded Application) 또는 제 삼자 어플리케이션(third party application)을 포함할 수 있다. 프로그래밍 모듈의 적어도 일부는 컴퓨터로 읽을 수 있는 저장매체(computer-readable storage media)에 저장된 명령어로 구현될 수 있다. 명령어는, 하나 이상의 프로세서 (예: 프로세서 120)에 의해 실행될 경우, 하 나 이상의 프로세서가 명령어에 해당하는 기능을 수행할 수 있다. 컴퓨터로 읽을 수 있는 저장매체는, 예를 들 면, 메모리가 될 수 있다. 프로그래밍 모듈의 적어도 일부는, 예를 들면, 프로세서에 의해 구현(implement)(예: 실행)될 수 있다. 프로그래밍 모듈의 적어도 일부는 하나 이상의 기능을 수행하기 위한, 예를 들면, 모듈, 프로그램, 루틴, 명령어 세트 (sets of instructions) 또는 프로세스 등을 포함할 수 있다. 본 발명의 다양한 실시예에 따른 프로그래밍 모듈(예: 프로그래밍 모듈 300)의 구성요소들의 명칭은 운영체제의 종류에 따라서 달라질 수 있다. 본 발명의 다양한 실시예에 따른 프로그래밍 모듈은 전술한 구성요소들 중 적어 도 하나 이상을 포함하거나, 일부가 생략되거나, 또는 추가적인 다른 구성요소를 더 포함할 수 있다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 전자 장치는, 예를 들면, 도 2에 도시된 전자 장치일 수 있다. 도 4를 참조하면, 전자 장치는 본체 및 커버를 포함할 수 있다. 본체는 터치스크린(또는, 디스플레이), 스피커(예: 스피커 282), 적어도 하나의 센서(예: 센서 모듈 240), 카메라(예: 카메라 모듈 291), 적어도 하나의 버튼(예: 키 256), 외부 포트 (예: 인터페이스 270), 마이크로폰(예: 마이크 288), 잭, 또는 안테나를 포함할 수 있다. 터치스크린은 도시하지 않은 디스플레이 모듈(예: 260) 및 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)을 포함할 수 있다. 스피커는 전기 신호를 소리로 출력할 수 있다. 적어도 하나의 센서는 물리량 을 계측하거나 전자 장치의 작동 상태를 감지하여, 계측 또는 감지된 정보를 전기 신호로 변환할 수 있다. 적어도 하나의 센서는 특정 위치에 탑재될 수 있다. 적어도 하나의 센서는 제스처센서, 근접 센서, 그립 센서, 자이로 센서, 가속도 센서, 지자기 센서, 기압 센서, 온/습도 센서, 홀 센서, RGB(red, green, blue) 센서, 조도 센서, 생체 센서, UV(ultra violet) 센서, 또는 스타일러스 디텍터 중의 적어도 하나를 포함 할 수 있다. 카메라는 화상 및 동영상을 촬영할 수 있는 장치로서, 하나 이상의 이미지 센서, ISP(image signal processor, 미도시) 또는 플래쉬 LED(flash LED, 미도시)를 포함할 수 있다. 적어도 하나의 버튼 누름 키 또는 터치 키를 포함할 수 있다. 키는 볼륨을 조절할 수 있는 키 또는 전원을 온 또는 오프할 수 있는 키를 포함할 수 있다. 외부 포트는 HDMI(high-definition multimedia interface), USB(universal serial bus), 프로젝터, D-sub(D-subminiature) 케이블과 연결되기 위한 포트, 또는 충전용 포트로 이용될 수 있다. 마이크로폰은 소리를 전기 신호로 변환할 수 있다. 잭은 이어폰, 이어셋 등의 플러그를 전기적 으로 접속시킬 수 있다. 안테나(예: DMB(Digital Multimedia Brocasting) 안테나)는 전자 장치의 외부 로 꺼내어져 연장(extend)될 수 있다. 커버는 본체에 접힐 수 있게 설치되어 본체의 전면(500-1)(예: 화면)의 적어도 일부를 덮을 수 있다(가릴 수 있다). 커버는 본체의 가로 방향(가로의 길이가 세로의 길이보다 짧은 방향)의 일측을 중심으로 회전될 수 있다(가로 방향 개폐). 커버가 닫히는 경우, 본체의 일면에 배치된 요소들(예: 터치스크린 51, 적어도 하나의 센서 503, 카메라 504, 또는 적어도 하나의 버튼 505 등은 가려질 수 있다. 커버 는 본체의 스피커에 대응하는 관통 홀을 포함할 수 있다. 도 5는 본 발명의 다양한 실시예에 따른 전자 장치의 본체의 사시도이다. 도 5를 참조하면, 본체는 후면(500-2)에 배치되는 플래시, 카메라, 다수의 메모리 소켓들(523, 524)(예: SD(Secure Digital) 카드용 소켓, SIM(Subscriber Identification Module) 카드용 소켓), 스피커 , 다수의 후크 체결 홈들 및 적어도 하나의 단자, 배터리, 또는 스타일러스를 포함할 수 있다. 다수의 후크 체결 홈들은 커버와 본체를 결합하는데 사용될 수 있다. 적어도 하나의 단자 는 커버와 본체를 전기적으로 연결하는데 사용될 수 있다. 도 6은 본 발명의 다양한 실시예에 따른 커버의 사시도이다. 도 6을 참조하면, 커버는 제 1 커버부, 제 2 커버부, 연결부 및 전기적 연결 부재를 포함할 수 있다. 제 1 커버부는 본체의 전면(500-1)에 대한 커버로서, 회전 방식으로 개폐되어 본체의 화면을 가 리거나 노출시킬 수 있다. 제 1 커버부는 적어도 하나의 디스플레이(예: 디스플레이 모듈 401) 및 관 통 홀을 포함할 수 있다. 적어도 하나의 디스플레이는 제 1 커버부의 서로 대향하는 두 면들 (410-1, 410-2) 중 적어도 한 면에 탑재될 수 있다. 제 1 커버부가 닫힌 위치에 있는 경우, 커버의 디 스플레이는 도시하지 않은 본체의 화면이 적어도 일부와 중첩 배치될 수 있다. 커버의 디스플레이 의 화면 면적은 도시하지 않는 본체의 디스플레이의 화면 면적과 같거나 또는 다를 수 있다. 예를들자면, 커버의 디스플레이는 작은 창 형태일 수 있다(도 51 참조). 이러한 적어도 하나의 디스플레이 는 LCD, AM-OLED, 또는 E-ink 등을 포함할 수 있다. 관통 홀은 제 1 커버부가 닫힌 상태에서 본 체의 스피커(도 4의 502)로부터의 소리를 외부로 배출시킬 수 있다. 제 2 커버부는 본체의 후면(도 5의 500-2)에 대한 커버로서, 본체의 후면(500-2)에 장착되거나 또는 본체의 후면(500-2)으로부터 분리될 수 있다. 제 2 커버부는 곡형으로 성형되고, 전자 장치 의 외관을 형성할 수 있다. 제 2 커버부는 본체의 후면(500-2)에 배치되는 요소들(예: 다수의 메모리 소켓들 523, 524, 스피커 525, 또는 배터리 52 등)을 가릴 수 있다. 제 2 커버부는 플래시 홀, 카메라 홀, 스피커 홀 및 다수의 후크들(hooks) 중 적어 도 하나를 포함할 수 있다. 또는, 제 2 커버부는 적어도 하나의 단자를 포함할 수 있다. 플래시 홀 은 본체의 플래시를 노출시킬 수 있다. 카메라 홀는 본체의 카메라를 노출시킬 수 있다. 스피커 홀은 본체의 스피커로부터의 소리를 외부로 배출시킬 수 있다. 다수의 후크들 은 제 2 커버부의 테두리 내면에 배치될 수 있다. 다수의 후크들은 스냅 핏 (snap-fits) 결합 방식으로 본체의 다수의 후크 체결 홈들에 체결될 수 있다. 적어도 하나의 단자는 제 2 커버부 의 내면에 배치될 수 있다. 적어도 하나의 단자는 본체의 적어도 하나의 단자에 전기적으 로 접촉될 수 있다. 적어도 하나의 단자는 제 1 커버부의 디스플레이에 전기적으로 연결될 수 있 다. 연결부는 제 1 커버부와 제 2 커버부 사이를 연결하고, 제 1 커버부를 회전 가능하게 할 수 있다. 연결부는 본체의 측면(예: 상하면을 연결하는 면)을 덮을 수 있다. 연결부는 유연하고, 잦은 구부림에도 쉽게 파단되지 않는 재질을 포함할 수 있다. 전기적 연결 부재는 제 1 커버부의 적어도 하나의 디스플레이와 제 2 커버부의 적어도 하나 의 단자 사이를 전기적으로 연결할 수 있다. 전기적 연결 부재는 커버의 적층 요소들 사이에 개 재되는 방식으로 설치되어 외부로 노출되지 않을 수 있다. 전기적 연결 부재는 유연할 수 있다. 이러한 전 기적 연결 부재는 FPCB(Flexible Printed Circuit Board)를 포함할 수 있다. 제 2 커버부가 본체의 후면(500-2)에 결합되는 경우, 제 1 커버부의 적어도 하나의 디스플레이 는 본체에 전기적 또는 기능적으로 연결되고, 본체는 커버의 적어도 하나의 디스플레이(4 1)를 인식하고 이를 제어할 수 있다. 도 7은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 7을 참조하면, 전자 장치는 본체 및 커버를 포함할 수 있다. 본체는 대체적으로 도 4에 도시된 본체의 다수의 구성 요소들을 포함할 수 있다. 단, 본체는 후 면(710-2)에 배치되는 도시하지 않은 후면 커버(예: 배터리 커버)를 더 포함할 수 있다. 또한, 본체는 후 면 커버의 표면에 배치되는 적어도 하나의 단자를 포함할 수 있다. 커버는 제 1 커버부, 제 2 커버부, 연결부 및 적어도 하나의 단자를 포함할 수 있다. 제 1 커버부는 본체의 전면(710-1)에 대한 커버로서, 회전 방식으로 개폐되어 본체의 화면을 가 리거나 노출시킬 수 있다. 제 1 커버부는 전면 또는 후면에 적어도 하나의 디스플레이를 포함할 수 있다. 제 2 커버부는 본체의 후면(710-2)에 대한 커버로서, 본체의 후면(710-2)에 장착되거나 또는 본 체의 후면(710-2)으로부터 분리될 수 있다. 연결부는 제 1 커버부와 제 2 커버부를 연결할 수 있다. 적어도 하나의 단자는 제 2 커버부의 내면에 배치되고, 본체의 적어도 하나의 단자 와 전기적으로 연결될 수 있다. 적어도 하나의 단자는 제 1 커버부의 적어도 하나의 디스플레이 와 전기적으로 연결될 수 있다. 도 8은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 8을 참조하면, 전자 장치(예: 전자 장치 200)는 본체 및 커버를 포함할 수 있다. 본체는 도 4에 도시된 본체일 수 있다. 커버는 접히는 방식으로 본체의 화면을 덮을 수 있다. 커버는 본체의 세로 방향(세로 의 길이가 가로의 길이보다 긴 방향)의 일측을 중심으로 회전될 수 있다(세로 방향 개폐). 커버는 도시하지 않은 적어도 하나의 디스플레이를 포함할 수 있다. 커버의 디스플레이는 본체 에 전기적 또는 기능적으로 연결되고, 본체의 제어를 받을 수 있다. 도 9는 본 발명의 다양한 실시예에 따른 입출력 제어 모듈의 블록 구성도이다. 도 9를 참조하면, 입출력 제어 모듈는 획득 모듈, 위치 결정 모듈 및 제어 모듈을 포함할 수 있다. 획득 모듈(예: 프로세서 211)은 커버(예: 제 1 커버부 410)의 개폐에 관한 데이터를 획득할 수 있다. 획득 모듈은 적어도 하나의 센서(예: 제스처 센서 240A, 근접 센서 240B, 그립 센서 240C, 자이로 센서 240D, 가속도 센서 240E, 지자기 센서 240F, 기압 센서 240G, 온/습도 센서 240H, 홀 센서 240I, RGB 센서 240J, 조 도 센서 240K, 생체 센서 240L, UV 센서 240M, EMG 센서, EEG 센서, ECG 센서 또는 지문 센서 등)를 이용하여 커버의 개폐에 관한 데이터를 얻을 수 있다. 위치 결정 모듈(예: 프로세서 211)은 획득 모듈로부터 얻은 데이터로부터 커버(예: 제 1 커버부 41 0)의 배치 위치를 결정할 수 있다. 예를 들자면, 커버는 닫힌 상태로 본체의 아래에 중첩 배치되는 경우, 닫힌 상태로 본체의 위에 중첩 배치되는 경우, 열린 상태로 본체에 중첩 배치되지 않는 경우, 열린 상태로 본체의 아래에 중첩 배치되는 경우, 또는 열린 상태로 본체의 위에 중첩 배치되는 경우 중 어느 하나에 해당하는 배치 위치에 있을 수 있다. 제어 모듈(예: 프로세서 211)은 위치 결정 모듈로부터 결정된 커버(예: 제 1 커버부 410)의 배치 위 치에 대응하여 본체의 디스플레이 또는 커버의 적어도 하나의 디스플레이를 제어(예: 활성화 또는 비활성화)할 수 있다. 예를 들자면, 제어 모듈(예: 프로세서 211)은 커버의 배치 위치에 대응하 여 어플리케이션의 화면 모드들 사이를 전환할 수 있다. 커버가 닫힌 상태인 경우, 본체는 커버(40 0)의 겉면에 배치된 디스플레이를 통하여 콘텐츠(예: 어플리케이션의 콘텐츠)를 표시할 수 있다. 또한, 커 버가 열린 경우, 본체는 커버의 겉면에 배치된 디스플레이에서 본체의 디스플레이(5 1)로 콘텐츠의 표시를 전환할 수 있다. 또한, 제어 모듈(예: 프로세서 211)은 커버(예: 제 1 커버부 410)의 배치 위치에 따라 본체의 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)을 제어(예: 활성화 또는 비활성화)할 수 있다. 도 10은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 10을 참조하면, 1001 과정에서, 프로세서(예: 획득 모듈 901)는 커버(예: 제 1 커버부 410)의 개폐에 관한 검출 데이터를 획득할 수 있다. 1003 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버의 개 폐에 관한 검출 데이터로부터 커버의 배치 위치를 결정할 수 있다. 1005 과정에서, 프로세서(예: 제 어 모듈 905)는 커버의 배치 위치에 대응하여 본체의 디스플레이(예: 패널 262) 또는 커버의 적 어도 하나의 디스플레이를 제어(예: 활성화 또는 비활성화)할 수 있다. 도시하지 않았지만, 커버가 본체에 부착되는 경우, 프로세서(예: 제어 모듈 905)는 커버에 탑재된 적어도 하나의 디스플레이에 관한 정보(예: 디스플레이의 유형(예: E-Ink 등), 배치 위치(예: 앞면 또는 뒷면) 등)를 검출할 수 있다. 이러한 정보는 커버의 도시하지 않은 제어 회로(예: IC(intergrated circuit, Integrated Circuit))에서 제공될 수 있다. 이하, 다양한 실시예들은 프로세서가 커버의 적어도 하나의 디스플레이에 관한 정보를 파악하고 있음을 전제로 한다. 도 11은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 11을 참조하면, 본체는 디스플레이가 배치된 면(500-1)에 배치된 홀 센서(예: 홀 센서 240 I)를 포함할 수 있다. 커버의 제 1 커버부는 일면(410-1)에 배치된 자성 물질(예: 자석)을 포 함할 수 있다. 홀 센서가 자석에 반응하는 경우, 본체는 제 1 커버부가 닫힌 위치에 있 다고 결정할 수 있다. 또한, 홀 센서가 자석에 반응하지 않는 경우, 본체는 제 1 커버부(41 0)가 열린 위치(예: 180도 열림 또는 360도 열림 등)에 있다고 결정할 수 있다. 도 12는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 12를 참조하면, 본체는 디스플레이가 배치된 면(500-1)과 대향하는 면(500-2)(예: 제 2 커버부 420 가 부착된 면)에 배치된 홀 센서를 포함할 수 있다. 커버의 제 1 커버부는 일면(410-2)에 배치 된 자석을 포함할 수 있다. 홀 센서가 자석에 반응하는 경우, 본체는 제 1 커버부(41 0)가 열린 상태로 본체에 중첩 배치(예: 360도 열림)되어 있다고 결정할 수 있다. 또한, 홀 센서가자석에 반응하지 않는 경우, 본체는 제 1 커버부가 완전하게 열리지 않은 상태로 배치되거나 (예: 180도 열림) 또는 닫힌 위치에 있다고 결정할 수 있다. 도시하지 않았지만, 도 11의 구성과 도 12의 구성을 결합하여 커버의 개폐에 따른 배치 위치를 결정하는 실시예 또한 가능하다. 도 13은 본 발명의 다양한 실시예에 따른 커버의 배치 위치를 결정하는 절차의 순서도이다. 도 13을 참조하면, 1301 과정에서, 프로세서(예: 획득 모듈 901)는 전면 카메라로부터 피사체에 관한 이미지 데이터를 획득할 수 있다. 1303 과정에서, 프로세서(예: 위치 결정 모듈 903)는 이미지 데이터로부 터 얼굴이 인식되는지 여부를 식별할 수 있다. 1305 과정에서, 이미지 데이터로부터 얼굴이 인식되는 경우, 프 로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열린 위치(예: 180도 열림 또는 360도 열 림 등)에 있다고 결정할 수 있다. 또한, 1307 과정에서, 이미지 데이터로부터 얼굴이 인식되지 않는 경우, 프로 세서(예: 위치 결정 모듈 903)는 커버가 닫힌 위치에 있다고 결정할 수 있다. 도 14는 본 발명의 다양한 실시예에 따를 전자 장치의 사시도이다. 도 14를 참조하면, 본체는 디스플레이가 배치된 면(500-1)에 배치되는 카메라를 포함할 수 있다. 카메라는 피사체를 촬상하여 이미지 데이터를 획득할 수 있다. 본체는 카메라로부터의 얻 은 이미지 데이터로부터 얼굴을 인식하고, 커버의 제 1 커버부가 열린 위치(예: 180도 열림 또는 360 도 열림)에 있다고 결정할 수 있다. 또한, 도시하지 않았지만, 본체의 후면(500-2)에 배치된 카메라를 이용하는 실시예 또한 가능하다. 도 15는 본 발명의 다양한 실시예에 따른 커버의 배치 위치를 결정하는 절차의 순서도이다. 도 15를 참조하면, 1501 과정에서, 프로세서(예: 획득 모듈 901)는 전면 카메라를 이용하여 제 1 밝 기를 검출할 수 있다. 1503 과정에서, 프로세서(예: 획득 모듈 901)는 후면 카메라를 이용하여 제 2 밝기를 검출할 수 있다. 1505 과정에서, 프로세서(예: 획득 모듈 901)는 제 1 밝기와 제 2 밝기를 비교하 고, 그 비교 결과에 따라 커버(예: 제 1 커버부 410)의 배치 위치를 결정할 수 있다. 도 16은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 16을 참조하면, 커버의 제 1 커버부는 완전하게 열린 위치(예: 360도 열림)에 있고, 본체의 후면(500-2)에 배치된 후면 카메라를 가릴 수 있다. 따라서, 본체의 전면(500-1)에 배치된 전면 카메 라는 후면 카메라 보다 상대적으로 밝은 빛을 유입 받을 수 있고, 이로부터 본체는 제 1 커버부 가 닫힌 위치가 있다고 판단할 수 있다. 또한, 도시하지 않았지만, 전면 카메라와 후면 카메라로부터 얻은 두 밝기들을 비교하고, 그 비교 결 과에 따라 제 1 커버부의 여타 배치 위치(닫힌 위치, 열린 상태로 본체 500에 중첩 배치, 열린 상태로 본 체 500에 중첩 배치되지 않음 등) 또한 판단될 수 있다. 도 17은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 17을 참조하면, 1701 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 닫 힌 위치에 있음을 감지할 수 있다. 커버가 닫힌 위치에 있는 경우, 커버는 본체에 중첩 배치될 수 있다. 1703 과정에서, 프로세서(예: 제어 모듈 905)는 본체의 디스플레이를 비활성화할 수 있 다. 도 18은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 18을 참조하면, 1801 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 닫 힌 위치에 있음을 감지할 수 있다. 1703 과정에서, 프로세서(예: 제어 모듈 905)는 본체와 마주하는 일면(410-1)(노출되지 않는 면)에 배치된 커버의 디스플레이를 비활성화할 수 있다. 도 19는 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 19를 참조하면, 1901 과정에 서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 닫힌 위치에 있음을 감지할 수 있 다. 1903 과정에서, 프로세서(예: 제어 모듈 905)는 커버의 노출면에 배치된 디스플레이를 활성 화할 수 있다.도 20은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 20을 참조하면, 커버의 제 1 커버부는 닫혀 있고, 본체의 메인 디스플레이를 가릴 수 있 다. 여기서, 본체는 메인 디스플레이를 비활성화할 수 있다. 또한, 본체는 메인 디스플레이 와 마주하는 일면(410-1)에 배치된 커버의 서브 디스플레이를 비활성화할 수 있다. 도 21는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 21을 참조하면, 커버의 제 1 커버부는 닫혀 있고, 본체의 메인 디스플레이를 가릴 수 있 다. 여기서, 본체는 메인 디스플레이를 비활성화할 수 있다. 또한, 본체는 커버의 노출면 (410-2)(메인 디스플레이 51과 마주하는 일면 410-1과 대향하는 면)에 배치된 서브 디스플레이를 활성화할 수 있다. 도 22는 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 22를 참조하면, 2201 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체에 중첩 배치(예: 180도 열림)되지 않음을 감지할 수 있다. 2203 과정에서, 프로세서 (예: 제어 모듈 905)는 본체의 디스플레이를 활성화할 수 있다. 도 23은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 23을 참조하면, 2301 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체에 중첩 배치되지 않음(예: 180도 열림)을 감지할 수 있다. 2303 과정에서, 프로세서 (예: 제어 모듈 905)는 커버의 디스플레이를 활성화 또는 비활성화할 수 있다. 도 24 내지 27은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 24 내지 27을 참조하면, 커버의 제 1 커버부는 열린 상태로 본체에 중첩 배치되지 않을 수 있다(예: 180도 열림). 여기서, 본체는 메인 디스플레이를 활성화할 수 있다. 또한, 본체는 커버 의 서로 대향하는 면들(410-1, 410-2) 중 하나에 배치된 디스플레이를 활성화 또는 비활성화할 수 있 다. 도 28은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 28을 참조하면, 2801 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체에 중첩 배치됨(예: 360도 열림 또는 완전하게 열림)을 감지할 수 있다. 2803 과정에서, 프 로세서(예: 제어 모듈 905)는 본체의 디스플레이를 활성화할 수 있다. 도 29는 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 29를 참조하면, 2901 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체에 중첩 배치됨(예: 360도 열림)을 감지할 수 있다. 2903 과정에서, 프로세서(예: 제 어 모듈 905)는 본체에 마주하는 일면(410-2)에 배치된 커버의 디스플레이를 비활성화할 수 있다. 도 30은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 30을 참조하면, 3001 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체에 중첩 배치됨(예: 360도 열림)을 감지할 수 있다. 3003 과정에서, 프로세서(예: 제 어 모듈 905)는 커버의 노출면에 배치된 디스플레이를 활성화할 수 있다. 도 31 및 32는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도들이다. 도 31을 참조하면, 커버의 제 1 커버부는 열린 상태로 본체에 중첩 배치될 수 있다(예: 360도 열림). 여기서, 본체는 메인 디스플레이를 활성화할 수 있다. 또한, 본체는 메인 디스플레이(5 1)와 마주하는 일면(410-2)에 배치되는 커버의 서브 디스플레이를 비활성화할 수 있다. 도 32를 참조하면, 커버의 제 1 커버부는 열린 상태로 본체에 중첩 배치될 수 있다. 여기서, 본 체는 메인 디스플레이를 활성화할 수 있다. 또한, 본체는 제 1 커버부의 노출면(410-1)(메 인 디스플레이 51와 마주하는 일면 410-2과 대향하는 면)에 배치되는 서브 디스플레이를 활성화할 수 있다.도 33은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 33을 참조하면, 3301 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체 아래에 중첩 배치됨을 감지할 수 있다. 3303 과정에서, 프로세서(예: 제어 모듈 90 5)는 본체의 디스플레이를 활성화할 수 있다. 3305 과정에서, 프로세서(예: 제어 모듈 905)는 커 버의 디스플레이를 비활성화할 수 있다. 도 34는 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 34를 참조하면, 3401 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 열 린 상태로 본체 위에 중첩 배치됨을 감지할 수 있다. 3403 과정에서, 프로세서(예: 제어 모듈 905)는 본체의 디스플레이를 비활성화할 수 있다. 3305 과정에서, 프로세서(예: 제어 모듈 905)는 커버 의 노출면에 배치된 디스플레이를 활성화할 수 있다. 도 35 및 36은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 35를 참조하면, 커버의 제 1 커버부는 열린 상태로 본체 아래에 중첩 배치될 수 있다. 여기 서, 본체는 메인 디스플레이를 활성화할 수 있다. 또한, 본체는 커버의 서브 디스플레이 를 비활성화할 수 있다. 도 36을 참조하면, 커버의 제 1 커버부는 열린 상태로 본체 위에 중첩 배치될 수 있다. 여기서, 본체는 메인 디스플레이를 비활성화할 수 있다. 또한, 본체는 제 1 커버부의 노출면(410- 1)(본체 500와 마주하는 일면 410-2에 대향하는 면)에 배치된 커버의 서브 디스플레이를 활성화할 수 있다. 도 37은 본 발명의 다양한 실시예에 따른 터치 감지 모듈의 제어 절차의 순서도이다. 도 37을 참조하면, 3701 과정에서, 프로세서(예: 획득 모듈 901)는 커버(예: 제 1 커버부 410)의 개폐에 관한 검출 데이터를 회득할 수 있다. 3703 과정에서, 프로세서(예: 위치 결정 모듈 903)는 검출 데이터로 부터 커버의 배치 위치를 결정할 수 있다. 3705 과정에서, 프로세서(예: 제어 모듈 905)는 커버(40 0)의 배치 위치에 대응하여 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)을 제어할 수 있다. 예를 들자 면, 프로세서(예: 제어 모듈 905)는 터치 감지 모듈을 활성화하거나 또는 비활성화할 수 있다. 또한, 프로 세서는 터치 감지 모듈에 의한 터치 감지용 정전용량을 조절할 수 있다. 또한, 프로세서는 터치 감지 모듈에 의한 터치 인식 감도(터치 민감도)를 조절할 수도 있다. 예를 들자면, 터치 인식 감도가 상대적으로 높 은 경우, 터치 감지 모듈은 작은 정전용량의 변화에도 터치를 인식할 수 있다. 도 38은 본 발명의 다양한 실시예에 따른 입출력 제어 절차의 순서도이다. 도 38을 참조하면, 3801 과정에서, 프로세서(예: 위치 결정 모듈 903)는 커버(예: 제 1 커버부 410)가 닫 힌 상태로 본체에 중첩 배치됨을 감지할 수 있다. 3803 과정에서, 프로세서(예: 제어 모듈 905)는 본 체의 디스플레이를 비활성화할 수 있다. 3805 과정에서, 프로세서(예: 제어 모듈 905)는 커버 의 노출면에 배치된 디스플레이를 활성화할 수 있다. 3807 과정에서, 프로세서(예: 제어 모듈 903)는 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)의 근접 터치 감지 기능(또는, 비접촉 터치 감지 기능)(예: 호버링(hovering))을 활성화할 수 있다. 3809 과정에서, 프로세서(예: 제어 모듈 905)는 근접 터치 감지 기능을 통하여 감지된 터치 (입력)에 반응하여 해당 콘텐츠를 커버의 디스플레이로 출력할 수 있다. 도 39는 본 발명의 다양한 실시예에 따는 전자 장치의 사시도이다. 도 39를 참조하면, 커버의 제 1 커버부는 닫힌 위치에 있을 서 있다. 여기서, 본체는 메인 디스 플레이를 비활성화할 수 있다. 또한, 본체는 제 1 커버부의 노출면(410-2)에 배치된 서브 디스플 레이를 활성화할 수 있다. 또한, 본체는 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)의 근접 터치 감지 기능을 활성화할 수 있다. 여기서, 터치 감지 모듈(252 또는 254)은 제 1 커버부의 디스플레이 의 표면 높이 이상으로 전자기장(또는, 커패시턴스)을 형성시킬 수 있다. 커버의 서브 디스플레 이 표면에 손가락 또는 스타일러스가 접촉되는 경우, 커패시턴스(정전용량)는 가변될 수 있다. 커패시턴스 의 가변량이 근접 터치 감지 기능에 설정된 임계값에 도달하게 되는 경우, 터치 감지 모듈 또는 프로세서 는 터치를 인식할 수 있다.도시하지 않았지만, 커버의 제 1 커버부가 열린 위치에 있는 경우, 본체는 터치 감지 모듈(예: 터치 패널 252 또는 펜 선서 254)의 근접 터기 감지 기능을 비활성화하고, 메인 디스플레이를 이용한 터치 감지 기능을 활성화할 수 있다. 도 40은 본 발명의 다양한 실시예에 따른 입출력 제어 절차의 순서도이다. 도 40을 참조하면, 4001 과정에서, 프로세서(예: 제어 모듈 903)는 커버(예: 제 1 커버부 410)가 닫힌 위 치에 있음을 감지할 수 있다. 4003 과정에서, 프로세서(예: 제어 모듈 905)는 본체의 디스플레이(5 1)를 비활성화할 수 있다. 4005 과정에서, 프로세서(예: 제어 모듈 903)는 기 설정된 적어도 하나의 이벤 트가 발생하는지 여부를 식별할 수 있다. 기 설정된 적어도 하나의 이벤트는 본체의 기 설정된 움직임, 기 설정된 버튼의 누름, 또는 스타일러스의 분리 등을 포함할 수 있다. 예를 들자면, 프로세서는 적어도 하나 의 센서(예: 자이로 센서 240D, 가속도 센서 240E, 또는 지자기 센서 240F 등)로부터의 검출 데이터로부터 전자 장치의 기 설정된 움직임(예: 흔들림)을 감지하고, 4007 이하의 과정을 수행할 수 있다. 다른 예를 들자면, 프로세서는 적어도 하나의 센서(예: 스타일러스 디텍터 240N)로부터 스타일러스(예: 도 5의 531)의 분리를 감지하고, 4007 이하의 과정을 수행할 수도 있다. 4007 과정에서, 프로세서(예: 제어 모듈 905)는 커버 의 노출면에 배치된 디스플레이를 활성화할 수 있다. 4009 과정에서, 프로세서(예: 제어 모듈 905)는 본체의 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)의 근접 터치 감지 기능(예: 호버링 (hovering))을 활성화할 수 있다. 4011 과정에서, 프로세서(예: 제어 모듈 905)는 근접 터치 감지 기능을 통하여 감지된 터치에 반응하여 해당 콘텐츠를 커버의 디스플레이로 출력할 수 있다. 도 41 및 42는 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 도 41을 참조하면, 커버가 열린 위치(예: 180도 열림)에 있고, 커버의 디스플레이와 본체의 터치스크린은 좌우 배치될 수 있다. 전자 장치는 본체의 터치스크린 및 커버의 디스플레 이 모두를 이용하여 콘텐츠(예: 전자책, 웹 페이지 등)를 표시할 수 있다. 본체의 터치스크린 상 에서 사용자에 의한 좌우 플리킹 터치가 있는 경우, 전자 장치는 두 디스플레이들(41, 51)의 표시를 이전 페 이지 또는 다음 페이지로 전환할 수 있다. 도 42를 참조하면, 커버가 열린 위치(예: 180도 열림)에 있고, 커버의 디스플레이와 본체의 터치스크린은 좌우 배치(도 41 참조)에서 상하 배치로 변경될 수도 있다. 여기서, 콘텐츠의 표시 또한 좌우 배치에서 상하 배치로 전환될 수 있다. 또한, 본체의 터치 스크린 상에서 사용자에 의한 상하 플리킹 터치가 있는 경우, 전자 장치는 두 디스플레이들(41, 51)의 표시를 이전 페이지 또는 다음 페이지로 전환할 수 있다. 도 43은 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 도 43을 참조하면, 커버가 열린 위치(예: 180도 열림)에 있고, 커버의 디스플레이와 본체의 디스플레이는 나란히 배치될 수 있다. 여기서, 전자 장치는 콘텐츠의 표시를 두 디스플레이들(41, 51)로 분담할 수 있다. 예를 들자면, 본체의 디스플레이는 동영상을 표시하고, 커버의 디스플레이 는 자막을 표시할 수 있다. 상술한 도 41 및 42 또한 콘텐츠의 표시를 두 디스플레이들(41, 51)로 분담하는 다 른 예일 수 있다. 또한, 도시하지 않았지만, 다수의 어플리케이션들을 멀티태스킹하는 가운데, 전자 장치는 다수의 어플리케이 션들을 본체의 디스플레이 및 커버의 디스플레이로 분담하여 표시할 수도 있다. 도 44는 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 도 44를 참조하면, 커버가 열린 위치에 있는 경우, 전자 장치는 본체의 디스플레이로 콘텐츠 를 표시할 수 있다. 또한, 커버가 열린 위치에서 닫힌 위치로 전환되는 경우, 전자 장치는 커버의 겉면에 배치된 디스플레이로 콘텐츠의 표시를 전환할 수 있다. 도 45는 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 도 45를 참조하면, 커버가 열린 위치(예: 180도 열림)에 있고, 커버의 디스플레이와 본체의 터치스크린은 나란히 배치될 수 있다. 여기서, 전자 장치는 본체의 터치스크린에 표시된 콘텐 츠 중 사용자 터치된 항목(예: 메일)에 관한 하위 콘텐츠를 커버의 디스플레이에 표시할 수 있 다.도 46은 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 도 46을 참조하면, 커버가 열린 위치(예: 180도 열림)에 있고, 커버의 디스플레이와 본체의 디스플레이는 나란히 배치될 수 있다. 여기서, 전자 장치는 서로 연관되는 콘텐츠를 두 디스플레이들 (41, 51)에 각각 표시할 수 있다. 예를 들자면, 도시한 바와 같이, 본체의 디스플레이는 호 관련 콘텐 츠를 표시하고, 커버의 디스플레이는 전화번호부를 표시할 수 있다. 도시하지 않았지만, 다양한 다른 실시예가 가능하다. 도 47은 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 커버가 닫힌 위치에 있는 경우, 전자 장 치는 커버의 겉면에 배치된 디스플레이를 활성하고, 또한, 도시하지 않은 본체의 터치 감지 모듈(예: 터치 패널 252 또는 펜 센서 254)의 근접 터지 감지 기능(hovering)을 활성화할 수 있다. 전자 장치 는 근접 터치 감지 기능을 통한 사용자 터치에 반응하여 해당 기능을 수행하고, 이를 커버의 디스플레 이에 표시할 수 있다. 도 47의 (a)를 참조하면, 사용자는 도시 하지 않은 본체의 측면에 배치된 버튼(예:256)을 누를 수 있다. 도 47의 (b) 및 (c)를 참조하면, 전자 장치는 버튼의 누름에 반응하여 커버의 겉면에 배치 된 디스플레이에 디폴트 인터페이스 영상을 표시할 수 있다. 사용자는 디폴트 인터페이스 영상(470 3)의 콘텐츠를 터치할 수 있고, 전자 장치는 사용자 터치에 반응하여 해당 기능(동작)을 수행할 수 있다. 예 를 들자면, 사용자가 디폴트 인터페이스 영상에서 카메라 실행 버튼을 누르게 되면, 전자 장치 는 카메라 어플리케이션을 실행하고, 커버의 디스플레이의 표시를 촬영 인터페이스 영상으로 전 환할 수 있다. 촬영 인터페이스 영상는 도시하지 않은 후면 카메라를 이용하여 얻은 실시간 이미지 를 포함할 수 있다. 사용자가 촬영 인터페이스 영상에서 촬영 버튼를 누르게 되면, 전자 장치는 이미지를 캡처할 수 있다. 도 48 내지 52는 본 발명의 다양한 실시예에 따른 전자 장치의 화면이다. 상술한 바와 같이, 커버가 닫힌 위치에 있는 경우, 전자 장치는 근접 터치 감지 기능을 통한 사용자 터치에 반응하여 해당 기능을 커버(40 0)의 디스플레이와 연동시켜 수행할 수 있다. 도 48을 참조하면, 전자 장치는 알림 어플리케이션(notice application)을 실행하고, 이에 관한 인터페이스 영상을 커버의 디스플레이에 표시할 수 있다. 인터페이스 영상은 다수의 알림 항목들을 포함할 수 있다. 사용자 터치(예: 드래그 앤 릴리즈(drag and release) 또는 플리킹(flicking) 등)에 반 응하여 인터페이스 영상의 다수의 알림 항목들은 스크롤 될 수 있다. 사용자가 특정 알림 항목을 터치하 는 경우, 전자 장치는 커버의 디스플레이의 표시를 사용자 터치된 알림 항목의 콘텐츠(480 7)로 전환할 수 있다. 도 49를 참조하면, 전자 장치는 스타일러스의 분리를 감지하는 경우, 스타일러스 관련 어플리케이 션(예: 노트 어플리케이션)을 실행하고, 이에 관한 인터페이스 영상을 커버의 디스플레이에 표 시할 수 있다. 또한, 전자 장치는 도시하지 않은 본체에 탑재된 터치 감지 모듈(예: 터치 패널 252 또 는 펜 센서 254)의 근접 터치 감지 기능을 커버의 디스플레이와 연동시킬 수 있다. 인터페이스 영상 은 스타일러스를 이용한 터치 앤 드래그 입력에 의한 그리기 기능을 제공할 수 있다. 도 50을 참조하면, 전자 장치는 메시지 수신을 감지하고, 이에 관한 인터페이스 영상을 커버의 디스플레이에 표시할 수 있다. 인터페이스 영상은 메시지 수발신 이력을 포함할 수 있다. 도 51을 참조하면, 전자 장치는 호(call)를 감지하고, 이에 관한 인터페이스 영상을 커버의 디스 플레이에 표시할 수 있다. 인터페이스 영상은 발신자 정보, 호 수신, 호 수신 거부 등에 관한 콘텐츠 를 제공할 수 있다. 도시하지 않았지만, 이 밖의 다양한 이벤트(예: 알람, 일정 등)에 관한 실시예도 가능하다. 상술한 바와 같이, 커버의 디스플레이의 화면 면적은 도시하지 않는 본체의 터치스크린의 화 면 면적보다 작을 수 있다. 도 52를 참조하면, 전자 장치는 화면 잠금 어플리케이션을 실행하고, 이에 관한 인터페이스 영상을 커 버의 디스플레이에 표시할 수 있다. 인터페이스 영상은 터치 패턴 입력 방식에 의한 화면 잠금 해제 방식을 제공할 수 있다. 사용자에 의한 해제 터치 패턴이 입력되는 경우, 전자 장치는 도시하지 않은 본체의 터치스크린의 화면 잠금을 해제할 수 있다. 도시하지 않았지만, 비밀 번호 또는 핀 번호 입력 방식을 이용한 화면 잠금 어플리케이션에 관한 실시예도 가능하다.한편 본 발명의 상세한 설명에서는 구체적인 실시 예에 관해 설명하였으나, 본 발명의 범위에서 벗어나지 않는 한도 내에서 여러 가지 변형이 가능하다. 그러므로 본 발명의 범위는 설명된 실시 예에 국한되어 정해져서는 아 니 되며 후술하는 특허청구의 범위뿐만 아니라 이 특허청구의 범위와 균등한 것들에 의해 정해져야 한다. 또한, 본 발명의 청구항 및/또는 명세서에 기재된 실시 예들에 따른 방법들은 하드웨어, 소프트웨어, 또는 하드 웨어와 소프트웨어의 조합의 형태로 구현될(implemented) 수 있다. 소프트웨어로 구현하는 경우, 하나 이상의 프로그램(소프트웨어 모듈)을 저장하는 컴퓨터 판독 가능 저장 매체 가 제공될 수 있다. 컴퓨터 판독 가능 저장 매체에 저장되는 하나 이상의 프로그램은, 전자 장치(device) 내의 하나 이상의 프로세서에 의해 실행 가능하도록 구성된다. 하나 이상의 프로그램은, 전자 장치로 하여금, 본 발 명의 청구항 및/또는 명세서에 기재된 실시 예들에 따른 방법들을 실행하게 하는 명령어를 포함한다. 이러한 프로그램(소프트웨어 모듈, 소프트웨어)은 랜덤 액세스 메모리(random access memory), 플래시(flash) 메모리를 포함하는 불휘발성(non-volatile) 메모리, 롬(ROM, Read Only Memory), 전기적 삭제가능 프로그램가 능 롬(EEPROM, Electrically Erasable Programmable Read Only Memory), 자기 디스크 저장 장치(magnetic disc storage device), 컴팩트 디스크 롬(CD-ROM, Compact Disc-ROM), 디지털 다목적 디스크(DVDs, Digital Versatile Discs) 또는 다른 형태의 광학 저장 장치, 마그네틱 카세트(magnetic cassette)에 저장될 수 있다. 또는, 이들의 일부 또는 전부의 조합으로 구성된 메모리에 저장될 수 있다. 또한, 각각의 구성 메모리는 다수 개 포함될 수도 있다."}
{"patent_id": "10-2013-0162160", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 다양한 실시예에 따른 전자 장치를 포함하는 네트워크 환경을 도시한다. 도 2는 본 발명의 다양한 실시예에 따른 전자 장치의 블록도이다. 도 3은 본 발명의 다양한 실시예에 따른 프로그래밍 모듈의 블록도이다. 도 4는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 5는 본 발명의 다양한 실시예에 따른 전자 장치의 본체의 사시도이다. 도 6은 본 발명의 다양한 실시예에 따른 커버의 사시도이다. 도 7 및 8은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도들이다. 도 9는 본 발명의 다양한 실시예에 따른 입출력 제어 모듈의 블록 구성도이다. 도 10은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도이다. 도 11 및 12는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도들이다. 도 13은 본 발명의 다양한 실시예에 따른 커버의 배치 위치를 결정하는 절차의 순서도이다. 도 14는 본 발명의 다양한 실시예에 따를 전자 장치의 사시도이다. 도 15는 본 발명의 다양한 실시예에 따른 커버의 배치 위치를 결정하는 절차의 순서도이다. 도 16은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 17 내지 19는 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도들이다. 도 20 및 21은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도들이다. 도 22 및 23은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도들이다. 도 24 내지 27은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 28 내지 30은 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도들이다. 도 31 및 32는 본 발명의 다양한 실시예에 따른 전자 장치의 사시도들이다. 도 33 및 34는 본 발명의 다양한 실시예에 따른 디스플레이 제어 절차의 순서도들이다. 도 35 및 36은 본 발명의 다양한 실시예에 따른 전자 장치의 사시도이다. 도 37은 본 발명의 다양한 실시예에 따른 터치 감지 모듈의 제어 절차의 순서도이다. 도 38은 본 발명의 다양한 실시예에 따른 입출력 제어 절차의 순서도이다. 도 39는 본 발명의 다양한 실시예에 따는 전자 장치의 사시도이다. 도 40은 본 발명의 다양한 실시예에 따른 입출력 제어 절차의 순서도이다. 도 41 내지 52는 본 발명의 다양한 실시예에 따른 전자 장치의 화면들이다."}
