{"patent_id": "10-2022-0059706", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2023-0160093", "출원번호": "10-2022-0059706", "발명의 명칭": "서로 다른 시간대에 만들어진 정사영상을 매핑시켜 주제도를 생성하는 방법 및 시스템.", "출원인": "주식회사 테이슨", "발명자": "김영우"}}
{"patent_id": "10-2022-0059706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "비행체가 서로 다른 시간대에 각각 비행하면서 각각 항공 촬영하는 단계(S100)와, 상기 비행체가 서로 다른 시간대에 각각 촬영한 항공사진과 위치정보와 GCP정보를 토대로 각각의 정사영상을 만드는 단계(S200)와, 서로 다른 시간대에 만들어진 각각의 정사영상을 매핑시켜 시간대 별로 특정지역 또는 시설물의 변경 변화 여부 확인할수 있는 주제도를 생성하는 단계(S300)를 포함하되,상기 서로 다른 시간대에 만들어진 각각의 정사영상을 매핑시켜 시간대 별로 특정지역 또는 시설물의 변경 변화여부 확인할 수 있는 주제도를 생성하는 단계(S300)는, 맵화면 상에 검출영역을 설정하는 단계(S310)와, 검출영역에 대응하는 기준영역과 후보영역을 종래 만들어진 정사영상과 최근에 만들어진 정사영상에 각각 설정하는 단계(S320)와, 종래 만들어진 정사영상 속 기준영역과 최근에 만들어진 정사영상 속 후보영역에 포함된 각각의 지상 기준점을 확인하는 단계(S330)와, 각각의 기준영역과 후보영역의 센터에 가상의 기준점을 생성하는 단계(S340)와, 가상의 기준점을 중심으로 기준영역과 후보영역을 매핑시키는 단계(S350)와, 기준영역을 중심으로 후보영역를 상하좌우로 이동시켜 지상 기준점을 겹치게 배치하는 단계(S360)와, 겹치게 되는 지상 기준점의 위치를 매핑 기준점으로 인덱싱하는 단계(S370)와, 중첩된 기준영역과 후보영역의 변경 변화 여부를 확인할 수 있는 주제도를 생성하는 단계(S380)와, 상기 주제도를 확인할수 있는 검출항목을 리스트업하는 단계(S390)로 된 주제도 생성 방법."}
{"patent_id": "10-2022-0059706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,상기 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S390)는,리스트업된 다수의 검출항목 중 하나 이상을 선택하는 한편 선택된 검출항목에 적용할 인공지능모듈 중 하나 이상을 선택하는 단계(S400)와, 선택된 인공지능모듈을 선택된 검출항목의 인덱스된 매핑 기준점을 중심으로 중첩되는 기준영역과 후보영역에 각각 적용시켜 새로운 주제도를 생성하는 단계(S410)와, 상기 새로운 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S420)를 포함하는 주제도 생성 방법."}
{"patent_id": "10-2022-0059706", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서,상기 인공지능모듈은 기준영역과 후보영역 상에 존재하는 차량이나 건물 혹은 쓰레기 색변화 도로경계 사람 중어느 하나 이상을 선택하는 단계 및 검출하는 단계를 포함하는 주제도 생성 방법."}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 서로 다른 시간에 반복 촬영된 항공사진을 이용해 만든 각각의 정사영상을 매핑시켜 시간대 별로 특정 지역의 혹은 시설물 등의 변경 변화 여부를 확인하는 주제도를 생성하는 방법에 관한 것으로, 특히 매핑시 동일 시설물의 위치가 일치되게 조정하여 시설물 또는 지형의 변경 변화 여부를 정화하게 확인할 수 있도록 하는 한편, 상기 주제도를 리스트업하여 인공지능모듈을 선택적으로 적용 가능하게 구성함으로써, 같은 지역의 새로운 주제도를 용이하게 생성하고 변경 변화 여부를 용이하게 확인할 수 있게 한 것이다."}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 서로 다른 시간에 반복 촬영된 항공사진을 이용해 만든 각각의 정사영상을 매핑시켜 시간대 별로 특 정지역의 혹은 시설물 등의 변경 변화 여부를 확인하는 주제도를 생성하는 방법에 관한 것이다."}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "일반적으로 정사영상(Ortho Image)은 드론 또는 항공기 또는 인공위성과 같이 비행체가 촬영한 항공사진들을 높 이 차나 기울어짐 등 지형 기복에 의한 기하학적인 왜곡정보를 보정하여 모든 물체들을 수직한 방향에서 내려다 보았을 때의 모습으로 변환한 영상이다. 그리고 이러한 정사영상은 지오이드 모델(Geoid Model)과 GPS좌표를 사용하여 이미 정의된 좌표값 또는 지상에 설정된 지리적 위치값을 기반으로 한 지상 기준점(GCP:Ground Control Point)을 활용하여 정사 보정된 복수의항공영상을 연결하여 대형 이미지로 만든 것으로, 특히 픽셀간 실재 거리(GSD: Ground Sample Distance)가 일정 하여 거리 계산이나 면적 계산 가능한 것이다. 더불어 주제도(Thematic Map)는 정사영상을 기반으로 하여 지적, 용도, 등의 특징에 맞춰 만들어진 수치지형도 이다. 대표적으로 하나의 정사영상을 토대로 정량분석을 통해 지역별로 색상에 따른 밀도차를 확인할 수 있는 주제도 등도 있지만, 이전에 촬영된 항공영상을 통해 만들어진 정사영상과 최근에 촬영된 항공영상을 통해 만들어진 정 사영상을 매핑시켜 정사영상 속의 산림변화나 시설물 등의 변경 변화 여부를 확인할 수 있게 만들어진 것도 있 다. 참고로 변경 변화 여부를 확인할 수 있게 만들어진 주제도는, 서로 다른 시간대(예, 봄, 여름, 가을, 겨울)에 만들어진 정사영상들을 반복적으로(예, 계절별로 혹은 월별로) 매핑시켜 시설물이나 특정지역의 변경 변화 여부 등을 확인할 수 있게 한 것인데, 서로 다른 시간대에 만들어진 각각의 정사영상을 반복적으로 매핑시켰을 때에 정사영사 속 같은 시설물의 위치가 상이한 문제로 시설물의 위치검출에 어려움이 있게 된다. 즉, 비행체가 서로 다른 시간대에 반복적으로(예, 월별로 혹은 계절별로) 비행할 때마다 지구의 자전 및 공전 변화, 또는 환경요인(예, 바람, 날씨 등등), 좌표 투영법의 차이, 관측기기 오차, 등등에 의해 똑같은 지역을 촬영하더라도 오차가 발생하게 되고, 이로 인해 도 1에 도시된 바와 같이 이전에 만들어진 정사영상과 최근에 만들어진 정사영상을 매칭시켰을 때에 정사영사 속 같은 시설물 등의 위치가 정확하게 일치하지 않아 인공지능모듈을 이용하여 시설물이나 특정지역의 변경 변화 여부를 확인할 때마다 어려움이 있게 되는 것이다. 더욱이 인공지능모듈을 이용할 때에도 정사영상 속에는 기준이 되는 것도 있지만 불필요한 정보도 많이 포함되 고 있다. 간단하게 예를 들면 정사영상 속 시설물들이 위치 변동되지 않게 고정된 것(예, 건물, 도로 등등)도 있지만, 정사영상 속에는 이동차량이나 보행자 등과 같이 그 위치가 계속 변화하는 것들도 포함되어 있어, 주제 도 생성시 필요한 것과 불필요한 것 등을 선택적으로 적용시켜 인식할 필요도 있는 것이다. 선행기술문헌 특허문헌"}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 서로 다른 시간대에 촬영된 항공영상으로 만들어진 각각의 정사영상들을 반복적으로 매핑시켜 시간대 별로 특정지역 혹은 시설물 등의 변경 변화 여부를 확인하기 위한 주제도를 생성하는 방법에 관한 것으로, 특히 반복적으로 매핑되는 복수의 정사영사 속 같은 시설물의 위치를 용이하게 일치시켜 시설물 등의 변경 변화 여부를 확인할 수 있도록 하고자 하는 것이다. 또한, 본 발명은 특정지역 검색시 동일 위치의 시간별 변화 이미지를 목록화하는 한편, 사전에 목록화된 이미지 에 가상의 기준점을 기준으로 인공지능모듈을 선택적으로 추가/삭제 가능하게 적용시켜 쉽게 새로운 주제도 생 성하거나 변경 변화 여부를 용이하게 확인할 수 있게 하고자 한 것이다."}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "이를 위해 본 발명은 비행체가 서로 다른 시간대에 각각 비행하면서 각각 항공 촬영하는 단계(S100)와, 상기 비 행체가 서로 다른 시간대에 각각 촬영한 항공사진과 위치정보와 GCP정보를 토대로 각각의 정사영상을 만드는 단 계(S200)와, 서로 다른 시간대에 만들어진 각각의 정사영상을 매핑시켜 시간대 별로 특정지역 또는 시설물의 변 경 변화 여부 확인할 수 있는 주제도를 생성하는 단계(S300)를 포함하되, 상기 서로 다른 시간대에 만들어진 각각의 정사영상을 매핑시켜 시간대 별로 특정지역 또는 시설물의 변경 변화 여부 확인할 수 있는 주제도를 생성하는 단계(S300)는, 맵화면 상에 검출영역을 설정하는 단계(S310)와, 검출영역에 대응하는 기준영역과 후보영역을 종래 만들어진 정 사영상과 최근에 만들어진 정사영상에 각각 설정하는 단계(S320)와, 종래 만들어진 정사영상 속 기준영역과 최 근에 만들어진 정사영상 속 후보영역에 포함된 각각의 지상 기준점을 확인하는 단계(S330)와, 각각의 기준영역 과 후보영역의 센터에 가상의 기준점을 생성하는 단계(S340)와, 가상의 기준점을 중심으로 기준영역과 후보영역 을 매핑시키는 단계(S350)와, 기준영역을 중심으로 후보영역를 상하좌우로 이동시켜 지상 기준점을 겹치게 배치 하는 단계(S360)와, 겹치게 되는 지상 기준점의 위치를 매핑 기준점으로 인덱싱하는 단계(S370)와, 중첩된 기준 영역과 후보영역의 변경 변화 여부를 확인할 수 있는 주제도를 생성하는 단계(S380)와, 상기 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S390)로 된 것이다. 또한, 본 발명의 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S390)는, 리스트업된 다수의 검출항목 중 하나 이상을 선택하는 한편 선택된 검출항목에 적용할 다수의 인공지능모듈 중 하나 이상을 선택하는 단계(S400)와, 선택된 인공지능모듈을 선택된 검출항목이 인덱스된 매핑 기준점을 중심으 로 중첩되는 기준영역과 후보영역에 각각 적용시켜 새로운 주제도를 생성하는 단계(S410)와, 상기 새로운 주제 도를 확인할 수 있는 검출항목을 리스트업하는 단계(S420)를 포함하는 것이다. 또한, 본 발명은 상기 인공지능모듈이 기준영역과 후보영역 상에 존재하는 차량이나 건물 혹은 쓰레기 색변화 도로경계 사람 중 어느 하나 이상을 선택되는 단계를 포함하는 것이다."}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "따라서 본 발명은 서로 다른 시간대에 촬영된 항공영상으로 만들어진 각각의 정사영상들을 반복적으로 매핑시킬 때에 가상의 기준점을 통해 일치시킨 후 지상 기준점을 통해 각각의 시설물 등의 위치가 일치되게 조정되면서 좀 더 정확하고 쉽게 시설물 등의 변경 변화 여부를 확인할 수 있는 주제도를 생성할 수 있게 되었고, 특히 종래 목록화된 검출영역 또는 후보영역 별도로 차량검출 또는 건물상부 검출, 쓰레기 검출, 색변화검출, 도로경계 검출, 사람 검출을 위한 인공지능모듈을 선택적으로 추가/삭제 가능하게 적용시켜, 같은 지역의 새로 운 주제도를 용이하게 생성하고, 변경 변화 여부를 용이하게 확인할 수 있게 되었다."}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "먼저, 본 발명의 명세서 및 청구범위에 사용되는 용어는 사전적인 의미로 한정 해석되어서는 아니되며, 발명자 는 자신의 발명을 최선의 방법으로 설명하기 위해 용어의 개념을 적절히 정의할 수 있다는 원칙에 입각하여, 본 발명의 기술적인 사상에 부합되는 의미와 개념으로 해석되어야 할 것이다. 따라서 본 명세서에 기재된 실시 예 및 도면에 도시된 구성은 본 발명의 바람직한 실시 예에 불과할 뿐이고, 본 발명의 기술적 사상을 모두 표현하는 것은 아니므로, 출원 시점에 있어서 이들을 대체할 수 있는 다양한 균등물"}
{"patent_id": "10-2022-0059706", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "과 변형 예들이 존재할 수 있음을 이해하여야 할 것이다.이하, 본 발명을 실시하기 위한 구체적인 내용은 첨부된 도면을 참고하여 상세히 설명하기로 한다. 도 2는 본 발명의 실시 예에 따른 주제도 생성방법을 보여주는 순서도이고, 도 3은 정사영상을 생성하는 방법을 보여주는 것이고, 도 4 내지 도 9는 주제도를 생성하는 과정을 좀 더 구체적으로 보여주는 것이다. 이를 참고하여 설명하면, 본 발명은 비행체가 서로 다른 시간대에 각각 비행하면서 각각 항공 촬영하는 단계 (S100)와, 상기 비행체가 서로 다른 시간대에 각각 촬영한 항공사진과 위치정보와 GCP정보를 토대로 각각의 정사영상을 만 드는 단계(S200)와, 서로 다른 시간대에 만들어진 각각의 정사영상을 매핑시켜 시간대 별로 특정지역 또는 시설물의 변경 변화 여부 확인할 수 있는 주제도를 생성하는 단계(S300)를 포함한다. 여기서 비행체가 서로 다른 시간대에 각각 비행하면서 각각 항공 촬영하는 단계(S100)는, 동일 지역 내에 같은 위치를 반복 촬영하기 위하여, GPS를 포함하고 있는 비행체가 자동 비행 기록기를 통해 동 일한 촬영각도와 고도를 유지한 상태로 지정된 비행경로를 따라 이동하면서 항공 촬영하는 것이다. 더불어 상기 비행체는 서로 다른 시간대(예, 월/계절/연 단위로)에 반복 비행하면서 같은 지역을 반복하여 항공 촬영하고, 특히 항공촬영시 위치정보와 시간정보를 확보하여 초기비행과 항공촬영시 시점을 확인할 수 있게 기 록한다. 또한, 상기 비행체가 서로 다른 시간대에 각각 촬영한 항공사진과 위치정보와 GCP정보를 토대로 각각의 정사영 상을 만드는 단계(S200)는, 관리서버에 비행체가 촬영한 항공사진들을 업로드하게 되면, 업로드한 항공사진들을 시계열화한 후, 각각의 항 공사진들을 연결하여 대형 이미지로 만든다. 이때 관리서버는 서로 다른 시간대에 동일한 지역을 반복하여 촬영한 항공사진을 업로드하였을 경우에도 반복하 여 정사영상을 만들고, 특히 관리서버에 의해 만들어진 각각의 정사영상은 60m~1150m 상공에서 항공 촬영된 영상을 연결하여 픽셀간 실 재거리(GSD)를 2~3m이하로 일정하게 유지하되, GPS를 통해 확보된 위치정보와 각각의 비행경로를 따라 위치한 지상 기준점(GCP)의 위치값을 통해 지형 기복에 의해 기하학적으로 왜곡된 정보를 정사보정하여, 2-3도 내외로 수직한 방향에서 내려다보았을 때의 모습을 형성 한다. 또한, 서로 다른 시간대에 만들어진 각각의 정사영상을 매핑시켜 시간대 별로 특정지역 또는 시설물의 변경 변 화 여부 확인할 수 있는 주제도를 생성하는 단계(S300)는, 먼저, 맵화면 상에 검출영역을 설정하는 단계(S310)와, 검출영역에 대응하는 기준영역과 후보영역을 종래 만들 어진 정사영상과 최근에 만들어진 정사영상에 각각 설정하는 단계(S320)와, 종래 만들어진 정사영상 속 기준영 역과 최근에 만들어진 정사영상 속 후보영역에 포함된 각각의 지상 기준점을 확인하는 단계(S330)와, 각각의 기 준영역과 후보영역의 센터에 가상의 기준점을 생성하는 단계(S340)와, 가상의 기준점을 중심으로 기준영역과 후 보영역을 매핑시키는 단계(S350)와, 기준영역을 중심으로 후보영역를 상하좌우로 이동시켜 지상 기준점을 겹치 게 배치하는 단계(S360)와, 겹치게 되는 지상 기준점를 매핑 기준점으로 인덱싱하는 단계(S370)와, 중첩된 기준 영역과 후보영역의 변경 변화 여부를 확인할 수 있는 주제도를 생성하는 단계(S380)와, 상기 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S390)를 포함하는 것이다. 더불어 상기 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S390)는, 리스트업된 다수의 항목 중 하나 이상을 선택하는 한편 다수의 인공지능모듈 중 하나 이상을 선택하는 단계 (S400)와, 선택된 인공지능모듈을 해당 항목의 인덱스된 매핑 기준점을 중심으로 중첩되는 기준영역과 후보영역 에 적용시켜 새로운 주제도를 생성하는 단계(S410)와, 상기 새로운 주제도를 확인할 수 있는 검출항목을 리스트 업하는 단계(S420)를 포함하는 것이다. 도 4는 검출영역을 설정하는 모습을 보여주는 것으로, 이를 참고하여 설명하면, 맵화면 상에 검출영역을 설정하 는 단계(S310)는,상기 맵 화면이 위치정보(예, 위도, 경도)를 포함하고 있어, 맵 화면상에 특정지역을 다각형으로 혹은 원형으로 검출영역을 설정하게 되면, 설정된 검출영역에 대응하는 위치정보와 면적값을 토대로 대응하는 실제 영역을 검 색/검출할 수 있게 된다. 이때 검출영역은 실시 예에 따라 검색창에 주소(예, 경기도 양평균 옥천면 경강로 1276)와 면적값(예, 3000m2) 를 입력하여 검출영역을 설정하게 되면, 설정된 검출영역에 대응하는 위치정보와 면적값을 확보한 후 이를 토대 로 대응하는 실제 영역을 검색/검출할 수도 있는 것이다. 도 5는 기준영역과 후보영역을 보여주는 것으로, 이를 참고하여 설명하면, 상기 검출영역에 대응하는 기준영역 과 후보영역을, 종래 만들어진 정사영상과 최근에 만들어진 정사영상에 각각 설정하는 단계(S320)는, 검출영역 설정시 확보된 위치정보와 면적값을 토대로 종래 만들어진 정사영상과 최근에 만들어진 정사영상에 각 각 상기 검출영역에 대응하는 위치정보와 면적값을 토대로 기준영역과 후보영역을 형성하고, 상기 기준영역과 후보영역을 추출하여 해당 영역만큼 주제도를 생성하기 위한 것이다.. 이때 위치정보와 면적값은 서로 다른 시간대에 만들어진 각각의 정사영상에 기준영역와 후보영역을 설정하면서, 비행체가 동일 경로로 비행하더라도 지구의 자전 및 공전 변화와, 환경요인(예, 바람, 날씨 등등) 또는 GPS오차 등에 의해 똑같은 지역을 촬영하더라도 약간의 오차가 발생하게 된다. 따라서 종래 만들어진 정사영상 속 기준영역과 최근에 만들어진 정사영상 속 후보영역에 포함된 각각의 지상 기 준점을 확인하는 단계(S330)와, 각각의 기준영역과 후보영역의 센터에 가상의 기준점을 생성하는 단계(S340)와, 가상의 기준점을 중심으로 기준영역과 후보영역을 매핑시키는 단계(S350)와, 기준영역을 중심으로 후보영역를 상하좌우로 이동시켜 지상 기준점을 겹치게 배치하는 단계(S360)와, 겹치게 되는 지상 기준점을 매핑 기준점으 로 인덱싱하는 단계(S370)와, 중첩된 기준영역과 후보영역의 변경 변화 여부를 확인할 수 있는 주제도를 생성하 는 단계(S380)를 포함하여 이루어져, 기준영역과 후보영역 속 동일한 위치의 시설물 등이 일치된 상태로 중첩되 게 하고자 하는 것이다. 더불어 종래 만들어진 정사영상 속 기준영역과 최근에 만들어진 정사영상 속 후보영역에 포함된 각각의 지상 기 준점을 확인하는 단계(S330)는, 항공사진을 업로드할 때에 혹은 정사영상을 만들 때에 등록된 지상 기준점에 대한 실제 위치정보 및 면적값을 로드하여 각각의 후보영역과 기준영역에 소정의 면적을 가진 각각의 지상 기준점의 위치를 마킹하여 이미지 상 에서 각각의 지상 기준점의 위치를 확인할 수 있게 한다. 더불어 각각의 기준영역과 후보영역의 센터에 가상의 기준점을 생성하는 단계(S340)는, 각각의 기준영역과 후보영역의 센터에 소정의 면적을 가진 가상의 기준점을 생성하여 확인할 수 있게 하는 한편, 각각의 기준영역과 후보영역 속 이미지 상에 생성된 가상의 기준점에 대한 실제 위치정보 및 면적값을 픽 셀간 실제 거리값과 지상 기준점의 위치정보를 통해 연산한다. 이때 연산된 가상의 기준점에 대한 위치정보 및 면적값은 지상 기준점으로 등록되어 새로운 기준영역과 후보영 역 설정시 로드된다. 더불어 가상의 기준점을 중심으로 기준영역과 후보영역을 매핑시키는 단계(S350)는, 기준영역 위로 후보영역을 매핑하되, 센터에 형성된 가상의 기준점을 중심으로 기준영역 위로 후보영역을 중첩 시키는 것이다. 이때 기준영역과 후보영역의 센터에 형성된 가상의 기준점을 중심으로 주변에 배치된 복수의 지 상 기준점들이 일부 중첩된 상태에 있게 된다. 더불어 기준영역을 중심으로 후보영역를 상하좌우로 이동시켜 지상 기준점을 겹치게 배치하는 단계(S360)는, 기준영역과 후보영역이 매핑되었을 때에 일부 중첩된 상태에 있는 지상 기준점들을 상기 후보영역의 위치를 조 정하여 최대한 많은 수량의 지상 기준점들이 중첩되게 하는 동시에 각각의 지상기준점이 최대한 넓은 면적으로 중첩되게 조정하는 것이다. 이때 후보영역의 위치조정 방향은 가운데를 중심으로 중첩된 지상기준점의 수가 많은 방향으로 이동하여 각각의 지상 기준점이 최대한 넓은 면적으로 기준영역의 지상기준점과 중첩되게 하되, 상기 후보영역이 소정의 각도로 회전하면서 혹은 지상 기준점의 면적 이하로 이동시켜 최적화하면서 최대한 많은 수량의 지상기준점이 기준영역 의 지상 기준점과 중첩되게 한다.더불어 겹치게 되는 지상 기준점을 매핑 기준점으로 인덱싱하는 단계(S370)는, 상기 기준영역과 후보영역을 중첩시킬 때에 일부 중첩되는 지상 기준점을 매핑 기준점으로 선정하는 것이며, 바 람직하게는 센터에 형성된 가상의 기준점을 포함하여 인덱싱 함으로써, 후술할 인공지능모듈을 적용시켜 해당 지역에 새로운 주제도 형성할 때에 인덱싱된 매핑 기준점을 통해 용이하 게 새로운 주제도를 생성할 수 있게 한 것이다. 더불어 중첩된 기준영역과 후보영역의 변경 변화 여부를 확인할 수 있는 주제도를 생성하는 단계(S380)는, 상기 후보영역의 위치를 조정하여 기준영역과 일치되게 중첩하였을 때에 기준치 이하의 유사도를 가진 상이한 영역을 찾고, 상기 상이한 영역의 위치정보 및 유사도 혹은 면적값 등을 저장해 놓는 것이다. 더불어 상기 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S390)는, 도 6에 도시된 바와 같이, 주제도를 생성한 후에는 검출항목이 관리창에 리스트업되고, 특히 검출항목이 리스트 업(List Up) 될 때에 제목(검출영역), 등록일자, 용량 확인 가능하게 리스트업되고, 특히 각각의 검출항목별로 구비된 상세보기 버튼을 통해 주제도를 확인할 수 있게 구성된다. 더불어 리스트업된 다수의 검출항목 중 하나 이상을 선택하는 한편 선택된 검출항목에 적용할 인공지능모듈 중 하나 이상을 선택하는 단계(S400)는, 도 6에 도시된 바와 같이, 각각의 검출항목별로 구비된 체크박스 중 어느 하나 이상을 선택하고 다음버튼을 누 르게 되면 도 7에 도시된 바와 같이 선택된 검출항목에 적용시킬 다양한 인공지능모듈과 함께 체크박스가 구비 되어 선택된 검출항목에 다양한 인공지능모듈을 선택적으로 적용시킬 수 있게 된다. 이때 인공지능모듈은 저장된 정사영상 속에 라벨링된 각각의 시설물 정보를 토대로 학습하여 각각의 인공지능모 듈별로 각각의 시설물을 분리 인식할 수 있게 구성된다. 대표적으로 CNN학습모델을 통해 정사영상 속에 존재하는 자동차 또는 건물상부 또는 쓰레기 검출 또는 색변화 또는 도로경계 또는 사람 검출을 가능한 것이며, 특히 서트 파티(3rd Party) 프로그램에 따라 범용성 있게 새로 운 인공지능모듈을 추가 적용시킬 수 있는 것이다. 더불어 선택된 인공지능모듈을 선택된 검출항목의 인덱스된 매핑 기준점을 중심으로 중첩되는 기준영역과 후보 영역에 각각 적용시켜 새로운 주제도를 생성하는 단계(S410)는, 인공지능모듈을 통해 기준영역과 후보영역 속에 존재하는 특정 시설물을 분리 인식한 후 매핑시 인덱스된 매핑 기준점을 중심으로 기준영역과 후보영역을 일치되게 중첩시켜 특정 시설물의 위치 변화 변경여부 등을 확인하기 위한 것이다. 즉, 도 8은 선유도에 버려진(방치된) 차량을 확인하기 위한 주제도로서, 간단하게 예를 들면, 상기 인공지능모 듈이 차량검출을 위한 것이라면, 기준영역과 후보영역 속에 존재하는 차량을 찾아 인식하게 된다. 이때 기준영역과 후보영역을 중첩할 경우에는 기준영역과 후보영역에 검출된 차량의 변경 변화 여부를 확인할 수 있게 되고, 만일 기준영역에 존재하는 차량이 후보영역 같은 위치에 계속 존재한다면 종래부터 최근까지 계속 방치된 차량 으로 인식하게 되는 것이고, 그렇지 않으면 차량이 이동되거나 새롭게 주차된 차량으로 인식하는 것이다. 이때 주제도는 shp파일 같이 보기, 시계열보기, 검출정보 보기, 변경 변화 보기 가능하며, 특히 새롭게 생성된 주제도 번호와, 검출일자, 검출자, 검출수(차량), 변경 검출수(차량) 변화수 등을 확인할 수 있으며, 특히 해당 지역을 검출한 다른 시간대의 검출항목 역시 주제도와 함께 목록화되면 서로 다른 시간대에 만들어진 주제도 역시 확인할 수 있게 구성된다. 더불어 새로운 주제도를 확인할 수 있는 검출항목을 리스트업하는 단계(S420)는, 도 9에 도시된 바와 같이 인공지능모듈을 선택적으로 추가하여 새로운 주제도를 생성하였을 때에, 이를 확인할 수 있는 검출항목이 관리창에 리스트업되고, 실시 예에 따라서는 새롭게 생성된 주제도에 또 다른 인공지능모듈 을 적용시켜 불법 건출물 증축 시공이나, 색상변화를 통한 산림유실이나 제선충 등의 발생유무 등을 확인할 수 있는 또 다른 주제도를 쉽게 생성할 수 있게 하는 것이다.도 10은 본 발명이 실시 예에 따른 주제도 생성 시스템의 구성을 간략하게 보여주는 것이다. 이를 참고하여 설명하면 서로 다른 시간대에 반복하여 항공촬영하는 비행체와, 상기 비행체가 촬영한 항공 사진을 토대로 정사영상을 만든 후 이를 토대로 주제도를 생성하는 관리서버를 포함한다. 비행체는 GPS를 포함하고 있고 특히 자동 비행 기록기를 통해 동일한 촬영각도와 고도를 유지한 상태로 지 정된 비행경로를 따라 자동 비행하면서 동일 장소를 반복하여 항공 촬영 가능한 것이다. 또한, 관리서버는 상기 비행체가 서로 다른 시간대에 반복하여 촬영한 항공사진을 토대로 각각의 정사영상 을 만든 후, 서로 다른 시간대에 만들어진 복수의 정사영상을 매칭시켜 시설물 또는 주변 지형 등의 변경 변화 여부를 확인할 수 있는 주제도를 생성 관리 하는 것이다. 참고로. 시설물은 변경 변화여부를 확인하기 위한 대상물로서, 대표적으로 건물, 차량, 도로 등등 일 수도 있지 만, 실시 예에 따라서는 토지 유실로 색상 변화되는 지역이나 산림 변화되는 지역 또는 사람들을 포함하는 넓은 의미의 것이다. 더불어 관리서버는 항공사진을 유무선으로 업로드할 때에 상기 드론의 GPS를 통해 확보한 위치정보와 정사 영상을 만들기 위한 지상 기준점의 위치정보와 시계열화된 항공사진과 정사영상과 주제도를 각각 로드하거나 확 인할 수 있게 각각의 정상영상DB를 구축하고 있다. 더불어 관리서버는 맵 화면 상에 검출영역 설정시 대응하는 기준영역과 후보영역을 각각의 정사영상에 설정 할 수 있게 구성되는 한편, 상기 기준영역과 후보영역을 중첩할 때에 가상의 기준점을 중심으로 주변에 위치한 각각의 지상 기준점을 최대한 많은 수량과 면적으로 일치되게 하여 변경 또는 변화 여부를 확인할 수 있는 주제 도를 생성 관리할 수 있게 구성되고, 이를 위한 주제도 DB를 포함한다. 더불어 관리서버는 정사영상 속 라벨링된 각각의 시설물의 정보를 토대로 각각의 시설물을 학습하여 각각의 정사영상 속 시설물을 각각 구분하여 인식할 수 있는 인공지능모듈을 포함한다. 이때의 인공지능모듈은 시계화된 정보를 토대로 학습 가능한 CNN 학습모듈이 바람직하며, 정사영상 속 자동 차 또는 건물상부 또는 쓰레기 검출 또는 색변화 또는 도로경계 또는 사람을 선택적으로 검출 가능한 서트 파티 (3rd Party) 프로그램으로 추가 확장 가능하게 모듈화된 것이다. 지금까지 본 발명은 첨부된 도면을 참고하여 설명하였으나, 이는 예시적인 것에 불과하며, 당해 기술이 속하는 분야에서 통상의 지식을 가진 자라면 이로부터 다양하게 변형 및 균등이론에 의해 용이하게 실시할 수 있을 것 이다. 따라서 본 발명의 진정한 기술적 보호범위는 특허청구범위에 의해서 정해져야 할 것이다."}
{"patent_id": "10-2022-0059706", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 정사영상을 매핑시켰을 때의 모습을 보여주는 화면, 도 2는 본 발명의 실시 예에 따른 주제도 생성방법을 보여주는 순서도. 도 3은 정사영상을 만드는 과정을 보여주는 개념도. 도 4는 특정지역의 주제도를 만들기 위한 검색화면을 보여주는 화면구성도. 도 5는 복수의 정사영상을 매핑시켰 때에 동일 시설물의 위치를 일치시켜 주는 모습을 보여주는 개념도. 도 6은 검색된 지역을 목록화한 모습을 보여주는 화면. 도 7은 종래 확보된 검색지역의 이미지에 인공지능모듈을 선택적으로 적용시키는 모습을 보여주는 화면. 도 8은 인공지능모듈이 적용된 주제도를 보여주는 화면 도 9는 동일 위치에 다시 인공지능모듈이 적용시키는 모습을 보여주는 화면. 도 10은 시스템 구성을 보여주는 블럭도."}
