{"patent_id": "10-2024-7042680", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0048658", "출원번호": "10-2024-7042680", "발명의 명칭": "염기 해상도에서 유전자 보존 및 발현 보존의 인공 지능 기반 검출", "출원인": "일루미나, 인코포레이티드", "발명자": "자가나단 키쇼르"}}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "염기 해상도에서 유전자 발현의 변화를 검출하는 인공 지능 기반 시스템으로서,시퀀스 데이터베이스에 액세스하고 입력 염기 시퀀스를 생성하는 입력 생성 로직으로서, 상기 입력 염기 시퀀스는 타깃 염기 시퀀스를 포함하고, 상기 타깃 염기 시퀀스는 하류 컨텍스트 염기를 갖는 우측 염기 시퀀스 및 상류 컨텍스트 염기를 갖는 좌측 염기 시퀀스에 의해 플랭킹되는, 상기 입력 생성 로직;상기 입력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하는 생물학적 양 모델; 및상기 입력 염기 시퀀스의 대체 표현을 처리하고 복수의 생물학적 양 출력 시퀀스를 생성하는 생물학적 양 출력생성 로직을 포함하되,상기 복수의 생물학적 양 출력 시퀀스에서 제1 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 각각의타깃 염기에 대한 제1 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제1 각각의 염기 당 생물학적 양 출력은 복수의 종에 걸쳐 상기 각각의 타깃 염기의 각각의 진화 보존 측정치를 특정하고,상기 복수의 생물학적 양 출력 시퀀스에서 제2 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 각각의타깃 염기에 대한 제2 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제2 각각의 염기 당 생물학적 양 출력은 상기 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 타깃염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 각각의 진화 보존 측정치는 신경 치환의 널 모델로부터의 편차를 특정하여 보존으로서 상기 타깃 염기 시퀀스에서의 주어진 위치에서 주어진 타깃 염기의 치환율의 감소를 검출하고, 가속으로서 상기주어진 위치에서 상기 주어진 타깃 염기의 치환율의 증가를 검출하는 계통 P-값(phyloP) 점수인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제2항에 있어서, 상기 각각의 진화 보존 측정치는 보존된 상태 또는 비보존된 상태를 갖는 주어진 위치에서 주어진 목표 염기의 사후 확률을 특정하는 phastCons 점수인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제2항에 있어서, 상기 각각의 진화 보존 측정치는 상기 복수의 종에 걸쳐 상기 주어진 위치에서 상기 주어진 타깃 염기의 치환의 수 감소를 특정하는 게놈 진화 속도 프로파일링(GERP) 점수인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제1항에 있어서, 상기 각각의 전사 개시 측정치는 상기 주어진 위치에서 상기 주어진 타깃 염기의 전사 개시 빈도를 특정하는 유전자 발현(CAGE) 점수의 캡 분석인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제1항에 있어서, 상기 복수의 생물학적 양 출력 시퀀스에서의 제3 생물학적 양 출력 시퀀스는 상기 타깃 염기시퀀스에서의 상기 각각의 타깃 염기에 대한 제3 각각의 염기 당 생물학적 양 출력을 포함하고,상기 제3 각각의 염기 당 생물학적 양 출력은 상기 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 타깃염기의 각각의 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템.공개특허 10-2025-0048658-3-청구항 7 제6항에 있어서, 상기 후생적 신호 수준은 DNase I-과민성 부위(DHS) 또는 시퀀싱을 이용한 트랜스포사제 접근가능 염색질에 대한 분석(ATAC-Seq)을 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제6항에 있어서, 상기 후생적 신호 수준은 전사 인자(TF) 결합을 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제6항에 있어서, 후생적 신호 수준은 히스톤 수정(HM) 마크를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제1항에 있어서, 추가로:상기 복수의 생물학적 양 출력 시퀀스를 처리하고 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 생성하는 유전자 발현 모델; 및상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 처리하고, 상기 타깃 염기 시퀀스에서의 상기 각각의 타깃염기에 대한 각각의 염기 당 유전자 발현 출력의 유전자 발현 출력 시퀀스를 생성하는 유전자 발현 출력 생성로직을 포함하도록 구성되되;상기 주어진 위치에서 상기 주어진 타깃 염기에 대한 상기 유전자 발현 출력 시퀀스에서 주어진 염기 당 유전자발현 출력은 상기 주어진 위치에서 상기 주어진 타깃 염기의 유전자 발현 수준의 척도를 특정하는, 인공 지능기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제10항에 있어서, 상기 유전자 발현 수준은 CAGE 전사 시작 부위(CTSS)와 같은 염기 당 메트릭으로 측정되는,인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제10항에 있어서, 상기 유전자 발현 수준은 TPM(transcripts per million) 또는 RPKM(reads per kilobase oftranscript)과 같은 유전자 당 메트릭으로 측정되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제10항에 있어서, 상기 유전자 발현 수준은 FPKM(fragments per kilobase million)과 같은 유전자 당 메트릭으로 측정되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_14", "content": "제1항에 있어서, 변이체 분류 로직을 포함하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서, 상기 변이체 분류 로직은 상기 시퀀스 데이터베이스에 액세스하고 기준 염기 시퀀스를 생성하는 기준 입력 생성 로직을 포함하도록 추가로 구성되고, 상기 기준 염기 시퀀스는 기준 타깃 염기 시퀀스를 포함하고, 상기 기준 타깃 염기 시퀀스는 분석 중인 위치에서의 기준 염기를 포함하고, 상기 기준 염기는 하류 컨텍스트 염기를 갖는 우측 염기 시퀀스 및 상류 컨텍스트 염기를 갖는 좌측 염기 시퀀스에 의해 플랭킹되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제15항에 있어서, 상기 변이체 분류 로직은 상기 시퀀스 데이터베이스에 액세스하고 대체 염기 시퀀스를 생성하는 대체 입력 생성 로직을 포함하도록 추가로 구성되고, 상기 대체 염기 시퀀스는 대체 타깃 염기 시퀀스를 포함하고, 상기 대체 타깃 염기 시퀀스는 상기 분석 중 위치에서 대체 염기를 포함하고, 상기 대체 염기는 상기하류 컨텍스트 염기를 갖는 상기 우측 염기 시퀀스 및 상기 상류 컨텍스트 염기를 갖는 상기 좌측 염기 시퀀스공개특허 10-2025-0048658-4-에 의해 플랭킹되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제15항에 있어서, 상기 변이체 분류 로직은, 상기 생물학적 양 모델이 상기 기준 염기 시퀀스를 처리하고 상기기준 염기 시퀀스의 대체 표현을 생성하게 하고, 추가로 상기 생물학적 양 출력 생성 로직이 상기 기준 염기 시퀀스의 대체 표현을 처리하고 복수의 기준 생물학적 양 출력 시퀀스를 생성하게 하는 기준 처리 로직을 포함하도록 추가로 구성되고,상기 복수의 기준 생물학적 양 출력 시퀀스에서 각각의 기준 생물학적 양 출력 시퀀스는 상기 기준 타깃 염기시퀀스에서의 각각의 기준 타깃 염기에 대한 각각의 염기 당 기준 생물학적 양 출력을 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제17항에 있어서, 상기 복수의 기준 생물학적 양 출력 시퀀스에서의 제1 기준 생물학적 양 출력 시퀀스는 상기기준 타깃 염기 시퀀스에서의 각각의 기준 타깃 염기에 대한 제1 각각의 염기 당 기준 생물학적 양 출력을 포함하고,상기 제1 각각의 염기 당 기준 생물학적 양 출력은 상기 복수의 종에 걸쳐 상기 각각의 기준 타깃 염기의 각각의 진화 보존 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제17항에 있어서, 상기 복수의 기준 생물학적 양 출력 시퀀스에서의 제2 기준 생물학적 양 출력 시퀀스는 상기기준 타깃 염기 시퀀스에서의 상기 각각의 기준 타깃 염기에 대한 제2 각각의 염기 당 기준 생물학적 양 출력을포함하고,상기 제2 각각의 염기 당 기준 생물학적 양 출력은 상기 기준 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 기준 타깃 염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제16항에 있어서, 상기 변이체 분류 로직은, 상기 생물학적 양 모델이 상기 대체 염기 시퀀스를 처리하고 상기대체 염기 시퀀스의 대체 표현을 생성하게 하고, 추가로 상기 생물학적 양 출력 생성 로직이 상기 대체 염기 시퀀스의 대체 표현을 처리하고 복수의 대체 생물학적 양 출력 시퀀스를 생성하게 하는 대체 처리 로직을 포함하도록 추가로 구성되고,상기 복수의 대체 생물학적 양 출력 시퀀스에서 각각의 대체 생물학적 양 출력 시퀀스는 상기 대체 타깃 염기시퀀스에서의 각각의 대체 타깃 염기에 대한 각각의 염기 당 대체 생물학적 양 출력을 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제20항에 있어서, 상기 복수의 대체 생물학적 양 출력 시퀀스에서의 제1 대체 생물학적 양 출력 시퀀스는 상기대체 타깃 염기 시퀀스에서의 각각의 대체 타깃 염기에 대한 제1 각각의 염기 당 대체 생물학적 양 출력을 포함하고,상기 제1 각각의 염기 당 대체 생물학적 양 출력은 상기 복수의 종에 걸쳐 상기 각각의 대체 타깃 염기의 각각의 진화 보존 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제20항에 있어서, 상기 복수의 대체 생물학적 양 출력 시퀀스에서의 제2 대체 생물학적 양 출력 시퀀스는 상기대체 타깃 염기 시퀀스에서의 상기 각각의 대체 타깃 염기에 대한 제2 각각의 염기 당 대체 생물학적 양 출력을포함하고,상기 제2 각각의 염기 당 대체 생물학적 양 출력은 상기 대체 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 대체 타깃 염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템.공개특허 10-2025-0048658-5-청구항 23 제20항에 있어서, 상기 변이체 분류 로직은 상기 제1 기준 생물학적 양 출력 시퀀스 및 상기 제1 대체 생물학적양 출력 시퀀스를 위치별로 비교하고, 상기 제1 기준 생물학적 양 출력 시퀀스 및 상기 제1 대체 생물학적 양출력 시퀀스에서의 위치에 대한 제1 위치별 시퀀스 차이를 갖는 제1 델타 시퀀스를 생성하는 병원성 예측 로직을 포함하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제23항에 있어서, 상기 병원성 예측 로직은 상기 제2 기준 생물학적 양 출력 시퀀스 및 상기 제2 대체 생물학적양 출력 시퀀스를 위치별로 비교하고, 상기 제2 기준 생물학적 양 출력 시퀀스 및 상기 제2 대체 생물학적 양출력 시퀀스에서의 위치에 대한 제2 위치별 시퀀스 차이를 갖는 제2 델타 시퀀스를 생성하도록 추가로구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서, 상기 병원성 예측 로직은 상기 제1 델타 시퀀스 및 상기 제2 델타 시퀀스에 의존하여 상기 대체 염기에 대한 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_26", "content": "제24항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 시퀀스 차이를 제1 누적 시퀀스 값으로 누적하고,상기 제2 위치별 시퀀스 차이를 제2 누적 시퀀스 값으로 누적하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_27", "content": "제26항에 있어서, 상기 제1 누적 시퀀스 값은 상기 제1 위치별 시퀀스 차이의 평균이고, 상기 제2 누적 시퀀스값은 상기 제2 위치별 시퀀스 차이의 평균인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_28", "content": "제26항에 있어서, 상기 제1 누적 시퀀스 값은 상기 제1 위치별 시퀀스 차이의 합이고, 상기 제2 누적 시퀀스 값은 상기 제2 위치별 시퀀스 차이의 합인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_29", "content": "제26항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 시퀀스 값 및 상기 제2 누적 시퀀스 값에 의존하여상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_30", "content": "제29항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 시퀀스 값 및 상기 제2 누적 시퀀스 값의 평균에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_31", "content": "제29항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 시퀀스 값 및 상기 제2 누적 시퀀스 값의 합에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_32", "content": "제23항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 시퀀스 차이에 기초하여 상기 제1 델타 시퀀스에서의 위치를 보존된 상태 또는 비보존된 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_33", "content": "제32항에 있어서, 상기 병원성 예측 로직은 상기 제2 델타 시퀀스에서의 해당 위치를 상기 보존 상태에 속하는것으로 분류된 상기 제1 델타 시퀀스에서의 해당 위치와 일치하는 신호 상태에 속하는 것으로 분류하고, 상기제2 델타 시퀀스에서의 해당 위치를 상기 비보존 상태에 속하는 것으로 분류된 상기 제1 델타 시퀀스에서의 해공개특허 10-2025-0048658-6-당 위치와 일치하는 노이즈 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_34", "content": "제33항에 있어서, 상기 병원성 예측 로직은 상기 제2 위치별 시퀀스 차이의 하위 세트를 변조된 누적 시퀀스 값으로 누적하도록 추가로 구성되고,상기 제2 위치별 시퀀스 차이의 하위 세트에서의 제2 위치별 시퀀스 차이는 상기 신호 상태에 속하는 것으로 분류되는 상기 제2 델타 시퀀스에서의 해당 위치에 위치하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_35", "content": "제34항에 있어서, 상기 병원성 예측 로직은 상기 변조된 누적 시퀀스 값에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_36", "content": "제34항에 있어서, 상기 변조된 누적 시퀀스 값은 상기 제2 위치별 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 시퀀스 차이의 평균인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_37", "content": "제34항에 있어서, 상기 변조된 누적 시퀀스 값은 상기 제2 위치별 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 시퀀스 차이의 합인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_38", "content": "제24항에 있어서, 상기 병원성 예측 로직은 상기 제1 기준 생물학적 양 출력 시퀀스 및 상기 제1 대체 생물학적양 출력 시퀀스의 각각의 부분을 위치별로 비교하고, 상기 각각의 부분에서의 위치에 대해 제1 위치별 하위 시퀀스 차이를 갖는 제1 델타 하위 시퀀스를 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_39", "content": "제38항에 있어서, 상기 병원성 예측 로직은 상기 제2 기준 생물학적 양 출력 시퀀스 및 상기 제2 대체 생물학적양 출력 시퀀스의 각각의 부분을 위치별로 비교하고, 상기 각각의 부분에서의 위치에 대해 제2 위치별 하위 시퀀스 차이를 갖는 제2 델타 하위 시퀀스를 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_40", "content": "제39항에 있어서, 상기 각각의 부분은 상기 분석 중 위치 주위의 우측 및 좌측 플랭킹 위치에 걸쳐 있는, 인공지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_41", "content": "제40항에 있어서, 상기 병원성 예측 로직은 상기 제1 델타 하위 시퀀스 및 상기 제2 델타 하위 시퀀스에 의존하여 상기 대체 염기에 대한 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_42", "content": "제40항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 하위 시퀀스 차이를 제1 누적된 하위 시퀀스 값으로 누적하고, 상기 제2 위치별 하위 시퀀스 차이를 제2 누적된 하위 시퀀스 값으로 누적하도록 추가로구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_43", "content": "제42항에 있어서, 상기 제1 누적 하위 시퀀스 값은 상기 제1 위치별 하위 시퀀스 차이의 평균이고, 상기 제2 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 평균인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_44", "content": "제42항에 있어서, 상기 제1 누적 하위 시퀀스 값은 상기 제1 위치별 하위 시퀀스 차이의 합이고, 상기 제2 누적공개특허 10-2025-0048658-7-하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 합인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_45", "content": "제42항에 있어서, 상기 병원성 예측 로직은 상기 제1 축적된 하위 시퀀스 값 및 상기 제2 축적된 하위 시퀀스값에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_46", "content": "제45항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 하위 시퀀스 값 및 상기 제2 누적 하위 시퀀스 값의평균에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_47", "content": "제45항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 하위 시퀀스 값 및 상기 제2 누적 하위 시퀀스 값의합에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_48", "content": "제38항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 하위 시퀀스 차이에 기초하여 상기 제1 델타 하위시퀀스에서의 위치를 보존된 상태 또는 비보존된 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_49", "content": "제48항에 있어서, 상기 병원성 예측 로직은 상기 제2 델타 하위 시퀀스에서의 해당 위치를 상기 보존 상태에 속하는 것으로 분류된 상기 제1 델타 하위 시퀀스에서의 해당 위치와 일치하는 신호 상태에 속하는 것으로 분류하고, 상기 제2 델타 하위 시퀀스에서의 해당 위치를 상기 비보존 상태에 속하는 것으로 분류된 상기 제1 델타 하위 시퀀스에서의 해당 위치와 일치하는 노이즈 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_50", "content": "제49항에 있어서, 상기 병원성 예측 로직은 상기 제2 위치별 하위 시퀀스 차이의 하위 세트를 변조된 누적 하위시퀀스 값으로 누적하도록 추가로 구성되고,상기 제2 위치별 하위 시퀀스 차이의 하위 세트에서의 제2 위치별 하위 시퀀스 차이는 상기 신호 상태에 속하는것으로 분류되는 상기 제2 델타 하위 시퀀스에서의 해당 위치에 위치하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_51", "content": "제50항에 있어서, 상기 병원성 예측 로직은 상기 변조된 누적 하위 시퀀스 값에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_52", "content": "제50항에 있어서, 상기 변조된 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 하위 시퀀스 차이의 평균인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_53", "content": "제50항에 있어서, 상기 변조된 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 하위 시퀀스 차이의 합인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_54", "content": "제1항에 있어서, 상기 타깃 염기 시퀀스는 유전자의 코딩 영역인, 인공 지능 기반 시스템.공개특허 10-2025-0048658-8-청구항 55 제1항에 있어서, 상기 타깃 염기 시퀀스는 유전자의 비-코딩 영역인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_56", "content": "제55항에 있어서, 상기 비-코딩 영역은 전사 시작 부위, 5개의 프라임 비변환 영역(UTR), 3개의 프라임 UTR, 인핸서 및 프로모터에 걸쳐 있는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_57", "content": "제16항에 있어서, 상기 대체 염기는 이상치 개체의 코호트 중 하나의 이상치 개체에서만 발생하는 단일 변이체이고,이상치 개체의 코호트에서 이상치 개체는 극한 수준의 유전자 발현을 나타내는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_58", "content": "제56항에 있어서, 극한 수준의 유전자 발현은 정규화된 유전자 발현 수준의 꼬리 사분위로부터 결정되는, 인공지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_59", "content": "제57항에 있어서, 극한 수준의 유전자 발현은 과다 유전자 발현 및 과소 유전자 발현을 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_60", "content": "제56항에 있어서, 상기 단일 변이체는 코딩 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_61", "content": "제56항에 있어서, 상기 단일 변이체는 비-코딩 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_62", "content": "제60항에 있어서, 상기 비-코딩 변이체는 프로모터 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_63", "content": "제60항에 있어서, 상기 비-코딩 변이체는 인핸서 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_64", "content": "제1항에 있어서, 상기 생물학적 양 모델은 제1 가중치 세트를 갖고,상기 생물학적 양 출력 생성 로직은 제2 가중치 세트를 갖는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_65", "content": "제62항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 처음부터 훈련시켜 상기 입력 염기시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하고,상기 생물학적 양 출력 생성 로직의 제2 가중치 세트를 상기 생물학적 양 모델의 제1 가중치 세트로 처음부터그리고 종단 간으로 훈련시켜 상기 입력 염기 시퀀스의 대체 표현을 처리하고 상기 복수의 생물학적 양 출력 시퀀스를 생성하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_66", "content": "제63항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 훈련된 제1 가중치 세트를 사용하고,상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 훈련된 제2 가중치 세트를 사용하는, 인공 지능 기반시스템.공개특허 10-2025-0048658-9-청구항 67 제1항에 있어서, 상기 유전자 발현 모델은 제3 가중치 세트를 갖고,상기 유전자 발현 출력 생성 로직은 제4 가중치 세트를 갖는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_68", "content": "제65항에 있어서, 상기 유전자 발현 모델의 제3 가중치 세트를 처음부터 훈련시켜 상기 복수의 생물학적 양 출력 시퀀스를 처리하고 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 생성하고,상기 유전자 발현 출력 생성 로직의 제4 가중치 세트를 상기 유전자 발현 모델의 제3 가중치 세트로 처음부터그리고 종단 간으로 훈련시켜 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 처리하고 상기 유전자 발현출력 시퀀스를 생성하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_69", "content": "제66항에 있어서, 추론 동안, 상기 유전자 발현 모델은 상기 훈련된 제3 가중치 세트를 사용하고,상기 추론 동안, 상기 유전자 발현 출력 생성 로직은 상기 훈련된 제4 가중치 세트를 사용하는, 인공 지능 기반시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_70", "content": "제65항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 먼저 처음부터 훈련시켜 상기 입력염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성한 다음, 상기 유전자 발현 모델의 제3 가중치 세트의 치환으로 재훈련시켜 상기 복수의 생물학적 양 출력 시퀀스를 처리하고 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 생성하고,상기 유전자 발현 출력 생성 로직의 제4 가중치 세트를 상기 유전자 발현 모델에서 치환된 상기 훈련된 제1 가중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 유전자 발현 모델에서 치환된 상기 훈련된 제1 가중치세트에 의해 생성된 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 처리하고 상기 유전자 발현 출력 시퀀스를 생성하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_71", "content": "제68항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 재훈련된 제1 가중치 세트를 사용하고,상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 훈련된 제2 가중치 세트를 사용하고,추론 동안, 상기 유전자 발현 모델은 상기 재훈련된 제1 가중치 세트를 사용하고,상기 추론 동안, 상기 유전자 발현 출력 생성 로직은 상기 훈련된 제4 가중치 세트를 사용하는, 인공 지능 기반시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_72", "content": "제17항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 먼저 처음부터 훈련시켜 상기 입력염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하고,상기 훈련 동안, 상기 생물학적 양 출력 생성 로직의 제2 가중치 세트를 먼저 상기 생물학적 양 모델의 제1 가중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 입력 염기 시퀀스의 대체 표현을 처리하고 상기 복수의 생물학적 양 출력 시퀀스를 생성하고,상기 훈련 동안, 그 다음, 상기 생물학적 양 모델의 훈련된 제1 가중치 세트를 재훈련시켜 상기 기준 염기 시퀀스를 처리하고 상기 기준 염기 시퀀스의 대체 표현을 생성하고, 상기 대체 염기 시퀀스를 처리하고 상기 대체염기 시퀀스의 대체 표현을 생성하고,상기 훈련 동안, 그 다음, 상기 생물학적 양 출력 생성 로직의 훈련된 제2 가중치 세트를 상기 생물학적 양 모델의 훈련된 제1 가중치 세트로 종단 간으로 재훈련시켜 상기 기준 염기 시퀀스의 대체 표현을 처리하고 상기복수의 기준 생물학적 양 출력 시퀀스를 생성하고, 상기 대체 염기 시퀀스의 대체 표현을 처리하고 상기 복수의공개특허 10-2025-0048658-10-대체 생물학적 양 출력 시퀀스를 생성하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_73", "content": "제70항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 훈련된 제1 가중치 세트를 사용하고,상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 재훈련된 제2 가중치 세트를 사용하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_74", "content": "제23항에 있어서, 상기 병원성 예측 로직은 제5 가중치 세트를 갖는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_75", "content": "제72항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 먼저 처음부터 훈련시켜 상기 입력염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하고,상기 훈련 동안, 상기 생물학적 양 출력 생성 로직의 제2 가중치 세트를 먼저 상기 생물학적 양 모델의 제1 가중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 입력 염기 시퀀스의 대체 표현을 처리하고 상기 복수의 생물학적 양 출력 시퀀스를 생성하고,상기 훈련 동안, 그 다음, 상기 생물학적 양 모델의 훈련된 제1 가중치 세트 및 상기 생물학적 양 출력 생성 로직의 훈련된 제2 가중치 세트를 종단 간으로 재훈련시켜 대체 염기에 대한 병원성 예측을 생성하는, 인공 지능기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_76", "content": "제73항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 재훈련된 제1 가중치 세트를 사용하고,상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 재훈련된 제2 가중치 세트를 사용하고,상기 추론 동안, 상기 병원성 예측 로직은 상기 훈련된 제5 가중치 세트를 사용하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_77", "content": "제18항에 있어서, 상기 제1 각각의 염기 당 기준 생물학적 양 출력은 상기 기준 타깃 염기 시퀀스에서의 상기각각의 위치에서 상기 각각의 기준 타깃 염기의 각각의 제1 기준 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_78", "content": "제29항에 있어서, 상기 제2 각각의 염기 당 기준 생물학적 양 출력은 상기 기준 타깃 염기 시퀀스에서의 상기각각의 위치에서 상기 각각의 기준 타깃 염기의 각각의 제2 기준 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_79", "content": "제21항에 있어서, 상기 제1 각각의 염기 당 대체 생물학적 양 출력은 상기 대체 타깃 염기 시퀀스에서의 상기각각의 위치에서 상기 각각의 대체 타깃 염기의 각각의 제1 대체 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_80", "content": "제22항에 있어서, 상기 제2 각각의 염기 당 대체 생물학적 양 출력은 상기 대체 타깃 염기 시퀀스에서의 상기각각의 위치에서 상기 각각의 대체 타깃 염기의 각각의 제2 대체 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_81", "content": "제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 진화 보존 염색질 시퀀스로 변환한 다음, 종단 간공개특허 10-2025-0048658-11-으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 전사 개시 빈도 염색질 시퀀스로 변환하는, 인공 지능 기반시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_82", "content": "제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 후생적 신호 수준 염색질 시퀀스로 변환한 다음,종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 진화 보존 염색질 시퀀스로 변환하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_83", "content": "제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 후생적 신호 수준 염색질 시퀀스로 변환한 다음,종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 전사 개시 빈도 염색질 시퀀스로 변환하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_84", "content": "제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 후생적 신호 수준 염색질 시퀀스로 변환한 다음,종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 진화 보존 염색질 시퀀스 및 염기별 전사 개시 빈도염색질 시퀀스로 변환하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_85", "content": "제1항에 있어서, 복수의 후생적 효과에 의해 교란된 변이체를 포함하는 훈련 입력 기본 시퀀스의 제1 훈련 세트를 포함하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_86", "content": "제83항에 있어서, 상기 복수의 후생적 효과에서의 후생적 효과는 염색체 간 효과, 유전자 내 효과, 집단 구조및 조상 효과, 발현 잔차의 확률적 추정(PEER) 효과, 환경 효과, 성별 효과, 일괄 효과, 유전자형 플랫폼 효과,및/또는 라이브러리 구축 프로토콜 효과를 포함하고, PEER는 \"발현 잔차의 확률적 추정\"을 의미하고, 인자 분석방법을 사용하여 유전자 발현 프로파일에서 숨겨진 결정요인과 해당 효과를 추론하는 Bayesian 접근법의모음인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_87", "content": "제83항에 있어서, 상기 복수의 후생적 효과에 의해 교란되지 않은 변이체를 포함하는 훈련 입력 염기 시퀀스의제2 훈련 세트를 포함하도록 추가로 구성되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_88", "content": "제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현을 변경하고 극한 수준의 유전자 발현을유발하도록 신뢰성 있게 결정되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_89", "content": "제86항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 수준을 증가시키는 과다 발현 유발 변이체를 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_90", "content": "제86항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 수준을 감소시키는 과소 발현 유발 변이체를 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_91", "content": "제87항에 있어서, 상기 제2 훈련 세트는 상기 유발 유전자 과다 발현 가능성을 특정하는 상기 변이체에 대한 과공개특허 10-2025-0048658-12-다 발현 확률을 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_92", "content": "제88항에 있어서, 상기 제2 훈련 세트는 상기 변이체 유발 유전자 과소 발현 가능성을 특정하는 상기 변이체에대한 과소 발현 확률을 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_93", "content": "제86항에 있어서, 상기 제2 훈련 세트에서의 각각의 변이체는 이상치 개체의 코호트 중 단지 하나의 이상치 개체에서 발생하는 단독 변이체이고,이상치 개체의 코호트에서 이상치 개체는 극한 수준의 유전자 발현을 나타내는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_94", "content": "제91항에 있어서, 극한 수준의 유전자 발현은 정규화된 유전자 발현 수준의 꼬리 사분위로부터 결정되는, 인공지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_95", "content": "제91항에 있어서, 극한 수준의 유전자 발현은 과다 유전자 발현 및 과소 유전자 발현을 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_96", "content": "제91항에 있어서, 상기 단일 변이체는 코딩 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_97", "content": "제91항에 있어서, 상기 단일 변이체는 비-코딩 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_98", "content": "제95항에 있어서, 상기 비-코딩 변이체는 5개의 프라임 비변환 영역(UTR) 변이체, 3개의 프라임 UTR 변이체, 인핸서 변이체, 또는 프로모터 변이체인, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_99", "content": "제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 복수의 조직 유형에 걸쳐 있는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_100", "content": "제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 복수의 셀 유형에 걸쳐 있는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_101", "content": "제1항에 있어서, 상기 입력 염기 시퀀스 및 상기 복수의 생물학적 양 출력 시퀀스는 상기 복수의 조직 유형에걸쳐 있는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_102", "content": "제1항에 있어서, 상기 입력 염기 시퀀스 및 상기 복수의 생물학적 양 출력 시퀀스는 상기 복수의 셀 유형에 걸쳐 있는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_103", "content": "제10항에 있어서, 상기 유전자 발현 출력 시퀀스는 상기 복수의 조직 유형에 걸쳐 있는, 인공 지능 기반시스템.공개특허 10-2025-0048658-13-청구항 104 제10항에 있어서, 상기 유전자 발현 출력 시퀀스는 상기 복수의 셀 유형에 걸쳐 있는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_105", "content": "제1항에 있어서, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 상기 제1 훈련 세트에서종단 간으로 훈련시킨 다음, 상기 제2 훈련 세트에서 재훈련시키는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_106", "content": "제1항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 변동을 나타내는 제1 기준 진리 라벨로라벨링된 병원성 세트로서 사용되고, 공통 변이체는 유전자 발현 비변동을 나타내는 제2 기준 진리 라벨로 라벨링된 양성 세트로서 사용되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_107", "content": "제104항에 있어서, 상기 양성 세트는 트리뉴클레오티드 컨텍스트, 동종 중합체, k-mer, 이웃 GC 빈도 및 시퀀싱깊이에 대해 균형을 이루는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_108", "content": "제104항에 있어서, 상기 과다 발현 확률 및 상기 과소 발현 확률에 적용된 컷오프 확률에 기초하여, 상기 제2훈련 세트에서의 상기 변이체는 유전자 발현 증가를 나타내는 제1 기준 진리 라벨을 갖는 과다 발현 변이체 훈련 세트, 유전자 발현 감소를 나타내는 제2 기준 진리 라벨을 갖는 과다 발현 변이체 훈련 세트, 및 유전자 발현 유지를 나타내는 신경 발현 변이체 훈련 세트로 분할되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_109", "content": "제10항에 있어서, 상기 유전자 발현 모델 및 상기 유전자 발현 출력 생성 로직은 먼저 상기 제1 훈련 세트에서종단 간으로 훈련시킨 다음, 상기 제2 훈련 세트에서 재훈련되는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_110", "content": "제1항에 있어서, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 상기 제1 훈련 세트에서종단 간으로 훈련시킨 다음, 홀수 염색체에서 발생하는 상기 제2 훈련 세트에서의 해당 변이체에 대해 재훈련시키는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_111", "content": "제10항에 있어서, 상기 유전자 발현 모델 및 상기 유전자 발현 출력 생성 로직을 먼저 상기 제1 훈련 세트에서종단 간으로 훈련시킨 다음, 홀수 염색체에서 발생하는 상기 제2 훈련 세트에서의 해당 변이체에 대해 재훈련시키는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_112", "content": "제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체를 훈련을 위해 사용하지 않고 대신에 상기 훈련된 생물학적 양 모델(124), 상기 훈련된 생물학적 양 출력 생성 로직, 상기 훈련된 유전자 발현 모델, 및 상기 훈련된 유전자 발현 출력 생성 로직의 성능을 평가하기 위한 검증 세트로서 사용하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_113", "content": "제110항에 있어서, 짝수 염색체에서 발생하는 상기 제2 훈련 세트에서의 해당 변이체를 상기 검증 세트로 사용하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_114", "content": "제1항에 있어서, 상기 타깃 염기 시퀀스의 크기는 전사 시작 부위(TSS)의 다양한 오프셋 위치를 고려하기 위해훈련 동안 가변되는, 인공 지능 기반 시스템.공개특허 10-2025-0048658-14-청구항 115 염기 해상도에서 유전자 발현의 변화를 검출하는 인공 지능 기반 시스템으로서,시퀀스 데이터베이스에 액세스하고 입력 염기 시퀀스를 생성하는 입력 생성 로직으로서, 상기 입력 염기 시퀀스는 타깃 염기 시퀀스를 포함하고, 상기 타깃 염기 시퀀스는 하류 컨텍스트 염기를 갖는 우측 염기 시퀀스 및 상류 컨텍스트 염기를 갖는 좌측 염기 시퀀스에 의해 플랭킹되는, 상기 입력 생성 로직;상기 입력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하는 생물학적 양 모델; 및상기 입력 염기 시퀀스의 대체 표현을 처리하고 복수의 생물학적 양 출력 시퀀스를 생성하는 생물학적 양 출력생성 로직을 포함하되,상기 복수의 생물학적 양 출력 시퀀스에서 각각의 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 각각의 타깃 염기에 대한 각각의 염기 당 생물학적 양 출력을 포함하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_116", "content": "제113항에 있어서, 상기 복수의 생물학적 양 출력 시퀀스에서의 제1 생물학적 양 출력 시퀀스는 상기 타깃 염기시퀀스에서의 상기 각각의 타깃 염기에 대한 제1 각각의 염기 당 생물학적 양 출력을 포함하고,상기 제1 각각의 염기 당 생물학적 양 출력은 복수의 종에 걸쳐 상기 각각의 타깃 염기의 각각의 진화 보존 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_117", "content": "제113항에 있어서, 상기 복수의 생물학적 양 출력 시퀀스에서의 제2 생물학적 양 출력 시퀀스는 상기 타깃 염기시퀀스에서의 상기 각각의 타깃 염기에 대한 제2 각각의 염기 당 생물학적 양 출력을 포함하고,상기 제2 각각의 염기 당 생물학적 양 출력은 상기 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 타깃염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템."}
{"patent_id": "10-2024-7042680", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "개시된 기술은 유전자 보존 및 발현 보존을 검출하는 것에 관한 것이다. 특히, 개시된 기술은 진화 보존, 전사 개시 또는 후생적 신호를 나타낼 수 있는 염색질 형태로 시퀀스의 복수의 대체 표현의 생성을 통해 염기 해 상도에서 기준 유전 시퀀스의 변이체와 비교하여 기준 유전 시퀀스에 대한 유전자 보존 및 후생적 신 호를 검출하는 것, 유전자 발현 대체 분류기에 복수의 대체 염색질 시퀀스를 매핑하여 변이체에 대한 유전 자 발현 클래스 예측을 생성하는 것, 및 병원성 예측기에 대체 염색질 시퀀스를 매핑하여 변이체의 병원성을 검 출하는 것에 관한 것이다."}
{"patent_id": "10-2024-7042680", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "개시된 기술은 인공 지능 유형 컴퓨터 및 디지털 데이터 처리 시스템 및 해당하는 데이터 처리 방법 및 지능 에 뮬레이션 제품(즉, 지식 기반 시스템, 추론 시스템 및 지식 획득 시스템)에 관한 것이며; 불확실성이 있는 추론 을 위한 시스템(예: 퍼지 로직 시스템), 적응 시스템, 기계 학습 시스템 및 인공 신경망을 포함한다. 특히, 개 시된 기술은 염기 해상도에서 유전자 보존 및 발현 보존의 인공 지능 기반 검출에 관한 것이다."}
{"patent_id": "10-2024-7042680", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 2, "content": "기술분야 관련 출원의 교차 참조 본 출원은 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED EPIGENETICS AT BASE RESOLUTION\"이고 동시에 출원 된 미국 특허 출원(대리인 문서 번호 ILLM 1040-1/IP-2045-PRV)과 관련되며, 이는 본원에 완전히 명시된 것처럼 모든 목적을 위해 참조로서 통합된다. 참조 문헌 다음은 본원에 전체적으로 명시된 것처럼 모든 목적을 위해 참고로 포함된다: 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED EPIGENETICS\"이고 2019년 9월 20일자로 출원된 미국 특허 출원 제62/903,700호(대리인 문서 번호 ILLM 1025-1/IP-1898-PRV); 문헌[Sundaram, L. 등, Predicting the clinical impact of human mutation with deep neural networks. Nat. Genet. 50, 1161~1170 (2018년)]; 문헌[Jaganathan, K. 등, Predicting splicing from primary sequence with deep learning. Cell 176, 535~548 (2019년)];2017년 10월 16일자로 출원되고 발명의 명칭이 \"TRAINING A DEEP PATHOGENICITY CLASSIFIER USING LARGE-SCALE BENIGN TRAINING DATA\"인 미국 특허 출원 제62/573,144호(대리인 문서 번호 ILLM 1000-1/IP-1611-PRV); 2017년 10월 16일자로 출원되고 발명의 명칭이 \"PATHOGENICITY CLASSIFIER BASED ON DEEP CONVOLUTIONAL NEURAL NETWORKS (CNNs)\"인 미국 특허 출원 제62/573,149호(대리인 문서 번호 ILLM 1000-2/IP-1612-PRV); 2017년 10월 16일자로 출원되고 발명의 명칭이 \"DEEP SEMI-SUPERVISED LEARNING THAT GENERATES LARGE-SCALE PATHOGENIC TRAINING DATA\"인 미국 특허 출원 제62/573,153호(대리인 문서 번호 ILLM 1000-3/IP-1613-PRV); 2017년 11월 7일자로 출원되고 발명의 명칭이 \"PATHOGENICITY CLASSIFICATION OF GENOMIC DATA USING DEEP CONVOLUTIONAL NEURAL NETWORKS (CNNs)\"인 미국 특허 출원 제62/582,898호(대리인 문서 번호 ILLM 1000-4/IP- 1618-PRV); 2018년 10월 15일자로 출원되고 발명의 명칭이 \"DEEP LEARNING-BASED TECHNIQUES FOR TRAINING DEEP CONVOLUTIONAL NEURAL NETWORKS\"인 미국 특허 출원 제16/160,903호(대리인 문서 번호 ILLM 1000-5/IP-1611- US); 2018년 10월 15일자로 출원되고 발명의 명칭이 \"DEEP CONVOLUTIONAL NEURAL NETWORKS FOR VARIANT CLASSIFICATION\"인 미국 특허 출원 제16/160,986호(대리인 문서 번호 ILLM 1000-6/IP-1612-US); 2018년 10월 15일자로 출원되고 발명의 명칭이 \"SEMI- SUPERVISED LEARNING FOR TRAINING AN ENSEMBLE OF DEEP CONVOLUTIONAL NEURAL NETWORKS\"인 미국 특허 출원 제16/160,968호(대리인 문서 번호 ILLM 1000-7/IP-1613- US); 2019년 5월 8일자로 출원되고 발명의 명칭이 \"DEEP LEARNING-BASED TECHNIQUES FOR PRE-TRAINING DEEP CONVOLUTIONAL NEURAL NETWORKS\"인 미국 특허 출원 제16/407,149호(대리인 문서 번호 ILLM 1010-1/IP-1734- US). 2021년 4월 15일자로 출원되고 발명의 명칭이 \"DEEP CONVOLUTIONAL NEURAL NETWORKS TO PREDICT VARIANT PATHOGENICITY USING THREE-DIMENSIONAL (3D) PROTEIN STRUCTURES\"인 미국 특허 출원 제17/232,056호(대리인 문서 번호 ILLM 1037-2/IP-2051-US); 2021년 4월 15일자로 출원되고 발명의 명칭이 \"MULTI-CHANNEL PROTEIN VOXELIZATION TO PREDICT VARIANT PATHOGENICITY USING DEEP CONVOLUTIONAL NEURAL NETWORKS\"인 미국 특허 출원 제63/175,495호(대리인 문서 번 호 ILLM 1047-1/IP-2142-PRV); 2021년 4월 16일자로 출원되고 발명의 명칭이 \"EFFICIENT VOXELIZATION FOR DEEP LEARNING\"인 미국 특허 출원 제63/175,767호(대리인 문서 번호 ILLM 1048-1/IP-2143-PRV); 및 2021년 9월 7일자로 출원되고 발명의 명칭이 \"ARTIFICIAL INTELLIGENCE-BASED ANALYSIS OF PROTEIN THREE- DIMENSIONAL (3D) STRUCTURES\"인 미국 특허 출원 제17/468,411호(대리인 문서 번호 ILLM 1037-3/IP-2051A-US)."}
{"patent_id": "10-2024-7042680", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "이 섹션에서 논의되는 주제는 단지 이 섹션 내에서의 그의 언급의 결과로서 종래 기술이라고 가정되어서는 안"}
{"patent_id": "10-2024-7042680", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 2, "content": "된다. 유사하게, 이 섹션에서 언급되거나 배경기술로서 제공되는 주제와 연관된 문제는 종래 기술에서 이전에 인식되었다고 가정되어서는 안 된다. 이 섹션에서의 주제는 단지 상이한 접근법을 표현할 뿐이며, 그 접근법 자체는 청구되는 기술의 구현에 또한 상응할 수 있다. 광범위한 의미에서, 기능 유전체학으로도 지칭되는 유전체학은 게놈 시퀀스 분석, 전사체 프로파일링 및 단백질 체학과 같은 게놈 스케일 분석을 사용하여 유기체의 모든 게놈 요소의 기능을 특징짓는 것을 목표로 한다. 유 전체학은 데이터 중심 과학으로서 발생하였으며 그것은 선입견이 있는 모델 및 가설을 검정하기보다는 게놈 스 케일 데이터의 탐구로부터 신규 속성을 발견함으로써 작동한다. 유전체학의 응용은 유전자형과 표현형 사이의 연관성을 찾는 것, 환자 계층화에 대한 바이오마커를 발견하는 것, 유전자의 기능을 예측하는 것 및 전사 인핸 서 및 단일 염기 다형성(SNP)과 같은 생물화학적 활성 게놈 영역 및 잔기를 차트화하는 것을 포함한다. 유전체학 데이터는 쌍별 상관의 시각적 연구만으로 조사하기에는 너무 크고 너무 복잡하다. 예를 들어, 단백질 시퀀스는 조상 단백질에서 유래되어 유사한 구조와 기능을 공유하는 상동 단백질 계열로 분류될 수 있다. 상동 단백질의 다중 시퀀스 정렬(MSA)의 분석은 기능적, 구조적 제약에 대한 중요한 정보를 제공한다. 아미노산 부위를 나타내는 MSA 열의 통계는 진화 중 보존되는 기능적 잔기를 식별한다. MSA 칼럼 사이의 아미노산 사용의 상관관계는 기능적 부분과 구조적 접촉에 대한 중요한 정보를 담고 있다. 대신, 예상되지 않은 관계의 발견을 지원하기 위해, 신규한 가설 및 모델을 도출하기 위해, 그리고 예측을 행하 기 위해 분석 툴이 요구된다. 가정 및 도메인 전문 지식이 하드 코딩되는 일부 알고리즘과는 달리, 기계 학습 알고리즘은 데이터에서 패턴을 자동으로 검출하도록 설계된다. 따라서, 기계 학습 알고리즘은 데이터 중심 과 학, 특히 유전체학에 적합하다. 그러나, 기계 학습 알고리즘의 성능은 데이터가 표현되는 방법, 즉 각각의 변 수(특징으로도 불림)가 계산되는 방법에 강하게 의존할 수 있다. 예를 들어, 형광 현미경 이미지로부터 종양을 악성 또는 양성으로 분류하기 위해, 전처리 알고리즘이 셀을 검출할 수 있고, 셀 유형을 식별할 수 있고, 각각 의 셀 유형에 대한 셀 카운트의 목록을 생성할 수 있다. 기계 학습 모델은 추정된 셀 카운트를 취할 수 있으며, 이러한 카운트는 종양을 분류하기 위한 입력 특징으로서, 수작업으로 작성된 특징의 예이다. 중심 문제는 분류 성능이 이러한 특징의 품질 및 관련성에 크 게 의존한다는 것이다. 예를 들어, 셀 형태학, 셀 사이의 거리 또는 기관 내의 국지성과 같은 관련 시각적 특 징은 셀 카운트에서 캡처되지 않고, 데이터의 이러한 불완전한 표현은 분류 정확도를 감소시킬 수 있다. 기계 학습의 하위 구분인 심층 학습은 기계 학습 모델 자체에 특징의 계산을 임베딩하여 종단 간 모델을 산출함 으로써 이러한 문제를 다룬다. 이러한 결과는 심층 신경망, 즉 연속적인 기본 연산을 포함하는 기계 학습 모델 의 개발을 통해 실현되었으며, 이들은 선행 연산의 결과를 입력으로서 취함으로써 점점 더 복잡한 특징을 계산 한다. 심층 신경망은 위의 예에서 셀 형태학 및 셀의 공간 구성과 같은 높은 복잡도의 관련 특징을 발견함으로 써 예측 정확도를 개선할 수 있다. 심층 신경망의 구성 및 훈련은 데이터의 폭증, 알고리즘 진보 및 계산 용량 의 실질적인 증가에 의해, 특히 그래픽 처리 장치(GPU)의 사용을 통해 가능하게 되었다. 지도 학습의 목표는, 특징을 입력으로서 취하고 이른바 타깃 변수에 대한 예측을 반환하는 모델을 획득하는 것 이다. 지도 학습 문제의 일례는 정규 스플라이스 부위 시퀀스의 존재 여부 및 스플라이싱 분기점의 위치 또는 인트론 길이와 같은 RNA 상의 특징을 고려하여 인트론이 (타깃을) 스플라이스-아웃(splice out)되는지의 여부를 예측하는 것이다. 기계 학습 모델을 훈련시키는 것은 이의 파라미터를 학습하는 것을 지칭하며, 이는 보통 보 이지 않은 데이터에 대한 정확한 예측을 행하는 목적으로 훈련 데이터에 대한 손실 함수를 최소화하는 것을 수 반한다. 계산 생물학에서의 많은 지도 학습 문제의 경우, 입력 데이터는 예측을 행하는 데 잠재적으로 유용한 수치 또는 카테고리 데이터를 각각 포함하는 다수의 열 또는 특징을 갖는 표로서 표현될 수 있다. 일부 입력 데이터는 (온도 또는 시간과 같이) 표 내의 특징으로서 자연적으로 표현되는 반면, 다른 입력 데이터는 (k-량체 카운트로 의 데옥시리보핵산(DNA) 시퀀스와 같이) 표로 나타낸 표현에 피팅하기 위해 특징 추출로 불리는 프로세스를 사 용하여 먼저 변환될 필요가 있다. 인트론 스플라이싱 예측 문제의 경우, 표준 스플라이스 부위 시퀀스의 존재 여부, 스플라이싱 분기점의 위치 및 인트론 길이는 표로 나타낸 포맷으로 수집된 전처리된 특징일 수 있다. 표 로 나타낸 데이터는, 로지스틱 회귀와 같은 단순한 선형 모델로부터 신경망과 같은 더 유연한 비선형 모델에 이 르는 광범위한 지도 기계 학습 모델 및 많은 다른 것에 대한 표준이다. 로지스틱 회귀는 이진 분류자, 즉 이진 타깃 변수를 예측하는 지도 학습 모델이다. 구체적으로, 로지스틱 회귀 는 한 유형의 활성화 함수인 시그모이드 함수를 사용하여 [0, 1] 구간에 매핑된 입력 특징의 가중 합을 계산함 으로써 포지티브 클래스의 확률을 예측한다. 로지스틱 회귀의 파라미터 또는 상이한 활성화 함수를 사용하는 다른 선형 분류자는 가중 합에서의 가중치이다. 선형 분류자는 클래스, 예를 들어, 스플라이스-아웃되거나 스 플라이스-아웃되지 않은 인트론의 클래스가 입력 특징의 가중 합으로 잘 구별될 수 없을 때 실패한다. 예측 성 능을 개선하기 위해, 예를 들어, 거듭제곱 또는 쌍별 곱을 취함으로써 새로운 방식으로 기존의 특징을 변환 또 는 조합함으로써 새로운 입력 특징이 수동으로 추가될 수 있다. 신경망은 은닉 계층을 사용하여 이러한 비선형 특징 변환을 자동으로 학습한다. 각각의 은닉 계층은 시그모이 드 함수 또는 더 대중적인 정류 선형 유닛(ReLU)과 같은 비선형 활성화 함수에 의해 변환된 출력을 갖는 다수의 선형 모델로서 생각될 수 있다. 이러한 계층은 함께 입력 특징을 관련된 복잡한 패턴으로 구성하며, 이는 2개 의 클래스를 구별하는 작업을 용이하게 한다. 심층 신경망은 많은 은닉 계층을 사용하고, 계층은 각각의 뉴런이 선행 계층의 모든 뉴런으로부터 입력을 수신 할 때 완전 연결된 것으로 간주된다. 신경망은 일반적으로, 매우 큰 데이터 세트에 대해 모델을 훈련시키는 데 적합한 알고리즘인 확률론적 경사 하강법을 사용하여 훈련된다. 최신 심층 학습 프레임워크를 사용한 신경망의구현은 상이한 아키텍처 및 데이터 세트로 신속한 프로토타이핑을 가능하게 한다. 완전 접속 신경망은 다수의 유전체학 응용예에 사용될 수 있으며, 이는 시퀀스 보존 또는 스플라이스 인자의 결합 모티프의 존재와 같은 시 퀀스 특징으로부터의 주어진 시퀀스에 대해 스플라이스-인(splice in)된 엑손의 백분율을 예측하는 것; 잠재적 인 질환 유발 유전자 변이체를 우선순위화하는 것; 및 염색질 마크, 유전자 발현 및 진화 보존과 같은 특징을 사용하여 주어진 게놈 영역 내의 시스(cis)-조절 요소를 예측하는 것을 포함한다. 효과적인 예측을 위해 공간적 및 종방향 데이터에서의 로컬 종속성이 고려되어야 한다. 예를 들어, DNA 시퀀스 또는 이미지의 픽셀을 섞으면 정보성 패턴이 심하게 손상된다. 이러한 로컬 종속성은 표로 나타낸 데이터와는 분리된 공간적 또는 종방향 데이터를 설정하며, 이를 위한 특징의 순서화는 임의적이다. 특정 전사 인자에 의 해 게놈 영역을 결합 대 비결합으로 분류하는 문제를 고려하는데, 이때 결합 영역은 시퀀스 분석(ChIP-seq) 데 이터가 뒤에 오는 염색질 면역 침전에서의 고신뢰 결합 이벤트로서 정의된다. 시퀀스 모티프를 인식함으로써 전사 인자가 DNA에 결합된다. 시퀀스에서의 k-량체 인스턴스의 수 또는 위치 가중치 행렬(PWM) 매칭과 같은 시 퀀스 파생 특징에 기초한 완전 연결 계층이 이러한 작업에 사용될 수 있다. 따라서, k-량체 또는 PWM 인스턴스 빈도는 시퀀스 내의 모티프 이동에 강하기 때문에, 이러한 모델은 상이한 위치에 위치한 동일한 모티프를 갖는 시퀀스에 대해 양호하게 일반화될 수 있다. 그러나, 이는 전사 인자 결합이 잘 정의된 간격을 갖는 다수의 모 티프의 조합에 의존하는 패턴을 인식하지 못할 것이다. 또한, 가능한 k-량체의 수는 k-량체 길이에 따라 기하 급수적으로 증가하며, 이는 저장 및 오버피팅 문제를 모두 제기한다. 컨볼루션 계층은 완전 연결 계층의 특수 형태이며, 동일한 완전 연결 계층은, 예를 들어, 6 bp 윈도우에서, 모 든 시퀀스 위치에 국부적으로 적용된다. 이러한 접근법은 또한, 예를 들어, 전사 인자 GATA1 및 TAL1에 대해, 다수의 PWM을 사용하여 시퀀스를 스캐닝하는 것으로 보일 수 있다. 모든 위치에서 동일한 모델 파라미터를 사 용함으로써, 파라미터의 총 수는 급격히 감소되고, 네트워크는 훈련 동안 보이지 않는 위치에서 모티프를 검출 할 수 있다. 각각의 컨볼루션 계층은 모든 위치에서 스칼라 값을 생성함으로써 여러 필터로 시퀀스를 스캐닝하 며, 이는 필터와 시퀀스 사이의 매칭을 정량화한다. 완전 연결 신경망에서와 같이, 비선형 활성화 함수(일반적 으로, ReLU)가 각각의 계층에 적용된다. 다음으로, 풀링 연산이 적용되며, 이는 위치 축에 걸친 인접 빈에서의 활성화를 집약하여, 일반적으로, 각각의 채널에 대해 최대 또는 평균 활성화를 취한다. 풀링은 유효 시퀀스 길 이를 감소시키고, 신호를 거칠게 만든다. 후속 컨볼루션 계층은 이전 계층의 출력을 조정하며, GATA1 모티프 및 TAL1 모티프가 일부 거리 범위에 존재하였는지의 여부를 검출할 수 있다. 마지막으로, 컨볼루션 계층의 출 력은 최종 예측 작업을 수행하기 위해 완전 접속 신경망에 대한 입력으로서 사용될 수 있다. 따라서, 상이한 유형의 신경망 계층(예: 완전 연결 계층 및 컨볼루션 계층)이 단일 신경망 내에서 조합될 수 있다. 컨볼루션 신경망(CNN)은 DNA 시퀀스 하나에만 기초하여 다양한 분자 표현형을 예측할 수 있다. 응용예는 전사 인자 결합 부위를 분류하는 것과, 염색질 특징, DNA 접촉 맵, DNA 메틸화, 유전자 발현, 변환 효율, RBP 결합 및 마이크로RNA(miRNA) 타깃과 같은 분자 표현형을 예측하는 것을 포함한다. 시퀀스로부터 분자 표현형을 예측 하는 것에 더하여, 컨볼루션 신경망은 수작업으로 작성된 생물정보학 파이프라인에 의해 전통적으로 다루어진 더 많은 기술적 작업에 적용될 수 있다. 예를 들어, 컨볼루션 신경망은 가이드 RNA의 특이성을 예측할 수 있고, ChIP-seq를 노이즈 제거할 수 있고, Hi-C 데이터 해상도를 향상시킬 수 있고, DNA 시퀀스로부터인 근원의 실험을 예측할 수 있고, 유전자 변이체를 호출할 수 있다. 컨볼루션 신경망은 또한 게놈에서 장거리 종속성을 모델링하기 위해 채용되었다. 상호 작용하는 조절 요소가 전개된 선형 DNA 시퀀스 상에서 원거리에 위치될 수 있지만, 이러한 요소는 종종 실제 3D 염색질 형태에서 근위에 있다. 따라서, 선형 DNA 시퀀스로부터 분자 표현 형을 모델링하는 것은, 염색질의 대강의 근사화에도 불구하고, 장거리 종속성을 허용하고 모델이 프로모터-인핸 서 루핑과 같은 3D 구성의 양태를 암시적으로 학습할 수 있게 함으로써 개선될 수 있다. 이것은 최대 32 kb의 수용 필드를 갖는 확장된 컨볼루션을 사용하여 달성된다. 확장된 컨볼루션은 또한 스플라이스 부위가 10 kb의 수용 필드를 사용하여 시퀀스로부터 예측될 수 있도록 하며, 이로 인해, 전형적인 인간 인트론만큼 긴 거리에 걸쳐 유전자 시퀀스의 통합이 가능하게 한다(문헌[Jaganathan, K. 등, Predicting splicing from primary sequence with deep learning. Cell 176, 535~548 (2019년)] 참조). 상이한 유형의 신경망은 이들의 파라미터 공유 체계에 의해 특성화될 수 있다. 예를 들어, 완전 연결 계층은 파라미터 공유를 갖지 않는 반면, 컨볼루션 계층은 이들의 입력의 모든 위치에서 동일한 필터를 적용함으로써 변환 불변성을 부과한다. 순환 신경망(RNN)은 상이한 파라미터 공유 체계를 구현하는, DNA 시퀀스 또는 시계열 과 같은 순차적 데이터를 처리하기 위한 컨볼루션 신경망에 대한 대안이다. 순환 신경망은 각각의 시퀀스 요소 에 동일한 연산을 적용한다. 상기 연산은 이전 시퀀스 요소의 메모리 및 새로운 입력을 입력으로서 취한다. 이는 메모리를 업데이트하고, 선택적으로는 후속 계층으로 전달되거나 모델 예측으로서 직접 사용되는 출력을방출한다. 각각의 시퀀스 요소에 동일한 모델을 적용함으로써, 순환 신경망은 처리된 시퀀스에서 위치 인덱스 에 대해 불변이다. 예를 들어, 순환 신경망은 시퀀스에서의 위치에 관계없이 DNA 시퀀스에서 개방 판독 프레임 을 검출할 수 있다. 이러한 작업은 프레임 내 정지 코돈이 이어지는 시작 코돈과 같은 특정 입력 시리즈의 인 식을 요구한다. 컨볼루션 신경망에 비해 순환 신경망의 주요 이점은, 이론적으로, 메모리를 통해 무한히 긴 시퀀스를 거쳐 정보 를 전달할 수 있다는 것이다. 또한, 순환 신경망은 mRNA 시퀀스와 같은 광범위하게 변화하는 길이의 시퀀스를 자연적으로 처리할 수 있다. 그러나, 다양한 트릭(예: 확장된 컨볼루션)과 조합된 컨볼루션 신경망은 오디오 합성 및 기계 변환과 같은 시퀀스 모델링 작업에 대해 순환 신경망과 유사하거나 심지어 그보다 더 양호한 성능 에 도달할 수 있다. 순환 신경망은 단일 셀 DNA 메틸화 상태, RBP 결합, 전사 인자 결합 및 DNA 접근성을 예측 하기 위한 컨볼루션 신경망의 출력을 집계할 수 있다. 더욱이, 순환 신경망이 순차적인 연산을 적용하기 때문 에, 이는 쉽게 병렬화될 수 없고, 따라서, 컨볼루션 신경망보다 계산하는 데 훨씬 더 느리다. 각각의 인간은 고유한 유전자 코드를 갖지만, 인간 유전자 코드의 대부분은 모든 인간에 대해 공통적이다. 일 부 경우에 있어서, 인간 유전자 코드는 비교적 작은 그룹의 인간 모집단의 개체 사이에서 공통적일 수 있는 유 전자 변이체로 불리는 이상치를 포함할 수 있다. 예를 들어, 특정 인간 단백질은 특정 시퀀스의 아미노산을 포 함할 수 있는 반면, 그 단백질의 변이체는 그 외의 동일한 특정 시퀀스에서의 하나의 아미노산만큼 상이할 수 있다. 유전자 변이체는 병원성이어서, 질환으로 이어질 수 있다. 이러한 유전자 변이체의 대부분이 자연적인 선택에 의해 게놈으로부터 대폭 감소되었지만, 어느 유전자 변이체가 병원성일 가능성이 있는지를 식별하는 능력은 연 구자가 이러한 유전자 변이체에 초점을 맞추어 해당하는 질환 및 이의 진단, 처치 또는 치유에 대한 이해를 얻 는 데 도움이 될 수 있다. 수백만 개의 인간 유전자 변이체의 임상적 해석은 여전히 불명확하다. 가장 빈번한 병원성 변이체 중 일부는 단백질의 아미노산을 변화시키는 단일 뉴클레오티드 미스센스 돌연변이이다. 그러나, 모든 미스센스 돌연변이가 병원성인 것은 아니다. 생물학적 시퀀스로부터 직접적으로 분자 표현형을 예측할 수 있는 모델은 유전자 변이체와 표현형 변이체 사이 의 연관성을 프로브하기 위해 컴퓨터 내(in silico) 섭동 툴로서 사용될 수 있고, 정량적 형질 유전자좌 식별 및 변이체 우선 순위화를 위한 새로운 방법으로서 부상하였다. 복잡한 표현형의 전장 유전체 연관성 분석에 의 해 식별된 변이체의 대부분이 비-코딩이라면, 이러한 접근법은 매우 중요하며, 이는 표현형에 대한 이의 효과 및 기여도를 추정하는 것을 어렵게 만든다. 더욱이, 연관 불균형은 변이체의 블록이 동시-유전되는 결과를 초 래하며, 이는 개별 인과 변이체를 정확하게 찾아내는 것에 어려움을 야기한다. 따라서, 이러한 변이체의 영향 을 평가하기 위한 심문 툴로서 사용될 수 있는 시퀀스 기반 심층 학습 모델은 복잡한 표현형의 잠재적인 드라이 버를 찾는 것에 대한 유망한 접근법을 제공한다. 하나의 예는 전사 인자 결합, 염색질 접근성 또는 유전자 발 현 예측의 측면에서 2개의 변이체 사이의 차이로부터 간접적으로 짧은 삽입 또는 결실(인델) 및 비-코딩 단일 뉴클레오티드 변이체의 효과를 예측하는 것을 포함한다. 다른 예는 스플라이싱에 대한 유전자 변이체의 시퀀스 또는 정량적 효과로부터 신규한 스플라이스 부위 생성을 예측하는 것을 포함한다. 변이체 효과 예측을 위한 종단 간 심층 학습 접근법은 시퀀스 보존 데이터 및 단백질 시퀀스로부터의 미스센스 변이체의 병원성을 예측하기 위해 적용된다(본원에서 \"PrimateAI\"로 지칭되는, 문헌[Sundaram, L. 등, Predicting the clinical impact of human mutation with deep neural networks. Nat.Genet.50, 1161~1170 (2018년)] 참조). PrimateAI는 종간(cross-species) 정보를 사용한 데이터 증강에 의한 기지의 병원성의 변이 체에 대해 훈련된 심층 신경망을 사용한다. 특히, PrimateAI는 차이를 비교하고 훈련된 심층 신경망을 사용하 여 돌연변이의 병원성을 결정하기 위해 야생형 및 변종 단백질의 시퀀스를 사용한다. 병원성 예측을 위한 단백 질 시퀀스를 활용하는 그러한 접근법은, 순환성 문제 및 이전 지식에 대한 과적합화를 회피할 수 있기 때문에 유망하다. 그러나, 심층 신경망을 효과적으로 훈련시키기 위한 적절한 수의 데이터와 비교하면, ClinVar에서 이용 가능한 임상 데이터의 수는 비교적 작다. 이러한 데이터 부족을 극복하기 위해, PrimateAI는 공통적인 인 간 변이체 및 영장류로부터의 변이체를 양성 데이터로서 사용하지만, 트리뉴클레오티드 콘텍스트에 기초한 시뮬 레이션된 변이체가 라벨링되지 않은 데이터로서 사용되었다. PrimateAI는 시퀀스 정렬에 대해 직접적으로 훈련될 때 이전 방법을 능가한다. PrimateAI는 약 120,000개의 인 간 샘플로 이루어진 훈련 데이터로부터 직접적으로 중요한 단백질 도메인, 보존 아미노산 위치 및 시퀀스 종속 성을 학습한다. PrimateAI는 후보 발달 장애 유전자에서 양성 및 병원성 신생 돌연변이를 구별하고 ClinVar에 서 이전 지식을 재생하는 데 있어서 다른 변이체 병원성 예측 툴의 성능을 실질적으로 초과한다. 이러한 결과는 PrimateAI가 이전 지식에 대한 임상 보고의 의존을 줄일 수 있는 변이체 분류 툴을 위해 중요한 진전임을 시 사한다. 구조 요소가 관찰된 기능을 발생시키는 방법에 대한 이해는 단백질 생물학에 대해 중심이 된다. 방대한 단백질 구조 데이터는 구조적-기능적 관계를 지배하는 규칙을 체계적으로 도출하기 위한 계산 방법의 개발을 가능하게 한다. 그러나, 이러한 방법의 성능은 단백질 구조 표현의 선택에 중대하게 의존한다. 단백질 부위는 이의 구조적 또는 기능적 역할에 의해 구별되는 단백질 구조 내의 미세 환경이다. 부위는 3차원 (3D) 위치 및 구조 또는 기능이 존재하는 이러한 위치 주위의 국부적 이웃에 의해 정의될 수 있다. 아미노산의 구조적 배열이 단백질 부위 내에서 기능적 특성을 생성하는 방법에 대한 이해는 합리적인 단백질 공학에 대해 중심이 된다. 단백질 내의 개별 아미노산의 구조적 및 기능적 역할의 결정은 공학자를 돕고 단백질 기능을 변 경하기 위한 정보를 제공한다. 기능적으로 또는 구조적으로 중요한 아미노산을 식별하는 것은 타깃화된 단백질 기능적 속성을 변경하기 위한 부위 유도 돌연변이 유발과 같은 집중된 공학 노고를 허용한다. 대안적으로, 이 러한 지식은 원하는 기능을 무효화할 공학 설계를 회피하는 데 도움이 될 수 있다. 구조가 시퀀스보다 훨씬 더 많이 보존된다는 것이 확립되었기 때문에, 단백질 구조 데이터의 증가는 데이터 중 심 접근법을 사용하여 구조적-기능적 관계를 지배하는 기본 패턴을 체계적으로 연구할 기회를 제공한다. 임의 의 계산 단백질 분석의 기본 양태는 단백질 구조 정보가 표현되는 방법이다. 기계 학습 방법의 성능은 종종 채 용된 기계 학습 알고리즘보다 데이터 표현의 선택에 더 많이 의존한다. 양호한 표현은 가장 중대한 정보를 효 율적으로 캡처하는 반면, 불량한 표현은 기본 패턴이 없는 노이즈 분포를 생성한다. 방대한 단백질 구조 및 심층 학습 알고리즘의 최근의 성공은 단백질 구조의 작업 특정적 표현을 자동으로 추출 하기 위한 툴을 개발할 기회를 제공한다. 유전체학 연구의 계산 분석은 관심 있는 유전적 인자와 무관한 교란 변이로 인해 어려움을 겪는다. 유전자 발 현의 높은 또는 낮은 수준을 유발하는 변이체의 식별은 유전 질환의 병원성을 진단하는 데 가장 중요하다. 그 러나, 병원성 변이체의 식별을 방해할 수 있는 수많은 교란 인자가 있다. 특정 병리학과 관련될 수 있는 희귀 변이체를 검사하여 변이체를 분리하면 문제를 단순화할 수 있다. 또한, 교란자에 의해 유입되는 노이즈를 제거 하면 신호 대 노이즈 비를 증가시킬 수 있다. 이에 후생유전학에 인공 지능을 적용하여 변이가 있는 유전자좌 및 개별 유전자의 발현 수준 간의 유전적 연관 성 회복에 대한 민감도를 크게 높일 수 있는 기회가 발생한다."}
{"patent_id": "10-2024-7042680", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "아래의 논의는 어느 당업자라도 개시된 기술을 제조하고 사용할 수 있게 하도록 제시되며, 특정의 적용 및 그의 요건과 관련하여 제공된다. 개시된 구현에 대한 다양한 수정은 당업자에게 용이하게 명백할 것이며, 본원에 정 의된 일반 원리는 개시된 기술의 사상 및 범위로부터 벗어나지 않고 다른 구현 및 응용에 적용될 수 있다. 따 라서, 개시된 기술은 도시된 구현으로 제한되도록 의도된 것이 아니라, 본원에 개시된 원리 및 특징과 일치하는 가장 넓은 범주에 부합되어야 한다. 다양한 구현에 대한 상세한 설명은 첨부된 도면과 함께 읽을 때 더 잘 이해될 것이다. 도면이 다양한 구현의 기능 블록도를 도시하는 범위에서, 기능 블록은 반드시 하드웨어 회로 사이의 분할을 나타내는 것은 아니다.따라서, 예를 들어, 하나 이상의 기능 블록(예: 모듈, 프로세서 또는 메모리)은 단일 하드웨어(예: 범용 신호 프로세서 또는 랜덤 액세스 메모리의 블록, 하드 디스크 등) 또는 다수의 하드웨어에서 구현될 수 있다. 유사 하게, 프로그램은 독립형 프로그램일 수 있고, 운영 체제에 하위 루틴으로서 통합될 수 있고, 설치된 소프트웨 어 패키지 내의 기능일 수 있고, 등등이다. 다양한 구현이 도면에 도시된 배열 및 수단으로 제한되지 않는다는 것이 이해될 것이다. 모듈로 지정된, 도면의 처리 엔진 및 데이터베이스는 하드웨어 또는 소프트웨어로 구현될 수 있고, 도면에 도시 된 바와 같이 정확하게 동일한 블록으로 분할될 필요가 없다. 모듈 중 일부는 또한, 상이한 프로세서, 컴퓨터, 또는 서버에서 구현될 수 있거나, 또는 다수의 상이한 프로세서, 컴퓨터, 또는 서버 사이에 분산될 수 있다. 또한, 모듈 중 일부가, 달성된 기능에 영향을 주지 않고서 도면에 도시된 것과 조합되어, 병렬로 또는 상이한 순서로 작동될 수 있다는 것이 이해될 것이다. 도면에서의 모듈은 또한, 방법에서의 흐름도 단계로서 생각될 수 있다. 모듈은 또한, 그의 코드 전부가 반드시 메모리에 인접하게 배치될 필요가 없고; 코드의 일부는 코드 의 다른 부분과는 분리될 수 있으며, 이때 다른 모듈 또는 다른 기능으로부터의 코드가 사이에 배치된다. 개시된 기술의 예시적인 응용 생물학적 양 모델의 다양한 구현의 수 많은 비교에 의해 강조되는 바와 같이, 많은 구현은 아키텍처 컴포 넌트에서 중복을 공유한다. \"생물학적 양 모델\"이라는 문구와 관련하여, 생물학적 양 모델은 게놈 시퀀스로부 터 복수의 생물학적 양 클래스를 예측한다. 생물학적 양 클래스의 예는 단백질(전사 인자) 결합, 메틸화, 히스 톤 수정, DNA 접근성, 보존을 포함한다. 이들 중, 메틸화와 히스톤 수정은 후생적인 것으로 간주된다. 이와는 대조적으로, 염색질은 히스톤 수정 및 DNA 접근성을 지칭한다. 따라서, 일부 구현에서, 생물학적 양 모델은 \"후생유전학 모델\"로 지칭될 수 있다. 다른 구현에서, 생물학적 양 모델은 \"염색질 모델\"로 지칭될 수 있다. 또 다른 구현에서, 생물학적 양 모델은 \"염색질 및 후생유전학 모 델\" 또는 \"후생유전학 및 염색질 모델\"로 지칭될 수 있다. 생물학적 양 모델의 각각의 요소는 다수의 실시예에서 결합될 수 있는 다수의 구현을 갖는다. 개시된 기 술을 위해 구현될 수 있는 다양한 순열은 더 넓은 범위의 유용성, 성능 효율성 및 성능 정확성 모두를 제공한다. 핵산 시퀀스의 관점 및 염색질 구조의 관점으로부터 복수의 추가 시퀀스 포맷을 생성하기 위해 개시 된 기술의 많은 구현에서 입력 염기 시퀀스에 적용되는 데이터 변환은 광범위한 유전체학, 단백질 분석, 및 병 원성 연구 질문에 폭넓은 적용성을 갖는 풍부한 출력 신호의 출력을 초래하는 혁신적인 전략이다. 이전 버전의 PrimateAI는 높은 성능을 가진 변이체 병원성의 분류를 위해 여러 가지 도구를 사용했다. 이 생물학적 양 모델 은 이 방법론에 다른 도구 뿐만 아니라 생물학적 복제 및 전사 프로세스에 영향을 미치는 후생적 신호를 연구하는 추가적인 차원을 도입한다. PrimateAI가 제공하는 다양한 도구 외에도 유전자 발현을 연구하기 위해 염색질 구조의 추가적인 관점이 유용하 다는 것은 분명하지만, 개시된 기술이 제공하는 진정한 영향은 전체 유전자 발현 예측 로직에 후생적 신호를 추 가하는 데에 있다. 염색질의 DNA 시퀀스 및 히스톤 단백질 성분 둘 모두는 다량의 화학적 변형을 겪을 수 있다. 염색질 성분에 직접 결합하고 염색질 성분의 화학적 변형을 촉매하는 효소는 염색질 구조를 변경할 수 있고, 염색질 구조의 변화는 또한 이들의 타깃 리간드 접근하여 기능하는 염색질-상호작용 효소의 능력을 변경 할 수 있다. 염색질의 구조 및 구조를 변경하는 효소는 전사 및 발현을 위한 유전자의 접근성에 직접적으로 영 향을 미친다. DNA 변이체는 염색질 구조의 변화를 유발할 수 있으며, 이는 후속적으로 유전자 발현 및 유전자 억제의 적절한 조절에 필요한 전사 인자 결합 및 효소 반응과 같은 후생적 효과를 변화시킬 수 있다. 역으로, 메틸화 및 단백질 결합 현상과 같은 염색체에 대한 후생적 영향은 돌연변이 비율에 영향을 미칠 수 있 으며, 잠재적으로 잠복성 또는 병원성일 수 있는 변이체를 도입할 수 있다. 유전자에 대한 진화적 제약 및 해 당 유전자의 변이체의 병원성에 대한 연구는 개시된 기술의 많은 구현에서 입증된 바와 같이 후생적 특징에 의 해 증강될 때 상당히 더 포괄적이고 정확하다. 전반적으로, 개시된 기술은 타깃 유전자 시퀀스에 대한 유전자 발현 및 유전자 병원성의 예측에 적용될 수 있는 다양한 출력을 생성하기 위한 훈련 및 학습 전략의 범위에 허 용되는 다양한 변경을 보유한다. 개시된 염색질-집중 전략은 유전적 및 환경적 노출-관련 질환의 연구, 약물의 개발, 및 핵산 시퀀스의 단백질로의 전사 및 변환에서의 후생유전학의 영향에 유용하다. 생물학적 양 모델 개요 도 1은 유전자 시퀀스의 진화적, 후생적 특성을 결정하기 위한 시스템의 프로세스을 설명하는 흐름도이다. 입력 염기 시퀀스는 시퀀스 데이터베이스로부터 추출되고, 입력 염기 시퀀스의 대체 표현을 생성하는 생물학적 양 모델에 의해 처리된다. 입력 염기 시퀀스의 대체 표현은 복수의 생물학적 양 출 력 시퀀스의 형태로 대체 생물학적 양 표현으로 변환된다. 생물학적 양 모델 입력 데이터 도 2는 시퀀스 데이터베이스로부터 추출된 뉴클레오티드 염기를 포함하는 예시적인 입력 염기 시퀀스(20 0)를 개략적으로 도시하며, 여기서 타깃 염기 시퀀스는 상류 컨텍스트 염기를 포함하는 좌측 시퀀스 및 하류 컨텍스트 염기를 포함하는 우측 시퀀스에 의해 플랭킹된다. 상류 컨텍스트 염기는 아데닌, 티민, 시토신 또는 구아닌과 동일할 수 있는 뉴클레오티드 염기의 시퀀스 {x1, x2, x3, ..., xn}이다. 타깃 염 기 시퀀스는 후속하여 상류 컨텍스트 염기를 따른다. 타깃 염기 시퀀스는 아데닌, 티민, 시토 신 또는 구아닌과 같을 수 있는 뉴클레오티드 염기의 시퀀스 {y1, y2, y3, ..., yn}를 포함한다. 하류 컨텍스트 염기는 후속하여 타깃 염기 시퀀스를 따른다. 하류 컨텍스트 염기는 아데닌, 티민, 시토신 또는 구 아닌과 같을 수 있는 뉴클레오티드 염기 {z1, z2, z3, ..., zn}의 시퀀스이다. 입력 염기 시퀀스는 또한 상류 컨텍스트 염기, 타깃 염기 시퀀스, 또는 하류 컨텍스트 염기에서 알려지지 않았거나 누락 된 갭 위치를 포함할 수 있다. 도 3은 2개의 예시적인 대체 시퀀스(322 및 342)를 갖는 예시적인 기준 유전자 시퀀스로부터의 대체 시퀀 스의 일례를 도시하며, 여기서, 대체 시퀀스는 단일 염기 위치에서 각각의 단일 뉴클레오티드 변이체를 보 유하지만, 그 외에는 기준 시퀀스와 동일한 조성을 보유한다. 예를 들어, 단일 뉴클레오티드 치환은 뉴클레오 티드와 비교하여 변이체 및 변이체로 나타난다. 동일한 타깃 염기 시퀀스를 보유하는 것에 더 하여, 상류 시퀀스(304, 324, 및 344)는 서로 동일하고, 하류 시퀀스(308, 328, 및 348)는 서로 동일하다. 도 4는 개시된 기술의 일 구현을 위해 개발된 훈련 데이터세트에 속하는 시퀀스의 유전자 구성을 도시한다. 하나의 훈련 데이터세트는 후생적 효과에 의해 교란된 대체 시퀀스(예: 단일 뉴클레오티드 변 이체를 보유하는 대체 시퀀스 A)를 포함하고 제2 훈련 데이터세트는 후생적 효과에 의해 교란되 지 않는 대체 시퀀스(예: 단일 뉴클레오티드 변이체를 보유하는 시퀀스)를 포함한다. 단일 뉴클레오 티드 변이체(433 및 463)는 기준 염기 위치와 조성이 상이하지만; 기준 시퀀스, 대체 시퀀스 A 및 대 체 시퀀스 B 내의 모든 다른 염기 위치는 상이하지 않다. 생물학적 양 모델 구조 도 5는 도 4에 설명된 제1 훈련 세트로 훈련된 생물학적 양 모델로 도 1의 시스템에 적용된 다음, 도 4에 설명된 제2 훈련 세트로 재훈련을 받고 있는 훈련 절차의 일 구현을 개략적으로 도시한다. 시퀀스 데이터베이스로부터 획득된 시퀀스는 먼저 제1 훈련 반복 세트에 대한 제1 훈련 데이터세트로 부터 획득되어, 염기 해상도에서 유전자 발현의 변화를 검출하도록 구성된 생물학적 양 모델을 활용하여, 입력 염기 시퀀스로부터 복수의 생물학적 양 출력 시퀀스을 생성하며, 입력 염기 시퀀스를 처리 하고 입력 염기 시퀀스의 대체 표현(예: 합성된 표현)을 생성하는 생물학적 양 모델, 및 생물학적 양 출력 시퀀스 생성기를 포함한다. 그 다음, 생물학적 양 모델은 생물학적 양 모델의 모델 구성 에 대한 임의의 변경 없이 제2 훈련 데이터세트로부터 획득된 시퀀스에 대한 제2 훈련 반복 세트를 거친다. 일 구현에서, 생물학적 양 모델은 최저부터 최고의 시퀀스로 배열된 잔차 블록의 그룹을 포함한다. 잔차 블록의 각각의 그룹은 잔차 블록에서의 컨볼루션 필터의 수, 잔차 블록의 컨볼루션 윈도우 크기, 및 잔차 블록 의 아트러스 컨볼루션 속도에 의해 파라미터화된다. 아트러스 컨볼루션 속도는, 일부 구현에서, 더 낮은 잔차 블록 그룹으로부터 더 높은 잔차 블록 그룹으로 비지수적으로 진행된다. 다른 구현에서, 그것은 기하급수적으 로 진행된다. 잔차 블록 그룹 간의 컨볼루션 윈도우 크기는 다르며, 각 잔차 블록은 적어도 하나의 일괄 정규 화 계층, 적어도 하나의 정류 선형 유닛(약어 ReLU) 계층, 적어도 하나의 아트러스 컨볼루션 계층, 적어도 하나 의 잔차 연결로 구성된다. 일 구현에서, 입력의 차원은 (Cu + L + Cd) x 4이며, 여기서 Cu는 상류 플랭킹 컨텍스트 염기의 수이고, Cd는 하류 플랭킹 컨텍스트 염기의 수이고, L은 입력 프로모터 시퀀스에서 염기의 수이다. 출력의 차원은 4 x L이다.일부 구현에서, 잔차 블록의 각각의 그룹은 선행하는 입력을 처리함으로써 중간 출력을 생성하고, 중간 출력의 차원은 (I-[{(W-1) * D} * A]) x N이고, 여기서, I는 선행하는 입력의 차원이고, W는 잔차 블록의 컨볼 루션 윈도우 크기이고, D는 잔차 블록의 아트러스 컨볼루션 속도이고, A는 그룹에서의 아트러스 컨볼루션 계층의 수이고, N은 잔차 블록에서의 컨볼루션 필터의 수이다. 일 구현에서, 입력은 입력 시퀀스의 좌측에 200개의 상류 플랭킹 컨텍스트 염기(Cu)를 갖고 입력 시퀀스의 우측 에 200개의 하류 플랭킹 컨텍스트 염기(Cd)를 가진다. 입력 시퀀스(L)의 길이는, 3001과 같이, 임의적일 수 있 다. 일 구현에서, 제1 그룹에서의 각각의 잔차 블록은 32개의 컨볼루션 필터, 11개의 컨볼루션 윈도우 크기, 및 1개의 아트러스 컨볼루션 속도를 갖고, 제2 그룹 내의 각각의 잔차 블록은 32개의 컨볼루션 필터, 11개의 컨 볼루션 윈도우 크기, 및 4개의 아트러스 컨볼루션 속도를 갖는다. 다른 아키텍처에서, 각각의 잔차 블록은 32 개의 컨볼루션 필터, 11개의 컨볼루션 윈도우 크기, 및 1개의 아트러스 컨볼루션 속도를 갖는다. 일 구현에서, 입력은 입력 시퀀스의 좌측에 1,000개의 상류 플랭킹 컨텍스트 염기(Cu)를 갖고 입력 시퀀스의 우 측에 1,000개의 하류 플랭킹 컨텍스트 염기(Cd)를 가진다. 입력 시퀀스(L)의 길이는, 3001과 같이, 임의적일 수 있다. 일 구현에서, 4개의 잔차 블록의 적어도 3개의 그룹 및 적어도 3개의 스킵 연결이 존재한다. 제1 그 룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 11개의 컨볼루션 윈도우 크기, 및 1개의 아트러스 컨볼루션 속 도를 갖고, 제2 그룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 11개의 컨볼루션 윈도우 크기, 및 4개의 아 트러스 컨볼루션 속도를 갖고, 제3 그룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 21개의 컨볼루션 윈도우 크기, 및 19개의 아트러스 컨볼루션 속도를 갖는다. 일 구현에서, 입력은 입력 시퀀스의 좌측에 5,000개의 상류 플랭킹 컨텍스트 염기(Cu)를 갖고 입력 시퀀스의 우 측에 5,000개의 하류 플랭킹 컨텍스트 염기(Cd)를 가진다. 입력 시퀀스(L)의 길이는, 3001과 같이, 임의적일 수 있다. 일 구현에서, 4개의 잔차 블록의 적어도 4개의 그룹 및 적어도 4개의 스킵 연결이 존재한다. 제1 그 룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 11개의 컨볼루션 윈도우 크기, 및 1개의 아트러스 컨볼루션 속 도를 갖고, 제2 그룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 11개의 컨볼루션 윈도우 크기, 및 4개의 아 트러스 컨볼루션 속도를 갖고, 제3 그룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 21개의 컨볼루션 윈도우 크기, 및 19개의 아트러스 컨볼루션 속도를 갖고, 제4 그룹의 각각의 잔차 블록은 32개의 컨볼루션 필터, 41개 의 컨볼루션 윈도우 크기, 및 25개의 아트러스 컨볼루션 속도를 갖는다. 일반적으로 말하면, 생물학적 양 모델은 규칙 기반 모델, 트리 기반 모델, 또는 기계 학습 모델일 수 있다. 예시로는 다층 퍼셉트론(MLP), 피드포워드 신경망, 완전 연결 신경망, 완전 컨볼루션 신경망, ResNet, WaveNet과 같은 시퀀스 대 시퀀스(Seq2Seq) 모델, 의미 분할 신경망, 및 생성적 적대 신경망(GAN)(예: CycleGAN, StyleGAN, pixelRNN, text-2-image, DiscoGAN, IsGAN) 등이 있다. 일부 구현에서, 생물학적 양 모델은 Transformer, Vision Transformer (ViT), Bidirectional Transformer (BERT), Detection Transformer (DETR), Deformable DETR, UP-DETR, DeiT, Swin, GPT, iGPT, GPT-2, GPT-3, BERT, SpanBERT, RoBERTa, XLNet, ELECTRA, UniLM, BART, T5, ERNIE (THU), KnowBERT, DeiT-Ti, DeiT-S, DeiT-B, T2T-ViT-14, T2T-ViT-19, T2T-ViT-24, PVT-Small, PVT-Medium, PVT-Large, TNT-S, TNT-B, CPVT-S, CPVT-S-GAP, CPVT-B, Swin-T, Swin-S, Swin-B, Twins-SVT-S, Twins-SVT-B, Twins-SVT-L, Shuffle-T, Shuffle- S, Shuffle-B, XCiT-S12/16, CMT-S, CMT-B, VOLO-D1, VOLO-D2, VOLO-D3, VOLO-D4, MoCo v3, ACT, TSP, Max- DeepLab, VisTR, SETR, Hand-Transformer, HOT-Net, METRO, Image Transformer, Taming transformer, TransGAN, IPT, TTSR, STTN, Masked Transformer, CLIP, DALL-E, Cogview, UniT, ASH, TinyBert, FullyQT, ConvBert, FCOS, Faster R-CNN + FPN, DETR-DC5, TSP-FCOS, TSP-RCNN, ACT+MKDD (L=32), ACT+MKDD (L=16), SMCA, Efficient DETR, UP-DETR, UP-DETR, ViTB/16-FRCNN, ViT-B/16-FRCNN, PVT-Small+RetinaNet, Swin- T+RetinaNet, Swin-T+ATSS, PVT-Small+DETR, TNT-S+DETR, YOLOS-Ti, YOLOS-S, 및 YOLOS-B와 같은 셀프 어텐션 메커니즘을 포함할 수 있다. 일부 구현에서, 생물학적 양 모델의 예는 복수의 컨볼루션 계층을 갖는 컨볼루션 신경망(CNN), 장기 단기 메모리 네트워크(LSTM), 양방향 LSTM(Bi-LSTM), 또는 게이트형 순환 유닛과 같은 순환 신경망(RNN), 및 CNN과 RNN 양자의 조합을 포함한다. 일부 구현에서, 생물학적 양 모델은 1D 컨볼루션, 2D 컨볼루션, 3D 컨볼루션, 4D 컨볼루션, 5D 컨볼루션, 확장형 또는 아트러스 컨볼루션, 전치 컨볼루션, 깊이별 분리가능 컨볼루션, 포인트별 컨볼루션, 1x1 컨볼루션, 그룹 컨볼루션, 편평형 컨볼루션, 공간 및 교차 채널 컨볼루션, 셔플 그룹형 컨볼루션, 공간 분리가능 컨볼루션, 및 디컨볼루션을 사용할 수 있다. 생물학적 양 모델은 하나 이상의 손실 함수, 예컨대 로지스 틱 회귀/로그 손실, 다중클래스 교차-엔트로피/소프트맥스 손실, 이진 교차-엔트로피 손실, 평균 제곱 오류 손 실, L1 손실, L2 손실, 평활한 L1 손실, 및 Huber 손실을 사용할 수 있다. 생물학적 양 모델은 임의의 병 렬성, 효율성, 및 압축 체계, 예컨대 TFRecord, 압축 인코딩(예: PNG), 샤딩, 맵 변환을 위한 병렬 검출, 배칭,프리페칭, 모델 병렬성, 데이터 병렬성, 및 동기식/비동기식 확률적 기울기 하강법(SGD)을 사용할 수 있다. 유 전자 발현 모델은 업샘플링 계층, 다운샘플링 계층, 순환 연결, 게이트 및 게이트형 메모리 유닛(예: LSTM 또는 GRU), 잔차 블록, 잔차 연결, 하이웨이 연결, 스킵 연결, 핍홀(peephole) 연결, 활성화 함수(예: ReLU(rectifying linear unit), 리키 ReLU(leaky ReLU), ELU(exponential liner unit), 시그모이드 및 tanh(hyperbolic tangent)와 같은 비선형 변환 함수), 일괄 정규화 계층, 규칙화 계층, 드롭아웃, 풀링 계층(예 컨대, 최대 또는 평균 풀링), 글로벌 평균 풀링 계층, 및 주의 메커니즘을 포함할 수 있다. 일부 구현에서, 생물학적 양 모델은 선형 회귀 모델, 로지스틱 회귀 모델, Elastic Net 모델, 서포트 벡터 머신(SVM), 랜덤 포레스트(RF), 결정 트리, 또는 향상된 결정 트리(예: XGBoost), 또는 일부 다른 트리 기반 로 직(예: 메트릭 트리, kd-트리, R-트리, 범용 B-트리, X-트리, 볼 트리, 로컬리티 센서티브 해시, 및 역 인덱 스)일 수 있다. 생물학적 양 모델은, 일부 구현에서, 다수의 모델의 총체일 수 있다. 일부 구현에서, 생물학적 양 모델은 역전파 기반 기울기 업데이트 기법을 사용하여 훈련될 수 있다. 상기 모델을 훈련하기 위해 사용될 수 있는 예시적인 기울기 하강 기법은 확률적 기울기 하강법, 일괄 기울기 하강법, 및 미니-일괄 기울기 하강법을 포함한다. 상기 모델을 훈련하는 데 사용될 수 있는 기울기 하강 최적 화 알고리즘의 일부 예는 Momentum, Nesterov 가속화된 기울기, Adagrad, Adadelta, RMSprop, Adam, AdaMax, Nadam, 및 AMSGrad이다. 도 6은 도 4에 설명된 제1 훈련 세트를 사용하여 도 1의 시스템에 적용된 다음, 도 4에 설명된 제2 훈련 세트의 하위 세트와의 재훈련을 진행하고, 제2 훈련 세트로부터의 샘플의 나머지 하위 세트와의 생물학적 양 모 델의 모델 검증이 뒤따르는 훈련 절차의 다른 구현을 개략적으로 도시한다. 시퀀스 데이터베이스 로부터 획득된 시퀀스는 먼저 제1 훈련 반복 세트에 대한 제1 훈련 데이터세트로부터 획득되어, 염기 해상도에서 유전자 발현의 변화를 검출하도록 구성된 생물학적 양 모델을 활용하여, 입력 염기 시퀀스 로부터 복수의 생물학적 양 출력 시퀀스를 생성하며, 입력 염기 시퀀스를 처리하고 입력 염기 시퀀스의 대체 표현(예: 합성 표현)을 생성하는 생물학적 양 모델, 및 생물학적 양 출력 시퀀스 생성 기를 포함한다. 그 다음, 생물학적 양 모델은 생물학적 양 모델의 모델 구성에 대한 임의의 변 경 없이 제2 훈련 데이터세트로부터 획득된 시퀀스의 하위 세트에 대한 제2 훈련 반복 세트를 거친다. 훈 련 반복 및 훈련 반복에 이어서, 생물학적 양 모델은 제2 훈련 데이터세트의 제2 하위 세트와의 검증 프로세스를 거치며, 여기서 훈련 데이터세트의 제1 및 제2 하위 세트는 2개가 중복되지 않고, 이는 생물학적 양 모델이 더 다양하고 보이지 않는 훈련 예제에 대해 훈련될 수 있게 한다. 도 7은 변이체 분류를 위한 도 1로부터의 시스템의 구현의 개략도이며, 여기서 상기 시스템을 사용하 여 783에서 표현된 각각의 시퀀스에 대한 생물학적 양 모델의 각각의 모델 출력을 비교함으로써 염기 해상 도에서 기준 시퀀스 및 대체 시퀀스를 비교한다. 기준 시퀀스는 생물학적 양 모델에 의해 개별적으로 처리된다. 대체 표현 생성기는 기준 입력 염기 시퀀스를 처리하여 대체 표현을 생성하고 (예: 합성된 표현 시퀀스), 생물학적 양 출력 시퀀스 생성기는 대체 표현을 처리하여 복수의 생물학적 양 출력 시퀀스를 생성한다. 대체 시퀀스는 생물학적 양 모델에 의해 개별적으로 처리된다. 대체 표현 생성기는 기준 입력 염기 시퀀스를 처리하여 대체 표현을 생성하고(예: 합성된 표현 시퀀스), 생물학적 양 출력 시퀀스 생성기는 대체 표현을 처리하여 복수의 생물학적 양 출력 시퀀스을 생성한 다. 흐름도를 종료시키는 것으로 나타낸 프로세스에서 입증된 바와 같이, 복수의 생물학적 양 출력 시퀀 스 및 복수의 생물학적 양 출력 시퀀스는 염기 해상도에서 비교된다. 도 8은 기준 시퀀스와 대체 시퀀스의 비교가 최종 평균 델타 값에 의해 정량화되는 개시된 기술의 일 구현 의 흐름도이다. 최종 평균 델타 값을 결정하기 위해, 염기 해상도 병원성 분류 로직은 기준 시 퀀스에 대해 예측된 복수의 생물학적 양 출력 시퀀스와 대체 시퀀스 사이의 차이를 처리하도록 구성된다. 최종 평균 델타 값은 기준 시퀀스와 대체 시퀀스를 비교하는 제1 누적 평균 델타 값 및 기준 시퀀스 와 대체 시퀀스를 비교하는 제2 평균 델타 값으로부터의 평균으로 취해진다. 제1 델타 시퀀스는 기 준 시퀀스로부터 예측되는 제1 기준 생물학적 양 출력 시퀀스와 대체 시퀀스로부터 예측되는 제1 대체 생 물학적 양 출력 시퀀스 사이의 염기 당 차이로 생성된다. 제2 델타 시퀀스는 제2 기준 생물학적 양 출력 시퀀스와 제2 대체 생물학적 양 출력 시퀀스 사이의 염기 당 차이로 생성된다. 제1 누적 평균 델타 값은 제1 델타 시퀀스 내의 각각의 염기 위치에 대해 획득된 델타 값의 평균으로 취해진다. 제 2 누적 평균 델타 값은 제2 델타 시퀀스 내의 각각의 염기 위치에 대해 획득된 델타 값의 평균으로 취해진다. 최종 평균 델타 값에 기초하여, 대체 시퀀스에 의해 표현되는 변이체는 보존 상태로 분류될 수 있으며, 여기서 변이체는 보존된 상태 또는 비보존된 상태에 속하는 것으로 분류될 수 있다. 도 9은 기준 시퀀스와 대체 시퀀스의 비교가 최종 합 델타 값에 의해 정량화되는 개시된 기술의 일 구현 의 흐름도이다. 최종 합 델타 값을 결정하기 위해, 염기 해상도 병원성 분류 로직은 기준 시퀀 스에 대해 예측된 복수의 생물학적 양 출력 시퀀스와 대체 시퀀스 사이의 차이를 처리하도록 구성된다. 최종 합 델타 값은 기준 시퀀스와 대체 시퀀스를 비교하는 제1 누적 합 델타 값 및 기준 시퀀스와 대 체 시퀀스를 비교하는 제2 합 델타 값으로부터의 합으로 취해진다. 제1 델타 시퀀스는 기준 시퀀스 로부터 예측되는 제1 기준 생물학적 양 출력 시퀀스와 대체 시퀀스로부터 예측되는 제1 대체 생물학적 양 출력 시퀀스 사이의 염기 당 차이로 생성된다. 제2 델타 시퀀스는 제2 기준 생물학적 양 출력 시퀀 스와 제2 대체 생물학적 양 출력 시퀀스 사이의 염기 당 차이로 생성된다. 제1 누적 합 델타 값 은 제1 델타 시퀀스 내의 각각의 염기 위치에 대해 획득된 델타 값의 합으로 취해진다. 제2 누적 합 델타 값은 제2 델타 시퀀스 내의 각각의 염기 위치에 대해 획득된 델타 값의 합으로 취해진다. 최 종 합 델타 값에 기초하여, 대체 시퀀스에 의해 표현되는 변이체는 보존 상태로 분류될 수 있으며, 여기서 변이체는 보존된 상태 또는 비보존된 상태에 속하는 것으로 분류될 수 있다. 도 10은, 생물학적 양 모델이 종단 간으로 훈련되는 제1 가중치 세트 및 제2 가중치 세트를 통해 입력 염기 시퀀스로부터 2개의 생물학적 양 출력 시퀀스를 생성하는, 개시된 기술의 일 구현 의 흐름도이다. 제1 가중치 세트는 입력 염기 시퀀스의 대체 표현을 생성하기 위해 입력 염 기 시퀀스를 처리하는 대체 표현 생성기를 포함한다. 제2 가중치 세트는 입력 염기 시퀀스 의 대체 표현을 처리하고 복수의 생물학적 양 출력 시퀀스을 생성하는 생물학적 양 출력 시퀀스 생 성기를 포함한다. 개시된 기술의 구현에서, 2개의 출력 시퀀스(1081 및 1083)가 생물학적 양 출력 시퀀스 생성기로부터 생성된다. 도 11은, 생물학적 양 모델이 종단 간으로 훈련되는 제1 가중치 세트 및 제2 가중치 세트를 통해 입력 염기 시퀀스로부터 3개의 생물학적 양 출력 시퀀스를 생성하는, 개시된 기술의 일 구현 의 흐름도이다. 제1 가중치 세트는 입력 염기 시퀀스의 대체 표현을 생성하기 위해 입력 염 기 시퀀스를 처리하는 대체 표현 생성기를 포함한다. 제2 가중치 세트는 입력 염기 시퀀스 의 대체 표현을 처리하고 복수의 생물학적 양 출력 시퀀스를 생성하는 생물학적 양 출력 시퀀스 생 성기를 포함한다. 도 11의 구현은 3개의 출력 시퀀스(1162, 1164, 및 1166)가 생물학적 양 출력 시퀀스 생성기로부터 생성된 2개의 출력 시퀀스(1081 및 1083)와 비교하여 생물학적 양 출력 시퀀스 생성기로부터 생성된다는 점에서 도 10의 구현과 상이하다. 도 10에서, 제1 출력 시퀀스는 진화적 보존의 염기 당 측정일 수 있다. 제2 출력 시퀀스는 전사 시작의 염기 당 측정일 수 있다. 도 11에서, 제1 출력 시퀀스 는 진화적 보존의 염기 당 측정일 수 있다. 제2 출력 측정은 전사 개시의 염기 당 측정일 수 있다. 당업자는 다중 출력 시퀀스가 동시에 예측될 수 있고, 진화 보존의 측정, 나타낸 전사 개시의 측정, 및 염기 당 후생적 신호와 같은 정보의 상이한 순열 및 조합을 나타낼 수 있음을 이해할 것이다. 도 12는 생물학적 양 모델이 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트 및 입력 염기 시퀀스의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하기 위해 처음부터 훈련되는 제2 가중치 세트를 포함하는 개시된 기술의 일 구현의 흐름도이다. 도 10의 구현 및 도 11의 구현을 비교하여, 제1 가중치 세트 및 제2 가중치 세트는 구현에서 종단 간으로 훈련되 지 않는다. 도 10의 구현 및 도 11의 구현에서 유사하게 수행되는 바와 같이, 구현을 위한 제1 가중치 세트는 입력 염기 시퀀스의 대체 표현을 생성하기 위해 입력 염기 시퀀스를 처리 하는 대체 표현 생성기를 포함한다. 그러나, 가중치가 종단 간으로 훈련되는 구현과는 대조적으로, 대체 표현 생성기로부터의 대체 시퀀스 표현 출력은 복수의 생물학적 양 출력 시퀀스를 생성하기 위해 제2 가중치 세트를 훈련하는데 사용되는 생물학적 양 출력 시퀀스 생성기로서 구성된 후속 모 델에 대한 입력에 매핑된다. 도 13은, 생물학적 양 모델이 단일 기반으로 후속 생물학적 양 출력 시퀀스를 생성하기 위해 종단 간으로 훈련되고 재훈련되는 제1 가중치 세트 및 제2 가중치 세트을 통해 입력 염기 시퀀스로부터 하나의 생물학적 양 출력 시퀀스를 생성하는, 개시된 기술의 일 구현의 흐름도이다. 도 13에 도시 된 주어진 예에서, 생물학적 양 모델은 제1 가중치 세트 및 제2 가중치 세트에 대해 훈련되어 복수의 생물학적 양 출력 시퀀스에서 제1 출력 시퀀스를 생성한다. 제1 출력 시퀀스가 생성된 후,생물학적 양 모델은 제1 가중치 세트 및 제2 가중치 세트에 대해 종단 간으로 재훈련되어 입 력 염기 시퀀스를 처리하고 제2 출력 시퀀스를 생성한다. 재훈련 프로세스에서, 입력 염기 시퀀스 는 입력 염기 시퀀스와 동일하고, 제1 가중치 세트는 제1 가중치 세트와 동일하며, 제 2 가중치 세트는 제2 가중치 세트와 동일하다. 그러나, 제2 출력 시퀀스는 제1 생물학적 양 출력 시퀀스와 상이한 생물학적 양 출력 시퀀스이다. 복수의 생물학적 양 출력 시퀀스 전체에 대해, 제1 및 제2 가중치를 종단 간으로 재훈련시켜 각각의 후속 생물학적 양 출력 시퀀스를 생성한다. 도 14는, 생물학적 양 모델이 입력 염기 시퀀스로부터 복수의 생물학적 양 출력 시퀀스을 생성하도 록 종단 간으로 훈련되는 제1 가중치 세트 및 제2 가중치 세트, 및 입력 복수의 생물학적 양 출력 시퀀스로부터 유전자 발현 출력 시퀀스를 생성하도록 종단 간으로 훈련되는 제3 및 제4 가중치 세 트(1426 및 1446)을 포함하는, 개시된 기술의 일 구현의 흐름도이다. 입력 염기 시퀀스로부터의 생물학적 양 출력 시퀀스의 생성은 도 10의 구현 및 도 11의 구현과 유사하며, 여기서 입력 염기 시퀀스는 대체 표현 생성기로서 구성된 제1 가중치 세트 및 생물학적 양 출력 시퀀스 생성기로서 구성된 제2 가중치 세트에 의해 처리되어 복수의 생물학적 양 출력 시퀀스를 생 성한다. 이어서, 제2 가중치 세트의 출력으로서 복수의 출력 시퀀스는 유전자 발현 출력 시퀀스 를 생성하도록 구성된 후속 모델을 위한 입력에 매핑된다. 입력 생물학적 양 출력 시퀀스는 종단 간으로 훈련되는 제3 가중치 세트 및 제4 가중치 세트에 의해 처리된다. 제3 가중치 세트 는 생물학적 양 대체 표현 생성기로서 구성되고, 제4 가중치 세트는 유전자 발현 출력 생성기 로서 구성된다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유전자 발현의 측정이다. 도 15는, 생물학적 양 모델이 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트, 처 음부터 훈련되어 입력 염기 시퀀스의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스을 생성하 는 제2 가중치 세트, 및 종단 간으로 훈련되어 입력 복수의 생물학적 양 출력 시퀀스로부터 유전자 발현 출력 시퀀스를 생성하는 제3 및 제4 가중치 세트(1124 및 1546)를 포함하는 개시된 기술의 일 구현 의 흐름도이다. 입력 염기 시퀀스로부터의 생물학적 양 출력 시퀀스의 생성은 도 12의 구현 과 유사하며, 여기서 생물학적 양 모델은 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중 치 세트 및 처음부터 훈련되어 입력 염기 시퀀스의 대체 표현으로부터 복수의 생물학적 양 출력 시 퀀스를 생성하는 제2 가중치 세트를 포함한다. 구현(도 10의 1000, 도 11의 1100, 도 12의 1200, 도 13의 1300, 및 도 14의 1400)에서와 같이, 제1 가중치 세 트는 대체 표현 생성기로서 구성되고, 제2 가중치 세트는 생물학적 양 출력 시퀀스 생성기 로서 구성된다. 이어서, 제2 가중치 세트의 출력으로서 복수의 출력 시퀀스는 유전자 발현 출력 시퀀스를 생성하도록 구성된 후속 모델을 위한 입력에 매핑된다. 입력 생물학적 양 출력 시 퀀스는 종단 간으로 훈련되는 제3 가중치 세트 및 제4 가중치 세트에 의해 처리된다. 제3 가중치 세트는 생물학적 양 대체 표현 생성기로서 구성되고, 제4 가중치 세트는 유전자 발현 출력 생성기로서 구성된다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유전자 발현의 측정 이다. 도 16은, 생물학적 양 모델이 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트, 처 음부터 훈련되어 복수의 생물학적 양 출력 시퀀스를 생성하는 제2 가중치 세트, 처음부터 훈련되어 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하는 제3 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가 중치 세트를 포함하는 개시된 기술의 일 구현의 흐름도이다. 입력 염기 시퀀스로부터의 생 물학적 양 출력 시퀀스의 생성은 도 16의 구현과 유사하며, 여기서 생물학적 양 모델은 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트 및 처음부터 훈련되어 입력 염기 시퀀스 의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하는 제2 가중치 세트를 포함 한다. 구현(도 10의 1000, 도 11의 1100, 도 12의 1200, 도 13의 1300, 도 14의 1400, 및 도 15의 1500)에서와 같이, 제1 가중치 세트는 대체 표현 생성기로서 구성되고, 제2 가중치 세트는 생물학적 양 출력 시 퀀스 생성기로서 구성된다. 이어서, 제2 가중치 세트의 출력으로서 복수의 생물학적 양 출력 시퀀 스는 대체 생물학적 양 표현을 생성하도록 구성된 후속 모델에 대한 입력에 매핑된다. 후속 모델은 처음부터 훈련되어 대체 생물학적 양 표현을 생성하는 제3 가중치 세트를 포함하는 생물학 적 양 대체 표현 생성기로서 구성된다. 이어서, 제3 가중치 세트의 출력으로서 대체 생물학적 양표현 출력은 유전자 발현 출력 시퀀스를 생성하기 위해 제2 후속 모델에 대한 입력에 매핑된 다. 제2 후속 모델은 처음부터 훈련되어 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는 유전자 발현 출력 생성기로서 구성된다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유전자 발현의 측정이다. 도 17은, 생물학적 양 모델이 종단 간으로 훈련되어 입력 염기 시퀀스로부터 복수의 생물학적 양 출 력 시퀀스를 생성할 수 있는 제1 가중치 세트 및 제2 가중치 세트를 포함하는, 개시된 기술 의 일 구현의 흐름도이다. 제3 가중치 세트는 처음부터 훈련되어 복수의 생물학적 양 출력 시퀀스 로부터 대체 생물학적 양 표현을 생성할 수 있다. 제4 가중치 세트는 처음부터 훈련되어 대 체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성할 수 있다. 주어진 위치에서 주어 진 타깃 염기에 대한 유전자 발현 출력 시퀀스에서 주어진 염기 당 유전자 발현 출력은 주어진 위치에서 주어진 타깃 염기의 유전자 발현 수준의 척도를 특정한다. 일 구현에서, 유전자 발현 수준은 CAGE 전사 시작 부위(CTSS)와 같은 염기 당 메트릭으로 측정된다. 다른 구현에서, 유전자 발현 수준은 유전자 당 메트릭, 예컨 대 TPM(transcripts per million) 또는 RPKM(reads per kilobase of transcript)으로 측정된다. 또 다른 구현 에서, 유전자 발현 수준은 FPKM(fragments per kilobase million)과 같은 유전자 당 메트릭으로 측정된다. 입력 염기 시퀀스로부터의 생물학적 양 출력 시퀀스의 생성은 도 10의 구현 및 도 11의 구현 과 유사하며, 여기서 입력 염기 시퀀스는 대체 표현 생성기에 의해 적용된 제1 가중치 세트 및 생물학적 양 출력 시퀀스 생성기에 의해 적용된 제2 가중치 세트에 의해 처리되어 복수 의 생물학적 양 출력 시퀀스를 생성할 수 있다. 이어서, 제2 가중치 세트의 출력으로서 복수의 생물학적 양 출력 시퀀스는 대체 생물학적 양 표현 을 생성하도록 구성된 후속 모델에 대한 입력에 매핑될 수 있다. 후속 모델은 처음부터 훈련되어 대체 생물학적 양 표현을 생성하는 제3 가중치 세트를 포함하는 생물학적 양 대체 표현 생성기 로서 구성될 수 있다. 이어서, 제3 가중치 세트의 출력으로서 대체 생물학적 양 표현 출력 은 유전자 발현 출력 시퀀스를 생성하기 위해 제2 후속 모델에 대한 입력에 매핑될 수 있다. 제2 후속 모델은 처음부터 훈련되어 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는 유전자 발현 출력 생성기로서 구성될 수 있다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유 전자 발현의 측정이다. 생물학적 양 모델에 대한 전송 학습의 적용 도 18은, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련된 후, 제3 가중치 세트의 치환으로 재훈련되어 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하는 제1 가중치 세트, 및 치환된 제1 가중치 세트로 종단 간에 훈련되어 생물학적 양 출 력 시퀀스로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 대체 표현 생성기로부터 학습되는 가중치 세트 1에 대한 최 적화된 가중치 스칼라 값은 제3 가중치 세트 내의 각각의 가중치에 대한 치환 스칼라 값으로서 전송될 수 있다. 도 14의 구현 및 도 15의 구현에서와 같이, 생물학적 양 대체 표현 생성기는 유전자 발현 출력 생성기를 포함하는 제4 가중치 세트로 종단 간으로 훈련되는 제3 가중치 세트를 포함한다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유전자 발현의 측정이다. 도 19는, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련된 다음, 제3 가중치 세트의 치환으로서 재훈련되어 대체 시퀀스 표현으로부터 대체 생물학적 양 표현 을 생성하는 제1 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도 이다. 대체 표현 생성기로부터 학습되는 가중치 세트 1에 대한 최적화된 가중치 스칼라 값은 제3 가중치 세트 내의 각각의 가중치에 대한 치환 스칼라 값으로서 전송될 수 있다. 이어서, 제3 가중치 세트의 출력으로서 대체 생물학적 양 표현 출력은 유전자 발현 출력 시퀀스 를 생성하기 위해 후속 모델에 대한 입력에 매핑된다. 도 16의 구현 및 도 17의 구현(170 0)에서와 같이, 후속 모델은 처음부터 훈련되어 유전자 발현 출력 시퀀스을 생성하는 제4 가중치 세트 를 포함하는 유전자 발현 출력 생성기로서 구성된다. 생성된 유전자 발현 출력 시퀀스는 염 기 해상도 유전자 발현의 측정이다.도 20은, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련된 제1 가중치 세트, 복수의 생물학적 양 출력 시퀀스를 생성하도록 훈련된 제2 가중치 세트, 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하기 위해 제3 가중치 세트의 치환으로서 사용되는 재훈련된 제1 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현으로 부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현 의 흐름도이다. 도 19의 구현에서와 같이, 대체 표현 생성기로부터 학습되는 가중치 세트 1에 대한 최적화된 가중치 스칼라 값은 제3 가중치 세트 내의 각각의 가중치에 대한 치환 스칼라 값으로서 전송될 수 있다. 제2 가중치 세트는 복수의 생물학적 양 출력 시퀀스를 생성하도록 구성된다. 도 14의 구현 에서와 같이, 생물학적 양 출력 시퀀스의 도 15의 구현, 도 16의 구현, 및 도 17의 구현 은 제3 가중치 세트를 포함하는 생물학적 양 대체 표현 생성기로서 구성된 후속 모델의 입력 에 매핑된다. 구현에서, 제3 가중치 세트에 대한 스칼라 값은 훈련된 제1 가중치 세트로부 터의 최적화된 스칼라 값으로부터 치환된다. 도 16의 구현 및 도 17의 구현에서와 같이, 제3 가중 치 세트의 출력으로서 대체 생물학적 양 표현 출력은 유전자 발현 출력 시퀀스를 생성하기 위해 후속 모델에 대한 입력에 매핑된다. 후속 모델은 처음부터 훈련되어 유전자 발현 출력 시퀀스 를 생성하는 제4 가중치 세트를 포함하는 유전자 발현 출력 생성기로서 구성된다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유전자 발현의 측정이다. 도 21은, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련되 는 제1 가중치 세트, 입력 염기의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하도 록 훈련되는 제2 가중치 세트, 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생 성하기 위해 제3 가중치 세트의 치환으로서 사용되는 재훈련된 제1 가중치 세트, 및 치환된 제1 가 중치 세트로 종단 간으로 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생 성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 도 19로부터의 구현 및 도 20으로부터의 구현에서와 같이, 대체 표현 생성기로부터 학습되는 가중치 세트 1에 대한 최적화된 가중치 스칼라 값은 제3 가중치 세트 내의 각각의 가중치에 대한 대체 스칼라 값으로서 전송될 수 있다. 도 20의 구현에서와 같이, 제2 가중치 세트는 복수의 생물학적 양 출력 시퀀스를 생성하도록 구성된다. 도 14의 구현에서와 같이, 생물학적 양 출력 시퀀스의 도 15의 구현, 도 16의 구 현, 및 도 17의 구현은 제3 가중치 세트를 포함하는 생물학적 양 대체 표현 생성기로 서 구성된 후속 모델의 입력에 매핑된다. 도 20으로부터의 구현에서와 같이, 제3 가중치 세트에 대한 스칼라 값은 훈련된 제1 가중치 세트로부터의 최적화된 스칼라 값으로부터 치환된다. 도 14의 구현 , 도 15의 구현, 및 도 18의 구현에서와 같이, 생물학적 양 대체 표현 생성기는 유전 자 발현 출력 생성기를 포함하는 제4 가중치 세트로 종단 간으로 훈련되는 제3 가중치 세트 를 포함한다. 생성된 유전자 발현 출력 시퀀스는 염기 해상도 유전자 발현의 측정이다. 염기 해상도에서 병원성 예측 도 22는, 생물학적 양 모델이 염기 해상도에서 기준 생물학적 양 출력 시퀀스와 대체 생물학적 양 출력 시퀀스를 비교하는 병원성 예측 로직을 추가로 포함하도록 구성된, 개시된 기술의 일 구현의 흐름도이며, 여기서 제5 가중치 세트는 복수의 생물학적 양 출력 시퀀스(2253 및 2256)로부터 대체 시퀀 스 병원성 예측을 생성하고, 제1 가중치 세트(2212 및 2214) 및 제2 가중치 세트(2242 및 2244)는 각각 처음부터 훈련된다. 도 12의 구현, 도 15의 구현, 및 도 16의 구현에서와 같이, 구현 을 위한 제1 가중치 세트는 기준 입력 염기 시퀀스의 대체 표현을 생성하기 위해 기준 입력 염기 시퀀스를 처리하는 대체 표현 생성기를 포함한다. 대체 표현 생성기로부터의 대 체 시퀀스 표현 출력은 복수의 생물학적 양 출력 시퀀스를 생성하기 위해 제2 가중치 세트를 훈련하는데 사용되는 생물학적 양 출력 시퀀스 생성기로서 구성된 후속 모델에 대한 입력에 매핑된 다. 동시에, 구현을 위한 제1 가중치 세트는 대체 입력 염기 시퀀스를 처리하여 대체 입력 염기 시퀀스의 대체 표현을 생성하는 대체 표현 생성기를 포함한다. 대체 표현 생성기로부 터의 대체 시퀀스 표현 출력은 복수의 생물학적 양 출력 시퀀스를 생성하기 위해 제2 가중치 세트를 훈련하는데 사용되는 생물학적 양 출력 시퀀스 생성기로서 구성된 후속 모델에 대한 입력(223 4)에 매핑된다. 기준 시퀀스 및 대체 시퀀스에 대한 각각의 생물학적 양 모델에 대한 가중치 의 최적화된 스칼라 값은 염기 해상도 대체 시퀀스 병원성 예측을 생성하는 제5 가중치 세트로 전 송될 수 있다. 일 구현에서, 병원성 예측은 0과 1 사이의 점수일 수 있으며, 여기서 0은 절대 양성을 나타내고 1은 절대 병원 성을 나타낸다. 다른 구현에서, 컷오프를 사용할 수 있으며, 예를 들어, 병원성 점수가 5보다 크면 병원성으로 간주하고, 5보다 작으면 양성으로 간주할 수 있다. 도 23는, 생물학적 양 모델이 염기 해상도에서 기준 생물학적 양 출력 시퀀스와 대체 생물학적 양 출력 시퀀스를 비교하는 병원성 예측 로직을 추가로 포함하도록 구성된, 개시된 기술의 일 구현의 흐름도이며, 여기서 제5 가중치 세트는 복수의 생물학적 양 출력 시퀀스(2362 및 2364)로부터 대체 시퀀 스 병원성 예측을 생성하고, 제1 가중치 세트(2322 및 2324) 및 제2 가중치 세트(2342 및 2344)는 종단 간으로 훈련된다. 도 11의 구현, 도 12의 구현, 도 13의 구현, 도 14의 구현, 및 도 17의 구현에서와 같이, 기준 입력 염기 시퀀스는 대체 표현 생성기로서 구성된 제1 가중치 세트 및 생물학적 양 출력 시퀀스 생성기로서 구성된 제2 가중치 세트에 의해 처리되어 복수 의 생물학적 양 출력 시퀀스를 생성한다. 제1 가중치 세트 및 제2 가중치 세트는 종단 간으 로 훈련된다. 동시에, 제1 가중치 세트는 대체 입력 염기 시퀀스를 처리하여 대체 표현 생성기를 포함하고, 제2 가중치 세트는 생물학적 양 출력 시퀀스 생성기를 포함하여, 복수의 생물학적 양 출 력 시퀀스가 기준 입력 염기 시퀀스로부터 생성되는 것과 동일한 방식으로 복수의 생물학적 양 출 력 시퀀스를 생성한다. 기준 시퀀스 및 대체 시퀀스에 대한 각각의 생물학적 양 모델 에 대한 가중치의 최적화된 스칼라 값은 염기 해상도 대체 시퀀스 병원성 예측을 생성하는 제5 가중치 세 트로 전송될 수 있다. 생물학적 양 출력 시퀀스 데이터 도 24는 제1 생물학적 양 출력 시퀀스에 대한 값으로 입력 염기 시퀀스로부터의 생물학적 양 모델로부터 생성될 수 있는 진화 보존의 측정의 개략도이다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처 리된 후에, 생물학적 양 출력 시퀀스 생성기는 phyloP 점수의 형태로 제1 생물학적 양 출력 시퀀스 를 생성할 수 있다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처리된 후에, 생물학적 양 출력 시퀀 스 생성기는 phastCons 값의 형태로 제1 생물학적 양 출력 시퀀스를 생성할 수 있다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처리된 후에, 생물학적 양 출력 시퀀스 생성기는 phastCons 값 의 형태로 제1 생물학적 양 출력 시퀀스를 생성할 수 있다. 도 25는 제2 생물학적 양 출력 시퀀스에 대한 값으로 입력 염기 시퀀스로부터의 생물학적 양 모델로부터 생성될 수 있는 전사 개시 측정의 개략도이다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처리 된 후, 생물학적 양 출력 시퀀스 생성기는 유전자 발현(CAGE) 값의 캡 분석의 형태로 제2 생물학적 양 출력 시퀀스를 생성할 수 있다. 도 26은 제3 생물학적 양 출력 시퀀스에 대한 값으로 입력 염기 시퀀스로부터의 생물학적 양 모델로부터 생성될 수 있는 후생적 신호의 개략도이다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처리된 후, 생물학적 양 출력 시퀀스 생성기는 DNase I-과민성 부위 예측 출력의 형태로 제1 생물학적 양 출력 시퀀스를 생성할 수 있다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처리된 후에, 생물학적 양 출력 시퀀스 생성기는 전사 인자 결합 부위 예측 출력의 형태로 제1 생물학적 양 출력 시퀀스를 생 성할 수 있다. 입력 염기 시퀀스가 대체 표현 생성기에 의해 처리된 후에, 생물학적 양 출력 시퀀스 생 성기는 히스톤 수정 마크 예측 출력의 형태로 제1 생물학적 양 출력 시퀀스를 생성할 수 있다. 유전자 발현 분류 모델 도 27은, 발현 변경 분류기가 유전자 발현에 대한 변이체의 효과를 예측하도록 구성되는, 개시된 기술의 일 구현의 흐름도이다. 변이체 발현-보존 인과성 점수 검증 데이터세트를 사용하여 지정된 결정 임계 값 (예: 0.01, 0.0001 또는 1e-14 미만의 p-값 컷오프)를 갖는 이진 분류 모델에 대한 변이체 세트의 기준 진리 분기점을 생성하며, 이를 사용하여 변이체를 유전자 발현 변경 클래스(즉, 유전자 발현을 변경하는 변이체) 또는 유전자 발현 보존 클래스(즉, 유전자 발현을 변경하지 않는 변이체)로 분류할 수 있다. 변이체의 분류는 유전자 발현을 변경시킬 수 있는 통계적으로 교란되지 않는 가능성을 명시하는 할당된 인과성 점 수로부터 학습된다. 도 28은, 발현 변경 분류기는 변이체가 유전자 발현을 감소시키는지 또는 유전자 발현을 감소시키지 않는지를 예측하기 위해 발현 감소 분류기로서 추가로 구성되는, 개시된 기술의 일 구현의 흐름도이다. 변이체 과 소 발현 인과성 점수 검증 세트를 사용하여, 지정된 결정 임계 값(예: 0.01, 0.0001, 또는 1e-14 미만의 p-값 컷오프)을 갖는 이진 분류 모델에 대한 변이체 세트의 과소 발현 기준 진리 분기점을 생성하며, 이를 사 용하여 변이체를 유전자 발현 감소 클래스(즉, 유전자 발현을 줄이는 변이체) 또는 유전자 발현 비감소 클래스 (즉, 유전자 발현을 줄이지 않는 변이체)로 분류할 수 있다. 변이체의 분류는 유전자 발현을 줄일 수 있 는 통계적으로 교란되지 않는 가능성을 명시하는 할당된 과소 발현 인과성 점수로부터 학습된다. 도 29는, 변이체가 유전자 발현을 증가시키는지 또는 유전자 발현을 증가시키지 않는지를 예측하기 위해 발현 변경 분류기가 발현 증가 분류기로서 추가로 구성되는, 개시된 기술의 일 구현의 흐름도이다. 변이체 과 다 발현 인과성 점수 검증 데이터세트를 사용하여, 지정된 결정 임계 값(예: 0.01, 0.0001, 또는 1e-14 미만의 p-값 컷오프)을 갖는 이진 분류 모델에 대한 변이체 세트의 과다 발현 기준 진리 분기점을 생성하 며, 이를 사용하여 변이체를 유전자 발현 감소 클래스 또는 유전자 발현 비감소 클래스로 분류할 수 있다. 변이체의 분류는 유전자 발현을 늘릴 수 있는 통계적으로 교란되지 않는 가능성을 명시하는 할당된 과다 발현 인과성 점 수로부터 학습된다. 도 30은, 발현 변경 분류기가 변이체가 유전자 발현을 보존하고, 유전자 발현을 감소시키거나, 또는 유전자 발 현을 증가시킬지를 예측하는 다중-클래스 발현 분류기로 추가로 구성되는, 개시된 기술의 일 구현의 흐름 도이다. 변이체 데이터세트는 시스템에 의해 처리되며, 여기서 제1 성능 측정치는 유전자 발현 변경 인 과성 점수로부터 유전자 발현 변경 클래스 또는 유전자 발현 보존 클래스에 해당하는 출력을 생성하는 결정 임계치를 갖는 이진 분류기를 통한 기준 진리 분기점에 대한 추론된 분기점의 비교를 위해 생성되고, 제2 성능 측정치는 유전자 발현 감소 인과성 점수로부터 유전자 발현 감소 클래스 또는 유전자 발현 비감소 클래스에 해당하는 출력을 생성하는 결정 임계치를 갖는 이진 분류기를 통한 기준 진리 분기점에 대한 추론된 분기점의 비교를 위해 생성되고, 제3 성능 측정치는 유전자 발현 증가 인과성 점수로부터 유전자 발현 증가 클래스 또는 유전자 발현 비증가 클래스에 해당하는 출력을 생 성하는 결정 임계치를 갖는 이진 분류기를 통한 기준 진리 분기점에 대한 추론된 분기점의 비교를 위해 생성된다. 시스템은 유전자 변경 클래스에서 동일한 수의 변이체를 분류하기 위해 제1, 제2, 및 제3 추론된 분기점 을 필요하도록 구성되어 있으므로, 제1, 제2, 및 제3 성능 측정치를 서로 비교할 수 있게 한다. 시스템 은 제1, 제2, 및 제3 성능 측정치의 비교에 기초하여 검증 데이터에 대한 결정 임계치를 갖는 제1 이진 분류기, 제2 이진 분류기, 및 제3 이진 분류기의 각각의 성능을 비교하도록 추가로 구성된다. 결정 임계치를 갖는 제1 이진 분류기, 제2 이진 분류기, 및 제3 이진 분류기에 대한 결정 임계치는 동일할 수 있다. 결정 임계치를 갖는 제1 이진 분류기, 제2 이진 분류기, 및 제3 이진 분류기에 대한 결정 임계치는 상이할 수 있다. 시스템은 결정 임계치를 갖는 제1 이진 분류기, 제2 이진 분류기, 및 제3 이진 분류기(306 6)로부터의 기준 진리 분기점 및 추론된 분기점을 포함하는 원핫 인코딩된 벡터를 처리하는 다중 클래스 분류기 로부터 유전자 발현 보존 클래스, 유전자 발현 감소 클래스, 및 유전자 발현 증가 클래스 로의 변이체 세트의 기준 진리 분기점 및 추론된 분기점을 생성하도록 추가로 구성된다. 도 31은, 추론된 인과성 점수에 대한 기준 진리 인과성 점수의 비교를 위해 유전자 발현 분류기 훈련 이 사용되는, 개시된 기술의 일 구현의 흐름도이다. 기준 진리 인과성 점수 세트가 변이체 훈련 데이터세트에 대해 생성된다. 결정 임계치를 갖는 이진 분류기는 변이체 훈련 데이터세트를 처리하여 추론된 제1 클래스 및 추론된 제2 클래스로 분류된 추론된 인과성 점수를 생성한다. 유 전자 발현 분류기 훈련 프로토콜은 다수의 반복을 위한 이진 분류기의 가중치에 대해 역전파를 수 행하여 손실 함수를 최적화한다. 컴퓨터 시스템 도 32은 개시된 기술을 구현하는 데 사용될 수 있는 예시적인 컴퓨터 시스템을 도시한다. 컴퓨터 시스템 은 버스 하위 시스템을 통해 다수의 주변 디바이스와 통신하는 적어도 하나의 중앙 처리 장치 (CPU)를 포함한다. 이러한 주변 디바이스는, 예를 들어, 메모리 디바이스 및 파일 저장 하위 시스템 을 포함하는 저장 하위 시스템, 사용자 인터페이스 입력 디바이스, 사용자 인터페이스 출력 디바이스, 및 네트워크 인터페이스 하위 시스템을 포함할 수 있다. 입력 및 출력 디바이스는 컴퓨 터 시스템과의 사용자 상호작용을 하게 한다. 네트워크 인터페이스 하위 시스템은 다른 컴퓨터 시 스템에서의 상응하는 인터페이스 디바이스에 대한 인터페이스를 포함하는 인터페이스를 외부 네트워크에 제공한 다. 일 구현에서, 생물학적 양 모델은 저장 하위 시스템 및 사용자 인터페이스 입력 디바이스에 통신 가능하게 링크된다. 사용자 인터페이스 입력 디바이스는 키보드; 마우스, 트랙볼, 터치패드, 또는 그래픽 태블릿과 같은 포인 팅 디바이스; 스캐너; 디스플레이 내에 통합된 터치 스크린; 음성 인식 시스템 및 마이크로폰과 같은 오디오 입 력 디바이스; 및 다른 유형의 입력 디바이스를 포함할 수 있다. 일반적으로, 용어 \"입력 디바이스\"의 사용은 정보를 컴퓨터 시스템에 입력하기 위한 모든 가능한 유형의 디바이스 및 방식을 포함하도록 의도된다. 사용자 인터페이스 출력 장치는 디스플레이 하위 시스템, 프린터, 팩스기, 또는 오디오 출력 장치와 같은 비시각적 디스플레이를 포함할 수 있다. 디스플레이 하위 시스템은 LED 디스플레이, 음극선관(CRT), 액정 디스 플레이(LCD)와 같은 평면 디바이스, 프로젝션 장치, 또는 가시적인 이미지를 생성하기 위한 일부 다른 메커니즘 을 포함할 수 있다. 디스플레이 하위 시스템은 또한, 오디오 출력 디바이스와 같은 비시각적 디스플레이를 제 공할 수 있다. 일반적으로, \"출력 디바이스\"라는 용어의 사용은 정보를 컴퓨터 시스템으로부터 사용자에 게 또는 다른 기계 또는 컴퓨터 시스템에 출력하기 위한 모든 가능한 유형의 디바이스 및 방식을 포함하도록 의 도된다. 저장 하위 시스템은 본원에 설명된 모듈 및 방법의 일부 또는 전부의 기능을 제공하는 프로그래밍 및 데 이터 구성을 저장한다. 이러한 소프트웨어 모듈은 일반적으로, 프로세서에 의해 실행된다. 프로세서는 그래픽 처리 장치(GPU), 필드 프로그래밍가능 게이트 어레이(FPGA), 주문형 반도체(ASIC), 및 /또는 코어스-그레인드 재구성가능 아키텍처(CGRA)일 수 있다. 프로세서는 Google Cloud Platform™, Xilinx™, 및 Cirrascale™과 같은 심층 학습 클라우드 플랫폼에 의해 호스팅될 수 있다. 프로세서의 예 는 Google의 Tensor Processing Unit(TPU)™, 랙마운트 솔루션, 예컨대 GX4 Rackmount Series™, GX32 Rackmount Series™, NVIDIA DGX-1™, Microsoft의 Stratix V FPGA™, Graphcore의 Intelligent Processor Unit (IPU)™, Snapdragon processors™을 갖는 Qualcomm의 Zeroth Platform™, NVIDIA의 Volta™, NVIDIA의 DRIVE PX™, NVIDIA의 JETSON TX1/TX2 MODULE™, Intel의 Nirvana™, Movidius VPU™, Fujitsu DPI™, ARM의 DynamicIQ™, IBM TrueNorth™, Testa V100s™을 갖는 Lambda GPU 서버 등을 포함한다. 저장 하위 시스템에 사용되는 메모리 하위 시스템은 프로그램 실행 동안 명령어 및 데이터의 저장 을 위한 메인 랜덤 액세스 메모리(RAM) 및 고정된 명령어가 저장되는 판독 전용 메모리(ROM)를 포 함하는 다수의 메모리를 포함할 수 있다. 파일 저장 하위 시스템은 프로그램 및 데이터 파일을 위한 영 구 저장소를 제공할 수 있고, 하드 디스크 드라이브, 연관된 착탈식 매체와 함께 플로피 디스크 드라이브, CD- ROM 드라이브, 광학 드라이브, 또는 착탈식 매체 카트리지를 포함할 수 있다. 특정 구현의 기능을 구현하는 모 듈은 저장 하위 시스템 내의 파일 저장 하위 시스템에 의해, 또는 프로세서에 의해 접근 가능한 다 른 기계에 저장될 수 있다. 버스 하위 시스템은 컴퓨터 시스템의 다양한 구성요소 및 하위 시스템이 의도된 대로 서로 통신하 게 하기 위한 메커니즘을 제공한다. 버스 하위 시스템이 개략적으로 단일 버스로서 도시되어 있지만, 버 스 하위 시스템의 대체 구현은 다수의 버스를 사용할 수 있다. 컴퓨터 시스템 자체는 개인용 컴퓨터, 휴대용 컴퓨터, 워크스테이션, 컴퓨터 단말기, 네트워크 컴퓨터, 텔레비전, 메인프레임, 서버 팜, 광범위하게 분산된 느슨하게 네트워킹된 컴퓨터 세트, 또는 기타 데이터 처리 시스템이나 사용자 장치를 포함하는 다양한 유형일 수 있다. 컴퓨터 및 네트워크의 지속적으로 변화하는(ever- changing) 특성으로 인해, 도 32에 도시된 컴퓨터 시스템의 설명은 본 발명의 바람직한 구현을 예시하기 위한 특정 예로서만 의도된다. 도 32에 도시된 컴퓨터 시스템보다 더 많은 또는 더 적은 구성 요소를 갖는 컴 퓨터 시스템의 많은 다른 구성이 가능하다.조항 개시된 기술은 시스템, 방법 또는 제조 물품으로서 실시될 수 있다. 구현의 하나 이상의 특징은 기본 구현과 조합될 수 있다. 상호 배타적이지 않은 구현은 조합 가능한 것으로 교시되어 있다. 구현의 하나 이상의 특징 은 다른 구현과 조합될 수 있다. 본 발명은 이러한 옵션을 사용자에게 주기적으로 리마인드한다. 이러한 옵션 을 반복하는 인용의 일부 구현으로부터의 생략은 전술한 섹션에 교시된 조합을 제한하는 것으로서 간주되어서는 안 된다 - 이들 인용은 이로써 다음의 구현 각각에 참조로 통합된다. 개시된 기술의 하나 이상의 구현 및 조항 또는 이들의 요소는, 나타낸 방법 단계를 수행하기 위한 컴퓨터 사용 가능 프로그램 코드를 갖는 비일시적 컴퓨터 판독 가능 저장 매체를 포함하는 컴퓨터 제품의 형태로 구현될 수 있다. 더욱이, 개시된 기술의 하나 이상의 구현 및 조항 또는 이들의 요소는, 메모리, 및 메모리에 커플링되고 예시적인 방법 단계를 수행하기 위해 연산하는 적어도 하나의 프로세서를 포함하는 장치의 형태로 구현될 수 있 다. 또한, 추가로, 다른 양태에서, 개시된 기술의 하나 이상의 구현 및 조항 또는 이들의 요소는, 본원에 기술 된 방법 단계 중 하나 이상을 수행하기 위한 수단의 형태로 구현될 수 있고; 수단은 (i) 하드웨어 모듈(들), (ii) 하나 이상의 하드웨어 프로세서 상에서 실행되는 소프트웨어 모듈(들), 또는 (iii) 하드웨어와 소프트웨어 모듈의 조합을 포함할 수 있고; (i) 내지 (iii) 중 임의의 것은 본원에 제시된 특정 기법을 구현하고, 소프트웨 어 모듈은 컴퓨터 판독가능 저장 매체(또는 다수의 그러한 매체)에 저장된다. 이 섹션에 기술된 조항은 특징으로 조합될 수 있다. 간결함을 위해 특징의 조합은 개별적으로 열거되지 않으며 각 기본 특징 세트에서 반복되지 않는다. 독자는 이 섹션에 기술된 조항에서 식별된 특징이 이 출원의 다른 섹 션에서 구현으로 식별된 기본 특징 세트와 어떻게 쉽게 조합될 수 있는지 이해할 것이다. 이러한 조항은 상호 배타적이거나 포괄적이거나 제한적이라는 의미가 아니며; 개시된 기술은 이러한 조항에 제한되지 않으며 오히려 청구된 기술 및 그 등가물의 범위 내에서 가능한 모든 조합, 수정 및 변형을 포함한다. 이 섹션에 설명된 조항의 다른 구현은 이 섹션에 설명된 조항 중 임의의 조항을 수행하기 위해 프로세서에 의해 실행 가능한 명령어를 저장하는 비일시적 컴퓨터 판독 가능 저장 매체를 포함할 수 있다. 이 섹션에 기술된 조 항의 또 다른 구현은 메모리 및 이 섹션에 기술된 조항 중 임의의 항목을 수행하기 위해 메모리에 저장된 명령 어를 실행하도록 연산 가능한 하나 이상의 프로세서를 포함하는 시스템을 포함할 수 있다. 다음의 조항이 개시된다: 조항 세트 1 1. 염기 해상도에서 유전자 발현의 변화를 검출하는 인공 지능 기반 시스템으로서, 시퀀스 데이터베이스에 액세스하고 입력 염기 시퀀스를 생성하는 입력 생성 로직으로서, 상기 입력 염기 시퀀스 는 타깃 염기 시퀀스를 포함하고, 상기 타깃 염기 시퀀스는 하류 컨텍스트 염기를 갖는 우측 염기 시퀀스 및 상 류 컨텍스트 염기를 갖는 좌측 염기 시퀀스에 의해 플랭킹되는, 상기 입력 생성 로직; 상기 입력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하는 생물학적 양 모델; 및 상기 입력 염기 시퀀스의 대체 표현을 처리하고 복수의 생물학적 양 출력 시퀀스를 생성하는 생물학적 양 출력 생성 로직을 포함하되, 상기 복수의 생물학적 양 출력 시퀀스에서 제1 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 각각의 타깃 염기에 대한 제1 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제1 각각의 염기 당 생물학적 양 출력은 복수의 종에 걸쳐 상기 각각의 타깃 염기의 각각의 진화 보존 측 정치를 특정하고, 상기 복수의 생물학적 양 출력 시퀀스에서 제2 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 각각의 타깃 염기에 대한 제2 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제2 각각의 염기 당 생물학적 양 출력은 상기 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 타깃 염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템. 2. 제1항에 있어서, 상기 각각의 진화 보존 측정치는 신경 치환의 널 모델로부터의 편차를 특정하여 보존으로서 상기 타깃 염기 시퀀스에서의 주어진 위치에서 주어진 타깃 염기의 치환율의 감소를 검출하고, 가속으로서 상기 주어진 위치에서 상기 주어진 타깃 염기의 치환율의 증가를 검출하는 계통 P-값(phyloP) 점수인, 인공 지능 기반 시스템. 3. 제2항에 있어서, 상기 각각의 진화 보존 측정치는 보존된 상태 또는 비보존된 상태를 갖는 주어진 위치에서 주어진 목표 염기의 사후 확률을 특정하는 phastCons 점수인, 인공 지능 기반 시스템. 4. 제2항에 있어서, 상기 각각의 진화 보존 측정치는 상기 복수의 종에 걸쳐 상기 주어진 위치에서 상기 주어진 타깃 염기의 치환의 수 감소를 특정하는 게놈 진화 속도 프로파일링(GERP) 점수인, 인공 지능 기반 시스템. 5. 제1항에 있어서, 상기 각각의 전사 개시 측정치는 상기 주어진 위치에서 상기 주어진 타깃 염기의 전사 개시 빈도를 특정하는 유전자 발현(CAGE) 점수의 캡 분석인, 인공 지능 기반 시스템. 6. 제1항에 있어서, 상기 복수의 생물학적 양 출력 시퀀스에서의 제3 생물학적 양 출력 시퀀스는 상기 타깃 염 기 시퀀스에서의 상기 각각의 타깃 염기에 대한 제3 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제3 각각의 염기 당 생물학적 양 출력은 상기 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 타깃 염기의 각각의 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템. 7. 제6항에 있어서, 상기 후생적 신호 수준은 DNase I-과민성 부위(DHS) 또는 시퀀싱을 이용한 트랜스포사제 접 근가능 염색질에 대한 분석(ATAC-Seq)을 특정하는, 인공 지능 기반 시스템. 8. 제6항에 있어서, 상기 후생적 신호 수준은 전사 인자(TF) 결합을 특정하는, 인공 지능 기반 시스템. 9. 제6항에 있어서, 후생적 신호 수준은 히스톤 수정(HM) 마크를 특정하는, 인공 지능 기반 시스템. 10. 제1항에 있어서, 추가로: 상기 복수의 생물학적 양 출력 시퀀스를 처리하고 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 생성하 는 유전자 발현 모델; 및 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 처리하고, 상기 타깃 염기 시퀀스에서의 상기 각각의 타깃 염기에 대한 각각의 염기 당 유전자 발현 출력의 유전자 발현 출력 시퀀스를 생성하는 유전자 발현 출력 생성 로직을 포함하도록 구성되되; 상기 주어진 위치에서 상기 주어진 타깃 염기에 대한 상기 유전자 발현 출력 시퀀스에서 주어진 염기 당 유전자 발현 출력은 상기 주어진 위치에서 상기 주어진 타깃 염기의 유전자 발현 수준의 척도를 특정하는, 인공 지능 기반 시스템. 11. 제10항에 있어서, 상기 유전자 발현 수준은 CAGE 전사 시작 부위(CTSS)와 같은 염기 당 메트릭으로 측정되 는, 인공 지능 기반 시스템. 12. 제10항에 있어서, 상기 유전자 발현 수준은 TPM(transcripts per million) 또는 RPKM(reads per kilobase of transcript)과 같은 유전자 당 메트릭으로 측정되는, 인공 지능 기반 시스템. 13. 제10항에 있어서, 상기 유전자 발현 수준은 FPKM(fragments per kilobase million)과 같은 유전자 당 메트 릭으로 측정되는, 인공 지능 기반 시스템. 14. 제1항에 있어서, 변이체 분류 로직을 포함하도록 추가로 구성되는, 인공 지능 기반 시스템. 15. 제14항에 있어서, 상기 변이체 분류 로직은 상기 시퀀스 데이터베이스에 액세스하고 기준 염기 시퀀스를 생 성하는 기준 입력 생성 로직을 포함하도록 추가로 구성되고, 상기 기준 염기 시퀀스는 기준 타깃 염기 시퀀스를 포함하고, 상기 기준 타깃 염기 시퀀스는 분석 중인 위치에서의 기준 염기를 포함하고, 상기 기준 염기는 하류 컨텍스트 염기를 갖는 우측 염기 시퀀스 및 상류 컨텍스트 염기를 갖는 좌측 염기 시퀀스에 의해 플랭킹되는, 인공 지능 기반 시스템. 16. 제15항에 있어서, 상기 변이체 분류 로직은 상기 시퀀스 데이터베이스에 액세스하고 대체 염기 시퀀스를 생 성하는 대체 입력 생성 로직을 포함하도록 추가로 구성되고, 상기 대체 염기 시퀀스는 대체 타깃 염기 시퀀스를 포함하고, 상기 대체 타깃 염기 시퀀스는 상기 분석 중 위치에서 대체 염기를 포함하고, 상기 대체 염기는 상기 하류 컨텍스트 염기를 갖는 상기 우측 염기 시퀀스 및 상기 상류 컨텍스트 염기를 갖는 상기 좌측 염기 시퀀스 에 의해 플랭킹되는, 인공 지능 기반 시스템. 17. 제15항에 있어서, 상기 변이체 분류 로직은, 상기 생물학적 양 모델이 상기 기준 염기 시퀀스를 처리하고 상기 기준 염기 시퀀스의 대체 표현을 생성하게 하고, 추가로 상기 생물학적 양 출력 생성 로직이 상기 기준 염기 시퀀스의 대체 표현을 처리하고 복수의 기준 생물학적 양 출력 시퀀스를 생성하게 하는 기준 처리 로직을 포 함하도록 추가로 구성되고, 상기 복수의 기준 생물학적 양 출력 시퀀스에서 각각의 기준 생물학적 양 출력 시퀀스는 상기 기준 타깃 염기 시퀀스에서의 각각의 기준 타깃 염기에 대한 각각의 염기 당 기준 생물학적 양 출력을 포함하는, 인공 지능 기 반 시스템. 18. 제17항에 있어서, 상기 복수의 기준 생물학적 양 출력 시퀀스에서의 제1 기준 생물학적 양 출력 시퀀스는 상기 기준 타깃 염기 시퀀스에서의 각각의 기준 타깃 염기에 대한 제1 각각의 염기 당 기준 생물학적 양 출력을 포함하고, 상기 제1 각각의 염기 당 기준 생물학적 양 출력은 상기 복수의 종에 걸쳐 상기 각각의 기준 타깃 염기의 각각 의 진화 보존 측정치를 특정하는, 인공 지능 기반 시스템. 19. 제17항에 있어서, 상기 복수의 기준 생물학적 양 출력 시퀀스에서의 제2 기준 생물학적 양 출력 시퀀스는 상기 기준 타깃 염기 시퀀스에서의 상기 각각의 기준 타깃 염기에 대한 제2 각각의 염기 당 기준 생물학적 양 출력을 포함하고, 상기 제2 각각의 염기 당 기준 생물학적 양 출력은 상기 기준 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각 각의 기준 타깃 염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템. 20. 제16항에 있어서, 상기 변이체 분류 로직은, 상기 생물학적 양 모델이 상기 대체 염기 시퀀스를 처리하고 상기 대체 염기 시퀀스의 대체 표현을 생성하게 하고, 추가로 상기 생물학적 양 출력 생성 로직이 상기 대체 염 기 시퀀스의 대체 표현을 처리하고 복수의 대체 생물학적 양 출력 시퀀스를 생성하게 하는 대체 처리 로직을 포 함하도록 추가로 구성되고, 상기 복수의 대체 생물학적 양 출력 시퀀스에서 각각의 대체 생물학적 양 출력 시퀀스는 상기 대체 타깃 염기 시퀀스에서의 각각의 대체 타깃 염기에 대한 각각의 염기 당 대체 생물학적 양 출력을 포함하는, 인공 지능 기 반 시스템. 21. 제20항에 있어서, 상기 복수의 대체 생물학적 양 출력 시퀀스에서의 제1 대체 생물학적 양 출력 시퀀스는 상기 대체 타깃 염기 시퀀스에서의 각각의 대체 타깃 염기에 대한 제1 각각의 염기 당 대체 생물학적 양 출력을 포함하고, 상기 제1 각각의 염기 당 대체 생물학적 양 출력은 상기 복수의 종에 걸쳐 상기 각각의 대체 타깃 염기의 각각 의 진화 보존 측정치를 특정하는, 인공 지능 기반 시스템. 22. 제20항에 있어서, 상기 복수의 대체 생물학적 양 출력 시퀀스에서의 제2 대체 생물학적 양 출력 시퀀스는 상기 대체 타깃 염기 시퀀스에서의 상기 각각의 대체 타깃 염기에 대한 제2 각각의 염기 당 대체 생물학적 양 출력을 포함하고, 상기 제2 각각의 염기 당 대체 생물학적 양 출력은 상기 대체 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각 각의 대체 타깃 염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템. 23. 제20항에 있어서, 상기 변이체 분류 로직은 상기 제1 기준 생물학적 양 출력 시퀀스 및 상기 제1 대체 생물 학적 양 출력 시퀀스를 위치별로 비교하고, 상기 제1 기준 생물학적 양 출력 시퀀스 및 상기 제1 대체 생물학적 양 출력 시퀀스에서의 위치에 대한 제1 위치별 시퀀스 차이를 갖는 제1 델타 시퀀스를 생성하는 병원성 예측 로 직을 포함하도록 추가로 구성되는, 인공 지능 기반 시스템. 24. 제23항에 있어서, 상기 병원성 예측 로직은 상기 제2 기준 생물학적 양 출력 시퀀스 및 상기 제2 대체 생물 학적 양 출력 시퀀스를 위치별로 비교하고, 상기 제2 기준 생물학적 양 출력 시퀀스 및 상기 제2 대체 생물학적 양 출력 시퀀스에서의 위치에 대한 제2 위치별 시퀀스 차이를 갖는 제2 델타 시퀀스를 생성하도록 추가로 구성 되는, 인공 지능 기반 시스템. 25. 제24항에 있어서, 상기 병원성 예측 로직은 상기 제1 델타 시퀀스 및 상기 제2 델타 시퀀스에 의존하여 상 기 대체 염기에 대한 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 26. 제24항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 시퀀스 차이를 제1 누적 시퀀스 값으로 누적하 고, 상기 제2 위치별 시퀀스 차이를 제2 누적 시퀀스 값으로 누적하도록 추가로 구성되는, 인공 지능 기반 시스템. 27. 제26항에 있어서, 상기 제1 누적 시퀀스 값은 상기 제1 위치별 시퀀스 차이의 평균이고, 상기 제2 누적 시 퀀스 값은 상기 제2 위치별 시퀀스 차이의 평균인, 인공 지능 기반 시스템. 28.제26항에 있어서, 상기 제1 누적 시퀀스 값은 상기 제1 위치별 시퀀스 차이의 합이고, 상기 제2 누적 시퀀스 값은 상기 제2 위치별 시퀀스 차이의 합인, 인공 지능 기반 시스템. 29. 제26항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 시퀀스 값 및 상기 제2 누적 시퀀스 값에 의존하 여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 30. 제29항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 시퀀스 값 및 상기 제2 누적 시퀀스 값의 평균에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 31. 제29항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 시퀀스 값 및 상기 제2 누적 시퀀스 값의 합에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 32. 제23항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 시퀀스 차이에 기초하여 상기 제1 델타 시퀀스 에서의 위치를 보존된 상태 또는 비보존된 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능 기반 시스템. 33. 제32항에 있어서, 상기 병원성 예측 로직은 상기 제2 델타 시퀀스에서의 해당 위치를 상기 보존 상태에 속 하는 것으로 분류된 상기 제1 델타 시퀀스에서의 해당 위치와 일치하는 신호 상태에 속하는 것으로 분류하고, 상기 제2 델타 시퀀스에서의 해당 위치를 상기 비보존 상태에 속하는 것으로 분류된 상기 제1 델타 시퀀스에서 의 해당 위치와 일치하는 노이즈 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능 기반 시스템. 34. 제33항에 있어서, 상기 병원성 예측 로직은 상기 제2 위치별 시퀀스 차이의 하위 세트를 변조된 누적 시퀀 스 값으로 누적하도록 추가로 구성되고, 상기 제2 위치별 시퀀스 차이의 하위 세트에서의 제2 위치별 시퀀스 차이는 상기 신호 상태에 속하는 것으로 분 류되는 상기 제2 델타 시퀀스에서의 해당 위치에 위치하는, 인공 지능 기반 시스템. 35. 제34항에 있어서, 상기 병원성 예측 로직은 상기 변조된 누적 시퀀스 값에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 36. 제34항에 있어서, 상기 변조된 누적 시퀀스 값은 상기 제2 위치별 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 시퀀스 차이의 평균인, 인공 지능 기반 시스템. 37. 제34항에 있어서, 상기 변조된 누적 시퀀스 값은 상기 제2 위치별 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 시퀀스 차이의 합인, 인공 지능 기반 시스템. 38. 제24항에 있어서, 상기 병원성 예측 로직은 상기 제1 기준 생물학적 양 출력 시퀀스 및 상기 제1 대체 생물 학적 양 출력 시퀀스의 각각의 부분을 위치별로 비교하고, 상기 각각의 부분에서의 위치에 대해 제1 위치별 하 위 시퀀스 차이를 갖는 제1 델타 하위 시퀀스를 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 39. 제38항에 있어서, 상기 병원성 예측 로직은 상기 제2 기준 생물학적 양 출력 시퀀스 및 상기 제2 대체 생물 학적 양 출력 시퀀스의 각각의 부분을 위치별로 비교하고, 상기 각각의 부분에서의 위치에 대해 제2 위치별 하 위 시퀀스 차이를 갖는 제2 델타 하위 시퀀스를 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 40. 제39항에 있어서, 상기 각각의 부분은 상기 분석 중 위치 주위의 우측 및 좌측 플랭킹 위치에 걸쳐 있는, 인공 지능 기반 시스템. 41. 제40항에 있어서, 상기 병원성 예측 로직은 상기 제1 델타 하위 시퀀스 및 상기 제2 델타 하위 시퀀스에 의 존하여 상기 대체 염기에 대한 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 42. 제40항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 하위 시퀀스 차이를 제1 누적된 하위 시퀀스 값으로 누적하고, 상기 제2 위치별 하위 시퀀스 차이를 제2 누적된 하위 시퀀스 값으로 누적하도록 추가로 구성 되는, 인공 지능 기반 시스템. 43. 제42항에 있어서, 상기 제1 누적 하위 시퀀스 값은 상기 제1 위치별 하위 시퀀스 차이의 평균이고, 상기 제 2 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 평균인, 인공 지능 기반 시스템.44. 제42항에 있어서, 상기 제1 누적 하위 시퀀스 값은 상기 제1 위치별 하위 시퀀스 차이의 합이고, 상기 제2 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 합인, 인공 지능 기반 시스템. 45.제42항에 있어서, 상기 병원성 예측 로직은 상기 제1 축적된 하위 시퀀스 값 및 상기 제2 축적된 하위 시퀀 스 값에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시 스템. 46.제45항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 하위 시퀀스 값 및 상기 제2 누적 하위 시퀀스 값 의 평균에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 47.제45항에 있어서, 상기 병원성 예측 로직은 상기 제1 누적 하위 시퀀스 값 및 상기 제2 누적 하위 시퀀스 값 의 합에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시 스템. 48.제38항에 있어서, 상기 병원성 예측 로직은 상기 제1 위치별 하위 시퀀스 차이에 기초하여 상기 제1 델타 하 위 시퀀스에서의 위치를 보존된 상태 또는 비보존된 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능 기반 시스템. 49.제48항에 있어서, 상기 병원성 예측 로직은 상기 제2 델타 하위 시퀀스에서의 해당 위치를 상기 보존 상태에 속하는 것으로 분류된 상기 제1 델타 하위 시퀀스에서의 해당 위치와 일치하는 신호 상태에 속하는 것으로 분류 하고, 상기 제2 델타 하위 시퀀스에서의 해당 위치를 상기 비보존 상태에 속하는 것으로 분류된 상기 제1 델타 하위 시퀀스에서의 해당 위치와 일치하는 노이즈 상태에 속하는 것으로 분류하도록 추가로 구성되는, 인공 지능 기반 시스템. 50.제49항에 있어서, 상기 병원성 예측 로직은 상기 제2 위치별 하위 시퀀스 차이의 하위 세트를 변조된 누적 하위 시퀀스 값으로 누적하도록 추가로 구성되고, 상기 제2 위치별 하위 시퀀스 차이의 하위 세트에서의 제2 위치별 하위 시퀀스 차이는 상기 신호 상태에 속하는 것으로 분류되는 상기 제2 델타 하위 시퀀스에서의 해당 위치에 위치하는, 인공 지능 기반 시스템. 51. 제50항에 있어서, 상기 병원성 예측 로직은 상기 변조된 누적 하위 시퀀스 값에 의존하여 상기 대체 염기에 대한 상기 병원성 예측을 생성하도록 추가로 구성되는, 인공 지능 기반 시스템. 52.제50항에 있어서, 상기 변조된 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 하위 시퀀스 차이의 평균인, 인공 지능 기반 시스템. 53.제50항에 있어서, 상기 변조된 누적 하위 시퀀스 값은 상기 제2 위치별 하위 시퀀스 차이의 하위 세트에서의 상기 제2 위치별 하위 시퀀스 차이의 합인, 인공 지능 기반 시스템. 54.제1항에 있어서, 상기 타깃 염기 시퀀스는 유전자의 코딩 영역인, 인공 지능 기반 시스템. 55.제1항에 있어서, 상기 타깃 염기 시퀀스는 유전자의 비-코딩 영역인, 인공 지능 기반 시스템. 56.제55항에 있어서, 상기 비-코딩 영역은 전사 시작 부위, 5개의 프라임 비변환 영역(UTR), 3개의 프라임 UTR, 인핸서 및 프로모터에 걸쳐 있는, 인공 지능 기반 시스템. 56.제16항에 있어서, 상기 대체 염기는 이상치 개체의 코호트 중 하나의 이상치 개체에서만 발생하는 단일 변이 체이고, 이상치 개체의 코호트에서 이상치 개체는 극한 수준의 유전자 발현을 나타내는, 인공 지능 기반 시스템. 57. 제56항에 있어서, 극한 수준의 유전자 발현은 정규화된 유전자 발현 수준의 꼬리 사분위로부터 결정되는, 인공 지능 기반 시스템. 58.제57항에 있어서, 극한 수준의 유전자 발현은 과다 유전자 발현 및 과소 유전자 발현을 포함하는, 인공 지능 기반 시스템. 59.제56항에 있어서, 상기 단일 변이체는 코딩 변이체인, 인공 지능 기반 시스템. 60.제56항에 있어서, 상기 단일 변이체는 비-코딩 변이체인, 인공 지능 기반 시스템. 61. 제60항에 있어서, 상기 비-코딩 변이체는 프로모터 변이체인, 인공 지능 기반 시스템. 62. 제60항에 있어서, 상기 비-코딩 변이체는 인핸서 변이체인, 인공 지능 기반 시스템. 62.제1항에 있어서, 상기 생물학적 양 모델은 제1 가중치 세트를 갖고, 상기 생물학적 양 출력 생성 로직은 제2 가중치 세트를 갖는, 인공 지능 기반 시스템. 63.제62항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 처음부터 훈련시켜 상기 입력 염 기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하고, 상기 생물학적 양 출력 생성 로직의 제2 가중치 세트를 상기 생물학적 양 모델의 제1 가중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 입력 염기 시퀀스의 대체 표현을 처리하고 상기 복수의 생물학적 양 출력 시 퀀스를 생성하는, 인공 지능 기반 시스템. 64.제63항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 훈련된 제1 가중치 세트를 사용하고, 상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 훈련된 제2 가중치 세트를 사용하는, 인공 지능 기반 시스템. 65.제1항에 있어서, 상기 유전자 발현 모델은 제3 가중치 세트를 갖고, 상기 유전자 발현 출력 생성 로직은 제4 가중치 세트를 갖는, 인공 지능 기반 시스템. 66.제65항에 있어서, 상기 유전자 발현 모델의 제3 가중치 세트를 처음부터 훈련시켜 상기 복수의 생물학적 양 출력 시퀀스를 처리하고 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 생성하고, 상기 유전자 발현 출력 생성 로직의 제4 가중치 세트를 상기 유전자 발현 모델의 제3 가중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 처리하고 상기 유전자 발현 출력 시퀀스를 생성하는, 인공 지능 기반 시스템. 67.제66항에 있어서, 추론 동안, 상기 유전자 발현 모델은 상기 훈련된 제3 가중치 세트를 사용하고, 상기 추론 동안, 상기 유전자 발현 출력 생성 로직은 상기 훈련된 제4 가중치 세트를 사용하는, 인공 지능 기반 시스템. 68.제65항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 먼저 처음부터 훈련시켜 상기 입 력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성한 다음, 상기 유전자 발현 모델의 제3 가중치 세트의 치환으로 재훈련시켜 상기 복수의 생물학적 양 출력 시퀀스를 처리하고 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 생성하고, 상기 유전자 발현 출력 생성 로직의 제4 가중치 세트를 상기 유전자 발현 모델에서 치환된 상기 훈련된 제1 가 중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 유전자 발현 모델에서 치환된 상기 훈련된 제1 가중치 세트에 의해 생성된 상기 복수의 생물학적 양 출력 시퀀스의 대체 표현을 처리하고 상기 유전자 발현 출력 시퀀 스를 생성하는, 인공 지능 기반 시스템. 69.제68항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 재훈련된 제1 가중치 세트를 사용하고, 상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 훈련된 제2 가중치 세트를 사용하고, 추론 동안, 상기 유전자 발현 모델은 상기 재훈련된 제1 가중치 세트를 사용하고, 상기 추론 동안, 상기 유전자 발현 출력 생성 로직은 상기 훈련된 제4 가중치 세트를 사용하는, 인공 지능 기반 시스템. 70.제17항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 먼저 처음부터 훈련시켜 상기 입 력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하고, 상기 훈련 동안, 상기 생물학적 양 출력 생성 로직의 제2 가중치 세트를 먼저 상기 생물학적 양 모델의 제1 가 중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 입력 염기 시퀀스의 대체 표현을 처리하고 상기 복수 의 생물학적 양 출력 시퀀스를 생성하고, 상기 훈련 동안, 그 다음, 상기 생물학적 양 모델의 훈련된 제1 가중치 세트를 재훈련시켜 상기 기준 염기 시퀀 스를 처리하고 상기 기준 염기 시퀀스의 대체 표현을 생성하고, 상기 대체 염기 시퀀스를 처리하고 상기 대체 염기 시퀀스의 대체 표현을 생성하고, 상기 훈련 동안, 그 다음, 상기 생물학적 양 출력 생성 로직의 훈련된 제2 가중치 세트를 상기 생물학적 양 모 델의 훈련된 제1 가중치 세트로 종단 간으로 재훈련시켜 상기 기준 염기 시퀀스의 대체 표현을 처리하고 상기 복수의 기준 생물학적 양 출력 시퀀스를 생성하고, 상기 대체 염기 시퀀스의 대체 표현을 처리하고 상기 복수의 대체 생물학적 양 출력 시퀀스를 생성하는, 인공 지능 기반 시스템. 71.제70항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 재훈련된 제1 가중치 세트를 사용하고, 상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 재훈련된 제2 가중치 세트를 사용하는, 인공 지능 기 반 시스템. 72.제23항에 있어서, 상기 병원성 예측 로직은 제5 가중치 세트를 갖는, 인공 지능 기반 시스템. 73.제72항에 있어서, 훈련 동안, 상기 생물학적 양 모델의 제1 가중치 세트를 먼저 처음부터 훈련시켜 상기 입 력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하고, 상기 훈련 동안, 상기 생물학적 양 출력 생성 로직의 제2 가중치 세트를 먼저 상기 생물학적 양 모델의 제1 가 중치 세트로 처음부터 그리고 종단 간으로 훈련시켜 상기 입력 염기 시퀀스의 대체 표현을 처리하고 상기 복수 의 생물학적 양 출력 시퀀스를 생성하고, 상기 훈련 동안, 그 다음, 상기 생물학적 양 모델의 훈련된 제1 가중치 세트 및 상기 생물학적 양 출력 생성 로 직의 훈련된 제2 가중치 세트를 종단 간으로 재훈련시켜 대체 염기에 대한 병원성 예측을 생성하는, 인공 지능 기반 시스템. 74.제73항에 있어서, 추론 동안, 상기 생물학적 양 모델은 상기 재훈련된 제1 가중치 세트를 사용하고, 상기 추론 동안, 상기 생물학적 양 출력 생성 로직은 상기 재훈련된 제2 가중치 세트를 사용하고, 상기 추론 동안, 상기 병원성 예측 로직은 상기 훈련된 제5 가중치 세트를 사용하는, 인공 지능 기반 시스템. 75.제18항에 있어서, 상기 제1 각각의 염기 당 기준 생물학적 양 출력은 상기 기준 타깃 염기 시퀀스에서의 상 기 각각의 위치에서 상기 각각의 기준 타깃 염기의 각각의 제1 기준 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템. 76.제29항에 있어서, 상기 제2 각각의 염기 당 기준 생물학적 양 출력은 상기 기준 타깃 염기 시퀀스에서의 상 기 각각의 위치에서 상기 각각의 기준 타깃 염기의 각각의 제2 기준 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템. 77.제21항에 있어서, 상기 제1 각각의 염기 당 대체 생물학적 양 출력은 상기 대체 타깃 염기 시퀀스에서의 상 기 각각의 위치에서 상기 각각의 대체 타깃 염기의 각각의 제1 대체 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템. 78.제22항에 있어서, 상기 제2 각각의 염기 당 대체 생물학적 양 출력은 상기 대체 타깃 염기 시퀀스에서의 상 기 각각의 위치에서 상기 각각의 대체 타깃 염기의 각각의 제2 대체 후생적 신호 수준 측정치를 특정하는, 인공 지능 기반 시스템. 79.제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 진화 보존 염색질 시퀀스로 변환한 다음, 종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 전사 개시 빈도 염색질 시퀀스로 변환하는, 인공 지능 기 반 시스템. 80.제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 후생적 신호 수준 염색질 시퀀스로 변환한 다 음, 종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 진화 보존 염색질 시퀀스로 변환하는, 인공 지 능 기반 시스템. 81.제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 후생적 신호 수준 염색질 시퀀스로 변환한 다 음, 종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 전사 개시 빈도 염색질 시퀀스로 변환하는, 인공 지능 기반 시스템. 82.제1항에 있어서, 훈련 동안, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 처음부터 그리고 종단 간으로 훈련시켜 입력 염기 시퀀스의 분석을 염기별 후생적 신호 수준 염색질 시퀀스로 변환한 다 음, 종단 간으로 재훈련시켜 입력 염기 시퀀스의 분석을 염기별 진화 보존 염색질 시퀀스 및 염기별 전사 개시 빈도 염색질 시퀀스로 변환하는, 인공 지능 기반 시스템. 83.제1항에 있어서, 복수의 후생적 효과에 의해 교란된 변이체를 포함하는 훈련 입력 기본 시퀀스의 제1 훈련 세트를 포함하도록 추가로 구성되는, 인공 지능 기반 시스템. 84.제83항에 있어서, 상기 복수의 후생적 효과에서의 후생적 효과는 염색체 간 효과, 유전자 내 효과, 집단 구 조 및 조상 효과, 발현 잔차의 확률적 추정(PEER) 효과, 환경 효과, 성별 효과, 일괄 효과, 유전자형 플랫폼 효 과, 및/또는 라이브러리 구축 프로토콜 효과를 포함하는, 인공 지능 기반 시스템. 85.제83항에 있어서, 상기 복수의 후생적 효과에 의해 교란되지 않은 변이체를 포함하는 훈련 입력 염기 시퀀스 의 제2 훈련 세트를 포함하도록 추가로 구성되는, 인공 지능 기반 시스템. 86.제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현을 변경하고 극한 수준의 유전자 발 현을 유발하도록 신뢰성 있게 결정되는, 인공 지능 기반 시스템. 87.제86항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 수준을 증가시키는 과다 발현 유발 변이체를 포함하는, 인공 지능 기반 시스템. 88.제86항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 수준을 감소시키는 과소 발현 유발 변이체를 포함하는, 인공 지능 기반 시스템. 89.제87항에 있어서, 상기 제2 훈련 세트는 상기 유발 유전자 과다 발현 가능성을 특정하는 상기 변이체에 대한 과다 발현 확률을 특정하는, 인공 지능 기반 시스템. 90.제88항에 있어서, 상기 제2 훈련 세트는 상기 변이체 유발 유전자 과소 발현 가능성을 특정하는 상기 변이체 에 대한 과소 발현 확률을 특정하는, 인공 지능 기반 시스템. 91. 제86항에 있어서, 상기 제2 훈련 세트에서의 각각의 변이체는 이상치 개체의 코호트 중 단지 하나의 이상치 개체에서 발생하는 단독 변이체이고, 이상치 개체의 코호트에서 이상치 개체는 극한 수준의 유전자 발현을 나타내는, 인공 지능 기반 시스템. 92. 제91항에 있어서, 극한 수준의 유전자 발현은 정규화된 유전자 발현 수준의 꼬리 사분위로부터 결정되는, 인공 지능 기반 시스템. 93.제91항에 있어서, 극한 수준의 유전자 발현은 과다 유전자 발현 및 과소 유전자 발현을 포함하는, 인공 지능 기반 시스템. 94.제91항에 있어서, 상기 단일 변이체는 코딩 변이체인, 인공 지능 기반 시스템. 95.제91항에 있어서, 상기 단일 변이체는 비-코딩 변이체인, 인공 지능 기반 시스템. 96.제95항에 있어서, 상기 비-코딩 변이체는 5개의 프라임 비변환 영역(UTR) 변이체, 3개의 프라임 UTR 변이체, 인핸서 변이체, 또는 프로모터 변이체인, 인공 지능 기반 시스템. 97.제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 복수의 조직 유형에 걸쳐 있는, 인공 지능 기반 시스템. 98.제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 복수의 셀 유형에 걸쳐 있는, 인공 지능 기반 시 스템. 99.제1항에 있어서, 상기 입력 염기 시퀀스 및 상기 복수의 생물학적 양 출력 시퀀스는 상기 복수의 조직 유형 에 걸쳐 있는, 인공 지능 기반 시스템. 100.제1항에 있어서, 상기 입력 염기 시퀀스 및 상기 복수의 생물학적 양 출력 시퀀스는 상기 복수의 셀 유형에 걸쳐 있는, 인공 지능 기반 시스템. 101.제10항에 있어서, 상기 유전자 발현 출력 시퀀스는 상기 복수의 조직 유형에 걸쳐 있는, 인공 지능 기반 시 스템. 102.제10항에 있어서, 상기 유전자 발현 출력 시퀀스는 상기 복수의 셀 유형에 걸쳐 있는, 인공 지능 기반 시스 템. 103.제1항에 있어서, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 상기 제1 훈련 세트에 서 종단 간으로 훈련시킨 다음, 상기 제2 훈련 세트에서 재훈련시키는, 인공 지능 기반 시스템. 104.제1항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 변동을 나타내는 제1 기준 진리 라 벨로 라벨링된 병원성 세트로서 사용되고, 공통 변이체는 유전자 발현 비변동을 나타내는 제2 기준 진리 라벨로 라벨링된 양성 세트로서 사용되는, 인공 지능 기반 시스템. 105.제104항에 있어서, 상기 양성 세트는 트리뉴클레오티드 컨텍스트, 동종 중합체, k-mer, 이웃 GC 빈도 및 시 퀀싱 깊이에 대해 균형을 이루는, 인공 지능 기반 시스템. 106.제104항에 있어서, 상기 과다 발현 확률 및 상기 과소 발현 확률에 적용된 컷오프 확률에 기초하여, 상기 제2 훈련 세트에서의 상기 변이체는 유전자 발현 증가를 나타내는 제1 기준 진리 라벨을 갖는 과다 발현 변이체 훈련 세트, 유전자 발현 감소를 나타내는 제2 기준 진리 라벨을 갖는 과다 발현 변이체 훈련 세트, 및 유전자 발현 유지를 나타내는 신경 발현 변이체 훈련 세트로 분할되는, 인공 지능 기반 시스템. 107.제10항에 있어서, 상기 유전자 발현 모델 및 상기 유전자 발현 출력 생성 로직은 먼저 상기 제1 훈련 세트 에서 종단 간으로 훈련시킨 다음, 상기 제2 훈련 세트에서 재훈련되는, 인공 지능 기반 시스템. 108.제1항에 있어서, 상기 생물학적 양 모델 및 상기 생물학적 양 출력 생성 로직을 먼저 상기 제1 훈련 세트에 서 종단 간으로 훈련시킨 다음, 홀수 염색체에서 발생하는 상기 제2 훈련 세트에서의 해당 변이체에 대해 재훈 련시키는, 인공 지능 기반 시스템. 109.제10항에 있어서, 상기 유전자 발현 모델 및 상기 유전자 발현 출력 생성 로직을 먼저 상기 제1 훈련 세트 에서 종단 간으로 훈련시킨 다음, 홀수 염색체에서 발생하는 상기 제2 훈련 세트에서의 해당 변이체에 대해 재 훈련시키는, 인공 지능 기반 시스템. 110.제85항에 있어서, 상기 제2 훈련 세트에서의 상기 변이체를 훈련을 위해 사용하지 않고 대신에 상기 훈련된 생물학적 양 모델, 상기 훈련된 생물학적 양 출력 생성 로직, 상기 훈련된 유전자 발현 모델, 및 상기 훈 련된 유전자 발현 출력 생성 로직의 성능을 평가하기 위한 검증 세트로서 사용하는, 인공 지능 기반 시스템. 111.제110항에 있어서, 짝수 염색체에서 발생하는 상기 제2 훈련 세트에서의 해당 변이체를 상기 검증 세트로 사용하는, 인공 지능 기반 시스템. 112.제1항에 있어서, 상기 타깃 염기 시퀀스의 크기는 전사 시작 부위(TSS)의 다양한 오프셋 위치를 고려하기 위해 훈련 동안 가변되는, 인공 지능 기반 시스템. 113.염기 해상도에서 유전자 발현의 변화를 검출하는 인공 지능 기반 시스템으로서, 시퀀스 데이터베이스에 액세스하고 입력 염기 시퀀스를 생성하는 입력 생성 로직으로서, 상기 입력 염기 시퀀스 는 타깃 염기 시퀀스를 포함하고, 상기 타깃 염기 시퀀스는 하류 컨텍스트 염기를 갖는 우측 염기 시퀀스 및 상 류 컨텍스트 염기를 갖는 좌측 염기 시퀀스에 의해 플랭킹되는, 상기 입력 생성 로직; 상기 입력 염기 시퀀스를 처리하고 상기 입력 염기 시퀀스의 대체 표현을 생성하는 생물학적 양 모델; 및 상기 입력 염기 시퀀스의 대체 표현을 처리하고 복수의 생물학적 양 출력 시퀀스를 생성하는 생물학적 양 출력 생성 로직을 포함하되, 상기 복수의 생물학적 양 출력 시퀀스에서 각각의 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 각 각의 타깃 염기에 대한 각각의 염기 당 생물학적 양 출력을 포함하는, 인공 지능 기반 시스템. 114.제113항에 있어서, 상기 복수의 생물학적 양 출력 시퀀스에서의 제1 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 상기 각각의 타깃 염기에 대한 제1 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제1 각각의 염기 당 생물학적 양 출력은 복수의 종에 걸쳐 상기 각각의 타깃 염기의 각각의 진화 보존 측 정치를 특정하는, 인공 지능 기반 시스템. 115.제113항에 있어서, 상기 복수의 생물학적 양 출력 시퀀스에서의 제2 생물학적 양 출력 시퀀스는 상기 타깃 염기 시퀀스에서의 상기 각각의 타깃 염기에 대한 제2 각각의 염기 당 생물학적 양 출력을 포함하고, 상기 제2 각각의 염기 당 생물학적 양 출력은 상기 타깃 염기 시퀀스에서의 각각의 위치에서 상기 각각의 타깃 염기의 각각의 전사 개시 측정치를 특정하는, 인공 지능 기반 시스템. 조항 세트 2 1. 시스템으로서, 인과성 점수 세트를 갖는 변이체 세트를 갖는 검증 데이터로서, 인과성 점수는 유전자 발현을 변경시킬 수 있는 통계적으로 교란되지 않은 가능성을 특정하는, 상기 검증 데이터; 상기 인과성 점수 세트에서의 각각의 인과성 점수를 상기 인과성 점수 세트에 대한 컷오프의 적용에 기초하여 유전자 발현 변경 클래스 또는 유전자 발현 보존 클래스로 분류하여, 상기 변이체 세트의 기준 진리 분기점을 상기 유전자 발현 변경 클래스 및 상기 유전자 발현 보존 클래스로 생성하도록 구성되는 검증 세트 이산화 로직; 모델이 상기 변이체 세트에 대한 예측 점수 세트를 생성하게 하도록 구성된 추론 로직으로서, 상기 예측 점수 세트에서의 예측 점수는 유전자 발현을 변경시킬 수 있는 추론된 가능성을 특정하고, 상기 모델을 훈련시켜 변 이체의 유전자 발현 변경가능성을 결정하는, 상기 추론 로직; 상기 예측 점수 세트에서의 각각의 예측 점수를 상기 예측 점수 세트에 대한 임계치의 적용에 기초하여 상기 유 전자 발현 변경 클래스 또는 상기 유전자 발현 보존 클래스로의 분류하여, 상기 변이체 세트의 추론된 분기점을 상기 유전자 발현 변경 클래스 및 상기 유전자 발현 보존 클래스로 생성하도록 구성된 모델 점수 이산화 로직; 및 상기 기준 진리 분기점에 대한 상기 추론된 분기점의 비교에 기초하여 상기 모델의 성능 측정을 결정하도록 구 성된 검증 로직을 포함하는, 시스템. 2. 제1항에 있어서, 상기 기준 진리 분기점은 상기 유전자 발현 변경 클래스로 분류된 해당 변이체에 제1 라벨 (예: 0)을 할당하고, 상기 유전자 발현 보존 클래스로 분류된 해당 변이체에 제2 라벨(예: 1)을 할당하는, 시스 템. 3.제2항에 있어서, 상기 기준 진리 분기점은 상기 유전자 발현 변경 클래스로 분류된 해당 변이체에 제1 라벨 (예: 0)을 할당하고, 상기 유전자 발현 보존 클래스로 분류된 해당 변이체에 제2 라벨(예: 1)을 할당하는, 시스 템. 다른 구현에서, 기준 진리 분기점은 상기 변이체를 3개의 카테고리: -1, 0, 1로 분기하며, 이는 유전자 발현 감 소, 유전자 발현에 변화 없음, 유전자 발현 증가에 해당한다. 즉, 단일 분류기는 이러한 구현에서 3-방향 분류 를 할 수 있다. 4.제3항에 있어서, 제1 벡터에서 상기 기준 진리 분기점을 인코딩하고, 제2 벡터에서 상기 추론된 분기점을 인 코딩하도록 추가로 구성되는, 시스템. 5.제4항에 있어서, 상기 제1 벡터 및 상기 제2 벡터의 요소별 비교에 기초하여 상기 모델의 성능 측정을 결정하 도록 추가로 구성되는, 시스템. 6.제1항에 있어서, 상기 추론된 분기점에 의해 상기 유전자 발현 변경 클래스로 분류되는 변이체 수, 상기 추론 된 분기점에 의해 상기 유전자 발현 보존 클래스로 분류되는 변이체의 수, 상기 기준 진리 분기점에 의해 상기 유전자 발현 변경 클래스로 분류되는 변이체의 수, 및 상기 기준 진리 분기점에 의해 상기 유전자 발현 보존 클 래스로 분류되는 변이체의 수의 승산비에 기초하여 상기 모델의 성능 측정을 결정하도록 추가로 구성되는, 시스 템. 7.제1항에 있어서, 상기 변이체 세트는 과소 발현 인과성 점수 세트를 가지며, 과소 발현 인과성 점수는 유전자 발현을 감소시킬 수 있는 통계적으로 교란되지 않은 가능성을 특정하는, 시스템. 8. 제7항에 있어서, 상기 검증 세트 이산화 로직은 상기 과소 발현 인과성 점수 세트에서의 각각의 과소 발현 인과성 점수를 상기 과소 발현 인과성 점수 세트에 대한 과소 발현 컷오프의 적용에 기초하여 유전자 발현 감소 클래스 또는 유전자 발현 비감소 클래스로 분류하여, 상기 변이체 세트의 과소 발현 기준 진리 분기점을 상기 유전자 발현 감소 클래스 및 상기 유전자 발현 비감소 클래스로 생성하도록 추가로 구성되는, 시스템.9.제8항에 있어서, 상기 추론 로직은 상기 모델이 상기 변이체 세트에 대한 과소 발현 예측 점수 세트를 생성하 게 하도록 추가로 구성되고, 상기 과소 발현 예측 점수 세트에서의 하나의 과소 발현 예측 점수는 유전자 발현 을 감소시킬 수 있는 추론된 가능성을 특정하고, 상기 모델을 훈련시켜 변이체의 유전자 발현 감소가능성을 결 정하고, 상기 모델 점수 이산화 로직은 상기 과소 발현 예측 점수 세트에서의 각각의 과소 발현 예측 점수를 상기 과소 발현 예측 점수 세트에 대한 과소 발현 임계치의 적용에 기초하여 상기 유전자 발현 감소 클래스 또는 상기 유 전자 발현 비감소 클래스로 분류하여, 상기 변이체 세트의 과소 발현 추론된 분기점을 상기 유전자 발현 감소 클래스 및 상기 유전자 발현 비감소 클래스로 생성하도록 추가로 구성되고, 상기 검증 로직은 상기 과소 발현 기준 진리 분기점에 대한 상기 과소 발현 추론된 분기점의 비교에 기초하여 상기 모델의 과소 발현 성능 측정을 결정하도록 추가로 구성되는, 시스템. 10.제9항에 있어서, 상기 모델 점수 이산화 로직은 상기 과소 발현 예측 점수 세트를 감소 순서로 정렬하고, 상 기 정렬된 과소 발현 예측 점수 세트에서 N개의 가장 낮은 과소 발현 예측 점수 하위 세트를 상기 유전자 발현 감소 클래스로 분류하고, 상기 정렬된 과소 발현 예측 점수 세트에서 나머지 과소 발현 예측 점수 하위 세트를 상기 유전자 발현 비감소 클래스로 분류하도록 추가로 구성되는, 시스템. 11.제8항에 있어서, 상기 과소 발현 기준 진리 분기점은 상기 유전자 발현 감소 클래스로 분류된 해당 변이체에 제1 라벨(예: 0)을 할당하고, 상기 유전자 발현 비감소 클래스로 분류된 해당 변이체에 제2 라벨(예: 1)을 할당 하는, 시스템. 12.제11항에 있어서, 상기 과소 발현 추론된 분기점은 상기 유전자 발현 감소 클래스로 분류된 해당 변이체에 상기 제1 라벨(예: 0)을 할당하고, 상기 유전자 발현 비감소 클래스로 분류된 해당 변이체에 상기 제2 라벨(예: 1)을 할당하는, 시스템. 13.제12항에 있어서, 제1 벡터에서 상기 과소 발현 기준 진리 분기점을 인코딩하고, 제2 벡터에서 상기 추론된 분기점을 인코딩하도록 추가로 구성되는, 시스템. 14.제13항에 있어서, 상기 제1 벡터 및 상기 제2 벡터의 요소별 비교에 기초하여 상기 모델의 과소 발현 성능 측정을 결정하도록 추가로 구성되는, 시스템. 15.제9항에 있어서, 상기 과소 발현 추론된 분기점에 의해 상기 유전자 발현 감소 클래스로 분류되는 변이체 수, 상기 과소 발현 추론된 분기점에 의해 상기 유전자 발현 비감소 클래스로 분류되는 변이체의 수, 상기 과소 발현 기준 진리 분기점에 의해 상기 유전자 발현 감소 클래스로 분류되는 변이체의 수, 및 상기 과소 발현 기준 진리 분기점에 의해 상기 유전자 발현 비감소 클래스로 분류되는 변이체의 수의 승산비에 기초하여 상기 모델의 과소 발현 성능 측정을 결정하도록 추가로 구성되는, 시스템. 16.제1항에 있어서, 상기 변이체 세트는 과다 발현 인과성 점수 세트를 가지며, 과다 발현 인과성 점수는 유전 자 발현을 증가시킬 수 있는 통계적으로 교란되지 않은 가능성을 특정하는, 시스템. 17. 제16항에 있어서, 상기 검증 세트 이산화 로직은 상기 과다 발현 인과성 점수 세트에서의 각각의 과다 발현 인과성 점수를 상기 과다 발현 인과성 점수 세트에 대한 과다 발현 컷오프의 적용에 기초하여 유전자 발현 증가 클래스 또는 유전자 발현 비증가 클래스로 분류하여, 상기 변이체 세트의 과다 발현 기준 진리 분기점을 상기 유전자 발현 증가 클래스 및 상기 유전자 발현 비증가 클래스로 생성하도록 추가로 구성되는, 시스템. 18.제17항에 있어서, 상기 추론 로직은 상기 모델이 상기 변이체 세트에 대한 과다 발현 예측 점수 세트를 생성 하게 하도록 추가로 구성되고, 상기 과다 발현 예측 점수 세트에서의 하나의 과다 발현 예측 점수는 유전자 발 현을 증가시킬 수 있는 추론된 가능성을 특정하고, 상기 모델을 훈련시켜 변이체의 유전자 발현 증가가능성을 결정하고, 상기 모델 점수 이산화 로직은 상기 과다 발현 예측 점수 세트에서의 각각의 과다 발현 예측 점수를 상기 과다 발현 예측 점수 세트에 대한 과다 발현 임계치의 적용에 기초하여 상기 유전자 발현 증가 클래스 또는 상기 유 전자 발현 비증가 클래스로 분류하여, 상기 변이체 세트의 과다 발현 추론된 분기점을 상기 유전자 발현 증가 클래스 및 상기 유전자 발현 비증가 클래스로 생성하도록 추가로 구성되고, 상기 검증 로직은 상기 과다 발현 기준 진리 분기점에 대한 상기 과다 발현 추론된 분기점의 비교에 기초하여 상기 모델의 과다 발현 성능 측정을 결정하도록 추가로 구성되는, 시스템.19.제18항에 있어서, 상기 모델 점수 이산화 로직은 상기 과다 발현 예측 점수 세트를 감소 순서로 정렬하고, 상기 정렬된 과다 발현 예측 점수 세트에서 N개의 가장 높은 과다 발현 예측 점수 하위 세트를 상기 유전자 발 현 증가 클래스로 분류하고, 상기 정렬된 과다 발현 예측 점수 세트에서 나머지 과다 발현 예측 점수 하위 세트 를 상기 유전자 발현 비증가 클래스로 분류하도록 추가로 구성되는, 시스템. 20.제17항에 있어서, 상기 과다 발현 기준 진리 분기점은 상기 유전자 발현 증가 클래스로 분류된 해당 변이체 에 제1 라벨(예: 0)을 할당하고, 상기 유전자 발현 비증가 클래스로 분류된 해당 변이체에 제2 라벨(예: 1)을 할당하는, 시스템. 21.제20항에 있어서, 상기 과다 발현 추론된 분기점은 상기 유전자 발현 증가 클래스로 분류된 해당 변이체에 상기 제1 라벨(예: 0)을 할당하고, 상기 유전자 발현 비증가 클래스로 분류된 해당 변이체에 상기 제2 라벨(예: 1)을 할당하는, 시스템. 22.제21항에 있어서, 제1 벡터에서 상기 과다 발현 기준 진리 분기점을 인코딩하고, 제2 벡터에서 상기 추론된 분기점을 인코딩하도록 추가로 구성되는, 시스템. 23.제22항에 있어서, 상기 제1 벡터 및 상기 제2 벡터의 요소별 비교에 기초하여 상기 모델의 과다 발현 성능 측정을 결정하도록 추가로 구성되는, 시스템. 24.제18항에 있어서, 상기 과다 발현 추론된 분기점에 의해 상기 유전자 발현 증가 클래스로 분류되는 변이체 수, 상기 과다 발현 추론된 분기점에 의해 상기 유전자 발현 비증가 클래스로 분류되는 변이체의 수, 상기 과다 발현 기준 진리 분기점에 의해 상기 유전자 발현 증가 클래스로 분류되는 변이체의 수, 및 상기 과다 발현 기준 진리 분기점에 의해 상기 유전자 발현 비증가 클래스로 분류되는 변이체의 수의 승산비에 기초하여 상기 모델의 과다 발현 성능 측정을 결정하도록 추가로 구성되는, 시스템. 25.제1항에 있어서, 상기 추론 로직은 제1 모델이 상기 변이체 세트에 대한 제1 예측 점수 세트를 생성하게 하 도록 추가로 구성되고, 상기 제1 예측 점수 세트에서의 하나의 예측 점수는 유전자 발현을 변경시킬 수 있는 추 론된 가능성을 특정하고, 상기 제1 모델을 훈련시켜 변이체의 유전자 발현 변경가능성을 결정하고, 상기 모델 점수 이산화 로직은 상기 제1 예측 점수 세트에서의 각각의 예측 점수를 상기 제1 예측 점수 세트에 대한 제1 임계치의 적용에 기초하여 상기 유전자 발현 변경 클래스 또는 상기 유전자 발현 보존 클래스로 분류 하여, 상기 변이체 세트의 제1 추론된 분기점을 상기 유전자 발현 변경 클래스 및 상기 유전자 발현 보존 클래 스로 생성하도록 추가로 구성되고, 상기 검증 로직은 상기 기준 진리 분기점에 대한 상기 제1 추론된 분기점의 비교에 기초하여 상기 제1 모델의 제1 성능 측정을 결정하도록 추가로 구성되는, 시스템 26.제25항에 있어서, 상기 추론 로직은 제2 모델이 상기 변이체 세트에 대한 제2 예측 점수 세트를 생성하게 하 도록 추가로 구성되고, 상기 제2 예측 점수 세트에서의 하나의 예측 점수는 유전자 발현을 변경시킬 수 있는 추 론된 가능성을 특정하고, 상기 제2 모델을 훈련시켜 변이체의 유전자 발현 변경가능성을 결정하고, 상기 모델 점수 이산화 로직은 상기 제2 예측 점수 세트에서의 각각의 예측 점수를 상기 제2 예측 점수 세트에 대한 제2 임계치의 적용에 기초하여 상기 유전자 발현 변경 클래스 또는 상기 유전자 발현 보존 클래스로 분류 하여, 상기 변이체 세트의 제2 추론된 분기점을 상기 유전자 발현 변경 클래스 및 상기 유전자 발현 보존 클래 스로 생성하도록 추가로 구성되고, 상기 검증 로직은 상기 기준 진리 분기점에 대한 상기 제2 추론된 분기점의 비교에 기초하여 상기 제2 모델의 제2 성능 측정을 결정하도록 추가로 구성되는, 시스템 27.제26항에 있어서, 상기 추론 로직은 제3 모델이 상기 변이체 세트에 대한 제3 예측 점수 세트를 생성하게 하 도록 추가로 구성되고, 상기 제3 예측 점수 세트에서의 하나의 예측 점수는 유전자 발현을 변경시킬 수 있는 추 론된 가능성을 특정하고, 상기 제3 모델을 훈련시켜 변이체의 유전자 발현 변경가능성을 결정하고, 상기 모델 점수 이산화 로직은 상기 제3 예측 점수 세트에서의 각각의 예측 점수를 상기 제3 예측 점수 세트에 대한 제3 임계치의 적용에 기초하여 상기 유전자 발현 변경 클래스 또는 상기 유전자 발현 보존 클래스로 분류 하여, 상기 변이체 세트의 제3 추론된 분기점을 상기 유전자 발현 변경 클래스 및 상기 유전자 발현 보존 클래 스로 생성하도록 추가로 구성되고, 상기 검증 로직은 상기 기준 진리 분기점에 대한 상기 제3 추론된 분기점의 비교에 기초하여 상기 제3 모델의 제3 성능 측정을 결정하도록 추가로 구성되는, 시스템28.제27항에 있어서, 상기 제1, 제2, 및 제3 추론된 분기점이 상기 유전자 발현 변경 클래스에서 동일한 수의 변이체를 분류하도록 요구함으로써, 상기 제1, 제2, 및 제3 성능 측정치를 서로 비교할 수 있게 하도록 추가로 구성되는, 시스템. 29.제28항에 있어서, 상기 제1, 제2, 및 제3 성능 측정치의 비교에 기초하여 상기 검증 데이터에 대한 상기 제 1, 제2, 및 제3 모델의 각각의 성능을 비교하도록 추가로 구성되는, 시스템. 30.제27항에 있어서, 상기 제1, 제2, 및 제3 임계치는 상이한, 시스템. 31.제27항에 있어서, 상기 제1, 제2, 및 제3 임계치의 적어도 일부는 동일한, 시스템. 32.제1항에 있어서, 상기 변이체 세트의 각각의 기준 진리 분기점을 상기 인과성 점수 세트에 대한 상이한 컷오 프의 각각의 적용에 기초하여 상기 유전자 발현 변경 클래스 및 상기 유전자 발현 보존 클래스로 생성하도록 추 가로 구성되는, 시스템. 33.제1항에 있어서, 상기 변이체 세트의 기준 진리 삼분지를 유전자 발현 감소 클래스, 유전자 발현 증가 클래 스, 및 유전자 발현 보존 클래스로 생성하도록 추가로 구성되는, 시스템. 34.제33항에 있어서, 상기 변이체 세트의 추론된 삼분지를 상기 유전자 발현 감소 클래스, 상기 유전자 발현 증 가 클래스, 및 상기 유전자 발현 보존 클래스로 생성하도록 추가로 구성되는, 시스템. 35. 제1항에 있어서, 상기 변이체 세트에서의 각각의 변이체는 이상치 개체의 코호트 중 단지 하나의 이상치 개 체에서 발생하는 단독 변이체이고, 상기 이상치 개체의 코호트에서 이상치 개체는 극한 수준의 유전자 발현을 나타내는, 시스템. 36.제35항에 있어서, 극한 수준의 유전자 발현은 정규화된 유전자 발현 수준의 꼬리 사분위로부터 결정되는, 시 스템. 37.제35항에 있어서, 극한 수준의 유전자 발현은 과다 유전자 발현 및 과소 유전자 발현을 포함하는, 시스템. 38.제35항에 있어서, 상기 단일 변이체는 코딩 변이체인, 시스템. 39.제35항에 있어서, 상기 단일 변이체는 비-코딩 변이체인, 시스템. 40.제39항에 있어서, 상기 비-코딩 변이체는 5개의 프라임 비변환 영역(UTR) 변이체, 3개의 프라임 UTR 변이체, 인핸서 변이체, 또는 프로모터 변이체인, 시스템. 41.제1항에 있어서, 상기 변이체 세트는 복수의 조직 유형에 걸쳐 있는, 시스템. 42.제1항에 있어서, 상기 변이체 세트는 복수의 셀 유형에 걸쳐 있는, 시스템. 43.시스템으로서, 기준 진리 점수 세트를 갖는 관측치 세트를 갖는 검증 데이터; 상기 기준 진리 점수 세트에서의 각각의 기준 진리 점수를 상기 기준 진리 점수 세트에 대한 컷오프의 적용에 기초하여 제1 클래스 또는 제2 클래스로 분류하여, 상기 관측치 세트의 기준 진리 분기점을 상기 제1 클래스 및 상기 제2 클래스로 생성하도록 구성되는 검증 세트 이산화 로직; 훈련된 모델이 상기 관측치 세트에 대한 예측 점수 세트를 생성하게 하도록 구성되는 추론 로직; 상기 예측 점수 세트에서의 각각의 예측 점수를 상기 예측 점수 세트에 대한 임계치의 적용에 기초하여 상기 제 1 클래스 또는 상기 제2 클래스에 분류하여, 상기 관측치 세트의 추론된 분기점을 상기 제1 클래스 및 상기 제2 클래스로 생성하도록 구성되는 모델 점수 이산화 로직; 및 상기 기준 진리 분기점에 대한 상기 추론된 분기점의 비교에 기초하여 상기 훈련된 모델의 성능 측정을 결정하 도록 구성되는 검증 로직을 포함하는, 시스템. 44.제43항에 있어서, 각각의 모델에 대한 각각의 추론된 분기점을 생성하여 상기 각각의 추론된 분기점 각각은 상기 제1 클래스에 대해 동일한 수의 관측치를 분류하도록 요구되고, 그에 의해 상기 각각의 모델의 각각의 성 능 측정치를 서로 비교하게 하도록 추가로 구성되는, 시스템. 45. 제44항에 있어서, 상기 각각의 성능 측정치의 비교에 기초하여 상기 검증 데이터에 대한 상기 각각의 모델 의 각각의 성능을 비교하도록 추가로 구성되는, 시스템. 본 발명이 상기에 상술된 바람직한 구현 및 예를 참조하여 개시되지만, 이러한 예는 제한적인 의미가 아니라 예 시적인 것으로 의도됨이 이해될 것이다. 수정 및 조합이 당업자에게 쉽게 떠오를 것이며, 이러한 수정 및 조합 은 본 발명의 사상 및 하기의 청구범위의 범주 내에 있을 것이라는 것이 고려된다."}
{"patent_id": "10-2024-7042680", "section": "도면", "subsection": "도면설명", "item": 1, "content": "특허 또는 출원 파일은 컬러로 작성된 적어도 하나의 도면을 포함한다. 컬러 도면(들)을 갖는 이러한 특허 또 는 특허 출원 공보의 사본은 요청 및 필요한 수수료의 지불에 따라 특허청에 의해 제공될 것이다. 컬러 도면은, 또한, Supplemental Content 탭을 통해 PAIR에서 입수 가능할 수 있다. 도면에서, 유사한 도면 부호는 일반적으로 상이한 도면 전체에 걸쳐서 유사한 부분을 지칭한다. 또한, 도면은 반드시 일정한 비율로 표시될 필요는 없으며, 대신 일반적으로 개시된 기술의 원리를 설명하는 데 중점을 두고 있다. 다음 설명에서, 개시된 기술의 다양한 구현이 다음 도면을 참조하여 기술된다. 도 1은 유전자 시퀀스의 진화적, 후생적 특성을 결정하기 위한 시스템의 프로세스를 설명하는 흐름도이다. 도 2는 시퀀스 데이터베이스로부터 추출된 뉴클레오티드 염기를 포함하는 예시적인 입력 염기 시퀀스를 개략적 으로 도시하며, 여기서 타깃 염기 시퀀스는 상류 컨텍스트 염기를 함유하는 좌측 시퀀스 및 하류 컨텍스트 염기 를 함유하는 우측 시퀀스에 의해 플랭킹된다. 도 3은 2개의 예시적인 대체 시퀀스를 갖는 예시적인 기준 유전자 시퀀스로부터의 대체 시퀀스의 일례를 도시하 며, 여기서, 대체 시퀀스는 단일 염기 위치에서 각각의 단일 뉴클레오티드 변이체를 보유하지만, 그 외에는 기 준 시퀀스와 동일한 조성을 보유한다. 도 4는 개시된 기술의 한 가지 구현을 위해 개발된 훈련 데이터세트에 속하는 시퀀스의 유전자 구성을 도시한다. 도 5는 도 4에 설명된 제1 훈련 세트로 훈련된 모델로 도 1의 시스템에 적용된 다음, 도 4에 설명된 제2 훈련 세트로 재훈련을 받고 있는 훈련 절차의 일 구현을 개략적으로 도시한다.도 6은 도 4에 설명된 제1 훈련 세트를 사용하여 도 1의 시스템에 적용된 다음, 도 4에 설명된 제2 훈련 세트의 하위 세트와의 재훈련 진행하고, 제2 훈련 세트로부터의 샘플의 나머지 하위 세트와의 모델 검증이 뒤따르는 훈 련 절차의 다른 구현을 개략적으로 도시한다. 도 7은 변이체 분류를 위한 도 1의 시스템 구현의 개략도이며, 여기서 상기 시스템을 사용하여 각 시퀀스에 대 한 각각의 모델 출력을 비교함으로써 염기 해상도에서 기준 시퀀스와 대체 시퀀스를 비교한다. 도 8은 기준 시퀀스와 대체 시퀀스의 비교가 평균 델타 값에 의해 정량화되는 개시된 기술의 일 구현의 흐름도 이다. 도 9는 기준 시퀀스와 대체 시퀀스의 비교가 최종 합 델타 값에 의해 정량화되는 개시된 기술의 일 구현의 흐름 도이다. 도 10은, 생물학적 양 모델이 종단 간으로 훈련되는 제1 가중치 세트 및 제2 가중치 세트를 통해 입력 염기 시 퀀스로부터 2개의 생물학적 양 출력 시퀀스를 생성하는, 개시된 기술의 일 구현의 흐름도이다. 도 11은, 생물학적 양 모델이 종단 간으로 훈련되는 제1 가중치 세트 및 제2 가중치 세트를 통해 입력 염기 시 퀀스로부터 3개의 생물학적 양 출력 시퀀스를 생성하는, 개시된 기술의 일 구현의 흐름도이다. 도 12는, 생물학적 양 모델이 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트 및 처음부터 훈련되어 입력 염기 시퀀스의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하는 제2 가중치 세트를 포함하 는, 개시된 기술의 일 구현의 흐름도이다. 도 13은, 생물학적 양 모델이 종단 간으로 훈련되고 재훈련되어 단일 기반으로 후속 생물학적 양 출력 시퀀스를 생성하는 제1 가중치 세트 및 제2 가중치 세트를 통해 입력 염기 시퀀스로부터 하나의 생물학적 양 출력 시퀀스 를 생성하는, 개시된 기술의 일 구현의 흐름도이다. 도 14는, 생물학적 양 모델이 종단 간으로 훈련되어 입력 염기 시퀀스로부터 복수의 생물학적 양 출력 시퀀스를 생성하는 제1 가중치 세트 및 제2 가중치 세트, 및 종단 간으로 훈련되어 입력 복수의 생물학적 양 출력 시퀀스 로부터 유전자 발현 출력 시퀀스를 생성하는 제3 및 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐 름도이다. 도 15는, 생물학적 양 모델이 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트, 처음부터 훈련되어 입력 염기 시퀀스의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하는 제2 가중치 세트, 및 종단 간으로 훈련되어 입력 복수의 생물학적 양 출력 시퀀스로부터 유전자 발현 출력 시퀀스를 생성하는 제3 및 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 도 16은, 생물학적 양 모델이 입력 염기 시퀀스의 대체 표현을 생성하는 제1 가중치 세트, 처음부터 훈련되어 복수의 생물학적 양 출력 시퀀스를 생성하는 제2 가중치 세트, 처음부터 훈련되어 복수의 생물학적 양 출력 시 퀀스로부터 대체 생물학적 양 표현을 생성하는 제3 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현 으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이 다. 도 17은, 생물학적 양 모델이 종단 간으로 훈련되어 입력 염기 시퀀스로부터 복수의 생물학적 양 출력 시퀀스를 생성하는 제1 가중치 세트 및 제2 가중치 세트, 처음부터 훈련되어 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하는 제3 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 도 18은, 생물학적 양 모델이 입력 염기 시퀀스로부터 복수의 생물학적 양 출력 시퀀스를 생성하도록 훈련된 다 음, 제3 가중치 세트의 치환으로 재훈련되어 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하는 제1 가중치 세트, 및 치환된 제1 가중치 세트로 종단 간으로 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 도 19는, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련된 다음, 제3 가중치 세트의 치환으로서 재훈련되어 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하는 제1 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 도 20은, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련되는 제1 가중치 세트, 입력 염기의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하도록 훈련되는 제2 가중치 세트, 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하기 위해 제3 가중치 세트의 치환으로서 사용되는 재훈련된 제1 가중치 세트, 및 처음부터 훈련되어 대체 생물학적 양 표현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도이다. 도 21은, 생물학적 양 모델이 입력 염기 시퀀스로부터 대체 시퀀스 표현을 생성하도록 훈련되는 제1 가중치 세 트, 입력 염기의 대체 표현으로부터 복수의 생물학적 양 출력 시퀀스를 생성하도록 훈련되는 제2 가중치 세트, 복수의 생물학적 양 출력 시퀀스로부터 대체 생물학적 양 표현을 생성하기 위해 제3 가중치 세트의 치환으로서 사용되는 재훈련된 제1 가중치 세트, 및 치환된 제1 가중치 세트로 종단 간으로 훈련되어 대체 생물학적 양 표 현으로부터 유전자 발현 출력 시퀀스를 생성하는 제4 가중치 세트를 포함하는, 개시된 기술의 일 구현의 흐름도 이다. 도 22는, 모델이 염기 해상도에서 기준 생물학적 양 출력 시퀀스와 대체 생물학적 양 출력 시퀀스를 비교하는 병원성 예측 로직을 추가로 포함하도록 구성되는 개시된 기술의 일 구현의 흐름도이며, 여기서 제5 가중치 세트 는 복수의 생물학적 양 출력 시퀀스로부터 대체 시퀀스 병원성 예측을 생성하고, 제1 및 제2 가중치 세트는 각 각 처음부터 훈련된다. 도 23은, 모델이 염기 해상도에서 기준 생물학적 양 출력 시퀀스와 대체 생물학적 양 출력 시퀀스를 비교하는 병원성 예측 로직을 추가로 포함하도록 구성되는 개시된 기술의 일 구현의 흐름도이며, 여기서 제5 가중치 세트 는 복수의 생물학적 양 출력 시퀀스로부터 대체 시퀀스 병원성 예측을 생성하고, 제1 및 제2 가중치 세트는 종 단 간으로 훈련된다. 도 24는 제1 생물학적 양 출력 시퀀스에 대한 값으로 입력 염기 시퀀스로부터의 생물학적 양 모델로부터 생성될 수 있는 진화 보존 측정의 개략도이다. 도 25는 제2 생물학적 양 출력 시퀀스에 대한 값으로 입력 염기 시퀀스로부터의 생물학적 양 모델로부터 생성될 수 있는 전사 개시 측정의 개략도이다. 도 26은 제3 생물학적 양 출력 시퀀스에 대한 값으로 입력 염기 시퀀스로부터의 생물학적 양 모델로부터 생성될 수 있는 후생적 신호의 개략도이다. 도 27은, 발현 변경 분류기가 유전자 발현에 대한 변이체의 효과를 예측하도록 구성되는, 개시된 기술의 일 구 현의 흐름도이다. 도 28은, 변이체가 유전자 발현을 감소시키는지 또는 유전자 발현을 감소시키지 않는지를 예측하기 위해 발현 변경 분류기가 발현 감소 분류기로서 추가로 구성되는, 개시된 기술의 일 구현의 흐름도이다. 도 29는, 변이체가 유전자 발현을 증가시키는지 또는 유전자 발현을 증가시키지 않는지를 예측하기 위해 발현 변경 분류기가 발현 감소 분류기로서 추가로 구성되는, 개시된 기술의 일 구현의 흐름도이다. 도 30은, 발현 변경 분류기는 변이체가 유전자 발현을 보존하는지, 유전자 발현을 감소시키는지, 또는 유전자 발현을 증가시키는지를 예측하는 다중-클래스 발현 분류기로 추가로 구성되는, 개시된 기술의 일 구현의 흐름도 이다. 도 31은, 추론된 인과성 점수에 대한 기준 진리 인과성 점수의 비교를 위해 유전자 발현 분류기 훈련이 사용되 는, 개시된 기술의 일 구현의 흐름도이다. 도 32은 개시된 기술을 구현하는 데 사용될 수 있는 예시적인 컴퓨터 시스템을 도시한다."}
