{"patent_id": "10-2023-0039536", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2024-0145130", "출원번호": "10-2023-0039536", "발명의 명칭": "라이다가 측정한 풍속의 오류 판정 방법", "출원인": "주식회사 비갠", "발명자": "박승준"}}
{"patent_id": "10-2023-0039536", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "또는 청구항 2에 따른 오류 판정 방법에 따라 오류 데이터로 판정된 풍속 데이터 및 정상 데이터로 판정된 풍속 데이터를 이용하여 훈련된 인공지능 모델로 라이다에 의해 측정된 풍속 데이터의 오류 여부를 판정하는 것인, 오류 판정 방법."}
{"patent_id": "10-2023-0039536", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "청구항 1에 있어서,상기 풍속 방향은 서로 대향하는 최고 속도의 지점을 연결하는 방향인 것인, 오류 판정 방법."}
{"patent_id": "10-2023-0039536", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "라이다로 측정된 풍속의 오류 판정 방법으로서,"}
{"patent_id": "10-2023-0039536", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "이 발명은 라이다로 측정된 풍속의 오류 판정 방법에 관한 것으로서, 이 발명의 방법은, 라이다에 의해 소정 높 이의 공간에서 원주 방향으로 배치되는 복수의 지점에 대해 측정된 풍속 데이터들을 풍향을 원주 방향의 축으로 하고 풍속을 직경 방향의 축으로 하여 배치하여 데이터의 지점들을 연결하는 추세선의 그래프를 형성하는 단계, 그래프에서 풍속 방향의 지점 사이의 거리에 대한 최소 속도 지점의 거리의 비율을 산출하는 단계, 및 산출된 비 율이 소정값 이상이면 상기 소정 시간 동안 측정된 풍속 데이터들을 오류 데이터로 판정하고, 산출된 비율이 소 정값 미만이면 상기 소정 시간 동안 측정된 풍속 데이터들을 정상 데이터로 판정하는 단계를 포함하는 것이다."}
{"patent_id": "10-2023-0039536", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "이 발명은 라이다가 측정한 풍속의 오류 판정 방법에 관한 것이다."}
{"patent_id": "10-2023-0039536", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "지구 온난화로 인한 탄소 배출의 저감 내지 탄소 중립화를 위해 신재생 에너지의 개발 및 이용이 활발히 이루어 지고 있다. 풍력 발전은 바람이 가진 에너지의 일부를 기계적 에너지로 변환시키는 터빈 블레이드와 기계적 에너지를 전기 에너지로 변환시키는 발전기를 기본으로 하여 구성된다. 이러한 풍력 발전의 발전량은 풍속의 세제곱에 비례하 기 때문에 원하는 발전량을 확보하기 위해서는 설치 및 운용을 위한 위치의 선정이 필연적이고 설치 위치에서의 풍황 계측이 선행되어야 한다. 풍황 계측을 위하여, 라이다를 이용하여 풍력 발전 블레이드가 배치되는 고도에서의 풍속의 데이터를 수집한다. 라이더는 레이저를 이용하여 특정 높이에서의 풍향과 풍속을 측정하고 소정 시간 단위의 풍속의 데이터를 산출 하고, 높이를 변경하여 측정을 반복한다. 이러한 라이다를 이용한 풍속의 측정은 비교적 높은 정확성을 나타내지만, 라이다에서 측정한 데이터에는 눈,비, 먼지 등의 공기 중의 물체나 새 등의 비행체 등으로 인한 오류 데이터가 포함될 수 있다. 풍력 발전에 있어서 해상 풍력 발전은 육상 풍력 발전에 비해 평균적으로 바람의 크기가 크고 대규모 발전단지 를 조성할 수 있어 많은 관심을 받고 있다.해상에서의 풍황 계측은 바다위에 고정식 구조물을 세워 계측 장비를 운용하는 방식과 바다 위에 부력체를 띄워 계측장비를 운용하는 방식으로 크게 2가지로 나눌 수 있다. 부력식의 계측 장비는 파도 또는 바람에 따른 움직임을 가지기 때문에 측정되는 풍속 및 풍속에 영향을 준다. 바람의 품질을 나타내는 풍황 데이터는 일반적으로 10분 평균으로 나타낸다. 예컨대, 라이다에 의한 측정은 매1초 마다 특정 높이에서 바람을 측정하고 1초 동안 다른 높이로 이동하고 다시 1초 측정하는 형태로 이루어진다. 각 높이마다 10분 동안 측정된 속도를 평균하여 10분 평균 속도라고 이름하고, 이를 사용하여 풍황을 평가한다. 이러한 10분 평균 속도는 고정식과 부유식을 비교한 경우 차이가 거의 없다고 알려져 있다. 10분 동안의 평균을 통해 부유식의 움직임의 영향이 서로 상쇄되기 때문인 것으로 이해된다. 다만 10분 풍속의 표준편차를 사용한 난류강도 (Turbulent Intensity 이하 TI)는 부유식에서 고정식 대비 높은 값이 나타나는 것을 확인할 수 있다. 이러한 과대 평가는 위에서 언급한 바와 같이 풍황 평가에 있어 부정확한 정보 제공의 원인이 되어 이에 대한 해결이 요구된다. 부유식 측정 장치에서의 풍속 측정의 오류를 해결하기 위한 방법으로서, 대한민국 등록특허공보 제10-2455233호 (문헌 1)에서는 '해상 라이다의 운동변위 보정데이터 처리 시스템'이라는 명칭의 발명을 개시한다. 문헌 1의 발명에서는 라이다가 탑재된 부유체의 6자유도의 운동 변위를 계측하여 계측된 변위로부터 부유체의 순간 속도를 산출하여 라이다가 측정한 풍속 데이터를 보정한다. 선행기술문헌 특허문헌 (특허문헌 0001) 문헌 1: 대한민국 등록특허공보 제10-2455233호 비특허문헌 (비특허문헌 0001) 문헌 2: Taking the Motion out of Floating Lidar: Turbulence Intensity Estimates with a Continuous-Wave Wind Lidar, Remote Sensing. 2020,12, 898"}
{"patent_id": "10-2023-0039536", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이 발명은 전술한 종래 기술의 문제점을 고려하여 해상의 풍황 계측을 위한 부력식 계측 장비에 설치되어 풍속 을 측정하는 라이다에서 계측한 풍속에 관한 데이터가 오류인지 여부를 판정하는 방법을 제공하려는 것이다."}
{"patent_id": "10-2023-0039536", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "전술한 이 발명이 해결하고자 하는 과제는, 해상의 풍황 계측을 위한 부력식 계측 장비에 설치되어 풍속을 측정 하는 라이다에서 계측한 풍속에 관한 데이터의 오류 여부를 판정하는 방법에 관한 이 발명에 의해 달성된다. 이 발명에 따른 오류 판정 방법은, 라이다에 의해 소정 높이의 공간에서 원주 방향으로 배치되는 복수의 지점에 대해 측정된 풍속 데이터들을 풍향 을 원주 방향의 축으로 하고 풍속을 직경 방향의 축으로 하여 배치하여 데이터의 지점들을 연결하는 추세선의 그래프를 형성하는 단계, 그래프에서 풍속 방향의 지점 사이의 거리에 대한 최소 속도 지점의 거리의 비율을 산출하는 단계, 및 산출된 비율이 소정값 이상이면 상기 소정 시간 동안 측정된 풍속 데이터들을 오류 데이터로 판정하고, 산출된 비율이 소정값 미만이면 상기 소정 시간 동안 측정된 풍속 데이터들을 정상 데이터로 판정하는 단계를 포함한다. 라이더에 의해 소정 높이의 공간에서 원주 방향으로 배치되는 복수의 지점에 대해 풍속을 측정하면, 바람이 부 는 방향의 원주 방향 위치에서는 대체로 바람의 속력이 최대치로 나타나고 그에 수직한 위치에서는 대체로 바람 의 속력이 최저치로 나타나며, 라이다에 의한 풍속 측정에 다른 오류가 없다면, 그래프는 전체적으로 '8'자형으 로 표시된다. 따라서, 이 그래프에서 최대 속도 지점은 대체로 서로 반대의 위치, 즉 원주 방향으로 서로 대략 180도 이격된 위치에서 나타나고, 최소 속도 지점 역시 대체로 서로 반대의 위치, 즉 원주 방향으로 서로 180도 이격된 위치 에서 나타날 것으로 기대할 수 있다. 이에 따르면, 그래프 상의 지점 사이의 거리 중에서 최대 속도 지점 간의 거리는 최대치로 나타나고 최소 속도 지점 간의 거리는 최소치로 나타날 수 있다. 이러한 추론에 따르면, 그래프 상에서 풍속 방향의 2개의 지점 사이의 거리에 대한 최소 속도 지점 간의 거리의 비율은 1 보다 상당히 작은 값을 갖게 되며, 비율이 1보다 작은 소정의 값 미만이면 라이다에 의한 속도 측정의 데이터가 오류가 아니고 정상적인 측정값인 것으로 판정하고 소정의 값 이상이면 측정 데이터에 오류가 있는 것으로 판정할 수 있다. 이러한 판정 방식에 따라, 오류로 판정된 풍속 데이터를 유효하지 않은 것으로 취급하고, 오류가 아닌 정상의 풍속 데이터 만으로 풍황 계측을 할 수 있다. 한편, 이상과 같은 판정의 결과를 바탕으로 하여, 오류로 판정된 풍속 데이터와 정상으로 판정된 데이터를 인공 지능의 학습 모델에 입력하여 인공 지능을 학습시킬 수 있다. 이렇게 하여 훈련된 인공 지능 모델을 준비한 경우, 라이다가 측정한 풍속 데이터에 대하여 전술한 판정 방식을 이용하지 않고, 측정 데이터를 인공 지능에 입력하여 풍속 데이터의 오류 여부를 판정하게 할 수 있다."}
{"patent_id": "10-2023-0039536", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하에서는, 이 발명을 실시하기 위한 구체적인 내용으로서, 이 발명에 따른 라이다가 측정한 풍속에 대한 오류 판정을 하는 방법의 실시예에 대하여 설명한다. 풍황 계측을 위한 풍속 측정에 라이다를 이용하였다. 라이다에 의한 측정은 라이다에 의한 측정은, 매1초 마다 특정 높이에서 바람을 측정하고 1초 동안 다른 높이로 이동하고 다시 1초 측정하는 형태로 이루어진다. 각 높이마다 10분 동안 측정된 속도를 평균하여 10분 평균 속 도를 산출하고, 산출된 10분 평균 속도에 기초하여 풍황을 평가한다. 라이다는 특정 높이에 50Hz의 속도로 원뿔 모양의 속도 벡터를 생성하고, 50개의 벡터값을 최적화 기법을 통하 여 1초 속도 벡터를 구하였다. 이와 같은 1초 속도 벡터를 구하는 기법에 대해서는 문헌 2의 논문에서 개시하므로 구체적인 설명은 생략한다. 라이다에서 측정된 1초 단위 속도는 가시속도 데이터를 기반으로 계산된다. 그러나 우천, 안개, 폭설과 같은 상 황에서는 가시속도 데이터가 정확하게 측정되지 않는다, 이러한 부정확한 가시속도 데이터를 기반으로 1초 단위 속도를 계산하면 1초 단위 속도 계산의 결과가 부정확하게 나올 수 있다. 이 발명의 실시예의 방법에 따라 가시 속도 데이터의 부적합 여부를 판정한다. 라이더에서 측정한 각 원주 방향의 각 위치에서 바람의 속력값을 풍향을 원주 방향의 축으로 하고 풍속을 직경 방향의 축으로 하여 배치하여 데이터의 지점들을 연결하는 추세선의 그래프를 형성하였다. 이러한 추세선은 이 동 평균을 구하거나 최소 자승법 등의 공지의 방법을 통하여 산출할 수 있다.이와 같이 하여 형성한 라이더의 측정 데이터에 따른 풍속의 추세선은 도 1과 같은 형태를 갖는다. 도 1에 도시한 추세선은 측정 데이터에 오류가 없는 것으로 판정된 것으로서, 대체로 8자형을 그리게 된다. 즉, 라이다가 측정한 동일 높이에서 원형을 그리는 지점들에서의 풍속은 바람의 방향에 따른 원주 위치에서는 대체로 최대값을 나타내고 바람의 방향에 수직한 지점에서는 최소값을 갖게 된다. 즉, 바람의 방향에 수직한 지 점에서는 이론적으로는 풍속이 0으로 되지만 실제로는 일정한 속력을 나타낸다. 그러나, 강우 또는 강설과 같은 상황에서 라이다에 의해 측정된 풍속에는 해당 지점에서의 풍속이 정확히 측정 되지 않을 수 있고, 특히 부유식의 측정 장치에서는 문헌 2에서 개시하는 보정 방법에 의해 풍속 데이터를 보정 하더라도 부정확한 보정이나 부유체의 순간 속도의 측정 오류로 인하여 정확하지 않은 풍속 데이터가 산출될 수 있다. 도 1의 그래프와 마찬가지로, 측정 오류가 있는 풍속 데이터에 기초하여 풍향을 원주 방향으로 하고 풍속을 직 경 방향으로 하여 추세선의 그래프를 형성하였다. 몇가지 예가 도 2의 (a), (b), (c)에 도시되어 있다. 이들은 모두 도 1과 같은 정확한 풍속 데이터에 기초한 추세선의 그래프와 달리 8자형을 형성하지 않는다. 특히, 이들 그래프에서 바람의 속도 방향의 지점들의 거리에 대한 최소 속도 지점 사이의 거리의 비율을 산출하 면 그 값은 대체로 1에 가까운 값 또는 경우에 따라서 1을 초과하는 값을 나타낸다. 이러한 결과로부터, 속도 방향의 지점들의 거리, 하나의 예시로서 최대 속도의 지점을 서로 연결하는 선의 거리 에 대한 최소 속도 지점 사이의 거리의 비율에 대하여 소정의 값을 설정하고, 해당 값 이상을 나타내는 풍속 데 이터는 오류로 판정하고 해당 값 미만을 나타내는 풍속 데이터는 정상으로 판정하여, 오류가 없는 풍속 데이터 를 산출할 수 있다. 이와 같은 오류 판정 방법을 통하여 라이다가 일정 높이 지점에 대하여 1초 속도의 산출을 위하여 측정한 풍속 데이터의 오류 여부를 판정하고, 정상의 풍속 데이터가 산출되기까지 동일 위치의 동일 높이 지점에 대한 측정 을 반복할 수 있다. 이상과 같은 방법은 프로그램으로 구현되어 라이다의 데이터 처리 모듈에 탑재되어 풍황 계측이 이용될 수 있다. 한편, 이러한 오류 판정 방법의 실효성을 확인하기 위하여, 이 발명의 판정 방법과는 다른 측정 데이터의 오류 판정 알고리듬이 탑재된 라이더를 이용하여 풍속을 측정하고, 측정된 풍속 데이터에 대하여 이 발명의 실시예에 따른 판정 방법에서와 같이 풍향을 원주 방향으로 하고 바람 속력을 직경 방향으로 하는 추세선의 그래프를 작 성하고, 당해 그래프에서 풍속 방향의 지점 간의 거리에 대한 최소 속도 지점 간의 거리의 비율을 산출하였다. 도 3은 이렇게 산출된 비율을 각각의 측정 시간에 따라 표시한 그래프이다. 도 3의 그래프를 참조하면, 풍속 데이터가 오류로 판정된 경우의 대부분에서 풍속 방향의 지점 간의 거리에 대 한 최소 속도 지점 간의 거리의 비율은 0.5를 초과하는 것으로 나타났고, 그 비율의 평균값은 0.88이었다. 이러한 결과로부터 이 발명의 실시예의 판정 방법에 따라, 풍향을 원주 방향으로 하고 바람 속력을 직경 방향으 로 하는 추세선의 그래프를 작성하고 당해 그래프에서 풍속 방향의 지점 간의 거리에 대한 최소 속도 지점 간의 거리의 비율이 소정 값 이상이면 당해 풍속 데이터에 오류가 있는 것으로 판정하는 것이 적절한 것임을 확인할 수 있다. 전술한 이 발명의 하나의 실시예의 방법을 통하여, 라이다가 측정한 풍속 데이터의 오류 및 정상 여부가 판정되 고, 이러한 오류 및 정상의 판정 결과와 더불어 풍속 데이터를 이용하여 인공 지능을 학습하고, 라이다에 내장 프로그램을 사용하지 않고 라이다가 측정한 풍속 데이터를 인공 지능이 처리하여 오류가 있는 풍속 데이터를 필 터링할 수 있다. 이 실시예는 인공신경망을 활용하여 형성한 데이터 비적합 여부 필터링 신경망에 관한 것이다. 인공신경망 학습에 사용된 데이터는 해상에 설치된 고정식 라이다의 가시속도 데이터를 사용하였다. 학습 모델 은 딥러닝 분류(DNN Classification) 인공신경망을 사용하였고, 고정식 라이다의 1초 속도 데이터를 상공 높이 3개 지점에서 10만개 이상 확보하여 활용하였다. 10만개의 풍속 데이터에는 오류로 판명되어 오류 코드를 갖는3만개의 풍속 데이터가 포함되었다. 학습데이터, 학습검증, 테스트용 데이터를 8 : 1: 1로 분할 구성하여 학습 및 검증에 사용하였다. 사용 툴은 'Matlab Libry'사의 'Deep learning Toolbox'를 사용하였다. 입력값을 정규화된 50개의 Azimuth angle과 정규화된 50개의 line-of-sight velocity로 하였고, 출력으로서는 입력 데이터에 대한 '오류'와 '비오류'의 라벨링으로 하였다. 오류 데이터는 출력을 ‘0’으로 하고, 비오류 데이터는 출력을 ‘1’로 하였다. 데이터의 라벨링은 고정식 라 이다 1초 속도 데이터에 저장되어 있다. 훈련 옵션은 최대 Epoch를 1000회로 제한, Validation 오차가 6번 이상 증가하면 훈련이 중단되도록 하였다. 에 러 데이터의 라벨링은 고정식 라이다에 내장된 1초 단위 데이터를 기반으로 하였다. 가시속도 데이터를 시각화한 추세선 그래프의 형상이 8자에 가까우면 비오류로 라벨링이 되어있고, 그 외의 불 규칙한 형상에 대해서는 오류 형상으로 라벨링 되어 있다. 풍속 데이터를 오류 데이터와 비오류 데이터의 비율이 약 1:2 이 되도록 구성하였다. 이러한 학습의 결과, 만개의 풍속 데이터중 9735개의 데이터가 올바르게 분류되어 신경망 정확도가 97.4%로 우 수한 성능을 보였다. 풍속 데이터를 상세히 분석하면 3176개의 오류 데이터중 2995개가 올바르게 분류되었고, 6824개의 비오류 데이터 중 6740개의 데이터가 올바르게 분류되었다. Convergence 그래프를 분석한 결과, 학습이 반복되어 진행될수록, 훈련 데이터 세트, 검증 데이터 세트, 테스트 데이터 세트 모두 평균 제곱 오차가 점진적으로 줄어들어 수렴하는 형태를 보였다. 학습의 수렴 그래프 분석에 따르면 이 실시예에 따라 학습된 인공신경망은 오버슈팅(Overshooting)없이 학습이 안정적으로 진행되었다. 이상과 같은 방법에 따라 훈련된 인공 지능을 풍속 데이터의 필터링에 사용할 수 있다. 그러한 경우, 라이다는 별도의 오류 판정 알고리듬을 탑재하지 않고, 풍속 데이터를 출력하고 출력된 풍속 데이터는 이 발명의 실시예 에 따라 학습된 인공 지능 컴퓨터를 통하여 오류를 갖는 풍속 데이터를 필터링할 수 있다. 이상으로 이 발명의 실시예에 따른 라이더에 의해 측정된 풍속 데이터의 오류 판정 방법을 설명하였다. 이 발명 은 이러한 실시예에 한정되지 않고 청구범위에 기재한 범위에서 다양한 수정과 변형이 가능하다."}
{"patent_id": "10-2023-0039536", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1 및 도 2는 해상에서의 풍속을 측정하는 라이더에서 측정한 각 원주 방향의 각 위치에서 바람의 속력값을 풍향을 원주 방향의 축으로 하고 풍속을 직경 방향의 축으로 하여 배치하여 데이터의 지점들을 연결하는 추세선 의 그래프이다. 도 3은 도 2에 도시한 오류를 갖는 풍속 데이터에 대하여 풍속 방향의 지점 간의 거리에 대한 최소 속도 지점 간의 거리의 비율을 각각의 측정 시간에 따라 표시한 그래프이다."}
