{"patent_id": "10-2023-0135178", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0052078", "출원번호": "10-2023-0135178", "발명의 명칭": "3D 모양 색인을 활용한 달걀 성별 감지 방법 및 장치", "출원인": "전북대학교산학협력단", "발명자": "전형민"}}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "3차원 카메라를 통해 부하기에 놓여진 다수의 달걀을 동시 촬영하는 촬영 단계;부하기 영상과 달걀 영역 마스킹 결과간 상관관계가 사전 학습된 객체분할 딥러닝 네트워크를 통해 부하기 영상으로부터 다수의 달걀 영역을 각각 검출 및 추출하여 다수의 개별 달걀 영상을 획득하는 개별 달걀 영상 획득단계;상기 달걀 영상 각각으로부터 달걀 각각의 2차원 및 3차원 모양 색인을 산출하는 모양 색인 산출 단계; 및 2차원 및 3차원 모양 색인과 성별간 상관관계가 사전 학습된 인공 신경망을 통해 달걀 각각의 2차원 및 3차원모양 색인에 상응하는 성별 예측 정보를 획득 및 출력하는 성별 예측 단계를 포함하는 3D 모양 색인 기반 달걀성별 감지 방법."}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서, 상기 3차원 카메라는 스트레오(Stereo-type) 카메라, ToF(Time-of-flight) 카메라, 및 라이다(Lidar) 카메라 중 어느 하나로 구현되는 것을 특징으로 하는 3D 모양 색인 기반 달걀 성별 감지 방법."}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서, 상기 객체분할 딥러닝 네트워크는 달걀 영상을 입력 정보로 가지고, 달걀 영역 마스킹 결과를 출력 정보로 가지는 다수의 학습 데이터를 통해 사전 학습되는 것을 특징으로 하는 3D 모양 색인 기반 달걀 성별 감지 방법."}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서, 상기 인공 신경망은 다층 퍼셉트론(Multi-layer Perceptron, Deep Neural Network) 또는 트리 기반 머신러닝 모델(Tree-basedModel)로 구현되며, 2차원 및 3차원 모양 색인을 기본 포함하되 부하일수, 달걀 무게, 달걀 표면 거칠기 중 적어도 하나를 더 포함할 수 있는 입력 정보와 성별 정보를 출력 정보를 가지는 다수의 학습 데이터를 통해 사전학습되는 것을 특징으로 하는 3D 모양 색인 기반 달걀 성별 감지 방법."}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제3항에 있어서, 상기 달걀 영역 각각은 달걀 영역의 외곽선에 대응되는 N(N은 자연수)개의 포인트로 구성된 폐곡선 정보와, 달걀 영역의 내부 영역에대응되는 폐곡선 내부 M(M은 N 보다 큰 자연수)개의 픽셀 정보로 정의되는 것을 특징으로 하는 3D 모양 색인 기반 달걀 성별 감지 방법."}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서, 상기 모양 색인 산출 단계는2차원 평면에 투영된 폐곡선으로부터 추출되는 장축과 단축에 기반하여 2차원 모양 색인 정보를 산출하고, 달걀의 3차원 표면적으로부터 추출되는 장곡선과 단곡선에 기반하여 3차원 모양 색인을 산출하는 것을 특징으로 하는 3D 모양 색인을 활용한 달걀 성별 감지 방법."}
{"patent_id": "10-2023-0135178", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_7", "content": "부하기에 놓여진 다수의 달걀을 동시 촬영하는 3차원 카메라;공개특허 10-2025-0052078-3-부하기 영상과 달걀 영역 마스킹 결과간 상관관계가 사전 학습된 객체분할 딥러닝 네트워크를 통해 부하기 영상으로부터 다수의 달걀 영역을 각각 검출 및 추출하여 다수의 개별 달걀 영상을 획득하는 개별 영상 추출부;상기 달걀 영상 각각으로부터 달걀 각각의 2차원 및 3차원 모양 색인을 산출하는 모양 색인 산출부; 및2차원 및 3차원 모양 색인과 성별간 상관관계가 사전 학습된 인공 신경망을 통해 달걀 각각의 2차원 및 3차원모양 색인에 상응하는 성별 예측 정보를 획득 및 출력하는 성별 예측부를 포함하며, 상기 인공 신경망은 다층 퍼셉트론(Multi-layer Perceptron, Deep Neural Network) 또는 트리 기반 머신러닝 모델(Tree-basedModel)로 구현되며, 2차원 및 3차원 모양 색인을 기본 포함하되 부하일수, 달걀 무게, 달걀 표면 거칠기 중 적어도 하나를 더 포함할 수 있는 입력 정보와 성별 정보를 출력 정보를 가지는 다수의 학습 데이터를 통해 사전학습되는 것을 특징으로 하는 3D 모양 색인 기반 달걀 성별 감지 장치."}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 3D 모양 색인 기반 달걀 성별 감지 방법 및 장치에 관한 것으로, 이는 3차원 카메라를 통해 부하기에 놓여진 다수의 달걀을 동시 촬영하는 촬영 단계; 부하기 영상과 달걀 영역 마스킹 결과간 상관관계가 사전 학습 된 객체분할 딥러닝 네트워크를 통해 부하기 영상으로부터 다수의 달걀 영역을 각각 검출 및 추출하여 다수의 개 별 달걀 영상을 획득하는 개별 달걀 영상 획득 단계; 상기 달걀 영상 각각으로부터 달걀 각각의 2차원 및 3차원 모양 색인을 산출하는 모양 색인 산출 단계; 및 2차원 및 3차원 모양 색인과 성별간 상관관계가 사전 학습된 인 공 신경망을 통해 달걀 각각의 2차원 및 3차원 모양 색인에 상응하는 성별 예측 정보를 획득 및 출력하는 성별 예측 단계를 포함한다."}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 3차원 영상장치로 달걀의 2차원 및 3차원 모양 색인(Shape Index)을 추출하고 모양 색인과 달걀 성별 데이터로 학습된 딥러닝 네트워크를 통해 달걀 성별을 예측할 수 있도록 하는 3D 모양 색인을 활용한 달걀 성별 감지 방법 및 장치에 관한 것이다."}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "닭은 닭고기 생산을 목적으로 사육되는 육계와 계란 생산을 위해 사육되는 산란계로 구분된다. 육계의 산란기간 은 보통 35일 정도로 짧은 반면 산란계는 약 80주 사육되며 생후 80주까지 연간 약 250~300개의 알을 생산한다. 산란계의 수평아리(수컷 병아리)는 경제적 가치가 없어 부화하자마자 도살되며, 이러한 수평아리 살처분은 축산 업 전반에 심각한 경제적 및 윤리적 문제로 대두되고 있다. 독일은 세계 최초로 수평아리 살처분 금지를 위한 법안이 가결되어, 2022년부터 세계 최초로 병아리 도살 금지 법이 시행되고 있다. 최근 들어 동물윤리에 대한 중요성이 커지면서 각국 정부와 기업은 부화 전 병아리의 성별 을 감지하는 기술 개발을 진행하고 있다. 이에 독일 라이프치히대 연구진은 9일된 달걀에 레이저로 바늘보다 작은 지름 0.2m의 구멍을 뚫어 요막액 한 방 울을 뽑아 여성호르몬인 에스트론셀페이트의 농도로 성별을 감지하는 기술을 개발하였고, 독일 달걀 생산업체 셀레그트(Seleggt)는 이 방법을 자동화 및 적용하여 한 시간에 달걀 3,000개의 성별을 감별하도록 하고 있다. 그러나 상기의 성별 감지 시스템은 초기 시설의 구축 비용이 매우 높아 실제 상용농가 도입에 어려움이 존재한 다. 한편, 호주와 이스라엘 공동 연구팀은 유전자 편집기술을 활용하여 암닭의 성염색체 중 Z 염색체에 노란색 형광 단백질 유전자를 삽입한 후, 노란색 형광단백질을 검출하여 수평아리 달걀을 구별하는 기술을 제안하였다. 이는 간단한 탐지가 하나로 달걀의 성별을 구별할 수 있다는 장점이 있지만, 모든 암탉에 유전자 조작을 해야 하는 단점을 가지고 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 국내등록특허 제10-2174868호 (등록일자 : 2020.10.30)"}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "이에 상기와 같은 문제점을 해결하기 위한 것으로서, 본 발명은 3차원 영상장치로 달걀의 2차원 및 3차원 모양 색인을 추출하고 모양 색인과 달걀성별 데이터로 학습된 딥러닝 네트워크를 통해 달걀 성별을 간단하고 정확하 게 예측할 수 있도록 하는 3D 모양 색인을 활용한 달걀 성별 감지 방법 및 장치를 제공하고자 한다. 또한 다수의 달걀에 대한 성별 감지 동작을 동시에 수행할 수 있도록 함으로써, 시간 대비 처리 가능한 달걀의 개수를 증대시켜 줄 수 있도록 하는 모양 색인 기반 달걀 성별 감지 방법 및 장치를 제공하고자 한다. 본 발명의 목적은 이상에서 언급한 목적으로 제한되지 않으며, 언급되지 않은 또 다른 목적들은 아래의 기재로 부터 본 발명이 속하는 통상의 지식을 가진 자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상기 과제를 해결하기 위한 수단으로서, 본 발명의 일 실시 형태에 따르면 3차원 카메라를 통해 부하기에 놓여 진 다수의 달걀을 동시 촬영하는 촬영 단계; 부하기 영상과 달걀 영역 마스킹 결과간 상관관계가 사전 학습된 객체분할 딥러닝 네트워크를 통해 부하기 영상으로부터 다수의 달걀 영역을 각각 검출 및 추출하여 다수의 개별 달걀 영상을 획득하는 개별 달걀 영상 획득 단계; 상기 달걀 영상 각각으로부터 달걀 각각의 2차원 및 3차원 모 양 색인을 산출하는 모양 색인 산출 단계; 및 2차원 및 3차원 모양 색인과 성별간 상관관계가 사전 학습된 인공 신경망을 통해 달걀 각각의 2차원 및 3차원 모양 색인에 상응하는 성별 예측 정보를 획득 및 출력하는 성별 예 측 단계를 포함하는 3D 모양 색인 기반 달걀 성별 감지 방법을 제공한다. 상기 3차원 카메라는 스트레오(Stereo-type) 카메라, ToF(Time-of-flight) 카메라, 및 라이다(Lidar) 카메라 중 어느 하나로 구현되는 것을 특징으로 한다. 상기 객체분할 딥러닝 네트워크는 달걀 영상을 입력 정보로 가지고, 달걀 영역 마스킹 결과를 출력 정보로 가지 는 다수의 학습 데이터를 통해 사전 학습되는 것을 특징으로 한다. 상기 인공 신경망은 다층 퍼셉트론(Multi-layer Perceptron, Deep Neural Network) 또는 트리 기반 머신러닝 모델(Tree-based Model)로 구현되며, 2차원 및 3차원 모양 색인을 기본 포함하되 부하일수, 달걀 무게, 달걀 표 면 거칠기 중 적어도 하나를 더 포함할 수 있는 입력 정보와 성별 정보를 출력 정보를 가지는 다수의 학습 데이 터를 통해 사전 학습되는 것을 특징으로 한다. 상기 달걀 영역 각각은 달걀 영역의 외곽선에 대응되는 N(N은 자연수)개의 포인트로 구성된 폐곡선 정보와, 달 걀 영역의 내부 영역에 대응되는 폐곡선 내부 M(M은 N 보다 큰 자연수)개의 픽셀 정보로 정의되는 것을 특징으 로 한다. 상기 모양 색인 산출 단계는 2차원 평면에 투영된 폐곡선으로부터 추출되는 장축과 단축에 기반하여 2차원 모양 색인 정보를 산출하고, 달걀의 3차원 표면적으로부터 추출되는 장곡선과 단곡선에 기반하여 3차원 모양 색인을 산출하는 것을 특징으로 한다. 상기 과제를 해결하기 위한 수단으로서, 본 발명의 다른 실시 형태에 따르면 부하기에 놓여진 다수의 달걀을 동 시 촬영하는 3차원 카메라; 부하기 영상과 달걀 영역 마스킹 결과간 상관관계가 사전 학습된 객체분할 딥러닝 네트워크를 통해 부하기 영상으로부터 다수의 달걀 영역을 각각 검출 및 추출하여 다수의 개별 달걀 영상을 획 득하는 개별 영상 추출부; 상기 달걀 영상 각각으로부터 달걀 각각의 2차원 및 3차원 모양 색인을 산출하는 모 양 색인 산출부; 및 2차원 및 3차원 모양 색인과 성별간 상관관계가 사전 학습된 인공 신경망을 통해 달걀 각각 의 2차원 및 3차원 모양 색인에 상응하는 성별 예측 정보를 획득 및 출력하는 성별 예측부를 포함하는 3D 모양 색인 기반 달걀 성별 감지 장치를 제공한다."}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 달걀 형태에 대한 2차원 및 3차원 모양 색인을 획득한 후 인공지능 방식으로 분석하여, 달걀 성별을 간단하고, 신속하고, 정확하게 예측할 수 있도록 한다. 또한 부하기에 놓여진 다수의 달걀을 동시 촬영 및 분석할 수 있도록 함으로써, 시간 대비 처리가능한 달걀의 개수를 증대시켜 줄 수 있도록 한다. 즉, 시간 대비 처리가능한 달걀의 개수를 증대시킴으로써, 성별 감지 동작 효율을 극대화시켜 줄 수 있도록 한다."}
{"patent_id": "10-2023-0135178", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하, 첨부된 도면을 참조하여 본 발명이 속하는 기술분야에서 통상의 지식을 가진 자가 본 발명을 용이하게 실 시할 수 있도록 바람직한 실시예를 상세히 설명한다. 다만, 본 발명의 바람직한 실시예를 상세하게 설명함에 있 어, 관련된 공지 기능 또는 구성에 대한 구체적인 설명이 본 발명의 요지를 불필요하게 흐릴 수 있다고 판단되 는 경우에는 그 상세한 설명을 생략한다. 또한, 유사한 기능 및 작용을 하는 부분에 대해서는 도면 전체에 걸쳐 동일한 부호를 사용한다. 덧붙여, 명세서 전체에서, 어떤 부분이 다른 부분과 '연결'되어 있다고 할 때, 이는 '직접적으로 연결'되어 있 는 경우뿐만 아니라, 그 중간에 다른 소자를 사이에 두고 '간접적으로 연결'되어 있는 경우도 포함한다. 또한, 어떤 구성요소를 '포함'한다는 것은, 특별히 반대되는 기재가 없는 한 다른 구성요소를 제외하는 것이 아니라 다른 구성요소를 더 포함할 수 있다는 것을 의미한다. 도 1은 본 발명의 일 실시예에 따른 모양 색인 기반 달걀 성별 감지 장치를 도시한 도면이다. 도 1을 참고하면, 본 발명의 장치는 부하기의 상단에 설치되어, 부하기에 놓여진 다수의 달걀을 동시 촬영하는 3차원 카메라, 부하기 영상으로부터 다수의 달걀 각각을 검출 및 추출하여 다수의 달걀 영상(이미지, 사진 등)을 획득하는 개별 영상 추출부, 달걀 영상 각각의 2차원 및 3차원 모양 색인을 산출하는 모양 색인 산 출부, 달걀의 2차원 및 3차원 모양 색인과 성별간의 상관관계가 사전 학습된 인공 신경망을 이용하여 달걀 의 2차원 및 3차원 모양 색인에 상응하는 성별을 예측한 후, 예측 정보를 획득 및 통보하는 성별 예측부 등을 포함한다. 이하, 도 2 내지 도 5를 참고하여 본 발명의 시스템에 따른 모양 색인 기반 달걀 성별 감지 방법을 설명하기로 한다. 도 2는 본 발명의 일 실시예에 따른 모양 색인 기반 달걀 성별 감지 방법을 도시한 도면이다. 부하기 촬영 단계(S1) 본 발명에서는 3차원 카메라를 스트레오(Stereo-type) 카메라, ToF(Time-of-flight) 카메라, 또는 라이다 (Lidar) 카메라 등으로 구현한 후, 이를 다수의 달걀이 놓여있는 부화기의 상단에 설치하도록 한다. 이때, 달걀 은 장축이 지면에 수평되도록 눕혀진 상태인 것이 바람직하나, 이에 한정될 필요는 없다. 그리고 부화기의 상단에 설치된 3차원 카메라를 통해 달걀 각각의 입체감을 탑-뷰(Top-view) 형태로 촬영 하여, RGB 영상과 깊이 정보로 구성된 3차원 영상을 획득한다. 개별 달걀 영상 획득 단계(S2) 개별 영상 추출부는 부하기 영상(특히, RGB 영상)와 달걀 영역 마스킹 결과간 상관관계가 사전 학습된 객 체분할(Object Segmentation) 딥러닝 네트워크를 구비한다. 이때, 객체분할 딥러닝 네트워크는 다양한 형태와 성별을 가지는 달걀을 촬영한 RGB 영상을 입력 정보로 가지고, 이에 상응하는 달걀 영역 마스킹 결과를 출력 정보로 가지는 데이터를 학습함으로써, RGB 영상과 달걀 영역 마스킹 결과간 상관관계가 사전 학습할 수 있게 된다. 이러한 상태에서, 개별 영상 추출부는 3차원 카메라가 부하기 영상을 획득하면, 부하기 영상에 대한 노이즈 제거, 왜곡보정, 평면화 등의 전처리 작업을 수행하여 객체분할 딥러닝 네트워크가 인식 및 분석가능한 데이터 형태로 만든다. 그리고 객체분할 딥러닝 네트워크를 통해 도 3과 같이 촬영된 RGB 영상 내에서 배경과 개별 달걀들이 차지하고 있는 픽셀을 분리하여 마스킹(Masking, 해당 픽셀에 같은 값을 부여)하는 방식으로 부하기 영상내에 존재하는다수의 달걀 영역을 검출한다. 그리고 나서, 달걀 영역의 외곽선에 대응되는 N(N은 자연수)개의 포인트로 구성된 폐곡선 정보와 달걀 영역의 내부 영역에 대응되는 폐곡선 내부 M(M은 N 보다 큰 자연수)개의 픽셀 정보를 달걀 영역 정보로써 획득 및 저장 한다. 관심 달걀 영상 선택 단계(S3) 모양 색인 산출부는 다수의 개별 달걀을 기 설정된 규칙에 따라 하나씩 순차적으로 선택하여 관심 달걀 영 상으로 획득하고, 이의 영상내 위치정보를 획득 및 저장한다. 즉, 다수의 개별 달걀을 하나씩 선택하여 모양 색 인 및 성별 예측 동작을 순차적으로 수행하도록 한다. 2차원 및 3차원 모양 색인 산출 단계(S4) 2차원 모양 색인 계산 관심 달걀 영상의 폐곡선을 구성하는 픽셀의 3차원 z좌표를 2차원 평면의 z-좌표로 변환하고(투영), 2차원 평면 의 z-좌표를 폐곡선을 구성하는 점들의 평균 z-좌표를 통해 산출한다. 그리고 2차원 평면에 투영된 폐곡선으로부터 다양한 장축과 단축을 추출하고, 이에 기반하여 도 3의 (a)에 도시 된 바와 같은 다양한 2차원 모양 색인 정보를 산출한다. 산출하는 것을 특징으로 한다. 2차원 평면에 투영된 폐곡선으로부터 추출되는 장축과 단축에 기반하여 2차원 모 양 색인 정보를 산출하고, 달걀의 3차원 표면적으로부터 추출되는 장곡선과 단곡선에 기반하여 3차원 모양 색인 을 예를 들어, 달걀의 가장 긴 세로 길이인 세로 장축(a)을 가장 긴 가로 길이인 가로 장축(b)으로 나눈 값 (SI21=a/b), 세로 장축(a)과 가로 장축(b)의 교차점(o)을 기준으로 세로 장축(a) 두 끝점과의 길이 중 짧은 선(d)을 세로 장축(a)과 가로 장축(b)의 교차점(o)을 기준으로 세로 장축(a) 두 끝점과의 길이 중 긴 선(c)으로 나눈 값(SI22=d/c), 세로 장축(a)과 가로 장축(b)의 교차점(o)을 기준으로 가로 장축(b) 두 끝점과의 길이 중 짧은 선(e)을 세로 장축(a)과 가로 장축(b)의 교차점(o)을 기준으로 가로 장축(b) 두 끝점과의 길이 중 긴 선(f)으로 나눈 값(SI23=f/b), c를 이등분한 지점의 가로 길이(h)를 가로 장축(b)로 나눈 값(SI24=h/b), 달걀 2차원 면적(SI21=j)을 달걀 2차원 둘레(i)로 나눈 값 (SI2k=j/i) 등이 2차원 모양 색인 정보로써 산출 될 수 있으나, 이에 한정될 필요는 없다. 3차원 모양 색인 계산 3차원 표면적은 폐곡선을 구성하는 픽셀 및 내부 픽셀의 3차원 실제 위치정보로부터 계산된다. 3차원 포인트(실제 좌표 값)들은 Open 3D등의 Library, Voronoi Tessellation, Delaunay Triangulation 등의 방법을 통해 삼각형 격자망을 형성한다. 격자망을 구성하는 개별 삼각형 요소들은 한 평면 상에 놓여 있기 때문에 면적을 구할 수 있고, 계산된 모든 삼 각형 면적을 더해 최종적으로 3차원 표면적이 계산될 수 있다. 그리고 달걀의 3차원 표면적으로부터 다양한 장곡선과 단곡선을 추출하고, 이에 기반하여 도 3의 (b)에 도시된 바와 같은 다양한 3차원 모양 색인 정보를 산출한다. 예를 들어, 달걀의 가장 긴 세로 길이인 세로 장축(a')을 가장 긴 가로 길이인 가로 장축(b')으로 나눈 값 (SI31=a'/b'), 세로 장축(a')과 가로 장축(b')의 교차점(o')을 기준으로 세로 장축(a') 두 끝점과의 길이 중 짧은 선(d')을 세로 장축(a')과 가로 장축(b')의 교차점(o')을 기준으로 세로 장축(a') 두 끝점과의 길이 중 긴 선(c')으로 나눈 값(SI32=d'/c'), 세로 장축(a')과 가로 장축(b')의 교차점(o')을 기준으로 가로 장축 (b') 두 끝점과의 길이 중 짧은 선(e')을 세로 장축(a')과 가로 장축(b')의 교차점(o')을 기준으로 가로 장축 (b') 두 끝점과의 길이 중 긴 선(f')으로 나눈 값(SI33=f'/b'), c'를 이등분한 지점의 가로 길이(h')를 가 로 장축(b')로 나눈 값(SI34=h'/b'), 달걀 2차원 면적(SI21=j')을 달걀 2차원 둘레(i')로 나눈 값 (SI3k=j'/i') 등이 3차원 모양 색인 정보로써 산출될 수 있으나, 이에 한정될 필요는 없다. 성별 예측 단계(S5) 성별 예측부는 2차원 및 3차원 모양 색인을 포함한 부화일수, 달걀 무게, 달걀 표면거칠기 등과 성별간 상 관관계가 사전 학습된 인공 신경망을 구비한다. 인공 신경망은 도 4에 도시된 바와 같이, 입력층, 은닉층 및 출력층으로 구성되는 다층 퍼셉트론(Multi-layer Perceptron, Deep Neural Network) 또는 트리 기반 머신러닝 모델(Tree-based Model)로 구현될 수 있다. 이는 2차원 및 3차원 모양 색인을 기본 포함하되 부하일수, 달걀 무게, 달걀 표면 거칠기 중 적어도 하나를 더 포함할 수 있는 입력 정보와 성별 정보를 출력 정보를 가지는 다수의 학습 데이터를 반복 학습하면서 하이퍼파 라미터를 최적화함으로써, 2차원 및 3차원 모양 색인과 성별간 상관 관계를 사전 학습할 수 있다. 다만, 학습 데이터는 과적합(Over-fitting)을 방지하기 위해, 최대한 많은 데이터가 존재해야 하며, 성별감지의 높은 정확도를 위해 다양한 모양 색인의 학습 데이터가 수집되어야 한다. 그리고 학습 완료된 다층 퍼셉트론을 통해 관심 달걀 영상의 2차원 및 3차원 모양 색인에 상응하는 성별 정보를 획득한 후, 관심 달걀 영상의 위치 정보와 성별 정보를 1:1 매핑하여 저장하도록 한다. 종료 여부 확인 단계(S6) 관심 달걀 영상의 성별 확인이 완료되면, 모양 색인 산출부는 다음의 관심 달걀 영상을 선택하여 2차원 및 3차원 모양 색인 산출 단계(S4)로 재진입하도록 한다. 반면, 모든 개별 달걀에 대한 성별 감지가 완료되어 더 이상의 관심 달걀 영상이 없으면, 해당 부하기에 대한 성별 감지 동작이 완료되었음을 사용자 통보하고 동작 종료하도록 한다. 즉, 본 발명은 2차원 및 3차원 모양 색인과 같이 달걀 영상의 형상에 대한 정보를 보다 상세하고 다양하게 획 득한 후, 이를 인공지능 방식으로 분석하여 달걀의 파괴나 손상없이 성별을 감지할 수 있도록 한다. 더하여 본 발명은 달걀을 하나씩 위치시켜 상기의 성별 감지 동작을 수행하지 않고, 다수의 달걀이 부하기에 위 치되는 상태 그대로 달걀 각각의 성별 감지 동작을 수행할 수 있도록 함으로써, 더 많은 달걀의 성별을 보다 편 리하고 신속하게 감지할 수 있도록 한다. 도 6은 본 발명의 일 실시예에 따른 달걀 성별 감지 결과 안내 방법을 설명하기 위한 도면이다. 앞서 설명한 바와 같이, 본 발명은 다수의 달걀이 부하기에 위치되는 상태 그대로 달걀 각각의 성별 감지 동작 을 수행하므로, 어떤 달걀이 어떤 성별을 가지를 사용자에게 직관적으로 안내할 수 있어야 한다. 이에 본 발명에서는 성별 감지 동작을 수행할 관심 달걀 영상을 선택할 때 영상 내 위치 정보를 추가로 획득 및 저장하도록 한다. 그리고 이들 정보에 기반하여 달걀 영상 각각의 위치 정보과 성별 감지 결과를 1:1 대응시켜 사용자에게 안내해 줌으로써, 사용자의 어떤 달걀이 어떤 성별을 가지를 사용자에게 직관적으로 파악할 수 있도록 한다. 예를 들어, 도 6의 (a)와 같이 달걀 영상 각각의 위치 정보에 따라 성별 감지 결과 표시 위치를 결정한 후, 이 를 반영하여 부하기 영상에 달걀 영상 각각의 성별 감지 결과를 중첩해 표시하거나, 도 6의 (b)와 같이 달걀 영 상 각각의 위치 정보과 성별 감지 결과를 리스트 형식으로 안내하거나, 또는 이들 방식을 조합하여 안내할 수도 있도록 한다. 더하여, 수평아리 감지 위치를 통보하기 위한 영상(예를 들어, 바운딩 박스)를 추가 생성하여 성별 감지 결과와 함께 표시함으로써, 사용자가 수평아리 위치를 더욱 신속하고 정확하게 인지할 수도 있도록 한다. 이상에서는 본 발명의 바람직한 실시예에 대하여 도시하고 설명하였지만, 본 발명은 상술한 특정의 실시예에 한 정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어남이 없이 당해 발명이 속하는 기술 분야에서 통상의 지식을 가진 자에 의해 다양한 변형 실시가 가능한 것은 물론이고, 이러한 변형 실시들은 본 발명의 기 술적 사상이나 전망으로부터 개별적으로 이해되어서는 안 될 것이다.도면 도면1 도면2 도면3 도면4 도면5 도면6"}
{"patent_id": "10-2023-0135178", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 모양 색인 기반 달걀 성별 감지 장치를 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 모양 색인 기반 달걀 성별 감지 방법을 도시한 도면이다. 도 3은 본 발명의 일 실시예에 따른 객체분할 딥러닝 네트워크를 설명하기 위한 도면이다. 도 4는 본 발명의 일 실시예에 따른 2차원 및 3차원 모양 색인 산출 단계를 설명하기 위한 도면이다. 도 5는 본 발명의 일 실시예에 따른 다층 퍼셉트론을 설명하기 위한 도면이다. 도 6은 본 발명의 일 실시예에 따른 달걀 성별 감지 결과 안내 방법을 설명하기 위한 도면이다."}
