{"patent_id": "10-2024-0068321", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2025-0010525", "출원번호": "10-2024-0068321", "발명의 명칭": "센서 데이터를 활용한 운동 자세 평가 시스템 및 방법", "출원인": "주식회사 에이아이비즈", "발명자": "하승재"}}
{"patent_id": "10-2024-0068321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "센서 데이터를 활용한 운동 자세 평가 시스템에 있어서,소정의 공간에서 진행되는 운동 심사에 참가한 응시자의 자세를 스캔함에 따라 적어도 하나의 센서 데이터를 생성하는 적어도 하나의 센서 모듈; 및기 학습된 인공지능 모델 - 상기 기 학습된 인공지능 모델은 객체를 포함하고 객체에 대한 좌표 정보가 레이블링된 복수의 센서 데이터를 학습 데이터로 하여 학습된 모델로, 특정 센서 데이터를 입력 데이터로 하여 특정센서 데이터에 포함된 객체에 대응하는 좌표 정보를 추출하는 모델임 - 을 이용하여, 상기 센서 모듈로부터 생성된 상기 센서 데이터를 분석함에 따라 상기 응시자에 대한 점수를 산출하는 서버;를 포함하고,상기 센서 모듈은 소정의 공간 내에 설치되며, 서로 다른 각도로 촬영하는 복수의 카메라 모듈을 포함하고,상기 센서 데이터는 적어도 하나의 영상 데이터를 포함하고,상기 영상 데이터는 상기 카메라 모듈이 상기 소정의 공간을 촬영함에 따라 생성되는 복수의 프레임을포함하고,기 설정된 기준 데이터는 동작에 소요되는 시간 정보가 기 설정되고, 기 설정된 시계열 데이터를 신체 부위 별로 포함하고,상기 서버는,상기 복수의 프레임에서 상기 응시자에 대한 스켈레톤 정보를 추출하고, 추출된 상기 스켈레톤 정보를 이용해서상기 응시자의 자세 정보를 생성하고, 생성된 상기 응시자의 자세 정보와 상기 기준 데이터에 의거하여 상기 응시자에게 점수를 부여하고,상기 프레임 간격을 이용해서 상기 응시자의 동작에 소요되는 시간 정보를 생성하고, 상기 응시자의 시간 정보와 상기 기준 데이터의 시간 정보를 고려하여 응시자에게 점수를 부여하고,상기 스켈레톤 정보를 이용해서 상기 응시자의 신체 각도를 상기 자세 정보로서 산출하고, 시간에 따라 변화하는 신체 각도의 정보가 포함된 상기 응시자의 시계열 데이터를 신체 부위 별로 생성하고, 신체 부위 별로 상기응시자의 시계열 데이터와 기준 데이터를 비교한 결과에 의거하여 응시자에게 신체 부위 별로 점수를 부여하고,상기 서버는,상기 운동 심사가 품새 심사인 경우, 상기 스켈레톤 정보를 이용하여 상기 응시자의 신체 각도의 변화량을 산출하고, 상기 산출된 신체 각도의 변화량을 통해 상기 응시자의 동작들을 인식하되, 상기 인식된 동작들이 시작된프레임과 상기 인식된 동작이 종료된 프레임의 간격을 이용하여 상기 인식된 동작들을 시간별로 분류하고, 상기시간별로 분류된 동작들을 상기 품새에 포함된 복수의 동작 중 어느 하나의 동작으로 분류하고,상기 기준 데이터는 이상적인 품새 동작에서의 시간 별 신체 각도를 포함하고,상기 시간별로 분류된 동작들과 상기 기준 데이터에 포함된 이상적인 품새 동작에서의 시간 별 신체 각도가 일치하는 정도를 기반으로 상기 응시자에게 동작 별로 점수를 부여하고,상기 서버는,상기 응시자의 신체 각도를 상기 프레임 단위로 산출하고, 상기 프레임 간격을 이용해서 시간에 따라 변화하는신체 각도의 변화량이 포함된 응시자의 시계열 데이터를 생성하고,상기 생성된 시계열 데이터에 포함된 시간에 따라 변화하는 신체 각도의 변화량과 상기 기준 데이터에 포함된시간에 따라 변화하는 신체 각도의 변화량을 비교하여 상기 응시자에게 점수를 부여하고,상기 서버는,상기 복수의 카메라 모듈로부터 생성된 복수의 프레임 각각으로부터 상기 스켈레톤 정보를 추출하고, 상기 스켈공개특허 10-2025-0010525-3-레톤 정보를 병합하여 상기 응시자의 3차원 좌표 정보를 상기 자세 정보로서 생성하고, 상기 기준 데이터는 기 설정된 3차원 좌표 정보를 포함하고,상기 응시자의 3차원 좌표 정보와 기준 데이터를 비교한 결과에 의거하여 응시자에게 점수를 부여하고,상기 서버는,시간에 따른 3차원 좌표 변화량이 포함된 상기 응시자의 3차원 좌표 정보를 생성하고,상기 기준 데이터는 시간에 따른 3차원 좌표 변화량이 포함된 기 설정된 3차원 좌표 정보를 포함하고,상기 응시자의 3차원 좌표 정보에 포함된 시간에 따른 3차원 좌표 변화량과 상기 기준 데이터의 기 설정된 3차원 좌표 정보에 포함된 시간에 따른 3차원 좌표 변화량을 비교하여 응시자에게 점수를 부여하는,센서 데이터를 활용한 운동 자세 평가 시스템."}
{"patent_id": "10-2024-0068321", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "센서 데이터를 활용한 운동 자세를 평가하는 방법에 있어서,적어도 하나의 센서 모듈을 통해 소정의 공간에서 진행되는 운동 심사에 참가한 응시자의 자세를 스캔함에 따라적어도 하나의 센서 데이터를 생성하는 단계; 및서버에 기록된 기 학습된 인공지능 모델 - 상기 기 학습된 인공지능 모델은 객체를 포함하고 객체에 대한 좌표정보가 레이블링된 복수의 센서 데이터를 학습 데이터로 하여 학습된 모델로, 특정 센서 데이터를 입력 데이터로 하여 특정 센서 데이터에 포함된 객체에 대응하는 좌표 정보를 추출하는 모델임 - 을 이용하여, 상기 센서모듈로부터 생성된 적어도 하나의 센서 데이터를 분석한 결과에 기초하여 상기 응시자에 대한 점수를 산출하는단계;를 포함하고,상기 센서 모듈은 소정의 공간 내에 설치되며, 서로 다른 각도로 촬영하는 복수의 카메라 모듈을 포함하고,상기 센서 데이터는 적어도 하나의 영상 데이터를 포함하고,상기 영상 데이터는 상기 카메라 모듈이 상기 소정의 공간을 촬영함에 따라 생성되는 복수의 프레임을포함하고,기 설정된 기준 데이터는 동작에 소요되는 시간 정보가 기 설정되고, 기 설정된 시계열 데이터를 신체 부위 별로 포함하고,상기 점수를 산출하는 단계는,상기 복수의 프레임에서 상기 응시자에 대한 스켈레톤 정보를 추출하고, 추출된 상기 스켈레톤 정보를 이용해서상기 응시자의 자세 정보를 생성하고, 생성된 상기 응시자의 자세 정보와 상기 기준 데이터에 의거하여 상기 응시자에게 점수를 부여하는 단계;상기 프레임 간격을 이용해서 상기 응시자의 동작에 소요되는 시간 정보를 생성하고, 상기 응시자의 시간 정보와 상기 기준 데이터의 시간 정보를 고려하여 응시자에게 점수를 부여하는 단계;상기 스켈레톤 정보를 이용해서 상기 응시자의 신체 각도를 상기 자세 정보로서 산출하고, 시간에 따라 변화하는 신체 각도의 정보가 포함된 상기 응시자의 시계열 데이터를 신체 부위 별로 생성하고, 신체 부위 별로 상기응시자의 시계열 데이터와 기준 데이터를 비교한 결과에 의거하여 응시자에게 신체 부위 별로 점수를 부여하는단계;상기 운동 심사가 품새 심사인 경우, 상기 스켈레톤 정보를 이용하여 상기 응시자의 신체 각도의 변화량을 산출하고, 상기 산출된 신체 각도의 변화량을 통해 상기 응시자의 동작들을 인식하되, 상기 인식된 동작들이 시작된프레임과 상기 인식된 동작이 종료된 프레임의 간격을 이용하여 상기 인식된 동작들을 시간별로 분류하고, 상기시간별로 분류된 동작들을 상기 품새에 포함된 복수의 동작 중 어느 하나의 동작으로 분류하고, 상기 기준 데이터는 이상적인 품새 동작에서의 시간 별 신체 각도를 포함하고, 상기 시간별로 분류된 동작들과 상기 기준 데이터에 포함된 이상적인 품새 동작에서의 시간 별 신체 각도가 일치하는 정도를 기반으로 상기 응시자에게 동작별로 점수를 부여하는 단계;상기 응시자의 신체 각도를 상기 프레임 단위로 산출하고, 상기 프레임 간격을 이용해서 시간에 따라 변화하는공개특허 10-2025-0010525-4-신체 각도의 변화량이 포함된 응시자의 시계열 데이터를 생성하고, 상기 생성된 시계열 데이터에 포함된 시간에따라 변화하는 신체 각도의 변화량과 상기 기준 데이터에 포함된 시간에 따라 변화하는 신체 각도의 변화량을비교하여 상기 응시자에게 점수를 부여하는 단계; 및상기 복수의 카메라 모듈로부터 생성된 복수의 프레임 각각으로부터 상기 스켈레톤 정보를 추출하고, 상기 스켈레톤 정보를 병합하여 상기 응시자의 3차원 좌표 정보를 상기 자세 정보로서 생성하고, 상기 기준 데이터는 기설정된 3차원 좌표 정보를 포함하고, 상기 응시자의 3차원 좌표 정보와 기준 데이터를 비교한 결과에 의거하여응시자에게 점수를 부여하는 단계를 포함하며,상기 응시자의 3차원 좌표 정보와 기준 데이터를 비교한 결과에 의거하여 응시자에게 점수를 부여하는 단계는,시간에 따른 3차원 좌표 변화량이 포함된 상기 응시자의 3차원 좌표 정보를 생성하고, 상기 기준 데이터는 시간에 따른 3차원 좌표 변화량이 포함된 기 설정된 3차원 좌표 정보를 포함하고, 상기 응시자의 3차원 좌표 정보에포함된 시간에 따른 3차원 좌표 변화량과 상기 기준 데이터의 기 설정된 3차원 좌표 정보에 포함된 시간에 따른3차원 좌표 변화량을 비교하여 응시자에게 점수를 부여하는 단계를 포함하는,센서 데이터를 활용한 운동 자세 평가 방법."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "센서 데이터를 활용한 운동 자세 평가 시스템 및 방법이 제공된다. 본 발명의 다양한 실시예에 따르면, 소정의 공간에서 진행되는 운동 심사에 참가한 응시자의 자세를 스캔함에 따라 적어도 하나의 센서 데이터를 생성하는 적어도 하나의 센서 모듈 및 기 학습된 인공지능 모델을 이용하여, 상기 센서 모듈로부터 생성된 상기 센서 데이 터를 분석함에 따라 상기 응시자에 대한 점수를 산출하는 서버를 포함한다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명의 다양한 실시예는 영상 및 센서 데이터를 활용한 운동 자세 판단 시스템 및 방법에 관한 것이다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "태권도는 대한민국에서 창안되고 발전한 현대 무술로, 맨 손과 맨 발을 이용해 공격 또는 방어하는 무도이다. 또한 태권도는, 빠르고 강력한 발차기 기술을 특징으로 하는 현대에 형성된 전통무예 무술이다. 또한, 태권도는 1988년 하계 올림픽에서 시범 종목으로 채택되었고, 2000년 하계 올림픽부터 정식 종목으로 채택되었다. 태권도는 크게 품새(형), 겨루기(대련) 및 격파(단련)로 구분될 수 있다. 이 중 품새는 공격과 방어의 기본기들 을 일정 순서로 배열하여 가상의 상대와 겨루는 연습을 하는 수련 방식 또는 경기를 의미한다. 품새의 종류로 태극 1장 ~ 8장, 고려, 금강, 태백, 평원, 십진, 지태, 천권, 한수, 일여 등이 있다. 현재 국기원에서는 응시자의 품새 자세의 정확도. 숙련도, 균형을 평가하고, 이 평가를 기반으로 승단 심사가 이루어진다. 구체적으로, 승단 심사에서는 심사평가위원이 완성도(예를 들어, 품새 완결, 정확성, 공방목표, 자 세의 굴신), 숙련도(예를 들어, 속도의 완급, 몸의 중심이동, 힘의 강유, 기의 집중, 호흡, 기합), 품위(예를 들어, 태도, 예절, 차림새) 등의 평가요소를 각각 평가한다. 승단 심사를 위한 품새의 평가에서 정확성과 공정성을 위해 복수(3인 이상)의 심사평가위원이 관여하지만, 육안 으로만 응시자를 평가하기 때문에, 응시자의 동작과 자세를 정확하게 평가하기 어려운 점이 있다. 구체적으로 응시자의 자세를 정확히 평가하기 위해서는 응시자의 동작 중에 신체 각도를 정확하게 파악하여 이 를 이상적인 품새 자세에 비교해야 하지만, 도복에 응시자의 신체 관절이 가려져 있기 때문에, 눈대중으로 신체 각도를 파악할 수 밖에 없으며, 설혹 신체 각도를 파악했다 하더라도 이를 이상적인 신체 각도에 비교 판단하기 어렵다. 또한, 통상의 승단심사에서, 8인 이하 또는 6인 이하(최소 6인 이상 다수)의 응시자가 동시에 품새 동작을 시연 하기 때문에, 복수의 심사평가위원이 투입되다 하더라도 응시자의 동작을 순간적으로 놓치는 상황이 발생할 수 있다. 더욱이 품새의 시연 속도, 중심 이동, 연결성 등은 응시자가 연속적으로 동작하는 평가요소에 해당하고, 응시자의 동작을 놓치게 되면 이러한 평가요소를 평가할 수 없게 된다. 따라서, 복수의 응시자가 동시에 품새를 시연하게 되면 부정확한 평가가 나올 수 밖에 없다 결론적으로, 인간의 육안으로만 품새의 동작을 평가하는 현재의 시스템에서는, 휴먼 에러의 발생 가능성을 완전 히 배제하기 어렵다는 문제가 있다. 대한민국의 국기인 태권도의 승(품)단 심사제도를 AI알고리즘을 통해 국기 원에서 제정한 심사 규정에 맞춰 다수의 응시자를 심사하는 과정을 보다 체계적이고, 효율적으로 운영하며, 그 에 따른 심사결과 정보를 신속하고, 정확하게 공표한 이후 응시자의 이의제기 등은 심사영상판독 시스템을 적용 하여 완성도를 확립한다. 본 솔루션은 국기원의 승(품)단 심사제도을 비롯하여 국기원에 등록된 국가 별 태권도관련 단체의 승(품)단 심사제도를 통합 평준화하기 위한 과제임을 알 수 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 한국등록특허 제10-2244696호 (2021.04.26.)"}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명이 해결하고자 하는 과제는 상술된 종래의 문제점을 해결하기 위한 것이다. 구체적으로, 경기장에 설치 된 적어도 하나의 센서 모듈을 통해 응시자의 동작과 자세를 스캔함에 따라 적어도 하나의 센서 데이터를 생성 하고, 서버에 저장된 인공지능 모델이 센서 데이터를 분석하여 응시자들에 대한 점수를 산출한다. 이와 같이 스포츠 동작과 자세에 대한 평가(경기, 심사)를 서버(인공지능)가 판단함으로써, 보다 정확하게 응시 자의 동작과 자세를 인식하고 평가함에 따라 휴먼 에러를 배제할 수 있다. 본 발명이 해결하고자 하는 과제들은 이상에서 언급된 과제로 제한되지 않으며, 특히 태권도에 국한되지 않고, 선수의 동작과 자세를 평가하는 다른 스포츠 경기(예를 들어, 기계체조, 피겨 스케이팅 등)에도 본 과제가 적용 될 수 있다. 또한 언급되지 않은 또 다른 과제들은 아래의 기재로부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "상술한 과제를 해결하기 위한 본 발명의 일 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 시스템에 있어 서, 소정의 공간에서 진행되는 운동 심사에 참가한 응시자의 자세를 스캔함에 따라 적어도 하나의 센서 데이터 를 생성하는 적어도 하나의 센서 모듈; 및 기 학습된 인공지능 모델을 이용하여, 상기 센서 모듈로부터 생성된 상기 센서 데이터를 분석함에 따라 상기 응시자에 대한 점수를 산출하는 서버;를 포함한다. 다양한 실시예에서, 상기 센서 모듈은 소정의 공간 내에 설치되는 적어도 하나의 카메라 모듈을 포함하고, 상기 센서 데이터는 적어도 하나의 영상 데이터를 포함하고, 상기 영상 데이터는 상기 카메라 모듈이 상기 소정의 공 간을 촬영함에 따라 생성되는 복수의 프레임을 포함하고, 상기 서버는 상기 복수의 프레임 각각으로부터 상기 응시자에 대한 스켈레톤 정보를 추출하고, 추출된 상기 스켈레톤 정보를 이용해서 상기 응시자의 자세 정보를 생성하고, 생성된 상기 응시자의 자세 정보와 기 설정된 기준 데이터에 의거하여 상기 응시자에게 점수를 부여 할 수 있다. 다양한 실시예에서, 상기 서버는 상기 스켈레톤 정보를 이용하여 상기 자세 정보로서 상기 응시자의 신체 각도 를 산출하고, 상기 신체 각도를 기반으로 상기 응시자의 동작을 분류하고, 상기 기준 데이터는 분류된 상기 동 작에 관한 기 설정된 신체 각도 정보를 포함하고, 상기 서버는 분류된 상기 동작에서의, 상기 응시자의 신체 각 도와 기준 데이터의 신체 각도를 비교한 결과에 의거하여 응시자에게 점수를 부여할 수 있다. 다양한 실시예에서, 상기 서버는, 상기 프레임 간격을 이용해서 상기 응시자의 동작에 소요되는 시간 정보를 생 성하고, 상기 기준 데이터에는 동작에 소요되는 시간 정보가 기 설정되고, 상기 서버는 상기 응시자의 시간 정 보와 상기 기준 데이터의 시간 정보를 고려하여 응시자에게 점수를 부여할 수 있다. 다양한 실시예에서, 상기 서버는, 상기 스켈레톤 정보를 이용해서 상기 응시자의 신체 각도를 상기 자세 정보로 서 산출하고, 시간에 따라 변화하는 신체 각도의 정보가 포함된 상기 응시자의 시계열 데이터를 신체 부위 별로 생성하고, 상기 기준 데이터는 기 설정된 시계열 데이터를 신체 부위 별로 포함하고, 상기 서버는, 신체 부위 별로 상기 응시자의 시계열 데이터와 기준 데이터를 비교한 결과에 의거하여 응시자에게 점수를 부여할 수 있다. 다양한 실시예에서, 상기 서버는, 상기 응시자의 신체 각도를 상기 프레임 단위로 산출하고, 상기 프레임 간격 을 이용해서 시간에 따라 변화하는 신체 각도의 변화량이 포함된 응시자의 시계열 데이터를 생성할 수 있다.다양한 실시예에서, 상기 센서 모듈은 상기 소정의 공간을 서로 다른 각도로 촬영하는 복수의 카메라 모듈을 포 함하고, 상기 서버는, 서로 다른 카메라 모듈로부터 생성된 복수의 프레임 각각으로부터 상기 스켈레톤 정보를 추출하고, 상기 스켈레톤 정보를 병합하여 상기 응시자의 3차원 좌표 정보를 생성하고, 상기 기준 데이터는 기 설정된 3차원 좌표 정보를 포함하고, 상기 응시자의 3차원 좌표 정보와 기준 데이터를 비교한 결과에 의거하여 응시자에게 점수를 부여할 수 있다. 다양한 실시예에서, 상기 서버는 시간에 따른 좌표 변화량이 포함된 상기 응시자의 3차원 좌표 정보를 생성하고, 상기 기준 데이터는 시간에 따른 좌표 변화량이 포함된 기 설정된 3차원 좌표 정보를 포함할 수 있다. 다양한 실시예에서, 상기 카메라 모듈은 복수의 응시자를 동시에 촬영하고, 상기 서버는 상기 영상 데이터로부 터 복수의 응시자 각각을 인식하고, 각 응시자에 대한 점수를 독립적으로 산출할 수 있다. 상술한 과제를 해결하기 위한 본 발명의 다른 실시예에 따른 센서 데이터를 활용한 운동 자세를 평가하는 방법 에 있어서, 적어도 하나의 센서 모듈을 통해 소정의 공간에서 진행되는 운동 심사에 참가한 응시자의 자세를 스 캔함에 따라 적어도 하나의 센서 데이터를 생성하는 단계; 및 서버에 기록된 기 학습된 인공지능 모델을 이용하 여, 상기 센서 모듈로부터 생성된 적어도 하나의 센서 데이터를 분석한 결과에 기초하여 상기 응시자에 대한 점 수를 산출하는 단계;를 포함할 수 있다. 본 발명의 기타 구체적인 사항들은 상세한 설명 및 도면들에 포함되어 있다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명의 다양한 실시예에 따르면, 소정의 공간에 설치된 적어도 하나의 센서 모듈을 통해 응시자의 동작과 자 세를 스캔함에 따라 복수의 센서 데이터를 생성하고, 이를 분석하여 응시자들에 대한 점수를 산출한다. 이에 따라, 복수의 응시자가 승단심사에 참가하더라도 응시자마다 객체를 검출하고 판단하기 때문에, 평가심사 위원이 순간적으로 응시자의 동작을 놓치더라도 놓친 동작을 누락되지 않고 정확하게 평가할 수 있다. 또한, 응시자의 신체 각도를 기반으로 동작을 판단하기 때문에 기존의 육안으로 평가하는 것 보다 높은 평가의 정확성을 확보할 수 있다. 또한, 서버를 통해서 센서 모듈의 영상 데이터를 분석하기 때문에 판정의 논란을 줄일 수 있고, 응시자의 이의 제기시 각 항목의 점수의 근거를 명확하게 제시할 수 있기 때문에 판정의 높은 공정성을 기대할 수 있다. 또한, 응시자의 신체 각도와 동작에 소요되는 시간을 기반으로 자세를 판단하기 때문에 기존의 육안으로 평가하 는 것 보다 높은 정확성을 확보할 수 있다. 또한, 응시자의 자세를 이상적인 자세에 대비하여 평가하기 때문에 객관적인 심사 평가가 가능하다. 결과적으로, 본 발명의 다양한 실시예에 따르면, 심사 평가에서 휴먼 에러를 배제할 수 있다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 2, "content": "본 발명의 효과들은 이상에서 언급된 효과로 제한되지 않으며, 언급되지 않은 또 다른 효과들은 아래의 기재로 부터 통상의 기술자에게 명확하게 이해될 수 있을 것이다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 3, "content": "본 발명의 효과는 특히 태권도 승단심사에 국한되지 않고, 선수의 동작과 자세를 평가하는 다른 스포츠 경기(예 를 들어, 기계체조, 피겨 스케이팅 등)에서도 동일하게 발휘될 수 있다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "본 발명의 이점 및 특징, 그리고 그것들을 달성하는 방법은 첨부되는 도면과 함께 상세하게 후술되어 있는 실시 예들을 참조하면 명확해질 것이다. 그러나, 본 발명은 이하에서 개시되는 실시예들에 제한되는 것이 아니라 서 로 다른 다양한 형태로 구현될 수 있으며, 단지 본 실시예들은 본 발명의 개시가 완전하도록 하고, 본 발명이 속하는 기술 분야의 통상의 기술자에게 본 발명의 범주를 완전하게 알려주기 위해 제공되는 것이며, 본 발명은 청구항의 범주에 의해 정의될 뿐이다. 본 명세서에서 사용된 용어는 실시예들을 설명하기 위한 것이며 본 발명을 제한하고자 하는 것은 아니다. 본 명 세서에서, 단수형은 문구에서 특별히 언급하지 않는 한 복수형도 포함한다. 명세서에서 사용되는 \"포함한다 (comprises)\" 및/또는 \"포함하는(comprising)\"은 언급된 구성요소 외에 하나 이상의 다른 구성요소의 존재 또는 추가를 배제하지 않는다. 명세서 전체에 걸쳐 동일한 도면 부호는 동일한 구성 요소를 지칭하며, \"및/또는\"은 언급된 구성요소들의 각각 및 하나 이상의 모든 조합을 포함한다. 비록 \"제1\", \"제2\" 등이 다양한 구성요소들을 서술하기 위해서 사용되나, 이들 구성요소들은 이들 용어에 의해 제한되지 않음은 물론이다. 이들 용어들은 단 지 하나의 구성요소를 다른 구성요소와 구별하기 위하여 사용하는 것이다. 따라서, 이하에서 언급되는 제1 구성 요소는 본 발명의 기술적 사상 내에서 제2 구성요소일 수도 있음은 물론이다. 다른 정의가 없다면, 본 명세서에서 사용되는 모든 용어(기술 및 과학적 용어를 포함)는 본 발명이 속하는 기술 분야의 통상의 기술자에게 공통적으로 이해될 수 있는 의미로 사용될 수 있을 것이다. 또한, 일반적으로 사용되 는 사전에 정의되어 있는 용어들은 명백하게 특별히 정의되어 있지 않는 한 이상적으로 또는 과도하게 해석되지 않는다. 명세서에서 사용되는 \"부\" 또는 “모듈”이라는 용어는 소프트웨어, FPGA 또는 ASIC과 같은 하드웨어 구성요소 를 의미하며, \"부\" 또는 “모듈”은 어떤 역할들을 수행한다. 그렇지만 \"부\" 또는 “모듈”은 소프트웨어 또는 하드웨어에 한정되는 의미는 아니다. \"부\" 또는 “모듈”은 어드레싱할 수 있는 저장 매체에 있도록 구성될 수 도 있고 하나 또는 그 이상의 프로세서들을 재생시키도록 구성될 수도 있다. 따라서, 일 예로서 \"부\" 또는 “모 듈”은 소프트웨어 구성요소들, 객체지향 소프트웨어 구성요소들, 클래스 구성요소들 및 태스크 구성요소들과 같은 구성요소들과, 프로세스들, 함수들, 속성들, 프로시저들, 서브루틴들, 프로그램 코드의 세그먼트들, 드라 이버들, 펌웨어, 마이크로 코드, 회로, 데이터, 데이터베이스, 데이터 구조들, 테이블들, 어레이들 및 변수들을 포함한다. 구성요소들과 \"부\" 또는 “모듈”들 안에서 제공되는 기능은 더 작은 수의 구성요소들 및 \"부\" 또는 “모듈”들로 결합되거나 추가적인 구성요소들과 \"부\" 또는 “모듈”들로 더 분리될 수 있다. 공간적으로 상대적인 용어인 \"아래(below)\", \"아래(beneath)\", \"하부(lower)\", \"위(above)\", \"상부(upper)\" 등 은 도면에 도시되어 있는 바와 같이 하나의 구성요소와 다른 구성요소들과의 상관관계를 용이하게 기술하기 위 해 사용될 수 있다. 공간적으로 상대적인 용어는 도면에 도시되어 있는 방향에 더하여 사용시 또는 동작시 구성 요소들의 서로 다른 방향을 포함하는 용어로 이해되어야 한다. 예를 들어, 도면에 도시되어 있는 구성요소를 뒤집을 경우, 다른 구성요소의 \"아래(below)\"또는 \"아래(beneath)\"로 기술된 구성요소는 다른 구성요소의 \"위 (above)\"에 놓여질 수 있다. 따라서, 예시적인 용어인 \"아래\"는 아래와 위의 방향을 모두 포함할 수 있다. 구성 요소는 다른 방향으로도 배향될 수 있으며, 이에 따라 공간적으로 상대적인 용어들은 배향에 따라 해석될 수 있 다. 본 명세서에서, 컴퓨터는 적어도 하나의 프로세서를 포함하는 모든 종류의 하드웨어 장치를 의미하는 것이고, 실시 예에 따라 해당 하드웨어 장치에서 동작하는 소프트웨어적 구성도 포괄하는 의미로서 이해될 수 있다. 예 를 들어, 컴퓨터는 스마트폰, 태블릿 PC, 데스크톱, 노트북 및 각 장치에서 구동되는 사용자 클라이언트 및 애 플리케이션을 모두 포함하는 의미로서 이해될 수 있으며, 또한 이에 제한되는 것은 아니다. 이하, 첨부된 도면을 참조하여 본 발명의 실시예를 상세하게 설명한다. 본 명세서에서 설명되는 각 단계들은 컴퓨터에 의하여 수행되는 것으로 설명되나, 각 단계의 주체는 이에 제한 되는 것은 아니며, 실시 예에 따라 각 단계들의 적어도 일부가 서로 다른 장치에서 수행될 수도 있다. 도 1은 본 발명의 일 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 시스템을 도시한 도면이다. 도 1을 참조하면, 본 발명의 일 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 시스템은 서버, 적어 도 하나의 센서 모듈, 사용자 단말, 외부 서버 및 네트워크를 포함할 수 있다. 여기서, 도 1에 도시된 센서 데이터를 활용한 운동 자세 평가 시스템은 하나의 실시예에 따른 것이고, 그 구성 요소가 도 1에 도시된 실시예에 한정되는 것은 아니며, 필요에 따라 부가, 변경 또는 삭제될 수 있다. 일 실시예에서, 서버는 소정의 공간(예컨대, 승단 심사가 진행되는 심사장)에서 진행되는 응시자의 품새 자세를 스캔함에 따라 생성되는 센서 데이터를 분석하여, 승단 심사를 신청한 응시자들에 대한 평가를 진행할 수 있다. 다양한 실시예에서, 서버는 기 학습된 인공지능 모델을 이용하여 적어도 하나의 센서 모듈를 이용하 여 소정의 공간을 스캔함에 따라 생성되는 복수의 센서 데이터를 분석함에 따라 승단 심사를 진행하는 응시자들 에 대한 점수를 산출할 수 있다. 여기서 기 학습된 인공지능 모델은, 객체를 포함하고 객체에 대한 좌표 정보가 레이블링된 복수의 센서 데이터 를 학습 데이터로 하여 학습된 모델로, 특정 센서 데이터를 입력 데이터로 하여 특정 센서 데이터에 포함된 객 체에 대응하는 좌표 정보를 추출하는 모델 즉, 스켈레톤 추출 모델일 수 있다. 그러나, 이에 한정되지 않고, 기 학습된 인공지능 모델은 스켈레톤 추출 모델과 스켈레톤 추출 모델을 통해 추출된 2차원 스켈레톤 정보를 기반 으로 3차원 좌표 정보를 모델링하는 모델, 3차원 좌표 정보를 기반으로 동작 및 자세를 판단하는 모델 및 판단 된 동작 및 자세에 기초하여 점수를 부여하는 룰베이스(rule-base) 모델을 더 포함할 수 있다. 인공지능 모델(예: 신경망)은 하나 이상의 네트워크 함수로 구성되며, 하나 이상의 네트워크 함수는 일반적으로 '노드'라 지칭될 수 있는 상호 연결된 계산 단위들의 집합으로 구성될 수 있다. 이러한 '노드'들은 '뉴런 (neuron)'들로 지칭될 수도 있다. 하나 이상의 네트워크 함수는 적어도 하나 이상의 노드들을 포함하여 구성된 다. 하나 이상의 네트워크 함수를 구성하는 노드(또는 뉴런)들은 하나 이상의 '링크'에 의해 상호 연결될 수 있 다. 인공지능 모델 내에서, 링크를 통해 연결된 하나 이상의 노드들은 상대적으로 입력 노드 및 출력 노드의 관계를 형성할 수 있다. 입력 노드 및 출력 노드의 개념은 상대적인 것으로서, 하나의 노드에 대하여 출력 노드 관계에 있는 임의의 노드는 다른 노드와의 관계에서 입력 노드 관계에 있을 수 있으며, 그 역도 성립할 수 있다. 전술 한 바와 같이, 입력 노드 대 출력 노드 관계는 링크를 중심으로 생성될 수 있다. 하나의 입력 노드에 하나 이상 의 출력 노드가 링크를 통해 연결될 수 있으며, 그 역도 성립할 수 있다. 하나의 링크를 통해 연결된 입력 노드 및 출력 노드 관계에서, 출력 노드는 입력 노드에 입력된 데이터에 기초 하여 그 값이 결정될 수 있다. 여기서 입력 노드와 출력 노드를 상호 연결하는 노드는 가중치(weight)를 가질 수 있다. 가중치는 가변적일 수 있으며, 인공지능 모델이 원하는 기능을 수행하기 위해, 사용자 또는 알고리즘 에 의해 가변될 수 있다. 예를 들어, 하나의 출력 노드에 하나 이상의 입력 노드가 각각의 링크에 의해 상호 연 결된 경우, 출력 노드는 상기 출력 노드와 연결된 입력 노드들에 입력된 값들 및 각각의 입력 노드들에 대응하 는 링크에 설정된 가중치에 기초하여 출력 노드 값을 결정할 수 있다.전술한 바와 같이, 인공지능 모델은 하나 이상의 노드들이 하나 이상의 링크를 통해 상호연결 되어 인공지능 모 델 내에서 입력 노드 및 출력 노드 관계를 형성한다. 인공지능 모델 내에서 노드들과 링크들의 개수 및 노드들 과 링크들 사이의 연관관계, 링크들 각각에 부여된 가중치의 값에 따라, 인공지능 모델의 특성이 결정될 수 있 다. 예를 들어, 동일한 개수의 노드 및 링크들이 존재하고, 링크들 사이의 가중치 값이 상이한 두 인공지능 모 델이 존재하는 경우, 두 개의 인공지능 모델들은 서로 상이한 것으로 인식될 수 있다. 인공지능 모델을 구성하는 노드들 중 일부는, 최초 입력 노드로부터의 거리들에 기초하여, 하나의 레이어 (layer)를 구성할 수 있다. 예를 들어, 최초 입력 노드로부터 거리가 n인 노드들의 집합은, n 레이어를 구성할 수 있다. 최초 입력 노드로부터 거리는, 최초 입력 노드로부터 해당 노드까지 도달하기 위해 거쳐야 하는 링크 들의 최소 개수에 의해 정의될 수 있다. 그러나, 이러한 레이어의 정의는 설명을 위한 임의적인 것으로서, 인공 지능 모델 내에서 레이어의 차수는 전술한 것과 상이한 방법으로 정의될 수 있다. 예를 들어, 노드들의 레이어 는 최종 출력 노드로부터 거리에 의해 정의될 수도 있다. 최초 입력 노드는 인공지능 모델 내의 노드들 중 다른 노드들과의 관계에서 링크를 거치지 않고 데이터가 직접 입력되는 하나 이상의 노드들을 의미할 수 있다. 또는, 인공지능 모델 네트워크 내에서, 링크를 기준으로 한 노 드 간의 관계에 있어서, 링크로 연결된 다른 입력 노드들 가지지 않는 노드들을 의미할 수 있다. 이와 유사하게, 최종 출력 노드는 인공지능 모델 내의 노드들 중 다른 노드들과의 관계에서, 출력 노드를 가지지 않 는 하나 이상의 노드들을 의미할 수 있다. 또한, 히든 노드는 최초 입력 노드 및 최후 출력 노드가 아닌 인공지 능 모델을 구성하는 노드들을 의미할 수 있다. 본 발명의 일 실시예에 따른 인공지능 모델은 입력 레이어의 노 드가 출력 레이어에 가까운 히든 레이어의 노드보다 많을 수 있으며, 입력 레이어에서 히든 레이어로 진행됨에 따라 노드의 수가 감소하는 형태의 인공지능 모델일 수 있다. 인공지능 모델은 하나 이상의 히든 레이어를 포함할 수 있다. 히든 레이어의 히든 노드는 이전의 레이어의 출력 과 주변 히든 노드의 출력을 입력으로 할 수 있다. 각 히든 레이어 별 히든 노드의 수는 동일할 수도 있고 상이 할 수도 있다. 입력 레이어의 노드의 수는 입력 데이터의 데이터 필드의 수에 기초하여 결정될 수 있으며 히든 노드의 수와 동일할 수도 있고 상이할 수도 있다. 입력 레이어에 입력된 입력 데이터는 히든 레이어의 히든 노 드에 의하여 연산될 수 있고 출력 레이어인 완전 연결 레이어(FCL: fully connected layer)에 의해 출력될 수 있다. 다양한 실시예에서, 인공지능 모델은 딥러닝(Deep learning) 모델일 수 있다. 딥러닝 모델(예를 들어, 딥 뉴럴 네트워크(DNN: deep neural network, 심층신경망)는 입력 레이어와 출력 레이 어 외에 복수의 히든 레이어를 포함하는 인공지능 모델을 의미할 수 있다. 딥 뉴럴 네트워크를 이용하면 데이터 의 잠재적인 구조(latent structures)를 파악할 수 있다. 즉, 사진, 글, 비디오, 음성, 음악의 잠재적인 구조 (예를 들어, 어떤 물체가 사진에 있는지, 글의 내용과 감정이 무엇인지, 음성의 내용과 감정이 무엇인지 등)를 파악할 수 있다. 딥 뉴럴 네트워크는 컨벌루셔널 뉴럴 네트워크(CNN: convolutional neural network), 리커런트 뉴럴 네트워크 (RNN: recurrent neural network), 오토 인코더(auto encoder), GAN(Generative Adversarial Networks), 제한 볼츠만 머신(RBM: restricted boltzmann machine), 심층 신뢰 네트워크(DBN: deep belief network), Q 네트워 크, U 네트워크, 샴 네트워크 등을 포함할 수 있으나, 이에 한정되지 않는다. 다양한 실시예에서, 서버는 네트워크를 통해 사용자 단말과 연결될 수 있으며, 본 발명의 다양 한 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 방법을 수행함에 따라 도출되는 결과를 사용자 단말 로 제공할 수 있다. 일례로, 사용자 단말은 소정의 공간에서 진행되는 응시자의 단말일 수 있다. 서버는 센서 데이터를 활용한 운동 자세 평가 방법을 수행함에 따라 산출되는 응시자들의 점수에 관한 정보를 사용자 단말로 제 공할 수 있다. 이에 따라 응시자는 승단 심사의 결과를 편리하게 확인할 수 있다. 또한, 응시자는 품새의 각 동 작 또는 신체 부위에 대한 점수도 확인할 수 있기 때문에, 심사 결과 내역을 투명하게 확인할 수 있으며, 그 결 과 심사 평가의 공정성과 신뢰성을 기대할 수 있다. 다른 예로, 사용자 단말는 소정의 공간(예를 들어, 승단 심사가 진행되는 경기장)에 배치되며, 소정의 공 간에서 진행되는 승단 심사에 관한 정보를 출력하는 디스플레이 장치일 수 있다. 서버는 센서 데이터를 활 용한 운동 자세 평가 방법을 수행함에 따라 산출되는 응시자들의 점수에 관한 정보를 사용자 단말로 제공 함으로써, 승단 심사를 관람하는 관람객들이 응시자들의 점수를 실시간으로 확인할 수 있다.여기서, 사용자 단말은 서버와 통신을 위한 메커니즘을 갖는 시스템에서의 임의의 형태의 엔티티 (들)를 의미할 수 있다. 예를 들어, 이러한 사용자 단말은 PC(personal computer), 노트북(note book), 모바일 단말기(mobile terminal), 스마트 폰(smart phone), 태블릿 PC(tablet pc) 및 웨어러블 디바이스 (wearable device) 등을 포함할 수 있으며, 유/무선 네트워크에 접속할 수 있는 모든 종류의 단말을 포함할 수 있다. 또한, 사용자 단말은 에이전트, API(Application Programming Interface) 및 플러그-인(Plug-in) 중 적어도 하나에 의해 구현되는 임의의 컴퓨팅 장치를 포함할 수도 있다. 또한, 사용자 단말은 애플리케 이션 소스 및/또는 클라이언트 애플리케이션을 포함할 수 있다. 또한, 여기서, 네트워크는 복수의 단말 및 서버들과 같은 각각의 노드 상호 간에 정보 교환이 가능한 연결 구조를 의미할 수 있다. 예를 들어, 네트워크는 근거리 통신망(LAN: Local Area Network), 광역 통신망 (WAN: Wide Area Network), 인터넷(WWW: World Wide Web), 유무선 데이터 통신망, 전화망, 유무선 텔레비전 통 신망 등을 포함할 수 있다. 무선 데이터 통신망은 3G, 4G, 5G, 3GPP(3rd Generation Partnership Project), 5GPP(5th Generation Partnership Project), LTE(Long Term Evolution), WIMAX(World Interoperability for Microwave Access), 와 이파이(Wi-Fi), 인터넷(Internet), LAN(Local Area Network), Wireless LAN(Wireless Local Area Network), WAN(Wide Area Network), PAN(Personal Area Network), RF(Radio Frequency), 블루투스(Bluetooth) 네트워크, NFC(Near-Field Communication) 네트워크, 위성 방송 네트워크, 아날로그 방송 네트워크, DMB(Digital Multimedia Broadcasting) 네트워크 등을 포함할 수 있으나, 이에 한정되지는 않는다. 일 실시예에서, 적어도 하나의 센서 모듈은 소정의 공간 내에 서로 다른 위치에 설치될 수 있으며, 소정의 공간에서 진행되는 격투기 경기를 스캔함에 따라 센서 데이터를 생성할 수 있다. 여기서, 도 1을 참조하면, 적어도 하나의 센서 모듈은 소정의 공간 내에 서로 다른 위치에 설치되는 적어 도 하나의 카메라 모듈일 수 있다. 적어도 하나의 센서 데이터는 적어도 하나의 카메라 모듈을 통해 소정의 공 간을 서로 다른 시점(point of view)으로 촬영함에 따라 생성되는 적어도 하나의 영상 데이터일 수 있다. 또한, 적어도 하나의 영상 데이터는 소정의 공간을 촬영한 복수의 프레임을 포함할 수 있다. 복수의 프레임은 일정 간 격으로 생성되기 때문에(예를 들어, 1초에 60장 프레임 생성), 프레임 간격을 이용해서 촬영한 시간을 산출할 수 있다. 다만, 이에 한정되지 않고, 라이다 센서 모듈을 통해 소정의 공간을 스캔함에 따라 생성되는 적어도 하나의 포 인트 클라우드 데이터 등 다양한 종류의 센서와 센서 데이터가 적용될 수 있다. 적어도 하나의 센서 모듈 의 구체적인 배치는 도 3을 참조하여 후술하도록 한다. 일 실시예에서, 외부 서버는 네트워크를 통해 서버와 연결될 수 있으며, 서버가 센서 데이 터를 활용한 운동 자세 평가 방법을 수행하기 위해 필요한 각종 정보 및 데이터를 저장 및 관리하거나, 서버 가 센서 데이터를 활용한 운동 자세 평가 방법을 수행함에 따라 도출된 결과를 제공받아 저장 및 관리할 수 있다. 예컨대, 외부 서버는 서버의 외부에 별도로 구비되는 저장 서버일 수 있으나, 이에 한정되 지 않는다. 이하, 도 2를 참조하여, 센서 데이터를 활용한 운동 자세 평가 방법을 수행하는 서버의 하드웨어 구성에 대해 설명하도록 한다. 도 2는 본 발명의 일 실시예에 따른 서버의 하드웨어 구성을 도시한 도면이다. 서버는 하나 이상의 프로세서, 프로세서에 의하여 수행되는 컴퓨터 프로그램을 로드(Load)하는 메모리, 버스 , 통신 인터페이스 및 컴퓨터 프로그램을 저장하는 스토리지를 포함할 수 있다. 여기서,"}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "item": 2, "content": "도 2에는 본 발명의 실시예와 관련 있는 구성요소들만 도시되어 있다. 따라서, 본 발명이 속한 기술분야의 통상 의 기술자라면 도 2에 도시된 구성요소들 외에 다른 범용적인 구성 요소들이 더 포함될 수 있음을 알 수 있다. 프로세서는 서버의 각 구성의 전반적인 동작을 제어한다. 프로세서는 CPU(Central Processing Unit), MPU(Micro Processor Unit), MCU(Micro Controller Unit), GPU(Graphic Processing Unit) 또는 본 발 명의 기술 분야에 잘 알려진 임의의 형태의 프로세서를 포함하여 구성될 수 있다. 또한, 프로세서는 본 발명의 실시예들에 따른 방법을 실행하기 위한 적어도 하나의 애플리케이션 또는 프 로그램에 대한 연산을 수행할 수 있으며, 서버는 하나 이상의 프로세서를 구비할 수 있다. 다양한 실시예에서, 프로세서는 프로세서 내부에서 처리되는 신호(또는, 데이터)를 일시적 및/또는 영구적으로 저장하는 램(RAM: Random Access Memory, 미도시) 및 롬(ROM: Read-Only Memory, 미도시)을 더 포 함할 수 있다. 또한, 프로세서는 그래픽 처리부, 램 및 롬 중 적어도 하나를 포함하는 시스템온칩(SoC: system on chip) 형태로 구현될 수 있다. 메모리는 각종 데이터, 명령 및/또는 정보를 저장한다. 메모리는 본 발명의 다양한 실시예에 따른 방 법/동작을 실행하기 위하여 스토리지로부터 컴퓨터 프로그램을 로드할 수 있다. 메모리에 컴퓨 터 프로그램이 로드되면, 프로세서는 컴퓨터 프로그램을 구성하는 하나 이상의 인스트럭션들을 실행함으로써 상기 방법/동작을 수행할 수 있다. 메모리는 RAM과 같은 휘발성 메모리로 구현될 수 있을 것 이나, 본 개시의 기술적 범위가 이에 한정되는 것은 아니다. 버스는 서버의 구성 요소 간 통신 기능을 제공한다. 버스는 주소 버스(address Bus), 데이터 버 스(Data Bus) 및 제어 버스(Control Bus) 등 다양한 형태의 버스로 구현될 수 있다. 통신 인터페이스는 서버의 유무선 인터넷 통신을 지원한다. 또한, 통신 인터페이스는 인터넷 통 신 외의 다양한 통신 방식을 지원할 수도 있다. 이를 위해, 통신 인터페이스는 본 발명의 기술 분야에 잘 알려진 통신 모듈을 포함하여 구성될 수 있다. 몇몇 실시예에서, 통신 인터페이스는 생략될 수도 있다. 스토리지는 컴퓨터 프로그램을 비 임시적으로 저장할 수 있다. 서버를 통해 영상 정보를 활용한 격투기 인공지능 판정 프로세스를 수행하는 경우, 스토리지는 영상 정보를 활용한 격투기 인공지능 판정 프로세스를 제공하기 위하여 필요한 각종 정보를 저장할 수 있다. 스토리지는 ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리 등과 같은 비휘발성 메모리, 하드 디스크, 착탈형 디스크, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터로 읽을 수 있는 기록 매체를 포함하여 구성될 수 있다. 컴퓨터 프로그램은 메모리에 로드될 때 프로세서로 하여금 본 발명의 다양한 실시예에 따른 방 법/동작을 수행하도록 하는 하나 이상의 인스트럭션들을 포함할 수 있다. 즉, 프로세서는 상기 하나 이상 의 인스트럭션들을 실행함으로써, 본 발명의 다양한 실시예에 따른 상기 방법/동작을 수행할 수 있다. 일 실시예에서, 컴퓨터 프로그램은 소정의 공간에서 진행되는 승단 심사의 응시자의 동작을 스캔함에 따라 적어도 하나의 센서 데이터를 수집하는 단계 및 기 학습된 인공지능 모델을 이용하여 수집된 적어도 하나의 센 서 데이터를 분석함에 따라 승단심사에 참여한 응시자에 대한 점수를 산출하고 합격/불합격을 판정하는 단계를 포함하는 센서 데이터를 활용한 운동 자세 평가 방법을 수행하도록 하는 하나 이상의 인스트럭션을 포함할 수 있다. 본 발명의 실시예와 관련하여 설명된 방법 또는 알고리즘의 단계들은 하드웨어로 직접 구현되거나, 하드웨어에 의해 실행되는 소프트웨어 모듈로 구현되거나, 또는 이들의 결합에 의해 구현될 수 있다. 소프트웨어 모듈은 RAM(Random Access Memory), ROM(Read Only Memory), EPROM(Erasable Programmable ROM), EEPROM(Electrically Erasable Programmable ROM), 플래시 메모리(Flash Memory), 하드 디스크, 착탈형 디스크, CD-ROM, 또는 본 발명이 속하는 기술 분야에서 잘 알려진 임의의 형태의 컴퓨터 판독가능 기록매체에 상주할 수도 있다. 본 발명의 구성 요소들은 하드웨어인 컴퓨터와 결합되어 실행되기 위해 프로그램(또는 애플리케이션)으로 구현 되어 매체에 저장될 수 있다. 본 발명의 구성 요소들은 소프트웨어 프로그래밍 또는 소프트웨어 요소들로 실행 될 수 있으며, 이와 유사하게, 실시 예는 데이터 구조, 프로세스들, 루틴들 또는 다른 프로그래밍 구성들의 조 합으로 구현되는 다양한 알고리즘을 포함하여, C, C++, 자바(Java), 어셈블러(assembler) 등과 같은 프로그래밍 또는 스크립팅 언어로 구현될 수 있다. 기능적인 측면들은 하나 이상의 프로세서들에서 실행되는 알고리즘으로 구현될 수 있다. 도 3은, 승단 심사가 진행되는 경기장에 복수의 센서 모듈이 설치된 배치를 위에서 아래로 내려다 본 도면이다. 도 3에 도시된 바와 같이, 소정의 공간 내에 8대의 센서 모듈이 설치될 수 있으나, 센서 모듈의 설치 위치와 설치 대수는 이에 한정되지 않는다. 8대의 센서 모듈은 전방, 후방, 좌측, 우측, 네 꼭지점에서 설 치되어, 응시자 모습을 서로 다른 각도로 촬영할 수 있다. 다양한 실시예에서, 센서 모듈은 지면을 기준으 로 약 1m 내지 1.5m 높이에 설치될 수 있으나, 이에 한정되지 않는다.이하, 도 4 내지 도 13을 참조하여, 서버에 의해 수행되는 센서 데이터를 활용한 운동 자세 평가 방법에 대해 구체적으로 설명하도록 한다. 도 4는 본 발명의 일 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 방법의 순서도이다 도 4을 참조하면, S100 단계에서, 서버는 승단 심사가 진행되는 소정의 공간에 대한 적어도 하나의 센서 데이터를 수집할 수 있다. 예컨대, 적어도 하나의 센서 모듈은 도 3에 도시된 바와 같이, 소정의 공간 내 에 서로 다른 위치, 각도 및 높이로 설치될 수 있으며, 서버는 소정의 공간 내의 설치된 적어도 하나의 센 서 모듈과 연결되어, 센서 모듈이 소정의 공간을 스캔함에 따라 생성되는 적어도 하나의 센서 데이터 를 수집할 수 있다. S200 단계에서, 서버는 S100 단계를 거쳐 수집된 적어도 하나의 센서 데이터를 분석함에 따라 소정의 공간 에서 진행되는 승단 심사에 대한 합격/불합격 판정을 수행할 수 있다. 여기서, 승단 심사에 대한 판정을 수행한 다는 것은 응시자의 품새 자세에 대한 점수를 산출하는 것을 의미할 수 있다. 다양한 실시예에서, 서버는 기 학습된 인공지능 모델을 이용하여 적어도 하나의 센서 데이터를 분석함에 따라 승단 심사에 참여한 응시자에게 부여하는 점수를 산출할 수 있다. 도 5는 다양한 실시예에서, 적어도 하나의 센서 데이터를 분석하여 응시자의 합격과 불합격을 판정하는 방법을 구체적으로 설명하기 위한 순서도 이다. 도 5를 참조하면, 센서 모듈로부터 적어도 하나의 센서 데이터(예를 들어, 영상 데이터)를 수집하는 S100 단계 다음으로, 서버는 적어도 하나의 센서 데이터로부터 적어도 하나의 객체를 검출할 수 있다(S210 단계). 도 6은 센서 데이터 내에서 적어도 하나의 객체를 검출하는 것을 예시적으로 도시한 도면이다. 도 6을 참조하면, 이미지에 포함된 복수의 응시자를 객체로 검출하고, 이를 경계 박스(Bouncing box)로 구분할 수 있다. 객체를 검출하는 방법으로서 머신러닝 알고리즘이 적용될 수 있으며, 구체적으로 CNN알고리즘, Faster R- CNN, R_FCN, FPN-FRCN, YOLO, SSD, RetinaNET이 적용될 수 있다. 다만, 본 발명은 상술한 알고리즘에만 한정되 지 않고, 이미지나 영상 내에서 객체를 검출할 수 있는 기술이라면 본 발명에 적용가능하다. S210 단계의 다음으로, 검출된 객체와 응시자 사이을 매칭할 수 있다(S220 단계). 검출된 객체와 심사자 사이의 매칭을 예시적으로 도시한 도 7을 참조하면, 경계 박스로 구분된 객체만을 분리하고, 이를 응시자와 매칭할 수 있다. 도 7에서는 예시적으로 제1 응시자의 매칭과 제2 응시자의 매칭을 위한 크롭(Crop)을 예시적으로 도시하 였다. 따라서, 본 발명의 다양한 실시예에 따르면 응시자 각각을 구분하여 독립적으로 데이터를 생성하기 때문 에, 복수의 응시자들이 동시에 승단 심사에 참가하더라도 각 응시자의 품새 동작을 정확하게 인식할 수 있다. S220 단계의 다음으로, 승단 심사에 참여한 응시자들에 대한 스켈레톤(Skeleton) 정보를 추출할 수 있다(S230 단계). 스켈레톤 정보는 응시자들의 신체에 대해 복수의 포인트 및 두 포인트를 잇는 선으로 표시한 것을 의미 할 수 있다. 보다 구체적으로, 영상 데이터로부터 스켈레톤 정보를 추출하는 방식을 도 8을 참조하여 설명하도록 한다. 도 8 의 좌측 도면은 프레임(11, 12, 13)에 표시된 응시자를 도시한 도면이고, 도 8의 우측 도면은 응시자에 대응하 는 스켈레톤 정보를 도시한 도면을 의미한다. 먼저, 영상 데이터는 복수의 프레임(11, 12, 13)으로 구성되 어 있고, 각 프레임에는 응시자의 자세가 시계열적으로 표시되어 있다. 스켈레톤 정보의 포인트는 신체의 부위와 대응되는 위치에 생성될 수 있다. 예를 들어, 머리 영역에 있어서 포 인트는 코(또는 인중)에 대응되는 부분을 나타낼 수 있고, 다른 포인트는 좌측(또는 우측) 귀(또는 관자놀이)에 대응되는 부분을 나타낼 수 있으며, 또 다른 포인트는 좌측(또는 우측) 눈에 대응되는 대응되는 부분을 나타낼 수 있고, 또 다른 포인트는 턱 끝에 대응되는 부분을 나타낼 수 있다. 다음으로, 팔 영역에 있어서, 포인트는 좌측(또는 우측) 팔꿈치에 대응되는 부분을 나타낼 수 있고, 다른 포인 트는 좌측(또는 우측) 손목에 대응되는 부분을 나타낼 수 있다. 위와 같은 방식으로 몸통 영역, 하체 영역을 포인트로 표시할 수 있고, 각 포인트는 에지(edge)라고 표현할 수 도 있다. 여기서, 영상 데이터(예컨대, 이미지)로부터 객체의 스켈레톤 정보를 추출하는 방법은 \"이철민, and 이동명. \" 욜로-오픈포즈 환경에서 사용자의 행동 인식을 위한 신체의 관절 좌표 추출에 관한 연구.\" 한국통신학회 학술대 회논문집 : 174-175.\" 및 \"조윤민, 이승규..머신러닝을 이용한 2차원 사람 관절 추출 및 Kinect를활용한 3차원 움직임 적용.한국정보과학회 학술발표논문집,1711-1713.\" 등 다양한 기술들이 공지되어 있고, 이 러한 공지 기술들을 선택적으로 적용할 수 있는 바, 본 명세서에서 스켈레톤 정보를 추출하는 구체적인 방법에 대해서는 서술하지 않는다. S230 단계의 다음으로, 응시자의 자세 정보(예를 들어, 신체 각도)를 스켈레톤 정보로부터 추출할 수 있다(S240 단계). 전술한 바와 같이 스켈레톤 정보는 두 포인트를 잇는 선을 포함하기 때문에, 선과 선 사이의 각도를 산 출함으로써, 신체 각도를 획득할 수 있다. 스켈레톤 정보로부터 신체 각도를 추출하는 것을 도 9를 참조하여 설명하도록 한다. 도 9에서는 예시적으로 몸 통과 양 팔사이의 각도와, 좌측 허벅지와 종아리 사이의 각도와, 양 허벅지 사이의 각도를 점선으로 도시하였다. 즉, 스켈레톤 정보에 포함된 선과 선 사이의 각도를 추출함으로써, 응시자의 신체 각도를 획득할 수 있다. 신체 각도를 추출하는 방식으로, 포인트와 선의 좌표 정보를 먼저 산출하고, 이 좌표 정보를 이용하여 각도를 산출하는 방식을 적용할 수 있다. 또한, 신체 각도를 추출할 때는 특정한 기술에 국한되지 않으며, 통상 의 기술자가 적용가능한 범위 내에 속하는 기술이라면 활용할 수 있다. S240 단계의 다음으로, 응시자의 신체 각도로부터 응시자의 동작을 분류할 수 있다(S250 단계). 신체 각도의 변 화량을 통해서 응시자의 동작을 인식할 수 있다. 예를 들어, 우측 상완과 전완의 각도(즉, 팔꿈치 각도)가 급격 히 증가하였다가 급격히 감소하였다면, 우측 팔이 펴졌다가 접은 것을 알 수 있고, 이를 앞지르기 동작으로 간 주할 수 있다. 프레임은 일정 간격으로 생성되기 때문에, 프레임 간격을 기반으로 시간을 산출할 수 있다. 따라 서, 소정의 동작이 시작된 프레임과, 소정의 동작이 종료된 프레임을 알 수 있다면, 소정의 동작에 소요된 시간 을 알 수 있다. 이에 따라 소정의 동작을 시간 별로 분류할 수 있다. 품새는 복수의 동작으로 이루어져 있기 때 문에, 품새의 각 동작 별로 응시자의 동작을 분류할 수 있다. 도 10의 (a)는 상술한 동작 분류를 예시적으로 표현한 표이다. 도 10의 (a)에서 1 ~ 3초 사이에서는 응시자는 앞차기를 시연하였다. 응시자의 무릎 관절을 중심으로 허벅지와 종아리 사이의 각도의 변화량을 통해 앞차기 여 부를 파악할 수 있다. 또한, 3 ~ 5초 사이에서는 응시자는 앞지르기를 시연하였다. 응시자의 상완과 전완 사이 의 각도의 변화량을 통해 앞지르기 여부를 파악할 수 있다. 또한, 5 ~ 7초 사이에서는 응시자는 막기를 시연하 였다. 응시자의 어깨 관절의 각도의 변화량을 통해 앞지르기 여부를 파악할 수 있다. 이와 같이 시간별 신체각 도를 통해서 품새의 동작을 인식하여 분류할 수 있다. S250 단계의 다음으로, 기준 데이터와 동작 별 신체 각도를 기반으로 동작 별 점수를 산출할 수 있다(S260 단계). 여기서 기준 데이터는 이상적인 품새 동작에서의 시간 별 신체 각도를 의미할 수 있다. 기준 데이터를 획득하는 방법의 일례로서, 숙련된 전문가의 품새 동작에 대한 영상 데이터를 생성하고, 앞서 설명한 S210 단계 내지 S250단계를 거쳐 전문가의 시간 별 신체 각도를 획득할 수 있다. 이러한 전문가의 시간 별 신체 각도는 기 준 데이터가 될 수 있다. 또한 다른 방법으로 품새의 이상적인 자세를 AI알고리즘을 통해서 생성하고, 이를 바 탕으로 시간 별 신체 각도를 획득할 수 있다. 기준 데이터의 획득 방법은 상술한 방법에 국한되지 않는다. 기준 데이터는 승단 심사의 규정에 따라 다양하게 변경될 수 있다. 기준 데이터는 시간 별 신체 각도를 포함하기 때 문에, 응시자의 시간 별 신체 각도와 비교할 수 있다. 비교 결과 응시자의 동작이 기준 데이터와 얼마나 일치하 느냐에 따라 각 동작의 점수가 결정된다. 예를 들어, 소정의 동작에 소요하는 시간과 소정의 동작시 신체 각도 가 기준 데이터와 일치하는 정도를 기반으로 점수가 결정되고, 도 10의 (b)에 도시된 것과 같이 각 동작 별로 점수가 결정될 수 있다. S260 단계의 다음으로, 응시자의 동작 별 점수를 합하여 총점을 산출하고, 이를 바탕으로 응시자의 합격 여부가 결정된다(S270 단계). 합격과 불합격의 기준은 승단 심사의 규정에 의해 결정된다. 본 발명의 일실시예에 따르면, 복수의 응시자가 승단심사에 참가하더라도 응시자마다 객체를 검출하고 판단하기 때문에, 평가심사위원이 순간적으로 응시자의 동작을 놓치더라도 놓친 동작을 누락되지 않고 정확하게 평가할 수 있다. 또한, 본 발명의 일실시예에 따르면, 응시자의 신체각도를 기반으로 동작을 판단하기 때문에 기존의 육안으로 평가하는 것 보다 높은 평가의 정확성을 확보할 수 있다. 또한, 본 발명의 일실시예에 따르면, 서버를 통해서 센서 모듈의 영상 데이터를 분석하기 때문에 판 정의 논란을 줄일 수 있고, 응시자의 이의제기시 각 점수의 근거를 명확하게 제시할 수 있기 때문에 판정의 높 은 공정성을 기대할 수 있다. 또한, 본 발명의 일실시예에 따르면, 응시자의 신체 각도를 기반으로 동작을 판단하기 때문에 기존의 육안으로 평가하는 것 보다 높은 평가의 정확성을 확보할 수 있다. 또한, 본 발명의 일실시예에 따르면, 이상적인 품새 자세를 기반으로 응시자의 자세를 평가하기 때문에 객관적 인 심사 평가가 가능하다. 도 11을 참조하여, 센서 데이터를 활용한 운동 자세 평가 방법을 수행하는 본 발명의 또 다른 실시예를 설명하 도록 한다. 도 11에 도시된 실시예에는 도 5에 도시된 S210 내지 S230 단계가 동일하게 적용될 수 있다. 다만 이에 한정되 는 것은 아니고, 응시자의 스켈레톤 정보를 추출할 수 있는 구성이라면 도 11에 도시된 실시예에 적용할 수 있 다. 응시자의 스켈레톤 정보를 추출한 다음으로, 복수의 프레임 별로 신체 각도를 산출할 수 있다(S241 단계), 앞서 설명한 도 5의 S240 단계와 같이 신체 각도를 산출할 수 있으며, 이외에 다른 신체 각도를 산출할 수 있는 구성 이 사용될 수도 있다. S241 단계에서 각 프레임 별로 신체 각도를 산출하였기 때문에, 프레임 간격을 기반으로 시계열 데이터를 구할 수 있다(S251 단계). 여기서 시계열 데이터는 시간에 따라 변화하는 신체 각도의 변화량으로 정의될 수 있다. 예를 들어, t=0에서 dt까지 총 2개의 프레임이 생성되었고, 제1 프레임 내에 우측 팔꿈치 각도가 180° 이고, 제2 프레임 내의 우측 팔꿈치 각도가 160°이라면, dt 동안에 60°만큼 팔꿈치 각도가 변화되었음을 확인할 수 있다. 이와 같이 각 프레임 사이의 신체 각도 변화량과 프레임 간격을 알고 있다면, 시간에 따른 신체 각도 변 화량을 산출할 수 있고, 이를 도 12에 도시된 것과 같은 시계열 데이터로 변환할 수 있다. 도 12의 상단의 그래 프는 우측 팔꿈치의 시계열 데이터 그래프이고, 하단의 그래프는 좌측 팔꿈치의 시계열 데이터의 그래프이다. S251 단계를 통해서 신체 각도에 대한 시계열 데이터를 산출할 수 있고, 이러한 시계열 데이터를 응시자의 신체 부위 별로(예를 들어, 우측 팔꿈치, 좌측 무릎) 구할 수 있다. S251 단계의 다음으로, 기준 데이터와 응시자의 시계열 데이터를 바탕으로 점수를 산출한다(S261 단계). 도 11 의 기준 데이터는 기 설정된 시계열 데이터를 포함할 수 있다. 그리고 기 설정된 시계열 데이터는 앞서 도 5의 S260 단계의 기준 데이터와 유사한 방식으로 생성할 수 있다. 즉, 기준 데이터에 포함된 시계열 데이터는 이상 적인 품새 동작에서 신체 각도의 변화량으로 이해할 수 있다. 기 설정된 시계열 데이터를 획득하는 방법의 일례 로서, 숙련된 전문가의 품새 동작에 대한 영상 데이터를 생성하고, 앞서 설명한 S210 단계 내지 S251단계를 거 쳐 전문가의 시계열적 데이터를 획득할 수 있다. 또한 다른 방법으로 품새의 이상적인 자세를 AI알고리즘을 통 해서 생성하고, 이를 바탕으로 시계열적인 신체 각도의 변화량을 획득할 수 있다. 기 설정된 시계열 데이터의 획득 방법은 상술한 방법에 국한되지 않으며, 승단 심사의 규정에 따라 다양하게 변경될 수 있다. 기준 데이터에 포함된 시계열 데이터는 시간에 따른 신체 각도의 변화량을 포함하기 때문에, 응시자의 시계열 데이터와 비교할 수 있다. 비교 결과 응시자의 동작이 기준 데이터와 얼마나 일치하느냐에 따라 각 동작의 점수 가 결정된다. 예를 들어, 신체 부위 별로 기준 시계열 데이터와 응시자의 시계열 데이터가 일치하는 정도를 기 반으로 점수가 결정되고, 도 13에 도시된 것과 같이 각 신체 부위 별로 점수가 결정된다. S261 단계의 다음으로, 응시자의 신체부위 별 점수를 합하여 총점을 산출하고, 이를 바탕으로 응시자의 합격 여 부가 결정된다(S271 단계). 합격과 불합격의 기준은 승단 심사의 규정에 의해 결정된다. 다음으로 도5의 S230 단계에서 추출된 스켈레톤 정보를 이용하여 응시자의 3차원 좌표 정보를 생성하고, 이를 본 발명의 다양한 실시예에 적용하는 방법을 설명한다. S230 단계에서 추출된 복수의 스켈레톤 정보를 이용하여 서버는 3차원 좌표 정보를 생성할 수 있다. 예컨 대, 센서 모듈은 복수의 카메라로 구성될 수 있고, 각 카메라는 특정 응시자를 서로 다른 각도에서 촬영할 수 있다. 서버는 특정 응시자를 서로 다른 시점(point of view)으로 촬영한 영상 데이터들로부터 추출된 스켈레톤 정보를 병합함으로써, 특정 선수에 대한 하나의 3차원 좌표 정보를 생성할 수 있다. 즉, 서버는 특정 객체에 대한 복수의 2차원 스켈레톤 정보를 이용하여 특정 객체에 대한 3차원 모델링을 수행할 수 있다. 다음으로 서버는 3차원 모델링 정보를 이용하여 응시자의 동작 정보를 추출할 수 있다. 여기서, 3차원 좌 표 정보로부터 추출되는 응시자의 동작 정보는 응시자의 움직임 및 행동에 관한 정보뿐만 아니라, 응시자가 현재 취하고 있는 자세에 관한 정보를 포함할 수 있다. 일례로, 서버는 특정 시점(time)에 특정 선수를 촬영함에 따라 생성된 영상 데이터들을 이용하여 3차원 좌 표 정보를 생성하고, 3차원 좌표 정보를 이용하여, 특정 시점에 특정 선수가 취하고 있는 자세를 판단하고, 특 정 응시자의 자세에 대한 3차원 좌표 정보를 기준 3차원 좌표 정보에 대비하여 자세를 평가할 수 있다. 여기서 기준 3차원 좌표 정보는 이상적인 품새 동작에 대응하는 3차원 좌표 정보를 의미할 수 있다. 다른 예로, 서버는 소정의 기간 동안에 특정 응시자를 촬영함에 따라 생성된 영상 데이터들을 이용하여 복 수의 3차원 좌표 정보를 생성하고, 복수의 3차원 좌표의 변화량을 이용하여 응시자에 대한 자세 정보를 추출할 수 있으며, 자세 정보를 시계열에 따라 분석함에 따라 소정 기간 동안의 특정 선수의 움직임 및 행동 정보를 판 단할 수 있다. 그리고 이를 기준 데이터에 포함된 시계열적인 3차원 좌표 정보에 대비하여, 응시자의 자세를 평 가할 수 있다. 다시 말해, 여기서 응시자의 3차원 좌표 정보는 시간에 따른 3차원 좌표 변화량을 포함할 수 있 고, 기준 데이터는 이상적인 품새 자세를 시연하는 중에 시간에 따라 변화되는 3차원 좌표 변화량을 포함할 수 있다. 전술한 센서 데이터를 활용한 운동 자세 평가 시스템과 방법은 도면에 도시된 순서도를 참조하여 설명하였다. 간단한 설명을 위해 센서 데이터를 활용한 운동 자세 평가 시스템은 일련의 블록들로 도시하여 설명하였으나, 본 발명은 상기 블록들의 순서에 한정되지 않고, 몇몇 블록들은 본 명세서에 도시되고 시술된 것과 상이한 순서 로 수행되거나 또는 동시에 수행될 수 있다. 또한, 본 명세서 및 도면에 기재되지 않은 새로운 블록이 추가되거 나, 일부 블록이 삭제 또는 변경된 상태로 수행될 수 있다."}
{"patent_id": "10-2024-0068321", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 3, "content": "이상, 첨부된 도면을 참조로 하여 본 발명의 실시예를 설명하였지만, 본 발명이 속하는 기술분야의 통상의 기술 자는 본 발명이 그 기술적 사상이나 필수적인 특징을 변경하지 않고서 다른 구체적인 형태로 실시될 수 있다는 것을 이해할 수 있을 것이다. 그러므로, 이상에서 기술한 실시예들은 모든 면에서 예시적인 것이며, 제한적이 아닌 것으로 이해해야만 한다."}
{"patent_id": "10-2024-0068321", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 본 발명의 일 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 시스템을 도시한 도면이다. 도 2는 본 발명의 일 실시예에 따른 센서 데이터를 활용한 운동 자세 평가 방법을 수행하는 서버의 하드웨어 구 성을 도시한 도면이다. 도 3은 본 발명의 다양한 실시예에서, 승단심사가 진행되는 경기장에 적어도 하나의 센서 모듈이 설치된 배치 구조를 예시적으로 도시한 도면이다. 도 4는 본 발명의 일 실시예에 따른 영상 데이터를 활용한 운동 자세 평가 방법의 순서도이다. 도 5는 본 발명의 다양한 실시예에서, 적어도 하나의 센서 데이터를 분석하여 응시자의 합격, 불합격을 판정하는 방법을 구체적으로 설명하기 위한 순서도이다. 도 6은 본 발명의 다양한 실시예에서, 영상 데이터 내에서 적어도 하나의 객체를 검출하는 것을 예시적으로 도 시한 도면이다. 도 7은 본 발명의 다양한 실시예에서, 검출된 객체와 응시자 사이를 매칭하는 것을 예시적으로 도시한 도면이다. 도 8은 본 발명의 다양한 실시예에서, 영상 데이터로부터 추출된 스켈레톤 정보를 예시적으로 도시한 도면이다. 도 9는 본 발명의 다양한 실시예에서, 2차원 스켈레톤 정보에서 신체 각도를 추출하는 것을 예시적으로 도시한 도면이다. 도 10은 본 발명의 다양한 실시예에서, 응시자의 동작을 구분하는 것과 점수를 산출하는 것을 예시적으로 도시 한 도면이다. 도 11은 본 발명의 다양한 실시예에서, 복수의 영상 데이터를 이용하여 점수를 산출하는 방법을 설명하기 위한 순서도이다. 도 12는 본 발명의 다양한 실시예에서, 응시자의 신체 부위별 시계열적 데이터를 도시한 도면이다 도 13은 본 발명의 다양한 실시예에서, 신체부위 별로 산출한 점수표를 도시한 도면이다."}
