{"patent_id": "10-2019-0106365", "section": "특허_기본정보", "subsection": "특허정보", "content": {"공개번호": "10-2021-0026092", "출원번호": "10-2019-0106365", "발명의 명칭": "스마트 에어로졸 발생장치", "출원인": "주식회사 이노아이티", "발명자": "권중학"}}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_1", "content": "에어로졸을 발생시키는 장치에 있어서, 액상을 충전하는 액상 카트리지와; 액상 카트리지에 충전된 액상을 기화시키는 히터와; 히터에 전기적 신호를 발생시키는 히터부와; 사용환경을 인식하는 적어도 하나의 센서와:사용자의 사용 패턴을 인식하는 적어도 하나의 센서와;사용환경을 인식하는 센서로부터 입력되는 신호 및/또는 사용자의 사용 패턴을 인식하는 센서로부터 입력되는신호에 따라 연무량을 보정하도록 히터부를 제어하는 마이크로컨트롤러;를 포함하는 것을 특징으로 하는 스마트에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_2", "content": "제1항에 있어서,사용환경을 인식하는 센서로 온도센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_3", "content": "제1항에 있어서,사용환경을 인식하는 센서로 습도센서를 구비하는 것을 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_4", "content": "제1항에 있어서,사용환경을 인식하는 센서로 액상 카트리지에 충전된 액상의 잔량을 인식하는 잔량인식센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_5", "content": "제4항에 있어서,잔량인식센서는 광학을 이용해 액상의 잔량을 인식하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_6", "content": "제5항에 있어서,잔량인식센서는 발광부와 수광부를 구비하고 발광부를 통해 입사된 빛이 잔량의 액상에 의해 산란되고 수광부로수광된 광량을 통해 액상 잔량을 인식하는 것을 특징으로 하는 스마트 에어로졸 발생장치.공개특허 10-2021-0026092-2-청구항 7 제1항에 있어서, 사용환경을 인식하는 센서로 에어로졸의 맛을 센싱하는 가스센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_8", "content": "제7항에 있어서,가스센서는 탄맛을 센싱하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_9", "content": "제1항에 있어서,사용환경을 인식하는 센서로 에어로졸의 향을 센싱할 수 있는 향감지센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_10", "content": "제9항에 있어서,마이크로컨트롤러는 향감지센서에서 입력된 신호에 따라 감지된 향 성분이 기설정된 향 성분과 다르다고 판단되는 경우는 히터가 동작하지 않도록 제어하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_11", "content": "제1항에 있어서,사용자의 사용 패턴을 인식하는 센서로 사용자의 흡입을 인식하는 압력센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_12", "content": "제11항에 있어서,마이크로컨트롤러는 압력센서에서 감지된 신호에 따라 압력의 변화를 판단하고 이에 따라 사용자의 흡입압력,흡입시간, 흡입간격 등의 사용자 패턴에 대한 정보를 내부 메모리에 저장하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_13", "content": "제11항에 있어서,마이크로컨트롤러는 압력센서로부터 입력되는 신호에 따라 사용자의 흡입 유무를 판단하여 사용자가 흡입하는동안의 전력량과 사용자가 흡입하지 않고 대기하는 동안의 전력량을 구분하여 연무량을 조절하는 것을 특징으로하는 스마트 에어로졸 발생장치.공개특허 10-2021-0026092-3-청구항 14 제11항에 있어서,마이크로컨트롤러는 압력센서로부터 입력되는 신호에 따라 사용자의 흡입 유무를 판단하여 사용자가 흡입시작하는 시간부터 전력을 인가하되 전체 전력인가 시간을 조절하여 연무량을 조절하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_15", "content": "제14항에 있어서,마이크로컨트롤러는 사용자가 흡입시작하는 시간부터 흡입이 끝난 시간까지 전력을 인가하되 흡입시작과 흡입이끝날 때의 판단이 되는 기준압력 크기설정을 변경하여 연무량을 조절하는 것을 특징으로 하는 스마트 에어로졸발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_16", "content": "제1항에 있어서,사용자의 사용 패턴을 인식하는 센서로 연무량감지센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_17", "content": "제16항에 있어서,연무량감지센서는 기류 통로의 소정 위치에 설치되어 발광부와 수광부를 구비하고 발광부에서 입사하여 수광부에 수광되는 광량에 의해 연무량을 감지하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_18", "content": "제1항에 있어서,사용환경을 인식하는 센서로 온도센서, 습도센서, 액상 카트리지에 충전된 액상의 잔량을 인식하는 잔량인식센서, 에어로졸의 맛을 센싱하는 가스센서, 에어로졸의 향을 센싱할 수 있는 향감지센서를 구비하고 사용자의 사용 패턴을 인식하는 센서로 사용자의 흡입을 인식하는 압력센서, 연무량감지센서를 구비하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_19", "content": "제18항에 있어서,마이크로컨트롤러는 압력센서에서 감지된 신호에 따라 압력의 변화를 판단하고 이에 따라 사용자의 흡입압력,흡입시간, 흡입간격 등의 사용자 패턴에 대한 정보를 내부 메모리에 저장하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_20", "content": "제18항에 있어서,마이크로컨트롤러는 압력센서로부터 입력되는 신호에 따라 사용자의 흡입 유무를 판단하여 사용자가 흡입하는공개특허 10-2021-0026092-4-동안의 전력량과 사용자가 흡입하지 않고 대기하는 동안의 전력량을 구분하여 연무량을 조절하는 것을 특징으로하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_21", "content": "제18항에 있어서,마이크로컨트롤러는 압력센서로부터 입력되는 신호에 따라 사용자의 흡입 유무를 판단하여 사용자가 흡입시작하는 시간부터 전력을 인가하되 전체 전력인가 시간을 조절하여 연무량을 조절하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_22", "content": "제21항에 있어서,마이크로컨트롤러는 사용자가 흡입시작하는 시간부터 흡입이 끝난 시간까지 전력을 인가하되 흡입시작과 흡입이끝날 때의 판단이 되는 기준압력 크기설정을 변경하여 연무량을 조절하는 것을 특징으로 하는 스마트 에어로졸발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_23", "content": "제1항 내지 제22항 중 어느 하나의 항에 있어서,마이크로컨트롤러는 사용환경을 인식하는 센서 및/또는 사용자의 사용 패턴을 인식하는 센서로부터 입력되는 신호에 따라 연무량을 예측하고 이에 따라 연무량을 보정하기 위해 히터부를 제어하는 것을 특징으로 하는 스마트에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_24", "content": "제1항 내지 제22항 중 어느 하나의 항에 있어서, 사용환경을 인식하는 센서의 센싱값과 사용자의 사용 패턴을 인식하는 센서의 센싱값을 마이크로컨트롤러에 내장된 메모리 또는 별도의 메모리에 저장하고, 사용자의 평가를 수집, 저장하여 인공지능 학습을 통해 여러 종류의 사용환경을 인식하는 센서의 센싱값과 사용자의 사용 패턴을 인식하는 센서의 센싱값의 여러가지 조합에 대해 최적의 연무량을 산출하도록 인공지능 학습을 하고 학습된 정보는 메모리에 저장하는 것을 특징으로 하는 스마트 에어로졸 발생장치."}
{"patent_id": "10-2019-0106365", "section": "청구범위", "subsection": "청구항", "claim_number": "청구항_25", "content": "제24항에 있어서 무선통신모듈을 구비하고 스마트폰과 무선통신을 하여 앱을 이용해 실시간으로 인공지능 학습을 하는 것을 특징으로 하는 스마트 에어로졸 발생 장치."}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "요약", "paragraph": 1, "content": "본 발명은 액상 카트리지를 구비한 에어로졸 발생장치에 관한 것으로, 보다 상세하게는 사용 환경 및/또는 사용 자의 패턴에 따라 연무량을 보정할 수 있으며 인공지능 학습에 의해 사용자의 기호에 맞추어 최적으로 연무량을 자동 조절할 수 있는 에어로졸 발생장치에 관한 것이다. 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치 는 에어로졸을 발생시키는 장치에 있어서, 액상을 충전하는 액상 카트리지와; 액상 카트리지에 충전된 액상을 기 화시키는 히터와; 히터에 전기적 신호를 발생시키는 히터부와; 사용환경을 인식하는 센서와: 사용자의 사용 패턴 을 인식하는 센서와; 사용환경을 인식하는 센서로부터 입력되는 신호 및/또는 사용자의 사용 패턴을 인식하는 센 서로부터 입력되는 신호에 따라 연무량을 보정하도록 히터부를 제어하는 마이크로컨트롤러;를 포함한다."}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "기술분야", "paragraph": 1, "content": "본 발명은 액상 카트리지를 구비한 에어로졸 발생장치에 관한 것으로, 보다 상세하게는 사용환경 및/또는 사용 자의 패턴에 따라 연무량을 보정할 수 있으며 인공지능 학습에 의해 사용자의 기호에 맞추어 최적으로 연무량을자동 조절할 수 있는 에어로졸 발생장치에 관한 것이다."}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "배경기술", "paragraph": 1, "content": "에어로졸은 대기 중에 부유상태로 존재하는 액체 또는 고체의 작은 입자로 보통 0.001 ~ 1.0 ㎛의 크기를 갖는 다. 특히 여러 종류의 액상으로부터 유래하는 에어로졸을 다양한 목적으로 사람이 흡입하는 경우가 있는데, 예 를 들어 질병 치료용으로 네블라이져가 알려져 있다. 일반적으로 에어로졸을 전기가열식으로 발생시키는 장치는, 휴대하고 사용하기 편리하도록, 배터리 및 제어 전 자기기를 포함하고, 에어로졸을 형성하기 위한 액상을 저장하는 카트리지(cartridge)와, 전기로 작동하는 무화 기(atomizer)로 이루어진다. 이러한 카트리지와 무화기가 하나의 어셈블리로 결합된 것을 \"카토마이저 (cartomizer)\"라고 칭한다. 이러한 종래의 카토마이저에 관한 기술문헌으로 대한민국 등록특허공보 10- 1081481가 개시되어 있으며, 도 1을 참조하면 액상탱크와 무화기부에 구비되어 심지를 통해 전달되는 액상 에센스를 가열하여 기화시키는 가열 요소와 가열 요소에 전기적으로 연결되는 전원단자부와 심지 를 통해 액상 에센스가 과다하게 유입되는 경우 과다하게 유입된 에센스를 흡수하는 역할을 하는 솜뭉치 와 가열 요소에 의해 기화되는 연기가 유동되는 연기유동관체를 포함하는 구성이 개시되어 있다. 그러나, 상기와 같은 종래기술은 외부환경, 액상탱크의 액상의 잔량 등 사용환경에 따라 가열요소에 의해 기화되는 연무 량이 변화될 수 있으며, 또한 사용간격, 사용시간, 흡입 압력 같은 사용자의 패턴에 따라 연무량을 조절하는 기 능이 없어서 사용자에게 만족스러운 흡입감을 제공하기 어려운 문제점이 있다. 선행기술문헌 특허문헌 (특허문헌 0001) 대한민국 등록특허공보 10-1081481"}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "해결하려는과제", "paragraph": 1, "content": "본 발명은 사용환경 및/또는 사용자의 사용패턴에 의해 달라지는 연무량을 조절할 수 있는 에어로졸 발생장치를 제공하는 것을 목적으로 한다. 본 발명은 사용환경 또는 사용자의 사용패턴을 센싱하고 이로인해 달라지는 연무량을 예측하여 사용자의 인지없 이 자동으로 연무량을 보정해 줄 수 있는 에어로졸 발생장치를 제공하는 것을 목적으로 한다. 본 발명은 인공지능 학습을 통해 사용자의 최적의 기호에 맞추어 자동으로 연무량을 피팅(fitting)하는 에어로 졸 발생장치를 제공하는 것을 목적으로 한다."}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "과제의해결수단", "paragraph": 1, "content": "본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치는 에어로졸을 발생시키는 장치에 있어서, 액상을 충전하 는 액상 카트리지와; 액상 카트리지에 충전된 액상을 기화시키는 히터와; 히터에 전기적 신호를 발생시키는 히 터부와; 사용환경을 인식하는 센서와: 사용자의 사용 패턴을 인식하는 센서와; 사용환경을 인식하는 센서로부터 입력되는 신호 및/또는 사용자의 사용 패턴을 인식하는 센서로부터 입력되는 신호에 따라 연무량을 보정하도록 히터부를 제어하는 마이크로컨트롤러;를 포함한다."}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "발명의효과", "paragraph": 1, "content": "본 발명은 사용환경 및/또는 사용자의 사용패턴에 의해 달라지는 연무량을 조절할 수 있는 에어로졸 발생장치를 제공할 수 있다. 본 발명에 따르면 사용환경 및/또는 사용자의 사용패턴을 센싱하고 이로인해 달라지는 연무량을 예측하여 사용 자의 인지없이 자동으로 연무량을 보정해주는 에어로졸 발생장치를 제공할 수 있다. 본 발명에 따르면 인공지능 학습을 통해 사용자의 최적의 기호에 맞추어 자동으로 연무량을 피팅(fitting)하는 에어로졸 발생장치를 제공할 수 있다."}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 1, "content": "이하 첨부 도면을 참조하여 본 발명에 대해 상세히 설명한다. 도 2는 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치를 설명하기 위한 개략적인 단면도이다. 도 3은 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치를 설명하기 위한 블럭도이다. 도 2 내지 도 3을 참조하면, 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치는 액상을 충전하는 액 상 카트리지와 액상 카트리지에 충전된 액상을 기화시키는 히터와 히터에 전기적 신호를 발생 시키는 히터부와 히터부를 제어하는 마이크로컨트롤러를 포함한다. 공기 흡입구으로부터 들어 온 공기는 통로를 통과하고 히터부를 통해 이송부로 들어간다. 사용자는 액상 카트리지에 충전 된 액상이 히터에 의해 가열되어 기화되면서 발생하는 에어로졸을 액상 카트리지에 구비되어 이송부 를 통해 히터와 연통된 기류 통로를 통해 흡입할 수 있다. 히터는 히터부를 통해 배터리 의 전력이 인가되는데 실시예에 따라 히터부는 히터 및 마이크로컨트롤러와 전기적으로 연결되 는 FET를 포함하여, 마이크로컨트롤러에서 출력되는 PWM신호에 따라 온오프(On-Off)되면서 히터에 공급 되는 전력을 제어할 수 있으며 이에 따라 연무량을 조절할 수 있다. 스마트 에어로졸 발생장치는 사용환 경을 인식하는 센서를 구비하며, 실시예에 따라 사용환경을 인식하는 센서는 온도센서이며, 마이크로컨트롤 러는 온도센서에 의해 감지된 신호에 따라 온도 변화를 판단하여 기설정된 온도 변화에 따라 보정해야 하는 연무량 데이터에 따라 연무량을 보정하도록 히터부로 출력하는 PWM신호를 조절하여 히터부를 제어 한다. 실시예에 따라 사용환경을 인식하는 센서는 습도센서이며, 마이크로컨트롤러는 습도센서에 의해 감지된 신호에 따라 습도 변화를 판단하여 기설정된 습도 변화에 따라 보정해야 하는 연무량 데이터에 따 라 연무량을 보정하도록 히터부로 출력하는 PWM신호를 조절하여 히터부를 제어한다. 실시예에 따라 사 용환경을 인식하는 센서는 액상의 잔량을 인식하기 위한 잔량인식센서이며, 예를 들어 잔량인식센서는 광학을 이용하여 액상 잔량을 인식하는 센서로서 액상 카트리지의 내면 또는 외면의 소정 위치에 설치될 수 있다. 실시예에 따라 잔량인식센서는 발광부와 수광부를 구비하며 발광부를 통해 입사된 빛이 잔량의 액상 에 의해 산란되고 수광부로 수광된 광량을 통해 액상 잔량을 인식할 수 있다. 마이크로컨트롤러는 잔량인식 센서에 의해 감지된 신호에 따라 액상 잔량 변화를 판단하여 기설정된 액상 잔량 변화에 따라 보정해야 하 는 연무량 데이터에 따라 연무량을 보정하도록 히터부로 출력하는 PWM신호를 조절하여 히터부를 제어한 다. 실시예에 따라 사용환경을 인식하는 센서는 에어로졸의 맛을 센싱하기 위한 가스센서이며, 가스센서 는 에어로졸의 기체 성분을 감지하며, 예를 들어 감지되는 기체성분 이나 기체 성분의 비율에 따라 에어로 졸의 맛을 센싱한다. 만약 탄맛이 날 때 발생하는 특정 가스 성분이 감지되면 가스센서는 탄맛을 센싱할 수 있다. 마이크로컨트롤러는 가스센서에 의해 감지된 신호에 따라 예를 들어 탄맛이 감지되면 기설정된 데이터에 따라 연무량을 보정하도록 히터부로 출력하는 PWM신호를 조절하여 히터부를 제어한다. 실시예 에 따라 사용환경을 인식하는 센서는 에어로졸의 향을 센싱할 수 있는 향감지센서이며, 예를 들어 향 성분 또는 향 성분 비율에 따른 신호를 발생한다. 마이크로컨트롤러는 향감지센서에서 입력된 신호에 따라 기설정된 향 성분 또는 향 성분 비율에 따라 보정해야 하는 연무량 데이터에 따라 연무량을 보정하도록 히터부 로 출력하는 PWM신호를 조절하여 히터부를 제어하거나 향감지센서에서 입력된 신호에 따라 감지된 향 성분이 기설정된 향 성분과 다르다고 판단되는 경우는 히터부로 출력하는 PWM신호를 차단하여 히터가 동작하지 않도록 제어한다. 또한 스마트 에어로졸 발생장치는 사용자의 사용 패턴을 인식하는 센서를 구비하며, 실시예에 따라 사용자 의 사용 패턴을 인식하는 센서는 사용자의 흡입을 인식하기 위한 압력센서이며, 실시예에 따라 압력센서 는 히터부와 연통되고 마이크로컨트롤러와 전기적으로 연결된다. 마이크로컨트롤러는 압력센서 에서 감지된 신호에 따라 압력의 변화를 판단하고 이에 따라 사용자의 흡입압력, 흡입시간, 흡입간격 등의 사용자 패턴에 대한 정보를 내부 메모리에 저장하고 기설정된 데이터에 따라 연무량을 보정하도록 히터부로 출력하는 PWM신호를 조절하여 히터부를 제어할 수 있다. 마이크로컨트롤러는 압력센서로부터 입력 되는 신호에 따라 사용자의 흡입 유무를 판단하여 사용자가 흡입하는 동안의 전력량과 사용자가 흡입하지 않고 대기하는 동안의 전력량을 구분하여 연무량을 조절할 수 있다. 예를 들어 사용자가 흡입하는 동안에는 히터부 에 출력하는 PWM신호를 조절하여 연무량을 증가시키고 사용자가 흡입하지 않고 대기하는 동안은 히터부(3 0)에 출력하는 PWM신호를 조절하여 연무량을 감소시킬 수 있다. 또한 마이크로컨트롤러는 압력센서로 부터 입력되는 신호에 따라 사용자의 흡입 유무를 판단하여 사용자가 흡입시작하는 시간부터 전력을 인가하되 전체 전력인가 시간을 조절하여 연무량을 조절할 수 있으며, 사용자가 흡입시작하는 시간부터 흡입이 끝난 시간 까지 전력을 인가하되 흡입시작과 흡입이 끝날 때의 판단이 되는 기준압력 크기설정을 변경하여 연무량을 조절 하는 것도 가능하다. 실시예에 따라 사용자의 사용 패턴을 인식하는 센서는 연무량감지센서이며, 예를 들어 연무량감지센서는 기류 통로의 소정 위치에 설치되어 발광부와 수광부를 구비하고 발광부에서 입사하여 수광부에 수광되는 광량에 의해 연무량을 감지한다. 마이크로컨트롤러는 연무량측정센서에 의해 감지된 신호에 따라 연무량 변화를 판단하여 기설정된 데이터에 따라 연무량을 보정하도록 히터부로 출력하는 PWM 신호를 조절하여 히터부를 제어한다. 또한 마이크로컨트롤러는 상술한 실시예들에 따른 사용환경을 인식하는 센서 및/또는 사용자의 사용 패턴을 인식하는 센서로부터 입력되는 신호에 따라 기설정된 데이터에 의해 연무량을 예측하고 이에 따라 연무량을 보 정하기 위해 히터부에 출력하는 PWM신호를 조절하여 히터부를 제어해서 배터리로부터 히터에 공급되는 전력을 조절할 수 있다. 또한 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치는 상술한 여러 종류의 사용환경을 인식하는 센서의 센싱값과 사용자의 사용 패턴을 인식하는 센서의 센싱값을 마이크로컨트롤러에 내장된 메모리 또는 별도의 메모리에 저장하고, 사용자의 평가 정보를 수집, 저장하여 예를 들어 딥 러닝같은 인공지능 학습을 통해 상술한 여러 종류의 사용환경을 인식하는 센서의 센싱값과 사용자의 사용 패턴을 인식하는 센서의 센싱값의 여 러가지 조합에 대해 최적의 연무량을 산출하도록 인공지능 학습을 하고 학습된 정보는 메모리에 저장한다. 또한 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치는 지그비(ZigBee) 방식 통신모듈 이나 블루투 스(Bluetooth) 방식 통신모듈 같은 무선통신모듈을 구비하고 스마트폰과 무선통신을 할 수 있으며, 예 를 들어 상술한 여러 종류의 사용환경을 인식하는 센서의 센싱값과 사용자의 사용 패턴을 인식하는 센서의 센싱 값, 사용자의 평가 정보를 스마트폰에 전송하고 스마트폰에서 인공지능 학습 앱을 이용해 상술한 여 러 종류의 사용환경을 인식하는 센서의 센싱값과 사용자의 사용 패턴을 인식하는 센서의 센싱값의 여러가지 조 합에 대해 최적의 연무량을 산출하도록 실시간으로 인공지능 학습을 하고 학습된 정보는 무선통신을 통해 스마 트 에어로졸 발생장치에 전송하여, 사용자가 스마트 에어로졸 발생장치를 사용하여 에어로졸을 흡입 할 때 인공지능 학습에 의한 다양한 환경에 따른 최적의 연무량으로 보정하도록 할 수 있다. 본 발명은 상술한 특정의 바람직한 실시예에 한정되지 아니하며, 청구범위에서 청구하는 본 발명의 요지를 벗어"}
{"patent_id": "10-2019-0106365", "section": "발명의_설명", "subsection": "발명을실시하기위한구체적인내용", "paragraph": 2, "content": "남이 없이 당해 발명이 속하는 기술분야에서 통상의 지식을 가진 자라면 누구든지 다양한 변형실시가 가능한 것 은 물론이고, 그와 같은 변경은 청구범위 기재의 범위 내에 있게 된다."}
{"patent_id": "10-2019-0106365", "section": "도면", "subsection": "도면설명", "item": 1, "content": "도 1은 종래 기술을 설명하기 위한 도면이다. 도 2는 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치를 설명하기 위한 개략적인 단면도이다. 도 3은 본 발명의 일 실시예에 따른 스마트 에어로졸 발생장치를 설명하기 위한 블럭도이다."}
